[{"category": "", "categoryclass": "", "imagename": "95d481a960145889e7b065f3842e3109.png", "infoid": 1015680, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一大堆组件和符号，以符合每一个现代网页设计项目的要求。\n准备好使用组件、符号、图标和样式进行快速迭代，并在几分钟内测试每个想法。\n锁定或约束启用的流体元素，可轻松调整大小并放入可用空间内。\n完全组织的组件，可直接在您最喜欢的原型工具中使用。插入、编辑和使用-就这么简单。", "note_en": "A large stack of components and symbols to match with every modern web design project requirement.\n  Ready to use components, symbols, icons, and styles for quick iterations and testing every idea within minutes.\n  Pinning or constraint enabled fluid elements, that can easily resize and fit inside within the available space.\n  Fully organized components which are available right inside your favorite prototyping tools. Insert, edit, and use - it’s that easy.", "posttime": "2020-08-02 07:27:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,system,组件", "title": "面向繁忙设计师的设计系统UI套件-适用于Sketch、Figma和XD", "title_en": "Design System UI Kit for Busy Designers – Available for Sketch, Figma and XD", "transed": 1, "url": "https://rev.webkul.design/kit/", "via": "", "real_tags": ["设计", "system", "组件"]}, {"category": "", "categoryclass": "", "imagename": "1c99d9965237133b9c58e9c12a6d1fbd.jpg", "infoid": 1015679, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们知道您正在使用的电脑比桌上的水瓶更值钱。这只是我们天生就知道的事情。为什么？因为我们过去可能是买水的，所以我们认识到了电脑的价格。我们明白，我们从电脑中获得的价值比从一瓶水中获得的价值更大。每个人都有一个内置的价值测量仪，我们在其中评价产品(或服务)。相比较而言。\n现在，假设我把你放在沙漠中央，两天内不给你水。突然，水瓶的价值攀升到了你的计价器的顶端。\n当你直接问一个人愿意花多少钱买一瓶水时，他们指的是他们的计价器。他们给你的答案是基于预期和比较，而不是基于他们可能会有多大的潜在价值。这种情况使得一个人很难承认你的产品的真正价值。\n当你的产品是一种创新，没有有效的比较，或者你的产品提供的价值远远高于市场上的任何替代品时，就会出现这种现象。客户突然没有准确的温度计来测量你的产品，当直接询问时，他们通常会给你一个低得多的价位。\n经济学家和心理学家对这一现象的研究由来已久。对于任何初创公司来说，有很多方法可以收集关于这个举世闻名的问题的信息：我应该给我的产品定价多少？\n我们可以通过在一定范围内问客户间接问题来利用这一现象。\n我最喜欢的技术之一，我相信效果很好，是范韦斯特恩多普方法，也就是众所周知的价格敏感度计法。这是一系列4个简单的问题，你可以问你的客户来确定一个价格范围，在这个范围内，你的产品价格与你提供的产品的实际价值相匹配。\n那么，有什么更好的方式将这些问题放在调查中，并询问足够多的人呢？如果你调查，比方说，150个潜在客户，你会发现一个由消费者价值决定的相当准确的价格范围。够简单吗？让我们开始吧。\n第一步是确保客户了解您的产品。考虑向客户提供演示、共享视频或向他们展示您的产品的详细图片。你可以把这个放在你的调查的首位。为了我们的目的，让我们给这个美味的陀螺仪拍一张照片。既然一张照片胜过千言万语，我想给这个陀螺仪定价会相当不错。\n你会问的第一个问题是，在什么特定的价位，这种陀螺方式太贵了，你永远不会考虑购买它？\n然后你会问这个陀螺仪的具体价位是多少，但你还是会考虑买它？\n请注意，答案将给我们一个价格范围，而不是一个固定价格。通过在范围内回答，人们倾向于放弃他们的价值谱，而是决定产品对他们有多大价值的界限。到目前为止，这种技术是通过调查确定产品真正基于价值的价格的最准确的方法之一。\n查看30多个用户的数据，我们会得到如下所示的累积图。\n从上面的调查结果来看，(在撰写本文时大约有30个条目。)。我们注意到，基于价值的最佳价格范围在2.5美元到3.5美元之间。售价2.5美元的陀螺仪大约有15%的人认为它既昂贵又太便宜。最优价格应该是3美元一英镑太贵和一英镑太便宜的交汇点。当然，这只是一个定价指标，纯粹是根据你调查的人群而定的！？\n对于任何感兴趣的人，我在这里创建了陀螺仪调查(请随意接受！)。我已经设置了一个实时更新定价工作表来配合使用。\n随时为您自己的产品定价之旅复制一份，祝您的产品定价之旅好运。", "note_en": "We know that the computer you are using is  worth more than the water bottle that is on the table. That is just something we inherently know.  Why? Because we probably purchased water in the past, we recognize the price of a computer. We understand that we get more value out of the computer than the bottle of water. Every human has a built-in value meter in which we value products (or services!) comparatively.\n Now, assume I put you in the middle of the desert and don&#39;t give you water for two days. Suddenly the value of the water bottle climbs to the top of your value meter.\n  When you ask a person directly what they are willing to pay for a bottle of water, they refer to their value meter. They give you an answer based on expectation and comparison rather than on how much they may potentially value it. This happening makes it hard for a person to admit the real value of your product.\n This phenomenon occurs when your product is an innovation, without valid comparisons, or if the value your product provides is much higher than any substitutes available on the market. The customer suddenly does not have an accurate thermometer to measure your product against, and will often give you a much lower price point when asked directly.\n Economists and psychologists have studied this phenomenon for a long time. There are many techniques to gather information on the world-famous question for any startup:  How much should I price my product?\n We can take advantage of this phenomenon by asking the customer indirect questions on a range.\n  One of my favorite techniques, which I believe works very well, is the   Van Westerndorp method, also known as the Price Sensitivity Meter technique. Its a series of 4 simple questions you can ask your customers to determine a price range at which your product pricing matches your offering&#39;s real value.\n What better way then to put those questions on a survey and ask enough people. If you survey, say, 150 potential customers, you will discover a pretty accurate price range determined by consumer value. Simple enough? Let&#39;s get started.\n The first step is to  make sure that customers understand your product. Consider giving customers a demo, sharing a video, or showing them detailed pictures of your product. You could include this at the top of your survey. For our purposes, let us take a picture of this yummy Gyro. Since a picture is worth a thousand words, I think it would do quite well to price this Gyro.\n  The first question you would ask is, at what particular price point is this Gyro way  too expensive that you would never consider purchasing it?\n Then you would ask at what specific price point is this Gyro  getting expensive, but you would still consider buying it?\n   Notice the answers would give us a range of prices rather than one fixed price. By answering in ranges, people tend to let go of their value spectrum and instead determine the boundaries of how valuable the product is to them. This technique is, by far, one of the most accurate ways of determining your products true value-based price through a survey.\n Looking at the data for 30+ users, we would get a cumulative graph as shown below.\n  From the results of the survey above, (about 30 entries at the time of this article.) We notice that the optimal value-based price range is between $2.5 and $3.5. At $2.5, the Gyro has approximately 15% of people who think its both expensive and too cheap. The optimal price would be the intersection of &#34;too expensive&#34; and &#34;too cheap&#34; at $3. Of course, this is just an indication of pricing and based purely on the people you have surveyed!\n For anyone interested, I have created the Gyro survey  here  (feel free to take it!). I have set up a live updating-pricing  worksheet to go along with it.\n Feel free to make a copy for your own product pricing journey, and good luck with your product pricing adventures.", "posttime": "2020-08-02 07:26:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,customer,价值", "title": "如何正确地询问客户愿意支付多少钱", "title_en": "How to correctly ask a customer how much they are willing to pay", "transed": 1, "url": "https://theunconventional.blog/how-to-survey-product-pricing/", "via": "", "real_tags": ["客户", "customer", "价值"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015678, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "7月27日周一，纽约州罗切斯特(柯达总部所在地)的一家当地新闻机构在推特上表示，柯达与联邦政府之间的一项交易即将发布重大声明。这引发了该公司股票一周来史无前例的交易活动。\n预计明天柯达和美国政府将发布关于一项新的制造业计划的重大声明。新闻8 WROC罗切斯特将对此进行全面报道。\n在接下来的30分钟里，大约80万美元被投资于该股，这推动该股价格比上午开盘时上涨了14%。当天下午晚些时候，一名Rededitor注意到了这个故事，将其发布到r/pennystock上，并转发了相关细节：\n这似乎也影响了股票走势，因为我们看到在发帖后大约30分钟内又投资了50万美元，当天价格攀升至+22%。\n与接下来的几天相比，周一的活动几乎是看不见的。虽然周一400万美元的交易额对KODK来说是一个很大的数字，但第二天，我们看到20亿美元在当天结束时官方宣布之前涌入公司。\n在政府宣布将向柯达提供7.65亿美元贷款用于生产药物配料后，周三，开放的KODK本周上涨了近900%。\n罗宾汉账户数据显示，周二散户兴趣上升，尽管罗宾汉在整体交易活动中只占一小部分。周二，约有2万个Robinhood账户增加了KODK，而根据IEX报告的全市场数据，该股的交易量为867,308次，在交易高峰期每分钟交易超过1万笔。非常感谢RobinTrack共享他们的数据访问权限。\n随着大量买家追逐该股，卖方流动性枯竭，价格短暂攀升至50美元上方，然后回落。本周KODK股价收于21.85美元，接近周三官方宣布后的开盘价，但比周一开盘价2.15美元高出约10倍。", "note_en": "On Monday, July 27, a local news affiliate in Rochester, NY (home of Kodak HQ) tweeted that a &#34;BIG announcement&#34; was coming concerning a deal between Kodak and the federal government. This set off a week of unprecedented trading activity in the company&#39;s stock (KODK).\n  &#34;BIG announcement expected tomorrow from Kodak and the U.S. government regarding &#34;a new manufacturing initiative.&#34; News 8 WROC Rochester will be all over it.&#34;\n  In the next 30 minutes, about $800k was invested in the stock, which pushed the price up 14% from the morning&#39;s open. A Redditor picked up on the story later that afternoon, posting it to r/pennystocks and retweeting the details:\n  This also appears to have moved the stock, as we see another $500k invested in about 30 minutes after the post, and the price climbing to +22% on the day.\n   Compared with the next couple days, Monday&#39;s activity is pretty much invisible. While the $4 million traded on Monday is a lot for KODK, the next day we see $2 billion flood into the company ahead of the official announcement at the end of day.\n   Following the announcement that the government would provide Kodak with a $765M loan to manufacture drug ingredients, at Wednesday&#39;s open KODK was up almost 900% on the week.\n Robinhood account data shows retail interest rising on Tuesday, although Robinhood accounts for a small portion of overall trading activity. About 20,000 Robinhood accounts added KODK on Tuesday, while the stock was traded 867,308 times according to market-wide data reported by IEX, with more than 10,000 trades per minute during peak activity. Big thanks to  Robintrack for sharing access to their data.\n   With a flood of buyers chasing the stock, and sell-side liquidity drying up, the price briefly climbed above $50 before pulling back. KODK shares ended the week at $21.85, which is near where it opened on Wednesday after the official announcement, but about ten times higher than Monday&#39;s open at $2.15.", "posttime": "2020-08-02 07:03:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股票,本周,moved,柯达", "title": "内幕消息本周是如何影响柯达股票走势的", "title_en": "How inside information moved Kodak's stock this week", "transed": 1, "url": "https://www.chartfleau.com/kodak", "via": "", "real_tags": ["股票", "本周", "moved", "柯达"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015677, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从9月1日开始，我将关闭https://invidio.us面向用户的部分，退出开发。如果您在该站点上有帐户，则可以在此处导出数据，这将允许您将所有内容导入到另一个实例或自托管。\nAPI将持续运行到10月1日，以便任何依赖它的服务都有时间迁移到其他解决方案。如果你是Liberapay的赞助人，我会敦促你把你的捐款换成iv-org，因为这将确保它在未来流向项目的管理人员。\n在撰写本文时，主要的令人反感的实例大约有35,000个用户。我甚至很难开始认为这些人是真实的人，而不仅仅是一个数字。在这个水平上，我收到的反馈数量是压倒性的，我认为与我见过的其他人相比，这是相当小的。不能对所有的问题都做出适当的回应是令人泄气的。尤其是当我收到一些值得认真回复的东西时，但我还没有时间回复，这与直觉相反，这意味着最好的评论最不可能得到任何回应。附和安特雷兹：这是压倒性的，不能在那里为人们服务。\n最近，我觉得作为回报，我的退缩要多得多。然而，对于任何项目，特别是需要维护的项目，要真正拔掉插头并在脑海中充电是很困难的。关闭通知是有帮助的，但也确实造成了损失。\n对于任何一定规模的项目来说，作为经理比作为开发人员更重要。举个例子，众所周知，莱纳斯·托瓦尔兹几乎不再做任何编码工作。在这一点上，做副业变成了一份工作，而不是我特别喜欢的一份工作。如果我早知道我会在一个充满激情的项目中得到这个位置，我很好奇我会不会把它开源，或者根本就不会开始工作。\n无论是哪种情况，我都认为自己非常幸运，将来能有人来管理这个项目，我只能想象没有这种奢侈品的人会是什么样子。我不禁感觉到，在某个地方，我使用的软件完全是由志愿者开发的，他们宁愿退出，但没有能力说不。这篇帖子之所以被推迟，就是因为这个原因，特别是当这么多人付出了这么多的时候，我觉得他们应该得到一个恰当的告别。不过，在这一点上，我找不到更好的离开条件。\n我不希望这篇文章读起来像是我不知何故觉得自己得不到赏识或报酬过低。我的动机不是表扬或金钱。在同一件事上工作了三年后，我只是累了，准备继续前进。", "note_en": "Starting September 1st, I&#39;m shutting down the user-facing portion of  https://invidio.us and stepping away from development. If you have an account on the site, you can export your data  here, which will allow you to import everything to  another instance or self-host.\n The API will continue to function until October 1st, to give time for any services relying on it to migrate to other solutions. If you&#39;re a patron on Liberapay, I would urge you to switch your donation to  iv-org, as that will ensure it goes to the stewards of the project going forward.\n At the time of this writing, the main Invidious instance has roughly 35,000 users. It&#39;s difficult for me to even begin to think of those as actual people, and not just a number. At that level, the amount of feedback I receive, which I would consider rather small in comparison to others I&#39;ve seen, is overwhelming. It&#39;s demoralizing not being able to respond to all of it properly. Even more so when I&#39;ve received something that deserves an involved response, but I haven&#39;t had the time to reply, which counter-intuitively means the best comments are least likely to receive any response. To echo  antirez: it&#39;s crushing not being able to be &#34;there&#34; for people.\n Lately, I&#39;ve felt myself withdraw much more in return. For any project though, especially something that requires maintanence, it&#39;s difficult to actually &#34;unplug&#34; and mentally recharge. Turning off notifications has helped, but it&#39;s definitely taken its toll.\n For any project of a certain size, it&#39;s more important for the lead to be a manager more than a developer. As an example, it&#39;s mostly well-known that Linus Torvalds  hardly does any coding anymore. At that point working on a side-project becomes a job, and not one I particularly enjoy. If I had known that I would&#39;ve ended up in that position on a passion project, I&#39;m curious if I would have made it open-source, or started working on it at all.\n In either case, I consider myself extremely lucky to have people that can manage the project in future, and can only imagine what it would be like for someone without that luxury. I can&#39;t help shake the feeling that somewhere, the software I use is being developed solely by volunteers who would rather quit, but don&#39;t have the ability to say &#34;no&#34;. This post has been delayed for that very reason, especially when so many people have given so much, and I feel they deserve a proper goodbye. At this point though, I can&#39;t find the strength to leave on better terms.\n I don&#39;t want this to read like I somehow feel underappreciated or underpaid. I&#39;m not motivated by praise or money. After working on the same thing for three years, I&#39;m just tired and ready to move on.", "posttime": "2020-08-02 07:03:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "部分,facing,项目", "title": "Invidio.us面向用户的部分正在关闭", "title_en": "User-facing portion of invidio.us shutting down", "transed": 1, "url": "https://omar.yt/posts/stepping-away-from-open-source", "via": "", "real_tags": ["部分", "facing", "项目"]}, {"category": "", "categoryclass": "", "imagename": "1b04c8534086a620e7effe1b8be1bb44.jpg", "infoid": 1015676, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哎呀，NASA SpaceX机组人员在相机前进入iPad PIN", "note_en": "Oops, NASA SpaceX Crew enters iPad pin in view of camera", "posttime": "2020-08-02 06:39:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "相机,nasa,spacex", "title": "NASA SpaceX机组人员在相机前进入iPad PIN", "title_en": "NASA SpaceX Crew enters iPad pin in plain view of camera", "transed": 1, "url": "https://imgur.com/a/b8J7xuM", "via": "", "real_tags": ["相机", "nasa", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "bd010d310c5691a3e343fa577dd09313.jpeg", "infoid": 1015675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管奥运会推迟了，但日本仍在推出一种新的高速列车，该国打算为2020年东京奥运会推出这种列车。新列车时速可达224英里，但在运营时将“仅”限制在177英里。制造商还表示，列车是抗震的，因为它的车载电源和处理危险轨道的不同模式。\n有了更好的刹车和运行控制，列车还可以在紧急情况下减速和停止得更快。7月1日，人们(安全地)成群结队地参加了列车的首发运行，这标志着十多年来日本东海道新干线高铁系统上的第一个新列车型号。\n此内容是从YouTube导入的。您可以在他们的网站上找到不同格式的相同内容，也可以找到更多信息。\n日本中部铁路委托制造了N700S(至尊)列车，该列车将在东京和大阪之间行驶约250英里。尽管N700S的速度和安全性是个大新闻，但它还包括对乘客舒适性、存储容量和新悬架的更新。\n这一切最终也与改进的安全性相协调：升级后的质量更轻，使列车在相同乘客数量的情况下既更省油，也更容易停车。\n“它还配备了锂离子电池自动推进系统--这在世界上尚属首例。该系统允许列车在停电期间自行行驶一小段距离，如果在地震期间滞留在高危地区(例如桥梁或隧道)，它将有可能以低速移动到更安全的位置。“(这一系统可以让火车在停电期间自行行驶一小段距离，如果在地震期间滞留在高危区域--例如桥梁或隧道)，它将有可能以低速移动到更安全的位置。”\n在这样的车辆中，制造电池备用电源系统是传统燃烧技术(交流发电机在运行过程中为电池充电)和埃隆·马斯克(Elon Musk)和其他能源巨头在世界各地推广的那种储能技术的完美结合。\n如果输电线路上的发电厂或其他任何东西受损，即使是电动火车也很容易受到地震的影响。日本的高水平地震活动引发了人们对可追溯到9世纪的地震研究的兴趣。\n研究人员说，世界上10%的地震发生在日本，当时日本大陆约占地球表面积的百分之一。(美国的这一比例略低于2%。)。这都是因为组成日本的岛链的位置和起源故事，日本是环太平洋火山和地震活动加剧的“火环”的一部分。\n日本表示，在其半个世纪的运营历史中，其高铁系统从未发生过任何乘客受伤事件。现在，即使是以前(安全地)因停电而停运的火车也可以继续快速驶离危险的道路。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息。\n此评论区由第三方创建和维护，并导入到此页面。你可以在他们的网站上找到更多信息。", "note_en": "Despite the postponed Olympics, Japan is still  introducing a new high-speed train that the country intended to roll out for the 2020 Tokyo games. The new train can go 224 miles per hour, but will be capped at “just” 177 for operation. The makers also say the train is earthquake-proof because of its onboard power source and different modes for tackling dangerous track.\n With better brakes and running controls, the train can also slow and stop much faster in an emergency. People (safely) flocked to the train’s inaugural run on July 1, which marked the first new train model on the Tokaido Shinkansen, Japan&#39;s high-speed rail system,  in more than a decade.\n  This content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  The Central Japan Railway commissioned the train, the N700S (Supreme), which will run about 250 miles between Tokyo and Osaka. Although its speed and safety is the big story, the N700S also includes updates to its passenger comfort, storage capacity, and a new suspension.\n This all ends up working in harmony with the improved safety, too: The upgrades are lighter in mass, making the train both more fuel-efficient and easier to stop with the same number of passengers aboard.\n   “It&#39;s also fitted with [a] lithium-ion battery self-propulsion system—the first of its kind in the world. This system allows the train to run for a short distance on its own during a power outage and will make it possible for it to move to a safer location at low speed if stranded in a high-risk area—on a bridge or in a tunnel, for example—during an earthquake.”\n In a vehicle like this, making a battery backup power system is an elegant combination of traditional combustion technology—where the alternator recharges the battery during operation—and the kind of energy storage being pushed around the world by  Elon Musk and other energy giants.\n  Even electric trains are vulnerable to earthquakes if power plants or anything else along the transmission line is damaged. Japan’s high level of seismic activity has led to an interest in earthquake research that  dates back to the ninth century.\n Researchers say 10 percent of the world’s earthquakes happen in Japan, when the Japanese landmass takes up about 1/100th of 1 percent of the Earth’s surface area. (The U.S. is just under 2 percent.) It’s all because of the position and origin story of the island chain that makes up Japan, which is part of the “Ring of Fire” of intensified volcanic and seismic activity around the Pacific Ocean.\n Japan says there  haven&#39;t been any passenger injuries on its high-speed rail system in its half-century operating history. Now, even trains that were previously (safely) halted by power outage can keep scooting out of harm’s way.\n   This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n   This commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "posttime": "2020-08-02 06:38:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,列车,brand", "title": "日本全新子弹头列车抗震", "title_en": "Japan's Brand New Bullet Train Is Earthquake-Proof", "transed": 1, "url": "https://www.popularmechanics.com/science/a33372664/japan-new-bullet-train-shinkansen-earthquakes/", "via": "", "real_tags": ["日本", "列车", "brand"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在2020年4月买了两台EdgeStar AP14001HS便携式空调，因为我预计夏天的大部分时间都要在家里度过。我不能在这里使用窗式空调，不过这显然是提高效率的选择，因为所有的热点部件都留在外面。\n我不能说它们在多大程度上是相同的，但本页上的内容可能适用于所有人。\n我想要双软管空调，因为单软管模型在热力学上不是最优的。将热空气吹出窗户会在房间内产生负压，通过各种缝隙将室外空气吸回室内。从理论上讲，双软管模型通过用新风冷却冷凝器，然后再将其排出，从而避免了这个问题。\n然而，当我感觉到AP14001HS上的进气和排气软管时，通过进气口的空气量要小得多，所以空气一定是从房间泄漏到冷凝室，在鼓风机关闭的情况下也是从房间和室外之间泄漏的。发生这种情况的主要位置有两个：\n为了阻止这个，我从1/16&(1.5 mm)ABS塑料上切下了一个436 mm x 98 mm的矩形。麦片盒也可用于原型制作。一般来说，材料需要相当薄，但要足够坚硬才能保持平坦。\n当压缩机运行时，塑料会被拉向后方，否则会被拉向前部，因此一条胶带可以帮助将其固定在适当的位置。\n最后，如果您决定打开设备(一把12英寸的飞利浦2号螺丝刀是有帮助的)，可以用胶带封住一些内部软管/电线缝隙，但我不确定这些缝隙有多重要。\n这些修改的目的是使冷凝室变得更热，这可能会缩短一些部件的寿命，但我不知道是哪些部件，或者缩短了多少。我至少有几个证据表明这可能不是一个糟糕的主意：\n我最近买了一对EdgeStar AP14001HS双软管空调，注意到进气软管的运动比排气软管小得多。看起来多余的空气正在泄漏到冷凝器隔间，在那里底部与机组的前部会合。请看附件中的照片，在照片中我临时用胶带盖住了缝隙。你能告诉我这个空隙是否有必要的功能吗？否则，我宁愿让它盖着，因为我选择了双软管模型，使内外空气相互隔离。\n你贴上胶带的区域被认为是溢出释放。我们非常欢迎你将该区域贴上胶带，尽管这不会造成问题。我的工程师已经通知我，这样做没问题。\n谢谢。我曾怀疑这个空隙是为了防止设备注水，尽管它似乎比需要的要大。\n你们的工程师有没有评估过封闭这个缝隙(和其他进气泄漏)对冷却效率有什么影响？\n我不能从我的工程师那里得到一个关于封闭缺口对效率的影响的答案。他们确实说过，当对这些设备进行测试时，他们会用这个缺口进行测试，以产生SACC评级。在测试过程中没有对单元进行任何修改。单元的效率包括气隙。\n这看起来不像是工厂级别的密封测试，但是在这些装置上工作的工程师已经进行了他们的常规测试，发现填补这个缺口不是问题。他们不能给我关于SACC的更多信息，尽管它不是我们可以在这个地方测试的东西。\n在一个植物生长论坛上，有人报告说，Whynter ARC-143MX密封得足够紧，足以维持高二氧化碳大气。目前还不清楚它实际运行了多长时间，但这条线程跨越了4年，作者没有提到失败。\n所以我不会说没有损坏的风险，但至少它以前已经试过了。\n密封这些缝隙后，我可以感觉到更多的空气通过进气口流动，而当我短暂阻塞进气口时，从排气口排出的空气更少。\n为了测试这些修改，我将空调安装在一个体积为1.5m²的有点密封的壁橱中。我将温度初始设置为大约72°F，将空调设置为61°F(最小值)，然后让它运行大约3分钟，直到鼓风机关闭。\n这在工厂配置中重复3次(红线)，在缝隙密封时重复3次(蓝线)，最后在单软管模式下重复2次(黑线)，进气口直接从壁橱空间吸入。我用一部指向温度计的手机记录温度，运行Open Camera，重复10秒：\n我不认为我的设置足够严谨，无法计算出任何绝对效率数字，但显然密封配置在冷却方面做得更好，而单管模式糟糕透顶。\n我觉得可耻的是，便携式空调公司对效率如此一无所知，以至于可以用基本的家庭用品来改善。这让我想起了80Plus之前的计算机PSU行业，那里所有的东西都是垃圾，没有人知道该买什么。为什么所有的创新都集中在单管设计上？\n像旧金山湾区这样的地方到处都是公寓和共管公寓，随着气温的上升，这些公寓和公寓逐渐变得不适合居住，所以如果人们能花钱购买一种像样的产品，那就太好了。\n这是可能的http://www.climax-air.com/知道他们在做什么，因为他们制造(据我所知)唯一的双软管便携式变速压缩机。但是我只看了网站，因为他们的供应非常有限。也许我会在EdgeStars耗尽的时候再检查一次。\n每台设备的功耗约为10.5安培，因此找出哪些断路器为哪些插座供电很重要，并避免与微波炉或电热水壶等高漏电设备共用一条电路。理想情况下，它们也应该坐在主断路器的相反的腿上。到目前为止，我还没有遇到与冰箱或电脑共用15安培电路的问题。\n在华氏95度左右的高峰一天，两个连续运行的空调可以保持850平方英尺的温度在70多摄氏度左右。我的红外线温度计显示天花板比墙壁暖和得多，所以改善阁楼的隔热可能会很有用。\n我计划在冬天让它们在暖气模式下运行，它应该比电阻式脚板加热器消耗更少的能源，但时间会证明它有多好用。\n这个安装需要注意的一点是，我的窗户被锁上了/用胶带固定住了，所以我不能在晚上外面空气凉爽的时候打开窗户。为了这个目的，如果有一个自动通风模式就好了。然而，用冷空气冷却的空调会产生更冷的空气，所以它不需要花太多时间在这种状态下运行。\n这个装置主要是向上吹室内空气。我打开箱子去掉了内置的导向器，把一台霜之王HD9放到了它的位置。这创造了一股大致水平的气流，而且没有多余的鳍挡住，看起来也会稍微安静一些。\n(在这张照片中，请注意，我用胶带盖在LED上以降低亮度，而泡沫块来自一次废弃的隔音实验，涉及可重新定位的粘合剂。)。\n软管可以用6英寸的管状棉袜绷带进行绝缘。在用两层棉花运行5分钟后，我在软管上测量了122°F，在棉花表面测量了102°F。这不是最好的绝缘材料，但它便宜、容易，而且看起来足够合理。\n您可以撕开一个标准的炉子空气过滤器，并削减之字形部分，以适应进气口的塑料框架。请注意，这会限制气流，因此将鼓风机调高可能是有意义的。拍完这张照片后，我把密度提高了一点：\n为了让机器运转得更安静，我开始用一条毯子把它包起来，用胶带固定在适当的位置。软管可以防止任何东西阻塞房间的进气口。这是我的空调玉米煎饼原型：\n当室外温度达到华氏90度时，设备会连续运行数小时，毯子下的最热温度约为华氏94度，因此它似乎在保持自身凉爽方面做得很合理。\n对于改进的版本，我使用了大量装载乙烯基(MLV)，包裹在棉毯和尼龙搭扣带，用订书机固定在一起。\n我用卷尺、正方形、铅笔和剪刀把MLV剪成合适的大小。卸下底角可为电源线留出空间。机翼有不同的长度，因为电源线偏离中心。\n顶部有尼龙搭扣(与之相对的尼龙搭扣热粘在空调上)，背面也有尼龙搭扣，这样墨西哥玉米煎饼就可以贴在身上了。\n总而言之，MLV确实降低了压缩机的噪音，但仍然有大量的鼓风机噪音。我不确定棉布包裹在多大程度上有助于减少反射声音，但至少它看起来比未加工的乙烯基好。\n推弯成百上千的订书钉是一项相当繁重的工作。我想我会建议一个理智的人停止使用最初的折叠毛毯和胶带的解决方案，因为它只需要几分钟，而MLV也好不到哪里去。\n我将ESP32微控制器连接到第一级(Y1)和第#34；级(Y1)和第#34；级(O)Nest恒温器的热泵转换阀上，辅助热驱动我的脚板加热器的继电器。(我已经测试过，鸟巢可以单独打开所有东西，但时间会告诉我们它在冬天是如何同时处理两种热量的。)。\n每个24VAC继电器输出通过10K电阻驱动SFH620AGB光耦合器的输入引脚(24V/10kohm将通过光耦合器LED推动几mA)。该光耦合器在INPUT_PULLUP模式下与GPIO兼容，使用一点软件来清理信号。我是从这篇StackExchange帖子中得到这个想法的，虽然24VAC没有120-240VAC那么可怕。\n在空调方面，我使用IRremoteESP8266的sendRaw()函数，通过150欧姆的电阻器驱动通用红外LED。\n我把一支圆珠笔切成两半，把它涂成黑色，然后把它放在模式状态LED上，用INL-3APD80光电二极管检测模式循环时的亮度变化。光电二极管似乎在光伏模式下工作得最好，阳极连接到ADC输入，阴极连接到GND。我每50微秒读取一次，平均跨越1000毫秒(20000个样本)以获得清晰的信号。与光电二极管并联增加一个电容器可以缩短稳定时间；10nF似乎在噪声和响应性之间取得了很好的平衡，将读取时间减少到100-200ms。\n当不需要加热/冷却时，空调的风扇可以断电，以降低噪音并节省60-70瓦。\n我使用LIRC&#39；的mode2捕获远程代码，它提供以微秒为单位的标记/空格时间，与前面提到的sendRaw()函数兼容。\n反向工程IR协议：所有标记的长度相同，数据编码在空格中。每个数据包似乎有32位，组织为[id，~id，code，~code]。我试着发送了全部256个代码，希望能找到没有文档记录的功能，比如将电源设置为X，或者将模式设置为X，但是唉，它们都是标准6个按钮的复制品，所以了解协议是很没用的。\n以下是irrp.py JSON格式的简化IR代码(我最初在Raspberry PI上玩Pigpio)。\n该算法允许ESP32从盲目启动时发现空调的状态：\n这是可能的同步风扇速度通过短暂运行除湿(这迫使风扇低)，但我决定不这样做，只是让用户选择风扇速度。\n在通电时不可能可靠地切换模式，因为从(例如)。冷却-&gt；除湿-&gt；风扇有时会应用中间模式(DEHUMIDFY)，即使在以最快速度喷射IR时也是如此。因此，我不得不通过发送TEMP UP来空闲压缩机，而不是切换到风扇。\n在最初关闭电源的情况下，发送模式-模式-电源有时会启动错误的模式，或者做一些奇怪的事情，比如在没有排气扇的情况下运行压缩机。解决方案是在最后一种模式和电源之间等待1000ms。\n关闭时在模式间循环将破坏存储的温度，使其降低0-2度。这只会在华氏模式下发生，所以我怀疑在某个地方有损耗的F-&GT；C-&GT；F转换。\n空调运行时断电会触发重新启动进入华氏模式，并且无法通过红外命令进入摄氏度模式；这非常烦人。\n背靠背发送IR命令时，必须保留至少1200us的间隔，以避免丢失事件。回想起来，这并不是一个真正的错误，因为它类似于发送一个比特。\n通过发送足够的向下命令以达到最小值，然后发送足够的向上命令以达到所需的温度，可以设置特定的温度。理论上，控制器可以始终使用16C用于冷却，32C用于空闲，但我更喜欢18C-27C，因为它只需要9次点击(更短的嘟嘟声)，并且用户可以手动提高冷却点，以防止较小的房间变得不合理的寒冷。由于温度损坏问题，手动调节只能在摄氏度模式下进行，因此，很不幸的是，拔掉电源会恢复到华氏温度。我最好的想法是通过发送足够的UP命令来初始化冷却模式，以最大限度地提高华氏温度范围，同样地，在加热模式下发送DOWN命令也是如此。此点之后的所有调整都假定为摄氏度，因此在用户恢复摄氏度模式并重新启动ESP32之前，温度永远不会变得足够冷，也不会变得足够热，直到用户恢复摄氏度模式并重新启动ESP32。换句话说，永远不工作似乎比某种工作要好。\n我找不到合适尺寸的外壳，所以我用一把通用刀切出了一些ABS长方形，用5毫米和12毫米的M3螺丝连接，中间有18毫米的距离和5毫米的间隔。\n该电路板是Proto Advantage SBB206。它正好适合15行的ESP32开发板，不过如果开发板再窄1针就更好了。在电源轨上钻孔使它们可以容纳通用部件。\n光电二极管和红外LED转换器连接到22AWG MTA-100连接器。我用一把小螺丝刀代替了35美元的插装工具。\nBud Industries CU-387外壳，带Vigortronix VTX-146-030-212。变压器将120VAC(并联绕组)转换为约30VAC，或将208VAC(串联绕组)转换为约25VAC。我用砂纸粗化了塑料，并将6毫米的M3环氧固定在了适当的位置；希望这能支撑得足够好。\n为了连接24VAC电线，我拿了一些3.5 mm的螺丝接线板(TE 1776275-6)，横向弯曲引脚，并将它们焊接成总线。露出的金属用电工胶带包裹着。\n这是恒温器外壳，所有东西都已安装，包括底部的24VAC至5VDC电源。我坚持使用MicroUSB，所以我不能忘记在重新编程之前拔下电源。\n接线盒最初装有一个208VAC恒温器，用于脚板加热。我添加了一个施耐德电气92S7A22D-24继电器，Nest通过白线将其标识为AUX HEAT。实际上，继电器和变压器是将Nest用作线路电压恒温器所需的唯一组件。\nPico是由Gilbert Pellegrom制作的，由Pico社区维护。根据麻省理工学院的执照发布。", "note_en": "I bought a couple EdgeStar AP14001HS portable air conditioners in April 2020, since I expect to spend most of the Summer at home. I&#39;m not able to use window A/Cs here, though that would be the obvious choice for efficiency because all the hot parts remain outside.\n    I can&#39;t say to what extent they are identical, but the stuff on this page  might apply to all of them.\n  I wanted a dual-hose air conditioner because single-hose models are thermodynamically suboptimal. Blowing hot air out the window creates negative pressure in the room, which sucks outdoor air back inside through various cracks. In theory, dual-hose models avoid this problem by cooling the condenser with outdoor air, which is then re-exhausted.\n However, when I feel the intake and exhaust hoses on the AP14001HS, the volume of air moving through the intake is considerably smaller, so air must be leaking from the room into the condenser compartment, and also between the room and outside while the blower is off. There are two major locations where this happens:\n       To block this one, I cut a  436mm x 98mm rectangle from a sheet of 1/16&#34; (1.5mm) ABS plastic. A cereal box also works for prototyping purposes... in general, the material needs to be pretty thin, but rigid enough to keep itself flat.\n The plastic gets pulled toward the rear while the compressor is running, and toward the front otherwise, so a piece of tape can help hold it in place.\n Finally, if you decide to open the unit (a 12-inch #2 Philips screwdriver is helpful), it&#39;s possible to tape over some internal hose/wiring gaps, but I&#39;m not sure how important these are.\n  These modifications are intended to make the condenser compartment run hotter, which may shorten the life of some components, but I have no idea which ones or by how much. I at least have a couple bits of evidence that this might not be a terrible idea:\n   I recently purchased a couple EdgeStar AP14001HS dual-hose airconditioners, and noticed that the intake hose moves quite a bit lessair than the exhaust hose. It seems that the extra air is &#34;leaking&#34;into the condenser compartment where the bottom meets the front of theunit. See the attached photo, where I temporarily covered the gapwith masking tape. Are you able to tell me whether this gap serves anecessary function? Otherwise, I would rather leave it covered,because I chose a dual-hose model to keep the inside/outside airisolated from each other.\n    The area that you&#39;ve taped up is considered an overflow release.You are perfectly welcome to keep that area taped up though as itshouldn&#39;t cause an issue. My engineers have informed me that it&#39;sOK to do this.\n  Thank you. I had suspected that the gap was to prevent the unit fromfilling with water, though it seems bigger than necessary.\n    Have your engineers evaluated what effect sealing this gap (and otherintake leaks) has on cooling efficiency?\n    I wasn&#39;t able to get an answer for this from my engineers about theeffect on sealing the gap will have on efficiency. They did say thatwhen the units are tested, they are tested with this gap to produce thatSACC rating. There&#39;s no modifications to the units done while testing.The efficiency of the units includes the air gap.\n It doesn&#39;t look like there has been factory level testing with the gapsealed, but the engineers who work on these units have performed theirown tests and found covering this gap to not be an issue.They weren&#39;t able to give me additional information on the SACC thoughas it&#39;s not something we can test at this location.\n  Someone on  a plant-growing forum reported sealing a Whynter ARC-143MX tightly enough to maintain a high-CO2 atmosphere. It&#39;s not clear for what duration it actually ran, but the thread spans 4 years and the author doesn&#39;t mention a failure.\n So I wouldn&#39;t say that there&#39;s no risk of damage, but at least it&#39;s been tried before.\n After sealing these gaps, I could feel more air moving through the intake port, and less air coming from the exhaust when I briefly obstruct the intake.\n  In order to test these modifications, I installed the air conditioner in a somewhat-sealed closet with a 1.5m² volume. I initialized the temperature to roughly 72°F, set the A/C to 61°F (the minimum value), and let it run for about 3 minutes until the blower shut off.\n This was repeated 3 times in the factory configuration (red lines), 3 times with the gaps sealed (blue lines), and finally 2 times in &#34;single hose mode&#34; (black lines) with the intake sucking directly from the closet space. I logged the temperature using a phone pointed at a thermometer, running Open Camera on 10-second repeat:\n  I don&#39;t think my setup is rigorous enough to calculate any absolute efficiency numbers, but clearly the sealed configuration does a better job of cooling, and single-hose mode is abysmal.\n  I find it disgraceful that the portable A/C companies are so clueless about efficiency that improvements can be made using basic household supplies. This reminds me of the computer PSU industry before 80 Plus, where everything is garbage and nobody knows what to buy. Why is all the innovation focused on single-hose designs?\n Places like the Bay Area are full of apartments and condos that are gradually becoming unlivable as temperatures rise, so it would be nice if people could just throw money at a decent product.\n It&#39;s possible that  http://www.climax-air.com/ knows what they&#39;re doing, since they make (as far as I know in 2020) the only dual-hose portable with a variable-speed compressor. But I&#39;ve only looked at the website, since their supply is very limited. Maybe I&#39;ll check again when the EdgeStars wear out.\n     Each unit consumes about 10.5 amps, so it&#39;s important to map out which circuit breakers feed which outlets, and avoid sharing a circuit with a high-drain appliance like a microwave or electric kettle. Ideally, they should also sit on opposite legs of the main breaker. So far, I&#39;ve had no issues sharing a 15 amp circuit with a refrigerator or computer.\n On a day that peaks around 95°F, two A/Cs running continuously can keep 850 sqft in the mid-70s. My IR thermometer says the ceiling is considerably warmer than the walls, so it would probably be useful to improve the attic insulation.\n I plan to run these in &#34;heat&#34; mode during the winter, which should consume less energy than the resistive baseboard heaters, but time will tell how well that works.\n One caveat to this installation is that my windows are locked/taped into position, so I can&#39;t open them at night when the air is cooler outside. It would be nice to have an automatic &#34;ventilate&#34; mode for this purpose. However, an A/C cooled with cool air produces even colder air, so it doesn&#39;t need to spend much time running in this state.\n  This unit blows indoor air mostly upwards. I opened the case to remove the built-in deflector, and put a Frost King HD9 in its place. This creates a roughly-horizontal air stream, and also seems slightly quieter without those extra fins in the way.\n (In this photo, note that I taped over the LEDs to reduce brightness, and the chunk of foam was from an abandoned soundproofing experiment involving repositionable adhesive.)\n  The hoses may be insulated using a 6 inch &#34;tubular cotton stockinette bandage&#34;. After 5 minutes of runtime with 2 layers of cotton, I measured 122°F at the hose and 102°F at the cotton surface. This isn&#39;t the greatest insulating material, but it&#39;s cheap, easy, and looks reasonable enough.\n  You can rip open a standard furnace air filter, and cut the zig-zag part to fit the air intake&#39;s plastic frame. Note that this will restrict airflow, so it probably makes sense to run the blower on high. I increased the density a bit after taking this photo:\n   To make the unit run quieter, I started by wrapping it with a blanket, held in place using tape. The hoses prevent anything from obstructing the room air intake. Here is my &#34;A/C burrito&#34; prototype:\n  With the unit running for hours when it&#39;s 90°F outside, the hottest point under the blanket is around 94°F, so it seems to do a reasonable job of keeping itself cool.\n  For the improved version, I used mass loaded vinyl (MLV) wrapped in cotton blanket with velcro strips, held together using staples.\n     I cut the MLV to size using a tape measure, square, pencil, and scissors. Removing the bottom corners leaves room for the power cord. The wings have different lengths because the power cord is off-center.\n There are velcro strips along the top (with opposing velcro hot-glued to the A/C), and on the back so the burrito can attach to itself.\n   All in all, MLV does reduce noise from the compressor, but there&#39;s still plenty of blower noise. I&#39;m not sure to what extent the cotton wrap helps to reduce reflected sound, but at least it looks nicer than raw vinyl.\n Pushing and bending hundreds of staples was quite a lot of work. I think I would recommend that a sane person stop with the initial &#34;folded blanket and tape&#34; solution, since it just takes a few minutes, and MLV isn&#39;t tremendously better.\n  I connected an ESP32 microcontroller to the &#34;compressor relay stage 1&#34; (Y1) and &#34;heat pump changeover valve&#34; (O) outputs of a Nest thermostat, with &#34;auxiliary heat&#34; driving a relay for my baseboard heaters. (I&#39;ve tested that the Nest can individually turn everything on, but time will tell how it juggles two kinds of heat in the winter.)\n Each 24VAC relay output drives the input pins of an SFH620AGB optocoupler through a 10K resistor (24V / 10kohm will push a few mA through the optocoupler LEDs). The optocoupler is compatible with GPIO in  INPUT_PULLUP mode, using a bit of software to clean up the signal. I got the idea from  this StackExchange post, though 24VAC is less scary than 120-240VAC.\n On the air conditioner side, I&#39;m driving a generic IR LED through a 150 ohm resistor, using the  sendRaw() function from  IRremoteESP8266.\n I cut a ballpoint pen in half, painted it black, and placed it over the mode status LEDs, with an INL-3APD80 photodiode to detect brightness changes when cycling through modes. The photodiode seems to work best in photovoltaic mode, with anode connected to an ADC input, and cathode connected to GND. I do a read every 50 microseconds, and average across 1000ms (20000 samples) to get a clean signal. Adding a capacitor in parallel with the photodiode reduces the stabilization time; 10nF seems like a good balance between noise and responsiveness, reducing the read time to 100-200ms.\n  When heating/cooling is not needed, the A/C&#39;s fans can power down, to reduce noise and save 60-70 watts\n I captured the remote codes using LIRC&#39;s  mode2, which provides mark/space times in microseconds, compatible with the  sendRaw() function mentioned previously.\n Reverse engineered IR protocol: all marks are the same length, with data encoded in the spaces. There appear to be 32 bits per packet, organized as  [id, ~id, code, ~code]. I tried sending all 256 codes, hoping to find undocumented features like &#34;set power to X&#34; or &#34;set mode to X&#34;, but alas, they were all just duplicates of the standard 6 buttons, so understanding the protocol is pretty useless.\n Here are the  simplified IR codes in  irrp.py JSON format (I was initially playing with  pigpio on a Raspberry Pi.)\n This algorithm allows the ESP32 to discover the state of the A/C from a blind start:\n  It&#39;s possible to synchronize the fan speed by briefly running DEHUMIDIFY (which forces the fan to LOW), but I decided not to do this, and just let the user choose the fan speed.\n  It is impossible to reliably switch modes while the power is ON, because switching from (e.g.) COOL-&gt;DEHUMIDIFY-&gt;FAN will sometimes apply the intermediate mode (DEHUMIDFY), even when blasting IR as fast as possible. Thus, I had to idle the compressor by sending TEMP UP instead of switching to FAN.\n With the power initially OFF, sending MODE-MODE-POWER will sometimes start the wrong mode, or do strange things like run the compressor without the exhaust blower. The solution is to wait 1000ms between the last MODE, and POWER.\n Cycling through modes while OFF will &#34;corrupt&#34; the stored temperature, lowering it by 0-2 degrees. This only happens in fahrenheit mode, so I suspect that there&#39;s a lossy F-&gt;C-&gt;F conversion happening somewhere.\n A power loss while the A/C is running triggers a reboot into fahrenheit mode, and there is no way to enter celsius mode via IR commands; this is quite annoying.\n When sending IR commands back to back, you must leave a gap of at least 1200us to avoid lost events. In retrospect, this isn&#39;t really a bug, since it&#39;s similar to sending a &#34;1&#34; bit.\n It&#39;s possible to set a specific temperature by sending enough DOWN commands to reach the minimum value, followed by enough UP commands to reach the desired temperature. In theory, the controller could always use 16C for cooling and 32C for idle, but I prefer 18C-27C, because it only needs 9 clicks (shorter beep), and the user can manually raise the cooling point to prevent a smaller room from getting unreasonably cold. Manual adjustment is only possible in celsius mode due to the temperature corruption bug, so it&#39;s unfortunate that unplugging the power reverts to fahrenheit. My best idea was to initialize cooling mode by sending enough UP commands to max out the fahrenheit range, and likewise for DOWN commands in heating mode. All adjustments after this point assume celsius, so the temperature will never get cold enough to cool, or hot enough to heat, until the user restores celsius mode and reboots the ESP32. In other words, it seems better to  never work than  sort of work.\n  I couldn&#39;t find an enclosure with the right dimensions, so I cut out some ABS rectangles with a utility knife, attached using 5mm and 12mm M3 screws, with 18mm standoffs and 5mm spacers.\n  The circuit board is a Proto Advantage SBB206. It fits the 15-row ESP32 dev board exactly, though it&#39;d be nice if the dev board were 1 pin narrower. Drilling holes in the power rails lets them hold general-purpose components.\n  The photodiode and IR LED dongles are attached to 22AWG MTA-100 connectors. I used a small screwdriver in lieu of the $35 Insertion Tool.\n       Bud Industries CU-387 enclosure with Vigortronix VTX-146-030-212. The transformer converts 120VAC (parallel windings) to roughly 30VAC, or 208VAC (series windings) to roughly 25VAC. I roughened the plastic with sandpaper and epoxied 6mm M3 standoffs in place; hopefully that&#39;ll hold well enough.\n  To attach the 24VAC wires, I took some 3.5mm screw terminal blocks (TE 1776275-6), bent the pins sideways, and soldered them to form a bus. The exposed metal was wrapped with electrical tape.\n  Here is the thermostat enclosure with everything mounted, including a 24VAC to 5VDC power supply at the bottom. I stuck with MicroUSB, so I can&#39;t forget to unplug the power before reprogramming it.\n  The junction box originally held a 208VAC thermostat for baseboard heat. I added a Schneider Electric 92S7A22D-24 relay, which the Nest identifies as &#34;aux heat&#34; via the white wire. Actually, the relay and transformer are the only components needed to use the Nest as a line-voltage thermostat.\n  Pico was made by  Gilbert Pellegrom and is maintained by  The Pico Community. Released under the  MIT license.", "posttime": "2020-08-02 06:37:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破解,portable,模式", "title": "破解便携式空调", "title_en": "Hacking Portable Air Conditioners", "transed": 1, "url": "https://pmarks.net/ac/", "via": "", "real_tags": ["破解", "portable", "模式"]}, {"category": "", "categoryclass": "", "imagename": "66ec1c76d1d1ef88fb062a4734ab3a81.jpg", "infoid": 1015673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德国法院暂停特斯拉Model 3产品中调整雨刷速度的司机2020-07-31 17：57：39 https://insideevs.com/news/436912/driver-suspended-adjusting-wiper-speed-model-3/特斯拉Model 3安全，工业，撞车德国最近的一项判决将开始一场引人入胜的讨论。卡尔斯鲁厄高级地区法院证实，一名司机将被暂停驾驶一个月。他被判刑是因为他驾驶自己的特斯拉Model 3撞上了堤坝，在试图调整触摸屏上的挡风玻璃雨刷速度后撞上了一些树。\n这名没有透露身份的司机在2019年3月15日晚遭遇了这起事故。他受到的第一起诉讼发生在2019年8月22日，他被判支付200欧元罚款，并被暂停驾驶一个月。1 RB 36 SS 832/19诉讼如果是最后一起，它不接受任何上诉。\n根据参与这起诉讼的法官的说法，永久安装在特斯拉汽车上的触摸屏是一种电子设备。因此，只有在德国法规的条件下，机动车司机才能操作它，而不是考虑机动车司机操作它的目的是什么。\n在你想出一句老话说，你永远不知道你会在判决和婴儿尿布中发现什么之前，法官们给出了很多理由，认为Model 3的信息娱乐屏幕是一个电子设备。尽管司机说那里的速度表使其成为安全控制面板，但法院裁定，当他快速看一眼不足以检查有五个选项的子菜单时，就不能认为它是安全控制面板。司机也会受到责备，因为他没有注意到道路交通所需的注意事项。\n无论你是否同意德国法官的推理，关键的一点是要考虑到这一裁决开启了一场深入的讨论，即汽车的基本功能，如挡风玻璃雨刷，是否应该与触摸屏有关。\n特斯拉决定制造一款将许多操作集中在其信息娱乐电脑的触摸屏上的汽车。在其中一些车辆中，这被称为MCU。我们已经介绍了MCUv1提出的问题。例如，在Model 3和Model Y中，触摸屏的任何问题都会阻止司机正确使用挡风玻璃雨刷。\n在特斯拉的辩护中，如果Model 3的雨刷开启了自动模式，或者司机使用语音命令调整速度-你甚至可以用它发出主动放屁的声音，这个问题可能就会被克服。为什么他决定在触摸屏上手动更改，这是只有这位德国司机才能回答的问题。如果你碰巧认识他，请让他与我们联系。我们很想听听他对这个故事的描述。", "note_en": "German Court Suspends Driver For Adjusting Wiper Speed In Tesla Model 3    product  2020-07-31 17:57:39  https://insideevs.com/news/436912/driver-suspended-adjusting-wiper-speed-model-3/     Tesla Model 3     Safety, Industry, crash   A recent verdict from Germany will start a fascinating discussion. The Higher Regional Court in Karlsruhe confirmed that a driver would have to be suspended from driving for a month. He was sentenced to that because he drove his  Tesla Model 3 into an embankment and hit some trees after trying to adjust the windshield wiper speed on the touchscreen.\n  This driver, which did not have his identity revealed, suffered this accident on the evening of March 15, 2019. The first lawsuit he was subject to happened on August 22, 2019, and he was condemned to pay a €200 fine and got suspended from driving for one month. The 1 Rb 36 Ss 832/19 lawsuit if the final one, and it does not admit any appeal.\n  According to judges involved with this lawsuit, &#34;the touchscreen permanently installed in the  Tesla vehicle is an electronic device.&#34; Therefore, its operation &#34;is permitted to the motor vehicle driver only under the conditions&#34; of German&#39;s regulation, &#34;without it being of any importance what purpose the motor vehicle driver pursues with its operation.&#34;\n Before you come up with the old saying that you never know what you&#39;ll find in verdicts and baby diapers, the judges gave many reasons to consider the infotainment screen at the Model 3 as an &#34;electronic device.&#34; Although the driver said that the speedometer there makes it a &#34;safety control panel,&#34; the court ruled it could not be considered as such when a quick gaze is not enough for him to check a submenu with five options. The driver would also be to blame because he had not &#34;observed the care required in road traffic.&#34;\n  Whether you agree with the German judge&#39;s reasoning or not, it is crucial to consider the decision opens an in-depth discussion as to whether fundamental functions in a car, such as windshield wipers, should have anything to do with a touchscreen or not.\n  Tesla decided to create a car that concentrates many of its operations on the touchscreen of its infotainment computer. In some of these vehicles, that is called MCU.  We have covered the issues the MCUv1 presents. In Model 3 and Model Y units, any problem with the touchscreen would prevent the driver from properly using the windshield wiper, for example.\n   On Tesla&#39;s defense, that could probably be overcome if the Model 3 had  the automatic mode for the wipers on or if the driver used  the voice command to adjust the speed – you can even active farts sound with it. Why he decided to change it on the touchscreen manually is something only this German driver could answer. If you happen to know him, please put him in touch with us. We would love to hear his version of the story.", "posttime": "2020-08-02 06:37:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,调整,court,司机", "title": "德国法院暂停特斯拉Model 3中调整雨刷速度的司机", "title_en": "German Court Suspends Driver for Adjusting Wiper Speed in Tesla Model 3", "transed": 1, "url": "https://insideevs.com/news/436912/driver-suspended-adjusting-wiper-speed-model-3/", "via": "", "real_tags": ["特斯拉", "调整", "court", "司机"]}, {"category": "", "categoryclass": "", "imagename": "98e80d6c482cebe48f91523155f024aa.jpeg", "infoid": 1015672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-阿斯利康的一位高管告诉路透社，阿斯利康已经被大多数与其达成供应协议的国家授予了未来与其新冠肺炎疫苗相关的产品责任索赔的保护。\n由于有25家公司在人体上测试他们的候选疫苗，并准备在产品被证明有效后为数亿人接种疫苗，在出现副作用的情况下，谁来支付任何损害索赔的问题一直是供应谈判中的一个棘手问题。\n“这是一种独特的情况，我们作为一家公司根本不能冒这样的风险，如果……。四年来，疫苗正显示出副作用，“阿斯特拉高级管理团队成员Ruud Dobber告诉路透社。\n“在我们现有的合同中，我们要求赔偿。对于大多数国家来说，肩上承担这种风险是可以接受的，因为这符合他们的国家利益，“他说，并补充说，Astra和监管机构正将安全和耐受性作为首要任务。\n欧盟官员本周向路透社(Reuters)表示，产品责任是欧洲争取辉瑞(Pfizer)、赛诺菲(Sanofi)和强生(Johnson；Johnson)潜在新冠肺炎疫苗供应协议的争议焦点之一。\n然而，美国已经有一项法律，以2005年公共准备和紧急准备法案的形式，将侵权索赔排除在帮助控制公共卫生危机的产品之外。\n英国第二大制药商阿斯利康(AstraZeneca)在与美国、英国和欧洲国家等国家和组织的协议中承诺供应总计超过20亿剂无利可图的疫苗。\n阿斯特拉的交易与大多数竞争对手不同，因为它已获得政府对生产和开发努力的支持，而葛兰素史克(GlaxoSmithKline)等竞争对手正寻求就成品价格进行谈判，这取决于批准与否。\n据多伯称，为了支持其放弃在美国12亿美元合作利润的说法，阿斯特拉甚至允许政府访问与该合资企业相关的金融账户。\n“在他们付钱之前，有非常明确的里程碑。因为我们承诺在无利可图的情况下生产疫苗，美国政府的审计人员将可以免费访问我们的会计账簿，“他说。", "note_en": "(Reuters) - AstraZeneca has been granted protection from future product liability claims related to its COVID-19 vaccine hopeful by most of the countries with which it has struck supply agreements, a senior executive told Reuters.\n  With 25 companies testing their vaccine candidates on humans and getting ready to immunise hundred millions of people once the products are shown to work, the question of who pays for any claims for damages in case of side effects has been a tricky point in supply negotiations.\n “This is a unique situation where we as a company simply cannot take the risk if in ... four years the vaccine is showing side effects,” Ruud Dobber, a member of Astra’s senior executive team, told Reuters.\n “In the contracts we have in place, we are asking for indemnification. For most countries it is acceptable to take that risk on their shoulders because it is in their national interest,” he said, adding that Astra and regulators were making safety and tolerability a top priority.\n  EU officials told Reuters this week product liability was among contentious points in European efforts to secure supply deals for potential COVID-19 vaccines from Pfizer, Sanofi and Johnson &amp; Johnson.\n The United States, however, already has a law to exclude tort claims from products that help control a public-health crises in the form of the 2005 Public Readiness and Emergency Preparedness, or PREP Act.\n AstraZeneca, Britain’s second-largest drugmaker, has pledged to supply a total of more than 2 billion doses at no profit in agreements with the United States, Britain and European countries, among other nations and organisations.\n Astra’s deals differ from most rivals because it has secured government backing for production and development efforts, while competitors such as GlaxoSmithKline are looking to negotiate a price for a finished product, contingent on approval.\n To back its claim to forgo profits from the $1.2 billion collaboration in the United States, Astra has even granted the government access to financial accounts related to the venture, according to Dobber.\n “There are very clear milestones before they are going to pay. Because we made the promise to manufacture the vaccine at no profit, auditors of the U.S. administration will get free access to our accounting books,” he said.", "posttime": "2020-08-02 06:13:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,病毒,免除,exempt", "title": "阿斯利康在大多数国家免除冠状病毒疫苗责任索赔", "title_en": "AstraZeneca exempt from coronavirus vaccine liability claims in most countries", "transed": 1, "url": "https://uk.reuters.com/article/us-astrazeneca-results-vaccine-liability/astrazeneca-to-be-exempt-from-coronavirus-vaccine-liability-claims-in-most-countries-idUKKCN24V2EN", "via": "", "real_tags": ["冠状病毒", "病毒", "免除", "exempt"]}, {"category": "", "categoryclass": "", "imagename": "0b660f375d65e55538b323e96d3facad.png", "infoid": 1015671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "广告商对Facebook的抵制给这家社交媒体巨头带来了损失，但它对公司声誉的损害可能比对其利润的损害更大。\n组织这次抵制的民权组织称之为#StopHateForProfit，敦促公司在7月份停止为Facebook上的广告付费，以抗议该平台对仇恨言论和错误信息的处理。在900多万个广告商中，有1000多个公开加入，而其他人则悄悄地缩减了支出。\n根据广告分析平台Pathmatics的估计，从7月1日到7月29日，上半年在Facebook上花费最多的100个广告商花费了2.214亿美元，比一年前前100名广告商的2.514亿美元减少了12%。在这100家公司中，有9家公司正式宣布撤回付费广告，将支出从2620万美元削减至50.75万美元。\n许多远离Facebook的公司表示，他们计划重返Facebook，其中许多是依赖该平台进行推广的夫妻企业和个人。Facebook首席执行官马克·扎克伯格(Mark Zuckerberg)强调了小企业的重要性，他在周四的财报电话会议上表示，“一些人似乎错误地认为，我们的业务依赖于少数几个大广告商。”\nFacebook表示，截至6月30日的第二季度，前100名消费者贡献了其187亿美元营收的16%。Facebook表示，在7月的前三周，整体广告收入比去年增长了10%，该公司预计整个季度都会保持这一速度。\n抵制活动使广告商的计划变得复杂。总部位于堪萨斯州的数字机构DEG的媒体和搜索总监奎恩·希克(Quinn Sheek)表示，该公司经历了“一个月的旋风式”，因为其中小型客户正在苦苦挣扎，如果没有Facebook，他们是否能接触到足够多的客户。Facebook及其子公司Instagram占DEG客户数字支出的三分之一以上。\n希克说，在加入7月份抵制活动的60%的DEG客户中，五分之四的人计划在8月份重返Facebook，许多人“认为在经济困难时期继续休假对他们来说太多了”。尽管如此，抵制活动帮助放大了Facebook上对有毒内容的讨论。这个问题是在过去一周的国会听证会上以及广告业代表和Facebook领导人之间的反复会议上提出的。面对压力，Facebook上月公布了民权审计结果，并同意聘请民权高管。\n舆论分析公司RepTrak的执行副总裁斯蒂芬·哈恩-格里菲斯(Stephen Hahn-Griffiths)上个月在一篇帖子中写道，“真正可能伤害Facebook的是，它被认为是‘仇恨言论’和其他不当内容发布者的长期影响。”\n除了该平台上普遍存在的仇恨言论外，批评其的人还集中在该公司对待用户隐私和外国选举干预的问题上。\n哈恩-格里菲斯写道，“你可以说Facebook有一个血淋淋的鼻子和两只声名狼藉的黑眼睛。”\nFacebook首席运营官谢丽尔·桑德伯格(Sheryl Sandberg)在公司财报电话会议上表示，就像抵制活动的组织者一样，“我们不希望在我们的平台上出现仇恨，我们坚决反对。”\n当抵制活动开始时，广告业已经处于动荡之中，因为企业关门，裁员席卷整个经济，在家的消费者放慢了购物速度。在7月份削减Facebook支出之前，微软(Microsoft)、星巴克(Starbucks)、联合利华(Unilever)和塔吉特(Target)等广告商在6月份暂时离开了该平台，因为许多公司都在应对与流行病相关的营销预算削减，以及针对种族主义和警察暴行的广泛抗议活动。根据Pathmatics的数据，自3月下旬以来，迪士尼在Facebook上的支出大多呈下降趋势。\nPathmatics称，上个月，宝洁(Procter&amp；Gamble)、三星(Samsung)、沃尔玛(Walmart)和Geico等大型广告商大幅削减了Facebook上的付费广告，但没有加入官方的抵制行动。其他公司，如好时(Hershey)和Hulu，则增加了在Twitter和YouTube等替代平台上的支出。\n比姆三得利和可口可乐等公司誓言要继续向Facebook施压，特别是在总统竞选升温的情况下。周四，冰激凌公司Ben&amp；Jerry‘s表示，计划在今年年底前继续扣留产品促销支出，“以传递一个信息”。\n民权组织反诽谤联盟(Anti-Defamation League)的首席执行官乔纳森·格林布拉特(Jonathan Greenblatt)说，广告商的抵制“是一次警告，是一次开场白”，该组织帮助建立了广告抵制活动。组织者和其他团体现在计划将抵制活动扩大到欧洲，包括Facebook用户，并解决其他担忧，比如平台上存在儿童性虐待问题。\n该机构负责媒体的副总裁德里克·韦尔奇(Derek Welch)说，波士顿和费城与艾伦·格利森(Allen&amp；Gerritsen)合作的公司中，有一半参与了抵制活动。他说，许多人认为，重要的是“在品牌的海洋中做一些有意义和有形的事情，发表非常善意的声明”。\n韦尔奇说，该机构的客户通常每月在Facebook上总共花费15万至20万美元。有几个人计划继续抵制。\n他说：“签约的大公司在知名度和对外宣传方面都非常出色。”“但这实际上都是关于这些小企业的，他们在这里花费了3万美元，在那里花费了5万美元，他们的决定通常不会产生太大影响。”", "note_en": "The advertiser boycott of Facebook took a toll on the social media giant, but it may have caused more damage to the company’s reputation than to its bottom line.\n The boycott, called #StopHateForProfit by the civil rights groups that organized it, urged companies to stop paying for ads on Facebook in July to protest the platform’s handling of hate speech and misinformation. More than  1,000 advertisers publicly joined, out of a total pool of more than 9 million, while others quietly scaled back their spending.\n The 100 advertisers that spent the most on Facebook in the first half of the year spent $221.4 million from July 1 through July 29, 12 percent less than the $251.4 million spent by the top 100 advertisers a year earlier, according to estimates from the advertising analytics platform  Pathmatics. Of those 100, nine companies formally announced a pullback in paid advertising, cutting their spending to $507,500 from $26.2 million.\n Many of the companies that stayed away from Facebook said they planned to return, and many are mom-and-pop enterprises and individuals that depend on the platform for promotion. Mark Zuckerberg, Facebook’s chief executive, has emphasized the importance of small business, saying  during an earnings call on Thursday that “some seem to wrongly assume that our business is dependent on a few large advertisers.”\n Facebook said that the top 100 spenders contributed 16 percent of its $18.7 billion in revenue in the second quarter, which ended on June 30. During the first three weeks of July, Facebook said, overall ad revenue grew 10 percent over last year, a rate the company expects to continue for the full quarter.\n The boycott complicated planning for advertisers. The Kansas-based digital agency DEG had “a whirlwind of a month” as its small to midsize clients grappled with whether they could reach enough customers without Facebook, said Quinn Sheek, its director of media and search. Facebook and its subsidiary Instagram make up more than a third of digital spending for DEG clients.\n Of the 60 percent of DEG clients that joined the July boycott, four out of five are planning to return to Facebook in August, with many having “decided it’s too much for them during a difficult economic time to remain off,” Ms. Sheek said. Still, the boycott helped amplify discussion of toxic content on Facebook. The issue was raised in  a congressional hearing this past week and in  repeated meetings between ad industry representatives and Facebook leaders. In the face of the pressure, Facebook released the results of  a civil rights audit last month and agreed to hire  a civil rights executive.\n “What could really hurt Facebook is the long-term effect of its perceived reputation and the association with being viewed as a publisher of ‘hate speech’ and other inappropriate content,” Stephen Hahn-Griffiths, the executive vice president of the public opinion analysis company RepTrak, wrote  in a post last month.\n In addition to the prevalence of hate speech on the platform, its critics have also focused on the company’s treatment of  user privacy and foreign  election interference.\n “You could argue that Facebook has a bloodied nose and two reputational black eyes,” Mr. Hahn-Griffiths wrote.\n Sheryl Sandberg, Facebook’s chief operating officer, said during the company’s earnings call that, like the boycott’s organizers, “we don’t want hate on our platforms, and we stand firmly against it.”\n The ad industry was  already in upheaval when the boycott began, as businesses closed, layoffs swept through the economy and homebound consumers slowed their shopping. Before they reduced spending on Facebook in July, advertisers like Microsoft, Starbucks, Unilever and Target took a temporary break from the platform in June, as many companies were reacting to pandemic-related marketing budget cuts and widespread protests over racism and police brutality. Disney’s spending on Facebook has mostly trended downward since late March, according to Pathmatics.\n Last month, large advertisers like Procter &amp; Gamble, Samsung, Walmart and Geico sharply curtailed paid advertising on Facebook without joining the official boycott, according to Pathmatics. Others, like Hershey and Hulu, beefed up their spending on alternate platforms like Twitter and YouTube.\n  Companies like Beam Suntory and  Coca-Cola have vowed to continue pressuring Facebook, especially as the presidential race heats up. On Thursday, the ice cream company Ben &amp; Jerry’s said it planned to keep withholding spending on product promotions through the end of the year “to send a message.”\n The advertiser boycott “was a warning shot, an opening salvo,” said Jonathan Greenblatt, the chief executive of the civil rights group the Anti-Defamation League, which helped set up the ad boycott. Organizers and other groups now plan to expand the boycott into Europe, to  include Facebook users, and to address other concerns, like the presence of  child sexual abuse on the platform.\n Half of the companies that work with the agency Allen &amp; Gerritsen in Boston and Philadelphia participated in the boycott, said Derek Welch, its vice president of media. Many felt it was important to “do something that is meaningful and tangible in a sea of brands putting out very well-meaning statements,” he said.\n Mr. Welch said the agency’s clients typically spend $150,000 to $200,000 a month total on Facebook. Several plan to continue boycotting.\n “The big companies that have signed on have been great for visibility and getting the word out,” he said. “But this is really all about these small businesses in aggregate who are spending $30,000 here or $50,000 there, whose decisions wouldn’t normally make too much of a difference.”", "posttime": "2020-08-02 06:13:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,抵制,boycotted", "title": "1000多家公司抵制Facebook。它起作用了吗？", "title_en": "More Than 1k Companies Boycotted Facebook. Did It Work?", "transed": 1, "url": "https://www.nytimes.com/2020/08/01/business/media/facebook-boycott.html", "via": "", "real_tags": ["facebook", "抵制", "boycotted"]}, {"category": "", "categoryclass": "", "imagename": "b560d8c4a92bb473c32eeff0d594f886.jpg", "infoid": 1015670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“十种力量”带我们踏上了一场规模宏大的冒险之旅。从芝加哥湖边的一次野餐开始，这部著名的电影把我们带到了芝加哥的外缘…", "note_en": "Powers of Ten takes us on an adventure in magnitudes. Starting at a picnic by the lakeside in Chicago, this famous film transports us to the outer edges of t...", "posttime": "2020-08-02 06:12:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "力量,powers,冒险", "title": "“十种力量”(1977)", "title_en": "Powers of Ten (1977)", "transed": 1, "url": "https://www.youtube.com/watch?v=0fKBhvDjuy0", "via": "", "real_tags": ["力量", "powers", "冒险"]}, {"category": "", "categoryclass": "", "imagename": "b604a494616248c12a5345c03a656a20.jpeg", "infoid": 1015669, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，国土安全部收集并分析了波特兰抗议者之间的信息，这与一名国土安全部官员上周告诉参议院委员会的说法相矛盾。\n《华盛顿邮报》(The Washington Post)获得的一份国土安全部内部文件显示，国土安全部可以获得抗议者之间的电子通信，并将他们的信息包括在一份情报报告中，该报告与联邦调查局(FBI)等其他执法机构共享。\n根据参议院情报委员会民主党成员要求墨菲证实这一说法的一封信，国土安全部负责情报和分析办公室(I&amp；A)的代理副部长布莱恩·墨菲(Brian Murphy)此前曾表示，办公室人员与抗议者没有接触。\n然而，在墨菲向委员会做简报的不到一周前，这份开源情报报告包括了抗议者通过Telegram即时通讯应用进行的交流，讨论了将抗议带到哪里以及如何避开警察。\n据“华盛顿邮报”报道，该报告将这些信息描述为，波特兰的加密通讯应用用户在被追捕时，可能会讨论TTP[战术、技术和程序]，以逃避执法部门的追捕。“华盛顿邮报”的报道称，这些信息可能是波特兰的加密通讯应用用户在被追捕时讨论TTP[战术、技术和程序]以逃避执法。它还声称这些信息来自一家电报聊天室，并称该聊天室是一种即时通讯服务。&#39；&#34；\n目前还不清楚国土安全部是如何获得抗议者的信息的，也不清楚跟踪和分析行使第一修正案保护的权利的平民之间的通信背后的动机是什么。\n国土安全部不会对国会信件发表评论。我们在适当的时候做出回应，该部门在一份声明中告诉“华盛顿邮报”。\n邮报本周早些时候报道，国土安全部还在汇编两名报道抗议活动的记者的情报报告，这两名记者发布了泄露的非机密内部信息。这些报告也被分发给其他执法机构。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "The Department of Homeland Security reportedly collected and analyzed messages between protesters in Portland, contradicting what a department official told a Senate committee last week.\n An internal DHS document, obtained by  The Washington Post, showed the department had access to electronic communications between protesters and included their messages in an intelligence report, which was shared with other law enforcement agencies like the FBI.\n Brian Murphy, the acting DHS undersecretary for the Office of Intelligence and Analysis (I &amp; A), had previously stated that office personnel had no contact with protesters, according to a  letter from Democratic members of the Senate Intelligence Committee asking Murphy to confirm the statement.\n However, the Open Source Intelligence Report, dated less than a week before Murphy&#39;s briefing before the committee, included protesters&#39; communications via the Telegram messaging app, discussing where to take the protests and how to avoid officers.\n   &#34;The report describes the messages as &#39;likely Portland-based encrypted messaging app users discuss TTPs [tactics, techniques and procedures] to evade law enforcement when being pursued,&#39;&#34; according to The Post report. &#34;It also states that the information came from &#39;a Telegram chat room,&#39; which it described as &#39;an instant messaging service.&#39;&#34;\n It is not immediately clear how the DHS obtained access to the protesters&#39; messages, nor what the motives were behind tracking and analyzing communications between civilians exercising rights protected by the First Amendment.\n &#34;DHS does not comment on congressional correspondence. We respond as appropriate,&#34; the department told The Post in a statement.\n The Post reported earlier this week that the DHS was also compiling  intelligence reports on two journalists covering the protests who published leaked unclassified internal information. The reports were also disseminated to other law enforcement agencies.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-08-02 05:49:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "报告,report,信息", "title": "一份新的报告称，国土安全部的一份情报报告显示，该部门收集并分析了波特兰抗议者之间的信息", "title_en": "A DHS intelligence report showed the department had collected and analyzed messages between Portland protesters, a new report says", "transed": 1, "url": "https://www.businessinsider.com/internal-report-showed-dhs-collected-protester-messages-wapo-2020-7", "via": "", "real_tags": ["报告", "report", "信息"]}, {"category": "", "categoryclass": "", "imagename": "77a8d6e0e65271b4a899a0ec64b1689b.jpg", "infoid": 1015668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "强生公司的实验性冠状病毒疫苗在一项临床前研究中只需一针就能保护猕猴，可能会在其他疫苗的测试中取得进展，但随着时间的推移需要两剂。\n接触这种引起大流行的病原体的六种灵长类动物中，有五种在单次注射后具有免疫力。根据发表在医学杂志“自然”(Nature)上的一项研究，这一例外表明病毒水平较低。研究人员总共评估了52只猕猴和7种不同的疫苗原型。这家医疗保健巨头于7月22日在比利时和本周早些时候在美国启动了人体试验。\n尽管其他疫苗制造商进入开发的速度更快，阿斯利康已经在英国为近1万人接种了实验疫苗，但在全球推出大规模疫苗接种计划的后勤挑战中，单剂获得保护可能会被证明是一种优势。\n制药商首席科学官保罗·斯托菲尔斯(Paul Stoffels)在接受采访时表示：今天公布的研究结果是未来几周我们可以拿到谈判桌上的非常重要的一部分，因为我们将与不同的国家合作，就仍在试验中的疫苗供应达成高级协议。\nStoffels说，灵长类动物的数据表明，候选冠状病毒疫苗产生了强烈的抗体反应，并且只需一剂就能提供保护。\n强生的目标是在9月份开始最后一阶段的测试，在与阿斯利康(AstraZeneca)、现代(Modern na Inc.)、辉瑞(Pfizer Inc.)等其他公司竞争时，压缩传统的时间表。葛兰素史克(GlaxoSmithKline Plc)为结束这场流行病提供了一剂强心针。\n康托·菲茨杰拉德(Cantor Fitzgerald)分析师路易丝·陈(Louise Chen)在周四发给投资者的一份报告中表示，这显然是个好消息。今天的积极数据很重要，因为强生有一个以前已经使用过的疫苗平台，可以缓解人们对正在为新冠肺炎开发的新疫苗安全性的担忧。\n在盘前小幅上涨后，强生在中午12点13分下跌0.06%，至146.45美元。在纽约。\n这家总部位于新泽西州新不伦瑞克的制药商将在本月启动的对1000多名成年人的早期研究中，同时测试一剂冠状病毒疫苗，以及一剂与增强剂相结合的疫苗。随着候选疫苗加速通过后期试验，数据将首先从其试验的单剂部门报告出来，斯托菲尔斯表示，强生可能会寻求监管机构对单剂疫苗的紧急使用授权。\n然而，Stoffels说，注射加强化养生法为持久免疫提供了更好的前景。这是长期保护的最佳方法。如果你加强免疫，你会得到100倍以上的中和抗体。这篇论文表明，你的中和抗体越高，对你的保护就越好。\n斯托菲尔斯说，疫苗制造商必须迎接挑战，通过安全有效的接种来保护世界70%的人口免受新冠肺炎的伤害。他说，如果他们实现了这一目标，病毒可能会从世界上完全消灭。\n但目前还不清楚冠状病毒抗体能保护人们免受这种疾病多长时间的感染，临床试验也没有证据表明注射一针可以在很长一段时间内预防感染。\n辉瑞首席执行官阿尔伯特·布拉(Albert Bourla)周二表示，他正在为冠状病毒的持续存在做准备，这导致了人们对季节性注射以预防新冠肺炎的长期需求。\n鲍拉说，有一种可能的情况是，要么疫苗的免疫力不会永远持续，要么病毒会发生变异，或者病毒会想方设法一次又一次地卷土重来。\n我希望我们可以用一个、两个、甚至三个助推器来保护人们很长一段时间。他表示：希望到那时，这件事能完成，世界将实现全面的听证豁免权。\n强生从生物医学高级研究与发展局(Biomedical Advanced Research And Development Authority)获得了4.56亿美元的奖励，该公司已经与美国、欧盟和世界各国政府就提供疫苗进行了谈判，如果它在临床上被证明是成功的。斯托菲尔斯说，根据新的数据，这些谈判将取得进展。\n强生的技术是基于人类腺病毒，这是一种普通感冒病毒。这是一种可能最为人所知的方法，因为它在埃博拉疫苗中的使用。\n该公司尚未确定注射的价格，尽管高管表示，在大流行期间，将在非营利性的基础上提供注射。", "note_en": "Johnson &amp; Johnson&#39;s experimental coronavirus vaccine protected macaque monkeys with a single shot in a pre-clinical study, potentially gaining on other vaccines that are further along in testing but require two doses over time.\n   Five of six primates exposed to the pandemic-causing pathogen were immune after a single injection. The exception showed low levels of the virus, according to a study published in the medical journal Nature. Researchers evaluated a total of 52 macaques and seven different vaccine prototypes. The health-care behemoth kick-started human trials on July 22 in Belgium and in the U.S. earlier this week.\n      Although other vaccine-makers have moved more quickly into development, with AstraZeneca having already administered its experimental vaccine to almost 10,000 people in the U.K., gaining protection with a single dose could prove an advantage in the logistical challenge of rolling out massive vaccination programs worldwide.\n          &#34;The findings published today are a very important part of the profile that we can bring to the table over the next few weeks as we work with different countries on reaching advanced agreements&#34; for supply of the still-experimental vaccine, Paul Stoffels, the drugmaker&#39;s chief scientific officer, said in an interview.\n       The primate data show that the coronavirus vaccine candidate generated a strong antibody response, and provided protection with only a single dose, Stoffels said.\n      J&amp;J aims to embark on the last phase of tests in September, compressing the traditional timeline as it races against others including AstraZeneca, Moderna Inc., Pfizer Inc. and GlaxoSmithKline Plc for a shot to end the pandemic.\n       &#34;This is clearly good news,&#34; Louise Chen, a Cantor Fitzgerald analyst said in a Thursday note to investors. &#34;The positive data today is important since J&amp;J has a vaccine platform that has been used before which could ease concerns about the safety of new vaccines being developed for Covid-19.&#34;\n   After slight pre-market gains, J&amp;J fell 0.06% to $146.45 at 12:13 p.m. in New York.\n   The New Brunswick, New Jersey-based drugmaker will test both a one-dose coronavirus shot, and a shot coupled with a booster in its early-stage studies of more than 1,000 adults, which launched this month. As the vaccine candidate accelerates through later-stage trials, data will first report out from the one-dose arm of its trials, and Stoffels said J&amp;J will likely seek an emergency use authorization from regulators for a single shot.\n      The shot-plus-booster regimen, however, poses better prospects for enduring immunity, Stoffels said. &#34;That is the optimal approach for long-term protection. If you give a boost, you get 100-fold more neutralizing antibodies. The paper shows that the higher your neutralizing antibodies, the better for your protection.&#34;\n   Stoffels said vaccine-makers must rise to the challenge of protecting 70% of the world&#39;s population from Covid-19 through safe and effective inoculation. Should they achieve that goal, the virus could be &#34;eliminated from the world entirely,&#34; he said.\n   But it&#39;s not clear how long coronavirus antibodies can protect people from the disease, and clinical trials haven&#39;t yielded proof that a shot could prevent infection for an extended period of time.\n   Albert Bourla, chief executive officer of Pfizer, said on Tuesday that he&#39;s preparing for the coronavirus to endure, leading to long-term demand for a seasonal shot to protect against covid-19.\n   &#34;There is a likely scenario that either the vaccine&#39;s immunity will not be lasting forever,&#34; Bourla said, &#34;or that the virus will mutate, or that the virus will find ways to come back again and again.&#34;\n      &#34;I hope we can protect people for a long time with one, two, or even three boosters. Hopefully, by then, it will be done,&#34; and the world will achieve comprehensive heard immunity, he said.\n   J&amp;J, which received a $456 million award from the Biomedical Advanced Research and Development Authority, has already entered discussions with the U.S., the European Union, and governments around the world about supplying its vaccine should it prove successful in the clinic. Stoffels said those negotiations will advance in light of the new data.\n   J&amp;J&#39;s technology is based on the human adenovirus, a type of common cold virus. It&#39;s an approach that is perhaps best known for its use in an Ebola vaccine.\n   The company has not yet determined a price for its shot, though top executives suggest it will be offered on a not-for-profit basis for the duration of the pandemic.", "posttime": "2020-08-02 05:49:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "疫苗,johnson", "title": "强生疫苗临床前试验表明，它能保护猴子免受新冠肺炎的伤害", "title_en": "Pre-Clinical Test of Johnson & Johnson Vaccine Shows It Protected Monkeys from Covid-19 ", "transed": 1, "url": "https://www.sfgate.com/business/article/J-J-vaccine-protects-monkeys-from-covid-with-15446210.php", "via": "", "real_tags": ["疫苗", "johnson"]}, {"category": "", "categoryclass": "", "imagename": "22c3ddd6d69353d3275c29ae7f6add4a.png", "infoid": 1015667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当谷歌助手问世时，微软在Android上拥有语音助手从来都不是一件容易的事，而且看起来该公司最终已经认输了。从2021年初开始，Android、iOS和几个小平台将停止对Cortana的支持。几个月前，Cortana已经在几个国家被逐步淘汰，但这一变化将是全球性的。\n微软正在将Cortana转变为比Google Assistant和Alexa竞争对手更具生产力的助手。Cortana仍然可以通过Outlook和Teams应用程序在Android上使用，但侧重点有所不同。第三方Cortana Skills将在9月7日失去支持，这距离现在只有一个多月的时间，但全面支持将坚守到2021年初。同样终止支持的还有2021年1月推出的Harman Kardon Invoke智能扬声器和最初的Surface耳机(Surface耳机2从未包含它)。微软将向任何活跃的Invoke用户(任何在2019年7月31日之后发送至少一次Cortana语音请求的人)发送一张价值50美元的礼品卡，Surface耳机用户也将获得一张价值25美元的礼品卡。\n考虑到微软一直在缓慢地取消Cortana，这个消息并不令人惊讶，但我们不禁想知道，真正在Android上使用Cortana的人到底有多少。有没有人猜一猜？", "note_en": "It was never going to be  easy for Microsoft to have a voice assistant on Android when the Google Assistant was out there, and it looks like the company has finally thrown in the towel. Beginning in early 2021, support for Cortana will be ended on Android, iOS, and a couple of small platforms.  Cortana had already been phased out in several countries a few months ago, but this change will be global.\n  Microsoft is transitioning Cortana into more of a productivity assistant than a Google Assistant and Alexa competitor. Cortana will still be available on Android via the Outlook and Teams apps, but with a different focus. Third-party Cortana skills will lose support on September 7th, which is just over a month away, but full support will soldier on until early 2021. Also having support ended are the Harman Kardon Invoke smart speaker in January 2021 and the original Surface Headphones (it was never included in the  Surface Headphones 2). Microsoft will be sending out a $50 gift card to any active Invoke owner (anyone who&#39;s sent at least one Cortana voice request after July 31st, 2019), and  Surface Headphones owners are each being offered a $25 gift card as well.\n Given that Microsoft has been  slowly nixing Cortana, this news doesn&#39;t come as a huge surprise, but we can&#39;t help but wonder just how few people were actually using Cortana on Android. Any guesses?", "posttime": "2020-08-02 04:40:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,android,微软,放弃,basically", "title": "微软基本上放弃了Cortana，Android的支持明年就会消亡", "title_en": "Microsoft is basically giving up on Cortana, Android support to die next year", "transed": 1, "url": "https://www.androidpolice.com/2020/08/01/microsoft-is-basically-giving-up-on-cortana-android-support-to-die-next-year/", "via": "", "real_tags": ["microsoft", "android", "微软", "放弃", "basically"]}, {"category": "", "categoryclass": "", "imagename": "f7cfff067f6af103698efbb1096d660f.jpeg", "infoid": 1015664, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，在美国总统特朗普周五晚些时候表示反对这笔交易后，微软暂停了收购视频分享应用TikTok美国业务的谈判。\n其中一位知情人士说，总统的声明促使TikTok做出更多让步，包括同意在未来三年内在美国增加多达1万个就业岗位，但尚不清楚这些是否会改变特朗普的立场。\n知情人士说，这家软件巨头正在与TikTok的母公司字节跳动有限公司(Byteance Ltd.)进行深入谈判，他们认为这款广受欢迎的应用程序被一家美国公司收购的交易达到了白宫的目标。当特朗普在空军一号上告诉记者，他更倾向于禁止这款应用，不会支持出售时，这些计划被打断了。\n知情人士说，在特朗普发表讲话之前，双方认为协议的大体步骤可能会在周一之前到位。\n一位知情人士表示，总统的言论让这些公司措手不及。另一位人士称，白宫已经参与讨论数周，并从一开始就明确表示，理想的结果是TikTok归“美国所有”。\n在周六的一份声明中，白宫发言人说，“政府对TikTok的国家安全有非常严重的担忧。我们继续评估未来的政策。“。\n知情人士说，交易谈判据信并未结束，但两家公司正在努力澄清白宫的立场，以及是否正在计划采取单独的行动，使TikTok难以在美国运营。\n“就TikTok而言，我们将禁止他们进入美国，”他说。“嗯，我有这个权力。”", "note_en": "Microsoft    MSFT  0.54%  has paused negotiations to buy the U.S. operations of the video-sharing app TikTok after President Trump said late Friday he opposes the deal, according to people familiar with the matter.\n  The president’s statements spurred TikTok to make additional concessions, including agreeing to add as many as 10,000 jobs in the U.S. over the next three years, but it isn’t clear if those will alter Mr. Trump’s stance, one of the people said.\n  The software giant  was in advanced talks with TikTok parent Bytedance Ltd., with momentum toward a deal that they believed met the White House goal for the popular app to get bought by a U.S. company, the people said. Those plans were interrupted when Mr. Trump told reporters on Air Force One that he preferred to ban the app and wouldn’t support a sale.\n  Before Mr. Trump’s remarks, the two sides believed the broad strokes of a deal could be in place by Monday, the people said.\n    The companies were caught off guard by the president’s comments, said one person familiar with the matter. Another person said the White House has been involved in the discussions for weeks and made it clear from the outset that the desired outcome was for TikTok to be “American owned.”\n  In a statement Saturday, a White House spokesperson said, “The administration has very serious national security concerns over TikTok. We continue to evaluate future policy.”\n  The deal talks aren’t believed to be dead, but rather the two companies are trying to get clarity on where the White House stands and whether it is planning a separate action that would make it difficult for TikTok to operate in the U.S., the people said.\n    “As far as TikTok is concerned we’re banning them from the United States,” he said. “Well, I have that authority.”", "posttime": "2020-08-02 04:38:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,microsoft,交易,微软,周五", "title": "消息人士：正就收购TikTok美国业务进行深入谈判的微软在特朗普周五表示反对该交易后暂停谈判", "title_en": "Sources: Microsoft, which was in advanced talks to buy the US operations of TikTok, has paused negotiations after Trump said on Friday that he opposes the deal", "transed": 1, "url": "https://www.wsj.com/articles/microsoft-and-bytedance-put-tiktok-talks-on-hold-after-trump-signals-opposition-11596312611?mod=djemalertNEWS", "via": "", "real_tags": ["美国", "microsoft", "交易", "微软", "周五"]}]