[{"category": "", "categoryclass": "", "imagename": "e14958e2cef462b109f848a582240e98.jpg", "infoid": 1031758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "记者们会气喘吁吁地爬上五段楼梯才能到达他们昏暗昏暗的新闻编辑室，那里的光线从蒙着灰尘的窗户勉强照进来，油灯上的绿色窗帘被烧得千疮百孔。他们摇摇晃晃地走过堆满文件的摇摇晃晃的桌子，走过杂乱无章的小隔间，里面堆满了卷轴校样，局外人猜不到。记者们散发着五级警报的烟雾的恶臭，或者上衣口袋里装满了纸币和前排的手枪，或者因为盛大的舞会而喝醉了，或者因为赛马而浑身是灰。如果他们在笔记本上记着重要的新闻，当他们写作时，一个抄写员会挤在他们的手肘旁，从他们的手中抢走墨水湿透的纸张，然后冲到版权持有人那里，把它们“放进金属里”。\n19世纪的新闻中心排列在市政厅公园周围的街道上，距离靠近港口的华尔街只有很短的距离。消息是顺风传进来的。报纸纵帆船穿过海浪和雾，在不太富裕的纽约报纸带着划艇离开那里之前，让他们的人登上抵达的欧洲轮船。\n在公园街最近的翻修中，建筑工人在墙上发现了新闻记者的文物-报纸和打字机。谁知道那里还会潜伏着什么鬼魂呢？\n“新闻业才是真正的牛头人，”19世纪的记者斯蒂芬·菲斯克(Stephen Fiske)在回顾自己的职业生涯时说。它要求每年都有新的青年男女供应：吞噬他们，摧毁他们，并准备迎接另一批来自大学或乡村城镇的年轻受害者。他十二岁就开始当专栏作家了。其他记者在20多岁的时候大胆地跳了进来，比如德国移民亨利·维拉德(Henry Villard)，他迅速自学了英语，以便报道林肯和道格拉斯的辩论。\n他们几乎完全是匿名的。继承的英国礼仪规定，要求署名是不谦虚的。这可能会鼓励炫耀，甚至会引发鲁莽行为。相反，他们代表自己的团队：“纽约时报”、“纽约论坛报”、“纽约先驱报”等等。就像同时代的牧师被禁止使用I一样，记者们否定了自己拥有自己作品的荣誉。他们把自己的身份植入单词本身。\n他们写得很好，以打动坐在他们旁边的记者，或者其他报纸的竞争对手。他们努力用语言创造一个事件的动人形象或一个重要人物的怪癖。当时的摄影证据很少。记者需要成为那些太远而看不见的人的眼睛。他们在不断迷途的读者中写得很好。一家报纸每年有四分之三的客户流失，报纸需要吸引新的客户。\n记者们写得很快。他们供给街道水平的蒸汽驱动的印刷机，每台印刷机每天为大约50英里的纸张墨水。他们写信给沿着天花板延伸的吊钩传送带，从编辑到工头再到排字工人。故事就像要去屠宰的牛的身体一样悬而未决。当时的一位记者写道：“发烧的铅笔飞舞，每条神经都紧张，每一个脑细胞都是清晰的。”1893年，在纽约市工作的英国记者朱利安·拉尔夫(Julian Ralph)写道：“评论、描述、回忆、对话和解释就像水晶条一样，在不耐烦的小段落上流动。”\n即使在电报的滴答声，编辑的叫喊声，勤杂工的玩笑声，以及赶着最后期限的剪贴工的声音中，他们仍然专注于此。当美联社(Associated Press)标志着当天突发新闻的最终送达时，唯一的解脱出现了。一位名叫梅尔维尔·菲利普斯的编辑回忆说：“通过电线，在薄薄的最后一张纸的末尾传来了欢迎语，‘晚安，’ ”，编辑梅尔维尔·菲利普斯(Melville Philips)回忆道。\n记者混杂在富人中寻找消息来源，或者敢于敲打最肮脏的犯罪窝点。他们听完了批评者的话；一个又高又瘦的作家像钩子一样礼貌地弯下腰，礼貌地听着他不讨好地剖析了剧院经理的演出，恳求重复(表明听力不好)，然后，由于第二次听不懂长篇大论，他再三询问，直到愤怒平息。\n他们争先恐后地提交文件。新闻散布在遥远的城镇，记者会像巨人的眼睛一样把它挖出来，然后带着奖品跑回来，把最近的电报发过来。朱利安·拉尔夫(Julian Ralph)记得在执行任务时与一名论坛报人竞争。“我们不得不在一片冰光灿烂的平原上跑了3英里。他是跑得最快的人，似乎一切都随心所欲，但突然他滑了一跤，滚下了沟壑，从谷底爬了上来，伤得很重。衣服的撕裂和脸部的脱皮并没有打扰到他，但他的脚踝扭伤了，没有人帮助他无法行走。“我放弃了，”他说。“你能帮我到村子里去吗？”“我不知道，”我回答。“这根电线是我的吗？‘ ’”\n虽然读者很少知道谁写了什么，但记者们彼此都很了解。记者们在街上扭打，用手杖打对方。他们在私人聚会场所庆祝。有些人可能足够放荡不羁，在布利克附近百老汇的Pfaff‘s与布鲁克林鹰(Brooklyn Eagle)的前编辑沃尔特·惠特曼(Walt Whitman)喝上一杯啤酒，或者已经在洛托斯俱乐部(Lotos Club)获得了尊敬。但他们更有可能去百老汇和里德街的面包奶酪俱乐部或素描俱乐部。\n他们知道如何探寻故事，识别能够激起情感的振动图像。一位记者回忆起那一天，除了四流的新闻，他和执行主编一起浏览了下午报纸的每一行，寻找第二天的专题。主编大声喊道：“我拿到了！”一名小女婴被发现埋在哈莱姆区。“唯一不寻常的是这个婴儿衣着华丽。”\n执行主编发出命令：“看看婴儿被发现的地方，找到它的警察；跟着它到警察总部的韦伯护士长的房间，所有的弃婴都是在那里第一次被带走的，然后从…的护士长那里得到一份详细的长篇报告。…她经历过的最不寻常的、最奇怪的、最可悲的、感人的或激动人心的经历。然后是…。到抚养这些婴儿的精神病院去，到埋葬他们的陶工地里去。“。\n“晚邮报”(The Evening Post)编辑、诗人威廉·卡伦·布莱恩特(William Cullen Bryant)把他为作家们写的“无可挑剔的索引”(Index Expurgatous)挂在编辑室的墙上，这是他的戒律：“不应该使用Jeapordize。”“无偿的意思是‘免费’。”“珠宝换珠宝。”不要用“牛市和熊市”来形容华尔街。\n他们牺牲了人类的舒适，比如杰拉尔德·哈洛克(Gerald Hallock)，当他的家人住在纽黑文时，他留在了这座城市经营《商业日报》(Journal Of Commerce)。他每天晚上瘫倒在办公室的小床上，孤独地在餐厅用餐，“双臂睡觉”，这是一个专心致志于办公桌的人的形象。在报告火灾时，他掉进了黑暗街道上新挖的地窖里。他告诉一位朋友：“我坐在路边石上摩擦自己，看到火光亮了，我就出发了。”\n朱利安·拉尔夫(Julian Ralph)记得美国最富有的人，在一次采访后困惑地对他说：“你在几个小时内就掌握了错综复杂的金融事务，但除非你的目标是经营一家报纸，否则你坚持这一职业，没有任何金钱上的收益？”拉尔夫没有令人满意的答案。他想用自己的才智填满报纸专栏的愿望令人费解，除了与同行记者和已故记者的关系。\n因为他们的匿名声音，我们知道了三角短裙厂大火，林肯的悲伤，以及征兵骚乱，当时暴力的白人暴徒殴打路人，私刑处死和肢解黑人，烧毁房屋。匿名记者报道了这些事件，包括奇怪的细节，比如昂贵的钢琴被锄头砸碎，镜子被石头砸碎。“一个人拿着总统的画像出现在窗户前，朝上面吐口水，把它扔到膝盖上，扔到街上，很快就被践踏成了原子。然后，六个地方同时冒出了大火。它们蔓延得如此之快，以至于房子里的一些掠夺者不得不通过梯子从窗户逃脱。“。\n他们报道了1896年的热浪，在那次热浪中，1500名纽约人丧生。“最热的地方可能是市政厅前耀眼的沥青路。中午前不久，一名男子举起双手摔倒在那里。当时台阶上的温度计显示水银达到112华氏度。“。\n或者那些幸存下来的人：“第三大道高架铁路下部的封闭结构对东区来说是一天的恩惠。它的下面是真正的阴凉处，如果不是因为潮湿，这个避难所就会很完美了。成百上千的男孩坐在路边，没精打采地玩耍或调皮捣蛋。人们从运河街上方或市政厅下方的烈日中走出来，在隆隆作响的火车下停下来休息呼吸。“。\n他们爬上了自由女神像的内部脚手架，在它被覆上铜之前，用第三人称描述了这一经历。“他往下看，地球似乎比天空还远。一圈圈的梯子消失了，除了框架的铁梁外，似乎没有什么可以下楼的了。下面树梢的摇摆让他感到不安，就像…上方长臂的横扫一样让他感到不安。正当他走到前臂时，一声胜利的呼喊传到了他的耳边。这位(卡通)艺术家双手紧握着利伯蒂的手腕，正在“摸摸她的脉搏”。除了工人外，他是第一个冲进那个令人眼花缭乱的地方的人。以前从来没有人看到过纽约湾如此壮丽的景色。空气清新，除了人的脆弱之外，人的视线没有限制。大船看起来像单桅帆船，纵帆船看起来像帆船，人看起来像移动的棍子。就连布鲁克林大桥也像是地球表面的东西，任何从它下面航行的人都可以用手摸到。“。\n所有的作家都为人类的智力肥料做出了贡献，滋养了未来的想法，但很少有作家比那些匿名的作家更直截了当地做了这件事。正如爱德华·G·约翰·P·威尔金斯(Edward G. P.Wilkins)在谈到他的一位天才同事时所写的那样，“他的作品被埋葬在”先驱报“、”星期六新闻“和”领袖“的文件中，它们将永远被埋葬。”那些记者并没有抱有他们的名字会流传千古的愚蠢幻想。他们跳过了“我从未听说过他”的阶段，立即变成了可能永远有价值的东西：他们的话。\n在皇后区的柏树山公墓，在“一座小山的额头，可以俯瞰方圆数英里的乡村美景，远处有牙买加海湾和海洋”的山顶上，有一个墓地，1871年被纽约记者俱乐部(New York Press Club)买下，最初是为了给“没有朋友的记者”修建360个坟墓。这个空间是为那些“死在城市里，没有办法或倾向于被埋葬在其他地方”的报业人士设计的。在1887年的一个仪式上，数千人聚集在一起，献身于一座刻有38英尺高的方尖碑。在晴朗的天空下，铁路总裁、备受追捧的演说家昌西·德佩(Chauncey Depew)向阵亡将士致敬：“记者除了职责之外，没有任何动机，超越了士兵，并向他的报纸发送了一份令世界兴奋的报道，但没有签名。”\n1866年，一位新闻记者的讣告表达了这位作家对这些人在来世可能会有什么收入的热切希望：“在那里，他将能够看到他在尘世疲惫的朝圣过程中所感动的巨大的心灵，一切都是未知的，就像他曾经做过的那样。在那里，他会发现所有记在帐上的东西--他的一声雷鸣都没有被偷过；也不会有什么可怕的印刷错误使他发烧。“。\n伊丽莎白·米切尔(Elizabeth Mitchell)是“林肯的谎言：通过假新闻、华尔街和白宫实现真正的内战胜利”(Lincoln‘s Like：A True Civil War Caper Through Full News，Wall Street，and the White House)一书的作者。", "note_en": "The reporters would pant up five flights of stairs to reach their dingy, dim newsrooms, where light eked through the dirt-cloaked windows and the green shades over the oil lamps were burned through with holes. They wended through hobbled tables piled high with papers, walked past cubbies so chaotically stuffed with scrolled proofs no outsider could guess the system. The reporters reeked of five-alarm smoke, or had coat pockets bulky with notes and a pistol from the front, or were tipsy from a gala ball, or dusty from a horse race. If they held important news in those notebooks, a copy boy would crowd by their elbow as they wrote, snatch the ink-wet sheets from their hands, and rush them off to the copyholder to “put them into metal.”\n The center of news in the nineteenth century lined the streets around City Hall Park, only a short sprint to Wall Street, close to the harbor. News sailed in on the wind. Newspaper schooners cut through the waves and fog to land their men onboard the arriving European steamers before the less affluent New York newspapers could get out there with their rowboats.\n Amid recent renovations on Park Row, construction workers discovered artifacts of news reporters inside the walls—papers and typewriters. Who knows what ghosts might lurk there still?\n “Journalism is the real Minotaur,” nineteenth-century reporter Stephen Fiske remarked, looking back on his career. “It demands every year a fresh supply of young men and women: devours them, destroys them, and is ready for another batch of tender victims from colleges or country towns.” He had begun as a columnist at age twelve. Other reporters jumped in audaciously in their twenties, such as Henry Villard, a German immigrant who rapidly taught himself English so as to cover the Lincoln–Douglas debates.\n They were almost entirely anonymous. Inherited British etiquette dictated that to claim a byline would be immodest. It would risk encouraging flamboyance, even spark recklessness. Instead, they represented their team: the  New York Times, the  New-York Tribune, the  New York Herald, and on. Like a priest of the same era forbidden to use  I, reporters denied themselves the honor of possessing their writing. They seeded their identity into the words themselves.\n They wrote well to impress the reporter seated next to them, or rivals at the other papers. They strove to create in words the moving image of an event or the quirks of an important person. Photographic evidence was scant at that time. Reporters needed to be the eyes for those too far away to see. They wrote well to lasso in the readers who constantly strayed. Three-quarters of a newspaper’s customers faded away each year, and newspapers needed to lure fresh ones.\n The reporters wrote fast. They fed the street-level, steam-driven presses that each inked some fifty miles of paper each day. They wrote to feed the conveyor belt of hooks that ran along the ceiling, from the editor to the foreman to the typographer. Stories hung like cow carcasses headed to butchery. “The fevered pencil flies, every nerve is strained, every brain-cell is clear,” wrote one reporter of that time. “Comment, description, reminiscence, dialogue, and explanation flow upon the impatient sheets in short paragraphs, like slivers of crystal,” wrote Julian Ralph, a British reporter who worked in New York City, in 1893.\n They focused even amid the clicking of the telegraph, the shouting of the editors, the joking of the office boy, and the copy cutters pressing their deadlines. The only relief came when the Associated Press marked the final delivery of the day’s breaking news. “Over the wires and at the end of the last sheet of flimsy has come the welcome message, ‘Good-night,’ ” one editor, Melville Philips, recalled.\n The reporters mixed among the rich for sources or dared to knock at the most squalid crime dens. They heard out their critics; one tall, thin writer bent like a hook to politely listen to the manager of the theater whose production he had unflatteringly dissected, begged repetition (indicating bad hearing), and then, having failed to make out the tirade a second time, asked again and again, until wrath had withered.\n They competed to file. News lay out in distant towns and the reporter would pluck it like a giant’s eye and race back with the prize to send over the closest telegraph. Julian Ralph remembered competing with a  Tribune man when out on assignment. “We had to run three miles over a plain that was one great glare of ice. He was the faster runner and appeared to have everything his own way, but suddenly he slipped and rolled down the side of a gully to fetch up at the bottom badly hurt. The tearing of his clothes and peeling of his face did not bother him, but his ankle was sprained and he could not walk without help. ‘I give up,’ said he. ‘Will you help me to the village?’ ‘I don’t know,” I replied. “Is the wire mine?’ ”\n Though readers rarely knew who wrote what, the reporters knew each other well. Journalists scuffled in the streets, smacked each other with canes. They celebrated in private gathering spots. A few might be sufficiently bohemian enough to share a beer at Pfaff’s on Broadway near Bleecker with Walt Whitman, the former editor of the  Brooklyn Eagle, or have angled into respectability at the Lotos Club. But they more likely visited the Bread and Cheese Club on Broadway and Reade Streets or the Sketch Club.\n They understood how to dowse for a story, to identify the vibrating image that could stir emotion. A reporter remembered a day with nothing but fourth-rate news unfolding, when he scanned every line of the afternoon paper with the managing editor, hunting for the next day’s feature. The managing editor yelled out, “I have it!” A tiny baby girl had been found buried in Harlem. “The only uncommon item was that the infant was richly dressed.”\n The managing editor gave the orders: “See the place where the baby was found, the policeman who found it; follow it to Matron Webb’s room in the police headquarters, where all foundlings are first taken, and get a long full account from the matron of … the most remarkable, the strangest, most pathetic, moving or stirring experiences she has had… Then … go to the asylum where these babies are brought up, and to the Potter’s Field where they are buried.”\n William Cullen Bryant, editor at the  Evening Post and a poet, hung on the newsroom wall his “Index Expurgatorious” for writers, his commandments for striking out words that failed to chime the way others could: “Jeapordize should not be used.” “Gratuitous means ‘without payment.’ ” “Jewelry for jewels.” Don’t use “bulls and bears” for Wall Street.\n They sacrificed human comforts, like Gerald Hallock who stayed in the city to run the  Journal of Commerce while his family lived in New Haven. He collapsed onto a cot in the office each night, took lonely dinners in restaurants, and “slept on his arms,” the image of a man devoted to his desk. When reporting a fire, he fell into a newly dug cellar in the dark streets. “I sat down on the curbstone to rub myself, and, seeing the light of the fire brighten up, I started for it,” he told a friend.\n Julian Ralph remembers the wealthiest man in the country, baffled, observing to him after an interview: “You mastered the intricacies of financial matters in hours and yet you persist in this profession with no pecuniary gain unless one’s aim is to run a paper?” Ralph had no satisfactory answer. His desire to use his intellect to fill newspaper columns was inexplicable except as a relationship with fellow journalists and the dead ones.\n Because of their anonymous voices, we know about the Triangle Shirtwaist Factory fire, and Lincoln’s sorrows, and the draft riots, when violent white mobs beat passersby, lynched and mutilated Black people, and torched homes. The anonymous journalists reported those incidents including peculiar details, such as expensive pianos smashed with pickaxes, mirrors shattered by stones. “One fellow appeared at a window with a picture of the President, spat on it, split it over his knee and hurled it into the street, where it was quickly trampled into atoms. Then, in a half a dozen places at once, the flames burst forth. So rapidly did they spread that some of the plunderers in the house had to escape from the windows by means of ladders.”\n They covered the heat wave of 1896 during which fifteen hundred New Yorkers perished. “The spot that was perhaps hottest of all was the glaring asphalted pass in front of the City Hall. A man threw up his hands and fell there shortly before noon. A thermometer on the steps at the time held mercury that was at the 112-degree mark.”\n Or those that survived: “The close structure of the lower part of the Third Avenue Elevated Railroad was a boon to the east side all day. Under it was real shade and were it not for the humidity the shelter would have been perfect. Hundreds of boys sat along the curbs, too listless for play or mischief. Men came out of the broiling sun above Canal Street or below the City Hall and stopped to rest and breathe beneath the rumbling trains.”\n They climbed the inner scaffolding of the Statue of Liberty before it was clad with copper, describing the experience in the third person. “He looked downward, and the earth seemed further than the sky. The rounds of the ladders had disappeared and there seemed to be nothing by which to descend but the iron beams of the framework. The swaying of the treetops beneath unnerved him as much as the sweeping movement of the long arm above… Just as he got to the forearm a triumphant shout reached his ears. The [cartoon] artist had both his hands clasped on Liberty’s wrist and was ‘feeling her pulse.’ He was the first that ever burst into that dizzy spot except the workmen. No such glorious view of New York bay was ever obtained before. The air was clear and there was no limit upon the human sight except human frailty. Great ships looked like sloops, schooners like sailboats, men like moving sticks. Even the Brooklyn Bridge seemed a thing of the earth’s surface, which could be touched with the hand by any one sailing under it.”\n All writers contribute to humanity’s intellectual compost, nourishing future ideas, but few do so more plainly than those anonymous writers. As Edward G. P. Wilkins wrote about one of his gifted colleagues, “his writings are buried in the files of ‘The Herald,’ ‘The Saturday Press,’ and ‘the Leader,’ and they are buried forever.” Those reporters did not cherish the silly illusion that their names would echo through the ages. They skipped the stage of “I’ve never heard of him” to immediately become what might be valued forever: their words.\n In the Cypress Hill Cemetery in Queens, on a hilltop at the “brow of a small hill, commanding a beautiful view of the country for many miles around, with Jamaica Bay and ocean in the distance,” is a graveyard, acquired in 1871 by the New York Press Club, originally for 360 graves for “friendless journalists.” The space was intended for newspaper people who “die in the city without means or inclination to be buried elsewhere.” At an 1887 ceremony, thousands gathered to dedicate a thirty-eight-foot obelisk inscribed  . Under sunny skies, Chauncey Depew, the railroad president and sought-after orator, honored the fallen: “The reporter, with no incentive but his duty, outdoes the soldier, and telegraphs to his paper an account that electrifies the world, but bears no signature.”\n An 1866 obituary for a newspaperman expressed the writer’s fervent hope of what such people might earn in the afterlife: “There he shall be able to see the immense masses of mind he has moved, all unknowing and unknown as he has been, during his weary pilgrimage on earth. There he will find all articles credited—not a clap of his thunder stolen; and there shall be no horrid typographical errors to set him in a fever.”\n  Elizabeth Mitchell is the author of Lincoln’s Lie: A True Civil War Caper Through Fake News, Wall Street, and the White House  (October 2020/Counterpoint Press).", "posttime": "2020-10-28 21:23:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "排行榜,newspaper,记者", "title": "报纸排行榜的幽灵", "title_en": "The Ghosts of Newspaper Row", "transed": 1, "url": "https://www.theparisreview.org/blog/2020/10/26/the-ghosts-of-newspaper-row/", "via": "", "real_tags": ["排行榜", "newspaper", "记者"]}, {"category": "", "categoryclass": "", "imagename": "654783c38e3737e1d47c20da8fe0412b.png", "infoid": 1031757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本月早些时候，大卫关于离开Mozilla的发自内心的帖子登上了Hacker News的头版。他原本就很繁忙的网站流量增加了800%，网站在压力下放慢了速度，最终出现故障。Request Metrics为David的博客监控性能和正常运行时间，我们的指标讲述了一个有趣的故事。这里是发生了什么，为什么，以及你可以做些什么来准备你的网站，以应对流量激增。\n大卫的网站使用WordPress。它提供来自MySQL数据库的大部分内容，这是众所周知的性能限制。为了缓解这一问题，David使用Cloudflare缓存站点内容并减少服务器的负载。\nCloudFlare通过控制DNS并在调用您的服务器之前通过其边缘网络路由请求来实现这一点。如果可能，Cloudflare将返回缓存的内容，而不需要调用您的服务器，这在请求量大幅增加时特别有用。它甚至对大多数网站都是免费的，这是相当棒的。\n上午7点40分左右(当地时间)，页面流量开始激增，系统从容不迫地进行了处理。页面加载的中位数在4-6秒是可以接受的。\n到了早上7点50分，流量达到了技术的极限，每分钟大约有100次页面浏览量，用户体验很快就下降了。页面加载时间中值增长到30秒以上。由于无法满足这些请求，该网站在8点10分左右关闭，并保持了大约40分钟的离线状态。\n如果你在这段时间内试图阅读他的帖子，你会有一次令人沮丧的经历。页面需要很长时间才能响应，如果您通过了，它会随着异步内容的加载和呈现而发生变化。我们可以将这些行为作为最大的内容油漆和累积布局偏移来衡量，它们都随着流量的增长而迅速下降。\n很明显，这是很慢的。但是为什么呢？为什么它每分钟的浏览量不能超过100次呢？为什么云焰没有吸收流量？让我们更深入地挖掘这一页，看看发生了什么。\n大卫的Mozilla帖子下面的性能报告显示了他登上HackerNews头版前后的48小时窗口。该页面不仅仅是HTML文档请求；它包括组成该页面的所有静态资产、JavaScript执行和动态请求。\n在流量激增之前，页面的加载时间中值为4-6秒。这没问题，但是对于一个由Cloudflare提供的基本上是静态的站点，我会期望它快得多。\n在中打开站点并在网络DevTools中检查文档请求为我们提供了线索。\n服务器返回一个缓存控制标头，指出此内容不可缓存！CloudFlare遵守该指令，并将每个请求传递给服务器，如cf-cache-status：dynamic所示。\n这样做的最终结果是，Cloudflare在其基础设施中引入了额外的跃点，但没有缓存任何内容，从而降低了站点的运行速度。\n上面的页面性能报告还显示，每次加载页面时都会调用API端点/sidebar.php。此API的性能随流量峰值的下降情况类似，但在最好的情况下需要500ms才能做出响应。\n在DevTools中检查此端点，它将返回我们所期望的HTML片段，即David博客的静态侧栏内容。并且它具有与主文档完全相同的缓存控制头问题。\n通过将侧边栏呈现为异步不可缓存的请求，服务器被迫为每个阅读帖子的人提供至少2个涉及数据库的请求。这极大地限制了博客能够处理的请求数量。\n您的网站与这个不同，但我们可以从这次绩效审计中吸取一些共同的想法。\n该站点正在动态生成侧栏内容。它可能不需要是这样的。每个人的帖子都是相同的广告、流行标签和相关内容。\n动态内容很慢。它很难缓存，而且通常必须异步获取。服务器只需做更多的工作来生成动态内容，而更多的工作总是较慢。\n寻找动态内容，并确保与可以从缓存静态交付的内容相比，它的性能损失真的是值得的。\n该站点设置为一度由Cloudflare缓存，但随着时间的推移，情况发生了变化。在WordPress插件或主机升级过程中的某个地方，缓存控制标头被更改，缓存被破坏。\n软件系统是复杂和不断变化的。一定要时不时地测试一下，并确认每件事都在按其应有的方式工作。\n简单地将Cloudflare添加到站点并不能解决性能问题，也不应该这样做。缓存和边缘网络令人惊叹，但您的站点需要进行配置才能正确使用它们。\n性能不是你以后买的东西，也不是用来固定的。这是您在构建和运行系统时坚持的原则。像Request Metrics这样的性能监控工具可以帮助您集中精力并随着时间的推移提高性能。", "note_en": "Earlier this month,  David’s heartfelt posting about leaving Mozilla made the front page of Hacker News. Traffic increased by 800% to his already-busy website, which slowed and eventually failed under the pressure.  Request Metrics monitors performance and uptime for David’s blog, and our metrics tell an interesting story. Here’s what happened, why, and what you can do to prepare your site for traffic surges.\n  David’s site uses WordPress. It serves most content from a MySQL database, which is a well-known performance limitation. To mitigate this, David uses  Cloudflare to cache the content of the site and reduce the load to his server.\n Cloudflare does this by taking control of DNS and routing requests through their edge network before calling your server. When possible, Cloudflare will return cached content rather than needing to call your server at all, which is particularly useful when request volume goes way up. It’s even  free for most websites, which is pretty awesome.\n  Traffic began to surge to the page around 7:40 AM (local time), and the system handled it in stride. The median page load was acceptable at 4-6 seconds.\n By 7:50 AM, traffic hit the limit of the technology, around 100 page views per minute, and the user experience quickly degraded. Median page load times grew to more than 30 seconds. Unable to fulfill the requests, the site went down at around 8:10 and remained offline for about 40 minutes.\n   If you tried to read his post during that time, you had a frustrating experience. The page took a long time to respond, and if you got through, it was shifting around as asynchronous content was loaded and rendered. We can measure these behaviors as  Largest Contentful Paint and  Cumulative Layout Shift, which both degraded quickly as the traffic grew.\n  Clearly, it was slow. But why? Why couldn’t it serve more than 100 page views per minute? Why didn’t Cloudflare absorb the traffic? Let’s dig deeper into the page and see what’s happening.\n  The performance report below for David’s Mozilla post shows a 48-hour window around the time he made the front page of HackerNews. The page is more than just the HTML document request; it includes all the static assets, JavaScript execution, and dynamic requests that make up the page.\n  Before the surge of traffic, the page had a median load time of 4-6 seconds. That’s  okay but I would have expected a lot faster for a mostly-static site served from Cloudflare.\n Opening the site in and checking the document request in network devtools gives us a clue.\n  The server is returning a  cache-control header that says this content is not cacheable! Cloudflare is honoring that instruction and passing every request through to the server, as denoted by   cf-cache-status: DYNAMIC.\n The net effect of this is that Cloudflare has made the site  slower by introducing an additional hop through their infrastructure, but not caching anything.\n  The page performance report above also shows that an API endpoint,  /sidebar.php is called on every page load. The performance of this API degraded similarly with the traffic spike, but took 500ms to respond in the best of times.\n  Checking this endpoint in devtools, it returns an HTML snippet of what we would expect, the static sidebar content of David’s blog. And it has the exact same  cache-control header problem as the main document.\n By rendering the sidebar with an asynchronous uncacheable request, the server was forced to serve at least 2 database-touching requests for every person reading the post. This greatly limited the number of requests the blog was able to handle.\n  Your website is different from this one, but there are some common ideas that we can take away from this performance audit.\n  This site was producing the sidebar content dynamically. It probably doesn’t need to be. It’s the same advertisements, popular tags, and related content to a post for everyone.\n Dynamic content is slow. It’s hard to cache and it often has to be fetched asynchronously. Servers simply have to do more work to produce dynamic content, and more work is always slower.\n Look for dynamic content and make sure it’s really worth the performance penalty over what could be delivered statically from a cache.\n  This site was set up to be cached by Cloudflare at one point, but over time things changed. Somewhere along the line from a WordPress plugin or hosting upgrade, the  cache-control headers were changed, and the caching was broken.\n Software systems are complex and ever-changing. Be sure to test things out once in a while and confirm that everything is working as it should.\n  Simply adding Cloudflare to the site did not solve the performance issues, nor should it be expected to. Caching and edge networks are amazing, but your site needs to be configured to use them correctly.\n Performance isn’t something you buy or bolt on later. It’s a principle you hold while building and operating a system.  Performance monitoring tools like Request Metrics can help you focus and improve your performance over time.", "posttime": "2020-10-28 21:23:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,博客,新闻,news,缓存", "title": "黑客新闻如何粉碎大卫·沃尔什的博客", "title_en": "How Hacker News Crushed David Walsh Blog", "transed": 1, "url": "https://davidwalsh.name/request-metrics-performance", "via": "", "real_tags": ["黑客", "博客", "新闻", "news", "缓存"]}, {"category": "", "categoryclass": "", "imagename": "d068ac66187fd3b1ff1197d10ccf8ea4.jpg", "infoid": 1031756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "荷兰PAL-V公司今天宣布，其Liberty飞行汽车已获得荷兰车辆管理局的许可，可以在公共道路上行驶。飞行汽车的全名PAL-V Liberty是一架陀螺直升机，转子可以折叠，这样车辆也可以像普通汽车一样在路上行驶，它需要180-330米之间的跑道起飞，但降落只需要30米，无论是在空中还是在路上，它的最高时速都是180公里/小时(112英里/小时)。从道路模式转换为空中模式(反之亦然)需要5到10分钟。Liberty使用普通汽油，行驶里程为1315公里(817英里)。在空中，它可以飞行400-500公里(250-310英里)，并可以在空中停留4.3小时。PAL-V Liberty空载时重664千克(1464磅)。它的燃料箱可以容纳100升。相比之下，本田雅阁的油箱容量约为53升。据该公司称，大约有30名荷兰居民已经订购并支付了Liberty的费用。标价略低于50万欧元(58.7万美元)。目前，批准的只有一辆车。这意味着PAL-V还不能将他们的汽车全面投产。荷兰车辆管理局首先需要确保该公司能够按照相同的质量标准生产每一辆车。PAL-V自2007年以来一直致力于自由号的研发。欧洲航空安全局(European Aviation Safety Agency)仍在审查该公司要求这些车辆获得飞行认证的请求。该公司预计这一许可将于2022年到达。今年8月，美国新罕布夏州将在公共道路上驾驶飞行汽车合法化。看一段PAL-V Liberty在这里行驶的视频，以及在这里(简短地)飞行的视频。有关最新心理学新闻的每周摘要，请订阅我们的“心理学新闻”周刊时事通讯。", "note_en": "The Dutch company  PAL-V today announced that its Liberty flying car  has received permission from the  Netherlands Vehicle Authority to drive on public roads.    The PAL-V Liberty, the flying car’s full name, is a gyro-copter. The rotor can be folded so that the vehicle can also drive on the road like a regular car.  It needs a runway of between 180 – 330 meters for takeoff, but only 30 meters for landings. Both in the air and on the road, its maximum speed is 180 km/hour (112 mph). Converting from road to air mode (or vice versa) takes between five and ten minutes. The Liberty runs on normal gasoline, and has a range of 1315 km (817 miles) on the road. In the air, it can fly 400 – 500 km (250 – 310 milles), and can remain airborne for 4.3 hours. The PAL-V Liberty weighs 664 kg (1464 lbs) when empty. Its fuel tank holds 100 liters. The tank of a Honda Accord, just by way of comparison, holds about 53 liters.     According to the company, about thirty Dutch residents have already ordered and paid for the Liberty. The list price is just under €500,000 ($587,000). At the moment, the granted permission is only for a single vehicle. That means PAL-V cannot yet put their car into full production. The Netherlands Vehicle Authority first needs to ensure that the company can produce every vehicle according to the same quality standards. PAL-V has been working on the Liberty since 2007. The European Aviation Safety Agency is still examining the company’s request to have the vehicles certified to fly. The company expects this permission to arrive in 2022. The US state of New Hampshire  made it legal to drive flying cars on public roads in August of this year.  See a video of the PAL-V Liberty driving  here, and flying (briefly)  here.    For a weekly summary of the latest psychology news, subscribe to our  Psych News Weekly newsletter.", "posttime": "2020-10-28 21:22:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞行,flying", "title": "荷兰飞行汽车获准在欧洲道路上行驶", "title_en": "Dutch flying car gets permission to drive on European roads", "transed": 1, "url": "https://www.psychnewsdaily.com/dutch-flying-car-pal-v-gets-permission-to-drive-on-european-roads/", "via": "", "real_tags": ["飞行", "flying"]}, {"category": "", "categoryclass": "", "imagename": "99c7ae1d5d4959103b2a89a67703345c.jpg", "infoid": 1031755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前几天我遇到了一点危机，我担心我的记忆力开始有问题。一定是出了什么问题！我开始注意到(越来越多！)。我无法回忆起琐碎的事情；例如，一次变焦电话中的行动要点，或者几个月前我读过的一本书中的一句话。这肯定不正常吧？\n在给医生办公室打电话之前，我做了任何正派的忧郁症患者都会做的事情，然后开始用谷歌搜索。在浏览了几页之后，我开始感觉好一点了。这很正常。短期(或工作)记忆是低效的，除非我重温几次我想要记住的东西，否则我很可能会忘记它。不，这不是30岁的副作用。哟。\n这是我们的记忆系统如何设计的一个“特征，而不是一个错误”。\n我们的记忆由三个组成部分组成，不是一个，也不是两个，而是三个：1)感觉寄存器，2)工作记忆，3)长期记忆。\n当我回想起我的童年，或者我记得一些基本的法语单词时，我会利用我大脑中涉及长期记忆的部分。但是，当我试图在脑海中记住几个想法，把它们联系在一起，以便我能理解一个概念或解决一个问题时，我会使用我的工作记忆。\n随着我的健康危机得以避免，我开始思考科技及其对大脑和记忆功能的影响(积极和消极)。我的指尖掌握着我可能需要的所有知识，还有笔记应用程序和智能手机，它们现在已经成为我们身体的延伸--我是懒惰还是效率高，还是两者兼而有之？就像我们过度活跃的战斗或逃跑反应一样，进化难道没有机会适应或追赶我们今天相对于我们祖先的思维吗？\n我们之所以“记不住”事情，是因为我们的工作记忆中所能容纳的东西是有限的。研究人员过去认为它可以容纳大约七个项目或区块，但现在人们普遍认为工作记忆只能容纳大约四个区块的信息。\n如果你像我一样，你必须对自己重复一些东西，直到你有机会把它写下来。需要重复，这样自然消散的过程才不会把记忆吸走。当你集中注意力时，有多少次你发现自己闭上了眼睛，以防止其他事情侵入你工作记忆的有限空间？\n我认为我们需要尽快摆脱我们的工作记忆。\n历史上的目标是，在计算机出现之前，把它移动到长期记忆中。如果这没有发生--你基本上就是在向那段记忆挥手告别。\n将记忆从“工作”转移到“长期”需要时间和练习。\n不管怎样，你的记忆力会急剧下降。所谓的“遗忘曲线”，在你学到东西后的24小时内是最陡峭的。你到底忘记了多少，百分比是不同的，但除非你复习一下材料，否则大部分都会掉进排水沟里。你第一天以后记住的东西很有可能在三十年后仍然保留着。\n为了提高记忆力，通常使用间隔重复。这个技巧包括重复你想要保留的东西，确保把重复隔开。例如，在几天内重复一个新词汇或解决问题的技巧。\n好消息是，我们的长期记忆有容纳数十亿个项目的空间。事实上，可以有太多的物品，他们可以互相埋葬。你可能很难找到你需要的信息，除非你至少练习和重复几次。这使得大脑中的天气连接可以形成并加强为持久的结构。\n长期记忆很重要，因为它是你储存基本概念和技术的地方，这些概念和技术经常涉及到你正在学习的任何东西。\n在你的长期记忆中有坚实的基础也会使工作记忆更有效率，并能够将更广泛、更抽象的领域的点联系起来。它给我们的思维带来了“丰富性”和“联想访问权”。\n丰富性指的是这样一种理论，即大量我们显然已经忘记的事情仍然存在，在某个地方，并为我们的思考增加了深度。联想访问意味着你的思想可以通过语义或知觉关联以多种不同的方式访问 - 记忆可以由相关的单词、类别名称、气味、一首老歌或一张照片触发，甚至可以通过看似随机的神经放电来唤醒它们的意识。\n但现在，当然，我们不会费心去做所有的艰苦工作，把许多事情都放在我们的长期记忆中。我们有设备--和互联网--为我们记住东西。\n当我回想起我开始在iPad和笔记本电脑上写日记的时候，以及使用像黑曜石这样专注于“网络思维”的应用程序时，假设它们如何潜在地影响了我大脑中的基本化学或反馈循环，这是一件很有趣的事情。\n对我来说，它们帮助减轻了我的认知负荷，因为它们让我把大脑中发生的大部分事情卸给了一个外部实体。在今天和这个时代，这种回忆已经变得不那么必要了。识别记忆更为重要(即，判断当前存在的对象、人、地点或事件先前已被遇到或经历的能力)。\n研究表明，互联网的功能类似于一种外在的记忆。正如一项研究指出的那样，“当人们期望将来能够接触到信息时，他们对信息本身的召回率会更低。”\n如果你知道你“知道”某件事，你知道如何检索它(感谢谷歌)，它的功能与大脑充满长期记忆的功能大致相同。新的“网络思维”应用程序允许我们在这些不同的存储知识之间建立有趣的联系，其方式与库存丰富的内存大致相同。\n所以我不会说我们正在失去记忆的能力，就像我在这篇帖子开始时摆的姿势一样。我认为人们(包括我在内)只是没有做足够的工作来将东西从我们的工作记忆转移到我们的长期记忆中。\n我们对回忆记忆的依赖减少，注意力持续时间越来越短，这可能不是我最初担心的灾难。\n我认为，专注于网络思维的互联网和应用程序确实对我们有所帮助。它们确实起到了第二个大脑的作用。我认为这会让我们更有效率。\n萨兰迪·韦斯特福尔在Unspash上的封面照片感谢乔纳森通读了这篇帖子的早期草稿。要进行讨论，请查看黑客新闻上的这篇帖子。", "note_en": "The other day I had a bit of a crisis, I was worried that I was starting to have trouble with my memory. Something had to be wrong! I started to notice (increasingly!) my inability to recall trivial things; for example, the action points from a Zoom call, or a quote from a book that I had read a couple of months ago. Surely this can’t be normal?\n Before calling the doctor’s office I did what any decent hypochondriac would do, and started googling. After clicking through a few pages, I began to feel a bit better. It was normal. Short term (or working) memory  is inefficient, and unless I revisit the thing I’m trying to remember a few times, I’m most likely going to forget it. And no, it’s not a side effect of turning thirty. Phew.\n It’s a “feature, not a bug” of how our memory systems are designed.\n Our memory is made up of not one, nor two, but three components: 1) a sensory register, 2) working memory, and 3) long-term memory.\n When I look back at my childhood or I remember some basic words from French, I&#39;m drawing on portions of my brain involved in long-term memory. But when I&#39;m trying to hold a few ideas in mind to connect them together so I can understand a concept or solve a problem, I&#39;m using my working memory.\n With my health crisis averted, I got thinking about technology and its impact (positive and negative) on the way the brain, and memory, function. With all the knowledge I could ever need at my fingertips, alongside note taking apps and the smartphones that are now an extension of our physical being -- am I being lazy or efficient, or a mixture of the two? Much like our overactive fight-or-flight response, has evolution not had a chance to adapt or catch-up with the mind of today versus our ancestors’?\n  We ‘can’t remember’ things because there is a limit to what we can hold in our working memory. Researchers used to think that it could hold around seven items or chunks, but now it’s widely believed that the working memory only holds about four chunks of information.\n If you’re anything like me you’ll have to repeat something to yourself until you have a chance to write it down. Repetitions are needed so that natural dissipating processes don’t suck the memories away. How many times have you found yourself shutting your eyes to keep other things from intruding into the limited slots of your working memory as you concentrate?\n I believe that we need to offload from our working memory as soon as possible.\n With the goal historically being, before computers, to move it to long-term memory. If this didn’t happen -- you’d essentially be waving goodbye to that memory.\n Moving a memory from ‘working’ to ‘long-term’ takes time and practice.\n There’s a steep drop in what you remember, anyway. The ‘forgetting curve’, as it’s called, is steepest during the first twenty-four hours after you learn something. Exactly how much you forget, percentage-wise, varies, but unless you review the material, much of it slips down the drain. What you remember after day one has a good chance of still being retained after thirty.\n  To improve retention, spaced repetition is typically used. This technique involves repeating what you&#39;re trying to retain, ensuring to space the repetition out. Repeating a new vocabulary word or a problem solving technique for example over a number of days.\n The good news is, our long-term memory has room for billions of items. In fact there can be so many items they can bury each other. It can be difficult for you to find the information you need unless you practice and repeat at least a few times. This allows the synoptic connections in the brain to form and strengthen into a lasting structure.\n Long-term memory is important because it&#39;s where you store fundamental concepts and techniques that are often involved in whatever you&#39;re learning about.\n Having strong foundations in your long-term memory also makes the working memory more efficient, and able to connect dots from wider, more abstract, fields. It gives our thinking ‘richness’ and ‘associative access’.\n Richness refers to the theory that a large number of things we have apparently forgotten all about are still there, somewhere, and add depth to our thinking. Associative access means that your thoughts can be accessed in a number of different ways by semantic or perceptual associations  — memories can be triggered by related words, by category names, by a smell, an old song or photograph, or even seemingly random neural firings that bring them up to consciousness.\n  But now, of course, we don’t bother to do all of the hard work of committing many things to our long-term memory. We have devices -- and the internet -- to remember stuff for us.\n When I think back to when I started journaling on my iPad and laptop, as well as using apps like  Obsidian that are focused on ‘ networked thought’, it is interesting  to hypothesise how they have potentially impacted the fundamental chemistry or feedback loops in my brain.\n For me, they have helped reduce my cognitive load by letting me off-load much of what goes on in my brain to an external entity. In this day and age, this recall memory has become less necessary. Recognition memory is more important (i.e. the ability to judge that a currently present object, person, place, or event, has previously been encountered or experienced).\n Research has shown that the internet functions as a sort of externalised memory. “When people expect to have future access to information, they have lower rates of recall of the information itself,”  as one study puts it.\n If you know that you ‘know’ something, and you know how to retrieve it (thank you Google) that performs pretty much the same function as having a brain stuffed with lots of long-term memories. And the new ‘networked thought’ apps allow us to make interesting connections between these various bits of stored knowledge in much the same way that a well-stocked memory does.\n  So I wouldn’t say we are losing our ability to remember, as I posed at the start of this post. I think people (me included) just don’t do enough work to move stuff from our working memory into our long-term memory.\n Our decreased reliance on recall memory and our  ever-decreasing attention spans may not be the disaster that I first feared.\n I think that the internet and apps focused on network thinking do assist us. They do act as a second brain. And I think that  makes us more efficient.\n  Cover photo by  Sarandy Westfall on  Unsplash Thanks to Jonathan for reading through early drafts of this post. For discussion, check out this post on  Hacker News.", "posttime": "2020-10-28 21:22:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失去,ability,记忆", "title": "我们正在失去记忆的能力吗？", "title_en": "Are we losing our ability to remember?", "transed": 1, "url": "https://st.im/are-we-losing-our-ability-to-remember/", "via": "", "real_tags": ["失去", "ability", "记忆"]}, {"category": "", "categoryclass": "", "imagename": "0627a7b97f6fe46deae88895cfb775a3.jpg", "infoid": 1031754, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一份宣布这一行动的新闻稿中，AGCM表示，它“质疑通过其各种应用程序收集的大量数据的歧视性使用，阻止竞争对手有效竞争，并对消费者造成不利影响”。\n据路透社报道，在此之前，当地广告游说团体意大利IAB提出申诉，称调查必须在2021年11月之前结束。\n具体地说，AGCM表示，它怀疑谷歌存在其所称的“内部/外部歧视行为”--拒绝向竞争对手提供谷歌ID解密密钥，并将第三方跟踪像素排除在外。\n该公司补充称：“与此同时，谷歌据称使用了跟踪元素，使其广告中介服务能够实现一些同等效率的竞争对手无法复制的定向能力。”\n此举出台之际，谷歌正在美国本土被美国司法部(DoJ)起诉。美国司法部在经过16个月的调查后，于本月早些时候提起反垄断诉讼，指控谷歌“在美国的一般搜索服务、搜索广告和一般搜索文本广告市场非法维持垄断”。\n意大利的案例看起来也很有趣，因为谷歌一直在寻求重新架构围绕在线广告定位与隐私的辩论-去年宣布了一项名为隐私沙盒(Privacy Sandbox)的倡议。\n它的目标是将开放的网络标准演变成互联网用户隐私和内容提供商对信息的渴求之间的中间地带，通过广告瞄准访问者(当然，还有它自己的广告技术巨头的人画像货币化模式)-提出一种名为联合群组学习(FLOC)的技术，它标榜为一种“隐私保护”机制，能够在没有个人跟踪的情况下实现广告定向。\n但作为推动标准的一部分，谷歌在今年1月宣布，它正在加快一项计划，逐步取消对第三方跟踪cookie的支持-表示现在希望在未来两年内这样做。因此，与其说这是一次“进化”，不如说是谷歌启动了它的市场力量杠杆。\n虽然浏览器领域的其他公司也一直在打击追踪器，但谷歌在在线广告市场的主导地位意味着，它单方面关闭第三方追踪器的大门，同时保持自己对互联网用户数据的有利可图的访问，显然存在竞争风险。这似乎是意大利竞争主管部门担忧的症结所在。\n此前，欧盟委员会(European Commission)发现谷歌在搜索领域占据主导地位-对其提出要求，以避免滥用其市场力量在其他垂直领域取得进展。\nAGCM表示，其正在调查的行为可能会对整个数字广告领域的竞争产生重大影响，并可能“对竞争对手和消费者产生广泛影响”。\n报告写道：“事实上，在数字广告中介领域缺乏竞争，可能会减少分配给网站制作人和出版商的资源，从而降低面向最终客户的内容质量。”报告还暗示，缺乏“基于价值的有效竞争”可能会阻碍对消费者侵扰性较小的创新新广告技术和广告技术的发展。\n因此，换句话说，谷歌在数字广告领域的主导地位可能会损害出版商和互联网用户，并阻碍真正保护隐私的广告技术的发展。\n其他地方对广告技术双头垄断扭曲市场的力量提出了大量这样的担忧。\n在今年夏天发布的一份针对在线广告市场的最终报告中，英国竞争和市场管理局(CMA)得出结论，谷歌和Facebook的市场力量现在如此强大，需要一种新的监管方法-以及一个专门的监管机构-来解决它所称的“广泛和自我强化”的担忧。\n“搜索和社交媒体领域的弱竞争导致创新和选择减少，并导致消费者放弃了比他们想要的更多的数据。数字广告领域的弱竞争提高了整个经济中商品和服务的价格，削弱了报纸和其他机构生产有价值内容的能力，从而损害了更广泛的社会，“CMA警告说。\n“我们担心的是，这类平台有动机以巩固自身竞争优势的方式解读数据保护法规，包括拒绝第三方访问定位、归属、核实以及费用或价格评估所需的数据，同时保留他们在自己的围墙花园内使用这些数据的权利，”它补充道。\n报告的结论是，“有一个令人信服的理由，需要发展一种有利于竞争的事前监管制度，监督由数字广告资助的在线平台的活动”--谷歌一直在游说欧盟委员会(European Commission)不要这么做，因为地区立法者正在为看门人平台制定新的泛欧盟规则。", "note_en": "In a  press release announcing the action the AGCM said it “questions the discriminatory use of the huge amount of data collected through its various applications, preventing rivals from competing effectively as well as adversely affecting consumers”.\n The probe follows a complaint by local ad lobby group the IAB Italy, per  Reuters, which says the investigation must be concluded by November 2021.\n  Specifically, the AGCM said it suspects Google of what it refers to as “internal/external discriminatory conduct” — by refusing to provide competitors with Google ID decryption keys and excluding third-party tracking pixels.\n “At the same time, Google has allegedly used tracking elements enabling its advertising intermediation services to achieve a targeting capability that some equally efficient competitors are unable to replicate,” it adds.\n  The move comes as Google is being sued on home turf by the US Department of Justice (DoJ), which filed an antitrust case  earlier this month — following a 16 month investigation —  alleging  Google is “unlawfully maintaining monopolies in the markets for general search services, search advertising, and general search text advertising in the United States.”\n The Italian case also looks interesting as Google has  been seeking to reframe the debate around online ad targeting vs privacy — announcing  an initiative called Privacy Sandbox last year.\n Its aim is to  evolve open web standards towards a  middle ground between Internet users’ privacy and content providers’ hunger for information to target visitors with ads (as well as, of course, its own people-profiling monetization model as an adtech giant) — proposing a technique called federated learning of cohorts (FloC) which it bills as a “privacy-preserving” mechanism to enable ad targeting without individual tracking.\n  But as part of that standards push, this  January Google announced it was dialling up a plan to phase out support for third party tracking cookies — saying it now wanted to do so within the next two years. So it’s not so much an ‘evolution’ as Google cranking its market power lever.\n While others in the browser space have  also been clamping down on trackers, Google’s dominance of the online ad market means there are clear competition risks to it unilaterally shutting the door on third party trackers while maintaining its own lucrative access to Internet users’ data. And that seems to be the crux of the Italian competition authority’s concern.\n Google has previously been found to be dominant in search by the European Commission — putting requirements on it to avoid abusing its market power to advance in other verticals.\n The AGCM suggests that the conduct it’s investigating could have a significant impact on competition across the digital advertising space, as well as flagging the potential for “wide repercussions on competitors and consumers”.\n “The absence of competition in the intermediation of digital advertising, in fact, might reduce the resources allocated to website producers and publishers, thus impoverishing the quality of content directed to end customers,” it writes, also suggesting that a lack of “effective competition based on merits” could discourage the development of innovative new adtech and ad techniques that are less intrusive for consumers.\n So, in other words, Google’s dominance of the digital ad space could be damaging both publishers and Internet users, and holding back the development of genuinely privacy-preserving adtech.\n Plenty of such concerns have been raised elsewhere about the market distorting power of the adtech duopoly.\n In a final  report into the online ad market this summer, the UK’s Competition and Markets Authority (CMA) concluded that the market power of Google and Facebook is now so great that a new regulatory approach — and a dedicated regulator — is needed to address what it described as “ wide ranging and self reinforcing” concerns.\n “Weak competition in search and social media leads to reduced innovation and choice and to consumers giving up more data than they would like. Weak competition in digital advertising increases the prices of goods and services across the economy and undermines the ability of newspapers and others to produce valuable content, to the detriment of broader society,” the CMA warned.\n “Our concern is that such platforms have an incentive to interpret data protection regulation in a way that entrenches their own competitive advantage, including by denying third parties access to data that is necessary for targeting, attribution, verification and fee or price assessment while preserving their right to use this data within their walled gardens,” it added.\n The report concluded that there is a “compelling case for the development of a pro-competition ex ante regulatory regime, to oversee the activities of online platforms funded by digital advertising” — something Google has been  lobbying the European Commission  not to do as regional lawmakers  shape new pan-EU rules for gatekeeper platforms.", "posttime": "2020-10-28 20:59:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,google,谷歌,广告,展示", "title": "\n谷歌展示广告业务在意大利接受反垄断调查", "title_en": "\n\t\t\t\tGoogle’s display advertising business is under antitrust probe in Italy\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/googles-display-advertising-business-is-under-antitrust-probe-in-italy/", "via": "", "real_tags": ["rust", "google", "谷歌", "广告", "展示"]}, {"category": "", "categoryclass": "", "imagename": "0c84e4c2901e6e68ecdcf29f83c15bea.png", "infoid": 1031753, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "💪社区将继续是一个宽泛的术语，但最终个人和公司将完全理解，受众并不意味着社区。\n追随十年前客户成功的脚步，🪑社区最终将在谈判桌上获得一席之地。社区将在组织内成为自己的部门，从而产生更多的社区负责人、首席社区干事和其他社区领导角色。\n✨继续对社区中的角色进行专业化。社区经理将转变为社区参与、社区营销、社区支持、社区成功等。\n🙋，然后我们将看到社区下的其他角色开始合并。社区、客户支持和客户成功将重叠并开始融合在一起。传统的CS角色仍将存在，但更多的“低级”支持将转移到社区和社区团队。\n📈越来越多的公司将很早就投资于社区，在最初的10或20名员工中聘用他们的第一个社区角色。社区将成为本世纪20年代开始的初创企业的标准。\n💼是LinkedIn的分拆。就像Dribble之于设计师一样，我们将看到护士、营销人员、社区经理和其他所有垂直职业，提供针对特定类型的社区、“投资组合”和更好的求职体验。\n🎁对Reddit的拆分。每个subreddit都会有自己的专用社区应用程序，专门为满足该垂直行业的独特需求而构建。垂直专用性将战胜一般的社区平台。\n现有产品和服务的🚗社区驱动版本将继续构建，最终取代那些没有社区构建的产品和服务。请参见公共VS罗宾汉。\n📣互动音频和音频社区将继续增长。Spotify将以自己的产品进入市场，或者收购现有的播放器，就像他们最初进入播客时一样。\n🕺我们将看到社区平台空间的创新。现在的一切看起来都像是某种形式的论坛或“社区松弛”。我们将看到一些平台从头开始重新思考社区的概念，其方式不如“论坛”那么有条理。\n🌍远程工作的爆炸式增长将继续推动各个级别(线上和线下、本地和全球)对社区的更大需求。预计会有更多的公司在NextDoor的空间建造垂直建筑。\n🤑公司将继续收购社区，作为自己的起点。请参阅外联+销售黑客、条纹+独立黑客和DigitalOcean+苏格兰威士忌。\n💡越来越多的公司将建立感兴趣的社区，而不仅仅是客户支持社区。这将使他们的社区能够接触到更广泛的受众，并最终被视为创收者，而不是成本中心。\n💬一些独立的社区将发展成为成熟的企业和媒体“帝国”，因为它们将超越最初的社区。\n工具的🛠整合。我们目前正处于社区、参与度和活动工具的黄金时代，但在接下来的十年里，我们将看到主要参与者开始领先，收购竞争对手，并最终“取胜”。我们还将看到现有的公司(Salesforce、Slake等)通过收购目前正在建设的公司来更多地投资于社区。\n🙊加大创新力度将发生在适度空间。随着社区在组织中的提升，公司最终会想要投资于工具，以帮助使适度变得更容易，并减少对纯粹人力的依赖。\n🏢公司将更像对待社区一样对待他们的内部团队，内部社区团队将会扩大，特别是在拥有1,000多名员工的COS。远程优先的公司将引领这一趋势，需要更有意识地培养内部社区。\n👋继续将互联网朋友正常化，即你在在线社区中认识的人，而不是面对面的人。这在游戏界十年或更长时间里一直很正常，但它将蔓延到职业朋友和人际关系。\n🏃‍♀️面对面活动将在Covid之后迅速回归，但它们将更小、更亲密，专注于真正的联系。我们还需要一段时间才能再次看到500人以上的大型活动和会议。\n📆公司将继续投资于在线活动和参与，因为他们意识到，为了降低成本和管理费用，他们可以实现更大的覆盖范围。面对面会议将采用混合模式，除物理位置外还提供虚拟访问。\n对于社区(尤其是组织内部)在未来十年将如何发展，您有什么自己的预测吗？在下面的帖子中分享它们！👇", "note_en": "💪  Community will continue to be a broad term, but finally people and companies will fully grasp that an audience does not mean the same thing as a community.\n 🪑  Community will finally get a seat at the table, following in the footsteps of customer success from a decade ago. Community will become its own department within orgs, leading to more Heads of Community, Chief Community Officers, and other community leadership roles.\n ✨  Continued specialization of roles in community. Community Manager will turn into Community Engagement, Community Marketing, Community Support, Community Success, etc.\n 🙋  And then we’ll see other roles start to merge under community. Community, customer support, and customer success will overlap and start to blend together. Traditional CS roles will still exist, but more ‘low-level’ support will be offloaded to communities and community teams.\n 📈  More and more companies will invest in community early, hiring their first community roles in their first 10 or 20 employees. Community will be standard for startups started in the 2020s.\n 💼  The unbundling of LinkedIn. What Dribbble is to designers, we’ll see for nurses, marketers, community managers, and every other career vertical, providing community, ‘portfolios’, and better job hunting experiences tailored to the specific type.\n 🎁  The unbundling of Reddit. Every subreddit will get its own dedicated community app, built specifically to serve the unique needs of that vertical. Vertical specificity will win out over general community platforms.\n 🚗  Community-driven versions of existing products and services will continue to be built, eventually taking over those who built without community. See Public vs Robinhood.\n 📣  Interactive audio and audio communities will continue to grow. Spotify will enter the market with their own offering, or acquire an existing player similarly to when they initially entered podcasting.\n 🕺  We’ll see innovation in the community platform space. Everything right now looks like some form of forum or ‘Slack for community’. We’ll see platforms that rethink the idea of community from the ground up, in less structured ways than ‘forums’.\n 🌍 The explosion of remote work will continue to drive  a greater need for community at every level, online and offline, locally and globally. Expect more companies to build verticals in Nextdoor’s space.\n 🤑  Companies will continue to acquire communities as starting points for their own. See Outreach + Saleshacker, Stripe + Indiehackers, and DigitalOcean + Scotch.\n 💡  More and more companies will build communities of interest, rather than just customer &amp; support communities. This will enable their communities to reach a wider audience, and ultimately be seen as revenue generators rather than cost centers.\n 💬  A number of independent communities will turn into full-fledged businesses and media ‘empires’ as they grow beyond the community they started with.\n 🛠  Consolidation of tools. We’re currently in a golden age of community, engagement and event tools, but over the next decade we’ll see major players start to lead, acquire competitors, and ultimately ‘win’. We’ll also see existing companies (Salesforce, Slack, etc) invest more in community by acquiring companies that are being built right now.\n 🙊  Increased innovation will occur in the moderation space. As community gets elevated in organizations, companies will finally want to invest in tools to help make moderation easier and less dependent on pure manpower.\n 🏢  Companies will treat their internal teams more like communities, and there will be an expansion of internal community teams, especially at cos with 1,000+ employees. Remote-first companies will set this trend, needing to be more intentional about fostering internal community.\n 👋  Continued normalization of internet friends, people that you met in online communities rather than in-person. This has been normal for a decade or more in the gaming world, but it will bleed over to professional friends and relationships.\n 🏃‍♀️  In-person events will come back quickly post-Covid, but they will be smaller and more intimate, focusing on genuine connection. It will be a while before we see large 500+ person events and conferences again.\n 📆  Companies will continue to invest in online events and engagement as they realize how much larger of a reach they can achieve for lower cost and overhead. In-person conferences will adopt hybrid models, offering virtual access in addition to their physical locations.\n  Have any predictions of your own for how community (especially within organizations) will evolve over the next decade? Share them in the thread below! 👇", "posttime": "2020-10-28 20:54:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,年代,predictions,社区", "title": "对2020年代社区的20个预测", "title_en": "20 Predictions for Community in the 2020s", "transed": 1, "url": "https://the.community.club/mac/20-predictions-for-community-in-the-2020s-2ec3", "via": "", "real_tags": ["2020", "年代", "社区"]}, {"category": "", "categoryclass": "", "imagename": "39ddde4c274d251badf844f3a2b613c2.png", "infoid": 1031752, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BioRxiv-生物学预印服务器，由研究和教育机构冷泉港实验室运营", "note_en": "bioRxiv - the preprint server for biology, operated by Cold Spring Harbor Laboratory, a research and educational institution", "posttime": "2020-10-28 20:53:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "传播,cov,生物学", "title": "SARS-CoV-2尖峰D614G变异株增强了复制和传播性", "title_en": "SARS-CoV-2 spike D614G variant confers enhanced replication and transmissibility", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/2020.10.27.357558v1", "via": "", "real_tags": ["传播", "cov", "生物学"]}, {"category": "", "categoryclass": "", "imagename": "abb2356aa724febde3ea6586da855f03.jpg", "infoid": 1031751, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是一名消费者技术专家，撰写关于Windows、PC、笔记本电脑、Mac、宽带等的文章。\n谷歌在搜索引擎领域的主导地位可能会受到威胁，因为有报道称，苹果正在加强自己的搜索引擎。\n英国“金融时报”报道称，苹果正计划攻击谷歌(Google)，与此同时，该公司正面临反垄断机构的严格审查，后者也威胁要遏制这家搜索领军企业对该行业的控制。\n英国“金融时报”指出，苹果在iOS 14中悄悄地加强了自己的搜索服务，但默认的搜索引擎仍然是谷歌-根据“纽约时报”最近的一篇报道，这家搜索巨头每年向苹果支付80-120亿美元。\n这只是反垄断机构正在考虑的因素之一，他们担心此类交易会在“多个市场造成持续的、自我强化的垄断”。\n英国“金融时报”称，越来越多的迹象表明，苹果准备在监管机构对谷歌采取行动之前发动先发制人的打击。\n谷歌前工程主管比尔·考夫兰(Bill Coughran)向英国“金融时报”表示，该公司在两年多前聘请了谷歌搜索主管约翰·詹南德雷亚(John Giannnandrea)，此后一直在公开招聘搜索工程师，以至于苹果拥有一支“可信的团队”来“打造一个更通用的搜索引擎”。\n有迹象表明，搜索引擎可能已经开始运行，网站管理员报告称，该公司的网络爬虫程序Applebot的活跃度增加，该程序在网络上搜索要索引的新网站和内容。\n苹果是少数几家有资源挑战谷歌的公司之一。拥有超过2万亿美元的市值和约2000亿美元的现金在手，该公司不仅有能力拒绝从谷歌获得的资金，而且有能力投资于创建一个有竞争力的搜索引擎所需的服务器基础设施。\n苹果搜索引擎几乎肯定会有一个巨大的卖点：增加用户隐私。\n近年来，苹果公司通过坚持“隐私是一项基本人权”和“我们的核心价值观之一”，努力与竞争对手保持距离。与DuckDuckGo等竞争对手一样，苹果可能会尝试建立一个搜索引擎，既不存储个人信息，也不跟踪整个网络的用户。\n这对苹果来说会更容易，因为与谷歌不同的是，它不依赖广告收入，而广告收入受益于个性化的数据，用来瞄准用户。\n最大的问题是，苹果是会寻求向整个世界开放搜索引擎，还是会限制其仅供苹果设备或浏览器的用户使用，从而成为购买iPhone、iPad和电脑的另一个原因。根据NetMarketShare的数据，虽然Safari在所有移动浏览会话中占四分之一，但其桌面份额很小，市场份额不到4%，几乎所有的市场份额都在Mac平台上。", "note_en": "I am a consumer tech expert writing about Windows, PCs, laptops, Mac, broadband and more.\n Google’s dominance of the search engine landscape could be under threat with reports that Apple is ramping up its own search engine.\n  The  Financial Times reports that Apple is planning to attack Google, just as the company faces intense scrutiny from antitrust authorities, who are also threatening to curb the search leader’s grip on the industry.\n  The FT notes that Apple has quietly beefed up its own search offering in iOS 14, but the default search engine continues to be Google - something for which the search giant pays Apple between $8-$12 billion per year, according to a recent report in  The New York Times.\n  That is just one of the factors being considered by antitrust authorities, who are concerned that such deals create “continuous and self-reinforcing monopolies in multiple markets”.\n    There are increasing signs that Apple is ready to launch a pre-emptive strike before the regulators get their teeth into Google, the FT claims.\n     The company hired Google’s head of search, John Giannnandrea, over two years ago and has been openly recruiting search engineers since, to the point where Apple has a “credible team” to “build a more general search engine”, according to a former Google engineering chief, Bill Coughran, who spoke to the FT.\n  There are signs that search engine may already be operational, with webmasters reporting increased activity from Applebot, the company’s web crawler, which explores the web in search of new sites and content to index.\n    Apple is one of the few companies that has the resources to take on Google. With a market cap of over $2 trillion and around $200 billion of cash in hand, the company has the ability to not only turn away the money received from Google but to invest in the server infrastructure required to create a competitive search engine.\n    An Apple search engine would almost certainly have one massive selling point: increased user privacy.\n  Apple has made great efforts to distance itself from rivals in recent years by insisting that “privacy is a fundamental human right” and “one of our core values”. Like rivals such as DuckDuckGo, Apple may attempt to build a search engine that doesn’t store personal information nor track users across the web.\n  That would be easier for Apple because, unlike Google, it’s not reliant on advertising income, which benefits from personalized data with which to target users.\n  The big question is whether Apple would look to open up a search engine to the world at large or restrict its usage to owners of Apple devices or browsers, making it another reason to buy iPhones, iPads and computers. While Safari is used for a quarter of all mobile browsing sessions, according to NetMarketShare, its desktop share is tiny, with less than 4% market share, almost all of which is on the Mac platform.", "posttime": "2020-10-28 20:53:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,google,苹果,谷歌,展开", "title": "报道称，苹果大楼搜索引擎将与谷歌展开竞争", "title_en": "Apple Building Search Engine to Take on Google, Report Claims", "transed": 1, "url": "https://www.forbes.com/sites/barrycollins/2020/10/28/apple-building-search-engine-to-take-on-google-report-claims/", "via": "", "real_tags": ["apple", "google", "苹果", "谷歌", "展开"]}, {"category": "", "categoryclass": "", "imagename": "7cea43dfdb3de20b248eb7599bec79f9.png", "infoid": 1031750, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "某些Word功能无法在Google Docs中显示，如果您进行更改，这些功能将被删除", "note_en": "Some Word features can&#39;t be displayed in Google Docs and will be dropped if you make changes", "posttime": "2020-10-28 20:48:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免受,protecting,功能", "title": "保护自己免受新冠肺炎气溶胶传播的常见问题", "title_en": "FAQs on Protecting Yourself from Covid-19 Aerosol Transmission", "transed": 1, "url": "https://docs.google.com/document/d/1fB5pysccOHvxphpTmCG_TGdytavMmc1cUumn8m0pwzo", "via": "", "real_tags": ["免受", "功能"]}, {"category": "", "categoryclass": "", "imagename": "845f67c8eae03f537dbc26697dda7e2d.jpg", "infoid": 1031749, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MachEye不仅是其创始人兼首席执行官Ramesh Panuganty所说的“低准备、无准备”的BI平台，而且它使用自然语言处理，允许任何人使用自然语言查询数据-然后它可以自动生成交互式数据故事，将答案放在上下文中。这与它更多地以仪表板为中心的竞争方式截然不同。\nPanuganty说：“我过去也看到过商业智能问题。”“我看到传统的商务智能，尽管它已经存在了三四十年了，但它的范式是‘你所要求的就是你所得到的’。”因此，业务用户通过电子邮件、电话或当面询问问题，然后他会得到该问题的答案。这基本上带来了依赖专家的挑战，有一段时间会浪费在获得答案上-然后就是缺乏业务用户的探索能力。而更大的问题是，他们不知道他们不知道的事情。“。\n帕努甘蒂的背景包括在太阳微系统公司(Sun Microsystems)和贝尔实验室(Bell Labs)工作过一段时间，在成为企业家之前从事操作系统方面的工作。在过去的12年左右的时间里，他创建了三家公司。第一个是被Cognizant收购的云管理平台Cloud365。第二家是分析公司Drastin，该公司于2017年被Splunk收购，第三家是人工智能驱动的教育平台SelectQ，Thinker于今年4月收购了该公司。他还拥有15项与机器学习、分析和自然语言处理相关的专利。\n考虑到他的过往记录，风投们为什么也想投资他的新创业公司可能也就不足为奇了。Panuganty告诉我，当他与Canaan Partners会面时，他并不是真的在寻找投资。他在构建SelectQ时已经与团队进行了交谈，但迦南从未进行过投资，因为该公司在需要筹集更多资金之前就被收购了。但在一次持续了一天大部分时间的非正式会议之后，他在第二天早上收到了一份工作机会。\nMachEye的方法绝对是独一无二的。Panuganty说：“在企业数据上生成视听视频，我们可能是唯一一家这样做的公司。”但需要注意的是，它还提供了BI服务的所有常见外观。如果您真的想要仪表板，您可以构建仪表板，开发人员也可以使用公司的API在其他地方使用他们的数据。该服务可以从大多数标准数据库和数据仓库服务中提取数据，包括AWS RedShift、Azure Synapse、Google BigQuery、Snowflake和甲骨文。该公司承诺，从连接数据源到能够询问有关该数据的问题只需要30分钟。\n有趣的是，MachEye的定价计划是按座位计算的，并不限制您可以查询的数据量。有一个免费的套餐，但没有自然的搜索和查询功能，18美元/月/用户的套餐增加了这些功能和额外的搜索功能，但需要企业计划才能获得音频解说和其他高级功能。该团队之所以能够使用此定价模型，是因为它能够快速启动容器基础设施以回答查询，然后立即将其再次关闭-所有这些都在大约两分钟内完成。", "note_en": "MachEye   is not just what its founder and CEO Ramesh Panuganty calls a “low-prep, no-prep” BI platform, but it uses natural language processing to allow anybody to query data using natural language — and it can then automatically generate interactive data stories on the fly that put the answer into context. That’s quite a different approach from its more dashboard-centric competition.\n “I have seen the business intelligence problems in the past,” Panuganty said. “And I saw that Traditional BI, even though it has existed for 30 or 40 years, had this paradigm of ‘what you ask is what you get.’ So the business user asks for something, either in an email, on the phone or in person, and then he gets an answer to that question back. That essentially has these challenges of being dependent on the experts and there is a time that is lost to get the answers — and then there’s a lack of exploratory capabilities for the business user. and the bigger problem is that they don’t know what they don’t know.”\n   Panuganty’s background includes time at Sun Microsystems and Bell Labs, working on their operating systems before becoming an entrepreneur. He build three companies over the last 12 years or so. The first was a cloud management platform, Cloud365, which was acquired by Cognizant. The second was analytics company Drastin, which got  acquired by Splunk in 2017, and the third was the AI-driven educational platform SelectQ, which Thinker  acquired this April. He also holds 15 patents related to machine learning, analytics and natural language processing.\n  Given that track record, it’s probably no surprise why VCs wanted to invest in his new startup, too. Panuganty tells me that when he met with  Canaan Partners,   he wasn’t really looking for an investment. He had already talked to the team while building SelectQ, but Canaan never got to make an investment because the company got acquired before it needed to raise more funding. But after an informal meeting that ended up lasting most of the day, he received an offer the next morning.\n  MachEye’s approach is definitely unique. “Generating audio-visuals on enterprise data, we are probably the only company that does it,” Panuganty said. But it’s important to note that it also offers all of the usual trappings of a BI service. If you really want dashboards, you can build those, and developers can use the company’s APIs to use their data elsewhere, too. The service can pull in data from most of the standard databases and data warehousing services, including AWS Redshift, Azure Synapse, Google BigQuery, Snowflake and Oracle. The company promises that it only takes 30 minutes from connecting a data source to being able to ask questions about that data.\n Interestingly, MachEye’s pricing plan is per seat and doesn’t limit how much data you can query. There’s a free plan, but without the natural search and query capabilities, an $18/month/user plan that adds those capabilities and additional search features, but it takes the enterprise plan to get the audio narrations and other advanced features. The team is able to use this pricing model because it is able to quickly spin up the container infrastructure to answer a query and then immediately shut it down again — all within about two minutes.", "posttime": "2020-10-28 20:31:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,商业智能,intelligence", "title": "\nMachEye为其商业智能平台筹集460万美元", "title_en": "\n\t\t\t\tMachEye raises $4.6M for its business intelligence platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/macheye-raises-4-6m-for-its-business-intelligence-platform/", "via": "", "real_tags": ["商业", "商业智能"]}, {"category": "", "categoryclass": "", "imagename": "8dc928484b8b36adc7082b9a52ef5a0d.jpg", "infoid": 1031748, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "惠灵顿管理公司(Wellington Management)、TSG Consumer Partners、CPP Investments和贝莱德(BlackRock)管理的基金等一些最大的机构融资公司，就在这家游戏巨头在另一轮后期融资中筹集了2亿美元仅一年后，就向这家游戏巨头投入了更多资金。\nScopely联席首席执行官沃尔特·德雷弗(Walter Driver)表示：“我们看到，作为一个类别，公开市场投资者对互动娱乐的胃口很大。”“我们对跨界并投资Scopely感到兴奋。”\n据一位知情人士透露，这些传统上是IPO前的后期投资者加入了NewView Capital、Battery Ventures、Greycroft、Innovation Growth和Highland Capital Partners的融资行列，对该公司的估值为33亿美元。\n联席首席执行官沃尔特·德雷弗(Walter Driver)表示，这笔巨额意外之财对Scopely的战略没有任何意义，因为这项已经利润丰厚的业务继续以有机方式增长，并通过收购主要手机游戏制片厂的战略实现增长。\n与其他在游戏市场拿下数十亿美元的大公司(主要是Epic Games和联合利华)不同的是，斯科普利并不生产游戏工具。这家总部位于洛杉矶的公司的重点完全是游戏本身和在游戏上花费数十亿美元的玩家。\nDriver说：“Scopely专注于建立端到端的出版能力和开发能力，这将在未来几年与玩家建立最长的合作关系。”“这一领域发展非常迅速，我们已经呈指数级增长。如果我们想成为该空间的领先公司，我们必须像在该空间领先的公司一样资本化。“。\n就市值而言，没有其他手机游戏工作室能与之相提并论。该公司最接近的竞争对手，无论是在附近还是在战略上，都可能是另一家总部位于洛杉矶的手机游戏公司Jam City，据报道，该公司的估值为11亿美元。\nDriver说，Scopely并不回避开发平台技术的各个方面，这些技术为Epicand Unity带来了数十亿美元的估值，但它不会将这些工具出售给其他公司。\n他说：“我们的信念是，从长远来看，这个领域最有价值的公司将完全垂直整合，并拥有专有技术平台。”\n对于Scopely来说，技术开发完全是关于留住用户，以及开发出版能力和开发能力，这将帮助公司及其游戏与日益扩大和日益精明的游戏玩家受众保持相关性。\n该公司着眼于未来。它正在考虑将更多的游戏在台式机、移动设备和游戏机平台之间移动，因为游戏正在演变为可以在这些不同的系统上玩。虽然这并不意味着要为增强现实或虚拟现实硬件进行开发，但Driver并不排除这一可能性。\n“我们确实认为，新的流派和消费者体验将继续创新，平台之间将会有更多的融合和交叉授粉。Scopely将专注于以玩家为中心的方法，而不是以设备为中心的方法。“Driver说。\n对于Driver和他的联合创始人哈维尔·费雷拉(Javier Ferreira)来说，Scopely的增长-以及整个游戏行业的增长-代表着消费者希望获得娱乐的方式的演变。\nScopely的玩家每天花80分钟玩“星际迷航舰队指挥部”、“漫威打击力量”、“拼字游戏Go”和“与好友一起玩Yahtzee”等游戏，而这些时间实际上是花在社交上的。\n“人们已经发现--关注这个空间的投资者也发现，人们重视从互动体验中获得的联系。”不仅仅是我们和球员之间的关系，还有他们彼此之间的关系。“Driver说。“在大多数被动消费的媒体体验中，你没有身份。你没有朋友。“。\n或者，用更赤裸裸的资本主义术语来说，正如Scopely后期支持者D1 Capital的联合创始人丹·桑德海姆(Dan Sundheim)在一份声明中所说，“我们认为，从投资的角度来看，手机游戏的快速增长使其成为最具吸引力的娱乐类别之一。”我们相信，Scopely对未来的愿景，加上其创建垂直整合的游戏制作生态系统、差异化技术平台以及与玩家的深厚关系的战略方针，将继续巩固其作为行业领先者的地位。“", "note_en": "Acting as if there’s not still a global pandemic raging throughout the world, some of the largest institutional financing firms like  Wellington Management,   TSG Consumer Partners, CPP Investments, and funds managed by BlackRock poured more money into the gaming giant just one year after the company  raised $200 million in another late-stage funding round.\n “What we are seeing is that there’s a significant appetite from public market investors to interactive entertainment as a category,” said Scopely co-chief executive Walter Driver. “We were excited to crossover and invest in Scopely.”\n   These late-stage, traditionally pre-IPO investors joined  NewView Capital,    Battery Ventures,    Greycroft,   Revolution Growth and Highland Capital Partners in the funding, which values the company at $3.3 billion, according to a person familiar with the financing.\n The massive windfall won’t mean anything for  Scopely’s   strategy as the already wildly profitable business continues to grow both organically and through its acquisition strategy of major mobile gaming studios, according to co-chief executive, Walter Driver.\n Unlike the other big companies that have taken billions of dollars in the gaming market — chiefly  Epic Games   and Unity — Scopely isn’t making tools for gaming. The focus at the Los Angeles-based company is squarely on the games themselves and the players who spend billions of dollars on them.\n “ Scopely is focused on building the end-to-end publishing capabilities and development capabilities that will result in the longest term relationships with players for years to come,” Driver said. “ This space is evolving really quickly and we have grown exponentially. If we want to be the leading company in the space, we have to be capitalized like the leading the company in the space.”\n In terms of capitalization, no other mobile gaming studio comes close. The company’s closest competitor, both in proximity and in strategy would probably be the other LA-based mobile gaming company,  Jam City,    which is reportedly valued at $1.1 billion.\n Scopely doesn’t shy away from developing aspects of the platform technologies that have powered Epic and Unity to their own multi-billion valuations, but it isn’t selling those tools to other companies, Driver said.\n “Our belief is that over the longterm the most valuable companies in this space are going to be fully vertically integrated and own proprietary technology platforms,” he said.\n For Scopely, technology development is all about user retention, and developing the publishing capabilities and development capabilities that will help the company and its games stay relevant to an increasingly expanding and increasingly savvy audience of gamers.\n And the company has an eye on the future. It’s looking at moving more of its games between platforms desktop, mobile, and consoles as games evolve to be played across those different systems. While that doesn’t mean developing for augmented reality or virtual reality hardware yet, Driver doesn’t rule it out.\n “We do think there’s going to be continued innovation of new genres and consumer experience and more convergence and cross-pollination between platforms. Scopely is going to be focused on a player-centric approach rather than a device-centric one,” said Driver.\n For Driver and his co-founder, Javier Ferreira, Scopely’s growth — and that of the total gaming industry — represents an evolution in the ways that consumers want to be entertained.\n Scopely’s players are spending 80 minutes per-day on games like “ Star Trek Fleet Command”, “ MARVEL Strike Force”, “ Scrabble  GO”  and “ YAHTZEE With Buddies” and that time spent is actually spent socially.\n “People have found — and investors looking at the space have found also that people value the connection they’re getting from interactive experiences. It’s not just our relationship with the players, but their relationships with each other,” Driver said. “Inside of most passively consumed media experiences, you don’t have an identity. You don’t have friends. “\n Or, to put in more nakedly capitalist terms, “ We believe mobile gaming’s rapid growth makes it one of the most attractive categories in entertainment from an investment standpoint,” as Dan Sundheim the co-founder of late-stage Scopely backer D1 Capital, said in a statement. “We are confident that Scopely’s vision for the future coupled with its strategic approach to creating a vertically integrated game-making ecosystem, differentiated technology platform, and deep relationships with players will continue to cement its status as an industry leader.”", "posttime": "2020-10-28 20:31:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,吸引,investors", "title": "\nScopely以33亿美元的估值筹集3.4亿美元，游戏吸引了投资者的兴趣", "title_en": "\n\t\t\t\tScopely raises $340 million at a $3.3 billion valuation as gaming grabs investors’ interest\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/scopely-raises-340-million-at-a-3-3-billion-valuation-as-gaming-grabs-investors-interest/", "via": "", "real_tags": ["游戏", "吸引", "investors"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031747, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自主物流初创公司Outtrider今天完成了一轮6500万美元的融资，该轮融资由科赫颠覆技术公司(Koch Disruptive Technologies)牵头。Outtrider表示，这笔资金将用于加快推向市场的努力，因为该公司将员工人数扩大到110多人，并扩大了财富500强公司的客户基础。\n无人驾驶汽车技术已经开始改变行业。TuSimple、Einride和其他公司已经为自动运输原木、航运集装箱和其他货物的货运系统筹集了数千万美元。一些专家预测，冠状病毒的爆发将加速自主递送解决方案的采用。尽管公众对自动驾驶汽车存在疑虑，并需要定期消毒，但这些车辆承诺通过限制司机与骑手的接触，将疾病传播降至最低。\n总部位于科罗拉多州戈尔德市的Outtrider成立于2017年，目标是在货运枢纽实现车辆移动自动化，以降低成本，同时提高安全性。该公司本身并不拥有或运营任何车辆。相反，它为客户拥有的完全和半自主的货运和运输车队提供了软件即服务(SaaS)解决方案，并提供了一组技术人员来远程监控这些车队的进度。\n该公司的平台在配送中心、仓库和铁路站场等物流枢纽处理自主配送场运营。这通常需要在堆场和装卸码头周围移动拖车，挂起和拆卸拖车，连接和断开拖车刹车线，以及监控拖车位置。\nOtrider声称，由其软件协调的基于计算机视觉的车辆-能够达到4级自动驾驶-这是汽车工程师协会(Society Of Automotive Engineers)定义为在大多数条件下完全自动驾驶的模式-不仅超过了效率和安全标准，还超过了严格的环境标准。细节有点含糊，但Outtrider表示，其三向系统包括一个管理引擎以及前述的堆场卡车和现场基础设施，可以与大型企业已经使用的大部分供应链软件配合使用。\n就出货量而言，Otrider正在进军一个几乎无与伦比的市场。根据PitchBook的数据，自2015年以来，价值约12亿美元的风险投资交易一直以美国专注于物流的机器人和自动化公司为目标。2013年，美国每天作为货运运输的货物价值估计约为500亿美元。无人驾驶卡车市场-预计在2019年总计542.3亿美元后，全球销量将达到6700辆-每年将为物流和航运业节省700亿美元，同时将生产率提高30%。\n除了承诺的成本节约外，卡车运输自动化的增长也是由司机短缺推动的。2018年，美国货运协会(American Trucking Associates)估计，尽管美国交通部拟议中的睡眠呼吸暂停筛查计划被搁置，但仍需要5万名更多的卡车司机来缩小美国的差距。\n在短期内，大流行和相应的网购上升有可能将供应链推向崩溃的边缘。例如，在新冠肺炎危机早期，亚马逊被迫限制供应商可以发送到其仓库的库存数量。与2019年相比，电商订单量增长了50%，家具等产品的发货时间在3月份翻了一番多，对配送中心造成了沉重打击。ABI Research估计，作为回应，到2025年，全球近28%的仓库将部署机器人，而2018年这一比例约为3%。\nOtrider在Aurora有一个竞争对手，Aurora在2019年2月吸引了5.3亿美元的投资，估值超过20亿美元。还有由苹果、谷歌和优步高级技术集团(Uber Advanced Technologies Group)前工程师创立的自动驾驶卡车初创公司Ike，以及由帕兹·埃谢尔(Paz Eshel)和前优步(Uber)和奥托(Otto)工程师唐·伯内特(Don Burnette)创意的科迪亚克机器人公司(Kodiak Robotics)。这还不包括自动叉车开发商Third Wave Automation和Vecna Robotics，Emplok(将其无人驾驶系统集成到Semis中)，以及戴姆勒(Daimler)和沃尔沃(Volvo)等现有公司的自动卡车解决方案。\n但Outtrider押注其整体解决方案将使其脱颖而出。它目前正在与五个配送中心的四家财富500强公司以及世界上最大的纸巾、纸浆和纸张制造商和分销商之一佐治亚太平洋公司进行测试。Outtrider首席执行官安德鲁·史密斯(Andrew Smith)表示，大流行增加了物流密集型企业在自动化领域的入境咨询数量，导致付费飞行员获得数百万美元的收入。\n自动化和电气化直接应对供应链中从季节性到全球性流行病的波动。随着与COVID相关的供应链中断，供应链领导者更加迫切地需要进行自动化投资，“Smith通过电子邮件告诉VentureBeat。我们专注于在我们客户的分销网络中部署和支持堆场自动化。“。\n现有的投资者NEA、8VC和Prologis Ventures与新投资者Henry Crown and Company和Evolv Ventures一起参与了Otrider的B轮融资。在此轮融资之前，今年早些时候完成了5300万美元的种子和首轮融资，使该公司的融资总额达到1.18亿美元。", "note_en": "Autonomous logistics startup  Outrider today closed a $65 million funding round led by Koch Disruptive Technologies. Outrider says the funds will be used to accelerate go-to-market efforts as it expands its workforce to over 110 employees and grows its customer base of Fortune 500 companies.\n Driverless vehicle technology has already begun to transform industries.  TuSimple,  Einride, and others have raised tens of millions for freight systems that transport logs, shipping containers, and other cargo autonomously. Some experts predict the coronavirus outbreak will  hasten adoption of autonomous delivery solutions. Despite the public’s  misgivings about self-driving cars and their need for regular disinfection, the vehicles promise to minimize the spread of disease by limiting driver-rider contact.\n  Outrider, which is headquartered in Golden, Colorado, was founded in 2017 with the goal of automating vehicle movement in freight hubs to reduce costs while improving safety. The company doesn’t own or operate any vehicles itself. Instead, it provides a software-as-a-service (SaaS) solution for customer-owned fully and semi-autonomous freight and transportation fleets, as well as a team of technicians to monitor those fleets’ progress remotely.\n The company’s platform handles autonomous distribution yard operations at logistics hubs such as distribution centers, warehouses, and rail yards. This commonly entails moving trailers around the yard and to and from loading docks, hitching and unhitching trailers, connecting and disconnecting trailer brake lines, and monitoring trailer locations.\n Outrider claims the computer vision-based vehicles orchestrated by its software — which are capable of up to level 4 automated driving, a mode the Society of Automotive Engineers defines as fully self-driving in most conditions — exceed not only efficiency and safety standards but stringent environmental standards as well. The details are a bit vague, but Outrider says its three-way system, which includes a management engine and the aforementioned yard trucks and site infrastructure, works with much of the supply chain software large enterprises already use.\n  Outrider is tackling a market that’s practically unrivaled in terms of shipment volume. Since 2015, venture capital deals worth around $1.2 billion have been targeting logistics-focused robotics and automation companies in the U.S., according to PitchBook. And the value of goods transported as freight cargo in the U.S. was estimated to be about $50 billion each day in 2013. The driverless truck market — which is anticipated to reach 6,700 units globally after totaling $54.23 billion in 2019 — stands to save the logistics and shipping industry $70 billion annually while boosting productivity by 30%.\n Besides promised cost savings, the growth of trucking automation has been driven by a shortage of drivers. In 2018, the American Trucking Associates estimated that 50,000 more truckers were needed to close the gap in the U.S., despite the sidelining of proposed U.S. Transportation Department screenings for sleep apnea.\n In the short term, the pandemic and corresponding rise in online shopping threatens to push supply chains to the breaking point. For example, early during the COVID-19 crisis, Amazon was  forced to restrict the amount of inventory suppliers could send to its warehouses. Ecommerce order volume has increased by 50%  compared with 2019, and shipment times for products like furniture more than doubled in March, hitting distribution centers hard. ABI Research estimates that in response, nearly 28% of warehouses globally will deploy robots by 2025, compared with around 3% in 2018.\n Outrider has a rival in Aurora, which in February 2019 attracted a  $530 million investment at a valuation of over $2 billion. There’s also  Ike, a self-driving truck startup founded by former Apple, Google, and Uber Advanced Technologies Group engineers, and Kodiak Robotics, which is the brainchild of Paz Eshel and former Uber and Otto engineer Don Burnette. That’s in addition to autonomous forklift developers  Third Wave Automation and  Vecna Robotics, Embark (which integrates its driverless systems into semis), and autonomous truck solutions from incumbents like Daimler and Volvo.\n But Outrider is betting its holistic solution will set it apart from the pack. It’s currently conducting tests with four Fortune 500 companies at five distribution centers and with Georgia-Pacific, one of the world’s largest manufacturers and distributors of tissue, pulp, and paper. Outrider CEO Andrew Smith says the pandemic has increased the number of inbound inquiries in automation from logistics-heavy enterprises, leading to millions of dollars in revenue from paid pilots.\n “Automation and electrification directly address fluctuations in the supply chain from seasonality to global pandemics. With COVID-related supply chain disruptions, supply chain leaders have even more urgency to make automation investments,” Smith told VentureBeat via email. “We’re focused on deploying and supporting yard automation across our customers’ distribution networks.”\n Existing backers NEA, 8VC, and Prologis Ventures participated in Outrider’s series B round, alongside new investors Henry Crown and Company and Evolv Ventures. The round followed  $53 million in seed and series A rounds completed earlier this year, bringing the company’s total raised to $118 million.", "posttime": "2020-10-28 20:29:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "自动,autonomous", "title": "Outtrider为自动和半自动卡车车队运营SaaS平台，在科赫颠覆技术公司(Koch Disruptive Technologies)的带领下筹集6500万美元的B系列资金", "title_en": "Outrider, which operates a SaaS platform for autonomous and semi-autonomous truck fleets, raises $65M Series B led by Koch Disruptive Technologies", "transed": 1, "url": "https://venturebeat.com/2020/10/28/outrider-raises-65-million-to-make-warehouses-and-distribution-centers-autonomous/", "via": "", "real_tags": ["自动"]}, {"category": "", "categoryclass": "", "imagename": "bbf5fff148ee29ed159daa4850190baa.jpg", "infoid": 1031746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "曲折是一款基于谜题的隐形动作游戏，在游戏中你扮演零点，一个小小的橙色外星人，有一个很大的分数要解决！\n重要的部分在前五个字。曲折是以拼图为基础的。这就是这个游戏的收费方式，这也是我所期待的。\n让我们把这个去掉：“翘曲”是一款不错的游戏。拼图很有趣，游戏很漂亮，情节是可以预测的，但采用了很好的we&#39；re-all-familiar-with-this-myth-so-let&#39；s-get-the-cliches-out-of-the-way-and-have-some-puzzle-fun方式。我喜欢神话。神话是好的。益智游戏附带的神话甚至更好。\n零，这个可玩的角色，有很多特殊的能力。他可以弯曲穿过坚固的墙壁和障碍物，他可以扭曲里面的物体并从里面爆炸它们，他可以和物体互换位置，他可以高速发射物体。请注意，&#34；对象&#34；包括&#34；人&#34；。在大多数益智游戏中，人是主要的益智棋子。在“扭曲”中，炮塔和人之间唯一的真正区别是，人更容易被引诱到重要的地方，而且不会那么快地射杀你。\n这一切都是一个伟大的益智游戏的秘诀，老实说，它没有达到某种程度的悲剧性。\n好的益智游戏的一个特点是，就其本质而言，你在玩它们时会遇到麻烦。有些益智游戏的设计是为了让它不会卡住。有些是专门设计的，以便重新启动既简单又快速。曲折是一种有点好奇的野兽，因为它也是一款隐形动作游戏。你的对手有枪，他们扣动扳机很快，你会死在一枪之内。所以：你死定了。您点击了重新启动按钮。\n这听起来不是很多，但“翘曲”是一款非常致命的游戏。错误的方法可以而且将在几秒钟内导致死亡。即使你没有受到积极的射击，世界上也充斥着激光、炸药和类似的即时死亡陷阱。第二个关卡从一个拼图开始，它会很快杀死你，失败会导致你花更多的时间加载而不是玩游戏。即使你的计划是完美的，区域是无害的，Warp的敏感控制也会导致你跳进激光的华尔兹，并将你自己直接扭曲到死亡的频率远远超过你的预期。\n很难描述这有多烦人，而且它只是预示着即将发生的事情。\n曲折充满了小问题。没有任何东西本身会削弱这项运动。一些我通常会顺带评论的事情，认为这是一场好游戏的一个小瑕疵。但它们来得如此之快，如此无情，以至于似乎每次我忘记了其中一个，我就会撞上另一个。\n各层都挤满了人，不仅有武装警卫，还有手无寸铁的科学家。科学家们都很怕你。永恒不变。如果你小心翼翼地避免杀害科学家，这并不重要。每次你走进一个房间：尖叫的科学家。你可以在房间里站一分钟，他们就会继续惊慌失措地跑来跑去，你离开房间，他们就会恢复过来，回去工作，然后传送回来，然后它就会重新回到美国的Screamtown。\n这本可以在几个方面得到改善。IJI做得很出色-避免在IJI中的屠杀最终导致敌人与你结盟，紧随其后的是一个完全不同的游戏分支，有着不同的结局。当然，额外的结局和游戏分支需要时间和金钱。这里有一个更简单的主意：让该死的科学家们安静些。事实上，每一次你跳进一个房间，你都会听到一片刺耳的尖叫声，让气氛荡然无存。或者让他们在一段时间后不再关注你！也许这是对没有杀死他们的奖励：他们不会再拉响警报了！\n另一个例子：我提到了Warp的控件。我最大的挫败感是围绕着零的幻觉能力，这让他可以投射出自己的复制品来欺骗敌人。问题是，对错觉造成的任何损害，或者任何错误地进入错觉不允许进入的领域，都会驱散错觉。。。导致Zero立即开始朝幻觉移动的任何方向移动。如果你在一个不允许使用幻觉的地方使用它--即使一个有效的产卵点在字面上几英寸远的地方--幻觉会在Zero的正前方产生，并在你最意想不到的时候立即分散，并将控制权返回给Zero。在你最意想不到的时候，幻觉会直接在Zero前面产生，并在你最不期望的时候将控制权归还给Zero。\n所以，举个例子，如果你决定创造一个错觉，并将它向前移动，就在那一刻，一束激光束直接射到你的前面，你的错觉就会走进它，消失，在你有时间做出反应之前，Zero就会高兴地成群结队地进入它，然后死去。\n这并不是说，在最终的老板争斗或其他什么事情中，这种情况在我身上发生了几十次。\n如果这个游戏是一个低预算的事情，我可以接受这样的问题，如果他们很容易恢复的话就更是如此。最近发布的一款节奏更快的游戏“迈阿密热线”(Hotline Miami)像地狱一样漏洞百出，在我奋力通过关卡的过程中，出现了许多有趣的问题和小故障。但在迈阿密热线，重新启动关卡是立竿见影的。而迈阿密热线的艺术相对简单，我怀疑它的预算相当少。对于一款独立游戏来说，“翘曲”是一款高预算的游戏，建立在虚幻引擎之上，有详细的3D模型，良好的纹理，丰富的声音表演和剪辑场景，以及一个随机而神秘地未能从攻击中获得伤害的老板。考虑到花在游戏其余部分上的钱，控制、加载时间和游戏错误都是不可接受的。\n最后，我一直感觉像是真正的游戏已经把第二层提升到了“翘曲”的其余部分。与艺术和氛围所接受的抛光量相比，游戏的玩法是粗糙和尖刻的。\n“翘曲”是一款不错的游戏。但是如果在界面上多做一点工作，在游戏行为上多做一点工作，就可以做得更好。。。即使这意味着要牺牲一堆多边形。", "note_en": "Warp is a puzzle–based stealth action game where you play as Zero, a little orange alien with a big score to settle!\n  The important part is in the first five words. Warp is puzzle-based. That&#39;s how the game is billed, that&#39;s what I expected.\n  And let&#39;s get this out of the way: Warp is a good game. The puzzles are fun, the game is pretty, the plot is predictable but in the good we&#39;re-all-familiar-with-this-myth-so-let&#39;s-get-the-cliches-out-of-the-way-and-have-some-puzzle-fun manner. I like myths. Myths are good. Myths attached to a puzzle game are even better.\n Zero, the playable character, has a host of special abilities. He can warp through solid walls and obstructions, he can warp inside objects and explode them from the inside, he can swap places with objects and he can launch objects at high speed. Note that &#34;objects&#34; includes &#34;people&#34;. In most puzzle games, &#34;people&#34; are major puzzle pieces. In Warp, the only real difference between a turret and a person is that the person is easier to lure into important locations and doesn&#39;t shoot you as quickly.\n It&#39;s all a recipe for a great puzzle game, and it&#39;s honestly somewhat tragic that it falls short.\n The thing about good puzzle games is that, by their very nature, you&#39;ll have trouble with them. Some puzzle games are designed so that it&#39;s impossible to get stuck. Some are designed so that restarting is easy and fast. Warp is a bit of a curious beast in that it&#39;s also a stealth action game. Your opponents have guns, they are quick with their triggers, and you will die in a single shot. So: You die. You hit the &#34;restart&#34; button.\n   Which doesn&#39;t sound like a lot, but Warp is a  very deadly game. The wrong approach can, and will, lead to death in seconds. Even when you&#39;re not being actively shot at, the world is littered with lasers and explosives and similar instant death traps. The second level starts with a puzzle that will kill you so quickly that failure results in spending more time loading than playing. And even when your plan is perfect and the area is harmless, Warp&#39;s sensitive controls will lead to you waltzing into lasers and warping yourself straight into death far more often than you&#39;d expect.\n  It is hard to describe how annoying that is, and it&#39;s just a herald of what lies in store.\n Warp is filled with minor issues. Nothing that, in itself, would cripple the game. Things that I&#39;d normally be remarking about in passing, as a minor blemish on an otherwise good game. But they just came so quickly and so relentlessly that it seemed every time I forgot about one, I&#39;d run into another.\n Example: The levels are filled, not just with armed guards, but with unarmed scientists. The scientists are terrified of you. Perpetually. Doesn&#39;t matter if you&#39;ve carefully avoid killing scientists. Every time you warp into a room: screaming scientists. You can stand in the room for a minute and they just keep running around panicking, you leave the room, they recover and go back to work, teleport back in and it&#39;s Screamtown USA all over again.\n  This could have been improved in several ways. Iji does it brilliantly – avoiding slaughter in Iji eventually leads to the &#34;enemies&#34; allying with you, followed by an entire different branch of the game with a different ending. Extra endings and game branches take time and money, of course. Here&#39;s an easier idea:  make the damn scientists quieter. As it is, every time you jump into a room you&#39;re greeted with an atmosphere-obliterating chorus of screeches. Or make them stop paying attention to you after a while! Maybe that&#39;s a reward for not killing them: they stop setting off alarms!\n Another example: I mentioned Warp&#39;s controls. Most of my frustration revolved around Zero&#39;s Illusion ability, which allow him to project a duplicate of himself to trick enemies. The problem is that any damage done to the illusion, or any missteps into areas where the illusion is not allowed to go, will dissipate the illusion . . . causing Zero to instantly start moving in whatever direction the illusion was moving. If you use the illusion in a place where it&#39;s not allowed – even if a valid spawn point is literal inches away – the illusion will spawn directly in front of Zero, instantly disperse, and return control to Zero when you&#39;re least expecting it.\n So if, for example, you decide to create an illusion and move it forward, and at that very instant a laser beam fires directly ahead of you, your illusion will walk into it, disperse, and before you have time to react, Zero will troop happily into it and die.\n  Not that this happened to me dozens of times over during the end boss fight or anything.\n  I can live with issues like this if the game is a low-budget affair, and doubly so if they&#39;re easy to recover from. Hotline Miami, an even faster-paced game released lately, is buggy as hell and had many fascinating problems and glitches as I fought my way through the levels. But in Hotline Miami, restarting the level is instant. And Hotline Miami&#39;s art is relatively simple, and its budget, I suspect, was quite minimal. For an indie game, Warp is a high-budget game, built on the Unreal engine, with detailed 3d models, good texturing, copious voice acting and cutscenes, and a boss that randomly and mysteriously fails to take damage from being attacked. Given the money spent on the rest of the game, the controls, loading times, and gameplay bugs are just unacceptable.\n In the end, I kept feeling like the actual  game had taken second tier to the rest of Warp. Compared to the amount of polish the art and atmosphere received, the gameplay was rough and spiky.\n Warp is a good game. But with a little more work on the interface and a little more work on the game behavior, it could have been a lot better . . . even if that meant sacrificing a bunch of polygons.", "posttime": "2020-10-28 20:25:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解剖,dissection,游戏", "title": "曲折解剖：“齿轮里有辣酱”(2013)", "title_en": "Warp Dissection: There's Hot Sauce in the Gears (2013)", "transed": 1, "url": "http://www.mandible.net/2013/01/31/warp-dissection-theres-hot-sauce-in-the-gears/", "via": "", "real_tags": ["解剖", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "fb244cf4d7e38ffba303ea20785e7e66.png", "infoid": 1031745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Qt6中，我们希望通过利用Qt在线安装程序之外的包管理器来提供更大的灵活性。基于conan.io(https://conan.io)的新包管理器功能允许向用户提供更多包，而不会增加基线Qt的复杂性。除了Qt提供的包之外，包管理器还可以用于从其他来源获取内容。\n最初，我们通过包管理器提供了三个额外的LI库：Qt网络授权、Qt图像格式和Qt3D。在即将发布的Qt6版本中将提供更多附加库。我们目前正在利用现有的Qt交付系统作为通过包管理器提供的其他库的后端。\n所需的工具，柯南，CMake，和忍者，可以很容易地安装使用QtOnline安装程序4.0，即将发布。其他库的柯南构建食谱需要CMake和忍者来构建模块。链接到模块的项目也可以是基于qmake的。\n安装后，可以使用Conan为每个选定的目标配置构建一次选定的附加库。构建之后，二进制包在用户的本地Conan缓存中可用，并且可以链接到任何其他项目。\n--profile-此文件由Qt安装程序安装。Qt I安装程序安装的每个Qt 6 E软件包还会安装一个匹配的配置文件。这将告诉Conan目标构建配置。\n-g-“Deploy”生成器将BUIL t A Dditional Library从Conan缓存部署到您的工作环境。如果要将应用程序文件捆绑在一起，这很有用。\n目前，Qt Online Installer将A其他库包(源代码和构建配方)导出到Conan缓存中。没有托管附加库CONAN包的CONAN遥控器。\n与Qt6.0一样，目前的工作仍处于测试阶段，欢迎所有反馈。*请注意，目前正在为Android和iOS目标开发柯南配置文件和构建食谱。此外，构建其他库的食谱还不是存储库的一部分。因此，一旦构建食谱成熟，计划将这些移到模块存储库中。\n如果您现在想看一下conanfile.py食谱是什么样子，可以在Qt安装中的“AdditionalLibraries/qt/”中的每个模块下找到。", "note_en": "With Qt 6 we want to provide more flexibility via  leveraging  a package manager in addition to Qt  Online  Installer. The new package manager functionality, based on conan.io (  https://conan.io ), allows provi ding more  packages  to the users without increasing the complexity of the baseline Qt. In addition to the  packages  provided by Qt, the package manager can be used for getting content from other sources.\n Initially ,  we have three  Additional Li b raries  provided via the package manager: Qt Network Authorization, Qt Image Formats ,  and Qt 3D. More  Additional Libraries  will be available  in forthcoming  Qt 6 releases. We are currently leveraging the exis ting Qt delivery system as  the  backend for the  Additional Libraries  available via the package manager.\n  The required  tools, Conan,  CMake ,  and Ninja, can be easily installed u sing  the   Qt   O  nline installer   4.0 , which is going to be released  soon.  The  Conan  build  recipes  for  Additional Libraries  require  CMake  and Ninja to build the module .  The project linking to the module  can be  qmake - based as well.\n Once installed ,  the selected  Add itional Libraries  can be built  once  by  using  Conan  per selected target configuration . After the build ,  the binary package is available in  user’s  local  Conan  cache , and can be  linked to any other project .\n      --profile   This file is installed by the Qt installer. Each  Qt 6 E ssential package installed by the Qt  I nstaller  installs also a matching profile file. This tells  Conan  the target build configuration.\n -g   The “deploy” generator deploys the buil t  A dditional Library  from  the  Conan  cache to your working environment . This is useful if you  want to bundle your application files together.\n  Currently ,  Qt  Online  Installer exports the A dditional Library packages (sources and build recipes)  into the  Conan  cache. There is no  C onan remote that hosts the Add itional Library  C onan packages .\n  Like Qt 6.0, the current work is still in beta phase and  all  feedback is welcome .  Note that currently the Conan profile files and build recipies for  Android and iOS targets are being worked on .  Also, t he build recipes of the  Additional Libraries  are not part of the repositories yet.    Once the build recipes  are mature  the plan is to move those into module repositories.\n If you want to have a look already now ,  how  the conanfile.py recipes  look like ,  those  can be found  in  the  Qt installation, under each module in “ AdditionalLibraries /Qt /” .", "posttime": "2020-10-28 20:19:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,柯南,provide,qt", "title": "Qt6将通过柯南软件包管理器提供其他库", "title_en": "Qt 6 will provide additional libraries via Conan package manager", "transed": 1, "url": "https://www.qt.io/blog/qt-6-additional-libraries-via-package-manager", "via": "", "real_tags": ["软件", "柯南", "provide", "qt"]}, {"category": "", "categoryclass": "", "imagename": "4225bd753e3242a196b05da90d7ca447.jpg", "infoid": 1031744, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个名为P(或APT35)的组织伪装成慕尼黑安全会议(Munich Security Conference)和定于本月晚些时候在沙特阿拉伯举行的Think 20峰会的组织者发送了恶搞电子邮件。慕尼黑安全会议是各国元首参加的主要全球安全和政策会议之一。微软表示，这些伪造的电子邮件被发送给前政府官员、学者和政策制定者，以窃取密码和其他敏感数据，如电子邮件收件箱。\n当被问及这次行动的目标是什么时，微软没有置评，但该公司的客户安全和信任主管Tom Burt表示，实施攻击是为了“收集情报”。\n伯特说：“这些袭击成功地损害了几名受害者的利益，其中包括帮助制定各自国家的全球议程和外交政策的前大使和其他高级政策专家。”我们已经与会议组织者合作，他们已经并将继续警告他们的与会者，我们正在披露我们看到的情况，这样每个人都可以对这种方法在其他会议或活动中使用保持警惕。“。\n微软表示，攻击者将用“完美的英语”写电子邮件给他们的目标，要求邀请他们参加会议。在目标接受邀请后，攻击者会试图诱骗受害者在虚假的登录页面上输入他们的电子邮件密码。攻击者随后登录邮箱，窃取受害者的电子邮件和联系人。\n该组织之前的黑客行动也曾试图窃取知名受害者的密码。\n记者无法联系到伊朗驻纽约领事馆置评，因为其网站已关闭。\n众所周知，磷的目标是高调的个人，如政客和总统候选人。但微软表示，这起最新的攻击与即将到来的美国总统大选无关。\n去年，微软表示，它已经阻止了1万多名国家支持的黑客攻击受害者，其中包括磷和另一个伊朗支持的组织Holmium，也被称为APT 33。今年3月，这家科技巨头获得了一项法院命令，要求控制P使用的域名，这些域名被用来使用虚假的谷歌和雅虎登录页面窃取凭据。", "note_en": "The group,  known as Phosphorus (or APT35), sent spoofed emails masquerading as organizers of the Munich Security Conference, one of the main global security and policy conferences attended by heads of state, and the Think 20 Summit in Saudi Arabia, scheduled for later this month. Microsoft said the spoofed emails were sent to former government officials, academics and policy makers to steal passwords and other sensitive data, like email inboxes.\n Microsoft did not comment, when asked, what the goal of the operation was, but the company’s customer security and trust chief Tom Burt said that the attacks were carried out for “intelligence collection purposes.”\n “The attacks were successful in compromising several victims, including former ambassadors and other senior policy experts who help shape global agendas and foreign policies in their respective countries,” said Burt. “We’ve already worked with conference organizers who have and will continue to warn their attendees, and we’re disclosing what we’ve seen so that everyone can remain vigilant to this approach being used in connection with other conferences or events.”\n Microsoft said the attackers would write emails written in “perfect English” to their target requesting an invitation to the conference. After the target accepted the invitation, the attackers would try to trick the victim into entering their email password on a fake login page. The attackers then later log in to the mailbox to steal the victim’s emails and contacts.\n The group’s previous hacking campaigns have also tried to steal passwords from high-profile victims.\n Iran’s consulate in New York could not be reached for comment as its website was down.\n Phosphorus is known to target high-profile individuals, like politicians and  presidential hopefuls. But Microsoft said that this latest attack was not related to the upcoming U.S. presidential election.\n Last year, Microsoft said it had stopped over 10,000 victims of state-sponsored hacking, including Phosphorus and another Iran-backed group, Holmium, also known as APT 33. In March, the tech giant secured a court order to take control of domains used by Phosphorus, which were used to steal credentials using fake Google and Yahoo login pages.", "posttime": "2020-10-28 20:00:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,microsoft,微软,伊朗,iranian", "title": "\n微软表示，伊朗黑客的目标是“高调”的会议与会者", "title_en": "\n\t\t\t\tMicrosoft says Iranian hackers targeted ‘high profile’ conference attendees\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/microsoft-iran-hackers/", "via": "", "real_tags": ["黑客", "microsoft", "微软", "伊朗", "iranian"]}]