[{"category": "", "categoryclass": "", "imagename": "77210a78114014e46e1a07a1a633bfc8.jpg", "infoid": 1018139, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球大流行和由此导致的公司办公室关闭已经给工作方式带来了变化。虽然某些行业的关键人员在一层层的个人防护装备下以相对熟悉的方式继续工作，但许多公司不得不想方设法在“社会”距离外继续其他工作。在这种情况下，员工必须找到继续协作的方法，就像他们挤在小隔间、开放式平面图以及现代办公空间的所有其他各种模式中所做的那样。\n新冠肺炎带来的职场变化短期内不会消失。谷歌(Google)、Facebook和微软(Microsoft)等科技公司已经将员工重返办公室的计划推迟到2021年，Twitter也宣布员工永远不需要回到公司办公室。其他行业的公司也在进行同样的计算，而员工们不仅在重新考虑他们的工作方式，甚至还在重新考虑他们住在哪里。\n所有这一切都取决于工具的发展，这些工具使这种远程工作方式成为可能。对我们中的一些人来说--例如，就像所有为ARS工作的人一样--这并不是什么新鲜事。正如我之前所指出的，我主要在家里工作已经超过25年了，作为每一项可以减少偏远地区的技术的早期采用者，这意味着我经历了协作软件和分布式团队的初期痛苦。\n不幸的是，尽管公司已经采用了协作工具，但直到最近，它们中的绝大多数似乎还对如何使用它们感到困惑。过去几代的“协作”都是关于流程和结构的--在减少带外通信需求方面做得很少。\n在接下来的几年里，无论什么被认为是“正常的”，都将对协作工具提出很高的要求，因为各组织都在重新审视如何实现其使命并保持财务上的可行性。新的协作世界将要求组织复制办公室的非结构化交互，帮助员工感觉像是一个连贯团队的一部分，即使他们相距遥远，从而在没有近距离面对面时间的情况下实现社交并强化团队议程。\n根据多年来在不同组织的远程协作工作，以及对多个组织在过去六个月中所做的调整的观察，我认为以下是在锁定和锁定后的世界中成功团队操作的关键。\n起初，“协作”软件主要是关于交流的。Lotus Notes等“群件”产品将协作从简单的电子邮件转移到以文档和数据为中心的通信。这些功能(消息传送、基于文档的协作和结构化程度较低的工作流)仍然是大多数组织协作的基础。\n要让组织超越这些基本的、非结构化的协作工具，需要付出很多努力--主要是因为它们是非结构化的、灵活的。在过去的20年里，电子邮件已经被宣布死亡数百次，但我们仍然在使用它发送文档附件和路由工作。尽管2001年9月11日的袭击给视频会议带来了短暂的冲击，但宽带互联网的增长和内置摄像头的设备无处不在-更不用说又过了近十年-才使视频会议协作变得为大多数组织所接受。\n然而，这些技术中的许多在早期都运行得相当好。在Ray Ozzie的Groove上贴上微软的标签之前，我是它的早期采用者，我在我工作的公司大力推广Wikis、SharePoint和其他工具，因为它们让我作为远程员工的工作变得更容易。但这些公司和许多其他组织没有抓住这些工具的原因很简单：它们的部署和维护成本很高，而且它们需要一些文化变革才能接受。\n这并不是说微软在十年前没有大量销售SharePoint(尤其是卖给政府的)，也不是说公司没有在定制工作流系统上投入大笔资金。他们确实这样做了，但结果通常远远谈不上合作。就像过去20年的大型ERP项目一样，这些早期的倡议是自上而下的，专注于遵从性的努力，不仅是为了对技术做出重大改变，也是为了改变人们的工作方式。(老实说，谁真的喜欢使用这些工具呢？为观众中真正热爱SharePoint的每一个人举手。嗯-嗯。我也这么想。)。\n然而，过去几年的技术和文化变化-以及过去六个月的必要性-已经降低了新形式合作的障碍，或者完全消除了它们。我们中的许多人已经生活在Slake、Google文档和电子表格以及各种其他特别的协作工具中。我们中的许多人都已经尝到了未来的滋味，我们已经为更多的未来做好了准备。其他人将不得不在这一过程中接受指导。", "note_en": "The global pandemic and the corporate office shutdowns resulting from it have wrought changes to how work works. While essential people in certain industries have continued their jobs in ways that are relatively familiar under layers upon layers of personal protective equipment, many companies have had to find ways to continue other work at a “social” distance. And in those situations, employees must find ways to continue collaborating as they did when they were packed into cubicles, open floor plans, and all the other various patterns of modern office spaces.\n Workplace changes due to COVID-19 won’t go away anytime soon. Tech companies like Google, Facebook, and Microsoft have pushed back the return of employees to offices until well into 2021, and Twitter has declared that employees need never return to the corporate office. Companies in other industries are making the same sorts of calculations, while employees are rethinking not just how they work but even where they live.\n All of this hinges on the evolution of tools that make this remote way of work possible. For some of us—well, like  everyone who’s worked for Ars, for instance—that isn’t anything new. As I’ve noted previously, I’ve been working primarily from home for over 25 years, and being an early adopter of every technology that could reduce the remoteness of being remote means I’ve lived through the teething pains of collaboration software and distributed teams.\n  Unfortunately, even as companies have adopted collaboration tools, it seems like the vast majority of them have until recently been confused about how to use them. Past generations of “collaboration” have been about processes and structure—and have done little to reduce the need for out-of-band communication.\n Whatever passes for “normal” over the next few years will demand a lot from collaboration tools, as organizations re-examine how to achieve their missions and stay financially viable. The new world of collaboration will require organizations to replicate the unstructured interactions of the office and help employees feel like part of a coherent team even when they are distant, enabling social interactions and reinforcing the team agenda in the absence of up-close face time.\n Based on years of remote collaboration work at various organizations and observations of things multiple organizations have done over the past six months to adjust, here are the things I see as keys to successful team operations in the lockdown and post-lockdown world.\n  In the beginning, “collaboration” software was mostly about communication. “Groupware” products like Lotus Notes moved collaboration away from simple email toward document and data-centric communication. These capabilities—messaging, document-based collaboration, and lightly structured workflow—remain the basis of most organizations’ collaboration.\n It’s taken a lot to get organizations to budge beyond these basic, unstructured collaboration tools—mostly because they’re unstructured and flexible. Email has been declared dead hundreds of times over in the past two decades, and yet we’re all still using it to send document attachments and route work. And despite the attacks of September 11, 2001  briefly giving a jolt to video conferencing, it took the growth of broadband Internet and ubiquity of devices with built-in cameras—not to mention almost another decade—to make video conferencing collaboration palatable for most organizations.\n  Many of these technologies worked pretty well early on, though. I was an early adopter of  Ray Ozzie’s Groove back before it had a Microsoft label on it, and I pushed Wikis, SharePoint, and other tools vigorously at companies I worked at because they made my job as a remote employee easier. But there were simple reasons why those companies, and many other organizations, didn’t grab onto those tools: they cost money to deploy and maintain, and they required some cultural changes to embrace.\n That’s not to say that Microsoft didn’t sell a lot of SharePoint (especially to the government) a decade ago, or that companies didn’t spend big on custom workflow systems. They did, but the results were usually far from collaborative. Like the big ERP projects of the past two decades, these early initiatives were top-down, compliance focused efforts to make major changes to not just technology but how people did their work. (And let&#39;s be honest, who really  enjoys using these kinds of tools? Show of hands for everyone in the audience who actually-for-real  loves SharePoint. Mmm-hmm. I thought so.)\n  However, technological and cultural shifts over the past few years—and the necessity of the past six months—have lowered barriers to new forms of collaboration or leveled them entirely. Many of us live in  Slack, Google documents and spreadsheets, and various other ad-hoc collaboration tools already. Many of us have had a taste of the future, and we’re ready for more. Others will have to be coached along the way.", "posttime": "2020-08-15 01:11:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程,action,协作", "title": "令人毛骨悚然的远程行动：远程协作的未来魔力", "title_en": "Spooky action at a distance: The future magic of remote collaboration", "transed": 1, "url": "https://arstechnica.com/features/2020/08/work-from-home-02-collaboration/", "via": "", "real_tags": ["远程", "action", "协作"]}, {"category": "", "categoryclass": "", "imagename": "a70a67e36816e4d5127db6e9aa791ae4.jpg", "infoid": 1018137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四上午，史诗娱乐宣布，玩家在“堡垒之夜”游戏内购买升级版和定制角色时使用的游戏货币将永久享受20%的折扣。但Etic表示，它不能向移动玩家提供同样的折扣，因为苹果和谷歌从所有应用内购买中抽取30%的分成。\n取而代之的是，Etic为玩家引入了一种在iOS和Android应用程序中直接支付的方式，称这样就可以将节省的资金转嫁给他们。但是，Etic绕过了苹果和谷歌的支付系统，违反了他们的应用商店规则，这两家公司迅速下架了堡垒之夜。\nEPIC立即进行了反击，打起了对决的官司，并播放了一段抨击苹果最具标志性的广告的视频，指责科技巨头的应用商店政策存在垄断行为，这是EPIC与这些公司正在进行的斗争中的最新一轮猛烈抨击。多年来，像Etic这样的应用开发商一直对苹果和谷歌向应用内购买收取30%的佣金提出异议，开发商表示，这些公司只有在移动操作系统市场占据主导地位(大多数智能手机运行iOS或Android)，几乎不可能在自己的应用商店之外下载应用，才能逃脱惩罚。在对谷歌的诉讼中，Etic声称，通过各种法律、技术和设计障碍，包括可怕的、重复的安全弹出窗口，为了警告用户非Play Store应用程序的下载，谷歌将自己定位为希望接触Android用户的应用程序开发者不可避免的中间人，反之亦然。\nEPIC还在其网站上的常见问题解答中表示，苹果并不是对所有开发者一视同仁，它允许数千个应用程序收取直接付款，其中包括亚马逊(Amazon)、GrubHub、耐克(Nike)、百思买(Best Buy)、DoorDash、Fandango、麦当劳(McDonald；s)和StubHub&34；这其中包括亚马逊(Amazon)、GrubHub、耐克(Nike)、百思买(Best Buy)、DoorDash、Fandango、麦当劳(McDonald)和StubHub。几个主要的开发商已经联合起来支持Epic.。Spotify去年就单独但相关的反垄断问题起诉苹果，该公司告诉Recode的彼得·卡夫卡(Peter Kafka)，苹果的不公平做法让竞争对手处于劣势，剥夺消费者的时间太长了。\nMatch Group拥有Tinder、Hinger、Match和OkCupid等约会应用，该集团的一位发言人告诉“商业内幕”，我们今天完全支持EpicGames的努力，这些努力旨在展示苹果是如何利用其主导地位和不公平的政策来伤害消费者、应用开发商和企业家的。其他人还没有具体就Etic的诉讼发表言论，但过去曾对苹果的应用内支付政策提出过异议。基于订阅的电子邮件应用嘿在6月份与苹果发生了争执，Stratechery的作者本·汤普森(Ben Thompson)在推特上表示，其他开发者也经历过类似的问题。广告苹果在决定下架堡垒之夜后发表声明称，其政策为所有开发者创造了一个公平的竞争环境，并使商店对所有用户都是安全的。\n苹果还表示，像Epic34；这样的开发者已经从App Store生态系统中受益--包括苹果向所有开发者提供的工具、测试和分发。\n谷歌在回应“商业内幕”的诉讼时也发表了类似的声明，称其一贯坚持对开发者公平并保证商店安全的政策，并补充说，开放的Android生态系统允许开发者通过多个应用商店分发应用。商业内幕的特洛伊·沃尔弗顿写道，“”商业内幕“的特洛伊·沃尔弗顿写道，”“商业内幕”的特洛伊·沃尔弗顿(Troy Wolverton)写道，“史诗”故意违反苹果的政策，似乎是一种精心策划的策略的一部分，目的是引诱苹果进入苹果的应用商店。“商业内幕”(Business Insider)的特洛伊·沃尔弗顿(Troy Wolverton)写道。向应用程序开发者展示其巨大的力量。\nEPIC此举将苹果和谷歌推回到反垄断的聚光灯下，就在几周前，这两家公司的首席执行官在国会听证会上受到议员们的质询，议员们辩称，这两家公司不公平地利用自己的规模和市场支配力来扼杀竞争。\n苹果首席执行官蒂姆·库克被特别询问苹果如何对待开发者，尽管谷歌母公司Alphabet首席执行官桑达尔·皮查伊回答了更多关于谷歌如何利用搜索结果偏袒自己产品的问题，监管机构也对其Play Store和Android政策提出了类似的担忧。广告苹果和谷歌目前都面临多起反垄断诉讼和监管调查，而Etic&39；的案件可能会火上浇油。此外，Etic可能会被证明是一个更激烈的挑战者，因为作为一家公司，它自己的成功并不那么依赖于苹果或谷歌。虽然“堡垒之夜”可以在iOS和安卓系统上使用，但相当多的用户在台式电脑或Xbox One和索尼的PlayStation4等游戏机上玩这款游戏。", "note_en": "On Thursday morning, Epic announced a permanent 20% discount on the in-game currency players use within  &#34;Fortnite&#34; to purchase upgrades and customize their characters. But Epic said it couldn&#39;t offer the same discount to mobile players because Apple and Google take a 30% cut of all in-app purchases.\n Instead, Epic  introduced a way for players to pay it directly within the iOS and Android apps, saying it could then pass along the savings to them. But in bypassing Apple and Google&#39;s payment systems, Epic broke their app store rules, and the companies swiftly removed &#34;Fortnite.&#34;\nEpic immediately fired back with dueling lawsuits and a  video roasting Apple&#39;s most iconic ad, accusing the tech giants of engaging in monopolistic behavior with their app store policies, the latest broadside in its  ongoing battle with the companies. Advertisement    For years,  app developers like Epic have taken issue with the 30% commission Apple and Google charge on in-app purchases, which developers say the companies can only get away with because they dominate the mobile operating system market (most smartphones run on iOS or Android) and make it nearly impossible to download apps  outside of their own app stores. In its  lawsuit against Google, Epic claimed that through a variety of legal, technical, and design obstacles including &#34;scary, repetitive security pop-ups&#34; to warn users about non-Play Store app downloads, Google had &#34;installed itself as an unavoidable middleman for app developers who wish to reach Android users and vice versa.&#34;\nEpic also said in an  FAQ on its website that Apple doesn&#39;t treat all developers the same, and allows &#34;thousands of apps&#34; including &#34;Amazon, Grubhub, Nike SNKRS, Best Buy, DoorDash, Fandango, McDonald&#39;s, and StubHub&#34; to collect direct payments.       Several major developers have already rallied behind Epic.  Spotify, which sued Apple over separate but related  antitrust issues last year, told Recode&#39;s Peter Kafka that &#34;Apple&#39;s unfair practices have disadvantaged competitors and deprived consumers for far too long.&#34;\nA spokesperson for Match Group, which owns dating apps such as Tinder, Hinge, Match, and OkCupid, told Business Insider &#34;we fully support Epic Games&#39; efforts today to show how Apple uses its dominant position and unfair policies to hurt consumers, app developers and entrepreneurs.&#34;Others have yet to speak out on Epic&#39;s lawsuits specifically, but have taken issue with Apple&#39;s in-app payment policies in the past. Subscription-based email app Hey  sparred with Apple in June, and Stratechery author Ben Thompson  tweeted that other developers had experienced similar issues. Advertisement     Apple  said in a statement following its decision to remove &#34;Fortnite&#34; that its policies &#34;create a level playing field for all developers and make the store safe for all users.&#34;\n Apple also said developers like Epic &#34;have benefited from the App Store ecosystem — including its tools, testing, and distribution that Apple provides to all developers.&#34;\nGoogle  issued a similar statement in response to Epic&#39;s lawsuit, saying it has &#34;consistent policies that are fair to developers and keep the store safe for users,&#34; adding that &#34;the open Android ecosystem lets developers distribute apps through multiple app stores.&#34; Advertisement     As  Business Insider&#39;s Troy Wolverton wrote, Epic&#39;s deliberate violation of Apple&#39;s policy appeared to be part of a calculated ploy to lure Apple into an &#34;antitrust trap&#34; by provoking it into &#34;flexing its enormous power&#34; over app developers.\n Epic&#39;s move thrusts both Apple and Google back into the antitrust spotlight just weeks after their CEOs were  grilled during a congressional hearing by lawmakers who argued the companies were unfairly using their size and market power to stifle competition.\nApple CEO  Tim Cook  was specifically questioned about how Apple treats developers, and while  Sundar Pichai, CEO of Google parent  Alphabet, fielded more questions about how Google uses search results to favor its own products, regulators have  raised similar concerns about its Play Store and Android policies. Advertisement   Apple and Google are both currently facing multiple antitrust lawsuits and regulatory investigations, and Epic&#39;s case could add fuel to the fire. Additionally, Epic may prove to be a more fierce challenger simply because its own success as a company isn&#39;t as dependent on either Apple or Google. While &#34;Fortnite&#34; is available on iOS and Android, a substantial amount of users play the game on desktop computers or gaming consoles like Xbox One and Sony&#39;s PlayStation 4.", "posttime": "2020-08-15 01:11:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,游戏,开发,谷歌,apple", "title": "苹果和谷歌刚刚被广受欢迎的视频游戏“堡垒之夜”的开发商起诉，原因是它们的应用商店政策。以下是你需要知道的关于它重新点燃的重大反垄断斗争的信息。", "title_en": "Apple and Google just got sued by the maker of the hugely popular video game 'Fortnite' over their app store policies. Here's what you need to know about the major antitrust battle it reignited.", "transed": 1, "url": "https://www.businessinsider.in/tech/news/apple-and-google-just-got-sued-by-the-maker-of-the-hugely-popular-video-game-fortnite-over-their-app-store-policies-heres-what-you-need-to-know-about-the-major-antitrust-battle-it-reignited-/articleshow/77541645.cms", "via": "", "real_tags": ["rust", "游戏", "开发", "谷歌", "apple"]}, {"category": "", "categoryclass": "", "imagename": "20a32fc941b8f36d267c292de05c6e06.jpg", "infoid": 1018134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于每一位刚刚受洗的创始人来说，生活中最令人兴奋的时刻之一就是看到投资者提供的投资条款说明书，这让他们松了一口气。经过几周，也许几个月(但希望不是几年！)的筹款和推销工作，没有什么比收到一封附有PDF的电子邮件，上面列出了未来风险投资关系的条款和条件更好的了。\n当然，随着这笔交易的所有具体细微差别突然凸现出来，这种欢欣鼓舞很快就会消退。获得你想要的估值或你寻求的资本额是一回事，但董事会的设置呢？你应该如何处理可能会影响你十年或更长时间创业的交易条款？\n正如我们的嘉宾Lior Zorea讨论的那样，条款说明书的现实情况是，你在初创公司早期同意的条款往往会延续到公司的整个生命周期。这意味着，做好第一份条款说明书对于确保企业的财务和资本成功至关重要。", "note_en": "One of the most exciting moments in the life of every newly christened founder is the sweet relief of seeing a term sheet come in from an investor. After weeks, perhaps months (but hopefully not years!), of work fundraising and pitching, there is nothing like getting that email with a PDF attached to it laying out the terms and conditions of the VC relationship going forward.\n Of course, that rejoicing dampens quickly as all the specific nuances of the deal suddenly come to the forefront. It’s one thing to get the valuation you want, or the amount of capital you are seeking, but what about the setup of the board of directors? What should you do about deal terms that may shape your startup for a decade or more?\n The reality of term sheets, as our guest  Lior Zorea   discusses, is that the terms you agree to early on at a startup tend to be the terms that will carry through for the life of the company. That means getting that first term sheet right is critical for ensuring the financial and capital success of your business.", "posttime": "2020-08-15 01:09:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表中,term,条款", "title": "\n如何在条款表中获得您想要的内容", "title_en": "\n\t\t\t\tHow to get what you want in a term sheet\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/how-to-get-what-you-want-in-a-term-sheet/", "via": "", "real_tags": ["表中", "term", "条款"]}, {"category": "", "categoryclass": "", "imagename": "37945c3c4267cbf26185330b61eed45b.png", "infoid": 1018133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据数据追踪机构PrimeUnicorn Index的数据，新一轮融资对该公司的估值为40亿美元。\n自成立以来，该公司已从投资者那里筹集了15亿美元，其中包括未来资产全球投资(Mirae Asset Global Investments)和淡马锡(Temasek)。这些新的公共/私人投资公司出现在Impact Foods的市值排行榜上，可能意味着该公司正在为首次公开募股(IPO)做准备，但这只是一种猜测。\nImpact之前从地平线风险投资公司(Horizon Ventures)和科斯拉风险投资公司(Khosla Ventures)等投资公司以及美国一些最知名的名人那里筹集了资金，比如：杰伊·布朗(Jay Brown)、科恩(Common)、柯克·库辛斯(Kirk Cousins)、保罗·乔治(Paul George)、彼得·杰克逊(Peter Jackson)、Jay-Z、明迪·卡林(Mindy Kling)、特雷弗·诺亚(Trevor Noah)、亚历克西斯·奥哈尼安(Alexis Ohanian)、卡尔·潘(Kal Penn)、凯蒂·佩里(Katy Perry)、奎斯特洛夫(QuestLove)、鲁比·罗斯(Ruby Rose。\n根据PrimeUnicorn的数据，最新的每股价格为16.15美元，比F系列的15.4139美元有所上涨。\n该公司表示，将利用这笔资金加大研发力度，开发猪肉、牛排和牛奶等新产品，并扩大国际化努力，建设制造能力。\n“利用动物制造食物是地球上最具破坏性的技术，是气候变化的主要驱动力，也是全球野生动物种群和生物多样性灾难性崩溃的主要原因，”拥有难以置信资格的帕特里克·O·布朗博士(Dr.Patrick O.Brown)在一份声明中说，他是Impact Foods的首席执行官兼创始人。“Impact Foods的使命是通过直接从植物中制作世界上最美味、最有营养和最可持续的肉类来取代这个古老的系统。要做到这一点，Impact Foods需要保持我们生产和销售的指数增长，并在研发方面投入大量资金。我们的投资者相信我们改变全球食品体系的使命--他们认识到这是一个非同寻常的经济机遇。“", "note_en": "The new round values the company at a Whopper-sized $4 billion valuation, according to the data tracker  PrimeUnicorn Index.\n   Since its launch the company has raised $1.5 billion from investors, including Mirae Asset Global Investments and Temasek. The presence of these new public/private investment firms on  Impossible Foods’   cap table could mean that the company is readying itself for an initial public offering, but that’s just speculation.\n Impossible previously raised money from investment firms including Horizon Ventures and  Khosla Ventures,   as well as some of the biggest celebrities in the U.S., like: Jay Brown, Common, Kirk Cousins, Paul George, Peter Jackson, Jay-Z, Mindy Kaling, Trevor Noah, Alexis Ohanian, Kal Penn, Katy Perry, Questlove, Ruby Rose, Phil Rosenthal, Jaden Smith, Serena Williams,  will.i.am and Zedd.\n The most recent price per share is $16.15, an up round from Series F at $15.4139, according to PrimeUnicorn.\n The company said it would use the funding to increase its research and development efforts and work on new products like pork, steak and milk, as well as expand its internationalization efforts and build out its manufacturing capacity.\n “The use of animals to make food is the most destructive technology on Earth, a leading driver of climate change and the primary cause of a catastrophic global collapse of wildlife populations and biodiversity,” said the incredibly credentialed Dr. Patrick O. Brown, MD, PhD, CEO and founder of Impossible Foods, in a statement. “Impossible Foods’ mission is to replace that archaic system by making the most delicious, nutritious and sustainable meats in the world, directly from plants. To do that, Impossible Foods needs to sustain our exponential growth in production and sales, and invest significantly in R&amp;D. Our investors believe in our mission to transform the global food system — and they recognize an extraordinary economic opportunity.”", "posttime": "2020-08-15 01:09:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "食品,foods", "title": "\n不可能的食品公司又吞噬了2亿美元", "title_en": "\n\t\t\t\tImpossible Foods gobbles up another $200 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/impossible-foods-gobbles-up-another-200-million/", "via": "", "real_tags": ["食品", "foods"]}, {"category": "", "categoryclass": "", "imagename": "5fa806705d2ce6517df9490d25102fb5.jpg", "infoid": 1018132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“目前，当使用苹果和谷歌支付选项时，苹果和谷歌收取30%的费用，最高20%的降价不适用，”Etic在一篇介绍新选项的博客文章中写道。“如果苹果或谷歌未来降低他们的支付费用，Epic会把节省下来的钱转嫁给你。”\n在给TechCrunch的一份声明中，苹果公司证实，由于堡垒之夜采取了违反应用商店规定的“不幸的一步”，苹果公司将其撤职：\nEPIC在其应用程序中启用了一项未经苹果审查或批准的功能，他们这样做的明确意图是违反App Store关于应用内支付的指导方针，该指导方针适用于每一位销售数字产品或服务的开发者。\nEPIC在App Store上拥有应用程序已经有十年了，并从App Store生态系统中受益-包括苹果向所有开发者提供的[其]工具、测试和分发。EPIC自由地同意了App Store的条款和指导方针，我们很高兴他们在App Store上建立了如此成功的业务。他们的商业利益现在促使他们推动一项特殊安排，这一事实并没有改变这样一个事实，即这些指导方针为所有开发商创造了一个公平的竞争环境，并使商店对所有用户来说都是安全的。我们将尽一切努力与Etic合作解决这些违规行为，以便他们能够将堡垒之夜送回应用商店。\nEPIC Games创始人兼首席执行官蒂姆·斯威尼在最近的推文中多次抨击苹果对App Store的提成，称苹果的决定是故意反竞争的，并宣布苹果“取缔虚拟现实”。堡垒之夜的推特账户上一条提到威权主义和苹果自己1984年标志性广告的辛辣推文也表明，Epic无意让步。\n堡垒之夜《皇家党报》将首演新短片：《一九八零-堡垒之夜》。请在美国东部时间下午4点加入我们。Pic.twitter.com/BWvndK3gDt。\nEPIC还显然刚刚在美国加州北区地区法院对苹果公司提起诉讼，称苹果公司解雇堡垒之夜是“苹果公司为了施加不合理的限制，非法维持其对iOS应用内支付处理市场的100%垄断而展示其巨大权力的又一例证”。\n在做出增加直接支付(它称之为“永久”功能)的决定时，Etic很清楚，很可能会从苹果的市场上移除。无论如何，通过增加新的支付方式，这家热门游戏制造商正在为最近围绕苹果应用商店费用的激烈争议插上一面旗帜。每个人都在猜测苹果和如此著名的软件制造商之间的摊牌接下来会发生什么，但我们将关注这个故事的发展。", "note_en": "“Currently, when using  Apple   and Google payment options, Apple and Google collect a 30% fee, and the up to 20% price drop does not apply,” Epic wrote in a blog post introducing the new option. “If Apple or Google lower their fees on payments in the future, Epic will pass along the savings to you.”\n   In a statement to TechCrunch, Apple confirms that it removed Fortnite for taking the “unfortunate step” of violating App Store rules:\n Epic enabled a feature in its app which was not reviewed or approved by Apple, and they did so with the express intent of violating the App Store guidelines regarding in-app payments that apply to every developer who sells digital goods or services.\n Epic has had apps on the App Store for a decade, and have benefited from the App Store ecosystem – including [its] tools, testing, and distribution that Apple provides to all developers. Epic agreed to the App Store terms and guidelines freely and we’re glad they’ve built such a successful business on the App Store. The fact that their business interests now lead them to push for a special arrangement does not change the fact that these guidelines create a level playing field for all developers and make the store safe for all users. We will make every effort to work with Epic to resolve these violations so they can return Fortnite to the App Store.\n Epic Games founder and CEO  Tim Sweeney   has attacked Apple repeatedly in  recent tweets over the cut it takes on the App Store, calling its decisions deliberately anti-competitive and declaring that Apple has “outlawed the metaverse.” A spicy tweet on Fortnite’s Twitter account evoking authoritarianism and  Apple’s own iconic 1984 commercial also suggests that Epic has no intention of backing down.\n Fortnite Party Royale will premiere a new short: Nineteen Eighty-Fortnite. Join us at 4PM ET.  pic.twitter.com/BWvndK3gDt\n Epic also apparently just  filed a legal complaint against Apple in the U.S District Court for the Northern District of California arguing that Apple removing Fortnite is “yet another example of Apple flexing its enormous power in order to impose unreasonable restraints and unlawfully maintain its 100% monopoly over the iOS In-App Payment Processing Market.”\n In making the decision to add direct payments, a feature it calls “permanent,” Epic was well aware that removal from Apple’s marketplace was likely in the cards. By adding the new payment method anyway, the hit game maker is planting a flag in the recent  roiling controversy over Apple’s App Store fees. What happens next in a showdown between Apple and such a prominent software maker is anyone’s guess, but we’ll be following this story as it develops.", "posttime": "2020-08-15 01:08:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,商店,boots", "title": "\n史诗增加直接支付后，苹果将堡垒之夜从应用商店启动", "title_en": "\n\t\t\t\tApple boots Fortnite from the App Store after Epic adds direct payments\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/fortnite-app-store-removed-apple/", "via": "", "real_tags": ["apple", "苹果", "商店", "boots"]}, {"category": "", "categoryclass": "", "imagename": "7c0d876f65d35de10a69e7d585dad377.jpg", "infoid": 1018131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四上午，史诗游戏通过服务器端更新引入了一种新的支付机制，允许游戏玩家直接购买堡垒之夜的游戏内货币，从而允许该应用绕过苹果的应用内购买框架和苹果收取的大幅提成。苹果迅速采取行动，在App Store上禁止了这款应用。\nEPIC在其应用程序中启用了一项未经苹果审查或批准的功能，他们这样做的明确意图是违反App Store关于应用内支付的指导方针，该指导方针适用于每一位销售数字产品或服务的开发者。\n该公司很快就分享了他们正在对苹果公司采取法律行动，声称他们正在滥用市场地位，并部分表示“苹果罢免堡垒之夜是苹果公司为了施加不合理的限制，非法维持其对iOS应用内支付处理市场的100%垄断地位而展示其巨大力量的又一例证。”\n几分钟后，史诗游戏在堡垒之夜皇家党内播放了一段短视频，呈现了一段苹果标志性的“1984年”广告的旋转。屏幕上的文字宣称，“史诗游戏挑战了App Store的垄断。作为报复，苹果阻止堡垒之夜使用10亿台设备。加入到阻止2020成为“1984”的战斗中来吧。#FreeFortnite“。\n考虑到这起诉讼的焦点狭窄(相对而言)，任何以垄断为由针对苹果的法律行动都将是一场艰苦的战斗，特别是考虑到苹果首席执行官蒂姆·库克已经与国会反垄断官员进行了交谈，而这些官员在最近的Zoom听证会上似乎没有做出任何打击。虽然法律上的努力可能是一个挑战，但史诗游戏对堡垒之夜的3.5亿用户有着重大影响，事实证明，游戏玩家特别擅长发起针对公司的运动，并脱颖而出。\n就在这一事件发生的几天前，苹果因拒绝从App Store下载云游戏流媒体应用Microsoft XCloud而招致批评。", "note_en": "Thursday morning, Epic Games introduced a new payment mechanism through a server-side update that allowed gamers to purchase Fortnite’s in-game currency directly, allowing the app to bypass Apple’s in-app purchase framework and the substantial cut that Apple takes. Apple quickly acted in banning the app from the App Store.\n   Epic enabled a feature in its app which was not reviewed or approved by Apple, and they did so with the express intent of violating the App Store guidelines regarding in-app payments that apply to every developer who sells digital goods or services.\n   The company soon shared that they  were taking legal action against Apple, alleging that they were abusing their market position, saying in part that “Apple’s removal of Fortnite is yet another example of Apple flexing its enormous power in order to impose unreasonable restraints and unlawfully maintain its 100% monopoly over the iOS In-App Payment Processing Market.”\n Minutes later, Epic Games broadcast a short video inside Fortnite Party Royale, presenting a spin on Apple’s iconic “1984” commercial. On-screen text declared, “Epic Games has defied the App Store Monopoly. In retaliation, Apple is blocking Fortnite from a billion devices. Join the fight to stop 2020 from becoming ‘1984’. #FreeFortnite”\n  Any legal action against Apple on monopolistic grounds is going to be an uphill battle given the narrow (relatively speaking) focus of the suit, especially given the fact that Apple CEO  Tim Cook   has already spoken to congressional anti-trust officials who didn’t seem to deliver any knockouts at the recent Zoom hearings. While the legal efforts might be a challenge, Epic Games wields major influence over the 350 million users of Fortnite, and gamers have proven particularly apt at launching campaigns against companies and coming out on top.\n This saga comes just days after Apple attracted criticism for denying Microsoft xCloud, a cloud game-streaming application, from the App Store.", "posttime": "2020-08-15 00:59:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,games", "title": "\nEPIC Games发起针对苹果的运动(和诉讼)", "title_en": "\n\t\t\t\tEpic Games launches a campaign (and lawsuit) against Apple\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/epic-games-launches-a-campaign-and-lawsuit-against-apples-app-store/", "via": "", "real_tags": ["apple", "苹果", "games"]}, {"category": "", "categoryclass": "", "imagename": "397a8fe3e48bc023fb2016a35b4d2896.jpg", "infoid": 1018130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一决定为一场法律战奠定了基础，如果两家公司未能延长逗留时间，几乎肯定会要求它们暂时暂停在加州的运营。优步与TechCrunch证实，计划尽快提起上诉。Lyft在一封电子邮件中表示，它将立即寻求上诉法院的进一步暂缓，并将在本周末之前提交动议。\n周一，加州高等法院法官伊桑·舒尔曼(Ethan Schulman)发布了一项初步禁令，迫使优步和Lyft将司机重新归类为员工。这项命令将于8月20日生效。法官承认，该命令将以“重大方式”改变优步和Lyft的商业行为性质，执行禁令将“代价高昂”。然而，这些困难并不足以动摇法院将司机归类为员工的决定，这一决定将迫使优步和Lyft提供失业保险和其他福利。\n加州司法部长泽维尔·贝塞拉(Xavier Becera)与来自洛杉矶、圣地亚哥和旧金山的城市检察官一起对优步和Lyft提起诉讼，以迫使这两家公司遵守AB5。\n优步的律师在一项动议中要求，在上诉法院就是否应该维持这一裁决做出决定期间，应该暂停禁制令。律师们辩称，“如果禁令生效，优步几乎肯定会被迫关闭加州的打车平台，这将对优步和所有依赖其打车应用为他们及其家人创造收入的人造成不可挽回的伤害-特别是在疫情肆虐的情况下。”\n两家公司本周都发表评论称，如果不延长逗留时间，将需要暂停运营。这可能会导致更戏剧性的举动-至少来自优步，它已经威胁要永远离开加州。\n随着这场法律争执的进行，优步和Lyft也在努力争取对22号提案的支持，选民们将有机会在11月的选举中批准或否决这项措施。\n22号提案将要求优步(Uber)和Lyft等公司提供AB5中规定的一系列保护措施。该措施规定，司机在工作期间必须获得至少为最低工资120%的收入保障，每英里30美分的费用，医疗津贴，工伤职业意外保险，免受歧视和性骚扰的保护，以及汽车事故和责任保险。\n有一个关键的区别使它对优步和Lyft很有吸引力：22号提案将把司机归类为独立承包商。", "note_en": "The decision sets the stage for a legal fight and will most certainly require both companies to suspend operations temporarily in California if they fail to get the stay extended. Uber confirmed with TechCrunch it plans to file an appeal as soon as possible.  Lyft   said in an email that it will immediately seek a further stay from the appellate court and will file that motion by the end of this week.\n On Monday, California Superior Court Judge Ethan Schulman granted a preliminary injunction forcing Uber and  Lyft  to reclassify their drivers as employees. This order is set to go into effect August 20. The judge acknowledged that the order would change the nature of Uber and Lyft’s business practices in “significant ways,” and implementing the injunction would be “costly.” However, those hardships weren’t enough to sway the court from classifying drivers as employees, a decision that would force Uber and Lyft to provide unemployment insurance and other benefits.\n California Attorney General Xavier Becerra, along with city attorneys from Los Angeles, San Diego and San Francisco, brought the lawsuit against Uber and Lyft to force the companies to comply with AB 5.\n Uber’s attorneys requested in a motion that an injunction should be stayed while the Court of Appeals makes its decision over whether the ruling should stand. The attorneys argued that “Uber will almost certainly be forced to shut off the Rides platform in California if the injunction goes into effect, which would irreparably harm Uber and all who rely on its Rides app to generate income for them and their families — particularly in the midst of a pandemic.”\n Both companies have made comments this week that if the stay isn’t extended, operations will need to be suspended. It could lead to a more dramatic move — at least from Uber, which has threatened to leave California for good.\n As this legal wrangling plays out, Uber and Lyft are also aiming to build support for Prop 22, a measure that voters will have a chance to approve or reject in the November elections.\n Prop 22 would require companies like Uber and Lyft to provide a number of protections laid out in AB 5. The measure says drivers must receive an earnings guarantee of at least 120% of minimum wage while on the job, 30 cents per mile for expenses, a healthcare stipend, occupational accident insurance for on-the-job injuries, protection against discrimination and sexual harassment and automobile accident and liability insurance.\n There is one key difference that makes it appealing to Uber and Lyft: Prop 22 would keep drivers classified as independent contractors.", "posttime": "2020-08-15 00:59:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "订单,lyft,优步", "title": "\n优步和Lyft在加州推迟员工重新分类订单的竞标中落败", "title_en": "\n\t\t\t\tUber and Lyft lose bid to delay worker reclassification order in California\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/uber-and-lyft-lose-bid-to-delay-worker-reclassification-order-in-california/", "via": "", "real_tags": ["订单", "lyft", "优步"]}, {"category": "", "categoryclass": "", "imagename": "8996d0a51f862e1252b14880097af8b2.jpg", "infoid": 1018129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "例如，如果你正在进行一项研究，研究社交媒体的使用如何潜在地影响或受到情绪的影响，你很可能会依靠自我报告的统计数据来衡量这两项指标。\n当然，没有客观的方法来衡量情绪，所以你必须依赖参与者所说的话。有人会认为，这些人对他们在Facebook、Instagram或Twitter上滚动了多长时间会有相当不错的把握。不太喜欢！\n每个人都知道这些自我报告的数字会有错误，一些研究已经证明了这一点，但Facebook的这项元研究将自我报告与实际的服务器日志进行了比较，表明连接可能不够可靠，不足以用于严肃的科学工作。\n与内部数据相比，对一些问题的回答显示，人们平均高估了他们在现场的时间几个小时。但他们也低估了打开应用程序或网站的次数。看看这张令人兴奋的图表：\n正如你所看到的，不管他们怎么想，很少有人真正每天在这个网站上花费超过三个小时，绝大多数人只花了一个小时。而登录的情况正好相反：相对而言，很少有人认为他们每天打开这款应用程序10次或更多，但这是非常普遍的。年轻人尤其容易出错，考虑到这些研究往往有更多的这一人群，这只是强调了这个问题。\n这并不是说Facebook不是一个人们花费大量-也许太多-时间的网站，即使是按照他们自己的估计。但对这些现象的研究要以可靠的数据为基础，这一点很重要，而似乎自我报告的数据并非如此。\n正如Facebook所说：“我们建议研究人员不要直接使用这些值，而是将人们自我报告的时间解读为他们相对于其他受访者的分布位置的嘈杂估计。”\n换句话说，与其说“在facebook上花费两个小时或更长时间的青少年更有可能使用…。”你可能会说，“在自己报告的facebook使用量中，排名前10%的用户更有可能使用…。”或者诸如此类的。如果需要准确的在线时间，使用追踪应用或与Facebook合作可能是个好主意。", "note_en": "If you were conducting a study that was looking at how social media use potentially affected or was affected by mood, for instance, you would likely rely on self-reported statistics for both measures.\n There’s no objective way to measure mood, of course, so you have to rely on what the participant says. And one would think that those people would have a pretty decent grasp on how long they spent scrolling through  Facebook,    Instagram   or Twitter. Not so much!\n  Everyone understands that these self-reported numbers will have error, and some studies have demonstrated it, but this meta-study from Facebook, comparing self-reporting with actual server logs, shows that the connection is possibly not reliable enough to use for serious scientific work.\n Responses to some questions, when compared to internal data, showed that people overestimated their time on site by hours on average. But they also underestimated the number of times they opened the app or site. Take a look at this exciting chart:\n  As you can see, despite what they thought, very few people actually spent more than three hours on the site per day, with the vast majority spending about one. And the opposite was true of logins: Comparably few people thought they opened the app 10 times a day or more, yet that was extremely common. Younger people especially were prone to error, which, given that these studies tend to have more of that demographic, only emphasizes the problem.\n None of this is to say that Facebook is not a site people spend a lot of — perhaps too much — time on, even by their own estimate. But it’s important for studies of these phenomena to be based on reliable data, and it seems that self-reported data isn’t that.\n As Facebook says: “We suggest that researchers not use these values directly but rather interpret people’s self-reported time spent as a noisy estimate of where they fall on a distribution relative to other respondents.”\n In other words, instead of saying “teens who spend two hours or more on Facebook were more likely to…” you might say, “users in the top 10% of self-reported Facebook use were more likely to…” or some such. If exact times online are needed, a tracking app or collaboration with Facebook is probably a good idea.", "posttime": "2020-08-15 00:58:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,users,研究", "title": "\nFacebook用户很不善于说出他们在上面花了多少时间", "title_en": "\n\t\t\t\tFacebook users are pretty bad at telling how much time they spend on it\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/facebook-users-are-pretty-bad-at-telling-how-much-time-they-spend-on-it/", "via": "", "real_tags": ["facebook", "users", "研究"]}, {"category": "", "categoryclass": "", "imagename": "5a9d2bed8f77748389df7818894cc8cf.jpg", "infoid": 1018128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "围绕苹果应用商店政策的争议已经扩大到包括史诗游戏和热门游戏堡垒之夜。该公司推出了在移动设备上直接支付游戏内货币的选项，导致苹果因违反App Store规则而下架了这款应用。\n苹果表示：“Etic在其应用程序中启用了一项未经苹果审查或批准的功能，他们这样做的明确意图是违反App Store关于应用内支付的指导方针，该指导方针适用于每一位销售数字产品或服务的开发者。”\n与此同时，EPIC表示正在对苹果采取法律行动，这款游戏的下架是“苹果为了施加不合理的限制并非法维持其对iOS应用内支付处理市场的100%垄断而展示其巨大权力的又一例证。”\n为迎接选举日，Facebook向美国用户推出投票资源--该中心将为美国用户集中选举资源，理想情况下，至少为其中一些用户接种疫苗，以防范该平台持续的虚假信息流行。\nInstagram没有从其服务器上删除照片和直接消息-一名安全研究人员发现Instagram在删除照片和私人直接消息很久之后仍在服务器上保留照片和私人直接消息，因此获得了6000美元的漏洞赏金。\nSack和Atlassian加强了他们与更深层次的集成的伙伴关系-这些集成的核心是在Slake中展开与Atlassian产品的深层链接的能力。\nImpact Foods又吞噬了2亿美元-自成立以来，这家植物性肉类公司已经从投资者那里筹集了15亿美元。\nOmaze在扩展到名人活动之外后筹集了3000万美元-Omaze模式已经从以名人为中心的活动转变为包括筹款活动，提供Airstream Caravel或前往博拉博拉的四季度假村(Four Seasons Resort)等奖品。\n我们将在今年的Disrupte大会上探索SaaS的未来--我们将把Canaan Partners的玛哈·易卜拉欣(Maha Ibrahim)、安德森·霍洛维茨(Andreessen Horowitz)的大卫·尤列维奇(David Ulevitch)和贝塞默风险投资公司(Bessemer Venture Partners)的玛丽·多诺弗里奥(Mary D‘Onofrio)聚集在一起，帮助解释。\n如何在条款表中获得您想要的-Lior Zorea讨论了条款表的现实。\n行为健康初创公司的五个成功因素-电池风险投资公司的考特尼·周和贾斯汀·达·罗萨认为，行为健康特别适合从新冠肺炎加速的数字化趋势中受益。\nMinted.com首席执行官玛丽亚姆·纳菲希与我们分享了“创业最大的惊喜”--纳菲希与我们讨论了创始人不常讨论的话题。\n数字成像先驱拉塞尔·基尔希去世，享年91岁，他的工作产生了第一张数字扫描照片，并创造了我们现在认为的像素，他的工作的影响怎么说都不为过。\nAMC将在8月20日重新开放100多家美国影院时提供15美分的门票-这家戏剧巨头宣布计划于8月20日在美国重新开放100多家影院。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "The controversy over Apple’s App Store policies has expanded to include  Epic Games   and its hit title Fortnite. The company introduced a direct payment option for its in-game currency on mobile, leading  Apple to remove the app for violating App Store rules.\n  “Epic enabled a feature in its app which was not reviewed or approved by Apple, and they did so with the express intent of violating the App Store guidelines regarding in-app payments that apply to every developer who sells digital goods or services,” Apple said.\n Epic, meanwhile,  said it’s taking legal action against Apple, and that the game’s removal is “yet another example of Apple flexing its enormous power in order to impose unreasonable restraints and unlawfully maintain its 100% monopoly over the iOS In-App Payment Processing Market.”\n  Bracing for election day, Facebook rolls out voting resources to US users — The hub will centralize election resources for U.S. users and ideally inoculate at least some of them against the platform’s ongoing misinformation epidemic.\n Instagram wasn’t removing photos and direct messages from its servers — A security researcher was awarded a $6,000 bug bounty payout after he found  Instagram   retained photos and private direct messages on its servers long after he deleted them.\n Slack and Atlassian strengthen their partnership with deeper integrations — At the core of these integrations is the ability to get rich unfurls of deep links to  Atlassian   products in Slack.\n  Impossible Foods gobbles up another $200 million — Since its launch the plant-based meat company has raised $1.5 billion from investors.\n Omaze raises $30 million after expanding beyond celebrity campaigns — The Omaze model has shifted away from celebrity-centric campaigns to include fundraisers offering prizes like an Airstream Caravel or a trip to the Four Seasons resort in Bora Bora.\n We’re exploring the future of SaaS at Disrupt this year — We’re bringing Canaan Partners’ Maha Ibrahim, Andreessen Horowitz’s David Ulevitch and Bessemer Venture Partners’ Mary D’Onofrio together to help explain how the landscape has changed.\n  How to get what you want in a term sheet — Lior Zorea discusses the reality of term sheets.\n Five success factors for behavioral health startups — Courtney Chow and Justin Da Rosa of Battery Ventures argue that behavioral health is particularly suited to benefit from the digitization trends COVID-19 has accelerated.\n Minted.com CEO Mariam Naficy shares ‘the biggest surprise about entrepreneurship’ — Naficy got into the weeds with us on topics that founders don’t often discuss.\n  Digital imaging pioneer Russell Kirsch dies at 91 — It’s hard to overstate the impact of his work, which led to the first digitally scanned photo and the creation of what we now think of as pixels.\n AMC will offer 15-cent tickets when it reopens 100+ US theaters on August 20 — The theater juggernaut announced plans to reopen more than 100 theaters in the U.S. on August 20.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-08-15 00:58:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,crunch", "title": "\n《每日新闻》：苹果将堡垒之夜从应用商店中移除", "title_en": "\n\t\t\t\tDaily Crunch: Apple removes Fortnite from the App Store\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/daily-crunch-apple-removes-fortnite-from-the-app-store/", "via": "", "real_tags": ["apple", "苹果", "crunch"]}, {"category": "", "categoryclass": "", "imagename": "778f7ddb4f2c8ec350900548efe991dc.jpg", "infoid": 1018127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "诉讼将辩称，对互联网用户进行实时竞价广告拍卖的大规模监控不可能符合围绕同意处理个人数据的严格欧盟法律。\n诉讼当事人相信，如果他们最终在辩论中获胜，集体索赔可能会超过100亿欧元-尽管这样的法律行动可能需要几年时间才能通过法院。\n在英国，鉴于缺乏在与数据权利相关的案件中寻求集体损害赔偿的既定模式，该案也可能面临一些法律障碍。尽管有迹象表明这种情况正在改变。\n非营利基金会隐私集体今天向阿姆斯特丹地区法院提起诉讼，指控这两家数据经纪巨头通过第三方跟踪cookie和其他广告技术方法处理和共享人们的信息，违反了欧盟的一般数据保护条例(GDPR)。\n由Brandeis律师事务所牵头的荷兰案件，是荷兰有史以来最大的与违反GDPR有关的集体诉讼-索赔基金会代表了所有荷兰公民的利益，他们的个人数据在未经甲骨文(Oracle)和Salesforce的同意和知情的情况下被使用。\n类似的案件将于本月晚些时候提交给英国伦敦高等法院，该法院将参考GDPR和英国的PECR(电子通信隐私法规)-后者管理使用个人数据进行营销通信。那里的案件是由Cadwalader律师事务所牵头的。\n根据GDPR，处理欧盟公民个人数据的同意必须是知情的、具体的和自由给予的。该规定还授予个人有关其数据的权利-例如接收其个人信息副本的能力。\n诉讼的焦点正是这些要求，这些案件将争辩说，科技巨头的第三方跟踪cookie、Bluekai和Krux-托管在亚马逊(Amazon)、Booking.com、Dropbox、Reddit和Spotify等数十个热门网站上的跟踪器-以及其他一些跟踪技术正被用来大规模滥用欧洲人的数据。\n根据甲骨文的营销材料，其数据云(Data Cloud)和蓝凯市场(Bluekai Marketplace)提供商是合作伙伴，可以访问约20亿全球消费者档案。(与此同时，正如我们在6月份报道的那样，Bluekai遭遇了一次数据泄露，数十亿条记录暴露在开放的网络上。)。\n而Salesforce声称其营销云每月与超过30亿的浏览器和设备“互动”。\n多年来，两家公司都通过收购增强了跟踪和定位能力；甲骨文在2014年收购了Bluekai-Salesforce在2016年收购了Krux。\n-https://t.co/NMsaCzjhv5，甲骨文，声称拥有20亿消费者的档案-https://t.co/foiigL4T9C：Lotame，声称拥有30亿用户的档案-https://t.co/BCmd8oKDoq：Salesforce DMP，声称与30亿用户互动。\n在与TechCrunch的电话交谈中，英格兰和威尔士的阶级代表、索赔人丽贝卡·拉姆布尔(Rebecca Rumbull)博士在谈到这起诉讼时表示：“我认为，任何普通人都不可能真的知情同意甲骨文和Salesforce放置的cookie处理他们的数据的方式。”\n“当你开始挖掘它的时候，你会发现这些Cookie有很多非常有害的操作方式--比如Cookie同步，以及个人数据的聚合--所以确实存在非常非常严重的隐私问题。”\n近年来，这两家公司的跟踪cookie和技术提供的实时竞价(RTB)过程，使得个人网络用户在浏览时能够进行后台、高速的个人资料交易，以便运行动态广告拍卖并提供针对其兴趣的行为广告，这一过程近年来受到了包括英国在内的许多GDPR投诉。\n这些投诉认为，RTB对人们信息的处理违反了规定，因为向如此多的其他实体广播数据本质上是不安全的-而相反，GDPR在设计和默认情况下都对隐私提出了要求。\n与此同时，英国信息专员办公室(UK Information Commission‘s Office)一年多来一直承认广告技术存在合法性问题。但到目前为止，监管机构一直袖手旁观，而不是执法-让投诉人犹豫不决。(去年，爱尔兰DPC在接到类似投诉后，对谷歌的广告技术展开了正式调查，但尚未在一起跨境投诉中发布一项GDPR决定--这引发了人们对执法瓶颈的担忧。)。\n根据朗布尔的说法，针对RTB的两起诉讼并不集中在安全指控上，而是主要涉及同意和数据访问权。\n她证实，考虑到对相关科技巨头提起诉讼的性质，他们选择了诉讼，而不是试图尝试监管投诉途径，以此作为行使权利的一种方式。\n“如果我只是一个小人物，试图向甲骨文投诉，试图利用英国信息专员(UK Information Commission)来实现这一目标(…)。他们根本没有足够的资源来处理一个人对甲骨文这样的公司的投诉--就这种规模而言，“拉姆布尔告诉TechCrunch。\n“就能够证明危害而言，这是一项相当多的工作，而你得到的回报可能会相当小。它肯定不会补偿我在上面花费的时间…。然而，作为一个有代表性的集体诉讼，我可以代表英国所有受此影响的人。\n“然后，这笔钱就会发挥作用--甲骨文的财力雄厚，诉讼费用是巨大的，而且事实是，希望通过这种方式，在一个非常大规模、非常公开的论坛上，不仅要在最后收回资金，还要努力在该行业实现更标准化的变革。”\n她补充说：“如果Salesforce和甲骨文不能成功对抗这一问题，那么希望这会在整个广告技术行业产生涟漪-鼓励那些使用这些非常有害的cookie的人改变他们的行为。”\n这起诉讼由Innsworth提供资金，Innsworth是一家诉讼资助者，也为沃尔特·梅里克斯(Walter Merricks)在伦敦法院为4600万消费者对万事达卡(Mastercard)提起的集体诉讼提供资金。GDPR似乎正在帮助改变英国的集体诉讼格局-因为它允许个人采取私人法律行动。该框架还可以支持第三方代表个人提出赔偿要求。而国内消费者权益法的修改似乎也在推动集体诉讼。\n英斯沃斯顾问公司(Innsworth Advisors)董事总经理伊恩·加拉德(Ian Garrard)在一份声明中表示：“英国集体诉讼制度的发展，以及欧盟/欧洲经济区(EEA)的集体补救措施，意味着英斯沃斯可以将资金投入到工作中，使数百万个人数据被滥用的个人能够诉诸法律。”\n英国另一起仍在进行的诉讼，正代表Safari用户向谷歌寻求损害赔偿，这些用户的隐私设置历来被谷歌忽视。这起诉讼似乎也增强了与数据问题相关的集体诉讼风格的法律诉讼的前景。\n尽管法院去年最初驳回了这起诉讼，但上诉法院推翻了这一裁决，驳回了谷歌的论点，即英国和欧盟法律要求“提供因果关系和相应损害的证据”，才能提出与数据失控相关的索赔。\n法官说，索赔人不需要证明“金钱损失或困境”就可以追回损害赔偿，而且还允许课程在没有所有成员都有相同利益的情况下继续进行。\n在谈到这起案件时，伦布尔表示，那里悬而未决的最终判决(可能在明年)可能会影响到她参与的诉讼是否能在英国继续进行。\n“我非常希望英国司法机构对此类案件持开放态度，因为如果没有这类非常大的集体诉讼，几乎就像关闭了整个诉讼领域的大门。她说：“如果有一项法律裁决说这起案件不能继续进行，因此这起案件不能继续进行，我很想了解司法机构如何认为我们可以求助于这些私营公司来采取此类行动。”\n当被问及为什么诉讼集中在甲骨文和Saleforce身上时，考虑到有这么多公司参与了广告技术管道，她说：“我并不是说它们一定是最糟糕的或唯一这样做的公司。然而，它们都是价值数十亿美元的大型国际公司。他们专门购买了不同的广告软件，如BlueKai，以加强他们在这一领域的存在-以增加自己的利润。\n“这是他们做出的一个战略商业决定，目的是进入这个领域，成为重要的参与者。因此，就广告技术市场而言，他们是非常、非常大的参与者。如果他们能够对此负责，那么这将有望改变整个行业。它有望减少其他更有害的饼干制造商的藏身之处。显然，他们有非常巨大的收入，所以就针对那些造成很大伤害、有能力赔偿的人而言，这些公司是正确的目标。“\nRumbull还告诉我们，隐私集体正在收集那些认为自己经历了与在线跟踪相关的伤害的网络用户的故事。\n她补充说：“有大量证据表明，这些饼干是如何工作的，这意味着你可以在个人层面上给人们带来非常、非常糟糕的结果。”“无论是与个人理财有关，还是与操纵上瘾行为有关，这些都是非常、非常有可能的--它们涵盖了我们生活的方方面面。”\n英格兰、威尔士和荷兰的消费者正被鼓励通过隐私集体的网站注册他们对这些行动的支持。\nBrandeis首席律师克里斯蒂安·阿尔伯丁克·蒂姆(Christian Alberdingk Thijm)在一份声明中表示：“你的数据被实时出售给出价最高的人，这公然违反了欧盟的数据保护规定。”这种广告定向技术是阴险的，因为大多数人没有意识到它的影响或它带来的侵犯隐私和数据权利的行为。在这种广告环境中，甲骨文和Salesforce每天都会进行违反欧洲隐私规则的活动，但这是他们第一次被追究责任。这些案件将引起人们对人们从个人信息中获得天文数字利润的关注，以及这种缺乏问责给个人和社会带来的风险。“。\n他说：“数以千计的机构每周处理数十亿宗投标申请，充其量并不一致地采用足够的技术和组织措施来保障资料的安全，而很少或根本没有考虑资料保护法对个人资料国际转移的要求。”GDPR给了我们维护个人权利的工具。集体诉讼意味着我们可以将造成的伤害汇总在一起，“来自Cadwalader的合伙人Melis Acuner在另一份支持声明中补充道。\n隐私集体基于故意歪曲事实而故意提起毫无价值的诉讼。“正如甲骨文之前告知隐私集体的那样，甲骨文在实时竞标过程(RTB)中没有直接角色，在欧盟的数据足迹最小，并且有一个全面的GDPR合规计划。尽管甲骨文进行了冗长的解释，但隐私集体决定通过恶意提起的诉讼来追查其敲诈行为。甲骨文将对这些毫无根据的指控进行有力的辩护。\n在Salesforce，信任是我们的第一价值，对我们来说，没有什么比我们公司客户数据的隐私和安全更重要的了。我们在设计和构建我们的服务时将隐私放在首位，为我们的企业客户提供工具，帮助他们遵守适用的隐私法(包括欧盟GDPR)规定的义务，保护自己客户的隐私权。\nSalesforce和另一家数据管理平台提供商收到了一家名为隐私集体(Privacy Collective)的荷兰组织提出的与隐私有关的投诉。索赔适用于Salesforce Audience Studio服务，与任何其他Salesforce服务无关。\n我们全面的隐私计划提供工具来帮助我们的客户保护他们自己客户的隐私权。要了解有关我们为企业客户提供的工具以及我们对隐私的承诺的更多信息，请访问：Salesforce.com/Privacy/Products/", "note_en": "The suits will argue that mass surveillance of Internet users to carry out real-time bidding ad auctions cannot possibly be compatible with strict EU laws around consent to process personal data.\n The litigants believe the collective claims could exceed €10BN, should they eventually prevail in their arguments — though such legal actions can take several years to work their way through the courts.\n  In the UK, the case may also face some legal hurdles given the lack of an established model for pursuing collective damages in cases relating to data rights. Though there are signs that’s changing.\n Non-profit foundation,  The Privacy Collective, has filed one case today with the District Court of Amsterdam, accusing the two data broker giants of breaching the EU’s General Data Protection Regulation (GDPR) in their processing and sharing of people’s information via third party tracking cookies and other adtech methods.\n The Dutch case, which is being led by law-firm  bureau Brandeis, is the biggest-ever class action in The Netherlands related to violation of the GDPR — with the claimant foundation representing the interests of all Dutch citizens whose personal data has been used without their consent and knowledge by Oracle and Salesforce.\n A similar case is due to be filed later this month at the High Court in London England, which will make reference to the GDPR and the UK’s PECR (Privacy of Electronic Communications Regulation) — the latter governing the use of personal data for marketing communications.  The case there is being led by law firm  Cadwalader.\n Under GDPR, consent for processing EU citizens’ personal data must be informed, specific and freely given. The regulation also confers rights on individuals around their data — such as the ability to receive a copy of their personal information.\n It’s those requirements the litigation is focused on, with the cases set to argue that the tech giants’ third party tracking cookies,  BlueKai   and  Krux   — trackers that are hosted on scores of popular websites, such as Amazon, Booking.com, Dropbox, Reddit and Spotify to name a few — along with a number of other tracking techniques are being used to misuse Europeans’ data on a massive scale.\n Per  Oracle marketing materials, its Data Cloud and BlueKai Marketplace provider partners with access to some 2BN global consumer profiles. (Meanwhile, as we reported in  June, BlueKai suffered a data breach that exposed billions of those records to the open web.)\n While Salesforce  claims its marketing cloud ‘interacts’ with more than 3BN browsers and devices monthly.\n Both companies have grown their tracking and targeting capabilities via acquisition for years; Oracle bagging BlueKai in  2014 — and Salesforce snaffling Krux in  2016.\n –  https://t.co/NMsaCzjhv5, Oracle, claims to have profiles on 2bn consumers –  https://t.co/foiigL4T9C: Lotame, claims to have profiles on 3bn users –  https://t.co/BCmd8oKDoq: Salesforce DMP, claims to &#39;interact&#39; with 3bn users\n  Discussing the lawsuit in a telephone call with TechCrunch, Dr Rebecca Rumbul, class representative and claimant in England &amp; Wales, said: “There is, I think, no way that any normal person can really give informed consent to the way in which their data is going to be processed by the cookies that have been placed by Oracle and Salesforce.\n “When you start digging into it there are numerous, fairly pernicious ways in which these cookies can and probably do operate — such as cookie syncing, and the aggregation of personal data — so there’s really, really serious privacy concerns there.”\n The real-time-bidding (RTB) process that the pair’s tracking cookies and techniques feed, enabling the background, high velocity trading of profiles of individual web users as they browse in order to run dynamic ad auctions and serve behavioral ads targeting their interests, has, in recent years, been subject to  a number of GDPR complaints, including in the UK.\n These complaints argue that RTB’s handling of people’s information is a breach of the regulation because it’s inherently insecure to broadcast data to so many other entities — while, conversely, GDPR bakes in a requirement for privacy by design and default.\n The UK Information Commissioner’s Office has, meanwhile, accepted for  well over a year that  adtech has a lawfulness problem. But the regulator has so far  sat on its hands, instead of enforcing the law — leaving the complainants dangling. (Last year, Ireland’s  DPC opened a formal investigation of Google’s adtech, following a similar complaint, but has yet to issue a single GDPR decision in a cross-border complaint — leading to  concerns of an enforcement bottleneck.)\n The two lawsuits targeting RTB aren’t focused on the security allegation, per Rumbul, but are mostly concerned with consent and data access rights.\n She confirms they opted to litigate rather than trying to try a regulatory complaint route as a way of exercising their rights given the “David vs Goliath” nature of bringing claims against the tech giants in question.\n “If I was just one tiny person trying to complaint to Oracle and trying to use the UK Information Commissioner to achieve that… they simply do not have the resources to direct at one complaint from one person against a company like Oracle — in terms of this kind of scale,” Rumbul told TechCrunch.\n “In terms of being able to demonstrate harm, that’s quite a lot of work and what you get back in recompense would probably be quite small. It certainly wouldn’t compensate me for the time I would spend on it… Whereas doing it as a representative class action I can represent everyone in the UK that has been affected by this.\n “The sums of money then work — in terms of the depths of Oracle’s pockets, the costs of litigation, which are enormous, and the fact that, hopefully, doing it this way, in a very large-scale, very public forum it’s not just about getting money back at the end of it; it’s about trying to achieve more standardized change in the industry.”\n “If Salesforce and Oracle are not successful in fighting this then hopefully that send out ripples across the adtech industry as a whole — encouraging those that are using these quite pernicious cookies to change their behaviours,” she added.\n The litigation is being funded by  Innsworth, a litigation funder which is also funding Walter Merricks’ class action for 46 million consumers against Mastercard in London courts. And the GDPR appears to be helping to change the class action landscape in the UK — as it allows individuals to take private legal action. The framework can also support third parties to bring claims for redress on behalf of individuals. While changes to domestic consumer rights law also appear to be driving class actions.\n Commenting in a statement, Ian Garrard, managing director of Innsworth Advisors, said: “The development of class action regimes in the UK and the availability of collective redress in the EU/EEA mean Innsworth can put money to work enabling access to justice for millions of individuals whose personal data has been misused.”\n A separate and still ongoing lawsuit in the UK, which is seeking damages from  Google   on behalf of Safari users whose privacy settings it historically ignored, also looks to have bolstered the prospects of class action style legal actions related to data issues.\n While the courts initially tossed the suit  last year, the appeals court overturned that ruling — rejecting Google’s argument that UK and EU law requires “proof of causation and consequential damage” in order to bring a claim related to loss of control of data.\n The judge said the claimant did not need to prove “pecuniary loss or distress” to recover damages, and also allowed the class to proceed without all the members having the same interest.\n Discussing that case, Rumbul suggests a pending final judgement there (likely next year) may have a bearing on whether the lawsuit she’s involved with can be taken forward in the UK.\n “I’m very much hoping that the UK judiciary are open to seeing these kind of cases come forward because without these kinds of things as very large class actions it’s almost like closing the door on this whole sphere of litigation. If there’s a legal ruling that says that case can’t go forward and therefore this case can’t go forward I’d be fascinated to understand how the judiciary think we’d have any recourse to these private companies for these kind of actions,” she said.\n Asked why the litigation has focused on Oracle and Saleforce, given there are so many firms involved in the adtech pipeline, she said: “I am not saying that they are necessarily the worst or the only companies that are doing this. They are however huge, huge international multimillion-billion dollar companies. And they specifically went out and purchased different bits of adtech software, like BlueKai, in order to bolster their presence in this area — to bolster their own profits.\n “This was a strategic business decision that they made to move into this space and become massive players. So in terms of the adtech marketplace they are very, very big players. If they are able to be held to account for this then it will hopefully change the industry as a whole. It will hopefully reduce the places to hide for the other more pernicious cookie manufacturers out there. And obviously they have huge, huge revenues so in terms of targeting people who are doing a lot of harm and that can afford to compensate people these are the right companies to be targeting.”\n Rumbul also told us The Privacy Collective is looking to collect stories from web users who feel they have experienced harm related to online tracking.\n “There’s  plenty of evidence out there to show that how these cookies work means you can have very, very egregious outcomes for people at an individual level,” she added. “Whether that can be related to personal finance, to manipulation of addictive behaviors, whatever, these are all very, very possible — and they cover every aspect of our lives.”\n Consumers in England and Wales and the Netherlands are being encouraged to register their support of the actions via The Privacy Collective’s  website.\n In a statement, Christiaan Alberdingk Thijm, lead lawyer at Brandeis, said: “Your data is being sold off in real-time to the highest bidder, in a flagrant violation of EU data protection regulations. This ad-targeting technology is insidious in that most people are unaware of its impact or the violations of privacy and data rights it entails. Within this adtech environment, Oracle and Salesforce perform activities which violate European privacy rules on a daily basis, but this is the first time they are being held to account. These cases will draw attention to astronomical profits being made from people’s personal information, and the risks to individuals and society of this lack of accountability.”\n “Thousands of organisations are processing billions of bid requests each week with at best inconsistent application of adequate technical and organisational measures to secure the data, and with little or no consideration as to the requirements of data protection law about international transfers of personal data. The GDPR gives us the tool to assert individuals’ rights. The class action means we can aggregate the harm done,” added partner Melis Acuner from Cadwalader in another supporting statement.\n   The Privacy Collective knowingly filed a meritless action based on deliberate misrepresentations of the facts.  As Oracle previously informed the Privacy Collective, Oracle has no direct role in the real-time bidding process (RTB), has a minimal data footprint in the EU, and has a comprehensive GDPR compliance program. Despite Oracle’s fulsome explanation, the Privacy Collective has decided to pursue its shake-down through litigation filed in bad faith.  Oracle will vigorously defend against these baseless claims.\n  At Salesforce, Trust is our #1 value and nothing is more important to us than the privacy and security of our corporate customers’ data. We design and build our services with privacy at the forefront, providing our corporate customers with tools to help them comply with their own obligations under applicable privacy laws — including the EU GDPR — to preserve the privacy rights of their own customers.\n Salesforce and another Data Management Platform provider, have received a privacy related complaint from a Dutch group called The Privacy Collective. The claim applies to the Salesforce Audience Studio service and does not relate to any other Salesforce service.\n  Our comprehensive privacy program provides tools to help our customers preserve the privacy rights of their own customers. To read more about the tools we provide our corporate customers and our commitment to privacy, visit  salesforce.com/privacy/products/", "posttime": "2020-08-15 00:55:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "甲骨文,salesforce,oracle,诉讼", "title": "\n甲骨文和Salesforce因Cookie跟踪同意而遭遇GDPR集体诉讼", "title_en": "\n\t\t\t\tOracle and Salesforce hit with GDPR class action lawsuits over cookie tracking consent\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/14/oracle-and-salesforce-hit-with-gdpr-class-action-lawsuits-over-cookie-tracking-consent/", "via": "", "real_tags": ["甲骨文", "oracle", "诉讼"]}, {"category": "", "categoryclass": "", "imagename": "b64d5cd8a0d9b9e91311c48a646870d8.jpg", "infoid": 1018126, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司周五表示，其名为亚马逊药房(Amazon Pharmacy)的新服务已经开始在班加罗尔接受非处方药和处方药的订单。(在印度，抗生素和其他几种药物通常可以在没有处方的情况下从药店购买。)。\n亚马逊药房还在销售传统草药和一些健康设备，如血糖仪、雾化器和手持按摩器。\n亚马逊的一位发言人在一份声明中说：“这在当今时代尤为重要，因为它将帮助顾客在满足基本需求的同时，安全地呆在家里。”\n新德里目前还没有对印度的在线药品销售进行明确的监管，这给亚马逊带来了又一个重大机遇。到目前为止，亚马逊已经在印度业务上投资了超过65亿美元，并在那里与沃尔玛(Walmart)旗下的Flipkart展开竞争。\n对于亚马逊来说，药房并不是一个新想法。该公司近年来聘请了几名健康专家，2018年以近10亿美元收购了在线药房初创公司PillPack。\n数十家初创公司，如1 mg，Netmeds，Medlife和PharmEasy目前在印度在线销售药品，并向该国大部分地区送货。例如，1 mg已经筹集了超过1.7亿美元的资金，现在它已经在全国1000多个城市交付订单。\n这些初创公司，就像任何电子商务公司一样，为每一笔订单向客户提供诱人的折扣，以增加他们的市场份额。在这方面，亚马逊表示，它还为所有订单提供高达20%的折扣。\n近几个月来，亚马逊在印度已经扩展到几个新的类别。今年5月，该公司在班加罗尔部分地区推出了送餐服务，一个月后获准在西孟加拉邦销售和送货酒类。\n上个月，该公司开始在印度销售汽车保险，并表示计划扩大其保险服务，以在未来提供健康、航班和出租车保险。\n它向更多类别扩张之际，Flipkart也在进入新的领域，包括上月底在班加罗尔试行的超本地化送货。路透社周五援引政府信件的话报道，Flipkart已经与一家由巨头帝亚吉欧(Diageo)支持的初创公司合作，在印度的两个城市运送酒精。\n这两家公司现在都面临着一个新兴的挑战者：印度首富。穆凯什·安巴尼(Mukesh Ambani)的信实零售(Reliance Retail)是印度最大的零售连锁店，去年年底开始测试电子商务企业JioMart。\n这项服务目前在印度200多个城镇运营，据报道，上个月每天售出超过40万份订单，超过了杂货配送初创公司BigBasket和Grofers的日峰值。\n当地媒体报道称，亚马逊正着眼于收购Reliance Retail价值数十亿美元的股份。安巴尼的另一家合资公司，电信巨头Jio Platforms，近几个月来从Facebook、谷歌和其他11家知名投资者那里筹集了约200亿美元。安巴尼上个月表示，该公司已经完成了对Jio平台的融资，并期待着“在未来几个季度为Reliance Retail引入全球合作伙伴和投资者”。", "note_en": "The company said on Friday its new service, called Amazon Pharmacy, has started accepting orders for both over-the-counter and prescription-based medicines in Bangalore. (In India, antibiotics and several other drugs can often be purchased from pharmacies without prescriptions.)\n Amazon Pharmacy is also selling traditional herbal medicines and some health devices such as glucose meters, nebulisers and handheld massagers.\n  “This is particularly relevant in present times as it will help customers meet their essential needs while staying safe at home,” an Amazon spokesperson said in a statement.\n Online sales of medicine in India, for which New Delhi currently does not have clear regulations, presents yet another major opportunity for Amazon that has  invested more than $6.5 billion to date into its India operations and where it competes with Walmart-owned Flipkart.\n For Amazon, pharmacy is not a new idea. The company, which has  hired several health experts in recent years, acquired online pharmacy startup  PillPack for nearly $1 billion in 2018.\n  Scores of startups such as 1mg, Netmeds, Medlife and PharmEasy currently sell medicines in India online and deliver to most parts of the country. 1mg, which has raised more than $170 million, today delivers orders in more than a 1,000 cities in the country, for instance.\n These startups, as with any e-commerce player, offer enticing discounts to customers on each order to increase their market share. On that front, Amazon says it is also offering up to 20% discount on all orders.\n In recent months, Amazon has expanded into a handful of new categories in India. It launched its  food delivery service in parts of Bangalore in May and received approval to sell and deliver alcohol in the state of West Bengal a month later.\n Last month, the company started to  sell auto-insurance in India and said it planned to expand its insurance service to offer coverage on health, flight and cabs in the future.\n Its expansion into more categories comes as  Flipkart   is also entering new spaces,  including hyperlocal delivery that it piloted in Bangalore late last month. Flipkart has  partnered with a startup backed by giant Diageo to deliver alcohol in two Indian cities, Reuters reported Friday, citing government letters.\n Both the firms are now facing an emerging challenger: India’s richest man.  Mukesh Ambani’s    Reliance Retail,   the largest retail chain in India, began  testing e-commerce venture JioMart late last year.\n The service, which is now  operational in more than 200 cities and towns across India, reported selling over 400,000 orders a day last month, surpassing daily peak figures of grocery delivery startups BigBasket and Grofers.\n Local media has reported that Amazon is  eyeing a multi-billion-dollar stake in Reliance Retail. Ambani’s other venture, telecoms giant Jio Platforms, has  raised about $20 billion from Facebook, Google, and 11 other high-profile investors in recent months. Ambani said last month that the company had concluded its fundraise for Jio Platforms and is looking forward to “induct global partners and investors in Reliance Retail in the next few quarters.”", "posttime": "2020-08-15 00:55:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,印度,launches", "title": "\n亚马逊在印度推出在线药房", "title_en": "\n\t\t\t\tAmazon launches online pharmacy in India\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/14/amazon-pharmacy-bangalore-india-launch/", "via": "", "real_tags": ["amazon", "亚马逊", "印度", "launches"]}, {"category": "", "categoryclass": "", "imagename": "92e5b32bc0088a10fe57a5582a98ff2f.jpg", "infoid": 1018125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity(现已上Twitter！)，我们在这里解开头条背后的数字。\n本周，我们的全体工作人员再次到场--娜塔莎·马斯卡伦纳斯、丹尼·克莱顿、克里斯·盖茨和我。和往常一样，拥有完整的船员是关键，因为有大量的新闻需要传递。在我们进入展览之前，请确保您已经在TechCrunch List…上查看了丹尼的最新作品。现在，让我们开始吧：\nTikTok传奇还在继续：本周，我们花了几分钟讨论了为什么银行家们会受到激励，让拟议中的TikTok-微软交易尽可能具有竞争力。或者至少让它看起来尽可能有竞争力。此外，微软内部也有一些关于如何看待这笔交易的数据。\nAirbnb可能会在本月申请上市！它可能会在年底前上市！这比我们预期的要好得多。(彭博社获得了第二季度的财务状况。)。\nPalantir可能会在下个月申请直接上市！太好了。我们想知道Palantir到底是一家咨询公司还是一家科技公司。然后我们玩估值宾果游戏，这样我们以后就可以回首往事，自嘲一下。\n我对Duck Creek的首次公开募股(IPO)感到非常兴奋。我的朋友中很少有人和我一起感到兴奋。\n我们三个人还花了一分钟的时间对最新的Pinterest新闻进行了简要介绍，即该公司经营不善，而且根据其现任首席运营官的说法，它是性别歧视的。我们很想停止报道这些故事，但它们一直在发生，我们继续。\n丹尼有一些整齐的SPAC数据要分享，这有助于说明SPAC不仅仅是一个迷因，它们是今年上市公司行动的真正推动力。特斯拉宣布的股票拆分也是如此，这让我们几次问他为什么。\n接下来，娜塔莎向我们介绍了她的最新作品，深入探讨了Z世代是如何撼动融资界的。我们在一些历史背景下框定了这些变化，并决定最终孩子们真的没事。\n丹尼用关于Conduit(连接创始人和早期投资者)和Circle(创建者软件)的说明结束了我们的讨论。这两个都值得你花时间。\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast ( now on Twitter!), where we unpack the numbers behind the headlines.\n This week we had the full crew around once again —  Natasha Mascarenhas,  Danny Crichton,  Chris Gates and  myself. And as always, it was key to have the full crew as there was an ocean of news to get through. Before we get into the show, make sure you’ve checked out  Danny’s latest work on the TechCrunch List… now, let’s get to it:\n The TikTok saga continues: This week we spent a few minutes discussing  why bankers are incentivized to make the proposed TikTok-Microsoft deal as competitive as possible. Or at least make it  look as competitive as possible. And, there’s  some data from inside Microsoft about how the deal is being viewed.\n Airbnb  could file to go public this month! It might go public before the year is out! That’s way better than we expected. ( Bloomberg got its Q2 finances.)\n Palantir  could file for a direct listing next month! That’s great. We wanted to know what Palantir really is, namely a consultancy or a tech company. And then we played valuation bingo so we can look back later and mock ourselves.\n I was  very excited about the Duck Creek IPO. Few of my friends joined me in being excited.\n The three of us also took a minute to riff on  the latest Pinterest news, namely that it’s poorly run and is sexist per its now-former COO. We’d love to stop covering these stories, but they keep happening so, on we go.\n Danny had some  neat SPAC data to share, helping illustrate that SPACs are not merely a meme, they are a real, driving force of public company action this year. As was Tesla’s announced stock split, which led us to ask  why a few times.\n Next up, Natasha walked us through  her latest work digging into how Gen Z is shaking up the funding world. We framed the changes in some historical context, and decided that really in the end the kids are alright.\n Danny brought us to a close, with a note on Conduit ( connecting founders and early-stage investors) and Circle ( creator software). Both are worth your time.\n  Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-08-15 00:54:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "世代,changed", "title": "\n看看Z世代是如何改变筹款活动的", "title_en": "\n\t\t\t\tLooking at how Gen Z has changed fundraising\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/14/looking-at-how-genz-has-changed-fundraising/", "via": "", "real_tags": ["世代", "changed"]}, {"category": "", "categoryclass": "", "imagename": "09bcb891050fdb320acaad6cb47025fa.jpg", "infoid": 1018124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "北极星2经常在特斯拉Model3摇摇欲坠的地方表现出色。由于北极星是这家瑞典奢侈品牌的亲密合作伙伴，2的贴合和完成程度与宝马(BMW)、梅赛德斯(Mercedes)或沃尔沃(Volvo)的任何车型都不相上下。\n然而，虽然北极星2很棒，但这款车缺乏吸引人的特斯拉生态系统。北极星没有他们的电动汽车充电站网络，目前还不清楚该公司是否会通过空中更新推出新功能。特斯拉有一种围绕其品牌的文化，令人兴奋和诱人，值得在选购汽车时考虑。\n我在北极星2号上度过了一个漫长的上午，在密歇根州地狱附近的郊区交通中导航，在土路上赛车。我开着电动车在高速公路上，带着它去购物，和车住在一起。开了几个小时的车，电池还能续航120英里。\n美国环保署尚未宣布北极星2的射程评级，但北极星本身表示，充电一次，它可以行驶275英里。我经历了一些不那么-更像是250英里的事情。也就是说，在我使用这辆车的短暂时间里，我开得又快又硬。蜿蜒的土路喜欢AWD系统和49/51重量平衡。\n北极星2是一辆可爱的车，建造质量非常好。车门砰的一声关上，座椅支撑舒适，仪表板是由回收材料建造的，同时也是高档但负责任的。感觉就像是一辆来自成熟汽车公司的车。\n我再怎么强调北极星2的手感也不为过，这很可能是因为它与沃尔沃的密切联系。\n北极星三年前刚刚成立于沃尔沃和吉利内部，很快就被剥离出来，成为自己的汽车制造商(尽管与母公司仍保持着密切的联系)。因此，北极星被认为是与沃尔沃、通用汽车和宝马一样的汽车原始设备制造商(OEM)。北极星独立于沃尔沃和吉利，拥有VIN号码、制造设施和高管团队。\n北极星2是这家年轻的汽车初创公司的第二款车。该公司最初推出了北极星1(Polestar 1)，这是一款售价15.5万美元的混合动力大旅行车，三年内限量1500辆，北美市场只有450辆。几周前，我开了一辆生产版的北极星1号，发现它的动力总成非常棒。混合动力系统的调整方式使其成为与最好的旅行者处于同一水平的优秀驾驶车。\n北极星表示，它正在设计驾驶舒适的汽车，该公司的做法是二比二。混合动力的北极星1号非常适合以一种强劲、阳刚的方式驾驶。全电动的北极星2与北极星1自然不同，仍然是为司机的享受而调整的。\n就像我在上面说的，北极星2比特斯拉Model 3开起来更好。\n北极星2号的电动马达在控制受限的情况下提供电力。电动北极星2不是颠簸或快速，而是流畅和精致。在捣碎加速器时，北极星2号逐渐放下功率，缓慢启动，快速加速。别误会我说的话。北极星2仍然很快，能够在不到5秒的时间内达到每小时60英里，对于任何家庭车辆来说，这已经足够快了。根据我的经验，Model3的电力输送被调整为在加速时提供大量电力。Model3非常快，但对一些人来说太快了，即使在标准模式下也是如此。\n北极星2号和模型3的加速度之间的区别是微妙的，但却是本质的。Model3可以在变速赛中抽北极星2，但这与大多数车手无关。对我来说，稍微慢一点但仍然快的北极星2驾驶起来更愉快。\n北极星2满怀信心地转弯，没有一次转向不足。它像最好的四门轿车一样易于操控。这要归功于几件事。其一，这款车的重量平衡近乎完美，前排49%，后排51%。而大部分重量都在车底，也就是电池所在的位置，从而减少了车身的摇摆。其次，每个车桥上的电机通过全轮驱动系统提供了奇妙的牵引力。\n和北极星2一起生活，每天开着它是什么感觉？我不能说。我只在车里呆了几个小时。后座似乎足够容纳一辆中型车，地板面积比特斯拉Model 3更坚固。舱口面积很大，前面有一个小储藏室。\n与北极星2相比，北极星2的行驶里程有所下降。与特斯拉Model 3相比，北极星2显得力不从心。Model3充满电后可以行驶322英里，而北极星2的续航里程约为275英里。有趣的是，北极星2比Model 3有更大的电池组，但也更重，因为北极星2是建立在沃尔沃/吉利平台上的，也用于汽油驱动的汽车。\n沃尔沃的设计语言贯穿了整个北极星2。对我来说，这个设计是未来主义的别致，我喜欢它。北极星2号有存在和镇定。它是有角度的，同时也是流动的。内部则大同小异，有实线和锐利的曲线。\n北极星首席执行官托马斯·英根拉斯(Thomas Ingenlath)是一位资深的汽车设计师，他的影响力是显而易见的。对于北极星的体验来说，设计似乎是至高无上的。在北极星之前，他曾在大众集团(Volkswagen Group)奥迪(Audi)和斯柯达(Skoda)担任过类似职位，之后担任沃尔沃设计高级副总裁。\n北极星2的内饰比大多数车辆都要简约，但仍比Model 3忙碌。它几乎没有物理按键：危险灯、无线电电源、后部除霜、前部除霜和一个音量旋钮(音量应该总是在旋转旋钮上)。方向盘上的两根杆控制着它们的正常功能，方向盘来自沃尔沃最新的汽车，具有媒体控制和巡航控制功能。\n大的中央屏幕很容易阅读，而且位置很好。在我驾驶北极星2的几个小时里，我没有感受到令人反感的眩光。请注意，在这里的图片中，中央屏幕是暗淡的，因为一旦前排座位空了，汽车就会调暗屏幕以节省电池。\n最后，构建质量说明了信心。北极星2感觉并不像Model 3那样有风险，它有无数的设计和制造问题。北极星2给人的感觉不像是创业公司的第二辆车。\n北极星是第一家提供Android Automotive的公司。与Android Auto不同的是，Android Automotive是北极星2的主要界面。它控制着从收音机到气候，从车辆设置到地图、应用程序和连接服务的一切。\nAndroid Automotive令人印象深刻。界面整洁，响应度堪比最好的智能手机。要利用所有功能，用户需要登录到Google帐户。一些用户可能会选择登录他们的主账号，或者只为北极星2创建另一个账号。无论哪种方式，一旦登录，系统都会连接地图、应用程序和用户的其他服务，包括连接到谷歌家庭(Google Home)账号的设备。\nAndroid Automotive在没有登录谷歌的情况下仍然可以使用。通过跳过此步骤，用户将可以访问大多数连接的功能，但某些个性化选项不可用。\n谷歌助手内置在Android Automotive中，是我使用过的第一个运行良好的车内语音服务。只要说，“好的，谷歌，打开Spotify，”它就会打开Spotify。说一个地点，它就会把那个地方调出来。让它改变温度，它就会改变温度，因为Android Automotive也控制着车内的温度控制。某些功能依赖于数据连接，而其他功能(大多数车载设置)在没有数据连接的情况下工作。\nAndroid Automotive在我在北极星2期间给我留下了深刻的印象。它的布局很合理，而且很容易使用。该系统很快就会应用到其他车辆上。北极星只是第一家部署该系统的汽车制造商。\nAndroid Automotive也可以在iOS设备上使用。北极星2将很快通过空中更新获得CarPlay，iPhone用户也可以通过蓝牙连接将他们的设备与Android Automotive配对。\n我离开了北极星2，印象深刻，但很难给出一个完整的推荐。在我看来，即使北极星2的续航里程更短，它也比Model3更好。但是Model3缺少北极星2的一些东西：特斯拉(Tesla)因素。\n尽管特斯拉有所有古怪的缺点，但它有着大胆创新的历史，导致了全国范围内的充电器网络，不断通过空中更新提供的新功能，以及令人愉悦和印象深刻的有趣怪癖。就像宠物模式一样。在推特上向埃隆·马斯克提出建议后，特斯拉迅速推出了一种模式，让用户在中央屏幕上显示一条信息性消息的同时，保护他们的宠物安全。这是关于特斯拉体验的一个很小但很有说服力的细节，目前还不清楚(也不太可能)北极星是否会提供同样的体验。\n北极星卖的不是Model3，而是特斯拉。当一个人购买一辆特斯拉时，他们就是在购买一个与汽车相辅相成的服务生态系统。特斯拉比大多数人更清楚，汽车往往是一种生活方式的选择，该公司建立了令人印象深刻的文化。\n一方面，该公司正在与特斯拉的生态系统和文化作斗争，而北极星似乎正在追随特斯拉的脚步。这家汽车公司放弃了在经销商的停车场销售汽车，并开设了像特斯拉公司商店这样的店面。这些地点位于奢侈品牌旁边的大型购物区等备受瞩目的地区。比如特斯拉的展厅。然而，为了帮助车辆更快地落入买家手中，这些地点将由沃尔沃经销商所有，他们将促进销售和服务。\n北极星认为自己的销售对手是欧洲品牌的豪华中型车，而不是特斯拉本身。至少该公司在公开场合是这么说的。这在一定程度上是有道理的。北极星汽车的制造质量优于特斯拉，与欧洲最好的汽车处于同一水平。\n那么，北极星2比特斯拉Model3更好吗？是。但决定买哪一个是一个复杂的问题。\n特斯拉Model 3充电一次可以行驶更远，并与特斯拉的超级增压器网络无缝集成。这是买家应该考虑的一个重要因素。特斯拉继续推出新功能的承诺也应该是买家的考虑因素，因为它可以保持车辆的新鲜感和刺激性。\n北极星2的价格比Model 3高，但两者在同一范围内。装备精良的北极星2号车的起价约为6万美元，而类似规格的Model 3车的起价约为5万美元。在美国，北极星2号有资格获得7500美元的税收抵免。\n撇开特斯拉不谈，北极星在北极星2号上建造了一辆非常棒的车，这应该得到称赞。这家汽车公司成立三年了，在全球只有800名员工，而且还没有发展到制造世界级汽车的地步。很少有其他汽车公司能做出这样的声明。而且该公司对未来有宏伟的计划。北极星表示，它正在按部就班地在2022年交付SUV北极星3，这款车将采用全新的平台和更长的续航里程。\n编者按：本文的前一个版本错误地指出，特斯拉Model3有资格在美国享受税收抵免。", "note_en": "The Polestar 2 often excels where the Tesla Model 3 falters. The fit and finish of the 2 are on par with anything from BMW, Mercedes or Volvo, as Polestar is a close partner to the Swedish luxury brand.\n However, while the Polestar 2 is fantastic, the car lacks the appealing Tesla ecosystem. Polestar does not have a network of their EV charging stations, and it’s unknown if the company will roll out novel features through over-the-air updates. Tesla has a culture around its brand that’s exciting and enticing and deserves to be considered when shopping for a vehicle.\n    I spent a long morning in the Polestar 2, navigating suburban traffic and racing around the dirt roads near Hell, Michigan. I drove the EV on the highway, took it shopping and lived with the car. After driving the car for a few hours, there were still 120 miles left on the battery.\n The EPA has yet to announce the range rating on the Polestar 2, but Polestar itself says it can go up to 275 miles on a charge. I experienced something a bit less — more like 250 miles. That said, during my short time with the vehicle, I drove it hard and fast. The winding dirt roads loved the AWD system and 49/51 weight balance.\n The Polestar 2 is a lovely vehicle, and the build quality is superb. The doors close with a resounding thud, the seats are supportive and comfortable and the dash is constructed of recycled material that is simultaneously upscale but responsible. It feels like a car from a mature car company.\n I cannot stress enough how well-built the Polestar 2 feels, and that’s likely due to its close ties with Volvo.\n Started just three years ago within Volvo and Geely, Polestar was quickly spun out as its own automaker (though retains close ties to both parents). As such, Polestar is considered an automotive original equipment manufacturer (OEM) just like Volvo, General Motors and BMW. Polestar is independent of Volvo and Geely with its VIN numbers, manufacturing facilities and executive team.\n Polestar 2 is the second vehicle from the young automotive startup. The company started with the Polestar 1, a $155,000 hybrid grand tourer that’s limited to 1,500 cars with only 450 coming to North America over three years. I drove a production Polestar 1 a few weeks ago and  found the powertrain to be fantastic. The hybrid system is tuned in a way that makes it an excellent driver’s car on the same level as the best tourers.\n Polestar says it’s designing its cars to be enjoyable to drive, and the company is two for two. The hybrid Polestar 1 is lovely to drive in a powerful, masculine way. The all-electric Polestar 2 is naturally different from the Polestar 1 and is still tuned for the driver’s enjoyment.\n Like I said at the top, the Polestar 2 is a better car to drive than the Tesla Model 3.\n The Polestar 2’s electric motors deliver power with restrained control. Instead of being jerky or quick, the electric Polestar 2 is smooth and refined. When mashing the accelerator, the Polestar 2 gradually lays down the power, starting slowly and accelerating quickly. Don’t mistake what I’m saying. The Polestar 2 is still quick, able to hit 60 mph in less than 5 seconds, which is fast enough for any family vehicle. In my experience, the Model 3’s electric power delivery is tuned to deliver a lot of power at the moment of acceleration. The Model 3 is very quick, but it’s too fast to some, even in standard modes.\n The difference between the Polestar 2 and Model 3’s acceleration is subtle but essential. The Model 3 can smoke the Polestar 2 in a drag race, and yet that’s not relevant to most drivers. To me, the slightly slower, but still quick, Polestar 2 is more enjoyable to drive.\n The Polestar 2 turns with confidence and has nary an understeer. It’s controllable like the best four-door sedans. This is due to several things. One, the car has a nearly perfect weight balance, with 49% in the front and 51% in the back. And most of that weight is on the bottom of the car, where the batteries are located, reducing body sway. Second, the electric motors on each axle provide fantastic traction through an AWD system.\n How is it to live with the Polestar 2 and drive it every day? I can’t say. I was only in the vehicle for a few hours. The backseat seems roomy enough for a mid-size car, and the floor area feels more substantial than a Tesla Model 3. The hatch area is large, and there’s a small storage compartment in the front.\n The driving range is a downside with the Polestar 2. In comparison with the Tesla Model 3, the Polestar 2 comes up short. The Model 3 can go up to 322 miles fully charged, while the Polestar 2’s range is around 275 miles. Interestingly, the Polestar 2 has a larger battery pack than the Model 3. But it’s also heavier, as the Polestar 2 is built on a Volvo/Geely platform also used for gasoline-powered vehicles.\n There are hints of Volvo’s design language throughout the Polestar 2. To me, the design is futuristically chic, and I love it. The Polestar 2 has presence and poise. It’s angular while being fluid. Inside is more of the same, with solid lines and sharp curves.\n Polestar CEO Thomas Ingenlath is a longtime car designer, and his influences are evident. The design seems paramount to the Polestar experience. Before Polestar, he was Volvo’s senior vice president of Design after holding similar positions within Volkswagen Group at Audi and Skoda.\n The Polestar 2’s interior is more minimalist than most vehicles but still busier than the Model 3. There are few physical buttons: hazard lights, radio power, rear defrost, front defrost and a knob for volume (volume should always be on a spinning knob). The two stalks on the steering column control their normal functions, and the steering wheel is sourced from Volvo’s latest cars and features media controls and cruise controls.\n The large center screen is easy to read and is in a great location. I didn’t experience an offensive glare during my few hours with the Polestar 2. Please note, in the picture here, the center screen is dim because as soon as the front seats are empty, the car dims the screen to save battery.\n In the end, the build quality speaks to confidence. The Polestar 2 doesn’t feel risky, like a Model 3, which has had countless design and manufacturing issues. The Polestar 2 doesn’t feel like a startup’s second vehicle.\n   Polestar is the first company to offer Android Automotive. Different from Android Auto, Android Automotive is the primary interface for Polestar 2. It controls everything from the radio to climate to vehicle settings and maps, apps and connected services.\n Android Automotive is impressive. The interface is clean and as responsive as the best smartphone. To take advantage of all the features, users need to be signed in to a Google Account. Some users might opt to sign in to their main account or create another just for the Polestar 2. Either way, once signed in, the system connects maps, apps and the rest of the person’s services, including devices connected to a Google Home account.\n Android Automotive can still be used without signing into Google. By skipping this step, users will have access to most connected features, but some personalization options are unavailable.\n Google Assistant is built into Android Automotive, and it’s the first in-car voice service I’ve used that worked well. Just say, “Okay, Google, turn on Spotify,” and it turns on Spotify. Say a location, and it pulls up the place. Ask it to change the temperature, and it will change the temperature, as Android Automotive also controls the in-vehicle climate control. Some features depend on a data connection, while others, most in-car settings, work without a data connection.\n Android Automotive impressed during my time in the Polestar 2. It has a logical layout and is easy to use. The system is coming to other vehicles soon. Polestar is just the first automaker to deploy the system.\n Android Automotive works with iOS devices, too. The Polestar 2 will soon gain CarPlay through an over-the-air update, and iPhone users can pair their devices to Android Automotive through a Bluetooth connection, too.\n  I walked away from the Polestar 2 impressed, yet it’s hard to issue a complete recommendation. To me, even with a shorter range, the Polestar 2 is a better vehicle than the Model 3. But the Model 3 has something missing from the Polestar 2: The Tesla factor.\n For all its quirky faults, Tesla has a history of bold innovation that’s resulted in a nationwide network of chargers, constant new features delivered from over-the-air updates and fun quirks that delight and impress. Like Pet Mode. After a suggestion on Twitter to Elon Musk, Tesla quickly rolled out a mode that lets users keep their pets safe while displaying an informative message on the center screen. It’s a small but telling detail about the Tesla experience, and it’s unclear (and unlikely) that Polestar will offer the same experience.\n Polestar isn’t selling against the Model 3, but rather against Tesla. When a person buys a Tesla, they’re buying into an ecosystem of services that complement the vehicle. Tesla knows better than most that a car is often a lifestyle choice, and the company built an impressive culture.\n  On one side, the company is battling Tesla’s ecosystem and culture, and Polestar is seemingly following in Telsa’s footsteps. The car company is forgoing selling cars in dealer’s lots and is opening storefronts like Tesla’s company stores. These locations are in high-profile areas like marquee shopping areas alongside luxury brands. Like Tesla showrooms. However, to help get vehicles in buyer’s hands quicker, these locations will be owned by Volvo dealerships who will facilitate sales and service.\n Polestar sees itself selling against luxury mid-size vehicles from European brands rather than Tesla itself. At least that’s what the company says publicly. It makes sense to a point. The build quality of a Polestar vehicle is superior to that of a Tesla and on the same level as the best from Europe.\n So is the Polestar 2 better than a Tesla Model 3? Yes. But deciding which one to buy is a complicated question.\n The Tesla Model 3 can drive farther on a charge and is seamlessly integrated with Tesla’s Supercharger network. That’s a significant factor that buyers should consider. Tesla’s commitment to continue rolling out new features should also be a consideration for buyers as it keeps the vehicles fresh and exciting.\n The Polestar 2 carries a higher price than the Model 3, but they’re in the same range. Well-equipped Polestar 2 vehicles start around $60,000 while similarly-spec’d Model 3 cars go for around $50,000. In the United States, the Polestar 2 is eligible for a $7,500 tax credit.\n Tesla, aside, Polestar built a fantastic vehicle in the Polestar 2, and that should be applauded. The car company is three years old, only has 800 employees worldwide, and has yet scaled to the point of making world-class vehicles. Few other car companies can make those claims. And the company has big plans for the future. Polestar says it’s on track to deliver the SUV Polestar 3 in 2022, which will feature an all-new platform and a lot longer range.\n  Editor’s note: A previous version of this article incorrectly stated that the Tesla Model 3 was eligible for a tax credit in the United States.", "posttime": "2020-08-15 00:52:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,性能,bests,北极星", "title": "\n北极星2在驾驶性能和享受方面胜过特斯拉Model 3", "title_en": "\n\t\t\t\tThe Polestar 2 bests the Tesla Model 3 in drivability and enjoyment\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/14/the-polestar-2-bests-the-tesla-model-3-in-drivability-and-enjoyment/", "via": "", "real_tags": ["特斯拉", "性能", "bests", "北极星"]}, {"category": "", "categoryclass": "", "imagename": "3c039aa2326c56d4766bba35777c9890.jpg", "infoid": 1018123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该领域一些最大的退出交易包括LinkedIn以15亿美元现金加股票的方式独家收购Lynda，以及TPG以35亿美元收购Ellucian。\n但这两笔交易都发生在2015年。五年后，edtech变得更酷了，而且风起云涌-但它会退出吗？琳达和埃尔卢西亚是一次性的成功故事吗？\n他上周告诉TechCrunch：“我们是一家罕见的edtech首次公开募股(IPO)。”“在EDTECH的很长一段时间里，问题要么是‘卖不卖给培生’。”\n尽管该行业过去发展缓慢，但Paucek表示，现在是创办一家教育科技公司的好时机，因为随着更多的后端基础设施和对在线教育的需求，该行业“终于开始大踏步前进”。\n今天上午，让我们用一些数据来描绘一下edtech退出的景象，并为这种乏味的刻板印象带来一些平衡。\n根据Crunchbase的数据，2003年至2018年间，edtech大约进行了225次收购。RS Components在3月份给我发了一张图表，让我更多地了解这一时间框架：", "note_en": "Some of the largest exits in the space include  LinkedIn’s scoop of Lynda for a $1.5 billion in cash and stock and  TPG’s purchase of Ellucian for $3.5 billion.\n But both of those deals happened in 2015. Five years later, edtech is cooler and surging — but is it seeing exits? Are  Lynda   and Ellucian one-off success stories?\n  “We are a rare edtech IPO,” he told TechCrunch last week. “For a long time in edtech it was either ‘sell to Pearson or not.’”\n Despite the sector’s slow past, Paucek said now is a good time to start an edtech company because the sector “is finally starting to hit its stride” with more back-end infrastructure and demand for online education.\n This morning, let’s use some data to paint a picture of the landscape of edtech exits and bring some balance to this stodgy stereotype.\n  There have been approximately 225 acquisitions in edtech between 2003 and 2018,  according to Crunchbase data. RS Components sent me a graph in March to contextualize this timeframe a bit more:", "posttime": "2020-08-15 00:52:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "技术,exits,收购", "title": "\n教育技术学院的出口在增加，但增加了多少呢？", "title_en": "\n\t\t\t\tEdtech exits are increasing, but by how much?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/14/edtech-exits-are-growing-but-by-how-much/", "via": "", "real_tags": ["技术", "exits", "收购"]}, {"category": "", "categoryclass": "", "imagename": "6e81cc31c136b23213c8d322ab37b817.jpg", "infoid": 1018122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "机器人主要依靠两种基本感官：视觉和触觉。但即使是后者，要赶上前者，还有很长的路要走。卡内基梅隆大学(Carnegie Mellon University)的研究人员希望将听觉作为一种潜在的额外感觉，帮助机器增加对周围世界的感知。\nCMU的一项新实验重新思考了Robotics的Sawyer在金属托盘内移动物体的功能，以获得它们在翻滚、滑动和撞向侧面时发出的声音的感觉。总共有60件物品-包括工具、木块、网球和一个苹果-有15000个“互动”被记录和编目。\n该机器人被团队命名为“Tilt-Bot”，能够以76%的成功率识别物体，即使确定金属螺丝刀和扳手之间相对较小的材料差异也是如此。使用声音数据，机器人通常能够正确地确定物体的材料组成。\n“我认为真正令人兴奋的是，当它失败时，它会在你预期它会失败的事情上失败，”芝加哥大学助理教授奥利弗·克罗默(Oliver Kroemer)在与这项研究相关的一份新闻稿中说。但如果是不同的物体，比如块和杯子，它就可以弄清楚。\n这仍然是早期的东西，初步的结果才刚刚公布，但研究预见到利用声音探测作为机器人感知武器库中的另一种工具的潜力。其中一种可能性是包括一根“拐杖”，机器可以让我们轻拍物体，以便更好地确定其材料特性。", "note_en": "Robots   primarily rely on two basic senses: vision and touch. But even the latter still has a long ways to go to get up to the speed with the former. Researchers at  Carnegie Mellon University   are  looking to hearing as a potential additional sense to help machines increase their perception of the world around them.\n A new experiment from CMU features Rethink Robotics’  Sawyer   moving objects inside a metal tray to get a sense of the sounds they make as a roll around, slide and crash into the sides. There are 60 objects in all — including tools, wooden blocks, tennis balls and an apple — with 15,000 “interactions” recorded and cataloged.\n The robot, named “Tilt-Bot” by the team, was capable of identifying objects with a 76% success rate, even determining the relatively small material differences between a metal screwdriver and wrench. Using the sound data, the robot was often able to correctly determine the material make up of the objects.\n  “I think what was really exciting was that when it failed, it would fail on things you expect it to fail on,” CMU assistant professor Oliver Kroemer said in a release tied to the research. “But if it was a different object, such as a block versus a cup, it could figure that out.”\n This is still early stages stuff, with the initial results only just having been published, but the researches foresee the potential to harness sound detection as yet another tool in a robot’s sensing arsenal. Among the possibilities is the inclusion of a “cane,” the machines could us to tap an object in order to better determine its material properties.", "posttime": "2020-08-15 00:51:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,人员,explore,物体", "title": "\n研究人员探索声音以帮助改善机器人的感知", "title_en": "\n\t\t\t\tResearchers explore sound to help improve robotic perception\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/14/researchers-explore-sound-to-help-improve-robotic-perception/", "via": "", "real_tags": ["机器人", "人员", "explore", "物体"]}]