[{"category": "", "categoryclass": "", "imagename": "606bfdf74f7438f40ee92b683ddd28fd.jpeg", "infoid": 1012623, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "另一家教育技术公司在冠状病毒大流行中蓬勃发展，因为滞留在家中的人们蜂拥至在线课程。\n由著名人工智能研究人员Andrew Ng创立的全球在线学习平台Coursera已经筹集了1.3亿美元的F系列资金，该公司证实。NEA管理普通合伙人斯科特·桑德尔(Scott Sandell)领导此次融资，Coursera的其他现有投资者参与其中，包括凯鹏华盈(Kleiner Perkins)、Seek Group、Learn Capital、Suro Capital和G Squared。\n帕丽斯·马蒂诺讨论了她对神秘的医疗保健计划“港湾”问题的报道，以及这场动荡告诉我们关于其赞助商亚马逊的情况。四名信息记者给出了他们对哪些公司收购时机成熟的看法。", "note_en": "Another education technology company is flourishing amid the coronavirus pandemic, as people stuck at home flock to online classes.\n Coursera, the global online learning platform founded by prominent artificial intelligence researcher Andrew Ng, has raised $130 million in Series F funding, the company confirmed. NEA managing general partner Scott Sandell is leading the financing, with participation from other existing investors in Coursera including Kleiner Perkins, SEEK Group, Learn Capital, SuRo Capital and G Squared.\n  Paris Martineau discusses her reporting on problems at the secretive healthcare initiative Haven, and what the turmoil tells us about its benefactor Amazon. Four Information reporters give their takes on which companies are ripe for acquisitions.", "posttime": "2020-07-18 04:55:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ng,led", "title": "由Andrew Ng创立的在线学习初创公司Coursera在NEA的带领下筹集了1.3亿美元的F系列资金，估值约为25亿美元", "title_en": "Coursera, the online learning startup founded by Andrew Ng, raises $130M Series F led by NEA, at a valuation of around $2.5B", "transed": 1, "url": "https://www.theinformation.com/articles/coursera-raises-130-million-amid-flurry-of-ed-tech-deals", "via": "", "real_tags": ["ng", "led"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约一个半月以来，我一直在使用AMD Ryzen 74700U作为我的主笔记本电脑，与Ubuntu20.04LTS搭配使用。它一直工作得很好，甚至不是最顶尖的AMD雷诺阿SKU。这里有一些额外的评论，供那些考虑使用Linux的新AMD笔记本电脑的人参考。早在5月份，我就买了一台联想IdeaPad5，以便提供AMD Ryzen 74700ULinux基准测试。这款售价800美元多一点的笔记本电脑配备了Ryzen 74700U，16 GB内存，1080p显示屏，512 GB NVMe存储空间。Ryzen 7 4700U作为8核部件，具有2.0 GHz基时钟和4.1 GHz Boost，性能相当不错，比我一直用作日常驱动程序的Intel Whiskeylake Core i7 Dell XPS笔记本电脑要好。雷诺阿显卡也非常适合桌面使用案例。虽然最初购买笔记本电脑是为了AMD Renoir Linux测试，但我对这款联想IdeaPad的构建质量留下了良好的印象，之前从未拥有过IdeaPad型号，但多年来一直拥有许多ThinkPad。笔记本电脑的构建质量和Ryzen 7 4700U的性能给我留下了深刻的印象，在我最初的Linux测试之后，我决定把它作为我的主要笔记本电脑来取代戴尔XPS。联想IdeaPad5的构建质量一直很好，尽管特别是在大流行时期，这台笔记本电脑绝大多数时间都连接到我办公室的KVM设置上。但话虽如此，用配备Radeon Vega显卡的Ryzen 74700U在HDMI上驱动4K显示屏的效果一直很好。至少在我使用GNOME Shell并保持打开Firefox、Thunderbird、GNOME终端、Gedit和其他应用程序的工作流程中，Vega的性能在4K时还不错。考虑到GNOME方面的所有性能优化，今年秋天的GNOME3.38应该会变得更好，但它已经很好了。偶尔出现的YouTube视频也可以正常工作。显然，如果期望比赛的话，表演就会差强人意。在CPU方面，Ryzen 7 4700U八核移动处理器已经证明与Intel Core i7 Whiskeylake相比有显著的不同，我没有抱怨Firefox和Chrome的大量网络浏览器使用、Thunderbird总是运行邮件和RSS、频繁使用GNOME终端、在GIMP内为文章编辑照片、用Gedit编写文章、在Gedit和GNOME终端上编码等性能。在Phoronix Test Suite测试配置文件开发期间，代码编译和其他要求很高的任务，尽管通常对于非常繁重的工作负载，我在其他几十个系统上也是这样做的。虽然我最初希望买一台Ryzen 4800/4900系列笔记本电脑，但遗憾的是预算不允许，而Ryzen 74700U已经证明，这款笔记本电脑我原本没有的能力已经足够了。我甚至不打算将其用于频繁的基准测试之外。类似地，还有搭载Lenovo Flex5的Ryzen 54500u，我还在继续进行新的Linux日常测试(更有趣的测试定于下周发布)。作为我的主系统，我一直在使用Ubuntu20.04LTS。对于Ubuntu20.04，正如早些时候的Ryzen 74700U中所概述的那样，需要的主要改变是升级内核以工作加速图形和电池报告。我在这台笔记本电脑上使用Linux5.7和Ubuntu20.04LTS，一直运行得很好。我很快就会升级到Linux5.8，因为它有一些性能优势。之前在我的主系统上，我使用的是英特尔的Clear Linux。但当谈到过渡到新笔记本电脑时，考虑到英特尔内部发生的明确的Linux剥离台式机(尽管仍受支持)和其他内部重组的情况，英特尔并没有向我灌输太多信心，无法继续将其用作我的日常驱动程序。虽然在Clear LinuxI&#39；之前我一直是Fedora工作站的长期用户，但我对Ubuntu20.04的形成以及Canonical涌入GNOME的所有工作都相当满意，所以我决定回到那里作为我的日常操作系统。这件事一直做得很好，没有人抱怨。我们将拭目以待，看看这种情况是否会持续下去，或者我是否会在任何时候转向雷诺阿+1笔记本电脑时搬到Fedora Workstation。所以在转移到运行Ubuntu 20.04 LTS的Ryzen 7 4700U的联想IdeaPad一个多月后，我对笔记本电脑本身、Ryzen 7 4700U的性能以及Ubuntu 20.04这几天作为我的日常操作系统都相当满意。这款IdeaPad甚至可能是我多年来用作日常系统的最便宜的笔记本电脑，如果还没有的话，Ryzen 7 4700U的性能一直很好，当它主要在办公室连接键盘和4K显示屏时，构建质量足够好，如果使用足够新的内核，Linux支持就会存在。这也是十多年来我的主笔记本电脑第一次使用AMD电源。至于再次使用Ubuntu作为我的m上的操作系统", "note_en": "For about one and a half months now I have been using the AMD Ryzen 7 4700U as my main laptop paired with Ubuntu 20.04 LTS. It&#39;s been working out very well for not even being the top-of-the-line AMD Renoir SKU. Here is some additional commentary for those thinking about one of the new AMD laptops with Linux use.\r   Back in May I picked up a Lenovo IdeaPad 5 in order to deliver  AMD Ryzen 7 4700U Linux benchmarks. This laptop for just over $800 USD came with a Ryzen 7 4700U, 16GB of RAM, 1080p display, 512GB NVMe storage. The performance of the Ryzen 7 4700U as an 8-core part with 2.0GHz base clock and 4.1GHz boost has been quite good and better than the Intel Whiskeylake Core i7 Dell XPS laptop I had been using as my daily driver.  The Renoir graphics are also quite good for desktop use-cases.\r    While originally buying the laptop for AMD Renoir Linux testing due to a good deal, I was (and remained) decently impressed with the build quality of this Lenovo IdeaPad with never owning an IdeaPad model before but many ThinkPads over the years. I was impressed with the build quality of the laptop enough and the Ryzen 7 4700U performance that after my initial Linux testing I decided to make it my main laptop to replace the Dell XPS.\r   The Lenovo IdeaPad 5 build quality has been fine albeit especially during these pandemic times the vast majority of the time this laptop is connected to my KVM setup in the office. But with that said, driving a 4K display over HDMI with the Ryzen 7 4700U with Radeon Vega graphics has been working out fine. At least for my workflow of using GNOME Shell and keeping open Firefox, Thunderbird, GNOME Terminal, Gedit, and other applications, the Vega performance has been fine at 4K. This should get even better come GNOME 3.38 this autumn given all the performance optimizations on the GNOME side, but already it&#39;s fine. The occasional YouTube video also works without issue. Obviously though the performance would come up short if expecting to game.\r     On the CPU side, the Ryzen 7 4700U eight-core mobile processor has proven to make a noticeable difference compared to an Intel Core i7 Whiskeylake and I have no complaints about the performance for heavy web browser usage with Firefox and Chrome, Thunderbird always running for mail and RSS, frequent GNOME Terminal usage, editing photos within GIMP for articles, writing articles in Gedit, coding in Gedit and GNOME Terminal, etc. During Phoronix Test Suite test profile development is also code compilation and other demanding tasks, though usually for the very heavy workloads I am doing that on the dozens of other systems around.\r   While originally I hoped to buy a Ryzen 4800/4900 series laptop, the budget has sadly not allowed, and the Ryzen 7 4700U has proven to be plenty capable out of this laptop I originally didn&#39;t even intend to use for more than just frequent benchmarking. Similarly, there is the  Ryzen 5 4500U with the Lenovo Flex 5 where I continue to be working on new Linux tests about daily (more interesting tests there slated for publishing next week).\r   As my main system, I have been using Ubuntu 20.04 LTS. With Ubuntu 20.04, as outlined in the earlier Ryzen 7 4700U, the main change needed is to upgrade the kernel for working accelerated graphics and battery reporting. I am using Linux 5.7 with Ubuntu 20.04 LTS on this laptop and it&#39;s been working out very well. I will be upgrading to Linux 5.8 shortly as there are some performance benefits.\r   Previously on my main system I was using Intel&#39;s Clear Linux. But when it came to transitioning to a new laptop, given  Clear Linux divesting sort of from the desktop (albeit still supported) and other internal reorganizations that have happened within Intel, didn&#39;t instill much confidence in continuing to use it as my daily driver. While prior to Clear Linux I&#39;ve been a longtime Fedora Workstation user, I have been quite happy with how Ubuntu 20.04 shaped up and all the work Canonical has been pouring into GNOME, so I decided to return to that as my daily OS. It&#39;s been working out well and no complaints. We&#39;ll see if that keeps up or if I move to Fedora Workstation whenever it comes time to move to a Renoir+1 laptop.\r   So all in over one month after moving to a Lenovo IdeaPad with Ryzen 7 4700U running Ubuntu 20.04 LTS, I am quite happy with the laptop itself, the performance out of the Ryzen 7 4700U, and Ubuntu 20.04 for that matter as my daily OS these days. This IdeaPad has even been probably the cheapest laptop I&#39;ve used as my daily system at least in many years if not ever yet the performance with the Ryzen 7 4700U has been great, the build quality of the laptop is good enough when being predominantly in the office attached to a keyboard and 4K display, and the Linux support is there if using a new enough kernel. This is also the first time in more than one decade my main laptop has been AMD powered. As for using Ubuntu again as the OS on my main production system, I am very happy with how Ubuntu 20.04 LTS turned out.", "posttime": "2020-07-18 04:54:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,amd,running", "title": "我一直在运行AMD Ryzen 7 4700U和Ubuntu 20.04作为我的主系统", "title_en": "I've Been Running the AMD Ryzen 7 4700U and Ubuntu 20.04 as My Main System", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Ryzen-7-4700U-Daily-Driver", "via": "", "real_tags": ["ubuntu", "amd", "running"]}, {"category": "", "categoryclass": "", "imagename": "3d7558a1a692842afcba7bef0d933e2a.jpg", "infoid": 1012617, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一封我希望永远不用写的电子邮件。你好[现代公关人员]，我希望你度过了一个愉快的7月4日。我不想写这封电子邮件，但是有人刚刚偷走了你借给我们的Ioniq。在那之前，我和这辆小型超小型混合动力车在一起的这一周一直很棒--毕竟，有什么不喜欢55英里(4.3L/100公里)的感觉呢？但事实证明，这个故事中有一个令人惊讶的英雄，一个被许多Ars Technica观众辱骂的英雄：联网的汽车服务拯救了世界。\nIoniq并不是现代汽车阵容中最新的电动汽车--事实上，它在2016年首次亮相，在那之后的几年里，插电式混合动力汽车和电池电动汽车版本都加入了它的行列。但出于这样或那样的原因，这个2020款Ioniq车型年是我们第一次测试一款。该范围的起价为23,200美元，最有效的，如果最精致的内饰，Ioniq Blue。但就像新闻车队的做法一样，我们的是一辆售价31200美元的Ioniq Limited，配备了自适应巡航控制系统、LED大灯、带有导航功能的10.25英寸信息娱乐系统(以及CarPlay和Android Auto)，仅举几例。\n这一车型年最大的变化是中年更新，采用了新的、更具空气动力学的造型和修订的内饰。Ioniq由一台1.6L直喷阿特金森循环四缸发动机提供动力，可产生104马力(76kW)和109磅英尺(148 Nm)功率，与43马力(32kW)、125磅英尺(169 Nm)永磁同步电机协同工作，这些电机将通过六速双离合器变速器将高达139马力(104kW)的功率输送到前轮。电池是1.56kWh的锂离子电池，这有助于Ioniq实现55英里/加仑(4.1l/100公里)的综合平均行驶里程，这要归功于这款车的15英寸车轮(而不是The Limited的17英寸合金)。\n这辆车设计得很好，适合城市转盘的生活。它很容易进入和看到外面，而且在破碎的街道上骑得很好，这似乎是21世纪美国城市生活的一个不可避免的特征。Ioniq也非常精力充沛--这归功于电动马达，它总是准备好把扭矩送到车轮上。\n这场闹剧的第一个迹象是在7月5日的午餐时间。由于漫长的周末和大流行，Ioniq已经停了几天了，我想出去买午餐，但无论如何，我都找不到车钥匙了。搜查房子花了一个小时，我们的停车场空无一人。我觉得有点愚蠢，就给负责现代车队的公司发了一封电子邮件，让他们知道司机在我们的周末周一来取车时，应该带上备用钥匙。(这句话的意思是：“我觉得有点愚蠢，所以我给负责现代车队的公司发了一封电子邮件，让他们知道司机应该带着备用钥匙来取车。)”\n下午6点，我收到一封邻居发来的关于此事的电子邮件，他提醒我注意到一名年轻人--可能不超过14岁--他看到他在车旁举止可疑。我去外面查看，但没有人可见。根据监控录像，这孩子22分钟后回来了，带着我找不到的钥匙。它们一定是我几天前带进一些杂货时从我口袋里掉出来的，他没有把它们交上去，而是用它们解锁了车，然后开车离开了。\n让我告诉你，一辆借来的车被偷并不是一种很好的感觉。我很羞愧，让车队公司和现代都知道了，我报了警，他们可能还没有完全意识到犯罪是刚刚发生的，因为他们直到第二天早上才派人过来。(此外，试图解释这辆车属于现代，并穿着数据库中没有显示的制造商牌照，这是一个有趣的挑战。)。\n联网汽车在这个网站上的口碑很差。出于隐私和网络安全的考虑，我们的大多数观众只想在安全漏洞或令人尴尬的黑客攻击的故事中阅读这些内容。自2017年以来，三年免费的现代蓝色链接服务已经成为Ioniqs的标准功能。其中一些功能只是为了方便，比如可以通过智能手机或智能手表远程启动汽车。但Blue Link的许多功能都是以安全或安保为重点的，在发生事故时将您连接到紧急响应中心。而且，如果你的车被偷了，Blue Link可以定位并固定这辆车，这样警方就可以找回它。这就是在这种情况下最终发生的事情-它甚至被发现没有损坏，尽管不幸的是，我不知道它是在哪里找到的更多细节。\n从这次经历中，我学到了很多东西。首先，Ioniq是一款很好的小型混合动力车，每加仑55英里不是什么好东西。其次，我应该确保每辆按键车的钥匙都连接到我的钥匙链上，钥匙链上至少有一个瓷砖定位器信标。第三，我应该感谢这没有发生在一周前，当时这辆车是一辆23.8万美元的迈凯轮，而不是一辆3.1万美元的现代。最后，联网汽车可以有优点，人们应该知道这一点。", "note_en": "It was an email I hoped I&#39;d never have to write. &#34;Hi [Hyundai PR person], I hope you&#39;ve had a pleasant July 4th. I hate to have to write this email but someone has just stolen the Ioniq that you&#39;ve lent us.&#34; Up until that point, my week with the little subcompact hybrid had been wonderful—after all, what&#39;s not to like about 55mpg (4.3L/100km)? But there turns out to be a surprising hero in this story, one reviled by much of the Ars Technica audience: a connected car service saved the day.\n The Ioniq isn&#39;t the newest electrified vehicle in Hyundai&#39;s lineup—in fact, it debuted in 2016 and, in the years since, has been joined by plug-in hybrid EV and battery EV versions. But for some reason or other, this model year 2020 Ioniq was the first time we&#39;ve tested one. The range starts at $23,200 for the most efficient, if most spartanly equipped trim, the Ioniq Blue. But as is the way of the press fleet, ours was a $31,200 Ioniq Limited, loaded with features like adaptive cruise control, LED headlights, a 10.25-inch infotainment system with navigation (and CarPlay and Android Auto), to name but a few.\n The biggest change for this model year was a midlife refresh, with new, more aerodynamic styling and a revised interior. The Ioniq is powered by a 1.6L direct-injection Atkinson-cycle four-cylinder engine that generates 104hp (76kW) and 109lb-ft (148Nm), which works in concert with 43hp (32kW), 125lb-ft (169Nm) permanent-magnet synchronous electric motor which together will send up to 139hp (104kW) to the front wheels via a six-speed dual-clutch transmission. The battery is a 1.56kWh lithium-ion pack, and that helps the Ioniq achieve that combined average of 55mpg, or 58mpg (4.1l/100km) if it&#39;s the Blue trim, thanks to that car&#39;s 15-inch wheels (as opposed to the 17-inch alloys of the Limited).\n The car is well designed for life as a city runabout. It&#39;s easy to get into and see out of, and the ride is good on the broken streets that seem to be an inescapable feature of 21st century life in an American city. The Ioniq is remarkably peppy, too—chalk that up to electric motor which is always ready to send its torque to the wheels.\n  The first hint of the drama to come was at lunchtime on July 5. The Ioniq had been parked for a couple days thanks to the long weekend and the pandemic, and I wanted to pop out and fetch lunch, but for the life of me I couldn&#39;t find the car keys anywhere. An hour spent searching the house and our parking lot came up empty. Feeling a bit foolish, I emailed the company that looks after Hyundai&#39;s press fleet, letting it know the driver should bring the spare key when they came to collect the car on Monday at the end of our week with it.\n At 6pm, I got a concerning email from a neighbor, who alerted me to a young man—probably no more than 14—whom he saw acting suspiciously by the car. I went to check outside, but there was no one to be seen. According to security camera footage, the kid returned 22 minutes later, armed with the keys I could not find. They must have fallen out of my pocket as I brought in some groceries a couple of days earlier, and rather than turning them in, he used them to unlock the car and drive away.\n Let me tell you, having a loaned car stolen is not a great feeling. Mortified, I let the fleet company and Hyundai both know, and I called the police, who perhaps did not quite grasp that the crime had literally just occurred, because they didn&#39;t send anyone over until the following morning. (Also, trying to explain that the car belonged to Hyundai and wore manufacturer plates which did not show up in their database was a fun challenge.)\n  Connected cars get a bad rap on this site. Citing privacy and cybersecurity concerns, most of our audience only want to read about them when it&#39;s the story of a security exploit or embarrassing hack. Since 2017, three years of free Hyundai&#39;s Blue Link service has been a standard feature on Ioniqs. Some of the features are just there for convenience, like being able to remotely start the car via smartphone or smartwatch. But many of Blue Link&#39;s features are safety- or security-focused, connecting you to an emergency response center in the event of an accident. And, in the event your car gets stolen, Blue Link can  locate and immobilize the car so the police can recover it. Which is what ended up happening in this case—it was even found undamaged, although I don&#39;t have any more details on where it was recovered, unfortunately.\n From this experience, I have learned a number of things. First, the Ioniq is a fine little hybrid, and 55mpg is nothing to sniff at. Secondly, I should make sure each press car&#39;s key is attached to my keychain, which at least has a Tile locator beacon on it. Thirdly, I should be grateful this did not happen a week earlier, when the car was a $238,000 McLaren and not a $31,000 Hyundai. And finally, connected cars can have merit, and people should know that.", "posttime": "2020-07-18 04:33:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,ioniq,现代", "title": "2020 Hyundai Ioniq回顾：互联汽车服务拯救了世界", "title_en": "The 2020 Hyundai Ioniq review: A connected car service saves the day", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/the-2020-hyundai-ioniq-review-a-connected-car-service-saves-the-day/", "via": "", "real_tags": ["2020", "ioniq", "现代"]}, {"category": "", "categoryclass": "", "imagename": "918d786d7cfb8cdc85ffde70600dc4c7.jpg", "infoid": 1012616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据区块链分析公司Elliptic的数据，黑客从三个独立的比特币地址的400多笔支付中获得了12.1万美元。\n推特周四表示，我们认为大约有130个账户以某种方式成为攻击者攻击的目标，这是事件的一部分。\n推特周四晚些时候表示，大约130人成为一次网络攻击的目标，该攻击控制了备受瞩目的账户，以推动比特币骗局。\n根据区块链分析公司Elliptic的数据，黑客从三个独立的比特币地址的400多笔支付中获得了12.1万美元。其中大约一半的支付来自美国的加密货币交易所，Elliptic补充道。\n这家社交媒体公司在推特上写道：根据我们目前所知，我们认为大约有130个账户以某种方式成为攻击者攻击的目标，这是事件的一部分。\n对于这些帐户中的一小部分，攻击者能够控制这些帐户，然后从这些帐户发送推文。\n这起发生在周三的黑客攻击泄露了几位商界和政界知名人士的账户。\n特斯拉首席执行官埃隆·马斯克、亚马逊老板杰夫·贝佐斯、微软创始人比尔·盖茨、美国总统候选人乔·拜登和前总统奥巴马都受到了影响，苹果和优步的企业账户也受到了影响。\n可以看到，这些账户在推特上发帖，试图说服人们给他们寄比特币，并承诺汇回双倍的资金作为回报。\n此前，诈骗者曾使用像马斯克这样的人的名字和头像来引诱人们向他们发送加密货币。但在周三，所有涉及的账户都是真实的，属于目标人群。\nFacebook前首席安全官亚历克斯·斯塔莫斯(Alex Stamos)周四告诉CNBC，这些袭击者相当于偷了一辆迈凯轮F1，开着它兜风，4分钟后撞上了电线杆。\nTwitter表示，它认为这次黑客攻击是针对其员工的协同社会工程攻击-换句话说，公司内部人员被骗交出了访问内部系统和工具的权限。\n斯塔莫斯说，对于几乎所有公司来说，最大的风险领域都是内部人的威胁。要运营您的业务，您必须向成千上万的员工提供数据和访问权限。\n周四，Twitter表示，它正在与受影响的账户所有者合作，并将在接下来的几天里继续这样做。\n该公司表示，我们正在继续评估与这些账户相关的非公开数据是否被泄露，如果我们确定发生了这种情况，我们将提供最新情况。\n目前还不清楚黑客在多大程度上控制了他们泄露的个人资料-例如，他们是否获得了访问用户的直接消息和其他敏感信息的权限。然而，该公司表示，没有证据表明攻击者获取了用户的密码，并补充说：目前，我们认为没有必要重置您的密码。", "note_en": "The hackers received $121,000 from over 400 payments to three separate bitcoin addresses, according to blockchain analysis firm Elliptic.\n &#34;We believe approximately 130 accounts were targeted by the attackers in some way as part of the incident,&#34; Twitter said Thursday.\n Twitter said late Thursday that about 130 people were targeted in a cyberattack that took control of high-profile accounts to promote a bitcoin scam.\n The hackers  received $121,000 from over 400 payments to three separate bitcoin addresses, according to blockchain analysis firm Elliptic. Roughly half of those payments were made from U.S.-based cryptocurrency exchanges, Elliptic added.\n  &#34;Based on what we know right now, we believe approximately 130 accounts were targeted by the attackers in some way as part of the incident,&#34; the social media firm tweeted.\n  &#34;For a small subset of these accounts, the attackers were able to gain control of the accounts and then send Tweets from those accounts.&#34;\n The hack,  which took place on Wednesday, compromised the accounts of several prominent figures in business and politics.\n Tesla CEO  Elon Musk,  Amazon boss  Jeff Bezos,  Microsoft founder  Bill Gates, U.S. presidential candidate  Joe Biden and former President  Barack Obama were all affected, as well as the corporate accounts of  Apple and  Uber.\n  The accounts were seen posting tweets trying to persuade people to send them bitcoin, with the promise of sending back double the funds in return.\n  Previously, scammers have used the names and profile pictures of people like Musk to lure people into sending them cryptocurrency. But on Wednesday, all of the accounts involved were genuine and belonged to the people targeted.\n &#34;These attackers were the equivalent of stealing a McLaren F1, taking it for a joyride and then crashing it into a telephone pole 4 minutes later,&#34; Alex Stamos, former chief security officer of Facebook, told CNBC&#39;s &#34; Squawk Box&#34; on Thursday.\n  Twitter said it believes the hack was a &#34;coordinated social engineering attack&#34; on its employees — in other words, insiders at the company were tricked into handing over access to internal systems and tools.\n &#34;The biggest area of risk for almost any company is the insider threat,&#34; said Stamos. &#34;To operate your business, you have to provide data and access to thousands and thousands of employees.&#34;\n  On Thursday, Twitter said it was &#34;working with impacted account owners and will continue to do so over the next several days.&#34;\n &#34;We are continuing to assess whether non-public data related to these accounts was compromised, and will provide updates if we determine that occurred,&#34; the company said.\n It&#39;s not clear how much control the hackers had over the profiles they compromised — for instance, whether they gained access to users&#39; direct messages and other sensitive information. However, the company said there was no evidence the attackers accessed users&#39; passwords, adding: &#34;Currently, we don&#39;t believe resetting your password is necessary.&#34;", "posttime": "2020-07-18 04:32:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,推特,发送,accounts,账户", "title": "推特表示，看起来大约有130个账户在周三的黑客攻击中受到影响，攻击者控制了这些账户的一个子集，并发送了推文", "title_en": "Twitter says it looks like ~130 accounts were affected in Wednesday's hack, and the attackers gained control of and sent tweets from a subset of those accounts", "transed": 1, "url": "https://www.cnbc.com/2020/07/17/twitter-hack-130-people-targeted-in-cyberattack-that-hit-vip-accounts.html", "via": "", "real_tags": ["黑客", "推特", "发送", "accounts", "账户"]}, {"category": "", "categoryclass": "", "imagename": "6dcd9e36a3130084c88b2c8835b140df.jpg", "infoid": 1012615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份新的报告显示，多亏了海量的自动车牌扫描仪数据，美国海关和边境保护局可以追踪全国各地每个人的汽车-而CBP不需要获得一张搜查令就可以做到这一点。取而代之的是，该机构做了数百家其他企业和调查人员所做的事情：直接购买进入商业数据库的权限。\n据TechCrunch报道，自2017年以来，CBP一直在购买商用自动车牌阅读器(ALPR)数据库的访问权，该机构直言不讳地表示，任何美国人都没有真正的方法可以避免自己的行动被追踪。\nCBP在最近的隐私评估(PDF)中写道，CBP无法及时通知从其控制之外的各种来源获得的车牌读数。选择退出这种监视的唯一方法是避开受影响的地区，这可能会带来巨大的困难，而且通常是不切实际的。\n当TechCrunch联系到Matthew Dyman请其置评时，CBP发言人Matthew Dyman告诉该网站，“你怎么能选择不使用车牌阅读器呢？我可以在华盛顿这里选择不使用测速摄像头吗？“。\n另一位发言人告诉副主板，该机构使用商业ALPR数据库来定位和逮捕刑事调查、非法活动或非法进入美国的外国人等任务。\n该网站之前的报道使该网站得出结论，CBP很可能与一家名为Vigilant Solutions的公司签约，但该机构既不证实也不否认副主席的问题，该公司也没有回复副主席的置评请求。\n多亏了美国宪法和数十年的判例法，执法机构可以直接收集哪些数据有规则。例如，最高法院在2018年裁定，警方和其他调查人员需要搜查令才能获得个人的手机位置数据。\n逮捕令程序还允许法院回击执法部门过于宽泛的信息要求。例如，一名法官驳回了司法部2017年试图获取超过130万个IP地址的尝试，这些IP地址访问了一个组织抗议唐纳德·特朗普总统的网站。\n然而，到目前为止，大规模的私人拥有的数据库似乎提供了一个绕过搜查令过程的方便的终局。CBP已经购买了手机位置数据，尽管它在法律上不能直接大范围地收集这些数据。警方还从第三方供应商那里购买被黑客攻击和泄露的数据，然后他们可以使用这些数据来跟踪和识别个人，否则可能需要搜查令。\n尽管全国有数百个司法管辖区使用自动车牌扫描技术，但只有不到20个州的账面上有任何形式的法律来管理ALPR数据的收集、使用和存储。这些法律中更少规定哪些私人实体可以收集ALPR数据，以及可以如何处理这些信息。这款软件似乎也几乎一天比一天更细粒度。\n从理论上讲，CBP只有权在美国边境100英里范围内活动。然而，它购买的数据可能会让它基本上跟踪全国任何地方的任何给定车牌。\nCBP在隐私评估中写道，它可以访问的ALPR数据来自公共和私人来源，包括但不限于私人企业(如停车场)、地方政府(如收费站摄像头)、执法机构和金融机构。\n这项技术本身也在继续传播-不仅传播到企业和私家侦探，还传播到个人消费者。今年1月，一家名为Rekor的公司开始向消费者推销适用于家庭监控的ALPR技术。今年4月，Ars报道了一项泄露的调查，该调查显示亚马逊向一些客户提出了将ALPR集成到Ring安全摄像头中的想法。\nRING现在号称与全国各地的地方执法机构建立了1400多个积极的合作伙伴关系。这些城镇、城市和县的警察可以要求使用Ring监控产品的房主拍摄视频。在像铃声门铃摄像头这样普遍的东西上添加车牌扫描软件，那么数以千计的警察部门也将有可能获得这类数据-无论各州在法律上有什么关于执法使用ALPR的法律。", "note_en": "US Customs and Border Protection can track everyone&#39;s cars all over the country thanks to massive troves of automated license plate scanner data, a new report reveals—and CBP didn&#39;t need to get a single warrant to do it. Instead, the agency did just what hundreds of other businesses and investigators do: straight-up purchase access to commercial databases.\n CBP has been buying access to commercial automated license plate-reader (ALPR) databases since 2017,  TechCrunch reports, and the agency says bluntly that there&#39;s no real way for any American to avoid having their movements tracked.\n &#34;CBP cannot provide timely notice of license plate reads obtained from various sources outside of its control,&#34; the agency wrote in its most recent privacy assessment ( PDF). &#34;The only way to opt out of such surveillance is to avoid the impacted area, which may pose significant hardships and be generally unrealistic.&#34;\n When reached by TechCrunch for comment, CBP spokesperson Matthew Dyman told the site, “How would you be able to opt out of a license plate reader? Can I opt out of speed cameras here in DC?”\n A different spokesperson told  Vice Motherboard that the agency uses commercial ALPR databases for tasks such as &#34;locating and apprehending the subjects of criminal investigations, illicit activity, or aliens who illegally entered the United States.&#34;\n Previous reporting by Vice led the site to conclude that CBP is likely contracting with a company called Vigilant Solutions, but the agency would neither confirm nor deny Vice&#39;s questions, and the company did not return Vice&#39;s requests for comment.\n  Thanks to the US Constitution and decades of case law, there are rules about what data law enforcement agencies can collect directly. For example, the Supreme Court in 2018  ruled that police and other investigators need a search warrant in order to obtain an individual&#39;s mobile phone location data.\n The warrant process also allows courts to push back on overbroad requests for information from law enforcement. A judge  pushed back on the Department of Justice&#39;s  2017 attempt to get records of more than 1.3 million IP addresses that visited a website organizing a protest against President Donald Trump, for example.\n Massive, privately owned databases, however, so far seem to provide a convenient end-run around the warrant process. CBP  already buys cell phone location data, even though it would not legally be able to hoover it up on a wide scale directly. Police  also purchase hacked and breached data from third-party vendors that they can then use to track and identify individuals in ways that otherwise might have required a warrant.\n Although  hundreds of jurisdictions nationwide use automated plate-scanning technology,  fewer than 20 states have laws of any kind on their books governing the collection, use, and storage of ALPR data. Even fewer of those laws specify what private entities can collect ALPR data and what can be done with that information. The software also seems to become  more granular almost by the day.\n Theoretically, CBP only has authority to operate  within 100 miles of the US border. The data it purchases, however, may allow it to track any given license plate basically anywhere in the country.\n  CBP writes in the privacy assessment that the ALPR data to which it has access comes from &#34;both public and private sources,&#34; including but not limited to &#34;private businesses (e.g., parking garages), local governments (e.g., toll booth cameras), law enforcement agencies, and financial institutions.&#34;\n The technology itself continues to spread—not just to businesses and  private investigators, but also to individual consumers. A company called Rekor  began marketing ALPR technology, adapted for home-surveillance use, to consumers in January of this year. In April,  Ars reported on a leaked survey that showed Amazon floating the idea of ALPR integration into Ring security cameras to some of its customers.\n Ring now boasts  more than 1,400 active partnerships with local law enforcement agencies all over the country. Police in those towns, cities, and counties are able to request footage from homeowners who use Ring surveillance products. The addition of plate-scanning software to something as widespread as Ring doorbell cameras would then give thousands of police departments potential access to that kind of data as well—regardless of what laws states have on the books about law enforcement use of ALPR.", "posttime": "2020-07-18 04:09:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "车牌,run,数据", "title": "CBP确实结束了搜查证，只是简单地购买车牌阅读器数据", "title_en": "CBP does end run around warrants, simply buys license plate-reader data", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/cbp-does-end-run-around-warrants-simply-buys-license-plate-reader-data/", "via": "", "real_tags": ["车牌", "run", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当谈到以高效和负担得起的方式确保司法公正时，律师实际上可能是主要的障碍。…。即使是中小型公司的基本法律服务，每小时的费用也可能超过200美元，这使得有意义的法律代理超出了许多美国人的承受能力。…。为什么选择…。法律教育费用和行会式的职业准入限制…。法律程序日益复杂，…。选择代表自己是…。正在崛起的…。(但这让一个人处于严重的劣势)。…。律师助理、公证员、社会工作者和其他受过相关培训的人没有理由不[帮助]。…。廉价的、可下载的表格，用于涵盖基本的法律事务，如生前遗嘱或公司章程。…。计算机辅助调解…。他们更激进的建议是重组制度，以便许多程序都是专门为省略律师而设计的。…。这些改革的最大障碍很可能来自法律专业本身。\n在许多情况下，更多律师的存在实际上降低了实现正义的速度和效率。…。很少有人意识到，宪法没有明确确立法院对一般法律解释拥有最终决定权这一长期接受的理解。…。州法院只是声称他们对法律系统的管理拥有“固有的权力”。根据这一观点，作为“法院官员”的律师的管理规则和法律实践在理论上是“不受立法逆转或侵犯”的。…。[律师]受益于几乎从不会导致处罚或开除的秘密纪律程序，以及对“未经授权的法律实践”…的积极监管。“重新启动司法”中记录的最有力的创新似乎是从非律师的创造性思维中涌现出来的。\n我发现的每一篇评论都是正面的。然而，这本书在亚马逊只得到了6条评论(全是5星)，在Goodreads只有2条。我当时买了这本书，但现在才刚看完。因此，这本书远不是一本引人入胜的书，显然也没有卖出多少册。但我看到的所有评论都认为这基本上是正确的：\n很难反驳这本书中的大多数论点：目前的法律制度是建立在诉讼当事人拥有相对平等的法律代表的假设之上的；然而，在现代，这往往是一个无法满足的假设。(更多信息)。\n目前还远不清楚是法律服务的高昂成本-由所谓的过度监管推动-阻止了美国人获得法律援助。…最近的一项研究。调查发现，费用解释了为什么在不到五分之一的民事司法情况下不寻求法律援助的决定。…。在几个州，人们不需要上美国律师协会认可的法学院就可以成为一名律师；有些州根本不需要上实体法学院。…。自2007年以来，英国开始允许被称为另类业务结构(ABS)的公司拥有律师事务所并提供法律服务。…。没有导致法律体系的崩溃。但是…。对诉诸司法也没有明显影响。\n这可能是对的。但没有任何评论质疑这本书最激进的建议：改用审判式法律制度，在这种制度下，法官掌握主动权。从书中：\n我们可以借鉴美国的行政法法官制度，也可以借鉴欧洲法院的做法。我们可以采用审判制，由法院工作人员积极调查事实，调查证据，而不是依靠当事人的律师。这种方法可以打破分散注意力的程序性游戏，专注于案件核心的事实和问题。尽管研讯审判听起来像是异国移植，但美国行政机构已经使用类似的方法来裁决失业和社会保障残疾索赔，小额索赔法院也是如此。…。*世界上大多数法院，包括欧洲大陆几乎所有的法院以及亚洲、南美和非洲的大多数法院，都采用审讯制度。\n这一制度不仅在世界大部分地区使用，在美国行政法中，在我们的小额诉讼法庭中，它也是古代社会的主要法律制度，今天大多数非政府的纠纷解决系统都在使用，如在教堂、学校、公司和家庭中。这一制度通常与较少基于先例、更多以文本为基础的制度配对，以决定法律规则。\n我们盎格鲁社会经常被告知，我们不同的、更具对抗性和基于先例的制度更优越，因为它更少允许腐败的法官。但正如书上所说，\n(在基于先例的法律体系中)例外和平衡测试为法官提供了极大的自由裁量权，可以调整法律以得出几乎任何一组事实。它们还在系统中制造了大量的不确定性。\n如果主要问题是腐败的法官，我们很容易在这方面花更多的钱。例如，允许诱捕并付钱给许多人试图贿赂法官。使10%的法庭案件成为旨在考验法官的假案件。通常让几名法官独立审查同一案件，并比较法官的裁决统计数据。全职监控法官活动。给那些证明腐败的人十亿美元的赏金。对有罪的人判处死刑。\n今天，大多数人根本负担不起利用法院起诉的费用，如果被指控犯罪，他们必须大多像有罪一样和解，即使他们是无辜的，这一切都是因为现在的制度贵得离谱。(过去不是这样的。)。审判法官将改变这一点，并让大多数人有意义地利用法律系统为自己辩护。\n顺便说一句，要求法律责任保险将是确保双方有平等机会获得有效律师支持的另一种方式。\n我们需要简化民事司法本身，使用技术来围绕诉讼当事人而不是律师进行建设。\n在这个国家存在的第一个世纪里，有文化的公民可以在法庭上有效地为自己辩护。\n当前制度的一个值得注意的方面是，从逮捕到审判再到监狱，刑事司法的每一个部分都受到了严格的监管，辩诉交易除外。\n据我们所知，在随机审判中，一些刑事被告得到了律师，而另一些则没有。…。我们所知不多的情况表明，在实践中，(自卫的)诉讼当事人的情况与那些有指定律师的诉讼当事人一样好。\n[研究]非律师倡导者是否可以在四个行政法环境中与律师一样有效：失业保险上诉、税务上诉、残疾上诉和劳动仲裁。总体而言，非律师的表现与律师一样好，而且比在特定法庭没有经验的律师更好。\n对失业上诉的研究发现，唯一在统计上有意义的影响是，律师使案件的审理时间延长了约40%。\n然而，实证研究更多的是喜忧参半，一些研究表明调解比传统法院效果更好，而另一些研究则几乎没有改善。\n直到19世纪，大多数律师都是通过“读法律”成为律师的，也就是说，作为现有律师的学徒学习。事实上，有些人，比如亚伯拉罕·林肯，自己读法律，不向任何人当学徒，学习经典的法律书籍。\n许多其他国家允许律师助理、社会工作者和公证员处理日常的法律交易，无论是在法庭内还是在法庭外都是如此。", "note_en": "When it comes to securing justice in an efficient and affordable fashion, lawyers can in fact be the primary obstacle. … Even basic legal services at small or mid-size firms may cost more than $200 an hour, placing meaningful legal representation beyond the reach of many Americans. … Why … costs of legal education and guildlike restrictions on entry to the profession … increasing complexity of legal processes, … choosing to represent oneself is … on the rise … [but puts one] at a severe disadvantage. … There’s no reason that paralegals, notaries, social workers and others with relevant training could not [help]. … inexpensive, downloadable forms to cover basic legal matters, like living wills or articles of incorporation. … computer-assisted mediation … Their more radical suggestion is to restructure the system so that many processes are specifically designed to omit lawyers. … The biggest obstacle to such reforms could well come from the legal profession itself.\n  In many contexts the presence of more lawyers actually reduces the speed and effectiveness of achieving justice. … Few realize that the long-accepted understanding that courts have the final say on the interpretation of laws in general is not explicitly established by the Constitution. … State courts have simply asserted that they have “inherent authority” over the administration of the legal system. Under this view, rules governing lawyers, as “officers of the court,” and the practice of law in theory are “not subject to legislative reversal or encroachment.” … [Lawyers] benefit from a secretive disciplinary process that almost never results in penalties or expulsion, combined with aggressive policing of the “unauthorized practice of law” … The most powerful innovations documented in “Rebooting Justice” appear to have sprung from the creative minds of nonlawyers.\n Every review I’ve found has been positive. Yet the book only got 6 reviews at Amazon (all 5 star), and only 2 at Goodreads. I bought the book back then, but only now just finished it. So the book is far from a page turner, and obviously didn’t sell many copies. But all reviews I’ve seen say it is basically right:\n It is hard to argue with most of the arguments in this book: the present legal system is predicated on the assumption of litigants with relatively equal legal representation; however, in the modern age, this is all too frequently an unmet assumption. ( more)\n  It is far from clear that it is the high cost of legal services—driven by alleged overregulation—that is preventing Americans from obtaining legal assistance. A recent study … found that cost explains the decision to not seek legal assistance in less than a fifth of civil justice situations. … In several states, one can become a lawyer without attending an ABA-accredited law school; some do not require attending a brick-and-mortar law school at all. … The United Kingdom began allowing corporations, known as alternative business structures (ABS), to own law firms and offer legal services since 2007. … not led to the collapse of the legal system. But … also not had an appreciable effect on access to justice.\n Which is probably right. But no review disputed the book’s most radical suggestion: switch to an  inquisitorial legal system, wherein judges take the initiative. From the book:\n We can learn from the American system of administrative law judges and from European courts. We can adapt the inquisitorial system, in which court officials actively investigate the facts and probe the evidence instead of relying on the parties’ lawyers. That approach can cut through distracting procedural games to focus on the facts and issues at the heart of a case. Though inquisitorial judging sounds like an exotic foreign transplant, American administrative agencies already use similar methods to adjudicate unemployment and Social Security disability claims, and so do small claims courts. … Most courts in the world, including virtually all of the courts in continental Europe and most of the courts in Asia, South America, and Africa, run on an inquisitorial system.\n This system is not only used in most of the world, in US administrative law, and in our small claims courts, it was also the main legal system in ancient societies, and it is used today by most non-government dispute-resolution systems, such as in churches, schools, firms, and families. This system is usually paired with a less precedent-based and more text-based system for deciding are the legal rules.\n We in Anglo societies are often told that our different more adversarial and precedent-based system is superior, because it less allows corrupt judges. But as the book says,\n [In a precedent based legal system] exceptions and balancing tests offer judges great discretion to adjust the law to reach almost any set of facts. They also create a massive amount of uncertainty in the system.\n And if the main issue were corrupt judges, we could easily spend far more on that. For example, allow entrapment and pay many to try to bribe judges. Make 10% of court cases be fake cases designed to test judges. Often have several judges review the same case independently, and compare judge ruling stats. Monitor judge activities full time. Billion dollar bounties to those who prove corruption. Death penalties for the guilty.\n Today most people simply can’t afford to use the courts to sue, and if accused of a crime they must mostly settle as if guilty, even if they are innocent, all because the system is now crazy expensive. (It didn’t use to be.) Inquisitorial judges would change that, and give most people meaningful access to a legal system to defend themselves.\n By the way,  requiring  legal liability insurance would be another way to make sure both sides have equal access to effective lawyer support.\n  We need to simplify civil justice itself, using technology to build around pro se litigants rather than lawyers.\n For the first century of this country’s existence, a literate citizen could represent himself in court effectively.\n One remarkable aspect of the current system is how heavily regulated every part of criminal justice is from arrest to trial to jail, except for plea bargaining.\n We are aware of no randomized trials in which some criminal defendants were offered or given counsel while others were not. … what little we know suggests that, in practice, [self-defending] litigants fare about as well as those with appointed counsel.\n [A study of] whether nonlawyer advocates could be as effective as lawyers in four administrative law settings: unemployment insurance appeals, tax appeals, disability appeals, and labor arbitration. On the whole, nonlawyers did as well as lawyers, and better than lawyers who did not have experience in the particular tribunal.\n The only statistically significant effect found by the study of unemployment appeals was that lawyers made cases take about 40% longer.\n The empirical studies are more of a mixed bag, however, with some studies showing mediation working better than traditional court and others showing little improvement.\n Well into the nineteenth century, most lawyers became lawyers by “reading law”—that is, learning as an apprentice to an existing lawyer. Indeed, some, like Abraham Lincoln, read law on their own, studying classic legal books without apprenticing to anyone else.\n Many other countries let paralegals, social workers, and notaries handle routine legal transactions, both in and especially out of court.", "posttime": "2020-07-18 04:08:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "重新启动,rebooting,法律", "title": "重新启动正义", "title_en": "Rebooting Justice", "transed": 1, "url": "http://www.overcomingbias.com/2019/04/rebootingjustice.html", "via": "", "real_tags": ["重新启动", "rebooting", "法律"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IEEE Xplore，提供对世界上最高质量的工程技术文献的全文访问。|IEEE Xplore", "note_en": "IEEE Xplore, delivering full text access to the world's highest quality technical literature in engineering and technology. | IEEE Xplore", "posttime": "2020-07-18 04:08:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,中心化,decentralized,提供", "title": "分布式去中心化域名服务", "title_en": "Distributed Decentralized Domain Name Service", "transed": 1, "url": "https://ieeexplore.ieee.org/document/7530014/authors#authors", "via": "", "real_tags": ["域名", "中心化", "提供"]}, {"category": "", "categoryclass": "", "imagename": "a9789b0ac9defd1b0c3dd923b601060e.jpg", "infoid": 1012611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据一名州卫生官员称，佛罗里达州新冠肺炎的死亡人数中增加了一名死于摩托车事故的人。\n福克斯35新闻在询问奥兰治县卫生官员劳尔·皮诺博士两名20多岁的冠状病毒患者是否患有任何潜在疾病后发现了这一点。他的一个答案让我们大吃一惊。\n“第一个没有。他死于一场摩托车事故。“皮诺说。\n“我不这么认为。我得再检查一遍。“皮诺说。“我们在与国家争辩、讨论或试图争辩。不是因为数字--是100…。如果是99也没什么不同--但是这个人不是死于新冠肺炎…这一事实。死于车祸。但你实际上可以争辩说，可能是新冠肺炎导致了他的坠毁。我不知道那一次的结论是什么。“。\n在奥兰治县的冠状病毒死亡数据名单上，仍有两名20多岁的人。\n这是否与该州所说的统计死亡人数相矛盾？\n本周早些时候，佛罗里达州卫生部向福克斯35新闻频道发送了一份声明，试图澄清COVID死亡是否被确定为COVID19被列为直接或潜在的死因，或者被列为导致死亡的重要条件之一。或者，如果实验室检测证实新冠肺炎感染--死因不符合排除标准--如外伤、自杀、他杀、服药过量、机动车事故等；\n“我能对大家说的唯一一件事就是我提供给你们的数据，就是我们从州里消费的数据。我们为您提供我们所拥有的最好的数据，“皮诺博士说。\n皮诺医生告诉我们，法医必须证明所有新冠肺炎的死亡。我们也联系了那个办公室，但没有得到回复。", "note_en": "A person who died in a motorcycle accident was added to Florida’s COVID-19 death count, according to a state health official.\n  FOX 35 News found this out after asking Orange County Health Officer Dr. Raul Pino whether two coronavirus victims who were in their 20s had any underlying conditions. One of his answers surprised us.\n      “The first one didn’t have any. He died in a motorcycle accident,” Pino said.\n       “I don’t think so. I have to double-check,” Pino said. “We were arguing, discussing, or trying to argue with the state. Not because of the numbers -- it’s 100…it doesn’t make any difference if it&#39;s 99 -- but the fact that the individual didn’t die from COVID-19…died in the crash. But you could actually argue that it could have been the COVID-19 that caused him to crash. I don’t know the conclusion of that one.”\n    There are still two people in their 20s on Orange County’s data list for coronavirus deaths.\n  So is this a contradiction to how the state says it’s counting deaths?\n  Earlier this week, the Florida Department of Health sent FOX 35 News a statement that attempted to clarify that a &#34;COVID death&#34; is determined if, &#34;COVID19 is listed as the immediate or underlying cause of death, or listed as one of the significant conditions contributing to death. Or, if there is a confirmed COVID-19 infection from a lab test – and the cause of death doesn’t meet exclusion criteria – like trauma, suicide, homicide, overdose, motor-vehicle accident, etc.&#34;\n “The only thing that I can say to people is the data I provide you with is the data we consume from the state. We offer you the best data that we have,” Dr. Pino said.\n Dr. Pino tells us the medical examiner has to certify all COVID-19 deaths. We also reached out to that office and haven’t heard back.", "posttime": "2020-07-18 04:07:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摩托车,motorcycle,死亡", "title": "致命摩托车相撞被列为新冠肺炎死亡", "title_en": "Fatal motorcycle crash listed as Covid-19 death", "transed": 1, "url": "https://www.fox35orlando.com/news/fox-35-investigates-questions-raised-after-fatal-motorcycle-crash-listed-as-covid-19-death", "via": "", "real_tags": ["摩托车", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。访问数/每百万人：Reach of Networking Problem[RFC 8557，DOI 10.17487/RFC8557,2019年5月1-5月份][Definistic Networking Problem Statement&#34；，RFC8557，DOI 10.17487/RFC8557,2019年5月。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。[RFC8578]Grossman，E.，Ed.，#34；确定性网络使用案例#34；，RFC8578，DOI 10.17487/RFC8578,2019年5月。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。[RFC8754]Filsfils，C.，Ed.，Dukes，D.，Ed.，Previdi，S.，Leddy，J.，Matsushima，S.，and D.Voyer，&#34；IPV6段路由头部(SRH)&#34；，RFC8754，DOI 10.17487/RFC8754,2020年3月，.。局域网和城域网的IEEE标准-网桥和桥接网络#34；，DOI 10.1109/IEEESTD.2018.8403927，IEEE802.1Q-2018年7月。[SRV6-NETWORK]Filsfils，C.，Camarillo，P.，Leddy，J.，Voyer，D.，Matsushima，S.，and Z.Li，&#34；SRv6 Network Programming&#34；Work in Progress，Internet-Draft，Draft-IETF-Spring-srv6-network-Programming-16,2020年6月27日。[User-Plane-Protocol]Homma，S.，Miyasaka，T.，Matsushima，S.，and D.Voyer，&#34；User Plane Protocol and Architecture Analysis on 3GPP 5G System&#34；，Work in Progress，Internet-Draft，Draft-IETF-DMM-5G-uplan-Analysis-03,2019年11月3日，附录A。在此分类中考虑了几个主要方面：*域作为一个整体*单个节点*域边界*域的拓扑*域的技术*域如何连接到Internet*安全、信任和隐私模型*操作以下小节分析这些方面的每一个方面。a.1.在此分类中考虑了几个主要方面：*域作为一个整体*单个节点*域边界*域的拓扑结构*域的技术*域如何连接到Internet*安全、信任和隐私模型*操作以下小节分析这些方面中的每一个。a.。域作为一个整体*为什么域会存在？(例如，人工选择、管理策略、编排要求、伸缩原因的操作分区等技术要求)*如果有特殊要求，是在第二层、第三层还是上层？*域在完全由人管理和完全自主之间处于什么位置？*如果是管理的，采用哪种管理方式？(手动配置、自动配置、编排？)*是否有策略模型？(意图、配置策略？)*域名是否提供受控或付费服务或开放访问？a.。单个节点*域成员是完整的节点还是节点的一个接口？*节点是给定域的永久成员，还是可以进行加入和离开操作？*节点是物理设备还是虚拟设备？*虚拟节点是通用的还是仅限于特定功能、应用程序或用户？*节点是否受到限制(受电池等限制)？*设备是现成安装的还是预先配置的？A.3.。域边界*域边界是如何识别或定义的？*域边界是固定的还是动态的？*边界节点是特殊的，还是任何节点都可以在边界上？A.4.。拓扑*该域是第2层还是第3层连通域的子集？*该域是否与其他域重叠？(换句话说，是否允许一个节点成为多个域的成员？)*该域是否与物理拓扑匹配，或者它是否具有虚拟(重叠)拓扑？*该域是否位于单个建筑、车辆或园区内？或者它是分布式的吗？*如果是分布式的，互连是私有的还是通过Internet的？*在IP寻址术语中，域链路是本地的、站点本地的还是全局的？*IP单播或组播地址的范围是否映射到域边界？A.5.。技术*使用什么路由协议或不同的转发机制(MPLS或其他非IP机制)？*在覆盖域中，使用什么覆盖技术(L2VPN、L3VPN等)？*是否有特定的QoS要求？*链路延迟-正常或长延迟链路？*移动性-节点是否可移动？整个网络是移动的吗？*哪些具体技术，如第4节中的技术，适用？A.6.。互联网连接*互联网连接是永久性的还是间歇性的？(从未连接的流量不在范围内。)*哪些流量被阻塞，进出？*允许哪些流量进出？*传输的是什么流量", "note_en": ". [RFC8402] Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L., Decraene, B., Litkowski, S., and R. Shakir, &#34;Segment Routing Architecture&#34;, RFC 8402, DOI 10.17487/RFC8402, July 2018,  . [RFC8445] Keranen, A., Holmberg, C., and J. Rosenberg, &#34;Interactive Connectivity Establishment (ICE): A Protocol for Network Address Translator (NAT) Traversal&#34;, RFC 8445, DOI 10.17487/RFC8445, July 2018,  . [RFC8517] Dolson, D., Ed., Snellman, J., Boucadair, M., Ed., and C. Jacquenet, &#34;An Inventory of Transport-Centric Functions Provided by Middleboxes: An Operator Perspective&#34;, RFC 8517, DOI 10.17487/RFC8517, February 2019,  . [RFC8557] Finn, N. and P. Thubert, &#34;Deterministic Networking Problem Statement&#34;, RFC 8557, DOI 10.17487/RFC8557, May 2019,  . [RFC8568] Bernardos, CJ., Rahman, A., Zuniga, JC., Contreras, LM., Aranda, P., and P. Lynch, &#34;Network Virtualization Research Challenges&#34;, RFC 8568, DOI 10.17487/RFC8568, April 2019,  . [RFC8578] Grossman, E., Ed., &#34;Deterministic Networking Use Cases&#34;, RFC 8578, DOI 10.17487/RFC8578, May 2019,  . [RFC8655] Finn, N., Thubert, P., Varga, B., and J. Farkas, &#34;Deterministic Networking Architecture&#34;, RFC 8655, DOI 10.17487/RFC8655, October 2019,  . [RFC8754] Filsfils, C., Ed., Dukes, D., Ed., Previdi, S., Leddy, J., Matsushima, S., and D. Voyer, &#34;IPv6 Segment Routing Header (SRH)&#34;, RFC 8754, DOI 10.17487/RFC8754, March 2020,  . [SPB] &#34;IEEE Standard for Local and metropolitan area networks - Bridges and Bridged Networks&#34;, DOI 10.1109/IEEESTD.2018.8403927, IEEE 802.1Q-2018, July 2018,  . [SRV6-NETWORK] Filsfils, C., Camarillo, P., Leddy, J., Voyer, D., Matsushima, S., and Z. Li, &#34;SRv6 Network Programming&#34;, Work in Progress, Internet-Draft, draft-ietf-spring-srv6- network-programming-16, 27 June 2020,  . [USER-PLANE-PROTOCOL] Homma, S., Miyasaka, T., Matsushima, S., and D. Voyer, &#34;User Plane Protocol and Architectural Analysis on 3GPP 5G System&#34;, Work in Progress, Internet-Draft, draft-ietf-dmm- 5g-uplane-analysis-03, 3 November 2019,  .Appendix A. Taxonomy of Limited Domains This appendix develops a taxonomy for describing limited domains. Several major aspects are considered in this taxonomy: * The domain as a whole * The individual nodes * The domain boundary * The domain&#39;s topology * The domain&#39;s technology * How the domain connects to the Internet * The security, trust, and privacy model * Operations The following sub-sections analyze each of these aspects.A.1. Domain as a Whole * Why does the domain exist? (e.g., human choice, administrative policy, orchestration requirements, technical requirements such as operational partitioning for scaling reasons) * If there are special requirements, are they at Layer 2, Layer 3, or an upper layer? * Where does the domain lie on the spectrum between completely managed by humans and completely autonomic? * If managed, what style of management applies? (Manual configuration, automated configuration, orchestration?) * Is there a policy model? (Intent, configuration policies?) * Does the domain provide controlled or paid service or open access?A.2. Individual Nodes * Is a domain member a complete node or only one interface of a node? * Are nodes permanent members of a given domain, or are join and leave operations possible? * Are nodes physical or virtual devices? * Are virtual nodes general purpose or limited to specific functions, applications, or users? * Are nodes constrained (by battery, etc.)? * Are devices installed &#34;out of the box&#34; or pre-configured?A.3. Domain Boundary * How is the domain boundary identified or defined? * Is the domain boundary fixed or dynamic? * Are boundary nodes special, or can any node be at the boundary?A.4. Topology * Is the domain a subset of a Layer 2 or 3 connectivity domain? * Does the domain overlap other domains? (In other words, is a node allowed to be a member of multiple domains?) * Does the domain match physical topology, or does it have a virtual (overlay) topology? * Is the domain in a single building, vehicle, or campus? Or is it distributed? * If distributed, are the interconnections private or over the Internet? * In IP addressing terms, is the domain Link local, Site local, or Global? * Does the scope of IP unicast or multicast addresses map to the domain boundary?A.5. Technology * What routing protocol(s) or different forwarding mechanisms (MPLS or other non-IP mechanism) are used? * In an overlay domain, what overlay technique is used (L2VPN, L3VPN, etc.)? * Are there specific QoS requirements? * Link latency - Normal or long latency links? * Mobility - Are nodes mobile? Is the whole network mobile? * Which specific technologies, such as those in Section 4, are applicable?A.6. Connection to the Internet * Is the Internet connection permanent or intermittent? (Never connected is out of scope.) * What traffic is blocked, in and out? * What traffic is allowed, in and out? * What traffic is transformed, in and out? * Is secure and privileged remote access needed? * Does the domain allow unprivileged remote sessions?A.7. Security, Trust, and Privacy Model * Must domain members be authorized? * Are all nodes in the domain at the same trust level? * Is traffic authenticated? * Is traffic encrypted? * What is hidden from the outside?A.8. Operations * Safety level - Does the domain have a critical (human) safety role? * Reliability requirement - Normal or 99.999%? * Environment - Hazardous conditions? * Installation - Are specialists needed? * Service visits - Easy, difficult, or impossible? * Software/firmware updates - Possible or impossible?A.9. Making Use of This Taxonomy This taxonomy could be used to design or analyze a specific type of limited domain. For the present document, it is intended only to form a background to the scope of protocols used in limited domains and the mechanisms required to securely define domain membership and properties.Acknowledgements Useful comments were received from Amelia Andersdotter, Edward Birrane, David Black, Ron Bonica, Mohamed Boucadair, Tim Chown, Darren Dukes, Donald Eastlake, Adrian Farrel, Tom Herbert, Ben Kaduk, John Klensin, Mirja Kuehlewind, Warren Kumari, Andy Malis, Michael Richardson, Mark Smith, Rick Taylor, Niels ten Oever, and others.Contributors Sheng Jiang Huawei Technologies Q14, Huawei Campus No. 156 Beiqing Road Hai-Dian District, Beijing 100095 China Email: jiangsheng@huawei.comAuthors&#39; Addresses Brian Carpenter The University of Auckland School of Computer Science University of Auckland PB 92019 Auckland 1142 New Zealand Email: brian.e.carpenter@gmail.com Bing Liu Huawei Technologies Q14, Huawei Campus No. 156 Beiqing Road Hai-Dian District, Beijing 100095 China Email: leo.liubing@huawei.com", "posttime": "2020-07-18 03:47:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "的域,domains,是否", "title": "RFC 8799：有限的域和互联网协议", "title_en": "RFC 8799: Limited Domains and Internet Protocols", "transed": 1, "url": "https://www.rfc-editor.org/rfc/rfc8799.txt", "via": "", "real_tags": ["的域", "domains", "是否"]}, {"category": "", "categoryclass": "", "imagename": "3d312c4d9b797e77184fd22823843e60.jpg", "infoid": 1012609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于许多80年代的孩子来说，你童年的很大一部分时间可能是坐在离电视太近的地方，抓着一把塑料安全锥色手枪，在“猎鸭记”(Duck Hunt)中把水鸟从虚幻的天空中炸出来(还有，当那只狗嘲笑你时，你试图把它的头打下来)。猎鸭枪的官方名称是任天堂娱乐系统(NES)Zapper，与任天堂的Wii和微软的Kinect相比，它看起来非常原始，但在80年代末，它让很多年轻人充满了好奇。那东西是怎么工作的？\nZapper的祖先可以追溯到20世纪30年代中期，当时第一支所谓的“光枪”出现在光敏真空管的发展之后。在第一款光枪游戏Ray-O-Lite(1936年由Seeburg公司开发，该公司为自动点唱机制造零部件和系统)中，玩家使用发射光束的枪向安装有光传感器的小型移动目标射击。当光束击中传感器时，目标(巧合的是鸭子)记录了“击中”，并得了一分。\n1972年，轻炮用马格诺克斯奥德赛号上的射击馆击中了家用视频游戏机。因为随附的猎枪式光枪只能在Magnvox电视上使用，所以游戏失败了。任天堂娱乐系统(NES)Zapper随后在1985年10月落入美国儿童手中，当时它与NES、一个控制器和几个游戏捆绑发布。早期版本的外围设备是深灰色的，但几年后，受科幻射线枪启发的zapper的颜色发生了变化，当时一项联邦法规要求玩具和仿制枪支必须是橙色的(确切地说，颜色是#12199)，这样它们就不会被误认为是正品。\n虽然有许多为NES发布的与Zapper兼容的游戏(当我还是个孩子的时候，我父亲在家工作，我们花了很多下午玩Hogan‘s Alley)，但大多数游戏都生活在标志性的猎鸭游戏(Duck Hunt)的阴影下，这是最知名和最受欢迎的Zapper游戏。\n虽然像Ray-O-Lite步枪这样的老式光枪会发出光束，但Zapper和其他许多新款光枪的工作原理是通过枪管上或枪管中的光电二极管接收光线，并利用这些光来计算出你在电视屏幕上瞄准的位置。\n当你指着一只鸭子并扣动扳机时，NES中的计算机会熄灭屏幕，而NES Zapper二极管开始接收。然后，电脑会在你应该射击的目标周围闪现一个纯白的方块。Zapper中的光电二极管检测光线强度的变化，并告诉计算机它指向的是一个被照亮的目标块-换句话说，你应该得到一个点，因为你击中了一个目标。如果有多个目标，则在每个潜在目标周围绘制白块，一次一个。二极管对光的接收，结合绘制目标的顺序，让电脑知道你击中了一个目标，是哪个目标。当然，当你玩游戏时，你不会注意到停电和目标闪烁，因为这一切都发生在不到一秒钟的时间里。\n这种目标闪烁的方法帮助任天堂克服了老式光枪游戏的一个弱点：作弊者通过将枪对准稳定的光源(如灯)，并将第一个目标直接击中大门外，从而获得高分。\n如果你渴望了解更多的技术深度，可以看看任天堂1989年的Zapper技术专利", "note_en": "For many children of the &#39;80s, a good portion of your childhood probably revolved around sitting too close to the TV, clutching a plastic safety cone-colored hand gun and blasting waterfowl out of a pixilated sky in  Duck Hunt (also, trying to blow that dog’s head off when he laughed at you). The  Duck Hunt gun, officially called the Nintendo Entertainment System (NES) Zapper, seems downright primitive next to the Nintendo’s Wii and Microsoft’s Kinect, but in the late 80s, it filled plenty of young heads with wonder. How did that thing work?\n  The Zapper’s ancestry goes back to the mid 1930s, when the first so-called “light guns” appeared after the development of light-sensing vacuum tubes. In the first light gun game,  Ray-O-Lite (developed in 1936 by Seeburg, a company that made parts and systems for jukeboxes), players shot at small moving targets mounted with light sensors using a gun that emitted a beam of light. When the beam struck a sensor, the targets – ducks, coincidentally – registered the “hit” and a point was scored.\n Light guns hit home video game consoles with  Shooting Gallery on the Magnavox Odyssey in 1972. Because the included shotgun-style light gun was only usable on a Magnavox television, the game flopped. The Nintendo Entertainment System (NES) Zapper then fell into the hands of American kids in October 1985, when it was released in a bundle with the NES, a controller and a few games. Early versions of the peripheral were dark gray, but the color of the sci-fi ray gun-inspired Zapper was changed a few years later when a federal regulation required that toy and imitation firearms be “blaze orange” (color #12199, to be exact) so they wouldn’t be mistaken for the real deal.\n While there were a number of Zapper-compatible games released for the NES (when I was a kid and my dad worked from home, we wasted plenty of afternoons away playing  Hogan’s Alley), most lived in the shadow of the iconic  Duck Hunt, the most recognizable and popular Zapper game.\n  While older light guns like the Ray-O-Lite rifle emitted beams of light, the Zapper and many other recent light guns work by receiving light through a photodiode on or in the barrel and using that light to figure out where on the TV screen you&#39;re aiming.\n When you point at a duck and pull the trigger, the computer in the NES blacks out the screen and the Zapper diode begins reception. Then, the computer flashes a solid white block around the targets you’re supposed to be shooting at. The photodiode in the Zapper detects the change in light intensity and tells the computer that it’s pointed at a lit target block — in others words, you should get a point because you hit a target. In the event of multiple targets, a white block is drawn around each potential target one at a time. The diode’s reception of light combined with the sequence of the drawing of the targets lets the computer know that you hit a target and which one it was. Of course, when you’re playing the game, you don’t notice the blackout and the targets flashing because it all happens in a fraction of a second.\n This target flashing method helped Nintendo overcome a weakness of older light gun games: cheaters racking up high scores by pointing the gun at a steady light source, like a lamp, and hitting the first target right out of the gate.\n If you’re hungry for a more technical depth, check out Nintendo&#39;s 1989  patent on the Zapper technology", "posttime": "2020-07-18 03:46:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hunt,zapper", "title": "猎鸭枪是怎么工作的？(2011)", "title_en": "How Did the Duck Hunt Gun Work? (2011)", "transed": 1, "url": "https://www.mentalfloss.com/article/26875/how-did-duck-hunt-gun-work", "via": "", "real_tags": ["hunt", "zapper"]}, {"category": "", "categoryclass": "", "imagename": "f4ad75ae995142eaf5b33166d88a0d0b.jpg", "infoid": 1012608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitch进行了干预，以阻止美军在其esports频道上使用虚假的奖品赠品，将观众重定向到征兵页面。\n这一做法是由“国家”的一份报告揭露的，该报告称美国军方将体育运动作为一种招募工具。美国陆军、海军和空军都是由现役和预备役人员组成的野战运动队，他们在Twitch上播放流媒体，与年轻观众谈论生活、视频游戏和服兵役提供的机会。\n“电子竞技只是一个开始对话的途径，”陆军征兵司令部司令弗兰克·穆斯少将(Frank Muth)最近告诉夏威夷ThinkTech。“我们走出赛场，我们对体育运动有着共同的热情……。它自然会演变成一场对话，‘你是做什么的？’，‘我在军队里。’“。\n“此促销活动不符合我们的条款，我们已要求他们将其删除。”\n这一推广活动包括自动链接投放到军队的流媒体聊天中，告诉观众他们可以在“赠品”中赢得一个Xbox Elite Series 2控制器。但“国家报”说，当任何人点击链接时，他们会被引导到“一个招聘表格，上面没有额外提到比赛、赔率、获奖总数或抽奖时间。”\n观众、流媒体和游戏开发商对这一消息做出了愤怒的反应，称任何其他频道都将因此类行为而面临后果。根据Kotaku的一份报告，Twitch本身现在显然已经迫使军队停止这些赠品。\n“根据我们的服务条款，Twitch上的促销必须遵守所有适用的法律，”流媒体网站的一位发言人告诉Kotaku。“此促销活动不符合我们的条款，我们已要求他们将其删除。”\n除了虚假的奖品，陆军的Twitch Stream还因为潜在地违反了第一修正案而陷入麻烦。此前，Twitch Stream禁止观众询问征兵人员最喜欢的美军战争罪是什么。\n尽管Twitch允许流媒体用户以他们认为合适的方式调节他们的频道，但任何由政府主办的公共论坛-包括那些在线论坛-都必须遵守严格的言论自由规则。这是去年联邦法院裁定唐纳德·特朗普总统不允许在推特上阻止批评他的人时建立的。\n骑士基金会(Knight Foundation)高级律师凯蒂·法洛(Katie Flow)告诉“新闻周刊”：“一般说来，就像我们在针对特朗普的案件中建立的那样，如果一个政府机构或军队部门运营着一个社交媒体平台或网站，而且他们通常允许人们发表评论，那么这通常就会被认为是一个公共论坛。”“如果陆军Run Twitch频道是一个公共论坛，那么删除评论或阻止人们根据他们的观点发表评论，比如询问军事犯罪，就违反了第一修正案。”", "note_en": "Twitch has intervened to stop the US Army using fake prize giveaways on its esports channel to redirect viewers to army recruitment pages.\n The practice was brought to light by a  report from  The Nation on the use of esports as a recruitment tool by the American military. The US Army, Navy, and Air Force all field esports teams comprised of active and reserve personnel who stream on Twitch and chat with young viewers about life, video games, and the opportunities afforded by military service.\n “Esports is just an avenue to start a conversation,” Major-General Frank Muth, head of the army’s recruiting command,  told  ThinkTech Hawaii recently. “We go out there and we have a shared passion for esports ... and it naturally devolves into a conversation, ‘What do you do?’, ‘I’m in the army.’”\n “This promotion did not comply with our Terms, and we have required them to remove it.”\n This outreach included automated links dropped into the army’s stream chat that told viewers they could win an Xbox Elite Series 2 controller in a “giveaway.” But when anyone clicked the link, says  The Nation, they were directed to “a recruiting form with no additional mention of a contest, odds, total number of winners, or when a drawing will occur.”\n Viewers, streamers, and game developers  reacted with anger to the news, saying that any other channel would face repercussions for such behavior. Twitch itself has now apparently forced the army to stop these giveaways, according to a  report from  Kotaku.\n “Per our Terms of Service, promotions on Twitch must comply with all applicable laws,” a spokesperson for streaming site told  Kotaku. “This promotion did not comply with our Terms, and we have required them to remove it.”\n In addition to fake prize giveaways, the army’s Twitch stream is also in trouble for potentially violating the first amendment after it  banned viewers who asked recruiters what their favorite US Army war crime was.\n  Although Twitch allows streamers to moderate their channels however they see fit, any public forum hosted by the government — including those online — must follow stringent free speech rules. This was established last year when a federal court ruled that President Donald Trump isn’t allowed to  block his critics on Twitter.\n “As a general rule, as established in our case against Trump, if a government agency or branch of the military operates a social media platform or a website, and they allow people generally to post comments then typically that would be considered a public forum,” Katie Fallow, a senior attorney with the Knight Foundation,  told  Vice. “If the Army run Twitch channel is a public forum, then deleting comments or blocking people from commenting based on their viewpoints, such as asking about military crimes, would violate the first amendment.”", "posttime": "2020-07-18 03:26:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,告诉,recruitment,twitch", "title": "Twitch告诉美国陆军停止分享将用户送到招聘页面的虚假奖品", "title_en": "Twitch Tells US Army To Stop Sharing Fake Prize Giveaways That Sent Users To Recruitment Page", "transed": 1, "url": "https://www.theverge.com/2020/7/17/21328130/us-army-twitch-esports-gaming-recruitment-fake-prize-giveaway", "via": "", "real_tags": ["美国", "告诉", "twitch"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着第一台数字计算机在20世纪40年代被发明，像艾伦·图灵这样的研究人员正在将他们的能力正规化，科学界和工程界需要一种方法来量化以前对信息和通信的直觉概念。1948年，克劳德·香农(Claude Shannon)在贝尔实验室(也是晶体管和Unix操作系统的发源地，以及计算机科学的其他主要成就)工作期间，在他的里程碑式的论文“通信的数学理论”中提供了第一个全面的框架来做到这一点。有了这个理论(现在称为信息论)提供的工具，我们可以回答有关现代计算机局限性的重要问题，比如：我们如何才能以最有效的方式存储信息(比如，硬盘上的文件)？或者，我们如何通过可能不是100%可靠的信道(例如，我们的蜂窝网络)成功地传送信息(例如，文本消息)？\n我们已经提供了几个抽象意义上的“信息”示例，但是我们如何才能以正式、精确的方式定义信息呢？我们将从一个示例开始。假设西雅图市已经决定引入一项新的服务，即每个居民每天早上都会收到一条包含当天天气预报的短信。如果是冬天，那里的天气百分之百都是阴天，发短信是多余的；如果一个居民对城市的天气模式有基本的了解，并假设每天都会阴天，那么他就永远是正确的。换句话说，预测不会为城市居民提供任何新的信息，因为结果没有不确定性。\n现在，假设我们处在一个不同的季节，一天的天气有多种可能性。在这种情况下，我们的服务实际上将是有用的-居民不再能够仅仅假设天气每天都是阴天，并且100%的时间都是正确的。一个给定的预测到底有多大用处呢？假设我们现在是夏天，天气(乐观地说)有75%的时间是晴朗的，25%的时间是阴天。在这种情况下，如果居民天真地假设当天的天气会是晴朗的，那么他们在大多数日子里都会是正确的，因此，与天真的基线相比，对晴天的预测不会提供太多新的信息。相应地，由于它们的相对稀有性，预测阴天的预报将提供更多的信息，因为在这种情况下，天真的预测将是不正确的。\n从前面的示例中我们可以看到，在传达事件结果时传输的信息与该结果的频率密切相关。带着这个想法，我们引入了信息论中的第一个概念--自我信息。\n假设我们有一些离散随机变量X∼p(X)X\\sim p(X)X∼p(X)，它具有一组势值x∈X x\\in数学{X}x∈X，具有对应的概率质量函数p(X)。然后我们定义。\n自我信息(有时也被称为“惊喜”)。X∈X x\\in\\数学{X}x∈X定义为i(X)=1log⁡p(X)=−log⁡p(X)i(X)=\\frac{1}{\\logp(X)}=-\\logp(X)i(X)=log p(X)1​=−log p(X)。\n我们通常将上述定义中的LOG⁡\\LOG LOG设为以2为底，因此自我信息是以位为单位度量的。乍一看，我们对i(X)的定义可能看起来很武断，但我们可以看到，它包含了我们早先在思维实验中的想法，以及其他一些很好的性质。作为p(X)→1p(X)\\to 1 p(X)→1，我们有i(X)→0 i(X)\\to 0 i(X)→0。这与我们的直觉一致，即只有在接收方尚未意识到事件的结果时，才会将有关该事件的信息从源传输到接收方。类似地，作为p(X)→0 p(X)\\to 0 p(X)→0，我们有i(X)→∞i(X)\\to ininfty I(X)→∞，反映了罕见结果的传达比普通结果更有信息量。\n最后，假设我们希望传达两个独立事件X1，X2∼I.I.D.的结果。P(X)X_1，X_2\\stackrel{\\TEXT{I.I.D.}}{\\sim}p(X)X 1​，X 2​∼I.D.。P(X)。由于X1X1X1X1​和X2X2X2​的结果彼此独立，我们预计包含这两个结果的复合消息将传递的信息量等于分别发送包含每个结果的两个消息的总和。自信息也满足这一性质，因为对于某些联合结果(x1，x2)∈X×X(x_1，x_2)\\in\\数学{X}\\次\\数学{X}(x 1​，x 2​)∈X×X\nI(x1，x2)=对数对齐p(x1，x2)=对数对数对齐(p(X1)p(X2))=−[对数对齐p(X1)+对数对数点p(X2)]=i(X1)+i(X2)\\⁡{−}i(x_1，x_2)&amp；=-\\log p(x_1，x_2)\\\\&amp；=-\\log\\BIG(p(X_1)p(X_2)\\BIG)\\\\&amp；=-[\\log p(X_1)+\\log p(X_2)]\\\\&amp；=i(X_1)+i(X_2)\\End{Alignment}i(x 1​，x 2​)​=−lg p(x 1​，X 2​)=−log(p(x 1​)p(x 2​))=−[lo g p(x 1​)+lo p(x 2​)])=i(x 1​)+i(x 2​)​。\n现在，假设结果不是提前知道的，但我们仍然想知道我们将传输多少信息。要做到这一点，一种简单的方法是用每个结果的概率p(X)来加权每个结果的自我信息i(X)。这给了我们信息论中的第二个主要概念？？熵。\n随机变量X的熵H(X)定义为H(X)=∑x∈Xp(X)i(X)=−∑x∈Xp(X)log⁡p(X)H(X)=\\SUM_{x\\in\\数学{X}}p(X)I(X)=-\\SUM_{x\\in\\数学{X}}p(X)\\。Log p(X)H(X)=x∈X∑​p(X)i(X)=−x∈X∑​p(X)log p(X)。\n按照惯例，当x=0x=0x=0时，我们为p(X)loglogp(X)p(X)\\logp(X)⁡p(X)log p(X)赋值0 0 0，即使从技术上讲，0 log⁡0 0\\log0 0 log 0是未定义的。我们可以用连续性来证明这一点，因为它可以显示为x log⁡x→0 x\\log x\\to 0 x lo g x→0 as x→0+x\\to 0^{+}x→0+。1这也符合我们的直觉--一个不可能发生的结果对我们的事件X的可变性没有任何影响。\n熵很可能是信息论的“基本单位”，它将继续以各种有趣的方式出现。我们可以认为H(X)量化了我们平均会对X的结果感到多少“惊讶”。举一个例子将有助于说明这一观点。\n设X∼B e r n(P)X\\sim Bern(P)X∼B e r n(P)。换句话说，我们有X={1，概率为p 0，概率为1−p X=\\Begin{Cases}1&amp；\\TEXT{概率为$p$}\\\\0&amp；\\TEXT{概率为$1-p$}\\End{Cases}X={1 0​，概率为1−p​。\nH(X)=−p log⁡p−(1−p)log⁡(1−p)H(X)=-p\\log p-(1-p)\\log(1-p)H(X)=−p lo g p−(1−p)log g(1−p)。\n为了建立我们的直觉，我们可以在下面的图中可视化不同的p值的熵(其中我们让H(P)表示H(X)作为p p的函数)\n正如我们所期望的那样，当X X是确定性的(p=0p=0p=0或p=1p=1p=1)时，H(X)是0，因为在这种情况下不会有意外的可能性。另一方面，当结果的变异性最大时，当p=1/2p=1/2p=1/2时，它是最大的。在继续之前，我们将完成另一个更复杂的示例。\n设X∼G e o m(P)X\\sim Geom(P)X∼G e o m(P)。换句话说，在达到第一个1之前需要k k次伯努利试验的概率是(设q=1−p q=1-p q=1−p)P(X=k)=q k−1 p P(X=k)=q^{k-1}p P(X=k)=q k−1 p。\nH(X)=−∑k=1∞q k−1 p⋅log⁡(q k−1 p)=−[∑k=1∞p q k−1 log⁡p+∑k=1∞p q k−1 log⁡q]=−[∑k=0∞p q k log⁡p+∑k=0∞p q k log⁡q]\\Begin{Alignment}H(X)&amp；=-\\sum_{k=1}^{\\infty}q^{k-1}p\\cdot\\log\\Big(q^{k-1}p\\Big)\\\\&amp；=-\\Bigg[\\sum_{k=1}^{\\infty}pq^{k-1}\\log p+\\sum_{k=1}^{\\infty}pq^{k-1}\\log q\\Bigg]\\\\&amp；=-\\Bigg[\\sum_{k=0}^{\\infty}Pq^{k}\\logp+\\sum_{k=0}^{\\infty}Pq^{k}\\logq\\Bigg]\\End{Alignment}H(X)​=−k=1∑∞​q k−1 p⋅log(q k−1 p。)=−[k=1∑∞​p q k−1 lo g p+k=1∑∞​p q k−1 lo q]=−[k=0∑∞​p q k lo g p+k=0。∑∞​p q k lo g q]​。\n从微积分开始，我们知道∑n=0∞rn=1 1−r\\sum_{n=0}^{\\infty}r^{n}=\\frac{1}{1-r}n=0∞​rn=1−r 1​∑n=0∞n rn=r(1−r)2\\sum_{n=0}^{。\\infty}nr^{n}=\\frac{r}{(1-r)^2}n=0∞​n r n=(1−r)2 r​对于任意实数r，|r|&lt；1|r|&lt；1|r|&lt；1。这为我们提供了。\nH(X)=−[p log⁡p 1−q+p q log⁡q p 2]=−[p log⁡p+q log⁡q p]=−[p log⁡p+(1−p)log⁡(1−p)p]\\BEGIN{Alignment}H(X)&amp；=-\\bigg[\\frac{p\\log p}{1-q}+\\frac{pq\\log q}{p^2}\\bigg]\\\\&amp；=-\\Bigg[\\frac{p\\logp+q\\logq}{p}\\bigg]\\\\&amp；=-\\BIGG[\\FRAC{p\\logp+(1-p)\\log(1-p)}{p}\\Bigg]\\End{Alignment}H(X)​=−[1−q p lo g p​+p 2 p q lo g q​]=−]。P p lo g p+q lo g q​]=−[p p lo g p+(1−p)lo(1−p)​]​。\n正如我们可能预期的那样，H(P)→0 H(P)\\to 0 H(P)→0 as p→1 p\\to 1 p→1，因为在第一次成功之前，我们需要的试验次数的可变性较小。另一方面，H(P)→∞H(P)\\to\\ininfty H(P)→∞as p→0 p\\to 0 p→0反映了这样一个事实，即随着成功概率的降低，预测成功所需的试验次数变得更加困难。\nH(X)=−∑x∈X p(X)log⁡p(X)H(X)=-\\sum_{x\\in\\数学{X}}p(X)\\log p(X)H(X)=−x∈X∑​p(X)log p(X)。\n因为我们的p(X)项是概率项，所以我们必须有0≤p(X)≤1 0\\leq p(X)\\leq 1 0≤p(X)≤1。由于0&lt；x⁡1 0&lt；x\\leq 1 0&leq 1的log≤x≤0\\log x\\leq 0 log x≤0。X≤1，所以我们必须有∑x∈X p(X)⁡p(X)≤0\\∈_{x\\in\\Mathcal{X}}p(X)\\log p(X)\\leq 0 x∈X​p(X)log p(X)≤0。然后乘以H(X)的定义中的负号，就完成了证明。-\\正方形-\n这一事实将在我们继续课程的过程中被证明是非常有用的，所以现在最好记住这一点。\n读者可能已经注意到，我们对熵的定义与随机变量的期望值的定义几乎相同，只是在存在LOG⁡\\LOGLOG函数时有所不同。这就回避了一个问题--我们能调和这两个概念吗？首先，作为提醒，我们将期望值定义为。\n离散随机变量X∼p(X)X\\sim p(X)X∼p(X)的期望值E[X]为E[X]=∑x∈Xp(X)⋅x E[X]=\\SUM_{x\\in\\数学{X}}p(X)\\cotxE[X]=x∈X∑​p(X)⋅x。\n现在，假设我们将某个确定性函数应用于随机变量X，这给出了一个新的随机变量g(X)。由于g(X)中的随机性完全是由于XXX中的随机性所致，因此直观上我们应该能够使用XXX的分布p(X)来计算Eg(X)，而不需要计算g(X)的分布。事实证明，我们在这里的直觉是正确的；这是概率论中的一个众所周知的结果，使用得够多了，以至于有了自己的名字。\n对于离散随机变量X∼p(X)X\\sim p(X)X∼p(X)和函数g ⁣：r→R g\\冒号\\mathbb{R}\\to\\mathbb{R}g：r→R E[g(X)]=∑x∈X p(X)⋅g(X)E[g(X)]=\\sum_{x\\。在数学上{X}}p(X)\\cot g(X)E[g(X)]=x∈X∑​p(X)⋅g(X)。\n尽管这个定理的本质是直观的，但证明它需要一些工作，我们在这里省略这些工作，把这些工作留给读者作为练习。2设置g(X)=−log⁡p(X)g(X)=-\\logp(X)g(X)=−log p(X)，然后使用莲花。\n这使得我们可以正式证明熵的概念，即包含在随机变量的结果中的平均信息量。\n在结束这些注释之前，我们将复习最后一个示例。假设我们想要传达由随机变量X表示的事件的结果。理想情况下(为了节省金钱、电力等)。平均而言，我们希望消息越短越好。自然，我们的编码方案应该使用较少的比特来表示高概率事件，而使用更多的比特来编码低概率事件。事实证明(我们稍后将证明这一点)，这个问题的任何编码方案平均至少需要I(X)比特才能在不破坏其内容的情况下发送我们的消息。换言之，H(X)=E[I(X)]提供了保证我们的消息将被成功发送所需的平均比特数的下限。虽然我们稍后才会有工具来证明这一点，但一个简单的示例将有助于说明这一想法\n设X={a，概率为1/2 b，概率为1/4 c，概率为1/8 d，X=\\Begin{Cases}a&amp；\\text{概率为1/2}\\\\b&amp；\\text{概率为1/4}\\\\c&amp；\\text{概率为1/8}\\\\d&amp；\\text{概率为1/8}\\end{案例}X=⎩⎪⎪⎪⎪⎨⎪⎪⎪⎪⎧​a b c d​，概率为1/2，概率为1/4，概率为1/8，概率为1/8​。\n在这种情况下，我们怎么才能设计出密码来传送X的结果呢？一种可能的方案如下：如果X=aX=aX=a，我们发送1并结束传输，否则我们发送0并继续。类似地，如果X=bX=bX=b，那么我们发送一个1并停止，否则我们发送另一个0。最后，如果X=c，我们发送1并停止，否则发送0并停止。在该方案下，我们一半的时间总共发送1比特，2比特1/4的时间发送，1/4的时间发送3比特，平均总共1.75比特。\n在这个方案中，每当我们提出“问题”时，我们就消除了剩余概率空间的一半。这与二进制搜索在算法的每一步消除一半可能的解空间的方式非常相似。此外，正如二分搜索是一种最优算法(即，采用尽可能少的步骤来保证正确答案)一样，我们期望我们的编码方案对于X、X、X是最优的。\nH(X)=−1 2 LOG⁡1 2−1 4 LOG⁡1 4−1 8 LOG⁡1 8−1 8 LOG⁡1 8=1.75G比特H(X)=HSP1。\\FRAC{1}{8}=1.75\\Text{Bits}H(X)=−2 1​log 2 1​−4 1​log 4 1​−8 1​lo g 8 1​。−8 1​log 8 1​=1。7个5位。\n由于我们对X×X的结果进行编码所需的平均比特数不能小于H(X)，因此我们提出的方案确实是最优的。\n一个潜在的证据是应用微积分↩中的L‘Hôpital规则", "note_en": "As the first digital computers were being invented in the 1940s and researchers like Alan Turing were formalizing their capabilities, the scientific and engineering communities needed a way to quantify previous intuitive notions of  information and  communication. In 1948 Claude Shannon, during a stint at Bell Labs (also the birthplace of the transistor and Unix operating systems, among other major achievements in computer science) provided the first comprehensive framework to do so in his landmark paper  A Mathematical Theory of Communication. With the tools provided by this theory (now known as  Information Theory), we can answer important questions about the limits of modern computers like: How can we store information (say, a file on our hard drive) in the most efficient way? Or, how do we successfully communicate information (say, a text message) over a channel (e.g., our cell network) that may not be 100% reliable?\n We’ve provided a couple examples of “information” in the abstract sense, but how can we define information in a formal, precise way? We’ll start with an example. Let’s say the city of Seattle has decided to introduce a new service, whereby every morning each resident gets a text message with the day’s weather forecast. If it’s wintertime, where the weather is overcast ~100% of the time, sending the text is redundant; a resident will always be correct if they have basic knowledge of the city’s weather patterns and assume that every day will be overcast. In other words,  the forecast won’t provide any new information for city residents, since there’s no uncertainty in the outcome.\n Now, suppose instead we’re in a different season with multiple possibilities for the day’s weather. In this case our service will actually be useful - residents no longer can just assume that the weather will be overcast every day and be correct 100% of the time. Just how useful is a given forecast? Suppose we’re in the summer, and the weather (optimistically) is sunny 75% of the time and overcast 25% of the time. In this case, a resident would be correct on most days if they naively assumed the day’s weather would be sunny, and a forecast of a sunny day thus doesn’t provide much new information as compared to the naive baseline. Correspondingly, due to their relative rarity, a forecast indicating a cloudy day would be much more informative, as the naive prediction would be incorrect in this case.\n  From the previous example we see that the information transmitted when communicating the outcome of an event is intimately related to frequency of that outcome. With this idea in mind, we introduce our first concept in information theory,  self-information.\n Let’s say we have some discrete random variable       X ∼ p ( x ) X \\sim p(x)    X  ∼    p ( x ) taking on a set of potential values       x ∈ X x \\in \\mathcal{X}    x  ∈     X with a corresponding probability mass function       p ( x ) p(x)    p ( x ). We then define\n The  self-information (sometimes known as  &#34;surprisal&#34;) of an outcome       x ∈ X x \\in \\mathcal{X}    x  ∈     X is defined as       I ( x ) =  1  log ⁡ p ( x ) = − log ⁡ p ( x ) I(x) = \\frac{1}{\\log p(x)} = -\\log p(x)    I ( x )  =             lo g  p ( x )       1 ​      =    −  lo g  p ( x )\n We usually take the       log ⁡ \\log    lo g in the above definition to be base 2, so self-information is measured in  bits. At a first glance our definition of       I ( x ) I(x)    I ( x ) may seem arbitrary, but we can see that it captures the ideas we had in our thought experiment earlier, along with some other nice properties. As       p ( x ) → 1 p(x) \\to 1    p ( x )  →    1, we have that       I ( x ) → 0 I(x) \\to 0    I ( x )  →    0. This aligns with our intuition that information about an event is only transferred from a source to a recipient if the recipient was not already aware of that event’s outcome. Similarly, as       p ( x ) → 0 p(x) \\to 0    p ( x )  →    0, we have that       I ( x ) → ∞ I(x) \\to \\infty    I ( x )  →    ∞, reflecting that the communication of a rare outcome is more informative than a common one.\n Finally, suppose we wish to communicate the outcomes of two independent events        X 1 ,  X 2    ∼ i.i.d. p ( x ) X_1, X_2 \\stackrel{\\text{i.i.d.}}{\\sim} p(x)     X        1 ​    ,   X        2 ​             ∼      i.i.d.    p ( x ). Since the outcomes of        X 1 X_1     X        1 ​    and        X 2 X_2     X        2 ​    are independent of each other, we’d expect that a compound message containing both outcomes would convey an amount of information equal to the sum of sending two messages containing each outcome individually. The self-information satisfies this property too, since for some joint outcome       (  x 1 ,  x 2 ) ∈ X × X (x_1, x_2) \\in \\mathcal{X} \\times \\mathcal{X}    (  x        1 ​    ,   x        2 ​    )  ∈     X  ×     X we have\n I (  x 1 ,  x 2 )     = − log ⁡ p (  x 1 ,  x 2 )         = − log ⁡ ( p (  x 1 ) p (  x 2 ) )         = − [ log ⁡ p (  x 1 ) + log ⁡ p (  x 2 ) ]         = I (  x 1 ) + I (  x 2 ) \\begin{aligned} I(x_1, x_2) &amp;=-\\log p(x_1, x_2)\\\\ &amp;= -\\log\\big(p(x_1)p(x_2)\\big)\\\\ &amp;= -[\\log p(x_1) + \\log p(x_2)]\\\\ &amp;= I(x_1) + I(x_2)\\end{aligned}             I (  x        1 ​    ,   x        2 ​    )          ​             =  −  lo g  p (  x        1 ​    ,   x        2 ​    )      =  −  lo g   ( p (  x        1 ​    ) p (  x        2 ​    )  )      =  − [ lo g  p (  x        1 ​    )  +  lo g  p (  x        2 ​    ) ]      =  I (  x        1 ​    )  +  I (  x        2 ​    ) ​\n   Now, suppose out outcome isn’t known ahead of time, but we still want a sense of how much information we’ll be transmitting. One simple way to do this is to weight the self-information       I ( x ) I(x)    I ( x ) of each outcome by the probability of that outcome       p ( x ) p(x)    p ( x ). This gives us our second major concept in information theory,  entropy\n The  entropy       H ( X ) H(X)    H ( X ) of a random variable       X X    X is defined as       H ( X ) =  ∑  x ∈ X p ( x ) I ( x ) = −  ∑  x ∈ X p ( x ) log ⁡ p ( x )  H(X) = \\sum_{x \\in \\mathcal{X}}p(x)I(x) = -\\sum_{x \\in \\mathcal{X}}p(x)\\log p(x)    H ( X )  =            x ∈  X    ∑ ​     p ( x ) I ( x )  =    −          x ∈  X    ∑ ​     p ( x )  lo g  p ( x )\n By convention we assign a value of       0 0    0 to       p ( x ) log ⁡ p ( x ) p(x)\\log p(x)    p ( x )  lo g  p ( x ) when       x = 0 x = 0    x  =    0, even though technically       0 log ⁡ 0 0\\log 0    0  lo g  0 is undefined. We can justify this by continuity, as it can be shown       x log ⁡ x → 0 x \\log x \\to 0    x  lo g  x  →    0 as       x →  0 + x \\to 0^{+}    x  →     0         +.  1 This too aligns with our intuition - an outcome with no chance of occuring doesn’t have any effect on the variability of our event       X X    X.\n Entropy is quite possibly the “fundamental unit” of information theory, and it’ll continue coming up in all kinds of interesting ways. We can think of       H ( X ) H(X)    H ( X ) as quantifying how much we’ll be “surprised” by the outcome of       X X    X on average. An example will help illustrate this idea\n Let       X ∼ B e r n ( p ) X \\sim Bern(p)    X  ∼    B e r n ( p ). In other words, we have       X =  {     1    with probability   p    0    with probability   1 − p X = \\begin{cases} 1 &amp; \\text{with probability $p$} \\\\ 0 &amp; \\text{with probability $1-p$}\\end{cases}    X  =      {          1    0 ​             with probability  p     with probability 1  −  p ​\n  H ( X ) = − p log ⁡ p − ( 1 − p ) log ⁡ ( 1 − p )  H(X) = -p\\log p - (1 - p)\\log(1-p)    H ( X )  =    − p  lo g  p  −    ( 1  −    p )  lo g ( 1  −    p )\n To build up our intuition we can visualize our entropy for different values of       p p    p in the following graph (where we let       H ( p ) H(p)    H ( p ) denote       H ( X ) H(X)    H ( X ) as a function of       p p    p)\n  As we would expect,       H ( X ) H(X)    H ( X ) is 0 when       X X    X is deterministic (      p = 0 p = 0    p  =    0 or       p = 1 p = 1    p  =    1) as there’s no potential for surprise in such cases. On the other hand, it’s maximized when       p = 1 / 2 p = 1/2    p  =    1 / 2 when the variability in outcomes is greatest. We’ll work through another more complicated example before moving on.\n Let       X ∼ G e o m ( p ) X \\sim Geom(p)    X  ∼    G e o m ( p ). In other words, the probability that we need       k k    k Bernoulli trials before reaching our first 1 is (letting       q = 1 − p q = 1 - p    q  =    1  −    p)       P ( X = k ) =  q  k − 1 p P(X = k) = q^{k-1}p    P ( X  =    k )  =     q         k − 1 p\n  H ( X )     = −  ∑  k = 1 ∞  q  k − 1 p ⋅ log ⁡ (  q  k − 1 p )         = − [  ∑  k = 1 ∞ p  q  k − 1 log ⁡ p +  ∑  k = 1 ∞ p  q  k − 1 log ⁡ q ]         = − [  ∑  k = 0 ∞ p  q k log ⁡ p +  ∑  k = 0 ∞ p  q k log ⁡ q ] \\begin{aligned} H(X) &amp;= -\\sum_{k=1}^{\\infty}q^{k-1}p\\cdot \\log\\big(q^{k-1}p\\big) \\\\ &amp;= -\\bigg[\\sum_{k=1}^{\\infty}pq^{k-1}\\log p + \\sum_{k=1}^{\\infty}pq^{k-1}\\log q\\bigg]\\\\ &amp;= -\\bigg[\\sum_{k=0}^{\\infty}pq^{k}\\log p + \\sum_{k=0}^{\\infty}pq^{k}\\log q\\bigg]\\end{aligned}             H ( X )       ​             =  −          k = 1    ∑     ∞ ​      q         k − 1 p  ⋅  lo g   (  q         k − 1 p  )      =  −  [          k = 1    ∑     ∞ ​     p  q         k − 1  lo g  p  +          k = 1    ∑     ∞ ​     p  q         k − 1  lo g  q  ]      =  −  [          k = 0    ∑     ∞ ​     p  q         k  lo g  p  +          k = 0    ∑     ∞ ​     p  q         k  lo g  q  ] ​\n From calculus, we know that        ∑  n = 0 ∞  r n =  1  1 − r \\sum_{n=0}^{\\infty}r^{n} = \\frac{1}{1-r}              n = 0     ∞ ​      r         n  =              1 − r        1 ​     and        ∑  n = 0 ∞ n  r n =  r  ( 1 − r  ) 2 \\sum_{n=0}^{\\infty}nr^{n} = \\frac{r}{(1-r)^2}              n = 0     ∞ ​     n  r         n  =              ( 1 − r  )        2        r ​     for any real number       r r    r with       ∣ r ∣ &lt; 1 |r| &lt; 1    ∣ r ∣  &lt;    1. This gives us\n H ( X )     = − [   p log ⁡ p  1 − q +   p q log ⁡ q  p 2 ]         = − [   p log ⁡ p + q log ⁡ q p ]         = − [   p log ⁡ p + ( 1 − p ) log ⁡ ( 1 − p ) p ] \\begin{aligned} H(X) &amp;= -\\bigg[\\frac{p\\log p}{1 - q} + \\frac{pq\\log q}{p^2}\\bigg] \\\\ &amp;= -\\bigg[\\frac{p\\log p + q\\log q}{p}\\bigg]\\\\ &amp;= -\\bigg[\\frac{p\\log p + (1-p)\\log (1-p)}{p}\\bigg]\\\\\\end{aligned}             H ( X )       ​             =  −  [          1  −  q       p  lo g  p ​      +            p        2       p q  lo g  q ​      ]      =  −  [          p       p  lo g  p  +  q  lo g  q ​      ]      =  −  [          p       p  lo g  p  +  ( 1  −  p )  lo g ( 1  −  p ) ​      ] ​\n     As we might expect,       H ( p ) → 0 H(p) \\to 0    H ( p )  →    0 as       p → 1 p \\to 1    p  →    1 since there’s less variability in the number of trials we need until our first success. On the other hand       H ( p ) → ∞ H(p) \\to \\infty    H ( p )  →    ∞ as       p → 0 p \\to 0    p  →    0, which reflects the fact that it’s much harder to predict the number of trials required to reach a success as the probability of success is lowered.\n     H ( X ) = −  ∑  x ∈ X p ( x ) log ⁡ p ( x ) H(X) = -\\sum_{x \\in \\mathcal{X}}p(x)\\log p(x)    H ( X )  =    −          x ∈  X    ∑ ​     p ( x )  lo g  p ( x )\n Since our       p ( x ) p(x)    p ( x ) terms are probabilities, we must have       0 ≤ p ( x ) ≤ 1 0 \\leq p(x) \\leq 1    0  ≤    p ( x )  ≤    1. Since       log ⁡ x ≤ 0 \\log x \\leq 0    lo g  x  ≤    0 for       0 &lt; x ≤ 1 0 &lt; x \\leq 1    0  &lt;    x  ≤    1, so we must have        ∑  x ∈ X p ( x ) log ⁡ p ( x ) ≤ 0 \\sum_{x \\in \\mathcal{X}}p(x)\\log p(x) \\leq 0              x ∈  X ​     p ( x )  lo g  p ( x )  ≤    0. Multiplying by the negative sign in the definition of       H ( X ) H(X)    H ( X ) then completes the proof.       □ \\square    □\n This fact will prove  very useful as we proceed in the course, so it’s good to commit to memory now.\n  The reader may have noticed that our definition of entropy is nearly identical to that of the expected value of a random variable, differing only in the presence of the       log ⁡ \\log    lo g function. This begs the question - can we reconcile these two concepts? First, as a reminder we define expected value as\n The expected value       E [ X ] E[X]    E [ X ] of a discrete random variable       X ∼ p ( x ) X \\sim p(x)    X  ∼    p ( x ) is       E [ X ] =  ∑  x ∈ X p ( x ) ⋅ x E[X] = \\sum_{x \\in \\mathcal{X}} p(x)\\cdot x    E [ X ]  =            x ∈  X    ∑ ​     p ( x )  ⋅    x\n Now, suppose we apply some deterministic function       g g    g to our random variable       X X    X - this gives us a new random variable       g ( X ) g(X)    g ( X ). Since the randomness in       g ( X ) g(X)    g ( X ) is entirely due to the randomness in       X X    X, intuitively we should be able to compute       E g ( X ) Eg(X)    E g ( X ) using       X X    X’s distribution       p ( x ) p(x)    p ( x ) without needing to compute       g ( X ) g(X)    g ( X )’s distribution. It turns out that our intuition here is correct; this is a well-known result in probability theory that is used enough to have its own name\n For a discrete random varible       X ∼ p ( x ) X \\sim p(x)    X  ∼    p ( x ) and function       g     ⁣ :  R → R g\\colon \\mathbb{R} \\to \\mathbb{R}    g       :   R  →     R       E [ g ( X ) ] =  ∑  x ∈ X p ( x ) ⋅ g ( x ) E[g(X)] = \\sum_{x \\in \\mathcal{X}} p(x)\\cdot g(x)    E [ g ( X ) ]  =            x ∈  X    ∑ ​     p ( x )  ⋅    g ( x )\n Despite the intuitive nature of this theorem, proving it requires some work which we omit here and leave as an exercise for the reader.  2 Setting       g ( X ) = − log ⁡ p ( X ) g(X) = -\\log p(X)    g ( X )  =    −  lo g  p ( X ) and using LOTUS we then have\n  which allows us to formally justify our notion of entropy as the average amount of information contained in the outcome of a random varible.\n  We’ll go over one final example before concluding these notes. Suppose we want to communicate the outcome of an event represented by a random variable       X X    X. Ideally (to save money, power, etc.) we’d like to do so with as short a message as possible on average. Naturallly, our encoding scheme should use fewer bits to represent high-probability events and more bits to encode low probability ones. It turns out (we’ll prove this later), any coding scheme for this problem requires at least       I ( X ) I(X)    I ( X ) bits on average to send our message without corrupting its contents. In other words,       H ( X ) = E [ I ( X ) ] H(X) = E[I(X)]    H ( X )  =    E [ I ( X ) ] provides a lower bound on the average number of bits required to guarantee that our message will be transmitted successfully. While we won’t have the tools to prove this until later, a simple example will help illustrate this idea\n Let       X =  {     a   with probability 1/2    b   with probability 1/4    c   with probability 1/8    d   with probability 1/8 X = \\begin{cases} a &amp; \\text{with probability 1/2} \\\\ b &amp; \\text{with probability 1/4} \\\\ c &amp; \\text{with probability 1/8} \\\\ d &amp; \\text{with probability 1/8} \\end{cases}    X  =             ⎩    ⎪    ⎪    ⎪    ⎪    ⎨    ⎪    ⎪    ⎪    ⎪    ⎧ ​             a    b    c    d ​             with probability 1/2     with probability 1/4     with probability 1/8     with probability 1/8 ​\n How could we devise a code to transmit the outcome of       X X    X in this case? One possible scheme is as follows: If       X = a X = a    X  =    a, we send a 1 and end transmission, otherwise we send a 0 and continue. Similarly, if       X = b X = b    X  =    b, we then send a 1 and stop, otherwise we send another 0. Finally, if       X = c X = c    X  =    c we send a 1 and stop, otherwise we send a 0 and stop. Under this scheme, we send a total of 1 bit half the time, 2 bits 1/4 of the time, and 3 bits 1/4 of the time, giving us a total of 1.75 bits on average.\n  Each time we ask our “questions” in this scheme, we’re eliminating half of the remaining probability space. This is very similar to the way that binary search eliminates half the possible solution space at each step of the algorithm. Moreover, just as binary search is an optimal algorithm (i.e., takes the fewest number of steps possible to still guarantee a correct answer), we would expect our encoding scheme to be optimal for       X X    X.\n  H ( X ) = −  1 2 log ⁡  1 2 −  1 4 log ⁡  1 4 −  1 8 log ⁡  1 8 −  1 8 log ⁡  1 8 = 1.75  bits H(X) = -\\frac{1}{2}\\log\\frac{1}{2}-\\frac{1}{4}\\log\\frac{1}{4}-\\frac{1}{8}\\log\\frac{1}{8}-\\frac{1}{8}\\log\\frac{1}{8} = 1.75 \\text{ bits}    H ( X )  =    −          2       1 ​      lo g           2       1 ​      −             4       1 ​      lo g           4       1 ​      −             8       1 ​      lo g           8       1 ​      −             8       1 ​      lo g           8       1 ​      =    1 . 7 5   bits\n Since our average number of bits needed to encode the outcome of       X X    X can’t be less than       H ( X ) H(X)    H ( X ), our proposed scheme is indeed optimal.\n   One potential proof is to apply  L’Hôpital’s rule rule from calculus  ↩", "posttime": "2020-07-18 03:25:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "简介,entropy,log", "title": "熵：简介", "title_en": "Entropy: An Introduction", "transed": 1, "url": "https://homes.cs.washington.edu/~ewein/blog/2020/07/14/entropy/", "via": "", "real_tags": ["简介", "entropy", "log"]}, {"category": "", "categoryclass": "", "imagename": "a73b125b04bd0141edad0ef40ccaeedd.png", "infoid": 1012606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用于Raspberry PI版本0.2的Smalltalk-80这是Raspberry PI的裸机Smalltalk-80端口。\n基于Dan Banay(https://github.com/dbanay/Smalltalk)and)的Smalltalk-80C++实现，Rene Stange(https://github.com/rsta2/circle))的圆形裸机程序库。\n要进行构建，只需在Smalltalk-raspi-Circle目录中执行./build.sh即可。需要GNU make 4.0或更高版本才能构建Circle(通过自制软件安装)。\n要使用，请将&#34；sdboot&#34；目录的内容复制到SD卡的引导FAT分区。", "note_en": "Smalltalk-80 for Raspberry Pi version 0.2This is a bare metal Smalltalk-80 port to the Raspberry Pi.\n  Based on the Smalltalk-80 C++ implementation by Dan Banay ( https://github.com/dbanay/Smalltalk)and the circle bare metal library by Rene Stange ( https://github.com/rsta2/circle)\n        To build, simply execute ./build.sh in the smalltalk-raspi-circle directory.GNU make 4.0 or newer is required to build circle (install via homebrew).\n   To use, copy the contents of the &#34;sdboot&#34; directory to the boot FAT partition of an SD card.", "posttime": "2020-07-18 03:25:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,连接,metal,circle", "title": "裸机Smalltalk-80端口连接到树莓PI", "title_en": "Bare metal Smalltalk-80 port to the Raspberry Pi", "transed": 1, "url": "https://github.com/michaelengel/crosstalk", "via": "", "real_tags": ["连接", "metal", "circle"]}, {"category": "", "categoryclass": "", "imagename": "b2852b737ec96a6c22aeaa1ebfc60af3.png", "infoid": 1012605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，我在GitHub上浏览，遇到了一个吸引我眼球的回购。它托管了一个完全用NIM编写的项目。\n我立刻得出结论，这是很多人使用的众多编程语言中的一种，但我只是个不懂它的笨蛋。但我没有把它放在一边，而是决定：让我们来了解一下这方面的情况。\n因此，下面来介绍一下我使用NIM的经验，这是一个快速编程教程，以及为什么这种语言在我看来非常有前途。\n看起来很干净。它感觉非常简单，即使您以前可能从未听说过Nim，您也可能不费力气就能弄清楚它是做什么的。(提示：它打印num：5 i：5。)。\nJavaScript开发人员对此非常熟悉。虽然有些语言使用var，有些语言使用let，但JS和NIM都允许使用这两种语言中的任何一种进行声明。然而，重要的是要注意，它们在两种语言中的含义并不相同。但稍后会有更多关于这一点的报道。\n要在NIM中标记新块，我们使用冒号后跟缩进行。那边就是蟒蛇。\n这两个循环以及if语句看起来都像是直接从Python中提取出来的。事实上，从第5行开始的所有内容实际上都是有效的Python。\n因此，是的，Python中的许多关键字和运算符在NIM中也是有效的，如not、is、and、or等。\n到目前为止，尼姆并没有什么特别之处。它看起来只是像一个更糟糕的Python版本，因为我们需要使用let或var。\n但是如果我告诉你：NIM是一种静态类型的语言，它的运行速度几乎和C语言一样快，会怎么样呢？\n在深入研究NIM语法(特别是静态类型部分，我们还没有看到它)之前，让我们先来支持一下有关其速度的说法。为此，我编写了一个程序，用Nim、Python和C计算第n个斐波纳契数(即不使用动态编程)。\n为了公平起见，我基于针对此问题推荐的Leetcode解决方案(方法1)标准化了实现，并确保在这三种语言中尽可能地遵守它。\n为了给执行计时，我在Bash shell中使用了time输出的“实际”值。\n现在，这是非常有限的，远不是一项科学实验，但它与其他做过更严肃基准的人的发现是一致的[1][2][3]。\n不过，我将在本文中运行的所有代码都可以在GitHub上找到，包括关于如何尝试此实验的说明。\nNIM是编译的，而Python是解释的(不同意吗？单击该链接)。这意味着当运行Python程序时，除了运行程序之外，还有更多的工作要做，因为在实际执行之前需要对其进行解释。这通常会使语言变得慢得多。\nNIM是静态键入的。虽然我前面展示的示例没有单个类型声明或注释，但稍后我们将看到它确实是一种静态类型语言。对于动态类型的Python，解释器需要做更多的工作来确定和适当地处理类型，这会减慢执行速度。\n解释语言的开发/调试周期通常比编译语言短，尽管它们的程序运行通常也较慢。\n例如，这句话很好地总结了Python和C之间的权衡。用Python可以做的任何事情都可以用C来做，并且程序的运行速度会快很多个数量级。\n但是，您将花费更多的时间用C语言编写和调试代码，而且代码会更长，可读性也会更差。这就是为什么C不再流行，而Python如此流行的原因。简单地说：Python是“容易的”(当然，相比较而言)。\n因此，如果Python处于这一端，而C位于另一端，那么NIM正试图介于两者之间：有点快，有些简单？差不多是这样。\n然而，让Nim脱颖而出的是，乍一看，它似乎把权衡降到了最低。换句话说，它比Python快得多，但用C编程并不比它难得多(或者说，简单地看起来就是这样)。\n为了说明这一点，让我们看一下斐波纳契实验中的代码。\n虽然NIM有一个奇怪的proc程序，并且，亲爱的上帝，使用=来声明函数(或者它们被称为过程)，但是它仍然比C语言干净得多。\n因此，也许这是一个有价值的权衡？编写起来比Python稍微难一点，但速度要快几十倍--我可以接受这一点。\n以下是关于NIM语法的一些要点的简要概述：\n虽然JavaScript中的let在作用域上与var不同，但Nim中的let表示其值在初始化后不能更改的变量。现在有人告诉我，这显然和斯威夫特很相似。\n对于const，编译器必须能够在编译时确定值，而let可以在运行时确定。\nVar a=1 b=2 c=3 x，y=10#x，y都赋给10。\n鉴于该语言在很多方面看起来都很像Python，当您第一次看到过程时，肯定会觉得有点奇怪。\n用=代替{或：特别奇怪。但是，在一行程序中看起来要好一些：\nProc toString(x：int)：string=result=if x&lt；0：“负”elif x&gt；0：“正”否则：“零”\n感觉仍然应该返回结果，但是结果不是一个变量--它是一个关键字。上面的代码片段是完全有效的NIM。\n对于在范围内迭代，您可以使用countup(start，Finish)或Countdown(start，Finish)来代替范围。或者，您可以简化整个过程并使用：for i in start..Finish。\n与Python相比，readLine(Stdin)等同于input()，echo等同于print。\n我在这里的目标是让你尝尝尼姆的滋味，而不是通读他们的整个手册。因此，我想我将在此停止讨论简单的语法，然后略读一些额外的特性。\nNIM不是面向对象的，但对对象有最低限度的支持。但是，它们不像Python类那样整洁。\nNIM支持宏和元编程，而且实际上似乎非常强调这一点。在他们的三部分教程系列中，有整整一部分都致力于此。\n您可能已经在上面的Python语法中看到了我的注释，但与Python不同的是，多行注释还使用散列符号(后跟[或])：\n“NIM包括一流的JavaScript后端，因此您可以毫不费力地同时瞄准客户端和服务器。”\n这很酷，虽然我不确定有多少人会真正使用它。但是如果你想玩用NIM编写的浏览器Snake，你可以这么做。不过，这一次不是我造的。\n除了定义proc之外，还可以定义迭代器。然而，NIM迭代器实际上更像是Python生成器。这里有一个例子：\n迭代器Countup(a，b：int)：int=var res=a while res&lt；=b：Year res Inc(Res)。\n因此，HelloWorld和HelloWorld是不同的，但是HelloWorld、HelloWorld和hello_world都是相同的，因此这是有效的：\n也许你看了书名就会对自己说：嗯，我听说过Nim，或者我用过Nim！\n那样的话，嘿，我为你高兴。不过，我确实试着了解了一下这种语言的受欢迎程度，它肯定不是那么高。\n例如，在2020年的堆栈溢出调查中甚至没有提到NIM。我在LinkedIn(位置设置为Worldwide)上找不到任何适合NIM开发人员的工作，而且该语言的Stack Overflow标签只有349个问题。(相比之下，Python的大约1500,000，或更新的语言，如Swift的270,000。)。\n因此，可以相当公平地认为大多数开发人员没有使用过它，很多人甚至从未听说过Nim这个名字。\n为了写这篇文章，我已经过了最低限度的检查，所以还没有深入研究，但是我可以预见自己将来会用它来做点什么。\n然而，虽然基本语法非常类似于Python，但它很快就变得更加复杂，我确信这会让很多Python用户/开发人员望而却步。\n就我个人而言，我既是Python的忠实粉丝，也是静态类型语言的忠实粉丝，所以对我来说，某些情况下的性能改进足以弥补增加的冗长。\n我相信你们中的许多人在阅读的时候就是这么想的，这是一个很有道理的观点。尽管NIM的语法可能更接近Python，但它实际上是在性能优于C++语言的领域展开竞争，这一领域目前由Go主导。\n有趣的事实：我还偷偷地用围棋进行了速度测试。具体地说，对于斐波纳奇(40)来说，它的速度与C。\n那么，尼姆能与Python竞争吗？我对此深表怀疑。我们看到了计算机变得更快、编程变得更容易的趋势，就像我指出的那样，即使NIM提供了一个很好的权衡，我认为它也不足以与干净而多功能的Python竞争。\n编辑：我采访了一位NIM核心开发人员，他告诉我他认为NIM比Python更适合从C++过渡的人。\n然而，它能与围棋竞争吗？也许(如果谷歌不是围棋的幕后黑手)。它的语法很友好，语言很强大，而且它对C/C++特性的支持比Go提供的更好(例如宏和重载)。", "note_en": "A few weeks ago I was browsing through GitHub and encountered a repo that caught my eye. It hosted a project that was written entirely in  Nim.\n  Immediately I concluded this was one of the many programming languages that a lot of people use, but I just was the stupid guy who didn’t know it. But rather than putting it aside, I decided: Let’s learn a bit about this.\n   So here goes a bit about my experience with Nim, a quick programming tutorial, and why the language seems extremely promising to me.\n  Looks pretty clean. It also feels so simple that you can probably figure out what it does with no effort, even though you might have never heard of Nim before. (Hint: It prints  num: 5 i: 5.)\n   It’s extremely familiar to JavaScript developers. While some languages use  var and some use  let, JS and Nim both allow declarations using either of the two. It’s important to note that they do not have the same meaning in both languages, however. But more on that later.\n  To mark a new block in Nim, we use a colon followed by an indented line. That’s Python right there.\n  Both loops, as well as the if statement, look like they were plucked right out of Python. In fact, everything from line 5 onwards is actually valid Python.\n So yes, a lot of the keywords and operators from Python are also valid in Nim, such as  not ,  is ,  and ,  or , etc.\n Until now, there’s nothing special about Nim at all. It just looks like a worse version of Python, since we need to use  let or  var.\n But what if I told you this: Nim is a statically typed language that runs almost as fast as C.\n  Before diving a little deeper into the Nim syntax (especially the statically typed part, which we still haven’t seen), let’s try to back up the claims about its speed. To do so, I wrote a program to naively (i.e., without dynamic programming) compute the n-th Fibonacci number in Nim, Python, and C.\n In order to keep things fair, I standardized the implementation based on the suggested  Leetcode solution for this problem (Approach 1) and made sure to stick to it as much as possible across the three languages.\n To time the execution, I used the “real” value from the output of  time in the Bash shell.\n    Now, this is very limited and far from a scientific experiment, but it is consistent with the findings of others who have done more serious benchmarks  [1] [2] [3].\n Nevertheless, all the code I’ll run through in this article is  available on GitHub, including instructions on how to try this experiment out.\n   Nim is compiled while  Python is interpreted (disagree? click the link). This means that when a Python program is run, there’s more work being done than just running the program, as it needs to be interpreted before it can actually execute. This generally makes languages much slower.\n Nim is statically typed. While the example I showed earlier didn’t have a single type declaration or annotation, we will see later that it is indeed a statically typed language. In the case of Python, which is dynamically typed, the interpreter needs to do a lot more work to figure out and appropriately handle types, which slows down execution.\n  “Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly.”\n This sentence is a good summary of the tradeoff between Python and C, for example. Anything you can do with Python you can also do with C, and your program will run many orders of magnitude faster.\n However, you will be spending a lot more time writing and debugging your code in C, as well as it will be longer and less readable. And that’s why C isn’t as trendy anymore and Python is so popular. To put it simply: Python is “easy” (comparatively, of course).\n So, if Python is on one end of the spectrum and C is on the other, Nim is trying to be somewhere in the middle: somewhat fast and somewhat easy? Something like that.\n What makes Nim stand out for me, however, is that at first glance it feels like it has minimized the tradeoff. In other words, it is much faster than Python, but not equally harder to program in, like C (or so it feels like upon brief inspection).\n To illustrate this point, let’s look at the code from our Fibonacci experiment.\n       While Nim has this weird  proc thing and, dear God, uses  = to declare functions (or  procedures, as they’re called), it’s still much cleaner than C.\n Hence, maybe it’s a worthy tradeoff? A little harder to write than Python, but tens of times faster — I could live with that.\n  Here’s a brief overview of some key points about Nim’s syntax:\n    While  let in JavaScript differs from  var in terms of scope,  let in Nim denotes a variable whose value cannot change after initialization. This is apparently similar to Swift, I’ve now been told.\n   For  const, the compiler must be able to determine the value at compile time, whereas  let can be determined at runtime.\n    var  a = 1  b = 2  c = 3  x, y = 10 # Both x, y are assigned to 10\n    Given that the language looks like Python in a lot of ways, procedures definitely stand out as being a little weird when you first see them.\n Using  = instead of  { or  : is especially odd. However, it looks a little better in one-liner procedures:\n   proc toString(x: int): string =   result =   if x &lt; 0: “negative”   elif x &gt; 0: “positive”   else: “zero”\n It feels like you should still do  return result, but  result is not a variable — it’s a keyword. The above snippet is perfectly valid Nim.\n      For iterating over a range, instead of a range you can use  countup(start, finish), or  countdown(start, finish) . Or you can simplify the whole thing and use: for i in start..finish.\n   When comparing to Python,  readLine(stdin) is the equivalent of  input() and  echo is the equivalent of  print.\n  My goal here is to give you a taste of Nim, not go through their entire manual. As such, I think I’ll stop here for plain syntax and skim over some additional features next.\n  Nim is not object-oriented but has  minimalistic support for objects. They are not as neat as Python classes, however.\n  Nim supports macros and metaprogramming, and, in fact, seems to heavily emphasize it. An  entire part of their three-part tutorial series is dedicated to it.\n         You probably already saw my comments in Python syntax above, but unlike Python, multiline comments also make use of the hash symbol (followed by  [ or  ]):\n    “Nim includes a first-class JavaScript backend so you can target the client and server effortlessly at the same time.”\n That’s quite cool, although I’m not sure how many people would actually use it. But if you want to  play Browser Snake written in Nim, you can do so. This time I didn’t build it, though.\n  Instead of defining a  proc, one can also define an  iterator. However, Nim iterators are actually more like Python generators. Here’s an example:\n iterator countup(a, b: int): int =   var res = a   while res &lt;= b:   yield res   inc(res)\n   Thus  HelloWorld and  helloWorld are different, but  helloWorld,  helloworld, and  hello_world are all the same, making this valid:\n  Maybe you read the title and said to yourself:  Uh, I’ve heard of Nim or  I’ve used Nim!\n In that case, hey, I’m happy for you. However, I did try to get a bit of info on the popularity of the language, and it surely isn’t that high.\n For example, Nim wasn’t even mentioned on the  2020 Stack Overflow Survey. I couldn’t find any jobs for Nim developers on LinkedIn (Location set to Worldwide), and the  Stack Overflow tag for the language has only 349 questions. (Compare that to Python’s ~1,500,000, or those of a newer language, like Swift’s 270,000.)\n Thus, it’s quite fair to assume most developers haven’t used it and that many have not ever even heard the name Nim.\n  To write this article, I went over the bare minimum, so haven’t gone too deep into it yet, but I can see myself using it for something in the future.\n However, while the basic syntax is very similar to Python, it gets more complicated quite fast, which I’m sure would throw off a lot of the Python user/developer base.\n Personally, I am a big fan of Python but also of statically typed languages, so for me, the performance improvement in certain cases would more than compensate for the added verbosity.\n  I’m sure many of you were thinking just that while reading, and it is a valid point. As much as the syntax of Nim might be closer to that of Python, it really is competing in the space of performant-yet-nicer-than-C++ languages, which is currently led by Go.\n Fun fact: I also sneakily ran the speed test with Go. For  fibonacci(40) specifically, it was as fast as C.\n So, can Nim compete with Python? I highly doubt it. We’re seeing a trend of computers getting faster and programming getting easier, to the point that even if Nim offers a good tradeoff, as I pointed out, I don’t think it’s enough to take on the clean and versatile Python.\n Edit: I spoke to one of the Nim Core Devs, who told me he believes Nim is more suitable for people transitioning from C++ than people transitioning from Python\n However, can it compete with Go? Maybe (if Google wasn’t behind Go). The syntax is friendly, the language is powerful, and it has better support for C/C++ features than Go offers (e.g., macros and overloading).", "posttime": "2020-07-18 03:24:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,python,巨蟒,language", "title": "巨蟒的替代品？我尝试了你从未听说过的最好的编程语言", "title_en": "A Python Substitute? I Tried the Best Programming Language You’ve Never Heard Of", "transed": 1, "url": "https://medium.com/better-programming/a-python-substitute-i-tried-out-the-best-programming-language-youve-never-heard-of-9e29cd1893c0", "via": "", "real_tags": ["编程", "python", "巨蟒", "language"]}, {"category": "", "categoryclass": "", "imagename": "ae8a694a765c97c018c41214e90da5b4.jpg", "infoid": 1012604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奎恩回忆说，之后他回到洛杉矶，“试图解开所有发生过的创伤”。在那段时间里，他说他“读了很多关于其他有创造力的人是如何处理悲痛的”，并意识到有“丰富的历史”小说家写他们的个人悲剧。\n因此，奎恩-一名设计师和程序员，曾在麦克斯威尼担任数字媒体总监，并与人共同创作了数字小说“沉默的历史”-决定制作一款关于这种体验的视频游戏。\n悲痛并不是一个很受欢迎的游戏主题，但奎恩表示，这是对他有意义的方法。\n“我不是小说家，也不是电影制作人，”他说。“我想做一款游戏已经有一段时间了，用我最习惯的媒介讲述我的故事似乎很有意义。”\n他承认，开发过程可能会让人情绪沉重。例如，他推迟了创建他母亲的3D模型，而是用一个粉红色的圆柱体来代替她的角色，因为他担心她的死亡“一旦我把她放进游戏中，就会变得过于真实”。但一旦他创建了这个模型，“我意识到：那不是我的母亲。它是一个演员，它是一个化身。从那以后，我感觉自己就像一个导演在舞台上导演演员。“。\n本周，奎恩发布了“四个月前”，这是一个可以在Windows、Mac和iOS上播放的免费开场白。正如标题所暗示的那样，开场白发生在比赛剩下的几个月前，奎恩和他来访的母亲琳达一起散步。通过对话选择，你可以了解他们是谁，以及他们面临的挑战。\nQuinn预计要到2022年才能完成完整的游戏“琳达与琼”，但他现在将“提前四个月”发布，这是对未来玩家和潜在出版商的一种推广。\n听起来，开场白与比赛的其他部分有很大不同，它将从阳光明媚的洛杉矶转向“英格兰的小房子”。奎恩说，与“四个月前”相比，“琳达和琼”将“更像是一场点击式冒险”，有“任务和谜题要解决”。\n这并不是说他想在真实故事中加入虚构的戏剧性场面或大团圆结局。他说，这些拼图都是“基于情感的”-你将扮演拉塞尔、琳达和琼(他的祖母)，试图平衡他们不同的需求。\n奎恩说：“这件事以两人死亡而告终，没有办法避免这些事情。”“你能改变的是你对他们的感觉，什么样的感觉反映了(现实生活)。如果家里有人被确诊为绝症，那就没问题了。但你们还得在一起生活很多个月，你们的现实，你们如何应对，可能会一天比一天变。“", "note_en": "Quinn recalled returning to Los Angeles afterwards and “trying to unpack all of this trauma that had happened.” During that time, he said he was “reading a lot about how other creative people dealt with grief” and realized there’s “a rich history” of novelists writing about their personal tragedies.\n So Quinn — a  designer and programmer who previously worked as digital media director at McSweeney’s and co-created the digital novel  “The Silent History” — decided to make a video game about the experience.\n  Grief isn’t exactly a popular subject for games, but Quinn suggested that this was the approach that made sense to him.\n “I’m not a novelist and I’m not a filmmaker,” he said. “I had been wanting to make a game for a while, and it seemed to make sense to tell my story in the medium that I am most used to.”\n He admitted that the development process could be emotionally taxing. For example, he delayed creating a 3D model of his mother, instead letting a pink cylinder stand in for her character, because he worried that her death would “become far too real once I put her in the game.” But once he created the model, “I realized: That is not my mother. It’s an actor, it’s an avatar. From that point onward, I felt like a director directing actors on a stage.”\n  And this week, Quinn released  “Four Months Earlier,” a free prologue playable on Windows, Mac and iOS. As the title suggests, the prologue takes place months before the rest of the game, with Quinn going for a walk with his visiting mother Linda. Through dialogue choices, you get a sense of who they are and the challenges they’re facing.\n Quinn doesn’t expect to finish the full game,  “Linda &amp; Joan,” until 2022, but he’s releasing “Four Months Earlier” now as a promotion, both for future players and potential publishers.\n It sounds like the prologue is very different from the rest of the game, which will shift from sunny Los Angeles to “small houses in England.” Compared to “Four Months Earlier,” Quinn said “Linda &amp; Joan” will be “more of a point-and-click adventure,” with “tasks and puzzles to solve.”\n Not that he’s trying to add fictional drama or a happy ending to the real story. The puzzles, he said, are all “emotion-based” — you’ll play as Russell, Linda and Joan (his grandmother), trying to balance their different needs.\n “It ends with the two deaths, there’s no way of avoiding those things,” Quinn said. “What you can change is how you feel about them, which kind of mirrors [real life]. If somebody in the family gets a terminal diagnosis, that is fixed. But you still have to live together for many more months, and your reality, how you deal with it, can change from day to day.”", "posttime": "2020-07-18 03:04:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,prologue,开场白", "title": "\n播放“琳达和琼”(Linda&Joan)的开场白，这是一款关于游戏创作者一生中最糟糕的一年的视频游戏", "title_en": "\n\t\t\t\tPlay the prologue of ‘Linda & Joan,’ a video game about the worst year of its creator’s life\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/17/linda-and-joan-prologue/", "via": "", "real_tags": ["游戏", "prologue", "开场白"]}]