[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1075056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据乌克兰军方在Facebook上发布的一篇新帖子称，乌克兰国防部呼吁所有拥有无人机的基辅公民携带无人机入境，并在俄罗斯入侵时帮助监控该市。即使人们不知道如何很好地驾驶自己的无人机，他们仍然被鼓励将其引入，以便有经验的无人机飞行员能够在这一关键时刻充分利用它们。\n“你有无人机吗？把它交给有经验的飞行员使用！”Facebook的帖子说，根据英文翻译。\n“你知道如何驾驶无人机吗？加入与基辅市独立旅112部队的联合巡逻队！”帖子还在继续。\n本周，俄罗斯以最站不住脚的借口入侵乌克兰，当时俄罗斯总统弗拉基米尔·普京说，他想“去国家化”并使该国非军事化。目前尚不清楚普京对乌克兰的最终目标可能是什么，但拜登政府周四警告称，俄罗斯可能会扩大对乌克兰以外领土的渴望。\n乌克兰总统沃洛德米尔·泽伦斯基仍在基辅与家人团聚，并于周五宣布他不打算离开，尽管他已被确定为俄罗斯暴力的主要目标。\n泽伦斯基警告国际社会：“如果你现在不帮助我们，如果你不能向乌克兰提供强有力的援助，明天战争将敲响你的大门。”。\n据乌克兰国防部称，俄罗斯人已经为这次可怕的入侵付出了高昂的代价，估计在过去24小时内有800名敌军阵亡。目前还没有关于乌克兰伤亡人数的消息。\n“基辅是我们的家，保卫它是一项共同任务#阻止俄罗斯，”乌克兰国防部在Facebook上发布的帖子说。“在这激烈的时刻，你和你的无人机需要基辅！”", "note_en": "Ukraine’s Ministry of Defense has called on all citizens of Kyiv who own hobby drones to bring them in and help monitor the city as Russia invades, according to a new Facebook post by the military. Even if people don’t know how to fly their own drones very well they’re still being encouraged to bring them in so that experienced drone pilots can put them to good use during this critical time.\n  “Do you own a drone? Give it to experienced pilots to use!” the   Facebook post says according to an English language translation.\n “Do you know how to drive a drone? Join the joint patrol with units 112 of the separate brigade of the city of Kyiv!” the post continues.\n    Russia invaded Ukraine on the flimsiest pretext this week, when President Vladimir Putin said he wanted to “denazify” and demilitarize the country. It’s still not clear what Putin’s end goal with Ukraine might be, but the Biden administration warned on Thursday that Russia could expand its desire for territory beyond Ukraine.\n  Ukraine President Volodymyr Zelensky is still in Kyiv with his family and made an announcement Friday he had no plans to leave, even though he’s been identified as a primary target for Russian violence.\n   “If you don’t help us now, if you fail to offer a powerful assistance to Ukraine, tomorrow the war will knock on your door,” Zelensky   warned the global community.\n The Russians have already paid a high price for this horrific invasion, according to the Ukraine Ministry of Defense, with an estimated 800 enemy forces killed in the past   24 hours. There’s been no word yet on the number of Ukrainian casualties.\n  “Kiev is our home, defending it is a common task #STOPRUSSIA,” the Facebook post by the Ukraine Ministry of Defense says. “You and your drone need Kyiv in this fierce moment!”", "posttime": "2022-02-26 02:41:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "军方,military,俄罗斯", "title": "乌克兰军方呼吁携带无人机的公民帮助基辅", "title_en": "Ukraine Military Calls on Citizens With Drones to Help Kyiv", "transed": 1, "url": "https://gizmodo.com/ukraine-military-calls-on-citizens-with-hobby-drones-to-1848592986", "via": "", "real_tags": ["军方", "military", "俄罗斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075055, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客集体匿名组织已经关闭了几个俄罗斯政府网站，包括国家控制的俄罗斯今日新闻社。\nDDoS攻击使该新闻网站充斥着恶意流量，至少几个小时内都无法访问\n这是预期的&#34；网络行动主义&#34；反对俄罗斯政府\n识别匿名集体的黑客宣布，他们发起了网络行动，短暂关闭了RT.com，以及克里姆林宫、俄罗斯政府和俄罗斯国防部的网站。\nRT.com证实了攻击的发生，称其减慢了一些网站的运行速度，同时使其他网站在&#34；延长时间&#34；。\nRT&#39；美国对乌克兰局势的报道绝大多数都是从亲俄的角度进行的，在新占领的领土上燃放烟花和欢庆。\n在英国，议员们说电视频道是俄罗斯总统弗拉基米尔·普京&#39；s&#34；个人宣传工具&#34；应该被禁止。\n互联网安全专家罗伯特·波特（Robert Potter）表示，使用的分布式拒绝服务（DDoS）攻击涉及多个系统淹没目标网站，使其他流量无法通过。\n&#34;它&#39；这就像试图让五个人同时穿过一扇门，&#34；他说。\n一个简单的措施是关闭网站的外国流量，这可以解释为什么目前从俄罗斯国内访问RT.com似乎比从国外更容易。\n&#34;如果你&#39；他们用DDoS攻击亚马逊，每分钟损失数百万美元，但对于俄罗斯宣传机构的新闻网站来说，它&#39；没什么大不了的&#34;\nAnonymous是一个分散的集体，没有等级或领导权，众所周知，它承担着广泛的问题，以前的攻击目标是中央情报局、伊斯兰国和山达基教会。\n2月15日发布的一段匿名视频威胁要带走俄罗斯&#39；s工业控制系统&#34；人质&#34人；如果乌克兰危机升级。\n&#34;那里&#39；这是导致升级的国家对国家网络战的真正风险，&#34；波特说。\n&#34;任何网络活动&#39；s在概念上匿名且可否认的更可能成功，因为它赢得了#39；不要让国家之间的事情升级&#34;\n今年1月，美国政府的一份情报简报警告说，俄罗斯&#34；会考虑&#34；如果北约介入保卫乌克兰，可能会对美国造成毁灭性的网络攻击。\n安全专家还警告说，可能会鼓励与俄罗斯有关的犯罪团伙对澳大利亚进行网络攻击。\n本周早些时候，俄罗斯网络部队对几家乌克兰银行和政府部门的网站发起DDoS攻击。\n乌克兰政府已向&#34；地下黑客&#34；帮助保护重要的基础设施并监视俄罗斯军队。", "note_en": "Hacker collective Anonymous has disabled several Russian government websites including the state-controlled Russia Today news service.\n The DDoS attack flooded the news website with malicious traffic, blocking access for at least several hours\n It is the first attack in an expected wave of &#34;cyber activism&#34; against the Russian government\n Hackers identifying with the Anonymous collective announced they had launched cyber operations that briefly took down RT.com, as well as the websites of the Kremlin, the Russian government and the Russian defence ministry websites.\n RT.com confirmed the attack took place, saying it slowed some websites down while taking others offline for &#34;extended periods of time&#34;.\n RT&#39;s coverage of the situation in Ukraine has been overwhelmingly from a pro-Russian perspective, showing fireworks and cheerful celebrations in the newly occupied territories.\n In the UK, MPs said the TV channel is Russian President Vladimir Putin&#39;s &#34;personal propaganda tool&#34; and should be banned.\n  Internet security expert Robert Potter said the distributed denial-of-service (DDoS) attack used involved multiple systems flooding a targeted website so that no other traffic could get through.\n &#34;It&#39;s like trying to run five people through a door at the same time,&#34; he said.\n   One simple measure is to switch off foreign traffic to a website, which could explain why it currently appears to be easier to access RT.com from inside Russia than outside.\n  &#34;If you&#39;re knocking Amazon off with a DDoS they lose millions a minute, but for the news website of the Russian propaganda agency, it&#39;s not such a big deal.&#34;\n  Anonymous is a decentralised collective without hierarchy or leadership and has been known to take on a wide range of issues, with previous attacks targeting the CIA, Islamic State and the Church of Scientology.\n  An Anonymous video posted on February 15 threatened to take Russia&#39;s industrial control systems &#34;hostage&#34; if the Ukraine crisis escalated.\n &#34;There&#39;s a real risk of country-versus-country cyber warfare leading to an escalation,&#34; Mr Potter said.\n &#34;Any cyber activity that&#39;s conceptually anonymous and deniable is more likely to be successful as it won&#39;t escalate things between countries.&#34;\n   In January, a  US government intelligence brief warned that Russia &#34;would consider&#34; a potentially devastating cyber attack against the US if NATO intervened to defend Ukraine.\n Security experts have also warned Russian-linked criminal gangs may be encouraged to  target Australia with cyber attacks.\n Earlier this week, Russian cyber forces  mounted DDoS attacks on the websites of several Ukrainian banks and government departments.\n The government of Ukraine has asked volunteers from the &#34;hacker underground&#34; to help protect critical infrastructure and spy on Russian troops.", "posttime": "2022-02-26 02:38:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,俄罗斯,集体,news", "title": "黑客集体匿名组织宣布对俄罗斯发动“网络战争”，关闭国家新闻网站", "title_en": "Hacker collective Anonymous declares 'cyber war' against Russia, disables state news website", "transed": 1, "url": "https://www.abc.net.au/news/science/2022-02-25/hacker-collective-anonymous-declares-cyber-war-against-russia/100861160", "via": "", "real_tags": ["黑客", "俄罗斯", "集体", "news"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "点击“注册”，即表示您同意接收内幕人士以及其他合作伙伴的营销电子邮件，并接受我们的服务条款和隐私政策。\n一位创始人说，由于Facebook在2018年对算法进行了调整，他的公司破产了。本周，他在一条长长的推特帖子中分享了关于这一事件的更多细节。\n乔·斯皮泽发起了小行动。2014年，作为一个关注女性的数字媒体网站，该网站致力于提升内容，如动物视频、食谱和其他让人感觉良好的故事。\n在算法改变之前，事情发展迅速，2000万社交媒体粉丝大多来自Facebook#39；他在推特上写道，这是一个庞大的用户群。斯皮塞说，Facebook甚至在其一次年度会议上以LittleThings为例，展示了如何打造一家成功的媒体公司。\n但是公司的流量&#39；Facebook改变了算法，推广人们最喜欢的帖子，比如来自朋友和家人的帖子。Facebook希望此举能让用户在平台上停留更长的时间，这让Facebook的页面受到了限制。然而，它也开始宣传暴力、虚假和分裂的内容。\n斯皮塞在推特上说，首席执行官马克·扎克伯格&#34；没有&#39；我不喜欢我们制作的毛茸茸的内容，他希望得到更认真的对待&#34;\n斯皮塞说，他当时蓬勃发展的网站在Facebook上失去了90%的有机流量。读者流失迫使斯佩塞解雇了100多名员工，这位前首席执行官说他损失了1亿美元。\n这位现在的天使投资人警告其他初创公司创始人，尽管在亚马逊、TikTok、谷歌、Spotify和Instagram等应用程序上建立业务可以让你获得数百万眼球和快速增长；你能真正地在晚上睡得好吗？你知道，在任何时候，只要简单地改变算法，一切都可以被消除&#34;\nLittleThings最终在2018年关闭。一位接近该公司的消息人士当时告诉内幕人士&#34；Facebook是世界的毁灭者&#34; 斯皮塞拒绝了对这篇报道进行更深入的采访。\n这种算法的改变一直是Facebook争论的焦点#39；它对新闻制作的影响。出版商被迫调整其商业模式，以进入该平台#39；s的读者，他们表现出更倾向于点击和参与耸人听闻和分裂的内容，而不是其他形式的故事。因此，所谓的点击诱饵内容变得更加常见。\n去年所谓的Facebook文件泄露也提到了这一变化。大量内部文件显示，即使是Facebook&#39；谷歌自己的员工担心，这种算法会产生负面影响，比如宣传令人愤怒的内容。\nFacebook&#39；s的母公司，现在被称为Meta，对文件中的报道进行了反驳，称他们没有描绘出公司的完整图景#39；该公司在其平台上开展了各种打击有害活动的举措。\n注册内部通知！了解你想知道的最新情况。\n形成&#39的两条交叉线；X&#39；。它表示关闭交互或取消通知的方法。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    A founder  who says his company went under thanks to a Facebook algorithm tweak in 2018 shared more details about the incident in a lengthy Twitter thread this week.\n Joe Spieser  launched LittleThings.com in 2014 as a women-focused digital media site devoted to uplifting content, like animal videos, recipes, and other feel-good stories.\n Things were booming before an algorithm change, with 20 million social media followers mostly built from Facebook&#39;s massive userbase, he tweeted. Speiser said Facebook even used LittleThings as an example of how to build a successful media company at one of its annual conferences.\n But traffic to the company&#39;s pages was throttled when Facebook changed its algorithm to promote posts that it thought people would engage with the most, like posts from friends and family, in a move it hoped would keep users on the platform longer. However, it  also began to promote violent, false, and divisive content.\n     Speiser tweeted that CEO Mark Zuckerberg &#34;didn&#39;t like the fluffy content we were producing and he wanted to be taken more seriously. &#34;\n Speiser said his then-flourishing site lost 90% of organic traffic on Facebook. The readership loss forced Speiser to let go of more than 100 staff members, and the former CEO said he lost $100 million.\n  The now-    angel investor    warned other startup founders that although building businesses on apps like Amazon, TikTok, Google, Spotify, and Instagram can get you millions of eyeballs and fast growth, &#34;can you ever truly sleep well at night knowing at any time it can all be taken away with just a simple algorithm change?&#34;\n       LittleThings eventually shut down in 2018. One source close to the company  told Insider at the time that &#34;Facebook is the destroyer of worlds.&#34; Speiser declined a more in-depth interview for this story.\n This algorithm change has been at the center of a debate over Facebook&#39;s influence on news production. Publishers were forced to reorient their business models to reach the platform&#39;s readers, who showed that they were more apt to click on and engage with sensationalistic and divisive content over other forms of stories. So-called clickbait content became more common as a result.\n This change was also mentioned in the  so-called Facebook Papers leak last year. A trove of internal documents showed that  even Facebook&#39;s own employees were concerned that the algorithm would have adverse effects, like promoting outrageous content.\n Facebook&#39;s parent company, now known as Meta, has pushed back against the reporting from the documents, saying they do not paint a complete picture of the company&#39;s various initiatives to combat harmful activities on its platforms.\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n              Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2022-02-26 02:35:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,创业,founder", "title": "初创公司创始人说，他依靠Facebook“让我不寒而栗”，看着其他人在Instagram和TikTok上创业，因此失去了公司和1亿美元", "title_en": "Startup founder says he lost his company and $100 million by relying on Facebook: 'Sends chills down my spine' to watch others build businesses on Instagram and TikTok", "transed": 1, "url": "https://www.businessinsider.com/facebook-startup-founder-littlethings-joe-speiser-2018-algorithm-change-2022-2", "via": "", "real_tags": ["facebook", "创业", "founder"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Low注意到，有2亿企业依赖手机或短信应用程序（如WhatsApp或Instagram）接受订单，这是一个难以追踪的过程，因此很难收取付款。他还发现，建立一个专业的电子商务网站需要数周时间，而且对新企业来说成本高昂。\n他们与林志聪（Zhicong Lim）合作，创建了总部位于新加坡的CoCarat，这是一个让商家能够在几分钟内建立在线商店的工具，无需代码、无需设计，也无需下载应用程序。该商店提供从订单管理到移动支付解决方案的一切服务。Low补充道，商家可以在没有收取不可持续费用和佣金的应用程序或市场的情况下管理自己的销售。\n“老实说，管理订单很难，”他说。“大多数本地企业仍在WhatsApp上接受订单，并使用电子表格管理订单。这占用了大量时间，本可以更好地用于发展业务。我们站在新一轮本地企业家的最前沿。我们每天都受到商人的故事的启发，他们从自己的公司销售食品开始厨房，但现在经营零售店和商业厨房。我们的使命是改变当地企业，赋予企业主追求激情的权力。\"\n他说，Cococart的许多商人都和他一样。这场大流行造就了新一代的独立企业主，他们代表着电子商务中快速增长的一部分。另一个有帮助的是，人们现在更习惯于在线订购，这种低行为并没有消失。\n“和我一样，许多失去工作的人转向了网上兼职，这成为他们的主要收入来源，”Low补充道。“这些企业家意识到，与为他人工作相比，经营自己的企业更有利可图，更有成就感。”\n自成立以来，Cococart是一家盈利的公司，在90个国家有超过20000名商户注册，这些商户总共收到了超过500000份订单，收入超过1500万美元。\n例如，该公司的顶级商户之一是INDOCIN，这家公司提供按需制作的印尼美食。Low说，当店主一年前开始经营CoCarat时，她正在厨房里卖自己做的食物。如今，她雇佣了一支24人的团队，并拥有一家零售店。\n据Low说，仅在2021，可可车就增长了30倍，客户增长了46倍。在同一时期，该公司将团队从两位创始人发展到了12个国家的22人。\n为了保持这种势头，CoCarat从先行者风投和红杉公司筹集了420万美元，其他投资者包括Y Combinator、Unformal Capital、Soma Capital、Liquid 2 Ventures、Fitbit首席执行官詹姆斯·帕克和策展首席执行官爱德华多·维瓦斯。\n“我们才刚刚开始，”他补充道。“我们的目标是定义下一代商业。从交付到供应链再到融资，我们在创业和运营中仍有许多挑战需要解决。我们看到巨大的机遇摆在我们面前，我们希望将CoCart带给全球2亿家企业。”", "note_en": "Low noticed that 200 million businesses rely on the phone or messaging apps, like WhatsApp or Instagram, to take orders, a hard-to-track process that made it tough to collect payments. He also saw that a professional e-commerce website takes weeks to set up and is costly for new businesses.\n   Pairing up with Zhicong Lim, they founded the Singapore-based  Cococart, a tool to enable merchants to set up an online store in minutes with no code, no design and no app downloads. The store comes with everything from order management to mobile payment solutions. Merchants can manage their own sales without apps or marketplaces that charge unsustainable fees and commissions, Low added.\n “Honestly, managing orders is hard,” he said. “Most local businesses are still taking orders on WhatsApp and managing their orders using spreadsheets. It sucks up so many hours of time, which could be better spent growing the business. We’re at the forefront of a new wave of local entrepreneurs. We’re inspired every day by stories of our merchants who started from selling food from their kitchen, but are now running retail stores with commercial kitchens. Our mission is to transform local businesses and empower business owners to pursue their passion.”\n  Many of Cococart’s merchants are just like him, he said. The pandemic created a new generation of independent business owners, and they represent a fast-growing segment in e-commerce. What’s also helping is that people are now more used to ordering online, a behavior Low doesn’t see going away.\n “Like myself, many people who lost their jobs turned to side hustles online, which then became their main source of income,” Low added. “These entrepreneurs realized that running their own business was both more profitable and fulfilling than working for others.”\n Since its launch, Cococart is a profitable company, with over 20,000 merchants in 90 countries signed up that have collectively taken over 500,000 orders and earned more than $15 million.\n For example, one of the company’s top merchants is  INDOCIN, a company providing on-demand artisan Indonesian cuisine. Low said when the owner started with Cococart a year ago, she was selling her homemade food from her kitchen. Today, she employs a team of 24 and owns a retail outlet.\n In 2021 alone, Cococart grew its merchant count 30 times and customer growth by 46 times, according to Low. During that same time, the company grew the team from just the two founders to 22 people across 12 countries.\n To keep the momentum going, Cococart raised $4.2 million from Forerunner Ventures and Sequoia, with additional investors including Y Combinator, Uncommon Capital, Soma Capital, Liquid 2 Ventures, Fitbit CEO James Park and Curated CEO Eduardo Vivas.\n  “We’re just getting started,” he added. “Our goal is to define the next generation of commerce. There are still so many challenges in starting and running a business that we want to solve, from deliveries to supply chain to financing. We see a massive opportunity in front of us and we want to bring Cococart to 200 million businesses worldwide.”", "posttime": "2022-02-26 02:30:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sweetens", "title": "CoCarat使电子商务公司能够立即接受订单", "title_en": "\n\t\t\t\tCococart sweetens the process for e-commerce companies to take orders immediately\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/cococart-seed-e-commerce-orders/", "via": "", "real_tags": ["sweetens"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Taur于2019年亮相，为其优质、时尚、白色的电动滑板车发起了一场预购活动。该款电动滑板车配备了一个脚踏板，让骑手在骑行时可以面朝前方，并配备了两个大轮胎。该计划将在伦敦启动，但英国仍未能使私人拥有的电动滑板车合法化。\n取而代之的是，Taur在洛杉矶的一家旧金山风险投资公司VC汽车公司筹集了175万美元。虽然说电动滑板车市场已经成熟还有些言过其实，但一家进入该行业的新公司即使不是潜在的令人兴奋的，也是引人注目的，这一点肯定已经足够了。\n布朗告诉TechCrunch：“我们刚开始的时候，我想分享真的很普遍，我们做出了一个自信、勇敢和愚蠢的决定，说实话，我们认为这将取决于所有权。”。“因此，我们正在抓住这些汽车市场的机遇，我们认为洛杉矶是一个很好的地方，不仅从产品的角度来看，而且因为我们认为品牌是我们工作的一大部分。我们将改变滑板车在普通人眼中的样子。如果我们能做到这一点，我们已经完成了我们的工作。”\n换句话说，Taur希望创造一种文化转变，将踏板车视为理想的交通方式，而不是利基或“二等公民活动”。布朗说，大多数踏板车公司没有多少个性，他们当然也没有为这种文化做太多工作。\n“一直以来，我们都在尽可能地降低价格，尽可能多地销售，”他说。“我们被这个机会所吸引，能够提供真正处于前沿和最前沿的产品，并成为人们参考的产品。”\nUnagi踏板车被称为踏板车的iPhone。该品牌最近推出的下一代车型11是一款智能滑板车，具有先进的驾驶员辅助功能，如目标检测和警告，以及内置扬声器等。这款车的售价约为2860美元，标准车型一的售价约为990美元。\n虽然Unagi已经利用了像Iggy Pop这样的名人影响力来展示它的滑板车的酷炫元素，但布朗并不认为该公司已经将外形因素推到了极限。他希望Taur从设计角度打造一款经过深思熟虑的滑板车的策略能够帮助实现鼓励车主所需的文化转变，这款滑板车看起来很性感，价格也很高（1495美元）。\n该策略的最前沿显然是前向甲板，它允许骑手采用“双滑雪”骑乘姿势，双脚放在两个向下折叠的脚平台上。布朗说，这给了骑手们一个平等的道路视野，他们不会像在其他踏板车上那样半侧半前地站着。他补充说，这也有助于保持稳定。\n布朗说：“如果你在滑雪的时候想一想，你可以调整你每只脚的重量，这不仅可以控制车把，还可以控制车辆。”。“感觉有点不一样。我有过很多时候，人们通常非常坚定地说，‘不，我喜欢它现在的样子’，然后他们试着说，‘好吧，我现在真的明白了。’”\nTaur的踏板车有非常大的大陆轮胎，比大多数电动踏板车大50%。它还配备了三盏灯——前灯是一个环绕灯，它不仅为骑手提供了良好的可见度，还允许其他道路使用者从骑手的侧面和后面看到灯光。还有一个专用刹车灯，以及后部的投影灯，向上照射到骑乘设施上，使其完全可见。为了方便旅行和存放，滑板车也可以很好地折叠起来。\n布朗说，这款车目前只提供白色，但这既是一种美学选择，也是一种功能选择。他还补充说，白色踏板车不仅在市场上的黑色和银色踏板车之海中脱颖而出，而且对其他道路使用者来说也更为显眼。\n布朗说，市场上有太多的滑板车在普通自行车店无法使用，而且客户服务渠道也很差。Taur的滑板车是模块化设计的，这意味着它由五个模块组成，可以更换，以便于维护。\n“为所有权而建”就在这里，”布朗说。“你可以在不到五分钟的时间内更换轮胎，如果你没有轮胎杆，你可以用勺子。当你是这些车辆的用户并在设计它们时，你知道标杆是什么，你知道没有人撞到它。”\nTaur将在夏季开始为其滑板车提供预订单，从8月起，这家初创公司将专门向洛杉矶的消费者直接销售。滑板车将包括30天的退款保证，外加保修。美国其他地方的客户可以支付100美元的押金，以确保在Taur的候补名单上占有一席之地。", "note_en": "Taur came onto the scene in 2019 to launch a pre-order campaign for its premium, sleek, white e-scooters that are built with a foot deck that lets riders face forward while riding and a couple of big ol’ tires. The plan was to launch in London, but the U.K. has still failed to legalize privately owned e-scooters.\n Instead, Taur is launching in Los Angeles after raising $1.75 million from Trucks VC, a San Francisco VC firm specializing in the future of transportation. While it would be a stretch to say the electric scooter market is mature, it is certainly far enough along that a new company entering the industry is notable, if not potentially exciting.\n  “When we started, I guess sharing was really quite prevalent, and we made the confident, brave and stupid decision to say, actually, we think it’s going to go to ownership,” Brown told TechCrunch. “So we’re seizing the opportunity of markets that are embracing these vehicles, and we see LA as a great place to be, not just from a product perspective, but because we see a brand as a huge part of our job. We’re going to change how scooting looks to the normal person. If we can do that, we’ve done our job.”\n In other words, Taur wants to create a cultural shift that sees scooters not as niche or “second-class-citizen activities” but as aspirational methods of transportation. Most scooter companies don’t have much in the way of character, and they certainly haven’t done much for the culture, said Brown.\n “It’s always been make it as cheap as you can and sell as many as you can,” he said. “We were drawn by the opportunity to deliver something that really was at the cutting edge and at the forefront and actually became the product that people reference.”\n Unagi scooters have been referred to as the  iPhone of scooters. The brand’s recently unveiled next generation,  the Model Eleven, is a smart scooter with advanced rider assistance features like object detection and warning, as well as built-in speakers and more. That vehicle will cost around $ 2,860, and its standard Model One comes in at around $990.\n  While Unagi has tapped celebrity influencers like  Iggy Pop to up the cool factor of its scooters, Brown doesn’t reckon the company has pushed the form factor to its limits enough. He’s hoping Taur’s strategy of building a well-thought-out scooter from a design perspective that looks sexy and is priced on the premium end ($1,495) will help achieve the culture shift necessary to encourage ownership.\n  At the forefront of that strategy is obviously the front-facing deck, which allows riders to assume a “twin ski” ride position with both feet positioned on two fold-down foot platforms. This, Brown said, gives riders an equal view of the road that they wouldn’t have from standing half sideways and half forwards as you do on other scooters. It also helps with stability, he added.\n “If you think of when you’re skiing, you can adjust how much weight you put on each foot, and that steers the vehicle in addition to the handlebars,” said Brown. “It’s a bit of a different feel. I’ve had a lot of moments from people who were generally really firm and said, ‘No I like it the way it is,’ and then they try it and are like, ‘OK, I really get it now.&#39;”\n  Taur’s scooter has very large Continental tires that come in 50% larger than most e-scooters. It also comes with three lights – The front light is a wrap-around, which not only provides the rider with great visibility but also allows other road users to see the light from the side and behind the rider. There’s also a dedicated brake light, as well as a projection light in the rear that shines upward onto the ride to make them fully visible. And for convenience while traveling and easy storage, the scooter also folds up nicely.\n It’s only available in white for the moment, but that was both an aesthetic choice and a functional one, Brown said, adding that a white scooter not only stands out from the sea of black and silver scooters hitting the market, but also can be more visible to other road users.\n Too many scooters on the market are unserviceable by the average bike shop and have poor customer service channels, said Brown. Taur’s scooter was designed modularly, which means it is made up of five modules that can be swapped out for easier maintenance.\n “‘Built for ownership’ was there from the premise,” said Brown. “You can do a tire change in under five minutes, and if you don’t have a tire lever, you can use a spoon. When you’re a user of these vehicles and you’re designing them, you know what the bar is and you know that no one’s hitting it.”\n Taur is due to start shipping pre-orders for its scooter over the summer, and from August onward, the startup will be selling direct to consumers in LA exclusively. The scooters will include a 30-day money-back guarantee, plus a warranty. Customers elsewhere in the U.S. can put down a $100 deposit to secure a spot on Taur’s waitlist.", "posttime": "2022-02-26 02:28:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "成为,brand,滑板车", "title": "Taur能成为让电子滑板车拥有者更酷的品牌吗？", "title_en": "\n\t\t\t\tCan Taur be the brand that makes e-scooter ownership cool?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/can-taur-be-the-brand-that-makes-e-scooter-ownership-cool/", "via": "", "real_tags": ["成为", "brand", "滑板车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，在上市前交易中，Coinbase的股价上涨了一点多，该公司的每股价值比其直接上市参考价格低70美元左右；Coinbase也较近期高点下跌了约57%。该公司令人难以置信的利润2021美元净收入36亿2000万美元，从73亿5000万美元的总净收入-导致了一个价值较低的CONBASE，至少根据最近的交易。\n对于一家2018年市值80亿美元的公司来说，2022年470亿美元的市值远未失败。但它仍然只是Coinbase几个月前及其上市时市值的一小部分。\n这是我们以前提到过的一个主题，但最近对整个技术市场的重新定价再次说明了这一点。\n然而，问题不仅仅在于Coinbase，尽管令人好奇的是，它今天的估值似乎是基于利润倍数而非收入倍数。SaaS估值的飙升又回到了现实中，Altimeter Capital的Jamin Ball本周报告称，“自疫情开始以来，高增长的软件收入倍数首次恢复到新冠病毒之前的水平。”\n这位前风险资本家还写道，增长最快的群体今年的业绩“比低增长和中增长的软件”公司还要差。就软件公司的价值而言，这是一个颠倒的季节，增长溢价急剧下降。\n我认为这就是为什么我们看到2021年末的资本大炮从这些交易中撤回的原因。Tiger、D1和其他人押注，他们可以向中后期软件市场注入大量资金，并在他们的投资组合跟随开放的IPO窗口进入欢迎的公开市场后获得回报。如果IPO窗口一直敞开，如果软件估值在短短几个月内没有大幅下跌，那么这一策略在短期内可能具有难以置信的增值性。\n然而，情况恰恰相反。那么，这会给后期创业公司留下什么呢？我想是有麻烦了。\n他们真的有麻烦了吗，还是你只是在周五表现得很悲观，亚历克斯？", "note_en": "And yet, Coinbase shares are up just over a point in pre-market trading, and the company is worth around $70 per share less than its direct listing reference price; Coinbase is also down around 57% from its recent highs. The company’s incredibly profitable 2021 — net income of $3.62 billion from $7.35 billion in total net revenue — has led to a less valuable Coinbase, at least according to recent trading.\n     For a company worth $8 billion back in 2018, a 2022 market cap of $47 billion is far from a failure. But it’s still a fraction of what Coinbase was worth just months ago and around the time of its public-market debut.\n  It’s a  theme we’ve touched on before, but a recent repricing of the entire technology market makes the point once again.\n There’s more to the matter than just Coinbase, however, even though it’s curious that it appears to be valued on a  profit multiple today more than a  revenue multiple. The surge in SaaS valuations has come back to Earth, with Altimeter Capital’s  Jamin Ball reporting this week that “high growth software revenue multiples have now normalized back to where they were pre-covid for the first time since the pandemic started.”\n The former venture capitalist also writes that the fastest-growing cohort has performed “worse than low and medium growth software” companies this year. It’s upside-down season in terms of what software companies are worth, with the growth premiums falling sharply.\n I think this is why we’re seeing reports that the late-stage capital cannons of 2021 are pulling back from such deals. Tiger, D1 and others were betting that they could flood the middle- and later-stage software markets with capital — and reap the rewards when their portfolios followed an open IPO window into welcoming public markets. If the IPO window had stayed open, and if software valuations hadn’t tumbled so sharply in just a few months, the strategy could have been incredibly accretive in the near term.\n The opposite happened, however. So where does that leave late-stage startups? In trouble, I reckon.\n Are they really in trouble, or are you just being pessimistic on a Friday, Alex?", "posttime": "2022-02-26 02:26:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "后期,stage,软件", "title": "今年后期初创公司的估值会受到影响吗？", "title_en": "\n\t\t\t\tAre late-stage startup valuations going to suffer this year?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/are-late-stage-startup-valuations-going-to-suffer-this-year/", "via": "", "real_tags": ["后期", "stage", "软件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "出生于意大利的格雷戈里奥·吉拉迪尼（Gregorio Gilardini）和来自西班牙的亚历杭德罗·加雷（Alejandro Garay）几年前在秘鲁相识，发现他们都有兴趣利用科技产生社会影响，帮助人们摆脱“贫困陷阱”\n他们于2018年成立了Leasy，其使命是帮助那些希望通过打招呼司机赚取收入的人能够买得起汽车，从而获得稳定的收入。传统金融机构收取极高的利率，并要求支付巨额首付，这使得低收入人群几乎不可能买得起自己的汽车。\n吉拉迪尼说，利马的Leasy不同，它的利率要低得多，条款要灵活得多。该公司声称，它提供的贷款是“围绕打车司机的需求”建立的，价格具有竞争力，与租赁市场价格相匹配。它还需要5%的首付，而大多数银行要求的首付比例为20%至30%。\n“这是大多数人没有的现金，”加雷说。“很多人每天都在生活，司机就像系统中的幽灵。”\n到目前为止，莱西还没有从秘鲁信贷银行（BCP）和三井汽车金融（MAF）获得信贷额度。创始人们说，他们很感激这两家公司，因为秘鲁的创业环境正在演变。\nMagma Partners引领了这轮种子投资，其他投资者包括IncaVentures、BuenTrip Ventures、GRAM、Otto Holdings和Nucleus EMV等。它也是奋进ScaleUp计划的一部分。该公司寻求资本是因为它意识到“需要以更快的速度扩大规模”\n令人印象深刻的是，Leasy已经盈利了，这意味着净收入和EBITDA都是积极的，因为它的第一个月的运行，根据Gilardini，收入增长170%，2021，比2020。吉拉迪尼说，在筹款过程中，这种积极的现金状况是很有价值的，因为它使团队能够协商良好的条件。\n他补充说：“在一个风投投资仍有很多改进余地的地区，我们对融资需要多长时间没有太多的了解，也承受不起资金在任何时候耗尽。”。\n在出发时，这对夫妇感到惊讶的是，这么多叫车司机都在租车，因为他们没有资格获得汽车融资。对许多人来说，这是进入他们想要的就业市场的唯一途径。虽然Leasy从租赁开始，并说服EuroRenting（一家类似赫兹的公司）成为其第一个试点，但他们最终考虑通过订阅模式向汽车融资过渡。\n这项业务的结构旨在使出租车司机为汽车融资变得简单，交易中包括保险和“简单”的支付流程。灵活的条款也可以减轻一些压力。加雷指出，例如，如果一名司机决定要搬到另一个城市，不再需要车辆，他们可以将车辆归还给Leasy，而无需罚款。\n吉拉迪尼告诉TechCrunch，就其技术而言，它从一开始就“相当发达”。\n“当我们进入这个领域时，我们知道我们需要一些可扩展的东西，”他说。“我们还认识到，在信贷方面，我们在一个非常规避风险的地区开展业务，我们必须证明我们是如何降低与银行无法为其提供银行服务相关的各种风险的。这实际上迫使我们从一开始就将所有技术降到了T级。”\n其针对司机的应用程序旨在对他们的付款方式和需要付款的时间提供完全透明。\n吉拉迪尼解释说：“这有点像是创建了一个生态系统，并与司机建立了联系，让他们感觉自己拥有了全天候的支持。”。\n2019年，Leasy与优步合作，寻找潜在的驱动程序，与之合作并收集数据。它有选择性地为谁提供资金，而且由于它通过其API与优步相连，Leasy能够进行背景调查，审查历史驾驶记录，以及他们是否拿到了罚单。\nLeasy计划利用内部收集的数据建立预测分析模型，以估计人们最有可能违约的时间。在消费者方面，他们可以提供关于他们的驾驶状况、他们有多少燃料以及他们在燃料上花了多少钱的见解。\n“这有助于他们保持一种分类账，确保他们拥有做好工作所需的所有信息，并且比融资提前两步，”他补充道。\n事实上，Garay告诉TechCrunch，到目前为止，Leasy已经出现了1%的流失或违约。\n“与银行相比，我们非常灵活，希望他们成功，”他说。“如果他们发生车祸，10天内不能工作，我们不向他们收费。”\n到目前为止，这家初创公司已经签署了370多份贷款合同，有1500多人在等待。这些资金将用于帮助该公司，并帮助其走出其祖国秘鲁，从墨西哥开始，然后扩展到哥伦比亚和智利等市场。\nMagma Partners的内森·卢斯蒂格（Nathan Lustig）认为，Leasy解决了拉丁美洲人的一个“真正问题”，他们正试图获得对许多人来说是他们最大资产的东西。\n他说：“汽车可以帮助拉丁美洲人进入中产阶级，车主可以用它为他们的家庭创造最高30%的收入。”。“传统金融机构忽视了大量拉丁美洲人。”\nLustig补充道，这家初创公司的“优秀”技术、分销、客户服务和收藏，加上其“非常强大”的部门经济效益，使其成为一项极具吸引力的投资。\n“他们符合成功创业者的模式，他们从秘鲁、厄瓜多尔、智利和乌拉圭等拉丁美洲被忽视的市场起步，很可能成功地将业务扩展到拉丁美洲更大的国家，”他说。\n去年8月，TechCrunch报道了巴西初创公司Kovi的1.04亿美元融资，该公司对Leasy也有类似的使命。\n它也采用了汽车订购模式，前提是如果拉丁美洲有更多的人能够负担得起运营所需车辆的费用，他们就会为出租车公司工作。", "note_en": "Italian-born Gregorio Gilardini and Alejandro Garay, who hails from Spain, met in Peru several years ago and discovered they both had an interest in using technology to make a social impact and help people escape “the poverty trap.”\n They founded Leasy in 2018 with the mission to help people who would like to earn incomes as ride-hailing drivers be able to afford cars, thus earning a steady income. Traditional financial institutions charge outrageous interest rates and require hefty down payments, making it nearly impossible for members of a lower-income population to afford to purchase their own car.\n  Lima-based  Leasy is different, said Gilardini, in that its interest rates are far lower and terms much more flexible. It claims that it offers loans that are “built around the needs” of a ride-hailing driver at competitive prices that match rental market prices. It also requires a down payment of 5%, compared to the 20% to 30% required by most banks.\n “That’s an amount of cash that most people don’t have,” Garay said. “A lot live day to day and drivers are like ghosts in the system.”\n Until now, Leasy was bootstrapped outside of credit lines from   Banco de Credito del Peru  (BCP) and   Mitsui Auto Finance  (MAF) – which the founders say they are grateful for because the startup scene in Peru is an evolving one.\n Magma Partners  led its seed round, and other investors include IncaVentures, BuenTrip Ventures, GRAM, Otto Holdings and Nucleus EMV, among others. It is also part of the Endeavor ScaleUp program. The company sought capital because it realized it “needed to scale with more speed.”\n  Impressively, Leasy has been profitable — and that means both positive net income and EBITDA positive —  since its first month of operation, according to Gilardini, and saw revenue growth of 170% in 2021 compared to 2020. That positive cash position was valuable during the fundraising process, said Gilardini, because it allowed the team to negotiate good terms.\n “Coming out of a region where VC investment still has a lot to improve upon, we didn’t have much visibility on how long fundraising would take and couldn’t afford to run out of cash at any point,” he added.\n When starting out, the pair was surprised that so many drivers for ride-hailing vehicles were renting because they could not qualify for car financing. For many, it was the only way to be able to have access to the job market they wanted to pursue. And while Leasy started out with rentals and convinced EuroRenting (a Hertz-like company) to be its first pilot, they eventually considered transitioning into car financing with a subscription model.\n The structure of the business is designed to make it uncomplicated for ride-hailing drivers to finance a car, with insurance included in the transaction and a “simple” payments process. Flexible terms also take some pressure off. For example, if a driver decides they want to move to another city and no longer need the vehicle, they can return the car to Leasy with no penalty, noted Garay.\n  In terms of its technology, Gilardini told TechCrunch it has been “quite developed” since the beginning.\n “When we went into this, we knew we needed something that was going to be scalable,” he said. “We also recognized we were operating in a very risk-averse region when it comes to credit and that we had to prove how we were mitigating the various risks associated with banking an unbankable person. This actually forced us to have all of our technology down to a T since the beginning.”\n Its app for drivers is designed to provide full transparency on how their payments are going and when they need to pay.\n “It’s kind of like creating this ecosystem and connection with the drivers so that they feel like they have that support 24/7,” explained Gilardini.\n In 2019, Leasy partnered with Uber to find potential drivers to work with and gather data. It is selective in who it finances, and since it is connected to Uber through its APIs, Leasy is able to do background checks and review historical driving and whether they’ve gotten tickets.\n Leasy plans to use the data it has collected internally for a predictive analytic model to estimate when people are most likely to default. On the consumer side, they can provide insight on how well they’re driving, how much fuel they have and how much money they’re spending on fuel.\n “It’s helping them keep a kind of ledger and make sure they have all the information they need to do a good job and are two steps ahead of their financing,” he added.\n In fact, Garay told TechCrunch that Leasy so far has seen 1% churn, or defaults.\n “We’re very flexible compared to a bank, and want them to succeed,” he said. “Say they get in a car accident and can’t work for 10 days, we don’t charge them for that time.”\n So far, the startup has underwritten over 370 loan contracts and has a waiting list of over 1,500 people. The funds will be used to help the company and aid it in expanding out of its home country of Peru, starting with Mexico and then to markets like Colombia and Chile.\n Magma Partners’ Nathan Lustig believes Leasy is solving a “real problem” for Latin Americans who are trying to get access to what is for many their biggest asset.\n “A car can help bring Latin Americans into the middle class, and a car owner can use it to generate top 30% incomes for their families,” he said. “Traditional financial institutions overlook huge swathes of Latin Americans.”\n The startup’s “great” technology, distribution, customer service and collections combined with its “very strong” unit economics made it an attractive investment, Lustig added.\n “They fit the pattern of successful founders who start out in Latin America’s overlooked markets like Peru, Ecuador, Chile and Uruguay who are likely to have success expanding to Latin America’s bigger countries,” he said.\n Last August, TechCrunch reported on the   $104 million raise  of Brazilian startup Kovi, which has a similar mission to Leasy.\n It too operates a car  subscription model under the premise that more people in Latin America would work for ride-hailing companies if they could afford to operate the necessary vehicle.", "posttime": "2022-02-26 02:21:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,startup,leasy", "title": "秘鲁初创公司Leasy获得1700万美元的债务和股权，为拉谭的打车司机提供汽车贷款", "title_en": "\n\t\t\t\tPeruvian startup Leasy secures $17M in debt, equity to provide auto loans to LatAm ride-hailing drivers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/peruvian-startup-leasy-secures-17m-in-debt-equity-to-provide-auto-loans-to-ride-hailing-drivers-in-latam/", "via": "", "real_tags": ["初创", "startup", "leasy"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多企业，如Salesforce和微软，都在资助在野火烧痕和农田种植树木。但是隐形阶段的创业公司Underet正在为重新造林开辟一个全新的领域。\n正如你可能从名字中猜到的，该公司专注于在沙漠中植树，特别是在新墨西哥州阿拉莫戈多地区的沙漠灌木丛中。Unesert的首席执行官尼古拉斯·西特（Nicholas Seet）称他的公司为“气候分类”——在世界其他地区迎头赶上的同时，现在正在做一些减少排放的事情。\n新墨西哥州立大学植物与环境科学系旱地生态学教授尼尔·哈南（Niall Hanan）说：“为了缓解全球气候变化，旱地是否适合重新造林，目前存在一场辩论。”。\nSeet称灌木丛为“未充分利用的空旷空间”，但哈南强调，这些是具有自身生物多样性的有效古代生态系统，而不仅仅是退化的森林。沙漠没有树木是有原因的。\n哈南说：“如果（沙漠）适合树木生长，它们可能会有树木。”。树木需要阳光、二氧化碳和水才能生存。沙漠严重缺乏这些成分之一，使大多数树木无法自然生长。但这是Undesert创新的一个问题。\nUndesert已经调整了一种海水淡化技术，这样它可以每24小时产生20升水，并且可以处理以前对反渗透来说太咸的盐水。\nSeet说：“反渗透技术的问题是，它含有大量无法再过滤的废盐水。”。“我们可以通过我们的系统提取反渗透盐水，然后得到纯净水和盐。”\nUndesert消除了传统太阳能温室海水淡化技术的瓶颈，在这种技术中，太阳会加热蒸发的咸水池，以产生在温室顶部冷凝的纯净水。Undesert开发了一种模块化设计来捕获水，并能够将效率提高五倍于水池蒸发。冷凝不是发生在屋顶上，而是发生在一个单独的腔室中，由管道和循环冷却水冷却。在这个系统中，超过93%的盐水被回收为清水。整个过程在微电网中使用太阳能，从而降低排放。\nUndesert正在与纳瓦霍国家合作，为其脱盐技术寻找咸水来源。由于盐浓度过高，咸水已无法饮用。然后，该公司使用滴灌为阿富汗松树提供脱盐水，Underet公司已决定将这些树用于重新造林。到目前为止，该公司已经种植了其中16棵树。Underet选择阿富汗松是因为它在沙漠中耐寒，需要很少的水，生长速度快，又高又直。该公司的浇水系统下还有50棵黄松，因为它的生根系统能够很好地抵御干旱。但是，即使树木获得了足够的水分，也有其他环境因素，比如温度，会阻碍幼苗的存活。\n据Undesert介绍，太阳能淡化水供应的小规模示范项目自2021年9月起运行，呈现出健康发展态势。该地区有大量的太阳能和可用的地下咸水。而示威活动所在的阿拉莫戈多地区毗邻萨克拉门托护林区，那里有道格拉斯冷杉和黄松森林，在被移走用于火车轨道和维护之前，还有更多森林。所有这些因素都让Undesert相信他们的树会成功。\n但还有可伸缩性。拥有一个大型森林的完整灌溉系统是不可行的。在新墨西哥州，使用微咸水或许可行，但哈南指出，大多数沙漠都不靠近海洋，也没有容易获得的地下水。成本、劳动力和维护费用也将迅速增加。根据哈南的说法，即使仅仅是这些树，每平方英里的成本也可能高达100万美元，即使每棵幼苗的成本只有10美元。全球大多数沙漠居民都无法获得此类资金。\n哈南在一封电子邮件中写道：“即使是第一公顷土地也很难获得400美元。”。“西南部（甚至美国西部）的苗圃产业不太可能提供每平方英里所需的10万棵幼苗，更不用说更大的面积了。”\n“在像美国西南部这样一个严重缺水的地方，”新墨西哥大学的森林和火灾生态学教授Matthew Hurteau说，“如果你有一项技术，以相当低的成本和低碳的方式净化水，在沙漠中种植树木是最好的利用水的方法吗？”\n减少碳排放并通过植树为当地社区提供共同利益可能是对这种水的一种非常有价值的利用，但哈南和胡图等专家预计将看到一份详细的成本效益分析，以回答以下问题：\n储存的碳真的足以缓解我们的碳问题吗？哈南对此持怀疑态度，因为生长在沙漠中的树木肯定不会像热带雨林中的大树那样高大，而且可能只有生物量的一小部分。沙漠中的树木可能永远不会成为地球的肺，但在这个过程中，它们是否可以或应该是一种微小的吸入物？", "note_en": "Many businesses like  Salesforce and  Microsoft are funding the planting of trees in wildfire burn scars and agricultural lands. But the stealth-phase startup  Undesert is working on a whole new frontier for reforestation.\n As you can probably guess from the name, the company is focused on planting trees in deserts, specifically desert shrublands in the Alamogordo region of New Mexico. Nicholas Seet, CEO of Undesert, calls his company “climate triage” — doing something to reduce emissions now while the rest of the world catches up.\n   “There is a current debate about whether drylands are suitable for reforestation for the purpose of global climate mitigation purposes,” said Niall Hanan, professor of dryland ecology in the Plant and Environmental Sciences Department at New Mexico State University.\n Seet called the shrublands “underutilized, empty space,” but Hanan stressed that these are valid ancient ecosystems with their own biodiversity, not simply degraded forests. And there’s a reason deserts don’t have trees.\n “If [deserts] were suitable for trees they would probably have trees in them,” Hanan said. Trees need sun, CO 2 and water to survive. Deserts drastically lack one of those ingredients, preventing most trees from growing naturally. But that’s one problem Undesert has innovated around.\n  Undesert has tweaked a water desalination technology so it can generate 20 liters of water per 24-hour period and can work with brine water previously too salty for reverse osmosis.\n “The problem with [reverse osmosis] technology is it has a lot of waste brine that cannot be filtered anymore,” Seet said. “We can take reverse osmosis brine through our system and then you get pure water and salt.”\n Undesert removed bottlenecks from a traditional solar-greenhouse desalination technology where the sun warms a salty pool vaporizing to create pure water that condenses on the roof of the greenhouse. Undesert developed a modular design to capture the water and was able to increase efficiency by five times that of pool evaporation. Instead of condensing on the roof, condensation occurs in a separate chamber cooled by tubing with circulating cool water. In this system more than 93% of the water in the saline is recovered as clean water. The entire process uses solar in a microgrid making the process low in emissions.\n Undesert is working with Navajo nations to source for its desalination technology brackish groundwater that has become undrinkable due to salt concentration. The company then uses drip irrigation to supply the desalinated water to Afghan pines, the trees Undesert has decided to use in its reforestation. The company has planted 16 of these trees so far. Undesert chose the Afghan pine because it is desert hardy, requiring little water, and grows fast, tall and straight. The company also has 50 ponderosa pines under its watering system because its rooting system is well adapted to withstand drought. But even if the trees are getting a sufficient amount of water, there are other environmental factors like temperature that can hamper seedling survival.\n  According to Undesert, the small demonstration of trees supplied by the solar desalinated water has been operating since September 2021, and are showing healthy development. The area has intense solar energy and available underground saline water. And the Alamogordo region where the demonstration is located is adjacent to the  Sacramento Ranger District that has forests of Douglas fir and ponderosa pine and had many more before they were removed for train tracks and maintenance. All these factors give Undesert the confidence that their trees will be a success.\n But then there is the scalability. Having an entire irrigation system for a large-scale forest isn’t feasible. And using brackish groundwater might work in New Mexico, but Hanan noted that most deserts aren’t near oceans and don’t have easily accessible groundwater. Cost, labor and maintenance will also quickly add up. Even just the trees can end up costing $1 million per square mile, even if each seedling costs as little as $10, according to Hanan. Most desert inhabitants across the globe do not have access to these types of funds.\n  “Even getting 400 for the first hectare would likely be difficult,” Hanan wrote in an email. “It is unlikely that the southwest (or even the western US) tree nursery industry could supply the 100,000 seedlings needed per square mile, let alone for any larger area.”\n  “In a severely water-limited place, like the southwestern U.S.,” said Matthew Hurteau, a forest and fire ecology professor at the University of New Mexico, “if you’ve got the technology to fairly inexpensively and in a low carbon way purifying that water, is growing trees in the desert the best use of that water?”\n Drawing down carbon emissions and providing co-benefits to local communities by planting trees could be a very valuable use of this water, but experts like Hanan and Hurteau would expect to see a detailed cost-benefit analysis that answers questions like:\n  And will the carbon stored actually be enough to make a dent in our carbon problem? Hanan is skeptical because trees grown in the desert certainly won’t be the huge trees of the tropical rainforest, and will probably have a fraction of the biomass. Trees in the desert probably won’t ever be the lungs of the earth, but can or should they be a tiny inhale in the process?", "posttime": "2022-02-26 02:18:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "应对,trees,哈南", "title": "我们应该在沙漠中种树来应对气候变化吗？", "title_en": "\n\t\t\t\tShould we be growing trees in the desert to combat climate change?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/should-we-be-growing-trees-in-the-desert-to-combat-climate-change/", "via": "", "real_tags": ["应对", "trees", "哈南"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乌克兰计算机应急响应小组（CERT-UA）在Facebook上发布的一篇帖子中宣布了这一活动。该小组表示，一场大规模的网络钓鱼活动的目标是私人i.UA和meta。属于乌克兰军事人员的ua账户。\n它补充说：“在账户被破坏后，攻击者通过IMAP协议可以访问所有消息。”。“后来，攻击者使用受害者通讯簿中的联系方式发送网络钓鱼电子邮件。”\nCURT-UA将持续的运动归因于UNC1151威胁小组，该组织在2021年11月与白俄罗斯政府正式联系。Mandiant还将这个国家支持的网络间谍组织与“幽灵作家”虚假信息运动联系起来，该运动一直参与在欧洲各地传播反北约言论以及黑客和泄密行动。\nCERT-UA写道：“总部位于明斯克的“UNC1151”组织是这些活动的幕后黑手。其成员是白俄罗斯共和国国防部的官员。”。\n乌克兰国家安全和国防委员会副秘书Serhiy Demedyuk告诉路透社，基辅政府还认为，UNC1151组织是上周导致乌克兰政府网站瘫痪的网络攻击的幕后主使。乌克兰安全部门表示，事件中有70多个国家网站遭到攻击，其中10个受到未经授权的干扰。\nMandiant的本·里德（Ben Read）告诉TechCrunch，安全公司在过去两年中观察到UNC1151广泛针对乌克兰军队，“因此这一活动符合他们的历史模式。”\n雷德补充说：“我们认为，UNC1151的这些行动与白俄罗斯军方有关，这是令人担忧的，因为乌克兰公民和军方的个人数据在占领场景中可能会被利用，UNC1151利用其入侵为“幽灵作家”信息行动提供便利。”。“泄露来自乌克兰实体的误导性文件或伪造文件可能被用来宣传俄罗斯和白俄罗斯的友好故事。”\n里德说：“Ghostwriter此前曾以北约联盟为目标，试图削弱对该组织的支持。”。“如果在不久的将来看到类似的行动，我不会感到惊讶。”", "note_en": "Announcing the activity in a Facebook post, Ukraine’s Computer Emergency Response Team (CERT-UA) said that a mass  phishing campaign is targeting the private  i.ua and  meta.ua accounts belonging to Ukrainian military personnel.\n “After the account is compromised, the attackers, by the IMAP protocol, get access to all the messages,” it added. “Later, the attackers use contact details from the victim’s address book to send the phishing emails.”\n  CERT-UA has attributed the ongoing campaign to the UNC1151 threat group, which Mandiant formally linked to the Belarusian government in November 2021. Mandiant also linked the state-backed cyber-espionage group to the Ghostwriter disinformation campaign, which has been involved in  spreading anti-NATO rhetoric and hack-and-leak operations throughout Europe.\n “The Minsk-based group ‘UNC1151’ is behind these activities. Its members are officers of the Ministry of Defence of the Republic of Belarus,” CERT-UA wrote.\n  The Kyiv government also believes the UNC1151 group was behind the cyberattack that brought down Ukrainian government websites last week, Serhiy Demedyuk, the deputy secretary of the national security and defense council of Ukraine,  told Reuters. Ukraine’s security services said that more than 70 state websites were attacked during the incident, 10 of which were subjected to unauthorized interference.\n Mandiant’s Ben Read told TechCrunch that the security company has observed UNC1151 targeting the Ukrainian military extensively over the past two years, “so this activity matches their historical pattern.”\n “These actions by UNC1151, which we believe is linked to the Belarusian military, are concerning because personal data of Ukrainian citizens and military can be exploited in an occupation scenario and UNC1151 has used its intrusions to facilitate the Ghostwriter information operations campaign,” Read added. “Leaking misleading, or fabricated documents taken from Ukrainian entities could be leveraged to promote Russia and Belarus friendly narratives.”\n “Ghostwriter has previously targeted the NATO alliance, seeking to erode support for the organization,” said Read. “I wouldn’t be surprised if similar operations were seen in the near future.”", "posttime": "2022-02-26 02:16:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,俄罗斯,表示,belarusian,乌克兰", "title": "乌克兰表示，白俄罗斯黑客正在攻击其国防军", "title_en": "\n\t\t\t\tUkraine says Belarusian hackers are targeting its defense forces\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/belarus-hackers-ukraine/", "via": "", "real_tags": ["黑客", "俄罗斯", "表示", "乌克兰"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，在撰写本文时，这家电信行业机构仍打算允许俄罗斯人参加展会。\n俄罗斯在昨天凌晨入侵乌克兰后，参与MWC的部分活动受到GSMA的限制。\n在撰写本文时，据报道，俄罗斯坦克和武装部队正在逼近乌克兰首都基辅——此前，俄罗斯从空中、陆地和海上遭到炮击。\nGSMA的一位发言人拒绝具体说明是否所有俄罗斯公司，包括航空公司，都将被禁止参加MWC——这是指路透社早些时候报道的一份声明，其中称今年的活动不会有俄罗斯展馆。\n“GSMA将继续配合针对俄罗斯的国际制裁，”这位发言人补充说。\nGSMA强烈谴责俄罗斯入侵乌克兰。局势发展迅速，我们知道各国政府正在考虑对俄罗斯实施更广泛的制裁。鉴于这种新情况，并考虑到生命的悲惨损失，MWC在这种情况下似乎无关紧要。MWC是一个统一的活动，其愿景是召集移动生态系统，以改进连接可以确保人、行业和社会繁荣的方式和方法。\nGSMA遵循由此情况产生的所有政府制裁和政策。MWC22将没有俄罗斯馆。随着信息的出现，活动的安全性不断得到审查和调整。\n然而，更大的参展商——包括与俄罗斯有联系的公司，如telco VimpelCom——可能会向GSMA支付费用，以便独家占据展厅更重要的一块房地产。\n而且，除非制裁迫使GSMA采取行动，否则GSMA似乎不准备将这些更富有的俄罗斯公司拒之门外。\n欧洲理事会外交事务委员会（European Council of Foreign Affairs Council）目前正在开会，试图就针对俄罗斯的第二个制裁方案达成协议。欧盟主席昨日表示，该方案将针对俄罗斯经济的战略部门，包括获取“关键”技术。\n#FAC |欧盟外交部长今天将在布鲁塞尔举行会议，继续采取进一步的限制性措施，以应对俄罗斯&#39；俄罗斯对乌克兰的军事侵略。\n乌苏拉·冯·德·莱恩说：“我们想切断俄罗斯工业与当今建设未来所急需的技术的联系。”。“我们的措施将削弱俄罗斯在关键领域的技术地位，而这些领域实际上是精英们的主要收入来源。这些领域包括高科技组件和尖端软件。这也将严重削弱俄罗斯未来在所有领域的经济。”\nGSMA首席执行官约翰·霍夫曼（John Hoffman）今天在接受路透社（Reuters news agency）采访时证实，在欧洲爆发战争后，GSMA目前没有取消或推迟MWC的计划。\n关于制裁，霍夫曼表示，“少数”俄罗斯公司及其高管将被禁止，但拒绝提供姓名，称制裁名单正在演变。\n他补充说：“我们受到国际制裁的指导，制裁名单上列出了一些公司，这些公司将被禁止参与，”他说，GSMA将严格遵守美国和其他国家的制裁。\n美国已经宣布了一系列制裁措施，其中包括严格的出口限制，并表示这将削减俄罗斯获得全球技术的机会。\n据路透社报道，美国商务部宣布的控制措施依赖于“外国直接产品规则”（FDPR）的大幅扩大，并将迫使使用美国工具在海外生产高技术和低技术产品的公司在运往俄罗斯之前，先向美国申请许可证。\n然而，也有一些消费品，如家用电子产品、人道主义物品和飞行安全所需的技术。\n路透社还报道称，根据制裁，手机等消费通信设备只要不发送给俄罗斯政府雇员或某些附属机构，就可以使用。\n回到MWC，电信展无疑在最近几年经历了艰难的运行。\n会议在2020年2月欧洲2019冠状病毒疾病爆发后完全取消。\n虽然2021版推迟到夏季，而不是采取通常的早春时隙，随着大流行挥之不去的人出席的事件大大减少前大流行年。\n与MWC 2021一样，今年的会议也将作为一个混合节目提供，既有人流又有流会话。\nGSMA表示，预计将有来自183个国家的1800多家参展商和与会者参加今年的活动。", "note_en": "However, at the time of writing, the telco industry body is still intending to allow Russian presence at the show.\n Russia’s participation at MWC is being partially restricted by the GSMA following the country’s invasion of Ukraine early yesterday morning.\n  At the time of writing, Russian tanks and armed forces are reported to be closing in on Ukraine’s capital Kiev — following earlier artillery bombardments hammering the country from air, land and sea.\n A spokesman for the GSMA declined to specify whether all Russian companies, including carriers, would be banned from attending MWC — pointing to a statement reported earlier by  Reuters in which it says there would be no Russian pavilion at this year’s event.\n “The GSMA will continue to cooperate with international sanctions against Russia,” the spokesman added.\n  The GSMA strongly condemns the Russian invasion of Ukraine. The situation is fast-moving, and we understand that various governments are considering broader sanctions against Russia. In light of this emerging situation and considering the tragic loss of life, MWC seems immaterial under the circumstances. MWC is a unifying event with a vision to convene the mobile ecosystem to progress ways and means that connectivity can ensure people, industry, and society thrive.\n The GSMA follows all government sanctions and policies resulting from this situation. There will be no Russian Pavilion at MWC22. Security for the event is constantly reviewed and adjusted as information emerges.\n  However larger exhibitors — including companies with Russian links, such as telco VimpelCom — may pay the GSMA to exclusively occupy a more prime chunk of real estate on the show floor.\n And it appears the GSMA is not prepared to shut out these wealthier Russian companies unless sanctions force its hand.\n The European Council’s Foreign Affairs Council is currently meeting to try to secure agreement on a second sanctions package targeting Russia — which the bloc’s president  said yesterday would target strategic sectors of its economy, including access to “crucial” technologies.\n #FAC | EU foreign affairs ministers will meet in Brussels today to proceed with the adoption of further restrictive measures in response to Russia&#39;s military aggression against Ukraine.\n “We want to cut off Russia’s industry from the technologies desperately needed today to build a future,” said Ursula von der Leyen. “Our measures will weaken Russia’s technological position in key areas, actually from which the elite makes most of their money. And this ranges from high-tech components to cutting-edge software. This will also seriously degrade the Russian economy in all areas in the future.”\n In an interview with  the Reuters news agency today, the GSMA’s CEO John Hoffman confirmed it currently has no plans to cancel or postpone MWC following the outbreak of war in Europe.\n On sanctions Hoffman said “a handful, a few” Russian companies and their executives would be banned — but declined to provide names, saying sanctions lists were evolving.\n “We are guided by the international sanctions and there are some companies that are identified on the sanction list and those will be barred from participating,” he added, saying the GSMA would strictly follow U.S. sanctions as well as others.\n The U.S. has  already announced a package of sanctions that includes tough export curbs, which it said would slash Russia’s access to global technologies.\n Per  Reuters, the controls announced by the U.S. Commerce Department rely on a dramatic expansion of the “Foreign Direct Product Rule” (FDPR) — and will force companies making high- and low-tech goods overseas with U.S. tools to seek a license from the U.S. before shipping to Russia.\n However there are carveouts for consumer items such as household electronics, humanitarian goods and technology necessary for flight safety.\n Reuters also reports that consumer communications devices, such as mobile phones, are permitted under the sanctions as long as they are not sent to Russian government employees or certain affiliates.\n Returning to MWC, the telco tradeshow has undoubtedly had a difficult run in recent years.\n The conference was cancelled entirely in  February 2020 following the outbreak of the COVID-19 pandemic in Europe.\n While the 2021 edition was  delayed until the summer, rather than taking up its usual early spring slot, as the pandemic lingered — in-person attendance at the event was drastically reduced versus pre-pandemic years.\n As with MWC 2021, this year’s conference is being offered as a hybrid show, with both in-person and streamed sessions available.\n The GSMA says it’s expecting more than 1,800 exhibitors and attendees from 183 countries at this year’s event.", "posttime": "2022-02-26 02:11:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,bar", "title": "MWC将禁止一些俄罗斯公司参加下周的展会", "title_en": "\n\t\t\t\tMWC to bar some Russian companies from next week’s show\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/25/mwc-2022-limits-russia/", "via": "", "real_tags": ["俄罗斯", "bar"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国情报机构已要求欧洲最大的加密货币交易所Bitstamp交出至少部分客户的信息。这条新闻表明，比特币和其他加密货币正在被用于严重的有组织犯罪和恐怖主义，以及国内犯罪。\n安全局（又称军情五处）负责防止英国境内的恐怖主义和间谍活动，而秘密情报局（俗称军情六处）则负责外国情报。这两个组织都不应对普通犯罪，除非有…", "note_en": "The UK’s intelligence agencies have asked Europe’s largest cryptocurrency exchange, Bitstamp, to hand over information on at least some of its customers. The news suggests that bitcoin and other cryptocurrencies are being used in serious organised crime and terrorism, as well as domestic crime.\n The Security Service, also known as MI5, is responsible for preventing terrorism and espionage within the UK, while the Secret Intelligence Service, commonly known as MI6, is tasked with foreign intelligence. Neither organisation tackles ordinary crime, unless there is a …", "posttime": "2022-02-26 02:08:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,情报机构,intelligence,犯罪", "title": "英国情报机构正在调查加密货币交易", "title_en": "UK Intelligence Agencies Are Investigating Cryptocurrency Transactions", "transed": 1, "url": "https://www.newscientist.com/article/2308969-uk-intelligence-agencies-are-investigating-cryptocurrency-transactions/", "via": "", "real_tags": ["交易", "情报机构", "犯罪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075045, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的卫星图像分析显示，南极洲周围的海冰已达到40年来的最低记录。\n根据科罗拉多州博尔德的国家冰雪数据中心的分析，截至周二，南极海岸的冰雪覆盖面积为75万平方英里，低于2017年3月初81.5万平方英里的历史新低。\n“这真的是史无前例的，”洛杉矶加利福尼亚大学的地理教授Marilyn N. Raphael说，他研究南极海冰。她说，海洋温度升高可能起到了一定作用，“但我们将在未来几个月努力找出其他因素。”\n南极海冰的范围每年变化很大，但自20世纪70年代末卫星观测开始以来，平均而言，总体上略有增加。相比之下，北极的海冰面积在同一时期减少了10%以上。北极的海冰变暖速度大约是其他地区的三倍。\n这两个地区非常不同。北冰洋覆盖高纬度地区，包括北极本身，并被陆地包围。在南半球，南极洲覆盖着南极。环绕该大陆的南大洋始于低纬度地区，向北开放。\n虽然北极地区的快速变暖在很大程度上导致了那里海冰的缩小，但气候变化对南极海冰的影响远不那么明显。\n华盛顿大学气候科学家Edward Blanchard Wrigglesworth说，许多科学家预计全球变暖最终会导致南极海冰的下降。但现在，他说，“很难把这两者联系起来，尤其是像这样的单一事件。”\n相反，当涉及南极海冰时，一组复杂的因素在起作用。通常发生在远离大陆的大规模大气模式，以及当地洋流和风，都会增加或减少海冰覆盖。\n例如，布兰查德·赖格尔斯沃思博士说，一些研究表明，2015年和2016年的强烈厄尔尼诺现象导致2016年的海冰覆盖率急剧下降，当时热带太平洋的海面温度高于正常水平。\n科罗拉多大学地球科学和观测中心的高级研究员Ted Scambos在一封电子邮件中说，南极洲周围一些地区比正常的海平面温度更高，可能在当前的最低气温中起了一定的作用。\n拉斐尔博士说，风可能也有影响，尤其是在大陆西侧的阿蒙森海地区。她说，一个经常在海上形成的低压空气区域今年特别强，这导致了更强的风，可能会把更多的冰带到更远的北方，进入更温暖的水域，在那里融化得更快。\n尽管自20世纪70年代末以来，海冰的总面积仅略有增加，但2000年开始加速增加，2014年达到了创纪录的高度。但后来发生了意想不到的事情，拉斐尔博士说。在接下来的三年里，它急剧下降，在2017年达到历史新低。\n4张牌中的第1张世界着火了。联合国的一份报告得出结论，到本世纪末，世界各地发生毁灭性野火的风险可能会增加57%，因为气候变化进一步加剧了该文件作者所说的“全球野火危机”\n融化了。一项新的卫星图像分析显示，南极洲周围的海冰已达到40年来的最低记录。虽然海洋温度升高可能起到了一定作用，但气候变化对南极海冰的确切影响仍不清楚。\n严重干旱和海平面上升。美国西南部的一场严重干旱已经变得非常严重，现在是该地区1200年来最干旱的22年。科学家还警告说，到2050年，美国沿海海平面将平均上升约一英尺或更高。\n耗尽水源。世界冰川的含水量可能比之前认为的要少，这表明，对于全世界数百万依赖冰川融水饮用水、作物灌溉和日常使用的人来说，淡水供应可能比预期的更快达到峰值。\n拉斐尔博士说，从那时起，海冰面积反弹，到2020年恢复到大致平均水平。\n她说，通常情况下，在接下来的几年里，水平将继续保持在平均水平或高于平均水平。但今年新的大幅下跌发生得更快。“事情发生得太快了，”她说。\n“这就是这一次与众不同的原因，”她补充道。2017年后，“冰层恢复正常，但没有保持这种状态。”\n布兰查德·赖格尔斯沃斯博士说，为了理解为什么现在冰的范围如此之小，研究人员必须研究去年的情况可能发生了怎样的变化。他说：“如果我们发现这是过去三到六个月风向变化的结果，我不会感到惊讶。”。\n在南极半岛以东的威德尔海，低海冰的范围很明显，由于其环流，每年比南极海岸的其他部分保留更多的冰。本月，一群科学家和探险家冒险入海寻找厄内斯特·沙克尔顿（Ernest Shackleton）的船“耐力号”的残骸时，遇到了相对温和的冰况。该船在1915年的一次南极考察中沉没。\n根据天气的不同，今年的冰层范围可能会下降得更低，但随着南极秋季和冬季气温开始下降，冰层范围很快就会开始增加。每年9月底左右，冰川覆盖率达到最大值。四十年来的平均最大面积超过700万平方英里。\nBlanchard Wrigglesworth博士说，像这样的事件和之前的创纪录低点为研究人员提供了一个更好地理解气候变化和南极洲海冰之间关系的机会。“一个有效的新研究问题可能是，这些是开始扭转长期趋势的最初几个迹象吗？”他说。", "note_en": "Sea ice around Antarctica has reached a record low in four decades of observations, a new analysis of satellite images shows.\n As of Tuesday, ice covered 750,000 square miles around the Antarctic coast, below the previous record low of 815,000 square miles in early March 2017,  according to the analysis by the National Snow and Ice Data Center in Boulder, Colo.\n “It’s really unprecedented,” said Marilyn N. Raphael, a professor of geography at the University of California, Los Angeles, who studies Antarctic sea ice. Warmer ocean temperatures may have played a role, she said, “but there are other factors that we will be working on finding out in the next months.”\n Antarctic sea ice extent is highly variable from year to year, but overall has increased very slightly, on average, since the late 1970s, when satellite observations began. By contrast, sea ice extent in the Arctic, which is warming about three times as fast as other regions, has decreased by more than 10 percent a decade over the same period.\n  The two regions are very different. The Arctic Ocean covers high latitudes, including the North Pole itself, and is hemmed in by land masses. In the Southern Hemisphere, Antarctica covers the pole. The Southern Ocean, which surrounds the continent, begins at much lower latitudes and is open to the north.\n While rapid warming in the Arctic is largely responsible for the shrinking of sea ice there, the effect of climate change on Antarctic sea ice is far less clear.\n Edward Blanchard-Wrigglesworth, a climate scientist at the University of Washington, said that many scientists expect that global warming will eventually lead to declines in Antarctic sea ice. But right now, he said, “it’s really hard to connect the two, especially in terms of single events like this one.”\n Instead, a complex group of factors is at play when it come to Antarctic sea ice. Large-scale atmospheric patterns, often occurring far from the continent, as well as local ocean currents and winds can all increase or reduce sea-ice coverage.\n  For instance, Dr. Blanchard-Wrigglesworth said, some research suggests that a strong El Niño in 2015 and 2016, when sea surface temperatures in the tropical Pacific were higher than normal, led to sharply lower sea ice coverage in 2016.\n Ted Scambos, a senior researcher at the Earth Science and Observation Center at the University of Colorado, said in an email message that warmer than normal sea-surface temperatures in some areas around Antarctica may have played a role in the current minimum.\n And Dr. Raphael said winds may also have had an effect, especially in the area of the Amundsen Sea on the continent’s western side. A region of low pressure air that regularly develops over the sea was especially strong this year, she said, and that resulted in stronger winds that may have driven more ice farther to the north, into warmer waters where it would melt faster.\n  While overall sea ice extent has only slightly increased since the late 1970s, the rate of increase began to accelerate in 2000, and ice extent reached a record high in 2014. But then something unexpected happened, Dr. Raphael said. It dropped drastically over the next three years, reaching the record low in 2017.\n Card 1 of 4 A world on fire.  A United Nations report has concluded that the risk of devastating wildfires around the world could  increase by up to 57 percent by the end of the century, as climate change further intensifies what the authors of the document described as a “global wildfire crisis.”\n Melting away.  Sea ice around Antarctica  has reached a record low in four decades of observations, a new analysis of satellite images shows. While warmer ocean temperatures may have played a role, the precise effect of climate change on Antarctic sea ice remains unclear.\n A megadrought and rising sea levels.  An  intense drought in the American Southwest has become so severe that it’s now the driest 22-year period in the region in 1,200 years. Scientists are also warning that  coastal sea levels in the U.S. will rise by about a foot or more on average by 2050.\n Depleting water supplies.  The world’s glaciers may  contain less water than previously believed, suggesting that freshwater supplies could peak sooner than anticipated for millions of people worldwide who depend on glacial melt for drinking water, crop irrigation and everyday use.\n Since then sea ice extent rebounded, Dr. Raphael said, returning to roughly average levels by 2020.\n Normally, she said, levels would then have continued to be average or above average for several years. But the new sharp drop this year occurred sooner. “It happened so quickly,” she said.\n “That’s what makes this one unusual,” she added. After 2017, “the ice went back to normal but didn’t stay that way.”\n  Dr. Blanchard-Wrigglesworth said that to understand why the ice extent is so low now, researchers will have to examine how conditions might have shifted last year. “I wouldn’t be surprised if we find out that this is the result of changes in winds over the last three to six months,” he said.\n The low sea ice extent has been noticeable in the Weddell Sea, east of the Antarctic Peninsula, which because of its circular current retains much more ice from year to year than the other parts of the Antarctic coast. A group of scientists and explorers encountered relatively mild ice conditions while venturing into the sea this month  in search of the wreck of Endurance, Ernest Shackleton’s ship, which sank during an Antarctic expedition in 1915.\n  This year’s ice extent could dip even lower, depending on the weather, but should soon start increasing as temperatures begin to drop heading into the Antarctic fall and winter. Ice coverage reaches a maximum each year around the end of September. The average maximum over four decades is more than 7 million square miles.\n Dr. Blanchard-Wrigglesworth said that events like this one and the previous record low offered researchers an opportunity to better understand the connection between climate change and sea ice in Antarctica. “A valid new research question might be, are these the first few indications that there is starting to be a reversal in the long-term trends?” he said.", "posttime": "2022-02-26 02:04:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "达到,ice,可能", "title": "南极洲周围的海冰达到历史新低", "title_en": "Sea Ice Around Antarctica Reaches a Record Low", "transed": 1, "url": "https://www.nytimes.com/2022/02/23/climate/antarctica-sea-ice-arctic.html", "via": "", "real_tags": ["达到", "ice", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冬天刚过，北半球的动物就更容易受到酷热的影响\n研究表明，小行星撞击地球对恐龙来说是灾难性的，但撞击的季节可能大大提高了其他物种的灭绝率。\n科学家发现证据表明，6600万年前的毁灭性撞击发生在北半球的春天，当时地球物种灭绝了四分之三，并在现代墨西哥形成了奇克苏卢布陨石坑。\n这个时间安排意味着，赤道以北的许多动物在刚刚度过严冬的几个月后，将特别容易受到碰撞释放的强烈热浪的影响。考虑到现在是秋天，南方的其他动物可能会过得更好，尤其是如果它们蜷缩在洞穴里。\n小行星的直接撞击引发了一场极端的全球热浪，对许多暴露在外的动物来说都是致命的。之后，人们认为，在核冬天，气温骤降，导致更多物种灭绝。\n瑞典乌普萨拉大学的古生物学家梅勒妮·杜林说：“要想战胜核冬天，首先必须在实际的撞击中生存下来。”。“南半球任何已经避难的生物都有更好的生存机会。”\n当小行星撞击地球时，它将熔融的岩石喷射到太空中，这些岩石在同一天结晶并以“撞击球体”的形式返回地球。科学家们在北达科他州一个名为塔尼斯的化石遗址出土的白鲟和鲟鱼化石的鳃中发现了其中一些球状体。\n化石周围发现了更多的球状物，这表明鱼类死亡时，玻璃状颗粒仍在下落，将死亡时间与撞击的当天，甚至可能是一小时联系在一起。这些鱼似乎是在被碰撞中摇动的沉淀物活埋时死亡的。\n科学家们在《自然》杂志上发表文章，描述了他们如何确定鱼类骨骼生长率的季节性周期，以及与浮游动物丰度的季节性变化有关的碳同位素变化，浮游动物是鱼类的主要食物。这些发现都指向鱼类在春季死亡——以及小行星碰撞。十二月，Prof Phillip Manning在曼彻斯特大学发表的关于化石的独立研究也得出了类似的结论。\n然而，目前尚不清楚北半球的小动物是否真的比南半球的小动物更糟糕。乌普萨拉大学（Uppsala University）最新研究的合著者丹尼斯·沃顿（Dennis Voeten）表示，有证据表明北半球的海龟在小行星撞击中灭绝，之后它们的栖息地被来自南方的海龟重新占据。\nDaniel Field博士是剑桥大学脊椎动物古生物学的助理教授，他没有参与这项研究，他说，北半球的动物受到灾难的打击更为“可信”。\n他说：“如果这颗小行星撞击了北半球许多生物一年中的一个生物敏感点，那么它可能会导致灭绝率上升，甚至比预期的要高。”。\n但他补充说，没有比家猫大得多的东西能在小行星撞击中幸存下来，而且许多物种在撞击时都会遭到毁灭。“大型非鸟类恐龙可能已经灭绝，无论小行星在一年中什么时候撞击，”他说。", "note_en": "Animals in northern hemisphere would have been more vulnerable to intense heat just after winter\n    Having an asteroid slam into Earth was catastrophic for the dinosaurs, but the season of the strike may have substantially ramped up extinction rates for others species, research suggests.\n Scientists have found evidence that the devastating impact 66m years ago, which wiped out three-quarters of Earth’s species and created the Chicxulub crater in modern-day Mexico, happened in the spring in the northern hemisphere.\n  The timing means that many animals north of the equator would have been particularly vulnerable to the intense heatwave unleashed by the collision, having just emerged from the harsh months of winter. Other animals in the south may have fared better given that it was autumn, especially if they were hunkering down in burrows.\n  The direct hit from the asteroid triggered an extreme global heatwave that proved lethal for many exposed animals. In the aftermath, temperatures are thought to have plummeted in a nuclear winter that drove many more species to extinction.\n “To be able to fight that nuclear winter, you first had to survive the actual impact,” said Melanie During, a palaeontologist at Uppsala University in Sweden. “Anything in the southern hemisphere already sheltering had a much better chance of surviving.”\n When the asteroid hit, it blasted molten rock into space, which crystallised and rained back to Earth as “impact spherules” the same day. The scientists found some of these spherules lodged in the gills of fossilised paddlefish and sturgeon excavated from a fossil site called Tanis in North Dakota.\n The discovery of more spherules around the fossils suggest that the glassy particles were still falling when the fish perished, linking the time of death to the day, and potentially even the hour, of the impact. The fish appear to have died when they were buried alive by sediment shaken up in the collision.\n Writing in the journal Nature, the scientists describe how they identified seasonal cycles in the growth rates of the fish bones, along with changes in carbon isotopes linked to seasonal variations in the abundance of zooplankton, a dietary staple for the fish. The findings all point to the fish dying – and so the asteroid colliding – in the spring.  Separate research on the fossils published in December by Prof Phillip Manning at the University of Manchester reached a similar conclusion.\n It is unclear whether small animals in the northern hemisphere actually fared worse than those in the south, however. Dennis Voeten, a co-author on the latest study at Uppsala University, said there was evidence that  northern hemisphere turtles were wiped out in the asteroid strike, after which their habitats were repopulated by turtles from the south.\n Dr Daniel Field, an assistant professor of vertebrate palaeontology at the University of Cambridge, who was not involved in the research, said it was “plausible” that northern hemisphere animals were hit harder by the catastrophe.\n “If the asteroid struck at a biologically sensitive point of the year for many northern hemisphere organisms, it could have contributed to extinction rates that were even more elevated than might have been expected otherwise,” he said.\n But he added that nothing much larger than a house cat survived the asteroid impact and that many species would have been doomed whenever it hit. “The large non-avian dinosaurs probably would have gone extinct regardless of when during the year the asteroid struck,” he said.", "posttime": "2022-02-26 02:01:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,春季,asteroid,撞击", "title": "科学家称，春季小行星撞击导致灭绝率上升", "title_en": "Springtime Asteroid Hit Ramped Up Extinction Rates, Say Scientists", "transed": 1, "url": "https://www.theguardian.com/science/2022/feb/23/springtime-asteroid-hit-ramped-up-extinction-rates-say-scientists", "via": "", "real_tags": ["科学家", "春季", "asteroid", "撞击"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075043, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然微软EdGE最近面临着许多来自NeoWin阅读器的嘲笑，因为雷蒙德科技巨头不断增加许多人认为的“34”；膨胀&#34；在其网络浏览器中，这家公司似乎在拼命走这条路。现在，似乎正在向Microsoft Edge添加Skype Meet Now面板。\n锐利的Redditor和Neowin新闻线人u/Leopeva64-2发现了这种整合，他们发现了最新Edge Canary版本的变化。基本上，您现在在外观设置中有了一个新的切换，可以在Edge omnibar中添加Skype Meet now按钮。在omnibar中单击它会直接在Microsoft Edge中打开Skype“立即见面”面板。上图中可以看到其中的一个片段。\n尽管默认情况下禁用了切换功能，但微软的最新举措可能会再次引发争论，为什么这样的东西会直接集成到浏览器中，而不是作为用户可以选择下载的扩展提供。事实上，这一变化也开启了关于什么是微软的讨论；s推荐的在线通信应用程序考虑到团队的个人版本基本上也与消费者版Skype竞争。\n总而言之，它&#39；目前还不知道这种整合何时或是否会进入稳定的发布渠道。Edge Canary每晚都会更新，所以我们确实开始看到功能以更高的频率出现在那里，然后才进入开发、测试阶段，最终稳定下来。此外，这种集成作为微软的一部分提供&#39；s&#34；受控卷展&#34；战略，所以不是每个人都有它在他们的边缘建设。", "note_en": "Although  Microsoft Edge has recently faced a lot of ridicule from Neowin readers because the Redmond tech giant keeps adding what many consider as &#34;bloat&#34; in its web browser, it seems that the company is hell-bent on this path. Now, it appears that a Skype Meet Now panel is being added to Microsoft Edge.\n  The integration was spotted by  eagle-eyed Redditor and regular Neowin news tipster u/Leopeva64-2, who spotted the change in the latest Edge Canary build. Essentially, you now have a new toggle in the Appearance setting that adds a Skype Meet Now button to the Edge omnibar. Clicking on it in the omnibar opens a Skype Meet Now panel directly in Microsoft Edge. A snippet of this can be seen in the image above.\n Although the toggle is disabled by default, the latest move by Microsoft will likely once again spark debates about why something like this is directly integrated into the browser and not offered as an extension that users can optionally download. In fact, the change also opens up discussions around what is Microsoft&#39;s recommended online communication app considering that  Teams has a personal version that essentially competes against the consumer version of Skype too.\n All in all, it&#39;s not known yet when, or if, this integration will hit the stable release channel. Edge Canary is updated on a nightly basis so we do start to see features appear with more frequency there before they make their way over to Dev, Beta, and eventually Stable. Furthermore, this integration is being made available as a part of Microsoft&#39;s &#34;controlled rollout&#34; strategy so not everyone may have it in their Edge build yet.", "posttime": "2022-02-26 02:00:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,测试,testing,edge", "title": "微软正在测试Skype Meet Now与Edge的集成", "title_en": "Microsoft is Testing Skype Meet Now Integration With Edge", "transed": 1, "url": "https://www.neowin.net/news/microsoft-is-testing-skype-meet-now-integration-with-edge/", "via": "", "real_tags": ["microsoft", "微软", "测试", "testing", "edge"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流行的Tom硬件和PC游戏机网站都发表了关于一个名为“Nvidia RTX LHR v2 Unlocker”的实用程序的文章，该实用程序声称可以提高其RTX图形卡的人工限制加密货币挖掘性能。这些图形卡附带了性能限制软件，以降低GPU对加密货币矿商的吸引力。矿商对GPU的渴求使得游戏玩家和其他各种人难以获得硬件，而且成本高昂。不幸的是，两份出版物都不得不在一天后发表第二篇文章，警告读者不要使用他们刚刚发布的软件。Tom's写道：“该工具没有修复封顶挖掘性能，而是用恶意软件感染主机系统。”虽然现在很清楚该工具是恶意软件，但目前还不清楚恶意软件到底做了什么，从键盘记录到加密货币挖掘。", "note_en": "The popular Tom's Hardware and PC Gamer websites both ran articles about a utility called \"Nvidia RTX LHR v2 Unlocker\", which claimed to increase the artificially-limited cryptocurrency mining performance of its RTX graphics cards. These graphics cards are shipped with performance-limiting software to reduce the GPUs' attractiveness to cryptocurrency miners, whose thirst for GPUs has made it difficult and expensive for gamers and various others to acquire the hardware. Unfortunately, both publications had to run a second article just a day later to warn their readers away from the software they had just advertised. \"Instead of fixing the capped mining performance, the utility infects the host system with malware\", wrote Tom's. Though it is now clear that the tool is malware, it's not immediately clear what exactly the malware does—speculation has ranged from keylogging to, well, cryptocurrency mining.", "posttime": "2022-02-26 01:59:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,程序,性能,nvidia,promising", "title": "承诺在Nvidia GPU恶意软件上恢复挖掘性能的实用程序", "title_en": "Utility Promising To Restore Mining Performance on Nvidia GPUs Actually Malware", "transed": 1, "url": "https://web3isgoinggreat.com/?id=2022-02-23-2", "via": "", "real_tags": ["软件", "程序", "性能", "nvidia", "promising"]}]