[{"category": "", "categoryclass": "", "imagename": "9fa11bf0b10b775d2f2f302c9b63b9be.jpg", "infoid": 1016337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然近年来诊断癌症和心脏问题的能力取得了长足的进步，但一个多世纪以来，检测抑郁症的方法一直顽固地保持不变：观察患者，询问他们的情况。\n加州大学洛杉矶分校(UCLA)发起了一项由苹果公司赞助并与其合作的重大新研究，旨在帮助彻底改变抑郁症的检测和治疗。\n这项为期三年的研究本周开始，由加州大学洛杉矶分校(UCLA)和苹果公司(Apple)的研究人员共同设计，目的是获得睡眠、体力活动、心率和日常生活等因素的客观衡量标准，以阐明这些因素与抑郁和焦虑症状之间的关系。\n这项研究将利用苹果的技术，包括iPhone，Apple Watch和Beddit睡眠监测设备。将可量化的数据与焦虑和抑郁的症状联系起来，可以使医疗保健提供者注意到警告信号，防止抑郁发作，跟踪治疗的有效性，并确定抑郁的原因。\n加州大学洛杉矶分校(UCLA)校长吉恩·布洛克(Gene Block)说：“作为一名接受过睡眠专业培训的神经科学家，我对这次合作感到难以置信的兴奋，并希望这将导致心理健康研究取得重大进展。”\n加州大学洛杉矶分校(UCLA)抑郁大挑战赛(UCLA Depression Grand Challenges)主任、杰出的精神病学教授纳尔逊·弗莱默(Nelson Fremer)博士是这项研究的首席研究员。\n弗莱默说：“这种合作利用了加州大学洛杉矶分校的深厚研究专长和苹果的创新技术，有可能改变行为健康研究和临床护理。”“目前治疗抑郁症的方法几乎完全依赖于抑郁症患者的主观回忆。这是获得客观和精确的测量以指导诊断和治疗的重要一步。“。\n这项研究是抑郁症大挑战的最新里程碑，这是加州大学洛杉矶分校(UCLA)一项雄心勃勃的倡议，由来自不同学科的研究人员参与，目的是识别导致抑郁症的遗传和环境因素，了解抑郁症在大脑和身体中造成的生物变化，加快诊断和治疗的进展，并结束与这种疾病相关的耻辱。加州大学洛杉矶分校之所以选择接受这一挑战，是因为抑郁症困扰着全球超过3亿人，每年导致近100万人自杀。\n这项研究的试点阶段，从加州大学洛杉矶分校的健康患者中招募了150名参与者，本周开始。主要阶段将从2021年到2023年进行，将有大约3000名参与者参加，他们来自加州大学洛杉矶分校的健康患者和加州大学洛杉矶分校的学生团体。\n参与者需要在他们的个人iPhone上下载一个研究应用程序。他们将收到一台Apple Watch和Beddit睡眠监视器，他们将在研究期间使用。参与者将通过定期的临床访谈和问卷，以及从电话、手表和睡眠监视器获得的数据来分享相关信息。\n弗莱默强调，确保研究参与者数据的隐私和安全是加州大学洛杉矶分校和苹果公司的高度优先事项。加州大学洛杉矶分校将在一个安全的环境中处理和维护研究数据，只有加州大学洛杉矶分校研究团队的成员才能访问。加州大学洛杉矶分校(UCLA)和苹果公司(Apple)只有在对数据进行编码并剥离姓名和其他联系信息后，才会对数据进行分析。\n这项研究是在新冠肺炎大流行扰乱了人们的生活，促使人们关注焦虑和抑郁的时候进行的，而且身体距离的要求给科学研究带来了挑战。\n“加州大学洛杉矶分校(UCLA)和苹果公司(Apple)设计了这项研究，以便参与的所有方面都可以远程完成，”弗莱默说。“这场流行病在全球范围内加剧了焦虑和抑郁，并提高了人们对行为健康对整体福祉重要性的认识。与此同时，身体距离的要求限制了面对面的精神健康评估和治疗，导致远程医疗的广泛使用和接受。这些变化突显了将这项研究中将要测试的技术纳入临床研究并最终付诸实践的重要性。“。\n加州大学洛杉矶分校抑郁症大挑战赛在理解和治疗抑郁症方面已经取得了重大进展。乔纳森·弗林特(Jonathan Flint)教授领导了一项新的研究，首次证明了特定遗传因素与抑郁症倾向之间的关系，他开始了对数万名抑郁症患者的雄心勃勃的基因研究，以在分子水平上了解疾病的起源。2017年，加州大学洛杉矶分校(UCLA)成为第一所通过米歇尔·克拉斯克(Michelle Craske)教授开发的STAND计划向学生提供自愿抑郁症和焦虑筛查和即时治疗的大学。今年，美国大萧条大挑战创建了一个免费的新冠肺炎护理套餐，并免费提供给公众，以缓解与大流行相关的压力和焦虑。\n这些努力，包括本周开始的研究，形成了一种全面的、多学科的方法来理解抑郁症，开发治疗方法，并抹去颠覆生活的耻辱。\n弗莱默说：“这项研究的规模、长度和设计使得分析成为可能，这将提供迄今为止关于可能使用数字工具评估和跟踪行为健康的最广泛的证据。”“我们设想，在未来，这些工具将成为抑郁症患者和那些为他们提供护理的人不可或缺的工具。”", "note_en": "While the capability to diagnose cancer and heart problems has advanced by giant steps in recent years, methods to detect depression have stubbornly stayed the same for more than a century: Observe patients, and ask them how they are doing.\n  UCLA has launched a major new study, sponsored by and in collaboration with Apple, designed to help revolutionize detection and treatment of depression.\n  The three-year study, which begins this week, was co-designed by researchers at UCLA and Apple to obtain objective measures of factors such as sleep, physical activity, heart rate and daily routines to illuminate the relationship between these factors and symptoms of depression and anxiety.\n  The research will utilize Apple technology including iPhone, Apple Watch and a Beddit sleep-monitoring device. Making the connection between quantifiable data and symptoms of anxiety and depression could enable health care providers to note warning signs and prevent the onset of depressive episodes, track the effectiveness of treatment and identify causes of depression.\n  “As a neuroscientist by training with expertise in sleep, I am incredibly excited about this collaboration and am hopeful that it will lead to significant strides in mental health research,” said UCLA Chancellor Gene Block.\n  Dr. Nelson Freimer, distinguished professor of psychiatry and director of the UCLA Depression Grand Challenge, is principal investigator on the study.\n  “This collaboration, which harnesses UCLA’s deep research expertise and Apple’s innovative technology, has the potential to transform behavioral health research and clinical care,” Freimer said. “Current approaches to treating depression rely almost entirely on the subjective recollections of depression sufferers. This is an important step for obtaining objective and precise measurements that guide both diagnosis and treatment.”\n  The study is the latest milestone for the  Depression Grand Challenge, an ambitious UCLA initiative involving researchers from across disciplines to identify genetic and environmental factors that contribute to depression, understand the biological changes that depression causes in the brain and body, accelerate progress in diagnosis and treatment and end the stigma associated with the disorder. UCLA chose to take on this challenge because depression afflicts more than 300 million people worldwide, resulting in nearly 1 million suicides a year.\n  The pilot phase of the study, involving 150 participants recruited from among UCLA Health patients, begins this week. The main phases, to take place from 2021 through 2023, will involve some 3,000 participants, drawn both from UCLA Health patients and the UCLA student body.\n  Participants will need to download a research app on their personal iPhones. They will receive an Apple Watch and Beddit sleep monitor, which they will use for the duration of the study. Participants will share relevant information through periodic clinical interviews and questionnaires, as well as from data obtained from the phone, watch and sleep monitor.\n  Freimer emphasizes that ensuring the privacy and security of study participants’ data is a high priority for both UCLA and Apple. UCLA will process and maintain study data in a secure environment, with access limited to members of the UCLA research team. UCLA and Apple will analyze the data only after they are coded and stripped of names and other contact information.\n  The study comes as the COVID-19 pandemic has disrupted lives and spurred a focus on anxiety and depression, and when physical distancing requirements have made scientific research challenging.\n  “UCLA and Apple have designed this study so that all aspects of participation can be accomplished remotely,” Freimer said. “The pandemic has heightened anxiety and depression globally, and has increased awareness of the importance of behavioral health to overall wellbeing. At the same time, physical distancing requirements have limited in-person mental health assessment and treatment, leading to expanded use and acceptance of telehealth. These changes highlight the importance of incorporating technologies like those to be tested in this study into clinical research and eventually into practice.”\n  The UCLA Depression Grand Challenge has already made significant advances in understanding and treating depression. Professor Jonathan Flint, who led a  study proving for the first time the relationship between specific genetic factors and a tendency toward depression, has embarked on ambitious genetic research of tens of thousands of depression sufferers to understand the origins of the disease at the molecular level. In 2017, UCLA became the first university to  offer voluntary depression and anxiety screening and immediate treatment to students through the STAND program developed by Professor Michelle Craske. This year, the  Depression Grand Challenge created a  COVID-19 Care Package and to offered it for free to members of the public to ease stress and anxiety associated with the pandemic.\n  These efforts, including the study that starts this week, form a comprehensive, multi-disciplinary approach to understanding depression, developing treatments and wiping away the stigma that has upended lives.\n  “The analyses made possible by the scale, length and design of this study will provide the most extensive evidence available to date regarding the possible uses of digital tools for assessing and tracking behavioral health,” Freimer said. “We envision a future in which these tools will become indispensable for depression sufferers and those providing them care.”", "posttime": "2020-08-05 12:41:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,大学,iphone,苹果公司", "title": "加州大学洛杉矶分校和苹果公司发起了一项研究，看看iPhone、手表和Beddit睡眠监控器是否有助于了解日常生活是如何影响抑郁症状的", "title_en": "UCLA and Apple launch a study to see whether iPhones, Watches, and Beddit sleep monitors can help in understanding how daily routines impact depression symptoms", "transed": 1, "url": "https://newsroom.ucla.edu/releases/ucla-launches-major-mental-health-study-to-discover-insights-about-depression", "via": "", "real_tags": ["苹果", "apple", "大学", "iphone", "苹果公司"]}, {"category": "", "categoryclass": "", "imagename": "04d7c0b36b50ec482336bf162ebd2bc8.jpg", "infoid": 1016335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三星明天的Unpack发布会将是谣言四起、泄露甚多的Galaxy Note 20的官方展示会。对于那些想在手机揭幕前再看一遍这款手机的人来说，AT&amp；的一段宣传视频几乎展示了这款手机的每一寸地方，甚至详细介绍了它最重要的规格和新功能。\n这段视频是由南美科技博主卡洛斯·秘鲁(Karlos秘鲁)在Twitter上弹出的，似乎是为了宣传这款新手机及其更大的Ultra变种而准备的营销材料。它没有告诉我们任何我们之前不知道或怀疑三星即将推出的超大手机的突破性信息，但在正式发布之前，一个包含如此多信息和细节的视频出现在屏幕上，这是相当令人震惊的。\nGracias a la Operadora AT&amp；T Podemos over un video Promocional de Los Próximos Galaxy Note 20 Series Anes del del#Unpack Prácticamente confirmado todas las filtraciones y con algunos delalles que no gustaran a mohos.。。#SamsungUnpack#GalaxyNote20Series pic.twitter.com/UZZ43RPVJ0。\n-Karlos秘鲁(@Karlos秘鲁)2020年8月3日。\n当然，视频中详细介绍了这两款手机--标准的Galaxy Note 20和Galaxy Note 20 Ultra，这两款手机都将具备5G功能。它还详细介绍了高通骁龙865 Plus处理器和Ultra版的6.9英寸Infinity-O Dynamic AMOLED 2X显示屏，据称这款显示屏的分辨率为3200 x 1440，可变刷新率高达120 Hz。这段视频甚至详细说明了两款设备屏幕的区别，标准版本是6.7英寸的Super AMOLED Plus显示屏。\n这段视频经过了新的S Pen，用于Word和PowerPoint的Microsoft Office触控笔集成，8K视频功能，标准Note 20上的6400万像素摄像头和用于Ultra变体的1.08亿像素摄像头，以及30倍Space Zoom(Ultra是50倍)。如果你想知道电池的大小，这个促销广告里也有。根据视频，标准的Note 20将拥有4300mAh的电池，而Ultra将拥有4500mAh的电池。最后，视频还详细介绍了颜色选项：以神秘绿色、神秘灰色和神秘青铜为标准；以神秘青铜、神秘黑色和神秘白色为标准。\n这基本上都与我们明天预期的情况一致。但再说一次，在官方产品发布会之前看到如此广泛的泄密事件仍然有点令人困惑，很明显，目前三星没有合适的方法来遏制这样的事情，除非它从根本上改变活动、营销甚至内部设计和制造的方式。", "note_en": "Samsung’s Unpacked event tomorrow will be the official showcase for the heavily rumored and  much-leaked Galaxy Note 20. For those who wanted  yet another look at the phone in full before it’s unveiling, an AT&amp;T promotional video pretty much shows off every inch of the device and even details its most important specs and new features.\n The video, which popped up on Twitter  courtesy of South American tech blogger Karlos Peru, appears to have been prepped as a piece of marketing material to promote the new phone and its larger Ultra variant. It doesn’t tell us anything groundbreaking that we didn’t already know or suspect about Samsung’s upcoming extra-large phones, but it is pretty staggering that a video with this much information and detail is popping up ahead of an official announcement.\n Gracias a la Operadora AT&amp;T podemos ver un video promocional de los próximos Galaxy Note 20 series antes del  #Unpacked   Prácticamente confirmado todas las filtraciones y con algunos detalles que no gustaran a muchos.  . #SamsungUnpacked  #GalaxyNote20Series  pic.twitter.com/UZZ43RPVJ0\n— KarlosPeru (@KarlosPeru)  August 3, 2020\n The video details, of course, the two phones — the standard Galaxy Note 20 and the Galaxy Note 20 Ultra, both of which will have 5G capabilities. It also details the Qualcomm Snapdragon 865 Plus processor and the Ultra version’s 6.9-inch Infinity-O Dynamic AMOLED 2X display, which is said to have a 3200 x 1440 resolution with a variable refresh rate of up to 120Hz. The video even details the difference between the two devices’ screens, with the standard version being a 6.7-inch Super AMOLED Plus display.\n The video goes through the new S Pen, a Microsoft Office stylus integration for Word and PowerPoint, 8K video capabilities, the 64-megapixel camera on the standard Note 20 and 108-megapixel one for the Ultra variant, and 30x Space Zoom (50x for the Ultra). In case you were wondering about the battery size, this promotional spot has it, too. According to the video, the standard Note 20 will have a 4,300mAh battery, while the Ultra will have a 4,500mAh one. Finally, the video also details the color options: mystic green, mystic gray, and mystic bronze for the standard; mystic bronze, mystic black, and mystic white for the Ultra.\n This basically all aligns with what we’re expecting to see tomorrow. But again, it’s still always a bit befuddling to see such extensive leaks ahead of an official product event, and it’s pretty clear at this point Samsung has no proper way to contain stuff like this unless it radically changes its approach to events, marketing, and perhaps even internal design and manufacturing.", "posttime": "2020-08-05 12:39:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "galaxy,ultra", "title": "三星Galaxy Note 20 Ultra几乎所有功能都在AT&T的新视频中泄露", "title_en": "Samsung Galaxy Note 20 Ultra has almost every feature leaked in new AT&T video", "transed": 1, "url": "https://www.theverge.com/2020/8/4/21354595/samsung-galaxy-note-20-ultra-5g-leak-att-video-specs-new-features", "via": "", "real_tags": ["galaxy", "ultra"]}, {"category": "", "categoryclass": "", "imagename": "049622de862fbb2ee4b14f18a829641e.jpg", "infoid": 1016334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在“社交距离”这个词进入社会用语的一年前，电子商务营销初创公司MikMak的创始人雷切尔·蒂波格(Rachel Tipograph)站在董事会面前做出了一个回想起来似乎再明显不过的预测：电子商务的未来将是在线杂货和酒类购物。\n2019年初，杂货和酒类销售仍大多处于线下。根据eMarketer的数据，到第二季度，预计2019年只有2%左右的食品和饮料销售发生在网上，2022年达到3%。在Tipograph看来，有颠覆的空间-那是在新冠肺炎让每个人在家购物之前。\nMikMak在2019年剩余的时间里一直在为营销人员利用数字广告表现作为追踪电商销售的一种方式而努力，他在2月份推出了新产品，就在全球各大城市进入封锁的前几周。\n这些大流行前的押注现在得到了回报：MikMak现在已经在首轮融资中筹集了1000万美元，以加快其数据分析路线图并进行国际扩张。\n“我创造了一个领先于市场的产品，”Tipograph说。“然后在3月9日，市场来了。”\n今天宣布的这笔资金由Wavecrest Growth Partners以及包括卢米纳里资本公司和勇敢风险投资公司在内的现有投资者牵头。一些新投资者也参与其中，包括午餐伙伴、BazaarVoice创始人布雷特·赫特、HookLogic创始人兼首席执行官乔纳森·奥普代克、Foursquare首席执行官大卫·希姆和Kargo首席执行官哈里·卡尔格曼。\nTipograph在2014年福布斯30岁以下30岁以下营销和广告排行榜上名列前茅，他在数字广告趋势方面有着领先的记录。当MikMak在2015年推出时，它寻求以30秒视频的形式重新发明数字时代的信息广告。虽然该公司最初专注于帮助营销人员创建和衡量“可购物内容”，但在2017年，它转向企业软件，以帮助大品牌更好地衡量电子商务营销。\nTipograph说：“从很多方面来说，所有事情都是在进行明智的押注。”“自2019年初以来，MikMak下了几个非常聪明的赌注。”\n根据Tipograph的数据，该公司自2018年以来一直有正现金流，不需要筹集资金。然而，随着电子商务在大流行期间的蓬勃发展，加快她的路线图似乎是正确的时机。虽然谷歌和Facebook等许多其他在线广告巨头都将电子商务分析的重点放在消费者洞察力上，但MikMak则专注于通过亚马逊、塔吉特、Drizly、沃尔玛、迷你吧和Petco等电子商务网站推动B2B销售。Tipograph表示，MikMak的顶级客户现在通过20多个渠道进行流量，利用该平台将广告支出与消费者需求、库存和销售联系起来。\n“当你是一个大众市场品牌时，你会依赖市场和批发商来销售和分销你的产品，”她说。“当谈到电子商务时，即使网上有这么多数据，他们实际上也不会访问这些数据。因此，在过去20年的电子商务增长中，这些庞然大物的品牌仍然对他们的客户一无所知。他们不知道能起作用的内容，不知道描述，不知道广告定向，不知道捆绑。对他们来说，这完全是个黑匣子。“。\n自3月初以来，该公司营收增加了50%，同时员工人数翻了一番。在2022年进入亚洲之前，新一轮融资将有助于在欧洲和拉丁美洲的扩张。(MikMak最近还宣布，将开始不分地点招聘员工，并计划在2020年底之前再增加30名员工。)。\n事实上，电子商务继续增长。根据Statista的数据，美国的在线零售额今年可能达到3740亿美元，2021年可能达到4070亿美元，而到2024年将达到4760亿美元。Adobe的数据显示，当仅在杂货店购物时，4月份在线杂货店销售额增长了110%，而葡萄酒、啤酒和烈性酒的购买量增长了74%。根据Brick Meets Click和Mercatus的研究，6月份，美国在线食品杂货销售额增长到72亿美元，比一个月前增长了9%。事实上，4560万个家庭使用送货和提货服务，而在线杂货购物的家庭普及率提高到35%。\nMikMak并不是唯一一家在疫情期间筹集资金的电商公司。今年5月，总部位于圣地亚哥的Ecwid宣布已筹集4200万美元，帮助小企业开展电子商务努力。就在上个月，总部位于洛杉矶的Scalefast筹集了2200万美元的B系列资金，以帮助各品牌迅速推出在线商店。\n最近的电商热潮让品牌更有理由关注消费者需求。Tipograph说，了解受众和他们回应的广告类型是很重要的。当涉及到用高需求的产品获得或保护市场份额时，这一点尤其正确。\n“当你是一个大众品牌，而你的客户缺货时，”Tipograph说，“客户对你没有忠诚度。”", "note_en": "A year before the phrase “social distancing” entered society’s vernacular, Rachel Tipograph—the founder of the e-commerce marketing startup MikMak—stood in front of her board of directors and made a prediction that in retrospect seems all too obvious: the future of e-commerce would be online grocery and liquor shopping.\n  At the beginning of 2019, grocery and alcohol sales were still mostly offline. By the second quarter, only around 2% of food and beverage sales were expected to occur online in 2019 before hitting 3% in 2022, according to eMarketer. From Tipograph’s view, there was room for disruption—and that was before Covid-19 had everyone shopping from home.\n  MikMak spent the rest of 2019 building out ways for marketers to use digital ad performance as a way to track e-commerce sales, launching new products in February just weeks before major cities around the world went into lockdown.\n    Those pre-pandemic bets are now paying off: MikMak has now raised $10 million in Series A funding to accelerate its data analytics road map and expand internationally.\n   “I built a product that was ahead of the market,” Tipograph says. “And then on March 9, the market arrived.”\n  The funding, announced today, was led by Wavecrest Growth Partners, as well as existing investors including Luminari Capital and BraVe Ventures. A number of new investors also participated, including Lunch Partners, Bazaarvoice founder Brett Hurt, Hooklogic founder and CEO Jonathan Opdyke, Foursquare CEO David Shim and Kargo CEO Harry Kargman.\n    Tipograph—who was featured on the 2014  Forbes 30 Under 30 list in the marketing and advertising category—has a track record of being ahead of digital advertising trends. When MikMak launched in 2015, it sought to  reinvent infomercials for the digital era in the form of 30-second videos. And while the company had initially focused on helping marketers create and measure “shoppable content,” it pivoted to enterprise software in 2017 to help large brands better measure e-commerce marketing.\n  “Everything in many ways is placing an educated bet,” Tipograph says. “And MikMak placed a few really smart bets since the beginning of 2019.”\n  According to Tipograph, the company has had positive cash flow since 2018 and didn’t need to raise money. However, with e-commerce booming during the pandemic, the timing seemed right to accelerate her road map. And while many other online advertising giants like Google and Facebook have focused their e-commerce analytics on consumer insights, MikMak has focused on driving B2B sales through e-commerce websites such as Amazon, Target, Drizly, Walmart, Minibar and Petco. Tipograph says top MikMak clients now traffic across more than two dozen channels, using the platform to link ad spend to consumer demand, inventory and sales.\n  “When you’re a mass-market brand, you rely on marketplaces and wholesalers to sell and distribute your products,” she says. “And when it comes to e-commerce, even though there’s so much data online, they actually don’t access any of that. So over the last 20 years of e-commerce growth, these behemoth brands still knew nothing about their customers. They didn’t know the content that would work, the description, the ad-targeting, the bundling. It was a total black box for them.”\n  Since early March, the company has increased revenue by 50% while doubling its headcount. The new round of fundraising will help with expansion in Europe and Latin America before moving into Asia in 2022. (MikMak also recently announced that it would begin hiring employees regardless of location and plans to add another 30 employees by the end of 2020.)\n  Indeed, e-commerce continues to grow. According to  Statista, online retail sales in the U.S. could total $374 billion this year and $407 billion in 2021 while reaching $476 billion by 2024. When it comes to only grocery shopping, data from  Adobe shows online grocery sales increased 110% in April, while the purchase of wine, beer and spirits increased 74%. And in June, U.S. online grocery sales grew to $7.2 billion—up 9% from just a month earlier—according to research from  Brick Meets Click and Mercatus. In fact, 45.6 million households use delivery and pickup services, while household penetration for online grocery shopping increased to 35%.\n  MikMak isn’t the only e-commerce company to raise money during the pandemic. In May, San Diego-based Ecwid announced it had raised $42 million to help small businesses with e-commerce efforts. And just last month, Los Angeles-based Scalefast raised $22 million in Series B funding to help brands quickly launch online stores.\n  The recent e-commerce boom gives brands all the more reason to pay attention to consumer demand. Tipograph says it’s important to understand the audience and the types of ads they respond to. That’s especially true when it comes to gaining or protecting marketshare with products that are in high demand.\n  “When you’re a mass brand and your customer is out of stock,” Tipograph says, “the customer has no loyalty to you.”", "posttime": "2020-08-05 11:52:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "saas,led,电子商务", "title": "MikMak的SaaS让品牌可以统一在线零售商的数字店面，该公司由Wavecrest Growth Partners牵头筹集了1000万美元的首轮融资", "title_en": "MikMak, whose SaaS lets brands unify their digital storefront across online retailers, raises $10M Series A led by Wavecrest Growth Partners", "transed": 1, "url": "https://www.forbes.com/sites/martyswant/2020/08/03/mikmak-raises-10-million-to-accelerate-e-commerce-platform-and-global-expansion/", "via": "", "real_tags": ["saas", "led", "电子商务"]}, {"category": "", "categoryclass": "", "imagename": "98ab3f1934735b4dc58adfd4489c3538.png", "infoid": 1016333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到了2020年，值得假设的是，你在网上上传的每一条状态更新和自拍最终都会落入一个鲜为人知的数据挖掘第三方手中，或者落入国家当局手中，或者两者兼而有之。\n另一方面，意识到这些公司到底有多糟糕，促使许多人想出了新的、有创意的方法来摆脱这种监控。虽然这些方法中的一些方法，比如戴口罩或涂上脸部颜料，理论上可以防止你的照片被盗，但你也会得到看起来一点都不像你的照片。但现在，芝加哥大学的一个团队已经想出了一种更微妙的策略，仍然可以有效地反击这类窥探算法。\n芝加哥的团队名为“福克斯”(Fawkes)--向盖伊·福克斯(Guy Fawkes)面具致敬，该面具在某种程度上已成为在线集体“匿名者”(Anonymous)的同义词。去年年底，芝加哥团队最初开始开发该系统，以阻止Clearview AI等公司通过抓取公共帖子来汇编充满人脸的数据库。\n“我们相信Clearview.ai可能只是(相当大的)冰山一角，”该团队写道。“如果我们能降低这些模型的精确度，使其不值得信赖，或者迫使模型的拥有者支付可观的人均成本来维持精确度，那么我们就会在很大程度上取得成功.”\n看，当像Clearview这样的面部识别公司被训练来识别给定的人的外表时，识别是通过将一张脸的照片(即，来自Facebook个人资料)连接到另一张脸的照片(即，来自护照照片)，并找到这两张照片之间的相似之处来进行的。根据芝加哥研究小组的说法，这不仅意味着找到匹配的面部几何形状、匹配的发色或匹配的痣，还意味着拾取构成计算机生成的面孔照片的像素之间的无形关系。\n通过交换或扭曲其中的一些像素，你或我可能仍然可以识别这张脸，但它会注册为几乎所有流行的面部识别算法中完全不同的人。根据该团队的研究，这种“隐形”技术成功地100%地欺骗了微软、亚马逊和谷歌兜售的面部识别系统。\n如果你想自己试试这个算法，好消息是芝加哥大学的团队在他们的网站上有免费下载的Fawkes程序。根据研究人员的说法，如果你有一张照片想要保护自己不被窥探或刮板，你可以将它们加载到Fawkes中，然后在每张照片大约40秒内将那些看不见的像素混杂在一起。\n然后，你可以将这张新的、被秘密打乱的照片上传到你选择的社交媒体平台上，因为你知道，如果像Clearview这样的公司来浏览你的公开照片，那么这张特定的照片很可能不会与你在网上的任何其他数字详细信息联系起来。\n诚然，福克斯计划不应该是对付这些公司或其他任何公司的灵丹妙药。相反，对于相关公司来说，这应该是一件令人头疼的事情。他们写道：“Fawkes的设计目的是大幅提高为大规模面部识别建立和维护准确模型的成本。”他们指出，我们中的任何一个人都会更有能力用自己的双眼而不是面部识别软件来“在相等或更短的时间内识别[目标人物]”。\n但坦率地说，在我看来，任何让面部数据收集业务利润下降的举措都是一种胜利。", "note_en": "In 2020, it’s worth assuming that every status update and selfie you upload online can eventually make its way into the hands of an obscure data-mining   third party, into the hands of   national authorities, or both.\n    On the flip side, being aware of exactly how shitty these companies are has prompted a lot of folks to come up with new, creative ways to slip out of this sort of surveillance. And while some of these methods—like, say, wearing   masks or loading up on   face paint could  theoretically keep your photos from being pilfered, you’re also left with photos that don’t look much like you at all. But now, a team from the University of Chicago has come up with a much subtler tactic that still effectively fights back against these sorts of snooping algorithms.\n Called “Fawkes”—an homage to the Guy Fawkes mask that’s become   somewhat synonymous with the aptly named online collective Anonymous—the Chicago team initially started working on the system at the tail end of last year as a way to thwart companies like   Clearview AI that compile their face-filled databases by scraping public posts.\n  “It is our belief that Clearview.ai is likely only the (rather large) tip of the iceberg,” the team   wrote. “If we can reduce the accuracy of these models to make them untrustworthy, or force the model’s owners to pay significant per-person costs to maintain accuracy, then we would have largely succeeded.”\n See, when a facial recognition company like Clearview is trained to recognize a given person’s appearance, that recognition happens by connecting one picture of a face (ie, from a Facebook profile) to another picture of a face (ie, from a passport photo), and finding similarities between the two photos. According to the Chicago team, this doesn’t only mean finding matching facial geometry or matching hair color or matching moles, but it also means picking up on invisible relationships between the pixels that make up a computer-generated picture of that face.\n   By swapping out or distorting some of these pixels, the face might still be recognizable to you or me, but it would register as an entirely different person to just about every popular facial recognition algo. According to the team’s research, this “cloaking” technique managed to fool the facial recognition systems peddled by Microsoft, Amazon, and Google 100% of the time.\n If you want to give this algo a whirl yourself, the good news is that the U. Chicago team has the Fawkes program   freely available for download on their website. If you have a picture you want to protect from snoopers or scrapers, you can load them into Fawkes, which then jumbles those unseen pixels in about   40 seconds per photograph, according to the researchers.\n  You can then upload the new, secretly scrambled photo to your social media platform of choice with the knowledge that if, say, a company like Clearview comes scraping through your public photos, then this particular picture likely won’t be connected to any of your other digital details online.\n Granted, the Fawkes program isn’t supposed to be a silver bullet against these companies or any others. Rather, it’s supposed to be a pain in the ass for the companies involved. “Fawkes is designed to significantly raise the costs of building and maintaining accurate models for large-scale facial recognition,” they write, pointing out that any of us would be more capable of “identifying [a] target person in equal or less time” using our own two eyes instead of using facial recognition software.\n  But quite frankly, any move that makes the business of face-data collection any less profitable is a win in my book.", "posttime": "2020-08-05 11:51:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,invented", "title": "研究人员发明了一种阻止面部识别的新方法", "title_en": "Researchers Have Invented a New Way to Thwart Facial Recognition", "transed": 1, "url": "https://gizmodo.com/this-algorithm-might-make-facial-recognition-obsolete-1844591686", "via": "", "real_tags": ["人员", "invented"]}, {"category": "", "categoryclass": "", "imagename": "702327cc03ae59f710d645eba5db88f1.png", "infoid": 1016331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google+关闭已经一年半了，我开始涉足FeDISTICATION和其他分布式社交网络。这也开启了我摆脱谷歌所有东西的搜索。去谷歌说起来容易做起来难，因为谷歌无处不在，从搜索到字体，从视频平台YouTube到文件存储和同步服务Google Drive，从博客发布服务Blogger到谷歌移动操作系统Android。名单还在继续。所以很有可能你在使用很多这样的服务，而且其中大多数都需要一个谷歌账户，这是谷歌的一个迂回举动。正因为如此，要摆脱这个如此方便的账户是非常困难的。\n要获得更全面的视图，请阅读本文。下面我整理了一份谷歌最重要的服务和产品的列表，我用其他东西取代了它们。\n搜索可能是最容易取代的(或者说它是)。虽然谷歌搜索目前是世界上最大的搜索引擎，但DuckDuckGo(DDG)正变得越来越受欢迎。我使用DDG非常满意，只用了几次谷歌搜索。我唯一的抱怨是DDG不是免费的开源软件(FLOSS)，更不用说分发了。在这方面，我读到了一些关于Searx的好消息，我可能会在未来尝试一下。\n谷歌的Chrome浏览器已经变得非常受欢迎，估计市场份额约为70%。Chrome的很大一部分源代码基于谷歌的开源浏览器项目Chromium，然而Chrome是专有免费软件，因为它包含大量专有代码。间谍软件监督机构认为Chrome的间谍软件水平极高，这是因为内置了多种间谍软件功能，如谷歌账户和导航辅助。另一个威胁来自前面提到的市场份额。当我们包括其他基于Chromium的浏览器，如Microsoft Edge、Opera和Vivaldi时，情况会变得更糟。我目前使用的是Firefox。它可能不是最注重隐私的浏览器，但它很棒，它有一个合理的市场份额，这对支持网络开发人员很重要，而且Firefox的开发非常活跃。\n接下来是YouTube，BTW对所有这些广告和推荐变得越来越讨厌，唯一的目的就是让用户尽可能长时间地在YouTube上停留(并提供更多的广告)。我过去在YouTube上投资了很多，制作了70多个关于3D CAD、3D打印和电子产品的视频，所以更换它并不容易。我找到的解决方案有两个方面。我重新录制了(部分)我现有的视频，并将它们上传到PeerTube和YouTube。如果我想看YouTube视频，我会在我的智能手机(遗憾的是仍然是Android系统)的NewTube浏览器中使用Invidious。\n多年来，我开始依赖Google Drive，例如，在我将项目发布到博客或视频中后，我想要共享的CAD文件可以存储在Google Drive上。我希望读者和观众能够再现这个项目。因为我不想自托管，所以像Nextcloud这样的解决方案不适合我(参见下面的编辑)。我开始寻找付费服务。我目前与一家德国托管公司Strato签订了一份合同，该公司也托管我的网站。Strato提供了HiDrive，不幸的是它不是牙线，但它在欧盟提供了100%的存储空间，而且(付费的)端到端加密是可能的，尽管只有在Windows的HiDrive桌面程序中才有可能(这很糟糕，但无论如何我不需要加密来达到这个目的)。\n我开始使用OpenStreetMap和基于OpenStreetMap的产品，比如Osmand(Android版)和Komoot(Android版)和Komoot，而不是谷歌地图。Komoot是徒步旅行和骑自行车的好去处，但不幸的是它不是牙线。事实证明，这些替代方案对我来说已经足够好了，因为我已经不再使用谷歌地图了。\n不知何故，我开始使用Gmail。我不知道确切的原因，因为我已经有了很好的电子邮件服务。我也不明白为什么它会这么受欢迎，因为其他所有的电子邮件服务都是这样做的。我自己的ISP提供了非常好的电子邮件服务，我使用的网络托管公司也是如此。要停止使用Gmail，需要做一些准备工作，最重要的是列出并通知所有向您的Gmail地址发送电子邮件的人和组织。同时列出所有使用你的Gmail地址的在线服务。现在将此Gmail地址替换为另一个电子邮件地址。\n你可能想要完全删除你的Gmail，但也有可能它链接到了你的Google账户。如果是这样的话，你可以为这个账户使用不同的电子邮件地址，或者更彻底地完全删除你的谷歌账户。如果您选择后者，请记住，许多Google服务都是与您的Google帐户成对的，不能再访问了。话虽如此，如果你开始将谷歌从你的生活中清除，那么随着你每删除一项谷歌服务，谷歌账户就变得越来越不重要。因此，在某一时刻，删除谷歌账户将是毫无痛苦的。\n虽然Android是免费和开源的软件，但大多数Android手机都带有专有软件和服务，这些软件和服务会阻止用户以他们看起来合适的方式使用手机。在你的手机上免费软件的最简单的方法是安装FDroid。对于大多数用户来说，Google Play商店是在他们的手机上安装软件的唯一方式。FDroid是一个替代的软件商店，使用户能够轻松地在他们的Android设备上安装和维护免费和开源软件。顺便说一句，安装FDroid和更换专有应用程序是我到目前为止所做的事情，这是一个很好的开始。\n更好的做法是用像LineageOS这样的免费Android版本取代谷歌出没的Android。LineageOS是Android的牙线版本，可以在没有谷歌账户的情况下使用，也没有专有的谷歌应用程序(或许还有手机制造商提供的其他垃圾应用程序)。在尝试在您的电话上安装之前，请确保检查您的电话是否受支持。\n是的，我知道，我的博客里有谷歌字体。这伴随着WordPress主题的选择而来，而我当时并没有意识到这一点。这只是另一个例子，谷歌是如何侵扰网络的，去谷歌搜索我的生活是多么困难，但可以放心的是，字体将是下一个。\n让谷歌走出你的数字生活是很难的，非常难。这告诉我们谷歌在多大程度上融入了我们的生活，而且很可能在很大程度上并没有意识到这一点。幸运的是，我们仍然有选择(不只是跟网络说再见)，让我们可以自由使用网络而不被使用的选择。控制我们的数据而不被利用的自由。\nE dit：正如Mastodon上的某个人指出的那样，没有必要自行托管NextCloud。运行Nextcloud的云服务提供商的例子有Disroot、OwnCube和Operationtulip.com(目前处于测试阶段)。", "note_en": "It’s been 1.5 years since Google+ closed and  I started dipping my toes into the Fediverse and other distributed social networks. It also kicked off my search to get rid of everything Google. To  DeGoogle is easier said than done because Google is everywhere from search to fonts, from the video platform YouTube to the file storage and synchronisation service Google Drive, and from blog publishing service Blogger to the Google mobile operating system Android. And the list goes on. So chances are you’re using a lot of these services and most of them require a  Google account, a devious move from Google. It’s for this reason that it’s very hard to get rid of this o so convenient account.\n  To get a more comprehensive view take a look at  this article. Below I’ve compiled a list of the most important Google services and products that I replaced with something else.\n  Search was perhaps the easiest to replace (or is it). While Google search is by far the largest search engine in the world DuckDuckGo (DDG) is becoming  increasingly popular. I’ve used DDG to great satisfaction and only had to use Google search a couple of times. The only gripe that I have is that DDG isn’t free and open source software (FLOSS) let alone distributed. In that respect I’ve read some good things about  Searx and I may give that a try in the future.\n  The Chrome browser of Google has become very popular with an  estimated market share of approximately 70%. A large portion of the Chrome’s source code is based on Chromium, the open source browser project from Google, however Chrome is proprietary freeware because it contains large blobs of proprietary code. The Spyware Watchdog considers  Chrome’s Spyware level extremely high this due to multiple spyware features that are built-in such as Google Account and Navigation Assistance. Another threat come from the earlier mentioned market share. This gets even worse when we include the  other browsers that are based on Chromium such as Microsoft Edge, Opera and Vivaldi. I currently use  Firefox. It’s perhaps not the most privacy minded browser around but it’s FLOSS, it has a reasonable market share which is important for support of web developers and development of Firefox is very active.\n  Next is YouTube which BTW is becoming more and more annoying with all these ads and the recommendations with the sole purpose to keep the user as long as possible on YouTube (and serve even more ads). I invested a lot in YouTube in the past with over 70 video made about 3D CAD, 3D printing and electronics so replacing it is not easy. The solution that I found is two-fold. I remastered (part) of my existing videos and uploaded them to both  PeerTube and YouTube. If I want to watch YouTube videos I use  Invidious in the browser of  NewPipe on my Smartphone (still Android sadly).\n  Over the years I got dependant on Google Drive e.g to store the CAD files that I wanted to share after I published a project either in blog or a video. I want readers and viewers to be able to reproduce the project. Since I didn’t want to self-host a solution  such as  Nextcloud wasn’t for me (see edit below). I started looking for a paid service. I currently have a contract with Strato, a German hosting company that also hosts my websites. Strato offers HiDrive, it’s not FLOSS unfortunately but it offers 100% storage in the EU and (paid) end-to-end encryption is possible although only in the HiDrive desktop program for Windows (which is a bummer but I don’t need encryption for this purpose anyway).\n  Instead of Google maps I started using  OpenStreetMap and products based on OpenStreetMap such as  OsmAnd (on Android) and  Komoot both on Android and the web browser. Komoot is excellent for hiking and cycling but unfortunately it isn’t FLOSS. These alternatives have proven to be good enough for me since I haven’t used Google Maps any more.\n  I somehow started using Gmail. I don’t know exactly why because I already had very good email services. I also fail to understand why it’s so popular because every other email service does about the same. My own ISP comes with a very good email service and so is the web hosting company that I’m using. To stop using Gmail takes some preparation most importantly to list and notify all the people and organisations that send you email to your Gmail address. Also list all online services that use your Gmail address. Now replace this Gmail address with another email address.\n You may want to delete your Gmail completely but it’s possible that it’s linked to your Google account. If this is the case you can either  use a different email address for this account or more radical  delete your Google account completely. In case you choose the latter remember that lots of Google services are couples to your Google account and can’t be accessed any more. Having said that if you start to purge Google from your life the Google account becomes less and less important with every Google service that you delete. So at a certain point deleting the Google account will be painless.\n  Although Android is Free and Open Source software most Android phones come with proprietary software and services that prevent users from using the phone the way they seem fit. The easy way to free the software on your phone is to install  FDroid. For most users the Google Play Store is the only way to install software on their phone. FDroid is an alternative software store that enables the user to easily install and maintain Free and Open Source software on their Android device. BTW installing FDroid and replacing proprietary apps is what I have done thus far and it’s a good start.\n Even better is to replace the Google infested Android with a free version of Android like  LineageOS. LineageOS is a FLOSS version of Android that can be used without a Google account and that comes without the proprietary Google apps (and perhaps other junk from the phone manufacturer). Make sure to check if your phone is supported before trying to install in on your phone.\n  Yes I know, I have Google fonts in my blog. That came with the choice of the WordPress theme and I didn’t realize that at the time. That’s just another example how Google infested the web and how difficult it is to DeGoogle my life but rest assured fonts will be next.\n  To get Google out of your digital life is hard, very hard. This tells us how much Google is integrated into our lives and probably for the most part without being aware of it. Luckily we still have choice (other than just say goodbye to the web), choice that gives us freedom to use the web without being used. The freedom to control our data and not being exploited.\n E dit: As someone on Mastodon pointed out it’s not necessary to self-host NextCloud. Examples of cloud service providers running Nextcloud are  Disroot,  OwnCube and  Operationtulip.com (currently in beta).", "posttime": "2020-08-05 11:24:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,生活,degoogle", "title": "去谷歌我的生活", "title_en": "DeGoogle My Life", "transed": 1, "url": "https://homehack.nl/degoogle-my-life/", "via": "", "real_tags": ["谷歌", "google", "生活", "degoogle"]}, {"category": "", "categoryclass": "", "imagename": "26e78fde5a1fed23fa77cba5f12d2723.jpg", "infoid": 1016330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数以千计的志愿者正在公共网站上搜集数据，将警方记录汇编成一个单一的国家数据库，供研究人员挖掘。", "note_en": "Thousands of volunteers are data scraping public websites to compile police records into a single national database for researchers to mine.", "posttime": "2020-08-05 10:58:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,警察,build,志愿者", "title": "志愿者建立第一个全国警察记录数据库", "title_en": "Volunteers Build First Nationwide Database of Police Records", "transed": 1, "url": "https://www.freethink.com/articles/police-records", "via": "", "real_tags": ["database", "数据库", "警察", "build", "志愿者"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1016329, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你懂单曲吗？我不知道，所以我想我应该给你解释一下。\n那么，一旦你拿到了，我会重新解释Lucid的。没有哈斯克尔，可选的分类理论，无麸质。\n当时的想法是，程序是一组方程，描述了一组随时间变化的变量。最初的想法是通过减少编程对数学的依赖来使正式的程序验证变得更容易-程序只是一组方程式。然而，项目迅速扩展，直到我们意识到我们已经发明了一种函数式数据流语言。\n除了这种被认为是函数式的语言外，它还有很多奇怪的特点。首先，这纯粹是第一个订单(尽管这一问题后来得到了部分解决)。更奇怪的是，变量表示数据对象的无限序列，以及像逐点加法运算这样的数据操作。\n更奇怪的是，我们发现函数有两个不同的概念。最一般的，我们简称为“函数”的是任意的(但可计算的)流转换。我们称之为“映射”的更专业，使用随时间索引变化的规则逐点转换流。同样，也有两种子计算的概念，一种是通用的，另一种是逐点的。我们分别将这些构造称为“产生”和“计算”。\n(根据lambda演算符号，这对应于两个lambdas和两个“let”构造。在通用版本中，变量被绑定到任意流，在专用版本中，变量被绑定到单个数据对象)。\nWadler将两个lambdas和两个let之间的区别描述为按值调用和按名称调用。我认为这是准确的。我们将值函数(映射)调用称为“同步”，因为时间t时f(X)的值仅取决于t和时间t时X的值。\n然而，在当时，这种区别被认为是“混乱和奇怪的”，我们放弃了call by value WHERE子句(相当于let)。\n我们几乎不知道这些奇怪的现象是使用单体的结果。既然他们还没有被介绍给计算机科学，我们怎么能这样做呢？\n关于Monad的教程很多，Phil Wadler的函数式编程的精髓是最好的教程之一，但我没有发现其中任何一个特别容易理解。原因之一是它们需要熟悉Haskell类型和范畴理论，这是我宁愿避免的。另一个原因是他们认为动机是把顺序性和副作用带回函数式编程。不用了谢谢。埃德和我发明了Lucid，允许编程不按顺序进行。如果我想做顺序编程，我会用C编写。\n所以我想出了一种避免哈斯克尔和(大多数)范畴论的单音方法。我还放弃了这样的假设，即我们想要编写带有副作用的命令式I/O。\n单体的基本思想是，对于每个数据域D，我们都有一个派生域D*，它包括D，并且在某种意义上概括了元素。一个要记住的例子是，让D*成为D的所有元素集的集合。\n这将我们带到单数的第一个组件，即从D到D*的嵌入(我也称之为*)。这确保可以在D*中“找到”D中的每个单独的数据对象。例如，如果d是3，而我们处理的是集合单元数，则d*是{3}。这个映射的存在保证了D在某种意义上是D*的子域。\n第二个属性是*on domain基本上是一个闭包运算符：D**与D*相同。不是字面上的：对于集合单体，D**是D的元素集合集合的域，与D*不同。第二个属性保证的是将D**映射到D*的折叠运算符V。在集合的情况下，是并集运算符将集合转换为其元素的并集。因此，{{2，3}，{4，5，6}，{2，6，7}}V是{2，3，4，5，6，7}。\n请注意，例如，3**({{3}})折叠为3*({3})。这种情况必须一直存在。\n其次，塌陷必须是联想的。D*有两种方式：AS(D**)*和(D*)**。结果是两种方式将其折叠为D*，即(D**)*to(D**)*to D**to D**to(D*)*to(D*)*to D*.。这些必须产生相同的结果。\n例如，对于集合，D*的元素是集合的集合。它折叠(双向)为所有元素“出现”在任何位置的集合。\n第三个性质是，对于任何域D和E以及从D到E的任何函数f，都存在一个从D*到E*的函数f*。我们可以把f*(S)看作映射(f，s)。这些函数必须组成；如果f：D-&gt；E和g：E-&gt；F，则(f*|g*)=(f|g)*，(“|”是Unix管道的反向组合)。\n对于集合单体，f*以元素方式应用于其参数的元素。如果s是{2，3，5}，且f是平方函数，则f*(S)={4，9，25)。\n此外，*必须遵守D到D*和E到E*的嵌入：F*(d*)=f(D)*。\n最后，*on函数必须很好地处理折叠。如果s‘在D**中，则有另一种计算f**(s’)V的方法，即先将s‘折叠成s，然后取f*(S)。这必须产生相同的结果。在符号中，f**(s‘)V=f*(s’V)。\n就集合而言，f**取一组集合，并以元素方式将f应用于“较低”的集合。收拢结果与收拢集合的集合并按元素应用f相同。此规则(警告：范畴论！)。认为塌缩是从函数者**到函数者*的自然转换。\n这就把我们带到了我们最喜欢的单子，溪流单子。流是一个无限的序列。\n数据对象的。在流中，单数D*是D上所有流的集合。给定D中的d，d*是常量流\n给定f从D到E，f*从D*到E*按点工作：如果D*中的s为。\n最后，从D**到D*的折叠运算符取对角线；如果D**中的s‘为。\n&lt；a 0，a 1，a 2，a 3，…。&gt；，&lt；b 0，b 1，b 2，b 3，…。&gt；，&lt；c 0，c 1，c 2，c 3，…。&gt；，…。\n单子定律很容易检查，流单子并不比集合单子复杂。特别地，D*到D**的折叠都给出了三维立方体的对角线。\n对流单元上的λ演算的非标准解释完全是清晰的，使用了有争议的嵌套循环结构(我将在另一次进行讨论)。\n集合单子，就像流单子一样，决定了对λ演算的非标准解释。在这种解释中，D*的元素不是流，而是D的非确定性元素。D*的每个元素都是一组可能性。因此，如果D*中的s是{1，3，5}，则它是一个1、3或5的值。\n给定D的元素d(例如，3)，d*是{3}，这意味着一个值肯定是3。如果s如上所述，并且f是平方函数，则f*(S)是s-{1，9，25}的可能值的平方。换句话说，要获得f*(S)的值，您需要获得s的值，然后对其应用f。\n如果s‘在D**中，则它是D的非确定性非确定性元素。折叠成D*意味着取这些非确定性元素中的一个，然后取它的一个值。这意味着“%s”向其成员的联盟崩溃。\n例如，检查一元定律并验证两个不确定的D值之和是否具有所有可能的召唤值对并不难。\n那么，按点工作的同步函数的类比是什么呢？这些函数一次只检查一种可能性。因此，接受其参数的值并返回其平方根之一的函数符合条件。另一方面，接受两个值并返回其间一个值的函数则不会。\n为了使语言变得有趣，我们需要额外的基元，比如fby，它们不是f*的形式。对于集合，我们可以将fby(s，t)定义为s和t的并，这是McCarthy的amb函数。\n集合单体的一种变体是用0到1之间的数字标记集合中的每个元素。那么D*是标记加起来为1的所有标记元素集合。我们可以将D*的元素看作D上的随机变量(如果我们只取有限集合，它会简化事情)。\n给定d，d*是唯一元素是d的集合，标记为1。折叠是并集，除非内部标记和外部标记相乘。函数f*(S)取s的元素d，并以相同的概率返回f(D)。两个操作数的和是成对求和的集合，每个和用和的标签的乘积进行标记。此外，我们可能需要合并：如果不同的和产生相同的结果，则添加单独的标记。\n与SYNCHRONCE的类比类似于集合单体的类比，只有一个样本规则。平方根函数就是一个例子，每个根的概率为50/50。\n对于fby的类比，我们可以将fby(s，t)定义为50%s和50%t。\n另一个可能的单数是D的元素的D*Be(有限)序列。我们可以将这些元素看作迭代器，它们根据重复的要求按顺序产生序列值。\nD**的元素是序列序列，通过按顺序连接序列来折叠。我们可以将它们视为产生迭代器的迭代器。折叠意味着依次生成迭代器，然后单独运行它们。两个迭代器的和按字典顺序产生所有成对和。\nF*(S)是将f应用于序列s的每个元素的结果。在操作上，它意味着运行s并将f应用于产生的所有内容。\n同步表示g(S)的第n个输出仅取决于n和s的第n个输出。计数器是同步的。\n我们可以将fby(s，t)定义为s的第一个元素，简写为t。作为迭代器，它运行s一次，发送值，然后变为t。\n在这个单子中，D*的一个元素是用一个自然数来标记的D的一个元素，我们可以认为它是一个到达时间(时钟滴答)。\n值d*是用0标记的d。折叠D**意味着将D的双标记元素转换为D的单标记元素。我们取两个标记中的最大值。\nF*(S)的值是将f应用于s的数据部分并保持标签不变的结果。我们等待s到达，然后立即应用f。\n两个标签值的总和是它们用两个标记中的最大值标记的值的总和。我们等待操作数到达，一旦最后一个操作数出现，立即将它们相加。\n按值调用函数对其参数的数据值进行操作，可能会增加延迟。\n非f*原语是race(x，y)，它返回具有最小标记的参数-第一个到达的参数。\n这是一个广为人知的单曲，在大多数教程中都有它的特点。D*是添加了单个错误对象的D的副本。例如，N*可能是错误的自然数。也许是…。一个自然数。\n给定D中的任意d，d*是D*中d的像。如果f将D映射到E，则f*将D*中D的元素映射到E*中f(D)的相应元素，并将ERROR映射为ERROR。D**上的折叠将D的图像映射到自身，两个错误都映射到D*中的单个错误。如果D*的两个元素都在D的像中，则D*的两个元素的和就是它们的正态和，否则就是错误的。\n那么，IO Monad是什么，它们中最著名的是什么呢？对很多人来说，单曲的全部意义是什么？\n这一点还远不清楚，我已经努力了一段时间来确定这一点。Wadler在“Essence”中定义了一个输出Monad，其中D*的元素是D的元素和字符串。显然，我们的想法是字符串是在生成D的元素时生成的输出。\n元素d*与空字符串一起是d。函数f*对数据组件进行操作，并传递字符串。从D**到D*的折叠将连接与D**中的值相关联的两个字符串。D*的两个元素的总和是它们的值与两个输出字符串的连接的总和。按值调用函数转换数据并添加一些输出。\n这是我最好的机会了。我不明白的是副作用从何而来。我已经讨论过的其他单药不会产生副作用。*。我问过应该知道的人，得到了不同的答案。最常见的解释是，Haskell人员设置了实现的诱杀部分，并将其直接连接到输出。谁知道呢？\n在未来的帖子中，我将详细介绍Lucid的I/O方法，它既不使用副作用，也不使用IO monad。", "note_en": "Do you understand  monads? I don’t, so I  thought I’d explain them to you.\n Then, once you’ve got it, I’ll re-explain Lucid. No Haskell, optional category theory, gluten free.\n   The idea was that a program was a set of equations describing a set of variables changing over time. The original idea was to make formal program verification easier by reducing programming  to mathematics -programs are just sets of equations. However the project expanded quickly til we realized that we’d invented a  functional data flow language\n Except this supposedly functional language had a lot of strange features. For a start, it was purely first order (though this has since been partially addressed). Weirder still, variables denoted infinite sequences of data objects, and data operations like addition operated pointwise.\n Even weirder, we discovered that there were two separate notions of function. The most general,  that we simply called “functions” were arbitrary (but computable) transformations of streams. The more specialized, that we called “mappings”, transformed streams point by point, using rules that varied according to the time index. In the same way, there were two notions of subcomputation, one general and one point by point. We called the constructs “produce” and “compute” respectively.\n (In terms of lambda calculus notation this corresponds to two lambdas and two “let” constructs. In the general versions variables are bound to arbitrary streams, in the specialized ones to individual data objects)\n Wadler characterizes the difference between the two lambdas and the two lets as  call by value versus  call by name. I think this is accurate. We called the call by value functions (mappings) “synchronic” because the value of f(X) at time t depends only on t and the value of X at time t.\n However at the time this distinction was considered “messy and weird” and we dropped the call by value  where clause (the equivalent of let).\n Little did we know that these strange phenomena were the result of using monads. How could we, since they hadn’t yet been introduced to computer science.\n  There are plenty of tutorials on monads, Phil Wadler’s   Essence of Functional Programming being one of the best, but I don’t find any of them to be particularly accessible. One reason is they require familiarity with Haskell types and category theory, which I’d rather avoid. They other is that they assume the motivation is to bring back sequentiality and side effects to functional programming. No thanks. Ed and I invented Lucid to allow programming without sequentiality. If I want to do sequential programming, I’ll write in C.\n So I worked out an approach to monads which avoids Haskell and (most) category theory. I also drop the assumption that we want to program imperative I/O with side effects.\n  The basic idea of a monad is that for every data domain D we have a derived domain D* which includes D and in some sense generalizes the elements. One example to keep in  mind is  having D* be  the collection of all  sets  of elements of D.\n  This brings us to the first component of a monad, namely an embedding (which I’ll also call *) from D to D*. This ensures that every individual data object in D can be ‘found’ in D*. For example, if d is 3 and we’re dealing with the set monad, d* is {3}. The existence of this map guarantees that  in some sense, D is a subdomain of D*.\n The second property is that * on domains is basically a closure operator: D** is the same as D*. Not literally: with the set monad, D** is the domain  of sets of sets of elements of D, not the same as D*. What the second property guarantees is a collapse operator V that maps D** to D*. In the case of sets, it’s the union operator that turns a set of sets into the unions of its elements. Thus {{2,3},{4,5,6},{2,6,7}}V is {2,3,4,5,6,7}.\n Note that e.g. 3** ({{3}}) collapses to 3* ({3}). This must always be the case.\n Next, it’s necessary that collapse be associative. D*** can be seen in two ways: as (D**)* and (D*)**. The result is two ways to collapse it to D*, namely (D**)* to (D*)* to D** to D, and (D*)** to (D*)* to D** to D*. These have to give the same result.\n For example, with sets an element of D*** is a set of sets of sets. It collapses (both ways) to the set of all elements ‘appearing’ anywhere.\n The third property is that for any domains D and E and any function f from D to E, there is a function f* from D* to E*. We can think of f*(s) as map(f,s). These functions must compose;if f:D-&gt;E and g:E-&gt;F, then (f*|g*) = (f|g)*, (“|” being reverse composition  – unix piping).\n For the set monad, f* applies f elementwise to the elements of its argument. If s is {2,3,5} and  f is the square function, then f*(s) = {4, 9, 25).\n Furthermore * must respect the embeddings of D into D* and E into E*: f*(d*) =f(d)*.\n Finally, * on functions has to play nice with collapse. If s’ is in D**, there is an alternate way to calculate  f**(s’)V. That is to collapse s’ first to s, then take f*(s). This must yield the same result. In symbols, f**(s’)V  = f*(s’V)\n In terms of sets, f** takes a set of sets and applies f elementwise to the ‘lower’ sets. Collapsing the result is the same as collapsing the set  of sets and applying f elementwise. This rule (warning: category theory!) says that collapse is a  natural transformation from the functor **  to the functor *.\n  This brings us to our favorite monad, the  stream monad. A stream is an infinite sequence\n  of data objects. In the stream monad D* is the  set of all streams over D. Given d in D, d* is the constant stream\n  Given f from D to E, f* from D* to E* works pointwise: if s in D* is\n    Finally the collapse operator from D** to D* takes the diagonal; if s’ in D** is\n &lt;a 0, a 1, a 2, a 3,  …&gt;, &lt;b 0, b 1, b 2, b 3,  …&gt;, &lt;c 0, c 1, c 2, c 3,  …&gt;, …\n   The monad laws are easily checked, the stream monad is no more complex then the set monad. In particular the collapses of D*** to D* both give the diagonal of a 3 dimensional cube.\n The nonstandard interpretation of the λ calculus over the stream monad is exactly Lucid, complete with the controversial nested loop construct (which I’ll go into another time).\n  The set monad, like the stream monad, determines a nonstandard interpretation of the lambda calculus. In this interpretation the elements of D* are not streams but  nondeterministic elements of D. Every element of D* is a set of possibilities. Thus if s in D* is {1,3,5}, it’s a value which is either 1, 3, or 5.\n Given an element d (say, 3) of D, d* is {3}, meaning a value which is certainly 3. If s is as above and f is the square function, f*(s) is the square of a possible value of s – {1,9,25}. In  other words, to get a value of f*(s), you get a value of s and apply f to it.\n If s’ is in D**, it is a nondeterministic nondeterministic element of D. Collapsing to D* means taking one of these nondeterministic elements then taking one of its values. This means s’ collapses to the union of its members.\n It’s not hard to check the monad laws and to verify, for example, that the sum of two nondeterministic D values  takes on all possible pairs of values of the summands.\n So what is the analog of synchronic functions that work pointwise? These are functions that examine only one possibility at a time of their arguments. Thus a function that takes a value of its argument and returns one of its square roots qualifies. On the other hand a function that takes two values and returns one in between does not.\n To make the language interesting we need additional primitives, like fby, that are not of the form f*. For sets we can define fby(s,t) as the union of s and t. This is McCarthy’s amb function.\n  One variation on the set monad is to have every element of the set tagged with a number between 0 and 1. Then D* is the collection of all sets  of tagged elements whose tags add up to 1. We can think of  the elements of D* as random variables over D (it simpliifes things if we take only finite sets).\n Given d, d* is the set whose only element is d, tagged with 1. Collapsing is union except the inner and outer tags are multiplied. The function f*(s) takes an element d of s and returns f(d) with the same probability. The sum of two operands is the set of pairwise sums with each sum tagged with the product of the tags of the sums. Also, we may have to consolidate: if different sums produce the same result, we add the separate tags.\n The analogy to synchronic is similar to that of the set monad, with a one-sample rule. An example is the square root function,with 50/50 probabilty for each root.\n For an analogy of fby we can define fby(s,t) as 50% s and 50% t.\n  Another possible monad  has D* be (finite) sequences of elements of D. We can think of these as iterators, which produce the sequence values in order upon repeated demands.\n Elements of D** are sequences of sequences and are collapsed by concatenating the sequences in order. We can think of them as iterators that produce iterators. Collapsing means generating the iterators in turn then running them individually. The sum of two iterators produces all pairwise sums in lexicographic order.\n  f*(s) is the result of applying f to every element of sequence s. Operationally, it means running s and applying f to everything produced.\n Synchronic means that the nth output of g(s) depends only on n and the nth output of s. A counter is synchronic.\n We can define fby(s,t) to be the first element of s consed to t. And as an iterator it runs s once, emits the value, but thereafter becomes t.\n  In this monad an element of D* is an element of D tagged with  a natural number, which we can think of as an arrival time (clock tick).\n The value d* is d tagged with 0. Collapsing  D** means turning double tagged elements of D into single tagged elements of D. We take the maximum of the two tags.\n The value of f*(s) is the result of applying f to the data part of s and leaving the tag unchanged. We wait for s to arrive, then apply f without any further delay.\n The sum of two tagged values is the sum of their values tagged with the maximum of the two tags. We wait for the operands to arrive, and as soon as the last one shows up, add them without further delay.\n A call by value function operates on the data value of its argument and possibly increases the delay.\n A non f* primitive is race(x,y), which returns  the argument with the smallest tag – the first to arrive.\n  This is a well known monad and features in most tutorials. D* is a copy of D with a single error object added. For example, N* is a possibly erroneous natural number. Maybe… a natural number.\n Given any d in D, d* is the image of d in D*. If f maps D to E, f* maps elements of D in D* to the corresponding element of f(d) in E*, and maps  error to  error. The collapse on d** maps the image of D onto itself, and both errors onto the single error in D*. The sum of two elements of D* is their normal sum if both are in the image of D, otherwise  error.\n    So what is the IO monad, the most famous of them all? For many people, the whole point of monads?\n This is far from clear, and I’ve been trying for some time to pin it down. Wadler in “essence” defines an output monad in which an element of D* is an element of D together with a string. Apparently the idea is that the string is the output that was generated while producing the element of D.\n The element d* is d together with the empty string. The function f* operates on the data component and carries over the string. The collapse from D** to D* concatenates the two strings associated with a value in D**. The sum of two elements of D* is the sum of their values together with the concatenation of the two output strings. A call by value function transforms the data and adds some output.\n This is my best shot. What I don’t understand is where the side effect comes in. The other monads I’ve discussed don’t produce side effects.                                                                                                                                                                                                  I’ve asked people who ought to know and got different answers. The most common explanation is that the Haskell people have booby-trapped part of the implementation and connected it directly to the output. Who knows?\n  In a future post I’ll expand on the Lucid approach to I/O, which uses neither side effects nor the IO monad.", "posttime": "2020-08-05 10:58:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "单调,intensionality,元素", "title": "单调与内蕴--清醒不是一种反常", "title_en": "Monads and Intensionality – Lucid is not an aberration", "transed": 1, "url": "https://billwadge.wordpress.com/2020/08/04/monads-and-intensionality-lucid-is-not-an-abberation/", "via": "", "real_tags": ["单调", "元素"]}, {"category": "", "categoryclass": "", "imagename": "52c8c035e40a99e2829b2a91a70990ad.jpg", "infoid": 1016328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三星的下一次重大产品发布即将到来，将于美国东部时间8月5日上午10点举行，尽管由于新冠肺炎疫情的持续，这将是一场虚拟的活动。发布的主要产品几乎肯定会是三星Galaxy Note系列的下一款手机，三星的顶级智能手机阵容将一些功能最强大的手机硬件搭配在一起，配备了一个漂亮的大屏幕和标志性的S Pen触控笔。\n但三星并不羞于取笑更多的产品披露。该公司在一篇博客文章中表示，计划在此次活动中推出五款设备，最近，该公司使用预告片展示了五个剪影。在我们看来，它们看起来就像是新平板电脑、智能手表、真正的无线耳塞、可折叠智能手机的轮廓，当然还有Note 20。\n这些轮廓与最近有关三星正在开发的产品的报道非常吻合，包括Galaxy Tab S7平板电脑、Galaxy Watch 3智能手表、Galaxy Buds Live真无线耳塞，以及Galaxy Fold的继任者Galaxy Z Fold 2。\n这篇文章最初指出，有传言称三星可能会发布5G版本的Galaxy Z Flip手机，但该公司后来正式宣布了这一消息，因此这一消息不在8月份的谈判桌上。\n请继续阅读我们期待在三星下一次解包活动上看到的所有内容的概要。\n三星配备触控笔的Note手机往往是该公司在每年8月的Unpack活动上的一大焦点。据WinFuture称，今年，我们预计三星将至少推出两款Note手机，包括一款标准的Note 20(据报道，这款手机将采用6.7英寸2400x1080的平板显示屏)，以及一款更大的Note 20Ultra，配备6.9英寸3200x1440的曲面显示屏。一些报道也提到了配备6.87英寸2345x1084显示屏的Note 20 Plus，但也有人猜测这可能是与普通Note 20或Ultra相同的设备。\n我们第一次看到Note 20 Ultra是三星自己给我们的，三星似乎错误地在其网站上发布了一张手机的照片。虽然不多，但足以确认该设备是否存在(哪个…。DUH)，这一次将有一个重新设计的相机凸块。这似乎包括三个摄像头和第四个传感器，可以是3D ToF传感器，也可以是激光自动对焦，这将分别有助于人像拍摄和对焦速度。\n随后，我们又看到了Note 20 Ultra，这要归功于YouTuber Jimmy is Promo的一段简短的动手视频和照片，他的频道专门报道三星手机的新闻。在他的泄密中包括了几张设备正面的照片，展示了Note 10风格的中心打孔自拍相机，以及略小的边框和更大的相机凸块。WinFuture随后发布的手机效果图似乎证实了这一泄密事件。\n与此同时，当谈到降级版Note 20时，WinFuture分享了这款手机似乎是在营销方面的表现。这些图片似乎表明，Note 20的摄像头凸起不那么突出，屏幕也更平坦，没有绕着设备的边缘弯曲。\n在相机方面，泄露的Note 20 Ultra的图像和视频似乎表明，三星的“折叠”潜望式变焦镜头正在从S20 Ultra卷土重来，可以实现直到最近还很难在智能手机允许的有限空间内实现的那种变焦功能。当谈到Note 20 Plus(可能是也可能不是同一款设备)时，Leaker Ice宇宙最初表示，其主摄像头将配备像S20 Ultra一样的1.08亿像素主传感器。然而，他也表示，据报道，这一次，其变焦镜头的顶端将是50倍，而不是我们看到的S20 Ultra的100倍，其变焦镜头将采用1300万像素的传感器，而不是4800万像素的传感器。(WinFuture后来证实，Ultra相机的主传感器和超宽相机的分辨率将分别为1.08亿像素和1200万像素，尽管有报道称其变焦镜头将为1200万像素。)。这听起来像是降级，但实际上，S20 Ultra的100倍变焦镜头大多无法使用，所以这一次停在50倍似乎是明智的。使用分辨率较低的传感器也可能意味着变焦镜头的微光性能更好。\n与此同时，据WinFuture报道，Note 20将拥有6400万像素的变焦摄像头，光学变焦3倍，而总体最大变焦能力将达到30倍。据报道，这款变焦相机还将配备1200万像素的主相机和超宽相机。\n根据Jimmy is Promos的视频，Note的标志性S Pen的设计与去年大致相似(视频甚至显示Note 20的触控笔被插入Note 10，反之亦然)，但据报道，它将有一个新的“指针”模式，可以让你使用S Pen远程控制屏幕上的光标。与Note 10相对简单的手势控制相比，这可能是向前迈出的一大步，如果你想只用手写笔远程控制手机，你可以有更多的选择。根据WinFuture的另一份报告，Ultra上的S Pen可能只有9毫秒的延迟，而标准Note 20上的S Pen的延迟可能会更高，为26毫秒。\n在内部，我们预计将看到骁龙865甚至865 Plus处理器为Note 20 Ultra提供动力。两个处理器都没有集成的5G调制解调器，但由于它们的设计都是为了与高通的X55 5G调制解调器一起工作，Note 20的阵容很可能是支持5G的。\n根据WinFuture的说法，Note 20 Ultra显然将拥有6.9英寸的屏幕，分辨率为3200x1440，可变刷新率高达120 Hz。其他报道称，Note 20 Plus的屏幕刷新率也将达到120 Hz。因此，不管这款超级笔记本的实际名称是什么，它的屏幕看起来应该和Galaxy S20一样流畅。最大的问题是，当屏幕被设置为最大1440p分辨率时，您是否能够使用这个120 Hz的刷新率，因为这在S20系列上是不可能的。一次泄露的消息声称你可以在Ultra上运行，但这还远不确定。\n此外，也有报道称Note 20 Plus的低温多晶氧化物(LTPO)显示屏与我们在Apple Watch Series 5上看到的类似。这项技术可以让三星更好地控制手机的刷新率，必要时可以选择降低刷新率以延长电池寿命。这是一项有用的技术，它可以帮助减轻120 Hz显示器的高功率消耗。\n与此同时，根据WinFuture的说法，标准的Note 20将有一个略小的6.7英寸显示屏，分辨率为2400x1080，刷新率将限制为60 Hz。\n最后，根据WinFuture的说法，Ultra和标准的Note 20都可能进行优化，通过微软的XCloud游戏流媒体服务玩游戏。\n7月22日，三星发布了5G版本的Galaxy Z Flip，这是三星最近推出的一款智能手机，可以折叠，变得更紧凑。因此，如果该公司打算在8月5日的活动上展示一款可折叠的产品，它似乎很可能是Galaxy Fold的继任者。(与Z Flip不同，Fold是一款可以折叠成智能手机大小的平板电脑。)。SamMobile最近报道称，继任者将被命名为Galaxy Z Fold 2，这是三星试图统一其可折叠品牌的一部分，泄密者Max Weinbach报道称，它将于8月亮相，10月发布。\n上周，当MySmartPrice发布了一系列可折叠设备的渲染时，我们看到了Galaxy Z Fold2最精彩的一面。这些图片显示了该设备传言中的一些功能。这款设备的正面似乎有一个更大的显示屏(传言说是6.23英寸)，这应该意味着它在折叠时比最初Galaxy Fold的4.6英寸封面显示屏更好用。渲染还显示了更大的内部屏幕(有传言称它将是7.7英寸，而最初的折叠是7.3英寸)，与Galaxy Fold的粗大凹槽相比，自拍相机的冲孔切口更小。\n渲染效果与该设备早先出现的一张照片(虽然模糊)的设计相匹配，也与一张看起来像是可折叠的真实世界照片的照片相匹配。\n据报道，Galaxy Z Fold 2也将支持5G，鉴于有传言称这款手机使用的是骁龙865 Plus处理器，这是有道理的。根据MySmartPrice的说法，它还可以有4356mAh的电池和15W的无线充电。\n新的可折叠手机和它的前身一样，也可能相当昂贵；MySmartPrice声称Galaxy Z Fold 2的价格为1,980美元，与第一款Fold的价格相同。\n在这一点上，一款新的Galaxy Watch几乎已成定局。三星似乎完全跳过了Galaxy Watch 2，直接跳到Galaxy Watch 3上，Galaxy Watch 3已经出现在监管文件以及泄露的图片、渲染，甚至是一段动手视频中。\n最大的传言是物理旋转表圈的回归，令人遗憾的是，去年的Galaxy Watch Active and Active 2中没有这个表圈，它为智能手表提供了方便的物理控制。据报道，这款手表将有41毫米和45毫米两种尺寸，仅限LTE和Wi-Fi版本。\n在软件方面，三星的Tizen操作系统似乎正在为新款智能手表进行改头换面。新的表盘可以让你在显示屏的边缘添加定制的细节，比如你的心率或步数。据报道，还有用于拍照或接听来电的新手势控件。我们过去一直是三星智能手表的粉丝，目前将Galaxy Watch Active 2评为最适合Android用户的智能手表，因此我们寄予厚望。\n如果美国联邦通信委员会(Federal Communications Commission)最近提交的文件可信的话，三星似乎还将推出一款新的健身跟踪器。这款设备的细节目前尚不清楚，它似乎是三星去年推出的Galaxy Fit的继任者，但预计会有心率跟踪和自动运动检测功能。然而，考虑到三星表示将推出五款设备，我们似乎不太可能在本周看到这款新的健身设备亮相。\n今年早些时候，三星发布了一对真正的无线耳塞，Galaxy Buds Plus，很快成为我们今天能买到的最好的真正无线耳塞的首选。现在，看起来它可能还有另一对正在进行中，其中包括他们最大的缺失功能：有源噪音消除。\n4月份WinFuture首次泄露了Galaxy Buds Live，随后Galaxy Buds Live出现在三星的官方Galaxy Buds配套应用程序中，确认了有源噪音消除的名称和支持。在过去的几个月里，无数的耳机照片被泄露，但最近从伊山·阿加瓦尔泄露的一些照片基本上从各个角度很好地展示了它们。\n据WinFuture报道，有报道称，新的噪音消除功能意味着电池续航时间不会像Galaxy Buds Plus那么好，播放时间只有4.5个小时，而不是11个小时。显然，当你和他们的手提箱一起使用时，你最多可以充电20小时，这款手提箱的设计在埃文·布拉斯(Evan Blass)最近的一次泄密中得到了展示。如果你想看看耳机的最终设计和颜色，可以看看Twitter用户@h0x0d发布的这段视频，视频中似乎显示了一段泄露的营销片段：\n据WinFuture报道，Galaxy Buds Live的零售价为190欧元，约合225美元或174 GB。\n这些天来，认真对待Android平板电脑的制造商并不多，但三星在Galaxy Tab产品阵容中年复一年地不断发布新的产品。根据SamMobile最近的一份报告，它将在8月份的Unpack发布会上展示一款TabS7和S7 Plus。\n如果报道准确，S7和S7 Plus将分别配备11英寸LCD和12.4英寸OLED显示屏，并采用骁龙865 Plus处理器。两者都可以在三星的S Pen上使用，你可以选择6 GB或8 GB的RAM，128 GB或256 GB的存储空间。显然，TabS7 Plus也有5G版本，但它将仅限于支持低于6 GHz的5G，这意味着不支持mmWave的千兆速度。最后，预计平板电脑上会有显示屏内的指纹传感器，尽管SamMobile无法确认它们将配备光学传感器还是超声波传感器。\n三星的高管已经公开表示，公司在本周的发布会上只有五款设备要发布，所以我们似乎不太可能看到任何额外的令人惊讶的硬件发布。也就是说，我们有一部分人希望看到三星的Galaxy Home亮相。\n早在2018年首次发布，Bixby驱动的智能音箱就面临着一次又一次的延迟，尽管此后三星在韩国宣布并发布了迷你版，但全尺寸机型似乎并未更接近发布。考虑到延迟，它几乎到了我们不太期待三星宣布空中力量式的取消的地步。但是，如果它在它可以抢占Note 20风头的时候这样做，我们会感到惊讶。\n更新8月3日美国东部时间上午11：48：更新了标题和介绍，以反映活动将在本周举行，并增加了传言中的Galaxy Z Fold 2的新细节。", "note_en": "Samsung’s next big product launch is right around the corner, taking place on  August 5th at 10AM ET, though it’ll be a virtual event as a result of the ongoing COVID-19 pandemic. The main product reveal is almost certainly going to be the next phone in Samsung’s Galaxy Note series, its top-of-the-range smartphone lineup that pairs some of the most powerful phone hardware around with a big, beautiful screen and its signature S Pen stylus.\n But Samsung hasn’t been shy about teasing additional product reveals. The company said in a  blog post that it plans to unveil five devices at the event, and more recently, it  used a teaser trailer to show off five silhouettes. To our eyes, they look like silhouettes for a new tablet, smartwatch, true wireless earbuds, a foldable smartphone, and, of course, the Note 20.\n  Those silhouettes tie neatly into recent reports about products Samsung has in development, including a  Galaxy Tab S7 tablet, a  Galaxy Watch 3 smartwatch,  Galaxy Buds Live true wireless earbuds, and a successor to the Galaxy Fold called the  Galaxy Z Fold 2.\n This article originally noted that rumors suggested Samsung might unveil a 5G version of its Galaxy Z Flip handset, but the company has since  officially announced it, so that’s off the table for August.\n Read on for a rundown of everything we’re expecting to see at Samsung’s next Unpacked event.\n    Samsung’s stylus-equipped Note phones tend to be the company’s big focus at its August Unpacked event each year. This year, we’re expecting Samsung to have at least two Note phones to show off, including a standard Note 20 (which will  reportedly have a  flat 6.7-inch 2400 x 1080 display) as well as a bigger Note 20 Ultra with a curved 6.9-inch 3200 x 1440 display,  according to  WinFuture. Some reports have also referred to a Note 20 Plus with a 6.87-inch 2345 x 1084 display, but there’s also been speculation that this could be the same device as either the regular Note 20 or the Ultra.\n  Our first proper look at Note 20 Ultra came to us from Samsung itself, which appeared to mistakenly post a photograph of the phone  on its website. It wasn’t much, but it was enough to confirm that the device exists (which… duh) and will have a redesigned camera bump this time around. This seems to include three cameras along with a fourth sensor that could be either  a 3D ToF sensor or a laser autofocus, which would help with portrait shots and focus speed, respectively.\n We subsequently got another look at the Note 20 Ultra, thanks to a  short hands-on video  and photos from YouTuber Jimmy Is Promo whose channel specializes in news about Samsung phones. Included in his leak were a couple of shots of the front of the device, showing off its Note 10-style centered hole-punch selfie camera, along with its slightly smaller bezels and a larger camera bump. Renders of the phone that were subsequently  published by  WinFuture, appear to corroborate this leak.\n  When it comes to the step-down Note 20, meanwhile,  WinFuture  has shared what appear to be marketing renders of the phone. These images appear to show that the Note 20 has a less prominent camera bump and flatter screen that doesn’t curve around the edges of the device.\n   In terms of cameras, the leaked images and video of the Note 20 Ultra appear to show that Samsung’s “folded” periscope zoom lens is making a comeback from the S20 Ultra, allowing for the kinds of zoom that, until recently, were difficult to pull off in the limited space allowed by a smartphone. When it comes to the Note 20 Plus (which may or may not be the same device),  leaker Ice Universe initially said that its main camera will have a 108-megapixel main sensor like the S20 Ultra. However, he also said that this time, its zoom lens will reportedly top out at 50x rather than the 100x we saw with the S20 Ultra and that its zoom lens will have a 13-megapixel rather than a 48-megapixel sensor. (  WinFuture has since corroborated that the Ultra’s camera’s main sensor and ultrawide cameras would have resolutions of 108-megapixels and 12-megapixels, though reported that its zoom lens will be 12 megapixels.) That sounds like a downgrade, but in practice, the S20 Ultra’s 100X zoom shots were  mostly unusable, so stopping at 50X this time around seems sensible. Using a lower-resolution sensor could also mean better low-light performance from zoom shots.\n The Note 20, meanwhile, will reportedly have a 64-megapixel zoom camera with an optical zoom of 3x,  according to  WinFuture, while its maximum zoom overall will top out at 30x. This zoom camera will reportedly be joined by 12-megapixel main and ultrawide cameras.\n   According to the  Jimmy is Promo video, the Note’s signature S Pen has a broadly similar design to last year (the video even shows the Note 20’s stylus being slotted into the Note 10 and vice versa), but it will reportedly have a new “pointer” mode that could allow you to remotely control an on-screen cursor using the S Pen. It’s potentially a big step forward from the Note 10’s  relatively simple gesture controls, giving you more options if you want to control your phone remotely using just its stylus. And the S Pen on the Ultra may only have 9 milliseconds of latency, while the S Pen on the standard Note 20 could have a higher 26 milliseconds of latency, according to separate   WinFuture  reports.\n Internally, we’re expecting to see a Snapdragon 865 or even  an 865 Plus processor powering the Note 20 Ultra. Neither processor has an integrated 5G modem, but since they’re designed to work with Qualcomm’s X55 5G modem, the Note 20 lineup is likely to be 5G-enabled.\n The Note 20 Ultra will apparently have a 6.9-inch screen with a 3200 x 1440 resolution with a variable refresh rate of up to 120Hz,  according to  WinFuture. Other reports suggest the Note 20 Plus’ screen will also  have a refresh rate of 120Hz. So regardless of whatever the actual name for the super-powered note is, it seems like its screen should look every bit as smooth as on the Galaxy S20. The big question is whether you’ll be able to use this 120Hz refresh rate while the screen is set to its maximum 1440p resolution since this wasn’t possible on the S20 series. One  leak has claimed that you’ll be able to on the Ultra, but it’s far from certain.\n Elsewhere, there have also been reports that the  Note 20 Plus will have a Low-Temperature Polycrystalline Oxide (LTPO) display similar to what we saw  Apple use on the Apple Watch Series 5. It’s a technology that could give Samsung much more control over the phone’s refresh rate, with the option of reducing it when necessary to conserve battery life. It’s a useful technology to have, and it could help mitigate the higher-power draw of a 120Hz display.\n According to  WinFuture, meanwhile, the standard Note 20 will have a slightly smaller 6.7-inch display with a resolution of 2400 x 1080, and it will be limited to a refresh rate of 60Hz.\n Finally, both the Ultra and the standard Note 20 may be optimized to play games over Microsoft’s xCloud game streaming service, according  to   WinFuture .\n    Samsung released a 5G version of the  Galaxy Z Flip, its recent smartphone that folds to become more compact, on  July 22nd. So if the company is going to show a foldable at its August 5th event, it seems likely it will be a successor to the  Galaxy Fold. (The Fold, in contrast to the Z Flip, is a tablet that folds to become the size of a smartphone.)   SamMobile recently reported that successor will be called the Galaxy Z Fold 2 as part of Samsung’s attempt to unify its foldable branding, and  leaker Max Weinbach reports it will be unveiled in August to release in October.\n  Our best look at the Galaxy Z Fold 2 arrived last week when   MySmartPrice published a series of renders of the foldable device. The images show a number of the device’s rumored features. There’s what appears to be a much bigger display on the front of the device (it’s rumored to be  6.23 inches), which should mean it’s much more usable while folded compared to the original Galaxy Fold’s 4.6-inch cover display. The renders also show a bigger internal screen (rumors claim it’ll be 7.7 inches, compared to 7.3 inches for the original Fold), with a  smaller hole-punch cutout for its selfie camera compared to the beefy notch on the Galaxy Fold.\n The renders match the design of  an earlier (albeit blurry) picture that emerged of the device as well as a photo of what appears to be a real-world photo of the foldable.\n  The Galaxy Z Fold 2 will also reportedly support 5G, which makes sense given the phone is rumored to use a Snapdragon 865 Plus processor. It could also have a 4,356mAh battery and 15W wireless charging, according  to  MySmartPrice.\n The new foldable, like its predecessor, could also be quite expensive;  MySmartPrice claims the Galaxy Z Fold 2 will cost $1,980, the same price as the first Fold.\n    At this point, a new Galaxy Watch is almost a given. Samsung appears to be skipping the Galaxy Watch 2 entirely and is jumping straight to the Galaxy Watch 3, which has already appeared in  regulatory filings as well as leaked images,  renders, and even a  hands-on video.\n The big rumor is the  return of a physical rotating bezel, which was sadly missing from last year’s  Galaxy Watch Active and  Active 2 and provides a  convenient physical control for the smartwatch. The watch will reportedly be available in 41mm and 45mm sizes and LTE and Wi-Fi-only variants.\n  In terms of software, Samsung’s Tizen operating system  appears to be getting a facelift for the new smartwatch. New watchfaces could let you add custom details like your heart rate or step count to the edges of the display. There are also reportedly  new gesture controls for taking photos or answering incoming calls. We’ve been fans of Samsung’s smartwatches in the past and currently rate the Galaxy Watch Active 2 as the  best smartwatch for Android users, so we’ve got high hopes.\n Samsung also has what appears to be a new fitness tracker on the way if  a recent Federal Communications Commission filing is to be believed. Details are currently slim on the device, which appears to be a successor to  Samsung’s Galaxy Fit from last year, but expect heart rate tracking and automatic exercise detection. Given Samsung’s comments about having five devices to unveil, however, it seems unlikely that we’ll see this new fitness device make an appearance this week.\n    Earlier this year, Samsung released a pair of true wireless earbuds, the  Galaxy Buds Plus, that quickly became our top pick for the  best true wireless earbuds you can buy today. Now, it looks like it might have another pair on the way that include their single biggest missing feature: active noise cancellation.\n  First  leaked back in April by  WinFuture, the Galaxy Buds Live have subsequently appeared in Samsung’s  official Galaxy Buds companion app, confirming the name and support for active noise cancellation. Numerous pictures of the earbuds have leaked over the past few months, but some  recently leaked images from Ishan Agarwal do a nice job of showing them from basically every angle.\n Reports indicate that the new noise-canceling functionality means that battery life won’t be as good as the Galaxy Buds Plus, with as little as 4.5 rather than 11 hours of playback,  according to  WinFuture. Apparently, you’ll be able to get a maximum of 20 hours of charge when used alongside their case, the design of which was shown in a  recent leak from Evan Blass. If you want a look at what appear to be the final designs and colors for the headphones, check out  this video from Twitter user @h0x0d, which appears to show a leaked marketing clip:\n  The Galaxy Buds Live will reportedly retail for €190, according to  WinFuture, which translates to roughly $225 or £174.\n  There aren’t many manufacturers that take Android tablets seriously these days, but Samsung continues to release new entries in its Galaxy Tab lineup year after year. According to a  recent report from  SamMobile, it will have a Tab S7 and S7 Plus to show off at its August Unpacked event.\n If reports are accurate, the S7 and S7 Plus will have 11-inch LCD and 12.4-inch OLED displays, respectively, and be powered by Snapdragon 865 Plus processors. Both  will work with Samsung’s S Pen, and you’ll have the option of either 6 or 8GB of RAM and 128 or 256GB of storage. There’s also apparently a 5G version of the Tab S7 Plus, but it will be limited to supporting sub-6GHz 5G, meaning there’s no support for mmWave’s gigabit speeds. Finally, expect in-display fingerprint sensors on the tablets, though  SamMobile can’t confirm whether they’ll have an optical or ultrasonic sensor.\n    Samsung’s executives have gone on the record to say that the company has just five devices to announce at its event this week, so it seems unlikely that we’re going to see any extra surprise hardware announcements. That said, there’s a part of us that would love to see Samsung’s Galaxy Home make an appearance.\n First announced back in 2018, the Bixby-powered smart speaker has  faced delay after delay, and although Samsung has since announced and  released a miniature version in South Korea, the full-size model seems to be no closer to release. Given the delays, it’s almost getting to the point where we’re half-expecting Samsung to announce an  AirPower-style cancellation. But we’d be surprised if it did so at a time when it could steal the Note 20’s thunder.\n Update August 3rd, 11:48AM ET:  Updated the headline and introduction to reflect that the event is this week and added new details about the rumored Galaxy Z Fold 2.", "posttime": "2020-08-05 10:33:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "galaxy,三星", "title": "三星周三的期待：Galaxy Note 20、新款Galaxy Watch、Galaxy Buds Live耳塞、Tab S7和S7 Plus，可能还有Galaxy Fold的续集", "title_en": "What to expect from Samsung on Wednesday: Galaxy Note 20, new Galaxy Watch, Galaxy Buds Live earbuds, Tab S7 and S7 Plus, and possibly a sequel to Galaxy Fold", "transed": 1, "url": "https://www.theverge.com/21323952/samsung-galaxy-note-20-unpacked-z-flip-rumors-leaks-news?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["galaxy", "三星"]}, {"category": "", "categoryclass": "", "imagename": "fe40f05955e08c5baa1e4238badc10c2.jpg", "infoid": 1016327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正因为如此，我们才明白这一点，SpaceX公司用一卷卷钢材建造了一枚火星火箭。\n周二晚上，在太阳沉入德克萨斯州起伏的地平线前一个多小时，这艘星际飞船原型隆隆作响，首次离开地面。它从看台上升起，它的单个猛禽火箭发动机燃烧得干干净净。这辆30米高的车辆上升到150米左右，横向移动，然后开始下降。\n由于猛禽抛出了惊人的火力并掀起了一堆灰尘，目前还不清楚原型火箭是否在严酷的考验中幸存下来。但随着尘埃落定，烟雾消散，可以看到闪闪发光的啤酒罐形状的火箭静止地站着，微微倾斜，阳光从钢质侧面闪闪发光。\n这还不是星际飞船的全部，星际飞船是一种大型航天器，将搭载着一枚尚不存在的超重型火箭发射到轨道上。这个原型缺少关键的结构元素，包括大鼻锥、襟翼、级间等等。但关键的是，这辆车装有星际飞船的推进系统。\n任何火箭最具挑战性的部件是发动机和管道，以可靠和快速地为其提供氧化剂和燃料。然后是在高压和超低温下容纳这些液体推进剂所需的大型储罐。诀窍是建造这些结构尽可能轻，同时也能容纳推进剂。周二测试的关键方面之一是证明星际飞船的不锈钢结构能够经受住发射和着陆的恶劣环境。\n此外，周二的测试还证明，SpaceX公司对其猛禽发动机的推力矢量控制系统有控制柄，因为它安装的位置略有偏离中心，在整个短途飞行中必须进行补偿。考虑到这些结果，SpaceX显然在该飞行器的飞行软件方面取得了进展。\n将近整整一年过去了，SpaceX在类似的飞行中发射了它的矮小StarHopper。从那时起，SpaceX一直专注于在墨西哥湾附近的南得克萨斯州发射场建造一座工厂，该发射场就在美国与墨西哥边境以北。它还摧毁了几个早期的星际飞船原型，因为它推动了制造轻型车辆的限制。现在，它又开始飞行了。\n在周二的测试之后，目前还不清楚该计划的下一步是什么。这是车辆序列号5，或SN5。它现在可能要退役了。在德克萨斯州南部的帐篷和高位海湾内，该公司有SN6和SN8的组件，SN6是一种使用新钢材合金的独立探路者坦克。后一种飞行器可能有一个鼻锥整流罩，飞行控制面，并将猛禽发动机的数量增加到三个。这种飞行器有可能在今年晚些时候进行长达20公里的试飞。\n在尝试进入轨道之前，SpaceX还需要建造第一级火箭-超重型火箭。有迹象表明，这种情况正在发生。最近几周，SpaceX已经开始建造一个高度较高的海湾，用来堆放高耸的超重型火箭，并开始建造发射台。\n一旦SpaceX公司展示了星际飞船的轨道飞行，在它成为能够到达火星的发射系统之前，它仍然有许多技术障碍需要清除。其中最值得注意的是在近地轨道上演示加油，SpaceX已经与NASA达成协议，帮助开发这项技术。\n所以有很多工作要做。周二晚上过后，火星仍有很长的一段路要走。到目前为止已经很久了。但第一步是低成本、频繁地进入太空，以便运送成吨的物品。星际飞船的首次飞行是迈向这第一步的第一步。而且这是一件很大的事。", "note_en": "Just so we&#39;re clear about this, SpaceX built a Mars rocket out of rolls of steel.\n    And on Tuesday evening, a little more than an hour before the Sun sank into the rolling Texas horizon, this Starship prototype rumbled to life and left the ground for the first time. It rose from a stand, with its single Raptor rocket engine burning clean. The 30-meter-tall vehicle ascended to about 150 meters, moved laterally, and then began to descend.\n As Raptor threw out prodigious amounts of fire and kicked up a heap of dust, it was not immediately clear whether the prototype rocket survived its ordeal. But as the dust settled and the smoke cleared, the shiny, beer-can shaped rocket could be seen still standing, leaning a little, sunshine glinting off its steel sides.\n  This was not the entirety of Starship, the large spacecraft that will be launched into orbit atop a Super Heavy rocket, which does not yet exist. This prototype lacked key structural elements, including a large nose cone, flaps, an interstage, and more. But critically, this vehicle contained Starship&#39;s propulsion system.\n The most challenging parts of any rocket are the engine and the plumbing to reliably and rapidly feed it oxidizer and fuel. Then there are the large tanks needed to hold these liquid propellants at high pressures and ultra-cold temperatures. The trick is to build these structures as light as possible, while also capable of containing the propellants. Among the key aspects of Tuesday&#39;s test was demonstrating that Starship&#39;s stainless-steel structure could withstand the harsh environment of a launch and landing.\n  Moreover, Tuesday&#39;s test also proved that SpaceX has a handle on the thrust vector control system for its Raptor engine, as it was installed slightly off center, and had to compensate throughout the short flight. Given the results, SpaceX clearly has made progress on flight software for this vehicle.\n Nearly a full year has passed SpaceX  launched its stubby Starhopper on a similar flight. Since then  SpaceX has focused on building a factory at its South Texas Launch Site near the Gulf of Mexico, just north of the U.S. border with Mexico. It has also destroyed several earlier Starship prototypes as it pushed the limits on building lightweight vehicles. Now, it is flying again.\n  After Tuesday&#39;s test it was not immediately clear what the program&#39;s next steps will be. This was vehicle Serial Number 5, or SN5. It probably will now be retired. Inside the tents and high bays in South Texas, the company has components for SN6, a separate pathfinder tank that uses a new steel alloy, and SN8. This latter vehicle is likely to have a nosecone fairing, flight control surfaces, and increase the number of Raptor engines to three. It is possible this vehicle will make a test flight up to 20km later this year.\n Before attempting a flight into orbit SpaceX also needs to build the first stage rocket, Super Heavy. There are signs this is coming along. In recent weeks SpaceX has begun building a high bay in which to stack the towering Super Heavy rocket, as well as starting construction of a launch pad.\n  Once SpaceX demonstrates Starship in orbital flight, it still has many technical hurdles to clear before this becomes a launch system capable of reaching Mars. Most notable among these is demonstrating refueling in low-Earth orbit, and SpaceX has already  reached an agreement with NASA to help develop this technology.\n So there&#39;s a lot of work to be done. And after Tuesday night, Mars remains a really long way away. So very far. But the first step is low-cost, frequent access to space for tons of stuff. Starship&#39;s first flight is the first step toward  that first step. And it&#39;s a big one.", "posttime": "2020-08-05 10:08:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "version,飞行", "title": "早期版本的星际飞船首次试探性地离开地球", "title_en": "An early version of Starship takes its first, tentative steps off Earth", "transed": 1, "url": "https://arstechnica.com/science/2020/08/an-early-version-of-starship-takes-its-first-tentative-steps-off-earth/", "via": "", "real_tags": ["version", "飞行"]}, {"category": "", "categoryclass": "", "imagename": "d9842a27c5231b0d2d8026101267fbc4.jpg", "infoid": 1016326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本田正在召回608,000辆面包车和SUV，原因是软件存在故障，其中可能导致后备摄像头故障和司机显示器故障或重新启动。召回将于9月23日开始。\n某些2018-2020款奥德赛、2019-2020款护照和2019-2021款飞行员都配备了“正确的仪表板控制模块软件”，这可能会导致显示器不会显示关键信息，如速度、发动机油压和档位选择器位置，直到汽车关闭再打开。根据美国国家公路交通安全管理局(NHTSA)的说法，显示器还可以随机重新启动。出现故障的软件还会阻止备份摄像机视频显示。\n本田将通知车主，但他们必须让经销商对软件进行重新编程。这里没有简单的空中软件修复。\n另一次召回涉及50万辆相同的汽车-2019年至2021年的Pilot和2019年至2020年的护照，但仅涉及2019至2020年的奥德赛。这些车辆的“不正确的中央网络软件编程”也有问题，这可能会导致“发生几个错误，延迟或阻止后视摄像头图像的显示”。该问题还可能扰乱车内音频。这些汽车的车主将可以选择下载空中修复程序或拜访经销商。\n这并不是本田第一次因为软件故障而导致其后置摄像头系统故障。该公司在2018年因类似问题召回了约23.2万份Accords and Insight。今年早些时候，菲亚特克莱斯勒(Fiat Chrysler)也因后备摄像头问题召回了36.5万辆汽车-尽管这个问题与视频播放时间过长有关。\n本田周二还宣布对其中一些车辆进行另外两次召回。一些2019-2020年的奥德赛配备了有问题的后备摄像头，随着时间的推移，这些摄像头产生了扭曲的图像，而2018-2020年的奥德赛可能存在滑门锁闩问题。", "note_en": "Honda is  recalling 608,000 vans and SUVs because of faulty software that can, among other things, cause the backup camera to fail and the driver display to malfunction or reboot. The recalls will begin on September 23rd.\n Certain 2018-2020 Odysseys, 2019-2020 Passports, and 2019-2021 Pilots were outfitted with “[i]ncorrect instrument panel control module software” that can cause the display to not show critical information like speed, engine oil pressure, and gear selector position until the car is turned off and on again. The displays can also randomly reboot, according to  the National Highway Traffic Safety Administration (NHTSA). The malfunctioning software can also prevent the backup camera feed from showing up.\n Honda will notify owners, but they’ll have to get the software reprogrammed by a dealer. No easy over-the-air software fix here.\n  Another recall involves 500,000 of those same vehicles — the 2019-2021 Pilots and the 2019-2020 Passports again, but only 2019-2020 Odysseys. These vehicles also have a problem with their “[i]ncorrect central network software programming” that can cause “several errors to occur that can delay or prevent the rearview camera image from displaying.” The issue can also mess with the in-car audio. Owners of these cars  will have the option of either downloading an over-the-air fix or visiting a dealer.\n This is not the first time Honda has had trouble with software tripping up its rear camera systems. The company recalled  some 232,000 Accords and Insights in 2018 for a similar issue. Fiat Chrysler also recalled  365,000 cars earlier this year for issues with its backup cameras — though that problem had to do with the video feeds staying on too long.\n Honda also announced two other recalls on Tuesday for some of these vehicles. Some 2019-2020 Odysseys were outfitted with faulty backup cameras that have developed distorted images over time, while 2018-2020 Odysseys may have a problem with the sliding door latching.", "posttime": "2020-08-05 10:08:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,软件缺陷,faulty", "title": "本田因软件缺陷召回60.8万辆汽车", "title_en": "Honda Recalls 608,000 Vehicles For Faulty Software", "transed": 1, "url": "https://www.theverge.com/2020/8/4/21354314/honda-recall-software-odyssey-pilot-passport-backup-camera-reboot", "via": "", "real_tags": ["软件", "软件缺陷", "faulty"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个正在进行的工作，每个月都会添加一个新的月份(希望如此)。所以，如果你的约会对象还没有联系上，请再来一次。最近更新时间：2020年8月4日", "note_en": "This is a work-in-progress, with a new month being added each month(hopefully). So please visit again if your date isn&#39;t linked in yet. Last updated: August 4, 2020", "posttime": "2020-08-05 10:07:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,computer", "title": "379个计算机日的一年", "title_en": "A Year of 379 Computer Days", "transed": 1, "url": "http://fivedots.coe.psu.ac.th/~ad/Y379/index.html", "via": "", "real_tags": ["计算机", "computer"]}, {"category": "", "categoryclass": "", "imagename": "ccd3ccad1e589dc265c34432d736b735.jpg", "infoid": 1016324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的冠状病毒保险在头24小时内是免费的。有关最新信息，请访问tampabay.com/coronavirus。请考虑认购或捐赠。\n坦帕-1月的一个晚上，两名青少年闯入柑橘公园地区的一套公寓，其中一人持有武器。一名住在那里的男子开枪打死了他们两人，只有一人幸免于难。\n希尔斯伯勒县警长办公室当时报道，在公寓楼被副警长拦截的另外两名青少年很可能参与了入室盗窃。该办公室表示，所有四名嫌疑人都是盖瑟高中的学生，案件中的刑事指控即将到来。没有公布任何名字。\n七个月过去了，这个案子仍然悬而未决。但《坦帕湾时报》(Tampa Bay Times)本周获得的记录显示，调查人员认为，与这起犯罪有关的一名青少年是格雷厄姆·伊万·克拉克(Graham Ivan Clark)，他周五因被控控制名人推特账户以索要比特币支付而引起国际关注。\n入室盗窃案件出现在一份17岁的克拉克的“姓名报告”中，这份报告是应“泰晤士报”的要求由警长办公室制作的。调查被列为“谋杀-正当杀人罪”。\n目前尚不清楚克拉克是如何参与其中的。警长办公室拒绝详细说明，称调查仍在进行中。当“纽约时报”要求提供案件报告时，该办公室从一份至少652页的文件中提供了13页，其中大部分是经过编辑的。\n此外，在6月份的一项无关调查中，克拉克的母亲告诉一名众议员，“自从她的儿子年初卷入一起杀人案以来，他一直受到几个人的骚扰。”这位副警长查阅了入室行窃案，并指出克拉克“没有积极参与枪击事件”。\n当被问及克拉克是否参与了入室盗窃时，希尔斯堡州检察官安德鲁·沃伦(Andrew Warren)的办公室发表了以下声明：\n“没有证据表明他的角色是什么，枪击发生时他也不在公寓里，尽管考虑到他是一起复杂的全球欺诈案的策划者，他与其他刑事调查有联系也就不足为奇了。”\n根据警长办公室之前发布的入室盗窃信息，其中两名青少年在晚上7：30左右踢进了一个有筛子的后院。1月4日在西蔡斯公寓的四季酒店，谢尔顿路附近的柑橘公园购物中心。然后，这两名青少年从一扇没有上锁的门进入公寓。\n其中一人携带枪支。两人都向居民，一名男子和他的未婚妻提出了要求。根据警长办公室的说法，这名男子拿出一把枪并开枪，击中了两个十几岁的人。\n两名嫌疑人都被送往圣约瑟夫医院。其中一人在那里被宣布死亡。另一名伤者当时情况危急。两名居民都没有受伤。\n警长办公室的一份新闻稿说：“当巡逻人员第一次到达现场时，他们发现了一辆可疑的车，车内有两名青少年。”他们在公寓楼入口处对车辆进行了交通拦截，通过与司机和乘客的交谈，副警员确定这两人很可能也参与了入室盗窃。\n警长办公室证实，这四名嫌疑人年龄在16岁至17岁之间，曾就读于盖瑟。该办公室没有公布动机，但表示侦探们不认为入室行窃是随机的。\n1月6日，也就是学生寒假后返回学校的前一天，盖瑟校长托马斯·莫里尔(Thomas Morrill)给家长发了一封电子邮件，主题是“欢迎回来，令人沮丧的信息”。\n莫里尔写道：“你可能在周末听到了一起公寓楼入室盗窃的消息。”“希尔斯伯勒县警长办公室表示，有四名青少年参与了这起事件，我们了解到这四名青少年是我们学校的学生。”\n莫里尔指出，一名学生死亡，一名学生情况危急。他说，学校没有关于学生身份的信息。\n莫里尔写道：“参与其中的其他学生将面临严重指控，他们将不会回到我们的学校。”\n警长办公室的一份姓名报告显示，17岁的卡洛斯·亚历杭德罗·洛佩兹·坎塞拉也与入室盗窃案有关，并将他列为盖瑟的一名学生。\n根据他的讣告，洛佩兹于1月4日去世，也就是入室盗窃的那一天。希尔斯伯勒县法医办公室拒绝提供洛佩兹的尸检和相关记录，理由是州公共记录法对积极的刑事调查给予豁免。\n一个GoFundMe页面被创建来帮助洛佩兹的母亲为一个“过早被带走”的儿子安排葬礼。该页面将洛佩兹描述为“一个充满爱心、充满爱心、充满生命和光明未来的儿子”。他的家人没有及时回复时报的置评请求。\n警长办公室的记录包括与入室盗窃调查有关的第三名青少年的名字，并将他列为洛佩兹的“朋友”。“泰晤士报”没有公布这名青少年的名字，因为他还没有被指控犯罪。这名青少年在入室盗窃事件发生前四天就满17岁了。\n1月12日创建的GoFundMe页面上说，这名青少年的母亲在1月4日“收到了任何母亲都不想听到的消息”：她的儿子“情况危急……。他的大脑中有一颗碎片子弹。“。该页面寻求捐款，以帮助这家人减轻与他康复相关的“经济负担”。\n周二，当时报联系到男孩的母亲时，她拒绝接受采访。“他是未成年人，我根本不想让他的名字出现在媒体上，也不想以任何方式与格雷厄姆·克拉克联系在一起，”她在Facebook上说。\n她Facebook页面上的公开帖子一直持续到1月份，记录了她儿子的康复情况。1月29日的一篇帖子说，他正在接受语言治疗，并“以优异的成绩”通过了一项认知测试。\n根据一份事件报告，促使一名副手采访克拉克母亲的无关案件源于6月份的一次“猛烈”调查。拍打是网上的行话，指的是向警方虚报家庭内的暴力犯罪，希望能抽出一支特警队。\n6月26日，WFTS-CH。坦帕的28号收到一个自称克拉克的人发来的电子邮件。事件报告称，它威胁要杀死克拉克的父母，并在学校校园内枪杀少数族裔、抗议者和学生，除非收件人寄给他50万美元。报道称，电子邮件中包含的电话号码与克拉克继父拥有的一家公司有关。\n6月27日，当一名副手打电话给这位继父时，他把电话递给了克拉克的母亲，她说她认为自己的儿子正成为目标。\n报告说：“艾米莉亚·克拉克建议说，自从她的儿子今年年初卷入一起凶杀案以来，他已经受到了几个人的骚扰。”它列出了入室盗窃案件的编号，以供参考。\n报告称：“格雷厄姆·克拉克表示，他从未发出过恐吓性电子邮件，也从未威胁过他的父母。”“他过去一直是打人的牺牲品，他认为这是他在互联网上与之互动的不知名的人。”\n报告称，这位副警长查阅了入室行窃案，并指出克拉克“没有积极参与枪击事件”。\n副警长得出结论，格雷厄姆是一个猛烈抨击的目标。报告说，克拉克是一年前的另一次殴打电话的主题，结果是“格雷厄姆·克拉克在一场网络游戏中让某人发疯”。\n在“纽约时报”周日的一篇报道中，克拉克的朋友和熟人称他是一个老练的骗子，在电子游戏“我的世界”中骗取了人们的钱。\n克拉克被控进入著名的Twitter账户，并发送推文，要求他人支付比特币的款项，比特币是一种难以追踪的加密货币。检察官说，克拉克在大约三个小时内收获了11.7万美元。周二，他在希尔斯堡巡回法院对这些指控提出无罪抗辩。", "note_en": "Our coronavirus coverage is free for the first 24 hours. Find the latest information at  tampabay.com/coronavirus. Please consider  subscribing or  donating.\n  TAMPA — One night in January, two teens broke into an apartment in the Citrus Park area, one of them armed. A man who lived there shot them both and only one survived.\n Two other teens stopped by deputies at the apartment complex were likely involved in the home invasion, the Hillsborough County Sheriff’s Office reported at the time. The office said all four suspects were Gaither High School students and that criminal charges in the case were forthcoming. No names were released.\n Seven months later, the case remains open. But records obtained by the  Tampa Bay Times this week show that investigators believe one teen linked to the crime is Graham Ivan Clark, who drew international attention Friday when he was charged with taking control of celebrity Twitter accounts to solicit Bitcoin payments.\n   The home invasion case appears in a “name report” for the 17-year-old Clark that was generated by the Sheriff’s Office at the  Times’ request. The investigation is listed as “murder-justifiable homicide.”\n Just how Clark was involved remains unclear. The Sheriff’s Office declined to elaborate, saying the investigation remains active. When the  Times asked for the case report, the office provided 13 pages, most of them redacted, from a document that’s at least 652 pages.\n  In addition, during an unrelated investigation in June, Clark’s mother told a deputy “that ever since her son was involved in a homicide at the beginning of the year, he has been harassed by several individuals.” The deputy looked up the home invasion case and noted that Clark “did not actively participate in the shooting.”\n  Asked whether Clark was involved in the home invasion, Hillsborough State Attorney Andrew Warren’s office gave this statement:\n  “There is no proof of what his role was and he was not in the apartment when the shooting took place, although it’s not surprising that he had connections with other criminal investigations, considering he was the mastermind of a sophisticated global fraud.”\n    According to information on the home invasion previously released by the Sheriff’s Office, two of the teens kicked in a screened back patio about 7:30 p.m. Jan. 4 in the Seasons at Westchase apartments, off Sheldon Road near the Citrus Park mall. The teens then entered the apartment through an unlocked door.\n  One of them was carrying a firearm. Both made demands of the residents, a man and his fiancée. The man retrieved a gun and opened fire, hitting both teens, according to the Sheriff’s Office.\n Both suspects were taken to St. Joseph’s Hospital. One was pronounced dead there. The other was listed in critical condition at the time. Neither of the residents was injured.\n  “When patrol deputies first arrived on scene, they located a suspicious vehicle with two teenagers inside,” a Sheriff’s Office news release said. “They conducted a traffic stop on the vehicle at the entrance of the apartment complex, and through talking to the driver and passenger, deputies determined the two were likely involved in the home invasion as well.”\n   The Sheriff’s Office confirmed the four suspects were age 16 to 17 and attended Gaither. The office did not release a motive but said detectives did not believe the home invasion was random.\n On Jan. 6, the day before students returned to school after winter break, Gaither principal Thomas Morrill sent an email to parents with the subject line, “Welcome Back and Disheartening Information.”\n “You may have heard news from over the weekend of a home invasion at an apartment complex,” Morrill wrote. “The Hillsborough County Sheriff’s Office says four teens were involved in the incident and we have learned that the teens were students at our school.”\n  Morrill noted that one student died and one was in critical condition. He said the school had no information about the identities of the students.\n “The other students who were involved, face serious charges and will not be returning to our school,” Morrill wrote.\n  A Sheriff’s Office name report shows 17-year-old Carlos Alejandro Lopez Cancela was also linked to the home invasion case and lists him as a Gaither student.\n According to his obituary, Lopez died on Jan. 4, the day of the home invasion. The Hillsborough County Medical Examiner’s Office declined to provide Lopez’s autopsy and associated records, citing an exemption in state public records law for active criminal investigations.\n A GoFundMe page was created to help Lopez’s mother with funeral arrangements for a son who “was taken too soon.” The page describes Lopez as “a loving and caring son full of life and a bright future.” His family did not respond to a request for comment from the  Times in time for publication.\n Sheriff’s Office records include the name of a third teen linked to the home invasion investigation and list him as a “friend” of Lopez’s. The  Times is not publishing the name of the teen, who turned 17 four days before the home invasion, because he has not been charged with a crime.\n  A GoFundMe page created Jan. 12 says this teen’s mother “received news that no mother ever wants to hear” on Jan. 4: Her son was in “critical condition ... with a fragmented bullet in his brain.” The page sought donations to help the family with “the financial burden” associated with his recovery.\n The boy’s mother declined to be interviewed when reached by the  Times on Tuesday. “He is a minor and I do not want his name in the media at all or associated with Graham Clark in any way,” she said in a Facebook message.\n Public posts on her Facebook page through the month of January chronicle her son’s recovery. A Jan. 29 post says he was undergoing speech therapy and had passed a cognitive test “with flying colors.”\n  The unrelated case that prompted a deputy’s interview with Clark’s mother stemmed from a “swatting” investigation in June, according to an incident report. Swatting is online lingo for false reports to police about violent crime inside a home, filed in hopes of drawing out a SWAT team.\n On June 26, WFTS-Ch. 28 in Tampa received an email from someone claiming to be Clark. It contained threats to kill Clark’s parents and shoot minorities, protesters and students on school campuses unless the recipient sent him $500,000, the incident report says. The phone number included in the email was linked to a company owned by Clark’s stepfather, according to the report.\n  When a deputy called the stepfather on June 27, he handed the phone to Clark’s mother, who said she believed her son was being targeted.\n “Emiliya Clark advised that ever since her son was involved in a homicide at the beginning of the year, he has been harassed by several individuals,” the report says. It lists the the home invasion case number for reference.\n  “Graham Clark advised he has never sent out threatening emails and has never threatened his parents,” the report states. “He has been (a) victim to swatting in the past and believes it to be the unknown people on the internet he interacts with.”\n The deputy looked up the home invasion case and noted that Clark “did not actively participate in the shooting,” the report says.\n The deputy concluded that Graham was the target of a swatting call. The report says Clark was the subject of another swatting call a year earlier that resulted “after Graham Clark made someone mad in an online game.”\n In a  New York Times report Sunday, friends and acquaintances of Clark’  described him as an adept scammer who cheated people out of their money in the video game Minecraft.\n Clark is accused of gaining access to prominent Twitter accounts and sending tweets soliciting others to send in payments of the Bitcoin, the hard-to-track cryptocurrency. Prosecutors say Clark reaped $117,000 over about three hours. He pleaded not guilty to the charges Tuesday in Hillsborough Circuit Court.", "posttime": "2020-08-05 10:06:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,黑客,入室,mastermind,办公室", "title": "警方称，推特黑客的青少年策划者参与了致命的入室盗窃", "title_en": "Teen mastermind of Twitter hack was involved in fatal home invasion, say police", "transed": 1, "url": "https://www.tampabay.com/news/hillsborough/2020/08/04/tampa-teen-accused-in-twitter-hack-linked-to-deadly-home-invasion-records-show/", "via": "", "real_tags": ["推特", "黑客", "入室", "办公室"]}, {"category": "", "categoryclass": "", "imagename": "56fb350e960a47b3297554d19598864c.jpg", "infoid": 1016322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近估值11.6亿美元的移动应用测试公司HeadSpin计划向投资者返还至多9500万美元的资金，此前对财务违规行为的内部审查迫使其重新申报财务状况。\n在这项此前未被报道的审查之前，董事会发现，该公司到年底的年度经常性收入仅为1,500万美元，与2月份预测的1亿美元的ARR相比，这只是一个零头。该公司罕见地将其C系列股票的价值降低了近80%，赋予了一个新的股价，这意味着估值不到2.5亿美元。HeadSpin证实了资本重组计划，但表示尚未为公司建立新的估值。\n该公司还用一位新的首席执行官取代了首席执行官兼联合创始人曼尼什·拉赫瓦尼(Manish Lachwani)。前软银总裁、现任HeadSpin董事会主席尼基什·阿罗拉(Nikesh Arora)帮助领导了内部审查。\n一批新的初创公司正在为冠状病毒时代开发视频通信和虚拟活动软件。在风险投资的支持下，这些新生公司的领导人并没有被中科的主导地位吓倒，他们表示，他们提供了更有效的方式来结识新人、举办活动和与同事沟通-这些工具将比新冠肺炎更持久。", "note_en": "HeadSpin, a mobile app testing company recently valued at $1.16 billion, plans to return up to $95 million in funding to investors after an internal review of financial irregularities forced it to restate its financials.\n The previously unreported review follows the board’s discovery that the company was on track to post only $15 million in annual recurring revenue by year’s end, a sliver of the $100 million in ARR it forecast in February. In a rare move, the company would lower the value of its Series C stock by nearly 80%, assigning a new share price that implies a valuation of less than $250 million. HeadSpin confirmed the recapitalization plan, but said it has not established a new valuation for the company.\n The company has also replaced CEO and co-founder Manish Lachwani with a new chief executive. Nikesh Arora, a former SoftBank president who now chairs HeadSpin’s board, helped lead the internal review.\n  A new spate of startups is building video communication and virtual event software for the coronavirus era. Backed by venture capital funding and undeterred by Zoom’s dominance, leaders of these nascent firms say they offer more-effective ways to meet new people, host events and communicate with colleagues—tools that will outlast Covid-19.", "posttime": "2020-08-05 09:35:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "首席,replaced", "title": "HeadSpin将向投资者返还高达9500万美元，并在内部审查发现财务违规后更换了首席执行官；初创公司目前估值2.5亿美元", "title_en": "HeadSpin to return up to $95M to investors and has replaced its CEO after an internal review revealed financial irregularities; startup now valued at $250M", "transed": 1, "url": "https://www.theinformation.com/articles/startup-headspin-to-return-funding-after-probe-of-financial-statements", "via": "", "real_tags": ["首席", "replaced"]}, {"category": "", "categoryclass": "", "imagename": "1ca929dedbfc94fc128760600e7110d3.jpg", "infoid": 1016321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦(CNN商业报道)周二，谷歌对健身追踪公司Fitbit的收购遇到了新的障碍，因为欧盟委员会宣布正在对这笔交易展开深入的反垄断调查。\n欧盟最高反垄断监管机构表示，它担心此次收购将进一步巩固谷歌(Google)在在线广告领域的市场地位，增加谷歌可以用来对其服务和显示的广告进行个性化处理的大量数据。\n去年11月，谷歌宣布将收购全球领先的可穿戴健身活动跟踪器制造商Fitbit。\n这笔交易价值约21亿美元，是谷歌最大的收购交易之一，代表着该公司进军智能手表和其他可穿戴设备领域的重要一步。\n欧盟委员会已经对这笔交易展开了初步调查。该公司表示，谷歌承诺不将Fitbit数据用于广告目的，不足以解决最初调查中发现的担忧。\n欧盟委员会最高反垄断官员玛格丽特·维斯特格(Margrethe Vestager)在一份声明中表示，欧洲消费者使用可穿戴设备及其产生的数据预计将大幅增长。\n维斯特格说：我们的调查旨在确保谷歌对这笔交易通过可穿戴设备收集的数据的控制不会扭曲竞争。\n谷歌和其他大型科技公司在美国和欧洲面临越来越大的反垄断压力。上周，谷歌首席执行官桑达尔·皮查伊与苹果(Apple)、Facebook(Facebook)和亚马逊(Amazon)的首席执行官一起在美国国会议员面前作证。在欧洲，谷歌已经因违反欧盟竞争法而被处以数笔罚款。\n谷歌负责设备和服务的高级副总裁里克·奥斯特罗(Rick Osterloh)在一篇博客文章中表示，这笔交易涉及的是设备，而不是数据，他说这是一个竞争激烈的市场。\n奥斯特罗说：我们从一开始就很清楚，我们不会在谷歌广告中使用Fitbit的健康数据。我们最近提出就我们对Fitbit数据的使用向欧盟委员会做出具有法律约束力的承诺。正如我们对所有产品所做的那样，我们将让Fitbit用户选择查看、移动或删除他们的数据。\n奥斯特罗补充说，谷歌将与欧盟委员会(European Commission)合作，采取一种方法来满足消费者对其可穿戴设备的期望。", "note_en": "London (CNN Business)Google&#39;s acquisition of fitness tracking company Fitbit hit a new snag on Tuesday, as the European Commission  announced it is launching an in-depth antitrust investigation into the deal.\n The European Union&#39;s top antitrust regulator said it is concerned that the takeover would further strengthen  Google&#39;s  (  GOOGL) market position in online advertising by &#34;increasing the already vast amount of data that Google could use for personalization of the ads it serves and displays.&#34;\n Google  announced it was buying  Fitbit  (  FIT), the world&#39;s leading maker of wearable fitness activity trackers, in November.\n   The deal, worth about $2.1 billion, is one of Google&#39;s largest acquisitions and represents an important step for the company into smartwatches and other wearable devices.\n  The Commission had already launched a preliminary investigation into the transaction. It said a commitment by Google not to use Fitbit data for advertising purposes was insufficient to address the concerns identified in the initial probe.\n  The Commission&#39;s top antitrust official, Margrethe Vestager, said in a statement that the use of wearable devices by European consumers, as well as the data generated by them, is expected to grow significantly.\n &#34;Our investigation aims to ensure that control by Google over data collected through wearable devices as a result of the transaction does not distort competition,&#34; Vestager said.\n Google and other big tech companies under growing  antitrust pressure in the United States and  Europe. Google CEO Sundar Pichai  testified last week in front of US lawmakers alongside his counterparts from  Apple  (  AAPL),  Facebook  (  FB) and  Amazon  (  AMZN). In Europe, Google has already been hit with several  fines for breaching EU competition law.\n  In a  blog post, Google Senior Vice President for Devices and Services Rick Osterloh said the deal &#34;is about devices, not data,&#34; a market he said is full of competition.\n &#34;We&#39;ve been clear from the beginning that we will not use Fitbit health and wellness data for Google ads,&#34; Osterloh said. &#34;We recently offered to make a legally binding commitment to the European Commission regarding our use of Fitbit data. As we do with all our products, we will give Fitbit users the choice to review, move or delete their data.&#34;\n Osterloh added that Google will work with the European Commission &#34;on an approach that addresses consumers&#39; expectations of their wearable devices.&#34;", "posttime": "2020-08-05 08:47:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,谷歌,google,欧盟,eu", "title": "官方消息：欧盟对谷歌收购Fitbit展开反垄断调查", "title_en": "It's Official: EU Launches Antitrust Probe Into Google's Fitbit Takeover", "transed": 1, "url": "https://www.cnn.com/2020/08/04/tech/google-fitbit-antitrust-eu/index.html", "via": "", "real_tags": ["rust", "谷歌", "google", "欧盟", "eu"]}, {"category": "", "categoryclass": "", "imagename": "0bd2154884a3a7e6eda2d27e28fc2cb5.jpg", "infoid": 1016320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook的Messenger推出了对其聊天插件的重大更新，这将使企业能够通过他们的网站与客户沟通，即使他们没有登录Facebook。\n聊天插件还采用了经过改进的设计，旨在使对话变得更容易、更直观。\nMessenger产品经理珍妮·李(Jenny Li)周二在一篇博客文章中表示，测试新聊天插件的企业发现，询问其产品和服务的客户增加了45%。\n拥有Facebook页面的企业可以通过Facebook页面设置或通过Haravan、ManyChat和WooCommerce等合作伙伴在其网站上免费安装聊天插件。\nBlendJet首席执行官莱恩·潘普林在博客文章中说：“与我们的客户保持畅通的沟通渠道让他们从浏览阶段到最终结账都有一种自信的感觉。我们注意到，与我们合作的客户退房的可能性是我们的三到四倍。有了聊天插件，我们可以接触到更多的客户，自从将其作为客户互动渠道提供以来，我们的销售额增加了两倍。“。\nRecart创始人Soma Toth补充说：“作为一名开发者，说服一家企业使用面向所有客户的实时聊天服务要容易得多。我们的企业客户看到销售直接与Messenger上的参与度捆绑在一起，聊天插件帮助他们在Facebook页面和网站上利用相同的投资，而不需要额外的成本。它还降低了与未登录Facebook的用户合作或支持后备的复杂性。“", "note_en": "Messenger From Facebook rolled out a major update to its  chat plugin that will enable businesses to communicate with their customers via their websites, even if they are not logged into Facebook.\n  The chat plugin also features a revamped design aimed at making conversations easier and more intuitive.\n Messenger product manager Jenny Li said in a blog post Tuesday that businesses testing the new chat plugin saw a 45% increase in customers inquiring about their products and services.\n Businesses with Facebook pages can install the chat plugin on their websites free-of-charge via  Facebook page settings or through partners including Haravan,  ManyChat and  WooCommerce.\n  BlendJet CEO Ryan Pamplin said in the blog post, “Having an open line of communication with our customers gives them a sense of confidence from the browsing stage to final checkout. We noticed that customers who engage with us are three to four times more likely to check out. With the chat plugin allowing us to reach more customers, we’ve tripled our sales since offering it as a customer engagement channel.”\n  Recart founder Soma Toth added, “As a developer, it’s much easier to convince a business to use a live chat offering that is available to all of their customers. Our business customers are seeing sales directly tied to engagement on Messenger, and the chat plugin helps them leverage the same investment across both their Facebook page and their website at no additional cost. It also reduces the complexity of having to work with or support a fallback for users who are not logged into Facebook.”", "posttime": "2020-08-05 08:46:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "adweek,客户", "title": "AdWeek", "title_en": "Adweek", "transed": 1, "url": "https://www.adweek.com/digital/messenger-from-facebook-revamps-its-chat-plugin/", "via": "", "real_tags": ["adweek", "客户"]}]