[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1068447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个博客文章中我们＆＃39; ll涵盖系统如何形成集群，实际上是什么集群以及他们的职责是什么。我们＆＃39; LL还呈现了不同的协议，以满足与他们相关的各种权衡的群集的需求。\n 为了使这个博客发表一点更实用，我们也会深入了解了众议员协议之一 - 从游泳首字母缩略词中的一个隶属协议 - 从理论上的角度来看，在F＃中实现了示例。\n  从用户的角度来看，群集应该用作A＆＃34;单机＆＃34的幻觉;并将其免于与 - 通常动态变化 - 互联服务器网络的所有复杂性安全。\n 正如事实证明，那里的一系列协议和责任是群集的一部分需要解决以维持这种幻觉。走下自下而上，这里是我们集群通常需要知道如何回答的一些问题：\n 如何加入群集？通常，当我们有一个我们想要加入群集的新服务器节点时，它需要知道如何与已有群集本身的一部分的另一个节点通信。哪里可以找到这个信息？它＆＃39;是需要回答的问题：最简单的诀窍是为新服务开始时提供的配置参数提供静态的联系点列表。\n 另一种方法是使用第三方服务（如数据库，Scenul，etcd或zookeeper）用作节点注册表。我们的集群通常不会生活在真空中，有时我们可以重复使用其他已经建立的服务以获得优势。\n 在某些情况下，我们可以利用低层Kubernetes DNS服务或MDNS的功能 - 特定于主机环境，以动态发现生活在同一网络中的其他设备。 \n我们如何知道其他节点是群集的一部分？这是所谓的会员协议的区域，我们＆＃39; ll焦点在本博客文章的第二部分。在动态集群中，它通常通过跟踪活动发现的节点来完成，然后在节点连接/离开群集时更新和闲置它们。这里的许多决定依赖于部署方案 - 在同一数据中心内形成群集的服务具有不同的特征，从例如eg。移动设备的网格。在托管在同一数据中心托管的常见后端服务的情况下，每个节点都会保持有关群集状态的完整信息。这就是游泳操作的协议。\n 其他成员资格协议（如hyparview）启用只能在群集中映像。如果我们的群集在更高的尺度上操作时，则这是优选的。成千上万的节点（通常生活在数据中心的大多数集群服务Don＆＃39; t达到几十多个服务器）。\n 我们如何将消息从一个节点发送到另一个节点？这通常也与隶属协议有关。大多数以数据中心为导向的系统可以保守假设系统中每个节点都可以连接到每个其他节点，形成（潜在地）完全连接的网格。\n 在其他场景中，我们需要考虑到某些节点可能无法连接到其他节点 - 因为网络特征潜在的网络特征。虽然当我们谈论群集协议时，最常见的情况是客户服务器架构，但常常需要应用更高级的方案（如我们所提到的，＆＃34;服务器＆＃34;本身不是单一的实体）。\n 我们如何检测到死区？也称为失败检测。该领域最古老的知识是每立即在预期超时边界内的Ping🡘ACK消息的简单交换，或者只是期望在给定时间间隔内发送心跳消息。心跳通常直接进入运输层（如TCP），有时是我们＆＃39;重新能够直接捎带失败探测器。该解决方案的缺点是，虽然运输层本身是响应的 - 因为它通常由底层操作系统管理 - 我们的应用层实际上不是（例如，因为它无限期地挂起了僵化的僵局）。另一件事是网络连接的时间失败并不是意味着，那个节点赢得了＆＃39; t试着重新启动并继续工作。\n 更常见的是，会员协议促进自己的心跳算法。什么＆＃39;在这里值得注意，缺少心跳并不一定意味着，我们的节点已经死亡。它也可能不堪重负，提供其他传入请求。像Phi Accuctuct Dector或Lifeguard这样的现代算法（上面提到的游泳协议的扩展）考虑到这一行为。\n 这些是最基本的问题需要知道如何回答。我们可以称之为任何群集的第0层。本博客文章的主要部分将涵盖如何实施解决这些问题的协议。在它之上，还有许多其他更高的级别功能，旨在解决以下问题： \n我们如何检测/响应定期网络分区？通常被称为分裂性情景的问题。它来自基本观察，即它＆＃39;■不可能在网络边界中区分死区。它可以导致风险非常危险的情况，比如将我们的集群分成两个，每个人都相信，它＆＃39;唯一一个活着，导致数据不一致甚至腐败。没有一个简单的治疗方法，那就是为什么一些系统（如akka.net分裂大脑resolvers）根据我们关心的权衡提供不同的策略。\n 不同的节点如何推理和决定群集中的状态？这种情况通常在负责数据管理（如分布式数据库）的系统中是常见的。由于节点必须能够为传入请求提供服务，因此有时它们可​​能会遇到对系统状态的冲突决策。在没有过多的细节中，两个通用方法两个问题是：避免冲突，这通常假设节点必须在提交决策之前建立关于系统状态的共识。它通常需要建立（和维护）节点之间的一些领导者，通过仲裁节点或两者组合同步。这是筏，ZAB或Paxo等流行协议的区域。\n 解决接受国家冲突的可能性出现的冲突 - 主要是在长期延迟或周期性地发生的权衡或定期无法访问的服务器中进行的权衡 - 但是以足够的元数据丰富，使得所有节点可以单独达到与结果状态的相同结论共识。这是一个主导地区的免除自由复制数据类型，您可以读取eg。在这里发布的博客文章中。\n 如何将请求路由到集群内部的给定资源？我们的系统状态通常由多种可寻址实体组成 - 通常复制，以便更高的可用性和弹性。然而，通常整个状态太大，无法适合任何一个节点。出于这个原因，它经常动态地在整个群集中划分。现在恳求一个问题：如何告诉，哪个节点包含一些虚拟键标识的实体？天真的方法是询问一些节点的子集希望，其中至少有一个将有我们希望的数据。给定群集的N个节点和实体复制了R次，我们应该能够在调用（n / r）+1节点后到达我们的资源。\n 更常见的方式是保留注册表，该注册表具有有关系统中每个单个实体的当前本地化的信息。由于这种方法并不展示，在实践中，我们在实践中，在分区中组合并将实体共同定位在一起，因此压缩了注册表以存储有关整个分区的信息而不是单个实体。在这种情况下，资源ID是（PartitionD，EntityID）的复合键。这是如何。 akka.cluster.arding或Riak核心作品。通常可以在每个节点上缓存一些热（常用）分区的一些子集，以便减少询问中央注册表甚至注册表本身可以是复制的商店。\n 我们还可以使用分布式哈希表 - 散列我们的实体密钥，然后映射到特定节点，该节点负责将属于关键空间的特定空间子集的资源（所有可能的哈希值的范围）。有时这可能意味着，首先尝试我们错过节点。因为群集状态正在发生变化，因此需要应用更多跳跃。 Microsoft Orleans和Cassandra使用该方法是流行的解决方案。\n 正如你所看到的，即使我们没有问过所有的问题，那里有很多事情发生了很多事情，并且可以根据我们的系统愿意采取的权衡来解决不同的方法。 \n在那里＆＃39;今天的机会在未来做出一个单独的文章，今天我们＆＃39; ll完全专注于游泳 - 在领事和持续几年中的系统中的系统中使用 - 如它＆＃39 ;很容易实现良好的开始。为了提高其弹性，减少假阳性故障检测，结账关于救生员的谈判 - 一系列关于原始游泳协议的扩展和观察。\n   新节点想要加入群集 - 如何使其发生，以及如何在群集中通知关于该事件的其他节点？\n  节点突然终止或者无法达到任何更长。如何检测到其他事实的信息？\n 虽然前两种情况很容易，但所有的复杂性都带有第三种情况。我们需要发现节点是否无法达到，但是＆＃39; s还不够 - 由于临时网络故障可能发生在同一数据中心内，他们通常会迅速愈合。我们不想恐慌并将节点扔出群集，因为我们可以在分开第二个中达到它。这将导致非常摇摇欲坠和脆弱的集群。\n 我们已经提到了心跳机制 - 每一个现在，然后我们将ping消息发送到其他随机节点。预计此节点将在预期超时之前用ACK回答。简单的。\n  现在，如果节点没有在超时回应的情况下会发生什么？正如我们所说，我们不想过度反应。所以我们不要考虑这个节点已经死了。相反，我们认为它是怀疑并告知别人我们的怀疑。接收嫌疑八卦的其他节点预计它将在指定的超时中确认 - 否则他们将考虑一个恶作剧，并从其疑似列表中删除节点。\n  现在我们所需要的只是确认 - 为了这样做，我们需要向别人询问别人进行验证。所以我们＆＃39;重新选择另一个未经用的节点，并要求它为我们的ping嫌疑人（此请求被称为ping-req）。现在，如果该调解员从嫌疑人那里收到ACK，我们知道节点是活着的，只是我们的网络连接被切断了原因： \n在另一边，如果我们的调解员也没有收到Ack，我们现在有两只手验证，节点对大量时间框架无响应 - 因此它可以确认为每个人死亡。\n  当然这一点并不意味着节点确实死了 - 一个转义机制是，如果怀疑将获得关于自己的可疑通知，它可以通过广播活动来覆盖它。可能有不同的原因，为什么怀疑＆＃39; t按时回应：它可能太占用（由其他请求的积压或ev。停止 - 世界垃圾收集的底层VM）。也可能发生，我们的网络分开了分开的集群 - 这种现象被称为分裂性。\n 最终没有办法保证100％可靠的故障检测。我们＆＃39;重新交易合理的错误失败比，我们如何迅速地检测到节点作为死亡 - 通常这两个目标相互互相努力。在游泳方面，我再次建议查找救生员，该救生员地解决了一些提到的方案。然而，我们＆＃39; LL在下面的实施中没有涵盖它，以保持简洁。\n  现在，我们＆＃39;重新实际实施该协议。为了这样做＆＃39;重新应用一些简化 - 我们＆＃39; ll这样做，使协议更容易理解：\n 一般来说要关联特定请求/响应消息，我们应该使用某种形式的序列号。这可能导致场景，当A向B发送Ping1请求时，其与Ack1响应，一段时间后者将另一个Ping2发送到B并接收Ack1回来 - 问题是它不能告诉该消息的问题是为了确认这条消息。这种情况非常罕见，但不是不可能的。如果也可能导致＆＃34;复活和＃34;死亡节点。\n 虽然我们＆＃39;重新进入肩背上的肩带 - 像纸张暗示 - 我们每次都只是八卦整个会员国。它不是最优越的方式，但它＆＃39; ll工作足够好。\n PS：避免使用每个八卦发送整个状态的其他方式是计算当前节点成员身份视图的一致哈希，并将该散列放在ping内而不是完整视图。这样我们的ping就会携带哈希值，这是响应者可以与自己状态的哈希相比。只有当哈希不同（大多数时间都有大部分时间的集群，他们在他们不时的时间和＃39; t），我们＆＃39;重新将会员状态放在Ack之上。 \n此处使用的代码可在本发明员中提供，我建议使用，如我们＆＃39; LL在这里不涵盖所有内容。\n  由于我们不想处理节点到节点通信的所有复杂性，我们＆＃39; LL只是在抽象之上构建一个模型，这将让我们评估算法，而不会导致解决其他问题。以下基本先决条件是：\n 一个传输层，让我们向另一个（可能远程）端点发送消息。我们希望处理管理网络连接或序列化详细信息。\n 可访问端点后面的代理，能够为多个请求提供服务并以线程安全方式更改其状态。\n 由于这些原因，我将使用Akka.net/Kkling和模拟我们的节点使用生活在同一过程中的演员。您可以轻松地采用它以通过Akka.Remote连接的不同演员系统。我们将此作为培训练习 - 在实践中，如果您想在Akka中使用群集，您已经在Akka.Cluster顶部建立了整个生态系统，这些生态系统都在处理会员资格 - 以及引言中提到的其他问题 - 适合您。\n 我们的演员将通过提供它的初始联系点列表来创建：这些是已知为群集的一部分的端点：\n 打开akklinguse sys = system.create＆＃34;游泳群和＃34; ＆lt; | configuration.parse config //在此示例中，其他//`b`是生活在其他节点上的其他//游泳集群成员的演员​​refs。让C =产卵系统＆＃34;节点B＆＃34; ＆lt; |道具（游泳.Membership [A; B]） \n为了创建该演员，我们需要处理加入过程。这个想法是我们＆＃39; ll尝试从提供的列表中挑选端点（它对应于Akka.Cluster中的种子节点地址）并向它们发送加入请求。如果群集节点演员将接收这样的请求，则＆＃39; s义务通过向所有群集成员发送加入响应（包括请求者）来接受它。\n 如果加入WORN和＃39; T到达，例如。因为我们错误地配置了我们的群集和其他端点，所以达到了＆＃39; t and＃39;我们等待一段时间并从列表中尝试另一个节点。这可以表示为：\n 让成员身份（种子：端点列表）（CTX：Actor＆lt; _＆gt;）=设态= {mylising = {endpoint = ctx.self} Active = set.empty嫌疑人= map.empty}（* actor代码的其余部分.. 。*）让REC加入州取消=演员{匹配！ ctx.receive（）与|职工[]  - ＆gt;返回停止//未能加入任何会员|职工（下一个::剩下） - ＆gt;下一个＆lt;加入State.Myself让Call取消= CTX.schedule Connectimeout CTX.Self（剩余剩余）返回！加入州取消|加入八卦 - ＆gt; CANCEL.CANCEL（）//取消加入超时返回！成为州八卦|当peer = statem.myself  - ＆gt; //建立新群集取消.Cancel（）//取消加入超时返回！成为州（set.singleton state.myself）| _  - ＆gt;返回未处理的}匹配种子| []  - ＆gt;成为州（set.singleton state.myself）|种子::剩下 - ＆gt;种子＆lt;加入State.Myself让Call = CTX.Schedule Connectimeout CTX.Self（剩余剩余）加入州取消\n 接收到加入的请求Actor将自己视为群集的操作成员，准备工作。从现在开始，它将触发自身，以定期检查其他人是否保持响应：\n 让合并八卦状态= {youst active = state.active + gossip}让berseready状态gossip = ctx.schedule pinginterval ctx.self nextround |＆gt;忽略就绪（合并八卦状态）\n 如前所述，在这种情况下，八卦只是一整套活动集群成员，而准备好是用于标准群集活动的演员行为：\n 让Recrade State =演员{匹配！ ctx.receive（）使用//其他消息处理程序| _  - ＆gt;返回未处理} \n由于我们从请求者方面覆盖了加入程序，因此为操作集群成员提供了：\n 比赛！ ctx.receive |.加入peer  - ＆gt;让Gossip = Set.Add Peer状态。Active Let Msg =加入八卦八卦|＆gt; set.remove state.myself |＆gt; set.iter（有趣的peer  - ＆gt; peer.endpoint＆lt; msg）返回！准备就绪{状态与active = gossip} |加入八卦 - ＆gt;返回！准备好（合并八卦状态）//其他处理程序\n 正如我们所说，一旦新成员试图加入，我们只需将我们的活动成员状态更新并将其汇报到加入消息中的所有其他成员，因此它们也可以更新。\n 现在，让＆＃39; s覆盖ping过程。首先，我们提到我们现在想要触发我们的会员，然后 - 当我们计划成比赛中的Nextround事件时，您可以看到。现在它如何工作？我们＆＃39;重新选择一个节点随机 - 除了当前的一个没有疑似（嫌疑人是＆＃39; t按时回复ping的节点） - 并向它发送ping请求。与此同时，我们还安排了该请求完成的超时：\n 让选择同行=匹配set.count对等体0  - ＆gt;没有|数 - ＆gt;让idx = threadlocalrandom.current.next计数一些（SEQ.ITEM IDX对等体）让就绪状态= ACTOR {匹配！ ctx.receive（）与| nextround  - ＆gt; ctx.schedule pinginterval ctx.self nextround |＆gt;忽略让嫌疑人= state.suspects |＆gt; Map.Toseq |＆Gt; seq.map fst |＆gt; set.ofseq让别人=（set.remove state.myself state.active） - 嫌疑人//随意选择一个成员，除了自我而不是标记为怀疑匹配选择没有 - ＆gt;返回！就绪状态|一些同伴 - ＆gt; //将ping请求发送到该对等体和调度超时peer.endpoint＆lt; ping（state.active，ctx.self）让取消= ctx.schedule pingtimeout ctx.self（pingtimeout peer）让skiplist = set.ofArray [|州。同伴|]回来！准备{state with suspects = map.add peer（取消，waitpingack skiplist）state.suspects} | ping（八卦，发件人） - ＆gt; //回复传入ping ricking sender＆lt ;! Pingack（州.MYSELF，State.active）返回！准备好（合并八卦状态）//其他处理程序}\n 在这里，我们使用我们的嫌疑人映射来跟踪超时取消和跳过列表。什么＆＃39;跳过列表？我们很快掩盖了。正如我们所提到的那样，当Pingack＆＃39; t准时到达时，我们会选择另一个成员（随意）并要求它使用pingreq消息来为我们审视我们的嫌疑人。这样，我们试图在我们的故障检测算法中减轻假否定的风险：\n 让准备状态=演员{匹配！ ctx.receive（）与| Pingreq（嫌疑人，八卦，发件人） - ＆gt;让取消= ctx.schedule IndirectpingTimeout CTX.Self（PingTimeout Suspect）嫌疑次数.EndPoint＆lt; ping（state.active，ctx.self）退货！准备{Merge Gossip州与嫌疑人= map.add嫌疑人（取消，等待，等待reqack）state.suspects \n...... ", "note_en": "In this blog post we&#39;ll cover how systems form clusters, what clusters actually are and what are their responsibilities. We&#39;ll also present different protocols responsible to serve the needs of the clusters with a various tradeoffs associated with them.\n To make this blog post a bit more practical, we&#39;ll also go in depth of one of the membership protocols - known as under SWIM acronym - from theoretical standpoint up to example implementation in F#.\n  From a user perspective, cluster is supposed to serve as an illusion of a &#34;single machine&#34; and keep it  safe from all of complexity coming from communicating with - usually dynamically changing - network of interconnected servers.\n As it turns out, there&#39;s a multitude of protocols and responsibilities that services being a part of cluster need to solve to maintain that illusion. Going bottom-up, here are some of the questions our cluster usually needs to know how to answer for:\n How to join the cluster? Usually when we have a new server node, which we want to join to the cluster, it needs to know how to communicate with another node that&#39;s already part of the cluster itself. Where can it find that information? It&#39;s the question that needs to be answered: The simplest trick is to provide a static list of contact points as a configuration parameter provided at the start of new service.\n Another way is to use 3rd party service (like database,  Consul,  etcd or  ZooKeeper) to serve as a node registry. Our cluster usually doesn&#39;t live in vacuum, and sometimes we can reuse other already established services for our advantage.\n In some situations, we could leverage capabilities of lower layers - like  Kubernetes DNS service or  mDNS - that are specific to a host environment to dynamically discover other devices living in the same network.\n How do we know what other nodes are part of the cluster? This is area of so called membership protocols on which we&#39;ll focus in second part of this blog post. In dynamic clusters it&#39;s usually done by keeping track of a active discovered nodes, then updating and gossiping them once a node joins/leaves the cluster. A lot of decisions here depend on deployment scenario - services forming a cluster within the same datacenter have different characteristics from eg. meshes of mobile devices. In cases of common backend services hosted in the same datacenter, each node keeps a full information about the state of the cluster. This is how protocols like  SWIM operate.\n Other membership protocols (like  HyParView) enable to have only partial view on the cluster. This is preferable in cases when our cluster operates on much higher scale eg. thousands of nodes (usually most clustered services living in datacenters don&#39;t reach over dozens-to-hundreds of servers).\n How do we send messages from one node to another? This usually is also related to a membership protocol. Most datacenter-oriented systems can make conservative assumption that every node in the system can connect to every other node, forming (potentially) a fully connected mesh.\n In other scenarios, we need to take into account that some of the nodes may not be able to connect to others - because of the underlying network characteristics. While the most common case of that is client-server architecture, when we&#39;re talking about cluster protocols, often more advanced scenarios need to be applied (as we mentioned, &#34;server&#34; itself is not a single entity).\n How do we detect dead nodes? Also known as failure detection. The oldest known trick in that area is a simple exchange of PING 🡘 ACK messages within expected timeout boundaries every now and then, or simply expecting every connection to send a heartbeat message within given time interval. Heartbeats are often implemented directly into transport layer (like TCP), sometimes we&#39;re able to piggyback failure detector directly on top of it. Downside of that solution is that while transport layer itself is responsive - because it&#39;s usually managed by underlying OS - our application layer could in fact be not (eg. because it hangs deadlocked indefinitely). Another thing is that temporal failure of network connection doesn&#39;t has to mean, that node won&#39;t try to restart it and continue to work.\n More often, membership protocols promote their own heartbeat algorithms. What&#39;s worth noticing here, missing heartbeat doesn&#39;t necessarily mean, that our node is dead. It could as well be overwhelmed with serving other incoming requests. Modern algorithms like  Phi accural failure dector or  Lifeguard (an extension to SWIM protocol mentioned above) take that behavior into account.\n These are the most basic questions cluster needs to know how to answer. We could call it a layer 0 of any cluster. The main part of this blog post will cover how to implement protocol addressing these issues. On top of it, there are many other higher level features, aiming to solve problems like:\n How can we detect/respond to periodic network partitions? A problem often known as  split-brain scenario. It comes from basic observation that  it&#39;s not possible to differentiate dead node from unresponsive one over network boundary. It can lead to very risky situations, like splitting our cluster in two, each one believing, it&#39;s the only one alive and causing data inconsistency or even corruption. There&#39;s no one simple cure for that, that&#39;s why some systems (like  Akka.NET split brain resolvers) offer different strategies depending on the tradeoffs, that we care for.\n How different nodes can reason and decide about the state in the cluster? This case is usually common in systems that are responsible for data management (like distributed databases). Since nodes must be able to serve incoming requests, sometimes they may possibly run into making conflicting decisions about the state of the system. Without going into too much details, two generic approaches two this problem are: Avoiding conflicts, which usually assumes that nodes must establish consensus about state of the system before committing to their decisions. It usually requires establishing (and maintaining) some leader among the nodes, synchronizing via quorum of nodes or combination of two. This is area of popular protocols such as  Raft,  ZAB or Paxos.\n Resolving conflicts which accepts the possibility of state conflict to appear - mostly as a tradeoff happening in face of long latencies or periodically unreachable servers - but enriches it with enough metadata so that all nodes individually can reach the same conclusion about the result state without need of consensus. This is a dominant area of Conflict Free Replicated Data Types, which you could read about eg. in a  blog post series published here.\n How to route requests to a given resource inside of cluster? The state of our system usually consists of multiple addressable entities - which are often replicated for higher availability and resiliency. However usually the entire state is too big to fit into any single node. For this reason it&#39;s often partitioned all over the cluster  dynamically. Now this begs a question: how to tell, which node contains an entity identified by some virtual key? Naive approach would be to ask some subset of nodes in hope that at least one of them will have a data we hope for. Given cluster of  N nodes and entity replicated  R times, we should be able to reach our resource after calling  (N/R)+1 nodes.\n More common way is to keep a registry having an information about current localization of every single entity in a system. Since this approach doesn&#39;t scale well, in practice we group and co-locate entities together within partitions and therefore compress the registry to store information about entire partition rather than individual entity. In this case resource ID is composite key of  (partitionID, entityID). This is how eg.  Akka.Cluster.Sharding or  riak core works. Frequently some subset of hot (frequently used) partitions may be cached on each node for to reduce asking central registry or even the registry itself may be a replicated store.\n We could also use  distributed hash tables - where our entity key is hashed and then mapped into specific node that is responsible for holding resources belonging to that specific subset of key space (a range of all possible hash values). Sometimes this may mean, that we miss node at first try eg. because cluster state is changing, and more hops need to apply.  Microsoft Orleans and Cassandra are popular solutions using that approach.\n As you can see, even though we didn&#39;t asked all questions, there&#39;s already a lot of things happening here and the same problems may be solved with different approaches depending on the tradeoffs our system is willing to take.\n While there&#39;s a chance to make a separate article about each of these in the future, today we&#39;ll focus solely on a  SWIM - used in systems such as Consul and hugely popularized over last few years - as it&#39;s easy to implement for a good start. To improve its resiliency and reduce false positive failure detection, checkout this talk about  Lifeguard - a set of extensions and observations about original SWIM protocol.\n   New node wants to join the cluster - how to make that happen and how to inform other nodes in the cluster about that event?\n  Node was abruptly terminated or cannot be reached any longer. How to detect that an inform others about the fact?\n While first two cases are pretty easy, all of the complexity comes with the third case. We need to discover if node cannot be reached, but that&#39;s not enough - since temporary network failures may happen even inside the same datacenter, they usually get healed fairly fast. We don&#39;t want to panic and throw the node out of the cluster just because we couldn&#39;t reach it in split second. This would lead to very shaky and fragile cluster.\n We&#39;ve already mentioned heartbeat mechanism - every now and then we&#39;re going to send a PING message to other random node. This node is expected to answer with ACK before expected timeout. Easy.\n  Now, what happens if node didn&#39;t respond under timeout? As we said, we don&#39;t want to overreact. So we don&#39;t consider this node dead yet. Instead we consider it to be  suspect and inform others about our suspicion. Other nodes that received suspect gossip expect it to be confirmed within specified timeout - otherwise they will consider it a hoax, and remove node from their suspected list.\n  Now all we need is confirmation - in order to do so, we need to ask someone else for verification. So we&#39;re going pick another unsuspected node and ask it to ping  suspect for us (this request is known as PING-REQ). Now if that mediator managed to receive ACK from the  suspect, we know that node is alive, just our network connection was severed for some reason:\n  On the other side, if our mediator didn&#39;t received ACK either, we now have two-hand verification that node is unresponsive for significant time frame - therefore it can be confirmed as dead to everyone.\n  Of course this doesn&#39;t mean that node is indeed dead - one escape mechanism is that if suspect will get a suspect notification about itself, it can override it by broadcasting alive message. There maybe different reasons, why  suspect didn&#39;t respond on time: it may be too occupied (either by backlog of other requests or eg. stop-the-world garbage collection of underlying VM). It may also happen, that our network have split the cluster apart - this phenomenon is known as a split-brain.\n Ultimately there&#39;s no way to ensure 100% reliable failure detection. We&#39;re just trading reasonable ratio of false failure and how quickly can we detect node as dead - usually these two goals work against each other. In terms of SWIM, I again recommend to lookup for  Lifeguard, which addresses some of the mentioned scenarios. However we&#39;ll not cover it in our implementation below to keep it succinct.\n  Now, we&#39;re going to actually implement that protocol. In order to do so we&#39;re going to apply some simplifications - we&#39;ll do so to make protocol easier to comprehend:\n In general to associate specific request/response messages, we should use some form of sequence numbers. This can result in scenario, when A sends PING1 request to B for which is responds with ACK1, some time later A sends another PING2 to B and receives ACK1 back - the problem was that it cannot tell which PING this message was acknowledgment for. This kind of situation is very rare, but not impossible. If may also lead to &#34;resurrecting&#34; dead nodes.\n While we&#39;re going to piggyback gossip on top of pings - like the paper suggests - we&#39;re simply  gossip entire membership state every time. It&#39;s not the most optimal way, but it&#39;ll work good enough.\n PS:  Other way of avoiding sending entire state with every gossip is to compute consistent hash of current node membership view and put that hash inside of ping instead of full view. This way our PING will carry just a hash value, which responder may compare with hash of its own state. Only if hashes differ (in clusters with small churn of nodes most of the time they don&#39;t), we&#39;re putting membership state on top of ACK.\n The code used here is available in  this gist, which I recommend to use, as we&#39;ll not cover everything here.\n  Since we don&#39;t want to deal with all complexities of node-to-node communication, we&#39;ll just build a model on top of abstractions, that will let us evaluate the algorithm without derailing into solving other problems. The basic prerequisites here are:\n A transport layer that will just let us send message to another (possibly remote)  endpoint. We don&#39;t want to deal with managing network connections or serialization details.\n An agent accessible behind the  endpoint, able to serve multiple requests and change its state in thread safe manner.\n For these reasons, I&#39;m going to use Akka.NET/Akkling and model our nodes using actors living in the same process. You can easily adopt it to different actor systems connected over Akka.Remote. We keep this as a training exercise - in practice if you want to use clusters in akka, you already have entire ecosystem built on top of Akka.Cluster, which handles membership - and other problems mentioned in introduction - for you.\n Our actor will be created by providing it an initial list of contact points: these are the endpoints known to be part of the cluster:\n open Akklinguse sys = System.create &#34;swim-cluster&#34; &lt;| Configuration.parse config// In this example `a` and `b` are actor refs for other // SWIM cluster members living on other nodes. let c = spawn sys &#34;node-b&#34; &lt;| props (Swim.membership [a; b])\n In order to create that actor first we need to deal with a joining process. The idea is that we&#39;ll try to pick endpoints from the provided list (it corresponds to seed node addresses in Akka.Cluster ) and send a  Join request to them. If cluster node actor will receive such request, it&#39;s obliged to accept it by sending  Joined response to ALL cluster members (including requester).\n In case when  Joined wouldn&#39;t arrive eg. because we misconfigured our cluster and other endpoint couldn&#39;t be reached, we wait for some time and try another node from the list. This could be represented as:\n let membership (seeds: Endpoint list) (ctx: Actor&lt;_&gt;) = let state = { Myself = { Endpoint = ctx.Self } Active = Set.empty Suspects = Map.empty } (* rest of the actor code... *) let rec joining state cancel = actor { match! ctx.Receive() with | JoinTimeout [] -&gt; return Stop // failed to join any members | JoinTimeout (next::remaining) -&gt; next &lt;! Join state.Myself let cancel = ctx.Schedule joinTimeout ctx.Self (JoinTimeout remaining) return! joining state cancel | Joined gossip -&gt; cancel.Cancel() // cancel join timeout return! becomeReady state gossip | Join peer when peer = state.Myself -&gt; // establish new cluster cancel.Cancel() // cancel join timeout return! becomeReady state (Set.singleton state.Myself) | _ -&gt; return Unhandled } match seeds with | [] -&gt; becomeReady state (Set.singleton state.Myself) | seed::remaining -&gt; seed &lt;! Join state.Myself let cancel = ctx.Schedule joinTimeout ctx.Self (JoinTimeout remaining) joining state cancel\n After receiving the  Joined request actor associates itself as a operating member of the cluster, ready to work. From now on it will trigger itself to periodically check if others remain responsive:\n let merge gossip state = { state with Active = state.Active + gossip }let becomeReady state gossip = ctx.Schedule pingInterval ctx.Self NextRound |&gt; ignore ready (merge gossip state)\n As mentioned before, in this case  gossip is just a full set of active cluster members, while  ready is actor behavior used for standard cluster activities:\n let rec ready state = actor { match! ctx.Receive() with // other message handlers | _ -&gt; return Unhandled}\n Since we covered joining procedure from requestor side, let&#39;s do that for operating cluster member as well:\n match! ctx.Receive with| Join peer -&gt; let gossip = Set.add peer state.Active let msg = Joined gossip gossip |&gt; Set.remove state.Myself |&gt; Set.iter (fun peer -&gt; peer.Endpoint &lt;! msg) return! ready { state with Active = gossip } | Joined gossip -&gt; return! ready (merge gossip state)// other handlers\n As we said, once new member tries to join, we simply update our active members state and gossip it to all other members in  Joined message, so they could update it as well.\n Now, let&#39;s cover pinging process. First we mentioned that we want to trigger our member every now and then - you could already see that when we scheduled  NextRound event in  becomeReady function. Now how it will work? We&#39;re going to pick one node at random - other than current one and not being suspected (suspects are nodes that didn&#39;t reply to pings on time) - and send a  Ping request to it. In the meantime we also schedule a timeout for that request to complete:\n let pick peers = match Set.count peers with | 0 -&gt; None | count -&gt; let idx = ThreadLocalRandom.Current.Next count Some (Seq.item idx peers) let ready state = actor { match! ctx.Receive() with | NextRound -&gt; ctx.Schedule pingInterval ctx.Self NextRound |&gt; ignore let suspects = state.Suspects |&gt; Map.toSeq |&gt; Seq.map fst |&gt; Set.ofSeq let others = (Set.remove state.Myself state.Active) - suspects // pick one member at random, other than self and not marked as suspected match pick others with | None -&gt; return! ready state | Some peer -&gt; // send Ping request to that peer and schedule timeout peer.Endpoint &lt;! Ping(state.Active, ctx.Self) let cancel = ctx.Schedule pingTimeout ctx.Self (PingTimeout peer) let skipList = Set.ofArray [| state.Myself; peer |] return! ready { state with Suspects = Map.add peer (cancel, WaitPingAck skipList) state.Suspects } | Ping (gossip, sender) -&gt; // reply to incoming ping right away sender &lt;! PingAck(state.Myself, state.Active) return! ready (merge gossip state) // other handlers}\n Here we&#39;re using our suspects map to keep track of timeout cancellation and skip list. What&#39;s a skip list? We&#39;ll cover it soon. As we mentioned, when  PingAck doesn&#39;t arrive on time, we&#39;re going to pick another member (at random) and ask it to ping our suspect for us using  PingReq message. This way we try to mitigate risk of false negatives in our failure detection algorithm:\n let ready state = actor { match! ctx.Receive() with | PingReq (suspect, gossip, sender) -&gt; let cancel = ctx.Schedule indirectPingTimeout ctx.Self (PingTimeout suspect) suspect.Endpoint &lt;! Ping(state.Active, ctx.Self) return! ready { merge gossip state with Suspects = Map.add suspect (cancel, WaitPingReqAck) state.Suspects\n......", "posttime": "2021-06-29 22:34:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,群集,cluster,节点", "title": "让你的群集游泳（2020） ", "title_en": "Make your cluster SWIM (2020)", "transed": 1, "url": "https://bartoszsypytkowski.com/make-your-cluster-swim/", "via": "", "real_tags": ["2020", "群集", "cluster", "节点"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "毫混客户端有多种语言。对于翻译过程，我们最近从Transifex Online Platform移动到WebLate。在这篇文章中，我们描述了我们的翻译历史，推理和目前的方法。\n  在最后一个快照之后，我们自豪地介绍即将到来的1.4.0 stablerelelease的第六次开发快照。请注意，此快照旨在成为最后一个释放之前的最后一个，并与其发布一样，我们正在引入1.4.x系列的Freature-Freeze。从现在开始，只有错误修复将进入这个系列。\n 在理解释放的意义之后是快照版本（见下文），您可以从下载空间下载新版本。\n      犬歌是第一个在十年前建立真正的低延迟语音通信的VoIP应用程序。但低延迟和游戏不是它闪耀的唯一用例。\n  我们听到录制播客与我们的多通道音频录音机，寻求与我们的位置音频在游戏中寻求现实主义的播放器，Eve在线球员拥有超过100多个同步语音参与者的巨大社区（我打赌他们熟悉我们广泛的许可系统😄 ），竞争团队堡垒2社区使我们成为他们所需的语音通信平台，爱好无线电传输用户，以及各种工作场所适应咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜声\n  管理员欣赏能够自我主持并控制数据安全性和隐私性的腮腺。有些人利用广泛的权限系统进行复杂场景（例如分隔两组，但领导者能够与两者交谈）。有些人喜欢为他们的用户提供具有使用服务器API的脚本或连接到服务器的主机音乐机器人等脚本的附加功能。具有现有用户数据库的人通常使用身份验证器允许使用现有帐户登录数据进行身份验证。\n    不同的用户组对不同的功能感兴趣，因此我们描述了对每种用户特定的一些功能。 \n要开始只需下载，安装和启动嘟嘟声并连接到公共服务器，或者您知道的特定一个。  通过ICE协议渠道观众延伸 - 即使没有直接的ICE访问，如果HOSTES提供CVP，则轻松设置您的频道查看器  对于配置选项，请参阅Murmur.ini以及我们关于第三方管理软件，脚本和机器人的文档。 ", "note_en": "The Mumble client is available in many languages. For the translation process we recently moved from the  Transifex online platform to  Weblate. In this post we describe our translation history, reasoning, and current approach.\n  Following the  last snapshot we proudly present our sixth development snapshot of the upcoming 1.4.0 stablerelease. Note that this snapshot is intended to be the last one before the final release and as such with its publication we are introducing afeature-freeze of the 1.4.x series. From now on only bug fixes will make it into this series.\n After having understood what it means for a release to be a  snapshot release (see below), you can download the new version from our   Downloadspage.\n      Mumble was the first VoIP application to establish true low latency voice communication over a decade ago. But low latency and gaming are not the only use cases it shines in.\n  We heard from users who record podcasts with our multi-channel audio recorder, players seeking realism with our positional audio in games, Eve Online players with huge communities of over 100 simultaneous voice participants (I bet they make good use of our extensive permission system 😄), the competitive Team Fortress 2 community making us their required voice communication platform, hobby radio transmission users, and a variety of workplaces adapting Mumble to fit their needs - be it on-head mobile devices or communicating across countries or into airplanes.\n  Administrators appreciate Mumble for being able to self host and have  control over data security and privacy. Some make use of the extensive permission system for complex scenarios (for example separating two groups but leaders being able to talk to both). Some love to provide their users with additional functionality with scripts making use of server APIs, or host music bots and the like that connect to the server. Those that have an existing user database often make use of authenticators to allow authenticating with existing account login data.\n    Different user groups are interested in different capabilities and so we describe some of the features specific to each kind of user.\n        To get started simply  download, install and start Mumble and connect to a public server, or a specific one you know of.\n    Extendible through Ice protocols\t\t\t Channel viewers - even without direct Ice access, if the hoster provides the CVP, easily set up your channel viewer of choice\n    For configuration options see  Murmur.ini and our documentation on third party administration software, scripts, and bots.", "posttime": "2021-06-29 22:34:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,高质量,open,脚本", "title": "喃：开源，低延迟，高质量的语音聊天 ", "title_en": "Mumble: Open-Source, Low Latency, High Quality Voice Chat", "transed": 1, "url": "https://www.mumble.info/", "via": "", "real_tags": ["开源", "高质量", "open", "脚本"]}, {"category": "", "categoryclass": "", "imagename": "6135cca9843ba6e754c29dc083785da7.jpg", "infoid": 1068444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无效的电子邮件出现问题，请稍后再试。订阅时，我们将使用您提供的信息向您发送这些新闻稿。您的信息将根据我们的隐私声明使用。\n 鸽子鸽友正试图制定大约5,000只鸟类在一场比赛中消失在一个“百慕大三角形”中所谓的这项运动的最糟糕的日子之一。\n  从彼得堡到东北地区的比赛锯9,000只鸽子参与通常是三小时的比赛，但超过一半才到达。\n  大气条件是迄今为止提出的唯一解释，报道了Teesside Live。\n  鸽子在从南方的比赛中回到了东克利夫兰的回家。\n  在Skinnningrove的鸽舍估计的300只鸟在比赛中消失了，鸽子鸽友认为可能是由于怪灾天气状况。\n                             SkinnningRove Pigeon Fancier Richard Sayers对他的社交媒体渠道分享了呼吁，敦促人们向他们留意，并在您的花园里的丢失的赛鸽陆地占据了该怎么办。 \n赛车鸽是可识别的，标签周围的标签。如果他们被喂养和浇水，他说，疲惫的归巢鸟最终会回到他们的鸽舍。\n    ＆＃34;它是一个非常糟糕的周末赛车，不仅仅是在英国的西北，＆＃39;在英国。目前，人们非常不确定发生了什么，仍然存在很多很多，并且在行动中仍然缺少很多鸽子，而＃34;理查德说。\n  ＆＃34;很多人认为这是由于大气中的东西 - 就像云上方的太阳风暴一样。\n  ＆＃34;我只是想向遇到赛鸽喂养，水和让它休息和那里的任何人提高认识，并且在几天后鸟类将在途中达到80％的机会。每只鸽子都有一个识别戒指，其中代码和数字。＆＃34;\n  ＆＃34;我们需要我们的小鸟类在重大冲突中有助于他们挽救了1000多人的生命，现在我们可以做我们的一点点来帮助他们，＆＃34;他在他的社交媒体帖子中说。\n    他将他的归巢鸟飞到兄弟们的兄弟＆amp;来自Skinningrove的儿子在东部克利夫兰联邦。合作伙伴关系保持鸟类大约50年。\n  他说，大约在30％到40％的皮肤鸟类缺失，大约300岁的鸟类。在东方克利夫兰联邦，该数字估计为1,000。横跨东北部，估计介于3,500和5,500之间。 \n理查德说，惠特比鸽友凯尔·杜格拉斯凯尔·杜格拉斯有很多工作来帮助拯救失去的鸟类。  还有网站，人们可以在这里和这里报告可以在这里找到的杂散。 ", "note_en": "Invalid Email Something went wrong, please try again later.   When you subscribe we will use the information you provide to send you these newsletters. Your information will be used in accordance with our Privacy Notice.\n Pigeon fanciers are trying to work out how around 5,000 birds have disappeared into a “Bermuda triangle” in a single race in what is being called one of the worst days ever for the sport.\n  A race from Peterborough to the North East saw 9,000 pigeons taking part in what would normally be a three-hour competition but more than half have yet to arrive.\n  Atmospheric conditions are the only explanation that has been put forward so far,  reports Teesside Live.\n  The pigeons have vanished while making their way home to east Cleveland from a race down south.\n  An estimated 300 birds from lofts in Skinningrove alone have disappeared during the race which pigeon fanciers believe has possibly been due to freak weather conditions.\n                             Skinningrove pigeon fancier Richard Sayers shared an appeal on his social media channels urging people to look out for them and giving advice on what to do if a lost racing bird lands in your garden.\n  Racing pigeons are recognisable by the tags around their legs. If they are fed and watered, he says, the tired homing birds will eventually return to their lofts.\n    &#34;It&#39;s been a really bad weekend racing not just here in the North East, it&#39;s right across the UK. At present people are very unsure what has happened there are still lots and lots of pigeons still missing in action,&#34; said Richard.\n  &#34;A lot of people think this is due to something in the atmosphere - like a solar storm above the clouds.\n  &#34;I just wanted to raise awareness for anyone who comes across a racing pigeon to feed, water and let it rest and there&#39;s an 80% chance the birds will get on their way after a few days. Each pigeon has an identification ring on with a code and number.&#34;\n  &#34;We needed our little birds help in the major conflicts and they saved 1000s of lives, now we can do our little bit to help them,&#34; he said in his social media post.\n    He flies his homing birds as Sayers Bros &amp; son from Skinningrove in the East Cleveland Federation. The partnership has kept birds for around 50 years.\n  Roughly between 30% and 40% of the Skinningrove birds are missing, around 300 birds, he said. In the East Cleveland Federation the figure is estimated to be 1,000. Across the North East section, the estimate is between 3,500 and 5,500.\n  Whitby pigeon fancier Kyle Douglass, 20, does a lot of work to help rescue lost birds, said Richard.\n  There are also websites where people can report strays which can be found  here and  here.", "posttime": "2021-06-29 22:34:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "鸽子,pigeons,比赛", "title": "谜团作为5k归巢鸽子变成薄薄的空气 ", "title_en": "Mystery as 5k homing pigeons vanish into thin air", "transed": 1, "url": "https://www.walesonline.co.uk/news/uk-news/mystery-5000-homing-pigeons-birds-20907818", "via": "", "real_tags": ["鸽子", "pigeons", "比赛"]}, {"category": "", "categoryclass": "", "imagename": "14a5fbb20edbc32e5c5d925a11c3b914.png", "infoid": 1068443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，我想要一种简单的方法来跟踪我的车库门是开放还是关闭。我于2015年开始这个项目，它确实确实是我需要的。该项目最终变成了我来调用我的豹子的一个组成部分，覆盆子PI的网络＆＃39;在我的财产周围执行各种有用的功能。\n  ＆＃39; OHD＆＃39;监视覆盆子PI上指定的GPIO引脚，并根据这些引脚的状态的变化进行响应。它将电子邮件（或短信）消息发送到其配置文件中的数字。\n  2019年11月，我将PIR运动探测器添加到我的前廊。让Ohdhandle监测其地位是自然的。当该运动检测器跳闸时，OHD响铃我的门铃响了三次，然后向已配置的电子邮件/短信网关发送通知，并且Zoneminder被告知Torecord视频，以便配置的时间长度。\n  PI是B型号B + B +，以及PINS DO的示意图详细信息.I还添加了实时时钟模块和不间断电源，以保持其在线和谐。 UPS是一个带12V密封电池的家用制作作业，将DROK 12V为5V降压转换器供电。该转换器为PI供电。像冠军一样工作。\n  我重新使用了一个平方绿色按钮开关，我将旧的PC盒销售为旁路按钮。此按钮具有内置LED，当旁路啮合时亮起。旁路函数使我能够让车库门打开，而我在那里工作而没有得到的人。\n  软旁路功能允许我在需要时过度乘坐硬件旁路交换机的状态。当软旁路啮合时，旁路按钮＆＃39; S LED闪烁，提醒我启用软旁路模式。\n  OHD使用Gmail与外部世界沟通。我为此PI创建了一个帐户，并且当门或绕过开关的状态时，它将电子邮件发送到指定的收件人列表。通过使用Cell ServiceProvider的SMS网关地址，SMS也可以通过SMS发送通知。我是verizon，所以OHD发了一封电子邮件到＆＃39; mycellnumber@vzwpix.com&#39;这符合短信并在我的手机上显示任何其他文字。 \nOHD还可以通过电子邮件接收说明。 有时候大门打开了大多数人，那么谁没有按下旁路按钮。 就像我们在奥特屋工作的地板承包商一样。 我们无法联系到他们，但我能够送一个＆＃34;安静＆＃34; 消息到PI＆＃39; S Gmail地址，以及OHD检索并停止发送＆＃39;门打开＆＃39; 通知。 非常便利。 目前，这是Aonly命令OHD的行为。  我提供了一些指示，从一个全新的pi到一个运作的OHD系统。正常的警告适用。 。 。 你的旅费可能会改变。 ", "note_en": "For decades, I wanted a simple way to keep track of whether my garage door was open or closed. I started this project in 2015 and it does exactly what I need. The project eventually morphed into a component ofwhat I have come to call my PiNet, a network of Raspberry Pi&#39;s that perform various useful functions around my property.\n  &#39;ohd&#39; monitors specified GPIO pins on a Raspberry Pi and responds based on changes tothe status of those pins. It sends email (or SMS) messages to numbers in its config file.\n  In November of 2019 I added a PIR motion detector to my front porch. It was natural to let  ohdhandle the monitoring of its status. When that motion detector is tripped,  ohd rings my doorbell rings three times,then sends notification to the configured emails/SMS gateways, and  Zoneminder is told torecord video for the configured length of time.\n  The Pi is a 3 Model B+, and the  schematic diagram details which pins do what.I also added a real-time clock module and an Uninterruptable Power Supply to keep it online andon time. The UPS is a home-brew job with a 12V sealed battery that powers a DROK 12V to 5V buck converter.That converter powers the Pi. Works like a champ.\n  I re-used a square green pushbutton switch I salvaged off an old PC case as my ByPass button. This button has a built-in LED which lights up when the ByPass is engaged. The ByPass functionallows me to keep the garage door open while I&#39;m working in there without getting notifiedevery minute.\n  The Soft Bypass function allows me to over-ride the status of the hardware bypass switch when needed.When Soft Bypass is engaged, the bypass button&#39;s LED flashes to remind me Soft Bypass mode is enabled.\n  ohd uses Gmail to communicate with the outside world. I created an account just for this Pi,and it sends emails to a specified list of recipients when the status of the door or ByPass switchchanges. Notifications can also be sent by SMS by using the SMS gateway address of the cell serviceprovider. Mine is Verizon, and so  ohd sends an email to &#39; mycellnumber@vzwpix.com&#39;. That getstranslated to SMS and shows up on my phone like any other text.\n ohd also can receive instructions by email. There have been times when the door was opened bysomeone who then failed to press the bypass button. Like when we had flooring contractors working atour house. We could not reach them, but I was able to send a &#34;quiet&#34; message to the Pi&#39;s Gmail address,and ohd retrieved that and stopped sending &#39;door open&#39; notifications. Very handy. Currently this is theonly command  ohd acts on.\n I provided some  instructions to go from a brand new Pi to a functioning  ohd system.The normal caveats apply . . . your mileage may vary.", "posttime": "2021-06-29 22:33:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "车库,door,ohd", "title": "车库由Monitor. ", "title_en": "Garage Door Monitor", "transed": 1, "url": "https://github.com/casspop/ohd", "via": "", "real_tags": ["车库", "door", "ohd"]}, {"category": "", "categoryclass": "", "imagename": "64d7b1d4d0f15747fe7db2e1e617292c.jpg", "infoid": 1068442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n电池是应用诸如电子PTYChogogation的成像技术的特别有希望的区域，伯克利加州大学的物理学家罗杰法鲁斯表示，他也没有参与该研究。 “我们如何制作电池的结构，”他问道，“这样他们就可以存储很多能量，但仍然是安全的？”这是一个重要的问题，特别是对于从化石燃料到可再生能源的过渡，包括风和太阳能。 “成像技术对改善电池非常重要，因为我们可以详细研究化学反应，”勒狗说。\n  但还有很长的路要走。为了使电子PTYChoguge导致您的手机或笔记本电脑的新突破，它必须做得不仅仅是拍照 - 必须能够精确地定位在材料中的单个原子。虽然研究人员在理论上证明了该技术如何做到这一点，但它们尚未进行实验示范。 “通过任何新技术，您的研究人员总是需要一点时间来试用这一点，看看它是否与真实的，实用的用途是真实的，”IBM Research-Almaden的材料分析和特征主经理Leslie Thompson说，谁没有参与新的研究。\n  “在你发明一个像高分辨率显微镜这样的新工具的程度上，我的意识是你倾向于感到惊讶[by]它适用于解决的问题，”咆哮添加。 “人们会看看我们现在甚至无法想象的事情 - 并解决我们甚至不确定的问题。” ", "note_en": "Behold the highest-resolution image of atoms ever seen. Cornell University researchers captured a sample from a crystal in three dimensions and magnified it 100 million times, doubling the resolution that  earned the same scientists a Guinness World Record in 2018. Their work could help develop materials for designing more powerful and efficient phones, computers and other electronics, as well as longer-lasting batteries.\n  The researchers  obtained the image using a technique called electron ptychography. It involves shooting a beam of electrons, about a billion of them per second, at a target material. The beam moves infinitesimally as the electrons are fired, so they hit the sample from slightly different angles each time—sometimes they pass through cleanly, and other times they hit atoms and bounce around inside the sample on their way out. Cornell physicist David Muller, whose team conducted the recent study, likens the technique to playing dodgeball against opponents who are standing in the dark. The dodgeballs are electrons, and the targets are individual atoms. Though Muller cannot see the targets, he  can see where the “dodgeballs” end up, thanks to advanced detectors. Based on the speckle pattern generated by billions of electrons, machine-learning algorithms can calculate where the atoms were in the sample and what their shapes might be.\n  Previously, electron ptychography had only been used to image extremely flat samples: those merely one to a few atoms thick. The new study, published in  Science, now allows it to capture multiple layers tens to hundreds of atoms thick. That makes the technique much more relevant to materials scientists, who typically study the properties of samples with a thickness of about 30 to 50 nanometers. (That range is smaller than the length your fingernails grow in a minute but many times thicker than what electron ptychography could image in the past.) “They can actually look at stacks of atoms now, so it’s amazing,” says Andrew Maiden, an engineer at the University of Sheffield in England, who helped develop ptychography but was not involved with the new study. “The resolution is just staggering.”\n  This marks an important advancement in the  world of electron microscopy. Invented in the early 1930s, standard electron microscopes made it possible to see objects such as polioviruses, which are smaller than the wavelengths of visible light. But electron microscopes had a limit: increasing their resolution required raising the energy of the electron beam—and eventually the necessary energy would become so great that it would damage the sample. One way to avoid this problem was ptychography, which researchers developed in theory in the 1960s. But because of limitations in detectors and computational power, as well as the complex math required, it was decades before the technique was put into practice. Early versions only worked with visible light and x-rays, not the electron beams required to image atomic-size objects. Meanwhile scientists kept finding ways to improve electron microscopes, which worked so well that electron ptychography could not keep up. “You had to be a true believer in ptychography to be paying attention to it,” Muller says.\n  It was only in the past several years that Muller and his team developed a detector good enough for electron ptychography to work experimentally. By 2018, they had figured out how to reconstruct two-dimensional samples with the technique, producing “the highest-resolution image by any method in the world,” Muller says—which won that Guinness World Record. And the researchers did so with a lower-energy wavelength than other methods, allowing them to better preserve their samples.\n  Thicker samples, however, presented multiple challenges. Instead of bouncing just once before detection, an electron wave ricochets around atoms in a three-dimensional sample. “You know where it ended up, but you don’t know what path it took in the material,” Muller says. This pinballing is called the “multiple scattering problem,” and he and his team spent the past several years trying to solve it. With enough overlapping speckle patterns and computing power, they found they could work backward to determine which layout of atoms produced a given pattern. The researchers did so by fine-tuning a model until the speckle pattern it generated matched the experimentally produced one. Solving the multiple scattering problem is a major advancement, Muller says. Referring to the resolution his team’s technique can capture for samples 300 atoms thick or smaller, he contends that “we can do better than anyone else, and we can do better than anyone else by factors of two to four.”\n  Such high-resolution imaging techniques are essential for developing the next generation of electronic devices. For example, researchers are looking to move beyond silicon-based computer chips in search of more efficient semiconductors. To make this happen, engineers need to know what they are working with at an atomic level—which means taking advantage of technologies such as electron ptychography. “We have these tools sitting there, waiting to help us optimize what will become the next generation of devices,” says J. Murray Gibson, dean of the Florida A&amp;M University–Florida State University College of Engineering, who was not involved in the new study. “Without these tools, we couldn’t do it.”\n  Batteries are a particularly promising area for applying imaging techniques such as electron ptychography, says Roger Falcone, a physicist at the University of California, Berkeley, who was also not involved with the research. “How do we make the structure of batteries,” he asks, “such that they can store a lot of energy and yet still be safe?” This is an essential question, especially for the transition from fossil fuels to renewable energies, including wind and solar. “Imaging technologies are very important to improving batteries because we can look at the chemical reactions in detail,” Falcone says.\n  But there is still a long way to go. In order for electron ptychography to lead to a new breakthrough for your cell phone or laptop, it must do more than take a picture—it has to be capable of precisely locating an individual atom in a material. Though the researchers demonstrated how the technique could do so theoretically, they have not yet performed an experimental demonstration. “With any new technique, it always takes a bit of time for your fellow researchers to try this out and see if it bears out into real, practical uses,” says Leslie Thompson, former manager of materials analysis and characterization at IBM Research–Almaden, who was not involved in the new study.\n  “To the extent that you invent a new tool like a high-resolution microscope, my sense is that you tend to be surprised [by] what problem it’s applied to solve,” Falcone adds. “People will look at things that we can’t even imagine now—and solve a problem that we’re not even sure we have yet.”", "posttime": "2021-06-29 22:33:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原子,image,技术", "title": "原子图像为最高分辨率设定新的记录 ", "title_en": "Atomic image sets new record for highest resolution", "transed": 1, "url": "https://www.scientificamerican.com/article/see-the-highest-resolution-atomic-image-ever-captured/", "via": "", "real_tags": ["原子", "image", "技术"]}, {"category": "", "categoryclass": "", "imagename": "1d05dd52a56d4612d0beb0c4b9351218.jpeg", "infoid": 1068441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奥斯汀，德克萨斯州 - 当我们向地表驶向了路线，那些让我说服这一点的朋友共同分享了他在当天早些时候的谈话：＆＃34;当我说我们今晚在美洲赛道上骑自行车时，首先迈克问的是，如果第一次转弯就像电视上的那样陡峭。时间找出来。＆＃34;\n 我不跟随首式1.我不关心NASCAR。但我住在德克萨斯州奥斯汀，我经常骑自行车。因此，在美洲的巡回赛中（Cota）的智能概念 - 在周二晚上邀请当地骑自行车者邀请当地骑自行车者尝试两个轮子，其中四个通常漫游似乎很酷。德克萨斯州中部6月晚上甚至在考虑湿度或接近沥青之前，即使在考虑湿度或接近沥青之前也容易超过90°F。但是有些危害可以在花式汽车电路上休闲骑行吗？在我把自行车带到架子之前，我可以品尝PostgameKölsch。\n 然后，当然，转弯1.哇。很快，我了解了为什么Cota＆＃39; S开始逃跑史上的臭名昭着。它不会看起来很糟糕，当你从观察甲板上窥视时，但在地上，这是3.4英里轨道开始时的133英尺的攀登真的为每一个膝盖设定一个音调。那个基调：科托会踢你的屁股。\n  这款F1粉彩声称汽车可以达到大约110公里/小时（〜70英里/小时）攀登这件事，我们非常没有实现。我花了大约两分钟。而F1＆＃39;最顶级司机可以在几乎一分钟半的膝盖上推，我抱歉的自我在一个不正当的时间接近13分钟。 （我骑着五年前购买的Motobecane Never Noir;那些装上顶Tri自行车的人可能更好。）\n    仍然，骑自行车之夜AIN＆＃39;无竞争。 10美元的入口价格为各种各样的骑自行车者提供了一个非常独特的骑马体验。你＆＃39; ll看到矮床，他看起来清新的训练轮和其他人让你嘀咕着关于想要适合他们的年龄。我的路上自行车在一个循环海上并没有置于固定齿轮，卧式骑行，串联自行车和一辆附着的那些婴儿拖车的自行车（只有牵引某种猎犬）。 COTA团队在一些捷径中建立了一些捷径，他们希望在一两小时或两两次攀登四次，并且充足的休息和水站在整个课程中都有战略性地放置。\n 在最后一段时间，我接近绅士们的夜晚，驾驶课程第一手让我对那些以更高速度做的人来说真正的欣赏。我的朋友＆＃39; strava应用读数报道，我们达到的最快的步伐只是超过40英里/小时，从一个扁平的伸展延伸到匝数1的匝数1超过40英里/小时。F1汽车推动200英里/小时课程，但我觉得就像我飞翔一样。即使在那些较慢的速度下，它花了我们多圈真正达到像发夹12的转弯的悬挂。以及如何比赛在15岁的事情上比赛两三辆车超出了我;甚至很难适应许多类似真正动量的自行车。\n 自从2017年以来，自行车夜已经在这里是一个主题，而且甚至成功地驶过了最后的大流行。它一直在每晚吸引几百名车手的原因。所以，如果你和＃39;下周或者在9月的某个时候在奥斯汀中，知道你不经常这样骑行的机会。如果你去，只记得在最低的装备中开始夜晚。 \n我喜欢你如何随便包括一个在那里独轮车上一个人的照片。 他爬到1岁吗？  是他做的。 @austinunicycleschool上的ig实际上有几个单性骑在骑自行车之夜的轨道上。 我喜欢你如何随便包括一个在那里独轮车上一个人的照片。 他爬到1岁吗？ ", "note_en": "AUSTIN, Texas—As we rolled our road bikes toward the entryway, the friend who convinced me to do this shared a conversation he had earlier in the day: &#34;When I said we were biking at Circuit of the Americas tonight, the first thing Mike asked was if that first turn is as steep as it looks on TV. Time to find out.&#34;\n I don&#39;t follow Formula 1. I don&#39;t follow NASCAR. But I do live in Austin, Texas, and I regularly ride a bike. So the concept of  Bike Night at the Circuit of the Americas (COTA)—an event series where this famed US racetrack invites local cyclists out on Tuesday nights to try two wheels where four usually roam—seemed cool enough. A June evening in Central Texas easily exceeds 90° F, even before you consider humidity or proximity to asphalt. But what harm could some casual riding on a fancy car circuit do? I could taste the postgame Kölsch before l took my bike off the rack.\n Then, of course, came Turn 1.  Whoa. Quickly, I learned why COTA&#39;s starting stunner lives in  racing infamy. It doesn&#39;t look that bad when you&#39;re peering down from the Observation Deck, but on the ground, this 133-foot climb at the start of the 3.4-mile track really sets a tone for every lap. That tone:  COTA will kick your butt.\n  This F1 fansite claims that cars can get to around 110 km/h (~70 mph) climbing this thing, which we very much did  not achieve. It took me about two minutes. And while  F1&#39;s top drivers can push through a lap in almost a minute and a half, my sorry self had an unofficial time closer to 13 minutes. (I ride a  Motobecane Vent Noir I bought used five years ago; the guys who loaded up top-end tri bikes likely fared better.)\n    Still, Bike Night ain&#39;t no competition. An entry price of $10 brings out all sorts of cyclists for a pretty unique riding experience. You&#39;ll see peddlers who look fresh out of training wheels and others who make you murmur something about wanting to be that fit at their age. My road bike was not out of place in a sea of cycles that included fixed gears, recumbent rides, tandem bikes, and a bike with one of those baby trailers attached (only it  definitely carried a retriever of some sort). The COTA team builds in some shortcuts for those who would like to  not climb Turn 1 four times in an hour or two, and ample break and water stations are strategically placed throughout the course.\n By the final time that I approached the grandstands to turn in for the night, navigating the course firsthand had given me a genuine appreciation for those who do it at higher speeds. My friend&#39;s Strava app readings reported that the quickest pace we reached was  just over 40 mph, coming off the (literal, physical) high of Turn 1 through a flat stretch leading to Turn 5. F1 cars push 200 mph on this course, yet I felt like I was flying. It took us multiple laps to really get the hang of turns like the hairpin Turn 12, even at those slower speeds. And how pros race two or three cars wide on something like Turn 15 is beyond me; it felt hard to fit even that many bikes with anything resembling genuine momentum.\n Bike Night has been a staple around here since  2017, and the event even  successfully navigated the pandemic last fall. It has consistently attracted a few hundred riders every night for a reason. So, if you&#39;re in Austin next week or sometime this September, know you don&#39;t get the opportunity for a ride like this very often. If you go, just remember to start the night in your lowest gear available.\n  I like how you casually included a picture of a guy on a unicycle there. Did he climb turn 1?\n  Yes, he did. @austinunicycleschool on IG There are actually a few unicyclists who ride together around the track on Bike Night.    I like how you casually included a picture of a guy on a unicycle there. Did he climb turn 1?", "posttime": "2021-06-29 22:33:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "f1,cycling,自行车", "title": "在F1的美洲着名赛道上循环或骑自行车 ", "title_en": "Circling–or cycling–the track at F1’s famous Circuit of the Americas", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/circling-or-cycling-the-track-at-f1s-famous-circuit-of-the-americas/", "via": "", "real_tags": ["f1", "cycling", "自行车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然Roblox没有正式支持Linux，但运行Windows程序的葡萄酒兼容层可以在Linux上运行Roblox播放器和Roblox Studio。\n 运行Roblox葡萄酒需要葡萄酒6.11或更新版本。截至2021年6月19日，这需要使用开发释放。 Wine 6.11是Arch Linux和Void Linux和Winehq提供的Debian，Fedora和Ubuntu的开发版本提供二进制包。 [1]\n 有助于在Linux上安装Roblox，可以咨询葡萄草图Discord服务器。终端和软件编译的一些知识的用户在安装过程中不应有很大的麻烦。\n   2012年7月28日，约翰·谢尔茨基确认了Linux上的Roblox的进展为97％。 Shedletsky声称Linux的问题是驾驶员支持差。 Shedletsky的另一个博客帖子声称他们可以在Linux上花几个月，或者他们可以在高度要求的功能上工作。\n   在RDC 2020 Q＆amp;会议期间，它确认目前没有计划由于其小型桌面市场份额而导致Linux的Roblox。然而，Arseny Kapoulkine表示，如果＆＃34; Linux将有计划是游戏玩家＆＃34的选择平台。 [2] [3]\n roblox已经多次测试过，成功直到2015年。2015年5月15日，Roblox收到了A＆＃34;金＆＃34;葡萄酒应用程序数据库中的评级。 [4]\n 从2015年到2021年，在Linux上运行Roblox播放器，因为加入游戏导致了连接的错误＆＃34;这个游戏已关闭。＆＃34; [5]这是原本假设是由于反作用软件，但Kalen Alwardt后来表示这个＆＃34;不是问题的原因。＆＃34; [6] \n6月11日，2021年6月，用户名称为IMSLAPPY826（Slappy826＃0001上的Slappy826＃0001）为葡萄酒创建了一行修补程序，允许Roblox播放器在GNU / Linux或BSD系统上再次工作。修补程序实现了zwfilterToken函数，该函数应该沿NTFilterToken沿NTDLL实现。修补程序已致力于葡萄酒开发树[7]并包含在葡萄酒6.11中。 [8]用户Brinker发布了一种用于基于Arch的Linux发行版的预修补版，而用户robigan为基于Debian的Distrs创建了补丁。\n   使用葡萄酒时，鼠标存在问题。使用以下补丁从源版本纠正：\n 来自dba1a3c3bf5946cd7665c92f15e mon sep 17 00:00:00 2001：brinkervii＆lt; brinkervii@gmail.com& gt;日期：SAT，12月2021 11:00:06 + 0200subject：[修补程序2/2] Turbo Jank鼠标修复--- DLLS /winex11.drv/mouse.c | 4 +++ + 1文件已更改，4个插入（+）Diff --git A / DLL / Winex11.drv / mous.cb / DLL / Winex11.drv / mous.Cindex 42Bac332664..0549C2D653B 100644  -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -  --- A / DLL / winex11.drv/mouse.c+++ b / dll / winex11.drv / mous.c @@ -648,6 +648,10 @静态void send_mouse_input（hwnd hwnd，window窗口，无符号int状态，INPU IF（！HWND ）{+ if（输入 - ＆gt; u.mi.dwflags＆amp; mouseventf_rightup）{+ reset_clipping_window（）; +} + struct x11drv_thread_data * thread_data = x11drv_thread_data（）; hwnd clip_hwnd = thread_data-＆gt; clip_hwnd;  -  2.32.0\n Roblox Player和Roblox Studio如果使用正确的版本，可以像正常一样启动。 Roblox Studio在WineBB中有一个金额。 [9]\n  Roblox FPS Unlocker也兼容，可用于达到更高的帧。需要葡萄树丛。\n 转到提取的文件夹的目录（葡萄酒中的Linux驱动器通常是Z：\\）\n 找到.exe文件，打开葡萄酒资源管理器。它应该最小化到托盘 \n在开始指导之前，请确保您可以运行终端命令＆＃34; vkcube＆＃34;，确保您拥有所有vulkan和OpenGL驱动程序。需要葡萄草图3.4.1或以上。\n 打开＆＃34; roblox fflag编辑器＆＃34; （如果FFLAG编辑赢得＆＃39; T打开，请尝试运行Roblox Studio一次，然后它应该工作。）\n   使用vulkan，搜索＆＃34; vulkan＆＃34;并启用fflagdebuggraphicsprefervulkan（GPU必须支持vulkan，否则使用Direct3D11）\n   通过鼠标移动的任何形式的传记相机（例如。右键单击，换档锁和第一人称）将在第一人称滚动后冻结鼠标，通过按SHIFT，右转切断换档锁定 - 单击。右键单击具有由葡萄柚，布兰特的维护者制作的练习人。它＆＃39;在葡萄草图中的Arch Linux上载。\n     Roblox Player可能没有工作声音（这可以通过安装32位音频包来修复，例如，arch上的lib32-libpulse，lib32-Openal）\n 使用vulkan / OpenGL可能会告诉您驱动程序过时，这是通过安装vulkan或OpenGL驱动程序来固定的。\n 有时，在铬和一些其他基于铬的浏览器上，从网站上玩Roblox可能会打开一个新的铬实例，这是在Firefox上发生的 \n使用葡萄酒运行roblox工作室也不完美，你可以遇到以下错误：  使用DirectX 11时闪烁的阴影，除非在Studio设置中打开EagerBulkexecution时  使用OpenGL时，Plugin Guis和最近更新的UI元素（如工具箱，游戏设置和发布到Roblox屏幕）上发生闪烁  有时在加入之后，您可以获得滞后穗，只能在一个方向上移动。  当播放器移动时移动相机时，鼠标将卡住相机（这可以通过快速右键单击）  有时你可以看到一个窗口说＆＃34; robloxplayerbeta.exe遇到了严重的错误，必须关闭！＆＃34; 信息。  ↑下载。 Winehq。 2021年6月19日的原件存档。在2021年6月19日检索。 \n↑roblox面板| RDC2020。 YouTube。 Roblox（7月31日，2020年）。 在2021年6月19日检索。  ↑Bloxy新闻（7月26日，2020年）。 Twitter Post。 推特。 2021年3月1日从原版存档。2021年6月19日检索。  ↑＆＃34;您因意外的客户行为而被踢。 （错误代码：268）＆＃34; 尝试加入游戏后的消息。 GitHub。 从2021年1月25日从原件存档。2021年6月19日的检索。  ↑Alwardt，Kalen（2021年6月14日）。 NTDLL：导出zwfiltertoken（）.. source.winehq.org。 在2021年6月19日检索。  ↑Julliard，亚历山大。 葡萄酒开发版6.11现已上市.. Winehq。 在2021年6月19日检索。  ↑roblox工作室。 Winehq appdb。 2021年1月20日的原件存档。2021年6月14日检索。 ", "note_en": "While Roblox does not officially support  Linux, the  Wine compatibility layer for running Windows programs can run  Roblox Player and  Roblox Studio on Linux.\n Running Roblox with Wine requires Wine 6.11 or a more recent version. As of June 19, 2021, this requires using a development release. Wine 6.11 is available in Arch Linux and Void Linux and WineHQ provides binary packages for development releases for Debian, Fedora, and Ubuntu.  [1]\n For help installing Roblox on Linux, the  Grapejuice Discord server can be consulted. Users with some knowledge of the terminal and software compilation should not have much trouble with the install process.\n   On July 28, 2012, John Shedletsky confirmed that progress on Roblox on Linux was 97% complete. Shedletsky claimed that the problem with Linux is the poor driver support. Another blog post by Shedletsky claimed that they could spend months on Linux or they could work on a highly requested feature.\n   During the  RDC 2020 Q&amp;A session, it was confirmed that there were currently no plans to bring Roblox to Linux due to its small desktop market share. However,  Arseny Kapoulkine has said that there will be plans if &#34;Linux becomes the platform of choice for gamers&#34;.  [2]  [3]\n Roblox has been tested multiple times, with success until 2015. On May 15, 2015, Roblox received a &#34;Gold&#34; rating in the Wine App Database.  [4]\n From 2015 to 2021, it was not possible to run Roblox Player on Linux, as joining a game resulted in the connection being dropped with the error &#34;This game has shut down.&#34;  [5] This was originally assumed to be due to anti-cheat software, but Kalen Alwardt later stated this &#34;was not the cause of the issue.&#34;  [6]\n On June 11, 2021, a user by the name of ImSlappy826 (Slappy826#0001 on Discord) created a one-line patch for Wine that allowed the Roblox Player to work again on a GNU/Linux or BSD system. The patch implements the ZwFilterToken function, which was supposed to be implemented along  NtFilterToken, into ntdll. The patch has been committed to the Wine development tree  [7] and is included in Wine 6.11.  [8] User Brinker released a pre-patched version for Arch-based Linux distributions, while user robigan created a patch for Debian based distros.\n   There is an issue with the mouse when using Wine. Build from source with the following patch to correct it:\n From dba1a3c3bf5946cd766a439b7db4c8965c92f15e Mon Sep 17 00:00:00 2001From: BrinkerVII &lt;brinkervii@gmail.com&gt;Date: Sat, 12 Jun 2021 11:00:06 +0200Subject: [PATCH 2/2] Turbo jank mouse fix--- dlls/winex11.drv/mouse.c | 4 ++++ 1 file changed, 4 insertions(+)diff --git a/dlls/winex11.drv/mouse.c b/dlls/winex11.drv/mouse.cindex 42bac332664..0549c2d653b 100644--- a/dlls/winex11.drv/mouse.c+++ b/dlls/winex11.drv/mouse.c@@ -648,6 +648,10 @@ static void send_mouse_input( HWND hwnd, Window window, unsigned int state, INPU if (!hwnd) {+ if (input-&gt;u.mi.dwFlags &amp; MOUSEEVENTF_RIGHTUP) {+ reset_clipping_window();+ }+ struct x11drv_thread_data *thread_data = x11drv_thread_data(); HWND clip_hwnd = thread_data-&gt;clip_hwnd; -- 2.32.0\n Roblox Player and  Roblox Studio can be launched like normal if the correct version is used. Roblox Studio has a gold rating in winedb.  [9]\n  The  Roblox FPS Unlocker is also compatible and can be used to reach higher framerates. Requires  Grapejuice.\n Go to the directory of the extracted folder (Linux drive in Wine is usually Z:\\)\n Find the .exe file, open it through the Wine Explorer. It should minimize to tray\n   Before starting the guide, make sure you can run the terminal command &#34;vkcube&#34;, and make sure you have all Vulkan and OpenGL drivers. Requires  Grapejuice Version 3.4.1 or above.\n Open the &#34;Roblox FFlag editor&#34; (If the FFlag editor won&#39;t open, try running Roblox Studio once, and then it should work.)\n   To use Vulkan, search &#34;vulkan&#34; and enable FFlagDebugGraphicsPreferVulkan  (GPU must support Vulkan, otherwise use Direct3D11)\n   Any form of moving the ingame camera via the mouse (eg. Right-clicking, shift lock, and first person), will freeze the mouse in place after scrolling out in first person, toggling off the shift lock by pressing shift, and right-clicking. Right-clicking has a scuffy-ish patch made by the maintainer of  Grapejuice, Brinker. It&#39;s downloadable on Arch Linux at the  Grapejuice Discord.\n     Roblox Player might not have working sound (this may be fixed by installing 32-bit audio packages, e.g. lib32-alsa-plugins, lib32-libpulse, lib32-openal on Arch)\n Using Vulkan/OpenGL might tell you the drivers are outdated, this is fixable by installing your Vulkan or OpenGL drivers.\n Sometimes, on Chromium and some other Chromium-based browsers, playing Roblox from the website might open a new Chromium instance, this won&#39;t happen on Firefox\n Running Roblox Studio using Wine is also not perfect, and you can encounter the following bugs:\n Shadows flickering when using DirectX 11, unless EagerBulkExecution is turned on in the Studio settings\n  Flickering occurs on plugin GUIs and recently updated UI elements (such as Toolbox, Game Settings and Publish to Roblox screen for example) when using OpenGL\n  Sometimes after joining, you may get a  lag spike and can only move in one direction.\n   When moving your camera while the player is moving, your mouse will be stuck moving the camera (this can be fixed by right-clicking a few times quickly)\n Sometimes you can see a window saying &#34;RobloxPlayerBeta.exe has encountered a serious error and must close!&#34; message.\n  ↑   Download.  WineHQ. Archived from  the original on June 19, 2021. Retrieved on June 19, 2021.\n ↑   Roblox Panel | RDC2020.  YouTube. Roblox (July 31, 2020). Retrieved on June 19, 2021.\n ↑   Bloxy News (July 26, 2020).  Twitter post.  Twitter. Archived from  the original on March 1, 2021. Retrieved on June 19, 2021.\n  ↑   &#34;You have been kicked due to unexpected client behavior. (Error Code: 268)&#34; message after attempting to join a game.  GitHub. Archived from  the original on January 25, 2021. Retrieved on June 19, 2021.\n  ↑  Alwardt, Kalen (June 14, 2021).  ntdll: Export ZwFilterToken()..  source.winehq.org. Retrieved on June 19, 2021.\n ↑  Julliard, Alexandre.  The Wine development release 6.11 is now available..  WineHQ. Retrieved on June 19, 2021.\n ↑   Roblox Studio.  WineHQ AppDB. Archived from  the original on January 20, 2021. Retrieved on June 14, 2021.", "posttime": "2021-06-29 22:32:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux", "title": "Roblox在Linux上有最近的葡萄酒6.11 ", "title_en": "Roblox on Linux with recent Wine 6.11", "transed": 1, "url": "https://roblox.fandom.com/wiki/Roblox_on_Linux", "via": "", "real_tags": ["linux"]}, {"category": "", "categoryclass": "", "imagename": "e74721c42be06e530879c4dd518599ea.jpg", "infoid": 1068439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook是一个惊人的成功作为社交网络。任何可以获得5000万人来连接，分享照片的人，点击Farmville的小奶牛都应该得到主要的荣誉。\n  但废话垄断 - 金钱估值旋转木马必须停止。它越来越荒谬，甚至像福布斯这样的严重出版物跳过骑行。是时候深呼吸了，看看现实。\n  少数民族投资估值不是真正的Facebook现在据称价值33,000,000,000美元，但该数字完全基于明星袭击的少数民族投资者支付了一款微小的公司。\n  该公司据说，在风险投资和小额市场销售额下的十亿美元下降。因此，改变手的实际资金是公司总估值的3％！\n  换句话说，估值在缺陷的假设上，如果他们想要的话，Facebook实际上可以获得33倍。没有办法，否则现在发生这种情况。如果它可以，他们明天就会开头。\n  因此，根据少数民族投资的Facebook估值是在我的脑海中，这是一个完整的笑话，即桌子上有33,000,000,000美元。不合理的投资者确实非常满意。\n  如果你可以赚钱，那么你只会赚钱，如果你煮沸到真正的估值应该是什么，打折未来的现金流量，它会变得完全搞笑。谣言是Facebook将在收入中产生十亿美元。这肯定是真钱，对吧？ \n错误的。在您支付费用后，真正的钱是剩余的。如果据称亿美元Facebook据称，今年在任何地方发生了一个体面的保证金，他们就不会在三个月前从海拔合作伙伴中获得12亿美元的一轮。\n  但让我们成为慈善事业。让我们想象一下，Facebook今年奇迹般地造成2亿美元 -  20％的保证金。 （我不认为这是真的，否则为什么从海拔合作伙伴那里再拿12亿美元，但嘿，让你的想象力漫游）。这将在大约165岁时将Facebook的P / E放入。\n  这是谷歌的大约7.5倍，互联网世界的金钱牛。你会认真地认为Facebook是谷歌的7.5倍，也是希望的业务吗？你出去。\n  七年后没有令人发指的利润，半十亿用户哦，好吧，但也许Facebook只需要成熟，你说。如果我们少数几年给他们，童话可能会下降，并在Facebook及其股东遍布她的数量。我叫胖子。\n  Facebook已经存在了七年。它有5亿用户。如果你无法弄清楚如何在七年内赚取半亿人的钱，我会在肢体上出去，并说你不太可能做。\n  现在这一切都很有趣和游戏，直到有人承诺纽瓦克学校的股票100亿美元，基于他的底层非营利公司的幻想估值。但现在这是真的。他们在他们射击熊或撒尿的裤子之前销售皮肤，以便到达小屋或任何你想打电话给它。这不好，好吗？ ", "note_en": "Facebook is an amazing success as a social network. Anyone who can get 500 million people to connect, share photos, and click on little cows in Farmville deserves major kudos.\n  But the bullshit monopoly-money valuation merry-go-round has to stop. It’s getting beyond ridiculous and when even serious publications like  Forbes jump on for a ride. It’s time to take deep breath and take a look at reality.\n  Minority investment valuations aren’t real Facebook is now  supposedly worth $33,000,000,000, but that number is entirely based on what star-struck minority investors have paid for a tiny slice of the company.\n  The company has supposedly taken  just under a billion dollars in venture capital and  small secondary-market sales of stock. So the actual money that has changed hands is just 3% of the total valuation of the company!\n  In other words, the valuation is resting on the flawed assumption that Facebook could actually ever get 33 times as much money to change hands if they wanted to. There’s just no way, no how that’s happening right now. If it could, they’d  IPO tomorrow.\n  So the Facebook valuation based on minority investments is in my mind a complete joke in the sense that there was $33,000,000,000 dollars on the table. Irrational investor exuberance indeed.\n  You’re only worth something if you can make money to keep If you boil it down to what valuations really should be about, discounted future cash flow, it gets completely bizarro-world funny. The rumor is that Facebook will be generating a billion dollars in revenue. That’s certainly real money, right?\n  Wrong. Real money is what’s left over after you pay your expenses. If the supposed billion dollars Facebook is allegedly pulling in this year was happening at anywhere a decent margin, they wouldn’t have needed a  series E round of $120 million from Elevation Partners just three months ago.\n  But let’s be charitable. Let’s imagine that Facebook miraculously made $200 million this year — a 20% margin. (I don’t think that’s true, otherwise why take another $120 million from Elevation Partners, but hey, let your imagination roam). That would put Facebook’s P/E at some 165.\n  That’s about  7.5 times as much as Google, the golden cash cow of the internet world. Would you seriously think that Facebook is 7.5 times as good or as promising a business as Google? Get outta here.\n  No outrageous profits after seven years and half a billion users Oh, well, but maybe Facebook just needs to mature, you say. If we give them just a few more years, the profit fairy might drop by and sprinkle her billions all over Facebook and its shareholders. I call fat chance.\n  Facebook has been around for seven years. It has 500 million users. If you can’t figure out how to make money off half a billion people in seven years, I’m going to go out on a limb and say you’re unlikely to ever do.\n  Now this was all fun and games until  somebody promised the Newark schools $100 million in stock based on the fantasy valuation of his under-profiting company. But now it’s real. They’re selling the skin before they shot the bear or peeing their pants to get to the hut or whatever you want to call it. It’s just not good, alright?", "posttime": "2021-06-29 22:32:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook", "title": "Facebook不值33B（2010） ", "title_en": "Facebook is not worth $33B (2010)", "transed": 1, "url": "https://signalvnoise.com/posts/2585-facebook-is-not-worth-33000000000", "via": "", "real_tags": ["facebook"]}, {"category": "", "categoryclass": "", "imagename": "09f47a83bbba46229b8a1b2f7145e05c.png", "infoid": 1068438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "剑桥大学医院NHS基金会信托研究发现，脸部面膜保健工人佩戴对冠状病毒感染风险的巨大差异。\n 穿着高级胶片，称为FFP3可以提供高达100％的保护。\n 相比之下，佩戴标准问题的员工佩戴的员工捕捉病毒的可能性更大。\n  在信托基金的定期测试程序期间收集数据。\n   对于去年的大部分时间，医院遵循国家指导，该指导规定，医疗保健工作人员应该穿外科掩模，除了一些有限的情况。\n 虽然耐液，这些面膜是相对脆弱和倾向的，并不意味着筛分传染性气溶胶 - 可以在空气中徘徊的微小病毒颗粒，现在被广泛接受作为冠状病毒感染的来源。\n 该研究发现，员工照顾Covid患者＆＃34;红色＆＃34;病房面临的风险高达47倍，高于＆＃34;绿色＆＃34;或非covid病房。 \n领导研究员在医院职业健康专家Mark Ferris博士表示，尽管做了他们在感染控制方面所要求的一切，但员工都会获得Covid。\n 因此，由于去年12月开始袭击大流行的第二波，剑桥的经理们决定升级对红色病房的保护。\n ＆＃34;唯一需要尝试的事情可能会产生差异是FFP3呼吸器，他们做了，＆＃34;弗里斯博士说。\n    在这一举动之后的几个星期内，红色病房医疗保健工人的感染率下降，迅速落到了没有Covid患者的绿色病房上的工作人员所经历的水平。\n 该研究结束了，＆＃34;归因于沃德的曝光率的案件显着下降，FFP3呼吸器提供31-100％的保护（和最可能100％）免受Covid-19＆＃34患者的感染。\n 任何剩余的病例都可能是由社区传播而不是在医院中造成的。\n   剑桥大学麦克风周博士，剑桥大学NHS医院基金会信托，他还在研究中致力于这项工作给出了这项工作给出的工作＆＃34;一些现实世界的证据表明FFP3面具实际上比外科口罩＆＃34更有效，更有效; \n他补充说：＆＃34;显然，它在一个信任中进行了相对较小的研究，因此我们需要看到其他地方复制这些发现。\n ＆＃34;但鉴于我们看到的结果的差异，作为一种预防性原则效果，我们应该考虑的是，我们应该在改变以使用FFP3面具，以便任何关心患者的患者患者。＆＃ 34;\n  剑桥信任是英国两侧的17个已知，无论国家政策如何，都决定升级PPE。\n 呼吁FFP3掩模更广泛地符合英国医学协会，皇家护理（RCN）和许多其他专业机构的长期要求。\n 他们一再上诉，以面对疾病的空气传播威胁，最近在本月早些时候与卫生官员的高级别会面上进行威胁。\n 在新卫生秘书萨吉德·贾维德的公开信中，新的Air NHS顾问和医生表示，新的研究提供了更多证据证明了政策需要改变的原因。\n ＆＃34;这对医疗工作者保护具有重要意义，因为英国警察与一个希望的A＆＃39;出口波和＃39;以及试图减少其他工作的大量积压，同时应对不可避免的人的疾病和隔离，＆＃34;小组写道。 \n它表示，在大流行早期短缺之后，供应链现在已经大大恢复，虽然FFP3面具比外科手术不太舒适，但调查显示员工通常更喜欢更高水平的保护。\n ROSE GALLAGHER，RCN＆＃39;领先的感染防治，也欢迎研究，告诉BBC：＆＃34;这项重要的研究为RCN＆＃39增加了进一步的重量。继续呼吁护理人员在需要时，从Covid-19更好地免受Covid-19，并且每当需要时都会获得最高呼吸道保护设备的常规访问。\n ＆＃34;我们仍然看到Covid-19的案例，即使是一些已接种疫苗的人，它是重要的工作人员被完全保护，并且没有试图限制或缓解措施，以进一步降低感染风险。 ＆＃34;\n 卫生和社会护理部门的部门表示，定期更新PPE标准的指导，以反映最新科学。\n ＆＃34; NHS和社会护理人员的安全始终是我们的首要任务，我们继续在时钟上工作，以提供PPE以保护这些前线。\n ＆＃34;出现的证据和数据被不断监测和审查，并在适当的情况下相应修改和指导。＆＃34; ", "note_en": "The quality of face masks healthcare workers wear makes a huge difference to their risk of coronavirus infection, Cambridge University Hospitals NHS Foundation Trust research has found.\n Wearing a high grade mask known as an FFP3 can provide up to 100% protection.\n By contrast, there is a far greater chance of staff wearing standard issue surgical masks catching the virus.\n  The data was gathered during a programme of regular testing for Covid at the trust.\n   For most of last year, the hospital followed national guidance which specifies that healthcare workers should wear surgical masks, except in a few limited situations.\n Though fluid resistant, these masks are relatively flimsy and loose-fitting and are not meant to screen out infectious aerosols - tiny virus particles that can linger in the air and are now widely accepted as a source of coronavirus infection.\n The study found that staff caring for Covid patients on &#34;red&#34; wards faced a risk that was up to 47 times higher than those on &#34;green&#34; or non-Covid wards.\n Lead researcher Dr Mark Ferris, a specialist in occupational health at the hospital, said staff were getting Covid despite doing everything they were asked to in terms of infection control.\n So as the second wave of the pandemic started to hit last December, managers in Cambridge made a local decision to upgrade the protection on red wards.\n &#34;The only thing left to try that could make a difference was FFP3 respirators, and they did,&#34; Dr Ferris said.\n    In the weeks following this move, the rate of infections among healthcare workers on red wards dropped spectacularly, quickly falling to the level experienced by staff on green wards where there were no Covid patients.\n The study concludes that &#34;cases attributed to ward-based exposure fell significantly, with FFP3 respirators providing 31-100% protection (and most likely 100%) against infection from patients with Covid-19&#34;.\n Any remaining cases were likely to be caused by spread in the community, rather than in the hospital.\n   Dr Mike Weekes, of Cambridge University NHS Hospitals Foundation Trust, who also worked on the study, said the work gives &#34;some real world evidence that FFP3 masks are actually effective and more effective than the surgical masks&#34;.\n He added: &#34;Clearly, it&#39;s a relatively small study in one trust and so we need to see these findings replicated elsewhere.\n &#34;But given the difference in the results that we&#39;ve seen, as a sort of precautionary principle effect, what we should be thinking about is changing to use FFP3 masks for anyone caring for a patient with coronavirus.&#34;\n  The Cambridge trust is among 17 across the UK known to have decided to upgrade PPE regardless of national policy.\n The call for FFP3 masks to be issued more widely is in line with a long-standing demand by the British Medical Association, the Royal College of Nursing (RCN) and many other professional bodies.\n They have repeatedly appealed for higher standards of protection to face the threat of airborne spread of the disease, most recently in a high-level meeting with health officials earlier this month.\n In an open letter to the new Health Secretary Sajid Javid, the Fresh Air NHS group of consultants and doctors says the new study provides yet more evidence of why the policy needs to change.\n &#34;This has important implications for healthcare worker protection as the UK copes with what is hopefully an &#39;exit wave&#39;, as well as trying to reduce the massive backlog of other work whilst coping with inevitable staff sickness and isolation,&#34; the group wrote.\n It says supply chains have now been largely restored after the shortages of the early days of the pandemic, and that although FFP3 masks are less comfortable than surgical ones, surveys show staff generally prefer a higher level of protection.\n Rose Gallagher, the RCN&#39;s lead for infection prevention and control, also welcomed the research, telling the BBC: &#34;This important study adds even further weight to the RCN&#39;s continuing call for nursing staff to be better protected from Covid-19 and given routine access to the highest levels of respiratory protective equipment whenever they need it.\n &#34;We are still seeing cases of Covid-19, even from some who have been vaccinated, and it is vital staff are fully protected and there are no attempts to restrict or ease off on measures to further reduce the risk of infection.&#34;\n A Department of Health and Social Care spokesperson said guidance on PPE standards was regularly updated to reflect the latest science.\n &#34;The safety of the NHS and social care staff has always been our top priority and we continue to work round the clock to deliver PPE to protect those on the frontline.\n &#34;Emerging evidence and data are continually monitored and reviewed and guidance will be amended accordingly if appropriate.&#34;", "posttime": "2021-06-29 22:32:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "妆容,masks,ffp3", "title": "covid：妆容升级削减感染风险，研究发现 ", "title_en": "Covid: Masks upgrade cuts infection risk, research finds", "transed": 1, "url": "https://www.bbc.co.uk/news/health-57636360", "via": "", "real_tags": ["妆容", "masks", "ffp3"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我第十四岁开始在十四岁开始工作以来，Sitehas经历了许多修订，并希望为更好的改变。这博客最初使用Python /烧瓶后端动态地服务，拥有自定义登录系统和“编辑器”（虽然是一个输入框）。关于我网站的更奇怪的事情，我是我的表现形式。\n 对我来说很清楚，即使在我的年轻时期，也要写出原始的HTML WassubOpptimal。不知何故（也许通过github）我听说了马克下降，并意识到一种人类可读的标记语言可能是一种重大的方式。当然，留下了什么，渲染内容。我发现的最简单方法是只需坚持一个javascript脚本，调用标记为标记，以在pageload上运行并将所有标记转换为漂亮的HTML。\n 每个页面加载都会发生这种渲染。每次我在我的网站上导航页面上的页面，一两秒钟，我会看到我所写的原始，UnroweredMarkdown，然后将会消失并被替换为页面的内容。渲染也没有错误。如果我的连接特别慢（谢谢，康卡斯特），或者如果我忘了禁用Umatrix，我将被遗漏频繁出现＃，_，* ......最终我意识到我的错误，并转换为渲染后端的啰嗦。现在，我的内容将出现已经格式化的用户，并且他们不会为JavaScript程序进行磁带来完成阅读我写的内容。所有事情都很好。\n 有时候，我回顾了我的网站的早期迭代，并微笑了我所做的愚蠢错误。然而，我无法自然取笑原始的标准渲染解决方案，因为在某种程度上，它仍然存在。\n  当我在Google上搜索“网站上的网站”时，以下两个链接位于我的搜索顶部：\n  实际上，这些是两个最受欢迎的数学渲染解决方案（我的经验）。然而，这两个Solutiosn共享某些东西，彼此共同，并随着我的网站的早期迭代 - 他们使用客户端渲染进行静态内容。在我看来，这是荒谬的。每次你都要访问使用Mathjax或Katex的网站，任何数学输电都到达你的机器以乳胶标记的形式。例如，e-x 2 e ^ { -  \\ frac {x} {2}} e-2 x看起来像e ^ { -  \\ frac {x} {2}}。然后渲染图软件（Mathjax或Katex）然后拍摄此标记，并将其转换为您可以显示浏览器和CSS。就像我的旧网站一样，所有这一切都会在加载页面时发生。这不是一个unmonmonthing，无论是：数学itackexchange和chegg使用mathjax等网站，还有更多可以发现这个列表。根据这个页面，khan学院，gitterand gitlab使用Katex。其中一些网站甚至没有启用JavaScript加载它们的内容，更少的Rendermath。\n 一个怀疑论可能会说不可能提前向HTML ANDCS渲染乳胶。这甚至可能是真的。 UserOn“我们可以用服务器端Mathjax替换客户端Mathjax”在2015年Mathoverflow Meta上的线程指出MathJax不支持HTML输出： \n我从Mathjax开发人员找到了[评论]确认HTML + CSS尚未使用服务器端版本运行。 。 。\n    还是我们？ MathJax版本2.6在其更改日志中具有以下注释：\n 改进了CommonHTML输出。 CommonHTML输出现在提供与HTML-CSS和SVG输出相同的布局质量和MathML支持。它平均比其他输出快40％，并且它在所有浏览器上产生的标记相同，因此也可以通过Mathjax-node在服务器上预先生成。\n  [commonhtml]是Mathjax版本2.6以来的Mathjax的主要输出模式。其主要优势是其质量，一致性以及其输出与浏览器，操作系统和用户环境无关的事实\n 因此，不仅可以明确实现服务器生成的数学输出，而且用于生成这种输出的算法已经在客户端使用！如果你看起来很难，你甚至可以找到几个使用这个算法服务器端的人，但其中许多人患有其他问题......\n  将数学转换为图像（例如PNG或SVG文件）诱人很诱人。此方法是在此博客上拍摄和此高级Web机械文章。 Wolfram Mathworld还将他们的数学呈现为图像。但是，在我的作业中，这不是正确的方法。对于用户而言，我对我来说是不方便的，我怀疑是需要辅助技术的人。在这里，我看到的问题我看到了图像数学：\n 图像是不可能与复制/粘贴一起使用的。我无法在渲染图像中选择一个单词，数字或符号。我有时这样做，这是一个有目的的问题。 \n图像并不像响应，并且很难样式。在使用图像时难以改变线条破碎，字体，甚至颜色难以改变。当用于内联数学时，它们就像疼痛的拇指一样伸出粗糙，并且溃疡非常奇怪（或消失）如果用户扩展会在页面上操纵颜色。\n 对需要屏幕读者的用户完全不透明。读者支持MathML，[注意：MathML是基于XML的数学标记，意味着用作其他数学处理器的低levelouput目标。虽然它在Firefox中支持，但它需要在Chrome中的Polyfill，并将我们带回前端的JavaScript。 ]图像更难与之合作。我链接的SITESTHAT，使用图像没有标题与他们的数学，使其完全无法进入。\n 使用图像而不是基于JavaScript的渲染器让我想起了虚假的二分法谬误。为什么我们不能做我们做的事情，而是使用服务器？\n  如果您在Google上查找“Mathjax Setup”，则使用大约多种链接告诉您如何获取渲染工作客户端的链接。 IT'CONVAVENT：单个JavaScript＆lt; src＆gt;标签，也许有点代码在页面底部有一些设置。\n 如果您查找“Mathjax渲染服务器端”，则资源是潮流的。实际上，我在这样的搜索后呈现的前两个基于图像的解决方案。还有一个网站看起来有希望：Antoine Amarilli的博客文章关于服务器端渲染。该页面承诺使用MathJax-node生成HTML的自托管方式，甚至提供了非常引人注目的示例输出。我决定尝试这种方法，但无济于事。首先，Mathjax基础架构改变了：\n 随着MathJax重组其存储库，要进行以下工作，您可能需要手动安装Mathjax-node-CLI，以及安装MathJax-node和可能的MathJax-node-Page。再次，我没有尝试过。再次感谢指向这一点！\n 这确实如此。但是，较大的问题是Page2htmlprick，它在一个HTML页面中呈现了所有数学的page2htmlprick。我找到了tex2html和text2htmlcs，它可以唯一没有周围HTML的方程式。我还找到了MJPage，它用SVG Forms替换了一个页面中的数学表达式。这个实际上看起来非常好 -  SVGS甚至有标签与磨牙乳胶代码。但是，这些标签很难读取（可能是使用屏幕读者的人数），并且SVG映像othersweplyswore维持了上述大部分问题。此外，在初始渲染之后，该页面的表现比基于JavaScript的替代方案更加缓慢。 [注意：这是纯粹的轶事，并且需要更彻底的分析一成本。 ] \n简而言之，找到服务器端LaTex渲染的资源更难。尤其很难找到与MoreThan静态页面一起使用的这些资源。我可以使用正则表达式来解压缩我需要从HTML呈现，调用它上的Tex2htmlcs，并拼接它回到页面。但是德语用户怎么能呈现他们的数学？ Whatabout有人像我在你的年轻人那样写博客引擎？不知何故，我们希望为用户提供更好的体验，左右的替代方案，或多或少没有外部帮助......\n  今天的大多数网站使用客户端，基于JavaScript的渲染技术进行数学。 Serveris可以完成的工作已经超越了成千上万的浏览器，他们必须运行相同的codeto获得相同的结果。不知何故，这是最好的解决方案 - 最可访问的替代方案使用图像，这是用户体验的下坡。我希望服务器端渲染成为常见的，更好地记录。 ", "note_en": "Since I first started working on my website at age fourteen, the sitehas gone through many revisions, and hopefully changed for the better.This blog was originally dynamically served using a Python/Flask backend,having a custom login system and post “editor” (just an input box).One of the more strange things about my website, though, was how I displayedcontent.\n It was clear to me, even at my young age, that writing raw HTML wassuboptimal. Somehow (perhaps through GitHub) I heard about Markdown,and realized that a human-readable markup language was probably a muchbetter way to go. What remained was, of course, rendering the content.The easiest way I found was to just stick a JavaScript script, callingout to  marked, to run on pageload and convert all the markup into pretty HTML.\n This rendering would happen on every page load. Every time I navigatedbetween pages on my site, for a second or two, I’d see the raw, unrenderedMarkdown that I had written, which would then disappear and be replacedwith a proper view of the page’s content. The rendering wasn’t error-proof,either. If my connection was particularly slow (which it was, thanks, Comcast),or if I forgot to disable uMatrix, I would be left having to sift throughthe frequent occurences of  #,  _,  *… Eventually I realized my mistake,and switched to rendering Markdown on the backend. Now, my contentwould appear to the user already formatted, and they wouldn’t have towait for a JavaScript program to finish to read what I had written.All was well.\n Sometimes, I look back on the early iterations of my site, and smileat the silly mistakes I’d made. Yet I can’t innocently make fun ofmy original Markdown rendering solution, because in a way, it lives on.\n  When I search for “render math on website” on Google,the following two links are at the top of my search:\n  Indeed, these are the two most popular math rendering solutions(in my experience). Yet both of these solutiosn share something somethingin common with each other and with the early iterations of my website -they use client-side rendering for static content. In my opinion, this is absurd.Every time that you visit a website that uses MathJax or KaTeX, any mathematicalnotation arrives to your machine in the form of LaTex markup. For instance,       e  −  x 2 e^{-\\frac{x}{2}}     e         −           2        x ​     looks like  e^{-\\frac{x}{2}}. The renderingsoftware (MathJax or KaTeX) then takes this markup and converts it intoHTML and CSS that your browser can display. Just like my old website,all of this happens  every time the page is loaded. This isn’t an uncommonthing, either: websites like Mathematics StackExchange and Chegg use MathJax, and many more can be foundon  this list.According to  this page, Facebook Messenger, Khan Academy,  Gitterand  GitLab use KaTeX. Some of these websitesdon’t even load their content with JavaScript enabled, much less rendermath.\n A skeptic might say that it is not possible to render LaTeX to HTML andCSS ahead of time. This might even have been true in the past. A useron the “can we replace client-side MathJax with server-side MathJax” thread on MathOverflow Meta in 2015 points out that MathJax doesn’t supportserver-side HTML output:\n I found  [the comment] from a MathJax developer confirming that HTML+CSS doesn’t work yet with the server-side version . . .\n    Or are we? Version 2.6 of MathJax has the following comment in its change log:\n Improved CommonHTML output. The CommonHTML output now provides the same layout quality and MathML support as the HTML-CSS and SVG output. It is on average 40% faster than the other outputs and the markup it produces are identical on all browsers and thus can also be pre-generated on the server via MathJax-node.\n  [CommonHTML] is MathJax’s primary output mode since MathJax version 2.6. Its major advantage is its quality, consistency, and the fact that its output is independent of the browser, operating system, and user environment\n So not only is it explicitly possible to have a server-generated math output,but the algorithm that would be used for generating such output is alreadyin use on the client-side! If you look hard enough, you may even find a fewresources for using this algorithm server-side, but many of those suffer fromanother problem…\n  It’s tempting to convert mathematics to an image, such as a PNG or an SVG file.This approach is taken on  this blog and this  Advanced Web Machinery article.  Wolfram MathWorld also render their mathematics to images. However, in my opion,this is  not the right approach. It is inconvenient for me as a user,and, I suspect, for those in need of assistive technologies. Here arethe issues I see with rendering mathematics to images:\n Images are impossible to use with copy/paste. I am unable to select a word,number, or symbol in a rendered image. I do this on occasion, and this isnot a contrived issue.\n Images are not nearly as responsive, and are difficult to style.Line breaking, fonts, and even colors are difficult to change when using images.They stick out like a sore thumb when used for inline math, and canlook very strange (or disappear) if a user extension manipulates colors on thepage.\n Images are completely opaque to users in need of screen readers. Whilesome readers support  MathML,   [note:MathML is an XML-based markup for mathematics, meant to serve as a low-levelouput target for other math processors. While it is supported in Firefox,it requires a Polyfill in Chrome, and brings us back to front-end JavaScript. ] images are much harder to work with. The sitesthat I linked that use images do not have captions with their math,making it completely inaccessible.\n Using images instead of a JavaScript-based renderer reminds me ofthe  false dichotomy fallacy. Why can’t we do what we do,but using the server?\n  If you look up “mathjax setup” on Google, you are greeted with dozensof links telling you how to get the rendering working client-side. It’sconvenient: a single JavaScript  &lt;src&gt; tag, and maybe a bit of codeat the bottom of the page with some settings.\n If you look up “mathjax render server-side”, the resources are far morescarce. In fact, the first two image-based solutions I presented to youcame up as results after such a search. One more website looks promising: Antoine Amarilli’s blog post about server-side rendering.The page promises a self-hosted way of generating HTML using  mathjax-node,and even provides a very compelling sample output. I decided to tryout this approach, but to no avail. First of all, the MathJax infrastructurehas changed:\n As mathjax has reorganized their repositories, to make the following work, you will probably need to install manually mathjax-node-cli, as well as maybe installing mathjax-node and possibly mathjax-node-page. Again, I haven’t tried it. Thanks again to Ted for pointing this out!\n This was indeed the case. The bigger issue, though, was that the  page2htmlprogram, which rendered all the mathematics in a single HTML page,was gone. I found  tex2html and  text2htmlcss, which could onlyrender equations without the surrounding HTML. I also found  mjpage,which replaced mathematical expressions in a page with their SVG forms.This actually looked quite good - the SVGs even had labels with theiroriginal LaTeX code. However, those labels were hard to read (likelyespecially so for people using screen readers), and the SVG imagesotherwise maintained most of the issues I described above. Additionally,  the page behaved significantly more sluggishly after the initial render than the JavaScript-based alternative.   [note:This is purely anecdotal, and would require a more thorough analysis togeneralize. ]\n In short, it’s much harder to find resources for server-side LaTeX rendering.It is especially hard to find such resources that work with morethan static pages. I could probably use a regular expression to extractmath I need to render from HTML, call  tex2htmlcss on it, and splice it backinto the page. But how could a WordPress user render their math? Whatabout someone writing their blog engine like I did in my youth? Somehow,those of us wanting to give our users a better experience are leftfumbling for an alternative, more or less without outside help…\n  The majority of websites today use client-side, JavaScript-based renderingtechniques for mathematics. The work that could be done by a serveris outsorced to thousands of browsers, who have to run the same codeto get  identical results. Somehow, this is the best solution -the most accessible alternatives use images, which are a downgradeto the user experience. I wish for server-side rendering to becomemore common, and better documented.", "posttime": "2021-06-29 22:31:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,渲染,math", "title": "网上数学渲染问题（2020） ", "title_en": "Problems with math rendering on the web (2020)", "transed": 1, "url": "https://danilafe.com/blog/math_rendering_is_wrong/", "via": "", "real_tags": ["2020", "渲染", "math"]}, {"category": "", "categoryclass": "", "imagename": "719dcf5cd02261fe43e602a5fdba0d11.jpg", "infoid": 1068435, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2009年成立，Doximity是医生的社交网络。 它在其平台上有80％的美国医生，并且在2020年的收入为200米+。......  阅读更多  科罗拉多州的一个新的平等薪酬法 - 以及额外的官僚主义 - 正在降低国家居民的偏远工程机会。 ......  阅读更多  VR仍在寻找“杀手应用程序”。 心中和冥想答案吗？ ......  阅读更多  加利福尼亚有一个新的数字疫苗卡，而纽约使用Excelsior Pass。 如果疫苗接种率继续上升，则可能重要。 ...... \n阅读更多  牛肉价格飙升......和大4件肉袋（嘉吉，杰布，泰森食品，国家牛肉）正在拉动利润。 ......  阅读更多  伦敦艺术家Stacie McCormick成立了公平的艺术博览会，她称之为“艺术家和收藏家的火种”。 ......  阅读更多  Wayfair联合创始人Steven Conine认为未来美国将使用我们家的3D模型购买家具。 ......  阅读更多 ", "note_en": "Founded in 2009, Doximity is a social network for doctors. It has 80%+ of America’s physicians on its platform and had revenue of $200m+ in 2020. ...\n Read More\n A new equal pay law in Colorado -- and the additional bureaucracy -- is costing the state’s residents remote work opportunities. ...\n Read More\n VR is still searching for a “killer app.” Is mindfulness and meditation the answer? ...\n Read More\n  California has a new digital vaccine card, while New York uses the Excelsior Pass. Neither may matter if vaccination rates continue to rise. ...\n Read More\n   Beef prices are surging… and the Big 4 meatpackers (Cargill, JBS, Tyson Foods, National Beef) are pulling in the profits. ...\n Read More\n London-based artist Stacie McCormick founded Fair Art Fair, which she calls the “Tinder for artists and collectors.” ...\n Read More\n Wayfair co-founder Steven Conine thinks future-us will shop for furniture using 3D models of our homes. ...\n Read More", "posttime": "2021-06-29 22:31:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经济学,商店,dollar,艺术家", "title": "美元商店的经济学 ", "title_en": "The economics of dollar stores", "transed": 1, "url": "https://thehustle.co/the-economics-of-dollar-stores", "via": "", "real_tags": ["经济学", "商店", "dollar", "艺术家"]}, {"category": "", "categoryclass": "", "imagename": "d7e66489f5d96e063bc172f346bba67a.jpg", "infoid": 1068433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Analyst House Gartner警告了用户不要将数据管理产品与三大云极高的超声波混合起来。\n 随着AWS，Microsoft Azure和Google Cloud平台领导包装，云基础设施提供商在Q1中看到支出达到418亿美元，根据Canaalys一年同期的35％。虽然组织在基础设施方面采用了一些对冲，但在Gartner的VP分析师VP分析师Sanjeev Mohan表示，虽然涉及数据管理和分析，但最好坚持一名球员。\n 虽然AWS，Azure和GCP都有优势和数据工具集中的弱点，但莫汉告诉Gartner数据＆amp，几乎没有尝试选择每个供应商的最佳技术;本周分析峰会。\n   ＆＃34;仔细踩踏。如果你＆＃39; re new和你说，我想成为多云，然后再想一想。这是一个全职工作，保持单一的云，并了解所有细微差别，[你没有时间]去开始投资多个云。＆＃34;\n      虽然Mohan使用他的会议讨论他们的数据和分析堆栈中每个最大的云提供商提供的技术，其中一个人归功于您的样子。\n ＆＃34;任何这些云提供商都将从业务角度工作，问题更加非功能性：您有什么技能？如果您是Microsoft Shop，则使用Azure，因为您熟悉Microsoft工具。如果您有一个非常复杂的IT商店，并且您想要一系列巨大的产品，您很乐意做大量的工程，那么AWS为您提供更多选择。如果您是开源作为部门，那么谷歌云，＆＃34;莫汉说。\n   如果您＆＃39;重新选择为数据平台挑选云提供商，Mohan提供了长期列表的标准列表，包括一致性，开源VS专有，易于部署，数据摄取，数据访问，性能，可扩展性等。 \n只是因为你＆＃39;在他们的云中没有意味着你必须使用多亿美元提供者和＃39; s数据工具。经过一点栅栏坐着，手工缠绕而不是＆＃34;对数百种产品，我们每周覆盖非本机工具，＆＃34; Mohan承认，Informatica拥有大量的数据工程产品。 Apache Kafka，Snowflake和Newbie数据摄取Unicorn Fivetran也得到了尊贵的提及。\n   但是，不要忘记老朋友。尽管Hadoop的平流层升起和笨拙的堕落，但主要云提供商的堆栈提供了一些隐藏大象的痕迹。例如，微软已经埋藏了HDInsight的托管服务。曾经依赖HortonWorks，它现在使用Microsoft Distro。 AWS有弹性MapReduce，一个用于批量和在线处理的管理Hadoop和Spark Service。同样，谷歌依赖于Hadoop，它激发的分布式文件系统，在其DataProc工具中创建持久对象以及数据融合，数据转换产品。 ®\n     英国艺术家寻求＆＃39; luvvie levy＆＃39;在新的小工具上弥补消费者在线访问的所有媒体\n     世界领先的灯光＆＃34;艺术＆＃34;已呼吁在手机，笔记本电脑和电脑上征税，以帮助融资创意产业，他们声称因缺乏收入和资金而被蹂躏。\n  DACS  - 视觉艺术家＆＃39;权利管理非营利资料 - 估计新技术小工具销售1-2％的征收可以帮助每年提高250万英镑300米。\n  它说，一部分推理的一部分是倡议，是它将有助于纠正通过直接支付的人们访问音乐，电影和其他创意物料的人们造成的平衡。\n  继续阅读 \nPanasonic＆＃39; STARGBook G2平板电脑即使使用手套和完整的Windows 11兼容性也会有10张手指触摸。  继续阅读  Bezos V Branson：Wannabe Space Barons的战斗，作为FAA的处女银河，开始飞行客户  一对富有的白人看起来在靠在的银河被联邦航空管理局（FAA）给予顾客到空间之后，在空间的边缘看它在空间边缘。  继续阅读  富士通赢得了900万英镑的合同徒步旅行，为北爱尔兰教育管理局近3年运行近3年  富士通已被北爱尔兰教育机构授予£9,200万英镑的合同延期，以改变近三年的甲骨文人力资源和工资系统的实施。 \n该项目 - 首先被称为EA综合财务管理信息系统，现在被称为EA一个项目 -  2015年始于2015年，返回日本供应商2000万英镑的合同奖。但是，根据上周发布的投标奖颁发通知，该权威表示，新奖项是必要的＆＃34;促进功能变化，以有效地满足学校＆＃39;要求，数据迁移问题由于员工条款和条件的变化的复杂性，以及Covid-19锁定导致的项目延迟。＆＃34;\n  通知续：＆＃34;此修改将能够继续执行现有的单一承包商管理服务安排，其中包括提供广泛的计算机和相关服务，信息技术咨询服务以及计算机硬件，软件和相关的电源产品。\n  继续阅读\n  当自由和开放的来源实际上意味着每包600万英镑 - £8£8,8,800; atos＆＃39;与NHS英国合同136亿英镑\n  ＆＃39;所有软件都必须安全且安全地部署在我们提供的指南内，＆＃39;外包说\n     法国外包员ATOS在非部门政府机构的工人请求的流行和开源软件中，From French Outsourcer Atos每一直在为NHS英格兰充电。\n  根据登记册看到的文件，NHS英国的数据工作人员必须通过他们的线路管理要求FOSS包。这些是由外包员履行的，作为其2019年6月签署的卫生和社会护理部的136万英镑协议的一部分。 \nNHS英格兰的分析师，他们致力于世界上世界性之一的战略规划，以及协助Covid-19回应，已要求普通，自由可用的开源包，如r，统计语言和Python，通用语言。\n  继续阅读\n  英国＆＃39;金融看门狗在二明团的弓箭中发射了警告，并命令它在Binance.com上留下通知，吓跑英国加密粉丝。\n  这似乎是由于指数，最终是在开曼群岛，希望在英国在英国发布交易所，以来，自今年年初以来，英国的加密货币公司必须注册全国＆＃39;金融行为权，符合其反洗钱和反恐资助需求。\n  本金Hasn＆＃39; T完成这一点，或者因为FCA本身置于它，但BINANCE已经展示了一个＆＃34;拼版＆＃34;对监管机构＆＃39;规则。\n  继续阅读\n  我们希望这家酒店有一个漂亮的水疗中心，因为Windows确定看起来需要一些R＆amp; r \nBork！Bork！Bork！微软Windows的能力对于它的能力来说是偏离任何地方，但这是我们认为，它第一次在酒店的一侧羞辱。\n  ＆＃34; 4星级酒店正在使用2星级操作系统，似乎，＆＃34;我们的读者说，周末发现了博格，在英国萨默塞特·布里奇沃特的墙壁上涂抹了。\n  继续阅读\n  佛罗里达州的淡水甲壳类动物Boffins的一项研究表明，将抗抑郁药喂养到小龙虾可以使它们更加开除和冒险 - 或多或少是如何定义抗抑郁药应该如何工作的定义。在人类，至少。\n  该实验提出了研究抗抑郁药的接触程度可能影响野外小龙虾行为，因为人类药物污染物是淡水环境中的增加因素。\n  为此，它们创造了“20个椭圆形循环的人工流”，每个流是它们充满60升无化学地下水。在每个人造溪流中，他们在一端为小龙虾造成了避难所，开始进入，这导致了两个单独的路径：用鱼明胶调味以发出食物来源;另一个小龙虾填充的另一个潜在挑起了激进的反应。\n  继续阅读 \nM1中的m是呻吟：如何将新的MacBook Pro转换为桌面主控？\n     M1 MacBook Pro就像那个辉煌的同事，他们坚持在办公室小厨房里的微波。善于工作，当然，也是深深的烦人。\n  一方面，这台机器是一个名副其实的野兽。它快速，安静，并拥有此评论家使用的任何机器的最佳电池寿命。然而，它遭受了两个不同的缺陷。首先，它依赖于两个USB-C（在这种情况下，Thunderbolt 4）端口进行外部可扩展性。其次，无论出于何种原因，它本地只支持一个外部显示器。\n  幸运的是，这些是非常简单的，因为你提供了一些深口袋。几周前，anker向我们发送了它的Powerexpand 5-In-1霹雳4码头审查。价格为200英镑，＆＃39;不便宜。\n  继续阅读\n  赞助云的进度，组织IT基础设施比组织披萨交付更难。\n  根据MarketsandMarkets，到2021年底，云数据中心将处理超过总工作量的94％。这很容易解释为什么企业迁移到云：像如何简单的公司从提供者租用能力和解决方案。但是，所有与虚拟机更相关的所有内容。 \n专用服务器周围的情况并不像简单。然而，它们仍然对某些任务仍然不可或缺，并允许客户的业务充分利用其基础架构。我们对裸裸金属服务器的审查将显示它们的优势，当它们是必不可少的，如何将它们无缝地集成到公司IT基础架构中。\n  继续阅读\n  哈勃望远镜在另一个紧张的地方：在天体物理学家之间争吵在一个＆＃39;暗物质缺乏＆＃39;星系\n  一支球队称，DF2是72米的人，另一个不同意 - 我们与双方说话\n     毫无介意辐射的记忆错误。几十年古老的哈勃太空望远镜的另一部分变化已经发现了果酱。这次其相机单元再次在科学家之间的冲突中，无论是Galaxy NGC 1052-DF2是否包含任何暗物质。\n  当DF2在2018年在自然纸上写出时，研究立即抬起眉毛。本文得出结论，星系缺乏暗物质。怎么可能？\n  神秘的物质被认为是在所有星系中存在，持有闪闪发光的星星，粉尘和天然气的漩涡，更多，给星系结构和形状。暗物质是银河形成理论的重要组成部分，并在没有这种隐藏的东西的情况下找到星系，或者它的数量非常低，打破所有规则。 DF2被告警，作为一个重要的奇怪。 \n继续阅读  注册 - 对科技界的独立新闻和意见。 部分情况出版 ", "note_en": "Analyst house Gartner has warned users not to mix and match data management products from the three largest cloud hyperscalers.\n With AWS, Microsoft Azure, and Google Cloud Platform leading the pack, cloud infrastructure providers saw spending hit $41.8bn in Q1, 35 per cent up on a year earlier  according to Canalys. While organisations employ some hedging in terms of infrastructure, when it comes to data management and analytics, it is best to stick with one player, said Sanjeev Mohan, VP analyst at Gartner.\n Although AWS, Azure, and GCP all have strengths and weaknesses in the data toolset, there was little to gain from trying to pick the best technologies from each vendor, Mohan told the Gartner Data &amp; Analytics Summit this week.\n   &#34;Tread carefully. If you&#39;re new and you say, I want to be multi-cloud, then think again. It is a full-time job keeping up with a single cloud, and understand[ing] all the nuances, [you don&#39;t have time] to go and start investing in multiple clouds.&#34;\n      While Mohan used his session to discuss the technologies offered by each of the biggest cloud providers in their data and analytics stack, which one to go with comes down to what kind of user you are.\n &#34;Any of these cloud providers will work for you from a business point of view, the question is more non-functional: what skills do you have? If you are a Microsoft shop, then go with Azure, because you&#39;re familiar with Microsoft tools. If you have a very sophisticated IT shop and you want a vast breadth of products and you are happy to do a lot of engineering then AWS provides you with more choices. If you are open source as a department, then Google Cloud,&#34; Mohan said.\n   If you&#39;re into picking your cloud provider for a data platform, Mohan offered a long list of criteria, including consistency, open source vs proprietary, ease of deployment, data ingest, data access, performance, scalability, and so on.\n Just because you&#39;re in their cloud doesn&#39;t mean you have to go with the multibillion-dollar provider&#39;s data tools either. After a bit of fence sitting and hand wringing about not being &#34;unfair to hundreds of products that we cover on weekly basis on non-native tools,&#34; Mohan conceded that Informatica has a vast array of data engineering products. Apache Kafka, Snowflake, and newbie data ingestion unicorn Fivetran got honourable mentions too.\n   But let&#39;s not forget old friends. Despite the stratospheric rise and ungainly fall of Hadoop, the stacks of the main cloud providers offer traces of a few hidden elephants. Microsoft, for example, has Hadoop buried in managed service HDInsight. Once relying on Hortonworks, it now uses a Microsoft distro. AWS has Elastic MapReduce, a managed Hadoop and Spark service for batch and online processing. Similarly, Google relies on Hadoop, the distributed file system it inspired, in its Dataproc tool for creating persistent objects, as well as in Data Fusion, a data transformation product. ®\n     UK artists seek &#39;luvvie levy&#39; on new gadgets to make up for all the media that consumers access online\n     Leading lights in the world of &#34;the arts&#34; have called for a techy tax on mobiles, laptops, and PCs to help finance creative industries they claim have been ravaged by lack of revenue and funding.\n  DACS – the visual artists&#39; rights management nonprofit – reckons a levy of 1-2 per cent on the sale of new tech gadgets could help raise £250m-£300m a year.\n  Part of the reasoning behind the initiative, it said, is that it would help redress the balance caused by people accessing music, films, and other creative material online without paying for it directly.\n  Continue reading\n  Panasonic&#39;s Toughbook G2 tablet will feature 10-finger touch even with gloves on and full Windows 11 compatibility.\n  Continue reading\n  Bezos v Branson: Battle of the wannabe Space Barons as Virgin Galactic cleared by FAA to start flying customers\n     A pair of rich white men look set to duke it out at the edge of space after Virgin Galactic was given the green light by the Federal Aviation Administration (FAA) to fly customers to space.\n  Continue reading\n  Fujitsu wins £9m contract hike for Oracle HR system running nearly 3 years late at Northern Ireland Education Authority\n     Fujitsu has been awarded a £9.2m contract extension by the Northern Ireland Education Authority for changes to the implementation of an Oracle HR and payroll system that is already nearly three years late.\n  The project – first known as the EA Integrated Financial Management Information System, now dubbed EA One Project – began in 2015 with a £20m contract award to the Japanese supplier. But, according to  a tender award notice published last week, the authority said the new award was necessary to &#34;facilitate functionality changes to effectively meet schools&#39; requirements, data migration issues due to the complexity of the variations in employee terms and conditions, and project delays due to COVID-19 lockdowns.&#34;\n  The notice continued: &#34;This modification will enable the continuation of the existing single contractor managed service arrangement which includes the supply of a broad range of computer and related services, information technology consultancy services and the supply of computer hardware, software and associated products.\n  Continue reading\n  When free and open source actually means £6k-£8k per package: Atos&#39;s £136m contract with NHS England\n  &#39;All software must be safely and securely deployed within guidelines provided to us,&#39; says outsourcer\n     French outsourcer Atos has been charging NHS England between £6,000 and £8,000 for packing up popular free and open-source software requested by workers in the non-departmental government body.\n  According to documents seen by  The Register, data workers in NHS England have to request FOSS packages via their line management. These are fulfilled by outsourcer Atos, as part of  its £136m agreement with the Department of Health and Social Care signed in June 2019.\n  Analysts within NHS England who work on strategic planning of one of the world&#39;s largest public health systems, as well as assisting with the COVID-19 response, have requested common, freely available open-source packages such as R, the statistical language, and Python, the general-purpose language.\n  Continue reading\n  The UK&#39;s financial watchdog has fired a warning shot across the bow of Binance, and ordered it to place a notice on binance.com scaring off Brit crypto fans.\n  This seems to have come about because Binance, which is ultimately based in the Cayman Islands, wanted to launch an exchange in the UK using its London-based affiliate Binance Markets Ltd. Since the start of the year, cryptocurrency firms in Britain have had to register with the nation&#39;s Financial Conduct Authority and meet its anti-money-laundering and anti-terrorism-funding requirements.\n  Binance hasn&#39;t done this yet, or as the FCA itself put it, Binance has demonstrated an &#34;imposition&#34; to the regulator&#39;s rules.\n  Continue reading\n  We hope this hotel has a nice spa because Windows sure looks like it needs some R&amp;R\n     Bork!Bork!Bork! Microsoft Windows is notable for its ability to fall over pretty much anywhere, but this is, we think, the first time it has disgraced itself over the side of a hotel.\n  &#34;The 4 star hotel is using a 2 star OS for its signage, it seems,&#34; said our reader, who spotted the borkage over the weekend, smeared up against the wall of the Mercure Bridgwater in Somerset, England.\n  Continue reading\n  A study by freshwater crustacean boffins in Florida has revealed that feeding antidepressants to crayfish can make them more outgoing and adventurous — which is more or less a definition of how antidepressants are supposed to work. On humans, at least.\n  The experiment set out to investigate how exposure to antidepressants might affect crayfish behaviour in the wild, since human pharmaceutical pollutants are an increasing factor in freshwater environments.\n  To do this, they created “20 oval-shaped recirculating artificial streams,” each of which they filled with 60 litres of chemical-free groundwater. In each artificial stream, they built a shelter at one end for the crayfish to start in, which led to two separate paths: one flavoured with fish gelatin to signal a source of food; the other populated by another crayfish to potentially provoke an aggressive response.\n  Continue reading\n  The M in M1 is for moans: How do you turn a new MacBook Pro into a desktop workhorse?\n     The M1 MacBook Pro is like that brilliant colleague who insists on microwaving fish in the office kitchenette. Good at its job, certainly, but also deeply annoying.\n  On one hand, this machine is a veritable beast. It&#39;s fast, quiet, and has the best battery life of any machine this reviewer has used. Yet it suffers from two distinct flaws. First, it is reliant on just two USB-C (in this case, Thunderbolt 4) ports for external expandability. Secondly, for whatever reason, it natively supports just one external display.\n  Fortunately, these are fairly straightforward to circumvent, provided you&#39;ve got some deep pockets. A few weeks ago, Anker sent us  its PowerExpand 5-in-1 Thunderbolt 4 dock to review. Priced at £200, it&#39;s not cheap.\n  Continue reading\n  Sponsored With the progress of clouds, organizing IT infrastructure is no harder than organizing pizza delivery.\n  According to MarketsandMarkets, by the end of 2021, cloud data centers will process over 94% of the total workload. It’s easy to explain why businesses migrate to clouds: companies like how simple it is to rent capacities and solutions from providers. However, all that is more relevant to virtual machines.\n  The situation around dedicated servers is not as simple. They are, however, still indispensable for certain tasks, and allow client’s business to get the most out of its infrastructure. Our review of bare metal servers will show their advantages, when they are indispensable and how to seamlessly integrate them into corporate IT infrastructure.\n  Continue reading\n  Hubble telescope in another tight spot: Between astrophysicists sparring over a &#39;dark matter deficient&#39; galaxy\n  One team says DF2 is 72m LY away, another disagrees – we speak to both sides\n     Never mind memory errors from radiation. Another deteriorating part of the decades-old Hubble Space Telescope has found itself in a jam. This time its camera unit is once again in the middle of a clash between scientists over whether or not the galaxy NGC 1052-DF2 contains any dark matter.\n  When DF2 was  written up in a  Nature paper in 2018, the study immediately raised eyebrows. The paper concluded the galaxy was devoid of dark matter. How could that be possible?\n  The mysterious substance is thought to be present in all galaxies, holding together glittering stars, swirls of dust and gas, and more, giving the galaxies structure and shape. Dark matter is a crucial component in theories of galactic formation, and finding a galaxy without this hidden stuff, or a very low quantity of it, breaks all the rules. DF2 was heralded as a significant oddball.\n  Continue reading\n  The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2021-06-29 22:30:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,cloud", "title": "数据的多云太复杂了 ", "title_en": "Multi-cloud for data is too complicated", "transed": 1, "url": "https://www.theregister.com/2021/05/19/multicloud_for_data_gartner/", "via": "", "real_tags": ["数据", "cloud"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1068432, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple成为2021年的第五大的PC品牌在印度，桌面的出货量，笔记本电脑，平板电脑的工作站合并到208,000个单位，根据Canaalys。 CanAlys指出，Apple的笔记本和印度片剂出货量中的高度促进是在2020年9月20日在网上商店开设的Apple。  研究公司IDC的数字也显示苹果公司的PC出货量Inindia（不包括平板电脑）在第一个Quart的年度增长335.5％，只有大约2,000个单位落后的Asustek。  印度的iPhone销售额最多，但这些数字是关于Mac和（我认为）iPad的。 在过去的20年里，苹果已经改变了很多，但有一件事保持不变：它们在有自己的商店，在线或身体上销售更多产品。 ", "note_en": "Apple became the fifth largest PC brand in India in the firstquarter of 2021, with shipments of desktops, notebooks, tabletsand workstations combined to reach 208,000 units, according todata from Canalys. Canalys pointed out that the significantincrease in Apple’s notebook and tablet shipments in India was duemainly to Apple opening its online store in September 2020.\n Research firm IDC’s figures also show Apple’s PC shipments inIndia (excluding tablets) grew 335.5% on year in the first quarterand only lagged Asustek’s by around 2,000 units.\n iPhone sales in India are up to, but these numbers are about the Mac and (I think) iPads. A lot has changed for Apple in the last 20 years, but one thing remains unchanged: they sell more products when they have their own stores, online or physical.", "posttime": "2021-06-29 22:30:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,mac,印度", "title": "Apple Mac销量去年苹果开业后在印度三倍 ", "title_en": "Apple Mac Sales Triple in India After Apple Opened Online Store Last Year", "transed": 1, "url": "https://daringfireball.net/linked/2021/06/28/apple-india-market-share", "via": "", "real_tags": ["苹果", "apple", "mac", "印度"]}, {"category": "", "categoryclass": "", "imagename": "2551b8de893dece59fa9e9a88f61e5fe.png", "infoid": 1068431, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Andy Weir的“Martian”及其电影适应所针对的Ridley Scott，仍然是我最喜欢的一些科幻作品。回到我写了技术评论的那一天。我上次阅读了2015年的这本书（直到2周前）并在2018年观看这部电影。\n 最近，我一直详细探讨星舰如何改变游戏与月球探索如何，开始怀疑“火星”与基于星舰的架构看起来像什么，而不是书中使用的更昂贵且复杂的架构。\n   这本书在其架构中并不完全自我统一，但重新签约，大约25个地图集的助推器推出用于组装6人到火星的零件和用品。每次旅行需要4年，并在表面上提供30天。每次任务在5多个任务中摊销了Hermes成本，每项任务均为30亿美元，或每人每天16600万美元。这是一个保守的估计 - 第12章刘易斯说：“山姆叔叔为每秒支付了十万美元”，整个方案的工作约为260亿美元，或65亿美元。在美国宇航局目前的预算的背景下，总共是非常雄心勃勃的！\n 相比之下，基于星舰的特派团针对Martian表面进行了优化的高批量货物。随着货物费用约为1000美元/公斤，延长的船员任务甚至城市建筑成为最自然的活动，人员从O（1000美元）到O（1000美元/天）下降。这有很大的不同！\n  与火星不同，只有一个新的空间车辆，而不是五或六个。边际单位成本可能是10亿美元，而不是5亿美元。它是迅速的可重复使用，并在100点到地面提供货物。不幸的是，对于“火星”，Starship Edition，方案脆性的丧失和压倒性的系统复杂性意味着剧情不能依赖于各种Mackuffins和基于科学的博览会之间的稳定性。或者至少，不用同样的方式。\n 相反，它必须争辩在稀缺后景观中的孤独人类的熟悉历程。在某些方面，这可能能够更彻底地检查人类状况，但它也会提出绘图动机的挑战。\n  为了完整性，这是2020年代的马斯地球和地球马斯“Porkchop”情节。广泛地说，推出仅在蓝色地区建议。 \n六天进入我生命中最大的月份，它变成了噩梦。\n 我在离开夜晚的庆祝活动中加载了。火星上550天，是时候回家了。乘坐流浪者旋转到基地周围旋转，以便最后一看火星地平线，在星舰上寄宿来，将带我们回家，爬进我的铺位，然后去睡觉。\n 第二天早上我醒来并意识到我不在太空。好吧，我在太空中，从某种程度上，一切都在空间，但我仍然在一个停放在火星上的星舰。我们是否有理由推迟推出？不。\n 不，我们没有。我看着窗外，在主要拖拉的另一边看到一个黑色的斑点，另一个被另一个欧姆特星舰推出，哦，前6个小时。它没有叫醒我。\n 需要一段时间才能让1200吨燃料燃料燃料中的一个燃料，所以与此同时，我显然我显然是在一个星球上搁浅，只有5000吨的公司和300天等到下一个船员到来。\n 但那不是有趣的部分。有趣的部分是货物清单数据库已被损坏。在我当前的职位不到2英里，有几十个星舰仍然装满了鳃的一切，带来了一个不断增长的火星基地可能需要。灯泡托盘。集装箱机器人。几十名机器人机器能够基本上给出了正确指令的任何动作。\n 我可以搜索数据库并验证我有10,000天的食物供应 - 肯定足以看到我 - 但没有卸下每一个最后的星舰，我发现任何一个都会消失。只是想到所有那些孤独的三明治和羊角面包让我的肚子捏一点。 \n在这里，我是一个令人难以置信的囤积物的小龙，我不知道任何东西。  当宇航员在中心蜷缩时，摇头摇晃着咆哮的风。 他们中的所有六个现在都穿着他们的航天套装，以防他们不得不争夺MAV的紧急起飞。 Johanssen看着她的笔记本电脑，而其余的看着她。  “现在持续一百千克，”她说。 “偶然到二十五岁。”  “耶稣，我们会在奥兹结束，”Watney说。 “中止风速是什么？”  “技术上是五十千克，”马丁内斯说。 “不仅仅是倾翻的危险。”  “对不起，指挥官，”马丁内斯承认了。 “沃特尼会好的。 这是火星。 低气压密度意味着150 kph风也不是可感知的。 什么都不会提示出星舰。“  “我想我看起来很愚蠢地穿着12个月之前的飞行套装我们推出推出？” 沃特尼问道。 \n我最好在失败的通信系统上运行诊断。它肯定看起来最新的软件更新砖头。 NASA似乎不太可能将造成永久性的补丁，但随后再次谁真正了解Linux？\n 现在我面临着困境。通过违禁品的各种垃圾箱捕捉，USB驱动器寻找早期的软件形式，因此我可以手动刷新ROM，或者在简单的范围内彻底地重新攻击数千个无线电。\n 成千上万的无线电？嗯，是。蓝牙？收音机。无线上网？收音机。 GSM？收音机。 5G？收音机。 Zigbee？收音机。资产跟踪器？收音机。无线电无线电。但在这个勇敢的新世界中，我们所有的粪便互联网都有收音机内置。这是一个安全噩梦。但只有USB驱动器被禁止......\n 当然，一个2 W蜂窝变送器几乎没有能够将Live Video流回地球，但Shannon-Hartley定理表明您仍然可以通过非常嘈杂的频道传输数据。我将在某种概要中放置一个牺牲物联网，加载WSPR错误纠正软件，并开始传输状态信标。信封数学的后面建议我可以每天发送和接收几千位，当我与潜艇代码书相结合时，我可以充分地保持灯光，直到我找到备用Quarllink接收器的托盘。\n 我会使用ASCII字母表编写自己的编码系统吗？为什么我会膨胀一个26个字符的字母表已经非常冗长到256个字符？保留MMLAUT的90％的频道，以便NASA可以在没有任何歧义的情况下写出£¢〜√©％}}请！\n 当然，它是琐碎的网络所有本地无线电，所以我不必向附近的流浪者做EVA来检查我的电子邮件。 1982年是什么？\n  让我们有条不紊地思考这个。今天我很适合，随机挑选一个货物星舰，开车到它的基地，激活了外部升力，并轻轻地抬起到它的海绵体举行。除了它是如此完满，我几乎看不到，更不用说爬行，每个货舱都在不透明的白色压力套筒中包裹，以防止真空暴露。当然，每个货舱也用巨型QR码描述了描述内容的巨型码，因为我的眼睛不是像素化的，我无法解码。有用。 \n我把托盘拿到了我的流浪者的托盘上，把它带回了蹄兵进入气闸，然后突破了密封，找到...轴承。我现在有10,000个各种尺寸的轴承。零营养含量。\n 让我们做数学。我可以每天卸下4个托盘，在它过于移动之前，我的hab可能包含20。每个星舰都包含200托盘，所以......这种方法不缩放。我发现托盘的几率我可以在我死在老年期间看起来很苗条。\n 是时候思考更大的时间。这些星舰的某个地方是建造大型加压帐篷的材料容易大，足以包含所有货物。最初，我们的意思是做一些探矿，下一个船员将部署基础材料，以便这里的船员永远不会受到限制。\n  我破解了敞开的笔记本电脑，开始黑客攻击。首先，我没有理由在一个星舰身体上出现才能卸下它。显然，某些东西需要收集每个货物托盘，否则他们会堆积在基地上，但我在每个罗珀上丢弃了一些代码，使其能够与星舰货物起重机协调以同步位置并采购托盘。\n 因为这是未来，所以在相机中覆盖，我可以轻松监督并在进入过程中调整过程。我的队伍队伍已经在播出了各种各样的星际舰艇的过程中，将他们的货物驾驶到选定的位置，并将其放在地上。\n 这意味着，在我的准孤立状态下，我决定了第一个火星基地的实际建立在哪里。所以我正在挑选一个很好的观点。\n 经过一周左右的持续运营，所有5000吨的货物现在都在整齐的行中，我可以在开放式漫游者来回驾驶。 \n在我手中，当我驾驶是一种X射线荧光枪，旨在为勘探进行近表面矿物的非接触式测定，并且在这种情况下，无标记的货物包。在45分钟后开车上下行驶的一流辐照这已经被照射了冰冻的沙漠Hellscape，我终于得到了我一直在寻找的东西 - 一个强大的氟签名。\n 氟通常是一种相当反社会的小原子，但在聚合物中取代氢气制成非常紫外线和耐化学物质。我剪了包装，发现......\n Teflon炊具。好的，我在正确的轨道上，但我今天不开店。回到驾驶。\n 当我得到第二次击中时，太阳在西边。这次，我达到了污垢。增强PTFE帐篷材料。亩的东西。我把包裹叉到货物MIDDEN的中心，然后转入夜晚。\n 在我去睡觉之前，我任务是一个搬家，以适应壕沟工具并挖掘新围栏的周边。\n 第二天早上我开车回网站，发现我的路径被沟槽阻挡了。杜。我填写了一点，然后XRF枪在手中我发现墙壁锚托盘，将它们埋在沟槽中，然后将帐篷材料从中心拉出到拉链的边缘。\n 我说它很容易。除了我是一个旨在在一年或两大年度复制整个工业革命的东西的唯一行星首领。所以它只是屁股的痛苦。有时努力移动操纵杆以驾驶巨大而强大的车辆导致我迷失了我的头盔。 \n请参阅下一张发生的情况下的铆接说明步骤12-20：我的所有货物现在都在20英亩的充气围栏下。里面，温室效果开始热情令人沮丧，所以他们不再令人难以置信地冷 - 只是平定的。\n 我的陪审团操纵通胀设立了足够的压力来保护货物，所以我继续打开每个最后的托盘。这我用手做了。用链条锯。我不是野蛮人，有一千个托盘打开。但是一个虎搬机器人电锯过于金属，即使对我而言。\n 当所有人都说完成时，我基本上有世界上最悠久的最孤独，最糟糕的露天集市，大多数情况下，虽然不是完全识别的。我解开了生命支持物理厂房的寿命，让它成立，当内饰是衬衫袖子兼容时，用手重建我的货物清单。\n 我作为一个小孩在超市工作。这就像股票一样，除了在转变结束之前弥补它并不是可行的策略。\n 我花了十个星期让一切都没有包装，当我完成后，我回复了我的灯塔。美国国家航空航天局致死地将清单数据库解密密码发给我明文。它是“Cargo_manifest_123”。所以现在我知道现在一切都在现在的空星舰上。伟大的。\n 我很惊喜，这么少的人可以做得很快。很快，他们就会在没有困扰的情况下建立新的火星城市。更好。\n  Mindy Park继续仔细阅读其余的图像。哈夫完好无字，为什么不这样？外星人？ Kapoor博士无论如何都很乐意看到这一点。 \n“Kapoor博士，不是紧急的，但我注意到，自从剩下的船员离开以来，基地的活动一直在继续，是机器人团队继续？ 如果是这样，为什么他们在备份城市网站位置似乎是货物托盘？ 而巨大的形状......“  “是的，”米奇说。 “我们要从ares 3船员中留下多长时间？ 他们都认为沃特尼的死了。 这是士气的巨大流失。“  “不，你讨论过它，”米奇被打断了。 “他们认为他们失去了船员。 他们被摧毁了。“  “当他们发现他们抛弃了拐杖？” Venkat问道。 “他们会感觉更好吗？”  mitch用手指戳了桌子。 “他们应该知道。 你认为指挥官刘易斯无法处理真相吗？“  “这是一个士气的问题，”Venkat说。 “他们可以专注于回家 - ”  “我打电话，”米奇说。 “我是那个决定船员最好的人。 我说我们带他们速度。“ \nVenkat看着米奇。 “我认为我们控制了所有流向和来自爱马仕的数据？”  “他们是精英技术专家，”Mitch回答说：“他们可以建立一个VPN。 他们的浏览器流量是加密的。 这并不难。 我8岁的孩子从欧洲汇集Netflix节目。“  刘易斯：有人*咳嗽@astrojohannsen咳嗽*说她在推出之前验证了标记在他的铺旁。 看起来我们留下了他。 哎呀。 对不起@nasa。  “Venkat，我们可能有问题。 我表现出额外的100公斤意大利面，以便再次补给。“  “经典错误。 我们都完成了它。 你会相信，亚马逊Prime从火星的退货政策并不多得多。“  “几乎不！ 这不是20世纪的原始消费火箭。 目前物流实际上在API下面。 美国宇航局从未抱怨额外的里程！“  “我记得那些日子。 我们钻了一切，以节省重量，甚至是意大利面！“ \n但是，不是宇航员，当我们试图去除冗余解剖系统以节省体重时，他们总是被尖叫。“  “早上100岁的意大利面是一个很大的错误，但至少你在按大红色按钮之前没有意外地误导你的船员。”  “好点，为什么不用下一个船员送她回来？ 我会用米奇跑。 他会喜欢它。“  “是的，我认为我们可以重新安通规定，规定船员员工只能重新进入地球的大气，只要所有的生活成员都是物理存在的。”  “是的。 我很欣赏牺牲，但你可以想象美国宇航局会在没有能力达到一年的轨道上没有能力开始营业的火星运动吗？ 包括奇怪的意大利面食？“  “我认为他们想参加，但他们必须牺牲他们的探索。”  “为什么？ 美国宇航局，俄罗斯，esa，jaxa，地狱，即使是澳大利亚空间机构也可以为他们推出它。 下一个星舰在他们的方向上飞行？“ \n“目前的政策是每个发射窗口每周星际的一个星舰，因此我们在明年有大约十几个机会。我们可以用铅笔吗？“\n     我手上有一段时间。好吧，这是一个施工的方式。现在NASA的通信系统备份，他们不会停止推动每个人都可以让他们的手来做东西。你知道发现你的流浪者在半夜开车的烦人有多烦人，并坚持认为它不能在一些模糊的生产线上扭动13,000个螺栓？\n 你能相信失败者的无线电证明是如何成为的？罗弗天线在手中，我把火星赶到了我的成长基地，让我的思绪徘徊。\n 所以我在这里。过度溢出的燃料厂，一堆机器人机器人工厂，一个小装饰湖，尚未用鱼储存，几十个空的星舰在一天内留在骨头上被报废。\n 每个腿都有8条折叠裙子，可以调整位置，以确保在接地上稳定的着陆。我发现相关的加速度计并不像它的那样闪电，并且设计并设计了狡猾的计划。\n 站在星舰的航班甲板上，我激活着陆模式，把加速度计放在手上，打开一些甜蜜的节拍，并开始摆动围绕着小的传感器。\n 星舰电脑认为地面正在做一些非常有趣的事情，然后移动腿来补偿。慢慢地，慢慢地，整个宇宙飞船开始在景观中洗牌。在节拍之前，我已经到了发射垫的一半。 \n一旦我倾倒了燃料厂坦克进入星舰，爬上船上，然后按下大红色按钮。坐在9.5 km / s的调度delta-v，我要去哪儿？\n 8分钟后，我是一个漂亮的极地低火星轨道。在此之后，它是在Kerbal空间计划中的锻炼。我提升了，改变了飞机，气球回到，轨道的Phobos，降落了几天，走来走去，飞到缺少，同样的交易，然后回到LMO。我仍然有足够的燃料，几乎燃起回到地球，但发射窗口不太正确。所以我抛弃了几百吨的道具并重新进入，落在发射台上。我从裙子箱上安全劫持的流动站，然后赶回镇上。\n  很快就有，下一个窗口打开了，下一个货物从上面开始下雨。我开车去了附近的山丘，所以我可以在午餐时间之前每天早上批量观看他们的6或7批次。很快，尘土飞扬的旧骨院加入了几十多个星舰，这次是他们的表现完好无损。 ", "note_en": "“The Martian” by Andy Weir, and its  film adaptation directed by Ridley Scott, remain some of my all time favorite science fiction works. Way back in the day  I wrote a technical commentary. I last read the book in 2015 (until 2 weeks ago) and watched the film in 2018.\n More recently I’ve been exploring in detail how  Starship changes the game with Lunar exploration and began to wonder what “The Martian” would look like with a Starship-based architecture, rather than the rather more expensive and complex architecture used in the book.\n   The book is not entirely self-consistent in its architecture, but to recap, about 25 launches of an Atlas V-like booster are used to assemble the parts and supplies for a 6 person trip to Mars. Each trip takes 4 years and provides a 30 day stay on the surface. Amortizing the Hermes cost over 5 missions, each mission works out to be about $30b, or $166m per person per day on Mars. This is a conservative estimate – in Chapter 12 Lewis says “Uncle Sam paid a hundred thousand dollars for every second we’ll be here” which works out to be about $260b for the whole program, or $65b/year. Either total is quite ambitious in the context of NASA’s current budget!\n In contrast, a Starship-based mission is optimized for high volume cargo delivery to the Martian surface. With cargo costs around $1000/kg, extended crewed missions and even city building become the most natural activity, and personnel costs drop from O($1000/s) to O($1000/day). This makes a big difference!\n  Unlike the Martian, there is only one new space vehicle, instead of five or six. The marginal unit cost is perhaps $10m, instead of $5b. It’s rapidly reusable, and delivers cargo in 100 T lots to the surface. Unfortunately for “The Martian”, Starship edition, the loss of programmatic brittleness and overwhelming system complexity means that the plot can’t rely on steadily ricocheting between various  MacGuffins and science-based exposition. Or at least, not in the same way.\n Instead, it has to contend with the somewhat less familiar trope of a lonely human in a post-scarcity landscape. In some ways, this may enable a more thorough examination of the human condition but it also presents challenges for plot motivation.\n  For completeness, here’s the Mars-Earth and Earth-Mars  “porkchop” plot for the 2020s. Broadly speaking, launches are only advisable in the blue regions.\n      Six days into what should be the greatest month of my life, and it’s turned into a nightmare.\n I got loaded up at the departure night celebration. 550 days on Mars, time to head home. Took the rover for a spin around the base to get one last look at the Martian horizon, homed in on the Starship that will take us home, crawled into my bunk, and went to sleep.\n Next morning I woke up and realize that I’m not in space. Well, I am in space, in the sense that everything is in space somewhere, but I’m still in a Starship that’s parked on Mars. Did we delay our launch for some reason? No.\n No we didn’t. I looked out the window and on the other side of the main drag saw a blackened spot where the other ERV Starship launched, oh, 6 hours before. It didn’t wake me.\n It takes a while to make the 1200 T of fuel needed to fuel up one of these bad boys and fly home, so in the meantime I’m apparently stranded here on a planet with nothing but 5000 T of cargo for company and a 300 day wait until the next crew arrives.\n But that’s not the funny part. The funny part is that the cargo manifest database has been corrupted. Within 2 miles of my current position there are a few dozen Starships still loaded to the gills with everything a growing Mars base could possibly need. Pallets of light bulbs. Container loads of robots. Several dozen robotic machines capable of basically any action given the right instructions.\n I can search the database and verify that I have something like 10,000 days of food supply – surely enough to see me out – but without unloading every last Starship my odds of finding any of it is vanishingly small. Just the thought of all those lonely sandwiches and croissants made my stomach pinch a little.\n Here I am, a tiny dragon on an unbelievable hoard, and I don’t know where anything is.\n  The Hab shook in the roaring wind as the astronauts huddled in the center. All six of them now wore their flight space suits, in case they had to scramble for an emergency takeoff in the MAV. Johanssen watched her laptop while the rest watched her.\n “Sustained winds over one hundred kph now,” she said. “Gusting to one twenty-five.”\n “Jesus, we’re gonna end up in Oz,” Watney said. “What’s the abort wind speed?”\n “Technically one fifty kph,” Martinez said. “Any more than that and the Starship’s in danger of tipping.”\n  “Sorry, commander,” Martinez conceded. “It’s going to be okay, Watney. This is Mars. The low atmospheric density means that 150 kph wind is barely perceptible. Nothing is going to tip the Starship.”\n “I guess I look pretty silly wearing a flight suit 12 months before we’re due to launch?” Watney asked.\n    I’d better run diagnostics on the failed communications system. It sure looks like that latest software update bricked it. Seems unlikely that NASA would ship a patch that broke stuff permanently, but then again, who really understands Linux these days anyway?\n Now I’m faced with a dilemma. Hunt through various bins of contraband USB drives looking for an earlier form of the software so I can manually reflash the ROM, or hack literally any of the thousands of radios within easy reach.\n Thousands of radios? Well, yes. Bluetooth? Radio. Wifi? Radio. GSM? Radio. 5G? Radio. Zigbee? Radio. Asset trackers? Radio. Radio radio radio. But in this brave new world of ours, all our Internet of Shit devices come with radios built in. It’s a security nightmare. But only the USB drives are forbidden…\n Of course, a 2 W cellular transmitter is hardly capable of streaming live video all the way back to Earth, but the  Shannon-Hartley theorem shows you can still transmit data over a very noisy channel. I’ll put a sacrificial IoT radio in some kind of cantenna, load up the WSPR error correcting software, and start transmitting a status beacon. Back of the envelope math suggests I can send and receive a few thousand bits a day, which when combined with a submarine code book I have handy will be adequate to keep the lights on until I can locate that pallet of spare Starlink receivers.\n Would I write my own coding system using the ASCII alphabet? Why would I inflate a 26 character alphabet that’s already pretty redundant to 256 characters? To reserve 90% of my channel for umlauts so that NASA can write £¢~√°©%}} without any ambiguity? Please!\n And of course it’s trivially easy to network all the local radios, so I don’t have to do an EVA to a nearby rover to check my email. What is this, 1982?\n  Let’s think about this methodically. Today I suited up, picked a cargo Starship at random, drove to its base, activated the external lift, and was gently lifted up into its cavernous cargo hold. Except that it was so full I could barely see in, let alone climb around, and every cargo pallet was wrapped in an opaque white pressure sleeve to prevent vacuum exposure. Naturally, every cargo pallet was also annotated with a giant QR code describing the contents, which I am unable to decode because my eyes are not pixelated. Useful.\n I unloaded a pallet onto the tray of my rover, drove it back to the Hab and into the airlock, then broke through the seal to find … bearings. I now have 10,000 bearings of various sizes. And zero nutritional content.\n Let’s do the math. I can unload 4 pallets a day, and my Hab can contain perhaps 20 before it is too full to move. Each Starship contains 200 pallets, so… this approach does not scale. My odds of finding a pallet I can metabolize before I die of old age are looking pretty slim.\n Time to think bigger. Somewhere in those Starships are the materials to build a large pressurized tent easily big enough to contain all the cargo. Originally, we were meant to do some prospecting and the next crew would deploy the base materials, so that the crew up here was never material constrained.\n  I cracked open my laptop and started hacking. First, there’s no reason I have to physically be present at a Starship to unload it. Obviously something needs to collect each pallet of cargo or else they’ll pile up at the base, but I dropped some code on each rover enabling it to coordinate with the Starship cargo crane to synchronize position and procure a pallet.\n Because it’s the future, everything is covered in cameras and I can easily oversee and tweak the process as it goes along. My fleet of rovers is already in the process of ransacking every Starship in sight, driving their cargo to a selected location, and dropping it on the ground.\n Which means that, in my quasi-isolated state, I’m deciding where the first Mars base is actually going to be built. So I’m picking the spot with a good view.\n After a week or so of continuous operations, all 5000 T of cargo is now knolled in neat rows where I can drive back and forth on the open rover.\n In my hand as I drive is an X-Ray Fluorescence gun, designed to perform contactless assays of near-surface minerals for prospecting, and, in this case, unmarked cargo bales. After 45 minutes of driving up and down the rows mindlessly irradiating this already irradiated frozen desert hellscape, I finally got what I’d been looking for – a strong fluorine signature.\n Fluorine is ordinarily a rather antisocial little atom but substituting for hydrogen in polymers makes a very UV and chemical resistant substance. I cut through the packaging and found …\n Teflon cookware. Okay, I’m on the right track, but I’m not opening a shop today. Back to driving.\n The sun was setting in the west when I got my second hit. This time, I hit pay dirt. Reinforced PTFE tent material. Acres of the stuff. I forked the package to the center of the cargo midden and turned in for the night.\n Before I went to sleep I tasked a rover to fit the entrenching tool and excavate the perimeter of the new enclosure.\n Next morning I drove back to the site and found my path blocked by a trench. Duh. I filled in a bit, then XRF gun in hand I found the wall anchor pallets, buried them in the trench, then pulled the tent materials out from the center to the edges where it zipped together.\n I’m making it sound easy. It would be impossible, except I’m the sole planetary heir to a boatload of stuff intended to replicate the entire industrial revolution in a year or two. So it was merely a pain in the ass. At times the effort of moving a joystick to drive the enormous and powerful vehicles around caused me to mist up my helmet.\n See instruction manual steps 12-20 for a riveting account of what happened next: All my cargo was now under a 20 acre inflatable enclosure. Inside, the greenhouse effect began to warm things up a bit so they were no longer incredibly cold – merely ordinarily cold.\n My jury rigged inflation set up provided enough pressure to protect the cargo so I proceeded to open every last pallet. This I did by hand. With a chain saw. I’m not a barbarian, and there are like a thousand pallets to open. But a rover-mounted robot chainsaw is too metal, even for me.\n When all was said and done, I basically had the world’s loneliest and most poorly organized open-air bazaar full of stuff that was mostly, though not entirely, recognizable by sight. I unpacked the life support physical plant gear, got it set up, and when the interior was shirt sleeves compatible, rebuilt my cargo manifest by hand.\n I worked in a supermarket as a kid. This was like a stock take, except that making it up before the shift ended wasn’t a viable strategy anymore.\n I had spent ten weeks getting everything unpacked and when I was done, I got a reply to my beacon. NASA thoughtfully sent me the manifest database decryption passcode in plaintext. It was “cargo_manifest_123”. So now I know where everything was on the now empty Starships. Great.\n I was pleasantly surprised that so much could be done so quickly with so few people. Soon they’ll be building new Mars cities without bothering to send any astronauts at all. Even better.\n  Mindy Park moved on to perusing the rest of the image. The Hab was intact of course, why wouldn’t it be? Aliens? Dr. Kapoor would be happy to see that anyway.\n    “Dr Kapoor, not urgent but I noticed that activity at the base has been continuing since the crew left, are the robotics teams proceeding? If so, why are they siting what seem to be cargo pallets in the backup city site location? And in the shape of a giant …”\n   “Yeah,” Mitch said. “How long are we gonna keep this from the Ares 3 crew? They all think Watney’s dead. It’s a huge drain on morale.”\n   “No, you discussed it,” Mitch interrupted. “They think they lost a crewmate. They’re devastated.”\n “And when they find out they abandoned a crewmate?” Venkat asked. “Will they feel better then?”\n Mitch poked the table with his finger. “They deserve to know. You think Commander Lewis can’t handle the truth?”\n “It’s a matter of morale,” Venkat said. “They can concentrate on getting home—”\n “I make that call,” Mitch said. “I’m the one who decides what’s best for the crew. And I say we bring them up to speed.”\n    Venkat looked at Mitch. “I thought we controlled all the data flowing to and from the  Hermes?”\n “They’re elite technical experts,” Mitch replied, “They can set up a VPN. Their browser traffic is encrypted. It’s not hard. My 8 year old does it to stream Netflix shows from Europe.”\n     Lewis: Someone *cough @AstroJohannsen cough* said she verified Mark was in his bunk before we launched. Looks like we left him behind. Whoops. Sorry @NASA.\n   “Venkat, we may have a problem. I manifested an additional 100 kg of pasta for the early resupply.”\n     “Classic error. We’ve all done it. And would you believe, Amazon Prime’s return policy from Mars isn’t much good.”\n  “Hardly! This isn’t the 1900s with their primitive expendable rockets. Logistics is practically below the API nowadays. And NASA never complains about getting the extra miles!”\n “I remember those days. We drilled holes in everything to save weight, even the spaghetti!”\n “Not the astronauts, though, they always squealed when we tried to remove redundant anatomical systems to save weight.”\n “Well 100 T of pasta is a big mistake, but at least you didn’t accidentally miscount your crew before pressing the big red button.”\n   “Good point, why not send her back out with the next crew? I’ll run it by Mitch. He’ll love it.”\n    “Yes, I think we can retcon a regulation stipulating that crew members may only re-enter Earth’s atmosphere provided all living members are physically present.”\n   “Yes. I appreciate the sacrifice but can you imagine NASA would have ever begun a crewed Mars campaign without the ability to lift a million tonnes a year to orbit? Including oddly large orders of pasta?”\n “I think they want to participate, but they would have to sacrifice their probe.”\n “Why? NASA, Russia, ESA, JAXA, hell, even the Australian Space Agency could launch it for them. When is the next Starship flight in their direction?”\n “Current policy is no fewer than one Starship per planet per launch window, so we have half a dozen opportunities in the next year. Can we pencil them in?”\n     I’ve had some time on my hands. Well, that’s one way of putting it. Now that NASA’s communications system is back up, they won’t stop driving every robot they can get their hands on to do stuff. Do you know how annoying it is to find your rover drove off in the middle of the night and insists it can’t return until it’s torqued 13,000 bolts on some obscure production line?\n Can you believe how failure prone that rover’s radio turned out to be? Rover antenna in hand, I drove my Mars car around my growing base and allowed my mind to wander.\n So here I am. An overproductive fuel plant, a bunch of robotic robot factories, a small decorative lake that is yet to be stocked with fish, and a few dozen empty Starships waiting in a bone yard to be scrapped for parts some day.\n Each has 8 little legs that fold out under the skirt and can adjust position to ensure stable landings on uneven ground. I found that the relevant accelerometer was not as well bolted down as it should be, and devised a cunning plan.\n Standing on the Starship’s flight deck, I activating landing mode, put the accelerometer in my hand, turned on some sweet beats, and started wiggling that little sensor around.\n The Starship computer thought the ground was doing something very funny and moved the legs to compensate. And slowly, slowly, the entire spaceship began to shuffle across the landscape. I was halfway to the launching pad before the beat even dropped.\n Once there I dumped the fuel plant tanks into the Starship, climbed aboard, and pressed the big red button. Sitting atop 9.5 km/s of dispatchable delta-V, where was I going to go?\n 8 minutes later I was in a nice polar Low Mars Orbit. After this it was an exercise in Kerbal Space Program. I boosted out, changed planes, aerobraked back in, orbited Phobos, landed for a couple of days, walked around, flew to Deimos, same deal, then went back to LMO. I still had enough fuel practically to fly back to Earth but the launch window wasn’t quite right. So I dumped a few hundred tons of prop and re-entered, landing back on the launch pad. I unstowed my safely hijacked rover from the skirt cargo bin and drove back into town.\n  Soon enough the next window opened up and the next lot of cargo began to rain down from above. I drove out to a nearby hill so I could watch them come in in batches of 6 or 7, every morning just before lunch time. Soon the dusty old bone yard was joined by a few dozen more Starships, this time with their manifests intact.", "posttime": "2021-06-29 22:29:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火星,martian,星舰", "title": "“火星”+星舰 ", "title_en": "“The Martian” + Starship", "transed": 1, "url": "https://caseyhandmer.wordpress.com/2021/04/09/the-martian-starship/", "via": "", "real_tags": ["火星", "martian", "星舰"]}, {"category": "", "categoryclass": "", "imagename": "737a1cb5374b38efa654668d82b1416d.png", "infoid": 1068430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哦，看，疯狂的Microsoft Build出现了！今年的Microsoft Build是，你知道，再次全部虚拟。作为对.NET和WSL开发更感兴趣的人，我发现整个会议中提到了没有大量的Windows开发令人失望。它让我让我想念2019年。虽然我仍然没有从我的师父的学习中恢复过来，但我的笔记本电脑在建造会议期间死亡;我只能提供今年的构建的简单摘要。好吧，我认为让我们潜入。\n   为了我的失望，这构建中没有太多新的。此构建通常缩写了我们到目前为止的所有内容，例如WSLG和“WSL  -  Install`。我注意到的唯一新的事情是使用WSLG使用WSL中的WSL中​​使用浏览器进行调试的能力。\n   关于.NET的会话包装有信息，尽管有几个关于它的会话数。 .NET升级助手（帮助将.NET项目升级到最新版本）是我将我的旧项目迁移到更新版本，而且.NET 6与其单堆叠（只有一个SDK，BCL，Toolchain）平台）结构使它看起来非常有前途。以下是从会话中快速总结： ", "note_en": "Oh, look, a wild Microsoft Build appeared! The Microsoft Build this year was, you know, all virtual again. As a person who is more interested in .NET and WSL development, I find it disappointing that not much of Windows development is mentioned in the entire conference. It made me miss  Build 2019. While I am still not recovered from my master’s study, my laptop died right during the Build conference; I can only provide a straightforward summary of this year’s Build. Well, I think let’s dive in.\n   To my disappointment, there is not much new in this build. This build generally recapped everything we have so far, such as WSLg and ``wsl --install`. The only new thing I noticed is Visual Studio’s ability to debug using the browser in WSL using WSLg.\n   The sessions about .NET is packed with information, although there is nearly 1-digit number of sessions about it. .NET Upgrade Assistant (Help upgrade .NET project to latest version) would be possibly a great tool for me to migrate my old projects to newer version, and .NET 6 with its Single stack (only one SDK, BCL, Toolchain for cross-platform) structure made it looks really promising. Here is a quick sum up from the  session:", "posttime": "2021-06-29 22:29:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,wsl", "title": "Microsoft Build 2021：我的小小的摘要 ", "title_en": "Microsoft Build 2021: My Tiny Little Summary", "transed": 1, "url": "https://patrickwu.space/2021/06/03/build-2021/", "via": "", "real_tags": ["microsoft", "wsl"]}]