[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1069611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ncdu (NCurses Disk Usage) 是一个基于终端的磁盘使用分析器，用于 Linux 和其他 POSIX-y 系统，（以前）用 C 编写，在大多数发行版的包存储库中可用。在过去的几个月里，我一直致力于完全重写 ncdu，并且刚刚发布了 2.0-beta1。 Ncdu 2 是 ncdu 1.x 的完全替代品，保留了所有相同的功能、相同的 UI、键绑定和命令行标志，所有这些都使其成为合适的替代品。毕竟，没有什么比每次决定更新时都必须重新熟悉已安装的每个软件更烦人的了。当然，如果新版本至少没有改进某些东西，那么重写 ncdu 就没有任何意义。这次改写，其实是我苦恼了很久的ncdu 1.x的几个主要缺点的结果： 一直有点内存占用。这部分是它所做的工作所固有的：分析完整的目录树并使其可顺利浏览需要跟踪该树中的每个节点，并且大型目录包含数百万个文件......是的，这需要一些内存。当然，我已经实现了所有容易实现的成果，以确保 ncdu 的内存不会过于低效，但肯定还有改进的空间。 Ncdu 1.x 不能非常有效地处理硬链接计数，并且在某些（幸运的是很少见）情况下会陷入 O(n²) 循环。在不增加内存使用的情况下修复这个问题特别麻烦。另一个与硬链接相关的问题：硬链接在目录的累积大小中只计算一次，这与大多数其他支持硬链接的磁盘使用分析器所做的一致。这很有用，因为通过硬链接“复制”的文件只在磁盘上真正出现一次，文件的数据实际上并没有被复制。但与此同时，此功能可能会产生误导：删除目录不一定会回收 ncdu 指示的磁盘空间，因为该目录外的硬链接可能指向相同的文件数据，因此数据保留在磁盘上。关于如何更好地呈现此类场景，我有一个好主意，但我始终无法实现有效的实现。上述问题在 ncdu 1.x 的数据模型中都不容易解决，甚至不可能解决，因此需要对核心数据模型进行重大更改。由于 ncdu 的每个方面——UI 和所有算法——都与数据模型密切相关，这实际上归结为完全重写。正是在穿越当地森林的徒步旅行中，我终于找到了一个解决所有三个问题的有希望的解决方案。\n抱歉。我很想尝试我的“有希望的解决方案”，而 C 并不是那种使快速原型设计变得非常容易或令人愉快的语言。所以我最终使用 Zig 进行原型设计，它最终不仅仅是一个原型。 Zig 是一种优秀的编程语言，非常适合像 ncdu 这样的小工具，但它目前有一个主要缺陷：它甚至还没有接近稳定。该语言、标准库和编译器都没有稳定版本，而且每个新版本都存在左右重大缺陷。它也有相当多的（已知的）错误和它的可移植性故事，虽然该语言所处的阶段令人印象深刻，但还没有与 C 相提并论。该语言看起来非常有前途，我毫不怀疑 Zig 最终会达到稳定性和可移植性水平使其成为 ncdu 的良好目标。但是，从局外人的角度来看，这可能还需要几年时间。没关系，毕竟每种语言都需要时间来成熟。但这对 ncdu 意味着什么？对于普通用户来说，可能没有那么多。我像往常一样为 Linux 提供静态二进制文件，因此您可以像往常一样获取这些文件并运行花哨的新 ncdu。如果你想从源代码编译，你只需要获取正确的 Zig 版本并运行 zig build。假设您没有遇到错误，也就是说，在大多数情况下，事情往往开箱即用。对于发行版来说，Zig 的情况更成问题，主要是因为 ncdu 的版本现在与 Zig 的版本紧密相关，这反过来意味着发行版无法相互独立地升级这些包。如果他们打包 Zig 8.0，那么他们可能还需要打包一个可以使用 Zig 8.0 编译的 ncdu 版本。如果他们想升级到更新版本的 Zig，他们可能无法在不等待我发布适用于该特定 Zig 的新版本或维护他们自己的 ncdu 本地补丁的情况下这样做。另一种选择是发行版必须同时支持多个版本的 Zig，但很少有人有时间和基础设施来做到这一点。任何一种解决方案都是混乱的，为此我深表歉意。综上所述，只要有人用，我就会继续维护ncdu的C版。维护几乎意味着我过去几年一直在做的事情：在开发方面不是特别活跃，只是偶尔的改进和修复。我还可能将未来 2.x 版本中的一些新增内容向后移植回 C 版本，特别是关于可见界面（CLI 标志、键绑定、UI 等），以抑制在碰巧有的系统之间切换时出现的不可避免的痛苦安装了不同的版本，但在 1.x 代码库中实现起来似乎很麻烦的功能可能仍然是 Zig 版本独有的。只要 Zig 还没有稳定版本，我将尝试使 ncdu 2.x 与大多数发行版都有软件包的 Zig 版本保持最新，这实际上通常意味着最新的标记版本。从好的方面来说，ncdu 2.0 只需要 Zig 编译器（加上它附带的标准库）和 ncurses。没有其他外部依赖项，也没有那些困扰用其他花哨的新语言编写的项目的销售、捆绑和疯狂的包管理东西。 1 Ncdu 2 在普通场景中使用不到一半的内存，但如果有很多硬链接，在某些情况下可能会使用更多的内存。与几个真实世界的目录进行快速比较：\n我必须在这里声明一个免责声明，我的桌面根文件系统和我的备份都发挥了 ncdu 2.0 的优势：每个目录的文件数量相对较多，平均约 10 个字节，文件名相当短。尽管如此，如果您的目录树遵循不同的发行版，您仍然应该看到显着的改进。这里最大的例外是当你有很多硬链接时。我上面测试的“许多硬链接”目录代表了大约 43k 文件的基于硬链接的增量备份，“复制”了 30 次。当您查看表示树中的每个节点需要多少字节时，内存使用方面的这些差异的原因就很清楚了：（这些数字假定为 64 位指针，不包括文件名的存储以及内存分配和哈希表的开销。扩展模式 (-e) 在两个版本中每个节点使用额外的 18 个字节，并且两个版本对文件名使用相同的内存分配策略。）虽然在硬链接情况下有改进的空间，但 ncdu 1 中的性能问题如果不增加内存，我之前提到的 .x 就无法真正修复。我一直对接受完全禁用硬链接检测的选项持谨慎态度，因为结果可能不是很有用，但也许我会在未来的版本中重新考虑这一点。由于内存不足而根本无法分析的目录也不是很有用。另一个值得一提的区别是：当从浏览器中刷新目录时，ncdu 1.x 将为新树分配一个新结构，然后在扫描完成后释放旧结构。如果刷新最顶层目录，这可能会导致 ncdu 1.x 临时使用两倍的内存。 Ncdu 2.0 而是对现有的内存树进行就地更新，从而避免了这种重复。另一方面，ncdu 2.0（当前）无法重用已重命名或删除的树节点，因此频繁刷新具有许多重命名或删除的目录会随着时间的推移增加内存使用。我不认为这是一个很常见的情况，但如果它成为一个问题，它可以被修复。正如我在介绍中提到的，计算硬链接可能会非常混乱，因为它们会导致数据在目录之间共享。因此，与其尝试将目录的累积大小显示为单个数字，不如用单独的列来更好地表示这些情况。这是 ncdu 2.0 中的样子：据我所知，没有其他磁盘使用分析器具有此功能（但如果我错了，请纠正我！）\n目前，您可以通过按“u”在两个视图之间切换。但是，如果我继续为每个新功能分配密钥，我可能很快就会用完可用的密钥，所以也许我会在稳定的 2.0 版本之前收回该密钥，并改为实施快速配置菜单。此功能确实带有一个很大的免责声明：如果特定文件的链接计数在扫描期间发生更改，或者目录刷新或删除导致缓存链接计数发生更改，则显示的共享/唯一大小将不正确。发生这种情况时获得正确大小的唯一方法是退出 ncdu 并开始新的扫描，从浏览器刷新不会修复它。当发生这种情况时，目前没有任何指示或警告，需要在我进行稳定版本之前修复。作为重写的一部分，ncdu 2 中还有许多其他变化。有些变化是好的，有些则可能不太好。改进了对 Unicode 文件名的处理。它仍然不处理 Unicode 组合标记，但至少它现在可以识别全角字符，并且不会在 UTF-8 序列的中间截断文件名。由于缓存 statfs() 调用的结果，提高了使用 --exclude-kernfs 时的性能。我尝试对其进行测量，但最多只注意到了大约 2% 的改进，但确实如此。在硬链接信息窗口的“链接”选项卡中，现在可以直接跳转到所选路径。文件浏览器现在可以更好地记住切换目录时所选项目在屏幕上的位置。\nNcdu 2.0 不再适用于非 UTF-8 语言环境，但我认为现在这不会成为问题。它仍然可以很好地处理非 UTF-8 文件名，但是这些将在输出之前被转义，而不是像 ncdu 1.x 那样直接抛出到您的终端。项目信息窗口组织略有不同。只是一点点，我保证。 Ncdu 2 现在使用 openat() 系列系统调用来扫描目录。这通常是对 ncdu 1.x 的 chdir() 和 opendir() 方法的改进，但确实需要更多的文件描述符（大问题）并且对古代系统的可移植性较差（Zig 甚至可以在这些系统上工作？）。在硬链接的信息窗口中打开“链接”选项卡现在需要扫描内存树，因此速度明显变慢。然而，令我惊讶的是，在我的系统上完全扫描具有 30 多万个文件的树只需要不到一秒钟的时间，因此实际上这可能不会成为问题（无论如何谁使用了“链接”选项卡？）。刷新或删除目录时，浏览器 UI 不再可见。问题是浏览器会缓存有关打开目录的信息，并且在运行刷新/删除时该缓存可能会失效。这也是 ncdu 1.x 中的一个问题，但不那么明显。有人要求在 ncdu 仍在扫描时允许交互式浏览，所以如果我有时间实现它，这不会成为问题，但这对我来说并不是什么优先事项。在每次 UI 绘制时更新浏览器的缓存成本太高，所以我还不确定如何处理。给自己拿一个 ncdu-2.0-beta1 并进行测试！源代码可在存储库的“zig”分支中找到。我的首要任务是让 2.0 为“稳定”版本做好准备，这意味着它需要在野外进行一些严肃的测试，以评估它的工作情况并充实不可避免的错误。我仍然有点不清楚，当它所建立的基础本质上不稳定时，发布稳定版本是否有意义，但让我们看看事情的进展。\n从更长远的角度来看，对 Zig 的重写为更多我一直想看到的功能开辟了可能性，但这在 1.x 中实现起来似乎很棘手。多线程扫描。这对于老式的旋转硬盘驱动器是无用的，但是对于 SSD，尤其是 NVMe，通过跨多个线程分配工作可以大大提高扫描性能。在重写代码时，我想出了一个关于如何实现这一点的有前途的想法，所以我很乐意在未来的版本中进行试验（io_uring 也是一个有趣的目标，但可能更复杂）。更快的 --exclude-pattern 匹配。老实说，这个功能目前在两个版本中都太慢了，我很惊讶没有人抱怨过它（无论如何对我来说不是）。只需要几个模式就可以将 ncdu 的扫描性能降低到爬行，更聪明的匹配实现可以提供重大改进。将内存树导出到文件。 Ncdu 已经有导出/导入选项，但导出需要一个单独的命令调用 - 当前无法在目录浏览器中编写导出。新的数据模型可以支持此功能，但我仍然不确定如何在 UI 中使用它。透明导出压缩。导出函数转储未压缩的 JSON 数据，旨在通过 gzip 或类似命令进行管道传输。虽然这在手册页中有记录，但我仍然看到很多人将导出写入磁盘而没有任何压缩。这是一个相当大的空间浪费，所以如果 ncdu 可以通过外部（解）压缩工具透明地运行导出的数据以使其更容易和更容易发现，那就太好了。这些功能是我过去十年来一直致力于进行的一长串其他可能改进的补充，所以不要期望太多。 :) 这并不是说 Zig 不受使用数百个微小依赖项的项目问题的影响，但是在当前状态下，这种开发风格并没有受到强烈鼓励：标准库已经涵盖了很多领域，包管理解决方案仍然存在正在开发中，使用现有的 C 库很容易。 ↩\n我绝对希望像这样的目录级报告可用于其他形式的数据共享，例如 reflinks 或 btrfs/ZFS 快照。但是，唉，我怀疑我是否能够在 ncdu 中实现它。即使我能以某种方式抓取和解开底层数据，跟踪大型文件系统中的每个块无疑在 CPU 和内存方面都会非常昂贵。前段时间我确实写了一个小工具来为启用配额的 btrfs 子卷生成此类报告，但后来我最终禁用了配额功能，因为即使这样也非常昂贵。还有 btdu，它采用一种非常有趣的方法来分析 btrfs 文件系统。 ↩", "note_en": "Ncdu (NCurses Disk Usage) is a terminal-based disk usage analyzer for Linux and other POSIX-y systems, (formerly) written in C and available in the package repositories of most distributions.\n Over the past months I have been working on a complete rewrite of ncdu and just released 2.0-beta1. Ncdu 2 is a full replacement of ncdu 1.x, keeping all the same features, the same UI, keybindings and command-line flags, all to make it a proper drop-in replacement. There is, after all, nothing more annoying than having to get re-acquainted with every piece of software you&#39;ve installed every time you decide to update.\n  Of course, there wouldn&#39;t really be a point in rewriting ncdu if the new version doesn&#39;t improve at least  something. This rewrite is, in fact, the result of me agonizing for a long time about several major shortcoming of ncdu 1.x:\n It has always been a bit of a memory hog. Part of this is inherent to what it does: analyzing a full directory tree and making it smoothly browsable requires keeping track of every node in that tree, and with large directories containing millions of files... yeah, that&#39;ll require some memory. I had, of course, already implemented all the low-hanging fruit to ensure that ncdu wasn&#39;t  overly inefficient with memory, but there was certainly room for improvements.\n Ncdu 1.x does not handle hard link counting very efficiently and can in some (fortunately rare) cases  get stuck in an  O(n²) loop. This one is particularly nasty to fix without increasing memory use.\n Another hard link-related problem: hard links are counted only once in a directory&#39;s cumulative size, as is consistent with what most other hard link-supporting disk usage analyzers do. This is useful, since a file that has been &#34;duplicated&#34; by means of hard links only really occurs on disk once, the file&#39;s data is not actually duplicated. But at the same time this feature can be misleading: deleting a directory does not necessarily reclaim as much disk space as was indicated by ncdu, since it&#39;s possible for hard links  outside of that directory to point to the same file data, and hence for that data to remain on disk. I&#39;ve had a good idea on how to better present such scenarios, but an efficient implementation always eluded me.\n None of the above issues are easy, or even possible, to solve within the data model of ncdu 1.x, so major changes to the core data model were necessary. Since each and every aspect of ncdu - both the UI and all algorithms - are strongly tied to the data model, this effectively comes down to a full rewrite. It was during a hike through the local forests that I finally came to a promising solution that addresses all three points.\n  I&#39;m sorry. I was anxious to try out that &#34;promising solution&#34; of mine and C isn&#39;t the kind of language that makes quick prototyping very easy or pleasurable. So I ended up prototyping with  Zig instead and it ended up being more than just a prototype.\n Zig is an excellent programming language and uniquely well suited for little tools like ncdu, but it currently has a  major flaw: It&#39;s not even close to stable. There&#39;s no stable version of the language, the standard library nor of the compiler, and each new release comes with major breakage left and right. It also has a fair amount of (known) bugs and its portability story, while impressive for the stage the language is in, is not yet on par with C. The language is looking very promising and I have no doubt that Zig will eventually reach the level of stability and portability to make it a good target for ncdu. But, judging from an outsider&#39;s perspective, that&#39;s likely to take a few more years. And that&#39;s okay, after all, every language needs time to mature.\n But what does that mean for ncdu? For regular users, probably not that much. I provide static binaries for Linux as I&#39;ve always done, so you can just grab those and run the fancy new ncdu as usual. If you want to compile from source, you only need to grab the right Zig version and run  zig build. Assuming you don&#39;t run into bugs, that is, but for the most part things tend to work just fine out of the box. For distributions, the Zig situation is rather more problematic, primarily because the version of ncdu is now strongly tied to the version of Zig, which in turn means that distributions are unable to upgrade these packages independently from each other. If they package Zig 8.0, then they may also have to package a version of ncdu that can be compiled with Zig 8.0. If they want to upgrade to a newer version of Zig, they may not be able to do so without waiting for me to release a new version that works with that particular Zig, or maintain their own local patches for ncdu. The alternative is that distributions will have to support multiple versions of Zig at the same time, but few have the time and infrastructure to do that. Either solution is messy, and for that I apologize.\n Considering the above, I will continue to maintain the C version of ncdu for as long as there are people who use it.  Maintenance meaning pretty much what I&#39;ve been doing for the past few years: not particularly active in terms of development, just occasional improvements and fixes here and there. I may also backport some additions from future 2.x versions back into the C version, especially with regards to visible interfaces (CLI flags, keybindings, UI, etc), to dampen the inevitable agony that arises when switching between systems that happen to have different versions installed, but features that seem like a pain to implement in the 1.x codebase will likely remain exclusive to the Zig version.\n As long as there is no stable version of Zig yet, I will  try to keep ncdu 2.x current with the Zig version that  most distributions have packages for, which in practice generally means the latest tagged release.\n On the upside, ncdu 2.0 only requires the Zig compiler (plus the standard library that comes with it) and ncurses. There&#39;s no other external dependencies and none of that vendoring, bundling and insane package management stuff that haunts projects written in other fancy new languages.  1\n  Ncdu 2 uses less than half the memory in common scenarios, but may in some cases use  more memory if there are a lot of hard links. Quick comparison against a few real-world directories:\n  I have to put a disclaimer here that both my desktop&#39;s root filesystem and my backups play into the strengths of ncdu 2.0: relatively many files per directory and, with ~10 bytes on average, fairly short file names. Nonetheless, you should still see significant improvements if your directory tree follows a different distribution. The big exception here is when you have a lot of hard links. The &#34;many hard links&#34; directory I tested above represents a hard link-based incremental backup of ~43k files, &#34;duplicated&#34; 30 times.\n The reason for these differences in memory use are clear when you look at how many bytes are needed to represent each node in the tree:\n  (These numbers assume 64-bit pointers and exclude storage for file names and overhead from memory allocation and hash tables. Extended mode (-e) uses an extra 18 bytes per node in both versions, and both versions use the same memory allocation strategy for the file names.)\n While there is room for improvements in the hard link situation, the performance issue in ncdu 1.x that I mentioned earlier isn&#39;t really fixable without a memory increase. I&#39;ve always been cautious with accepting an option to disable hard link detection altogether as the results may not be very useful, but maybe I&#39;ll reconsider that for a future release. A directory that can&#39;t be analyzed at all because you&#39;ve ran out of memory isn&#39;t very useful, either.\n Another difference that is worth mentioning: when refreshing a directory from within the browser, ncdu 1.x will allocate a fresh structure for the new tree and then, after the scan is complete, free the old structure. This may cause ncdu 1.x to temporarily use twice as much memory if you refresh the top-most directory. Ncdu 2.0 instead does an in-place update of the existing in-memory tree and thereby avoids this duplication. On the other hand, ncdu 2.0 is (currently) unable to re-use tree nodes that have been renamed or deleted, so frequently refreshing a directory that has many renames or deletions will increase memory use over time. I don&#39;t think this is a very common scenario, but should it become a problem, it  can be fixed.\n  As I mentioned in the introduction, counting hard links can be very confusing because they cause data to be shared between directories. So rather than try and display a directory&#39;s cumulative size a single number, these cases are better represented by a separate column. Here&#39;s what that looks like in ncdu 2.0:\n     To my knowledge, no other disk usage analyzer has this feature (but please do correct me if I&#39;m wrong!)\n You can, for the time being, switch between the two views by pressing &#39;u&#39;. But if I keep assigning keys to each new feature I may be running out of available keys rather soon, so maybe I&#39;ll reclaim that key before the stable 2.0 release and implement a quick-configuration menu instead.\n This feature does come with a large disclaimer: the displayed shared/unique sizes will be incorrect if the link count for a particular file changes during a scan, or if a directory refresh or deletion causes the cached link counts to change. The only way to get correct sizes when this happens is to quit ncdu and start a new scan, refreshing from the browser isn&#39;t going to fix it. There is currently no indicator or warning when this happens, that&#39;ll need to be fixed before I do a stable release.\n  There&#39;s a bunch of other changes in ncdu 2 that came naturally as part of the rewrite. Some changes are good, others perhaps less so.\n  Improved handling of Unicode filenames. It still doesn&#39;t handle Unicode combining marks, but at least it can now recognize full-width characters and it won&#39;t cut off filenames in the middle of a UTF-8 sequence.\n Improved performance when using  --exclude-kernfs thanks to caching the result of  statfs() calls. I tried to measure it and only noticed a ~2% improvement at best, but it&#39;s something.\n In the &#39;Links&#39; tab in the info window for hard links, it is now possible to jump directly to the selected path.\n The file browser now does a better job at remembering the position of the selected item on your screen when switching directories.\n  Ncdu 2.0 doesn&#39;t work well with non-UTF-8 locales anymore, but I don&#39;t expect this to be a problem nowadays. It can still deal with non-UTF-8 filenames just fine, but these will be escaped before output rather than directly thrown at your terminal as ncdu 1.x does.\n The item information window organization is a little bit different. Just a tiny little bit, I promise.\n Ncdu 2 now uses the  openat() family of system calls to scan directories. This is generally an improvement over the  chdir() and  opendir() approach of ncdu 1.x, but does require a few more file descriptors (big deal) and is less portable to ancient systems (would Zig even work on those?).\n  Opening the &#39;Links&#39; tab in the info window for hard links now requires a scan through the in-memory tree, so it&#39;s noticeably slower. To my surprise, though, a full scan through a tree with 30+ million files takes less than a second on my system, so in practice this probably isn&#39;t going to be a problem (and who uses that &#39;Links&#39; tab, anyway?).\n  The browser UI is not visible anymore when refreshing or deleting a directory. The problem is that the browser keeps cached information about the opened directory, and this cache may be invalidated while the refresh/deletion is running. This is also kind-of a problem in ncdu 1.x, but it&#39;s less pronounced. There have been requests for allowing interactive browsing while ncdu is still scanning, so this won&#39;t a problem if I ever get around to implementing that, but it&#39;s not much of a priority on my end. Updating the browser&#39;s cache on each UI draw is going to be too expensive, so I&#39;m not yet sure how to handle it.\n  Grab yourself an ncdu-2.0-beta1 and test! The source code is available in the  &#39;zig&#39; branch in the repository.\n My first priority is to get 2.0 ready for a &#34;stable&#34; release, which means it needs to get some serious testing in the wild to evaluate how well it works and to flesh out the inevitable bugs. It&#39;s still a bit unclear to me if it even makes sense to release a stable version when the foundation it&#39;s built on is inherently unstable, but let&#39;s just see how things go.\n On the slightly longer term, the rewrite to Zig opened up the possibility for a few more features that I&#39;ve been wanting to see for a while, but that seemed tricky to implement in 1.x.\n Multithreaded scanning. This will be useless for old fashioned rotating hard drives, but for SSDs and especially NVMe, scanning performance can be greatly improved by distributing the work across multiple threads. While rewriting the code I came up with a promising idea on how to implement this, so I&#39;d love to experiment with that in future versions (io_uring is also an interesting target, but potentially even more complex).\n Faster  --exclude-pattern matching. Honestly, this feature is currently so slow in both versions that I&#39;m surprised nobody has ever complained about it (not to me, in any case). It&#39;s possible to slow ncdu&#39;s scanning performance down to a crawl with just a few patterns, a more clever matching implementation could provide major improvements.\n Exporting an in-memory tree to a file. Ncdu already has export/import options, but exporting requires a separate command invocation - it&#39;s not currently possible to write an export while you&#39;re in the directory browser. The new data model  could support this feature, but I&#39;m still unsure how to make it available in the UI.\n Transparent export compression. The export function dumps uncompressed JSON data and is designed to be piped through  gzip or similar commands. While this is documented in the manual page, I still see many people writing the export to disk without any sort of compression. That&#39;s a pretty big waste of space, so it would be nice if ncdu could transparently run the exported data through external (de)compression tools to make this easier and more discoverable.\n These features are in addition to a long list of other possible improvements that I&#39;ve been meaning to work on for the past decade, so don&#39;t expect too much. :)\n That&#39;s not to say Zig is immune to the problem of projects using hundreds of tiny little dependencies, but that development style isn&#39;t strongly encouraged in its current state: the standard library already covers a lot of ground, package management solutions are still being worked on and it&#39;s easy enough to just use existing C libraries instead. ↩\n I would absolutely  love for directory-level reports like these to be available for other forms of data sharing, such as reflinks or btrfs/ZFS snapshots. But alas, I doubt I&#39;ll ever be able to implement that in ncdu. Even if I could somehow grab and untangle the underlying data, keeping track of every block in a large filesystem is no doubt going to be very costly in both CPU and memory. I did write a  little tool some time ago to generate such reports for quota-enabled btrfs subvolumes, but I ended up disabling the quota feature later on because even that is pretty costly. There&#39;s also  btdu, which takes a very interesting approach to analyze btrfs filesystems. ↩", "posttime": "2021-07-25 14:35:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ncdu,hungry", "title": "Ncdu 2：不那么饥饿，更加 Ziggy", "title_en": "Ncdu 2: Less hungry and more Ziggy", "transed": 1, "url": "https://dev.yorhel.nl/doc/ncdu2", "via": "", "real_tags": ["ncdu", "hungry"]}, {"category": "", "categoryclass": "", "imagename": "c7a6f5f3f2cc91279bafe604925d38c2.jpg", "infoid": 1069610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新研究显示，番茄果实在被毛毛虫吃掉时会通知母株。关于水果是否可以与它所附着的植物进行交流，我们知之甚少，这对于警告植物受到威胁可能很重要。这一早期证据表明，害虫袭击确实会触发整个植物的防御性电和生化反应。这可以为未来检测农业害虫提供更有效的监测策略。最近发表在《可持续食品系统前沿》上的一项研究表明，一种番茄植物的果实在被毛毛虫侵扰时会向植物的其余部分发送电信号。植物有多种化学和激素信号通路，它们通常通过树液（流经植物的富含营养的水）传播。就水果而言，营养物质只流向水果，而且很少研究是否存在相反方向的交流——即从水果到植物。 “我们通常会忘记，植物的果实是其母株的活的半自主部分，远比我们现在想象的要复杂！既然果实是植物的一部分，由叶子和茎的相同组织组成，为什么它们不能像普通叶子一样与植物交流，告诉它他们正在经历什么？”巴西佩洛塔斯佩洛塔斯联邦大学的第一作者 Gabriela Niemeyer Reissig 博士说。 “我们发现，水果可以与植物的其他部分共享重要信息，例如毛虫攻击——这对植物来说是一个严重的问题——这可能可以让植物的其他部分为同样的攻击做好准备。”为了验证水果通过电信号进行交流的假设，Niemeyer Reissig 和她的合作者将番茄植株放置在法拉第笼中，在将果实与植株相连的树枝末端设有电极。然后，他们测量了果实被棉铃虫毛虫攻击 24 小时之前、之中和之后的电响应。该团队还使用机器学习来识别信号中的模式。结果显示攻击前后的信号之间存在明显差异。此外，作者还测量了植物其他部分的生化反应，例如过氧化氢等防御性化学物质。这表明，即使在远离毛虫造成损害的植物部分，这些防御也被触发。作者强调，这些仍是早期结果。他们的测量提供了所有电信号的“大图”视图，而不是更精确地区分单个信号。看看这种现象是否适用于其他植物物种以及不同类型的威胁也很有趣。也就是说，机器学习的这种新颖用途似乎具有回答这些和其他未来问题的巨大潜力。该技术还可能为农业昆虫控制提供新的——可能更环保——的方法。\n“如果像我们这样的研究继续推进，并且在开放环境中测量电信号的技术不断改进，就有可能很早就发现农业害虫的侵染，从而采取不那么激进的控制措施和更准确的昆虫管理，”尼迈耶解释说赖西格。 “了解植物如何与其果实相互作用，以及果实之间如何相互作用，可能会带来关于如何&#39;操纵&#39;这种交流以提高果实质量、对害虫的抵抗力和收获后的保质期的见解。”重新出版指南：开放获取和共享研究是 Frontiers 使命的一部分。除非另有说明，否则您可以重新发布在 Frontiers 新闻博客中发布的文章——只要您包含返回原始研究的链接。不允许出售物品。", "note_en": "Tomato fruits inform the mother plant when they are being eaten by caterpillars, shows a new study. Little is known about whether a fruit can communicate with the plant to which it’s attached, which could be important for warning the plant of threats. This early evidence shows that pest attacks do trigger defensive electrical and biochemical responses across the plant. This could provide more effective monitoring strategies for detecting agricultural pests in the future.\n A recent study in   Frontiers in Sustainable Food Systems shows that the fruits of a type of tomato plant send electrical signals to the rest of the plant when they are infested by caterpillars. Plants have a multitude of chemical and hormonal signaling pathways, which are generally transmitted through the sap (the nutrient-rich water that moves through the plant). In the case of fruits, nutrients flow exclusively  to the fruit and there has been little research into whether there is any communication in the opposite direction–i.e. from fruit to plant.\n    “We usually forget that a plant’s fruits are living and semiautonomous parts of their mother-plants, far more complex than we currently think! Since fruits are part of the plant, made of the same tissues of the leaves and stems, why couldn’t they communicate with the plant, informing it about what they are experiencing, just like regular leaves do?” says first author  Dr Gabriela Niemeyer Reissig, of the Federal University of Pelotas, in Pelotas, Brazil. “What we found is that fruits can share important information such as caterpillar attack–which is a serious issue for a plant–with the rest of the plant, and that can probably prepare other parts of the plant for the same attack.”\n  To test the hypothesis that fruits communicate by electrical signals, Niemeyer Reissig and her collaborators placed tomato plants in a Faraday’s cage with electrodes at the ends of the branches connecting the fruits to the plant. They then measured the electrical responses before, during and after the fruits had been attacked by  Helicoverpa armigera caterpillars for 24 hours. The team also used machine learning to identify patterns in the signals.\n  The results showed a clear difference between the signals before and after attack. In addition, the authors measured the biochemical responses, such as defensive chemicals like hydrogen peroxide, across other parts of the plant. This showed that these defenses were triggered even in parts of the plant that were far away from the damage caused by the caterpillars.\n The authors emphasize that these are still early results. Their measurements provide a “big picture” view of all of the electrical signals, rather than distinguishing individual signals more precisely. It will also be interesting to see whether this phenomenon holds true for other plant species, as well as different types of threats.\n That said, this novel use of machine learning appears to have very high potential for answering these and other future questions. The technique may also provide new–and possibly more environmentally friendly–approaches for insect control in agriculture.\n “If studies like ours continue to advance and the techniques for measuring electrical signals in open environments continue to improve, it will be possible to detect infestation of agricultural pests quite early, allowing for less aggressive control measures and more accurate insect management,” explains Niemeyer Reissig. “Understanding how the plant interacts with its fruits, and the fruits among themselves, may bring insights about how to ‘manipulate’ this communication for enhancing fruit quality, resistance to pests and shelf life after harvest.”\n REPUBLISHING GUIDELINES: Open access and sharing research is part of  Frontiers’ mission. Unless otherwise noted, you can republish articles posted in the Frontiers news blog — as long as you include a link back to the original research. Selling the articles is not allowed.", "posttime": "2021-07-25 14:35:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "攻击,fruits,植物", "title": "番茄果实在受到攻击时会向植物的其余部分发出电气警告", "title_en": "Tomato fruits send electrical warnings to the rest of the plant when attacked", "transed": 1, "url": "https://blog.frontiersin.org/2021/07/20/tomato-fruits-send-electrical-warnings-to-the-rest-of-the-plant-when-attacked-by-insects/", "via": "", "real_tags": ["攻击", "fruits", "植物"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家警告，如果接受加密货币付款的公司破产，将有无法追踪资金的危险 一位破产专家警告说，由于接受未征税和无法追踪的加密货币付款的企业破产，政府可能面临“无限”损失。越来越多的公司，包括道德化妆品公司 Lush 和办公室共享公司 WeWork，已经开始以比特币等加密货币以及债务、信贷或现金支付商品和服务的费用。但是，尽管这种转变受到了加密爱好者的欢迎，但专家表示，这可能是董事向当局隐瞒现金的一种简单方式，尤其是在公司破产时。破产公司 Begbies Traynor 的董事总经理 Julie Palmer 表示，加密货币支付的日益普及将使负责在企业倒闭后关闭业务的管理人员更难追踪资金来自何处，以及所有者是否拥有，员工或董事非法从业务中剥离资金。这意味着犯罪分子可以带走通常会被追回并分配给债权人的收入，包括英国税务海关总署和地方当局的税务员。帕尔默表示，如果没有新的法规和税收计划，政府可能面临巨大损失。 “潜力是无限的，这取决于它变得多么受欢迎，”她警告说。\n这是加密货币日益流行的最新威胁，加密货币与洗钱和黑市交易有关。希望向税务员和管理人员隐瞒财富的犯罪分子传统上必须经历设立投资工具（例如离岸信托）以隐藏现金的繁琐过程。近年来，通过在线设置“虚拟钱包”，小企业、商人和犯罪分子更容易接受加密货币支付。有了信托，“至少我们可以看到这笔钱的来源和去向”，帕尔默说。但是对于更难追踪的加密货币，“我们实际上追踪它并看到被取出的钱的机会更少”。帕尔默表示，破产行业无法独自解决这个问题，并认为英国当局——在这个问题上落后美国“一两年”——应该采取行动并制定法律，以确保加密资产得到妥善处理。受监管和征税。 “这可能是所得税收入的重大损失，”她说。 HMRC 表示，它最近发布了一份手册，概述了不同类型的加密资产交易的税收后果。 HMRC 发言人说：“我们采取行动，包括利用议会赋予的权力从一系列信息来源收集数据，以识别和调查那些未能申报所有收入和收益的人，包括在隐蔽经济中经营的个人，通过复杂的有组织犯罪集团和用于隐藏收入和其他资产的离岸结构。”审查是在英格兰银行和财政部权衡数字资产被整合到英国货币体系的可能性的同时进行的，这可能是通过银行发行的资产，有时被称为“英国币”。\n尽管该银行已表示对该想法持开放态度，但其首席经济学家安迪·霍尔丹 (Andy Haldane) 认为比特币等现有加密货币可以成为标准支付机制的想法是空想的。", "note_en": "Experts warn of danger of untraceable funds if companies accepting payments in cryptos go bust\n    The government could face “limitless” losses as a result of businesses that accept payments in untaxed and untraceable cryptocurrencies going bust, an insolvency expert has warned.\n A growing number of companies, including the ethical cosmetics firm Lush and office-sharing firm WeWork, have begun taking payments for goods and services in cryptocurrencies such as bitcoin, alongside debt, credit or cash.\n   But while the shift has been welcomed by crypto-enthusiasts, experts say it could be an easy way for directors to hide cash from authorities, particularly when companies go bust.\n Julie Palmer, a managing director at insolvency firm Begbies Traynor, said the growing popularity of cryptocurrency payments would make it harder for administrators – who are in charge of winding down a business after it fails – to track where money has come from, and whether owners, staff or directors are stripping funds out of the business illegally.\n It means criminals could walk away with income that would usually be clawed back and distributed to creditors, including the tax collectors at HM Revenue and Customs and local authorities.\n Palmer said that without new regulations and taxation plans, the government could face huge losses. “The potential is limitless, depending on how popular this becomes,” she warned.\n It is the latest threat emerging from the rising popularity of cryptocurrencies, which have been linked to money laundering and black market dealings.\n Criminals hoping to conceal wealth from tax collectors and administrators have traditionally had to go through the onerous process of setting up an investment vehicle, such as an offshore trust, to hide cash. In recent years, it has become easier for small businesses, tradespeople and criminals to accept payment in cryptocurrency by setting up “virtual wallets” online.\n With trusts, “at least we could see the source of that money and where it’s gone”, Palmer said. But with cryptocurrencies, which are harder to trace, “we’ve got even less of a chance of actually tracing that and seeing the money that’s been taken out”.\n Palmer said there was nothing the insolvency profession could do to tackle the issue on its own and believes UK authorities – who are a “year or two behind” the US on the issue – should take action and introduce laws to ensure crypto-assets are properly regulated and taxed. “It’s potentially a major loss of income tax revenue,” she said.\n HMRC said it recently released a manual outlining the tax consequences of different types of crypto-asset transactions.\n An HMRC spokesperson said: “We take action, including using powers provided by parliament to gather data from a range of information sources, to identify and investigate those that have failed to declare all their income and gains, ranging from individuals operating in the hidden economy, through to sophisticated organised crime groups and offshore structures used to hide earnings and other assets.”\n   The review is taking place at the same time as the  Bank of England and the Treasury weigh up the possibility of digital assets being integrated into the UK’s monetary system, potentially via a Bank-issued asset sometimes dubbed “Britcoin”.\n While the Bank has signalled that it is open to the idea, its chief economist Andy Haldane has  dismissed as fanciful the idea that existing cryptocurrencies such as bitcoin could become a standard payments mechanism.", "posttime": "2021-07-25 14:35:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "货币,lead,加密", "title": "加密货币可能给英国政府带来“无限”损失", "title_en": "Cryptocurrencies could lead to ‘limitless’ losses for UK government", "transed": 1, "url": "https://www.theguardian.com/technology/2021/jul/25/cryptocurrencies-could-lead-to-limitless-losses-for-uk-government", "via": "", "real_tags": ["货币", "lead", "加密"]}, {"category": "", "categoryclass": "", "imagename": "8d5ce9b134bbd239511ff7bc52b7305a.jpg", "infoid": 1069606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流行的移动支付服务 Venmo 重新设计了其应用程序。这通常是您可以放心忽略的新闻，但此公告值得仔细研究。除了进行一些导航调整和添加新的购买保护之外，PayPal 拥有的平台最终关闭了其全球社交源，该应用程序在其中发布了来自世界各地的人们的交易。这是解决应用程序世界中最突出的隐私问题之一的重要一步，但工作尚未完成。多年来，Venmo 的全球动态一直是对完全陌生的人的财务习惯进行窥探的洞察的字体。提要不显示给定交易的金额，但包括名称和注释表情符号和喜欢。点按姓名即可进入该用户的个人资料，一个有进取心的忙碌人士（或更糟）可以很快建立一个小档案，记录该人的朋友、他们的爱好以及他们滑入信息流中的任何其他内容——也许没有意识到该信息的公开程度。在写这些段落的时间里，亲戚们互相报销费城人队的门票，有人支付了“液体黄金😍”，不止一组室友平分了他们的网费。多年来，Venmo 交易和其他用户数据的可见性一直受到隐私和消费者权益倡导者的批评。数字权利组织电子前沿基金会的激进主义主管 Gennie Gebhart 说：“这种对社会支付应用程序的这种奇怪的企业位、这种企业 DNA 的承诺是一个巨大的负担。” “这不是一场等待发生的灾难，而是一场已经发生在这么多人身上的灾难。”最近和最引人注目的公开可能出错的例子发生在 5 月，当时 Buzzfeed 的一组记者找到了乔·拜登总统的 Venmo 帐户，以及他的家人和密友的帐户，只需在应用程序中搜索即可。他们花了10分钟。当时，即使您的交易记录被锁定，您的好友列表也是任何人都可以找到的公平游戏。对于围绕通常敏感的汇款和收款业务而构建的应用程序而言，这似乎有点不明智。然而，在 Buzzfeed 报告发布两周后，Venmo 添加了新的隐私控制，让您首次将应用程序上的联系人列表设为私有。删除全局提要扩展了这项工作，使窥探完全陌生的人变得越来越困难。很快，该应用程序的社交元素将仅限于您的 Venmo 联系人所做的事情。该公司在宣布重新设计的博客文章中表示：“这一变化使客户能够与最重要的人联系并分享有意义的时刻和体验。”虽然这当然算作进步，但隐私倡导者认为这还远远不够。 “Venmo 终于意识到，在金融应用程序上进行最大程度的宣传是一个糟糕的主意，”专注于互联网开放性和可访问性的非营利组织 Mozilla 基金会的高级活动家 Kaili Lambe 说。 “然而，从一开始我们就一直呼吁 Venmo 默认是私有的，因为如此多的 Venmo 用户实际上并不知道他们的交易是公开的。”\nVenmo 的一位发言人表示，该公司目前没有计划考虑将这些交易默认设为私有。这意味着用户仍然需要竭尽全力确保他们的每个点对点交易不会向全世界广播。很难看出维持现状的好处。 “你会想到很多非常敏感的用例，”Gebhart 说。 “你想到治疗师，你想到性工作者。你想想美国总统。想象一下这些默认设置可能会出现严重错误并对真实的人造成真正伤害的地方，并不需要很大的想象力。” Venmo 公开默认立场的影响已经超出了拜登账户的发现。 2018 年，隐私倡导者和设计师 Hang Do Thi Duc 使用 Venmo 的公共 API 整理了平台上近 2.08 亿笔交易，仅根据他们在应用程序中的活动，拼凑出五名用户的详细画像。第二年，程序员 Dan Salmon 编写了一个 20 行的 Python 脚本，让他在几周内获得了数百万的 Venmo 付款。此后，Venmo 对您通过公共 API 访问交易数据的速度进行了限制，但 Salmon 表示，该公司做得还不够。 “Venmo 基本上有一个我可以连接到交易数据的消防水管，”他说。 “现在这被切断了，交易仍然存在；只需要多走几步就可以得到它们。”他说构建一个新的抓取工具需要大约一个小时的工作。 “在 Venmo，我们会定期评估我们的技术协议，作为我们对平台安全和不断改善客户的 Venmo 体验的承诺的一部分。抓取 Venmo 违反了我们的服务条款，我们积极努力限制和阻止违反这些政策的活动，”Venmo 发言人 Jaymie Sinlao 在一封电子邮件声明中写道。 “我们继续为获得批准的开发人员提供对我们现有 API 的选择性访问，以继续在 Venmo 平台上进行创新和构建。” Venmo 远不是唯一一个让您选择退出共享而不是主动寻求共享的应用程序。但是因为它的用例完全是金融的，所以赌注要高得多，而且其用户的假设可能会放错地方。 Venmo 并没有让用户特别容易弄清楚他们正在分享什么或没有分享什么。 2018 年，它与联邦贸易委员会达成和解，部分原因是其令人困惑的隐私设置。 “有趣的是，人们非常惊讶地发现金融服务应用程序默认是公开的，”Mozilla 基金会的兰贝说。 “即使是使用 Venmo 多年的人也可能不知道他们的设置是公开的。”\n为确保您不会继续前进，请前往“设置”&gt;“隐私”并选择“私人”。然后点击过去的交易，然后点击全部更改为私人以追溯锁定。在此期间，请继续点击好友列表，然后点击私人并关闭出现在其他用户的好友列表中。否则，您将与您认识的每个人以及许多您不认识的人分享您的信用卡购买的数字等价物。或者考虑使用 Square 的 Cash App 之类的东西，默认情况下是私有的。对于 Venmo 及其用户而言，失去全球供稿是迈向隐私的重要一步。希望还有更多步骤。", "note_en": "Venmo, the popular mobile payment service, has redesigned its app. That&#39;s normally news you could safely ignore, but this announcement is worth a closer look. In addition to making some navigational tweaks and adding new purchase protections, the PayPal-owned platform is finally shutting down its global social feed, where the app published transactions from people around the world. It&#39;s an important step toward resolving one of the most prominent privacy issues in the world of apps, but the work isn&#39;t finished yet.\n Venmo’s global feed has for years been a font of voyeuristic insights into the financial habits of total strangers. The feed doesn&#39;t display amounts for a given transaction, but names and notes emoji and likes are included. Tapping on a name brings you to that user&#39;s profile, and an enterprising busybody (or worse) could pretty quickly build a small dossier of that person&#39;s friends, their hobbies, and anything else they’ve slipped into the stream—without, perhaps, realizing how public that info can be. In the time it took to write these paragraphs, relatives reimbursed each other for Phillies tickets, someone made a payment for “liquid gold 😍,” more than one set of roommates split their internet bill.\n The visibility of Venmo transactions and other user data has been criticized by privacy and consumer advocates for years. “This commitment to this weird corporate bit, this corporate DNA, of a social payment app is a huge liability,” says Gennie Gebhart, activism director at the Electronic Frontier Foundation, a digital rights group. “It’s not a disaster waiting to happen, it’s a disaster that’s already happened so many times to so many people.”\n The most recent and most high-profile instance of where that openness can go wrong came in May, when a team of  Buzzfeed reporters found President Joe Biden’s Venmo account, along with those of his family and close friends, simply by searching within the app. It took them 10 minutes.\n At the time, even if your transaction history was locked down, your friends list was fair game for anyone to find. Which, again, seems a little unwise for an app built around the often sensitive business of sending and receiving money. Two weeks after the Buzzfeed report, however, Venmo added new privacy controls, letting you make your list of contacts on the app private for the first time.\n The removal of the global feed extends that work, by making it incrementally harder to snoop on total strangers. Soon, the social element of the app will be limited to what your Venmo contacts are up to. “This change allows customers to connect and share meaningful moments and experiences with the people who matter most,” the company said in a blog  post announcing the redesign. While it certainly counts as progress, privacy advocates believe it doesn’t go far enough.\n “Venmo’s finally getting the message that maximum publicity on a financial app is a terrible idea,” says Kaili Lambe, senior campaigner at the Mozilla Foundation, a nonprofit focused on internet openness and accessibility. “However, from the beginning we have been calling on Venmo to be private by default, because so many Venmo users don’t actually know that their transactions are public to the world.”\n A Venmo spokesperson said the company has no plans at this time to consider making those transactions private by default. That means users will still need to go out of their way to make sure their every peer-to-peer transaction isn&#39;t broadcast to the world. It&#39;s hard to see the benefit of maintaining the status quo.\n “You think of a lot of really sensitive use cases,” says Gebhart. “You think about therapists, you think about sex workers. You think about the president of the United States. It doesn’t take a big imagination to imagine places where these defaults could go horribly wrong and cause real harm to real people.”\n The implications of Venmo’s public-by-default stance have played out beyond the discovery of Biden’s account. In 2018, privacy advocate and designer Hang Do Thi Duc used Venmo’s public API to  sort through nearly 208 million transactions on the platform, piecing together alarmingly  detailed portraits of five users based only on their activity in the app. The following year, programmer Dan Salmon wrote a 20-line Python script that  let him scrape millions of Venmo payments in a matter of weeks.\n Venmo has since placed restrictions on the rate at which you can access transaction data through the public API, but Salmon says the company hasn’t gone far enough. “Venmo basically had a firehose I could connect to of transaction data,” he says. “Now that that is cut off, the transactions are still out there; it will just take a few more steps to go get them.” He says it would take about an hour of work to build a new scraping tool.\n “At Venmo, we routinely assess our technical protocols as part of our commitment to platform security and continually improving the Venmo experience for our customers. Scraping Venmo is a violation of our terms of service, and we actively work to limit and block activity that violate these policies,” Venmo spokesperson Jaymie Sinlao wrote in an emailed statement. “We continue to enable select access to our existing APIs for approved developers to continue innovating and building upon the Venmo platform.”\n Venmo is far from the only app that  makes you opt out of sharing rather than actively seeking it out. But because its use case is exclusively financial, the stakes are significantly higher, and the assumption of its users potentially misplaced. Venmo hasn’t made it especially easy for users to figure out what they are or are not sharing; in 2018 it  reached a settlement with the Federal Trade Commissions related in part to its confusing privacy settings.\n “Anecdotally, people are very surprised to find that a financial services app is public by default,” says the Mozilla Foundation’s Lambe. “Even people who’ve been using Venmo for years might not know that their settings are public.”\n To make sure that yours aren’t going forward, head to  Settings &gt; Privacy and select  Private. Then tap  Past Transactions, and tap  Change All to Private to lock things down retroactively. And while you’re at it, go ahead and tap  Friends List, then tap  Private and toggle off  Appear in other users’ friends list. Otherwise, you’re sharing the digital equivalent of your credit card purchases with everyone you know, and lots of people you don’t. Or consider using something like Square’s Cash App instead, which is private by default.\n Losing the global feed is an important step toward privacy for Venmo and its users. Hopefully, more steps are still to come.", "posttime": "2021-07-25 13:56:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "venmo,private", "title": "Venmo 变得更加私密——但它仍然不完全安全", "title_en": "Venmo gets more private—but it’s still not fully safe", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/venmo-gets-more-private-but-its-still-not-fully-safe/", "via": "", "real_tags": ["venmo", "private"]}, {"category": "", "categoryclass": "", "imagename": "f4915edbe553c8739a9cb93f908e4e32.jpeg", "infoid": 1069605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过跟踪地震释放的地震能量如何穿过或反射地球表面下的不同层，我们已经了解了很多关于我们星球内部的信息。火星上的一年多来，我们在火星上安装了地震仪，希望它能帮助我们弄清楚这颗红色星球的内部。但是火星在地震方面相对安静，我们只有一个地震仪而不是整个网络。尽管如此，有了少数重大地震的记录，我们现在对火星内部的样子有了一些了解。一组新的研究表明它非常奇怪，有一个大而轻的核心和一个意外温暖的地壳。计算行星的结构涉及读取地震波，地震波分为两类：剪切波和压缩波（S 和 P，在地质学术语中）。根据地震（或地震）的位置，海浪可能会直接到达。但许多其他人在到达接收器之前从行星表面反弹，有时多次。所以P波之后会是PP波，然后是PPP波。美国地质调查局有一个很好的图表，说明了这可能产生的复杂性，我们已将其包含在右侧。但这远没有结束并发症。波的速度，以及 P 和 PP 和 PPP 信号之间的时间间隔，将根据波传播的材料而变化。材料的成分、密度甚至温度都会影响地震信号穿过地球的速度。这些特性通常在行星的特定层之间存在显着差异，例如固体地壳和半熔融地幔。这些差异会折射一些地震波，从而弯曲它们穿过行星内部的路径。其他波会从内部层之间的边界反射。所有这些都使得从地震事件中重建内部变得复杂。通常有不止一种属性组合，例如距离、材料和温度与事件产生的地震信号兼容。在地球上，这不是问题。我们有大量的地震仪，可以让我们将信号的最可能解释归零。我们有很多单独的事件，这使我们能够识别我们星球内部的典型行为。在火星上，这些都不是真的。我们总共有一台地震仪，因此即使距离估计充其量也是不确定的。而且我们对行星的内部温度知之甚少。在阅读这些研究时，有些观点几乎让人觉得他们在哀悼因洞察号测量火星内部温度的尝试失败而导致的数据缺失。火星在地震中也非常安静。没有震级超过4.0级的地震，也没有多少震级。总而言之，从洞察号着陆点的背景噪音中可以清楚地看出不到十二个事件。因此，您应该将这些论文中的结果视为火星内部的初始模型：随着更多数据的出现，它们可能会得到改进，甚至可能会进行相当大的修改。\n鉴于我们已经获得了大量起源于火星的陨石，从轨道上对其进行了研究，并在其上着陆了硬件，因此我们对火星最外层地壳的样子有很好的了解。然而，根据地震波，其中一项研究表明，在洞察号着陆点，外地壳仅延伸到地球表面以下约 10 公里处。但是有一个下地壳向下延伸到地幔，这项研究表明它开始于大约 50 公里深。第一个结果与第二项研究一致，该研究显示了向下 6 到 11 公里之间的某处边界。但它显示了介于 15 和 25 公里之间的第二个边界，这比第一个要高得多。尽管如此，它还看到一些迹象表明第三个边界在 27 到 47 公里之间——这个数字与第一篇论文中的 50 公里数字一致。所以实际上，两者之间的最大区别在于存在多少层地壳。这两项研究一致认为地壳比预期的要温暖。这意味着存在的放射性元素比我们根据我们对表面成分的了解所预测的要多。为什么会出现这种情况尚不清楚，过量放射性的数量还取决于地壳的确切厚度。同样，按照最初的意图，测量通过地壳的热流可能会产生很大的不同。最后一篇论文深入探讨了火星地幔与其核心之间的边界。结果是半径在 1,800 公里以北。这出乎意料地大：它超过了整个星球半径的一半。大核心的后果之一是，为了与行星的整体密度兼容，核心必须比预期的要轻（它也是液体）。这意味着存在较轻的元素。硫是最合理的候选物，但预计火星没有足够的硫来解释这一切。因此，碳、氧和氮也可能存在于地核中。这样做的一个后果是地核外边缘的压力会降低，这意味着火星不可能像地球一样形成一种有助于在地核中吸收热量的矿物。这可能导致这颗行星更快地失去其形成过程中留下的热量。 InSight 的使命已经扩展，因此我们将继续从未来的地震中获取更多数据。虽然初始数据与各种潜在条件兼容——各种层的密度、温度和厚度的误差线很大——但进一步的数据应该有助于缩小范围。但事实证明，就洞察号的着陆位置而言，巨大的液态核心相当不幸。核心本身在火星上投下了地震“阴影”，阻挡了来自地震仪的地球另一侧的地震波。核心越大，洞察力看不见的行星就越多。而且，不幸的是，这个阴影包括塔尔西斯地区，那里有火星最大的火山，被认为最近才活跃起来。\n无法“看到”塔尔西斯意味着我们登记的地震总数可能会减少。尽管如此，只要硬件支持，我们就有可能拥有稳定增长的数据收集，这些数据将逐渐让我们更清楚地了解这颗红色行星的组成和演化——这将有助于我们了解行星内部和外部的形成我们的太阳系。", "note_en": "We&#39;ve learned a lot about our planet&#39;s interior simply by tracking how the seismic energy released by earthquakes moves through or reflects off the different layers present beneath Earth&#39;s surface. For over a Martian year,  we&#39;ve had a seismograph on Mars in the hope that it would help us to figure out the red planet&#39;s interior.\n But Mars is relatively quiet seismically, and we&#39;ve only got a single seismograph instead of an entire network. Still, with records of a handful of significant marsquakes, we now have some sense of what Mars&#39; interior looks like. And a set of new studies indicates that it&#39;s pretty weird, with a large, light core and an unexpectedly warm crust.\n  Working out the structure of a planet involves reading seismic waves, which come in two categories: shear and compressional (S and P, in geological parlance). Depending on the location of the earthquake (or marsquake), the waves may arrive directly. But many others bounce off the surface of the planet before reaching the receiver, sometimes multiple times. So P waves will be followed by PP waves, and later by PPP waves. The US Geological Survey has  a great diagram of the complexity this can produce, which we&#39;ve included at right.\n But that&#39;s far from the end of the complications. The speed of the waves, and thus the time gaps between P and PP and PPP signals, will vary based on the material the waves are traveling through. The composition, density, and even temperature of the material can all make a difference in the speed at which seismic signals move through the planet. These properties often differ dramatically between specific layers of the planet, such as the solid crust and the semi-molten mantle. These differences will refract some of the seismic waves, bending their path through the planet&#39;s interior. Other waves will reflect off the boundary between internal layers.\n    All of that makes reconstruction of the interior from seismic events complicated; there are generally more than one combination of properties like distance, materials, and temperatures that are compatible with the seismic signals produced by an event. On Earth, this isn&#39;t a problem. We have a huge collection of seismographs that allows us to zero in on the most likely interpretation of the signals. And we have lots of individual events, which allow us to identify the typical behavior of our planet&#39;s interior.\n On Mars, none of that is true. We have a grand total of one seismograph, and so even distance estimates are iffy at best. And we have very little sense of the internal temperature of the planet. There are points in reading the studies that almost feel like they&#39;re mourning the absence of data from  the failed attempt to have InSight take Mars&#39; internal temperature.\n Mars also turns out to be very seismically quiet. There were no marsquakes with a magnitude above 4.0, and there weren&#39;t many of any magnitude. All told, fewer than a dozen events stood out clearly from the background noise at InSight&#39;s landing site. So, you should view the results in these papers as an initial model of Mars&#39; interior: they&#39;re likely to be refined as more data comes in and may even be revised considerably.\n  We have a good sense of what the outermost Martian crust looks like, given that we&#39;ve obtained plenty of meteorites that originated on Mars, studied it from orbit, and landed hardware on it. Based on seismic waves, however, one of those studies suggest that the outer crust only extends to about 10 km beneath the planet&#39;s surface at the InSight landing site. But there&#39;s a lower crust, which extends down the mantle, which this study suggests starts at about 50 km deep.\n The first result is in keeping with a second study, which shows a boundary somewhere between six and 11 km down. But it shows a second boundary somewhere between 15 and 25 km, which is much higher than the first. Still, it also sees some indication of a  third boundary somewhere between 27 and 47 km—a figure that&#39;s consistent with the 50 kilometer figure in the first paper. So really, the big difference between the two is about how many layers of crust are present.\n    The things both these studies agree on is that the crust is warmer than expected. This implies that there are more radioactive elements present than we would have predicted based on what we know about the surface composition. Why that&#39;s the case is unclear, and the amount of excess radioactivity also depends on the exact thickness of the crust. Again, having a measure of the heat flow through the crust, as was originally intended, could have made a big difference here.\n The final paper goes deep and looks for the boundary between Mars&#39; mantle and its core. The result is a radius just north of 1,800 km. This is unexpectedly large: it&#39;s over half the radius of the entire planet. One of the consequences of the large core is that, to be compatible with the planet&#39;s overall density, the core has to be lighter than expected (it&#39;s also liquid). That implies the presence of lighter elements. Sulfur is the most reasonable candidate, but Mars isn&#39;t expected to have enough sulfur to account for it all. So carbon, oxygen, and nitrogen can probably be found in the core as well.\n One consequence of this is that the pressures at the outer edge of the core will be lower, meaning that Mars couldn&#39;t have formed a mineral that helps trap heat in the core like Earth. This may have caused the planet to lose the heat left over from its formation more rapidly.\n  InSight has seen its mission extended, so we&#39;ll continue to get more data from future marsquakes. While the initial data is compatible with a variety of potential conditions—the error bars on the density, temperature, and thickness of various layers are large—further data should help narrow things down.\n But the large, liquid core turns out to be rather unfortunate in terms of InSight&#39;s landing location. The core itself casts a seismic &#34;shadow&#34; across Mars, blocking waves from marsquakes on the opposite side of the planet from the seismograph. The larger the core, the more of the planet that&#39;s invisible to InSight. And, unfortunately, that shadow includes the Tharsis region, which contains Mars&#39; largest volcanoes and is thought to have been active relatively recently.\n Not being able to &#34;see&#34; Tharsis means we&#39;re likely to register fewer marsquakes in total. Still, as long as the hardware holds up, we&#39;re likely to have a steadily growing collection of data that will gradually give us a clearer picture of the red planet&#39;s composition and evolution—something that will help us understand planet formation both within and outside of our Solar System.", "posttime": "2021-07-25 13:55:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,星球,planet,地震", "title": "红色星球地核大，地壳复杂", "title_en": "Red planet has a big core, complex crust", "transed": 1, "url": "https://arstechnica.com/science/2021/07/marsquakes-illuminate-what-lies-beneath-the-sands-of-mars/", "via": "", "real_tags": ["rust", "星球", "planet", "地震"]}]