[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001008, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择此选项将在上下文中搜索发布者/社会的所有发布", "note_en": "Selecting this option will search all publications for the Publisher/Society in context", "posttime": "2020-05-07 04:31:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,scientists,选项", "title": "武汉科学家研制微波空气等离子体喷气推进装置", "title_en": "Wuhan scientists develop jet propulsion by microwave air plasma", "transed": 1, "url": "https://aip.scitation.org/doi/full/10.1063/5.0005814", "via": "", "real_tags": ["科学家", "选项"]}, {"category": "", "categoryclass": "", "imagename": "917ead124e5b30dee7cacdcb363e3ecf.jpg", "infoid": 1001007, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奥斯卡是今年收视率最高的颁奖典礼。它被媒体广泛报道，并受到影迷的高度期待。\n在颁奖典礼前的几周里，电影盗版也有一些令人兴奋的事情：屏幕泄密。\n作为投票过程的一部分，许多奥斯卡放映员被送到学院成员手中，最终落入海盗手中。当这种情况发生时，泄露的屏幕通常由数百万人共享。\n泄漏通常被标记为“DVDscr”，指的是仍在使用的DVD屏幕源格式。虽然流媒体放映机已经变得越来越普遍，但数以万计的实体放映机副本仍然通过邮件发送。\n今年，也将有大量的光盘出货，但在即将到来的奥斯卡颁奖典礼之后，这将成为过去。美国电影艺术与科学学院(Academy Of Motion Picture Arts And Sciences)本周宣布，2021年将不再允许物理放映员。\n学院写道：“第93届奥斯卡颁奖季将是允许分发DVD放映机的最后一年；从2021年开始，第94届奥斯卡颁奖典礼将停止发送这些邮件。”\n奥斯卡的道路与艾美奖如出一辙，今年艾美奖已经做出了转变。根据学院的说法，过渡是其可持续发展努力的一部分。这还包括禁止实体音乐CD、剧本硬拷贝、纸质邀请函和其他可能损害环境的东西。\n禁止实体放映机确实会更可持续。制造数以万计的光盘并将其运往全国各地比共享一个在线放映机的链接要占用更多的资源。作为一个额外的好处，它也为制片厂节省了一大笔钱。\n学院没有提到盗版，但这一转变确实意味着臭名昭著的“DVDscr”标签最终将对奥斯卡的放映者来说过时。这标志着一个时代的结束。\n盗版是否被认为是一个因素仍然是一个猜测。一些内部人士认为，数字屏幕更容易保护，因此更安全，但这还有待商榷。\n在分发过程中可能会有较少的泄漏机会，但流媒体平台很容易受到攻击，这是众所周知的。事实上，我们已经看到几个屏幕从网上来源泄露。去年，海盗释放组织EVO证实了这一点。\n“我们可以接触到数字屏幕，它们确实很容易泄露。上面的数字版权管理是个笑话。EVO团队当时告诉我们：“我们去年有一个账户，上面有三个屏幕，他们几乎都准备好了MP4编码。”\n流筛选器还是物理筛选器更安全，最终取决于为每个筛选器实施的保护措施的类型。就目前而言，最可靠的结论是，无论发行平台是什么，盗版问题都可能依然存在。\n两年后，我们可能会知道更多。然而，在接下来的一季中，可能会再次有几个“DVDscr”泄露。", "note_en": "The Oscars is the most watched awards show of the year. It’s widely covered in the press and highly anticipated by movie fans.\n In the weeks leading up to the awards ceremony, movie pirates also have something to be excited about: screener leaks.\n Many Oscar screeners, which are sent to Academy members as part of the voting process, end up in the hands of pirates. When that happens, the leaked screeners are typically shared by millions of people.\n The leaks are often tagged “DVDscr,” referring to the DVD screener source format which is still in use. While streaming screeners have become more and more common, tens of thousands of physical screener copies are still sent out via mail.\n This year, plenty of discs will be shipped too but, after the upcoming Oscars ceremony, that will be a thing of the past. The Academy of Motion Picture Arts and Sciences announced this week that physical screeners will no longer be allowed in 2021.\n “[T]he 93rd Awards season will be the final year DVD screeners will be allowed to be distributed; these mailings will be discontinued starting in 2021 for the 94th Academy Awards,” the Academy writes.\n The Oscars follow the same path  as the Emmys, which already made the switch this year. According to the Academy, the transition is part of its sustainability efforts. This also includes a ban on physical music CDs, hard copies of screenplays, paper invites, and other things that possibly hurt the environment.\n Banning physical screeners will indeed be much more sustainable. Manufacturing tens of thousands of discs and shipping these all over the country takes up more resources than sharing a link to an online screener. As an added benefit, it also saves the studios a lot of money.\n Piracy is not mentioned by the Academy but the transition does mean that the infamous ‘DVDscr’ tag will eventually be obsolete for Oscar screeners. That marks the end of an era.\n Whether piracy was considered as a factor at all remains a guess. Some insiders believe that digital screeners are easier to protect and therefore more secure, but that is up for debate.\n There may be fewer leak opportunities in the distribution process, but it’s common knowledge that streaming platforms can be easily compromised. In fact, we have already seen several screeners being leaked from online sources. This was corroborated by pirate release group EVO last year.\n “We had access to digital screeners and they are indeed easy to leak. The DRM on it is a joke. We had an account last year with three screeners on it and they were pretty much MP4 ready to encode,” the EVO team informed us at the time.\n Whether streaming or physical screeners are more secure ultimately depends on the type of protection measures that are implemented for each. The safest conclusion, for now, is that piracy will likely remain a problem no matter what the distribution platform is.\n Two years from now, we’ll likely know more. During the upcoming season, however, there will likely several ‘DVDscr’ leaks again.", "posttime": "2020-05-07 04:19:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "dvd,盗版", "title": "盗版“DVD放映机”将在明年奥斯卡之后成为历史", "title_en": "Pirated 'DVD Screeners' Will be History After Next Year's Oscars", "transed": 1, "url": "https://torrentfreak.com/pirated-dvd-screeners-will-be-history-after-next-years-oscars-200501/", "via": "", "real_tags": ["dvd", "盗版"]}, {"category": "", "categoryclass": "", "imagename": "2eb07e8c5edafe1e52fc4ab926780f91.jpg", "infoid": 1001006, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“公告牌”证实，德国电子乐队Kraftwerk的弗洛里安·施耐德去世。他73岁。\n在一份声明中，Kraftwerk的联合创始人拉尔夫·胡特证实了他的朋友兼伴侣弗洛里安·施耐德(Florian Schneider)在73岁生日后几天因短暂的癌症去世的令人悲痛的消息。\n1970年，施耐德与胡特组成了有影响力的小组和多媒体项目。Kraftwerk-使用包括自制和定制设备在内的电子乐器-被广泛认为是电子音乐的先驱，并以其音景、实验和技术创新影响了音乐领域的各种流派，包括嘻哈、合成流行和摇滚。\n已故的大卫·鲍伊也认识到施耐德对他自己艺术的影响。在鲍伊1977年的专辑“英雄”中，这位标志性的艺术家以这位音乐家的名字命名了他的主要器乐曲目V-2施耐德。\n施耐德演奏合成器、声码器、长笛、萨克斯等乐器，并提供人声服务。在乐队工作了40年后，他于2008年离开乐队。在他加入乐队期间，克拉夫特沃克发行了10张录音室专辑，其中7张登上了公告牌200的排行榜，其中包括1974年广受好评的Autobahn，它的巅峰位置是第5位。而受德国高速公路系统启发的唱片主打歌在1975年达到了公告牌100的第25位。为了与乐队的交通和技术主题保持一致，乐队第六张专辑中的主打歌跨欧快车(Trans-Europe Express)的灵感来自于泛欧特快铁路系统，在1978年达到了第67位。\n克拉夫特沃克的音乐也极大地影响了工业和舞蹈流派，他已经在公告牌舞蹈俱乐部歌曲排行榜上获得了8个条目。其中有一对1号的，都是1987年的：穆西克直达(MUSIQUE)直达(MUSIQUE)和电话(Remix)。&#34；\n在他们几十年的音乐创作中，自1991年尼尔森音乐/MRC数据开始以来，乐队总共售出了73.3万张。他们还凭借3-D专辑获得了2017年格莱美最佳舞蹈/电子专辑奖，并在2014年荣获终身成就奖。\n虽然六次获得摇滚名人堂提名，但这支颇具影响力的电子乐队尚未入选。\n在他去世之前，Kraftwerk宣布乐队将开始北美夏季巡演，以庆祝乐队成立50周年。演出的特色是乐队以3-D视觉效果闻名，融合了音乐和机器人技术。由于全球冠状病毒大流行，庆祝演出被取消。", "note_en": "Florian Schneider of German electronic band  Kraftwerk has died,  Billboard has confirmed. He was 73.\n In a statement, Kraftwerk co-founder Ralf Hütter confirms &#34;the very sad news that his friend and companion over many decades Florian Schneider has passed away from a short cancer disease just a few days after his 73rd birthday.&#34;\n Schneider formed the influential group and multimedia project with Hütter in 1970. Kraftwerk -- with its use of electronic instruments that included homemade and custom-built devices -- has been widely credited with pioneering electronic music and influencing various genres across the musical spectrum, including hip-hop, synthpop and rock with their soundscapes, experimentation and technical innovations.\n  The late David Bowie also recognized Schneider&#39;s influence on his own art. On Bowie&#39;s 1977 album  Heroes, the iconic artist titled his mostly instrumental track &#34;V-2 Schneider&#34; after the musician.\n Schneider -- who played the synthesizer, vocoder, flute, sax and more, as well as provided vocals -- left the band in 2008 after four decades. During his time with the group, Kraftwerk released 10 studio albums, seven of which charted on the  Billboard 200, including 1974&#39;s acclaimed  Autobahn, which peaked at No. 5. The record&#39;s title track -- inspired by the German highway system -- reached No. 25 in 1975 on the Billboard 100. In keeping with the band&#39;s themes of transportation and technology, title track &#34;Trans-Europe Express&#34; -- off the group&#39;s sixth album and inspired by the Trans-Europe Express rail system, reached No. 67 in 1978.\n  Kraftwerk, whose music also highly influenced industrial and dance genres, has tallied eight entries on  Billboard&#39;s Dance Club Songs chart. Among them are a pair of No. 1s, both in 1987: &#34;Musique Non Stop&#34; and &#34;The Telephone Call (Remix).&#34;\n Over their decades of creating music, the band has sold a collective 733,000 copies since the inception of Nielsen Music/MRC Data in 1991. They also won the best dance/electronic album Grammy in 2017 for  3-D The Catalogue, and were honored with the lifetime achievement award in 2014.\n Though nominated for the Rock Hall of Fame six times, the influential electronic band has yet to be inducted.\n  Prior to his death, Kraftwerk had announced that the band would be embarking on a summer tour of North America to celebrate the group&#39;s 50th anniversary. The shows were set to feature the 3-D visuals the band is known for, melding music and robotics. The celebratory shows were canceled due to the global coronavirus pandemic.", "posttime": "2020-05-07 04:17:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联合,founder,乐队", "title": "克拉夫特沃克联合创始人弗洛里安·施耐德逝世，享年73岁", "title_en": "Kraftwerk Co-Founder Florian Schneider Dies at Age 73", "transed": 1, "url": "https://www.billboard.com/articles/news/obituary/9372433/florian-schneider-dead-kraftwerk-co-founder-dies", "via": "", "real_tags": ["联合", "founder", "乐队"]}, {"category": "", "categoryclass": "", "imagename": "8ae2960091638aae0020db4fa8dc77bc.jpeg", "infoid": 1001005, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自4月中旬以来，这项服务一直在美国100家沃尔玛门店进行试点测试。沃尔玛表示，计划在5月初将这项服务扩展到近1000家门店，随后几周将在近2000家门店提供这项服务。\n沃尔玛的一些顾客最近可能收到了推送通知，提醒他们即将推出。\n要使用快递，您首先在您的在线沃尔玛购物车中装满送货订单所需的最低30美元或更多。快递服务提供来自沃尔玛杂货、消费品和一般商品类别的16万多种商品。在结账时，您将在日历下方看到一个选项，您可以从中选择送货日期以选择Express服务。在许多情况下，当天甚至几天外可能没有其他标准的送货时间段，这使得快递服务对更早需要订单的购物者更具吸引力。\n虽然沃尔玛正式将快递推广为“两小时”送货服务，但在试行该计划的几周内，沃尔玛平均能够在56分钟内送货。\n“在我们的测试中，我们收到了18.90美元的快递费，可以在55分钟或更短的时间内收到快递，”这款应用程序今天(4月30日)通知我们。没有其他费用。如果没有选择快递选项，下一个可用的时间段要到下周，也就是5月4日星期一。\n18.90美元的价格接近-但不完全是-比沃尔玛典型的7.95美元或9.95美元的送货费高出10美元，具体取决于一天中的不同时间。但我们理解，计划是让Express成为统一的10美元附加费。(沃尔玛直到下周才计划正式宣布推出，因此定价正在更新。)。\n与沃尔玛的其他杂货快递一样，快递由沃尔玛的外部送货合作伙伴网络处理，这些合作伙伴因市场而异。该零售商不愿评论这些额外费用是否与他们的合作伙伴分摊，或者如果是的话，如何分摊。\n考虑到在食品和其他关键供应短缺的情况下，这种制度如何有利于更富有的客户，可能会对这样的制度产生反弹。在大流行期间，由于消费者囤积卫生纸、洗手液和莱索尔清洁剂等物品，商店货架经常空空如也。现在，消费者被警告说，预计很快就会出现肉类短缺。\n此外，这场流行病已经暴露了那些有能力在网上购物的人和低收入客户之间的收入差距，这些客户只能在实体店使用他们的SNAP福利(食品券)-除了在少数几个美国农业部试点运行的州。现在，那些有能力的人将能够获得另一个优势：首先付费获得有限的供应。\n对于库存如此有限以至于不能保证送货的物品，它将从在线杂货服务中删除它们的可用性。此外，该零售商表示，它不会推迟标准送货订单，以满足高价快递客户的需求。取而代之的是，快递服务是在沃尔玛现有的食品杂货提货和送货能力的基础上提供的。\n沃尔玛说，快递服务不是因为大流行而构思出来的，但它确实在推出的时间上发挥了作用。\n沃尔玛的一位发言人解释说：“我们在冠状病毒大流行期间看到的需求正在促使我们推动和加快一些我们可能一直在考虑的服务的开发。”“但需求推动我们更快地进行创新，”他们补充道。\n由于冠状病毒大流行，沃尔玛并不是唯一家经历在线杂货订单拥挤的公司。\n最近几周，该公司和其他公司的食品杂货应用程序的下载量达到了创纪录的水平。事实上，对在线杂货和其他电子商务订单的需求如此之大，以至于沃尔玛在整整六周的时间里，从100多万名申请者中招聘了15万名新员工，现在还在招聘5万人。\n与此同时，沃尔玛的在线杂货竞争对手-Shipt、Insta和Amazon-也一直在招聘数十万名新购物者。由于在线杂货购物的兴起，亚马逊不得不为新的亚马逊生鲜和全食市场(Amazon Fresh And Whole Foods Market)提货和送货客户实施等待名单制度。Insta还对其应用程序进行了几次调整，以帮助更好地确定订单的优先顺序，并打开更多的送货窗口。\n在沃尔玛的案例中，我们被告知，它能够推出Express不仅仅是因为它的新员工。\n该公司已经雇佣了7.4万名“个人购物者”，他们致力于在线杂货订单的拉动。沃尔玛表示，Express是由这些个人购物者提供动力的，其中只有一些人可能是新雇用的商店员工。\n沃尔玛客户产品部高级副总裁汤姆·沃德(Tom Ward)说：“无论生活需要什么，我们都有机会为我们的客户服务。”“无论是最后一分钟的配料，发烧时吃的药，还是清点家务清单时不知道需要的东西，时间都很重要。”快递就是解决这个问题的办法，“他说。", "note_en": "The service has been in pilot testing across 100 Walmart stores in the U.S. since mid-April. Walmart says it plans to expand the service to nearly 1,000 stores in early May and it will be offered in a total of nearly 2,000 stores in the weeks after.\n Some Walmart customers may have recently received a push notification alerting them to the launch.\n   To use Express delivery, you first fill your online Walmart Grocery cart with the $30 minimum required for delivery orders or more. The Express service offers more than 160,000 items from across Walmart’s grocery, consumables and general merchandise categories. At checkout, you’ll see an option beneath the calendar where you pick a delivery date to select the Express service. In many cases, there may not be other standard delivery time slots available for the current day or even several days out, which makes the Express service even more appealing to shoppers who need their orders sooner.\n Though Walmart is officially promoting Express as a “two-hour” delivery service, in the weeks it’s been piloting the program Walmart has been able to deliver these orders within 56 minutes, on average.\n “In our tests, we were shown an Express fee of $18.90 to receive a delivery in 55 mins or less,” the app informed us today, April 30. There were no other fees. Without choosing the Express option, the next available time slot was not until next week, on Monday, May 4.\n  A price of $18.90 is close to — but is not exactly — a $10 increase over Walmart’s typical delivery fees of $7.95 or $9.95, depending on time of day. But we understand the plan is to make Express a flat $10 upcharge moving forward. (Walmart hadn’t been planning to officially announce the launch until next week, so pricing is being updated.)\n Like Walmart’s other grocery deliveries, Express deliveries are handled by Walmart’s external network of delivery partners, which vary by market. The retailer won’t comment on if those additional fees are split with their partners, or how, if so.\n  There could be backlash against a system like this, given how it favors a wealthier customer at a time when food and other critical supplies have run short. During the pandemic, store shelves have often been bare as consumers hoarded things like toilet paper, hand sanitizer and Lysol cleaners. Now, consumers are  being warned that meat shortages are expected soon.\n In addition, the pandemic has already  exposed the income divide between those who can afford to shop online and low-income customers, who can only use their SNAP benefits (food stamps) in physical stores — except in a handful of states where  a USDA pilot has been running. And now those with the means will be able to gain another advantage: paying to get to the limited supplies first.\n  For items where the inventory is so limited it can’t guarantee delivery, it’s removing their availability from the online grocery service. Plus, the retailer says it’s not pushing back standard delivery orders to accommodate the high-paying Express customers. Instead, the Express service is being made available on top of Walmart’s existing grocery pickup and delivery capacity.\n  The Express service wasn’t dreamed up because of the pandemic, Walmart says, but it did play a role in terms of the timing of the launch.\n “The demand that we’ve seen during the coronavirus pandemic is making us push forward and expedite the development of some services that we may have been thinking about,” a Walmart spokesperson explained. “But demand has pushed us to innovate more quickly,” they added.\n Walmart is not alone in experiencing a crush of online grocery orders due to the COVID-19 pandemic.\n The company and others have seen  a record number of downloads  for their grocery apps in recent weeks. In fact, demand for online grocery as well as other e-commerce orders has been so great that Walmart hired 150,000 new workers out of a pool of over a million applicants a full six weeks ahead of schedule, and is now  hiring 50,000 more.\n Meanwhile, Walmart’s online grocery rivals —  Shipt,  Instacart and Amazon —  have also been hiring hundreds of thousands of new shoppers between them.  Amazon had to implement a waitlist system for new Amazon Fresh and Whole Foods Market pickup and delivery customers due to the rise in online grocery shopping. And Instacart  made several adjustments to its app to help better prioritize orders and open up more delivery windows.\n In Walmart’s case, its ability to launch Express isn’t solely due to its new hires, we’re told.\n The company already employs a workforce of 74,000 “personal shoppers” who dedicate themselves to pulling for online grocery orders. Walmart says Express is powered by these personal shoppers, only some of whom may be the newly hired store associates.\n “We have an opportunity to serve our customers no matter what life calls for,” said Tom Ward, Walmart senior vice president, Customer Product. “Whether it be a last-minute ingredient, medicine when a fever hits or the item you didn’t know you needed when checking off your chore list, time matters. Express is a solve for that,” he said.", "posttime": "2020-05-07 04:04:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "试行,piloting,送货", "title": "沃尔玛正在试行价格更高的2小时“快递”杂货送货服务。", "title_en": "Walmart is piloting a pricier 2-hour ‘express’ grocery delivery service", "transed": 1, "url": "https://techcrunch.com/2020/04/30/walmart-is-piloting-a-pricier-2-hour-express-grocery-delivery-service/", "via": "", "real_tags": ["试行", "piloting", "送货"]}, {"category": "", "categoryclass": "", "imagename": "fc596e4e5e1ef743237f4ec0ed153a30.jpg", "infoid": 1001004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify首席执行官丹尼尔·埃克(Daniel Ek)周二表示，苹果的iPhone等平台将进一步开放。该公司过去曾批评过苹果，对其认为的对第三方服务的不公平待遇采取了法律行动。\n埃克在接受彭博社电视采访时表示：从长远来看，我们确实预计苹果会开放。“我们感到非常鼓舞的是，现在终于能够将Siri作为一种构建语音支持的方式，还可以为Apple TV和Apple Watch打造产品，这是我们直到最近才能做到的。”\n苹果的平台在历史上一直具有限制性--这是一个大胆的说法，特别是在苹果以保持对其平台的密切控制而闻名的情况下。例如，iPhone只正式支持通过其App Store下载应用程序，开发者必须遵守严格的规则，这些规则可能会让公司向苹果支付一定比例的用户订阅费。Siri语音助手还只对第三方应用程序提供有限的支持，将在2016年推出对有限选择的支持。其他限制包括对HomePod智能扬声器的有限支持，以及无法在iOS和iPadOS上设置新的默认音乐应用程序。\n但这与之前的传言不谋而合-如果这些举措取得成果，这些举措可能会帮助浪潮和Spotify等第三方音乐服务提供目前仅限于苹果音乐(Apple Music)的那种整合。这并不是谣言第一次出现--2020年2月的一份报告称，苹果正在考虑让iOS用户将非苹果应用程序设置为默认应用程序，同时为HomePod上的Spotify等服务提供更好的支持。\n如果iOS14确实有了这些变化，那么新机型的第一次展示可能会在6月底该公司的WWDC活动上进行。\nSpotify的投诉范围要广泛得多--2019年3月，Spotify向欧盟委员会(European Commission)提交了一份针对苹果的投诉，原因是该公司被认为是反竞争的做法。它还推出了一个名为TimeToPlayFair的网站，就五个关键问题批评苹果，其中包括一项政策，该政策收取30%的订阅费，并使其更难与应用内购买系统以外的用户分享交易和优惠。\n在反驳中，苹果回应了这五个问题，并声称，在使用App Store多年大幅增长业务之后，Spotify寻求保留App Store生态系统的所有好处-包括他们从App Store客户那里获得的可观收入-而不对该市场做出任何贡献。", "note_en": "Apple&#39;s platforms like the iPhone are set to open up more, Spotify CEO Daniel Ek said Tuesday. The firm has criticized Apple in the past, taking legal action against what it perceives as unfair treatment of third-party services.\n &#34;Long term, we do expect Apple to open up,&#34; Ek told   Bloomberg in a TV interview. “We’re very encouraged about being able to now finally use Siri as a way of building in voice support and also being available to build products for the Apple TV and Apple Watch, something that we haven’t been able to do until very recently.&#34;\n Apple&#39;s platforms have been historically restrictive — It&#39;s a bold claim, particularly as Apple is famed for maintaining close control over its platforms. The iPhone only officially supports downloading apps through its App Store, for example, and developers have to abide by strict rules that can leave firms giving a percentage of user subscription fees to Apple. The Siri voice assistant also only offers limited support for third-party apps, rolling out support for a limited selection in 2016. Other restrictions include limited support on the HomePod smart speaker, and the inability to set a new default music app on iOS and iPadOS.\n But it matches with previous rumors – If these moves come to fruition, the moves could help third-party music services like Tidal and Spotify offer the sort of integration currently restricted to Apple Music. It&#39;s not the first time the rumor has emerged — a  February 2020 report claimed Apple is considering the ability for iOS users to set non-Apple apps as the default, as well as offering better support for services like Spotify on the HomePod.\n If the changes do arrive with iOS 14, the first look at the new model could arrive at the end of June with the company&#39;s  WWDC event.\n  Spotify&#39;s complaints are much broader – In March 2019, Spotify  filed a complaint against Apple with the European Commission over its perceived anti-competitive approach. It also launched a website,  TimeToPlayFair, that criticizes Apple for five key issues, including a policy that takes a 30 percent cut of subscriptions and makes it harder to share deals and offers with users outside of the in-app purchase system.\n In a rebuttal, Apple  responded to the five issues and claimed that &#34;after using the App Store for years to dramatically grow their business, Spotify seeks to keep all the benefits of the App Store ecosystem — including the substantial revenue that they draw from the App Store’s customers — without making any contributions to that marketplace.&#34;", "posttime": "2020-05-07 03:37:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,app,iphone,苹果,预测", "title": "Spotify预测，苹果将向第三方服务开放iPhone", "title_en": "Apple Will Open Up the iPhone To Third-Party Services, Spotify Predicts", "transed": 1, "url": "https://www.inputmag.com/tech/apple-will-open-up-the-iphone-to-third-parties-spotify-predicts", "via": "", "real_tags": ["apple", "app", "iphone", "苹果", "预测"]}, {"category": "", "categoryclass": "", "imagename": "6adb3fe4d0c530c437975869f4c94cfa.jpg", "infoid": 1001003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Caffè地中海咖啡馆，通常被称为CaffèMed或简称为Med，是一家咖啡馆，位于美国加利福尼亚州伯克利的Telegraph大道上，靠近加州大学伯克利分校[1]。地中海是每日电讯报大道历史上的一个里程碑，多年来在欧洲旅游指南中被列为20世纪60年代创建人民公园的激进分子的聚集地，2009年在福多的旅游指南中被描述为20世纪60年代咖啡馆文化的遗迹。[3]它位于电报大道2475号，在德怀特街和黑斯特街之间。\n1956年，玛克辛·奇塔林(Maxine Chitarin)以Il Piccolo的名字成立了一家书店内的咖啡馆，1957年更名为Med。它是旧金山湾区最古老的咖啡馆之一，也是东湾最古老的咖啡馆。[4][5]。\n这家咖啡馆的网站坚称，店主之一利诺·梅奥林(Lino Meiorin)是旧金山湾区第一位接受意大利培训的咖啡师。顾客不习惯传统意大利卡布奇诺的浓烈味道，会向利诺要更多的牛奶。他会用意大利语告诉咖啡师在他们的杯子里多加些拿铁(牛奶)。最后，他想在菜单上加一杯更大的饮料，加等量的浓缩咖啡，但要加更多的蒸牛奶，并将其命名为“咖啡拿铁”(Caffèlatte)。\n在20世纪60年代，地中海以不同的赞助人群体为特色，它成为垮掉的一代艺术家、知识分子、黑人权力倡导者和参与言论自由运动和后FSM激进主义的活动家聚会的地方。[4][7][8][9]在这个时代，地中海还在两件重要的艺术作品中发挥了作用。艾伦·金斯伯格是地中海医院的常客，他很可能是在医院的办公场所写的“嚎叫”。[4][5]虽然当时的所有者最初拒绝与摄制组接触，但1967年达斯汀·霍夫曼主演的一场戏也是在地中海的一张桌子上拍摄的，窗外可以看到电报大道。[4][5]。\n许多市政府官员和商人说，这条大道自20世纪60年代以来已经失去了活力，但直到20世纪90年代，地中海大道作为交谈和咖啡因的中心而蓬勃发展。所有权的变更也造成了损失，员工们说，在这一点上，地中海大道变得更糟了，因为它靠近一个无家可归者收容所的边缘。“。[4]然而，随着2006年所有权的再次变更，地中海再次成为寻求社会变革的活动家的目的地。[4]。\n2016年11月30日，地中海因翻修而关闭。截至2020年，它还没有重新开放。[10]。\n^Gerry，Alta(2004-09-27)。伯克利的咖啡馆文化在许多场所蓬勃发展。伯克利每日星球报。，\n^a b c d e f g Kwong，Jessica(2009-01-26)。咖啡和谈话的历史咖啡馆。加州日报。\n^Brown，尼克(2016-12-12)。记住拿铁出生地和典型的反主流文化目的地Caffe Med&34；每日咖啡新闻。\n莎莉·麦克兰(1998-09-23)。咖啡馆文化：一窥伯克利深色烘焙的聚集地，在那里每个人都知道你的名字。“旧金山纪事报”。", "note_en": "Jump to navigation  Jump to search  Caffè Mediterraneum, often referred to as Caffè Med or simply the Med, was a  café located on  Telegraph Avenue in  Berkeley,  California, US, near the  University of California, Berkeley  [1]. The Med was a  landmark of Telegraph Avenue history, &#34;listed for years in  European  guidebooks as &#39;the gathering place for 1960s  radicals who created  People&#39;s Park &#39;&#34;  [2] and as of 2009 described in  Fodor&#39;s guidebook as &#34;a relic of 1960s-era café culture&#34;.  [3] It was located at 2475 Telegraph Avenue, between Dwight Way and Haste Street.\n      Established as a  coffeehouse inside a  bookstore in 1956 under the name  Il Piccolo by Maxine Chitarin before being renamed in 1957, the Med was &#34;one of the oldest coffeehouses in the  Bay Area&#34; and &#34;the oldest coffeehouse in the  East Bay&#34;.  [4]  [5]\n The café&#39;s website maintains that &#34;Lino Meiorin, one of the owners, was the first Italian-trained barista in the Bay Area. Customers were not used to the strong flavor of a traditional Italian cappuccino and would ask Lino for more milk. Speaking in Italian, he would tell the barista to put more latte (milk) in their cup. Finally he thought of putting a larger drink on the menu with the same amount of espresso but more steamed milk, and calling it a  caffè latte.&#34;  [6]\n During the 1960s, the Med featured a diverse crowd of  patrons, and it became a meeting place for  Beat Generation  artists,  intellectuals,  Black Power advocates, and  activists who were taking part in the  Free Speech Movement and post-FSM activism.  [4]  [7]  [8]  [9] During this era, the Med also played a role in two important pieces of art.  Allen Ginsberg was a regular at the Med and probably wrote   Howl on the premises of the Med.  [4]  [5] Though the owner at the time initially refused access to the film crews, a scene in 1967&#39;s   The Graduate starring  Dustin Hoffman was also  filmed at a table in the Med, with  Telegraph Avenue visible outside the window.  [4]  [5]\n Of Telegraph Avenue, &#34;many  city  officials and  merchants say the avenue has lost its  vibrancy&#34; since the 1960s, but &#34;until the 1990s, the Med thrived as a center for  conversation and  caffeine.&#34;  [4]  [8] Changes in ownership took a toll though, and at that point,  employees say the Med &#34;took a turn for the worse&#34; as it was &#34;bordering on a  homeless shelter&#34;.  [4] However, with another change in ownership 2006, the Med again became &#34;a destination for activists seeking social change&#34;.  [4]\n On November 30th, 2016, the Med closed for renovations. As of 2020 , it is yet to reopen.  [10]\n    ^   Gerry, Alta (2004-09-27).  &#34;Berkeley&#39;s Cafe Culture Thrives in Many Venues&#34;. The Berkeley Daily Planet .  ,\n  ^     a     b     c     d     e     f     g   Kwong, Jessica (2009-01-26).  &#34;Historic Cafe Grounds for Coffee and Conversation&#34;. The Daily Californian .\n  ^   Brown, Nick (2016-12-12).  &#34;Remembering Latte Birthplace and Quintessential Counterculture Destination Caffe Med&#34;.  Daily Coffee News .\n ^   McGrane, Sally (1998-09-23).  &#34;Cafe Culture: A peek into Berkeley&#39;s dark-roast hangouts, where everyone knows your name&#34;. San Francisco Chronicle .", "posttime": "2020-05-07 03:36:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地中海,cafe", "title": "地中海咖啡馆", "title_en": "Cafe Mediterraneum", "transed": 1, "url": "https://en.wikipedia.org/wiki/Caffe_Mediterraneum", "via": "", "real_tags": ["地中海", "cafe"]}, {"category": "", "categoryclass": "", "imagename": "d7e225d13edf7e2cd786795de8bd019e.jpg", "infoid": 1001002, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新西兰总理杰辛达·阿德恩表示，新西兰在未来很长一段时间内不会与世界其他国家开放边界。\n会议讨论了一个可能的跨塔斯曼泡沫，在那里人们可以在澳大利亚和新西兰之间自由旅行，而不需要检疫。\n作为应对冠状病毒的一部分，澳大利亚和新西兰都对几乎所有外国人关闭了边境。\n阿德恩表示，新西兰和澳大利亚正在讨论我们之间的某种泡沫，一个旅行安全区。\n她强调，在我们能够取得进展之前，还有很多工作要做……但这显然是因为它将带来的好处而浮出水面。\n但是，在回答有关该国旅游业的问题时，阿德恩女士说：在未来很长一段时间内，我们将不会向世界其他地区开放边境。\n旅游业是新西兰最大的产业之一，直接雇用了该国近10%的劳动力，贡献了近6%的GDP。\n阿德恩表示，任何跨塔斯曼泡沫都是可能的，这要归功于两国世界领先的行动。\n周二，新西兰连续第二天没有报告新病例。\n它总共有不到1500例确诊病例，只有20人死亡。上周，它将封锁从4级放松到3级。\n澳大利亚-大约有2500万人口，是新西兰的五倍-已经有近7000例病例和96人死亡。\n但它也使感染曲线变得平坦，各个州和地区也放松了对艾滋病的封锁。", "note_en": "New Zealand Prime Minister Jacinda Ardern says the country will not have open borders with the rest of the world for &#34;a long time to come&#34;.\n  The meeting discussed a possible &#34;trans-Tasman bubble&#34;, where people could go between Australia and New Zealand freely, and without quarantine.\n  Both Australia and New Zealand have closed their borders to almost all foreigners as part of their Covid-19 response.\n   Ms Ardern said New Zealand and Australia were discussing a &#34;bubble of sorts between us, a safe zone of travel&#34;.\n She stressed there was &#34;a lot of work to be done before we can progress...but it&#39;s obviously been floated because of the benefits it would bring&#34;.\n But, in response to a question about the country&#39;s tourism sector, Ms Ardern said: &#34;We will not have open borders for the rest of the world for a long time to come.&#34;\n  Tourism is one of New Zealand&#39;s biggest industries, directly employing almost 10% of the country&#39;s workforce, and  contributing almost 6% of GDP.\n   Ms Ardern said any &#34;trans-Tasman bubble&#34; was only possible because of &#34;the world leading actions&#34; of both countries.\n On Tuesday, New Zealand reported no new cases for the second day in a row.\n It has had fewer than 1,500 confirmed cases in total, and only 20 deaths. Last week it eased its lockdown from Level 4 to Level 3.\n Australia - which has a population of around 25 million, five times that of New Zealand - has had almost 7,000 cases and 96 deaths.\n But it, too, has &#34;flattened the curve&#34; of infections, and various states and territories have also eased their lockdowns.", "posttime": "2020-05-07 03:36:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开放,pm,新西兰", "title": "新西兰总理：在很长一段时间内没有开放边境", "title_en": "New Zealand PM: No open borders for 'a long time'", "transed": 1, "url": "https://www.bbc.com/news/world-asia-52540733", "via": "", "real_tags": ["开放", "pm", "新西兰"]}, {"category": "", "categoryclass": "", "imagename": "a9dff23df10124bd3fa456b089391170.png", "infoid": 1001000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此存储库包含一组构建器和构建包，它们专为在Google Cloud的容器平台上运行而设计：Cloud Run、GKE、Anthos、App Engine、Cloud Functions和Compute Engine Running Container-Optimed OS。它们与CNCF Buildback 100%兼容。\nBuilder包含生成包和执行生成的检测顺序的容器映像。\n构建一个可执行文件，它检查您的应用程序源代码，并制定构建和运行您的应用程序的计划。\n这是一个通用的构建器，可以创建可在大多数平台(如Kubernetes/Anthos、Kative/Cloud Run、Container OS等)上运行的容器镜像，应由大多数用户使用。构建器尝试自动检测源代码的语言，还可以通过设置GOOGLE_Function_TARGET环境变量来构建与Google Cloud Function Framework兼容的函数。\n这些构建器创建的容器镜像设计用于在Google Cloud的AppEngine和Functions服务上运行。大多数构建包与通用构建器中的构建包相同。\n与通用构建器相比，有两个主要区别。首先，还有一些附加的构建包可以添加特定于每个服务的转换。其次，为了优化执行速度，每种语言都有单独的构建器。\nGoogle Cloud Buildpack项目提供了适合与pack、kpack、tekton、skaffold和其他支持BuildPacksv3规范的工具一起使用的构建器映像。\n下面的命令调用pack以应用通用构建器在当前目录中构建应用程序，然后将结果打包到名为&lt；app-name&gt；的本地容器映像中。\n如果您的应用程序需要安装额外的系统包并在运行时可用，您可以通过定制运行容器映像来实现这一点。\ncat&gt；run.Dockerfile&lt；&lt；&lt；EOF from gcr.io/buildpacks/gcp/run user root run apt-get update&amp；&amp；apt-get install-y--no-install-Recommise\\imagemagick&amp；&apt-get lean&amp；\\rm-rf/var/lib/apt/list/*user cnb EOFdocker build-t my-run-image-。\n如果您需要某些包来构建应用程序，请基于基本构建器创建自定义构建器映像：\ncat&gt；builder.Dockerfile&lt；&lt；&lt；eOF来自gcr.io/buildpack/builder用户root运行apt-get update&amp；&amp；apt-get install-y--no-install-Recommise\\Subversion&amp；&amp；\\apt-get lean&amp；&amp；\\rm-rf/var/lib/apt/list/*user cnb EOFdocker build-t my-builder-image-f builds。\nGoogle Cloud BuildPack支持使用一组跨运行时支持的环境变量进行配置。\ngoogle_entrypoint指定执行容器时运行的命令；相当于Dockerfile中的入口点。\nGOOGLE_Function_TARGET，用于围绕Google Cloud Functions Framework构建的源代码。指定要调用的函数的名称。\n示例：myFunction将使Functions Framework调用同名的函数。\n如果指定了GOOGLE_RUNTIME，则强制运行时选择加入。如果运行时构建包出现在多个组中，将选择第一个组，这与构建包规范一致。(仅适用于安装语言运行时的构建包)。\nGOOGLE_RUNTIME_VERSION如果指定，将覆盖要安装的运行时版本。(仅适用于安装语言运行时的构建包)。\nGOOGLE_DEVMODE启用开发模式构建包。Skaffold使用它来实现实时本地开发，其中对源代码的更改会触发自动容器重建。要使用，请安装Skaffold并运行skaffold dev。\n常规：缓存是特定于项目的，而不是跨项目的。依赖项(如JDK)不能跨项目共享，需要在第一次构建时重新下载。\nJava：不可能将参数传递给maven命令(例如，特定的Maven配置文件)。\nNODE：删除现有的NODE_MODULES目录，并使用Package.json和锁定文件(如果存在)重新安装依赖项。\nGo Go 1.14在Linux内核的某些版本(5.3.15+、5.4.2+或5.5+以外的版本)中触发内核错误。如果使用受影响的版本，请在/etc/docker/daemon.json中设置以下内容：\n请注意，此项目不是官方支持的Google产品。Google Cloud的客户可以使用标准支持渠道获取与Google Cloud产品一起使用构建包的帮助。", "note_en": "This repository contains a set of builders and buildpacks designed to run onGoogle Cloud&#39;s container platforms: Cloud Run, GKE, Anthos, App Engine, Cloud Functions,and  Compute Engine runing Container-Optimized OS.They are 100% compatible with  CNCF Buildbacks.\n      Builder A container image that contains buildpacks and detection order in which builds are executed.\n Buildpack An executable that &#34;inspects your app source code and formulates a plan to build and run your application&#34;.\n  This is a general purpose builder that creates container images designed to run on mostplatforms (e.g. Kubernetes / Anthos, Knative / Cloud Run, Container OS, etc),and should be used by the majority of users. The builder attempts to autodetectthe language of your source code, and can also build functions compatible withthe  Google Cloud Function Framework by  setting the GOOGLE_FUNCTION_TARGET env var.\n     These builders create container images designed to run on Google Cloud&#39;s AppEngine and Functions services. Most of the buildpacks areidentical to those in the generic builder.\n Compared to the generic builder, there are two primary differences. First,there are additional buildpacks which add transformations specific to eachservice. Second, in order to optimize execution speed, eachlanguage has a seperate builder.\n  The Google Cloud Buildpacks project provides builder images suitable for usewith pack, kpack, tekton, skaffold,and other tools that support the Buildpacks v3 specification.\n  The following command invokes  pack toapply the general builder to build the application in the current directory, and then containerizes the result into a local container image named  &lt;app-name&gt;.\n         If your application requires additional system packages to be installed andavailable when it runs, you can accomplish this by customizing the  runcontainer image.\n cat  &gt; run.Dockerfile   &lt;&lt;  EOF FROM gcr.io/buildpacks/gcp/run USER root RUN apt-get update &amp;&amp; apt-get install -y --no-install-recommends \\  imagemagick &amp;&amp; \\  apt-get clean &amp;&amp; \\  rm -rf /var/lib/apt/lists/* USER cnb  EOFdocker build -t my-run-image -f run.Dockerfile  .\n    If you require certain packages for  building your application, create a custombuilder image based on the base builder:\n cat  &gt; builder.Dockerfile   &lt;&lt;  EOF FROM gcr.io/buildpacks/builder USER root RUN apt-get update &amp;&amp; apt-get install -y --no-install-recommends \\  subversion &amp;&amp; \\  apt-get clean &amp;&amp; \\  rm -rf /var/lib/apt/lists/* USER cnb  EOFdocker build -t my-builder-image -f builder.Dockerfile  .\n    Google Cloud Buildpacks support configuration using a set of  environmentvariables that are supported across runtimes.\n GOOGLE_ENTRYPOINT Specifies the command which is run when the container is executed; equivalent to  entrypoint in a Dockerfile.\n GOOGLE_FUNCTION_TARGET For use with source code built around the  Google Cloud Functions Framework. Specifies the name of the function to be invoked.\n Example:  myFunction will cause the Functions Framework to invoke the function of the same name.\n GOOGLE_RUNTIME If specified, forces the runtime to opt-in. If the runtime buildpack appears in multiple groups, the first group will be chosen, consistent with the buildpack specification.  (only works with buildpacks which install language runtimes).\n GOOGLE_RUNTIME_VERSION If specified, overrides the runtime version to install. (only works with buildpacks which install language runtimes)\n  GOOGLE_DEVMODE Enables the development mode buildpacks. This is used by  Skaffold to enable live localdevelopment where changes to your source code trigger automatic container rebuilds. To use, install Skaffold and run  skaffold dev.\n  General: Caching is project-specific, not cross-project. Dependencies, such as the JDK, cannot be shared across projects and need to be redownloaded on first build.\n Java: It is not possible to pass arguments to the maven command (for example, a specific Maven profile)\n Node: Existing  node_modules directory is deleted and dependencies reinstalled using package.json and a lockfile if present.\n Go Go 1.14 triggers a kernel bug in some versions of the Linux kernel(versions other than 5.3.15+, 5.4.2+, or 5.5+). If using an affected version,please set the following in your /etc/docker/daemon.json:\n   Please note that this project is not an officially supported Google product.Customers of Google Cloud can use  standard support channelsfor help using buildpacks with Google Cloud Products.", "posttime": "2020-05-07 03:35:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,cloud,构建", "title": "Google Cloud BuildPack", "title_en": "Google Cloud Buildpacks", "transed": 1, "url": "https://github.com/GoogleCloudPlatform/buildpacks", "via": "", "real_tags": ["google", "cloud", "构建"]}, {"category": "", "categoryclass": "", "imagename": "455b755b67aef55fcf98b4e5cca766c2.png", "infoid": 1000999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个开放源码库包含标准的CodeQL库和查询，这些库和查询支持LGTM和GitHub向其全球客户提供的其他CodeQL产品。\n有大量关于编写CodeQL的入门文档。您可以使用LGTM.com上的交互式查询控制台或CodeQL for Visual Studio代码扩展来试用您对当前正在分析的任何开源项目的查询。\n我们欢迎向我们的标准库和标准支票捐款。您是否有新检查的想法，或者如何改进现有查询？那么请继续，打开拉取请求吧！不过，在您这样做之前，请花时间阅读我们的投稿指南。您还可以参考我们的样式指南，了解如何格式化代码以确保一致性和清晰性，如何编写查询元数据，以及如何为您的查询编写查询帮助文档。\n如果您使用Visual Studio代码在此存储库中工作，则有一些集成功能可以简化开发。\n您可以安装CodeQL for Visual Studio代码扩展，以获得QL语言的语法突出显示、智能感知和代码导航，以及对测试CodeQL库和查询的单元测试支持。\nvscode/tasks.json文件定义特定于在此存储库中工作的自定义任务。要调用这些任务之一，请选择终端|运行任务.。菜单选项，然后从下拉列表中选择所需的任务。您还可以从命令选项板调用Tasks：Run Task命令。", "note_en": "This open source repository contains the standard CodeQL libraries and queries that power  LGTM and the other CodeQL products that  GitHub makes available to its customers worldwide.\n  There is  extensive documentation on getting started with writing CodeQL.You can use the  interactive query console on LGTM.com or the  CodeQL for Visual Studio Code extension to try out your queries on any open source project that&#39;s currently being analyzed.\n  We welcome contributions to our standard library and standard checks. Do you have an idea for a new check, or how to improve an existing query? Then please go ahead and open a pull request! Before you do, though, please take the time to read our  contributing guidelines. You can also consult our  style guides to learn how to format your code for consistency and clarity, how to write query metadata, and how to write query help documentation for your query.\n    If you use Visual Studio Code to work in this repository, there are a few integration features to make development easier.\n  You can install the  CodeQL for Visual Studio Code extension to get syntax highlighting, IntelliSense, and code navigation for the QL language, as well as unit test support for testing CodeQL libraries and queries.\n  The  .vscode/tasks.json file defines custom tasks specific to working in this repository. To invoke one of these tasks, select the  Terminal | Run Task... menu option, and then select the desired task from the dropdown. You can also invoke the  Tasks: Run Task command from the command palette.", "posttime": "2020-05-07 03:35:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,代码,codeql", "title": "GitHub代码QL", "title_en": "GitHub CodeQL", "transed": 1, "url": "https://github.com/github/codeql", "via": "", "real_tags": ["github", "代码", "codeql"]}, {"category": "", "categoryclass": "", "imagename": "6f48750af0b0914923235f838c6c9a01.png", "infoid": 1000998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章是继2019年10月报告之后的特别报道，提供了关于冠状病毒早期GitHub上的开发者活动的趋势和见解。分析由GitHub数据科学团队为您带来。\n注：本报告最好在大屏幕上查看。包含的图表和图形未针对移动查看进行优化。\n冠状病毒给人们带来了一种突如其来的、全球性的呆在家里的需求。这迫使许多组织尽可能支持远程工作，在短短几天内改变了数百万人的日常生活和环境。这种转变意味着开发人员和其他技术专业人员正在过渡到远程优先的世界，许多人在照顾孩子或其他家庭成员的同时，找到了新的工作节奏，并重新定义了平衡(或仅仅维持)工作和生活的意义。\n这种转变对我们作为开发人员的工作有何影响？本报告围绕三个可随时获得数据的主题展开：工作效率和活动、工作节奏和协作。在我们的发现中，我们为软件开发人员和公司领导人提供了见解，并对领导新分布的团队通过不确定性提出了建议。\n作为全球最大的开发者平台，GitHub在看到开发者活动的模式和变化方面处于独特的地位。我们进行此分析并共享此报告的目的是帮助社区了解开发人员活动中正在发生的事情，以便我们更好地做好准备并能够适应未来的业务中断。我们计划在今年晚些时候的“十月份状况”年度报告中继续并扩展这些分析。这将让我们看到我们看到的趋势可能随着时间的推移发生了怎样的变化，所以请继续关注。\n当我们将2020年前三个月与2019年同期进行比较时：\n与去年相比，开发者的活动基本保持一致或有所增加。开发者的活动--包括推送、拉取请求、审阅的拉取请求和每个用户评论的问题--显示出每年的活跃度略有增加。这表明，开发商在面对不确定性时继续做出贡献，并表现出韧性。\nGitHub问题中的流量可能反映了向分布式工作和本地病毒响应的转变。我们的分析表明，企业存储库中的GitHub问题围绕冠状病毒爆发和就地避难订单起伏不定。问题中出现的变化很可能是由于转向分布式工作，这打乱了企业软件开发的仪式、结构和协调。在GitHub上，这种协调通常是通过问题来完成的，团队在那里跟踪增强功能、任务和错误。\n工作的节奏已经改变了。无论是在工作日还是周末，开发人员的工作日每天都增加了高达一个小时。更长的工作时间也可能是非工作中断(比如家庭或照看孩子)的结果，因为现在很多人都在家里工作。\n开发人员的活动模式会导致工作倦怠。在向新工作例程的过渡过程中，持续的开发人员活动可能会通过花更多的时间在线来实现。如果额外的工作是以牺牲个人时间和休息来补充、思考和保持健康的分离为代价的，我们警告这种权衡可能在长期内是不可持续的。\n人们正在进行更多的合作，特别是在开源项目上。有几个开源项目的活跃度激增，与去年相比，合并开源项目的拉式请求的时间有所减少。这些迹象表明，社区在一起在开源项目上花费了更多的时间。\n通过灵活性加强组织。我们的分析表明，人们对变化是有弹性的：即使在这场危机中，开发人员的活动也是一致的或上升的。能够调整他们的流程和程序，并像他们的团队一样迅速接受新的工作方式的组织也将具有弹性和成功。为此做好准备包括引入灵活的工具和流程来计划和跟踪工作，如增强功能、任务、功能和错误，这将有助于在任何地方支持开发人员的工作效率。\n拥抱协作和开源。人们正转向他们的开源社区，将其作为学习、成长和参与的一种方式。就个人而言，我们可以认识到这是一种创造力和学习的出口-想方设法在精神上“离开”我们的工作，然后“进入”我们的创意或学习项目-即使它们可能都发生在同一个电脑屏幕上。组织应检查有关外部工作和技术的政策，以确保它们有时间参与学习计划，并确保兼职政策允许外部项目。认识到开源不仅仅是一个用于工作的平台，这对员工的福祉很重要。\n小心精疲力竭。更长的工作日，更多的工作，更多的家庭责任意味着更有可能产生倦怠。休息一下，试着创造一个可持续的工作量(对你自己和你的团队来说)，创建一个支持性的工作社区，其中包括明确的工作和个人时间界限。\n本报告中每个主题的分析都是在不同的数据集上进行的，选择这些数据集是为了回答该部分提出的研究问题。您将在这样的框中看到数据的描述。主题#3包括两个描述。在本报告的最后，我们描述了我们分析的总体背景(GitHub用户数据)、我们的研究设计决策和限制，以及即将进行的研究。\n许多像视频会议这样的技术平台都报告说，自从冠状病毒(如Zoom和微软团队)以来，活跃度有所增加。虽然这些统计数据是我们如何与同事和客户沟通和会面的有趣一瞥，但这可能只是人们将会议从面对面转移到在线空间的证据。\n如果我们想了解人们的工作--或者在这种情况下，在冠状病毒爆发期间人们工作发生的变化--我们可以直接问他们(在采访或调查中)，或者查看他们在工作时创建的工件(例如笔记本、源代码或系统日志)。为了调查开发人员的生产力和活动，我们分析了GitHub开发人员的活动。\n像生产力这样的复杂结构不能用简单的或单一的度量(如代码行或关闭的问题)来捕获。这些衡量标准没有考虑到工作任务的影响、复杂性或结果的重要性。最近的研究发现，开发人员的生产力是几件事情的组合，包括花在代码上的时间、完成代码和审查代码(Meyer等人。2014年)。我们的分析采用了类似的方法：通过包括开发人员活动的几个度量，我们提出了开发人员生产力的综合度量，并反映了开发人员自己的看法(Meyer等人)。2014年)。\nGitHub上的开发活动是对转换工作例程相当健壮的活动的一个很好的代理。虽然看板之类的一些东西可能已经从白板转移到了在线工具，但无论我们是在办公室还是在家里做这些工作，都可以通过相同的推送、拉取请求和问题来观察发展。这意味着我们的同比比较是可靠的。\n相比之下，当人们不能面对面会面时，即使会议数量保持不变，视频会议的使用也会增加。这使得对以前不在家工作的人来说，每年的比较是不可靠的。\n该报告这一部分的数据来自于对所有GitHub平台活动-公共(包括开源)和私人活动-的年度分析。对比时间分别为2019年1月1日-2019年3月31日与2020年1月1日-2020年3月31日，分析中包含的活跃用户地域分布同比变化如下。\n图：主题#1分析中包含的地理位置：活跃用户分布2019年1月至2020年3月。\n为了便于进行同比比较，除非另有说明，否则我们将在本报告中使用每个用户的数据来规范我们的分析。\n对于开发人员生产力的综合测量，我们调查了每个用户的拉请求、推请求、审查拉请求和评论问题。总体而言，与去年相比，我们看到这些措施的活动保持一致或有所增加。\n我们首先显示每个用户每天的拉取请求。正如图表中所指出的，活动量的定期下降与周末相对应。\n如果我们去掉周末，我们的图表会更平滑，可读性也会更好。这是每个用户每天创建的拉流请求，不包括周末：\n接下来，我们将显示带有此标准化活动(每个用户)和平滑(没有周末)的图表，以简化可读性，除非另有说明。\n我们的调查还包括审查的拉取请求和评论问题，模式相似：高于去年，并在2020年前三个月保持一致。为简明起见，我们没有包括已审核的拉式请求或评论问题图表。\n乍一看，这表明开发人员的活动在大流行的最初浪潮中保持一致或略有增加，并转向在家工作。然而，对主题#2的进一步研究揭示了工作的时间安排和节奏，并为开发人员如何实现这些活动级别提供了更多的洞察力。\n我们还通过查看每个用户的GitHub问题来衡量开发人员的活动。与2019年相比，在2020年的大部分时间里，GitHub上每个用户每天创建的问题低于或等于这个数字，2月份下降。正如图表中的箭头所示，这种情况在3月中旬开始转变，并持续到整个月。同样，图表显示没有周末。\n我们对这一转变进行了额外的调查，发现所有存储库的问题创建率都在上升，其中免费用户和付费团队账户拥有的存储库的增幅最大。下表显示了存储库计划与去年(同样不含周末)相比创建的问题数量：\n查看对比图时，企业云账户所拥有的存储库在今年前三个月的活动给了我们一些有趣的见解。请注意，问题创建量中有两个有趣的模式：第一，截至2月中旬，问题创作量明显减少(由图表中标记为A的箭头表示)。这与亚洲和欧洲遭受冠状病毒袭击的时期相对应，北美西海岸开始转向在家工作。2月底和3月初显示活动恢复到去年的水平，周末企业存储库的活跃度继续下降。这些周末活动的减少并没有反映在免费用户和付费团队帐户拥有的存储库中，这可能是意料之中的，因为这些存储库更有可能包含开放源码和项目工作。然后，我们看到问题超过了去年的活跃度水平，尽管没有免费用户和付费团队帐户拥有的存储库中看到的峰值那么高(用图表中标有B的箭头标出)。在调整到远程工作之后，这可能标志着恢复企业软件开发中涉及的活动。\n为什么企业的问题创造会有这样的波动？了解GitHub问题是如何使用的，有助于深入了解可能发生的情况：问题用于沟通和规划。它们是跟踪任务、增强功能、功能和错误的用户数量。在我们的个人或爱好发展中，我们可能不会不厌其烦地做计划(或者至少不把它记录在一期杂志上-我们可能只会把它贴在便条上)。但是，企业开发通常更加结构化和协调，规划更大、更复杂的项目和功能，并且需要跨团队进行沟通。问题将推动这项工作，并可能对围绕我们工作的仪式的变化或中断更加敏感。\n我们在问题中看到的波动可以归因于围绕软件开发的现有计划过程的中断，以及转移到远程工作和新的“被迫”的分布式团队。一种可能的说明性方案可能是：\n随着团队争先恐后地在家工作，创建更多工作(记录问题)的会议变慢或停止。问题保持不变。\n当开发人员转向远程工作时，他们继续解决已经记录的问题。问题慢慢减少。\n团队学会了在分布式环境中重新创建仪式，比如临时会议、分布式看板或站立。问题保持稳定或缓慢增加。\n当团队调整到远程工作或没有可处理的问题时，他们通过将即将到来的任务放入问题中来快速恢复跟踪和规划开发，接受让问题再次概述即将到来的工作的结构和可预测性。问题激增。\n我们很高兴看到这种相对较快的复苏，这可能是我们在2月份看到的强劲下跌的初步反弹。鉴于转移和适应新工作的要求和要求所需的复杂性，再加上普遍的经济不确定性和延长的就地避难所订单，我们预计波动将持续并在整个夏季稳定下来。\n查看工作活动的模式并不能让我们完整地了解开发人员的一天。为了更好地了解冠状病毒是如何影响开发人员的，我们还调查了工作可能发生的变化。\n通常在家工作的人倾向于工作更长的时间--每周多工作一到两天，每天工作8小时(Hill等人。2010)。这很可能是因为我们的工作开始延伸到我们的生活中，工作和家庭之间的界限变得模糊了。随着向远程工作的突然转移，我们想知道我们是否也会看到任何增加开发工作的模式。\n报告此部分的数据来自对符合以下标准的付费组织帐户的分析：\n我们的分析包括40，000多家组织，其中北美(40%)、欧洲(35%)和亚洲(17%)的代表性最强，如下图所示：\n图：主题#2分析中包括的地理位置：2019年1月至2020年3月活跃付费账户的分布。\n工作日被捕获为第一次和最后一次git推送到存储库默认分支之间的时间差。这是一天工作时间的粗略近似值，为我们提供了一种思考工作日开始和结束时间的方法。\n对于此分析，我们将调查范围缩小到美国的两个时区(太平洋和东部)，并同时考虑了工作日和工作量。我们之所以选择这两个时区，是因为每个海岸都发布了相当协调的就地避难所订单，而中西部则没有-这意味着任何影响都更有可能出现在数据中-而且我们的样本量足够大，不会受到少数几个组织的过度影响。\n我们通过观察美国太平洋时区的发展活动节奏开始了我们的调查。在这项分析中，我们看到工作日与去年相比有不同的长度，然后从3月中旬开始显著增加(通常每天30-60分钟)。工作日时间的增加很大程度上是在周末。\n图表：第一次和最后一次推送之间的同比变化，平均值(包括周末)。太平洋时区\n为了加强这一分析，我们调查了开发人员在同一时间段内所做的工作量。这帮助我们理解了开发人员的工作日是否会在做同样数量的工作时变得更长。也就是说，也许开发人员每天工作的班次较少，以适应家庭或照看孩子，但做的工作量与以前大致相同。(例如，在我们的代理测量中，3个3小时的区块分布在12小时内，相当于12小时的工作日，但相当于传统的9小时工作日，即8小时的工作加上1小时的午餐，当不必适应紧张的时间表时)。因此，我们还调查了他们在该时间范围内推送代码的频率，以此作为完成工作量的粗略代理。我们称之为工作量。\n我们看到太平洋时区的用户与去年相比，他们的工作量一直在增加。这一分析表明，对于这些用户来说，他们工作的时间更长，做的开发工作也更多，特别是在3月份。这可能会受到那些通常通勤上班的人的影响，因为现在他们在家工作，所以“恢复”了这段时间。虽然这段时间可以分为家庭任务和工作活动，但开发人员可能会感受到更频繁地推动的压力，从而在数据中显示出这种增加的工作量，这是由于以下几个因素：经济不确定性和做好工作并保持就业的愿望，将工作作为消遣来对抗困在家里的无聊情绪，来自管理层将产品推向市场的压力，或者经常推动以保持快速稳定的软件交付节奏的团队规范。\n图表：推送量同比变化，平均(包括周末)。太平洋时区。\n接下来，我们将分析转移到美国东海岸，并观察到这里的用户在2020年的大部分时间里工作日都缩短了，然后从3月中旬开始增加到与太平洋时区相似的工作日(虽然缩短了15-30分钟)。同样，这种工作日长度的增加很大程度上是在周末观察到的。\n图表：第一次推送与最后一次推送之间的同比变化，平均值(包括周末)。东部时区。\n当观察这些工作日的工作量时，我们看到东海岸时区的用户推送量有所增加，2月份之后开始下降。这一分析表明，这些用户正在进行更多的工作分配，特别是在这些趋势与就地避难所订单相关的情况下。\n图表：推送量同比变化，平均(包括周末)。东部时区。\n我们的分析表明，开发人员正在继续进行持续的甚至增加的开发量，一些人可能会为此欢呼，因为这证明了在面临不确定性的情况下，生产力仍在继续。然而，结合我们的工作节奏分析，我们警告开发人员、领导者和组织应该采取积极的步骤来防止倦怠，并在他们的团队和同事中保持警惕。\n世界卫生组织(World Health Organization)已将职业倦怠视为“一种由于长期工作场所压力而导致的职业现象，没有得到成功的管理。”虽然职业倦怠专门指的是工作场所的压力，但当我们的工作侵犯了我们的个人空间时，现在可能很难管理。\n无论是在工作中还是在个人生活中，应对倦怠对我们的精神健康都很重要。支持灵活和可持续的工作时间表并关注倦怠的团队和领导者将拥有更快乐、更有生产力的同事和团队。记住，我们都是同舟共济的。\n有关工作倦怠的更多信息以及你可以做些什么来解决它，我们建议你参考工作倦怠专家克里斯蒂娜·马斯拉赫(Christina Maslach)博士的文章《了解工作倦怠》。如果您愿意，您可以收看或收听她在拉斯维加斯2018年DevOps企业峰会上的会议演讲。\n编写软件本质上是一项合作的工作，尽管流行文化中对开发人员的许多描述都显示这是一项单独的活动。不要误会我们的意思：自己解决问题可能很有趣，也很令人满意，但与团队或社区合作，共同创造一些东西，这是一种特殊的魔力。\n转向远程工作已经使我们的工作方式发生了很大变化：沟通和协调仪式不同，人工制品可能已经从面对面的白板和便签改变了。\n..", "note_en": "This article is a special report following the 2019 Octoverse report, providing trends and insights into developer activity on GitHub in the early days of COVID-19. The analysis is brought to you from the GitHub Data Science Team.\n Note: This report is best viewed on a large screen. The included charts and graphics are not optimized for mobile viewing.\n            COVID-19 brought a sudden—and global—need for people to stay home. This pressed many organizations to support remote work wherever possible, changing the routines and environment of millions of people in a matter of days. This shift means developers and other technology professionals are transitioning to a remote-first world, many while also caring for children or other family members, finding a new work cadence, and redefining what it means to balance (or merely maintain) both work and life.\n How has this shift affected our work as developers? This report centers on three themes for which data is readily available: productivity and activity, work cadence, and collaboration. In our findings, we offer insights for software developers and company leaders, and suggest implications for leading newly distributed teams through uncertainty.\n As the largest global developer platform, GitHub is in a unique position to see patterns and changes in developer activity. Our goal in conducting this analysis and sharing this report is to help the community understand what is happening in developer activity so we’re better prepared and able to adapt to future business disruptions. We plan to continue and extend these analyses later this year in our annual  State of the Octoverse report. This will allow us to see how the trends we see may have changed over time, so stay tuned.\n  When we compare the first three months of 2020 to the same time period in 2019:\n Developer activity remains largely consistent or increased compared to last year. Developer activity—including pushes, pull requests, reviewed pull requests, and commented issues per user—shows slightly increased activity year over year. This suggests that developers have continued to contribute and show resilience in the face of uncertainty.\n Flux in GitHub issues likely reflect the shift to distributed work and local virus responses. Our analysis shows that GitHub issues in enterprise repositories rise and fall around COVID-19 outbreaks and shelter-in-place orders. The flux seen in issues is likely due to the move to distributed work, which disrupted the ceremony, structure, and coordination of enterprise software development. On GitHub, that coordination is often done with issues, where teams track enhancements, tasks, and bugs.\n The cadence of work has changed . Developers’ work days have gotten longer by up to an hour per day, on both weekdays and weekends. Longer days may also be a result of non-work interruptions (like family or childcare) now that many are working from home.\n Patterns of developer activity have implications for burnout. During this transition to new work routines, sustained developer activity may be happening through more time spent online. If additional work is happening at the expense of personal time and breaks to replenish, ponder, and maintain healthy separation, we caution this tradeoff may not be sustainable in the long run.\n People are collaborating more, especially on open source projects. Several open source projects have seen a spike in activity, and the time to merge a pull request on open source projects has dropped compared to last year. These signs suggest the community is spending more time on open source projects together.\n  Strengthen organizations through flexibility. Our analysis shows that people are resilient to change: developer activity was consistent or up, even through this crisis. Organizations that can adapt their processes and procedures—and embrace new ways of working as quickly as their teams—will be resilient and successful, too. Preparing for this includes introducing flexible tools and processes to plan and track work such as enhancements, tasks, features, and bugs, which will help support developer productivity anywhere work happens.\n Embrace collaboration and open source. People are turning to their open source community as a way to learn, grow, and engage. Individually, we can recognize this as an outlet for creativity and learning—finding ways to mentally “step away” from our work and then “step into” our creative or learning projects—even though they may both be happening on the same computer screen. Organizations should examine policies around external work and technology to ensure they allow time to engage with learning programs and that moonlighting policies allow for external projects. Recognizing that open source is a platform for more than just work is important for employees’ well-being.\n Watch for burnout. Longer work days, more work, and more responsibilities at home means there is an increased likelihood of burnout. Take breaks, try to create a sustainable workload (for yourself and your team), and create a supportive work community that includes clear boundaries for work and personal time.\n The analysis for each theme in this report is conducted on a different dataset, selected to answer the research questions posed in that section. You’ll see a description of the data in a box like this. Theme #3 includes two descriptions.  At the end of this report , we describe the overall context of our analysis (GitHub user data), our research design decisions and limitations, and upcoming research.\n   Many technology platforms like video conferencing have reported an increase in activity since COVID-19 (like  Zoom and Microsoft Teams). And while these statistics are an interesting glimpse into how we communicate and meet with our colleagues and customers, this could simply be evidence of people shifting meetings from in-person to online spaces.\n If we want to understand people’s work—or in this case, changes to people’s work that happen during the COVID-19 outbreak—we can ask them directly (in interviews or surveys) or look at the artifacts created when they do their work (such as notebooks, source code, or system logs). For our investigation of developer productivity and activity, we analyze GitHub developer activity.\n A complex construct such as productivity can’t be captured with simple or single metrics like lines of code or issues closed. These measures don’t capture the importance of impact, complexity, or outcome of work tasks. Recent research finds that  developer productivity is a combination of several things, including time spent on code, completing code, and reviewing code ( Meyer et al. 2014). Our analysis adopts a similar approach: by including several measures of developer activity, we present a composite measure of developer productivity and reflect developers’ own perceptions ( Meyer et al. 2014).\n Development activity on GitHub is a good proxy for activity that is fairly robust to shifting work routines. While some things like kanban boards may have moved from whiteboards to online tools, development can be observed via the same pushes, pull requests, and issues regardless of whether we do that work from an office or at home. This means our year-over-year comparisons are reliable.\n In contrast, the use of video conferencing increases when people can’t meet in person, even if the number of meetings stays the same. This makes year-over-year comparisons unreliable for people who were not previously working from home.\n The data for this section of the report comes from analyzing all GitHub platform activity—public (including open source) and private activity—year over year. The period of comparison is January 1, 2019 – March 31, 2019 vs. January 1, 2020 – March 31, 2020 respectively.  The change in the geographic distribution of active users included in the analysis year over year is shown below.\n  Figure: Geographies included in Theme #1 analysis: Distribution of active users January 2019 – March 2020\n  To allow for easier year-over-year comparisons, we will normalize our analysis by using figures per user for this report, unless noted otherwise.\n  For our composite measure of developer productivity, we investigated pull requests, pushes, reviewed pull requests, and commented issues per user. Overall, we see consistent or increased activity for these measures compared to last year.\n We start by showing pull requests per user per day. As noted in the chart, the regular dips in activity correspond to weekends.\n   If we remove weekends, it gives us a smoother chart and eases readability. This is pull request creation per user per day, with weekends removed:\n   Moving forward, we will show charts with this normalized activity (per user) and smoothed (without weekends) to ease readability, except where otherwise noted.\n    Our investigation also includes reviewed pull requests and commented issues, and the pattern is similar: higher than last year and consistent across the first three months of 2020. We have not included the reviewed pull requests or commented issues chart for the sake of brevity.\n At first glance, this suggests that developer activity has stayed consistent or slightly increased throughout the initial wave of the pandemic and shift to working from home. However, further investigation in  Theme #2 sheds light into the timing and cadence of work and provides additional insight into how developers are accomplishing these levels of activity.\n  We also measure developer activity by looking at GitHub issues per user. When compared to 2019, daily issue creation per user on GitHub is lower or equal for most of 2020 and dips lower in February.  This started to shift in mid-March and  continues  throughout the month, as noted by the arrow in the chart. Again, the chart is shown without weekends.\n   We conducted additional investigation into this shift, and see it alongside an increase in issue creation rates across all repositories, with the biggest increase seen in repositories owned by free user and paid team accounts. The following chart shows the volume of issues created by repository plan vs. last year (again without weekends):\n   When looking at the comparison chart, the activity in repositories owned by Enterprise Cloud accounts for the first three months of the year gives us some interesting insights. Notice two interesting patterns in issue creation volume: First, there was a noticeable decrease in issue creation through the middle of February (noted by the arrow marked  A in the chart). This corresponds to the time period when Asia and Europe were hit by COVID-19, and North America’s West Coast began shifting to working from home. Late February and early March showed a return to last year’s levels of activity, with continued dips for enterprise repositories on the weekends. These weekend dips in activity are not reflected in repositories owned by free user and paid team accounts, which may be expected given these repositories are more likely to contain open source and project work. We then see issues exceed last year’s levels of activity, though not as high as the spikes seen among repositories owned by free user and paid team accounts (noted by the arrow marked  B in the chart). This may signal resuming the activities involved in enterprise software development following an adjustment to remote work.\n Why the swings in issue creation for enterprises? Understanding how GitHub issues are used offers insights into what may be happening: Issues are used for communication and planning. They are how many users track tasks, enhancements, features, and bugs. In our personal or hobby development, we may not go to the trouble of doing planning (or at least not logging it in an issue—we may just put it on a sticky note). However, enterprise development is usually much more structured and coordinated, planning larger and more complex projects and features, and requiring communication across teams. Issues will drive this work and are likely more sensitive to changes or disruptions in the ceremonies that surround our work.\n The swings we saw in issues could be attributed to the disruption in the existing planning process around software development and the move to remote work and newly “forced” distributed teams. A probable explanatory scenario could be:\n As teams scrambled to work from home, meetings to create more work (logged in issues) slowed or stopped.  Issues remain unchanged.\n Developers continued to work through already logged issues as they shifted to remote work.  Issues slowly decrease.\n Teams learned to re-create ceremonies in distributed environments, like ad-hoc meetings, distributed kanban, or standups.  Issues remain stable or slowly increase.\n As teams adjusted to remote work or ran out of issues to work on, they quickly resumed tracking and planning development by putting upcoming tasks into issues, embracing the structure and predictability of having issues outlining upcoming work again.  Issues spike.\n We’re happy to see this relatively fast recovery, which may be an initial rebound to the strong dip we saw in February. Given the complexity required to shift and adapt to the demands and requirements of new work, combined with the general economic uncertainty and extended shelter-in-place orders, we anticipate fluctuations to continue and settle through the summer.\n   Looking at patterns of work activity doesn’t give us a complete picture of a developer’s day. To better understand how COVID-19 is impacting developers, we also investigated how work may have shifted.\n People who typically work from home tend to work more hours—up to one or two 8-hour days more per week ( Hill et al. 2010). This is likely because our work begins to stretch into our lives, and the boundaries between work and home blur. With the sudden shift to remote work, we wondered if we would see any patterns of increased development work as well.\n The data for this section of the report comes from analyzing paid organization accounts that meet the following criteria:\n  More than 40,000 organizations were included in our analysis, with strongest representation in North America (40%), Europe (35%), and Asia (17%) as shown in the following figure:\n  Figure: Geographies included in Theme #2 analysis: Distribution of active paid accounts, January 2019 – March 2020\n  A work day was captured as the time difference between the first and the last  git push to the repository’s default branch. This is a rough approximation for length of day worked and gives us one way to think about when a work day starts and ends.\n For this analysis, we narrowed our investigation to two time zones in the US (Pacific and Eastern), and looked at both work days and work volume. We selected these two time zones because the coasts each issued fairly coordinated shelter-in-place orders while the Midwest did not— meaning any impacts are more likely to show up in the data—and our sample size was large enough to be significant and not be overly influenced by a few organizations.\n  We began our investigation by looking at development activity cadence in the US Pacific Time Zone. In this analysis, we saw work days have variable lengths compared to last year and then significantly increase starting mid-March (typically 30-60 minutes per day). Much of this increase in work day length is seen on weekends.\n  Chart: Year over year change between first and last push, average (weekends included). Pacific Time Zone\n To augment this analysis, we investigated the volume of work being done by developers over this same time period. This helped us understand if developers’ workdays might be stretching longer while doing the same amount of work. That is, perhaps developers are working in smaller shifts spread out over the day to accommodate family or childcare, but doing approximately the same amount of work as before. (For example, three three-hour blocks spread out over 12 hours equates to a 12-hour workday with our proxy measure but is equivalent to a traditional nine-hour workday, which is eight hours of work with a one hour lunch, when not having to accommodate a stretched schedule). Therefore, we also investigated how often they pushed code in that timeframe as a rough proxy of amount of work done. We call this work volume.\n We saw that users in the Pacific Time Zone have consistently increased their work volume compared to last year. This analysis suggests that, for these users, they are working longer days and doing more development work, particularly in March.  This is likely impacted by those who typically commute to an office “recovering” that time now that they work from home. While this time could be split between home tasks and work activity,  developers may be feeling pressure to push more often, and thereby showing this increased work volume in the data due to several factors: economic uncertainty and the desire to do well and stay employed, using work as a distraction to combat boredom when stuck at home, pressure from management to get products to market, or team norms to push frequently to maintain fast and stable software delivery cadences.\n  Chart: Year over year change in volume of pushes, average (weekends included). Pacific Time Zone\n  Next, we moved our analysis to the US East Coast, and observed that users here have seen shorter work days for much of 2020, and then an increase to the work day similar to the Pacific Time Zone starting mid-March (although shorter by 15-30 minutes). Again, much of this increase in work day length is observed on weekends.\n  Chart: Year over year change between first push and last push, average (weekends included). Eastern Time Zone\n When looking at work volume that accompanies these work days, we saw that users in the East Coast Time Zone have an increased push volume that begins to decline after February. This analysis suggests that these users are doing more distribution of work, particularly as these trends correlate with shelter-in-place orders.\n  Chart: Year over year change in volume of pushes, average (weekends included). Eastern Time Zone\n Our analysis suggests that developers are continuing to do sustained and even increased amounts of development, which some may cheer as evidence that productivity has continued in the face of uncertainty. However, combined with our work cadence analysis, we caution that developers, leaders, and organizations should take proactive steps to prevent burnout, and watch for it among their teams and peers.\n The  World Health Organization has recognized burnout as “an occupational phenomenon resulting from chronic workplace stress that has not been successfully managed.” While burnout specifically refers to workplace stress, it can be difficult to manage right now when our work is invading our personal space.\n Dealing with burnout is important for our mental well-being, both in the workplace and in our personal lives. Teams and leaders that support flexible and sustainable work schedules and watch for burnout will have colleagues and teams that are happier and more productive. Remember, we’re all in this together.\n For more on burnout and what you can do to address it, we point you to the article  Understanding Job Burnout from Dr. Christina Maslach, an expert on workplace burnout. If you prefer, you can  watch or listen to her conference talk from DevOps Enterprise Summit 2018 in Las Vegas.\n   Writing software is an inherently collaborative endeavor, even though so many depictions of developers in pop culture show it as a solitary activity. Don’t get us wrong: It can be fun and satisfying to solve problems on our own, but there’s a special magic in working with a team or community to build something together.\n Shifting to remote work has changed a lot about the way we work: The communication and coordination ceremonies are different, and the artifacts may have changed from in-person whiteboards and sticky notes \n......", "posttime": "2020-05-07 03:35:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,github,providing", "title": "提供有关GitHub上开发人员活动的趋势和见解的报告", "title_en": "A report providing trends and insights into developer activity on GitHub", "transed": 1, "url": "https://github.blog/2020-05-06-octoverse-spotlight-an-analysis-of-developer-productivity-work-cadence-and-collaboration-in-the-early-days-of-covid-19/", "via": "", "real_tags": ["开发", "github", "providing"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "A&amp；A637，L3(2020年)1欧洲南半球天文研究组织，卡西拉19001，圣地亚哥19，智利，电子邮件：triviniu@eso.org 2欧洲南半球天文研究组织，卡尔-施瓦茨希尔德-斯特尔。2，85748捷克科学院天文研究所，BočníII 1401，1431布拉哈4，捷克共和国4佐治亚州立大学的查拉阵列，威尔逊山天文台，威尔逊山，加利福尼亚州91023，美国。\n几十个光学梯形谱表明，HR6819是一个等级三元组。一颗经典的Be星在一个宽轨道上，围绕内40d双星有一个不受限制的周期，该双星由一颗B3III星和一颗在圆形轨道上看不见的伴星组成。这颗内星的径向速度半振幅为61.3 km s−1，其最小(可能)质量为5.0M⊙(6.3M ± 0.7M⊙)，暗示了≥4.2M⊙(≥5.0M ± 0.4M⊙这一不可见天体的质量，即黑洞(BH)。光谱时间序列与LB-1的观测结果惊人地相似。LB-1类似的三星结构将把LB-1中黑洞的质量从∼70M⊙降低到更典型的银河系恒星残留物黑洞的水平。HR6819中的BH可能是已知的最接近太阳的BH，与LB-1一起，暗示了一个安静的BH种群。它嵌入到一个分层的三元结构中可能对合并双BHS或BH+中子星双星的模型感兴趣。还发现了其他有外部Be星但没有BH的三重星，通过剥离，这些系统可能成为单星Be星的来源。\n关键词：恒星：黑洞/双星：光谱/恒星：个体：HR 6819/恒星：个体：ALS 8775(LB-1)。\n⋆作者将这封信献给斯坦·ŠTEFL(1955年−，2014年)的记忆，对他永不疲倦的警觉也引发了这部作品表示悲伤和感激之情。\n⋆⋆部分基于在智利欧洲南方天文台收集的观测结果(Prop.。63.H-0080及073.D-0274号)。\n银河系人口合成模型和观测之间最大的差异可能与黑洞的数量有关。模型预测了108到109颗恒星质量的BHS(Agol&Amp；Kamionkowski 2002；Olejak等人)。2020年)，但已知的X射线双星只有几个102，其中大多数只有中子星(NS)。这种比较是严重偏颇的，因为它只包括积极吸积的BHS。非增生的BH更难找到(有关检测的最新报告，请参阅Thompson等人)。2019年)。与普通的单线光谱双星(SB1)相比，第二颗发光星作为层次三元组中遥远的第三体的存在，可以对非吸积BHS的参数提供进一步的限制(Hayashi等人。2020)。由于外层天体可能通过Lidov-Kozai振荡加速内双BH或BH+NS双星的合并，就像通过引力波探测到的那样，最近引起了人们的兴趣(Abbott等人)。2019年，以及其中的引用)。\n系统ALS8775(LB-1在下文中)最近被报道为具有异常高质量的∼70M⊙的明显不吸积的BH(Liu等人。2019年)。这不容易与二元进化和银河系人口合成模型相协调(Eldridge等人。2019年)。而涉及发射线的质量确定的有效性受到质疑(例如，Abdul-Masih等人，2019年；El-Badry&Amp；Quataert 2020)，但是仍然可以从从发光成分导出的二元质量函数中推断出更规则质量的BH。然而，到目前为止，没有一个反驳对宽广的Hα发射线缺乏运动提供了令人信服的解释，这实际上显示了Be星非常典型的轮廓。\nHR6819(也称为HIP 89605、HD 167128或QV TEL)看起来像是一颗明亮的(V=5.3mag)早期Be星。古典Be星(Rivinius等人。(2013)是极快的旋转器，它们的发射线来自旋转支撑的赤道盘。达赫斯等人。Slettebak(1981年)报道了Ca 和Si 以及He λ4471ä的窄吸收线，这在Be星中是不常见的，Slettebak(1982年)注意到吸收光谱与正常的锋利线条的B3巨星的吸收光谱相似。在1999年的光谱中，Maintz(2003)发现这些狭窄的线条实际上是第二颗具有可变径向速度(RV)的恒星的特征。由于观测次数较少，她只能提出几十天的轨道周期。2009年，哈德拉瓦、ŠTEFL和里维尼乌斯使用哈德拉瓦(1995年)和哈德拉瓦(2004A)的方法，从一个更大的数据集中解开了这两颗恒星的光谱，并发现HR6819包含第三个看不见的物体，可能是黑洞。这一分析的结果将在即将发表的一篇论文中公布(在以下参考文献中\n这封信遵循了一种更传统和更另类的方法。第二节推导了内双星的轨道参数，并估计了HR6819相对于太阳系的整体空间轨道。第三节论证了看不见的部件是BH，将HR6819与其他具有外部BE星的等级三元系统进行了比较，确定了HR6819和LB-1系统在所有架构细节上的相似性，并简要概述了HR6819相对于Sco OB2的历史。\nMaintz(2003)从表1中的数据集A得出的发现激发了对2004年几个月的HR 6819的进一步观察(表1中的数据集B)。所使用的仪器是梯形格式光纤扩展射程光学光谱仪(F，Kaufer et al.。1999年)。用标准F流水线1降低光谱。\nHR6819是光度可变的，全量程接近0.1毫克。附录B描述和讨论了来自三个不同空间光度计的时间序列，没有检测到有规律的重复变化。\n图1和附录A.1给出了锋利线条恒星的RV，Hadrava(2004b)的F代码得出了表2中汇编的内双星的轨道参数。由于数据集B跨越几个周期，根据数据集A和B，很容易将轨道周期限制在约40.3d。F给出的周期为40.333 ± 0.004 d。Hadrava等人将提供进一步和更详细的分析，其中还包括历史数据和评估长期变化的可能性。(准备中)。由于偏心率较小，近星自变量ω的约束较差(±2 0°)，其误差传播到速度振幅K1的自变量中，从而修正了ω，从而使K1的误差下降到1%的水平。为了寻找1999年至2004年内双星相对于外Be星可能的轨道运动，第三次迭代也需要来自数据集A+B的共同结果，但允许内双星的系统速度γ对于A和B是不同的。γ1999年 − γ2004 ≈ +2 km s−1的差异并不显著，这与来自外Be星的发射线的位置不变性一致(图3)。2和C.2；Hadrava等人，准备中)。由于外轨道未知，但可能有几十年的周期和任何方向，很有可能在几年内出现不可检测的小轨道加速度，初步采用完整三系的RV作为集合A+B，γ = +9.4 ± 0.5 km s−1的联合解。\n图1。窄线恒星的RV曲线(黑色脉冲：He λ4026，红色脉冲：Mg λ4481)(见附录A和图)。c.2)在内双星中，轨道拟合(蓝线；表2)和残差(十字)。\n图2。HR6819系统选定的恒星周线和光球线(如标签所示)的动态光谱，与内双星的轨道周期(见表2)相对应。各个线条轮廓重叠在每个面板的顶部；虚线水平线标识动态光谱中颜色编码的范围。Hα面板仅用数据集B构建(参见表1)，以最大限度地减少Be星的长期圆盘变化性对发射外观的影响。Be星的基本不变的RV在其星周发射线(如Fe )的峰值以及主要是光球线(如He )的宽而弱的吸收基中清晰可见。选择Hδ面板中的切割是为了突出显示，在5%的水平(上方面板中的一个刻度线)，没有任何特征相对于线路核心反相移动。参见图。C..2用于额外的光谱线。\n表2.HR 6819中的内二进制参数与LB-1中的内二进制参数的比较(Liu等人。2019年)。\nHR6819的GAIA(DR2 Gaia Collaboration 2018年，π = 2.915 ms)和H(van Leeuwen 2007，π = 4.29 ms)视差解决方案都不考虑二进制；因此它们是高度不确定的。盖亚的测量可能会受到HR6819亮度的影响。然而，在大约310pC的距离(见下文)，B3III星的圆形轨道的角直径至少为0.44Au(对于SIN I = 1)是1.4ms或更大。这与盖亚溶液中0.731 mA的天文测量过量噪声的差异相匹配。观测到的通量与这两个视差大致相容。根据所作的其他假设，从通量拟合(附录C)中可以得出大约310pC± 60pC的首选距离。\n自行(在MYR−1：−3.667和−11.120来自Gaia，−4.10和−13.30来自H，在α和δ中分别来自H)比视差大得多，因此受到任何轨道模式的干扰都较小。在距离310pC时，1ma yr−1转化为1.5 km s−1。当我们简单估计Gaia和H速度平均时，总横向速度为12.8kms−1，或13.1pC myr−1，9.4kms−1的径向速度相当于9.6pc myr−1。在不考虑银河系230myr太阳轨道的情况下，即当我们假设自旋框架为惯性时，HR6819到。更精确的轨道和原点只能在外部轨道已知并且考虑到多重性的情况下计算出天文测量参数。\n有了上述轨道参数，内部系统中看不见的组分的质量函数为0.96 ± 0.03M⊙(详见附录A)。评估看不见的部分的质量下限需要B3 III恒星的质量下限。附录C.1和C.3表明B3III作为光谱分类是健全的，并同意Hohle等人对该光谱类型的使用。(2010年)。这些作者编制的数据库包含了56个B3III星的质量测定，没有一个中值为lt；5.0M⊙。这一下限也与进化轨迹一致(附录C.1)。当我们假设B3III星的下限为5M⊙，质量函数的下限为3σ(0.87M⊙)时，看不见的天体的质量的硬下限是4.2M⊙。\n接下来，我们需要验证一颗质量在下限的正常恒星是否可以隐藏在HR6819的光谱中。根据Hohle等人的说法。(2010年)，典型质量为4.2M⊙的恒星的光谱类型约为B7。在Wegner(2006)之后，对于可能的最低光度级别V，B3 III和B7 V恒星的绝对视觉等M V相差1.7毫克，或者说550 nm处的通量几乎是原来的5倍。由于B星和Be星对总V波段通量的贡献大致相等(附录C.3；Hadrava等人，在准备中)，如果内伴星发光，则大约10%的连续体将来自内伴星。对于这个相对亮度，用Shokry等人的合成光谱建模。(2018年)的研究表明，即使在近临界自转条件下，B7V星在Mg λ4481中的光谱特征为0.6%，在巴尔默谱线中的光谱特征为6%，在vSiN I &gt； 2 0 0 km s−1的近临界自转状态下，这些特征在由5 0多个平均信噪比为4 5 0 nm的 &GT； 2 80组成的动力学光谱中不会被忽视，看不见的成分不是一颗正常的恒星。Wang等人。(2018)搜索了SDO伴星的紫外光谱。然而，对于检测而言，计算的互相关函数的信噪比太低。因为B星和不可见物体之间的质量差随着B星的质量增加而增大，所以原则上也需要评估不可见物体的最大质量，因为这可能会导致较大的星等差，从而降低发光伴星的探测能力。然而，对于HR 6819，情况并非如此(见附录C.2)。\nHR6819在位置上与任何已知的脉冲星2都不重合。不可见物体质量的4.2M⊙的下限大大高于NSS的∼2.6M⊙的经验质量极限(Alsing等人。此外，2018年，接近这一极限的伴星质量将意味着B星的质量低得令人难以置信(见附录A)，并落入NSS和BHS的观测质量之间可能存在的差距(见Farr等人)。(2011年)。因此，看不见的物体一定是BH。\n传统上，黑洞是在X射线中探测到的，X射线是由伴星的物质吸积而成的。相比之下，在HR6819最近的X射线观测中，也就是ROSAT全天观测中，没有探测到源(L X ≤ 3.5 × 10 30 erg s−1在0.1erg2.4keV波段，假设距离为460pC；Berghoefer等人)。(1996年)，轨道的近圆形并不意味着没有探测到的爆发形式的重大可变性，这在光学上得到了证实(附录B)。因此，内部双星不相互作用。在B3III星的温度和光度下，辐射风本质上是非常弱的(Krtička，2014年)，并且在分离&gt；0.22Au(仅从B3III星内部圆形轨道的下限)的情况下是无效的。因此，缺乏互动是意料之中的。这表明，在所有实际目的中，BH都不是堆积的。\n如果我们不使用5.0M⊙的最小质量和质量函数的3σ下限，我们使用更典型的B3III星的质量6.3M± 0.7M⊙(附录C.3)和质量函数的标称值0.96M± 0.03M⊙，则BH质量Inc.\nHR6819和LB-1的巨大相似性引发了这样一个问题：这是否足以识别可能的祖细胞系统。最简单的假设是，层次结构不会因BH的形成而改变，而最初的内双星更紧密，总质量远远超过10M⊙(Sukhbold等人。2016)。一个这样的候选系统可能是分离的食2.7d双星CW CEP，质量分别为13和12M⊙，轨道接近圆形(Johnston等人)。2019年)。这两颗星能否避免合并，很大程度上取决于质量损失。Johnston等人。(2019年，他们的图2)报告了广泛的Hα发射，它不参与轨道运动，但具有经典Be星的典型轮廓。这意味着在CW Cep中，一颗外Be星也可能在绕内双星运行。H-α剖面显示Be星的中等倾角(见Hummel&Amp；Vrancken2000)，而内双星的轨道倾角约为零，因为系统正在日食。\n乍一看，这三个系统都拥有一颗外星，这似乎令人费解。由于HR 6819和CW Cep的已知谱线发射与LB-1相似而被鉴定，这可能是一种选择偏向。然而，66Oph是具有外部BE星(但没有BH，ŠTEFL等人)的第四个层次三元组。2004)。这样一个形成Be星的通道(关于其他通道的描述，见Langer等人)。2020a)可能是由于大质量恒星形成过程中碎裂过程中的角动量分布(Bodenheimer 1978；Kratter&Amp；Matzner 2006)。如果这些外部Be星变得没有束缚，它们的空间速度可能高于平均水平，但可能不在相当一部分Be星观测到的范围的顶端(Berger&Amp；Gies 2001)。另一个明显的共性是内部双星的偏心消失，这在等级三元系中不是典型的(Tokovinin等人。2019年)。\n太阳系位于所谓的局部气泡内，该气泡的直径约为100个pC，其特点是密度低于平均水平，但其气体含量温度较高(Slavin 2017)。这种结构归因于数百万年前爆发的超新星(SNE)(正如Frisch&Amp；Dwarkadas 2017总结的那样)，当时最近的恒星OB协会Sco OB2从太阳附近经过(Fuchs等人)。(2006年)。附录D中的分析表明，HR6819可能比Sco OB2更老，并根据Sector。2.3，其轨道不与Sco OB2相交(de Zeeuw等人)。1999年)，因此不是HR6819的亲代人口。粗略的初步估计在SN爆炸时HR6819的距离从280pC(如果爆炸发生在15Myr之前)到大约800pc(如果爆炸发生在∼65−70Myr之前)(关于年龄的讨论，请参见附录D)，并将该事件放置在本地气泡之外。根据初始质量的不同，也有可能在没有爆炸的情况下通过直接坍塌形成BH(Sukhboldet al.。2016)。\nHR6819是一颗内双星中有一颗非吸积的BH的等级三合星。质量估计并不依赖于作为黑洞轨道运动的示踪物的发射线的RV测量的困难程度(见Casares等人)。2014年；El-Badry&amp；Quataert 2020)。此外，B3III星是一颗相当正常的恒星，因此由光谱类型和光谱能量分布得到的质量与质量函数相结合，导致BH的固体质量下限为4.2M⊙(对于SIN I = 1)。如果2.7d的内部二进制能够通过质量损失避免合并，则CW CEP系统可能是具有类似于HR6819和LB-1的体系结构的系统的先驱。通过剥离外层Be星，HR 6819、LB-1、CW Cep和66Oph等系统可能成为单颗Be星的来源。\n由于光谱序列与简单的二进制不相容，使得检测变得容易。这可以作为寻找其他非增生BH的判据，LB-1的例子说明了这一点。\n..", "note_en": "A&amp;A 637, L3 (2020)    1 European Organisation for Astronomical Research in the Southern Hemisphere (ESO), Casilla 19001, Santiago 19, Chile  e-mail: triviniu@eso.org  2 European Organisation for Astronomical Research in the Southern Hemisphere (ESO), Karl-Schwarzschild-Str. 2, 85748 Garching b. München, Germany   3 Astronomical Institute, Academy of Sciences of the Czech Republic, Boční II 1401, 141 31 Praha 4, Czech Republic   4 The CHARA Array of Georgia State University, Mount Wilson Observatory, Mount Wilson, CA 91023, USA\n   Several dozen optical echelle spectra demonstrate that  HR 6819 is a hierarchical triple. A classical Be star is in a wide orbit with an unconstrained period around an inner 40 d binary consisting of a B3 III star and an unseen companion in a circular orbit. The radial-velocity semi-amplitude of 61.3 km s −1 of the inner star and its minimum (probable) mass of 5.0  M ⊙ (6.3 ± 0.7  M ⊙) imply a mass of the unseen object of ≥4.2  M ⊙ (≥5.0 ± 0.4  M ⊙), that is, a black hole (BH). The spectroscopic time series is stunningly similar to observations of LB-1. A similar triple-star architecture of LB-1 would reduce the mass of the BH in LB-1 from ∼70  M ⊙ to a level more typical of Galactic stellar remnant BHs. The BH in HR 6819 probably is the closest known BH to the Sun, and together with LB-1, suggests a population of quiet BHs. Its embedment in a hierarchical triple structure may be of interest for models of merging double BHs or BH + neutron star binaries. Other triple stars with an outer Be star but without BH are identified; through stripping, such systems may become a source of single Be stars.\n Key words: stars: black holes / binaries: spectroscopic / stars: individual: HR 6819 / stars: individual: ALS 8775 (LB-1)\n ⋆  The authors dedicate this Letter to the memory of Stan Štefl (1955−2014) in sadness and grateful appreciation of his never-tiring alertness that also triggered this work.\n ⋆⋆  Based partly on observations collected at the European Southern Observatory, Chile (Prop. Nos. 63.H-0080 and 073.D-0274).\n   The largest discrepancy between Galactic population-synthesis models and observations probably concerns the number of black holes (BHs). Models predict 10 8 to 10 9 stellar mass BHs (  Agol &amp; Kamionkowski 2002;   Olejak et al. 2020), but merely a few 10 2 X-ray binaries are known, most of which only harbor neutron stars (NS). This comparison is severely biased because it only includes actively accreting BHs. Nonaccreting BHs are much more difficult to find (for a recent report of a detection, see   Thompson et al. 2019). Compared to plain single-lined spectroscopic binaries (SB1), the presence of a second luminous star as a distant third body in a hierarchical triple can provide further constraints on the parameters of nonaccreting BHs (  Hayashi et al. 2020). Massive hierarchical triple systems recently attracted interest because the outer object might accelerate the merger of inner double-BH or BH + NS binaries through Lidov-Kozai oscillations, as detected through gravitational waves (  Abbott et al. 2019, and references therein).\n The system  ALS 8775 ( LB-1 in the following) was recently reported to host an apparently nonaccreting BH with the unusually high mass of ∼70  M ⊙ (  Liu et al. 2019). This is not easily reconciled with binary evolution and Galactic population-synthesis models (  Eldridge et al. 2019). While the validity of the mass determination involving emission lines has been questioned (e.g.,   Abdul-Masih et al. 2019;   El-Badry &amp; Quataert 2020), a BH of more regular mass can still be inferred from the binary mass function derived from the luminous component. However, none of the rebuttals so far have offered a convincing explanation for the lack of motion of the broad H α emission line, which in fact shows a profile that is very typical for Be stars.\n HR 6819 (also known as HIP 89605, HD 167128, or QV Tel) appears as a bright ( V = 5.3 mag) early-type Be star. Classical Be stars (  Rivinius et al. 2013) are extremely rapid rotators, and their emission lines originate from a rotationally supported equatorial disk.   Dachs et al. (1981) reported narrow absorption lines of Ca   and Si   as well as in He   λ4471 Å, which are uncommon in Be stars, and   Slettebak (1982) noted a similarity of the absorption spectrum to that of a normal sharp-lined B3 giant. In spectra from 1999,   Maintz (2003) found that these narrow lines actually are the signature of a second star with variable radial velocity (RV). Because of the small number of observations, she was only able to propose an orbital period of a few dozen days. In 2009, Hadrava, Štefl, and Rivinius disentangled the spectra of the two stars from a larger dataset, using the method of   Hadrava (1995);   Hadrava (2004a), and discovered that HR 6819 contains a third, unseen object that may be a BH. The results of this analysis will be presented in a forthcoming paper (in the following referenced as Hadrava et al., in prep.).\n This Letter follows a more conventional and alternative approach. Section  2 derives the orbital parameters of the inner binary and estimates the space trajectory of HR 6819 as a whole relative to the Solar System. Section  3 argues that the unseen component is a BH, compares HR 6819 to other hierarchical triple systems with an outer Be star, identifies the similarity of the HR 6819 and LB-1 systems in all architectural details, and briefly sketches the history of HR 6819 relative to Sco OB2.\n   The findings by  Maintz (2003) from dataset A in Table  1 motivated further observations of HR 6819 for several months in 2004 (dataset B in Table  1). The instrument used was the echelle-format Fibre Extended Range Optical Spectrograph (F ,   Kaufer et al. 1999). The spectra were reduced with the standard F  pipeline  1.\n  HR 6819 is photometrically variable with a full range of nearly 0.1 mag. Time series from three different space photometers are described and discussed in Appendix  B. No regularly repeating variability was detected.\n  Figure  1 and Appendix  A.1 present the RVs of the sharp-lined star for which the F  code of   Hadrava (2004b) yielded the orbital parameters of the inner binary compiled in Table  2. Because dataset B spans several cycles, the orbital period is easily constrained to be about 40.3 d based on datasets A and B. F  gives a period of 40.333 ± 0.004 d. A further and more detailed analysis that also includes historical data and evaluates the possibility of secular changes, will be provided by Hadrava et al. (in prep.) Because of the low eccentricity, the argument of the periastron,  ω, is poorly constrained (±20°), and its errors propagate into those of the velocity amplitude, K 1. Therefore  ω was fixed, whereupon the errors on K 1 dropped to the 1% level. In search for a possible orbital motion between 1999 and 2004 of the inner binary relative to the outer Be star, a third iteration also required common results from datasets A + B, but permitted the systemic velocity,  γ, of the inner binary to be different for A and B. The difference  γ 1999 −  γ 2004 ≈ +2 km s −1 is not significant, in agreement with the positional invariance of the emission lines from the outer Be star (Figs.  2 and  C.2; Hadrava et al., in prep.). Because the outer orbit is unknown, but may have a period of some decades and any orientation, an undetectably small orbital acceleration over a few years is very well possible, and the RV of the complete triple system is preliminarily adopted as the combined solution of sets A + B,  γ = +9.4 ± 0.5 km s −1.\n Fig. 1. RV curve (black pluses: He   λ4026, red pluses: Mg   λ4481) of the narrow-line star (see Appendix  A and Fig.  C.2) in the inner binary, the orbital fit (blue line; Table  2), and the residuals (crosses).\n Fig. 2. Dynamical spectra of selected circumstellar and photospheric lines (as labeled) of the HR 6819 system, phased with the orbital period (see Table  2) of the inner binary. The individual line profiles are overplotted at the top of each panel; the dashed horizontal lines identify the range of the color-coding in the dynamical spectra. The H α panel was constructed with data set B alone (see Table  1) to minimize the effect of the long-term disk variability of the Be star on the appearance of the emission. The basically invariant RV of the Be star is clearly visible in the peaks of its circumstellar emission lines (e.g., Fe  ) as well as in the broad, weak absorption bases of predominantly photospheric lines such as He  . The cuts in the H δ panels were chosen to highlight that at the 5% level (one tick mark in the  upper panel) no feature moves in antiphase with respect to the line core. See Fig.  C.2 for additional spectral lines.\n Table 2. Parameters of the inner binary in HR 6819 compared to those of the inner binary in LB-1 ( Liu et al. 2019).\n  Neither the  Gaia (DR2   Gaia Collaboration 2018,  π = 2.915 mas) nor the H  (  van Leeuwen 2007,  π = 4.29 mas) parallax solutions for HR 6819 consider binarity; they are therefore highly uncertain. The  Gaia measurements may suffer from the brightness of HR 6819. However, at a distance of about 310 pc (see below), the angular diameter of the circular orbit of the B3 III star of at least 0.44 au (for sin  i = 1) is 1.4 mas or more. This matches the discrepancy as well as the astrometric excess noise of 0.731 mas in the  Gaia solution. The observed flux is approximately compatible with both parallaxes. Depending on other assumptions made, a preference for a distance of about 310 ± 60 pc emerges from flux fitting (Appendix  C).\n The proper motion (in mas yr −1: −3.667 and −11.120 from  Gaia and −4.10 and −13.30 from H  in  α and  δ, respectively) is much larger than the parallax and thus is less disturbed by any orbital pattern. At a distance of 310 pc, 1 mas yr −1 translates into 1.5 km s −1. When we average the  Gaia and H  velocities as a simple estimate, the total lateral velocity is 12.8 km s −1, or 13.1 pc Myr −1, and the radial velocity of 9.4 km s −1 corresponds to 9.6 pc Myr −1. Without taking the 230 Myr solar orbit in the Galaxy into account, that is, when we assume that the corotating frame is inertial, the closest approach of HR 6819 to the Sun is estimated for 11 Myr ago, at a distance of about 260 pc. A more precise trajectory and origin can only be derived when the outer orbit is known and the astrometric parameters have been computed taking the multiplicity into account.\n   With the above orbital parameters, the mass function of the unseen component in the inner system becomes 0.96 ± 0.03  M ⊙ (see Appendix  A for details). Evaluating a lower limit on the mass of the unseen component requires a lower limit on the mass of the B3 III star. Appendices  C.1 and  C.3 demonstrate that B3 III is sound as a spectral classification and agrees with the usage of that spectral type by   Hohle et al. (2010). The database compiled by these authors contains 56 mass determinations for B3 III stars, none of which has a median value &lt; 5.0  M ⊙. This lower limit is also in agreement with evolutionary tracks (Appendix  C.1). When we assume a lower limit of 5  M ⊙ for the B3 III star and the 3 σ lower limit (0.87  M ⊙) on the mass function, a hard lower limit on the mass of the unseen object is 4.2  M ⊙.\n Next, we need to verify whether a normal star with a mass at the lower limit can hide in the spectra of HR 6819. According to  Hohle et al. (2010), the spectral type of stars with a typical mass of 4.2  M ⊙ is about B7. For the lowest possible luminosity class of V, and following   Wegner (2006), the absolute visual magnitudes  M  V of a B3 III and a B7 V star differ by 1.7 mag, or a factor of almost 5 in flux at 550 nm. Because the B and Be star both contribute about equally to the total  V-band flux (Appendix  C.3; Hadrava et al., in prep.), about 10% of the continuum would come from the inner companion if it were luminous. For this relative brightness, modeling with synthetic spectra from   Shokry et al. (2018) shows that a B7 V star would appear with a spectral signature of 0.6% in Mg   λ4481 and 6% in the Balmer lines even at near-critical rotation with  v sin  i &gt;  200 km s −1. That is, these features would not have gone unnoticed in the dynamical spectra that were constructed from more than 50 F  spectra with an average signal-to-noise ratio  S/ N &gt;  280 at 450 nm, and the unseen component is not a normal star.   Wang et al. (2018) searched UV spectra for an sdO companion. However, the  S/ N of the calculated cross-correlation function was too low for a detection. Because the mass difference between the B star and the unseen object increases with the mass of the B star, the maximum mass of the unseen object also needs to be evaluated in principle because it might lead to a larger magnitude difference and hence lower detectability of a luminous companion. For HR 6819, however, this is not the case (see Appendix  C.2).\n HR 6819 is not positionally coincident with any known pulsar  2. The lower limit of 4.2  M ⊙ on the mass of the unseen object is substantially above the empirical mass limit of ∼2.6  M ⊙ for NSs (  Alsing et al. 2018, moreover, a companion mass close to that limit would imply an unbelievably low mass for the B star, see Appendix  A) and also falls into the possible gap between observed masses of NSs and BHs (see   Farr et al. 2011). Therefore, the unseen object must be a BH.\n Black holes are traditionally detected in X-rays that result from the accretion of matter from a companion star. By contrast, in the only recent X-ray observation of HR 6819, the ROSAT all-sky survey, the source is not detected ( L X ≤ 3.5 × 10 30 erg s −1 in the 0.1−2.4 keV band, assuming a distance of 460 pc;   Berghoefer et al. 1996), and the near-circularity of the orbit does not suggest major variability in the form of undetected outbursts, as is confirmed in optical light (Appendix  B). Accordingly, the inner binary is not interacting. At the temperature and luminosity of a B3 III star, radiative winds are intrinsically very weak (  Krtička 2014) and are ineffective over a separation of &gt; 0.22 au (the lower limit from the circular inner B3 III-star orbit alone). Therefore, the lack of interaction is expected. This suggests that for all practical purposes, the BH is not accreting.\n If, instead of the minimum mass of 5.0  M ⊙ and the 3 σ lower limit on the mass function, we use the more typical mass of a B3 III star of 6.3 ± 0.7  M ⊙ (Appendix  C.3) and the nominal value of the mass function, 0.96 ± 0.03  M ⊙, the BH mass increases from 4.2  M ⊙ to 5.0 ± 0.4  M ⊙. For orbital inclinations &lt; 90° (the angle is unconstrained), both values would be higher.\n  As already noted by  Liu et al. (2019), the shape of the line emission in LB-1 closely matches that of Be stars, although these authors only speak of “wine-bottle profiles” (which are typical for Be stars, see   Hanuschik et al. 1996). The undetected RV amplitude of the emission line ( El-Badry &amp; Quataert 2020) is naturally explained by a Be star at a large distance from the other luminous star, as in HR 6819. Table  2 compares the properties of the inner binaries in HR 6819 and LB-1. A forthcoming paper (Heida et al., in prep.) will disentangle the spectra of the two luminous stars in LB-1, which leads to a drastic reduction of the BH mass (see  Abdul-Masih et al. 2019;  El-Badry &amp; Quataert 2020).\n In principle, both HR 6819 and LB-1 might be chance superpositions of a binary and a Be star, although this would stretch simple probability considerations. In both systems, the absolute and apparent spectroscopic luminosities of the visible components are similar (HR 6819: Appendix  C, Hadrava et al., in prep.; LB-1: Heida et al., in prep.), and the similar distances support the assumption that both are physical triples.\n The great similarity of HR 6819 and LB-1 invites the question whether this is enough to identify possible progenitor systems. The simplest assumption is that the hierarchy was not altered by the formation of the BH, whereas the initial inner binary was tighter and had a total mass of well over 10  M ⊙ (  Sukhbold et al. 2016). One such candidate system may be the detached eclipsing 2.7 d binary  CW Cep with masses of 13 and 12  M ⊙ and a near-circular orbit (  Johnston et al. 2019). Whether the two stars can avoid merging strongly depends on the mass loss.  Johnston et al. (2019, their Fig. 2) reported broad H α emission that does not participate in the orbital motions, but has the typical profile of classical Be stars. This means that in CW Cep, an outer Be star may also be orbiting an inner binary. The H α profile indicates an intermediate inclination of the Be star (see   Hummel &amp; Vrancken 2000), while the orbital inclination of the inner binary is around zero because the system is eclipsing.\n At first sight, it seems perplexing that all three systems host an outer Be star. Because HR 6819 and CW Cep were identified because their known line emission is similar to that in LB-1, this is probably a selection bias. However,  66 Oph is a fourth hierarchical triple with an outer Be star (but without a BH,   Štefl et al. 2004). Such a channel for the formation of Be stars (for a description of other channels, see   Langer et al. 2020a) may be due to angular momentum distribution during fragmentation in massive-star formation (  Bodenheimer 1978;   Kratter &amp; Matzner 2006). If these outer Be stars become unbound, they may have above-average space velocities, but probably not at the top of the range observed in a fair fraction of Be stars (  Berger &amp; Gies 2001). Another conspicuous commonality is the vanishing eccentricity of the inner binaries, which is not typical of hierarchical triple systems (  Tokovinin et al. 2019).\n  The Solar System is located within the so-called Local Bubble, which measures about 100 pc across and is characterized by a lower-than-average density, but high temperatures of its gas content (  Slavin 2017). This structure is attributed to supernovae (SNe) that exploded several million years ago (as summarized by   Frisch &amp; Dwarkadas 2017) when Sco OB2, the most nearby stellar OB association, passed in the solar vicinity (  Fuchs et al. 2006). The analysis in Appendix  D shows that HR 6819 is probably older than Sco OB2, and according to Sect.  2.3, its trajectory does not cross that of Sco OB2 (  de Zeeuw et al. 1999), which therefore is not the parent population of HR 6819. Crude preliminary estimates of the distance of HR 6819 at the time of the SN explosion range from 280 pc if the explosion occurred 15 Myr ago to about 800 pc for an explosion ∼ 65−70 Myr ago (see Appendix  D for a discussion of the age) and place this event well outside the Local Bubble. Depending on the initial mass, it is also possible that the BH formed without explosion by direct collapse ( Sukhbold et al. 2016).\n  HR 6819 is a hierarchical triple star with a nonaccreting BH in the inner binary. The mass estimate does not depend on difficult RV measurements of emission lines as tracers of the orbital motion of the BH (see   Casares et al. 2014;  El-Badry &amp; Quataert 2020). Furthermore, the B3 III star is a fairly normal star so that the combination of the mass derived from spectral type and spectral energy distribution with the mass function leads to a solid lower mass limit on the BH of 4.2  M ⊙ (for sin  i = 1). The  CW Cep system may be a progenitor of systems with an architecture similar as in  HR 6819 and  LB-1 if the 2.7 d inner binary can avoid merger through mass loss. Through stripping of the outer Be star, systems such as HR 6819, LB-1, CW Cep, and 66 Oph may become a source of single Be stars.\n The detection was facilitated by the incompatibility of the spectral sequences with a simple binary. This can be a criterion to find other nonaccreting BHs, and the case of LB-1 illustrates t\n......", "posttime": "2020-05-07 03:34:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "已知,closest,质量", "title": "在肉眼可见的系统中发现最接近的已知黑洞", "title_en": "Discovery of the closest known blackhole, in a system visible to the naked eye", "transed": 1, "url": "https://www.aanda.org/articles/aa/full_html/2020/05/aa38020-20/aa38020-20.html", "via": "", "real_tags": ["已知", "closest", "质量"]}, {"category": "", "categoryclass": "", "imagename": "634e772f434b9c748bc109ff2011ea3e.jpg", "infoid": 1000995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面向读者的新服务：创建一个帐户，享受对麻省理工学院SMR网站60天的开放访问。另外，您可以通过订阅时事通讯来访问我们的最新研究。", "note_en": "New service to readers: Create an account to enjoy 60 days of open access to the  MIT SMR site. Plus, you get access to our latest research by signing up for newsletters.", "posttime": "2020-05-07 03:34:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,斯隆,sloan,读者", "title": "麻省理工学院斯隆管理评论免费60天", "title_en": "MIT Sloan Management Review is free for 60 days", "transed": 1, "url": "http://sloanreview.mit.edu/60-days-free", "via": "", "real_tags": ["免费", "斯隆", "sloan", "读者"]}, {"category": "", "categoryclass": "", "imagename": "cd28bd40e6ca0df392f8ae5a423efb45.jpg", "infoid": 1000993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GoPardy是目前最著名的域名注册和托管公司之一，它已经通知客户他们遇到的安全问题和数据泄露：\n媒体报道称，该问题影响到该公司所有1900万客户，事件发生在2019年秋季。然而，登记册报告说情况并非如此。根据该出版物，2019年10月发生的事情与目前的事件无关，而其他媒体报道称，最初的妥协发生在8个月前。因此，这可能是一个全新的安全漏洞，受影响的GoPardy服务器。\n回到事实，2020年4月23日，GoPardy的员工发现了可疑的活动：用户名和密码被泄露，因为攻击者对GoPardy基础设施中的SSH文件进行了更改。这个问题总共影响了大约28，000名客户(而不是一些人建议的19，000，000)。但很容易犯这个错误，因为并不是所有与数据泄露相关的事实都还没有公布。\nGoPardy专家声称，他们已经重置了所有受影响的用户名和密码，清除了故意损坏的SSH文件，目前还没有发现攻击者使用“泄露”的凭据和更改任何东西的任何痕迹。该公司强调，没有发现在事件期间添加或更改任何文件的证据(不过，没有提到查看和下载文件)。\n据强调，攻击者无法访问GoDaddy.com上的主要客户账户，事件只影响到托管账户，但专家仍建议受害者在任何地方更改密码。如果你还需要域名，那就去看看Namecheap，它是目前最可靠的注册商之一。", "note_en": "GoDaddy, one of the most famous domain registrar and hosting companies out there, have  notified it’s customers about security issues and data leakage they have experienced:\n  The media have reported that the  problem affected all 19 million customers of the company, and the incident took place in the fall of 2019. However,  The Register reports that this is not quite the case. According to the publication, what happened in October 2019 has nothing to do with the current incident, while other media reports that the initial compromise took place eight months ago. So, it could be an absolutely new security breach the affected GoDaddy servers.\n Back to the facts, on April 23, 2020, GoDaddy employees discovered suspicious activity: usernames and passwords were compromised, as attackers made changes to the SSH file in GoDaddy infrastructure. In total,  this problem affected approximately 28,000 customers (not 19,000,000, as some have suggested). But it was easy to make this mistake because not all the data breach-related facts have been released yet.\n  GoDaddy experts claim that they have already reset all affected usernames and passwords, got rid of the deliberately damaged SSH file, and have not yet found any traces that the attackers used the “leaked” credentials and changed anything. The company emphasized that it did not find evidence that during the incident any files were added or changed (however, nothing was said about viewing and downloading files).\n It is emphasized that the attackers did not have access to the main customer accounts on GoDaddy.com, the incident affected only hosting accounts, however, experts still recommend that victims change their passwords everywhere. And if you still need a  domain name, check out  Namecheap, one of the more reliable registrars out there.", "posttime": "2020-05-07 03:21:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,受到,confirms,gopardy", "title": "谷歌爸爸确认数据泄露-28000客户受到影响", "title_en": "GoDaddy Confirms Data Breach – 28000 Customers Affected", "transed": 1, "url": "https://www.onlinetoolsexpert.com/godaddy-confirms-data-breach/", "via": "", "real_tags": ["谷歌", "受到", "confirms", "gopardy"]}, {"category": "", "categoryclass": "", "imagename": "2819ed6204ae19936d79fa7a7fad8f17.png", "infoid": 1000992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BuildZoom是一般承包商的市场。我们收集和分析数以亿计的建筑许可证、许可证、物业特征、人口统计数据和其他数据点，为业主提供招聘建议，并使聘请承包商的整个过程简单明了。我们每月为数百万游客提供服务，每年为数十亿美元的项目提供服务。\n目前，BuildZoom 20%的收入来自我们的内容努力，我们希望明年这一数字能翻一番以上。我们已经证明了这个概念，现在是发展的时候了。“我们正在寻找一个人来运行和扩大这个计划。\n作为成长助理，您将负责制作和传播在线内容。您将负责管理和发展一支由远程合同撰稿人和研究人员组成的团队。您将专注于效率和ROI。你会痴迷于获得页面浏览量和高质量的内容。您将培养对如何通过搜索发展业务的理解。您还将管理我们的WordPress网站，并负责转换。对于想要拥有并扩展流程的候选人来说，这个角色是理想的。对于那些希望创业和发展管理技能的人来说，这是一个理想的学习场所。\n对一家你可以真正信任的公司产生直接、直接和明显的影响--事实证明，这种公司可以为全国各地的业主和承包商带来巨大的价值。", "note_en": "BuildZoom is the marketplace for general contractors. We collect and analyze hundreds of millions of building permits, licenses, property features, demographics and other data points to provide property owners with hiring recommendations and make the entire process of hiring a contractor simple and straightforward. We serve millions of monthly visitors and several billion dollars in projects annually.\n  Currently, 20% of BuildZoom’s revenue is attributable to our content efforts and we hope to more than double that over the next year. We have proven the concept and now it is time to grow.  We are looking for someone to run and scale this initiative.\n  As a Growth Associate, you will be responsible for producing and disseminating online content. You will responsible for managing and growing a team of remote, contract writers and researchers. You will focus on efficacy and ROI. You will obsess over getting pageviews and quality content. You will cultivate an understanding for how to grow a business through search. You will also manage our WordPress site and be responsible for conversions. The role is ideal for candidates who want to own and scale a process. It is an ideal learning ground for someone looking to start their own business and develop managerial skills.\n   An immediate, direct, and clear impact on a company that you can really believe in--one that has been proven to drive tremendous value for property owners and contractors across the  country.", "posttime": "2020-05-07 03:21:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增长,remodel,发展", "title": "BuildZoom(一种更好的重塑方式)正在聘请一名远程增长助理", "title_en": "BuildZoom (a better way to remodel) is hiring a remote growth associate", "transed": 1, "url": "https://jobs.lever.co/buildzoom/0e86e9ea-a3eb-4f19-8697-425db484942f", "via": "", "real_tags": ["增长", "remodel", "发展"]}, {"category": "", "categoryclass": "", "imagename": "d70804d1525efb3a56d57215427caf38.png", "infoid": 1000991, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2017年以来，谷歌Authenticator应用程序进行了首次翻新，从5.0版跃升至5.10版。但是视觉上的改头换面-", "note_en": "The Google Authenticator app has undergone its first facelift since 2017, making the jump from version 5.0 to 5.10. But the visual makeover —", "posttime": "2020-05-07 03:20:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,authenticator", "title": "Google Authenticator获得多年来的首次更新", "title_en": "Google Authenticator gets its first update in years", "transed": 1, "url": "https://www.androidpolice.com/2020/05/06/google-authenticator-gets-its-first-update-in-years-finally-lets-you-transfer-accounts-between-devices-apk-download/", "via": "", "real_tags": ["google"]}]