[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此浏览器禁用Cookie。Wiley Online Library需要Cookie来进行身份验证和使用其他站点功能；因此，必须启用Cookie才能浏览站点。有关Wiley如何使用Cookie的详细信息可在我们的隐私政策中找到。", "note_en": "Cookies are disabled for this browser. Wiley Online Library requires cookies for authentication and use of other site features; therefore, cookies must be enabled to browse the site. Detailed information on how Wiley uses cookies can be found in our  Privacy Policy.", "posttime": "2020-05-10 05:27:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抑制剂,pump,cookie", "title": "质子泵抑制剂(烧心药)与痴呆症风险增加有关", "title_en": "Proton pump inhibitors (heartburn meds) linked with increased risk of dementia", "transed": 1, "url": "https://alz-journals.onlinelibrary.wiley.com/doi/full/10.1002/alz.12113", "via": "", "real_tags": ["抑制剂", "pump", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "af6cf16279a26fd02d26ea04c050908f.jpg", "infoid": 1001418, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在发表在《新英格兰医学杂志》上的一项研究中，由哥伦比亚大学一个团队领导的科学家发现，服用羟基氯喹的冠状病毒感染者的情况并不比没有服用该药物的人好。\n星期四发表的这项研究是迄今为止调查这种药物的规模最大的一次。这种药物被美国食品和药物管理局(FDA)批准用于治疗疟疾和某些自身免疫性疾病，作为治疗冠状病毒的药物。哥伦比亚大学肺部、过敏和重症监护医学部主任尼尔·施卢格(Neil Schluger)博士和他的团队研究了纽约长老会医院-哥伦比亚大学欧文医学中心(Irving Medical Center)治疗冠状病毒的1300多名患者。一些人在标签外的基础上接受了羟基氯喹，这种做法允许医生开出一种已被批准用于治疗一种疾病的药物来治疗另一种疾病-在这种情况下，是冠状病毒。大约60%的患者接受了大约5天的羟氯喹治疗。与没有服用药物的人相比，他们没有显示出在研究期间需要呼吸机的比率或死亡风险更低。\n“在这一点上，考虑到全部证据，我们认为常规地给患者服用这种药物是不合理的，”Schluger说。“我们看不到这样做的理由。”虽然这项研究没有随机分配接受药物或安慰剂的人，并比较他们的结果，但参与的大量患者表明研究结果是可靠的。\n施卢格说，根据研究结果，他所在医院的医生已经改变了使用羟基氯喹治疗冠状病毒的建议。他说：“我们早期的指南建议给住院患者服用羟基氯喹，我们更新了指南，删除了这一建议。”\n羟基氯喹最初的支持很大程度上来自于在法国进行的一项小型研究，该研究表明，接受药物治疗的人比没有接受药物治疗的人表现更好。在美国，特朗普总统也表达了对这种药物的兴趣，认为这是控制日益严重的流行病的一种可能方式。然而，美国国家过敏和传染病研究所所长、特朗普的白宫冠状病毒工作组成员安东尼·福奇博士敦促谨慎，并建议对该药物对冠状病毒的影响进行更严格的研究和数据。\n尽管如此，Schluger说，在大流行期间帮助患者的迫切需要导致许多医生和医院抓住羟基氯喹作为一种潜在的有效治疗方法。他说：“医生们看到病人正以令人难以置信的速度死去，他们想做点什么来试图帮助他们。”“但我认为医学史告诉我们，有些预感是对的，很多很多都是错的。”在卫生保健民意调查公司Sermo进行的一项调查中，全球55%的受访医生报告使用了羟基氯喹。然而，只有29%的人认为它高度安全-这种药物与异常心律的风险更高有关。\n目前的研究结果可能会改变医生治疗重病住院患者的方式。但施卢格表示，羟基氯喹仍有可能在控制冠状病毒方面发挥作用，或许可以作为预防接触该病毒的高危人群感染的一种方式，比如医护人员。其他研究正在调查这种可能性。\nSchluger说：“对我们来说，知道哪些治疗有效，哪些无效，这一点真的很重要，所以应该给患者提供参加临床试验的机会。”“这可能是他们能为自己和整个社会做的最好的事情，所以我们可以非常迅速地得到答案，以确定哪些治疗有效，哪些治疗无效。”\n如果您不希望通过电子邮件从Time接收促销优惠，请选中此框。\n你可以随时退订。注册即表示您同意我们的使用条款和隐私政策。\n为了您的安全，我们已向您输入的地址发送了确认电子邮件。点击链接确认您的订阅并开始接收我们的时事通讯。如果您在10分钟内没有得到确认，请检查您的垃圾邮件文件夹。", "note_en": "In a  study published in the New England  Journal of Medicine, scientists led by a team at Columbia University found that people infected with COVID-19 taking  hydroxychloroquine do not fare better than those not receiving the drug.\n  The study published Thursday is the largest to date to investigate the drug, which is approved by the U.S. Food and Drug Administration to treat malaria and certain autoimmune disorders, as a treatment for  COVID-19. Dr. Neil Schluger, chief of the division of pulmonary, allergy and critical care medicine at Columbia, and his team studied more than 1,300 patients admitted to New York-Presbyterian Hospital-Columbia University Irving Medical Center for COVID-19. Some received hydroxychloroquine on an off-label basis, a practice that allows doctors to prescribe a drug that has been approved for one disease to treat another — in this case, COVID-19. About 60% of the patients received hydroxychloroquine for about five days. They did not show any lower rate of needing ventilators or a lower risk of dying during the study period compared to people not getting the drug.\n  “We don’t think at this point, given the totality of evidence, that it is reasonable to routinely give this drug to patients,” says Schluger. “We don’t see the rationale for doing that.” While the study did not randomly assign people to receive the drug or placebo and compare their outcomes, the large number of patients involved suggests the findings are solid.\n        Based on the results, Schluger says doctors at his hospital have already changed their advice about using hydroxychloroquine to treat COVID-19. “Our guidance early on had suggested giving hydroxychloroquine to hospitalized patients, and we updated that guidance to remove that suggestion,” he says.\n  The original support of hydroxychloroquine came largely from a small study conducted in France that suggested people receiving the drug did better than those not getting it. In the U.S., President Trump also expressed interest in the drug as a possible way to control the growing pandemic. However , Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and member of Trump’s White House Coronavirus Task Force, urged caution and recommended more rigorous studies and data on the drug’s effect on COVID-19.\n  Still, Schluger says the urgent need to help patients in the middle of a pandemic led many doctors and hospitals to latch on to hydroxychloroquine as a potentially effective therapy. “Physicians see patients who are dying at an unbelievable rate, and want to do something to try to help them,” he says. “But I think the history of medicine shows us that some hunches are right and many, many, many of them are wrong.” In a  survey conducted by health care polling company Sermo, 55% of physicians around the world who were surveyed reported using hydroxychloroquine. Only 29%, however, rated it as highly safe — the drug is linked to higher risk of abnormal heart rhythms.\n    The results of the current study are likely to change how doctors treat hospitalized patients who are severely ill. But Schluger says it’s still possible that hydroxychloroquine can play a role in controlling COVID-19, perhaps as a way to prevent infection among people who are at high risk of getting exposed to the virus, such as health care workers. Other studies are investigating that possibility.\n  “It’s really important for us to know which treatments work, and which do not, so patients should be offered the chance to be in a clinical trial,” says Schluger. “It’s probably the best thing they can do for themselves and for society as a whole, so we can get answers really quickly to identify the treatments that work and discard the treatments that don’t work.”\n    Check the box if you do not wish to receive promotional offers via email from TIME.\n  You can unsubscribe at any time. By signing up you are agreeing to our  Terms of Use and  Privacy Policy\n    For your security, we&#39;ve sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don&#39;t get the confirmation within 10 minutes, please check your spam folder.", "posttime": "2020-05-10 02:00:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "coronavirus,冠状病毒,病毒,发现,study", "title": "迄今最大规模的研究发现羟氯喹对冠状病毒患者没有帮助", "title_en": "Largest Study To Date Finds Hydroxychloroquine Doesn't Help Coronavirus Patients", "transed": 1, "url": "https://time.com/5833945/hydroxychloroquine-coronavirus-study/", "via": "", "real_tags": ["冠状病毒", "病毒", "发现", "study"]}, {"category": "", "categoryclass": "", "imagename": "753edaf20a27638c19c266ff82e460d8.jpg", "infoid": 1001417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒促使全球突然需要人们呆在家里。软件开发人员和其他人一样，不得不过渡到在家工作的世界。GitHub对微软旗下代码共享网站GitHub的使用模式进行的一项研究发现，对于GitHub的用户来说，冠状病毒的流行意味着工作节奏和协作能力的改变，以及工作倦怠风险的增加。\n在2020年5月6日发布的《Ocverse Spotlight》分析中，GitHub将2020年前三个月与2019年前三个月进行了对比。以下是主要发现：\n开发者的活动，包括推送、拉取请求、审阅的拉取请求和每个用户的评论问题，与去年相比略有增加。这表明开发人员继续做出贡献，他们的工作流在危机期间保持了弹性。\n活动模式对职业倦怠有一定的影响。在过渡到新的工作例程期间，开发人员的活动可能会通过花更多的时间在线来维持。如果为了补充和保持健康的分离，额外的工作是以牺牲个人时间和休息为代价的，那么从长远来看，这种权衡可能是不可持续的。\n在开源项目上正在进行更多的合作。有几个开源项目的活跃度很高。此外，与一年前相比，在开源项目中合并拉请求所需的平均时间也有所下降。这些迹象表明，开源开发人员在项目上花费了更多的时间。\n工作节奏发生了变化，开发人员的工作日在工作日和周末每天都会变得长达一个小时。更长的工作时间可能是非工作中断的结果，比如家庭或照看孩子，因为现在很多人都在家里工作。\n围绕冠状病毒爆发和避难所就地订单，GitHub在企业回购中的问题起伏不定。这种流量很可能是由于转向分布式工作造成的，这打乱了企业软件开发的协调和结构。在GitHub上，这种协调通常是通过问题来处理的，团队在那里跟踪bug、增强功能和任务。\nGitHub表示，其分析表明，开发商对冠状病毒带来的变化具有弹性，活动在危机期间保持一致或增加。GitHub说，能够像开发团队一样迅速调整流程和程序并接受新工作方式的组织将具有弹性和成功。", "note_en": "The  COVID-19 virus has prompted a sudden, global need for people to stay home. Software developers, like everyone else, have had to transition to a  work-from-home world. For the users of GitHub, the COVID-19 pandemic has meant changes in work cadence and collaboration, along with an increased risk of burnout, a  GitHub study of usage patterns on the Microsoft-owned code sharing site has found.\n  In an “ Octoverse spotlight” analysis published May 6, 2020, GitHub compared the first three months of 2020 with the first three months of 2019. These were the key findings:\n Developer activity including pushes, pull requests, reviewed pull requests, and commented issues per user increased slightly year over year. This suggests developers have continued to contribute and their workflows have remained resilient during the crisis.\n Patterns of activity have implications for burnout. During the transition to new work routines, developer activity may be sustained through more time being spent online. If additional work is happening at the expense of personal time and breaks to replenish and maintain healthy separation, the tradeoff may not be sustainable in the long run.\n More collaboration is happening on open source projects. Several open source projects have seen a spike in activity. Also, the average time taken to merge a pull request in open source projects has dropped compared to a year ago. These signs suggest that open source developers are spending more time together on projects.\n The cadence of work has changed, with developers’ work days getting longer by as much as an hour per day on both weekdays and weekends. Longer days may be a result of non-work interruptions, like family or childcare, now that many are working from home.\n GitHub issues in enterprise repos have risen and fallen around COVID-19 outbreaks and shelter-in-place orders. The flux is likely due to the move to distributed work, which has disrupted the coordination and structure of enterprise software development. On GitHub, this coordination often is handled through issues, where teams track bugs, enhancements, and tasks.\n  GitHub said its analysis shows that developers have been resilient to the change wrought by COVID-19, with activity holding consistent or increasing through the crisis. Organizations that can adapt processes and procedures and embrace new ways of working as quickly as their development teams will be resilient and successful, GitHub said.", "posttime": "2020-05-10 01:59:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,开发人员,home", "title": "在家工作的开发人员会有筋疲力尽的风险吗？", "title_en": "Do Working-From-Home Developers Risk Burning Out?", "transed": 1, "url": "https://www.infoworld.com/article/3542669/github-usage-analysis-measures-covid-19-impact.html", "via": "", "real_tags": ["开发", "开发人员", "home"]}, {"category": "", "categoryclass": "", "imagename": "ebe619cc163cb2fc245b07a0f47ff163.jpg", "infoid": 1001416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果的MacBook Pro 13刚刚发布，它已经有了一个强大的对手。这个敌人并不是像我们刚刚测试的Dell XPS 13那样的常见的高端、高价的Windows主力机型，尽管它很棒。不，苹果应该担心的原因是，根据我们的姊妹网站Macworld的初步性能测试，这款售价1799美元的高端笔记本电脑可能会超过650美元的宏碁Swift 3。\n那不是打字错误。宏碁Swift 3的售价仅为650美元。但这款经济型笔记本电脑有一个秘密武器：AMD的Ryzen 74700U。当我们回顾宏碁Swift 3的时候，它超越了所有人的预期，与笔记本电脑并驾齐驱，体积更大，价格也更高。很遗憾地说，MacBook Pro 13和其他强大的机型一样处于同样的困境。继续读下去，哭吧，苹果。\nMacBook Pro 13的规格列表一直都是一流的，从基时钟为2 GHz、提升时钟为3.8 GHz的第10代酷睿i5-1038NG7开始。你可能没听说过芯片，我们也没听说过。你甚至在英特尔的官方CPU数据库中都找不到它。我们只知道这是一款基于英特尔最先进的10纳米工艺的冰湖芯片。它有四个内核，带有超线程和Iris Plus显卡。我们无法证实这一点，但我们坚信它是一款28瓦的TDP芯片，这意味着它产生的热量几乎是标准的15瓦TDP冰湖芯片的两倍，因此，从技术上讲，它运行得更快。\nMacBook Pro 13的其余部分也同样奢华，它有四个迅雷3端口，一个2560x1600分辨率的漂亮面板，16 GB的LPDDR4X/3733，以及一个512 GB的固态硬盘。奇怪的是，苹果只提供Wi-Fi 5，当你使用Wi-Fi 6路由器时，它不如Wi-Fi 6。嘿，但是你确实得到了苹果用户最讨厌的OLED触摸条。这一切只需1799美元就可以买到。它的价格和精致差不多，就像一辆欧洲高性能汽车，内饰是定制的真皮。\n然而，如果你在红绿灯下开着你的欧洲高性能汽车，一辆底漆为Datsun510的车停下来并加速引擎，会发生什么？那就是宏碁Swift 3，这是一款2.6磅、14英寸的笔记本电脑，配备Ryzen 7 4700U、8 GB LPDDR4X/3733内存、512 GB固态硬盘和Wi-Fi 6。根据公布的性能数据，我们可以实际看到会发生什么。\n我们现在拥有的基准测试是Geekbench 5，这是一种流行的测试，它使用各种合成循环来测量多核和单核性能，开发人员Primate实验室以实际应用为模型。\n在Geekbench 5的单核性能测试中，MacBook Pro 13的酷睿i5-1068NG7大获全胜。这并不令人惊讶，因为英特尔最先进的第10代芯片有许多底层增强功能，Geekbench也利用了这一点。换言之，英特尔驱动的Mac在这方面拥有相当大的优势，并首先进入下一个红绿灯。在现实生活中，这可能会转化为基于Intel的Mac在照片编辑、浏览或其他使用单个CPU内核的优化代码方面的小优势。\nGeekbench 5还测量多核性能。宏碁Swift 3的8个内核(即使没有开启SMT)轻松超过MacBook Pro 13的4个内核。这很可能意味着MacBook Pro 13在视频编码、3D建模或几乎所有依赖多核性能的方面都将与宏碁的斯威夫特3(Acer Swift 3)分庭抗礼。\n目前我们进行的最后一次性能测试是Geekbench 5的OpenCL，它使用芯片的集成显卡来执行几个计算任务。MacBook Pro 13是Iris Plus，Swift 3是Radeon。\n宏基Swift 3以一英里的优势获胜。这让我们大吃一惊，因为我们看到酷睿i7-1065G7的性能范围从戴尔XPS 13 2合1到10,000。酷睿i5-1068NG7的不足意味着其显卡速度可能低于酷睿i7-1065G7，或者操作系统优化使Windows比MacOS更快。\n最后一张图表比较的是价格，但你不需要图片就能知道，售价650美元的宏碁Swift 3比售价1799美元的MacBook Pro 13便宜1000多美元。\n当然，这不仅仅是你在为引擎买单-你也要为建造质量、面板质量、扬声器质量、键盘质量以及盖子上的徽标买单。当Datsun510在红绿灯下把我们远远甩在后面时，我们就会这么告诉自己，看看我们是否有我们的豪华欧洲性能汽车倒车。\n这显然只是一台笔记本电脑上的一个基准测试，所以我们会根据更多MacBook Pro 13的性能分数来更新SWIFT 3的性能分数。但对于MacBook Pro 13来说，这是一个糟糕的开端，而对于宏碁Swift 3来说，则是一个很好的开端。\n注：当您在点击我们文章中的链接后购买商品时，我们可能会赚取少量佣金。有关更多详细信息，请阅读我们的代销商链接政策。", "note_en": "Apple&#39;s MacBook Pro 13 just came out, and it already has a tough adversary. That foe is not the usual high-end, high-priced Windows workhorse like the  Dell XPS 13 we just tested, as great as it is. No, the reason Apple should worry is because based on our sister site Macworld&#39;s  preliminary performance tests, this $1,799 premium laptop could be lapped by the $650 Acer Swift 3.\n That&#39;s not a typo. The Acer Swift 3 costs just six hundred fifty dollars. But this budget laptop has a secret weapon:  AMD&#39;s Ryzen 7 4700U. When we  reviewed the Acer Swift 3, it surpassed all expectations by keeping pace with laptops far bigger and more expensive. And sorry to say, the MacBook Pro 13 is in the same pickle as those other powerhouses. Keep reading and weep, Apple.\n   The MacBook Pro 13&#39;s spec list is first-class all the way, starting with a 10th-gen Core i5-1038NG7 with a base clock of 2GHz and boost clock of 3.8GHz. You’ve probably never heard of the chip before, and neither have we. You can’t even find it in Intel’s official database of CPUs. All we know is it’s an Ice Lake chip built on Intel’s most advanced 10nm process. It features four cores with Hyper-Threading and Iris Plus graphics. We can’t confirm it, but we strongly believe it to be a 28-watt TDP chip, which means it can generate nearly twice the heat of a standard 15-watt TDP Ice Lake chip and therefore, technically, run faster.\n  The rest of the MacBook Pro 13 is equally luxurious, with four Thunderbolt 3 ports, a beautiful 2560x1600-resolution panel, 16GB of LPDDR4X/3733, and a 512GB SSD. Oddly, Apple gives you only Wi-Fi 5, which is inferior to Wi-Fi 6 when  you’re using a Wi-Fi 6 router. Hey, but you do get that OLED Touch Bar that  Apple users love to hate. All this can be had for a mere $1,799. It’s about as expensive and refined as a European performance car with bespoke leather interior.\n  What happens though, if you’re at a stoplight with your fine European performance car, and a primer-painted  Datsun 510 pulls up and revs its engine? That would be the Acer Swift 3, a 2.6-pound, 14-inch laptop with Ryzen 7 4700U, 8GB of LPDDR4X/3733 memory, 512GB SSD, and Wi-Fi 6. Using published performance data, we can actually see what would happen.\n  The benchmark we have now is Geekbench 5. It’s a popular test that measures multi-core and single-core performance using various synthetic loops, which developer Primate Labs has modeled on real application use.\n In Geekbench 5’s single-core performance test, the MacBook Pro 13’s Core i5-1068NG7 pulls out the win. That&#39;s no surprise, because Intel’s most advanced 10th-gen chip has many under-the-hood enhancements which Geekbench also takes advantage of. The Intel-powered Mac, in other words, has a decent edge here and gets to the next stoplight first. In real life, this might translate into a small edge for the Intel-based Mac in photo editing, browsing, or other optimized code that uses a single CPU core.\n  Geekbench 5 also measures multi-core performance. The Acer Swift 3’s 8 cores (even if they don’t have SMT turned on) easily outrun the MacBook Pro 13&#39;s 4 cores. This likely means the MacBook Pro 13 will be eating the Acer Swift 3&#39;s dust in video encoding, 3D modelling, or just about anything that relies on multi-core performance.\n   The last performance test we have at this time is GeekBench 5’s OpenCL, where it uses the chip’s integrated graphics to perform several computing tasks. For the MacBook Pro 13 it’s Iris Plus, and for the Swift 3 it’s Radeon.\n The Acer Swift 3 wins by a mile. That surprises us, because we’ve seen the Core i7-1065G7 perform in the 10,000 range from a Dell XPS 13 2-in-1. The shortfall from the Core i5-1068NG7 means its graphics could be clocked lower than the Core i7-1065G7&#39;s, or perhaps operating system optimizations make Windows faster than MacOS.\n   The last chart compares cost, but you don&#39;t need a picture to tell you that the Acer Swift 3 at $650 is over $1,000 cheaper than the $1,799 the MacBook Pro 13.\n  Of course, it’s not only the engine you’re paying for—you’re also paying for the build quality, the panel quality, the speaker quality, the keyboard quality—and the logo on the lid. That’s what we tell ourselves when the Datsun 510 leaves us so far behind at the light, we check to see if we had our luxury European performance car in reverse.\n  This is obviously just one benchmark on one laptop, so we’ll update the performance scores of the Swift 3 against more MacBook Pro 13 scores as they come out. But it&#39;s a bad start for the MacBook Pro 13, and a great one for the Acer Swift 3.\n  Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our  affiliate link policy for more details.", "posttime": "2020-05-10 01:07:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook-pro,macbook,swift,性能", "title": "售价1799美元的MacBook Pro 13与售价650美元的宏碁Swift 3：猜猜谁赢了？", "title_en": "The $1,799 MacBook Pro 13 vs. the $650 Acer Swift 3: Guess who wins?", "transed": 1, "url": "https://www.pcworld.com/article/3542609/the-1799-macbook-pro-13-vs-the-650-acer-swift-3-guess-who-wins.html", "via": "", "real_tags": ["macbook", "swift", "性能"]}, {"category": "", "categoryclass": "", "imagename": "33045d19e6f06511c7abedc86b80c6fc.jpg", "infoid": 1001415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克里斯·阿特克森是卡内基梅隆大学机器人研究所的一名教授，他观看了更多以电影、电视和电视中的机器人为特色的场景。", "note_en": "Chris Atkeson, a professor at the Robotics Institute at Carnegie Mellon University, watches more scenes featuring robots from movies and television and conti...", "posttime": "2020-05-10 00:49:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,电影,场景,robotics", "title": "CMU机器人学教授分析电影和电视中的机器人场景(连线，2000万视频)", "title_en": "CMU Robotics Prof. Breaks Down Robot Scenes from Film and TV (Wired, 20m video)", "transed": 1, "url": "https://www.youtube.com/watch?v=PJO8oks6zZk", "via": "", "real_tags": ["机器人", "电影", "场景", "robotics"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "小理查德去世了，他是第一波摇滚乐的先驱之一。他87岁了。\n理查德的真名是理查德·彭尼曼，1932年12月出生于佐治亚州的梅肯。几年来，他的健康状况一直不佳，髋关节有问题，中风和心脏病发作。\n“滚石”杂志称，理查德的儿子丹尼·彭尼曼证实了这位先驱的死讯，“但表示死因不明”。彭尼曼也向《纽约时报》证实了这一消息。梅肯警长部门没有立即回复记者的置评请求。\n在Instagram上，乐队成员凯尔文·霍利(Kelvin Holly)说：“安息吧，理查德。这个真的很刺痛。我向全世界所有的乐队成员和歌迷致以我的思念和祈祷。理查德真的是国王！“。\n理查德的职业生涯始于20世纪40年代末，但他早期与RCA Victor唱片公司合作的唱片收效甚微。1955年，他与Specialty Records签约，发行了一系列狂野而华丽的单曲-图蒂·弗鲁蒂(Tutti Frutti)、高个子萨莉(Sally)、撕开它(Rip It Up)、女孩忍不住(The Girl)、露西尔(Lucille)、保持A-Knockin‘和Good Golly、Molly小姐等-这些都让他成为大西洋两岸的明星。\n传记作家查尔斯·怀特(Charles White)将这些歌曲描述为“摇滚乐的神圣文书”。\n理查德以他在钢琴上令人震惊的表演风格而闻名-眼睛里画着睫毛膏，蓬松的头发用土豆淀粉固定，凶猛的眼睛让观众目瞪口呆-还有富有感染力的呐喊，这种风格得到了数十名表演者的呼应，普林斯就是其中的佼佼者。理查德曾是一名变装表演者，据他自己承认，他参与了偷窥癖，允许男人在他观看的同时在他的汽车后座上发生性关系。他至少两次因猥亵行为被捕。\n他的突破性单曲“Tutti Frutti”最初是关于肛交的--“如果它不合身，不要强迫它/你可以给它上油，让它变得容易”--直到制片人坎普斯·布莱克韦尔建议清理它。这首歌给摇滚乐留下了最大的欢乐表达，其确切的音节仍在争论中：“Awopbopalobop-alopbumberom！”\n在埃尔维斯·普雷斯利(Elvis Presley)的报道下-他形容理查德是“最伟大的”-图蒂·弗鲁蒂(Tutti Frutti)一举让理查德取得了成功。\n然而，1957年10月，在一次澳大利亚之旅中，理查德看到一个火球划过天空。这实际上是人造卫星1号，但他认为这是来自上帝的信号，表明他需要改变自己的方式。1958年，他成为一名传教士，1962年重返世俗音乐。上帝和魔鬼音乐之间的冲突是他余生的一个主题。\n在后来的生活中，理查德放弃了他的全性取向，解释说他曾请求上帝拯救他。“主啊，我这样做还能得救吗？”他说他问道：“理查德，一个人不能侍奉两个主人。”\n他的特长单曲对后世音乐家产生了深远的影响。保罗·麦卡特尼是他的铁杆粉丝，披头士乐队在演唱会上演唱了理查德的歌曲。\n“我可以模仿小理查德的声音，那是一种狂野、沙哑、尖叫的声音。这就像是一种灵魂出窍的体验。“麦卡特尼说。“你必须离开你目前的情感，走到你头顶上方一英尺的地方去唱这首歌。”你必须真正走出自己。“。\n周六，歌手帕蒂·史密斯(Patti Smith)说，图蒂·弗鲁蒂(Tutti Frutti)“在我八岁的时候爆炸了，唤醒了一个小女孩心中积极的无政府状态。听了他激动人心的声音后，一切都不一样了…。一个时代的告别之声；他现在与苍穹融为一体“。\n这位吉他手，Patti Smith乐队成员兼作家Lenny Kaye告诉英国卫报，当他第一次听到Tutti Frutti时，这首歌让他“在无法控制的笑声、莫名其妙的喜悦和肆无忌惮的释放和疯狂中倒在了地板上。”\n“我永远不会忘记他打开王国的钥匙，他化身的无耻，以及他提供的解放。他欣然接受摇滚乐的罪孽和救赎，因为他知道彼此都需要对方，就像摇滚乐需要摇滚乐一样。“\n2014年，AC/DC当时的歌手布莱恩·约翰逊告诉英国卫报，他第一次在电视上看到了小理查德。\n“那是一个星期六，当时是1点钟，是个阳光明媚的日子。这位女士说，“现在，从美国来的，我们有了小理查德。”就是这该死的黑人留着可笑的发型和牙齿。他他妈的比女人还漂亮。这就是Tutti Frutti…“。约翰逊装出一副松弛的下巴惊讶的样子。“他妈的怎么回事？什么都没有，然后就有了这个。“。\n尽管在1958年之后没有进入美国十大热门歌曲，但至少对理查德来说，他声称自己是摇滚乐发起人的说法从未受到严重质疑。\n1972年，他在温布利的一场演出前的新闻发布会上说：“人们试图夺取马赫的王位。”由“新音乐快报”(The New Music Express)的尼克·肯特(Nick Kent)演绎。“有伪装者，兄弟。让我告诉你，我就是这位校长。我不是在吹嘘，我也不是在吹嘘，啊，我是摇滚乐的合法之王。\n“你看爱丽丝·库珀和[米克]·贾格尔化妆啊，他们多年来一直在化妆。所有的DEM伙计都从我这里拿到了那些东西，这不是谎言。“。\n齐柏林飞艇乐队的吉他手吉米·佩奇说，理查德是“摇滚乐的先驱”，而“海滩男孩”的作词人布莱恩·威尔逊说，“他一开始就在那里，向我们所有人展示了如何摇滚乐”。\n吉他手史蒂维·范·赞特说理查德是“发明摇滚乐的人”。埃尔维斯把它普及了。查克·贝瑞是讲故事的人。理查德就是其中的原型。“。\n前披头士乐队鼓手林戈·斯塔尔在推特上写道：“上帝保佑小理查德，我一直以来的音乐英雄之一。祝他的家人平安，充满爱意。“\n对于制作人尼罗·罗杰斯来说，流行音乐只是在哀悼“失去了一位真正的巨人”。", "note_en": "Little Richard, one of the pioneers of the first wave of rock’n’roll, has died. He was 87.\n  Richard, whose real name was Richard Penniman, was born in Macon, Georgia in December 1932. He had been in poor health for several years, suffering hip problems, a stroke and a heart attack.\n Rolling Stone magazine  said Richard’s son, Danny Penniman, confirmed the pioneer’s death, “but said the cause of death was unknown”. Penniman also confirmed the news to the New York Times. The  Macon sheriff’s department did not immediately respond to a request for comment.\n On Instagram,  band member Kelvin Holly said: “Rest in peace, Richard. This one really stings. My thoughts and prayers go out to all my bandmates and fans all over the world. Richard truly was the king!”\n Richard’s career began when in the late 1940s but his early recordings with the RCA Victor label garnered little success. His breakthrough came when he signed to Specialty Records in 1955, releasing a run of wild and flamboyant singles – Tutti Frutti, Long Tall Sally, Rip It Up, The Girl Can’t Help It, Lucille, Keep A-Knockin’ and Good Golly, Miss Molly, among others – that made him a star on both sides of the Atlantic.\n The biographer Charles White described the songs as “holy writs of rock’n’roll”.\n  Richard was known for his outrageous performance style at the piano – eyes lined with mascara, pompadour hair fixed with potato starch, ferocious eyes transfixing audiences – and infectious whoops, a style echoed by dozens of performers, Prince prominent among them. Richard had been a drag performer and by his own admission was involved in voyeurism, allowing men to have sex in the back seat of his car while he watched. He was arrested at least twice for lewd conduct.\n His breakthrough single, Tutti Frutti, was originally about anal sex – “If it don’t fit, don’t force it / You can grease it, make it easy” – until producer Bumps Blackwell suggested it be cleaned up. The song bequeathed rock’n’roll its greatest expression of joy, whose exact syllables are still debated: “Awopbopaloobop-alopbamboom!”\n Covered by Elvis Presley – who described Richard as “the greatest” – Tutti Frutti catapulted Richard to success.\n In October 1957, however, during a tour of Australia, Richard saw a fireball crossing the sky. It was actually the Sputnik 1 satellite, but he took it as a sign from God that he needed to change his ways. In 1958 he became a preacher, before returning to secular music in 1962. The conflict between God and the devil’s music was a theme for much of the rest of his life.\n In later life, Richard  renounced his omnisexuality, explaining he had asked God to save him. “Lord, can I do this and still be saved?” he said he asked, to be told: “Richard, no man can serve two masters.”\n His Specialty singles exerted a profound influence on a later generation of musicians. Paul McCartney was a huge fan, and the Beatles performed Richard’s songs in concert.\n “I could do Little Richard’s voice, which is a wild, hoarse, screaming thing. It’s like an out-of-body experience,” McCartney said. “You have to leave your current sensibilities and go about a foot above your head to sing it. You have to actually go outside yourself.”\n On Saturday the singer Patti Smith said Tutti Frutti “exploded when I was eight years old, awakening a positive anarchy in a little girl’s heart. Nothing was the same after hearing his exciting and excitable voice … Farewell voice of an age; he commingles with the firmament now”.\n The guitarist, Patti Smith band member and writer  Lenny Kaye told the Guardian the first time he heard Tutti Frutti, the song caused him “to fall to the floor in uncontrollable laughter, inexplicable joy and unbridled release and madness.\n “I have never forgotten his key to the kingdom, the outrageousness he personified, and the liberation he offered. He embraced the sin of rock’n’roll as well as its salvation, knowing that each needs the other, as the rock needs the roll.”\n In 2014, AC/DC’s then singer Brian Johnson told the Guardian about seeing Little Richard on television for the first time.\n “It was a Saturday, it was one o’clock and it was sunny day. And this woman was going, ‘And now, from America, we have Little Richard.’ And it was this fucking black guy with this fucking ridiculous hairdo and teeth. He was fucking prettier than a woman. And it was Tutti Frutti …” Johnson mimed slack-jawed amazement. “What the fuck? There was nothing, and then there was this.”\n Despite not having a top 10 US hit after 1958, to Richard, at least, his claim to be the originator of rock‘n’roll was never in serious question.\n “People have tried to claim mah throne,” he told a press conference before a show at Wembley in 1972,  as rendered by Nick Kent of the New Musical Express. “There are pretenders, brother. Lemme tell ya, I am the o-riginal. I’m not boastin’ and I’m not braggin’, ah am the rightful King of Rock n’ Roll.\n “You see Alice Cooper and [Mick] Jagger wearing make-up – ah have bin wearin’ make-up for years. All dem fellas copped that stuff fro’ me an’ that’s no lie.”\n  Led Zeppelin guitarist Jimmy Page  said Richard “pioneered rock’n’roll”, while the Beach Boys lyricist Brian Wilson  said “he was there at the beginning and showed us all how to rock’n’roll”.\n The guitarist Stevie van Zandt  said Richard was “the man who invented rock’n’roll. Elvis popularised it. Chuck Berry was the storyteller. Richard was the archetype.”\n The former Beatles drummer, Ringo Starr, tweeted: “God bless Little Richard, one of my all-time musical heroes. Peace and love to all his family.”\n To producer Nile Rodgers, pop music was simply mourning the “loss of a true giant”.", "posttime": "2020-05-10 00:48:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "去世,rock,摇滚乐", "title": "摇滚乐先驱小理查德去世，享年87岁", "title_en": "Little Richard, rock'n'roll pioneer, dies aged 87", "transed": 1, "url": "https://www.theguardian.com/music/2020/may/09/little-richard-dies-aged-83-rock-n-roll-pioneer", "via": "", "real_tags": ["去世", "rock", "摇滚乐"]}, {"category": "", "categoryclass": "", "imagename": "8431121b94c2180ad529d18f46ac699f.png", "infoid": 1001413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenPose代表了第一个在单个图像上联合检测人体、手、面部和脚部关键点(总共135个关键点)的实时多人系统。\n它的作者是吉恩斯·伊达尔戈、哲·曹、托马斯·西蒙、魏世恩、朱汉斌和亚瑟·谢赫。目前，它由吉恩斯·伊达尔戈(Gines Hidalgo)和雅达夫·拉吉(Yaadhav Raaj)维护。此外，如果没有CMU全景工作室数据集，OpenPose是不可能实现的。我们也要感谢所有以任何方式帮助OpenPose的人。主要贡献者在doc/Contributors.md中列出。\n作者Gines Hidalgo(左)和Hanbyul Joo(右)在CMU全景工作室前。\n功能：2D实时多人关键点检测：15或18或25个关键点身体/脚部关键点估计。运行时间与检测到的人数不变。\n输入：图像、视频、网络摄像头、Flir/Point Grey和IP摄像头。包含C++演示以添加您的自定义输入。\n输出：基本图像+关键点显示/保存(PNG、JPG、AVI等)、关键点保存(JSON、XML、YML等)和/或关键点作为数组类。\n2019年1月：改进的Python API发布！包括身体、面部、双手以及C++API的所有功能！\n3个可用的姿势估计库之间的推断时间比较：OpenPose、Alpha-Ppose(快速Pytorch版本)和Mask R-CNN：\n该分析针对每个算法使用相同的图像，批次大小为1。每次分析重复1000次，然后取平均值。这一切都是在NVIDIA 1080Ti和CUDA 8的系统上进行的。Megvii(Face++)和MSRA GitHub存储库被排除在外，因为它们只提供被裁剪的人的姿势估计结果。然而，它们遭遇了与Alpha-Ppose和Mask R-CNN相同的问题，它们的运行时间随着人数的增加而线性增长。大多数用户不需要OpenPose C++/Python API，只需使用OpenPose Demo即可：\nOpenPose Demo：轻松处理图片/视频/摄像头，并显示/保存结果。参见doc/demo_overview.md。例如，使用以下命令在视频中运行OpenPose：\n校准工具箱：轻松校准3-D OpenPose或任何其他立体视觉任务的相机。请参见doc/module/cal_module e.md。\nOpenPose C++API：如果您想要读取特定的输入，和/或添加您的自定义后处理函数，和/或实现您自己的显示/保存，请查看示例/Tutorial_api_cpp/和doc/library_introtion.md上的C++API教程。您可以在Examples/USER_CODE/上创建自定义代码，并在编译整个OpenPose项目时使用CMake快速编译它。快速添加您的自定义代码：有关详细信息，请参阅Examples/USER_CODE/readme.md。\nOpenPose Python API：类似于C++API，可以在Examples/Tutorial_API_python/上找到Python API的教程。\n没有身体关键点检测的面部关键点检测：如果您想要加快检测速度(同时减少检测到的面数)，请检查doc/standalone_face_or_hand_keypoint_detector.md.中的opencv-face-Detector方法。\n使用您自己的面/手检测器：可以将手和/或面关键点检测器与您自己的面或手检测器一起使用，而不是使用身体检测器。例如对于手可见但身体不可见的相机视图有用(OpenPose检测器将失败)。见doc/standalone_face_or_hand_keypoint_detector.md.。\n在doc/Speed_up_openpose.md上查看OpenPose基准测试以及加快和/或降低OpenPose内存需求的一些提示。\n有关脚部数据集的详细信息，请查看脚部数据集网站和新的OpenPose论文。\n我们的图书馆是开源的，用于研究目的，我们希望不断完善它！所以请让我们知道如果..。\n..。您会发现OpenPose似乎无法正常工作的视频或图像。请随时将它们发送到openposecu@gmail.com(仅限失败情况下发送电子邮件！)，我们将使用它们来提高算法的质量！\n..。您向某个类或某个新的Worker子类添加了一些功能，我们可能会合并这些子类。\n您只需在gihub上发表评论或提出拉取请求，我们会尽快回复！如果您使用该库制作很酷的演示或YouTube视频，请发送电子邮件给我们！\n如果这些论文对你的研究有帮助，请在你的出版物中引用这些论文。OpenPose的大部分是基于[8765346]的。此外，手部和面部关键点检测器是[8765346]和[Simon等人]的组合。2017](面部检测器使用与手部检测器相同的程序进行训练)。\n@文章{8765346，作者={Z.{CaO}和G.{伊达尔戈·马丁内斯}和T.{西蒙}和S.{魏}和Y.A.{谢赫}}，期刊={模式分析和机器智能学报}，标题={OpenPose：使用部分亲和场的实时多人二维姿势估计}，年份={2019年}}@InProcessing{simon2017Hand，作者={Tomas Simon和Hanbyul Joo和Iain Matthews and Y。年份={2017}}@正在进行{cao2017realtime，作者={曹哲和托马斯·西蒙以及魏世恩和亚瑟·谢赫}，书名={cvpr}，标题={使用部分亲和场的实时多人2D姿势估计}，年份={2017}}@正在进行{wei2016cpm，作者={Shih-en wei and Varun Ramakrishna and Takeo Kanade和Yaser Sheikh}，书名。\nOpenPose可免费用于非商业用途，并可在这些条件下重新分发。有关详细信息，请参阅许可证。对商业许可证感兴趣吗？检查此Flintbox链接。对于商业查询，请使用Flintbox链接中的Contact部分，并将该消息的副本发送给Yaser Sheikh。", "note_en": "OpenPose represents the  first real-time multi-person system to jointly detect human body, hand, facial, and foot keypoints (in total 135 keypoints) on single images.\n It is  authored by  Gines Hidalgo,  Zhe Cao,  Tomas Simon,  Shih-En Wei,  Hanbyul Joo, and  Yaser Sheikh. Currently, it is being  maintained by  Gines Hidalgo and  Yaadhav Raaj. In addition, OpenPose would not be possible without the   CMU Panoptic Studio dataset. We would also like to thank all the people who helped OpenPose in any way. The main contributors are listed in  doc/contributors.md.\n Authors  Gines Hidalgo (left) and  Hanbyul Joo (right) in front of the  CMU Panoptic Studio\n  Functionality: 2D real-time multi-person keypoint detection: 15 or 18 or  25-keypoint body/foot keypoint estimation.  Running time invariant to number of detected people.\n Input: Image, video, webcam, Flir/Point Grey and IP camera. Included C++ demos to add your custom input.\n Output: Basic image + keypoint display/saving (PNG, JPG, AVI, ...), keypoint saving (JSON, XML, YML, ...), and/or keypoints as array class.\n  Jan 2019:   Improved Python API released! Including body, face, hands, and all the functionality of the C++ API!\n            Inference time comparison between the 3 available pose estimation libraries: OpenPose, Alpha-Pose (fast Pytorch version), and Mask R-CNN:\n This analysis was performed using the same images for each algorithm and a batch size of 1. Each analysis was repeated 1000 times and then averaged. This was all performed on a system with a Nvidia 1080 Ti and CUDA 8. Megvii (Face++) and MSRA GitHub repositories were excluded because they only provide pose estimation results given a cropped person. However, they suffer the same problem than Alpha-Pose and Mask R-CNN, their runtimes grow linearly with the number of people.       Most users do not need the OpenPose C++/Python API, but can simply use the OpenPose Demo:\n OpenPose Demo: To easily process images/video/webcam and display/save the results. See  doc/demo_overview.md. E.g., run OpenPose in a video with:\n  Calibration toolbox: To easily calibrate your cameras for 3-D OpenPose or any other stereo vision task. See  doc/modules/calibration_module.md.\n OpenPose C++ API: If you want to read a specific input, and/or add your custom post-processing function, and/or implement your own display/saving, check the C++ API tutorial on  examples/tutorial_api_cpp/ and  doc/library_introduction.md. You can create your custom code on  examples/user_code/ and quickly compile it with CMake when compiling the whole OpenPose project. Quickly  add your custom code: See  examples/user_code/README.md for further details.\n OpenPose Python API: Analogously to the C++ API, find the tutorial for the Python API on  examples/tutorial_api_python/.\n  Face keypoint detection  without body keypoint detection: If you want to speed it up (but also reduce amount of detected faces), check the OpenCV-face-detector approach in  doc/standalone_face_or_hand_keypoint_detector.md.\n Use your own face/hand detector: You can use the hand and/or face keypoint detectors with your own face or hand detectors, rather than using the body detector. E.g., useful for camera views at which the hands are visible but not the body (OpenPose detector would fail). See  doc/standalone_face_or_hand_keypoint_detector.md.\n    Check the OpenPose Benchmark as well as some hints to speed up and/or reduce the memory requirements for OpenPose on  doc/speed_up_openpose.md.\n   For the foot dataset, check the  foot dataset website and new  OpenPose paper for more information.\n  Our library is open source for research purposes, and we want to continuously improve it! So please, let us know if...\n ... you find videos or images where OpenPose does not seems to work well. Feel free to send them to  openposecmu@gmail.com (email only for failure cases!), we will use them to improve the quality of the algorithm!\n  ... you added some functionality to some class or some new Worker subclass which we might potentially incorporate.\n Just comment on GitHub or make a pull request and we will answer as soon as possible! Send us an email if you use the library to make a cool demo or YouTube video!\n  Please cite these papers in your publications if it helps your research. Most of OpenPose is based on  [8765346]. In addition, the hand and face keypoint detectors are a combination of  [8765346] and  [Simon et al. 2017] (the face detector was trained using the same procedure than the hand detector).\n @article{8765346, author = {Z. {Cao} and G. {Hidalgo Martinez} and T. {Simon} and S. {Wei} and Y. A. {Sheikh}}, journal = {IEEE Transactions on Pattern Analysis and Machine Intelligence}, title = {OpenPose: Realtime Multi-Person 2D Pose Estimation using Part Affinity Fields}, year = {2019}}@inproceedings{simon2017hand, author = {Tomas Simon and Hanbyul Joo and Iain Matthews and Yaser Sheikh}, booktitle = {CVPR}, title = {Hand Keypoint Detection in Single Images using Multiview Bootstrapping}, year = {2017}}@inproceedings{cao2017realtime, author = {Zhe Cao and Tomas Simon and Shih-En Wei and Yaser Sheikh}, booktitle = {CVPR}, title = {Realtime Multi-Person 2D Pose Estimation using Part Affinity Fields}, year = {2017}}@inproceedings{wei2016cpm, author = {Shih-En Wei and Varun Ramakrishna and Takeo Kanade and Yaser Sheikh}, booktitle = {CVPR}, title = {Convolutional pose machines}, year = {2016}}\n    OpenPose is freely available for free non-commercial use, and may be redistributed under these conditions. Please, see the  license for further details. Interested in a commercial license? Check this  FlintBox link. For commercial queries, use the  Contact section from the  FlintBox link and also send a copy of that message to  Yaser Sheikh.", "posttime": "2020-05-10 00:48:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "用于,real,openpose", "title": "OpenPose：用于人体估计的实时多人关键点检测库", "title_en": "OpenPose: Real-time multi-person keypoint detection library for body estimation", "transed": 1, "url": "https://github.com/CMU-Perceptual-Computing-Lab/openpose", "via": "", "real_tags": ["用于", "real", "openpose"]}, {"category": "", "categoryclass": "", "imagename": "d34995a6cad581ccde8ec15cad4b5c68.png", "infoid": 1001412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本章分三个阶段回顾了1984-1995年贝特森文献项目的工作。首先是引言，概述背景和成果。其次，在三个标题下更详细地介绍一些剑桥赛皮克的藏品：化妆、面孔和脸部绘画、动物和鸟类。最后，对目前的赛皮克艺术和文化在线报价进行了回顾，并对未来的发展提出了建议。在计算机化编目的第一阶段和数码摄影之前，贝特森项目的时机给剑桥留下了一个尴尬的混合结果。现在，20多年过去了，现在是一个很好的机会来回顾项目成果，展示它们到目前为止的用处，并反思分享和重新参与的机会。\nCET ESAI回溯到三个阶段(1984-1995)。L‘Introduction en Présene le Context et les résultats.。Elivie Est suivie par une présentation加上détaillée des Collection Sepik de Cambridge réunies sous trois rubrique：睫毛膏、面容和面霜、Animaux和oiseaux。这篇文章讨论了联合国发明家和发明家米塞斯和艺术与文化的关系，建议未来的发展和发展。(注：发明家和发明家的关系)(译者注：发明家和发明家的关系)(译者注：发明家和发明家的关系)。Le Projet Bateson Fut Entrepris Lors des Preièresélaborations de CatalogageéElectrtronique，Bien Avant l‘Popition des Photoies Digitales。Ceci eut Pour résultat de laisser Cambridge avec un尴尬的混合喷气式飞机。Aussi，quelque vingt anans plus tard，il paraüt utilser de graser un bilan du projet，de montrer son utilitéet de réfléchiràl‘Opportunitéde Son partage de sa realty et sa réactivate.。\n侯德页。\n1格雷戈里·贝特森(Gregory Bateson)1929年2月至1930年3月和1932年2月至1933年春在中塞皮克的伊特穆尔(Iatmul)进行实地考察期间，为剑桥大学考古与人类学博物馆(当时的CUMA，现在的MAA-考古与人类学博物馆)收集了约600件SEPIK藏品。再加上类似数量的现场照片和欧内斯特·W。P.。钦纳利，杰克·A。托特。加利福尼亚州瑟斯顿。b.。汉弗莱斯，弗朗茨·基尔施鲍姆神父和G·G·罗杰斯，这在MAA形成了一个强大的Sepik收藏品语料库。1984-1995年的贝特森文档项目可以被视为在全球共享这些藏品的道路上迈出的一大步。\n2然而，由于对贝特森的纳文专著及其揭示的摄影插图(贝特森，1980-1958/1936和他之前的大洋洲文章(贝特森，1932年)的持久欣赏，剑桥赛皮克的藏品对专家来说是相当熟悉的。来自剑桥的8件展品被列入“塞皮克，巴布亚新几内亚的艺术”展览(Peltier和Schindlbeck，2015：CAT 28，73，92，93,104,120,155,156)。2015年10月在巴黎伴随着这次展览举行的研讨会是回顾剑桥赛皮克藏品和贝特森项目的绝佳机会。\n3 20世纪80年代初，在剑桥大学(我在那里选修了社会人类学和博物馆的工作)完成了新设立的社会人类学硕士学位后不久，我被MAA的新几内亚材料所吸引。1984年在Fitzwilliam博物馆举行的MAA百年纪念展览有一个部分介绍了托雷斯海峡、马西姆和巴布亚湾收藏品在哈登和克拉克领导下的博物馆早期历史中的重要性。贝特森在百年纪念展览指南中有整整一页提到，作者们得出的结论是。\n“他的想法超前于他的时代。贝特森离开英国去了美国，剑桥的人类学走了一条不同的路“(艾宾和燕子，1984：24)。\n1贝特森的工作继续激励着其他许多人(例如：Silverman，2001；Herle and Moutu，(……)\n4很明显，格雷戈里·贝特森(Gregory Bateson)的“纳文”(Bateson，1980)继续要求人们关注和评价，因为它不同寻常地强调了一种文化的民族精神和Eidos内部的动态。他在剑桥的藏品吸引了人们的注意，这是因为面具和人物雕刻令人惊叹的美丽，也是因为收藏家自己提供了详细的参考资料。贝特森使用了预先打印的标签，并亲自完成了对象索引卡，以及关于特定对象类型的几个摘要。这是一个理想的计算机数据库试点案例，贝特森项目被启动，并在博物馆民族志小组(Lovelace，1985)的时事通讯中向英国博物馆专业人士宣传。\n2 MDA于1970年由英国博物馆协会信息检索小组发展而来(……)。\n5由于博物馆文献协会2也在剑桥，该大学是计算机化编目的种子床，我们能够使用这项技术的新一代修订后的数据捕获，一个名为麝香猫的程序(Lovelace，1986)。SEPIK的材料也吸引了我，因为我对主题分析很着迷。有影响力的是道格拉斯·牛顿对马鲁板的分析，其中包括许多剑桥作品(1963年)，以及雷马尔·舍福尔德(Reimar Scheold)关于塞皮克钩子(Sepik Hook)人物的工作(1966年)。后来，我看到了海伦·丹尼特(Helen Dennett，1975)的“麦碧龙·塞皮克”(Mak Bilong Sepik)，它以重新绘制的设计的清晰度和范围而闻名，并在知名的情况下归功于个别当代艺术家。逐渐地，在贝特森项目中，几个方面的工作结合在一起：在计算机数据库上进行详细的编目，数码前的黑白物体摄影，以及尝试进行主题分析，这通常是从铅笔开始，然后是墨水画。\n6在计算机数据库中，Bateson的原始加入记录与上文较新的更详细的描述分开保存。由于对贝特森为数不多的已发表的实地照片的详细评论备受赞赏，因此打印并编目MAA档案中的所有照片似乎也是至关重要的。博物馆摄影师格维尔·欧文(Gwil Owen)制作了这些黑白现场照片的原版照片，其中有600多张(约400张来自塞皮克)。\n7贝特森文件项目产生了一份6卷的打印件，一份用环形活页夹打印的打字稿，其中有交错的物体照片和草图，以及贝特森的一些实地照片。“贝特森项目报告(1984-1995年)”共六卷，编排如下：\nSEPIK食品制备和陶器；油漆托盘；普通和毒品容器；搅拌器；玩具。\n3贝特森的田野笔记和来自联合田野TR(……)的丰富的田野笔记和摄影记录。\n8每个目录部分都以一篇文章开始，回顾贝特森自己的评论并总结其他来源，这种结构的灵感主要来自巴塞尔博物馆für Völkerkunde的Iatmul-Objektkatalog(Obrist等人)。，1984)。巴塞尔显然是考察访问的首选。大量巴塞尔博士研究人员在舒斯特的领导下，在中世纪不同的地方研究不同的主题，对直接记录在Iatmul-Objektkatalog中的特定对象的意义和用法的理解产生了巨大的影响。为了使主题分析有价值，关键是要尽可能多地查看比较作品的样本，拍摄彩色照片并绘制细节草图。MAA Crowther-Beynon基金提供了一笔旅行补助金，用于前往巴塞尔，然后前往美国，参观东海岸的博物馆收藏品，并查阅国会图书馆3中贝特森的实地笔记。后来有可能访问柏林，检查1960年代已经用黑白摄影出版的赛皮克资料(凯尔姆，1966-1968)。\n9主题分析的努力是耗时的，这也是该项目扩大到填补多年工作的原因之一，尽管事实很快就变得很清楚，如果没有当地的知识和评论，主题分析本身只能带我们走到这一步。我终于“放手”，在1995年完成了数据库。贝特森项目是1998年在剑桥举行的太平洋艺术协会-欧洲会议上提出的，但我在格拉斯哥(当时的利兹)担任世界文化策展人的全职工作非常吸引人，而且由于各种原因，该项目的大部分内容此后一直没有发表。\n10然而，1995年存放的部分印刷品已被证明对来访的研究人员很有用，并从2000年起在Andrew Moutu和MAA之间的博士和伙伴关系期间使用，这导致了“成对的兄弟、隐藏和启示”展览和随附的小册子(Herle和Moutu，2004年)。Moutu于2001年至2002年在Kanganamun进行了深入的博士田野研究，因此为解释该集合带来了特别相关的视角(Moutu，2013)。他还对贝特森的Sepik现场照片发表了评论，这些照片被添加到目录中，并于2014年在穆图担任巴布亚新几内亚国家博物馆馆长期间(2010-2016年)在网上公开。展览小册子复制了几张关键的贝特森野外照片，并举例说明了知名艺术家通过穆图的努力获得的新雕刻。Raymond Amongsingwemi等人雕刻的一位同修把头靠在他母亲兄弟的大腿上，是一件具有战略意义的杰出作品(Herle and Moutu，2004，封面)。Ngomotu雕刻的另一件关键作品展示了鱼女人Mariamngawinjowa和她的两个孩子的创造性转变过程(Herle和Moutu，2004：9)。与土著人民及其博物馆合作是MAA工作的重点，负责任的当代收藏也是如此(Herle，2005)。\n11回到贝特森项目本身，而不是工作以来，我们应该注意到贝特森自己对广泛的中世纪塞皮克艺术的评论。在他的大洋洲文章中，贝特森在他的大洋洲文章中区分了六种Iatmul装饰艺术，从精心制作有用的物体细节(例如，小心地捆绑成斧头)，到贝壳、羽毛和树叶的装饰，然后使用非代表性的几何设计，增加纯粹的传统面孔，广泛使用图腾表现，到木制肖像头部和过度造型的头骨上的现实表现的最终顶点(Bateson，1932：这种进步在一定程度上反映在贝特森项目报告之后的顺序上，其中人物雕刻，特别是最神圣的头部和乐器排在最后。然而，贝特森对伊特穆尔图腾和模式的多次引用表明，这位最初的西方局外人的发展与局内人的模式不符。\n12外部分析者永远不能确定即使是基本的几何图案差异也没有意义，或者仅仅是“常规的”。贝特森描述了Iatmul对。\n“水面上的涟漪和波浪的性质。有人暗地里说，人、猪、树、草--世界上所有的东西--都只是波浪的图案……“。(贝特森1980：230)。\n13个不同的氏族声称他们自己的元素图腾是风浪的首要原因。因此，相同的图案对不同的氏族有不同的含义。我们需要更多的人种志来记录伊特穆尔和其他塞皮克艺术家的直接遗嘱，以便更好地理解塞皮克艺术的财富。最近的一个很好的例子是Claytus Yambon关于在美拉尼西亚：艺术与邂逅中用石头与铁器雕刻的描述(Yambon，2013：120)。\n4为独木舟面具1935.144指定了氏族祖先名称；图形挂钩1935.62和1935.71，TH(.)。\n14由于伊特穆尔人神圣知识的分级、秘密和竞争性质，贝特森只被告知了雕刻中描绘的一个氏族祖先的名字11次：-一个独木舟面具，两个象征性的吊钩，六个麦面具和‡水桶4。图钩1935.71，贝特森被告知它代表人类祖先库伦-埃夫旺(图2)。(1)，用红色粘土和赭石绘制，自然地雕刻成圆形。躯干和背部刻有非常复杂的瘢痕疙瘩伤疤图案，就像背部鳄鱼的鳞片一样。贝特森指出，这些非常复杂的伤疤图案在萨沃人比钱布里人更常见，据说这些雕刻是从钱布里人那里掠夺过来的。他在Mindimbit绘制了鳄鱼疤痕图案的草图(贝特森项目中的图4.2.1)。在他关于数字钩子的一般笔记中，他还警告说，伊特穆尔对大兵的描述\n图1-人物挂钩1935.71，贝特森被告知它代表了人类祖先库伦-埃夫旺，前视图和后视图。\n在人像雕刻上，15张脸和头部比身体的其他部位要详细得多，只有在一小部分雕刻上，生殖器才特别清晰。这是贝特森收藏中的一件独一无二的物品，用来按压同修的头部(图5.1.1a 1935.19仪式用枕头)。安德鲁·穆图(Andrew Moutu)认识到1930.336和1930.337这对图形的重要性，因为这对哥哥和弟弟能够代表一半(赫尔和穆图，2004年的封底)，还有另一对1935.38A和B有着明显的女性生殖器。\n16捕捉化妆舞会的戏剧性需要的不仅仅是一系列面具，贝特森描述了不同化装舞会背景下的许多元素，并给我们留下了几张关键的现场照片，例如拿着鱼雕的Wagan舞蹈(Bateson，1980：plate xxviii B)和Wagan植物雕塑(Bateson，1980：plate xxviii A)。他还获得了很好的乐器选择，这些乐器是向男性同修透露的分级萨克拉的一部分。这对来自马林盖的1930.496和1930.497长笛非常特别(Peltier和Schindlbeck，2015年：272Cat155和156Cat)。贝特森在“鹰”上的短文介绍了伊特穆尔音乐(1935年)这一主题，这个主题现在被更好地理解了。\n17贝特森的收藏包括10个Iatmul mai面具的例子(他使用的拼写是mwai，但mai现在被更普遍地接受)，这些面具在少年印心结束时游行和跳舞，从男子礼仪馆前建造的一个特殊平台上下来。他在野外笔记本(GN1)中详细绘制了全套服装的草图，其中包含了麦面具，这与巴里·克雷格(Barry Craig)1981年在科罗戈拍摄的镶嵌麦面具的描述和照片进行了比较是很好的(Howarth，2015：46和48)。\n18 Hauser-Schäublin的报告为我们提供了更多的细节和背景，说明了命名的祖先灵魂是如何被邀请进入物质形态的，以及表演的全部复杂性(Hauser-Schäublin，1976-77和1981)。1972年，她在卡拉劳目睹了麦面具的雕刻和围绕这一仪式的仪式，还见证了1979年在同一村庄举行的一些麦面具展览的最后准备工作。国会图书馆的一张贝特森照片显示了一个临时舞台，上面挤满了许多MAI表演者(LibC SPEA Container 92 Tambunum 1930？)，这与Hauser-Schäublin的一张照片(Hauser-Schäublin，1981：49 Abb)非常相似。2)。巴里·克雷格(Barry Craig)在他关于“神话与魔术”(Myth And Magic)中面具的章节中更新了这一点，并用他自己从Kaminimbit和Korogo拍摄的照片，以及中塞皮克的Iatmul的Mai面具仪式和Murik湖的吹嘘面具仪式进行了比较(Craig，2015：45-49)。\n19 2004年，安德鲁·穆图(Andrew Moutu)为“配对兄弟”(Pair Brothers)展览为麦面具1935.165写了一个标签，它放大了贝特森的麦笔记，然后加以说明：\nMwai是典型的长鼻子面具，以当地单词Nassa shell命名，用油和木头固定在雕刻上。有两种类型的Mwai面具。宽的是女的，窄的是男的。每个Mwai面具都有一个特定于一个氏族的个人名字。有一些特殊的Mwai面具，属于整个Iatmul地区的部族所有。当侄子被展示他母亲的Mwai或帮助他母亲的氏族雕刻Mwai时，可能会由侄子母亲的兄弟们举行纳文仪式。Mwai面具是公开展示的，但它们的大部分宇宙学意义只为少数启蒙的人所知。为了隐瞒这一信息，格雷戈里·贝特森只被告知，Mwai面具有一些神秘之处“(2014年MAA数据库1935.165在线记录，网址为：http：//maa.cam.ac.uk/CATEGORY/COLLECTIONS-2/CATALOGOG/未提供2017年5月)。\n20剑桥高级男子住宅使用的更宽、更大和多面的阿旺面具的唯一例子是最近由Moutu收集并由Peter Bonapan在Tambunum制造的面具(Herle and Moutu，2004：40)。MAA贝特森的照片包括一张展示了两个这样的面具，或者说是两个阿旺的主要元素在男人的房子里存放的照片(图4)。2)。在国会图书馆的档案中有一张儿童将顶部面具戴在一个小阿旺结构上的照片(照片打印背面的编号：20731)，还有一张照片是孩子们看着一个戴着西米棕榈鱼面罩的年轻人(没有。(20736)。然而，贝特森能够收集到一个由七个Sawos篮子头盔形状的面具组成的强大团队，主要来自Nggaigo Revwi(Gaikorobi)，剑桥还有另外两个大的长鼻子或喙的篮子面具，来源和地点未知。掌心\n21贝特森还收集了五个较小的独木舟面具，它们的脸更宽，背部平坦，固定在战争独木舟前面的“盾牌”上。柏林和AMNH也有这样的选择。贝特森只收集了面具，没有收集盾牌。Peltier和Schindlbeck在“蒙面盾牌Cat 183”描述中的注解。\n“每艘独木舟上都有一个氏族祖先的名字，物体周围的羽毛都与这个祖先联系在一起。在塞皮克中部，作为某些仪式的一部分，这些盾牌可以放在大的狭缝锣上“(Peltier和Schindlbeck，2015：299，我的翻译)。\n22主题调查表明，眼睛和嘴巴的形状是赛皮克艺术中不同面部特征中变化最大的。贝特森发现，一些眼睛形状确实与特定的动物或精神类型有关。大多数Iatmul石灰葫芦上雕刻的护目镜面孔被识别为Windsimbu木酒的面孔(在Bateson项目中，图3.4.1f)。巴塞尔的一个骷髅架上出现了一张类似的调色板框眼睛的脸。贝特森(1935.144)收集的其中一个独木舟面具，周围有类似的收紧或护目镜的眼睛，但这个面具的名字是雕刻者的氏族祖先精灵KWOLIU。一个简单的眼罩，由贝特森，1930.157A收集，具有类似的形状，弗洛伦斯·韦斯报告说，它是在温德辛布节日期间佩戴的(韦斯，1984：A2)。\n23简短标题t。\n..", "note_en": "This chapter reviews the work of the 1984-1995 Bateson documentation project in three stages. First an introduction with an overview of the context and outcomes.   Secondly a more detailed presentation of some of the Cambridge Sepik collections under three headings: masquerade, faces and face-painting, animals and birds. Finally the current on-line offer for Sepik art and culture will be reviewed, and suggestions made for future developments. The timing of the Bateson project, during the first phases of computerised cataloguing and before digital photography, left Cambridge with an awkward hybrid result. Now, more than 20 years on, is a good opportunity to review the project outcomes, show their usefulness to date, and reflect on opportunities for sharing and re-engagement.\n  Cet essai retrace les trois phases du « Projet de Documentation Bateson, 1984-1995 ». L’introduction en présente le contexte et les résultats. Elle est suivie par une présentation plus détaillée des collections Sepik de Cambridge réunies sous trois rubriques : mascarade, visages et peintures faciales, animaux et oiseaux. Cet article se termine par un inventaire des mises en ligne de l’art et des cultures du Sepik, tout en suggérant des développements futurs. Le projet Bateson fut entrepris lors des premières élaborations de catalogage électronique, bien avant l’apparition des photographies digitales. Ceci eut pour résultat de laisser Cambridge avec un embarrassant projet hybride. Aussi, quelques vingt ans plus tard, il paraît utile de dresser un bilan du projet, de montrer son utilité et de réfléchir à l’opportunité de son partage et de sa reprise et sa réactivation.\n Haut de page\n      1 Gregory Bateson collected around 600 Sepik items for the Cambridge University Museum of Archaeology and Anthropology (then  cumaa , now  maa   –  Museum of Archaeology and Anthropology), during his fieldwork amongst the Iatmul of the Middle Sepik from February 1929 to March 1930 and from February 1932 to the spring of 1933. Together with a similar number of field photographs and a few objects from  Ernest W . P .  Chinnery, Jack A . T .  Thurston, C . B .  Humphreys, Father Franz Kirschbaum and G.   Rogers , this forms a strong corpus of Sepik collections at   maa . The 1984-1995 Bateson documentation project can be seen as a big step on the way to sharing these collections worldwide.\n  2 The Cambridge Sepik collections, however, are fairly well known to specialists, because of the enduring appreciation of Bateson ’s    Naven  monograph and its revealing photographic illustrations (Bateson ,  1980-1958/1936 and his previous Oceania article (Bateson ,  1932).   Eight items from Cambridge were included in the exhibition  “ Sepik, Art of Papua New Guinea ”  (Peltier and Schindlbeck ,  2015: cat 28, 73, 92, 93, 104, 120, 155, 156). The seminar that accompanied this exhibition in Paris in October 2015 was a great opportunity for a review of the Cambridge Sepik collections and the Bateson project.\n    3 In the early 1980s shortly after finishing the newly created MPhil in Social Anthropology at the University of Cambridge (where I did the option on Social Anthropology and the Work of the Museum), I was drawn to the New Guinea material at  maa . The  maa  Centenary Exhibition, held at the Fitzwilliam Museum in 1984, had a section on the importance of the Torres Straits, Massim and Papuan Gulf collections in the early history of the museum under Haddon and Clarke. Bateson has a full page mention in the centenary exhibition guidebook where the authors conclude that\n  “his ideas were ahead of his time. Bateson left England for the United States and anthropology at Cambridge took a different course ”  (Ebin and Swallow ,  1984: 24).\n  1  Bateson ’s  work has continued to inspire many others (for example: Silverman, 2001 ;  Herle and Moutu,  (...)\n  4 It was clear that Gregory Bateson ’s    Naven  (Bateson ,  1980) continued to demand interest and appraisal because of its unusual emphasis on the dynamics within both the ethos and eidos of a culture. His Cambridge collections attracted attention due to the stunning beauty of the masks and figure carvings, and also because of the detailed referencing provided by the collector himself. Bateson used pre-printed labels and personally completed the object index cards, together with several summaries on particular object types. It was an ideal case for a computer database pilot and the Bateson project was launched and publicised to the  uk  museum profession in the newsletter for the Museum Ethnographers Group (Lovelace ,  1985) 1 .\n  2  The  mda  developed out of the Information Retrieval Group of the  uk ’s  Museums Association in the 197  (...)\n  5 As the Museum Documentation Association 2  was also in Cambridge the University was a seed bed for computerised cataloguing and we were able to use a new revised generation of this technology for data capture, a programme called  muscat  (Lovelace ,  1986). The Sepik material also appealed to me because of my fascination with motif analysis. Influential was Douglas Newton s analysis of the malu boards which incorporated many of the Cambridge pieces  (1963) and also the work by Reimar Schefold on Sepik hook figures (1966).  Later I came across “Mak Bilong Sepik” by Helen Dennett (1975), which is notable for the clarity and range of re-drawn designs it features, and the crediting of individual contemporary artists where known . Gradually several strands of work came together in the Bateson project: detailed cataloguing on a computer database, pre-digital black and white object photography, and an attempt at motif analyses which often began with pencil then ink drawings.\n  6 In the computer database the original accession records by Bateson were kept separate from the newer more detailed descriptions, which went above. As the detailed comments on Bateson ’s  few published field photographs were so greatly appreciated it also seemed crucial to print and catalogue all those in the  maa  archive. Gwil Owen, the museum photographer, produced master prints of these black and white field photographs, of which there are over 600 (around 400 from the Sepik).\n  7 The Bateson documentation project resulted in a six - volume printout, a typescript in ring-binders with interleaved object photographs and sketches and some of Bateson ’s  field photographs. The six volumes of the Bateson Project Report (1984-1995) are as organised as follows:\n  Sepik Food Preparation and Pottery; Paint-trays; Containers  –  general and for narcotics; Fly whisks; Toys\n  3  Bateson ’s  field notes and the abundant field notes and photographic records from the joint field tr  (...)\n  8 Each catalogue section begins with an essay reviewing Bateson ’s  own comments and summarising other sources, a structure largely inspired by the Iatmul-Objektkatalog at Basel Museum  für Völkerkunde  (Obrist   et al . , 1984). Basel was an obvious first choice for a research visit. The large group of Basel PhD researchers, studying different topics in different places in the Middle Sepik under Meinhard Schuster, had made a huge impact on the understanding of particular object meanings and usage, directly recorded in the Iatmul-Objektkatalog. To make the motif analysis worthwhile it was crucial to view as large a sample of comparative pieces as possible, take colour photographs and sketch details. The  maa  Crowther-Beynon fund provided a grant for travel to Basel, then to the  usa , to visit museum collections on the eastern seaboard and consult Bateson ’s  field notes in the Library of Congress 3 . Later it was possible to visit Berlin, to examine the Sepik material already published with black and white photography in the 1960s (Kelm ,  1966-1968).\n  9 The effort at motif analysis was time-consuming, and one of the reasons the project expanded to fill many years ’  work, despite the fact that it soon became clear that without local knowledge and comment the motif analyses themselves can only take us so far. I finally  “ let go ”  and completed the database in 1995. The Bateson project was presented at the Pacific  Arts Association – Europe meeting in Cambridge in 1998, but the full-time commitments of my work as a curator of World Cultures in Glasgow, then Leeds, were very absorbing, and for a variety of reasons the bulk of the project has since remained unpublished.\n  10 However, the partly printed collation deposited in 1995 has proved useful to visiting researchers, and was used during the PhD and partnership between Andrew Moutu and   maa  from 2000 onwards, which resulted in the exhibition  “ Paired Brothers, Concealment and Revelation ”  and accompanying booklet (Herle and Moutu, 2004). Moutu conducted intensive doctoral field research from 2001-2002 in  Kanganamun  so brought a particularly relevant perspective to the interpretation of the collection (Moutu, 2013). He also provided comments on Bateson ’s  Sepik field photographs, which were added to the catalogue and made public on-line in 2014, during the period when Moutu was director of the National Museum of Papua New Guinea (2010-2016). The exhibition booklet reproduced several key Bateson field photographs as well as illustrating the new carvings acquired by named artists through Moutu ’s  efforts. The carving of an initiate resting his head on his mother ’s  brother ’s  lap by Raymond Amongsingwemi and others is a strategic and brilliant work (Herle and Moutu, 2004, front cover). Another key piece, carved by Ngomotu,   demonstrates the process of creative transformation by showing the fish woman Mariamngawinjowa with her two children (Herle and Moutu ,  2004:   9).   Working in partnership with indigenous peoples and their museums is a key focus of the work at  maa , as is responsible contemporary collecting (Herle, 2005).\n  11 Returning to the Bateson project itself, rather than work since, we should take note of Bateson ’s  own comments on the wide range of Middle Sepik art.  In his Oceania article Bateson distinguished six types of Iatmul decorative art in a series progressing from the elaboration of useful details on objects (e.g. the careful binding for hafting axe-blades), through the ornamentation with shells, feathers and leaves, then the use of non-representational geometric designs, the addition of purely conventional faces, the broad use of totemic representations, to the final apogee of the realistic representations found on wooden portrait heads, and over-modelled skulls (Bateson, 1932: 261-262). This progression is partly reflected in the order followed by the Bateson project report, where the figure carvings, and particularly the most sacred heads and musical instruments come last. However, Bateson ’s  many references to Iatmul totems and patterns indicate that this initial Western outsider ’s  progression does not match the insider ’s  model.\n  12 The outside analyser can never be certain that even the basic geometric pattern differences have no meaning, or are just  “ conventional ” . Bateson describes  Iatmul fascination with the\n  “nature of ripples and waves on the surface of water. It is said secretly that men, pigs, trees, grass – all the objects in the world – are only patterns of waves...” (Bateson 1980: 230)\n  13 Different clans assert the primacy of their own elemental totems as causation for the wind and waves. So the same pattern will have different meanings for different clans. We need more ethnographies that record direct testaments from Iatmul and other Sepik artists, to better understand the wealth of Sepik art. A good recent example is the account by Claytus Yambon on carving with stone versus iron tools in Melanesia: Art and Encounter (Yambon ,  2013: 120).\n  4  Clan ancestor names are given for the canoe mask 1935.144; the figure hooks 1935.62 and 1935.71, th  (...)\n  14 Because of the graded, secret and competitive nature of Iatmul men’s sacred knowledge Bateson was only told the name of a clan ancestor depicted in a carving 11 times: – for one canoe mask, two figurative suspension hooks, six   mai  masks and ‡water drums 4 . The figure hook 1935.71, which Bateson was told represents the human ancestor   Kworem-Avwun    (fig.     1) , is painted with red clay and ochre and naturalistically carved in the round. The torso and back are carved with a very complex keloid scar-pattern, like the scales of a crocodile on the back. Bateson notes that these very complex scar patterns are more common to the Sawos than the Chambri, from which the carving was said to have been looted. He made sketches of crocodile scar patterns at Mindimbit (Figure 4.2.1 in the Bateson project). In his general notes on figure hooks he also warned that the Iatmul description of a given hook as a particular ancestor was an identification that probably only occurred in a ritual context, for example when that ancestor ’s  name songs were being sung. Then the hook figure would be specially decorated with totemic plants such as hibiscus flowers and hung with baskets of offerings (Bateson ’s  general notes on hooks at  maa , partly reproduced in the 1934 Sepik Display Handbook).\n  Figure 1. – Figure hook 1935.71, which Bateson was told represents the human ancestor Kworem-Avwun, front and back views\n  15 Faces and heads are much more detailed than the rest of the body on the figure carvings, and only on a small proportion of carvings are the genitals particularly clear. This is so for a unique item in Bateson ’s  collection, used to press down the heads of initiates (Fig 5.1.1a 1935.19 ceremonial pillow). Andrew Moutu recognised the importance of the figure pair 1930.336 and 1930.337 as a pair of elder and younger brothers able to represent moieties (Herle and Moutu, 2004 back cover), and there is another figure pair 1935.38A and B with obvious female genitals.\n    16 Capturing the drama of masquerade requires more than a collection of masks, and Bateson describes many elements of different masquerade contexts, and left us with several key field photographs, such as that of the   wagan  dancing with nets holding a fish carving ( Bateson,  1980 :  Plate  xviii  B) and   wagan  plant sculptures ( Bateson,  1980 :  Plate   xxviii  A). He also acquired a good selection of musical instruments, which are part of the graded sacra revealed to male initiates. The pair of flutes, 1930.496 and 1930.497, from Malingai, are exceptional (Peltier and Schindlbeck, 2015: 272 Cat 155 and 156). Bateson ’s  short article in  “ The Eagle ”  introduced the topic of Iatmul music (1935), a subject now much better understood.\n  17 Bateson ’s  collection includes ten examples of the Iatmul   mai  masks (he used the spelling   mwai  but   mai  is now more commonly accepted), which are paraded and danced at the conclusion of junior initiations, descending from a special platform built in front of the men ’s  ceremonial house. He did a detailed sketch of the full costume which incorporates the   mai  mask, in a field notebook (GN1), and it is good to compare this with the description and photograph of a mounted Mai mask by Barry Craig taken in Korogo in 1981 (Howarth ,  2015:   46 and 48).\n  18 Hauser-Sch ä ublin’s  reports give us much more detail and context for how the named ancestor spirit is invited to enter the physical form, and the full complexity of the performance  (Hauser-Sch ä ublin,  1976- 7 7 and 1981). She witnessed the carving of   mai  masks and the ritual surrounding this at Kararau in 1972 and also the final preparations for the exhibition of some   mai  masks in the same village in 1979. A Bateson photograph in the Library of Congress shows a temporary stage with many   mai  performers crowded on it (LibC SPEA Container 92 Tambunum 1930?), that is very similar to one of  Hauser-Sch ä ublin’s  photographs ( Hauser-Schäublin,  1981 :  49 Abb. 2). Barry Craig brings this up to date in his chapter on masks in  “ Myth and Magic ” , with his own photographs from  Kaminimbit  and Korogo, and a comparison between the   mai  mask ceremonies of the Iatmul in the Middle Sepik and the Brag masks of the Murik Lakes (Craig ,  2015: 45-49).\n  19 In 2004 Andrew Moutu wrote a label for the   mai  mask 1935.165, for the  “ Paired Brothers’ exhibition, which amplifies and then caveats Bateson ’s    mai  notes:\n  “  Mwai  are typically long-nosed masks, named after the local word for nassa shells, which are fixed onto the carving with oil and wood. There are two types of   mwai  masks. the wider one is female and the narrower is male. Each   mwai  mask has a personal name specific to a clan. There are particular   mwai  masks, which are owned by clans throughout the entire Iatmul region. When a nephew is shown his mother ’  s   mwai  or helps to carve a   mwai  for his mother ’  s clan, a   naven  ceremony may be performed by the nephew ’  s mother ’  s brothers.   Mwai  masks are shown publicly but much of their cosmological significance is known only to a few initiated men. In order to conceal this information, Gregory Bateson was told only that there was something mysterious about   mwai  masks” ( maa  database record for 1935.165 on-line in 2014 at   http://  maa  .cam.ac.uk/category/collections-2/catalogue/  not available May 2017).\n  20 The only example of the broader, larger and multi-faced   awan  masks for the senior men ’s  house at Cambridge is one collected recently by Moutu and made by Peter Bonapan in Tambunum (Herle and Moutu, 2004: 40). The  maa  Bateson photographs include one showing two such masks, or the major elements of two   awan  in storage in the men ’s  house   (fig.     2).    In the Library of Congress archives is a photograph of children putting the top mask on a small   awan  structure (no. 20731 on back of photo print), and another of children watching a young person wearing a sago palm-spathe fish mask (no.   20736). Bateson was able, however, to collect a strong group of seven Sawos basketry helmet shaped masks, mostly from Nggaigo Revwi  (Gaikorobi) , and there are two other large long snouted or beaked basketry masks at Cambridge, source and place of origin unknown. The palm spathe or basketry supports for the Iatmul   mai  and   awan  were often made by or recycled from previous creations by the Sawos, and the contrast and inter-dependence between these artforms is still being explored. Some   awan  include very lively animal totem forms which suggest very close relations which Sawos makers (Kaufmann ,  2010, Photo 8, Museum der Kulturen Basel Vb 22114).\n    21 Bateson also collected five of the lesser canoe masks, with their broader faces and flat backs, which are attached to the  “ shields ”  at the front of war canoes. Berlin and  amnh  also have a selection of these. Bateson only collected the masks, not the shields. Peltier and Schindlbeck note in the description of the masked shield Cat 183\n  “Each canoe carried the name of a clan ancestor and the feathers around the object are linked to this ancestor. In the Middle Sepik, as part of certain ceremonies, these shields could be placed on the large slit gongs” (Peltier and Schindlbeck ,  2015: 299 ,  my translation).\n    22 The motif investigation showed that eye and mouth shape are the most varied of the different facial features in Sepik art. Bateson found that some eye shapes do relate to specific animals or spirit types. The goggle-eyed faces carved on the majority of Iatmul lime gourds are identified as the faces of Windsimbu wood spirits (Figure 3.4.1f in the Bateson project). A similar palette-framed goggle-eyed face appears on a skull rack at Basel. One of the canoe masks collected by Bateson, 1935.144, has a similar pinched or goggle eye surround, but this has the name of a clan ancestral spirit of the carver, KWOLIU. A simple eye mask, collected by Bateson, 1930.157A, has a similar shape, and Florence Weiss reports that it is worn during a Windsimbu festival (Weiss, 1984: A2).\n  23 A brief caption t\n......", "posttime": "2020-05-10 00:48:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "带入,gregory,贝特森", "title": "将格雷戈里·贝特森的塞皮克藏品带入数字时代(2018年)", "title_en": "Bringing Gregory Bateson’s Sepik Collections into the Digital Age (2018)", "transed": 1, "url": "https://journals.openedition.org/jso/8526", "via": "", "real_tags": ["带入", "gregory", "贝特森"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1001411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒在很大程度上颠覆了航空业，并将其带上了有史以来最疯狂的旅程。没有人能预测到如此规模的大流行会产生如此深远的灾难性影响。但我不需要重述冠状病毒的恐怖。很有可能你自己也在亲身体验。我可以告诉你的是，在一个消费者需求因冠状病毒或一些空乘人员喜欢将其称为“罗娜”(Rona)而导致消费者需求不存在的行业里，被认为是一名必不可少的工人是什么感觉。(我有时会想，我的工作组中的大多数人是否不喜欢在日常对话中使用太多的多音节单词。)。\n你有没有回过信去参加一个晚宴，结果到了那里，却发现很多与会者在最后一分钟取消了？你以为你会度过一个美好的夜晚，但现在你发现自己在假装与几个参加这个悲伤派对的参与者进行尴尬的交谈，同时在脑海里琢磨着什么时候是找个借口离开的最好时间，这样你就可以回家加热冷冻披萨，看Hulu了。这就是冠状病毒时代做空姐的感觉。国内航班很少有超过20人的航班，而且大多数乘客都是空闲的机组人员。空头是我们在旅行的一段或多段期间，航空公司作为乘客运送我们时使用的一个术语。误航可能有很多原因，尽管最近这种情况发生得越来越频繁，因为航空公司取消了太多航班，以至于调度员们争先恐后地让机组人员从A点到B点，这样他们就可以先飞到C点，然后再飞回A点。这听起来既困惑又毫无意义，对吧？\n所以我坐在这里，盯着一架几乎空荡荡的飞机。收入乘客似乎很少想要食物和饮料方面的任何东西，这是可以接受的，因为该行业已经将机上服务削减到了小瓶水和预先包装的零食。他们中的许多人静静地坐着，几乎没有眼神交流，因为他们享受着戴着N95面具带来的安全感。当安全带指示灯亮着的时候，行为不端的乘客对站起来没有任何顾虑，到处都找不到。除了最近我和一位乘客的一次奇怪的互动，他因为喷气式飞机驾驶台上没有排着行李车而变得敌意(这是即使在冠状病毒爆发之前也从未做过的事情)，其他的航班都很无聊，也很平淡无奇。顺便说一句，那个女人独自旅行，带着一个狗窝，一个婴儿，一个汽车座椅和两个手提包，然而机场在她下机时没有任何东西或任何人准备好帮助她，这是不对的。对不起，甜心，也许你一直处于昏迷状态，最近没有出门，也没有读过任何新闻报道。我们正处于一场全球大流行之中。所以你可以大发雷霆，但登机口代理不会成为你的私人贴身男仆，因为你没有足够的上天赋予的常识来相应地计划你的旅行。\n在这个冠状病毒时代，工作航班最具挑战性的部分是与其他空乘人员保持社交距离。天哪，我不知道这是什么，但空乘人员似乎最难理解，社交距离的基石意味着要时刻与所有人练习-这包括其他空乘人员！我真的认为我的一些同龄人有这样的印象，即我们对冠状病毒有一些尚未被科学家发现的超级免疫力，但与此同时，这是我们之间的一种默契。他们认为，我们在这些飞机上花费了如此多的时间在空中，接触到如此多不同的人，以至于我们的免疫系统肯定已经建立起了对罗纳的抵抗力。不对!。\n“说真的，你不觉得我们现在都已经感染病毒了吗？”如果再有一个空乘人员问我这个问题，而我们一起坐在跳椅上，我可能会倾向于直接打开机门跳下飞机。不，我没有，我正试着让它保持原样。几个月前，我甚至让一位空姐同事给我讲了一个她与冠状病毒抗争的故事，让我高兴不已。我没有勇气告诉她，她向我描述的听起来更像是严重的宿醉。我正忙着确保她在厨房里站在离我至少六英尺远的地方。好像我每退一步，她就往前走一步。忘了胡椒喷雾吧。我愿意付出任何代价来换取一小罐莱索尔消毒喷雾，这种喷雾可以粘在我的钥匙环上，在这种情况下可以兼作权宜之计。由于航空业对大流行的反应，飞机从来没有变得更干净。所以从好的方面来说，如果厨房里挤满了喋喋不休的空姐，我总是可以躲在洗手间里，感觉很好，因为这些洗手间终于得到了他们应该做的深度清洁。", "note_en": "The coronavirus has pretty much turned the aviation industry upside down and taken it on its wildest ride ever. No one could have ever predicted a pandemic of this proportion to have this kind of far-reaching catastrophic effect. But I don’t need to recap the horrors of COVID-19. Chances are you are experiencing it first-hand yourself. What I can tell you about is what it’s like to be deemed an essential worker in an industry where consumer demand is nonexistent as a result of the coronavirus, or as some flight attendants like to refer to it, “Rona.” (I sometimes wonder if the general population of my workgroup has an aversion to using too many multisyllabic words in day-to-day conversation.)\n Have you ever RSVP’d for a dinner party only to get there and discover that many of the attendees cancelled at the last minute? You thought you were going to have a wonderful evening, but now you find yourself feigning awkward conversation with the few participants who did show up to this sad party while wondering in the back of your mind when would be the best time to excuse yourself and leave just so you can go home to heat up a frozen pizza and watch Hulu. That’s what being a flight attendant in the COVID-19 era feels like. The domestic flights rarely have more than 20 people on board, and most of the passengers are deadheading crew. Deadheading is a term that we use when the airline flies us as passengers during one or more segments of our trip. Deadheading can happen for many reasons, although these days it’s happening more frequently because airlines have cancelled so many flights that schedulers are scrambling to get crews from point A to point B just so they can work a flight to point C and then deadhead back to point A. Sounds confusing and pointless, right?\n So here I sit, staring at an almost empty plane. The revenue passengers rarely seem to want anything with regards to food and drink, which is fine since the industry has whittled inflight service down to small bottles of water and prepackaged snacks. Many of them sit quietly, barely making eye contact as they enjoy the sense of security that comes from wearing a N95 mask. Misbehaved passengers who have no qualms about getting up when the seat belt sign is on are nowhere to be found. Other than one weird interaction I recently had with a passenger who became hostile because there were no luggage carts lined up on the jet bridge (something that was never done even pre-coronavirus), the flights have been boring and uneventful. That woman by the way was traveling by herself with a dog kennel, a baby, a car seat and two carry-on bags, and yet the airport was in the wrong for not having anything or anyone ready to assist her as she deplaned. Sorry, sugar, but maybe you’ve been in a coma, haven’t gone outside or read any news stories lately. We are in the middle of a global pandemic. So you can throw a fit, but the gate agent is not going to be your personal valet because you didn’t have enough god-given common sense to plan your travels accordingly.\n The most challenging part about working flights in these coronavirus times is maintaining social distance from other flight attendants. Jesus, I don’t know what it is but flight attendants seem to have the hardest time comprehending that a cornerstone of social distancing means practicing it at all times with all people —   this includes other flight attendants! I really think some of my peers are under the impression that we have some super immunity to COVID-19 that has yet to be discovered by scientists, but in the meantime, it’s an unspoken understanding between us. They believe we spend so much time in the air on these planes, coming in contact with so many different people that our immune systems must have built up a resistance to Rona. WRONG!\n “ Seriously though, don’t you think that by now we’ve all already been exposed and probably have the virus?” If one more flight attendant asks me this while we are sitting together on the jumpseat, I might be inclined to just open the aircraft door and jump out. No, I don’t have it, and I am trying to keep it that way. I even had one fellow flight attendant regale me with a story about her battle with the coronavirus a few months ago. I didn’t have the nerve to tell her that what she was describing to me sounded more like a really bad hangover. I was too busy making sure she was standing at least six feet away from me in the galley. It seemed like every time I took one step backward, she took another step forward. Forget pepper spray. I’d give anything for a small can of Lysol disinfectant spray that could attach to my key ring and double as mace in situations like this. The planes have never been cleaner as a result of the industry’s response to the pandemic. So on the bright side, I can always hide in a lavatory if the galley gets too crowded with chatty flight attendants and feel good about being in there since these lavs are finally getting the deep cleaning they deserve.\n The overnight stays on my trips are different now too. Hotel check-ins now consist of wiping down all the surfaces and light switches in the room with antibacterial wipes. Since most cities are under shelter-in-place guidelines and I want to stay as safe and healthy as possible, the thought of venturing outside is far removed from my mind. Factor in that the hotel gyms, pools and restaurants are also closed, and my antibacterial wipe down ritual is the highlight of the layover.\n This is the new normal. Even when the pandemic comes to an end and travel demand picks up, all of our behaviors will have changed as a result of COVID-19. Airline crew members… airport employees… passengers. We will all act differently. The days of carefree travel are long gone.", "posttime": "2020-05-10 00:47:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,人员,attendants", "title": "空乘人员与冠状病毒", "title_en": "Flight Attendants and Covid-19", "transed": 1, "url": "https://confessionsfromaflightattendant.wordpress.com/2020/05/07/flight-attendants-and-covid-19/", "via": "", "real_tags": ["冠状病毒", "病毒", "人员"]}, {"category": "", "categoryclass": "", "imagename": "4b22f0769d5d63b239b2fff37264705d.png", "infoid": 1001410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我开始管理的时候，我知道我在学习一门手艺。我愿意在这件事上表现得很差劲。我愿意多年来每天都在做这项工作，以期有一天能做得很好。我承认，一夜之间成为一名伟大的管理者没有捷径或诀窍。几年后，当我发现有一件事几乎立刻让我成为一名更好的经理时，我笑得前仰后合：向慈善专业汇报工作。\n我这么说并不是说Charity是一个完美的经理或个人。她在饮水机和Keurig上到处都是苹果酒粉，这只是她最小的缺点-还有其他的，它们很重要。她在推特上说的话经常让我变得😍，但有时也让我变得😬😶🙃🤐。几乎每个试图大规模效仿Charity的管理风格的人都会以宏伟的风格熄灭-她比我认识的任何人都更善于用自己的优势来弥补自己的弱点，而且她的优势远远超出了钟形曲线的右侧。\n我也不自称是一个完美的经理。当我说“让我成为一名更好的经理”时，我的意思是我成为了一个明显更有能力雇佣一个伟大的团队，让这个团队快乐和成功，并帮助那个团队快速发货、维护和改进伟大产品的人。但我有一个清单，上面列出了我未来继续努力或希望改变的事情-我没有错，管理好是一项你多年来一直致力于的技能。\n这些是Charity做的最重要的事情，1.在我认识的工程经理中相对少见，2.给了她巨大的影响力，让我作为一名直线经理更成功：\n交流得更多--多得多。我记得当我刚开始在蜂巢工作的时候，我花了相当长的时间想，“她为什么要跟我说这个？”慈善机构有时会每周对产品或团队进行几次看似随意的观察，让我感到厌烦。在1：1的时间里，她会告诉我她对业务或产品的一些方面的最新想法，这些方面有时似乎超出了我的薪酬等级，或者超出了我的领域。她还会就团队问题征求我的意见，即使她并不是真的需要我的支持才能继续前进。我在大量的背景下茁壮成长，所以我喜欢它，但我情不自禁地觉得我很幸运，在邮件中收到了一份原本打算送给别人的礼物。现在我回过头来看，那些谈话是我们工作关系的基础。我最初是作为IC加入蜂巢的，我认为一开始我非常安静和谨慎，对任何事情都有一点犹豫不决。那些与Charity的早期对话给了我所需的背景，让我了解我在哪里可以最有用，但它们也传达了信任。他们认为我的想法和声音很重要(我最始终如一的缺点之一就是我总是猜错了什么时候重要，什么时候不重要)。我们想出了如何相互交谈。我们想出了如何让分享容易的东西变得真正容易，这样只有难的东西才需要变得难。我们建立了正常听起来是什么样子的基线，这样我们就可以知道事情什么时候偏离了轨道。\n代表某件事，告诉人们这件事。慈善机构在Velocity 2016上做了一个主题演讲，名为《一位年轻女士关于技术决策的插图入门读本》。这本书充满了做出技术决策的伟大指针，但潜在的世界观-技术和工程团队的存在是为了服务于企业，而且我们在做出决策时往往没有考虑到企业的最佳利益-让人感觉既100%正确，又令人耳目一新。慈善机构有自己的观点，她会选择立场，她会让人们知道她站在哪一边。这很重要，有几个原因。首先，创始人和高管都有自己的观点；他们都站在自己的立场上。当你知道你的创始人在可能引起争议的事情上的立场时，它会让你自由行动，减少摩擦，减少担忧。例如，我知道Charity通常和我一样不喜欢基于证书的把关方式--我之所以知道，是因为她不止一次在公开场合说过这件事，而不仅仅是1：1对我说过。每个质疑我决定的人都听到了同样的话。这使得我可以更安全地去面试一位看起来很有前途但简历上没有名牌公司或学校的候选人。明确地说，公共价值观解放了员工，让他们可以积极行动，而不是不得不缓慢地对组织进行笔试，寻找阻力。第二，蜂巢是一家初创公司。我努力工作使公司成功，有时在晚上，有时在周末。如果公司非常成功，创始人会赚很多钱，比我赚的钱多得多。只有当我相信我的创始人将是那种会让世界变得更好而不是更糟的富人时，我才会觉得这一现实是可持续的。\n不要试图做到完美。作为一个男孩子，我曾经非常害怕犯任何错误。\n向您的网络提供帮助并接受其帮助。慈善机构拥有我见过的最令人惊叹的职业关系网之一。如果你把每一个相信自己是Charity的真实生活或网友的工程师都集中在一个屋檐下，这个房间里可能会有更多的工程人才，而不是谷歌位于山景城的主要园区。从Charity的网络中，我雇佣了令人惊叹的工程师，我遇到了与我分享他们的建议和故事的杰出的经理们，我被邀请在半个国家和半个世界的会议上发言。我真的不知道她是如何有耐心或能力将她在Twitter上与之发生争执的人变成朋友和盟友的，我也不指望能弄清楚这一点，但我从她那里学到了很多关于如何与你的网络中的人合作的知识。珍惜他们，把他们介绍给你网络中的人，他们会从见面中受益，投入比你期望的更多，不要害怕向他们寻求帮助。实际上，大多数人喜欢在以下情况下得到帮助：1.他们通常喜欢你；2.他们觉得你在以奉承的方式认可他们的特定专长；3.你让他们做起来很省事，而且考虑到了他们的时间。这改变了我的一生。\n渴望获得新的信息，并愿意利用这些信息做点什么。担任领导职务最困难的一件事是，你的职位越高，返回给你的关于团队中实际完成的工作和实际的人际互动的信息就越少。为了弥补这一点，你必须积极寻求新的信息和反馈。你必须牢牢抓住你听到的信息，并将其归档到某个地方，即使它与你眼前的现实不符。您并不总是能够解决您听说的事情，无论是因为成本原因而又被锁定三个月的次优工具选择，还是妨碍您的团队尽可能自主地工作的不良管理习惯。不是每件破烂的东西都能一次修好，有时你会先关注最重要的。但是，如果你怀着好奇和开放的心态倾听，并承诺尽最大努力实际利用这些信息，你就会为未来收到更多类似的信息敞开大门。这是避免逐渐沦为弊大于利的脱离现实的独裁者的唯一可能方法之一。慈善机构和我过去经常在产品规划和产品路线图上合作，我总是对她经常挖掘我对产品工作的想法和意见感到敬畏和有点担忧，即使我们意见不一致，甚至当我的观点都是错的时候也是如此。™我们最终得到了一些有效的东西，让我们克服了整个公司在一个房间里大喊大叫一周和组织良好的过程之间的鸿沟，产生合理的结果，并将每个人的日程安排减少到最低限度。我们最终得到了一些有用的东西，让我们克服了整个公司在一个房间里大喊大叫一周和一个组织良好的过程之间的鸿沟，这个过程产生了合理的结果，并最大限度地减少了对每个人时间表的消耗。如果没有Charity愿意挖掘更多信息并勇于尝试新事物，这一点就不会发生。\n相信人们，支持他们，然后给他们空间。留出空隙，让其他人跳进去。慈善机构曾将创始人在公司中的角色描述为闪电-当他们专注于一件特定的事情时，他们拥有很大的权力，但往往在瞬间就消失了。慈善有时会在感觉很重要的事情中消失，我过去常常感到沮丧，但后来我会注意到：结果几乎总是好的。现实情况是，我和其他同事已经控制住了局面，经常不得不跳槽来填补我想象中的慈善机构会拥有的空白，这实际上是帮助我成长的东西。我知道是这样。很多。今天更多的是关于如何管理整个高功能的工程组织，而不是我第一次出现在Honeycomb时，这几乎从来不是因为Charity在这条路上的每一步都牵着我的手。那是因为她看到了我可以做得更多的地方，她就让开了。我很会处理工作中的许多事情，我知道这是一项有用的技能，但我也知道，如果没有仔细的管理，这对我的团队来说是一件坏事-如果我不随着团队的发展移交责任，我就不会留下梯子让其他人向上爬。\n列出这些要点很容易，但在实践中要把它们都列出来却难得令人难以置信。我现在已经有了其他经理向我汇报，我仍然觉得我每天都在努力为他们做这些事情，并且保持一定的连贯性。在糟糕的日子里，我提醒自己，虽然所有这些都很有用，但有一件事最重要：信任。慈善在我的日常生活中是一种不一致的存在-她经常为了演讲安排而出差，她的睡眠时间表是我听说过的最奇怪的，有时作为一名创始人，她的睡眠时间是最高的", "note_en": "When I started managing, I knew I was learning a craft. I was willing to suck at it. I was willing to put in the work every day for years to someday be great at it. I accepted that there were no shortcuts or hacks to becoming a great manager overnight. And I laughed my ass off a few years later, when I noticed there was one thing that did truly make me a better manager almost instantly: reporting to Charity Majors.\n  I don’t say any of this to suggest that Charity is a flawless manager or person. She gets powdered apple cider mix all over the water dispenser  and the Keurig, and that is only her most trivial flaw — there are others, they matter. The things she says on Twitter often make me 😍 but sometimes they also make me 😬 😶 🙃 🤐. And nearly everyone who tries to emulate Charity’s management style wholesale will flame out in grand style — she is better than anyone I know at compensating for her weaknesses with her strengths, and her strengths are far to the right of the bell curve.\n I don’t profess to be a flawless manager either. When I say “made me a better manager,” I mean that I became a person demonstrably more able to hire a great team, make that team happy and successful, and help that team quickly ship, maintain, and improve great products. But I have a laundry list of things I continue to work on or hope to change in the future — I was not wrong that managing well is a craft you dedicate yourself to working at continually for many years.\n  These are the top things Charity does that 1. are relatively rare among engineering managers I know and 2. gave her a tremendous amount of leverage to make me more successful as a line manager:\n Communicate more —  way more. I remember when I first started at Honeycomb, I spent a fair amount of time wondering, “Why is she talking to me about this???” Charity would sometimes DM me with seemingly random observations a few times a week about the product or team. In 1:1s she’d give me updates on her thinking about aspects of the business or product that sometimes seemed above my pay grade or outside of my domain. She’d also ask for my opinion on team issues, even when she didn’t really need my buy-in to move forward. I thrive on a huge amount of context, so I liked it, but I couldn’t help but feel like I’d lucked out and received a gift in the mail intended for someone else.  Now I look back and see that those conversations were the foundation of our working relationship. I joined Honeycomb as an IC at first, and I think in the beginning I was  very quiet and cautious and a little hesitant about everything. Those early conversations with Charity gave me the context I needed to understand where I could be most useful, but they also conveyed trust. They suggested that my thoughts and my voice mattered (one of my most consistent flaws is that I guess wrong about when it does matter and when it doesn’t all the time). We figured out how to talk to each other. We figured out how to make sharing the easy stuff truly easy, so that only the hard stuff needed to be hard. We established that baseline of what normal sounded like, so we could tell when things got off track.\n Stand for something, tell people about it. Charity gave a keynote at Velocity 2016 called  A young lady’s illustrated primer on technical decision making. It’s full of great pointers on making technical decisions, but the underlying worldview — that technology and engineering teams exist to serve the business, and that all too often we fail to consider the business’s best interests when we make decisions — felt both 100% correct and refreshingly honest. Charity has opinions, she picks a side, she lets people know what side she’s on.  This matters for a couple of reasons. One, founders and execs have opinions; they all have sides they’re on. When you  know where your founders stand on potentially controversial things, it frees you up to act with less friction and less worry. For example, I know Charity generally shares my distaste for credential-based gatekeeping — and I know because she’s said things about it in public, more than once, not just to me in a 1:1. Everyone who is going to question my decisions heard the same thing. And that makes it safer for me to go to bat to, for example, interview a candidate that seems promising but doesn’t have brand name companies or schools on their resume. Clearly stated, public values free up employees to aggressively act on them instead of having to slowly pen-test the organization looking for resistance.  Two, Honeycomb is a startup. I work hard to make the company successful, sometimes in the evening, occasionally on weekends. If the company is wildly successful, the founders will make  a lot of money, much more than I will. That reality only feels sustainable to me when I trust that my founders will be the kind of wealthy people who will make the world better, not worse.\n Don’t try to be perfect. I used to be deathly afraid of making any kind of mistake as a manager. Making a mistake as an engineer seemed bad but less catastrophic (you could probably ship a patch to fix it, and all you had to do was live in shame for a week or two), but as a manager, people’s livelihoods and feelings were on the line. It seemed important to take as few risks as possible.  But working at a growing startup should mean experimenting regularly and often trying things that don’t work (as a manager, as a team, as product creators). So much better to focus on building up trust and good feelings, so you can quickly fix things when they go wrong.  Just like you build resilient systems that can survive a bad release or two, you should build resilient relationships. The prior positive interactions you’ve had with someone help make it possible to survive and debug saying the wrong thing or taking the wrong management tack down the line.  Charity is the master of this. She accomplishes many, many things and it is  not through always saying the right thing or never making a mistake — she uses her strengths to build up a lot of good will with people so she can dive into it from great heights when things go wrong.  Charity has always said, “Hire people for their strengths and not their lack of weaknesses.” I had heard similar assertions before, but I’d never really internalized what they meant until Honeycomb. We really believe that team of people with a diverse set of extraordinary abilities and a few known flaws will perform better than a team of people who’ve all cleared the same minimum bar in the same few skill areas. It sounds obvious in theory but in practice, almost nobody hires like that — all our interview processes are focused on weeding out weakness. We should still try to  find out where candidates are strong and where they are weak, but we should ask ourselves, can we adequately support this person in using their strengths, and do their strengths match up to where we need to grow? and not, can we find any weaknesses in this person?\n Spread the good gossip. When I say “good,” I don’t mean the juicy stuff. I mean that stuff that warms everyone’s heart like the last 10 minutes of a Hallmark movie. I know, and I’m sorry.  If someone else anywhere in the company (or outside of it!) says anything good about my work, Charity is the first person to repeat it to me, with great enthusiasm (and sometimes a little embellishment). This is the only thing on this list that is a “one easy trick” tip, and I encourage you to steal it immediately with great zeal and vigor if you don’t do it already.  It’s easy, it’s gratifying, it makes people feel good, it makes you look like you as a manager are doing your job brilliantly  and it sneakily takes way less work than manufacturing your own positive feedback, it encourages more giving of positive feedback in the future, and it binds the two other people involved together in a happy secret that will make them ever so slightly more pleased to work together the next time they cross paths.   It can be tempting to skip this if you feel like the feedback is obvious or it’s been heard before. Err on the side of repeating it anyway. The majority of employees I’ve worked with spend most of their time secretly worried they are bad at everything and everyone hates them, and a little repetition of positive feedback either helps or at least doesn’t hurt.\n Give to and accept help from your network. Charity has one of the most amazing professional networks I have ever seen. If you got every engineer who believed themselves to be a real life or internet friend of Charity’s under one roof, the room would probably have more engineering talent in it than the main Google campus in Mountain View. From Charity’s network, I’ve hired amazing engineers, I’ve met brilliant managers who have shared their advice and stories with me, and I’ve been invited to speak at conferences half way across the country and half way across the world.  I truly have no idea how she has the patience or ability to turn random people she’s had arguments with on Twitter into friends and allies and don’t expect to ever figure that out, but I have learned a lot from her about how to  work with people in your network. Cherish them, introduce them to the people in your network they’d benefit from meeting, put in more than you expect to get back, and don’t be afraid to ask them for help. Most people actually love to be asked for help when 1. they generally like you, 2. they feel like you’re recognizing their specific expertise in a flattering way, and 3. you make it low-hassle for them to do and are considerate about their time. It’s life-changing.\n Be hungry for new information and willing to do something with it. One of the hardest things about being in a leadership role is that, the higher you go, the less information gets back to you about the actual work being done and the actual human interactions on the team.  To compensate for this, you have to aggressively seek new information and feedback. You have to hang on to the information you hear and file it away somewhere even when it doesn’t match the reality you see in front of you. You aren’t always in a place to fix the thing you hear about, whether it’s a suboptimal tool choice that you’re locked into for another three months for cost reasons, or a bad management habit that is getting in the way of your team working as autonomously as they could be. Not every broken thing can be fixed at once, sometimes you focus on the most important ones first.  But if you listen with a curious and open mind and commit to trying your best to actually do something with the information, you open the door to receiving more information like it in the future. And this is one of the only possible ways to avoid progressively spiraling down into being an out-of-touch dictator who does more harm than good.  Charity and I used to work together on product planning and the product roadmap regularly, and I always felt both awe and a little concern at how often she’d dig for my thoughts and opinions about product work, even when we didn’t see eye to eye, and even when my opinion was that we’d been Doing It All Wrong.™ We eventually ended up with something that worked, that got us over the chasm between having the entire company shout at each other in a room for a week and having a well-organized process that produced reasonable results and required minimal drain on everyone’s schedules. It wouldn’t have happened without Charity being willing to dig for more information and be fearless about trying new things out.\n Believe in people, support them, and then give them space. Leave gaps for other people to jump into.  Charity once described the role of founders in the company as like lightning bolts — lots of power when they’re focused on a particular thing, but often gone in an instant. I used to feel frustrated that Charity would disappear sometimes in the middle of something that felt important, but I’d notice later: the outcome was almost always fine. The reality was that my other coworkers and I had the situation under control, and often having to jump in to fill a gap I’d imagined Charity would own was actually something that helped me grow.  I know so. much. more today about how to run an entire high-functioning engineering organization than I did when I first showed up at Honeycomb, and it’s almost never because Charity held my hand each step of the way. It’s because she saw the areas where I  could do more and she got out of the way. I’m decent at juggling a lot of things at work, and I know it’s a useful skill, but I also know without careful management, it becomes a bad thing for my team — if I don’t hand off responsibilities as my team grows, I don’t leave a ladder behind me for others to climb up.\n It’s easy enough to list these out as bullet points, and incredibly hard to do them all in practice. I’ve now had other managers report to me, and I still feel like I’m working every day to try to do these things for them with some consistency. On bad days, I remind myself that, while all of these were useful, there was one piece that mattered most: trust. Charity is an inconsistent presence in my day-to-day reality — she often has to travel for speaking arrangements, she has the weirdest sleep schedule I’ve ever heard of, and sometimes as a founder she just has top priority things that jump in front of all other responsibilities (hi, fundraising) — so many of the things on this list happen sometimes, here and there in waves. The one constant that has made all the difference has been  feeling trusted. Trust has let me act with autonomy, it has let me be fearless in sharing my suggestions and concerns, even when they’ve been wrong, and it has helped us both forge ahead during hard times knowing we could mend most of the collateral damage at the end. I can’t always support my reports in all the ways I’d like to, but I can at least try to let them know the ways in which they are trusted and get out of the way.", "posttime": "2020-05-10 00:47:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "慈善,highly", "title": "一位高效管理者的七个习惯：慈善专业", "title_en": "The Seven Habits of One Highly Effective Manager of Managers: Charity Majors", "transed": 1, "url": "https://honkathon.com/2019-12-19-seven-habits/", "via": "", "real_tags": ["慈善", "highly"]}, {"category": "", "categoryclass": "", "imagename": "0693e463a2d297e4dc4d5d896609f3ff.png", "infoid": 1001409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "内容由Nelson Nauata提供，他是“House-GAN：用于图形受限房屋布局生成的关系生成性对抗网络”一文的第一作者。\n提出了一种基于图约束的生成式对抗性网络，其生成器和鉴别器均建立在关系体系结构之上。其主要思想是将约束编码到其关系网络的图结构中。我们已经为一个新的房屋布局生成问题演示了所提出的体系结构，其任务是将建筑约束作为一个图(即，房间的数量和类型及其空间邻接)，并产生一组轴向排列的房间边界框。我们用真实感、多样性和与输入图约束的兼容性这三个指标来衡量生成的房屋布局的质量。我们对11.7万幅真实平面图像的定性和定量评估表明，该方法的性能优于现有的方法和基线。\n新特点：本文提出了一种新颖的房屋布局生成问题，其任务是以气泡图为输入，生成各种逼真且兼容的房屋布局。房屋布局生成提出了新的挑战：图形作为约束强制执行。我们提出了一种新的产生式模型，称为House-GAN，它使用关系生成器和鉴别器，其中约束被编码到它们的关系神经网络的图结构中。\n工作原理：在房屋布局生成问题中，气泡图被表示为一个图，其中1)节点用房间类型编码房间，2)边编码它们的空间邻接关系。房屋布局表示为一组轴对齐的房间边界框。在House-GAN体系结构中，我们使用卷积消息传递神经网络(Conv-MPN)，它与图形卷积网络(GCNS)的不同之处在于：1)节点将房间表示为设计空间中的特征体积(而不是一维潜在向量)；2)卷积更新设计空间中的特征(与多层感知器相反)。该体系结构为布局的合成和邻接约束的验证提供了更有效的高阶推理。\n主要观点：本文提出了一个房屋布局生成问题和一个图约束的关系生成对抗性网络作为一个有效的解决方案。我们展示了在我们的房屋布局生成问题中利用空间信息的好处，通过卷积消息传递，而不是文献中最先进的基于GCN的方法。我们相信，本文在房屋布局的计算机辅助设计方面迈出了重要的一步。\n幕后：我们的Conv-MPN论文为House-GAN提供了灵感，它已经被证明是一种简单而有效的技术，适用于我们到目前为止测试过的与几何相关的任务。它被接受为CVPR 2020。\n我们认为一些挑战是：1)找到有效的和内存高效的解决方案来保存消息传递过程中的空间信息；2)解决对抗性网络当前状态下的潜在限制。我们方法的当前状态仍然处于启用自动房屋布局生成的早期阶段。我们认为，能够包含更现实的架构约束并输出CAD级别的模型将是下一步的关键。\n论文House-GAN：用于图约束房屋布局生成的关系生成对抗性网络在arxiv上。单击此处访问项目网站。", "note_en": "Content provided by Nelson Nauata, the first author of the paper House-GAN: Relational Generative Adversarial Networks for Graph-constrained House Layout Generation.\n This paper proposes a novel graph-constrained generative adversarial network, whose generator and discriminator are built upon relational architecture. The main idea is to encode the constraint into the graph structure of its relational networks. We have demonstrated the proposed architecture for a new house layout generation problem, whose task is to take an architectural constraint as a graph (i.e., the number and types of rooms with their spatial adjacency) and produce a set of axis-aligned bounding boxes of rooms. We measure the quality of generated house layouts with the three metrics: the realism, the diversity, and the compatibility with the input graph constraint. Our qualitative and quantitative evaluations over 117,000 real floorplan images demonstrate that the proposed approach outperforms existing methods and baselines.\n  What’s New: This paper proposes a novel house layout generation problem, whose task is to take a bubble diagram as an input, and generates a diverse set of realistic and compatible house layouts. The house layout generation poses a new challenge: The graph is enforced as a constraint. We present a novel generative model called House-GAN that employs relational generator and discriminator, where the constraint is encoded into the graph structure of their relational neural networks.\n How It Works: In the house layout generation problem, a bubble diagram is represented as a graph where 1) nodes encode rooms with their room types and 2) edges encode their spatial adjacency. A house layout is represented as a set of axis-aligned bounding boxes of rooms. In House-GAN architecture, we employ convolutional message passing neural networks (Conv-MPN), which differ from graph convolutional networks (GCNs) in that 1) a node represents a room as a feature volume in the design space (as opposed to a 1D latent vector), and 2) convolutions update features in the design space (as opposed to multilayer perceptron). The architecture enables more effective higher-order reasoning for composing layouts and validating adjacency constraints.\n Key Insights: This paper proposes a house layout generation problem and a graph-constrained relational generative adversarial network as an effective solution. We demonstrate the benefits of exploiting spatial information in our house layout generation problem, via convolutional message passing, as opposed to state-of-the-art GCN-based methods in the literature. We believe that this paper makes an important step towards computer aided design of house layouts.\n Behind The Scenes: Our Conv-MPN paper served as inspiration for House-GAN and it has been shown to be a simple and effective technique for geometry related tasks we have tested so far. It is accepted to CVPR 2020.\n  We believe some challenges are 1) finding effective and memory efficient solutions for preserving spatial information during message passing and 2) tackling potential limitations in the current state of adversarial networks. The current state of our method is still in early stages in enabling automated house layout generation. We believe that being able to include more realistic architectural constraints and outputting cad-level models will be essential for next steps.\n The paper  House-GAN: Relational Generative Adversarial Networks for Graph-constrained House Layout Generation is on  arXiv. Click  here to visit the project website.", "posttime": "2020-05-10 00:47:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gan,house,约束", "title": "House-GAN：用于图约束房屋布局生成的关系Gans", "title_en": "House-GAN:Relational GANs for Graph-Constrained House Layout Generation", "transed": 1, "url": "https://medium.com/syncedreview/house-gan-relational-generative-adversarial-networks-for-graph-constrained-house-layout-generation-5283175a29a5", "via": "", "real_tags": ["gan", "house", "约束"]}, {"category": "", "categoryclass": "", "imagename": "fd93c5ba89bc7aeeb77dc980b7d1ece7.png", "infoid": 1001408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "镜头-Kubernetes IDE。通过在GitHub上创建帐户，为lensapp/lens开发做出贡献。", "note_en": "Lens - The Kubernetes IDE. Contribute to lensapp/lens development by creating an account on GitHub.", "posttime": "2020-05-10 00:47:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,ide,lens,kubernetes", "title": "Lens v3.4(Kubernetes IDE)发布", "title_en": "Lens v3.4 (The Kubernetes IDE) is out", "transed": 1, "url": "https://github.com/lensapp/lens/releases/tag/v3.4.0", "via": "", "real_tags": ["发布", "ide", "lens"]}, {"category": "", "categoryclass": "", "imagename": "86a24499f7ac2209a2d1c6735e50b370.jpg", "infoid": 1001407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉首席执行官埃隆·马斯克(Elon Musk)告诉播客主持人乔·罗根(Joe Rogan)，应该减少从事金融和法律职业的人，转而专注于创新。\n他还在推特上发表了最近的誓言，要处理掉他的大部分财产。\n特斯拉首席执行官埃隆·马斯克(Elon Musk)表示，应该减少从事金融和法律职业的人，转而专注于创新。\n特别是在美国，金融和法律领域的人才配置过度。基本上，太多聪明人进入金融和法律领域，马斯克在周四播出的喜剧演员乔·罗根(Joe Rogan)的采访中说。\n当罗根问到，身为亿万富翁是否会让人们对他有不同的看法时，马斯克回答是的。\n近年来，亿万富翁已经成为一种贬义，就像这样变成了一件坏事，我认为这在大多数情况下没有太大意义，马斯克说。\n但他区分了那些通过创建一家制造东西的公司而致富的人，而不是那些通过金融工程或其他方式赚取财富的人。如果你以更好的方式组织员工，生产比以前更好的产品和服务，并且你拥有该公司的一些所有权，那么你基本上就有权分配更多的资本。\n因此，这既是一种赞扬，也是一种批评，马斯克补充道。我们应该少一些做法律的人，少一些做金融的人，多一些做东西的人。\n马斯克说，制造业从一个高价值的工作转变为一个被看不起的工作，尽管它的价值是存在的。\n这位首席执行官还在Twitter上谈到了他最近的誓言，要出售他的大部分实物财产，他说这让他不堪重负。\n我有一堆房子，但我在大多数房子里花的时间不多。这看起来不像是对资产的很好利用。也许有人会喜欢那些房子，而且比我更好地利用它们。", "note_en": "Tesla CEO Elon Musk told podcast host Joe Rogan that fewer people should start careers in finance and law and instead focus on innovation.\n He also addressed his recent vow on Twitter to get rid of most of his possessions.\n Tesla CEO  Elon Musk said that fewer people should start careers in finance and law and instead focus on innovation.\n &#34;In the United States especially, there&#39;s an over allocation of talent in finance and law. Basically too many smart people go into finance and law,&#34; Musk said in an  interview with the comedian Joe Rogan that aired Thursday.\n  When asked by Rogan if being a billionaire makes people see him in a different light, Musk said yes.\n &#34;In recent years, billionaire has become a pejorative, like that&#39;s become a bad thing, which I don&#39;t think makes a lot of sense in most cases,&#34; Musk said.\n But he distinguished people who became rich by founding a company that builds things, versus those who earned their wealth through financial engineering or other means. &#34;If you organize people in a better way, to produce products and services that are better than what existed before and you have some ownership in that company, that essentially gives you the right to allocate more capital.&#34;\n &#34;So this is both a compliment and a criticism,&#34; Musk added. &#34;We should have fewer people doing law and fewer people doing finance and more people making stuff.&#34;\n Musk said that manufacturing shifted from being a highly valued job to one that&#39;s &#34;looked down upon,&#34; though the value is there.\n   The CEO also addressed his recent vow on Twitter to sell the majority of his physical possessions, which he said weigh him down.\n &#34;I have a bunch of houses, but I don&#39;t spend a lot of time in most of them. That doesn&#39;t seem like a good use of assets. Somebody could probably be enjoying those houses and get better use of them than me.&#34;", "posttime": "2020-05-10 00:47:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,elon,musk,马斯克", "title": "埃隆·马斯克(Elon Musk)：“太多聪明人进入金融和法律行业。”", "title_en": "Elon Musk: ‘Too many smart people go into finance and law’", "transed": 1, "url": "https://www.cnbc.com/2020/05/07/elon-musk-too-many-smart-people-go-into-finance-and-law.html", "via": "", "real_tags": ["埃隆·马斯克", "elon", "musk", "马斯克"]}, {"category": "", "categoryclass": "", "imagename": "4fcaae57105d03433ef780cb1c3ee7d7.jpeg", "infoid": 1001405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名国防部官员告诉Insider，来自美国军方的新指导将禁止因冠状病毒住院的个人应征入伍，并在一份临时指导的备忘录在网上浮出水面后澄清了情况，该备忘录暗示，任何在任何时候感染冠状病毒的人都将被取消服兵役资格。\n最初的指导是社交媒体上流传的美国军事入境处理司令部(MEPCOM)的一份征兵备忘录，周三最先由军事时报报道。备忘录称，即使在康复后，冠状病毒诊断也将被视为取消资格。\n备忘录称，全国所有65个军事入境处理站(MEP)将对所有潜在新兵进行医学评估，这些新兵将被要求测量体温，并完成筛查调查。\n该文件说，已报告的确诊冠状病毒病史将被注释为被认为取消资格，并记录在他们的医疗报告中。它补充说，在病史面谈或检查的一部分，他们的申请，冠状病毒病史确认实验室测试或临床诊断，是永久取消资格。\n一名国防官员周四告诉Insider，这份备忘录虽然是真实的，但却是周三更新的临时指导。\n这位官员引用新的指南解释说，被诊断或确认感染冠状病毒但未住院的个人在医学上有资格在家庭隔离后28天内办理入院手续，但那些被诊断或确认感染冠状病毒并住院的个人在医疗上被取消入院资格，这需要进一步审查住院/共病记录，并由医疗服务豁免机构提供豁免。\n新政策不适用于已经是军队成员并感染冠状病毒的个人，比如美国海军航空母舰西奥多·罗斯福号(USS Theodore Roosevelt)上的数百名水兵患病，他们在关岛观战。\n截至周五，已有5171名现役军事人员的冠状病毒检测呈阳性。在这一数字中，114人已经住院。到目前为止，已有1,978名军人康复。\n更新：这篇帖子已经更新，以反映美国军方更新了其指导方针，只取消因冠状病毒而住院的人的资格。", "note_en": "New guidance from the US military will bar individuals who have been hospitalized by COVID-19 from enlisting, a defense official told Insider, clarifying the situation after a memo with interim guidance suggesting that anyone who at any point had the virus would be disqualified from military service surfaced online.\n The initial guidance, a military recruitment memo from US Military Entrance Processing Command (MEPCOM) circulating on social media and first reported on by Military Times on Wednesday, said that a COVID-19 diagnosis, even after recovery, would be considered disqualifying.\n The memo stated that all 65 Military Entrance Processing Stations (MEPS) across the country will medically evaluate all potential recruits, who will be required to have their temperature taken and complete a screening survey.\n The document says that &#34;a reported history of confirmed COVID-19 will be annotated as &#39;Considered Disqualifying&#39;&#34; and documented on their medical report. It adds that during the medical history interview or examination part of their application, &#34;a history of COVID-19 confirmed by either a laboratory test or clinician diagnosis, is permanently disqualifying.&#34;\n   A defense official told Insider Thursday that the memo, while real, was &#34;interim guidance&#34; that was updated Wednesday.\n The official, citing the new guidance, explained that &#34;individuals diagnosed or confirmed with COVID-19 but not hospitalized are medically qualified to process for accession 28 days following home isolation,&#34; but those &#34;individuals diagnosed or confirmed with COVID-19 and hospitalized are medically disqualified for accession, subject to further review of hospitalization/comorbidity records, and waiver by a Service Medical Waiver Authority.&#34;\n The new policy does not apply to individuals who are already members of the military and have contracted the coronavirus, such as the hundreds of sailors aboard the US Navy aircraft carrier USS Theodore Roosevelt who fell ill, sidelining the carrier in Guam.\n As of Friday, 5,171 active-duty military personnel have tested positive for COVID-19. Of that number, 114 have been hospitalized. To date, 1,978 service members have recovered.\n   Update: This post has been updated to reflect the US military updated its guidance to only disqualify people who had been hospitalized due to COVID-19.", "posttime": "2020-05-10 00:46:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,军方,barring", "title": "美国军方禁止任何因冠状病毒住院的人应征入伍", "title_en": "US military barring anyone who was hospitalized due to Covid-19 from enlisting", "transed": 1, "url": "https://www.businessinsider.com/us-military-memo-ban-coronavirus-survivors-from-enlisting-memo-2020-5", "via": "", "real_tags": ["冠状病毒", "病毒", "军方", "barring"]}, {"category": "", "categoryclass": "", "imagename": "e05a846e8ac87d4836c2a5d02520587e.png", "infoid": 1001404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您正在使用Firebase开发身份验证系统，但是嘿！验证邮件转到垃圾邮件文件夹。\nG Suite账户的价格是每个用户6美元/月。(与SMTP服务相比，它非常便宜)。它每天给我们2000封电子邮件，对于一家初创公司来说，这已经足够公平了。\n让我们首先为g套件账号启用两步验证和应用程序密码。这个g套件帐户应该是您想要用于Firebase身份验证的电子邮件的帐户。\n转到此链接，并确保在“登录到Google”部分启用了两步验证。然后转到“应用程序密码”，它位于同一部分下的2步验证选项的正下方。\n为APP选择“Other(Cutom Name)”，然后它会询问您要使用哪个设备使用此密码，您可以随心所欲地写，我更喜欢将其标记为“Firebase”。\n然后我们拿到我们的APP密码，我们应该把它记在安全的地方。我们将在下一步使用它！\n然后，我们应该允许安全性较低的应用程序在没有应用程序密码的情况下登录。否则，谷歌将不允许Firebase登录此帐户。\n只需转到此链接并选中单选按钮“允许用户管理其对安全性较低的应用程序的访问”\n还有一步要切换回Firebase页面，该页面正在解锁验证码。", "note_en": "You are developing an authentication system with Firebase but hey ! verification mails go to spam folder.\n      G Suite account’s price is 6$ per user/month. (It’s extremely cheap compared to smtp services). It gives us 2000 e-mail per day which is fair enough for a startup.\n Let’s start by enabling 2-step verification and app passwords for g suite account first. This g suite account should be the one you wanna use for firebase authentication’s e-mails.\n Go to  this link and make sure that 2 step verification is enabled under “Signig to Google” section. Then go to “App Passwords” which located just below to the 2-step verification option under same section.\n Select “Other (Cutom name)” for app then it will ask for which device you want to use this password, you can write whatever you would like, I prefer to label it as “firebase”.\n  Then we get our app password, we should note it in safe place. We will use it in next step!\n  Then, we should allow less secure apps to sign in with out app password. Otherwise Google will not allow Firebase to signin this account.\n Just go to  this link and check the radio button “Allow users to manage their access to less secure apps”\n One more step remaining to switch back to firebase page which is unlocking the captcha.", "posttime": "2020-05-10 00:45:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,email,firebase", "title": "将G Suite电子邮件用作Firebase身份验证的SMTP", "title_en": "Using G Suite Email as SMTP for Firebase Auth", "transed": 1, "url": "https://medium.com/patron-ai/g-suite-mail-as-smtp-service-for-firebase-auth-ec0483d21bb1", "via": "", "real_tags": ["电子邮件", "email", "firebase"]}]