[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1032886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在你一年多前读过的书中，你现在能记住多少内容？正如“没有愚蠢的问题”播客中讨论的那样，我们更有可能记住一本书给我们的感觉，我们在哪里买的那本书，甚至一些与它相关的特殊情况(比如天赋)，而不是它的实际要点。\n虽然记住情节要点对于娱乐读物来说可以说并不重要(我羡慕那些没有读过第X册的人，因为他们是第一次在脑海中体验这本书)，但我认为，阅读非虚构类书籍的全部目的是变得更有见识。这至少需要我们找回我们学到的事实，并希望能够将它们与我们知道或了解到的其他事实联系起来。\n读了桑克·阿伦斯的“如何做智能笔记”(How To Take Smart Notes)和斯科特·杨(Scott Young)的“超学习”(UltralLearning)一书后，我开始相信，记住我们所读过的东西最重要的是写作。前者概述了学术和非小说写作的泽特卡斯滕笔记方法，后者列出了作者通过紧张努力和专注掌握某一特定主题的原则。\n正如安德斯·爱立信(Anders Ericsson)对刻意练习的研究所表明的那样，我们很难判断自己学到的东西有多好。我们通常将轻松等同于做得好，所以需要较少努力的活动，比如被动地重读，比需要付出更多努力的活动，比如测试自己学到的东西，感觉更有效率。事后的系统测试表明，前一种练习，即努力练习，表现得比后者好得多。\n我会争辩说，虽然通读一本200页的书可能会让人感觉很有成效，但之后的好处(我们将检索设置为最低标准)可能会很小，或者比我们采用一些补充技术所能达到的效果要小。通过简单的被动阅读，我们可能会陷入流利的错觉，这意味着，当信息还在我们的脑海中时，我们感觉自己掌握了它。\n当然，掌握的错觉的解药是在考验你自己。但我们不能让这件事变得太难(否则我们很可能最终根本不做或很长时间不做)。最简单的测试形式是，在你读完一章之后，从记忆中找回它的要点和对你来说最重要的几点，最后用你自己的话写下来。\n通过从记忆中检索，而不是在书中查找，我们练习了主动回忆，这既是一种自我测试方法，也是一种增强我们以后检索信息的能力的方法。如果我们在刚读完一章之后不能回忆起它的要点，那么我们很可能没有那么用心，以后我们也不会再回忆起任何东西了。(这句话的意思是：“如果我们刚读完一章就记不住要点，那我们很可能就没有那么用心了，以后我们也记不起任何东西了。)”\n通过专注于对你个人重要的要点，我们确保我们不仅能够简单地总结关于一本书的一切(就像一本可以查阅的百科全书)，而且我们正在以我们感兴趣的、未来更有可能对我们有用的方式来混合我们现有的知识。\n最后，也是可以说是最重要的一点，通过用我们自己的话写下来，而不是突出显示或抄袭引文，我们确保我们积极地参与到我们正在阅读的概念中来，我们测试我们能够以连贯的方式表达这些概念。通过这样做，很难在我们在该学科上的能力水平上欺骗自己(或者至少比在我们自己的头脑中做所有这些更难)。\n那么，从这篇博客文章中，你还记得什么呢？通过塑造你未来的行动，这对你可能有多重要？别忘了把它写下来。：)", "note_en": "Of the books that you have read in full more than a year ago, how much of their content can you remember on top of your head right now? As discussed in the  No Stupid Questions Podcast, we are more likely to remember how a book made us feel, where we bought that book, or even some special circumstance related to it (such as being gifted), than  its actual main points.\n While remembering plot points is arguably not important for books read for entertainment (the quote &#34;I envy the ones who have not read book X, because they get to experience it for the first time&#34; comes to mind), I would argue that the whole point of reading non-fiction books is to become more knowledgeable. This requires us, at the very least, to retrieve the facts we&#39;ve learned and, hopefully, being able to articulate them with other facts we know or come to know.\n Upon reading the  How to Take Smart Notes book by Sonke Ahrens, which outlines the  Zettelkasten method of note-taking for academic and non-fiction writing, and the  Ultralearning book by Scott Young, which lays out the author&#39;s principles for mastery of a given subject through intense effort and focus, I&#39;ve come to believe that the most important thing to remember what we&#39;ve read is  writing.\n As the research into deliberate practice by Anders Ericsson has shown, we&#39;re terrible judges for how well we are learning something. We usually equate ease with performing well, so activities that require less effort, such as passively rereading,  feel more productive than activities that require more effort, such as testing yourself on what you&#39;ve learned. Systematic testing afterwards show that the former kind of practice, the  effortful practice, performs much better than the latter.\n I would argue that while reading through a 200-page book may  feel productive, the upside afterwards, for which we set retrieval as the lowest bar, may be small, or smaller than it can be if we adopt some complementary techniques. By simply passively reading, we may fall prey to the  illusion of fluency, which means that, while the information is still fresh in our minds, we  feel like we master it.\n The antidote to the illusion of mastery is, of course,  testing yourself. But we can&#39;t make this too hard (or we will likely end up not doing it at all or for long). The simplest form of testing is, after you read a chapter, to  retrieve from memory the gist of it and the most important points  for you, ultimately  writing those down in your own words.\n By retrieving from memory instead of looking up in the book we practice   active recall, which doubles as a self-testing method and a way to strengthen our ability to retrieve that information later. If we fail to recall the main points of a chapter after we&#39;ve just read it, we likely weren&#39;t paying that much attention and we won&#39;t be able to recall anything at all in the future.\n By focusing on the points that are personally important  to you, we ensure that we are not simply becoming able to summarize everything about a book (like a encyclopedia that can be looked up), but we are compounding upon our existing knowledge in ways that interest us and that are more likely to be useful for us in the future.\n Finally, and arguably the most important, by writing down in our own words, instead of highlighting or copying quotes, we ensure that we are actively engaged in the concepts we are reading and we test that we are able to articulate those concepts in a coherent manner. By doing this, it is very hard to fool ourselves about our level of competency in that subject (or at least harder than it would be by doing all of this in our own mind).\n So what do you remember from this blog post? How this may be important to you by shaping your actions in the future? Don&#39;t skip writing it down. :)", "posttime": "2020-11-03 09:30:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记住,ve,可能", "title": "如何记住你读过的内容？", "title_en": "How to Remember What You've Read?", "transed": 1, "url": "https://breder.org/3/", "via": "", "real_tags": ["记住", "ve", "可能"]}, {"category": "", "categoryclass": "", "imagename": "978a28b16398bee026569b26fee6df78.png", "infoid": 1032883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你和大多数人一样，很有可能你已经多年没有发送过没有加密签名的电子邮件了。你说你不用PGP吗？嗯，即使你没有在你的电子邮件上签名，你的提供商几乎可以肯定会为你签名。以阻止垃圾邮件的名义，似是而非的否认已经被抛在一边，但它并不是必须的。\nDKIM最初由RFC4871于2007年标准化，现在几乎得到了普遍采用。引用RFC的话说，协议背后的目标是“允许签名域断言对消息的责任，从而保护消息签名者的身份和他们所传达的消息的完整性”。它是用来防止电子邮件中的发件人身份信息被欺骗的几种技术之一[2]。反垃圾邮件系统使用它来帮助确定在做出处理决策时是否考虑域名的声誉。\n虽然DKIM被设计成对防止垃圾邮件有用，但它使用的加密签名已经悄悄地使一种名为“不可否认”的属性成为电子邮件的新常态。这一术语在合同法中使用-例如，如果有人声称“那不是我的签名”，他们可以说是在“否认”文件的真实性。对于电子邮件，其影响是如果您拥有包含完整标题的原始格式的电子邮件副本(例如，电子邮件假脱机转储)，则可以检查签名。这是一种可靠的验证手段的程度因情况而异-短到可以被破解的密钥过去很常见，在某些情况下直接窃取私钥是可能的。\n与此同时，像OTR及其后继者这样的安全消息传递工具已经采取了明确提供“可否认加密”的方法。最先进的技术允许发送者在给出接收者的公钥的情况下，伪造一份显然是在他们两人之间通过密码检查的抄本。对于这些应用程序的用户来说，这通常是不错的，因为他们知道自己说了什么。据我所知，这并不能创造一张合法的“出狱”卡。它真正做的就是确保这些工具的用户不会因为使用该工具而降低他们的否认性。这是一个问题，DKIM确实让它的用户失望了，显然我不是唯一一个有这种感觉的人。\n无关紧要，我真的希望Gmail能开始发布过期的DKIM密钥。\n三年多前，我开始为我的域名这么做。从那时起，我每天都运行一个密钥轮换脚本，生成一个新密钥并添加适当的记录(称为“选择器”)。\n每个选择器保持存活7天，然后通过发布空出记录的公钥部分的更新来“撤销”。\n再过三天，重新创建公钥和私钥所需的最小RSA参数集就会在选择器的“NOTES”字段中发布。\n这里的格式是非标准的，因为包含所有冗余数据的完整RSA私钥将超过DNS[3]中存储的字符串的255个字符限制。不过，一个小的Python脚本就足以重新构建一切。\n当我最初设置这个功能时，我有点担心过滤系统会遇到问题，因为过滤系统试图在投递后显著验证我发送的电子邮件。根据RFC：\n当包含相应公钥的选择器预期在验证者有机会验证签名之前被撤销或移除时，签名者不应该使用私钥签名。签名者应该预料到，验证者可能会选择推迟验证，也许直到最终接收者实际阅读了邮件。特别地，当轮换到新的密钥对时，签名应该立即从新的私钥开始，并且旧的公钥应该在从密钥服务器移除之前被保留一段合理的验证间隔。\n在写这篇文章的过程中，我检查了我拥有的24个月的查询日志。除了极少数例外(大多数可能是我自己的测试)，除了使用选择器的那一天之外，没有任何针对选择器的查找，所以这在实践中似乎不是问题。\n我之前提到过，但我想说清楚--像这样发布DKIM私钥主要是将泄漏作为一种威胁模型来解决。在法律纠纷中，如果邮件的真实性有问题，可以传唤邮件服务器日志和/或存储的邮件。即使在我的情况下，我在专用硬件上也有自己的邮件服务器，并在一个未公开的位置使用全磁盘加密，我发送的大多数邮件都会被送到由第三方操作的服务器，而不会在收件人的要求下更改日志。\n对于关注隐私的电子邮件提供商之一来说，尝试部署类似于我在本文中描述的密钥管理策略将是一次有趣的实验。\n我找不到任何关于这方面的最新公开数据，但谷歌报告称，截至2016年2月，Gmail用户收到的非垃圾邮件中有87.6%拥有有效的DKIM签名。Https://security.googleblog.com/2013/12/internet-wide-efforts-to-fight-email.html。\n电子邮件背后的核心协议SMTP是在80年代初设计的，它使用的术语之一是“信封发件人”。这是恰当的，因为它最初并不比物理信封上的回邮地址更难伪造。\nDNS标准提供了通过在记录中简单地存储多个字符串来在TXT记录中存储超过255个字符的值，但是在某些软件中使用这样的记录可能会很烦人。", "note_en": "If you’re like most people, there’s a good chance that it’s been years since you’ve sent an email that wasn’t cryptographically signed. You don’t use PGP, you say? Well, even if  you are not signing your email, your provider is almost certainly doing it for you. Plausible deniability has been tossed aside in the name of stopping spam, but it doesn’t have to be.\n  DKIM, originally standardized in 2007 by  RFC 4871, now has near universal [1] adoption. To quote the RFC, the goal behind the protocol is to “permit a signing domain to assert responsibility for a message, thus protecting message signer identity and the integrity of the messages they convey”. It’s one of several technologies used prevent the sender identity information in email from being spoofed [2]. Anti-spam systems use it to help determine whether to consider the reputation of a domain name when making a processing decision.\n  While  DKIM was designed to be useful for spam prevention, the cryptographic signatures it uses have quietly made a property called “ non-repudiation” the new normal for email. The term is used in in contract law — for example if someone claims “that’s not my signature”, they could be said to be “repudiating” the authenticity of the document. In the case of email, the impact is that if you have a copy of an email in its original format including full headers (for example, an email spool dump) you can check the signature. The extent to which this is a reliable means of verification varies depending on the circumstances — keys short enough to be cracked used to be common, and in some cases straight-up theft of the private keys is plausible.\n  Meanwhile, secure messaging tools like  OTR and its successors have taken the approach of explicitly providing “deniable encryption”. The  state of the art allows a sender, given a recipient’s public key, to craft a fake transcript apparently between the two of them that will pass cryptographic checks. This is generally fine for users of these apps because they know what they said. To the best of my knowledge, there is nowhere this creates a legal “get out of jail free” card. All it really does is ensure the users of these tools aren’t  reducing their deniability by using the tool. This is an issue where  DKIM really fails its users, and I’m apparently not the only one that feels this way.\n  Apropos of nothing, I really wish Gmail would start publishing its expired DKIM secret keys.\n  A little over three years ago, I started doing exactly that for my domain. Since then, I’ve had a  key rotation script running every day, generating a new key and adding the appropriate record (called a “selector”).\n    Each selector remains live for seven days, then is “revoked” by publishing an update blanking the public key portion of the record.\n    Once another three days pass, the minimal set of  RSA parameters needed to recreate the public and private keys are published in the selector’s “notes” field.\n    The format here is non-standard, as a full RSA private key with all of the redundant data it includes would exceed the 255 character limit for strings stored in DNS [3]. A small Python script is enough to reconstitute everything, though.\n       When I originally set this up, I was a bit concerned that I’d run into issues with filtering systems trying to validate my sent emails significantly after delivery. Per the RFC:\n  A signer should not sign with a private key when the selector containing the corresponding public key is expected to be revoked or removed before the verifier has an opportunity to validate the signature. The signer should anticipate that verifiers may choose to defer validation, perhaps until the message is actually read by the final recipient. In particular, when rotating to a new key pair, signing should immediately commence with the new private key and the old public key should be retained for a reasonable validation interval before being removed from the key server.\n  In the process of writing this up, I went through the 24 months of query logs I have. With very few exceptions (most of which were probably my own testing) there were no lookups against selectors other than on the day they were being used, so this doesn’t seem to be a problem in practice.\n  I alluded to it earlier, but I want to be clear — publishing  DKIM private keys like this mainly addresses leaks as a threat model. In a legal dispute, mail server logs and/or stored mail can be subpoenaed if the authenticity of messages is in question. Even in my case, where I have my own mail server on dedicated hardware with full disk encryption at an undisclosed location, most mail I send will be delivered to a server operated by a third party with no incentive to alter logs at the behest of the recipient.\n  It would make for a fascinating experiment for one of the privacy focused email providers to try deploying a key management strategy similar to the one I’ve described in this post.\n  I can’t find any recent public data on this, but Google reported that 87.6% of non-spam emails received by Gmail users had valid DKIM signatures as of Febuary 2016.  https://security.googleblog.com/2013/12/internet-wide-efforts-to-fight-email.html\n  The core protocol behind email,   SMTP was designed in the early eighties, and one of the terms it uses is “envelope sender”. This is apt because it originally was not much harder to fake than the return address on a physical envelope.\n  The DNS standards provide for storing values longer than 255 characters in a TXT record by simply storing multiple strings in the record, but such records can be annoying to work with in some software.", "posttime": "2020-11-03 09:08:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dkim,show", "title": "DKIM：展示你的隐私", "title_en": "DKIM: Show Your Privates", "transed": 1, "url": "https://rya.nc/dkim-privates.html", "via": "", "real_tags": ["dkim", "show"]}, {"category": "", "categoryclass": "", "imagename": "0f2e2325f323c87f1450bcd4563e9346.jpeg", "infoid": 1032881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter周一在一份证券备案文件中表示，今年春季成立的一个董事会委员会建议保持目前的管理结构不变。今年早些时候，多尔西对公司的领导受到了埃利奥特管理公司(Elliott Management Corp.)的审查，这一声明让多尔西松了一口气。埃利奥特管理公司被认为是华尔街最强硬的维权投资者之一。\n文件称，委员会还建议改变Twitter的董事会结构，这将给予投资者更多话语权，委员会将继续评估管理层的表现。\nTwitter和埃利奥特在3月份达成了一项协议，该公司同意任命两名董事会成员，并承诺20亿美元的股票回购。协议还包括成立新的委员会来研究Twitter的领导层，这实际上为多尔西创造了一个试用期，以向新投资者证明自己。\n该委员会由谷歌前首席财务官帕特里克·皮切特(Patrick Pichette)领导，他在今年早些时候被任命为Twitter的首席独立董事。埃利奥特美国股票维权活动负责人杰西·科恩(Jesse Cohn)和银湖(Silver Lake)联席首席执行官兼管理合伙人埃贡·德班(Egon德班)也在该委员会任职。\n推特此前表示，新的董事会委员会将在年底前宣布调查结果。该公司和埃利奥特的代表拒绝置评。\n多尔西在Twitter和Square Inc.之间奔波。Square Inc.是一家金融科技公司，他也是该公司的联合创始人，他还兼任首席执行长。他的职责分工引发了人们对他是否有能力适当地专注于Twitter面临的问题的质疑，在Twitter上，他往往比硅谷的一些同龄人更不插手。\n自埃利奥特2月末开始仔细审查推特以来，该公司股价已上涨约20%。自2019年第四季度以来，Twitter的用户基数增长了约23%，超过了今年早些时候承诺的今年及以后用户基数增加20%以上的承诺。\n这两个数字在上周之前都有上升的趋势，当时Twitter公布了多年来最慢的用户增长速度。Twitter公布财报后第二天股价下跌21%。\n多尔西面临的下一个重大考验是推特对选举的处理方式。\n10月下旬，Twitter因决定阻止用户分享两篇关于乔·拜登(Joe Biden)儿子亨特·拜登(Hunter Biden)的“纽约邮报”(New York Post)故事的链接而面临立法者的审查。“华尔街日报”(The Wall Street Journal)此前曾报道，多尔西的领导与外界保持距离，这意味着他没有参与有关这一举措的初步讨论。\n多尔西对推特的监管招致了立法者的批评。在10月底的一次关于内容审核的听证会上，德克萨斯州共和党参议员特德·克鲁兹(Ted Cruz)问多尔西：“该死的是谁选了你，让你负责允许媒体报道什么？”\nTwitter表示，它为即将到来的选举做了广泛准备，并于周一宣布了更新的政策，该公司表示，这些政策将促进辩论，同时保护投票的完整性。这些更新包括计划为候选人发布的任何帖子贴上标签，这些帖子对选举结果做出了初步声明。这项政策也将适用于在该平台上获得重大重新参与的拥有超过10万粉丝和推文的美国账户。", "note_en": "Twitter said in a securities filing on Monday that a board committee formed this spring recommended that the current management structure remain in place. The announcement gives Mr. Dorsey a reprieve after his leadership of the company drew scrutiny earlier this year from Elliott Management Corp., which is known as one of Wall Street’s toughest activist investors.\n  The filing said the committee is also suggesting changes to Twitter’s board structure, which would give investors more say, and that it would continue to evaluate management’s performance.\n  Twitter and Elliott reached an agreement in March in which the company agreed to appoint two board members and commit to $2 billion in share buybacks. The agreement also included the formation of the new committee to study Twitter’s leadership, which effectively created a probation period for Mr. Dorsey to prove himself to the new investors.\n    The committee was led by Patrick Pichette, Google’s former chief financial officer who earlier this year was named Twitter’s lead independent director. Jesse Cohn, Elliott’s head of U.S. equity activism, and Egon Durban, co-CEO and managing partner of Silver Lake, also served on the committee.\n      Twitter had previously said the new board committee would announce its findings before the end of the year. Representatives for the company and Elliot declined to comment.\n  Mr. Dorsey splits his time between Twitter and Square Inc., a financial technology company he also co-founded and that he also serves as CEO. His split duties have raised questions about his ability to suitably focus on the issues facing Twitter,  where he’s often been a more hands-off leader than some of his peers around Silicon Valley.\n  Since Elliott began scrutinizing Twitter in late February, the company’s stock has risen about 20%. Twitter has grown its userbase about 23% since the fourth quarter of 2019, outstripping its pledge earlier this year to increase the user base more than 20% this year and beyond.\n  Both of those figures were trending higher before last week, when  Twitter posted its slowest user growth in years. Twitter shares dropped 21% the day after it reported earnings.\n    Mr. Dorsey’s next major test is Twitter’s handling of the election.\n  In late October, Twitter faced scrutiny from lawmakers for the company’s decision to block users from sharing links to a pair of New York Post stories about Joe Biden’s son, Hunter Biden. Mr. Dorsey’s arm’s-length leadership meant he wasn’t involved in the initial discussions about that move, The Wall Street Journal previously reported.\n  Mr. Dorsey’s oversight of Twitter has drawn criticism from lawmakers.  In a hearing about content moderation in late October, Sen. Ted Cruz (R., Texas) asked Mr. Dorsey: “Who the hell elected you and put you in charge of what the media are allowed to report?”\n  Twitter has said  it prepared extensively for the coming election and Monday announced updated policies that the company said would facilitate debate while protecting the integrity of the vote. Those updates include plans to label any post by a candidate that makes preliminary claims about election results. The policy will also apply to U.S.-based accounts with more than 100,000 followers and tweets that get significant re-engagement on the platform.", "posttime": "2020-11-03 08:49:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,今年,filing,twitter", "title": "推特在一份新的文件中说，今年春天成立的一个董事会委员会建议保留目前的管理结构，由杰克·多尔西(Jack Dorsey)担任首席执行官", "title_en": "Twitter says, in a new filing, that a board committee formed this spring recommended that current management structure remain in place with Jack Dorsey as CEO", "transed": 1, "url": "https://www.wsj.com/articles/jack-dorsey-will-remain-twitter-ceo-11604357141?mod=djemalertNEWS", "via": "", "real_tags": ["推特", "今年", "filing", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "6603cd1fbee2c6b502f703ba5890e04f.jpg", "infoid": 1032880, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在大约两周内构建了Python中的第一个Dark演示。几个月后，当我开始制作它时，我在OCaml中重建了它。早在2017年，当我在考虑Dark使用的语言和平台时，OCaml非常令人信服：\n它是一种具有静态类型的高级语言，因此当我们弄清楚语言/产品是什么时，很容易进行大规模更改。\n您主要使用SUM类型对数据建模，在我看来，这是对数据建模的最佳方式。\n它与我想要构建的语言非常相似(特别是，我们可以对Dark的值重用内置的不可变数据结构)。\n它有高性能的名声，这意味着我们可以为Dark编写一个解释器，而不会让它变得非常慢(而不是用Python编写解释器，后者可能太慢了)。\n不幸的是，当我们建造黑暗的时候，我们遇到了严重的问题，这使得在OCaml中建造变得具有挑战性。\n当您押注于一种非主流语言时，您接受的一件事是许多库将不会可用。当有一个很小的社区时，通常没有足够的人从事这种语言的工作，无法建立重要的库。如果很少有人构建业务应用程序，这一点尤其正确。\nOCaml中有许多高质量的库，特别是用于数据结构和数据操作的库。一年一度的简街代码转储非常有用，而且质量非常高。然而，我们确实感觉到缺少几个图书馆。其中最明显的是，我们必须自己构建Unicode字符串库(构建在Daniel Bünzli构建的非常令人印象深刻的OCaml Unicode库之上)，但我们需要更多的库。\n缺少Google Cloud的SDK对我们影响很大。当你在寻找适合市场的产品时，你做的是最简单、最容易的事。如果您的云提供商缺少一个好的SDK，那么最简单、最容易的事情往往是糟糕的架构选择。我们已经在我们的数据库之上构建了我们自己的队列，而不是使用GCP上提供的生产质量的云队列。同样，我们几乎不使用云存储(GCP&#39；的S3版本)，因为我们最初将内容放入数据库是因为它更容易。我们已经构建了3个服务，2个在Rust中，1个在Go中，以解决我们所面临的挑战。\n这里最大的挑战是我们使用Postgres。Postgres是一个很棒的数据库，我们都是它的忠实粉丝，但是Cloud SQL不是一个很好的托管数据库。GCP的立场是，Cloud SQL是用来勾选的，我们应该使用Cloud Spanner。我很想换成云扳手，但我们OCaml没有驱动程序。考虑到OCaml中的Postgres驱动程序还不是特别成熟，很难指望会有Cloud Spanner驱动程序存在，而且确实没有。我们不得不为OCaml Postgres驱动程序做贡献，而且我们的代码库中的某些部分在处理该驱动程序不支持的功能时已经完全损坏了。\n我们还面临着缺乏高级别的生产性Web堆栈的问题(有一些声誉良好的低级堆栈我一直在努力使用，还有一些新的堆栈看起来不错)，尤其是缺乏用户身份验证模块。我们现在一直在使用Auth0来解决这个问题，它有比我想要的更多的移动棋子，而且成本高得令人震惊(我们的7000名用户，其中大多数从未登录，花费我们超过500美元/月)。\n我们已经解决了其他缺失的供应商SDK，直接调用它们的HTTP端点，这基本上没什么问题。然而，对于像Encryption这样的库，我们没有这样的选择-我们破解了一个丢失的加密库，但决定在我们对其进行安全审计之前不将其交付生产(这实际上从来都不值这个成本)。\n在CircleCI，我们押注于Clojure。这也是一种非主流语言，但它调用JavaSDK的能力意味着我们拥有一个成熟的云库，这对于构建CircleCI至关重要。当然，在OCaml中，我们可以调用C库(甚至可能还有Rust库)，但它不能与我们可以直接调用的本地库相匹配。\n我主要是支持任何人都可以学习任何语言的阵营，但我看到一个团队在与OCaml斗争，这是有充分理由的。与其他语言相比，OCaml中的语言教程非常差；它们大多是学术课程的课堂讲稿。\n当然，与Rust或Elm(这两个都曾经在我们的堆栈中)相比，编译器并不是特别有帮助。通常，它不提供有关错误的信息。语法错误通常显示为语法错误，尽管它会尝试为不匹配的花括号(通常是不正确的)提供正确的错误。打字错误可能会成为阅读的真正负担，即使在使用了3年之后也是如此。\nOCaml中的文档通常很难找到。在过去的几年中，Jane Street文档有了很大的改进，但即使是找出特定模块中的哪些功能对于大多数库都是可用的，这也可能是一个挑战。与Rust中优秀的docs.rs相比，Rust中的每个包都有全面的API文档。\n我个人在OCaml奋斗的方式之一就是围绕路易斯安那州立大学(LWT)。LWT是(其中之一！)。OCaml&39；的异步实现。几年前我想不出来，所以就构建了一个单线程服务器。我们因这一决定而遭受的变通和停机时间是巨大的。关于构建高性能(甚至中等性能！)的教程。Web服务器将非常有价值。\n工具是我在OCaml中读到的很好的东西。我记得读到过有一个调试器可以回到过去！我不知道它到哪里去了，但我从来没有听说过有人用过它。\n我们一直在努力让编辑器工具为我们工作。这在一定程度上是因为我们也使用了ReasonML，这似乎会破坏一些东西。不幸的是，这在编程中很常见，但在小型社区中更是如此：您可能是第一个尝试使用特定配置的人。\n最后，各种工具之间的脱节是巨大的。你需要了解Opam，Dune和Esy，才能让一些东西正常工作(你也可以在没有Esy的情况下做到这一点，只依靠Opam，但那要糟糕得多)。我在这里谈到了一大堆这样的挑战。\n多核现在随时都会出现，™️，虽然这对我们来说不是什么大事，但它很烦人。\n我最大的烦恼之一是OCaml的人们经常谈论Fancy Type系统问题，而不是如何实际构建产品和应用程序。在其他类似语言的社区(ReasonML、Elm、F#)，人们谈论构建应用程序和解决他们的问题。在OCaml中，感觉人们花了大量时间讨论函数器。这并不完全是我在哈斯克尔世界中感受到的水平，但它指出，构建生态系统核心的人并不存在与我相同的问题(即构建基于网络的东西)。\n老实说，我认为OCaml在一开始就是一个很好的选择。能够快速、安全地对您的应用程序进行大规模更改是静态类型函数式语言所擅长的。我很高兴我们做出了这个选择，回想起来，这似乎仍然是我们当时拥有的最好的选择。\n我正在努力建立下一个版本的后端。我们大约有两万行要替换，它们将在保持语义不变的情况下用一种新的语言重写。我计划将前端保留在ReasonML中：它不会因为可以很好地与JS接口而遭受相同的库问题，而且它有近50000行代码，所以它将是一项更大的事业。\n你可以在这里报名参加“黑暗”。欲了解更多关于Dark的信息，请关注我们的RSS，在Twitter上关注我们(或我)，加入我们的松弛社区，或观看我们的GitHub回购。", "note_en": "I built the first demo of Dark in Python, in about two weeks. A few months later when I started productizing it, I rebuilt it in OCaml. Back in 2017, when I was considering the language and platform to use for Dark, OCaml was extremely compelling:\n it&#39;s a high-level language with static types, so easy to make large scale changes as we figure out what the language/product was\n you mostly model data with sum types, which in my mind are the best way to model data\n it&#39;s very similar to the language I wanted to build (in particular, we could reuse built-in immutable data structures for Dark&#39;s values)\n it had a reputation for being high-performance, which meant that we could write an interpreter for Dark and not have it be terribly slow (vs writing an interpreter in python, which might be too slow)\n Unfortunately, as we&#39;ve built Dark we&#39;ve run into significant problems that have made it challenging to build in OCaml.\n  When you bet on an off-mainstream language, one of the things you accept is that many libraries are not going to be available. When there is a small community, often there aren&#39;t enough people working in the language to make important libraries. This is especially true if few people are building business applications.\n In OCaml there are many high quality libraries, especially for data structures and data manipulation. The annual  Jane Street code dump has been quite useful and very high quality. However, we really felt the lack of several libraries. The most obvious of these is that we had to build a  Unicode string library ourselves (built on top of the  very impressive OCaml Unicode libraries built by  Daniel Bünzli), but we needed many more libraries than that.\n The lack of an SDK for Google Cloud has affected us greatly. When you&#39;re searching for product-market fit, you do the simplest, easiest thing. If you lack a good SDK for your cloud provider, the simplest, easiest thing is often a terrible architectural choice. We&#39;ve built our own queue on top of our database rather than using the production-quality cloud queues available on GCP. Similarly, we barely use the Cloud Storage (GCP&#39;s version of S3), because we initially put things in the database  because it was easier. We&#39;ve built 3 services, 2  in  Rust, and 1 in  Go, to workaround the challenges we&#39;ve faced.\n The biggest challenge here is our use of Postgres. Postgres is a great database and we&#39;re big fans, but Cloud SQL is not a great hosted database. GCP&#39;s position is that Cloud SQL is there to tick a box and we should be using Cloud Spanner. I would love to switch to Cloud Spanner, but we have no driver for it in OCaml. Given the Postgres driver in OCaml is not particularly mature, it&#39;s hard to expect that a Cloud Spanner driver would exist, and indeed it doesn&#39;t. We&#39;ve had to contribute to the  OCaml Postgres driver, and some parts of our codebase have been  well and truly mangled when working around features not supported in that driver.\n We&#39;ve also suffered from a lack of a high-level, production web stack (there are  low-level stacks with good reputations that I&#39;ve struggled to use, and a  few  new ones out there that look good), in particular lacking a user authentication module. We&#39;ve been using  Auth0 to work around this for now, which has more moving pieces than I&#39;d like, and a shockingly high cost (our 7000 users, most of whom never log in, costs us over $500/mo).\n We&#39;ve worked around other missing vendor SDKs by calling their HTTP endpoints directly and that&#39;s been mostly fine. However, for libraries like encryption we don&#39;t have that option - we  hacked around a missing encryption library, but decided not to ship it to production until we audited it for security (which was never actually worth the cost).\n At CircleCI, we bet on Clojure. That was also a non-mainstream language, but its ability to call Java SDKs meant we had a mature cloud library, which was essential for building CircleCI. Of course, in OCaml we could call C libraries (and  even Rust libraries, perhaps), but it doesn&#39;t match having native libraries we can call directly.\n  I&#39;m mostly in the camp that anyone can learn any language, but I saw a team struggle with OCaml, and for good reason. Language tutorials are extremely poor in OCaml compared to other languages; they&#39;re mostly lecture notes from academic courses.\n The compiler isn&#39;t particularly helpful, certainly compared to Rust or Elm (both of which have been in our stack at one point). Often it gives no information about an error. Syntax errors typically say &#34;Syntax error&#34;; though it will try to give a good error for a mismatched brace, often incorrectly. Type errors can be a real burden to read, even after 3 years of experience with it.\n The docs in OCaml are often challenging to find. The  Jane Street docs have improved significantly in the last few years, but it can be a challenge to even figure out what functions are available in a particular module for most libraries. Compare to the excellent  docs.rs in Rust, which has comprehensive API docs for every package in Rust.\n One of the ways I personally struggled in OCaml is around  Lwt. Lwt is (one of!) OCaml&#39;s async implementations. I couldn&#39;t figure it out several years ago and so just built a single-threaded server. The amount of workarounds and downtime we&#39;ve suffered from that single decision is immense. A tutorial around building high-performance (or even medium performance!) web servers would be very valuable.\n  Tooling is something I read would be good in OCaml. I remember reading there was a debugger that could go back in time! I don&#39;t know where that&#39;s gone but I&#39;ve never heard of anyone using it.\n We have struggled to make editor tooling work for us. This is partially because we also use ReasonML and this seems to break things. Unfortunately, this is common in programming, but even more so in small communities: you might be the first person to ever try to use a particular configuration.\n Finally, the disconnect between the various tools is immense. You need to understand Opam, Dune, and Esy, to be able to get something working (you could also do it without Esy and just rely on Opam, but that&#39;s much worse). I talked about a bunch of these challenges  here.\n  Multicore is coming Any Day Now™️, and while this wasn&#39;t a huge deal for us, it was annoying.\n  One of my biggest annoyances was how often OCaml folks talk about Fancy Type System problems, instead of how to actually build products and applications. In other communities for similar languages (ReasonML, Elm, F#), people talk about building apps and solving their problems. In OCaml, it feels like people spend an awful lot of time discussing Functors. It&#39;s not quite at the level that I perceived in the Haskell world, but it pointed out that the people building the core of the ecosystem do not have the same problems that I do (which is building web-y stuff).\n  I honestly think OCaml was a great choice at the start. Being able to quickly and safely make large-scale changes to your app is something that staticly-typed functional languages excel at. I&#39;m happy that we made the choice, and in retrospect, it still seems like the best choice of those we had at the time.\n  I&#39;m working on building the next version of the backend. We have about 20k lines to be replaced, and they&#39;ll be rewritten in a new language while keeping the semantics the same. I plan to leave keep the frontend in ReasonML: it doesn&#39;t suffer from the same library problems as it can interface nicely to JS, and it&#39;s nearly 50k lines of code so it would be a much bigger undertaking.\n   You can sign up for Dark    here  . For more info on Dark, follow our    RSS  , follow    us   (or    me  ) on Twitter, join our    Slack Community  , or watch our    GitHub repo  .", "posttime": "2020-11-03 08:45:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "leaving,构建", "title": "离开OCaml", "title_en": "Leaving OCaml", "transed": 1, "url": "https://blog.darklang.com/leaving-ocaml/", "via": "", "real_tags": ["leaving", "构建"]}, {"category": "", "categoryclass": "", "imagename": "ed3df310a0d777d6989582a8149151a0.png", "infoid": 1032879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大流行期间，机器人和自动化初创公司的兴趣大幅上升。很容易看出，在似乎无休止的病毒驱动的停摆中，哪些公司对员工自动化产生了新的兴趣。但沃尔玛长期以来一直承诺越来越关注这类技术，据报道，它已经终止了一项最引人注目的合作伙伴关系。\n据“华尔街日报”最新报道，这家大型零售商已经终止了与博萨·诺瓦机器人公司(Bossa Nova Robotics)的合同。沃尔玛曾在1月份宣布，将把这家总部位于旧金山湾区的初创公司的库存扫描机器人再增加650家门店，使总数达到1000家。据《华尔街日报》报道，此举导致卡内基梅隆分店裁员约50%。在这样的技术应该蓬勃发展的时候，这是一个巨大的成功。\n斯卡夫说：“我不能对沃尔玛发表评论，然而，大流行迫使我们精简业务，专注于我们的核心技术。”“我们在人工智能和机器人技术方面取得了惊人的进步。我们的零售人工智能是业内最好的，在机器人和固定摄像头上都能很好地工作，我们的硬件、自主性和运营在世界上最具挑战性的500多家商店中表现出色。在董事会的全力支持下，我们继续在零售业和其他领域与我们的合作伙伴一起部署这项技术。“。\n博萨诺瓦的骚乱已经超出了裁员的范畴。担任首席技术官的斯卡夫于去年10月接任首席执行官一职，当时斯图尔特·潘在任职不到9个月后离职。Bossa Nova与沃尔玛的交易对这家初创公司来说是一个重大突破，这家初创公司于2005年成立，最初是一家机器人玩具制造商，后来转向更严肃的领域。这家创业公司与沃尔玛的关系可以追溯到2017年，当时沃尔玛订购了50台机器人。沃尔玛早些时候的巨额订单是对博萨·诺瓦技术的重大认可。\n这种想法的改变无疑会对公司产生深远的影响。\n沃尔玛显然没有从这笔交易中获得足够的回报。到交易结束时，Bossa Nova的机器人已经进入了大约500家门店-大约是最初提议数量的一半。随着新冠肺炎将更多订单推到网上，沃尔玛开始探索如何利用人类工人进行库存，同时抓取产品进行在线履行。随着实体店重新开业，顾客有兴趣重返面对面购物体验的迹象，沃尔玛的业务以及其他主要零售商的业务也将继续发展。大流行的波动性仍然不能减轻沃尔玛突然逆转将给博萨诺瓦及其反弹希望带来的刺痛或影响。\n与此同时，沃尔玛的机器人实验还没有结束。该公司的山姆俱乐部(Sam‘s Club)子公司最近宣布，将把Tennant的擦地机器人带到其所有599家门店。有趣的是，该公司还在探索让这些机器翻倍并执行店内库存检查的方法；目前还不清楚这些机器是只在山姆俱乐部(Sam‘s Club)门店使用，还是也扩展到沃尔玛(Walmart)门店。", "note_en": "Robotics and automation startups have seen a strong uptick in interest over the course of the pandemic. And it’s easy to see which companies have a newfound interest in automating their workforce amid a seemingly endless virus-driven shutdown. But  Walmart,   which has long promised to take an increasing focus on such technology, has reportedly pulled the plug on one of its highest-profile partnerships.\n The mega-retailer has ended a contract with  Bossa Nova Robotics,   according to new reporting from  The Wall Street Journal. Walmart had announced in January that it would bring the Bay Area-based startup’s inventory-scanning robots to an additional 650 locations, bringing the total up to 1,000. The move has resulted in layoffs of around 50% at the Carnegie Mellon spin-off, per the WSJ report. It’s a huge hit at a time when such technologies should be thriving.\n   “I cannot comment on Walmart, however the pandemic has forced us to streamline our operations and focus on our core technologies,” Skaff said. “We have made stunning advances in AI and robotics. Our retail AI is the industry’s best and works as well on robots as with fixed cameras, and our hardware, autonomy and operations excelled in more than 500 of the world’s most challenging stores. With the board’s full support, we continue deploying this technology with our partners in retail and in other fields.”\n The tumult at Bossa Nova has stretched beyond layoffs. Skaff, who was CTO took over the CEO spot in October when Stuart Pann left the position after less than nine months. Bossa Nova’s deal with Walmart was a major break for the startup, which began life in 2005 as a robotic toymaker before pivoting into something more serious. The startup’s relationship with Walmart dates back to 2017, when the chain ordered 50 robots.  Walmart’s massive order earlier was a major endorsement of Bossa Nova’s technology.\n Such a change of heart would no doubt have a profound effect on the company.\n  Walmart apparently just wasn’t getting enough out of the deal. Bossa Nova’s robots had made their way into around 500 stores by the time the deal ended — around half of the initial proposed number. As COVID-19 has pushed more orders online, Walmart began exploring ways to use human workers to perform inventory while grabbing product for online fulfillment. Walmart’s operations as well as those at other major retailers will continue to evolve as brick-and-mortar locations reopen and customers shows signs of interest to return to the in-person shopping experience. The volatility of the pandemic still doesn’t lessen the sting or impact that Walmart’s abrupt reversal will have on Bossa Nova and its hopes for a rebound.\n Meanwhile, Walmart’s robotic experiments aren’t over. The company’s Sam’s Club subsidiary recently announced it would bring Tennant’s floor scrubbing robots to all of its 599 stores. Interestingly, the company is also exploring ways for these machines to double up and perform in-store inventory checks; it’s not clear if these will be used only in Sam’s Club locations or extend to Walmart stores as well.", "posttime": "2020-11-03 08:08:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,沃尔玛,reportedly", "title": "\n据报道，沃尔玛终止了与库存机器人初创公司Bossa Nova的合同", "title_en": "\n\t\t\t\tWalmart reportedly ends contract with inventory robotics startup Bossa Nova\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/walmart-reportedly-ends-contract-with-inventory-robotics-startup-bossa-nova/", "via": "", "real_tags": ["机器人", "沃尔玛"]}, {"category": "", "categoryclass": "", "imagename": "86a58b24ad5fd65f6a9da4042034d00b.jpg", "infoid": 1032878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我把树莓派400拆开，看看它是什么做的。从树莓派的网站上获得Pi400：https://www.raspberrypi.org/products/raspberry-pi-...", "note_en": "I take apart the Raspberry Pi 400 and see what it's made of. Get the Pi 400 from the Raspberry Pi website: https://www.raspberrypi.org/products/raspberry-pi-...", "posttime": "2020-11-03 08:04:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspbercrypi,raspberrypi,看看", "title": "Raspbercrypi 400拆卸", "title_en": "RaspberryPi 400 Teardown", "transed": 1, "url": "https://www.youtube.com/watch?v=OqpylxLhw98", "via": "", "real_tags": ["看看"]}, {"category": "", "categoryclass": "", "imagename": "b013a72bf1331aca724132f55410461b.jpg", "infoid": 1032877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家航空航天局(NASA)正式评论了一家美国公司提出的在距地球表面720公里的高度建造巨型卫星群的请求，理由是担心会发生碰撞。这似乎是美国国家航空航天局(NASA)首次公开评论这样的市场准入申请，目前该申请正在联邦通信委员会(Federal Communications Commission)待决。\n美国宇航局的工程师萨曼莎·方德写道：NASA在公开评议期内提交这封信，目的是为了更好地了解NASA对其在轨资产的担忧，进一步降低碰撞的风险，为所有相关各方带来共同利益，该机构的工程师萨曼莎·方德(Samantha Fonder)写道。\n有争议的是AST&amp；Science提出的计划，该公司打算建造一个由240多颗大型卫星组成的星座，实质上是在太空部署蜂窝塔，为地球上的手机提供4G(可能是5G)宽带连接。总部设在得克萨斯州米德兰的该公司将其星座命名为SpaceMobile，估计已募集到1.2亿美元。\n出于几个原因，航天局感到有必要对AST的提议发表评论。最值得注意的是，SpaceMobile星座的拟议高度接近A-Train，A-Train是由美国国家航空航天局(NASA)和美国地质调查局(US Geological Survey)以及法国和日本的合作伙伴运营的一组10颗地球科学监测卫星。NASA的信中写道，A-Train星座的历史经验表明，这一特定的空间区域往往会在空间物体之间产生大量的连接。\n卫星也很大。为了提供服务，AST计划建造带有大型相控阵天线的航天器-900平方米。根据美国国家航空航天局(NASA)的说法，在计划与该轨道上的其他卫星和碎片潜在的会合时，这将需要禁止硬体半径为30米，即比其他卫星大10倍。\nNASA说，围绕拟议的SpaceMobile星座进行机动将非常繁重。航天局表示，对于由243颗卫星组成的完整星座，预计每年将采取1500次缓解行动，可能还有15000次规划活动。这相当于在任何一天进行四次演习和40次积极的计划活动。\n最后，航天局对此感到担忧，因为AST从未建造过一颗卫星，其大小远远接近其星座将容纳的1吨或更大的运载火箭。考虑到这种经验的缺乏，预计10%或更多的卫星可能会失败，使它们无法操纵以避免碰撞。美国宇航局发现发生灾难性碰撞的风险高得令人无法接受。\nNASA在10月30日提交了评论，评论期于周一结束。关于AST应用的大多数其他评论都是支持的。\n在回应ARS对NASA提交的文件的质疑时，AST表示将与NASA合作，以缓解其担忧。AST空间系统首席科学家雷蒙德·塞德威克(Raymond Sedwick)表示：“我们已经审查了NASA的信，并相信我们可以与他们合作解决他们的担忧，包括澄清AST的星座设计，该星座设计有力地管理轨道碎片，确保NASA和其他轨道资产的安全。”(美国国家航空航天局空间系统首席科学家雷蒙德·塞德威克)表示：“我们已经审查了NASA的信，并相信我们可以与他们合作解决他们的担忧，包括澄清AST的星座设计，有力地管理轨道碎片，确保NASA和其他轨道资产的安全。”\n那么，为什么这个问题会摆在联邦通信委员会面前呢？美国太空活动的责任分散在几个联邦机构，但FCC管理频谱。在这种情况下，AST已经从巴布亚新几内亚获得了在V波段使用频谱的许可证(是的，这是合法的)。但要进入美国市场并销售其服务，AST仍必须获得FCC的许可。\n当涉及到巨型星座(包括SpaceX的Starlink、OneWeb等)时，联邦通信委员会(FCC)一直在考虑将数百颗(如果不是数千颗)新卫星送入近地轨道的碎片问题。因此，看看FCC在这个问题上走向何方将是一件有趣的事情，因为联邦机构有两个相互竞争的利益。\n总体而言，当涉及到向卫星运营商发放频谱许可证时，FCC一直是令人难以置信的宽容。安全世界基金会(Secure World Foundation)的卫星专家布莱恩·威登(Brian Weeden)表示，我不知道有任何FCC拒绝发放此类许可证的例子。他们正在努力做到对商业友好，并鼓励公司在美国做生意。\n然而，FCC一直在利用其频谱权限考虑一些规则，这些规则将要求卫星运营商赔偿政府免受潜在事故的影响，并对他们的车辆拥有更大的机动能力，从而减少碎片。这些拟议规则的评议期于上月结束，这些规则于4月份首次发布。目前还不清楚最终的规则会是什么样子，但卫星运营商已经将一些想法定性为过于繁琐。\n最后，尚不清楚FCC将如何处理NASA的担忧，NASA对太空略知一二，并首次公开表示意见。\nWeeden说，从大的方面来看，NASA和AST之间的这场争吵进一步证明，美国政府-以及世界各地的其他航天国家-需要更好地确保低地球轨道尽可能没有碎片。目前还没有专门负责确保近地轨道安全的政府机构，现有的模型也无法完全捕捉到来自新旧卫星、火箭第二级失效和已知碎片的威胁。因此，在某种意义上，随着今天所有的巨型星座飞向太空，监管机构是在盲目飞行，他说。\n他说：在过去的10年里，我们应该做很多这方面的工作。从政府政策监督的角度来看，我们落后于权力曲线。", "note_en": "NASA  has formally commented (PDF) on a request by a US company to build a megaconstellation of satellites at an altitude of 720km above the Earth&#39;s surface, citing concerns about collisions. This appears to be the first time that NASA has publicly commented on such an application for market access, which is pending before the Federal Communications Commission.\n &#34;NASA submits this letter during the public comment period for the purpose of providing a better understanding of NASA&#39;s concerns with respect to its assets on-orbit, to further mitigate the risks of collisions for the mutual benefit of all involved,&#34; wrote Samantha Fonder, an engineer for the space agency.\n At issue are plans put forth by AST &amp; Science, which intends to build a constellation of more than 240 large satellites, essentially deploying &#34;cell towers&#34; in space to provide 4G and possibly 5G broadband connection directly to cell phones on Earth. The company, based in Midland, Texas, calls its constellation &#34;SpaceMobile&#34; and has raised an estimated $120 million.\n The space agency felt compelled to comment on AST&#39;s proposal for several reasons. Most notably, the proposed altitude for the SpaceMobile constellation lies near the &#34;A-Train,&#34; a group of 10 Earth-science monitoring satellites operated by NASA and the US Geological Survey, as well as partners in France and Japan. &#34;Historical experience with the A-Train constellation has shown that this particular region of space tends to produce a large number of conjunctions between space objects,&#34; the NASA letter states.\n  The satellites are also very large. In order to provide service, AST plans to build spacecraft with large phased array antennae—900 square meters. According to NASA, in planning for potential conjunctions with other satellites and debris in this orbit, this would require proscribing a &#34;hard-body radius&#34; of 30 meters, or as much as 10 times larger than other satellites.\n Maneuvering around the proposed SpaceMobile constellation would be extraordinarily taxing, NASA said. &#34;For the completed constellation of 243 satellites, one can expect 1,500 mitigation actions per year and perhaps 15,000 planning activities,&#34; the space agency stated. &#34;This would equate to four maneuvers and 40 active planning activities on any given day.&#34;\n Finally, the space agency is concerned because AST has never built a satellite remotely close in size to the 1-ton or larger vehicles that will populate its constellation. Given this lack of experience, it is expected that 10 percent or more of the satellites may fail, making them unable to maneuver to avoid collisions. NASA found the risk of a catastrophic collision to be &#34;unacceptably high.&#34;\n NASA submitted its comment on October 30, and the comment period closed Monday. Most  of the other comments on the AST application were supportive.\n In response to a query from Ars about NASA&#39;s submission, AST said it would work with NASA to ameliorate its concerns. “We have reviewed NASA&#39;s letter and are confident that we can work with them to address their concerns, including providing clarification of AST’s constellation design that robustly manages orbital debris, keeping NASA and other orbital assets safe,&#34; said Raymond Sedwick, Chief Scientist for Space Systems at AST.\n  So why is this issue before the Federal Communications Commission? The responsibility for US space activities is scattered across several federal agencies, but the FCC manages spectrum. In this case, AST has already obtained a license to use spectrum in the V-band from Papua New Guinea (yes, that is legal). But to access the US market and sell its services, AST must still obtain permission from the FCC.\n When it comes to megaconstellations—including SpaceX&#39;s Starlink, OneWeb, and others—the FCC  has been considering the debris issue when it comes to putting hundreds, if not thousands, of new satellites into low Earth orbit. Therefore, it will be interesting to see in which direction the FCC goes on this issue because the federal agency has two competing interests.\n In general, the FCC has been incredibly permissive when it comes to issuing spectrum licenses to satellite operators. &#34;I&#39;m not aware of any example of the FCC denying such a license,&#34; said Brian Weeden, a satellite expert at the Secure World Foundation. &#34;They&#39;re trying to be business friendly and encourage companies to be doing business in the US.&#34;\n  However, the FCC has been using its spectrum authority to consider rules that would mitigate debris by requiring satellite operators to indemnify the government from potential accidents as well as have more maneuvering capability on their vehicles. A comment period for these proposed rules,  which were first published in April, closed last month. It is not clear what the final rules will look like, but satellite operators have characterized some of the ideas as  too onerous.\n Finally, it is unclear how the FCC will handle the concerns of NASA, which knows a thing or two about space and is speaking up for the first time.\n In the big picture, Weeden said, this dustup between NASA and AST is more evidence that the US government—and other spacefaring nations around the world—need to do a better job ensuring that low Earth orbit remains as debris-free as possible. There is no governmental agency specifically charged with ensuring low Earth orbit remains safe, and the existing models are failing to fully capture the threat from new and old satellites, spent rocket second stages, and known debris. So in some sense, with all the megaconstellations flying into space today, regulators are flying blind, he said.\n &#34;We should have done a lot of this work over the last 10 years,&#34; he said. &#34;From a government policy oversight perspective, we&#39;re behind the power curve.&#34;", "posttime": "2020-11-03 07:49:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国,理由,objects", "title": "美国国家航空航天局反对新的巨型星座，理由是存在“灾难性科里森”的风险", "title_en": "NASA objects to new megaconstellation, citing risk of “catastrophic collison”", "transed": 1, "url": "https://arstechnica.com/science/2020/11/nasa-objects-to-new-megaconstellation-citing-risk-of-catastrophic-collison/", "via": "", "real_tags": ["nasa", "美国", "理由", "objects"]}, {"category": "", "categoryclass": "", "imagename": "12fa0fe484a8c8f89a65fc287d14c0c1.png", "infoid": 1032875, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，几乎所有人的注意力都锁定在明天的美国总统大选上，但苹果给了我们一个超越11月4日的借口-它将在11月10日上午10点举行另一场主题为“还有一件事”的大型活动。太平洋。\n还有一件事是什么？最有可能的是，苹果将推出首批采用该公司ARM处理器的Mac，并提供MacOS Big Sur的发布日期。\n今年早些时候在WWDC上宣布了向“苹果硅”的过渡，蒂姆·库克(Tim Cook)将其描述为“Mac具有历史意义的一天”。但现在我们将实际了解一些产品细节。\n推特解释了它将如何处理关于美国选举结果的误导性推文-该平台表示，它将优先处理关于总统选举和任何其他可能存在误导性信息重大问题的“竞争激烈的竞选”的标签推文。\nSpotify现在将允许艺术家和唱片公司在你的推荐中推广曲目-Spotify今天宣布将开始测试一项新服务，让艺术家在如何在Spotify平台上发现他们的音乐方面拥有更多话语权。\nWeWork员工使用了一个非常不安全的打印机密码--密码(“9999”，与用户名相同)是如此简单，以至于客户都猜到了。\nYC支持的非营利组织VotingWorks希望通过开源重建人们对选举系统的信任-这家初创公司有两个目标：通过更负担得起、更安全的投票系统来改善支撑选举的技术，以及使用现代统计科学来提高选民审计的质量和效率。\n火箭实验室的下一次发射将向轨道发射30颗卫星，以及来自Gabe Newell的3D打印的侏儒-侏儒是对一种新制造技术的测试，也是这位游戏行业传奇人物的慈善努力。\n电子邮件创建初创公司Stensul筹集了1600万美元-随着其他营销渠道在疫情期间暂停或减少，电子邮件只会变得更加重要。\n流行病的影响不成比例地减少了对女性创始人的风险投资-偏见、种子期瓶颈和缓慢的结构变化继续阻碍着女性的发展。\n蓬勃发展的Edtech并购活动给这个支离破碎的行业带来了整合--EdTech并购活动比往常更加活跃。\nStarling Bank创始人安妮·博登(Anne Boden)表示，新书《不是回忆录》--博登在《Banking on It》一书中讲述了她是如何萌生创办一家挑战者银行的想法，以及一路走来面临的诸多障碍。\n(提醒：Extra Crunch是我们的会员计划，旨在使初创企业的信息民主化。您可以在这里注册。)。\n树莓派基金会宣布推出可爱的小树莓派400--树莓派400是一款集成在紧凑键盘中的电脑，售价70美元。\n原创内容播客：比尔·穆雷的魅力难掩《岩石上》的悲伤--影片让穆雷与他的《迷失在翻译中》导演索菲亚·科波拉重聚。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Yes, almost everyone’s attention is locked onto tomorrow’s U.S. presidential election, but Apple is giving us an excuse to look beyond November 4 — it’s  holding another big event, themed “One More Thing,” on November 10 at 10 a.m. Pacific.\n  What’s the one more thing? Most likely, Apple will unveil the first Macs built with the company’s ARM-based processors and also provide a release date for macOS Big Sur.\n The transition to “Apple silicon” was announced earlier this year at WWDC, with Tim Cook describing it as “a historic day for the Mac.” But now we’ll actually get some product details.\n  Twitter explains how it will handle misleading tweets about the US election results — The platform says it will prioritize labeling tweets about the presidential election and any other “highly contested races” where there may be significant issues with misleading information.\n Spotify will now allow artists and labels to promote tracks in your recommendations — Spotify announced today it will begin to test a new service that gives artists more of a say in how their music is discovered on the Spotify platform.\n WeWork employees used an alarmingly insecure printer password — The password (“9999”, the same as the user name) was so simple that a customer guessed it.\n  YC-backed nonprofit VotingWorks wants to rebuild trust in election systems through open source — The startup has twin goals of improving the technology that underpins elections through more affordable and secure voting systems, as well as using modern statistical science to improve the quality and efficiency of voter audits.\n Rocket Lab’s next launch will deliver 30 satellites to orbit, and a 3D-printed gnome from Gabe Newell — The gnome is a test of a new manufacturing technique, as well as a philanthropic endeavor from the gaming industry legend.\n Email creation startup Stensul raises $16M — With other marketing channels paused or diminished during the pandemic, email has only become more important.\n  Pandemic’s impact disproportionately reduced VC funding for female founders — Bias, seed-stage bottlenecks and slow structural change continue to hold women back.\n Booming edtech M&amp;A activity brings consolidation to a fragmented sector — Edtech M&amp;A activity is buzzier than usual.\n Starling Bank founder Anne Boden says new book ‘isn’t a memoir’ — In “Banking On It,” Boden relates how she came up with the idea to found a challenger bank and the many obstacles she faced along the way.\n (Reminder: Extra Crunch is our membership program, which aims to democratize information about startups.  You can sign up here.)\n  Raspberry Pi Foundation announces the cute little Raspberry Pi 400 — The Raspberry Pi 400 is a computer integrated in a compact keyboard that costs $70.\n Original Content podcast: Bill Murray’s charm can’t hide the sadness of ‘On the Rocks’ — The film reunites Murray with his “Lost in Translation” director Sofia Coppola.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-11-03 07:25:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,crunch,选举", "title": "\n每日嘎嘎作响：苹果宣布其下一项重大活动", "title_en": "\n\t\t\t\tDaily Crunch: Apple announces its next big event\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/daily-crunch-apple-announces-its-next-big-event/", "via": "", "real_tags": ["apple", "苹果", "crunch", "选举"]}, {"category": "", "categoryclass": "", "imagename": "a90c8458da68a9ba839464f214db9856.jpg", "infoid": 1032874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据华尔街日报报道，沃尔玛已经切断了与博萨新星机器人公司(Bossa Nova Robotics)的联系，博萨新星机器人公司生产的机器人可以扫描货架上的库存。\n根据这份报告，这家零售商已经想出了其他简单而具成本效益的方法，用它的人类工人而不是机器人来管理货架上的产品。\n该公司仍在推进其他技术试验，最近选择了四家门店作为电子商务实验室。\n在沃尔玛的一些门店，机器人在销售楼层漫步，帮助检查货架是否有库存。但是，据“华尔街日报”报道，在发现人类也可以做同样的工作后，这家大型零售商现在决定终止与这些机器背后的机器人公司的合同。\n这篇报道援引未具名的知情人士的话说，沃尔玛最近切断了与博萨诺瓦机器人公司(Bossa Nova Robotics)的联系。沃尔玛的一位发言人告诉“华尔街日报”，当合同结束时，沃尔玛的4700多家门店里大约有500个机器人。\n在冠状病毒大流行期间，沃尔玛看到了显著的增长，因为美国人购买卫生纸、罐头食品、拼图等。该公司的在线销售额在第二季度几乎翻了一番，因为消费者将购买的商品运到家里，然后在路边取回。这给这家大型零售商带来了新的挑战--快速补充货架，并确保手头有合适的库存。\n在最近接受CNBC采访时，沃尔玛首席执行官道格·董明伦(Doug McMillon)表示，零星的缺货仍然是一个问题。他说，如果他能改变沃尔玛业务的一件事，那就是拥有更高的库存水平。\n根据“华尔街日报”的报道，沃尔玛已经想出了一种简单而经济高效的方法，可以在员工的帮助下管理货架上的产品，而不是使用机器人。报道称，沃尔玛美国首席执行官约翰·弗纳(John Furner)也担心购物者对机器人的反应。\n然而，沃尔玛正在推进其他基于科技的试验。上周，该零售商表示，将把四家门店变成电子商务实验室，测试数字工具和不同的策略，以加快进货和完成在线订单的速度。", "note_en": "Walmart has cut ties with Bossa Nova Robotics, which made robots that scanned shelves for inventory, according to The Wall Street Journal.\n The retailer has come up with other simple and cost-effective ways to manage the products on its shelves with its human workers rather than the robots, according to the report.\n The company is still pushing forward with other tech experimentation and recently picked four stores that will act as e-commerce laboratories.\n At some  Walmart stores, robots have roamed the sales floors and helped check if shelves were stocked. But the big-box retailer has now decided to end its contract with the robotics company behind those machines after finding that people can do about the same work, according to  a report by The Wall Street Journal.\n The report, which cited unnamed people familiar with the situation, said Walmart recently cut ties with Bossa Nova Robotics. A Walmart spokesperson told the Journal that about 500 robots were in Walmart&#39;s more than 4,700 stores when the contract ended.\n  Walmart has seen significant growth during the  coronavirus pandemic, as Americans buy toilet paper, canned goods, puzzles and more. The company&#39;s online sales  nearly doubled in the second quarter, as consumers shipped purchases to their homes and retrieved them by curbside. That&#39;s created a new challenge for the big-box retailer — quickly restocking shelves and making sure it has the right inventory on hand.\n In a recent interview on CNBC&#39;s &#34; Squawk Box,&#34; Walmart CEO Doug McMillon said  sporadic out-of-stocks have continued to be a problem. He said that if he could change one thing about Walmart&#39;s business, it would be &#34;to have an even higher in-stock level.&#34;\n According to the Journal&#39;s report, Walmart has come up with simple and cost-effective ways to manage the products on its shelves with the help of its workers rather than using the robots. The report said Walmart U.S. Chief Executive John Furner also worried about shoppers&#39; reactions to the robots.\n Walmart is pressing ahead with other tech-based experimentation, however. Last week, the retailer said it would  turn four stores into e-commerce laboratories that test digital tools and different strategies that could speed up restocking shelves and fulfilling online orders.", "posttime": "2020-11-03 07:25:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,人类,ends,沃尔玛", "title": "沃尔玛终止与机器人公司的合同，转而聘用人类工人", "title_en": "Walmart Ends Contract With Robotics Company, Opts For Human Workers Instead", "transed": 1, "url": "https://www.cnbc.com/2020/11/02/walmart-ends-contract-with-robotics-company-bossa-nova-report-says.html", "via": "", "real_tags": ["机器人", "人类", "ends", "沃尔玛"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，如果你从其他地方克隆了一个git回购，最好小心不要把它推给github。因为如果它碰巧含有其中一个散列，你可能会被禁止进入Github。据我们所知，这是你的简历。\n现在这里还有另一件有趣的事。我完全有可能将这些提交散列中的一个添加到我的任何Repos中，当然，这是我自己托管的。我可以在不添加任何Github/Microsoft作为RIAA成员希望禁止的内容的情况下做到这一点。\n#git logCommit 1fff890c0980a72d669aaffe9b13a7a077c33ecf(Head-&gt；Master，Origin/Master，Origin/Head)作者：Joey Hess&lt；joeyh@joeyh.name&gt；日期：星期一11月2 18：29：17 2020-0400删除子模块提交8864d5c1182dccdd1cfc9ee6e5d694ae3c70e7afAuthor：joey hess&lt；joeyh@joeyh.name&gt；日期：mon nov 2 18：29：00 2020-0400 add#git ls-tree head^160000[编辑后的cuz+nov 3=100More]用this644 blob 45b98be36b7c7808dc9cbcb76bf7b0b57备份您的CAT视频。\n为此，我在一次提交中添加子模块，而不提交.gitmodule文件，然后在后续提交中删除子模块。\n如果你克隆我的git repo并将其推送给Github，会发生什么呢？\n下一个抱怨我没有向Github发表一份Mygit Repos的人，他们为了把自己的分叉推向Github，不得不从其他地方克隆它，这对我来说是多么恼火，怎么不，我这样做不会干扰Github的垄断，而且不管怎样，Github的独白实际上并不是那么糟糕……。\n#！/bin/shprintf&#34；输入非法回购的url，Citizen：&#34；read whagit submodule add&#34；$wha&#34；whagit rm.gitmodule esgit Commit-m whagit RM whagit Commit-m wha", "note_en": "So, if you clone a git repo from somewhere else, you had better be wary ofpushing it to Github. Because if it happened to contain one of thosehashes, that could get you banned from Github. Which, as we know, is yourresume.\n Now here&#39;s another interesting thing. It&#39;s entirely possible for me to addone of those commit hashes to any of my repos, which of course, I self host. I can do it without adding any ofthe  content which Github/Microsoft, as a RIAA member, wishesto suppress.\n  # git logcommit 1fff890c0980a72d669aaffe9b13a7a077c33ecf (HEAD -&gt; master, origin/master, origin/HEAD)Author: Joey Hess &lt;joeyh@joeyh.name&gt;Date: Mon Nov 2 18:29:17 2020 -0400 remove submodulecommit 8864d5c1182dccdd1cfc9ee6e5d694ae3c70e7afAuthor: Joey Hess &lt;joeyh@joeyh.name&gt;Date: Mon Nov 2 18:29:00 2020 -0400 add# git ls-tree HEAD^160000 commit b5[redacted cuz DMCA+Nov 3 = too much] back up your cat videos with this100644 blob 45b983be36b73c0788dc9cbcb76cbb80fc7bb057 hello\n I did this by adding a submodule in one commit, without committingthe .gitmodules file, and them removing the submodule in a subsequent commit.\n What would then happen if you cloned my git repo and pushed it to Github?\n The next person to complain at me about my not having published one of mygit repos to Github, and how annoying it is to me that they have to cloneit from somewhere else in order to push their own fork of it to Github,and how no, I would not be perpertuating Github&#39;s monopolism in doing so,and anyway, Github&#39;s monopoloy is not so bad actually ...\n  #!/bin/shprintf &#34;Enter the url of the illegal repo, Citizen: &#34;read whagit submodule add &#34;$wha&#34; whagit rm .gitmodulesgit commit -m whagit rm whagit commit -m wha", "posttime": "2020-11-03 07:20:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,github,git", "title": "如何发布无法重新发布到GitHub的Git Repos", "title_en": "How to publish Git repos that cannot be republished to GitHub", "transed": 1, "url": "http://joeyh.name/blog/entry/how_to_publish_git_repos_that_cannot_be_republished_to_github/", "via": "", "real_tags": ["发布", "github", "git"]}, {"category": "", "categoryclass": "", "imagename": "2b85f7e75489525fc3ec7a24caf19fea.jpg", "infoid": 1032872, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "地球上最神奇的地方没有蚊子。没错，迪士尼世界致力于确保你拥有生活中的快乐时光，以至于他们几乎已经让虫子消失了。他们是怎么做到的？不，答案不是魔法。Vlogger Rob Play在Neatorama发现的一段视频中深入研究了答案。\n在任何地方消灭讨厌的蚊子都将是一项壮举，但迪士尼世界位于佛罗里达州，也就是所谓的佛罗里达州。沼泽地带，那里的昆虫比其他地方更多。臭虫令人讨厌，但如果它们携带寨卡病毒之类的疾病，那么它们也很危险，迪士尼有责任保护它的客人。简而言之，迪士尼通过采用包括喷洒杀虫剂和维护自然捕食者在内的全面计划来消灭害虫，所有这些都是以一种令人敬畏的警觉水平来做的。\n该公园有一个名为蚊子监控计划的项目来管理这一切。到处都有二氧化碳陷阱，一旦它们捕捉到臭虫，迪士尼的团队就会冻结并分析种群，以确定如何最好地根除它们。有趣的是，他们还使用鸡。这些被称为“哨兵鸡”的小鸡生活在迪士尼世界各地的鸡舍里。当这些长着羽毛的员工开始日常生活时，他们的血液被监测是否有像西尼罗河病毒这样的蚊媒疾病。幸运的是，这些鸡没有感染病毒--但如果它们真的感染了病毒，迪士尼团队就知道它们是从公园的什么地方感染的，这样它们就可以迅速打击该地区的蚊子。\n你可能还注意到，视频中有七个小矮人喷洒杀虫剂的片段。如果你想知道你是如何错过了“快乐”、“暴躁”和“公司”这一长串的。在1937年上映的“白雪公主和七个小矮人”(Snow White And The Seven Dwarfs)中，你与当地的昆虫种群进行了战斗，但你没有。这些片段来自迪士尼在二战期间制作的另一部宣传片，名为“有翼的天灾”(The Winged Scourge)，所有内容都是关于疟疾的危险和携带疟疾的昆虫。在第二次世界大战的太平洋战区作战时，这种疾病给盟军造成了重大伤亡。\n下次你再去迪士尼世界的时候，一定要在回到现实世界之前欣赏一下这个相对没有昆虫的乌托邦。", "note_en": "There are no mosquitoes in The Most Magical Place on Earth. That&#39;s right,  Disney World is so dedicated to making sure you have the time of your life that they&#39;ve made the bugs practically disappear. How do they pull that off? No, the answer isn&#39;t magic. Vlogger Rob Plays delved into the answer in a  video spotted by  Neatorama.\n It would be a feat to get rid of pesky mosquitoes anywhere, but Disney World is in Florida, a.k.a. swamp territory, where insects are more abundant than other places. Bugs are annoying, but they&#39;re also dangerous if they&#39;re carrying diseases like Zika, and Disney has a responsibility to protect its guests. In short, Disney gets rid of the pests by employing a comprehensive program that includes spraying insecticides and maintaining natural predators, and they do all of this with a level of vigilance that&#39;s fearsome to behold.\n The park has something called the Mosquito Surveillance Program to manage it all. There are carbon dioxide traps everywhere, and once they catch bugs, the team at Disney freezes and analyzes the population to determine how best to eradicate them. Interestingly enough, they also employ the use of chickens. These sentinel chickens, as they&#39;re called, live in coops all over Disney World. While these feathered employees are going about their daily life, their blood is being monitored for mosquito-borne diseases like West Nile virus. Lucky for the chickens, they don&#39;t get sick from the virus—but if they do pick it up, the Disney team knows where in the park they got it from so they can deliver a swift blow to the mosquitoes in that area.\n You may also notice that the video is populated by clips of the Seven Dwarfs spraying insecticides. If you&#39;re wondering how you missed a lengthy sequence in which Happy, Grumpy, and co. did battle with the local insect population in 1937&#39;s  Snow White and the Seven Dwarfs, you didn&#39;t. The clips come from a separate propaganda film that Disney made during World War II called   The Winged Scourge, all about the dangers of  malaria and the insects that carry it. The disease caused major casualties for the Allies while fighting in the Pacific Ocean theater of World War II.\n Next time you&#39;re visiting Disney World, be sure to appreciate the relatively insect-free utopia before returning to the real world.", "posttime": "2020-11-03 07:20:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乐园,reason,迪士尼", "title": "迪士尼乐园没有蚊子的有趣原因", "title_en": "The Fascinating Reason Why There Are No Mosquitoes at Disney World", "transed": 1, "url": "https://www.mentalfloss.com/article/548281/reason-why-there-are-no-mosquitoes-in-disney-world", "via": "", "real_tags": ["乐园", "reason", "迪士尼"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032871, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国泄密者爱德华·斯诺登(Edward Snowden)周一表示，为了不与未来的儿子在疫情肆虐和边境关闭的时代分离，他们正在申请俄罗斯公民身份。\n国际文传电讯社援引斯诺登的俄罗斯律师阿纳托利·库切列纳(Anatoly Kucherena)的话说，斯诺登的妻子林赛(Lindsay)将于12月下旬生孩子。\n现年37岁的斯诺登在2013年泄露秘密文件后逃离美国，并在俄罗斯获得庇护。这些文件显示，他曾担任合同工的美国国家安全局(US National Security Agency)开展了大规模的国内和国际监视行动。\n多年来，美国当局一直希望斯诺登返回美国，接受2013年提出的间谍指控的刑事审判。\n“在与父母分居多年后，我和妻子并不想和儿子分开。这就是为什么，在这个流行病泛滥、边境封闭的时代，我们申请美俄双重国籍。“斯诺登在推特上写道。\n“林赛和我仍将是美国人，用我们所爱的美国的所有价值观抚养我们的儿子，包括畅所欲言的自由。我期待着有一天我可以回到美国，这样一家人就可以团聚了。我们最大的愿望就是，无论我们的儿子住在哪里，他都有宾至如归的感觉。“。\n斯诺登的律师上个月表示，俄罗斯已经授予斯诺登永久居留权，这是获得俄罗斯公民身份的关键一步。\n斯诺登受益于弗拉基米尔·普京(Vladimir Putin)4月份签署成为法律的移民改革，该改革允许外国人在不放弃其他公民身份的情况下获得俄罗斯护照。\n斯诺登的律师阿纳托利·库切列纳(Anatoly Kucherena)告诉国际文传电讯社：“爱德华要求我协助他提交俄罗斯公民身份申请。”\n据国际文传电讯社报道，库切列纳说：“爱德华告诉我，他们的孩子预计将在12月出生；考虑到孩子根据出生权利将有权获得俄罗斯公民身份，他也想成为俄罗斯公民。”\n美国总统唐纳德·特朗普(Donald Trump)在8月份表示，他正在考虑赦免斯诺登。特朗普将在周二的选举中与民主党挑战者乔·拜登(Joe Biden)竞选连任总统。\n斯诺登在俄罗斯保持低调，只笼统地谈到他的生活安排。他否认自己受到来自国家安全部门的压力，也否认自己达成了任何接受庇护的协议。他赞扬了这个国家的自然美景和人民的温暖，同时不时地使用社交媒体批评政府的政策。\n上周，斯诺登的妻子在Instagram上发布的一张照片中宣布了怀孕的消息。“酝酿了很长时间，”她写道。“我们最伟大的合作即将到来。”", "note_en": "The US whistleblower  Edward Snowden and his wife are applying for Russian citizenship in order not to be separated from their future son in an era of pandemics and closed borders, he said on Monday.\n Snowden’s wife, Lindsay, is expecting a child in late December, the Interfax news agency cited Anatoly Kucherena, his Russian lawyer, as saying.\n Snowden, 37, fled the US and was given asylum in  Russia after leaking secret files in 2013 that revealed vast domestic and international surveillance operations carried out by the US National Security Agency where he was a contractor.\n US authorities have for years wanted Snowden returned to the US to face a criminal trial on espionage charges brought in 2013.\n “After years of separation from our parents, my wife and I have no desire to be separated from our son. That’s why, in this era of pandemics and closed borders, we’re applying for dual US-Russian citizenship,” Snowden wrote on Twitter.\n “Lindsay and I will remain Americans, raising our son with all the values of the America we love, including the freedom to speak his mind. And I look forward to the day I can return to the States, so the whole family can be reunited. Our greatest wish is that, wherever our son lives, he feels at home.”\n Russia has already granted Snowden permanent residency rights,  his lawyer said last month, a vital step towards Russian citizenship.\n Snowden is benefiting from an immigration reform signed into law by Vladimir Putin in April that allows foreigners to receive a Russian passport without renouncing other citizenships.\n Anatoly Kucherena, a lawyer for Snowden, told Interfax: “Edward has asked me to assist in filing his application for Russian citizenship.”\n  “Edward has told me that their baby is expected to be born in December; considering that the baby will be entitled to Russian citizenship by the birthright, he also wants to be a citizen of Russia,” Kucherena said, according to Interfax.\n The US president, Donald Trump, said in August he was considering a pardon for Snowden. Trump is running for a second presidential term against Democratic challenger Joe Biden in elections on Tuesday.\n Snowden keeps a low profile in Russia, speaking only in general terms about his living arrangements. He has denied he is under pressure from the country’s security services or has made any deal to receive asylum. He has praised the country’s natural beauty and the warmth of its people, while using social media to criticise government policy from time to time.\n Snowden’s wife announced the pregnancy last week in a  photograph posted to Instagram. “A long time in the making,” she wrote. “Our greatest collaboration coming soon.”", "posttime": "2020-11-03 07:20:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,斯诺,snowden,美国", "title": "爱德华·斯诺登为了未来的儿子申请俄罗斯公民身份", "title_en": "Edward Snowden applies for Russian citizenship for sake of future son", "transed": 1, "url": "https://www.theguardian.com/us-news/2020/nov/02/edward-snowden-applies-for-russian-citizenship-for-sake-of-future-son", "via": "", "real_tags": ["俄罗斯", "斯诺", "snowden", "美国"]}, {"category": "", "categoryclass": "", "imagename": "05556209bc76abfdc289677417daae22.jpg", "infoid": 1032870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前，在AWS俚语中只有一个大小，即p4d.12xLarge实例，8个A100 GPU通过NVIDIA的NVLink通信接口连接，也支持该公司的GPUDirect接口。\n拥有320 GB高带宽GPU内存和400 Gbps网络，这显然是一台非常强大的机器。再加上96个CPU核心、1.1TB系统内存和8TB SSD存储，按需价格为每小时32.77美元可能就不足为奇了(尽管一年期预留实例的价格降至每小时不到20美元，三年期预留实例的价格为11.57美元。\n在极端情况下，您可以将4,000个或更多GPU组合到一台EC2 UltraCluster(AWS称之为这些机器)中，从而在本质上是超级计算机规模的机器上实现高性能计算工作负载。考虑到价格，你不太可能在短期内推出这样的集群来培训你的玩具应用程序的模型，但AWS已经与许多企业客户合作测试这些实例和集群，包括丰田研究院、通用电气医疗保健和怡安。\n“在(丰田研究院)，我们正在努力建设一个每个人都可以自由行动的未来，”TRI基础设施工程技术主管迈克·加里森(Mike Garrison)说。上一代P3实例帮助我们将训练机器学习模型的时间从几天减少到几个小时，我们期待着利用P4D实例，因为额外的GPU内存和更高效的浮点格式将使我们的机器学习团队能够以更快的速度训练更复杂的模型。“", "note_en": "For now, there is only one size available,  the p4d.12xlarge instance, in AWS slang and the eight A100 GPUs are connected over NVIDIA’s  NVLink communication interface and offer support for the company’s  GPUDirect interface as well.\n  With 320 GB of high-bandwidth GPU memory and 400 Gbps networking, this is obviously a very powerful machine. Add to that the 96 CPU cores, 1.1 TB of system memory and 8 TB of SSD storage and it’s maybe no surprise that the on-demand price is $32.77 per hour (though that price goes down to less than $20/hour for 1-year reserved instances and $11.57 for three-year reserved ones.\n  On the extreme end, you can combine 4,000 or more GPUs into  an EC2 UltraCluster, as AWS calls these machines, for high-performance computing workloads at what is essentially a supercomputer-scale machine. Given the price, you’re not likely to spin up one of these clusters to train your a model for your toy app anytime soon, but AWS has already been working with a number of enterprise customers to test these instances and clusters, including Toyota Research Institute, GE Healthcare and Aon.\n  “At [ Toyota Research Institute],   we’re working to build a future where everyone has the freedom to move,” said Mike Garrison, Technical Lead, Infrastructure Engineering at TRI. “The previous generation P3 instances helped us reduce our time to train machine learning models from days to hours and we are looking forward to utilizing P4d instances, as the additional GPU memory and more efficient float formats will allow our machine learning team to train with more complex models at an even faster speed.”", "posttime": "2020-11-03 07:01:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,launches,实例", "title": "\nAWS推出新一代GPU实例", "title_en": "\n\t\t\t\tAWS launches its next-gen GPU instances\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/aws-launches-its-next-gen-gpu-instances/", "via": "", "real_tags": ["推出", "launches", "实例"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "著名的快速反平方根是一些神秘的代码，不是由编程传奇人物John Carmack编写的，用于计算$1/\\sqrt{x}$的快速近似值：\n//来自地震3竞技场的代码。Float q_rsqrt(Float Number){long i；Float x2，y；Const Float Three Halfs=1.5F；x2=number*0.5F；y=number；i=*(long*)&amp；y//邪恶的浮点位级黑客攻击i=0x5f3759df-(i&&gt;；&&gt;1)；//他妈的是什么？Y=*(浮点*)&amp；i y=y*(Three Halfs-(x2*y*y))；//第一次迭代//y=y*(Three Halfs-(x2*y*y))；//第二次迭代，返回y；}。\n游戏总是计算平方根和反平方根，以找到向量的长度并将其归一化，但是使用sqrt()函数可能非常慢。上面的代码通过一些整数魔术更快地找到近似结果。我很好奇它是如何工作的，但维基百科上描述它的页面写得太糟糕了，所以更容易从头开始弄清楚。这是我找到的东西。\n代码的工作方式是计算$1/\\sqrt{x}$(也可以写为$x^{-1/2}$)的初始近似值，然后使用牛顿-拉夫森方法的一次或两次迭代进行优化。如果你不熟悉牛顿-拉夫森方法，别担心--它不是很复杂，也不是很聪明，所以如果你愿意，你可以忽略它。网络上有一大堆很好的视觉解释(比如这个)，所以我就不在这里赘述了。\n该方法的核心是浮点数的位操作，因此我们需要知道它们是如何工作的。但是，使用一种没有人使用的奇怪的数字格式来解释这种方法会更简单。\n我们可以用高位表示符号(0表示正数，1表示负数)，其余位表示正实数。使用专用位来表示符号称为符号和幅度。因为我们不能取负数的平方根，所以我们可以假设符号位始终为0。\n我们可以将接下来的8位解释为值的整数部分，其余的位是小数部分。在本例中，值是二进制的10001010.0100001(我们可以去掉尾随的零，就像十进制数一样)。这相当于十进制值$138.2578125。$我们可以使用这个值，我将它表示为$f$，以几种不同的方式表示数字。如果我们将31位值视为无符号整数$u$(即$u=\\mathrm{0b01000101001000010000000000000000}=1159790592$)，则。\n$$f=\\frac{u}{2^{23}}$$我们可以只设置$x=f$，即我们认为01000101 00100001 00000000 00000000代表数字$138.2578125。$此格式称为固定点，因为小数点始终固定在同一位置。它有一些特殊用途，但并不常用，因为它的主要弱点是：它可以表示的值范围非常有限：在本例中，最多只能有128.9999999个值。\n我们可以通过对不动点取幂来增加我们可以表示的值的范围，即$f=2^{x-127}$。所以，不考虑01000101 00100001 00000000 00000000来表示$138.2578125，我们说它表示数字$2^{138.2578125-00000000}=2448.7，这被称为对数系统(Lns)。使用$^{-127}$偏移量，以便我们可以表示小于$1的数字。$现在我们可以表示最大值为$2^{128.9999999}的数字。$虽然我们确实失去了一些很好的属性，但最关键的是很难使用此数字系统实现加法和减法。\n为了使加法和减法更容易实现，我们可以区别对待$f$的整数部分和小数部分，让我们称它们为$f_e$和$f_m$。我们用$x=2^{f_e-127}\\x(1+f_m)$使整数部分对数，小数部分线性。在我们的例子中，$2^{138-127}\\乘以1.2578125=2576。$这意味着$2$的指数总是整数，这是计算机很容易处理的。这种格式被称为浮点，因为小数点是浮动的(不用担心)。几乎所有的代码都使用这种实数格式，并且几乎所有的处理器都有对它的硬件支持。这也是C中的实数是浮点数的原因。\n总而言之，相同的位模式可能意味着三个不同的数字，具体取决于我们使用的数字格式：\n如果我们使用LNS数，我们不需要技巧来计算平方根的倒数-我们可以很容易地精确地计算它。回想一下，无符号整数$u$的LNS解释为。\n$$2^{u/2^{23}-127}$(2^x)^{-1/2}=2^{-x/2}$$因此要找到将给出反平方根的无符号整数$q$，我们需要求解。\n$$2^{q/2^{23}-127}=2^{-(u/2^{23}-127)/2}$q/2^{23}-127=-(u/2^{23}-127)/2$q/2^{23}-127=-(u/2^{23})/2+127/2$q/2^{23}=190.5-(u/2^{23})/2$q=190.5\\x 2^{23}-u/2$$。并使用位移位除以2。\n看起来眼熟吗？这与我们之前看到的神秘路线非常接近！但是，我想你会问，这是给这些奇怪的LNS号码的！。实际的浮点数是多少？&#34；\n上面的公式计算LNS数的精确反平方根。诀窍在于浮点数实际上与LNS数非常相似！它们的差异永远不会超过$\\frac{2}{e\\log2}=1.0615的因子。$下图显示了重新解释为浮点数时的lns编号的值。换句话说，当我们获取LNS数的位模式，并计算出如果这些位是浮点数，它们代表什么值时，我们得到的值。如你所见，他们非常接近！\n查看LNS和浮点之间差异的另一种方法是改变$f$，并绘制LNS和浮点结果。\n您可以看到LNS是如何在2的整数幂之间完全对数的，但是浮点在这些点之间是线性的。所有这些都只是说LNS和浮点数非常相似，所以LNS数的精确平方根倒数仍然非常接近浮点数的平方根倒数！但是为什么代码使用0x5f3759df而不是0x5F400000呢？\n我们有一个计算，用LNS数给出一个精确的结果，用浮点数给出一个近似的结果。这个近似值有多好？对于不同的输入，我们可以画出近似输出与正确输出的比率。使用对数刻度，这样以恒定因子(例如$\\x 2$或$\\div 2$)计算出来的结果看起来是一样的。绿线表示初始近似后的结果，蓝线表示牛顿-拉夫森迭代一次后的结果。越接近1(红线)越好。\n使用$190.5$(0x5F400000)的减法(我刚刚编造的一个词)，您可以看到初始近似值总是太高(绿线在红线之上)。这是因为浮点数始终大于相应的LNS数。估计约为1元至1.09元，是实际答案的1倍。如果我们可以将输出乘以大约$0.96$的恒定因子，那么我们就可以平衡$1$上下的误差，这将减少最大误差。\n这很容易做到，只需将减法剂减去少量即可。我可以详细介绍一下，但是您可以通过在上面滑动滑块很容易地看到效果。看看你能犯的最大错误有多小，然后单击Carmack按钮查看Quake 3使用的值。\n这是相当接近最佳的！但是..。也许有一种方法我们可以做得更好。请注意，牛顿-拉夫森迭代一次后的输出总是太小(蓝线在红线下方)。有没有办法把它乘以略高于1美元的某个常数因子？是!。我们所要做的就是稍微修改一下原始代码中的0.5。试着玩一下这个“半边”滑块。事实上，当我们还在做这件事的时候，如果我们也改变代码中的1.5，并将整个代码输入到我编写的一个拼凑在一起的优化程序中，会发生什么呢？我们可以做得更好一点！单击额外的按钮，查看允许更改两个或三个参数时的优化结果。\n基本上就是这样。总而言之，使用LNS数字，我们可以使用0x5F400000计算出精确的解。LNS数与浮点数非常接近，因此相同的代码给出了浮点数的近似解决方案。但是浮点数总是大于LNS数，所以近似中存在偏差，可以通过从0x5F400000中减去少量来纠正。\n如果有什么不清楚或我弄错了，请告诉我。继续往下看，我假装你已经问了几个额外问题的答案。\n是!。我开始这样做，但是因为误差曲线有3到4个部分，所以很快就变得非常单调乏味。数值优化要容易得多。\n$$q=190.5-\\frac{u}{2}$q=\\frac{381-u}{2}$x^{\\pm 2^n}$$其中$n$是整数(正数或负数)。例如，$x^{1/2}$，$x^{-8}$，$x^2$，尽管您可能不会将其用于正指数，因为您可以只使用乘法来获得准确的答案。\n它可以用来做立方根之类的东西吗？也许吧。我们需要解决的问题是：\n$$2^{q/2^{23}-127}=2^{(u/2^{23}-127)/3}$q/2^{23}-127=\\frac{u/2^{23}-127}{3}$q/2^{23}=\\frac{u/2^{23}-127}{3}+127$q=\\frac{u}{3}+\\frac{2\\x 127}{3}*2^{23}=\\frac{u}{3}+。\\mathm{0x2A555555}$$因此我们的(未优化；读者练习)魔术线条将如下所示(未经过测试！)。\n整数除法不如位移位快，但是因为我们除以常数，所以大多数编译器能够将其优化为乘法和位移位。怎么做到的？你问吗？让我查一下维基百科。", "note_en": "The famous  fast inverse square root is some mysterious code  not written by programming legend John Carmack to calculate a fast approximation of $1/\\sqrt{x}$:\n  // Code from Quake 3 Arena. float Q_rsqrt( float number ) { long i; float x2, y; const float threehalfs = 1.5F; x2 = number * 0.5F; y = number; i = * ( long * ) &amp;y // evil floating point bit level hacking i = 0x5f3759df - ( i &gt;&gt; 1 ); // what the fuck? y = * ( float * ) &amp;i y = y * ( threehalfs - ( x2 * y * y ) ); // 1st iteration //\ty = y * ( threehalfs - ( x2 * y * y ) ); // 2nd iteration, this can be removed return y; }\n  Games calculate square roots and inverse square roots all the time to find the lengths of vectors and  to normalise them, but using the   sqrt() function can be very slow. The code above finds an approximate result much more quickly through some integer magic. I was curious how it works but the  Wikipedia page describing it is  so badly written that it was easier to figure it out from scratch. Here&#39;s what I found.\n   The code works by computing an initial approximation to $1/\\sqrt{x}$ (which can also be written as $x^{-1/2}$) and then refining it using one or two iterations of  the Newton-Raphson method. If you aren&#39;t familiar with the Newton-Raphson method, don&#39;t worry - it isn&#39;t very complicated and also isn&#39;t the clever bit so you can ignore it if you like. There are a ton of good visual explanations on the web (e.g.  this one) so I won&#39;t go into it here.\n      The heart of the method is bit manipulation of floating point numbers, so we need to know how they work. But the method is simpler to explain using a weird number format that nobody uses.\n       We can use the upper bit for the sign (0 for positive numbers, 1 for negative numbers), and the remaining bits to represent a  positive real number. Using a dedicated bit to represent sign is called  sign and magnitude. Since we cannot take the square root of a negative number we can assume the sign bit is always 0.\n  We can interpret the next 8 bits as the integral part of a value, and the remaining bits are the fractional part. In this case the value is  10001010.0100001 in binary (we can elide trailing zeros just like with decimal numbers). This corresponds to a decimal value of $138.2578125.$ We can use this value which I will denote $f$ to represent numbers in a few different ways. If we treat the 31-bit value as an unsigned integer $u$ (i.e. $u=\\mathrm{0b01000101001000010000000000000000}=1159790592$) then\n $$f = \\frac{u}{2^{23}}$$    We can just set $x=f$, i.e. we consider  01000101 00100001 00000000 00000000 to represent the number $138.2578125.$ This format is called  fixed point, because the decimal point is always always fixed at the same place. It has some niche uses but isn&#39;t commonly used because of its major weakness: the range of values it can represent is very limited: only up to 128.9999999 in this example.\n    We can increase the range of values that we can represent by exponentiating the fixed point value, i.e. $f=2^{x-127}$. So, instead of considering  01000101 00100001 00000000 00000000 to represent the value $138.2578125$ we say it represents the number $2^{138.2578125 - 127} = 2448.7.$ This is called the  Logarithmic Number System (LNS). The $^{-127}$ offset is used so we can represent numbers smaller than $1.$ Now we can represent numbers up to $2^{128.9999999}.$ We do lose some nice properties though, the most critical is that addition and subtraction are difficult to implement with this number system.\n    To make addition and subtraction easier to implement we can treat the integral and fractional parts of $f$ differently, let&#39;s call them $f_e$ and $f_m$. We make the integral part logarithmic, and the fractional part linear using $x=2^{f_e - 127} \\times (1 + f_m)$. In our example $2^{138 - 127} \\times 1.2578125 = 2576.$ This means the exponent of $2$ is always integral, which computers can easily deal with. This format is called  floating point because the decimal point floats around (don&#39;t worry about it). Virtually all code uses this format for real numbers, and almost all processors have hardware support for it. This is also why real numbers in C are  float.\n  To summarise, the same bit pattern can mean three different numbers depending on the number format we are using:\n     If we are using LNS numbers, we do not need a trick to calculate the inverse square root - we can easily calculate it exactly. Recall that the LNS interpretation of an unsigned integer $u$ is\n $$2^{u/2^{23} - 127}$$   $$(2^x)^{-1/2} = 2^{-x/2}$$  So to find the unsigned integer $q$ that would give the inverse square root, we need to solve\n $$2^{q/2^{23} - 127} = 2^{-(u/2^{23} - 127)/2}$$   $$q/2^{23} - 127 = -(u/2^{23} - 127)/2$$ $$q/2^{23} - 127 = -(u/2^{23})/2 + 127/2$$ $$q/2^{23} = 190.5 - (u/2^{23})/2$$ $$q = 190.5 \\times 2^{23} - u/2$$      Or if I convert that constant to  hex, and use a bit shift to divide by 2\n    Look familiar? It&#39;s pretty close to the mystical line we saw before! &#34;But&#34;, I imagine you ask, &#34;this is for these weird LNS numbers! What about actual floating point numbers?&#34;\n   The formula above calculates an  exact inverse square root for LNS numbers. The trick is that floating point numbers are actually pretty similar to LNS numbers! They never differ by more than a factor of $\\frac{2}{e\\log 2} = 1.0615.$ The following graph shows the value of an LNS number when reinterpreted as a float. In other words the value we get when we take the bit pattern of an LNS number and work out what value those bits represent if they were a floating point number. As you can see they are pretty close!\n      Another way to look at the difference between LNS and floating point is to vary $f$ and plot the LNS and floating point results.\n       You can see how LNS is fully logarithmic between integer powers of 2, but floating point is linear between those points. All this is just to say that LNS and floating point are pretty similar, so the exact inverse square root of an LNS number is still pretty close to the inverse square root of a floating point number! But why does the code use  0x5f3759df instead of  0x5F400000?\n   We have a calculation that gives an exact result with LNS numbers, and an approximate result with floating point. How good is the approximation? We can plot the ratio of the approximate output to the correct output for different inputs. A log scale is used so that being out by a constant factor (e.g. $\\times 2$ or $\\div 2$) looks the same. The green line shows the result after the initial approximation, the blue line shows the result after one iteration of Newton-Raphson. Closer to 1 (the red line) is better.\n                        Using a subtractant (a word I just made up) of $190.5$ ( 0x5F400000) you can see that the initial approximation always gives a value that is too high (the green line is above the red line). This is because floating point numbers are always greater than the corresponding LNS number. The estimate is somewhere between $1$ and $1.09$ times the actual answer. If we could multiply that output by a constant factor of around $0.96$ then we could balance the error above and below $1$, which would reduce the maximum error.\n  This is easy to do just by reducing the subtractant by a small amount. I could go into detail, but you can easily see the effect by sliding the slider above. See how small you can make the maximum error, and then click the &#34;Carmack&#34; button to see the value Quake 3 uses.\n  It&#39;s pretty close to optimal! But... maybe there&#39;s a way we can do better. Notice that the output after one iteration of Newton-Raphson is still always too small (the blue line is below the red line). Is there a way we could multiply that by some constant factor slightly more than $1$? Yes! All we have to do is modify the  0.5 in the original code a little.    Try playing around with the &#34;One half&#34; slider. In fact, while we&#39;re at it, what happens if we change the  1.5 in the code too and feed the whole thing into a hacked together  optimisation program that I wrote? We can do even slightly better! Click the extra buttons to see the optimisation results when two or three parameters are allowed to change.\n    That&#39;s basically it. To summarise, using LNS numbers we can calculate an exact solution using  0x5F400000. LNS numbers are pretty close to floating point numbers, so the same code gives an approximate solution for floating point. But floating point numbers are always greater than LNS numbers so there is a bias in the approximation that can be corrected by subtracting a small amount from  0x5F400000.\n  Let me know if anything wasn&#39;t clear or I made a mistake. Read on for the answers to a few extra questions I&#39;m pretending you have asked.\n    Yes! I started doing this, but because there are 3 or 4 parts to the error curve it gets very tedious very quickly. Numerical optimisation is much much easier.\n     $$q=190.5 - \\frac{u}{2}$$   $$q=\\frac{381 - u}{2}$$       $$x^{\\pm 2^n}$$  Where $n$ is an integer (positive or negative). E.g. $x^{1/2}$, $x^{-8}$, $x^2$, though you probably wouldn&#39;t use it for positive exponents since you can just use multiplication to get an exact answer.\n  Can it be used for things like the cube root? Maybe. We need to solve:\n $$2^{q/2^{23} - 127} = 2^{(u/2^{23} - 127)/3}$$ $$q/2^{23} - 127 = \\frac{u/2^{23} - 127}{3}$$ $$q/2^{23} = \\frac{u/2^{23} - 127}{3} + 127$$ $$q = \\frac{u}{3} + \\frac{2\\times 127}{3} * 2^{23} = \\frac{u}{3} + \\mathrm{0x2A555555}$$  So our (non-optimised; exercise for the reader) magic line would look like this (not tested!)\n    Integer division is not as fast as a bit shift, but because we are dividing by a constant most compilers are able  to optimise it into multiplication and bit shifts. &#34;How?&#34; you ask? Let me just check Wikipedia...", "posttime": "2020-11-03 06:56:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "平方根,inverse,表示", "title": "快速反平方根", "title_en": "Fast Inverse Square Root", "transed": 1, "url": "https://timmmm.github.io/fast-inverse-square-root/", "via": "", "real_tags": ["平方根", "inverse", "表示"]}, {"category": "", "categoryclass": "", "imagename": "6c0c8dd3c15c2aa3850c91466d1fe702.png", "infoid": 1032868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此漫画的永久链接：https://xkcd.com/2380/图片地址(用于热链接/嵌入)：https://imgs.xkcd.com/comics/election_impact_score_sheet.png。\nXkcd.com最好用Netscape Navigator 4.0或更低版本在Apple IIGS上用Javascript模拟的奔腾3±1上查看，屏幕分辨率为1024x1。请启用您的广告拦截程序，禁用高热烘干，然后将您的设备从飞机模式中移除，并将其设置为船载模式。出于安全原因，请在浏览时保持大写锁定。\n这意味着你可以自由复制和分享这些漫画(但不能出售它们)。更多细节。", "note_en": "Permanent link to this comic: https://xkcd.com/2380/ Image URL (for hotlinking/embedding): https://imgs.xkcd.com/comics/election_impact_score_sheet.png\n xkcd.com is best viewed with Netscape Navigator 4.0 or below on a Pentium 3±1 emulated in Javascript on an Apple IIGS at a screen resolution of 1024x1. Please enable your ad blockers, disable high-heat drying, and remove your device from Airplane Mode and set it to Boat Mode. For security reasons, please leave caps lock on while browsing.\n This means you&#39;re free to copy and share these comics (but not to sell them).  More details.", "posttime": "2020-11-03 06:56:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "选举,election,https", "title": "Xkcd：选举影响计分表", "title_en": "Xkcd: Election Impact Score Sheet", "transed": 1, "url": "https://xkcd.com/2380/", "via": "", "real_tags": ["选举", "election", "https"]}]