[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1069336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "级别 1 根据您的需要，AGPL 是一种选择。它不会阻止第三方将您的开源软件作为服务运行，但它确实要求他们将源代码提供给所有用户（因此，用户可以根据需要获取修改后的代码并自行运行） .或者，您可以使用 CC BY-NC-SA 许可证，该许可证禁止所有商业用途，并要求衍生作品在同一许可证下发布。在我的脑海中，我不知道任何允许内部商业使用但禁止将基于软件的服务作为产品销售的许可证，如果这就是你的意思的话。级别 2 我知道 Elastic License V2 接近了。但显然它不被视为开源许可证:( 级别 1 我认为你的问题与许多企业家问“如果有人窃取我的想法怎么办”不同？你的 OSS 很可能是下一个切片面包，但如果你处于一个位置云提供商将其作为服务出售的地方，你已经做到了。你可以通过多种方式赚钱，包括提供增值服务、高级支持等。有多种方法可以通过流行的 OSS 工具获利。级别 1 可以” t 完成。如果它是*适当的* OSS，根据定义，它的开放程度足以供 AWS 使用。阻止 AWS 使用它的限制将使其不再是开源的。\n这就是为什么darklang 是“源可用”而不是开源的部分原因。人们仍然可以查看来源以了解正在发生的事情，如果他们愿意，可以贡献等等。如果您的用户自己运行您的软件很有价值，那么这对您来说不是最好的许可证。在我们的例子中，我们没有创建我们希望我们的用户运行的东西，所以这就是我们使用这个特定许可证的原因。级别 1 您可以选择您最喜欢的任何许可证（GPLv2、GPLv3、MIT、AGPL 等等），但对其进行修改以在末尾添加类似内容：“属于以下各项的子公司、拥有或控制的公司公司，或以下公司的官员，没有获得使用该软件的许可：正如其他人所说，AGPL通常是一个不错的选择。目前尚不完全清楚它的禁止和要求，因此mega-corps对使用任何 AGPL。您也可以对您编写的代码进行双重许可（针对大众的 AGPL，亚马逊的专有许可，如果他们想为他们不过敏的许可付费）但如果您正在合并来自一般人的代码贡献在你开始接受贡献之前，拥有一个 Audacity/Muse 风格的 CLA 会有所帮助，这样那些不想为专有许可证做出贡献的人可以避免为你的项目做出贡献。级别 1 有些大公司不会使用WTFPL 许可软件：Go ogle 和英特尔肯定不会。\n级别 1 我看到其他地方推荐的知识共享许可。请注意，不建议将它们用于软件。见：https://creativecommons.org/faq/#can-i-apply-a-creative-commons-license-to-software level 1 知识产权法是胡说八道，只让律师致富。专注于最大程度提高软件质量的方面。在公共领域许可它。举个例子，sqlite 比它好得多。如果它有用但具有限制性许可证，则很可能有人会更宽容地重写它，届时将停止使用限制性版本。", "note_en": "level 1  Depending on what you want, AGPL is one option. It won’t stop a third party from running your open-source software as a service, but it does require that they provide the source code to all users (hence, the users could take the modified code and run it themselves if they wanted).\n Alternatively you could use a CC BY-NC-SA license which prohibits all commercial use and requires that derivative works are published under the same license.\n Off the top of my head I am not aware of any licenses that would allow internal commercial use but prohibit selling a service based on the software as a product, should that be what you mean.\n level 2  I know Elastic License V2 comes close. But apparently it&#39;s not considered an open-source license :(\n  level 1  I think your question is not unlike many entrepreneurs ask &#34;what if someone steals my idea&#34;?\n Your OSS might well be the next sliced bread, but if you are in a position where cloud providers are selling it as a service, you have it made. You can make money in multiple ways, including providing value-add services, premium support, etc. There are  multiple ways to monetize a popular OSS tool.\n level 1  Can&#39;t be done. If it&#39;s *proper* OSS, the it&#39;s by definition open enough for AWS to use. A restriction that prevents AWS from using it would make it no longer open source.\n This is part of why darklang is &#34;Source Available&#34; instead of open source. People can still see the source to understand what&#39;s going on, contribute if they wish, etc.\n  If it&#39;s valuable for your users to run your software themselves, this won&#39;t be the best license for you. In our case, we&#39;re not creating something we want our users to run, so that&#39;s why we used this particular license.\n level 1  You could pick whatever license you like the most (GPLv2, GPLv3, MIT, AGPL, whatever) but modify it to add something like this at the end:\n &#34;Companies which are a subsidiary of, owned by, or controlled by the following companies, or by the officers of the following companies, are not licensed to use this software:\n  As others have mentioned, AGPL is generally a good choice. It&#39;s not yet entirely clear what it prohibits and requires, so mega-corps are extremely allergic to using anything that is AGPL.\n You can also dual-license code you write (AGPL for the masses, proprietary license for Amazon if they want to pay for a license they&#39;re not allergic to) but if you are incorporating code contributions from the general public it would help to have an Audacity/Muse-style CLA in place before you start accepting contributions, so that people who don&#39;t want to contribute to a propriety license can avoid contributing to your project.\n level 1  Some bigcos won’t use WTFPL-licensed software: Google and Intel certainly won’t.\n level 1  I saw a Creative Commons license recommended elsewhere. Please be aware that they&#39;re not recommended for software. See:  https://creativecommons.org/faq/#can-i-apply-a-creative-commons-license-to-software\n level 1  Intellectual property laws are nonsense to make only lawyers rich. Focus on what will maximally improve the quality of the software. License it in the public domain. As an example, sqlite is so much better off for it. If it&#39;s useful but has a restrictive license, odds are that someone will rewrite it more permissively, at which time the restrictive version will cease to be used.", "posttime": "2021-07-24 07:15:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,project", "title": "使用什么许可证来防止 AWS 等。将我的项目作为服务出售？", "title_en": "What license to use to prevent AWS et al. from selling my project as a service?", "transed": 1, "url": "https://www.reddit.com/r/opensource/comments/oqalj1/what_license_should_i_use_to_prevent_aws_e_al/", "via": "", "real_tags": ["服务", "project"]}, {"category": "", "categoryclass": "", "imagename": "f020a06936f6fe91ef3703317e545ba6.jpg", "infoid": 1069335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook 宣布了一个新的 API，可以让开发人员将来自 Quest 2 传感器的视频整合到他们的游戏和应用程序中，从而创造一种混合现实体验。借助 Passthrough API，开发人员不仅能够将头显传感器的黑白​​图像混合到他们的体验中，而且还能够自定义它最终对玩家的看法、应用效果和甚至让真实世界出现在特定的表面上。 Facebook 的公告包括 API 如何通过允许集成现实键盘和办公桌来提高软件生产力的示例，以及游戏如何包含您的真实家具以供敌人躲在后面。也很容易想象将您的真实环境与虚拟世界混合在一起的其他有趣体验 - 您在自己的房子里解决门户式的谜题，或者能够看到您的墙壁被虚拟油漆覆盖？当被问及与第一代 Quest 的兼容性时，Facebook 告诉 UploadVR，该 API 目前仅适用于 Quest 2。在公告中，Facebook 表示 API 的图像处理是在设备上完成的，使用它的应用程序将无法查看或存储来自 Quest 2 传感器的图像。 Facebook 正在将 API 的实验版本添加到其即将推出的开发人员工具中，它将首先提供给使用 Unity 构建软件的程序员。 Facebook 承诺该 API 将在未来获得对其他开发平台的支持。 Quest、Quest 2 和 Rift S 耳机已经有一个 Passthrough 技术版本，可以让用户快速了解现实世界中发生的事情。 Facebook 还允许你将 Passthrough 设置为你的虚拟环境，为你提供一个真实环境的版本（尽管是黑白的），你可以在其中导航 Oculus UI。它甚至在关于其无限办公室功能的视频中展示了这种能力。长期以来，将您的真实环境集成到虚拟世界的能力一直是带有集成摄像头的耳机的更令人兴奋的承诺之一。微软甚至在将其 VR 平台命名为 Windows Mixed Reality 时引用了这个想法（无论实际交付了多少）。然而，Oculus 的 API 的消息并不意味着您今天就可以拿起耳机并拥有混合现实体验。 Facebook 在其公告中表示，它希望让开发人员在“今年晚些时候”向玩家提供使用 Passthrough 的软件。尽管如此，这个 API 对开发人员的可用性还是令人兴奋的，因为它应该允许在 Oculus 平台上获得新的体验类型。", "note_en": "Facebook announced a new API that will let developers incorporate video from the Quest 2’s sensors into their games and applications, creating a mixed reality experience. With the Passthrough API, developers will not only be able to mix the black-and-white images from the headset’s sensors into their experiences, but they’ll also be able to customize how it ends up looking to the player, apply effects, and even have the real world show up on specific surfaces.\n Facebook’s announcement includes examples of how the API could improve productivity software by allowing integration of real-life keyboards and desks, and how games could include your real-life furniture for enemies to hide behind. It’s also easy to imagine other fun experiences that mix your real environment with a virtual world — how about Portal-esque puzzles that you solve in your own house, or the ability to see your walls covered in virtual paint?\n   Facebook told  UploadVR that the API was currently only for the Quest 2 when asked about compatibility with the first-generation Quest. In the announcement post, Facebook says the image processing for the API is done on-device and that applications using it won’t be able to see or store the images from the Quest 2’s sensors.\n Facebook is adding the experimental version of the API to its upcoming developer tools, and it’ll be available first to programmers using Unity to build their software. Facebook does promise that the API will be getting support for other development platforms in the future.\n  The Quest, Quest 2, and Rift S headsets  already have a version of the Passthrough technology, which lets users get a quick look at what’s happening around them in the real world. Facebook also lets you  set Passthrough as your virtual environment, giving you a version of your real environment (albeit in black and white) that you can navigate the Oculus UI in. It even  showed off that ability in a video about  its Infinite Office feature.\n  The ability to integrate your real environment into a virtual world has long been one of the more exciting promises of headsets with integrated cameras. Microsoft even invoked the idea when it named its VR platform Windows Mixed Reality (regardless of how much that’s actually been delivered on).\n The news of Oculus’ API doesn’t mean that you’ll be able to pick up your headset and have a mixed reality experience today, however.  In its announcement, Facebook says it’s looking to let developers ship software using Passthrough to players “later this year.” Still, this API’s availability to developers is exciting, as it should allow for new types of experiences on the Oculus platform.", "posttime": "2021-07-24 07:15:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "passthrough,api", "title": "Oculus 的 Passthrough API 将实现混合 VR 和现实世界的体验", "title_en": "Oculus’ Passthrough API will enable experiences that mix VR and the real world", "transed": 1, "url": "https://www.theverge.com/2021/7/23/22590794/oculus-mixed-reality-api-quest-2-development-kit-unity", "via": "", "real_tags": ["api"]}, {"category": "", "categoryclass": "", "imagename": "af7c1d31f620a7326ae4d26fa51ad2f0.jpg", "infoid": 1069334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一段延时涂鸦总结了 Mark Weiser 于 1991 年发表在《科学美国人》上的开创性文章 The Computer for the 21st Century。", "note_en": "A time lapse doodle summarizing Mark Weiser's seminal article The Computer for the 21st Century, published in 1991 in Scientific American.", "posttime": "2021-07-24 07:15:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,century,文章", "title": "延时涂鸦：Mark Weiser 1991 年的“21 世纪计算机”[视频]", "title_en": "Time lapse doodle: Mark Weiser’s 1991 “Computer for the 21st Century” [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=CkHALBOqn7s", "via": "", "real_tags": ["计算机", "century", "文章"]}, {"category": "", "categoryclass": "", "imagename": "13897cb30823899267f22e061625b574.jpeg", "infoid": 1069333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿拉斯加渔民沙丘兰卡德一生都在寻找大海——为了食物、工作和目的。 “我从五岁开始钓鱼，”来自铜河三角洲的土著团体 Athabaskan Eyak 社区的成员兰卡德说。 “除了海洋，我真的没有任何技能。”兰卡德出生于 1959 年，同年阿拉斯加成为一个州，他目睹了各种自然和人为灾难——包括原住民传统捕鱼生活方式的商品化——破坏了他的工业和家园。 “作为一名土著渔民，我已经看到了这一切，”他说。 1964 年，一场 9.2 级的大地震，恰如其分地称为 1964 年阿拉斯加大地震，引发了海啸，造成 130 多人死亡并摧毁了渔业。整整 25 年后，一艘埃克森瓦尔迪兹油轮撞上了威廉王子湾的布莱礁，将 1080 万加仑原油喷入大海。泄漏影响了 1,300 英里的水域和海岸线，其中大部分仍被认为正在恢复中。现在，阿拉斯加渔民正面临另一个紧迫的问题。阿拉斯加已经感受到气候变化的影响，因为变暖的海洋对磷虾、野生海带森林、鲑鱼和鸟类的生态系统造成了严重破坏。这是 1989 年石油泄漏造成的挥之不去的损失之上的全部。在埃克森美孚漏油事件之前，Sound 的春季鲱鱼运回国内的总量超过 200,000 吨。如今，每年仅返回 4,000 吨。兰卡德最近在连续几个糟糕的季节之后卖掉了他的捕鱼许可证。为了帮助减轻变暖水域的影响，兰卡德现在正在采用一种称为再生海洋养殖的方法，该方法涉及在小型水下花园中种植海藻和贝类。兰卡德曾经是一名商业渔民，现在主要养殖海带。 “阿拉斯加一直以提取为基础。我们是一个自然资源开采州，”Lankard 说。 “再生海洋农业所做的是创造一种新的再生经济，它基于保护、恢复和缓解，而不是更多的资源开采。”再生海洋养殖的新兴概念是由加拿大商业渔民转为海洋农民的 Bren Smith 提出并命名的。他认为海洋养殖是未来的新养殖模式。\n在 1990 年代离开白令海的商业渔船前往鲑鱼养殖场工作后，史密斯很快对养殖场固有的单一养殖感到沮丧。他说，水产养殖被吹捧为解决过度捕捞的方法，但同样具有破坏性。史密斯对渔业感到失望，开始寻找一种更可持续的海洋工作方式。他前往长岛海峡，那里有一项计划向 40 岁以下的年轻商业渔民出租贝类捕捞场。他租了 20 英亩的水域，自 2005 年以来，他一直在康涅狄格州的顶针岛海洋农场养殖牡蛎、贻贝和海带. 在那里，史密斯努力磨练他的可持续海洋养殖模式——他在他的詹姆斯·比尔德获奖回忆录《像鱼一样吃》中记录了这一旅程。 “海洋作为农业空间有什么独特之处？当你停下来问这个问题时，就变得很容易了，”史密斯说。 “海洋就像你为什么不种植不会游走也不需要喂食的东西？当你这样看海洋时，我们可以种植数百种贝类和数千种植物。这开辟了整个农业的前沿。”", "note_en": "For all his life, Alaskan fisherman Dune Lankard has looked to the sea—for food, work and purpose. “I started fishing when I was five,” says Lankard, a member of the Athabaskan Eyak community, an Indigenous group from the Copper River Delta. “I really don’t have any skills beyond the ocean.”\n    Born in 1959, the same year Alaska became a state, Lankard has witnessed various natural and man-made disasters—including the commoditization of Indigenous peoples’ traditional fishing way of life—that have disrupted his industry and homeland. “As an Indigenous fisherman, I’ve seen it all,” he says.\n  In 1964, a massive magnitude 9.2 earthquake, fittingly called the Great Alaska Earthquake of 1964, triggered a swell of tsunamis that killed more than 130 people and devastated fisheries. Exactly 25 years later, an Exxon Valdez oil tanker struck Bligh Reef in the Prince William Sound, spewing 10.8 million gallons of crude oil into the sea. The spill affected 1,300 miles of water and coastline, much of which is still considered to be in recovery.\n  Now, Alaskan fishermen are facing another urgent problem. Alaska is already feeling the effects of climate change, as the warming oceans have wreaked havoc on ecosystems of krill, wild kelp forests, salmon and birds. That’s all on top of the lingering losses caused by the 1989 oil spill. Before the Exxon spill, the Sound’s spring run of herring totalled more than 200,000 tons returning home. Today, there are only 4,000 tons returning annually. Lankard recently sold his fishing permit after several consecutive bad seasons.\n    To help mitigate the effects of warming waters, Lankard is now embracing an approach known as regenerative ocean farming, which involves growing seaweed and shellfish in small underwater gardens. Once a commercial fisherman, Lankard now mostly farms kelp.\n  “Alaska has always been based on extraction. We’re a natural resource extraction state,” says Lankard. “What regenerative ocean farming does is create a new regenerative economy that’s based on conservation, restoration and mitigation, as opposed to more extraction of resources.”\n  The burgeoning concept of regenerative ocean farming was developed and named by Bren Smith, a Canadian commercial fisherman turned ocean farmer. He believes ocean farming is the new farming model of the future.\n  After leaving commercial fishing boats in the Bering Sea in the 1990’s to work on salmon farms, Smith quickly grew disheartened by the farms’ inherent monoculture. Aquaculture was touted as a solution to overfishing, he says, yet was just as destructive.\n  Disillusioned by the fishing industry, Smith set out to find a more sustainable way to work with the seas. He made his way to Long Island Sound, where there was a program to lease shellfishing grounds to young commercial fishermen under 40. He leased 20 acres of water, where he’s been raising oysters, mussels and kelp on   Thimble Island Ocean Farm in Connecticut since 2005. There, Smith worked to hone his sustainable ocean farming model—a journey he chronicled in his James Beard Award-winning memoir,    Eat Like a Fish.\n  “What’s unique about the ocean as an agricultural space? When you stop and ask that question it becomes so easy,” says Smith. “The ocean’s like why don’t you grow things that don’t swim away and don’t have to feed? When you look at the ocean that way, there are hundreds of kinds of shellfish, and thousands of plants we can grow. That opens up a whole frontier of agriculture.”", "posttime": "2021-07-24 07:15:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变暖,warming,海洋", "title": "面对变暖的水域，渔民开始从事海洋养殖", "title_en": "Facing Warming Waters, Fishermen Are Taking Up Ocean Farming", "transed": 1, "url": "https://www.smithsonianmag.com/innovation/facing-warming-waters-fishermen-are-taking-up-ocean-farming-180978091/", "via": "", "real_tags": ["变暖", "warming", "海洋"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2003年4月20日面试面试官：现在进入面试环节，我们提出一个问题来测试你的创造性思维能力。不要想太多，只是应用日常常识，并描述你的推理过程。问题来了：为什么井盖是圆形的？费曼：他们不是。一些井盖是方形的。确实有圆形的，但我见过方形的，矩形的。采访者：但是单看圆的，为什么是圆的？费曼：如果我们只考虑圆形，那么它们的定义就是圆形。该语句是同义反复。采访者：我的意思是，为什么会有圆形的？圆形有什么特别的价值吗？费曼：是的。当它们覆盖的孔也是圆形时，使用圆形盖子。用圆盖盖住圆孔最简单。采访者：你能想到圆形封面的一个特性，让他们比方形封面更有优势吗？费曼：我们必须看看封面下是什么才能回答这个问题。盖子下面的孔是圆形的，因为圆柱体是抵抗周围地球压缩的最强形状。此外，“人孔”一词意味着一个足够大的通道，一个人爬下梯子的横截面大致是圆形的。因此，圆柱形管道是检修孔的自然形状。盖子只是覆盖圆柱体所需的形状。采访者：您认为存在安全问题吗？我的意思是，方盖不会掉进洞里伤到人吗？费曼：不太可能。方形盖有时用于预制拱顶，其中通道也是方形的。盖子比通道大，并位于沿整个周边支撑它的壁架上。盖子通常由实心金属制成并且非常重。让我们假设一个 2 英尺见方的开口和 1-1/2 英寸的壁架宽度。为了让它落入，您必须抬起盖子的一侧，然后将其旋转 30 度，以便盖子离开壁架，然后将盖子从重心之前的水平方向向上倾斜近 45 度会移动到足以让它落入。是的，有可能，但不太可能。被授权打开井盖的人员可以很容易地接受培训以安全地进行操作。运用工程常识，井盖的形状完全取决于它要盖住的开口的形状。采访者（烦恼）：请稍等；我必须和我的管理团队讨论一些事情。 （离开房间。）（10分钟后面试官回来） 面试官：我们建议你立即招聘到市场部。", "note_en": "April 20, 2003  interview   Interviewer: Now comes the part of the interview where we ask a question to test your creative thinking ability. Don’t think too hard about it, just apply everyday common sense, and describe your reasoning process.  Here’s the question: Why are manhole covers round?   Feynman: They’re not. Some manhole covers are square. It’s true that there are   round ones, but I’ve seen square ones, and rectangular ones.   Interviewer: But just considering the round ones, why are they round?   Feynman: If we are just considering the round ones, then they are round by definition. That statement is a tautology.   Interviewer: I mean, why are there round ones at all? Is there some particular value to having round ones?   Feynman: Yes. Round covers are used when the hole they are covering up is also round. It’s simplest to cover a round hole with a round cover.   Interviewer: Can you think of a property of round covers that gives them an advantage over square ones?   Feynman: We have to look at what is under the cover to answer that question. The hole below the cover is round because a cylinder is the strongest shape against the compression of the earth around it. Also, the term   manhole” implies a passage big enough for a man, and a human being climbing down a ladder is roughly circular in cross-section. So a cylindrical pipe is the natural shape for manholes. The covers are simply the shape needed to cover up a cylinder.   Interviewer: Do you believe there is a safety issue? I mean, couldn’t square covers fall into the hole and hurt someone?   Feynman: Not likely. Square covers are sometimes used on prefabricated vaults where the access passage is also square. The cover is larger than the passage, and sits on a ledge that supports it along the entire perimeter. The covers are usually made of solid metal and are very heavy. Let’s assume a two-foot square opening and a ledge width of 1-1/2 inches. In order to get it to fall in, you would have to lift one side of the cover, then rotate it 30 degrees so that the cover would clear the ledge, and then tilt the cover up nearly 45 degrees from horizontal before the center of gravity would shift enough for it to fall in. Yes, it’s possible, but very unlikely. The people authorized to open manhole covers could easily be trained to do it safely. Applying common engineering sense, the shape of a manhole cover is entirely determined by the shape of the opening it is intended to cover.   Interviewer (troubled): Excuse me a moment; I have to discuss something with my management team.  (Leaves room.)    (Interviewer returns after 10 minutes)    Interviewer: We are going to recommend you for immediate hiring into the marketing department.", "posttime": "2021-07-24 07:15:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,费曼,feynman,圆形", "title": "如果理查德·费曼 (Richard Feynman) 应聘微软 (2002)", "title_en": "If Richard Feynman applied for a job at Microsoft (2002)", "transed": 1, "url": "https://sellsbrothers.com/12395", "via": "", "real_tags": ["微软", "microsoft", "费曼", "feynman", "圆形"]}]