[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "$date-R Fri，2019年11月29日23:52:02+0100$perl-c星期五。周五下午。pm语法正常⋮$  日期-R Sat，2019年11月30日00:03:06+0100$perl-c星期五。周五下午语法错误。下午12点，周五下午9点。pm有编译错误。", "note_en": "$  date -R Fri, 29 Nov 2019 23:52:02 +0100$  perl -c friday.pm friday.pm syntax OK ⋮$  date -R Sat, 30 Nov 2019 00:03:06 +0100$  perl -c friday.pm syntax error at friday.pm line 12, at EOF friday.pm had compilation errors.", "posttime": "2022-02-17 13:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,星期五,code,下午", "title": "仅在星期五语法正确的Perl代码", "title_en": "Perl code that is syntactically correct only on Fridays", "transed": 1, "url": "https://github.com/jwilk/perl-friday", "via": "", "real_tags": ["代码", "星期五", "code", "下午"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下，在不进行任何硬件修改的情况下，使用库存3d打印机3d打印多色对象的可能性。这似乎是一个白日梦，但我们今天在这里探索这一令人兴奋的发展。今天&#39；s的多色打印选项需要对机器硬件和软件进行许多修改。目前，生产多色3d打印对象需要多个打印头/工具更换、手动线轴更换或自动灯丝拼接机。Autodrop3d和#39；s的解决方案允许软件控制的颜色变化与股票3d打印机无需硬件修改。\n热致变色材料具有与颜色和热量有关的特殊性质。你以前可能见过情绪戒指。这是一种具有热致变色特性的材料。随着材料温度的改变，颜色也随之改变。这种热致变色材料在3d打印中没有用处，因为它只是根据当前温度改变颜色。\nAutodrop3d正在寻找灯丝制造合作伙伴，将这项正在申请专利的技术商业化。请联系我们讨论授权事宜。\nAutodrop3d正在申请专利的多色打印方法的神奇之处在于通过改变打印温度来设置材料颜色。有一些热致变色材料允许以稳定的方式设置颜色，允许在材料加热超过特定设定点后持续改变颜色。这种特性的一个例子可以在可擦除笔产品中看到。可擦笔利用摩擦产生的热量使墨水透明。要使墨水再次可见，只需将纸张冻结，墨水的颜色就会恢复。  ​ 我们使用的热致变色材料有两种温度，它们会触发颜色变化。一个温度低于冰点，另一个温度在所用特定塑料的可打印温度范围内。这使得仅通过改变热端的温度就可以打印材料并选择性地改变打印部分的颜色。\n使用打印温度定义的颜色打印的多色对象，无需修改机器硬件。\nAutodrop3d的迈克·莫利纳里（Mike Molinari）正在调查多色3d打印的状态，并寻找一种在库存FDM打印机上轻松生成多色打印的方法。在寻找并发现市场上无需额外挤出机、长丝拼接机、手动更换长丝或伺服驱动永久标记机即可运行的良好选项后。FDM机器上的打印头温度在打印过程中可能会发生变化，并且存在可以通过加热改变颜色的材料。经过多次实验，迈克能够将变色材料混合到塑料聚合物中，以证明其可行性。将变色材料混合到塑料聚合物中是容易的部分，但挤出长丝是一个复杂的工艺，最好留给专家。制造灯丝既是一门艺术，也是一门科学，它根据材料直径的实时测量来控制速度、温度、张力、冷却和主动调谐。我们联系了youtube上有名的3d打印能手乔尔，看看他是否愿意尝试将我们的塑料挤出长丝机。乔尔有了一个更好的想法，并能够将我们与Proto意大利面公司的专家联系起来，将这一概念变为现实。点击这里观看视频，记录生产冒险和第一次概念验证的结果。\n下面的结果显示了模型的两个部分打印了两种不同温度的对象。正如你所看到的，虽然透明部分和有色部分之间的对比度不是很高，但只需要测试不同比例的颜色添加剂。", "note_en": "Imagine the possibilities for 3d printing multi-color objects using a stock 3d printer with no hardware modifications whatsoever. This might seem like a pipe dream but we are here today to explore this exciting development.   Today&#39;s options for multi-color printing require many modifications to machine hardware and software. Multiple print-heads / tool changes, manual human spool swaps or automated filament splicing machines are currently required to produce multi-color 3d printed objects.  Autodrop3d&#39;s solution allows for software controlled color changes with stock 3d printers requiring no hardware modifications.\n  Thermochromatic materials have special properties related to color and heat.  You might have seen mood rings before. That is an example of a material with thermochromatic properties. As the temperature of the material is changed the color is altered. This kind of thermochromatic material is not useful in 3d printing as it simply changes color based on the current temperature.\n  Autodrop3d is looking for filament manufacturing partners to commercialize this patent pending technology. Please reach out discuss licencing.\n   The magic of Autodrop3d patent pending approach to multi color printing is the ability to set the material color by altering the print temperature.   There are some thermochromatic materials that allow for the color to be set in a stable way allowing for a persistent change in color after the material is heated beyond a particular set point. An example of this property can be seen in erasable pen products. Erasable pens use heat generated by friction to make the ink transparent. To make the ink visible again all one has to do is freeze the paper and the color will be restored to the ink.  ​ The thermochromatic materials we are using have two temperatures that trigger a color change. One is below freezing and the other is within the printable temperature of the particular plastic being used. This makes it possible to print the material and selectively change the color of portions of the print just by changing the temperature of the hot end.\n   Multi color object printed with color defined by print temperature with no machine hardware modifications.\n   Mike Molinari with Autodrop3d was investigating the state of multi-color 3d printing and looking for a way to easily produce multi color prints on stock FDM printers. After looking and finding no good options available on the market that operated with out the need extra extruders, filament splicers, manual filament changes or servo driven permanent markers inspiration struck.  The print head temperature on FDM machines can be changed during the print and there exists materials that can have their color modified by heat.   After much experimentation Mike was able to blend the color changing material in to a plastic polymer to demonstrate viability. Blending the color changing material in to the plastic polymer was the easy part but extruding filament is a complicated craft best left to experts. Making filament is as much an art as it is a science controlling speed, temperatures, tension, cooling and active tuning based on real time measurements of material diameters.  We reached out to Joel, the 3d printing nerd of youtube fame to see if he might be willing to try pushing our plastic through a filament extruding machine. Joel had a better idea and was able to connect us with the experts at Proto-pasta to bring the concept to reality.  Click here to see  video documenting the manufacturing adventure and the results of the first proof of concept.\n    The results below show an object printed with 2 different temperatures for the 2 portions of the model. As you can see it worked and while the contrast between the transparent and colored portions is not very high it will only be a matter of testing different ratios of the color additive.", "posttime": "2022-02-17 13:31:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,可编程,programmable,颜色", "title": "可编程灯丝", "title_en": "Programmable Filament", "transed": 1, "url": "https://www.autodrop3d.com/programmable-filament.html", "via": "", "real_tags": ["编程", "可编程", "颜色"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：高频晶体管是毫米波通信和传感器系统的基本组成部分。石墨烯中载流子的高速率和迁移率为超高速IV族晶体管开辟了道路，其性能与III-V基半导体类似，甚至更好。然而，由于制造问题、相邻材料的影响和自热效应，高速石墨晶体管的发展受到阻碍。在这里，我们报道了一种在金刚石衬底上的石墨烯场效应晶体管（FET），对于500 nm的玛瑙长度，它的f_{max}$高达54 GHz。金刚石的高导热性提供了有效的热沉，其相对较高的光学声子能量提高了石墨烯通道中载流子的饱和速度。此外，我们还发现，在不同的栅长下，金刚石上的石墨烯场效应晶体管表现出优异的结垢性能。这些结果表明，采用金刚石技术的石墨烯场效应晶体管可以达到亚太赫兹频率性能。\n从Muhammad Asad [查看电子邮件] [V1]星期四，2021年6月17日11:46:43 UTC（3010 KB）[V2]星期日，2021年6月20日21:12:04 UTC（3007 KB）[V3]星期四，2021年12月30日20:41:58 UTC（1574 KB）\n书目工具代码；关于arXivLabs的数据相关论文arXivLabs是一个框架，允许合作者直接在我们的网站上开发和共享新的arXiv功能。\n与arXivLabs合作的个人和组织都接受了我们的开放、社区、卓越和用户数据隐私价值观。arXiv致力于这些价值观，只与遵守这些价值观的合作伙伴合作。\n对一个能为arXiv增值的项目有一个想法&#39；s社区？了解更多关于arXivLabs以及如何参与的信息。", "note_en": "Download PDF  Abstract: Transistors operating at high frequencies are the basic building blocks ofmillimeter-wave communication and sensor systems. The high velocity andmobility of carriers in graphene can open way for ultra-fast group IVtransistors with similar or even better performance than can be achieved withIII-V based semiconductors. However, the progress of high-speed graphenetransistors has been hampered due to fabrication issues, influence of adjacentmaterials, and self-heating effects. Here, we report a graphene field-effecttransistor (FET) on a diamond substrate, with a $f_{max}$ up to 54 GHz for agate length of 500 nm. The high thermal conductivity of diamond provides anefficient heat-sink, and its relatively high optical-phonon energy improvessaturation velocity of carriers in the graphene channel. Moreover, we show thatgraphene FETs on diamond, with different gate lengths, exhibit excellentscaling behavior. These results indicate that graphene FETs on diamondtechnology can reach sub-terahertz frequency performance.\n  From: Muhammad Asad [ view email]     [v1] Thu, 17 Jun 2021 11:46:43 UTC (3,010 KB)    [v2] Sun, 20 Jun 2021 21:12:04 UTC (3,007 KB)  [v3]Thu, 30 Dec 2021 20:41:58 UTC (1,574 KB)\n      Bibliographic Tools      Code &amp; Data      Related Papers       About arXivLabs   arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\n  Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\n  Have an idea for a project that will add value for arXiv&#39;s community?   Learn more about arXivLabs and   how to get involved.", "posttime": "2022-02-17 13:29:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金刚石,fet,晶体管", "title": "高频电子学用金刚石石墨烯场效应管（2021）", "title_en": "Graphene FET on diamond for high-frequency electronics (2021)", "transed": 1, "url": "https://arxiv.org/abs/2106.09412", "via": "", "real_tags": ["金刚石", "fet", "晶体管"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位超级明星投资者可能在Nubank等数字金融服务提供商身上看到了一种完全不同的机会。", "note_en": "The superstar investor may be seeing an entirely different kind of opportunity in digital financial service providers like Nubank.", "posttime": "2022-02-17 13:29:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "巴菲特,warren,buffett,投资者", "title": "沃伦·巴菲特（Warren Buffett）刚刚向一家加密友好型银行投资了10亿美元", "title_en": "Warren Buffett just invested $1B in a crypto-friendly bank", "transed": 1, "url": "https://fortune.com/2022/02/16/warren-buffett-invested-1-billion-crypto-bank/", "via": "", "real_tags": ["巴菲特", "warren", "buffett", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在Bishop Fox写了很多报道（这是当你破解所有东西时发生的事情）。这经常导致需要对某些文本进行编辑。我们有一个长期的政策，当你编辑文本时，唯一安全的方法就是使用黑条。有时，人们喜欢变得聪明，尝试其他一些编辑技术，比如模糊、旋转或像素化。但这是一个错误。\n今天，我们将重点介绍一种这样的技术——像素化，并将向您展示为什么这是一种不好、不好、不安全、肯定会泄露敏感数据的方法。为了说明原因，我编写了一个名为Unredacter的工具，它将经过编辑的像素化文本还原为未经编辑的形式。在现实世界中，有很多这样的例子可以用来编辑敏感信息，但我不想在这里指名道姓。观看我的视频，快速回顾从不使用像素编辑文本的重要性，以及我如何取消Jumpseclabs&#39；这是一个实时的挑战。\n因此，有一个名为Depix的现有工具，它试图通过一个非常聪明的过程来实现这一点，即在给定正确字体的De Bruijn序列的情况下，查找像素排列可能会导致某些像素化块。我非常喜欢这个工具的理论，但Jumpsec的一位研究人员指出，也许它在实践中没有你想要的那么好。在现实世界中的例子中，你很可能会得到一些微小的变化和噪音，这会让你的齿轮扭动。然后，他们向任何人发出了挑战，如果你能取消对以下图片的编辑，他们将提供奖励：\n算法非常简单；将图像分割为给定块大小的网格（上面的示例是8x8）。然后，对于每个块，将经过编辑的图像的颜色设置为相同区域原始图像的平均颜色。就是这样——每个块的滚动像素平均值。\n这种效果有点“涂抹”了每个块的图像信息。但是，尽管在这个过程中有些信息丢失了，但它绝对会大量泄露出去。我们将利用这些泄露的信息为自己谋利。\n值得注意的是，由于该算法非常简单，因此被广泛标准化。所以，不管你是在GiMP、Photoshop还是其他工具中进行编辑，编辑结果都是一样的。\n我认为，这些都是相当合理的假设，因为在现实场景中，攻击者可能会收到一份完整的报告，其中只有一份经过编辑。在我们的挑战文本中，你可以在像素文本的正上方看到一些单词，它们为我们提供了这些信息。\n我们关注的关键是编校过程本质上是局部的。在密码学方面，我们可以说它没有扩散。在原始图像的某个地方改变一个像素只会影响它所属的编辑块，这意味着我们可以（大部分）逐个字符地猜测图像。我们将对每个字符进行递归深度优先搜索，根据其与编辑文本的匹配程度对每个猜测进行评分。\n基本上，我们猜测字母“a”，对该字母进行像素化，然后查看它与我们编辑的图像的匹配程度。然后我们猜字母“b”，以此类推。听起来没那么难吧？嗯，还有一大堆后勤问题需要克服，这在一开始可能并不那么明显！让我们进一步深入研究这些问题。\n我们立即遇到的第一个问题是，文本中的字符与编辑块的比例不是1:1。这意味着一个给定的正确猜测可能在最右边有一些错误的块。要了解我的意思，请查看以下示例：\n可以看到字母“t”和“h”共享一列块。所以，如果我们试着猜测字母“t”，最左边的一列结果是正确的，但最右边的一列有点错误。\n第二栏是错误的，因为字母“h”把事情搞砸了。如果我们只看这一点，你可能会得出结论，字母“t”是一个不正确的第一个字母，因为它得到了几乎一半的区块完全错误。\n我们尝试的第一件事是避免计算任何猜测中最右边的区块。这是最容易出错的专栏。问题是，在实践中，它减少了我们猜测的总大小，以至于你开始收到误报。总是有机会，你的信会意外排队，并产生一个纯粹的机会比赛，这个机会走上去，当有更少的块考虑。\n因此，我们所做的是在字母本身的边界处切掉比较块。因此，我们的差异如下所示：\n你可以看到我们比赛的质量有了很大的提高，因为我们在右边的错误区域减少了。这是因为我们在“t”结束的边缘处切掉比较：\n这样做的好处是，我们的猜测字符越多地延伸到块中，块就越有可能是一个好的猜测，因此我们保留了更多的块。因此，当猜测错误时，它会自动切掉大部分块，当猜测正确时，它会保留大部分块。\n角色溢出问题的一个具体子集是，空白往往会打破我们对角色猜测工作原理的一些假设。这个问题的本质是这样一种假设：当我们猜到一个正确的角色时，我们期望得到的像素化版本的角色与挑战图像基本相似。\n然而，当我们猜测的字符是空白时，这并不总是正确的。当这种情况发生时，像素块将被下一个角色完全取代。举个例子，猜测“this is”（后面有空格）：\n然后将其像素化，如下图所示，后面有一个空白列：\n问题是，在解决方案图像中，空格后面还有另一个字符。它流了这么多血，以至于我们正确的猜测看起来是完全错误的！\n解决这个问题的方法不止一种。最明显的是永远不要自己猜测空格，而是将其与其他非空格字符配对。这样我们就可以控制流血的角色。虽然这种方法“有效”，但它有效地将可用字符集增加了一倍。这会让整个过程变得缓慢。\n相反，我们可以做的是为空白猜测做一个特殊的划分，让他们在被认为是“好”猜测的情况下更加宽容。在测试中，似乎溢出从未如此严重，以至于超过了一个较低的阈值。我承认这有点笨拙，但似乎管用。\n人们书写的大多数字体都是可变宽度的。这意味着每个字母占用的水平空间量取决于字母本身。例如，“w”比“i”占用更多空间。这与单空格字体形成对比，单空格字体故意将字母隔开，使每个字母占据相同的水平空间。\n这对我们的攻击（假定为可变宽度字体）意味着，每个猜测的字母在其右侧都有级联效应。如果你猜：\n然后，所有未来的字母都将关闭，即使这些字母在其他方面是“正确的”。\n这听起来很重要，但实际上并不是那么糟糕。这只是意味着我们必须坚持递归深度优先搜索，而不是将字母视为独立的工件。递归深度优先搜索在这里效果很好，因为它自然会考虑这种排序。它的工作原理如下：\n我们要做的是尝试下一个字母的每个字符，看看哪些字符与经过编辑的图像匹配得相当好。我们将得到一些“好”猜测的子集，可能是“p”和“q”，因为p是正确的，q与它非常相似。然后，我们将再次开始猜测新字符串“this is sup”的整个过程，直到我们遇到一个没有好猜测的死胡同。在这一点上，函数调用堆栈将自然备份，以尝试我们的另一个猜测q。\n等等，直到我们用尽所有的“好”猜测。\n碰巧的是，不同的渲染引擎生成的图像略有不同，即使是应该完全相同的字体。看看这两个相同文本的截图。顶部是GiMP的无衬线渲染，底部是FireFox：\n它们几乎一模一样，但并不完全相同。有两件事很突出；一是长度。你可以看到上面的图片只是稍微长一点。对于足够长的字符串，这可能会产生一种级联效应，将整个事情抛诸脑后。另一个区别是文本如何光栅化；底线只是比最上面的要大胆一点。我们可以通过调整亮度来处理这个问题，但这是一个非常痛苦的问题。\n对于Undeacter，我们使用Electron拍摄本地无头HTML窗口的屏幕截图。因此，渲染器基本上是Chrome。大多数时候，这不是问题。但是，如果你的编辑文本是使用一些不符合标准的非常不可靠的程序来呈现的，那么它可能会偏离正常的方向。记住这一点。\n如果有人想通过Rube Goldberg的包装器和宏机器为Unredacter编写一个包装器，使用MS Word生成猜测，欢迎您试一试。\n对图像进行像素化时，必须考虑两个自由度：x和y偏移坐标。但这些到底是什么？\n如果你认为这是一个静态网格，那么有64个不同的位置供你放置文本在该网格上。我们称之为x和y“偏移”。根据您选择的偏移量，它可以生成截然不同的图像：\n此外，攻击者无法知道这些偏移量是什么。（与字体和字号不同）。在大多数编辑器（如GiMP）中，偏移量是由用户在创建边界框时碰巧单击的位置的随机过程确定的。如果他们向上或向下点击一个像素，像素化会产生一个完全不同的图像！\n好消息是，补偿的可能性并不多。有块大小2的排列。如果块大小为8，则需要尝试64个偏移。在我们的挑战文本中，块大小是5，这意味着只有25个偏移需要测试。\n所以，Unredacter的第一步是发现使用了什么偏移量。我们通过在循环中尝试每个偏移量来实现这一点，并查看是否有任何字母给出了一个好的首字母猜测。我们将所有第一个字母猜测正确的偏移量添加到列表中，然后尝试正确的猜测。\n可以有了这些知识和利用这些知识的工具，我们再来看看Jumpsec的挑战图：\n你可能会注意到的第一件事是它有一点奇怪的颜色。有什么好处？既然文本是黑色的，就不应该是黑白的吗？他们在用彩色字母拖拽我们吗？\n实际上，我并不完全确定为什么会发生这种情况（有时不会），但当文本呈现到屏幕上时，这是光栅化过程的产物。只需看看放大记事本中键入的文本时会发生什么：\n当Undercater将字母渲染到无头Chrome窗口时，不会出现彩色瑕疵，因此我们需要将图像转换为灰度。这会丢失一些信息，但没关系。Unredacter不需要精确匹配，只需要猜测“基本正确”。一旦向下转换，我们的挑战图像如下所示：\n我必须做最后一个调整，它在最底层：\n太小了！其余的块是5x5，但最下面一行是5x3。经过几个小时的反复试验，我还注意到这些积木太暗了。查看字母“g”的猜测与挑战图：\n看到最下面一排怎么太暗了吗？这是因为当图像被像素化时，他们一定选择了一个大小不是5倍的边界框。因此，当算法确定平均值时，它是一个较小区域的平均值。（因此更暗）没关系，我们可以通过点亮最后一排来修复它。这给了我们最后一个挑战的形象：\n下一步是找出正确的字体和字号。幸运的是，这并不难，这张图片是在MS Notepad中拍摄的，默认字体为Consoleas。经过一点尝试和错误，我发现字体大小是24px。（我只是反复尝试字体大小，直到大写字母M的高度匹配。）唯一棘手的是，记事本的默认字母间距为-0.2px。如果你试着在控制台中用Chrome渲染文本，那就太长了。但是-0.2px的字母间距正好匹配。\n如果仔细观察，“s”、“e”和“c”在记事本的渲染中有更多的曲线。但没关系。再说一遍，我们不需要100%准确。很接近！\nUnredacter很快就以[3,1]的偏移量进驻，所以让我们看看它是如何做到的！\n所以我联系了Jumpsec的Caleb Herbert，他们确认了我的猜测是正确的！\nCaleb还要求我不要透露解决方案，所以你可以自己尝试一下。（上面的文字模糊了，你根本看不懂模糊的文字，对吧？）向Jumpsec发出了巨大的欢呼声，这是一个很大的挑战。也是测试新工具的好方法！\n如果你想查看Unredacter的概念验证源代码，可以在我们的GitHub上找到。\n底线是，当你需要编辑文本时，用黑条覆盖整个文本。别用别的东西。没有像素化，没有模糊，没有模糊，没有漩涡。哦，一定要把文本编辑成图像。不要错误地更改Word文档，使其具有黑色背景和黑色文本。（你仍然可以通过这样突出显示来阅读。）\n在制作一份优秀的技术文档之后，你最不需要做的事情就是由于不安全的编辑技术而意外地泄露敏感信息。\nDan Petro是Bishop Fox的首席研究员，专注于应用程序渗透测试（静态和动态）、产品安全审查、网络渗透测试（外部和内部）以及密码分析。Dan曾在多个黑帽子和DEF CONs上展示过黑客智能保险箱、劫持谷歌Chromecast和人工智能武器化等主题。他开发了几个开源工具，包括Untwister，它可以分解伪随机数生成器。此外，《连线》、《卫报》、《商业内幕》和《Mashable》都引用了丹的话。Dan拥有亚利桑那州立大学计算机科学学士和硕士学位。\n丹的更多", "note_en": "We write a lot of reports at Bishop Fox (it’s what happens when you hack all the things). This frequently results in needing to redact certain text. We have a long-standing policy that when you redact text, the  onlyway to do it securely is to use black bars. Sometimes, people like to be clever and try some other redaction techniques like blurring, swirling, or pixelation. But this is a mistake.\n Today, we’re focusing on one such technique – pixelation – and will show you why it’s a no-good, bad, insecure, surefire way to get your sensitive data leaked. To show you why, I wrote a tool called  Unredacter that takes redacted pixelized text and reverses it back into its unredacted form. There’s plenty of real-world examples of this in the wild to redact sensitive information, but I won’t name names here. Watch my video for a quick recap of the importance of NEVER using pixelation to redact text, as well as how I unredact Jumpseclabs&#39;s Challenge in real-time.\n  So there’s an  existing tool called Depix that tries to do exactly this through a really clever process of looking up what permutations of pixels could have resulted in certain pixelated blocks, given a  De Bruijn sequenceof the correct font. I like the theory of this tool a lot, but a  researcher at Jumpsec pointed out that perhaps it doesn’t work as well in practice as you’d like. In real-world examples you’re likely to get minor variations and noise that throws a wrench into the gears. They then issued a challenge to anyone, offering a prize if you could un-redact the following image:\n The algorithm is pretty simple; you divide up your image into a grid of a given block size (the example above is 8x8). Then for each block, you set the redacted image’s color equal to the average color of the original for that same area. That’s it – just a rolling pixel average for each block.\n  The effect sort of “smears” the information of the image out across each block. But while some information is lost in the process, it absolutely leaks plenty through. And it’s this leaked information that we’ll be using to our advantage.\n Notably, this algorithm is widely standardized since it’s so simple. So, no matter whether you do this redacting in GiMP, Photoshop, or basically any other tool, the redaction will turn out the same.\n   These are fairly reasonable assumptions, I would assert, since the attacker in a realistic scenario would likely have received a full report, with just one piece redacted out. In our challenge text, you can see a few words right above the pixelated text that give us this information.\n The key thing we’re focusing on is that the redaction process is inherently local. In cryptographic terms, we’d say it has  no diffusion. A change of one pixel somewhere in the original image ONLY impacts the redacted block it belongs to, meaning that we can (mostly) guess the image character by character. We’ll do a recursive depth-first search on each character, scoring each guess by how well it marginally matches up to the redacted text.\n Basically, we guess the letter “a”, pixelate that letter, and see how well it matches up to our redacted image. Then we guess the letter “b”, and so on. Doesn’t sound so hard, right? Well, there’s still a  bunch of logistical issues to overcome that might not be so obvious at first! Let’s dig into those further.\n  The first problem we immediately encountered is that the characters of our text don’t line up 1:1 with the blocks of the redaction. This means that a given correct guess might actually have some wrong blocks on the right-most edge. To see what I mean, check out this example:\n  You can see that the letters “t” and “h” share a column of blocks. So, if we try to make a guess for the letter “t”, the left-most column of blocks turns out correct, but the right-most ones are a bit wrong.\n   The reason the second column is wrong is because the letter “h” is there messing things up. If we just looked at this alone, you might conclude that the letter “t” was an incorrect first letter, since it gets almost half of the blocks totally wrong.\n The first thing we tried was to avoid counting the right-most block of any guess. It’s the column that will have the most bleed-over and can have quite a bit of error. The problem with this was that, in practice, it reduced the total size of our guess by so much that you start receiving false positives. There’s always a chance that your letter will accidentally line up and produce a match by pure chance, and this chance goes way up when there’s fewer blocks to consider.\n So instead, what we did was to chop off the comparison block at the boundary of the letter itself. Thus, our diff would look like this:\n  You can see the quality of our match went way up, since we’re including less of that incorrect area on the right. This is because we chop the comparison off at the edge of where the “t” ends:\n  The benefit to doing it this way is that the more our guess character extends into the block, the more likely the block is to be a good guess, and so we keep more of the block. So, it will automatically chop off most of the block when the guess is bad and keep most of the block when it’s good.\n A specific subset of the character bleed-over problem is that whitespace tends to break a few of our assumptions on how character guessing works. Inherent to this whole problem is the assumption that when we guess a correct character, we expect the resulting pixelated version of it to mostly resemble the challenge image.\n However, this isn’t always true when the character we guess is whitespace. When that happens, the pixelated blocks will be completely overtaken by the next character. Take this example, making the guess “this is ” (with a trailing space):\n  This is then pixelated like below, with a trailing blank column as you’d expect:\n  The problem is that in the solution image, there is another character after the space. It bleeds over so badly that our correct guess looks to be completely wrong!\n  There’s more than one way to tackle this problem. The most obvious is to never make whitespace guesses on its own, and instead pair it up with some other non-whitespace character. That way we can control the character that bleeds over. While this “works”, it effectively doubles the available character set. This slows the whole process down to a crawl.\n Instead, what we can do is make a special carveout for whitespace guesses that give them more leniency in what is considered a “good” guess. In testing, it seemed that the bleed-over is never so bad that it’s beyond a lower threshold. It’s a bit kludge-y, I’ll grant you, but it seems to work.\n Most fonts that people write with are variable width. This means that the amount of horizontal space that each letter takes depends on the letter itself. For instance, a “w” takes up more space than an “i”. This is in contrast to monospace fonts, which deliberately space letters such that each one takes up the same amount of horizontal space.\n      What this means for our attack (which is assumed to be in a variable-width font) is that each guessed letter has a cascading effect to the right of it. If you make the guess:\n  Then all future letters will be off, even if the letters are otherwise “correct”.\n This sounds like a big deal, but it’s actually not so bad. It just means that we have to stick with a recursive depth-first search and not treat letters like individual and independent artifacts. Recursive depth-first search works well here because it naturally takes that ordering into account. It works the following way:\n   What we do is try out each character for the next letter and see which ones match up reasonably well with the redacted image. We’ll wind up with some subset of “good” guesses, perhaps “p” and “q” since p is correct and q resembles it pretty closely. We’ll then begin this whole process of guessing again for the new string of “this is sup” down the chain until we hit a dead end with no good guesses. At which point, the function call stack will naturally back up to try our other guess q.\n And so on, until we’ve exhausted every “good” guess there is.\n As it happens, different rendering engines produce slightly different images even for what should be the exact same font. Look at these two captures of the same text. On top is GiMP’s rendering in Sans Serif and on bottom is FireFox:\n  They’re  almost identical, but not quite. There are two things that stand out; one is the length. You can see that the top image is just a LITTLE longer. For long enough strings, this can have a cascading effect that will throw the whole thing off. The other difference is how the text is rasterized; the bottom line is just a little bit bolder than the top one. This one we can mostly handle by adjusting for brightness, but it’s a total pain.\n For Unredacter, we’re using Electron to take screenshots of a local headless HTML window. So, the renderer will essentially be Chrome. Most of the time, this is not a problem. But if your redacted text was rendered using some really wonky program that doesn’t adhere to standards, then it might wind up veering off course quite a bit. Keep that in mind.\n If someone out there wants to write a wrapper for Unredacter that generates guesses using MS Word through some Rube Goldberg machine of wrappers and macros, you’re welcome to give it a go.\n When pixelating an image, there’s two degrees of freedom that have to be accounted for: the x and y offset coordinates. But what the heck are those?\n   If you think of this as a static grid, then there’s 64 distinct locations for you to place the text on that grid. We call this the x and y “offset”. Depending on the offset you choose, it can produce dramatically different images:\n   Furthermore, there’s no way for the attacker to know what these offsets were. (Unlike the font and font-size). The offset is determined in most editors like GiMP by the mostly random process of where the user happened to have clicked when making a bounding box. If they had clicked a single pixel up or down, the pixelation would have made a fairly different image!\n The good news here is that there’s not THAT many possibilities for offsets. There’s blocksize 2 permutations. For a block size of 8, that makes 64 offsets to try. In our challenge text, the block size is 5, meaning there’s only 25 offsets to test.\n  So, step one of Unredacter is to discover what offset was used. We do this by trying each offset in a loop and see if  ANY letter comes up with a good first-letter guess. We take all the offsets that have good first-letter guesses and add them to a list to then try proper guesses.\n Okay! Armed with this knowledge, and a tool to exploit it, let’s take a look at Jumpsec’s challenge image again:\n  One of the first things you might notice is that it has a curious bit of coloring in it. What gives? Shouldn’t it just be black and white since the text is black? Are they trolling us with colored letters?\n I’m actually not 100% sure why this happens (and sometimes doesn’t), but it’s an artifact of the rasterization process when text is rendered to screen. Just look at what happens when you zoom in to text typed out in Notepad:\n  When Unredacter renders the letters to a headless Chrome window, no colorized artifacts appear, so we’ll need to convert the image to greyscale. This will lose some information, but it’s fine. Unredacter doesn’t need exact matches, just for guesses to be “mostly right”. Once converted down, our challenge image looks like this:\n  There’s one last adjustment I had to make, and it’s on the bottom row:\n  It’s too small! The rest of the blocks are 5x5, but that bottom row is 5x3. After a few hours of trial and error, I also noticed that these blocks are too dark. Check out what a guess of the letter “g” looks like, versus the challenge image:\n   See how that bottom row is  way too dark? It’s because when the image was pixelated, they must have selected a bounding box that wasn’t a size with multiple of 5. So, when the algorithm determined the average, it was an average over a smaller area. (Thus darker) No matter, we can fix it up by just lightening that last row. This gives us our final challenge image of:\n  Next up is to figure out the correct font and font size. Luckily this wasn’t too hard, the image was taken in MS Notepad with the default font of Consolas. After a bit of trial and error, I found that the font size is 24px. (I did this by just trying font sizes over and over until the height of capital M matched up.) The only tricky part of this wound up being that Notepad apparently has a default letter-spacing of -0.2px. If you try rendering text in Chrome in Consolas, it’s much too long. But -0.2px letter-spacing matches up  exactly.\n   If you look closely, the “s”, “e”, and “c” has a little more of a curve in Notepad’s rendering. But it’s fine. Again, we don’t need to be 100% exact. This pretty close!\n Unredacter pretty quickly homes in on an offset of [3, 1], so let’s see how it does!\n       So I reached out to Caleb Herbert at Jumpsec, and they confirmed that my guess was correct!\n  Caleb also asked me to not disclose the solution, so you reading this can have a go at it yourself. (It’s blurred out above, and there’s no way you can read blurred text, right?) Huge shoutout to Jumpsec for issuing this challenge, it was a lot of fun. Was a great way to test out a new tool, too!\n If you want to check out the proof-of-concept source code to Unredacter, it’s  available on our GitHub right here.\n The bottom line is that when you need to redact text, use black bars covering the whole text. Never use anything else. No pixelization, no blurring, no fuzzing, no swirling. Oh, and be sure to actually edit the text as an image. Don’t make the mistake of changing your Word document so that it has black background with black text. (You can still read that just by highlighting  it like this.)\n The last thing you need after making a great technical document is to accidentally leak sensitive information because of an insecure redaction technique.\n  Dan Petro is a Lead Researcher at Bishop Fox and focuses on application penetration testing (static and dynamic), product security reviews, network penetration testing (external and internal), and cryptographic analysis. Dan has presented at several  Black Hats and DEF CONs on topics such as  hacking smart safes,  hijacking Google Chromecasts, and  weaponizing AI. He has developed several open-source tools including  Untwister, which breaks pseudorandom number generators. Additionally, Dan has been quoted in Wired, The Guardian, Business Insider, and Mashable. Dan holds both a Bachelor of Science and a Master of Science in Computer Science from  Arizona State University.\n More by Dan", "posttime": "2022-02-17 13:19:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文本,text,字母", "title": "不要使用文本像素来编辑敏感信息", "title_en": "Don't use text pixelation to redact sensitive information", "transed": 1, "url": "https://bishopfox.com/blog/unredacter-tool-never-pixelation", "via": "", "real_tags": ["文本", "text", "字母"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "按照官方文档安装zig，在macOS、Windows和Linux上，也可以通过pip3安装ziglang从PyPI安装zig\ncargo zigbuild支持在--target选项中传递libc版本，例如，使用AARC64未知linux gnu目标为glibc 2.17编译：\n目前只支持Linux目标，如果可以的话，可以添加其他目标平台，拉请求是受欢迎的。\n这项工作是根据麻省理工学院的许可证发布的。许可证文件中提供了许可证的副本。", "note_en": "Install  zig following the  official documentation,on macOS, Windows and Linux you can also install zig from PyPI via  pip3 install ziglang\n  cargo zigbuild supports passing libc version in  --target option, for example,to compile for glibc 2.17 with the  aarch64-unknown-linux-gnu target:\n   Currently only Linux targets are supported, other target platforms can be added if you can make it work,pull requests are welcome.\n    This work is released under the MIT license. A copy of the license is providedin the  LICENSE file.", "posttime": "2022-02-17 13:10:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,cargo,许可证", "title": "Cargo zigbuild：使用Zig作为链接器编译Cargo项目", "title_en": "Cargo-zigbuild: Compile Cargo project with Zig as linker", "transed": 1, "url": "https://github.com/messense/cargo-zigbuild", "via": "", "real_tags": ["编译", "cargo", "许可证"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "沙贾汗以建造泰姬陵的莫卧儿统治者而闻名。然而，他花费了印度更多的财富，建造了孔雀王座（1635年完工），意在与所罗门王座抗衡。王座的价值，也许是有史以来最珍贵的珠宝，也许可以通过知道给其中一只孔雀戴上王冠的是世界上最大的钻石之一——科希诺钻石来理解。然而，在当时，科希努尔甚至不被认为是王位上最令人印象深刻或最有价值的珠宝！\n1739年，德里被波斯强盗纳德·沙阿洗劫。沙阿用“700头大象、4000头骆驼和12000匹马”运走了数百年来积累的黄金、白银和以前的石头，包括孔雀王座。\n纳德将王位带回波斯，但他很快就疯了，变得越来越偏执和邪恶。他命令把自己的儿子弄瞎，把他的眼睛放在盘子里。由于担心类似的命运，他的一些阿富汗保镖向他发起攻击，将他斩首。但他的一位将军艾哈迈德·汗·阿卜杜利仍然忠诚，在暴力和抢劫中，他守卫着王室后宫。他得到了后宫第一夫人的奖赏，获得了科希诺尔钻石，并逃到了阿富汗。\n孔雀王座的其余部分被分散开来，随风飘散，尽管王座上其他两块著名的石头可以追溯到历史。Darya-i-Noor号最终成为了穆罕默德·雷扎·沙阿皇冠上的一部分，并留在了波斯。在革命前不久，我在父亲的陪伴下，在伊朗看到了他。这颗“大莫卧儿”钻石最终出现在阿姆斯特丹，由曾是凯瑟琳大帝情人的奥尔洛夫伯爵购买。为了回到她的床上，他把钻石送给了她，但最终只欠了她一笔债，被关进了精神病院。伟大的莫卧儿现在正在克里姆林宫展出。\n艾哈迈德·汗·阿卜杜勒在返回阿富汗的路上，从纳德·沙阿被斩首的混乱中逃脱，他遇到了一辆为纳德·沙阿准备的宝藏大篷车。他霸占了商队，利用商队的财富成为了杜拉尼帝国和现代阿富汗国的创始人。唉，艾哈迈德·汗因麻风病失去了鼻子，但他一直保留着钻石，直到钻石落入他的继承人帖木儿·沙阿手中，然后落入他的最终继承人沙阿·扎曼手中（经历了多次自相残杀的战争）。扎曼自己也被一根热针扎瞎了眼睛，“针尖很快就把他视线中的酒从他的眼睛杯子里洒了出来。”正如阿富汗历史学家米尔扎·塔塔诗意地说的那样。\n随着杜拉尼帝国的衰落，锡克帝国崛起，科希努尔人在兰吉特·辛格的领导下迁往拉合尔。然而，锡克教徒将旁遮普地区拱手让给了东印度公司，后者与少年国王杜莱普·辛格签署了一项和平协议，其中包括科希努尔作为贡品。杜莱普后来被流放到英国，在那里他将亲自把科希诺号交给他的赞助人维多利亚女王。\n维多利亚女王去世后，科希努尔号被纳入了英国的各种皇冠珠宝中，除了二战期间的一个时期，当时它被藏在池塘里。从上周开始，伊丽莎白女王宣布，当查尔斯成为国王时，科希诺将成为卡米拉女王皇冠上的珠宝。", "note_en": "Shah Jahan is best known as the Mughal ruler who built the Taj Mahal. He spent much more of India’s wealth, however, building the Peacock throne (completed 1635), meant to rival the throne of Solomon. The value of the throne, perhaps the most bejeweled object ever created, can perhaps be understood by knowing that crowning one of the peacocks was the Kohinoor, one of the world’s largest diamonds. At the time, however, the Kohinoor wasn’t even considered the most impressive or valuable jewel in the throne!\n Delhi was sacked by the Persian brigand Nader Shah in 1739. With ‘700 elephants, 4,000 camel and 12,000 horses’ Shah carted off hundreds of years of accumulated gold, silver and previous stones including the Peacock throne.\n Nader brought the throne back to Persia but he soon went mad becoming ever more paranoid and vicious. He ordered his own son blinded and the eyes brought to him on a platter. Fearing a similar fate, some of his Afghan bodyguards turned on him and beheaded him. But one of his generals, Ahmad Khan Abdali, remained loyal, and amidst the violence and looting stood guard over the royal harem. He was rewarded by the first lady of the harem with the Kohinoor diamond and escaped to Afghanistan.\n The rest of the Peacock throne was disbanded and disbursed to the winds although two of the other celebrated stones from the throne can be tracked through history. The Darya-i-Noor stayed in Persia were it eventually became part of the crown jewels of Mohammad Reza Shah, which as a child accompanied by my father I saw in Iran shortly before the revolution. The “Great Mughal” diamond eventually showed up in Amsterdam where it was bought by Count Orlov, the once-lover of Catherine the Great. Hoping to get back into her bed, he gifted her with the diamond but ended up only in debt and confined to a mental asylum. The Great Mughal is now on show in the Kremlin.\n On his way back to Afghanistan, Ahmad Khan Abdali, who had escaped from the chaos of Nader Shah’s beheading, ran across a treasure caravan intended for Nader Shah. Commandeering the caravan he used its wealth to become the founder of the Durrani empire and the modern state of Afghanistan. Alas Ahmad Khan lost his nose to leprosy but kept the diamond until it fell to his heir, Timur Shah and then to his eventual heir (after much internecine warfare) Shah Zaman. Zaman was himself blinded with a hot needle “The point quickly spilled the wine of his sight from the cup of his eyes.” as Afghan historian Mirza ‘Ata put it poetically.\n As the Durrani empire fell, the Sikh empire rose and the Kohinoor moved to Lahore under Ranjit Singh. The Sikhs, however, lost the Punjab to the East India Company who signed a peace deal with the boy king, Duleep Singh, which included the Kohinoor as tribute. Duleep would later be exiled to England where he would personally hand the Kohinoor over to his patron Queen Victoria.\n After Queen Victoria’s death the Kohinoor was incorporated into various of the British crown jewels, excepting one period during World War II when it was hidden in a pond. As of last week, Queen Elizabeth announced that when Charles becomes King the Kohinoor will become part of the crown jewels of Queen Consort Camilla.", "posttime": "2022-02-17 13:08:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "王冠,wears,钻石", "title": "沉重戴着王冠和头巾", "title_en": "Heavy Wears the Crown and the Kohinoor", "transed": 1, "url": "https://marginalrevolution.com/marginalrevolution/2022/02/heavy-wears-the-crown-and-the-kohinoor.html", "via": "", "real_tags": ["王冠", "wears", "钻石"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Unikernels是使用库操作系统——维基百科——构建的专门的单地址空间机器映像\nUnikernels承诺在启动和运行时使用轻量级、安全、简约的图像。它们假定在安全的虚拟机监控程序中运行，因此可以消除现代操作系统的许多复杂性。主要有两种方法：\n剥离，即简化现有内核以减少其开销并删除不必要的功能\n尽管在2015-2016年前后有很多炒作，但unikernels没有&#39；不要像容器或库伯内特那样大受欢迎。\n作为虚拟机运行意味着应用程序可以&#39；不要像在Linux容器中那样共享一些资源（未使用的RAM）\n安全性单内核最有力的理由之一是减少了攻击面。而那&#39；这很难反驳，同样的方法会使调试更加困难。类似于从容器内部调试从头开始的容器。虽然这可以通过在调试和监视工具中烘焙来缓解，但这与整个想法背道而驰。\n轻量级是unikernels的另一个有力论据：低开销和小内存占用。另一方面，你需要为你的虚拟机分配一定数量的资源，这可以&#39；不能像Linux容器一样与其他应用程序共享。因此，您可能无法像使用容器那样进行扁平封装。\n性能虽然没有系统调用切换开销的简单内核确实提高了某些操作的性能，但它&#39；目前还不清楚这在多大程度上适用于系统调用不适用的应用程序&#39；t瓶。此外，高性能是有代价的，因此对于一部分应用程序来说，这只是一个可接受的折衷方案。\n调试/监控随着eBPF的出现，内核的可视性显著提高，因此标准也提高了。Unikernels需要为大规模采用提供一个可行的替代方案。\n调度容器现在有几个用于调度的选项（Kubernetes、Nomad等）。使用类似OpenStack的东西调度虚拟机需要进行大量改进，才能达到特定于容器的解决方案所提供的易用性/速度水平。这可以通过鞭炮之类的东西来缓解，这些东西可以与库伯内特斯结合，但是这些天堂&#39；我也不太受欢迎。\n兼容性容器对现有软件进行打包，并在未归档的情况下运行。Unikernels需要与应用程序一起编译内核。有一些解决方案可以生成用于调试的Linux二进制文件和用于生产的内核映像。保持单内核（大部分）Linux兼容是可能的，但需要一些胶水。\n目前，我能找到的仅有两种商业支持是Unikraft和NanoOS。如果你&#39；如果你想学习自己制作，可以去看看圣安德鲁斯大学（St Andrews university）教过的StardustOS，它为Xen提供了一个最小的内核&#39；很容易浏览。", "note_en": "Unikernels are specialised, single address space machine images constructed by using library operating systems --  Wikipedia\n Unikernels promise lightweight, secure, minimalistic image to boot and run. They assume being run in a secure hypervisor, so can do away with a lot of complexity of a modern OS. There are two main approaches:\n strip-down, where an existing kernel is simplified to reduce its overhead and remove unnecessary features\n   Despite a lot of hype around  2015-2016, the unikernels didn&#39;t blow up in popularity the way that containers or Kubernetes did.\n  running as VMs means applications can&#39;t share some resources (unused RAM) like they can in Linux containers\n  Security one of the strongest arguments for a unikernel is the reduced attack surface. While that&#39;s difficult to argue with, that same approach makes for more difficult debugging. Similar to debugging a FROM SCRATCH container from inside the container. While this can be alleviated by baking in debugging and monitoring tools, this goes against the whole idea.\n Lightweight another strong argument for unikernels: low overhead and small memory footprint. The flip side, is that you will need to allocate a certain amount of resources for your VM, that can&#39;t be shared with other applications like they can with Linux containers. So you might not be able to flatpack as much as you can with containers.\n Performance while a simple kernel without the overhead of syscall switch does increase the  performance of some operations, it&#39;s not clear how well that applies to applications for which the syscalls aren&#39;t bottlecks. Besides, the high performance comes at a cost, so will only be an acceptable tradeoff for a subset of applications.\n Debugging/Monitoring with the advent of eBPF, the visibility into the kernel has increased dramatically, so the standard have risen. Unikernels would need to provide a viable alternative for massive adoption to happen.\n Scheduling containers now have a few options for scheduling ( Kubernetes,  Nomad, etc). Scheduling VMs with something like OpenStack would require a lot of improvement to get to the level of ease/speed that the container-specific solutions provide. This could be alleviated with things like  Firecracker that can integrate with Kubernetes, but these haven&#39;t exactly blown up in popularity either.\n Compatibility containers package existing software and run it unchaged. Unikernels require compiling the kernel together with the application. There are some solutions that can produce a Linux binary for debugging and a kernel image for production. Keeping your unikernel (mostly) Linux-compatible  is possible, but requires some glue.\n Currently, the only two with commercial support I could find are  Unikraft and  NanoOS. If you&#39;re looking to learn to make your own, check out  StardustOS used to teach at St Andrews university, which includes a  minimal kernel for Xen that&#39;s easy to browse through.", "posttime": "2022-02-17 12:57:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "单核,unikernels,容器", "title": "单核", "title_en": "Unikernels", "transed": 1, "url": "https://github.com/seeker89/unikernels", "via": "", "real_tags": ["单核", "容器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我认为这则广告是大卫·奥美多年前为奥美公司写的一则宣传广告；马瑟是&#34的杰出代表；多说多卖&#34; 非常可信。非常可信。\n我忽略了一些原始格式（最初是4列宽）。如果你&#39；I’我想看看原始格式，只需点击这里。\n大卫•奥美•奥美；马瑟创造了价值超过1480000000美元的广告，并花费4900000美元跟踪结果。\n在这里，我们所学到的38件事，都是简明扼要的教条主义。\n1.最重要的决定。我们已经了解到，你的广告对你的销售的影响更多地取决于这个决定，而不是任何其他决定：你应该如何定位你的产品？\n你应该把DOVE定位为一款针对干性皮肤的产品，还是一款能让双手真正干净的产品？\n你的宣传活动的结果与其说取决于我们如何撰写你的广告，不如说取决于你的产品如何定位。因此，定位应该在广告创建之前确定。\n2.大承诺。第二个最重要的决定是：你应该向客户承诺什么？承诺不是一种主张，不是一个主题，也不是一句口号。这对消费者有利。\n承诺一个独特且有竞争力的利益是值得的。产品必须提供您承诺的好处。\n3.品牌形象。每一个广告都应该有助于塑造一个复杂的符号，即品牌形象。95%的广告是临时制作的。大多数产品在一年到另一年之间缺乏一致的形象。\n致力于为其品牌打造最鲜明个性的制造商获得了最大的市场份额。\n4.好主意。除非你的广告是建立在一个大的想法上，否则它会像船一样在夜间通过。\n要想让消费者从冷漠中解脱出来，需要有一个好主意，让他注意到你的广告，记住它，并采取行动。\n大的想法通常是简单的想法。伟大的通用汽车发明家查尔斯·凯特林说：&#34；这个问题一旦解决，就会变得简单&#34;\n大而简单的想法并不容易获得。他们需要天才和夜班。一个真正大的可以持续20年，就像我们的海瑟薇衬衫眼罩一样。\n5.头等舱的票。给大多数产品一个质量的形象一张头等票是值得的。\n奥美；马瑟在为佩佩里奇、海瑟薇、梅赛德斯-奔驰、施韦普斯、多夫和其他公司做这件事上取得了显著的成功。\n如果你的广告看起来很难看，消费者会认为你的产品是劣质的，他们也不太可能购买。\n6.唐和#39；别让人厌烦。从来没有人厌倦购买产品。然而，大多数广告都是非个人的、超然的、冷漠的、乏味的。\n像人一样和她说话。迷住她。让她饿。让她参加。\n7.创新。开始潮流而不是追随潮流。追随时尚潮流或模仿时尚的广告很少成功\n创新、创新是值得的。但创新是有风险的，除非你与消费者预先测试你的创新。三思而后行。\n8.对奖励持怀疑态度。对创意奖项的追求会诱使创意人士放弃对销售的追求。\n在奥美；马瑟：我们现在为这项对销售贡献最大的活动颁发年度奖。\n成功的广告销售产品时不会引起人们的注意。它吸引了消费者#39；让我们关注产品\n9.心理细分。任何一家好的机构都知道如何为男性、幼儿、南方农民等市场的人口细分市场定位产品。\n但是奥美；马瑟了解到，为市场的心理细分市场定位产品通常是值得的。\n我们的梅赛德斯-奔驰广告定位于迎合嘲笑&#34；身份符号&#34；拒绝轻浮的势利诉求。\n10.唐和#39；不要隐瞒新闻。当一个产品是新的时，比在其生命中的任何其他时刻都更容易让消费者感兴趣。许多文案撰稿人有隐藏新闻的致命本能。这就是为什么大多数新产品的广告未能利用真正的新闻所提供的机会。\n11.全力以赴。大多数广告活动都太复杂了。它们反映了一长串的营销目标。他们接受了太多高管的不同观点。尝试太多，他们一事无成。\n把你的策略归结为一个简单的承诺，然后全力以赴地履行这个承诺是值得的。\n无论是名人还是真人都可能有效。但要避免那些名气与你的产品或顾客没有天然联系的无关紧要的名人。无关紧要的名人会从你的产品中窃取注意力。\n这种技术在销售业绩中一直高于平均水平，现在仍然如此。但是唐&#39；不要使用它，除非你能做到不作弊；消费者不是&#39；她不是白痴，她是你的妻子。\n14.视觉演示。如果他们诚实，视觉演示在市场上通常是有效的。\n想象你的承诺是值得的。这样可以节省时间。它将承诺带回家。这是值得纪念的。\n15.生活的一部分。这些小剧很老套，大多数文案作者都讨厌它们。但他们已经卖出了很多商品，而且还在销售。\n16.避免漏字。让你的照片讲述故事。你所展示的比你所说的更重要。\n许多商业广告让观众淹没在滔滔不绝的文字中。我们称之为漏液（与腹泻押韵）。\n18.音乐背景。大多数商业广告使用音乐背景。然而，一般来说，音乐背景会减少你对广告的回忆。很少有创造性的人接受这一点。\n但我们从未听说过一家机构在新的业务演示中使用音乐背景。\n19.站起来。如果能以直截了当的诚实态度进行，那么站立式演讲是有效的。\n20.奇点的毛刺。现在，普通消费者每年看到2万个商业广告；可怜的亲爱的。\n给你的商业广告一个奇点的繁荣，一个会粘在消费者身上的毛刺#39；这是我的想法。一个这样的毛刺是记忆装置，或相关的符号，就像我们的帝国人造黄油广告中的皇冠。\n21.动画与娱乐；卡通片不到5%的电视广告使用卡通或动画。它们没有直播广告那么有说服力。\n消费者无法认同漫画中的角色。而漫画也不会让人相信。\n然而，我们在洛杉矶的合作伙伴Carson/Roberts告诉我们，当你和孩子们交谈时，动画会很有帮助。\n测试发现的故障可以纠正。我们只需重新编辑一则广告，它的效果就翻了一番\n然而，奥美；马瑟做了一些情绪化的广告，在市场上很成功。其中包括我们为Maxwell House Coffee和Hershey&#39；这是牛奶巧克力。\n24.抓取者。我们发现，与悄悄开始的商业广告相比，具有激动人心的开场白的商业广告对观众的吸引力更高。\n25.标题。平均而言，阅读标题的人数是阅读正文的五倍\n如果你不&#39；Don’不要在标题中销售产品，你浪费了80%的钱。这就是为什么大多数奥美；马瑟的头条新闻包括品牌名称和承诺。\n26.在头条新闻中受益。承诺有好处的头条新闻比没有好处的头条新闻卖得多&#39；T\n27.头条新闻。一次又一次，我们发现在头条新闻中注入真实的新闻是值得的。\n消费者总是在寻找新产品，或旧产品的新改进，或使用旧产品的新方法。\n28.简单的标题。你的标题应该用简单的语言传达你想说的话。读者不会停下来解读晦涩难懂的标题的含义。\n29.标题中有多少个单词？在一家大型百货公司的合作下进行的标题测试中，发现十个单词或更长的标题比短标题卖得更多。\n&#34;以每小时60英里的速度行驶，这辆新劳斯莱斯车上最大的噪音来自电子钟&#34;\n30.将标题本地化。在本地广告中，在标题中加入城市名称是值得的。\n31.选择你的潜在客户。当你为一个只被某个特殊群体消费的产品做广告时，它会给&#34；国旗和#34；你标题中的那个群体——母亲、尿床者、去欧洲？\n32.是的，人们阅读长文本。读者人数在50字以内迅速减少，但在50至500字之间几乎没有减少。（本页包含1909个单词，您正在阅读。）\n奥美；马瑟使用了长期复制，在梅赛德斯-奔驰、塞斯纳引证、美林和壳牌汽油公司取得了显著成功。\n33.图片中的故事吸引力。奥美；马瑟通过拍摄一个故事的照片获得了显著的结果。读者瞥了一眼照片，问自己：“34；这是怎么回事&#34; 然后，他看了看复印件。\n哈罗德·鲁道夫称这种神奇元素为#34；故事的吸引力&#34; 你在照片中注入的信息越多，人们看到你的广告的人就越多。\n34.前&amp；之后广告前后的注意力值略高于平均水平。\n35.照片与艺术品。奥美；马瑟发现照片几乎总是比画画更有效。\n它们吸引了更多的读者，产生了更多的吸引力，更可信，更容易记住，吸引了更多的优惠券，销售了更多的商品。\n36.使用标题进行销售。平均而言，阅读照片下标题的人数是阅读正文的两倍。\n因此，在使用照片时，必须在照片下方加上说明；每一个标题都应该是产品的微型广告，包括品牌名称和承诺。\n37.编辑版面。奥美；马瑟在编辑布局方面比在编辑方面更成功&#34;阿迪和#34；布局。\n38.重复你的赢家。许多伟大的广告在开始盈利之前就被丢弃了。\n奥美；马瑟在食品、旅游目的地、专利药品、儿童和#39；s产品和其他分类。", "note_en": "I thought this advertisement, written by David Ogilvy many years ago as a promotional advertisement for Ogilvy &amp; Mather was a brilliantcase of &#34;tell more sell more.&#34; Very believable. Very credible.\n I have ignored some of the original format (it was originally 4 columns wide). If you&#39;d like to see the original format, just  click here.\n  by David Ogilvy Ogilvy &amp; Mather has created over $1,480,000,000 worth of advertising, and spent $4,900,000 tracking the results.\n Here, with all the dogmatism of brevity, are 38 of the things we have learned.\n 1. The most important decision. We have learned that the effect of your advertising on your sales depends more on this decision than on any other:  How should you position your product?\n  Should you position DOVE as a product for dry skin or as a product which gets hands really clean?\n The results of your campaign depend less on how we write your advertising than on how your product is positioned. It follows that positioning should be decided before the advertising is created.\n  2. Large promise. The second most important decision is this: what should you promise the customer? A promise is not a claim, or a theme, or a slogan. It is a  benefit for the consumer.\n It pays to promise a benefit which is unique and competitive. And the product must deliver the benefit you promise.\n   3. Brand image. Every advertisement should contribute to the complex symbol which is the brand image. Ninety-five percent of all advertising is created  ad hoc. Most products lack any consistent image from one year to another.\n The manufacturer who dedicates his advertising to building the most sharply defined personality for his brand gets the largest share of the market.\n 4. Big ideas. Unless your advertising is built on a BIG IDEA it will pass like a ship in the night.\n It takes a BIG IDEA to jolt the consumer out of his indifferenceto make him  notice your advertising,  remember it and  take action.\n Big ideas are usually simple ideas. Said Charles Kettering, the great General Motors inventor: &#34;This problem, when solved, will be simple.&#34;\n BIG SIMPLE IDEAS are not easy to come by. They require geniusand midnight oil. A truly big one can be continued for twenty yearslike our Eye patch for Hathaway shirts.\n 5. A first-class ticket. It pays to give most products an image of qualitya first-class ticket.\n Ogilvy &amp; Mather has been conspicuously successful in doing thisfor Pepperidge, Hathaway, Mercedes-Benz, Schweppes, Dove and others.\n If your advertising looks ugly, consumers will conclude that your product is shoddy, and they will be less likely to buy it.\n 6. Don&#39;t be a bore. Nobody was ever  bored into buying a product. Yet most advertising is impersonal, detached, coldand dull.\n  Talk to her like a human being. Charm her. Make her hungry. Get her to participate.\n 7. Innovate. Start trendsinstead of following them. Advertising which follows a fashionable fad, or is imitative, is seldom successful\n It pays to  innovate, to blaze new trails. But innovation is risky unless you pre-test your innovation with consumers. Look before you leap.\n 8. Be suspicious of awards. The pursuit of creative awards seduces creative people from the pursuit of sales.\n  At Ogilvy &amp; Mather we now give an annual award for the campaign which contributes the most to  sales.\n Successful advertising sells the product without drawing attention to itself. It rivets the consumer&#39;s attention on the  product\n  9. Psychological segmentation. Any good agency knows how to position products for  demographic segments of the marketfor men, for young children, for farmers in the South, etc.\n But Ogilvy &amp; Mather has learned that it often pays to position products for  psychological segments of the market.\n Our Mercedes-Benz advertising is positioned to fit nonconformists who scoff at &#34;status symbols&#34; and reject flimflam appeals to snobbery.\n 10. Don&#39;t bury news. It is easier to interest the consumer in a product when it is  new than at any other point in its life. Many copywriters have a fatal instinct for burying news. This is why most advertising for new products fails to exploit the opportunity that genuine news provides.\n  11. Go the whole hog. Most advertising campaigns are too complicated. They reflect a long list of marketing objectives. They embrace the divergent views of too many executives. By attempting too many things, they achieve nothing.\n It pays to boil down your strategy to one simple promiseand go the whole hog in delivering that promise.\n   Either celebrities or real people can be effective. But avoid  irrelevant celebrities whose fame has no natural connection with your product or your customers. Irrelevant celebrities steal attention from your product.\n    This technique has always been above average in sales results, and it still is. But don&#39;t use it unless you can do so  without cheating; the consumer isn&#39;t a moron, she is your wife.\n 14. Visual demonstrations. If they are honest, visual demonstrations are generally effective in the marketplace.\n It pays to  visualize your promise. It saves time. It drives the promise home. It is memorable.\n 15. Slice of life. These playlets are corny, and most copywriters detest them. But they have sold a lot of merchandise, and are still selling.\n 16. Avoid logorrhea. Make your  pictures tell the story. What you show is more important than what you say.\n Many commercials drown the viewer in a torrent of words. We call that logorrhea (rhymes with diarrhoea).\n   18. Musical backgrounds. Most commercials use musical backgrounds. However, on the average, musical backgrounds reduce recall of your commercial. Very few creative people accept this.\n But we never heard of an agency using musical background under a new business presentation.\n 19. Stand-ups. The stand-up pitch can be effective, if it is delivered with straightforward honesty.\n 20. Burr of singularity. The average consumer now sees 20,000 commercials a year; poor dear.\n  Give your commercials a flourish of singularity, a burr that will stick in the consumer&#39;s mind. One such burr is the MNEMONIC DEVICE, or relevant symbollike the crowns in our commercials for Imperial Margarine.\n 21. Animation &amp; cartoons. Less than five percent of television commercials use cartoons or animation. They are less persuasive than live commercials.\n The consumer cannot identify herself with the character in the cartoon. And cartoons do not invite belief.\n However, Carson/Roberts, our partners in Los Angeles, tell us that animation can be helpful when you are talking to children.\n   The faults revealed by the test can be corrected. We have doubled the effectiveness of a commercial simply by re-editing it\n  However, Ogilvy &amp; Mather has made some emotional commercials which have been successful in the marketplace. Among these are our campaigns for Maxwell House Coffee and Hershey&#39;s Milk Chocolate.\n 24. Grabbers. We have found that commercials with an exciting opening hold their audience at a higher level than commercials which begin quietly.\n  25. Headlines. On the average, five times as many people read the headline as read the body\n It follows that, if you don&#39;t sell the product in your headline, you have wasted 80 percent of your money. That is why most Ogilvy &amp; Mather headlines include the brand name and the promise.\n 26. Benefit in headlines. Headlines that promise a benefit sell more than those that don&#39;t.\n 27. News in headlines. Time after time, we have found that it pays to inject genuine  news into headlines.\n The consumer is always on the lookout for new products, or new improvements in an old product, or new ways to use an old product.\n  28. Simple headlines. Your headline should  telegraph what you want to sayin simple language. Readers do not stop to decipher the meaning of obscure headlines.\n 29. How many words in a headline? In headline tests conducted with the cooperation of a big department store, it was found that headlines of ten words or longer sold more goods than short headlines.\n    &#34;At 60 miles an hour, the loudest noise in this new Rolls-Royce comes from the electric clock.&#34;\n 30. Localize headlines. In Local advertising it pays to include the name of the city in your headline.\n 31. Select your prospects. When you advertise a product which is consumed only by a special group, it pays to &#34;flag&#34; that group in your headline -MOTHERS, BED-WETTERS, GOING TO EUROPE?\n 32. Yes, people read long copy. Readership falls off rapidly up to fifty words, but drops very little between fifty and five hundred words. (This page contains 1909 words, and you are reading it.)\n Ogilvy &amp; Mather has used long copywith notable successfor Mercedes-Benz, Cessna Citation, Merrill Lynch and Shell gasoline.\n  33. Story appeal in picture. Ogilvy &amp; Mather has gotten notable results with photographs which suggest a story. The reader glances at the photograph and asks himself, &#34;What goes on here?&#34; Then he reads the copy to find out.\n Harold Rudolph called this magic element &#34;story appeal.&#34; The more of it you inject into your photograph, the more people look at your advertisement.\n  34. Before &amp; after. Before and After advertisements are somewhat above average in attention value.\n  35. Photographs vs. artwork. Ogilvy &amp; Mather has found that photographs work belter than drawingsalmost invariably.\n They attract more readers, generate more appetite appeal, are more believable, are better remembered, pull more coupons, and sell more merchandise.\n 36. Use captions to sell. On the average, twice as many people read the captions under photographs as read the body copy.\n It follows that you should never use a photograph without putting a caption under it; and each caption should be a miniature advertisement for the productcomplete with brand name and promise.\n 37. Editorial layouts. Ogilvy &amp; Mather has had more success with editorial layouts than with. &#34;addy&#34; layouts.\n  38. Repeat your winners. Scores of great advertisements have been discarded before they have begun to pay off.\n    Ogilvy &amp; Mather has developed a separate and specialized body of knowledge on what makes for success in advertising  food products, tourist destinations, proprietary medicines, children&#39;s products and other classifications.", "posttime": "2022-02-17 12:42:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,销售,advertising", "title": "如何创造销售的广告", "title_en": "How to create advertising that sells", "transed": 1, "url": "http://lannigan.org/how_to_create_advertising_that_sells_david_ogilvy.htm", "via": "", "real_tags": ["广告", "销售"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在托管在线课程方面，开发人员不得不做出艰难的选择：要么选择Teachable或Thinkific等一体化解决方案，要么选择枯燥的设计、缺乏想象力的课程界面和严重的功能膨胀。或者，花6个月从头开始构建一个定制平台。\n我的新应用CourseKit提供了更好的选择。凭借其无头架构，CourseKit允许开发人员使用他们最喜欢的前端工具创建自己的课程网站，而无需为用户身份验证和分析等后端功能编写代码。\n在本文中，我将向您简要介绍CourseKit的工作原理，以及为什么您可能希望在下一个在线课程项目中使用它。\n首先，有点关于我。我是安东尼·戈尔，我已经做了大约10年的网络开发人员。\n我一直很喜欢与其他开发者分享我的知识，并在Vue上推出了我的第一个视频课程。2016年的js 2。\n从那以后，我发布了其他几门课程，并尝试了所有的课程托管选项，包括Udemy等市场和Teachable等一体式平台。\n不管我在哪里主持我的课程，总有一些我想做但我做不到的事情。所以去年我决定从头开始建立我自己的课程主持平台，并将我所有的课程迁移到它上。\n虽然我能够获得我想要的功能和设计，但这是一个疯狂的工作量，其中大部分都花在了后端的东西上，我真的不需要定制。\n这让我思考——如果把我做的东西拆分成一个产品，让其他开发人员不必重复同样的工作，该怎么办？\nCourseKit与其他自托管课程平台的主要区别在于CourseKit是一个无头平台。\n如果你不熟悉这种架构，这意味着该平台有一个后端CMS，你可以上传和配置你的内容，但没有提供前端网站。\n相反，您的内容可以通过安全的HTTP服务获得。这种架构允许你创建一个定制的前端，从而将你从平淡的设计和其他平台的用户体验中解放出来。\n我自己不是一个伟大的设计师，但这里有一个我用Nuxt和Tailwind构建的演示课程页面（当然，你可以使用任何你喜欢的前端技术堆栈）。\nCourseKit和Teachable、Thinkific等之间的另一个主要区别是它&#39；它不是“盒子里的企业”，也就是说，它没有像视频托管、电子邮件、支付网关等功能。\n与所有优秀的开发平台一样，CourseKit优化了灵活性和创造性，因此您可以通过自己的代码或已经使用的第三方提供商（例如Vimeo、ConvertKit和Stripe）来添加所需的功能，分别用于视频、电子邮件和支付。这些可以与易于设置的API集成相连接。\n稍后，我将更详细地解释CourseKit的功能。但是，如果你想直接尝试一下，你可以在这里留下你的详细信息来请求测试版的邀请：\n我已经解释了无头建筑。现在我们来看一下CourseKit提供的其他一些功能。\n如上所述，您可以通过在后端CMS中上传内容来创建课程。然后，您的课程站点可以通过API获取内容。\n一些你想公开的内容（例如，课程名称和课程名称等元数据），但你可能希望课程内容的内容是私有的。\nCourseKit API受OAuth保护，以确保只有注册学生才能访问任何私人内容。\n要提供对课程的访问，您可以通过仪表板手动注册学生，或使用CourseKit API。例如，学生用Gumroad或Stripe支付课程费用后，你可以设置一个webhook，将他们的电子邮件发送到所需的端点。\n现在你只需要在你的网站上弹出一个“登录”链接，就可以处理基于角色的访问了。\n为了方便创建课程网站，我提供了一个JavaScript客户端库，可以方便地连接API和其他方便的功能。\n下面是一个示例片段，展示了如何在课程上创建一个“完成并继续”按钮，该按钮允许用户同时标记当前课程完成并进入下一个课程。\nconst button=文档。查询选择器（&#39；#完成按钮&#39；）if（user.isAuthenticated（））{button.addEventListener（&#39；单击&#39；，async（）=&gt；{const success=wait-lesson.markComplete（）if（success）{const-nextLessonId=course.nextLessonId window.location.href=`/courses/${course.id}/lessons/${nextLessonId}}}\n要创建课程，您可以将降价文件上传到CourseKit仪表板。降价可以包含frontmatter变量，这样您就可以轻松地包含课程标题（公共值）或Vimeo ID（私有值）等元数据\n您的课程站点将在运行时从API获取内容，并动态呈现内容。以下是经过身份验证的用户在应用程序中的上述课程内容：\n.log（lesson）/*{meta:{title:&#39；pin收集简介&#39；，vimeoId:4893274923}内容：&#39&书信电报；p&gt；嘿，笨蛋，欢迎来到课程&lt/p&gt&#39;}*/\n与臃肿的盒装商务课程平台不同，CourseKit有一个模块化的体系结构。这意味着您可以使用自己的代码或第三方提供商添加所需的功能。\n虽然最初可能需要做更多的工作，但最终你会得到一个精简灵活的课程网站。\n此图代表了一个典型的基于视频的课程设置，学生通过Stripe购买后注册。\n这是您在创建帐户时可以访问的基于云的CMS。以下是您可以在仪表板中执行的一些操作：\n这是您的课程站点将与之交互的OAuth安全HTTP服务。以下是您将使用它的一些功能：\n你的前端课程网站可以使用你喜欢的任何技术堆栈创建，例如React和Bootstrap，以实现你想要的设计和用户体验。\nCourseKit对Jamstack很友好，所以我建议您将其设置为静态站点，并使用CourseKit JavaScript客户端与API连接，创建UI小部件。\n将学生添加到课程中的一种方法是在课程页面上提供一个指向条带签出的链接。\n通过一个简单的webhook，你就可以通过CourseKit API为学生注册课程。\nVimeo是一种制作视频内容的廉价而有效的方法。Vimeo视频可以轻松嵌入您的网站。只需将视频ID作为frontmatter变量放入课程内容中，并在运行时呈现嵌入。\nCourseKit目前正处于公测阶段，这意味着它已经发布并运行，但一些功能（如分析）仍在开发中。\n我们对早期用户的邀请有限。如果你想申请一个，或者你只想随时了解CourseKit的进度，请务必在本页留下你的详细信息：", "note_en": "When it comes to hosting online courses, developers have had to make a tough choice: either go with an all-in-one solution like Teachable or Thinkific and be stuck with dull design, an unimaginative lesson interface, and severe feature bloat. Or, spend 6 months building a custom platform from scratch.\n My new app,  CourseKit, offers a better choice. With its headless architecture, CourseKit allows developers to create their own course site with their favorite frontend tools without the headache of coding backend features like user auth and analytics.\n In this article, I’ll give you a rundown of how CourseKit works and why you might want to use it for your next online course project.\n  First, a bit about me. I’m  Anthony Gore and I’ve been a web developer for around 10 years.\n I’ve always enjoyed sharing my knowledge with other developers and launched my first video course on Vue.js 2 back in 2016.\n Since then I’ve released several other courses and have tried every course hosting option out there including marketplaces like Udemy and all-in-one platforms like Teachable.\n No matter where I hosted my courses, there was always something I wanted to do that I couldn’t. So last year I decided to build my own course hosting platform from scratch and migrate all my courses onto it.\n While I was able to get the features and design I was looking for, it was a crazy amount of work, most of which was spent on backend stuff that I really didn’t need to customize.\n This got me thinking - what if took what I’d made and spun it off into a product to save other developers from having to repeat this same work?\n   The main difference between CourseKit and other self-hosted course platforms is that CourseKit is a  headless platform.\n If you’re unfamiliar with this architecture, it means that the platform has a backend CMS where you can upload and configure your content but there is no frontend website provided.\n Instead, your content is available from a secure HTTP service. This architecture allows you to create a custom frontend and so frees you from the prosaic design and UX of other platforms.\n I’m not a great designer myself, but here’s a demo course page I built with Nuxt and Tailwind (you can, of course, use whatever frontend tech stack you like).\n  The other major difference between CourseKit and Teachable, Thinkific, etc, is that it&#39;s not a “business in a box” i.e. it is not bloated with features like video hosting, emails, payment gateways, etc.\n Like all good developer platforms, CourseKit optimizes for flexibility and creativity, so you instead get to add the features you want with your own code or with third-party providers you already use e.g. Vimeo, ConvertKit, and Stripe for video, email, and payment respectively. These can be connected with easy-to-set-up API integrations.\n  In a moment, I’ll explain the features of CourseKit in more detail. However, if you prefer to jump ahead and try it yourself, you can request an invite for the beta version by leaving your details here:\n   I’ve explained the headless architecture. Let’s now take a look at some of the other features provided by CourseKit.\n  As explained, you can create a course by uploading content in the backend CMS. Your course site can then fetch the content via API.\n Some of the content you’ll want to make public (e.g. metadata like the course name and lesson titles), but you’ll probably want the meat of your lesson content to be private.\n The CourseKit API is protected with OAuth to ensure that only enrolled students can access any private content.\n  To provide access to your courses you can either enroll students manually via the dashboard or use the CourseKit API. For example, after a student has paid for your course with Gumroad or Stripe, you can set up a webhook to POST their email to the required endpoint.\n Now you just need to pop a “log in” link on your site and, voila, role-based access is handled.\n  To make creating course sites easy, I’ve supplied a  JavaScript client library that allows easy connection with the API and other handy features.\n Here’s an example snippet showing how you’d create a “complete and continue” button on your lessons that will allow the user to simultaneously mark the current lesson complete and progress to the next one.\n  const button  =  document . querySelector ( &#39;#complete-button&#39; ) if  (user . isAuthenticated ( ) )  { button . addEventListener ( &#39;click&#39; ,  async  ( )  =&gt;  {  const success  =  await lesson . markComplete ( )  if  (success )  {  const nextLessonId  = course . nextLessonId  window . location . href  =   ` /courses/  ${course . id } /lessons/  ${nextLessonId } `  }  } ) }\n  To create your lessons you can upload markdown files into the CourseKit dashboard. The markdown can include frontmatter variables so that you can easily include metadata like the lesson title (a  public value) or a Vimeo ID (a  private value)\n   Your course site will fetch from the API at runtime and render content dynamically. Here’s what the above lesson content will look like in your app for an authenticated user:\n . log (lesson ) /*{ meta: { title: &#39;Introduction to pin collecting&#39;, vimeoId: 4893274923 } content: &#39;&lt;p&gt;Hey pinheads, welcome to the course.&lt;/p&gt;&#39;}*/\n  Unlike bloated business-in-a-box course platforms, CourseKit has a modular architecture. This means you can add the features you need either with your own code or with third-party providers.\n While this may be more work to set up initially, you end up with a course site that is lean and flexible.\n This diagram represents a typical video-based course setup where students are enrolled after purchasing through Stripe.\n    This is the cloud-based CMS you get access to when you create an account. Here are some of the things you can do in the dashboard:\n   This is the OAuth-secured HTTP service that your course site will interface with. Here are some of the things you’ll use it for:\n   Your frontend course site can be created with whatever tech stack you like, e.g. React and Bootstrap, to achieve the design and UX you desire.\n CourseKit is Jamstack-friendly, so I recommend you make this a static site and use the CourseKit JavaScript client to connect with the API and create your UI widgets.\n   One way to add students to your course is to provide a link to Stripe checkout on your course pages.\n With a simple webhook, you can then enroll the student in the course through the CourseKit API.\n  Vimeo is a cheap and effective way to create video content. Vimeo videos can easily be embedded in your site. Just drop the video ID into your course content as a frontmatter variable and render the embed at runtime.\n  CourseKit is currently in public beta, meaning it is launched and it works, but some features (e.g. analytics) are still in progress.\n We have limited invitations for early users. If you’d like to request one, or if you’d just like to stay informed about the progress of CourseKit, be sure to leave your details on this page:", "posttime": "2022-02-17 12:35:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coursekit,headless,课程", "title": "CourseKit：无头在线课程平台", "title_en": "CourseKit: headless online course platform", "transed": 1, "url": "https://coursekit.dev/blog/introducing-coursekit/", "via": "", "real_tags": ["coursekit", "headless", "课程"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ABE Quantum是上下文策略的组合，是NoScript&#39中最受欢迎的功能之一；的历史，以及局域网保护，一个重要的#34；经典&#34；2017年量子迁移中失去了防御。\n经过多年的等待和数月的辛勤工作，这些好东西（我个人也错过了很多）最终掌握在所有NoScript 11.3用户手中，这得益于NLNET基金会和下一代互联网计划（更具体地说是NGI0 PET基金）的宝贵支持。\n34岁；ABE Quantum&#34；当然，昵称来自NoScript Classic的应用程序边界执行器模块，它的上下文策略和LAN保护在某种意义上都是a&#34；现代化&#34；后代，牺牲了原作的一些极端灵活性&#39；以防火墙为灵感的策略定义语言，以提供更简单、更易访问和更直观的用户体验，直接集成到NoScript&#39；它的主要自定义用户界面。\n说到ABE，我要感谢NoScript的支柱barbaz&#39；s社区将ABE作为一个独立的WebExtension恢复活力的努力也在（重新）开发WAN到LAN跨区域保护方面起到了很大的帮助，该保护利用了他为NoScript Commons库贡献的修改后的iputil、DNS和AddressMatcher模块。\n上下文策略允许您根据特定站点的上下文，即顶层站点（导航栏中当前显示的地址），为该站点分配不同的权限（或用NoScript的说法，启用不同的功能）。\n例如，您可能希望从twitter启用脚本。只有当你&#39；我们要去maone。net——被Maone和#39吸引；这是一个很棒的嵌入式推文提要；）-但其他地方不行，因为你没有&#39；I don’我不喜欢Twitter在你去的任何地方跟踪你：\n在maone的时候。net，打开NoScript&#39；s弹出窗口并选择自定义作为twitter的策略。通用域名格式。你&#39；我将看到一个新的下拉框，最初设置为任何站点。删除所有不需要的功能（例如脚本）&#39；我不想让Twitter在任何网站上使用（请注意，当第一次选择CUSTOM时，之前选择的预置功能会被复制，因此如果是默认设置，您可能可以这样离开）。然后选择。。。马恩。net，并在上切换脚本和框架（您看到的红色功能，意味着twitter.com需要它们）。\n你&#39；重做：来自twitter的脚本。仅当显示的主站点为maone时，才会执行com。网你可以在任何希望twitter脚本和子文档正常工作的网站（包括twitter.com本身）上重复这一点。如果您改变主意，可以从弹出窗口（仅适用于当前上下文）或选项&gt；“每个站点权限”面板，其中所有上下文加在“当首页匹配时启用这些功能”中列出。。。下拉列表。\n简单地说，LAN功能允许来自公共互联网（又名世界局域网/WAN）的文档链接/发送请求到局域网（LAN）内的主机，这是他们现在可以做的事情，允许所谓的跨区域CSRF/XSS攻击。通过将其禁用（默认和不受信任预设中的出厂设置），您&#39；从&#34重新复制此功能；经典&#34；NoScript，无需经过ABE&#39；当你需要设置一个例外时，它会像防火墙一样设置规则，现在只需在LAN功能框中勾选一个选项即可。\n相关政策和政策；局域网保护（ABE Quantum）项目由NGI0 PET基金资助，该基金由NLnet设立，由欧盟委员会提供财政支持；DG Communications Networks旗下的下一代互联网计划，内容和技术根据第825310号赠款协议。\n*已经在AMO的自动更新中提供，在写这篇文章时仍在Chrome商店等待评论。", "note_en": "ABE Quantum is the combination of  Contextual Policies, one of the most requested features in NoScript&#39;s history, and  LAN protection, an important &#34;Classic&#34; defense lost in  the 2017 Quantum migration.\n After years of waiting and months of hard work, this good stuff (which I personally missed a lot, too) is finally in the hands of all NoScript 11.3 users *, thanks to the precious support by the   NLNet Foundation and the  Next Generation Internet programme (more specifically the  NGI0 PET fund).\n The &#34;ABE Quantum&#34; nickname comes, of course, from the  Application Boundary Enforcer module of NoScript Classic, which both Contextual Policies and LAN protection are in a sense a &#34;modernized&#34; descendant, sacrificing some of the extreme flexibility of the original&#39;s firewall-inspired policy definition language, in order to provide a simpler, more accessible and more intuitive user experience directly integrated in NoScript&#39;s main CUSTOM UI.\n Speaking of ABE, I want to thank  barbaz, a pillar of NoScript&#39;s community whose efforts to  bring back to life ABE as a stand-alone WebExtension helped a lot also in (re)developing the WAN-to-LAN cross-zone protection, which leverages the modified iputil, DNS and AddressMatcher modules  he contributed back to the NoScript Commons Library.\n   Contextual policies let you assign different permissions (or &#34;enable different capabilities&#34;, in NoScript&#39;s parlance) to a certain site  depending on its context, i.e. which is the top level site (the address currently shown in the navigation bar).\n For instance, you might want to enable scripts from twitter.com  only if you&#39;re visiting maone.net - intrigued by Maone&#39;s awesome embedded tweet feed ;) - but not elsewhere, because you don&#39;t like Twitter to track you everywhere you go:\n While on maone.net, open NoScript&#39;s popup and select CUSTOM as the policy for twitter.com. You&#39;ll see a new drop down box, initially set to  ANY SITE. Remove all the capabilities (e.g.  script) you don&#39;t want Twitter to use on  ANY SITE (notice that when CUSTOM is selected first time, the capabilities from the previously selected preset get copied, so if it was DEFAULT you can probably leave that way). Then select  ...maone.net from the drop down, and switch  script and  frame (the capabilities you see in red, meaning they&#39;re are needed by twitter.com) on.\n You&#39;re done: scripts from  twitter.com will be executed only when the main site displayed is  maone.net. You can repeat this on any website (including twitter.com itself) where you want Twitter scripts and subdocuments to work normally. If you change your mind, you can reset some or all the contextual policies you previously set in the CUSTOM permissions deck, either on from the popup (only for the current context) or from the  Options&gt;Per-site permissions panel, where all the contexts plus are listed in the  Enable these capabilities when top page matches... dropdown.\n  Simply put, the LAN capability lets documents coming from the public Internet (AKA World Area Network / WAN) to link / send requests to hosts inside your Local Area Network (LAN), which is pretty what they can do now and allows so called cross-zone CSRF/XSS attacks. By keeping it disabled (the factory setting in the DEFAULT and UNTRUSTED presets), you&#39;re replicating  this feature from &#34;Classic&#34; NoScript, without the hassle of going through ABE&#39;s firewall-like rules when you need to set an exception, which now is just a matter of checking a the LAN capability box.\n  The  Contextual Policies &amp; LAN Protection (ABE Quantum) project was funded through the  NGI0 PET Fund, a fund established by NLnet with financial support from the European Commission&#39;s  Next Generation Internet programme, under the aegis of DG Communications Networks, Content and Technology under grant agreement N o 825310.\n * already available in auto-update  from AMO, still waiting for review  at the Chrome Store while writing this post.", "posttime": "2022-02-17 12:33:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "策略,policies,noscript", "title": "NoScript 11.3中的上下文策略和LAN保护（Abe Quantum）", "title_en": "Contextual Policies and LAN Protection (Abe Quantum) in NoScript 11.3", "transed": 1, "url": "https://hackademix.net/2022/02/17/contextual-policies-lan-protection-abe-quantum-in-noscript-113/", "via": "", "real_tags": ["策略", "policies", "noscript"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加泰罗尼亚语德语西班牙语法语拉丁语意大利语葡萄牙语葡萄牙语印度尼西亚语简体中文   正體中文   日本語   波尔斯基한국어   荷兰罗马加尔\nT恤»\n2021发生了很多事。事实上，这项调查一直推迟到2022年！\n在一系列更快的构建工具和一批新的后端框架之间，JavaScript世界不断发展。我们尽了最大努力，给这项调查增加了一些新的动力（阅读更多关于&#39；的新内容），比如新的问题类型，交叉引用两个数据点的能力（比如按经验级别划分的年薪），甚至还有一种定制图表以展示自己见解的方法！阅读更多关于&#39；It’今年是新的一年（英语）。\n它不是&#39；不过，这并非一帆风顺。谢天谢地，我们不得不处理一个数据泄露事件&#39；看来不会有什么坏后果。而我们&#39；We’我们不断努力使调查更具包容性、更容易获取和更公平。\n尽管如此，尽管这项调查只能代表JavaScript生态系统的一小部分，但我们希望你&#39；我会发现结果数据很有趣！\n如果你&#39；I’我想知道我们什么时候发布更多的结果或宣布明年&#39；s版，请在下面给我们留下您的电子邮件：\n用Nivo制作的图表。由Netlify主持。问题？发现一只虫子了吗？留下一个问题。加入我们的不和谐。", "note_en": "Català   Česky   Deutsch   English  Español   فارسی   Français   Galego   Hindi   Italiano   Português   Русский   Українська   Svenska   Türkçe   Indonesia   简体中文   正體中文   日本語   Polski   한국어   Nederlands   Română   Magyar\n   T-shirt »\n A lot happened in 2021. So much in fact that the survey was pushed back all the way to 2022!\n Between a slew of faster build tools and a new crop of back-end frameworks, the JavaScript world kept evolving. And we did our best to keep up, giving this survey a couple new power-ups ( read more about what&#39;s new) such as new question types, the ability to cross-reference two datapoints (such as yearly salaries by experience level), and even a way to customize the charts to surface your own insights! Read more about  what&#39;s new this year (English).\n It wasn&#39;t all smooth sailing, though. We had to deal with a  data leak that thankfully didn&#39;t seem to have any bad consequences. And we&#39;re constantly making efforts to make the survey more inclusive, more accessible, and more fair.\n Still, even though the survey can ever only represents a tiny, tiny part of the JavaScript ecosystem, we hope you&#39;ll find the resulting data interesting!\n  If you&#39;d like to know when we release additional results or announce next year&#39;s edition,just leave us your email below:\n   Charts built with  Nivo.  Hosted by  Netlify.  Questions? Found a bug?  Leave an issue.  Join us on  Discord.", "posttime": "2022-02-17 12:31:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,state,调查", "title": "JavaScript 2021的状态", "title_en": "State of JavaScript 2021", "transed": 1, "url": "https://2021.stateofjs.com/", "via": "", "real_tags": ["java", "state", "调查"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "长时间的剧烈认知活动会导致精神疲惫。虽然从精神疲惫中恢复的普遍策略（比如看电视）是无效的，但有氧运动似乎是一种很有前途的方法。这可以用急性和慢性有氧运动对中枢神经系统的益处来解释。\n这项研究调查了一次中度有氧运动（65-75%的参与者和#39；个人V˙O2peak）从实验性精神衰竭中恢复的可能性。对健康成人（N=99）进行了随机对照试验。他们进行了60分钟的认知要求测试，以诱发精神衰竭。随后，他们被随机分为三种治疗方法之一：在自行车测力计上进行30分钟的中度有氧运动，30分钟的简单下半身伸展运动（=主动控制治疗）或观看流行情景喜剧（=被动控制治疗）。在治疗前后评估认知灵活性表现、情绪、疲劳、躁动、自我认知能力和动机。\n实验结果表明，与主动控制治疗相比，适度有氧运动能更好地恢复认知灵活性（平均差除以合并标准差，Cohen#39；SD=0.737）、情绪（d=0.405）、疲劳（d=0.480）、自我认知能力（d=0.214）和动机（d=0.524）。适度的有氧运动也比被动控制治疗（d=0.102-0.286）更有效，同时排除了疲劳（d=0.015）和躁动（d=0.473）。\n总之，这项研究表明，一次急性有氧运动有助于认知灵活性和主观幸福感的恢复。这不仅适用于人工主动控制治疗，也适用于广泛的休闲活动，即看电视。\n科克伦数据库系统修订版。2017年4月25日；4（4）：CD003200。内政部：10.1002/14651858。CD003200。pub7。科克伦数据库系统修订版。2017.PMID:28444695免费PMC文章。更新。回顾\n科克伦数据库系统修订版。2016年12月20日；12（12）：CD003200。内政部：10.1002/14651858。CD003200。pub6。科克伦数据库系统修订版。2016.PMID:27995604免费PMC文章。更新。回顾\n科克伦数据库系统修订版。2016年6月24日；（6） ：CD003200。内政部：10.1002/14651858。CD003200。pub5。科克伦数据库系统修订版。2016年PMID:27339435更新。回顾\n科克伦数据库系统修订版。2016年2月7日；2:CD003200。内政部：10.1002/14651858。CD003200。pub4。科克伦数据库系统修订版。2016年PMID:26852189更新。回顾\n科克伦数据库系统修订版。2015年2月10日；（2） ：CD003200。内政部：10.1002/14651858。CD003200。pub3。科克伦数据库系统修订版。2015年，PMID:25674924更新。回顾", "note_en": "Prolonged periods of intense cognitive activity lead to a state of mental exhaustion. While widespread strategies to recover from mental exhaustion (i.e., watching TV) are non-effective, aerobic exercise seems to be a promising approach. This can be explained by the acute and chronic aerobic exercise-induced benefits on the central nervous system.\n  This study investigated the potential of a single bout of moderate aerobic exercise (65-75% of each participants&#39; individual V˙O2peak) to recover from experimentally induced mental exhaustion. A randomized controlled trial on healthy adults (N = 99) was conducted. They performed 60 min of a cognitively demanding test battery, in order to induce mental exhaustion. Subsequently, they were randomized to one of three treatments: 30 min of moderate aerobic exercise on a cycle ergometer, 30 min of a simple lower body stretching routine (= active control treatment) or watching a popular sitcom (= passive control treatment). Cognitive flexibility performance, mood, tiredness, restlessness, self-perceived cognitive capacity, and motivation were assessed before and after treatment.\n  The empirical results showed that moderate aerobic exercise led to a better recovery for cognitive flexibility (mean difference divided by pooled standard deviation, Cohen&#39;s d= 0.737), mood (d= 0.405), tiredness (d= 0.480), self-perceived cognitive capacity (d= 0.214), and motivation (d= 0.524) compared to active control treatment. Moderate aerobic exercise was also more effective than passive control treatment (d= 0.102 - 0.286) with the exemption of tiredness (d= 0.015) and restlessness (d = -0.473).\n  In conclusion, this study suggests that a single bout of acute aerobic exercise supports regeneration of cognitive flexibility performance and of subjective well-being. This holds true not just compared to artificial active control treatment but also compared to widespread leisure time activity, namely watching TV.\n    Cochrane Database Syst Rev. 2017 Apr 25;4(4):CD003200. doi: 10.1002/14651858.CD003200.pub7.  Cochrane Database Syst Rev. 2017.  PMID:  28444695  Free PMC article.  Updated.  Review.\n  Cochrane Database Syst Rev. 2016 Dec 20;12(12):CD003200. doi: 10.1002/14651858.CD003200.pub6.  Cochrane Database Syst Rev. 2016.  PMID:  27995604  Free PMC article.  Updated.  Review.\n  Cochrane Database Syst Rev. 2016 Jun 24;(6):CD003200. doi: 10.1002/14651858.CD003200.pub5.  Cochrane Database Syst Rev. 2016.  PMID:  27339435  Updated.  Review.\n  Cochrane Database Syst Rev. 2016 Feb 7;2:CD003200. doi: 10.1002/14651858.CD003200.pub4.  Cochrane Database Syst Rev. 2016.  PMID:  26852189  Updated.  Review.\n  Cochrane Database Syst Rev. 2015 Feb 10;(2):CD003200. doi: 10.1002/14651858.CD003200.pub3.  Cochrane Database Syst Rev. 2015.  PMID:  25674924  Updated.  Review.", "posttime": "2022-02-17 12:29:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "有氧,aerobic,认知", "title": "急性有氧运动以从精神疲惫中恢复", "title_en": "Acute aerobic exercise to recover from mental exhaustion", "transed": 1, "url": "https://pubmed.ncbi.nlm.nih.gov/34516957/", "via": "", "real_tags": ["有氧", "aerobic", "认知"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用于WebAssembly的Qt：soffice", "note_en": "Qt for WebAssembly: soffice", "posttime": "2022-02-17 12:28:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webassembly,running", "title": "LibreOffice通过WebAssembly在浏览器中本机运行", "title_en": "LibreOffice running natively in the browser via WebAssembly", "transed": 1, "url": "https://lab.allotropia.de/wasm/", "via": "", "real_tags": ["running"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们将如何拥有一个允许更新和同步的分布式数据存储网络？\n这些问题实际上是web3分布式部分的核心。Web3还有其他部分：不变性、加密安全性等。但这些其他元素不回答如何在分布式数据存储上执行更新*\n在寻找这些问题的答案时，我看到了一个相当简单的工具作为基础：JSON diff和patch。\nJSON，因为JSON是web的结构化数据格式。对于Web3来说，这种情况将继续存在。在我们的web架构中，几乎所有人都使用JSON。其他格式将越来越多地被用作JSON的优化。关联数组具有（合理的）人类可读性之美，加上现代计算机编程语言中广泛的本机支持。电脑和人类都能读，这不是爱！\ngit分布式管理源代码策略中的一个基本工具是diff和补丁的概念。这些基本操作使git成为可能。Diff用于构造可应用于对象的面片，从而使最终状态对某些值有意义。\n应用补丁是因为我们希望将某个前状态提升到某个后状态。补丁并没有指定所有内容。只有源代码的预期正确，以及更新后的预期正确。\n这样，就可以对源文本的不同部分执行分布式更新。冲突会导致需要采取一些补救措施，但如果没有冲突，则可以合并所有内容以获得最终状态，该状态尊重所有更新，无论它们来自何时何地。\n这使得git可以完全多主，而不需要或强制使用任何复杂的协议（如RAFT）进行同步。\n逆包器Mark 2&#34；id&#34；：13234，&#34；名称&#34；&#34；&#描述&#34；&#34；&#34；描述&#34；&#34；&#34；&#34；逆包器Mark II是逆包器的最新发展，用于为单侧相位分配器产生反向无功电流。&#，  &#34;价格&#34；：{&#34；价值&#34；&#34；3430.23&#34；&#34；货币&#34；&#34；欧元&#34；}&#34;股票&#34；：32 ,  &#34;供应商&#34；：[&#34；供应商/123&#34；，&#34；供应商/4332&#34；]\n如果Alice在应用程序中打开对象并将项目名称更改为&#34；复古建筑标志II&#34；，BOB应该可以同时更新供应商名单，而无需相互干涉&#39；脚趾。\n在应用中，这种策展操作通常通过锁定对象来实现。这意味着只有一个人能赢。锁是巨大的痛苦来源，不仅因为你可以&#39；无法实现其他完全合理的并发操作，但因为您可能会遇到过时的锁，并且必须确定何时释放它们。\n但如果萨莉没有&#39；Don’我不能提交她的整个对象进行更新，但只提交她想更改的部分？鲍勃也这么做了？\n现在我们可以在三个不同的地方执行更新，本地为Lice，本地为Bob，最后在共享服务器资源上执行。\n结构化补丁可以通过在Alice提交之前查看对象来确定，然后使用diff从Alice&#39构建补丁；s diff可能是这样的：\n{&#34；姓名&#34；：{&#34；前&#34；&#34；复古装潢师标志2&#34；&#34；&#34；&#34；复古装潢师标志II&#34；}\n现在，两者都可以清晰地应用于上面列出的原始文档。我们可以毫无困难地按任何顺序堆叠任何一个补丁。也许我们要求KBOB和Alice就应用程序顺序达成一致（使用git完成拉/推操作）。但也许我们只是允许他们在他们来的时候申请。答案取决于工作流程。\n{&#34；姓名&#34；：{&#34；前&#34；&#34；复古装潢师标志2&#34；&#34；&#34；&#34；复古装潢师标志2&#34；&#\n我们有个问题。但我们立即发现，这两者存在冲突，爱丽丝可以被要求通过浮出水面来解决这个问题。在数据整理的情况下，这是一个完全合理的工作流程。我们可以用JSON diff最简单的版本来解决这个数据整理问题。\n这种冲突可以向爱丽丝浮出水面，鲍勃可以被允许继续他的生意。这个特殊的问题能用CRDT自动解决吗？当然，但它可能不会产生你想要的结果。最后一步当然会奏效，但接下来哪一步更正确可能需要人工审查，更糟糕的是，这可能会导致两种结果交错（一种可能的结果！）。\n然而，我们可以使用文本差异将前后的内容制作成基于文本的补丁。可能gits基于行的方法不是我们想要的，而是将单词作为原子的方法。它不会解决这个特定的冲突，但它可以使文本字段更加灵活。\n然而，您想要哪一个，需要DIFF算法的语义方向。虽然许多结构化的差异问题将通过最简单的算法来解决，但最终我们需要一个有助于指导差异含义的模式。字符串字段可以是基于最佳行的、基于单词的，或者它们必须始终是原子的（就像标识符一样）。\n补丁实际上是更简单的操作。补丁应用程序基本上只是检查读取状态是否匹配，然后替换写入。\n相比之下，Diff必须进行计算，而且在实践中经常需要猜测从读状态到写状态的良好转换。diff提供的补丁的具体调整取决于应用程序的需要。有一些通用算法可以在一系列应用中正常工作，但没有一种通用算法。这就是为什么我们需要模式提供的语义方向。\nDiff在计算上也要昂贵得多。找到最小的变化意味着找到最大的相似性。事实证明，这对于JSON字典的框架来说非常简单，但对于列表和字符串来说却非常困难。对于列表列表。。。嗯，我&#39；我待会儿再谈。\n让&#39；就这么说吧&#39；毫不夸张地说，你可以轻易地陷入宇宙的热寂之中。因此，启发式必须是任何全自动差异的一部分。\n但也有其他工作流可能需要更灵活的方法来确保数据完整性。before状态正在重新设置以指定读取对象模型。它告诉我们，当我们应用补丁时，我们希望什么是真实的。\n对于git，这可能是一行行文本。例如，更改一个非常简单的自述文件。txt最初是向一个向松鼠问好的人问好，git将生成一个如下所示的补丁：\n这不是&#39；它不是最紧凑的补丁，如果hello被改成其他单词，比如“问候语”，它就会发生冲突。它对git很有效的原因是，对于编程语言来说，文本行是一种合理的粒度。\n但是唐的前后&#39；不必是台词或文字。before可以是读取状态的任何规范。对于银行账户提款，我们可能会要求前状态大于后状态，或与后状态相等。这将是一个很好的小交易，以确保我们不&#39；不要透支。\n或者我们希望用正则表达式指定before状态？或者，我们读取了很多值，以便计算对象中的进一步值，在这种情况下，我们希望知道这些值都不会改变。\n这种方法为我们提供了一种读隔离，它根据我们使用的用例进行调整&#39；我们真的在一起工作。将补丁作为更新的单位，为我们的应用程序提供了恰到好处的粒度，这实际上可以&#39；我们不能提前知道。\n这是一个超越了通常由数据库提供的隔离选项的进步，并且自然地扩展到了对象或互连对象的组织图（如USDB中存在的）。\n我&#39；我们在TerminusX中实现了一个简单的JSON差异和补丁。但我们&#39；realso正在将其扩展到aschema指定的版本。它&#39；它也很容易实现，而且想象一个完整的补丁空间非常有趣，其中许多补丁永远无法由adiff确定，但对于通过文档存储进行分布式传输来说，这将非常方便。我们将在实践中遇到用例时添加这些不同的操作，但我们&#39；我们也很高兴听到人们在野外已经遇到的用例。一定要告诉我！\n*CRDT针对特定类型的数据结构回答了这个问题，但不是针对所有类型的数据结构。这些方法只能更新某些类型的数据结构。此外，许多更新需要人工辅助审查，并且永远不需要aCRDT。还有一些将具有无法在CRDT中指定的对象读取模型条件。最终，我们的数据库应该支持一系列分布式数据类型，包括CRDT。\n如果您对JSON diff&amp；感兴趣；帕奇，我们&#39；将于2月17日格林威治标准时间下午3点在Twitch上播放。", "note_en": "How will we have a distributed network of data stores which allow updates and synchronizations?\n    These questions are really at the heart of the distributed part of web3. Web3 has other parts: immutability, cryptographic security, etc. But these other elements do not answer how to perform updates on distributed data stores.*\n In seeking the answer to these questions I was led to see a rather simple tool as foundational: JSON diff and patch.\n JSON, because JSON is the structured data format for the web. This will continue to be true for Web3. Everyone uses JSON for just about everything in our web architecture. Other formats are going to be increasingly used as mere optimizations of JSON. Associative arrays have the beauty of (reasonable) human readability, combined with widespread native support in modern computer programming languages. Both computers and humans can read it, what’s not to love!\n   A fundamental tool in git’s strategy for distributed management of source code is the concept of the diff and the patch. These foundational operations are what make git possible. Diff is used to construct a patch that can be applied to an object such that the final state makes sense for some value of makes sense.\n The application of patches happens because we want a certain before state to be lifted to a certain after state. The patch doesn’t specify everything. Only what it expects to be true of the source, and what it expects to be true after the update.\n With this, it’s possible to have distributed updates performed on different parts of source text. Collisions result in some remedial action being required, but if there are no collisions everything can be merged to obtain a final state which respects all updates, no matter when or where they came from.\n This is what allows git to be fully multi-master, without requiring or forcing synchronization using any complex protocols (like RAFT).\n     {  &#34;id&#34; :  13234 ,  &#34;name&#34; :  &#34;Retro Encabulator Mark 2&#34; ,  &#34;description&#34; :  &#34;The Retro Encabulator Mark II is the lastest   development of the Retro Encabulator used to   generate inverse reactive current for unilateral   phase detractors.&#34; &#34; category&#34; :  &#34;Cardinal Grammeter Synchronisers&#34; ,  &#34;price&#34; :  {  &#34;value&#34; :  &#34;3430.23&#34; ,  &#34;currency&#34; :  &#34;Euro&#34;  } } ,  &#34;stock&#34; :  32 ,  &#34;suppliers&#34; :  [ &#34;Supplier/123&#34; , &#34;Supplier/4332&#34; ]  }\n If Alice opens the object in an application and changes the name ofthe item to &#34;Retro Encabulator Mark II&#34;, it should be possible for Bobto update the suppliers list simultaneously without either steppingon each other&#39;s toes.\n In applications, this sort of curation operation is often achieved witha  lock on the object. Which means only one person can win. And locksare a massive source of pain, not only because you can&#39;t achieveotherwise perfectly reasonable concurrent operations, but because yourisk getting stale locks and having to figure out when to release them.\n But what if Sally didn&#39;t submit her whole object for update, but onlythe part she wanted to be changed? And Bob did the same?\n Now we can perform the updates in three different places, locally forAlice, locally for Bob, and then finally at a shared server resource.\n The structured patch could be determined by looking at the object before Alice submitted it, and after, using  diff. The patchconstructed from Alice&#39;s diff might look like this:\n {  &#34;name&#34; :  {  &#34;@before&#34; :  &#34;Retro Encabulator Mark 2&#34; ,  &#34;@after&#34; :  &#34;Retro Encabulator Mark II&#34; } }\n   Now both can apply cleanly to the original document listed above. Wecan stack either patch in any order without difficulty. Perhaps we askBob and Alice to agree on the application order (using pull / push asis done with git). But maybe we just allow them to apply when theyarrive. The answer depends on the workflow.\n   {  &#34;name&#34; :  {  &#34;@before&#34; :  &#34;Retro Encabulator Mark 2&#34; ,  &#34;@after&#34; :  &#34;Retro Encabulator Mark two&#34; } }\n We have a problem. But we see immediately that the two are in conflictand Alice can be asked to resolve the question by surfacing it. In thecase of data curation, this is a perfectly reasonable workflow. And itis this problem of data curation that we can solve with the simplestversion of JSON diff.\n This conflict can be surfaced to Alice, and Bob can be allowed to goabout his business. Could this particular problem be resolved in apurely automatic way with a CRDT? Definitely, but it probably will notresult in what you want. Last first will work of course, but thenwhich is  more right might need human review, and even worse it mightresult in both results being interleaved (a likely outcome!).\n We  could make the before and after, however, be a text-based patchusing a textual diff. Probably gits line-based approach is  not whatwe want here, but rather one that takes words as atoms. It will notsolve this particular conflict, but it could make text fields muchmore flexible.\n Which of these you want, however, requires  semantic direction of thediff algorithm. While lots of structured diff problems will be solvedby the simplest algorithm, ultimately we need to have a schema thathelps to direct the meaning of our diffs. String fields might be bestline-based, word-based, or perhaps they must always be atomic (as withidentifiers).\n  Patch is actually the simpler operation. Patch application basicallyjust checks that the read state matches, and then substitutes thewrites.\n Diff, by contrast, has to calculate, and often in practice  guess agood transition from the read state to the write state. The specifictuning of the patch provided by a diff is dependent on the needs ofthe application. There are  generic algorithms that can work decentlyfor a range of applications, but there is no one size fits all. Thisis why we will need the  semantic direction which can be provided bya schema.\n Diff is also computationally  much more expensive. Finding theminimal change means finding the maximal similarity. As it turns out,this is pretty easy for the skeleton of a JSON dictionary, but rathera pain for lists, and strings. And for lists of lists... Well, I&#39;llget into that later.\n Let&#39;s just say it&#39;s no exaggeration that you can easily wander intothe heat-death of the universe. Hence heuristics have to be part ofany fully automatic diff.\n  But there are other workflows that might want a slightly more flexibleapproach to ensuring data integrity. The  before state is reallysitting there to specify the  read object model. It tells us what wewant to be true when we apply the patch.\n With git, this might be lines of text. For instance, to change a verysimple  README.txt which initially says  hello world to one thatsays  hello squirrels, git will produce a patch that looks somethinglike the following:\n  This isn&#39;t the most compact patch, and it will conflict if hello werechanged to some other word, for instance  greetings perhaps. Thereason that it works well for git is that lines of text are a somewhatreasonable granularity for programming languages.\n But the before and after don&#39;t have to be lines or words. The beforecould be any specification of the read state. For a bank accountwithdrawal, we might ask for the before state to be larger than, orequal to the after state. This would be a nice little transaction forensuring we don&#39;t overdraw.\n Or perhaps we want the before state to be specified with a regex? Ormaybe we read a  lot of values in order to calculate a further valuein the object, in which case we want to know that  none of thesevalues change.\n This approach gives us a kind of read isolation that is  tuned tothe use-case we&#39;re actually working with. Making patch the unit ofupdate gives us just the right granularity for our application, whichreally can&#39;t be known in advance.\n This is an advancement beyond the sort of isolation options usuallyprovided by a database, and one that extends naturally to objects orgraphs of interconnected objects (as exists in TerminusDB).\n  I&#39;ve implemented a simple JSON diff and patch in TerminusX. But we&#39;realso working on the extensions of this to those specified by aschema. It&#39;s also easy to implement and very interesting to imagine afull space of patches, many of which could never be determined by adiff, but which would be extremely handy to have for distributedtransactions over document stores. We will be adding these variousoperations as we run into use-cases in practice, but we&#39;re also verykeen to hear about use cases that people have already encountered inthe wild. Do let me know!\n * CRDTs answer this question for certain types ofdata structures - but not for all. Only certain  types ofdata structures can be updated with these approaches. In addition, manyupdates require human aided review and will never require aCRDT. Still others will have  object read model conditions that cannot be specified in a CRDT. Ultimately our databases should support arange of distributed datatypes including CRDT.\n  If you are interesed in JSON diff &amp; patch, we&#39;ll be streaming on Twitch on 17 Feb at 3pm GMT.", "posttime": "2022-02-17 12:22:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "json,对象", "title": "区别是什么：JSON差异和补丁", "title_en": "What's the Difference: JSON diff and patch", "transed": 1, "url": "https://github.com/terminusdb/technical-blogs/blob/main/blogs/json_diff_and_patch.md", "via": "", "real_tags": ["json", "对象"]}]