[{"category": "", "categoryclass": "", "imagename": "e5c106554359fa4dc657fb0309d1c77d.jpg", "infoid": 1067620, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科技巨头一再表示，他们会欢迎政府监管 - 如果是正确的监管，当然是正确的监管。但面对五个反垄断票据，可以放松房子司法委员会被描述为苹果，亚马逊，谷歌和Facebook的“垄断力量”，大型技术正在带出大型游戏枪支。\n 苹果首席执行官蒂姆烹饪自己称为扬声器南希·佩洛西“发出警告”，“匆忙”的反托拉斯票据可以扰乱iPhone，根据纽约时报，这并非全部：\n “高管，游说者和十几个智库和经过多元的坦克和宣传团体，由科技公司支付的宣传国会议会办事处，呼吁和通过电子邮件向代言人及其工作人员以及书面信件争论，争论该行业和国家会有可怕的后果想法成为法律，“NYT写道。\n 目前的政府对打击技术垄断的真正兴趣，有一种越来越多的思想 - 当拜登选择了杰出的反托拉斯学者和亚马逊评论家临安汗来领导联邦贸易委员会时，可能会最清楚地发挥作出最明显的观点。她上周宣誓就职。\n  科技公司这些日子潜入潜入游说并不罕见，因为您现在的期望是世界上最有价值的公司，我们已经看到他们在局部层面的影响压倒性的选民和立法者。在加州历史上的最昂贵的措施后，优步和Lyft赢得了大量的，使用自己的应用程序作为一个不公平的优势，亚利桑那州的争议应用商店比尔神秘地消失后科技公司介入。一个Apple Lobbyist成功吓跑了加州立法者远离权利 -  2019年的维修票据也。\n 佩洛西显然没有拥有它，至少不是在呼叫中。根据时代的来源，她推回厨师。 ", "note_en": "Tech giants have repeatedly said they would welcome government regulation — if it’s the right regulation, of course. But  faced with five antitrust bills that could unwind  what the House Judiciary Committee described as Apple, Amazon, Google and Facebook’s “monopoly power,” Big Tech is bringing out the big lobbying guns.\n Apple CEO Tim Cook himself called Speaker Nancy Pelosi to “deliver a warning” that that the “rushed” antitrust bills could disrupt the iPhone,  according to  The New York Times , and that’s not all:\n “Executives, lobbyists, and more than a dozen think tanks and advocacy groups paid by tech companies have swarmed Capitol offices, called and emailed lawmakers and their staff members, and written letters arguing there will be dire consequences for the industry and the country if the ideas become law,” the NYT wrote.\n There’s a growing sense that the current administration has a genuine interest in combating tech monopolies — a point perhaps made most clearly when Biden chose prominent antitrust scholar and Amazon critic Lina Khan to lead the Federal Trade Commission.  She was sworn in last week.\n  It’s not unusual for tech companies to dive deeper into lobbying these days, as you’d expect now that they’re the most valuable companies in the world, and we’ve seen their outsize influence overwhelm voters and legislators at the local level before. Uber and Lyft won big  after backing the most expensive measure in California history, using their own apps  as an unfair advantage, and Arizona’s controversial app store bill  mysteriously disappeared after tech companies stepped in. An Apple lobbyist managed to  scare California legislators away from a right-to-repair bill in 2019, too.\n Pelosi apparently wasn’t having it, though, at least not on the call. She pushed back against Cook, according to the  Times’ sources.", "posttime": "2021-06-23 10:01:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,rust,扰乱,cook,票据", "title": "蒂姆厨师叫做南希·佩洛西，警告她反对反垄断扰乱iPhone ", "title_en": "Tim Cook called Nancy Pelosi to warn her against antitrust disrupting the iPhone", "transed": 1, "url": "https://www.theverge.com/2021/6/22/22546286/apple-tim-cook-nancy-pelosi-google-amazon-facebook-antitrust-lobbying", "via": "", "real_tags": ["iphone", "rust", "扰乱", "cook", "票据"]}, {"category": "", "categoryclass": "", "imagename": "b996442ae7a4995b6024a7744aa1c309.png", "infoid": 1067619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编程我的上一篇文章，“我们不需要字符串类型”，导致了一点搅拌。虽然反馈混合了，但是字符串的常见主题是有用的特征。在进行更多的研究之后，我只能确定一件事：大多数当前的字符串类型被打破！\n 我们中的许多人认为我们的琴弦能够超过他们实际所做的事情。我们依靠他们的功能而实际检查它有效。这很容易导致不正常工作的程序，特别是在国际化方面。在大多数情况下，在没有字符串类型的情况下似乎我们会更好。\n  我看着字符串如何在一些基本情况下表现。我会跨越每种情况，给出预期的结果和一些实际结果。我考虑用结果显示一个矩阵，但由于所有测试语言表现得这么难，它似乎并不有用。\n  使用文本“noël”与分解的Unicode字符串“Noe \\ U0308L”，我选中了以下内容：\n 1.它是否正确打印？是的，大多数语言都能够这样做。虽然IdeOne.com接口似乎打破了输出（所以要小心测试）。\n 2.逆转是什么？ “lëon”，正确吗？大多数情况下都失败了。最常见的结果是“L̈eon”（分流者在'L'而不是'E'上）。这是在没有字符串类的情况下发生的事情，只需反转代码数组即可。\n 3.前三个字符是什么？主要是这里的答案是“noe”，而不是所需的“noë”。这很容易导致关于一个角色的大讨论，但我假设大多数人对当前结果不满意。这再次指示一个字符串类型，它仅将数据视为代码点数。 \n4.什么是长度？常见答案是5.又一次，这表明我们的字符串类型仅仅是字符数组，而不是真正处理文本。\n 对于所有这些问题，如果您在您喜欢的单词处理器或文本编辑器中编辑此文本，请尝试考虑应发生的情况。我通常希望“ë”字符作为一个实体处理。我不希望回溯/删除只能删除一部分字母。我希望复制前三个字母来包括重音。\n  unicode有一个猫咪有点奇怪（我希望你有一个字体，它显示它们 - 如果没有，这部分的标题是一个快乐的猫和一个悲伤的猫，unicode表情符号集的一部分）。选择这些字符，因为它们在BMP之外（基本的多语言平面）。使用UTF-16编码（Java，C＃，JavaScript），这对语言的麻烦拼写。\n 1.长度？ Python Unicode正确报告2.那些UTF-16语言倾向于报告4：字符需要代理对。\n 2.第一个角色后的子字符串？ Python Unicode正确地报告了悲伤的猫“😾”。 UTF-16语言的弦线与半代理后跟悲伤的猫产生无效字符串。\n 逆转？ Python Unicode获取“😾😸”的正确相反。 UTF-16语言产生无效字符串。用C＃我认为我发现了意外的缺陷。它甚至没有显示无效的字符串，然后为整个程序显示任何输出！ [太太缺陷]\n 语言使用编码不可知论图库，如C ++，Perl和普通Python 2字符串，在此处失败。它们忽略任何编码并假设字符串是一个1字节代码点的数组。 Python 3采用Unicode作为默认字符串类型，从而修复了一些问题。看来Perl也有一个'UTF8'模式，它修复了这些猫的问题，但不适用于“noël”字符串。 \n此字符串包含一个致字符，“ffl”部分是单个Unicode代码点。它们主要存在于兼容性，但它们是案例转换的良好测试。\n 1.什么是大写？我没有找到任何不打印“BA FFL E”的语言。请注意，结扎仍然是小写的。预期答案当然是“挡板”。\n Unicode有一个特殊的案例转换：这个单一的拼字点实际转换为三个代码点。通过不遵循这些附加规则，语言大写函数会产生一个有趣的结果：转换为大写的字符串仍然存在小写字符。\n  最后检查我确实是将两个逻辑上等效的字符串与不同的组成形式进行比较。这里“noël”正在使用预先编译的“ë”字符。\n 1.预混==分解？答案在所有测试中都没有。但是，几种语言可以提供Unicode标准化库。在那些语言中，字符串的正常形式确实比较相等。 JavaScript没有这样的库，这是真正悲惨的，因为它主要是一种UI语言，究竟究竟想要正确的Unicode功能。\n 争论标准化和词汇分析不是基本字符串类型的一部分。但这些似乎是基本操作，一个人想做文字。如果不包括在内，则字符串类型的目的究竟是什么？\n  我鼓励您以您喜欢的语言运行此类测试。如果您正在与国际文本一起工作，您可以了解您的“字符串”类型实际执行的事项至关重要。一旦您运行此操作，您应该重新考虑您的“字符串”类型实际为您提供的操作。在我看来，他们都被打破了。 \n我承认正确的答案并不总是明确。 文本处理是一个困难的主题，并且在最小的最小范围内，我们必须覆盖图形群集（一些字符串类公开了与此相关的功能，并且Perl甚至具有GCString类）。 这超出了本文的范围，但与良好的字符串类型非常相关。  我在前一篇文章中提出的点变得更加尖锐。 我宁愿有一个字符数组而不是一个破碎的字符串类。 我没有对一系列字符进行虚假期望：它为上述测试产生的结果非常逻辑。 实际上，一系列Unicode字符在这些测试中比许多专用字符串类更好地执行更好。 ", "note_en": "Programming     My previous article, “ We don’t need a string type“, caused a bit of stir. Though the feedback is mixed, there is a common theme of a string being a useful feature. After doing a bit more research I can determine only one thing: most current string types are broken!\n Many of us believe our strings are capable of more than what they actually do. We rely on their functionality without actually checking that its valid. This can easily lead to programs which do not work correctly, particularly with respect to internationalization. In most cases it seems we would be better off without a string type.\n  I looked at how strings behave in a few basic situations. I’ll go over each situation, giving the expected result and some of the actual results. I considered showing a matrix with the results, but since all the tested languages behave so poorly it didn’t seem useful.\n  Using the text “noël” with a decomposed Unicode string “noe\\u0308l”, I checked the following:\n 1. Does it print correctly? Yes, most languages are capable of doing this. Though the ideone.com interface seems to break the output (so be careful with testing).\n 2. What is the reverse? “lëon”, correct? Mostly this fails. The most common result is “l̈eon” (the dieresis is on the ‘l’ instead of the ‘e’). This is what happens without a string class, by just reversing an array of code points.\n 3. What are the first three characters? Mostly the answer here is “noe”, as opposed to the desired “noë”. This could easily lead into a big discussion about what a character is, but I assume most people would not be happy with the current result. This is again indicative of a string type which merely treats the data as an array of code points.\n 4. What is the length? The common answer is 5. And yet again, this indicates our string types are merely arrays of characters and not truly handling the text.\n For all of these questions, try to consider what should happen if you were editing this text in your favourite word processor or text editor. I generally expect that the ‘ë’ character is handled as a single entity. I don’t expect backspace/delete to just remove part of the letter. I expect copying the first three letters to include the accent.\n  It was a bit weird to find out that Unicode has cats in it (I hope you have a font which shows them — if not, the title of this section is a happy cat and a sad cat, part of the Unicode emoticon set). These characters were chosen since they are outside of the BMP (basic multilingual plane). This spells trouble for languages using UTF-16 encodings (Java, C#, JavaScript).\n 1. Length? Python unicode correctly reports 2. Those UTF-16 languages tend to report 4: the characters require surrogate pairs.\n 2. Substring after the first character? Python unicode correctly reports the sad cat “😾”. The UTF-16 languages produce invalid strings with a half-surrogate followed by the sad cat.\n 3. Reverse? Python unicode gets the correct reverse of “😾😸”. The UTF-16 languages produce invalid strings. With C# I think I uncovered a defect in ideone. It doesn’t even show the invalid string and instead shows no output at all for the entire program! [ ideone defect]\n Languages using an encoding agnostic library, like C++, Perl, and normal Python 2 strings, fail here as well. They ignore any encoding and assume the string is an array of 1-byte code points. Python 3 adopted unicode as the default string type, thus fixing some problems. It appears that Perl also has a ‘utf8’ mode which fixes problems for these cats, but not for the “noël” string.\n  This string contains a ligature character, the “ffl” part is a single unicode code point. They exist mainly for compatibility, but they are a good test for case conversion.\n 1. What is the uppercase? I did not find any language which doesn’t print “BAﬄE”. Notice the ligature remains lowercase. The expected answer is of course “BAFFLE”.\n Unicode has a special class of case conversion: this single ligature code point is actually converted to three code points. By not following these additional rules, a language uppercase function produces an interesting result: a string converted to uppercase still has lowercase characters in it.\n  A final check I did was to compare two logically equivalent strings with different composition forms. Here “noël” is using the precomposed “ë” character.\n 1. Is precomposed == decomposed? The answer is no in all tests. However, several languages do offer Unicode normalization libraries. In those languages the normal form of the strings does compare equal. JavaScript does not have such a library, which is really tragic because it’s primarily a UI language, exactly where’d you want proper unicode functionality.\n It’s tempting to argue that normalization and lexical analysis is not part of the basic string type. But these seem like fundamental operations one would want to do with text. If they aren’t included, what exactly is the purpose of the string type?\n  I encourage you to run such tests in your favourite language. If you are doing work with international text it is vital that you understand what your ‘string’ type is actually doing. Once you’ve run this you should reconsider what your “string” type is actually doing for you. In my opinion they’re all broken.\n I admit the correct answer is not always clear. Text processing is a difficult topic, and at the very minimum we’d have to cover grapheme clusters (some string classes expose functionality relating to this, and Perl even has a GCString class). This is beyond the scope of this article, but very relevant for a good string type.\n The point I made in my previous article becomes more poignant. I’d rather have an array of characters than a broken string class. I don’t put any false expectations on an array of characters: the results it produces for the above tests are very logical. Indeed, an array of unicode characters performs better on these tests than many of the specialized string classes.", "posttime": "2021-06-23 10:01:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字符串,type", "title": "字符串类型已打破（2013） ", "title_en": "The string type is broken (2013)", "transed": 1, "url": "https://mortoray.com/2013/11/27/the-string-type-is-broken/", "via": "", "real_tags": ["字符串", "type"]}, {"category": "", "categoryclass": "", "imagename": "f9e875478a46c0c63032e3ad14e54496.png", "infoid": 1067618, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n第二和第三栏显示弓形虫病的患病率和患病率调整为22年的标准年龄，以占各国跨越育种（第1栏）的生育年龄的变化（第1栏）的变化adj = 1-（1-pevalience）∧（22 /生育年龄）  。第5栏显示该研究的年份，第6栏显示样品中的女性数量。对于马其顿，2004年，谁没有任何数据无法获得，因此在我们的数据集中不包含在30世纪欧洲国家。\n 在大多数人类群体中，寄生虫血液升迁随着年龄而增加，可能因性别而有所不同[94]。寄生虫的地磁抑制性的延伸变异可能是由于局部雨季的（因为卵囊在潮湿条件下寿命更长），低空地区（特别是在中纬度地区）;动物们在动物中也报告了北南·塞普朗梯度。\n 免疫抑制患者的弓形虫病患者高估，例如感染人类免疫缺陷病毒（HIV）的患者，以及用免疫抑制剂治疗的移植或癌症患者，。\n 可能指出的是，用于获得流行数据的不同血清学方法不是标准化的，并且在灵敏度，特异性和预测值中变化。结果，即使在同一实验室中进行，也没有两种测试在所有情况下产生相同的结果。\n T.Gondii菌株是高度多样化的，但只有几个谱系被广泛传播。寄生虫的不同基因型显示出致病性和药物敏感性的巨大多样性。也检测到一些非典型菌株。在欧洲，北美和非洲，有三种主导的克隆谱系叫做I型（RH，GT1，演员），II型（ME49，WIL，HART）和III型（VEG，MOO，SOU）以及许多不同的非典型基因型，其患病率不同，毒力，敌人内部的侵害能力以及转化为Bradyzoite囊晶型的能力 - 。寄生虫的不同菌株诱导不同的细胞因子反应，从而引发宿主中各种临床和生化干扰的发展，包括调节宿主细胞蛋白质组。喂养的小鼠少至1只卵囊的血清血清型I和几种非典型菌株在接种后21天内死于急性毒素病，而某些T.Gondii II型，和III菌株较低。在北美，寄生虫血清型II和NE-II导致先天性毒素病，而出生时疾病的早产和严重程度与Coccidian Ne-II血清型有关。该血清型也与农村居住，较低的社会经济地位和西班牙裔民族相关联（P＆lt; 0.01-0.001）。南美洲和非洲发现了各种基因型，而非在北美和欧洲，这表明在这些大陆的寄生虫中的性复制比世界任何其他地方更频繁地发生。由于T.Gondii，这种遗传分歧可能导致血清阳性和眼部疾病的患病率较高，如巴西南部南肿瘤病和毒素诱导的眼病的患病率更高。\n 通过摄入或与感染的猫的粪便接触或通过从母体传递到胎儿来感染动物感染动物。在人类中，猫是感染的主要来源（与粪便接触），但其他宠物也可以是次级感染源[3]，[112]。北极地区弓形虫病的SEROPREVALING证明了T.Gondii可以在没有猫的情况下茁壮成长[113]。\n 与受感染的动物，尤其是猪肉的生肉，是一些国家的一种更重要的人类感染来源，如波兰，其中大多数猪，牛和绵羊（约80％）对T.Gondii的阳性进行阳性[8 ]，。寄生虫的传播也可以通过饮用城市/井下无铅和含有卵囊的未燃烧的水，暴露于污染的土壤，污染的牛奶，在鹬，凝血性，食用生成或未煮熟的肉类，特别是鹿肉或兔子，原料牡蛎的污染物。 ，蛤蜊或贻贝，未洗过的未洗过的未洗过的生水果和蔬菜污染的卵母细胞，输血 - ，血液细胞的母体胎儿通过（包括胎盘滋养细胞）[123]，固体器官同种异体移植物，骨髓移植，同种异体茎细胞移植，痰，母乳和精液（因此，可能通过阴道和口腔性别传播感染，显着从被动性伴侣的血清阳性比反之亦然（p <0.001）[133]）。卫生差，社会经济地位较低，教育较低，以及暴露于某些T.Gondii菌株也可能导致更高的感染率。 \nWarning: Can only detect less than 5000 characters\n在文献中，大多数弓形虫病患病率（Seroprevalencess）数据仅适用于生育年龄的女性。因此，为此人口收集的所有可用数据主要在1995  -  2008年间出版;最终数据库是从88个国家（29个欧洲）获得的。当特定国家提供多于一个对弓形虫病患病率的估计时，我们优先于1998  -  2004年间进行的多中心研究。当研究发表了不同地区或不同年份的不同流行数据时，我们计算了一个未加权的算术平均值。将获得的数据调整为22岁的标准年龄22岁，以消除不同国家在各个国家的不同生育年龄引起的患病率的差异，尤其是Mudhakar Dama）使用公式：\n 除部分KENDALL相关试验外的所有统计测试是用SPSS 21和Statistica 10.0独立进行的。使用非参数局部kEndall相关试验计算初十次肿瘤症估计和特异性疾病负担之间的弓形虫和特异性疾病负担的关联[326]，人均国内生产总值（GDP）为协变量。因为用一般线性模型（GLM）方法进行的类似分析的结果具有定性地相同，因此GLM数据主要解释在本研究的讨论部分中。然而，GLM对数据质量更敏感（例如，对异常值的存在和数据的非高斯分布等），它可以控制多个协变量。在目前的分析中，我们在http://data.worldbank.ord/indicator/ny.gdp.pcap.cd上提供的数据控制了特定国家的GDP，地理纬度和年均相对湿度的年平均值（访问10.12。2013）和http://www.climatemps.com/（访问2.4。2013）。然而，没有进行多种测试的正式校正，但显着效果的分数在很大程度上超过了每100个测试的5个假阳性结果的理论值。\n 协会的医学重要性表示为回归系数'B'，回归线的斜率。 B的绝对值越高，预测器变量的正面或负面影响越大（此处的弓形虫病的患病率）\n...... ", "note_en": "This is an open-access article distributed under the terms of the Creative Commons Public Domain declaration, which stipulates that, once placed in the public domain, this work may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose.\n  Toxoplasmosis is becoming a global health hazard as it infects 30–50% of the world human population. Clinically, the life-long presence of the parasite in tissues of a majority of infected individuals is usually considered asymptomatic. However, a number of studies show that this ‘asymptomatic infection’ may also lead to development of other human pathologies.\n The purpose of the study was to collect available geoepidemiological data on seroprevalence of toxoplasmosis and search for its relationship with mortality and disability rates in different countries.\n Prevalence data published between 1995–2008 for women in child-bearing age were collected for 88 countries (29 European). The association between prevalence of toxoplasmosis and specific disease burden estimated with age-standardized Disability Adjusted Life Year (DALY) or with mortality, was calculated using General Linear Method with Gross Domestic Product per capita (GDP), geolatitude and humidity as covariates, and also using nonparametric partial Kendall correlation test with GDP as a covariate. The prevalence of toxoplasmosis correlated with specific disease burden in particular countries explaining 23% of variability in disease burden in Europe. The analyses revealed that for example, DALY of 23 of 128 analyzed diseases and disease categories on the WHO list showed correlations (18 positive, 5 negative) with prevalence of toxoplasmosis and another 12 diseases showed positive trends (p&lt;0.1). For several obtained significant correlations between the seroprevalence of toxoplasmosis and specific diseases/clinical entities, possible pathophysiological, biochemical and molecular explanations are presented.\n The seroprevalence of toxoplasmosis correlated with various disease burden. Statistical associations does not necessarily mean causality. The precautionary principle suggests however that possible role of toxoplasmosis as a triggering factor responsible for development of several clinical entities deserves much more attention and financial support both in everyday medical practice and future clinical research.\n Toxoplasmosis, a disease caused by the obligate apicomplexan intracellular protozoan  Toxoplasma gondii, is one of the world&#39;s most common parasites infecting most genera of warm-blooded animals (more than 30 species of birds and 300 species of mammals). It is the most prevalent infection in humans (estimated to be 30–50% of the world population), more than latent tuberculosis which infects about one-third of the human population (WHO,  www.who.int/entity/tb/publications/2009/tbfactsheet_2009update_one_page.pdf, accessed July 2013). The definitive hosts are representatives of the felid (cat) family. Nicolle and Manceaux (1908) first observed the parasites in the blood and tissues of a North African rodent,  Ctenodactylus gondii, and named it  Toxoplasma (arclike form)  gondii (after the rodent host)  [1]. There are three infective stages of  T. gondii: a) a rapidly dividing invasive tachyzoite; b) a slowly dividing bradyzoite in tissue cysts, which can persist inside human cells for protracted periods; and c) an environmental stage, the sporozoite, protected inside an oocyst. The oocysts, remarkably stable environmentally, are transmitted to other hosts through inadvertent ingestion.\n Seroprevalence is a measure of the accumulated exposure during a person&#39;s lifetime in a particular social setting. Most of the more than one third of the world&#39;s human population who are infected with  T. gondii remain asymptomatic because the immune system usually keeps the parasite from causing illness. Chronic, usually lifelong, infection with  Toxoplasma that is not accompanied with overt clinical symptoms of toxoplasmosis disease is termed latent toxoplasmosis while chronic infection associated with continuous or recurrent clinical symptoms is termed chronic toxoplasmosis (this form of disease is relatively rare in Europe and Northern America). Worldwide seroprevalence of the parasite measured by specific anti- Toxoplasma IgG antibodies varies between 1% and 100% depending on the environmental and socioeconomic conditions, including eating habits and health-related practices  – , general level of hygiene, host susceptibility, geographical location (geolatitude) and humidity of the soil. The incidence of infection is higher in warmer and humid climates and increases with age  . The lowest seroprevalence (∼1%) was found in some countries in the Far East and the highest (&gt;90%) in some parts of European and South American countries. In the United States, the Centers for Disease Control and Prevention (CDC) reported an overall seroprevalence of 11% [National Health and Nutritional Examination Survey between 1999 and 2004]; another survey reported a higher number (22.5%)  . Nevertheless, toxoplasmosis is one of the leading causes of death attributed to foodborne illness  . In European countries, the prevalence ranges between 10% to 60%, and in some regions as high as 90%  [8]. In one study, 84% of pregnant women had serum antibodies against the parasite  [3]. Data from 88 countries are presented in   Table 1; most of the published data on seroprevalence are in women of childbearing age and/or those who are pregnant.\n The second and third column show prevalence of toxoplasmosis and prevalence adjusted to a standard age of 22 years to account for variation in childbearing age in across countries (column 1) using the formula Prevalence adj = 1−(1−Prevalence)∧(22/childbearing age)  . Column 5 shows year(s) when the study was performed and column 6 shows number of women in the sample. For Macedonia, the 2004 WHO data were not available therefore this 30 th European country was not included in our data set.\n In the majority of the human populations, the parasite seroprevalence increases with age, and may vary by gender  ,  [94]. Latitudinal variability in the geoseroprevalence of the parasite may be due to local rainy conditions (because oocysts live longer in humid conditions), and low altitude regions (especially at mid-latitudes); a north-south seroprevalence gradient has also been reported in animals  ,  ,  .\n The seroprevalence of toxoplasmosis is high in immunocompromised patients, such as those infected with human immunodeficiency virus (HIV), and transplant or cancer patients treated with immunosuppressive agents  ,  ,  .\n It may be pointed out that the different serological methods used to obtain prevalence data are not standardized, and vary in sensitivity, specificity, and predictive values. As a consequence, no two tests produce the same results in all cases, even when carried out in the same laboratory  .\n T. gondii strains are highly diverse but only a few lineages are widely spread. Different genotypes of the parasite show great diversity in pathogenicity and drug sensitivity. Some atypical strains have also been detected. In Europe, North America, and Africa, there are three dominant clonal lineages of  T. gondii called type I (RH, GT1,CAST), type II (ME49, WIL, HART), and type III (VEG, MOO, SOU), as well as many atypical genotypes which differ in prevalence, virulence, migratory capacity within the host, and ability to convert to the bradyzoite cyst phase  – . Different strains of the parasite induce different cytokine responses  , thus triggering development of various clinical and biochemical disturbances in the host, including modulation of the host cell proteome  ,  . Mice fed as few as 1 oocyst of  T. gondii serotype I and several atypical strains died of acute toxoplasmosis within 21 days post inoculation, while some  T. gondii type II, and III strains were less virulent  . In North America, the parasite serotype II and NE-II causes congenital toxoplasmosis, while prematurity and severity of disease at birth was associated with the coccidian NE-II serotype  . This serotype was also associated with rural residence, lower socioeconomic status and Hispanic ethnicity (P&lt;0.01–0.001)  . A greater variety of genotypes are found in South America and Africa than in North America and Europe  ,  , suggesting that in these continents sexual replication of the parasite occurs more frequently than in any other part of the world  . This genetic divergence may contribute to the higher prevalence of seropositivity and ocular disease due to  T. gondii, as exemplified by the higher prevalence of toxoplasmosis and  Toxoplasma-induced eye disease in southern Brazil than in any other part of the world  .\n Animals are infected by eating infected animals, by ingestion of or coming in contact with feces of an infected cat, or by transmission from mother to fetus. In humans, cats are the primary source of infection (contact with fecal material), but other pets may also be the secondary source of infection  [3],  ,  [112]. The seroprevalence of toxoplasmosis in the Arctic region proves that  T. gondii can thrive in the absence of cats  [113].\n Contact with raw meat of infected animals, especially pork, is a more significant source of human infections in some countries, such as in Poland, where the majority of pigs, cattle and sheep (approximately 80%) test positive for  T. gondii [8],  . Transmission of the parasite can also occur by drinking municipal/well unboiled and unbottled water containing oocysts, exposure to contaminated soil, contaminated milk, exposure of children playing in sandpits, geophagia  ,  , eating raw or undercooked meat, especially venison   or rabbits  , raw oysters, clams, or mussels  , consumption of unwashed raw fruits and vegetables contaminated with the oocytes  , blood transfusion  – , maternal-fetal passage of blood cells (including placental trophoblasts)  [123],  , solid organ allografts  ,  , bone marrow transplantation  , allogeneic stem cell transplantation  , sputum  , breast milk  ,  , and semen   (thus, probably the infection may be transmitted via both vaginal and oral sex, significantly more frequently from seropositive to passive sex partner than vice-versa (P&lt;0.001)  [133]). Poor hygiene, lower socioeconomic status and less education, as well as exposure to certain strains of  T. gondii may also contribute to a higher rate of infection  .\n T. gondii is remarkable in its ability to invade a wide variety of host cells. Invasion is an active process relying on parasite motility and the sequential secretion of proteins from secretory organelles, the micronemes, rhoptries, and the dense granules.  T. gondii can invade and multiply inside any nucleated cell type including epithelial cells and blood leukocytes  . A preference to infect and multiply inside myeloid cells  in vitro has also been reported  , and several studies in mice indicate that the dendritic cells as well as monocytes/macrophages function as systemic parasite transporters (“Trojan horses”) during infection  – . The parasite can be transmitted from infected dendritic cells to NK cells  , and thus, low levels of NK cells found in pregnant women may suggest transmission of the parasite  . Differential infectivity and division rate of intracellular tachyzoites in human peripheral blood leukocytes and other primary human cells  in vitro has been demonstrated depending on the cell characteristics  .\n It is believed that the majority of immunocompetent individuals infected with  T.  gondii remain asymptomatic or have a subclinical course with minor symptoms  . It is nevertheless the most common food-borne parasitic infection requiring hospital treatment  , and the third most common cause of hospitalization due to food-borne infection  . Both competent and immunocompromised persons can develop the disease, especially retinochoroiditis (ocular toxoplasmosis)  ,  ,  . In non-pregnant immunocompetent adults, acute disease may also lead to impaired eye sight  ,  . For example, in the United States, one million new infections occur each year, which result in approximately 20 000 cases of retinal pathology  . Primary infection in pregnant women is a matter of great concern, since it can be transmitted to the fetus leading to spontaneous abortion or stillbirth. A newborn exposed to  T. gondii in utero may develop congenital toxoplasmosis with major ocular and neurological consequences. In immunosuppressed (HIV, organ transplant or cancer) patients, the infection can lead to life-threatening cerebral toxoplasmosis  ,  ,  .\n Symptomatic infection with the parasite can be categorized into four groups: 1) cervical lymphadenopathy, headache, fever, sore throat, and myalgia, with possibility of splenomegaly and brief erythematous (maculopapular) rash; 2) typhus-like exanthematous form with myocarditis, meningoencephalitis, atypical pneumonia and possibly death; 3) retinochoroiditis, which may be severe, requiring enucleation; and 4) central nervous system involvement  [153]. In addition, several reports suggest that  T. gondii infection may be responsible for additional wide range of symptoms, and development of several clinical entities (summarized in   Table 2).\n  Some of the clinical manifestations of  T. gondii infection may be as a result of extensive interaction of the pathogen with approximately 3000 host genes or proteins possibly because of frequent host/pathogen antigen homology that disrupts/creates/triggers host specific metabolic pathways, and finally contributes to the development of endophenotypes of different diseases  . The parasite and concomitant viral and/or bacterial infections scavenge important metabolites from host cells and/or donate other compounds to the host causing unwanted effects. In addition,  T. gondii-derived autoantibodies also play an important role in the pathology associated with the parasite  .\n Due to the fact that  T. gondii infection is omnipresent and associated with development of many pathologies in humans and animals, including the disease burden of congenital toxoplasmosis, as represented by disability-adjusted life years (DALY) being the highest among all foodborne pathogens  , the purpose of this work was to collectively evaluate available geoepidemiological data on the parasite worldwide national seroprevalence variations and their relationship with mortality and disability rates. In the analyses, gross domestic product (GDP)  per capita as a covariate was used because earlier it was argued and demonstrated that culture-level correlations need to be controlled for regional socioeconomic parameters  ,  ,  . If possible (i.e. in multivariate GLM analyses), two potential confounding variables that could strongly influence both the survival of  Toxoplasma oocysts in soil and a course of various diseases, namely the average latitude (proxy for temperature) and the average relative humidity of particular countries have also been included into the statistical models. In this study we found many positive and some negative associations between the prevalence of toxoplasmosis and various diseases burdens. The number and strength of these associations were much higher than could be expected by chance. Still, it must be emphasized that statistical association does not mean causality. Based on the finding of a statistical association between two phenomena, one cannot determine which of them is the cause and which is the effect – in other words, whether event A causes event B, or whether event B causes event A. Not only we are unable to determine whether event A causes B, or B causes A, but sometimes there is an (unknown) event C that causes both A and B. Therefore, all effects observed in the present exploratory study as well as all suggested biological or medical interpretations must be considered just as potential stimuli for the next, more focused research (search for unknown confounders and for independent evidence) that must follow.\n The data on disease burden, mortality and Disability Adjusted Life Year (DALY), were obtained from the table “Mortality and Burden of Diseases Estimates for WHO Member States in 2004” published by WHO  [323] and available at:  www.who.int/evidence/bod. The publication can be downloaded from the website:  http://www.who.int/healthinfo/global_burden_disease/2004_report_update/en/index.html; accessed July 2013). Summary tables present the best estimates of WHO – based on the evidence available in mid-2008 – rather than from the official estimates of Member States.  Methods and data sources are summarized in the Annexes of the “Global burden of disease: 2004 update”  [323], and the methodology used is described in more details elsewhere  [324]; also available at:  http://www.dcp2.org/pubs/GBD; accessed July 2013.\n The Disability Adjusted Life Year (DALY) has been defined  [323] as “a health gap measure that extends the concept of potential years of life lost due to premature death and also to include equivalent years of ‘healthy’ life lost by virtue of being in a state of poor health or disability.” Thus, the DALY combines in one measure the time lived with disability and the time lost due to premature mortality. One DALY can be thought of as one lost year of ‘healthy’ life, while the ‘burden of disease’ as a measure of the gap between current health status and an ideal situation where everyone lives into old age free of disease and disability. The method of calculation of age-standardized DALY has been described earlier  [323].\n In the literature, most of toxoplasmosis prevalence (seroprevalence) data are available only for women in childbearing age. Therefore, all available data collected for this population were published mostly between 1995–2008; the final database was obtained from 88 countries (29 European). When more than one estimation of prevalence of toxoplasmosis was available for a particular country, we gave priority to multicenter studies performed between 1998–2004. When the studies published different prevalence data for various regions or different years we calculated an unweighted arithmetic mean. The obtained data were adjusted to a standard age 22 years to eliminate differences in prevalence caused by different childbearing ages in various countries   were kindly provided by Mudhakar Dama) using the formula:\n All statistical tests except partial Kendall correlation test were performed independently with SPSS 21 and Statistica 10.0. The association between seroprevalence of toxoplasmosis and specific disease burden estimated with age standardized DALY was calculated using nonparametric partial Kendall correlation test  [326],   with Gross Domestic Product per capita (GDP) as covariate. Because the results of similar analyses performed with the General Linear Model (GLM) method were qualitatively the same, GLM data were primarily interpreted in the Discussion section of present study. The GLM is more sensitive for the quality of data (e.g. to presence of outliers and non-Gaussian distribution of data, etc.), however, it enables to control for more than one covariate. In the present analysis, we controlled for GDP, geographical latitude and annual mean of relative humidity of particular countries using data available at  http://data.worldbank.org/indicator/NY.GDP.PCAP.CD (accessed 10.12. 2013) and  http://www.climatemps.com/ (accessed 2.4. 2013). No formal corrections for multiple tests were carried out, however, the fraction of significant results largely exceeded a theoretical value of 5 false positive results per 100 tests.\n The medical importance of the association was expressed as regression coefficient ‘B’, the slope of the regression line. The higher is the absolute value of B the greater is the positive or negative impact of the predictor variable (here prevalence of toxoplasmosis)\n......", "posttime": "2021-06-23 10:00:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全球,global,数据", "title": "弓形虫病 - 全球威胁 ", "title_en": "Toxoplasmosis – A Global Threat", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3963851/", "via": "", "real_tags": ["全球", "global", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想法是难以捉摸的，湿滑的东西。最好地保留纸上的纸和铅笔在床边，所以你可以在休息前的夜晚刺伤它们。\n   用笔的写作是你在学校学习的第一个技能。它也是您在生活中学到的最重要的技能之一，因为写作使您能够录制您的想法并将其发送给另一个人。您的思想可能会影响一个人的距离千公里，甚至在未来数百年。录音思想是我们有史以来最强大的技术。没有写作，好吧，有任何人类文明。写作是在这里留下来，所以我们可能会看看我们如何改进它。\n 看看人们经常做的一种特定写作模式。您有一个问题可以表示为代数表达式。例如，您是一个木匠，您想知道一块木材的一块木头，13厘米1米。或者，如果1kg为2.44欧元，您希望了解3公里的香蕉价格。或者您想知道您在10年以上1000欧元和3.5％的年度增长时有多少钱。这是您可以使用钢笔和纸张的基本数学，而无需使用计算器。但是，计算器与笔和纸相同的工具，因为您可以通过自动化镗孔件更快地思考。好的，所以请看看这个工作流程的一些具体例子：\n  您写下表达式，然后您必须在计算器中键入它。您＆＃39; ll可能通过写下部分结果并在计算器中键入它们以获得最终结果。这是一种缓慢的过程，可以通过使用括号计算器来缓解 - 您将表达式逐个字符重新键入，并且您有答案。如今人们不要真正携带物理计算器，但我们有更强大的东西 - 一台电脑。计算机有许多形式 - 一个可以是一个带有触摸屏的手持式计算器，您可以用钢笔和纸张使用，以解决我们的数学问题。或者你知道，用笔和纸是计算机的。\n  所以让＆＃39; s再次写下我们的问题。这次拥有我们心爱的工具的现代版本。\n  我们有黑纸和白色墨水。这种创新！但它看起来与我们的第一次尝试相同。即使我们使用电脑笔和纸张，新媒体也与5000岁的行为相同。由于机器学习，计算机现在能够理解我们的笔迹，所以我们可以增强我们的笔和纸张才能聪明！\n  正如你所看到的，这是＆＃39; t伟大。转录的文本具有错误。我们试图在一次拍摄和手写看起来丑陋，所以识别结果是＆＃39; t一样好。也许如果我们尝试用块写它，我们可能会弄错。 \n在计算机上输入文本通常是用地毯导航完成的 - 闪烁的垂直线指定插入点 - 如果按键盘上的一封信，它将插入该位置。通过这种模式，我们将在不同的输入系统中混合 - 键盘 - 进入我们的笔和纸土地，但至少我们可以编写我们想要的东西......但是我们丢失了手写思想的原始形式，我们只留下了印刷人物。我们可以做得更好。\n  这比前一个更好的经历。我们具有同一时间的陈述 - 原始手写形式，也是在每个行程后生成的印刷形式。即使在涂鸦期间有很多计算，我们仍然不知道我们的数学问题的答案。所以，让＆＃39;试试一次。\n  最后，这是 - 我们拥有我们需要的一切。我们有我们的原始涂鸦，它被翻译成了打印的字母。最重要的是，计算机认识到它是一个代数公式和突出显示的数字和具有不同颜色的运算符。不仅是印刷人物，还有单独的笔画。沿着涂鸦，我们的公式评估了整个时间。一旦我们完成了最后一次卒中我们的问题陈述，我们已经解决了解决方案。\n   这种新的纸张了解你正在写的东西，并试图聪明地了解你想要什么。那可以做些什么？\n 它知道不在键盘上的字形，例如：÷Σ⨂∴→←‽β\n    它有单元转换内置，所以3km÷26m将评估为4.62km / h，还可以要求m / s\n 它知道所有功能（SIN，COS，LOG，POW等），所有常量（π，ℏ等），所有有用的公式 \n它可以显示图形，如图形，绘图，图表，图像甚至是化学化合物的交互式球棒模型\n 它是可编程的，即，您可以使用递归，条件和循环编写自己的函数\n 总之，它可以做到很多，不仅有助于简单的数学问题，但它对每个科学领域都有真正的影响。然而，它有一个致命的缺陷 - 它尚不存在。存在各种技术，但它们尚未结合到这种新的变革媒体中。\n 在Wolfram Mathematica中存在特征列表中提到的计算能力。 Mathematica是一种虚弱的软件，有没有对此有疑问。然而，它具有其表面形式，即编程语言，专为键盘输入法设计。几乎所有用于编程计算机的语言都是为键盘设计的，因为键盘早期成为计算机的标准部分。\n 在丰富的计算机科学历史中，已经有许多有趣的实验，从未来被盗。其中一个是兰德平板电脑。在这里，您可以看到这款技术奇迹的完整演示。\n  它可以显示和编辑图表以及程序的源代码。而且没有任何键盘附带的键盘！当然有一些东西明显错了。例如，笔和屏幕的表面是分开的。这是其前身素描平板的降级，即使今天看起来像外星技术。\n  Sketchpad没有手写识别。所有文本输入由键盘完成。如果你问我，错过了机会。但Sketchpad开始了一个名为计算机辅助设计的革命，它支持强大的图形能力和直接操纵内容。今天的CAD系统具有很好的软件，但他们正在廉价的笔和纸倒坡 - 桌面电脑，带键盘和鼠标。 \n兰德平板电脑有手写识别，这是基于聪明的启发式，即没有机器学习，并且它需要人写得略有不同，而不是通常用笔和纸写略有不同。正如你在演示中所见，文本编辑是可取的，所以它不是这样的问题。但是，如果您密切关注文本的含义，则可以看到它是一个汇编语言。那是一个问题。组装设计用于键盘输入，因此用笔编辑它必须感受到奇怪和不生产。\n 这让我们解决了问题：是否有任何用于笔和纸的编程语言？是的，有。编程语言，也称为APL。一种始于作为计算机程序的人类通信所设计的一种语言，用笔在纸上写的粉笔，或在黑板上粉笔。要公平，甚至APL甚至遭遇了从黑板到键盘的过渡。原始符号具有子/上标，程序的流量被描绘为线条。当APL成为一种编程语言时，它是线性化的，丢失了它的流程图，似乎是视觉的，但保持其异国情调的字形。这是可以使用可以打印这些字符的特殊键盘和打印机。 （ 来源）\n 除了其他编程语言之外的APL是什么，它是它的高度统一设计。它是一个面向数组的语言 - 它将数组作为一流的构造。操作array.Map您可以从功能编程中所知的APL中隐含。将1添加到数字数组与添加1到一个数字相同。该阵列的方向和表示的符号最终导致了比该时代的其他语言更高的操作语义。今天，有一个APL的APL语言，但社区相当小而分开。一些APL思路将历史归因于现代张量/阵列导向的可分辨率编程，例如Pytorch，计算机可以学习识别您的笔迹。\n  似乎笔和纸将终于获得工作中的应得的计算升级很长一段时间。这很好，因为它仍然是最伟大的媒体。但是仍有一百万个问题被要求正确地设计它。是否有一个终极符号，可以从儿童到咒骂大师？如果这个新媒体的互动和语言应该在学校进行标准化和教导？如果孩子们从一开始使用可微分程序，会发生什么？我们如何确保媒体积极主动地教此人？用户之间的简单合作是否足够？我还有＆＃39;还有这些答案。但我会尝试通过使这种新的纸张成为现实来揭开它们。\n 下一篇文章将介绍如何使用Google Colab，Pytorch，Coreml工具和Swift进行离线手机识别的应用程序。 ", "note_en": "Ideas are elusive, slippery things. Best to keep a pad of paper and a pencil at your bedside, so you can stab them during the night before they get away.\n   Writing with pen is the first skill you learn in school. It is also one of the most important skills you learn in life, because writing enables you to  record your thoughts and send them to another human. Your thought may effect a person that is thousands of kilometres away, and even hundreds years in the future. Recording thoughts is the most powerful technology our civilization ever created. And without writing, well, there wouldn&#39;t be any human civilization. Writing is here to stay, so we might look at  how we can improve it.\n Let&#39;s look at one specific mode of writing that people often do. You have a problem that can be expressed as an  algebraic expression. For example you are a carpenter and you want to know volume of piece of wood that is 13cm by 13cm by 1m. Or you want to know price of 3kg of bananas if 1kg is for 2.44€. Or you want to know how much money you&#39;ll have in 10 years when you start with 1000€ and 3.5% annual growth. This is  basic math that you can do with  pen and paper without even using a calculator. However, calculator is equally useful tool as pen and paper because you can think faster by  automating the boring parts. Okay, so let&#39;s look at some concrete example of this workflow:\n  You write down the expression and then you have to  type it in the calculator. You&#39;ll probably do it by writing down  partial results and typing them in the calculator to get the final result. This is a slow process that can be eased by using calculator with parentheses – you retype the expression  char-by-char and you have your answer. Nowadays people don&#39;t really carry around physical calculators, but we have something  more powerful – a computer. Computers have  many forms – one can be a handheld calculator with touchscreen, which you could use in tandem with pen and paper to solve our math problem. Or you know, use  pen and paper that  are computers.\n  So let&#39;s write our problem again. This time with  modern versions of our beloved tools.\n  We have black paper and white ink. Such innovation! But it  looks identical as our first try. Even though we use computerized pen and paper, the new medium acts the same way as one that is 5000 years old. Thanks to  machine learning, computers are now able to  understand our handwriting, so we can enhance our pen and paper to be  smart!\n  As you can see, this isn&#39;t great. The transcribed text has  errors. We tried to write it in  one shot and the handwriting looks ugly, so the recognition result wasn&#39;t as good. Maybe if we try to  write it by chunks, we might get it right.\n  Entering text on computer is usually done with  caret navigation – a  blinking vertical line designates an  insertion point – if you press a letter on a keyboard, it will be inserted at that position. With this mode we are  mixing in different input system –  keyboard – into our pen and paper land, but at least we can write what we wanted... However we lost the original form of our handwritten thought and we are left only with printed characters. We can do a bit better.\n  This was much  better experience than the previous one. And we have  both representations at the same time – original handwritten form, and also derived printed form that was  generated after each stroke. Even though there was a lot of computation going on during the scribbling, we still  don&#39;t know the answer of our math  question. So let&#39;s try one more time.\n  Finally, this is it —  we have everything we need. We have our  original scribbles, which get translated into  printed letters. On top of that, the computer recognized it is an algebraic formula and  highlighted numbers and operators with  different colors. Not only printed characters, but also individual  strokes. And along the scribbling, we had formula evaluated the whole time. As soon as we  finished last stroke on our problem statement, we already  had the solution.\n   This new kind of paper  understands what you are writing and try to be smart about  what you want. So what can it do?\n it knows  glyphs that are  not on your keyboard, such as these:  ÷ ∑ ⨂ ∴ → ← ‽ β\n    it has  unit conversion built in, so  3km ÷ 26m will be evaluated to  4.62km/h, and also you can ask for  m/s\n it knows all  functions ( sin,  cos,  log,  pow, etc.), all  constants (π, ℏ, etc.), all useful  formulas\n it can  display graphics such as graphs, plots, diagrams, images or even  interactive ball-and-stick model of a chemical compound\n it is  programmable, i.e. you can write your own functions with  recursion,  conditionals and  loops\n In summary, it can do  a lot and it is  useful not only for simple math problems, but it has a real impact on  every scientific field. However it has  one fatal flaw – it doesn&#39;t exist yet. Various pieces of the tech exist, but they are not yet combined into this new  transformative medium.\n Computational capabilities that were mentioned in the feature list exist in  Wolfram Mathematica. Mathematica is a phenomenal piece of software, there isn&#39;t a single doubt about that. However it has its surface form, i.e. the  programming language, designed for a keyboard input method. Almost all languages for programming computers were  designed for keyboards because keyboards become standard part of computers early on.\n In the rich history of computer science there have been many  interesting experiments that were stolen straight from the  future. One of them was  RAND Tablet. Here you can see a full  demo of this marvel of technology.\n  It can  display and edit charts and also  source code of a program. And all  without any keyboard attached to it! Of course there are a few things that are plainly  wrong. For example, the surface for the pen and screen are separate. This was a downgrade from its predecessor,  Sketchpad, which even today looks like an  alien technology.\n  Sketchpad didn&#39;t have handwriting recognition. All textual input was done by a  keyboard. A  missed opportunity if you ask me. But Sketchpad started a  revolution named  Computer-aided design, which stood on strong graphical capabilities and direct manipulation of the content. Todays CAD systems have great software, but they are running on a  cheap knockoff of pen and paper – desktop computer with a keyboard and a mouse.\n RAND Tablet had  handwriting recognition that was based on  clever heuristic, i.e.  no machine learning, and it required person to write slightly different than it would normally write with a pen and paper. As you have seen in the demo, the text editing was  usuable, so it wasn&#39;t such a problem. However, if you paid close attention to the meaning of the text, you could see that it was  an assembly language. And that  was a problem. Assembly was designed for keyboard input, so editing it with a pen must have felt  weird and unproductive.\n This gets us to the question:  Are there any programming languages that were designed for pen and paper? Yes, there was.  A Programming Language, also known as  APL. A language that started as a  notation that was designed for  human-to-human communication of computer programs, usualy written with pen on a paper, or  chalk on a blackboard. To be fair, even APL suffered the  transition from blackboard to keyboard. Original notation had sub-/superscripts and flow of the program was depicted with lines. When APL became a programming language, it was  linearized, lost its flowchart-like visual, but kept its  exotic glyphs. This was possible by using a  special keyboard and printer that could print those characters. ( source)\n What set APL aside from other programming languages was its overal  unified design. It was an array-oriented language – it had the array as a first-class construct. Operation  Array.map that you may know from functional programming was  implicit in APL. Adding 1 to an array of numbers was  same as adding 1 to one number. This array-orientation and  tersness of the notation ultimately led to a much  higher-level operational semantics than other languages had in that era. Today, there is a family of APL languages, but the community is rather small and divided. Some APL ideas percolated down the history to the  modern tensor/array-oriented differentiable programming, such as  PyTorch, with which a computer can learn to recognize your handwriting.\n  It seems that pen and paper will finally get a deserved computational upgrade that was in the works for quite some time. And that is good because it is still  the greatest medium to think with. But there are still a million questions to be asked on how to  properly design it. Is there the one  ultimate notation that can span from children to sciece gurus? Should the interactions and language of this new medium be standardized and taught in school? What would happen if children would use differentiable programming from the start? How can we ensure that the medium would be  proactive in teaching the person? Would simple  collaboration between its users be enough for it? I don&#39;t have these answers yet. But I will try to uncover them by making this  new kind of paper a reality.\n Next post will describe  how to make an app for  offline handrwiting recognition with Google Colab, PyTorch, CoreML tools and Swift.", "posttime": "2021-06-23 10:00:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新纸,kind", "title": "新纸 ", "title_en": "New Kind of Paper", "transed": 1, "url": "https://mlajtos.mu/posts/new-kind-of-paper", "via": "", "real_tags": ["新纸", "kind"]}, {"category": "", "categoryclass": "", "imagename": "43c5843d5e9acfc5628fb423d622f778.jpg", "infoid": 1067615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我曾经由一款多亿美元，公开交易德国公司联系，该公司希望为他们的新产品系列使用我们的商标。\n 我问他们愿意以换取许可协议提供多少。在下面的回复中，您会看到他们通知我，公司政策禁止他们为此赔偿我，但他们很乐意覆盖合理的法律费用。\n 翻译：他们想用我的商标，他们绝对没有任何回报。\n   这是他们在戒指中有17个月的情况下对东西感到宾夕法尼亚：\n  他们不仅寄给我125,000美元的现金，但我也获得了10年，免版税的许可证答复。在Layman的条款中，这相当于将您的汽车销售到您可以在未来10年免费使用它的条件。\n 有一个古老的格言，说你会擅长你做的最多。我经常用它作为反对坏习惯的警告，但它也适用于技能建设：如果你想要伟大的东西，那么尽可能经常做。\n 我谈判一切，而且，多年来我已经很擅长。有些人为它有一个天然的诀窍，但绝对是一种可以学习的技能。我已经奠定了以下一些最喜欢的提示： \n谈判的最佳时间是在季度结束时 - 六月几天，六月（嘿，现在是现在的），10月和12月。大多数销售代表都是根据季度表演审查的，因此他们希望在季度关闭之前尽可能多的交易。如果您正在续签任何类型的合同，请尝试在本季度末签署文件。\n 值得注意的是，一些公司财政年度与日历年不一样。如果您正在谈判重大合同，请做一些研究，并查看他们的宿舍在哪里。\n  从来没有，曾经提供目标价格。如果一个推销员问你，“你想花多少钱？”你应该回应，“尽可能地得到我需要的东西。”\n 目标价格允许另一方引用您在您愿意花费的价格。感觉就像你得到了一笔交易，但他们可能已经更低了。\n  电子邮件协商更舒适，但它还给了另一个人的时间仔细考虑选择。有人能够告诉你“不”的人更难。\n  在他们第一次提供之后 - “我可以用500美元的价格做这笔交易 - 你只应该用WinCE（亲自）或喘气（在手机上）回复。然后，什么都不说，只是忍受所追随的尴尬。\n 他们很快就会跟进更好的报价 - 有时是多个（“OK，400美元，我可能会每可以每当350美元或低至325美元”）。当你认为他们已经触底了，开始谈判。 \n我经历过数以百计的谈判。如果您从200美元开始，他们从400美元开始，您可能会最终超过300美元。这是奇怪的，但这只是它的工作原理。\n  这个是巨大的。从来没有，永远卖给他们。 “我知道你的产品很棒”或“我看到你有特色x，y和z”是你在谈判中感到不舒服的时候说的。抵制拯救销售人员从尴尬时刻拯救销售人员的诱惑。记住：在开始下降之前，尴尬就是正确的。\n  一旦你已经走了，就会走了，就会以陈述的形式达到最终报价，而不是以问题的形式：“如果你可以做200美元，我今天可以传真这份文书工作。”\n  设置费用几乎总是被免除。您会发现，这些费用中的大部分费用只是公司的额外赚钱者 - 很少有合同需要重要的设置时间。\n   获得1或2个月免费可能会感觉良好，但它通常整体而不是一个很大的交易。 2年合同的第一个月免费储蓄少于5％。让他们降低10％的月度率。\n   从我的错误中吸取教训，不要痴迷于从交易中的每一个百分之一点迷恋 - 特别是如果你将来必须与这个人合作。你想和一个很好的交易走开，但不是为了牺牲对方的感觉，就像他们被带来的那样。\n 一旦您谈判了90％的节省，您认为您可以管理，评估情况并决定是否值得推动。 ", "note_en": "I once was contacted by a multibillion dollar, publicly traded German company that wanted to use one of our trademarks for their new line of products.\n I asked them how much they were willing to offer in exchange for a licensing agreement. In their response below, you’ll see them inform me that company policy prohibits them from compensating me for it, but they’d be happy to cover reasonable legal fees.\n Translation: they wanted to use my trademark and they were offering me absolutely nothing in return.\n   Here’s how they felt about things after 17 months in the ring with yours truly:\n  Not only did they send me a check for $125,000 cash, but I also secured a 10 year, royalty-free license-back agreement. In layman’s terms, that’s the equivalent of selling your car with the condition that you can keep using it for free for the next 10 years.\n There’s an old adage that says you’ll get good at what you do the most. I usually use that as a warning against bad habits, but it also applies to skill building: if you want to be great at something, do it as often as possible.\n I negotiate everything and, as a result, I’ve gotten pretty good at it over the years. Some people have a natural knack for it but it is definitely a skill that can be learned. I’ve laid out some of my favorite tips below:\n  The best time to negotiate is at the end of a quarter – the last few days of March, June (hey, that’s RIGHT NOW), October, and December. Most sales reps are reviewed based on quarterly performance, so they’re looking to lock up as many deals as possible before the quarter closes out. If you’re up for a contract renewal of any sort, try to sign the documents at the end of the quarter.\n It’s worthwhile to note that some companies fiscal year is not the same as a calendar year. If you’re negotiating a major contract, do some research and see where their quarters fall.\n  Never, ever give a target price. If a salesman asks you, “how much are you looking to spend?” you should respond, “as little as possible to get what I need.”\n Target prices allow the other party to quote you a price just below what you’re willing to spend. It feels like you’re getting a deal, but they may have been able to go a lot lower.\n  Email negotiation is more comfortable, but it also gives the other person the time to carefully think about options. It’s also much harder for someone to tell you “no” in person.\n  After they make their first offer – “I can do this deal for $500” – you should reply only with a wince (in person) or a gasp (on the phone). Then, say nothing and just endure the awkwardness that follows.\n They’ll soon follow up with a better offer – sometimes multiple ones (“OK, $400, well I can probably do $350 or as low as $325”). When you think they’ve bottomed out, start negotiating.\n  I’ve been through hundreds of negotiations. If you start at $200 and they start at $400, you’re probably going to end up around $300.  It’s bizarre, but this is just how it works.\n  This one is huge. Never, ever do their selling for them. “I know your product is great” or “I see that you have features x, y, and z” are things that you say when you’re feeling uncomfortable in a negotiation. Resist the temptation to save the salesperson from the awkward moment. Remember: the awkwardness comes right before they start dropping prices.\n  Once you’ve gotten them as far as they’ll go, make your final offer – always in the form of a statement, not in the form of a question: “If you can do $200, I can fax the paperwork today.”\n  Setup fees can almost always be waived. You’ll find that most of these fees are just extra moneymakers for the company – very few contracts require significant setup time.\n   Getting 1 or 2 months free may feel good, but it’s usually not a great deal overall. The first month free on a 2 year contract is less than a 5% savings. Get them to lower the monthly rate by 10% instead.\n   Learn from my mistakes and don’t get obsessed with eking out every last cent from the deal – especially if you’re going to have to be working with this person in the future. You want to walk away with a good deal, but not at the expense of the other person feeling like they got hosed.\n Once you’ve negotiated 90% of the savings you think you can manage, evaluate the situation and decide whether it’s worth it to push further.", "posttime": "2021-06-23 09:59:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谈判,negotiating", "title": "杀手谈判策略（或者，我是如何为没有125,000美元的） ", "title_en": "Killer Negotiating Tactics (or, how I got $125,000 for nothing)", "transed": 1, "url": "https://zackkanter.com/2012/06/27/10-killer-negotiating-tactics-or-how-i-got-125000-for-nothing/", "via": "", "real_tags": ["谈判"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试全数字访问，了解为什么超过100万读者订阅FT  选择购买审判订阅$ 1持续4周，您将在审判结束后每月收费91美元  4周接收无限的优质数字访问FT＆＃39; S值得信赖，获奖的商业新闻  礼品文章 - 每月分享最多10条与家人，朋友和同事 ", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-06-23 09:59:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,google,谷歌,rust,反托拉斯", "title": "欧盟将反托拉斯探针打开到谷歌的广告业务中 ", "title_en": "EU opens antitrust probe into Google’s advertising business", "transed": 1, "url": "https://www.ft.com/content/b8d7bc05-7e58-43f9-b977-47bbbe5802aa", "via": "", "real_tags": ["广告", "google", "谷歌", "rust", "反托拉斯"]}, {"category": "", "categoryclass": "", "imagename": "cea8483a738711ddc5d12f2c7a54a284.jpeg", "infoid": 1067612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伪造 - 最初被称为协调 - 由于对私营公司股票的需求已经崩溃了。该公司于2014年推出，现已完全筹集了2.5亿美元，包括德意志Börse，淡马锡，井法戈，BNP Paribas和慕尼黑Re。它去年收购了比赛竞争对手，以1.6亿美元的现金和股票。据该公司介绍，拘留下的资产现已超过140亿美元。\n Prasad和Ramadurgam  - 谁在2018年帮助聘请Forge Ceo Kelly Rodriques  - 说他们对这一成功感到兴奋。他们仍然拥有公司的股份;他们仍然是非投票的董事会成员。\n  但在罗德里格的任期一开始的伪造的共同主席之后，他们去年初就开始修补了一个新的想法，普拉萨德说，普拉萨德以宽阔的人在私营公司获得私人公司股票。被称为D / XYZ（发音为“DESTINY”），这个想法是为了使任何投资者能够 - 不仅仅是1％ - 投资他们使用和爱的服务的初创公司。\n  不幸的是，这两者并没有提供比现在更多的窗帘raiser，尽管Prasad表明D / XYZ既不是新的基金也不是众筹的车辆。我们收集的也没有出售任何令牌。相反，Prasad暗示在一个全新的产品中，称该公司在公开股票的情况下是谨慎的，因为它首先想要“从监管机构获得进展，并确保我们有明确的市场，”他说。\n 与此同时，这两者筹集了500万美元的种子资金，许多创造者，他喜欢私人公司的父母，朋友，客户，合作伙伴以及喜欢他们建造的人的父母，朋友，客户，合作伙伴更容易。在圆形的参与者中，COINBASE COFOUNDER FRED EHRSAM;格子Cofounder和Ceo Zach Perret; Quora和Expo Cofounder Charlie Cheever;超人创始人和首席执行官Rahul Vohra;和塞奇陈的连环企业家最近成立了一家名为跑道的金融软件公司。\n 至于一些新生的启动竞争最明显的竞争，Prasad听起来不会担心。例如，关于Carta是一个资助的公司，该公司有助于私营公司及其雇员管理和销售其股票及期权，并长期讨论民主化进入私营公司股份的股票，普拉萨德表示，它仍然是一个直接竞争对手伪造的是，既迎于愿意，也是公司，而不是个人。\n  和SPACS，专门的收购公司，将私营公司搬到公众市场上更快，允许（至少在理论上）更多人在早期阶段访问高增长型公司？ Prasad说，这是一个部分解决方案。但他看到它的方式，“Spacs更加反映人们希望人们希望私人科技和最佳选择现在正在向SPAC经理捐款，他们希望能够在两年内合并有前景的公司或者较少的。”他称他们为“抽象层”。 \n当然，如果任何Prasad和Ramadurgam都是成功的话，还有伪造者是敌人的朋友的问题。 他们的技术是否可以销售回他们的第一家公司？ urge来看他们将它们视为对其业务的竞争对手吗？  “我们现在正在做什么并不竞争，”坚持普拉萨德。 “它更拿起我们离开的地幔。 Forge专注于交易，监护，公司解决方案和数据。 它建立了一些呼叫无聊的管道。“ 现在已经竖立了管道，它也有“支持许多其他有趣的事情。”  D / XYZ是否以某种容量与Forge一起使用？ prasad demurs。 “潜在的，”他说。 ", "note_en": "Forge — originally known as Equidate —  has taken off as demand for private company shares has ballooned. The company, launched in 2014, has now raised $250 million altogether, including from, Deutsche Börse, Temasek, Wells Fargo, BNP Paribas, and Munich Re. It acquired rival SharesPost last year for  $160 million in cash and stock. According to the company, it now has more than $14 billion in assets under custody.\n Prasad and Ramadurgam — who helped hire Forge CEO Kelly Rodriques back in 2018 — say they’re excited about that success. They still own a stake in the company; they remain non-voting board members.\n  But after spending 18 months as co-president of Forge at the outset of Rodrigues’s tenure, they left early last year to begin tinkering on a new idea, one that Prasad says is centered around giving a much wider pool of people access to private company shares. Called  D/XYZ (pronounced “Destiny”), the idea is to enable any investor — not just the 1% —  to invest in startups whose services they use and love.\n  Unfortunately, the two aren’t offering much more of a curtain raiser than that right now, though Prasad suggests D/XYZ is neither a new fund nor a crowdfunding vehicle. It’s also not selling any tokens, we gather. Instead, Prasad hints at an entirely new product, saying the company is being cautious in how much it shares publicly because it first wants to “get the go-ahead from regulators, as well as to ensure we have a clear path to market,” he says.\n In the meantime, the two have raised $5 million in seed funding from numerous founders who like the idea of making private company shares easier for their parents, friends, customers, partners, and everyone else who likes what they’re building. Among the round’s participants is Coinbase cofounder Fred Ehrsam; Plaid cofounder and CEO Zach Perret; Quora and Expo cofounder Charlie Cheever; Superhuman founder and CEO Rahul Vohra; and serial entrepreneur Siqi Chen, who most recently founded a finance software company called Runway.\n As for some of the nascent startup’s most obvious competition, Prasad doesn’t sound concerned. Asked, for example, about Carta, a well-funded company that helps private companies and their employees manage and sell their stock and options and that has long talked about democratizing access to private company shares, Prasad says it remains very much a direct competitor instead to Forge given that both cater first and foremost to companies, not individuals.\n  And what of SPACs, the special purpose acquisition companies that are moving private companies onto the public market faster, allowing (at least in theory) more people to access high-growth companies at earlier stages? It’s a partial solution, says Prasad. But the way he sees it, “SPACs are more a reflection that people want late-stage access to private tech and their best option right now is giving money to a SPAC manager who will hopefully find a promising company to merge with in two years or less.” He calls them a “layer of abstraction.”\n Of course, there’s also the question of whether Forge will be a friend of foe if whatever Prasad and Ramadurgam are building succeeds. Could their tech be sold back to their first company? Could Forge come to see them as a rival to its business?\n “What we’re doing now is not competitive,” insists Prasad. “It’s more picking up the mantle where we left off. Forge is focused on trading, custody, company solutions and data. It has built what some call boring plumbing.” Now that the plumbing has been erected, it has “enabled a lot of other interesting things to be built, too.”\n So is D/XYZ working with Forge in some capacity? Prasad demurs. “Potentially,” he says.", "posttime": "2021-06-23 09:21:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,cofounders", "title": "这些Forge Cofounders只是筹集了500万美元的工作，以便在一个新的静止的投资创业公司上工作 ", "title_en": "\n\t\t\t\tThese Forge cofounders just raised $5 million to work on a new, still-stealth investing startup\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/22/these-forge-cofounders-just-raised-5-million-to-work-on-a-new-still-stealth-investing-startup/", "via": "", "real_tags": ["创业"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters", "note_en": "When AMD unveiled &#34;Big Navi&#34;, now known as the Radeon RX 6000 series, the new GPU family brought with it support for Microsoft&#39;s nascent DirectX Ray Tracing. DXR adds photorealistic lighting, reflections and more visual effects to make games that support the technologies look more true to life. However, real-time ray tracing is an intensive task, and high resolution, complex effects can drag frame rates down into unplayable territory even on the most powerful of today&#39;s GPUs. AMD said not to fear though, as it had an upscaling solution in the works that would boost performance, while maintaining high image quality, and now  FidelityFX Super Resolution is here.    The focus of AMD&#39;s FSR is to bring a major framerate boost by intelligently upscaling a lower-resolution input, combined with high-quality, high-resolution graphics to games that need it. The idea of enhanced upscaling isn&#39;t all that dissimilar to the concept behind  NVIDIA&#39;s Deep Learning Super Sampling. At a high level, both technologies render a lower-resolution image and scale it up to a higher resolution for a sharper, more detailed overall image with better frame rates. While FidelityFX Super Resolution goes its own way without vendor lock-in or specialized hardware requirements, comparisons to DLSS 2.0 -- at least from image quality and performance standpoints -- are inevitable. The implementation, however, is wildly different.   First of all, FidelityFX Super Resolution is vendor agnostic and requires no specialized hardware to work its magic. If a GPU can run the necessary compute shaders fast enough, there&#39;s no real technical limitation preventing FSR from being utilized. NVIDIA relied on Turing and Ampere&#39;s tensor cores to accelerate an AI model using temporal and spatial data to weave in detail where it isn&#39;t. The effect is pretty convincing, but it absolutely requires NVIDIA&#39;s proprietary core technology. That by itself has limited adoption. Instead, AMD uses just spatial data, meaning FSR relies solely on information related to the current frame instead of trying to blend multiple frames together as NVIDIA does.     We&#39;ve already mentioned that FidelityFX Super Resolution doesn&#39;t require any specialized hardware, unlike DLSS 2.0. The result of that might be the most exciting thing about the technology: it works on both AMD and NVIDIA GPUs today. Some of the GPUs in the  supported hardware list are pretty old, and as a result AMD could be bringing some graphics processors back into relevance. That&#39;s got to be welcome news for enthusiasts who can&#39;t find the current generation of graphics cards in stock at their suggested retail prices.    The full list goes all the way back to AMD&#39;s Polaris GPUs found in the Radeon RX 400 and 500 series, and GeForce GPUs based on the Pascal architecture found in the GeForce 10 series like the GTX 1050, and later. Even Intel&#39;s chief of GPUs, Raja Kodouri, said on Twitter that the Blue Team would at least  look into the tech without making any big promises about what GPUs would support it and when.   The other side of the coin is API support. Just like graphics hardware, software support extends back quite a ways. Not only is FSR available in DirectX 12, it&#39;s also available for DX11 games. Open-source APIs aren&#39;t left out of the mix, either, as Vulkan is also supported. The only problem is that each game has to add support for FSR, and as of right now AMD hasn&#39;t added a global switch to force the technology on. We&#39;re hopeful that will change in the future, but for now, we&#39;ll take what we can get.     AMD has four levels of quality for FSR: Ultra Quality, Quality, Balanced, and Performance. At the top, Ultra Quality reduces the vertical and horizontal resolution of an image by a factor of 1.3. By the time we make our way down to Performance, the input is just half the resolution in either direction compared to the output image, or just one quarter of the total number of pixels. Just like DLSS 2.0, there&#39;s a reduced burden on the GPU to draw a scene, allowing it to move forward and reconstruct the detail. In this table, AMD outlines each FSR mode, scale factor, and input resolution. The scale factor below refers to the horizontal and vertical resolution, not the number of pixels drawn. For example, at 2,560 x 1,440 (around 3.69 megapixels), Ultra Quality results in a 2.18 megapixel image, which is just 60% of the detail at the start.     A couple of these settings happen to match NVIDIA&#39;s input resolutions along the way. The Quality and Performance modes here match Quality and Performance resolutions in DLSS 2.0 games like  Control and  MechWarrior 5. It&#39;s too bad that no DLSS 2.0 games also support FSR, or there&#39;d be some real image quality comparison fodder. For now we&#39;ll just have to approximate it. While DLSS 2.0 has an even lower-resolution Ultra Performance mode, FSR focuses on drawing more details, and instead has the Ultra Quality mode at the top.     After the image is rendered at its input resolution but before the HUD is drawn, the FSR algorithm, accelerated by the GPU, enhances the edges of objects and outputs at the target resolution. After the image goes through the sharpening filters to make objects stand out, the HUD gets applied at the target resolution, so that it doesn&#39;t look fuzzy or stretched.    Because the scaling factors stretch so far downward, the expected performance improvement is pretty stratospheric.  AMD says that on average, enthusiasts can expect a 2.4x performance uplift -- more than double the frame rate -- from the Performance setting. This will improve performance when hefty effects are enabled, allow gamers to get the most from their high-refresh FreeSync displays, and could potentially make games playable on hardware that might not otherwise run it smoothly, something we&#39;ll investigate on the next page.   Whatever the case and however you want to count the pixels, the next step in the process is to upscale the image. AMD says its upscaling process employs an &#34;advanced edge reconstruction&#34; algorithm, which is based on the spatial data before it goes to the render pipeline. Let&#39;s take this native 4K image from Counterplay Games&#39;  Godfall as a starting point. We captured all these images on a  Radeon RX 6800 XT, but it should be noted that the image quality on the NVIDIA side is pretty much identical to our eyes.     In the native image, everything is what we&#39;d expect. Objects are sharp and well-defined as they should be in on an 8MP display. Let&#39;s take a look at what Ultra Quality does to that image when it&#39;s rendered at 2,953 x 1,662 and then upscaled up to 4K.    Without blowing the image up to 2x to find all the hard edges, or swapping back and forth between images, we&#39;re actually quite hard-pressed to find glaring differences. The stairs are a little more blurry, and perhaps there&#39;s not quite as much detail in the character&#39;s hair, but in motion it&#39;s basically indistinguishable.   Folks who are sensitive to DLSS 2.0&#39;s temporal artifacts (which we feel are pretty mild and are likely to go unnoticed by many gamers) won&#39;t find anything like that here, because FSR relies solely on spatial data -- the graphics driver knows where objects are in relation to the camera as part of the scene. We can see in still images that there&#39;s a little bit of difference in the image quality at 4K, but we&#39;re hard pressed to find it when the game is moving. If there&#39;s much of a performance boost, which we&#39;ll look into soon, enabling FSR at the Ultra Quality setting seems like a no-brainer in the games that will support it.   Next up, let&#39;s jump to the other end of the spectrum and see what Performance FSR looks like. On a 4K UHD display, we&#39;re talking about a 1080p image, and on a 1440p monitor we&#39;re down to just 720p&#39;s worth of pixels at render time.    Godfall is just one of the games getting FidelityFX Super Resolution support today. The full list includes seven launch titles in all:  22 Racing Series,  Anno 1800,  Evil Genius 2,  Godfall,  KingsHunt,  Terminator: Resistance, and  The Riftbreaker. Some of these titles, like  The Riftbreaker, are early access titles, but Anno 1800 has been around for a while and picks up FSR support post-launch.   There are still two other settings we haven&#39;t looked at. For reasons that will become obvious on the next page, we&#39;re going to check out Quality next. As we mentioned, the 2,560 x 1,440 image produced by the FSR Quality mode matches DLSS 2.0&#39;s Quality mode&#39;s render resolution. Let&#39;s take a closer look at the image.     This is really the point where AMD&#39;s and NVIDIA&#39;s super scaling solutions should be compared, but that&#39;s not really possible until a game supports both technologies. Instead we can say that overall, it feels like FSR produces a softer image at the Quality setting than DLSS 2.0 does. Here&#39;s an example, and we&#39;ll start with FSR. If we really dig into the image here, it feels like our character on the left and the obelisk on the right are slightly out of focus. In motion, the game never feels that way because of constant motion, but in the still image it&#39;s apparent. For contrast, let&#39;s take a look at this scene from Remedy&#39;s  Control  rendered at 4K UHD on a  GeForce RTX 3070 with Quality DLSS 2.0. It has the same input resolution of 2,560 x 1,440 before upscaling, and we&#39;ve cropped it to 1080p the same as we did with  Godfall.    It looks to us like Jessie Faden and her surroundings are a bit sharper and more in-focus in this image than the scenery in  Godfall, but again in motion it&#39;s not as apparent. As we can see there are pros and cons to both approaches. DLSS 2.0 is sharper but hardware support is more limited, while FidelityFX Super Resolution seems a bit softer, but has much wider hardware support. Going forward we&#39;re hoping to see both technologies supported in a single game so we can really make a true apples-to-apples comparison between the two.   Lastly is the Balanced setting. This renders around half-way between Quality and Performance, and renders at a resolution (2,259 x 1,270 when targeting 4K) that is  just a bit higher than DLSS 2.0&#39;s Balanced mode (which renders at 2,227 x 1,253 with the same target).     When targeting 4K with Balanced settings, AMD&#39;s goal was to provide better image quality than 1080p while providing better performance than rendering 1440p. With a target resolution right in between the two, it should be pretty easy to hit that goal. The level of detail is better than it would have been at 1080p as well, though it can&#39;t put back all the detail that&#39;s missing from a higher resolution. The image is softer than either of the Quality settings, too, so it&#39;s just one more step in a series of trade-offs. The best way to determine which setting to use with FSR is to play the game and experiment on your hardware, but we&#39;ll do some investigation of our own on the next page.   That&#39;s a whole lot, but we&#39;ll do our best here to sum it up: thanks to the spatial data collected by AMD&#39;s algorithms, Quality FSR at 4K, which renders at 1440p, has even a smidge more detail than native 1440p rendering, because edges of objects get smoothed out. We still have to investigate performance, but the image quality trade-offs are something we think gamers will be happy to live with. The old saying goes that &#34;something is better than nothing&#34; but in this case, AMD&#39;s something is pretty solid, especially because it feels like it was built for lower-end hardware. In this era of shortages and high prices, hungry gamers will eat it up if it means they can play games at higher resolutions at the cost of a bit of detail.   AMD says FSR is easy to integrate, as the company intends to make the shader source code available as part of the  GPUOpen project under the permissive MIT open-source software license. The company expects source to be published sometime in mid-July. While AMD points out that FSR doesn&#39;t use temporal data or specialized hardware, there&#39;s no per-game training required, it&#39;s also important to note that DLSS 2.0 -- which does use temporal data -- no longer requires per-game training, either.     There are seven games that support FSR today. Those games are  22 Racing Series,  Anno 1800,  Evil Genius 2,  Godfall,  KingsHunt,  Terminator: Resistance, and  The Riftbreaker. Ubisoft&#39;s  Anno 1800 has been around for a while, originally released in April of 2019. Some of the other titles are much newer and, like  The Riftbreaker, are still in an early access stage. We&#39;d love to see other game makers take Ubisoft&#39;s example and bring FSR to older titles, particularly those that stress the graphics card.     On top of that, there are 12 other games already confirmed for FSR, including huge high-profile titles like  FarCry 6, Farming Simulator 22,  Baldur&#39;s Gate 3,  Dota 2, and  Resident Evil Village. In total, around 40 developers have signed on to support FSR in their upcoming titles. Those studios include Capcom, Obsidian Entertainment, Ubisoft, and Valve. On top of that, Microsoft  has already confirmed that FidelityFX Super Resolution will be coming to the Xbox Series S and Series X, too.   Let&#39;s check out some performance next...", "posttime": "2021-06-23 09:14:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,开源,amd,source,warning", "title": "开源AMD FidelityFX超级分辨率在PC游戏测试中令人印象深刻 ", "title_en": "Open Source AMD FidelityFX Super Resolution Impresses In PC Game Tests", "transed": 1, "url": "https://hothardware.com/reviews/amd-fidelityfx-super-resolution-tested", "via": "", "real_tags": ["游戏", "开源", "amd", "source", "warning"]}, {"category": "", "categoryclass": "", "imagename": "14e176396df77bcd0a3f8a26ff10e8ce.jpg", "infoid": 1067610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在竞标将其索赔作为犯罪斗争的工具中，戒指部署了在商业世界中的一个策略：影响者营销。它选择了一个品牌大使的干部，用免费的小工具和折扣代码奖励它们，并敦促他们使用他们的连接来推广Santa Monica安全摄像机启动，通过口口。\n  “顺便说一句，你正在杀死它。您的代码有14个用途，11个更多，我将向您发送我们销售的每个设备，“一名戒指员工在2016年电子邮件中写信给一名官员。 “你有任何社区会议或预防犯罪展览会吗？”\n 戒指提供了至少100名有100个有免费设备或折扣代码的人员，并鼓励他们推荐该公司的网页铃属和安全摄像头，通过时代透露的电子邮件。在15个以上的案例中，电子邮件显示，获得免费小工具或折扣的官员向同事提供给公众的戒指产品。\n  对于戒指来说，将警察转向品牌大使帮助刺激着戒指门铃的采用，同时贷款是公司声称这是一个有效的减少犯罪解决方案的可信度。\n 作为回报，参与的官员获得了数万美元的免费和折扣电子产品，并帮助建立了一个个人监控摄像机网络，即LAPD可以比获得视频镜头的典型方法更少。\n 实践，隐私和刑事司法专家警告，提出了LAPD官员是否在与戒指互动中向公众服务的问题，或者如果他们为私营企业和自己服务。\n LAPD规则限制了可以被视为影响人员行为的礼物的接受。在对电子邮件初步审查后，该部门表示，官员似乎没有违反机构规则。 \n一位机构发言人表示，虽然接受免费设备并亲自向社区成员推荐这些产品没有违反伦布的伦理守则，但有偿认可将对机构规则进行原因。\n “当然，每种情况都是按案例的方式查找”Det“。 LAPD的发言人Meghan Aguilar在一份声明中表示。 “如果出现了部门的注意力似乎不当行为，它将被提交专业标准局进行调查。”\n 目前尚不清楚LAPD官员是否披露其与公共或同胞官员的戒指的安排。\n 戒指2019年，戒指举行的龙头，澳大利亚州亚欧马·丹尼尔斯（Emma Daniel）是2018年的发言人，埃米马·丹尼斯\n  “戒指停止捐赠给执法，鼓励警方多年前推广我们的产品，”丹尼尔斯在一份声明中表示。 “随着戒指已经成长，我们的实践已经发展，我们一直在寻找更好地为客户及其社区提供更好的方式。”\n 次数直接或通过联盟和警察部门向每个名称命名的人员达成，并没有收到出版时的任何回应。\n UC Irvine的犯罪学，法律和社会部的助理教授Tony Cheng警告说，公众可能无法在收到免费或折扣环产品的官员和有偿认可的官员之间进行个人推荐。 “这似乎是分裂的毛发，”程说。 \n他说，实践是一个私人公司的实质性和象征性的担忧的原因，私营公司可以给予公共服务以外的官员动机，他们可以向公众提供人员无法信任的建议的印象。\n  “我们不想被置于职位，以便有问题或对他们在会议中发出的公共安全建议的质量持怀疑态度，例如，这些私人伙伴关系可能受到损害，”程说。\n  品牌大使模型很简单。提供有影响力的单独的免费商品，并将它们转化为低成本的营销团队。\n 一些品牌法院名人，具有巨大的追随者;其他人看起来不一定着名的人在自己的社区中受到影响。具有社交媒体存在的化妆师可能会接受赃物，用于发布新的眼影调色板。跑步者可能会在Facebook上谈论鞋类的免费鞋子。如果他们的饲料有正确的外观，则时尚的Instagram用户可能会降低免费赠品。\n 然而，公共仆人参加品牌大使模型的公务员不那么常见。\n  在一段时间内，戒指开始向LAPD开始。 2012年，杰米西门区的太平洋地球车库成立，戒指证明了错误的批评者在电视节目“鲨鱼坦克”的外观中怀疑初创公司。随着电子商务起飞并担心与它的盗窃玫瑰玫瑰，消费者拥抱环和其他视频门铃。到2016年，该公司估计销售额为1.55亿美元，占全球视频门铃市场的80％。它的价值为4.6亿美元，当时有2090万美元的风险投资资金和Siminoff，正在关注潜在的股票股票。\n  但戒指并不盈利。该公司的目的还难以证明其产品在邻里减少犯罪 - 营销希望通过与其他警察部门合作，旨在通过与LAPD合作进行验证。 \n2016年从2016年审查的电子邮件并通过公共记录释放请求显示该戒指部署了标准剧本，因为它在LAPD站接近官员。\n  通常，戒指会与一项活动的官员或通过同事的介绍联系。然后是一个随访，请求拨打电话，讨论在其邻里中“减少犯罪”的方法。最后，戒指感谢官员打电话，并表示免费产品正在进行中。\n 在至少24个案件中，戒指通过电子邮件发送了折扣码，并鼓励一名官员与同事分享，突出的当地个人，如邻居协会和他们警方社区的居民。\n 戒指的目标在向官员发送免费设备时，让他们体验它，以便他们能够“传播关于这种门铃如何证明在邻里减少犯罪的话，将这个词传播到Hoa的，会议组，在Nextdoor上以及公共安全会议上。 ，“来自公司的一封电子邮件阅读。\n LAPD的道德规范禁止官员接受“任何可能合理地解释任何人的礼物，小费或有利于，以便试图影响他们对城市企业的行为”或使用“他们的立场直接或间接无根据的特权或者豁免自己或他人。“\n  LAPD表示使用折扣代码“通常与我们的道德准则不冲突”。 Aguilar还表示，建议为社区成员保护自己的方式是社区关系职位的高级领导官员或官员的责任之一 - 一些在本故事中的一些人员持有的标题，该职员接受了免费或折扣设备。\n  虽然社区成员常见的是，UC Irvine教授要求官员提出建议，但据称这取决于官员向官员遵守“伦理准则”。官员可以广泛推荐安全系统，他审查了一些电子邮件并指出，官员不仅仅回答有关建议的问题，而且主动地向公众转向戒指。 \n戒指在该部门迅速制作，与2016年至少有125名军官进行沟通。\n  在那年4月，听到了与LAPD的其他成员制作的安排戒指后，来自奥林匹克师的埃里克Mollinedo，电子邮件戒指的运营戒指总监，八月淘汰，要求促销代码以及有关收到他家庭的信息的信息。 Mollinedo说他将在即将到来的公共安全展览会上举办展位。 Cziment说戒指会让他“与传单一起去，以及一个单位。”戒指还提供了Mollinedo优惠券代码，并鼓励他向他的同事分发。\n 博览会后，Mollinedo通过电子邮件响起，让公司了解该活动是成功。 “今天是公共安全的美好的一天......谈到了戒指，曾（5）名官员/储备官员购买！”\n 在至少10起案件中，官员邀请戒指到社区活动，或者提议在他们的车站安排会议，主要是为了允许公司代表谈论产品并交出折扣代码。\n 同月，SGT。 Justin Scott通过Chziment交换了一系列电子邮件，了解免费折叠相机的报价。戒指让他与整个西部的乐队分享报价。站。斯科特商定了，说他会继续打开一个月内打开的免费摄像机，并在同一条消息中询问他是否可以为朋友的戒指设备替换有缺陷而替换。\n  那个月晚些时候，斯科特在向同事发送给同事之前，斯科特举行促销语言，通过电子邮件发送了关于他批准的贴纸剧本的文本块。 Cziment回答说，“看起来很棒！让我更新一切如何。“\n 在60名官员中，回应斯科特电子邮件的询问免费贴纸相机，四个询问他们还可以收到公司在此前几个月免费提供的戒指门铃，因为他们在那时错过了机会。至少有三个其他人为其他官员提供免费的贴纸摄像头。一个人要求为家庭成员折扣。 \n当时，该设备零售于199美元，达到保守估计，在仅需一站，达到至少12,000美元的免费硬件。\n 免费赠品的请求继续到来。在一个案例中，玛丽亚·雷德官员，他是West L.A.警方，警方收到一个免费的贴纸，通过电子邮件，通过电子邮件，邀请他进入即将到来的站家庭野餐。\n  “我们有一个忙于问......每年都有西拉司海滩派对......我们使用我们的MEDLY站基金并购买一些奖品作为奖品抽奖。没有我问，你看到我在哪里使用这封电子邮件吗？更重要的是，我们希望您来参加您。带一些朋友，我们的款待。“\n Cziment写道：“如果感兴趣，我们很乐意捐赠一个戒指门铃，也许是一个新的太阳能安全标志吗？ :)“\n 警方邀请函还延伸到本公司顶端：戒指首席执行官Siminoff Off，参加了2016年警察学院毕业，作为当时的嘉宾·贝克的客人。\n  戒指还鼓励官员向他们策划社区的居民推广其产品。目标是“传播关于这种门铃的消息被证明是如何在社区减少犯罪的情况下，”从戒指中阅读了一封电子邮件，为一名官员提供免费设备来尝试在他的家中。\n  戒指要求官员帮助其帮助其“邻居支柱”计划，通过向所谓的支柱递交促销代码和飞行员，将其LAPD联系人“教育社区的福利”，以所谓的支柱 - “社区的影响力人民关心预防犯罪安全。“对于代码的每10个用途，柱将获得一个自由的环形设备。 \n一封电子邮件显示，社区成员戒指被认为是“有影响力”的邻里观看船长或总统。如果官员不知道任何适合账单的人，戒指邀请了军官承担了柱子的作用。\n  在2016年4月的电子邮件中，官员晚上怀特说，她的车站中的警长曾给出了她的允许分享一个环促销代码，但是“她警告我来封信电子邮件，以便我们不会似乎我们是批准产品，只是提供它作为家庭安全的选项。“\n  在2016年5月，杰维尔塞维亚官员官员表示，他的军士和船长荣誉代表Phillip Dienstag在即将到来的社区会议上谈论戒指。但塞戈维亚 - 根据电子邮件的谁在收到并安装了一个免费的戒指门铃上 - 建议，因为会议将在洛杉矶市举行，公司将无法讨论会议期间的价格。 “相反，他在电子邮件中写道，DienStag将能够“与社区谈谈定价。”\n 其他人进一步以社区成员认可的戒指进一步。官员Alejandro Galvan说，他一直在对他的老邻居一目了眼，谁是“理性”的技术，看看他们的成年儿童会访问，所以他可以谈论他们的父母使用戒指。\n ＆＃34;（PSSS，怪人有翻盖手机），“Galvan写道。 “我认为他们的孩子可能能够”干预“。”\n 在一封电子邮件连接Cziment与南留下南留下居民ESSN的负责人。在戒指的要求下，灰色 - 邀请戒指的官员享受车站家庭野餐 - 询问邻里集团是否可以找到与公司合作的方法。 “我们的侦探使用和支持这一产品，”她说。 “而且欢迎来参加并帮助促进任何会议。我完全相信并支持这个产品！“\n    到2019年，品牌大使模型已经发展起来。戒指不再鼓励官员推广其产品，并承诺免费或折扣商品。相反，官员举办了一个新的激励：越来越多的监控装置，它们可以比典型的安全摄像机更容易进入。 \n当时戒指正试图发展其应用程序，称为邻居。对于消费者来说，服务就像社区留言板一样，甚至更加关注犯罪。居民可以分享和评论他们的社区中可疑或疑似活动，也可以从自己的相机播放。\n 对于执法组织，该应用程序是一个调查工具。 RING网站的说法，该应用程序提供给执法和公共安全机构免费。官员将犯罪警报发送到他们的收件箱，他们可以直接通过应用程序批量下载或向用户发送群众请求。它具有该地区所有环形设备的交互式地图;戒指表示，它在2019年停止了这项服务。根据具体的警察数据请求，消费者可以同意与调查人员分享他们的镜头。\n   Aguilar表示，LAPD和Ring没有正式合同。国家其他地区的类似伙伴关系的条款表明，作为使用执法门户的协议的一部分，官员已被要求“鼓励采用平台/应用，”主板报告。\n 电子邮件至LAPD官员展示戒指倾向于品牌大使模型以发展其应用程序。在安装执法门户后，Ring指示人员要求社区成员加入该平台，因为它会随下载应用程序的每个居民的价值。“\n  获得监视镜头可能是一个繁琐的过程。它可能需要敲门，并要求从各个相机的所有者申请许可，或者有时寻求逮捕令 - 这带来了透明度和司法监督水平。使用Ring的庞大网络，官员可以使用几次点击来请求和获取镜头。电子邮件响秀展示LAPD官员请求尽快访问公司的调查工具，称赞它并迅速将其使用使用。\n  “不要再打电话来寻找相机并要求镜头，”戒指的教学视频与警察部门州共享。\n 6月2020年6月，一些戒指用户收到了一封通知他们LAPD DET的电子邮件。 Gerry Chamberlain正在寻求来自黑人生活抗议的录像，通过电子前沿基金会展示提交的公共记录请求披露的电子邮件。在抗议活动期间，通知读，个人受伤，财产受损，警方试图找出谁负责。 \n它没有立即清除有多少用户收到该通知，其中LAPD正在寻求录像，以及代理机构最终获得的材料。通过请求用户直接从用户请求视频录制，LAPD避免了保护逮捕令或传票的多步过程，以获得来自庞大网络的个人拥有相机的识别。\n  LAPD表示，它不会记录何时以及官员的次数以及常常持续戒指用户请求。\n 经过兴奋的时间达到评论，该公司宣布它改变了其政策，现在要求警方向公共论坛中的用户提出视频的要求。 “这样，有兴趣了解更多关于他们的警察机构如何使用援助职位的更多信息的人可以简单地访问该机构的个人资料并查看帖子历史记录”博客帖子阅读。\n 为了回应时代的公共记录请求，LAPD表示，试图确定其官员要求或接收来自环形摄像机的视频的频率是“过度繁琐的”。\n 消费者拥有门铃摄像机作为家庭安全和便利性的有用工具。但是，律师和前任律师公会的律师和前任执行主任，警告了本私人监测设备所带来的危险，包括对宪法保护自由的潜在寒冷影响。\n   她表示，专家和活动家对监测技术对彩色人民的不成比例的影响，以及进一步减少透明度的透明度，可能导致拖累风格的方法和大众隐私违规行为。\n “当你有人民对财产或暴力犯罪的恐惧升级时，它会改变他们解释沿着街道上的人的普通行为或响起他们的门铃，”她说，“这可以[导致]彩色社区[作为犯罪是错误的。“ \n电子前沿基金会政策分析师Matthew Guariglia缺乏透明度是对关注的进一步引起的，因为戒指和警察部门可以使用恐惧来销售更多的设备并扩大他们的监督权。 在上周寄给加州律师将军的一封信中，电子前沿基金会要求国家司法部调查戒指与加利福尼亚州的145个警察部门的关系。  “这些伙伴关系和这些关系模糊了界限，以便人们不再知道他们是否有真正的理由在他们的邻居中害怕或者是那个来到他们的门口并建议他们采用戒指或补贴戒指的成本只是好处 从那段关系中，“瓜雷利娅说。  11:45 AM，Jun。17,2021：这个故事是更新的，请注意，戒指表示，它停止了2019年与环形设备的互动地图提供执法客户。 ", "note_en": "In a bid to bolster its claims as a crime-fighting tool, Ring deployed a tactic popular in the business world: influencer marketing. It selected a cadre of brand ambassadors, rewarded them with free gadgets and discount codes, and urged them to use their connections to promote the Santa Monica security camera startup via word of mouth.\n  “You are killing it, by the way. Your code has 14 uses, eleven more and I will be sending you every device that we sell,” a Ring employee wrote to one officer in a 2016 email. “Do you have any community meetings or crime prevention fairs coming up?”\n Ring provided at least 100 LAPD officers with one or more free devices or discount codes and encouraged them to recommend the company’s web-connected doorbells and security cameras, emails reviewed by The Times reveal. In more than 15 cases, emails show that officers who received free gadgets or discounts promoted Ring products to fellow police officers or members of the public.\n  For Ring, turning police into brand ambassadors helped spur the adoption of Ring doorbells while lending credibility to the company’s claims that it was an effective crime-reduction solution.\n In return, participating officers got tens of thousands of dollars worth of free and discounted electronics and helped establish a network of personal surveillance cameras that the LAPD could tap into with much less red tape than the typical means of obtaining video footage.\n The practice, privacy and criminal justice experts warn, raises the question of whether LAPD officers were serving the public in their interactions with Ring, or if they were serving a private business and themselves.\n LAPD rules restrict the acceptance of gifts that could be seen as an attempt to influence the actions of officers. After a preliminary review of the emails, the department said officers did not appear to have violated agency rules.\n  An agency spokesperson said that although accepting free devices and personally recommending those products to community members did not violate the LAPD code of ethics, a paid endorsement would run afoul of agency rules.\n “Of course, each situation is looked at on a case by case basis,” Det. Meghan Aguilar, a spokesperson for the LAPD, said in a statement. “If there is something brought to the department’s attention which appears to be misconduct, it will be referred to Professional Standards Bureau for investigation.”\n It’s unclear whether LAPD officers disclosed their arrangements with Ring to the public or fellow officers.\n Ring ended its law enforcement ambassador program, called Pillar, in 2019 and now works directly with community organizations, said Emma Daniels, a spokesperson for Ring, which Amazon acquired in 2018.\n  “Ring stopped donating to law enforcement and encouraging police to promote our products years ago,” Daniels said in a statement. “As Ring has grown, our practices have evolved, and we are always looking for ways to better serve our customers and their communities.”\n The Times reached out to each officer named in this story directly or through the union and the Police Department and did not receive any response by the time of publication.\n Tony Cheng, an assistant professor at UC Irvine’s Department of Criminology, Law and Society, warned that the public probably would be unable to make a distinction between a personal recommendation from an officer who received a free or discounted Ring product and a paid endorsement. “That seems to be splitting hairs,” Cheng said.\n The practice, he said, is a cause for concern both substantively and symbolically — freebies from private companies could give officers motives other than public service, and they could give the public the impression that recommendations from officers can’t be trusted.\n  “We don’t want to be put in the position to have to question or be skeptical about the quality of public safety advice that they’re giving out in meetings, for example, which could be compromised by these private partnerships,” Cheng said.\n  The brand ambassador model is simple. Give free merchandise to influential individuals, and turn them into a low-cost marketing team.\n Some brands court celebrities with huge followings; others look to people who aren’t necessarily famous yet have influence in their own communities. A makeup artist with a social media presence might receive swag for posting about new eyeshadow palettes. A runner might get free shoes for talking about footwear on Facebook. And stylish Instagram users might land freebies if their feed has the right look.\n It’s less common, however, for public servants to participate in the brand ambassador model.\n  Ring began its outreach to the LAPD during a period of growth. Founded in the Pacific Palisades garage of Jamie Siminoff in 2012, Ring was proving wrong critics who had doubted the startup during an appearance on the TV show “Shark Tank.” As e-commerce took off and concerns about porch theft rose with it, consumers embraced Ring and other video doorbells. By 2016, the company had an estimated $155 million in sales, commanding 80% of the global video doorbell market. It was valued at $460 million, had amassed $209 million in venture capital funding and Siminoff, at the time, was eyeing a potential initial public offering of stock.\n  But Ring wasn’t profitable. The company was also having  trouble proving definitively that its products helped reduce crime in neighborhoods — a marketing promise it sought to validate by working with the LAPD, among other police departments.\n Emails from 2016 reviewed by The Times and released via a public records request show that Ring deployed a standard playbook as it approached officers across LAPD stations.\n  Often, Ring would make contact with an officer at an event or through introductions from fellow police. Then came a follow-up, with a request for a phone call to discuss ways to “reduce crime” in their neighborhoods. Finally, Ring thanked the officer for the call and said a free product was on its way.\n In at least 24 cases, Ring emailed a discount code and encouraged an officer to share it with colleagues, prominent local individuals such as heads of neighborhood associations and residents of the communities they police.\n Ring’s goal when sending free devices to officers was to let them experience it so they could “spread the word about how this doorbell is proven to reduce crime in neighborhoods, spreading the word to HOA’s, meeting groups, on Nextdoor, and at public safety meetings,” one email from the company read.\n The LAPD’s  code of ethics prohibits officers from accepting “any gifts, gratuities or favors of any kind which might reasonably be interpreted as an attempt to influence their actions with respect to City business” or using “their position to secure directly or indirectly unwarranted privileges or exemptions for themselves or others.”\n  The LAPD said using discount codes is “generally not in conflict with our Code of Ethics.” Aguilar also said recommending ways for community members to protect themselves is among the responsibilities of senior lead officers or officers in community relations positions — titles held by some of the officers named in this story who accepted free or discounted devices.\n  Although it’s common for community members to ask officers for recommendations, Cheng, the UC Irvine professor, argues it’s up to the officer to “exercise restraint, according to the code of ethics.” Officers could recommend security systems broadly, said Cheng, who reviewed some of the emails and pointed out that officers didn’t just answer questions about recommendations, but proactively steered the public toward Ring.\n Ring quickly made inroads in the department, communicating with at least 125 officers in 2016.\n  In April of that year, after hearing about arrangements Ring made with other members of the LAPD, Officer Eric Mollinedo from the Olympic division emailed Ring’s director of operations, August Cziment, asking for promo codes as well as information about receiving a unit for his home. Mollinedo said he’d be manning a booth at an upcoming public safety fair. Cziment said Ring would get him “going with flyers, as well as a unit.” Ring also provided Mollinedo a coupon code and encouraged him to distribute it to his colleagues.\n After the fair, Mollinedo emailed Ring to let the company know the event was a success. “Was a good day today at the Public Safety fair ... talked up Ring and had (5) officers/reserve officers purchase them!”\n In at least 10 cases, officers invited Ring to community events or offered to schedule meetings at their stations primarily for the purpose of allowing company representatives to talk up products and hand out discount codes.\n That same month, Sgt. Justin Scott exchanged a series of emails with Cziment about an offer for a free stick-up camera. Ring asked him to share the offer with his entire West L.A. station. Scott agreed, saying he’d keep the option to sign up for the free camera open for a month, and in that same message asked if he could get a replacement for a friend’s Ring device “that appears defective.”\n  Later that month, Scott ran promotional language by the company before sending it to fellow officers, emailing Cziment a block of text about the stick-up camera offer for his approval. Cziment replied, “Looks great! Keep me updated on how it all goes.”\n Of the 60 officers who responded to Scott’s email asking for a free stick-up camera, four asked if they could also receive the Ring doorbell that the company gave out for free months prior because they had missed the opportunity at that time. At least three others asked for free stick-up cameras for other officers who didn’t sign up in time. One asked for discounts for family members.\n At the time, the device retailed for $199, amounting to a conservative estimate of at least $12,000 in free hardware doled out at just one station.\n Requests for freebies kept coming. In one case, Officer Maria Gray, who was among the West L.A. police to receive a free stick-up camera, emailed Cziment to invite him to an upcoming station family picnic.\n  “We have a favor to ask... Every year, we have a West LA Division Beach party.... We use our measly station fund and buy some gifts to raffle off as prizes. Without me asking, do you see where I’m going with this email? More importantly, we’d love for you to come and attend. Bring some friends, our treat.”\n Cziment wrote: “We’d be happy to donate a Ring Doorbell and perhaps a new Solar Powered Security sign if that’s of interest? :)”\n Police invitations also extended to the top of the company: Siminoff, Ring’s chief executive, attended a 2016 police academy graduation as a guest of then-LAPD Chief Charlie Beck.\n  Ring also encouraged officers to promote its products to residents of the communities they policed. The goal was to “spread the word about how this doorbell is proven to reduce crime in neighborhoods,” read one email from Ring offering a free device for an officer to try in his home.\n  Ring asked officers to help with its “Neighborhood Pillar” program, enlisting its LAPD contacts to “educate members of the community on the benefits of Ring” by handing out promo codes and fliers to so-called pillars — “influential people in the community that care about crime prevention safety.” For every 10 uses of the code, the pillar would get a free Ring device.\n Community members Ring considered “influential” included neighborhood watch captains or presidents, one email showed. If the officers didn’t know anyone who fit the bill, Ring invited the officers to take on the role of the pillar.\n  In an April 2016 email, Officer Evening Wight said a sergeant in her station had given her permission to share a Ring promo code, but “she cautioned me to word the email so that it won’t appear that we are endorsing the product, merely offering it as an option among others for home security.”\n  In a May 2016 email, Officer Javier Segovia said his sergeant and captain wanted Ring representative Phillip Dienstag to talk about Ring at an upcoming community meeting. But Segovia — who according to the emails had days prior received and installed a free Ring doorbell — advised that because the meeting was going to be held on city of Los Angeles property, the company would not be able to discuss “pricing during the meeting.” Instead, he wrote in the email, Dienstag would be able to “talk to the community on the side regarding pricing.”\n Others went further in endorsing Ring to community members. Officer Alejandro Galvan said he was keeping an eye on his older neighbors, who were “leery” of technology, to see when their adult children would visit so he could talk them into persuading their parents to use a Ring device.\n &#34;(Psss, the weirdos have flip phones),” Galvan wrote. “I’m thinking their kids might be able to ‘intervene.’”\n In an email connecting Cziment with the head of the South Brentwood Residents Assn. at Ring’s request, Gray — the officer who had invited Ring to the station family picnic — asked if the neighborhood group could find a way to work with the company. “Our detectives use and support this product,” she said. “And I’d be more than welcome to attend and help facilitate any meetings. I completely believe in and support this product!”\n    By 2019, the brand ambassador model had evolved. Ring no longer encouraged officers to promote its products with the promise of free or discounted merchandise. Instead, there was a new incentive for officers: growing the network of surveillance devices that they could access more easily than typical security cameras.\n Ring at the time was trying to grow its app, called Neighbors. For consumers, the service works much like the community message board NextDoor but with an even greater focus on crime. Residents can share and comment on suspicious or suspected activity in their communities and also post footage from their own cameras.\n For law enforcement organizations, the app is an investigative tool. The app is given to law enforcement and public safety agencies free of charge, according to Ring’s website. Officers get crime alerts sent to their inbox, and they can batch download or send mass requests to users for footage directly through the app. It featured an interactive map of all Ring devices in the area; Ring says it discontinued that service in 2019. In response to specific police data requests, consumers can consent to sharing their footage with investigators.\n   Aguilar said the LAPD and Ring do not have a formal contract. Terms for similar partnerships in other parts of the country show that as part of the agreement to use the law enforcement portal, officers have been required to “encourage adoption of the platform/app,” in their communities,  Motherboard reported.\n Emails to LAPD officers show Ring leaned on the brand ambassador model to grow its app. After installing the law enforcement portal, Ring instructed officers to ask community members to join the platform because it “grows in value with each resident that downloads the app.”\n  Obtaining surveillance footage can be a cumbersome process. It can require knocking on doors and asking for permission from the owners of individual cameras, or at times seeking a warrant — which brings a level of transparency and judicial oversight. Using Ring’s vast network, officers could instead request and obtain footage with a few clicks. Emails to Ring show LAPD officers requested access to the company’s investigative tool as soon as it was available to them, praised it and quickly put it to use.\n  “No more going door to  door to look for cameras and asking for footage,”  Ring’s instructional video shared with police departments states.\n In June 2020, some Ring users received an email notifying them that LAPD Det. Gerry Chamberlain was seeking video recordings from the Black Lives Matter protests, emails disclosed via a  public records request filed by the Electronic Frontier Foundation show. During the protests, the notification read, individuals were injured and property was damaged and police were trying to find out who was responsible.\n  It was not immediately clear how many users received that notification, where exactly the LAPD was seeking video recordings, and how much material the agency ultimately obtained. By requesting video recordings directly from users, the LAPD avoided the multi-step process of securing a warrant or a subpoena to obtain footage from the vast network of personally owned cameras.\n  The LAPD said it keeps no record of when and how often officers make requests of Ring users.\n After The Times reached out to Ring for comment on this story, the company  announced that it changed its policies and now requires police to make requests for video from users in a public forum. “This way, anyone interested in knowing more about how their police agency is using Request for Assistance posts can simply visit the agency’s profile and see the post history,” the blog post read.\n In response to The Times’ public records request, the LAPD said that it would be “unduly burdensome” to try to determine how often its officers requested or received video from Ring cameras.\n Consumers have embraced doorbell cameras as a useful tool for both home security and convenience. But Heidi Boghosian, a lawyer and former executive director of the National Lawyers Guild, warns of the dangers posed by this private surveillance apparatus, including a potential chilling effect on constitutionally protected freedoms.\n   Experts and activists have for years expressed concerns about the disproportionate effects of surveillance technology on people of color, and further reductions in transparency, she said, could lead to dragnet-style approaches and mass privacy violations.\n “When you have the escalation of people’s fears of property or violent crime, it changes the way they interpret ordinary actions of someone walking down the street or ringing their doorbell,” she said, “And that can [lead to] communities of color [being] falsely accused of crimes.”\n The lack of transparency is further cause for concern, Electronic Frontier Foundation policy analyst Matthew Guariglia said, because Ring and police departments could be using fear to sell more devices and expand their surveillance powers. In a  letter sent to the California attorney general last week, the Electronic Frontier Foundation asked the state Department of Justice to investigate Ring’s relationship with the 145 police departments across California with which it has partnered.\n  “These partnerships and these relationships blur the boundaries so that people no longer know if they have a real reason to be afraid in their neighborhood or if the police who come to their door and recommend they adopt the Ring or subsidize the cost of Ring just benefit from that relationship,” Guariglia said.\n  11:45 AM, Jun. 17, 2021: This story was updated to note that Ring said it stopped providing law enforcement clients with an interactive map of Ring devices in 2019.", "posttime": "2021-06-23 09:13:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,警察,gave,戒指", "title": "戒指曾经为100洛杉矶警察提供免费摄像头 ", "title_en": "Ring Once Gave Free Cameras to 100 Los Angeles Police Officers", "transed": 1, "url": "https://www.latimes.com/business/technology/story/2021-06-17/ring-influencer-marketing-los-angeles-police-department", "via": "", "real_tags": ["免费", "警察", "gave", "戒指"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你＆＃39;我们想学习c，或者你＆＃39; vere想知道如何建立自己的编程语言，这是你的书。  在只是几行代码，我＆＃39; ll教你如何使用c，在一起，我们＆＃39; ll开始构建自己的语言。  沿着我们＆＃39; ll了解Lisps的奇怪和美妙的性质，如何开发一个真实的项目，简明扼要地解决问题，并写出美好的代码！  这本书是免费的在线阅读，所以你可以马上开始！ 但对于那些想要展示他们的支持的人，或者想要最好的阅读体验，这本书也可以以印刷格式购买，或者在所有主要的电子书格式中进行便宜。 ", "note_en": "If you&#39;re looking to learn C, or you&#39;ve ever wondered how to build your own programming language, this is the book for you.\n In just a few lines of code, I&#39;ll teach you how to use C, and together, we&#39;ll start building your very own language.\n Along the way we&#39;ll learn about the weird and wonderful nature of Lisps, how to develop a real-world project, concisely solve problems, and write beautiful code!\n This book is free to read online, so you can get started right away! But for those who want to show their support, or who want the best reading experience, this book is also available for purchase in print format, or for cheap in all major e-book formats.", "posttime": "2021-06-23 09:13:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建立,build,格式", "title": "学习C并建立自己的Lisp（2014） ", "title_en": "Learn C and build your own Lisp (2014)", "transed": 1, "url": "http://buildyourownlisp.com/", "via": "", "real_tags": ["建立", "build", "格式"]}, {"category": "", "categoryclass": "", "imagename": "a0c565a9b714101b7155c9440fac91b3.jpeg", "infoid": 1067608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在时钟是主板＆＃39;在有组织的劳动运动，演出工作，自动化和工作未来的报告。\n  Teamsters的国际兄弟姐妹，其中一个国家＆＃39;最大，最强大的工会，在主板获得的正式决议中表示，亚马逊的工会和建筑工人权力是最优先发展的。该公告来到亚马逊之一，亚马逊之一，今年最繁忙的日子。\n    ＆＃34; Teamsters将建立工人和社区权力的类型，以接受世界上最强大的公司之一，赢得胜利，＆＃34; Randy Korgan，Teamster＆＃39;国家亚马逊董事，在一个26分钟的视频上，＆＃34;亚马逊项目＆＃34;由主板获得，将于周二在TeeSters公约中播放。\n  在周二的虚拟公约中，大约500名当地团队公司工会的团队代表亦将收到该决议案的副本，该副本将于周四获得投票，预计将通过剧烈。\n  该决议规定了Teamsters计划创建特殊的亚马逊部门，特别是为了援助亚马逊工人在后勤行业中的标准 - 并将全面为该项目提供资金。\n  如果实施，该项目将成为美国最雄心勃勃，并重点努力，以组织激烈的反盟零售庞然大物。自1994年成立以来，亚马逊队伍的员工队伍持续了工会，并在明年或两之地成为国家＆＃39;最大的雇主。 Teamsters在美国和加拿大有140万会员。\n  ＆＃34;我们一直在努力工作，在白鹭爆发之前一直在努力，＆＃34; Randy Korgan，Teamstors国家亚马逊主任亚马逊主任告诉主板，参考Bessemer的工会驱动器，阿拉巴马州亚马逊今年早些时候挫败了。 \n自2016年以来，团队中的各个部门一直在追踪亚马逊的成长和影响，并谈到数千名工人，以发展亚马逊工人的最佳策略，根据该决议。在“公约”，Teamsters将宣布Teamsters International，500个当地工会和数十个联合委员会的策略，统一的方法。\n      Teamsters-代表了物流行业的工人，包括仓储，包裹交付，货运，航空公司和食品分销 - 看到自己是组织亚马逊的自然契合。 ＆＃34;我们在行业中有内在的知识，＆＃34; Korgan说。 ＆＃34;我们理解只有受利润激励的运输和物流公司将使始终在工人失去的变化。那些工人已经有一个统一的组织，这是团队主人成员和团队公司作为一个整体。＆＃34;\n 你有一个关于亚马逊与我们分享的提示吗？我们很乐意听取您的意见。请通过电子邮件加入Lauren.gurley@vice.com或安全地与劳伦，记者，通过电子邮件（201）-897-2109。\n  今年早些时候，在亚马逊管理和雇用顾问领导的激烈的联合破坏活动之后，阿拉巴马州的亚马逊仓库工人投票反对零售批发和百货商店联盟（RWDSU）的滑坡突破，这来自纽约市的亚马逊工人的兴趣在成立工会，并在工资上发言，工作场所安全保护，生产力要求和休息时间。\n  通过亚马逊项目，Teamsters正在采取不同的方法，不依赖于传统的国家劳动关系委员会选举进程，使雇主能够经营复杂的反盟活动，并涉及仓库运行选举仓库的任务。\n    相反，Teamsters计划专注于涉及工作中断，请愿书和其他集体行动的一系列压力活动，以推动亚马逊认识到工会和讨价还价。这个策略反映了Teamsters如何组织其第一个成员，马司机，坟墓搬运工和二十世纪初没有联合权利的啤酒车司机，使用商店地板罢工，城市罢工和其他大众集体行动街头。\n  ＆＃34;我们本来可能是第一个热门店，但我们选择没有沿着在Bessemer Union选举中验证的原因达到NLRB选举的路径，＆＃34; Korgan说。 ＆＃34;与此同时，白宫工人＆＃39;在他们实现的职位上听到数百万工人的消息，＆＃39;哦，在那里我可以做的事情。“这个名单很长，工人如何在工作中寻求正义。 NLRB不是唯一的方法。＆＃34; \n团队公司每五年举行一项公约，美国和加拿大各地的代表投票向联盟投票制定新的议程。今年＆＃39;公约将重点关注亚马逊项目。该项目有六个主要组成部分，根据主板教育，并从事当前的联盟成员，组织亚马逊工人，从事公众，反垄断执法，行业压力和全球团结的公约视频。\n    Teamsters不会详细介绍亚马逊项目的资金或时间表，而是表示Teamster International，当地工会和数十个区域联合委员会的＆＃34;犯下了巨大的资源。＆＃34;在全国各地，议员已经参加了与亚马逊项目相关的志愿者组织培训和教育会议，并在未来几年继续这样做。这些培训侧重于亚马逊如何降低物流业的支付和工作条件，从事努力的历史，导致成群人的形成，以及团队人员如何组织和聘请亚马逊工人。\n  这项志愿者组织计划，由Korgan在南加利福尼亚州开发，是亚马逊项目的典范＆＃39; amper教育计划的模型，是基于亚马逊工人往往属于同一社区，家庭和社区作为Teamsters的前提联盟会员 - 并应利用这些联系来组织亚马逊。\n   ＆＃34;我有一个在亚马逊工作的儿子和一个在亚马逊工作的堂兄。我真的看到了亚马逊他们如何＆＃39;重新在你的手被捆绑的位置，你有管理层没有公平对待你，你没有得到你的馅饼的公平份额，＆＃34;在孟菲斯，田纳西州的Tutce Logistics的叉车杰斐逊表示，托克车杰斐逊，田纳西州和队员联盟会员。\n  杰斐逊在2008年帮助工会他的工会，筹集了4美元。他现在每小时29.08美元，并表示他从管理人员的治疗得到了改善的工会合同。他加入了志愿者计划，帮助其他工人组织。\n    ＆＃34;我年轻的表兄弟[亚马逊的工作]总是打电话给我要求贷款，＆＃34;他说。 ＆＃34;我不介意，但她不应该在她身边和她妈妈和借钱的位置。他们应该能够获得更好的工资和医疗保健，并照顾他们的家庭。我在I联盟之前挣扎，但它改变了我的生活。＆＃34;\n  ＆＃34;我做志愿者组织，因为我觉得亚马逊工人应该拥有我所拥有的东西，＆＃34;罗伯特马丁内斯（Robert Martinez）表示，加利福尼亚州安大略省的UPS驾驶员和Teamsters Local 63的成员参加了志愿者组织计划。 Martinez曾42岁的Martinez每小时赚取39.23美元，作为院子里的换档，并获得养老金和医疗保健福利。 \n＆＃34;我在这里教育工作人员，他们向雇主组织起来，＆＃34;他继续。 ＆＃34;当我碰到他们时，我已经和亚马逊司机谈过。他们过度劳累，不是亚马逊的员工。有一天，当我街上的街道上时，我希望我能够迎接亚马逊司机，并知道他是一个工会，他就像他应该一样得到报酬。＆＃34;\n  作为一个比较点，南加州的亚马逊送货司机每小时赚15美元或16美元。由于主板先前报道，亚马逊经常吹捧其15美元的时间最低工资，同时定位沃尔玛和其他零售业，工人通常要少得多。但实际上，亚马逊正在储存仓库和交付行业的工资。\n    即使是联盟的福利和保护，Teamsters成员，特别是在UPS和其他物流公司中，也可以看到他们的工作条件恶化，因为亚马逊扩大了包裹交付部门的覆盖范围。\n  他们引用了更高的交付配额，更多周末和假期转变，不可预测的时间表，以及对临时和承包商更依赖。通过改善这些恶化的条件，UPS和其他工程物流工作者正在加入努力组织亚马逊工人的努力。\n  ＆＃34;配额正在上升。天文数字。我们看到亚马逊包裹的大规模增加，＆＃34; Anthony Rosario，Brooklyn的UPS驱动程序以及Teamstors Local 804的店铺Steward曾在联盟中持续了27年，告诉主机板。 ＆＃34;行业标准正在减少，我们为几十年而战。他们＆＃39;重新迫使人们度假和周末。 [UPS]弯曲到亚马逊＆＃39;＆＃34;\n   与Bessemer Union Drive不同，将几个月公开进入竞选活动，Teamsters在包装中保持了大部分内部战略，以避免亚马逊和第39位的联盟破坏竞选活动。\n  尽管如此，Teamsters一直在公开参与加利福尼亚州的社区压力运动，亚洲帝国是最大的私营雇主，至少有14个亚马逊履行中心，实施一个社区福利协议，将授权授权新的协议亚马逊空中区域空中空间支付盛行的工资，同意零排放计划。今年早些时候，今日美国报告称，联盟一直在爱荷华州的两家仓库组织了数百家送货车手。 \n＆＃34;每个地区都必须了解播放的系统，＆＃34; 韩格公司在视频中将于周二在“公约”中展示。 ＆＃34;如果[亚马逊]工人独立组织，那么Teamster会有所帮助。 如果工人没有组织，Teamster将开始它。 我们的联盟一直是如何创造良好的职业工作和它的领先专家。亚马逊工人知道这一点。＆＃34; ", "note_en": "On the Clock is Motherboard&#39;s reporting on the organized labor movement, gig work, automation, and the future of work.\n  The International Brotherhood of Teamsters, one of the country&#39;s largest and most powerful unions, has said in an official resolution obtained by Motherboard that unionizing and building worker power at Amazon is the top priority moving forward. The announcement comes on  Prime Day, one of Amazon&#39;s busiest days of the year.\n    &#34;The Teamsters will build the types of worker and community power necessary to take on one of the most powerful corporations in the world and win,&#34; said Randy Korgan, the Teamster&#39;s National Amazon Director, in a 26-minute video on &#34;the Amazon Project&#34; obtained by Motherboard, that will be played at the Teamsters convention on Tuesday.\n  At their virtual convention on Tuesday, Teamster delegates from roughly 500 local Teamsters unions will also receive a copy of the resolution, which will receive a vote on Thursday, and is expected to pass resoundingly.\n  The resolution states the Teamsters plan to create a special Amazon Division, specifically to aid Amazon workers in unionizing and defending standards in the logistics industry—and will fully fund the project.\n  If implemented, the project will be the most ambitious and focused endeavor so far in the United States to organize the fiercely anti-union retail behemoth. Since its founding in 1994, Amazon has kept unions out of its workforce and is on track to become the country&#39;s largest employer  within the next year or two. The Teamsters have 1.4 million members in the United States and Canada.\n  &#34;We&#39;ve been working on this for quite some time—well before Bessemer broke out,&#34; Randy Korgan, Teamsters National Director for Amazon, told Motherboard, referring to the unionization drive in Bessemer, Alabama that Amazon thwarted earlier this year.\n   Since 2016, various departments within the Teamsters have been tracking Amazon&#39;s growth and impact and speaking to thousands of workers to develop the best strategies for organizing Amazon workers, according to the resolution. At the convention, the Teamsters will declare a sharper, unified approach across the Teamsters International, 500 local unions and dozens of joint councils.\n      The Teamsters—which represents workers across the logistics industry, including warehousing, package delivery, freight, airline, and food distribution—sees itself as a natural fit for organizing Amazon. &#34;We have an intrinsic knowledge in the industry,&#34; Korgan said. &#34;We understand transportation and logistics companies that are only motivated by profit will make changes that always end in workers losing. There’s been one unified organization for those workers and that’s been Teamsters members and the Teamsters union as a whole.&#34;\n Do you have a tip to share with us about Amazon? We’d love to hear from you. Please get in touch with Lauren, the reporter, via email Lauren.gurley@vice.com or securely on Signal (201)-897-2109.\n  Earlier this year, following an  intense union-busting campaign led by Amazon management and hired consultants, Amazon warehouse workers in Bessemer, Alabama  voted against unionizing in a landslide defeat for the Retail Wholesale and Department Store Union (RWDSU), which ignited a wave of interest among Amazon workers from New York City to Iowa City in forming unions and having a say in their wages, workplace safety protections, productivity requirements, and rest time.\n  With the Amazon Project, the Teamsters are taking a different approach that doesn&#39;t rely on the traditional National Labor Relations Board election process that allows employers to run sophisticated anti-union campaigns and involves the task of running elections warehouse by warehouse.\n    Instead the Teamsters plan to focus on a series of pressure campaigns involving work stoppages, petitions, and other collective action to push Amazon to recognize a union and bargain over working conditions. This  tactic mirrors how the Teamsters organized its first members, horse drivers, grave haulers, and beer wagon drivers, who did not have union rights in the early twentieth century, using shop floor strikes, city-wide strikes, and other mass collective action in the streets.\n  &#34;We could have been the first Bessemer, but we chose not to go down the path of an NLRB election for the reasons that were validated in the Bessemer union election,&#34; Korgan said. &#34;At the same time, the Bessemer workers&#39; message was heard by millions of workers in their position who realized, &#39;Oh there&#39;s something I can do about this.’ The list is very long in how workers can seek justice on the job. The NLRB is not the only way.&#34;\n  The Teamsters hold a convention every five years where delegates across the United States and Canada vote to set a new agenda for the union. This year&#39;s convention will focus on the Amazon Project. The project has six main components, according to the convention video obtained by Motherboard—educating and engaging its current union members, organizing Amazon workers, engaging the public, antitrust enforcement, industry pressure, and global solidarity.\n    The Teamsters would not go into detail about the funding or timeline for the Amazon Project, but said Teamster International, local unions, and dozens of regional joint councils have &#34;committed tremendous resources to this.&#34; Around the country, members are already participating in volunteer organizing training and education sessions related to the Amazon Project, and will continue to do so in the coming years. These trainings focus on how Amazon degrades pay and working conditions across the logistics industry, the history of worker struggles that led to the formation of Teamsters, and how Teamsters members can organize and engage Amazon workers.\n  This volunteer organizing program, which was developed by Korgan in Southern California and is the model for the Amazon Project&#39;s worker education program, is based on the premise that Amazon workers often belong to the same communities, families, and neighborhoods as Teamsters union members—and should leverage those connections to organize Amazon.\n   &#34;I have a son who worked at Amazon and a cousin who works at Amazon. I really see Amazon how they&#39;re in a position where your hands are tied and you have management not treating you fairly and you’re not getting your fair share of the pie,&#34; said Donnell Jefferson, a forklift operator at TForce Logistics in Memphis, Tennessee and a Teamsters union member.\n  Jefferson helped unionize his worksite in 2008 and got a $4 raise. He now makes $29.08 an hour and says his treatment from managers improved with a union contract. He joined the volunteer program to help other workers organize.\n    &#34;My young cousin [who works at Amazon] always calls me asking for a loan,&#34; he said. &#34;I don&#39;t mind but she shouldn’t be in a position where she has to live with her mom and borrow money. They ought to be able to get better wages and healthcare and take care of their family. I struggled before I unionized but it&#39;s changed my life.&#34;\n  &#34;I do volunteer organizing because I feel Amazon workers should have what I have,&#34; said Robert Martinez, a UPS driver and member of Teamsters Local 63 in Ontario, California who participates in the volunteer organizing program. Martinez, who is 42 years old, earns $39.23 an hour as a yard shifter, and receives a pension and healthcare benefits.\n  &#34;I’m here to educate workers on their right to organize to stand up to employers,&#34; he continued. &#34;I have talked to Amazon drivers when I run into them. They&#39;re overworked and are not employees of Amazon. One day when I&#39;m out there on a street I hope I am able to greet an Amazon driver and know he’s in a union and he’s getting paid like he should be.&#34;\n  As a point of comparison, Amazon delivery drivers in Southern California earn $15 or $16 an hour. As Motherboard has previously reported, Amazon  frequently touts its $15 an hour minimum wage, while  positioning itself against Walmart and other retail jobs, where workers are typically paid much less.  But in reality, Amazon is  driving down wages in the warehouse and delivery industries.\n    Even with the benefits and protections of a union, Teamsters members, particularly at UPS and other logistics companies, say they&#39;ve seen their working conditions deteriorate as Amazon has expanded its reach in the parcel delivery sector.\n  They cite higher delivery quotas, more weekend and holiday shifts, unpredictable schedules, and a greater reliance on temps and contractors. Motivated by improving these worsening conditions, UPS and other unionized logistics workers are joining the effort to organize Amazon workers.\n  &#34;Quotas are going up. Astronomical figures. We&#39;ve seen a massive increase in Amazon packages,&#34; Anthony Rosario, a UPS driver in Brooklyn and a shop steward at Teamsters Local 804 who has been in the union for 27 years, told Motherboard. &#34;Industry standards are being diminished that we fought for for decades. They&#39;re forcing people to work holidays and weekends. [UPS] is bending to Amazon&#39;s competition.&#34;\n   Unlike the Bessemer union drive, which went public a few months into the campaign, the Teamsters are keeping much of their internal strategy under wraps in order to avoid Amazon&#39;s union busting campaigns.\n  Still, the Teamsters has been publicly engaging in a  community pressure campaign in California&#39;s Inland Empire, where Amazon is the largest private employer and has at least 14 Amazon fulfillment centers, to implement a community benefits agreement that would mandate that a new Amazon Air Regional AirHub pay prevailing wages and agree to a zero-emissions plan. Earlier this year,  USA Today reported that the union has been organizing hundreds of delivery drivers at two warehouses in Iowa.\n  &#34;Every region must understand the systems that are at play,&#34; said Korgan in the video that will be shown at the convention on Tuesday. &#34;If [Amazon] workers are organizing independently, the Teamsters will help. If workers are not organizing, Teamsters will get it started. Our union has been the leading expert on how to create good career jobs and it&#39;s time Amazon workers know this.&#34;", "posttime": "2021-06-23 09:13:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,宣布,announce,teamsters", "title": "Teamsters宣布协调全国范围的项目到工会亚马逊 ", "title_en": "The Teamsters Announce Coordinated Nationwide Project to Unionize Amazon", "transed": 1, "url": "https://www.vice.com/en/article/akg7pp/the-teamsters-announce-coordinated-nationwide-project-to-unionize-amazon", "via": "", "real_tags": ["amazon", "亚马逊", "宣布", "announce", "teamsters"]}, {"category": "", "categoryclass": "", "imagename": "1a2d05d59997e92778b85a6fa03503fc.png", "infoid": 1067606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "相信它与否，大型技术巨头对审查的严厉眩光使它们保持诚实，或多或少。实现他们的现在和未来的大部分业务取决于想要使用他们服务的人们，他们努力保护数据和隐私。 （就像我说，或多或少！）毕竟，我们的数据是他们用来捆绑和销售为其真实客户的服务：广告商。在Apple的情况下，新的营销音调都是关于“隐私”，以及他们如何没有收集跟踪数据 - 以谷歌和Facebook区分自己的方便方式。我至少在美国努力购买Apple产品，至少在美国，这是一个贵族意识形态，这也有助于他们销售更多胖边缘的装备 - 而不是有什么问题。\n 我们应该担心的公司是我们大多数人从未听说过的许多小型公司。无论是应用程序开发人员都偷偷地向第三方销售信息，零售商（及其数字平台）的数据违规，或带有比瑞士奶酪的安全系统的数据经纪人，这些公司将继续成为大多数头痛的原因我们的数字生活。他们是群体更有可能与数据和隐私带来自由。\n 当我阅读本文关于电力公用事业的情况时，我在本文中开始了这一本篇关于电动公用事业在休斯顿的住宅内部重置智能恒温器的情况下，响应于历史记录的热量的需求上升的情况。这个故事是我们未来的预兆：在第一次似乎是一些轻微的便利甚至一个看似好的交易就是那些不花时间阅读复杂的服务文件的人的主要问题 - 这就是说，就是这样每个人。\n 在这种情况下，如果客户从名为Energyhub的公司签名为名为“Smart Savers Texas”的产品（由Alarm.com拥有，安全服务卖方），他们可以进入抽奖活动。在Exchange中，他们在峰值或极端需求期间获得了能量低管控制它们的恒温器。\n 这是唯一一个例子，虽然我们害怕大型技术公司控制的未来，我们最终会在我所谓的“非技术”公司的手中遭受大部分，现在可以获得我们的私人数据并控制我们的生活。\n 在列表的顶部是一支始终敌对客户的公司：电话公司，电力公用事业，保险公司，营利性医院系统，大型航空公司和其他这些组织。它们只会使用“智能数据”来放大过去的不良行为。\n 围绕的黑暗模式像“聪明的救星德克萨斯州”这样的提供使您几乎不可能为您和我真正辨别我们可能正在注册的内容。毕竟，没有人通过页面长期服务协议筛选。而且我当然不是意味着挑选这一家公司 - 这个“不清楚”的行为是整个数字生态系统的一部分。 \n尝试在健身俱乐部的合同下退出，或取消您的订阅纽约时报。祝你好运。在这个数字时代，这些看似简单的任务只是更加困难。我一直在努力，没有多大成功，将从出版公司的电子邮件取消订阅近十年。这既不是你最后一次也不是最后一次看到“实用程序”或其他实体与你认为是私人空间的东西。\n 休斯顿发生了什么，这是一个快速增长的事件列表，让我暂停拥抱聪明的家，即使我是早期的采用者。我们的“连接设备”的安全越来越不清楚。我对亚马逊警察其数字货架的能力几乎没有信任。如果我们购买的设备是假的，或者偷偷地向海外目的地发送数据吗？我不知道你是否记得（甚至阅读）这种可怕的故事，在似乎看似无害的应用程序，收集个人数据并将其卖给愿意支付的人。这只是冰山一角。暂停和考虑越来越重要：非常便宜，或者在长期支付的价格更大？\n 谢谢，谢天谢地，Apple介绍了AppTrackingTransparency（ATT），这将强迫应用程序寻求履行跨应用程序的允许和我们的活动。当之无愧地，许多人已经写了关于这个在Facebook上的影响，但它超越了一家公司。尽管如此，它仍然指出，它还不够。\n “它没有任何关于'第一方'跟踪的任何东西，或者一个应用程序跟踪您在该应用程序本身上的行为，”Eff在其博客上写道。 “ATT也可能易于”通知疲劳“如果用户变得如此习惯，但在不考虑选择的情况下，他们只需点击它即可。而且，就像任何其他跟踪拦截计划一样，ATT可能会在跟踪器之间的Cat-Mouse游戏中掀起一个新的回合，以及希望限制它们的人。“\n 这是挑战。保护我们的数字神圣性的压力正在落在消费者身上，而不是那些从中获利的人。即使是Apple的努力也将工作量转移到普通人身上，我们中的许多人只是没有能够处理认知负荷或不理解影响。\n 对于近十年来，我已经提出了关于个人有关如何收集和使用数据的权利的问题。 2014年，我很天真地写了一些被称为“信任条件”的东西，其中公司在简单的语言中解释他们的数据，而不是法律事件。\n 八年后，我们仍然绊倒了雾 - 即使在我们自己的家中。 \n在下面输入您的电子邮件以订阅。 您可以随时取消订阅，您的数据不会与任何第三方共享。 ", "note_en": "Believe it or not, the harsh glare of scrutiny on big technology giants has kept them honest, more or less. Realizing how much of their present and future business depends on folks wanting to use their services, they work hard to protect data and privacy. (Like I said, more or less!) After all, our data is what they use to bundle and sell as services to their  real customers: advertisers. In the case of Apple, the new marketing pitch is all about “privacy” and how they are not collecting tracking data — a handy way to distinguish themselves from Google and Facebook. I buy Apple products precisely for their stance towards privacy, at least in the U.S. In short, a noble ideology that also helps them sell more gear with fat margins—not that there’s anything wrong with it.\n The companies we should be worried about are the many smaller and mid-sized companies that most of us have never heard about. Whether it is app developers surreptitiously selling information to third parties, data breaches at retailers (and their digital platforms), or data-brokers with security systems that have more holes than swiss cheese, these companies will continue to be the cause of most headaches in our digital lives. And they are the group more likely to take liberties with data and privacy.\n I began ruminating on this earlier in the week when I read  this article about electric utilities  resetting the smart thermostats inside residential homes in Houston in response to the rising demand for electricity due to record-breaking heat. This story is a harbinger of our future: what at first seems like some minor convenience and even a seemingly good deal becomes a major problem for those who don’t spend time reading the complicated terms of service documents — which is to say, just about everyone.\n In this case, if a customer signed up for an offering called “Smart Savers Texas” from a company called EnergyHub (which is owned by Alarm.com, a seller of security services), they could be entered into sweepstakes. In exchange, they gave permission to EnergyHub to control their thermostats during periods of peak or extreme demand.\n This is yet another example of how, though we dread the future controlled by big technology companies, we will ultimately suffer most at the hands of what I call “non-technology” companies that now have access to our private data and control over our lives.\n And at the top of the list are companies that have always been hostile to their customers: telephone companies, electric utilities, insurance companies, for-profit hospital systems, big airlines, and other such organizations. They will only use “smart data” to amplify their past bad behavior.\n Dark patterns around offers like “Smart Savers Texas” make it virtually impossible for you and me to really discern what we might be signing up for. After all, no one sifts through the pages-long terms of service agreements. And I certainly don’t mean to pick on this one company — this “unclear” behavior is part of the entire digital ecosystem.\n Try getting out from under a contract at a health club or canceling your subscription to  The New York Times. Good luck. In this digital age, these seemingly simple tasks have only gotten harder. I have been trying, without much success, to unsubscribe from emails from a publishing company for almost a decade. And this is neither the first nor the last time you are going to see “utilities” or other entities muck around with what you assume to be private spaces.\n What happened in Houston is among a rapidly growing list of incidents that make me pause about embracing the Smart Home, even though I was an early adopter. The safety of our “connected devices” is increasingly unclear. I have little trust in Amazon’s ability to police its digital shelves. What if the device we are buying is fake or is sending data surreptitiously to an overseas destination? I don’t know if you remember (or even read) this scary  story in  Vice about seemingly innocuous apps that collect personal data and sell it to anyone willing to pay. And that is just the tip of the iceberg. It is increasingly important to pause and consider: is cheap really cheap, or is there a bigger price to pay in the long term?\n Belatedly, and thankfully, Apple has introduced  AppTrackingTransparency (ATT), which will force apps to seek permission to track us and our activity across apps. Deservedly, many have written about the impact of this on Facebook, but it goes beyond that one company. Still,  as EFF points out, it doesn’t do enough.\n “It doesn’t do anything about ‘first-party’ tracking, or an app tracking your behavior on that app itself,”  EFF writes on its blog. “ATT might also be prone to ‘notification fatigue’ if users become so accustomed to seeing it that they just click through it without considering the choice. And, just like any other tracker-blocking initiative, ATT may set off a new round in the  cat-and-mouse game between trackers and those who wish to limit them.”\n And that’s the challenge. The pressure of protecting our digital sanctity is falling on consumers, not those who profit from it. Even Apple’s efforts shift the workload to ordinary people, and many of us are just not equipped to handle the cognitive load or don’t understand the impact.\n For nearly a decade, I have  raised questions about an individual’s rights pertaining to how data is collected and used. In 2014, naively I wrote about something called “Terms of Trust,” in which companies explain what they would do with our data in plain language, instead of legalese.\n Eight years later, we are still stumbling through the fog — even in our own homes.\n   Enter your email below to subscribe. You can unsubscribe at any time and your data won’t be shared with any third parties.", "posttime": "2021-06-23 09:12:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "om,malik,数据", "title": "om malik：你不知道的魔鬼 ", "title_en": "Om Malik: The Devils You Don't Know", "transed": 1, "url": "https://om.co/2021/06/22/the-devils-you-dont-know/", "via": "", "real_tags": ["om", "malik", "数据"]}, {"category": "", "categoryclass": "", "imagename": "fa0a8081df612d61a03e36cb5d4e640c.jpg", "infoid": 1067605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比利时举重者表示，处理体育中的变性问题是＆＃34;不可能的＆＃34;但是，在东京2020年奥运会的Laurel Hubbard的存在是＆＃34;像一个糟糕的笑话和＃34;对女运动员。\n  她是第一个公开的跨性别运动员，以资格获得任何运动中的奥运会。\n 到目前为止，Hubbard＆＃39;竞争对手都没有谈论争议的规则，这些规则似乎给了新西兰人一个巨大的巨大和许多不公平的优势。\n 来自美国和英国的运动员可能会受到不利影响，但可以理解，他们和他们的全国联合会表现出没有对争议发表评论的愿望。\n 比利时Anna Vanbellinghen打破了运动员＆＃39;沉默与哈伯德成就的考虑说明。\n Vanbellinghen有机会在相同的重量类别中排列，超过87公斤超重，因此受到哈伯德的存在的直接影响，他在35岁时转向女性。\n 其他人在哈伯德在妇女运动中的存在，大多数常见于社交媒体，但Vanbellinghen并没有提出个人批评。 \n＆＃34;首先，我想强调我完全支持跨性别社区，而且我该说的不是来自这个运动员身份的拒绝的地方，＆＃34; vanbellinghen说。\n  ＆＃34;我知道，根据有无限种类的情况，界定了用于转型运动的法律框架是非常困难的，并且从辩论的两侧都有一个完全令人满意的解决方案，可能是不可能的。\n ＆＃34;然而，任何在高层举重举重的人都知道这是在他们的骨骼中的真实：这种特殊情况对这项运动和运动员来说是不公平的。＆＃34;\n 凡富兰州，27岁，其合格的努力被伤害扰乱，指出，甚至较年前服用类固醇的保留益处是众所周知的。\n ＆＃34;为什么它仍然是一个问题是否有二十年，从青春期到35岁，与一个人的荷尔蒙系统也会发挥作用[竞争妇女]？\n ＆＃34;我明白，对于体育权威而言，没有什么是简单的，如常识，并且在研究这种罕见的现象时存在很多不切实际的事情，但对于运动员来说，整个事情都感觉像一个糟糕的笑话。\n ＆＃34;一些运动员的生活机会遗忘 - 奖牌和奥林匹克资格 - 我们无能为力。 \n＆＃34;当然，这场辩论正在更广泛的歧视背景下进行对抗变性人，这就是为什么这个问题永远不会是不含意识形态的原因。\n ＆＃34;然而，这种特殊情况的极端性质确实表明需要为体育中的跨性别纳入更严格的法律框架，特别是精英运动。\n ＆＃34;因为我确实相信每个人都应该有运动，但不是牺牲他人。＆＃34;\n  萨摩亚举重联合会主席Jerry Wallwork是一个类似的观点，因为她在2017年转换以来，有运动员对哈伯德竞争。\n ＆＃34;我是反对它的人之一[在奥林匹克合格的哈伯德]在2018年大大回来，＆＃34;沃尔沃特说。\n 2但是，即使我们的女运动员与她直接竞争，也不能在劳雷尔扔泥，责备她，并可能错过在奥运会上竞争的竞争中，我们无法继续扔泥。\n “该决定来自于[国际奥委会（IOC）委员会]，批准了跨性别运动员在妇女举重中的参与。 \n＆＃34;更多的研究应该进入这个问题，或者必须为跨性别升降机建立一个单独的类别。  ＆＃34;特别是在举重的联系体育和电力运动中，女运动员对抗变性运动员的劣势。＆＃34;  Mark House，美国律师和国际举重联邦（IWF）技术官员，对这种情况进行了深入的分析，优势Hubbard在最新的内部历史读书中有了同伴竞争对手。 ", "note_en": "A Belgian weightlifter says dealing with transgender issues in sport is &#34;impossible&#34; but the presence of Laurel Hubbard in the Tokyo 2020 Olympic games is &#34;like a bad joke&#34; to women athletes.\n  She is the first openly transgender athlete to qualify for the Olympic Games in any sport.\n Until now, none of Hubbard&#39;s rivals has spoken on the controversial rules that appear to give the New Zealander a huge and, to many, unfair advantage.\n Athletes from the United States and Britain are potentially adversely affected but, understandably, they and their National Federations have shown no desire to comment on the controversy.\n Anna Vanbellinghen of Belgium has broken the athletes&#39; silence with a considered statement on Hubbard’s achievement.\n Vanbellinghen has a chance of qualifying in the same weight category, the over-87-kilogram super-heavyweights, and is therefore directly affected by the presence of Hubbard, who transitioned to female at the age of 35.\n Others have voiced outrage at Hubbard’s presence in women’s sport, most often on social media, but Vanbellinghen is not making a personal criticism.\n &#34;First off, I would like to stress that I fully support the transgender community, and that what I’m about to say doesn’t come from a place of rejection of this athlete’s identity,&#34; Vanbellinghen said.\n  &#34;I am aware that defining a legal frame for transgender participation in sports is very difficult since there is an infinite variety of situations, and that reaching an entirely satisfactory solution, from either side of the debate, is probably impossible.\n &#34;However, anyone that has trained weightlifting at a high level knows this to be true in their bones: this particular situation is unfair to the sport and to the athletes.&#34;\n Vanbellinghen, 27, whose qualifying efforts were disrupted by injury, pointed out that the retained benefit of taking steroids, even years earlier, is widely known.\n &#34;So why is it still a question whether two decades, from puberty to the age of 35, with the hormonal system of a man also would give an advantage [in competing against women]?\n &#34;I understand that for sports authorities nothing is as simple as following your common sense, and that there are a lot of impracticalities when studying such a rare phenomenon, but for athletes the whole thing feels like a bad joke.\n &#34;Life-changing opportunities are missed for some athletes - medals and Olympic qualifications - and we are powerless.\n &#34;Of course, this debate is taking place in a broader context of discrimination against transgender people, and that is why the question is never free of ideology.\n &#34;However, the extreme nature of this particular situation really demonstrates the need to set up a stricter legal framework for transgender inclusion in sports, and especially elite sports.\n &#34;Because I do believe that everyone should have access to sports, but not at the expense of others.&#34;\n  A similar point was made by Jerry Wallwork, President of the Samoan Weightlifting Federation, which has had athletes competing against Hubbard since she transitioned in 2017.\n &#34;I was one of the people who opposed it [having Hubbard in Olympic qualifying] greatly back in 2018,&#34; Wallwork said.\n 2But I do feel that we cannot keep throwing mud at Laurel and blaming her, even though our female athletes are in direct competition with her and could miss out on competing at the Olympic Games.\n “The decision came from the top [an International Olympic Committee (IOC) sub committee] which approved participation of transgender athletes in women’s weightlifting.\n  &#34;More research should go into this issue, or a separate category must be established for transgender lifters.\n &#34;Especially in contact sports and power sports like weightlifting, there is a disadvantage for female athletes against transgender athletes.&#34;\n Mark House, an American lawyer and International Weightlifting Federation (IWF) technical official, offers an in-depth analysis of the situation, and the advantage Hubbard has over her fellow competitors, in the latest  insidethegames  Big Read.", "posttime": "2021-06-23 09:11:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "举重,weightlifter,运动员", "title": "竞争对手的举重者在跨老人哈伯德的奥运会上发表讲话 ", "title_en": "Rival weightlifter speaks out on transgender Hubbard's Olympic place", "transed": 1, "url": "https://www.insidethegames.biz/articles/1108399/anna-vanbellinghen-hubbard", "via": "", "real_tags": ["举重", "运动员"]}, {"category": "", "categoryclass": "", "imagename": "a052e034f6ca14cc07ea5ad5494f2e01.gif", "infoid": 1067603, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你有一个家，但你不能证明它＆＃39;你。你有一个由石头标记的边界，但没有返回它的文件。那个＆＃39;印度农村生活多少。如果可以改变这种情况怎么办？没有静脉的人类努力，涉及成千上万的工人穿越该国的长度和广度，但在几千个无人机的帮助下。由政府实施的Svamitva计划正在努力尝试。\n 你有一个家，但你不能证明它＆＃39;你。你有一个由石头标记的边界，但没有返回它的文件。那个＆＃39;印度农村生活多少。\n 如果可以改变这种情况怎么办？没有静脉的人类努力，涉及成千上万的工人穿越该国的长度和广度，但在几千个无人机的帮助下。\n  代表“村庄地区村庄和乡村地区的简易技术调查”的首字母缩略词正在调查Abadi或使用无人机技术的村庄的居住区。这个想法是村民对他们的家庭有“权利记录”，他们可以将其用作资产，并抵抗财产纠纷。\n 如果该项目成功，目前由树木或石头定义的边界将转变为更有形的东西 - 纸上的记录。和村庄的地形如下面，最终可以通过更明朗的所有权限制来定义。\n   该计划的想法来自Maharashtra，Panchayati Raj部联合秘书Alok Prem Nagar的Panchayat征税和收集来自Abadi地区的财产税。国家希望更新其物业登记册，并与印度的调查与寄生虫调查有关。\n 看到在该州的被尝试，它实现了类似的全国范围内运动可能证明是有用的。 \nNagar表示，没有明确的划分，对某人声称所有权进行了混乱的人，可以在运动工作中增加非正式权利。此外，可以收集大量收入，这有助于为村庄Panchayats提供资金。\n “想象一下，您拥有您家的非正式所有权，但没有文件来显示所有权，”Vinay Kumar Singh，经济学家和管理顾问说。 “如果有人要求，最好你可以解释你的父母或你的祖父母住在房子里，其中一部分留给了你。这是印度村庄居住地区的现实。有人可以把你扔出你的房子，你可能没有太大的事情。“\n “这些领域尚未被独立调查，如果没有别的，躺下适当的所有权界限可以为生活在这些地区的人带来安心，”他说。\n 纳加和他的团队继续研究这个想法，并于4月2020年4月在Panchayati Raj部门的帕尔奇亚蒂·拉尔部门开设了试点项目，国家收入部门和印度作为技术合作伙伴的调查。\n 根据Panchayati raj部的一份声明，该试点在北Uttar Pradesh，Hulyana，Maharashtra，Madhya Pradesh，Haryana，Maharashtra，Madhya Pradesh，Haryana，Maharashtra，Karnataka，Punjab，Rajasthan和Andhra Pradesh。\n 今年4月，它在全国范围内推出实施，预计将涵盖大约6.62万卢比的村庄2024年。\n 数百个无人机航班已经发生，就像下面的那样，在全国各地的空中图像收集，从喜马拉雅山的山麓到拉贾斯坦邦的沙漠。 \n这个过程并不像听起来那么容易。当然，有问题，疑虑，也许甚至是一种怀疑。所以第一步是在村民中创造意识，说辛格。然后，石灰石粉或“Chuna”用于标记界限，克普朗坦的工人和监督工作的收入部门。\n 这是一个迷人的运动，政府组织了一个“Nukad NaTak”（邻里竞争），在一个地方收集人并向他们解释Chuna标记和无人机调查的目的。\n  一旦完成了非正式边界标记的过程，无人机就会乘飞机收集高分辨率图像。\n 随着无人机的利用，这种可变地形和无人机交付的影响，即使在其当前阶段也可以称为世界上任何地方的最大潜力最有影响力的应用程序AUS的首席执行官，这是一个为Svamitva提供无人机解决方案的公司。\n  例如，在富特拉克手中，无人机可以平均覆盖三到四个村庄，而辛格说，它可以在北方邦覆盖五到七个村庄。\n 然后将图像发送到对印度的调查进行处理，最后采取地图的形状。\n 一旦地图准备就绪，村民约有15天才能验证他们的土地是否正确映射，之后他们收到了他们的财产卡。 \n到目前为止，根据Nagar的近46,000个村庄已经完成了无人机调查。根据Panchayati Raj 0日5月4日，2021年5月4日的纸张发布，财产卡已分发超过7,489个村庄，超过7,489名Lakh受益者。\n 例如，当“Chuna”标记被撤消或不正确完成时，必须回忆数据。\n 副总裁Vishal Saxena表示，在旨在提供对该计划的无人机制造公司的副总裁Vishal Saxena表示，副总裁。\n Saxena说，对印度的调查无法以众所周知的原因来处理数据。他说，对于印度的调查制定了管理数据所需的IT基础设施将需要时间。\n 无人机数量不足是另一个问题，因为专注于挑选最低投标人而不是最好的技术。\n 据该行业的人介绍，在没有招标的情况下，应为外国供应商的紧急采购授权，而采购的价格约为40％以上超过以前的投标。\n  在目前的步伐和随着大流行的情况下，由于大流行，该项目可能会超越其时间表，艾斯的vipul singh说。 \n超越后勤挑战和无人机技术的实验，该项目是否可以实现它所作出的事情？\n Nagar表示，在我们完成工作的村庄，该项目已经实现了目标。随着其预期目标，如易于银行贷款和减少财产纠纷，还有其他正面的外部性。他说，人们现在了解征地的赔偿问题更好。\n  “每个州都必须制定确定所发行的财产卡的合法性的法律，”纳加人说。 “然后各国将需要与贷方和其他人进行聘用，以确保接受这些财产卡作为抵押品。”\n 虽然项目项目的最终目标可能会有一定距离，但该过程的学习可能证明自己有价值。\n 一旦您就可以提供了旱机的生态系统，并且您可以在您可以在您提供专业知识的情况下，您可以在您解释无人机照片和创建地图，那么您可以映射和调查任何内容......现在可以与州政府提供专业知识，他们可以做无论他们想要什么。例如，没有什么能阻止某个州政府对农业土地做同样的练习。\n “随着该方案进行，随着地理空间政策开放，该技术可用于森林部门或电力塔检查的反偷猎，例如，”Saxena说。这些任务中的大多数都是庞大的，没有足够的人力。 “这就是无人驾驶飞行器和无人机进入的地方。” ", "note_en": "You have a home, but you can’t prove it&#39;s yours. You have a boundary marked by stones, but no documents to back it. That&#39;s how much of rural India lives. What if this could be changed? Not with a herculean human effort which involves thousands of workers traversing the length and breadth of the country, but with the help of a few thousand drones.The Svamitva scheme, being implemented by the government, is attempting exactly that.The ...\n You have a home, but you can’t prove it&#39;s yours. You have a boundary marked by stones, but no documents to back it. That&#39;s how much of rural India lives.\n What if this could be changed? Not with a herculean human effort which involves thousands of workers traversing the length and breadth of the country, but with the help of a few thousand drones.\n  The acronym, which stands for “Survey of Villages and Mapping with Improvised Technology in Village Areas” is surveying the  abadi or inhabited areas of villages using drone technology. The idea is if villagers have a “record of rights” to their households, they can use it as an asset and also fight off property disputes.\n If the project succeeds, boundaries currently defined by a tree or a stone, will stand transformed into something more tangible — a record on paper. And village topographies, like the one below, may finally be defined by clearer ownership confines.\n   The idea for the scheme came from Maharashtra, where the panchayat levies and collects property tax from  abadi areas, Alok Prem Nagar, joint secretary at the Ministry of Panchayati Raj, said. The state was looking to update its property register and got in touch with the Survey of India for help with the drone survey.\n Seeing what was being attempted in the state, it was realised a similar nationwide exercise could prove useful.\n With no clear demarcations, it’s chaotic for someone to assert ownership, Nagar said, adding informal rights could be crystallised into a “record of rights”, should the exercise work. Besides, substantial revenue could be collected and this could help fund the village panchayats, he said.\n “Imagine that you have informal ownership of your home but no documents to show ownership,” Vinay Kumar Singh, economist and management consultant, said. “If someone asks, at best you could explain that your parents or your grandparents lived in the house and a part of it has been left to you. That is the reality in inhabited areas in villages in India. Someone could throw you out of your house and there may not be much you can do about it.”\n “These areas have not been surveyed since independence and, if nothing else, laying down proper ownership boundaries can bring peace of mind for those who live in these areas,” he said.\n Nagar and his team went on to study the idea and in April 2020 a pilot project was launched under the Ministry of Panchayati Raj in collaboration with state Panchayati Raj departments, state revenue departments and the Survey of India as technology partner.\n The pilot operated in nine states—Uttar Pradesh, Uttarakhand, Madhya Pradesh, Haryana, Maharashtra, Karnataka, Punjab, Rajasthan and Andhra Pradesh—according to a statement by the Ministry of Panchayati Raj.\n In April this year, it was rolled out for implementation across the country and is expected to cover about 6.62 lakh villages by 2024.\n Hundreds of drone flights have already taken place, just like the one below,  collecting aerial images across the country, ranging from the foothills of the Himalayas to the deserts of Rajasthan.\n  The process isn’t quite as easy as it sounds. Naturally, there are questions, concerns and, perhaps even a degree of suspicion. So the first step is to create awareness among villagers, said Singh. Then, lime stone powder or “chuna” is used to mark boundaries, with workers from the gram panchayat and revenue department overseeing the work.\n It is a fascinating exercise, where the governments organise a “nukad natak” (neighbourhood play), collect people in one place and explain to them the purpose of the chuna marking and the drone surveys.\n  Once this process of informal boundary marking is done, the drones take flight to collect high resolution images.\n With the kind of utilisation of drones taking place, the kind of variable terrains and the impact that the drones deliver, this can be called the most impactful application of drones anywhere in the world even in it’s current phase, said Vipul Singh, co-founder and CEO at AUS, a company that delivers drone solutions to Svamitva.\n  For instance, in Uttarakhand, a drone can cover three to four villages per day on average, while it can cover five to seven villages in Uttar Pradesh, Singh said.\n The images are then sent for processing to the Survey of India and finally take the shape of maps.\n Once the maps are ready, villagers are given about 15 days to verify that their land is mapped properly, after which they receive their property cards.\n So far, drone surveys have been completed for nearly 46,000 villages according to Nagar. Property cards have been distributed in more than 7,489 villages across more than 7.09 lakh beneficiaries, according to a press release by the Ministry of Panchayati Raj dated May 4, 2021.\n For instance, when “chuna” marking is left undone or is done incorrectly, data has to be recollected.\n There is also a back-log in processing data, said Vishal Saxena, vice president of surveillance and mapping at IdeaForge, a drone manufacturing company that supplies to the scheme.\n The Survey of India isn’t able to process data quickly enough for a host of reasons, Saxena said. For the Survey of India to put in place the IT infrastructure needed to manage data of this magnitude will take time, he said.\n An inadequate number of drones is another problem, as is the focus on picking the lowest bidders rather than the best technology.\n According to people in the industry, an emergency procurement mandate has been passed for a foreign vendor without a tender and the price of procurement is at about 40% over than previous tenders.\n  At the current pace and with the disruption to work because of the pandemic, the project is likely to overshoot its timeline, Vipul Singh of AUS said.\n  Beyond the logistical challenges and the experiment with drone technology, can the project achieve what it set out to do?\n In villages where we have completed work, the project is already achieving its objectives, said Nagar. Along with its intended objectives such as ease of bank loans and reducing property disputes, there are other positive externalities. For instance, people now understand the issue of compensation in land acquisition better, he said.\n  “Every state will have to enact laws that ascertain the legality of the property cards being issued,” Nagar said. “And then states will need to engage with lenders and others to ensure acceptance of these property cards as collateral.”\n While the end goal of the project of the project may be some distance away, the learnings from the process could prove to be valuable in themselves.\n Once you have the ecosystem of drones in place and once you have the expertise available where you can interpret the drone photographs and create maps, then you can map and survey anything... The expertise is now available with the state governments and they can do whatever they wish to. For instance, nothing stops a certain state government from doing the same exercise for the farming land also.\n “With the scheme underway and with the geospatial policy opening up, this technology can be used for anti-poaching by the forest department or electricity tower inspections, for instance,” Saxena said. Most of these tasks are mammoth and there is not enough manpower. “That’s where unmanned aerial vehicles and drones will come in.”", "posttime": "2021-06-23 08:27:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "农村,rural,无人机", "title": "数字化农村陆地记录，一次无人机 ", "title_en": "Digitising Rural Land Records, One Drone at a Time", "transed": 1, "url": "https://www.bloombergquint.com/business/digitising-rural-land-records-one-drone-at-a-time", "via": "", "real_tags": ["农村", "rural", "无人机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在他们的第一个赛季10次尸体后，汤姆和杰米反映了他们所看到的常见问题。单击详情！\n   我们只是通过我们的停机时间播客的首发赛季，并庆祝，我们反映了我们在我们倾注的十大中断中的许多中断中注意到的经常性主题。由于他们解决了这些事件，这是卓越的某些模式如何成为风险或作为资产 - 工程团队。\n 出于这些经常性模式，我们提取了我们打算进入我们自己的工程团队的课程;因此，我们已经编制了下面的五个课程，以获得任何感兴趣的读者的利益，希望您也发现他们有助于学习和准备。我们走了，我们将包括与每个主题发生的中断和集中的链接。\n 如果您觉得我们错过了任何主要模式，或者对我们有任何其他反馈，请发表评论。谢谢你们所有人听取停机项目的第一个赛季。\n  “Dogfood”的本能是一个伟大的唯一一个，如果你不会，你如何合理地希望您的客户使用您的产品和服务？如果您不符合自己的公司的生产力，您如何支持他们启用的工作流程？\n 但是，这种健康的本能返回当所述狗狗食品创建一个依赖周期时，您依靠自己的系统...修复您的系统。\n 这种依赖模式的其他实例从其他善良的座右铭中掉出：不要重复自己。为什么跑另一种数据库只是为了监控？你已经很好地运行了生产数据库，非常感谢您。所以只需将遥测数据放在那里。 \n这些循环也可以在中断时疼得厉害。喜欢，需要努力访问操作系统以修复身份验证的身份验证...或监视需要工作数据库以获得公制数据以发现数据库的错误。有趣的东西。\n 即使是客户通信系统有时被破坏，因为您使用自己的系统将系统状态传递给客户。\n  EP 1. Slack VS TGWS：Slack无法访问仪表板以知道其系统出现了什么问题，因为AWS Transit Gateways需要健康，以便将HTTP流量置于其仪表板。不幸的是，TGW是不健康的。\n EP 3. Monzo 2019 Cassandra中断：Monzo的生产数据库已关闭，这是验证系统访问和部署代码以解决问题所必需的。\n EP 10. Kinesis命中线程限制：AWS无法更新其与Kinesis相关的中断的状态页面，因为对状态页面的更新依赖于Kinesis。\n EP 11. Salesforce发布了一个有争议的淘汰的后期：Salesforce无法更新他们的状态页面，因为它们托管了基于Heroku的服务，并且由于他们拥有Heroku并因此将其集成到他们的基础设施中，Heroku的正常运行时间取决于他们的系统健康\n  每个人都超级兴奋了解现代公共云及其无数API。弹性！编排！自动化操作，使人类不必被醒来！ \n但是这种热情有时有些人拥有过度自动化的系统，在那里难以测试退化案件。而且，那些未经测试的退化情况下的缺点可能比在更健康的系统状态下是自动决定的略微效率或经济上行的缺点。\n 但是即使自动化是明智的，因为调整经常和/或涉及的经济学是大量的，但是自动化有时缺乏必要的“恐慌模式”，识别参数在其正常范围之外的参数。在这些情况下，自动化应该停止自动化和页面运营商​​，因为它即将开始制作一些非常不合逻辑的决策。\n  EP 1. Slack VS TGWS：Slack的自动化扔掉了一堆服务器，他们“不需要”（叙述者：他们所做的）由于空闲的CPU在网络问题期间，当交通返回的流量激增时，太多了。在其系统上导致文件描述符限制。\n EP 6. GitHub的43个网络分区：Github的数据库自动化在43秒的网络分区期间对跨国推广有不完整的记录。\n EP 8. Auth0的严重拥挤数据库：Auth0由于数据库要求减慢时，前端旋转两倍，只需更快地加剧了更多的流量。\n  如果只有一切都没有状态，呃？这些讨厌的数据库始终导致我们的问题。即使在前端层中表现出自己的问题通常往往拥塞，从数据库中逐渐增加，从数据库减慢服务堆栈中的更深。\n 这一领域是因为我们爆发了三个子课程的物质而挣扎： \n生产系统对具有低方差的平坦，均匀的负载感到满意。涉及数据库服务器时，这意味着许多非常快的查询，可能是所有索引备份，其中最坏情况绑定。\n 为了确保这一点，请将任意批量查询放入专用辅助服务器中，或在一些OLAP系统中，如BigQuery或Snowflake。或者，哎呀，转储到CSV和并行Grep。无论复杂程度如何让您快乐，都适合您的数据集大小和工作流程。\n 如果您尚未了解您的查询时间分发，以了解您是否在最终的尾部扫描了疯狂的表扫描，请停止阅读此操作并立即添加监视！\n  EP 2. Gitlab 2017 Postgres中断：非常昂贵的长期账户删除操作RAN在其生产数据库上实现，导致拥堵和失败。\n EP 5. Auth0默默地失去了一些索引：创建索引的未调解失败导致一些查询突然变得大大增加了数据库的负荷，最终导致中断。\n EP 8. Auth0严重拥挤的数据库：通过在生产系统上发生的一些ad-hoc昂贵的扫描来加剧数据库问题。\n   低魔法（好）：使用像MySQL这样无聊的东西并处理碎片。这将糟糕，因为您必须在应用程序层中做大量额外的工作，但您可能会知道它在缺失时如何工作。这可能是10年前的正确想法，但仍然很好。 \n最低魔法（更好）：只需购买更大的服务器，并使用副本或两台未设置的MySQL / PostgreSQL服务器。只要你可以，这个好主意就是常绿的。\n 高魔法（不可否认，可能在2021+中最好）：支付云提供商以为您运行数据库，包括所有备份和故障转移等，如果您真的很喜欢，如CloudSpanner，您甚至可以使用花哨数据库，如CloudSpanner，或者dynamodb，或其他。这曾经是在第三方的完整，不透明的依赖性的不可想象，但它可能是2021年的最好的想法。这些大公司已经很擅长这东西，如果他们没有，你可能已经存在了已经存在注定无论如何你在其中一个人在其中一个人在其中一家运行，他们就好了。缺点是它会花费你，因为这些服务的标记很高。\n 中间魔法（用火玩火）：使用一些将声称自动解决所有缩放和故障转移问题的东西，但您仍然必须运行，并且它在它上的生产数量较少，而不是像MySQL这样无聊的东西。出现问题时，很少有人知道如何运行或了解其内部结构，足以诊断其编排流的复杂的失败模式。我们在这些中断遇到的可能嫌疑人包括MongoDB和Cassandra。\n  EP 3. Monzo 2019 Cassandra停电：扩展Cassandra Cluster有很多不良的配置脚枪。\n EP 5. Auth0默默地失去了一些索引：在不降低现场交通的情况下，Mongo中重复复制的余额非常难以实现。\n  备份意味着如果您无法证明您可以恢复它，并且恢复会产生正确的记录，并且该恢复将在宇宙的热死亡前完成。\n  备份没有运行......永远不会发生，我正在监控！ \n备份ran并在s3中生成文件。就您的备份验证而言，这可能是。该文件是空的。或者它包含有用的字符串：错误：在目录/数据上拒绝权限。你的公司已经走了，而你尖叫着“但你退出零!!!”到深夜。\n 备份表面上包含许多大数据，但上传已损坏。你的公司走了。\n 备份包含有效数据库！但由于备份脚本中的循环错误，每个碎片都是碎片0。 87.5％的公司消失了。\n 每个备份都包含正确，有效的数据库！但从85毫秒链接下载从那个便宜的存储类将意味着恢复将需要2周。你的公司仍然消失了。\n 因此，请确保您证明您的恢复工作 - 自动化和监控此操作，不要一段时间内完成一次 - 并确保他们将在可接受的时间内恢复。期待它是一个糟糕的一天，如4小时，但不是公司结束，就像4天一样。确保公司政策智能公司对此恢复时间感到满意，并从您的领导地位签下，因此当工程团队需要7个小时时，他们不会感到惊讶，以便在灾难期间获得数据库。\n  EP 2. Gitlab的2017年Postgres中断：备份脚本每天运行，将其放入S3 ...直到软件更新打破备份脚本。修复物没有真正过测试过。\n EP 6. GitHub的43个网络分区：恢复花费了很长时间（10h +），特别是在峰值流量期间，导致网站劣化了很长时间。 \n尽管我们的努力尽力而为，但仍将发生错误。我们将介绍错误，或误解的东西，或传播错误的防火墙规则，或者其他。\n 但是，阶段推出本地化问题，以便您可以在火灾蔓延之前看到烟雾并烧毁整个网站。\n 我们讨论的很多团队都有辅助的推出方法，使他们的公司的员工成为第一个努力为其服务进行改变的用户之一，而且只在所有的客户之前都会暴露。\n  向您的Dogfooding集群推出 - 每小时或每一个更改集，目前的头版部署到您的员工。这让您自己的团队在您的客户看到它之前捕获问题。\n 金丝雀群 - 在您的释放节奏（每天一次，也许是？），将释放候选人推出到一个小部署，使其暴露于少量用户。有些公司在几十个中将这一数据中心制作;其他人基于其user_id或类似的模数来提高userbase的一些百分比。发布经理可以仔细监控本金丝雀种群中的新版本的指标，然后继续...\n 生产。现在它开始出去更广泛的世界。根据服务的关键性和释放节奏，有时会一次或有时进一步交错，就像一个时代的数据中心。\n 对于雇用这些方法的公司，当时我们大多数人从未知道一个小问题时，有很多场合，因为它被捕获在狗食，或金丝雀或有关的东西。 \n但在我们播客的实例中，公司没有使用阶段的卷展栏，事情越来越不错了......写下后的球队是第一个呼唤阶段部署的差异有多少差异。\n  ep。 4一个微妙的正则表达式缩小了CloudFlare：CloudFlare非常快速地部署了一个更昂贵的正则表达式的规则，由于CPU耗尽而下整个站点下降\n EP 11. Salesforce发布了一个有争议的后期：迅速部署DNS配置更改将其所有名称服务器脱机\n  最后，虽然我们都喜欢相信，如果我们在测试中非常彻底，但如果我们仔细阶段，我们就不会有任何充分的中断......我们都知道他们仍然会发生。\n 因此，正如我们从我们的许多中学到的那样，如果我们在中断之前建立在我们的系统和剧本中的政策和旋钮中，我们将更容易地从中恢复。\n 政策意味着经过思考和决定的事情：如果整个网站从过量的负载下降，我们首先恢复哪个流量？什么类型，或什么课程？如果这些决定是提前的，并通过领导签署，可能甚至与律师验证，工程团队将在胁迫下让事情变得更加容易。\n 旋钮意味着：我们有类似“恐慌模式”我们可以设置，其中商务流运行，负载均衡器变得更加巧妙，并且自动暂停无数的作业？我们是否有一个运行时参数我们可以调整到我们负荷的一些小数百分比，以便我们不必关闭以及一切，从而鼓励雷鸣群？ \nEP 1. Slack VS TGWS：Slack能够使用Senvoy Proxy的恐慌模式来最大限度地提高负载平衡算法在超载时发现一个健康主机的机会。\n ep。 4一个微妙的正则表达式删除CloudFlare：CloudFlare已经有策略并支持使用条款，允许它们在该服务失败时关闭其全局Web应用程序防火墙。此外，它们具有运行时参数，允许它们立即禁用此而不部署代码。\n EP 6. GitHub的43个网络分区：GitHub关闭了Web挂钩调用，并且GitHub页面在从过载中恢复时构建。\n EP 9.冰块如何释放出雷鸣群：乐队需要在翻转所有流量之后过度处理雷鸣群，而不是慢慢地升高交通。\n  在审查所有这些压力中的中断后，我们对一个非常令人鼓舞的结论感到有信心：一些常见的做法，许多我们上面列举的许多常见做法都将防止或大大地减少所有方式所产生的网站问题的严重程度。\n 再次感谢所有停机项目听众，以便您提供反馈，宣传和支持！我们正在考虑这十个中断季节一包，我们将重新组合，反映，并尽快在第二季的剧集中回归！ ", "note_en": "After 10 post-mortems in their first season, Tom and Jamie reflect on the common issues they’ve seen. Click through for details!\n   We’re just about through our inaugural season of The Downtime Project podcast, and to celebrate, we’re reflecting back on recurring themes we’ve noticed in many of the ten outages we’ve poured over. It’s been remarkable how consistent certain patterns have been–either as risks or as assets–to the engineering teams as they’ve tackled these incidents.\n Out of these recurring patterns we’ve extracted lessons that we intend to take into our own engineering teams; and so, we’ve compiled five of those lessons below for the benefit of any interested readers, with the hope that you, too, will find them useful to learn from and to prepare for. As we go, we’ll include links to the outages and episodes where each theme occurred.\n If you feel like we’ve missed any major patterns, or have any other feedback for us, please leave a comment. And thank you all for listening to the first season of The Downtime Project.\n  The instinct to “dogfood” is a great one–after all, how can you reasonably expect your customers to use your products and services if you will not? How can you endorse the workflow they enable if you don’t stake your own company’s productivity on it?\n However, this healthy instinct backfires when said dogfooding creates a dependency cycle wherein you rely on your own systems… to fix your systems.\n Other instances of this dependency pattern fall out of the otherwise-virtuous motto:  don’t repeat yourself. Why run another kind of database just for monitoring? You already run a production database very well, thank you very much. So just put the telemetry data in there, too.\n These cycles, too, can hurt badly during outages. Like, authentication needing to be working to access operational systems to fix authentication… or monitoring needing working databases to get to metric data to discover what’s wrong the the databases. Fun stuff like that.\n Even customer communication systems are sometimes broken because you use your own system to relay system status to your customers.\n  Ep 1. Slack vs TGWs: Slack couldn’t access dashboards to know what was wrong with their systems because AWS Transit Gateways needed to be healthy in order to get http traffic to their dashboards. Unfortunately, the TGW were what was unhealthy.\n Ep 3. Monzo’s 2019 Cassandra Outage: Monzo’s production database was down, which was necessary to authenticate system access and deploy code to fix the issue.\n Ep 10. Kinesis Hits the Thread Limit: AWS couldn’t update their status page about their Kinesis-related outage because updates to the status page depended on Kinesis.\n Ep 11. Salesforce Publishes a Controversial Postmortem: Salesforce couldn’t update their status page because they hosted it on a Heroku-based service, and since they owned Heroku and had therefore integrated it into their infrastructure, Heroku’s uptime depended on their system health\n  Everyone is super excited about the modern public cloud and its myriad APIs. The elasticity! The orchestration! Automating away operations so humans don’t have to get woken up!\n But this zeal sometimes has us over-automate systems where it is very difficult to test the degenerate cases. And, the downside of those untested degenerate cases may be much more significant than the slight efficiency or economic upside of having this be an automatic decision during healthier system states.\n But even if the automation  is sensible because the adjustment needs to happen often and/or the economics involved are substantial, the automation sometimes lacks a necessary “panic mode”, recognizing when parameters have swung way outside their normal range. In these cases the automation should stop automating and page the operators, because it’s about to start making some wildly illogical decisions.\n  Ep 1. Slack vs TGWs: Slack’s automation threw away a bunch of servers they “didn’t need” (narrator: they did) due to idle CPU during a network issue, then spun up far too many when the surge of traffic returned, causing file descriptor limits to be exceeded on their systems.\n Ep 6. GitHub’s 43 Second Network Partition: GitHub’s database automation did a cross-country promotion of a primary with incomplete records during a 43 second network partition.\n Ep 8. Auth0’s Seriously Congested Database: Auth0 spun up twice as many frontends when requests slowed down due to the database, just exacerbating issues with even more traffic.\n  If only everything were stateless, eh? Those pesky databases are always causing us problems. Even the issues that manifested themselves in frontend layers were often congestion that cascaded upward from databases slowing down deeper in the service stack.\n This area was so rife for material that we’ve broken out three sub-lessons:\n  Production systems are happy with flat, uniform loads with low variance. When it comes to database servers, that means lots of very fast queries, probably all index-backed, where the worst-case cost is bound.\n To ensure this, put your arbitrary batch queries in a dedicated secondary server, or in some OLAP system like BigQuery or Snowflake. Or, heck, dump to CSV and parallel grep. Whatever level of sophistication makes you happy and fits your dataset size and workflow.\n And if you don’t yet know enough about your query time distribution to know whether you have crazy table scans at the end your tails, stop reading this and go add that monitoring right now!\n  Ep 2. Gitlab’s 2017 Postgres Outage: Very expensive long-running account deletion operations ran live on their production database, leading to congestion and failure.\n Ep 5. Auth0 Silently Loses Some Indexes: Unmonitored failures to create an index caused some queries to suddenly become scans greatly increasing load on database and eventually causing outage.\n Ep 8. Auth0’s Seriously Congested Database: Database issues were exacerbated by some ad-hoc expensive scans that were happening on production systems.\n   Low magic (good): Use something boring like MySQL and deal with sharding yourself. This will suck because you have to do a lot of extra work in the application layer, but you will probably know how it works when it breaks. This was probably the right idea 10 years ago, but is still fine.\n Lowest magic (gooder): Just buy a bigger server and use one unsharded MySQL/PostgreSQL server with a replica or two. This good idea is evergreen–ride this as long as you can.\n High magic (admittedly, probably best in 2021+): Pay a cloud provider to run your database for you, including all your backups and failover, etc. You can even use a fancy database if you’d really like, like CloudSpanner, or DynamoDB, or whatever. This used to be unthinkable due the complete, opaque reliance on a 3rd party, but it is likely the best idea in 2021. These big companies have gotten very good at this stuff, and you’re probably already existentially doomed if they don’t do their job well since you’re running your company on one of them anyway. The downside is that it’s gonna cost you, because the markup on these services is high.\n Middle Magic (playing with fire): Use something that will claim to automatically solve all your scaling and failover problems, but  you still have to operate, and it has a lot less production miles on it than something boring like MySQL. When it goes wrong, very few people know how to operate or understand its internals well enough to diagnose the sophisticated failure modes of its orchestration flows. The probable suspects we encountered in these outages include MongoDB and Cassandra.\n  Ep 3. Monzo’s 2019 Cassandra Outage: Expanding Cassandra cluster had lots of poorly-understood configuration foot guns.\n Ep 5. Auth0 Silently Loses Some Indexes: The balance of resyncing replicas in mongo without degrading live traffic was very difficult to achieve.\n  Backing up means  nothing if you cannot prove you can restore it, and the restoration produces the correct records, and that restoration will complete before the heat death of the universe.\n  Backup didn’t run… that would never happen, I’m monitoring that!\n Backup ran and produced a file in S3. This might be as far as your backup validation goes. The file is empty. Or it contains the helpful string:  Error: permission denied on directory /data. Your company is gone, while you scream “but you exited zero!!!” into the night.\n Backup ostensibly contains lots of great data, but got corrupted on upload. Your company is gone.\n Backup contains a valid database! But every shard is shard 0 because of a loop bug in your backup script. 87.5% of your company is gone.\n Every backup contains the correct, valid database! But downloading it from that cheap storage class over a 85ms link will mean restoring will take 2 weeks. Your company is  still gone.\n So, make sure you prove your restores work–automate and monitor this, don’t just do it once in awhile–and make sure they will restore in an acceptable amount of time. Expect it to be a bad day, like 4 hours, but not company ending, like 4 days. Make sure corporate-policy-wise your company is comfortable with this restoration time, and get sign-off from your leadership so they won’t be surprised when the engineering team needs 7 hours to get the databases back during a catastrophe.\n  Ep 2. Gitlab’s 2017 Postgres Outage: Backup script had been running daily, putting things to S3… until a software update broke the backup script. Restorations hadn’t really ever been tested.\n Ep 6. GitHub’s 43 Second Network Partition: Restores took a very long time (10h+), especially during peak traffic, leading to a very long time the site was degraded.\n  Despite our best efforts, mistakes will still happen. We’ll introduce bugs, or misconfigure stuff, or propagate a bad firewall rule, or whatever.\n However, staged rollouts localize the issue so you can see the smoke before the fire spreads and burns down your entire site.\n A lot of teams we discussed had a thoughful rollout methodology that made sure their company’s employees were among the first users to be trying out changes to their services, and then only a small fraction of their customers would be exposed before all were.\n  Roll out to your  Dogfooding cluster — every hour, or every single change set, the current HEAD version is deployed to your employees. This lets your own team catch issues far before your customers ever see it.\n Canary cluster — at your release cadence (once a day, perhaps?), the release candidate is pushed out to a small deployment that exposes it to a small percentage of your users. Some companies make this one datacenter among dozens; others make this some percentage of the userbase, based on a modulus of their user_id or similar. A release manager may carefully monitor the metrics on this new release in the canary population, before moving on to…\n Production. Now it starts to go out to the wider world. Depending on the criticality of the service and the release cadence, sometimes all at once, or sometimes  further staggered, like a datacenter at a time.\n For companies who employed these approaches, certainly there were many occasions when most of us never knew about a small issue because it was caught in dogfooding, or canary, or what-have-you.\n But in instances in our podcasts where the companies had not utilized a staged rollout, things went markedly less well… and the teams writing the postmortems were the first to call out how much a staged deployment would have made a difference.\n  Ep. 4 One Subtle Regex Takes Down Cloudflare: Cloudflare’s very rapid deployment of a more expensive regular expression-based rule took the entire site down due to CPU exhaustion\n Ep 11. Salesforce Publishes a Controversial Postmortem: Rapid deployment of a DNS configuration change took all their name servers offline\n  Finally, while we’d all love to believe that if we’re very thorough on testing, and if we stage things thoughtfully, we won’t have any more full outages… we all know they’re still going to happen.\n So, as we learned from many of our outages, if we build in policies and knobs into our systems and playbooks ahead of outages, we’ll have a much easier time recovering from them.\n Policies means having thought through and decided things like: if the whole site goes down from excess load, which traffic do we shed first to recover? What types, or what classes of customers? If these decisions are made ahead of time, and signed off by leadership, potentially even validated with lawyers, the engineering teams will have a lot easier time getting things back under duress.\n Knobs means: do we have something like a “panic mode” we can set, where orchestration stops, load balancers get less clever, and nonessential jobs are automatically paused? Do we have a runtime parameter we can tweak to shed some fractional percentage of our load, so that we don’t have to just turn off and on everything, thereby encouraging the thundering herd?\n  Ep 1. Slack vs TGWs: Slack was able to use the envoy proxy’s panic mode to maximize the chance the load balancing algorithm found a healthy host while overloaded.\n Ep. 4 One Subtle Regex Takes Down Cloudflare: Cloudflare already had policies and supporting terms-of-use that allowed them to turn off their global Web Application Firewall when that service was failing. Additionally, they had a runtime parameters that allowed them to disable this instantly without deploying code.\n Ep 6. GitHub’s 43 Second Network Partition: GitHub turned off web hook invocations and GitHub Pages builds while it was recovering from overload.\n Ep 9. How Coinbase Unleashed a Thundering Herd: Coinbase needed to overprovision one of its clusters to deal with thundering herd after flipping all traffic off/on rather than just slowly ramping traffic back up.\n  After reviewing all these stressful outages, we feel confident in one very encouraging conclusion: a few common practices, many that we’ve enumerated above, will either prevent or dramatically lessen the severity of all manner of resultant site issues.\n Thanks again to all Downtime Project listeners out there for your feedback, advocacy, and support! We’re considering these ten outages a wrap on season one, and we’ll regroup, reflect, and be back with more episodes in season two shortly!", "posttime": "2021-06-23 08:27:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "中断,ten,数据库", "title": "十个中断的七节课 ", "title_en": "Seven Lessons from Ten Outages", "transed": 1, "url": "https://downtimeproject.com/podcast/7-lessons-from-10-outages/", "via": "", "real_tags": ["中断", "ten", "数据库"]}]