[{"category": "", "categoryclass": "", "imagename": "17bfe9d0bf95190f7b910aab1f82d8e3.jpg", "infoid": 1015944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX已向美国申请许可，允许其在美国为其Starlink卫星宽带网络部署多达500万用户终端，此前美国有近70万人注册了这项服务。\nSpaceX在3月份获得了联邦通信委员会(Federal Communications Commission)在美国多达100万个用户终端(即卫星天线)的许可证。这将允许100万个家庭接受这项服务，但SpaceX现在希望将这个数字增加五倍。\nSpaceX服务公司周五在一份许可证变更请求中告诉FCC，由于对使用Starlink非地球静止轨道卫星系统的特殊需求，SpaceX服务公司要求增加授权单位。尽管SpaceX尚未正式宣传这一系统的服务，但在短短几天内，来自所有50个州的近70万人签约，在www.starlink.com上注册了他们对上述服务的兴趣。为了确保SpaceX能够满足其宽带互联网接入服务的明显需求，SpaceX Services要求大幅增加授权单位的数量。\nSpaceX在6月中旬将注册表添加到Starlink网站。它要求人们输入他们的电子邮件和街道地址，以获取星联新闻的最新消息和你所在地区的服务可用性。SpaceX已经表示，它将在今年秋天提供测试版访问，为全面的商业发射做准备。\n70万名注册用户尚未承诺购买任何东西，但Starlink在美国可能会有许多潜在买家，他们要么没有光纤或有线互联网接入，要么只能使用单一的供应商，别无选择。\nSpaceX首席执行官埃隆·马斯克(Elon Musk)最近表示，StarLink在洛杉矶等人口稠密地区可以服务的家庭数量将面临一些物理限制。我们在洛杉矶会有一些少量的客户。但我们不能在洛杉矶招揽很多客户，因为每个手机的带宽根本不够高，他说。在农村地区，StarLink不会面临这样的限制，正如马斯克所说，StarLink将服务于最难服务的客户，否则电信公司在使用固定电话甚至是……方面都会遇到困难。手机发射塔。&#34；\nSpaceX获得了FCC的许可，可以在低地球轨道上发射近12000颗卫星，这将允许比传统卫星服务的延迟低得多。到目前为止，SpaceX已经发射了540颗Starlink卫星，下一次发射将把这个数字增加到大约600颗。\n亚马逊(Amazon)上周获得美国批准，将发射3236颗低地球轨道卫星，用于其类似的柯伊伯计划(Project Kuiper&34；)宽带服务。", "note_en": "SpaceX has asked the US for permission to deploy up to 5 million user terminals for its Starlink satellite-broadband network in the US after nearly 700,000 people in the country registered interest in the service.\n SpaceX in March  received a Federal Communications Commission license for up to 1 million user terminals (i.e.  satellite dishes) in the United States. That would allow for 1 million homes to receive the service, but SpaceX now wants to quintuple that number.\n &#34;SpaceX Services requests this increase in authorized units due to the extraordinary demand for access to the Starlink non-geostationary orbit satellite system,&#34; the company  told the FCC in a  license-change request on Friday. &#34;Despite the fact that SpaceX has yet to formally advertise this system&#39;s services, nearly 700,000 individuals represented in all 50 states signed up over a matter of just days to register their interest in said services at www.starlink.com. To ensure that SpaceX is able to accommodate the apparent demand for its broadband Internet access service, SpaceX Services requests a substantial increase in the number of authorized units.&#34;\n SpaceX  added the signup form to the  Starlink website in mid-June. It asks people to enter their email and street address to &#34;get updates on Starlink news and service availability in your area.&#34; SpaceX has  said it will offer beta access in the fall of this year to prepare for a full commercial launch.\n The 700,000 people who registered interest haven&#39;t committed to purchasing anything, but Starlink will likely have many potential buyers in the US among people who either lack fiber or cable Internet access or are  stuck with a single provider and no other choices.\n  Starlink will face some physical limits on how many homes it can serve in densely populated areas such as Los Angeles, SpaceX CEO Elon Musk  said recently. &#34;We&#39;ll have some small number of customers in LA. But we can&#39;t do a lot of customers in LA because the bandwidth per cell is simply not high enough,&#34; he said. Starlink wouldn&#39;t face such restrictions in rural areas, as Musk said that &#34;Starlink will serve the hardest-to-serve customers that telcos otherwise have trouble doing with landlines or even with... cell towers.&#34;\n SpaceX has  FCC permission to launch nearly 12,000 satellites in low-Earth orbits that will allow for much lower latencies than traditional satellite services. SpaceX has  launched 540 Starlink satellites so far, with its  next launch set to increase that number to about 600.\n Amazon last week  received US approval to launch 3,236 low-Earth orbit satellites for its similar &#34;Project Kuiper&#34; broadband service.", "posttime": "2020-08-04 00:45:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,客户,million,服务", "title": "SpaceX现在计划在美国拥有500万Starlink客户，高于之前的100万", "title_en": "SpaceX now plans for 5 million Starlink customers in US, up from 1 million", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/08/spacex-now-plans-for-5-million-starlink-customers-in-us-up-from-1-million/", "via": "", "real_tags": ["美国", "客户", "million", "服务"]}, {"category": "", "categoryclass": "", "imagename": "e14ef34af34de975c403fe9db517625c.jpg", "infoid": 1015942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嘿，Reddit！Verizon 5G技术解决方案团队的工程师Mike、Alex和Ralph将在Verizon subreddit上主持AMA，讨论5G的力量，以及它将如何改变未来。欢迎您在美国东部时间8月4日下午3点加入我们，问他们任何问题！\n美国东部时间8月4日(星期二)下午3点至5点，Verizon 5G技术解决方案团队的工程师Mike、Alex和Ralph将带您深入了解我们正在建设的内容、我们是如何建设的，并回答您围绕以下主题的所有技术问题：\n为什么我们在毫米波频谱上开始我们的网络，并使用数百万英里的光纤。\n频谱、延迟、微蜂窝技术和边缘计算等主题的技术细分。\n5G即将如何改变从工作和娱乐到零售和医疗保健的一切。\n总有更多的东西要探索。请随时在这里提前阅读我们最新的5G新闻。", "note_en": "Hey Reddit! Engineers Mike, Alex and Ralph from Verizon’s 5G technology solutions team will be hosting an AMA on the Verizon Subreddit to discuss the power of 5G, and how it will transform the future. Join us on August 4 at 3PM EST to ask them anything!\n  On Tuesday, August 4 from 3-5PM EST, engineers Mike, Alex and Ralph from Verizon’s 5G technology solutions team will give you an inside look at what we’re building, how we’re building it and answer all your technical questions around topics like:\n Why we started our network on mmWave spectrum and used millions of miles of fiber\n The technical breakdown of topics such as spectrum, latency, small cell technology and edge computing\n How 5G is about to transform everything from work and entertainment to retail and healthcare\n There’s always more to explore. Feel free to read up beforehand on our latest 5G  news here.", "posttime": "2020-08-04 00:44:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,5g,ama,技术", "title": "R/Verizon将举办5G AMA-周二8/4美国东部时间下午3-5点加入我们，参加关于5G力量的AMA", "title_en": "r/Verizon is having a 5G AMA - Join us on Tuesday 8/4 from 3-5 PM ET for an AMA on the power of 5G", "transed": 1, "url": "https://www.reddit.com/r/verizon/comments/i2y690/join_us_on_tuesday_84_from_35_pm_et_for_an_ama_on/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "via": "", "real_tags": ["美国", "5g", "ama", "技术"]}, {"category": "", "categoryclass": "", "imagename": "583554ccdb3599ff0cfc309e0bce2ef5.png", "infoid": 1015941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Varo于2017年推出，提供银行服务，目标客户是更年轻的消费者，他们喜欢在网上办理所有银行业务，而不需要进入实体分行。该公司与一系列移动银行初创公司竞争，包括Chime，Current，Space，Cleo，n26，Empower Finance，Level，Step，Moven等。\n与大多数竞争对手一样，Varo提供了一个容易进入的银行账户，没有月费或最低余额，外加高息储蓄，以及现代移动应用程序体验。尽管Varo没有实体分行，但Varo的客户可以通过全球55,000多台免费的Allpoint ATM机网络来取款。\n目前，Varo为客户提供银行服务的前端，但实际账户由Bancorp银行持有。随着时间的推移，这些账户将转移到瓦罗银行。\n瓦罗指出，这是第一位获得银行执照的美国消费者金融科技。但其他人可能很快就会效仿。今年3月，Square表示，它已获得FDIC的批准，可以开展存款保险业务，这样它就可以开设自己的银行Square Financial Services Inc.。索菲在7月份还向监管机构提交了创建SoFit银行的申请，以扩张到新产品领域。\n这也是瓦罗的计划。该公司表示，银行章程将使其能够服务于更广泛的客户需求，包括“财务弹性、负担得起的信贷渠道，以及更容易管理不稳定的现金流。”或者，更简单地说，是信用卡、贷款和储蓄产品。\n在新冠肺炎健康推动的经济低迷时期，这些扩大的产品将对客户有用。瓦罗已经对这场流行病做出了回应，提供提前获得刺激性存款的机会，提高存款和自动取款机的限额，并扩大与就业平台的合作伙伴关系，以帮助客户找到工作。\nVaro Bank创始人兼首席执行官科林·沃尔什(Colin Walsh)在声明中表示：“这对Varo来说是一个激动人心的里程碑，因为银行章程从一开始就是Varo颠覆性愿景的核心部分。”“2020年对于我们全国各地的许多人来说都是具有挑战性的，并再次突显出传统的金融体系如何无法满足勤劳的普通美国人的需求。作为一家提供全方位服务的国家银行的运营能力，让Varo有了更多的自由来提供许多美国人以前从未从他们的银行获得的那种创新和伙伴关系。我们很高兴能够通过向所有人提供公平、透明、智能和全面的金融服务来引领新一轮的金融普惠浪潮。", "note_en": "Launched in 2017, Varo offers banking services aimed at younger consumers comfortable with doing all their banking online, without access to physical branches. The company competes with a range of mobile banking startups, including Chime, Current, Space, Cleo, N26, Empower Finance, Level, Step, Moven and many others.\n Like most of its rivals, Varo offers an easily accessible bank account with no monthly fees or minimum balance, plus high-interest savings, and a modern mobile app experience. Despite its lack of brick-and-mortar branches, Varo customers can access their money through a network of more than 55,000 fee-free Allpoint ATMs worldwide.\n  Currently, Varo provides the front-end to customers’ banking services, but the actual accounts are held by The Bancorp Bank. These accounts will transition to Varo Bank over time.\n Varo notes it’s the first U.S. consumer  fintech   to be granted a banking charter. But others may soon follow. In March,  Square said it received approval from the FDIC to conduct deposit insurance so it could open its own bank, Square Financial Services Inc. SoFi in July also  filed an application with regulators to create SoFit Bank, in order to expand into new products.\n That’s Varo’s plan, as well. The company says the banking charter will allow it to serve a broader set of customer needs, including “financial resiliency, affordable access to credit, and the easier management of volatile cash flows.” Or, more simply put, credit cards, loans and savings products.\n These expanded offerings will be useful to customers amid the economic downturn drive by COVID-19 health. Already, Varo responded to the pandemic by offering early access to stimulus deposits, increasing deposit and ATM limits, and expanding tis partnerships with job platforms to help customers find work.\n “This is a thrilling milestone for Varo, as the bank charter has been a core part of Varo’s disruptive vision from the very beginning,” said Varo Bank founder and CEO Colin Walsh, in statement. “2020 has been challenging for many of us across the country and has highlighted, once again, how the traditional financial system is not meeting the needs of hardworking, everyday Americans. The ability to operate as a full-service national bank gives Varo more freedom to deliver the kind of innovation and allyship that many Americans have never had from their bank before. We are excited to lead a new wave of financial inclusion by offering fair, transparent, intelligent, and comprehensive financial services to all,” he added.", "posttime": "2020-08-04 00:43:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,银行,banking", "title": "\n手机银行初创公司Varo正在成为一家真正的银行", "title_en": "\n\t\t\t\tMobile banking startup Varo is becoming a real bank\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/mobile-banking-startup-varo-is-becoming-a-real-bank/", "via": "", "real_tags": ["手机", "银行", "banking"]}, {"category": "", "categoryclass": "", "imagename": "1be403654200d074bda1671a589e6d3c.gif", "infoid": 1015940, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在火箭按计划结束之前，第一次尝试被中断，目的是实现空的LauncherOne火箭更持续的飞行，甚至可能达到轨道高度，之后，维珍轨道团队对遇到的问题原因进行了全面调查。该公司表示，这项调查现在已接近完成，他们在一篇博客COST中指出了导致任务结束的故障的原因-一条断裂的高压管路，为LauncherOne的火箭发动机提供液氧，液氧是推动推力的燃烧所必需的组件。\n维珍指出，在技术上完成调查之前，它还有一些工作要做，但这家小型卫星太空发射公司表示，它有信心知道需要哪些技术修复来防止未来发生同样的事情，而且它已经在实施这些修复措施。\nNASA是维珍轨道公司的首批客户之一，在演示1号发射后自然没有很好地按计划进行，维珍告诉该机构，他们将不得不推迟即将到来的有效载荷发射，因为演示2将需要在不冒任何有效载荷风险的情况下进行另一次测试，以试图实现失败的首次飞行的目标。然而，美国国家航空航天局(NASA)表示，无论如何，他们在下一次尝试中都会舒适地飞行有效载荷。\n这表明了对维珍轨道和他们的计划的巨大信心。从航天发射行业的任何标准来看，年底的目标发射时间表都是非常雄心勃勃的，但该公司表示，它仍将致力于实现这一目标，同时专注于确保在技术细节和问题解决方面一切都符合标准。\n维珍轨道公司希望尽快提供其系统的定期运行发射。该公司的方法包括将一枚附加在改装后的747运输机上的火箭飞行到大型客机飞行的高度，然后火箭从飞机上分离出来，并点燃自己的发动机，将小有效载荷带到太空的其余部分。", "note_en": "After the first attempt was cut short prior to the planned conclusion of the rocket, which was aiming to accomplish a more sustained flight of the empty LauncherOne rocket, potentially even to orbital altitude, the Virgin Orbit team conducted a comprehensive investigation of the cause of the issue encountered. That investigation is now nearly complete, the company says, and in a blog cost they note the cause of the mission-ending failure – a broken high-pressure line that is supplies LauncherOne’s rocket engine with liquid oxygen, a required component for the combustion that drives thrust.\n Virgin notes that it still has some work to do before the investigation is technically complete, but the small satellite space launch company says it’s confident it knows what technical fixes are needed to prevent the same thing from happening in future, and it’s already in the process of implementing those.\n  NASA was one of Virgin Orbit’s first customers, and naturally after Launch Demo 1 didn’t go quite to plan, Virgin told the agency they’d have to bump their upcoming payload launch down the line, since Demo 2 would need to be another test without risking any payloads on board to try to achieve the goals of the flubbed first flight. NASA, however, said they’d be comfortable flying payloads on the next attempt regardless.\n That shows a tremendous amount of confidence in Virgin Orbit and their program. That end of year target launch timeframe is also highly ambitious by any standards in the space launch industry, but the company says it’s still going to aim for that while at the same time focusing on making sure everything is up to standards in terms of technical details and issue resolution.\n Virgin Orbit is hoping to be offering regular operational launches of its system soon. The company’s approach involves flying a rocket attached to a modified 747 carrier aircraft to an altitude around where large passenger jets fly, whereupon the rocket separates from the plane and ignites its own engine to carry small payloads the rest of the way to space.", "posttime": "2020-08-04 00:42:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,nasa,发射,orbit", "title": "\n维珍轨道公司将在今年晚些时候为美国国家航空航天局发射11颗卫星进行第二次轨道发射演示", "title_en": "\n\t\t\t\tVirgin Orbit to fly 11 satellites for NASA on second orbital launch demo later this year\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/virgin-orbit-to-fly-11-satellites-for-nasa-on-second-orbital-launch-demo-later-this-year/", "via": "", "real_tags": ["美国", "nasa", "发射", "orbit"]}, {"category": "", "categoryclass": "", "imagename": "14df17db2c4c95708218e1dcf413e983.jpg", "infoid": 1015939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该协议标志着最新一家公司-以及电动汽车制造商-通过与SPAC或空白支票公司的合并协议成为上市公司。电动汽车制造商尼古拉汽车(Nikola Motor)和菲斯克公司(Fisker Inc.)。在过去的两个月里，也通过SPAC成为了上市公司。在线二手车市场和传感器公司Velodyne Lidar的Shift Technologies也通过SPAC上市，绕过了传统的IPO路径。\n在最新的SPAC中，合并后的公司将以新的股票代码RIDE留在纳斯达克。DiamondPeak Holdings Corp.在交易所上市，股票代码为DPHC。\n该公司表示，它能够通过私人投资公共股权(PIPE)筹集5亿美元，其中包括通用汽车(General Motors)的7500万美元投资。其他加入的机构投资者包括富达管理与研究公司(Fidelity Management&amp；Research Company)、惠灵顿管理公司(Wellington Management Company)、联邦爱马仕考夫曼小盘基金(Federated Hermes Kaufmann Small Cap Fund)以及贝莱德管理的基金和账户。\n这笔交易预计将在2020年第四季度完成。合并后的新公司董事会将包括Lordstown公司创始人兼首席执行官史蒂夫·伯恩斯和DiamondPeak公司董事长兼首席执行官David Hamamoto。\nSPAC已经存在了几十年，有不同的名称，包括“盲池”和“干净的空壳公司和空白支票公司”。SPAC是指除了从公开市场筹集资金收购私人公司外，没有明确的商业计划或目的的公司。SPAC在2020年出现了复苏，特别是在第二季度和现在的第三季度。\n对于这样一家年轻的公司来说，洛德斯敦有一段有趣的历史。Lordstown Motors是伯恩斯的另一家公司WorkHorse Group的分支，WorkHorse Group是一家电池-电动运输技术公司，也是一家上市公司，WorkHorse是一家成立于1998年的小公司，在各个方面都陷入了财务困境。其分支洛德斯敦汽车公司(Lordstown Motors)展示了一款名为耐力(Endurance)的电动皮卡原型，目标客户是商业市场上的承包商和其他买家。\n计划从2021年下半年开始，在俄亥俄州洛德斯敦的前通用汽车组装厂每年生产2万辆这样的电动商用卡车。去年11月，洛德斯敦汽车公司(Lordstown Motors)从通用汽车手中收购了这座620万平方英尺的工厂。\n合并后的公司计划将SPAC交易的毛收入中的约6.75亿美元用于为耐力的生产提供资金。据伯恩斯称，自卡车揭幕以来，该公司已获得价值14亿美元的预购(约合2.7万份预购)。", "note_en": "The agreement marks the latest company — and electric automaker — to become a publicly traded company through a merger agreement with a SPAC, or blank check company. Electric automakers Nikola Motor and Fisker Inc. have also become public companies through a SPAC over the past two months. Shift Technologies, an online used car marketplace and sensor company  Velodyne Lidar, also went public via a SPAC, sidestepping the traditional IPO path.\n In this latest SPAC, the combined company will remain on the Nasdaq under a new ticker symbol RIDE. DiamondPeak Holdings Corp. was listed on exchange under the ticker DPHC.\n  The company said it was able to raise $500 million in private investment in public equity, or PIPE, including a $75 million investment by General Motors. Other institutional investors that joined included Fidelity Management &amp; Research Company, Wellington Management Company, Federated Hermes Kaufmann Small Cap Fund and funds and accounts managed by BlackRock.\n The transaction is expected to close in the fourth quarter of 2020. The new combined company’s board will include Steve Burns, the founder and CEO of Lordstown, and David Hamamoto, Chairman and CEO of DiamondPeak.\n SPACs have been around for decades and have gone by different names, including “blind pools” and “clean shell companies and blank-check companies. A SPAC is a corporation that has no defined business plan or purpose other than to raise money from public markets to acquire a private company. The SPAC has seen a resurgence in 2020, particularly in the second and now third quarters.\n Lordstown has an interesting history for such a young company. Lordstown Motors is an offshoot of Burns’ other company, Workhorse Group, a battery-electric transportation technology company that is also a publicly traded company.  Workhorse is a small company that was founded in 1998 and has struggled financially at various points. Its offshoot, Lordstown Motors, revealed a  prototype of an electric pickup truck called Endurance that is aimed at contractors and other buyers in the commercial market.\n The plan is to produce 20,000 of these electric commercial trucks annually, starting in the second half of 2021, at the former GM Assembly Plant in Lordstown, Ohio. Lordstown Motors acquired in November the 6.2 million-square-foot factory from GM.\n The combined company plans to use about  $675 million of gross proceeds from the SPAC transaction to  fund production of the Endurance. Since the truck’s unveiling, the company has secured pre-orders valued at $1.4 billion (or about 27,000 total pre-orders), according to Burns.", "posttime": "2020-08-04 00:42:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "motors", "title": "\nLordstown Motors成为最新一家使用SPAC上市的电动汽车制造商", "title_en": "\n\t\t\t\tLordstown Motors becomes latest EV automaker to use a SPAC to go public\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/lordstown-motors-becomes-latest-ev-automaker-to-use-a-spac-to-go-public/", "via": "", "real_tags": ["motors"]}, {"category": "", "categoryclass": "", "imagename": "ea33a189fee6cb16101d56466c24dea9.jpg", "infoid": 1015938, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数人同意，重返办公室的决定应该涉及企业、政府和医疗官员以及科学家的结合，他们对新冠肺炎和一般的传染病有深刻的了解。具体时间将取决于许多因素，包括政府开放的意愿、专家对当前条件的看法、企业领导层对风险的容忍度(或远程运营业务的合理性)、你的企业恰好在哪里以及那里的当前条件。\n这并不意味着每一家能够开业的企业都会这样做，但如果他们获得了绿灯，他们至少可以开始召回一定比例的员工。但是，通勤、办公室人口密度和距离、电梯的使用、你可以合理地深度清洁多少、每天戴口罩8小时意味着什么，以及许多其他因素都给这一前景蒙上了一层阴影。\n为了了解科技公司是如何看待这一问题的，我们采访了一些高管，以了解他们的观点。今年，除了一小部分员工外，大多数人都无法重返办公室。但为了更全面地了解情况，我们还采访了一名传染病专科医生和一名政府官员，以了解他们对这一问题的看法。\n虽然有一些指导方针可以帮助公司，但我们采访的大多数高管发现，尽管他们错过了面对面的互动，但他们乐于慢慢来，更担心将员工置于危险之中，而不是急于恢复正常运营。\n帮助医院寻找和招聘护士的初创公司Uncredible Health的首席执行官兼联合创始人伊曼·阿布泽德(Iman Abuzeid)表示，在新冠肺炎上任之前，她的公司就处于半偏远状态，但从那时起，团队现在就完全偏远了。每当旧金山市长批准时，她说她将重新开放办公室，但公司的30名员工将可以选择继续远程工作。\n她指出，事实证明，对一些员工来说，在家工作非常具有挑战性。“我确实想强调两个非常重要的群体，这两个群体需要在这个叙述中突出。首先，我们有带着年幼孩子的员工，学校关闭了，所以永远在家里工作，甚至今年剩下的时间都不是一个真正的选择，第二组是住在较小公寓的员工，他们有室友，在家里工作不舒服，“阿布泽德解释说。\n她说，只要允许，这些人就需要去办公室。对于纽约市一家拥有80人的数据库初创公司蟑螂实验室(Cockroach Labs)的首席人事官林赛·格勒纳瓦特(Lindsay Griawalt)来说，在这一点上让人们回到办公室必须有一个非常令人信服的理由。", "note_en": "Most agree that the decision to return to the office should involve a combination of business, government and medical officials and scientists who have a deep understanding of COVID-19 and infectious disease in general. The exact timing will depend on many factors, including the government’s willingness to open up, the experts’ view of current conditions, business leadership’s tolerance for risk (or how reasonable it is to run the business remotely), where your business happens to be and the current conditions there.\n That doesn’t mean every business that can open will, but if and when they get a green light, they can at least begin bringing some percentage of employees back. But what that could look like is clouded in great uncertainty around commutes, office population density and distancing, the use of elevators, how much you can reasonably deep clean, what it could mean to have a mask on for eight hours a day, and many other factors.\n To get a sense of how tech companies are looking at this, we spoke to a number of executives to get their perspective. Most couldn’t see returning to the office beyond a small percentage of employees this year. But to get a more complete picture, we also spoke to a physician specializing in infectious diseases and a government official to get their perspectives on the matter.\n  While there are some guidelines out there to help companies, most of the executives we spoke to found that while they missed in-person interactions, they were happy to take things slow and were more worried about putting staff at risk than being in a hurry to return to normal operations.\n Iman Abuzeid, CEO and co-founder at Incredible Health, a startup that helps hospitals find and hire nurses, said her company was half-remote even before COVID-19 hit, but since then, the team is now completely remote. Whenever San Francisco’s mayor gives the go-ahead, she says she will reopen the office, but the company’s 30 employees will have the option to keep working remotely.\n She points out that for some employees, working at home has proven very challenging. “I do want to highlight two groups that are pretty important that need to be highlighted in this narrative. First, we have employees with very young kids, and the schools are closed so working at home forever or even for the rest of this year is not really an option, and then the second group is employees who are in smaller apartments, and they’ve got roommates and it’s not comfortable to work at home,” Abuzeid explained.\n Those folks will need to go to the office whenever that’s allowed, she said. For Lindsay Grenawalt, chief people officer at Cockroach Labs, an 80-person database startup in NYC, said there has to be a highly compelling reason to bring people back to the office at this point.", "posttime": "2020-08-04 00:41:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "领袖,returning,员工", "title": "\n在大流行期间，重返办公室仍然是科技领袖面临的一个悬而未决的问题", "title_en": "\n\t\t\t\tAmid pandemic, returning to offices remains an open question for tech leaders\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/amid-pandemic-returning-to-offices-remains-an-open-question-for-tech-leaders/", "via": "", "real_tags": ["领袖", "returning", "员工"]}, {"category": "", "categoryclass": "", "imagename": "1dca0dd86a275909f1ffaef41eef55c5.jpg", "infoid": 1015936, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "消息人士告诉天空新闻，智能手表制造商Garmin向通过名为Arete IR的勒索软件谈判业务加密其计算机文件的犯罪分子支付了数百万美元的赎金。\n本周早些时候，天空新闻(Sky News)报道称，Garmin已经获得了解密密钥，可以从WastedLocker病毒中恢复其文件。\n安全消息人士认为，这种病毒是由与Evil Corp有关联的个人开发的，Evil Corp是一个总部设在俄罗斯的网络犯罪组织，去年12月受到美国财政部的制裁。\n据知情人士透露，在接受天空新闻(Sky News)不愿透露姓名的采访时，Garmin最初试图通过另一家专门应对这些事件的公司支付赎金。\n然而，这家公司回应说，由于存在违反制裁的风险，它没有就WastedLocker案件的赎金支付进行谈判。\n消息人士称，在最初受到指责后，Garmin随后寻求Arete IR公司的服务，该公司声称，WastedLocker勒索软件与受制裁个人之间的联系尚未得到证明。\n据Garmin称，其系统在7月23日星期四受到病毒攻击。7月24日星期五，Arete在其网站上发布了一项研究，引用非确凿的证据，驳斥了将WastedLocker归因于Evil Corp的研究。\n在制裁发布后，犯罪分子开始开发勒索软件，因此在美国财政部的制裁通知中没有特别提到这一点。\n美国政府尚未公开将WastedLocker与被制裁的个人联系起来。\n制裁意味着，美国人通常被禁止与与邪恶公司有关联的17个人和7个商业实体进行交易，即使是在敲诈勒索的情况下也是如此。\n知情人士告诉天空新闻，Garmin-一家在纳斯达克公开上市的美国跨国公司-没有直接向黑客付款。\n另有消息人士向天空新闻证实，Arete IR支付这笔款项是作为其勒索软件谈判服务的一部分，尽管Arete辩称，WastedLocker并不是Evil Corp.的最终作品。\nGarmin和Arete IR都没有否认这笔款项是在提供机会时支付的。\nArete的一名代表告诉天空新闻，他们不能对Garmin发表评论，称：&#34；Arete对所有客户负有合同保密义务，因此不能讨论任何客户身份或互动。\n关于WastedLocker的运营商受到美国制裁的指控，他们补充道：&#34；Arete遵循所有建议和要求的筛查，以确保遵守美国的贸易制裁法律。", "note_en": "Smartwatch maker Garmin paid a multi-million dollar ransom to criminals who encrypted its computer files through a ransomware negotiation business called Arete IR, sources have told Sky News.\n Earlier this week Sky News reported that Garmin had   obtained the decryption key to recover its files from the WastedLocker virus.\n  Security sources believe this virus has been developed by individuals linked to Evil Corp, a cyber crime group based in Russia that was   sanctioned by the US Treasury last December.\n   According to people with knowledge of the matter, speaking to Sky News on the condition of anonymity, Garmin had initially sought to pay the ransom using another firm which specialises in responding to these incidents.\n However, this firm responded that it didn&#39;t negotiate ransom payments in WastedLocker cases due to the risk of running foul of the sanctions.\n   The sources said after being initially rebuked, Garmin then sought the services of Arete IR, a firm which claims that the links between the WastedLocker ransomware and sanctioned individuals have not been proven.\n  According to Garmin its systems were hit by the virus on Thursday 23 July. On Friday 24 July, Arete tweeted a study on its website which disputed research attributing WastedLocker to Evil Corp, citing inconclusive evidence.\n  The criminals began developing the ransomware after the sanctions were issued, and so it is not mentioned specifically in the US Treasury&#39;s sanction notice.\n The US government has not yet made a public attribution linking WastedLocker to the sanctioned individuals.\n The sanctions mean that &#34;US persons are generally prohibited from engaging in transactions&#34; with the 17 individuals and seven business entities tied to Evil Corp, even in cases of extortion.\n   Sources with knowledge of the incident told Sky News that Garmin - an American multinational which is publicly listed on the NASDAQ - did not directly make a payment to the hackers.\n Separate sources confirmed to Sky News that Arete IR made the payment as part of its ransomware negotiation services, although Arete argues that WastedLocker is not conclusively the work of Evil Corp.\n Neither Garmin nor Arete IR disputed that the payment was made when offered the opportunity to do so.\n A representative for Arete told Sky News they could not comment regarding Garmin, stating: &#34;Arete has contractual confidentiality obligations to all clients and therefore cannot discuss any client identity or interactions.&#34;\n Regarding the allegation that the operators of WastedLocker are covered by US sanctions, they added: &#34;Arete follows all recommended and required screenings to insure compliance with US trade sanctions laws.&#34;", "posttime": "2020-08-04 00:39:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,遭受,suffering,制裁", "title": "消息来源：在遭受网络攻击导致服务中断后，Garmin使用一家名为Arete IR的中介机构向黑客支付了“数百万美元”的赎金", "title_en": "Sources: after suffering a cyberattack that led to service outages, Garmin paid a “multi-million dollar” ransom to hackers using an intermediary called Arete IR", "transed": 1, "url": "https://news.sky.com/story/garmin-paid-multi-million-dollar-ransom-to-criminals-using-arete-ir-say-sources-12041468", "via": "", "real_tags": ["黑客", "遭受", "suffering", "制裁"]}, {"category": "", "categoryclass": "", "imagename": "ebc1aa8af496f8b6fc76a15dd90fffee.png", "infoid": 1015935, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无需支付荒谬的价格即可获得令人难以置信的照片。Pixel4a摄像头具有HDR+、夜视等功能。\n自适应电池可以学习您最喜欢的应用程序，并降低您很少使用的应用程序的电量。\n通过在肖像模式下将艺术模糊添加到背景中，将焦点放在您的主题上。\n你还可以在Google Photos中使用肖像模糊功能为未在像素上拍摄的肖像添加模糊效果。\nPixel 4a的自适应电池可以学习您最喜欢的应用程序，并降低您很少使用的应用程序的电量。\nPixel 4a的自适应电池可以学习您最喜欢的应用程序，并降低您很少使用的应用程序的电量。\n快速充电电池的设计是为了让你尽快回到你喜欢的东西上。6个。\n让Pixel4a在旅途中帮助你做更多你喜欢做的事情。\n使用新的Google助手控制您的手机和应用程序、发送文本、随时随地处理多项任务等。7个。\n使用新的Google助手控制您的手机和应用程序、发送文本、随时随地处理多项任务等。7个。\n知道您的手机正在保护您和您的物品的安全，让您高枕无忧。\n如果你的手机感应到你出了车祸，车祸检测可以帮你拨打911。11个。\n作为会员，您将获得100 GB的云存储、自动电话备份，以及更多可以与家人分享的好处。12个。\n作为Google One会员，您从Google Store购买的所有设备和配件可以获得高达10%的返还。12个。\n*谷歌商店融资是由Synchrony Bank单独发行和服务的信用卡账户，只能用于在store.google.com购买。信用卡申请决定完全由同步银行作出。任何电话购买上显示的每月付款只适用于使用谷歌商店融资信用卡账户。如果您每月在到期日之前付款，则显示的每月付款(根据税、运费和在同一销售交易中购买的任何其他项目进行调整)应允许您在24个月内付清电话购买款项，前提是该余额是该时间段内您账户上的唯一余额。如果您的账户上有其他余额，这笔每月付款将被添加到适用于这些余额的每月付款中。对于新账户：电话购买(包括电话在内的任何交易)的年利率为0.00%。所有其他(定期)购买的APR为29.99%。最低利息是2美元。APR截至2019年10月23日是准确的。须经信贷批准。", "note_en": "Get incredible photos without paying a ridiculous price. The Pixel 4a camera has HDR+, Night Sight, and more.\n The Adaptive Battery learns from your favorite apps and reduces power to the ones you rarely use.\n     Focus on your subjects by adding an artistic blur to the background in Portrait Mode.\n  You can also add a blur effect to portraits not shot on a Pixel later with Portrait Blur in Google Photos.\n  The Adaptive Battery of Pixel 4a learns your favorite apps and reduces power to the ones you rarely use.\n The Adaptive Battery of Pixel 4a learns your favorite apps and reduces power to the ones you rarely use.\n  The fast-charging battery is designed to get you back to the things you love as quickly as possible. 6\n Do more of what you love by letting Pixel 4a help you while on the go.\n Use the new Google Assistant to control your phone and apps, send texts, multitask on the go, and more. 7\n      Use the new Google Assistant to control your phone and apps, send texts, multitask on the go, and more. 7\n  Get peace of mind knowing your phone is working to keep you and your stuff safe.\n  If your phone senses that you’ve been in a car accident, car crash detection can help reach 911 for you. 11\n   As a member, you’ll get access to 100GB of cloud storage, automatic phone backup, and more benefits that you can share with your family. 12\n As a Google One member, you can earn up to 10% back on all your device and accessory purchases from the Google Store. 12\n     * Google Store Financing is a credit card account issued and serviced solely by Synchrony Bank and can be used only for purchases at store.google.com. Credit card application decisions are made solely by Synchrony Bank. The monthly payment shown on any phone purchase only applies with the use of a Google Store Financing credit card account. If you make your payments by the due date each month, the monthly payment shown (adjusted for taxes, shipping and any other items purchased in the same sales transaction) should allow you to pay off the phone purchase within 24 months if this balance is the only balance on your account during that time period. If you have other balances on your account, this monthly payment will be added to the monthly payment applicable to those balances. For new accounts: Phone purchases (any transaction that includes a phone) APR is 0.00%. All other (regular) purchases APR is 29.99%. Minimum interest charge is $2.00. APRs are accurate as of 10/23/2019. Subject to credit approval.", "posttime": "2020-08-04 00:38:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,购买", "title": "谷歌像素4a", "title_en": "Google Pixel 4a", "transed": 1, "url": "https://store.google.com/product/pixel_4a", "via": "", "real_tags": ["谷歌", "google", "购买"]}, {"category": "", "categoryclass": "", "imagename": "4027801a27d9001d8b49466bb1e412e6.jpg", "infoid": 1015934, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一种名为Leap的新系统在USENIX ATC‘20上获得了最佳论文奖，因为它在数据中心网络上产生了与本地机器相当的远程内存访问速度。\n在大型计算机集群中的应用程序之间共享服务器内存仍然是云和高性能计算社区的主要目标。通过快速联网技术，整个中心服务器机架上可用的内存可以像管理单一资源一样由调度员进行管理，从而大大提高了速度和性能。\n密歇根大学(University Of Michigan)研究人员开发的一项名为Infiniswap的服务使这项名为“内存解聚”的技术在2017年成为可能，但它仍然受到几个延迟开销的影响，这使得现实世界不太可能采用这项技术。现在，同一实验室的一个名为Leap的新系统通过将一种称为预取的技术应用于远程内存环境，改进了这个解决方案和其他分解解决方案。Leap在2020年USENIX年度技术大会上荣获最佳论文奖。\n根据Leap合著者Hasan Al Maruf的说法，实际内存分解面临的主要问题是本地和远程内存访问之间的速度差异。\n“当你在本地访问内存时，”密歇根大学计算机科学与工程部的博士生Maruf说，“内存运行在纳秒级别。但当你进入网络时，一切都是在微秒级别上运行的。“。\n从内存远程加载一页数据平均需要4或5微秒(一页是处理器通常一次从内存获取的最小数据单位)。在最坏的情况下，可能需要长达40-50微秒的时间。\n这听起来可能不是很多，但从纳秒到微秒的数量级延迟代表着性能的重大下降-与将RAM与固态驱动器进行比较，或将固态驱动器与硬盘驱动器进行比较大致相同。折衷太大了，现有的方法证明对远程内存访问是有利的。\nMaruf和合著者Mosharaf Chowdhury教授写道：“我们的测量显示，在像Infiniswap这样的最先进的内存分解系统中，平均4KB的远程页面访问需要近40微秒。”“如此高的访问延迟会显著影响性能，因为内存密集型应用程序最多可以容忍单个微秒的延迟。”\n操作系统带来的管理费用进一步加剧了这个问题。这些远程设置中的操作系统用来访问内存中地址的数据路径最初是为与本地磁盘交互而设计的，本地磁盘在更慢的毫秒级别运行。这些数据路径与旨在隐藏磁盘访问时间的功能捆绑在一起，这些功能对数据中心网络来说是不现实的，最终会使一切陷入困境。\nMaruf和Chowdhury在Leap上的目标是通过两个技巧“隐藏”这些延迟来源：尽可能地预取页面，以及使用更高效的数据路径，允许他们丢弃操作系统不相关的磁盘访问功能。\n他们使用预取器的目标是减少在程序所需的关键路径中调用远程内存的次数，使运行程序的本地机器上的有用数据近在咫尺。现在，这种技术在单机设置中很常见，其中最常见的性能瓶颈是调用硬盘。在那里，系统试图聪明地识别可能很快有用的序列中的额外指令，并将它们放入处理器的更快的高速缓存中。\n在远程内存设置中模拟此技术变得很困难，因为相关数据可能不会按顺序存储-事实上，它可能会随机存储在数据中心的所有可用内存中。现有的解决此问题的尝试确定如何实时访问内存的模式，或者跟踪程序在整个虚拟内存地址空间上的内存访问足迹。\n取而代之的是，作者只对程序内存访问中的模式进行了近似。这使Leap能够识别预取额外数据的最明显机会，而不必占用更精确的资源-只有程序重复访问内存中相同地址的情况，即所谓的多数访问模式，才会被识别。\n结合使用为程序访问的远程内存中的每个地址记录的简化数据路径，预取器允许几乎所有应用程序像使用本地内存一样运行。\nMaruf说：“这种预取解决方案有助于隐藏网络延迟，数据路径确保操作系统没有开销。”\n使用Leap修复系统的数据路径在95%的任务中提供了最差1微秒的延迟，平均为5或6微秒。将预取程序包括在他们的测试中，Leap为85%的任务提供了亚微秒延迟，或以纳秒为单位的延迟。\n从长远来看，这些速度极大地推动了数据中心内存分解的未来。在短期内，Leap可以在从远程内存以外的存储设备(如传统磁盘和固态驱动器)读取页面时提供延迟优势。\n“让一些东西存在和让东西变得实用是两码事，”他说。“如果我们不越过这个性能延迟开销的界限，我们拥有的任何系统都不会投入使用。”\n但Maruf表示，它的实际采用仍然存在障碍。乔杜里的实验室正在解决未来工作中该领域面临的安全和弹性挑战，这本身可能会给系统带来额外的延迟。\n“我们正在许多不同的方向进行探索，”Maruf说，“如果我们能全部完成，我们希望我们能在公共云设置中让事情变得更实用、更有用。”\nLEAP是在远程举行的2020年USENIX年度技术会议上发表的题为“用LEAP有效预取远程内存”的论文中提出的。在USENIX ATC网站上观看Maruf关于这项工作的虚拟演示文稿。", "note_en": "A new system called Leap earned a Best Paper award at USENIX ATC ‘20 for producing remote memory access speed on par with local machines over data center networks.|\n  Sharing server memory between applications in large computer clusters is still a major goal for cloud and high-performance computing communities. Through fast networking technology, the memory available throughout the center’s server racks could be managed by schedulers as though it were a single resource, providing a major boost to speed and performance.\n A service developed by University of Michigan researchers called Infiniswap made this technology — called “memory disaggregation” — feasible in 2017, but it still suffered from several latency overheads that made real-world adoption unlikely. Now, a new system from the same lab called Leap improves upon this and other disaggregation solutions by applying a technique called prefetching to remote memory environments. Leap earned a Best Paper Award at the 2020 USENIX Annual Technical Conference.\n The main problem facing practical memory disaggregation, according to Leap co-author Hasan Al Maruf, was a speed difference between local and remote memory access.\n “When you access memory locally,” says Maruf, a PhD student in U-M’s Computer Science and Engineering division, “memory runs at the nanosecond level. But when you go to the network, things run at the microsecond level.”\n It takes an average of 4 or 5 microseconds to load a page of data from memory remotely (a page is the smallest unit of data the processor typically fetches from memory at a time). In the worst case it can take up to 40-50 microseconds.\n This might not sound like much, but the order of magnitude delay in moving from nanoseconds to microseconds represents a major performance drop—about the same as comparing RAM with a solid state drive, or solid state with a hard disk drive. The tradeoff was too great, and existing methods proved favorable to remote memory access.\n “Our measurements show that an average 4KB remote page access takes close to 40 microseconds in state-of-the-art memory disaggregation systems like Infiniswap,” write Maruf and co-author Prof. Mosharaf Chowdhury. “Such high access latency significantly affects performance because memory-intensive applications can tolerate at most single microsecond latency.”\n This issue was compounded further by overheads introduced by the operating system. The data path used by operating systems in these remote settings to access an address in memory was originally designed for interactions with local disks, which operate at the even slower millisecond level. These data paths come bundled with features meant to hide this disk access time that aren’t practical for data center networks and end up bogging everything down.\n It was Maruf and Chowdhury’s goal with Leap to “hide” these sources of latency with two tricks: prefetching pages wherever possible, and using more efficient data paths that allow them to discard the operating system’s irrelevant disk-access features.\n Their goal with the prefetcher is to reduce the number of calls to remote memory in the critical path needed by the program, keeping useful data close at hand on the local machine running the program. This technique is now commonplace in single-machine settings where the most common performance bottleneck is making calls to the hard disk. There, systems try to smartly identify additional instructions in a sequence that might be useful soon and pull them into the processor’s much-faster cache.\n Emulating this technique becomes difficult in remote memory settings because related data might not be stored sequentially – in fact, it might be stored randomly all across the data center’s available memory. Existing attempts to solve this problem identify patterns in how memory is accessed in real time, or keep track of the program’s memory access footprint on the entire virtual memory address space.\n  Instead, the authors only approximate patterns in a program’s memory access. This allows Leap to identify the most clear opportunities to prefetch additional data without having to take up resources being more precise – only those cases where the program accesses the same addresses in memory repeatedly, the so-called majority access pattern, will be identified.\n Combined with using simplified data paths that are recorded for each address the program accesses in remote memory, the prefetcher allows nearly all applications to run as if they were working with local memory.\n “This prefetching solution helps to hide the network latency, and the data path makes sure the operating system has no overhead,” Maruf says.\n Using Leap to fix the system’s data paths provided single-microsecond latency at worst in 95% of tasks, with an average of 5 or 6 microseconds. Including the prefetcher in their tests, Leap provided sub-microsecond latency, or latency in nanoseconds, on 85% of tasks.\n These speeds provide a big boost to the future of memory disaggregation in data centers in the long term. In the short term, Leap can provide latency benefits when reading pages from storage devices other than remote memory, like traditional disks and solid state drives.\n “Making something exist and making things practical are two different things,” he says. “If we didn’t cross the boundary of this performance latency overhead, whatever system we have wouldn’t be put to use.”\n But Maruf says there are still barriers to its practical adoption. Chowdhury’s lab is tackling security and resiliency challenges facing the field in future work, which themselves may introduce additional latency in the systems.\n “We are exploring in many different directions,” says Maruf, “and if we can finish them all we hope we’ll make things more practical and usable in public cloud setups.”\n Leap was presented in the paper “  Effectively Prefetching Remote Memory with Leap ” at the 2020 USENIX Annual Technical Conference, held remotely. Watch Maruf’s virtual presentation on the work at   the USENIX ATC website .", "posttime": "2020-08-04 00:37:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,隐藏,network", "title": "在数据中心“隐藏”网络延迟以实现快速内存", "title_en": "“Hiding” network latency for fast memory in data centers", "transed": 1, "url": "https://news.engin.umich.edu/2020/07/hiding-network-latency-for-fast-memory-in-data-centers/", "via": "", "real_tags": ["内存", "隐藏", "network"]}, {"category": "", "categoryclass": "", "imagename": "9e910ad7e362cbe64b17d347f7a19c4e.jpg", "infoid": 1015933, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "默认情况下，安装和创建数据库集群后，PostgreSQL将只在localhost上列出。不允许远程访问。\n[postgres@postgres-lab~]$netstat-lptnu|grep post(不是所有进程都可以识别，不会显示非拥有的进程信息，您必须是root用户才能看到所有进程信息。)tcp 0 0 127.0.0.1：5432 0.0.0.0：*LISTEN 1977/邮局局长tcp6 0 0：：1：5432：*LISTEN 1977/Postmaster。\n[postgres@postgres-lab~]$ps AUX|grep postgres1977 0.0 2.5 286388 14864？SS Jun28 0：02/usr/pgsql-12/bin/postmaster-D/postgresql/datapostgres 1979 0.0 0.2 140768 1360？党卫军6月28日0：00Postgres：伐木机Postgres 19810.0 0.5 286504 3028？党卫军6月28日0：00Postgres：棋子指针Postgres 1982 0.0 0.2 286388 1696年？SS Jun280：03 Postgres：背景作家Postgres 1983 0.0 0.9 286388 5676？SS Jun280：03 Postgres：WalWriter Postgres 19840.0 0.4 286924 2688？SS Jun28 0：02 postgres：自动真空发射器。\n[postgres@postgres-lab~]$cd/postgresql/data/[postgres@postgres-lab data]$ls-lah postgresql.conf-rw。1 Postgres Postgres 26K Jun 28 21：44 postgresql.conf。\n将postgresql.conf参数LISTEN_ADDRESS更改为您的服务器IP或*以侦听服务器上所有可用的IP：\n[postgres@postgres-实验室数据]$vi postgresql.conf##----##连接和身份验证##。---##-连接设置-LISTEN_ADDRESS=&#39；*&#39；##要侦听的IP地址；##以逗号分隔的地址列表；##默认为&#39；localhost&#39；；全部使用&#39；*&#39；\n重新启动PostgreSQL以应用更改-您可以使用root os用户服务中的systemctl或Postgres os用户中的pg_ctl-D PGDATA重新启动来执行此操作：\n[postgres@postgres-lab~]$netstat-lptnu|grep post(不是所有进程都可以识别，不会显示非拥有的进程信息，您必须是root用户才能看到所有进程信息。)tcp 0 0 0.0.0.0：5432 0.0.0.0：*Listen 30161/邮局局长tcp6 0 0：5432：*Listen 30161/邮局局长\n我们可以在其中提供信息，从哪个地址到哪个数据库，哪个用户，通过我们允许的连接方式。另外，我们还必须提供连接类型。\n此文件与postgresql.conf位于同一位置(我们可以通过在postgresql.conf中设置pg_hba参数来更改此行为)：\n[postgres@postgres-lab~]$cd/postgres/data/[postgres@postgres-lab data]$vi pg_hba.conf##type数据库用户地址方法##&#34；local&#34；仅适用于Unix域套接字连接本地所有信任#IPv4本地连接：主机所有127.0.0.1/32信任#IPv6本地连接：主机所有：：1/128信任。\n对于DATABASE，如果数据库名应该与正在连接的用户名相同，则可以指定数据库名或使用特殊值sameuser。\n使用USER，我们可以指定USER或ROLE-角色名称前面应该有+号。\n使用Method字段，我们可以设置其中一种身份验证方法-最重要的是：\nTrust-允许无密码连接-为来自数据库服务器本身的本地连接设置的moslty。\n密码-获取纯密码后允许连接-不要在不受信任的网络中使用-更好-&&gt;不要使用此选项\n如果您不想在此创建任何限制，则可以在数据库和用户字段中指定特殊的单词ALL。\n可能会出现这样的情况，我们必须使用名为auth-options的附加字段来指定详细信息，例如，用于hostssl连接类型。这个话题将在另一篇文章中讨论。\n示例PG_HBA记录-允许所有用户从所有IP地址连接到任何数据库-仅使用密码。\n默认URI语法-您可以这样连接：psql postgreSQL：//user：passwd@host：5432/dbame或使用更常见的方法：使用参数中提供的连接详细信息从psql连接到远程数据库(对于来自0.0.0.0/0的连接，由于pg_hba.conf中的MD5方法，它将要求输入密码)：\n我们还可以使用参数-U指定与我们当前使用的操作系统用户名不同的用户名。\n此外，所有这些参数都可以从shell变量中获取，这些变量的名称是自描述的-如果我们设置了所有这些变量，我们只需使用简单的psql命令进行连接：\nPostgres=##select version()；X86_64-PC-linux-gnu上的-PostgreSQL12.3版，编译：GCC(GCC)8.3.1 20191121(红帽8.3.1-5)，64位(1行)。\nPostgres=##\\Conninfo您已作为用户&#34；postgres&#34；连接到主机&#34；10.128.0.2&#34；端口&#34；5432&#34；上的数据库&#34；postgres&#34；。\n[postgres@postgres-lab~]$psql-c&#34；SELECT CURRENT_TIME&#34；-f CREATE_USER.sql-c&#34；SELECT CURRENT_TIME&#34；CURRENT_TIME-14：14：26.922453+00(1行)CREATE ROLECREATE ROLECREATE ROLE CURRENT_TIME。\nPostgres=##\\？常规\\版权显示PostgreSQL使用和分发条款\\交叉表视图[列]执行查询并在交叉表中显示结果\\errVerbose最大限度地显示最新错误消息\\g[文件]或；EXECUTE QUERY(并将结果发送到文件或|管道)\\gdesc描述查询结果，而不执行\\gexec EXECUTE QUERY，然后执行其结果集[前缀]中的每个值执行查询并将结果存储在psql变量\\gx[file]中，但强制扩展输出模式\\q退出psql\\watch[sec]每秒执行查询查询缓冲区\\e[file][line]使用外部编辑器编辑查询缓冲区(或文件)\\ef[FUNCNAME[line]]使用外部编辑器编辑函数定义\\ev[VIEWNAME[line]]使用外部编辑器编辑视图定义\\p显示查询缓冲区的内容\\r重置(清除)查询缓冲区\\s[file]显示历史记录或将其保存到文件\\w file将查询缓冲区写入文件。\nPostgres-##\\h SELECTCommand：SELECTDescription：从表或视图中检索行语法：[WITH[RECURSIVE]WITH_QUERY[，...]]SELECT[ALL|DISTINCT[ON(Expression[，...])]][*|Expression[[as]output_name][，...]][FROM_Item[，...]][WHERE条件][GROUP BY GROUPING_ELEMENT[，...]][HAVING CONDITION[，...]][Window WINDOW_NAME AS(WINDOW_DEFINITION)[，...]][...]。\nPostgres-##\\h UPDATECommand：UPDATE描述：更新表的行语法：[WITH[RECURSIVE]WITH_QUERY[，...]UPDATE[ONLY]TABLE_NAME[*][[AS]别名]SET{COLUMN_NAME={表达式|DEFAULT}|(COLUMN_NAME[，...])=[ROW]({EXPRESS|DEFAULT}[，...])|(COLUMN_NAME[，...])=(子选)}[，...]。。\nPostgres-##\\h ALTER SYSTEM命令：ALTER SYSTEMD描述：更改服务器配置参数语法：ALTER SYSTEM SET CONFIGURATION_PARAMETER{TO|=}{VALUE|&#39；VALUE&#39；|DEFAULT}ALTER SYSTEM RESET CONFIGURATION_PARAMETER ALTER SYSTEM RESET ALLURL：https://www.postgresql.org/docs/12/sql-altersystem.html。\n使用.pgpass文件保存密码，便于与PostgreSQL数据库服务器连接。默认情况下，客户端在您的主目录中查找.pgpass。此文件在Linux上应该具有0600权限。\n我们可以通过设置shell变量PGPASSFILE来更改.pgpass的位置。示例.pgpass可能如下所示-当然，我们可以为不同的连接在其中添加多行：\n下面的.pgpass为用户postgres设置密码postgres12345，以便用户postgres在连接到端口5432上的主机postgres-lab时连接到数据库postgres。保存.pgpass后，我们无需提供密码即可连接到数据库：\n服务文件允许我们保存连接描述并按简单名称调用它们。服务文件可以打开：\nPostgreSQL客户端始终首先查找覆盖系统一级的上级服务文件。服务文件中的示例记录如下所示：\n保存服务文件后，我们可以这样连接psql(密码将来自.pgpass)：\n设置之后，记得重新加载PostgreSQL服务器。默认情况下，日志文件位于$PGDATA/log目录中-在我们的示例配置中，该目录将为：\n[postgres@postgres-lab~]$ls-lah/postgresql/data/log/tal24Kdrwx。2 Postgres Postgres 162 7月3日00：00.drwx。20Postgres Postgres 4.0K 7月3日00：00.-RW。1 Postgres Postgres 153 Jul 3 10：07 postgresql-Fri.log-rw。1 Postgres Postgres 0 6月29 00：00 postgreSQL-Mon.log-rw。1 Postgres Postgres 186 Jun 28 21：46 postgreSQL-Sun.log-rw。1 Postgres Postgres 4.7K 7月2日17：00 PostgreSQL-Thu.log-rw。1 Postgres Postgres 72 Jun 30 19：46 postgresql-Tue.log-rw。1 Postgres Postgres 0 7月1日00：00 PostgreSQL-Wed.log", "note_en": "By default after instalation and creting database cluster PostgreSQL will listner only on localhost. No remote access will be allowed.\n    [postgres@postgres-lab ~ ]$ netstat -lptnu | grep post (Not all processes could be identified, non-owned process info will not be shown, you would have to be root to see it all. )tcp  0  0 127.0.0.1:5432 0.0.0.0:* LISTEN 1977/postmaster tcp6  0  0 ::1:5432 :::* LISTEN 1977/postmaster\n   [postgres@postgres-lab ~ ]$ ps aux | grep postgrespostgres  1977 0.0 2.5  286388  14864 ? Ss Jun28 0:02 /usr/pgsql-12/bin/postmaster -D /postgresql/datapostgres  1979 0.0 0.2  140768  1360 ? Ss Jun28 0:00 postgres: logger postgres  1981 0.0 0.5  286504  3028 ? Ss Jun28 0:00 postgres: checkpointer postgres  1982 0.0 0.2  286388  1696 ? Ss Jun28 0:03 postgres: background writer postgres  1983 0.0 0.9  286388  5676 ? Ss Jun28 0:03 postgres: walwriter postgres  1984 0.0 0.4  286924  2688 ? Ss Jun28 0:02 postgres: autovacuum launcher\n  [postgres@postgres-lab ~ ]$ cd /postgresql/data/ [postgres@postgres-lab data ]$ ls -lah postgresql.conf-rw-------.  1 postgres postgres 26K Jun  28 21:44 postgresql.conf\n Change in  postgresql.conf parameter  listen_addresses to your server IP or  * to listen on all IP’s available on server:\n [postgres@postgres-lab data ]$ vi postgresql.conf ##------------------------------------------------------------------------------ ## CONNECTIONS AND AUTHENTICATION ##------------------------------------------------------------------------------ ## - Connection Settings -listen_addresses  =  &#39;*&#39;  ## what IP address(es) to listen on;  ## comma-separated list of addresses;  ## defaults to &#39;localhost&#39;; use &#39;*&#39; for all\n Restart PostgreSQL to apply changes - you can do that with  systemctl from  root os user service or with  pg_ctl -D PGDATA restart from  postgres os user:\n   [postgres@postgres-lab ~ ]$ netstat -lptnu | grep post (Not all processes could be identified, non-owned process info will not be shown, you would have to be root to see it all. )tcp  0  0 0.0.0.0:5432 0.0.0.0:* LISTEN 30161/postmaster tcp6  0  0 :::5432 :::* LISTEN 30161/postmaster\n   We can provide in it information from which  ADDRESS to which  DATABASE on which  USER by what  METHOD we allow connecting. Additionaly we have to provide  TYPE of connection.\n This file resides in same place where  postgresql.conf(we can alter this behavior by setting  pg_hba parameter in  postgresql.conf):\n [postgres@postgres-lab ~ ]$ cd /postgresql/data/ [postgres@postgres-lab data ]$ vi pg_hba.conf ## TYPE DATABASE USER ADDRESS METHOD ## &#34;local&#34; is for Unix domain socket connections onlylocal all all trust ## IPv4 local connections:host all all 127.0.0.1/32 trust ## IPv6 local connections:host all all ::1/128 trust\n   With  DATABASE we can specify database name or use special value  sameuser if database name should be same as name of user that is connecting.\n With  USER we can specify user or role - role name should be preceded by  + sign.\n   With  METHOD field we can set one of authentication methods - most important ones are:\n trust - allow connection without password - moslty set for local connections from database server itself\n   password - allow connection after getting plain password - DO NOT USE in untrusted networks - better -&gt; never use this option\n In  DATABASE and  USER fields you can specify special word  all if you don’t want to create any restrictions here.\n There can be situation when we must use additional field named  auth-options for specyfying details for example for  hostssl connection type. This topic will be covered in another post.\n Sample pg_hba record - allow all users connect to any DB from all IP addresses - only with password\n          Default URI syntax - you can connect like this:  psql postgresql://user:passwd@host:5432/dbame or by more common method: Connect to remote database from  psql with connections details provided in parameters(it will ask for password because of  md5 method in  pg_hba.conf for connections from  0.0.0.0/0):\n  We can also use parameter  -U to specify username different than OS username we currently are using.\n Also all this parameters can be taken from shell variables which names are self descriptive - if we set all of them we can just use plain  psql command to connect:\n         postgres = ## select version(); version -------------------------------------------------------------------------------------------------------- PostgreSQL 12.3 on x86_64-pc-linux-gnu, compiled by gcc  (GCC ) 8.3.1  20191121  (Red Hat 8.3.1-5 ), 64-bit ( 1 row )\n  postgres = ## \\conninfoYou are connected to database  &#34;postgres&#34; as user  &#34;postgres&#34; on host  &#34;10.128.0.2&#34; at port  &#34;5432&#34;.\n       [postgres@postgres-lab ~ ]$ psql -c  &#34;select current_time&#34; -f create_user.sql -c  &#34;select current_time&#34; current_time -------------------- 14:14:26.922453+00 ( 1 row )CREATE ROLECREATE ROLECREATE ROLE current_time -------------------- 14:14:26.926545+00 ( 1 row )\n    postgres = ## \\?General  \\copyright show PostgreSQL usage and distribution terms  \\crosstabview  [COLUMNS ] execute query and display results in crosstab  \\errverbose show most recent error message at maximum verbosity  \\g  [FILE ] or ; execute query  (and send results to file or |pipe )  \\gdesc describe result of query, without executing it  \\gexec execute query,  then execute each value in its result  \\gset  [PREFIX ] execute query and store results in psql variables  \\gx  [FILE ] as  \\g, but forces expanded output mode  \\q quit psql  \\watch  [SEC ] execute query every SEC seconds Query Buffer  \\e  [FILE ]  [LINE ] edit the query buffer  (or file ) with external editor  \\ef  [FUNCNAME  [LINE ] ] edit  function definition with external editor  \\ev  [VIEWNAME  [LINE ] ] edit view definition with external editor  \\p show the contents of the query buffer  \\r reset  (clear ) the query buffer  \\s  [FILE ] display history or save it to file  \\w FILE write query buffer to file\n    postgres-##  \\h SELECTCommand: SELECTDescription: retrieve rows from a table or viewSyntax: [ WITH  [ RECURSIVE  ] with_query  [, ... ]  ]SELECT  [ ALL | DISTINCT  [ ON  ( expression  [, ... ]  )  ]  ]  [ * | expression  [  [ AS  ] output_name  ]  [, ... ]  ]  [ FROM from_item  [, ... ]  ]  [ WHERE condition  ]  [ GROUP BY grouping_element  [, ... ]  ]  [ HAVING condition  [, ... ]  ]  [ WINDOW window_name AS  ( window_definition  )  [, ... ]  ]  [... ]\n postgres-##  \\h UPDATECommand: UPDATEDescription: update rows of a tableSyntax: [ WITH  [ RECURSIVE  ] with_query  [, ... ]  ]UPDATE  [ ONLY  ] table_name  [ *  ]  [  [ AS  ] alias  ] SET  { column_name  =  { expression | DEFAULT  } |  ( column_name  [, ... ]  )  =  [ ROW  ]  (  { expression | DEFAULT  }  [, ... ]  ) |  ( column_name  [, ... ]  )  =  ( sub-SELECT  )  }  [, ... ]  [ FROM from_item  [, ... ]  ]  [ WHERE condition | WHERE CURRENT OF cursor_name  ]  [ RETURNING * | output_expression  [  [ AS  ] output_name  ]  [, ... ]  ]URL: https://www.postgresql.org/docs/12/sql-update.html\n postgres-##  \\h ALTER SYSTEMCommand: ALTER SYSTEMDescription: change a server configuration parameterSyntax:ALTER SYSTEM SET configuration_parameter  { TO |  =  }  { value |  &#39;value&#39; | DEFAULT  }ALTER SYSTEM RESET configuration_parameterALTER SYSTEM RESET ALLURL: https://www.postgresql.org/docs/12/sql-altersystem.html\n     .pgpass file is used to keep passwords for easy of connection with PostgreSQL database servers. By default client looks for  .pgpass in your home directory. This file should on Linux has got  0600 permissions.\n We can change location of  .pgpass by setting shell variable  PGPASSFILE. Sample  .pgpass can look like - of course we can add multiple lines in it for diffrent connections:\n  Below  .pgpass sets password  postgres12345, for user  postgres to database  postgres when connecting to host  postgres-lab on port  5432. After saving  .pgpass we can connect to our database without providing password:\n   Service files allows us to save connection descriptions and call them by simple name. Service file can be on:\n  PostgreSQL client always look first for suer level service file, which overrides system level one. Sample record in service file will look like:\n  After saving service file we can connect with  psql like this(password will come from  .pgpass):\n       After setting it remember to reload PostgreSQL server. Logfile by default is located in  $PGDATA/log directory - in our example configuration that will be:\n [postgres@postgres-lab ~ ]$ ls -lah /postgresql/data/log/total 24Kdrwx------.  2 postgres postgres  162 Jul  3 00:00 .drwx------.  20 postgres postgres 4.0K Jul  3 00:00 ..-rw-------.  1 postgres postgres  153 Jul  3 10:07 postgresql-Fri.log-rw-------.  1 postgres postgres  0 Jun  29 00:00 postgresql-Mon.log-rw-------.  1 postgres postgres  186 Jun  28 21:46 postgresql-Sun.log-rw-------.  1 postgres postgres 4.7K Jul  2 17:00 postgresql-Thu.log-rw-------.  1 postgres postgres  72 Jun  30 19:46 postgresql-Tue.log-rw-------.  1 postgres postgres  0 Jul  1 00:00 postgresql-Wed.log", "posttime": "2020-08-04 00:36:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,初学者,beginner", "title": "PostgreSQL初学者指南", "title_en": "PostgreSQL beginner guide", "transed": 1, "url": "https://knowledgepill.it/posts/postgresql-basics-guide/", "via": "", "real_tags": ["初学者", "beginner"]}, {"category": "", "categoryclass": "", "imagename": "40462da55165ca9c980a6bad5e066545.png", "infoid": 1015932, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球领先的移动推送通知、Web推送和应用内消息传递。受80万商家信任，每天发送50亿条推送通知。", "note_en": "The world's leader for Mobile Push Notifications, Web Push, and In-App Messaging. Trusted by 800k businesses to send 5 billion Push Notifications per day.", "posttime": "2020-08-04 00:36:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全栈,消息,messaging,推送", "title": "OneSignal(消息传送和推送通知API)正在招聘一名全栈工程师", "title_en": "OneSignal (Messaging and Push Notification APIs) is hiring a full stack engineer", "transed": 1, "url": "https://onesignal.com/careers/890530b3-fc07-454b-9111-ddacd65384d8", "via": "", "real_tags": ["全栈", "消息", "messaging", "推送"]}, {"category": "", "categoryclass": "", "imagename": "314d38e31189a22cdf304d59e7ad6d5e.jpg", "infoid": 1015931, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒正在加利福尼亚州的中央山谷以惊人的速度传播，沿着一条残酷的、日益熟悉的道路传播。\n在美国著名农业区的小村庄里生病的人的人口结构与大城市和郊区遭受重创的人是一样的：必要的工人-其中许多是拉丁裔-他们在工作中生病时因为经济原因不能呆在家里，而且很难在拥挤的、几代人的住房中与世隔绝。这类人可能是大城市和郊区的人，他们中的许多人是拉丁裔，他们在工作中生病时不能呆在家里，也很难在拥挤的、几代人居住的住房中与世隔绝。\n公共卫生官员和医学专家表示，这种传播模式突显了加州冠状病毒的严重不平等，它感染黑人和拉丁裔社区以及较贫穷地区的比率远远高于较富裕和较白人社区。\n中央山谷病例的激增对农场工人造成了特别大的损失，部分原因是他们经常住得很近，共用前往工作地点的交通工具，而且几乎没有机会获得医疗保健。州长加文·纽瑟姆(Gavin Newsom)周一说，中央山谷的冠状病毒检测阳性率从10.7%到高达17.7%不等。该州过去七天的平均水平约为7.8%。\n在人口稠密的城市地区，如东区和洛杉矶中南部以及旧金山的任务区，冠状病毒传播率也有所上升，这些地区都是拥有大量拉丁裔居民的社区，他们从事着维持加州运转的关键工作，如建筑、制造、烹饪和食物准备。\n“这些人并不都住在农场的大农舍里。这些人住在...。加州大学旧金山分校流行病学家和传染病专家George Rutherford博士说。我认为这可能与我们在任务区看到的模式相同，即基本劳动力，在这种情况下，他们是农业劳动力，居住密集，在往返工地或工地的路上暴露在外面。\n拉丁裔居民占加州人口的39%，但占全州冠状病毒病例的56%，占死亡人数的46%。拉美裔居民在中央山谷居民中所占的比例甚至高于全州。\n加州大学默塞德社区和劳工中心(UC Merced Community And Labor Center)的社会学教授爱德华·弗洛雷斯(Edward Flores)研究了大流行对中央山谷的影响，他说，这些劳工中的许多人的工作条件使得真正的社会疏远变得困难，他们可能害怕报告安全问题，因为担心失去工作。\n他说：“我们听说了肉类加工厂、农业和这些低薪工作中的大规模疫情，在这些非常密集的环境中，人们与其他人并肩工作。”“居家订单对面临最大风险的低薪必需工人作用不大.”\n像中央山谷这样的地方遭受重创并不令人惊讶。加州社区和劳工中心(Community And Labor Center)执行主任安娜·帕迪利亚(Ana Padilla)的研究显示，在加州的肉类加工厂中，中央山谷作为一个地区，即使在该州只有13%的肉类加工厂，但在大流行之前，该地区就已经没有达到健康和安全标准。该地区近一半的检查是由投诉引发的。\n图拉雷县的冷冻食品包装商Ruiz Foods和金斯县的中央山谷肉类公司(Central Valley Meat Co.)有数百名工人受到感染。\n根据Flores和Padilla撰写的一项研究，低工资和拥挤家庭所占比例较大的加利福尼亚州县更有可能受到疫情的沉重打击。\n流行病学家还看到这种疾病在圣地亚哥以东的农业帝国谷蔓延，“而且似乎已经通过科切拉山谷扩散到了中央山谷，”卢瑟福说。卢瑟福说，这种高传染性病毒继续蔓延到萨利纳斯山谷和北加州葡萄酒产区的纳帕县、索诺马县、索拉诺县、门多西诺县和莱克县。\n纽瑟姆周一宣布，他将向圣华金河谷的八个县-圣华金、斯坦尼斯劳斯、默塞德、马德拉、弗雷斯诺、国王、图拉雷和克恩-派遣“突击队”，同时要求加州立法机构批准5200万美元，以改善这些地区的检测、追踪和隔离协议。\n“这种疾病在加利福尼亚州继续增长。它继续蔓延，但不是均匀的，“纽瑟姆周一在斯托克顿的钻石坚果公司发表讲话时说。“它对某些社区和该州的某些地区造成了不成比例的影响。”\n过去两周，洛杉矶县每10万名居民报告了400例新的冠状病毒病例，而贝克尔斯菲尔德所在的克恩县现在每10万名居民中有913例新的冠状病毒病例；根据时报的一项分析，一个月前这个数字是133例。\n金斯县每10万居民中有581例新的冠状病毒病例；斯坦尼斯劳斯，560例；图拉雷，550例；圣华金，525例；默塞德，506例；马德拉，475例；弗雷斯诺，438例。州政府的指导方针说，各县的目标是在两周内每10万居民中新增病例不超过100例。\n加州卫生与公众服务局秘书马克·加利(Mark Ghaly)博士说：“我们看到的病例数量过多。”该地区疾病的有效传播率高达1.4，这意味着平均每1名感染者将其传播给其他1.4人。“我们有很多工作要做，才能让中央山谷的传输率降下来。\nGhaly说：“我们日常护理所依赖的一些常规医院床位挤满了COVID患者，比率高达65%。”\n圣华金河谷的几个县的冠状病毒死亡率也高于洛杉矶县，如斯坦尼斯劳斯、马德拉、圣华金和默塞德。\n纽瑟姆说，他要求立法机构为中央山谷的地方公共卫生部门批准的5200万美元将来自该州从美国疾病控制和预防中心获得的4.99亿美元赠款。州长说，他希望用这5200万美元来改善中央山谷的“我们的隔离协议，我们的隔离协议，我们的检测协议，并通过提供更多的支持和更多的人员来加强我们的医护人员”。\n纽瑟姆说，他有针对性的努力将反映帝国郡的努力，该县一直是该州受灾最严重的地区之一。这个与墨西哥和亚利桑那州接壤的农村县在过去两周里每10万居民报告了688例新病例；一个月前，这个数字要糟糕得多：1173例。\n纽瑟姆说：“通过部署多个突击队，我们能够在病毒传播和传播方面取得一些改善。”\n这些打击小组由州、联邦和地方人员组成，他们通过追踪接触者和协助工作场所爆发，努力增加医院的能力，减少传播。州长办公室表示，这些努力有助于降低最近几周的新病例数量。\n“我们正在做完全一样的事情……。整个中央山谷，“纽瑟姆说。\n加州农村法律援助基金会(California农村法律援助基金会)的倡导者胡安妮塔·翁蒂维罗斯(Juanita Ontiveros)称州长的行动是“一个好举措”，但她表示，她认为未来还需要额外的援助，特别是在联邦失业保险福利将于本周到期的情况下。\n她说，她希望看到部分资金用于对受影响工人的直接经济援助。Ontiveros说，硅谷的许多家庭都看到父母双双下岗，有时是在随后关闭的企业，由于当地经济在低迷中崩溃，这些企业没有重新开业的计划。\n“这永远不够，”Ontiveros说。“你可以在人们的脸上看到压力、担忧和痛苦，特别是当他们听到(失业保险)即将结束的时候。所有这一切对工人和他们的家人来说都是噩梦。“。\n日内瓦·穆拉德在斯托克顿的一家非营利性组织工作，也是移民志愿者。她说，她担心没有足够的援助到达非法移民社区。非法移民社区受到的打击最大，因为那些没有合法身份的人很难找到援助，可能害怕被驱逐出境。\n穆拉德从巴拿马来到美国，多年来一直无证生活，他表示，现在中央山谷非常担心寻求医疗和经济帮助的后果。\n穆拉德说：“他们太害怕了，不敢要求服务。”“我很难相信他们会拿到那笔钱。”", "note_en": "The coronavirus is spreading at alarming rates in California’s Central Valley, following a cruel and increasingly familiar path.\n The demographics of those getting sick in the rural hamlets of America’s famed agricultural zone are the same as those who have been hit hard in big cities and suburbs: Essential workers — many of them Latino — who cannot stay home for financial reasons when they fall ill on the job and also have a hard time isolating in housing that can be crowded and multigenerational.\n Public health officials and medical experts say the pattern of spread underscores the deep inequities of the coronavirus in California, which has infected Black and Latino communities and poorer regions at much higher rates than more affluent and white ones.\n The surge in Central Valley cases has taken a particular toll on farmworkers, in part because they often live in close quarters, share transportation to job sites and have little access to healthcare. Gov. Gavin Newsom said Monday that the rate of positive coronavirus tests in the Central Valley ranges from 10.7% to as high as 17.7%. The state’s average is about 7.8% over the last seven days.\n  Increased rates of coronavirus transmission have also been seen in dense urban areas such as the  Eastside and South and Central Los Angeles and San Francisco’s Mission District, all home to communities with large numbers of Latino residents who perform essential jobs critical in keeping California running, such as in construction, manufacturing, cooking and food preparation.\n “These aren’t all people who live on big ranch houses on the farms. These are people who live in ... dense apartments,” said Dr. George Rutherford, a UC San Francisco epidemiologist and infectious diseases expert. “I think it’s probably the same pattern that we see in the Mission District, of an essential workforce, which in this case is agricultural, who is densely housed, who gets exposed on their way to and from the work site or at the work site.”\n Latino residents make up 39% of Californians but account for up to 56% of coronavirus cases statewide and 46% of deaths. Latino residents make up an even higher percentage of residents in the Central Valley than they do statewide.\n      Edward Flores, a sociology professor with the UC Merced Community and Labor Center, who has studied the impact of the pandemic on the Central Valley, said many of these laborers work in conditions that make true social distancing difficult and may be afraid to report safety problems for fear of losing their jobs.\n “We hear about these huge outbreaks in meatpacking plants, in agriculture and these low-wage jobs, where people work side by side with other people in these very dense environments,” he said. “Stay-at-home orders do little for the low-wage essential workers that face the greatest risks.”\n It shouldn’t be a surprise that places like the Central Valley would be hit hard. Among California’s meatpacking plants, the Central Valley as a region has had poor compliance with health and safety standards even before the pandemic hit, with the region home to nearly half of inspections triggered by complaints, even though it is home to just 13% of the state’s meatpacking plants, according to research by Ana Padilla, executive director of the Community and Labor Center.\n Hundreds of workers have been infected at  Ruiz Foods, a frozen-food packager in Tulare County, and  Central Valley Meat Co. in Kings County.\n  California counties with a greater share of low-wage and crowded households have been more likely to be hit hard by the pandemic, according to a  study by authored by Flores and Padilla.\n Epidemiologists also saw the disease spread in the agricultural Imperial Valley east of San Diego, “and it seems to have spread through the Coachella Valley and into the Central Valley,” Rutherford said. The highly contagious virus has continued to spread into the Salinas Valley and Northern California wine country counties of Napa, Sonoma, Solano, Mendocino and Lake, Rutherford said.\n Newsom announced Monday he would send “strike teams” to eight counties in the San Joaquin Valley — San Joaquin, Stanislaus, Merced, Madera, Fresno, Kings, Tulare and Kern — while asking the California Legislature to approve $52 million to improve testing, tracing and isolation protocols in those regions.\n  “This disease continues to grow in the state of California. It continues to spread, but not evenly,” Newsom said Monday while speaking at Diamond Nuts in Stockton. “It is disproportionately impacting certain communities and certain parts of the state.”\n  While L.A. County is reporting 400 new coronavirus cases per 100,000 residents over the last two weeks, Kern County — home to Bakersfield — is now seeing a rate of 913 new coronavirus cases per 100,000 residents; a month ago, that number was 133, according to a Times analysis.\n Kings County is seeing 581 new coronavirus cases per 100,000 residents; Stanislaus, 560; Tulare, 550; San Joaquin, 525; Merced, 506; Madera, 475; and Fresno, 438. State guidelines say counties should aim for no more than 100 new cases per 100,000 residents over a two-week period.\n “We’re seeing an inordinate number of cases,” said Dr. Mark Ghaly, secretary of the California Health and Human Services Agency. The effective transmission rate of the disease in the region is as high as 1.4, meaning every 1 person infected transmits it, on average, to 1.4 other people. “We have a great deal of work to do to get transmission rates down here in the Central Valley.\n “Some of the regular hospital beds that we depend on for everyday care are filled up with COVID patients to the rate of 65%,” Ghaly said.\n  Mortality rates for the coronavirus are also higher in several San Joaquin Valley counties than in L.A. County, such as Stanislaus, Madera, San Joaquin and Merced.\n   Newsom said the $52 million he is asking the Legislature to approve for local public health departments in the Central Valley will come from $499 million in grants the state received from the U.S. Centers for Disease Control and Prevention. The governor said he wants to use the $52 million to improve “our isolation protocols, our quarantine protocols, our testing protocols and to enhance our healthcare workers by providing more support as well as more personnel” in the Central Valley.\n Newsom said his targeted efforts will mirror those in Imperial County, which has been one of the   hardest-hit areas of the state. The rural county, which borders Mexico and Arizona, has reported 688 new cases per 100,000 residents over the last two weeks; a month ago, that number was much worse: 1,173.\n   “We were able to make some improvement in terms of the transmission and spread of the virus by deploying a number of strike teams,” Newsom said.\n Those strike teams were made up of state, federal and local personnel who worked to increase hospital capacity and reduce transmission through contact tracing and assisting with workplace outbreaks. The governor’s office said those efforts helped lower the number of new cases in recent weeks.\n “We are doing exactly the same thing ... throughout the Central Valley,” Newsom said.\n Juanita Ontiveros, an advocate with the California Rural Legal Assistance Foundation, called the governor’s actions “a good move” but said she believed additional aid would be needed in the future, especially as federal unemployment insurance benefits are set to expire this week.\n  She said she would like to see some of the money used for direct financial aid to affected workers. Ontiveros said many families in the valley have seen both parents laid off, sometimes at businesses that have subsequently closed with no plans to reopen as local economies buckle under the downturn.\n “It’s never enough,” Ontiveros said. “You can see the stress and the worry and the agony in people’s faces, and especially when they hear the [unemployment insurance] is coming to an end. All of this is nightmarish to workers and their families.”\n Geneva Moorad, who works at a nonprofit in Stockton and volunteers with immigrants, said she is concerned that not enough aid will reach the undocumented community, which has been hardest hit because those without legal status have trouble finding aid and may be fearful of deportation.\n Moorad, who came to the U.S. from Panama and lived undocumented for many years, says there is great fear in the Central Valley right now around the consequences of seeking both medical and financial help.\n  “They are too afraid to ask for services,” Moorad said. “It’s so hard for me to believe that they are going to get that money.”", "posttime": "2020-08-04 00:35:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,肆虐,ravages", "title": "冠状病毒肆虐加州中央山谷，走上一条残酷的熟悉道路", "title_en": "Coronavirus ravages California’s Central Valley, following a cruel familiar path", "transed": 1, "url": "https://www.latimes.com/california/story/2020-07-28/coronavirus-ravages-californias-central-valley-following-a-cruel-and-familiar-path", "via": "", "real_tags": ["病毒", "冠状病毒", "肆虐", "ravages"]}, {"category": "", "categoryclass": "", "imagename": "87f2669170d89a1c30c625f5fce75770.png", "infoid": 1015930, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "复制SVG代码复制CDN链接下载SVG图标。\n下载所有图标", "note_en": "Copy SVG Code                    Copy CDN Link                      Download SVG Icon\n                   Download All Icons", "posttime": "2020-08-04 00:35:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,uicons,svg", "title": "系统UIcons-专为产品设计的图标，无属性", "title_en": "System UIcons – icons designed for products, no attribution", "transed": 1, "url": "https://systemuicons.com/", "via": "", "real_tags": ["设计", "uicons", "svg"]}, {"category": "", "categoryclass": "", "imagename": "fa98f9572cd087c644a001731291fa97.jpg", "infoid": 1015928, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "非常喜欢AMD和POWER 10，并暗示谷歌的一些操作代码将在未来的版本中使用。\n这位元维护者上周考虑了Linux 5.8的第八个候选版本，但在周日决定“不值得再等一周，因为现在还没有什么大的担忧。”\n托瓦尔兹确实遇到了“本周与头文件依赖有关的恼人的噪音”，并大声思考是否是时候解决这个问题了，如下所示：\n“它确实强调了如果我们有某种工具支持来自动打破令人讨厌的头文件依赖关系，那该有多好，但如果希望是马的话。也许有一天，我们会有某种符号依赖的SAT解算器，可以处理我们所有不同的架构和配置，但目前它只是一种偶尔会咬我们的手工痛苦。“。\n鉴于托瓦尔兹创建了Git和地下潜水记录应用程序来解决让他恼火的问题。依赖件会成为下一个吗？\n我们得等那一刻。目前，我们使用的是Linux 5.8，它包括：\n在这里，Kernel.org提供了您忙于使用新版本所需的所有链接。\n像往常一样，Linux5.9的潜在贡献者现在有几周的时间将他们的代码放入下一个版本的队列中。\n谷歌已经提出了一项耐人寻味的贡献，即它在自己的系统中使用的“细粒度用户空间控制/调度”代码。谷歌的帖子说，这个补丁程序集是将这项工作开源的第一步。注册中心已经询问谷歌打算分享多少这个系统，但在撰写本文时还没有收到我们7月29日的回复。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Lots of love for AMD and POWER 10 and a hint of some Google&#39;s operational code making it into future releases\n  The meta-maintainer last week pondered an eighth release candidate for Linux 5.8, but on Sunday  decided “it&#39;s not just worth waiting another week when there aren&#39;t any big looming worries around.”\n  Torvalds did encounter “annoying noise with header file dependencies this week” and thought out loud about whether it might be time to sort that out, as follows:\n  “It did reinforce how nice it would be if we had some kind of tooling support to break nasty header file dependencies automatically, but if wishes were horses. Maybe some day we&#39;ll have some kind of SAT-solver for symbol dependencies that can handle all our different architectures and configurations, but right now it&#39;s just a manual pain that occasionally bites us.”\n  Given that Torvalds created Git and the Subsurface dive-logging application to solve problems that irked him. Could dependency-ware be next?\n  We’ll have to wait for that. For now, we have Linux 5.8 which includes:\n    Kernel.org has all the links you need to get busy with the new release  here.\n  As is usual, would-be-contributors to Linux 5.9 now have a couple of weeks to get their code into the queue for the next release.\n  Google has already proposed an intriguing contribution in the form of what it’s  described as “fine-grained user-space control/scheduling” code that it uses in its own systems. Google&#39;s post says &#34;This patchset is the first step to open-source this work.&#34;  The Register has asked Google how much of this system it intends to share but has not received a reply to our July 29th request at the time of writing. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-08-04 00:22:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,发布,torvalds,版本", "title": "Linus Torvalds渴望修复头文件，但无论如何都会发布Linux5.8", "title_en": "Linus Torvalds pines for header file fix but releases Linux 5.8 anyway", "transed": 1, "url": "https://www.theregister.com/2020/08/03/linux_5_8_released/", "via": "", "real_tags": ["linux", "发布", "torvalds", "版本"]}, {"category": "", "categoryclass": "", "imagename": "d31f8004386090e21ad8322f1d2eec39.jpg", "infoid": 1015927, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他卖掉房子以支付一所商学院的费用，在他的科技职业生涯中-先是作为一名机械工程师，然后是一家初创公司的高管-詹森和他的妻子购买、翻新和翻转了几套房子。\n“在过去的十年里，我买了十套房子，”詹森说。“我已经把它们整修好了，卖出去了，经过了检查程序。”而每次我经历这一过程时，我都会感到平淡无奇。“。\n对房屋买卖过程的深刻经验促使Jensen创建了Inspectify，这是一个旨在简化房屋购买(和销售)过程的房屋检查和维修市场。\n通过该平台，买家可以立即预订检查并收到维修估计。该公司与房地产经纪人合作以加速交易。\nJensen说：“它正在利用数据与服务提供商联系，使整个流程变得更加流畅。”“我们可以与购房者联系，最终完成这项工作。他们利用这些信息帮助从买房到拥有和更好地管理房屋。“。\n与许多初创公司不同，詹森的公司已经在赚钱。该公司目前从每次预订的检查中收取平台费，Inspectify收取约15%的检查成本。\n人们在检查上的平均花费在380美元到450美元之间，这家总部位于洛杉矶的公司并不缺少客户。詹森说，自去年8月推出以来，该公司的收入每月增长60%。\n詹森之前曾为安德森·霍洛维茨(Andreessen Horowitz)支持的公司FlyHomes运营业务。而创始团队的其他成员也有房地产博弈的历史。联合创始人泰勒·兹威尔瑟曾在一家名为Vault的初创公司担任高管(前世曾是一名房地产经纪人)，他与公司首席技术官丹尼斯·贝尔拉万斯(Denis Belvaance)一起启动了Inspectify业务，丹尼斯·贝尔拉万斯曾是亚马逊的工程师和连续创业者。\n贝尔瓦恩斯之前创立了桃子，是Zillow的长期员工，启动了公司的加拿大业务。\n“我和我的妻子在房地产投资方面有一个有趣的模式，”詹森说。“我们会买一套房子，翻修一下，然后住进去，然后搬家。这是我们…的一大激情。起初，这只是一份兼职工作，目的是吸引更多资金。\n现在，Inspectify即将从Y Combinator的最新一批毕业生中毕业，对于专注于房地产的初创公司来说，Inspectify的出现恰逢其时。\n在过去的几年里，住宅和商业市场在物业技术和房地产管理服务方面的投资都大幅增加。截至5月份，房地产科技领域的风险资本投资总额为16亿美元。根据National Real Estate Investor引用的Keefe，Bruyette&amp；Woods的数据，这一数字大幅下降，同比下降近70%。报告称，即便是这样的负面影响，也伴随着历史上的上行，交易规模中值比历史平均水平高出63%。", "note_en": "He sold the house to pay for a business school and over the course of his tech career — first as a mechanical engineer and then as an executive for startup companies — Jensen and his wife bought, renovated, and flipped several homes.\n  “I bought ten homes over the last decade,” said Jensen. “I have renovated them sold them gone through the inspection process. And every time I go through the process I’m underwhelmed.”\n That deep, deep experience with the process of buying and selling homes led Jensen to found  Inspectify, a marketplace for home inspections and repairs designed to streamline the process of home buying (and selling).\n Through the platform, buyers can instantly book inspections and receive repair estimates. The company partners with real estate agents to accelerate transactions\n “It’s leveraging the data to connect with service providers to make the overall processes much more streamlined,” Jensen said. “We can connect with homebuyers to ultimately do the work. They use this information to help the transition from buying to owning and better managing a home.”\n Jensen’s company, unlike many startups, is already making money. The company currently charges a platform fee off of every inspection booked and Inspectify takes around 15 percent of the cost of the inspection.\n People spend on average between $380 and $450 on inspections and the Los Angeles-based company isn’t short on clients. Jensen said that the company is growing its revenue 60 percent on a monthly basis since its launch in August of last year.\n Jensen previously ran operations for the Andreessen Horowitz-backed company FlyHomes. And the other members of the founding team also have a history in the real estate game. Co-founder Taylor Zwilser, a former executive at a startup called Vault (and a real estate agent in a past life), joined Jensen in launching the Inspectify business along with Denis Bellavance, the company’s chief technology officer and a former Amazon engineer and serial entrepreneur.\n Bellavance had previously founded Peach and was a longtime employee at Zillow, launching the company’s Canadian business.\n “My wife and I have an interesting model on real estate investment,” said Jensen. “We’ll buy a house renovate it and live in it and then move. It’s been a big passion of ours… initially it was a side gig to bring in more capital.”\n Now poised to graduate from Y Combinator’s latest cohort, Inspectify is coming along at a good time for startups focused on real estate.\n Over the last few years, investments in property technology and real estate management services for both the residential and commercial market have soared. In all, venture capital investment in property tech totaled $1.6 billion through May. That number is down dramatically, nearly 70 percent year-on-year, according to data from Keefe, Bruyette &amp; Woods,  cited by National Real Estate Investor. Even that downside, came with a historical upside with median deal size was 63 percent above the historical average, according to the report.", "posttime": "2020-08-03 23:57:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "搬家,lifelong", "title": "\nInspectify是由一位终生搬家的人创立的，是一个房屋检查和维修的市场", "title_en": "\n\t\t\t\tFounded by a lifelong house-flipper, Inspectify is a marketplace for home inspections and repairs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/founded-by-a-lifelong-house-flipper-inspectify-is-a-marketplace-for-home-inspections-and-repairs/", "via": "", "real_tags": ["搬家", "lifelong"]}]