[{"category": "", "categoryclass": "", "imagename": "9f1af5e71ad4da99d36f91196f225553.jpg", "infoid": 1017454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据《华尔街日报》周一报道，美国环境保护局(EPA)将于本周签署并发布新规，取消对油气生产商的某些甲烷气体排放要求。\n身份不明的政府官员告诉该报，新规定将包括取消对生产商拥有发现甲烷泄漏的系统和过程的要求。据华尔街日报报道，他们还将结束EPA对管道和储存点的雾霾和排放的监督，并降低对某些污染物的监测和报告要求。\n据该报报道，新规定包含了2018年和2019年提案的大部分主要内容。\n当被问及对这份报告的评论时，环保局的一位发言人告诉国会山，这项规定“仍在进行跨部门审查”。\n2019年，该机构提议取消对石油和天然气公司安装监测管道、油井和设施甲烷排放技术的要求。\n2018年，它提议将监测油气井甲烷排放的频率减少到每两年一次，将帮助运输天然气的压缩机站的频率减少到每年一次。\n然而，华尔街日报周一报道称，由于难以从法律上证明这些措施的合理性，政府将放弃原本会降低检查频率的措施。\n2018年拟议的规则还旨在降低需要证明使用了排放捕获设备的工程师的资格，并允许使用更多的“替代”技术来限制污染，降低排放报告要求，并免除许多天然气加工厂的监控。\n甲烷是一种强大的温室气体，在同等数量的情况下，其影响可能是二氧化碳的25倍。2018年，它占美国人类活动造成的温室气体排放的近10%。", "note_en": "The Environmental Protection Agency (EPA) will sign and issue new rules this week that will get rid of certain methane gas emission requirements for oil and gas producers,  The Wall Street Journal reported Monday.\n Unidentified administration officials told the newspaper that the new rules will include getting rid of requirements for producers to have systems and processes to find methane leaks. They will also end EPA oversight of smog and emissions from pipelines and storage sites and lessen monitoring and reporting requirements for certain pollutants, the Journal reported.\n The new rules have most of the major elements of proposals from 2018 and 2019, according to the newspaper.\n  An EPA spokesperson told The Hill that the rule is “still under interagency review” when asked for comment on the report.\n In 2019, the agency   proposed eliminating requirements  for oil and gas companies to install technology for monitoring methane emissions from pipelines, wells and facilities.\n In 2018, it proposed   reducing the frequency of monitoring methane emissions  of oil and gas wells to every two years and compressor stations that help transport natural gas to just once a year.\n  However, the Journal reported Monday that the administration would forgo the measures that would have reduced the inspection frequency due to difficulty in justifying them legally.\n The 2018 proposed rule also aimed to reduce qualifications for engineers that need to certify that emissions-capturing equipment is used and allow for more “alternative” technologies to limit pollution, reduce emissions reporting requirements and exempt many natural gas processing plants from monitoring.\n Methane is a powerful greenhouse gas that can be   25 times more impactful  than carbon dioxide in equal quantities. In 2018, it accounted for nearly 10 percent of all U.S. greenhouse gas emissions caused by human activity.", "posttime": "2020-08-11 08:28:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,环保署,rescind,排放", "title": "美国环保署将撤销对石油和天然气的甲烷规定", "title_en": "EPA To Rescind Methane Regulations For Oil and Gas", "transed": 1, "url": "https://thehill.com/policy/energy-environment/511298-epa-to-issue-methane-rollback-this-week-report", "via": "", "real_tags": ["美国", "环保署", "rescind", "排放"]}, {"category": "", "categoryclass": "", "imagename": "e77108d04a7a0e824d867404245e7261.png", "infoid": 1017453, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据周一分发给播客制作人的一封机密电子邮件，亚马逊将把免费播客纳入其亚马逊音乐和音频产品中。\n周一服务台看到的这封电子邮件称，亚马逊很快就会允许亚马逊音乐(Amazon Music)和音频(Audible)的用户使用这两项服务订阅、下载和流媒体免费播客。亚马逊音乐的免费层和付费服务的用户都可以使用播客。\n亚马逊联系了顶级播客制作人，提出在亚马逊音乐和Audible的5500万用户可以使用该功能之前提交他们的节目提要。该公司没有透露这项功能将于何时推出。\n通过将播客整合到亚马逊音乐和Audible中，该公司可能最终会为其智能扬声器和其他平台用户提供一种原生的流媒体点播节目的方式。目前，亚马逊的Echo扬声器和Fire TV设备系列支持一系列来自Stitcher、TuneIn、iHeart Radio和其他公司的第三方播客应用程序。", "note_en": "Amazon will incorporate free podcasts into its Amazon Music and Audible products, according to a confidential email distributed to podcast producers on Monday.\n The email, seen by  The Desk on Monday, said Amazon would soon allow users of Amazon Music and Audible to subscribe, download and stream free podcasts using each service. Podcasts will be available to users of Amazon Music’s free tier as well as its premium service.\n Amazon reached out to top podcast producers with an offer to submit their show’s feed before the feature becomes available to its 55 million users across Amazon Music and Audible. The company did not say when the feature would launch.\n By incorporating podcasts into Amazon Music and Audible, the company may finally offer its smart speaker and other platform users a native way to stream on-demand shows. Currently, Amazon’s line of Echo speakers and Fire TV devices allow for a range of third-party podcast apps from Stitcher, TuneIn, iHeart Radio and others.", "posttime": "2020-08-11 08:00:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,亚马逊,amazon,播客", "title": "内部电子邮件：亚马逊将在亚马逊音乐中添加免费播客，免费和付费层级，以及音频", "title_en": "Internal email: Amazon to add free podcasts in Amazon Music, for both free and paid tiers, and on Audible", "transed": 1, "url": "https://thedesk.matthewkeys.net/2020/08/podcast-amazon-music-audible-streaming-echo/", "via": "", "real_tags": ["免费", "亚马逊", "amazon", "播客"]}, {"category": "", "categoryclass": "", "imagename": "d91648b47f7db79455d3d19670156ce5.jpeg", "infoid": 1017452, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1948年，爱荷华州的格林内尔有7000人，其中不止一人不先拉下窗帘就不敢在自己家里喝酒。在格林内尔卖酒是违法的，但在家里喝酒是完全合法的。所以不是这样的。甚至不会有人从窗户往里看而不赞成。上帝知道格林内尔有更多的白丝带禁酒者，但到了1948年，酒精几乎不再是该隐曾经的印记。不，那些胆小的灵魂用手指穿过主街和公园街的白色框架房屋内的树荫环路，完全是在想着另一件事。\n他们碰巧住在最初属于1854年建立该镇的公理会牧师约西亚·格林内尔(Josiah Grinnell)拥有的土地上。约西亚·格林内尔(Josiah Grinnell)用契约永久出售了许多东西，声明任何允许在他的财产上饮酒的人都丧失了所有权。永恒不变！永恒就是永恒，而1948年还不到一百年。1948年，格林内尔周围有认识约西亚·格林内尔的人。他们年事已高，格林内尔已于1891年去世，但他们仍在四处走动。所以..。为什么要冒险呢！\n明摆着的事实是，格林内尔把中西部写得到处都是。它正好位于爱荷华州米德兰玉米种植带的中央，农场里的人们说的是小龙虾而不是小龙虾，说的是谷仓地而不是谷仓场。格林内尔是19世纪中叶爱荷华州成为一个州后建立的许多新教宗教社区之一，来自东部的定居者前往农田。街道呈直线排列，白色隔板房屋和榆树，就像新英格兰的村庄。在1948年的今天，19世纪新教的八角形肥皂气味仍然弥漫在房屋和大街上。这是东方人听到“中西部”这个词时所想到的不小的一部分。三十年来，舍伍德·安德森、辛克莱·刘易斯和卡尔·范·维克腾等作家一直在用他们对教会般狭隘的中西部的描绘，引来最令人津津乐道的窃笑。爱荷华州画家格兰特·伍德(Grant Wood)在创作他著名的油画“美国哥特式”时，想到了格林内尔周围的农场。东方人立刻认出了伍德照片中的这对冷酷无情的夫妇。有约翰·卡尔文(John Calvin)和约翰·诺克斯(John Knox)的正直统治着大棒。\n1948年秋天，哈里·杜鲁门(Harry Truman)选择格林内尔(Grinnell)作为他短暂的竞选之旅的一站，在那里他可以接触到小人物，心脏地带的普通美国人，那些没有被纽约和华盛顿的老练的意见制定者触及的人。杜鲁门在他的火车车厢后部站台上说，他永远不会忘记格林内尔，因为正是格林内尔学院-公园街对面的一所小型公理学院-给了他第一个荣誉学位。事实证明，总统美好的回忆并没有起到多大作用。自1860年亚伯拉罕·林肯第一次参选以来，该镇在每一次总统选举中都投了共和党人的票，而不是要换成哈里·杜鲁门。\n从表面上看，1948年爱荷华州的格林内尔：一段19世纪中期的美国历史冻结在20世纪中期。这是美国最后的几个城镇之一，东部的人们会认为它会成为通向未来的闪电的起点，这将在2000年及以后创造出生命的最基本的基础结构，电子网格。\n正是在1948年夏天，格林内尔学院45岁的物理学教授格兰特·盖尔在报纸上偶然看到一篇关于他在威斯康辛大学的前同学约翰·巴丁的文章。巴丁的父亲曾是威斯康星州的医学院院长，盖尔的妻子哈里特的父亲曾是该工程学院的院长，因此，正如俗语所说，巴丁和哈里特成长为学院的伙伴。盖尔和巴丁的专业都是电气工程。最终，巴丁在明尼苏达大学教授物理学，然后离开学术界，前往位于新泽西州默里希尔的电话公司主要研究中心贝尔实验室工作。现在，根据这篇文章，巴丁和贝尔公司的另一位工程师沃尔特·布拉顿发明了一种他们称之为晶体管的新型小型设备。\n然而，这只是一件事；1948年晶体管的发明并没有成为头条新闻。晶体管显然与真空管具有相同的功能，真空管是电话中继系统和无线电的重要组成部分。像真空管一样，晶体管可以隔离特定的电信号，如无线电波，并将其放大。但是晶体管不需要玻璃管，也不需要真空吸尘器\n然而，到目前为止，大规模生产晶体管是不可能的，部分原因是金线必须手工制作，并用手工连接，间距为千分之二英寸。但那是电话公司的问题。格兰特·盖尔对晶体管在产品方面的任何现在或未来的应用都不感兴趣。他希望晶体管可以提供一种方法来研究电子在固体(锗)中的流动，这是物理学家们几十年来一直在猜测的课题。他认为如果能为格林内尔大学的物理系弄到一些晶体管就太棒了。所以他写信给贝尔实验室的巴丁。为了确保他的请求不会在混乱中丢失，他还写信给贝尔实验室的总裁奥利弗·巴克利(Oliver Buckley)。巴克利来自爱荷华州的斯隆，碰巧是格林内尔大学的毕业生。因此，到1948年秋天，盖尔已经获得了有史以来最早制造的两个晶体管，他为格林内尔学院物理专业的18名学生提供了世界上第一个固态电子学的学术指导。\n格兰特·盖尔(Grant Gale)主修物理的大四学生之一是一个当地男孩，名叫罗伯特·诺伊斯(Robert Noyce)，盖尔认识他多年了。鲍勃和他的兄弟唐纳德、盖洛德和拉尔夫就住在帕克街，他们过去常常为大风一家耙树叶、割草坪、照看孩子和做其他家务。最近，格兰特·盖尔为鲍勃·诺伊斯苦恼不已。和他的兄弟们一样，鲍勃也是一个聪明的学生，但他刚刚被学校开除了一个学期，盖尔不仅与其他教职员工合作，而且还与治安官合作，才没有让这个男孩被永久开除，并以重罪定罪而蒙受耻辱，这一切都归功于盖尔对当地银行的好感。\n鲍勃·诺伊斯的父亲老拉尔夫是一名公理公会牧师。不仅如此，他的两位祖父都是公理公会的牧师。但这丝毫没有帮助。奇怪的是，事情发生后，这个男孩的神职人员血统竟然自食其果地落到了他身上。人们到处说，嗯，你对一个传教士的儿子有什么期望？这就好像格林内尔的人们下意识地同意舍伍德·安德森的观点，即在中西部新教传教士敦促他们的正义之下，住着迟早会爆发的软弱、变态和虚伪的恶魔。\n没有人否认诺伊斯家的男孩在所有外表上都彬彬有礼，举止得体。他们都是童子军的成员。他们参加了主日学校和第一公理公会教堂的主要主日礼拜活动，并活跃在教会青年团体中。他们被充斥着公理主义，直到它溢出。他们的父亲虽然是一名牧师，但并不是第一次公理公会的牧师。他是爱荷华州公理教会会议的副校长，总部设在学院。这所学院的初衷是提供良好的学术会议教育，许多毕业生成为了教师。会议是一个协调委员会，而不是管理机构，因为公理教会的一个主要宗旨，嵌入其名称，是每个会众是自治的。公理公会教徒拒绝接受教会等级制度的想法。公理会牧师不应该是父亲，甚至不应该是牧羊人，而应该是老师。会众中的每个成员都应该内化教会的道德戒律，成为自己的牧师，直接与上帝打交道。因此，爱荷华州公理教会会议秘书的工作绝不是一个有权力的职位。它也没付多少钱。\n诺伊斯夫妇没有自己的房子。他们住在一座两层的白色隔板房子里，这座房子属于学院位于公园街和第十大道的教堂所有。在格林内尔，没有自己的房子并不像在东部那样背负着社会责任。格林内尔没有上流社会。在这样的事情上，没有顶尖的人保持社会评分。公理公会教徒强烈反对社会等级制度的想法，就像他们拒绝宗教等级制度的想法一样。公理会教徒，像长老会教徒、卫理公会教徒、浸礼会教徒和联合弟兄会教徒一样，都是持不同意见的新教徒。他们是分离主义者的直接分支，分离主义者在16世纪和17世纪从英格兰教会分离出来，定居在新英格兰。归根结底，他们的自治会众学说源于他们对英国无穷无尽的等级制度和地位制度的憎恨，最重要的是宫廷和贵族。即使在1948年，像格林内尔这样典型的中西部小镇，也没有什么能与乡村俱乐部相提并论的。格林内尔和其他任何地方一样，地位有细微的差别，富比穷要好。\n拉尔夫·诺伊斯(Ralph Noyce)和传教士的儿子拉尔夫·诺伊斯(Ralph Noyce)能做的就这么多了。另一方面，格兰特·盖尔是冷静的、备受尊敬的第三方。他有两项艰巨的任务：不让鲍勃进监狱和上法庭，以及不让学院行政部门开除他。仅仅是在手腕上拍一下，从来就没有任何希望。格兰特·盖尔帮助达成的妥协-停学一学期-是鲍勃现实中所能期待的最好的交易。\n“洛猪之夜”是格林内尔·里氏震级的一个相当小的丑闻。因此，盖尔对鲍勃·诺伊斯接受这件事的方式印象更深。当地的死亡光辉从未动摇过他的信心。所有的诺伊斯男孩都有一种深刻的，说实话，令人费解的自信。鲍勃有一种倾听和凝视的方式。他会微微低下头，抬起头来，凝视着似乎大约100安培的电流。当他看着你的时候，他从来没有眨过眼睛，也没有吞咽过。他吸收了你说的每一句话，然后非常平和地回答，声音柔和的男中音，经常带着露出他那对可怕的牙齿的微笑。眼神、声音、微笑--这一切都有点像格林内尔学院最著名的校友加里·库珀在电影中的形象。鲍勃·诺伊斯有着健美的脸蛋、运动员的身材和加里·库珀的举止，他投射出心理学家所说的光环效应。有光环效应的人似乎非常清楚他们在做什么，而且，这会让你想要钦佩他们。他们让你看到他们头顶上的光环。\n几年后，人们自然会想知道鲍勃·诺伊斯是从哪里得到这样的信心的。许多人得出结论，这既来自他的父亲，也来自他的母亲哈里特·诺顿·诺伊斯(Harriett Norton Noyce)。她是那种意志坚强、聪明的新英格兰风格女性的现代版，100年前在爱荷华州的开拓者时代，她做出了如此大的改变。在在格林内尔教授数学的罗兰·克罗斯(Rowland Cross)的帮助下，他的父母安排鲍勃在纽约市公平人寿精算部(Equable Life)的精算部工作一个夏天。他在秋季学期继续工作，然后在圣诞节回到格林内尔，并在1月份第二学期开始时重新加入高年级。盖尔对浪子回来时的沉着印象深刻。在他的头三年里，鲍勃积累了如此多的额外学分，他只需要这个最后一个学期就能毕业。他恢复了大学生活，包括课外活动，一刻也没有跳过。但更重要的是，鲍勃参与了一种新的实验设备，它占用了盖尔大量的时间：晶体管，这让盖尔感到欣慰。\n诺伊斯和他的妻子于上午6点抵达帕洛阿尔托。到中午时，他已经签了买房的合同。那天下午，他去找肖克利要一份工作，投射出光环，就得到了。\n鲍勃不是唯一对晶体管感兴趣的物理专业学生，但他似乎是对这种新机制可能会走向何方最感兴趣的人。今年秋天，他去了剑桥的麻省理工学院(Massachusetts Institute Of Technology)开始他的研究生工作。当他在麻省理工学院提出晶体管的话题时，甚至对教职员工来说，人们都只是看着他。即使是那些听说过它的人也认为这只是电话公司编造的新奇玩意儿。没有涉及晶体管或固态电子学理论的课程作业。他的论文是绝缘体表面态的光电研究，充其量只是固态电子学的背景知识。在这方面，麻省理工学院远远落后于格林内尔学院。在整整四年的时间里，格兰特·盖尔一直是鲍勃·诺伊斯在这个新领域里为数不多的可以交流意见的人之一。\n嗯，这是一场势均力敌的比赛！如果格兰特·盖尔没有和约翰·巴丁一起上学，如果奥利弗·巴克利不是格林内尔大学的校友，那会怎样？如果盖尔在报纸上读到关于晶体管的小笑话后，没有费心与他们两个取得联系，那会怎样呢？如果他在卢奥猪之夜之后没有去替鲍勃·诺伊斯代言，而那个男孩被大学开除了，那该怎么办？毕竟，如果鲍勃不能在格林内尔完成学业，他很可能永远不会被介绍给晶体管。他当然不会在1948年的麻省理工学院遇到它。考虑到鲍勃·诺伊斯在接下来的20年里所做的一切，人们不禁想知道这一连串的偶然事件。\n偶然的..。井!。乔赛亚·格林内尔，在天堂的平原上，一定对此大笑起来！\n格兰特·盖尔是鲍勃·诺伊斯职业生涯中第一位重要的物理学家。第二位是威廉·肖克利。事后\n.", "note_en": "In 1948 there were seven thousand people in Grinnell, Iowa, including more than one who didn&#39;t dare take a drink in his own house without pulling the shades down first. It was against the law to sell liquor in Grinnell, but it was perfectly legal to drink it at home. So it wasn&#39;t that. It wasn&#39;t even that someone might look in through the window and disapprove. God knew Grinnell had more than its share of White Ribbon teetotalers, but by 1948 alcohol was hardly the mark of Cain it had once been. No, those timid souls with their fingers through the shade loops inside the white frame houses on Main Street and Park Street were thinking of something else altogether.\n They happened to live on land originally owned by the Congregational minister who had founded the town in 1854, Josiah Grinnell. Josiah Grinnell had sold off lots with covenants, in perpetuity, stating that anyone who allowed alcohol to be drunk on his property forfeited ownership.  In perpetuity! In perpetuity was forever, and 1948 was not even a hundred years later. In 1948 there were people walking around Grinnell who had known Josiah Grinnell personally. They were getting old; Grinnell had died in 1891; but they were still walking around. So... why take a chance!\n  The plain truth was, Grinnell had Middle West written all over it. It was squarely in the middle of Iowa&#39;s Midland corn belt, where people on the farms said &#34;crawdad&#34; instead of crayfish and &#34;barn lot&#34; instead of barnyard. Grinnell had been one of many Protestant religious communities established in the mid-nineteenth century after Iowa became a state and settlers from the East headed for the farmlands. The streets were lineal with white clapboard houses and elm trees, like a New England village. And today, in 1948, the hard-scrubbed Octagon Soap smell of nineteenth-century Protestantism still permeated the houses and Main Street as well. That was no small part of what people in the East thought of when they heard the term &#34;Middle West.&#34; For thirty years writers such as Sherwood Anderson, Sinclair Lewis, and Carl Van Vechten had been prompting the most delicious sniggers with their portraits of the churchy, narrow-minded Middle West. The Iowa painter Grant Wood was thinking of farms like the ones around Grinnell when he did his famous painting  American Gothic. Easterners recognized the grim, juiceless couple in Wood&#39;s picture right away. There were John Calvin&#39;s and John Knox&#39;s rectitude reigning in the sticks.\n In the fall of 1948 Harry Truman picked out Grinnell as one of the stops on his whistle-stop campaign tour, one of the hamlets where he could reach out to the little people, the average Americans of the heartland, the people untouched by the sophisticated opinion-makers of New York and Washington. Speaking from the rear platform of his railroad car, Truman said he would never forget Grinnell, because it was Grinnell College, the little Congregational academy over on Park Street, that had given him his first honorary degree. The President&#39;s fond recollection didn&#39;t cut much ice, as it turned out. The town had voted Republican in every presidential election since the first time Abraham Lincoln ran, in 1860, and wasn&#39;t about to change for Harry Truman.\n On the face of it, there you had Grinnell, Iowa, in 1948: a piece of mid-nineteenth-century American history frozen solid in the middle of the twentieth. It was one of the last towns in America that people back east would have figured to become the starting point of a bolt into the future that would create the very substructure, the electronic grid, of life in the year 2000 and beyond.\n    It was in the summer of 1948 that Grant Gale, a forty-five-year-old physics professor at Grinnell College, ran across an item in the newspaper concerning a former classmate of his at the University of Wisconsin named John Bardeen. Bardeen&#39;s father had been dean of medicine at Wisconsin, and Gale&#39;s wife Harriet&#39;s father had been dean of the engineering school, and so Bardeen and Harriet had grown up as fellow faculty brats, as the phrase went. Both Gale and Bardeen had majored in electrical engineering. Eventually Bardeen had taught physics at the University of Minnesota and had then left the academic world to work for Bell Laboratories, the telephone company&#39;s main research center, in Murray Hill, New Jersey. And now, according to the item, Bardeen and another engineer at Bell, Walter Brattain, had invented a novel little device they called a transistor.\n It was only an item, however; the invention of the transistor in 1948 did not create headlines. The transistor apparently performed the same function as the vacuum tube, which was an essential component of telephone relay systems and radios. Like the vacuum tube, the transistor could isolate a specific electrical signal, such as a radio wave, and amplify it. But the transistor did not require glass tubing, a vacuum, a plate, or a cathode. It was nothing more than two minute gold wires leading to a piece of processed germanium less than a sixteenth of an inch long, shaped like a tiny brick. Germanium, an element found in coal, was an insulator, not a conductor. But if the germanium was contaminated with impurities, it became a &#34;semiconductor.&#34; A vacuum tube was also a semiconductor; the vacuum itself, like the germanium, was an insulator. But as every owner of a portable radio knew, vacuum tubes drew a lot of current, required a warm-up interval before they would work, and then got very hot. A transistor eliminated all these problems and, on top of that, was about fifty times smaller than a vacuum tube.\n Bob had a certain way of listening and staring. He would lower his head slightly and look up with a gaze that seemed to be about one hundred amperes.\n So far, however, it was impossible to mass-produce transistors, partly because the gold wires had to be made by hand and attached by hand two thousandths of an inch apart. But that was the telephone company&#39;s problem. Grant Gale wasn&#39;t interested in any present or future applications of the transistor in terms of products. He hoped the transistor might offer a way to study the flow of electrons through a solid (the germanium), a subject physicists had speculated about for decades. He thought it would be terrific to get some transistors for his physics department at Grinnell. So he wrote to Bardeen at Bell Laboratories. Just to make sure his request didn&#39;t get lost in the shuffle, he also wrote to the president of Bell Laboratories, Oliver Buckley. Buckley was from Sloane, Iowa, and happened to be a Grinnell graduate. So by the fall of 1948 Gale had obtained two of the first transistors ever made, and he presented the first academic instruction in solid-state electronics available anywhere in the world, for the benefit of the eighteen students majoring in physics at Grinnell College.\n  One of Grant Gale&#39;s senior physics majors was a local boy named Robert Noyce, whom Gale had known for years. Bob and his brothers, Donald, Gaylord, and Ralph, lived just down Park Street and used to rake leaves, mow the lawn, baby-sit, and do other chores for the Gales. Lately Grant Gale had done more than his share of agonizing over Bob Noyce. Like his brothers, Bob was a bright student, but he had just been thrown out of school for a semester, and it had taken every bit of credit Gale had in the local favor bank, not only with other faculty members but also with the sheriff, to keep the boy from being expelled for good and stigmatized with a felony conviction.\n Bob Noyce&#39;s father, Ralph Sr., was a Congregational minister. Not only that, both of his grandfathers were Congregational ministers. But that hadn&#39;t helped at all. In an odd way, after the thing happened, the boy&#39;s clerical lineage had boomeranged on him. People were going around saying, &#34;Well, what do you expect from a preacher&#39;s son?&#34; It was as if people in Grinnell unconsciously agreed with Sherwood Anderson that underneath the righteousness the midwestern Protestant preachers urged upon them, and which they themselves professed to uphold, lived demons of weakness, perversion, and hypocrisy that would break loose sooner or later.\n No one denied that the Noyce boys were polite and proper in all outward appearances. They were all members of the Boy Scouts. They went to Sunday School and the main Sunday service at the First Congregational Church and were active in the church youth groups. They were pumped full of Congregationalism until it was spilling over. Their father, although a minister, was not the minister of the First Congregational Church. He was the associate superintendent of the Iowa Conference of Congregational Churches, whose headquarters were at the college. The original purpose of the college had been to provide a good academic Congregational education, and many of the graduates became teachers. The Conference was a coordinating council rather than a governing body, since a prime tenet of the Congregational Church, embedded in its name, was that each congregation was autonomous. Congregationalists rejected the very idea of a church hierarchy. A Congregational minister was not supposed to be a father or even a shepherd but, rather, a teacher. Each member of the congregation was supposed to internalize the moral precepts of the church and be his own priest dealing directly with God. So the job of secretary of the Iowa Conference of Congregational Churches was anything but a position of power. It didn&#39;t pay much either.\n The Noyces didn&#39;t own their own house. They lived in a two-story white clapboard house that was owned by the church at Park Street and Tenth Avenue, at the college. Not having your own house didn&#39;t carry the social onus in Grinnell that it did in the East. There was no upper crust in Grinnell. There were no top people who kept the social score in such matters. Congregationalists rejected the idea of a social hierarchy as fiercely as they did the idea of a religious hierarchy. The Congregationalists, like the Presbyterians, Methodists, Baptists, and United Brethren, were Dissenting Protestants. They were direct offshoots of the Separatists, who had split off from the Church of England in the sixteenth and seventeenth centuries and settled New England. At bottom, their doctrine of the autonomous congregation was derived from their hatred of the British system of class and status, with its endless gradations, topped off by the Court and the aristocracy. Even as late as 1948 the typical small town of the Middle West, like Grinnell, had nothing approaching a country club set. There were subtle differences in status in Grinnell, as in any other place, and it was better to be rich than poor, but there were only two obvious social ranks: those who were devout, educated, and hardworking, and those who weren&#39;t. Genteel poverty did not doom one socially in Grinnell. Ostentation did. The Noyce boys worked at odd jobs to earn their pocket money. That was socially correct as well as useful. To have devoted the same time to taking tennis lessons or riding lessons would have been a gaffe in Grinnell.\n Donald, the oldest of the four boys, had done brilliantly at the college and had just received his Ph.D. in chemistry at Columbia University and was about to join the faculty of the University of California at Berkeley. Gaylord, the second oldest, was teaching school in Turkey. Bob, who was a year younger than Gaylord, had done so well in science at Grinnell High School that Grant Gale had invited him to take the freshman physics course at the college during his high school senior year. He became one of Gale&#39;s star students and most tireless laboratory workers from that time on. Despite his apparent passion for the scientific grind, Bob Noyce turned out to be that much-vaunted creature, the well-rounded student. He was a trim, muscular boy, five feet eight, with thick dark brown hair, a strong jawline, and a long, broad nose that gave him a rugged appearance. He was the star diver on the college swimming team and won the Midwest Conference championship in 1947. He sang in choral groups, played the oboe, and was an actor with the college dramatic society. He also acted in a radio drama workshop at the college, along with his friend Peter Hackes and some others who were interested in broadcasting, and was the leading man in a soap opera that was broadcast over station WOI in Ames, Iowa.\n  Perhaps Bob Noyce was a bit too well rounded for local tastes. There were people who still remembered the business with the box kite back in 1941, when he was thirteen. It had been harmless, but it could have been a disaster. Bob had come across some plans for the building of a box kite, a kite that could carry a person aloft, in the magazine  Popular Science. So he and Gaylord made a frame of cross-braced pine and covered it with a bolt of muslin. They tried to get the thing up by running across a field and towing it with a rope, but that didn&#39;t work terribly well. Then they hauled it up on the roof of a barn, and Bob sat in the seat and Gaylord ran across the roof, pulling the kite, and Bob was lucky he didn&#39;t break his neck when he and the rig hit the ground. So then they tied it to the rear bumper of a neighbor&#39;s car. With the neighbor at the wheel, Bob rode the kite and managed to get about twelve feet off the ground and glide for thirty seconds or so and come down without wrecking himself or any citizen&#39;s house or livestock.\n Livestock ... yes. Livestock was a major capital asset in Grinnell, and livestock was at the heart of what happened in 1948. In May a group of Bob Noyce&#39;s friends in one of the dormitory houses at Grinnell decided to have a luau, and he was in on the planning. The Second World War had popularized the exotic ways of the South Pacific, so that in 1948 the luau was an up-to-the-minute social innovation. The centerpiece of a luau was a whole roasted suckling pig with an apple or a pineapple in its mouth. Bob Noyce, being strong and quick, was one of the two boys assigned to procure the pig. That night they sneaked onto a farm just outside of Grinnell and wrestled a twenty-five-pound suckling out of the pigpen and arrived back at the luau to great applause. Within a few hours the pig was crackling hot and had an apple in its mouth and looked good enough for seconds and thirds, which everybody helped himself to, and there was more applause. The next morning came the moral hangover. The two boys decided to go see the farmer, confess, and pay for the pig. They didn&#39;t quite understand how a college luau, starring his pig, would score on the laugh meter with a farmer in midland Iowa. In the state of Iowa, where the vast majority of people depended upon agriculture for a livelihood and upon Protestant morality for their standards, not even stealing a watermelon worth thirty-five cents was likely to be written off as a boyish prank. Stealing a pig was larceny. The farmer got the sheriff and insisted on bringing criminal charges.\n There was only so much that Ralph Noyce, the preacher with the preacher&#39;s son, could do. Grant Gale, on the other hand, was the calm, well-respected third party. He had two difficult tasks: to keep Bob out of jail and out of court and to keep the college administration from expelling him. There was never any hope at all of a mere slap on the wrist. The compromise Grant Gale helped work out—a one-semester suspension—was the best deal Bob could have hoped for realistically.\n The Night of the Luau Pig was quite a little scandal on the Grinnell Richter scale. So Gale was all the more impressed by the way Bob Noyce took it. The local deathray glowers never broke his confidence. All the Noyce boys had a profound and, to tell the truth, baffling confidence. Bob had a certain way of listening and staring. He would lower his head slightly and look up with a gaze that seemed to be about one hundred amperes. While he looked at you he never blinked and never swallowed. He absorbed everything you said and then answered very levelly in a soft baritone voice and often with a smile that showed off his terrific set of teeth. The stare, the voice, the smile—it was all a bit like the movie persona of the most famous of all Grinnell College&#39;s alumni, Gary Cooper. With his strong face, his athlete&#39;s build, and the Gary Cooper manner, Bob Noyce projected what psychologists call the halo effect. People with the halo effect seem to know exactly what they&#39;re doing and, moreover, make you want to admire them for it. They make you see the halos over their heads.\n Years later people would naturally wonder where Bob Noyce got his confidence. Many came to the conclusion it was as much from his mother, Harriett Norton Noyce, as from his father. She was a latter-day version of the sort of strong-willed, intelligent, New England–style woman who had made such a difference during Iowa&#39;s pioneer days a hundred years before. His mother and father, with the help of Rowland Cross, who taught mathematics at Grinnell, arranged for Bob to take a job in the actuarial department of Equitable Life in New York City for the summer. He stayed on at the job during the fall semester, then came back to Grinnell at Christmas and rejoined the senior class in January as the second semester began. Gale was impressed by the aplomb with which the prodigal returned. In his first three years Bob had accumulated so many extra credits, it would take him only this final semester to graduate. He resumed college life, including the extracurricular activities, without skipping a beat. But more than that, Gale was gratified by the way Bob became involved with the new experimental device that was absorbing so much of Gale&#39;s own time: the transistor.\n Noyce and his wife arrived in Palo Alto at six a.m. By noon he had signed a contract to buy a house. That afternoon he went to ask Shockley for a job, projected the halo, and got it.\n Bob was not the only physics major interested in the transistor, but he was the one who seemed most curious about where this novel mechanism might lead. He went off to the Massachusetts Institute of Technology, in Cambridge, in the fall to begin his graduate work. When he brought up the subject of the transistor at MIT, even to faculty members, people just looked at him. Even those who had heard of it regarded it merely as a novelty fabricated by the telephone company. There was no course work involving transistors or the theory of solid-state electronics. His dissertation was a &#34;Photoelectric Study of Surface States on Insulators,&#34; which was at best merely background for solid-state electronics. In this area MIT was far behind Grinnell College. For a good four years Grant Gale remained one of the few people Bob Noyce could compare notes with in this new field.\n Well, it had been a close one! What if Grant Gale hadn&#39;t gone to school with John Bardeen, and what if Oliver Buckley hadn&#39;t been a Grinnell alumnus? And what if Gale hadn&#39;t bothered to get in touch with the two of them after he read the little squib about the transistor in the newspaper? What if he hadn&#39;t gone to bat for Bob Noyce after the Night of the Luau Pig and the boy had been thrown out of college and that had been that? After all, if Bob hadn&#39;t been able to finish at Grinnell, he probably never would have been introduced to the transistor. He certainly wouldn&#39;t have come across it at MIT in 1948. Given what Bob Noyce did over the next twenty years, one couldn&#39;t help but wonder about the fortuitous chain of events.\n Fortuitous ... well! How Josiah Grinnell, up on the plains of Heaven, must have laughed over that!\n  GRANT GALE WAS the first important physicist in Bob Noyce&#39;s career. The second was William Shockley. After\n......", "posttime": "2020-08-11 07:59:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗伯特,robert", "title": "罗伯特·诺伊斯的修修补补(1983)", "title_en": "The Tinkerings of Robert Noyce (1983)", "transed": 1, "url": "https://www.esquire.com/news-politics/a12149389/robert-noyce-tom-wolfe/", "via": "", "real_tags": ["罗伯特", "robert"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017451, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近观看了与流量总监(Traffic Director)一起构建企业级服务网络的过程，其中包括GCP的斯图尔特·赖克林(Stewart Reichling)和凯尔西·海托尔(Kouly HighTower)，当然还有谷歌云的流量总监。带着一个沉浸在AWS 5年半技术和文化中的大脑来到这里，以似乎值得分享的方式得出这一结论是令人惊讶的。\n斯图尔特提出了一个零售应用程序的购物车结账代码的问题。显然，首先您需要呼叫支付服务。无论它是如何实现的，这需要是一个同步调用，因为在您知道付款是否正常之前，您不会开始任何履行工作。\n如果您是大型联盟运营商，您的支付处理需要扩展，并且很可能是您呼叫的外部服务。这就提出了如何部署和扩展它，以及客户端如何找到它的问题。由于这是GCP，因此假定为Kubernetes和服务交换矩阵。我不打算在这里解释“服务结构”；如果你需要了解，可以去网上搜索一下“特使”和“Istio”以及“Linkerd”的组合。\n第一件让我惊讶的事情是Stewart谈到了扩展支付服务的负载均衡器的困难，而且这是服务中需要配置的另一件事，记住您需要健康检查，并且可能需要对多个服务进行负载平衡。我想，这很公平。他们的解决方案是一个客户端-本地负载均衡器，嵌入到服务网格中的SideCar代码中。WOW…。在这样的环境中，我认为我所知道的关于负载平衡问题的一切都可能是错误的。似乎有一种含蓄的说法，认为客户端负载平衡是一种胜利，但我不能很好地分析这一论点。违反直觉！需要深入调查这件事。\n我脑海中的AWS声音在说：“你为什么不把你的支付服务放在API Gateway后面呢？还是白血球？或者甚至可以直接调用Lambda函数？(或者，很明显，它们的GCP等价物。)。它们具有内置的负载平衡、监控和错误报告功能。不管怎么说，无论你走哪条路，你都可能需要应用级的金丝雀。“。我有点担心隐藏网络发生的地方，就像我担心ORM隐藏SQL一样。因为您不能忽略网络或SQL。\n交通主管·这是一头有趣的野兽。原来有一组名为“XDS”的API，最初来自特使，很好地引入到了通用数据平面API中。它们管理侧车提供的各种功能：端点发现和路由、运行状况检查、机密、监听程序。Google所做的是安排GRPC支持XDS进行配置，似乎Traffic Director可以结合使用K8和服务网格、GRPC，甚至是本地内容来配置和部署您的服务；再加上支持XDS的任何东西。其中显然包括Google Cloud Run。\n它做了很多有用的事情。至少在构建分布式应用程序时是有用的，方法是通过Service Fabric将任何可能的任意API调用转换为代理负载平衡的、受监控的日志服务。\n这是好事吗？我想，有时候，否则人们就不会把所有这些工作都放在工具和便利化上。您什么时候会选择这种方法将服务连接在一起，而不是有意识地以AWS风格将或多或少的一切构建为具有端点的服务？我不知道。假设：您可以在已经接受Kubernetes的情况下执行此操作，因为在该上下文中，服务Fabric是本地集成习惯用法。\n我对如何设置“全局”路由印象特别深刻，这意味着针对在多个Google区域运行的资源进行负载平衡(这与AWS区域或Azure区域的含义不同)。AWS将鼓励您使用多个AZ来实现此效果。\n此外，还有很多对自动部署操作的支持，我不知道它们是否扩展了当前最先进的GCP，但它们看起来不错。\n最后，当斯图尔特指出，有了交通主管，你不需要摆弄iptables就能让事情正常工作，这让我再次大吃一惊。我不知道这是人们仍然要做的事情；如果这能让它消失，那一定是一件好事。\n凯尔西成功了·凯尔西·海托尔在47分钟的视频中用了14分钟来展示如何在笔记本电脑上部署一个简单的演示应用程序，然后在流量总监的帮助下，在Virts和K8资源的各种组合上部署，然后运行Google Cloud。这是令人印象深刻的，但就像大多数K8演示一样，假设您已经启动、运行和配置了所有东西，因为如果不这样做，像凯尔西这样的银河大脑专家将需要几个小时(可能是吗？)。像我这样的人大多是K8新手，谁知道呢，但可能要几天。\n我不知道，我在这里是少数人，但是该死的，这东西是不是很复杂。要想让“Hello world”上演，你必须配置恰到好处的活动部件的数量，这真的非常吓人。\n但请记住，第一次进入AWS的人完全有可能发现那里的配置工作同样可怕。要在AWS上执行此类操作，您将花费(我认为)较少的时间进行服务配置，但之后您必须将所有IAM角色和权限连接起来，以便任何内容都可以与任何内容进行对话，这可能会很快变得毛骨悚然。我注意到GCP Preso完全省略了访问控制问题。所以，总而言之，我没有证据来声称“哇，这在亚马逊上会更简单！” - 只是说旋钮和刻度盘的数量令人望而生畏。\n有一件事让我喘不过气来，然后大笑起来。凯尔西说：“下一步，你只需要把这个放到你的Go进口中，你不需要使用它或其他什么东西：\n我只是在想“该死的，这怎么能做什么呢？”但几分钟后，他开始将端点URI连接到以xdi：开头的配置文件中。尽管如此，还是有一点代码的味道在发生，还是只有我一个人这样？\n不管怎么说，如果我已经在做一些服务结构的事情，我认为流量总监可能会满足今天的一些需求，当我的应用程序开始变得多样化，需要与不在同一服务网络中的各种东西交谈时，流量总监可能会变得非常有价值。\n我错过了什么·Stewart的叙述在付款后停止了，我一直在等待谜题的实现部分，因为对于这一点，同步API很可能不是你想要的，事件驱动和基于消息的异步基础设施将会发挥作用。当然，这也是我最近花了很多时间做的。我想知道这如何适应K8/服务交换矩阵环境？", "note_en": "I recently watched  Build an enterprise-grade service mesh with Traffic Director, featuring Stewart Reichling and Kelsey Hightower of GCP, and of course Google Cloud’s  Traffic Director. Coming at this with a brain steeped in 5½ years of AWS technology and culture was surprising in ways that seem worth sharing.\n Stewart presents the problem of a retail app’s shopping-cart checkout code. Obviously, first you need to call a payment service. However it’s implemented, this needs to be a synchronous call because you’re not going to start any fulfillment work until you know the payment is OK.\n If you’re a big-league operation, your payment processing needs to scale and is quite likely an external service you call out to. Which raises the questions of how you deploy and scale it, and how clients find it. Since this is GCP, both Kubernetes and a service fabric are assumed. I’m not going to explain “service fabric” here; if you need to know go and web-search some combination of Envoy and Istio and Linkerd.\n The first thing that surprised me was Stewart talking about the difficulty of scaling the payment service’s load balancer, and it being yet another thing in the service to configure, bearing in mind that you need health checks, and might need to load-balance multiple services. Fair enough, I guess. Their solution was a client-local load balancer, embedded in sidecar code in the service mesh. Wow… in such an environment, everything I think I know about load-balancing issues is probably wrong. There seemed to be an implicit claim that client-side load balancing is a win, but I couldn’t quite parse the argument. Counterintuitive! Need to dig into this.\n And the AWS voice in the back of my head is saying “Why don’t you put your payments service behind API Gateway? Or ALB? Or maybe even make direct calls out to a Lambda function? (Or, obviously, their GCP equivalents.) They come with load-balancing and monitoring and error reporting built-in. And anyhow, you’re probably going to need application-level canaries, whichever way you go.” I worry a little bit about hiding the places where the networking happens, just like I worry about ORM hiding the SQL. Because you can’t ignore either networking or SQL.\n  Traffic Director · It’s an interesting beast. It turns out that there’s there’s a set of APIs called “xDS”, originally from Envoy, nicely introduced in  The universal data plane API. They manage the kinds of things a sidecar provides: Endpoint discovery and routing, health checks, secrets, listeners. What Google has done is arrange for gRPC to support xDS for configuration, and it seems Traffic Director can configure and deploy your services using a combination of K8s with a service mesh, gRPC, and even on-prem stuff; plus pretty well anything that supports xDS. Which apparently includes Google Cloud Run.\n It does a lot of useful things. Things that are useful, at least, in the world where you build your distributed app by turning potentially any arbitrary API call into a proxied load-balanced monitored logged service, via the Service Fabric.\n Is this a good thing? Sometimes, I guess, otherwise people wouldn’t be putting all this work into tooling and facilitation. When would you choose this approach to wiring services together, as opposed to consciously building more or less everything as a service with an endpoint, in the AWS style? I don’t know. Hypothesis: You do this when you’re already bought-in to Kubernetes, because in that context service fabric is the native integration idiom.\n I was particularly impressed by how you could set up “global” routing, which means load balancing against resources that run in multiple Google regions (which don’t mean the same things as AWS regions or Azure regions). AWS would encourage you to use multiple AZ’s to achieve this effect.\n Also there’s a lot of support for automated-deployment operations, and I don’t know if they extend the current GCP state of the art, but they looked decent.\n Finally, I once again taken aback when Stewart pointed out that with Traffic Directors, you don’t have to screw around with iptables to get things working. I had no idea that was something people still had to do; if this makes that go away, that’s gotta be a good thing.\n Kelsey makes it go · Kelsey Hightower takes 14 of the video’s 47 minutes to show how you can deploy a simple demo app on your laptop then, with the help of Traffic Director, on various combinations of virts and K8s resources and then Google Cloud Run. It’s impressive, but as with most K8s demos, assumes that you’ve everything up and running and configured because if you didn’t it’d take a galaxy-brain expert like Kelsey a couple of hours (probably?) to pull that together and someone like me who’s mostly a K8s noob, who knows, but days probably.\n I dunno, I’m in a minority here but damn, is that stuff ever complicated. The number of moving parts you have to have configured just right to get “Hello world” happening is really super intimidating.\n But bear in mind it’s perfectly possible that someone coming into AWS for the first time would find the configuration work there equally scary. To do something like this on on AWS you’d spend (I think) less time doing the service configuration, but then you’d have to get all the IAM roles and permissions wired up so that anything could talk to anything, which can get hairy fast. I noticed the GCP preso entirely omitted access-control issues. So, all in, I don’t have evidence to claim “Wow, this would be simpler on AWS!”  — just that the number of knobs and dials was intimidating.\n One thing made me gasp then laugh. Kelsey said “for the next step, you just have to put this in your Go imports, you don’t have to use it or anything:\n   I was all “WTF how can that do anything?” but then a few minutes later he started wiring endpoint URIs into config files that began with  xdi: and oh, of course. Still, is there, a bit of a code smell happening or is that just me?\n  Anyhow · If I were already doing a bunch of service-fabric stuff, I think that Traffic Director might meet some needs of today and could become really valuable when my app started getting heterogeneous and needed to talk to various sorts of things that aren’t in the same service mesh.\n  What I missed · Stewart’s narrative stopped after the payment, and I’d been waiting for the fulfillment part of the puzzle, because for that, synchronous APIs quite likely aren’t what you want, event-driven and message-based asynchronous infrastructure would come into play. Which of course what I spent a lot of time working on recently. I wonder how that fits into the K8s/service-fabric landscape?", "posttime": "2020-08-11 07:59:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流量,cloud,服务", "title": "云流量", "title_en": "Cloud Traffic", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2020/08/09/Service-Fabric-News", "via": "", "real_tags": ["流量", "cloud", "服务"]}, {"category": "", "categoryclass": "", "imagename": "bfdba7a0fab8de6d1ffdc21364193640.jpg", "infoid": 1017450, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不足为奇的是，迪士尼正在重新命名其电视制片厂，从其中两个制片厂中删除福克斯的名字。\n在收购20世纪福克斯电视和福克斯21电视制片厂近一年半后，迪士尼正在将前者改为简单的20电视，而后者将成为试金石电视。此外，ABC Signature Studios及其子公司ABC Signature Studios将合并为一个单位，现在将称为ABC Signature。迪士尼电视制片厂品牌重塑的全面整合立即生效，观众将在屏幕上看到的新标志和动作终结卡预计将在年底前完成。预计不会有高管变动或裁员作为变革的一部分。\n迪士尼和21世纪福克斯之间价值713亿美元的更大交易的一部分，就是将福克斯从其中两家制片厂中删除的决定。福克斯在1月份被从20世纪和探照灯的电影部门除名。\n我们新的工作室名称和标识标志着ABC Signature、第20 TV和Touchstone TV的新一天，同时也是为了纪念它们丰富的历史和华特迪士尼公司的创造力。达娜(沃尔登)和我对我们三家工作室作为迪士尼电视工作室的一部分的第一年感到非常高兴，我们相信，凭借我们强大的人才名册和出色的工作室团队，最好的还没有到来，迪士尼电视工作室总裁克雷格·胡内斯(Craig Hunegs)说。\n放弃福克斯21(Fox 21)的旗帜，转而支持试金石(Touchstone)，这让这个2007年退役的前迪士尼品牌重新焕发生机，当时该部门更名为ABC TV Studios，这是该公司放弃这些不太知名的品牌，转而支持那些倾向于其标志性资产的品牌的努力的一部分。复兴试金石是纪念过去的一种方式。美国广播公司的新签名将由总统乔尼·戴维斯(Jonnie Davis)监督。特蕾西·安德伍德(Tracy Underwood)将ABC工作室纳入她在ABC Signature的职权范围，她将继续向戴维斯汇报工作。在戴维斯将安德伍德的角色扩大到包括这两个单位后，这两个部门的混合被认为是合乎逻辑的下一步进展。ABC Signature Studios以前是ABC Studios的有线电视和流媒体部门。由于流式传输是每个工作室的优先事项，两个单元的混合是有意义的。\n试金石电视将由福克斯21&39；的伯特·索尔克(Bert Salke)负责监督。卡罗琳·卡西迪将继续领导第20电视台。", "note_en": "To no surprise, Disney is rebranding its TV studios to remove the Fox name from two of them.\n Nearly a year and a half after acquiring 20th Century Fox Television and Fox 21 TV Studios, Disney is changing the former to simply 20th Television, while the latter will become Touchstone Television. Additionally, ABC Studios and its subsidiary ABC Signature Studios are folding into one unit that will now be called ABC Signature. The full integration of the Disney Television Studios rebranding is effective immediately, with new logos and motion end cards that viewers will see on screen expected to be completed by year&#39;s end. No executive changes or layoffs are expected as part of the changes.\n The decision to remove &#34;Fox&#34; from two of the studios&#39; names was part of the larger $71.3 billion deal between Disney and 21st Century Fox. Fox was dropped from film divisions 20th Century and Searchlight in January.\n &#34;Our new studio names and logos mark a new day for ABC Signature, 20th Television and Touchstone Television while honoring their rich histories and the creative power of the Walt Disney Co. Dana [Walden] and I could not be more pleased with the first year of our three studios together as part of Disney Television Studios and we believe that with our powerhouse talent roster and exceptional studio teams, the best is yet to come,&#34; said Disney TV Studios president Craig Hunegs.\n Dropping the Fox 21 banner in favor of Touchstone revives the former Disney brand that was retired in 2007 as the division was then-rebranded as ABC TV Studios as part of the company&#39;s push to drop such lesser-known brands in favor of those leaning into its signature assets. Reviving Touchstone is a way to honor the past. The new ABC Signature will be overseen by president Jonnie Davis. Tracy Underwood, who added ABC Studios to her purview at ABC Signature, will continue to report to Davis. The blending of the two divisions was considered a logical next progression after Davis expanded Underwood&#39;s role to include both units. ABC Signature Studios was previously the cable and streaming arm of ABC Studios. With streaming a priority for every studio, the blending of the two units makes sense.\n Touchstone TV will be overseen by Fox 21&#39;s Bert Salke. Carolyn Cassidy will continue to lead 20th Television.", "posttime": "2020-08-11 07:33:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,福克斯,removes,工作室", "title": "迪士尼将福克斯从电视制片厂撤下，重振试金石", "title_en": "Disney Removes Fox From TV Studios, Revives Touchstone", "transed": 1, "url": "https://www.hollywoodreporter.com/live-feed/disney-removes-fox-tv-studios-revives-touchstone-1306645", "via": "", "real_tags": ["ios", "福克斯", "removes", "工作室"]}, {"category": "", "categoryclass": "", "imagename": "894349296fce5d28231e98c0d1efc448.jpg", "infoid": 1017449, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年8月4日，一场巨大的爆炸在贝鲁特市中心掀起了致命的海浪。然后，火球的视频几乎同样迅速地在世界各地传播开来。现在，爆炸的细节开始于贝鲁特码头尽头一座小型仓库的烟花储存区，全世界都在等待最终的死亡、受伤和破坏数字。然而，在某种程度上，世界已经对会发生什么有所了解，因为以前也发生过类似的爆炸事件。\n作为一名生物医学工程师，拥有爆炸后伤害和创伤模式的博士学位，从意外爆炸中收集信息是我日常工作的一部分。更普通的爆炸很少有这么大的规模，但同样的物理和化学原理也适用。科学，以及一些来自历史的案例研究，让我也做一些初步的计算来解开这次爆炸的谜团。\n1917年，新斯科舍省哈利法克斯港意外引爆了600万磅的大杂烩烈性炸药，留下了一片残骸，至少到周二为止，这是人类有史以来造成的最大规模的非核爆炸。随着我们对贝鲁特有更多的了解，这可能会挑战这一纪录，哈利法克斯的故事告诉我们，我们可能会从随后的创伤中学到什么，现代手机视频，以及科学家在其间收集的爆炸物理学，告诉我们为什么这些创伤模式会以这种方式发生。\n每一场火灾都是分子的重新排列，而爆炸基本上就是一场以超高能量为燃料的疯狂大火。不稳定的结构彼此交换和交换原子，直到它们都乐于交易，幸福地安顿到更放松、更低能量的状态，就像到达山脚的岩石一样。但是他们多余的能量一定会流向某个地方。在营火中，光是空气中的氧气就能悠闲地促进化学反应，能量随着令人愉快的热和光的水平而缓慢释放。然而，在一次爆炸中，邪恶的小煽动者氧气将这一过程推到了超速状态。\n有关爆炸的早期报道显示，引发火山喷发的建筑可能储存了大量硝酸铵，这是一种易燃化学物质，其表现形式作为肥料相对无害，但也已被试验作为火箭燃料。氧气是硝酸铵致命爆炸习惯的关键，鉴于上个世纪发生了47起已知的重大意外硝酸铵爆炸事件，这无疑是一种习惯。“铵”是有四个氢的氮原子，写成NH4+，而混合物的“硝酸盐”部分是有三个氧的氮，NO3-。在无聊的日常条件下，铵的+和硝酸盐的-将这两个分子拉到一个无害的拥抱中，但是当你添加一个火花-或者烟花-分子意识到它们的原子可以变得更活泼，转化成一些全新的东西。\n当硝酸铵被制成肥料时，它会与其他化学物质混合在一起，这些化学物质通常会阻止这种反应的发生，尽管正如2013年西部化肥公司的爆炸所证明的那样，这些化学物质并不总是成功的。来自贝鲁特的第一批报道表明，化肥可能再次成为罪魁祸首。然而，社交媒体上分享的照片显示，贝鲁特码头上据信存放着标有“Nitroprill HD”的袋子，一些人猜测，如果这些照片是准确的，Nitroprill可能是名牌爆破剂硝普利的仿制品。硝普利是为煤矿使用而设计的，所以这种特殊的硝酸铵不会像肥料那样与镇静的化学品混合；相反，它会混合在一起吹。\n而硝酸盐，当混合在一起吹的时候，想要抛弃这些小O。它在化学上是不稳定的，这意味着NS和O之间的键以令人不快的物理紧张程度振动。超负荷的三个氧，NO 3-急于将一些氧推到任何邻居身上，只要有一点热来推动事情，它就会心甘情愿地这样做。NH4+太高兴了，不能接受。\n硝酸铵的化学重排回答了公众对视频的许多问题，包括羽状物令人惊叹的红色的来源。NO3的副产品之一是二氧化氮，因为它释放出所有的氧气，它具有NO2的逻辑上明显的化学结构，看起来很深，血红色。许多爆炸性物质在爆炸中会发出颜色和色彩，这表明它们的化学成分--用于给烟雾和爆炸着色的化学添加剂自20世纪20年代之前就已经存在，这就是我们获得不同颜色烟花和信号照明弹的原因-正是二氧化氮赋予了硝酸铵爆炸的标志性、不祥的血液般的基调。一次小小的爆炸可能看起来微妙和橙色-i\n布拉德·沃伊泰拉克(Brad Wojtylak)是一名特工炸弹技术员，也是烟酒火器和爆炸物管理局的认证爆炸专家，他表示，当烟柱足够大时，它们开始捕捉阳光，折射将使任何爆炸产生的正常颜色变暗。沃伊泰拉克没有直接参与贝鲁特的调查，但拥有16年调查爆炸事故的经验。他说，当阳光在污染物云中反弹时，其他不太确定的波长会被折射到不同的方向。当烟柱以如此大的规模出现时，只有最长的波长，也就是红色色调，会一直持续到另一边的观测者。因此，自然的红色变得比小爆炸更深、更丰富、更暗。\n一种纯燃烧的炸药，就像军用武器中使用的任何炸药一样，会产生看起来同样纯净的烟雾：雪白的，波涛汹涌的白色，有时还会产生浅灰色。但意外的爆炸远没有那么整洁，它们草率的燃烧也会产生火山灰、颗粒物和严重的黑色烧焦的污染物。这种黑色的粘性物质与其他副产品一起涌入天空，将烟柱染上颜色，就像篝火木头更有效的部分被烧毁后留下的木炭残留物一样。对于一名爆炸专家来说，这些视频在贝鲁特的码头上卷起了滚滚的黑红两色云彩，尖叫着“硝酸铵”。\n视频还显示，一个令人不安的均匀的白色半球从爆炸现场向外传播，一个恶气的圆顶最终冲向每一个拍摄的人，并在音频中以一声撞车的声音宣告它的到来。这个半球是爆炸产生的压力波。\n不，这不是冲击波。这是一种压力波，这一关键差异会影响预计的伤亡人数。冲击波从零压力到绝对最大压力只需零秒。压力波的冲击力就像从陡峭的悬崖上滚下来后撞到地面；冲击波的力量就像从空中坠落并达到终点速度后撞到地面。高能炸药产生冲击波；低能炸药，如硝酸铵，产生压力波，其形状有点倾斜，压力在一段时间内逐渐增加。\n冲击，因为它们迷人和复杂的物理，传播速度比音速快，它们造成的破坏比压力波大得多。值得庆幸的是，我们知道这次爆炸没有产生冲击波，因为充满水蒸气的白色圆顶的速度是可以测量的。\n声音在空气中的速度是每秒343米。根据后来一些照片中拍摄的视角和独特的红色椅子，我追踪了《卫报》发布的其中一段贝鲁特视频，找到了它在La Mezcaleria屋顶酒吧屋顶露台上的拍摄地点，并测量出它距离爆炸中心有885米。从这个有利位置可以看到，压力波首先从爆炸中心整齐地传播到桥墩末端和巨大的灰色长筒仓建筑边缘之间的中点，距离151米，然后到达桥墩末端，262米，最后到达La Mezcaleria。\n通过测量压力波到达视频中这些地标的时间，我们知道，当它沿着码头燃烧时，它的狂暴速度只有每秒312米。这对炸弹来说太慢了。然后，当可听到的撞车和混乱声到达以前平静而风景如画的户外酒吧时，它已经放慢到最多每秒289米。低于每秒343米音速的压力波，造成了破坏、恐怖、混乱、玻璃破碎、平板撕裂和旁观者的迷失方向，因为他们的耳朵受到快速的压力波动的影响。但冲击波可能会导致他们在观看时死于肺部创伤。\n在1917年600万磅的哈利法克斯爆炸中，冲击波在市中心的传播导致距离爆炸中心1.5英里的一系列死亡人数，估计有1950人死亡，另有8000人受伤。(众所周知，在港口爆炸的船只携带着烈性炸药，这些炸药本质上总是会产生冲击波。)。谢天谢地，在贝鲁特，尽管据报道，远至5.6英里(约合1.6公里)外的建筑物遭到了破坏，但由于低爆炸性硝酸铵产生的是压力波，而不是冲击波，迄今为止的死亡人数估计仍有数百人，尽管装药规模很可能比哈利法克斯的炸弹大。\n多亏了现代技术，即使在等待更完整的信息滴漏出来的同时，也可以使用具有说服力的陨石坑的大小来科学地计算装药大小。对码头航拍照片的分析显示，有一个直径在120米到140米之间的陨石坑；爆炸物理和历史相结合告诉我们，从地球的一侧雕刻这么大的一块需要相当于170到540万公斤TNT的药量(对于任何拖延转换成公制的美国人来说，这相当于380万到1180万磅)。作为参考，1995年俄克拉荷马城的摩拉大厦爆炸案使用了相当于18000公斤TNT的炸药。因此，贝鲁特的繁荣程度至少是俄克拉何马城的1000倍。\n顺便说一句，核武器将在离地面几百英尺的地方引爆，因此不会直接在土壤上施加足够的力量来形成火山口。广岛上空第一枚原子武器的爆炸几乎恰好发生在75年前的那一天，尽管它给这座城市和民众带来了历史上前所未有的创伤，但它没有留下弹坑。\n注册我们的Longreads时事通讯，从“连线”获得最好的功能、想法和调查。\n德国也知道储存不当的硝酸铵的破坏力，该国发生的一起事故加强了对装药量的计算。1921年，德国奥帕的一次化肥爆炸，刻出了一个非常相似的陨石坑。在410万公斤硝酸铵爆炸后，直径120米的奥帕陨石坑的大小支持了贝鲁特码头可能多装了数百万公斤炸药的想法。早期报道称，贝鲁特码头只容纳了2750吨-275万公斤。然而，特别探员沃伊泰拉克表示，即使只使用这2750吨，他的初步计算也表明，那些免受所有大屠杀风险的人需要距离贝鲁特码头至少15公里。\n在这个半径内，市中心发生的如此大规模的爆炸造成的伤害可能与经历过爆炸的受害者一样多，但其中一些人很可能是来自玻璃和其他飞行的投射物。玻璃扁平、易碎、易碎，安装在大片上，是微不足道的冲击波的完美目标；它比任何其他物质都更容易破碎和飞行。\n在哈利法克斯，最终引发主要爆炸的大火意味着，当炸弹爆炸时，市民们已经站在窗户前观看兴奋的场面。因此，在1917年那个早上的伤者中，碎玻璃穿透旁观者眼睛的伤害被描述为“非常普遍”。烟花储存区的事故及其令人震惊的浓烟同样保证了贝鲁特有大量的旁观者。如果没有烟雾吸引这些目击者，我们就不会有如此丰富的手机镜头，但受伤的人也可能会更少。\n根据杜克大学医院(Duke University Hospital)急诊室医生丹·巴克兰(Dan Buckland)的说法，哈利法克斯爆炸导致的一系列事件，在发生大规模伤亡事件后，至今仍在急诊室发生。2019年，北卡罗来纳州达勒姆发生天然气爆炸，虽然规模要小得多，但发生在人口稠密的市中心，巴克兰治疗了伤亡人员。他说，第一波患者是那些身体靠近急救服务的人，那些不幸受伤但幸运地在靠近救护车的地方受伤的人。在那之后，医院里充斥着“行走的伤员”，这些伤员受的伤足够多，可以寻求医疗护理，但又足够完好无损，可以转移自己。Buckland说，增加幸存者数量的关键是让第三波病人通过门，穿过第二波病人的人群。第三波是由那些在现场核心的人组成的，他们伤势太重，无法行走，急救人员在梳理残骸时将他们列为下一步的医疗优先事项。\n在平民区发生爆炸后，紧急救援人员并不是唯一的英雄。1917年12月6日上午9点刚过，在哈利法克斯，留着八字胡的45岁火车调度员文森特·科尔曼(Vincent Coleman)知道，哈利法克斯港装满炸药的船只缓缓冒出的浓烟是更糟糕的情况即将到来的可怕预兆。但当其他调度员逃命时，科尔曼意识到随时会有多少火车乘客抵达哈利法克斯，所以他留了足够长的时间，发了最后一封电报：“让火车停下来。军需品船着火了，正驶向6号码头...。再见了，孩子们。“。科尔曼在9点05分的爆炸中丧生，但他的最后一条信息拯救了数千人，不仅是火车上在进入破坏区域之前能够停车的乘客，还有已经在哈利法克斯的市民：电报信号到达了周围地区的每个操作员手中，因为科尔曼的\n医务人员以人类最快的速度处理了尽可能多的第一波、第二波、甚至第三波受伤患者，其中一些人甚至在火车上建立了临时治疗中心。贝鲁特也将逐渐涌现出英雄主义和精明的故事，以及对死亡人数的最终统计。但与此同时，在那些拍摄爆炸和应用物理学的人之间，我们可以防止任何阴谋论或误解的升级。爆炸不是军用级别的炸弹；它肯定不是核爆炸。可悲的是，历史再次重演：炸药可能具有毁灭性的杀伤力，我们永远不应低估它们的破坏性狂暴。\n🎙️收听“连线”，这是我们关于未来如何实现的新播客。收看最新剧集，订阅📩时事通讯，跟上我们所有节目的最新动态。\n💻使用我们Gear团队最喜欢的笔记本电脑、键盘、替代打字设备和降噪耳机升级您的工作游戏", "note_en": "On August 4, 2020, a massive explosion blasted deadly waves through  downtown Beirut. Then, video of the fireball rippled around the world almost as quickly. Now, details of the blast that started in a fireworks storage area by a small storage building at the end of a Beirut pier trickle in as the world waits to hear what the final death, injury, and destruction tallies will be. However, in a way, the world already has some idea what to expect, because similar blasts have occurred before.\n As a biomedical engineer with a doctorate in the patterns of injury and trauma that follow an explosion, scraping together information from accidental blasts is part of my daily work. The more mundane explosions are rarely this size, but the same principles of physics and chemistry apply. Science, along with a few case studies from history, let me do some preliminary calculations to puzzle out this explosion, too.\n In 1917, an accidental detonation of 6 million pounds of hodgepodge high explosives in the harbor of Halifax, Nova Scotia, left a  swath of wreckage that, at least until Tuesday, was the largest nonnuclear explosion ever created by humanity. As we learn more about Beirut, which could possibly challenge that record, the story of Halifax tells us what we might expect to learn about the ensuing trauma, and the modern cell phone videos, along with the blast physics gleaned by scientists in the intervening century, tell us why those patterns of trauma occurred in quite the way they did.\n  Every fire is a rearrangement of molecules, and an explosion is basically a fire turbocharged into a hyper-energy-fueled frenzy. Unstable structures barter and swap atoms with one another until all of them, happy with their trades, blissfully settle into more relaxed, lower-energy states, like rocks reaching the bottom of a hill. But their excess energy has to go somewhere. In a campfire, where the chemical reactions are facilitated in a leisurely way by the oxygen in the air alone, energy is released slowly as enjoyable levels of heat and light. In an explosion, however, the devilish little instigator that is oxygen shoves the process into overdrive.\n  Early reports of the blast revealed that the building that sparked the eruption may have been storing large quantities of ammonium nitrate, a flammable chemical that has relatively harmless manifestations as fertilizer but has also been experimented with as a rocket fuel. Oxygen is the key to ammonium nitrate’s  deadly habit of exploding, and given that  47 known, major, accidental ammonium nitrate explosions have occured in the last century, it is undeniably a habit. “Ammonium” is a nitrogen atom with four hydrogens, written NH 4 +, whereas the “nitrate” part of the mix is a nitrogen with three oxygens, NO 3 -. Under boring everyday conditions, the  + of the ammonium and the  – of the nitrate pull the two molecules into a harmless hug, but when you add a spark—or a firework—the molecules realize that their very atoms can get a little friskier and convert into something completely new.\n  When ammonium nitrate is manufactured as fertilizer, it is mixed with other chemicals that usually  stop this reaction from happening, though as the 2013 explosion at the West Fertilizer Company proved, those chemicals are  not always successful. The first reports out of Beirut suggested fertilizer may have once again been the culprit. However,  photos shared on social media showed bags marked “Nitroprill HD” supposedly being stored at the Beirut pier, and some have speculated that if those photos are accurate,  Nitroprill may be a knockoff of the name-brand blasting agent Nitropril. Nitropril is  designed for use in coal mines, so this particular breed of ammonium nitrate would not have been mixed with quieting chemicals like a fertilizer would be; rather, it would have been mixed to blow.\n  And nitrate, when mixed to blow, wants to ditch those little Os. It’s chemically unstable, meaning the bonds between the Ns and the Os vibrate with an unhappy level of physical tension. Overloaded with three oxygens, NO 3 - is eager to shove some onto any neighbor, and with a little bit of heat to get things moving, it will do so willingly. NH 4 + is all too happy to accept.\n  The chemical rearrangement of ammonium nitrate answers a lot of the public questions about the videos, including the source of the startling red color of the plume. One of the byproducts of NO 3 - as it sheds all that oxygen is nitrogen dioxide, which has a logically obvious chemical structure of NO 2 and looks  deep, blood red. Many explosive materials give off tints and hues during a blast that suggest their chemical composition—chemical additives to color both smoke and explosions have been around since  before the 1920s and are how we get different-colored fireworks and  signaling flares—and it’s nitrogen dioxide that gives an ammonium nitrate explosion its signature, ominous blood-like tone. A small blast can look subtle and orange-ish, but on a large scale like at Beirut, the sunlight helps deepen its hue.\n  According to Brad Wojtylak, a special agent bomb technician and certified explosive specialist with the Bureau of Alcohol, Tobacco, Firearms, and Explosives, when smoke plumes are large enough, they begin to catch the sunlight, and refraction will darken the normal colors produced by any explosion. Wojtylak is not directly involved in the Beirut investigation but has 16 years of experience investigating blast accidents. He says as sunlight bounces around within the cloud of contaminants, other, less determined wavelengths get refracted off in different directions. When a smoke plume happens on such a large scale, only the longest wavelengths, the red shades, persevere all the way through to the viewer on the other side. So, the natural reddish color becomes even deeper, richer, darker than it would be for a small blast.\n An explosive with a pure burn, like any explosive used in military-grade weaponry, will produce smoke that looks equally pure: snowy, billowy white, or sometimes a pale grey. But accidental explosions are far less tidy, and their sloppy combustion also produces ash, particulates, and gross black charred contaminated matter. This black gunk billows into the sky along with the other byproducts, coloring the smoke plume, like the charcoal residue left behind after the more efficient parts of the campfire wood have burned away. To a blast expert, the videos, with their roiling cloud of black and red curling over the pier of Beirut, scream “ammonium nitrate.”\n  The videos also show an unnervingly uniform hemisphere of white propagating outward from the blast site, a dome of vicious vapor that eventually hurtles toward every person filming and announces its arrival in the audio with a crash. This hemisphere is the pressure wave produced by the explosion.\n No, it’s not a shock wave. It’s a pressure wave, and that key difference affects the number of casualties expected. A shock wave goes from zero pressure to its absolute maximum pressure in literally zero seconds. The impact of a pressure wave is like hitting the ground after rolling down a steep cliff; the force of a shock wave is like hitting the ground after falling through the air and reaching terminal velocity. High explosives produce shock waves; low explosives, like ammonium nitrate, produce pressure waves, which have a bit of slope to their shape, a period of time over which the pressure increases more gradually.\n  Shocks, because of their fascinating and complex physics, travel faster than the speed of sound, and they cause far more damage than pressure waves. Thankfully, we know this blast did not produce a shock because the speed of the water-vapor-filled white dome can be measured.\n The speed of sound in air is 343 meters per second. Based on the viewing angle and distinctive red chairs pictured in some of the later frames,  I traced one of the Beirut videos posted by  The Guardian to its filming location on the rooftop terrace of  La Mezcaleria Rooftop Bar, and measured it to be 885 meters from the center of the blast. From that vantage, the pressure wave can be seen neatly traveling from the center of the blast first to the point halfway between the end of the pier and the edge of the long, massive gray grain silo building, a distance of 151 meters, then to the end of the pier, 262 meters, then eventually to La Mezcaleria.\n By measuring the times at which the pressure wave reaches these landmarks on the video, we know that, as it blazed down the pier, its rampage occurred at a speed of only 312 meters per second. That’s slow for a bomb. Then by the time the audible crash and mayhem reached the formerly peaceful and picturesque outdoor bar, it had slowed to at most 289 meters per second. The pressure wave, slower than the 343 meters per second speed of sound, caused destruction, horror, confusion, shattered glass, torn-apart flat surfaces, and disorientation for onlookers as their ears were subjected to the rapid pressure fluctuations. But a shock wave could have caused them to  drop dead from lung trauma as they watched.\n In the  6 million-pound Halifax explosion of 1917, the propagation of the shock wave through downtown left a swath of fatalities reaching 1.5 miles from the center of the blast, killing an estimated 1,950 and leaving another 8,000 with devastating injuries. (The ships that exploded in the harbor were known to be carrying high explosives, which by their nature always make shock waves.) In Beirut, thankfully, while building damage has been reported up to  5.6 miles away, because the low-explosive ammonium nitrate made a pressure wave rather than a shock wave, the fatality estimates so far are still in the hundreds, even though the charge size was likely larger than the bomb in Halifax.\n  Thanks to modern technology that  charge size can be calculated scientifically too, even while waiting for more complete information to trickle out, using the size of the telltale crater. Analysis of the aerial photographs of the pier shows a crater in the range of 120 to  140 meters in diameter; blast physics mixed with history tell us that to carve a chunk that size from the side of the planet requires a charge equivalent to 1.7 to 5.4 million kilograms of TNT (that’s 3.8 to 11.8 million pounds for any Americans dragging their feet on converting to metric). For reference, the bombing of the Murrah Building in Oklahoma City in 1995 used the  equivalent of 1.8  thousand kilograms of TNT. So, Beirut was at minimum a thousand times more  boom than Oklahoma City.\n As an aside, nuclear weaponry is set to detonate several hundred feet above ground level, and therefore doesn’t exert enough force directly on the soil to create a crater. The detonation of the first atomic weaponry above Hiroshima occurred almost exactly 75 years ago to the day, and despite its historically unprecedented trauma to the city and populace,  it left behind no crater.\n Sign up for our  Longreads newsletter for the best features, ideas, and investigations from WIRED.\n Germany, too, knows the destructive power of improperly stored ammonium nitrate, and an accident in that country reinforces the calculation of the charge size. In 1921, a fertilizer explosion in Oppau, Germany, carved a remarkably similar crater. At 120 meters in diameter, following the explosion of  4.1 million kilos of ammonium nitrate, the size of the Oppau crater supports the idea that the Beirut pier, which early reports said held only  2,750 metric tons—2.75 million kilograms—may have held some number of millions more kilograms of charge. However even using only those 2,750 metric tons, Special Agent Wojtylak says his preliminary calculations indicate that those safe from all risk of carnage would have needed to be at least 15 kilometers from the Beirut pier.\n  Within that radius, the injuries from such a massive blast in a downtown location can be as varied as the victims who experience them, but a number of them are likely from glass and other flying projectiles. Flat, delicate, frangible, and installed in large sheets, glass is the perfect target for a blast wave of even minuscule magnitude; it shatters and flies easier than any other substance.\n In Halifax, the fire that eventually triggered the main explosion meant that citizens were already positioned at their windows to watch the excitement when the bomb detonated. As a result, of those wounded on that morning in 1917, injuries of shattered glass penetrating the eyes of onlookers were described as “ extraordinarily prevalent.” The accident of the fireworks storage area and its alarming plume of smoke similarly guaranteed plenty of onlookers for Beirut. Without smoke drawing these witnesses, we would not have such ample cell phone footage, but there also might have been fewer injuries.\n  The Halifax explosion resulted in the same series of events that, according to Duke University Hospital emergency room physician Dan Buckland, still occurs in emergency rooms today after mass casualty incidents. Buckland treated casualties following a natural gas explosion in Durham, North Carolina, in 2019 which, while substantially smaller in size, occurred in a densely populated downtown area. The first wave of patients are those who were physically near emergency services, he says, those unlucky enough to get hurt but lucky enough to do it in close proximity to an ambulance. After that, the hospitals get flooded by “ walking wounded,” those who are wounded enough to seek medical care but intact enough to transport themselves. The key to increasing the number of survivors, Buckland says, is getting the third wave of patients through the door, through the crowds of this second wave. The third wave is made up of those at the core of the site, too injured to walk, whom the emergency responders combing the wreckage medically prioritize next.\n After a blast in a civilian area, emergency responders aren’t the only heroes. Just after 9 am on December 6, 1917, in Halifax, mustachioed 45-year-old train dispatcher  Vincent Coleman knew the lazy plume of smoke coming from the explosive-laden vessel in Halifax harbor was a terrifying portent of worse to come. But as the other dispatchers ran for their lives, Coleman realized the number of train passengers set to arrive at Halifax any moment, and so he stayed long enough to send one final telegram: “Hold up the train. Munitions ship on fire and making for Pier 6 ... Goodbye boys.” Coleman died in the blast at 9:05, but his final message saved thousands, not just the passengers on the trains that were able to stop before entering the zone of destruction, but also the citizens already in Halifax: The telegram signal reached every operator in the surrounding region, and because of Coleman’s quick thinking, every doctor who felt the earth rumble, up to 160 km away, had almost immediate access to news about what had happened. They  rushed in to help.\n Medical personnel dealt with as many of the first, second, and even third waves of injured patients as fast as humanly possible, some of them even creating makeshift treatment centers on trains. From Beirut too, will gradually emerge stories of heroism and savvy, along with the final accounting of lives lost. But in the meantime, between those who filmed the blast and the application of physics, we can prevent any escalation of conspiracy theories or misunderstandings. The explosion wasn’t a military-grade bomb; it most certainly wasn’t a nuclear one. It was, sadly, tragically, history repeating itself yet again: Explosives can be devastatingly lethal, and we should never underestimate their destructive fury.\n   🎙️ Listen to  Get WIRED, our new podcast about how the future is realized. Catch the  latest episodes and subscribe to the 📩  newsletter to keep up with all our shows\n 💻 Upgrade your work game with our Gear team’s  favorite laptops,  keyboards,  typing alternatives, and  noise-canceling headphones", "posttime": "2020-08-11 07:32:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "致命,physics,爆炸", "title": "贝鲁特致命爆炸的悲剧物理学", "title_en": "The Tragic Physics of the Deadly Explosion in Beirut", "transed": 1, "url": "https://www.wired.com/story/tragic-physics-deadly-explosion-beirut/", "via": "", "real_tags": ["致命", "physics", "爆炸"]}, {"category": "", "categoryclass": "", "imagename": "72dcefc9b30d510ed8ca2113dcf13cb0.jpeg", "infoid": 1017448, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "再见，Twitch Prime。今天，亚马逊正在重新命名这套专注于视频游戏的福利，以符合其其他数字服务的命名惯例，如Prime Video和Prime read。新命名的Prime Gaming的工作方式与以前一样。它与亚马逊Prime捆绑在一起，亚马逊Prime是该公司的全方位订阅服务，包括更快的“高级”送货速度，并提供了一系列旨在吸引游戏玩家的数字商品。其中包括Twitch上的免费频道订阅(如果你没有Prime，这些费用通常至少为每月5美元)，少量的游戏和流行游戏的项目，如Apex Legends。\n亚马逊尚未说明为什么要将Twitch Prime更名。我们再次猜测，一些Prime客户仍然不知道Twitch Prime的存在，也不知道Twitch Prime是随他们的会员一起来的。也可能有一些用户玩游戏，但不要使用Twitch，错误地认为这些福利与他们无关。亚马逊在一份新闻稿中表示，Prime Gaming为更多游戏带来了比以往任何时候都多的新内容，这指的是向订户提供的各种SNK游戏，以及亚马逊与Riot Games和Roblox Corporation等重量级发行商达成的协议。\n不过，目前还不清楚亚马逊是否有计划改变捆绑包中包含的福利和免费赠品的一般组合。有传言称，该公司正在开发一项类似Stadia、Nvidia的GeForce Now和XCloud的流媒体服务，这些服务很快就会与Xbox Game Pass旗舰套餐捆绑在一起。亚马逊也是一家游戏发行商，尽管它的大部分努力，包括大巡回赛游戏和坩埚，都没有成功。不过，不难想象，亚马逊拥有的订阅服务将Twitch福利、体育场风格的流媒体服务和各种游戏内物品结合在一起，用于其自有软件(该公司计划明年推出一款名为“新世界”的MMORPG)和第三方发行商发布的MMORPG。", "note_en": "So long,  Twitch Prime. Today, Amazon is rebranding the suite of video game-focused perks to match the naming convention of its other digital services, such as Prime Video and Prime Reading. The newly-named  Prime Gaming works the same way as before. It&#39;s bundled with Amazon Prime -- the company’s all-encompassing subscription service that includes faster ‘premium’ deliveries -- and offers a bunch of digital goodies that are designed to entice gamers. These include a free channel subscription on Twitch (if you don’t have Prime, these normally cost at least $5 per month), a smattering of games and items for popular titles such as  Apex Legends.\n Amazon hasn&#39;t said why it&#39;s rebranding Twitch Prime. We&#39;re guessing some Prime customers still aren&#39;t aware that Twitch Prime exists or comes with their membership. There might be some users, too, who play games but don&#39;t use Twitch and wrongly assume that the perks aren&#39;t relevant to them. In a press release, Amazon said that Prime Gaming &#34;brings more new content for more games than ever before,&#34; pointing to  the various SNK titles that have been offered to subscribers and the agreements it&#39;s secured with heavyweight publishers such as Riot Games and Roblox Corporation.\n  It&#39;s unclear, though, if Amazon has any plans to change the general mix of perks and freebies that are included in the bundle. The company is rumored to be working on  a streaming service similar to Stadia, Nvidia&#39;s Geforce Now and xCloud, which will soon be bundled with Xbox Game Pass Ultimate subscriptions. Amazon is a game publisher, too, though most of its efforts, including   The Grand Tour Game and   Crucible, have  failed to take off. Still, it&#39;s not hard to imagine an Amazon-owned subscription that combines Twitch perks, Stadia-style streaming, and various in-game items for its own software (the company is planning to launch  an MMORPG called  New World next year) and those released by third-party publishers.", "posttime": "2020-08-11 07:31:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "prime", "title": "Twitch Prime现在称为Prime Gaming", "title_en": "Twitch Prime is now called Prime Gaming", "transed": 1, "url": "https://www.engadget.com/amazon-twitch-prime-gaming-rebrand-170037480.html", "via": "", "real_tags": ["prime"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自史密森学会美国国家历史博物馆档案中心的西联汇款藏品(方框44)本网站的访问者肯定地确认该结构是一个无源微波中继器，是瑟蒙特和马里兰州弗雷德里克之间贝尔大西洋6 GHz无线电链路的一部分。由于所涉及的费用，链路已停用，但中继器未被移除。\n无源转发器的网页已移至我的贝尔系统网站，网址为http://long-lines.net/places-routes/Thurmont_repeater/index.html。\n该部队总部设在马里兰州斯普林斯坎普的安德鲁斯空军基地，提供对国家安全至关重要的通信。\n波音789运营着神秘之星或特殊空中任务通信(SAMCOM)无线电网络，这使总统和其他高级官员在空中保持联系。\n此外，789还管理着全球无线电网络。在核战争中，GLOBAL将从国家指挥局向美国核部队传递紧急行动信息。在和平时期，全球范围内承载着种类繁多的国防通信。\n也被称为Site R and the Rock，这个鲜为人知的地下设施是候补国家军事指挥中心的所在地。\n这些来自肯尼迪和约翰逊政府的文件，30多年来一直是高度机密的，讨论了在五角大楼附近地下3500英尺(1067米)处建立防核弹指挥所的提议。\n提起西联汇款这个名字，很可能大多数人都会想到电报和转账。不太为人所知的是西联电报公司在冷战期间为国家安全提供通信所起的作用。作为数据传输和微波无线电通信的先驱，西联汇款建造和运营了承载重要国防交通的网络。\n西联汇款的前雇员可能希望加入西联汇款退休员工协会。\n西部联合校友网站提供关于该公司、其技术和服务的历史信息。邀请前雇员注册，并分享他们的知识和回忆。\n西联电报公司的档案可以在华盛顿特区的美国国家历史博物馆档案中心进行研究。该中心的档案管理员已经为这些藏品创建了描述和查找辅助工具。\n西部联盟在首都地区至少支持两个国防通信网络：华盛顿地区宽带系统(WAWS)和自动数字网(AUTODIN)。顾名思义，WAWS仅限于华盛顿特区地区；它连接了各种国防和情报社区设施。AUTODIN的范围要广泛得多，为世界各地的军事设施提供记录通信服务。\n西部联合公司的微波网络由一系列站点组成，这些站点遍及全国大部分地区的东部和西部，有几个分支机构向北和向南。\n华盛顿-匹兹堡-纽约市微波线路地图(1957年10月22日)这是美国第一个商用微波网络，于1947年投入使用。来自西联汇款藏品(方框82)，美国国家历史博物馆档案中心，史密森学会。\n广播电台列表，截至1959年2月9日，来自西联汇款收藏(方框82)，档案中心，美国国家历史博物馆，史密森学会。\n电报服务的微波系统&1954年7月出版的“西部联盟技术评论”上的一篇文章。\n西联汇款第一个微波电报系统的改进-1957年4月号“西联汇款技术评论”的一篇文章。\n西联大学进入语音场--1962年1月号“西部联盟电讯报”的一篇文章。\n西弗吉尼亚州罗姆尼附近的前吴接线局，西弗吉尼亚的东网控制站和一个AUTODIN交换中心。\n位于加利福尼亚州奥库姆山的前吴联络处西侧网络控制站和一个AUTODIN交换中心。\n原吴氏微波塔靠近白兰地文，原吴氏无线电三角网上的DE A中继站。\n西联汇款微波中继站的照片，大约在1955年；可能在堪萨斯城附近，显示了典型的横贯大陆的无线电波束网络的双塔，潜望镜馈电配置。", "note_en": "From the Western Union collection (box 44), Archives Center, National Museum of American History, Smithsonian Institution            A visitor to this web site has positively identified the structure as a passive microwave repeater, part of a Bell Atlantic 6 GHz radio link between Thurmont and Frederick, MD. The link has been decommissioned but the repeater was not removed, due to the expense involved.\n  The web page for the passive repeater has been moved to my Bell System web site; the URL is  http://long-lines.net/places-routes/Thurmont_repeater/index.html .\n    Headquartered at Andrews Air Force Base in Camp Springs, Maryland, this unit provides communications vital to national security.\n  The 789th operates the   &#34;Mystic Star&#34; or Special Air Missions Communications (SAMCOM) radio network, which keeps the President and other senior officials in contact while airborne.\n  In addition, the 789th manages the  GLOBAL radio network. In a nuclear war, GLOBAL would transmit Emergency Action Messages from the National Command Authority to the U.S. nuclear forces. In peacetime, GLOBAL carries a wide variety of defense communications.\n                                    Also known as Site R and The Rock, this little-known underground facility is home to the Alternate National Military Command Center.\n        These documents from the Kennedy and Johnson administrations, highly classified for more than 30 years, discuss a proposal for a nuclear-bomb-proof command post 3,500 feet (1,067 meters) underground, in the vicinity of the Pentagon.\n      Mention the name &#34;Western Union&#34; and it&#39;s likely that most people will think of telegrams and money transfers.\r\r Less well known is the role played by The Western Union Telegraph Company in providing communications for national security during the Cold War.\r As a pioneer in data transmission and microwave radio communications, Western Union built and operated networks which carried important defense traffic.\n  Former employees of Western Union may wish to join  The Retired Western Union Employees Association.\n  The   Western Union Alumni web site offers historical information about the company,\rits technology and its services. Former employees are invited to register, and to share their knowledge and recollections.\n  The archives of the Western Union Telegraph Company are available for research at the Archives Center of the National Museum of American History in Washington, DC.\rThe Center&#39;s archivists have created a  description and finding aids for the collection.\n  Western Union supported at least two defense communications networks in the nation&#39;s capital area:\rthe  Washington Area Wideband System (WAWS), and the Automatic Digital Network (AUTODIN).\rAs its name implies, WAWS was limited to the Washington DC area; it linked various defense and intelligence-community facilities.\rAUTODIN was far more extensive, providing record communications service to military installations around the world.\n   The Western Union microwave network consisted of a chain of stations which reaching east and west across much of the country, with several branches going north and south.\n  Map of the Washington-Pittsburgh-New York City microwave routes (Oct. 22, 1957)   This &#34;radio triangle&#34; was America&#39;s first commercial microwave network, placed in service in 1947.   From the Western Union collection (box 82), Archives Center, National Museum of American History, Smithsonian Institution\n  List of radio stations, as of Feb. 9, 1959   From the Western Union collection (box 82), Archives Center, National Museum of American History, Smithsonian Institution\n            &#34;A Microwave System for Telegraph Service&#34; - an article from the July 1954 issue of the Western Union Technical Review.\n  &#34;Improvements in Western Union&#39;s First Microwave Telegraph System&#34; - an article from the April 1957 issue of the Western Union Technical Review.\n  &#34;W.U. Enters Voice Field&#34; - an article from the January 1962 issue of the Western Union Telegraph News.\n  Former WU Junction Office near Romney, WV   WU&#39;s eastern network control station and an AUTODIN switching center\n  Former WU Junction Office at Mount Aukum, CA   WU&#39;s western network control station and an AUTODIN switching center\n    Former WU microwave tower near Brandywine, DE   A relay station on the original WU &#34;radio triangle&#34; network\n        Photo of a Western Union microwave repeater site, ca. 1955; probably near Kansas City   Showing the double-tower, periscope-feed configuration typical of the transcontinental &#34;radio beam&#34; network.", "posttime": "2020-08-11 07:31:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,景观,landscape,微波", "title": "秘密景观：美国冷战时期的基础设施", "title_en": "Secret Landscape: America's cold war infrastructure", "transed": 1, "url": "http://coldwar-c4i.net/index.html", "via": "", "real_tags": ["美国", "景观", "landscape", "微波"]}, {"category": "", "categoryclass": "", "imagename": "798b90d2bde15c6cec1d527cb469d228.jpg", "infoid": 1017446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纯粹从经济角度来看，美国应该在屋顶上安装更多的太阳能电池板。随着太阳能电池板价格的戏剧性暴跌，在越来越多的州，太阳能系统已经变得与电价竞争，这使得阳光暴露的问题成为采用是否有意义的主要驱动力。然而，尽管许多州都在推动采用可再生能源，但配备光伏的房屋在美国仍然很少见。\n那么，为什么这一努力没有奏效呢？为了找出答案，一小群研究人员与一家促进太阳能安装的非营利性组织合作，帮助测试出两种不同的信息。其中一条信息侧重于自身利益，并强调了安装太阳能电池板的经济效益。另一种是所谓的亲社会，意思是强调安装太阳能将给社区带来好处。正如研究人员发现的那样，利己主义是王道--即使在促销活动结束之后也是如此。但自利确实有一个附带的好处，那就是安装的系统往往能最大限度地利用面板的能量。\n这项工作依赖于一个名为Solarize的计划。Solarize运行镇级程序，其中包括为整个城镇提供团体费率的单个安装程序。项目大使还在镇上开展支持太阳能的项目，鼓励采用太阳能。这些项目是研究人员的目标，他们根据这些大使传递的信息安排了一项实验。一些城镇收到了关注自身利益的信息，比如“通过安装太阳能来拯救数千人。”其他人则更关注社区-例如，“我们的社区正在共同做一些事情，拥有更多的清洁能源”。研究人员在康涅狄格州(其中一名研究人员在耶鲁大学)进行了该项目的研究，那里的电力价格很高。\n之前对Solarize参与者的调查表明，这两个信息都可能引起共鸣。在人们参加该项目的前三个原因中，有两个涉及经济(低廉的定价和节省水电费)，另一个是对环境的担忧。\n为了把这变成一项实验，研究人员确定了人口统计上大致匹配的三个城镇的集合。然后，这些城镇被分割开来，其中一个城镇收到了利己主义的信息，另一个城镇收到了亲社会的信息，而另一个城镇则没有参加太阳化计划。由于一些财务故障，计划中的一个项目没有发生，只剩下29个城镇，总共不到70万人参与了试验。关于现有趋势和家庭的数据是通过使用康涅狄格州所有州太阳能安装的数据以及美国人口普查局的数据获得的。参与者还接受了后续调查。\n总体而言，太阳化计划是有效的，推动的安装比控制社区发生的更多，也高于参与的城镇之前的趋势。而且，在竞选期间，自利信息导致的总安装量比收到亲社会信息的城镇的安装总量要高。虽然收到亲社会信息的城镇的安装率确实高于对照城镇，但差异在统计上并不显著。\n此外，利己主义的消息传递带来了更高效的安装。使用谷歌的太阳能计算器，作者估计，响应这些信息而安装的电池板平均每天接收更多的阳光，在典型系统的生命周期内额外产生4.4兆瓦时。这与收到这条利己主义信息的人报告说安装太阳能的首要原因是钱的事实是一致的。此外，他们更有可能预先支付系统费用，而不是贷款，这提高了购买的回报率。\n不足为奇的是，这类信息在高收入社区也效果更好。有一些迹象表明，亲社会信息在低收入社区效果更好，但结果在统计学上并不显著。对于那些收到亲社会信息的人来说，有一件事是一贯正确的，那就是他们报告说，他们对自己的安装更满意，也更有可能向朋友和邻居推荐太阳能。\n总体而言，研究人员认为，不存在任何可能会诱使人们安装太阳能的万能信息。对于那些有能力支付安装费用的人来说，诉诸经济利益似乎是可行的。与此同时，以社区为重点的信息可能会吸引一些消费者，他们的财务状况可能不是最强劲的，但主要是出于对环境的担忧-他们愿意在生产率较低的地区安装太阳能电池板。\n获得正确信息的价值并不局限于活动本身。研究人员还获得了活动结束后的数据，他们发现自利信息的影响在之后持续了近两年。研究人员认为，与其说是因为接触了这项活动，不如说是接触到了太阳能电池板本身--现在他们的邻居房子里有更多的太阳能电池板--这推动了人们对这项技术的进一步兴趣。这让我们清楚地认识到，如果我们要继续发展可再生能源，正确传达信息是非常重要的。", "note_en": "Based purely on economics, there should be a lot more solar panels on roofs in the United States. With the dramatic plunge in the price of panels, solar systems have become competitive with the cost of electricity in a growing number of states, leaving the question of sun exposure to be the primary driver of whether adoption makes sense. Yet photovoltaic-equipped houses remain a rarity in the US, despite many states pushing for the adoption of renewable energy.\n So why isn&#39;t that push working? To try to find out, a small team of researchers worked with a non-profit that promotes solar installs, helping test out two different message. One message focused on self-interest and emphasized the economic benefits of installing panels. The other was what&#39;s termed &#34;pro-social,&#34; meaning it emphasized that installation of solar would bring benefits to the community. As the researchers found, self-interest was king—even after the promotion was over. But self-interest did have a side benefit in that the systems that were installed tended to get the most energy out of their panels.\n  The work relies on a program called Solarize. Solarize runs town-level programs that include a single installer that provides the entire town with a group rate. Program ambassadors also run pro-solar programs within the town, encouraging adoption. These programs were the ones targeted by the researchers, who arranged an experiment based on the message delivered by these ambassadors. Some towns received messages that focused on self-interest, like “save thousands by installing solar.” Others were more community-focused—“Our community is doing something together to have more clean energy,” for example. The researchers worked with the program in Connecticut (one of the researchers is at Yale), which has expensive electricity.\n Previous surveys of Solarize participants suggest that either message could resonate. Of the top three reasons people were in the program, two involve economics (cheap pricing and saving on utility bills), and the other was concern for the environment.\n To turn this into an experiment, the researchers identified sets of three towns that were roughly matched demographically. Those towns were then split up so that one received a self-interested message, another received the pro-social message, and one didn&#39;t participate in the Solarize program. Due to some financial glitches, one of the planned programs didn&#39;t occur, leaving the experiment done with 29 towns and a total of just under 700,000 people participating. Data on existing trends and households were obtained by using Connecticut data on all state solar installs, as well as US Census Bureau data. Participants also received follow-up surveys.\n Overall, the Solarize program was effective, driving more installations than occurred in the control communities, as well as higher than the prior trends in the towns that participated. And, during the campaign, the self-interest messaging resulted in higher total installs than occurred in the towns that received pro-social messaging. While towns that received pro-social messaging did see a higher rate of install than control towns, the difference wasn&#39;t statistically significant.\n  In addition, the self-interest messaging resulted in more productive installs. Using Google&#39;s solar calculator, the authors estimate that the panels installed in response to these messages receive more sunlight on an average day, producing an extra 4.4 megawatt-hours over the lifetime of a typical system. That&#39;s consistent with the fact that the people who had received the self-interested messaging reported money as their foremost reason for installing solar. In addition, they were more likely to pay for their systems upfront, rather than taking loans, which increased the rate of return for the purchase.\n Not surprisingly, this sort of message also worked better in high-income communities. There&#39;s some hints that pro-social messaging worked better in low-income communities, but the results weren&#39;t statistically significant. The one thing that was consistently true for those who received the pro-social message is that they reported they were more satisfied with their installs and more likely to recommend solar to their friends and neighbors.\n Overall, the researchers suggest that there&#39;s no one-size-fits-all message that is likely to induce people to install solar power. For those with the means to pay for installations upfront, appealing to financial interest appears to be the way to go. Meanwhile, the community-focused messaging may draw in consumers who may not be in the strongest financial position but are primarily motivated by environmental concerns—and are willing to install panels in less productive locations.\n The value of getting the message right isn&#39;t restricted to the campaign itself. The researchers also had data from after the campaign had wrapped up, and they found the impact of the self-interest messaging persisted for nearly two years afterwards. Rather than being a result of exposure to the campaign, the researchers suggest it&#39;s exposure to the panels themselves—now present on more of their neighbors&#39; houses—that drives further interest in the technology. Which drives home the importance of getting the message right if we&#39;re going to continue to expand renewable energy.", "posttime": "2020-08-11 07:06:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太阳能,good,信息", "title": "当涉及到太阳能发电时，贪婪可能是好事", "title_en": "Greed may be good when it comes to solar power", "transed": 1, "url": "https://arstechnica.com/science/2020/08/greed-may-be-good-when-it-comes-to-solar-power/", "via": "", "real_tags": ["太阳能", "good", "信息"]}, {"category": "", "categoryclass": "", "imagename": "dfd85c669445bdfafb4232001a0f14a8.jpg", "infoid": 1017445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据旧金山一名法官周一发布的初步禁令，优步和Lyft必须将其加州司机重新归类为员工。\n重要原因：叫车公司和其他零工经济公司一样，反对将司机归类为员工，劳工权益倡导者表示，这会给工人带来更大的福利和权利。加州的一项新法律制定了更严格的要求，公司才能将工人归类为承包商。\n这些公司还支持加州的一项投票措施，该措施将保留司机作为承包商，并为他们提供一些福利。\n这项新的裁决是应加利福尼亚州总检察长的要求做出的，给了两家公司10天的时间在裁决生效前提出上诉。他们希望利用这一上诉获得更长时间的裁决缓期。\n法院的裁决至少暂缓10天，我们计划代表加州的司机立即提出紧急上诉。绝大多数司机希望独立工作，我们已经对我们的应用程序进行了重大修改，以确保加州法律规定的情况仍然如此。当300多万加州人没有工作时，我们选出的领导人应该专注于创造就业机会，而不是试图在经济萧条期间关闭整个行业。\n-优步发言人司机不想成为员工，句号。我们将立即对这一裁决提出上诉，并继续为他们的独立而战。最终，我们相信这个问题将由加州选民决定，他们会站在司机一边。\n-Lyft发言人", "note_en": "Uber and Lyft must reclassify their California drivers as employees under a preliminary injunction granted Monday by a San Francisco judge.\n Why it matters: The ride-hailing companies, along with other gig economy firms, are resisting classifying their drivers as employees, which labor advocates say would give the workers greater benefits and rights.  A new California law codified stricter requirements before companies can classify workers as contractors.\n The companies are also behind a California ballot measure that would keep drivers as contractors and provide them with some benefits.\n The new ruling, which comes in response to a  request from California&#39;s attorney general, gives the companies 10 days to appeal the decision before it goes into effect. They hope to use that appeal to get a longer stay on the ruling.\n  &#34;The court’s ruling is stayed for a minimum of 10 days, and we plan to file an immediate emergency appeal on behalf of California drivers. The vast majority of drivers want to work independently, and we’ve already made  significant changes to our app to ensure that remains the case under California law. When over 3 million Californians are without a job, our elected leaders should be focused on creating work, not trying to shut down an entire industry during an economic depression.&#34;\n — Uber spokesperson  &#34;Drivers do not want to be employees, full stop. We’ll immediately appeal this ruling and continue to fight for their independence. Ultimately, we believe this issue will be decided by California voters and that they will side with drivers.&#34;\n — Lyft spokesperson", "posttime": "2020-08-11 07:05:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法官,judge,加州", "title": "加州法官命令优步，Lyft将司机重新分类为员工", "title_en": "California judge orders Uber, Lyft to reclassify drivers as employees", "transed": 1, "url": "https://www.axios.com/california-judge-orders-uber-lyft-to-reclassify-drivers-as-employees-985ac492-6015-4324-827b-6d27945fe4b5.html", "via": "", "real_tags": ["法官", "judge", "加州"]}, {"category": "", "categoryclass": "", "imagename": "49e649c4790879a93a5163d54b1b941d.jpg", "infoid": 1017444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日本版画的杰作教会了我们图像的流通方式。", "note_en": "What a masterpiece of Japanese printmaking teaches us about the way images circulate.", "posttime": "2020-08-11 07:04:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "世界,change,版画", "title": "一幅不断运动的世界的变化图景", "title_en": "A Picture of Change for a World in Constant Motion", "transed": 1, "url": "https://www.nytimes.com/interactive/2020/08/07/arts/design/hokusai-fuji.html", "via": "", "real_tags": ["世界", "change", "版画"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在加利福尼亚州的中央山谷，数十万工人清洗蔬菜，去肉，分类坚果，并将进入美国各地厨房的农产品打包。\n当冠状病毒来袭时，他们的工作被认定是必要的，因此他们继续在经常狭窄的设施中工作，这些设施为每年出口210亿美元农产品的国有工业提供燃料。\n工人们告诉“卫报”，在过去的几个月里，由于加州大部分地区都躲在家里，他们违反了所有的社会距离指导方针，在生产线和分拣台上占据了自己的位置，因为他们的公司为为什么同事不再轮班找借口。一些工人表示，他们不得不从新闻报道中了解到他们接触了新冠肺炎。其他人说，即使出现病毒症状，他们也觉得有义务工作。\n然后，他们回到了位于该地区各城市的家中，在不知不觉中将父母、配偶、子女、姑姑、叔叔和堂兄弟姐妹暴露在病毒之下。\n“我们觉得他们会告诉我们。他们会采取预防措施。但他们没有，“玛丽埃洛斯·西斯内罗斯(Marielos Cisneros)在疫情开始时说，她的前雇主是坚果生产商PrimeX Farm。“从某种意义上说，我们感到安全。”\n现在病毒正在中央山谷激增，据报道，几名必要的工作人员死亡。在10个县，州当局将工作场所和企业列为可能增加传播的驱动因素。在至少另外两个县，几个食品加工设施的疫情已导致数百人感染。\n工人和工人权利组织表示，这些疫情以及随后在中央山谷爆发的感染表明了一个毁灭性的事实：我们每个人受到的保护只与我们最不受保护的人一样；我们每个人都像我们最脆弱的人一样脆弱。\n加州大学默塞德分校(University of California，Merced)社会学教授爱德华·弗洛雷斯(Edward Flores)说，“你可以看起来控制住病毒在中产阶级工人中的传播，但当病毒到达边缘最远、处境最不利的工人手中时，病毒就会传播。”\n中央山谷沿着加州中心延伸450英里，大部分是平坦的田野，郁郁葱葱的果树和充满活力的果园。该地区拥有该州最大的奶牛场集中度，以及一些肉类加工中心，以及形成农业霸主地位的农场。根据加州大学默塞德分校(UC Merced)的社区和劳工中心(Community And Labor Center)的数据，仅在圣华金山谷-该地区南部大部分地区-就有超过17.3万人从事农业工作，其中4.5万人在食品制造业，60600人在食品零售业，8.6万人在运输和仓储业。\n在圣华金河谷的8个县，面积2.7万平方英里，有430万居民，每10万居民中就有1900例冠状病毒病例。相比之下，旧金山湾区有770万居民，面积为7000平方英里，每10万居民中就有770例病例。\n从大流行开始，倡导团体就表达了对基本食品工作者安全的担忧。这些工作中的大部分都不允许社交距离，工人们在田野里挤在一起，在工厂里挤在一起。许多从事维持这些行业生存的低薪劳动力的人都是拉丁裔，不会说英语，这使得他们很难与雇主沟通，也很难理解他们的权利。一些人是无证的，由于担心被驱逐出境，他们不能站出来表达任何不满。\n不过，加州大学默塞德分校(UC Merced)社区和劳工中心(Community And Labor Center)的执行董事安娜·帕迪利亚(Ana Padilla)表示，在过去五年里，联邦和州职业安全与健康部门收到的来自中央山谷的投诉更多，在该地区检查的事故比该州其他任何地方都多。帕迪拉说，圣华金河谷拥有该州13%的肉类加工中心，但接受了该州49%的检查。\n30岁的罗克珊娜·阿尔瓦拉多(Roxana Alvarado)直到几周前还在瓦斯科的PrimeX农场工作。根据工人和美国农场工人联合会(UFW)的说法，当她在6月份检测出病毒呈阳性时，她的数十名同事已经被感染。\n据该公司称，至少有151名普锐斯工人的新冠肺炎检测呈阳性，占工厂员工总数的三分之一以上。UFW正在对受感染的工人进行普查，该公司表示，第一名确认的受感染工人最后一次工作是在5月20日。该公司指责他是将病毒从国外带入工厂并被解雇的罪魁祸首。\n工作人员说，当大流行刚开始时，管理层召开了一次会议，警告他们不要旅行，否则会让自己面临更高的感染风险，但几乎没有透露其他信息。在疫情爆发之前，他们没有提供任何检测，并告诉工作人员，如果他们愿意，可以从家里带口罩，但这不是强制性的。他们几乎没有努力去创造社会距离。阿尔瓦拉多说：“在典型的一天，8小时的轮班时间里，我可以与100人或更多人接触，在人们之间走动，在地板上走动，与不戴面具的人聊天。”\n阿尔瓦拉多在PrimeX工作了近两年，清理设施和产品。阿尔瓦拉多说，当人们不再轮班时，管理层会说他们是在度假。6月23日，该公司承认有31例确诊病例-尽管UFW表示，同期的真实感染人数接近76人。\n到那时，阿尔瓦拉多已经把病毒带回了贝克尔斯菲尔德，她和丈夫以及两个孩子住在那里。她5个月大的婴儿检测呈阳性。\n阿尔瓦拉多说：“当他们没有告诉我们发生了什么时，他们剥夺了我选择是否将我和我的家人暴露给Covid的权利。”“如果我知道有Covid，我就会做出不去上班的艰难决定，因为我永远不会把家人置于危险之中。”\n40岁的玛丽埃洛斯·西斯内罗斯(Marielos Cisneros)在PrimeX担任分拣员和生产员近三年后，于6月10日发烧去了医院。她确保人力资源部知道。“当我告诉他们我是阳性时，人力资源部的女士告诉我不要告诉任何人，”她说。“她让我说我头疼，除了柯维，我什么都没有。”PrimeX否认了这一指控。\n西斯内罗斯说，她的四个孩子都感染了冠状病毒，其中包括一个患有哮喘的儿子。作为一名依赖一张薪水的单身母亲，她说她无论如何都会去工作，但如果她知道病毒在设施中有多么流行，她会采取更多的预防措施。\n加州大学默塞德分校的研究人员弗洛雷斯和帕迪拉撰写了一项研究，旨在探讨低薪工作与新冠肺炎的传播之间的联系。他们发现，加州大多数工人高度痛苦的县都在该州的冠状病毒观察名单上，包括中央山谷的大部分地区。\nPadilla说，该地区及其劳动力的劣势不仅使他们面临更高的风险，不仅是因为暴露在病毒中，而且还因为不卫生和不安全的工作条件，几乎没有为自己辩护的自由。研究人员称，该地区超过21%的工人生活在贫困线以下，17.9%的工人依赖食品券生活。该地区的移民入籍比率是该州最低的。大多数工人没有资格享受联邦保障的紧急休假，如果他们没有证件，就没有资格申请失业。从这些微不足道的情况下，他们继续生活在该州最大的家庭中。\n“一位女士告诉我，她感染了病毒，回家了，不幸的是，她一家16口人都在那里，”UFW的秘书财务主管阿曼多·埃伦斯(Armando Elenes)说。“我说的是她的丈夫，她的儿子，她儿子的妻子，他们的孩子。从她到其他16个人。“。\nElenes说，到目前为止，PrimeX工厂工人的49名成年家庭成员和34名儿童的检测呈阳性。\nPrimeX发言人杰西·罗哈斯(Jesse Rojas)表示，工人和UFW的指控是“虚假的”和“道听途说”。\n他说：“绝大多数现有的和实际的PrimeX员工都对UFW的谎言感到不安，觉得去上班完全安全，因为公司已经竭尽全力确保他们的安全。”他补充说，PrimeX“从疫情爆发之初起，就一直遵守并遵循各级各机构的指导方针和建议”，但他拒绝透露这些指导方针是什么，以及该公司实施这些指导方针的日期。\n在以北约60英里的金斯县，另一场疫情席卷了中央山谷肉类公司，一家屠宰场和牛肉包装厂。在针对该公司的集体诉讼中代表工人的律师声称，病毒于4月份抵达汉福德的工厂，最终传播到大约200名工人。\n根据诉讼，5月初，金斯县一度报告有158例冠状病毒病例，而中央山谷肉类公司内部报告有161例-超过该县总病例的100%。起诉书中写道：“中央谷肉公司是金斯县新冠肺炎案件大幅增加的罪魁祸首，这是无可厚非的。”\n根据工人和诉讼的说法，直到疫情全面爆发，该公司才制定了良好的社交距离指导方针，手部消毒站或提供口罩。现在，如此多的工人感染了冠状病毒，以至于他们已经放弃了遵循任何指导方针，一名前除罪人说，由于担心丢掉工作，他要求只透露姓名为马丁。“几乎就像病毒已经过去了，因为每个人的检测都呈阳性，”他说。\n31岁的马丁说，第一个感染者在4月份停止了上班，当工人问为什么时，管理层告诉他们他耳朵痛。直到那个人的哥哥，和他住在一起，也在工厂工作，检测呈阳性，并告诉他们的同事，他们意识到冠状病毒已经到达。\n诉讼称，4月23日，当诉讼的主要原告玛丽亚·皮拉尔·奥内拉斯(Maria Pilar Ornelas)在工作中开始呼吸困难时，她询问管理层是否可以接受测试。诉状称，他们告诉她，检测只提供给“公司挑选”的员工，并告诉她必须完成轮班，尽管她头痛得很厉害，视力变得模糊。她很快发烧到华氏103.7度。\n诉讼称，Ornelas最终支付了225美元进行测试，因为该公司不提供医疗保险。到那时，她已经在不知不觉中将病毒传播给了她的男朋友。\n马丁已经在该公司工作了六年，4月下旬，他和另一位与他住在一起的亲戚检测呈阳性。虽然马丁的妻子和两个孩子在14天的隔离期间没有表现出症状，但马丁亲属的妻子和孩子的检测呈阳性。\n马丁说，他的一些同事尽管出现了症状，但仍在继续工作，因为他们担心如果停止工作，就会丢掉工作。他说，其他同事不再上班是因为他们害怕被感染-足以让公司在5月和6月向员工发放奖金，让他们冒着健康风险来上班。\n“我感觉自己被买断了，”马丁说。“感觉就像他们想以每周额外100美元的价格收买我的生活。”\n上个月，加州官员表示，必须优先打击中央山谷的传播。州长加文·纽瑟姆(Gavin Newsom)宣布，他将投入5200万美元，在8个县扩大接触者追踪、隔离和调查。\n纽瑟姆一直坦率地表示，冠状病毒以不成比例的方式损害了加州的部分人口和经济。特别是，拉丁裔社区和低工资的基本劳动力首当其冲地承受了负担，最近中央山谷病例的上升使差异变得非常明显。\n加州大学默塞德分校的帕迪拉和弗洛雷斯表示，只有围绕工作场所条件采取更严格的政策和执法，才能遏制危机。他们认为，在新冠肺炎之前，工作场所的安全和健康问题就已经存在。现在，随着病毒的威胁无处不在，风险可能是致命的。\n玛丽亚·霍滕西亚·洛佩兹(Maria Hortencia Lopez)，一名57岁的PrimeX员工，于7月14日死于Covid。另一名检测呈阳性的工人上个月被切断了生命支持，预计无法存活。52岁的佩德罗·祖尼加(Pedro Zuniga)是特雷西Safeway配送中心的一名农产品搬运工，在该中心的同事开始出现症状几周后死亡。根据祖尼加遗孀提起的诉讼，管理层告诉生病的员工，他们必须继续工作。51名工人最终检测呈阳性。\n拥有Safeway的Albertsons公司发言人蒂娜·马辛吉尔(Teena Massingill)表示，州职业安全和健康部门在4月15日-也就是祖尼加死亡两天后-检查了特雷西配送中心，“没有发现任何违规行为”。她说：“在祖尼加先生生病之前，该公司已经在该设施建立了加强的清洁做法和社会距离协议，并正在实施健康筛查和体温检查。”\n在PrimeX，员工在6月25日和7月6日举行罢工，要求公司遵守联邦法律，该法律要求像PrimeX这样的雇主提供与新冠肺炎相关的特定原因的带薪休假，最长可达80小时。工人和UFW表示，公司的工人很难拿到整整80个小时的工资。西斯内罗斯说，PrimeX告诉她，它被算作度假时间。\n(@UFWupdate)PrimeX员工要求公司采取行动保护他们免受COVID19的危害，并将他们视为必不可少的员工。Trabajadore Exigen que la compañia to ome Accion para proportgerlos del COVID19 y que los Trten como los Trabajadore Esenciales que son.。#WeFeedYou pic.twitter.com/6Byq7Iuatd。\n罢工结束后，工人们获得了80小时的工作时间，但随后PrimeX解雇了40名员工，据工人们说，其中包括Alvarado和一些在病毒问题上最直言不讳的人。PrimeX表示，由于生产需要，削减是必要的。不久之后，该公司开始招聘新员工。普锐斯发言人罗哈斯表示，公司“一直向国家新冠肺炎支付80小时病假工资”，“公司从未报复过任何员工”。他补充说：“所有的人事变动都是本赛季的典型变化。”\n玛丽埃洛斯·西斯内罗斯(Marielos Cisneros)参加罢工后，觉得自己受到了管理层的欺负。她在这个设施里仍然感到不安全，所以她在一周前辞职了。\n她知道他们所做的工作至关重要。她只希望他们能被这样对待。\n“对他们来说，我们只是工人，”西斯内罗斯说。“他们取代我们的速度真的很快。除了生产之外，他们不会把我们放在心上。“", "note_en": "Across California’s Central Valley, hundreds of thousands of workers wash the vegetables, debone the meat, sort the nuts and package the produce that finds its way into kitchens throughout the United States.\n When the coronavirus hit, their work was ruled essential, so they kept working in the often cramped facilities that fuel a state industry that exports  $21bn in agricultural products each year.\n Workers told the Guardian that in the past months, as much of  California sheltered at home, they took their places at the production lines and sorting tables, against all social distancing guidelines, as their companies made excuses for why coworker after coworker stopped showing up for their shifts. Some workers said they had to learn from news reports that they had been exposed to Covid-19. Others said they felt obligated to work even when showing virus symptoms.\n Then they returned to their homes in cities across the region, unknowingly exposing their parents, their spouses, their children, aunts, uncles and cousins to the virus.\n  “We felt like they would tell us. They would take precautions. But they didn’t,” said Marielos Cisneros of her former employer, the nut producer Primex Farms, when the pandemic began. “In a sense, we felt secure.”\n Now the virus is surging in the Central Valley, with several reported deaths among essential workers. In 10 counties, state authorities list workplaces and businesses as likely drivers for increased transmission. In at least two more counties, outbreaks in several food processing facilities have led to hundreds of infections.\n Workers and workers’ rights organizations say these outbreaks and the subsequent swell of infections in the Central Valley point to a devastating truth: that we are each only as protected as our least protected; as vulnerable as our most vulnerable.\n “You can appear to contain the spread among middle-class workers but when it reaches those workers who are furthest on the margins, who are most disadvantaged, the virus is going to spread,” said Edward Flores, a sociology professor at the University of California, Merced.\n  The Central Valley runs 450 miles down the center of California, much of it flat fields, lush fruit trees and vibrant orchards. The region contains the largest concentration of dairies in the state, as well as a number of meat-processing centers, together with the farms forming an agricultural juggernaut. In the San Joaquin Valley alone – the southern bulk of the region – more than 173,000 work in agriculture, with 45,000 more in food manufacturing, 60,600 more in grocery retail and 86,000 in transportation and warehousing, according to UC Merced’s Community and Labor Center.\n In the eight counties of the San Joaquin Valley, a 27,000-square-mile area of 4.3 million residents, coronavirus cases are at 1,900 per 100,000 residents. In comparison, the San Francisco Bay Area, with 7.7 million residents in 7,000 square miles, has 770 cases per 100,000 residents.\n  From the beginning of the pandemic, advocacy groups expressed concern for  the safety of essential food workers. Much of this work does not allow for social distancing, with workers squeezing next to each other in fields and crowding together at the plants. Many who do the low-wage labor that keeps these industries afloat are Latinx and do not speak English, making it difficult for them to communicate with their employers and understand their rights. Some are undocumented, with the fear of deportation preventing them from coming forward with any grievances.\n Still, over the past five years, the federal and state occupational safety and health division has received more complaints out of the Central Valley and inspected more accidents in this region than anywhere else in the state, according to Ana Padilla, executive director of UC Merced’s Community and Labor Center. The San Joaquin Valley has 13% of the state’s meat-processing centers, but has received 49% of the state’s inspections, Padilla said.\n Roxana Alvarado, 30, worked at Primex Farms in Wasco up until a few weeks ago. When she tested positive for the virus in June, dozens of her coworkers had already been infected, according to the workers and the United Farm Workers of America (UFW).\n At least 151 Primex workers have tested positive for Covid-19, according to the company – more than a third of the plant’s staff. UFW, which is keeping a census of infected workers, said the first confirmed infected worker, whom the company has blamed for bringing the virus  into the facility from abroad and fired, last worked on 20 May.\n Workers said management held a meeting when the pandemic first took off, warning them not to travel or put themselves at higher risk for infection, but gave out little other information. Before the outbreak, they offered no testing and told the workers they could bring masks from home if they wanted but that they weren’t mandatory. They made little effort to create social distancing. “In a typical day, an eight-hour shift, I can be in contact with 100 or more people, walking between people, going around the floor, chatting with people without masks,” said Alvarado.\n Alvarado had worked at Primex for almost two years, cleaning both the facility and the produce. When people stopped showing up for their shifts, management would say they were on vacation, Alvarado said. On 23 June, the company admitted that it had 31 confirmed cases – although UFW says the real number of infections around that time was closer to 76.\n By then, Alvarado had brought the virus home to Bakersfield, where she lived with her husband and two children. Her five-month-old baby tested positive.\n “They took away my right to choose whether to expose my family and myself to Covid when they didn’t inform us what was going on,” Alvarado said. “If I had known there was Covid, I would have made the difficult decision to not go to work because I never would have put my family at risk.”\n  Marielos Cisneros, 40, had worked as a sorter and then a production clerk for Primex for almost three years when she contracted a fever and went to the hospital on 10 June. She made sure human resources knew. “When I told them that I was positive, the HR lady told me not to tell anyone,” she said. “She told me to say I had a headache, that I had anything else but Covid.” Primex denies the allegation.\n  All four of her children got coronavirus, including a son with asthma, Cisneros said. As a single mother dependent on one paycheck, she said she would have gone to work regardless, but she would have taken more precautions had she known how prevalent the virus was at the facility.\n Flores and Padilla, the researchers at UC Merced,  authored a study looking into the connection between low-wage work and the spread of Covid-19. They found that most counties in California with high worker distress were on the state’s coronavirus watchlist, including much of the Central Valley.\n The disadvantages of this region and its workforce put them at higher risk not just for exposure to the virus, but also for unsanitary and unsafe work conditions with little freedom to advocate for themselves, Padilla said. More than 21% of workers in the region live below the poverty line and 17.9% are dependent on food stamps, according to the researchers. The region’s immigrants have the lowest rate of naturalization in the state. Most workers don’t qualify for federally guaranteed emergency leave, and if they are undocumented, they do not qualify for unemployment. From these tenuous circumstances, they go on to live in households that rank as the largest in the state.\n “One lady told me that she got infected, went home and unfortunately her entire family of 16 others was there,” said Armando Elenes, UFW’s secretary-treasurer. “I’m talking her husband, her sons, her son’s wife, their kids. It went from her to 16 others.”\n So far, 49 adult family members of the workers at the Primex plant and 34 children have tested positive, Elenes said.\n Jesse Rojas, a Primex spokesman, said the allegations by workers and UFW were “false” and “hearsay”.\n  “The overwhelming majority of current and actual Primex employees are upset over UFW’s lies and feel entirely safe going to work, as the company has gone above and beyond to ensure their safety,” he said. He added  that Primex “has been adhering to and following guidelines and recommendations by each institution at every level from the very beginning of the pandemic”, but he declined to provide details of what those guidelines were and the dates that the company put them in place.\n  About 60 miles north in Kings county, another outbreak swept through Central Valley Meat Co, a slaughterhouse and beef-packaging plant. Attorneys representing workers in a class-action lawsuit against the company assert that the virus arrived at the facility in Hanford in April, eventually spreading to about 200 workers.\n At one point, in early May, Kings county reported that it had 158 coronavirus cases while Central Valley Meat Co reported internally that it had 161 cases, according to the lawsuit – more than 100% of the county’s total cases. “It is beyond peradventure that Central Valley Meat is responsible for the significant increase in COVID-19 cases in Kings county,” the lawsuit states.\n  The company did not put in place good social distancing guidelines, hand sanitizing stations or offer face masks until an outbreak was in full swing, according to workers and the lawsuit. Now, so many of the workers have gotten coronavirus that they’ve given up on following any guidelines, said a former deboner who asked to only be identified as Martin out of fear of losing his job. “It’s almost like the virus has passed because everyone has tested positive,” he said.\n The first person infected stopped coming to work in April, and when workers asked why, management told them he had an earache, Martin, 31,  said. It wasn’t until that person’s brother, who lived with him and also worked at the plant, tested positive and told their coworkers that they realized coronavirus had arrived.\n When Maria Pilar Ornelas, the lawsuit’s main plaintiff, began struggling to breathe at work on 23 April, she asked management if she could get tested, according to the lawsuit. They told her testing was only offered to employees “chosen by the company”, the suit said, and told her she had to finish her shift, even though she had a headache so severe that her vision became blurry. She soon developed a fever of 103.7F.\n Ornelas eventually paid $225 for a test because the company does not provide health insurance, the lawsuit  said. By then, she had unknowingly spread the virus to her boyfriend.\n Martin, who has worked for the company for six years, tested positive in late April, along with another relative who lived with him. While Martin’s wife and two children did not display symptoms during their 14-day quarantine, the wife and child of Martin’s relative tested positive.\n Martin said some of his coworkers kept working despite displaying symptoms because they were afraid to lose their jobs if they stopped. Other coworkers stopped coming into work because they were scared of getting infected, he said – enough that in May and June, the company paid workers a bonus to risk their health and come to work.\n “I felt like I was being bought out,” Martin said. “It felt like they were trying to buy my life for an extra $100 a week.”\n  Last month, California officials indicated that combating the spread in the Central Valley must be a priority. The governor, Gavin Newsom, announced that he was dedicating $52m to expand contact tracing, quarantine efforts and investigations in eight counties.\n Newsom has been upfront that coronavirus has harmed parts of California’s population and economy in disproportionate ways. In particular, the Latinx community and low-wage essential labor workforce have borne the brunt of the burden, with the recent rise in cases in the Central Valley making the differences strikingly clear.\n  Padilla and Flores of UC Merced say that only more stringent policies and enforcement around workplace conditions will curb the crisis. Workplace safety and health concerns existed before Covid-19, they argue. Now, with the threat of a virus all around, the risks are potentially fatal.\n Maria Hortencia Lopez, a 57-year-old Primex employee, died of Covid on 14 July. Another worker who tested positive was taken off life support last month and is not expected to survive. Pedro Zuniga, a 52-year-old produce handler at a Safeway distribution center in Tracy, died weeks after coworkers began displaying symptoms at the center. Management told the sick employees that they had to keep working, according to a lawsuit filed by Zuniga’s widow. Fifty-one workers eventually tested positive.\n Teena Massingill, a spokeswoman for Albertsons Companies, which owns Safeway, said the state occupational safety and health division inspected the Tracy distribution center on 15 April – two days after Zuniga’s death – “and no violations were found”. “Prior to Mr. Zuniga falling ill, the Company had instituted enhanced cleaning practices and social distancing protocols at the facility, and was implementing health screening and temperature checks,” she said.\n At Primex, employees went on strike on 25 June and 6 July to demand the company adhere to federal law that requires employers like Primex to provide paid leave for specified reasons related to Covid-19 for up to 80 hours. Workers at the company struggled to get their full 80 hours paid, workers and UFW said. Cisneros said Primex told her it counted as vacation time.\n (@UFWupdates) Primex workers demand the company take action to protect them from COVID19 and treat them as the essential workers they are. / Trabajadores exigen que la compañía tome accion para protegerlos del COVID19 y que los traten como como los trabajadores esenciales que son. #WeFeedYou  pic.twitter.com/6Byq7Iuatd\n After the strike, workers received their 80 hours, but then Primex laid off 40 employees, including, according to workers, Alvarado and some of the most outspoken when it came to the virus. Primex said the cuts were necessary because of production needs. Soon afterwards, it began hiring new workers. Rojas, the Primex spokesperson, said the company “has always paid the state COVID-19 80-hour sick pay” and that “the company has never retaliated against any employee”. He added: “All of the changes in personnel are typical changes during the season.”\n Marielos Cisneros felt that she was being bullied by management after she participated in the strike. She also still didn’t feel safe in the facility, so she quit a week ago.\n She knows that the work they do is essential. She only wishes they were treated as such.\n “To them, we’re just workers,” Cisneros said. “They replace us really fast. They don’t think of us outside of production.”", "posttime": "2020-08-11 07:03:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阳性,positive,工人", "title": "“每个人的检测都呈阳性”：科维德摧毁了加州中心地带的农业工人", "title_en": "'Everyone tested positive':Covid devastates ag workers in California's heartland", "transed": 1, "url": "https://www.theguardian.com/us-news/2020/aug/08/california-covid-19-central-valley-essential-workers", "via": "", "real_tags": ["阳性", "positive", "工人"]}, {"category": "", "categoryclass": "", "imagename": "397a8fe3e48bc023fb2016a35b4d2896.jpg", "infoid": 1017442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步的股票在正常交易停止几个小时后下跌了约1.3%，在正常交易中下跌了约2%。Lyft的股价下跌了2.1%，尽管其股价在正常交易中上涨，使得其盘后下跌的影响总体上较小。\n正如TechCrunch在其对裁决的报道中指出的那样，将当前司机归类为员工而不是独立承包商的相关成本可能会被证明是实质性的。虽然这一决定可能意义重大，但投资者似乎无动于衷。阅读华尔街的茶叶可能是徒劳的，但在这种情况下，围绕司机是否应该是员工这个核心问题的持续数月的闲聊和法律争论，可能已经让投资者对任何特定的新闻失去了敏感度。\n消息传出后，两家公司都发表了声明，各自表示将对裁决提出上诉。这一法律姿态也可能有助于缓解投资者对禁令短期经济影响的担忧，该禁令目前将在10天后生效。\n“司机不想当员工，句号。我们将立即对这一裁决提出上诉，并继续为他们的独立而战。最终，我们相信这个问题将由加州选民决定，他们会站在司机一边。“。\n“法院的裁决至少暂缓10天，我们计划代表加州司机立即提出紧急上诉。绝大多数司机希望独立工作，我们已经对我们的应用程序进行了重大修改，以确保加州法律规定的情况仍然如此。当300多万加州人没有工作时，我们选出的领导人应该专注于创造就业机会，而不是试图在经济衰退期间关闭整个行业。“。\n优步首席执行官Dara Khosrowshahi今天在裁决前在“纽约时报”发表了一篇评论文章，主张在今天缺乏工人支持的零工经济和充分就业之间采取中间立场。\n为了理解为什么优步和Lyft的股票在这一消息传出后没有受到公众投资者的更多抨击，TechCrunch转向了优步最新的财报。Lyft直到本周三才会公布第二季度收益，这意味着我们从该公司获得的最新材料较少。然而，优步的文件很有用。\n优步上周公布了财报，显示出严重亏损和外卖业务激增。该公司的网约车运营受到新冠肺炎及其相关影响的严重阻碍。\n作为收益周期的一部分，优步提交了一份10季度的文件。它包括最近决定之前关于加州法律状况的说明。这份文件的日期是2020年8月7日，也就是上周五，这使得该公司对此事的新闻前观点发表了我们可以预期的最新评论。\n以下是其提交给美国证券交易委员会(SEC)的第一个相关部分，我们的重点是帮助您解析它：\n该公司有现有的诉讼，包括集体诉讼、PAGA诉讼、仲裁索赔以及政府行政和审计程序，声称司机或其代表声称司机被错误归类为独立承包商。关于加利福尼亚州议会法案5(“AB5”)的颁布，本公司已经收到并预计将继续在加州和其他司法管辖区收到更多的错误分类索赔。就本公司尚未解决的法律及监管事宜而言，根据其目前所知，本公司相信最终的合理可能亏损金额或范围不会对本公司的业务、财务状况、经营业绩或现金流产生重大不利影响，不论是个别或整体而言。这类法律问题的结果本质上是不可预测的，并受到重大不确定性的影响。如果这些问题中的一项或多项对本公司不利，其金额超过管理层的预期，本公司的经营业绩、财务状况或现金流可能会受到重大不利影响。\n在文件的更下面，优步就其成功的机会说了以下话：\n2020年8月6日，在就此事举行听证会后，旧金山高等法院通知各方，法院将受理提交的动议，并在未来几天公布命令。\n公司打算就这些行动积极为自己辩护。该公司成功的机会仍然不确定，任何合理可能的损失或损失范围都无法估计。\n以他们的股价走势作为晴雨表，投资者的直接观点似乎是，尽管这一决定可能对优步和Lyft造成的损害不大，但它们可能受到的损害并不大。\n优步和Lyft在新冠肺炎出现之前就已经向股东做出了盈利承诺，损害了他们的业务业绩。加州的决定可能会给每一家公司增加另一层困难，因为他们正在努力走出COVID领域的偿付能力，并再次走上调整后的盈利能力的道路。", "note_en": "Uber’s stock is off about 1.3% following the cessation of normal trading hours after dipping around 2% in regular trading.  Lyft’s   stock is down a sharper 2.1%, though its shares rose during regular trading, making the impact of its after-hours declines smaller in aggregate.\n As TechCrunch noted in its  coverage of the ruling, the costs associated with classifying current drivers as employees and not independent contractors could prove material. While the decision might be meaningful, investors seemed unmoved. Reading the Wall Street tea leaves can be an exercise in futility, but in this case the months of chatter and legal wrangling over the central question of whether drivers should be employees may have desensitized investors to any particular news item.\n  Both companies provided statements after the news broke, each stating that they will appeal the ruling. That legal posture could also help assuage investor concerns about short-term economic impacts regarding the injunction, which is currently set to take effect in ten days.\n  “Drivers do not want to be employees, full stop. We’ll immediately appeal this ruling and continue to fight for their independence. Ultimately, we believe this issue will be decided by California voters and that they will side with drivers.”\n  “The court’s ruling is stayed for a minimum of 10 days, and we plan to file an immediate emergency appeal on behalf of California drivers. The vast majority of drivers want to work independently, and we’ve already made significant changes to our app to ensure that remains the case under California law. When over 3 million Californians are without a job, our elected leaders should be focused on creating work, not trying to shut down an entire industry during an economic depression.”\n Uber CEO Dara Khosrowshahi  published an op-ed in the New York Times today ahead of the ruling, arguing for a middle ground between the gig economy of today’s lack of worker support, and full employment.\n To understand why shares of Uber and Lyft are not taking more fire from public investors in light of the news, TechCrunch turned to the Uber’s most recent earnings filings. Lyft does not report Q2 earnings until this Wednesday meaning we have less recent material from the company. Uber’s documents, however, are useful.\n  Uber reported earnings last week,  showing stiff losses and a  surging food-delivery business. The company’s ride-hailing operation was severely hampered by COVID-19 and its related impacts.\n As part of its earnings cycle, Uber  filed a 10-Q document. It included notes regarding the California legal situation from before the recent decision. The filing is dated August 7, 2020, or last Friday, making it about as fresh a comment from the company that we can expect regarding its pre-news perspective on the matter.\n Here’s the first pertinent portion of its SEC filing, with our emphasis to help you parse it:\n The Company has existing litigation, including class actions, PAGA lawsuits, arbitration claims, and governmental administrative and audit proceedings, asserting claims by or on behalf of Drivers that Drivers are misclassified as independent contractors. In connection with the enactment of California State Assembly Bill 5 (“AB5”), the Company has received and expects to continue to receive – in California and in other jurisdictions – an increased number of misclassification claims.  With respect to the Company’s outstanding legal and regulatory matters, based on its current knowledge, the Company believes that the ultimate amount or range of reasonably possible loss will not, either individually or in the aggregate, have a material adverse effect on the Company’s business, financial position, results of operations, or cash flows. The outcome of such legal matters is inherently unpredictable and subject to significant uncertainties.  If one or more of these matters were resolved against the Company for amounts in excess of management’s expectations, the Company’s results of operations, financial condition or cash flows could be materially adversely affected.\n A bit further down in the filing, Uber said the following, regarding its chances of success:\n On August 6, 2020, following a hearing on the matter, the San Francisco Superior Court informed the parties that the Court would take the motions under submission and publish its order in the coming days.\n The Company intends to vigorously defend itself with regard to these actions. The Company’s chances of success on the merits are still uncertain and any reasonably possible loss or range of loss cannot be estimated.\n  Using their share price movement as a barometer, the immediate view from investors appears to be that the possible damage to Uber and Lyft from the decision could prove modest despite.\n Uber and Lyft had  made profit promises to their shareholders before COVID-19 arose, harming their business results. The California decision could add another layer of difficulty for each as they work to come out of the COVID area solvent, and once again on a path to adjusted profitability.", "posttime": "2020-08-11 06:38:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法官,uber,可能", "title": "\n在加州法官称合同司机是员工后，优步、Lyft的股价走低", "title_en": "\n\t\t\t\tShares of Uber, Lyft drift lower after California judge says that contract drivers are employees\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/shares-of-uber-lyft-drift-lower-after-california-judge-says-that-contract-drivers-are-employees/", "via": "", "real_tags": ["法官", "uber", "可能"]}, {"category": "", "categoryclass": "", "imagename": "386c643b439616c1e6c089fb82dc627a.jpg", "infoid": 1017441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，拉尔斯顿和我一起接受了长达一小时的Crunch Live额外采访，我们讨论了几个话题，包括YC在大流行期间是如何调整其节目的，为什么他“从未停止编码”，以及他看到了科技领域的变化。\n他说：“我们尽量不要太聪明，因为伟大的创始人往往能看到比你看到的更多的东西。”“如果你试图变得太聪明，你会错过世界上的Airbnbs。你会说“人们房子里的气床？那也太蠢了!。我不会在这上面投资的，‘而且你可以用当时的…一分钱买下Airbnb10%的股份。该公司…的10%。你可以自己算算。“。\nExtra Crunch Live是我们最新的虚拟活动系列，我们与科技领域的一些顶级创始人、投资者和建设者坐在一起，收集他们愿意分享的每一点见解。最近，亨特·沃克、柯尔斯滕·格林和马克·库班等人加入了我们的行列。\n要观看与Geoff Ralston的整个采访，请注册ExtraCrunch-但一旦您了解了这一点，您就可以找到它(以及聊天的一些关键摘录！)。下面。\n我更喜欢额外的Crunch Live对话以可行的建议开始，所以我们以Ralston为那些希望申请YC的人提供的任何建议开始。而且他有很多钱！例如：\n注意截止日期，但如果你错过了，也不会失去所有的希望：“如果你错过了最后期限，那也不是世界末日，”拉尔斯顿说。“不要告诉招生团队的任何人，这是我说的，但这是一个有点软的截止日期。我们永远不会因为你错过了最后期限…就拒绝下一家史诗般的公司。不过，如果你不能在[截止日期]前到校，你被录取的几率就会下降。为什么你的赔率不应该越高越好呢？“。\n不要为了YC而改变：“尽你所能让你的公司尽可能成功，尽可能真实…。但不要试图为YC美化你的公司，“他说。“对于投资者来说，这从来都不是明智之举。不要因为你认为有一个期限，你就应该做错误的事情，所以就做出糟糕的短期决定。相反，要建立长期的公司，并尽最大努力找到适合产品市场的产品，打造合适的产品，打造合适的技术，打造合适的软件或你正在打造的任何东西。“。\n在视频的后面(40：55分左右)，观众的一个问题将拉尔斯顿带回了这个话题，他还有几条建议：\n遵守指示：“指示相当清楚。上面写着：做一个一分钟的视频，让所有的创始人都在那里，然后和我们交谈。这个主意真不错!。不要给我们一些营销视频，我们对此不感兴趣。这不是我们做出决定的方式。“。\n磨练你的推销：“想一想简明扼要地表达你自己。在应用程序中写一本书无济于事。善待我们吧！我们正在阅读，你知道，数以百计的申请书。尽可能清楚地表达你的想法。这对我们来说实际上是一个很好的信号，如果你能用最少的语言描述你正在做的事情。这对我们帮助很大。“。\n讲述你的故事：“不要吝啬谈论你们自己！”拉尔斯顿指出。“我们对你非常感兴趣，你是谁，你为什么要做你正在做的事情。”", "note_en": "Ralston joined me last week for an hour-long  Extra Crunch Live interview where we talked about several topics, including how YC has adapted its program during the pandemic, why he has “never stopped coding” and what he sees changing in tech.\n “We try to not be too smart, because great founders often see things beyond what you’re seeing,” he said. “If you try to be too smart, you’ll miss the Airbnbs of the world. You’ll say ‘Airbeds in peoples houses? That’s stupid! I’m not going to invest in that,’ and you could’ve bought 10% of Airbnb for like nothing back then… 10% of that company… you can do your own math.”\n  Extra Crunch Live is our new virtual event series where we sit down with some of the top founders, investors and builders in tech to glean every bit of insight they care to share. We’ve recently been joined by folks like  Hunter Walk,  Kirsten Green and  Mark Cuban.\n To watch the entire interview with  Geoff Ralston,    sign up for ExtraCrunch — but once you’ve got that covered, you can find it (and a bunch of key excerpts from the chat!) below.\n   I prefer it when an Extra Crunch Live conversation starts out with actionable advice, so we kicked things off with any suggestions Ralston had for folks looking to apply to YC. And he had plenty! Such as:\n Mind the deadline, but all hope is not lost if you miss it: “If you miss the deadline, it’s not the end of the world,” says Ralston. “Don’t tell anyone on the admissions team that I said this, but it’s a  little bit of a soft deadline. We would never turn down the next epic company because you missed the deadline… although your odds go down of getting in if you don’t make it in by [the deadline]. Why shouldn’t your odds be as high as possible?”\n Don’t change things up for YC’s sake: “Do whatever you can do to make your company as successful, as real as possible… but don’t try to like, pretty up your company for YC,” he says. “That’s never smart [to do] for an investor. Don’t make bad short-term decisions because you think there’s a deadline that you should do wrong things for. Instead, build your company for the long term, and do the best you can possibly do to find product market fit, to build the right product, to build the right technology, to build the right software or whatever it is you’re building.”\n Later in the video (around the  40:55 mark), a question from the audience leads Ralston back to the topic, and he has a few more pieces of advice:\n Stick to the instructions: “The instructions are fairly clear. It says: do a one-minute video, have all the founders there, and talk to us. That’s a good idea! Don’t give us some marketing video, we’re not interested in that. That’s not how we’re making our decision.”\n Hone your pitch: “Think about expressing yourself concisely, with great clarity. It does not help to write a book in the application. Be kind to us! We’re reading, you know,  hundreds of applications. Get your idea across as clearly as you can. That’s actually a really good signal to us, if you can describe what you’re doing with a minimum of words. That helps us a ton.”\n Tell your story: “Do not skimp on talking about yourselves!” Ralston notes. “We are super interested in you, who you are, and why you’re doing what you’re doing.”", "posttime": "2020-08-11 06:37:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ralston,president,yc", "title": "\nY Combinator总裁杰夫·拉尔斯顿(Geoff Ralston)与初创公司创始人分享可行的建议", "title_en": "\n\t\t\t\tY Combinator President Geoff Ralston shares actionable advice for startup founders\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/y-combinator-president-geoff-ralston-shares-actionable-advice-for-startup-founders/", "via": "", "real_tags": ["ralston", "president", "yc"]}, {"category": "", "categoryclass": "", "imagename": "48f70f02ce58e0dd4f546a2e927a6402.jpg", "infoid": 1017440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "布莱恩·赫特向我们介绍了WatchOS7的所有变化。听起来这款操作系统并没有大幅升级--尤其是与MacOS相比--但仍然有一些重要的变化可以帮助苹果保持智能手表行业的领先地位：\n更新包括新的洗手功能，骑自行车的方向，新的锻炼，最重要的是，一些睡眠跟踪功能。毫无疑问，最后一点是这款手表被要求最多的新增功能-对苹果的底线来说也同样重要，相对于竞争对手…，苹果在这一类别上落在了后面。这里的睡眠跟踪与已安装在现有设备上的传感器配合使用，并加入了许多第三方解决方案。\n据华尔街日报报道，废弃的购物中心百货商店可能成为亚马逊的下一个履约中心--据《华尔街日报》报道，美国购物中心房地产最大的所有者之一Stages一直在与亚马逊洽谈将其支柱百货商店转变为配送中心的事宜。\nIOS 14将网络链接从News+出版商直接重定向到Apple News应用程序-如果你点击News+合作伙伴发布的付费故事的链接，iOS 14、iPadOS 14和MacOS Big Sur会将你直接带到News+应用程序中的文章页面，即使链接表面上指向出版商自己的网站。\n亚马逊将Twitch Prime重新推出为Prime Gaming-在新旧版本中，Twitch Prime/Prime Gaming都提供免费游戏、游戏内容(如武器和皮肤)和免费Twitch频道订阅，所有这些都是标准Prime会员的一部分。\n随着TikTok出售的临近，ByteDance的估值面临巨大压力-几位投资者告诉TechCrunch，该公司的价格承受着巨大的压力，因为它将剥离其宝贵的资产TikTok。\n随着对创意技能的重新关注，在线学习公司Skill Share筹集了6600万美元-Skill Share首席执行官马特·库珀表示，2020年是快速增长的一年，甚至在大流行迫使大量人口留在家里，转向在线学习娱乐和致富之前。\n一辆法拉第未来的原型被拍卖-尽管法拉第未来从未生产过一辆量产车，但该公司设法创造了几个原型，其中一个很快就会上市出售。\nUncork Capital创始人杰夫·克拉维尔-克拉维尔(Jeff Clavier-Clavier)的种子融资技巧和诀窍表示，截至2019年底，估计有1000多家公司专注于种子投资市场，但到今年年底，将有大约2000家公司。\nDuck Creek Technologies正在拆开Duck Creek Technologies的IPO，并希望--估值27亿美元--在SaaS收入不断增长的支持下，Duck Creek Technologies正寻求上市。\n三位成长型营销专家分享了他们2020年的最佳工具和战略-回顾了我们早期虚拟活动的观察结果，来自石墨的Ethan Smith、Sound Ventures的Susan Su和Get Users的Asher King-Abramson。\n(提醒：Extra Crunch是我们的订阅会员计划，旨在使初创企业的信息大众化。您可以在这里注册。)。\n特朗普政府宣布5G的主要中带频谱拍卖-今天，美国频谱的中带被军方等政府服务大量使用。\n原创内容播客：“雨伞学院”(The Umbrella Academy)回归了一个混乱但令人愉快的第二季--我不仅在大结局时哭了，而且在描述大结局时还抽泣起来。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Brian Heater  walks us through all the changes coming in watchOS 7. It sounds like the operating system isn’t getting a dramatic upgrade — particularly in comparison to MacOS — but there are still some important changes that should help Apple stay at the top of the smartwatch industry:\n  Updates include the new hand-washing featuring, cycling directions, new workouts and, most importantly, a number of sleep-tracking features. The last bit is, without question, the most requested addition to the watch — and equally important to Apple’s bottom line, a category the company had fallen behind on relative to the competition … The sleep tracking here works with the sensors already on-board existing devices and joins a number of third-party solutions.\n  Abandoned mall department stores may become Amazon’s next fulfillment centers — One of the largest owners of shopping mall real estate in the United Stages has been talking to Amazon about transforming its anchor department stores into distribution hubs, according to  The Wall Street Journal.\n iOS 14 redirects web links from News+ publishers directly to the Apple News app — If you click on a link to a paywalled story published by a News+ partner, iOS 14, iPadOS 14 and macOS Big Sur will take you straight to the article page in the News+ app, even when the link ostensibly points to the publisher’s own website.\n Amazon relaunches Twitch Prime as Prime Gaming — In both its old and new incarnations, Twitch Prime/Prime Gaming offers free games, game content (like weapons and skins) and a free Twitch channel subscription, all as part of a standard Prime membership.\n  ByteDance valuation under huge pressure as TikTok sale nears — The company’s price tag is under tremendous pressure as it’s set to shed its prized asset TikTok, several investors told TechCrunch.\n With a renewed focus on creative skills, online learning company Skillshare raises $66M — Skillshare CEO Matt Cooper said 2020 has been a year of rapid growth, even before the pandemic forced large swaths of the population to stay home and turn to online learning for entertainment and enrichment.\n A Faraday Future prototype hits the auction block — Although Faraday Future never produced a production vehicle, the company managed to create several prototypes, and one of them will be available for sale soon.\n  Seed funding tips and tricks from Uncork Capital founder Jeff Clavier — Clavier said that at the end of 2019, it was estimated there were more than 1,000 firms focusing on seed investing in the market, but by the end of this year, there will be about 2,000.\n Unpacking Duck Creek Technologies’ IPO and hoped-for $2.7B valuation — Duck Creek Technologies is looking to go public on the back of growing SaaS revenues.\n Three growth marketing experts share their best tools and strategies for 2020 — Recapping observations from our Early Stage virtual event from Graphite’s Ethan Smith, Sound Ventures’ Susan Su and Got Users’ Asher King-Abramson.\n (Reminder: Extra Crunch is our subscription membership program, which aims to democratize information about startups.  You can sign up here.)\n  Trump administration announces major midband spectrum auction for 5G — Today, the midband of U.S. spectrum is heavily utilized by government services like the military.\n Original Content podcast: ‘The Umbrella Academy’ returns for a messy-but-delightful second season — Not only did I cry during the finale, I also got sniffly while just  describing the finale.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-08-11 06:37:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,crunch,news", "title": "\nDaily Crunch：试试看苹果手表OS7", "title_en": "\n\t\t\t\tDaily Crunch: Trying on Apple’s watchOS 7\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/daily-crunch-watchos-7-peview/", "via": "", "real_tags": ["apple", "苹果", "crunch", "news"]}]