[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1066937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴比斯阿塔诺·洛斯托洛斯声称劫匪杀死了卡罗琳克劳奇，20岁，在她的宝宝旁边被发现死了\n    在英国出生的学生丈夫承认并被指控谋杀后，希腊人已经留下了卷雪，这是他以前归咎于抢劫的罪行。\n 在一个戏剧性的扭曲到抓住了这个国家的案件，因为卡罗琳克劳奇在她的宝贝女儿旁边被勒死，调查人员周四宣布，巴比斯阿塔诺·洛克斯·帕斯诺伊州·帕迪斯·索诺\n  “罪魁祸首是她33岁的丈夫，曾为行动承认过，”希腊警察推断了。\n 在周五出现在法庭上的Anagnostopoulos手铐和穿着防弹背心，被指控有意杀人，并且在家庭狗被发现杀死之后。克劳奇队遇到了那个男人，她将继续作为一个少年在希腊岛上的少年结婚，她的父母长期以来，是20。\n 最初，直升机飞行员在无情的“外国”劫匪上归咎于他的妻子的死亡，他闯入了这对夫妻州雅典的家乡，这是他维持了五个多周的一系列活动。他声称他被蒙住眼睛被蒙住眼睛并绑在床上，漂流进出意识，因为他看着犯罪展开。\n “犯罪现场的一切看起来像抢劫的现场，”大雅典凶杀师司司长的董事“卡斯塔斯哈西伊斯告诉记者，补充说，嫌疑人绑自己的手和他死去的妻子的人。 \n谈到宫廷外，Anagnostopoulos的律师Vassilis Spyrou证实，他的客户已向犯罪承认，并补充说他对他的行为表示遗憾。\n “他处于一个非常糟糕的心理状态，”Spyrou早些时候告诉阿尔法电视。 “他知道他所做的事情，他已经承认犯罪。”\n 雅典协会副主席尼科斯·里加斯告诉州电视，审查移动设备，智能手表和相机已经建立了一项时间表，揭示了试点的账户不一致。\n “（嫌疑人）试图创造一个看起来令人信服的犯罪现场环境：狗被杀了，他的宝宝被击败了被谋杀的母亲的身体，”Rigas说。\n Anagnostopoulos在Alonissos出席蹲伏的纪念服务，他被拍摄了他被拍住了受害者的母亲，在星期四的警察直升机上飞往希腊资本后被捕。当警方最初选择他时，他被告知了一位嫌疑人已经确定了，但不是那就是他。\n 这不是他第一次被召集到警察总部给予证词。但是，警方有证据 - 以Caroline的SmartWatch和飞行员的手机收集的数据形式 -  Anagnostopoulos杀死了他的妻子。手表上的一个脉冲监视器在他声称袭击事件发生之前，她已经死了，而他手机上的健身应用程序在他说他说他一直被蒙住眼睛并捆绑的时候，他就会在房子周围移动。\n 在这两种情况下，研究结果与专业飞行员先前已经给出的事件时间表发生冲突。在夫妻家中的安全摄像头中删除了一张存储卡，在4.30点之前的几个小时，当他声称盗贼陷入困境时，提供了进一步的证据。 \n警方说，展示了谋杀案，告诉侦探他们的关系越来越暴风雨，他的关系越来越暴风雨，他曾在愤怒之后杀死了蹲伏。\n “我不得不看起来有说服力，所以我也扼杀了狗，”他据报道，在警察向希腊媒体发布的证词提取物中说。\n  生活记忆中的犯罪很少，如此深受愤怒的希腊人，飞行员似乎已经心烦意乱，告诉警察他“恳求自己的生活”，因为盗贼指着一个手枪，他的女儿的寺庙，告诉媒体，他希望没有家庭必须体验相同的磨难。 “他们非常高兴，所以恋爱中，”阿尔诺迪斯的市长佩特罗斯·瓦法尼斯当时告诉守护者。 “我们小社区的震惊是巨大的。”\n  雅典公民保护部长Michalis Chrysohoidis在11月11日谋杀期间表示公开：“我们很少在希腊社会和犯罪中遇到希腊这样的野蛮行为。”\n 在一个稀有的一步中，政府宣布了一个可能导致罪犯夺取罪魁祸首的信息奖励。\n Anagnostopoulos的图像参加他妻子的葬礼抱着他们的11个月大的婴儿很多。\n 所以，他也是由Caroline的坟墓给出的遭受呼吁的eulogy。 “我很幸运，我遇到了你，非常幸运的是你爱我，更幸运的是，你是我孩子的母亲，”他说过。 “莱迪亚将不记得她精彩的母亲，但是颂歌是生活的快乐将永远在我靠近我，通过莱迪亚。” \n他的忏悔很快就会引出愤怒。过夜希腊人淹没了社交媒体，享有谴责和司法的信息，而主流媒体不仅表达了“这位成就演员”的虚伪，而是如此许多，包括高级希腊公正官员，与他的故事一起享受震惊坚强的“阿尔巴尼亚和格鲁吉亚”罪犯是责备谋杀罪。\n “对专业的尊敬的父亲的同情大流行，被捆绑在一起，看到他的年轻妻子被谋杀在他的孩子面前已经像一座卡片一样崩溃，”左翼报纸efsyn在一个社论中写道。 “与此同时，关于令人发指发发的犯罪犯罪的外盗宣传也崩溃了。”\n 星期五，案件被比作奥斯卡帕斯托里乌斯，南非短跑运动员在2015年被定罪的致命射击他的女朋友，Reeva Steenkamp，他的比勒陀利亚家里。\n “我们经历过杂散案的希腊版，它具有几乎相同的特点，”戈尔奇斯卡利亚克曼在西阿提卡警察员工联盟告诉国有电视台。\n 从一开始，他说，调查人员涉嫌飞行员，但缺乏DNA或其他证据的困惑，指出了他的罪魁祸首。\n “Pistorius犯罪袭击了世界各地的人。这种罪行引起了希腊边界超越的涟漪，“他说，并补充说，调查人员遵循了”一步一步“的方法，以确保他们将获得允许他们杀死犯罪者的证据。 ", "note_en": "Babis Anagnostopoulos had claimed robbers killed Caroline Crouch, 20, who was found dead next to her baby\n    Greeks have been left reeling after the husband of a British-born student confessed and was charged with her murder, a crime he had previously blamed on a robbery.\n In a dramatic twist to a case that has gripped the country since Caroline Crouch was strangled next to her baby daughter, investigators announced late on Thursday that Babis Anagnostopoulos had admitted to the murder.\n  “The culprit is her 33-year-old husband who has confessed to the act,” the Greek police tweeted.\n Anagnostopoulos, who appeared in court on Friday handcuffed and wearing a bulletproof vest, was charged with intentional homicide and abuse of an animal, after the family dog was also found killed. Crouch, who had met the man she would go on to marry as a teenager on the Greek island of Alonissos where her parents have long lived, was 20.\n Initially the helicopter pilot had blamed his wife’s death on ruthless “foreign” robbers who had broken into the couple’s suburban Athens home, a version of events he had maintained for more than five weeks. He claimed he had been blindfolded and tied to a bed, drifting in and out of consciousness as he watched the crime unfold.\n “Everything was staged for the crime scene to look like the scene of a robbery,” Costas Hassiotis, the director of the greater Athens homicide division, told reporters, adding that the suspect had tied his own hands and those of his dead wife.\n Speaking outside court, Vassilis Spyrou, Anagnostopoulos’s lawyer, confirmed that his client had confessed to the crime, adding that he had expressed remorse for his actions.\n “He’s in a very bad psychological state,” Spyrou had earlier told Alpha TV. “He knows what he has done, he has admitted to the crime.”\n Nikos Rigas, the deputy chairman of the police officers’ association of Athens, told state TV that examination of mobile devices, a smartwatch, and cameras had established a timeline that revealed inconsistencies in the pilot’s account.\n “(The suspect) tried to create a crime scene environment that looked convincing: the dog was killed, and his baby was placed next to the body of the murdered mother,” Rigas said.\n Anagnostopoulos, who was in Alonissos attending a memorial service for Crouch at which he was photographed hugging the victim’s mother, was arrested after being flown to the Greek capital on a police helicopter on Thursday. When police initially picked him up he was told a suspect had been identified, but not that it was him.\n It was not the first time he had been called to the police headquarters to give testimony. But this time the police had evidence – in the form of data gleaned from Caroline’s smartwatch and the pilot’s mobile phone – that Anagnostopoulos had killed his wife. A pulse monitor on the watch showed she was dead at a time before he claimed the raid had taken place, while a fitness app on his phone proved he was moving around the house at the time he said he had been blindfolded and tied up.\n In both cases, the findings conflicted with the timeline of events the professional pilot had previously given. A memory card removed at 1.20am from the security camera of the couple’s home, several hours before 4.30am when he claimed the thieves had broken in, provided further evidence.\n Presented with the new data, Anagnostopoulos admitted to the murder, telling the detectives their relationship had grown increasingly stormy and he had killed Crouch in a fit of rage after she had threatened to leave him, police said.\n “I had to appear persuasive and so I strangled the dog too,” he was reported as saying in extracts of testimony released by police to the Greek media.\n  Few crimes in living memory have outraged Greeks so deeply and for 37 days the pilot had appeared distraught, telling police he had “begged for their lives” as the thieves pointed a pistol at Lydia, his daughter’s temple, and telling the press he hoped no family had to experience the same ordeal. “They were so happy, so in love,” Alonissos’ mayor Petros Vafinis told the Guardian at the time. “The shock in our little community is immense.”\n  Athens’ citizens protection minister, Michalis Chrysohoidis, said within hours of the 11 May murder being made public: “We rarely encounter such brutality in Greece, both in Greek society and in crime.”\n In a rare step, the government declared a €300,000 reward for information that might lead to the capture of the culprits.\n Images of Anagnostopoulos attending his wife’s funeral cradling their 11-month-old baby resonated far and wide.\n So, too, did his heartrending eulogy given by Caroline’s graveside. “I am lucky that I met you, very lucky that you loved me and even more lucky that you are the mother of my child,” he had said. “Lydia will grow up not remembering her wonderful mother, but Caroline who was the joy of life will always be near me, through Lydia.”\n His confession was quick to elicit rage. Overnight Greeks flooded social media with messages of condemnation and calls for justice, while the mainstream media expressed shock not only at the hypocrisy of “this accomplished actor” but the willingness of so many, including senior Greek justice officials, to go along with his story that hardened “Albanian and Georgian” criminals were to blame for the murder.\n “The pandemic of sympathy for the professional, respected father who, tied up, saw his young wife being murdered in front of his child has collapsed like a tower of cards,” the leftwing newspaper Efsyn wrote in an editorial. “Along with it the far-right propaganda about foreign thieves committing heinous crimes has collapsed too.”\n On Friday, the case was being likened to that of Oscar Pistorius, the South African sprinter who was convicted in 2015 of fatally shooting his girlfriend, Reeva Steenkamp, in his Pretoria home.\n “We have experienced the Greek version of the Pistorius case, it has almost the same characteristics,” Giorgos Kalliakmanis, who heads the union of police employees in west Attica told state-run TV.\n From the outset, he said, investigators had suspected the pilot but were flummoxed by the lack of DNA, or other evidence, that pointed to his culpability.\n “The Pistorius crime shocked people across the world. And this crime has caused ripples beyond the Greek borders,” he said, adding that investigators had followed a “step-by-step” approach to ensure they would obtain the proof that would allow them to ensnare the perpetrator.", "posttime": "2021-06-20 03:53:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,智能,lies,告诉", "title": "如何由他的手机和智能手表暴露凶手的谎言 ", "title_en": "How a Murderer's Lies Were Exposed by His Cellphone and a Smartwatch", "transed": 1, "url": "https://www.theguardian.com/uk-news/2021/jun/17/greek-husband-confesses-to-of-british-woman", "via": "", "real_tags": ["手机", "智能", "lies", "告诉"]}, {"category": "", "categoryclass": "", "imagename": "51ccc39be54934eba67eff9d55cfe0b6.png", "infoid": 1066936, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Phabricator是一组用于开发软件的工具。 它包括用于代码审查，存储库托管，错误跟踪，项目管理等的应用程序。  GitHub是超过6500万开发人员塑造了软件的未来。  基本的维基克隆如此漂亮，易于设置，你会想知道它是否真的是一个维基。  一个让它每天谈话的地方，更频繁地闲逛。  通过在一个平台中集中所有工具和接触点来保持工作流程。 为团队合作，DEVOPS和客户参与制作。  Microsoft团队是Microsoft 365中团队协作的集线器，它集成了您的团队需求的人员，内容和工具。  Gitter是一个聊天和网络平台，有助于通过消息传递，内容和发现来管理，成长和连接社区。 \nTutanota是世界上最安全的电子邮件服务，易于使用和私密设计。  将公共Web应用程序的免费和开源消息传递和电子邮件发送到一个。  Outlook是一个个人信息管理器，可让您管理您的电子邮件，日历，联系人和任务。  LucidChart是智能图示应用程序，使团队聚集在一起，以更好地决策并建立未来。  从Jira，Bitbucket，Sonarqube收集敏捷度量，并将它们发送到弹性堆栈中以在Kibana中可视化  CLI工具从JIRA中提取指标，在本地保存数据和图表以进行进一步的分析＆amp; 推介会  连接到JIRA REST API以收集完成的故事点，计算每周速度，并估计完成日期 \n您的中心是您的中心，用于专业，高效地调度会议，消除了前后电子邮件的麻烦，以便您可以重新开始工作。  预约调度软件有助于通过世界各地的人预订1-On-1次会议，避免双重预订并节省时间！  GitHub是超过6500万开发人员塑造了软件的未来。  Launchpad可以使用Bazaar版本控制系统托管您的项目源代码。  待办事项列表＆amp; 程序员和其他数字工人的时间跟踪器与Jira，Github和Gitlab集成  Sharex是一个免费和开源程序，可允许您捕获或录制屏幕的任何区域，并用单个按下键共享  关于清洁代码，测试驱动开发，遗留代码，重构，域驱动设计和微服务架构的有组织的学习路径 \n常绿技能列表，基于软件开发最佳实践＆amp; 跨框架原则，这应该是对熟练的软件工程师/开发人员的公平评估  策划列表的令人敬畏的在线课程和软件测试教程，测试自动化等等。  主要技术人员的策划和分传资源清单，重点是初创公司  领导人民和经理的令人敬畏的资源清单。 对Tech提供，但对任何人都有潜在有用。 ", "note_en": "Phabricator is a set of tools for developing software. It includes applications for code review, repository hosting, bug tracking, project management, and more.\n        GitHub is where over 65 million developers shape the future of software, together​.\n      Basic wiki clone so pretty and easy to set up, you’ll wonder if it’s really a wiki.\n  A place that makes it easy to talk every day and hang out more often.\n Keep the workflow going by centralizing all your tools and touchpoints in one platform. Made for team collaboration, DevOps and customer engagement.\n   Microsoft Teams is the hub for team collaboration in Microsoft 365 that integrates the people, content, and tools your team needs.\n Gitter is a chat and networking platform that helps to manage, grow and connect communities through messaging, content and discovery.\n  Tutanota is the world&#39;s most secure email service, easy to use and private by design.\n  Free and Open Source messaging and emailing app that combines common web applications into one.\n   Outlook is a personal information manager that lets you manage your e-mail, calendar, contacts, and tasks.\n  Lucidchart is the intelligent diagramming application that brings teams together to make better decisions and build the future.\n  collecting agile metrics from jira, bitbucket, sonarqube and send them to elastic stack to visualize in kibana\n CLI tool to extract metrics from Jira, save data and charts locally for further analysis &amp; presentation\n   Connect to Jira REST API to collect completed story points, calculate weekly velocity, and estimate completion date\n  Calendly is your hub for scheduling meetings professionally and efficiently, eliminating the hassle of back-and-forth emails so you can get back to work.\n Appointment scheduling software helps to book 1-on-1 meetings with people all over the world, avoid double booking and save time!\n    GitHub is where over 65 million developers shape the future of software, together​.\n    Launchpad can host your project’s source code using the Bazaar version control system.\n  To-do list &amp; time tracker for programmers and other digital workers with Jira, Github, and Gitlab integration\n   ShareX is a free and open source program that lets you capture or record any area of your screen and share it with a single press of a key\n  An organized learning path about Clean Code, Test-Driven Development, Legacy Code, Refactoring, Domain-Driven Design and Microservice Architecture\n   List of evergreen skills, based on software development best practices &amp; cross-framework principles, that should serve as a fair assessment of skilled software engineers / developers\n  A curated list of awesome online courses and tutorials on software testing, test automation and more.\n         A curated and opinionated list of resources for Chief Technology Officers, with the emphasis on startups\n   Awesome List of resources on leading people and being a manager. Geared toward tech, but potentially useful to anyone.", "posttime": "2021-06-20 03:52:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程,engineering,团队", "title": "工程管理 ", "title_en": "Engineering Management", "transed": 1, "url": "https://github.com/ixaxaar/awesome-engineering-management", "via": "", "real_tags": ["工程", "团队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066935, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：深入学习已经彻底改变了计算机视觉，Naturallanguage理解，语音识别，信息检索等。然而，随着深度学习模型的逐步改进，他们的参数，延迟，培训所需的资源等。拥有所有人都显着下降。因此，要注意模型的这些足迹度量，这一切都很重要，而不仅仅是其质量。我们提出了激励深入学习效率的问题，然后是一个模型效率的五个核心领域的康沃维（跨越式造型技术，基础设施和硬件），并在那里进行精彩作品。我们将一个基于实验的指南与代码一起，用于从业者提炼其模型培训和部署。我们认为这是第一次在高效的深度学习空间中的调查，这些调查包括模型效率的土地景观，从建模技术到硬件支持。 Ourhope是，这项调查将向读者提供精神模型和对现场的理解，以应用通用效率技术，以获得显着的改进，并配备他们的想法，以实现额外的研究和实验以实现额外的提升。 ", "note_en": "Download PDF  Abstract: Deep Learning has revolutionized the fields of computer vision, naturallanguage understanding, speech recognition, information retrieval and more.However, with the progressive improvements in deep learning models, theirnumber of parameters, latency, resources required to train, etc. have all haveincreased significantly. Consequently, it has become important to pay attentionto these footprint metrics of a model as well, not just its quality. We presentand motivate the problem of efficiency in deep learning, followed by a thoroughsurvey of the five core areas of model efficiency (spanning modelingtechniques, infrastructure, and hardware) and the seminal work there. We alsopresent an experiment-based guide along with code, for practitioners tooptimize their model training and deployment. We believe this is the firstcomprehensive survey in the efficient deep learning space that covers thelandscape of model efficiency from modeling techniques to hardware support. Ourhope is that this survey would provide the reader with the mental model and thenecessary understanding of the field to apply generic efficiency techniques toimmediately get significant improvements, and also equip them with ideas forfurther research and experimentation to achieve additional gains.", "posttime": "2021-06-20 03:52:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,学习,deep,模型", "title": "高效的深度学习：制作模型更小，更快的调查 ", "title_en": "Efficient Deep Learning: A Survey on Making Models Smaller, Faster, Better", "transed": 1, "url": "https://arxiv.org/abs/2106.08962", "via": "", "real_tags": ["深度学习", "学习", "deep", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066934, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它花了一些数十年来欣赏Python。但自2010年初以来，它一直蓬勃发展 - 最终超过C，C＃，Java和JavaScript的流行度。\n 但直到何时趋势继续？什么时候Python最终会被其他语言替换，为什么？\n 在Python上提出确切的到期日将是如此猜测，它可能像科学小说一样通过。相反，我将评估现在推动Python的流行度的美德，以及将来会破坏它的弱点。\n   Python的成功反映在堆栈溢出趋势中，测量平台上的帖子中标记的计数。鉴于StackoverFlow的大小，这是语言流行度的一个很好的指标。\n  虽然r在过去几年中一直是催化，但许多其他语言都在稳步下降，Python的增长似乎是不可阻挡的。近14％的Stackoverflow问题被标记为“Python”，趋势正在上升。而且有几个原因。\n  蟒蛇自九十年代以来一直存在。这不仅意味着它有足够的时间来增长。它还获得了一个大型和支持的社区。\n 因此，如果您在Python编码时有任何问题，则可能会使用单个Google搜索来解决它。只是因为有人已经遇到了你的问题并写了一些有帮助的东西。 \n这不仅是几十年来的事实，为程序员提供了制作辉煌教程的时间。超过这一点，Python的语法非常人性化可读。\n 对于初学者，无需指定数据类型。你只是声明一个变量; Python将从上下文中了解它是一个整数，浮点值，布尔值或其他东西。这是初学者的巨大优势。如果您曾经在C ++中编程，则会知道您的程序是多么令人沮丧，因为您将浮动为整数交换浮动。\n 如果您必须并排阅读Python和C ++代码，那么您将知道Python是如何理解的。尽管C ++的设计有英语，但与Python代码相比，它是一个相当困难的读者。\n  由于Python已经存在这么长时间，开发人员为各种目的制作了包裹。这些天，你可以找到几乎所有东西的包裹。\n 想要咬合号码，向量和矩阵？ numpy是你的家伙。想做技术和工程的计算吗？使用scipy。想要在数据操纵和分析中进行大？给熊猫去吧。想从人工智能开始吗？为什么不使用scikit-learn。\n 无论您尝试管理的哪项计算任务，机会都在那里有一个Python包。这使得Python能够在最近的发展之上，从过去几年的机器学习浪涌可以看出。\n  根据以前的详细说明，您可以想象Python将留在SH * T的顶部，以便到达。但像各种技术一样，Python有其缺点。我将逐一经历最重要的缺陷，并评估这些是否致命。 \nPython很慢。喜欢，真的很慢。平均而言，您需要更长2-10倍才能完成Python的任务，而不是任何其他语言。\n 有各种原因。其中一个是它是动态类型的 - 请记住，您不需要以其他语言指定数据类型。这意味着需要使用大量内存，因为程序需要为任何情况下工作的每个变量保留足够的空间。许多内存使用量转化为大量的计算时间。\n 另一个原因是Python一次只能执行一个任务。这是灵活的数据类型的结果 -  Python需要确保每个变量只有一个数据类型，并且并行进程可能会混淆。\n 相比之下，您的普通Web浏览器可以一次运行十几个不同的线程。还有其他一些理论。\n 但在一天结束时，没有一个速度问题。计算机和服务器已经如此便宜，我们在谈论秒数的分数。最终用户并没有真正关心它们的应用加载0.001或0.01秒。\n  最初，Python是动态范围的。这基本上意味着，为了评估表达式，编译器首先搜索当前块，然后连续地搜索所有呼叫函数。\n 动态范围的问题是需要在每个可能的上下文中测试每个表达式 - 这是乏味的。这就是为什么大多数现代编程语言使用静态范围。 \nPython试图过渡到静态范围，但搞砸了它。通常，内部范围 - 例如在函数中的函数 - 将能够看到和更改外部范围。在Python中，内幕只能看到外部范围，但不会改变它们。这导致了很多混乱。\n  尽管在Python中具有所有灵活性，但Lambdas的使用情况是相当长的。 Lambdas只能在Python中表达，而不是语句。\n 另一方面，变量声明和语句始终是语句。这意味着不能为它们使用lambdas。\n 表达式和陈述之间的这种区别相当任意，并且不会发生在其他语言中。\n   在Python中，您使用WhiteSpace和缩进来指示不同级别的代码。这使得它是光学吸引力和直观的理解。\n 其他语言，例如C ++，在括号和分号上依赖更多。虽然这可能无法视觉上吸引人，但它使代码更加可维护。对于更大的项目，这更有用。\n 哈斯克尔这样的更新语言可以解决这个问题：他们依靠空白，但为那些希望没有的人提供替代语法。 \n正如我们目睹了从桌面到智能手机的转变，很明显，我们需要强大的语言来构建移动软件。\n 但没有许多移动应用正在使用Python开发。这并不意味着它无法完成 - 有一个称为KIVY的Python包以此目的。\n 但蟒蛇不是用手机制作的。因此，即使它可能为基本任务产生可通过的结果，您的最佳选择是使用为移动应用程序开发创建的语言。一些广泛使用的移动编程框架包括反应本地，颤动，标志性和科多瓦。\n 要清楚，笔记本电脑和台式电脑应该在很多年里到来。但自机以来，由于移动已经超越了桌面流量，因此可以安全地说，学习Python不足以成为经验丰富的全圆形开发人员。\n  首先未编译Python脚本然后执行。相反，它每次执行它时都会编译，因此任何编码错误都会在运行时表现出来。这导致性能，时间消耗不佳，需要对大量测试的需求。喜欢，很多测试。\n 这对初学者来说很棒，因为测试教导了很多。但对于经验丰富的开发人员来说，必须在Python中调试一个复杂的程序使他们成为Awry。这种缺乏性能是在Python上设置时间戳的最大因素。\n   Rust提供了Python的同样的安全性 - 没有变量可能会削弱。但它解决了所有权概念和借贷的绩效问题。根据Stackoverflow Insights的数据，它也是过去几年的最受欢迎的编程语言。 \n对于像python这样的初学者来说很棒。它非常简单，维护代码更容易。有趣的观点：Go开发人员是市场上最高收入的程序员之一。\n 朱莉娅是一种非常新的语言，与Python竞争头脑。它填补了大规模技术计算的差距：通常，人们将使用Python或MATLAB，并将整个件事与C ++库修补，这是大规模所必需的。现在，人们可以使用朱莉娅而不是用两种语言玩杂耍。\n 虽然市场上有其他语言，但是，Rust，Go和Julia是修复Python弱补丁的语言。所有这些语言都在迄今为止的技术中，最重要的是在人工智能中。虽然他们的市场份额仍然很小，所以反映在StackOverflow标签的数量中，但所有这些都是清晰的：向上。\n  鉴于Python目前的无处不在的普及，它肯定会花半十年，也许是一个整体，对于任何这些新语言来代替它。\n 它将是 - 生锈，去，朱莉娅或未来新语言的哪种语言 - 此时很难说。但是，鉴于Python架构的基础的性能问题，人们将不可避免地采取现场。\n 本文是由Rhea Moutafis撰写的，最初发表在数据科学上。你可以在这里阅读它。 ", "note_en": "It took the programming community a couple of decades to appreciate Python. But since the early 2010’s, it has been booming — and eventually surpassing C, C#, Java and JavaScript in popularity.\n But until when will that trend continue? When will Python eventually be replaced by other languages, and why?\n Putting an exact expiry date on Python would be so much speculation, it might as well pass as Science-Fiction. Instead, I will assess the virtues that are boosting Python’s popularity right now, and the weak points that will break it in the future.\n   Python’s success is reflected in the  Stack Overflow trends, which measure the count of tags in posts on the platform. Given the size of StackOverflow, this is quite a good indicator for language popularity.\n  While R has been plateauing over the last few years, and many other languages are on a steady decline, Python’s growth seems unstoppable. Almost 14% of all StackOverflow questions are tagged “python”, and the trend is going up. And there are several reasons for that.\n  Python has been around since the nineties. That doesn’t only mean that it has had plenty of time to grow. It has also acquired a large and supportive community.\n So if you have any issue while you’re coding in Python, the odds are high that you’ll be able to solve it with a single Google search. Simply because somebody will have already encountered your problem and written something helpful about it.\n  It’s not only the fact that it has been around for decades, giving programmers the time to make brilliant tutorials. More than that, the syntax of Python is very human-readable.\n For starters, there’s no need to specify the data type. You just declare a variable; Python will understand from the context whether it’s an integer, a float value, a boolean or something else. This is a huge edge for beginners. If you’ve ever had to program in C++, you know how frustrating it is your program won’t compile because you swapped a float for an integer.\n And if you’ve ever had to read Python and C++ code side-by-side, you’ll know how understandable Python is. Even though C++ was designed with English in mind, it’s a rather bumpy read compared to Python code.\n  Since Python has been around for so long, developers have made a package for every purpose. These days, you can find a package for almost everything.\n Want to crunch numbers, vectors and matrices? NumPy is your guy. Want to do calculations for tech and engineering? Use SciPy. Want to go big in data manipulation and analysis? Give Pandas a go. Want to start out with Artificial Intelligence? Why not use Scikit-Learn.\n Whichever computational task you’re trying to manage, chances are that there is a Python package for it out there. This makes Python stay on top of recent developments, can be seen from the surge in Machine Learning over the past few years.\n  Based on the previous elaborations, you could imagine that Python will stay on top of sh*t for ages to come. But like every technology, Python has its weaknesses. I will go through the most important flaws, one by one, and assess whether these are fatal or not.\n  Python is slow. Like, really slow. On average, you’ll need about 2–10 times longer to complete a task with Python than with any other language.\n There are  various reasons for that. One of them is that it’s dynamically typed — remember that you don’t need to specify data types like in other languages. This means that a lot of memory needs to be used, because the program needs to reserve enough space for each variable that it works in any case. And lots of memory usage translates to lots of computing time.\n Another reason is that Python can only execute one task at a time. This is a consequence of flexible datatypes — Python needs to make sure each variable has only one datatype, and parallel processes could mess that up.\n In comparison, your average web browser can run a dozen different threads at once. And there are some other theories around, too.\n But at the end of the day, none of the speed issues matter. Computers and servers have gotten so cheap that we’re talking about fractions of seconds. And the end user doesn’t really care whether their app loads in 0.001 or 0.01 seconds.\n  Originally, Python was dynamically scoped. This basically means that, to evaluate an expression, a compiler first searches the current block and then successively all the calling functions.\n The problem with dynamic scoping is that every expression needs to be tested in every possible context — which is tedious. That’s why most modern programming languages use static scoping.\n Python tried to transition to static scoping, but messed it up. Usually, inner scopes — for example functions within functions — would be able to see and change outer scopes. In Python, inner scopes can only see outer scopes, but not change them. This leads to a lot of confusion.\n  Despite all of the flexibility within Python, the usage of Lambdas is rather restrictive. Lambdas can only be expressions in Python, and not be statements.\n On the other hand, variable declarations and statements are always statements. This means that Lambdas cannot be used for them.\n This distinction between expressions and statements is rather arbitrary, and doesn’t occur in other languages.\n   In Python, you use whitespaces and indentations to indicate different levels of code. This makes it optically appealing and intuitive to understand.\n Other languages, for example C++, rely more on braces and semicolons. While this might not be visually appealing and beginner-friendly, it makes the code a lot more maintainable. For bigger projects, this is a lot more useful.\n Newer languages like Haskell solve this problem: They rely on whitespaces, but offer an alternative syntax for those who wish to go without.\n  As we’re witnessing the shift from desktop to smartphone, it’s clear that we need robust languages to build mobile software.\n But not many mobile apps are being developed with Python. That doesn’t mean that it can’t be done — there is a Python package called Kivy for this purpose.\n But Python wasn’t made with mobile in mind. So even though it might produce passable results for basic tasks, your best bet is to use a language that was created for mobile app development. Some widely used programming frameworks for mobile include React Native, Flutter, Iconic, and Cordova.\n To be clear, laptops and desktop computers should be around for many years to come. But since mobile has long surpassed desktop traffic, it’s safe to say that learning Python is not enough to become a seasoned all-round developer.\n  A Python script isn’t compiled first and then executed. Instead, it compiles every time you execute it, so any coding error manifests itself at runtime. This leads to poor performance, time consumption, and the need for a lot of tests. Like, a lot of tests.\n This is great for beginners since testing teaches them a lot. But for seasoned developers, having to debug a complex program in Python makes them go awry. This lack of performance is the biggest factor that sets a timestamp on Python.\n   Rust offers the same kind of safety that Python has — no variable can accidentally be overwritten. But it solves the performance issue with the concept of ownership and borrowing. It is also the most-loved programming language of the last few years, according to  StackOverflow Insights.\n Go is great for beginners like Python. And it is so simple that it’s even easier to maintain the code. Fun point: Go developers are among the  highest-paid programmers on the market.\n Julia is a very new language that competes head-on with Python. It fills the gap of large-scale technical computations: Usually, one would have used Python or Matlab, and patched the whole thing up with C++ libraries, which are necessary at a large scale. Now, one can use Julia instead of juggling with two languages.\n While there are other languages on the market, Rust, Go, and Julia are the ones that fix weak patches of Python. All of these languages excel in yet-to-come technologies, most notably in Artificial Intelligence. While their market share is still small, as reflected in the number of StackOverflow tags, the trend for all of them is clear: upwards.\n  Given the ubiquitous popularity of Python at the moment, it will surely take half a decade, maybe even a whole, for any of these new languages to replace it.\n Which of the languages it will be — Rust, Go, Julia, or a new language of the future — is hard to say at this point. But given the performance issues that are fundamental in the architecture of Python, one will inevitably take its spot.\n This article was written by   Rhea Moutafis and was originally published on   Towards Data Science. You can read it   here.", "posttime": "2021-06-20 03:51:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,python,programming,未来", "title": "为什么Python不是未来的编程语言 ", "title_en": "Why Python is not the programming language of the future", "transed": 1, "url": "https://thenextweb.com/news/why-python-not-programming-language-future-syndication", "via": "", "real_tags": ["编程", "python", "未来"]}, {"category": "", "categoryclass": "", "imagename": "d5aa79d35ebd4ec3ce2eab011ec59cbb.jpg", "infoid": 1066932, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1993年，芬兰大学的媒体研究教授名叫Edward Wachtel在法国南部访问了几个着名的洞穴，包括Lascaux，Font-De-Gaume，Les Combarelles和La Pointe。他的目的：研究洞穴艺术，刚刚使这些洞穴着名。 Wachtel令他叫做什么令人困惑的是，他叫做＃34;意大利面条线＆＃34;在图纸上，部分地模糊了它们。还有两个头部的Ibex的图像，有两个头，一个带有三个树干的哺乳动物，或者叠加在鹿的绘图上的公牛绘图。\n 他的La Pelere Tour指南是当地的农民，因为这个洞穴没有电灯，而农民沿着燃气灯笼带来。当农民在洞穴内摆动灯笼时，颜色方案移位，雕刻线似乎有动画。 ＆＃34;突然，一个生物的头很清楚，＆＃34; Wachtel召回。 ＆＃34;它住了一秒钟，然后褪色为另一个似乎。＆＃34;至于那些神秘的意大利面条线，＆＃34;他们成为一个隐藏的森林或荆棘贴片，然后在内部启动动物。＆＃34;\n Wachtel随后发表了一份标题，＆＃34;第一张照片显示：洞穴艺术的电影方面，＆＃34;他得出结论，洞穴图案意味着在三维中被察觉 - 其中一个是时间。这些可能是第一个＆＃34;紫杉舟，＆＃34;他认为。\n 它的一个有趣的＆＃39;虽然必须说是武器＆＃39;思想是投机性的。绝对没有办法证明那些史前洞穴艺术家的意图，因此它是＆＃39; S不明智的是在大自然中汲取有关这些电影的强大推论，或者认为这告诉我们史前艺术家＆＃39的任何东西;时间的概念。但是，他的观点关于在史前时代创建并观看的照明条件下观看洞穴绘画的重要性是声音。\n  Wachtel＆＃39; S故事最近在Twitter螺纹中重新铺设，它不能更及时地。根据西班牙科学家团队的一支新纸张，照明来源确实将重要的线索与史前人类使用的不同方式使用洞穴使用洞穴。他们以三种不同种类的旧石器时代的照明来源进行了原位实验，希望脱落一些光线（双关语），这些照明方法可能告诉我们＆＃34的出现。人类象征和艺术行为＆＃34;以洞穴艺术的形式。\n 法国和西班牙的近350个史前洞穴，包括最古老的洞穴绘画，尚不为人所知：西班牙卡塞雷斯洞穴中的红手模具在西班牙卡克雷斯洞穴中，大约64,000年前可能被尼安德特人绘制。 （在印度尼西亚婆罗洲岛上发现了最古老的动物描绘，在印度尼西亚的婆罗洲岛上发现了40,000年。）西班牙队选择在西班牙伊斯坦特扎1洞穴的实验中进行实验，并选择特别是两个不同的空间。\n    第一个是一个大型宽腔室，带基岩墙壁，相对湿度为99.7％，平均温度为17.6摄氏度（63.6°F）。他们认为这将是A＆＃34的理想选择;住房＆＃34;对于实验，第二个空间是第二个，略微较小的腔室，其具有类似的相对湿度（99.9％）和平均温度（14.2℃，或57.5度），类似于第一空间。两个空间通过40米长（约131英尺）的粗糙通道连接。 \n西班牙研究人员根据已知的考古资料选择八个实验的照明类型：在两个空间和通道中测试的五位火炬，以及两种带有动物脂肪的石灯，以及一个小型壁炉，都在第一个空间测试。所有的火炬都是由加入在一起的干杜松分支制成的，就像阿尔德琳和重新排列的古代火炬的遗骸一样。研究人员包括一点桦木作为火种，并添加松树树脂，动物脂肪或其组合，以评估不同燃料类型的方式。\n 灯是在法国多尔多恩的La Pelte洞穴中发现的砂岩灯的复制品。他们用牛动物脂肪作为燃料，有三个杜松灯芯，布置在灯具内的圆锥形气质形状。他们还在第一室内的粘土基板上设有一个小壁炉，杜松和橡木燃料。\n 对于所有照明实验，该团队测量了照明源持续的长度（持续时间）;达到相对于人眼（照度或勒克斯）的特定表面或点的总光线;在某些方向（发光强度）发出多少照明;光源与总黑暗（动作半径）之间的最小距离;和亮度，将光强度与源的表面连接。它们还追踪每种照明源达到的最高温度。\n    这些测量结果表明，各种照明源具有非常不同的特性，因此可能用于不同的环境中。例如，木制火炬在所有方向上发出光线，高达近6米（19.6英尺），平均为41分钟。割炬表现出不均匀的光强度，并且通常需要通过从一侧到侧面挥动它们，并且它们产生了很多烟雾。因此，他们最好探索洞穴或穿过宽阔的空间。该团队还发现，添加树脂加剧了火焰，同时添加动物脂肪延长其持续时间。\n    相比之下，油脂灯发出较弱的光类似于蜡烛的强度，超过三米（9.8英尺）左右。他们始终如一地燃烧，并没有吸烟，超过一个小时，但如果这个人在移动和没有照亮地板，他们就会有令人眼花缭乱的效果。此外，＆＃34;有必要保持对灯芯的持续控制，以防止它沉入脂肪燃料中，导致火焰熄灭，＆＃34;作者写道。这使得灯更适合在更长的时间内照明小洞穴空间，补充割炬的优点。\n 至于壁炉 - 唯一真正的静态系统 - 它的照明覆盖了6.6米（21.6英尺）。然而，它只是烧掉了30分钟，脱掉了很多白烟，使其不适合使用，除非有足够强大的空气电流来分散烟雾。 ＆＃34;壁炉位置没有适当地放置在风电流中，＆＃34;作者指出，这是＆＃34;延长地下留在地下至关重要。然而，在大火灾的情况下，产生对流电流，并且它们将足够高，以疏散洞穴外的气体。＆＃34;\n 西班牙语团队还建立了一个虚拟的3D模型，其Atxurra洞穴的一部分被称为马匹的壁架。它＆＃39;是一块自然形成的平台，刚刚在一层以上，两个面板约为50个动物雕刻：野牛，山羊，马和后面，其中许多都重叠。壁架也散落着散射的木炭，岩石工具和来自三个可能的壁炉的灰烬。在虚拟模型中，他们对所有三个测试的照明源进行了空间分析。 \n建模表明，装饰面板将是＆＃34;几乎没有可感知的＆＃34;对于站在画廊下部的人，即使该人携带灯或火炬。需要从景观的顶部照亮。相比之下，壁炉似乎是战略性的，以照亮整个装饰空间。然而，火炬确实被证明是用于访问该空间的良好照明源，估计的行程时间为38.39分钟，符合火炬的持续时间。 ＆＃34;它似乎难以估计访问此空间的最佳路线被散射的木炭覆盖，肯定从Magdalenian时期使用的火炬落下;作者写道。\n 研究结果与史前电影艺术的猜测没有直接轴承。但是考古学家越多了解旧石器时代的灯光来源，我们就越能了解这些照明来源如何影响洞穴环境中的人类感知，具有对洞穴艺术的出现影响的影响。这与为什么西班牙语团队认为必须继续进行这些实验至关重要。\n ＆＃34;只有大型考古语料库，包括通过跨学科方法研究的不同类型的照明系统（和燃料），可以充分再现旧石器时代的光源，＆＃34;他们在本文中得出结论，＆＃34;我们在这一时期的旧石器时代照明点的实验，在这一时期计划人类使用的洞穴中的重要性，以及照明研究在洞穴深处的祖先进行的活动。 ＆＃34; ", "note_en": "In 1993, a media studies professor at Fordham University named Edward Wachtel visited several  famous caves in southern France, including Lascaux, Font-de-Gaume, Les Combarelles, and La Mouthe. His purpose: to study the cave art that has justly made these caves famous.  Wachtel was puzzled by what he called &#34;spaghetti lines&#34; on the drawings, partially obscuring them. There were also images of, say, an ibex with two heads, a mammal with three trunks, or a bull drawing superimposed over the drawing of a deer.\n His guide for the La Mouthe tour was a local farmer, and since there were no electric lights in this cave, the farmer brought along a gas lantern. When the farmer swung the lantern inside the cave, the color schemes shifted, and the engraved lines seemed to animate. &#34;Suddenly, the head of one creature stood out clearly,&#34; Wachtel recalled. &#34;It lived for a second, then faded as another appeared.&#34; As for those mysterious spaghetti lines, &#34;they became a forest or a bramble patch that concealed and then reveled the animals within.&#34;\n Wachtel subsequently published a paper entitled, &#34; The First Picture Show: Cinematic Aspects of Cave Art,&#34; in which  he concluded that the cave drawings were meant to be perceived in three dimensions—one of them being time. These could have been the first &#34;protomovies,&#34; he thought.\n It&#39;s an intriguing take, although it must be said that Wachtel&#39;s ideas are speculative. There is no way to definitively prove what those prehistoric cave artists intended, and therefore it&#39;s unwise to draw strong inferences about these being cinematic in nature, or to assume that this tells us anything about prehistoric artists&#39; conception of time. But his point about the importance of viewing cave paintings under the lighting conditions in which they were created and viewed in prehistoric times is sound.\n  Wachtel&#39;s story recently resurfaced in  a Twitter thread, and it couldn&#39;t be more timely. Lighting sources could indeed hold vital clues to the different ways prehistoric peoples used caves, according to  a new paper by a team of Spanish scientists, published in the journal PLOS ONE. They conducted  in situ experiments with three different kinds of Paleolithic lighting sources, in the hopes of shedding some light (pun intended) on what those various illumination methods might tell us about the emergence of &#34;human symbolic and artistic behavior&#34; in the form of cave art.\n There are nearly 350 such prehistoric caves in France and Spain alone, including the oldest cave painting yet known: a red hand stencil in Maltravieso cave in Caceres, Spain, likely drawn by a Neanderthal some 64,000 years ago. (The oldest known depiction of an animal was discovered in 2018 on the island of Borneo in Indonesia, dating back 40,000 years.) The Spanish team chose to conduct their experiments at the Isuntza 1 Cave in Spain&#39;s Basque country, and selected two distinct spaces in particular.\n    The first was a large, wide chamber with walls of bedrock, with 99.7 percent relative humidity and an average temperature of 17.6 degrees C (63.6 degrees F).  They thought it would be ideal as a &#34;staying chamber&#34; for the experiments The second space was a second, slightly smaller chamber with similar relative humidity (99.9 percent) and average temperatures (14.2 degrees C, or 57.5 degrees F) similar to the first space. The two spaces are connected by a rough passage 40 meters long (about 131 feet).\n  The Spanish researchers chose lighting types for their eight experiments based on known archaeological data: five torches tested in both spaces and the passage, as well as two stone lamps with animal fat, and a small fireplace, both tested just in the first space. All the torches were made from dry juniper branches joined together, like the remains of ancient torches found in the Aldene and Reseau Clastres caves. The researchers included a bit of birch to act as tinder, and added pine resin, animal fat, or a combination thereof to assess how well different fuel types worked.\n The lamps were replicas of a sandstone lamp found in La Mouthe Cave in Dordogne, France. They used bovine animal fat as fuel, with three juniper wicks, arranged in a teepee shape inside the lamp. They also built a small fireplace on a clay substrate in the first chamber with juniper and oak as wood fuel.\n For all the lighting experiments, the team measured how long the lighting source lasted (duration); the total amount of light reaching a specific surface or point relative to the human eye (illuminance, or lux); how much illumination was emitted in certain directions (luminous intensity); the minimum distance between the light source and total darkness (action radius); and luminance, which connects light intensity with the surface of the source. They also kept track of the highest temperature reached by each type of lighting source.\n    Those measurements showed that the various lighting sources had very different characteristics, and thus were probably used in different contexts. The wooden torches, for instance, emitted light in all directions, up to nearly six meters (19.6 feet), and lasted an average of 41 minutes. The torches exhibited uneven light intensity, and often needed to be relit by waving them from side to side, and they produced a lot smoke. So they worked best for exploring caves or crossing wide spaces. The team also found that adding resin intensified the flame, while adding animal fat extended its duration.\n    In contrast, the grease lamps emitted weaker light akin to the intensity of a candle, over a span of three meters (9.8 feet) or so. They burned consistently, and didn&#39;t smoke, for over an hour, but they had a dazzling effect if the person was moving and didn&#39;t illuminate the floor very well. Also, &#34;It was necessary to maintain constant control over the wick to prevent it from sinking into the fatty fuel, causing the flame to be extinguished,&#34; the authors wrote. This makes the lamps better suited for lighting small cave spaces over a longer period, complementing the advantages of the torches.\n As for the fireplace—the only truly static system—its illumination covered a range of 6.6 meters (21.6 feet). However, it burned for just 30 minutes and gave off a lot of white smoke, making it unsuitable for use unless there were strong enough air currents to disperse that smoke. &#34;The fireplace location was not appropriately placed regarding air currents,&#34; the authors noted, which are &#34;essential to achieving a prolonged stay underground. However, in the case of large fires, convection currents are produced, and they would be efficient enough to evacuate gases outside of the cave.&#34;\n The Spanish team also built a virtual 3D model of a section of the Atxurra cave known as the Ledge of the Horses. It&#39;s a naturally formed platform just above a passage floor, with two panels of about 50 animal engravings: bison, goats, horses, and hinds, many of them overlapping. The ledge was also littered with scattered charcoal, lithic tools, and ashes from three probable fireplaces. In the virtual model, they conducted a spatial analysis of all three tested lighting sources.\n    The modeling showed that the decorated panels would be &#34;barely perceptible&#34; to someone standing in the lower parts of the gallery, even if that person were carrying a lamp or a torch. It would need to be illuminated from the top of the ledge to be seen. In contrast, the fireplaces appeared to be strategically located to illuminate the entire decorated space. Torches did prove to be a good lighting source for accessing that space, however, with an estimated travel time of 38.39 minutes—in line with the measured duration of the torches. &#34;It does not seem by chance that the optimal routes estimated to access this space are covered with scattered charcoals, surely fallen from the torches used in the Magdalenian period,&#34; the authors wrote.\n The findings have no direct bearing on Wachtel&#39;s speculation about prehistoric cinematic art. But the more archaeologists learn about Paleolithic lighting sources, the more we will understand about how those lighting sources affect human perception in a cave environment, with implications for the emergence of cave art. That&#39;s why the Spanish team thinks it is essential to continue conducting these kinds of experiments.\n &#34;Only with a large corpus of archaeological remains, including different types of lighting systems (and fuels), studied through an interdisciplinary approach, will it be possible to adequately reproduce Paleolithic light resources,&#34; they concluded in their paper, &#34;Our experiments in Paleolithic lighting point to planning in the human use of caves in this period, and the importance of lighting studies to travel the activities carried out by our ancestors in the deep areas of caves. &#34;", "posttime": "2021-06-20 03:15:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "洞穴,recreated", "title": "考古学家重新创建了三种常见的旧石器时代洞穴照明 ", "title_en": "Archaeologists recreated three common kinds of Paleolithic cave lighting", "transed": 1, "url": "https://arstechnica.com/science/2021/06/archaeologists-recreated-three-common-kinds-of-paleolithic-cave-lighting/", "via": "", "real_tags": ["洞穴", "recreated"]}]