[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1011588, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年早些时候，我白手起家造了一台DIY笔式绘图仪。我打算发布一个构建日志，因为这是我最近从事的比较有趣的硬件项目之一。然而，它花了一段时间来写这个项目，因为，嗯，有很多事情正在进行。\n那么，为什么值得建造一台笔式绘图仪呢？简短的答案是，“它们很酷”。较长的答案是，尽管商用打印机(喷墨打印机、激光打印机等)在一般用途的打印中效果更好，但笔画图像的质量与传统打印的图像有明显的不同。插图图像对它们来说可能会有一种更自然、更自然的感觉，因为它们是通过手动升降钢笔来复制的，就像人做的那样。1个。\n我也对生成艺术有着持久的好奇心。许多围绕生成艺术(俗称#plottertwitter)建立的社区都使用笔式绘图仪将“点滴变成原子”。虽然大多数人选择购买像Axidraw这样的商业绘图仪或修复1980年代的老式绘图仪，但越来越多的人建造自己的绘图仪。\n该项目的第一步是收集物料清单(BOM)。Github项目上有一份经过充分研究的BOM。除了TIndie上出售的midTbot PCB之外，我还必须订购：\n令我惊喜的是，大多数零件都可以在网上买到-除了螺丝/螺母之外，所有的东西都可以在亚马逊上买到。\n一旦我收到MIDTBOT PCB，就有一些焊接和组装工作要做。我按照这些指示将导引开关、电源和插头针脚连接到电路板上。\nMidTbot的底盘完全是3D打印的。你需要打印的东西有7件(Github上的源文件)，它们都是相当简单的形状，所以打印很容易。\n最难打印的(通常也是项目中最挑剔的部分)是笔架，这件东西上有一些突出部分，所以配置打印机以添加支持材料是很重要的。\nPCB组装完毕，机械部件采购完毕，底盘部件打印完毕，就到了做最后组装的时候了。再一次，我遵循了Github项目的组装说明。\n组装过程很简单：将PCB拧入其中一个印刷件，将滑轮和直线杆拧入“脚”和托架块件，然后将步进电机固定到底盘上，并将PCB“夹”在底盘和电机之间。\n其中一个困难的步骤是将步进电机连接到PCB上。根据项目结构，您应该将步进电机的电线焊接到塑料引脚插座上，这样您就可以很容易地将电机从PCB上分离出来。但是，在我几次尝试将步进电机插入母插座块失败后，我简单地将母插座直接焊接到电路板上，并将步进电机导线焊接在实心跳线上。最终的结果并不像项目说明书中显示的那样干净，但仍允许我在需要时热插拔电机。2个。\n一旦绘图仪的主要“部件”组装好(如上图所示)，剩下的唯一要做的就是将同步皮带绕在滑轮上，并用少量的张力将皮带的两端连接到笔头上。\n组装的最后一步(不幸的是，整个过程中最麻烦的部分)是将笔架固定在“头”块上。使笔杆和“头”块连接的长螺丝需要仔细调整：如果螺丝太紧，那么笔可能会卡在“上”位置--当伺服退回时不会回到“下”位置。另一方面，如果螺丝太松，那么这就意味着钢笔位置上的“斜度”，这会导致无法使用的摇摆图形。\n在这一点上，机器人已经组装好了！我打开了它的电源，并根据项目说明安装了专为MidTbot设计的Grbl_Esp32固件版本。Grbl_Esp32是一款非常棒的软件：它允许您在绘图仪的Esp32控制器上上传runGcode(基本上是机器可读的如何移动笔的指令)。由于ESP32具有内置WiFi(和蓝牙)，因此它能够提供基本的Web用户界面：\nWeb UI足以完成大多数任务：定位、微小的定位调整、开始/暂停/恢复打印。只有几个任务-比如校准-需要您下拉到Grbl“命令行”。\n我花了一段时间来校准我的MidTbot。项目文档中的细节不多，所以有很多试错和故障排除。\n现在我有了一个工作正常的绘图仪机器人，接下来要做的就是试一试。当然，要做到这一点，你需要实际生成机器人可以使用的gcode。有很多工具可以做到这一点-而对gcode/绘图仪软件的全面讨论值得花一整篇文章。可以说，Drawing Bots社区页面上有各种各样的资源可以作为一个很好的起点。\n我大部分时间都在使用Inkscape的Gcodetools插件。Axidraw(制造商业笔式绘图仪)也有一些有用的Inkscape插件，尽管有些功能在midTbot上无法使用。Gcodetool通常允许您将SVG转换为Gcode，但是这是一个单调乏味的过程。并不是所有的SVG都能很好地使用它；SVG基本上已经需要成为Gcode工具的线条图，才有希望正常工作。它也有对填充区域的基本支持，但同样，您必须小心使用它-任何轻微的小故障，它都会产生无法使用的gcode。\n老实说，钢笔绘图的软件方面是工作流程中最令人沮丧的部分。我还没有找到一个很好的“艺术”工具链-&gt；Gcodesipeline，所以有很多繁琐的步骤。(在MacOS…上，Inkscape是一款二等的X11应用程序，这也无济于事。)。\n在我订购了MidTbot PCB后，创建者将我添加到了Slake组。其他一些开发MidTbots的人回馈了他们对自己的构建所做的修改。我拿了几个，也把它们添加到了我的机器人中：\n首先，我订购了更大的指形螺丝用于钢笔附件(如图所示)；原始BOM中的人员很难手工操作。其次，我打印了磁性可拆卸笔架(如图所示)，这使得添加/拆卸笔筒更容易，而不会干扰其余的设置。如果你想做多色印花，这个修改是必须的。最后，我为机器人框架打印了更宽的支架。据推测，这可以让你增加机器人的可用打印尺寸(如果你还订购了更长的线性杆)。我没有抽出时间来实际增加我的机器人的打印尺寸，但更宽的支架使机器人更稳定，更容易连接到工作台上。\n经过一个下午的校准和安装我在上面讨论过的MOD，我得到了一些我非常满意的照片。\n西尔平斯基的三角形(上图)是一条单线，但有很多错综复杂的细节。这是对步进电机精度的一次很好的锻炼，正如你所看到的，这是相当好的。精度还要求笔座正确校准，这样笔和绘图仪的主体之间就不会有任何“倾斜”。\n对于机器人来说，这是一个稍微难画的图案。线条都是直的，但也有相当数量的提笔。一般而言，打印机的向上/向下翻转周期越多，失败的可能性就越大。\n我还注意到机器人打印区的图案位置有很大的不同。笔头离机器人主底盘越近，由于“尾部”部分的配重，笔从纸上拉出的距离就越大。因此，我试着将照片放置在尽可能靠近打印区中间的位置。以下是当笔杆行为不正常时会发生的情况：\n这个情节并不完全失败，但许多线条没有画出来，或者只画了一部分。这通常是由于钢笔安装螺丝过紧，导致钢笔周期性地卡在“向上”位置。\n在我花了一些时间让自己适应机器人、它的固件和创建gcode之后，我能够让它保持相当一致--即使在aprint有大量的笔周期的情况下也是如此。我现在可以打印文本(尽管速度很慢)，而不会出现任何明显的故障或断线：\n这是一个有趣的项目！我展示了我的焊接技能，并学会了如何使用3D打印机。我对这个项目的硬件部分的结果非常满意。还有一些符合人体工程学的东西我想调整，以使绘图仪更加一致--也许可以半永久地将它贴在绘图板上，以便更容易在打印机下面对齐纸张。\n在软件方面还有相当多的工作要做，以使打印过程变得更容易。理想情况下，这是你希望能够快速迭代的东西-尝试不同的钢笔大小，对打印的图案进行轻微的调整，等等。现在，这个过程太繁琐了，不可能是一次有趣的经历。\n如果你对钢笔绘图仪和/或生殖艺术感兴趣，我建议你做一个这样的。构建过程很有趣，完成的机器人功能非常强大！\n事实证明，能够快速连接/断开步进电机非常重要，因为在校准过程中，您可能需要反转其中一个或两个电机的极性。↩︎", "note_en": "Earlier this year, I built a DIY pen plotter (mostly) from scratch. I&#39;d beenmeaning to post a build log, because this was one of the more enjoyable hardwareprojects I&#39;ve worked on recently. However, it&#39;s taken a while to write-up thisproject because, well, there was a lot of stuff going on.\n   So, why is it worth building a pen plotter? The short answer is, “they&#39;re cool”.The longer answer is that, despite commercial printers (ink jet, laser, etc.)working better for general purpose printing, the quality of a pen-plotted imageis noticeably different than something that&#39;s been traditionally printed.Plotted images can have a more natural, organic feeling to them, because they&#39;reproduced by raising and lowering a pen manually, like a human does.  1\n I&#39;ve also had a persistent curiosity with generative art. Much of the communitybuilt around generative art (colloquially, #plottertwitter) uses pen plottersto turn “bits into atoms”. While most folks opt to buy a commercial plotter likethe  Axidraw or restore vintage plotters from the 1980&#39;s,there&#39;s a growing community of people building their own plotters.\n  The first step in the project was collecting the bill of materials (BOM).There&#39;s a well-researched BOM on the project Github.Other than the midTbot PCB, which is for sale on Tindie,I had to order:\n  I was pleasantly surprised how available most of the parts were online –everything except for the screws/nuts were available on Amazon.\n Once I received my midTbot PCB, there was some soldering and assembly to do. Ifollowed these instructionsto attach the homing switches, power supply, and header pins to the board.\n  The chassis of the midTbot is entirely 3D printed. There are ~7 things that youneed to print( source files onGithub), and they&#39;re all fairly simple shapes, so the prints were easy to do.\n  The hardest thing to print (and the most finicky part of the project in general)was the pen mount.This piece has some overhangs on it, so it was important to configure theprinter to add support material.\n  With the PCB assembled, mechanical parts purchased, and chassis pieces printed,it was time to do the final assembly. Again, I followed the assembly instructionson the project Github.\n The assembly process was straightforward: the PCB gets screwed into one of theprinted pieces, the pulleys and linear rods get screwed in to the “feet” andcarriage block pieces, and the stepper motors are secured to the chassis withthe PCB “sandwiched” in between the chassis and the motors.\n One difficult step was attaching the stepper motors to the PCB. Per the projectinstructions, you&#39;re supposed to solder the stepper motor wires into plastic pin sockets, so you can easilydetach the motors from the PCB. But, after I tried and failed several times tosolder the stepper motors into the female socket block, I simply soldered thefemale sockets to the board directly and soldered the stepper motor wires ontosolid-core jumper wires. The end result wasn&#39;t as clean as what&#39;s shown in theproject instructions, but still allowed me to hot-swap the motors if needed.  2\n  Once the main “chunk” of the plotter was assembled (pictured above), the onlythings left to do were to thread the timing belt around the pulleys, and attachboth ends of the belt to the pen head with a small amount of tension.\n  The last step in assembly (and, unfortunately the most fiddly part of the wholeprocess) was attaching the pen holder to the “head” block. The long screw thatmakes the joint between the pen holder and “head” block needs to be tunedmeticulously: If the screw is too tight, then the pen can get stuck in the “up”position – not returning to the “down” position when the servo retracts. On theother hand, if the screw is too loose, then this translates to “slop” in thepen&#39;s position, which results in wiggly drawings that are unusable.\n  At this point, the bot was assembled! I powered it on and installed a specificversion of the  Grbl_Esp32 firmwaredesigned for the midTbot per the project instructions.Grbl_Esp32 is a really nifty piece of software: it allows you to upload an runGcode (basically, machine readable instructions for how to move the pen) on theplotter&#39;s Esp32 controller. Since the Esp32 has built-in wifi (and bluetooth),its able to serve a basic web UI:\n  The Web UI is sufficient for most tasks: homing, minor positioning adjustments,starting/pausing/resuming prints. There are only a few tasks – like calibration– that require you to drop down to the Grbl “command line”.\n It took me a while to get my midTbot calibrated. The project documentation was abit light on the specifics, so there was a lot of trial-and-error andtroubleshooting.\n  Now that I had a functioning plotter bot, the next thing to do was try it out.Of course, to do so you need to actually produce Gcode that the bot can use.There are tons of tools to do this – and a full discussion of Gcode/plottersoftware is worth a whole other post. Suffice it to say, there are a variety ofresources on the  Drawing Botscommunity page that serve as a good starting point.\n I spent most of my time working with  Inkscape‘sGcodetools plugin. Axidraw (which makes a commercial pen plotter) also has someuseful Inkscape plugins,although some of the functionality won&#39;t work with the midTbot. Gcodetoolsnominally allows you to translate SVGs to Gcode, however this is a tediousprocess.  Not just any SVG will work well with it; the SVG basically alreadyneeds to be a line drawing for Gcodetools to have any hope of working correctly.It has basic support for infilled regions too, but again you have to be carefulwith it – any slight hiccup, and it produces unusable Gcode.\n To be honest, the software aspect of pen plotting is the most frustrating partof the workflow. I haven&#39;t yet found a great toolchain for the “art” -&gt; Gcodepipeline, so there&#39;s a lot of finicky steps. (It doesn&#39;t help that Inkscape is asecond-class X11 app on macOS…)\n  After I ordered a midTbot PCB, the creator added me to a Slack group. Some ofthe other folks who&#39;d built midTbots contributed back modifications they&#39;d madeto their builds. I took a couple of these and added them to my bot too:\n  First, I ordered heftier thumb screws for the pen attachment (as pictured); thescrews in the original BOM are tricky to manipulate by hand. Second, I printed amagnetic detachable pen holder (as pictured) which makes it easier to add/removepens without disturbing the rest of the setup. If you want to do multicolorprints, this modification is a must. Finally, I printed wider supports for thebots frame. Supposedly, this allows you to increase the available print size ofthe bot (if you also order longer linear rods). I didn&#39;t get around to actuallyincreasing my bot&#39;s print size, but the wider supports made the bot more stable,and easier to attach to a work table.\n  After an afternoon of calibrating the bot and installing the mods I discussedabove, I got some prints that I&#39;m pretty happy with.\n  Sierpinski&#39;s triangle (above) is a single line, but has a lot of intricatedetail. This is a good exercise of the precision of the stepper motors, which asyou can see is quite good. The precision also requires the pen mount to becalibrated correctly, so that there isn&#39;t any “slop” between the pen and thebody of the plotter.\n  This was a slightly harder pattern for the bot to draw. The lines are allstraight, but there are a fair number of pen raises. Generally, the more penup/down cycles a print has, the greater the likelihood of failure.\n I&#39;ve also noticed that  where the pattern is in the print area of the bot makesa difference. The closer the pen head is to the main bot chassis, the more thepen is pulled away from the paper due to the counterweight of the “tail”section. As such, I tried to position the prints as close to the middle of theprint area as possible. Below is what happens when the pen holder misbehaves:\n  The plot isn&#39;t a complete failure, but many of the lines don&#39;t get drawn or onlyget partially drawn. This is often caused by the pen mount screw being tootight, causing the pen to get stuck in the “up” position periodically.\n After I&#39;d spent some time acclimating myself to the bot, its firmware, andcreating Gcode, I was able to get it to be pretty consistent – even when aprint had a large number of pen cycles. I&#39;m at the point where I can have itprint text (albeit quite slowly) without any noticeable glitching or brokenlines:\n   This was a fun project! I flexed my soldering skills and learned how to use a 3Dprinter. I&#39;m very happy with how the hardware portion of this project turnedout. There are still a few ergonomic things I&#39;d like to adjust to make theplotter more consistent – perhaps affixing it semi-permanently to a drawing matto make it easier to align paper under the printer.\n There&#39;s still quite a bit of work on the software front to make the printingprocess easier. Ideally, this is something that you&#39;d want to be able to iteratequickly on – trying different pen sizes, making slight adjustments to theprinted pattern, et cetera. Right now, the process is too fiddly for that to bea fun experience.\n I&#39;d recommend building one of these if you&#39;re interested in pen plotters and/orgenerative art. The build process was fun, and the completed bot is quitefunctional!\n   It turns out that having the ability to connect/disconnect the steppermotors quickly is important, as in the calibration process you may need toreverse the polarity of one or both of the motors.  ↩︎", "posttime": "2020-07-14 02:50:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diy,打印", "title": "构建DIY笔式绘图仪：MidTbot", "title_en": "Building a DIY Pen Plotter: MidTbot", "transed": 1, "url": "https://benjamincongdon.me/blog/2020/07/12/Building-a-DIY-Pen-Plotter-midTbot/", "via": "", "real_tags": ["diy", "打印"]}, {"category": "", "categoryclass": "", "imagename": "4d8f7fb3aa7a46aaaf49c2063aca8438.png", "infoid": 1011587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在.NET Core的以前版本中，我已经在博客中介绍了在该版本中发现的重大性能改进。对于每个帖子，从.NET Core2.0到.NET Core2.1再到.NET Core3.0，我发现自己有越来越多的东西要谈。然而，有趣的是，每次之后，我也发现自己在想，下一次是否有足够的有意义的改进来保证另一个职位。既然.NET5已经发布了预览版，我可以肯定地说，答案再一次是“是的”。.NET5已经看到了大量的性能改进，尽管它直到今年秋天才计划最终发布，而且到那时很可能会有更多的改进，我想强调一下现在已经可以使用的一些改进。在这篇文章中，我将重点介绍大约250个Pull请求，这些请求为.NET 5带来了无数的性能改进。\nBenchmark.NET现在是衡量.NET代码性能的标准工具，使分析代码片段的吞吐量和分配变得简单。因此，我在这篇文章中的大多数示例都是使用使用该工具编写的微基准进行测量的。为了便于在家中跟踪(对于我们中的许多人来说，现在确实是这样)，我首先创建了一个目录，并使用dotnet工具将其搭建起来：\n&lt；Project SDK=&#34；Microsoft.NET.Sdk&34；&gt；&lt；PropertyGroup&gt；&lt；OutputType&gt；exe&lt；/OutputType&gt；&lt；AllowUnsafeBlock&gt；true&lt；/AllowUnsafeBlock&gt；&lt；ServerGarbageCollection&gt；true&lt；/Server。PackageReference包括=&#34；Benchmark dotnet&#34；Version=&#34；0.12.1&#34；/&&gt;&lt；/ItemGroup&gt；&lt；ItemGroup条件=&#34；&#39；$(TargetFramework)&#39；=&#39；net48&#39；&34；&gt；&lt；PackageReference Include=&&#34；System.Memory&34；PackageReference包括=&#34；System.Text.Json&#34；Version=&#34；4.7.2&#34；/&gt；&lt；参考包括=&#34；System.Net.Http&#34；/&gt；&lt；/ItemGroup&gt；&lt；/项目&gt；\n这让我可以针对.NET Framework4.8、.NET Core3.1和.NET5执行基准测试(我目前安装了针对Preview 8的夜间构建)。.csproj还引用了Benchmark.NET NuGet包(其最新版本是版本12.1)，以便能够使用它的功能，然后引用其他几个库和包，特别是为了支持在.NET Framework 4.8上运行测试。\n然后，我更新了同一文件夹中生成的Program.cs文件，如下所示：\n使用BenchmarkDotNet。属性；使用BenchmarkDotNet。诊断程序；使用BenchmarkDotNet。运行；使用系统；使用系统。缓冲器。文本；使用系统。集合；使用系统。收藏品。并发；使用系统。收藏品。通用的；使用系统的。收藏品。不可变的；使用系统的。IO；使用系统。linq；使用系统。NET；使用系统。NET。HTTP；使用系统。NET。安全；使用系统。NET。套接字；使用系统。运行时。CompilerServices；使用系统。线程；使用系统。穿线。任务；使用系统。文本；使用系统。文本。JSON；使用系统。文本。RegularExpressions；[MemoryDiagnoser]公共类Program{static void main(string[]args)=&gt；BenchmarkSwitcher。FromAssemblies(new[]{typeof(Program)。组件})。Run(Args)；//此处显示基准}。\n对于每个测试，我将每个示例中显示的基准代码复制/粘贴到它显示&#34；//基准在这里&#34；的位置。\n使用.NET Framework4.8外围应用(这是所有三个目标的最低公分母，因此适用于所有目标)构建基准。\n针对.NET Framework 4.8、.NET Core 3.1和.NET 5中的每一个运行基准测试。\n将来自所有基准测试的所有结果的输出结合在一起，并在运行结束时显示(而不是散布在整个过程中)。\n在某些特定目标不存在有问题的API的情况下，我只是省略了命令行的这一部分。\n我上一篇基准测试帖子是关于.NET Core3.0的。我没有写一篇关于.NET Core3.1的文章，因为从运行时和核心库的角度来看，与几个月前发布的前身相比，它的改进相对较少。然而，也有一些改进，在某些情况下，我们已经将针对.NET 5所做的改进重新移植到.NET Core 3.1中，这些更改被认为影响足够大，有理由添加到长期支持(LTS)版本中。因此，我在这里的所有比较都是与最新的.NET Core3.1服务版本(3.1.5)进行比较，而不是与.NET Core3.0进行比较。\n由于比较的是.NET5和.NET Core3.1，而且.NET Core3.1不包括mono运行时，所以我没有介绍对mono所做的改进，以及专门针对“Blazor”的核心库改进。因此，当我提到“运行时”时，我指的是coreclr，尽管在.NET5的保护伞下有多个运行时，而且所有的运行时都得到了改进。\n我的大多数示例都运行在Windows上，因为我还希望能够与.NET Framework4.8进行比较。但是，除非另有说明，否则所示的所有示例都同样适用于Windows、Linux和MacOS。\n标准警告：这里的所有测量数据都在我的台式机上，您的里程数可能会有所不同。微基准测试可能对许多因素非常敏感，包括处理器数量、处理器体系结构、内存和高速缓存速度等等。不过，总的来说，我关注的是性能改进，并包含了通常应能承受任何此类差异的示例。\n对于任何对.NET和性能感兴趣的人来说，垃圾回收通常是他们的头等大事。在减少分配上花费了大量精力，这不是因为分配操作本身特别昂贵，而是因为通过垃圾收集器(GC)进行分配后的后续清理成本。然而，无论在减少分配方面投入多少工作，绝大多数工作负载都会产生分配，因此不断突破GC能够完成的任务范围和速度是很重要的。\n此版本在改进GC方面做了大量工作。例如，dotnet/coreclr#25986为GC的“标记”阶段实现了一种形式的工作窃取。.NET GC是一个“跟踪”收集器，这意味着(在非常高的级别上)当它运行时，它从一组“根”(本质上可访问的已知位置，如静态字段)开始，并从一个对象遍历到另一个对象，将每个对象“标记”为可访问的；在所有这样的遍历之后，任何未标记的对象都是不可访问的，并且可以被收集。此标记占执行集合所用时间的很大一部分，并且此PR通过更好地平衡集合中涉及的每个线程执行的工作来提高标记性能。当使用“Server GC”运行时，集合中涉及每个核心的一个线程，当线程完成其分配的标记工作部分时，它们现在能够从其他线程“窃取”未完成的工作，以帮助整个集合更快地完成。\n作为另一个例子，dotnet/Runtime#35896优化了“临时”段上的分解(Gen0和Gen1被称为“临时”，因为它们是预期只会持续很短时间的对象)。释放是指在该段上的最后一个活动对象之后的段末尾将内存页交还给操作系统的行为。因此，GC面临的问题是，这种取消应该在什么时候发生，以及在任何时间点上应该取消多少，因为在不久的将来的某个时候，GC可能最终需要分配额外的页面来进行额外的分配。\n或者以dotnet/Runtime#32795为例，它通过减少GC的静态扫描中涉及的锁争用，提高了GC在内核计数较高的机器上的可伸缩性。或者dotnet/Runtime#37894，它避免了代价高昂的内存重置(实质上是告诉操作系统相关的内存不再有用)，除非GC发现它处于内存不足的情况。或者dotnet/runtime#37159，它(虽然还没有合并，但预计将用于.NET5)构建在@DamageBoy工作的基础上，以向量化GC中使用的排序。或者dotnet/coreclr#27729，它减少了GC挂起线程所需的时间，这是获得稳定视图所必需的，这样它就可以准确地确定正在使用哪些线程。\n这只是为改进GC本身所做的更改的一部分，但最后一项将我带到一个特别吸引我的主题，因为它说明了我们近年来在.NET中所做的大量工作。在此版本中，我们继续甚至加速了将coreclr运行时中的本机实现从C/C++移植到System.Private.Corelib中的普通C#托管代码的过程。这样做有很多好处，包括使我们更容易跨多个运行时(如coreclr和mono)共享单个实现，甚至使我们更容易发展API外围应用，例如通过重用相同的逻辑来处理数组和跨区。但有一件事让一些人大吃一惊，那就是这样的好处还包括多方面的性能。一种这样的方式让人回想起使用托管运行库的最初动机之一：安全性。默认情况下，用C#编写的代码是“安全的”，因为运行库确保所有内存访问都经过边界检查，并且只能通过代码中可见的显式操作(例如，使用unsafe关键字、Marshal类、unsafe类等)。开发人员是否能够删除此类验证。因此，作为开放源码项目的维护者，当贡献以托管代码的形式出现时，我们交付安全系统的工作就变得容易得多：虽然这样的代码当然可以包含可能通过代码审查和自动化测试的错误，但我们可以在晚上睡得更好，因为知道这样的错误引入安全问题的可能性大大降低了。这反过来意味着我们更有可能以更快的速度接受对托管代码的改进，贡献者提供的速度更快，我们帮助验证的速度也更快。我们还发现，当性能以C#而不是C的形式出现时，有更多的贡献者对探索性能改进感兴趣，更多的人以更快的速度进行更多的实验，可以获得更好的性能。\n然而，我们已经从这样的移植中看到了更直接的性能改进形式。托管代码调入运行库所需的开销相对较少，但当频繁进行此类调用时，这样的开销会累积起来。考虑一下dotnet/coreclr#27700，它将基元类型数组排序的实现从coreclr中的本机代码移到了Corelib中的C#中。除了为新的公共API提供支持以对范围进行排序的代码之外，它还降低了对较小数组进行排序的成本，在这些数组中，这样做的成本主要由从托管代码过渡而来。我们\n使用系统；使用系统。诊断；使用系统。线程；类Program{public static void main(){new Thread(()=&gt；{var a=new int[20]；while(True)Array。排序(A)；}){IsBackground=true}。start()；var sw=new stopwatch()；while(True){sw.。Restart()；for(int i=0；i&lt；10；i++){gc。收集()；穿线。睡眠(15)；}控制台。WriteLine(软件。已经过去了。TotalSeconds)；}。\n这是在旋转一个线程，该线程位于一个紧密的循环中，反复对一个小数组进行排序，而在主线程上，它执行10个GC，每个GC之间的间隔大约为15毫秒。因此，我们预计这个循环需要150毫秒多一点的时间。但是当我在.NET Core 3.1上运行它时，我得到的秒数如下所示：\n在这里，GC很难中断执行排序的线程，从而导致GC暂停时间比期望的要高得多。值得庆幸的是，当我在.NET5上运行它时，我得到的数字如下所示：\n这正是我们预测的结果。通过将Array.Sort实现移动到托管代码中，运行时可以在需要时更容易地挂起该实现，我们已经使GC能够更好地完成其工作。\n这不仅限于数组。当然，排序。一批PR执行这样的移植，例如dotnet/runtime#32722将stdelemref和ldelemaref JIT帮助器移动到C#，dotnet/runtime#32353将解箱帮助器的一部分移动到C#(并用适当的GC轮询位置检测其余部分，使GC在其余部分适当挂起)，dotnet/coreclr#27603/dotnet/coreclr#27634/dotnet/coreclr#27123/dotnet/coreclr。和dotnet/coreclr#27792将Enum.CompareTo移动到C#。其中一些更改随后实现了收益，例如使用dotnet/runtime#32342和dotnet/runtime#35733，它们利用Buffer.Memmove中的改进在各种字符串和数组方法中实现了额外的收益。\n作为这组更改的最后一个想法，需要注意的另一件有趣的事情是，一个版本中所做的微优化可能是基于后来无效的假设，并且在使用这种微优化时，需要做好准备并愿意适应。在我的.NETCore3.0博客文章中，我提到了像dotnet/coreclr#21756这样的“花生酱”更改，它将许多调用点从使用Array.Copy(source，Destination，Length)改为使用Array.Copy(source，source Offset，Destination，DestinationOffset，Length)，因为前者获得源和目标数组的下限所涉及的开销是可测量的。但是，通过前面提到的将数组处理代码转移到C#的更改，更简单的过载开销消失了，使其成为这些操作的更简单、更快速的选择。因此，对于.NET5PR，dotnet/coreclr#27641和dotnet/corefx#42343将所有这些调用点都切换回使用更简单的重载。Dotnet/Runtime#36304是另一个撤销先前优化的例子，因为更改使它们过时或实际上有害。您总是能够将单个字符传递给String.Split，例如version.Split(&#39；.&#39；)。然而，问题是它可以绑定到的唯一Split重载是Split(params char[]分隔符)，这意味着每次这样的调用都会导致C#编译器生成char[]分配。为了解决这个问题，以前的版本添加了缓存，提前分配数组并将它们存储到静态中，然后拆分调用可以使用它们来避免每次调用的char[]。既然.NET中有一个Split(字符分隔符，StringSplitOptions Options=StringSplitOptions.None)重载，我们就不再需要该数组了。\n作为最后一个示例，我展示了将代码移出运行库并移入托管代码如何有助于GC暂停，当然，保留在运行库中的代码还有其他方式可以帮助实现这一点。dotnet/Runtime#36179通过确保运行时处于抢占模式(例如获取“Watson”存储桶参数(基本上是用于报告目的的唯一标识此特定异常和调用堆栈的一组数据))，减少了由于异常处理而导致的GC暂停。\n对于即时(JIT)编译器来说，.NET5也是一个令人兴奋的版本，在这个发行版中有很多各种方式的改进。与任何编译器一样，对JIT所做的改进可以产生广泛的影响。通常，单个更改对单个代码片段的影响很小，但是这样的更改会被它们所应用的位置的绝对数量放大。\n可以添加到JIT的优化几乎是无限的，如果有无限的时间来运行这些优化，JIT可以为任何给定的场景创建最优的代码。但是JIT并没有无限的时间。JIT的“即时”特性意味着它在应用程序运行时执行编译：当调用尚未编译的方法时，JIT需要按需为其提供汇编代码。这意味着线程在编译完成之前不能继续前进，这反过来又意味着JIT在应用什么优化以及如何使用其有限的时间预算方面需要有战略眼光。使用各种技术来给JIT更多的时间，比如在应用程序的某些部分使用“提前”编译(AOT)，以便在应用程序执行之前尽可能多地完成编译工作(例如，核心库都是使用名为“ReadyToRun”的技术进行AOT编译的，您可能会听到这种技术被称为“R2R”，甚至是“CrossGen”，它是生成这些图像的工具)，或者使用“分层编译”，这允许JIT最初。并且只需要花费更多的时间重新编译，并进行更多的优化。\n.", "note_en": "In previous releases of .NET Core, I’ve blogged about the significant performance improvements that found their way into the release. For each post, from  .NET Core 2.0 to  .NET Core 2.1 to  .NET Core 3.0, I found myself having more and more to talk about. Yet interestingly, after each I also found myself wondering whether there’d be enough meaningful improvements next time to warrant another post. Now that .NET 5 is shipping preview releases, I can definitively say the answer is, again, “yes”. .NET 5 has already seen a wealth of performance improvements, and even though it’s not scheduled for final release until  this fall and there’s very likely to be a lot more improvements that find their way in by then, I wanted to highlight a bunch of the improvements that are already available now. In this post, I’ll highlight ~250 pull requests that have contributed to myriad of performance improvements across .NET 5.\n  Benchmark.NET is now the canonical tool for measuring the performance of .NET code, making it simple to analyze the throughput and allocation of code snippets. As such, the majority of my examples in this post are measured using microbenchmarks written using that tool. To make it easy to follow-along at home (literally for many of us these days), I started by creating a directory and using the  dotnet tool to scaffold it:\n   &lt; Project  Sdk=  &#34;Microsoft.NET.Sdk &#34;&gt; &lt; PropertyGroup&gt; &lt; OutputType&gt;Exe&lt;/ OutputType&gt; &lt; AllowUnsafeBlocks&gt;true&lt;/ AllowUnsafeBlocks&gt; &lt; ServerGarbageCollection&gt;true&lt;/ ServerGarbageCollection&gt; &lt; TargetFrameworks&gt;net5.0;netcoreapp3.1;net48&lt;/ TargetFrameworks&gt; &lt;/ PropertyGroup&gt; &lt; ItemGroup&gt; &lt; PackageReference  Include=  &#34;benchmarkdotnet &#34;  Version=  &#34;0.12.1 &#34; /&gt; &lt;/ ItemGroup&gt; &lt; ItemGroup  Condition=  &#34; &#39;$(TargetFramework)&#39; == &#39;net48&#39;  &#34;&gt; &lt; PackageReference  Include=  &#34;System.Memory &#34;  Version=  &#34;4.5.4 &#34; /&gt; &lt; PackageReference  Include=  &#34;System.Text.Json &#34;  Version=  &#34;4.7.2 &#34; /&gt; &lt; Reference  Include=  &#34;System.Net.Http &#34; /&gt; &lt;/ ItemGroup&gt;&lt;/ Project&gt;\n This lets me execute the benchmarks against .NET Framework 4.8, .NET Core 3.1, and .NET 5 (I currently have a  nightly build installed for Preview 8). The .csproj also references the  Benchmark.NET NuGet package (the latest release of which is version 12.1) in order to be able to use its features, and then references several other libraries and packages, specifically in support of being able to run tests on .NET Framework 4.8.\n Then, I updated the generated Program.cs file in the same folder to look like this:\n using  BenchmarkDotNet. Attributes; using  BenchmarkDotNet. Diagnosers; using  BenchmarkDotNet. Running; using  System; using  System. Buffers. Text; using  System. Collections; using  System. Collections. Concurrent; using  System. Collections. Generic; using  System. Collections. Immutable; using  System. IO; using  System. Linq; using  System. Net; using  System. Net. Http; using  System. Net. Security; using  System. Net. Sockets; using  System. Runtime. CompilerServices; using  System. Threading; using  System. Threading. Tasks; using  System. Text; using  System. Text. Json; using  System. Text. RegularExpressions;[ MemoryDiagnoser] public  class  Program{  static  void  Main( string[]  args)  =&gt;  BenchmarkSwitcher. FromAssemblies( new[] {  typeof( Program). Assembly }). Run( args);   // BENCHMARKS GO HERE}\n and for each test, I copy/paste the benchmark code shown in each example to where it shows  &#34;// BENCHMARKS GO HERE&#34;.\n    Build the benchmarks using the .NET Framework 4.8 surface area (which is the lowest-common denominator of all three targets and thus works for all of them).\n Run the benchmarks against each of .NET Framework 4.8, .NET Core 3.1, and .NET 5.\n  Join the output together from all results from all benchmarks and display that at the end of the run (rather than interspersed throughout).\n In some cases where the API in question doesn’t exist for a particular target, I just leave off that part of the command-line.\n  My  last benchmarks post was about .NET Core 3.0. I didn’t write one about .NET Core 3.1 because, from a runtime and core libraries perspective, it saw relatively few improvements over its predecessor released just a few months prior. However, there were some improvements, on top of which in some cases we’ve already back-ported improvements made for .NET 5 back to .NET Core 3.1, where the changes were deemed impactful enough to warrant being added to the Long Term Support (LTS) release. As such, all of my comparisons here are against the latest .NET Core 3.1 servicing release (3.1.5) rather than against .NET Core 3.0.\n As the comparisons are about .NET 5 vs .NET Core 3.1, and as .NET Core 3.1 didn’t include the mono runtime, I’ve refrained from covering improvements made to mono, as well as to core library improvements specifically focused on  “Blazor”. Thus when I refer to “the runtime”, I’m referring to coreclr, even though as of .NET 5 there are multiple runtimes under its umbrella, and all of them have been improved.\n Most of my examples were run on Windows, because I wanted to be able to compare against .NET Framework 4.8 as well. However, unless otherwise mentioned, all of the examples shown accrue equally to Windows, Linux, and macOS.\n The standard caveat: all measurements here are on my desktop machine, and your mileage may vary. Microbenchmarks can be very sensitive to any number of factors, including processor count, processor architecture, memory and cache speeds, and on and on. However, in general I’ve focused on performance improvements and included examples that should generally withstand any such differences.\n   For anyone interested in .NET and performance, garbage collection is frequently top of mind. Lots of effort goes into reducing allocation, not because the act of allocating is itself particularly expensive, but because of the follow-on costs in cleaning up after those allocations via the garbage collector (GC). No matter how much work goes into reducing allocations, however, the vast majority of workloads will incur them, and thus it’s important to continually push the boundaries of what the GC is able to accomplish, and how quickly.\n This release has seen a lot of effort go into improving the GC. For example,  dotnet/coreclr#25986 implements a form of work stealing for the “mark” phase of the GC. The .NET GC is a  “tracing” collector, meaning that (at a very high level) when it runs it starts from a set of “roots” (known locations that are inherently reachable, such as a static field) and traverses from object to object, “marking” each as being reachable; after all such traversals, any objects not marked are unreachable and can be collected. This marking represents a significant portion of the time spent performing collections, and this PR improves marking performance by better balancing the work performed by each thread involved in the collection. When running with the “Server GC”, a thread per core is involved in collections, and as threads finish their allotted portions of the marking work, they’re now able to “steal” undone work from other threads in order to help the overall collection complete more quickly.\n As another example,  dotnet/runtime#35896 optimizes decommits on the “ephemeral” segment (gen0 and gen1 are referred to as “ephemeral” because they’re objects expected to last for only a short time). Decommitting is the act of giving pages of memory back to the operating system at the end of segments after the last live object on that segment. The question for the GC then becomes, when should such decommits happen, and how much should it decommit at any point in time, given that it may end up needing to allocate additional pages for additional allocations at some point in the near future.\n Or take  dotnet/runtime#32795, which improves the GC’s scalability on machines with higher core counts by reducing lock contention involved in the GC’s scanning of statics. Or  dotnet/runtime#37894, which avoids costly memory resets (essentially telling the OS that the relevant memory is no longer interesting) unless the GC sees it’s in a low-memory situation. Or  dotnet/runtime#37159, which (although not yet merged, is expected to be for .NET 5) builds on the work of  @damageboy to vectorize sorting employed in the GC. Or  dotnet/coreclr#27729, which reduces the time it takes for the GC to suspend threads, something that’s necessary in order for it to get a stable view so that it can accurately determine which are being used.\n This is only a partial list of changes made to improve the GC itself, but that last bullet brings me to a topic of particular fascination for me, as it speaks to a lot of the work we’ve done in .NET in recent years. In this release, we’ve continued, and even accelerated, the process of porting native implementations in the coreclr runtime from C/C++ to instead be normal C# managed code in System.Private.Corelib. Such a move has a plethora of benefits, including making it much easier for us to share a single implementation across multiple runtimes (like coreclr and mono), and even making it easier for us to evolve API surface area, such as by reusing the same logic to handle both arrays and spans. But one thing that takes some folks by surprise is that such benefits also include performance, in multiple ways. One such way harkens back to one of the original motivations for using a managed runtime: safety. By default, code written in C# is “safe”, in that the runtime ensures all memory accesses are bounds checked, and only by explicit action visible in the code (e.g. using the  unsafe keyword, the  Marshal class, the  Unsafe class, etc.) is a developer able to remove such validation. As a result, as maintainers of an open source project, our job of shipping a secure system is made significantly easier when contributions come in the form of managed code: while such code can of course contain bugs that might slip through code reviews and automated testing, we can sleep better at night knowing that the chances for such bugs to introduce security problems are drastically reduced. That in turn means we’re more likely to accept improvements to managed code and at a higher velocity, with it being faster for a contributor to provide and faster for us to help validate. We’ve also found a larger number of contributors interested in exploring performance improvements when it comes in the form of C# rather than C. And more experimentation from more people progressing at a faster rate yields better performance.\n There are, however, more direct forms of performance improvements we’ve seen from such porting. There is a relatively small amount of overhead required for managed code to call into the runtime, but when such calls are made at high frequency, such overhead adds up. Consider  dotnet/coreclr#27700, which moved the implementation of the sorting of arrays of primitive types out of native code in coreclr and up into C# in Corelib. In addition to that code then powering new public APIs for sorting spans, it also made it cheaper to sort smaller arrays where the cost of doing so is dominated by the transition from managed code. We can see this with a small benchmark, which is just using  Array.Sort to sort  int[],  double[], and  string[] arrays of 10 items:\n public  class  DoubleSorting :  Sorting&lt; double&gt; {  protected  override  double  GetNext()  =&gt;  _random. Next(); } public  class  Int32Sorting :  Sorting&lt; int&gt; {  protected  override  int  GetNext()  =&gt;  _random. Next(); } public  class  StringSorting :  Sorting&lt; string&gt;{  protected  override  string  GetNext() {  var  dest  =  new  char[ _random. Next( 1,  5)];  for ( int  i  =  0;  i  &lt;  dest. Length;  i ++)  dest[ i]  = ( char)( &#39;a&#39;  +  _random. Next( 26));  return  new  string( dest); }} public  abstract  class  Sorting&lt; T&gt;{  protected  Random  _random;  private  T[]  _orig,  _array; [ Params( 10)]  public  int  Size {  get;  set; }  protected  abstract  T  GetNext(); [ GlobalSetup]  public  void  Setup() {  _random  =  new  Random( 42);  _orig  =  Enumerable. Range( 0,  Size). Select( _  =&gt;  GetNext()). ToArray();  _array  = ( T[]) _orig. Clone();  Array. Sort( _array); } [ Benchmark]  public  void  Random() {  _orig. AsSpan(). CopyTo( _array);  Array. Sort( _array); }}\n  This in and of itself is a nice benefit of the move, as is the fact that in .NET 5 via  dotnet/runtime#37630 we also added  System.Half, a new 16-bit floating-point primitive, and being in managed code, this sorting implementation’s optimizations almost immediately applied to it, whereas the previous native implementation would have required significant additional work, with no C++ standard type for  half. But, there’s an arguably even more impactful performance benefit here, and it brings us back to where I started this discussion: GC.\n One of the interesting metrics for the GC is “pause time”, which effectively means how long the GC must pause the runtime in order to perform its work. Longer pause times have a direct impact on latency, which can be a crucial metric for all manner of workloads. As alluded to earlier, the GC may need to suspend threads in order to get a consistent view of the world and to ensure that it can move objects around safely, but if a thread is currently executing C/C++ code in the runtime, the GC may need to wait until that call completes before it’s able to suspend the thread. Thus, the more work we can do in managed code instead of native code, the better off we are for GC pause times. We can use the same  Array.Sort example to see this. Consider this program:\n using  System; using  System. Diagnostics; using  System. Threading; class  Program{  public  static  void  Main() {  new  Thread(()  =&gt; {  var  a  =  new  int[ 20];  while ( true)  Array. Sort( a); }) {  IsBackground  =  true }. Start();  var  sw  =  new  Stopwatch();  while ( true) {  sw. Restart();  for ( int  i  =  0;  i  &lt;  10;  i ++) {  GC. Collect();  Thread. Sleep( 15); }  Console. WriteLine( sw. Elapsed. TotalSeconds); } }}\n This is spinning up a thread that just sits in a tight loop sorting a small array over and over, while on the main thread it performs 10 GCs, each with approximately 15 milliseconds between them. So, we’d expect that loop to take a little more than 150 milliseconds. But when I run this on .NET Core 3.1, I get numbers of seconds like this:\n  The GC has difficulty here interrupting the thread performing the sorts, causing the GC pause times to be way higher than desirable. Thankfully, when I instead run this on .NET 5, I get numbers like this:\n  which is exactly what we predicted we should get. By moving the Array.Sort implementation into managed code, where the runtime can more easily suspend the implementation when it wants to, we’ve made it possible for the GC to be much better at its job.\n This isn’t limited to just  Array.Sort, of course. A bunch of PRs performed such porting, for example  dotnet/runtime#32722 moving the  stdelemref and  ldelemaref JIT helpers to C#,  dotnet/runtime#32353 moving portions of the  unbox helper to C# (and instrumenting the rest with appropriate GC polling locations that let the GC suspend appropriately in the rest),  dotnet/coreclr#27603 /  dotnet/coreclr#27634 /  dotnet/coreclr#27123 /  dotnet/coreclr#27776 moving more array implementations like  Array.Clear and  Array.Copy to C#,  dotnet/coreclr#27216 moving more of  Buffer to C#, and  dotnet/coreclr#27792 moving  Enum.CompareTo to C#. Some of these changes then enabled subsequent gains, such as with  dotnet/runtime#32342 and  dotnet/runtime#35733, which employed the improvements in  Buffer.Memmove to achieve additional gains in various  string and  Array methods.\n As one final thought on this set of changes, another interesting thing to note is how micro-optimizations made in one release may be based on assumptions that are later invalidated, and when employing such micro-optimizations, one needs to be ready and willing to adapt. In my .NET Core 3.0 blog post, I called out “peanut butter” changes like  dotnet/coreclr#21756, which switched lots of call sites from using  Array.Copy(source, destination, length) to instead use  Array.Copy(source, sourceOffset, destination, destinationOffset, length), because the overhead involved in the former getting the lower bounds of the source and destination arrays was measurable. But with the aforementioned set of changes that moved array-processing code to C#, the simpler overload’s overheads disappeared, making it both the simpler and faster choice for these operations. And such, for .NET 5 PRs  dotnet/coreclr#27641 and  dotnet/corefx#42343 switched all of these call sites and more back to using the simpler overload.  dotnet/runtime#36304 is another example of undoing previous optimizations due to changes that made them obsolete or actually harmful. You’ve always been able to pass a single character to  String.Split, e.g.  version.Split(&#39;.&#39;). The problem, however, was the only overload of  Split that this could bind to was  Split(params char[] separator), which means that every such call resulted in the C# compiler generating a  char[] allocation. To work around that, previous releases saw caches added, allocating arrays ahead of time and storing them into statics that could then be used by  Split calls to avoid the per-call  char[]. Now that there’s a  Split(char separator, StringSplitOptions options = StringSplitOptions.None) overload in .NET, we no longer need the array at all.\n As one last example, I showed how moving code out of the runtime and into managed code can help with GC pauses, but there are of course other ways code remaining in the runtime can help with that.  dotnet/runtime#36179 reduced GC pauses due to exception handling by ensuring the runtime was in  preemptive mode around code such as getting “Watson” bucket parameters (basically, a set of data that uniquely identifies this particular exception and call stack for reporting purposes).\n  .NET 5 is an exciting version for the Just-In-Time (JIT) compiler, too, with many improvements of all manner finding their way into the release. As with any compiler, improvements made to the JIT can have wide-reaching effects. Often individual changes have a small impact on an individual piece of code, but such changes are then magnified by the sheer number of places they apply.\n There is an almost unbounded number of optimizations that can be added to the JIT, and given an unlimited amount of time to run such optimizations, the JIT could create the most optimal code for any given scenario. But the JIT doesn’t have an unbounded amount of time. The “just-in-time” nature of the JIT means it’s performing the compilation as the app runs: when a method that hasn’t yet been compiled is invoked, the JIT needs to provide the assembly code for it on-demand. That means the thread can’t make forward progress until the compilation has completed, which in turn means the JIT needs to be strategic in what optimizations it applies and how it chooses to use its limited time budget. Various techniques are used to give the JIT more time, such as using “ahead of time” compilation (AOT) on some portions of the app to do as much of the compilation work as is possible before the app is executed (for example, the core libraries are all AOT compiled using a technology named  “ReadyToRun”, which you may hear referred to as “R2R” or even “crossgen”, which is the tool that produces these images), or by using  “tiered compilation”, which allows the JIT to initially compile a method with few-to-no optimizations applied and thus be very fast in doing so, and only spend more time recompiling it with many more optimizatio\n......", "posttime": "2020-07-14 02:49:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,performance", "title": ".NET 5中的性能改进", "title_en": "Performance Improvements in .NET 5", "transed": 1, "url": "https://devblogs.microsoft.com/dotnet/performance-improvements-in-net-5/", "via": "", "real_tags": ["性能"]}, {"category": "", "categoryclass": "", "imagename": "7534afb2db69ba41e22feb3f79328c81.jpg", "infoid": 1011586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2016年推出以来，手机巨头精灵宝可梦Go的前提一直集中在户外漫游，寻找神秘的小动物。因此，这是一种特别不适合大流行引发的行动限制的游戏。\n为了弥补这一点，口袋妖怪GO开发者尼安蒂克在最近几个月推出了定期更新，使这款游戏更具检疫兼容性。这导致了许多精灵宝可梦GO场景中的游戏进入了一个新的时代。就叫它“呆在家里，玩在家里”。\n在一个许多(如果不是大多数)玩家不能或不敢旅行并聚集在一起进行惯常突袭的时代，这种对精灵宝可梦GO的玩法进行系统性的改变很可能是这款游戏生存所必需的。通过为玩家提供一种在家中玩耍的方式，尼安蒂有效地将嘲笑他们的金鹅从马路对面的公园赶走。\n一些玩家已经看到了尼安蒂克推出的变化带来的一些表面上的好处。颇受欢迎的澳大利亚围棋YouTuber ZoëTwoDots说：“从香中产卵的精灵数量之大令人难以置信。”“(有)更多来自朋友礼物、新的”每日研究“(Daily Research)的物品，而不需要旋转口袋妖怪--在这个阶段，我认为游戏中需要你外出的几乎每一个方面现在都可以在家里完成。”\n但一些人担心冠状病毒的传播对游戏的社会核心产生了影响。布兰登·谭(Brandon Tan)-从围棋在新加坡上市的第二天起就一直在下，被广泛认为是全球头号棋手-就是这样的焦虑者之一。\nTan告诉Ars：“有了COVID，我被迫要么在家玩，要么一个人在我的车里玩‘精灵宝可梦GO’。”在独自玩了几个月的游戏后，我很怀念朋友们的陪伴。\n在谭恩美看来，单独下围棋太长时间可能会导致一定程度的枯燥和无聊，无论是新手还是长期棋手都会动摇，对围棋的未来产生合理的担忧。虽然他承认尼安蒂克“肯定在尽力迎合玩家，推出可以在家里玩的赛事”，但他说，他担心这样的变化可能不足以让普通玩家保持游戏的趣味性。\n谭恩美解释说：“新玩家现在唯一的玩法就是投资游戏中的货币，然后购买一种名为”香“的物品，这样玩家就可以在家中每分钟都能遇到一个精灵精灵。”“人们还可以使用一种叫做远程突袭通行证的可购买物品来对抗健身房的突袭老板。”\nHQna是颇受欢迎的精灵宝可梦Go Subreddit the Silph Road的主持人，他认为尼安蒂实施的远程突袭选项并不出色。为了访问远程突袭，你需要购买一个特定的战斗通行证，该通行证在财务上与尼安蒂克提供给玩家的每日免费通行证以及玩家可能已经为之支付了真金白银的高级战斗通行证是分开的。\n为了最大限度地利用新的在家玩游戏的现实，精灵宝可梦Go玩家可能不得不调整他们通常的习惯。ZoëTwoDots建议说：“一定要检查商店里每周免费的或一枚硬币的盒子。”“这些盒子里有成堆的物品，这样你就可以随时抓到或碰到精灵宝可梦了。”她还提到了在游戏中保持健康的朋友列表的重要性，以便发送和接收礼物，这些礼物通常会包含让围棋在家中更容易运行的物品。\nZoëTwoDots补充说：“你也可以和这些朋友在网上进行[玩家对玩家]的战斗，这些战斗不一定是核心竞争的。”“我最喜欢的一个(自我强加的)PVP主题是用小宝贝口袋妖怪来战斗。[另外]，查看您当地的社区是否有Facebook页面或不和谐群组。使用这些平台寻找其他本地玩家进行远程突袭，或者添加为游戏中额外奖金的好友。“。\nHQna认为，与朋友战斗也有很多乐趣。“教练大战可能是整个游戏中最突出的特点之一，但现在尤其如此，因为尼安蒂克已经让它们变得更容易使用了，”他解释说。“我知道不是每个人都喜欢PvP，但我在围棋战斗联盟和当地社区组织的Silph Arena锦标赛中看到很多玩家，他们利用教练战斗来使用他们最喜欢的精灵宝可梦，只是为了好玩。”\n被隔离的玩家还通过精灵宝可梦GO的增强现实功能在游戏中发现了新的潜力，这使得精灵宝可梦通过你的智能手机摄像头出现在现实世界的背景下。\nZoëTwoDots说：“我最喜欢的游戏功能之一是Go Snapshot，也就是AR摄影模式。”“我一直在努力每周至少在家里拍两张照片。”她解释说，每个“精灵宝可梦”都有自己的一套动画来配合常规的家务，从精灵宝可梦与家庭环境互动的简单方式中获得有趣的乐趣。\n“例如，Machop是一个相当强壮的战斗精灵，”她告诉Ars。他的柔韧动画将双手放在胸前，但当他被放在装满脏盘子或肥皂水的水槽前时，看起来就像是麦克霍普在洗碗或洗手。\n“你的蛋盒里装的是什么？”它们是普通的蛋，还是藏在里面的小彩蛋？饥饿的小芒克拉斯又把所有的禁闭零食都偷走了吗？“精灵宝可梦Go”可以通过AR将你的现实与你的现实融合在一起，有很多有创意的方法，我绝对推荐你试一试，她说。\nHQNA也有同感。他解释说：“与精灵宝可梦的AR摄影有如此大的潜力，是释放所有被压抑的创意能量的一个很好的出口，因为现在有这么多玩家被限制在自己的家里。”“就我个人而言，我很喜欢看到人们想出的所有AR镜头。”自从封锁开始以来，玩家分享的AR投篮数量呈指数级增长，袋鼠出现在世界各地的厨房里。\n“钱西和孩子们一起烤煎饼，在别人的花园里围着郁金香飞来飞去，或者在任何地方懒洋洋地放松，看起来真的很酷，也有助于让游戏变得生动起来--这是我们小时候都想要的，对吗？”HQna补充道。\n谭恩美说，这种戏剧并不是他的拿手好戏。我个人不会这样做，因为我宁愿以一种高效的方式玩这个游戏，而玩AR功能无助于进步，“他解释说。\n但谭恩美表示，他也认为AR是一项充满乐趣的功能，可以为对进步超脱游戏更感兴趣的人提供很多东西。他说：“那些喜欢拍照的人，尤其是家里有精灵宝可梦的人，可能会觉得帮助他们打发时间很有趣。”\n即使与其他玩家强制分离，ZoëTwoDots认为围棋在中层COVID社会仍然是一股巨大的积极力量。她说：“我认为精灵宝可梦的一个真正特别之处就是能够将人们聚集在一起，无论是物理上的还是数字上的。”“尽管我们不能在身体上都在一起，但精灵宝可梦提供了一种与他人的数字连接，并分散了人们对现在事情可能变得多么疯狂的压力的注意力。”\n尽管谭恩美对某些观点持更加怀疑的态度，但他对此表示赞同。他告诉我：“每个月都会有新的东西推出，尼安蒂克正在推出新的活动，以迎合玩家对新内容的饥渴。”“精灵宝可梦Go不仅迎合了所有年龄段的人，从年轻到年长，而且也迎合了那些选择以不同的方式玩这个游戏的人，比如成为一名收藏家来寻找闪亮的精灵宝可梦，或者成为一名Go Battle League中的斗士。虽然现在对很多人来说玩“精灵宝可梦Go”很困难，但仍有可能在家里玩。“。\nHQNA来自社区温和的立场，能够亲自担保这一点。他解释说：“在这样的全球健康危机中，游戏的玩家和开发者都应该对自己和其他人表现出一种特别的责任感。”游戏的主要焦点是社交和户外游戏。“虽然我们都希望事情尽快恢复正常，但我希望抓住那个传奇的精灵宝可梦，或者润色季度财务报告不如拯救生命重要。”\n“我们中的许多人都是在玩主要系列游戏的过程中长大的-在里面，在我们的手持设备上，”HQna继续说。“对我来说，现在的情况只会让它更怀旧。我很感激这一点。然而，我确实期待着终于能再次见到我的当地社区，并在明年的现场活动中见到来自世界各地的令人惊叹的新人！“\n同时，ZoëTwoDots认为围棋是一种强大的媒介，通过它，人们在封锁期间仍然可以保持社区和社会感。她说：“我认为，特别是对于年轻球员来说，他们可能不知道为什么他们的世界现在正在发生如此剧烈的变化，这场比赛很大程度上分散了他们对这种焦虑的注意力。”“成年人和孩子可以通过增强现实与他们的家互动--他们在自己的家里有精灵宝可梦！\n“他们可以看YouTube视频，看到其他人也在家里玩，”她继续说。“他们可以加入Twitch Stream，直接与我们和其他社区成员交谈，以帮助减少这种孤立感。当日复一日地呆在同一个家里变得单调乏味时，我希望精灵宝可梦Go和精灵宝可梦Go社区能够为他们提供一个积极、有趣、有创意和安全的出口。“。\n她说：“呆在家里，注意安全，我迫不及待地想看到你们将来都出去走动。”“不要忘了做一个善待自己和他人的鸡蛋。”", "note_en": "Since its launch in 2016, the premise of mobile titan  Pokémon Go has centered on roaming the outdoors in search of mystical little creatures. As a result, it’s a game that’s particularly ill-suited to pandemic-derived restrictions on movement.\n In an attempt to remedy this,  Pokémon Go developer Niantic has  rolled out regular  updates to make the game more quarantine-compatible in recent months. This has led to a new era of play among many in the  Pokémon Go scene. Call it “stay-at-home, play-at-home.”\n Such a systemic change in the way  Pokémon Go is played was likely necessary for the game to survive in an era where many (if not most) players were unable or afraid to travel and gather together for their usual raids. By providing players with a way to play from home, Niantic is effectively removing the golden geese taunting them from the park across the road.\n  Some players have seen a few ostensible benefits to the changes Niantic has rolled out. “The sheer volume of Pokémon spawning from Incense is incredible,” popular Australian  Go YouTuber ZoëTwoDots said. “[There are] far more items from Friend Gifts, new Daily Research without spinning a Pokéstop—at this stage, I think just about every aspect of the game that required you to go outside can now be done from home.”\n But some are worried about the effect that the coronavirus’s spread has had on the game’s social core. Brandon Tan—who has been playing  Go since the second day it was available in Singapore and is widely considered to be the number one player worldwide—is one such worrier.\n “With COVID, I&#39;ve been forced to play [ Pokémon Go] either from home or alone in my car,” Tan told Ars. “After playing the game alone for months, I miss the company of my friends.”\n In Tan’s eyes, playing  Go alone for too long could induce a degree of dryness and boredom capable of shaking newcomers and long-term players alike, creating legitimate concern about the game’s future. While he acknowledges that Niantic is “certainly trying [its] best to cater to players with the introduction of events that are playable from home,” he said he worries that such changes might not be enough to keep the game interesting for regular players.\n  “The only way for a new player to play now is to invest in in-game currency and purchase an item called Incense, which allows the player to encounter a Pokémon every minute while being at home,” Tan explained. “One can also battle Raid Bosses from the Gym using a purchasable item called a Remote Raid pass.”\n HQna, a moderator for popular  Pokémon Go subreddit The Silph Road, argues that Niantic’s implementation of a Remote raiding option has been less than stellar. In order to access a Remote Raid, you need to purchase a specific Battle Pass that is financially detached from the daily free pass Niantic affords players, as well as the Premium Battle Pass players may have already coughed up real money for.\n  To get the most out of the new play-at-home reality,  Pokémon Go players may have to adjust their usual habits. “Be sure to check out the weekly free or one-coin boxes in the shop,” ZoëTwoDots advised. “These boxes have stacks of items so you can keep catching or encountering Pokémon.” She also mentioned the importance of maintaining a healthy friends list in the game in order to send and receive gifts that will often contain items that make  Go substantially easier to run from home.\n “You can also do online [player-vs-player] battles with these friends, and those battles don’t have to be hardcore competitive,” ZoëTwoDots added. “One of my favorite [self-imposed] PvP themes is using tiny Baby Pokémon to battle. [Also], check to see if your local community has a Facebook page or Discord group. Use these platforms to find other local players for Remote Raiding or to add as friends for extra bonuses in-game.”\n HQna believes there’s a lot of fun to be had in battling friends, too. “Trainer Battles are probably one the most prominent features in the game as a whole, but especially now as Niantic has made them more available,” he explains. “I know not everyone likes PvP, but I see a lot of players in the lower ranks of the Go Battle League and in Silph Arena tournaments organized by a local community who use Trainer Battles to use their favorite Pokémon and just have fun.”\n  Quarantined players are also finding new potential in the game through  Pokémon Go’s augmented reality features, which cause Pokémon to appear against real world backdrops via your smartphone camera.\n “One of my favorite features of the game is GO Snapshot, the AR photography mode,” ZoëTwoDots said. “I’ve been trying to take at least two photos at home per week.” She explained that each ‘mon has its own set of animations to pair with regular household tasks, making curious fun out of the simple ways Pokémon interact with home environments.\n    “For example, Machop is a rather muscular fighting Pokémon,” she told Ars. “His flex animation brings his hands in front of his chest, but when placed in front of a sink full of dirty dishes or soapy water, it looks like Machop is doing the dishes or washing its hands.”\n “What’s inside your egg carton? Are they regular eggs, or are some Exeggcute hiding in there? Did hungry little Munchlax steal all the lockdown snacks again? There are a lot of creative ways to merge  Pokémon Go with your reality through AR, [and] I absolutely recommend you try it,&#34; she said.\n HQna feels the same way. “AR photography with Pokémon has so much potential and is a great outlet for all the pent-up creative energy now that so many players are confined to their homes,” he explained. “And I personally just love to see all the AR shots people come up with.” Since the beginning of lockdown, the amount of said AR shots being shared by players has increased exponentially, with Kangaskhans appearing in kitchens all over the world.\n “Chansey baking pancakes with the kids, tiny Beedrill flying around the tulips in someone&#39;s garden, or Slaking just, well, slacking off anywhere are really cool to see, and also help bring the game to life—something we all wanted as a child, right?” HQna added.\n Tan said this kind of play isn’t really his forté. &#34;I personally would not do that, as I would rather play the game in an efficient manner, and playing with the AR feature doesn&#39;t help progress,” he explained.\n But Tan said he also recognizes AR as a fun-filled feature with a lot to offer people who are more interested in progress-detached play. “Those who enjoy taking photos, especially with Pokémon in their homes, might find it fun to help them pass time,” he said.\n  Even with enforced separation from other players, ZoëTwoDots thinks  Go is still a massively positive force in mid-COVID society. “I think one really special thing about Pokémon is the ability to bring people together, both physically and digitally,” she said. “Even though we can’t all be together physically, Pokémon is providing a digital connection to others and a distraction from the stress of how crazy things can be right now.”\n Tan, despite being more skeptical about certain points, agrees. “There’s something new coming out every single month, with new events that Niantic is throwing out to cater to the hunger and thirst of players for new content,” he told me. “ Pokémon Go not only caters to people of all ages, from young to senior, but also to people who choose to play the game differently, like being a collector to hunt for shiny Pokémon, or being a battler in Go Battle League. Although it&#39;s a difficult time for many to head out to play  Pokémon Go, it’s still possible to play from home.”\n HQna, coming from a community moderation position, is able to personally vouch for this. “In a global health crisis like this, both the players and the developers of a game with a main focus on socializing and playing outside should show a particular sense of responsibilities toward themselves and to other people,” he explained. “While we all want things to return to normal as quickly as possible, I hope that catching that one Legendary Pokémon, or polishing the quarterly financial report is less important than saving lives.”\n “Many of us grew up playing the main series games—inside, on our handhelds,” HQna continued. “And to me, the situation right now just makes it even more nostalgic. And I appreciate that. However, I do look forward to finally seeing my local community in person again and to meeting amazing new people from all over the world at the live events next year!”\n Meanwhile, ZoëTwoDots sees  Go as a powerful medium through which people can still retain a sense of community and society during lockdown. “I think especially for younger players, who may not have the full context of why their world is changing so drastically right now, the game is a great distraction from that anxiety,” she said. “Adults and kids can interact with their home through augmented reality—they have Pokémon in their own home!\n “They can watch YouTube videos and see others are playing at home, too,” she continued. “They can join Twitch streams and talk directly with us and other community members to help reduce that feeling of isolation. And when being in the same home day after day can get monotonous, I hope  Pokémon Go and the  Pokémon Go community are able to provide a positive, fun, creative, and safe outlet for them.”\n “Stay home, stay safe, and I can’t wait to see you all out and about in the future,” she said. “Don’t forget to be a good egg to yourself and others.”", "posttime": "2020-07-14 02:30:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "精灵,pok,游戏", "title": "新冠肺炎如何将精灵Go变身“精灵足不出户”", "title_en": "How COVID-19 transformed Pokémon Go into “Pokémon stay-at-home”", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/how-covid-19-transformed-pokemon-go-into-pokemon-stay-at-home/", "via": "", "real_tags": ["精灵", "pok", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "47b66dee8856129b69386379960920a0.jpg", "infoid": 1011585, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但不只是投资者在争先恐后地进入这个领域，教育技术现有的公司也在注意到这一点。最近的收购表明，edtech的快速增长正迫使现有公司从更大的角度考虑，并在此过程中挖走人才。\n印度教育科技巨头Byju概括了如何围绕势头制定战略。今年6月，该公司以105亿美元的估值筹集了资金。它目前引领着印度的在线教育技术市场。几天后，TechCrunch获悉，该公司正在洽谈以1.25亿美元收购成立两年的教育学习应用Doubtut。\n这是因为杜特纳特有一个Byju没有的地方：印度境内较小的本地化城镇和村庄。虽然Byju在印度的大城市中可能是一个家喻户晓的名字，但此次收购可能有助于它向较小的市场扩张。\n还有Docthy最近的收购狂潮。这家全球电子学习初创公司成立于2010年，旨在为意大利学生提供服务，是一个面向专业人士和学生的社交网络。7月初，该公司宣布计划收购两家教育科技公司：巴西的EStudar Com VOCê和美国的Koofers。\nEStudar com VOCê成立于2015年，绰号为“巴西可汗学院”，向巴西的学生出售视频课程和基于文本的讲解。Docthy收购了这家后起之秀，以扩大其在其最大市场巴西的服务，并将面向大学的视频内容引入其课程。", "note_en": "But it’s not just investors who are flurrying to the space; edtech incumbents are taking notice, too. Recent acquisitions show that edtech’s growth spurt is forcing incumbents to think bigger and scoop talent along the way.\n India edtech giant  Byju encapsulates how to strategize around momentum. In June, the company raised money at a  $10.5 billion valuation. It currently leads India’s online edtech market. Days later, TechCrunch learned that the company is in talks to acquire two-year-old education learning app  Doubtnut for $125 million.\n It’s because  Doubtnut has a hold in a place that Byju doesn’t: smaller, localized towns and villages within India. While Byju might be a household name within India’s larger cities, the buy could help it expand to smaller markets.\n There’s also  Docsity’s recent spree of buys. The global e-learning startup, which launched in 2010 to serve Italian students, is a social network for professionals and students. In early July, it announced plans to buy two edtech companies:  Estudar Com Você, based in Brazil, and  Koofers, based in the U.S.\n Estudar com Você, founded in 2015 and nicknamed “Brazilian Khan Academy” sells video lessons and text-based explanations for students in Brazil. Docsity bought the upstart to broaden its offering to its largest market, Brazil, and introduce video content for colleges to its curriculum.", "posttime": "2020-07-14 02:30:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "退出,exits", "title": "\nEdTech的退出表明需要更好的管道", "title_en": "\n\t\t\t\tEdtech exits show a need for better plumbing\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/13/edtech-exits-show-a-need-for-better-plumbing/", "via": "", "real_tags": ["退出", "exits"]}, {"category": "", "categoryclass": "", "imagename": "45aac7fba20883d97ba54a60e478cbc3.jpeg", "infoid": 1011582, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以电视广告软件闻名的MediaOcean LLC已同意收购4C Insights Inc.，4C Insights Inc.是一家营销技术公司，专门从事流媒体视频和社交媒体的受众数据、分析和广告规划。\n据一位知情人士透露，MediaOcean将在这笔交易中支付超过1.5亿美元的现金和股权，这笔交易对MediaOcean本身的估值约为20亿美元。这笔交易预计将于本月完成。\nMediaOcean为广告业提供管理广告交易的软件，帮助营销人员、广告代理、媒体所有者和其他人记录他们购买和销售的内容，以及处理发票和支付等服务。该公司说，它在全球处理的年度媒体支出超过1,500亿美元，其中600亿美元用于美国的电视广告。\n但随着观众蜂拥至流媒体服务以及联网的盒子和电视机，电视业务正在迅速变化。该公司首席执行官比尔·怀斯(Bill Wise)表示，人们也在Facebook和Twitter等社交媒体平台上花费了更多时间。这笔交易是MediaOcean为跟上形势而做出的努力。\nMediaOcean年复一年地处理了700亿美元的电视业务--这是我们业务中最始终如一的部分。我们已经开始看到，这700亿美元越来越分散，“怀斯说。“用户在许多设备上使用不带报价的电视库存。”\n4C Insight表示，其SCOPE平台每年的广告支出超过20亿美元，该平台为流媒体电视等渠道提供受众洞察和媒体规划工具。例如，它的技术允许广告商使用自己或第三方的数据瞄准定制受众，并从由4C策划的跨不同流媒体应用的流媒体广告交易菜单中进行选择。\n营销人员也更需要跟随受众，因为他们在不同的屏幕和内容类型之间移动，并以更精确的目标有效地接触到他们。\n弗雷斯特研究公司(Forrester Research)首席分析师乔安娜·奥康奈尔(Joanna O‘Connell)表示：“但营销者使用技术的方式存在孤岛：他们出去购买解决方案，但这些解决方案往往不能协同工作。”“这会导致性能下降，并耗尽消费者体验。”\n4C的技术接入了Facebook Inc.、Twitter Inc.等公司的社交媒体平台。4C Insights首席执行官兰斯·诺伊豪斯(Lance Neuhauser)表示，Pinterest和Pinterest让营销人员瞄准受众，规划跨越多个平台的广告宣传活动。他说，这对于有兴趣在不同屏幕和平台上以有效和高效的方式接触到同一类型用户的营销人员很有用。\nMediaOcean和4C的关键障碍之一将是让营销人员和广告代理机构购买扩大后的产品。例如，广告公司已经有了自己的数据集、广告规划软件和广告技术合作伙伴关系，可以购买流媒体电视和社交媒体。\n一位广告购买高管表示，MediaOcean可能会受益于这样一个事实，即它已经被全球的代理机构使用，比起它是一家全新的产品或公司，部署MediaOcean的新功能变得更快。\n怀斯说，MediaOcean的技术与其他广告工具和服务相结合。他说，这包括营销人员及其机构拥有或使用的数据集。\nNeuhauser先生将成为MediaOcean的总裁；4C创始人Alok Choudhary将成为MediaOcean的首席科学家，他目前在4C担任这一职务，并将加入该公司的董事会。\n这是MediaOcean自2015年被私募股权公司Vista Equity Partners收购以来的第10笔收购。", "note_en": "Mediaocean LLC, a firm best known for its TV advertising software, has agreed to acquire 4C Insights Inc., a marketing technology company specializing in audience data, analytics and ad planning across streaming video and social media.\n  Mediaocean is paying more than $150 million in cash and equity in the deal, which values Mediaocean itself at about $2 billion, according to a person familiar with the matter. The deal is expected to close this month.\n  Mediaocean provides software for the advertising industry to manage ad deals, helping marketers, ad agencies, media owners and others keep records of what they bought and sold as well as handle invoicing and payments, among other services. The company said it processes more than $150 billion in annual media spending globally, including $60 billion that goes to TV advertising in the U.S.\n    But the television business is changing rapidly as viewers flock to streaming services and internet-connected boxes and TV sets. People are also spending more time on social media platforms such as  Facebook and  Twitter  The deal is a bid by Mediaocean to keep up, said Bill Wise, the firm’s chief executive.\n    “Mediaocean has processed $70 billion of TV year after year—that has been the most consistent part of our business. What we’ve started to see is, there is more and more fragmentation of that $70 billion,” Mr. Wise said. “Users are consuming quote-unquote TV inventory on many devices.”\n  4C Insights said more than $2 billion in annual ad spending runs through its Scope platform, which offers audience insights and media planning tools for streaming TV, among other channels. Its tech lets advertisers target custom audiences using their own data or a third party’s, for example, as well as choose from a menu of streaming ad deals curated by 4C across different streaming apps.\n    Marketers also have a greater need to follow audiences as they move across different screens and content types, and to reach them efficiently with more precise targeting.\n  “But there are silos with the way marketers use technology: they go out and buy solutions but those solutions often don’t work together,” said Joanna O’Connell, principal analyst at Forrester Research. “It results in lost performance and a drain on the consumer experience.”\n  4C’s tech is plugged into social media platforms from companies such as Facebook Inc., Twitter Inc. and  Pinterest  and lets marketers target audiences and plan ad campaigns that span multiple platforms, said Lance Neuhauser, chief executive of 4C Insights. This is useful for marketers interested in reaching the same type of users across different screens and platforms in an effective and efficient manner, he said.\n    One of the key hurdles for Mediaocean and 4C will be to get marketers and ad agencies to buy into the expanded offering. Agencies already have their own datasets, ad-planning software and ad-tech partnerships to buy streaming TV and social media, for example.\n  One ad-buying executive said Mediaocean could benefit from the fact that it is already used by agencies globally, making it faster to deploy Mediaocean’s new capabilities than if it was a completely new product or company.\n  Mediaocean’s tech integrates with other advertising tools and services, Mr. Wise said. This includes datasets owned or used by marketers and their agencies, he said.\n  Mr. Neuhauser will become president of Mediaocean; 4C founder Alok Choudhary will become chief scientist at Mediaocean, a role he currently holds at 4C, and will also join the firm’s board of directors.\n  This is Mediaocean’s 10th acquisition since it was  acquired by private-equity firm Vista Equity Partners in 2015.", "posttime": "2020-07-14 02:28:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,广告,提供,tv,mediaocean", "title": "消息人士称，提供电视广告软件的MediaOcean将以1.5亿美元以上的价格收购4C Insights，后者为流媒体视频和社交媒体提供广告工具", "title_en": "Mediaocean, which provides TV advertising software, to acquire 4C Insights, which offers ad tools for streaming video and social media, source says for $150M+", "transed": 1, "url": "https://www.wsj.com/articles/mediaocean-buys-marketing-tech-firm-as-tv-and-streaming-converge-11594636200?mod=djemalertNEWS", "via": "", "real_tags": ["软件", "广告", "提供", "tv"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1011580, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所有被证明是不可能的事情显然都必须依赖于一些假设，当这些假设中的一个或多个不为真时，不可能性证明就会失败--但专家很少记得在做出“不可能”的陈述之前仔细检查这些假设。\n理查德·汉明，“你和你的研究”(1986)，第182页。\n我们都熟悉许多政要，包括开尔文和爱迪生，他们在赖特兄弟在小鹰取得成功的几年前就宣布不可能有比空气重的飞行器。在核聚变领域，最近有一种趋势是引用或类比小鹰。问题来了：核聚变是在莱特兄弟的时刻，还是在达芬奇的时刻？(达芬奇关于飞行的想法超前于他们的时代--莱特兄弟的想法很准时。)。\n这里有几个与核聚变相关的失败的不可能证明的例子，而不是猜测未来。最后，我将把所有这些联系在一起，并进一步思考不可能性证明作为解决方案指针的价值。\n虽然看起来可能不是这样，但Levitron磁力陀螺是相当相关的。Levitron由一个小的旋转陶瓷磁铁组成，它悬停在一个大磁铁的上方。没有弦，没有超导体，也没有电子设备。根据恩肖定理，仅使用永磁体的静态悬浮是不可能的。物理学家告诉Levitron的发明者Roy Harrigan，他试图做的事情是不可能的--只不过是另一台永动机。哈里根坚持下来，最终完善了这个装置。这是值得注意的，因为Levitron需要仔细调整-一定需要极大的耐心。一旦哈里根展示了他的发明，物理学家就能够解释它：恩肖定理是正确的，但它只适用于静态磁铁--列维特龙实际上是在轨道上。(来源：自旋稳定的磁悬浮，作者：Martin，Helinger，&amp；Ridgway，Am。J.Phys.。65、4、1997)。\n在Levitron和用于核聚变的场反转配置(FRC)概念之间有着密切的相似之处。FRC和Levitron都可以被认为是在外部磁场中指向“错误方向”的磁偶极子。如果没有旋转，偶极子会端对端翻转以与外场对齐。(在FRC中，有问题的旋转是单个粒子的形式，其轨道与等离子体本身的直径大致相同。)。与托卡马克相比，FRC有几个优势。例如，对于给定的外部磁场强度，FRC可以支持大约10倍的等离子体压力，从而获得100倍的聚变功率密度。TAE技术公司(我目前的雇主)正在追求这一理念，其他公司(如氦离子能源和紧凑型聚变系统)也是如此。\n这是另一个静态等离子体不稳定，但运动等离子体稳定的例子：Zap Energy追求的剪切流稳定的Z-Pinch。Z-箍缩确实是不稳定等离子体构型的教科书示例，因为它非常容易分析，而且它是核聚变反应堆的第一批尝试构型之一。它的优点是不需要外部磁场线圈-磁场是由流经等离子体本身的电流产生的。需要注意的是，等离子体必须与产生电流的两端电极直接接触--这对等离子体和电极都是坏消息！(旁注/自我宣传：剪切流Z-箍缩的物理原理与我发现的一个现象非常相似--柱状肥皂泡的流动稳定。你可以在家里试试这个。)。\n对看似无关紧要的假设的违反将这些例子联系在一起。恩肖定理假定静止悬浮。这个定理是正确的--它只是不适用于Levitron。同样，FRC不稳定性的“证据”假设粒子轨道非常小--这在其他磁约束配置中是一个很好的假设，但对于FRC方法中涉及的较低磁场则不是这样。在Z箍缩的情况下，静态等离子体假设似乎是合理的-剪切流的稳定作用多年来一直没有得到重视，因此静态等离子体假设似乎只是让数学变得更简单。\n我们能把汉明的洞察力转化为实现不可能的秘诀吗？贝尔的俏皮话切中了问题的核心：认识到要打破哪些假设，以及以何种方式打破，需要创造力、想象力，或许还需要直觉和运气。并不是每个假设都是关键的，因为违反它会产生解决方案。此外，假设可能会被违反或修改的方式可能有很多种--并不是所有的方式都是有效的。生产路径也不总是显而易见的。实际上，还有哪些假设可能被违反的问题。\n不可能的证据并不是没有价值的-它们排除了某些领域的搜索空间，这可以节省时间和精力探索徒劳的途径。假设通过去除变量来简化推理--我们不能总是从基本原理出发。删除假设会使推理和计算变得更加困难，因此要有选择地删除哪些假设是很重要的。一个有用的不可能性证明是假设很少、很明确并且是结论所必需的(也就是说，如果没有假设，解决方案就会成为可能的)。\n回到聚变能源：麻省理工学院核聚变研究项目前主任劳伦斯·利德斯基(Lawrence Lidsky)在1983年为具有经济竞争力的聚变能源阐明了一个“不可能的证据”。简而言之，利德斯基认为，使用传统氘氚燃料的聚变装置在经济上不会与核裂变相比具有竞争力。对于聚变和裂变，电力成本的主要贡献是资本成本-由于燃料的巨大能量密度，燃料成本很小。另一方面，聚变反应堆的功率密度将比裂变低10倍或100倍，因此它们将按比例大于同等的裂变反应堆核心。聚变反应堆也是更复杂的技术。聚变反应也会对固体材料造成更多的中子破坏，需要频繁的维护。因此，聚变将比裂变更昂贵-后者在经济上已经不是很有竞争力。\n利德斯基对核聚变的批判有大量的假设，其中一些是隐含的，并不是所有的都是必要的-换句话说，它是可以改进的。我正在写一系列针对他的假设的帖子，看看能从这些争论中学到什么。我的下一个帖子将是看看当代的能源经济学，然后考虑如何在聚变反应堆中实现高功率密度。", "note_en": "All things which are proved to be impossible must obviously rest on some assumptions, and when one or more of these assumptions are not true then the impossibility proof fails—but the expert seldom remembers to carefully inspect the assumptions before making their “impossible” statements.\n Richard Hamming,  You and Your Research (1986), p182\n We’re all familiar with the  many dignitaries, including Kelvin and Edison, who declared heavier-than-air flying machines were impossible just a few years prior to the Wright brothers’ success at Kitty Hawk. In the field of nuclear fusion, there’s been a tendency recently to  make references or  analogies to Kitty Hawk. The question arises: is fusion at a Wright brothers moment, or a Da Vinci moment? (Da Vinci’s ideas for flight were ahead of their time — the Wright brothers’ were punctual.)\n Rather than speculating on the future, here are a few examples of failed impossibility proofs related to nuclear fusion. I’ll tie it all together at the end with some further thoughts about the value of impossibility proofs as pointers to solutions.\n Although it may not seem like it, the  levitron magnetic top is quite relevant. The levitron consists of a small spinning ceramic magnet hovering above a larger one. There are no strings, no superconductors, and no electronics involved. According to Earnshaw’s theorem, static levitation using only permanent magnets is impossible. The inventor of the levitron, Roy Harrigan, was told by physicists that what he was trying to do was impossible — just another perpetual motion machine. Harrigan persisted, and eventually perfected the device. This is remarkable, because the levitron requires careful tuning — a great deal of patience must have been required. Once Harrigan demonstrated his invention, physicists were able to explain it: Earnshaw’s theorem is correct, but it only applies to  static magnets — the levitron is actually in an  orbit. (Source:  Spin stabilized magnetic levitation, by Martin, Helfinger, &amp; Ridgway,  Am. J. Phys.  65, 4, 1997)\n There’s a close analogy between the levitron and the  field-reversed configuration (FRC) concept for nuclear fusion. Both the FRC and the levitron can be thought of as magnetic dipoles oriented the ‘wrong way’ in an external magnetic field. If it weren’t for rotation, the dipole would flip end-over-end to align with the external field. (In the FRC, the rotation in question is in the form of individual particles with orbits that are roughly the same diameter as plasma itself.) The FRC has several advantages over the tokamak. For instance, for a given external magnetic field strength, the FRC can support approximately 10 times the plasma pressure, leading to 100 times the fusion power density.  TAE Technologies (my current employer) is pursuing this concept, as are others (such as  Helion Energy and  Compact Fusion Systems).\n Here’s another example where a  static plasma is unstable, but a moving one is stabilized: the shear-flow stabilized Z-pinch, pursued by  Zap Energy. The  Z-pinch is literally the textbook example of an unstable plasma configuration, because it is very simple to analyze, and it was one of the first attempted configurations for a nuclear fusion reactor. It has the advantage of not requiring external magnetic field coils — the magnetic field is generated by a current flowing through the plasma itself. The caveat is that the plasma must be in direct contact with electrodes at both ends which create the current — this is bad news for both the plasma and the electrodes! (Side note / self-promotion: the physics of the shear-flow Z-pinch is very similar to a phenomenon I discovered –  flow stabilization of a cylindrical soap bubble. You can try this one at home.)\n The violation of  seemingly-innocuous assumptions is what links these examples.  Earnshaw’s theorem assumes  static levitation. The theorem is true — it just doesn’t apply to the levitron. Similarly, the ‘proof’ of instability of the FRC assumes that particle orbits are very small — a good assumption in other magnetic confinement configurations, but not for the lower magnetic fields involved in the FRC approach. In the case of the Z-pinch, the static plasma assumption seemed reasonable — the stabilizing effect of sheared flow was not appreciated for many years, so static plasma assumptions appeared to simply make the math easier.\n  Can we turn Hamming’s insight into a recipe for achieving the impossible? Bell’s quip gets to the heart of the problem: recognizing which assumptions to break, and in what manner, requires creativity, imagination, and perhaps intuition and luck as well. Not every assumption is critical, in that violating it will yield a solution. Also, there may be many  ways in which an assumption could be violated or modified — not all of them productive. The productive paths are not always obvious, either. There’s also the question of which assumptions  can be violated, practically-speaking.\n Impossibility proofs are not without value — they rule out certain areas of search space, which can save time and effort exploring fruitless avenues. Assumptions simplify reasoning by removing variables — we can’t always work from first principles. Removing assumptions makes reasoning and calculations more difficult, so it’s important to be selective about which ones to remove. A useful impossibility proof is one whose assumptions are few, explicit, and necessary for the conclusion (that is, without the assumption a solution would become possible).\n Returning to fusion energy: Lawrence Lidsky, former director of the MIT fusion research program, spelled out an ‘ impossibility proof‘ for economically-competitive fusion energy in 1983. In a nutshell, Lidsky argues that fusion devices using the conventional deuterium-tritium fuel won’t be economically competitive with nuclear fission. For both fusion and fission, the dominant contribution to the cost of electricity is the cost of capital — the fuel costs are small, due to the enormous energy density of the fuel. On the other hand, fusion reactors will have lower  power density (by 10 or 100 times) compared to fission, so they will be proportionately larger than an equivalent fission reactor core. Fusion reactors are also more complicated technology. Fusion reactions also cause more neutron damage to solid materials, requiring frequent maintenance. Therefore, fusion will be more expensive than fission — which is already not very economically competitive.\n Lidsky’s critique of fusion has a large number of assumptions, some of them implicit, and not all of them necessary — in other words, it could be improved. I’m working on a series of posts addressing his assumptions, to see what  can be learned from the arguments. My next post will be a look at contemporary energy economics, followed by consideration of how to achieve high power density in a fusion reactor.", "posttime": "2020-07-14 02:28:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,impossible,假设", "title": "做不可能的事", "title_en": "Doing the Impossible", "transed": 1, "url": "https://heteroskedasticblog.wordpress.com/2020/07/12/doing-the-impossible/", "via": "", "real_tags": ["可能", "假设"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011579, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这目前是一个草案，将于2019年1月正式推出。现在可以随意阅读，但请原谅任何错误或措辞不便。", "note_en": "This is currently a draft and will launch formally Jan 2019. Feel free to peruse now, but please forgive any errors or awkward wording.", "posttime": "2020-07-14 02:27:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生物,build,请原谅", "title": "如何构建一个生物技术", "title_en": "How to Build a Biotech", "transed": 1, "url": "https://www.celinehh.com/how-to-build-a-biotech", "via": "", "real_tags": ["生物", "build", "请原谅"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011578, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google群组允许您创建并参与在线论坛和基于电子邮件的群组，这些群组具有丰富的社区对话体验。", "note_en": "Google Groups allows you to create and participate in online forums and email-based groups with a rich experience for community conversations.", "posttime": "2020-07-14 02:27:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,apple,silicon,elixir,群组", "title": "编译时在Apple Silicon的MacOS上从源码段错误构建灵丹妙药", "title_en": "Building Elixir from source segfaults on macOS on Apple Silicon while compiling", "transed": 1, "url": "https://groups.google.com/forum/#!msg/elixir-lang-core/9s6-BIxaCz8/i-NmhjabAQAJ", "via": "", "real_tags": ["编译", "apple", "silicon", "elixir", "群组"]}, {"category": "", "categoryclass": "", "imagename": "a4df17023b4101d159da4f8aa7ac3acd.jpg", "infoid": 1011577, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比特币社区的人经常嘲笑我是个爱发呆的人。也就是说，我没有任何比特币，而且对这一事实直言不讳。(顺便说一句，这两个都不是真的)。事实是，我对比特币没有问题。这是一项可靠的协议，轻而易举地存活了11年。当我表现得很挑剔时，通常是因为我抨击了围绕比特币如雨后春笋般涌现的各种叙事或粉丝小说。别误会我的意思，所有的运动都依赖于某种内在的神话来帮助推动它们的进步。比特币在这方面也没有什么不同。但是，准确的自我认知和幻想是有很大区别的。比特币最错误的叙述是它的胜利故事。他们中的大多数人把比特币描绘成某种明显的继承人，等待着不可避免地取代普通货币：比特币在1991年成为互联网，刚刚开始大规模采用……。比特币是电子邮件。再过一年就是超比特币了..。比特币作为货币革命……等等。我相信你已经遇到过这些声明了。不，比特币不会成为主流货币。这对大多数人来说太尴尬了。疯狂的价格波动对普通民众来说太邪恶了-使用公众是无法容忍的。比特币制造者也不应该希望比特币成为主流。如果五年后世界上每个人都成为比特币用户，那只可能是因为常规货币体系发生了非常非常糟糕的事情。也许怀有敌意的外星人奴役了我们，正在使用支付系统来控制我们能买到什么，就像玛格丽特·阿特伍德(Margaret Atwood)在她的反乌托邦女仆故事中饰演的Compucounts一样。因此，比特币已经成为主流，但这只是因为我们都被迫成为桌子下的比特币用户，以便购买我们需要的东西。我刚刚在玛格丽特·阿特伍德的“女仆的故事”中读到了关于康普库茨的这篇文章。相当可怕。他们已经把它们冷冻了，我的也是……。任何有F而不是M的账户，他们所需要做的就是按几个按钮。我们被切断了。pic.twitter.com/MnP1IbcwGb。\n-约翰·保罗·科宁(@jp_kning)2019年12月2日。\n当然，没有一个比特币发烧友真的想要这样一个黑暗的未来。我认为业余电台社区为比特币编制者提供了文化挪用的肥沃土壤。正如我最近在CoinDesk的文章中所建议的那样，比特币和火腿收音机非常相似。他们都很笨拙，都很老土。与更主流的选择相比，这两种技术都不是特别容易使用：Ham Radio的用户体验被Whatsapp击败，而Zelle使用起来比比特币更流畅。上YouTube，你会发现数以千计的视频解释每种技术是如何工作的。让火腿和比特币都如此令人困惑的一个特征也是它的实力。它们都是分散的。也就是说，两者都不依赖于单一的无处不在的服务提供商。相反，实际用户100%负责操作该工具。不需要帐户。这种缺乏看门人意味着没有人来软化用户体验。这也意味着任何人都不能被排除在广播电台信息或转移一些比特币之外。这是一个很好的特点。业余无线电社区似乎对它的友善感到相当自在。业余无线电运营商不会挤在一起谈论推翻智能手机的极权体系，或者取代邪恶的电子邮件。没有业余电台可以修复Twitter上的这一迷因。这就不足为奇了。如果业余无线电在2025年成为主流，那只会是因为某种大规模的自然灾害，比如流星撞击，已经破坏了所有其他形式的通信。任何理智的业余无线电运营商都不会希望这种厄运发生在世界上。当我在研究我的CoinDesk文章时，我了解到业余收音机有一个很大的社区服务元素。飓风和其他自然灾害经常导致手机和911呼叫中心瘫痪。作为一个强大的分散通信网络，独立的业余无线电运营商成为第一响应者。他们找到绝望的人，并将他们的需求传达给紧急护理提供者。例如，在下面的图片中，火腿广播迷乔什·纳斯(Josh Nass，又名KI6NAZ)正在他的社区巡视，看看是否有家庭被(模拟)灾难摧毁。我真的很喜欢乔什所代表的精神气质。它温暖、温馨、英勇。业余无线电运营商似乎也有很好的谦逊态度。社会认为自己是一群有公民意识的业余爱好者，而不是即将拆毁体制的革命者。或许比特币制造者可以从中吸取教训。要学习使用比特币必须做的所有晦涩难懂的事情，就需要有业余爱好者的心态：如何保管自己的密钥，如何进行比特币交易，如何运营一个节点，以及如何设置Lightning。在孩子和工作之间，大多数人不会有时间。或者，也许我们只是懒惰而已。当规则的Mone", "note_en": "People in the bitcoin community often make fun of me as a  nocoiner. That is, I don&#39;t have any bitcoins and am vocal about that fact. (Neither of which is true, by the way).  The truth is that I have no problem with bitcoin. It is a solid protocol that has survived handily for eleven years. When I come off as being critical, it&#39;s usually because I&#39;m attacking the various narratives, or fan fictions, that have sprung up around bitcoin. Don&#39;t get me wrong, all movements rely on some sort of internal mythology to help drive their progress. Bitcoin is no different in this respect. But there is a big difference between accurate self-perception and fantasy.  Bitcoin&#39;s wrongest narratives are its triumphal ones. Most of them paint bitcoin as some sort of  heir apparent, waiting on the wings to inevitably replace regular money: Bitcoin is the internet in 1991, just on the cusp of mass adoption... Bitcoin is email... Hyperbitcoinization is one year away... Bitcoin as monetary revolution...etc. I&#39;m sure you&#39;ve run into these proclamations.  No, bitcoin isn&#39;t going to become a mainstream kind of money. It&#39;s too awkward for most people. Crazy price gyrations are far too wicked for the regular money-using public to tolerate.  Nor should bitcoiners want bitcoin to go mainstream.  If five years from now everyone in the world has become a bitcoin user, that could only be because something very very bad has happened to the regular monetary system. Perhaps hostile aliens have enslaved us and are using the payments system to control what we can buy, sort of like Margaret Atwood&#39;s Compucounts in her dystopic  Handmaid&#39;s Tale. And so bitcoin has gone mainstream, but only because we have all been forced to become under-the-table bitcoin users in order to buy stuff we need.   I just read this bit about Compucounts in Margaret Atwood&#39;s Handmaid&#39;s Tale. Pretty ghoulish. &#34;They&#39;ve frozen them, mine too... Any account with an F on it instead of an M. All they needed to do is push a few buttons. We&#39;re cut off.&#34;  pic.twitter.com/MnP1IbcwGb\n— John Paul Koning (@jp_koning)  December 2, 2019\n  Surely no bitcoiner would actually want such a dark future.  I think the ham radio community provides bitcoiners with fertile ground for cultural appropriation. As I suggest in  my recent Coindesk article, Bitcoin and ham radio are quite similar. They are both clunky and  old-fangled. Neither technology is particularly easy to use relative to more mainstream options: ham radio&#39;s user experience is trumped by Whatsapp&#39;s, and Zelle is smoother to use than bitcoin. Go to Youtube an you&#39;ll find thousands of videos explaining how each technology works.   The very feature that makes both ham and bitcoin so confusing is also its strength. They are both decentralized. That is, neither relies on a single omnipresent service provider. Rather, the actual user is 100% in charge of operating the tool. No account necessary. This lack of a gate keeper means that there is no one to soften the user experience. It also means that  no one can be excluded from broadcasting a radio message, or transferring some bitcoins. That&#39;s a neat feature.  The ham radio community seems to be quite comfortable with its nicheness. Ham radio operators don&#39;t huddle together and talk about &#34;overthrowing the totalitarian system of smart phones&#34; or &#34;displacing evil email.&#34; There is no  ham radio fixes this meme on twitter.  And no wonder. If ham radio were to have gone mainstream by 2025, it would only be because some sort of massive natural disaster, say a meteor strike, has crippled all other forms of communication. No sane ham radio operator would wish this sort of doom scenario on the world.   When I was researching my Coindesk piece, I learned that there is a large  community service element to ham radio. Hurricanes and other natural disaster often knock out cell phones and 911 call centres. As a robust decentralized communications network, independent ham radio operators become first responders. They locate desperate people and relay their needs on to emergency care providers. For instance, in the image below ham radio aficionado Josh Nass aka KI6NAZ is doing rounds of his neighborhood to see if any families have been knocked out by a (mock) disaster.     I really liked the ethos that Josh stands for. It&#39;s warm and cuddly and heroic. There also seems to be a good dose of humility among ham radio operators. The community thinks of itself as a group of civic-minded hobbyists, not revolutionaries on the cusp of tearing down the system.   Perhaps bitcoiners can learn from this. A hobbyist mentality is required to learn all the obscure things one must do with one&#39;s bitcoins: how to custody one&#39;s own keys, make bitcoin transactions, run a node, and set up Lightning. Between kids and jobs, most people won&#39;t have the time. Or maybe we&#39;re just lazy. When the regular monetary &amp; payments system is compromised, say Visa or Zelle or Swish have gone down, perhaps these bitcoin hobbyists—like their ham radio cousins—can leap into action and help others by enabling them to route transactions around the blockages.  Better this sort of narrative than to be fooled by fantasies saying that bitcoin is destined to rule the world. In the long run, bad narratives lead to disillusionment, and disillusionment kills a movement.   To sum up, bitcoin isn&#39;t the next email. It seems more akin to ham radio, a civic-minded and wonkish hobby that comfortably exists alongside its more mainstream centralized cousins. When the regular payments system suffers from a rare interruption, that&#39;s bitcoin&#39;s turn in the spotlight. But when regular service is restored, it becomes a hobby again. And that&#39;s fine.", "posttime": "2020-07-14 02:27:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,像是,ham,业余", "title": "比特币更像是业余无线电，而不是早期的互联网。", "title_en": "Bitcoin is more like ham radio than the early internet", "transed": 1, "url": "http://jpkoning.blogspot.com/2020/07/bitcoin-is-more-like-ham-radio-than.html", "via": "", "real_tags": ["比特币", "像是", "ham", "业余"]}, {"category": "", "categoryclass": "", "imagename": "3c8ad7498c4db6a0338fbbc944d9b3f0.png", "infoid": 1011576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索拉布·夏尔马0：00我们所有人都来自不同的背景。我想说的是，DNA在某种程度上是自动流动的。你想卷起袖子，甚至想要帮助公司达到他们需要的程度，对吗？我们不会强制执行的。我要说的是，在某种程度上，是的，中西部地区主要是他们在建立这些企业方面。我确实认为这是有区别的。\n杰伊·克劳斯(Jay Clouse)0：20创业投资格局正在发生变化。而且世界级的公司正在硅谷以外的地方建立。我们找到他们，与他们交谈，讨论投资他们的好处。欢迎来到Upside。\n你好，你好。大家好，欢迎回到“向上”播客，这是第一个在硅谷之外发现“向上”的播客。我是杰伊·克劳斯，陪同我的是我的搭档，大胡子先生埃里克·霍农。\n埃里克·霍农1：00不幸的是，杰，也许你通过这个POP滤镜看不到，但是胡子已经看不到了。\n埃里克·霍农1：08是的，有点胡茬这是，这是我的，这将是我第一次全刮胡子。自从我把胡子去掉以后。我用胡子和胡子做了头两个月的隔离。我在尽我最大的努力杰伊·克劳斯。然后我说，你知道吗，我不是个留胡子的人。不是这样的。很痒。它，嗯，我想我之前在播客里把它描述为。\n杰伊·克劳斯，1：32，每次你在播客上说“”这个词，我都会畏缩。\n埃里克·霍农1：34是的，我可能在播客里说了太多次了，我会说，是的，一旦你刮掉了胡子，你看着镜子里的自己说，我可以脱掉这个吗？如果我走出这间浴室？我的未婚夫会杀了我吗？你只要去争取就行了。这是一个神奇的时刻。杰伊。当有一声尖叫时，就会有一声尖叫，然后就会接受这就是现在的我。我是个小胡子男。\n杰伊·克劳斯1：59你给我寄来了这张照片，我就想，哦，我很高兴你按这个顺序刮了胡子，还花时间在它消失之前拍了一张照片。然后持续了大约六周。\n埃里克·霍农2：21是的。所以那是一把漂亮的胡子。我不会撒谎的，我们已经把它修整过了。我给了它一点爱。只是你知道胡子生活很艰难，杰，因为你喝了一点牛奶。是的，你的牛奶里有八字胡，你的八字胡里有牛奶。不管它是什么。\n杰伊·克劳斯2：34事实上，我自己并没有经历太多的胡子痛，因为我的胡子是我胡子中最薄弱的部分。\n杰伊·克劳斯2：40所以，是的，我继续列举驼鹿胡子问题的数量。\n埃里克·霍农2：45是的，是的，非常喜欢吃有胡子的火辣鸡翅。接下来的四个小时你会有火辣的鸡翅因为它不会离开你的胡子。不管怎样，是的。所以胡子，整个阶段，整个阶段都在我身后了，杰伊，但它仍然活在记忆中。\n杰伊·克劳斯3：05好的，我很高兴你不仅试了一下胡子，还试了试胡子。说到跳跃，今天我们请到了Saurabh Sharma。他是Jump Capital的合伙人，这是一家以论文为导向、以运营为中心的风险投资公司，专门从事A和B系列成长期投资，Jump Capital投资于金融科技、B2BSaaS、IT数据基础设施和媒体行业内的数据驱动技术公司。他们的总部设在芝加哥和纽约。埃里克，我们怎么才能找到他们的资本。\n埃里克·霍农3：43我间接地与Jump Capital取得了联系，我想是在两年前，可能是通过Twitter或电子邮件之类的。所以我不太记得是怎么回事了。但我一直通过电子邮件与那里的一些合作伙伴联系，只是因为我真的喜欢他们的结构和设置方式，以及他们关注的内容。他们对自己的工作非常明确，我发现这在风险投资领域令人耳目一新。我们想和他们谈谈。你知道吗，我们今天要喝一杯。\n杰伊·克劳斯4：13 Jump Capital投资了之前的Pod Co Balto，他们投资了Personal Capital，举几个你们也听说过的辛辛那提的Lisnr公司。他谈到了他们的直言不讳，以及他们实际投资的是什么。他们还在自己的网站上表示，当公司的营收运行率为100万至500万美元时，他们会在第一笔投资中投资100万至1000万美元。一般来说，到目前为止，他们的网站上只有不到1000万美元的投资，就行业而言，他们在寻找什么类型的公司，甚至是在什么阶段？你知道，投资，投资条款是什么？\n埃里克·霍农4：51是的，他们的运营伙伴模式更像是私募股权，而不是很多风险投资公司。我们几乎和平台模型谈过了。因此，当你非常具体地说明你将要投资的公司类型时，我认为这种运营模式会变得更加强大，因为你可以让最优秀的人在这四个重点领域做需要做的具体事情，在这个非常具体的领域，在这个非常特定的领域，产品市场匹配已经得到满足，现在是增长时期。\n杰伊·克劳斯5：21好的。嗯，我们很想听听你对这一集Saurabh的看法，你可以发推特给我们@Upside FM，或者发邮件给我们Hello@upside.FM。我们会在这之后马上进行采访。本期《向上》由特雷斯塔赞助。Tresta是一款适用于iPhone和Android的应用程序，可以让你在没有硬件的情况下从任何地方打电话和发短信。只是一部你已经在用的智能手机。Tresta是市场上最好的商务手机应用。无论你是创业者还是自由职业者，是刚刚开始创业还是已经成名。扩大您的网络和您的业务都与通信息息相关。不管你在哪里，你都得随时待命。Tresta提供呼叫管理功能，使您能够更智能、更高效地进行通信，如自动出席、通话录音、用户组等。而且你不需要任何特殊的设备，只需要你已经在使用的智能手机。Tresta易于配置。这样你就可以自己在网上设置所有的东西了。特雷斯塔的虚拟电话系统使建立一个功能齐全的移动办公室比以往任何时候都更容易、更实惠。每个用户每月只需15美元，不含合同。所以，今天就在www.tresta.com/upside开始您的30天免费试用吧。网址是www.tresta.com/upside。Saurabh欢迎收看节目。\n埃里克·霍农6：47让我们乘火箭船去看。你是怎么到跳跃资本的。\nSaurabh Sharma 6：51是的，我的意思是这是一条不同寻常的道路。我不认为我看起来很痛苦，你的风险投资家。从职业的角度来看。我想这是三条有机的路。旅途到处都是，我认为这是一个好兆头，坦率地说，这是一种融合了一系列东西的好兆头。但你知道，我基本上是一名训练有素的工程师，在印度的工程专业长大，在法国拿到阿波罗大学的奖学金。Finish成为了法国的一名计算机科学研究员，在国家研究实验室，有机会来到康奈尔大学学习我的硕士学位，可能还有康奈尔大学的博士学位，在那里，他们被华尔街洗脑了，他们是兄弟，所有的银行都只是去校园里雇佣量子计算机科学人员，所以我刚刚完成了在康奈尔大学的硕士学位，加入了雷曼量子阿尔戈交易台，你知道，你知道，干草的日子和恰到好处的时间，因为他们甚至开放等待雷曼兄弟的巅峰时期，所以我刚刚完成了我在康奈尔大学的硕士学位，加入了雷曼量子阿尔戈交易台，你知道，你知道，在那里，他们只是在等待雷曼兄弟的顶峰，他们甚至开放等待雷曼兄弟的巅峰。因此，你知道，显然，这是一个非凡的时代，从纽约、伦敦用于竞争交易的相当大规模的建筑，到丽思卡尔顿交易中的一些非凡的办公桌，不一而足。带着会议去面对面。固体烟草几乎一直在那里，不完全是在最后，我有机会申请商学院，但我一直在推迟，我认为这真的是一段美好的时光。07年后，有一些迹象表明他们可能会变弱，然后我承认我休了一段时间的假，搬回印度去读商学院，但我不知道它会上涨。我在芝加哥展位开办商学院的第一周就让总理大吃一惊。所以第二年是一种尝试，和我的一群朋友一起开办了我自己的公司。然后，你知道，我正准备开始为他们做这些工作，并发布了一些回到华尔街与鲍勃·雷曼一起在首都工作的文章，当时我意识到可能不是我回来了，迈克尔是首席执行官，在4月科斯基·拉德克的帮助下，他加入了芝加哥南方银行的早期叔叔生活银行，该地区当地的山地护士为我早先参与的一家初创公司提供了资金。然后它让我们花了一些时间在光线银行，埃里克最终成为了Groupon的首席执行官，他邀请我在一些时候一起来扭转局面。因此，另一种方式是在相当惊人的情况下设置有趣的项目，以扭转企业的颓势。我参与了一个内部数据科学团队运行的移动相关策略，然后在纽约参加了Mary Barra时尚大会。因此，运营和营销对于十字路口的企业来说是一次跳跃，这是一种很好的合并跳跃，因为我们将会讨论更多，这与创建团队有一些相关性，非常注重计算。所以这些都可以把它放在一起。你知道，我实际上是背景，我一直在创业，我已经在科技行业工作了大约四年半，并加入了联合跳跃。所以又一次，有点不同寻常，但却让我走上了多条道路。但我认为所有这些都是非常有帮助的，无论是作为运营商和投资者，然后是风险投资。\n埃里克·霍农(Eric Hornung)8：29在07-08年间离开雷曼兄弟，他们说你无法把握市场时机。\n索拉布·夏尔马10点02分，是的。哦，等等，那是真的，你知道，这很有趣。你知道，我可能会是。雷曼兄弟要为我的商学院买单。所以这是唯一的机会成本明智变得相当多，但是，是的，我可以我可以抱怨我在中学我\nSaurabh Sharma 12：46是的，我是说，你知道，想想Groupon的故事，对吧？这是第一批超本土化的大故事之一，对吧？这是一个你谈论单独的单人社交，本地的，移动的，每个人都在谈论我和你在一起的群体，你知道，只是真的抢了那些馈送。当你谈到超本地化的概念时，一个型号是它的核心仅仅因为你带着你的手机，它都是关于键的，当我们走过美发沙龙的披萨店时，我怎么才能向你展示我们交易中最相关的部分呢？所以你会觉得，我参与的那个产品是非常核心的，解决这个相关性问题就是解决那个推荐问题。这与传统的建议非常不同，嘿，你买这个产品，或者你也买这个产品，你知道，这并不容易，但你知道，就实时和相关性而言，它有点像香草，而不是想要什么。我的意思是，这是一个组合，大量的数据科学成果，收集成吨千兆字节的数据，然后在右边的优化过程中实时解决这些问题，这是推动Groupon至少一所当地商学院收入的核心。Groupon有很好的商务和旅游业务，但本地IS是最大的，这很酷，我特别专注于手机部分，因为你们都知道的女性部分，你们以发送大量电子邮件而闻名，这更静态，这更有活力。所以现在，你知道，第一，这是正常的体验，主要是因为在当时，能够处理如此大规模的数据本身就是令人兴奋的，数据有那么好吗？众所周知，为数据科学解决机器学习问题，数据越多，你能用它做的工作就越有趣。所以它做了第二个部分。因此，我在某种程度上更多地是在产品方面，在一端与业务团队密切合作，负责交付这些产品。而我们核心数据中心的另一边，人类正在构建优化模型，我们基本上是在解决两端的优化率和反馈问题。要么是数据部分不正确，要么是如果您获得建模结果，那么您如何呈现正确的交易，然后根据获得正确类型的客户的反馈循环来采购这些交易。\n埃里克·霍农14：56我们听到很多关于数据科学在过去几年里是如何加速发展的。当谈到数据和数据科学时，你在Groupon遇到的限制是什么？\nSaurabh Sharma 15：06聚合总是一个挑战，对吗？你知道，幸运的是，Groupon在聚合方面足够早地构建了非常好的基础设施。但是，你仍然可以解决聚合，尝试更大的挑战来了，因为他们不是版本的清洁。你会听到任何与我一起在该领域工作的人的意见，你知道，人们在结束时都会谈论分析。你知道，我当然不想削弱分析，这就是核心，但你不能做分析，除非你的分析镜像在标准化数据清理协调上付出了巨大的努力，然后找到正确的数据，建立模型和优化，创建反馈循环。我会说，即使是今天，我也不能说这个挑战已经真正解决了，可能会更好。但是，当您开始混合结构化和非结构化数据、BLOB数据、对象数据时，现在会有更多种类的数据混杂在一起，所有这些都是因为创建更多会带来更多挑战，所以基础架构，它解决了这一问题，这是相当关键的。如何谈论你一直面临的挑战。我的意思是，第二个挑战是，你知道，我们总是关注准确性。我要说的是，我正在做的一些工作的实时性也真的很难。因为这是当你追求实时的时候，你在某种程度上确定了产生结果所需处理的数据量，因为它会接收信号。那就是，这是另一个问题，对吧？这有点像是解决了实时流数据的挑战。\n埃里克·霍农16：29我们经常看到风险资本家把他们想要投资的东西和他们历史上参与的东西联系在一起。所以，当我们看一下你的背景，它是雷曼和金融，然后是Groupon，我会想，好吧，你会非常深入地参与到消费领域，金融科技领域，然后你会看看你的简历，以及它的云基础设施和企业软件。你遇到跳跃的时候怎么样，你说，我想进去，把注意力集中在这两件事上。\nSaurabh Sharma 17：00云基础架构走狗与我的背景相当相关，我是计算机科学专业的本科生，硕士研究生，我早先的研究方向是幂计算和编译", "note_en": "view episode transcript Saurabh Sharma 0:00  All of us come from all varying backgrounds. And I would say that DNA kind of flows in somewhat automatically. You want to roll up your sleeves even to help the companies to the extent they need, right. We’re not enforcing this. And I would say that combined with I would say, yeah, to some extent, and midwest primarily them in building these businesses. I do think that differentiates.\n Jay Clouse 0:20  The startup investment landscape is changing. and world class companies are being built outside of Silicon Valley. We find them, talk with them and discuss the upside of investing in them. Welcome to Upside.\n Hello, hello. Hello, and welcome back to the upside podcast, the first podcast finding upside outside of Silicon Valley. I’m Jay Clouse, and I’m accompanied by my co host, mister money mustache himself Eric Hornung.\n Eric Hornung 1:00  Unfortunately, Jay, maybe you can’t see it through this pop filter, but the mustache is no longer.\n  Eric Hornung 1:08  Yeah, it’s a little stubbly it’s, it’s my, it’ll be my first full shave. Since I got rid of the mustache. I did the first two months of quarantine with the beard and the mustache. I was doing my best Jay Clouse. And then I said, You know what, I’m just not a beard guy. It’s not. It’s itchy. It’s, um, I think I’ve described it previously on the podcast as pube.\n Jay Clouse 1:32  And I cringe every time you say the word pube on the podcast.\n Eric Hornung 1:34  Yeah, it’s I’ve probably said it too many times on the podcast, I would say, yeah, once you get rid of once you get rid of the beard, and you’re looking yourself in the mirror and you say, Can I pull this off? If I walk out of this bathroom? Will my fiance kill me? And you just go for it. It’s a magical moment. Jay. When there’s a there’s a shriek and then an acceptance of this is who I am now. I’m a moustache guy.\n Jay Clouse 1:59  You sent me the photo and I was like, Oh, I’m so glad that you shaved it in this order and took the time to get a photo of this before it’s gone. And then it stuck around six weeks.\n       Eric Hornung 2:21  Yeah. So it was a nice mustache. I won’t lie we got trimmed it up. I gave it a little bit of love. It’s just you know it the mustache life is tough, Jay because you drink a little bit of milk. Yeah, mustache in your milk, milk in your mustache. Whatever is it.\n Jay Clouse 2:34  I actually don’t experience many of the mustache pains myself because my mustache is the weakest part of my beard.\n  Jay Clouse 2:40  So yeah, I go on enumerate on the number of moose mustache problems.\n Eric Hornung 2:45  Yeah, yeah, very eating a hot wing with a mustache. You got hot wing for the next four hours because it’s not leaving your mustache. Anyway, yeah. So the mustache the whole That whole that whole phases is behind me, Jay, but it lives on in memoriam.\n Jay Clouse 3:05  Well, I’m glad that you made the jump into not only trying the beard but trying a mustache. And speaking of jump, today we are talking with Saurabh Sharma. He is a partner at Jump Capital, a thesis led sector focused and operating centric venture capital firm specializing in series A and B in growth stage investments, Jump Capital invest in data driven technology companies within the FinTech, B2B SaaS, IT data infrastructure and media sectors. They’re based in both Chicago and New York. Eric, how do we find them capital,\n Eric Hornung 3:43  I got connected with Jump Capital, indirectly, I think two years ago, maybe it was via Twitter or via an email or something. And so I don’t exactly remember how it happened. But I’ve been in contact via email with a few of the partners there just because I really like the way that they are structured and set up and what they focus on. And they’re very explicit about what they do, which I find to be refreshing in the venture capital space. And we wanted to have a conversation with them. And you know, we got to have one today.\n Jay Clouse 4:13  Jump Capital has invested in a previous Pod Co Balto, they’ve invested in Personal Capital, just to name a couple of companies that you’ve heard of also Lisnr in Cincinnati. He talked about them being explicit and what they actually invest in. They also say on their website that they invest $1 to $10 million in their first investment, when companies have a $1 to $5 million revenue run rate. And typically, less than $10 million of investment so far today, so yeah, very explicit on their website in terms of industry, what types of companies are looking for, even at what stage? You know, the investment, the investment terms are?\n Eric Hornung 4:51  Yeah, they have a operating partner model which is much more like private equity than it is a lot of the venture capital firms. We talked to the platform model almost. So when you’re very specific about the types of companies that you’re going to invest in, I think that operating model becomes stronger because you can get the best people to do the specific thing that needs to be done in these four focus areas in that very specific space where its product market fit has been met and it is growth time.\n Jay Clouse 5:21  All right. Well, we’d love to hear your thoughts on this episode with Saurabh as we go through, you can tweet at us @UpsideFM or email us Hello@upside.FM. And we’ll get into that interview right after this. This episode of upside is sponsored by Tresta. Tresta is an app for iPhone and Android that lets you do business calling and texting from anywhere with no hardware. Just a smartphone you’re already using. Tresta is the best business phone app on the market. Whether you’re a founder or freelancer, just starting your business or you’re already established. Growing your network and your business is all about communication. You’ve got to be available no matter where you are. Tresta offers the call management features that empower you to communicate smarter and more efficiently, like auto attendance, call recording, user groups and more. And you don’t need any special equipment, just the smartphone you’re already using. Tresta is easy to configure. So you can set everything up yourself all online. Tresta’s virtual phone system makes it easier and more affordable than ever to set up a fully functioning mobile office. It’s just $15 per user per month with no contract. So start your free 30 day trial today at www.tresta.com/upside. That’s www.tresta.com/upside. Saurabh welcome to the show.\n  Eric Hornung 6:47  Let’s take it on a rocket ship. How did you get to Jump Capital.\n Saurabh Sharma 6:51  Yeah, I mean it’s a kind of an unconventional path. I don’t think I was looking misery your venture capitalist. From a career perspective. I think it’s a three organic way down. Journey has been a little bit all over the place, which I think bodes well to venture frankly, just kind of amalgamation of a bunch of things. But you know, I’m fundamentally I’m an engineer by training and science, grew up in India in engineering there, got a scholarship to Apollo undergrad in France. Finish that became a computer science researcher in France, in the National Research Labs, got an opportunity to come to my masters and possibly a PhD at Cornell, where they’re in just kind of got brainwashed of Academia, by Wall Street, being brothers and all the banks that just go to campus and hire quantum computer science guys, so I just finished my Master’s in Cornell, join Lehman Quanta Algo trading desk was there, you know, the hay days and just perfect time as they’re even open to await the peak of Lehman. And so you know, phenomenal times, obviously, ranging from fairly very large scale architectures for competition trading in New York, London, and some phenomenal desks in the Ritz trading. Bring meeting go face. Solid tobacco was there almost to the end not exactly to the end I had an opportunity to apply for business schools which I had been pushing off and I thought really good time. After 07, there are some signs they might be weaker and then I got my admit I got took some time off and moved to India back to this small snippet of equity for business school, but I didn’t know it was gonna go up. It kind of blew up premier the first week I started my business school in Chicago booths. So the next year was kind of experimenting, starting my own company a bunch of my friends. And then you know, I’m preparing to started doing them for them and post that went back to Wall Street a little bit works on capitals with Bob Lehman at the time realized probably wasn’t for me back Michael was the chief quite a bit to join early stage uncle life Bank of Chicago Southern by April kowski Radke local mountain nurse in the region funded that a startup that I was involved in earlier. And then it allowed us to spend some time with light bank, Eric ended up being the Groupon CEO asked me to come along during some times to kind of turn around the story. And so another kind of run at pretty phenomenal setup of interesting projects of turning around the business. I was involved in an internal data science team run mobile relevant strategy, and then Mary Barra fashion conference in New York. So running operations and marketing for that, for that business in an intersection folks a jump and it was kind of good amalgamation a jump, as we will talk about more it has some relevance to so creating groups, very computational focus. So that can all put it together. You know, I’m actually in background I’ve been venture, I’ve been in tech and to join the joint jump for about four and a half years ago. So again, somewhat unconventional but but took me multiple paths. But I think all that is super helpful, both from being an operator and investor and then venture.\n Eric Hornung 8:29  Leaving Lehman in ’07-08, And they say you can’t time the market.\n Saurabh Sharma 10:02  Yeah. Oh, wait, that’s true that that probably was, you know, it’s interesting. And you know, I was probably going to be . Lehman was going to pay for my business school. So that’s the only opportunity cost wise became quite a bit but yeah, I can I can complaint I was in middle school in September ’08.\n Eric Hornung 10:19  What’s the difference between doing business specifically private equity style business in India versus doing it in the United States?\n Saurabh Sharma 10:26  Yeah, I mean, you know, product in India is very different. It’s a by design, it’s a high growth market, right? It’s not a country as a whole is growing fast. So there’s no real LDOs. There is not a levered market. Everything is growth equity in itself, even private equity where you do majority purchases, still all equity. That’s one piece. Second, I think the ticket sizes are small. I mean, you know, you don’t have many, many multi billion dollar businesses in India. All the larger ones are many of them are family run businesses, to smaller clips. I think the third is I think it’s just a different cowork culture governance cultural, so you have to be just comfortable navigating that promoter aspect and how to deal with people who are used to doing businesses in Indian way is probably a third aspect of it. So all those things, I would say it’s very structurally different. And also you innovate you financially can structure those from actually somewhat different as long years of sophisticated market, of course, has, you know, obviously been short over many, many years. So they’re just a, you know, any ecosystem play, you play with the debt guys, the lenders equity guy that, you know, just kind of machine that that sense on the entry point, the exit side. So I think it’s very different from that, where he was, you know, kind of translating that adventure of adventure just, you know, wanted to put them real opposite from private equity. I think there’s some relevance is that growing markets, but you know, here you’re solving for technology disruption, the most cutting edge things out there, you know, changing the status quo. And so it’s a good parallel to growth, I would say good Palo Alto in terms of like technology because a lot of stuff in private equity is kind of you look a lot of outsource businesses and IT services kind of businesses, it kind of works well in venture. But other than that, I mean, you know, venture is going already taking a very long term view, and then really build up right versus necessarily focus on cash flow and vision, so forth, of course, want to do that. But that’s probably a kind of second part of business skills.\n Jay Clouse 12:18  You were at Groupon in Chicago, which is one of the more storied startup companies in Chicago. And you were working on the you were the head of relevant strategy personalization for these products. I would love to hear what the nature of some of the problems you’re trying to solve were, in any of the lessons learned doing that in terms of search and personalization, because I have to think it was kind of a frontier effort. That is probably more commonplace in products today.\n Saurabh Sharma 12:46  Yeah, I mean, you know, think about Groupon story, right? It’s one of the first big hyper local stories, right? This is a time that you talk about solo mono social, local, mobile, and everyone was talking about that a group I’m with you You know, just really robbing that feeds. And when you talk about the hyperlocal concept, one model is the centerpiece of it just because you’re carrying your phone and it’s all about key, how can do I present you the most relevant piece our deal to you as we walk by the pizza store in a hair salon, or anything. So you’re like, that product that I was involved with is very the center of it, of solving that relevance problem is solving that recommendation problem. And it’s very different from traditional recommendations of, hey, you buy this product, or you buy this product as well, which is, you know, not easy, but you know, it’s somewhat of a, I would say, vanilla in terms of versus wanting something in real time and relevance. So I mean it’s as a combination, large data science effort, collecting tons of terrabytes of data, and then solving for that in real time in optimizing on that right and that was that was the centerpiece of driving revenue for the least a local business school for Groupon. Groupon has a good business and travel business and but local is was the biggest and it was pretty cool to that and and I was very specifically focused on the mobile piece, because the female piece that you all know, you’re known for sending tons of emails, which is more so static, and this is more dynamic. So for now, you know, one, it was normal experience, mostly because at that time to be able to work with such scale of data is exciting itself is that good that data? As we all know, solving for data science machine learning problems, the more data, the more interesting work you can do with it. So it does a second piece. So I was I was kind of on the more on the product side and working pretty closely with the business teams on one end, right with delivering these products. And another side of our core data center human beings are kind of building optimizing the models and we’re basically solving for optimization rates and feedback on both sides. Either the data part is not correct, or that if you get the modeling results, and how do you then present the right deals, and then source those deals, according to the feedback loop on getting the right kind of build some kind of this customers.\n Eric Hornung 14:56  We hear so much about how data science has been accelerating the last few years. What were the limitations you’re running into at Groupon when it came to data and data science.\n Saurabh Sharma 15:06  Aggregation is always a challenge, right? You know, lucky, Groupon was early enough in building a very nice infrastructure in the aggregation side. But the you can still solve the aggregation trying to bigger challenge come as they are not version of cleaning. And you will hear from anyone I’ve got working with in the field, you know, people talk about the analytics at the end. You know, I don’t want to diminish analytics, of course, and that’s, that’s core, but you can’t do analytics unless you have the analysis mirror is huge effort on normalization data cleaning harmonization, and then find the right data, to build the models and optimization, create a feedback loop. And I would say that I don’t I can’t say that the challenge has been really solved even today, it’s probably better. But then more more sorts of data now come into the mix in then when you start mixing structured and unstructured data, with blob data, object data, all of that because create more poses more challenges, so infrastructure, It solves that is pretty critical. How to talk about the challenges you’re facing all the time. I mean, the second challenge is we’re always about, you know, accuracy. And I would say real time nature of some of the work that I was doing was also really hard. Because it’s when you go for real time, you’re kind of somewhat scoping out the amount of data that you have to work with to produce a result because it picks up signals. And so that’s, that’s another set of problem, right? It’s kind of like solving for real time streaming data challenges.\n Eric Hornung 16:29  So often we see venture capitalists kind of have this association with what they want to invest in versus what they have historically been involved in. So when we look at your background, and it’s Lehman and finance and then Groupon, I would think, okay, you’re gonna be really heavily involved in the consumer space, the FinTech space, and then you look at your resume and its cloud infrastructure and enterprise software. How did how did when you met Jump, you said, I want to go in and focus on these two things.\n Saurabh Sharma 17:00  Cloud infrastructure lackey pretty relevant to my background, I’m a computer science major undergrad, master’s, my earlier research was in power computing and compiler optimization. So pretty deeply technical and as has our please get in all my work at demon was all quantitative algorithmic trading, saying, and that is all about building. It’s not really financial calculations. It’s really building large scale architecture and solving for modeling and so forth. So I will say up to that point, it’s actually super relevant to what I do. And you know, financial services is one of the biggest buyers of all the deep end. Probably the best buyers of infrastructure. So, that part of the deal typically are you living Groupon itself? Right? Again, I was in, you know, a data science modeling mobile relevance team. So again, very relevant to what I invest in. I just love being analytics here. All that stuff’s in Yo, yo, no large competition marketing stack for econ business. Have you thought at Groupon. So, you know, really evaluating tons of martech there and the operation software, you know, the consumer PC right and bought, including my bank, which I you know, as I would say at that time at least was very consumer heavy, especially, you have an open route background and DuPont story and then go buy for itself. I don’t think you preclude consumer as such, I just think they are significantly more enterprise software heavy. I would say if it’s a pure consumer deal with a jump I probably would take a front seat and evaluating that and we do look at that. I think consumer in general is hard. And econ is even harder in the era of Amazon and Walmart now actually pretty good job. I just mean, other econ businessess, this harder batch for us to spend time on and there’s so much other technology stuff go after.\n Jay Clouse 18:47  What makes Jump a better capital partner for an entrepreneur entrepreneur than other capital partners?\n Saurabh Sharma 18:55  I’m gonna just steal a phrase from my partner who said “You always say there are only so many permutations on venture”. You know, I think I think we keep it simple. Of cou\n......", "posttime": "2020-07-14 02:26:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,基础架构,capital,数据", "title": "云基础架构和企业软件的A/B系列资本", "title_en": "Series A/B capital for cloud infrastructure and enterprise software", "transed": 1, "url": "https://upside.fm/saurabh-sharma-jump-capital/", "via": "", "real_tags": ["软件", "基础架构", "capital", "数据"]}, {"category": "", "categoryclass": "", "imagename": "98507eaa3dfe3e843a7ba284c00047fc.png", "infoid": 1011575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google News JS是一个用于抓取Googlenews数据的开源软件包。它提供了对主要Google新闻功能的简单API访问。\n您可以使用该库来检索最流行的当前标题，按主题、地理位置或仅使用简单搜索来检索标题。\nconst news=Required(&#39；gnews&39；)；const main=async()=&gt；{const starship=等待消息。搜索(星际飞船的物品){控制台。日志(文章。pubDate+&#39；|&#39；+文章。标题)；}}；Main()；\n周一2020年7月13日格林尼治标准时间11：33：00|SpaceX火星城：令人难以置信的粉丝视频显示星际飞船返回地球-逆行星期五，2020年7月10日格林威治时间20：37：00|新图像显示SpaceX的星际飞船工厂，发射场随着时间的推移而增长-Business Insider-Business InsiderSun，2020年7月12日格林威治时间07：15：00|SpaceX发射：星际飞船原型&#39；本周重新安排的第一次500英尺试飞-Express.co.ukFri，2020年7月10日格林威治时间14：35：28|世界终于开始关注星舰部队-VergeSun，2020年6月07：00：00 GMT|SpaceX星舰：不可思议的猎鹰9号比较显示了为什么球迷们很兴奋-InverseTue，2020年6月23日07：00：00 GMT|Boom！SpaceX故意在压力测试中推出巨大的星舰SN7测试箱(视频)-Space.comFri，2020年7月10日08：57：39 GMT|SpaceX定于下周进行的首次星舰飞行(Re)-TeslaratiFri，2020年7月10日22：19：34 GMT|SpaceX将于下周将其星舰火箭原型飞向近500英尺的空中-每日邮报，2020年7月6日17：46：57 GMT|How“Starship Troopers”\nconst news=Required(&#39；gnews&39；)；const main=async()=&gt；{const print=item=&gt；console。日志(项目。pubDate+&#39；|&#39；+项目。标题)；控制台。日志(&#39；标题&#39；)；Const Heads=等待消息。标题({n：5})；标题。forEach(打印)；控制台。日志(#39；主题#39；)；持续主题=等待消息。主题(&#39；业务&#39；，{n：5})；主题。forEach(打印)；控制台。日志(&#39；Geo&39；)；const geo=等待消息。Geo(&#39；New York&#39；，{n：5})；Geo。forEach(打印)；控制台。log(&#39；search&#39；)；const search=等待消息。搜索(&#39；SpaceX&39；，{n：5})；搜索。forEach(打印)；}；main()；\n头条新闻2020年7月13日星期一格林威治时间11：17：00|白宫将矛头对准福奇，因为他在病毒问题上与特朗普意见不同-CNNMon，2020年7月13日格林威治时间08：30：00|&#39；立即适应或找到新工作&#39；：参议院共和党面临筹款紧急情况-POLITICOMon，2020年7月13日格林威治时间02：44：00GMT|波兰总统杜达和挑战者Trzaskowski在高投票率中势均力敌-华盛顿邮报，2020年7月13日02：06：30 GMT|在圣地亚哥海军舰艇爆炸事件中调查21名水手和平民住院的官员-ABC Newsun，2020年7月12日格林威治时间23：57：47|Robert Mueller：Roger Stone“仍然是一名被判有罪的重罪犯，右。2020年7月13日格林威治时间01：35：00|由于交易员在欧佩克会议上着眼于放松减产，油价下滑-Investing.com Mon，2020年7月13日11：14：35 GMT|谷歌在印度-EngadgetMon上押注100亿美元，2020年7月13日格林威治时间10：26：00|百事公司收入下降3%，因为流行病打击了饮料销售，但提振了零食业务-CNBCMon，2020年7月13日10：55：00 GMT|道指期货作为投资者上涨超过200点。2020年7月12日13：06：00 GMT|不夜城面临危机的夜生活-POLITICOSun，2020年7月12日15：56：45 GMT|冠状病毒新闻：官员们监测纽约州北部州外旅行后病例的增加-WABC-TVSun，2020年7月12日13：00：00 GMT|售价约125万美元的房屋-纽约时报太阳，2020年7月12日19：38：00 GMT|失业的纽约。2020年7月12日格林威治时间22：00：00|SpaceX的成功让亚洲初创企业梦寐以求-金融时报，2020年7月10日13：08：36 GMT|SpaceX推迟了其最新一批Starlink卫星的发射，两艘搭便车的航天器-VergeSun，2020年7月12日21：32：36 GMT|SpaceX火箭将打破NASA航天飞机重用纪录-TeslaratiFri，2020年7月10日20：37：00 GMT|New。的星舰工厂，发射场与时俱进-商业内幕-商业内幕", "note_en": "Google News JS is an open-source package for scraping GoogleNews data. It provides easy API access to main Google Newsfeatures.\n     You can use the library to retrieve most popular current headlines,retrieve headlines by topic, geographic locations or just using simplesearch.\n  const  news  =  require ( &#39;gnews&#39; ) ; const  main  =  async  ( )  =&gt;  {  const  starship  =  await  news . search ( &#39;Starship&#39; ) ;  for  ( let  article  of  starship )  {  console . log ( article . pubDate  +  &#39; | &#39;  +  article . title ) ;  } } ; main ( ) ;\n  Mon, 13 Jul 2020 11:33:00 GMT | SpaceX Mars city: incredible fan video shows Starship returning to Earth - InverseFri, 10 Jul 2020 20:37:00 GMT | New images show SpaceX&#39;s Starship factory, launch site grow over time - Business Insider - Business InsiderSun, 12 Jul 2020 07:15:00 GMT | SpaceX launch: Starship prototype&#39;s first 500ft test flight rescheduled for THIS WEEK - Express.co.ukFri, 10 Jul 2020 14:35:28 GMT | The world is finally coming around to Starship Troopers - The VergeSun, 07 Jun 2020 07:00:00 GMT | SpaceX Starship: incredible Falcon 9 comparison shows why fans are excited - InverseTue, 23 Jun 2020 07:00:00 GMT | Boom! SpaceX pops huge Starship SN7 test tank on purpose in pressure test (videos) - Space.comFri, 10 Jul 2020 08:57:39 GMT | SpaceX’s first Starship flight (re)scheduled for next week - TeslaratiFri, 10 Jul 2020 22:19:34 GMT | SpaceX set to fly its Starship rocket prototype nearly 500 feet into the air next week - Daily MailMon, 06 Jul 2020 17:46:57 GMT | How “Starship Troopers” Aligns with Our Moment of American Defeat - The New YorkerTue, 30 Jun 2020 07:00:00 GMT | Starship SN5 completes successful cryogenic proof, commencing test campaign - NASASpaceflight.com\n  const  news  =  require ( &#39;gnews&#39; ) ; const  main  =  async  ( )  =&gt;  {  const  print  =  item  =&gt;  console . log ( item . pubDate  +  &#39; | &#39;  +  item . title ) ;  console . log ( &#39;Headlines&#39; ) ;  const  heads  =  await  news . headlines ( { n :  5 } ) ;  heads . forEach ( print ) ;  console . log ( &#39;Topics&#39; ) ;  const  topics  =  await  news . topic ( &#39;BUSINESS&#39; ,  { n :  5 } ) ;  topics . forEach ( print ) ;  console . log ( &#39;Geo&#39; ) ;  const  geo  =  await  news . geo ( &#39;New York&#39; ,  { n :  5 } ) ;  geo . forEach ( print ) ;  console . log ( &#39;Search&#39; ) ;  const  search  =  await  news . search ( &#39;SpaceX&#39; ,  { n :  5 } ) ;  search . forEach ( print ) ; } ; main ( ) ;\n  HeadlinesMon, 13 Jul 2020 11:17:00 GMT | White House takes aim at Fauci as he disagrees with Trump on virus - CNNMon, 13 Jul 2020 08:30:00 GMT | &#39;Adapt immediately or find a new job&#39;: Senate GOP confronts fundraising emergency - POLITICOMon, 13 Jul 2020 02:44:00 GMT | Polish President Duda and challenger Trzaskowski in tight race amid high turnout - The Washington PostMon, 13 Jul 2020 02:06:30 GMT | Officials investigating after 21 sailors, civilians hospitalized in San Diego naval ship explosion - ABC NewsSun, 12 Jul 2020 23:57:47 GMT | Robert Mueller: Roger Stone “remains a convicted felon, and rightly so.” - Vox.comTopicsMon, 13 Jul 2020 10:04:00 GMT | Chipmaker Analog Devices to buy Maxim Integrated in an all-stock deal worth $21 billion - CNBCMon, 13 Jul 2020 01:35:00 GMT | Oil slips as traders eye supply cut easing at OPEC meeting - Investing.comMon, 13 Jul 2020 11:14:35 GMT | Google makes a $10 billion bet on India - EngadgetMon, 13 Jul 2020 10:26:00 GMT | PepsiCo revenue falls 3% as pandemic hits beverage sales but boosts snacks business - CNBCMon, 13 Jul 2020 10:55:00 GMT | Dow futures up more than 200 points as investors prepare for earnings season kickoff - MarketWatchGeoSun, 12 Jul 2020 21:20:00 GMT | SEE IT: Bronx man puts NYPD cop in headlock as crowd cheers - New York Daily NewsSun, 12 Jul 2020 13:06:00 GMT | Nightlife facing crisis in the city that never sleeps - POLITICOSun, 12 Jul 2020 15:56:45 GMT | Coronavirus News: Officials monitoring uptick in cases in upstate New York after out-of-state travel - WABC-TVSun, 12 Jul 2020 13:00:00 GMT | Homes That Sold for Around $1.25 Million - The New York TimesSun, 12 Jul 2020 19:38:00 GMT | Unemployed New Yorkers in Jeopardy of Losing Benefits - Spectrum News NY1SearchSat, 11 Jul 2020 14:29:00 GMT | SpaceX delays launch of Starlink, BlackSky satellites again due to rocket checks - Space.comSun, 12 Jul 2020 22:00:00 GMT | SpaceX success has Asia start-ups dreaming of the stars - Financial TimesFri, 10 Jul 2020 13:08:36 GMT | SpaceX delays launch of its latest batch of Starlink satellites, with two hitchhiking spacecraft - The VergeSun, 12 Jul 2020 21:32:36 GMT | SpaceX rocket set to smash NASA Space Shuttle reuse record - TeslaratiFri, 10 Jul 2020 20:37:00 GMT | New images show SpaceX&#39;s Starship factory, launch site grow over time - Business Insider - Business Insider", "posttime": "2020-07-14 02:26:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,java,javascript,用于,minimalistic", "title": "Gnews-用于Google新闻抓取的简约JavaScript库", "title_en": "Gnews – minimalistic JavaScript library for Google News scraping", "transed": 1, "url": "https://github.com/DatanewsOrg/google-news-js", "via": "", "real_tags": ["google", "java", "用于"]}, {"category": "", "categoryclass": "", "imagename": "ad79ab501c1361c72c3a79afd2eb0a93.jpeg", "infoid": 1011573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在节点加入和离开时，动态维护由WebRTC连接的节点的树状覆盖拓扑。每个节点接受最大数量的新连接，之后将较新的连接请求委派给子节点。\n//在根节点上，nodevar bootstrap=require(&#39；webrtc-bootstrap&#39；)(&#39；server主机名或IP：port&#39；)var节点=REQUIRED(&#39；WebRTC-TREE-OVERLAY&#39；)变量ROOT=新的通道函数(Node(bootstrap).becomeRoot(&#39；secret&#39；)root.on(&#39；child-connect&#39；，){CHANNEEL.SEND(&#39；；PING&39；)CHANNEL。ON(&#39；DATA&#39；，function(Data){console.log(Data)})}))}))//在子节点引导数据库=.var节点=.var node=new Node(bootstrap).join()node.on(&#39；parent-connect&#39；，Function(Channel){channel(&#39；data&#39；，function(Data){console.log(Data)channel el.send(&#39；pong&#39；)})})node.on(&#39；Child-connect&#39；，function(Data){console.log(Data)channel el.send(&#39；pong&#39；)})node.on(&#39；Child-connect&#39；，function(Channel){channel.send(&#39；ping&#39；)})。\nopts.requestTimeoutInms候选人将被考虑加入的时间上限。如果在间隔结束前连接握手未成功，则拒绝候选。\n保留的孩子和候选人的最大数量。如果加入请求到达时，它将被传递给其中一个子项，或者一直保留到其中一个候选项成为已连接的子项。\n父通道，如果节点尚未加入或为根，则为NULL。\n成为root(通过引导客户端)，之后节点将自动处理加入请求。\n是父级通道是来自我们的父级(True)还是来自我们的某个子级(False)。\n抽象基础WebRTC通道以将树联接协议与应用程序级消息多路复用。可以在这些信道上的拓扑上发送轻量级消息。但是，对于任何繁重的数据流量，都应该建立专用的SimplePeer连接。该通道可以用于该目的。\n构造函数在加入过程中由节点在内部调用，并且不能公开使用。\n通道的标识符，与两端的Node.id不同。从子级的角度来看，其父级的ID始终为空。从父级的角度来看，每个子级都有一个非空的唯一ID。\n在内部使用。在联接请求到达时激发。应用程序应该不需要为这些而烦恼。", "note_en": "Dynamically maintains a tree overlay topology from nodes connected by WebRTC asthey join and leave. Each node accepts a maximum number of new connections afterwhich the newer connection requests are delegated to children.\n   // On the root nodevar bootstrap = require(&#39;webrtc-bootstrap&#39;)(&#39;server hostname or ip:port&#39;)var Node = require(&#39;webrtc-tree-overlay&#39;)var root = new Node(bootstrap).becomeRoot(&#39;secret&#39;)root.on(&#39;child-connect&#39;, function (channel) { channel.send(&#39;ping&#39;) channel.on(&#39;data&#39;, function (data) { console.log(data) })})// On a child nodevar boostrap = ...var Node = ...var node = new Node(bootstrap).join()node.on(&#39;parent-connect&#39;, function (channel) { channel.on(&#39;data&#39;, function (data) { console.log(data) channel.send(&#39;pong&#39;) })})node.on(&#39;child-connect&#39;, function (channel) { channel.send(&#39;ping&#39;) })\n                opts.requestTimeoutInMs the upper bound on the time a candidate will be considered for joining. If the connection handshake has not been successfully before the end of the interval, the candidate is rejected.\n      The maximum number of children and candidates that are kept. If a join request arrives while it will either be passed to one of the children, or kept until one a candidate has become a connected child.\n  The parent channel, null if the node has not joined yet or is the root.\n  Become root (through the bootstrap client), after which the node will automatically handle join requests.\n      isParent whether the channel is from our parent ( true) or one of our children ( false).\n              Abstracts the underlying WebRTC channel to multiplex the tree join protocol with application-level messages. Lightweight messages can be sent on the topology on those channels. However, for any heavy data traffic a dedicated SimplePeer connection should be established. The channel can be used for that purpose.\n The constructor is called internally by a Node during the joining process and it is not available publicly.\n  Identifier of the channel, different from the Node.id on either side. From the point of view of a child, the id of its parent is always null. From the point of view of a parent, each child has a non-null unique id.\n              Used internally. Fires when a join request has arrived. An application should not need to bother with those.", "posttime": "2020-07-14 02:26:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webrtc,个人,fat,通道", "title": "GENET：基于WebRTC的个人志愿者计算胖树覆盖", "title_en": "Genet: Fat-Tree Overlay for Personal Volunteer Computing Using WebRTC", "transed": 1, "url": "https://github.com/elavoie/webrtc-tree-overlay", "via": "", "real_tags": ["webrtc", "个人", "fat", "通道"]}, {"category": "", "categoryclass": "", "imagename": "3b073c806526ba9a56c1f61a1d19a1df.png", "infoid": 1011571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联系那些想要讲述你创业故事的人。可视性不需要昂贵或耗时。\n请求邀请。\n在您的用户查找相关内容时被发现。通过思想领导和讲故事来建立信任。\n通过获得媒体报道和在行业活动上发言来激发信心。你的故事可以把你和合适的人联系起来。\n通过在第三方平台上讲述您的故事并在行业活动中分享您的专业知识来吸引高素质人才。\nEllisX是我的秘密武器，也是最划算的。他们找到机会，我就按业绩付钱。还有什么比这更好的呢？\n对于创业者来说，EllisX是一个很棒的平台，让他们可以与创业生态系统联系起来，并通过加速器和媒体传播自己的名字。它的效果非常好，特别是对于那些更关注产品和客户而不是把时间花在营销上的技术创始人来说。\n&#34；非常感谢EllisX将我与GA联系起来！我参加的座谈会是一次非常棒的经历，以至于在会议结束后，每个人都留在了座位上，继续交谈。这不仅对我来说是一次伟大的经历，而且对于波士顿一些探索产品管理作为职业的令人惊叹的人才来说也是一次伟大的经历。\n通过将企业家与演讲机会和记者联系起来，EllisX正在解决市场需求。我加入这个平台的时间很短，而且由于EllisX；的人脉关系，我最近在一个面向女性企业家的小组讨论中发表了讲话。谢谢你，EllisX！&#34；\nEllisX为我提供了一种完全无缝的、有价值的知名度体验。我注册了他们的平台，一两周内就有机会在大会的一个小组上发言。在加入这个性价比高的平台后，我不能指望会有一个更好的第一个结果，我肯定可以看到这个平台颠覆了公关界。强烈推荐EllisX！", "note_en": "Connect with people who want to tell your startup story.  Visibility doesn’t need to be expensive or time-consuming.\n Request an invite\n   Get discovered while your users are looking for relevant content. Build trust through thought leadership and storytelling.\n Inspire confidence by getting media coverage and speaking at industry events. Your story can connect you with the right people.\n Attract high-caliber talent by telling your story on third-party platforms and sharing your expertise at industry events.\n  EllisX is my secret weapon and the best bang for the buck around. They find opportunities, I pay for performance. What could be better than that?\n EllisX is a fantastic platform for entrepreneurs to connect with the startup eco system and get the name out there with accelerators and media. It works very well especially for technical founders who are more focused on product and customer than spending time on marketing.\n &#34;Big thanks to EllisX for connecting me with GA! The panel I was on was a great experience so much so that after it was over everyone remained in their seats and continued the conversation. This was not only a great experience for me but also a great experience for some of the amazing talent in Boston exploring product management as a career.&#34;\n &#34;EllisX is solving a need in the marketplace by connecting entrepreneurs with speaking opportunities and journalists. I&#39;ve only been part of the platform for a short time and because of EllisX&#39; networks, I recently spoke on a panel for female entrepreneurs. Thank you EllisX!&#34;\n EllisX provided me with a completely seamless and valuable &#39;earned visibility&#39; experience. I signed up for their platform, and within a week or two was offered a speaking opportunity on a General Assembly panel. I couldn&#39;t have hoped for a better first result after joining this cost-effective platform that I could definitely see disrupting the world of PR. Highly recommend EllisX!", "posttime": "2020-07-14 02:25:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "更具,startup,ellisx", "title": "让您的启动更具可见性", "title_en": "Make Your Startup More Visible", "transed": 1, "url": "https://www.ellisx.com/", "via": "", "real_tags": ["更具", "startup", "ellisx"]}, {"category": "", "categoryclass": "", "imagename": "191472858d59784c8f3c4763a0bd3ac4.jpg", "infoid": 1011570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，一组考古学家和工程师正在开发一些令人惊讶的新技术，为子孙后代保护水下遗址。\n“你确定我能过河吗？”我几乎要大喊大叫才能被听到。木板条点缀在我面前的地面上。在我右边大约30米处，水蒸气以厚厚的灰白色云朵升入天空。在我现在站的地方和那里之间的某个地方，地球从固体和凉爽变成了沸腾和粘性。无论那个确切的变化发生在哪里，我都想确保我不会离得太近。\n我当天的导游、火山学家恩佐·莫拉(Enzo Morra)说：“不，不。”在我之前，他已经在爬木板另一边的小山了。\n我一只脚踩在一块木头上，然后又踩到另一块木头上。地面摸起来很结实。当我到达远处，爬上山顶时，我可以看到蒸汽的来源：一个冒着泡的暗淡的青铜灰色泥浆池，像巫婆的大锅里的东西一样不祥，而且声音大得多。空气中弥漫着硫磺的味道。\n“这里非常危险，”当我到达时，莫拉欢迎我。“比维苏威火山还危险。”\n我紧张地笑了。“我希望我们在那里的时候你能告诉我这件事。为什么我们在这里的时候你要告诉我这个？“。\n我们俯瞰着坎皮·弗莱格里的一个烟囱，在英语中被称为弗莱格雷地区。坎皮·弗莱格里火山是地球上已知的20座“超级火山”中的一座，其喷发的体积是普通火山的几千倍。弗莱格里火山的声名狼藉程度不及西边仅30公里的维苏威火山。但这在很大程度上要归功于运气。如果今天坎皮·弗莱格雷的风力达到最大，那么摧毁庞贝的公元79年维苏威火山喷发看起来就像小狗打喷嚏一样。幸运的是，坎皮·弗莱格里火山几千年来没有全面喷发过。\n这并不是说这是不可能的。研究人员称这座超级火山“焦躁不安”，有人担心它正变得越来越不安。2012年，警戒级别从绿色提高到黄色，表明需要更多的监测。最近，2020年4月的一次“震群”发生了34次不同的地震。\n坎皮·弗莱格里不仅仅是(断断续续的)打盹的威胁。这就是为什么古罗马人在这里建造了意大利半岛上最宏伟的度假小镇之一：以温泉和不良行为而闻名的拜埃。这也是为什么在接下来的几个世纪里，该镇至少有一半的地方及其珍贵的大理石、马赛克和雕塑沉入地中海。现在，这座“永不停歇”的超级火山是这个考古遗址今天面临危险的原因--既间接地，归功于海洋对文物的影响，也直接地，就地震或另一次火山喷发的威胁而言。\n罗马人几乎没有办法知道何时会爆发或地震。当谈到保护他们的城镇免受海水侵蚀时，他们几乎无能为力。但现在已经不是这样了。今天，一组考古学家和工程师正在开发一些令人惊讶的新技术，为子孙后代保护水下遗址。这就是我来这里了解更多情况的原因。\n这座超级火山方圆13公里，几乎所有的火山都在地面或海底，有24个火山口和150多个沸腾的泥潭。很容易看出，最先在这里定居的古希腊人是如何想出这个名字的：“菲尔格雷斯”是从早期的希腊语动词phlégō(“燃烧”)中衍生出来的。\n坎皮·弗莱格雷的危险不仅仅在于它的大小和强度，还在于它的随机性。当像维苏威火山这样的火山喷发时，你知道喷发将从哪里来：顶峰的圆锥体。这里不行。\n“这项活动从来都不是在同一个地方进行的。每一次喷发都有它自己的故事和排放地点，“莫拉说。因此，我们显然不知道火山喷发会在什么时候发生。但我们也不知道下一次火山喷发会发生在哪里，如果有的话。“。\n另一个危险是活动的类型：Campi Flegrei超过90%的活动是爆炸性的，而不是热情洋溢的。换句话说，当它爆炸时，它不会将熔岩泄漏到地面上；它会将一柱岩石和熔岩撞向空中。当碎石落地时，火山灰将使天空变黑，空气变浓，使人几乎看不见，呼吸也几乎不可能。柱子的坍塌导致了一股火山碎屑流：高达700摄氏度的极端高温将其路径上的一切蒸发。\n至少，这是发生在39,000年前的事情，也就是坎皮·弗莱格里最大喷发的日期。熔岩喷出70公里高。远至西伯利亚都发现了灰烬。爆炸的威力如此之大，火山坍塌成了火山口。在接下来的几年里发生的降温甚至可能导致了尼安德特人的灭绝。\n一万五千年前，坎皮·弗莱格雷火山再次喷发。火山喷发没有那么大，但它向空中抛出了大量的黄色凝灰岩-足以赋予那不勒斯今天的颜色。人们用当地的石头雕刻和建造，使宫殿、教堂甚至地下隧道呈现出金色。\n上一次重大喷发是在1538年。与前两次相比，这是微不足道的。它也足够大，可以抛出5.5公里高的火山灰和浮石。当柱子倒塌时，它创造了一座“新山”(字面意思就是蒙特诺沃)，高123米，下面掩埋了一个村庄。如果今天发生这种情况，在意大利第三大人口城市那不勒斯附近，损失将是严重的。\n“很明显，我们不能做出估计，”莫拉几乎懒洋洋地说。“我们知道一座活火山，任何一座活火山都可以喷发。显然，在我们心中--我们希望不会。“。我看起来很担心。“鼓起勇气！”他说。“与维苏威火山一样，坎皮·弗莱格雷火山也受到世界上最古老的火山天文台--维苏威火山天文台同事的持续监测。这可以让我们感觉更宁静。“。\n密切的监测意味着可以提前几个月预测火山喷发。有了足够的警告，希望大都会地区能够安全疏散。\n即将喷发的迹象并不是火山学家收集的唯一数据。维苏威天文台也是第一个发现并绘制了一种被称为“缓慢主义”的现象：随着时间的推移，陆地缓慢上升和下降。随着坎皮·弗莱格里巨大的岩浆室中的岩浆在地下3公里以下移动，地面也在移动--有时非常明显。在过去的15,000年里，岩浆的运动将其上方的陆地向上推高了约90米。与此同时，火山口的其他部分已经下降。\n因此，像维苏威火山一样，坎皮·弗莱格里赋予了周围地区许多特殊之处：火山岩柔软，易于建造；火山土富含葡萄园和柠檬园的养分；甚至海岸的月牙形，为溅水和晒太阳提供了一个海湾。\n但超级火山给该地区带来的东西，也可以带走-即使没有喷发。\n在火山口的东部边缘，贝耶的地面考古遗址俯瞰着大海。它是一个由拱门、墙壁和露台组成的层次分明的蛋糕，曾经是富有的贵族罗马人的终极度假胜地，有点像古代的拉斯维加斯。现在剥离了他们的大部分大理石、壁画和雕塑-其中许多现在在坎皮·弗莱格里考古博物馆-这些建筑看起来与几千年前几乎没有什么不同。优雅的首都，去掉了柱子，灰泥装饰，点缀着小天使和瓦片，暗示着它以前的富丽堂皇。\n当我和那不勒斯L‘Orientale大学的考古学家Michele Stefan ile一起走过遗址时，他向我指出了曾经的每一座建筑是什么：别墅，浴室，剧院。在一个房间里，我踮着脚尖绕着红白相间的马赛克走来走去。在另一处，我们欣赏墙上的壁画，仍然充满着赭色和深红色。\n罗马人来到这里的原因和我们一样：波光粼粼的地中海，温暖的天气，郁郁葱葱的植被。他们也被该地区的温泉所吸引--当然，这是他们脚下火山活动的结果。当Baiae在公元前178年第一次进入历史记录时，它被称为Aquae Cumanae(库美海)。\n但是拜埃不仅仅是一个温泉疗养地。这是一个派对小镇，是罗马人洗澡、宴请、调情和嬉戏的地方。就连诗人塞克斯图斯·普洛蒂乌斯(Sextus Propertius)也在公元前25年绝望地写下了这样一句话，这是他向他的情人和缪斯·辛西娅(Cynthia)致悼词中的一首。\n“但是你必须赶快离开堕落的拜厄岛；这些海滩给许多人带来了离婚，海滩长期以来一直是正派姑娘的敌人。对百埃之水的诅咒，爱情的耻辱！“。\n随着罗马共和国沦为帝国，拜埃的声望只会越来越高。公元39年，卡里古拉建造了一座桥-由商船连接在一起，然后用泥土覆盖-从贝耶到波佐利，长3英里，然后乘坐战车越过它。公元59年，尼禄让他的母亲阿格里皮娜在她的别墅里被谋杀。后来的哈德良皇帝将以更和平的方式结束他的生命，于公元138年在他的白昂宫自然死亡。\n更多正统的罗马人远离或声称要这样做。“难怪像塞涅卡这样的人决定把他的别墅放在那个方向的一座小山上，而不是在拜埃，”斯特凡尼尔指着海湾的另一边对我说，就是为了保持一点与世隔绝的状态。即使在公元65年他生命即将结束的时候，这位哲学家也说：“拜厄伊是一个应该避免的地方，因为尽管它有某些天然的优势，但奢侈品已经宣称它是她自己的独一无二的度假胜地。\n“奢侈品”是对的。富有的罗马人不满足于在陆地上建设，他们竖起了塔架，直接在海面上建造了别墅。贺拉斯在公元前23年斥责了他的同胞，因为他的这种行为是不谦逊的，他比普罗提乌斯更为拘谨：\n“濒临坟墓的你，承包切割大理石板材；你忘了死，急着把自己的豪宅建在海边咆哮的百埃海边--大陆的岸边是不够的。”\n撇开贺拉斯的斥责不谈，效果本应是宏伟的。“所有这些别墅、建筑群和建筑都是为了能从海面上看到而构思出来的，”我们站在露台上时，斯蒂芬妮说。在废墟的后面是一堆粉色的房屋；在那之后，是波光粼粼的水。在近处，维苏威山脉的山坡在夏季的阴霾中呈紫色。\n“我们总是犯把自己放在地面上的错误，”Stefan ile说。“但欣赏这片土地的最佳视角是大海。想象一下，在贝亚湾看到这个休闲度假胜地，这里有所有的露台、游泳池和拥挤的人。“。\n甚至在西罗马帝国衰落的时候，罗马人，然后是西哥特人和汪达尔人，继续使用拜埃的浴池。但当乔瓦尼·博卡西奥(Giovanni Boccaccio)在1344年的一本小说中描述这一点时--他写道：“阳光下没有比这里更美丽、更令人愉快的景色了”--拜厄伟大的浴池和别墅已经沦为废墟。\n由于慢性症，许多人也在水下。在过去的2000年里，该遗址的大部分都下沉了4-6米，有些地方甚至下沉了1000万米。现在，大约50%的建成区被认为是在海底。\n一些文物被沙子覆盖，将它们隐藏起来，不让人类和动物看到。但其他人就没那么幸运了。有渔民撒网拖运古代雕塑的故事，也有进入黑市的贵重物品的故事。因为没有人能确切地确定现场到底有多少物品，所以也没有人能确定有多少物品被洗劫了。\n2002年，这个177公顷的水下遗址被列为海洋保护区。虽然有执照的潜水员可以探索该地点，但他们必须与当地注册的潜水店和导游之一合作，他们认为自己是自己遗产的第一批捍卫者。今天，考古学家不再那么担心抢劫了。但其他挑战依然存在。\n“这不是一个普通的考古公园，”Stefan ile说。“你不能用栅栏把它围起来。你不能关闭它。它总是开着的。它暴露在海洋生物、海浪、潮汐和人类的存在中。“。\n芭芭拉·戴维德(Barbara Davidde)是Stefan ile的老板，也是意大利中央恢复研究所水下考古部门的主任，自1993年以来一直在Baiae工作。她说，水下文物的主要问题之一是海洋生物。细菌、双壳类、海绵--这是一种令人眼花缭乱的生物，它们不仅在海洋中安家，而且对石头和大理石材料也情有独钟。\n“如果你让这些文物敞开(例如，没有被沙子覆盖)，海洋生物就会立即开始在表面定居和生活。他们开始破坏和攻击这些材料，“她说。后来，在她位于罗马的实验室里，戴维德向我展示了她的意思：虽然马赛克在肉眼看来可能没有受到干扰，但在显微镜下，每个马赛克都是一个由洞和草皮组成的网。\n在坎皮·弗莱格里考古博物馆，一件接一件的艺术品展示了动物可能造成的破坏。虽然古罗马雕像缺少手臂或头部是很常见的，但这个收藏中的物品是不同的。一个戴面纱的女人被毁容得像鬼魂一样无形；一个供奉哈德良皇帝的底座在顶部失去了所有的形状，就像一根融化了一半的蜡烛。\n然而，我最喜欢的是坐在宝座上的一尊74厘米高的宙斯雕像。追溯到公元前1世纪，他的右侧覆盖着看起来像白色涂鸦的东西，这是海洋结壳的残留物。他的躯干上开始点缀着几个洞，把他的右臂变成了一块没有手的海绵。他的另一面-想必是埋在沙子里-几乎是原始的，他的长袍的褶皱仍然锋利。\n宙斯很可能是被抢劫者偷走的。他最终成为洛杉矶J保罗·盖蒂博物馆(J Paul Getty Museum)的收藏品，被一名策展人收购，后来被控密谋贩卖非法文物。2018年，他被送回坎皮·弗莱格里博物馆(Campi Flegrei Museum)。博物馆里的其他雕塑现在对海洋生物都是安全的。但是，仍然留在海底的文物，包括组成世界上最大的水下罗马马赛克收藏的珍贵地板，仍然处于危险之中。\n“我不认为你能在世界上找到像拜埃这样的考古遗址，”戴维德说。“我们必须找到一种方法来保护这个遗址。”由Davidde领导的一个跨学科项目Musas就是这样做的，该项目旨在将新技术应用于水下地点。\n位于蒙特诺沃的阴影下，中心次坎皮弗莱格里潜水中心是繁忙的一天，我在那里。十几名研究人员、工程师和考古学家正在安装设备-今天不仅包括潜水箱和设备，还包括防水平板电脑、电缆，甚至还有一架水下无人机。\n监督这一切的是罗马大学拉萨皮恩扎大学的计算机科学教授、穆萨的科学协调员基亚拉·佩特里奥利(Chiara Petrioli)。她是穆萨斯雄心勃勃的一个方面的幕后推手：它的水下无线传感器网络。\n当涉及到水下地点时，一个主要的挑战是沟通。我们在地面上依赖的各种网络--数据、WiFi、无线电--在水中是无效的。WiFi需要铺设电缆，穿透距离只有几厘米。无线光学更好，但只能覆盖几米的范围。\n这对考古学家对该遗址的了解程度以及如何最好地保护它的影响是巨大的。想象一下你是一个水下考古学家正在挖掘。假设你需要一个新工具。你必须浮出水面，请求，希望他们把它放在船上，然后把它带回去。来回奔波是时间密集型的，也是更危险的。\n也许，在经历了这一切之后，你会发现一幅新的马赛克。你开始揭开它，但你所能做的就是在一块简陋的黑板上草草写下基本笔记，或者用水下相机拍一些照片。如果你想和其他人商量，你必须等到你脱离债务。如果没有精确的GPS，也很难确定地点的位置。当你一天后回来的时候，沙子可能已经移动了，海底也改变了。你怎么能确定你会再找到它呢？\n科学家们发现，所有这些问题的答案是试图模仿海洋哺乳动物的交流方式：通过声波。\n“你需要使用声学通信，”佩特里奥利说。“这真的很有挑战性，因为海洋的参数可能会改变。”就像外界因素会干扰虎鲸或海豚之间的交流一样，使用声音交流的人类也是如此。温度、盐度和风都会影响两个设备之间的连接。其他声音也可以--轮船驶过，水上摩托。\n“这很复杂，但我们想出了一个主意。让我们拥有网状网络，比如多绳网络，让我们使用人工智能技术来不断改变我们使用的协议。“。如果一根电话线沿着一条直线将信息从A传送到B，网状网络就像一张网--在这种情况下是由水下无线传感器或节点组成的。当发送通信时，它可以通过多种方式从点A到达点B，从而使消息能够找到到达其最终目的地的最有效路径。随着海洋参数的变化，通信系统也会发生变化。本周，他们正在测试的方法允许在长达2公里的范围内进行通信。\n水下无线传感器网络开辟了许多可能性。潜水员现在可以使用防水智能平板电脑与彼此以及与水面上的人进行实时通信。团队可以精确定位潜水员-以及特定的地点或文物-的确切位置。这些网络甚至允许实时收集有关该遗址保护状况的数据-包括将图像发送给陆地上的专家。通过监测从水质到二氧化碳水平的一切，他们还提供了关于坎皮·弗莱格里火山活动的额外信息。\n当我访问时，团队正在测试所有的技术，他们希望在2020年夏天之前永久安装传感器。虽然由于全球冠状病毒危机而推迟了这一计划，但仍有希望在今年实现，而且不仅仅是在拜埃：穆萨斯已经获得许可，可以在普利亚和庞萨的其他意大利古代水下遗址使用同样的技术。\n但就目前而言，我不确定什么更令人兴奋：是终于有机会看到我耳熟能详的水下马赛克和废墟，还是有机会尝试一项允许潜水员像海豚一样交流的技术。\n那天晚些时候，我在潜水向导恩佐·迈奥内(Enzo Maione)之后向后滚入海中。我们下了大约5米深的水，游过了一堵曾经是别墅一部分的墙。看到这样的废墟很奇怪，上面长满了海藻，而不是苔藓，鱼在砖头周围飞来飞去。\n我们都配备了平板电脑。我看了看我的。“测试，”从船上传来一条信息。“测试正常，”我回复道。\n当我们游泳时，雾气弥漫的蓝色水面上开始浮现出一些雕像。我停顿了一下，全神贯注。这是克劳迪亚斯皇帝的女神殿，公元1世纪的统治者会在这里散步和欣赏雕像。今天这里的雕像是复制品；为了安全起见，原件已经搬到了陆地上。但这几乎无关紧要。在水中徘徊，看着鱼在我们周围飞来飞去的雕像的脸，感觉既幽灵又崇高。\n我按下平板电脑上的一个按钮，然后把它举了起来。3D版本的睡莲会是什么样子出现在屏幕上。这也是穆萨的另一个主要目标：帮助潜水员了解他们所看到的废墟。\n但最好的还在后头。Maione在海底停了下来，开始推开沙子。每扫一次，就会露出更多的马赛克，直到我们盘旋在一个错综复杂的圆形和六边形图案上。这曾经是一座宏伟别墅的中庭附近的一个房间的地板，可以追溯到2n世纪。\n.", "note_en": "Today, a team of archaeologists and engineers are developing some surprising new technologies to protect the underwater site for future generations.\n       “You’re sure I can cross?” I had to almost shout to be heard. Wooden slats dotted the ground before me. About 30m to my right, steam rose into the sky in thick grey-white clouds. And somewhere between where I stood now, and there, the earth turned from solid and cool to boiling and viscous. Wherever that exact change happened, I wanted to make sure I was none too close.\n  “ Sì, sì,” said volcanologist Enzo Morra, my guide for the day. He was already climbing the hill on the other side of the wooden slats before me.\n I edged one foot onto one piece of wood, then the next. The ground felt firm. As I reached the far side and climbed the hilltop, I could see the source of the steam: a bubbling pool of dull gunmetal-grey mud, ominous as the contents of a witch’s cauldron and a great deal louder. The air smelled of sulphur.\n “It’s very dangerous here,” Morra welcomed me when I arrived. “More dangerous than Vesuvius.”\n  I laughed nervously. “I wish you’d told me that when we were over there. Why are you telling me that when we’re  here?”\n We were overlooking one of the fumaroles of Campi Flegrei, known in English as the Phlegraean Fields. One of 20 known “supervolcanoes” on the planet – capable of erupting with a volume thousands of times stronger than an average volcano – Campi Flegrei commands less notoriety than Mt Vesuvius, just 30km to the west. But that is largely down to luck. If Campi Flegrei were to blow at maximum capacity today, it would make the 79AD eruption of Mt Vesuvius that destroyed Pompeii look like a puppy’s sneeze. Fortunately, Campi Flegrei hasn’t had a full-force eruption in thousands of years.\n That isn’t to say it’s impossible. Researchers call the supervolcano  “restless”, and  there are concerns it is becoming more so. In 2012, the alert level was raised from green to yellow, indicating a need for more monitoring. Most recently, a “seismic swarm” in April 2020  saw 34 different earthquakes.\n  Campi Flegrei is more than a (fitfully) snoozing menace. It’s why the ancient Romans built one of the most magnificent resort towns on the Italian peninsula here: Baiae, famed for its hot springs and  bad behaviour. It’s also why at least half of the town, with its precious marbles, mosaics and sculptures, sank beneath the Mediterranean over the following centuries. Now, this “restless” supervolcano is the reason why much of this archaeological site is at risk today – both indirectly, thanks to the sea’s effect on the artefacts, and directly, in terms of the threat of earthquakes or another volcanic eruption.\n The Romans had few ways of knowing when an eruption or earthquake was coming. They were all but helpless when it came to protecting their town against the encroaching sea. But that’s no longer true. Today, a team of archaeologists and engineers are developing some surprising new technologies to protect the underwater site for future generations. And that’s what I’ve come here to learn more about.\n  Over its full 13km radius, the supervolcano, almost all of it at ground level or beneath the sea, has 24 craters and more than 150 pools of boiling mud. It’s easy to see how the ancient Greeks, who settled here first, came up with the name: “Phlegraean Fields” is from the early Greek verb  phlégō (“to burn”).\n The danger of Campi Flegrei isn’t just its size and strength, but its randomness. When a volcano like Vesuvius erupts, you know where the eruption will come from: the cone at its peak. Not here.\n “The activity isn’t ever in the same place. Every eruption has its own story and place of emission,” Morra said. “Therefore, we obviously don’t know when the eruption will happen. But we also don’t know  where the next eruption will happen, if there is one.”\n Another danger is the type of activity: more than 90% of the activity Campi Flegrei is  explosive, not effusive. In other words, when it blows, it won’t leak lava over the ground; it will punch a column of rock and lava into the air. When the detritus lands, the ash will blacken the sky and thicken the air, making both seeing and breathing near-impossible. The column’s collapse causes a pyroclastic flow: extreme heat of up to 700C that vaporises everything in its path.\n That, at least, is what happened 39,000 years ago, the date of Campi Flegrei’s largest eruption. Molten rock spewed 70km high. Ashes were found as far away as Siberia. The explosion was so powerful, the volcano collapsed into a caldera. The cooling that occurred in the ensuing years  may even have helped bring about the end of the Neanderthals.\n Fifteen thousand years ago, Campi Flegrei erupted again. The eruption wasn’t as large, but it threw significant volumes of yellow tufa into the air – enough to give Naples its colour today. People carved through and built with the local stone, giving the  palazzi, churches and even  underground tunnels their golden colour.\n  The last significant eruption was in 1538. Compared to these previous two events, it was tiny. It was also big enough to throw ash and pumice 5.5km high. As the column collapsed, it  created a “new mountain&#34; (dubbed, quite literally, Monte Nuovo), measuring 123m high – and burying a village beneath it. If this happened today, in the vicinity of Italy’s third-most-populous city, Naples, the damage would be severe.\n  “Obviously we can&#39;t make estimates,” Morra said, almost languidly. “We know that an active volcano, any active volcano, can erupt. Clearly, in our heart – we hope not.” I looked worried. “Have courage!” he said. “Like Vesuvius, Campi Flegrei is continuously monitored by colleagues at the Vesuvian Observatory, the oldest volcano observatory in the world. This can make us feel more tranquil.”\n Close monitoring means an eruption can be predicted months in advance. With enough warning, the hope is that the metropolitan area can be safely evacuated.\n Signs of a pending eruption aren’t the only data that volcanologists collect. The Vesuvian Observatory was also the first to discover, and chart, a phenomenon known as “bradyseism”: the slow rising, and sinking, of land over time. As the magma in Campi Flegrei’s massive magma chamber moves 3km below ground, so does the land above – sometimes significantly. Over the last 15,000 years, the movement of the magma has pushed the land above it upward  by some 90m. At the same time, other parts of the caldera have fallen.\n As a result, like Vesuvius, Campi Flegrei has given the area around it much of what makes it special: its volcanic rocks, soft and easy for building; its volcanic soil, rich with nutrients for vineyards and lemon groves; even the crescent shape of its coast, providing a gulf for splashing and sunning.\n But what the supervolcano has given the area, it also can take away – even without an eruption.\n  On the eastern edge of the caldera, the above-ground archaeological site of Baiae overlooks the sea. A layer-cake of arches, walls and terraces, it was once the ultimate holiday spot for rich and aristocratic Romans, a kind of  Las Vegas of the ancient world. Now stripped of most of their marble, frescoes and sculptures – many of which are now at the  Archaeological Museum of Campi Flegrei – the buildings look little like they would have millennia ago. Graceful capitals, shorn of their columns, and stucco decorations, dotted with cherubs and wans, hint at its former opulence.\n  As I walked through the site with University of Naples L’Orientale archaeologist Michele Stefanile, he pointed out to me what each structure once would have been: a villa, a bath, a theatre. In one room, I tiptoed around the red and white mosaics. In another, we admired the wall frescoes, still vibrant with ochre and crimson.\n The Romans came here for the same reasons we do: the sparkling Mediterranean, the balmy weather, the lush vegetation. They were also drawn to the area’s thermal springs – the result, of course, of the volcanic activity beneath their feet. When Baiae first entered the historical record in 178BC, it was as the Aquae Cumanae (Cumaean Waters).\n But Baiae wasn’t just a spa retreat. It was a party town, a place for Romans to bathe and banquet, flirt and frolic. In one of his many elegies to his lover and muse Cynthia, even the poet Sextus Propertius, no great prude, wrote despairingly in 25BC:\n “But you must quickly leave degenerate Baiae;  these beaches bring divorce to many,  beaches for long the enemy of decent girls.  A curse on Baiae’s water, love’s disgrace!”\n As  the Roman Republic lapsed into Empire, Baiae’s reputation only grew. In 39AD, Caligula built a bridge – made up of merchant ships linked together, then covered with earth – from Baiae to Pozzuoli, three miles long, then rode over it in a chariot. In 59AD, Nero had his mother, Agrippina, murdered in her villa here. The later emperor Hadrian would have a more peaceful end to his life, dying of natural causes in his Baiaen palace in 138AD.\n More straight-laced Romans stayed away, or claimed to. “It’s no wonder that men like Seneca, for example, decided to have his villa not in Baiae but in a hill in that direction – just to stay a little bit isolated,” Stefanile told me, pointing across the gulf. Even towards the end of his life in 65AD, the philosopher said: “Baiae is a place to be avoided, because, though it has certain natural advantages, luxury has claimed it for her own exclusive resort.&#34;\n  “Luxury” was right. Not content with building on land, wealthy Romans erected pylons and built their villas directly over the sea itself. Horace, rather more prudish than Propertius, reprimanded his countrymen in 23BC for the immodesty of such actions:\n “You, on the brink of the grave,  contract for the cutting of marble slabs;  forgetful of death you fret  to build your mansion out from the coast  in the roaring sea at Baiae –  the mainland shore will not suffice.”\n Horace’s reprimands aside, the effect would have been magnificent. “All of these villas, complexes and structures were conceived in order to be seen from the sea,” Stefanile said as we stood on a terrace. Beyond the ruins lay a clutch of pastel homes; past that, the glittering water. In the near distance, the slopes of Mt Vesuvius were purple in the summer haze.\n “We always make the mistake of putting ourselves on the ground,” Stefanile said. “But the perfect point of view to appreciate this is the sea. Just imagine being in the gulf of Baiae and seeing this leisure resort with all these terraces and the pools and the people crowded here.”\n Even as the western Roman Empire declined, Romans, and then Visigoths and Vandals,  continued to use the baths at Baiae. But by the time Giovanni Boccaccio described it in a 1344 novel – “no sight under the sun is more beautiful or more pleasant than this”, he wrote – Baiae’s great baths and villas had fallen into ruin.\n  Because of bradyseism, many were also underwater. Over the last 2,000 years, much of the site has sunk between 4-6m; in some places, it’s up to 10m. About 50% of built-up area is now thought to be under the sea.\n Some of the artefacts were covered by sand, hiding them from humans and animals alike. But others weren’t so lucky. There are stories of fishermen casting their nets and hauling in ancient sculptures, and of precious objects passing into the black market. Because no-one could be sure exactly how many objects were actually within the site, no-one can be sure how much has been looted.\n  In 2002, the 177-hectare underwater site was made a Marine Protected Area. While licensed scuba divers can explore the site, they must do so with one of the registered local dive shops and guides, who see themselves as the first defenders of their heritage. Today, archaeologists are less worried about looting. But other challenges remain.\n “This is not a normal archaeological park,” Stefanile said. “You cannot put a fence around it. You cannot close it. It’s always open. And it’s exposed to marine life, to the waves, to the tides, and to the human presence.”\n Barbara Davidde, Stefanile’s boss and the director of the unit of underwater archaeology at Italy’s Central Institute for Restoration, has been working at Baiae since 1993. One of the main problems for the artefacts underwater, she says, is marine life. Bacteria, bivalves, sponges – a dizzying variety of organisms not only make their home in the sea but have a penchant for stone and marble materials.\n “If you leave these artefacts open (for example, uncovered by sand), the marine organisms immediately start to colonise, and to live on, the surface. They start to destroy and attack the materials,” she said. Later, at her lab in Rome, Davidde showed me what she meant: while a mosaic might look undisturbed to the naked eye, under a microscope each was a web of holes and divots.\n At the Archaeological Museum of Campi Flegrei, one piece of artwork after another shows the damage animals can do. While it’s common to see ancient Roman statues missing arms or heads, the items in this collection are different. A veiled woman has been so disfigured, she looks as formless as a ghost; a base with a dedication to Emperor Hadrian loses all shape at the top, like a half-melted candle.\n My favourite, however, is a 74cm statue of Zeus on his throne. Dating to the 1st Century BC, his right side is covered with what looks like white scrawlings, the remnants of marine encrustations. Holes that start to dot his torso turn his right arm into a handless sponge. His other side – which was presumably buried in sand – is practically pristine, the folds of his toga still sharp.\n  The Zeus was likely stolen by looters. He wound up in the  collection of the J Paul Getty Museum in Los Angeles, acquired by a curator later indicted for conspiracy to traffic in illegal antiquities. He was  returned to the Campi Flegrei museum in 2018. The other sculptures in the museum are now safe from marine organisms. But the artefacts that remain below the sea, including the precious floors that make up the largest collection of underwater Roman mosaics the world, remain at risk.\n  “I don&#39;t think that you can find any other archaeological site in the world like Baiae,” Davidde said. “We have to find a way to protect the site.”  Musas, an interdisciplinary project led by Davidde to adapt new technologies for underwater sites, is doing just that.\n  Located in the shadow of Monte Nuovo, the  Centro Sub Campi Flegrei dive centre was bustling on the day I was there. A dozen researchers, engineers and archaeologists were setting up equipment – which today included not only scuba tanks and gear, but waterproof tablets, cables and even an underwater drone.\n Overseeing it all was Chiara Petrioli, professor of computer science at the University of Rome La Sapienza and Musas’s scientific coordinator. She is behind one of the more ambitious aspects of Musas: its underwater wireless sensor networks.\n When it comes to an underwater site, a major challenge is communication. The various networks we rely on above ground – data, wifi, radio – aren’t effective in water. Wifi requires laying cables and penetrates only a couple of centimetres. Wireless optical is better but can cover only a few metres of range.\n  The impact on how much archaeologists are able to learn about the site, as well as how to best protect it, is enormous. Imagine you’re an underwater archaeologist excavating. Say you need a new tool. You have to rise to the surface, request it, hope they have it on the boat, and take it back down. The back-and-forth is time-intensive, and more dangerous.\n Perhaps, after all that, you find a new mosaic. You start to uncover it, but all you can do is jot basic notes on a rudimentary board, perhaps take some photographs with an underwater camera. If you want to confer with anyone else, you have to wait until you’re above water. Without precise GPS, it’s also difficult to pinpoint the site’s location. When you come back a day later, the sands may have shifted, the sea floor changed. How can you be sure you’ll find it again?\n The answer to all of this, scientists have found, is to try to mimic how marine mammals communicate: through sound waves.\n  “You need to use acoustic communication,” Petrioli said. “This is really challenging, because the sea’s parameters may change.” Just as external factors can  disturb the communication between killer whales or dolphins, the same is true for humans using acoustic communication, too. Temperature, salinity and wind all can affect the connection between two devices. So can other sounds – a ship passing by, a jet ski.\n “It’s very complex, but we came up with an idea. Let&#39;s have mesh networks, like multi-rope networks, and let&#39;s use artificial intelligence techniques to keep changing the protocol we use.” If a telephone cable sends a message from A to B along a straight line, a mesh network is like a web – in this case made up of underwater wireless sensors, or nodes. When communication is sent, there are various ways it can get from point A to point B – allowing for the message to find the most efficient path to its final destination. And as the sea’s parameters change, so would the communication system. This week, the method they were testing allowed for communication over a range of up to 2km.\n The  underwater wireless sensor networks open up a number of possibilities. Divers now can communicate in real-time, both with one another and with people above the surface, using waterproof smart tablets. Teams can pinpoint exactly where the diver – and a particular site or artefact – is located. The networks even allow data to be gathered, in real time, about the conservation status of the site – including sending images up to experts on land. And by monitoring everything from water quality to CO2 levels, they also provide extra information about the volcanic activity of Campi Flegrei.\n The team was testing all of the technology when I visited, with their hope to install the sensors permanently by summer 2020. While that’s been delayed due to the global coronavirus crisis, there is still hope it will happen this year, and not just in Baiae: Musas has gotten the go-ahead to unroll the same technologies at other ancient underwater Italian sites in Puglia and Ponza.\n But for now, I wasn’t sure what seemed more thrilling: the chance to finally see the underwater mosaics and ruins I’d heard so much about, or to try my hand at a technology that allowed divers to communicate like dolphins.\n  Later that day, I back-rolled into the sea after dive guide Enzo Maione. Descending about 5m deep, we swam over a wall that once made up part of a villa. It was odd to see a ruin like this, grown over with seaweed instead of moss, fish flitting around the bricks.\n We were both equipped with tablets. I looked at mine. “Test,” came a message from the boat. “Test OK,” I typed back.\n As we swam, statues began to appear out of the misty blue water. I paused, entranced. This was the  Nymphaeum of Emperor Claudius, a place where the 1st Century AD ruler would have strolled and admired statues. The statues here today are replicas; the originals have been moved on land for safe keeping. But it hardly mattered. Hovering in the water, looking at the statues’ faces as fish darted around us, felt ghostly and sublime.\n I pressed a button on my tablet and held it up. A 3D version of how the nymphaeum would have looked appeared onscreen. This was one of the other main goals of Musas: to help divers understand the ruins they were looking at.\n But the best was yet to come. Maione stopped on the sea floor and started to push the sand away. With each sweep, more of a mosaic revealed itself until we were hovering over an intricate pattern of circles and hexagons. This was once the floor of a room just off the atrium of a  magnificent villa, dating to the 2n\n......", "posttime": "2020-07-14 02:24:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗马,roman,火山", "title": "Baiae：一个位于海底的罗马定居点", "title_en": "Baiae: A Roman settlement at the bottom of the sea", "transed": 1, "url": "http://www.bbc.com/travel/story/20200713-baiae-a-roman-settlement-at-the-bottom-of-the-sea", "via": "", "real_tags": ["罗马", "roman", "火山"]}, {"category": "", "categoryclass": "", "imagename": "14fc496558ba8e35cb59db121d1e293e.png", "infoid": 1011569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择您自己的数学冒险与我们的互动工具，使您可以建立一个自定义播放列表的灵感活动！", "note_en": "Choose your own maths adventure with our interactive tools that allow you to build a custom playlist of inspirational activities!", "posttime": "2020-07-14 02:24:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学,inspirational", "title": "励志数学周", "title_en": "Week of Inspirational Maths", "transed": 1, "url": "https://www.youcubed.org/week-inspirational-math/", "via": "", "real_tags": ["数学"]}]