[{"category": "", "categoryclass": "", "imagename": "5ee940fee3bbb459294046c9c1b0fcc8.jpeg", "infoid": 1002771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你搬到一个新城市，却不知道最近的杂货店在哪里。\n你不会责备自己--这很正常。你只需使用谷歌地图就可以找到它。\n在你去过那里几次之后，很可能你就不需要使用谷歌地图了。\n其他地方也是如此，比如最近的餐厅或体育中心--一开始，你可能需要使用谷歌地图，然后你就可以自己了解位置，不再需要使用了。\n你学会了它们，但这并不是说你故意要记住每一条路，每一条通往特定目的地的可能的路径。\n您可能需要在编程语言中使用的某些方法也是如此。\n新的软件开发人员可能会因为没有记住足够的语法而感到难过-他们仍然需要参考文档。他们认为这是一个信号，表明他们是糟糕的开发人员。\n以下是他们在开始编程之旅时可能会遇到的几个常见问题：\n我需要多长时间才能掌握它并在不参考文档的情况下写作？\n当他们能够记住一些常用的语法时，他们可能会认为自己变得擅长编程了。\n他们得到的印象是，真正重要的是一门语言的数量，或者他们能够记住的编程语言和框架的数量。\n为了更好地理解问题，让我们比较一下不同编程语言中查找字符串长度的语法：\n如您所见，每种语言或技术都有自己的计算字符串长度的版本。这是一个指标，表明在12个备选方案中记住相同的函数真的很困难。\n使用过多种编程语言的开发人员不太可能记住他们过去使用过的所有语法。他们甚至可能从一开始就没有费心去尝试去学习它。\n我编写了255行代码，其中包括一个正常工作的服务器和一个客户端。我向谷歌查询了23次，主要是登陆StackOverflow、Netty4网站、GitHub和JavaDocs。如果计算一下，平均每10行代码就有1个查询！我一点也不知道。-乌默·曼苏尔(Umer Mansoor)。\n这些招生应该会给你勇气--你不必为记不住句法的每一个细节而感到羞愧。\n这可能是许多初级开发人员关心的问题。事实是，你真的没有必要一边走一边记住每一件事。\n即使是技术招聘人员也不关心这一点。以下是谷歌一位工程总监对此的回应：\n我不仅经常使用谷歌，我还用它来搜索我自己过去写过的东西。\n我数不清我在谷歌上搜索编程问题的次数，因为答案在我编写的Stack Overflow页面上可以找到。如果这是一个我已经完全忘记的特别古老的答案，我甚至对自己说，“哇，这个天才听起来真像我！”以及“这个白痴根本不知道他在说什么！”\n几个月前，我在Facebook的一个群里读到一篇来自一位资深开发人员的帖子，他提到，当招聘人员问他是否有使用某项技术的经验，而他没有经验时，他回答说：“那只是另一种工具。”\n这意味着我过去可能没有机会使用它，但我有信心可以学习它。\n我可能不需要花几个月的时间就可以开始工作了。我可能只需要几个小时来阅读它的文档，然后在旅途中根据需要了解更多信息，而不需要记住所有东西。\n当你开始你的目的地之旅时，你不会期望所有的绿灯都亮着。你通过当前的绿灯，在红灯处停车。你要等到绿灯亮了再继续。\n如今，我们有了新的语言和框架，或者对现有的语言和框架进行了相当大的更改，因此尝试记忆语法既困难又不那么重要。正如一位评论员在一篇博客文章中精辟地指出的那样：\n“伟大的工程师知道如何提出好的问题。然而，面试官期待的是活字典。", "note_en": "You move to a new city and you don’t know where the nearest grocery store is.\n You don’t beat yourself up — it’s normal. You just use Google Maps to find it.\n After you’ve been there several times, it’s highly likely that you won’t need to use Google Maps.\n It’s the same with other places, like the nearest restaurant, or sports center — at first, you perhaps need to use Google Maps, then you learn the locations yourself and no longer need to use it.\n You learn them but it’s not that you’re intentionally  trying to memorize every road, every possible path to a certain destination.\n  It’s the same with certain methods that you may need to use in a programming language.\n New software developers may feel bad that they’re not memorizing sufficient syntax — they still need to refer to the documentation. They see this as a sign that they’re bad developers.\n Here are a couple of common questions they may have when they start their journey into programming:\n How long will it take for me to master it and write without referring to the documentation?\n When they’re able to memorize some frequently used syntax, they may think that they’ve become good at programing.\n They get the impression that it’s the amount of a language or the number of programming languages and frameworks they are able to memorize that really matters.\n To put things in perspective, let’s compare the syntax of finding the length of a string in different programming languages:\n  As you can see, each language or technology has its own version of finding the length of a string. This is an indicator that it’s really difficult to memorize the same function in 12 alternatives.\n It’s very unlikely that a developer who’s used multiple programming languages can memorize all the syntax that they have used in the past. They may even not bother trying to learn it in the first place.\n          I wrote 255 lines of code that included a working server and a client. I queried google 23 times mostly landing on StackOverflow, Netty 4 website, GitHub, and JavaDocs. If you do the math, that averages out to 1 query every 10 lines of code! I had no idea. —  Umer Mansoor\n  These admissions should give you courage — you don’t have to be ashamed that you can’t remember every detail of the syntax.\n This is something that many junior developers may be concerned about. The truth is, you really do not have to memorize everything as you go.\n Not even tech recruiters care about that. Here’s the response that an engineering director at Google gave regarding this:\n   I not only use Google frequently, I use it to search for things I myself have written in the past.\n I can’t count the number of times I’ve Googled for a programming question where the answer is found on a Stack Overflow page I’ve written. If it’s a particularly old answer that I’ve completely forgotten, I’ve even thought to myself, “Wow this genius sounds just like me!” as well as “This idiot has no clue what he’s talking about!” .\n  A couple of months ago, I read a post on a Facebook group from a senior developer mentioning that when recruiters ask him whether he has experience with a particular technology for which he hasn’t, he responds, “That’s just another tool.”\n Meaning that I may not have had the chance to work with it in the past but I have the confidence that I can learn it.\n I may not need to spend months before I am able to work on it. I may only need a few hours to read its documentation and then learn more as needed along the journey without the need to memorize everything.\n You do not expect to have all green lights on when you start your journey to your destination. You pass through the current green light and stop at a red light. You wait until the green light is on before proceeding.\n Nowadays, we get new languages and frameworks, or considerable changes to existing ones, so that trying to memorize the syntax is both difficult and not that important. As one commentator on a blog post brilliantly  put it:\n “Great engineers know how to formulate good queries. Yet interviewers expect walking dictionaries.”", "posttime": "2020-05-19 21:00:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,关注,developer,可能", "title": "如果您想成为高级开发人员，请停止关注语法", "title_en": "If You Want to Be a Senior Developer, Stop Focusing on Syntax", "transed": 1, "url": "https://medium.com/better-programming/if-you-want-to-be-a-senior-developer-stop-focusing-on-syntax-d77b081cb10b", "via": "", "real_tags": ["开发", "关注", "developer", "可能"]}, {"category": "", "categoryclass": "", "imagename": "e5363b29ff4d0291e2562f240d2e82fb.jpeg", "infoid": 1002770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "定义远景会让你的团队有更长远的目标--超越季度目标和结果的目标。下面是如何使用您的Team…创建一个。\n我最近写了一篇关于团队目标的重要性以及如何为你的团队定义团队目标的文章。当涉及到为您的产品团队建立成功时，目标只是拼图中的一块。你的团队也需要一些目标，北极星。\n团队愿景是一个较长期的目标，着眼于未来12个月左右。它与公司愿景不同，因为它比崇高的5-10年目标更具体一些。它应该是可以在大约一年内实现的，并详细说明您将实现什么以及为谁而实现。\n有更长远的眼光将有助于让您的团队专注于此，并确保您能够制定战略和主题，从而将有意义的产品交付给您的客户和/或用户。这也意味着你不必每个季度完全重新考虑你在做什么，这意味着对良好的团队合作的破坏更少！\n解释“是什么”、“为什么”和“如何”(5分钟)。\n在每个研讨会中，你都会发现参与者会犹豫是否参加，除非他们被告知为什么要参加，你要做什么，以及最终结果会是什么(这是理所当然的！)。考虑到这一点，在任何研讨会开始时，带着“什么”、“为什么”和“如何”来节省时间并避免这些问题是有益的：\n为什么=对我们作为一个团队的长期目标有一致的理解。\n根据您的业务规模，您可能已经有了与您的团队相关的公司愿景和相关的高级OKR或战略目标。如果你有的话，花5分钟回顾这些是值得的。如果没有，则可以跳到下一步。\n这一切都是为了让您的团队思考您的工作将在12个月后对您的客户/用户的生活产生的影响。提醒您的团队，这不是您提供哪些功能或构建哪些服务的问题，而是更多人类层面的事情--他们的生活将会发生怎样的变化？他们将来能做什么，也许他们现在做不到呢？\n这个问题是为了让人们思考，如果你成功地实现了上述目标，你的客户或用户在12个月后会有什么感受。他们会快乐、没有压力还是满意呢？试着让你的团队把自己放在客户或用户的心态中。\n希望在回答最后一步的问题时已经出现了一些主题，您应该能够就如何制定您的团队愿景声明进行有时间限制的讨论：\n如果你有一个10人或更多人的团队，你的产品经理最好把研讨会的成果拿走，然后写一份愿景声明草案供团队反馈，因为至少在我的经验中，大型小组讨论可能会变得相当笨拙。", "note_en": "Defining a vision gives your team something to aim for in the longer term — something beyond quarterly goals and outcomes. Here’s how to create one with your team…\n  I recently wrote about the importance of having a  team purpose and how to define one for your team. Purpose is just one piece of the puzzle when it comes to setting your product team up for success. Your team also needs something to aim for, a North Star.\n  A team vision is a longer term aim that looks out around 12 months ahead. It’s different from a company vision as it’s something a little more specific than a lofty 5–10 year goal. It should be something that can be achieved in around a year and details what you are going to achieve and for whom.\n  Having a longer term view will help to give your team focus and ensure that you can formulate a strategy and themes to work on that will result in meaningful products being delivered to your customers and / or users. It also means that you don’t have to completely rethink what you’re working on every quarter, which means less disruption to good team work!\n  Explain the ‘what’, ‘why’ and ‘how’ (5 minutes)\n In every workshop you will find participants who will be hesitant to take part unless they are told why they are there, what you will be doing and what the end result will be (and rightly so!). With this in mind, it’s beneficial to start any workshop with the ‘what’, ‘why’ and ‘how’ to save time and head off these sorts of questions:\n Why = to have an agreed understanding of what our longer term aim is as a team\n  Depending on the size of your business, you may already have a company vision and a relevant high level OKR or strategic goal that relates to your team. It’s worth spending 5 minutes reviewing these, if you have them. If you don’t then you can skip to the next step.\n    This is all about getting your team to think about the impact that your work will have on your customers’ / users’ lives in 12 months’ time. Remind your team that this isn’t about which features you deliver or what services you build, but something much more on a human level — how will their lives have changed? What will they be able to do that maybe they can’t do now?\n  This question is to get people thinking about the emotions that your customers or users will be feeling 12 months from now, if you’re successful in achieving the above. Will they be happy, stress-free or satisfied? Try to get your team to put themselves in your customers’ or users’ mindset.\n  Hopefully some themes have emerged from answering the questions in the last step and you should be able to have a time-boxed discussion about how to formulate your team vision statement:\n   If you have a team of 10 or more people it might be better for your Product Manager to take the workshop outputs away and write up a draft vision statement for the team to feedback on, as a large group discussion can get rather unwieldy, in my experience at least.", "posttime": "2020-05-19 21:00:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "愿景,team,团队", "title": "如何为团队愿景研讨会提供便利", "title_en": "How to facilitate a team vision workshop", "transed": 1, "url": "https://medium.com/swlh/how-to-facilitate-a-team-vision-workshop-d636c0e35c6", "via": "", "real_tags": ["愿景", "team", "团队"]}, {"category": "", "categoryclass": "", "imagename": "2f4ebab64c5f7b45b048443be2e37c71.jpg", "infoid": 1002769, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司在一份简短的声明中表示：“由于沃尔玛(Walmart.com)品牌的持续强势，公司将停止使用Jet.com。”近四年前对Jet.com的收购对于加快我们的全方位战略至关重要。“。\nJet.com停产的消息既令人惊讶，也可能是那些关注其进展的人预料到的。令人惊讶的是，因为冠状病毒的持续影响导致了网购人数的激增，所以看起来沃尔玛可能想要加倍努力自己的在线购物。这是意料之中的，因为在现实中，Jet.com并没有像沃尔玛希望的那样成为皇冠上的明珠。\n这一声明是沃尔玛第一季度收益报告的一部分，该公司在报告中表示，其核心美国市场的增长率不到10%，并将撤回2021财年的指导。\n沃尔玛称，“该公司的净销售和经营业绩受到冠状病毒爆发的重大影响.”他说：“对多种类别产品的空前需求带来了强劲的营收业绩。某些增加的成本对营业收入产生了负面影响，包括与提高工资和福利以及安全和卫生相关的成本。“。总收入为1,346亿美元，增加107亿美元，增幅为8.6%。\n与此同时，首席财务官布雷特·比格斯(Brett Biggs)关于业绩指引的声明突显出，鉴于经济、公共卫生状况和沃尔玛购物情况将如何发展，这些数字可能只是未来几个月艰难消息的开始。\n他指出：“撤回指引的决定反映出数个主要外部变数及其对我们的业务和全球经济的潜在影响存在重大不确定性，包括：全球冠状病毒健康危机的持续时间和强度、在家工作订单的持续时间和影响、经济刺激的规模和持续时间、就业趋势和消费者信心。”“我们的业务基本面强劲，财务状况极佳。客户信任我们会兑现我们的品牌承诺，我对我们在几乎任何环境下都能表现出色充满信心。虽然短期环境将是具有挑战性的，但在一个日益全方位的世界中，我们已经为长期成功做好了准备。“。\n尽管冠状病毒大流行导致网购人数激增，但包括亚马逊(Amazon)和eBay在内的一些公司发现，目前处理业务可能会带来更多的管理成本，这是在考虑到在收购了所有卫生纸和意大利面之后，经济崩溃对整体销售额的长期影响之前。因此，虽然在这样的时候放弃Jet.com似乎有违直觉，但最终还是要削减成本，因为这是一个更大的图景。\n当沃尔玛(Walmart)在2016年收购Jet.com时，其雄心壮志是让这家巨头零售商成为其实体店的补充，以便更好地与亚马逊(Amazon)及其日益增长的主要购物目的地地位竞争。收购Jet.com也是为了让其经验丰富的创始人兼领导人马克·洛尔(Marc Lore)领导Jet和沃尔玛(Walmart Online)\n沃尔玛总裁兼首席执行官道格·董明伦(Doug McMillon)当时在与投资者的电话会议上表示：“这是沃尔玛更加致力于在电子商务领域取胜。”\n但快进到今天，在冠状病毒给零售业和更广泛的经济带来的所有压力中，这次停产是这家经历了不同阶段变革的公司最终面临问题的努力的最后篇章。这些措施包括，去年，将Jet的团队完全整合到自己的团队中；重新推出这项服务；还取消了Jet Black等各种Jet实验，这是一项个人购物服务。\n与此同时，沃尔玛一直在努力增加沃尔玛(Walmart.com)的更多福利，比如上月底试行两小时送货服务。", "note_en": "“ Due to continued strength of the Walmart.com brand, the company will discontinue Jet.com,” the company said in a short statement. “The acquisition of Jet.com nearly four years ago was critical to accelerating our omni strategy.”\n The news of Jet.com’s discontinuation is both a surprise and probably expected by those who have been watching its progress. Surprise, because the continued impact of COVID-19 has led to a surge of people shopping online, and so it would seem that Walmart might have wanted to double down on its own online efforts. Expected, because in reality Jet.com hasn’t shaped up to be the jewel in the crown that Walmart had hoped it would become.\n  The statement was made as part of Walmart’s Q1 earnings report, in which the company said it saw growth of less than 10% in its core US market, and that it would be withdrawing guidance for fiscal 2021.\n “The company’s net sales and operating results were significantly affected by the outbreak of COVID-19,” Walmart said. “Unprecedented demand for products across multiple categories led to strong top-line results. Certain incremental costs negatively affected operating income, including costs associated with enhanced wages and benefits as well as safety and sanitation.” Total revenue was $134.6 billion, an increase of $10.7 billion, or 8.6%.\n Meanwhile, CFO Brett Biggs’ statement on guidance underscored how these numbers are possibly just the beginning of the difficult news in the months ahead, given the lack of visibility of how the economy, the state of public health and shopping at Walmart will shape up.\n “The decision to withdraw guidance reflects significant uncertainty around several key external variables and their potential impact on our business and the global economy, including: the duration and intensity of the COVID- 19 health crisis globally, the length and impact of stay-at-home orders, the scale and duration of economic stimulus, employment trends and consumer confidence,” he noted. “Our business fundamentals are strong, and our financial position is excellent. Customers trust us to deliver on our brand promise, and I’m confident in our ability to perform well in most any environment. While the short-term environment will be challenging, we’re positioned well for long-term success in an increasingly omni world.”\n Although the COVID-19 pandemic has led to a surge of people shopping online, a number of companies, including Amazon and eBay, have found that handling business at the moment can prove to come with more overhead costs, and that’s before considering what the larger effects of a collapsed economy will have on overall sales longer term, after all the toilet paper and pasta have been acquired. So while it might seem counterintuitive to get rid of Jet.com at a time like this, it’s about cost cutting ultimately because of that bigger picture.\n When Walmart acquired Jet.com in 2016, the big ambition was to give the giant retailer a complement to its brick-and-mortar stores to compete better against Amazon and its growing presence as a primary shopping destination. Buying Jet.com was also about bringing on its experienced founder and leader Marc Lore to lead both Jet and Walmart online\n “This is Walmart being even more committed to winning in e-commerce,” said Doug McMillon, president and CEO of Walmart, in a conference call with investors at the time.\n But fast forward to today, amid all the strains that COVID-19 is putting on the retail sector and the wider economy, and the discontinuation is the final chapter in what ultimately was a problematic endeavour for the company that went through various stages of change. They included, last year,  fully integrating Jet’s teams into its own;  relaunching the service; and also axing various Jet experiments like  Jet Black, a personal shopping service.\n In the meantime, Walmart has been working on adding more Walmart.com perks such as  piloting a two-hour deliver service at the end of last month.", "posttime": "2020-05-19 20:30:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表示,discontinue,沃尔玛", "title": "沃尔玛表示将停止生产2016年以30亿美元收购的Jet", "title_en": "Walmart says it will discontinue Jet, which it acquired for $3B in 2016", "transed": 1, "url": "https://techcrunch.com/2020/05/19/walmart-says-it-will-discontinue-jet-com-which-it-acquired-for-3b-in-2016/", "via": "", "real_tags": ["表示", "沃尔玛"]}, {"category": "", "categoryclass": "", "imagename": "cb9748d0cff93378c49889e088cfb172.jpg", "infoid": 1002768, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司表示，电子邮件地址和旅行详细信息被盗，2208名客户的信用卡详细信息也被窃取。\n该公司已经通知了英国信息专员办公室，并正在继续调查这起违规事件。\n在一份声明中，该公司表示：我们非常认真地对待安全问题，并将继续投资，进一步改善我们的安全环境。\n没有证据表明任何性质的个人信息被滥用，但是，根据ICO的建议，我们正在与旅行详细信息被获取的大约900万客户沟通，建议他们采取保护措施，将潜在的网络钓鱼风险降至最低。&#34；", "note_en": "It said email addresses and travel details had been stolen and that 2,208 customers had also had their credit card details &#34;accessed&#34;.\n The firm has informed the UK&#39;s Information Commissioner&#39;s Office and is continuing to investigate the breach.\n  In a statement it said: &#34;We take issues of security extremely seriously and continue to invest to further enhance our security environment.\n  &#34;There is no evidence that any personal information of any nature has been misused, however, on the recommendation of the ICO, we are communicating with the approximately nine million customers whose travel details were accessed to advise them of protective steps to minimise any risk of potential phishing.&#34;", "posttime": "2020-05-19 20:15:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,航空,admits,详细信息", "title": "易捷航空承认900万客户被黑客攻击", "title_en": "EasyJet admits nine million customers hacked", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-52722626", "via": "", "real_tags": ["黑客", "航空", "admits", "详细信息"]}, {"category": "", "categoryclass": "", "imagename": "b9f7a8cb29a71dcdad019613643eeb46.jpg", "infoid": 1002767, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哦，你在上一个雇主的Scrum上遇到过问题吗？嗯，那不是真正的Scrum。&你的Scrum主人，他不是一个真正的苏格兰人点击推特很难批评Scrum。我脑海中的“Scrum”概念可能与您所熟悉的截然不同。这是故意的，也是承认的。在官方的Scrum指南中，我们可以找到Scrum的定义：\n一个框架，人们可以在其中解决复杂的适应性问题，同时高效地和创造性地交付尽可能高价值的产品。\n因为定义很模糊，在接下来的长篇大论中，我唯一能批评的就是我熟悉的“Scrummers”的常见做法。希望你们中的一些可爱的读者能产生共鸣。\nScrum的核心是Sprint，一个月或更短的时间段，在此期间创建“完成”的、可用的和潜在的可发布的产品增量。\n冲刺是有用的，就像电子游戏中的成就是有用的一样；它们让我们内心感到温暖和模糊。激励是一种强有力的工具，不要误解我的意思。问题是，那些温暖的模糊大多是为了管理团队。这会让他们觉得自己掌握了控制权，并被告知了情况。他们确切地知道做了什么，什么时候完成的。\n短跑需要可实现的短期目标。让我们假设我是一个进行两周冲刺的团队的一员(因为持续时间必须是一致的)，并且我被指派构建一个在整个事情完成之前都没有用处的API。也就是说，在我的头脑中，我相信如果我能始终如一地工作，整个任务就需要两个月的时间。\n我需要将API分成几个部分，可以在2周内完成。我也许可以在短短一两天内完成一些端点，但我不想错过任何一个目标，我知道一些更困难的逻辑可能需要每个端点整整一周的时间。有14个端点，所以我决定每个冲刺2个端点的整数。\n一个本可以在2个月内完成的API现在将需要近4个月的时间，因为我在这一过程中浪费了时间来设置人工停靠点。我的冒名顶替者综合症开始出现，但至少管理层会有相当多的倦怠图表。\nScrum Master是Scrum团队的仆人领导。Scrum Master帮助Scrum团队之外的人了解他们与Scrum团队的哪些交互是有帮助的，哪些是没有帮助的。\nhttps://www.scrumguides.org/scrum-guide.html。\n根据Scrum大师的想法是如何实现的，它可能是一个糟糕的想法，也可能是一个更糟糕的想法。让我们来谈谈在我看来最常见的情况。\nScrum主管是一种非技术型的中层管理人员，喜欢掌管事情。\n除了他们所有的开发工作之外，工程师们现在还经常被Scrum管理员打断，他询问Reaction应用程序的“Java代码”什么时候可以完成。\n其目的是阻止外部世界打扰他们的开发人员的个人就是最大的麻烦。在我看来，非技术人员应该很少(如果有的话)管理技术人员(首席执行官除外)。我应该能够就我的任务向我的老板寻求帮助和建议，或者至少我应该希望他们理解我的任务。\n即使Scrum大师是一个从高层掌握技术问题的可爱的人，Scrum Master也不是一份全职工作。Scrum大师的日常任务通常只是早上一两次站立，下午与上级开会，其他就没什么了。\n如果您仍然觉得需要一个“Scrum大师”，那就让主要开发人员来处理这项工作。他们已经站起来了，很可能对正在发生的事情有更好的了解。你没有把更多的东西放在他们的盘子上，你很可能是在减少一些东西。\n在Scrum中，评估有一个主要目的--计算出团队在给定的Sprint中可以完成多少工作。如果我承认冲刺是个好主意(我显然不相信)，那么官方Scrum指南中对估计的描述就不会有问题。\n问题是，实践中的估计是对现实的私生化。Scrum指南在这个主题上含糊其辞，所以经理们自己动手解决问题。在这情况下，我会再次批评我在预算方面所见的一些常见做法。\n许多超级时髦的组织喜欢使用最令人困惑的标准来进行估计。他们声称，不知何故，这使得评估过程更快、压力更小。可悲的是，我仍然不信服。\n我在一家新公司的第一天参加了我们的评估会议，因为我听说他们使用了可怕的“故事点”系统：\nScrum大师：“斐波纳契数，其中8分是最大值，因为我们将其定义为开发人员在两周冲刺期间可以处理的工作量。”\n估算的最终目标是转换工作量-&gt；时间。为什么我们需要添加额外的工作负载步骤-&gt；故事点-&gt；时间？简单估计“多少天？”这样会更容易思考和推理，同时也提供了更多的粒度。\n我们使用斐波纳奇数，因为很难想象7天和8天的区别。没有人能如此近距离地估计。斐波纳契数列在每一步都会上升~60%，所以你不会被迫非常接近你的估计值。\n对于这一点，我建议基于您首先关心的标度，即时间，进行基数为2的幂运算。\n如果估计是在可测量的时间内进行的，那么如果工程师没有达到他们的估计，他们会觉得自己搞砸了。\n好的，估计是很困难的，我们不想让任何人因为他们不是完美的估计者而觉得自己是个糟糕的工程师。也就是说，与其开始一场“到底是谁的线？”的游戏，不如先玩一场“到底是谁的线？”\n如果估计结果是不好的，则可以在不损害估计者的情况下对其进行重新估计。\n我是敏捷方法论和敏捷宣言的粉丝。我不是Scrum的粉丝。在后面的一篇文章中，我计划回顾一下我对如何在运行“敏捷”组织的同时做些什么来代替Scrum的想法。", "note_en": "&#34;Oh you had problems with Scrum at your last employer? Well, that&#39;s not real Scrum.&#34;- your scrum master, who is not a true Scotsman  Click To Tweet   It’s hard to criticize Scrum. The idea of “Scrum” in my mind is likely very different from the one you are familiar with. This is by design, and by admission. In the official  Scrum Guide we find Scrum’s definition:\n A framework within which people can address complex adaptive problems, while productively and creatively delivering products of the highest possible value.\n   Because the definition is so vague, the only thing I’ll be able to criticize throughout the rest of my tirade is the common practices of “Scrummers” that I’m familiar with. Hopefully, some of you lovely readers can relate.\n   The heart of Scrum is a Sprint, a time-box of one month or less during which a “Done”, useable, and potentially releasable product Increment is created\n Sprints are useful like achievements in video games are useful; they make us feel warm and fuzzy inside. Motivation is a powerful tool, don’t misunderstand me. The problem is that those warm fuzzies are mostly for the sake of  the management team. It makes them feel in control and informed. They know exactly what was done and when it was completed.\n  Sprints require achievable short-term goals. Let’s pretend that I’m part of a team that does two-week sprints (because the duration must be consistent) and I’m assigned to build an API that isn’t useful until the whole thing is completed. Let’s also say that in my head I believe the whole task to take two months if I can work consistently.\n  I need to break the API into pieces that can be completed in 2-week increments. I might be able to get some of the endpoints done in as little as a day or two, but I don’t want to miss any of my goals, and I know some of the more difficult logic could take as long as an entire week per endpoint. There are 14 endpoints so I decide on a round figure of 2 endpoints per sprint.\n  An API that could have been completed in  2 months will now take almost  4 months because I’ve wasted time putting in  artificial stopping points along the way. My imposter syndrome starts to set in, but at least management will have pretty burndown charts.\n  The Scrum Master is a servant-leader for the Scrum Team. The Scrum Master helps those outside the Scrum Team understand which of their interactions with the Scrum Team are helpful and which aren’t.\n  https://www.scrumguides.org/scrum-guide.html\n Depending on how the idea of the scrum master is implemented, it can be a bad idea or a worse one. Let’s just talk about what seems to me to be the most common scenario.\n The scrum master is a non-technical, middle-management type that likes to be in charge of stuff.\n In addition to all of their development work, the engineers are now interrupted frequently by the scrum master who is asking when the “Java code” for the React app will be done.\n The very individual whose purpose it is to stop the outside world from bothering their developers is the single biggest bother. In my opinion, non-technical people should rarely, if ever, be managing technical people (except the CEO). I should be able to go to my boss for help and advice with my tasks, or at the very least I should expect them to  understand my assignments.\n Even if the scrum master is a lovable person who grasps the technical issues from a high-level,  Scrum Master isn’t a full-time job. Too often scrum masters daily tasks involve a stand-up or two in the morning, a meeting with higher-ups in the afternoon, and not much else.\n If you still feel the need for a “scrum master”, just let the lead developers handle the job. They are already at stand-up and likely have a better idea of what is going on. You aren’t putting more on their plates, you are likely taking something off.\n   Within Scrum, estimates have a primary purpose – to figure out how much work the team can accomplish in a given sprint. If I were to grant that Sprints were a good idea (which I obviously don’t believe) then the description of estimates in the official Scrum guide wouldn’t be a problem.\n The problem is that estimates in practice are a bastardization of reality. The Scrum guide is vague on the topic so managers take matters into their own hands. With this in mind, I am again going to criticize some common practices that I have seen in regards to estimates.\n  Many super-hip organizations enjoy using the most confusing scales for estimates. They claim that this somehow makes estimating a faster and less stressful process. I remain woefully unconvinced.\n My first day at a new company during our estimation meeting after hearing they used the dreaded “story points” system:\n Scrum master: “Fibonacci, where 8 points is the max because we defined it as the amount of work a developer can handle during a two-week sprint”.\n       The end goal of an estimate is to convert  workload -&gt; time. Why do we need to add an extra step of  workload -&gt; story points -&gt; time? A simple estimate of “how many days?” would have been easier to think and reason about, while also providing more granularity.\n  We use fibonacci because its hard to imagine the difference between 7 and 8 days. No one can estimate that closely. Fibonacci sequences go up by ~60% at each step so you aren’t forced to get very close to your estimate.\n To that, I propose base-2 exponentiation based on the scale you care about in the first place,  time.\n   If estimates are grounded in measurable time then engineers will feel like they’ve screwed up if they miss their estimate.\n Good point, estimating is hard and we don’t want anyone to feel like they are a bad engineer just because they aren’t the perfect estiamtor. That said, maybe instead of starting a game of “Whose Line Is It Anyway?”\n    If an estimate turns out to be bad it can be re-estimated at  no detriment to the estimator.\n  I’m a fan of agile methodologies and the  Agile Manifesto. I’m not a fan of Scrum. In a later article, I plan to go over my thoughts on what to do in lieu of Scrum while still running an “agile” organization.", "posttime": "2020-05-19 19:45:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "留给,scrum", "title": "把Scrum留给橄榄球", "title_en": "Leave Scrum to Rugby", "transed": 1, "url": "https://qvault.io/2020/05/18/leave-scrum-to-rugby-i-like-getting-stuff-done/", "via": "", "real_tags": ["留给", "scrum"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002766, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "易捷航空(EasyJet)透露，在针对该航空公司的一次“高度复杂的”网络攻击中，900万客户的个人信息被获取。\n该公司周二披露，电子邮件地址和旅行详细信息已被获取，并表示将联系所有受影响的客户。\neasyJet在提交给股市的一份声明中表示，在900万受影响的人中，有2208人的信用卡信息被盗。\n那些信用卡详细信息被盗的客户已经得到联系，而其他受影响的人也将在“未来几天”得到联系。\n数据监管机构信息专员办公室(ICO)建议EasyJet联系所有受影响的人，因为钓鱼欺诈的风险增加了。\n易捷航空表示，“没有证据表明任何性质的个人信息被滥用”。\n易捷航空首席执行官约翰·伦德格伦(Johan Lundgren)表示：“我们想向那些受到这起事件影响的客户道歉。\n他说：“自从我们知悉这宗事件后，很明显，由於冠状病毒，市民对个人资料被用作网上诈骗的问题愈来愈关注。因此，根据ICO的建议，我们正在联系那些旅行信息被获取的客户，我们建议他们提高警惕，特别是在他们收到主动通信的情况下。“", "note_en": "EasyJet has revealed that the personal information of 9 million customers was accessed in a “highly sophisticated” cyber-attack on the airline.\n The company on Tuesday disclosed that email addresses and travel details were accessed and said it will contact all of the customers affected.\n Of the 9 million people affected, 2,208 had credit card details stolen,  easyJet said in a statement to the stock market.\n Those customers whose credit card details were taken have already been contacted, while everyone else affected will be contacted in the “next few days”.\n The Information Commissioner’s Office (ICO), the data regulator, has recommended easyJet contact everyone affected because of an increased risk of phishing fraud.\n EasyJet said “there is no evidence that any personal information of any nature has been misused”.\n  The easyJet chief executive, Johan Lundgren, said: “We would like to apologise to those customers who have been affected by this incident.\n “Since we became aware of the incident, it has become clear that owing to Covid-19 there is heightened concern about personal data being used for online scams. As a result, and on the recommendation of the ICO, we are contacting those customers whose travel information was accessed and we are advising them to be extra vigilant, particularly if they receive unsolicited communications.”", "posttime": "2020-05-19 19:29:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "航空,reveals,表示", "title": "易捷航空披露网络攻击暴露了900万客户的详细信息", "title_en": "EasyJet reveals cyber-attack exposed 9m customers' details", "transed": 1, "url": "https://www.theguardian.com/business/2020/may/19/easyjet-cyber-attack-customers-details-credit-card", "via": "", "real_tags": ["航空", "reveals", "表示"]}, {"category": "", "categoryclass": "", "imagename": "90e9d7285aa8faa8538fd6ea6cfc61e0.jpg", "infoid": 1002765, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "致密星团中的黑洞和中子星之间的合并与在恒星稀少的孤立地区形成的合并非常不同。它们的相关特征可能对研究引力波及其来源至关重要。海德堡大学天文计算研究所的曼努埃尔·阿卡·塞达博士在一项使用计算机模拟的研究中得出了这一结论。这项研究可能会为天文学家在2019年观察到的两个大质量恒星物体的融合提供关键的见解。这项研究结果发表在“通信物理”杂志上。比太阳大得多的恒星通常以中子星或黑洞的形式结束生命。中子星发出规则的辐射脉冲，使它们能够被探测到。例如，2017年8月，当观察到第一次双中子星合并时，全球各地的科学家用望远镜探测到了爆炸产生的光线。另一方面，黑洞通常保持隐藏状态，因为它们的引力如此之强，甚至连光都无法逃脱，使得电磁探测器看不到它们。\n如果两个合并，事件可能是看不见的，但仍然可以从所谓的时空涟漪中检测到。某些探测器，如美国的激光干涉仪引力波天文台(LIGO)，能够探测到这些波。第一次成功的直接观测是在2015年。这个信号是由两个黑洞产生的。但这一事件可能不是引力波的唯一来源，引力波也可能来自两个或一个黑洞与中子星的合并。根据Arca Sedda博士的说法，发现这些差异是观察这些事件的主要挑战之一。\n在他的研究中，海德堡的研究人员分析了黑洞和中子星对的融合。他使用详细的计算机模拟来研究由恒星和致密物体(如黑洞)组成的系统与聚变所需的第三个大质量漫游物体之间的相互作用。结果表明，这种三体相互作用实际上可以促进像球状星团这样密集恒星区域的黑洞-中子星合并。曼努埃尔·阿卡·塞达(Manuel Arca Sedda)解释说，可以定义一类特殊的动态合并，它与孤立地区的合并截然不同，#34；曼努埃尔·阿卡·塞达(Manuel Arca Sedda)解释说。\n2019年8月，引力波天文台首次观测到黑洞与中子星的融合。然而，世界各地的光学天文台都无法在引力波信号的发源地找到电磁对应物，这表明黑洞在没有首先摧毁中子星的情况下就完全吞噬了它。如果得到证实，这可能是首次观测到的在密集恒星环境中观测到的黑洞-中子星合并，正如Arca Sedda博士所描述的那样。更多信息：Manuel Arca Sedda，剖析起源于致密星团的中子星-黑洞合并的性质，通信物理(2020)。网址：10.1038/s420050310-x", "note_en": "Mergers between black holes and neutron stars in dense star clusters are quite unlike those that form in isolated regions where stars are few. Their associated features could be crucial to the study of gravitational waves and their source. Dr. Manuel Arca Sedda of the Institute for Astronomical Computing at Heidelberg University came to this conclusion in a study that used computer simulations. The research may offer critical insights into the fusion of two massive stellar objects that astronomers observed in 2019. The findings were published in the journal  Communications Physics.    Stars much more massive than our sun usually end their lives as a neutron star or black hole. Neutron stars emit regular pulses of radiation that allow their detection. In August 2017, for example, when the first double neutron star merger was observed, scientists all around the globe detected light from the explosion with their telescopes. Black holes, on the other hand, usually remain hidden because their gravitational attraction is so strong that even light cannot escape, making them invisible to electromagnetic detectors.\n  If two   merge, the event may be invisible but is nonetheless detectable from ripples in space-time in the form of so-called  . Certain detectors, like the &#34;Laser Interferometer Gravitational Waves Observatory&#34; (LIGO) in the USA, are able to detect these waves. The first successful direct observation was made in 2015. The signal was generated by the   of two black holes. But this event may not be the only source of gravitational waves, which could also come from the merger of two   or a black hole with a neutron star. Discovering the differences is one of the major challenges in observing these events, according to Dr. Arca Sedda.\n  In his study, the Heidelberg researcher analysed the fusion of pairs of black holes and neutron stars. He used detailed computer simulations to study the interactions between a system made up of a star and a compact object, such as a black hole, and a third massive roaming object that is required for a fusion. The results indicate that such three-body interactions can in fact contribute to black hole-neutron star mergers in dense stellar regions like globular star clusters. &#34;A special family of dynamic mergers that is distinctly different from mergers in isolated areas can be defined,&#34; explains Manuel Arca Sedda.\n  The fusion of a black hole with a neutron star was first observed by gravitational wave observatories in August 2019. Yet optical observatories around the world were unable to locate an electromagnetic counterpart in the region from which the gravitational wave signal originated, suggesting that the black hole had completely devoured the neutron star without first destroying it. If confirmed, this could be the first observed black hole-neutron star merger detected in a dense stellar environment, as described by Dr. Arca Sedda.        More information:\t\t\t\t\t\t\t\t\t\t\t\tManuel Arca Sedda, Dissecting the properties of neutron star–black hole mergers originating in dense star clusters,  Communications Physics (2020).  DOI: 10.1038/s42005-020-0310-x", "posttime": "2020-05-19 19:00:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑洞,holes,合并", "title": "黑洞和中子星在致密星团中合并，这是看不见的。", "title_en": "Black holes and neutron stars merge unseen in dense star clusters", "transed": 1, "url": "https://phys.org/news/2020-05-black-holes-neutron-stars-merge.html", "via": "", "real_tags": ["黑洞", "holes", "合并"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德国卡尔斯鲁厄，5月19日(路透社)-德国宪法法院周二裁定，BND情报机构监控外国公民在国外的互联网流量在一定程度上违反了宪法。\n这项期待已久的裁决称，对境外外国人的互联网监控违反了该国宪法规定的新闻自由。\n这是法院首次裁定BND即使在海外活动也受德国宪法管辖，这意味着外国记者和记者无国界组织(Reports Without Borders)提出的申诉基本上是成功的。(Ursula Knapp报道，Madeline Chambers编写，Michelle Martin编辑)", "note_en": "KARLSRUHE, Germany, May 19 (Reuters) - Germany&#39;s Constitutional Court ruled on Tuesday that monitoring the internet traffic of foreign nationals abroad by the BND intelligence agency partly breaches the constitution.\n  The long-awaited ruling stated that internet surveillance of foreigners abroad violates the freedom of the press enshrined in the country&#39;s constitution.\n  It is the first time the court has ruled that the BND is subject to Germany&#39;s constitution even for its activities abroad and means that complaints brought by foreign journalists and Reporters Without Borders were largely successful. (Reporting by Ursula Knapp Writing by Madeline Chambers Editing by Michelle Martin)", "posttime": "2020-05-19 18:44:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "最高法院,top,德国", "title": "德国最高法院将隐私权扩大到外国人，暂停窃听项目", "title_en": "Germany’s Top Court Extends Privacy Rights to Foreigners, Halts Wiretap Programs", "transed": 1, "url": "https://news.trust.org/item/20200519072904-kkpa7/", "via": "", "real_tags": ["最高法院", "top", "德国"]}, {"category": "", "categoryclass": "", "imagename": "4e4a3cb708b261bea5009dcd9b4593f7.jpg", "infoid": 1002762, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Polygon获得的法庭文件显示，美国任天堂周五对销售玩盗版视频游戏软件的任天堂Switch黑客经销商提起两起诉讼。\n第一起诉讼是周五在俄亥俄州一家法院对小汤姆·迪尔斯(Tom Dilts Jr.)提起的，他被指控为UberChips网站的运营商。第二起诉讼是同一天在西雅图一家法院提起的，针对的是来自一些精选网站的一些匿名被告。据报道，所有被告都出售一群名为“Team Xecuter”的匿名黑客的产品。任天堂的律师将这些产品描述为“未经授权的操作系统……。并附带安装该软件的盗版工具。“。\n这些产品允许用户绕过任天堂旨在保护其产品免受“未经授权的访问和复制”的“技术保护措施”。律师们说，一旦被禁用，玩家就可以下载未经授权的操作系统，玩盗版视频游戏。\n为了打击黑客攻击，任天堂正将法律努力的重点放在经销商身上。2018年，任天堂对Team Xecutor黑客经销商提起了类似的诉讼。今年1月，它赢得了针对该案被告塞尔吉奥·莫贾罗·莫雷诺(Sergio Mojarro Moreno)的禁令，后者被勒令停止转售黑客。同样，任天堂在2019年9月对一家名为RomUniversal的ROM网站提起诉讼，该网站允许会员为该系统和其他公司下载盗版视频游戏。\n在撰写本文时，UberChips网站似乎处于离线状态，处于“定期维护”状态。第二起诉讼中列出的其他网站仍在运营。用于入侵任天堂交换机的套件标价为47.99美元。该网站还销售SNES Classic、PlayStation Mini、任天堂3DS和Game Boy Advance的产品。\n这些网站还提供设备预订，这些设备将绕过之前不可破解的任天堂Switch Lite和较新的任天堂Switch机型的保护措施。任天堂表示，这对公司造成了“巨大的伤害”；任天堂的律师说，数百台设备已经售出。\n任天堂在每起案件中都要求每一次贩运违规行为获得2500美元的赔偿，并要求永久禁令停止这些网站的运营。", "note_en": "Nintendo of America filed  two  lawsuits on Friday against Nintendo Switch hack resellers that sell software to play pirated video games, according to court documents obtained by Polygon.\n The first lawsuit was filed Friday in an Ohio court against Tom Dilts Jr., the alleged operator of the website UberChips. The second lawsuit was filed in a Seattle court that same day, against a number of anonymous defendants from a selection of websites. All defendants reportedly sell products from a group of anonymous hackers called “Team Xecuter.” Nintendo’s lawyers described the products as “an unauthorized operating system ... and accompanying piracy tools that install it.”\n These products allow users to get around Nintendo’s “technological protection measures” designed to protect its products from “unauthorized access and copying.” Once it’s disabled, players can download the unauthorized operating system and play pirated video games, lawyers said.\n In an attempt to crackdown on the hacks, Nintendo is focusing its legal efforts on the resellers. In 2018, Nintendo filed a similar lawsuit  against a Team Xecutor hack reseller. In January, it won an injunction against the defendant of that case, Sergio Mojarro Moreno, who was ordered to stop reselling the hacks. Likewise, Nintendo filed a lawsuit in September 2019  against a ROM website called RomUniverse, which allows members to download pirated video games for the system and others.\n  At the time of writing, the UberChips website appears to be offline — under “scheduled maintenance.” Other websites listed in the second lawsuit are still operating. A kit used for hacking the Nintendo Switch is listed for $47.99. The site also sells products for the SNES Classic, PlayStation Mini, Nintendo 3DS, and Game Boy Advance.\n The websites are also offering pre-orders for devices that will circumvent protection measures for the previously unhackable Nintendo Switch Lite and newer Nintendo Switch models. Nintendo said this is causing “tremendous harm” to the company; Nintendo lawyers said hundreds of the devices have already been sold.\n Nintendo is seeking $2,500 per trafficking violation in each of these cases, as well as a permanent injunction to stop operations of these websites.", "posttime": "2020-05-19 18:15:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "任天堂,黑客,打击,files", "title": "任天堂在打击交换机黑客方面提起诉讼", "title_en": "Nintendo Files Lawsuits In Crackdown Against Switch Hackers", "transed": 1, "url": "https://www.polygon.com/2020/5/18/21262121/nintendo-switch-hacking-lawsuit-pirated-games", "via": "", "real_tags": ["任天堂", "黑客", "打击", "files"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NeoCities永远不会出售您的个人数据或在您的网站上投放广告。取而代之的是，我们直接由像你这样的人通过支持者账户和捐款提供资金。\n与许多其他网络主机不同，我们在基础设施上并不吝啬。NeoCities在全球11个数据中心运营自己的缓存CDN，为您的站点提供快速服务。我们还在所有站点上强制使用100%强SSL，并且完全支持HTTP/2。由于我们对质量的承诺，我们在可靠性、速度和正常运行时间方面的表现经常优于昂贵的云服务。无论是您的个人主页还是繁忙的专业站点，您的站点加载速度都很快。\n我们快速的静态托管提供了一个很棒的浏览器内HTML编辑器、简单的文件上传、命令行工具、每个站点的RSS提要、用于构建开发人员应用程序的API等等！\n我们发布为站点提供动力的代码以供检查。我们想要赢得您的信任，而不是把您锁在里面。\n作为21世纪GeoCities的转世，NeoCities让你可以免费创建自己的网站。而且，这可能会引发网络创意的复兴。", "note_en": "Neocities will never sell your personal data or put advertising on your site. Instead, we are funded directly by people just like you with  supporter accounts and  donations.\n  Unlike many other web hosts, we don&#39;t skimp on infrastructure. Neocities operates our own caching CDN in 11 datacenters all over the world to quickly serve your site. We also force 100% strong SSL on all sites, and have full support for HTTP/2. Because of our commitment to quality, we routinely out-perform the pricey cloud services on reliability, speed and uptime. Whether it’s your personal home page or a busy professional site,  your site loads fast.\n  Our fast static hosting comes with a great in-browser HTML editor, easy file uploading, a  command line tool, RSS feeds for every site,  APIs for building developer applications, and much more!\n  We  publish the code that powers the site for inspection. We want to win your trust—not lock you in.\n  &#34;Designed as a 21st century reincarnation of GeoCities, Neocities lets you make your own site for free.  And it just might spark a renaissance of creativity online.&#34;", "posttime": "2020-05-19 18:14:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记得,remember,站点", "title": "如果你还记得GeoCities，这是给你的", "title_en": "If you remember GeoCities this one is for you", "transed": 1, "url": "https://neocities.org", "via": "", "real_tags": ["记得", "remember", "站点"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002760, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是又一条全面的球拍新闻！球拍社区周围正在发生很多事情，慢慢地，我在努力跟上最新的情况。如果我忘了什么，请告诉我，我会在下一版出版。\n2020年欧洲Lisp研讨会在网上举行，取得了相当成功。这些视频是在线的，其中包括Andy Keep在Nanopass编译器上的主题演讲。\n乔尔·迪克(Joel Dueck)创办了一份名为“花粉时间”(Pollen Time)的时事通讯，通知订阅者有关花粉教育和合作的在线活动。\n我们自己的Robby Findler将在6月15日为Chalmers在线函数编程研讨会系列演讲“高阶输入的Concolic测试”。这段视频将在网上流媒体，并在稍后发布在他们的YouTube频道上经过编辑的视频。\n如果您知道库版本，或者您自己的库，并且您希望将它们作为特色，请让我知道。\n该库定义了一次性的、可组合的一流价值生产者，以及必须分配和释放的相关外部资源，如数据库连接。提供了几个安全抽象来使用可处理的值，同时确保在使用后释放与其相关联的资源。\n本期的专题论文是Jay McCarthy所著的室内乐毕多芬-哥德尔编码和功能性8位音频合成。\n毕多芬是一位多产的作曲家，大约有1.079363美元*10239美元的不同作曲，基于四声部和声和基本和弦进行。它与基于1985年任天堂娱乐系统(NES)中的理光RP2A03的纯功能音频合成引擎相结合。合成引擎在一系列乐器和演奏风格上被参数化，因此每首乐曲都可以在大约4.22234*10^41种不同的排列或“NEStrations”中的一种中演奏。\nRacketCon 2020本应在2020年秋季发布，但目前还没有官方消息。\n本期节目由保罗·马托斯为您带来。任何错误或不准确都是我个人的意见，并不代表PLT团队的观点，他们开发了球拍。\n我也试着调查了最近在球拍郎中发生的最相关的事情。如果你做了一些了不起的事情，写了一篇博客文章，或者看到了我错过的事情-我的道歉。让我知道，这样我就可以在下一期改正它。", "note_en": "This is another full-to-the-brim Racket News! Lots of things are happening all around the Racket community, and slowly I am struggling to keep up-to-date. If I have forgotten something,  let me know and I will publish it in the next edition.\n      The European Lisp Symposium 2020 took place online this year and it was quite a success. The videos  are online and include a keynote talk from Andy Keep on the Nanopass Compiler.\n  Joel Dueck started a newsletter called  Pollen Time where he notifies subscribers about online events focused on pollen education and collaboration.\n  Our own Robby Findler will be giving a talk on “Concolic Testing with Higher-Order Inputs” for the  Chalmers Online Functional Programming seminar series on June 15th. This will be streamed online and an edited video posted later on their  Youtube channel.\n       If you know of library releases or maybe your own libraries and you want them to be featured, please  let me know.\n      This library defines disposables, composable first-class producers of values with associated external resources that must be allocated and deallocated such as database connections. Several safe abstractions are provided to consume disposable values while ensuring their associated resources are deallocated after use.\n   This issue’s featured paper is  Bithoven - Gödel Encoding of Chamber Music and Functional 8-Bit Audio Synthesis by Jay McCarthy.\n  Bithoven is a prolific composer of approximately $1.079363 * 10^239$ different compositions based on four-part harmony and basic chord progressions. It is combined with a purely functional audio synthesis engine based on the Ricoh RP2A03, found in the 1985 Nintendo Entertainment System (NES). The synthesis engine is parameterized over a band of instruments and styles of play, so each composition can be played in one of approximately  4.22234 * 10^41 different arrangements or “NEStrations”.\n    RacketCon 2020, was supposed to be announced for the fall of 2020 but there are no official news about it yet.\n         This issue is brought to you by  Paulo Matos. Any mistakes or inaccuracies are solely mine and they do not represent the views of the  PLT Team, who develop Racket.\n I have also tried to survey the most relevant things that happened in Racket lang recently. If you have done something awesome, wrote a blog post or seen something that I missed - my apologies.  Let me know so I can rectify it in the next issue.", "posttime": "2020-05-19 17:59:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "球拍,news", "title": "球拍新闻-第31期", "title_en": "Racket News – Issue 31", "transed": 1, "url": "https://racket-news.com/2020/05/racket-news-issue-31.html", "via": "", "real_tags": ["球拍", "news"]}, {"category": "", "categoryclass": "", "imagename": "3df3474847de939912d1bd066c096481.jpg", "infoid": 1002759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Defold是在许可许可下发布的免费开放源码软件。Defold是由Defold基金会拥有和开发的。\nDefold是在流行的Apache2.0许可衍生的许可许可下发布的免费开放源码软件。许可证允许您自由开发游戏，而不必担心支付许可费或收入的版税。\n阅读许可证。\n作为一个软件基金会，我们依靠社区捐款和企业伙伴关系来确保项目的长期可持续性。我们邀请您一次性或每月捐款以支持德福。\n了解更多信息&捐赠(&A)。\n作为一个开源项目，Defold接受社区对产品的任何部分的贡献，包括但不限于引擎、编辑器、扩展和文档。源代码可以在GitHub上找到。\n如何贡献。\n我们很高兴地宣布，截至2020年5月，终极跨平台游戏引擎Defold已经转移到Defold基金会，并作为开源项目提供！我们相信这将给开发过程带来透明度，我们邀请我们的社区成员参与进来。\n你有没有一个问题没有在这里回答？请向我们咨询，我们会尽最大努力回答您的问题！\n答：没有，Defold已经捐给了Defold基金会。King在Defold董事会中只有一个席位，但对Defold的未来没有直接影响。\n答：Defold仍在由Defold团队的成员进行工作。该团队计划在2020年内实现增长，但与任何开源项目一样，它在一定程度上也将依赖于社区贡献。单击此处了解有关如何贡献的更多信息。\n答：金在德福尔德基金会成立时进行了慷慨的捐赠。戴福公司将从最初的捐赠以及通过社区捐赠和公司合作协议为持续发展提供资金。了解有关如何捐赠的更多信息。\n问：既然Deold是开源的并接受社区贡献，它的质量会下降吗？\n答：没有。我们永远不会在代码质量上妥协。我们只接受经过团队审查的贡献，我们将对社区贡献实施与核心团队贡献相同的高标准。我们也不会接受与我们的路线图不符的捐款。单击此处了解有关如何贡献的更多信息。\n问：我们还会有一个稳定的引擎，跟上iOS、Android等的最新平台要求吗？\n答：是的。Defold基金会将始终专注于维护稳定和最新的引擎。保持引擎和编辑器更新的主要责任落在Defold基金会身上，但我们可能会不时向社区寻求帮助。\n答：没有。我们相信，本地扩展构建服务器将是Defold产品的重要组成部分，因此它们应该继续作为免费服务提供给我们的用户。现在构建服务器是开源的，任何人都可以自由地设置和运行他们自己的服务器，可以是本地服务器，也可以是公共或私有服务器。\n答：这绝对是我们希望发生的事情。今年早些时候，我们通报了2020年高级别路线图，我们将根据这一路线图规划我们的工作。但是，由于路线图是在高水平上定义的，社区有可能影响工作。随着报告的问题、功能请求和任务现在在GitHub上公开，社区将有可能对他们认为重要的项目进行投票，我们将在计划工作时考虑投票情况。\n答：我们目前有资产门户，用户可以在其中与社区共享内容。我们没有任何计划创建一个可以出售/购买资产的市场。但是，您可以自由使用资产门户来营销您的内容，并解释如何购买这些内容。\n答：Defold是在流行的Apache2.0许可衍生的许可许可下发布的免费开放源码软件。许可证允许您自由开发游戏，而不必担心支付许可费或收入的版税。单击此处了解有关许可证的更多信息。\nA：是的，当然可以！通过这种方式，Defold可以更好地证明未来的情况。Defold是开源的，这一事实将允许任何人通过修复错误、使用新功能更新它或为其打补丁来与新的操作系统更新一起工作，而不需要依赖另一家公司来完成这些工作，从而改进Defold。\n答：都是。引擎和编辑器是从这个GitHub存储库开源的。本地扩展构建服务器是从这个GitHub存储库开源的。扩展和其他杂项项目在GitHub上也是开源的。\n答：关于Defold为什么以及如何开源的基本信息可以在我们的网页上找到。可以在GitHub上跟踪日常开发流程。要参与开源讨论，请加入#开源松弛频道或我们论坛的开源部分。\n问：我想投稿，但我不懂C/C++或Clojure，所以我不能在引擎和编辑器方面提供帮助。我可以用其他方式帮忙吗？\n答：你不需要知道C/C++或Clojure就能帮上忙。如果我们收到对我们的文档、示例和教程的贡献，我们会非常激动。单击此处了解有关如何贡献的更多信息。\n问：这是否意味着您的大部分新功能都将依赖于社区？\n答：没有。Defold基金会将有一个开发团队致力于引擎的开发，但团队最初会更小。我们相信社会上有些成员会有兴趣作出贡献。\n答：一开始不是。我们希望我们的资金能够维持尽可能长的时间，我们不想雇佣更多的开发人员，直到我们知道我们有足够的捐款和来自公司赞助的资金来支持更多的人。\n问：我没有时间为引擎贡献新的代码，但我非常乐意在经济上做出贡献。我能这么做吗？\n答：是的，当然可以。我们接受Patreon、PayPal和GitHub赞助商的捐款。了解有关如何捐赠的更多信息。\n问：Defold社区相当小。你确定有足够的人能够并且愿意贡献吗？您将采取什么措施来增加用户数量？\n答：前几年我们没有把重点放在用户增长上。尽管如此，Defold社区每年都在增长，这是我们非常自豪的一个事实。我们将在2020年积极发展Defold社区，以更好地支持Defold作为一个开源项目。我们相信，转向开源Defold将会吸引新的开发人员，我们希望这些开发人员中的一些人也会有兴趣做出贡献。\n你有没有一个问题没有在这里回答？请向我们咨询，我们会尽最大努力回答您的问题！", "note_en": "Defold is free and open source software released under a permissive license. Defold is owned and developed by the Defold Foundation.\n Defold is free and open source software released under a permissive license derived from the popular Apache 2.0 License. The license grants you the freedom to develop games without worrying about paying licensing fees or royalties on your earnings.\n  Read the license\n  As a software foundation we rely on community donations and corporate partnerships to ensure the long term sustainability of the project. We invite you to make one-time or monthly donations to support Defold.\n  Learn more &amp; Donate\n  As an open source project Defold accepts community contributions to any part of the product, including, but not limited to, the engine, editor, extensions and documentation. The source code is available on GitHub.\n  How to contribute\n We are happy to announce that as of May 2020 Defold, the ultimate cross platform game engine, has been transferred to the Defold Foundation and made available as an open source project! We belive this will bring transparency to the development process and we invite our community members to get involved.\n Do you have a question that isn&#39;t answered here? Please  ask us and we will do our best to answer!\n  A: No, Defold has been donated to the  Defold Foundation. King holds a single seat on the Defold board but has no direct influence on the future of Defold.\n  A: Defold is still being worked on by members of the Defold team. The team has plans to grow during 2020 but as with any open source project it will also to some extent rely on community contributions. Learn more about  how to contribute here.\n A: King made a generous donation when the  Defold Foundation was created. Defold will fund continued development from the initial donation and through community donations and corporate partnership deals. Learn more about  how to donate.\n Q: Will the quality of Defold degrade now that it is open source and accepting community contributions?\n  A: No. We will never compromise on code quality. We will only accept contributions that have been reviewed by the team, and we will impose the same high standards on community contributions as contributions made by the core team. We will also not accept contributions that aren&#39;t in line with our roadmap. Learn more about  how to contribute here.\n Q: Will we still have a stable engine that is kept up to date with the latest platform requirements for iOS, Android and more?\n  A: Yes. The  Defold Foundation will always focus on maintaining a stable and up to date engine. The main responsibility of keeping the engine and editor updated falls on the Defold Foundation, but we may from time to time ask for help from the community.\n A: No. We believe the native extension build servers to be such an integral part of the Defold product offering that they should remain available as a free service to our users. And now that the  build server is open source anyone is free to set up and run their own server, either locally or as a public or private server.\n  A: This is definitely something we want to happen. Earlier this year we communicated the high level roadmap for 2020 and we will plan our work based on this roadmap. But since the roadmap is defined on a high level there is a possibility for the community to influence the work. With reported issues, feature requests and task now being public on GitHub it will be possible for the community to upvote items they feel are important, and we will take the votes into account when we plan our work.\n A: We currently have the  Asset Portal where users can share content with the community. We do not have any plans to create a marketplace where assets can be sold / bought. You are however free to use the Asset Portal to market your content and explain how the content can be purchased.\n A: Defold is free and open source software released under a permissive license derived from the popular Apache 2.0 License. The license grants you the freedom to develop games without worrying about paying licensing fees or royalties on your earnings. Learn more about  the license here.\n A: Yes, absolutely! Defold is much more future proof this way. The fact that Defold is open source will allow anyone to improve Defold by fixing bugs, updating it with new features or patching it to work with new operating system updates without being dependent on another company to do the work.\n A: All of it. The engine and editor are open sourced from  this GitHub repository. The native extension build server is open sourced from  this GitHub repository. Extensions and other miscellaneous projects are also open sourced  on GitHub.\n A: The basic information about why and how Defold is open sourced can be found on our  webpage. The daily development process can be followed on  GitHub. To participate in open source discussions please join the  #opensource Slack channel or the  Open Source section of our forum.\n  Q: I would like to contribute but I don&#39;t know C/C++ or Clojure so I can&#39;t help with the engine and editor. Can I help out some other way?\n  A: You don&#39;t need to know C/C++ or Clojure to help out. We would be thrilled if we received contributions to our documentation, examples and tutorials. Learn more about  how to contribute here.\n Q: Does this mean that you will rely on the community for most of the new features?\n  A: No. The  Defold Foundation will have a team of developers working on the engine, but the team will initially be smaller. We believe that some members from our community would be interested in contributing.\n A: Not initially. We want the funding we have to last for as long as possible and we don&#39;t want to hire more developers until we know we have enough donations and money from corporate sponsorships to support more people.\n Q: I do not have the time to contribute new code to the engine but I would be more than happy to contribute financially. Can I do this?\n  A: Yes, absolutely. We accept donations via Patreon, PayPal and GitHub Sponsors. Learn more about  how to donate.\n Q: The Defold community is quite small. Are you sure there are enough people that can and are willing to contribute? And what will you do to increase the number of users?\n  A: We have not focused on user growth in previous years. Despite this the Defold community has grown year over year, a fact which we are very proud of. We will work actively to grow the Defold community in 2020 to better sustain Defold as an open source project. We do believe that the move to open source Defold will attract new developers and we hope that some of those developers would also be interested in contributing.\n  Do you have a question that isn&#39;t answered here? Please  ask us and we will do our best to answer!", "posttime": "2020-05-19 17:44:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,游戏,making,defold", "title": "King正在将其Defold游戏引擎开源", "title_en": "King is making its Defold game engine open source", "transed": 1, "url": "https://defold.com/opensource/", "via": "", "real_tags": ["开源", "游戏", "making", "defold"]}, {"category": "", "categoryclass": "", "imagename": "29590ad6ad57088cde1cd31ef2859d66.png", "infoid": 1002757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "libpoireau库截取一小部分toalloc/calloc/等调用，以生成具有统计代表性的应用程序堆占用概览。虽然拦截器目前只跟踪长期分配(例如，泄漏)，但我们也计划按照“电子围栏”的精神实现保护页面。\n与LeakSanitizeror Valgrind不同，采样方法使得在生产中使用此库对性能的影响最小(请参阅性能开销一节)，并且不需要对代码生成进行任何更改。\n程序库的实现策略将大部分复杂性卸载到内核或外部分析脚本，并且对于少数采样的分配只覆盖系统内存分配器(或任何其他已覆盖系统错误锁的分配器)，这意味着插装不太可能从根本上改变一个程序的行为。(#**$${##**$$}。预加载libpoireau.so比插入tcmalloconly(因为要调试分配)侵入性小得多。代码库也更小，在将新的库投入生产之前更容易审核。\n最后，poireau.py分析脚本只报告旧的分配，而不是扫描堆以查找引用。对于期望在启动后快速进入稳定状态的应用程序服务器和其他工作负载，这比只报告无法访问的对象更有用：堆占用的缓慢增长是一个问题，即使罪魁祸首是可以访问的，例如，在应该清除的时候没有清除的列表中。\nlibpoireau目前的目标是在4KB页面的64位平台上运行Linux4.8+(用于静态定义的跟踪点支持)。执行make.sh在当前目录中创建libpoireau.so；代码需要与GCC兼容的C11实现。\n在使用libpoireau之前，我们必须用Linux perf注册它的静态探测点；这可以在使用LD_PRELOAD启动程序之前完成，也可以在启动之后完成，这并不重要。\n我们现在可以在libpoireau覆盖stdlib调用时启用跟踪点来生成perf事件。\n这足以让Linux perf报告这些事件，例如，在perf top中。然而，这是很多信息，不一定有用。\n执行scripts/poireau.sh$pid以启动对该PID性能跟踪，并将输出提供给分配跟踪脚本。每隔10分钟，该脚本将转储当前活动的旧(&gt；5分钟)采样分配列表。向poireau.py发送HUP信号，以获取所有实时采样分配的列表。旧分配最终将用已知的泄漏或启动分配来填充；通过向poireau.py发送USR1信号，从未来的报告中删除所有当前的旧分配。\n在过程之外进行分析的一个关键优势是，我们仍然可以在崩溃后提供信息。向poireau.py发送一个USR2信号，列出最近对free或realloc的一些调用，希望它能帮助调试释放后使用。\nperf通常需要sudo访问权限，但是以root身份运行all of poireau.py没有意义；poireau.sh只使用sudo执行Perfect。为了覆盖sudo下的perf二进制文件，请使用PERF=Which perf scripts/poireau.sh.。\n您还可以通过不带任何参数调用poireau.sh来启用系统范围的跟踪。如果atime中只有一个进程将LD_PRELOAD libpoireau.so：poireau.py中的分析代码当前不能区分进程何时匹配分配和释放(编辑poireau.py中的全局通信模式，以便只从与特定正则表达式匹配的程序中摄取事件)，这将非常有用。系统范围的跟踪使跟踪程序启动时立即发生的事件变得更容易。\n如果您必须在执行程序之前编辑init脚本以插入LD_PRELOAD变量，那么撤消编辑并尽快重新启动插入指令的程序是有意义的。\n当LD_PRELOAD时，libpoireau截取对malloc/calloc/realloc/free的每个调用，并快速将绝大多数调用转发给实际实现，如果libpoireau不存在，这些调用将被使用。\n只有那些标记为采样的分配才会被转移，在malloc和calloc的情况下，当调用被转移的分配时，free会被覆盖。最后，出于采样目的，realloc被视为一对malloc和free。\n采样逻辑模拟以相等概率对每个分配的字节进行采样的过程。(硬编码)采样率的目标是平均每32MB采样一次分配；例如，我们对100字节的分配请求以相同的概率成为样本的一部分，就好像我们以1/(32*1024*1024)的概率抛出了100次落在&#34；头上的偏向硬币，并决定如果这些硬币中有任何抛到头上，则将该请求作为样本的一部分。\n这种无内存采样策略使得即使在对抗工作负载的情况下，也可以推导出堆分配调用的形状的统计界限。然而，简单的实现速度很慢，我们不是为每个分配的字节翻转偏向硬币，而是通过从指数分布生成值来生成连续的尾数。\n每当选择对malloc、calloc或realloc的调用进行采样时，libpoireau都会执行使用USDT(用户静态定义的跟踪)探测进行检测的代码。Linux Perf可以注释代码以生成事件(对于链接共享库每个进程，这是一个系统范围的开关)；我们使用这些事件让内核捕获每个采样调用的调用堆栈。\n此外，这些分配请求被转移到内部跟踪分配器。这使我们能够识别对跟踪的分配进行释放和重新分配的调用，这对于生成配对的USDT事件(释放或重新分配此分配)至关重要；它还确保我们将这些分配传递回备份跟踪分配器，而不是系统malloc。\n对性能敏感的程序倾向于避免在热点区域进行动态内存分配。也就是说，通过在单个线程中重复调用一对malloc和free(大多数内存分配器的最佳情况)，这里有两个微基准测试和上限限制libpoire.so中LD_PRELOAD的开销。下面的结果是在运行Linux 5.3.11和glibc 2.27的卸载AMD EPYC 7601上计时的。\n基线(Glibc Malloc)：0.092 us/malloc-free(0.047用户，0.046系统)预加载，无探测：0.153 us/malloc-free(0.058用户，0.094系统)预加载，探测器：0.236 us/malloc-free(0.067用户，0.169系统)预加载，跟踪：0.271 us/malloc free(0.069用户，0.203系统)。\n这几乎是我们最糟糕的情况：我们预计会非常频繁地触发allocationtracking，每32个分配一次，而且我们的trackingallocator比普通的mmap/munmap稍微复杂一些(这一点我们仍然需要改进)。\n基线(Glibc Malloc)：0.042 us/malloc-free(0.041用户，0.001系统)预加载，无探测：0.044 us/malloc-free(0.043用户，0.001系统)预加载，探测器：0.046 us/malloc-free(0.042用户，0.004系统)预加载，跟踪：0.054 us/malloc free(0.042用户，0.012系统)。\n在这种不太合理的大小下，将采样分配转移到跟踪分配器的开销不到5%。我们还可以观察到，尽管每当我们执行竞赛点时都会触发中断，但与生成回溯所需的时间相比，服务中断所花费的时间相对较少(&lt；20%)。这并不令人惊讶，因为我们使用的内核部分与分析性能问题时使用的内核部分相同。\n基线(Glibc Malloc)：0.017 us/malloc-free(0.017用户，0.000系统)预加载，无探测：0.020 us/malloc-free(0.020用户，0.000系统)预加载，探测器：0.020 us/malloc-free(0.020用户，0.000系统)预加载，跟踪：0.020 us/malloc free(0.020用户，0.000系统)。\n在这里，所有的减速都是通过从我们的拦截器malloc到基础系统malloc的蹦床来实现的。\nTL；DR：在分配微基准中，对于小型或中型分配，libpoireaustrumentation的开销约为5-20%，而对于非常大的分配，则高达~70%。\n启用分配跟踪将为小型或中型分配再增加0-20%，为超大型分配再增加约130%。\n对于一个什么都不做的程序来说，这些都是最坏的数字，但是循环中的malloc和free都是空闲的。在实践中，对性能敏感的程序在内存管理上花费的时间希望不到10%(而且比在大分配中花费的时间要少得多)，这意味着libpoireau和捕获堆栈跟踪带来的总开销可能接近1-5%。\nlibpoireau包括派生自xoshio 256+1.0的代码，该代码由David Blackman和Sebastiano Vigna(vigna@acm.org)于2018年编写，专用于公共领域。", "note_en": "The libpoireau library intercepts a small fraction of calls tomalloc/calloc/etc., to generate a statistically representativeoverview of an application&#39;s heap footprint. While the interceptorcurrently only tracks long-lived allocations (e.g., leaks), we plan toalso implement guard pages, in the spirit of Electric Fence.\n The sampling approach makes it possible to use this library inproduction with a minimal impact on performance (see the section onPerformance overhead), and without any change to code generation,unlike, e.g.,  LeakSanitizeror  Valgrind.\n The library&#39;s implementation strategy, which offloads most of thecomplexity to the kernel or an external analysis script, and onlyoverrides the system memory allocator (or any other allocator thatalready overrides the system malloc) for the few sampled allocations,means the instrumentation is less likely to radically change aprogram&#39;s behaviour. Preloading  libpoireau.so is much less invasivethan slotting in, e.g.,  tcmalloconly because one wants to debug allocations. The code base is alsomuch smaller, and easier to audit before dropping a new library inproduction.\n Finally, rather than scanning the heap for references, the poireau.py analysis script merely reports old allocations. Forapplication servers, and other workloads that expect to enter a steadystate quickly after startup, that is  more useful than only reportingunreachable objects: a slow growth in heap footprint is an issue, evenif the culprits are reachable, e.g., in a list that isn&#39;t gettingcleared when it should be.\n  libpoireau currently targets Linux 4.8+ (for statically definedtracepoint support) on 64 bit platforms with 4 KB pages. Execute make.sh to create  libpoireau.so in the current directory; the coderequires a GCC-compatible C11 implementation.\n   Before using libpoireau, we must register its static probepoints withLinux  perf; this may be done before starting programs with LD_PRELOAD, or after, it does not matter.\n  We can now enable the tracepoints to generate perf events whenever libpoireau overrides a stdlib call.\n  That&#39;s enough for Linux  perf to report these events, e.g., in  perf top. However, that&#39;s a lot of information, not necessarily useful.\n Execute  scripts/poireau.sh $PID to start  perf trace on that  PID,and feed the output to an allocation tracking script. Every 10minutes, that script will dump a list of currently live old (&gt; 5minutes) sampled allocations. Send  poireau.py a  HUP signal toinstead get a list of all live sampled allocations. Old allocationswill eventually fill up with known leaks, or startup allocations;remove all current old allocations from future reports by sending a USR1 signal to  poireau.py.\n A key advantage of having the analysis out of process is that we canstill provide information after a crash. Send a  USR2 signal to poireau.py to list some recent calls to  free or  realloc, on theoff chance that it will help debug a use-after-free.\n Perf often needs  sudo access, but it doesn&#39;t make sense to run allof  poireau.py as root;  poireau.sh instead executes only  perfwith sudo. In order to override the  perf binary under  sudo,use  PERF=which perf  scripts/poireau.sh ....\n You may also enable system-wide tracing by invoking  poireau.shwithout any argument. This is mostly useful if only one process at atime will ever  LD_PRELOAD  libpoireau.so: the analysis code in poireau.py does not currently tell processes apart when matchingallocations and frees (edit the global  COMM pattern in  poireau.pyto only ingest events from programs that match a certain regex).System-wide tracing makes it easier to track events that happenimmediately on program startup.\n       If you had to edit an init script to insert the  LD_PRELOAD variablebefore executing a program, it makes sense to undo the edit andrestart the instrumented program as soon as possible.\n  When  LD_PRELOADed, libpoireau intercepts every call to malloc/ calloc/ realloc/ free, and quickly forwards the vastmajority of calls to the real implementation that would be used iflibpoireau were absent.\n Only those allocations that are marked for sampling are diverted, inthe case of  malloc and  calloc, and  free is overridden iff calledon an allocation that was diverted. Finally,  realloc is treated asa pair of  malloc and  free, for sampling purposes.\n The sampling logic simulates a process that samples each allocatedbyte with equal probability. The (hardcoded) sampling rate aims foran average of sampling one allocation every 32 MB; for example, we anallocation request for 100 bytes becomes part of the sample with thesame probability as if we had flipped 100 times a biased coin thatlands on &#34;head&#34; with probability  1 / (32 * 1024 * 1024), and decidedto make the request part of the sample if any of these coin flip hadlanded on &#34;head.&#34;\n This memory-less sampling strategy makes it possible to derivestatistical bounds on the shape of heap allocation calls, even with anadversarial workload. However, a naive implementation is slow.Rather than flipping biased coins for each allocated byte, we insteadgenerate the number of consecutive &#34;tails&#34; results by generatingvalues from an Exponential distribution.\n Whenever a call to  malloc,  calloc, or  realloc is picked forsampling, libpoireau executes code that is instrumented with USDT(user statically-defined tracing) probes. Linux  perf can annotatethat code to generate events (this is a system-wide switch, for everyprocess that linked the shared library); we use these events to letthe kernel capture callstacks for each sampled call.\n In addition, these allocation requests are diverted to an internaltracking allocator. This lets us identify calls to  free and realloc on tracked allocations, which is crucial to generate pairedUSDT events (&#34;this allocation was freed or reallocated&#34;); it alsoensures we pass these allocations back to the backup trackingallocator, rather than the system malloc.\n  Performance sensitive programs tend to avoid dynamic memory allocationin hot spots. That being said, here are a couple microbenchmark totry and upper bound the overhead of  LD_PRELOADing in libpoireau.so, by repeatedly making pairs of calls to  malloc and free (a best case for most memory allocators) in a single thread.The results below were timed on an unloaded AMD EPYC 7601 runningLinux 5.3.11 and glibc 2.27.\n  baseline (glibc malloc): 0.092 us/malloc-free (0.047 user, 0.046 system) preloaded, no probe: 0.153 us/malloc-free (0.058 user, 0.094 system) preloaded, with probes: 0.236 us/malloc-free (0.067 user, 0.169 system)preloaded, with tracing: 0.271 us/malloc-free (0.069 user, 0.203 system)\n This is pretty much our worst case: we expect to trigger allocationtracking very frequently, once every 32 allocation, and our trackingallocator is slightly more complex than a plain  mmap/ munmap(something we should still improve).\n  baseline (glibc malloc): 0.042 us/malloc-free (0.041 user, 0.001 system) preloaded, no probe: 0.044 us/malloc-free (0.043 user, 0.001 system) preloaded, with probes: 0.046 us/malloc-free (0.042 user, 0.004 system)preloaded, with tracing: 0.054 us/malloc-free (0.042 user, 0.012 system)\n At this less unreasonable size, the overhead of diverting sampledallocations to a tracking allocator is less that 5%. We can alsoobserve that, while triggering an interrupt whenever we execute atracepoint isn&#39;t free, the time spent servicing the interrupt isrelatively small (&lt; 20%) compared to the time it takes to generate abacktrace. This isn&#39;t surprising, since we use the same part of thekernel that&#39;s exercised when analysing performance issues with  perf.\n  baseline (glibc malloc): 0.017 us/malloc-free (0.017 user, 0.000 system) preloaded, no probe: 0.020 us/malloc-free (0.020 user, 0.000 system) preloaded, with probes: 0.020 us/malloc-free (0.020 user, 0.000 system)preloaded, with tracing: 0.020 us/malloc-free (0.020 user, 0.000 system)\n Here, all the slowdown is introduced by trampolining from ourinterceptor malloc to the base system malloc.\n TL;DR: in allocation microbenchmarks, the overhead of libpoireauinstrumentation is on the order of 5-20% for small or mediumallocations, and goes up to ~70% for very large allocations.\n Enabling allocation tracing adds another 0-20% for small or mediumallocations, and ~130% for very large allocations.\n These are worst-case figures, for a program that does  nothing butrepeatedly  malloc and  free in a loop. In practice, a performancesensitive program hopefully spends less than 10% of its time in memorymanagement (and much less than that in large allocations), which meansthe total overhead introduced by libpoireau and capturing stack tracesis probably closer to 1-5%.\n  libpoireau includes code derived from xoshiro 256+ 1.0,written in 2018 by David Blackman and Sebastiano Vigna ( vigna@acm.org)and  dedicated to the public domain.", "posttime": "2020-05-19 16:59:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分配,sampling", "title": "Poireau：一个采样分配调试器", "title_en": "Poireau: A Sampling Allocation Debugger", "transed": 1, "url": "https://github.com/backtrace-labs/poireau", "via": "", "real_tags": ["分配", "sampling"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "失真在音乐中无处不在，特别是涉及到电吉他的时候。正是这种嘎吱作响的、模糊的声音让摇滚乐听起来很摇滚乐。当太多的信号被输入到模拟元件中，人们意识到它发出了有趣的声音时，它就偶然地出现了。\n它听起来如此酷的原因之一是它保留了正在播放的音符的频率，同时在上面添加了其他频率。对于模拟元件，这(某种程度上)是通过对用于产生声音的信号进行限幅来实现的。最终结果取决于使用的电路和组件，因此有很多种。正确的失真可以为任何声音添加字符。\n在数字世界里，失真通常是使用一种叫做波形整形的技术来产生的，这是一个很酷的概念，我认为应该在博客上发表一篇文章。您可以使用波形整形来创建简单的剪切扭曲，但它还可以做更多的事情。\n本段以下的所有内容都需要启用javascript才能运行，如果您不信任我，源代码就在这里。我正在使用一些基于纯正弦波的声音演示，这听起来非常可怕，但是图表要漂亮得多。我已确保声音不会太大，但请确保您的音量不会调得过大。最后声音变得更好听了。\n我知道你们中的一些人会在电话里看这个。祝你好运，从技术上讲，它应该会起作用。\n使用此选项可更改此页面上每个声音的音量。单击每个图形以播放其声音，然后再次单击以停止。\n这是一个以440 Hz(A音符)播放的基本正弦波，使用剪裁，您可以在剪裁和未剪裁的波之间淡入淡出，并使用下面的滑块调整剪裁级别。\n当削波值在波的常用值之外时，削波的正弦波听起来与纯正弦波完全相同。我告诉过你他们听起来很可怕…\n一组正弦波听起来比单个波稍微好一些，那里的数学家会知道你可以用正弦波的组合形成任何声音，但我不会走得那么远。\n我将对一组频率相近但不完全相同的七个正弦波应用相同的剪辑。这使得它们以某种方式相互干扰，从而产生敲打效果(这听起来仍然不是很好)。\n剪裁的一个怪癖是，较安静的声音不会达到阈值，因此只有较响亮的声音才会改变。这就是如何在大声的声音上获得“超速”效果。\n剪裁的另一个副作用是它限制了音量，因此失真通常伴随着振幅的提升。\n此处(和上面)绘制的波形比您可以听到的声音慢约100倍：\n此滑块会更改扭曲程度，再往右是更多的剪裁和更高的提升：\n在引擎盖下面，我正在使用一种叫做波形整形的技术来创建被削波的信号。它经常被用来模拟更经典的失真声音，这比剪辑要稍微复杂一些。而且它可以做得更多。\n它的工作方式是使用传递函数，该传递函数将每个输入值(在-1和1之间)映射到也在-1和1之间的输出值。\n以下是几个传递函数的示例，图形上的轴都从-1到1。光标位置将显示函数的示例值：\n下面显示了将传递函数应用于正弦波的结果。单击图表播放声音，您可以在播放时通过单击按钮来更改功能，以听取不同之处。\n关于不同功能的一些信息(查看此页面的源代码并搜索“Hello！”要查看函数本身，请执行以下操作)：\n剪辑/增强-剪辑为0.5并将振幅加倍以保持音量不变。\n非常嘈杂-将信号替换为随机噪音，但您仍然可以听到原始音调(我认为这是由于混叠造成的)。\n这里有一些音频记录将通过传递函数运行，我已经复制了下面不同的失真按钮，以便您可以在播放声音时摆弄声音(请记住，线性将不变地播放声音)。玩得开心!。\n这些可能在某些浏览器中不起作用，请先尝试播放上面的一个正弦波，然后给我发电子邮件。\n二次的那个听起来很奇怪。这是因为它是一个偶数函数，而其他大多数函数都是…函数。奇怪。这些都是函数对称性的副作用，它们改变了失真产生的谐波。\nCLIP/BOOST和指数之间的区别是微妙的-这些差别对于高端音频设备来说变得非常重要。人们会花费大量的时间和金钱来寻找准确的声音。\n我希望你觉得这很酷，我知道这是个随机话题。目前我正在用javascript构建合成器，因此出现了这个奇怪的话题。如果你感兴趣，敬请关注或联系我们。", "note_en": "Distortion is everywhere in music, especially when electric guitars are involved. It’s the crunchy, fuzzy sound that makes rock music sound rocky. It came into existence by accident when too much signal was fed into analogue components and people realised it made an interesting sound.\n One of the reasons it sounds so cool is that it preserves the frequency of the note being played, while adding other frequencies on top. With analogue components, this (sort of) works by clipping the signal used to generate the sound. The end result depends on the circuits and components used, so there’s a lot of variety. The right distortion can add character to any sound.\n In the digital world, distortion is commonly created using a technique called wave shaping, which is a cool concept that I thought deserved a blog post. You can use wave shaping to create a simple clipping distortion, but it can do a few more things as well.\n  Everything below this paragraph needs javascript enabled to run, the source code is  here if you don’t trust me. I’m using some sound demos based on pure sine waves which sound utterly horrible, but the graphs are so much prettier. I’ve made sure things aren’t too loud but make sure your volume isn’t turned up super high. The sounds get better at the end.\n I know some of you will be viewing this on a phone. Good luck,  technically it should work.\n  Use this to change the volume of every sound on this page. Click each graph to play its sound, and click again to stop.\n   This is a basic sine wave playing at 440Hz (an A note) with clipping, you can fade between the clipped and not-clipped waves and adjust the clipping level using the sliders below.\n      When the clipping value is outside the usual value of the wave, the clipped sine wave sounds exactly the same as the pure sine wave. I told you they sound horrible…\n  Groups of sine waves sound slightly less bad than single waves, mathematicians out there will know you can form any sound with a combination of sine waves, but I’m not going that far.\n I’ll apply the same clipping to a group of seven sine waves which have frequencies close, but not exactly the same. This makes them interfere with each other in a way which causes a beating effect (it still doesn’t sound very nice).\n A quirk of clipping is that quieter sounds will not hit the threshold, so only the louder sounds get changed. This is how you get “overdrive” effects on loud sounds.\n Another side effect of clipping is that it limits the volume, so the distortion is often paired with a boost to the amplitude.\n The waveform here (and above) is being drawn about 100x slower than the sound you can hear:\n  This slider changes the distortion amount, further to the right is more clipping coupled with a higher boost:\n   Under the hood I’m using a technique called wave shaping to create the clipped signals. It’s often used to emulate more classic distortion sounds which are a bit more involved than clipping. And it can do quite a lot more.\n It works by using a transfer function, which maps every  input value (between -1 and 1) to an  output value also between -1 and 1.\n Here are a few examples of transfer functions, the axes on the graph both go from -1 to 1. The cursor position will show example values of the function:\n    Below shows the result of applying the transfer function to a sine wave. Click the graph to play the sound, you can change the function by clicking the buttons while it’s playing to hear the difference.\n  Some info on the different functions (look at this page’s source and search “Hello!” to see the functions themselves):\n Clip/Boost - clips to 0.5 and doubles the amplitude to keep the volume the same\n        Very Noisy - replaces the signal with random noise, but you can still hear the original tone (I think this is due to aliasing)\n   Here are some audio recordings which will be run through the transfer function, I’ve copied the different distortion buttons below so you can mess about with the sound while it’s playing (remember, linear will play the sound unchanged). Have fun!\n    These might not work in some browsers, try playing one of the sine waves above first, then email me\n         The quadratic one sounds so odd. It’s because it’s an even function whereas most of the others are… odd. These are side effects of the symmetry of the function, they change the harmonics produced by the distortion.\n The difference between clip/boost and exponential is subtle - these are the sorts of differences that become very important for high end audio equipment. People will spend lots of time and money looking for the exact right sound.\n  I hope you found that cool, I know it’s a random subject. I’m building a synthesiser in javascript at the moment, hence the weird topic. Stay tuned or get in touch if you’re interested.", "posttime": "2020-05-19 16:00:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失真,works,声音", "title": "音乐中的失真是如何起作用的", "title_en": "How Distortion Works in Music", "transed": 1, "url": "https://benmosheron.gitlab.io/blog/2020/04/26/distortion.html", "via": "", "real_tags": ["失真", "works", "声音"]}, {"category": "", "categoryclass": "", "imagename": "9c5c449ca31c00b372124e031a937051.png", "infoid": 1002755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“谢谢您的盛情邀请，洛穆托先生。我很快就会回到英国，所以这是非常及时的。“。\n“谢谢你同意见我，…先生。…爵士。查尔斯·…。A.R.…。霍尔。这是我莫大的荣幸。我甚至不知道该怎么称呼你。你被封为爵士了吗？“。\n“叫我托尼吧，如果不太麻烦的话，请允许我叫你尼科。”\n从表面上看，这是一个平淡无奇的场景--两个男人在享受威士忌。然而，仔细观察就会发现一些耐人寻味的细节。对于初学者来说，这是一种你可以用刀割断的张力。\n托尼·霍尔(Tony Hoare)穿着一套剪裁精美的四件套西装，神情淡然，只有英国人才能做到这一点，他就像一杯茶一样英国化。当他从杯子里啜饮时，他无可奈何的鬼脸充分说明了他对波旁威士忌与苏格兰威士忌的看法。在小桌子的另一边，尼科·洛穆托(Nico Lomuto)与众不同：他是一个穿着休闲的程序员，正享受着他的威士忌和可口可乐(这件事如此令人震惊，以至于托尼很早就决定刻意假装没有注意到，就像面对成熟的体味或攻击性纹身时一样)，看到他刚刚遇到的计算机科学巨头，他有一种放松的敬畏之情。\n“听着，托尼，”尼科在闲聊结束时说，“关于那个分区算法。我从来没有想过要发表或--“。\n“哦？是的，是的，分区算法。“。托尼假装惊讶地扬起眉毛，仿佛他没有想到过去五年里关于快速排序的每一篇论文和每一本书都同时提到了它们的名字。这显然是连接两个人和会面动机的唯一因素，但是托尼这个完美的绅士，如果他的谈话伙伴不提起天气，他可以在房间里用粉色的大象谈论几个小时的天气。\n“是的，那个不断被提及的分区算法和你的一样，”尼科继续说。“我不是一个很好的算法理论家。我正在开发Ada，关于我的分区方案的整个事情让我分心。令人烦恼的是，“尼科用一种毫无掩饰的人的语气说，”它甚至不是一个更好的算法。我的分区方案将始终执行与您的相同数量的比较和至少相同数量的交换。在最坏的情况下，我的是n个额外的掉期-n！我不明白他们为什么一直提到这件受祝福的事。现在已经不是我能控制的了。我不能告诉他们应该教授和出版什么算法。就像泡泡酱一样。每当有人提到快速排序时，观众中就会有一些笨蛋--或者我应该说是泡泡脑袋--是的，我也听说过泡泡排序算法。让我毛骨悚然。“\n尼科叹了口气。托尼点点头。共同的价值观。融洽的空气中弥漫着突如其来的、安静的、愉悦的气息，就像烤箱里传出的饼干的味道一样。几秒钟过去了。杰克和可乐喝了一口。桌子的另一边，波旁小口喝了一口，做了个无可奈何的鬼脸。\n托尼讲话时用的是一位科学家精心挑选的措辞，他不想让任何假说都没有被探究过。“我明白，尼科。不过，请考虑以下几点。您的算法简单而规则，只向一个方向移动，并且每步最多进行一次交换。这可能适用于一些未来的…计算机。“。\n“无论机器如何，掉期越多不可能比掉期越少。这是常识，“尼科专横地说。\n“我不会那么肯定。计算机没有常识。计算机令人惊讶。理所当然，他们将继续这样做。嗯，不如我们好好享受今晚吧。没有什么比在安静的俱乐部里进行一次愉快的谈话更好的了。“。\n“是的。干杯。这是个有趣的地方。我听说他们很快就会有现场的乡村音乐。“。\n多年来，我一直对分类问题有一种未表白的上瘾。这并不难隐藏-在很大程度上，痴迷于研究排序是一种社会上可以容忍的混乱职业；毫无疑问，许多程序员花了几个深夜尝试另一种排序方法，它将比其他方法好得多。所以，当我在2002年写关于排序的文章时，没有人对此感到惊讶(听说过“Fit Pivot”吗？)。你当然没有)。当我编写D的std.ort时，没有组织任何干预，结果证明它有时是二次的(谢天谢地，后来得到了修复)。即使当我作为一个独立的局外人写了一篇关于选择问题的学术论文(索特的表亲)时，也没有人嘲笑我，就连会议组织者都说这是一个相当不错的把戏。当我在CppCon 2019年谈到分类时，没有引起公众的愤怒。程序员明白这一点。\n所以，我设法做到了。你知道他们怎么说的-一天一次。然而，当我看到最近一篇论文的标题：“分支预测失误不会影响Mergesort时，我确实感到了一丝兴奋。”如此耐人寻味的标题。首先，分支机构的错误预测预计会影响合并排序吗？我没有太多的想法，主要是因为每个人和他们的猫都在使用快速排序，而不是Mergesort，所以后者并不是我关注的焦点。但是哎，我根本不需要担心，因为标题坚决断言，我不知道我应该担心的那个问题，我终究不需要担心。因此，在某种程度上，标题会自动抵消。然而，我确实读了这篇论文(并建议您也这样做)，在许多有趣的见解中，有一个引起了我的注意：从效率的角度讨论了Lomuto的分区方案，认为它是一个重要的竞争者(与普遍使用的Hoare分区相比)。效率！\n让我们首先回顾一下这两个分区方案。在给定数组和枢轴元素的情况下，划分数组意味着排列数组的元素，使得小于或等于枢轴的所有元素都在左侧，而大于或等于枢轴的元素在右侧。轴心的最终位置将位于边界。(如果有多个等效的轴值，则最终轴位可能会有所不同，这会带来重要的实际后果；但是，对于本文的讨论，我们可以假设所有数组值都是不同的。)\nLomuto的分区方案从左到右遍历数组，保持一个“读”位置和一个“写”位置，这两个位置最初都是0。对于每个读取的元素，如果“读磁头”看到的值大于枢轴，则跳过它(读磁头移动到下一个位置)。否则，读磁头的值与写磁头的值互换，并且两个磁头都前进一个位置。当读磁头完成时，写磁头的位置定义分区。请参考下面的动画(来自维基百科用户Mastremo，在CC-by-SA3.0许可下未经修改使用)。\nLomuto分区的问题在于它可能会进行不必要的交换。考虑只有最左边的元素大于轴心的数组的极端情况。该元素将在每个迭代步骤中笨拙地向右移动一个位置，其方式与，嗯，气泡排序没有什么不同。\nHoare的分区方案巧妙地解决了这个问题，它使用两个“读/写头”从阵列的两端同时迭代。它们跳过已经适当放置的元素(小于左侧的轴心，大于右侧的轴心)，并且仅将左侧的一个较小的元素替换为右侧的一个较大的元素。当两个磁头相遇时，阵列围绕会合点进行分区。上面描述的极端情况是通过单个交换来处理的。大多数当前的快速排序实现都使用Hoare分区，原因很明显：它进行的比较次数与Lomuto分区一样多，交换更少。\n考虑到Hoare分区显然比Lomuto分区做的工作少，问题是为什么要教授或使用后者。STL的创建者Alexander Stepanov写了一篇关于划分的很好的讨论，并提出了一个一般性的论点：Lomuto分区只需要前向迭代器，而Hoare分区需要双向迭代器。这是一个有价值的见解，尽管实用价值有限：是的，您可以在单链表上使用Lomuto的分区，但大多数情况下，您是为了快速排序而分区，并且您不想对单链表进行快速排序；Mergesort将是选择的算法。\n然而，确实存在一个非常实用(也非常令人惊讶)的论点，这也是本文的笑点：以无分支的方式实现的Lomuto分区在随机数据上比Hoare分区快得多。考虑到快速排序将其大部分时间花在分区上，因此我们将看到快速排序的巨大改进(是的，我说的是C++和D的工业强度实现)，将其分区算法替换为真正做更多工作的算法。\n要了解cookie是如何崩溃的，让我们仔细看看Hoare分区的实现。为了消除所有无关紧要的细节，本文中的代码作为元素类型编写，并使用原始指针。它的编译和运行方式与C++或D编译器相同。本文将用两种语言进行所有例程的实现，因为很多研究文献都使用C++的std：：Sort作为重要的基线来衡量算法性能。\n/**以第一个和最后一个元素中的最小值作为透视的分区。返回：指向轴心最终位置的指针。*/long*HOARE_PARTITION(long*first，long*last){assert(first&lt；=last)；if(last-first&lt；2)先返回；//没有什么有趣的事情要做--last；if(*first&gt；*last)交换(*first，*last)；AUTO PIVOT_POS=FIRST；AUTO PIVOT=*PIVOT_POS；FOR(；){++FIRST；AUTO f=*FIRST；WHILE(f&lt；PIVOT)f=*++FIRST；AUTO l=*LAST；WHILE(PIVOT&lt；l)l=*--LAST；IF(FIRST&&gt;；=LAST)Break；*First=l；*Last=f；--LAST；}--First；SWAP(*First，*Pivot_pos)；Return First；}。\n(您可能会发现选择枢轴有点奇怪，但不用担心：通常它是一个更复杂的方案-比如3的中值-但对核心循环来说重要的是，枢轴不是数组中最大的元素。这允许核心循环省略许多限制条件，而不会超出数组界限。)\n关于此实现的效率有很多好的方面(您可能会在C++或D标准库的实现中发现这一点，但细节稍有更改)。您可以看出上面的代码是由过着简朴生活的人编写的。那些保持指甲清洁的人，当他们说他们会出现的时候就会出现，并定期给妈妈打电话。他们每天早上都要练武术，不让电脑周期浪费掉。该代码毫无松懈之处。生成的英特尔程序集非常紧凑，对于C++和D几乎完全相同，它只在后端之间有所不同，与GCC(参见g++和gdc)相比，llvm的代码大小略有优势(参见clang和ldc)。\n下面所示的Lomuto分区的初始实现对于展示来说工作得很好，但是从效率的角度看是草率的：\n/**选择透视表作为第一个元素，然后分区。返回：指向轴心最终位置的指针。*/long*lomuto_PARTITION_NAIVE(long*first，long*last){assert(first&lt；=last)；if(last-first&lt；2)先返回；//没有任何有趣的事情要做，auto Pivot_pos=first；auto Pivot=*first；++first；for(auto read=first；read&lt；last；++read){if(*read&lt；vot){exchange(*read，*first)；++first；for(auto read=first；read&lt；last；++read){if(*read&lt；Pivot){exchange(*read，*first)；++first；交换(*First，*Pivot_pos)；返回第一个；}。\n对于初学者来说，如果数组左侧的一串元素大于轴心，上面的代码将执行大量愚蠢的无操作交换(数组元素本身)。所有时间FIRST==WRITE，所以将*FIRST与*WRITE互换是不必要的，也是浪费的。让我们用一个预处理循环来解决这个问题，该循环跳过不感兴趣的初始部分：\n/**以第一个和最后一个元素中的最小值作为透视的分区。返回：指向轴心最终位置的指针。*/long*lomuto_PARTITION(long*first，long*last){assert(first&lt；=last)；if(last-first&lt；2)先返回；//没有什么有趣的事情要做--last；if(*first&&gt;；*last)exchange(*first，*last)；AUTO PIVOT_POS=FIRST；AUTO PIVOT=*FIRST；//Prelude：第一个元素上的第一个位置(写头)比枢轴大//执行{++First；}While(*First&lt；Pivot)；Assert(First&lt；=Last)；//主菜。FOR(AUTO READ=FIRST+1；READ&lt；LAST；++READ){AUTO x=*READ；IF(x&lt；PIVOT){*READ=*FIRST；*FIRST=x；++FIRST；}//将枢轴放在它所属的位置。ASSERT(*FIRST&&gt;；=PIVOT)；--FIRST；*PIVOT_POS=*FIRST；*FIRST=PIVOT；RETURN FIRST；}。\n该函数现在选择轴心作为第一个和最后一个元素中最小的元素，就像HOARE_PARTITION一样。我还做了另一个小更改-不使用交换例程，而是使用显式赋值。优化器会自动处理这个问题(注册加上WIN的寄存器分配)，但是用源代码表示它可以帮助我们看到相对昂贵的数组读取和数组写入。现在是有趣的部分。让我们将重点放在核心循环上：\nFOR(AUTO READ=FIRST+1；READ&lt；LAST；++READ){AUTO x=*READ；IF(x&lt；PIVOT){*READ=*FIRST；*FIRST=x；++FIRST；}}。\n让我们来考虑一下统计数据。此循环中有两个条件：read&lt；last和x&lt；vot。它们的可预测性如何？第一个是非常可预测的--你可以可靠地预测它永远是真的，而且不管数组有多大，你只会错一次。编译器编写人员和硬件设计人员都知道这一点，并在假设循环将继续的情况下设计最快路径。(送给你的英特尔工程师朋友的礼物点子：一张写着“向后的分支总是被拿走”的受气垫。)。甚至在决定循环是否应该继续之前，CPU就会推测性地开始执行循环的下一次迭代。该工作只会在循环结束时被丢弃一次。这就是投机性行刑的魔力。\n第二个测试x&lt；Pivot的情况就不那么令人愉快了。如果你假设随机数据和随机选择的轴心，它可能以相等的概率走向任何一个方向。这意味着投机性执行根本没有效果，这对效率非常不利。有多糟？在深度管道架构中(就像今天一样)，失败的投机意味着需要丢弃几个管道阶段所做的工作，这反过来会在管道中传播一个无用的泡沫(比如花园软管中的气泡)。如果这些气泡出现得太频繁，循环只会以可获得带宽的一小部分产生结果。正如测量部分将显示的那样，一次浪费的投机会降低大约30%的潜在速度。\n如何改进这个问题？这里有一个想法：我们不是做出控制执行流的决策，而是以直线方式编写代码，并将决策合并为整数，通过精心选择的数组索引来指导数据流。做好准备--这会迫使我们做傻事。例如，我们不会在每个迭代中执行两次条件写入，而是无论发生什么情况，我们都会在每个迭代中执行两次写入。如果不需要写入，我们将用它们自己的值覆盖内存中的单词。(我提到“傻事”了吗？)。要为所有这些做好代码准备，让我们按如下方式重写它：\nFOR(AUTO READ=First+1；Read&lt；Last；++Read){auto x=*Read；If(x&lt；Pivot){*Read=*First；*First=x；First+=1；}Else{*Read=x；*First=*First；First+=0；}}。\n现在，除了数据之外，循环的两个分支几乎完全相同。代码仍然是正确的(尽管很奇怪)，因为在Else分支上，它不必要地写*、读自己和*首先写自己。我们现在怎么把这两个分支统一起来呢？要以有效的方式做到这一点，需要进行一些思考和试验。有条件地递增First很容易，因为我们总是可以先写+=x&lt；Pivot。小菜一碟。这两个内存写入比较困难，但基本思想是取指针之间的差异并使用索引。这是密码。花点时间想一想：\nfor(；read&lt；last；++read){auto x=*read；auto size=-int(x&lt；Pivot)；auto Delta=Small&amp；(先读)；First[Delta]=*First；Read[-Delta]=x；First-=Smaller；}。\n套用一句著名的拉丁语格言，“CODEX BREVIS EST”，“CODEX BREVIS EST”。短是暗号，长是“平地”。带有-int(x&lt；Pivot)的较小掩码的初始化看起来很奇怪，但却有很好的理由：较小既可以用作通常算术中使用的整数(0或-1)，也可以用作位运算中使用的掩码0或0xFFFFFFFFF(即，将所有位设置为0或全部设置为1)。我们将使用该掩码来允许或清除计算Δ的下一行中的另一个积分。如果x&lt；Pivot，则较小的为全一，并且增量被初始化为读取优先。随后，在First[Delta]和Read[-Delta]中使用Delta，它们实际上分别是*(First+Delta)和*(Read-Delta)的语法糖。如果我们在这些表达式中替换Delta，我们将分别获得*(first+(read-first))和*(read-(read-first))。\n最后一行first-=size很普通：如果x&lt；轴心，则从first中减去-1，这等同于先递增。否则，从第一个减去0，实际上只留下第一个。干得漂亮。\n将x&lt；Pivot替换为1后，在循环体中完成的计算将变为：\nAUTO x=*READ；INT SIMLEER=-1；AUTO DELTA=-1&A；(先读)；*(FIRST+(先读))=*FIRST；*(READ-(READ-FIRST))=x；FIRST-=-1；\n两个指针表达式魔术般地简化为*read和*first，因此两个赋值实现了交换(回想一下，x刚刚用*read初始化)。我们在最初版本的测试的True分支中所做的完全一样！\n如果x&lt；Pivot为FALSE，则增量初始化为零，循环体的工作方式如下：\nAUTO x=*READ；INT SIMLEER=0；AUTO DELTA=0&AMP；(FIRST-FIRST)；*(FIRST+0)=*FIRST；*(READ-0)=x；FIRST-=0；\n这一次事情更简单了：*先改写*Read本身，*Read也改写自己，而先不去管第一个。代码没有任何效果，这正是我们想要的。\nlong*lomuto_分区_分支自由(long*first，long*last){assert(first&lt；=last)；if(last-first&lt；2)先返回；//没有什么有趣的事情要做--last；if(*first&&gt;；*last)exchange(*first，*last)；auto vot_pos=first；auto vot=*first；do{+first；assert(first&lt；=last)；}while(*first&lt；=lastFOR(AUTO READ=FIRST+1；读取最后一个；++读取){AUTO x=*READ；AUTO SIZER=-INT(x&lt；PIVOT)；AUTO增量=SIMPLE&A；(先读)；First[增量]=*First；Read[-Delta]=x；First-=Smaller；}Assert(*First&gt；=Pivot)；--First；*Pivot_pos=*First；*First=Pivot；Return First；}。\n她很漂亮，不是吗？更漂亮的是生成的代码-看看clang/ldc和g++/gdc。同样，后端之间也有一些差异。\n为了比较这两种分区方案，我组合了一个快速排序实现。这是因为大多数情况下，在快速排序过程中会使用分区。为简化起见，测试实现省略了工业快速排序实现中存在的一些细节，它们需要担心各种数据形状(部分预先排序的升序或降序、带有本地模式、具有许多重复项等)。库实现从通常由3-9个元素组成的样本中谨慎地选择枢轴，可能是随机化的，并且具有检测和避免病理性输入的方法，最常见的是使用Introsorte。\n在我们的基准测试中，为了简单起见，我们只针对随机数据进行测试，并且选择的轴心很简单。\n..", "note_en": "“Thank you for your kind invitation, Mr. Lomuto. I will soon return to England so this is quite timely.”\n “And thanks for agreeing to meeting me, Mister… Sir… Charles… A.R… Hoare. It’s a great honor. I don’t even know how to address you. Were you knighted?”\n “Call me Tony, and if it’s not too much imposition please allow me to call you Nico.”\n On the surface, a banal scene—two men enjoying a whiskey. However, a closer look revealed a number of intriguing details. For starters, a tension you could cut with a knife.\n Dressed in a perfectly tailored four-piece suit worn with the nonchalance only an Englishman could pull off, Tony Hoare was as British as a cup of tea. His resigned grimaces as he was sipping from his glass spoke volumes about his opinion of Bourbon versus Scotch. On the other side of the small table, Nico Lomuto couldn’t have been more different: a casually dressed coder enjoying his whiskey with Coca-Cola (a matter so outrageous that Tony had decided early on to studiously pretend not to notice, as he would when confronted with ripe body odor or an offensive tattoo), in a sort of relaxed awe at the sight of the Computer Science giant he had just met.\n “Listen, Tony,” Nico said as the chit chat petered off, “about that partitioning algorithm. I never meant to publish or—”\n “Oh? Yes, yes, the partitioning algorithm.” Tony’s eyebrows rose with feigned surprise, as if it had escaped his mind that every paper and book on quicksort in the past five years mentioned their names together. It was obviously the one thing connecting the two men and the motivation of the meeting, but Tony, the perfect gentleman, could talk about the weather for hours with a pink elephant in the room if his conversation partner didn’t bring it up.\n “Yeah, that partitioning algorithm that keeps on getting mentioned together with yours,” Nico continued. “I’m not much of an algorithms theorist. I’m working on Ada, and this entire thing about my partition scheme is a distraction. The bothersome part about it”—Nico was speaking in the forthcoming tone of a man with nothing to hide—”is that it’s not even a better algorithm.  My partitioning scheme will always do the same number of comparisons and at least as many swaps  as yours. In the worst case, mine does  n additional swaps— n! I can’t understand why they keep on mentioning the blessed thing. It’s out of my hands now. I can’t tell them what algorithms to teach and publish. It’s like bubblesort. Whenever anyone mentions quicksort, there’s some chowderhead—or should I say bubblehead—in the audience going, yes, I also heard of the bubblesort algorithm. Makes my blood curdle.”\n Nico sighed. Tony nodded. Mutual values. Rapport filled the air in between as suddenly, quietly, and pleasantly as the smell of cookies out of the oven. A few seconds went by. Jack and Coke sip. On the other side of the table, Bourbon sip, resigned grimace.\n Tony spoke with the carefully chosen words of a scientist who wants to leave no hypothesis unexplored. “I understand, Nico. Yet please consider the following. Your algorithm is simple and regular, moves in only one direction, and does at most one swap per step. That may be appropriate for some future machines that…”\n “No matter the machine, more swaps can’t be better than fewer swaps. It’s common sense,” Nico said, peremptorily.\n “I would not be so sure. Computers do not have common sense. Computers are surprising. It stands to reason they’ll continue to be. Well, how about we enjoy this evening. Nothing like a good conversation in a quiet club.”\n “Yeah. Cheers. This is a fun place. I hear they’ll have live country music soon.”\n   I’ve carried an unconfessed addiction to the sorting problem for many years. Wasn’t that difficult to hide—to a good extent, an obsessive inclination to studying sorting is a socially tolerated  déformation professionnelle; no doubt many a programmer has spent a few late nights trying yet another sorting idea that’s going to be so much better than the others. So nobody raised an eyebrow when I wrote about sorting all the way back in 2002 (ever heard about “fit pivot?”  Of course you didn’t). There was no intervention organized when I wrote  D’s  std.sort, which  turned out to be sometimes quadratic (and has been thankfully fixed since). No scorn even when I wrote an academic  paper on the selection problem (sort’s cousin) as an unaffiliated outsider, which even the conference organizers said was quite a trick. And no public outrage when I  spoke about sorting at CppCon 2019. Coders understand.\n So, I manage. You know what they say—one day at a time. Yet I did feel a tinge of excitement when I saw the title of a recent paper:  “Branch Mispredictions Don’t Affect Mergesort.” Such an intriguing title. To start with, are branch mispredictions expected to affect mergesort? I don’t have much of an idea, mainly because everybody and their cat is using quicksort, not mergesort, so the latter hasn’t really been at the center of my focus. But hey, I don’t even need to worry about it because the title resolutely asserts that that problem I didn’t know I was supposed to worry about, I don’t need to worry about after all. So in a way the title cancels itself out. Yet I did read the paper (and recommend you do the same) and among many interesting insights, there was one that caught my attention: Lomuto’s partitioning scheme was discussed as a serious contender (against the universally-used Hoare partition) from an efficiency perspective. Efficiency!\n   Let’s first recap the two partitioning schemes. Given an array and a pivot element, to partition the array means to arrange elements of the array such that all elements smaller than or equal to the pivot are on the left, and elements greater than or equal to the pivot are on the right. The final position of the pivot would be at the border. (If there are several equivalent pivot values that final pivot position may vary, with important practical consequences; for this discussion, however, we can assume that all array values are distinct.)\n Lomuto’s partitioning scheme walks the array left to right maintaining a “read” position and a “write” position, both initially at 0. For each element read, if the value seen by the “read head” is greater than the pivot, it gets skipped (with the read head moving to the next position). Otherwise, the value at the read head is swapped with that at the write head, and both heads advance by one position. When the read head is done, the position of the write head defines the partition. Refer to the nice animation below (from Wikipedia user Mastremo, used unmodified under  the CC-BY-SA 3.0 license).\n  The problem with Lomuto’s partition is that it may do unnecessary swaps. Consider the extreme case of an array with only the leftmost element greater than the pivot. That element will be awkwardly moved to the right one position per iteration step, in a manner not unlike, um, bubblesort.\n Hoare’s partitioning scheme elegantly solves that issue by iterating concomitantly from both ends of the array with two “read/write heads”. They skip elements that are already appropriately placed (less than the pivot on the left, greater than the pivot on the right), and swap only one smaller element from the left with one greater element from the right. When the two heads meet, the array is partitioned around the meet point. The extreme case described above is handled with a single swap. Most contemporary implementations of quicksort use Hoare partition, for obvious reasons: it does as many comparisons as the Lomuto partition and fewer swaps.\n Given that Hoare partition clearly does less work than Lomuto partition, the question would be why ever teach or use the latter at all. Alexander Stepanov, the creator of the STL, authored  a great discussion about partitioning and makes a genericity argument: Lomuto partition only needs forward iterators, whereas Hoare partition requires bidirectional iterators. That’s a valuable insight, albeit of limited practical utility: yes, you could use Lomuto’s partition on singly-linked lists, but most of the time you partition for quicksort’s sake, and you don’t want to quicksort singly-linked lists; mergesort would be the algorithm of choice.\n Yet a very practical—and very surprising—argument does exist, and is the punchline of this article: implemented in a branch-free manner, Lomuto partition is a lot faster than Hoare partition on random data. Given that quicksort spends most of its time partitioning, it follows that we are looking at a hefty improvement of quicksort (yes, I am talking about industrial strength implementations for C++ and D) by replacing its partitioning algorithm with one that literally does more work.\n   To see how the cookie crumbles, let’s take a look at a careful implementation of Hoare partition. To eliminate all extraneous details, the code in this article is written for  long as the element type and uses raw pointers. It compiles and runs the same with a C++ or D compiler. This article will carry along implementations of all routines in both languages because much research literature measures algorithm performance using C++’s  std::sort as an important baseline.\n /**\rPartition using the minimum of the first and last element as pivot.\rReturns: a pointer to the final position of the pivot.\r*/\rlong* hoare_partition(long* first, long* last) {\r assert(first &lt;= last);\r if (last - first &lt; 2)\r return first; // nothing interesting to do\r --last;\r if (*first &gt; *last)\r swap(*first, *last);\r auto pivot_pos = first;\r auto pivot = *pivot_pos;\r for (;;) {\r ++first;\r auto f = *first;\r while (f &lt; pivot)\r f = *++first;\r auto l = *last;\r while (pivot &lt; l)\r l = *--last;\r if (first &gt;= last)\r break;\r *first = l;\r *last = f;\r --last;\r }\r --first;\r swap(*first, *pivot_pos);\r return first;\r}\n (You may find the choice of pivot a bit odd, but not to worry: usually it’s a more sophisticated scheme—such as median-of-3—but what’s important to the core loop is that the pivot is not the largest element of the array. That allows the core loop to omit a number of limit conditions without running off array bounds.)\n There are a lot of good things to say about the efficiency of this implementation (which you’re likely to find, with minor details changed, in implementations  of the C++ or  D standard library). You could tell the code above was written by people who live trim lives. People who keep their nails clean, show up when they say they’ll show up, and call Mom regularly. They do a  wushu routine every morning and don’t let computer cycles go to waste. That code has no slack in it. The generated Intel assembly is remarkably tight and virtually identical for C++ and D. It only varies across backends, with LLVM at a slight code size advantage (see  clang and  ldc) over gcc (see  g++ and  gdc).\n The initial implementation of Lomuto’s partition shown below works well for exposition, but is sloppy from an efficiency perspective:\n /**\rChoose the pivot as the first element, then partition.\rReturns: a pointer to the final position of the pivot. \r*/\rlong* lomuto_partition_naive(long* first, long* last) {\r assert(first &lt;= last);\r if (last - first &lt; 2)\r return first; // nothing interesting to do\r auto pivot_pos = first;\r auto pivot = *first;\r ++first;\r for (auto read = first; read &lt; last; ++read) {\r if (*read &lt; pivot) {\r swap(*read, *first);\r ++first;\r }\r }\r --first;\r swap(*first, *pivot_pos);\r return first;\r}\n For starters, the code above will do a lot of silly no-op swaps (array element with itself) if a bunch of elements on the left of the array are greater than the pivot. All that time  first==write, so swapping  *first with  *write is unnecessary and wasteful. Let’s fix that with a pre-processing loop that skips the uninteresting initial portion:\n /**\rPartition using the minimum of the first and last element as pivot. \rReturns: a pointer to the final position of the pivot.\r*/\rlong* lomuto_partition(long* first, long* last) {\r assert(first &lt;= last);\r if (last - first &lt; 2)\r return first; // nothing interesting to do\r --last;\r if (*first &gt; *last)\r swap(*first, *last);\r auto pivot_pos = first;\r auto pivot = *first;\r // Prelude: position first (the write head) on the first element\r // larger than the pivot.\r do {\r ++first;\r } while (*first &lt; pivot);\r assert(first &lt;= last);\r // Main course.\r for (auto read = first + 1; read &lt; last; ++read) {\r auto x = *read;\r if (x &lt; pivot) {\r *read = *first;\r *first = x;\r ++first;\r }\r }\r // Put the pivot where it belongs.\r assert(*first &gt;= pivot);\r --first;\r *pivot_pos = *first;\r *first = pivot;\r return first;\r}\n The function now chooses the pivot as the smallest of first and last element, just like  hoare_partition. I also made another small change—instead of using the  swap routine, let’s use explicit assignments. The optimizer takes care of that automatically (enregistering plus register allocation for the win), but expressing it in source helps us see the relatively expensive array reads and array writes. Now for the interesting part. Let’s focus on the core loop:\n for (auto read = first + 1; read &lt; last; ++read) {\r auto x = *read;\r if (x &lt; pivot) {\r *read = *first;\r *first = x;\r ++first;\r }\r}\n Let’s think statistics. There are two conditionals in this loop:  read &lt; last and  x &lt; pivot. How predictable are they? Well, the first one is eminently predictable—you can reliably predict it will always be true, and you’ll only be wrong once no matter how large the array is. Compiler writers and hardware designers know this, and design the fastest path under the assumption loops will continue. (Gift idea for your Intel engineer friend: a doormat that reads “The Backward Branch Is Always Taken.”) The CPU will speculatively start executing the next iteration of the loop even before having decided whether the loop should continue. That work will be thrown away only once, at the end of the loop. That’s the magic of speculative execution.\n Things are quite a bit less pleasant with the second test,  x &lt; pivot. If you assume random data and a randomly-chosen pivot, it could go either way with equal probability. That means speculative execution is not effective at all, which is very bad for efficiency. How bad? In a deeply pipelined architecture (as all are today), failed speculation means the work done by several pipeline stages needs to be thrown away, which in turn propagates a bubble of uselessness through the pipeline (think air bubbles in a garden hose). If these bubbles occur too frequently, the loop produces results at only a fraction of the attainable bandwidth. As the measurements section will show, that one wasted speculation takes away about 30% of the potential speed.\n How to improve on this problem? Here’s an idea: instead of making decisions that control the flow of execution, we write the code in a straight-line manner and we incorporate the decisions as integers that guide the  data flow by means of carefully chosen array indexing. Be prepared—this will force us to do silly things. For example, instead of doing two conditional writes per iteration, we’ll do exactly two writes per iteration no matter what. If the writes were not needed, we’ll overwrite words in memory with their own value. (Did I mention “silly things”?) To prepare the code for all that, let’s rewrite it as follows:\n for (auto read = first + 1; read &lt; last; ++read) {\r auto x = *read;\r if (x &lt; pivot) {\r *read = *first;\r *first = x;\r first += 1; \r } else {\r *read = x;\r *first = *first;\r first += 0; \r }\r}\n Now the two branches of the loop are almost identical save for the data. The code is still correct (albeit odd) because on the  else branch it needlessly writes  *read over itself and  *first over itself. How do we now unify the two branches? Doing so in an efficient manner takes a bit of pondering and experimentation. Conditionally incrementing  first is easy because we can always write  first += x &lt; pivot. Piece of cake. The two memory writes are more difficult, but the basic idea is to take the difference between pointers and use indexing. Here’s the code. Take a minute to think it over:\n for (; read &lt; last; ++read) {\r auto x = *read;\r auto smaller = -int(x &lt; pivot);\r auto delta = smaller &amp; (read - first);\r first[delta] = *first;\r read[-delta] = x;\r first -= smaller;\r}\n To paraphrase a famous Latin aphorism,  explanatio longa, codex brevis est. Short is the code, long is the ‘splanation. The initialization of  smaller with  -int(x &lt; pivot) looks odd but has a good reason:  smaller can serve as both an integral ( 0 or  -1) used with the usual arithmetic and also as a mask that is  0 or  0xFFFFFFFF (i.e. bits set all to 0 or all to 1) used with bitwise operations. We will use that mask to allow or obliterate another integral in the next line that computes  delta. If  x &lt; pivot,  smaller is all ones and  delta gets initialized to  read - first. Subsequently,  delta is used in  first[delta] and  read[-delta], which really are syntactic sugar for  *(first + delta) and  *(read - delta), respectively. If we substitute  delta in those expressions, we obtain  *(first + (read - first)) and  *(read - (read - first)), respectively.\n The last line,  first -= smaller, is trivial: if  x &lt; pivot, subtract  -1 from  first, which is the same as incrementing  first. Otherwise, subtract  0 from  first, effectively leaving  first alone. Nicely done.\n With  x &lt; pivot substituted to 1, the calculation done in the body of the loop becomes:\n auto x = *read;\rint smaller = -1;\rauto delta = -1 &amp; (read - first);\r*(first + (read - first)) = *first;\r*(read - (read - first)) = x;\rfirst -= -1;\n Kind of magically the two pointer expressions simplify down to  *read and  *first, so the two assignments effect a swap (recall that  x had been just initialized with  *read). Exactly what we did in the true branch of the test in the initial version!\n If  x &lt; pivot is  false,  delta gets initialized to zero and the loop body works as follows:\n auto x = *read;\rint smaller = 0;\rauto delta = 0 &amp; (read - first);\r*(first + 0) = *first;\r*(read - 0) = x;\rfirst -= 0;\n This time things are simpler:  *first gets written over itself,  *read also gets written over itself, and  first is left alone. The code has no effect whatsoever, which is exactly what we wanted.\n  long* lomuto_partition_branchfree(long* first, long* last) {\r assert(first &lt;= last);\r if (last - first &lt; 2)\r return first; // nothing interesting to do\r --last;\r if (*first &gt; *last)\r swap(*first, *last);\r auto pivot_pos = first;\r auto pivot = *first;\r do {\r ++first;\r assert(first &lt;= last);\r } while (*first &lt; pivot);\r for (auto read = first + 1; read &lt; last; ++read) {\r auto x = *read;\r auto smaller = -int(x &lt; pivot);\r auto delta = smaller &amp; (read - first);\r first[delta] = *first;\r read[-delta] = x;\r first -= smaller;\r }\r assert(*first &gt;= pivot);\r --first;\r *pivot_pos = *first;\r *first = pivot;\r return first;\r}\n A beaut, isn’t she? Even more beautiful is the generated code—take a look at  clang/ ldc and  g++/ gdc. Again, there is a bit of variation across backends.\n   To draw a fair comparison between the two partitioning schemes, I’ve put together a quicksort implementation. This is because most often a partition would be used during quicksort. For the sake of simplification, the test implementation omits a few details present in industrial quicksort implementations, which need to worry about a variety of data shapes (partially presorted ascending or descending, with local patterns, with many duplicates, etc). Library implementations choose the pivot carefully from a sample of usually 3-9 elements, possibly with randomization, and have means to detect and avoid  pathological inputs, most often by using  Introsort.\n In our benchmark, for simplicity, we only test against random data, and the choice of pivot is simply\n......", "posttime": "2020-05-19 15:43:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "洛穆托,lomuto,分区", "title": "洛穆托的复出", "title_en": "Lomuto's Comeback", "transed": 1, "url": "https://dlang.org/blog/2020/05/14/lomutos-comeback/", "via": "", "real_tags": ["洛穆托", "lomuto", "分区"]}]