[{"category": "", "categoryclass": "", "imagename": "92046e2b5e55753ba250112aeab682da.jpg", "infoid": 1006446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，尖端窃听技术的清单稳步增长：窃听、窃听电话、墙上的窃听器-甚至从建筑物的玻璃上弹射激光来窃听里面的对话。现在添加另一个用于音频间谍的工具：房间里从窗户可以看到的任何灯泡。\n以色列内盖夫本古里安大学和魏茨曼科学研究所的研究人员今天公布了一项新的远程窃听技术，他们称之为喇叭。他们说，只要有一台笔记本电脑和不到1000美元的设备--只需一台望远镜和一个400美元的光电传感器--任何人都可以通过观察这些微小的振动，实时监听数百英尺外的房间里的任何声音。通过测量这些振动引起的灯泡光输出的微小变化，研究人员表明，间谍可以获得足够清晰的声音，足以辨别对话的内容，甚至可以识别一段音乐。\n本·纳西(Ben Nassi)说，房间里的任何声音都可以从房间里恢复出来，不需要侵入房间里的任何东西，也不需要侵入房间里的任何设备。本·纳西是本-古里安公司的安全研究员，他与同事雅伦·皮鲁廷(Yaron Pirutin)和鲍里斯·扎多夫(Boris Zadov)共同开发了这项技术，并计划在8月份的黑帽安全会议上公布他们的发现。你只需要把一个悬挂的灯泡对准视线，就是这个。\n在他们的实验中，研究人员在距离目标办公室灯泡约80英尺的地方放置了一系列望远镜，并将每个望远镜的目镜放在Thorlabs PDA100A2光电传感器的前面。然后，他们使用模数转换器将来自该传感器的电信号转换为数字信息。当他们在遥远的房间里播放音乐和语音录音时，他们将他们的设置收集的信息输入笔记本电脑，笔记本电脑分析读数。\n研究人员发现，灯泡对声音的微小振动-他们测量到的移动幅度只有几百微米-登记为他们的传感器通过每个望远镜接收到的光的可测量变化。在通过软件处理信号以滤除噪音后，他们能够以惊人的保真度重建房间内的声音录音：例如，他们展示了，他们可以足够好地再现唐纳德·特朗普(Donald Trump)总统的一段演讲的可听片段，足以被谷歌的云语音API(Cloud Speech API)转录。他们还制作了一张甲壳虫乐队的录音，让它足够清晰，以至于名字调子应用Shazam可以立即识别出来。\n尽管如此，这项技术还是有一些局限性。在他们的测试中，研究人员使用了一个悬挂的灯泡，目前还不清楚安装在固定灯或天花板灯具上的灯泡是否会振动到足以产生相同类型的音频信号。他们在演示中使用的语音和音乐录音也比普通人类对话的声音更大，演讲者将音量调到了最大。但研究小组指出，他们也使用了相对便宜的光电传感器和模数转换器，本来可以升级到更昂贵的，以获得更安静的对话。LED灯泡的信噪比大约是白炽灯泡的6.3倍，是荧光灯的70倍。\n尽管有这些警告，斯坦福大学的计算机科学家和密码学家丹·博内赫(Dan Boneh)认为，研究人员的技术仍然代表着一种重要的、具有潜在实用价值的新形式，他称之为旁路攻击--一种利用无意中的信息泄露来窃取机密的攻击。Boneh说，这是侧向通道的一种很好的应用。即使这需要一个悬挂的灯泡和高分贝，它仍然是超级有趣的。这仍然是第一次证明这是可能的。攻击只会变得更好，未来的研究只会随着时间的推移而改进这一点。\n在北卡罗来纳州立大学的尤瓦尔·埃洛维奇(Yuval Elovici)和无处不在的RSA加密系统的共同发明人阿迪·沙米尔(Adi Shamir)的建议下，该研究小组并不是第一个证明意外的声波现象可以导致窃听的人。研究人员多年来一直知道，激光从目标的窗户上反弹可以让间谍接收到里面的声音。2014年，另一组研究人员表明，即使恶意软件无法访问智能手机的麦克风，受攻击智能手机的陀螺仪也可以接收到声音。之前最接近Lamphone的技术是麻省理工学院、微软和Adobe的研究人员在2014年所说的视觉麦克风：通过分析通过望远镜拍摄的视频，房间里的一个物体会产生振动，比如一袋薯片或一株室内植物，这些研究人员能够重建语音和音乐。这项技术在2014年被麻省理工学院(MIT)、微软(Microsoft)和Adobe的研究人员称为视觉麦克风：通过分析通过望远镜拍摄的视频，房间里的物体会产生振动，比如一袋薯片或一株室内植物。\n但纳西指出，这项基于视频的技术虽然用途更广，因为它不需要在房间里看到灯泡，但它需要在录制视频后使用软件对其进行分析，以便将在物体上观察到的微妙振动转换为它所拾取的声音。相比之下，Lamphone可以实现实时间谍活动。由于振动物体本身就是光源，光电传感器可以用简单得多的视觉数据来捕捉振动。\n纳西认为，这可能会使喇叭在间谍活动中的使用比以前的技术更实用。他说，当你真正实时使用它时，你可以实时回应，而不是失去机会。\n尽管如此，纳西说，研究人员公布他们的发现并不是为了让间谍或执法部门受益，而是为了让监视双方都清楚地知道什么是可能的。他表示：我们希望提高人们对这种攻击媒介的认识。我们不是在玩提供工具的游戏。\n虽然不太可能成为这项技术的目标，但它也很容易预防。只需盖上任何悬挂的灯泡，或者更好的做法是，拉上窗帘。如果你疑神疑鬼地担心这类间谍游戏，希望你已经在那些窗户上安装了防震装置，以防止用激光麦克风窃听。并清扫了你的房子寻找窃听器。并从你的手机和电脑上取下了麦克风。毕竟，在一个连灯泡都有耳朵的时代，偏执狂的工作永远不会完成。", "note_en": "The list of sophisticated eavesdropping techniques has grown steadily over years: wiretaps, hacked phones, bugs in the wall—even  bouncing lasers off of a building&#39;s glass to pick up conversations inside. Now add another tool for audio spies: Any light bulb in a room that might be visible from a window.\n Researchers from Israeli&#39;s Ben-Gurion University of the Negev and the Weizmann Institute of Science today revealed a new technique for long-distance eavesdropping they call &#34; lamphone.&#34; They say it allows anyone with a laptop and less than a thousand dollars of equipment—just a telescope and a $400 electro-optical sensor—to listen in on any sounds in a room that&#39;s hundreds of feet away in real-time, simply by observing the minuscule vibrations those sounds create on the glass surface of a light bulb inside. By measuring the tiny changes in light output from the bulb that those vibrations cause, the researchers show that a spy can pick up sound clearly enough to discern the contents of conversations or even recognize a piece of music.\n &#34;Any sound in the room can be recovered from the room with no requirement to hack anything and no device in the room,&#34; says Ben Nassi, a security researcher at Ben-Gurion who developed the technique with fellow researchers Yaron Pirutin and Boris Zadov, and who plans to present their findings at the Black Hat security conference in August. &#34;You just need line of sight to a hanging bulb, and this is it.&#34;\n In their experiments, the researchers placed a series of telescopes around 80 feet away from a target office&#39;s light bulb, and put each telescope&#39;s eyepiece in front of a Thorlabs PDA100A2 electro-optical sensor. They then used an analog-to-digital converter to convert the electrical signals from that sensor to digital information. While they played music and speech recordings in the faraway room, they fed the information picked up by their set-up to a laptop, which analyzed the readings.\n The researchers found that the tiny vibrations of the light bulb in response to sound—movements that they measured at as little as a few hundred microns—registered as measurable changes in the light their sensor picked up through each telescope. After processing the signal through software to filter out noise, they were able to reconstruct recordings of the sounds inside the room with remarkable fidelity: They showed, for instance, that they could reproduce an audible snippet of a speech from President Donald Trump well enough for it to be transcribed by Google&#39;s Cloud Speech API. They also generated a recording of the Beatles&#39; &#34;Let It Be&#34; clear enough that the name-that-tune app Shazam could instantly recognize it.\n The technique nonetheless has some limitations. In their tests, the researchers used a hanging bulb, and it&#39;s not clear if a bulb mounted in a fixed lamp or a ceiling fixture would vibrate enough to derive the same sort of audio signal. The voice and music recordings they used in their demonstrations were also louder than the average human conversation, with speakers turned to their maximum volume. But the team points out that they also used a relatively cheap electro-optical sensor and analog-to-digital converter, and could have upgraded to a more expensive one to pick up quieter conversations. LED bulbs also offer a signal-to-noise ratio that&#39;s about 6.3 times that of an incandescent bulb and 70 times a fluorescent one.\n  Regardless of those caveats, Stanford computer scientist and cryptographer Dan Boneh argues that the researchers&#39; technique still represents a significant and potentially practical new form of what he calls a &#34;side channel&#34; attack—one that takes advantage of unintended leakage of information to steal secrets. &#34;It&#39;s a beautiful application of side channels,&#34; Boneh says. &#34;Even if this requires a hanging bulb and high decibels, it’s still super interesting. And it’s still just the first time this has been shown to be possible. Attacks only get better, and future research will only improve this over time.&#34;\n The research team, which was advised by BGU&#39;s Yuval Elovici and Adi Shamir, the coinventor of the ubiquitous RSA encryption system, isn&#39;t the first to show that unexpected sonic phenomena can enable eavesdropping. Researchers have known for years that a laser bounced off a target&#39;s window can allow spies to pick up the sounds inside. Another group of researchers showed in 2014 that the  gyroscope of a compromised smartphone can pick up sounds even if the malware can&#39;t access its microphone. The closest previous technique to lamphone is what MIT, Microsoft, and Adobe researchers in 2014 called a  &#34;visual microphone&#34;: By analyzing video recorded via telescope of an object in a room that picks up vibrations—a bag of potato chips or a houseplant, for instance—those researchers were able to reconstruct speech and music.\n  But Nassi points out that the video-based technique, while far more versatile since it doesn&#39;t require a bulb to be visible in the room, requires analysis of the video with software after it&#39;s recorded to convert the subtle vibrations observed in an object into the sounds it picked up. Lamphone, by contrast, enables real-time spying. Since the vibrating object is itself a light source, the electro-optical sensor can pick up vibrations in far simpler visual data.\n That could make lamphone significantly more practical for use in espionage than previous techniques, Nassi argues. &#34;When you actually use it in real time you can respond in real time rather than losing the opportunity,&#34; he says.\n Still, Nassi says the researchers are publishing their findings not to enable spies or law enforcement, but to make clear to those on both sides of surveillance what&#39;s possible. &#34;We want to raise the awareness of this kind of attack vector,&#34; he says. &#34;We’re not in the game of providing tools.&#34;\n As unlikely as being targeted by this technique is, it&#39;s also easy to forestall. Just cover any hanging bulbs, or better yet, close the curtains. And if you&#39;re paranoid enough to be concerned about this sort of spy game, hopefully you&#39;ve already used  anti-vibration devices on those windows to prevent eavesdropping with a laser microphone. And  swept your house for bugs. And  removed the microphones from your phone and computer. After all, in an era when even the light bulbs have ears, a paranoiac&#39;s work is never done.", "posttime": "2020-06-14 03:28:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "通过观察,eavesdrop,灯泡", "title": "间谍可以通过观察灯泡的变化来窃听", "title_en": "Spies can eavesdrop by watching a light bulb’s variations", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/06/spies-can-eavesdrop-by-watching-a-light-bulbs-variations/", "via": "", "real_tags": ["通过观察", "eavesdrop", "灯泡"]}, {"category": "", "categoryclass": "", "imagename": "209edd200677092eaf0a9648fea8f95b.png", "infoid": 1006445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "直接从Windows在现有Windows安装的基础上或与之一起安装Linux，无需从闪存驱动器等外部介质引导，也不需要更改BIOS配置。\n自动重新启动并运行ubiquity安装程序(完全在RAM中，删除了到iso的挂载)。\n我们正在开发Windows7和8、MBR，并支持其他基于Debian/Ubuntu的Linux发行版。\n由于Tunic操作的性质，它可能会在某些恶意软件扫描中显示为误报。\n在开始之前，请确保备份整个磁盘的映像。Tunic无助于完整磁盘备份。有关详细信息，请阅读免责声明。\n如果您能够使用Tunic安装Linux，请在Success Stores中添加评论，或向作者发送消息。\n此软件可能会在不经意间永久破坏所有数据，使计算机无法启动，或以其他方式使计算机处于不良状态。此软件按原样提供，绝对没有任何担保。有关详细信息，请阅读GNU GPL版本3许可证的第15、16和17节。", "note_en": "Install Linux over or alongside an existing Windows install, straight from Windows,without requiring to boot from external media like a flash drive or making BIOS configuration changes.\n   Reboots and runs the Ubiquity installer, automated, (fully in RAM with mounts to the iso removed).\n     We are working on Windows 7 and 8, MBR, and support for other Debian/Ubuntu based Linux distros.\n  Due to the nature of what Tunic does, it may show up as a false positive on some malware scans.\n      Before you start, make sure to backup up an image of your entire disk(s).Tunic does not assist with full disk backup.Read disclaimer for more information.\n     If you were able to install Linux with Tunic, pleaseadd a comment to  Success Stores,or send a message  to the author.\n       This software could inadvertantly and permanently destroy all data, leave a computer unbootable,or otherwise leave a computer in an undesirable state.This software comes as-is with absolutely no warranty.Read sections  15, 16, and 17of the GNU GPL version 3 license for more information.", "posttime": "2020-06-14 03:12:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,linux,带电", "title": "从正在运行的Windows系统安装Linux，不需要带电的USB", "title_en": "Install Linux from a running Windows system, without need for a live USB", "transed": 1, "url": "https://github.com/mikeslattery/tunic", "via": "", "real_tags": ["windows", "linux", "带电"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西雅图警察局长卡门·贝斯特(Carmen Best)在周四下午的新闻发布会上承认，社民党实际上没有收到任何关于抗议者在国会山地区敲诈企业的报告-尽管她和她的助理警察局长迪安娜·诺莱特(Deanna Nollette)在昨天的新闻发布会上报告说，企业主被迫支付费用，才能在该辖区周围六个街区的区域内运营。他们今天早上重复了这些主张，进一步危及了抗议者的安全。他们今天承认，他们在社交媒体上听到了这些说法，并将其作为官方报告宣布。\n今天下午，当同一批当地企业主站出来否认这些指控，并愤怒地表达了他们对在这些危险的警察游戏中被用作棋子的厌恶时，警察局长被迫收回了他们的说法。", "note_en": "Seattle police chief Carmen Best admits in a news conference Thurs afternoon that the SPD had not in fact received a single report of protesters extorting businesses in the Capitol Hill area - though she and her assistant police chief Deanna Nollette had reported in a news conference yesterday that &#39;business owners were being forced to pay a fee to operate in a six-block area around the precinct&#39;. They repeated the claims this morning, further jeopardizing the protester&#39;s safety.  They admitted today they heard those claims on social media and announced them as official reports.\n The chief of police was forced to retract their claims this afternoon when the same local business owners came forward en masse to deny the allegations and furiously expressed their disgust at being used as pawns in these dangerous police games.", "posttime": "2020-06-14 03:11:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察局长,police", "title": "西雅图警察局长承认向公众提供国会山抗议者的瓦斯", "title_en": "Seattle Police Chief Admits Gaslighting the Public About Capitol Hill Protesters", "transed": 1, "url": "https://www.reddit.com/r/SeattleWA/comments/h7ecp2/seattle_police_chief_admits_gaslighting_the/", "via": "", "real_tags": ["警察局长", "police"]}, {"category": "", "categoryclass": "", "imagename": "63066f8f3b9c9d84a044ad854e401aef.jpeg", "infoid": 1006443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Brisk Voyage为我们的会员提供便宜的、最后一分钟的周末旅行。基本的想法是，我们不断地检查机票和酒店的价格，当我们发现一次旅行是低价的异常值时，我们会发送一封带有预订说明的电子邮件。\n为了找到机票和酒店价格，我们搜索了谷歌航班和谷歌酒店。酒店相对简单：要在100个目的地中找到最便宜的酒店，每个目的地超过5个不同的日期，我们必须总共抓取500个Google Hotels页面。\n削减机票价格是一个更大的挑战。要找到100个目的地的最便宜的往返航班，每个目的地有5个不同的日期，那就是500页。然而，航班不仅仅有目的地机场-它们也有始发机场。这500个航班必须从每个始发机场进行检查。我们必须检查从纽约市周围的每个机场到阿斯彭的航班，洛杉矶周围的每个机场，以及介于两者之间的每个机场。我们在打理酒店的时候没有这个额外的机场“维度”。这意味着与我们的问题相关的机票价格比酒店价格高出几个数量级。\n目标是找到给定日期组中每个始发地/目的地对之间最便宜的航班。为了做到这一点，我们每天从25,000个谷歌航班页面中收取大约300,000个航班价格。这不是一个天文数字，但它足够大，以至于我们(至少作为一家自力更生的公司)必须关心成本效益。在过去一年左右的时间里，我们反复使用我们的擦除方法，以得到一个相当健壮和灵活的解决方案。下面，我将描述我们在抓取堆栈中使用的每个工具，大致按数据流排序。\n我们使用SQS为要爬行的URL队列提供服务。谷歌航班网址如下：https://www.google.com/flights?hl=en#flt=BOS.JFK，lga，EWR.2020-11-13*jfk，lga，EWR.BOS.2020-11-16；c：USD；e：1；sd：1；t：f。\n上面URL中的三个字母代码是IATA机场代码。如果单击该链接，请注意有多个目的地机场。这是高效谷歌航班搜索的关键之一！由于谷歌航班允许一次搜索多个行程，我们可以在一个页面上获取多个往返行程的最便宜价格。谷歌有时不会显示查询到的所有行程的航班。为了确保我们拥有所需的所有数据，当结果中没有显示目的地/目的地时，我们会检测到，然后将行程重新排队，以便自己进行搜索。这确保了我们收集每次旅行可获得的最便宜航班的价格。\n单个SQS队列存储所有需要爬行的Google航班URL。当Crawler运行时，它将从队列中提取一条消息。顺序并不重要，因此使用标准队列(而不是FIFO)。下面是队列充满消息时的样子：\nLambda是爬行器实际运行的地方。我们使用Chalice，这是一个优秀的Python Lambda微框架，将函数部署到Lambda。虽然Serverless是最流行的Lambda框架，但它是用NodeJS编写的。考虑到我们最熟悉Python，并且希望保持堆栈的一致性，这对我们来说是一个障碍。我们对Chalice非常满意--它的使用就像使用Flask一样简单，而且它允许整个轻快的Voyage后端成为Lambda上的Python。\n主要的lambda函数从SQS队列摄取消息、爬行Google航班并存储输出。当此函数运行时，它在Lambda实例上启动Chrome浏览器并爬行页面。我们将其定义为具有Chalice的纯Lambda函数，因为此函数将单独触发：\n第二个Lambda函数触发第一个函数的多个实例。这可以并行运行我们需要的任意数量的爬行器。此功能定义为每天UTC时间15-22小时过后2分钟运行。它为50个并行爬网程序启动50个主爬网功能实例：\n@app.Schedule(“cron(2 15，16，17，18，19，20，21，22？*)”)def start_Crawler(Event)：app.log.info(“正在启动爬虫”)。n_Crawler=50 client=boto3.client(“lambda”)，范围内的n(N_Crawler)：Response=client.voke(FunctionName=“Collector-dev-Crawl”，InvocationType=“event”，Payload=‘{“Crawler_id”：’+str(N)+“}”，)app.log.info(“已启动的爬网程序。”)。\n另一种方法是将SQS队列用作爬网功能的事件源，这样当队列填充时，爬网程序会自动向上扩展。我们最初使用的是这种方法。然而，有一个很大的缺点：一次调用可以接收的最大消息数(批大小)是10，这意味着必须为每10条消息组新调用该函数。这不仅会导致计算效率低下，而且会大幅增加带宽，因为浏览器缓存在每次重新启动时都会被破坏。有一些方法可以绕过这个问题，但根据我们的经验，它们会导致很多额外的复杂性。\n关于Lambda成本的说明Lambda的价格是0.00001667美元/GB/秒，而许多ec2实例的成本是这个数字的六分之一。我们目前每月为Lambda支付约50美元，因此这将意味着我们可以大幅降低这些成本。然而，Lambda有两个很大的好处：第一，它可以立即向上和向下伸缩，我们不需要付出任何努力，这意味着我们永远不会为空闲的服务器买单。其次，它是我们堆栈的其余部分的基础。更少的技术意味着更少的认知开销。如果我们爬行的页面数量增加，重新考虑EC2或类似的计算服务将是有意义的。在这一点上，我认为每月额外支付40美元(Lambda为50美元，EC2为10美元)对我们来说是值得的。\nPyppeteer是一个Python库，用于与Puppeteer交互，Puppeteer是一个无头Chrome API。因为Google航班需要Javascript来加载价格，所以有必要实际呈现整个页面。这50个爬行功能中的每一个都启动了自己的无头Chrome浏览器副本，该浏览器由Pyppeteer控制。\n在Lambda上运行无头Chrome是一个挑战。我们必须将必要的库预先打包到Chalice中，而这些库并没有预先安装在运行Lambda的操作系统Amazon Linux上。这些库被添加到我们的Chalice项目内的供应商目录中，该目录告诉Chalice在每个Lambda爬网实例上安装它们：\n当50个爬行函数在~5秒内启动时，每个函数中都会启动Chrome实例。这是一个功能强大的系统；通过更改一行代码，它可以扩展到数千个并发Chrome实例。\nCrawl函数从SQS队列读取URL，然后Pyppeteer告诉Chrome导航到旋转的住宅代理后面的页面。住宅代理是必要的，以防止Google阻止Lambda发出请求的IP。加载并呈现页面后，可以提取呈现的HTML，并且可以从页面读取航班价格、航空公司和时间。每页有10-15个我们想要提取的航班结果(我们最关心的是最便宜的，但其他的也可以是有用的)。目前，这是通过遍历页面结构手动完成的，但这很脆弱。如果Google更改页面上的一个元素，爬行器可能会中断。将来，我想使用对页面结构的依赖程度较低的内容。\n一旦提取了价格，我们将删除SQS消息，并对航班结果中未显示的任何始发地/目的地重新排队。然后我们转到下一页-从队列中拉出一个新的URL，并重复该过程。在每个爬行实例中抓取第一个页面后，由于Chrome的缓存，页面需要加载的带宽要少得多(约100KB而不是3MB)。这意味着我们希望尽可能长时间地保持实例处于活动状态，并尽可能多地爬行，以便保留缓存。因为持久化函数来保留缓存是有利的，Crawl的超时是15分钟，这是AWS当前允许的最大值。\n从页面中提取数据后，我们必须存储航班数据。我们为此选择了DynamoDB，因为它具有按需伸缩功能。这对我们来说很重要，因为我们不确定需要什么样的货物。它也很便宜，根据AWS的免费级别，25 GB是免费的。\nDynamoDB已经做了一些工作来使其正确。通常情况下，表只能有一个具有一个排序关键字的主索引。添加二级索引是可能的，但要么是有限的，要么需要额外的资源调配，这会增加成本。由于索引的这一限制，如果事先充分考虑了用法，DynamoDB的工作效果最好。我们花了几次时间才把桌子的设计做好。回想起来，DynamoDB对于我们正在构建的产品类型来说有点僵化。既然Aurora Serverless提供了PostgreSQL，那么我们在某个时候切换到它可能是明智的。\n无论如何，我们都将所有航班数据存储在一个表中。该索引具有目的地机场的IATA代码的主键和作为ULID的次要范围键。\nULID对于DyanmoDB非常有用，因为它们是惟一的，具有嵌入的时间戳，并且可以按该时间戳按字典顺序排序。这使得范围键既可以作为唯一标识符，又可以支持诸如“给我过去30分钟内爬过的最便宜的床上行程”之类的查询：\n我们使用Dashbird来监视爬行器和在Lambda下运行的其他一切。良好的监控是抓取应用程序的要求，因为页面结构更改是一个持续的危险。在任何时候(就像我们最近在谷歌航班上看到的那样，甚至一天多次)，页面结构都可能改变，这会破坏爬虫。当这种情况发生时，我们需要得到警告。我们有两种不同的机制来跟踪这一点：\n每3小时运行一次的GitHub Action，运行一次测试爬网并验证结果是否有意义。因为爬虫并不总是在运行，所以当谷歌航班在运营时间之外改变页面结构时，它会向我们发出警报。这样，爬行器可以在当天开始之前修复。\nSQS、Lambda、Chalice、Pyppeteer、DynamoDB、Dashbird和GitHub操作的组合非常适合我们。这是一个完全使用Python的低开销解决方案，不需要提供实例，并且保持相对较低的成本。\n虽然我们对我们目前每天大约30万个价格和25K个页面的规模感到满意，但随着我们数据需求的增长，还有一些改进的空间：\n首先，明智的做法是将Crawler移动到EC2服务器，这些服务器在需要时会自动提供。随着计算爬网需求的增加，Lambda和EC2成本之间的增量将增加到在EC2上运行有意义的程度。EC2在计算方面的成本大约是Lambda的五分之一，但需要更多的开销，而且不会降低带宽成本。\n其次，我们将从DynamoDB迁移到无服务器Aurora，这允许更灵活的数据使用。随着我们的价格库和对替代数据用途的胃口的增长，这将是有用的。\n如果您觉得这很有趣，您可能会喜欢轻快旅行-我们的免费时事通讯每隔几天就会从您附近的机场向您发送一次廉价的周末旅行。如果您喜欢这项服务，我们还有一个高级版，它将为您提供更多的行程，并且有更多的功能。\n当然，有很多方法可以改进这个系统。如果你有什么想法，请告诉我们！", "note_en": "Brisk Voyage finds cheap, last-minute weekend trips for our members. The basic idea is that we continuously check a bunch of flight and hotel prices, and when we find a trip that’s a low-priced outlier, we send an email with booking instructions.\n  To find flight and hotel prices, we scrape Google Flights and Google Hotels. Hotels are relatively simple: to find the cheapest hotel at 100 destinations over 5 different dates each, we have to scrape 500 Google Hotels pages total.\n Scraping flight prices is a larger challenge. To find the cheapest round-trip flight for 100 destinations over 5 different dates each, that’s 500 pages. Flights, however, don’t just have a destination airport — they also have an origin airport. Those 500 flights have to be checked from  each origin airport. We have to check those flights to Aspen from every airport around NYC, every airport around Los Angeles, and every airport in between. We don’t have this extra origin airport “dimension” when scraping hotels. This means there are several orders of magnitude more flight prices than hotel prices relevant to our problem.\n   The goal is to find the cheapest flight between each origin/destination pair for a given set of dates. To do this, we fetch around 300,000 flight prices from 25,000 Google Flights pages every day. This isn’t an astronomical number, but it’s large enough that we (at least, as a bootstrapped company) have to care about cost efficiency. Over the past year or so, we’ve iterated on our scraping methodology to arrive at a fairly robust and flexible solution. Below, I’ll describe each tool we use in our scraping stack, roughly ordered by the flow of data.\n  We use  SQS to serve a queue of URLs to crawl. Google Flights URLs look like this:  https://www.google.com/flights?hl=en#flt=BOS.JFK,LGA,EWR.2020-11-13*JFK,LGA,EWR.BOS.2020-11-16;c:USD;e:1;sd:1;t:f.\n The three-letter codes in the URL above are  IATA airport codes. If you click that link, notice how there are multiple destination airports. This is one key to efficient Google Flights scraping! Since Google Flights allows for multiple trips to be searched at once, we can fetch the cheapest prices for multiple round-trips on one page. Google sometimes won’t show flights for all trips queried. To make sure we have all the data we need, we detect when an origin/destination isn’t displayed in the result, then re-queue the trip to be searched on its own. This ensures we collect the price of the cheapest flight available for each trip.\n A single SQS queue stores all Google Flights URLs that need to be crawled. When the crawler runs, it will pick off a message from the queue. Order is not important, so a  standard queue (not a FIFO) is used. Here’s what the queue looks like when it’s full of messages:\n   Lambda is where the crawler actually runs. We use  Chalice, which is an excellent Lambda microframework for Python, to deploy functions to Lambda. Although  Serverless is the most popular Lambda framework, it is written in NodeJS. This is a turn-off for us given that we’re most familiar with Python, and want to keep our stack uniform. We’ve been very happy with Chalice — it’s as simple as Flask to use, and it allows the entire Brisk Voyage backend to be Python on Lambda.\n  The primary Lambda function ingests messages from the SQS queue, crawls Google Flights, and stores the output. When this function runs, it launches a Chrome browser on the Lambda instance and crawls the page. We define this as a pure Lambda function with Chalice, as this function will be separately triggered:\n  The second Lambda function triggers multiple instances of the first function. This runs as many crawlers as we need in parallel. This function is defined to run at two minutes past the hour during UTC hours 15–22 every day. It starts 50 instances of the primary  crawl function, for 50 parallel crawlers:\n @app.schedule(“cron(2 15,16,17,18,19,20,21,22 ? * * *)”) def start_crawlers(event):  app.log.info(“Starting crawlers.”)  n_crawlers = 50  client = boto3.client(“lambda”)  for n in range(n_crawlers):  response = client.invoke(  FunctionName=”collector-dev-crawl”,  InvocationType=”Event”,  Payload=’{“crawler_id”: ‘ + str(n) + “}”,  )  app.log.info(“Started crawlers.”)\n An alternative would be to use the SQS queue as an event source for the  crawl function, so that when the queue populates, the crawlers automatically scale up. We originally used this approach. There is one big drawback, however: the maximum number of messages that can be ingested by one invocation (batch size) is 10, meaning that the function has to be freshly invoked for every group of 10 messages. This not only causes compute inefficiency, but increases bandwidth drastically as the browser cache is destroyed every time the function restarts. There are ways around this, but in our experience, they have lead lots of extra complexity.\n A note on Lambda costs Lambda costs $0.00001667/GB/second, while many EC2 instances cost  one-sixth of that. We currently pay around $50/month for Lambda, so this would mean we could substantially reduce these costs. Lambda, however, has two big benefits: first, it scales up and down instantly with zero effort on our part, meaning we are not ever paying for an idling server. Second, it’s what the rest of our stack is built on. Less technology means less cognitive overhead. If the number of pages we crawl ramps up, it will make sense to reconsidering EC2 or a similar compute service. At this point, I think an extra $40 per month ($50 on Lambda vs ~$10 on EC2) is worth the simplicity for us.\n  Pyppeteer is a Python library for interacting with  Puppeteer, a headless Chrome API. Since Google Flights requires Javascript to load prices, it is necessary to actually render the full page. Each of the 50  crawl functions launches its own copy of a headless Chrome browser, which is controlled with Pyppeteer.\n Running headless Chrome on Lambda was a challenge. We had to pre-package the necessary libraries into Chalice that were not pre-installed on Amazon Linux, the OS that Lambda runs on top of. These libraries are added to the  vendor directory inside our Chalice project which tells Chalice to install them on each Lambda  crawl instance:\n  As the 50  crawl functions start up over ~5 seconds, Chrome instances are launched within each function. This is a powerful system; it can scale into thousands of concurrent Chrome instances by changing one line of code.\n The  crawl function reads a URL from the SQS queue, then Pyppeteer tells Chrome to navigate to that page behind a rotating residential proxy. The residential proxy is necessary to prevent Google from blocking the IP Lambda makes requests from. Once the page loads and renders, the rendered HTML can be extracted, and the flight prices, airlines, and times can be read from the page. There are 10–15 flight results per page that we want to extract (we mostly care about the cheapest, but the others can be useful too). This is currently done manually by traversing the page structure, but this is brittle. The crawler can break if Google changes one element on the page. In the future, I’d like to use something that’s less reliant on the page structure.\n Once the prices are extracted, we delete the SQS message, and re-queue any origin/destinations that weren’t displayed within the flight results. We then move onto the next page — a new URL is pulled from the queue, and the process repeats. After the first page crawled in each  crawl instance, pages require much less bandwidth to load (~100kb instead of 3 MB) due to Chrome’s caching. This means that we want to keep the instance alive as long as possible, and crawl as many trips as we can in order to preserve the cache. Because it’s advantageous to persist functions to retain the cache,  crawl‘s timeout is 15 minutes, which is the maximum that AWS currently allows.\n  After it’s extracted from the page, we have to store the flight data. We chose  DynamoDB for this because it has on-demand scaling. This was important for us, as we were uncertain about what kinds of loads we would need. It’s also cheap, and 25GB comes free under  AWS’s Free Tier.\n DynamoDB has taken some work to get right. Normally, tables can only have one primary index with one sort key. Adding secondary indices is possible, but is either limited or requires additional provisioning, which increases costs. Due to this limitation on indices, DynamoDB works best when the usage is fully thought-out beforehand. It took us a couple tries to get the table design right. In retrospect, DynamoDB is a little inflexible for the kind of product we’re building. Now that  Aurora Serverless offers PostgreSQL, it may be wise for us to switch to that at some point.\n Regardless, we store all of our flight data in a single table. The index has a primary key of the destination airport’s IATA code, and a secondary range key which is a  ULID.\n  ULIDs are great for DyanmoDB because they are unique, have an embedded timestamp, and are lexicographically sortable by that timestamp. This allows the range key to both serve as a unique identifier and support queries such as “give me the cheapest trips to BED that we’ve crawled in the past 30 minutes”:\n   We use  Dashbird for monitoring the crawler and everything else that’s run under Lambda. Good monitoring is a requirement for scraping applications because page structure changes are a constant danger. At any time (even multiple times per day, as we’ve seen with Google Flights recently) the page structure can change, which breaks the crawler. We need to be alerted when this occurs. We have two separate mechanisms to track this:\n A  GitHub Action that runs every 3 hours that runs a test crawl and verifies the results make sense. Since that crawler isn’t always running, this alerts us when Google Flights changes their page structure outside of operating hours. This way, the crawler can be fixed prior to starting for the day.\n  The combination of SQS, Lambda, Chalice, Pyppeteer, DynamoDB, Dashbird, and GitHub Actions works well for us. It is a low-overhead solution that is entirely Python, requires no instance provisioning, and keeps costs relatively low.\n While we’re satisfied with this at our current scale of roughly 300k prices and 25k pages per day, there is some room for improvement as our data needs grow:\n First, it may be wise to move the crawler to EC2 servers that are automatically provisioned when needed. As compute crawl requirements increase, the delta between Lambda and EC2 costs will increase to the point where it will make sense to run on EC2. EC2 will cost roughly 1/5th of Lambda in terms of compute, but will require more overhead and won’t reduce bandwidth costs.\n Second, we would move from DynamoDB to Serverless Aurora, which allows for more flexible data usage. This will be useful as our library of prices and the appetite for alternative data uses grow.\n If you found this interesting, you might like  Brisk Voyage — our free newsletter sends you a cheap weekend trip every few days from airports near you. If you like the service, we’ve also got a Premium version which will send you more trips and has a few more features.\n There are, of course, ways this system can be improved. If you’ve got any ideas, please let us know!", "posttime": "2020-06-14 02:37:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,day,lambda", "title": "我们每天从谷歌航班上砍掉30万美元的价格。", "title_en": "We scrape 300k prices per day from Google Flights", "transed": 1, "url": "https://medium.com/brisk-voyage/how-we-scrape-300k-flight-prices-per-day-from-google-flights-79f5ddbdc4c0", "via": "", "real_tags": ["谷歌", "google", "day", "lambda"]}, {"category": "", "categoryclass": "", "imagename": "00c30de4972b91a968a32ded48e36f7a.png", "infoid": 1006440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SageMath是一个基于GPL许可的免费开源数学软件系统。它建立在许多现有开源软件包之上：NumPy、SciPy、matplotlib、Sympy、Maxima、GAP、Flint、R等等。通过基于Python的通用语言或直接通过接口或包装器访问它们的组合功能。\n从2020年1月发布的9.0版本开始，SageMath就开始使用Python3。有关更多信息，请参阅Python3 Switch wiki。", "note_en": "SageMath is a free  open-source mathematics software system licensed under the GPL.It builds on top of many existing open-source packages: NumPy,  SciPy,  matplotlib, Sympy,  Maxima,  GAP,  FLINT,  R and many more.Access their combined power through a common, Python-based languageor directly via interfaces or wrappers.\n    Since version 9.0 released in January 2020, SageMath is using  Python 3.  For more information, see the  Python 3 switch wiki.", "posttime": "2020-06-14 02:19:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,免费,开源,free", "title": "SageMath是一个免费的开源数学软件系统", "title_en": "SageMath is a free open-source mathematics software system", "transed": 1, "url": "https://www.sagemath.org/", "via": "", "real_tags": ["软件", "免费", "开源", "free"]}, {"category": "", "categoryclass": "", "imagename": "b3b21343e2b3dbbaca644e484761c513.png", "infoid": 1006439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "David John Pleasance正在为Kickstarter上的从秃鹫到吸血鬼！25年的版权混乱和技术胜利筹集资金", "note_en": "David John Pleasance is raising funds for From Vultures to Vampires on Kickstarter!  25 years of Copyright Chaos and Technology Triumphs", "posttime": "2020-06-14 02:02:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图书,amiga,胜利", "title": "Amiga图书众筹：25年的版权混乱和技术胜利", "title_en": "Crowdfunding for Amiga Book: 25 Years of Copyright Chaos and Technology Triumphs", "transed": 1, "url": "https://www.kickstarter.com/projects/469255657/from-vultures-to-vampires", "via": "", "real_tags": ["图书", "amiga", "胜利"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这本书是任何认真对待实时渲染的人的必备读物。随着新的光线跟踪API和支持它们的硬件的发布，开发人员可以轻松地创建以光线跟踪为核心组件的实时应用程序。随着GPU上的光线跟踪变得更快，它将在实时渲染中发挥更核心的作用。光线跟踪宝石为游戏、架构应用程序、可视化等的开发人员提供了关键的构建块。渲染专家分享他们的知识，通过解释一切，从将改进任何光线跟踪器的实际技术到掌握当前和未来硬件的新功能。\n希望利用最新API和GPU技术进行实时渲染和光线跟踪的开发人员", "note_en": "This book is a must-have for anyone serious about rendering in real time. With the announcement of new ray tracing APIs and hardware to support them, developers can easily create real-time applications with ray tracing as a core component. As ray tracing on the GPU becomes faster, it will play a more central role in real-time rendering.  Ray Tracing Gems provides key building blocks for developers of games, architectural applications, visualizations, and more. Experts in rendering share their knowledge by explaining everything from nitty-gritty techniques that will improve any ray tracer to mastery of the new capabilities of current and future hardware.\n      Developers who are looking to leverage the latest APIs and GPU technology for real-time rendering and ray tracing", "posttime": "2020-06-14 02:02:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "追踪,tracing,跟踪", "title": "光线追踪珍品(开放存取教科书)", "title_en": "Ray Tracing Gems (Open Access Textbook)", "transed": 1, "url": "https://link.springer.com/book/10.1007/978-1-4842-4427-2", "via": "", "real_tags": ["追踪", "tracing", "跟踪"]}, {"category": "", "categoryclass": "", "imagename": "792ee759383fafa218c90779e25f8765.jpg", "infoid": 1006436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“华尔街日报”报道，欧盟将就亚马逊使用第三方卖家数据一事对其提出正式的反垄断指控。这些指控最快可能在下周提起，据报道，这些指控将指控亚马逊使用从其市场上的卖家那里收集的数据与他们竞争。\n在欧盟提出指控后，华尔街日报报道称，预计欧盟委员会还需要一年时间才能正式决定亚马逊是否违法。尽管该公司可能会在法庭上挑战这一决定，但最终可能会被处以高达其年收入10%的罚款。\n欧盟对这一做法的调查被认为可以追溯到近两年前。早在2018年9月，欧盟竞争局局长玛格丽特·维斯特格(Margrethe Vestager)就表示，欧盟一直在收集有关亚马逊对第三方卖家做法的信息，但她当时强调，尚未启动正式调查。去年，欧盟(EU)对亚马逊与其市场卖家之间的协议，以及亚马逊如何使用数据选择链接到使用其网站上的“Buy Box”的零售商展开了正式的反垄断调查。\n这将不是亚马逊第一次被指控利用其作为市场运营商的地位，作为市场内的卖家谋取利益。今年早些时候，华尔街日报报道称，亚马逊的员工将使用独立Marketplace卖家的销售数据来帮助开发亚马逊的自有品牌产品。据说，尽管公司有禁止这样做的规定，但这种情况还是发生了。\n亚马逊承诺将展开内部调查作为回应，但这份报告引发了美国议员的新一轮审查。众议院司法委员会的民主党人写信给该公司，要求其澄清其数据政策，因为该公司此前曾声称不会使用个人卖家数据在其平台上与他们直接竞争。共和党参议员乔希·霍利(Josh Hawley)呼吁对该公司进行刑事反垄断调查。", "note_en": "The European Union is set to file formal antitrust charges against Amazon over its use of third-party seller data,   The Wall Street Journal reports. The charges, which could be filed as soon as next week, will reportedly accuse Amazon of using data gathered from sellers on its marketplace to compete against them.\n After the EU’s charges are filed,  The Wall Street Journal reports that it’s expected to be another year before the commission formally decides whether Amazon broke the law. Although the company could challenge the decision in court, it could eventually be fined as much as 10 percent of its annual revenue.\n  The EU’s investigation into the practice is thought to go back almost two years.  Back in September 2018, the head of the EU’s competition bureau, Margrethe Vestager, said that the EU had been gathering information on Amazon’s practices toward third-party sellers, but she stressed at the time that a formal investigation had yet to be launched. Last year, the  EU launched a formal antitrust investigation into the agreements between Amazon and its marketplace sellers as well as how it uses data to select which retailer to link to using the “Buy Box” on its site.\n This would not be the first time Amazon has been accused of using its position as an operator of a marketplace to benefit itself as a seller within it. Earlier this year,  The Wall Street Journal reported that Amazon’s employees would  use sales data from independent Marketplace sellers to help with the development of Amazon’s own-branded products. This was said to have happened despite the company having rules that forbid it.\n Amazon promised to launch an internal investigation in response, but the report generated renewed scrutiny from US lawmakers. Democrats on the House Judiciary Committee wrote to the company to ask it to clarify its data policies since it had previously claimed to not use individual seller data to directly compete with them on its platform.  Sen. Josh Hawley (R-MO) called for a criminal antitrust probe into the company.", "posttime": "2020-06-14 02:01:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,rust,反垄断,reportedly", "title": "据报道，亚马逊因使用第三方卖家数据而面临欧盟反垄断指控", "title_en": "Amazon reportedly faces EU antitrust charges over use of third-party seller data", "transed": 1, "url": "https://www.theverge.com/2020/6/11/21287672/amazon-european-union-antitrust-charges-third-party-seller-data", "via": "", "real_tags": ["亚马逊", "amazon", "rust", "反垄断"]}, {"category": "", "categoryclass": "", "imagename": "0afa365aa6fefea5db5b7c52877985b4.jpg", "infoid": 1006434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SQLite是世界上部署最多的软件之一。然而，从安全的角度来看，它只是通过WebSQL和浏览器利用的狭隘视角来检查的。我们相信这只是冰山一角。在我们的长期研究中，我们在SQLite中试验了利用内存损坏问题，而不依赖于SQL语言以外的任何环境。使用我们的查询劫持和面向查询编程的创新技术，我们证明了可靠地利用SQLite引擎中的内存损坏问题是可能的。我们将通过几个真实场景演示这些技术：使用密码窃取的后端服务器，以及使用更高的权限实现IOS持久化。\n每个人都知道，从黑客的角度来看，数据库是王冠上的宝石，但是如果你可以把数据库作为黑客工具本身使用呢？我们发现，简单地查询恶意SQLite数据库就可能导致远程代码执行。我们使用未记录的SQLite3行为和内存损坏漏洞来利用查询数据库是安全的这一假设。\n多么?。我们创建了一个恶意的SQLite数据库，该数据库利用了用于打开它的软件。仅探讨了其中的几种可能性，我们将在窃取密码的后端解析凭据文件并通过替换其联系人数据库…来实现IOS持久化。\n风景是无穷无尽的(提示：是不是有人说Windows100是0天？)。这非常可怕，因为SQLite3现在实际上内置于任何现代系统中。\n在我们的演讲中，我们还讨论了SQLite内部机制以及我们滥用它们的新方法。我们必须发明我们自己的ROP链技术，只使用SQL CREATE语句。我们对堆喷射和SELECT子查询使用了JOIN语句，对x64指针解包和算术使用了JOIN语句。这是一个使用熟悉的结构化查询语言来利用原语的新领域，为通用地利用数据库引擎中的内存损坏问题奠定了基础。", "note_en": "SQLite is one of the most deployed software in the world. However, from a security perspective, it has only been examined through the narrow lens of WebSQL and browser exploitation. We believe that this is just the tip of the iceberg. In our long term research, we experimented with the exploitation of memory corruption issues within SQLite without relying on any environment other than the SQL language. Using our innovative techniques of Query Hijacking and Query Oriented Programming, we proved it is possible to reliably exploit memory corruptions issues in the SQLite engine. We demonstrate these techniques a couple of real-world scenarios: pwning a password stealer backend server, and achieving iOS persistency with higher privileges.\n Everyone knows that databases are the crown jewels from a hacker&#39;s point of view, but what if you could use a database as the hacking tool itself? We discovered that simply querying a malicious SQLite database - can lead to Remote Code Execution. We used undocumented SQLite3 behavior and memory corruption vulnerabilities to take advantage of the assumption that querying a database is safe.\n How? We created a rogue SQLite database that exploits the software used to open it.Exploring only a few of the possibilities this presents we’ll pwn password stealer backends while they parse credentials files and achieve iOS persistency by replacing its Contacts database…\n The landscape is endless (Hint: Did someone say Windows 10 0-day?). This is extremely terrifying since SQLite3 is now practically built-in to any modern system.\n In our talk we also discuss the SQLite internals and our novel approach for abusing them. We had to invent our own ROP chain technique using nothing but SQL CREATE statements. We used JOIN statements for Heap Spray and SELECT subqueries for x64 pointer unpacking and arithmetics. It&#39;s a new world of using the familiar Structured Query Language for exploitation primitives,laying the foundations for a generic leverage of memory corruption issues in database engines.", "posttime": "2020-06-14 01:12:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,code,利用", "title": "使用SQLite从*选择Code_Execution From*；", "title_en": "Select Code_execution from * Using SQLite;", "transed": 1, "url": "https://media.ccc.de/v/36c3-10701-select_code_execution_from_using_sqlite", "via": "", "real_tags": ["sqlite", "code", "利用"]}, {"category": "", "categoryclass": "", "imagename": "61841ab7d259dcd454c4eb4658f1103a.jpg", "infoid": 1006433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "玩具模特东田忠志，剑桥大学三位一体会堂数学系主任；哈佛大学https://www.radcl.雷德克里夫研究员", "note_en": "Toy Models Tadashi Tokieda, Director of Studies in Mathematics, Trinity Hall, University of Cambridge; Radcliffe Fellow, Harvard University https://www.radcl...", "posttime": "2020-06-14 01:11:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经典力学,models,https", "title": "探索经典力学的玩具模型-东京田忠志(IAS 2014)", "title_en": "Toy Models to explore the classical mechanics – Tadashi Tokieda (IAS 2014)", "transed": 1, "url": "https://youtu.be/2v3ANzWkPVI", "via": "", "real_tags": ["经典力学", "models", "https"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006431, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Crusoe是由Transmeta开发并于2000年推出的x86兼容微处理器系列。Crusoe以其实现x86兼容性的方法而闻名。Crusoe运行软件抽象层或虚拟机，称为代码变形软件(CMS)，而不是在硬件中实现或由专门硬件转换的指令集体系结构。CMS将从程序接收的机器代码指令翻译成用于微处理器的本机指令。通过这种方式，Crusoe可以仿真其他指令集体系结构(ISA)。\n这用于允许微处理器模拟Intel x86指令集。从理论上讲，可以对CMS进行修改以模仿其他ISA。Transmeta演示了Crusoe通过将字节码转换为其本机指令集中的指令来执行Java字节码。在x86指令流和硬件之间添加抽象层意味着，只需修改CMS，就可以在不破坏兼容性的情况下更改硬件体系结构。例如，Transmeta Efficeon-第二代Transmeta设计-拥有256位宽的VLIW内核，而Crusoe的内核为128位。\nCrusoe在软件中执行一些传统上在硬件中实现的功能(例如，指令重新排序)，从而使硬件更简单，晶体管更少。硬件的相对简单意味着Crusoe比以相同频率运行的其他x86兼容微处理器消耗更少的电力(因此产生的热量更少)。\n700兆赫的克鲁索以500兆赫奔腾III x86处理器的速度运行x86程序，[1]尽管克鲁索处理器比相应的英特尔处理器更小、更便宜。[1]。\nCrusoe有两个内核：用于嵌入式应用的TM3200和用于低功耗个人计算的TM5400。两者都基于相同的架构，但在时钟频率和外设支持方面有所不同。\nTM3200的时钟频率为333-400兆赫。它有一个64兆KB的指令高速缓存，一个32兆KB的数据高速缓存，没有二级高速缓存。TM3200具有仅支持SDRAM和PCI接口的集成内存控制器。它的尺寸为77伏，使用1.5伏的电源，功耗低于1.5瓦(典型)。\nTM5400的时钟频率为500-800兆赫。与TM3200不同，TM5400拥有长期节能技术。它有一个64兆KB的指令高速缓存、一个64兆KB的数据高速缓存和一个256兆KB的统一二级高速缓存。集成内存控制器支持SDRAM和DDR SDRAM。它还具有PCI接口。它的尺寸为73µm²，使用1.10伏1.6F伏的电源，通常功耗为0.5-1.5瓦，最大功耗为6瓦。\n由于Transmeta是一家无厂房的半导体公司，也就是说，他们没有设施来制造他们的设计，这两家公司都是由国际商业机器公司(IBM)的半导体业务IBM MicroElectronics制造的。IBM采用0.18µm CMOS工艺制造了Crusoe，并采用了五级铜互连。\nCrusoe是一种VLIW微处理器，它执行一捆捆的指令，Transmeta称之为分子。每个分子包含多个指令，称为原子。代码变形软件将x86指令转换为本机指令。本机指令为32位长。满足一组条件的指令可以同时执行，并被组合成分别包含两个或四个原子的64位或128位分子。在没有足够的指令填充分子的情况下，软件会插入NOP作为填充物来填充空隙。这在所有VLIW架构中都是必需的，并且被批评为效率低下，这就是为什么有两个不同长度的分子的原因。\n新一代处理器Transmeta Crusoe提供多种工作模式。频率范围和动态电压提供300兆赫-1.20伏、400兆赫-1.23伏、500兆赫-1.35伏、600兆赫-1.53伏、700兆赫-1.75伏、800兆赫-2.00伏、900兆赫-2.35兆赫、1000兆赫-2.80伏。对于最佳或最小负载，相应的频率和电压会改变。\n东芝唱片库L1、L2、L3、L3阿迪达斯版和L5(L1-L3 600兆赫兹，L5 800兆赫兹)。\n^a b Kanellos，Michael；Konrad，Rachel(2001年11月5日)。Transmeta：筹码降下来了吗？CNet.", "note_en": "Jump to navigation  Jump to search  The  Crusoe is a family of  x86-compatible  microprocessors developed by  Transmeta and introduced in 2000. Crusoe was notable for its method of achieving x86 compatibility. Instead of the instruction set architecture being implemented in hardware, or translated by specialized hardware, the Crusoe runs a software abstraction layer, or a  virtual machine, known as the  Code Morphing Software (CMS). The CMS translates  machine code instructions received from programs into native instructions for the microprocessor. In this way, the Crusoe can  emulate other  instruction set architectures (ISAs).\n This is used to allow the microprocessors to emulate the Intel  x86 instruction set. In theory, it is possible for the CMS to be modified to emulate other ISAs. Transmeta demonstrated Crusoe executing  Java bytecode by translating the bytecodes into instructions in its native instruction set. The addition of an abstraction layer between the x86 instruction stream and the hardware means that the hardware architecture can change without breaking compatibility, just by modifying the CMS. For example,  Transmeta Efficeon — a second-generation Transmeta design — has a 256-bit-wide  VLIW core versus the 128-bit core of the Crusoe.\n Crusoe performs in software some of the functionality traditionally implemented in hardware (e.g. instruction re-ordering), resulting in simpler hardware with fewer  transistors. The relative simplicity of the hardware means that Crusoe consumes less power (and therefore generates less heat) than other x86-compatible microprocessors running at the same frequency.\n A 700 MHz Crusoe ran x86 programs at the speed of a 500 MHz Pentium III x86 processor,  [1] although the Crusoe processor was smaller and cheaper than the corresponding Intel processor.  [1]\n    The Crusoe was available in two cores: the TM3200 for embedded applications and the TM5400 for low-power personal computing. Both were based on the same architecture but differed in clock frequency and peripheral support.\n The TM3200 operated at clock frequencies of 333–400 MHz. It has a 64 KB instruction cache, a 32 KB data cache and no L2 cache. The TM3200 has an integrated  memory controller supports only  SDRAM and a  PCI interface. It measures 77 mm² and uses a 1.5 V power supply, dissipating less than 1.5 W of power (typical).\n The TM5400 operated at clock frequencies of 500–800 MHz. Unlike the TM3200, the TM5400 has LongRun power reduction technology. It has a 64 KB instruction cache, a 64 KB data cache and a 256 KB unified L2 cache. The integrated memory controller supports both SDRAM and DDR SDRAM. It also has a PCI interface. It measures 73 mm² and uses a 1.10 V 1.6f V power supply, dissipating 0.5–1.5 W typically and a maximum of 6 W.\n As Transmeta was a fabless semiconductor company, that is, they did not have the facilities to fabricate their designs, both were fabricated by IBM Microelectronics, the semiconductor business of  International Business Machines (IBM). IBM fabricated the Crusoe in a 0.18 µm CMOS process with five levels of  copper interconnect.\n The Crusoe is a  VLIW microprocessor that executes bundles of instructions, termed  molecules by Transmeta. Each  molecule contains multiple instructions, termed  atoms. The Code Morphing Software translates x86 instructions into native instructions. The native instructions are 32 bits long. Instructions that meet a set of conditions can be executed simultaneously and are combined to form a 64- or 128-bit  molecule containing two or four  atoms, respectively. In the event that there are not enough instructions to fill a molecule, the software inserts  NOPs as padding to fill out empty slots. This is required in all VLIW architectures and is criticised for being inefficient, which is why there are  molecules of two separate lengths.\n Transmeta Crusoe, new generation processor provide variable operating modes. Due to dynamic core they vary voltage and frequency dynamically under dynamic load.Frequency range and dynamic voltage provides for 300 MHz-1.20 V, 400 MHz-1.23 V, 500 MHz-1.35 V,600 MHz-1.53 V,700 MHz-1.75 V, 800 MHz-2.00 V, 900 MHz-2.35, 1000 MHz- 2.80 V. They can vary these ranges depending upon the load. For optimum or minimum load the respective frequencies and voltages get changed.\n  Toshiba Libretto L1, L2, L3, L3 Adidas Edition and L5 (L1–L3 at 600 MHz and L5 at 800 MHz)\n  ^     a     b   Kanellos, Michael; Konrad, Rachel (November 5, 2001).  &#34;Transmeta: Are the chips down?&#34;.  CNET.", "posttime": "2020-06-14 00:37:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漂流记,transmeta,指令", "title": "“超度漂流记”(Transmeta Crusoe)", "title_en": "Transmeta Crusoe", "transed": 1, "url": "https://en.wikipedia.org/wiki/Transmeta_Crusoe", "via": "", "real_tags": ["漂流记", "transmeta", "指令"]}, {"category": "", "categoryclass": "", "imagename": "a9f884e2d9c8d4bb9dfdc7111ce7a211.jpg", "infoid": 1006429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Axios获悉，Facebook一直在聘请经验丰富的科技投资者，帮助其实验应用团队领导一个新的数百万美元的投资基金。\n重要原因：启动一个针对初创公司的正式投资计划可以增强公司在下一个大型社交应用程序变大之前发现它的能力。鉴于反垄断审查可能已经在不久的将来关闭了Facebook进行大型收购的大门，这种可见性变得更加重要。\n细节：Facebook最近发布了一个职位空缺，称正在为其新产品实验(NPE)团队招聘一名投资主管，最好是拥有10年技术经验的人。\nFacebook在现已删除的招聘帖子中表示，在这个职位上，你将管理一只数百万美元的基金，与顶级风险投资公司和天使投资者一起投资于领先的私人公司。你将开发投资和影响论文，领导新投资的执行，并根据需要支持现有的投资组合公司。\nFacebook向Axios证实，它已经聘请了某人来填补这一职位，但拒绝透露此人的姓名，也拒绝透露该基金的规模。帮助管理这只新基金的还有沙比·里兹维(Shabih Rizvi)，他是谷歌(Google)和凯鹏华盈(Kleiner Perkins)的资深人士，最近就职于Gradient Ventures，这是谷歌母公司Alphabet旗下的企业风险投资公司之一。\n言外之意：一位熟悉该公司计划的消息人士表示，这一努力不是一项通用基金，而是一项与初创企业世界保持密切联系的有针对性的努力。Facebook将这一努力描述为其过去通过创业加速器和黑客马拉松所做工作的延伸。\nFacebook在给Axios的一份声明中表示，本着新产品试验(NPE)小组负责产品试验的精神，该团队也在试验支持外部初创企业的方法，包括提供资金。\nFacebook的企业开发团队已经对公司进行了投资，比如它最近斥资57亿美元入股印度Jio平台，但这是一项单独的努力，专注于初创公司的少量股权。\nNPE于去年夏天首次推出，由Facebook资深高管Ime Archibong领导。新的投资主管将向Archibong汇报工作。\n据报道，该部门一直在开发一系列应用程序，从以青少年为重点的听音乐应用程序，到播客和旅游应用程序。它也是Facebook收购的一些公司的创始人的所在地，比如TBH和MSQRD，这可能是让他们留在公司从事更具试验性和趣味性工作的一种方式。\n大局：Facebook长期以来一直试图识别社交媒体的下一个大事件，要么像收购Instagram和WhatsApp那样收购先驱，要么像Snapchat那样匹配关键功能(众所周知，Snapchat拒绝了Facebook 30亿美元的收购要约)。\n现在，考虑到Facebook受到严格的反垄断审查，再次大规模收购社交网络竞争对手即使不是不可能，也将是困难的。这给Facebook带来了额外的压力，要求他们寻找其他方法，在新兴趋势和后起之秀成为重大威胁之前识别它们。\nFacebook使用了许多技术来识别人们正在使用的新兴应用程序。\n2013年，它收购了一家名为Onavo的公司，该公司将追踪应用程序作为其VPN的一部分。2018年，在苹果称Onavo违反商店规则后，Facebook将Onavo从iOS应用商店下架。\nFacebook还遇到了麻烦，因为它使用了苹果为企业应用程序设计的一项功能，作为在消费者iPhone上安装研究软件的一种方式，否则这是不被允许的。\n许多大型科技公司都有自己的内部风险基金。英特尔是首批之一，但微软、谷歌、高通和其他公司也纷纷效仿。\n虽然这样的努力可以为现金充裕的科技公司带来稳健的财务回报，但它们也可以成为把握初创企业脉搏的重要手指-一种发现最新趋势的方式，并有可能收购这些后起之秀。\nFacebook本身对这个概念并不陌生。2007年，它与风险投资公司Accel和Founders Fund合作推出了fbFund，这是一只1000万美元的基金，面向在Facebook平台上开发应用的初创公司，其投资组合包括Lyft的前身Zimride。", "note_en": "Facebook has been hiring seasoned tech investors to help lead a new &#34;multimillion dollar&#34; investment fund within its experimental apps team, Axios has learned.\n Why it matters: Starting a formal investing program aimed at startups could bolster the company&#39;s ability to spot the next big social app before it becomes big. That visibility is all the more important given that antitrust scrutiny has likely closed the door on large acquisitions by Facebook for the near future.\n Details: Facebook posted a job opening recently saying it was looking to hire a &#34;head of investments&#34; for its New Product Experimentation (NPE) team, ideally someone with 10 years of tech experience.\n &#34;In this role, you will manage a multi million dollar fund that invests in leading private companies alongside top venture capital firms and angel investors,&#34; Facebook said in the now-deleted job posting. &#34;You will develop investment and impact theses, lead the execution of new investments, and support existing portfolio companies as needed.&#34;\n Facebook confirmed to Axios that it has hired someone to fill that role but declined to name the person or say say how large the fund would be. Also helping manage the new fund is Shabih Rizvi, a Google and Kleiner Perkins veteran who was most recently at Gradient Ventures, one of the corporate venture firms owned by Alphabet, Google&#39;s parent company.\n Between the lines: A source familiar with the company&#39;s plans said the effort is not a general purpose fund but rather a targeted effort to stay in close touch with the startup world. Facebook characterized the effort as an extension of the work it has done in the past with startup accelerators and hackathons.\n &#34;In the same spirit that the New Product Experimentation (NPE) group is charged with product experimentation, the team is also experimenting with ways to support external startups, including with capital,&#34; Facebook said in a statement to Axios.\n  Facebook&#39;s corporate development teams already invest in companies, such as its recent  $5.7 billion stake in India&#39;s Jio Platforms, but this is a separate effort focused on small stakes in startups.\n NPE,  first unveiled last summer, is headed by longtime Facebook exec Ime Archibong. The new head of investments will report to Archibong.\n The unit has reportedly been working on a range of apps,  from teen-focused ones for listening to music to  apps for podcasting and travel. It&#39;s also home to founders of some of the companies Facebook has acquired, like TBH and MSQRD, likely a way to retain them at the company in more experimental and interesting jobs.\n The big picture: Facebook has long tried to identify the next big thing in social media and either acquire the pioneer, as it did with Instagram and WhatsApp, or match key features, as has been the case with Snapchat (which famously turned down a $3 billion acquisition offer by Facebook).\n Another large acquisition of a social networking rival would be difficult if not impossible, now, given  heavy antitrust scrutiny of Facebook. That puts added pressure on Facebook to find other ways to identify emerging trends and up-and-coming rivals before they become significant threats.\n Facebook has used a number of techniques to identify emerging apps that people are using.\n In 2013, it bought a company called Onavo that tracked apps as part of its VPN. Facebook  pulled Onavo from the iOS App Store in 2018 after Apple said it violated store rules.\n Facebook has also gotten in trouble for using an Apple feature designed for corporate apps as a way to install research software on consumer iPhones that would not otherwise be allowed.\n Many large tech companies have their own internal venture funds. Intel was one of the first, but Microsoft, Google, Qualcomm and others have followed suit.\n While such efforts can produce solid financial returns for tech companies flush with cash, they can also be an important finger on the pulse of startup-land — a way to spot the latest trends, and potentially acquire these up-and-comers.\n Facebook itself isn&#39;t a stranger to this concept.  In 2007, it debuted fbFund in partnership with VC firms Accel and Founders Fund, a $10 million fund for startups building apps on Facebook&#39;s platform and whose portfolio included Lyft&#39;s precursor, Zimride.", "posttime": "2020-06-14 00:03:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风险投资,facebook,成立,establishing", "title": "Facebook成立风险投资部门投资初创企业", "title_en": "Facebook establishing a venture arm to invest in startups", "transed": 1, "url": "https://www.axios.com/facebook-establishing-a-venture-arm-to-invest-in-startups-91d9ee71-2282-4032-8f31-45b861a6ba9c.html", "via": "", "real_tags": ["风险投资", "facebook", "成立"]}, {"category": "", "categoryclass": "", "imagename": "bb4669668e71dcb47916f6800f72f7f6.jpg", "infoid": 1006428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软云开发者倡导者瑞安·莱维克(Ryan Levick)在上个月的AllThingsOpen虚拟会议上表示，无论软件公司在工具和培训开发人员方面投入多少资金，“从本质上讲，C++并不是一种安全的语言。”他在一次虚拟演讲中解释了为什么微软正逐渐转向Rust来构建其基础设施软件，而不是C/C++。它正在鼓励其他软件行业巨头考虑同样的问题。\n他说：“我们使用的语言非常古老，而且来自不同的时代，不能为我们提供保护自己免受此类漏洞伤害的能力。”“C++不是一种内存安全的语言，没有人会真的假装它是，”他说。\n事实上，微软已经认为C++不再适用于编写任务关键型软件。该行业迫切需要为其低级系统工作转向性能良好、内存安全的语言。莱维克说，今天市场上最好的选择是铁锈。\n今天，C和C++是编写核心系统软件的首选语言。它速度很快，代码和机器本身之间只有一次汇编。\n但该行业正受到所有与内存相关的错误(其中许多是安全隐患)的困扰，这些错误都是由这些语言引起的。Levick说，现在，70%源自微软的CVE是内存安全问题。“没有真正的趋势，只是保持不变，”他说。“尽管我们做出了巨大的努力来解决这个问题，但这似乎仍然是一件常见的事情。”\n从财务角度来看，考虑到补救这种与内存相关的无休止错误的成本飙升，这是有道理的。Levick说，早在2004年，每个与内存相关的错误给业界造成的损失约为25万美元，而微软的估计可能处于较低的水平。\n当然，有许多提高C++安全性的努力，但是尽管每一种方法都是有效的，但都不能完全解决问题。\n一种早已提出的方法是对程序员进行更多关于如何编写更安全代码的培训。但是，“没有任何证据表明，对C和C++开发人员进行整体培训实际上会以任何重要的方式解决这个问题，”Levick说，并引用了微软自己的大量开发人员内部培训。\n静态分析是另一种可能的解决方案。但是静态分析带来了太多的开销：它需要连接到构建系统中。“所以有很大的诱因不使用静态分析，”Levick说，“如果默认情况下没有打开，那也无济于事.”\n他说，运行时检查也是如此：“要知道何时使用了运行时检查合同，何时没有使用，这是不可能的，或者至少是极其困难的。”他补充说，这些合同也会带来运营开销。\n为了应对这个与内存相关的错误问题，Microsoft安全响应中心发起了安全系统编程语言计划。在那里，有一些工作专门用来支撑C/C++。这里还创建了Verona，这是一种为安全低级编程而创建的新编程语言。但项目战略的第三个方面，也是他们最信任的一个，是支持“行业正面解决这个问题的最好机会”。\n就性能而言，Rust与C/C++不相上下，甚至可能更快一些。Ruust通过包管理、现代测试框架等为开发人员带来了生产力。而程序员也喜欢它的“锈蚀”(Rust)。\n但微软如此迷恋Rust的主要原因是它是一种内存安全的语言，只需最少的运行时检查。Rust擅长创建正确的程序。所谓正确大体上是指编译器检查程序是否有不安全的操作，从而减少运行时错误。不安全关键字是一个选项，但不是默认选项。不安全的锈代码几乎总是更大的安全代码的子集。不安全模式对于内存分配作业(如编写设备驱动程序)是必需的。但即使在这里，内存的不安全部分也被封装在API之后。\nLevick说，这种安全编程的能力不应该掉以轻心。事实上，它可以提供超过10倍的改进，使其值得投资。这在很大程度上是因为几乎所有的C/C++代码都需要对不安全行为进行安全审核，而需要检查的用Rust编写的不安全代码只是大多数代码库的一小部分。\n虽然微软看好Rust，但Levick承认微软核心开发者不会很快停止使用C/C++。\n他说：“我们在微软有很多C++，这些代码哪儿也不会去。”“事实上，微软c++还在继续写，而且还会继续写一段时间.”\n很多工具都是围绕C/C++构建的。特别是，Microsoft二进制文件现在几乎完全构建在Microsoft Visual C++编译器上，该编译器生成MSVC二进制文件，而Rust则依赖于LLVM。\n然而，也许最大的挑战是文化。“只有一些人只想用他们已经会的语言完成他们的工作，”莱维克承认。\n尽管如此，该行业似乎正在走向生锈。Amazon Web Services使用它，部分用于部署Lambda无服务器运行时，以及EC2的某些部分。Facebook已经开始使用Rust，苹果、谷歌、Dropbox和Cloudflare也是如此。\n新堆栈不允许在此网站上直接发表评论。我们邀请所有希望讨论故事或发表评论的读者访问我们的Twitter或Facebook。我们也欢迎您通过电子邮件提供新闻提示和反馈：@thenewstack.io。", "note_en": "No matter how much investment software companies may put into tooling and training their developers, “C++, at its core, is not a safe language,” said  Ryan Levick,  Microsoft cloud developer advocate, during the AllThingsOpen virtual conference last month, explaining,  in a virtual talk, why Microsoft is gradually switching to Rust to build its infrastructure software, away from C/C++. And it is encouraging other software industry giants to consider the same.\n “We’re using languages that are, because they are quite old and come from a different era, do not provide us the ability to protect ourselves from these kinds of vulnerabilities, he  said. “C++ is not a memory safe language and no one would really pretend that it is,” he said.\n In fact, Microsoft has deemed C++ no longer acceptable for writing mission-critical software. The industry sorely needs to move to a performant, memory-safe language for its low-level system work. And the best choice on the market today is  Rust, Levick said.\n  Today, C and C++ are the go-to languages for writing core system software. It is fast, with the only assembly between the code and the machine itself.\n But the industry is being crippled by all the memory-related bugs — many of which are security hazards — caused by these languages. Now, 70% of the CVEs originating at Microsoft are memory safety issues, Levick said. “There is no real trend it’s just staying the exact same,” he said. “Despite massive efforts on our part to fix this issue it still seems to be a common thing.”\n From a financial perspective, it makes sense, given the soaring cost of remedying this never-ending stream of memory-related errors. Back in 2004, each memory-related error cost industry about $250,000 each, and that Microsoft estimation is probably on the lower-end, Levick said.\n Of course, there are a number of efforts to boost C++ security, but while each is effective in the way it does, none entirely solves the problem.\n One approach that has been long floated is to do more programmer training in how to write safer code. But, “there is zero evidence that doing holistic training of C and C++ developers will actually fix this issue in any significant way,” Levick said, citing Microsoft’s own heaps of dev internal training.\n Static analysis is cited as another possible solution. But static analysis comes with too much overhead: It needs to be wired into the build system. “So there’s a lot of incentive not to use static analysis,” Levick said.  “If it’s not on by default it won’t it won’t help.”\n The same goes for runtime checks: “It’s impossible or it’s very least extremely hard to know when runtime checking contracts are used and when they’re not,” he said, adding that they also come with an operational overhead.\n  In response to this problem of memory-related errors, the  Microsoft Security Response Center launched the  Safe Systems Programming Language initiative. There, some work was dedicated for shoring up C/C++.  Verona, a new programming language being created for safe low-level programming, was also created here. But the third prong of the project strategy, the one they are putting the most faith in, is to support “the industry’s best chance for addressing this issue head-on.”\n  Performance-wise, Rust is on par with C/C++, and maybe even slightly faster. Rust brings developer productivity, with package management, modern testing frameworks and the like. And programmers  love Rust for it.\n But the main reason Microsoft is so enamored with Rust is that it is a memory-safe language, one with minimal runtime checking. Rust excels in creating correct programs.   Correctness means, roughly, that a program is checked by the compiler for unsafe operations, resulting in fewer runtime errors. Unsafe keyword is an option, but not the default. Unsafe Rust code is almost always a subset of a larger body of safe code. Unsafe mode is necessary for memory-assigning jobs like writing device drivers. But even here the unsafe portions of memory are encapsulated behind an API.\n This ability to program safely is not one that should be taken lightly, Levick said. In fact, it can provide more than a 10x improvement, making it worthwhile for investment. This is largely because pretty much all C/C++ code needs to security audits for unsafe behavior, whereas unsafe code written in Rust that would need to be checked is only a small subset of most code bases.\n While Microsoft is bullish on Rust, Levick admits that Microsoft core developers won’t stop using C/C++ anytime soon.\n “We have a lot of C++ at Microsoft and that code is not going anywhere,” he said. “In fact, Microsoft c++ continues to be written and will continue to be written for a while.”\n A lot of tooling is built around C/C++. In particular, Microsoft binaries are now almost completely built on the Microsoft Visual C++ compiler which produces MSVC binaries, whereas Rust relies on  LLVM.\n Perhaps the biggest challenge, though, is cultural. “There is just some people that just want to get their job done in the language that they already know,” Levick admitted.\n Still, the industry seems to be moving towards Rust. Amazon Web Services uses it, in part for deploying the  Lambda serverless runtime, as well as for some parts of  EC2. Facebook has  started using Rust, as has Apple, Google, Dropbox and Cloudflare.\n   The New Stack does not allow comments directly on this website. We invite all readers who wish to discuss a story or leave a comment to visit us on Twitter or Facebook. We also welcome your news tips and feedback via email:   feedback@thenewstack.io.", "posttime": "2020-06-14 00:02:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,微软,microsoft,rust", "title": "微软：铁锈是业界安全系统编程的“最佳机会”", "title_en": "Microsoft: Rust Is the Industry’s ‘Best Chance’ at Safe Systems Programming", "transed": 1, "url": "https://thenewstack.io/microsoft-rust-is-the-industrys-best-chance-at-safe-systems-programming/#", "via": "", "real_tags": ["编程", "微软", "microsoft", "rust"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如上所述，这是一个人的爱好项目，我不再有能力既不开发或维护网站，也不保护它免受滥用。\n你仍然可以在GitHub上找到OpenWebRX和CSDR，也可以在上面找到我的理科和硕士论文。\n简短的回答是：是的。KiwiSDR是自托管的，因此知道接收方URL的人将能够访问它。SDR.hu只提供了接收者的列表，以便于访问。还要注意的是，这个网站与开发和销售KiwiSDR的公司没有直接联系：它只是一个人的爱好项目。如果您有与KiwiSDR相关的问题，您可以随时通过他们在kiwisdr.com上的电子邮件地址联系该公司。\n我付了钱买了一个KiwiSDR。你为什么要关闭KiwiSDR接收器网络？\n我没有这样做，因为SDR.hu不是KiwiSDR接收器的网络。这是一个爱好项目，一个免费的服务，提供了一个基于OpenWebRX的开源SDR接收器列表，其中也包括KiwiSDR，但不是唯一的。关于这个个人项目会持续多久，我想我也没有做出承诺。此外，KiwiSDR是自托管的，所以知道接收方URL的人仍然可以访问它。另请注意，该网站与开发和销售KiwiSDR的公司没有直接关联。如果您有与KiwiSDR相关的问题，您可以随时通过他们在kiwisdr.com上的电子邮件地址联系该公司。\nSDR.hu是我收听业余电台的唯一途径。我现在该干啥？", "note_en": "As stated above, it was a one-person hobby project, and I don&#39;t have the capacity anymore to neither develop or maintain the site, nor protect it from abuse.\n   You can still find  OpenWebRX and  CSDR on GitHub, and also my  BSc and  MSc theses on them.\n   The short answer is:  yes. The KiwiSDR is self-hosted, so people who know the URL of your receiver will be able to access it. SDR.hu only provided a list of receivers for easier access.  Note also that this website was not affiliated directly with the company developing and selling the KiwiSDR: it was a one-person hobby project instead. If you have KiwiSDR related questions, you can always reach that company through their e-mail address on  kiwisdr.com.\n  I paid for a KiwiSDR. Why did you close down the &#34;network of KiwiSDR receivers&#34;?\n I didn&#39;t do so, as SDR.hu was not a &#34;network of KiwiSDR receivers&#34;. It was a hobby project, a free service that provided a list of the open source OpenWebRX-based SDR receivers, that also included the KiwiSDRs, but not exclusively. I don&#39;t think I&#39;ve made a promise either on how long would this personal project last. Furthermore, the KiwiSDR is self-hosted, so people who know the URL of your receiver will still be able to access it.   Note also that this website was not affiliated directly with the company developing and selling the KiwiSDR. If you have KiwiSDR related questions, you can always reach that company through their e-mail address on  kiwisdr.com.\n  SDR.hu was the only way for me to listen to amateur radio. What do I do now?", "posttime": "2020-06-13 23:46:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,defined,kiwisdr", "title": "软件定义的无线电站点关闭", "title_en": "Software Defined Radio Site Closes", "transed": 1, "url": "https://sdr.hu/", "via": "", "real_tags": ["软件", "defined", "kiwisdr"]}, {"category": "", "categoryclass": "", "imagename": "e3c89e3e3eb2e2fae3ee8882b58b60f6.jpg", "infoid": 1006425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络犯罪分子已经找到了敲诈大学的新方法--窃取敏感信息，然后威胁要在黑暗的网络上分享，除非支付赏金。\n在过去的两周里，三家机构成功地成为黑客使用这种方法的目标。第一个是密歇根州立大学，然后是加州大学旧金山分校，最近还有芝加哥哥伦比亚学院。\n没有一家机构透露索要了多少赎金。所有人都是使用名为NetWalker的恶意软件攻击的，并被给予6天的付款期限。\n据报道，NetWalker背后的网络罪犯运营的一个博客吹嘘说，从这些机构窃取的信息包括社会保险号和其他敏感信息。兰瑟姆泄密等Twitter用户分享了博客上分享的样本数据截图，其中包括护照和银行细节。\n时间到了。#NetWalker泄露了MSU(@michiganstate)勒索软件事件的数据。泄漏的第一部分现在可以下载。这只是一个品尝，以显示信息有多敏感。如果不支付赎金，很可能会有更多密歇根州立大学的泄密事件接踵而至。https://t.co/AUoZtE72hb。\n-赎金泄露(@ransomleaks)2020年6月4日。\n密歇根州立大学(Michigan State University)上周公开表示，它不会向黑客支付赎金-这是一个不同寻常的声明，因为许多机构不选择公开回应赎金要求。据报道，6月4日，黑客开始发布他们从密歇根州立大学窃取的数据，使其可以在黑暗网络上下载。\n密歇根州立大学(Michigan State)临时首席信息安全官丹·阿亚拉(Dan Ayala)在一封电子邮件中表示：“向这些罪犯支付报酬只会让这些罪行永久化，并进一步针对其他受害者。”他补充说，不付款的决定是根据执法指导做出的，并得到了大学董事会和校长的支持。\n密歇根州立大学的袭击仅限于该机构的物理和天文学部门。目前还不清楚黑客能够获取多少信息，也不知道现在黑客的最后期限已经过了多少。阿亚拉说，他无法透露有关袭击的许多细节，以“保护正在进行的调查的完整性”。\n阿亚拉说，随着事态的发展，学生、教职员工都在收到有关情况的最新消息。\n他说：我们将继续向所有学生、教职员工提供我们正在进行的调查的最新情况，当我们能够分享的时候，我们可以分享这些信息。这些通信还包括个人网络安全的最佳实践，以及在身份被泄露时保护您的身份的方法。我们正在与外部服务机构合作，最终确定针对受影响个人的身份盗窃保护服务。\n阿亚拉说，不支付赎金的决定得到了美国密歇根州州立大学社区的普遍支持，特别是在理解支付这样的金额会使这种做法永久化的情况下。但密歇根州立大学(Michigan State University)的学生政府组织密歇根州立大学(Association Students Of Michigan State University)负责学术事务的副总裁布里安娜·艾洛(Brianna Aiello)表示，学生们担心哪些信息可能被窃取，这是可以理解的。\n“从我在社交媒体上从学生那里收集到的信息来看，许多人一直在分享一篇与勒索软件攻击有关的文章，他们似乎对哪些信息可能被泄露感到紧张，”他在一封电子邮件中说。“没有太多人评论密西西比州州立大学如何选择不支付赎金。不过，总体而言，很难收集关于这个问题的感受，因为我们现在不在校园里。“。\n网络安全解决方案公司Emsisoft的威胁分析师布雷特·卡洛(Brett Callow)表示，芝加哥哥伦比亚大学(Columbia College Chicago)和加州大学旧金山分校(University of California，San Francisco)似乎在应对攻击方面采取了不同的方式。他说：“他们的数据不再出现在NetWalker的博客上，这表明他们要么支付了赎金，要么通过谈判将信息删除。”\n这两家机构都没有回应有关它们是否支付了黑客要求的赎金的问题，也没有回应入侵的规模。和密歇根州立大学一样，这两家机构都表示，他们无法分享太多信息，因为调查仍在进行中。\n加州大学旧金山分校(University of California，San Francisco)分享了一份声明，证实“6月1日发现了对我们IT环境特定领域的非法入侵”。\n加州大学旧金山分校是美国领先的研究机构之一，致力于寻找新冠肺炎的可能治疗方法。几家媒体报道称，这项研究以及潜在的有利可图的相关知识产权可能使该机构成为黑客的诱人目标。\n该大学在一份声明中表示：“我们认为，我们的行动隔离了对目标区域的入侵。”重要的是，我们的病人护理服务运营没有受到影响，这起事件也不会影响我们的整个校园网络。“。\n他说：“我们已聘请一间资讯科技保安公司，并已与执法部门联络。在他们的协助下，我们正在对事件进行彻底的评估，包括确定哪些信息(如果有的话)可能被泄露。“声明继续说。“为了维护调查的完整性，我们将需要限制目前我们可以分享的内容。”\n从历史上看，被称为勒索软件的恶意软件曾被黑客用来阻止对计算机网络和文件的访问-给目标造成了极大的不便。可以通过向黑客支付赎金来恢复访问，或者目标可以选择重建和替换丢失的系统和信息-这是一个潜在的艰巨和昂贵的过程，具体取决于攻击的规模。\n成功的勒索软件攻击在高等教育中相对少见，但它们确实会发生。门罗学院(Monroe College)是去年遭受高调勒索软件攻击的少数几家机构之一。这对学院的影响是巨大的-学生、教职员工有几天无法访问大学网站、学习管理系统或电子邮件。\n为了应对这类攻击，更多的组织已经投资于系统来备份他们的数据，这意味着如果信息访问被阻止，数据不会丢失。卡洛说，这迫使黑客改变了他们的策略。2019年末，使用勒索软件的黑客不仅开始阻止访问信息，还威胁要在黑暗的网络上分享信息-损害了相关组织或机构的声誉。\n卡洛说，有时黑客不仅会将信息发布到黑暗网络上，还会提出将其出售给出价最高的人。他指出，在与黑客打交道时没有保证-即使他们拿到了他们要求的赎金，他们也可能出售被盗的信息。\n未来隐私论坛的青年和教育隐私主管阿米莉亚·万斯(Amelia Vance)表示：“法律要求高等教育机构保护学生信息，但真正严重的信息泄露事件由来已久，并不总是得到很好的处理。《未来隐私论坛》(Future Of Privacy Forum)的青少年和教育隐私主管阿米莉亚·万斯(Amelia Vance)说。\n通常情况下，机构被要求报告州一级的数据泄露事件。万斯说，涉嫌泄密也必须向美国教育部报告，但对于什么构成应报告的数据泄露存在一些困惑。如果你看了指南，就会发现不清楚。它可以涵盖一切。但也有很多明确的信息泄露事件，我会将最近发生的这些事件描述为信息泄露。\n万斯说，机构可以尝试防止敏感数据泄露的一种方式是确保它们不会持有不需要的信息。她说：我们需要更多的机构来继续保持良好的数据卫生。\n另一个选择是让大学对他们被要求保留的敏感信息进行加密。万斯说，这将使窃取的信息在黑暗的网络上几乎一文不值，因为犯罪分子破解加密需要花费时间和金钱，而在机构层面加密一切的问题是可用性。万斯说，如果一个系统过于复杂，人们就会绕过任何系统。很难为不同的机构找到正确的方法来做到这一点。&#34；万斯说，无论这个系统是什么，人们都会绕来绕去。要找到合适的方式让不同的机构做到这一点，是一个很困难的平衡。\n印第安纳大学(Indiana University)应用网络安全研究中心(Center For Application Cybersecurity Research At Indiana University)高级安全分析师迈克·斯坦菲尔德(Mike S.Stanfield)表示，与许多公司不同的是，大学的不同寻常之处在于，它们经常试图保持相对开放的网络，以鼓励合作和易用性。他说，在试图保护网络安全的同时保持开放是极其困难的。\n目前，许多教职员工都不愿在家工作在可能不安全的网络上，这使得大学IT领导者的工作变得更加困难。“这些袭击来得非常不是时候，很多人都在家工作，我们都有这些漏洞百出的边界，”他说。\n许多勒索软件攻击都是钓鱼电子邮件的结果，用户点击一个链接，无意中下载了恶意软件。近几个月来，钓鱼电子邮件利用与新冠肺炎大流行相关的恐惧和困惑来发挥自己的优势。斯坦菲尔德说，为了阻止钓鱼电子邮件取得成功，各机构可以培训大学的员工识别看起来可疑的电子邮件。他说，双因素识别也是一个非常重要的防御措施。\nEducation ause的网络安全总监布莱恩·凯利(Brian Kelly)也认为这些都是重要的步骤，但它们不一定能防御NetWalker的网络攻击。凯利说，在公开场合，这些首席信息官可能不会分享太多关于这些攻击是如何发生的信息，以及他们正在寻找的指标，但有一些网络是IT领导人分享信息的，比如印第安纳大学的Ken-ISAC网络。凯利说，我们可以相互帮助，而不会向黑客透露我们已经找到了他们。\n凯利和斯坦菲尔德一致认为，对高等教育中的IT领导者来说，监控这些网络并与他们的同行交谈是很重要的。网络攻击正在不断演变，如果不能跟上新的情报，可能会产生可怕的后果。\n“这是一场持续不断的猫捉老鼠的游戏，”凯利说。“一旦我们了解了一个威胁，新的威胁就会出现。", "note_en": "Cybercriminals have found a new way to extort universities -- stealing sensitive information and then threatening to share it on the dark web unless a bounty is paid.\n Three institutions were successfully targeted by hackers using this approach in the past two weeks. The first was  Michigan State University, then the University of California, San Francisco, and, most recently, Columbia College Chicago.\n None of the institutions have shared how much ransom was requested. All were targeted using malicious software known as  NetWalker and given a deadline of six days to pay.\n A blog run by the cybercriminals behind NetWalker reportedly boasts that stolen information from the institutions includes Social Security numbers, among other sensitive information. Twitter users such as Ransom Leaks have shared screenshots of sample data shared on the blog, which include passports and banking details.\n  Times up.  #NetWalker leaked data from the MSU ( @michiganstate) ransomware incident. The first part of the leak is now available for download. This is just a taste to show how sensitive the info is. It&#39;s likely that more MSU leaks will follow, if the ransom is not paid.  https://t.co/AUoZtE72hb\n— Ransom Leaks (@ransomleaks)  June 4, 2020\n  Michigan State University stated publicly that it would  not pay ransom to the hackers last week -- an unusual declaration, as many institutions do not choose to make their response to ransom demands public. On June 4, hackers reportedly began publishing the data they stole from Michigan State, making it available to download on the dark web.\n “Payment to these criminals only allows these crimes to be perpetuated and further target other victims,” said Dan Ayala, interim chief information security officer at Michigan State, in an email. He added that the decision not to pay was in accordance with law enforcement guidance and reached with support from the university’s Board of Trustees and president.\n The Michigan State attack was limited to the institution’s physics and astronomy unit. It is not known at this time how much information the hackers were able to access, nor how much has been leaked now that the hacker’s deadline has passed. Ayala said he was unable to share many details about the attack to “protect the integrity of the ongoing investigation.”\n Students, faculty and staff are receiving updates on the situation as it unfolds, Ayala said.\n &#34;We continue to provide updates to all students, faculty and staff on our ongoing investigation with information that we are able to share, when we are able to share it,&#34; he said. &#34;These communications also include best practices for personal cybersecurity and ways to protect your identity if it has become compromised. We are working with outside services to finalize identity theft protection services for affected individuals.&#34;\n The decision not to pay the ransom has been “generally supported by the MSU community, especially with the understanding that paying such amounts perpetuates the practice,” Ayala said. But students are understandably concerned about what information may have been stolen, said Brianna Aiello, vice president for academic affairs at the Associated Students of Michigan State University, the institution&#39;s student government organization.\n “From what I’ve gathered from students on social media, many have been sharing an article pertaining to the ransomware attack and seem to be nervous as to what information could be leaked,” Aiello said in an email. “Not too many have commented on how MSU has chosen not to pay the ransom. Overall, though, it is hard to gather feelings about this issue because we are not on campus right now.”\n  Columbia College Chicago and the University of California, San Francisco, appear to have taken a different approach in responding to the attack, said Brett Callow, threat analyst at cybersecurity solutions company Emsisoft. “Their data is no longer on the NetWalker blog, suggesting that they either paid the ransom or negotiated to have the information taken down,” he said.\n Neither institution responded to questions on whether or not they paid the ransom demanded by hackers or addressed the scale of the breaches. Like Michigan State, both institutions stated they were unable to share much information, as investigations are ongoing.\n The University of California, San Francisco, shared a statement that confirmed “an illegal intrusion into a specific area of our IT environment” was identified June 1.\n UC San Francisco is one of the research institutions leading efforts in the U.S. to find possible treatments for COVID-19. Several media reports have suggested that this research and potentially lucrative associated intellectual property may have made the institution an attractive target for hackers.\n  “We believe our actions isolated the intrusion to the area that was targeted,” the university said in a statement. “Importantly, our patient care delivery operations are not impacted, and the incident does not affect our overall campus network.”\n “We have engaged an IT security firm and have reached out to law enforcement. With their assistance, we are conducting a thorough assessment of the incident, including a determination of what, if any, information may have been compromised,” the statement continues. “In order to preserve the integrity of the investigation, we will need to limit what we can share at this time.”\n  Historically, malicious software known as ransomware has been used by hackers to block access to computer networks and files -- causing huge inconvenience to the target. Access could be restored by paying a ransom to the hackers, or the target could choose to rebuild and replace the systems and information that were lost -- a potentially arduous and expensive process, depending on the scale of the attack.\n Successful ransomware attacks are relatively unusual in higher ed, but they do happen. Monroe College was among a  handful of institutions subjected to high-profile ransomware attacks last year. The  impact on the college was huge -- students, faculty and staff members were unable to access the university website, learning management system or email for several days.\n In response to these kinds of attacks, more organizations have invested in systems to back up their data, meaning that if access to information is blocked, the data are not lost. This has forced hackers to change their tactics, Callow said. In late 2019, hackers using ransomware began not just blocking access to information but threatening to share it on the dark web -- harming the reputation of the organization or institution involved.\n Sometimes hackers won’t just publish information to the dark web but offer to sell it to the highest bidder, Callow said. He noted that there are no guarantees when dealing with hackers -- they may sell stolen information even if they get the ransom money they ask for.\n  Higher education institutions are required by law to protect student information, but have a long history of &#34;really bad breaches of information&#34; which are not always handled well, said Amelia Vance, director of youth and education privacy at the Future of Privacy Forum.\n Often institutions are required to report data breaches at the state level. Suspected breaches must also be reported to the U.S. Department of Education, but there is some confusion about what constitutes a reportable data breach, said Vance. &#34;If you read the guidance, there is a lack of clarity. It could cover everything. But there are plenty of clear-cut breaches, and I would characterize these recent incidents as breaches.&#34;\n  One way that institutions can try to prevent sensitive data from being leaked is to ensure they do not hold on to information they don&#39;t need, said Vance. &#34;We need institutions to continuously practice good data hygiene,&#34; she said.\n Another option would be for colleges to encrypt sensitive information they are required to keep. This would make stolen information virtually worthless on the dark web since it would cost time and money for criminals to crack the encryption, said Vance. The problem with encrypting everything at the institutional level is usability. &#34;If a system is overly complicated, people will just go around whatever the system is,&#34; said Vance. &#34;It is a difficult balance to find the right way for institutions to do this.&#34;\n Universities, unlike many companies, are unusual in that they often try to maintain relatively open networks to encourage collaboration and ease of use, said Mike Stanfield, senior security analyst at the Center for Applied Cybersecurity Research at Indiana University. Maintaining openness while trying to secure a network is incredibly difficult, he said.\n Right now many faculty members are working from home on networks that may not be secure, making college IT leaders’ jobs even more difficult. “These attacks are coming at a really bad time, many people are working from home, we have all these porous perimeters,&#34; he said.\n Many ransomware attacks are the result of phishing emails, where users click a link and inadvertently download malicious software. In recent months, phishing emails have used the fear and confusion relating to the COVID-19 pandemic to their advantage. To stop phishing emails from being successful, institutions can train college employees to identify suspicious-looking emails, said Stanfield. Two-factor identification is an important defense, too, he said.\n Brian Kelly, director of cybersecurity at Educause, agreed these are important steps, but they may not necessarily defend against the NetWalker attacks. Publicly, CIOs may not be sharing much information about how these attacks take place and the indicators they are looking for, but there are networks where IT leaders are sharing information, such as the REN-ISAC network based out of Indiana University. &#34;We can help each other without tipping off a hacker that we&#39;re on to them,&#34; said Kelly.\n Kelly and Stanfield agreed it is important for IT leaders in higher ed to be monitoring these networks and talking to their peers. Cyberattacks are constantly evolving, and failure to keep up with new intelligence can have dire consequences.\n “It’s a constant game of cat and mouse,” said Kelly. “As soon as we understand one threat, a new one emerges.&#34;", "posttime": "2020-06-13 23:27:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,大学,netwalker,targeted,信息", "title": "NetWalker勒索软件针对的大学", "title_en": "Universities Targeted by NetWalker Ransomware", "transed": 1, "url": "https://www.insidehighered.com/news/2020/06/11/colleges-face-evolving-cyber-extortion-threat", "via": "", "real_tags": ["软件", "大学", "netwalker", "targeted", "信息"]}]