[{"category": "", "categoryclass": "", "imagename": "691011cc7443ee57e7222abc9847a594.jpeg", "infoid": 1033771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新加坡(路透社)-在新加坡一座公共住宅楼的高高的阳台上，一名环境官员正在稳定他的蚊子发射器，这是当局为抗击创纪录的热带疾病登革热爆发而设计的最新装置。\n只需按一下按钮，扇一声，舱门就打开了，150只实验室饲养的雄性蚊子飞了起来，寻找可以交配但不能繁殖的雌性伴侣。\n登革热病毒由受感染的蚊子携带并传播给人类，在极少数情况下可能是致命的。\n但新加坡专门培育的蚊子携带一种细菌，可以阻止卵孵化，并“与野生蚊子竞争”，导致“蚊子数量逐渐减少”，以这种细菌命名的沃尔巴克氏菌项目负责人吴李青(Ng Lee Ching)说。\n她补充说，使用这项技术，一些蚊子数量高的地区已经看到高达90%的降幅。\n新加坡是一个只有570万人口的东南亚岛国，今年已经记录了超过2.6万例登革热病例，超过了2013年创下的约2.2万例的年度纪录，目前还有四个月的时间。\n今年已有20人死于这种疾病，这种疾病可能会导致高烧，导致内出血和休克。相比之下，在这个城市国家的5.6万多名感染者中，只有27人死于冠状病毒。\n一种新的登革热病毒株，再加上反常的潮湿天气和冠状病毒封锁，使建筑工地和其他蚊子滋生地没有受到干扰，这些都被视为登革热爆发的原因。\n这将责任推到了传统的威慑措施上，比如雾化，藐视灭蚊法规的人被罚款，比如让花盆里装满积水，以及采用新技术，比如沃尔巴克氏菌(Wolbachia)项目。\n在政府的实验室里，科学家们在一排排托盘中培育携带细菌的蚊子，将雄蛹分离出来，放到登革热高危地区。\n环境机构说，对于生活在这些地区的每个人来说，每周释放多达6只沃尔巴克氏菌蚊子。\n沃尔巴克氏菌蚊子不能传播登革热等疾病，只有雌性蚊子才会叮咬人类。\n当雄性沃尔巴克氏菌蚊子与没有携带细菌的雌性蚊子交配时，所产生的卵都不会孵化。\n这一战略在澳大利亚取得了成功，但一些专家表示，在新加坡等人口稠密的城市地区，这一战略可能有其局限性。\n新加坡国立大学医院(National University Hospital)的高级顾问保罗·坦比亚(Paul Tambyah)说，“你必须让这些蚊子泛滥整个岛屿，人们会很恼火。”\n“他们不会抓住蚊子，然后检查它是雄性还是雌性。”他们会把它们一扫而空，这就违背了目的。“他说。", "note_en": "SINGAPORE (Reuters) - From the high balcony of a Singapore public housing block, an environment official steadies his mosquito launcher, the latest contraption authorities have devised to combat a record outbreak of the tropical disease dengue.\n  With the click of a button and a whirr of a fan, a hatch opens and 150 lab-reared male mosquitoes are sent flying, off in search of a female companion with whom they can mate but not reproduce.\n The dengue virus, which in rare cases can be fatal, is carried and spread to humans by infected mosquitoes.\n But Singapore’s specially bred mosquitoes carry a bacteria that prevents eggs from hatching, and “compete with the wild type,” leading to “a gradual reduction of the mosquito population,” said Ng Lee Ching, the official heading the Wolbachia project, named after the bacteria.\n  Some areas with high mosquito populations have seen up to 90% declines using this technique, she added.\n Singapore - a tiny Southeast Asian island nation of 5.7 million people - has recorded more than 26,000 dengue cases this year, surpassing the previous annual record of around 22,000 in 2013 with four months still remaining.\n Twenty people have died of the disease this year, which can cause extreme fever that leads to internal bleeding and shock. By comparison, only 27 people have died of the coronavirus in the city-state out of more than 56,000 infections.\n  A new strain of the disease, combined with unseasonably wet weather and coronavirus lockdowns that left construction sites and other mosquito breeding grounds undisturbed, are all seen as factors behind the dengue outbreak.\n That has put the onus on traditional deterrents like fogging, fining people for flouting anti-mosquito regulations like leaving plant pots full of stagnant water, and deploying novel techniques such as the Wolbachia project.\n In government laboratories, scientists breed the bacteria-carrying mosquitoes in rows of pallets - separating the male pupae for release in high-risk dengue areas.\n  For every person living in those areas, up to six Wolbachia mosquitoes are released each week, the environment agency said.\n Wolbachia mosquitoes can’t transmit diseases such as dengue, and only female mosquitoes bite humans.\n When male Wolbachia mosquitoes mate with females that don’t carry the bacteria, none of the resultant eggs will hatch.\n  The strategy has been successful in Australia but some experts say it might have its limits in dense urban areas such as Singapore.\n “You’ve got to flood the island with these mosquitoes, and people get annoyed,” said Paul Tambyah, senior consultant at Singapore’s National University Hospital.\n “They’re not going to grab the mosquito and examine and see whether it’s a male or female. They’re going to swipe them away, and that kind of defeats the purpose,” he said.", "posttime": "2020-11-08 09:39:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "感染,rears,蚊子", "title": "新加坡饲养感染沃尔巴克氏菌的蚊子抗击登革热", "title_en": "Singapore rears moquitoes infected with Wolbachia bacteria to combat dengue", "transed": 1, "url": "https://www.reuters.com/article/us-singapore-environment-dengue-idUSKBN25O03A", "via": "", "real_tags": ["感染", "rears", "蚊子"]}, {"category": "", "categoryclass": "", "imagename": "39b5870f0152d70653491cd5930ddbb5.png", "infoid": 1033770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因为这个话题相当广泛，所以我分为两个部分。在第一部分中，我们将简单介绍安全概念和威胁建模，然后重点介绍一些提高嵌入式Linux设备安全性的缓解技术，包括安全引导、代码/数据加密和安全密钥存储。\n如果您更喜欢一个小时的演讲而不是阅读本文，您还可以观看我为Toradex录制的网络研讨会“嵌入式Linux安全性简介”。我在2020年北美嵌入式Linux大会上也做了同样的演讲，但在我写这篇文章的时候，它还没有发表在YouTube上。\n一方面，我们有所有者，那些从产品或服务中受益的人(用户、制造商、企业主等)。所有者想要保护资产，任何在产品或服务中有一定价值的东西(数据、代码、声誉等)。\n另一方面，我们有威胁行为者，可以表现出威胁的人或物(恶意黑客、政府等)，任何能够以可能导致伤害的方式对资产采取行动的东西。\n要显示威胁，威胁行为者将通过攻击载体(威胁行为者用来访问或渗透目标系统的方法或路径)探索漏洞(系统中的弱点)。\n归根结底，这是所有者和威胁行为者之间的猫捉老鼠游戏。业主会在多大程度上保护这些资产？威胁行为者会在多大程度上损害这些资产？这真的取决于资产的价值。事实上，所有者和威胁行为者对价值的看法可能不同。\n识别资产(及其价值)以降低受到威胁的风险可以在一个称为威胁建模的过程中完成。\n威胁建模是一个可以识别、列举潜在威胁并确定缓解措施的流程。这基本上是一个风险评估过程，在这个过程中，你要评估你的资产的价值和保护它们的成本。威胁建模的结果是产品的威胁模型。\n有几种技术和方法可以在威胁建模期间提供帮助，包括大步、恐惧、广度、八度和许多其他方法。\n为了对这个话题有一个非常基本的介绍，让我们来谈谈大步和恐惧。\nSTRIDE模型是帮助对威胁进行分类的非常有用的工具。它是由微软开发的，该名称是六种主要类型威胁的首字母缩写：欺骗、篡改、否认、信息泄露、拒绝服务和权限升级。STRIDE可用于识别系统资产可能面临的所有威胁。\nDREAD方法是一种用于风险评估计算机安全威胁的工具。该名称是五类安全威胁的首字母缩写：损害(攻击有多严重)、可重复性(复制攻击有多容易)、可利用性(发动攻击的工作量有多大)、受影响的用户(有多少人会受到影响)和可发现性(发现威胁有多容易)。\nSTRIDE模型有助于识别威胁，而DREAD方法则有助于对它们进行排序。对于系统中的每个威胁，您可以查看每个威胁类别，并将其分类为低(1分)、中(2分)或高(3分)。最后，您将拥有一个威胁和缓解策略的排名列表。示例：\n我们可以看到，威胁建模将提供一个非常清晰的视图，了解我们想要保护什么、我们计划如何保护它以及相关成本。这是产品威胁模型的一部分，每个开发周期都需要重新评估。因此，威胁模型将提供要处理的威胁的优先列表，这样我们就可以专注于实施缓解措施来提高产品的安全性。\n如何保护代码的完整性和真实性？如何确保数据的私密性？在哪里存储加密密钥？如何将应用程序被利用的风险降至最低？让我们尝试回答所有这些问题以及更多问题，首先从安全引导开始！\n如何确保您正在运行的代码是由值得信任的人或公司构建的？实施安全引导过程。\n安全引导过程的目标是保护代码的完整性和真实性。\n安全引导通常基于数字签名的验证。嵌入式Linux系统通常有三个主要组件：BootLoader、内核和根文件系统(Rootfs)。所有这些组件都已签名，并在引导期间检查签名。\n例如，可以使用一些硬件机制来检查引导加载程序的签名，该引导加载程序将检查内核的签名，该引导加载程序将使用ramdisk镜像来检查根文件系统的签名。因为我们让一个组件检查引导链中下一个组件的签名，所以这个过程通常被称为信任链。\n让我们来看看恩智浦iMX6设备上的一个真实例子。\n一切都始于SoC内部的ROM代码。在恩智浦iMX6上，有一个名为高保证引导(HAB)的硬件组件，它能够验证第一阶段引导加载程序的签名，从而实现安全的引导过程。IMX6设备内的高保证引导也可以称为信任根，因为如果它受到威胁，所有安全引导过程也会受到威胁。\nIMX6 SoC内部的ROM代码将使用HAB组件检查引导加载程序的签名。为此，需要生成一对密钥(公钥和私钥)，用私钥对引导加载器签名，并将公钥存储在SoC中。在iMX6上，动态口令保险丝用于存储密钥。实际上，为了降低成本，SoC中只存储了公钥的散列。\n当BootLoader启动时(例如U-Boot)，它必须检查Linux内核的签名。为此，通常使用一种称为FIT IMAGE的图像格式。FIT镜像是具有散列和签名支持的多个二进制文件的容器，通常包含Linux内核镜像、设备树文件和初始ramdisk。在生成一对密钥之后，我们需要使用私钥e Configure U-Boot对FIT图像中的二进制文件进行签名，以使用公钥检查FIT图像的签名。\n内核引导后，它将从ramdisk镜像运行init程序。Ramdisk将具有在挂载最终根文件系统之前验证其完整性的逻辑。有一些选项可以实现这一点。一种常见的选择是使用设备映射器验证(dm-verity)内核模块。Dm-verity内核模块提供块设备的完整性检查，并且需要只读的rootfs(squashfs可以是一个很好的解决方案)。如果需要读写根文件系统，其他方法可以是ima或dm-Integrity。\n这只是安全引导实施的一个例子，尽管它可以应用于不同的主板和ARM SoC集合。\n2017年7月17日，几款恩智浦设备(i.MX6、i.MX50、i.MX53、i.MX7、i.MX28和Vybrid系列)的ROM代码中的安全启动漏洞被公开披露。如果你的信任链受损，一切都会受损！因此，我们需要意识到这些类型的漏洞(在本例中，它们是用新的硅片修复的)。\n虽然安全引导可确保真实性和完整性，但它不能防止设备被伪造或威胁攻击者从设备中提取代码/数据。因此，如果您想要保护您的知识产权或确保数据机密性，您将需要使用加密。\n当您需要保护用户的隐私和机密性时，数据加密是一种常见的方法。数据是在设备执行期间生成的任何信息，包括数据库、配置文件等。\n代码加密取决于具体情况，加密完整的根文件系统并不常见。通常，大多数组件都是免费的开源软件，所以没有什么好隐瞒的。还有GPLv3和Tivoization的问题(使用任何GPLv3软件都会迫使你为用户提供一种更新软件的机制，这将使你在加密软件时更加困难)。更常见的用例是只加密您为设备开发的应用程序。这通常是你的知识产权所在的地方。\n在Linux中，基本上有两种主要的加密方法：全磁盘加密和基于文件的加密。\n全磁盘加密提供块级别的加密，整个磁盘或磁盘分区被加密。为此，我们可以使用dm-crypt，这是Linux内核的设备映射器加密目标。\n基于文件的加密在文件系统级别提供加密，其中每个目录可以单独使用不同的密钥进行加密，并且可以选择使用不同的密钥进行加密。基于文件的加密的两个最常见的实现是fsccrypt和eCryptFS。Fsccrypt是一些文件系统(如EXT4、UBIFS和F2F)上可用的API，而eCryptFS是一种更通用的解决方案，它是作为堆叠在现有文件系统之上的层实现的。\n由于非对称密钥算法速度太慢，无法用于加密，因此通常使用对称密钥算法进行加密。这意味着加密和解密使用相同的密钥，该密钥应该在文件系统中的某个位置可用，以便可以解密加密的代码/数据。\n但我们不能就这样把密钥留在文件系统里，对吗？\n有几个案例表明，公司并不关心这一点，并为此付出了代价。例如，下面的图片来自第一台Xbox视频游戏机。安全研究员Andrew“Bunnie”Huang能够开发出一种专门的FPGA硬件来嗅探通信总线，并从设备中提取加密密钥。仅仅是因为密钥在那里，在通信总线上以明文传输，没有任何保护(顺便说一句，Andrew Huang是一本关于硬件黑客的非常好的书《黑客攻击Xbox》的作者，你可以在他的网站上免费下载)。\n结论是，对加密的代码/数据的保护与对其解密的密钥的保护一样安全！\n在台式机或智能手机上，用于加密文件系统的密钥可以从交互输入的用户密码(密码短语)中获得。例如，安卓智能手机就是这样运行的。\n在嵌入式系统上，我们通常不需要用户交互来在每次引导设备时从密码派生密钥。因此，密钥应该加密存储在文件系统或安全存储中。为此，我们需要硬件支持。\n例如，恩智浦i.MX处理器拥有唯一的主密钥(由恩智浦预先编程)，只能由名为CAAM(加密加速器和保证模块)的特殊硬件模块访问。该硬件设备可用于加密密钥并将其存储在文件系统中(这必须在制造过程中完成)。在引导期间，CAMM模块将用于解密密钥并恢复将用于解密文件系统的明文密钥。由于CAAM模块内部的密钥不可访问，因此加密的密钥是受保护的。\n如果处理器中没有可用的安全功能，则可以使用外部硬件(如安全元件或TPM设备)实现相同的结果。这些外部设备通常提供安全存储，因此它们可用于存储可用于加密/解密文件系统加密密钥的主密钥。这些设备还提供了许多安全功能，如随机数生成、散列计算、加密和签名功能等。\n安全元件是安全计算系统。它基本上是带有自己的安全应用程序的安全存储(通常使用Java Card实现，但不是必需的)。安全元素的作用是非常开放的，并且取决于实现，但它们中的大多数都实现了公钥加密标准11(PKCS#11)。安全元件的例子是智能卡和SIM卡。\n可信平台模块是一个规范和国际标准(国际标准化组织/国际电工委员会11889)。TPM不是一个安全元素，尽管它可以在其中实现。它可以在硬件或软件中实现，但大多数实现都在硬件中。它提供了该标准定义的一组有限的安全功能，包括安全存储和加密功能。\n安全存储的第三种替代方案是使用可信执行环境(Trusted Execution Environment)。TEE是一种环境，在该环境中，执行的代码和访问的数据在机密性(没有人可以访问数据)和完整性(没有人可以更改代码及其行为)方面受到隔离和保护。我们周围的许多设备都使用可信执行环境，包括智能手机、机顶盒、视频游戏机和智能电视。如果您想了解TEE如何工作的更多细节，可以阅读我的文章“Trusted Execution Environment and ARM‘s TrustZone简介”。\n最后，如果您关心嵌入式Linux设备中的加密，则必须从项目开始就考虑密钥存储和管理。\n到目前为止，我们已经讨论了安全引导和加密来提高嵌入式Linux设备的安全性。但这还不够。我们应该始终考虑层次分明的安全性，每一层都应用一种建立在其他层之上的缓解技术，以提高设备的安全性。多种缓解技术的结合会让攻击者更难破坏设备。\n想想看。您可以通过安全引导和加密来保护您的代码和数据，但如果您运行的应用程序有可能被利用的错误，您的资产仍然面临风险。如果应用程序具有攻击载体(用户输入、配置文件、网络通信等)，则可利用漏洞来攻击该应用程序。特别是在使用内存不安全的语言(如C和C++)编写的程序中，缓冲区溢出等错误可用于堆栈崩溃和格式字符串等攻击。\n因此，未来还会有更多的缓解技术出现。在本文的第二部分中，我们将介绍安全编码、静态分析工具、运行时保护、模糊工具、权限和功能、强制访问控制、应用程序沙箱等等！\n关于作者：塞尔吉奥·普拉多(Sergio Prado)从事嵌入式系统工作已有20多年。如果你想了解更多关于他的作品，请访问关于页面或嵌入式Labworks网站。\n请通过电子邮件将您的意见发送到Embeddedbits.org上的Sergio，或者订阅时事通讯以接收最新消息。", "note_en": "Since this topic is quite extensive, I divided into two parts. In this first part, we will have a small introduction to security concepts and threat modeling and then focus on some mitigation techniques to improve the security of an embedded Linux device, including secure boot, code/data encryption and secure key storage.\n If you prefer a one hour talk instead of reading this article, you can also watch the webinar  “Introduction to embedded Linux security” I recorded for  Toradex. I also gave the same talk at Embedded Linux Conference North America 2020, but as I write this article it was not yet published on YouTube.\n    On the one hand, we have  owners, those who benefit from a product or service (user, manufacturer, business owner, etc). And owners want to protect  assets, anything that has some value in the product or service (data, code, reputation, etc).\n On the other hand, we have  threat actors, a person or thing (malicious hacker, government, etc) that can manifest a  threat, anything that is capable of acting against an asset in a manner that can result in harm.\n To manifest a threat, the threat actor will explore  vulnerabilities (weakness in the system) via an  attack vector, a method or pathway used by the threat actor to access or penetrate the target system.\n   In the end, is a cat-and-mouse game between owners and threat actors. How far will the owner go to protect the assets? How far will the threat actor go to compromise the assets? It really depends on the value of the assets. Indeed, the perception of value may not be the same for owners and threat actors.\n Identifying assets (and their value) to mitigate the risks of being compromised can be done in a process called  threat modeling.\n  Threat modeling is a process where potential threats can be identified, enumerated, and mitigations can be prioritized. It is basically a risk assessment process where you evaluate the value of your assets and the cost to protect them. The result of a threat modeling is the  threat model of your product.\n  There are several techniques and methodologies that can help during threat modeling, including STRIDE, DREAD, VAST, OCTAVE, and many others.\n To have a very basic introduction to the topic, let’s talk about STRIDE and DREAD.\n The  STRIDE model is a very useful tool to help classify threats. It was developed by Microsoft and the name is an acronym for the six main types of threats:  Spoofing,  Tampering,  Repudiation,  Information disclosure,  Denial of service and  Escalation of privileges. STRIDE can be used to identify all threats the assets of a system could be exposed to.\n  The  DREAD methodology is a tool for risk-assessing computer security threats. The name is an acronym for five categories of security threats:  Damage (how bad would an attack be),  Reproducibility (how easy is it to reproduce the attack),  Exploitability (how much work is it to launch the attack),  Affected users (how many people would be impacted) and  Discoverability (how easy is it to discover the threat).\n  While the STRIDE model helps to identify the threats, the DREAD methodology helps to rank them. For each threat in the system, you would go over each threat category and classify it in low (1 point), medium (2 points), or high (3 points). In the end, you would have a ranked list of threats and mitigation strategies. Example:\n  We can see that threat modeling will provide a very clear view of what we want to protect, how we plan to protect it, and associated costs. This is part of the  threat model of the product, which needs to be re-evaluated for every development cycle. As a result, the threat model will provide a prioritized list of threats to work on, so we can focus on implementing the mitigations to improve the security of the product.\n How to protect the integrity and authenticity of your code? How to ensure the privacy of the data? Where to store cryptographic keys? How to minimize the risks of an application to be exploited? Let’s try to answer all of those questions and many more, starting with secure boot!\n  How to make sure the code you are running was built by a trustworthy person or company? Implementing a  secure boot process.\n The objective of a secure boot process is to protect the integrity and authenticity of the code.\n Secure boot is usually based on the verification of digital signatures. An embedded Linux system normally has three major components: bootloader, kernel and root filesystem (rootfs). All these components are signed and the signatures are checked during boot.\n For example, some hardware mechanism can be used to check the signature of the bootloader, that will check the signature of the kernel, that will use a ramdisk image to check the signature of the root filesystem. Since we have one component checking the signature of the next one in the boot chain, this process is often called a  chain-of-trust.\n  Let’s take a look at a real example on an  NXP iMX6 device.\n Everything starts in the ROM code inside the SoC. On NXP iMX6, there is a hardware component called High Assurance Boot (HAB) that it is able to validate the signature of the first stage bootloader, making it possible to implement a secure boot process. The High Assurance Boot inside iMX6 devices can also be called the  Root of Trust, since if it is compromised, all the secure boot process is also compromised.\n The ROM code inside the iMX6 SoC, using the HAB component, will check the signature of the bootloader. For that, it is necessary to generate a pair of keys (public and private), sign the bootloader with the private key and store the public key inside the SoC. On iMX6, OTP fuses are used to store the keys. Actually, to make it less expensive, only the hash of the public key is stored in the SoC.\n When the bootloader boots (e.g.  U-Boot), it will have to check the signature of the Linux kernel. For that, it is common to use an image format called  FIT image. The FIT image is a container for multiple binaries with hashing and signature support, and usually contains the Linux kernel image, device tree files and an initial ramdisk. After generating a pair of keys, we need to sign the binaries inside the FIT image with the private key e configure U-Boot to use the public key to check the signature of the FIT image.\n After the kernel boots, it will run the  init program from the ramdisk image. The ramdisk will have the logic to verify the integrity of the final root filesystem before mounting it. There are some options to implement this. One common option is using the device-mapper verity ( dm-verity) kernel module. The  dm-verity kernel module provides integrity checking of block devices and requires a read-only rootfs (squashfs can be a good solution). Other approaches would be  IMA or  dm-integrity if you want a read-write root filesystem.\n   This is only one example of a secure boot implementation, although it could be applied to a different set of boards and ARM SoCs.\n  Secure boot vulnerabilities in the ROM code of several NXP devices (i.MX6, i.MX50, i.MX53, i.MX7, i.MX28 and Vybrid families) were  publicly disclosed on July 17th, 2017. And if your chain of trust is compromised, everything is compromised! So we need to be aware of these types of vulnerabilities (in this case, they were fixed with new silicon).\n While secure boot ensures authenticity and integrity, it does not protect the device from being counterfeited or threat actors from extracting code/data from the device. So if you want to protect your intellectual property or ensure data confidentiality, you will need to use encryption.\n   Data encryption is a common approach when you need to protect the privacy and confidentiality of the users. Data is any information generated during the executing of the device, including databases, configuration files, and so on.\n Code encryption depends on the situation, and encrypting the full root filesystem is not that common. Usually, most of the components are free and open source software, so there is nothing to hide. There is also the issue of GPLv3 and Tivoization (using any GPLv3 software will force you to provide a mechanism for the user to update the software, and that would make it more difficult if you are encrypting it). A more common use case is to encrypt only the applications you developed for the device. It’s usually where your intellectual property is.\n There are basically two main approaches to encryption in Linux:  full disk encryption and  file-based encryption.\n Full disk encryption provides encryption at the block level and the whole disk or a disk partition is encrypted. For that, we can use  dm-crypt, the Linux kernel’s device mapper crypto target.\n File-based encryption provides encryption at the file system level, where each directory may be separately and optionally encrypted with a different key. The two most common implementations of file-based encryption are  fscrypt and  eCryptFS. fscrypt is an API available on some filesystems like EXT4, UBIFS and F2FS, and eCryptFS is a more generic solution implemented as a layer that stacks on top of an existing filesystem.\n   Since an asymmetric key algorithm is too slow to be used in encryption, usually a symmetric-key algorithm is used in encryption. That means the same key is used for encryption and decryption, and the key should be available somewhere in the filesystem so the encrypted code/data can be decrypted.\n But we can’t just leave the key lying around in the filesystem, right?\n There are several cases where companies didn’t care about this and have paid the price. For example, the image below is from the first Xbox video game console.  Andrew “bunnie” Huang, a security researcher, was able to develop a specialized FPGA hardware to sniff the communication bus and extract the encryption keys from the device. Only because the keys were there, traveling in clear text in the communication bus, without any protection (by the way, Andrew Huang is the author of a very good book on hardware hacking called “Hacking the Xbox” that you can  download it for free on his website).\n  The conclusion is that the protection of the encrypted code/data is as secure as the protection of the key to decrypt it!\n   On a desktop or smartphone, the key used to encrypt the filesystem could be derived from a user password (passphrase) entered interactively. That’s how it works on Android smartphones for example.\n On an embedded system, usually we don’t have user interaction to derive the key from a password every time we boot the device. So the key should be stored encrypted in the filesystem or in secure storage. And we need hardware support for that.\n For example, NXP i.MX processors have a unique master key (pre-programmed by NXP) that can only be accessed by a special hardware module called  CAAM (Cryptographic Accelerator and Assurance Module). This hardware device could be used to encrypt the key and store it in the filesystem (this would have to be done during manufacturing). And during boot, the CAMM module would be used to decrypt the key and restore the plain key that would be used to decrypt the filesystem. Since the key inside the CAAM module is not accessible, the encrypted key is protected.\n If you don’t have security features available in the processor, you could achieve the same results with an external hardware like a  Secure Element or a  TPM device. These external devices usually provide secure storage, so they could be used to store a master key that could be used to encrypt/decrypt the filesystem encryption key. These devices also offer a lot of security features like random number generation, hash calculation, crypto and signing functions, etc.\n A Secure Element is a secure computing system. It is basically secure storage with its own secure applications (usually implemented using Java Card, but not necessary). What a secure element does is very open and depends on the implementation, but most of them implement the Public-Key Cryptography Standard 11 ( PKCS#11). Examples of Secure Elements are smart-cards and SIM-cards.\n A  TPM (Trusted Platform Module) is a specification and an international standard (ISO/IEC 11889). TPM is not a Secure Element, although it could be implemented inside one. It can be implemented in hardware or software, but most implementations are in hardware. It provides a set of limited security features defined by the standard, including secure storage and cryptographic functions.\n A third alternative for secure storage would be using a  Trusted Execution Environment. A TEE is an environment where the code executed and the data accessed is isolated and protected in terms of confidentiality (no one has access to the data) and integrity (no one can change the code and its behavior). A lot of devices around us make use of a Trusted Execution Environment, including smartphones, set-top-boxes, videogame consoles and Smart TVs. If you want more details about how a TEE works you can read my article “ Introduction to Trusted Execution Environment and ARM’s TrustZone”.\n In the end, if you care about encryption in your embedded Linux device, you will have to think about key storage and management from the beginning of the project.\n  So far we have talked about secure boot and encryption to improve the security of an embedded Linux device. But that is not enough. We should always think about security in layers, where each layer applies a mitigation technique that builds on top of other layers to improve the security of the device. And combining multiple mitigation techniques makes it harder for an attacker to compromise the device.\n Think about it. You can protect your code and data with secure boot and encryption, but if you are running an application with bugs that could be exploited, your assets are still at risk. If an application has attack vectors (user input, configuration files, network communications, etc), a bug could be used to exploit the application. Especially in programs written in memory unsafe languages like C and C++, where bugs like buffer overflows could be used in attacks like stack smashing and format strings.\n So there are more mitigation techniques to come. In the  second part of this article, we will cover secure coding, static analysis tools, runtime protections, fuzzing tools, permissions and capabilities, Mandatory Access Control, application sandboxing, and many more!\n    About the author: Sergio Prado has been working with embedded systems for more than 20 years. If you want to know more about his work, please visit the  About page or  Embedded Labworks website.\n      Please email your comments to sergio at embeddedbits.org or  sign up the newsletter to receive updates.", "posttime": "2020-11-08 09:38:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,linux,design,加密", "title": "了解如何设计和保护嵌入式Linux设备", "title_en": "Learn how to design and defend an embedded Linux device", "transed": 1, "url": "https://embeddedbits.org/introduction-embedded-linux-security-part-1/", "via": "", "real_tags": ["设计", "linux", "design", "加密"]}, {"category": "", "categoryclass": "", "imagename": "312f809d85b3e76be5abd058f68052f3.png", "infoid": 1033769, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工神经网络和深度学习已经成为许多当代机器学习实践者和研究人员的首选工具。但在很多情况下，你需要比基本统计分析更强大的东西，但又不像深度神经网络那样复杂或计算密集。历史为我们提供了许多可以追溯到多层感知器时代的方法。然而，尽管在使能技术方面取得了现代进步，但这些替代方法中的许多都在阴影下萎靡不振。其中一种方法被称为联想记忆(Associative Memory)。\n联想记忆(AM)是一种受同名心理概念启发的模式存储和检索系统。学习和记忆研究的关键发现表明，给定的刺激(物体、形状、单词)作为记忆存储在大脑中，并与相关刺激相关。当我们体验到触发AM的刺激时，我们可以回忆起与这些输入相关的记忆。你有没有闻过和/或尝过一道菜，并回忆起其他地方和时间的强烈记忆？听一首老歌，回想一下你第一次听到它的时候你在做什么，怎么样？你会听到这样一句话，“男人的一小步…”，你可以回忆起这句话的其余部分。这些都是AM的例子。\n当应用于计算机科学问题时，联想记忆有两种高级形式：自联想记忆和异联想记忆。虽然两者都能够在给定一组输入的情况下回忆模式，但当提供X的部分或噪声变体时，自联想记忆主要集中于回忆模式X。相比之下，异联想记忆不仅能够从它们的输入中回忆不同大小的模式，而且可以被用来在类别之间映射概念(因此称为异联想)。文献中的一个常见例子是异质联想记忆，它可能会回想起嵌入的动物概念“猴子”，因为嵌入的食物概念是“香蕉”。由于所有形式的AM都集中在被存储和检索的实际内容上，它们在文献中通常也被称为内容可寻址存储器(CAM)。\n虽然对原始AM系统进行了许多实现、扩展和改进，但当前的AM也包含一些共同的功能。与人工神经网络(ANN)类似，AM包括神经元的表示。然而，与当代的人工神经网络不同，AM神经元包含一个通常不需要可微的核函数，因为大多数AM算法没有反向传播步骤(尽管正如我们稍后将看到的，Kosko的BAM可能是一个例外)。取而代之的是，AM依赖于在前向训练过程中更新的权重，这些权重通过神经元传递，通常实施Hebbian风格的学习。这使得一些实现可以在相对简单的域上实现一次或几次学习(Acevedo-Mosqueda，2013)。相比之下，大多数深度学习方法都是使用经过深思熟虑的猜测、通过超参数进行的网格搜索和实践者的直觉的某种组合来调整的，对培训努力或网络容量没有理论上的上限。这通常需要大量的计算资源和时间来充分探索。公平地说，AUTO-ML方法正在解决这个问题，但它们需要时间和资源来进行培训。\n几个现代AM系统的一个有趣特性是能够通过超参数调优“忘记”旧模式。因此，随着新的培训数据的提供，这些系统是完全可更新的。这可能成为一个重要的设计考虑因素，因为任何给定的AM可以高精度和高召回率学习的模式数量在理论上是有限制的。这通常是模型中神经元数量的函数(Hopfield，1982；Chou，1988；Acevedo-Mosqueda，2013；Ritter&Amp；Sussner，1998)。一些异相联想记忆还允许相对简单的反向遍历。使用上面的例子，您可以训练AM将“香蕉”作为输入并返回“猴子”，然而，用“猴子”的概念反向查询AM会得到一个或多个与猴子相关的食物概念(例如“香蕉”)(Kosko，1988)。其他例子展示了如何优化AM以进行时间推理；如果提供了一系列输入模式，它们能够预测以下一个或多个模式。\n在计算机科学中，联想记忆最早是由Karl Steinbuch(1961)以LernMatrix的形式提出的。其他研究人员需要几年时间才能采用这一概念并对其进行扩展(Willshaw等人，1969；Kohonen，1974)，但主要突破是随着离散Hopfield网络(Hopfield，1982)和扩展连续变量(Hopfield，1984)的引入。随后对Hopfield网络的研究，与多层感知器相结合，为当今大多数有监督的机器学习研究奠定了基础。下面我们将探讨几个影响最大的\n斯坦布赫专注于永久性硬件存储器和模拟表示，D.J.Willshaw试图采用当时已知的全息图案存储和检索理论，并用全息概念扩展《勒恩矩阵》中提出的方法。威尔肖(1969)的贡献后来被称为相关记录仪或相关记录仪。相关记录仪可以用来描述一种他称之为联想网络的简单化神经网络模型。Wilshaw模型首先提出了一种量化的联想记忆方法，强调从成对的刺激中激活神经元，并基于McCulloch-Pitts(MCP)神经元模型(McCulloch&Amp；Pitts，1943)。威尔肖的方法还提出了可用容量的理论上限，以及一种能抵抗输入噪声的方法。\n虽然Correlograph是朝着更有效的LernMatrix软件实现迈出的一大步，但在AM研究中最有影响力的里程碑之一可能是Hopfield网络的出现(Hopfield，1982)。最初的Hopfield网络是一个随机模型，它可以利用伊辛自旋眼镜(Ising，1925；Wikipedia-Ising Model，2020)的记忆能力和通过模型权重调节的能量流来学习离散模式。伊辛模型的目的是摆脱纯粹的“电线和火力”机制。基于能量学的物理模型可能会让我们更好地考虑潜伏期和模式强化。最初的Hopfield网络还提出了一种异步更新方法，而不是纯粹的同步方法，更接近于生物神经活动。尽管如此，霍普菲尔德本人认为，由于当时的计算限制，这并不是特别实用。Hopfield还提出了他的网络中非退化模式存储和回忆的理论上限为0.15N，其中N是网络中神经元的数量。例如，如果你想在Hopfield网络中存储15个模式，并且具有可接受的退化和很强的抗噪能力，那么你至少需要100个神经元。他还基于随机更新率W{W|0.0≤W&lt；1.0}提出了一个合理的收敛迭代极限，该极限可以在整个模式集上进行~4/W次迭代后达到记忆稳定性。\n1984年，Hopfield提出了1982年模型的连续、确定性版本，取消了MCP神经元，使用了类似于感知器的新神经元(Rosenblatt，1957)。事实证明，这种方法对错误的适应性更强，并且支持连续(而不是离散)输入、权重和输出。大多数当代的AM方法至少部分基于Hopfield网络的这种变体。我们还看到它在现代神经网络中的影响，包括离散或连续的输入、权重和输出；感知器启发的神经元；以及模拟退火和梯度下降等基于能量的优化方法。\n大多数AM研究跟踪Hopfield的开创性工作，集中在自联想或异联想的单向方法上。当提供模式对(A，B)时，如果提供A作为输入，则这种网络只能在一个方向上训练以产生B。Kosko提出了双向联想记忆，它不仅可以学习A-→-B联想，还可以学习B-→-A联想(Kosko，1988年)。这是通过将传统的离散二进制值集合{0，1}变换成双极形式{-1，1}，计算相关矩阵，并用相关矩阵更新AM权重矩阵M来实现的。结果是，当在“向前”方向给出A时，AM可以产生B，但当在“向后”传递给B时，它可以利用权重矩阵的转置来产生A。\nBAM方法支持连续输入，只要值可以通过导数始终为≧0的单调函数进行转换即可。BAM的另一个有趣功能是，只需简单地更新权重矩阵，就可以忘记配对。在两个方向上也支持时间模式，因此使用A1→A2→A3(实质上是A1→A2，A2→A3)训练BAM可以反向遍历为A3→A2→A1。由于BAM模型所允许的灵活性和快速训练，它从一开始就被用作许多异联想方法的基础。从概念上讲，使用前向和后向传递来加强一对模式之间的关联，与现代BiLSTM和反向传播方法在循环深度学习模型中使用的方法没有什么不同。\n与此同时，Kosko正在开发BAM，以解决基于Hopfield的空管的单向缺点，而Kanerva正在努力解决容量问题。Hopfield网络的大小(神经元的数量)通常受到输入和输出向量大小的限制。例如，如果输入模式A总是10位，而输出模式B总是10位，那么神经元的最大数量\n到目前为止，我们研究的大多数AM模型都是基于某种形式的线性-线性或线性-非线性变换。他们使用MCP或感知器神经元方法。意识到这些基于神经元的模型存在局限性，Ritter和Sussner(1998)提出了形态神经网络，特别是形态自联想记忆，以解决传统Hopfield网络及其变体的容量和回忆缺陷。形态学方法涉及两个相关矩阵和一个基于格代数的非线性-非线性变换。一个矩阵使用最大化变换来构造，另一个矩阵使用最小化变换来构造。这与某些深度学习方法中的最小-最大合并没有什么不同。总而言之，这对矩阵提供了对记忆的侵蚀和膨胀阻力，以及无限的模式存储和回忆提供了准确的输入。回想一下，在相同条件下，Hopfield网络的理论最大容量为0.15N。形态AM的另一个优点是一次性学习，它不像Hopfield网络那样需要多次迭代训练才能收敛。与之前的许多AM方法不同，培训可以并行进行。\n到目前为止讨论的许多开创性的里程碑都是在2000年之前发表的，这大约是传统的具有反向传播的前馈多层感知器作为事实上的统计最大似然方法被研究人员扎根的时候。话虽如此，在一些活跃的研究中，AM仍然拥有强大的追随者。其中许多应用在图像识别和高性能模式匹配系统中。\nAM研究的一个有趣分支最初是由Yáñez-Márquez(2002)在他的名为Alpha-Beta联想记忆的博士论文中提出的。由于无法获得他的英文论文的公开副本，可获得的关于原始Alpha-Beta AM的最早出版物为这一讨论提供了基础(Yáñez-Márquez等人，2018年)。虽然Alpha-Beta AM基于Ritter&Amp；Sussner提出的形态AM，但它增加了非线性最小-最大运算，在最小-最大运算之前通过所谓的𝛼和𝛽运算对X和Y模式进行额外的预处理。\n还更新了矩阵对的更新规则，以支持新的𝛼和𝛽运算，其中在学习阶段使用𝛼运算，在调用期间使用𝛽运算。通过利用用于𝛼和𝛽运算的可能值的约束集合，可以调整对偶矩阵模型以获得更高的容量和单次学习，并且在理论上，在存在噪声(加法和减法)的情况下改进了比原始形态AM更好的模式匹配。Alpha-Beta AM及其变体已成功应用于图像处理、色彩匹配、污染物检测、生物信息学、软件工程和医疗支持系统，从2006年到2017年发表了100多篇论文；据作者称，截至2018年，该模型还有很长的路线图要走。不幸的是，2018年出版物中报道的研究团队网站目前无法访问，因此该小组的研究活动状况目前尚不清楚。\nAM研究的另一个耐人寻味的分支涉及通过所谓的分布式联想记忆进行扩展。早在20世纪90年代初的文献中就提到了一种用于数据库恢复的分布式AM，但几乎所有这些方法都涉及以一种能够抵抗故障硬件(包括Kanerva的SDM)的方式将AM存储分布在本地内存或持久性存储中的策略。在他的博士论文中，斯特恩提出了一种基于改进的布卢姆过滤器、Hopfield网络和纠错算法的分布式AM策略，这些算法理论上可以分布在一个网络上，并支持大规模并行训练和召回(2011)。虽然斯特恩提出这是对基本生物神经系统的计算模拟，但在这方面已经有了一些后续研究，这些研究扩展了他的布卢姆过滤器的变体，以及构建更大的类似AM的网络。\n近年来，深度学习从业者逐渐意识到，有时混合解决方案可以带来更快的学习速度和更好的结果。一个例子是深度信念网络，它有一个深度学习前端，最后一层被视为联想记忆(Hinton，2009)。该模型已成功地用于音频和NLP解决方案(Sarikaya等人，2014年；Mohamed等人，2012年；Mohamed等人，2011年)。最近，对Bert语言模型、转换器体系结构和相关注意机制的深入研究揭示了一个隐含的、嵌入的Hopfield类型的网络，许多人认为这是一种SOTA深度学习体系结构(Ramsoer等人，2020)。进一步的实验报道\nVeloxiti成立于1987年，基于基于知识的人工智能(KBAI)方法，特别是利用观察-定向-决策-行为(OODA)循环来自动化定义明确的领域中的挑战。大约在2010年，该公司开发了一种基于稀疏压缩矩阵的专有AM分类系统，该系统实现了以下独特功能：\n针对流实时传感器信号和非结构化文本数据等复杂数据类型的功能工程。\nVeloxiti的AM系统被应用于石油生产系统，用于实时异常检测和井况分类(Stephenson，2010)。它还被嵌入到OODA循环中，以在系统中的关键决策节点提供可解释的ML分类，以及在具有少量样本或一次性需求的系统中作为独立的分类器。(坦白地说，我受雇于Veloxiti，利用他们的AM系统来解决各种ML挑战，通常是在数据集太小而当代的ML方法无法有效的情况下。)。\n通过我们对联想存储器的历史、现状和未来方向的探索，我希望你对该领域的丰富性有一个新的认识，不仅适用于软件，也适用于各种应用的硬件。在应对新挑战时，许多机器学习从业者倾向于从基本的统计方法上升到高级方法，可能会略微涉足优化方法。\n.", "note_en": "Artificial neural networks and deep learning have taken center stage as the tools of choice for many contemporary machine learning practitioners and researchers. But there are many cases where you need something more powerful than basic statistical analysis, yet not as complex or compute-intensive as a deep neural network. History provides us with many approaches dating to the Multilayer Perceptron era. Yet many of these alternate methods languish in the shadows despite modern advances in enabling technologies. One such approach is called the  associative memory.\n  Associative memories (AM) are pattern storage and retrieval systems inspired by the psychological concept of the same name. As demonstrated by key findings in learning and memory research, a given stimulus (object, shape, word) is stored as a memory in the brain, and is associated with related stimuli. When we experience stimuli that triggers an AM, we can recall memories associated with those inputs. Have you ever smelled and/or tasted a dish and recalled strong memories of other places and times? How about listening to an old song and remembering what you were doing when you first heard it? You hear the phrase, “One small step for man…”, and you can recall the rest of the quote. These are all examples of AM.\n When applied to Computer Science problems, associative memories come in two high-level forms:  autoassociative and  heteroassociative memories. While both are able to recall patterns given a set of inputs, autoassociative memories are primarily focused on recalling a pattern X when provided a partial or noisy variant of X. By contrast, heteroassociative memories are able to recall not only patterns of different sizes from their inputs, but can be leveraged to map concepts between categories (hence “heteroassociative”). One common example from the literature is a heteroassociative memory that might recall the embedded animal concept of “monkey” given the embedded food concept of “banana&#34;. Since all forms of AM are focused on the actual content being stored and retrieved, they are also commonly referred to as  content-addressable memories (CAM) in the literature.\n  While there have been many implementations, expansions, and improvements to the original AM systems, there are common features that current AMs also incorporate. Similar to artificial neural networks (ANNs), AMs include the representation of a neuron. Unlike a contemporary ANN, however, an AM neuron encompasses a kernel function that is usually not required to be differentiable, as most AM algorithms do not have a backpropagation step (although as we’ll see later, Kosko’s BAM may be an exception). Instead,  AMs rely on weights that get updated during forward training passes through the neurons, often implementing a Hebbian style of learning. This allows some implementations to achieve one-shot or few-shot learning over relatively simple domains (Acevedo-Mosqueda, 2013). In contrast, most deep learning approaches are tuned using some combination of educated guesses, grid searches through hyperparameters, and practitioners’ intuition with no theoretical upper limit on training effort or network capacity. This often requires significant compute resources and time to fully explore. To be fair, auto-ML approaches are tackling this, but they take time and resources to train.\n An interesting feature of several modern AM systems is the ability to “forget” older patterns with hyperparameter tuning. It follows that these systems are fully updateable as new training data is made available. This can become an important design consideration, as there are theoretical limits on the number of patterns any given AM can learn with high precision and recall. This is often a function of the number of neurons in the model (Hopfield, 1982; Chou, 1988; Acevedo-Mosqueda, 2013; Ritter &amp; Sussner, 1998). Some herteroassociative memories also allow for relatively simple reverse traversal. Using the example above, you could train an AM to take “banana” as an input and return “monkey”, yet querying the AM in reverse with the concept of “monkey” results in one or more food concepts related to monkeys (e.g. “banana”) (Kosko, 1988). Other examples show how AMs can be optimized for temporal inference; provided a series of input patterns they are able to predict the following one or more patterns.\n  In computer science, associative memories were first proposed by Karl Steinbuch (1961) in the form of the  Lernmatrix. It would take several years before other researchers took up the concept and expanded on it (Willshaw et al, 1969; Kohonen, 1974), but the major breakthrough came with the introduction of both the discrete Hopfield network (Hopfield, 1982) and the expanded continuous variant (Hopfield, 1984). Subsequent research on Hopfield networks, in combination with the Multilayer Perceptron, laid the groundwork for most supervised machine learning research today. Below we explore a few of the highest-impact AM models and how they affected the state of the art.\n  The Lernmatrix as described by Karl Steinbuch (Steinbuch, 1961) was a hardware AM proposal using ferromagnetic circuitry and overlapping connectors to provide a crude heteroassociative memory between inputs and a classification pattern. It laid out the concepts of using a matrix of weighted “values” with some set update weight to strengthen the connections between associated bits in the input and classification patterns. This approach laid the groundwork for future hardware and software AM architectures.\n  It does appear the Lernmatrix had a more immediate impact on hardware as patents referencing “associative memories” began to surface at about the same time, and have been the subject of continued interest in the context of modern systems. There has even been an attempt to develop a theoretical framework for the Lernmatrix as a basis for expanding the original architecture (Sánchez-Garfias, 2005).\n   Where Steinbuch was focused on persistent hardware memories and analog representations, D. J. Willshaw attempted to take known holographic pattern storage and retrieval theories of the time and expand the approach proposed in the Lernmatrix with holographic concepts. Wilshaw’s (1969) contribution became known as the  correlograph or  correlogram. The correlograph can be used to describe a simplistic neural network model that he referred to as an  associative net. The Wilshaw model was the first to propose a quantitative approach to associative memory, emphasizing neuronal activation from paired stimuli and based on the McCulloch-Pitts (MCP) neuron model (McCulloch &amp; Pitts, 1943). Wilshaw’s approach also proposed a theoretical upper limit for useful capacity and an approach that was resistant to noise in inputs.\n     While the Correlograph was a large step towards more efficient software implementations of the Lernmatrix, probably one of the most influential milestones in AM research was the advent of the Hopfield network (Hopfield, 1982). The original Hopfield network was a stochastic model that could learn discrete patterns by utilizing the memory capacity of Ising spin glasses (Ising, 1925; Wikipedia - Ising model, 2020) and energy flows mediated via the model weights. The Ising model was meant to move away from a purely “wire and fire” mechanism. A physical model based on energetics might allow us to  take into account latencies and pattern reinforcement. The original Hopfield network also proposed an asynchronous update approach as opposed to a purely synchronous one, more closely mimicking biological neural activity. That being said, Hopfield himself suggested this was not particularly practical due to the compute limitations of the time. Hopfield also proposed a theoretical upper limit for non-degraded pattern storage and recall in his network is 0.15N where N is the number of neurons in the network. For example, if you wanted to store 15 patterns in a Hopfield network with acceptable degradation and strong resistance to noise, you would need at least 100 neurons. He also proposed a reasonable convergence iteration limit based on the stochastic update rate W { W | 0.0 ≤ W &lt; 1.0}, which can achieve memory stability after ~4/W iterations through the entire pattern set.\n In 1984, Hopfield proposed a continuous, deterministic version of the 1982 model that did away with the MCP neuron and used a new neuron similar to a Perceptron (Rosenblatt, 1957). This approach proved to be even more resilient to errors and supported continuous (as opposed to discrete) inputs, weights, and outputs. Most contemporary AM approaches are based at least in part on this variant of the Hopfield network. We also see its influence in modern ANNs with discrete or continuous inputs, weights, and outputs; Perceptron-inspired neurons; as well as energy-based optimization approaches like simulated annealing and gradient descent.\n   Most AM research following Hopfield’s seminal works focused on either autoassociative or heteroassociative unidirectional approaches. When presented with a pattern pair (A, B), such networks can only be trained in one direction to produce B if A is provided as an input. Kosko introduced the bidirectional associative memory (BAM) which allowed learning of not only the A→B association, but also the B→A association (Kosko, 1988). This was achieved by transforming the conventional discrete binary value set {0, 1} to a bipolar form {-1, 1}, calculating a correlation matrix, and updating the AM weight matrix M with the correlation matrix. The result was an AM that could produce B when given A in the “forward” direction but could leverage the transpose of the weight matrix to also produce A when given B in a “backward” pass.\n The BAM approach supports continuous inputs as long as the values can be transformed via a monotonic function whose derivative always yields a value ≧ 0. Another interesting feature of the BAM is the ability to forget pairs with a simple update to the weight matrix. Temporal patterns are also supported in both directions, so training a BAM with A1→A2→A3 (essentially A1→A2, A2→A3) can be traversed in reverse as A3→A2→A1. Due to the flexibility and rapid training allowed by the BAM model, it has been used as the base for many heteroassociative approaches since its inception. Conceptually, the use of forward and backward passes to reinforce the association between a pair of patterns is not dissimilar to modern BiLSTM and backpropagation approaches used in recurrent deep learning models.\n  At the same time Kosko was developing the BAM to address the unidirectional shortcomings of Hopfield-based AMs, Kanerva was working towards addressing the capacity issues. Hopfield network sizes (the number of neurons) are typically limited by the input and output vector sizes. For example, if input pattern A is always 10 bits, and output pattern B is always 10 bits, then the maximum number of neurons in a Hopfield network is 10 x 10 = 100 neurons (N). With a capacity of 0.15N, this means the network can only hold up to 0.15 x 100 ≈ 15 patterns before degradation becomes an issue. Kanerva (1988) proposed a mechanism by which the capacity of a Hopfield network could be scaled without severe performance degradation, independent of its stored pattern sizes. Kanerva named this approach Sparse Distributed Memory (SDM).\n The premise for the SDM is that given a large enough virtual address space, the effective memory capacity can be increased. This increase in capacity corresponds to decreased collisions within a Hopfield network, while the virtual address space is mapped to a smaller physical address space via Hamming distance spheres. Shortly after Kanerva’s publication, Chou (1988) produced an exhaustive proof of the theoretical capacities and limitations of the Kanerva SDM. While framed as an artificial neural network, the incremental contributions over Hopfield do not constitute a trainable network. Rather, the Kanerva SDM is more a preprocessing function for the patterns to be stored and retrieved within the embedded Hopfield component (Keeler, 1986).\n Several variants of the SDM approach appeared shortly after; some were independently discovered during the same timeframe, and others built on Kanerva’s work (1992):\n    So far most of the AM models we’ve explored have been based on some form of linear-linear or linear-nonlinear transformation. They use either the MCP or Perceptron neuron approach. Recognizing that there are limitations to these neuron-based models, Ritter and Sussner (1998) proposed morphological neural networks, and specifically a morphological autoassociative memory to address capacity and recall shortcomings of the traditional Hopfield network and its variants. Morphological approaches involve two correlation matrices and a nonlinear-nonlinear transformation based on lattice algebra. One matrix is constructed using a maximizing transform, the other matrix a minimizing transform. This is not unlike min-max pooling in some deep learning approaches. Taken together, this pair of matrices provided erosion and dilation resistance to the memories as well as unlimited pattern storage and recall provided exact inputs. Recall that Hopfield networks have a theoretical maximum capacity of 0.15N under the same conditions. Another benefit of the morphological AM is one-shot learning, which does not require multiple iterations of training for convergence as in a Hopfield network. Unlike many prior AM approaches, training can be carried out in parallel.\n    Many of the groundbreaking milestones discussed so far were published prior to the year 2000, which is around the time the conventional feed-forward multilayer perceptron with backpropagation took root as the de facto statistical ML approach by researchers. That being said, there have been pockets of active research where AMs have continued to have a strong following. Many of these are in image recognition and high-performance pattern matching systems.\n  One intriguing offshoot of AM research was initially proposed by Yáñez-Márquez (2002) in his Ph.D. thesis, dubbed the Alpha-Beta Associative Memory. Due to the unavailability of a public copy of his thesis in English, the earliest available publication regarding the original Alpha-Beta AM provides the basis for this discussion (Yáñez-Márquez et al, 2018). While the Alpha-Beta AM was based on the morphological AM proposed by Ritter &amp; Sussner, it augments the nonlinear min-max operations to additionally preprocess the X and Y patterns through so-called 𝛼 and 𝛽 operations prior to the min-max operations.\n  Rules for updating the pair of matrices were also updated to support the new 𝛼 and 𝛽 operations where the 𝛼 operation was used during the learning phase, and the 𝛽 operation was used during recall. By utilizing constrained sets of possible values for the 𝛼 and 𝛽 operations, the dual-matrix model could be tuned for higher capacity and one-shot learning, and in theory, improved pattern matching in the presence of noise (both additive and subtractive) over the original morphological AM. The Alpha-Beta AM and its variants have been successfully used in image processing, color matching, pollutant detection, bioinformatics, software engineering, and medical support systems, resulting in over 100 publications from 2006-2017; according to the authors, the model had a long roadmap ahead of it as of 2018. Unfortunately, the research team’s website as reported in the 2018 publication is not currently available, so the status of the group’s research activities is unknown at present.\n  Another intriguing offshoot of AM research involves scaling via so-called distributed associative memories. There is mention in the literature dating back to the early 1990s regarding a form of distributed AM for database resilience, but almost all of those approaches involved strategies to distribute the AM storage throughout local memory or persistent storage in a way that was resistant to faulty hardware, including Kanerva’s SDM. In his Ph.D. thesis, Sterne proposed a distributed AM strategy based on a combination of modified Bloom filter, Hopfield network, and error correction algorithms that could in theory be distributed across a network and supported massively parallel training and recall (2011). While Sterne was proposing this as a computational analogue of basic biological neural systems, there has been some follow-on research in this vein that expanded on his variant of the Bloom filter as well as constructing larger AM-like networks.\n  In recent years, deep learning practitioners have come to realize that sometimes hybrid solutions yield faster learning and better results. One example is the deep belief network, which has a deep-learning front-end and the final layers are treated as an associative memory (Hinton, 2009). This model has been used on audio and NLP solutions with great success (Sarikaya et al, 2014; Mohamed et al, 2012; Mohamed et al, 2011). More recently, a deep dive into the BERT language model, transformer architecture, and related attention mechanisms uncovered an implicit, embedded Hopfield-type network in what many consider a SOTA deep learning architecture (Ramsauer et al, 2020). Further experiments proved the usefulness of Hopfield networks when blended into certain types of deep learning architectures; a PyTorch layer implementation was recently released as a result of this research (Ml-jku/hopfield-layers, 2020).\n  Many companies don’t divulge their “secret sauce” when it comes to machine learning or AI unless it’s the new hotness. As a result, documented use cases of AMs outside of academia or R&amp;D are few and far between. Two companies that have openly documented use of AM approaches in recent years are Saffron Technology and Veloxiti.\n Saffron Technology was founded in 1999 by Dr. Manuel Aparicio, an AM evangelist and researcher. The company developed AM approaches to build non-deep-learning systems to compete directly against IBM Watson and Grok. Their systems were also used in DARPA projects to construct knowledge bases for the intelligence community. Saffron was purchased by Intel in 2015, but quietly shuttered in late 2018 (Wikipedia - Saffron Technology, 2020). It is unknown whether Saffron’s software is still in use by Intel. Apart from the above-referenced Wikipedia article and a handful of patent filings, there is no publicly available material regarding the details of Saffron’s systems.\n Veloxiti was founded in 1987 based on knowledge-based AI (KBAI) approaches, specifically leveraging the Observe-Orient-Decide-Act (OODA) loop to automate challenges in well-defined domains. Around 2010 the company developed a proprietary AM classification system based on sparse compressed matrices that implemented the following unique features:\n Feature engineering for complex data types like streaming real-time sensor signals and unstructured textual data\n Veloxiti’s AM system was applied to petroleum production systems for real-time anomaly detection and classification of well conditions (Stephenson, 2010). It has also been embedded within OODA loops to provide explainable ML classifications at key decision nodes in a system, as well as a standalone classifier in systems with few-sample or one-shot requirements. (In full disclosure, I am employed by Veloxiti and leverage their AM system to address various ML challenges, often where datasets are too small for contemporary ML approaches to be effective.)\n  Through our exploration of the history, current state, and future directions of associative memories, I hope you have a new appreciation for the richness of the field, and the applicability not only to software but also hardware for a wide variety of applications. When tackling a new challenge, many machine learning practitioners tend to work their way up from basic statistical methods to advanced ones, maybe dabble a bit in optimization approa\n......", "posttime": "2020-11-08 09:38:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联想,forget,方法", "title": "别忘了联想记忆", "title_en": "Don’t Forget About Associative Memories", "transed": 1, "url": "https://thegradient.pub/dont-forget-about-associative-memories/", "via": "", "real_tags": ["联想", "forget", "方法"]}, {"category": "", "categoryclass": "", "imagename": "f0d73a86e6306551e03acd9b170750f8.jpg", "infoid": 1033768, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奇怪的是，萨勃拉曼尼亚似乎对霍尔丹的本科时代不感兴趣，他只用了不到两页的篇幅。从克拉克的书中可以了解到更多关于他生命中这一时期的信息。第一年后，霍尔丹在数学方面获得了第一名。他还成为一名出版的合著者，为他和父亲为生理学杂志撰写的一篇论文贡献了一些数学分析。他在牛津比在伊顿公学快乐得多，交了几个好朋友，包括奥尔德斯·赫胥黎(Aldous Huxley)和迪克·米奇森(Dick Mitchison)，他们即将迎娶杰克的妹妹娜奥米(Naomi)。(她后来出版了90多本书，包括历史小说和奇幻作品，并与她著名的哥哥一样出名。)。在他的第二年，霍尔丹从数学转到了伟大的学科。这似乎是一件奇怪的事情，但正如克拉克所说，“与经典作品相伴，是在原本黯淡的生活中的一种慰藉。”它还教会了他“写作要清晰、通俗易懂，并且要有一个对他有利的经济”。原计划是继伟人之后转行生理学，但在1914年8月4日，当霍尔丹得知自己以第一名毕业时，用他后来的话说，这个消息“多少被其他事件盖过了风头”。霍尔丹曾是牛津军官训练团的一名热情成员，战争一宣战，他就自愿参军，要求加入苏格兰黑色守望团(Black Watch)。他的愿望实现了，经过四个月的训练，他被派往法国，成为该团第一营的中尉。他被任命为该营的战壕迫击炮军官，带领一小群人向敌人的战壕投掷手榴弹。虽然这很危险，也很可怕，但他从来没有这么开心过。他一直喜欢爆炸，现在他发现受到攻击和攻击令人毛骨悚然。“我很清楚，”他后来写道，“我可能会死在这些平淡无奇的田野里，那里正在发生着对人类价值的巨大浪费。”尽管如此，我还是觉得这段经历令人愉快。“。他在士兵和他的上级军官中很受欢迎。黑格将军形容他是“我军队里最勇敢、最肮脏的军官”。[另见：赫敏·李谈如何写人生]来自西线的霍尔丹一直与娜奥米保持通信，讨论他们共同进行的老鼠遗传学实验。其结果是一篇发表在《遗传学》杂志上的合著论文，他夸口说，这使他成为“唯一一位站在黑色守望者前沿完成科学论文的军官”。在炮火中受伤后，霍尔丹被送回苏格兰，在那里他建立了一所轰炸学校，教黑卫队士兵如何使用手榴弹。1916年秋，他被派往美索不达米亚。在那里，他被一枚英国炸弹炸伤，使他在战争剩下的时间里无法现役。他在印度度过了最后两年，在那里他被送去疗养。到他回国时，他已经对这个国家、这个国家的人民和这个国家的文化产生了深深的、持久的热爱。战争结束前，霍尔丹获得了牛津大学新学院的奖学金，他于1919年开始工作。他在那里讲授生理学，这是他自己从未正式学习过的。四年后，他转到剑桥三一学院(Trinity College)，担任生物化学专业的讲师。在这一职位上，他发表了有关酶的重要研究成果，但他的研究越来越专注于利用数学来解决理论遗传学中的问题。这项研究的结果包含在他在1924年至1934年间发表的十篇系列论文《自然选择理论的数学贡献》中，许多科学家认为这是他最重要的工作。正是在这些论文中，他为如何将孟德尔遗传学融入达尔文进化论的问题提供了解决方案。格雷戈尔·孟德尔(Gregor Mendel)现在被公认为遗传学的创始人，他于1884年在相对默默无闻的情况下去世。直到20世纪，他对遗传法则的研究的重要性才得到承认。1886年，他发表了他对不同高度、豆荚形状、种子颜色等豌豆植株遗传特性的艰苦观察结果。他发现，如果你将一株黄色的豌豆与一株绿色的豌豆杂交，那么产生的植株都将是黄色的。然而，在下一代，每种绿色植物将混合三种黄色植物。这就产生了“隐性”和“显性”特征理论，这是现在每个生物学校的学生都熟悉的。霍尔丹解决的问题是如何将这一理论融入达尔文的自然选择理论。他提供的是一个数学模型，它模拟了孟德尔的遗传定律和达尔文的“适者生存”的概念。生物学家朱利安·赫胥黎(奥尔德斯的兄弟，霍尔丹的朋友)将这种解决方案命名为“", "note_en": "Subramanian seems strangely uninterested in Haldane’s time as an undergraduate and devotes less than two pages to it. Far more about this period in his life can be learned from Clark’s book. After his first year, Haldane gained a First in maths. He also became a published co-author, having contributed some mathematical analysis to a paper he and his father wrote for the  Journal of Physiology. He was much happier at Oxford than at Eton and made several good friends, including Aldous Huxley and Dick Mitchison, who was to marry Jack’s younger sister, Naomi. (She went on to publish more than 90 books, including works of historical fiction and fantasy, and became as well known as her celebrated brother.) For his second year, Haldane switched from mathematics to Greats. This might seem an odd thing to do, but, as Clark says, “the companionship of the classics was to be a solace in an otherwise aesthetically bleak life”. It also taught him “to write clearly, comprehensibly and with an economy that was to serve him well”. The plan was to switch to physiology after Greats, but when, on 4 August 1914, Haldane learned he had graduated with a First, the news was, as he later put it, “somewhat overshadowed by other events”. Haldane, who had been an enthusiastic member of the Officers’ Training Corps at Oxford, volunteered for the army as soon as war was declared, asking to serve with the Scottish regiment, the Black Watch. His wish was granted and, after four months of training, he was posted to France as a lieutenant with the regiment’s First Battalion. He was made the battalion’s trench mortar officer, leading small groups of men to throw hand-bombs into enemy trenches. Though it was dangerous and frightening, he had never been happier. He had always enjoyed explosions, and now he discovered that he found coming under fire and attacking others thrilling. “I was well aware,” he later wrote, “that I might die in these flat, featureless fields, and that a huge waste of human values was going on there. Nevertheless, I found the experience enjoyable.” He was popular with the men and with his superior officers. General Haig, no less, described him as “the bravest and dirtiest officer in my army”. [see also:  Hermione Lee on how to write a life] From the Western Front, Haldane kept up a correspondence with Naomi about experiments they were conducting together on the genetics of mice. The result was a jointly authored paper that appeared in the  Journal of Genetics, making him, he boasted, “the only officer to complete a scientific paper from a forward position of the Black Watch”. After being injured by artillery fire, Haldane was sent back to Scotland, where he set up a Bombing School to teach Black Watch soldiers how to use grenades. In the autumn of 1916, he was sent to Mesopotamia. There he was wounded by a British bomb, keeping him out of active service for the rest of the war. He spent the last two years of it in India, where he was sent to recuperate. By the time he returned home, he had acquired a deep and abiding love of the country, its people and its culture. Before the end of the war, Haldane had been offered a fellowship at New College, Oxford, which he took up in 1919. There he lectured on physiology, which he had never formally studied himself. Four years later he moved to Trinity College, Cambridge, as reader in biochemistry. In that position he published important work on enzymes, but his research became increasingly focused on using mathematics to address problems in theoretical genetics. The results of this research are contained in a series of ten papers, “Mathematical Contributions to the Theory of Natural Selection”, which he published between 1924 and 1934 and which many scientists regard as his most important work. It was in these papers that he provided his solution to the problem of how to incorporate Mendelian genetics into Darwin’s theory of evolution. Gregor Mendel, now recognised as the founder of the science of genetics, died in 1884 in relative obscurity. Only in the 20th century was the importance of his investigations of the rules of heredity acknowledged. In 1886, he published the results of his painstaking observations on the inherited characteristics of pea plants of various heights, pod shapes, seed colours, etc. He discovered that if you cross breed, say, a yellow pea plant with a green one, then the resulting plants will all be yellow. However, in the next generation, there will be a mixture of three yellow plants to every green one. This gave rise to the theory of “recessive” and “dominant” traits, familiar now to every school student of biology. The problem Haldane tackled was how to incorporate this theory into Darwin’s theory of natural selection. What he provided was a piece of mathematics that modelled Mendel’s laws of heredity and the Darwinian notion of “the survival of the fittest”. The biologist Julian Huxley (brother of Aldous and friend of Haldane) named this solution “the modern synthesis”. **** During this period, Haldane began his career as a populariser of science. His slim book,  Daedalus, or Science and the Future, was published in 1924 and was a huge success, going through five impressions in its first year. Among its most enthusiastic readers was a young married woman called Charlotte Burghes, who was writing a novel set in a world in which the human race would be able to choose the sex of its children. She wanted to meet Haldane to discuss whether the science in her novel was plausible. Receiving no reply to a letter she sent, she went straight to Trinity to interview him. Within a year, she divorced her husband and married Haldane. So began a new era in Haldane’s life in which politics played an increasingly important part. His and Charlotte’s home became a meeting place for liberal and socialist students and staff, and, encouraged by Charlotte, Haldane became increasingly left wing. In 1928, they visited the Soviet Union, where Haldane became friends with Nikolai Vavilov, later one of Lysenko’s victims. On his return, Haldane spoke with great warmth about the USSR, though he did not join the Communist Party until 1942. In 1933, Haldane moved from Cambridge to University College London to become its professor of genetics (later professor of biometry). In the same year, Hitler became chancellor of Germany. “I began to realise,” Haldane later wrote, “that even if professors leave politics alone, politics won’t leave professors alone.” As the 1930s wore on, he was pushed further into politics and yet further to the left. During the Spanish Civil War, he advised the republicans on precautions against gas attack and visited the front as an observer, seeing for himself the devastating effects of air raids. In 1937, he became the science correspondent of the  Daily Worker. Between then and 1950 he contributed nearly 350 articles, mixing scientific popularisation with propaganda. Subramanian is evidently very interested in Haldane’s politics, but he does not quite succeed in making sense of them. Perhaps no sense can be made of them. Perhaps it will forever remain a mystery why someone as intelligent and critical as Haldane would declare allegiance to the Soviet Union and the Communist Party, even after the purges, the show trials, the non-aggression pact with the Nazis, the attacks on scientists and the repression of freedom. We should, however, bear in mind that he was only a member of the party for eight years. He was not, as is often said, an apologist for Lysenko. On the contrary, the Lysenko affair clearly shook him. Largely because of it, he distanced himself from communism after 1948 and left the party altogether in 1950. He remained fiercely left wing, however, and in 1956 he announced publicly that, together with his second wife Helen, he was leaving Britain for India because of the Suez Crisis. This was not the real reason. Neither was it true, as he said later, that he was settling in India in order to be free of the tyranny of wearing socks (“60 years in socks is enough”). He was drawn to India because of its socialism, its culture and its climate. He died there in 1964 of a cancer that he immortalised in a poem entitled “Cancer’s a Funny Thing” which Subramanian reproduces in full, beginning: “I wish I had the voice of Homer/To sing of rectal carcinoma.” For all its faults, Subramanian’s biography does allow Haldane’s booming voice to be heard, and, for all Haldane’s faults, it remains a voice worth listening to.  A Dominant Character: The Radical Science and Restless Politics of JBS Haldane  \tSamanth Subramanian   Atlantic, 400pp, £20", "posttime": "2020-11-08 09:37:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jbs,haldane,遗传学", "title": "JBS霍尔丹：几乎无所不知的人", "title_en": "JBS Haldane: the man who knew almost everything", "transed": 1, "url": "https://www.newstatesman.com/culture/books/2020/11/jbs-haldane-man-who-knew-almost-everything", "via": "", "real_tags": ["jbs", "haldane", "遗传学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033767, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从命令行使用Perl进行文本处理的基于示例的指南", "note_en": "Example based guide for text processing with Perl from the command line", "posttime": "2020-11-08 09:37:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "liners", "title": "Perl One-liners Cookbook", "title_en": "Perl One-Liners Cookbook", "transed": 1, "url": "https://learnbyexample.github.io/learn_perl_oneliners/one-liner-introduction.html", "via": "", "real_tags": ["liners"]}, {"category": "", "categoryclass": "", "imagename": "b62c33571d3f0fb647d147f65b7c65c7.gif", "infoid": 1033765, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "青少年在大流行期间的睡眠时间比正常上学时间晚2小时。\n在2020年新冠肺炎疫情爆发期间，高中关闭或过渡到远程教学。本研究的目的是描述与新冠肺炎有关的学校停课对典型发育期青少年睡眠行为的影响。\n本研究于2020年4月28日至6月3日期间，对45名青少年进行了一对一半结构化电话访谈，并对其进行了定性研究。\n新冠肺炎疫情导致学校停课，这一“自然实验”导致典型发育中青少年的睡眠时间缩短了2小时，睡眠时间延长，睡眠质量提高，白天困倦程度减少。\n这些发现与之前的研究一致，研究表明，推迟高中开学时间可能是延长睡眠时间、提高睡眠质量、减少白天困倦、减轻青少年学年压力的有效方法。许多国家都在想方设法减少学生在学校里的互动次数，这样身体上的距离就变得可行了，而青少年睡眠延迟的生物学可能会提供一个负担得起的解决方案。例如，与年龄较小的青少年相比，年龄较大的青少年通过推迟开学时间来错开入学时间，可以同时减少上学的总人数。这一策略提供了一种实用的方法，可以降低学校密度和学生之间的互动次数，从而减少新冠肺炎在学校的潜在传播，同时改善青少年的睡眠健康。\n视图摘要", "note_en": "Adolescents&#39; sleep schedule during the pandemic was 2 h later than during regular school times.\n During the outbreak of the COVID-19 pandemic in 2020, high schools closed or transitioned to remote teaching. The aim of this study was to describe how the COVID-19 related school shutdown impacted the sleep behaviors of typically developing adolescents.\n A qualitative study was conducted between April 28 and June 3, 2020 with 45 adolescents using one-on-one semi-structured phone interviews.\n The “natural experiment” caused by the shutdown of schools due to the COVID-19 pandemic led to a 2-h shift in the sleep of typically developing adolescents, longer sleep duration, improved sleep quality, and less daytime sleepiness compared to those experienced under the regular school-time schedule.\n These findings are consistent with previous studies showing that delaying high school start times could be an effective way to extend sleep duration, improve sleep quality, reduce daytime sleepiness and lower adolescents&#39; stress during the school year. As many countries look for ways to reduce the number of interactions between students in schools so that physical distancing is feasible, following teens’ delayed sleep biology could offer an affordable solution. For example, staggering arrival times by delaying school start time for older adolescents compared with younger adolescents can reduce the total number of students attending school at the same time. This strategy offers a practical means to reduce school density and the number of interactions between students which are needed to reduce the potential transmission of COVID-19 in schools, while improving adolescents sleep health.\n      View Abstract", "posttime": "2020-11-08 09:37:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "停课,school,青少年", "title": "学校停课对青少年睡眠的影响：一项自然实验", "title_en": "The impact of school shutdown on sleep in adolescents: a natural experiment", "transed": 1, "url": "https://www.sciencedirect.com/science/article/pii/S1389945720304184", "via": "", "real_tags": ["停课", "school", "青少年"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代营销完全是关于数据的，无论你怎么努力，你都不可能花时间在网上与营销人员打交道，而不是被没完没了的想法、操作指南、电子书或其他关于我们需要如何跟踪、衡量和计算每一件小事的废话所左右。\n我们有点击率，印象，转换率，打开率，ROA，页面浏览量，弹跳率，ROI，CPM，CPC，印象份额，平均位置，会话，渠道，登录页面，KPI在永不结束的KPI之后。\n如果所有这些狗屎都有意义，而且我们知道如何解读，那就好了。但它不会，我们也不会。\n现实要简单得多，因此也复杂得多。我们大多数人都不了解数据是如何收集的，这些机制是如何工作的，最重要的是，它们在哪里以及如何不工作。\n36%的英国人使用广告拦截程序，这意味着你基于Javascript的网站跟踪是毫无意义的。\n电子邮件打开率实际上并不表示电子邮件已打开，只是表示向服务器发出了请求。\nFacebook和其他广告交易所内部的黑匣子给你提供了关于你的广告表现的彻头彻尾的错误数据。\n即使我们知道数据是如何收集的，它意味着什么，以及它实际上在跟踪什么，我们中的大多数人都没有分析我们收集的数据的技术诀窍1。我这么说并不是想取笑任何人，但我们确实需要一个现实的检验。\n然后你看。我懂了。拥有有形的数据可以让我们证明我们正在做我们的工作，我们正在努力衡量和改进我们正在做的事情。但正如鲍勃·霍夫曼(Bob Hoffman)正确指出的那样--这不是打造品牌的方式。\n这些数字往往是我们证明自己的理由、获得更多预算以及在极端情况下继续受雇的全部证据。在我们能够将营销与目光短浅、见多识广的决策分开之前，我们将一直处于这种混乱状态。直到领导者能够凭借他们的信念和经验来领导，而不是基于数据的不足而对自己和他们的员工进行事后猜测。\n我不知道走出困境的路是什么，也不知道通往成功的路是什么样子。我只知道这个。\n来吧，问问普通营销者如何正确计算A/B测试的样本大小，或者卡方检验是什么，甚至什么是力量，为什么它很重要。-↩", "note_en": "Modern marketing is all about data and however hard you might try, you can&#39;t spend any time around marketers online without  being  subjected  to  endless  think  pieces, how-to guides, ebooks or other dreck about how we need to track and measure and count every little thing.\n We&#39;ve got click rates, impressions, conversion rates, open rates, ROAS, pageviews, bounces rates, ROI, CPM, CPC, impression share, average position, sessions, channels, landing pages, KPI after never ending KPI.\n That&#39;d be fine if all this shit meant something and we knew how to interpret it. But  it doesn&#39;t and  we don&#39;t.\n The reality is much simpler, and therefore much more complex. Most of us don&#39;t understand how data is collected, how these mechanisms work and most importantly where and how they  don&#39;t work.\n 36% percent of people in the UK use an adblocker, which means your javascript based website tracking is meaningless\n Email open rates  don&#39;t  actually indicate that an email was opened, merely that a request was made to a server\n The black boxes inside Facebook and other ad exchanges give you  flat out wrong data about how your ads are performing\n And even if we know how the data is collected, what it means and what it&#39;s actually tracking, most of us don&#39;t have the technical chops to analyse the data we&#39;ve collected  1. I don&#39;t mean to rag on anyone by saying this, but we do need a reality check.\n And look. I get it. Having tangible data allows us to demonstrate that we&#39;re doing our job and we&#39;re trying to measure and improve what we&#39;re doing. But as Bob Hoffman rightly points out -  that&#39;s not how brands are built.\n The numbers are often all we have to prove our case, to get more budget and in extreme cases, to continue to stay employed. We&#39;ll remain in this mess until we can separate marketing from short sighted and poorly informed decision making. Until leaders can lead on the strength of their conviction and experience instead of second guessing themselves and their staff based on the inadequacy of data.\n I don&#39;t know what the way out of this mess is, or what the path to success looks like. All I know is this.\n  Go ahead, ask the average marketer how to properly calculate the sample size for an A/B test, or what a Chi-Squared test is, or even what power is and why it&#39;s important.  ↩", "posttime": "2020-11-08 09:36:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "营销者,addicted,数据", "title": "营销者沉迷于糟糕的数据", "title_en": "Marketers are addicted to bad data", "transed": 1, "url": "https://www.jacquescorbytuech.com/writing/marketers-addicted-bad-data", "via": "", "real_tags": ["营销者", "addicted", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎!。你之所以来到这里，可能是因为你读了这条推文，然后报名听了我们如何运营创始人主导的销售额，在不到两年的时间里从0美元增长到200万美元的更长版本。\n这本指南是为那些刚刚起步的B2B公司的创始人准备的，在那里你销售的产品是250美元/月或更高。\n如果你经营的是一家机构，或者是一家B2C公司，或者销售的是250美元/月的产品，你也可能会在某些部分找到价值。如果你是一名B2B销售主管，或者是一名客户经理，或者只是想了解更多关于销售的知识，你可能会发现自己的价值所在。\n就像许多其他事情一样--销售、营销、定价和入职都是根据具体情况而定的。这不是建议，也不是说去做这件事，而是说，这是一个在特定时刻，对我们来说效果很好的策略，对于某一特定的产品来说，这是一种很好的策略。(译者注：这不是建议，也不是建议，也不是去做这件事，而是指在特定的时间，用一种特定的产品，对我们来说效果很好)。\n销售应该由至少一位创始人推动，直到你停止了解客户的新情况、你正在解决的问题以及如何定位你的解决方案。\n在我们的上一家公司，我们的三位创始人都在不同程度上参与了近两年的销售工作。\n没有人会比创始人更了解产品和它解决的问题。如果事实并非如此，那么你的问题就比销售更大了。\n销售对话也是你最重要的反馈循环。作为创始人，你需要坐在前排来推动产品、定价和营销决策。\n我做了很多销售。我曾在几家公司工作过，创建过，创办过，还出售过。创业公司的一切都是销售：你在向客户销售产品或服务，你在重新推荐最优秀的人才加入你的团队，你在向投资者推销你的愿景，你在向你的团队推销愿景，你正在达成关键的合作伙伴关系。\n这不是我一个人写的。我们在我的新公司Laskie的团队鼓励我写这篇文章，并帮了我很大的忙。", "note_en": "Welcome! You&#39;re probably here because you read  this tweet and then signed up to hear the longer-form version of how we ran founder-led sales to grow from $0 to $2m ARR in under 2 years.\n This guide is for founders who have a B2B company that is just starting out, where you&#39;re selling a product that is $250/mo or more.\n You might also find value in certain sections if you&#39;re running an agency, or a B2C company, or are selling a product &lt;$250/mo. You might find value if you&#39;re a B2B sales leader, or an account executive, or are just trying to learn more about sales.\n Like many other things - sales, marketing, pricing, and onboarding are all really case-dependent. This isn&#39;t meant to be advice, or &#34;go do this,&#34; but rather, &#34;here&#39;s the playbook that worked well for us, with a specific product, at a specific moment in time.&#34;\n  Sales should to be driven by at least one founder until you stop learning new things about your customers, the problem you are solving, and how to position your solution.\n At our last company, we had all three founders involved in sales at some level for almost 2 years.\n No one is going to understand the product and problem it solves better than the founders. If that&#39;s not the case, you have bigger problems than sales.\n Sales conversations are also your most important feedback loop. As a founder, you need a front row seat to drive product, pricing and marketing decisions.\n  I&#39;ve done a lot of sales. I&#39;ve worked at, built, founded, and sold a couple companies. Everything about a startup is sales: you&#39;re selling a product or service to a customer, you&#39;re pitching the best people to join your team, you&#39;re pitching investors, you&#39;re selling a vision to your team, you&#39;re striking a critical partnership.\n  I didn&#39;t write this alone. Our team at my new company  Laskie encouraged me to write this, and helped out a lot.", "posttime": "2020-11-08 09:36:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增加,arr,销售", "title": "在两年内从0美元增加到200万美元", "title_en": "Going from $0 to $2M ARR in 2 years", "transed": 1, "url": "https://laskie.co/playbooks/bootstrapping-b2b-sales", "via": "", "real_tags": ["增加", "arr", "销售"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033762, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造\r帐目", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-11-08 09:36:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打造,professional,创造", "title": "以便宜的价格打造自己的专业级音频放大器(2018)", "title_en": "Build Your Own Professional-Grade Audio Amp on the Sort of Cheap (2018)", "transed": 1, "url": "https://spectrum.ieee.org/consumer-electronics/audiovideo/build-your-own-professionalgrade-audio-amp-on-the-sort-of-cheap", "via": "", "real_tags": ["打造", "创造"]}, {"category": "", "categoryclass": "", "imagename": "6a7bc74368252d4a61dbde01171d45ec.png", "infoid": 1033761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是“电视地理”关于世界主要海底电缆系统和登陆站的全面和定期更新的交互式地图。", "note_en": "TeleGeography's comprehensive and regularly updated interactive map of the world's major submarine cable systems and landing stations.", "posttime": "2020-11-08 09:36:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电缆,cable,地理", "title": "海底电缆地图", "title_en": "Submarine Cable Map", "transed": 1, "url": "https://www.submarinecablemap.com/", "via": "", "real_tags": ["电缆", "cable", "地理"]}, {"category": "", "categoryclass": "", "imagename": "4a03f622ee66ea3150f73ee58b19c0cd.png", "infoid": 1033759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从兼容的Windows Spotify版本转储Spotify歌曲的AES密钥。", "note_en": "Dump AES keys for Spotify songs from a compatible Windows Spotify version.", "posttime": "2020-11-08 09:35:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,dump,spotify", "title": "SpotifyKeyDumper-从Windows Spotify客户端转储歌曲解密密钥", "title_en": "SpotifyKeyDumper – Dump song decryption keys from the Windows Spotify client", "transed": 1, "url": "https://gitlab.com/fuck-capitalism/spotifykeydumper", "via": "", "real_tags": ["windows", "dump", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注意：这是对此版本中一些更有趣的特性的回顾。有关更改的完整列表，请务必阅读更新文件。\n这个版本升级到了2.0，不是因为特性的数量(实际上比以前的版本小)，而是因为一些向后不兼容的变化。请仔细阅读此列表，注意这些更改：当使用&lt；Attach-file&&gt;浏览电子邮件并向其添加多个附件时，您可以在标记文件后使用&lt；退出&&gt;退出。以前，必须在非目录文件上按&#34；Enter&#34；。这很尴尬，也不直观。\n某些配置变量的默认值是可翻译的。在手册中，这些标记为字符串(本地化)类型。例如$ATTRIBUTION和$STATUS_FORMAT。\n$SSL_FORCE_TLS默认设置。如果这听起来很熟悉，那是因为我以前在1.13.0版本中尝试过，但在一些破坏之后恢复了它。我又试了一次，版本号有了很大的提高。如果您需要连接到非加密站点，则需要自己关闭此设置。\n默认情况下，&lt；解码-复制&&gt;和&lt；解码-保存&&gt;不再执行标题剔除。可以通过设置$COPY_DECODE_WIDD重新启用标题剔除。\n$hostname是在处理mutrc和-e命令行参数后设置的。这样做是为了提供一种跳过FQDN的DNS查找的方法，这在某些系统上可能会导致启动延迟。\n普通配置变量(而不是用户定义的My变量)以前在赋值的右侧使用时被转义。换行符转换为&#34；\\n&34；，回车符转换为&#34；\\r&#34；，制表符转换为&#34；\\t&34；，反斜杠和双引号在反斜杠转义处转换。这是一个漏洞，但也是一个长期存在的漏洞，所以我注意到了这里的变化。\n这一功能并不常用，但请参阅票据226了解请求背后的理由。这允许使用文字IP地址代替电子邮件地址域。例如user@[IPv6：fcXX：...]。\n我相信这是以前没有实现的，因为Mutt没有在内部解析相对路径。因此，以类似Mutt-f mymailbox这样的内容启动Mutt会导致Mutt打开当前目录中的mymailbox，并继续在内部将其称为mymailbox。如果目录更改，Mutt仍会(错误地)引用新目录中的&#34；mymailbox&#34；。\n正因为如此，Mutt现在还尝试解析相对路径。这并不像你想象的那么直截了当。因此，如果您遇到问题，请让我们知道！\n当发生计划外断开时，Mutt将尝试自动重新连接，并将未保存的更改保留在邮箱中。这并不是无懈可击的，但至少有望减少因邮箱连接冻结或丢失而丢失的更改。\n此外，Mutt还将Date、From、To、CC和Reply-To标头存储在受保护的标头中。目前，MUT不会显示或使用这些标题，但其他MUA可能会期待它们出现在那里。\n&#34；xoauth2&34；在$IMAP_AUTHENTICATS、$SMTP_AUTHENTATOR和$POP_AUTHENTATERS中支持作为值。此外，在contrib目录下有一个刷新令牌脚本，可以与Python3一起使用。(这个剧本没有得到Mutt团队的官方支持，但有报道称它可以工作。)。\n如果有时忘记了模式修饰符，可以在~后面键入Tab以获得模式修饰符的列表。在选定内容上按Enter键会将其添加到行编辑器中。\n$COPY_DECODE_WIDD、$PIPE_DECODE_WIDD和$PRINT_DECODE_WIDD这三个新变量允许您将解码操作与标题剔除操作分离。默认情况下，管道和打印操作会删除，保留以前的行为。默认情况下，复制和保存操作不会删除。\nMuttLisp是一个实验性特性，为配置文件提供了类似Lisp的增强。它允许更多关于命令或命令参数的动态决策；但是，它不是一种成熟的语言，不能取代宏或命令。\nSet mutlisp_inline_eval set index_format=(if(等于$SIDBAR_Visible&#34；yes&#34；)\\&#34；短索引格式&#34；\\&#34；长索引格式&#34；)。\n例如，$CURSOR_OVERLAY可以用来有一个&#34；下划线指示符，它显示下面选定线条的颜色。默认指示器前景/背景颜色将改为由线条的颜色设置。属性(如粗体、下划线、反转)将在两者之间合并。", "note_en": "Note: this is a review of some of the more interesting features in this release. For a complete list of changes please be sure to read the  UPDATING file.\n    This release was bumped to 2.0, not because of the magnitude of features (which is actually smaller than past releases), but because of a few changes that are backward incompatible. Please read this list carefully to be aware of these changes:  When using  &lt;attach-file&gt; to browse and add multiple attachments to an email, you may use  &lt;quit&gt; to exit after tagging the files. Previously, &#34;enter&#34; had to be pressed on a non-directory file. This was awkward and non-intuitive.\n  The default value of some configuration variables is translatable. Those are marked with type  string (localized) in the manual. Examples include  $attribution and  $status_format.\n  $ssl_force_tls defaults set. If this sounds familiar, that&#39;s because I tried this before in the 1.13.0 release, but reverted it after some breakage. I&#39;m trying again with a major revision number bump. If you need to connect to a non-encrypted site, you will need to turn this setting off yourself.\n  &lt;decode-copy&gt; and  &lt;decode-save&gt; no longer perform header weeding by default. Header weeding can be toggled back on by setting  $copy_decode_weed.\n  $hostname is set after processing the muttrc and  -e command-line arguments. This was done to provide a way to skip DNS lookups of the FQDN, which on some systems can result in a delay when starting up.\n    Normal configuration variables (as opposed to  user-defined my variables) were previously escaped when used on the right hand side of an assignment. Newline was converted to &#34;\\n&#34;, carriage return to &#34;\\r&#34;, tab to &#34;\\t&#34;, backslash and double quotes where backslash escaped. This was a bug, but a long-standing one, so I note the change here.\n    This feature isn&#39;t commonly needed, but see  ticket 226 for the reasoning behind the request. This allows the use of literal IP addresses in place of the email address domain. For example  user@[IPv6:fcXX:....].\n      I believe this wasn&#39;t implemented previously because Mutt didn&#39;t resolve relative paths internally. So, starting Mutt with something like &#34; mutt -f mymailbox&#34; would cause Mutt to open &#34;mymailbox&#34; in the current directory and continue to refer to it as &#34;mymailbox&#34; internally. If the directory changed, Mutt would still refer (incorrectly) to &#34;mymailbox&#34; in the new directory.\n  Because of this, Mutt now also tries to resolve relative paths. This isn&#39;t as straightforward as you would think. So if you encounter issues, please let us know!\n    When an unplanned disconnect occurs, Mutt will try to reconnect automatically, preserving unsaved changed changes in the mailbox. This isn&#39;t bulletproof, but will hopefully at least reduce lost changes due to a mailbox connection freezing or being dropped.\n      Also, Mutt will store the Date, From, To, Cc, and Reply-To headers in protected headers. Mutt currently doesn&#39;t display or make use of those headers, but other MUA&#39;s may expect them to be there.\n    &#34;xoauth2&#34; is supported as a value in  $imap_authenticators,  $smtp_authenticators, and  $pop_authenticators. Additionally there is a  refresh token script under the contrib directory which works with Python 3. (The script is not officially supported by the Mutt team, but has been reported to work.)\n    If you sometimes forget a pattern modifier, you can type Tab after the ~ to get a list of pattern modifiers. Hitting enter on a selection will add it to the line editor.\n    Three new variables,  $copy_decode_weed,  $pipe_decode_weed, and  $print_decode_weed allow you to decouple the operation of &#34;decoding&#34; with the operation of header weeding. Pipe and print operations weed by default, preserving previous behavior. Copy and save operations do not weed by default.\n    MuttLisp is an experimental feature providing a Lisp-like enhancement to the configuration file. It allows more dynamic decisions about commands or command-arguments; however it is not a full-blown language, and does not take the place of macros or commands.\n        set muttlisp_inline_eval set index_format = (if (equal $sidebar_visible &#34;yes&#34;) \\ &#34;short index format&#34; \\ &#34;long index format&#34;)\n      $cursor_overlay can be used to have an &#34;underline&#34; indicator, for instance, that shows the colors of the selected line underneath.  default indicator foreground/background colors will be set by the color of the line instead. Attributes (such as bold, underline, reverse) will be merged between the two.", "posttime": "2020-11-08 09:35:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发行,release,mutt", "title": "MUT 2.0发行说明", "title_en": "Mutt 2.0 Release Notes", "transed": 1, "url": "http://www.mutt.org/relnotes/2.0/", "via": "", "real_tags": ["发行", "release", "mutt"]}, {"category": "", "categoryclass": "", "imagename": "c8197ae11b4dd0425d72ba25b9996639.jpg", "infoid": 1033757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软证实，其新的游戏流媒体服务XCloud将不会出现在苹果设备上。\n这款类似Netflix的游戏服务将于9月份推出，面向Android设备，每月收费提供100多款游戏。\n苹果表示，其应用商店规则要求每款游戏都要单独提交审查。\n微软表示，苹果是唯一拒绝消费者使用云游戏和游戏订阅服务的主要平台。\n另一个主要的游戏流媒体服务，谷歌的Stadia也遇到了类似的问题--它也可以在安卓上使用，而不是苹果的iOS上。\n微软准备将其流媒体功能引入其游戏通行证(Game Pass)产品的顶级产品中，该产品在英国的月费为10.99英镑。\n一些人曾希望微软的服务能进入苹果应用商店，因为它已经运行了几个月的测试版--尽管只有一款游戏可供选择。\n声明写道，游戏服务绝对可以在App Store上推出，只要它们遵循适用于所有开发者的同一套指导方针。\n然而，这不是微软或谷歌的游戏流媒体订阅应用的工作方式。其想法是，一款应用程序充当所有可用游戏的浏览器，这些游戏可以从菜单上即时流媒体。\n微软还承诺，新游戏将一直被添加，第一方游戏将在其正式发布的同一天提供在线播放。\n微软表示，它在iOS上的测试期已经结束，并补充说：不幸的是，我们没有办法通过苹果应用商店将Xbox Game Pass旗舰版云游戏的愿景带给iOS上的游戏玩家。\n该公司表示，其图书馆中的所有游戏都由游戏评级机构--如美国娱乐软件评级委员会(ESRB)--进行评级，这表明苹果不应该再次检查每款游戏。\n苹果一贯以不同的方式对待游戏应用，对非游戏应用适用更宽松的规则，即使它们包含互动内容，该公司表示。\n关于什么可以出现在应用商店，什么不可以出现的严格规定经常导致苹果和应用开发者之间的问题。\n该公司要求从其商店的所有销售额(包括订阅销售额)中抽取30%的分成，最近还卷入了与一名电子邮件应用程序开发商的公开争执，并威胁要因订阅费问题将其从商店中移除。\n苹果应用商店的规定还禁止任何带有类似商店界面的应用，并且明确只允许这类应用是远程桌面--远程设备的流媒体副本。\n这在过去一直是其他游戏服务的问题。例如，Valve的Steam Link应用程序可以在用户家中其他地方的手机或平板电脑上显示个人电脑的副本，而Shadow游戏应用程序可以让用户使用整个远程电脑。\nShadow的一位发言人告诉The Verge，它最初发现自己与苹果存在分歧，因此不得不取消了让用户直接进入游戏的快速启动功能。他们说，Shadow必须移除它，才能变得更像是游戏电脑的通用镜才能获得批准。\n微软表示，尽管目前还没有明确的方法，但它仍致力于找到一种方法，将其流媒体服务带到苹果设备上。", "note_en": "Microsoft has confirmed that its new game streaming service, xCloud, will not appear on Apple devices.\n The Netflix-like game service will launch in September for Android devices, offering a library of more than 100 games for a monthly fee.\n Apple said its app store rules require that each game is submitted individually for review.\n Microsoft said Apple was the only major platform to &#34;deny consumers from cloud gaming and game subscription services&#34;.\n Another major game streaming service, Google&#39;s Stadia, has had similar problems - it too is available on Android and not Apple&#39;s iOS.\n Microsoft is poised to roll its streaming feature into the top tier of its Game Pass product, which will cost £10.99 a month in the UK.\n Some had hoped that Microsoft&#39;s service would be coming to the Apple App Store, because it has operated a test version for several months - although with only one single game available.\n  &#34;Gaming services can absolutely launch on the App Store, as long as they follow the same set of guidelines applicable to all developers,&#34; the statement read.\n  However, that is not how Microsoft or Google&#39;s game streaming subscription apps work. The idea is that one app acts as a browser for all the available games, which can be streamed instantly from the menu.\n Microsoft also promises that new games will be added &#34;all the time&#34; and first-party titles will be available to stream on the same day as their general release.\n  Microsoft said its test period on iOS had expired, adding: &#34;Unfortunately, we do not have a path to bring our vision of cloud gaming with Xbox Game Pass Ultimate to gamers on iOS via the Apple App Store.&#34;\n It said all the games in its library are rated by games&#39; rating bodies - such as the American ESRB (Entertainment Software Rating Board) - suggesting that Apple should not need to check each game again.\n Apple &#34;consistently treats gaming apps differently, applying more lenient rules to non-gaming apps even when they include interactive content,&#34; it said.\n Strict rules about what can and cannot appear on the app store frequently cause problems between Apple and app developers.\n  The firm demands a 30% cut of all sales - including subscription sales - through its store, and  recently became embroiled in a public row with an email app developer whom it threatened with removal from the store over subscription fees.\n Apple&#39;s app store rules also ban any app with &#34;a store-like interface&#34;, and explicitly only allows these types of apps if they are a &#34;remote desktop&#34; - a streaming copy of a device from far away.\n That has been a problem for other gaming services in the past. Examples include Valve&#39;s Steam Link app, which displays a copy of the person&#39;s personal computer on a phone or tablet somewhere else in their home, or the Shadow gaming app, which gives users an entire remote computer to use.\n A Shadow spokesperson told The Verge that it had originally found itself in a disagreement with Apple, and had to remove its &#34;quick launch&#34; feature that let users go straight into a game. Shadow had to remove that to become more like a &#34;generic mirror&#34; of a gaming computer to be approved, they said.\n Microsoft says it is still committed to finding a way to bring its streaming service to Apple devices, despite there being no clear way to do so for now.", "posttime": "2020-11-08 09:34:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,游戏,apple,blocks", "title": "除非个别游戏获得批准，否则苹果将阻止游戏流媒体服务", "title_en": "Apple blocks game streaming services unless individual games are approved", "transed": 1, "url": "https://www.bbc.com/news/technology-53693581", "via": "", "real_tags": ["苹果", "游戏", "apple", "blocks"]}, {"category": "", "categoryclass": "", "imagename": "b30b96130bfd863b04dec2625164f072.jpg", "infoid": 1033756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "接收日期：2020年10月14日/修订日期：2020年10月29日/接受日期：2020年11月2日/发布日期：2020年11月3日。\n(本文属于《压力条件和环境下的锻炼与运动》特刊)。\n建议佩戴口罩，以防止感染或使他人接触到心肺疾病，如新冠肺炎。在剧烈运动中戴口罩是否会影响表现还存在争议。我们采用随机平衡交叉设计，评估了14名参与者(7男7女，28.2±8.7岁)在疲劳状态下戴口罩、布口罩或不戴口罩的效果。在整个运动试验中评估动脉血氧饱和度(脉搏血氧饱和度)和组织氧合指数(血红蛋白饱和/减饱和指标)(近红外光谱分析)。佩戴口罩对运动能力无影响(平均耗竭时间：无面罩622±141s，手术面罩657±158s，布面面罩637±153s(p=0.20)；峰值功率：无面罩234±56W，手术面罩241±57W，布面面罩241±51W(p=0.49))。在运动测试期间的任何时刻，当表示与运动峰值相关时，戴或不戴口罩的动脉血氧饱和度、组织氧合指数、感觉到的劳累程度或心率没有明显差异。在剧烈运动期间佩戴口罩对年轻、健康的参与者的血液或肌肉氧合以及运动表现没有明显的有害影响(ClinicalTrials.gov，NCT04557605)。查看全文。\n关键词：体力活动；冠状病毒；最大摄氧量；脉搏血氧测定；近红外光谱；新冠肺炎；大流行体力活动；冠状病毒；最大摄氧量；脉搏血氧测定；近红外光谱；新冠肺炎；大流行。\n►展示人物", "note_en": "Received: 14 October 2020 / Revised: 29 October 2020 / Accepted: 2 November 2020 / Published: 3 November 2020\n (This article belongs to the Special Issue  Exercise and Sport in Stressful Conditions and Environments)\n Wearing face masks is recommended for the prevention of contracting or exposing others to cardiorespiratory infections, such as COVID-19. Controversy exists on whether wearing face masks during vigorous exercise affects performance. We used a randomized, counterbalanced cross-over design to evaluate the effects of wearing a surgical mask, a cloth mask, or no mask in 14 participants (7 men and 7 women; 28.2 ± 8.7 y) during a cycle ergometry test to exhaustion. Arterial oxygen saturation (pulse oximetry) and tissue oxygenation index (indicator of hemoglobin saturation/desaturation) at vastus lateralis (near-infrared spectroscopy) were assessed throughout the exercise tests. Wearing face masks had no effect on performance (time to exhaustion (mean ± SD): no mask 622 ± 141 s, surgical mask 657 ± 158 s, cloth mask 637 ± 153 s ( p = 0.20); peak power: no mask 234 ± 56 W, surgical mask 241 ± 57 W, cloth mask 241 ± 51 W ( p = 0.49)). When expressed relative to peak exercise performance, no differences were evident between wearing or not wearing a mask for arterial oxygen saturation, tissue oxygenation index, rating of perceived exertion, or heart rate at any time during the exercise tests. Wearing a face mask during vigorous exercise had no discernable detrimental effect on blood or muscle oxygenation, and exercise performance in young, healthy participants (ClinicalTrials.gov, NCT04557605). View Full-Text\n Keywords:  physical activity; coronavirus; maximal oxygen uptake; pulse oximetry; near-infrared spectroscopy; COVID-19; pandemic   physical activity;  coronavirus;  maximal oxygen uptake;  pulse oximetry;  near-infrared spectroscopy;  COVID-19;  pandemic\n  ► ▼Show Figures", "posttime": "2020-11-08 09:34:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "健康人,disposable,口罩", "title": "布/一次性口罩对健康人的运动能力没有影响", "title_en": "Cloth/disposable masks have no effect on exercise performance in healthy people", "transed": 1, "url": "https://www.mdpi.com/1660-4601/17/21/8110", "via": "", "real_tags": ["健康人", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "68eaef96ef90392715a86ab4529d5a51.jpeg", "infoid": 1033755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造力就是允许自己犯错。艺术就是知道该保留哪些。-斯科特·亚当斯。\n上周，我读完了这本书，“你在开玩笑，费曼先生”。我不得不说，费曼一定会喜欢在生成艺术领域工作的。(顺便说一句，这是一个很棒的收听节目(免费，带音频订阅)。)。一位20世纪极具影响力的科学家，但不是你的实验室老鼠；而是一个几乎愿意做任何事情去体验的人。这个过于好奇的人在周围会非常吸引人，仅仅是观察就可以了。\n在书的后面，他谈到了他的兴趣，画科学和数学的美，使个人更容易理解数学和自然的美。这让我想起了我们创造的许多粒子系统，以及它们是如何展示我们在自然界中看到的有序混沌系统的。\n因此，本周，有几篇帖子受到了这篇文章的启发，如果你还没有读过它，或者正在寻找新的东西可以读，我强烈推荐它。\nEno进一步描述了创造“不断变化的音乐”的系统，这种系统可以“永远产生原创音乐”，他哀叹这些系统的局限性迫使他只把这些系统的输出录制成传统专辑，而不是“出售系统本身，这样听众就会知道音乐总是独一无二的”。\n我找到了这段关于算法编排的有趣视频。这是一种利用管弦乐和使用TidalCycle来管弦乐的独特方式。\n将一首歌曲的频率曲线、声级、动态等不同参数提取、映射并绘制在纸上。\n我总是发现某些媒介的其他表现形式看起来和观察起来很吸引人；实际上，它是数据可视化，而不是能够提供可操作的洞察力的功能实用程序。虽然这也不是真的，但能够找到贯穿一首音乐的音乐主题，尤其是在欣赏古典音乐的时候，这是一件令人振奋的事情。\n在这一部分中，我将庆祝互联网上许多有才华的艺术家。多年来，我一直在观察马特的所作所为，他的作品鼓舞人心，令人兴奋。到目前为止，我只是在这里添加他们的个人资料，以此来庆祝一些出色的艺术家所做的工作。最终，我希望能够通过采访更深入地了解他们的经历。(真的，我希望拍一部关于他们创作的作品的视频系列，谈谈他们的一些艺术家哲学)。\n如果你有兴趣近距离观察他们的作品，请让我知道。\n查看他的GitHub页面，查看他一直在使用的工具。\n我相信以下是我最喜欢的马特的作品。从图像中的光源发出的光的方式有些复杂。然后，当闪光在某个时间点上衰减时，它的分布会发生飞溅。它有一种美丽的反乌托邦的灯光感觉，让它变得非常复杂。\n提示：扫描这些手艺大师的代码可以学到很多东西。他们不仅会帮助你找到他们的灵感，还会帮助你理解那些可能花了几个小时才弄明白的小贴士和诀窍。\n这是一个关于创建分形矿物的有趣的教程；他的渲染绝对是疯狂的，因为胡迪尼可以免费使用；这是一项可能值得获得的技能，因为有这么多有趣的模拟可以用它来完成。\n树的生长是通过树皮外层沿树枝结构向上传递营养物质来实现的。在这样做的过程中，每个树枝节段的周长都在增长。到达非分叉枝条末端的营养物质会导致长度的增长，而分叉枝条则会按一定的比例将营养物质传递给它的子枝。\n基于节点的编程，也称为基于流的编程，是一种通过使用可视化地表示为块的预定义函数来创建计算机程序的方式。这样的编程模型有很多例子：\n本文中使用的软件被LostMinds称为PatternNodes。这是你应该去看看的东西。\n生成艺术指的是在没有直接人类控制的情况下，使用自主过程创作艺术作品。生成艺术一般有两类：“神经”，训练深度神经网络，从数据分布中生成样本；“符号”或“算法”，由人类艺术家设计主要参数，然后由一个自主系统在这些约束下工作，生成样本。\n生成艺术的秘诀之一是能够在算法中重复自然界的随机性。这就是转弯的外观或自然增长令人着迷的原因。这里有一点。\n这本书是为有编程经验，线性代数和三角学的基础知识，并希望将他们的工作提升到一个令人兴奋的图形质量新水平的创造性程序员、游戏开发人员和工程师而写的。(如果您想学习如何编码，我强烈建议您从处理开始，当您对它感到满意时再来。)。\n这是对着色器世界的一个很好的介绍，通常比我在过去几周给出的简单的处理建议要复杂一些。然而，继续尝试新事物是很重要的，因为着色器可以做一些令人惊叹的事情。", "note_en": "Creativity is allowing yourself to make mistakes. Art is knowing which ones to keep.&#34; -  Scott Adams\n This last week I finished the book, &#34; Your Joking Mr. Feynman&#34; and I have to say that Feynman would have loved to work in the Generative Arts. (And by the way, this is a great listen (free w/ Audible subscription.) . A greatly influential scientist of the 20th century but not your lab rat; but one who would have done almost anything to experience. This overly curious individual would have been so fascinating to be around and to just observe.\n Later in the book, he talks about his interest to draw the beauties of science and math to make it more accessible for individuals to understand the beauty of mathematics and nature. So it reminded me of the many particle systems that we have all created and how they show the ordered chaos systems that we see in nature.\n So for this week, there are a few posts that have been inspired by the read and I would highly recommend it if you haven&#39;t read it or are looking for something new to read.\n         Eno further describes systems which create “ever-changing music,” that could “produce original music forever,” lamenting the limitations which forced him to simply record the output of these systems as traditional albums rather than “sell the system itself, so that a listener would know that the music was always unique.”\n  Found this interesting video on algorithmic orchestration. This is a unique way of taking orchestrated music and using  TidalCycles to orchestrate a piece of classical music.\n     Different parameters of a song like frequency curves, sound levels, dynamics etc. are extracted, mapped and drawn on paper.\n I&#39;ve always found alternative representations of certain mediums to be fascinating to look at and observe; really it is data visualization without the functional utility of being able to provide actionable insights. Although, that isn&#39;t true either, it can be rewrading to be able to find musical motifs that run through a piece of music especially when observing classical music.\n   In this section I am going to celebrate the many talented artists across the internet. I have been watching what Matt has done for years and his work has been inspirational and just exciting to watch. As of right now; I am simply adding their profiles here as a way to celebrate the work that has been done by some of the wonderful artists out there. Eventually I hope to be abloe to provide some more insight into their experiences through interviews. (Really I hope to do a video series on the works they have created and talk through some of their artist philosophies).\n Let me know if there is anyone that you would be interested in getting a closer look at their work.\n     Check out his github page to observe the tools that he has been working with\n  I believe the following is my favorite work from Matt. There is something complex in the way the light shines from the sources within the images. Then the distribution of the lighting splatter as it decays over a point in time. It has a beautiful dystopian lighting feel making it really complex.\n   Protip: A great deal of learning can come from scanning the code of these master crafters. They will help you not only find their inspirations, but also help understand the tips and tricks that may have taken hours to figure out.\n    This is a fun and interesting tutorial on creating fractal minerals; his renderings are absolutely insane and since Houdini can be used for free; it is a skill that might be worth attaining since there are so many fun and interesting simulations that can be done with it.\n    A tree grows by passing nutrients up its branch structure through its outer bark layer. As it does so, each branch segment grows in girth. Nutrients arriving at the end of a non-split branch lead to growth in length, while a split branch passes the nutrients to its child branches proportionally to some ratio.\n    Node-based programming, also known as &#34;Flow-based programming&#34;, is a way to create computer programs by using predefined functions represented visually as blocks. There are many examples of such programming models:\n The software used in the article is called  PatternNodes  by LostMinds. It is something you should check out.\n    Generative art refers to the creation of artworks using autonomous processes with no direct human control. There are two general classes of generative art: “neural,” where a deep neural network is trained to generate samples from a data distribution; and “symbolic” or “algorithmic,” where a human artist designs the primary parameters and an autonomous system then works within these constraints to generate samples.\n   One of the &#34;secrets&#34; of generative art is the ability to repeat the randomness of nature in the algorithms. It is what gives the swerving look or natural growth fascinating. Here is a little bit\n   This book is written for creative coders, game developers and engineers who have coding experience, a basic knowledge of linear algebra and trigonometry, and who want to take their work to an exciting new level of graphical quality. (If you want to learn how to code, I highly recommend you start with Processing and come back later when you are comfortable with it.)\n A great introduction into the world of shaders and generally a bit more complex than a simple processing recommendations that I&#39;ve given in the past couple weeks. However it&#39;s important to continue to try new things as shaders can do some amazing things.", "posttime": "2020-11-08 09:34:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,算法,programming,algorithmic", "title": "费曼、算法编排和基于节点的编程", "title_en": "Feynman, Algorithmic Orchestration and Node Based Programming", "transed": 1, "url": "https://generative.substack.com/p/feynman-algorithmic-orchestration", "via": "", "real_tags": ["编程", "算法"]}]