[{"category": "", "categoryclass": "", "imagename": "34fe81a44a08da300af184952b58d436.jpeg", "infoid": 1066701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄勒冈州现在是美国的第三国，允许死亡的选择，这是对环境福利的普及：人类堆肥。\n  Gov.Katie Brown在周二签署了房屋比尔2574年法律，增加了西岸国家批准的生活选项的自然有机化量。帕姆沼泽（D  - 南部杰克逊县）赞助和开发，该法案遇到了俄勒冈人对传统死亡的可持续替代品的兴趣日益增长。\n    “这是人们思考的艰难问题;它不是一个决定我们任何人都能避免的决定，“沼泽通过电话告诉主板。 “它对所有消费者都有呼吁，肯定不是所有的消费者，而是对我们的许多人真正寻找如何考虑我们在生活后继续思考地球的足迹。”\n  这一举动从全国各地的环保主义者呼吁宣布，以清理生活结束行业。最常见的身体处置方法具有巨大的环境影响：传统墓葬，其中尸体用甲醛拆卸，并将地下放置在地下，永久占据大量的土地，并已被发现将毒素浸入附近的土壤和水道。火化 - 其中一个身体被烧成灰烬 - 是一种能量吮吸，并发出损害污染物和二氧化碳进入大气中的，有助于全球变暖。\n  相比之下，所谓的天然有机物还原的过程，将身体分解成土壤，具有小的环境足迹。例如，建议，该国的首个人类堆肥殡仪馆这样做：尸体被放置在一个带有有机材料的圆筒中，如木屑，植物和稻草，然后用钩子重复加热并重新转化几周分解成富含营养的土壤，可以送回家庭或用于种植。\n   人类堆肥是最新的环境死亡人员选择，以获得全国各地的牵引力，因为可用的公墓空间从火葬券下降和排放。\n  在人类堆肥之前，在没有化学物质的情况下，在没有化学物质的情况下制备身体并在有机可生物降解的容器中种植的绿色墓葬，通常在1998年的树苗中出现，作为传统的高冲击埋葬方法的替代方案。绿色葬礼委员会。作为一种环保优越的死亡方法，它也会因某些人而更轻松地估算死亡。这是一个困难的话题，乔蒂昂布勒，保护墓葬联盟的董事会成员说，但知道你或爱人可以通过堆肥或绿墓来死亡 - 使其更容易处理。 \n“感觉就像一个非常和平的选择，”布尔说。 “那些有人变成的土壤可以用来滋养植物的想法对人们来说感觉非常好。它有助于打破一些禁忌的死亡和死亡。“\n  俄勒冈州的法律于2022年7月生效，遵循邻国的类似势头。华盛顿成为美国的第一个，以合法化2019年的自然有机物减少，这导致了重点的开放。 5月，科罗拉多州做了相同的事。\n  在大多数国家，这种做法仍然是违法的，让那些想要一系列生态友好的生活选项卡住了有限的选择。但纽约和特拉华州等国家的立法者在最近几个月审议了将改变这一点的票据。如果在全国范围内采用，人类堆肥可能会减少美国葬礼行业的环境影响，而且能改变我们谈论死亡的方式。\n  “我们的文化一直处于证人或避免模式，”她说。 “我认为它＆＃39;是一个更大的运动的指导者...远离恐惧，以及如何使死亡和死亡更加有意义，更亲人的吸引力，”她说。 ", "note_en": "Oregon is now the third state in the US to allow a deathcare option that’s gaining popularity for its environmental benefits: human composting.\n  Gov. Katie Brown signed   House Bill 2574 into law on Tuesday, adding natural organic reduction to the range of approved after-life options in the west coast state. Sponsored and developed by Rep. Pam Marsh (D - Southern Jackson County), the bill met Oregonians’ growing interest in sustainable alternatives to traditional deathcare.\n    “This is a hard issue for people to think about; it&#39;s not a decision that any of us get to avoid,” Marsh told Motherboard over the phone. “It has an appeal, certainly not to all consumers, but to many of us who are really looking for ways to think about how our footprint on the earth continues after life is gone.”\n  The move heeds a   growing call from environmentalists across the country to clean up the end-of-life industry. The most common methods of body disposal come with hefty environmental impacts: traditional burials, in which a corpse is embalmed with formaldehyde and placed in a casket underground, permanently   occupy large swaths of land and have been found to   leach toxins into nearby soil and waterways. Cremation–in which a body is burned into ash—is an energy suck and emits damaging   pollutants and   carbon dioxide into the atmosphere, contributing to global warming.\n  By comparison, the process of so-called   natural organic reduction, which breaks down the body into soil, has a small environmental footprint. For example,   Recompose,   the country’s first human composting funeral home does it like this: a corpse is placed in a cylinder with organic materials, like wood chips, plants, and straw, then heated and turned repeatedly for several weeks with a hook until it’s broken down into a nutrient-rich soil that can be delivered back to the family or used for planting.\n   Human composting is the latest of a handful of environmental deathcare options to gain traction across the country as available   cemetery space declines and emissions from cremation mount .\n  Before human composting gained traction,   green burials—in which the body is prepared without chemicals and planted underground in an organic, biodegradable container, often underneath a tree sapling—emerged in 1998 as an alternative to traditional high-impact burial methods, according to the   Green Burial Council. Lauded as an environmentally superior deathcare method, it also makes reckoning with death easier for some. It’s a difficult topic, says Jodie Buller, board member of the Conservation Burial Alliance, but knowing that you or a loved one can die sustainably—through composting or green burials—makes it easier to handle.\n  “It feels like a very peaceful option,” Buller said. “The idea that the soil that someone becomes then can be used to nourish plants feels really good to people. It helps break down some of that taboo around death and dying.”\n  Oregon’s law, slated to go into effect in July, 2022, follows similar momentum in neighboring states. Washington became the first in the U.S. to legalize natural organic reduction in   2019, which led to the   opening of   Recompose. In May, Colorado   did the same.\n  The practice remains illegal in most states, leaving those who want an eco-friendly end-of-life option stuck with a limited range of options. But legislators in states like   New York and   Delaware have, in recent months, considered bills that would change this. If adopted widely across the country, human composting could cut down on the U.S. funeral industry’s environmental impact and, Buller says, change the way we talk about death.\n  “Our culture has been in either witness or avoidance mode,” she said. “I think it&#39;s a signifier of larger movements… away from fear, and toward curiosity, around how to make death and dying more meaningful and more personally engaging,” she said.", "posttime": "2021-06-18 21:08:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,legalized,死亡", "title": "俄勒冈州的人类堆肥已经合法化了 ", "title_en": "Oregon Has Legalized Human Composting", "transed": 1, "url": "https://www.vice.com/en/article/z3xz3j/oregon-has-legalized-human-composting", "via": "", "real_tags": ["人类", "legalized", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "0869a9cd88355e0107b572d1e2c4b5c5.jpeg", "infoid": 1066700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "盖因是一个数据增强库，目前支持四个模态（音频，图像，文本＆amp;视频）和超过100个增强。每个模态的增强都包含在自己的子图书馆内。这些子库包括基于函数和基于类的转换，构图运算符，并可以选择提供有关应用的变换的元数据，包括其强度。\n 盖因是一个伟大的图书馆，可以利用在模型培训中增加数据，或评估模型的稳健性差距！我们以旨在包括许多特定数据增强的特定数据增强，用户在Facebook＆＃39等互联网平台上的现实生活中执行 - 例如在图像/视频上覆盖文本/ emojis，从社交媒体中重新发布截图。虽然以速度包含更多通用数据增强，但如果您＆＃39;重新撰写副本检测，讨厌语音检测或版权侵权，那么它将特别适用于这些＆＃34;互联网用户＆＃34;数据增强类型是预先存在的。\n  要查看更多的增强示例，请在README中打开COLAB笔记本电脑，为每种方式！ （例如图像Readme＆amp; Colab）\n        或者克隆刚才如果要能够运行我们的单位测试，贡献拉索请求等：\n git clone git@github.com：FacebookResearch / Athly.git [可选，但推荐]公园Create-N AGLY＆amp;＆amp;＆amp;公园激活了AGLY＆amp; Conda安装pippip安装-e ably /\n 注意：在某些环境中，PIP＆＃39; T按预期安装Python-Magic。在这种情况下，您需要另外运行：\n       我们提供各种媒体资产以与我们的一些增强一起使用。这些资产包括： \nEmojis（Twemoji） - 版权所有2020 Twitter，Inc等贡献者。在麻省理工学院许可证下许可的代码。在CC-BY 4.0下许可的图形。\n 字体（NOTO字体） -  NOTO是谷歌公司的商标.NOTO字体是开源的。所有Noto字体都在SIL Open Font许可证版本1.1下发布。\n 屏幕截图模板 - 由Facebook的设计师创建的图像专门用于以速度使用。您可以使用它们在图像和视频库中的overlay_onto_screenshot增强，以使其看起来像您的源图像/视频在类似于Facebook或Instagram的社交媒体饲料中截图。\n   @misc {bitton2021augly，作者= {bitton，乔安娜和papakipos，zoe}，标题= {evly：一个音频，图像，文本和视频的数据增强库。 }，如何发表= {\\ url {https://github.com/facebookresearch/augly}}，年= {2021}}\n  以速度为许可，如许可证文件所示。请注意，AGILLY使用的一些依赖项可能会在不同的术语下获得许可。 ", "note_en": "AugLy is a data augmentations library that currently supports four modalities ( audio,  image,  text &amp;  video) and over 100 augmentations. Each modality’s augmentations are contained within its own sub-library. These sub-libraries include both function-based and class-based transforms, composition operators, and have the option to provide metadata about the transform applied, including its intensity.\n AugLy is a great library to utilize for augmenting your data in model training, or to evaluate the robustness gaps of your model! We designed AugLy to include many specific data augmentations that users perform in real life on internet platforms like Facebook&#39;s -- for example making an image into a meme, overlaying text/emojis on images/videos, reposting a screenshot from social media. While AugLy contains more generic data augmentations as well, it will be particularly useful to you if you&#39;re working on a problem like copy detection, hate speech detection, or copyright infringement where these &#34;internet user&#34; types of data augmentations are prelevant.\n  To see more examples of augmentations, open the Colab notebooks in the README for each modality! (e.g. image  README &amp;  Colab)\n        Or clone AugLy if you want to be able to run our unit tests, contribute a pull request, etc:\n git clone git@github.com:facebookresearch/AugLy.git[Optional, but recommended] conda create -n augly  &amp;&amp; conda activate augly  &amp;&amp; conda install pippip install -e AugLy/\n NOTE: In some environments,  pip doesn&#39;t install  python-magic as expected. In that case, you will need to additionally run:\n       We provide various media assets to use with some of our augmentations. These assets include:\n Emojis ( Twemoji) - Copyright 2020 Twitter, Inc and other contributors. Code licensed under the MIT License. Graphics licensed under CC-BY 4.0.\n Fonts ( Noto fonts) - Noto is a trademark of Google Inc. Noto fonts are open source. All Noto fonts are published under the SIL Open Font License, Version 1.1.\n Screenshot Templates - Images created by a designer at Facebook specifically to use with AugLy. You can use these with the  overlay_onto_screenshot augmentation in both the image and video libraries to make it look like your source image/video was screenshotted in a social media feed similar to Facebook or Instagram.\n   @misc{ bitton2021augly,  author =   {Bitton, Joanna and Papakipos, Zoe },  title =   {AugLy: A data augmentations library for audio, image, text, and video. },  howpublished =   {\\url{https://github.com/facebookresearch/AugLy} },  year =   {2021 }}\n  AugLy is MIT licensed, as found in the  LICENSE file. Please note that some of the dependencies AugLy uses may be licensed under different terms.", "posttime": "2021-06-18 21:08:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增强,multimodal,图像", "title": "丑陋：来自FB研究的新多峰数据增强库 ", "title_en": "AugLy: A new multimodal data augmentation lib from FB Research", "transed": 1, "url": "https://github.com/facebookresearch/AugLy", "via": "", "real_tags": ["增强", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在数据库字段和信息检索中，存在一个非常常见的场景。我有一个我想要存储的（分类）整数的列表，我希望尽可能高效地这样做。有几十种方法这样做，这是一个研究的热门话题。这是如此有用，因为您可以在排序的整数列表中运行这么多的地方，并获得大量优势。与通用压缩例程不同，我们通常可以利用我们理解我们试图与之合作的数据并获得更好结果的事实。\n 我需要压缩整数的原因（实际上，Int64值）是我试图跟踪一些数据的匹配，因此我跟踪的整数实际上是用户在Voron内部的数据偏移量。这导致了一些不同的场景，我必须处理：\n  我正在尝试弄清楚以尽可能高效的方式存储后面的两个选项的最佳方法。\n 第一个停止是Daniel Lemire的博客，自然地，因为他已经广泛写了这篇文章。我看了以下方案：FastPFOR和StreamVByte。它们具有稍微不同的目的，但基本上，FastP将使用位流，而StreamVbyte使用的字节导向模式。从理论上讲，您可以从Fastp for获得更好的压缩率，但StreamVByte应该更快。另一个整数压缩系统来自Facebook的大猩猩纸，这是一个更大的方案，包括时间序列值压缩。但是，该方案的一部分会谈论如何压缩整数（它们使用它来存储特定操作的刻度）。我们实际上是在RavendB内部的时间序列支持。\n 我不会覆盖深度，这里是大猩猩压缩的论文，相关描述在4.1.1节。足以说他们正在使用比特流和Deltas计算的三角洲。基本上，如果保持相同距离的值，则无需录制所有值，您可以自然地计算。在最佳情况下，Gorilla压缩需要每个值的单个比特，假设结果类似地间隔。\n 为我的目的，我希望尽可能高的压缩率，我需要只存储整数列表。大猩猩压缩的问题是，如果我们没有获得相同距离的数字，我们需要记录它们不同的金额。这意味着，至少，我们每张值至少需要9位。这令人遗憾地增加了。\n 另一方面，对于POR，有一个不同的系统。 PFOR计算批量整数所需的最大位数，然后录制这些值。我发现本文中的二进制包装部分（2.6）是最明确的解释，这是如何完成的。但是，POR的问题是，如果您有一个大的异常值，则会不必要地浪费大量的比特。 \n我决定看看我是否可以为此做点什么，并创建一个在一次批量的128个整数上工作的编码器。这个编码器将：\n 检查录制整数的增量所需的最大位数。沿着已经拯救了我们很多。\n 然后我们检查批处理的顶部和底部半数，看看我们是否会获得单独录制它们的好处。在这种情况下，将独立地记录到批处理中的一部分的单个大值（或其中一组）。\n 最后，如果我们还会分析我们进一步的批次，而不是仅记录有意义的位范围。这个想法是尝试在批处理中找到具有相同距离彼此相同的范围。我们可以将这些产品编码为重复而不是每个独立值。这最终可以节省令人惊讶的空间。\n 您可以在此处查看研究结果。我会注意你这是原始的，但结果很有希望。我能够通过一点击败（在压缩率方面）标准PFOR实现，代码较少。\n 我也在查看逼真的数据集的压缩率为30％ -  40％。如果数据正确设置，我能够利用重复的三角形优化，我可以紧紧包装。\n 目前，据说我可以在8KB缓冲区中向上推出10,000 int64值，而没有任何重复的Δ。如果我可以充分利用Deltas，它可以在8KB缓冲区中进入500,000 int64值。 \n我经常提及三角洲的原因，我很可能会录制大小相同的值，因此我们将获得彼此相同的空间的抵消。 在这种情况下，我的编码器进入镇，压缩率基本上是疯狂的。  这是一小部分更大的工作，但这是我第一次在Voron的水平上代码。 这很好玩。 ", "note_en": "In the database field and information retrieval in general, there is a very common scenario. I have a list of (sorted) integers that I want to store, and I want to do that in an as efficient a manner as possible. There are dozens of methods to do this and this is a hot topic for research. This is so useful because there are so many places where you can operate on a sorted integer list and gain massive benefits. Unlike generic compression routines, we can usually take advantage of the fact that we understand the data we are trying to work with and get better results.\n The reason I need to compress integers (actually, int64 values) is that I’m trying to keep track of matches for some data, so the integers that I’m tracking are actually file offsets for user’s data inside of Voron. That lead to a few different scenarios that I have to deal with:\n  I’m trying to figure out what is the best way to store the later two options in as efficient manner as possible.\n The first stop was  Daniel Lemire’s blog, naturally, since he has wrote about this extensively. I looked at the following schemes: FastPFor and StreamVByte. They have somewhat different purposes, but basically, FastPFor is using a bits stream while StreamVByte is using byte oriented mode. Theoretically speaking, you can get better compression rate from FastPFor, but StreamVByte is supposed to be faster. Another integer compression system come from the Gorilla paper from Facebook, that is a bigger scheme, which include time series values compression. However, part of that scheme talks about how you can compress integers (they use that to store the ticks of a particular operation). We are actually using that for the time series support inside of RavenDB.\n I’m not going to cover that in depth, here  is the paper on Gorilla compression, the relevant description is at section 4.1.1. Suffice to say that they are using a bit stream and delta of deltas computation. Basically, if you keep getting values that are the same distance apart, you don’t need to record all the value, you can compute that naturally. In the best case scenario, Gorilla compression needs a single bit per value, assuming the results are spaced similarly.\n For my purpose, I want to get as high a compression rate as possible, and I need to store just the list of integers. The problem with Gorilla compression is that if we  aren’t getting numbers that are the same distance apart, we need to record the  amount that they are different. That means that at a minimum, we’ll need a minimum of 9 bits  per value. That adds up quickly, sadly.\n On the other hand, with PFor, there is a different system. PFor computes the maximum number of bits required for a  batch of integer, and then record just those values. I found the Binary Packing section (2.6) in  this paper to be the clearest explanation on how that works exactly.  The problem with PFor, however, is that if you have a single large outlier, you’ll waste a lot of bits unnecessarily.\n I decided to see if I can do something about that and created an encoder that works on batches of 128 integers at a time. This encoder will:\n Check the maximum number of bits required to record the  deltas of the integers. That along already saves us a lot.\n Then we check the top and bottom halves of the batch, to see if we’ll get a benefit from recording them separately. A single large value (or a group of them) that is localized to a part of the batch will be recorded independently in this case.\n Finally, instead of only recording the meaningful bit ranges, we’ll also analyze the batch we get further. The idea is to try to find ranges within the batch that have the same distance from one another. We can encode those as repetitions instead of each independent value. That can end up saving a surprisingly amount of space.\n You can look at the results of  my research here. I’ll caution you that this is raw, but the results are promising. I’m able to beat (in terms of compression rate) the standard PFor implementation by a bit, with a  lot less code.\n I’m also looking at a compression rate of 30% – 40% for realistic data sets. And if the data is setup just right and I’m able to take advantage of the repeated delta optimization, I can pack things  real tight.\n Currently numbers say that I can push upward of 10,000 int64 values in an 8KB buffer without any repeated deltas. It goes to just under 500,000 int64 values in an 8KB buffer if I can take full advantage of the deltas.\n The reason I mention the delta so often, it is very likely that I’ll record values that are roughly the same size, so we’ll get offsets that are the same space from one another. In that case, my encoder goes to town and the compression rate is basically crazy.\n This is a  small piece of a much larger work, but this is the first time in a while that I got to code at Voron’s level. This is  fun.", "posttime": "2021-06-18 21:08:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "整数,integer", "title": "排序整数压缩 ", "title_en": "Sorted Integer Compression", "transed": 1, "url": "https://ayende.com/blog/193955-A/sorted-integer-compression", "via": "", "real_tags": ["整数", "integer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\nWarning: Can only detect less than 5000 characters\n[2] A. G.Klein等，＆＃34;历史\r麦克马多站，南极洲，环境\r透视，＆＃34;极地地理31,119（2008）。\n  [3] W. Shafer，＆＃34;五\rMcMurdo站的多年核电，＆＃34;南极J. United.\r2，第2,38号（1967年）。\n  [4] L. H. Suid，军队＆＃39;核电计划：\r支持机构的演变（Praeger，1990）。\n  [5] J. B. Brown，V.W. Storhok和J. E. Gates，\r＆＃34; PM-3A的松土检查检查\r类型1串行2核心。第I部分。燃料管的松土，＆＃34;\rBattelle Memorial Institute，28日2月28日。\n  [6] K. Sieradzki和R. C. Newman，\r＆＃34;压力 - 腐蚀裂解，＆＃34; J. Phy。化学。固体48,1101\r（1987）。\n  [7]＆＃34;上限辐射剂量评估\r1962年间McMurdo站的军事人员，南极洲和\r1979年，＆＃34;美国国防威胁减少机构，\r DTRA-TR-12-003，2013年6月。\n  [8]＆＃34;离子辐射的来源和影响，\r未经2008年报告，＆＃34;联合国科学委员会的影响\r原子辐射，报告和附件\r A，B，\r C，D，\r和e，2010。 ", "note_en": "During the 1960s and early 1970s, McMurdo Staion, the \rlargest research base in the Antarctic, was powered by a medium-sized, \rportable nuclear reactor. [1] The extreme temperatures in Antarctica \rnecessitated large amounts of fuel oil to maintain operations, making \rthe prospect of nuclear power, an attractive alternative. [1] During its \r10 year lifetime, the nuclear power station produced over 78 million \rkilowatt hours of electricity and produced 13 million gallons of fresh \rwater using the excess steam in a desalination plant. [1] Though this \rdevice reduced the necessity for fuel imports, it was plagued with \rproblems which ultimately forced its early retirement in 1972. The cost \rassociated with nuclear power in the Antarctic made it impractical, and \rdiesel-electric generators have since powered the base. [1] The PM-3A \rnuclear reactor that powered McMurdo Station stands as the only nuclear \rpower station to operate on the Antarctic continent.\n    The ice-free southern tip of the Hut Point Peninsula \ron Ross Island in Antarctica has a history of over 100 years of \rexploration and scientific history and is the site of the present day \rMcMurdo Station. [2] This site is located just 729 nautical miles from \rthe South Pole and is where Robert F. Scott staged the first expedition \rto the South Pole in 1902. [2] The United States established a permanent \rbase at this site beginning in December 1955 as part of Operation Deep \rFreeze I. [2] Known as Naval Air Facility McMurdo, this site was to \rserve as a sea port and logistics base from which to build and support a \rresearch facility at the geographic South Pole. [2] The name McMurdo was \rchosen to honour a lieutenant on the British ship HMS Terror that \rdiscovered Ross Island on an Antarctic expedition in 1841. [2] In 1958, \rthe site was renamed to McMurdo Station and has since maintained the \rability to support a population of over 1200 people. [2] McMurdo Station \rserves as the hub for activity in the Antarctic and is currently \roperated by the United States Antarctic Program (USAP), a division of \rthe Nation Science Foundation (NSF). [2]\n      The decision to install a nuclear power station at \rMcMurdo station was based on several factors. [3] First, there were \rdifficulties associated with supplying the large fuel demands required \rfor operations. Aircraft, diesel-electric generators, heating units, and \rvarious types of land vehicles consumed fuel in excess of half of the \rtotal freight delivered to Antarctica in the late 1950s. [3] To further \rcomplicate supply chain logistics, McMurdo can only be accessed by \rsupply ships during the aural summer months (summer in the southern \rhemisphere), thus requiring all supplies for the entire year to be \rdelivered during this short time frame. [3] It was concluded that an \rincreased supply of electricity from nuclear power would give rise to a \rmore efficient use of freight, reduced costs, as well as electric \rheating to replace the fire hazards associated with oil-fired heating \runits. [3] In addition, experience would be gained from installing and \roperating a nuclear power plant in an isolated and harsh environment. \r[3]\n  In August 1960, the United States Congress authorized \rthe design and construction of a nuclear reactor for McMurdo. [3] That \rsame month, the U.S. Atomic Energy Commission contracted the Martin \rMarietta Company of Baltimore, Maryland to design, fabricate, test, \rpackage, transport, install, and initially operate the PM-3A (A for \rAntarctic) nuclear reactor on site in Antarctica. [4] The PM-3A reactor \ris a portable, medium sized nuclear reactor, the third of its type. [4] \rTwo others of this type were built and fielded prior to the PM-3A. [4] \rThe first was the PM-1, also built by Martin, which was used to power a \rremote radar station in Wyoming as part of the North American Aerospace \rDefense Command (NORAD). [4] The PM-2A (A for Arctic) was built by the \rAmerican Locomotive Company to power the remote US military base known \ras Camp Century setup in Northern Greenland. [4] Each of these reactors \rwas in the 1.25-2.0 MW power range, PM-1 and PM-3A were operational by \r1962, with PM-2A being operational in 1960. [4]\n    Fig. 3: Components of the PM-3A arriving at McMurdo. \r (Source:  United States\r Antartcia Program. Courtesy of the\r  NSF)\n  The PM-3A nuclear reactor was above all meant to be \rportable as it was designed with the LC-130 aircraft in mind as its \rdelivery system. [3] Although McMurdo is accessible by ship, it was \roriginally thought that this reactor would power bases inland such as \rthat located at the South Pole which are accessible only by aircraft. \r[3] For reliability and transportability reasons, the PM-3A was designed \rto be a pressurized water reactor. [3] Its core utilized highly enriched \ruranium, 93.1% in relative amount of the isotope U-235, whose fuel \rassembly was roughly the size of an oil drum. [5] Fig. 2 shows the \rinstallation of the PM-3A core onsite. The reactor arrived in modules at \rMcMurdo in December of 1961 by way of the USNS Arneb. [3] Fig. 3 shows \rone of the nuclear reactor modules being unloaded at McMurdo. The PM-3A \rwas assembled on a foundation of solid volcanic rock at an altitude of \r300 feet on the side of Observation Hill, a site that overlooks McMurdo \rStation. [3] Fig. 4 shows the completed reactor site overlooking McMurdo \rStation.\n  The PM-3A was operated by the Naval Nuclear \rPropulsion Unit consisting of a crew of 25. [3] The reactor went \rcritical in March of 1962 and supplied useful electricity to McMurdo in \rJuly of 1962. [3] It took a total of 23 months to complete testing and \rdebugging of the PM-3A nuclear plant. [3] After this time, control of \rthe plant was turned over from the Martin Company to the US Navy. [3] \rOnce fully operational, the role of the plant was twofold, to produce \relectricity for McMurdo in the amount of 1.8 MW as well as to produce \rsteam to operate a desalination plant for the production fresh drinking \rwater in the amount of 14,000 gallons per day. [3]\n    With a total of 438 malfunctions during its \roperational lifetime from 1964 to 1972, the reactor at McMurdo proved to \rbe an unreliable source of power generation, available only 72% of the \rtime. [1] Because of this, in May of 1972, it was determined by an \rindependent assessment from the Bechtel Corporation that the PM-3A was \rnot cost effective and that replacement with modern diesel-electric \rgenerators would require less staff and would also be more reliable. [1] \rIn September 1972, the PM-3A was shut down for routine maintenance and \rinspection. [1] It was determined that conditions existed in the system \rfor chloride stress corrosion cracking, a situation where sudden failure \rcan occur in normally ductile materials under tension in a corrosive \renvironment. [1,6] Inspection of a an accessible section of pipe \rrevealed no incidences of this occurring, however, the Navy refused to \rrule out cracking on surfaces which could not be inspected and thus \rcalled for a full dismantling and inspection of the reactor before it \rcould be deemed safe. [1] The cost associated with this full inspection \rand possible repair of reactor components was a major factor in the \rdecision to decommission the plant. [1]\n    After 10 years of operation, the PM-3A was \rpermanently shut down in 1972, achieving only half of the expected \rdesign life of 20 years. [1] The next step was clean up of the reactor \rsite. The PM-3A and generated radioactive waste could not remain at \rMcMurdo due to the internationally agreed upon Antarctic Treaty which \rprevents both nuclear weapons testing as well as nuclear waste dumping \rin the Antarctic. [7] As such, a large-scale effort was undertaken to \rremove the reactor components, buildings, and contaminated soil for a \rtotal of 365 metric tons of radioactive waste to the continental United \rStates. [7] It was later determined that there were indeed cracks in the \rcontainment vessel which leaked coolant water into the crushed gravel \rthat had been used as the reactor shield which is what resulted in such \ra large area of contamination. [4] As such, more than 9000 cubic meters \rof contaminated soil was relocated to the continental US. [1] In total, \rseven enriched uranium fuel cores were shipped to McMurdo, three of \rwhich had yet to be used as the plant was expected to operate for \rseveral more years. [7] The reactor cores, components, and highly \rradioactive gravel that was used to shield the reactor were shipped to \rthe Department of Energy Savannah River Plant in South Carolina. [1] The \rremaining low-level contaminated soil was shipped to the Naval base at \rPort Hueneme, California. [1] The clean up operation lasted until 1979 \ras work on the site could be performed only during the austral summer. \r[7]\n    As a result of the multiple malfunctions of the PM-3A \ras well as it&#39;s clean up activities, there have been concerns that the \rhealth of personnel involved with the reactor may have been adversely \raffected. [7] Although members of the Navy Nuclear Propulsion Unit were \rcontinuously monitored for radiation, many of the military support crew \rwere not. [7] As such, a study was undertaken by the Department of \rDefense to estimate an upper bound on radiation exposure for these \rindividuals based on the worst cases of the available data from McMurdo. \r[7] Levels of radioactivity in the water were monitored once the PM-3A \rwas used in the production of drinking water. [7] During the first few \ryears of fresh water production (between 1967 and 1969) there were \rseveral instances of abnormally high amounts of tritium in the drinking \rwater. [7] In addition, there was a case of abnormally high amounts of \rlong-lived beta activity in the drinking water in 1969. [7]\n    In addition to problems with the drinking water and \renvironmental contamination, there were several recorded instances of \rcrew radiation exposure, some resulting in injury. [7] During the plant \roperation, 223 reports of abnormal levels of radiation were recorded. \r[7] Of these cases, 14 resulted in injury and 123 resulted in exposure \rin the amount of 0.350 rem over a period of 7 days. [7] This is a \rsubstantial amount of radiation when it is estimated that, one average, \ra typical yearly dose from background sources is 0.240 rem. [8] The \rremaining 86 instances were abnormal radiation levels detected within \rthe plant and its immediate surroundings. [7] The conclusion was that a \rsupport member would have received a maximum dose of 0.2 to 0.6 rem to \rthe thyroid or 0.2 to 0.5 rem to the red bone marrow per austral summer \rtour. [7] The upper bound here is equivalent a typical radiation dosage \rreceived by a person living in the United States from typical background \rradiation and medical procedures. [7] It is, however, recognized that \rthere were personnel who may have been exposed to radiation outside the \rconfines of factors and data considered in those figures that may be \religible for compensation. [7] In addition, the estimated dose above \rdoes not include members who were part of the decommissioning procedures \rwho may have inhaled or ingested contaminated particles. [7]\n    The nuclear reactor installed at McMurdo Station was \rthe first and only to operate on the Antarctic continent. It operated \rfor 10 years and greatly reduced the need for fossil fuels in the \rAntarctic. Although it was initially thought to be a cost saving device, \rits unreliability, large operational crew, and large clean up proved it \rto be an expensive experiment. As a memorial, a plaque now stands at the \rsite of the nuclear power station in McMurdo commemorating the people \rand services of the PM-3A.\n  © Tyler Reid. The author grants permission to \rcopy, distribute and display this work in unaltered form, with \rattribution to the author, for noncommercial purposes only. All other \rrights, including commercial rights, are reserved to the author.\n    [1]\t&#34; McMurdo Station Reactor \rSite Released For Unrestricted Use,&#34; Antarctic J. United States \r 15, No. 1, 1 (1980).\n  [2]\tA. G. Klein  et al., &#34;The Historical \rDevelopment of McMurdo Station, Antarctica, an Environmental \rPerspective,&#34; Polar Geography  31, 119 (2008).\n  [3]\tW. Shafer, &#34; Five\rYears of Nuclear Power at McMurdo Station,&#34; Antarctic J. United \rStates  2, No. 2, 38 (1967).\n  [4]\tL. H. Suid,  The Army&#39;s Nuclear Power Program: \rThe Evolution of a Support Agency (Praeger, 1990).\n  [5] J. B. Brown, V. W. Storhok, and J. E. Gates, \r&#34; Postirradiation Examination of the PM-3A \rType 1 Serial 2 Core. Part I. Postirradiation of Fuel Tubes,&#34; \rBattelle Memorial Institute, 28 Feb 67.\n  [6]\tK. Sieradzki and R. C. Newman, \r&#34;Stress-Corrosion Cracking,&#34; J. Phys. Chem. Solids  48, 1101 \r(1987).\n  [7]\t&#34;Upper-Bound Radiation Dose Assessment for \rMilitary Personnel at McMurdo Station, Antarctica, between 1962 and \r1979,&#34; U.S. Defense Threat Reduction Agency, \r DTRA-TR-12-003, June 2013.\n  [8]\t&#34;Sources and Effects of Ionizing Radiation, \rUNSCEAR 2008 Report,&#34; United Nations Scientific Committee on the Effects \rof Atomic Radiation,  Report and Annexes \r A,  B, \r C,  D, \rand  E, 2010.", "posttime": "2021-06-18 21:07:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "station,power,辐射", "title": "McMurdo Station，南极洲核电站 ", "title_en": "Nuclear Power at McMurdo Station, Antarctica", "transed": 1, "url": "http://large.stanford.edu/courses/2014/ph241/reid2/", "via": "", "real_tags": ["station", "power", "辐射"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "勇敢的是基于铬的浏览器，它配备了一个内置的adblocker，并带有“奖励”程序，应该让您赚钱。但是，今天的相关部分是勇敢的是宣布为“默认私人浏览器”。\n 勇敢采取了类似的虚假隐私方法与其他公司相似（是苹果，我正在看着你），他们使用“隐私”来营销，但实际上他们提供了一个虚伪的服务，“阻止跟踪”，而是追踪你和利润你。\n  一点都不。声称这一点的人已经为勇敢的营销策略而堕落，这包括告诉谎言和有缺陷的论据。\n 我会给你许多事实和反驳论点，这将阻止自己落下勇敢的谎言。\n   最大勇敢的卖点之一是他们的内置adblocker。但是，让我告诉你一些关于勇敢的adblocker的事情：\n 他们的adblocker只是一个笨蛋起源的叉子，这不一定是坏的。当你意识到它有一个硬编码白名单时，问题就会出现。他们是来自Facebook和Twitter的追踪追踪器，因此他们可以使用第三方的脚本＆＃39;网站跟踪您的网站。这是他们的回应：\n 从边缘缓存加载脚本不跟踪没有第三方cookie或等效浏览器 - 本地存储的用户，这始终会阻止并始终阻止。换句话说，发送请求和接收响应而没有饼干或识别用户的其他方式不一定创建跟踪威胁。 \n这完全是假的。他们对他们的用户撒谎。任何了解JavaScript如何工作的人以及跟踪您的容量而无需使用cookie在阅读后会笑。\n 使用Facebook和Twitter的脚本足以跟踪和识别您。阻止饼干没有帮助。\n 我的意思是，如果Facebook的脚本（那是BTW）追踪你的话，制作“私人”浏览器的重点是什么？\n 其内置adblocker的另一个问题是，要与浏览器的核心分开的扩展更好，因为它们不遵循彼此的更新周期。这意味着您需要更新整个浏览器以修复adblocker中的错误。愚蠢，不是吗？\n 避免使用勇敢的另一个原因是Ublock Origin在Firefox上最适合效果，并且没有任何勇敢的事情可以做到这一点。\n 限制是铬的故障，谷歌不会对此做任何事情。勇敢依赖于谷歌，他们总是受到这一事实的限制。由于它们基于Google的浏览器和Web引擎，谷歌将在95％的勇敢的发展决策。重要的是要把焦点带到勇敢的事实不仅仅是具有另一个皮肤的铬和具有缩小功能的内置的adblocker。\n 使用由Google制造的浏览器的其他副作用是谷歌将采取有利于其广告业务的决策，例如在任何基于铬的浏览器上使用adblockers的决定。当然，这将影响勇敢。 \n然而，当然，他们不会在他们的主页上告诉你这一切。他们的一部分营销策略包括使他们的“隐私盾牌”看起来像世界上最好而无与伦比的adblocker，当时它只是一个真正有限的Ublock原产地，一个硬编码的白名单。\n  奖励是他们的糟糕计划，将用自己的网站替换广告。他们声称你可以用它赚钱。好吧，他们并没有对你撒谎。如果在一个月内赚半个便士对你来说没问题，因为当然，他们正在跟踪你的奖励，然后享受你的钱。但请记住，勇敢的费用是您收入的30％。\n 如果您不介意，并且您决定使用奖励，那么表示奖励使用维护，这是一个很好的政策/ s：\n 要验证您的身份，我们会收集您的姓名，地址，电话，电子邮件和其他类似信息。我们还可能要求您提供额外的个人数据进行验证目的，包括您的出生日期，纳税人或政府识别号码，或政府发布的识别副本\n Uphold使用VERIFF来验证您的身份，通过确定您所采取的自拍照与您的政府签发的身份识别相匹配。 Veriff的面部识别技术从您的照片收集可能包括生物识别数据的照片，并且当您提供自拍照时，您将被要求同意从您提交的照片中处理生物识别数据和其他数据（包括特殊类别）与坚持分享。自动化进程可用于进行验证决策。\n 与流行的信念相反，奖励并不选择。不相信我？自己检查一下。无论您使用奖励是否使用奖励，勇敢会将请求与以下域名提交给以下域名：\n  名称可能有点令人困惑，但这些域不仅适用于更新，他们为勇敢的奖励获取附属公司，具有语法，柔和，秉承等潮汐等潮流。 \n因此，尽管有明确的选择，但勇敢的奖励仍将用于跟踪您。\n  他们还向各种域提出要求，这些域被认为与奖励的加密方面有关。由于这篇文章更好地解释了，我不会在这里详细说明。在这里，您有一个包含勇敢的不同域的列表，向以下命令发送请求：\n   它也值得一提到勇敢的遥控器。勇敢将使域名p3a.brave.com作为遥测的要求。这次遥测可以选择退出，但很多人都相信他们的营销，并认为勇敢的是私人开箱即用。\n  brave-core-ext.s3.brave.com获取5个扩展并安装它们。据说这可能是一个后门。但我不想得到阴谋主义者。我更喜欢给你核查事实。我会限制自己通知你有关可疑活动。\n  关于Firefox的口袋有很多批评。但是勇敢的东西有类似的东西，今天被称为勇敢。\n 它显示在每个空白选项卡中。此功能向勇敢的服务器发送大量请求。它无法禁用。\n 因此，您唯一的选项将将标签设置为空白，但您仍然会启用此阴暗CRAP。至少在Firefox上，您可以轻松禁用口袋。 \n此功能旨在“保护”用户从“不安全”网站和扩展“。但是，它似乎有一个相反的效果，因为它发送了获取所需信息的请求，并且勇敢地使用谷歌的Seavebrows不会太远。我会详细说明下一节。\n  勇敢为static1.brave.com提出请求。如果您将此放在浏览器上，您会发现它被指示给Google的错误404页面。\n 勇敢的域名重定向到谷歌的页面并不奇怪吗？嗯，Curl -Head静态1.brave.com显示勇敢使用谷歌的Gstatic，这是使用CloudFlare的BTW。\n 对于“隐私”导向浏览器来连接到CloudFlare和Google的域名是一个关于的问题，因为它们都是遥测。\n  好吧，你必须了解安全和隐私是不同的事情。无论如何，铬具有过程隔离。然而，Firefox也几乎就在那里。它被称为项目裂变。您已经可以在关于：confirce上启用它.Autostart（每晚）。考虑到它仍在开发中。\n 流程隔离是铬在铬在Firefox上的安全性的唯一优势，它无法帮助您隐私。如果您觉得流程隔离是必须拥有的，您甚至可能想要启用裂变。\n  勇敢每次运行它都会检查更新。您无法关闭它，这意味着每次启动浏览器时都会勇敢地提出此请求。勇敢的隐私奉献真是太棒了/ s。 \n好的，我们已经看到了勇敢的一切，但私有。但我仍然想列出他们过去被抓住的一些阴暗的做法，以防有人仍然认为使用勇敢是个好主意。\n  2020年6月，Twitter用户（@ Cryptonator1337）发现，勇敢的是将推荐代码自动注入加密货币交换站点的URL。\n 因此，如果将“Binance.us”键入URL栏并按Enter键，则勇敢将带您到“Binance.us/?ref=35089877”。\n 当指出时，有一个巨大的丑闻。后来，勇敢的禁用这个代码，在“抱歉我们被抓住”的风格。\n  我已经向你展示了如何忍受的一切，而是隐私尊重。它不会对使用此类服务​​的“隐私友好”浏览器有任何意义，除非他们没有对隐私作出他妈的并且一切只是营销策略......\n  他妈的工具谁，但没有改变DNS？我的意思是，这是完全无能的，或者更糟糕的是，勇敢的团队的恶意。\n   勇敢被指责诈骗人。他们在他们的家庭屏幕上推​​动了这个，因为他们每名用户的联盟链接最多获得200美元。我认为这是一个骗局，因为他们正在减少损失金钱的人们的利润。他们删除了reddit post曝光这个问题和github上的问题。 \n他们也被指责用蝙蝠盗窃，但这是不可验证的，所以我只会为你链接来源。\n  你可能已经看到过去是勇敢的叉子，从勇敢的遥测和其他阴暗的实践中删除了遥控器。它被称为勇敢。\n 嗯，那个项目被勇敢赋予了无数诉讼，他们被迫重命名项目，最后他们不得不放弃恐惧。\n 所以，毕竟，似乎是自由软件，或者他们更喜欢称之为“开源”，只是另一种营销策略。\n 他们根本不关心软件自由，当有人扔掉他们的浏览器并使一个人扔掉并使他们的用户不窥视一个时，他们会骚扰它们，直到叉子死亡，因为使用叉子的人们没有盈利。他们希望您使用勇敢的方式，以便他们销售您的数据，强迫您使用会员链接，并花费30％的“奖励”。\n  我认为此时它很明显，勇敢的不关心用户＆＃39;隐私，他们只关心赚钱。但有一些我没有谈过的东西。这是勇敢的事实是支持谷歌的网络垄断。\n 为什么？如何？好吧，答案很简单：勇敢只是另一个铬皮肤。因此，在结束时，使用勇敢或任何其他基于铬的浏览器时，您将为Google提供市场和支持他​​们的邪恶网络帝国。 \n唯一不使用Google的Web引擎（眨眼）的浏览器是Firefox。因此，如果您真的想要某种隐私，我建议您切换到Firefox或基于Firefox的东西，如GNU Icecat，因为谷歌对浏览器市场的垄断对任何人都不好，即使你喜欢铬，也是如此众所周知，垄断极为消极。\n 正如我之前提到的那样，这已经发生在谷歌尝试摧毁adblockers时。接下来将是什么？迫使每个铬浏览器使用floc？使它无法禁用JavaScript？我们还不知道它，但根据最大的数据矿工和广告公司（谷歌）的发展决策，如果您想要有某种隐私，那么似乎并不是一个好主意。\n  你根本不应该相信勇敢。智能移动将切换到硬化的Firefox，GNU Icecat，Palemoon或Tor浏览器。\n 如果您有任何反参数，任何其他信息，我可以添加到博客文章或任何关于它的东西，您可以在联邦社会中联系我。\n   ＆gt;＆gt;家 ", "note_en": "Brave is a chromium based browser, which comes with a built-in adblocker and with a “rewards” program, that is supposed to make you earn money. But the relevant part today is that Brave is advertised as a “private browser by default”.\n Brave has taken the false privacy approach similar to other companies (yes Apple, I’m looking at you), they use “privacy“ for marketing but in reality they provide a hypocritical service that “blocks tracking” but instead tracks you and profits from you.\n  No, not at all. People who claim this have fallen for Brave’s marketing strategy which consists on telling lies and flawed arguments.\n I’ll give you numerous facts and counter-arguments that will prevent yourself from falling for Brave’s lies.\n   One of the biggest Brave’s selling points is their built-in adblocker. But let me tell you a couple of things about Brave’s adblocker:\n Their adblocker is just a fork of uBlock Origin, which isn’t necessarily bad. The problem comes when you realise that  it has a hardcoded whitelist. They’re   whitelisting trackers from Facebook and Twitter, so they can use scripts in third parties&#39; websites to track you across the web. This was their response:\n Loading a script from an edge-cache does not track a user without third-party cookies or equivalent browser-local storage, which Brave always blocks and always will block. In other words, sending requests and receiving responses without cookies or other means of identifying users does not necessarily create a tracking threat.\n This is completely false. They’re blatantly lying to their users. Anyone who knows a bit about how JavaScript works and it’s capacities to track you without the need of using cookies will be laughing after reading that.\n Using Facebook’s and Twitter’s scripts is more than enough to track and identify you. Blocking cookies doesn’t help.\n I mean, what’s the point on making a “private” browser if Facebook’s scripts (that are everywhere btw) will track you?\n Another problem with their built-in adblocker is that it’s better for extensions to be separated from the core of the browser, since they don’t follow each other’s update cycles.  This means that you need to update the entire browser to fix a bug in the adblocker. Stupid, isn’t it?\n Another reason to avoid using Brave is that   uBlock Origin works best on Firefox and there isn’t anything that Brave can do about it.\n The limitations are Chromium’s fault and Google isn’t going to do anything about it. Brave is dependent on Google and they’ll always be limited by this fact. Since they’re based on Google’s browser and web engine, Google takes development decisions over the 95% of Brave. It’s important to bring focus to the fact that  Brave isn’t more than Chromium with another skin and a built-in adblocker with reduced functionality.\n Other side effect of using a browser which is made by Google is that  Google will take decisions that benefit their advertisement business, like   making impossible to use adblockers on any Chromium based browser. And of course, this will affect Brave.\n However, of course that  they won’t tell you anything of this on their homepage. Part of their marketing strategy consists on making their “privacy shield” look like the best and unrivaled adblocker in the world, when it is just a really limited uBlock Origin, with a hardcoded whitelist.\n  Rewards is their shitty program that will replace ads displayed on websites with their own. They claim that you can earn money with it. Well, they aren’t lying to you on this. If earning half a penny in a month is okay for you, in exchange of your privacy, because of course, they’re tracking you with Rewards, then enjoy your money. But remember, Brave’s fee is 30% of your earnings.\n If you don’t mind that and you decide to use Rewards, it’s important to say that Rewards uses Uphold, which has an excellent policy /s:\n To verify your identity, we collect your name, address, phone, email, and other similar information. We may also require you to provide additional Personal Data for verification purposes, including your date of birth, taxpayer or government identification number, or a copy of your government-issued identification\n Uphold uses Veriff to verify your identity by determining whether a selfie you take matches the photo in your government-issued identification. Veriff’s facial recognition technology collects information from your photos that may include biometric data, and when you provide your selfie, you will be asked to agree that Veriff may process biometric data and other data (including special categories of data) from the photos you submit and share it with Uphold. Automated processes may be used to make a verification decision.\n Contrary to popular belief, Rewards isn’t opt in. Don’t believe me? Check it yourself.  Brave will recurrently make requests to the following domains, no matter if you use Rewards or not:\n  The names can be a bit confusing but these domains aren’t just for updates and  they fetch affiliates for Brave Rewards, with pings such as Grammarly, Softonic, Uphold, etc.\n So  despite explicitly opting out, Brave’s Rewards will still be used to track you.\n  They also make requests to various domains that are believed to be related to the crypto aspect of Rewards. I won’t elaborate here since it’s better explained on  this article. Here you have a list with the different domains that Brave sends a request to:\n   It is also worth mentioning that  Brave has built-in telemetry.  Brave will make a ton of requests to the domain p3a.brave.com as telemetry. This telemetry can be opted out, but a lot of people believe in their marketing and think that Brave is private out of the box.\n  brave-core-ext.s3.brave.com fetches 5 extensions and installs them. It is said that this might be a backdoor. But I don’t want to get conspiracist. I prefer giving you verifiable facts. I’ll limit myself to inform you about suspicious activities.\n  There is a ton of criticism about Firefox’s Pocket. But Brave has something similar, which is called Brave Today.\n It is displayed in every blank tab. This feature sends lots of requests to Brave’s servers.  It can’t be disabled.\n So your only option would be setting the tabs to blank, but you’ll still have this shady crap enabled. At least on Firefox you can easily disable Pocket.\n  This features is intended to “protect” the user from “unsafe” websites and extensions. However, it seems to have a contrary effect, since  it sends requests to fetch the information required And it wouldn’t be too far-fetched of Brave  to use Google’s SafeBrowsing. I’ll elaborate on the next section.\n  Brave makes requests to static1.brave.com. If you put this on a browser you’ll find that it was directed to Google’s error 404 page.\n Isn’t it weird that one of Brave’s domains redirects to a Google’s page? Well, curl –head static1.brave.com shows that  Brave uses Google’s gstatic, which is btw using Cloudflare.\n It’s a concerning issue for a “privacy” oriented browser to connect to Cloudflare’s and Google’s domains, since both of them are telemetry.\n  Well, you have to understand that security and privacy are different things. Anyway, It is true that Chromium has process isolation. However, Firefox is almost there too. It’s known as the Project Fission. You can already enable it on the about:config with fission.autostart (on nightly). Take into account that it’s still under development.\n Process isolation is the only advantage in security that chromium has over Firefox right now and it will not help you with privacy. You may even want to enable Fission if you feel like process isolation is a must have.\n  Brave will check for updates every time you run it.  You can’t turn it off, which implies that Brave’ll make this request every time you launch the browser. Brave’s dedication to privacy is truly amazing /s.\n  Okay, we’ve seen how Brave is everything but private. But I’d still like to list you some of the shady practices they’ve been caught doing in the past, just in case there is someone who still thinks that using Brave is a good idea.\n  In June 2020, a twitter user (@cryptonator1337) discovered that  Brave was automatically injecting referral codes into URLs for cryptocurrency exchange sites.\n So if you typed “binance.us” into the URL bar and pressed enter, Brave would take you to “binance.us/?ref=35089877”.\n There was a huge scandal when this was noted. Later, Brave disabled this in the code, in a “sorry we got caught” style.\n  I’ve already shown you how Uphold is everything but privacy respecting.  It wouldn’t make any sense for a “privacy friendly” browser to use such a service, unless they didn’t give a fuck about privacy and everything was just a marketing strategy…\n  Who the fuck implements Tor but doesn’t change the DNS? I mean, this is either total incompetence or, even worse, malevolence on the part of Brave’s team.\n   Brave have been accused of  scamming people. They’ve been promoting this on their home screen, since they get up to $200 per user that uses their affiliate link. I consider this a scam since they’re making a ton of profit from people who will lose their money.  They removed the Reddit post exposing this and the issue on Github.\n They were also accused of theft with BAT but this isn’t verifiable so I’ll only link the  source for you.\n  You may have seen in the past a fork of Brave which removed telemetry and other shady practices from Brave. It was called Braver.\n Well, that project was given countless lawsuits by Brave, they were forced to rename the project and finally they had to give up out of fear.\n So, after all, it seems that  being free software, or as they prefer to call it, “open source”,  is just another marketing strategy.\n They don’t care at all about software freedom and when someone forks their browser and make one that doesn’t spy on their users, they will harass them until the fork dies, since people using forks aren’t profitable. They want you to use Brave so they can sell your data, force you to use affiliate links and take a 30% cut of your “rewards”.\n  I think that at this point it’s clear that Brave doesn’t care about users&#39; privacy, they only care about making money. But there is something that I haven’t talked about. It’s the fact that Brave is supporting Google’s web monopoly.\n Why? How? Well, the answer is pretty simple: Brave is just another Chromium skin. So at the end, when using Brave or any other Chromium based browser, you’re giving marketshare to Google and supporting their evil web empire.\n The only browser that does not use Google’s web engine (blink)  is Firefox. So if you really want some kind of privacy I’d recommend you switching to Firefox or something Firefox based, like GNU Icecat, since a Google’s monopoly on the browsers market can’t be good for anyone, even if you love Chromium, it is known that monopolies are extremely negative.\n And as I mentioned before,  this is already happening with Google trying to destroy adblockers. What will be next? Forcing every Chromium browser to use FLOC? Making it impossible to disable JavaScript? We don’t know it yet, but depending on the biggest data miner and advertisement company (Google) development decisions doesn’t seem a great idea if you want to have some kind of privacy.\n  You shouldn’t trust Brave at all. The smart move would be switching to  hardened Firefox, GNU Icecat, Palemoon or the Tor browser.\n If you have any counter-argument, any other info that I could add to the blog post or anything to say about it, you can reach me on the fediverse.\n   &gt;&gt; Home", "posttime": "2021-06-18 21:07:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "错误,false", "title": "勇敢，隐私的错误感觉 ", "title_en": "Brave, the false sensation of privacy", "transed": 1, "url": "http://ebin.city/%7Ewerwolf/posts/brave-is-shit/", "via": "", "real_tags": ["错误", "false"]}, {"category": "", "categoryclass": "", "imagename": "85eef9feb4631daca7a8e01470161dd5.png", "infoid": 1066695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "量子信息处理从纯粹的学科对科学和工业的应用稳步发展。从基于实验室的概念证明实验转换为强大的，量子信息处理硬件的集成实现是该过程的一个重要步骤。然而，传统实验室设置的性质并不容易提供缩放系统尺寸或允许在实验室级环境之外的应用。这种过渡需要克服工程和整合的挑战，而不牺牲实验室实施的最先进的性能。这里，我们在线性保罗陷阱中介绍了一个基于40 CA +光学距离的19英寸机架量子计算演示，以解决许多这些挑战。我们概述了机械，光学和电气子系统。此外，我们描述了量子计算堆栈的自动化和远程访问组件。我们通过描述与量子计算相关的表征测量，包括站点解决的单反相互作用，以及通过通过两个不同的寻址方法传递的Mølmer-sørensen交互介导的缠结操作。使用此设置，我们生产最大缠绕的绿鹂-Horne-Zeininger状态，最多可使用多达24个离线或错误缓解技术;与成熟的传统实验室设置相提并论。\n  12在美国物理社会上发表的12.0税收条款4.0国际许可。此项工作的进一步分配必须维持向作者和已发表的文章和第39条的标题，期刊引文和DOI归属。\n   ×\n     没有必要获得重复使用本质的许可或其组件，因为它根据创意公共4.0国际许可证的条款提供。如果许可证许可证允许任何媒体的无限制使用，分发，安德生产，为提交人提供了归属已发表的文章＆＃39;冠军，期刊引文和Doi令人着迷。请注意，有些数字可能已被其他第三方纳入普及。您的责任是在职权持有人的正确许可中直接申请。\n × ", "note_en": "Quantum information processing is steadily progressing from a purely academic discipline towards applications throughout science and industry. Transitioning from lab-based, proof-of-concept experiments to robust, integrated realizations of quantum information processing hardware is an important step in this process. However, the nature of traditional laboratory setups does not offer itself readily to scaling up system sizes or allow for applications outside of laboratory-grade environments. This transition requires overcoming challenges in engineering and integration without sacrificing the state-of-the-art performance of laboratory implementations. Here, we present a 19-inch rack quantum computing demonstrator based on     40  Ca + optical qubits in a linear Paul trap to address many of these challenges. We outline the mechanical, optical, and electrical subsystems. Furthermore, we describe the automation and remote access components of the quantum computing stack. We conclude by describing characterization measurements relevant to quantum computing including site-resolved single-qubit interactions, and entangling operations mediated by the Mølmer-Sørensen interaction delivered via two distinct addressing approaches. Using this setup, we produce maximally entangled Greenberger-Horne-Zeilinger states with up to 24 ions without the use of postselection or error mitigation techniques; on par with well-established conventional laboratory setups.\n  12 More   Published by the American Physical Society under the terms of the  Creative Commons Attribution 4.0 International license. Further distribution of this work must maintain attribution to the author(s) and the published article&#39;s title, journal citation, and DOI.\n   ×\n     It is not necessary to obtain permission to reuse thisarticle or its components as it is available under the terms ofthe  Creative Commons Attribution 4.0 International license.This license permits unrestricted use, distribution, andreproduction in any medium, provided attribution to the author(s) andthe published article&#39;s title, journal citation, and DOI aremaintained. Please note that some figures may have been included withpermission from other third parties. It is your responsibility toobtain the proper permission from the rights holder directly forthese figures.\n ×", "posttime": "2021-06-18 21:07:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,server,实验室", "title": "一个紧凑的量子计算机，适用于19英寸服务器机架 ", "title_en": "A compact quantum-computer that fits in 19-inch server racks", "transed": 1, "url": "https://journals.aps.org/prxquantum/abstract/10.1103/PRXQuantum.2.020343", "via": "", "real_tags": ["计算机", "server", "实验室"]}, {"category": "", "categoryclass": "", "imagename": "080e3b0db1f05ffd1aed9f27aaae1e92.png", "infoid": 1066694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有毒的管理员驱逐出资/捐赠。我参加了一所大学，他们严重限制学生组织直接捐款。大学政策是，捐助者可以捐赠给大学并获得税收扣除，或捐赠给学生组织，而不是获得税收扣除，但他们可以捐赠给两者，仍然捐赠给大学和仍然达到大学＆＃39; s税收扣除。\n 这所大学的学生组织数量艰难地跌倒了，因为大学也紧紧闪过这些组织，尤其是他们可以赚钱的最大现金重型工程组织＆＃39; t运行足够的烘烤销售和其他可爱的东西涵盖他们的费用。我很确定唯一一个拥有完整资金的唯一一个可以在最小预算中运行或产生许多积极宣传的那些。\n 最大的笑话我看到的是，当该大学给予了一个全新的SAE公式混合大学团队时，大约3000美元，并规定如果该团队成功竞争同一年，他们只会获得更多资金＆＃39;国家竞争。\n 我知道常规SAE公式，你需要至少50万美元才能获得一辆车通过技术检查。\n 他们也给太阳能汽车队给了几百美元。当然，当他们耗尽框架时，该团队不再存在，其他学生工程组织迅速蚕食其自己的项目。\n 编辑：我记得一名学生组织从大学逃离大学以作为独立组织的学生，所以他们可以获得赞助商捐款。当然这意味着他们无法在大学的理由上招募大学活动，使用大学和＃39;房间或共用空间进行会议，使用大学＆＃39; S机商店或询问大学＆＃39; S教职员工的建议。 ", "note_en": "Toxic admin drives away funding/donations. I attended a university where they severely restricted student organizations from directly getting donations. The university policy was that donors can either donate to the university and get the tax deduction, or donate to the student organizations and  not get the tax deductions, but they can&#39;t donate to both and still get the university&#39;s tax deduction.\n The amount of student organizations at that university tumbled down hard because the university was also tight-fisted with giving money to those organizations, especially the more cash-heavy engineering organizations where they can&#39;t run enough bake sales and other cutesy stuff to cover their expenses. I&#39;m pretty sure the only ones that got their full needed funding were the ones that could run on minimal budget or generated lots of positive publicity.\n The biggest joke I&#39;ve seen was when that university gave a brand new SAE Formula Hybrid collegiate team about $3000, and stipulated that they would only get more funding if that team successfully competes that same year&#39;s national competition.\n I know for the regular SAE Formula, you need a minimum of $50K to even get a vehicle to pass through the tech inspections.\n They also gave a few hundred dollars to a solar car team. That team of course ceased to exist when they ran out of money just building the frame, which other student engineering organizations promptly cannibalized the parts for their own projects.\n EDIT: I recall seeing one student org that broke away from the university to run as an independent org so they could get sponsor donations. Of course that meant they couldn&#39;t recruit on university grounds, partake in university events, use the university&#39;s rooms or shared spaces for meetings, use the university&#39;s machine shop or ask the university&#39;s faculty staff for advice.", "posttime": "2021-06-18 21:06:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "reddit,removed,大学", "title": "reddit删除 ", "title_en": "Removed by Reddit", "transed": 1, "url": "https://old.reddit.com/r/pics/comments/o2d4fc/removed_by_reddit/", "via": "", "real_tags": ["reddit", "removed", "大学"]}, {"category": "", "categoryclass": "", "imagename": "6a1a58bc21c8c99165ad6e07aa736c28.gif", "infoid": 1066693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Snakes的简单性但优异的流动性使他们成为智能学家的理想生物，但它也产生了彻头彻尾的机器人。加州大学的研究人员更糟糕的是，圣巴巴拉和佐治亚理工学院的研究人员制作了一个蛇麻，可以挖洞地下，所以我们永远不会看到它来了。\n  迄今为止，我们已经设法到了可以处理几乎任何地形的工程师和自治生物，在火星的岩石表面上滚动，潜水，跳过天空，甚至吓坏了一段楼梯。机器人尚未探索的地方是地下。我们不是在谈论潜水的潜水洞穴，而是挖掘和挖掘自己的道路，就像无数母亲的创作一样。\n 我们之前看到了蛇蛇，但UCSB和佐治亚州科技的研究人员创造了一种新的设计，具有几个关键升级，使其更容易挖掘自己的颗粒材料。与其他蜗牛不同，这个版本是被认为是一个软体机器人的东西，因为，顾名思义，它可以为柔性材料进行刚性件，使其更轻，更适应，因为它可以更容易地弯曲，扭曲和扭曲其身体。\n    通过任何材料挖洞的最大挑战之一是创造的摩擦，并且必须克服它。因此，研究人员从自然中获得了更多的灵感，并通过仅仅从尖端生长，将机制植物用来深入挖掘土壤，留下剩下的根固定。斯卡托做了同样的事情，只有在垃圾桶的尽头，其余的身体实际上根本没有移动，消除了摩擦的主要来源。如果你曾经努力把根扎出来，那就是因为你正在反对其整个长度磨损对周围土壤的摩擦。\n   斯卡托的尖端仍然需要一定程度的力量，在它挖掘时将沙子和土壤推开，但研究团队再次发现了灵感，使这项任务更容易获得机器人。就像南沙章鱼一样，将水喷射到海底放松沙子，所以它可以将自己埋入保护的防御机制，蛇谱发射爆炸的空气，以创造一个更容易的沙子和土壤的空气推动。\n   通过将带有略微向下的空气爆炸的楔形“头”将楔形的“头”组合，蛇谱松散了前方的土壤和下方，以减小天然存在于颗粒材料中的力，该力倾向于将较大的物体推向表面。它不仅可以让蛇弯曲更容易挖掘，但它也使其更容易在洞穴中保持地下。\n  除了让世界提供一个焦虑的一个来源之外，挖洞蛇谱确实有一些真正的有用的应用程序，而不仅仅是给世界的军队，可以成为一个自主武器，可以挖洞，铁丝网，陆地矿山的土地矿山和其他障碍物。虽然我们送到火星的流浪者都配备了钻探，但是通过挖掘它们的表面下方更深入地挖掘邻近的行星。它甚至可能是考古学的有用工具，让科学家们探索一个网站而不必打扰表面上的内容，直到需要出土的东西。 ", "note_en": "The simplicity but excellent mobility of snakes makes them an ideal creature for roboticists to emulate, but it also yields robots that are downright creepy. Making things worse, researchers at the University of California, Santa Barbara, and Georgia Tech, have made a   snakebot that can burrow underground so we’ll never see it coming.\n  To date, we’ve managed to engineer robots and autonomous creatures that can handle almost any terrain, be it rolling across the   rocky surface of Mars,   diving below the waves,   soaring through the sky, or even   deftly tackling a flight of stairs. Where robots have yet to explore is underground. We’re not talking about spelunking through a cavernous subterranean cave, but instead burrowing and forging their own path through sand and soil like countless of Mother Nature’s creations do.\n We’ve seen   snakebots before, but the   researchers at UCSB and Georgia Tech have created a new design with several key upgrades that allow it to more easily dig through granular materials all on its own. Unlike other   snakebots, this version is what’s considered a soft body robot because, as the name implies, it forgoes rigid parts for flexible materials that make it lighter and more adaptable because it can more easily bend, twist, and contort its body.\n    One of the biggest challenges of burrowing through any material is the friction created, and having to overcome it. So the researchers took more inspiration from nature and copied the mechanism plants use to dig deep into the soil by growing only from the tip, leaving the rest of the root stationary. The snakebot does the same thing, growing only from the end of the bot so the rest of its body doesn’t actually move at all, eliminating a major source of friction. If you’ve ever struggled to pull a root out of the ground, it’s because you’re fighting against the friction of its entire length abrading against the surrounding soil.\n   The snakebot’s perpetually growing tip still requires a certain level of force to push sand and soil out of its way while it digs, but the research team once again found inspiration in nature to make this task easier for their bot. Like the southern sand octopus which shoots a jet of water into the ocean floor to loosen sand so it can bury itself as a protective defense mechanism, the snakebot fires a blast of air ahead of it to create a fluidized version of sand and soil that’s easier to push through.\n   By combining a wedged-shape ‘head’ with a blast of air directed slightly downwards, the snakebot loosens the soil ahead of, and below it, to reduce forces that naturally occur in granular materials that tend to push larger objects towards the surface. It not only makes it easier for the snakebot to dig, but it also makes it easier to remain underground as it burrows.\n  Besides giving the world one more source of anxiety, the burrowing snakebot does have some genuinely useful applications, and not just giving the militaries of the world an autonomous weapon that can burrow beneath walls, barbed wire, fields of land mines, and other obstacles. While the rovers we’ve sent to Mars are equipped with drills, there’s far more to be learned about neighboring planets by digging much deeper beneath their surfaces. It could even be a useful tool for archeology, letting scientists explore a site without having to disturb what’s on the surface until something needs to be unearthed.", "posttime": "2021-06-18 21:06:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现在,snakebots,挖掘", "title": "伟大的，蛇刀现在可以挖洞地下，所以我们永远不会看到他们来了 ", "title_en": "Great, Snakebots Can Now Burrow Underground So We'll Never See Them Coming", "transed": 1, "url": "https://gizmodo.com/great-snakebots-can-now-burrow-underground-so-well-nev-1847120499", "via": "", "real_tags": ["现在", "snakebots", "挖掘"]}, {"category": "", "categoryclass": "", "imagename": "16c013f7c3f42c736c27342c6be5ce3a.jpg", "infoid": 1066692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你＆＃39;你的某一代，你有机会想象（或者，在你的成年，建造）你自己的家庭拱廊，类似于金色的东西，而80s时代。一个有用的道路，使这个现实，特别是在更紧密的宿舍，是＆＃34;多人，＆＃34;一种将多个游戏喷射到单个柜中的发明。\n 但是，如果你的旧学校游戏梦想围绕着更大和笨重的东西，特别是弹球？直到最近，您的选择要么购买一堆原始弹球柜，要么建立自己的仿真解决方案。后者被弹球扮演和感觉如何变得复杂。\n 我想知道在游戏 - 怀旧的市场上变化需要多长时间，特别是因为像Arcade1up这样的公司生产和销售更多的多种机柜供家用。由于少数制造商生产弹球多个制造商，改变的时间是显然的。 Arcade1up特别是今年推出了三个不同的弹球仿真柜，每个围绕不同的许可证旋转。\n  感谢Arcade1up，I＆＃39; Ve Goale Lock-yous-of this This Mover-of the Its Motiach最有趣的产品：10个经典桌子的集合，全部由威廉姆斯创建的街机鼎盛时期，但为更方便的家庭播放而仿效。 600美元究竟有什么可让您在仿真和构建质量方面？ （ARS Technica可以通过联盟计划获得从本帖子的链接销售的赔偿。）\nArcade1up Pinball系统在今年发布的所有三种型号之间主要相同。大多数物理柜子在其盒子内部预装，并完成了结构 - 类似于经典的弹球机，配有按钮和柱塞 - 用标准螺丝刀简单。最大的捕获将使内阁＆＃39;最大，最重的件，最重，楼梯上楼梯。该部分长34英寸长，17英寸宽，高16英寸。 （幸运的是，您可以拧紧此基部块。）曾经完全建造，这个机柜＆＃39; S最高的背板高达60英寸，而默认的腿从地板上带来35英寸的脚蹼。这些包括可伸缩的脚，即甚至可以调整到套装和＃39; Salance。标准弹球柜的大小约为65％，Arcade1up版本将更有可能适合您最喜欢的游戏室，尽管它看起来更好，而不是坐在时代的官方桌旁旁边。\n    偷看假硬币门，你＆＃39; ll迅速看到Armade1up＆＃39; System从真实的东西不同：一个24英寸液晶面板，偏移到周围的重要性挡板（顶部和底部木材，左右铝）。屏幕下方，Arcade1up依赖于Android加油SOC，将720p视频信号泵在屏幕上，以及用于柱塞的模拟接收器，加速度计感测您的真实生活和＃34;倾斜，＆＃34;和四个螺线管与您的游戏玩法一起重击。其中两个位于鳍状肢按钮附近，以复制击球的感觉，而两个坐在底盘内部的两个贴合，以复制中间凹凸。\n 用背板连接并插入墙壁插座的单个AC适配器，机器已准备好摇滚。套件的一部分为弹丸 - 仿真拼图提供了两个关键块：一个较小的液晶屏，它提供分数信息和中间名动画，以及一对令人惊讶的强大的扬声器。 \n顺便说一句，背板是一种印刷的海报，无论你＆＃39的虚拟游戏如何，都会变化。我的内阁突出了来自火星的原始威廉姆斯攻击，而Arcade1up＆＃39; S另外两个2021型号分别装饰着星球大战和奇迹字符。可悲的是，对于火星内阁的攻击，Arcade1up没有为侧柜艺术获得一个很好的来源（特别是在背板和＃39; s侧面）。这些图像有点翘曲和低res。如果您的默认家庭拱廊有昏暗照明，您甚至可能会注意到。\n 电源开启，经过允许的重叠载s屏幕，Arcade1up＆＃39; S界面弹出，透露由Zen Studios＆＃39提供的10场比赛;数字弹球生态系统。我测试的威廉姆斯机器包括以下内容：\n  如果您购买其他两种模型中的任何一个，请使用ZEN Studios创建的10个虚拟表，以便以前发布的控制台和PC游戏集合，而不是真实的经典娱乐。那个＆＃39;为什么我特别要求这个模型。我对重新创建熟悉的经典更感兴趣，而不是玩Zen Studios＆＃39;仅限数字发明。 ", "note_en": "If you&#39;re of a certain generation, chances are you have imagined (or, at this point in your adulthood, built) your own home arcade that resembles something out of the golden &#39;80s era. One useful path to making this a reality, especially in tighter quarters, is the &#34;multicade,&#34; an invention that squishes multiple games into a single cabinet.\n But what if your old-school gaming dreams revolve around something bigger and bulkier, particularly pinball? Until recently, your options were either buying a bunch of original pinball cabinets or building your own ground-up emulation solution. And the latter is complicated by the realities of how pinball plays and feels.\n I&#39;ve wondered how long it would take for that to change in the gaming-nostalgia market, especially as companies like Arcade1Up produce and sell more multicade cabinets for home use. The time for change is now, evidently, thanks to a handful of manufacturers producing pinball multicades.  Arcade1Up in particular launched three distinct pinball emulation cabinets this year, each revolving around a different license.\n  Thanks to Arcade1Up, I&#39;ve gone hands-on with arguably the most interesting product in its 2021 pinball line: a collection of 10 classic tables, all created by Williams during its  arcade heyday but emulated for more convenient home play. What exactly does $600 get you in terms of emulation and build quality?      (Ars Technica may earn compensation for sales from links on this post through  affiliate programs.)\nThe Arcade1Up pinball system is largely the same across all three models released this year. Most of the physical cabinet is preassembled inside its box, and finishing the construction—which resembles a classic pinball machine, complete with buttons and a plunger—is simple enough with a standard screwdriver. The biggest catch will be getting the cabinet&#39;s biggest, heaviest piece through doors or over stairs. This portion measures 34 inches long, 17 inches wide, and 16.5 inches tall. (Luckily, you can unscrew this base chunk in a pinch.) Once fully built, this cabinet&#39;s tallest backplate gets up to 60 inches in height, while the default legs bring the flippers up 35 inches from the floor. These include twistable feet that you can adjust to even out the set&#39;s balance. At roughly 65 percent the size of a standard pinball cabinet, the Arcade1Up version will more likely fit in your favorite playroom, though it looks better in isolation rather than sitting next to an official table of the era.\n    Peek over the fake coin doors, and you&#39;ll quickly see where Arcade1Up&#39;s system differs hugely from the real thing: a 24-inch LCD panel, offset by a significant bezel all around (wood on top and bottom, aluminum on the left and right). Beneath the screen, Arcade1Up relies on an Android-fueled SoC, which pumps a 720p video signal to the screen, along with an analog receiver for the plunger, an accelerometer to sense your real-life &#34;tilts,&#34; and four solenoids that thump along with your gameplay. Two of them are positioned near the flipper buttons to replicate the sense of striking a pinball, while two fit deeper inside the chassis to replicate midgame bumps.\n With the backplate attached and a single AC adapter plugged into a wall outlet, the machine is ready to rock. Part of the kit offers two crucial pieces to the pinball-emulation puzzle: a smaller LCD screen, which provides score information and midgame animations, and a pair of surprisingly robust speakers.\n  The backplate, by the way, is a printed poster that doesn&#39;t change regardless of which virtual game you&#39;re playing.  My cabinet highlights the original Williams table  Attack From Mars, while Arcade1Up&#39;s two other 2021 models are decorated with   Star Wars and  Marvel characters, respectively. Sadly, for the  Attack From Mars cabinet, Arcade1Up didn&#39;t get a great source for the side cabinet art (especially on the backplate&#39;s sides). Those images are a bit warped and low-res. Should your default home arcade have dim lighting, you may not even notice.\n Power the system on, and after an admittedly overlong loading screen, Arcade1Up&#39;s interface pops up, revealing a selection of 10 games as powered by Zen Studios&#39; digital-pinball ecosystem. The Williams machine I tested includes the following:\n  Should you purchase either of the other two 2021 models, you&#39;ll get 10 virtual tables created by Zen Studios for previously released console and PC game collections, as opposed to recreations of real-life classics. That&#39;s why I requested this model in particular. I was more interested in recreating familiar classics than playing Zen Studios&#39; digital-only inventions.", "posttime": "2021-06-18 20:31:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "弹球,pinball,游戏", "title": "Arcade1up弹球柜评论：适合家庭，有趣的Modders ", "title_en": "Arcade1Up pinball cabinet review: Fine for families, interesting for modders", "transed": 1, "url": "https://arstechnica.com/features/2021/06/arcade1up-pinball-cabinet-review-fine-for-families-interesting-for-modders/", "via": "", "real_tags": ["弹球", "pinball", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "03123c79996fcca9378e37c8e20ff912.jpg", "infoid": 1066691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "爱尔兰警方将有权强迫人们在新立法下进行搜索权证时为电子设备提供密码。  这一变化是在周一的爱尔兰司法部长希瑟Humathreys的GardaSíochána账单的一部分。  Gardaí也将被要求制作书面记录停止和搜索。  这将使能够收集数据，因此可以评估功率的有效性和使用。  将为儿童和可能受损的儿童和嫌疑人引入特别措施。  该法案将在调查调查的调查中，账单更长的拘留期，最高可达48小时。  它还将允许一周举行一周且拘留人口贩运犯罪的拘留，目前最多24小时拘留。 \n＆＃34;这一领域的法律目前很复杂，遍布普通法，数百件立法，宪法和欧盟法律，＆＃34; 部长说。  ＆＃34;将它携带在一起将通过Gardaí清晰，透明和无障碍使用警察权力。  ＆＃34;目的是创建一个系统，即Gardaí使用和容易地了解Gardaí可以使用的权力以及他们在那些情况下的权利是什么。  ＆＃34;与此同时，我们建议将额外的权力扩展到Gardaí，我们也在加强保障措施。 该法案将强烈关注被告的基本权利和程序权利。  ＆＃34;我相信这将保持这一关键的平衡，这是我们刑事司法系统的关键，同时确保了加尔达力量的更明确和精简。＆＃34; ", "note_en": "Irish police will have the power to compel people to provide passwords for electronic devices when carrying out a search warrant under new legislation.\n The change is part of the Garda Síochána Bill published by Irish Justice Minister Heather Humphreys on Monday.\n Gardaí will also be required to make a written record of a stop and search.\n This will enable data to be collected so the effectiveness and use of the powers can be assessed.\n Special measures will be introduced for suspects who are children and suspects who may have impaired capacity.\n The bill will bring in longer detention periods for the investigation of multiple offences being investigated together, for a maximum of up to 48 hours.\n  It will also allow for a week&#39;s detention for suspects in human trafficking offences, which are currently subject to a maximum of 24 hours detention.\n  &#34;The law in this area is currently very complex, spread across the common law, hundreds of pieces of legislation, constitutional and EU law,&#34; the minister said.\n &#34;Bringing it together will make the use of police powers by gardaí clear, transparent and accessible.\n &#34;The aim is to create a system that is both clear and straightforward for gardaí to use and easy for people to understand what powers gardaí can use and what their rights are in those circumstances.\n &#34;At the same time, where we are proposing to extend additional powers to gardaí, we are also strengthening safeguards. The bill will have a strong focus on the fundamental rights and procedural rights of the accused.\n &#34;I believe this will maintain the crucial balance which is key to our criminal justice system, while ensuring greater clarity and streamlining of Garda powers.&#34;", "posttime": "2021-06-18 20:24:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,警方,police,garda", "title": "爱尔兰警方将获得密码的权力 ", "title_en": "Irish Police To Be Given Powers Over Passwords", "transed": 1, "url": "https://www.bbc.com/news/world-europe-57468750", "via": "", "real_tags": ["密码", "警方", "police", "garda"]}, {"category": "", "categoryclass": "", "imagename": "969d9e3fd0b3304f399832e3fc02b3b6.jpg", "infoid": 1066690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下，在过去的一年中，Facebook已经设法获得了战斗royale游戏Fortnite，专注的游戏创作引擎Roblox，以及2020年的畅销游戏，使命召唤：黑色ops冷战。\n 有很多原因，这种狂欢的收购永远不会发生。最大的是，反垄断审查使Facebook越来越困难地获得类似社交网络的任何东西。这是一年多的一年前，该公司购买了奄奄一息的GIF搜索引擎Giphy，这对独立公司的成功前景很少;联合王国的竞争看门狗到目前为止，从结束时阻止了交易，警告收购会以某种方式伤害Facebook的竞争对手。\n 然而，如果你看看虚拟现实景观，Facebook已经制作了一系列的收购，这些收购大致类似于我在上面描述的虚构购物狂欢，如果是更小的规模：\n 上周，Facebook购买了Bigbox VR，战斗皇家游戏人口的制造商：一。射手具有一个结构和一个类似的“季节”的商业模式，类似于史诗般的Fortnite。\n 本周前一周，Facebook购买了单位2游戏，牧师平台制造商。 Crayta让用户以时尚的方式制作和分享游戏，这是罗布洛的快速增长的游戏平台，即今年早些时候公开。\n 2019年Facebook购买了击败游戏，打击游戏的制造商击败了军刀。 Beat Saber是Facebook购买它的Oculus平台上最受欢迎的VR游戏，它仍然是今天的畅销书，销售了超过400万份。\n 该公司的其他VR工作室收购包括Sanzaru Games并在黎明时准备。 \n亚历克斯·希斯（Alex Heath）在Twitter上密切关注AR和VR技术的崛起的记者，最近在Twitter上观察到的是，Facebook在该空间中的收购类似于几年前的新兴科技的最着名的投注：购买Instagram和WhatsApp的购买帮助该公司将其作为社交网络中的主导球员水泥地位。\n “Facebook将在VR软件中拥有近乎垄断，甚至很重要，”希思推文。 “Facebook将在实际上重新发明自行，以便通过时期的时间来计算计算中的新的范式转变，以便在其当前的状态下解决它。”\n   无论您认为国会是否应该干预规范技术收购，这是不可否认的过程慢慢移动。 Facebook于2012年购买了Instagram和2014年的WhatsApp;国会反托拉斯查询直到五年后没有开始;并且在......星期五之前没有将需要提高科技平台收购的审查的账单。 （好的，罚款，叛乱参议员josh hawley介绍了一项禁止所有平台收购的账单，以4月份，但他的账单更好地被认为是福克斯新闻委员会，而不是规范行业的严重努力。）\n 我认为联邦贸易委员会应该更加持怀疑态度，以获得直接竞争对手的科技巨头，但我不确定违约禁止收购的账单是最好的方法。收购是硅谷生命的一部分，以及他们返回投资者的资金在下一代企业家和技术中重新投资。您可以在不禁止M＆amp的情况下鼓励大量方面的竞争;无论如何，很难想象一个像这样的法案，尽管是霍利的比尔，霍利的比尔很多。\n 与此同时，让我们说你认为Facebook的Instagram和Whatsapp的收购了几年 - 无论如何，直到Tiktok出现。如果您申请移动它在九年前，您申请移动它，您是否希望向Facebook目前的购物狂欢进行审查。\n 这个问题的答案可能取决于您认为虚拟现实脑权件的市场和其伴随的软件生态系统将成为多大。目前市场小 -  Facebook的Oculus平台售出截至1月份的售价少于1000万台。相比之下，Playstation 4在其寿命期间销售超过11500万台;苹果在2020年的仅限于2020年销售了近8000万辆iPhone。\n 如果您认为VR将大致增长到大型控制台游戏平台的大小，也许您不担心有多少Studios Facebook购买。 Console制造商一直购买游戏工作室 - 微软收购Zenimax媒体，Bethesda软件的所有者及其许多流行的特许经营者，是去年在空间中的大众交易 - 没有人似乎有太多的疑虑，任何一个控制台都在发展垄断。 \n另一方面，如果您认为Oculus可能会达到类似于主要桌面计算机制造商的尺寸，如戴尔，也许你会以更严格的审查为目的。把我的牌放在桌子上：我认为它最终会。\n  Facebook仍然没有发布销售数据的任务2耳机，我告诉PlayStation VR已经销售了更多的单位整体。但我们知道，Quest 2在2020年的前季度开始，Facebook的非广告收入增长了156％。即使在相对较小的收入基础上，这可能会使VR Facebook的增长最快的业务。\n 您所看到的到处都是，您会发现Facebook对其VR平台的信心不断充满信心。首席执行官Mark Zuckerberg在过去的12个月内常常对该主题进行了面试，其中包括将AR和VR定位为企业软件平台以及玩游戏的地方。该公司聘请了10,000多人在其Facebook现实实验室硬件部门工作。\n 简而言之，有的证据表明，VR将是巨大的，在Facebook的收购竞选时，它的证据表明Instagram在Facebook在2012年购买它之前将是巨大的，在该应用程序有5000万用户之前。\n 这一切都不是说我认为VR将超越智能手机作为世界上最大的计算平台。也很清楚，Facebook有真正的竞争，因为它试图建立混合现实的未来。 Snap还在该空间中构建令人印象深刻的硬件和软件，专注于其眼镜眼镜和围绕它们的开发人员生态系统。苹果公司正在努力掌握自己的耳机，近年来至少有四家混合现实公司收购。\n 它也可能是史诗般的游戏使Fortnite是VR的富人，而Roblox则使其平台成为VR的Roblox，以及Facebook在那个空间的努力。\n Facebook告诉我其获得所以许多游戏工作室的原因很简单：它希望通过确保顶级游戏体验广泛使用，加速仍然新生行业的增长。该公司表示，这是博彩行业中的一名非常小的球员，但希望其收购对开发人员和用户有利。 \n“这一切都是真的 - 但它并不意味着它不会在六到八年内成为一个问题，”希思周三通过电话告诉我。从Heath的角度来看，Facebook的收购的更加相应的方面是，它将在一家公司统筹大量的VR人才，至少四年，而他们的购置背心的选择。\n “善良的人已经在Facebook或他们购买它们”\n “没有那么许多公司这样做，”希思说的VR产业“，”和良好的人都在Facebook或他们购买它们。“\n 如果VR行业未能达到其最近一轮的炒作，这一切都不要这样做。未能达到炒作，可能是VR产业的签名特征，以至于到目前为止的整个寿命。\n 但如果VR成为我们日常工作流程的一部分，我们也是我们的日常娱乐活动，Facebook成为该空间的市场领导者，我们可能会在另一个全球对话中，了解科技巨头如何成功地将其市场权力接管邻近的行业。 。如果是这样的话，它会让我感到震惊，那个谈话的时间是现在的时候 - 虽然基础仍然被奠定了一个轻微的似乎收购。 ", "note_en": "Imagine that, over the past year, Facebook had managed to acquire the battle royale game  Fortnite, the kid-focused game creation engine Roblox, and the best-selling game of 2020,  Call of Duty: Black Ops Cold War.\n For many reasons, such a spree of acquisitions would never happen. One of the biggest is that antitrust scrutiny has made it increasingly difficult for Facebook to acquire anything that resembles a social network. It was more than a year ago that the company bought the moribund GIF search engine Giphy, which had few prospects for success as a standalone company; the United Kingdom’s competition watchdog  has so far blocked the deal from closing, warning the acquisition would somehow harm Facebook’s competitors.\n And yet if you look at the virtual reality landscape, Facebook has made a series of acquisitions that are roughly analogous to the fictional shopping spree I describe above, if on a much smaller scale:\n Last week,  Facebook bought BigBox VR, maker of the battle royale game  Population: One. The shooter has a structure and a “season”-based business model similar to that of Epic Games’  Fortnite.\n The week before,  Facebook bought Unit 2 Games, maker of the Crayta platform. Crayta lets users make and share games in a fashion that mirrors  Roblox, the fast-growing game platform that went public earlier this year.\n In 2019 Facebook  bought Beat Games, maker of the hit game  Beat Saber.  Beat Saber was the most popular VR game on the Oculus platform by far when Facebook bought it, and it remains a bestseller today with more than 4 million copies sold.\n The company’s other VR studio acquisitions include  Sanzaru Games and  Ready at Dawn.\n Alex Heath, a reporter at  The Verge who has closely covered the rise of AR and VR technologies,  observed on Twitter recently that Facebook’s acquisitions in the space resembled its most famous bets on nascent technology from years ago: the purchases of Instagram and WhatsApp, which helped the company cement its position as the dominant player in social networks.\n “Facebook is going to probably have a near-monopoly in VR software before it even matters,” Heath tweeted. “Facebook will have literally reinvented itself for a new paradigm shift in computing by the time regulation gets around to addressing it in its current state.”\n   Whether or not you think Congress should intervene to regulate tech acquisitions, it’s undeniable that the process moves slowly. Facebook bought Instagram in 2012 and WhatsApp in 2014; a congressional antitrust inquiry didn’t begin until five years later; and a bill that would require heightened scrutiny of tech platform acquisitions was not introduced into Congress until…  Friday. (OK, fine, the insurrectionist Sen. Josh Hawley introduced a bill to  ban all platform acquisitions, period, in April, but his bills are better thought of as Fox News op-eds than as serious efforts to regulate the industry.)\n I think the Federal Trade Commission should be more skeptical of tech giants acquiring their direct competitors, but I’m not sure a bill that defaults to banning acquisitions is the best approach. Acquisitions are part of the lifeblood of Silicon Valley, and the money that they return to investors gets re-invested in the next generation of entrepreneurs and technologies. You can encourage competition in lots of ways without banning M&amp;A. And in any case, it’s hard to imagine a bill like this one garnering much support from Republicans, Hawley’s bill notwithstanding.\n At the same time, let’s say you believe Facebook’s acquisitions of Instagram and WhatsApp set back the consumer internet for a few years — until TikTok emerged, anyway. Wouldn’t you want to apply as much scrutiny to Facebook’s current shopping spree as you’re applying to moves it made as long as nine years ago?\n The answer to that question likely depends on how large you think the market for virtual reality headsets and its attendant software ecosystem will someday become. Currently the market is small — Facebook’s Oculus platform had  sold fewer than 10 million units as of January. The PlayStation 4, by contrast, has sold over 115 million units during its lifetime; Apple sold almost  80 million iPhones in the last quarter of 2020 alone.\n If you think VR will grow to roughly the size of a major console gaming platform, maybe you’re not concerned how many studios Facebook is buying. Console manufacturers buy game studios all the time —  Microsoft’s acquisition of ZeniMax Media, owner of Bethesda Software and its many popular franchises, was last year’s mega-deal in the space — and no one seems to have too many concerns that any one console is developing a monopoly.\n If, on the other hand, you think Oculus could grow to a size more closely resembling a major desktop computer manufacturer, like Dell, perhaps you would eye its acquisitions with more scrutiny. To lay my cards on the table: I think it eventually will.\n  Facebook still hasn’t released sales figures for the Quest 2 headset, and I’m told Playstation VR has sold more units overall. But we know that Quest 2  drove a 156 percent year-over-year increase in Facebook’s non-advertising revenue in the last quarter of 2020. Even on a relatively small revenue base, that might make VR Facebook’s fastest-growing business.\n Everywhere you look, you find signs of Facebook’s growing confidence in its VR platform. CEO Mark Zuckerberg has given  frequent  interviews on the  subject over the past 12 months, among other things positioning AR and VR as an enterprise software platform as well as a place to play games. The company has hired more than 10,000 people to work in its Facebook Reality Labs hardware division.\n In short, there’s more evidence that VR will be huge amid Facebook’s run of acquisitions today than there was evidence that Instagram was going to be huge when Facebook bought it in 2012, before the app had even 50 million users.\n None of that is to say that I think VR will overtake smartphones as the world’s biggest computing platform. And it’s also clear that Facebook has real competition as it tries to build out the mixed-reality future. Snap is also building impressive hardware and software in that space, focused on its Spectacles glasses and growing developer ecosystem around them. Apple, which is working on a headset of its own,  has made at least four acquisitions of mixed-reality companies in recent years itself.\n It may also be that Epic Games makes  Fortnite the  Fortnite of VR, and Roblox makes its platform the Roblox of VR, and Facebook’s efforts in that space wither.\n Facebook told me its reasons for acquiring so many game studios are straightforward: it wants to accelerate the growth of a still-nascent industry by ensuring top-flight gaming experiences are widely available. It’s a very small player in the gaming industry, the company said, but hopes its acquisitions will be good for both developers and users.\n “That’s all true — but it doesn’t doesn’t mean it isn’t going to be an issue in six or eight years,” Heath told me over the phone Wednesday. From Heath’s perspective, the more consequential aspect of Facebook’s acquisitions is that it will tie up a significant amount of VR talent at one company for at least four years while their options from the acquisition vest.\n “the people that are good either already work at Facebook or they’re buying them”\n “There are not that many companies doing this,” Heath said of the VR industry, “And the people that are good either already work at Facebook or they’re buying them.”\n None of this will much matter if the VR industry fails to live up to its most recent round of hype. And failing to live up to the hype is perhaps the signature feature of the VR industry for its entire lifespan so far.\n But if VR becomes a part of our daily workflow as well our daily entertainment, and Facebook becomes the market leader in that space, we may be in for another global conversation about how a tech giant successfully used its market power to take over an adjacent industry. If that’s to be the case, it strikes me that the time to have that conversation is now — while the foundation is still being laid, one minor-seeming acquisition at a time.", "posttime": "2021-06-18 20:24:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "边缘,verge,vr", "title": "边缘 ", "title_en": "The Verge", "transed": 1, "url": "https://www.theverge.com/2021/6/16/22537795/is-facebook-cornering-the-vr-market?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["边缘", "verge", "vr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可持续硬件和软件的设计选项Johanna Pohl，AnjaHöfner，Erik Albers和Friederike Rohde  Ecofriendly Cryptoart的指南（NFTS）备忘录Akten，Primavera de Filippi，Joanie Lemercier，Addie Wagenknecht，Mat Dryhurst和Sutu_eats_flies  人工智能与可持续性 - 新兴挑战和政策含义Friederike Rohde，Maike Gossen，Josephin Wagner和Tilman Santarius  Aloha：主权和可持续发展是谁，我们是丹尼斯“颠簸”Pu'uhonua Kanahele  立即开放气候！ Shannon Dosemagen，埃米利奥维利斯，路易斯菲利普R.Mulillo，Evelin Heidel，Alex Stinson和Michelle Thorne ", "note_en": "Design Options for Sustainable Hardware and Software  Johanna Pohl, Anja Höfner, Erik Albers, and Friederike Rohde\n  A Guide to Ecofriendly CryptoArt (NFTs)  Memo Akten, Primavera De Filippi, Joanie Lemercier, Addie Wagenknecht, Mat Dryhurst, and Sutu_eats_flies\n    Artificial Intelligence and Sustainability – Emerging Challenges and Policy Implications  Friederike Rohde, Maike Gossen, Josephin Wagner, and Tilman Santarius\n  Aloha: Sovereignty and Sustainability Are Who We Are  Dennis “Bumpy” Pu‘uhonua Kanahele\n  Open Climate Now!  Shannon Dosemagen, Emilio Velis, Luis Felipe R. Murillo, Evelin Heidel, Alex Stinson and Michelle Thorne", "posttime": "2021-06-18 20:23:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分支,magazine,持续", "title": "分支杂志 - 第2期 ", "title_en": "Branch Magazine – Issue 2", "transed": 1, "url": "https://branch.climateaction.tech/issues/issue-2/", "via": "", "real_tags": ["分支", "magazine", "持续"]}, {"category": "", "categoryclass": "", "imagename": "9cc272c5d904c7cd8fc9da52817c6fb1.png", "infoid": 1066686, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "StreetComplete是一种易于使用的Android的OpenStreetMap数据编辑器。它可以在没有任何OpenStreetMap特定知识的情况下使用。它询问简单的问题，答案直接用于编辑和改进OpenStreetMap数据。该应用程序针对不了解OSM标记方案的用户，但仍然希望为OpenStreetMap提供贡献。\n StreetComplete自动查找所需的附近地区，并将其显示为其地图上的Quest标记。然后可以通过回答一个简单的问题来解决这些任务中的每一个。例如，在标记上点击可能显示问题＆＃34;这条路的名称是什么？＆＃34;，使用文本字段回答它。在下面的屏幕截图中显示了示例。\n 用户＆＃39; s答案被自动处理并直接上传到OSM数据库中。使用用户＆＃39; s osm帐户在有意义的变革集中完成编辑.Since该应用程序意味着在调查中使用，它可以在脱机和数据使用中使用脱机和经济。\n 为了使应用程序易于使用，任务仅限于询问简单的问题的人。\n       现在有很多不同的任务类型，更多将随时间添加。您可以在OSM Wiki中看到所有任务的社区托管列表。\n    这是一个有效的开源项目，因此您可以轻松参与其中！您可以在没有任何编程或OpenStreetMap知识的情况下进行！只需选择您喜欢的任务。\n       德国联邦教育和研究部赞助了本项目（授予代码01IS20S35），在09.2020和02.2021之间的原型基金的框架内。这使得这使得盗版Zwick能够使这个应用程序成为一个更强大而有效的工具，可以轻松贡献OpenStreetMap。 \nNGI Zero Discovery是由NLNET Foundation组织的授权程序。 2019年批准使Mateusz KonieCzny能够在StreetComplete上工作大约三个月。  OpenStreetMap基金会正在为2020年的Microgrant程序的第一轮微型计划中使用StreetComplete进行地图维护的发展。  JawgMaps是基于OpenStreetMap数据的在线自定义地图，地理编码和路由的提供程序。 他们正在为他们的矢量地图瓷砖服务提供免费服务。  许多人目前正在通过Github赞助商，LiberaPay和Patreon支持这个应用程序。 如果您喜欢该应用程序，您可以加入它们☺️ ", "note_en": "StreetComplete is an easy to use editor of OpenStreetMap data available for Android. It can be used without any OpenStreetMap-specific knowledge. It asks simple questions, with answers directly used to edit and improve OpenStreetMap data. The app is aimed at users who do not know anything about OSM tagging schemes but still want to contribute to OpenStreetMap.\n StreetComplete automatically looks for nearby places where a survey is needed and shows them as quest markers on its map. Each of these quests can then be solved on site by answering a simple question. For example, tapping on a marker may show the question &#34;What is the name of this road?&#34;, with a text field to answer it.More examples are shown in the screenshots below.\n The user&#39;s answer is automatically processed and uploaded directly into the OSM database. Edits are done in meaningful changesets using the user&#39;s OSM account.Since the app is meant to be used on a survey, it can be used offline and iseconomic with data usage.\n To make the app easy to use, quests are limited to those answerable by asking simple questions.\n       There are quite a few different quest types now and more will be added over time.You can see a community-managed  list of all quests in the OSM wiki.\n    This is an active open-source project, so you can get involved in it easily!You can do so  without any programming or OpenStreetMap knowledge! Just choose a task that you like.\n       The  German Federal Ministry of Education and Research sponsored this project (grant code 01IS20S35) within the frame of the  Prototype Fund between 09.2020 and 02.2021. This enabled Tobias Zwick to work on making this app a more powerful and efficient tool to easily contribute to OpenStreetMap.\n The  NGI Zero Discovery is a grant program organized by the NLnet foundation. The 2019 grant enabled  Mateusz Konieczny to work on StreetComplete for about three months.\n The  OpenStreetMap foundation was funding the development of doing  map maintenance with StreetComplete in their  first round of the  microgrant program in 2020.\n JawgMaps is a provider of online custom maps, geocoding and routing based on OpenStreetMap data. They are providing their vector map tiles service to StreetComplete for free.\n Many people are currently supporting this app through  GitHub sponsors,  Liberapay and  Patreon. If you like the app, you can join them  ☺️", "posttime": "2021-06-18 20:22:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "易于,easy,openstreetmap", "title": "StreetComplete：易于使用OpenStreetMap数据的编辑器 ", "title_en": "StreetComplete: Easy to use editor of OpenStreetMap data", "transed": 1, "url": "https://github.com/streetcomplete/StreetComplete", "via": "", "real_tags": ["易于", "easy"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "stride目前支持Windows，Android，iOS，Xbox One和Universal Windows平台（UWP）。 stride还支持最受欢迎的VR设备，并对Linux进行实验支持。  请参阅阶段功能页面，步幅文档，步幅博客和步幅发布说明。 如果你可以＆＃39;去找你和＃39;在寻找什么，请问在步幅论坛上。  步幅是开源，高度模块化和超级多功能。 您可以使用它来创建Mobile，PC和VR游戏，或作为培训模拟或架构和工程软件等应用的高端渲染引擎。 ", "note_en": "Stride currently supports  Windows,  Android,  iOS,  Xbox One and  Universal Windows Platforms (UWP). Stride also supports most popular VR devices and has experimental support for Linux.\n  See the  Stride features page, the  Stride documentation, the  Stride blog, and the  Stride release notes. If you can&#39;t find what you&#39;re looking for, ask on the  Stride forum.\n  Stride is open-source, highly modular, and super-versatile. You can use it to create mobile, PC and VR games, or as a high-end rendering engine for applications such as training simulations or architecture and engineering software.", "posttime": "2021-06-18 20:22:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "步幅,game", "title": "步幅发动机 ", "title_en": "Stride Game Engine", "transed": 1, "url": "https://stride3d.net/download/", "via": "", "real_tags": ["步幅", "game"]}, {"category": "", "categoryclass": "", "imagename": "371f2b13bfd7bf87ec425d1d2b5a5723.png", "infoid": 1066684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SARS-COV2疫苗接种疫苗是否对苏格兰的过度死亡有任何影响？\n 示出两个数据集之间的关系的一种简单方法是将一个与另一个相对绘制。这与更改的情况更复杂，如监控疫苗的卷展栏。疫苗计划确保了大约95％的苏格兰大多数老年人口现在已经有了辉瑞或阿斯蒂伦疫苗的第一剂。我以这种方式将这些联系在一起：\n 计算2020年代录制的每周过量死亡人数，为每个年龄组录制2020年\n 阅读每个年龄组接种的人口的累积百分比，因为接种疫苗于2020年12月开始\n 这样，我创建了一个图表，显示了时间，过度死亡和疫苗的每个年龄组的百分比之间的关系。\n 我们希望随着时间的推移，过度死亡人数（预计主要由Covid-19造成的）应减少，因为疫苗的人口疫苗的增加。\n 所以我开始计算过量的死亡。这利用了前5岁（2015-2019）的平均死亡，并且被定义为2020年2020年的死亡= 2015  -  2019年2021年的死亡人数。我已经计算了每周的过剩死亡，每个年龄组都可以获得。 2015-2019和2020-2021死亡人员可从苏格兰的国家记录中获得。我通过为每个年龄段的每个卫生委员会总结而来，计算全国死亡。 \n有一点值得注意的是疫苗接种和过度死亡年龄群是不同的。值得庆幸的是，除了16-29（疫苗接种）和15至19,20至24和25〜29（过度死亡）外，它们通常会重叠。然而，这对普通图片几乎没有影响，因为每周都有15岁的人死亡。\n 最后，现在我有过多的死亡和每个年龄组的累积百分比接种，然后我可以将它们放在一起。我专注于每种疫苗的剂量1，因为这些疫苗的大部分疫苗只接受了这种剂量。\n   疫苗接种与1月中旬/末的过度死亡增加有关，直到最古老的三个年龄组（分别为80年以上的年龄的最古老的三龄段（45,151和113周，25/01和01/02年小组 - 从-19在11月1日增加到19岁以下）\n 55-59,60-64和65-69之间的55-59,60-64和65-69之间存在更温和但在25/01和15/02之间（但难以说出55-59和60-64，因为少于50％到目前为止，年龄组已接种疫苗）\n 最年轻的年龄群体中没有可观察的效果（但这些疫苗的疫苗少于12％）\n 该分析并不能证明疫苗接种和过度死亡之间的因果关系。毕竟，我无法访问数据，这些数据显示每周接种疫苗的人的数量。还有几个其他因素也可能导致多余的死亡时间 - 正在进行的锁定和科迪德是最明显的因素。然而，Covid死亡的率也在该期间下降，而且还没有人知道锁定对多余死亡的全部效果。\n 主要观点是，在收到大部分疫苗接种的年龄组中，在整个第一剂疫苗接种方案中，在整个第一剂疫苗接种方案中维持了（并在某些年龄组中增加的每周死亡人数，并且只会减少它在很大程度上结束了。 \n如果疫苗和过量死亡之间存在因果关系，是与疫苗接种计划相关的死亡人数，可接受可接受的成本，从而降低其余人口的SARS-COV2传输风险？ ", "note_en": "Has there been any effect of the rollout of SARS-CoV2 vaccinations on excess deaths in Scotland?\n One simple way of showing a relationship between two datasets is to graph one against the other. This is made more complex with a changing situation like monitoring the rollout of a vaccine. The vaccine programme has ensured that around 95% of Scotland’s most elderly population has now had their first dose of either the Pfizer or AstraZeneca vaccines. I’ve linked these together in this way:\n Calculate the number of excess deaths per week recorded in 2020 and 2021 for each age group\n Read the cumulative percentage of the population that has been vaccinated in each age group since vaccinations began in December 2020\n This way I create a graph that shows the relationship between time, excess deaths and the percentage of each age group vaccinated.\n Our hope is that over time the number of excess deaths (which is expected to be caused mainly by COVID-19) should reduce as the percentage of the population vaccinated increases.\n So I start with calculating excess deaths. This uses the average deaths over the previous 5 years (2015-2019) and is defined as Excess Deaths = Deaths in 2020 and 2021 minus Average Deaths for 2015-2019. I’ve calculated excess deaths for each week and for every age group available. The 2015-2019 and 2020-2021 deaths are available from the  National Records of Scotland. I calculated the whole country deaths by summing the deaths for every health board for each of the age groups.\n           One thing to note is that the age groups for vaccinations and excess deaths are different. Thankfully, they generally overlap nicely except for 16-29 (vaccinations) and 15 to 19, 20 to 24 and 25 to 29 (excess deaths). However, this has little effect on the general picture as very few 15 year olds die each week.\n Finally, now that I have excess deaths and cumulative percentage of each age group vaccinated, I can then graph them together. I’ve concentrated on Dose 1 of each vaccine as the majority of those vaccinated have only received that dose.\n   Vaccination is associated with an increase in excess deaths from mid/end January until end February for the oldest three age groups (45, 151 and 113 weekly excess deaths for 18/01, 25/01 and 01/02 respectively for the 80+ age group – which increased from -19 excess deaths on 11/01)\n There are more moderate but maintained excess deaths in 55-59, 60-64 and 65-69 between 25/01 and 15/02 (but it’s hard to say anything for 55-59 and 60-64 because less than 50% of those age groups has been vaccinated so far)\n There are no observable effects in the youngest age groups (but these have less than 12% vaccinated)\n This analysis doesn’t prove a causal link between vaccination and excess death. After all, I don’t have access to data which shows the number of those who died each week who had been vaccinated. There are several other factors that may also have led to excess deaths over that period – the ongoing lockdown and COVID being the two most obvious factors. However, the rate of COVID deaths has also decreased over that period, and no one yet knows the full effects of lockdown on excess deaths.\n The main point is that in the age groups that have received the majority of vaccinations, the weekly number of excess deaths has been maintained (and increased in some age groups) throughout the first dose vaccination programme, and is only reducing now that it has largely ended.\n If there is a causal link between vaccines and excess deaths, is the number of deaths associated with the vaccination programme an acceptable cost for reducing the risk of SaRS-CoV2 transmission for the rest of the population?", "posttime": "2021-06-18 20:22:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sars,excess,疫苗", "title": "在苏格兰联系多余的死亡和SARS-COV2疫苗接种 ", "title_en": "Linking excess deaths and SARS-CoV2 vaccinations in Scotland", "transed": 1, "url": "https://drowningindatadotblog.wordpress.com/2021/03/19/linking-excess-deaths-and-sars-cov2-vaccinations-in-scotland/", "via": "", "real_tags": ["sars", "excess", "疫苗"]}]