[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1071634, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的六个月中，Firefox 性能团队实施了一些更改以改进启动、响应能力、安全性 (Fission) 和 Web 标准。 Doug Thayer 和 Emma Malyz 使用称为骨架 UI 的概念实施了改进 Firefox 在 Windows 上的感知启动的工作。 Windows 上的用户可能会单击 Firefox 图标，但不会在他们期望 Firefox 启动的时间线中获得视觉反馈。所以他们再次点击图标。然后再次。然后他们的屏幕看起来像这样。启动需要很长时间的原因是在Firefox启动之前需要发生很多事情。作为启动的一部分，我们需要启动 JS 引擎，加载配置文件以获取窗口的大小和位置。我们还需要加载一个名为 XUL.dll 的大型库，它需要大量时间从磁盘读取，尤其是在您的计算机速度较慢的情况下。那么骨架UI实现了哪些改变呢？基本上在点击图标后，我们会立即显示一个窗口，表明 Firefox 正在启动。骨架 UI 的最终版本查看用户过去的会话并创建一个带有主题、窗口尺寸、工具栏内容和位置的窗口。您可以在此视频中看到它的外观，其中右侧以骨架 UI 启动。这些更改现在可以在 Firefox 92 beta 上使用，并在路上发布！在解决启动问题的其他有影响力的工作中，去年夏天，性能团队的实习生 Keefer Rourke 为文件 IO 编写了一个简化的 API，称为 IOUtils，用于与特权 JavaScript 一起使用。 Emma Malyz 和 Barret Rennie 以及贡献者将现有的启动代码迁移到 IOUtils 以提高启动性能。\n以前，当 Firefox 用户遇到某个页面的脚本运行超过某个时间阈值时，您会看到一条警告消息，如下所示： 对于许多人来说，此警告出现频率过高，原因不明，选项或者接下来的步骤令人困惑。 Doug Thayer 和 Emma Malyz 于 2021 年初开始工作，以减少遇到慢速脚本警告的用户比例。实施的解决方案改变了用户体验，因此警告只会在用户与挂起的页面交互时显示。他们还添加了代码来归咎于导致挂起的页面并删除令人困惑的“等待按钮”。 Sean Feng 实施了一些更改，使用户交互更严格地与下一帧将在屏幕上呈现的时间保持一致。通过确保 Frame 始终包含所有未决用户交互的结果，这使 Firefox 感觉更灵敏。在移动设备上，Sean 还实施了一些更改，以提高移动设备的响应速度。 Sean 登陆代码以允许合并更多的 touchmove 事件以更有效地生成事件。 Sean 的工作加上 Matt Woodrow 在 bug 中的 vsync 工作的影响反映在上图中。要了解有关 Firefox 中其他响应性更改的更多信息，B​​as Schouten 的博客文章提供了更多详细信息。 Fission 是 Firefox 中的站点隔离。如果您想了解更多信息，请阅读 Anny Gakhokidz 和 Neha Kochar 撰写的这篇详细而全面的博客文章，以了解 Fission 在 Firefox 中的实施和推出。 Sean Feng 和 Randell Jesup 进行了更改，以改进与 NSS 初始化和 http 接受设置相关的进程切换，以便在 Fission 的进程预分配中进行。 Windows 上的几个页面都有改进（谷歌搜索约 9%，bing 约 5%，gmail 约 3-4%，Microsoft 约 2-3%）；这应该将进程切换时间减少 6-8 毫秒，可能高达 10 毫秒。以前，我们看到 20-40 毫秒的时间可归因于切换进程。\n性能事件计时 API 由 Sean Feng 在所有平台上的 Firefox 89 中启用。该 API 为网页作者提供了对由用户交互触发的某些事件的延迟的洞察，这是 Web Vitals 的先决条件。要了解更多信息，请阅读 1667836 – Prototype PerformanceEventTiming、公告和规范。 Denis Palmeiro 向上游浏览器时间添加了 Firefox 内存支持。接下来的步骤是在 CI 中实施一些测试，以便我们持续获取测量结果。 Andrew Creskey 添加了 Perfstats 支持，允许我们为运行时的任何组件收集低开销计时。马库斯·贾里茨、埃里克·史密斯、亚当·加什林、莫莉·豪威尔、克里斯·马丁、吉姆·马蒂斯、亚伦·克洛茨、弗洛里安·奎兹、吉斯·克鲁特博斯、迈克·康利、马库斯·斯坦奇、艾玛·马利兹、道格·塞耶、丹尼斯·帕梅里奥、肖恩·冯、安德鲁·克雷斯基、巴雷特·雷尼，本杰明德科斯尼克，巴斯 Schouten 马克勒克莱尔和迈克科梅拉。特别感谢 Doug Thayer 的艺术作品，以显示骨架 UI 中的变化和缓慢的脚本工作！", "note_en": "In the last six months the Firefox performance team has implemented changes to improve startup, responsiveness, security (Fission), and web standards.\n  Doug Thayer and Emma Malyz implemented work to improve the perceived startup of Firefox on Windows using a concept called the skeleton UI. Users on Windows may click the Firefox icon and not get visual feedback in the timeline they expect that Firefox is starting. So they click the icon again. And again. And then their screen looks like this.\n  The reason that startup takes a long time is that many things need to happen before Firefox starts.\n  As part of startup, we need to start the JS engine, load the profile to get the size and position of the window. We also need to load a large library called XUL.dll which takes a lot of time to read from disk, especially if your computer is slow.\n So what changes did the skeleton UI implement? Basically after the icon is clicked, we immediately show a window to indicate that Firefox is starting.\n  The final version of the skeleton UI looks at the user’s past sessions and creates a window with the theme, window dimensions, toolbar content and positions. You can see what it looks like in this video where the  right hand side starts up with the skeleton UI in place. These changes are now available on Firefox 92 beta and riding the trails to release!\n  In other impactful work to address startup, last summer, Keefer Rourke, an intern on the performance team  wrote a simplified API for file IO called IOUtils for use with privileged JavaScript. Emma Malyz and Barret Rennie, along with contributors  migrated the existing startup code to IOUtils to improve startup performance.\n  Previously, when a Firefox user encountered a page that had a script that ran over a certain timing threshold, you would see a warning message that looked as follows:\n  For many people, this warning showed up too often, the cause was unclear and the options or next steps were confusing.\n Doug Thayer and Emma Malyz embarked on work in early 2021 to reduce the proportion of users who experience the slow script warning. The solution that was implemented changed the user experience so the warning would only show if a user interacted with a hung page. They also added code to blame the page that’s causing the hang and remove the confusing “wait button”.\n     Sean Feng implemented  changes to make user interaction more strictly aligned with when the next frame is going to be presented on the screen. This makes Firefox feel more responsive by making sure a Frame always contains the result of all pending user interactions. On mobile Sean also implemented changes for better responsiveness on mobile devices. Sean  landed code to allow the coalescing of more  touchmove events to generate the events more efficiently.\n  The impact of Sean’s work plus  Matt Woodrow’s vsync work in bug is reflected in the graph above.  To read more about other responsiveness changes in Firefox,  Bas Schouten’s blog post provides more details.\n  Fission is site isolation in Firefox. If you want to learn more, read this detailed and thorough  blog post by Anny Gakhokidz and Neha Kochar to learn about the implementation and rollout of Fission in Firefox.\n Sean Feng and Randell Jesup landed changes to improve process switches related to  NSS initialization and  http accept setup in process preallocation for Fission. There are improvements on several pages on Windows (~9% for google search, 5% for bing, around 3-4% for gmail, 2-3% for Microsoft); This should cut process-switch times by 6-8ms, perhaps as high as 10. Previously, we were seeing 20-40ms of time attributable to switching processes.\n   The Performance Event Timing API was enabled in Firefox 89 by Sean Feng on all platforms. This API provides web page authors with insights into the latency of certain events triggered by user interactions which is a prerequisite for  Web Vitals. To learn more read  1667836 – Prototype PerformanceEventTiming, the  announcement and the  specification.\n  Denis Palmeiro added  Firefox memory support to upstream  browsertime. The next steps are to implement some tests in CI so we capture measurements on an ongoing basis.\n Andrew Creskey added  Perfstats support to allow us to collect low-overhead timings for any component of the runtime.\n  Markus Jaritz, Eric Smyth, Adam Gashlin, Molly Howell, Chris Martin, Jim Mathies, Aaron Klotz, Florian Quèze, Gijs Kruitbosch, Mike Conley, Markus Stange, Emma Malyz, Doug Thayer, Denis Palmerio, Sean Feng, Andrew Creskey, Barret Rennie, Benjamin De Kosnik, Bas Schouten Marc Leclair and Mike Comella. A special thanks to Doug Thayer for the artwork to display the changes in the skeleton UI and slow script work!", "posttime": "2021-08-06 05:40:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,firefox,performance", "title": "Firefox：性能提升", "title_en": "Firefox: Performance in Progress", "transed": 1, "url": "https://blog.mozilla.org/performance/2021/08/05/performance-in-progress/", "via": "", "real_tags": ["性能", "firefox"]}, {"category": "", "categoryclass": "", "imagename": "566a28f1d110c9d75a19bb202d1ac615.jpg", "infoid": 1071633, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018 年 7 月，我为在线新闻杂志《东县杂志》写了两篇文章：“PEACE OF MIND” 3-10 分钟的野火疏散计划第 1 部分和“PEACE OF MIND” 3-10 分钟的疏散计划野火第 2 部分 13 个月后，当我收到保险公司的非续约通知时，我在野火第 2 部分中所写的大部分“安心”都大大减少了。然而，我能够通过加州公平计划保险为易发生野火的地区的家庭获得政府规定的最后保险。 （两倍的钱，更少的保险。）无论贵还是不贵，如果您住在易发生野火的地区，保险对您的安心至关重要。在新闻中，你会看到每次火灾后都心烦意乱的人说“我们失去了一切！”在我看来，有两类重要性：东西和人。东西可以换，人不能。在发生灾难性损失之前，需要考虑事物和人的重要性的心态。一家人或朋友为了保护 Stuff 不被烧毁而待得太久，没有什么值得他们的生命。在 2003 年加利福尼亚州的雪松野火中，15 人丧生。在 2018 年加利福尼亚州巴特县的营火中，88 人丧生。自从我在 2018 年 7 月写这些文章以来，学到的信息是一样的。提炼文章：theprepared.com 上的人们对灾难性事件有不同的看法。准备的定义是“一种准备状态，特别是对于__________”（填空）。在这种情况下，这是野火。如果您附近有可能发生野火，请为您的汽车加油，将其停在指向行驶方向的前门旁边，查看您的出口道路（使用您之前购买的地区的纸质地图）。花一个小时左右的时间来预先打包汽车。然后不要等待任何人告诉您撤离——提早离开。如果没有火烧到你家，一个家庭的酒店房间可能会花费 200 到 300 美元，并且需要大约 2 个小时的工作来收拾和拆包。金钱和时间花得很好。\n我可以花几个小时提供有关野火动态、城市交界区保险以及您需要早点离开的众多原因的具体信息。但是，如果您遵循 Wildfires 第 1 部分和第 2 部分中提供的建议，并且如果您预先准备好您和您家人的心态，将一切抛在脑后，开车前往安全地带——您就做好了准备。我已经完全撤离了 3 次，准备离开大约 5 次。我家只烧过一次。一直在关注一些加州保险公司向投保人提供私营部门消防员公司的投保住宅的一个不太广为人知的方面。关于这种“创新”的喧嚣，可以理解很多。这里也准备撤离也乘船进入海湾。由于对私营部门水疏散的新限制，在强制疏散期间不能使用此模式。您似乎经历过许多野火情况并幸存下来，感谢您抽出时间在这里分享您的经历。在疏散过程中，防虫袋对您来说有多重要？你是如何让你的家人能够在接到通知后立即离开的？ @Jay Valencia – 我们的野火疏散从未使用过准备式生存背包。每个家庭成员的防虫袋 (bob&#39;s) 都是为极低概率的事件准备的，即我们必须离开家，住在外面，并在远离家的地方生存。希望我们永远不必使用这些鲍勃。野火疏散是通过将您的汽车和您的物品驾驶到酒店或家人/朋友家中的安全位置来完成的。如果我们必须疏散，我们有一份书面的优先清单，而不是鲍勃的。每个人根据自己的年龄和能力有一份特定的工作。\n让家人参与其中是 20 年来在孩子们成长过程中教导他们、让他们进入 CERT 课程并告诉他们在发生野火时的个人任务的结果。话虽如此，我们核心 6 人家庭中的一名成年人试图真正阻碍我们而不是撤离。这会发生！有些人天生反应迅速，有些人则不然。 2003 年，当他的妻子将他推到一边并继续装载孩子、文书工作、食物、饮料、尿布、毯子时，这个人实际上试图阻止。预先计划给这些不情愿的家庭成员写在纸上的特定任务：收集所有笔记本电脑、电子产品、电源线、充电器；打开大门/车库门，通过社交媒体/关于疏散的短信联系家人/朋友，并提供州外电话/电子邮件以获取更新。许多人将永远无法开车离开并把所有东西都抛在脑后——尤其是在他们没有保险的情况下。在我看来，从个人观察来看，男人几乎总是想留下来的。 2018年，一位好朋友和邻居疏散了他的孩子和女朋友，然后留下来扑灭现场火灾！他甚至没有自己的房子，他是一个租房者！他可能救了我的移动房屋（已投保）免于燃烧。如果他死了，那会重要吗？为了成为英雄，他愿意让他的孩子没有父亲。这种情况经常发生。我的五个大家庭成员在知道我们已安全撤离后，开车到我们附近，马路两边都有火焰“检查一下”。 （多年后我仍然很生气。）“很多人永远无法开车离开并将所有东西抛在脑后”我读过实际上有一个名称，它被称为“正常偏差”并且将是一个很好的谈话主题这里。这让我们有点震惊，因为我们不相信我们的疏散情况有任何真正的危险。 （我们真的应该去吗？火灾离这里很远！）常态偏见真的会阻止官员在灾难中完成他们的工作。以下是维基百科对常态偏差的定义：常态偏差是一种认知偏差，它导致人们低估灾难发生的可能性、何时可能影响他们以及其潜在的不利影响。 …导致许多人没有为自然灾害、市场崩盘和人为错误造成的灾难做好充分准备。据报道，大约 70% 的人在灾难期间表现出常态偏见。这种现象确实是我们应该准备体验的。这也使一些非常有趣的阅读。\n哈哈！我太受宠若惊了！我敢肯定，在准备方面，我不会在你的课堂上遥遥无期。我在 LDS 准备手册中遇到了这个引人入胜的术语，当意识到我们可能不得不离开时，我非常震惊地意识到我处于那种状态。也许这次谈话会在下一次灾难中回到我身边，这样我们就不会成为它的受害者。据我所知，那些在飓风地区的人经常成为常态偏见的受害者。对于您可以离开或不离开的人，可能没有硬性规定。刚刚搬到该地区并且从未经历过飓风的新家庭可能会撤离，因为他们不知道会发生什么并且会安全地行事，但他们也可能会留下来，因为他们不知道什么是飓风能够。即使是该地区的退伍军人，您也无法确定他们会做什么。许多人一看到开始就会离开，因为他们看到了随之而来的毁灭性力量，但也有一些人经历了二十次飓风，他们认为他们可以坚持下一场。看，对于谁可能会陷入这种常态偏见，没有硬性规定。", "note_en": "In July 2018, I wrote two articles for an online news magazine, “East County Magazine”:   “PEACE OF MIND” 3-10 MINUTE EVACUATION PLAN FOR WILDFIRES PART 1, and  “PEACE OF MIND” 3-10-MINUTE EVACUATION  PLAN FOR WILDFIRES PART 2\n Thirteen months later, much of the “Peace of Mind” I’d written about in Wildfires Part 2, was greatly reduced when I received a Non-Renewal Notice from my insurance company.  I was, however, able to obtain government mandated insurance of last-resort for homes in areas prone to wildfires via the California Fair Plan insurance.  (Twice as much money, and much less coverage.)\n Expensive or not, insurance is critical to your peace-of-mind if you live in a wildfire-prone area.  On the news, you’ll see distraught people after every fire saying “We’ve lost everything!”  In my opinion, there are two categories of importance:   stuff and people.   Stuff can be replaced, people cannot.\n The mindset of the importance of Stuff and People needs to be considered BEFORE a catastrophic loss.   Nothing is worth the life of a family member or friend who stayed too long to protect Stuff from burning.   In the 2003 Cedars wildfire in California, 15 people lost their lives.  In the 2018 Camp Fire in Butte County in California, 88 people lost their lives.\n The information learned since I wrote those articles in July 2018 is the same.  To distill the articles:\n  People on theprepared.com have a different mindset about catastrophic events.   The definition of preparedness is “a state of readiness, especially for ___________”(fill in the blanks).    In this case, it’s wildfire.\n If there is a possibility of wildfire near you, fill your car with gas, park it next to your front door pointed out in the direction of travel, review your exit roads (use the Paper Map of the area you bought earlier).  Take the hour or so to pre-pack the car.    Then DO NOT WAIT FOR ANYONE TO TELL YOU TO EVACUATE–LEAVE EARLY.  It may cost a family $200 to $300 for a hotel room and about 2 hours work to pack and unpack if no fire reaches your home.   Money and time well spent.\n I could spend hours providing specific information about wildfire dynamics, insurance in urban-interface areas, and the many, many reasons why you need to leave early.    However, if you follow the advice provided in Wildfires Part 1 and 2, AND if you pre-prepare your mindset and that of your family to leave everything behind and drive to safety–you’ll be ready.\n I have completely evacuated three times and been ready to leave about 5 times.  My home only burned down once.\n      Had been following a not too well publicized aspect of some Calif insurers providing their policy-holders private sector fire fighter companies for insured dwelling. Much can be understood about the uproar over this “innovation”.\n Here also ready to evacuate also by boat into the Bay. This mode cannot be used during a mandatory evac because of new restrictions on private sector water evacs.\n You seem to have lived and survived many wildfire situations, thank you for taking the time to share of your experiences here. How key was a bug out bag for you in evacuations? And how did you get your family on board with being able to leave at a moment’s notice?\n @Jay Valencia – A prepper-style survival backpack has never been used in our wildfire evacuations.  Each family member’s bug-out-bags (bob’s) is prepared for the extremely low-probability event that we have to leave our homes and live outside and survive away from our home.  Hopefully, we never have to use these bob’s.\n Wildfire evacuations are done by driving your car and your stuff to a safe location at a hotel or family member/friend’s home.   Instead of bob’s, we have a written prioritized list of what to throw into cars if we have to evacuate.  Each person has a specific job according to their age and ability.\n Getting family on board with leaving everything is the result of 20 years of teaching the kids as they grew up, getting them into CERT courses, and telling them their individual tasks in case of wildfire.   With that said, one of the adults in our core family group of 6 people has tried to literally get in our way and not evacuate.  This is gonna happen!    Some people are wired to react quickly and some are not.  In 2003, this individual actually tried to stand in the way as his wife pushed him aside and continued to load kids, paperwork, food, drinks, diapers, blankets.  Pre-plan to give these reluctant family members a specific task(s) written on paper:  Gather all the laptops, electronics, cords, chargers;  open the gates/garage door, contact family/friends by social media/text about evacuation and provide out-of-state phone/email to get updates.\n Many people will never be able to drive off and leave everything behind–especially if they don’t have insurance.   In my opinion and from personal observation men are nearly always the ones who want to stay.  In 2018 a dear friend and neighbor evacuated his kids and girlfriend, then stayed to put out the spot fires!    He didn’t even own his home, he was a renter!   He probably saved my mobile home (which was insured) from burning.     Would that matter if he died trying?  He was willing to leave his children without a father to be a hero.  This happens a lot.  Five of my extended family members drove into our neighborhood with flames on both sides of the road to “check it out” AFTER they knew we were safely evacuated.  (I’m still livid years later.)\n “Many people will never be able to drive off and leave everything behind”\n I’ve read there’s actually a name for this, it’s called “Normalcy Bias” and would be a great subject for conversation here.  It hit us a bit, as we disbelieved there was any real danger in our evac situation.  (Should we really go?  The fire is miles from here!)\n Normalcy bias can really inhibit officials from doing their job in a disaster.  Here is the Wikipedia definition of Normalcy Bias:\n Normalcy bias is a cognitive bias which leads people to underestimate the likelihood of a disaster, when it might affect them, and its potential adverse effects.  …causes many people to not adequately prepare for natural disasters, market crashes, and calamaties caused by human error.  About 70% of people reportedly display normalcy bias during a disaster.\n This phenomenon is really something we should be prepared to experience. It also makes for some very interesting reading.\n  LOL!  I am exceedingly flattered!  I’m sure I’m not remotely in your class when it comes to preparedness.  I came across that fascinating term in an LDS preparedness manual and it’s actually rather shocking to realize that I was very much in that state at the onset of the realization that we might have to go.  Perhaps this conversation will come back to me in the next disaster, so that we don’t fall victim to it.\n Those in hurricane territory fall victim to the normalcy bias very often from what I understand. There probably isn’t a hard and set rule of who you can expect to leave or not. The new family that just moved to the area and have never experienced a hurricane may evacuate because they don’t know what to expect and are going to play it safe, but then they also might stay because they don’t know what a hurricane is capable of. Even with the veterans of the area you can’t be certain what they will do. Many will leave as soon as they see one starting because they have seen the devastating power that comes with them, but then there are those who have gone through twenty hurricanes and they think that they can hold out through this next one. See, no hard and set rules of who might fall into this normalcy bias.", "posttime": "2021-08-06 05:40:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "准备,preparedness", "title": "野火准备和心态——如何快速、安全地撤离", "title_en": "Wildfire preparedness and mindset – How to evacuate quickly, safely", "transed": 1, "url": "https://theprepared.com/forum/thread/wildfire-preparedness-and-mindset-how-to-evacuate-quickly-safely/", "via": "", "real_tags": ["准备"]}, {"category": "", "categoryclass": "", "imagename": "dc8042e575fd7bd4cab9169d704bf197.png", "infoid": 1071632, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以其他语言阅读这篇文章：Français、日本语、한국어、Deutsch、Русский 2011 年 7 月 19 日，在 JVM 语言峰会上，JetBrains 宣布了 Kotlin——一种新的 JVM 静态类型编程语言。它已经在这里近十年了。自构思以来，它一直在改变我们在 JetBrains 及其他地方的工作方式。现在是时候庆祝我们一起度过的所有时光，并分享我们的计划，以便我们继续帮助您成为更快乐的开发人员。 Kotlin 已经从 Java 替代品发展成为一个完整的生态系统，允许为不同目的编写代码，包括服务器端、移动、Web 前端、数据科学，甚至多平台项目。我们准备了一个完整的项目，从 Kotlin 的一开始就开始，带您经历最重要的时刻，一直到技术的当前状态和我们的未来愿景。这不仅与技术本身有关，还与 Kotlin 背后的想法和人员有关。在网站上，当我们探索多年来 Kotlin 代码的语法变化时，我们将带您踏上怀旧之旅。您还将发现今天的 Kotlin 以及我们未来十年的计划！\n在制作这部纪录片时，我们想展示一个创建新编程语言的疯狂想法是如何成为我们最伟大的成就之一。我们采访了来自 JetBrains 参与 Kotlins 发展的人，包括 Andrey Breslav、Max Shafirov、Dima Jemerov 和 Hadi Hariri。我们采访了著名的社区成员，了解他们第一次使用 Kotlin 的经历，并讨论了它如何帮助他们更愉快地执行日常任务。我们与 Roman Elizarov 一起展望 Kotlin 未来 10 年的发展。不要忘记与#10yearsofKotlin 分享您的 Kotlin 故事——我们最喜欢的故事的作者将获得一些我们专门为这个特殊场合设计的特别奖品！ Kotlin 确实是发生在 Android 社​​区中的最好的事情。一股急需的新鲜空气促成了如此多的共享和协作 #10yearsofKotlin https://t.co/avFcPC0PW5 — Maria Neumayer (@marianeum) 2021 年 5 月 14 日当我开始学习 Kotlin 时，我不认为我会和他一起工作了很长时间，甚至更少，以至于我会用这种语言用西班牙语写第一本书。 #10yearsofKotlin pic.twitter.com/5nzzC1UDR1 — José Dimas Luján (@josedlujan) 2021 年 5 月 14 日 我在 2017 年开始使用 Kotlin，一开始我以为我会重新开始，但 Kotlin 证明我错了那么 Kotlin 使我在职业生涯中的每一天都变得更轻松。 #10yearsofKotlin #kotlin #AndroidDev pic.twitter.com/sIN54hB5AH\n— Eric Ampire (@eric_ampire) 2021 年 5 月 14 日，我在日内瓦的一个小房间里第一次谈到了#Kotlin，有 10 人参加。然后，Kotlin 让我前往洛桑、格勒诺布尔、里昂、马赛、蒙彼利埃、巴黎、旧金山、基辅、明斯克、阿姆斯特丹、哥本哈根。多么美妙的旅程！ #10yearsofKotlin — Gaetan Zoritchak (@gz_k) 2021 年 5 月 14 日", "note_en": "Read this post in other languages:  Français,  日本語,  한국어,  Deutsch,  Русский\n  On July 19, 2011, at the JVM Language Summit, JetBrains announced Kotlin – a new statically typed programming language for the JVM.\n It has been here for almost ten years. Since its conception, it’s been changing the way we work at JetBrains and beyond.\n Now it’s time to celebrate all the time we’ve spent together, and share our plans so we can continue helping you become happier developers.\n Kotlin has evolved from a Java alternative to a whole ecosystem that allows writing code for different purposes, including server-side, mobile, web frontend, data science, and even multiplatform projects.\n We’ve prepared a whole project that starts from the very beginning of Kotlin and takes you through the most important moments all the way to the current state of the technology and our future vision. It’s not just about the technology itself, it’s also about the ideas and people behind Kotlin.\n   On the website, we’ll take you on a nostalgic walk down memory lane as we explore the syntax changes to Kotlin code through the years. You will also discover the Kotlin of today and our plans for the next ten years!\n  While creating the documentary, we wanted to show how a crazy idea to create a new programming language turned out to be one of our greatest achievements. We spoke to people from JetBrains involved in Kotlins’ evolution, including Andrey Breslav, Max Shafirov, Dima Jemerov, and Hadi Hariri. We interviewed notable community members about their first experience with Kotlin, and discussed how it helps them perform their daily tasks more enjoyably. Together with Roman Elizarov, we look at what the next 10 years for Kotlin hold.\n  Don’t forget to share your Kotlin stories with #10yearsofKotlin — authors of our favorite stories will get some special swag that we’ve designed specifically for this special occasion!\n  Kotlin really is the best thing that happened to the Android community. A much needed breath of fresh air that enabled so much sharing and collaboration  #10yearsofKotlin  https://t.co/avFcPC0PW5\n— Maria Neumayer (@marianeum)  May 14, 2021\n When I started learning Kotlin, I didn&#39;t think that I would work with him for so long and even less that I would write the first book in Spanish for this language. #10yearsofKotlin  pic.twitter.com/5nzzC1UDR1\n— José Dimas Luján (@josedlujan)  May 14, 2021\n I started with Kotlin in 2017, at the very beginning I thought I was going to start all over again, but Kotlin proved me wrong and since then Kotlin makes my life easier every day in my professional career. #10yearsofKotlin  #kotlin  #AndroidDev  pic.twitter.com/sIN54hB5AH\n— Eric Ampire (@eric_ampire)  May 14, 2021\n I did my first talk about  #Kotlin in a small room in Geneva for ten attendees. Then, Kotlin made me travel to Lausanne, Grenoble, Lyon, Marseille, Montpellier, Paris, San Francisco, Kyiv, Minsk, Amsterdam, Copenhagen. What a journey! #10yearsofKotlin\n— Gaetan Zoritchak (@gz_k)  May 14, 2021", "posttime": "2021-08-06 05:40:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kotlin,years", "title": "Kotlin 十年", "title_en": "Ten Years of Kotlin", "transed": 1, "url": "https://blog.jetbrains.com/kotlin/2021/08/ten-years-of-kotlin/", "via": "", "real_tags": ["kotlin", "years"]}, {"category": "", "categoryclass": "", "imagename": "e1d7ee3e7cfdc18b125c5173c8244b5a.png", "infoid": 1071631, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去 2.5 年的 Airkit 工作中，我一直在深入研究低代码的迷人领域。在这次令人大开眼界但又相当曲折的探险中，我开始欣赏抽象的美。通过检查 Airkit 的抽象语法树 (AST) 和我构建语言服务器索引格式 (LSIF) 索引器的旅程，我们将在低代码平台的上下文中探索抽象的力量。要了解什么是低代码，我们必须首先检查什么是计算机程序和编程语言。计算机程序是计算机的指令集，而编程语言是这些指令集的形式语言形式的抽象。提供给编程语言的抽象数量定义了它的“高级”程度。实际上，抽象使得用高级代码编写程序而不考虑低级代码、用 C 编写程序而不考虑汇编代码以及编写汇编代码而不考虑逻辑成为可能盖茨。在 Airkit，我们将低代码视为另一层抽象——一种碰巧是可视化的高级编程语言。与传统的基于文本的编程语言需要扫描和解析才能将源代码转换为解析树，然后将其转换为 AST（抽象语法树）不同，可视化编程语言具有直接构建 AST 的结构化编辑器。这说明了什么是低代码——一种可视化的编码方式。如本例所示，用户实际上可以在阅读和修改底层 AST 时在可视化编辑器模式和更传统的文本编辑器模式之间来回切换。本博客的目标不是深入研究 Airkit AST。然而，直观地了解 Airkit 应用程序的外观对于理解 Airkit 的工作原理非常有用。这个按钮是 Airkit Element 的一个实例，它是 Airkit 应用程序最原始的构建块。元素有很多种，复合元素是由更简单的元素构成的。我们可以看到按钮 AST 实际上是一个复合元素，由描述其文本、样式和事件的元素组成。图 1 中最右侧的面板是检查器。检查器是一组编辑器，允许用户修改元素及其子组件。我们可以看到按钮的检查器对于按钮元素的文本、样式和事件属性有相应的编辑器。我们之前已经看到构成 Airkit 工作室的可视化编辑器只是 Airkit 元素的语法糖。同样，在 React 中，JSX 只是 React 元素上的语法糖。例如，下面是我们如何使用 JSX 在 React 中声明一个按钮。\n正如 JSX 只是构建 React 元素的视觉辅助工具一样，Airkit Studio 中的可视化编辑器只是构建 Airkit 元素的视觉辅助工具。这两个框架都是简单的抽象，允许用户使用高级编程语言构建低级元素。 Airkit Studio 是一个 IDE，就像 XCode、VSCode 和 IntelliJ 一样。 IDE 通常由源代码编辑器、调试器、导航/重构工具、错误托盘等组成。这些是帮助程序员编写语法和语义正确的程序的工具，并且都是我们正在开发的 Airkit Studio 中的功能。在剩下的文章中，我将揭开 Airkit 如何支持导航和重构工具（例如查找引用、重命名变量等）背后的奥秘。在我们深入研究技术细节之前，这里有一个重命名变量的快速演示。那么Airkit是如何在毫秒内为用户提供精准的代码导航和重构呢？答案在于语言服务器索引格式 (LSIF)。 LSIF 是编程工具（语言服务器、IDE 等）的标准格式，用于保存有关代码空间的知识。 LSIF 的一个很好的类比是数据库索引，它允许数据库查询有效地从数据库中检索数据，但需要额外的写入和存储空间来维护索引。 LSIF 是一种索引，允许代码查看客户端（例如，代码编辑器）提供自动完成或转到定义等功能，而无需语言分析器实时执行这些计算。如果您想知道 Visual Studio Code 等 IDE 如何为这么多不同的编程语言提供相同的重构/导航工具集，那是因为这些 IDE 的客户端由与语言无关的协议（如 LSIF）提供支持。所以只要有一个用于编程语言的 LSIF 索引器来将该语言的文件转换为 LSIF 数据格式，IDE 就可以使用该语言。选择 LSIF 作为 Airkit 的索引数据模型很容易。经过一些研究，我们认为与构建我们自己的内部协议或使用其他索引格式不同，LSIF 易于理解，支持多种语言，并且得到了 Sourcegraph 和 Github/Microsoft 等多家公司的持续支持。\n为了说明 LSIF 如何支持高效的代码导航，我们将使用此代码片段作为示例（来自官方 LSIF 规范）。下面的 JSON 输出是上面 5 行 javascript 的 LSIF 格式： 如您所见，LSIF 只是节点和边的集合。下面的图 2 显示了生成的 LSIF 图的可视化表示。 bar 函数声明在可视化图中标记为 bar[def]。我们还可以在 JSON 输出中找到对应的节点：id 为 9 的节点。 bar[def] 节点是一个范围节点，因为它代表了程序中从第 0 行字符 9 到第 0 行字符 12 的符号。范围节点用开始和结束行/字符唯一标识。那么 VSCode se LSIF 索引如何让用户找到 bar 声明的所有引用呢？用户首先将鼠标悬停在栏声明上，然后单击“查找所有引用”按钮。请注意，将鼠标悬停在表示 bar 中的“b”和 bar 中的“r”的位置上将返回相同的范围节点。 VSCode 客户端将向语言服务器提交包含光标位置的语言服务器请求。查找节点的所有引用的算法如下： 使用光标位置通过行号和字符数来标识范围节点。标识的节点是 bar[def] 。通过取下一个边遍历到[结果集]。结果集具有与用户可以对节点进行的查询类型相对应的传出边，例如引用或定义。\n将 textDocument/references 节点带到 referenceResult 节点。 referenceResult 节点包含一个或多个与节点的引用相对应的项目边。沿着两个项目边缘将我们带到 bar[def] 和 bar[ref]，这是 bar[def] 的两个引用。对于那些不熟悉 Airkit 工作室如何工作的人，我建议您看一下这个快速的 Airkit 101 视频。为了演示如何在 Airkit Studio 中使用 LSIF，我们将继续使用之前的按钮示例。首先，我们需要一对定义和引用来使用。我们将首先创建一个定义节点。在图 3 中，我们在 Web Page 下创建了一个名为 foo 的变量，它是 Button 的父元素。图 3 左侧的树是 Web Page 的 UI 层次结构。它还表示每个元素的范围。通常，任何子元素都在父元素的范围内，因此它将具有父元素声明的所有变量。因此，Button 现在可以访问我们刚刚创建的 foo 变量。接下来，让我们为 foo 变量创建一个引用节点。我们现在使用包含 foo 变量的动态表达式，而不是简单的“单击我”。现在我们有了变量定义和变量引用，LSIF 将连接两个范围节点，如图 5 所示。\n整个应用程序模型被分成许多小的连接组件，如图 5 所示。每个连接的组件连接一个定义节点和一个参考节点列表。最后，现在我们有了一个连接 foo 定义和引用的 LSIF 索引，我们现在可以在 O(1) 时间内查询 foo 变量的引用。图 6 显示了用户如何进行 LSIF 查询以获取对 foo 变量的引用，图 7 显示了查询的输出。本博文的其余部分将重点介绍我们在实施 LSIF 时面临的有趣技术挑战。我们必须解决的第一个挑战是如何修改 LSIF 协议以使用非文本编程语言。 LSIF 是为基于文本的编程语言构建的：文件、行号和起始字符是节点的一流属性。相比之下，我们将应用程序的 AST 存储为一棵 JSON 树。不过这并不困难——我们只需要找到一种方法来唯一标识 JSON 树中的任何 Airkit 元素。虽然普通文件可以使用行号和字符数来唯一标识符号，但我们可以使用数据路径，它是从 JSON 树的根开始的绝对路径来唯一标识一个元素。在弄清楚协议之后，我们需要设计 LSIF 索引器。 LSIF 只是一种数据格式；没有关于如何构建 LSIF 索引的任何文档。以下是我们必须对索引器做出的一些主要决定： 我们的团队讨论了许多方法，以下是每种方法的一些权衡。目前，每个客户端都有一个状态管理器 (redux) 来保存应用程序定义。当用户编辑应用程序时，将向状态管理器分派命令以将命令应用于应用程序定义。我们最初的方法是让 LSIF 索引器也运行在客户端上。每当状态管理器收到命令时，它都会将新的应用程序定义传递给 LSIF 索引器以每次重建索引。\n同步更新的优点是可以保证 LSIF 索引始终是最新的。图 8 显示了系统不同组件之间的通信：用户、状态管理器和 LSIF 索引器。时间从左向右流动。每个请求或响应消息由一个箭头表示。在示例中，对 LSIF 索引的更新是同步执行的。协调器在向用户报告成功之前等待索引器完成索引。这保证了当用户向 LSIF 索引器发出请求时，LSIF 索引器会更新用户提交的最新更改。这种方法的缺点是，由于状态管理器和 LSIF 索引器都驻留在客户端上，并且因为 javascript 是单线程的，所以每次用户对应用程序进行更改时，UI 线程都会被阻塞，直到状态管理器响应成功。为了在 LSIF 索引器更新索引时不阻塞 UI 线程，我们可以将 LSIF 索引器移到服务器上，从而异步更新 LSIF。对于异步更新，有一个问题。如图 9 所示，如果用户在写入后不久查询 LSIF，则数据更改可能尚未到达 LSIF 索引。如果用户查询LSIF索引，看起来他们提交的数据丢失了，所以他们会感到困惑。在这种情况下，我们需要写后读一致性，也称为 read-your-writes 一致性。这种一致性模型保证，如果用户对应用程序模型进行更改并随后向 LSIF 索引发出请求，则该索引将与用户所做的更改保持同步。有多种方法可以通过异步更新实现写后读一致性。一种方法是让客户端记住其最近写入的时间戳。然后我们只需要确保 LSIF 索引不会响应任何请求，直到它与请求的时间戳保持同步。我们可以使用逻辑时间戳代替实际的系统时钟，例如由用户提交给状态管理器的命令形成的日志序列号。异步更新的优点是状态管理器可以在 LSIF 索引器完成索引更新之前成功响应用户。缺点是服务器的额外成本和向服务器发出请求时的延迟。此外，我们需要使索引器具有容错能力。而且，如果我们想保护索引器免受单个节点故障或网络中断的影响，我们需要使索引器分布式。\n服务器端索引的一种类似方法是在后台线程中存储和构建 LSIF 索引，例如 Web 工作线程（工作线程可以在不干扰用户界面的情况下执行任务）。这种方法的问题类似于服务器端索引的问题——如果系统不保证写后读的一致性，LSIF 可能会在一瞬间过时。用户向状态管理器提交重命名变量请求以将变量名称从 foo 更改为 bar 状态管理器重命名变量，然后向 LSIF 索引请求 foo 的所有引用 假设用户在状态管理器阶段更新 LSIF 之前查询 LSIF 4、那么用户会得到过时的数据。如图 10 所示，当用户将 foo 变量重命名为 bar，然后查询 bar 的引用，但没有得到重命名的 bar 变量作为回报。后台线程的好处是可以在一个单独的线程上进行繁琐的处理，让UI线程可以运行而不会被阻塞。 web worker 的缺点是额外的复杂性来保证写后读的一致性和额外的复杂性来防止内存泄漏等。而不是每次写入时重建 LSIF 索引，我们可以实时执行增量更新 -时间。这样，我们就可以同步更新 LSIF 索引。然而，增量更新带来了一些有趣的技术挑战。用户将 baz 变量（图 13）插入到数组（图 12）中。我们如何将 LSIF 索引增量更新为使我们从图 12 到图 13 所做的更改？\n你可能会想，既然数组是一棵树，每个子节点都有它的索引作为它的键，我们不能只是遍历数组，将 foo 和 bar 的索引增加 1 并将 baz 变量插入图中吗？不幸的是，事情并不像看起来那么容易。虽然三个变量——baz、foo、bar——在语义上通过数组相连，但它们在 LSIF 图中实际上没有相连。图 14 显示 foo 和 bar 实际上是两个断开连接的组件。逐步构建 LSIF 的挑战在于，应用程序模型中具有语义连接的节点可能不会在 LSIF 图中连接。这使得当我们将它们插入数组时很难更新数据路径。当父节点被删除时，它也使得垃圾收集图变得棘手，因为我们需要递归地找到它的所有子节点并删除它们。为了解决这个问题，我们需要一个反向索引，我们可以通过带有前缀的数据路径搜索节点。在图 13 中提供的示例中，我们需要通过数据路径元素 / 搜索 foo 和 bar，并将它们移一。一个很好的数据结构是一个特里。 Tries 是字符串的有序树数据结构，每个节点都与从树中节点的位置推断出的字符串相关联。尝试也称为前缀树，可以通过前缀进行搜索。节点的所有后代都具有与该节点关联的字符串的公共前缀。搜索/插入/删除时间与 term 和 key 的长度成线性关系。使用 trie 可以让我们很容易地找到父节点的子节点给定父节点的数据路径。使用 trie 的缺点是索引它的时间和空间复杂性。此外，截至目前，我们决定不存储 LSIF 索引以缩小该项目的范围。这会将应用程序的初始加载时间增加 O(mn)，其中 m 是应用程序中的节点数。对于普通应用程序，应用程序的节点数可以在 200 到 1000 之间，这使得加载时间不重要。在理想的世界中，如果我们能够开发一个健壮且高效的增量更新算法，我们将能够通过快速、同步的更新来避免棘手的竞争条件。该方法的问题在于它容易出错并且难以实施和维护。此外，与某些项目可以在没有完全完成的情况下逐个交付的项目不同，LSIF 索引器要么有效，要么无效。因此，增量更新方法的风险更大。我们构建的初始原型是在每次用户更新后同步重建整个 LSIF 索引。在 KISS（保持简单，愚蠢）方法的推动下，我们决定测试这种方法能走多远。为了测试性能，我们使用 0.1 MB 到 4 MB 的 JSON 文件测试了应用程序。大多数应用程序都小于 1 MB，索引该大小的应用程序大约需要 10 到 100 毫秒，时间的顺序随着应用程序的大小大致增加。我们测试的最大应用程序是 4 MB，有超过 180,000 行 JSON 和超过 37,000 个 Airkit 元素。重建 LSIF 索引平均需要大约 600 毫秒。鉴于 Airkit 的核心价值之一是影响力，我们最终认为，就目前而言，朴素的 LSIF 索引器的性能对于大多数应用程序来说已经足够了。它还使我们不必处理竞争条件或维护额外的服务器/网络工作者。\n我们可能已经探索了许多曲折的路径来构建 LSIF 索引器，但最终，我们能够找到一个实用的解决方案，使我们能够提供我们希望提供的功能。虽然这个解决方案在性能方面不是最佳的，但它使我们能够在相对较短的时间内产生最大的影响。在 Airkit 工作最令人兴奋的事情之一是我们可以构建我们自己作为程序员喜欢使用的工具和抽象，例如类型检查器、IDE 工具、UI 框架等。此外，构建可视化编程语言和分布式运行时使我们能够应用来自迷人的计算机科学领域的理论知识并深入研究这些领域，例如编译器、类型理论、分布式系统、数据库等。如果您对这些类型的技术挑战感兴趣，我们正在招聘！在此处查看我们的空缺职位。特别感谢 Ari、Fabian、Aria、Aaron、Joe、Sean、Warren 对内容的审阅和帮助！", "note_en": "In the past 2.5 years of working at Airkit, I’ve been delving deeper and deeper into the fascinating realm of low-code. Amidst this eye-opening yet rather winding expedition, I’ve begun to appreciate the beauty of abstractions. By examining the Airkit’s abstract syntax tree (AST) and my journey of building a Language Server Index Format (LSIF) indexer, we will explore the power of abstractions in the context of a low-code platform.\n  To understand what low-code is, we must first examine what computer programs and programming languages are. Computer programs are sets of instructions for the computer, and programming languages are abstractions, in the form of formal languages, for these sets of instructions. The amount of abstraction provided to a programming language defines how “high-level” it is.  Effectively, abstractions are what make it possible to write programs in higher-level code without thinking in terms of lower-level code, to write programs in C without thinking in terms of assembly code, and to write assembly code without thinking in terms of logic gates.\n At Airkit, we treat low-code as yet another layer of abstraction  — a high-level programming language that happens to be visual. As opposed to traditional text-based programming languages that require scanning and parsing to convert the source code into a parsed tree, which later gets converted into AST (abstract syntax tree), visual programming languages have structural editors that directly build the AST.\n  This exemplifies what low-code is  — a visual way of coding. As seen in this example, the user can actually toggle back and forth between the visual editor mode and the more traditional text editor mode while reading and modifying the underlying AST.\n  The goal of this blog isn’t to perform a deep dive on the Airkit AST. However, having an intuition of what an Airkit application looks like under the hood is useful to understanding how Airkit works.\n    This button is an instance of an Airkit Element, which is the most primitive building block for Airkit applications. There are many different kinds of elements, and compound elements are built up from simpler ones.  We can see that the button AST is actually a compound element comprised of elements that describe its text, style, and events. The right-most panel in Image 1 is the inspector. An inspector is a collection of editors that allow users to modify an element and its sub-components. We can see that the button’s inspector has corresponding editors for the text, style, and events properties of the button element.\n  We have seen earlier how visual editors that comprise the Airkit studio are just syntactic sugar over Airkit elements. Similarly, in React, JSX is just syntactic sugar over React elements. For instance, below is how we could  declare a button in React with JSX.\n      Just as how JSX is simply a visual aid for building React elements, the visual editors in Airkit Studio are just visual aids for building Airkit elements. Both frameworks are simply abstractions that allow users to construct lower-level elements with higher-level programming languages.\n  The Airkit Studio is an IDE, just as XCode, VSCode, and IntelliJ are. An IDE normally consists of the source editor, debugger, navigational/refactoring tools, error trays, etc . These are tools that help a programmer write syntactically and semantically correct programs and are all features in Airkit Studio that we work on.\n In the remaining post, I will unveil the mystery behind how Airkit supports navigational and refactoring tools such as finding references, renaming variables, and more. Before we dive into the technical details, here is a quick demo of renaming a variable.\n  So how does Airkit provide accurate code navigation and refactoring to users within milliseconds? The answer lies in Language Server Index Format (LSIF).\n  LSIF is a standard format for programming tools (language servers, IDEs, etc) to persist knowledge about a code space. A good analogy for LSIF is a database index, which allows a database query to efficiently retrieve data from a database at the cost of additional writes and storage space to maintain the index. LSIF is an index that allows a code viewing client (e.g., a code editor) to provide features like autocomplete or go-to-definition without requiring a language analyzer to perform those computations in real-time.\n If you ever wonder how IDEs like Visual Studio Code provide the same set of refactoring/navigational tools to so many different programming languages, it is because these IDEs have clients that are powered by language-agnostic protocols like LSIF. So as long as there is an LSIF indexer for a programming language to convert files of that language to the LSIF data format, the IDE can work with that language.\n Choosing the LSIF as Airkit’s data model for indexing was easy. After some research, we felt , as opposed to building our own in-house protocol or using another indexing format, LSIF was simple to understand, is supported in many languages, and has ongoing support by several companies like Sourcegraph and Github/Microsoft.\n  To illustrate how LSIF supports efficient code navigation, we will use this code snippet as an example (from  official LSIF specification) .\n  The JSON output below is the LSIF format for the 5 lines of javascript above:\n  As you can see, LSIF is just a collection of nodes and edges. Figure 2 below shows a visual representation of the generated LSIF graph.\n  The bar function declaration is labeled as bar[def] in the visual graph. We can also find the corresponding node in the JSON output: the node with id 9. The bar[def] node is a range node because it represents a symbol in the program ranging from line 0 character 9 to line 0 character 12. Range nodes are uniquely identified with starting and ending line/characters.\n So how does VSCode se LSIF index allow a user to find all references for the bar declaration? The user would first hover over the bar declaration and then click the find-all-references button. Note that hovering over position denoting the “b” in bar and the “r” in bar will return the same range node. The VSCode client would submit a language server request, containing the cursor position, to the language server. The algorithm to find all references for a node is as follows:\n Use the cursor position to identify the range node with the line number and character count. The identified node is bar[def] .\n Traverse to [result set] by taking the next edge. The result set has outgoing edges corresponding to the type of query a user can make about a node, such as references or definition .\n Take the textDocument/references node to the referenceResult node. The referenceResult node contains one or more item edges corresponding to the references of a node .\n Following the two item edges bring us to bar[def] and bar[ref], the two references for bar[def] .\n  For those of you who aren’t familiar with how Airkit’s studio works, I suggest taking a look at this quick  Airkit 101 video.\n To demonstrate how LSIF is used in Airkit Studio, we will continue to work with our button example from earlier. To start off, we need a pair of definitions and references to work with.\n We will first create a definition node. In figure 3, we create a variable called foo under Web Page, which is the parent element of the Button. The tree on the left of Figure 3 is the UI hierarchy of the Web Page . It also signifies the scope for each element. In general, any child elements are inside the  scope of the parent element, so it will have all variables declared by the parent. Therefore, the Button now has access to the foo variable we just created.\n    Next, let’s create a reference node for the foo variable. Instead of just a plain “Click Me”, we now use a dynamic expression that contains the foo variable.\n    Now that we have a variable definition and a variable reference, LSIF will connect the two range nodes as shown in Figure 5.\n  The entire app model is split into many small connected components like Figure 5. Each connected component connects a definition node with a list of reference nodes.\n   Finally, now that we have an LSIF index connecting the foo definition and reference, we can now query for the references of the foo variable in O(1) time. Figure 6 shows how a user could make an LSIF query to fetch references for the foo variable and Figure 7 shows the output of the query.\n  The remainder of this blog post will focus on the interesting technical challenges we faced when implementing LSIF. The first challenge we had to solve was how to modify the LSIF protocol to work with a non-textual programming language. LSIF is built for text-based programming languages: files, line numbers, and starting characters are first-class properties for nodes. In contrast, we store the ASTs of an application as one JSON tree.\n This wasn’t difficult though — we just had to find a way to uniquely identify any Airkit element in the JSON tree. While normal files can use line numbers and character count to uniquely identify symbols, we can use the data path, which is the absolute path from the root of the JSON tree to uniquely identify an element. After figuring out the protocol, we needed to design the LSIF indexer.\n  LSIF is just a data format; there isn’t any documentation on how to build the LSIF index. Here are some of the major decisions we had to make about the indexer:\n  Our team discussed many approaches and here are some of the tradeoffs for each of them.\n  Currently, each client has a state manager (redux) that holds the app definition. When a user edits an app, a command is dispatched to the state manager to apply the commands to the app definition. Our initial approach was to also have the LSIF indexer live on the client. Whenever the state manager  received a command, it would pass the new app definition to the LSIF indexer to rebuild the index each time.\n  The advantage of synchronous updates is that the LSIF index is always guaranteed to be up-to-date. Figure 8 shows the communication between the different components of the system: the user, the state manager, and the LSIF indexer. Time flows from left to right. Each request or response message is represented by an arrow.\n In the example, the update to the LSIF index is performed synchronously . The coordinator waits for the indexer to finish indexing before reporting success to the user. This guarantees that when the user makes a request to the LSIF Indexer, the LSIF Indexer is up-to-date with the latest changes the user submitted.\n The disadvantage of this approach is that since both the state manager and the LSIF Indexer reside on the client, and because javascript is single-threaded, the UI thread would be blocked every time a user makes a change to the app until the state manager responds with success.\n  To not block the UI thread when the LSIF indexer updates the index, we can move the LSIF indexer onto a server, making updates to the LSIF asynchronous.\n With asynchronous updates, there is a problem. As seen in Figure 9, if the user queries LSIF shortly after making a write, the data changes may not yet have reached the LSIF index. If the user queries the LSIF index, it will look like the data they submitted was lost, so they will be confused.\n  In this scenario, we need read-after-write consistency, also known as read-your-writes consistency. This consistency model guarantees that if a user makes a change to the app model and subsequently makes a request to the LSIF index, the index will be up-to-date with the changes made by the user.\n There are various ways to achieve read-after-write consistency with asynchronous updates. One way is to have the client remember the timestamp of its most recent write. Then we just need to make sure the LSIF index won’t respond to any requests until it is up-to-date with the timestamp of the request. Instead of the actual system clock, we can use a logical timestamp, such as the log sequence number formed by the commands the user submits to the state manager. The advantage of asynchronous updates is that the state manager can respond successfully to the user before the LSIF indexer finishes updating the index. The disadvantage is the additional cost of the servers and the latency when making requests to the server. In addition, we would need to make the indexer fault-tolerant. And , if we wanted to protect the indexers against a single node failure or network outage, we would need to make the indexers distributed.\n  A similar approach to server-side indexing is to store and build the LSIF index in a background thread, such as a web worker (the worker thread can perform tasks without interfering with the user interface). The problem of this approach is similar to the problems of server-side indexing — if the system doesn’t guarantee read-after-write consistency, the LSIF may be outdated for a split second.\n   user submits a rename variable request to state manager to change the variable name from foo to bar\n state manager renames the variable, then makes a request to LSIF index for all references of foo\n Suppose a user queries LSIF before the state manager updates the LSIF in stage 4, then the user would get outdated data. This is seen in Figure 10 when the user renames a foo variable to bar, then queries the references of bar, but doesn’t get the renamed bar variables in return.\n The advantage of background thread is that laborious processing can be performed on a separate thread, allowing the UI thread to run without being blocked. The disadvantage of a web worker is the additional complexity to guarantee read-after-write consistency and the additional complexity to prevent memory leaks, etc.\n  Instead of rebuilding the LSIF index each time there is a write, we could perform incremental updates in real-time. This way, we could synchronously update the LSIF index. However, incremental updates come with some interesting technical challenges.\n     The user inserts a baz variable (Figure 13) to an array (Figure 12). How might we incrementally update the LSIF index to the changes made that takes us from Figure 12 to Figure 13?\n You might be thinking since an array is a tree such that each child has its index as its key, can’t we just traverse to the array, increment the index of foo and bar by 1 and insert the baz variable into the graph? Unfortunately, things aren’t as easy as it seems. While the three variables — baz, foo, bar — are semantically connected by the array, they are actually not connected in the LSIF graph. Figure 14 shows that foo and bar are actually two disconnected components.\n  The challenge of building LSIF incrementally is that nodes in the app model that have semantic connections might not be connected in the LSIF graph. This makes it difficult to update data paths when we insert them into an array . It also makes it tricky to garbage collect the graph when a parent node is deleted since we need to recursively find all its children and delete them.\n To solve this problem, we need a reverse index where we can search for a node by data path with a prefix. In the example provided in Figure 13, we need to search foo and bar by the data path elements/ and shift them by one. A good data structure for this would be a trie. Tries are ordered tree data structures for strings, each node is associated with a string inferred from the position of the node in the tree. Tries are also called prefix trees and can be searched by prefixes. All descendants of a node have a common prefix of the string associated with that node. The search/insertion/deletion time is linear to the length of term and key. Using a trie would allow us to find the child of a parent node given the parent node’s data path very easily.\n The disadvantage of using a trie is the time and space complexity to index it. Furthermore, as of now, we decided to not store the LSIF index to reduce the scope of this project. This would increase the initial load time of an application by O(mn) where m is the number of nodes in an application. The number of nodes of an application can range from 200~1000 for normal apps, which makes the load time not trivial.\n  In an ideal world, if we could develop a robust and efficient incremental update algorithm, we would be able to avoid tricky race conditions with fast, synchronous updates. The problem with the approach is that it is error-prone and difficult to implement and maintain. In addition, unlike some projects that can be shipped piece by piece without fully completing, an LSIF indexer either works or it doesn’t. As a result, the incremental update approach is even riskier.\n The initial prototype we built was to rebuild the entire LSIF index synchronously after each user update. Driven by the KISS (keep it simple, stupid) approach, we decided to test how far this approach would go. To test the performance, we tested apps with JSON files ranging 0.1 MB to 4 MB. Most apps are less than 1 MB, and it takes roughly 10ms to 100ms to index apps of that size, with roughly increasing order of time against the size of the app. The biggest app we tested was 4 MB and had more than 180,000 lines of JSON and over 37,000 Airkit elements. To rebuild the LSIF index would take roughly 600ms on average.\n Given that one of Airkit’s core values is impact, we ultimately feel that for now, the performance of the naive LSIF indexer is good enough for most apps. It also allows us to not have to deal with race conditions or to maintain additional servers/web workers.\n  We may have explored many winding paths to build the LSIF indexer, but in the end, we were able to find a practical solution that allowed us to deliver the functionalities we were hoping to deliver. While this solution wasn’t the most optimal in terms of performance, it allowed us to make the biggest impact in a relatively short period of time. One of the most exciting things about working at Airkit is that we get to build tools and abstractions that we enjoy using as programmers ourselves, such as type checkers, IDE tools, UI frameworks, etc. In addition, building a visual programming language and a distributed runtime allows us to apply theoretical knowledge from and dive deep into fascinating computer science domains such as compilers, type theory, distributed systems, databases, etc. If these kinds of technical challenges sound interesting to you, we’re hiring!  Check out our open positions here.\n Special thanks to Ari, Fabian, Aria, Aaron, Joe, Sean, Warren for reviewing and helping out with the content!", "posttime": "2021-08-06 05:39:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,平台,lsif", "title": "为低代码平台构建 LSIF 索引器", "title_en": "Building an LSIF Indexer for a Low-Code Platform", "transed": 1, "url": "https://airkit.com/blog/building-language-server-index-format-indexer", "via": "", "real_tags": ["代码", "平台", "lsif"]}, {"category": "", "categoryclass": "", "imagename": "209d81485441706c0e66b5a4deb7e56b.jpg", "infoid": 1071628, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“Growth hacking 非常适合启动增长、测试新机会并了解哪些策略有效，”van Gasteren 说。 “营销人员应该在增长黑客停止的地方继续前进：制定这些策略，保持客户参与度，并保持策略的新鲜和相关性。”他在荷兰开发了自己的增长黑客课程 Grow With Ward，并与 TikTok、百事可乐和思科等大公司以及 Cyclemasters、Somnox 和 Zigzag 等初创公司合作。在下面的对话中，van Gasteren 分享了围绕长期增长建立内部流程的重要性、今天的增长状态和他自己的发展。你是一名经过认证的增长黑客——你认为这让你与其他人有什么不同？该认证如何改变您与客户合作的方式？我是Growth Tribe 有史以来第一堂课的一员（当时他们仍然提供多月的实习机会），这是一次了不起的经历。认证所显示的不同之处在于，您知道经过认证的增长黑客了解增长黑客的自始至终过程，并且这个人应该看的不仅仅是一个单一的实验来破解他们的增长。有很多牛仔增长黑客只是简单地重复相同的策略，而不是尝试从可重复的过程中工作，在该过程中通过数据识别问题，对想法进行无偏见的优先排序过程，并且将专注于长期学习而不是直接影响。适当的证书表明您知道需要什么。您认为客户何时应该投资于您在网站上提供的初学者增长黑客课程，而不是投资于直接与您合作？我创建了这门课程，目的是让更多的观众可以学习增长黑客。我注意到几乎所有其他增长黑客课程都属于以下两种类型之一：(1) 便宜（&lt;200 美元），但侧重于肤浅的增长策略，或（2）优质的深度内容，但非常昂贵（1,500-5,000 美元） ）。我相信每个人都应该了解如何建立一个系统的流程来实现长期可持续增长，所以我创建了自己的课程，因为我知道与我一对一的工作对大多数人来说也太昂贵了人们。\n尤其是如果你看看学生或初级营销人员，我为他们创建了一个合适的初学者增长黑客课程，它将教你 20% 的知识，这些知识是实现前 80% 的结果所必需的。正如您网站上所述，增长黑客确实与营销有一些明显的不同。客户应该如何在与您（增长黑客）合作而不是与营销人员合作之间做出决定？在与增长黑客合作还是与数字营销人员合作之间的选择不是一个或另一个的选择；这些领域的侧重点非常不同，实际上相互补充。增长黑客非常适合启动增长、测试新机会并了解哪些策略有效。营销人员应该在增长黑客停止的地方继续前进：制定这些策略，保持客户参与度，并保持策略的新鲜和相关性。你不应该聘请增长黑客来维护你的营销策略；他们很高兴能够迈出新的增长步伐，并且在无法测试新想法时会感到无聊。大多数时候，我帮助客户加快步伐，展示哪些机会是有价值的，并为他们提供执行策略。然后我将其交给营销部门进行长期执行并指导他们执行，并在需要新的增长投入时再介入。许多增长黑客仍然将增长黑客视为一种完美的方法，由于我们数据驱动的工作方式，我们总能做出正确的举动。但事实并非如此：您在分析工具中看到的硬数据只能告诉您是什么导致了您的增长放缓，而不能告诉您增长放缓的原因。虽然“为什么”是我们建立实验的基础……许多增长黑客只是用他们自己的假设来填充它以保持速度，但这不是长期可持续的。除了硬数据，您还需要软数据：为什么。这来自于与客户交谈、运行以假设为中心的实验（而不是以结果为中心）以及查看来自客户支持或调查的反馈。每次我与客户实施软数据反馈循环时，我都会看到我们的实验效率从十分之一增加到三分之一。增长行业肯定正在成熟。更少的黑客，更多的团队，更多地关注速度。该领域的每个人都在非常迅速地了解最佳实践并更快地实施它们。那么呢？我们需要更多的知识、更多的定性反馈和更系统的方法来扩大我们的影响，以便能够超越最佳实践，并为我们的业务实施真正相关和复杂的策略。由于该领域日趋成熟，您会看到人们开始摆脱狭隘的工具。\n出于这个原因，我目前正在为增长团队推出一个增长管理工具，称为 Upgrow，团队可以更轻松地管理他们的实验速度，通过单击按钮向利益相关者报告，并确保他们将知识保留系统化他们的文章来建立全公司的知识。你会看到成熟的增长团队需要这种软件来真正提升和管理由于公司的发展而给他们的流程带来压力的趋势。大多数初创公司只是永远不断地完善他们的产品：“只要这个额外的功能，然后我们就会上线。”我可以理解，由于北极星指标、NPS 分数和产品主导的增长在当今围绕初创企业增长的对话中占据主导地位，但让我说实话：你永远不会完全完成。总会有下一个功能。只有与客户一起成长，您才会受益。在您的网站上为正在制作的功能添加“即将推出”，然后开始销售并扩大您的增长努力：不同的渠道带来不同类型的用户，他们会有新的需求，因此您必须适应所有时间。不仅仅是现在。", "note_en": "“Growth hacking is great to kickstart growth, test new opportunities and see what tactics work,” van Gasteren said. “Marketeers should be there to continue where the growth hackers left off: build out those strategies, maintain customer engagement and keep tactics fresh and relevant.”\n  Based in The Netherlands, he has developed his own growth hacking courses,  Grow With Ward, and worked with large companies like TikTok, Pepsi and Cisco, and startups like Cyclemasters, Somnox and Zigzag. In the conversation below, van Gasteren shares the importance of building internal processes around growth for the long term, the state of growth today and his own development.\n  You’re a certified growth hacker — how do you think this sets you apart from others? How has this certification changed the way you approach working with clients?\n I was part of the first-ever class from Growth Tribe (when they still offered multimonth traineeships), which was an amazing experience. The difference that a certification shows is that you know that a certified growth hacker has knowledge of the beginning-to-end process of growth hacking, and that this person is supposed to look at more than just a single experiment to hack their growth.\n  There are a lot of cowboy growth hackers who simply repeat the same tactics, instead of trying to work from a repeatable process, where you identify problems through data, have a non-biased prioritization process for ideas and will focus on long-term learnings over direct impact. A proper certificate shows that you know what it takes.\n When do you think clients should invest in the beginner growth hacking course you offer on your website rather than investing in working with you directly?\n I created the course to make growth hacking available to a larger audience. I noticed that almost all other growth hacking courses fell into one of two buckets: (1) cheap (&lt;$200), but focused on superficial growth tactics, or (2) good quality in-depth content, but very expensive ($1,500-$5,000). And I believe everybody should have access to that knowledge of how to build a systematic process to achieve long-term sustainable growth, so I created my own course, since I know that working one-on-one with me is also too expensive for most people.\n Especially if you’d look at students or junior marketeers, for whom I created a proper beginner growth hacking course that will teach you 20% of the knowledge that is necessary to achieve the first 80% of the results.\n Growth hacking does have some noticeable differences from marketing, as outlined on your  website. How should clients make the decision between working with you, a growth hacker, instead of with a marketer?\n The choice between working with a growth hacker versus a digital marketer is not a one-or-the-other choice; the fields are very different in focus and actually complementary to each other. Growth hacking is great to kickstart growth, test new opportunities and see what tactics work. Marketeers should be there to continue where the growth hackers left off: build out those strategies, maintain customer engagement and keep tactics fresh and relevant. You shouldn’t hire a growth hacker to maintain your marketing strategies; they’re excited to make new growth steps and would get bored when they can’t test new ideas.\n Most of the time, I help a client get up to speed, show which opportunities are valuable and give them a strategy to execute. Then I hand it over to marketing for the long-term execution and coach them on the execution, and step back in when there’s a need for new growth input.\n  A lot of growth hackers still present growth hacking as a perfect approach, where thanks to our data-driven way of working we can always make the right moves. But that’s not true: The hard data that you see in your analytics tools, can only tell you what is slowing down your growth, but not why your growth slows down there. While the “why” is what we build our experiments on top of … many growth hackers just fill that with their own assumptions to keep their speed, but that’s not sustainable long term.\n Next to the hard data, you need soft data: the why. And that comes from talking with customers, running hypothesis-focused experiments (not result-focused) and maybe by looking at your feedback from customer support or surveys. Every time I implement a soft data feedback loop with my clients, I see that we increase our experiment effectiveness from 1 in 10 up to 1 in 3.\n  The growth industry is definitely maturing. Less hacks, more teams, more focus on velocity. Everybody within the field is getting to know the best practices very quickly and implementing them even quicker. So then what? We need more knowledge, more qualitative feedback and a more systematic approach to scale up our impact, to be able to rise above best practices and implement truly relevant and sophisticated tactics for our businesses. Since the field is maturing, you see people starting to get rid of the shoestring tools.\n For this reason, I’m currently rolling out a growth management tool for growth teams, called Upgrow, where teams can more easily manage their experiment velocity, report to stakeholders with the click of a button and make sure that they systemize the knowledge retention from their articles to build companywide knowledge. And you see that mature growth teams need this kind of software to really level up and manage these trends that are putting stress on their process due to the growth of their company.\n  Most startups just keep perfecting their product forever-and-ever: “Just this one extra feature and then we go live.” I can understand that, since north-star metrics, NPS scores and product-led growth are dominating the conversation around startup growth nowadays, but let me be real: You will never be fully done. There will always be a next feature. And you will only have a benefit if you grow alongside your customers. Put a “coming soon” on your website for the features that are in the making, and just start selling and scaling up your growth efforts: Different channels bring different kinds of users, who will have new demands, so you have to be adapting all the time. Not just now.", "posttime": "2021-08-06 04:58:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,雇用,hire,增长", "title": "您应该雇用哪个人：增长黑客还是数字营销人员？", "title_en": "\n\t\t\t\tWhich person should you hire: A growth hacker or a digital marketer?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/05/which-person-should-you-hire-a-growth-hacker-or-a-digital-marketer/", "via": "", "real_tags": ["黑客", "雇用", "hire", "增长"]}, {"category": "", "categoryclass": "", "imagename": "82c6f1066548a33456d492dfc37d8685.jpg", "infoid": 1071626, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为这些发展的一部分，Apple 将能够在其移动设备（如 iPhone 和 iPad）以及上传到 iCloud 的照片中检测已知的 CSAM 图像，同时仍然尊重消费者隐私。与此同时，新的信息功能旨在让父母在帮助孩子学习在线交流方面发挥更积极、更知情的作用。通过今年晚些时候推出的软件更新，Messages 将能够使用设备上的机器学习来分析图像附件并确定共享的照片是否具有色情内容。这项技术不需要 Apple 访问或读取孩子的私人通信，因为所有处理都在设备上进行。任何东西都不会传回苹果在云端的服务器。如果在消息线程中发现敏感照片，该图像将被阻止，并且照片下方会出现一个标签，指出“这可能是敏感的”，并附有一个链接，可单击以查看该照片。如果孩子选择查看照片，则会出现另一个屏幕，其中包含更多信息。在这里，一条消息告诉孩子敏感照片和视频“展示了你用泳衣遮住的私人身体部位”和“这不是你的错，但敏感照片和视频可能会伤害你。”它还表明照片或视频中的人可能不希望看到它，并且可能在他们不知情的情况下被分享。这些警告旨在通过选择不查看内容来帮助引导孩子做出正确的决定。但是，如果孩子仍然点击查看照片，他们将看到一个额外的屏幕，通知他们如果他们选择查看照片，他们的父母将收到通知。屏幕还解释了他们的父母希望他们安全，并建议孩子在感到压力时找人倾诉。它还提供了指向更多资源的链接以获取帮助。屏幕底部仍有一个选项可以查看照片，但同样，它不是默认选项。相反，屏幕的设计方式是突出显示不查看照片的选项。\n这些类型的功能可以帮助保护儿童免受性侵犯，不仅通过引入中断通信并提供建议和资源的技术，而且因为系统会提醒父母。在许多孩子被捕食者伤害的情况下，父母甚至没有意识到孩子已经开始在网上或通过电话与那个人交谈。这是因为儿童掠夺者非常善于操纵，会试图获得孩子的信任，然后将孩子与父母隔离开来，这样他们就会对交流保密。在其他情况下，掠食者也培养了父母。苹果的技术可以通过干预、识别和提醒共享的露骨材料在这两种情况下提供帮助。然而，越来越多的 CSAM 材料是所谓的自生成 CSAM，或由孩子拍摄的图像，然后可以与孩子的伴侣或同龄人自愿共享。换句话说，发送色情短信或分享“裸体”。根据 Thorn 公司 2019 年的一项调查，该公司致力于开发打击对儿童的性剥削的技术，这种做法已经变得如此普遍，以至于五分之一的 13 至 17 岁女孩表示他们曾分享过自己的裸照，十分之一的男孩曾这样做过相同。但是孩子可能不完全理解分享这些图像如何使他们面临性虐待和性剥削的风险。新的消息功能也将在这里提供一组类似的保护。在这种情况下，如果孩子试图发送露骨的照片，他们会在照片发送前收到警告。如果孩子选择发送照片，父母也可以收到一条消息。 Apple 表示，这项新技术将在今年晚些时候作为软件更新的一部分推出，适用于在美国的 iOS 15、iPadOS 15 和 macOS Monterey 的 iCloud 中设置为家庭的帐户此更新还将包括对 Siri 和搜索的更新，将提供扩大指导和资源，以帮助儿童和家长保持在线安全并在不安全的情况下获得帮助。例如，用户将能够询问 Siri 如何报告 CSAM 或儿童剥削。当用户搜索与 CSAM 相关的查询时，Siri 和 Search 也会进行干预，以解释该主题有害并提供资源以获得帮助。", "note_en": "As part of these developments, Apple  will be able to detect known CSAM images on its mobile devices, like iPhone and iPad, and in photos uploaded to iCloud, while still respecting consumer privacy.\n The new Messages feature, meanwhile, is meant to enable parents to play a more active and informed role when it comes to helping their children learn to navigate online communication. Through a software update rolling out later this year, Messages will be able to use on-device machine learning to analyze image attachments and determine if a photo being shared is sexually explicit. This technology does not require Apple to access or read the child’s private communications, as all the processing happens on the device. Nothing is passed back to Apple’s servers in the cloud.\n If a sensitive photo is discovered in a message thread, the image will be blocked and a label will appear below the photo that states, “this may be sensitive” with a link to click to view the photo. If the child chooses to view the photo, another screen appears with more information. Here, a message informs the child that sensitive photos and videos “show the private body parts that you cover with bathing suits” and “it’s not your fault, but sensitive photos and videos can be used to harm you.”\n It also suggests that the person in the photo or video may not want it to be seen and it could have been shared without their knowing.\n  These warnings aim to help guide the child to make the right decision by choosing not to view the content.\n  However, if the child clicks through to view the photo anyway, they’ll then be shown an additional screen that informs them that if they choose to view the photo, their parents will be notified. The screen also explains that their parents want them to be safe and suggests that the child talk to someone if they feel pressured. It offers a link to more resources for getting help, as well.\n There’s still an option at the bottom of the screen to view the photo, but again, it’s not the default choice. Instead, the screen is designed in a way where the option to  not view the photo is highlighted.\n These types of features could help protect children from sexual predators, not only by introducing technology that interrupts the communications and offers advice and resources, but also because the system will alert parents. In many cases where a child is hurt by a predator, parents  didn’t even realize the child had begun to talk to that person online or by phone. This is because  child predators are very manipulative and will attempt to gain the child’s trust, then isolate the child from their parents so they’ll keep the communications a secret. In other cases, the predators  have groomed the parents, too.\n Apple’s technology could help in both cases by intervening, identifying and alerting to explicit materials being shared.\n However, a growing amount of CSAM material is what’s known as self-generated CSAM, or imagery that is taken by the child, which may be then shared consensually with the child’s partner or peers. In other words, sexting or sharing “nudes.” According to a 2019  survey from Thorn, a company developing technology to fight the sexual exploitation of children, this practice has become so common that 1 in 5 girls ages 13 to 17 said they have shared their own nudes, and 1 in 10 boys have done the same. But the child may not fully understand how sharing that imagery puts them at risk of sexual abuse and exploitation.\n The new Messages feature will offer a similar set of protections here, too. In this case, if a child attempts to send an explicit photo, they’ll be warned before the photo is sent. Parents can also receive a message if the child chooses to send the photo anyway.\n Apple says the new technology will arrive as part of a software update later this year to accounts set up as families in iCloud for iOS 15, iPadOS 15, and macOS Monterey in the U.S.\n This update will also include updates to Siri and Search that will offer expanded guidance and resources to help children and parents stay safe online and get help in unsafe situations. For example, users will be able to ask Siri how to report CSAM or child exploitation. Siri and Search will also intervene when users search for queries related to CSAM to explain that the topic is harmful and provide resources to get help.", "posttime": "2021-08-06 04:46:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,孩子,photos", "title": "除了扫描已知的虐待儿童照片外，Apple 还将开始使用设备上的 ML 来警告父母和孩子在 Messages 中出现色情照片", "title_en": "In addition to scanning for known child abuse photos, Apple will also begin using on-device ML to warn parents and kids of sexually explicit photos in Messages", "transed": 1, "url": "https://techcrunch.com/2021/08/05/new-apple-technology-will-warn-parents-and-children-about-sexually-explicit-photos-in-messages/", "via": "", "real_tags": ["apple", "孩子", "photos"]}, {"category": "", "categoryclass": "", "imagename": "7ef94f48266fbbd1a7ec4ded23ac2ee1.png", "infoid": 1071623, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 宣布即将对其操作系统进行更改，其中包括 iCloud 和 iMessage 中的新“儿童保护”功能。如果您曾经关注过加密战争，就会知道这意味着什么：Apple 计划在其数据存储系统和消息传递系统中构建一个后门。剥削儿童是一个严重的问题，苹果并不是第一家为了打击它而改变其隐私保护立场的科技公司。但这种选择会为整体用户隐私付出高昂的代价。 Apple 可以详细解释其技术实施将如何在其提议的后门中保护隐私和安全，但归根结底，即使是一个完整记录、经过深思熟虑且范围狭窄的后门仍然是一个后门。说我们对苹果的计划感到失望是轻描淡写。出于与 EFF 一再阐明的所有相同原因，Apple 历来是端到端加密的拥护者。苹果在端到端加密方面的妥协可能会安抚美国和国外的政府机构，但对于依赖该公司在隐私和安全方面的领导地位的用户来说，这是一个令人震惊的转变。该公司计划在每台 Apple 设备中安装两个主要功能。一种是扫描功能，它会在所有照片上传到 iCloud 照片时进行扫描，以查看它们是否与国家失踪与受虐儿童中心 (NCMEC) 维护的已知儿童性虐待材料 (CSAM) 数据库中的照片相匹配。另一个功能会扫描儿童帐户（即指定为未成年人所有的帐户）发送或接收的所有 iMessage 图像，以查找色情材料，如果孩子足够年轻，则在发送或接收这些图像时通知父母。父母可以打开或关闭此功能。当 Apple 发布这些“客户端扫描”功能时，iCloud 照片的用户、iMessage 的儿童用户以及任何通过 iMessage 与未成年人交谈的人都必须根据这些变化仔细考虑他们的隐私和安全优先级，并且可能在此开发成为卓越的加密信使之一之前，无法安全地使用什么。我们之前已经说过了，现在我们再说一遍：不可能建立一个只能用于儿童发送或接收的色情图片的客户端扫描系统。因此，即使是构建这样一个系统的善意努力，也会破坏信使加密本身的关键承诺，并为更广泛的滥用打开大门。扩大 Apple 正在构建的狭窄后门所需要的只是扩展机器学习参数以寻找其他类型的内容，或者调整要扫描的配置标志，不仅仅是儿童的，而是任何人的账户。那不是滑坡；这是一个完全构建的系统，只是等待外部压力做出最细微的改变。以印度为例，该国最近通过的规则包括对平台识别消息来源和预筛选内容的危险要求。埃塞俄比亚要求在 24 小时内删除“错误信息”内容的新法律可能适用于消息服务。许多其他国家——通常是那些拥有威权政府的国家——也通过了类似的法律。 Apple 的更改将在其端到端消息传递中启用此类筛选、删除和报告。虐待案例很容易想象：禁止同性恋的政府可能需要对分类器进行培训以限制明显的 LGBTQ+ 内容，或者专制政权可能要求分类器能够发现流行的讽刺图像或抗议传单。\n我们已经看到这个任务在行动。最初用于扫描和散列儿童性虐待图像的技术之一已被重新用于创建“恐怖主义”内容数据库，公司可以提供和访问该数据库以禁止此类内容。尽管民间社会发出呼吁，但该数据库由全球互联网反恐论坛 (GIFCT) 管理，在没有外部监督的情况下令人不安。因此，虽然无法知道数据库是否超出范围，但我们确实知道平台经常将关键内容标记为“恐怖主义”，包括暴力和镇压、反言论、艺术和讽刺的文件。 Apple 扫描上传到 iCloud 照片的照片的计划在某些方面类似于微软的 PhotoDNA。主要的产品区别在于 Apple 的扫描将在设备上进行。处理过的 CSAM 图像的（不可审计的）数据库将分布在操作系统 (OS) 中，处理过的图像被转换，以便用户无法看到图像是什么，并使用私有集合交集对这些转换后的图像进行匹配，设备不会知道是否找到了匹配项。这意味着当这些功能推出时，NCMEC CSAM 数据库的一个版本将上传到每部 iPhone。匹配的结果将发送给 Apple，但 Apple 只能在有足够数量的照片与预设阈值匹配后才能判断已找到匹配项。一旦检测到一定数量的照片，有问题的照片将发送给 Apple 内部的人工审核员，他们确定这些照片实际上是 CSAM 数据库的一部分。如果人工审核员确认，这些照片将发送到 NCMEC，并禁用用户的帐户。同样，这里的底线是，无论技术细节中的隐私和安全方面如何，上传到 iCloud 的所有照片都将被扫描。毫无疑问：这是对所有 iCloud 照片用户隐私的减少，而不是改进。目前，虽然 Apple 拥有查看存储在 iCloud 照片中的照片的密钥，但它不会扫描这些图像。公民自由组织已要求该公司取消其这样做的能力。但苹果选择了相反的方法，让自己更多地了解用户的内容。 Apple 的第二个主要新功能是基于 iMessage 发送或接收的扫描照片的两种通知。为了实现这些通知，Apple 将推出一个设备上的机器学习分类器，旨在检测“色情图片”。据 Apple 称，这些功能将（在发布时）仅限于已注册家庭帐户的 18 岁以下美国用户。在这些新流程中，如果 13 岁以下儿童持有的帐户希望发送设备上机器学习分类器确定为色情图片的图像，则会弹出通知，告诉 13 岁以下儿童他们的父母将被告知此内容。如果未满 13 岁的孩子仍然选择发送内容，他们必须接受将通知“家长”，并且图像将不可撤销地保存到他们手机的家长控制部分，供家长稍后查看。对于 13 至 17 岁的用户，会弹出类似的警告通知，但没有家长通知。同样，如果 13 岁以下儿童收到 iMessage 认为“色情”的图片，则在被允许查看照片之前，会弹出一条通知，告诉 13 岁以下儿童他们的父母将收到通知：收到色情图片。同样，如果 13 岁以下的用户接受图像，则会通知父母并将图像保存到手机中。 13 至 17 岁的用户同样会收到警告通知，但不会向其父母的设备发送有关此操作的通知。\n这意味着，如果——例如——使用未开启这些功能的 iPhone 的未成年人将照片发送给启用了这些功能的另一名未成年人，他们不会收到 iMessage 认为他们的图像是“露骨”的通知，或者收件人的父母将收到通知。收件人的父母将被告知内容，而无需发件人同意他们的参与。此外，一旦发送或接收，“色情图片”就无法从 13 岁以下用户的设备中删除。无论是发送还是接收此类内容，13 岁以下的用户都可以选择在不通知父母的情况下拒绝。尽管如此，这些通知给人的感觉是 Apple 正在监视用户——对于 13 岁以下的用户，这基本上是 Apple 赋予父母的能力。同样重要的是要注意，Apple 选择使用机器学习分类器这一臭名昭著的难以审计的技术来确定色情图片的构成。我们从多年的文档和研究中了解到，在没有人工监督的情况下使用的机器学习技术习惯于对内容进行错误分类，包括所谓的“色情”内容。当博客平台 Tumblr 在 2018 年为性内容建立过滤器时，它以捕获网络中的各种其他图像而闻名，包括博美犬幼犬的照片、穿着衣服的人的自拍照等等。 Facebook 试图监管裸体行为，导致哥本哈根小美人鱼等著名雕像的图片被删除。这些过滤器有着令人不寒而栗的表达历史，并且有充分的理由相信 Apple 也会这样做。由于检测“色情图片”将使用设备上的机器学习来扫描消息内容，因此 Apple 将不再能够诚实地将 iMessage 称为“端到端加密”。 Apple 及其支持者可能会争辩说，在消息加密或解密之前或之后进行扫描可以保持“端到端”承诺的完整性，但这将是语义操纵，以掩盖公司对强加密的立场的结构性转变。提醒一下，安全消息系统是一种系统，在该系统中，除了用户及其预期接收者之外，没有人可以阅读消息或以其他方式分析其内容以推断出他们在谈论什么。尽管消息通过服务器，端到端加密消息将不允许服务器知道消息的内容。当同一台服务器有一个通道来显示有关大部分消息内容的信息时，这不是端到端加密。在这种情况下，虽然 Apple 永远不会看到用户发送或接收的图像，但它仍然创建了扫描图像的分类器，以便向父母提供通知。因此，Apple 现在可以将新的训练数据添加到发送到用户设备的分类器中，或者向更广泛的受众发送通知，轻松审查和令人不寒而栗的言论。但即使没有这样的扩展，这个系统也会为那些不考虑孩子最大利益的父母提供另一种监控和控制他们的方式，限制了互联网扩展那些生活将受到限制的人的世界的潜力。而且由于家庭共享计划可能由滥用职权的合作伙伴组织，因此可以想象将此功能用作跟踪软件的一种形式。人们有权在没有后门或审查制度的情况下进行私下交流，包括未成年人。苹果应该做出正确的决定：让这些后门远离用户的设备。", "note_en": "Apple has announced impending changes to its operating systems that include new “protections for children” features in iCloud and iMessage. If you’ve spent any time   following the Crypto Wars , you know what this means: Apple is planning to build a backdoor into its data storage system and its messaging system.\n Child exploitation is a serious problem, and Apple isn&#39;t the first tech company to bend its privacy-protective stance in an attempt to combat it. But that choice will come at a high price for overall user privacy. Apple can   explain at length  how its technical implementation will preserve privacy and security in its proposed backdoor, but at the end of the day, even a thoroughly documented, carefully thought-out, and narrowly-scoped backdoor is still a backdoor.\n To say that we are disappointed by Apple’s plans is an understatement. Apple has   historically been a champion  of end-to-end encryption, for all of the same reasons that EFF has articulated   time   and   time   again . Apple’s compromise on end-to-end encryption may   appease government agencies  in the U.S. and abroad, but it is a shocking about-face for users who have relied on the company’s leadership in privacy and security.\n There are two main features that the company is planning to install in every Apple device. One is a scanning feature that will scan all photos as they get uploaded into iCloud Photos to see if they match a photo in the database of known child sexual abuse material (CSAM) maintained by the National Center for Missing &amp; Exploited Children (NCMEC). The other feature scans all iMessage images sent or received by child accounts—that is, accounts designated as owned by a minor—for sexually explicit material, and if the child is young enough, notifies the parent when these images are sent or received. This feature can be turned on or off by parents.\n When Apple releases these   “client-side scanning”  functionalities, users of iCloud Photos, child users of iMessage, and anyone who talks to a minor through iMessage will have to carefully consider their   privacy and security priorities  in light of the changes, and possibly be unable to safely use what until this development is one of the preeminent encrypted messengers.\n  We’ve said it   before , and we’ll say it again now: it’s impossible to build a client-side scanning system that can only be used for sexually explicit images sent or received by children. As a consequence, even a well-intentioned effort to build such a system will break key promises of the messenger’s encryption itself and open the door to broader abuses.\n  All it would take to widen the narrow backdoor that Apple is building is an expansion of the machine learning parameters to look for additional types of content, or a tweak of the configuration flags to scan, not just children’s, but anyone’s accounts. That’s not a slippery slope; that’s a fully built system just waiting for external pressure to make the slightest change. Take the example of India, where recently passed   rules  include dangerous requirements for platforms to identify the origins of messages and pre-screen content. New laws in Ethiopia requiring content takedowns of “misinformation” in 24 hours   may apply to messaging services.  And many other countries—often those with authoritarian governments—have   passed   similar   laws . Apple’s changes would enable such screening, takedown, and reporting in its end-to-end messaging. The abuse cases are easy to imagine: governments that outlaw homosexuality might require the classifier to be trained to restrict apparent LGBTQ+ content, or an authoritarian regime might demand the classifier be able to spot popular satirical images or protest flyers.\n We’ve already seen this mission creep in action. One of the technologies originally built to scan and hash child sexual abuse imagery has been repurposed to create a   database of “terrorist” content  that companies can contribute to and access for the purpose of banning such content. The database, managed by the   Global Internet Forum to Counter Terrorism  (GIFCT), is troublingly without external oversight, despite   calls from civil society . While it’s therefore impossible to know whether the database has overreached, we do know that platforms   regularly flag critical content  as “terrorism,” including documentation of violence and repression, counterspeech, art, and satire.\n  Apple’s plan for scanning photos that get uploaded into iCloud Photos is similar in some ways to   Microsoft’s PhotoDNA . The main product difference is that Apple’s scanning will happen on-device. The (unauditable) database of processed CSAM images will be distributed in the operating system (OS), the processed images transformed so that users cannot see what the image is, and matching done on those transformed images using private set intersection where the device will not know whether a match has been found. This means that when the features are rolled out, a version of the NCMEC CSAM database will be uploaded onto every single iPhone. The result of the matching will be sent up to Apple, but Apple can only tell that matches were found once a sufficient number of photos have matched a preset threshold.\n Once a certain number of photos are detected, the photos in question will be sent to human reviewers within Apple, who determine that the photos are in fact part of the CSAM database. If confirmed by the human reviewer, those photos will be sent to NCMEC, and the user’s account disabled. Again, the bottom line here is that whatever privacy and security aspects are in the technical details, all photos uploaded to iCloud will be scanned.\n Make no mistake: this is a decrease in privacy for all iCloud Photos users, not an improvement.\n Currently, although Apple holds the keys to view Photos stored in iCloud Photos, it does not scan these images. Civil liberties organizations have   asked the company  to remove its ability to do so. But Apple is choosing the opposite approach and giving itself   more  knowledge of users’ content.\n  Apple’s second main new feature is two kinds of notifications based on scanning photos sent or received by iMessage. To implement these notifications, Apple will be rolling out an on-device machine learning classifier designed to detect “sexually explicit images.” According to Apple, these features will be limited (at launch) to U.S. users under 18 who have been enrolled in a   Family Account . In these new processes, if an account held by a child under 13 wishes to send an image that the on-device machine learning classifier determines is a sexually explicit image, a notification will pop up, telling the under-13 child that their parent will be notified of this content. If the under-13 child still chooses to send the content, they have to accept that the “parent” will be notified, and the image will be irrevocably saved to the parental controls section of their phone for the parent to view later. For users between the ages of 13 and 17, a similar warning notification will pop up, though without the parental notification.\n Similarly, if the under-13 child   receives  an image that iMessage deems to be “sexually explicit”, before being allowed to view the photo, a notification will pop up that tells the under-13 child that their parent will be notified that they are receiving a sexually explicit image. Again, if the under-13 user accepts the image, the parent is notified and the image is saved to the phone. Users between 13 and 17 years old will similarly receive a warning notification, but a notification about this action will not be sent to their parent’s device.\n This means that if—for instance—a minor using an iPhone without these features turned on sends a photo to another minor who does have the features enabled, they do not receive a notification that iMessage considers their image to be “explicit” or that the recipient’s parent will be notified. The recipient’s parents will be informed of the content without the sender consenting to their involvement. Additionally, once sent or received, the “sexually explicit image” cannot be deleted from the under-13 user’s device.\n Whether sending or receiving such content, the under-13 user has the option to decline without the parent being notified. Nevertheless, these notifications give the sense that Apple is watching over the user’s shoulder—and in the case of under-13s, that’s essentially what Apple has given parents the ability to do.\n  It is also important to note that Apple has chosen to use the notoriously   difficult-to-audit  technology of machine learning classifiers to determine what constitutes a sexually explicit image. We know from years of documentation and research that machine-learning technologies, used without human oversight, have a habit of wrongfully classifying content, including supposedly “sexually explicit” content. When blogging platform Tumblr   instituted a filter for sexual content  in 2018, it famously caught all sorts of other imagery in the net, including pictures of Pomeranian puppies, selfies of fully-clothed individuals, and more. Facebook’s attempts to police nudity have resulted in the removal of pictures of famous statues such as Copenhagen’s   Little Mermaid . These filters have a history of chilling expression, and there’s plenty of reason to believe that Apple’s will do the same.\n Since the detection of a “sexually explicit image” will be using on-device machine learning to scan the contents of messages, Apple will no longer be able to honestly call iMessage “end-to-end encrypted.” Apple and its proponents may argue that scanning before or after a message is encrypted or decrypted keeps the “end-to-end” promise intact, but that would be semantic maneuvering to cover up a tectonic shift in the company’s stance toward strong encryption.\n  As a reminder, a secure messaging system is a system where no one but the user and their intended recipients can read the messages or otherwise analyze their contents to infer what they are talking about. Despite messages passing through a server, an end-to-end encrypted message will not allow the server to know the contents of a message. When that same server has a channel for revealing information about the contents of a significant portion of messages, that’s not end-to-end encryption. In this case, while Apple will never see the images sent or received by the user, it has still created the classifier that scans the images that would provide the notifications to the parent. Therefore, it would now be possible for Apple to add new training data to the classifier sent to users’ devices or send notifications to a wider audience, easily censoring and chilling speech.\n But even without such expansions, this system will give parents who do not have the best interests of their children in mind one more way to monitor and control them, limiting the internet’s potential for expanding the world of those whose lives would otherwise be restricted. And because family sharing plans may be organized by abusive partners, it&#39;s not a stretch to imagine using this feature as   a form of stalkerware .\n People have the right to communicate privately without backdoors or censorship, including when those people are minors. Apple should make the right decision: keep these backdoors off of users’ devices.", "posttime": "2021-08-06 04:45:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,加密,plan", "title": "苹果对加密“另辟蹊径”的计划为你的生活打开了后门", "title_en": "Apple's Plan to “Think Different” About Encryption Opens a Backdoor to Your Life", "transed": 1, "url": "https://www.eff.org/deeplinks/2021/08/apples-plan-think-different-about-encryption-opens-backdoor-your-private-life", "via": "", "real_tags": ["苹果", "apple", "加密", "plan"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安全断言标记语言 (SAML) 是一种用于在各方之间交换身份验证和授权数据的开放标准。 SAML 通常用于单点登录（“使用 Google 登录”、“使用 Twitter 登录”等）。这意味着当您要登录 example.com 时，example.com 可以信任并使用外部身份验证提供程序为您断言用户的身份。 SAML 是关于跨组织边界（网络域）传达这些身份验证和身份详细信息。 SAML 最近出现了具有非常大影响的灾难性漏洞。例如，如果我理解正确（我可能理解，因为安全研究人员转发了我的反应）芬兰税务机关、大多数政府服务和健康记录系统都是脆弱的，以至于攻击者本可以继续窥探人们的纳税申报表、健康记录以及基本上任何在线可用的政府相关信息。它在很大程度上被媒体忽略了，也许是因为这些漏洞没有被利用（或者没有检测到这样的实例）。 SAML 使用基于计算值的签名。这种做法本质上是不安全的，因此 SAML 作为设计是不安全的。总而言之：一旦您将安全性基于某些计算属性，您现在就可以利用此计算中的任何缺陷、差异或歧义。计算越复杂，就越危险。SAML 签名计算非常复杂。但是让我们继续解释这个概念。让我们拿一个伪身份文件（尽管实际 SAML 是 XML）：\n现在，如果我们稍微更改文件（我在 { 之前添加了空格）。我们注意到签名发生了变化：这是一个非常好的属性，因为理想情况下，我们希望对安全性进行任何更改（即使是那些在 JSON 级别被认为毫无意义的更改）-关键文档（SAML 是）以生成不同的签名。可以在不破碎的情况下塑造成其他东西的东西的质量，例如粘土的延展性。我们将文档签名为原始字节 blob 使得这种不可延展性，即它不能在不破坏它的情况下成形。这是信息安全领域的理想行为。为了通过示例进行解释，让我们回到 JSON 示例。我们将使用 jq（一个 JSON 转换实用程序）从我们的文档内部计算一些东西：注意通过 jq 管道文件是如何删除空间的？那是因为在 JSON 级别空间并不重要。乍一看，这似乎并不有趣，但我们正在快速前往危险区域。即使文件仍然有空格修改，签名现在与原始签名匹配（来自没有添加空格的文件）。\n$ cat assertion.json{ &quot;signed_in_user&quot;: &quot;EvilAttacker&quot;, &quot;signed_in_user&quot;: &quot;Joonas&quot;}$ cat assertion.json | .jq | sha1sume58dc03a7491f9e5fb2ed664b23d826489c42cc5#上面是因为：$ cat assertion.json | jq .{ &quot;signed_in_user&quot;: &quot;Joonas&quot;} 签名仍然与原始文件匹配。这是因为重复的密钥是有效的 JSON，在处理时被删除，并且大多数 JSON 实现让最后一个密钥获胜。现在，如果您有两段不同的代码来处理 SAML 文档，并且它们对 JSON 重复键（= 消息语义内容）有不同的解释/解析器行为，会发生什么？攻击者要求身份提供者为他签署断言，但由于 SAML 的可延展性，他能够攻击解析器差异并篡改文档，使其对签名验证仍然有效，但可以访问其他用户的数据。现在我希望解释了延展性和基于计算/解释内容的签名是多么危险。这些 SAML 漏洞发生的事情并不像我们的 JSON 示例那么简单，但这说明了这些漏洞的原理及其根本原因：对计算值和延展性进行签名。最新的漏洞是由于 XML 往返不稳定性造成的（请参阅标题“XML 往返漏洞是什么样的”）。\n总之，漏洞产生于解析 XML -&gt; 编写 XML 产生语义不同的文档，即编码（解码（xmlDocument））！= xmlDocument）。我不是 100 % 确定，但我认为由于 SAML 签名验证需要一个 XML 写入步骤，它是这样的：如果 SAML 待签名内容是不可延展的，则上述内容不会成为攻击向量，即身份提供者签署文档后的任何更改都将被检测为签名违规。让我们真诚地假设 SAML 设计者知道不可延展性是一个很好的属性，让我们试着猜测为什么他们最终仍然采用可延展性设计。所以，让我们签署一些东西。当一个人签署某物时，得到一个签名作为输出：sign(contentToSign,signingKey) -&gt; 签名。为了使签名有用，您需要将签名与 contentToSign 一起传输，以便在消费者读取 contentToSign 时，他们可以使用签名对其进行验证。但是缺少签名。 SAML 设计人员可能不想单独传输 SAML 文档及其签名（签名可能在 HTTP 标头或 URL 参数中），因此为了方便起见，他们希望将其嵌入到同一个 XML 文档中：\n从技术上讲，它会得到更多的 YOLO。签名存储在 contentToSign 下，因此在验证过程中，签名需要被忽略（同样是更危险的复杂性），以不将其真正包含在 contentToSign 中，这将使其成为不可能的递归问题：但让我们想象一下之前签名是没有存储在 contentToSign 中，如果我们可以基于字节进行签名验证，请回到问题上来！问题是从 XML 消息内部提取属于 contentToSign 的字节真的很困难。据我所知，XML 解析器 API 不支持此用例。即使有些人愿意，为了使 SAML 有用，他们也必须迎合大多数 XML 解析器实现支持的内容。 =&gt; 当你有 samlDocument 并且你想访问它的子树 contentToSign 时，你只能在那里获得 XML 级别的访问权限，所以 SAML 设计者可能没有考虑太多，去🤷‍♂️ 说“让我们签署 XML-然后水平数据”。对 XML 解析器的输出进行签名真的很难，因为您试图从 XML 解析输出中保持签名输入稳定，XML 解析输出在 XML 库与库之间以及语言与语言之间存在解析器差异。所以这就是为什么我们有 XML dsig 的原因，它具有例如排序 XML 的规则属性在一些 clusterfuck order 中，以便 SAML 实现就验证签名的字节序列达成某种稳定的共识。最后，无论如何我们总是需要匹配字节。这种疯狂被称为规范化，它转换了这样的东西：（这只是我发明的一个例子，我不确定哪些规则确实存在，但这里有一些例子。）总结：XML 子树很难签名/验证，并且有一些可怕的事情来实现这一点，正如经验证据所示，这是一个安全噩梦。\n我愿意记录在案并说使用此类方法的所有内容都已损坏，应该被视为不安全。由于 Go 的漏洞，他们不得不修复 Go 的 XML 堆栈中的往返不稳定性，并且作为安全预防措施，包括在实际处理 XML 之前进行往返稳定性验证。概括地说，不是从一堆字节验证签名，对于 SAML 签名验证，我们需要： XML 规范化（XML dsig，它再次编码但具有特定的复杂规则和转换）如果这对您来说听起来很复杂，那是因为它确实如此。事情越复杂，就越有可能出现错误和安全问题。我是一个业余爱好者，所以请对我的想法持保留态度，但让我们尝试一下。 （注意：这篇文章都是伪代码——它不是真正的 SAML。如果你有兴趣，这里有一个真实的例子。）\n取 &lt;Assertion&gt; 并将其子树序列化为字节并将其存储为 base64 或类似格式，因此我们可以将其作为字节传输，并且只有在签名得到验证后才对其进行 XML 解析：我对 XML 了解不多，所以有可能是传输字符串或字节数据的更漂亮的方法，但这应该足以说明问题。通过这种方式，他们可以将所有内容的属性都保留在一个 XML 文档中 - 但您只需要进行两次 XML 解析：当然，纯粹主义者可能会争辩说，将 XML 作为字符串或字节存储在 XML 中是丑陋的（我同意你的看法） )，但看看我们取得了什么.. 权衡是值得的 - SAMLContentToSign 中的所有内容现在都是不可延展的，您无需在验证来自受信任的来源之前解析安全关键数据。而且我们不需要“XML dsig”这样的呕吐物。 SAML 要求您支持 XML 文档的根未签名的用例，即您只对断言元素进行签名。允许攻击者控制数据的目的是什么？在这些情况下，您需要额外的代码来丢弃不安全的数据，因为如果您最终使用它，那将是一场灾难。我不知道。我不知道更好的标准 - 尽管我不太了解空间。 OAuth2 存在但旨在获得对资源的授权，因此它本身不是身份验证/身份协议。更多关于差异。\n我的猜测也是，一旦标准获得牵引力，即使有可用的选项也很难迁移到更好的选项，因为前一个选项已经具有临界质量（想想 Whatsapp 与 Signal）。让我们摆脱 SAML。 🗑️ 一些专家似乎推荐 OAuth2 或 OpenID Connect：根据我的经验，您对任何主题了解得越多，您就越意识到所有这些都是由泡泡糖和胶带粘在一起的。老实说，这很容易引起焦虑。当我研究这个主题时，我还注意到芬兰政府网站的安全性依赖于一个用 JavaScript 实现的单点登录组件（甚至不是 TypeScript），它： 这只是一个被遗忘的从灾难性的流控制错误中返回，执行意外流尽管签名验证错误处理ValidlySignedPostRequest。但这就是当您使用一种语言实现安全关键软件时得到的结果，其中流控制不是一种语言功能，而是一种构建在该语言之上的库功能。 TypeScript 至少会提供适当的异步/等待流控制，编译器会注意到大多数错误。更新：好消息，Finnishgov&#39;t fork 所基于的上游项目最近已迁移到 TypeScript。 🎉\nhttps://www.imperialviolet.org/2014/09/26/pkcs1.html - PKCS#1 有很多问题，因为首先解析过于灵活的结构，然后根据计算结果验证事物。 “解析是危险的”。 sha1sum 根本不是一个好的签名功能，但它可以证明原理。 ↩︎ 保持更新我的博客文章和项目 - 注册我的时事通讯。 🚀", "note_en": "Security Assertion Markup Language (SAML) is an open standard for exchanging authentication andauthorization data between parties.\n  SAML is often used for  single-sign on(“Sign in with Google”, “Sign in with Twitter” etc.).It means when you want to log in to example.com, example.comcan trust &amp; use an external authentication provider to  assert the user’s identity for you. SAMLis about communicating these authentication &amp; identity details across organization boundaries (web domains).\n    SAML has recently had catastrophic vulnerabilitieswith a really large impact.For example, if I understood correctly(I probably did, since the security researcher retweeted  my reaction)the Finnish tax authority, most government services and health record systems were vulnerable in sucha way that an attacker could have gone on to snoop people’s tax returns, health records and basicallyanything government-related that is available online.\n It’s been largely ignored by the media, perhaps because the vulnerabilities weren’t takenadvantage of (or instances of such weren’t detected).\n  SAML uses signatures based on computed values.The practice is inherently insecure and thus SAML as a design is insecure.\n  In summary: once you base your security on some computed property, you can now exploit any flaws,differences or ambiguity in this computation. The more complex the computation is, the more dangerous it gets.SAML signature computation is pretty fucking complex.\n But let’s move on to explain the concept. Let’s take a pseudo identity document (actual SAML is XML though):\n    Now if we change the file just a little (I added space before the  {).We notice that the signature changes:\n  This is a very good property, because ideally we want any changes (even those considered meaninglessat JSON level) to the security-critical document (which SAML is) to  produce different signatures.\n  the quality of something that can be shaped into something else without breaking, like the malleability of clay.\n Us signing the document as a raw byte blob makes this non-malleable, i.e. it can’t be shaped withoutbreaking it. That’s a desired behaviour in information security.\n   To explain by example, let’s get back to the JSON example. We’ll use  jq(a JSON transformation utility) to  compute something from inside our document:\n   Notice how piping the file through  jq removed the space?That’s because at JSON level the space is not important.At first sight this doesn’t seem interesting, but we’re heading to danger zone and fast.\n    Even though the file still has the space modification, the signature now matches the originalsignature (from the file that didn’t have the space added).\n  $ cat assertion.json{ &#34;signed_in_user&#34;: &#34;EvilAttacker&#34;, &#34;signed_in_user&#34;: &#34;Joonas&#34;}$ cat assertion.json | jq . | sha1sume58dc03a7491f9e5fb2ed664b23d826489c42cc5# the above is because:$ cat assertion.json | jq .{ &#34;signed_in_user&#34;: &#34;Joonas&#34;}\n The signature still matches the original file.This is because  duplicate keys are valid JSON, removed uponprocessing and most JSON implementations let the last key win.\n Now what happens if you have two different pieces of code that process the SAML document and they havedifferent interpretations/parser behaviour regarding JSON duplicate keys (= message semantic content)?\n  An attacker asked the identity provider to sign an assertion for him, but due to SAML malleability hewas able to attack parser differences and tamper the document to still be valid for signature validationbut access data for a different user.\n Now I have hopefully explained how malleability and basing signatures on computed / interpreted contentis dangerous.\n  It is not as straightforward as our JSON example what happened with these SAML vulnerabilities, butthis illustrates the principle of these vulnerabilities and their root cause: signing computed valuesand malleability.\n The latest vulnerabilities were due to XML round-trip instability(see heading “What an XML round-trip vulnerability looks like”).\n In summary the vulnerability arises from when parsing XML -&gt; writing XML produces semanticallydifferent document, i.e.  encode(decode(xmlDocument)) != xmlDocument).\n I’m not 100 % sure but I think since the SAML signature validation needs a XML write step, it wentsomething like this:\n  The above would not be an an attack vector if SAML content-to-be-signed was non-malleable, i.e. any changeafter the identity provider signs the document would be detected as a signature violation.\n  Let’s assume in good faith that the SAML designers knew non-malleability is a good property to haveand let’s try to guess why they still ended up with a malleable design.\n So, let’s sign something. When one signs something, one get a signature as output:  sign(contentToSign, signingKey) -&gt; signature.\n For the signature to be useful, you need to transport the  signature along with  contentToSign sothat when a consumer reads  contentToSign they can verify it with the  signature.\n   But  signature is missing. SAML designers probably didn’t want to transport the SAML document andits signature separately (the signature possibly in a HTTP header or URL parameter), so forconvenience they wanted to embed it in the same XML document:\n  To be more technically correct, it gets even more YOLO than that. The signature is stored under contentToSign, so upon the validation process the signature needs to be ignored ( again moredangerous complexity)to not actually include it in  contentToSign which would make it an impossible recursive problem:\n  But let’s imagine the previous simpler case where the  signature was  not stored inside  contentToSignand get back to the question if we could’ve made signature validation byte-based!\n The problem is that it is really hard to extract the bytes belonging to  contentToSign from insidethe XML message. XML parser APIs to my knowledge don’t support this use case. Even if some would, forSAML to be useful they had to cater to what most XML parser implementations support.\n =&gt; When you have  samlDocument and you’d want to access its sub-tree  contentToSign, you only getXML-level access there, so SAML designers probably didn’t think much of it, went 🤷‍♂️ and said“let’s sign XML-level data then”.\n Signing output of an XML parser is really hard, because you’re trying to keep signature input stablefrom XML parsing output that has parser differences from XML library to library and from language tolanguage.So that’s why we have  XML dsig which has rules for e.g. sortingXML attributes in some clusterfuck orderin order for SAML implementations to reach some kind of stable consensus on which byte sequence to validatethe signature against.In the end we always need to match on bytes anyway.This craziness is known as  canonicalization and it transforms something like this this:\n    (This is just an example I invented, I’m not sure which rules actually exist but here are some examples.)\n Summary: XML sub-trees are hard to sign/validate and there’s some horrible things to enable that andas empirical evidence shows, it’s a security nightmare.\n I’m willing to go on record and say that everything using approaches like these is broken and shouldbe considered insecure.\n  With Go’s vulnerability they had to fix the round-trip instability in Go’s XML stack,and also as a safety precaution include round-trip stability validation beforeactually processing the XML.\n To recap, instead of validating signature from a bunch of bytes, for SAML signature validation we need:\n XML canonicalization (XML dsig, which is encoding again but with specific complex rules and transforms)\n If that sounds complex to you, it’s because it is.The more complex something is, the more likely it is to have bugs and security issues.\n  I’m an amateur, so take my idea with a grain of salt, but let’s try.\n (Note: this post is all pseudo code - it’s not real SAML. Here’s  a real example if you’re interested.)\n    Take the  &lt;Assertion&gt; and serialize its sub-tree into bytes and store it as base64 or similar, so wecan transport it as bytes and only XML-parse it once the signature has been verified:\n  I don’t understand much about XML so there may be even prettier ways to transport strings or byte data,but this should be enough to make a point.\n This way they could’ve kept the property of everything being inside the one XML document - but youjust need to XML-parse twice:\n  Sure, purists may argue that storing XML inside XML as a string or bytes is ugly (and I agree with you),but look what we achieved.. The tradeoff is worth it - everything inside  SAMLContentToSign is nownon-malleable and you don’t need to parse security-critical data before it’s validated as coming froma trusted source. And we don’t need the vomit that is “XML dsig”.\n  SAML requires you to support use cases where the root of the XML document is unsigned, i.e. you onlysign the assertion elements. What is the purpose of allowing attacker-controlled data? You need additional codeto discard the unsafe data in these cases anyway because it’d be a catastrophe if you’d end up using it.\n  I don’t know. I’m not aware of a better standard - although I don’t know the space well.\n OAuth2 exists but is geared towards getting authorization to resources, so it’s not an authentication /identity protocol per se. More on the differences.\n  My guess is also that once a standard gains traction, it’s hard to migrate to a better optioneven if one is available, since the previous option already has critical mass (think Whatsapp vs. Signal).\n  Let’s get rid of SAML. 🗑️ Some experts seem to recommend OAuth2 or OpenID Connect:\n    It is my experience that the more you learn about any subject, the more you realize it’s all heldtogether by bubblegum and duct tape.It’s honestly pretty anxiety inducing.\n  When I was researching about this subject, I also noticed that the Finnish government websites&#39; securityrelies on a single-sign-on component implemented in JavaScript (not even TypeScript) which:\n It’s only one forgotten  return away from catastrophic flow control bugwhere execution accidentally flows to  processValidlySignedPostRequest despite signature validation error. But that’s what you get when you implement security-critical software with a language where flowcontrol is not a language feature but a library feature built on top of the language.\n TypeScript would at least have given proper async/await flow control with the compiler noticing most of the bugs.\n Update: great news,  the upstream project the Finnishgov’t fork is based on, had recently been migrated to TypeScript. 🎉\n  https://www.imperialviolet.org/2014/09/26/pkcs1.html - PKCS#1 has had a lot of issues resultingfrom parsing overly-flexible structures first, then validating things based on the computedresult. “parsing is dangerous”.\n sha1sum is not at all a good signing function but it works to demonstrate the principle.  ↩︎\n  Stay updated on my blog posts &amp; projects - sign up for\t\t\t my newsletter. 🚀", "posttime": "2021-08-06 04:44:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,saml,insecure,xml", "title": "SAML 的设计不安全", "title_en": "SAML Is Insecure by Design", "transed": 1, "url": "https://joonas.fi/2021/08/saml-is-insecure-by-design/", "via": "", "real_tags": ["设计", "saml", "insecure", "xml"]}, {"category": "", "categoryclass": "", "imagename": "86bdd2e53448476052eb0d4f087e5786.png", "infoid": 1071621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，我毫不含糊地暗示某个期待已久的功能即将到来。在这一点上，我认为为这篇文章的其余部分定下基调是个好主意。经过多年（断断续续）讨论 1，我很高兴能够介绍 Org 新的本地引用语法。 Org 已经发展出一个经过彻底设计、模块化、功能强大的引文系统。最后，您可以参考 Org 了解您的所有归因需求。特别感谢 Nicolas Goaziou 的领导，JohnKitchin 为 org-ref 包铺平道路，Bruce D&#39;Arcus 对设计决策进行了大量仔细考虑并开始记录一些细节 - 以及许多其他居民多年来为讨论做出贡献的邮件列表。 András Simonyi 还特别值得一提的是他创建 Elisp CSL 库 Citeproc.el 的工作，该库虽然没有直接包含在 Org 中，但对于提供强大的 CSL 支持至关重要，并且与 oc-csl.el 集成。引文经过精心设计，用户和 Elisptinkerers 将能够轻松地调整和扩展它以满足他们的需求。为此，Org Cite（或简称 OC）已分为两部分：引文处理器，接口使用 oc.el 生成格式良好的引文，插入到您的书目、文本中，并在缓冲区中均匀渲染 2 每个功能都可以分配一个特定的引文处理器，独立于其他功能。开箱即用，Org 使用基本处理器来完成所有这些任务。 basic，它没有依赖关系并提供所有四个功能。它导出为所有格式，但只提供非常简单的引文。\nbiblatex 和 natbib，它们提供通过 Biber 和（在较小程度上）natbib 创建引文的导出功能，但仅适用于 LaTeX。 csl，它使用引用样式语言提供导出功能，并导出到 HTML、LaTeX、Org 和纯文本（ODT 有一个未解决的问题）— 但取决于 citeproc.el。这为其他软件包的构建提供了坚实的基础，尽管 Org Cite 尚未发布或在手册中记录，但我们已经看到了像 org-ref-cite（由 John Kitchin 编写）这样的软件包的开发。要开始使用 Org Cite，我们必须有某种形式的参考书目。这可以是 BibTeX 文件或 CSL-JSON 文件。 { OrgCitations, ={org, mode and Syntax, Citation and List, Mailing and Effort, Time}, ={Journal of Plain Text Formats}, ={Elegant Citations with Org-Mode}, ={2021}, ={7} , ={42}, ={1}, ={2-3}} 首先我们需要让 Org 知道这个参考书目文件（它必须有一个 .bib、.bibtex 或 .json 扩展名），我们可以这样做通过 #+bibliography 关键字，或变量 org-cite-global-bibliography。一旦您有了参考书目来源，您就可以开始参考您的心声了！基本的引用语法如下：\n使用默认样式 [cite:@OrgCitations] 产生（org et al. 2021）。有关当前可用样式的更多信息，请参见 1。 最后，要在某处插入参考书目，我们只需要插入 #+print_bibliography 关键字，如下所示：不要让上面示例中的简单性欺骗了您，新语法是能够表达更复杂的形式。这是 newcite 语法的完整版本： 通用前缀和后缀，分别放在生成的引文的开头和结尾 引文键指的是 Bib(La)TeX 或 CSL-JSON 键 一些引文处理器识别定位器，它们指的是到工作的特定部分，例如：p。 7 参考第 7 页。使用默认的 CSL 引文样式（芝加哥作者姓名）[cite/l/b:see@OrgCitations pp. 7 for fun] 变为 see org et al. 2021 年，7 只为了好玩。引文样式和变体以及识别的定位符由引文处理器处理。 Org cite 的捆绑处理器目前支持以下引用样式。\n引文处理器是基于 org-cite-export-processors 根据所使用的导出格式自动选择的，但可以通过 #+cite_export 关键字在每个文档的基础上进行设置。在这里，我将使用 cslprocessor，使用 org-cite-export-processors，您还可以通过提供三组参数 (PROCESSOR BIBLIOGRAPHY-STYLE CITATION-STYLE ) 而不仅仅是处理器来设置参考书目和引文样式。您还可以将这个三元组值与 #+cite_export 关键字一起使用 还有一些关于如何生成参考书目的更多选项。这些选项由活动引文处理器处理。例如，虽然 CSL 处理器当前不支持任何选项，但 BibLaTeX 处理器将选项传递给命令，允许以下操作： Citeproc 目前在 MELPA 上可用，因此可以通过您选择的包管理器安装，只要 MELPA 包含在您的包档案。当可用时，它会被 oc-csl.el 自动加载。如果您对其他格式感兴趣，请知道 Citeproc 旨在轻松支持添加新格式（请参阅 citeproc-formatters.el 示例）。导出时，您可以通过提供 CSL 样式文件的路径来设置样式，无论是相对于 org-cite-csl-styles-dir 的绝对路径还是相对路径。例如，如果我下载 apa.csl，我可以像这样使用它：当没有给定样式时，将使用 org-cite-csl--fallback-style-file，默认为捆绑的芝加哥作者日期样式。\n有很多可用的参考管理器，但是，如果您将自己限制在以下应用程序中，列表会迅速缩小： Zotero 是一个不错的选择，如果您正在使用它，则可以很容易地将它与 Org Cite 一起使用。开箱即用，您可以告诉它将您的库或其中的一部分导出到 .bib 文件并自动保持同步。不过，我建议安装 Better BibTeX 扩展。 Zotero 也适用于 CSL。除了支持 CSL-JSON 导出之外，Zotero 还提供了一种在首选项中安装 CSL 样式的简单方法。由于这些文件放在 ~/Zotero/styles 下，您可以通过将 org-cite-csl-styles-dir 设置为 Zotero 样式目录来将它们与 Org Cite 和 Citeproc 一起使用。然后使用由 ~/Zotero/styles/apa.csl 定义的引用样式，然后可以在使用 #+cite_export 关键字时简单地引用 apa.csl。 Org Cite 在上个月才刚刚合并，尚未包含在 Org 版本中，但我们看到了社区的极大兴趣。第三方软件包已经有了有希望的发展，例如 bibtex-actions和 org-ref-cite。我迫不及待地想看看生态系统如何继续发展😃。 1 引用最早是在 2007 年的邮件列表中提到的，当时是在一个关于脚注的线程中。\n2 目前正在努力使用 oc.el 和 citeproc.el 在缓冲区中生成引文覆盖。", "note_en": "Last month I not-at-all-subtly hinted that a certain long-awaited feature wasarriving imminently. At this point, I think it’s a good idea to set the tone for the rest ofthis post.\n  After  years of (on and off) discussion  1, I am elated to be able to presentOrg’s new native citation syntax. Org has grown a thoroughly designed, modular,capable citation system. At last you can refer to Org for all your attributionneeds. Special thanks must go to Nicolas Goaziou for leading the charge, JohnKitchin for paving the way with the  org-ref package, Bruce D’Arcus for driving alot of careful consideration of design decisions and starting to document someof the details — and the many other denizens of the mailing list who havecontributed to the discussion over the years.\n András Simonyi’s also deserves a special mention for his work creating the Elisp CSL library  Citeproc.el, which while not directly included in Org is crucial toproviding robust  CSL support, and integrates with  oc-csl.el.\n Citations have been carefully designed in such a way that users and Elisptinkerers will be able to easily adapt and extend it to fit their needs.To that end, Org Cite (or  OC for short) has been split into two halves:\n Citation processors which interface with  oc.el to produce nicely-formattedcitations to be inserted in your bibliography, within the text, and evenrendered in the buffer  2\n   Each capability can have a particular citation processor assigned, independentlyof the others. Out of the box, Org uses the  basic processor for all of these tasks.\n  basic, which has no dependencies and provides all four capabilities. It exportto all formats, but only provides very simple citations.\n biblatex and  natbib, which provide the export capability to create citationsvia  Biber and (to a lesser extent)  natbib, but only for LaTeX.\n csl, which provides the export capability using the  Citation Style Language,and exports to  HTML, LaTeX, Org, and plain text (with an  open issue for  ODT)— but depends on  citeproc.el.\n This provides a solid foundation for other packages to build off, and despiteOrg Cite being yet to be released or documented in the manual we are alreadyseeing the development of packages like  org-ref-cite (by John Kitchin).\n To get started with Org Cite, we must have some form of bibliography.This can either be a BibTeX file or a  CSL- JSON file.\n       { OrgCitations,  ={org, mode and Syntax, Citation and List, Mailing and Effort, Time},  ={Journal of Plain Text Formats},  ={Elegant Citations with Org-Mode},  ={2021},  ={7},  ={42},  ={1},  ={2-3}}\n  First we need to let Org know about this bibliography file (which must have a .bib,  .bibtex, or  .json extension), which we do either via the  #+bibliographykeyword, or the variable  org-cite-global-bibliography.\n         Once you have a bibliography source, you can start referencing to your heart’scontent! The basic citation syntax is as follows:\n  Using the default style  [cite:@OrgCitations] produces ( org et al. 2021). Formore information on the styles currently available, see  1.\n Finally, to insert a bibliography somewhere, we just need to insert the #+print_bibliography keyword, like so:\n Don’t let the simplicity in the examples above fool you, the new syntax is quitecapable of expressing more complex forms. Here’s the  full version of the newcite syntax:\n  The  common prefix and  suffix and put at the start and end of the generatedcitation, respectively\n The citation  key refers to a Bib(La)TeX or  CSL- JSON key Some citation processors recognise locators, which refer to a particularpart of the work, for example:  p. 7 to refer to page 7.\n Using the default  CSL citation style (Chicago author-name)  [cite/l/b:see@OrgCitations pp. 7 for fun] becomes see  org et al. 2021, 7 for fun.\n The citation styles and variants, and recognised locators are handled by thecitation processors. Org cite’s bundled processors currently supports thefollowing citation styles.\n The citation processor is automatically selected based on org-cite-export-processors based on the export format being used, but can be seton a per-document basis via the  #+cite_export keyword. Here, I shall use the  cslprocessor,\n         With  org-cite-export-processors, you can also set the bibliography and citationstyle by giving a triplet of parameters   (PROCESSOR BIBLIOGRAPHY-STYLE CITATION-STYLE ) instead of just the processor. You can also use this triplet ofvalues with the  #+cite_export keyword\n         There are also some more options about how the bibliography is produced. Theseoptions are handled by the active citation processor. For example, while the  CSLprocessor does not currently support any options, the BibLaTeX processor passesoptions to a     command, allowing for thefollowing:\n Citeproc is currently available on   MELPA, and so can be installed via yourpackage manager of choice so long as  MELPA is included in your package-archives. When available, it will be automatically loaded by oc-csl.el.\n   Should you be interested in other formats, know that Citeproc is designed toeasily support adding new formats (see  citeproc-formatters.el for examples).\n    When exporting, you can set the style by providing a path to  CSL style files,either absolute or relative to  org-cite-csl-styles-dir. For example, if Idownload  apa.csl I can use it like so:\n         When no style is given  org-cite-csl--fallback-style-file will be used, whichdefaults to a bundled Chicago author-date style.\n There are quite a few reference managers available, however, the list rapidlyshrinks if you restrict yourself to applications which are:\n  Zotero is a good option, and if you’re using it it’s quite easy to use it withOrg Cite. Out of the box, you can tell it to export your library, or parts of it,to a  .bib file and automatically keep it in sync. I’d recommend installing the Better BibTeX extension though.\n   Zotero also works well with  CSL. In addition to supporting  CSL- JSON exports,Zotero also features an easy way to install  CSL styles within the preferences.\n  Since these files are put under  ~/Zotero/styles, you can use them with Org Citeand Citeproc simply by setting  org-cite-csl-styles-dir to the Zotero stylesdirectory.\n        To then use the citation style defined by  ~/Zotero/styles/apa.csl one can thensimply refer to  apa.csl when using the  #+cite_export keyword.\n Org Cite has only just been merged in the past month, and is yet to be includedin an Org release, but we’re seeing a tremendous degree of community interest.There are  already promising developments with third-party packages, such as bibtex-actions and  org-ref-cite. I can’t wait to see how the ecosystem continuesto develop 😃.\n 1  Citations were first being mentioned on the mailing list back in 2007, in a thread about footnotes.\n 2  There is currently an  ongoing effort to use  oc.el and  citeproc.el toproduce citation overlays in the buffer.", "posttime": "2021-08-06 04:44:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "emacs,组织,org", "title": "Emacs 的组织模式获得引用支持", "title_en": "Emacs' org-mode gets citation support", "transed": 1, "url": "https://blog.tecosaur.com/tmio/2021-07-31-citations.html", "via": "", "real_tags": ["emacs", "组织", "org"]}, {"category": "", "categoryclass": "", "imagename": "4084adfde0cd759fb2add1773787ca26.jpg", "infoid": 1071618, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌正在通过新版本的谷歌 Nest Doorbell 和几个新版本的谷歌 Nest Cam 对 Nest 相机系列进行更新。该公司还降低了 Nest Cam 的限制性商业模式，该模式以前几乎需要每月支付订阅费才能获得有用的相机。我们将在一分钟内了解新型号，但最大的消息是谷歌正在使相机更有用，而无需每月订阅。以前，录制视频等核心相机功能被锁定在名为“Nest Aware”的每月 6 至 12 美元订阅计划之后，但新相机现在可以录制本地视频。您只能获得三个小时的“事件”（运动检测，而不是 24/7 视频），但这是一个开始。谷歌还将活动区域和一些图像识别功能从基于云的按月付费服务转移到设备上处理，因此它们也无需订阅即可工作。如果您仍想为“Nest Aware”订阅付费，它分为两层。有 6 美元的“Nest Aware”，可为您提供 30 天的“事件”视频历史记录和面部识别。免费套餐可以检测人、动物和车辆并向您发出警报，但订阅增加了“熟悉面孔”的面部识别功能，因此 Nest 可以判断亲人或陌生人是否在门口，并相应地提醒您。每月 12 美元的套餐是“Nest Aware Plus”，如果您有有线（非电池供电）Google Nest Cam（门铃可以t 录制连续视频）。另一个重要的附加生活质量功能是相机现在可以离线工作。本地存储和设备上处理意味着相机可以在没有互联网的情况下运行；以前，云是他们处理和存储视频的唯一方式。如果您的互联网不稳定，此添加将有所帮助，但当 Google 的 Nest 云服务出现故障时，它也会很有用，这种情况经常发生。让我们谈谈硬件。今天发布的发货日期为 8 月 24 日，分别是“Google Nest Cam（电池）”和“Nest Doorbell（电池）”，每个售价 179 美元。两款仅支持 Wi-Fi 的摄像头（最高 802.11n）均具有 IP54 防水等级，适合户外使用、用于语音通信的扬声器和麦克风以及运动传感器。 Nest Cam 配备 1/2.8 英寸、2MP 传感器，用于 1080p 和 30 fps 视频输出，而门铃则配备 1/3 英寸、1.3 MP 传感器，适用于 960p 视频。您可能会注意到每个产品名称后面的“电池”名称：Nest 相机现在配备了 6000 mAh 的板载电池，允许设备在断电期间工作。如果您不想进行任何安装工作，相机可以完全依靠电池运行。以完全由电池供电的方式运行设备实际上是默认体验，谷歌吹捧简单的“无线安装”。电池的持续时间将取决于每月发生多少运动事件，谷歌预测电池寿命为 1.5 个月到 7 个月不等，具体取决于流量。在那之后，您必须将东西从墙上拉下来（磁性安装系统使这变得非常容易）并插入以充电。或者，您可以节省一生的充电时间，只需安装一根电源线即可。包装盒中包含一根 1 m（3.3 英尺）“充电电缆”，它使用专有的弹簧针连接，但对于永久性户外安装，Google 希望您以 34.99 美元的价格购买 5 m Nest Cam Weatherproof Cable。门铃可以通过您的门铃线自行充电，如果您想让它响起传统的门铃铃声，这也是必需的。\n谷歌还发布了售价 99.99 美元的“Google Nest Cam（有线）”，它仅限室内使用并带有固定电源线，以及售价 279.99 美元的“带有泛光灯的 Google Nest Cam”，它的侧面有两个大灯用于户外照明。两者都只是被戏弄，缺乏发布日期或详细信息。好的，让我们把一些东西放在一起。 Nest 摄像头在 Wi-Fi 上工作，因此它们没有以太网线。它们也可以完全依靠电池供电，因此也不需要电源线。正如一段时间以来的情况一样，Nest 摄像头和壁挂支架之间的连接系统是磁性的。因此，如果该设备是完全无线且磁性安装的，那么是什么阻止人们使用它呢？你不能直接走过去偷相机，不用工具吗？是的，情况似乎如此。谷歌实际上有一份支持文件说，如果有人拿着你的相机离开并且你提交了警方报告，公司将免费更换设备。您可以将它安装在离地面足够高的位置，使其更难被盗，但您仍然需要使用相机为其充电。谷歌还出售售价 14.99 美元的“防盗支架”，它可以夹在 Nest 摄像头周围，让您可以用金属电缆将其固定在墙上。至少有人在一系列盗窃事件开始之前就考虑过这一点，但似乎安全摄像头的安全性应该更多地作为基本设计考虑。这些新相机也标志着 Nest 应用程序终结的开始。自 2018 年 Nest 从一家独立的 Alphabet 公司转变为 Google 的子品牌以来，Google 一直致力于逐步淘汰合并前的 Nest 基础设施。我们已经看到“Works with Nest”生态系统和 Nest 帐户的消亡，这些新相机根本不使用 Nest 应用程序，而是通过 Google Home 应用程序工作。 Nest 应用程序现在仅适用于旧设备。", "note_en": "Google is introducing updates to the Nest camera line with a new version of the Google Nest Doorbell and several new versions of the Google Nest Cam. The company is also toning down the Nest Cam&#39;s restrictive business model, which previously has all but required paying a monthly subscription fee to get a useful camera.\n We&#39;ll get to the new models in a minute, but the biggest news is that Google is making the cameras more useful without a monthly subscription. Previously, core camera features like  recording video were locked behind a $6-$12 monthly subscription plan called &#34;Nest Aware,&#34; but the new cameras can now record local video. You only get three hour&#39;s worth of &#34;events&#34; (motion detection, as opposed to 24/7 video), but it&#39;s a start. Google has also moved activity zones and some image recognition features from the cloud-based pay-per-month service to on-device processing, so they work without a subscription, too.\n If you still want to pay for the &#34;Nest Aware&#34; subscription, it comes in two tiers. There&#39;s the $6 &#34;Nest Aware,&#34; which gives you 30 days of &#34;event&#34; video history and facial recognition. The free tier can detect and alert you about people, animals, and vehicles, but the subscription adds facial recognition for &#34;Familiar faces&#34; so Nest can tell if a loved one or stranger is at the door and alert you accordingly. The $12-per-month tier is &#34;Nest Aware Plus,&#34; which provides 60 days of event video history and 10 days of 24/7 video history if you have a wired (not battery-powered) Google Nest Cam (the doorbell can&#39;t record continuous video).\n    Another big added quality-of-life feature is that the cameras can now work offline. Local storage and on-device processing mean the cameras can function without the Internet; previously, the cloud was the only way they had to process and store video. This addition will help if your Internet is spotty, but it will also be useful when Google&#39;s Nest cloud service goes down, which happens  fairly frequently.\n Let&#39;s talk hardware. Unveiled today, with a ship date of August 24, are the &#34; Google Nest Cam (battery)&#34; and the &#34; Nest Doorbell (battery)&#34; for $179 each. Both Wi-Fi-only cameras (up to 802.11n) have IP54 water resistance for outdoor use, speakers and microphones for voice communications, and motion sensors. The Nest Cam features a 1/2.8-inch, 2MP sensor for 1080p and 30 fps video output, while the doorbell has a 1/3 inch, 1.3 MP sensor, good for 960p video.\n You might notice that &#34;battery&#34; designation after the name of each product: Nest cameras have on-board 6000 mAh batteries now, allowing the devices to work during a power outage. If you don&#39;t want to do any installation work, the cameras can run entirely on batteries. Running the devices as completely battery-powered is actually the default experience, and Google touts an easy, &#34;Wire-free installation.&#34; How long the battery lasts will depend on how many motion events happen per month, with Google predicting anywhere from 1.5 months to seven months of battery life, depending on traffic. After that point, you&#39;ll have to pull the thing off the wall (the magnetic mounting system makes this very easy) and plug it in to recharge it.\n Alternatively, you could save yourself a lifetime of recharging and just install a power wire. Included in the box is a 1 m (3.3 ft) &#34;charging cable&#34; that uses a proprietary pogo-pin connection, but for permanent outdoor installation, Google wants you to buy the 5 m  Nest Cam Weatherproof Cable for $34.99. The Doorbell can recharge itself via your doorbell wire, which is also required if you want it to ring a traditional doorbell chime.\n    Google also announced the $99.99 &#34; Google Nest Cam (wired),&#34; which is indoor-only and has a fixed power wire, and the &#34; Google Nest Cam with floodlight&#34; for $279.99, which has two big lights on the side for outdoor lighting. Both were only teased and lack a launch date or detailed information.\n     OK, let&#39;s put a few things together here. The Nest cameras work on Wi-Fi, so they don&#39;t have an Ethernet wire. They can also run entirely on battery power, so there&#39;s no power cable, either. And as has been the case for  a while now, the connection system between the Nest camera and the wall mount is magnetic. So if the device is totally wireless and magnetically mounted, what is stopping people from just taking it? Can&#39;t you just walk up and steal the camera, using no tools?\n Yep, that seems to be the case. Google actually has  a support document saying that if someone walks off with your camera and you file a police report, the company will replace the device for free. You could mount it high enough off the ground to make it harder to steal, but you&#39;ll still need to access the camera to charge it.\n Google is also selling a $14.99 &#34; anti-theft mount,&#34; which clamps around the Nest camera and lets you tether the thing to the wall with a metal cable. At least someone thought about this before a rash of thefts started, but it seems like the security of a security camera should be more of a base-design consideration.\n These new cameras also mark the beginning of the end for the Nest app. Since Nest moved from a separate Alphabet company to a Google sub-brand in 2018, Google has been working on  phasing out the pre-merger Nest infrastructure. We&#39;ve already seen the death of the  &#34;Works with Nest&#34; ecosystem and Nest accounts, and these new cameras don&#39;t use the Nest app at all and instead work via the Google Home app. The Nest app is just for legacy devices now.", "posttime": "2021-08-06 03:58:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,nest", "title": "新的 Google Nest Cam 无需按月订阅即可录制视频", "title_en": "New Google Nest Cams can record video without a monthly subscription", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/08/new-google-nest-cams-can-record-video-without-a-monthly-subscription/", "via": "", "real_tags": ["google", "nest"]}, {"category": "", "categoryclass": "", "imagename": "c84094031a45fd8eb7b5f253879a502b.png", "infoid": 1071617, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于 Y: The Last Man 的电视连续剧，屡获殊荣的 Vertigo 漫画系列关于特定性别的启示，似乎总是不可避免的，但自 2008 年漫画系列结束以来，真人改编的计划一直徘徊在明显的发展地狱。下个月，当一部电视剧最终在 Hulu 上推出时，一切都会改变。这条新闻以预告片的形式出现，展示了该系列的明星，同时解释了它对社会破坏性疾病的特殊扭曲。原版漫画由前迷失作家/制片人 Brian K. Vaughan（也参与了 Saga 和 Paper Girls 等深受喜爱的漫画系列）撰写，围绕地球上所有具有 Y 染色体的事物同时死亡展开，人类和动物都一样。周四的新预告片重述了同样的前提，重点关注美国总统死于血腥崩溃，随后显然是这个星球上的其他所有人……除了一个。那个名叫约里克·布朗的男人（本·施内泽饰）开始穿越一个被摧毁的美国，这个电视版本与漫画相匹配，包括他的宠物猴子，名叫 Ampersand（也有 Y 染色体）。与此同时，他的母亲，参议员詹妮弗·布朗（黛安·莱恩饰），显然已经接管了美国总统的权力。这是对原始漫画的一个转折，其中约里克的母亲在国会，但不一定晋升为最高等级。首映预告片的其余部分需要根据我们对原始漫画的了解在字里行间阅读。最容易绘制的联系来自特工 355（由 Ashley Romans 饰演）的角色，他是一个被指派保护约里克的秘密美国军事组织的成员，我们看到 355 代表约里克踢屁股并激活炸药。我们还在幸存的女性中看到了一些敌对派系的暗示，尽管预告片没有说明她们是否是亚马逊世界末日女儿的一对一比赛。还有像艾莉森曼博士（戴安娜邦饰）和约里克的妹妹英雄布朗（奥利维亚瑟尔比饰）等原创系列角色的短暂闪光。 《Y：最后一个人》可能的真人版已经上映十多年了；发展包括一部从未投入生产的长篇电影、一部被废弃的 2018 年电视试播集、更换节目主持人以及重新塑造约里克的主角。目前尚不清楚它在 Hulu 上的独家主场是否会为该系列带来福音，尽管我们希望该情节对主要女性演员的强调（以及 FX 坚持整个第一季由女性导演）将带来新鲜感从 9 月 13 日开始在电视屏幕上播出。", "note_en": "A TV series based on  Y: The Last Man,  the award-winning Vertigo comic series about a sex-specific apocalypse, has always seemed inevitable, but ever since the comic series wrapped in 2008, plans for a live-action adaptation have lingered in apparent development hell. That all changes next month, when a TV series finally launches on Hulu. The news came in the form of a trailer that shows off the series&#39; stars while explaining its peculiar twist on a society-crushing disease.\n The original comics, written by former  Lost writer/producer Brian K. Vaughan (also involved with beloved comic series like  Saga and  Paper Girls), revolved around the simultaneous death of everything on Earth with a Y chromosome, humans and animals alike. Thursday&#39;s new trailer recaps the same premise by focusing on the president of the United States succumbing to a bloody collapse, followed by apparently every other man on the planet... save one.\n That man, Yorick Brown (played by Ben Schnetzer), begins making his way across a decimated United States, and this TV version matches the comics by including his pet monkey named Ampersand (who also has a Y chromosome). Meanwhile, his mother, Senator Jennifer Brown (played by Diane Lane), apparently assumes control as president of the United States. That&#39;s a twist on the original comics, which had Yorick&#39;s mother in Congress but not necessarily promoted to the top of the pecking order.\n    The rest of the premiere trailer requires reading between the lines based on what we know of the original comics. The easiest connection to draw comes from the character of Agent 355 (played by Ashley Romans), a member of a clandestine American military group assigned to protect Yorick, and we see 355 kick butt and activate explosives on Yorick&#39;s behalf. We also see a hint of rival factions among the surviving women, though the trailer doesn&#39;t clarify whether they&#39;re a one-for-one match for the apocalyptic Daughters of the Amazon. There are also brief flashes of original series characters like Dr. Allison Mann (played by Diana Bang) and Yorick&#39;s sister Hero Brown (played by Olivia Thirlby).\n A possible live-action take of  Y: The Last Man has bounced around for over a decade; developments included a feature-length movie that never moved into production, a 2018 TV pilot that was scrapped,  a change of showrunners, and  a recasting of the lead role of Yorick. It&#39;s unclear whether its exclusive home on Hulu will be a boon for the series, though we&#39;re hopeful that the plot&#39;s emphasis on a predominately female cast (and FX&#39;s insistence that  the whole first season is directed by women) will offer a breath of fresh air on TV screens starting September 13.", "posttime": "2021-08-06 03:57:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,首映,tv,预告片", "title": "Y：The Last Man 电视剧在 9 月 13 日 Hulu 发布前获得首映预告片", "title_en": "Y: The Last Man TV series gets premiere trailer ahead of Sept. 13 Hulu launch", "transed": 1, "url": "https://arstechnica.com/gaming/2021/08/y-the-last-man-tv-series-gets-premiere-trailer-ahead-of-sept-13-hulu-launch/", "via": "", "real_tags": ["发布", "首映", "tv", "预告片"]}, {"category": "", "categoryclass": "", "imagename": "3e682fe6194f1eae8c0537626031c0a2.jpg", "infoid": 1071616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软联合创始人比尔·盖茨承认，他在与性犯罪者和名誉扫地的金融家杰弗里·爱泼斯坦共度时光时犯了“一个巨大的错误”。盖茨先生告诉美国有线电视新闻网，他有“几次晚餐”关于一个没有出现的慈善项目，不应该给他“可信度”。盖茨先生还与梅琳达·弗兰奇·盖茨讨论了他的离婚问题，称其为“个人巨大悲伤的根源”。这位 65 岁的老人于去年 3 月宣布退出微软董事会，他说他和他的前妻“将尝试并继续”在比尔和梅琳达盖茨基金会合作。盖茨先生还被问及他是否对工作场所不当行为的指控感到遗憾——一些微软员工指责他欺凌。他没有具体回应，他说：“当然每个人都[有遗憾]，但现在是反思的时候，在这一点上，我需要继续前进。”盖茨先生的代表此前淡化了他与爱泼斯坦的关系，称没有商业伙伴关系或个人友谊。\n他在 CNN 采访中回应了这一点，说：“你知道，我和他共进过几次晚餐，希望他所说的通过他的接触为全球健康筹集数十亿美元的慈善事业可能会出现。他没有给出任何时间表。会议，尽管美国媒体称它们是在 2011 年至 2014 年之间。那是在爱泼斯坦于 2019 年因联邦指控对未成年人进行性交易而被捕之前，但在他于 2008 年因其他性犯罪被定罪后被判入狱。盖茨先生说：“花时间和他在一起是一个巨大的错误，让他有在那里的可信度。” 美国媒体称梅琳达·弗兰奇·盖茨对他与爱泼斯坦的关系感到愤怒，并希望结束这种关系。说到他的前妻。 ，比尔盖茨说她是“一个伟大的人，我们即将结束的伙伴关系是一个巨大的个人悲伤的根源”。不久之后，有消息称微软正在调查盖茨先生“试图发起一项投诉”。亲密的2000 年与一名女性员工的关系。调查在盖茨先生离开董事会后结束，但微软表示两人没有联系。\n一些前雇员还指责盖茨先生脾气暴躁，口号是“这是我听过的最愚蠢的（咒骂）想法”。前董事会成员玛丽亚·克劳（Maria Klawe）曾说过“像比尔·盖茨这样的人认为通常的行为规则不适用于他”。盖茨先生在接受 CNN 采访时说：“我的工作对我来说非常重要。在家庭中，我们会尽我们所能治愈并从发生的事情中吸取教训。”", "note_en": "Microsoft co-founder Bill Gates has admitted he made &#34;a huge mistake&#34; in spending time with sex offender and disgraced financier Jeffrey Epstein.\n Mr Gates told CNN he had &#34;several dinners&#34; about a philanthropy project that did not emerge, and should not have given him &#34;credibility&#34;.\n  Mr Gates also discussed his divorce with Melinda French Gates, calling it &#34;a source of great personal sadness&#34;.\n  The 65-year-old, who announced in March last year he was stepping down from the Microsoft board, said he and his ex-wife were &#34;going to try and continue&#34; working together on the Bill &amp; Melinda Gates Foundation.\n Mr Gates was also asked whether he had regrets following allegations of workplace misbehaviour - some Microsoft employees have accused him of bullying.\n He did not respond specifically, saying: &#34;Certainly everyone does [have regrets] but it&#39;s a time of reflection, and at this point, I need to go forward.&#34;\n  Mr Gates&#39;s representatives have previously played down his relationship with Epstein, saying there was no business partnership or personal friendship.\n He echoed that in the CNN interview, saying: &#34;I had several dinners with him, you know, hoping that what he said about getting billions of philanthropy for global health through contacts that he had might emerge.\n   He did not give any timeframe for the meetings, although US media have said they were between 2011 and 2014.\n That was before Epstein&#39;s arrest in 2019 on federal charges of sex-trafficking of minors, but after he had served a jail sentence following conviction in 2008 for other sex offences.\n Mr Gates said: &#34;It was a huge mistake to spend time with him, to give him the credibility of being there.&#34;\n US media have said Melinda French Gates was furious at his relationship with Epstein and wanted it to end.\n Speaking of his ex-wife, Bill Gates said she was &#34;a great person, and that partnership that we had coming to an end is a source of great personal sadness&#34;.\n  Shortly afterwards, it emerged that Microsoft was investigating a complaint that Mr Gates had &#34;sought to initiate an intimate relationship&#34; with a female employee in 2000. The investigation ended after Mr Gates left the board, but Microsoft said the two were not linked.\n Some former employees have also accused Mr Gates of having a hot temper, with the catchphrase &#34;that&#39;s the stupidest {expletive] idea I&#39;ve ever heard&#34;.\n Former board member Maria Klawe had said &#34;a person like Bill Gates thinks the usual rules of behaviour don&#39;t apply to him&#34;.\n  Mr Gates said in his CNN interview: &#34;My work is very important to me. Within the family, we&#39;ll heal as best we can and learn from what&#39;s happened.&#34;", "posttime": "2021-08-06 03:57:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "会议,meetings,先生", "title": "比尔盖茨说爱泼斯坦会议犯了一个巨大的错误", "title_en": "Epstein meetings a huge mistake, says Bill Gates", "transed": 1, "url": "https://www.bbc.com/news/world-us-canada-58099778.amp", "via": "", "real_tags": ["会议", "meetings", "先生"]}, {"category": "", "categoryclass": "", "imagename": "dbb334b62f5ba8dde63dbe111f59aca4.png", "infoid": 1071615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Quora 表示，它“有望从广告中获得正现金流”，这意味着该平台目前并未处于亏损状态。但 Quora 将利用创作者经济和订阅作为盈利的一种方式。 “我们希望让创作者在财务上更可持续地共享知识，”Quora 首席执行官 Adam D&#39;Angelo 在一篇博客文章中写道。 “尽管许多人有动力并且能够花时间在 Quora 上写作只是为了分享他们的知识，但许多其他人也可以在有经济理由的情况下分享更多。” Quora 的第一个新产品是 Quora+——订阅者将支付 5 美元的月费或 50 美元的年费来访问任何创作者选择放在付费墙后面的内容。这些与没有广告的 Medium 为其会员计划收取的费用相同。订阅者将支付 Quora，而不是支付选定的创作者。然后，每个订阅者的付款将“按每个订阅者消费其内容的数量成比例分配给创作者，订阅者的更多贡献将分配给订阅者关注的作家和空间。”创作者可以选择在 Quora+ 内容上启用动态付费专区，如果 Quora 认为他们可能会转换为付费会员，则可以让免费用户访问某些帖子；还有一个“自适应”付费专区选项，它使用一种算法来决定是否根据具体情况为特定用户付费专区内容。这应该可以帮助创作者在通过内容货币化和扩大观众以寻找新的潜在订阅者之间取得平衡。 Quora 告诉 TechCrunch，它仍在试验 Quora+，还不能说它将从订阅中获得多少百分比。另一种选择是让创作者在 Spaces 上写付费帖子，就像用户在 Quora 上创建的出版物一样。 Quora 将收取订阅费的 5%，创作者可以自行选择——相比之下，直接面向消费者的博客平台 Substack 收取作者利润的 10%，这使得 Quora 成为具有竞争力的替代方案。 Ghost 等其他平台每月收取 9 美元的费用，但让作家保留他们的收入——对于每月至少赚 180 美元的作家来说，Ghost 会比 Quora 更有利可图。 D&#39;Angelo 写道：“我们能够可持续地承诺只收取最低限度的费用，而无需在未来增加费用，因为我们从广告中获得了足够的收入来资助该平台的大部分开发和运营。”与此同时，Substack 没有广告。\nQuora 在筹集了 8500 万美元后，在 2017 年达到了 18 亿美元的估值，当时该平台拥有 1.9 亿月用户。现在，根据 D&#39;Angelo 的博客文章，每月有超过 3 亿人使用 Quora。尽管用户有所增长，但 Quora 于 2020 年 1 月在其湾区和纽约市办公室裁员，人数不详。今天将为包括美国在内的 25 个国家/地区的英语用户推出空间订阅服务 Quora+ 的推出不会那么直接因为 Quora 邀请精选作家测试平台并确定最适合订阅者和创作者的内容。", "note_en": "Quora says it’s “on track to be cash flow positive from ads alone,” implying that the platform isn’t currently in the black. But Quora sees tapping into the creator economy and subscriptions as a way to turn a profit.\n “We want to make sharing knowledge more financially sustainable for creators,” Quora CEO Adam D’Angelo wrote in  a blog post. “Even though many people are motivated and able to spend their time writing on Quora just to share their knowledge, many others could share much more with financial justification to do so.”\n Quora’s first new product is Quora+ — subscribers will pay a  $5 monthly fee or a $50 yearly fee  to access content that any creator chooses to put behind a paywall. These are the same rates that Medium, which has  no ads, charges for its  membership program.\n Rather than paying select creators, subscribers will pay Quora. Then, each subscriber’s payment will be distributed to creators “in proportion to the amount each subscriber is consuming their content, with more of a subscriber’s contribution going to writers and spaces the subscriber follows.” Creators have the option to enable a  dynamic paywall on Quora+ content, which would give free users access to certain posts if Quora thinks they’re likely to convert to paid membership; there’s also an “ adaptive” paywall option, which uses an algorithm to decide whether to paywall content for a specific user on a case-by-case basis. This is supposed to help creators strike a balance between monetizing their content and growing their audience to find new potential subscribers.\n Quora told TechCrunch that it is still experimenting with Quora+ and can’t yet say what percentage it will take from subscriptions.\n The other option is for creators to write paywalled posts on  Spaces, which are like user-created publications on Quora. Quora will take 5% of the subscription fee, which the creator can choose at their own discretion — comparatively, the direct-to-consumer blogging platform Substack takes  10% of writers’ profits, which makes Quora a competitive alternative. Other platforms like  Ghost ask for a $9 monthly fee, but let writers retain their revenue — for writers making at least $180 per month, Ghost would be more profitable than Quora.\n  “We’re able to sustainably commit to taking only a minimal fee without needing to increase it in the future because we make enough revenue from ads to fund most of the platform’s development and operations,” D’Angelo wrote. Substack, meanwhile, doesn’t have ads.\n Quora reached a  $1.8 billion valuation in 2017 after raising $85 million, and at the time, the platform had 190 million monthly users. Now, according to D’Angelo’s blog post, over 300 million people use Quora each month. Despite this user growth, Quora  laid off an undisclosed amount of staff in its Bay Area and New York City offices in January 2020.\n Space subscriptions will launch today for English language users in  25 countries, including the U.S. The rollout of Quora+ will be less immediate as Quora invites select writers to test the platform and determine what works best for subscribers and creators.", "posttime": "2021-08-06 03:57:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "现在,monetize,quora", "title": "创作者现在可以通过 Quora 上的专业知识获利", "title_en": "\n\t\t\t\tCreators can now monetize their expertise on Quora\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/05/creators-can-now-monetize-their-expertise-on-quora/", "via": "", "real_tags": ["现在", "monetize", "quora"]}, {"category": "", "categoryclass": "", "imagename": "e08dbebe284498fed04010aab8c5897f.jpg", "infoid": 1071614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ripple Ventures 的创始人兼管理合伙人马特·科恩 (Matt Cohen) 是一名业务运营商，后来成为早期投资者。在创立 about.me 和 Sphere（均被 AOL 收购）之后，Tony 将创始人和初创公司的领导专业知识带入了他在 True 的合伙人角色中。这并不是说风投带来的价值减少了。如果有的话，情况恰恰相反——这种新的动态迫使创始人对坐在他们导师桌旁的究竟是谁非常挑剔。要在早期阶段从经验丰富的投资者那里获得最大价值，根本不可能建立大量深厚而有意义的关系。创始人绝对应该以极高的估值进行大轮融资，但重要的是他们要认识到管理允许进入导师圈的人是多么重要。最初，创始人应该确保他们的第一层由真正的“实干家”组成——通常是天使和早期风险投资者，创始人每周（或更频繁）会面以帮助解决一些最细微的问题。从招聘到运营障碍，一直到更深层次、更个人化的挑战，例如在家庭生活与快速发展的初创公司之间取得平衡。这个圈子是真正的指导发生的地方，创始人可以是开放和脆弱的。出于显而易见的原因，这个圈子必须很小，通常最多由两到六个人组成。任何更简单的事情都会变得笨拙，让创始人花费更多的时间来管理这些关系，而不是实际建立他们的公司。第二层应该由投资者的“季度人群”组成。这些人不一定是不感兴趣或不愿意参与运营公司的本质的人，但这个圈子往往由每年进行数十次投资的风投组成。他们和他们的创始人一样，无法每周管理 50 次关系，因此他们在公司问题上的接触点往往移动得更慢或更不频繁。", "note_en": "Founder and managing partner at  Ripple Ventures, Matt Cohen is a business operator turned early-stage investor.\n Having founded  about.me and Sphere (both acquired by AOL), Tony brings founder and startup leadership expertise to his partner role at  True.\n  This isn’t to say that the value VCs bring has diminished. If anything, it’s quite the opposite — this new dynamic is forcing founders to be extremely selective about exactly who is sitting around their mentorship table. It’s simply not possible to have numerous deep and meaningful relationships to extract maximum value at the early stage from seasoned investors.\n Founders should definitely pursue big rounds at sky-high valuations, but it’s important that they recognize how important it is to manage who they allow into their mentorship circles. Initially, founders should make sure their first layer consists of the real “doers” — usually angels and early venture investors who founders meet with weekly (or more frequently) to help solve some of the most granular problems.\n Everything from hiring to operational hurdles all the way to deeper, more personal challenges like balancing family life with a rapidly growing startup.\n This circle is where the real mentorship happens, where founders can be open and vulnerable. For obvious reasons, this circle has to be small, and usually consist of two to six people at most. Anything more simply becomes unwieldy and leaves founders spending more time managing these relationships than actually building their company.\n  The second layer should consist of the “quarterly crowd” of investors. These aren’t necessarily people who are uninterested or unwilling to participate in the nitty gritty of running the company, but this circle tends to consist of VCs who make dozens of investments per year. They, like their founders, aren’t capable of managing 50 relationships on a weekly basis, so their touch points on company issues tend to move slower or less frequently.", "posttime": "2021-08-06 03:56:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,投资者,learn,创始人", "title": "创始人必须学会如何与投资者建立和维持信任圈", "title_en": "\n\t\t\t\tFounders must learn how to build and maintain circles of trust with investors\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/05/founders-must-learn-how-to-build-and-maintain-circles-of-trust-with-investors/", "via": "", "real_tags": ["rust", "投资者", "learn", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "feced9be697d5c029475c240b1aa4cd5.jpg", "infoid": 1071613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 告诉 TechCrunch，检测儿童性虐待材料 (CSAM) 是旨在更好地保护使用其服务的儿童免受在线伤害的几项新功能之一，包括过滤器以阻止通过儿童的 iMessage 帐户发送和接收的潜在色情照片.当用户尝试通过 Siri 和搜索搜索与 CSAM 相关的术语时，另一个功能将进行干预。大多数云服务——Dropbox、谷歌和微软等——已经扫描了用户文件中可能违反其服务条款或潜在非法的内容，如 CSAM。但苹果长期以来一直拒绝扫描用户在云中的文件，让用户可以选择在数据到达苹果的 iCloud 服务器之前对其进行加密。苹果表示，其新的 CSAM 检测技术——NeuralHash——而是在用户设备上运行，并且可以识别用户是否将已知的虐待儿童图像上传到 iCloud，而无需解密图像，直到达到阈值并通过一系列检查来验证内容被清除.周三，当约翰霍普金斯大学的密码学教授马修格林在一系列推文中透露了新技术的存在时，苹果公司的努力的消息泄露了。这一消息遭到了一些安全专家和隐私倡导者的抵制，但也遭到了习惯了苹果公司大多数其他公司所没有的安全和隐私方法的用户的抵制。 Apple 正试图通过多层加密保护隐私来平息恐惧，这种加密方式需要多个步骤才能进入 Apple 的最终人工审核。 NeuralHash 将登陆 iOS 15 和 macOS Monterey，预计在未来一两个月内发布，它的工作原理是将用户 iPhone 或 Mac 上的照片转换为唯一的字母和数字字符串，称为哈希。任何时候你稍微修改一个图像，它都会改变哈希并阻止匹配。 Apple 表示，NeuralHash 试图确保相同且视觉上相似的图像——例如裁剪或编辑过的图像——产生相同的哈希值。在将图像上传到 iCloud 照片之前，这些哈希值会在设备上与已知的虐待儿童图像哈希值数据库进行匹配，该数据库由国家失踪与受虐儿童中心 (NCMEC) 等儿童保护组织提供。 NeuralHash 使用一种称为私有集合交集的加密技术来检测哈希匹配，而不会透露图像是什么或提醒用户。\n结果会上传到 Apple，但无法自行读取。 Apple 使用另一种称为阈值秘密共享的加密原理，仅当用户超过其 iCloud 照片中已知的虐待儿童图像阈值时，它才允许解密内容。 Apple 不会说这个阈值是什么，但说——例如——如果一个秘密被分成一千个片段，并且阈值是十张虐待儿童内容的图像，那么可以从这十张图像中的任何一张重建秘密。那时，Apple 可以解密匹配的图像、手动验证内容、禁用用户帐户并将图像报告给 NCMEC，然后将其传递给执法部门。 Apple 表示，此过程比扫描云中的文件更加注重隐私，因为 NeuralHash 仅搜索已知而非新的虐待儿童图像。苹果公司表示，误报的可能性为万亿分之一，但如果帐户被错误标记，则有一个上诉程序。 Apple 已在其网站上发布了有关 NeuralHash 工作原理的技术细节，这些细节已经过密码学专家的审查。但是，尽管打击儿童性虐待的努力得到了广泛支持，但仍有一部分监视内容让许多人在将其交给算法时会感到不舒服，一些安全专家呼吁在 Apple 向用户推出该技术之前进行更多的公开讨论。一个大问题是为什么现在而不是更早。苹果表示，其隐私保护 CSAM 检测直到现在才存在。但苹果等公司也面临着来自美国政府及其盟友的巨大压力，要求其削弱或后门用于保护用户数据的加密，以允许执法部门调查严重犯罪。科技巨头拒绝为他们的系统设置后门程序，但在进一步阻止政府访问的努力中面临阻力。尽管存储在 iCloud 中的数据以一种连苹果都无法访问的方式进行加密，但路透社去年报道称，在 FBI 抱怨这会损害调查后，苹果放弃了将用户的完整手机备份加密到 iCloud 的计划。未经公开讨论的有关 Apple 新 CSAM 检测工具的消息也引发了人们的担忧，即该技术可能会被滥用，向受害者发送虐待儿童图像，这可能导致他们的帐户被标记和关闭，但 Apple 淡化了这些担忧并表示进行人工审查将审查可能滥用的证据。\n苹果表示，NeuralHash 将首先在美国推出，但没有透露是否或何时在国际上推出。直到最近，在这种做法被无意中禁止后，像 Facebook 这样的公司被迫在整个集团关闭其虐待儿童检测工具。 Apple 表示，该功能在技术上是可选的，因为您不必使用 iCloud 照片，但如果用户使用，则将是必需的。毕竟，您的设备属于您，但 Apple 的云不属于您。", "note_en": "Apple told TechCrunch that the detection of child sexual abuse material (CSAM) is one of several new features aimed at better protecting the children who use its services from online harm, including filters to block potentially sexually explicit photos sent and received through a child’s iMessage account. Another feature will intervene when a user tries to search for CSAM-related terms through Siri and Search.\n Most cloud services — Dropbox, Google, and Microsoft to name a few — already scan user files for content that might violate their terms of service or be potentially illegal, like CSAM. But Apple has long resisted scanning users’ files in the cloud by giving users the option to encrypt their data before it ever reaches Apple’s iCloud servers.\n Apple said its new CSAM detection technology — NeuralHash — instead works on a user’s device, and can identify if a user uploads known child abuse imagery to iCloud without decrypting the images until a threshold is met and a sequence of checks to verify the content are cleared.\n News of Apple’s effort leaked Wednesday when Matthew Green, a cryptography professor at Johns Hopkins University, revealed the existence of the new technology in  a series of tweets. The news was met with some resistance from some security experts and privacy advocates, but also users who are accustomed to Apple’s approach to security and privacy that most other companies don’t have.\n Apple is trying to calm fears by baking in privacy through multiple layers of encryption, fashioned in a way that requires multiple steps before it ever makes it into the hands of Apple’s final manual review.\n NeuralHash will  land in iOS 15 and  macOS Monterey, slated to be released in the next month or two, and works by converting the photos on a user’s iPhone or Mac into a unique string of letters and numbers, known as a hash. Any time you modify an image slightly, it changes the hash and can prevent matching. Apple says NeuralHash tries to ensure that identical and visually similar images — such as cropped or edited images — result in the same hash.\n Before an image is uploaded to iCloud Photos, those hashes are matched on the device against a database of known hashes of child abuse imagery, provided by child protection organizations like the National Center for Missing &amp; Exploited Children (NCMEC) and others. NeuralHash uses a cryptographic technique called private set intersection to detect a hash match without revealing what the image is or alerting the user.\n The results are uploaded to Apple but cannot be read on their own. Apple uses another cryptographic principle called threshold secret sharing that allows it only to decrypt the contents if a user crosses a threshold of known child abuse imagery in their iCloud Photos. Apple would not say what that threshold was, but said — for example — that if a secret is split into a thousand pieces and the threshold is ten images of child abuse content, the secret can be reconstructed from any of those ten images.\n  It’s at that point Apple can decrypt the matching images, manually verify the contents, disable a user’s account and report the imagery to NCMEC, which is then passed to law enforcement. Apple says this process is more privacy mindful than scanning files in the cloud as NeuralHash only searches for known and not new child abuse imagery. Apple said that there is a one in one trillion chance of a false positive, but there is an appeals process in place in the event an account is mistakenly flagged.\n Apple has  published technical details on its  website about how NeuralHash works, which was reviewed by cryptography experts.\n But despite the wide support of efforts to combat child sexual abuse, there is still a component of surveillance that many would feel uncomfortable handing over to an algorithm, and  some security experts are calling for more public discussion before Apple rolls the technology out to users.\n A big question is why now and not sooner. Apple said its privacy-preserving CSAM detection did not exist until now. But companies like Apple have also faced considerable pressure from the U.S. government and its allies  to weaken or backdoor the encryption used to protect their users’ data to allow law enforcement to investigate serious crime.\n Tech giants have refused efforts to backdoor their systems, but have faced resistance against efforts to further shut out government access. Although data stored in iCloud is encrypted in a way that even Apple cannot access it, Reuters reported  last year that Apple dropped a plan for encrypting users’ full phone backups to iCloud after the FBI complained that it would harm investigations.\n The news about Apple’s new CSAM detection tool, without public discussion, also sparked concerns that the technology could be abused to flood victims with child abuse imagery that could result in their account getting flagged and shuttered, but Apple downplayed the concerns and said a manual review would review the evidence for possible misuse.\n Apple said NeuralHash will roll out in the U.S. at first, but would not say if, or when, it would be rolled out internationally. Until recently, companies like Facebook were forced to  switch off its child abuse detection tools across the bloc after the practice was inadvertently banned. Apple said the feature is technically optional in that you don’t have to use iCloud Photos, but will be a requirement if users do. After all, your device belongs to you but Apple’s cloud does not.", "posttime": "2021-08-06 03:45:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,ios,苹果,apple,表示", "title": "苹果表示，在接下来的几个月内，它将开始在美国的 iOS 15 和 macOS Monterey 设备上扫描照片，以查找已知的虐待儿童图像", "title_en": "Apple says in the next couple of months it will begin scanning photos on iOS 15 and macOS Monterey devices in the US for known child abuse images", "transed": 1, "url": "https://techcrunch.com/2021/08/05/apple-icloud-photos-scanning/", "via": "", "real_tags": ["美国", "ios", "苹果", "apple", "表示"]}]