[{"category": "", "categoryclass": "", "imagename": "5884b56c072b4afa44ecaa0b568fbd97.jpg", "infoid": 1002547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "*如果您希望在我们的新闻文章中报告语法或事实错误，您可以使用在线反馈表格让我们知道。\n印度新闻机构周五早上报道，该国空军的米格-29战斗机在旁遮普省霍希亚尔普尔区附近坠毁。据当地媒体报道，飞机坠落在该地区的Chuharpur村…。\n武器制造商洛克希德·马丁公司(Lockheed Martin Corp.)自豪地宣布，自该系统在美国空军服役以来，其自动地面碰撞避免系统(GCAS)帮助拯救了10名飞行员和9架F-16战斗机的生命。\n据报道，一架载有冠状病毒患者医疗用品的乌克兰货机周四(2020年4月16日)降落在波兰弗罗茨瓦夫，以帮助该国抗击冠状病毒。这是波兰武装部队执行的第二项任务.。\n国防高级研究计划局(DARPA)正在致力于一项名为空战进化(ACE)的计划，以使自动斗狗成为现实。五角大楼的研究集中在空对空作战的自动化，这将解放飞行员专注于.。\n据加布里埃尔·阿尔贝托·巴佐洛(Gabriel Alberto Bazzolo)称，由Rafael和IMOD联合开发的Firefly只有3公斤重，为下马士兵提供幕后精确攻击能力。为以色列国防军(以色列国防军)地面部队订购的萤火虫，在.", "note_en": "* If you wish to report grammatical or factual errors within our news articles, you can let us know by using the  online feedback form.\n Indian news agencies reported on Friday morning that the country&#39;s Air Force MiG-29 fighter jet crashes near Hoshiarpur district in Punjab. According to local media, the aircraft fell to the ground in the Chuharpur village of the district...\n Weapons maker Lockheed Martin Corp. takes pride in announcing that its Automatic Ground Collision Avoidance System, or GCAS, helped save the life of 10 pilots and nine F-16 fighter jets—since the system entered service with the U.S. Air Force...\n A Ukrainian cargo plane reportedly carrying medical supplies for coronavirus patients landed in Wroclaw, Poland on Thursday (16 April 2020) to help the country’s fight against COVID-19. This is the second mission that the Polish Armed Forces have...\n DARPA, the Defense Advanced Research Projects Agency, is working on a program called Air Combat Evolution (ACE) to make automated dogfighting a reality. The Pentagon’s research focused to automate air-to-air combat, which would free pilots to concentrate on...\n Jointly developed by Rafael and the IMOD, FireFly weighs only 3 kg and provides Behind-Cover Precision Attack Capabilities for the Dismounted Soldier, according to Gabriel Alberto Bazzolo. Ordered for the IDF (Israel Defense Forces) ground forces, FireFly, known in...", "posttime": "2020-05-18 01:10:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "世界末日,plane,新闻", "title": "美国“世界末日飞机”起飞锻炼", "title_en": "U.S. ‘doomsday plane’ takeoff for exercise", "transed": 1, "url": "https://defence-blog.com/news/u-s-doomsday-plane-takeoff-for-exercise.html", "via": "", "real_tags": ["世界末日", "plane", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《今日世界商业百科全书》第一版世界地理百科全书-5卷集世界历史百科全书7卷集档案百科全书第1-5卷数学科学百科全书凝聚态物理百科全书物理研究百科全书第一卷集事实集数学物理百科全书第1-5卷数学科学百科全书凝聚态物理百科全书第一卷世界历史百科全书第七卷数学物理百科全书第1-5卷数学科学百科全书凝聚态物理百科全书第一卷世界历史百科全书第七卷数学物理百科全书第1-5卷数学科学百科全书凝聚态物理百科全书", "note_en": "SAGE Publications Encyclopedia of Business in Today&#39;s World The Encyclopedia of Political Science Set - 1st Edition Encyclopedia of World Geography Encyclopedia of Geology - 5 Volume Set Encyclopedia of World History 7 Volumes Set Facts on File Encyclopedia of Mathematical Physics Vol 1-5 Encyclopedia of Mathematics Science Encyclopedia of Condensed Matter Physics Encyclopedia of Physics Research Encyclopedia of Nonlinear Science Rourke&#39;s World of Science Encyclopedia - Vol 1-10", "posttime": "2020-05-18 01:09:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,dataset,百科全书", "title": "冠状病毒数据集构建器", "title_en": "Covid-19 Dataset Builder", "transed": 1, "url": "https://vectorspace.ai/covid19.html", "via": "", "real_tags": ["冠状病毒", "病毒", "dataset", "百科全书"]}, {"category": "", "categoryclass": "", "imagename": "0b4962c9b9430427c503a59fbf1bdbb3.png", "infoid": 1002545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我1983年论文的这个新的长版提出了您的系统可能有的目标-简单、及时、高效、适应性、可靠、美味(稳定)-以及实现这些目标的有效技术-近似、增量、分而治之(AID)。它给出了一些不仅仅是提示的系统设计原则，以及如何应用这些提示和原则的许多示例。", "note_en": "This new long version of my 1983 paper suggests the goals you might have for your system—Simple, Timely, Efficient, Adaptable, Dependable, Yummy (STEADY)—and effective tech-niques for achieving them—Approximate, Incremental, Divide & Conquer (AID). It gives a few principles for system design that are more than just hints, and many examples of how to apply the hints and principles.", "posttime": "2020-05-18 01:09:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,principles,系统", "title": "计算机系统设计的提示和原则", "title_en": "Hints and Principles for Computer System Design", "transed": 1, "url": "https://www.microsoft.com/en-us/research/publication/hints-and-principles-for-computer-system-design-3/", "via": "", "real_tags": ["设计", "系统"]}, {"category": "", "categoryclass": "", "imagename": "21a719febb7913361f7ef4732d509b29.jpg", "infoid": 1002544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大西洋飓风季节的第一个命名风暴于周六深夜在佛罗里达东海岸附近形成，当时持续风速达到每小时40英里。\n名为热带风暴亚瑟的系统应该会在未来几天向东北偏北移动。尽管这项运动有相当大的不确定性，亚瑟应该会靠近，或者就在热带风暴警告已经发出的北卡罗来纳州沿海上空。在此之后，亚瑟可能会适当地向东弯曲，远离美国大陆，出海。\n由于低风切变和中等温暖的海水，亚瑟可能仍然是热带风暴，甚至在本周晚些时候屈服于较凉爽的海水之前略有增强。国家飓风中心预测，周一系统的最大持续风速将达到每小时50英里。\n大西洋飓风季节从现在起两周后，即6月1日正式开始，一直持续到11月30日。从历史上看，热带或副热带风暴在6月1日之前形成并以每小时40英里的持续风速命名并不是什么罕见的事情。这种情况平均大约每两到三年发生一次。\n然而，这已经是6月1日之前连续第六年出现命名风暴。根据迈阿密大学飓风科学家布莱恩·麦克诺尔迪(Brian McNoldy)汇编的数据，第一次命名风暴的平均日期正在稳步提前。1970年，它通常在7月初到来，但现在第一次风暴的平均日期大约提前了一个月。飓风社区一直在讨论将大西洋季节的开始提前到5月15日，以配合东太平洋飓风季节的开始。\n较早的日期似乎有两个原因。飓风科学家现在可以更多地获得大西洋上空的卫星和其他观测数据，因此更倾向于发现风暴并为其命名。另一个重要因素是近几十年来由于气候变化导致的海洋表面温度变暖，从而允许更早的发展。\n总体而言，季节性飓风预报员预测，2020年大西洋季节将相当繁忙，海洋变暖，拉尼娜(La Niña)可能弱至中度，这往往会增加大西洋的活动。因此，虽然亚瑟是2020年第一个命名的风暴，但它将远远不是最后一个。", "note_en": "The Atlantic hurricane season&#39;s first named storm formed late Saturday night off the eastern coast of Florida, when its sustained winds reached 40mph.\n Named Tropical Storm Arthur, the system  should move north-northeast for the next couple of days. Although there is a fair amount of uncertainty about this motion, Arthur should come near, or just over coastal North Carolina, where Tropical Storm Warnings have been raised. After this Arthur is likely to bend due eastward, away from the mainland United States and out to sea.\n Because of low wind shear and moderately warm waters, Arthur may remain a tropical storm and even strengthen a little before succumbing to cooler waters later this week. The National Hurricane Center  forecasts the system to reach maximum sustained winds of 50mph on Monday.\n  The Atlantic hurricane season officially begins two weeks from now, on June 1, and runs through November 30. Historically, it is not all that unusual for a tropical or subtropical storm to form before June 1 and become named after reaching sustained winds of 40mph. This happens, on average, about every two to three years.\n However, this is now the sixth year in a row that a named storm has developed prior to the June 1 date. And  according to data compiled by University of Miami hurricane scientist Brian McNoldy, the average date of the first named storm is steadily moving earlier. In 1970, it typically came in early July, but now the average date of the first storm is about one month earlier. There has been some discussion in the hurricane community about moving the start of the Atlantic season up to May 15th, to match the beginning of the Eastern Pacific hurricane season.\n  The reasons for the earlier date appear to be two-fold. Hurricane scientists now have more access to satellite and other observational data over the Atlantic Ocean, and so are more inclined to find and name storms. Another significant factor is the warming of sea surface temperatures in recent decades due to climate change, allowing for earlier development.\n Overall, seasonal hurricane forecasters  have predicted that the 2020 Atlantic season will be a rather busy one, with warmer oceans and what may be a weak to moderate La Niña, which tends to increase Atlantic activity. So while Arthur is the first named storm of 2020, it will be far from the last.", "posttime": "2020-05-18 00:54:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风暴,year,飓风", "title": "连续第六年，一场名为“风暴”的大西洋风暴提早形成。", "title_en": "For the sixth year in a row, an Atlantic named storm forms early", "transed": 1, "url": "https://arstechnica.com/science/2020/05/for-the-sixth-year-in-a-row-an-atlantic-named-storm-forms-early/", "via": "", "real_tags": ["风暴", "year", "飓风"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本教程展示了如何构建一个简单的Goey应用程序，并介绍了一个对Goey应用程序有用的反应式架构。需要明确的是，该体系结构并不是完全被动的，但确实使用了单向数据流，从而简化了GUI应用程序的编写。对于此体系结构，有4个必需的功能。\n关于GUI，主要功能有一个职责，那就是启动GUI的事件循环。事件循环在所支持的本机GUIAPI中是常见的，但显然细节有所不同。包循环负责抽象这些差异。对于我们的简单程序，只需要该包中的一个函数loop.Run。此函数将初始化事件循环，并保持该循环运行，直到没有更多的顶级窗口。\n在事件循环开始之前，需要创建顶级窗口，但这会使问题复杂化。不同平台的细节有所不同，但是没有一个主要的桌面GUI API是线程安全的。这意味着任何GUI对象(如Windows)都应该在与事件循环相同的操作系统线程上创建。循环不是让调用者来协调线程，而是采用回调来处理GUI的初始化。\n如果错误处理得当，上面列出的两个要求将导致函数main的以下定义。\nfunc main(){err：=循环。如果err！=nil{fmt，则运行(CreateWindow)。Fprintf(操作系统。标准，&#34；错误：%s\\n&#34；，错误)操作系统。退出(1)}}。\n虽然窗口中的布局和控件使用声明性方法，但必须创建顶级窗口。窗口是使用goey.NewWindow创建的，并且可以使用方法更新属性。对于这个简单的示例，只需要设置窗口上的两个属性，它们是在创建窗口时设置的。这意味着单个调用足以创建和初始化窗口。\n第二个参数设置窗口的内容。我们可以在这里提供必要的数据，但程序还需要在其他地方生成(并重新生成)窗口的内容。为避免重复，该代码位于main.ender中。\n还有另一个重要的细节。该函数将*goey.Window复制到全局变量中。全局状态通常不好，但main.mainWindow的值在初始化后不会更改。当我们对事件做出反应时，需要此值来更新窗口的内容。\n函数createWindow()错误{mw，err：=goey。NewWindow(&#34；one Button&#34；，Render())if err！=nil{return err}mainWindow=mw return nil}。\n这是一个小帮助器函数，它使用main.ender重新计算窗口的内容，然后更新窗口的内容。请注意，对SetChild的调用是Goey魔力发生的地方，也是Goey具有声明性的原因。软件包将协调数据定义的内容和依赖于平台的控件之间的任何差异，以便窗口的内容匹配。调用方不需要添加、修改或删除任何控件。\nfunc updateWindow(){err：=mainWindow。如果err！=nil{fmt，则SetChild(Render())。Fprintf(操作系统。标准，&#34；错误：%s\\n&#34；，Err)}}。\n请注意，此函数只能在同时运行GUI事件循环的线程上调用。否则，将并发访问GUI API，这可能会导致崩溃。如果需要从任意Goroutine调用此函数，请使用loop.Do。\n此函数返回定义顶级窗口所需布局和内容的数据结构。理想情况下，所有影响内容的状态都将作为参数传递，但在这个简单的示例中，状态的一小部分存储在全局变量clickCount中。\n根据clickCount的值，按钮的标签将会更改。否则，布局和内容是静态的。这里不会详细介绍布局，只是说布局依赖于简单的、可组合的小部件。请查看Goey包中可用的小部件，以了解可用的布局选项。\nGUI定义的声明性质不仅包括外观，还包括事件的回调。在本例中，请注意该按钮有一个名为onClick的事件。在这种情况下，事件处理程序是使用函数文字内联定义的。作为对事件的响应，程序可以更新其状态，但请注意，它不会直接修改任何控件。相反，我们调用updateWindow。这将再次调用Render以确定当前布局和内容。\n函数Render()base。小组件{text：=&#34；单击我！&#34；如果单击Count&gt；0{text=text+&#34；(&#34；+strconv.。Itoa(ClickCount)+&#34；)&#34；}退货&amp；goey。填充{插图：Goey。DefaultInsets()，Child：&amp；Goey。Align{Child：&amp；Goey。按钮{text：text，onclick：func(){clickCount++updateWindow()}}，}，}}\n事件的回调在与GUI事件循环相同的OS线程上执行。因此，在回调中创建新窗口和修改这些窗口是安全的。相反，长时间运行的代码会导致GUI冻结，因此任何可能需要相当长时间的操作都应该移到另一个Goroutine。当长时间运行的操作完成后，可以通过调用loop.Do安排GUI的更新。\n请注意，此函数使用全局变量表示程序的状态。如果该状态作为参数传递，那么GUI布局和控件就可以正常工作，并且可以很容易地进行测试。\n总而言之，一旦添加了导入和注释，完整的应用程序就是76行。对main.ender稍作修改，使其具有功能，就可以使GUI的很大一部分内容可测试。可以在存储库中查看完整的源文件。如果感兴趣，请查看其他示例。", "note_en": "This tutorial shows how to build a simple Goey application, and introduces a reactive architecture useful for Goey applications. To be clear, the architecture is not fully reactive, but does use a unidirectional flow for data that simplifies writing GUI applications. For this architecture, there are 4 required functions.\n    With respect to the GUI, the  main function has one responsibility, which is to start the GUI&#39;s event loop. Event loops are common across the native GUI APIs supported, but obviously the details differ. The package   loop is responsible for abstracting away those differences. For our simple program, only one function from that package is required,   loop.Run. This function will initialize the event loop, and keep that loop running until there are no more top-level windows.\n Before the event loop starts, the top-level window needs to be created, but there is a complication. Details differ between platforms, but none of the major desktop GUI APIs are thread-safe. This means that any GUI objects, such as windows, ought to be created on the same OS thread as the event loop. Rather than leave it to the caller to coordinate the threading,  loop instead takes a callback to handle initializing the GUI.\n With proper error handling, the two requirements listed above leads to the following definition for the function  main.\n func  main ()  {  err  :=  loop . Run ( createWindow )  if  err  !=  nil  {  fmt . Fprintf ( os . Stderr ,  &#34;error: %s\\n&#34; ,  err )  os . Exit ( 1 )  } }\n  While the layout and controls within a window use a declarative approach, top-level windows are created imperatively. Windows are created using   goey.NewWindow, and properties can be updated using methods. For this simple example, only two properties on the window need to be set, and they are set when the window is created. This means that a single call is sufficient to create and initialize the window.\n  The second parameter sets the contents of the window. We could provide the necessary data here, but the program will also need to generate (and regenerate) the window&#39;s contents elsewhere. To avoid duplication, that code is located in  main.render.\n There is one other important detail. The function copies the   *goey.Window into a global variable. Global state is generally bad, but the value of  main.mainWindow will not change once initialized. This value is required to update the window&#39;s contents when we react to events.\n func  createWindow ()  error  {  mw ,  err  :=  goey . NewWindow ( &#34;One Button&#34; ,  render ())  if  err  !=  nil  {  return  err  }  mainWindow  =  mw  return  nil }\n  This is a small helper function that recalculates the contents of the window, using  main.render, and then updates the contents of the window. Note that the call to  SetChild is where the magic of  goey happens, and what makes  goey declarative. The package will reconcile any differences between the data-defined contents, and the platform-dependent controls, so that the window&#39;s contents match. There is no need for the caller to add, modify, or delete any controls.\n func  updateWindow ()  {  err  :=  mainWindow . SetChild ( render ())  if  err  !=  nil  {  fmt . Fprintf ( os . Stderr ,  &#34;error: %s\\n&#34; ,  err )  } }\n Beware, this function can only be called on the thread that is also running the GUI event loop. Otherwise, there will be concurrent access to the GUI API, which will likely cause a crash. If you need to call this function from an arbitrary goroutine, please use   loop.Do.\n  This function returns a data structure that defines the desired layout and contents of the top-level window. Ideally, all state that affects the contents would be passed as an argument, but in this simple example, the small bit of state is stored in a global variable,  clickCount.\n Based on the value of  clickCount, the button&#39;s label will change. Otherwise, the layout and contents are static. Details on layout will not be covered here, except to say that layout depends on simple, composable widgets. Please look at the widgets available in the  package  goey to see what layout options are available.\n The declarative nature of the GUI definition does not just cover the appearance, it also covers callbacks for events. In this case, note that the button has an event called  OnClick. In this case, the event handler is defined inline using a function literal. In response to events, the program can update its state, but note that it  does not directly modify any controls. Instead, we call  updateWindow. This will again call into  render to determine the current layout and contents.\n func  render ()  base . Widget  {  text  :=  &#34;Click me!&#34;  if  clickCount  &gt;  0  {  text  =  text  +  &#34; (&#34;  +  strconv . Itoa ( clickCount )  +  &#34;)&#34;  }  return  &amp; goey . Padding {  Insets :  goey . DefaultInsets (),  Child :  &amp; goey . Align {  Child :  &amp; goey . Button { Text :  text ,  OnClick :  func ()  {  clickCount ++  updateWindow ()  }},  },  } }\n The callbacks for events are executed on the same OS thread as the GUI event loop. It is therefore safe to create new windows, and modify those windows, within callbacks. Conversely, and long-running code will cause the GUI freeze, so any operations that may take appreciable time should be moved to another goroutine. When a long-running operation has completed, and update of the GUI can be arrange by calling   loop.Do.\n Note that this function uses a global variable for the program&#39;s state. If that state was passed as an argument, then the GUI layout and controls would be functional, and could easily be tested.\n  All told, once imports and comments are added, the complete application is 76 lines. A small modification to  main.render to make it functional would make a large part of the GUI testable. The  complete source file can be viewed in the repository. If interested, please checkout  the other examples.", "posttime": "2020-05-18 00:54:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,教程,app,goey,building", "title": "使用Go和Goey构建桌面应用程序的教程", "title_en": "Tutorial on building a desktop app with Go and Goey", "transed": 1, "url": "https://bitbucket.org/rj/goey/wiki/Tutorial-Hello", "via": "", "real_tags": ["程序", "教程", "app", "goey", "building"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002542, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据美国特勤局发布的一项新警报，尼日利亚一个组织严密的犯罪团伙正在利用冠状病毒危机，对多个州的失业保险计划实施大规模欺诈，潜在损失高达数亿美元。\n周四，特勤局(Secret Service)在美国各地的外地办事处传阅的一份备忘录中称，该团伙一直在不同的州使用身份盗窃受害者的社会安全号码和其他个人身份识别信息(PII)提交失业申领申请，“提交的欺诈性福利中，有相当大一部分使用了来自急救人员、政府人员和学校员工的PII。”特勤局看到了这份备忘录，这份备忘录在美国各地的外地办事处传阅。\n特勤局警告说：“据推测，这起事件背后的诈骗团伙拥有一个庞大的PII数据库，可以提交到目前为止观察到的大量申请。”“到目前为止，袭击目标主要是华盛顿州，不过也有证据表明，北卡罗来纳州、马萨诸塞州、罗德岛、俄克拉何马州、怀俄明州和佛罗里达州也发生了袭击事件。”\n特勤局表示，该诈骗网络据信由数百名“骡子”组成，这个术语用于描述被招募来帮助洗钱欺诈性金融交易收益的自愿或不知情的个人。\n“在华盛顿州，居住在州外的个人正在接受华盛顿州失业救济金计划的多笔ACH存款，所有这些存款都是以不同的个人名义支付的，与账户持有人没有任何联系，”通知继续说。\n国税局的备忘录显示，犯罪团伙的运作方式与骗子大致相同，后者专门向各州和美国国税局(IRS)提交欺诈性所得税退税申请，这是一个长期存在的问题，每年导致各州和美国财政部损失数亿美元的收入。\n在这些骗局中，诈骗者通常会招募一些人-通常是网络浪漫骗局的受害者，或者那些同样失业并寻找任何收入来源的人-从欺诈性交易中获得直接存款，然后将大部分非法资金转发给肇事者。\n一位不愿透露姓名的联邦欺诈调查员接受KrebsOnSecurity采访时表示，许多州根本没有足够的控制措施来检测可能有助于更好地筛选欺诈性失业申请的模式，比如寻找涉及相同互联网地址和/或银行账户的多个申请。调查人员说，在一些州，欺诈者只需提交某人的姓名、社保号码和其他基本信息就可以处理他们的索赔。\n美国俄克拉何马州银行家协会(Oaklahoma Bankers Association)欺诈部执行副总裁伊莱恩·多德(Elaine Dodd)表示，本周早些时候，俄克拉何马州的金融机构开始看到大量与华盛顿人提交的雇佣索赔有关的高额转账，许多转账金额在9000美元到2万美元之间。\n多德说，“在这里看到如此多的虚假申请，而且金额如此之大，真是令人难以置信。”他指出，俄克拉荷马州一头骡子收到的一份欺诈性索赔的金额超过了2.9万美元。“我为我们的银行家感到自豪，因为他们设法阻止了很多这样的转移，但有些已经消失了。大多数骡子似乎都曾(卷入)过恋爱骗局。“。\n虽然华盛顿的人要求通过俄克拉荷马州一家银行的ACH存款领取福利可能看起来很奇怪，但多德表示，如果有人问起，涉案人员似乎已经有了现成的答案：一种常见的说法是，索赔人住在华盛顿，但在和俄克拉何马州的家人住在一起时，他们安然度过了冠状病毒大流行。\n在特勤局发出警告之前，华盛顿和罗德岛的媒体报道了这两个州数百万美元的欺诈性失业申领人数。周四，《西雅图时报》(The Seattle Times)报道称，在官员发现超过160万美元的虚假申领后，这项活动已经暂停了两天的失业救济金发放。\n州就业保障部(ESD)告诉西雅图时报：“3-4月间，欺诈性申领失业救济金的人数猛增27倍，达到700人。”这篇报道指出，ESD的欺诈热线已经被电话淹没，并在上周末收到了如此多的电子邮件，以至于它暂时关闭了。\n美国罗德岛州WPRI 5月4日报道称，该州劳工和培训部已收到数百起有关失业保险欺诈的投诉，“涉嫌欺诈账户的数量正与史无前例的合法申领失业保险人数并驾齐驱。”\n欺诈行为激增之际，许多州都在努力处理由于冠状病毒大流行而提交的雪崩般的失业申领人数。美国政府星期四报告说，上周有近300万人申请失业救济，使过去两个月的总人数超过3600万人。财政部说，失业计划仅在4月份就提供了480亿美元的付款。\n被列为这个诈骗团伙主要目标的几个州正在经历全国失业申领人数最高的几个州。根据美国商会(U.S.Chamber of Commerce)公布的数据，华盛顿已有近100万人申领失业救济金，其中近30%的劳动力目前处于失业状态。商会发现，罗德岛州的情况更糟，31.4%的劳动力申请失业。\n多德说，她最近从一名联邦调查局特工那里听说，俄克拉何马州的一家公司有7名员工，并收到了数百人的索赔通知，显然没有受雇于那里。\n“俄克拉荷马州很可能会看到同样的情况，”她说。“肯定还有其他州代表俄克拉荷马州申请破产保护。”\n事实上，特勤局表示，这一骗局可能会影响到所有不采取额外措施清除欺诈性文件的州。\n特勤局的警告总结道：“袭击目标是各级银行，包括地方银行、信用社和大型国家银行。”“每个州都极有可能受到这一计划的影响，如果它们还没有成为目标，它们将成为目标。”", "note_en": "A well-organized Nigerian crime ring is exploiting the COVID-19 crisis by committing large-scale fraud against multiple state unemployment insurance programs, with potential losses in the hundreds of millions of dollars, according to a new alert issued by the  U.S. Secret Service.\n  A memo seen by KrebsOnSecurity that the Secret Service circulated to field offices around the United States on Thursday says the ring has been filing unemployment claims in different states using Social Security numbers and other personally identifiable information (PII) belonging to identity theft victims, and that “ a substantial amount of the fraudulent benefits submitted have used PII from first responders, government personnel and school employees.”\n “It is assumed the fraud ring behind this possesses a substantial PII database to submit the volume of applications observed thus far,” the Secret Service warned. “The primary state targeted so far is Washington, although there is also evidence of attacks in North Carolina, Massachusetts, Rhode Island, Oklahoma, Wyoming and Florida.”\n The Secret Service said the fraud network is believed to consist of hundred of “mules,” a term used to describe willing or unwitting individuals who are recruited to help launder the proceeds of fraudulent financial transactions.\n “In the state of Washington, individuals residing out-of-state are receiving multiple ACH deposits from the State of Washington Unemployment Benefits Program, all in different individuals’ names with no connection to the account holder,” the notice continues.\n The Service’s memo suggests the crime ring is operating in much the same way as crooks who specialize in  filing fraudulent income tax refund requests with the states and the U.S. Internal Revenue Service (IRS), a perennial problem that costs the states and the U.S. Treasury hundreds of millions of dollars in revenue each year.\n In those schemes, the scammers typically recruit people — often victims of  online romance scams or those who also are out of work and looking for any source of income — to receive direct deposits from the fraudulent transactions, and then forward the bulk of the illicit funds to the perpetrators.\n A federal fraud investigator who spoke with KrebsOnSecurity on condition of anonymity said many states simply don’t have enough controls in place to detect patterns that might help better screen out fraudulent unemployment applications, such as looking for multiple applications involving the same Internet addresses and/or bank accounts. The investigator said in some states fraudsters need only to submit someone’s name, Social Security number and other basic information for their claims to be processed.\n Elaine Dodd, executive vice president of the fraud division at the  Oklahoma Bankers Association, said financial institutions in her state earlier this week started seeing a flood of high-dollar transfers tied to employment claims filed for people in Washington, with many transfers in the $9,000 to $20,000 range.\n “It’s been unbelievable to see the huge number of bogus filings here, and in such large amounts,” Dodd said, noting that one fraudulent claim sent to a mule in Oklahoma was for more than $29,000. “I’m proud of our bankers because they’ve managed to stop a lot of these transfers, but some are already gone. Most mules seem to have [been involved in] romance scams.”\n While it might seem strange that people in Washington would be asking to receive their benefits via ACH deposits at a bank in Oklahoma, Dodd said the people involved seem to have a ready answer if anyone asks: One common refrain is that the claimants live in Washington but were riding out the Coronavirus pandemic while staying with family in Oklahoma.\n The Secret Service alert follows news reports by media outlets in Washington and Rhode Island about millions of dollars in fraudulent unemployment claims in those states. On Thursday,  The Seattle Times  reported that the activity had halted unemployment payments for two days after officials found more than $1.6 million in phony claims.\n “Between March and April, the number of fraudulent claims for unemployment benefits jumped 27-fold to 700,” the state Employment Security Department (ESD) told The Seattle Times. The story noted that the ESD’s fraud hotline has been inundated with calls, and received so many emails last weekend that it temporarily shut down.\n WPRI in Rhode Island  reported on May 4 that the state’s Department of Labor and Training has received hundreds of complaints of unemployment insurance fraud, and that “the number of purportedly fraudulent accounts is keeping pace with the unprecedented number of legitimate claims for unemployment insurance.”\n The surge in fraud comes as many states are struggling to process an avalanche of jobless claims filed as a result of the Coronavirus pandemic. The U.S. government reported Thursday that nearly three million people filed unemployment claims last week, bringing the total over the last two months to more than 36 million. The Treasury Department  says unemployment programs delivered $48 billion in payments in April alone.\n A few of the states listed as key targets of this fraud ring are experiencing some of the highest levels of unemployment claims in the country. Washington has seen nearly a million unemployment claims, with almost 30 percent of its workforce currently jobless, according to  figures released by the  U.S. Chamber of Commerce. Rhode Island is even worse off, with 31.4 percent of its workforce filing for unemployment, the Chamber found.\n Dodd said she recently heard from an FBI agent who was aware of a company in Oklahoma that has seven employees and has received notices of claims on several hundred persons obviously not employed there.\n “Oklahoma will likely be seeing the same thing,” she said. “There must be other states that are getting filings on behalf of Oklahomans.”\n Indeed, the Secret Service says this scam is likely to affect all states that don’t take additional steps to weed out fraudulent filings.\n “The banks targeted have been at all levels including local banks, credit unions, and large national banks,” the Secret Service alert concluded. “It is extremely likely every state is vulnerable to this scheme and will be targeted if they have not been already.”", "posttime": "2020-05-18 00:53:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特勤,service,欺诈性", "title": "美国特勤局：针对州失业保险计划的“大规模欺诈”", "title_en": "US Secret Service: “Massive Fraud” Against State Unemployment Insurance Programs", "transed": 1, "url": "https://krebsonsecurity.com/2020/05/u-s-secret-service-massive-fraud-against-state-unemployment-insurance-programs/", "via": "", "real_tags": ["特勤", "service", "欺诈性"]}, {"category": "", "categoryclass": "", "imagename": "e0e1b6fb7879145b3d89104a9f6b809c.jpg", "infoid": 1002541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按：“大西洋月刊”正在向所有读者提供有关冠状病毒的重要报道。在这里找到收藏品。\n美国已经进行了多少次冠状病毒检测？自2月份以来，联邦政府首次有了答案。疾病控制和预防中心现在表示，全国范围内已经进行了10,847,778次冠状病毒检测。这些检测发现了大约140万例阳性病例。\n这些数据来自一个新的疾控中心网站，该网站上周低调出现在网上。对于美国首屈一指的公共卫生机构来说，这标志着一个重要但姗姗来迟的进展，该机构一直在努力控制已导致超过8.1万美国人死亡并导致美国经济陷入衰退的大流行。自2月29日全国死亡人数为5人以来，疾控中心还没有发布过任何接近每日全面检测计数的数据。\n在过去的11周里，位于大西洋的COVID跟踪项目一直是该国唯一可靠的国家检测数据来源。(该跟踪器每天汇编美国每个州和地区报告的测试次数。)。虽然疾控中心只提供了偶尔和初步的总测试记录，但来自COVID跟踪项目的数据已经被约翰·霍普金斯大学(Johns Hopkins University)、州长和国会议员以及白宫使用。\n有了新的疾控中心网站，联邦政府再次提供定期测试数据，这是有史以来第一次，它是在各州的水平上这样做的。但对疾控中心州级数据的初步分析发现，许多州的报告与联邦政府关于它们的报告之间存在重大差异。例如，在佛罗里达州，差距是巨大的。州政府周五报告称，自疫情爆发以来，全州已进行了约70万次冠状病毒检测。这一统计应该是权威的：州长罗恩·德桑蒂斯(Ron DeSantis)已下令医院和医生向佛罗里达州卫生部报告他们的检测结果。然而，疾病预防控制中心报告说，在同一时期，该州进行了超过91.9万次检测。这比佛罗里达州自己认为进行的测试多了31%。(因为疾控中心说它不会在周末更新数据，所以我们在整篇文章中都把它的数字与每个州周五报告的数字进行了比较。)。当我们要求疾控中心解释佛罗里达州的差异时，该机构拒绝对记录发表评论。\n“如果这就是他们所得到的，疾控中心应该拿起电话，打电话给佛罗里达州，说‘发生了什么事？’”哈佛大学全球健康教授阿希什·贾(Ashish Jha)告诉我们。\n考虑到数据的复杂性和多源性质，当然应该预料到一些变化。但我们发现的不一致之处表明，佛罗里达州并不是一个异常值。使用与疾控中心产出最接近的州数据，在22个州，疾控中心报告的检测数量与州政府报告的数量偏差超过10%。在13个州，这一差异超过25%。在某些情况下，疾控中心的统计数字比各州报告的要高得多；在另一些情况下，则要低得多。\n在新罕布夏州，疾控中心报告的检测数量大约是州政府的一半；在印第安纳州，疾控中心报告的数量大约多出一半。加州已经报告了1133,906次检测的结果，但疾控中心知道有924,696次。(一些最大的差异影响到美国人口最多的一些州，不仅包括加利福尼亚州，还包括伊利诺伊州和德克萨斯州。)。新泽西州政府表示，已经对462,972个样本进行了分析。疾控中心报告只有409,320人。阿拉斯加、亚利桑那州、科罗拉多州、肯塔基州、蒙大拿州、北卡罗来纳州、田纳西州、马萨诸塞州和马里兰州也报告了与疾控中心公布的数据显著不同的测试数据。奇怪的是，疾控中心的州和全国的病例和死亡总数与我们从COVID追踪项目的各州收集的数据非常吻合。它的全国测试总数也是如此。只有当你深入研究州级测试数据时-那里的差异在两个方向上是不一致的-事情才会开始出错。\n这些数据集有一个已知的主要区别：一些州报告了测试的总人数，而疾控中心报告了每次测试，即使一个人测试了不止一次。印第安纳州公共卫生部门的一位发言人指出，这一差异解释了该州的测试差距。但我们的分析表明，这一点-或任何其他方法因素-并不能完全解释广泛存在的差异。约翰·霍普金斯大学健康安全中心的流行病学家凯特琳·里弗斯告诉我们，一种可能的解释是，如果包括抗体测试结果(不跟踪实时感染情况)，疾控中心可能会高报一些州的检测总数，而在其他州则因为文书工作的延误而报告不足。但这种差异似乎如此广泛，以至于它们不太可能是由于报告某些类型的测试的方式存在单一差异而产生的。按照目前的增长速度，佛罗里达州报告的检测数据还要再过两周才能与疾病控制与预防中心目前的总数相匹配。\n“这是疾控中心功能失调的更多证据，”Jha说。“疾控中心和各州之间应该不会有太多阳光。”JHA此前曾批评疾控中心在冠状病毒大流行期间“莫名其妙地缺席”。\n各州和疾病预防控制中心之间的一些不匹配可以用联邦政府收集测试数据的不同寻常的方式来解释。一般来说，疾病监测数据从地方公共卫生部门流向州政府，然后流向联邦政府。但在4月份，副总统迈克·彭斯(Mike Pence)要求医院开始直接向联邦政府报告冠状病毒检测数据。疾控中心的一位发言人在一封电子邮件中证实，新网站反映的检测数据不仅来自各州，还来自医院、私人医疗检测公司以及州和地方公共卫生实验室。\n据美国卫生与公众服务部(Department Of Health And Human Services)发言人称，彭斯要求的数据输入了一款名为HHS Protect的软件，该软件旨在为特朗普政府提供冠状病毒数据的交换中心。HHS Protect是由国防承包商Palantir开发的。该公司拒绝对这一记录发表评论。\n目前还不清楚疾控中心网站最初出现的确切时间。疾控中心的一位发言人告诉我们，它是在5月7日上线的，但该页面的第一个互联网档案馆缓存的日期是5月9日。疾控中心没有在任何声明、社交媒体帖子或新闻发布会上宣布该页面的存在。\n在过去几个月疾控中心确实提供的许多统计中，它错过了绝大多数测试。5月初，美国疾病控制与预防中心(CDC)报告称，美国只进行了大约50万次检测。但到那时，COVID跟踪项目已经统计了各州报告的超过750万次检测的结果。4月下旬，白宫在一份关于国家测试战略的重要报告中使用了COVID跟踪项目的数据。本周早些时候，它在新闻发布会上再次引用了这些数据。\n疾控中心应该向该国提供关于冠状病毒检测状况的单一、可信的数据源。但事实上，它的数据仍然与国家报告的总数如此不符，这意味着疾控中心的最新努力对政客和公众用处不大。目前，在这场危机中本应成为受人尊敬的真相来源的机构只会增加国家的困惑。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n是“大西洋月刊”的特约撰稿人，也是“为梦想提供动力：绿色技术的历史与前景”一书的作者。", "note_en": "Editor&#39;s Note:  The Atlantic is making vital coverage of the coronavirus available to all readers. Find the collection  here.\n  How many coronavirus tests have been conducted in the United States? For the first time since February, the federal government has an answer. The Centers for Disease Control and Prevention now  say that 10,847,778 coronavirus tests have been conducted nationwide. These tests have found about 1.4 million positive cases.\n  These figures come from  a new CDC website that appeared online last week with little fanfare. It marks an important but much belated development for the nation’s premier public-health agency, which has struggled to manage a pandemic that has killed more than 81,000 Americans and plunged the U.S. economy into a recession. Not since February 29, when the nationwide death toll stood at five, has the CDC published anything close to a comprehensive daily count of tests.\n  For the past 11 weeks, the  COVID Tracking Project at  The Atlantic has been the country’s only reliable source for national testing data. (The tracker compiles the number of tests reported by each U.S. state and territory daily.) While the CDC has provided only occasional and rudimentary tallies of total tests, data from the COVID Tracking Project have been used by  Johns Hopkins University, governors and members of Congress, and  the White House.\n    With the new CDC site, the federal government is providing regular testing data again, and for the first time ever, it is doing so on a state-by-state level. But an initial analysis of the CDC’s state-level data finds major discrepancies between what many states are reporting and what the federal government is reporting about them. In Florida, for example, the disparity is enormous. The state government  reported on Friday that about 700,000 coronavirus tests have been conducted statewide since the beginning of the outbreak. This count should be authoritative: Governor Ron DeSantis has  ordered hospitals and doctors to report their test results to the Florida Department of Health. Yet the CDC reported more than 919,000 tests in the state in that same period. That’s 31 percent more tests than Florida itself seems to think it has conducted. (Because the CDC says it does not update its data on the weekends, we have, throughout this article, compared its figures against the numbers reported by each state on Friday.) When we asked the CDC to explain the discrepancy in Florida, the agency declined to comment on the record.\n  “If this is what they’re getting, the CDC should pick up the phone and call the state of Florida and say, ‘What’s happening?’” Ashish Jha, the K.T. Li Professor of Global Health at Harvard, told us.\n  Given the complexity and the multisource nature of the data, some variations should certainly be anticipated. But the inconsistencies we found suggest that Florida is not an outlier. Using the state numbers that match the CDC’s output most closely, in 22 states, the CDC’s reported number of tests diverges from the number reported by the state government by more than 10 percent. In 13 states, it diverges by more than 25 percent. In some cases, the CDC’s tallies are much higher than what states are reporting; in others, much lower.\n  In New Hampshire, the CDC reports about half as many tests as the state government; in Indiana, it reports about half as many more. California has reported the results of 1,133,906 tests, but the CDC is aware of 924,696. (Some of the largest discrepancies affect some of the country’s most populous states, including not only California but Illinois and Texas.) The state government of New Jersey says that 462,972 specimens have been analyzed. The CDC reports only 409,320. Alaska, Arizona, Colorado, Kentucky, Montana, North Carolina, Tennessee, Massachusetts, and Maryland also report testing figures that differ significantly from those published by the CDC. Curiously enough, the CDC’s state and national totals for cases and deaths match up well with what we’ve gathered from states at the COVID Tracking Project. So do its national testing totals. Only when you dig into the state-level testing data—where discrepancies skew in both directions—do things begin to go awry.\n    The data sets have one known major difference: Some states report the total number of people tested, while the CDC reports every test, even if a single person is tested more than once. A spokesperson for Indiana’s public health department pointed to this difference to explain the state’s test gap. But our analysis suggests this—or any other methodological factor—does not fully explain the widespread discrepancies. Caitlin Rivers, an epidemiologist at the Johns Hopkins University Center for Health Security, told us that one possible explanation is that the CDC could be overreporting testing totals in some states if  it is including antibody-test results, which don’t track real-time infections, and underreporting in other states because of delays in paperwork. But the differences seem to be so widespread that they are unlikely to arise from a single discrepancy in how certain kinds of tests are reported. At their current rate of growth, Florida’s state-reported testing numbers would not match the CDC’s current totals for another two weeks.\n  “This is more evidence of the dysfunction of the CDC,” Jha said. “There is not supposed to be a lot of daylight between the CDC and the states.” Jha has  previously criticized the CDC for being “inexplicably absent” during the coronavirus pandemic.\n Some of the mismatch between states and the CDC could be explained by the federal government’s unusual manner of collecting testing data. Generally,  disease-surveillance data flow from local public-health departments to state governments, and then on to the federal government. But in April, Vice President Mike Pence  asked hospitals to start reporting their COVID-19 testing data directly to the federal government. In an email, a CDC spokesperson confirmed that the new website reflected test data from more sources than just states, saying it came from hospitals, private medical-testing companies, and state and local public-health labs.\n  The data that Pence requested fed into a piece of software called HHS Protect, which was meant to serve as a clearinghouse of coronavirus data for the Trump administration, according to a spokesperson for the Department of Health and Human Services. HHS Protect was developed by the defense contractor Palantir. The company declined to comment on the record.\n  It’s unclear exactly when the CDC site first appeared. A CDC spokesperson told us that it went live on May 7, but the first Internet Archive cache of the page is dated May 9. The CDC did not announce the existence of the page in any statement, social-media post, or press conference.\n In many of the counts the CDC did provide over the past several months, it missed the large majority of tests. In early May, the CDC reported that only about  half a million tests had been conducted in the U.S. But the COVID Tracking Project had tallied the results of more than 7.5 million tests reported by states by then. In late April, the White House  used the COVID Tracking Project’s data in a major report on national testing strategy. It cited the data again earlier this week in a press conference.\n The CDC should provide the country with a single, trustworthy data source on the state of COVID-19 testing. But the fact that its data are still in such disagreement with the state-reported totals means that the CDC’s latest efforts are not of much use to politicians and the public. For now, the agency that should be a respected source of truth in this crisis is only adding to the national confusion.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n                  is a staff writer at  The Atlantic and the author of   Powering the Dream: The History and Promise of Green Technology.", "posttime": "2020-05-18 00:52:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,don,疾控中心", "title": "国家和新的疾控中心冠状病毒检测数据不匹配", "title_en": "State and New CDC Data on Covid-19 Testing Don’t Match Up", "transed": 1, "url": "https://www.theatlantic.com/health/archive/2020/05/cdc-publishing-covid-19-test-data/611764/", "via": "", "real_tags": ["冠状病毒", "病毒", "don", "疾控中心"]}, {"category": "", "categoryclass": "", "imagename": "b165d0a828f91b6a0aab8dac639bd546.jpeg", "infoid": 1002540, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“边缘报”报道，埃隆·马斯克的“钻孔公司”已经完成了在拉斯维加斯会议中心地下的第二条隧道的挖掘工作。\n建成后，拟议的旅客运输系统应该能够在十五分之一的时间内将游客从会议中心园区的一边运送到另一边。\n经过一年的挖掘，埃隆·马斯克的钻探公司在拉斯维加斯会议中心(LVCC)完成了其地下旅客运输系统的第二条隧道。它与预期的2021年1月开幕日期保持同步-正好赶上一年一度的消费电子展(CES)。到目前为止，冠状病毒(冠状病毒)大流行还没有改变这些计划。\n早在2019年5月，拉斯维加斯会议和游客管理局董事会就首次批准了该合同，到2020年2月，钻孔公司已经完成了第一条隧道。总体而言，根据无聊公司的说法，我们的目标是为LVCC校园内的会议和贸易展会参会者提供快速方便的交通工具。\n在正常情况下，从会议中心的新展览馆步行到校园的另一边大约需要15分钟-马斯克的公司声称可以将通勤时间缩短到一分钟。\n建成后，拉斯维加斯环路将由三个车站组成，横跨会议中心场地。在地下隧道系统中，钻孔公司计划用改装的特斯拉底盘建造的吊舱运送12到16名乘客。拉斯维加斯会议和旅游局首席执行官兼总裁史蒂夫·希尔(Steve Hill)在接受The Verge采访时表示，这些改装后的Model 3和Model X有轨电车时速高达155英里，将有能力每小时运送约4000名游客。\n希尔说，总有一天，吊舱将自动通过隧道操作(马斯克的公司将其称为自动电动汽车，简称AEV)，但一开始将使用人类司机。希尔说，每当我们知道[让车辆自动驾驶是安全的]时，我们就会迈出这一步。但实现这一目标并没有最后期限。\n尽管希尔表示，该项目并未因流感大流行而延迟，但如果明年的CES被取消，钻孔公司和拉斯维加斯会议和游客管理局都将等到下一次可用的贸易展之前向公众首次亮相地下穿梭系统。\n希尔说，当会议中心最终开放时，该系统将为会议中心的参观者提供免费服务。然而，他确实指出，拉斯维加斯环路并不是用来作为公共交通工具的。\n它来这里是为了(贸易)展会的利益，所以在[他们]在这里的时候，它会增强能力，他说。在这段时间里，如果有人需要的话，它会一路下降到一辆或两辆可用的汽车。\n那么下一步是什么呢？施工将集中在隧道系统两端的地上客运站，以及朝向环路中心的第三个地下车站。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息", "note_en": "Elon Musk&#39;s The Boring Company has finished digging out a second tunnel beneath the Las Vegas Convention Center, according to a  report in  The Verge.\n When complete, the proposed  people-mover system should be able to transport visitors from one side of the convention center campus to the other in  1/15th of the time.\n   After a year&#39;s worth of digging,  Elon Musk&#39;s The Boring Company has completed the second tunnel for its underground people-mover system at the Las Vegas Convention Center (LVCC). It&#39;s keeping in step with an anticipated opening date in January 2021—just in time for the annual Consumer Electronics Show (CES). So far, the COVID-19 ( coronavirus) pandemic hasn&#39;t yet altered these plans.\n Back in May 2019, the Las Vegas Convention and Visitors Authority Board of Directors first approved the contract, and by February 2020, The Boring Company had completed the first tunnel. Overall, the goal is to &#34;provide  fast and convenient transportation for convention and trade show attendees across the LVCC campus,&#34; according to The Boring Company.\n  Under normal circumstances, it takes about 15 minutes to walk from the convention center&#39;s New Exhibit Hall to the other side of the campus—something Musk&#39;s company claims it can cut down to a humble one-minute commute.\n When complete, the Las Vegas Loop will consist of three stations across the convention center grounds. In the subterranean tunnel system, The Boring Company plans to carry groups of 12 to 16 passengers in pods constructed with modified Tesla chassises. At speeds of up to 155 miles per hour, these adapted Model 3 and Model X trams will have the capacity to transport about  4,000 visitors per hour, said Steve Hill, the CEO and president of the Las Vegas Convention and Visitors Authority, in an interview with  The Verge.\n Hill said the pods will one day operate through the tunnels autonomously (Musk&#39;s company refers to them as autonomous electric vehicles, or AEVs), but will use human drivers at the outset. &#34;Whenever we get to the point where we know that [it&#39;s safe to let the vehicles drive themselves],&#34; Hill said, &#34;that&#39;s when we&#39;ll take that step. But there is not a deadline for making that happen.&#34;\n  Although Hill said the project hasn&#39;t been delayed by the pandemic, if the CES  is canceled next year, both The Boring Company and the Las Vegas Convention and Visitors Authority will wait to debut the underground shuttle system to the public until the next available trade show.\n  When it does eventually open, Hill said the system will be a free service for convention center goers. However, he did point out the Las Vegas Loop isn&#39;t meant to serve as public transportation.\n &#34;It&#39;s here for the benefit of the [trade] shows, so it’ll ramp up capability while [they’re] here,&#34; he said. &#34;Between those times, it’ll ramp way back down to a car or two available if somebody needs one.&#34;\n So what&#39;s next? Construction will focus on the above-ground passenger stations on each end of the tunnel system, along with a third underground stop toward the center of the Loop.\n   This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2020-05-18 00:39:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,马斯克,musk,会议", "title": "埃隆·马斯克的“钻孔公司”在拉斯维加斯完成了第二条隧道的挖掘", "title_en": "Elon Musk's 'Boring Company' Finishes Digging Second Tunnel in Las Vegas", "transed": 1, "url": "https://www.popularmechanics.com/technology/infrastructure/a32477074/boring-company-las-vegas-loop-excavation/", "via": "", "real_tags": ["埃隆·马斯克", "马斯克", "musk", "会议"]}, {"category": "", "categoryclass": "", "imagename": "0d3eca1e20dec3dfd6931d787fad3ea5.jpg", "infoid": 1002539, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿拉巴马州伯明翰。-在很长一段时间里，乔·明特(Joe Minter)设法与妻子希尔达(Hilda)、他们的两个儿子和10万名邻居共用一个院子。他那肮脏的三居室房子几乎占满了城市的一个小停车场，就在小马丁·路德·金(Martin Luther King Jr.)旁边的山上。驾驶。但不知何故他成功了。\n然而，当这些灵魂开始呼喊着要自己的草坪装饰品时，他意识到他必须找到更多的空间。\n明特家门口南面和西面的坡地属于两个历史悠久的黑人墓地，即格雷斯山(Grace Hill)和影子草坪(Shadow Lawn)。“我们有大约10万名非洲祖先，”明特先生会告诉周日早上顺道拜访的游客。这些是解放的奴隶、农民和钢铁工人，他们创造了伯明翰：建造了“魔力之城”的肌肉。\n明特夫人说，死者哪儿也不会去，但附近的其他地方正在变得越来越稀疏。一些房主死了，另一些人开车向北再也没有回来。因此，曼特夫妇开始物色更多的财产。“我们从纽约买下了距离麦克玛丽牧师50英尺的地方，”她说。\n明特先生说：“我们只用了一把圆锯就把隔壁的这座拆了下来。大部分都是我做的。我有个男孩来帮我一点忙。“。\n一个明显的例外是明特所说的美国非洲村，以及他提出的令人惊叹的虚构建筑，几乎填满了他合并后的半英亩土地的每一平方英尺。\n据一些人估计，它是美国最非凡、最鲜为人知的雕塑花园之一。这里是一个房间大小的重建的伯明翰监狱，这里关押着马丁·路德·金，周围环绕着六只混凝土杜宾犬。\n桑迪·胡克小学有一座纪念遇难者的纪念碑，包括26双跳蚤市场的鞋子(“我花了相当好的价格买到的，”他说)和杰西·文图拉(Jesse Ventura)愤怒的橡皮头。\n而在其他地方，到处都是焊铁和手绘的圣经标牌，以及用来淹没垃圾填埋场的小玩意儿。明特最终将为波士顿马拉松爆炸案竖起一座纪念碑，这似乎几乎是不可避免的，尽管双子塔后面是唯一一块干净的草坪。\n非洲村也是最濒危的艺术环境之一：明特先生是该遗址的常驻艺术家、策展人、讲解员和场地管理员，他刚满70岁。\n伯明翰艺术博物馆(Birmingham Museum Of Art)非洲和美国收藏品策展人艾米丽·汉娜(Emily Hanna)说，他的装置作品代表了阿拉巴马州最后几个伟大的“院子展览”之一。这个硬币描述了南方独特的文化，有时还具有远见卓识的家居陈列。\n她说，像明特这样的艺术家是“在吉姆·克罗(Jim Crow)时期走出佃农制度，从事各种工作的过渡时期”涌现出来的。现在，汉娜博士补充说，“阿拉巴马州乡村生活的快照--它正在离开我们。”\n然而，非洲村没有得到任何赠款，没有机构支持，也几乎没有宣传。前往曼特夫妇砖面小房子朝圣的人们-一年可能有300人-是跟随互联网上的谣言、故事和图片而来的。\n不过，在他看来，明特并不孤单。他的庭院展览是所有作为动产运往新大陆的1100万非洲人的家园。这些作品的存在是为了讲述他们几个世纪以来的故事，从西非的暴徒和勇士，到1963年第16街浸信会教堂爆炸案中被杀害的四名女孩。\n今年，伯明翰将纪念这场悲剧50周年，以及民权时代的一些标志性事件。但就明特而言，他没有怀旧的心情。他认为，当地的学校比以往任何时候都更加隔离。在经历了一场下水道捆绑的徒劳之后，这个县破产了。(明特也为这场惨败制作了一座雕塑：碎石和一个马桶。)。\n当他不在院子里的时候，他在县法院的台阶上保留了一种类似于第二个家的感觉。他每周至少有几天带着他惯常的装备去那里报道：战斗靴，一个红色的建筑头盔，上面写着“上帝热爱和平”，还有一个手写的牌子。他最近的原因是部分关闭了一家名为库珀·格林慈悲(Cooper Green Mercy)的公立医院，他将其归功于在中风和肾病后拯救了妻子的生命。\n“男人是有义务的，”他说。这与抱有希望是不同的。\n一段时间以来，明特先生一直相信，这个国家坐在驴子上的方式是错误的，把后躯误认为是头部。“我们没有前进，”他说。“我们倒退了。”\n自从中风后，66岁的明特夫人很少冒险走进花园。这使得这位退休的数据录入操作员被困在房子里，自从他们搬进来的那天起，她就认为房子很粗糙，已经过时了。\n“我就是不喜欢，”她说，40年来丝毫没有改变她的想法。\n然而，如果非洲村有一位大使，那肯定是明特夫人。当来电者到达时，她会走到门口，给他们一件原装T恤，然后让他们出去在混乱中找到她的丈夫。\n这里的诀窍是倾听敏特先生带着穿过花园的7英尺高的手杖上的钟声。他在路边发现了那根柱子，把它扔进了他的雪佛兰响尾车的后座，并用金属线、绳索和丝带来装饰它。这是一根会说话的棍子，明特先生是一位慷慨激昂的演说家。\n几分钟后，他的思想可能会从西伯利亚上空的陨石转向货运车场的环境种族主义，再到古代非洲冶金的起源。他的时间属于他的客人，有时反之亦然。正如他所说，“一旦你们交谈，你们就会收获很多。”\n跟着他穿过院子，经过为美西战争中的布法罗士兵举行的献礼仪式，明特先生会在一块扁平的石碑前停下来。\n“我父亲的坟墓就在这块土地的边上，”他说。劳伦斯·明特在第一次世界大战中是一名步兵，也是一名熟练的机械师。然而，回到阿拉巴马州，他能找到的最好的工作是在一个白人墓地做看门人。他和他的妻子罗西负责抚养八个孩子(另外两个孩子很早就去世了)，“他不得不承受很大的负担。”\n起初，这家人住在泰特斯维尔(Titusville)附近的中央大街--或者更确切地说，是住在楼下的一座旧泵房里。“除了墙壁和寒冷，什么都没有，我们不得不到外面去用洗手间，”他说。\n黑色的校舍可能更破旧了。“屋顶一直在漏水，”明特说。“我们有你们所说的杀不死的精灵。但我们是在一种不应该有的氛围中学习的。“。\n艺术并不是逃离这个世界的一种方式；如果它存在，明特先生也不知道。蓬勃发展的是独创性和即兴创作。“我没有玩具，”他说。“我开始用我能弄到的任何东西做东西。”\n一个雪茄盒，上面插着冰锥，里面装满了碎石，变成了嘎嘎作响的响声。一根树桩、一根钉子和一条10英尺长的锡条变成了旋转的旋转器。他回忆说：“这真的只是一个孩子的头脑，在打听。”\n午餐时间左右，一辆白色面包车在死胡同的街道上掉头停在前门附近。这是62岁的吉尔伯特·克莱因(Gilbert Klein)，他在一段时间前从一家钢铁厂退休。(他还派出了一个飙车团队，经营克莱斯勒。“大多数人不会这么做，”他说。然后一场龙卷风刮倒了他的房子，他无家可归了几年。\n克莱因说，在那段时间里，明特先生一直在照顾他。现在，他重新站稳脚跟，从事伯明翰的一个新行业：丧失抵押品赎回权。现在，事实上，他正在组织一次为期一天的清仓大甩卖，准备买下一套家具。\n明特先生在里面消失了一会儿，当他回来时，他把一掌心的钞票塞进克莱恩先生的手里。克莱恩说，“我会在接下来的两天里给你打电话。”(没有人会把明特误认为放高利贷的人。)\n克莱因说，两人都就读于伯明翰一所较好的黑人高中。但很难得出结论，他们接受的教育是为了更好的东西。像他的父亲一样，明特在被征召到越南后，在陆军中接受了机械训练。在他光荣退伍后，他也安顿在一系列低薪工作中。\n他组装学校家具，直到工厂关闭。他学会了汽车车身修理这门手艺，但灰尘和油漆太难看了。他在筑路人员和建筑工地上辛勤劳作，直到他们离开。然后，在50多岁的时候，他意识到自己退休了。(明特先生的养老金在他的老雇主关门时蒸发了。这对夫妇依靠明特夫人的小额退休、社会保障和天意维生。)。\n你也可以说这是他生命中真正的工作开始的时候。明特回忆说，有一天下午，他走到外面，捡起被风吹过的橡胶树树干，开始雕刻非洲图腾。\n明特太太既不鼓励也不斥责。“他告诉我这是上帝的异象，”她说。“当有人告诉我上帝与他交谈时，我不会插手。”\n明特先生插话说：“我要回去看看他们在非洲做的事情。你知道他们怎么说有青铜时代和铁器时代。有一个木材时代。但是他们从来没有记录过木材的年龄。“。\n明特先生与非洲的联系既是他作品中令人振奋的精神，也是一种深厚的神秘感。“我没去过那里，”他说。“我真的没有研究过。”\n明特太太自己也莫名其妙。“我对非洲一无所知，”她说。“直到他开始和我说话。”\n馆长汉娜博士指出，在一些非洲文化中，一个人与铁打交道的能力来自于金属的精神品质。\n明特先生把自己视为这个传统中的一员。“我的血液里流淌着一些铁匠的血统，”他说。“我被铁吸引住了。”\n然而，63岁的艺术家、非洲村的早期拥护者朗尼·布拉德利·霍利(Lonnie Bradley Holley)说，他的废铁哨兵和橡树偶像也是阿拉巴马州特有的。(霍利在伯明翰失去了自己的山顶环境，那里收藏了大约3万件艺术品，因为机场当局谴责了他的家扩建跑道。)。\n霍利先生说，这些材料承载着“一个工业城市的精髓，一个真正从地球上取下铁矿石，然后从地球上取下熔化这些铁所需的燃烧材料的城市。”然后从元素中提取必须咆哮的空气，才能使这场火变得足够热。“。\n霍利总结道，对于乔·明特这样的创意力量来说，“魔力之城”这个绰号不仅仅是文字。它描述了一些真实的东西：制造艺术的工业炼金术。\n明特先生与非洲村的合作已经结束了。或者他喜欢这么说。事实上，他一直在不断地增加。在深秋，他为飓风桑迪的遇难者制作了一座波纹金属纪念碑。白色的内管代表了风暴的雷达图像，半英寸的PVC管从眼睛螺旋状伸出。\n“我放慢了速度，”他将宣布。“我像蜜蜂、白蚁、蚂蚁一样工作。”这些天，他补充说，“我要照顾我的妻子。”\n到目前为止，他还没有找到进入一两个博物馆的方法。(“等他死了，他就不挡道了，”他想象着艺术界会这么说。)。但他不想分发他的埃德蒙·佩特斯大桥(Edmund Pettus Bridge)模型，这座桥是民权的标志性建筑。\n“它不能被拆散，”他在谈到非洲村时说。“要么全力以赴，要么一无所有。”\n汉纳博士说，默认的计划似乎也超过了南方腹地的所有其他庭院展览，“除非有人挺身而出，接受它的呵护，否则它就会回到地球上。”\n伯明翰艺术博物馆馆长盖尔·安德鲁斯(Gail Andrews)对明特的作品表示敬意。但是，尽管她着眼于这个机构的一件作品-杆子上的三K党(Ku Klux Klan)人物-但她说，“我内心只有一部分觉得从那里拿走任何东西都是不合适的。”\n安德鲁斯接着说，“当人们看到博物馆里的展品时，会有这种感觉吗？”\n也就是说，当风从山谷刮起时，你如何复制金属薄板发出的嘎嘎声？每年四月在木板路上拔地而起的百日菊地毯会发生什么？祖先会住在当代画廊的基座上吗？\n“体验就是亲临现场，和他一起看，”她说。\n在很大程度上，明特先生对此表示同意。他坚持认为环境应该在它所在的地方得到保护。他想象有三个巨大的圆顶，或者可能是金字塔，底部是大理石。“就像一座玻璃陵墓，”他说。明特不能说，谁将实施这一神奇的保护行动。\n他环顾四周寻找他的话棍，然后爬上一个木制平台。他解释说，这条12英尺长的堤道横跨大西洋。一边是阿拉巴马州，另一边是非洲-尽管两端看起来是一样的。明特说，“当上帝叫我动的时候，我就动起来。”", "note_en": "BIRMINGHAM, Ala. — For a long time, Joe Minter managed to share a yard with his wife, Hilda, their two sons and 100,000 of their neighbors. His scruffy three-bedroom house filled up most of a small city lot, just up the hill from Martin Luther King Jr. Drive. But somehow he made it work.\n When these souls began to cry out for their own lawn ornaments, however, he realized he would have to find more room.\n The sloping land to the south and west of Mr. Minter’s dooryard belonged to the two historically black graveyards called Grace Hill and Shadow Lawn. “We are in the presence of about 100,000 African ancestors,” Mr. Minter will tell visitors who drop by on a Sunday morning. These are the emancipated slaves and farmers and steelworkers who made Birmingham: the muscle that built the “Magic City.”\n The dead weren’t going anywhere, but the rest of the neighborhood was thinning out, Mrs. Minter said. Some homeowners died off; others drove north and never came back. So the Minters began scouting for more property. “We bought 50 feet from Pastor McMary, from New York,” she said.\n Mr. Minter said: “We tore this one down next door with nothing but a circular saw. I did it, mostly. I had a boy to help a little bit.”\n One obvious exception would be what Mr. Minter calls the African Village in America, and the amazing fabrications he has raised to fill almost every square foot of his consolidated half-acre holding.\n It is, by some reckonings, one of the nation’s most extraordinary and least-known sculpture gardens. Here’s a room-size re-creation of the Birmingham jail cell that held Martin Luther King Jr., surrounded by six concrete Dobermans.\n There’s a monument to those murdered at Sandy Hook Elementary, including 26 pairs of flea-market shoes (“I got them for a pretty good price,” he said) and the raging rubber head of Jesse Ventura.\n And everywhere else is welded iron and hand-painted biblical signage and bric-a-brac to overrun a landfill. It seems all but inevitable that Mr. Minter will eventually raise a memorial to the Boston Marathon bombing, although the only clear patch of lawn lies behind the twin towers.\n The African Village also stands among the most endangered art environments: Mr. Minter serves as the site’s artist in residence, curator, docent and groundskeeper, and he just turned 70.\n His installation represents one of the last great “yard shows” in Alabama, said Emily Hanna, curator of the African and American collections at the Birmingham Museum of Art. This coinage describes the culturally distinct and sometimes visionary home displays of the South.\n Artists like Mr. Minter, she said, emerged “during that transition of coming out of sharecropping and doing a variety of jobs during Jim Crow.” Now, Dr. Hanna added, “that snapshot of life in often rural Alabama — that is leaving us.”\n Yet the African Village receives no grants, no institutional support and practically no publicity. The folks who make a pilgrimage to the Minters’ little brick-faced house — maybe 300 in a year — come following rumors and stories and pictures on the Internet.\n  Still, to his mind, Mr. Minter is not alone. His yard show is a homeland for all 11 million Africans shipped off as chattel to the New World. And the pieces exist to tell their story over the centuries, from the griots and warriors of West Africa to the four girls murdered in the bombing at the 16th Street Baptist Church in 1963.\n This year, Birmingham is commemorating the 50th anniversary of that tragedy and some of the signature events of the civil rights era. But for his part, Mr. Minter is in no mood for nostalgia. The local schools, he argues, are more segregated than ever. After a sewer-bonding boondoggle, the county is bankrupt. (Mr. Minter has fashioned a sculpture about this fiasco, too: rubble and a toilet bowl.)\n When he is not in his yard, he keeps a kind of second home on the steps of the county courthouse. He reports there at least a few days a week with his usual kit: combat boots, a red construction helmet that reads “God Loves Peace” and a hand-lettered sign. His latest cause is the partial shuttering of the public hospital called Cooper Green Mercy, which he credits with saving his wife’s life after a stroke and kidney disease.\n “A man’s got obligations,” he said. Which is different from having hope.\n For a while now, Mr. Minter has been convinced that the nation is sitting the wrong way on a donkey, mistaking the hindquarters for the head. “We didn’t move forwards,” he said. “We moved backwards.”\n SINCE HER STROKE, Mrs. Minter, 66, rarely ventures into the garden. This leaves the retired data-entry operator stuck in the house, which she has considered rough and outmoded since the day they moved in.\n “I just never cared for it,” she said, and 40 years have done nothing to change her mind.\n And yet, if the African Village has an ambassador, it would surely be Mrs. Minter. When callers arrive, she will come to the door and offer them an original T-shirt, then send them out to find her husband amid the tangle.\n The trick here is to listen for the ching-chang of the bells on the seven-foot-tall staff Mr. Minter carries through the garden. He discovered the pole on the side of the road, tossed it in the back of his rattletrap Chevy truck, and adorned it with metal wire and lanyards and ribbons. It is a talking stick, and Mr. Minter is an impassioned orator.\n Over the course of a few minutes, his thoughts may turn from the meteorite over Siberia to the environmental racism of freight-train switchyards to the ancient African origins of metallurgy. His time belongs to his guests, and sometimes vice versa. As he put it, “Once you conversate, you gather a lot.”\n Follow him through the yard, past the dedication to the Buffalo Soldiers of the Spanish-American War, and Mr. Minter will stop at a flat stone marker.\n  “My father’s grave is right on the line of this property,” he said. Lawrence Minter was an infantryman in World War I and a skilled mechanic. Back in Alabama, however, the best job he could find was as a caretaker at a white cemetery. He and his wife, Rosie, were responsible for eight children (two others died young), and “he had to take a lot.”\n At first, the family lived on Center Street in the Titusville neighborhood — or, rather, down below in an old pump house. “It ain’t nothing but walls and cold, and we had to go outside to use the bathroom,” he said.\n The black schoolhouse may have been even more dilapidated. “The roof leaking water all the time,” Mr. Minter said. “We had what you would call a spirit that couldn’t be killed. But we learned in an atmosphere that wasn’t what it should have been.”\n  Art was not an escape from this world; if it existed, Mr. Minter didn’t know about it. What thrived was ingenuity, improvisation. “I didn’t have toys,” he said. “I started making stuff with whatever I could get my hands on.”\n A cigar box, perforated with an ice pick and filled with gravel, turned into a rattle. A tree stump, a nail and a 10-foot strip of tin became a twirler-whirler. “It was really just a child mind, inquiring,” he recalled.\n AROUND LUNCHTIME, a white van swung a U-turn on the dead-end street and stopped near the front gate. This was Gilbert Klein, 62, who retired a spell ago from a steel plant. (He also fielded a drag-racing team, running Chryslers. “Most people don’t do that,” he said.) And then a tornado blew his house over, and he was homeless for a couple of years.\n Mr. Minter looked after him during that period, Mr. Klein said. Now that he was back on his feet, he was dealing in one of Birmingham’s new industries: foreclosures. Presently, in fact, he was putting together a grubstake to pick up a furniture set at a one-day clearance sale.\n Mr. Minter disappeared inside for a moment, and when he returned, he pressed a palmful of bills into Mr. Klein’s hand. “I got you in the next two days,” Mr. Klein said. (No one could mistake Mr. Minter for a loan shark.)\n Both men attended one of the better black high schools in Birmingham, Mr. Klein said. But it was hard to conclude that they were being educated for better things. Like his father, Mr. Minter received mechanical training in the Army, after being drafted for Vietnam. And upon his honorable discharge, he, too, settled into a series of low-paying jobs.\n He assembled school furniture until the plant shut down. He learned the trade of auto-body repair, but the dust and paint were punishing. He labored on road crews and construction sites until they went away. And then, at 50-something, he realized that he was retired. (Mr. Minter’s pension evaporated when his old employer closed shop. The couple survives on Mrs. Minter’s small retirement, Social Security and providence.)\n  You could also say that this was when his life’s real work began. One afternoon, as Mr. Minter recalls, he headed outside, gathered the windblown trunks of a gum tree and started carving African totems.\n Mrs. Minter offered neither encouragement nor rebuke. “He told me that it was a vision from God,” she said. “And when someone tells me God talk to him, I don’t interfere.”\n Mr. Minter chimed in: “I was going back to what they were doing in Africa. You know how they say there was a Bronze Age and the Iron Age. There was a wood age. But they never did keep a record of the wood age.”\n Mr. Minter’s connection to Africa was both the animating spirit of his work and a deep vein of mystery. “I haven’t been there,” he said. “I really haven’t studied it.”\n Mrs. Minter was baffled herself. “I don’t know nothing about Africa,” she said. “Not until he started talking to me.”\n Dr. Hanna, the curator, notes that in some African cultures, a man’s ability to work with iron flowed from the spiritual qualities of the metal.\n Mr. Minter sees himself in this tradition. “I got some blacksmith in my blood,” he said. “I’m drawn to iron.”\n And yet his scrap-iron sentinels and oaken icons are also endemic to Alabama, said Lonnie Bradley Holley, 63, an artist and an early champion of the African Village. (Mr. Holley lost his own hilltop environment in Birmingham, a brilliant collection of some 30,000 artworks, after the airport authority condemned his home for a runway extension.)\n These materials, Mr. Holley said, carried the essence of “an industrial city, a city that actually took from the earth the iron ore, then taking from the earth the fire material that was necessary to molt this iron. Then taking from the elements the air that had to be bellowed to cause this fire to get hot enough.”\n To a creative force like Joe Minter, Mr. Holley concluded, the nickname “magic city” is more than just words. It describes something real: the industrial alchemy that makes the art.\n MR. MINTER IS FINISHED with the African Village. Or so he likes to say. In truth, he continues to add to it all the time. In the late fall, he crafted a corrugated-metal memorial to the victims of Hurricane Sandy. A white inner tube represents a radar image of the storm with half-inch PVC pipes spiraling out from the eye.\n “I slowed down,” he will announce. “I done worked like a bee, a termite, an ant.” These days, he added, “I got to take care of my wife.”\n So far, he hasn’t found his way into more than one or two museums. (“Wait until he die off, then he not in the way,” he imagines the art world saying.) But he has no mind to parcel out, say, his model of the Edmund Pettus Bridge, a civil rights landmark.\n “It can’t be broke up,” he declared of the African Village. “It all or nothing.”\n The default plan, it would seem, is the same one that has overtaken all the other yard shows of the Deep South, Dr. Hanna said, “Unless someone steps forward to embrace the care of it, it will return to the earth.”\n Gail Andrews, the director of the Birmingham Museum of Art, expresses a reverence for Mr. Minter’s work. But though she was eyeing one piece for the institution, she said — a Ku Klux Klan figure on a pole — “There was just a part of me that felt it was inappropriate to take anything away from there.”\n Ms. Andrews continued, “Will people have this sense of what these environments were like when they see pieces in the museum?”\n That is to say, how do you replicate the rattle of sheet metal when the wind blows up from the valley? What will happen to the carpet of zinnias that shoot up each April through the boardwalk? Will the ancestors take up residence on a plinth in the contemporary gallery?\n “The experience is to be there and see it with him,” she said.\n For the most part, Mr. Minter agrees. He maintains that the environment should be preserved right where it lies. He imagines three great domes, or maybe pyramids, with marble at the base. “Like a glass mausoleum,” he said. Who will perform this miraculous act of conservation, Mr. Minter cannot say.\n He looked around for his talking stick, and climbed up to a wooden platform. The 12-foot-long causeway spans the Atlantic, he explained. On one side lay Alabama; on the other, Africa — though the two ends looked the same. “When the lord tells me to move, I move,” Mr. Minter said.", "posttime": "2020-05-18 00:37:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "废铁,iron,明特", "title": "“废铁挽歌”(2013)", "title_en": "Scrap-Iron Elegy (2013)", "transed": 1, "url": "https://www.nytimes.com/2013/04/25/garden/joe-minters-african-village-in-america.html", "via": "", "real_tags": ["废铁", "iron", "明特"]}, {"category": "", "categoryclass": "", "imagename": "b7918e4ccc1e21f375ed85dfc1d58003.jpg", "infoid": 1002538, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的消息来源报告说，史诗游戏为虚幻引擎5制作的令人印象深刻的技术演示背后的潜在原因是嘲笑网络开发者。\n据“华盛顿邮报”报道，这一技术演示包括一种新的动态照明系统和一种渲染方法，在形状和纹理上都有更高的几何细节。例如，演示中的单个雕像可以使用3300万个三角形进行渲染，从而使其具有前所未有的细节和视觉密度。\n事实证明，这项令人难以置信的技术的计算优化水平和纯粹的能力是为了取笑网络开发人员，他们在2000美元的MacBook Pro上滚动单页面应用程序时，努力保持15fps的速度，同时享受将相应代码输入基于电子的文本编辑器的延迟800ms。\n“我们对我们的同事很失望，”网络开发者联盟的负责人彼得·伊恩林(Peter Eanline)说。无论是3D游戏开发，还是网络开发，都有一些根本性的问题需要克服。当然，他们通过应用线性代数和物理，在保持高达60fps的4k视频输出的同时，努力实时计算数百万个状态。但与此同时，我们希望他们承认同样具有挑战性的任务，比如用16种不同的颜色突出显示数十行代码，或者在用户关闭绝对定位的div后记住滚动位置，或者决定是通过JS注入CSS，还是使用Kubernetes扩大静态资产集群。\n网络开发者联盟成员创建了一份在线请愿书，将史诗游戏这一潜在的敌意决定公之于众。请愿网站计划于2020年7月上线(约。43天)，一旦节点包更新过程预计完成。", "note_en": "Our sources report that the underlying reason behind the impressive tech demo for Unreal Engine 5  by Epic Games is to ridicule web developers.\n According to the Washington Post, the tech demo includes a new dynamic lighting system and a rendering approach with a much higher geometric detail for both shapes and textures. For example, a single statue in the demo can be rendered with 33 million triangles, giving it a truly unprecedented level of detail and visual density.\n Turns out that the level of computational optimization and sheer power of this incredible technology is meant to make fun of web developers, who struggle to maintain 15fps while scrolling a single-page application on a $2000 MacBook Pro, while enjoying 800ms delays typing the corresponding code into their Electron-based text editors.\n  &#34;We are disappointed with our colleagues,&#34; says the head of Web Developers Union Peter Eanline. &#34;Both 3D game- and web-development have fundamental problems to overcome. Sure, they work hard computing millions of states in real-time by applying linear algebra and physics while maintaining up to 60fps of 4k video output. But at the same time we expect them to acknowledge equally challenging tasks like highlighting dozens of lines of code with 16  different colors, or remembering the scroll position after user closes an absolutely-positioned div, or deciding whether to inject CSS via JS or scale up the static assets cluster with Kubernetes.&#34;\n The Web Developers Union members created an online petition to bring this potentially hostile decision of Epic Games to public light. The petition website is scheduled to go live in July 2020 (in approx. 43 days), as soon as the Node packages updating process is expected to finish.", "posttime": "2020-05-18 00:22:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,嘲笑,engine,网络", "title": "虚幻引擎5是用来嘲笑web开发人员的。", "title_en": "Unreal Engine 5 is meant to ridicule web developers", "transed": 1, "url": "https://www.theolognion.com/unreal-engine-5-is-meant-to-ridicule-web-developers/", "via": "", "real_tags": ["开发", "嘲笑", "engine", "网络"]}, {"category": "", "categoryclass": "", "imagename": "6ff01183d27ef448498b963fd42d3b79.png", "infoid": 1002537, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒住院治疗在许多州都有所下降--这是另一个迹象，表明社会距离在遏制病毒传播方面是有效的。\n重要原因：住院是衡量疫情严重程度的一个重要指标，特别是因为检测不足已经扭曲了其他一些衡量标准。这些数字并不是到处都在下降，任何重新开放的方法都需要谨慎管理，以防止它们再次飙升。\n言外之意：医院需要每天向疾病控制和预防中心报告这些数据，但我们仍然没有实时数字，部分原因是该国的电子健康数据基础设施出现故障。\n然而，一些研究人员-包括明尼苏达大学卡尔森管理学院和COVID跟踪项目的研究人员-正在将州卫生部门的冠状病毒住院情况制作成表格。\n数据显示：在持续提供数据的40个州中，冠状病毒住院在许多州所有占用的医院床位中所占的比例较小，包括康涅狄格州、新泽西州和纽约州等热点地区。\n在任何一个州，被冠状病毒患者占据的病床都不超过25%。\n是的，但是：在几个州，包括伊利诺伊州、明尼苏达州、新墨西哥州和弗吉尼亚州，住院率没有下降，在某些情况下还在上升。\n疾控中心监测的14个州的总住院率似乎仍在攀升。\n下一步是什么：住院治疗是感染的滞后指标，因为人们需要一段时间才会感到不适并寻求重症监护-所以接下来的几周将提供更清晰的图景，说明一些州和医院是否再次遭受重创。\n即使在佛蒙特州这样的州-住院人数很少，积极的社会距离协议-医疗保健官员也在谨慎行事，重新开放企业，重新启动选择性医疗程序。\n缓解措施为我们赢得了我们真正需要的时间，斯蒂芬·莱弗勒(Stephen Leffler)说，他是一名急诊室医生，也是佛蒙特州大学医学中心(University Of Vermont Medical Center)的主席，该中心拥有该州目前五名冠状病毒住院患者中的两名。现在我们重新规划下一阶段，让COVID成为新常态的一部分。", "note_en": "Coronavirus hospitalizations have declined in many states — another indication that social distancing has been effective at curbing the virus&#39; spread.\n Why it matters: Hospitalizations are an important metric to watch to  gauge the severity of the outbreak, especially because testing shortfalls have skewed some other measurements. Those numbers aren&#39;t falling everywhere, and any approach to reopening needs to be carefully managed to prevent them from spiking yet again.\n Between the lines: Hospitals need to report this data to the Centers for Disease Control and Prevention daily, but we still don&#39;t have real-time numbers, due in part to the failures of the country&#39;s electronic health data infrastructure.\n However, some researchers — including those at the  University of Minnesota&#39;s Carlson School of Management and the  COVID Tracking Project — are tabulating COVID-19 hospitalizations from state health departments.\n What the data show: Among the 40 states that have consistently provided data, COVID-19 hospitalizations are taking up a smaller percentage of all occupied hospital beds in many states, including hotspots like Connecticut, New Jersey and New York.\n No more than 25% of hospital beds in any state are occupied by coronavirus patients.\n Yes, but: Hospitalization rates aren&#39;t dropping, and in some cases are rising, in several states, including Illinois, Minnesota, New Mexico and Virginia.\n The aggregate hospitalization rate of  14 states monitored by the CDC also appears to still be cresting.\n What&#39;s next: Hospitalizations are a lagging indicator of infection, because it takes a while for people to feel sick and seek intensive care — so the coming weeks will provide a clearer picture of whether some states and hospitals are getting hammered again.\n Even in states like Vermont — where there have been very few hospitalizations and aggressive social distancing protocols — health care officials are  treading carefully with reopening businesses and restarting elective medical procedures.\n &#34;Mitigation bought us time we really needed,&#34; said Stephen Leffler, an ER doctor and president of the University of Vermont Medical Center, which has two of the state&#39;s five current COVID-19 inpatients. &#34;Now we&#39;re planning for the next phase, which is for COVID to be part of the new normal.&#34;", "posttime": "2020-05-18 00:22:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,住院,hospitalizations", "title": "冠状病毒住院人数下降的地方", "title_en": "Where coronavirus hospitalizations are falling", "transed": 1, "url": "https://www.axios.com/state-by-state-coronavirus-hospitalizations-04da87ed-476e-4dad-84ec-bd5db7a7bce7.html", "via": "", "real_tags": ["冠状病毒", "病毒", "住院"]}, {"category": "", "categoryclass": "", "imagename": "01ad7e64f7bfee7c331afaf30e8b4180.jpg", "infoid": 1002536, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到导航跳到搜索虽然未来永远不能绝对肯定地预测，[1]目前在各个科学领域的理解允许预测一些遥远的未来事件，即使只是在最宽泛的轮廓中。这些领域包括天体物理学，它揭示了行星和恒星是如何形成、相互作用和死亡的；粒子物理学，它揭示了物质在最小尺度上的行为；进化生物学，它预测了生命将如何随着时间的推移而演变；以及板块构造，它显示了大陆在几千年里是如何移动的。\n对地球、太阳系和宇宙未来的所有预测都必须考虑热力学第二定律，该定律规定熵，或可用于做功的能量的损失，必须随着时间的推移而上升。恒星最终会耗尽它们供应的氢燃料并燃烧殆尽。天文物体在引力作用下从其恒星系统抛出行星，与来自星系的恒星系统之间的近距离相遇。[3]。\n物理学家预计，物质本身最终会受到放射性衰变的影响，因为即使是最稳定的材料也会分裂成亚原子粒子。[4]目前的数据表明，宇宙具有平坦的几何形状(或非常接近平坦)，因此在有限的时间后不会自行坍塌[5]，而无限的未来允许大量不太可能发生的事件的发生，例如玻尔兹曼大脑的形成。[6]。\n这里展示的时间线涵盖了从11千年开始到未来最遥远的时间范围内的事件。书中列出了一些可供选择的未来事件，以解释仍未解决的问题，例如人类是否会灭绝，质子是否会衰变，以及当太阳膨胀成为红巨星时，地球是否会幸存下来。\n如果威尔克斯冰下盆地的破裂在接下来的几个世纪里危及东南极冰盖，那么要完全融化就需要这么长的时间。海平面将上升3到4米。[7]全球变暖的潜在长期影响之一，这与西南极冰盖的短期威胁是分开的。\n红色超大恒星心宿二很可能已经在超新星中爆炸了。在白天，地球上应该很容易看到爆炸。[8]。\n根据撒哈拉泵理论，地球两极的进动将使北非季风向北移动到足够远的地方，使撒哈拉变回热带气候，就像5000-10000年前一样。[9][10]。\n随着火星在其米兰科维奇循环的近日点进动方面达到北半球变暖的峰值，火星北部的极地冰盖可能会消退。[11][12]\n小红矮星罗斯248将在距离地球3.024光年的范围内通过，成为距离太阳最近的恒星。[13]它将在大约8000年后消退，首先是半人马座阿尔法星，然后是格利塞斯445，成为最近的恒星[13](见时间线)。\n根据Berger和Loutre的说法，目前的间冰期将结束，[14]不管人为全球变暖的影响如何，地球将重新进入当前冰期的冰期。尼亚加拉瀑布将侵蚀伊利湖剩余的32公里，将不复存在。[15]。\n加拿大地盾的许多冰川湖泊将被冰川后的反弹和侵蚀所抹去。[16]。\n由于月球潮汐减慢了地球的自转速度，用于天文计时的一天的长度达到了大约86401SI秒。在现在的计时系统下，要么每一天都需要在时钟上增加一个闰秒，要么到那时，为了补偿，一天的长度必须正式延长一SI秒。[17]。\n由于恒星在银河系中的运动，恒星在天球上的自然运动使许多星座变得无法辨认。[18]。\n地球可能已经经历了一次足够大的超级火山喷发，喷发出400公里(96立方英里)的岩浆。相比之下，伊利湖为484公里3(116立方米)。[20]。\n北美土生土长的蚯蚓，如巨型蚯蚓，将自然地通过美国上中西部向北传播到加拿大-美国边境，从劳伦蒂冰盖冰川(38°N到49°N)恢复，假设迁徙速度为每年10米。[21](然而，人类已经以更短的时间引进了北美的非本土入侵蚯蚓，对该地区的生态系统造成了冲击。)。\n作为全球变暖的长期影响之一，10%的人为二氧化碳仍将保持在稳定的大气中。[22]\nLōʻIhi火山是夏威夷-帝王海山链中最年轻的火山，它将浮出海面，成为一个新的火山岛。[23]。\n在未来几十万年的某个时候，沃尔夫-瑞耶星WR104可能会爆发成一颗超新星。WR104的旋转速度足以产生伽马射线暴的可能性很小，而这样的伽马射线暴对地球上的生命构成威胁的可能性更小。[24][25]。\n假设这是无法避免的，地球很可能已经被一颗直径约1公里的小行星击中。[26][26]。\n南达科他州荒地国家公园崎岖的地形将被完全侵蚀。[27][27]。\n亚利桑那州的一个大型陨石坑，被认为是同类陨石坑中最新鲜的，将会被侵蚀掉。[28][28]。\n地球可能已经经历了一次足够大的超级火山喷发，喷发了3200公里(770立方英里)的岩浆，这一事件可与7.5万年前的托巴超级喷发相提并论。[20]。\n最高估计时间，直到红色超大恒星参宿四在超新星中爆炸。至少在几个月内，这颗超新星将在白天在地球上可见。研究表明，这颗超新星将在一百万年内发生，甚至可能在接下来的十万年内发生。[29][30][30]。\n恒星Gliese 710在离开之前将经过9000个AU(距离太阳0.14光年)。这将对奥尔特云的成员产生引力扰动，奥尔特云是太阳系边缘的一个由冰体组成的光环，此后增加了内太阳系发生彗星撞击的可能性。[32][font=宋体]\n从人为造成的海洋酸化中恢复珊瑚礁生态系统的估计时间；在大约6500万年前发生的酸化事件之后恢复海洋生态系统花费了类似的时间。[33][33]。\n大峡谷将进一步侵蚀，略有加深，但主要是扩大为科罗拉多河周围的宽阔山谷。[34]。\n当前半人马的平均轨道半衰期，由于几个外行星的引力相互作用而不稳定。[35]请参阅对著名半人马的预测。\n不断扩大的东非裂谷被红海淹没，导致一个新的洋盆将非洲大陆和非洲板块分割成新形成的努比亚板块和索马里板块。\n估计生物多样性在可能的全新世灭绝后完全恢复的时间，如果它与之前五次重大灭绝事件的规模相当的话。[37]即使没有大规模灭绝，到这个时候，大多数现有物种将通过背景灭绝速度消失，许多分支逐渐演变成新的形式。[38][39][39]。\n根据克里斯托弗·R·斯科特的说法，圣安德烈亚斯断层的运动将导致加利福尼亚州海湾涌入中央山谷。这将在北美西海岸形成一个新的内陆海。[40]。\n根据克里斯托弗·R·斯科特(Christopher R.Scotese)的说法，圣安德烈亚斯断层的移动将导致洛杉矶和旧金山目前的位置合并。[40]加州海岸将开始被潜入阿留申海沟。[42]非洲与欧亚大陆的碰撞关闭了地中海盆地，形成了类似喜马拉雅山脉的山脉。[43]。\n阿巴拉契亚山脉的山峰将在很大程度上被侵蚀，风化单位为5.7个布诺夫单位，尽管地势实际上会上升，因为地区山谷加深的速度是这个速度的两倍。[45]\n假设60个布诺夫单位，加拿大落基山脉将被侵蚀成平原。[46]美国南部落基山脉的侵蚀速度稍慢。[47]。\n大岛将成为目前夏威夷群岛中最后一个沉入海面的岛屿，而一个最近形成的新夏威夷群岛链将取而代之。[49]。\n假设这是无法避免的，地球很可能已经被一颗大小与6600万年前引发K-PG灭绝的小行星相提并论。[50][50]。\n根据克里斯托弗·R·斯科特(Christopher R.Scotese)创建的泛古比邻模型(Pangaea Proxima Model)，大西洋将开放一个新的俯冲区，美洲将开始向非洲汇聚。[40]。\n由于地球自转的逐渐减慢，地球上的一天将比今天多一个小时。[53][font=宋体]。\n由于李亚普诺夫时间的限制，在比这更长的时间跨度内预测行星的轨道是不可能的。[54][54]。\n根据克里斯托弗·R·斯科特的说法，由于北美西海岸的北移，加利福尼亚州海岸将与阿拉斯加相撞。[40]。\n地球上的所有大陆都可能融合成一个超级大陆。这一构型的三种可能排列被称为阿玛西亚、新盘古和终极盘古。[40]这可能会导致冰川期，降低海平面，增加氧气水平，进一步降低全球气温。[57][58][58]\n快速的生物进化可能是由于超大陆的形成，导致温度较低，氧气水平较高。[58][58]。\n估计金星的地幔温度达到最高温度的时间。然后，在大约1亿年的时间里，发生了重大的俯冲，地壳被循环利用。[60][font=宋体]。\n根据保罗·F·霍夫曼(Paul F.Hoffman)最先提出的外向模型，太平洋将完全关闭。[61][62][56]。\n超级大陆(终极盘古大陆、新大陆或阿马西亚大陆)很可能已经分裂。[56]这可能会导致全球气温升高，类似于白垩纪时期。[58][58]。\n据估计，伽马射线爆发(即巨大的高能超新星)发生在距离地球6500光年的范围内；距离地球足够近，其射线足以影响地球的臭氧层，并有可能引发大规模物种灭绝，假设之前的一次此类爆炸引发了奥陶纪-志留纪物种灭绝事件的假设是正确的。然而，超新星必须相对于地球精确定向才能产生任何负面影响。[63][font=宋体]。\n潮汐加速使月球距离地球足够远，以至于不再可能发生日全食。[64]。\n太阳光度的增加开始扰乱碳酸盐-硅酸盐的循环；更高的光度增加了地表岩石的风化，从而将二氧化碳以碳酸盐的形式困在地下。随着水从地球表面蒸发，岩石变硬，导致板块构造减速，最终在海洋完全蒸发后停止。随着火山作用的减少，将碳循环到地球大气层中的活动减少，二氧化碳水平开始下降。[65]到这个时候，二氧化碳水平将下降到C3光合作用不再可能的地步。所有利用C3光合作用的植物(≈占现在物种的99%)都会死亡。[66][中英文对照]。\n大多数植物的死亡将导致大气中氧气的减少，从而允许更多破坏DNA的紫外线辐射到达地表。气温上升将增加大气中的化学反应，进一步降低氧气水平。飞行的动物会过得更好，因为它们有能力长途旅行，寻找更凉爽的温度。[67]许多动物可能被赶到极地或可能被赶到地下。由于强烈的高温和辐射，这些生物在极地夜晚变得活跃，在极地白天冬眠。大部分土地将成为一片贫瘠的沙漠，动植物将主要在海洋中找到。[67][67]\n二氧化碳水平下降到C4光合作用不再可能的地步。[66]如果没有植物来循环大气中的氧气，自由氧和臭氧层将从大气中消失，从而使致命的紫外光强度达到地表。在“地球的生与死”一书中，作者彼得·D·沃德和唐纳德·布朗利指出，一些动物可能能够在海洋中生存。然而，最终，所有的多细胞生命都将灭绝。[68]在此之后，地球上仅存的生命将是单细胞有机体。\n海洋质量的27%将被俯冲到地幔中。如果这种情况不受干扰地继续下去，它将达到平衡，65%的地表水将留在地表。[69][font=宋体]。\n太阳的光度上升了10%，导致地球表面温度平均达到约320摄氏度(47摄氏度；116华氏度)。大气将变成潮湿的温室，导致海洋蒸发失控。[65]这将导致板块构造完全停止，如果在此之前没有停止的话。[71]两极可能仍有零星的水，让人们可以过上简朴的生活。[72][73][73]。\n假设即使二氧化碳水平极低，某种形式的光合作用也是可能的，直到所有植物生命灭绝，这都是一个很高的估计。如果这是可能的，从现在开始，气温上升将使复杂的生物圈变得不可持续。[74][75][76]。\n太阳亮度的上升导致其星际宜居区向外移动；随着火星大气中二氧化碳的增加，火星表面温度上升到与冰河时期地球相似的水平。[68][77][77]。\n高估计，直到地球的海洋蒸发，如果大气压力通过氮循环降低。[78][78]。\n如果内核继续以目前每年1毫米(0.039英寸)的速度增长，地球的外核就会冻结。[79]如果没有它的液态外核，地球的磁场就会关闭，太阳发出的带电粒子会逐渐耗尽大气层。[82][82]。\n太阳的最高表面温度将达到5820K，从那时起，太阳将逐渐变冷，而光度将继续增加。[70][font=宋体]\n地球表面温度达到约420摄氏度(147摄氏度；296华氏度)，即使在两极也是如此。在这一点上，所有生命，现在减少到孤立的，分散的微环境，如高海拔湖泊或洞穴中的单细胞群体，都将灭绝。[65][83][83]。\n在这一点之前，地球被恒星相遇抛入星际空间的可能性约为1/10万，然后被另一颗恒星捕获的可能性为1/300万。如果发生这种情况，假设生命在星际旅行中幸存下来，那么生命可能会持续更长的时间。[84][中英文对照]。\n月球与地球距离的增加减弱了它对地球轴向倾斜的稳定作用的中点。因此，地球真正的极地漂移变得混乱和极端，由于轴向倾斜的变化，导致了地球气候的戏剧性变化。[85][85]。\n木星的引力可能会使水星的轨道变得如此偏心，以至于与金星相撞，从而使内太阳系陷入混乱的可能性为1%。可能的情况包括水星与太阳相撞，被太阳系抛出，或与地球相撞。[86][中英文对照]。\n目前存在于海洋中的所有水(如果不是更早地流失)都会蒸发。大量富含水的大气层造成的温室效应，再加上太阳的光度比现值高出大约35-40%，将导致地球表面温度上升到1400摄氏度(1,130摄氏度；2,060华氏度)-足以融化一些地表岩石。[71][78][87][88]与今天的金星相比，地球未来的这段时期通常是[量化的]，但温度实际上是今天金星温度的两倍左右，在这个温度下，表面将部分熔化，[89]而金星目前的表面可能大部分是固体的。金星在这个时候也可能会急剧升温，很可能比地球热得多(因为它离太阳更近)。\n海王星的卫星海王星(Triton)穿过了该行星的罗氏极限，有可能瓦解成一个类似于土星的行星环系。\n仙女座星系与银河系相撞的中点，之后银河系将合并形成一个名为“米尔科梅达”的星系。[91]太阳系被抛出的可能性也很小。[92]太阳系的行星几乎肯定不会受到这些事件的干扰。[94][95][96]。\n火星到达的太阳流量与45亿年前地球第一次形成时的太阳流量相同，也就是45亿年前的今天。[77][font=宋体]\n随着核心的氢气供应耗尽，太阳离开主序，开始演化为红巨星。[97][font=宋体]。\n火星今天达到与地球相同的太阳辐射通量，之后它将遭受与地球类似的命运，如上所述。[77][font=宋体]。\n地球和月球很可能是在太阳到达其红巨星阶段的尖端和其最大半径256倍于现值之前落入太阳而被摧毁的。[97][注4]在最后一次碰撞之前，月球可能在地球的罗氏极限以下盘旋，形成一个碎片环，其中大部分落在地球表面。[98][font=宋体]。\n太阳到达赫茨斯普林格-罗素图的红巨型分支的顶端，达到其最大半径是现在值的256倍。[100]在这个过程中，水星、金星，很可能还有地球都会被摧毁。[97][font=宋体]。\n太阳变成了一颗碳氧白矮星，质量约为现在的54.05%。[97]在这一点上，如果地球以某种方式幸存下来，由于白矮星太阳释放的能量比今天少得多，行星表面以及太阳系中其他剩余行星的温度将开始迅速下降，这是因为白矮星太阳释放的能量比今天少得多，所以在这一点上，如果地球以某种方式幸存下来，地球表面的温度以及太阳系中其他剩余行星的温度将开始迅速下降。\n大撕裂场景中的宇宙末日，假设暗能量模型为w=−1.5。[104]如果暗能量密度小于-1，那么宇宙的膨胀将继续加速，可观测的宇宙将继续变小。在RIP爆发前大约2亿年，像Local Group或Sculptor Group这样的星系团将被摧毁。在撕裂前6000万年，所有星系都将开始失去边缘的恒星，并将在另一个4000万年后完全解体。在末日前三个月，所有的恒星系统都将在引力作用下脱离束缚，行星将飞向迅速膨胀的宇宙。在末日前30分钟，行星、恒星、小行星，甚至像中子星和黑洞这样的极端物体都将蒸发成原子。在结束前10−19秒，原子会分裂。最终，一旦RIP达到普朗克尺度，宇宙弦将会解体，时空结构也会随之解体。当所有的距离都变得无限大时，宇宙将进入一个撕裂的奇点。而所有物质都是无限集中的，在撕裂奇点中，所有的物质都集中在一个碎裂的奇点上，而在一个撕裂的奇点中，所有的物质都是无限集中的，所有的物质都集中在一个撕裂的奇点中。\n..", "note_en": "Jump to navigation  Jump to search  While the future can never be predicted with absolute certainty,  [1] present understanding in various  scientific fields allows for the prediction of some far-future events, if only in the broadest outline. These fields include  astrophysics, which has revealed how  planets and  stars form, interact, and die;  particle physics, which has revealed how matter behaves at the smallest scales;  evolutionary biology, which predicts how life will evolve over time; and  plate tectonics, which shows how continents shift over millennia.\n All projections of the  future of Earth,  the Solar System, and  the universe must account for the  second law of thermodynamics, which states that  entropy, or a loss of the energy available to do work, must rise over time.  Stars will eventually exhaust their supply of  hydrogen fuel and burn out. Close encounters between astronomical objects gravitationally fling planets from their star systems, and star systems from galaxies.  [3]\n Physicists expect that matter itself will eventually come under the influence of  radioactive decay, as even the most stable materials break apart into subatomic particles.  [4] Current data suggest that the  universe has a flat geometry (or very close to flat), and thus will not  collapse in on itself after a finite time,  [5] and the infinite future allows for the occurrence of a number of massively improbable events, such as the formation of  Boltzmann brains.  [6]\n The timelines displayed here cover events from  the beginning of the 11th millennium to the furthest reaches of future time. A number of alternative future events are listed to account for questions still unresolved, such as whether  humans will become extinct, whether  protons decay, and whether the Earth survives when the Sun expands to become a  red giant.\n      If a failure of the  Wilkes Subglacial Basin &#34;ice plug&#34; in the next few centuries were to endanger the  East Antarctic Ice Sheet, it would take up to this long to melt completely.  Sea levels would rise 3 to 4 metres.  [7] One of the potential  long-term effects of global warming, this is separate from the shorter-term threat of the  West Antarctic Ice Sheet.\n The  red supergiant star  Antares will likely have exploded in a  supernova. The explosion should be easily visible on Earth in daylight.  [8]\n According to the  Sahara pump theory, the  precession of Earth&#39;s poles will move the  North African Monsoon far enough north to convert the  Sahara back into having a tropical climate,  as it had 5,000–10,000 years ago.  [9]  [10]\n The northern  Martian polar ice cap could recede as  Mars reaches a warming peak of the northern hemisphere during the c. 50,000-year   perihelion precession aspect of its   Milankovitch cycle.  [11]  [12]\n The small  red dwarf  Ross 248 will pass within 3.024 light-years of Earth, becoming the closest star to the Sun.  [13] It will recede after about 8,000 years, making first  Alpha Centauri (again) and then  Gliese 445 the nearest stars  [13] ( see timeline).\n According to Berger and Loutre, the current  interglacial period will end,  [14] sending the Earth back into a  glacial period of the current  ice age, regardless of the effects of anthropogenic  global warming. The  Niagara Falls will have eroded away the remaining 32 km to  Lake Erie, and will cease to exist.  [15]\n The many  glacial lakes of the  Canadian Shield will have been erased by  post-glacial rebound and erosion.  [16]\n The length of the   day used for astronomical timekeeping reaches about 86,401  SI seconds due to  lunar tides decelerating the Earth&#39;s rotation. Under the present-day timekeeping system, either a  leap second would need to be added to the clock every single day, or else by then, in order to compensate, the length of the day would have had to have been officially lengthened by one SI second.  [17]\n The  proper motion of stars across the  celestial sphere, which results from their movement through the  Milky Way, renders many of the  constellations unrecognisable.  [18]\n  Earth will likely have undergone a  supervolcanic eruption large enough to erupt 400 km 3 (96 cubic miles) of  magma. For comparison,  Lake Erie is 484 km 3 (116 cu mi).  [20]\n Native North American  earthworms, such as  Megascolecidae, will have naturally spread north through the United States  Upper Midwest to the   Canada–US border, recovering from the  Laurentide Ice Sheet glaciation (38°N to 49°N), assuming a migration rate of 10 metres per year.  [21] (However, humans have already introduced non-native  invasive earthworms of North America on a much shorter timescale, causing a shock to the regional  ecosystem.)\n As one of the  long-term effects of global warming, 10% of   anthropogenic carbon dioxide will still remain in a stabilized atmosphere.  [22]\n Lōʻihi, the youngest volcano in the  Hawaiian–Emperor seamount chain, will rise above the surface of the ocean and become a new   volcanic island.  [23]\n At some point in the next few hundred thousand years, the  Wolf–Rayet star  WR 104 may explode in a  supernova. There is a small chance WR 104 is spinning fast enough to produce a  gamma-ray burst, and an even smaller chance that such a GRB could pose a threat to life on Earth.  [24]  [25]\n Earth will likely have been hit by an asteroid of roughly 1 km in diameter,  assuming that that cannot be averted.  [26]\n The rugged terrain of  Badlands National Park in  South Dakota will have eroded away completely.  [27]\n Meteor Crater, a large  impact crater in Arizona considered the &#34;freshest&#34; of its kind, will have eroded away.  [28]\n Earth will likely have undergone a   supervolcanic eruption large enough to erupt 3,200 km 3 (770 cubic miles) of magma, an event comparable to the  Toba supereruption 75,000 years ago.  [20]\n Highest estimated time until the  red supergiant star  Betelgeuse explodes in a  supernova. For at least a few months, the supernova will be visible on Earth in daylight. Studies suggest this supernova will occur within a million years, and perhaps even as little as the next 100,000 years.  [29]  [30]\n  The star  Gliese 710 will pass as close as 9,000 AU (0.14 light-years to the Sun) before moving away. This will gravitationally  perturb members of the  Oort cloud, a halo of icy bodies orbiting at the edge of the Solar System, thereafter raising the likelihood of a cometary impact in the inner Solar System.  [32]\n Estimated time for the recovery of   coral-reef ecosystems from human-caused  ocean acidification; the recovery of marine ecosystems after the acidification event that occurred about 65 million years ago took a similar length of time.  [33]\n The  Grand Canyon will erode further, deepening slightly, but principally widening into a broad valley surrounding the  Colorado River.  [34]\n Average orbital half-life of current   centaurs, that are unstable because of gravitational interaction of the several  outer planets.  [35] See  predictions for notable centaurs.\n The widening  East African Rift valley is flooded by the  Red Sea, causing a new ocean basin to divide the continent of  Africa  [36] and the  African Plate into the newly formed Nubian Plate and the  Somali Plate.\n Estimated time for full recovery of  biodiversity after a potential  Holocene extinction, if it were on the scale of the five previous   major extinction events.  [37] Even without a mass extinction, by this time most current species will have disappeared through the  background extinction rate, with many  clades gradually evolving into new forms.  [38]  [39]\n  According to  Christopher R. Scotese, the movement of the  San Andreas Fault will cause the  Gulf of California to flood into the  Central Valley. This will form a new inland sea on the  West Coast North America.  [40]\n  According to Christopher R. Scotese, the movement of the  San Andreas Fault will cause the current locations of Los Angeles and San Francisco to merge.  [40] The Californian coast will begin to be subducted into the  Aleutian Trench.  [42] Africa&#39;s collision with  Eurasia closes the  Mediterranean Basin and creates a mountain range similar to the  Himalayas.  [43]\n The  Appalachian Mountains peaks will largely erode away,  [44] weathering at 5.7  Bubnoff units, although topography will actually rise as regional  valleys deepen at twice this rate.  [45]\n The  Canadian Rockies will erode away to a plain, assuming a rate of 60  Bubnoff units.  [46] The  Southern Rockies in the United States are eroding at a somewhat slower rate.  [47]\n  The  Big Island will have become the last of the current  Hawaiian Islands to sink beneath the surface of the ocean, while a more recently formed chain of &#34;new Hawaiian Islands&#34; will then have emerged in their place.  [49]\n Earth will likely have been hit by an asteroid comparable in size to the one that triggered the  K–Pg extinction 66 million years ago,  assuming this cannot be averted.  [50]\n According to the Pangaea Proxima Model created by Christopher R. Scotese, a new subduction zone will open in the Atlantic Ocean and the Americas will begin to converge back toward Africa.  [40]\n   Due to the gradual slowing down of Earth&#39;s rotation, a day on Earth will be one hour longer than it is today.  [53]\n Prediction of the orbits of the planets is impossible over greater time spans than this, due to the limitations of  Lyapunov time.  [54]\n  According to Christopher R. Scotese, due to the northward movement of the West Coast of North America, the coast of California will collide with Alaska.  [40]\n All the continents on Earth may fuse into a  supercontinent. Three potential arrangements of this configuration have been dubbed   Amasia,  Novopangaea, and  Pangaea Ultima.  [40]  [56] This will likely result in a glacial period, lowering sea-levels and increasing oxygen levels, further lowering global temperatures.  [57]  [58]\n Rapid  biological evolution may occur due to the formation of a supercontinent causing lower temperatures and higher oxygen levels.  [58]\n  Estimated time for  Venus&#39;s mantle temperature to reach its maximum. Then, over a period of about 100 million years, major subduction occurs and the crust is recycled.  [60]\n According to the extroversion model first developed by  Paul F. Hoffman, the  Pacific Ocean will close completely.  [61]  [62]  [56]\n The supercontinent (Pangaea Ultima, Novopangaea, or Amasia) will likely have rifted apart.  [56] This will likely result in higher global temperatures, similar to the  Cretaceous period.  [58]\n Estimated time until a  gamma-ray burst, or massive, hyperenergetic supernova, occurs within 6,500 light-years of Earth; close enough for its rays to affect Earth&#39;s  ozone layer and potentially trigger a  mass extinction, assuming the hypothesis is correct that a previous such explosion triggered the   Ordovician–Silurian extinction event. However, the supernova would have to be precisely oriented relative to Earth to have any negative effect.  [63]\n Tidal acceleration moves the  Moon far enough from Earth that total  solar eclipses are no longer possible.  [64]\n The Sun&#39;s increasing luminosity begins to disrupt the  carbonate–silicate cycle; higher luminosity increases  weathering of surface rocks, which traps  carbon dioxide in the ground as carbonate. As water evaporates from the Earth&#39;s surface, rocks harden, causing  plate tectonics to slow and eventually stop once the oceans evaporate completely. With less volcanism to recycle carbon into the Earth&#39;s atmosphere, carbon-dioxide levels begin to fall.  [65] By this time, carbon dioxide levels will fall to the point at which  C 3 photosynthesis is no longer possible. All plants that utilize C 3 photosynthesis (≈99 percent of present-day species) will die.  [66]\n The death of most  plant life will result in less  oxygen in the  atmosphere, allowing for more  DNA-damaging  ultraviolet radiation to reach the surface. The rising temperatures will increase chemical reactions in the atmosphere, further lowering oxygen levels. Flying animals would be better off because of their ability to travel large distances looking for cooler temperatures.  [67] Many animals may be driven to the poles or possibly underground. These creatures would become active during the  polar night and hibernate during the  polar day due to the intense heat and radiation. Much of the land would become a barren desert, and plants and animals would primarily be found in the oceans.  [67]\n Carbon-dioxide levels fall to the point at which  C 4 photosynthesis is no longer possible.  [66] Without plant life to recycle oxygen in the atmosphere, free oxygen and the ozone layer will disappear from the atmosphere allowing for intense levels of deadly UV light to reach the surface. In the book  The Life and Death of Planet Earth, authors  Peter D. Ward and  Donald Brownlee state that some animal life may be able to survive in the oceans. Eventually, however, all multicellular life will die out.  [68] The only life left on the Earth after this will be single-celled organisms.\n 27% of the ocean&#39;s mass will have been subducted into the mantle. If this were to continue uninterrupted, it would reach an equilibrium where 65% of the surface water would remain at the surface.  [69]\n The Sun&#39;s luminosity has risen by 10%, causing Earth&#39;s surface temperatures to reach an average of c. 320 K (47 °C; 116 °F). The atmosphere will become a &#34;moist greenhouse&#34;, resulting in a runaway evaporation of the oceans.  [65]  [70] This would cause  plate tectonics to stop completely, if not already stopped before this time.  [71] Pockets of water may still be present at the poles, allowing abodes for simple life.  [72]  [73]\n High estimate until all plant life dies out, assuming some form of photosynthesis is possible despite extremely low carbon-dioxide levels. If this is possible, rising temperatures will make a complex  biosphere unsustainable from this point on.  [74]  [75]  [76]\n  The Sun&#39;s rising luminosity causes its  circumstellar habitable zone to move outwards; as  carbon dioxide rises in  Mars&#39;s atmosphere, its surface temperature rises to levels akin to Earth during the  ice age.  [68]  [77]\n  High estimate until the Earth&#39;s oceans evaporate if the atmospheric pressure were to decrease via the  nitrogen cycle.  [78]\n The Earth&#39;s  outer core freezes if the  inner core continues to grow at its current rate of 1 mm (0.039 in) per year.  [79]  [80] Without its liquid outer core, the  Earth&#39;s magnetic field shuts down,  [81] and charged particles emanating from the  Sun gradually deplete the atmosphere.  [82]\n The Sun will have reached a maximum surface temperature of 5,820 K. From then on, it will become gradually cooler while its luminosity will continue to increase.  [70]\n Earth&#39;s surface temperature reaches c. 420 K (147 °C; 296 °F), even at the poles. At this point, all life, now reduced to unicellular colonies in isolated, scattered microenvironments such as high-altitude lakes or caves, will go extinct.  [65]  [83]\n There is a roughly 1-in-100,000 chance that the Earth might be ejected into interstellar space by a stellar encounter before this point, and a 1-in-3-million chance that it will then be captured by another star. Were this to happen, life, assuming it survived the interstellar journey, could potentially continue for far longer.  [84]\n Median point at which the Moon&#39;s increasing distance from the Earth lessens its stabilising effect on the Earth&#39;s  axial tilt. As a consequence, Earth&#39;s  true polar wander becomes chaotic and extreme, leading to dramatic shifts in the planet&#39;s climate due to the changing axial tilt.  [85]\n 1% chance that  Jupiter&#39;s gravity may make  Mercury&#39;s orbit so  eccentric as to collide with  Venus, sending the inner Solar System into chaos. Possible scenarios include Mercury colliding with the Sun, being ejected from the Solar System, or colliding with Earth.  [86]\n All water currently present in oceans (if not lost earlier) evaporates. The  greenhouse effect caused by the massive, water-rich atmosphere, combined with the Sun&#39;s luminosity reaching roughly 35–40% above its present value, will result in Earth&#39;s surface temperature rising to 1,400 K (1,130 °C; 2,060 °F) – hot enough to melt some surface rock.  [71]  [78]  [87]  [88] This period in Earth&#39;s future is often [   quantify] compared to Venus today, but the temperature is actually around two times the temperature on Venus today, and at this temperature the surface will be partially molten,  [89] while Venus probably has a mostly solid surface at present. Venus will also probably drastically heat up at this time as well, most likely being much hotter than Earth will be (as it is closer to the Sun).\n Neptune&#39;s moon  Triton falls through the planet&#39;s  Roche limit, potentially disintegrating into a planetary  ring system similar to  Saturn&#39;s.  [90]\n Median point by which the  Andromeda Galaxy will have  collided with the  Milky Way, which will thereafter merge to form a galaxy dubbed &#34;Milkomeda&#34;.  [91] There is also a small chance of the Solar System being ejected.  [92]  [93] The planets of the Solar System will almost certainly not be disturbed by these events.  [94]  [95]  [96]\n Mars reaches the same  solar flux the Earth did when it first formed, 4.5 billion years ago from today.  [77]\n With the hydrogen supply exhausted at its core, the Sun leaves the  main sequence and begins to  evolve into a  red giant.  [97]\n Mars reaches the same solar radiation flux as Earth today, after which it will suffer a similar fate to the Earth as described above.  [77]\n  The Earth and Moon are very likely destroyed by falling into the Sun, just before the Sun reaches the tip of its  red giant phase and its maximum radius of 256 times the present-day value.  [97]  [note 4] Before the final collision, the Moon possibly spirals below Earth&#39;s  Roche limit, breaking into a ring of debris, most of which falls to the Earth&#39;s surface.  [98]\n The Sun reaches the tip of the red-giant branch of the  Hertzsprung–Russell diagram, achieving its maximum radius of 256 times the present-day value.  [100] In the process,  Mercury,  Venus, and very likely Earth are destroyed.  [97]\n The Sun becomes a carbon-oxygen  white dwarf with about 54.05% its present mass.  [97]  [101]  [102]  [103] At this point, if somehow the Earth survives, temperatures on the surface of the planet, as well as other remaining planets in the Solar System, will begin dropping rapidly, due to the white dwarf Sun emitting much less energy than it does today.\n The end of the Universe in the  Big Rip scenario, assuming a model of  dark energy with   w = −1.5.  [104] If the density of  dark energy is less than -1, then the  Universe&#39;s expansion would continue to accelerate and the  Observable Universe would continue to get smaller. Around 200 million years before the rip, galaxy clusters like the  Local Group or the  Sculptor Group would be destroyed. Sixty million years before the rip, all galaxies will begin to lose stars around their edges and will completely disintegrate in another 40 million years. Three months before the end, all star systems will become gravitationally unbound, and planets will fly off into the rapidly expanding universe. Thirty minutes before the end,  planets,  stars,  asteroids and even extreme objects like  neutron stars and  black holes will evaporate into  atoms. 10 −19 seconds before the end, atoms would break apart. Ultimately, once rip reaches the  Planck scale, cosmic strings would be disintegrated as well as the fabric of  spacetime itself. The universe would enter into a &#34;rip singularity&#34; when all distances become infinitely large. Whereas a &#34;crunch singularity&#34; all matter is infinitely concentrated, in a &#34;rip singularity&#34; all \n......", "posttime": "2020-05-18 00:20:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "未来,timeline,地球", "title": "遥远未来的时间表", "title_en": "Timeline of the Far Future", "transed": 1, "url": "https://en.wikipedia.org/wiki/Timeline_of_the_far_future", "via": "", "real_tags": ["未来", "timeline", "地球"]}, {"category": "", "categoryclass": "", "imagename": "454b5b66d7e702b782396085161e829b.png", "infoid": 1002535, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很多在2000年初上网的人都记得一种叫做RSS的东西。它代表着真正简单的联合，它允许内容创建者以一种易于理解的格式向世界发布更新。\n这个想法-打字似乎很奇怪-是世界上数以百万计的人可以创造和发布想法、思想和内容…。然后，喜欢这些内容的人会将资源收集到阅读器中，这个阅读器被称为RSS阅读器。\n谷歌阅读器是首选的阅读器，它非常出色。人们为他们精心策划的一组资源感到自豪，我们写了很多关于如何最好地组织您的提要以实现最高效率的文章。\n这是创作者和消费者之间的直接联系。通过将某人的提要添加到您的RSS阅读器中，您是在说，“是的，我愿意订阅您对现实的解释。”\n通过策划读者中的提要，你就是在策划你的世界观。这是由成百上千个单独的声音组成的。\n我们不确定是谁先袭击的--是我们还是他们--但我们知道是我们烧焦了天空。\n目前还不清楚到底是什么摧毁了RSS，但谷歌关闭谷歌阅读器肯定无济于事。另一个因素是像Slashdot、Digg和Reddit这样的聚合网站的崛起，它们诱人地承担起了展示最佳内容的重担。\n因此，不必策划自己的提要，您只需登陆一个网站，就可以看到“最好的”内容。\n当然，Reddit很棒。其他聚合器也是如此。但我想他们偷了我们的东西。首先，他们打破了读者和创作者之间的直接联系，让Digg向你展示了一个故事，而不是你关注了多年的克里斯汀。其次，它消除了照看自己的投入花园的需要。\n获得某样东西所需的努力越少，它对你的价值就越小。\n我相信社交媒体网站也有影响，因为就像聚合器一样，它们是独一无二的酒吧，当你出现时，它们保证了一些令人兴奋的东西。共同点是从更多的努力到更少的努力。这就像在WALL-E中，我们变成病态肥胖的人，坐在气垫椅上在刺激之间穿梭。\n好了，又到了园艺的时候了。现在是回到RSS的时候了。\n谷歌阅读器(Google Reader)还是死了，但如果我摘掉怀旧眼镜，Feedly现在可能比Reader以前更好了。我已经用了好几年了。\n我认为RSS策展就像是自己做饭的做法。挑选特定的配料，使用定制工具准备它们，然后消费输出，这是一件神奇的事情。\n或者--也许是一个更好的比喻--培养一个书架。唯一不同的是，书架通常是用自己喜欢的书建造的，而我认为RSS阅读器也应该设计成“接触到其他人”。\n重点是，RSS阅读器的管理迫使人们思考他们的输入，并在这样做的过程中锻炼他们的价值观。您是否正在构建适合您的输入列表？你是否包括你尊重但不同意的人？如果是你根本无法忍受的人呢？\n你选择包括的内容不仅会定义你如何看待世界，而且还会让你更好地理解他人的观点。\n然后，作为最重要的一步，停止访问纽约时报，CNN，Reddit，黑客新闻，龙虾，以及你整天轮流浏览的所有其他网站。\n这不仅会减少你不断打开和关闭各种网站的焦虑和流失，而且RSS还会以标准格式显示内容，减少分散你的注意力。\n如果你在任何Reddit URL的末尾添加.rss，你就会得到它的RSS提要。\n记住，你不需要放弃任何东西。你仍然可以在一个地方收看黑客新闻，龙虾，是的，甚至Reddit。\n您不必放弃聚合器的功能，只需将其添加为源即可。\n知道你只需要检查一个地方而不是N个地方，这让人很放松", "note_en": "A lot of people who were on the internet in the early 2000’s remember something called RSS. It stands for  Really Simple Syndication, and it allowed content creators to publish updates to the world in a well-understood format.\n The idea—which seems strange to type out—is that millions of people in the world could create and publish ideas, thoughts, and content…and then people who enjoyed that content would collect sources into a reader, which was called, well, an RSS Reader.\n   Google Reader was the reader of choice, and it was glorious. People took pride in their curated set of sources, and we  wrote a lot about how to best organize your feeds for maximum efficiency.\n It was a direct connection between creators and consumers. By adding someone’s feed to your RSS reader you were saying, “Yes, I’d like to subscribe to your interpretation of reality.”\n By curating the feeds in your reader, you were curating your view of the world. And that was made up of hundreds or thousands of individual voices.\n We’re not sure who struck first—us or them—but we know it was us that scorched the sky.\n It’s unclear what exactly destroyed RSS, but Google closing Google Reader definitely didn’t help. Another factor was the rise of aggregation sites like Slashdot, Digg, and Reddit, which seductively took on the burden of surfacing the best content.\n So rather than having to curate your own feeds, you just land on a single site and have the “best” content presented to you.\n  Reddit is awesome, for sure. And so were the other aggregators. But I think they stole something from us. First, they broke the direct connection between the reader and the creator, making it so that Digg showed you a story, not Kristen—who you’ve been following for years. And second, it removed the need to tend to one’s own input garden.\n The less effort it takes to acquire something, the less value it will have to you.\n I’m sure social media sites had an effect too, because—like aggregators—they were singular watering holes that guaranteed something exciting when you showed up. The common denominator is the move from more effort to less. It’s like in WALL-E, where we turn into morbidly obese people on hoverchairs being shuttled between stimuli.\n Well, it’s time to garden again. It’s time to return to RSS.\n Google Reader is still dead, but if I remove my nostalgia glasses,  Feedly is probably better now than Reader ever was. It’s what I’ve been using for years now.\n   I see RSS curation like the practice of cooking one’s own meals. There’s something magical about picking specific ingredients, using custom tools to prepare them, and then consuming the output.\n Or—perhaps an even better metaphor—cultivating a bookshelf. With the only difference being that bookshelves are usually constructed using only one’s favorite books, while I think an RSS reader should be designed for “exposure to other” as well.\n  The point is that curation of an RSS reader forces one to think about their inputs, and to exercise their values in doing so. Are you building a list of inputs that agree with you? Are you including people who you respect but disagree with? What about people you can’t stand at all?\n What you choose to include will not just define how you see the world, but how well you understand other peoples’ perspectives as well.\n   Then, as the most important step, stop visiting the New York Times, CNN, Reddit, Hacker News, Lobsters, and every other site you rotate through all day.\n    Not only will this reduce your anxiety and churn from constantly opening and closing various sites, but RSS also shows the content in a standard format, with less to distract you.\n If you add  .rss to the end of any Reddit URL you get its RSS feed.\n Remember, you don’t have to give anything up. You can still have Hacker News, Lobsters, and yes—even Reddit—all in one place.\n   You don’t have to give up the power of the aggregators; just add them as sources\n   It’s relaxing to know you only have to check one place rather than  N places", "posttime": "2020-05-18 00:05:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "回到,rss", "title": "是时候回到RSS了", "title_en": "It’s Time to Get Back to RSS", "transed": 1, "url": "https://danielmiessler.com/blog/its-time-to-get-back-into-rss/", "via": "", "real_tags": ["回到", "rss"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002534, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近一直在想的是，当我在任何一种分布式系统上工作时，包括像Web应用程序这样简单的前端和后端代码，我可能有80%以上的时间花在了如果不是分布式的情况下我就不需要做的事情上。对于为什么我认为这类编程需要如此多的工作，我提出了以下描述：一切都是脆弱的、狭窄的、滞后的、异步的、不匹配的、不可信的管道。我认为每一个在网络系统上工作的程序员都遇到过这些问题，这只是我在一个地方连贯地描述所有这些问题的努力。我希望能促使你同时考虑所有不同的麻烦，并想一想，如果你必须/不需要处理这些事情，你的工作会变得多么困难/容易。我认为这就是为什么像Twitter这样的网络公司的人均工程师生产率似乎比游戏公司或SpaceX等其他公司要低得多，尽管这个谜团还有其他方面。虽然分布式系统的部分困难是物理上固有的，但我认为有很多想法可以使问题的每个部分变得更容易，其中许多已经是常用的，我将尝试提到其中的许多想法。我希望我们作为程序员不断开发更多这样的技术，特别是简化问题的通用实现。就像序列化库减少了对手工编写的解析器/编写器的需求一样，我认为通过实现通用的解决方案可以节省大量的开发人员时间，在这些解决方案中，我们目前正费劲地重新实现通用模式。我还认为，所有这些成本意味着，如果没有必要，您应该真正努力避免使您的系统分布式。\n我将详细介绍每一部分，但简要地说，每当我们介绍网络连接时，我们通常都必须处理以下内容：\n脆弱：网络连接或另一端可能出现硬件故障，这些故障有不同的含义，但两者都表现为超时。一切都需要处理失败。\n窄：带宽有限，因此我们需要仔细设计协议，以便只发送他们需要的内容。\n异步：特别是使用&gt；2输入源(UI计数)时，可能会发生各种竞争和边缘情况，需要考虑和处理。\n不匹配：通常不可能自动升级所有系统，因此您需要处理使用不同协议版本的不同目的。\n不可信：如果您不希望所有内容都因一次故障而关闭，则需要防御无效输入和不堪重负的情况。有时，您还需要防御实际的攻击者。\n管道：所有内容都打包为字节，因此您需要能够(反)序列化您的数据。\n当编写在一台计算机上运行的程序时，所有这些事情基本上都可以避免，也就是说，除非您最终优化了性能，并意识到您的计算机实际上是一个分布式的核心系统，并且其中一些核心又回来了。一些领域设法避免了其中的一些问题，但我在网络应用、自动驾驶汽车、文本编辑器和高性能系统上工作时经历过这些问题的子集，它们无处不在。\n这甚至不是所有的问题，只是关于网络的事情。在各种瓶颈通常如何需要复杂的缓存层次结构(需要与底层数据存储保持同步)等问题上也花费了大量的精力。\n避免这一切的一种方法就是不编写分布式系统。有很多情况可以做到这一点，我认为比一些人更努力地尝试将所有事情打包到一个过程中是值得的。然而，超过一定的可靠性或规模，物理意味着您将不得不使用多台机器(除非您想走大型机路线)。\n随着您连接机器或提高可靠性目标，当一个部件崩溃时只使所有东西崩溃的策略(多线程/多核系统所做的)变得越来越不可行。硬件将出现故障，无线连接将中断，整个数据中心的电力或网络将被松鼠切断。一些域名，如互联网不稳定的客户，也不可避免地会导致频繁的连接故障。\n在实践中，您需要编写代码来处理失败案例，并仔细考虑它们是什么以及要做什么。当仅仅注意到故障会丢失重要数据，并且您需要实现数据存储或传输的冗余时，情况会变得更糟。更糟糕的是，另一台机器发生故障和网络连接中断都变得可见，就像一些预期的网络数据包在“太长”之后没有到达一样，这不仅带来了延迟，而且带来了可能导致分裂大脑问题的模棱两可。通常，像TCP这样的东西会为您实现它，但有时您必须实现自己的心跳，以定期检查另一个系统是否仍在运行。\n试图简化这一点的尝试包括例外、TCP、合并协议和现成的冗余数据库，但没有任何解决方案可以消除所有地方的问题。我最喜欢的尝试之一是Erlang的流程链接、监视和监督，它提供了一种理念，试图将所有类型的故障合并成一个更容易处理的一般情况。\n网络带宽通常是有限的，特别是在消费者或蜂窝互联网上。这似乎不是一个经常的限制，因为您很少达到带宽限制，但这是因为有限的带宽在您做的每件事中都根深蒂固。无论何时设计分布式系统，您都需要提出一种通信协议，该协议按照需要的顺序进行通信，而不是按照数据总大小的顺序进行通信。\n在多线程程序中，您可能只传递一个指向千兆字节的不可变或锁定数据的指针，让线程读取它想要的内容，而不去想任何事情。在分布式系统中，传递代表数据库的整个内存是不可想象的，您需要花费时间实现其他方法。\n虽然多核系统实际上是一种特定的分布式系统，并且它们在幕后使用协议来仅传输必要的数据，但是涉及比大多数网络可行的更多的广播和往返。实际上，我认为尝试将用于使多核计算机无缝连接到分布式系统的技术应用于分布式系统是一种很好的方式，可以想出可能比其他方式设计的更通用的整洁解决方案。同样，一旦您真正开始努力优化系统，您会注意到计算机内部的带宽也会成为一个限制因素。\n处理低带宽通常涉及每次查询或修改共享数据结构的消息类型，并决定何时传送更多数据以便本地交互更快，或者何时传送更少数据以避免糟糕的带宽情况。它通常更进一步到各种类型的复制状态机，其中每个对等点基于复制的更改流更新模型，因为在每次更新之后发送新模型将会占用太多带宽。这方面的例子包括交换提要的RTS游戏。然而，维护每个对等点如何更新其状态以避免去同步的确定性和一致性可能是棘手的，特别是在不同对等点具有不同的语言或软件版本的情况下。您还经常最终实现一个单独的协议来流式传输完整的快照，因为当连接不可行时，从一开始重放事件是不可行的。\n试图简化这一点的方法包括RPC库，它使为不同的查询和更新发送大量不同类型的消息变得更容易，而不是提供数据结构、缓存库和压缩。很酷但不太常用的系统包括像Replicant这样的系统，它们可以确保同步状态机代码并更新许多设备上的流，从而使复制状态机变得更容易、更轻松。\n一次网络往返不可能是有问题的延迟，或者您需要更好的网络硬件，或者需要解决不同的问题。困难来自于避免以需要过多网络往返的方式实施您的解决方案。这可能导致需要实现在服务器上执行一系列操作的特殊组合消息，而不仅仅是提供较小的原始消息。\n具有特别大延迟的Web有很多这种类型的问题，比如加载HTML后只有字体/图像URL，或者REST API需要多个链式调用才能获得下一个所需的ID。已经为这些问题构建了很多东西，比如资源内联、HTTP/2服务器推送和GraphQL。\n一个比较酷的通用解决方案是Capn‘n Promise流水线和其他系统，这些系统实质上涉及将一系列步骤传送到另一端(如SQL)执行。这些系统本质上发送在服务器上执行的有限类型的程序。不幸的是，您经常遇到所用语言的限制，比如您无法在没有往返的情况下将Capn‘n Proto结果加1，然后再将其传递给新的呼叫。但是，如果您使您的语言过于强大，您可能会遇到代码问题，因为您要发布的代码会使服务器过载或过大。如果您控制两端，那么为您的用例添加多步骤消息非常容易，但是如果另一端是公司的第三方API，或者甚至是大公司的不同团队所拥有的，那么在这些情况下，他们往往不想在他们的服务器上运行您的程序。我认为在发送代码段的新方法方面有更多的探索空间，同时重用发送的代码以节省带宽并限制其造成破坏的可能性。\n另一种可以在数据中心工作的解决方案是使用更好的网络。你可以得到延迟为2us，带宽为100Gbps或更高的网卡，但基本上只有HPC、模拟和金融使用它们。然而，如果您的方法需要O(N)次往返，这些只会减少常量因素，并不能节省您的时间。\n一旦您有2+个未同步的事件源，您就会开始担心竞争情况。这可以是多个服务器，也可以只是一个既有用户输入又有到服务器的通道的Web应用程序。总是有一些不常见的排序，比如用户在加载下一个页面之前再次单击“提交”按钮。有时您很幸运，系统的设计意味着这很好，而另一些时候则不是这样，您要么修复它来处理这种情况，要么从被开两次账单的客户那里获得错误报告。异步程度越高，您需要考虑的情况就越多，或者必须使用一种优雅的设计来解决更多的情况，这种设计可以避免糟糕的状态。\n根据您的语言/框架的不同，异步还可能需要更改您通常编写代码的方式，从而使一切变得臃肿和丑陋。许多系统过去和现在都要求您在任何地方都使用回调，有时甚至不提供闭包，这会使您的代码变得非常混乱。许多语言在这方面做得更好，比如异步/等待或带有小堆栈的协程(如Go)，或者只是使用线程和阻塞I/O。不幸的是，其中一些解决方案引入了函数颜色问题，因为引入异步需要在整个代码库中进行更改。\n异步边缘情况是一个相当基本的问题，但是有很多可用的模式来解决不同类型的异步。例如，并发原语(如锁和障碍)、协议设计思想(如幂等)和更时髦的东西(如CRDT)。\n通常，当您想要更改协议时，不可能自动升级分布式系统的每个组件。这是从必须全天候运行的服务器群集与将旧版本的网页加载到选项卡中的用户进行通信而运行的。这意味着在一段时间内，您的系统需要使用较新的协议版本，与只知道较旧协议的系统进行通信。这只是一个您需要解决的问题，有两大类常见的解决方案，它们有很多子类型：\n通过维护两个实现或将旧处理程序映射到新处理程序，使新软件版本能够同时使用新的和新的协议版本，并与升级的对等点协商使用新版本。\n使用免费提供一定程度兼容性的数据结构，然后仅以这些方式升级您的协议。例如，JSON对象中无法识别的字段通常会被忽略，因此可以在识别后用于新功能。迁移通常可以在不中断查询的情况下向数据库表添加新列。然后，您通常会不遗余力地迫使每个更改成为这种类型的兼容。\n这两种情况的问题是，第一步通常以代码路径的形式积累技术债务，以处理一旦所有对等点都升级到协议更改之后就永远不会出现的情况(例如，缺少字段)。这通常需要分多个阶段推出，例如引入一个新字段作为可选，在所有地方推出新版本，将该字段更改为必填字段，现在所有客户端都发送该字段，然后再进行一次推出。当我想要更改多个系统使用的协议而又不想弄得一团糟时，我肯定花了很多时间来计划多阶段部署。\n对这两种方法都有很多帮助，两种序列化系统都提供了大量兼容的升级路径，如Protobufs，以及用于反序列化/升级旧类型版本的各种模式。\n您的数据不仅可能无法到达，而且您的系统可能会接收到可能会对其造成积极损害的数据。系统存在导致发送无效消息的错误，因此不仅在序列化级别，而且在业务逻辑级别，都需要仔细验证输入并返回错误。错误或新负载可能会导致系统发送消息的速度超过其处理速度，从而需要背压和限制。您甚至可能不得不防御那些积极尝试通过发送通常的交易对手永远不会发送的消息来破坏您的系统的攻击者，并智能地寻找边缘案例。\n这里也有很多模式，包括速率限制、现场验证逻辑和带内置反压的通道。在安全方面，我们还有加密、证书和模糊等内容。在这里，我们在通用性方面也做得更好，因为我们已经减少了手动模式的流行程度，比如确保我们总是在SQL和HTML中转义内插字符串，而使用更通用的模式，比如？总是应用转义的查询参数和模板系统。\n最后，也是最不重要的，所有内容都必须是字节流或字节包。这意味着您需要采用您的语言使其易于操作的漂亮数据结构，并将它们打包成与其内存中表示形式不同的形式，以便在网上发送。幸运的是，除了在极少数地方，简单的序列化/RPC库让这件事变得相当容易，尽管偶尔有些慢。有时，您还可以使用允许您从字节缓冲区中准确挑选出所需部分的方法，而无需将其转换为不同的表示形式，可能是通过将缓冲区指针强制转换为C结构指针(当这甚至接近于安全级别时)，或者使用类似Cap‘n Proto的方法来生成访问器。\n这可能是我花的时间最少的一次，但是我记得有一次我想要发送一个大型数据结构，但可用的序列化系统只能一次序列化所有数据结构，而不是逐个数据包传输，因为套接字可以接受它，而且我不想长时间阻塞我的服务器，这样会造成尾部延迟。我最终选择了不同的设计，但我也可以编写自定义代码，将我的数据结构分成块，一次发送一点。\n我怀疑对这篇文章的许多回复都会是这样的：“如果你只是{做一些不是普遍适用的、耗时的或有自己的问题的事情，那么实际上{一些/所有这些问题}都是微不足道的，可能是我提到的一些事情，如果是这样的话，很可能是使用Erlang}，而真正的问题是，其他人在编程方面很糟糕，不像过去的人们”。有很多事情是有帮助的，在了解好的解决方案，选择正确的解决方案，并有效地实施它们方面，有一个技能部分。然而，这些仍然是棘手的问题，人们不得不做出艰难的、真正的权衡，因为我们没有有效地解决它们。也许你会采取不同的权衡，但人们做出这些技术决策是出于真正的原因，我们应该努力降低成本，以及改善我们接受哪些成本的决策。\n我做的大多数项目都不能使用Erlang，因为它们要么需要极低的延迟，要么需要与非Erlang生态系统的某些部分集成，要么计算过于密集(是的，我知道NIF)。这意味着只要从一个领域带来解决方案并在另一个领域实现它们，或者使它们更快，就有足够的机会提高生产率！我喜欢看到将Erlang的好处带到更多领域的努力。即使是Erlang也没有解决所有这些问题，我相信有一天可能会解决这些问题。\n我认为解决这些问题的最大锤子之一就是从一开始就努力避免编写分布式系统。我这篇文章的目标之一是激励人们尝试开发更通用的解决方案，而不是重复实现特定的模式，但我的另一个目标是试图一次性将所有成本放在你面前，并说，你确定添加独立的联网系统真的会让你的工作变得更容易吗？有时候，分布式系统是不可避免的，比如如果您想要极高的可用性或计算能力，但在其他时候，这是完全可以避免的。要选择特定示例，请执行以下操作：\n我认为，如果适合的话，人们应该更愿意尝试将性能敏感的代码作为(可能是多线程的)进程在一台机器上使用快速语言编写，而不是尝试在多台机器上分发速度较慢的实现。我承认这需要时间和精力来学习如何做和优化，但它会在一个更简单的系统中得到回报。特别是，我认为人们应该在可能的情况下更积极地尝试在一台非常大的计算机上使用多线程。我个人发现，在Rust方式下进行多线程编程比在可行的情况下与多进程并行化要容易得多。有些问题(如异步)是相似的，但其他问题(如串行化、延迟和带宽)在很大程度上消失了，除非性能级别比假设的分布式版本高得多。\n我认为人们应该更愿意使用CFFI来绑定其他语言的库，而不是将它们放在单独的网络服务中(例如，针对我自己的库的用户，尽管我实际上不知道他们的限制是什么)\n除了可用性和并行性之外，人们选择将事物拆分成单独的服务是有原因的。例如，无需与另一个团队(FAST CI)协调，即可使用不同的语言Isolation快速部署更新。我们应该构建更多不涉及独立系统的替代方案，比如通过沙箱而不是微服务(消除“狭窄”、“滞后”和“异步”)来使用自动更新、热重新加载的动态链接库的工具。我非常肯定至少存在一个通过网络推送的热重载dylib更新实例(我希望有链接！)。总线。\n..", "note_en": "Something I’ve been thinking about recently is how when I’ve worked on any kind of distributed system, including systems as simple as a web app with frontend and backend code, probably upwards of 80% of my time is spent on things I wouldn’t need to do if it weren’t distributed. I came up with the following description of why I think this kind of programming requires so much effort: Everything is fragile narrow laggy asynchronous mismatched untrusted pipes. I think every programmer who’s worked on a networked system has encountered each of these issues, this is just my effort to coherently describe all of them in one place. I hope to prompt you to consider all the different hassles at once and think about how much harder/easier your job would be if you did/didn’t have to deal with these things. I think this is part of why web companies like Twitter seem to have so much lower impressiveness per engineer productivity than other places like game companies or SpaceX, although there’s other pieces to that puzzle. While part of the difficulty of distributed systems is inherent in physics, I think there’s lots of ideas for making each part of the problem easier, many already in common use, and I’ll try to mention lots of them. I hope that we as programmers continually develop more of these techniques and especially general implementations that simplify a problem. Like serialization libraries reducing the need for hand-written parsers/writers, I think there’s a lot of developer time out there to save by implementing generalized solutions where we currently painstakingly reimplement common patterns. I also think all these costs mean you should try  really hard to avoid making your system distributed if you don’t have to.\n I’ll go over each piece in detail, but briefly, whenever we introduce a network connection we usually have to deal with something that is:\n Fragile: The network connection or the other end can have hardware failures, these have different implications but both manifest as just a timeout. Everything needs to handle failure.\n Narrow: Bandwidth is limited so we need to carefully design protocols to only send what they need.\n  Asynchronous: Especially with &gt;2 input sources (UIs count) all sorts of races and edge cases can happen and need to be thought about and handled.\n Mismatched: It’s often not possible to upgrade all systems atomically, so you need to handle different ends speaking different protocol versions.\n Untrusted: If you don’t want everything to be taken down by one malfunction you need to defend against invalid inputs and being overwhelmed. Sometimes you also need to defend against actual attackers.\n Pipes: Everything gets packed as bytes so you need to be able to (de)serialize your data.\n All of these things can be mostly avoided when programming things that run on one computer, that is unless you end up optimizing performance and realizing your computer is actually a distributed system of cores and some of them come back. Some domains manage to avoid some of these but I’ve experienced subsets of these problems working on  web apps, self-driving cars, a text editor, and high-performance systems, they’re everywhere.\n This isn’t even all the problems, just things about the network. Tons of effort is also expended on things like how various bottlenecks often entail a complicated hierarchy of caches that need to be kept in sync with the underlying data store.\n One way you can avoid all this is to just not write a distributed system. There are plenty of cases you can do this and I think it’s worthwhile to try way harder than some people do to pack everything into one process. However past a certain point of reliability or scale, physics means you’re going to have to use multiple machines (unless you want to go the mainframe route).\n  As you connect machines or increase reliability goals, the strategy of just crashing everything when one piece crashes (what multi-threaded/multi-core systems do) becomes increasingly unviable. Hardware will fail, wireless connections drop, entire data centers have their power or network taken out by  squirrels. Some domains like customers with flaky internet also inevitably entail frequent connection failure.\n In practice you need to write code to handle the failure cases and think carefully about what they are and what to do. This gets worse when merely noting the failure would drop important data, and you need to implement redundancy of data storage or transmission. Even worse, both another machine failing and a network connection breaking become visible just as some expected network packet not arriving after “too long”, introducing not only a delay but an ambiguity that can result in  split-brain issues. Often something like TCP implements it for you but sometimes you have to implement your own heartbeating to periodically check that another system is still alive.\n Attempts to make this easier include exceptions, TCP, concensus protocols and off-the-shelf redundant databases, but no solution eliminates the problem everywhere. One of my favourite attempts is  Erlang’s process linking, monitoring and supervising which offers a philosophy that attempts to coalesce all sorts of failures into one easier to handle general case.\n  Network bandwidth is often limited, especially over consumer or cellular internet. It may seem like this isn’t a limitation very often because you rarely hit bandwidth limits, but that’s because limited bandwidth is ingrained into everything you do. Whenever you design a distributed system you need to come up with a communication protocol that communicates on the order of what’s necessary rather than on the order of the total size of your data.\n In a multi-threaded program, you might just pass a pointer to gigabytes of immutable or locked data for a thread to read what it wants from and not think anything of it. In a distributed system passing the entire memory representing your database is unthinkable and you need to spend time implementing other approaches.\n Although actually multi-core systems are a certain kind of distributed system and they employ  protocols behind the scenes to transfer only the data that’s necessary, but involve many more broadcasts and round trips than would be viable with most networks. I actually think trying to apply techniques used to make multi-core machines seamless to distributed systems is a good way to think of  neat solutions that might be much more general than you’d otherwise design. Similarly once you really start optimizing systems hard you notice that bandwidth inside your computer becomes a constraint too.\n Dealing with low bandwidth usually involves a message type for each query or modification to a shared data structure, and deciding when to ship over more data so local interactions are faster, or less data to avoid terrible bandwidth cases. It often goes further to various types of replicated state machine where each peer updates a model based on a replicated stream of changes, because sending the new model after every update would be too much bandwidth. Examples of this include  RTS games to  exchange  feeds. However maintaining determinism and consistency in how each peer updates its state to avoid desyncs can be tricky, especially if different peers have different languages or software versions. You also often end up implementing a separate protocol for streaming a full snapshot, because replaying events from the beginning of time when connecting isn’t viable.\n Attempts to make this easier include RPC libraries just making it easier to send lots of different message types for different queries and updates rather than shipping data structures, caching libraries, and compression. Cool but less commonly used systems include things like  Replicant that ensure synchronized state machine code and update streams on many devices to make replicated state machines easier and less fraught.\n  One network round trip can’t be a problematic latency or you need better networking hardware or a different problem to solve. The difficulties come from avoiding implementing your solution in a way that needs too many network round trips. This can lead to needing to implement special combo-messages that do a sequence of operations on the server instead of just providing smaller primitive messages.\n The web, with its especially large latencies, has had lots of problems of this type such as only having the font/image URLs after loading the HTML, or REST APIs that require multiple chained calls to get the IDs needed for the next. Lots of things have been built for these problems like resource inlining,  HTTP/2 server push and  GraphQL.\n A cool somewhat general solution is  Cap’n Proto promise pipelining and other systems that involve essentially shipping a chain of steps to perform to the other end (like SQL). These systems essentialy send a limited type of program to perform on the server. Unfortunately you often run into the limitations of the language used, like you can’t add 1 to your Cap’n Proto result before passing it to a new call without a round trip. But if you make your language too powerful you can run into problems with the code you’re shipping overloading the server or being too big. Just adding a multi-step message for your use case is pretty easy if you control both ends, but can be harder if the other end is a company’s API for third parties, or even just owned by a different team at a big company, and those are the cases where they tend not to want to run your programs on their server. I think there’s lots more avenue for exploration here in terms of new approaches to sending segments of code while re-using sent code to save bandwidth and limiting the potential for it to do damage.\n Another solution that can work in a data center is to use better networking. You can get  network  cards with  2us latencies and 100Gbps bandwidths or better, but basically only HPC, simulations and finance use them. However these just reduce the constant factor and don’t save you if your approach takes O(n) round trips.\n  As soon as you have 2+ sources of events that aren’t synchronized then you start worrying about race conditions. This can be multiple servers, or just a web app with both user input and a channel to the server. There’s always uncommon orderings like the user clicking the “Submit” button a second time before the next page loads. Sometimes you get lucky and the design of your system means that’s fine, other times it’s not and you either fix it to handle that case or get bug reports from customers who were billed twice. The more asynchrony the more cases you have to either think about or solve with an elegant design which precludes bad states.\n Depending on your language/framework, asynchrony can also entail a change to the way you normally write code that makes everything bloated and uglier. Lots of systems used to and still do require you to use callbacks everywhere, sometimes without even providing you closures, making your code an enormous mess. Many languages have gotten better at this with features like  async/await or coroutines with small stack like  Go, or just using threads and blocking I/O. Unfortunately some of these solutions introduce  function color problems where introducing asynchrony requires making changes throughout your codebase.\n Asynchrony edge cases are a reasonably fundamental problem, but there’s lots of available patterns for solving different kinds of asynchrony. Examples include concurrency primitives like locks and barriers, protocol design ideas like  idempotency, and fancier things like  CRDTs.\n  Usually it’s not possible to upgrade every component of a distributed system atomically when you want to change a protocol. This runs from communicating server clusters that must run 24/7 to users who have an old version of your web page loaded in a tab. This means for some time you’ll have systems that want to talk a newer protocol version communicating with systems that only know an older protocol. This is just a problem you need to solve and there’s two broad classes of common solutions with many subtypes:\n Have the new software version be able to speak both the old and new protocol version and negotiate to use the new version with upgraded peers, either by maintaining both implementations or mapping the old handlers onto the new ones.\n Use data structures that provide some degree of compatibility for free, then only upgrade your protocol in those ways. For example unrecognized fields in JSON objects are usually ignored so can be used for new functionality when recognized. Migrations can usually add new columns to a database table without it breaking queries. Then you usually go to great lengths to shoehorn every change into being this type of compatible.\n The problem with both these cases is the first steps usually accumulate technical debt in the form of code paths to handle cases (for example of missing fields) that will never come up once all peers are upgraded past the protocol change. This usually entails multi-stage rollouts, for example introduce a new field as optional, roll out the new version everywhere, change the field to be mandatory now that all clients send it, do another rollout. I’ve definitely spent a lot of time planning multi-stage rollouts when I’ve wanted to change protocols used by multiple systems without leaving a mess.\n There’s lots of things that help with both of these approaches, both serialization systems that provide lots of compatible upgrade paths like  Protobufs, to various  patterns for deserializing/upgrading old type versions.\n  Not only can your data fail to arrive but your system can recieve data that might actively harm it. Systems have bugs which cause invalid messages to be sent, so inputs need to be carefully validated and errors returned, not only at the serialization level but the business logic level. Bugs or new loads can cause systems to send messages faster than they can be handled, necessitating backpressure and limits. You may even have to defend against attackers who actively try and subvert your system by sending messages that would never be sent by your usual counterparties and  intelligently seek out edge cases.\n Here too we have lots of patterns including rate limits, field validation logic and channels with built in backpressure. On the security side we also have a field of things like encryption, certificates and fuzzing. We’ve also gotten better at being general here as we’ve reduced prevalence of manual patterns like ensuring we always escape interpolated strings in SQL and HTML, with more general patterns like  ? query parameters and templating systems which always apply escaping.\n  Last and mostly least, everything has to be a stream of bytes or packets of bytes. This means you need to take your nice data structures that your language makes easy to manipulate and pack them into a different form from their in-memory representation in order to send on the wire. Luckily except in very few places easy  serialization/ RPC libraries have made this pretty easy, if occasionally somewhat slow. You can also sometimes use methods that allow you to pick out exactly the parts you want from the byte buffers without transforming it to a different representation, perhaps by casting your buffer pointer to a C structure pointer (when that’s even close to safe-ish), or using something like  Cap’n Proto that can generate accessors.\n This is probably the one I’ve spent the least time fighting, but one case I can remember was when I wanted to send a large data structure, but the available serialization system could only serialize it all at once rather than streaming it packet by packet as the socket could accept it, and I didn’t want to block my server for a long time doing the entire thing, creating tail latency. I ended up choosing a different design, but I could also have written custom code to break my data structure up into chunks and send it a little bit at a time.\n  I suspect many responses to this post will be of the form “Actually {some/all of these problems} are trivial if you just {do some thing that isn’t universally applicable, is time consuming or has its own issues, possibly something I mentioned, if so probably using Erlang} and the real problem is that other people are bad at programming unlike people in the good old days”. There are lots of things that help, and there is a skill component in knowing about good solutions, choosing the right ones, and implementing them effectively. However these are still hard problems and people have to make difficult real tradeoffs because we haven’t solved them effectively enough. Maybe you would have taken a different side of the tradeoff but people make these technology decisions for real reasons and we should strive to reduce the costs, as well as improving decisions over which costs we accept.\n I just can’t use Erlang for most projects I do because they require either extremely low latency, integration with some part of a non-Erlang ecosystem, or they’re too computationally intensive (yes I know about  NIFs). This means there’s ample opportunity for productivity improvements just by bringing solutions from one domain and implementing them in another domain or making them faster! I love seeing  efforts to  bring Erlang’s benefits to  more  areas. And even Erlang doesn’t solve all of these problems to the extent I believe it’s possible to one day address them.\n I think one of the real biggest hammers you can take to these problems is just to try  really hard to avoid writing a distributed system in the first place. One of my goals for this post is to inspire people to try to develop more general solutions instead of having to repeatedly implement specific patterns, but my other goal is to try and put all the costs in your face at once and say  are you sure adding that separate networked system will really make your job easier? Sometimes a distributed system is unavoidable, such as if you want extreme availability or computing power, but other times it’s totally avoidable. To pick specific examples:\n I think people should be more willing to try and write performance-sensitive code as a (potentially multi-threaded) process on one machine in a fast language if it’ll fit rather than try and distribute a slower implementation over multiple machines. I acknowledge that this takes time and effort to learn how to do and optimize, but it’ll pay off in a simpler system. In particular I think people should be more aggressive about trying to use multi-threading on a really big computer when possible. I personally find multi-threaded programming in  Rust way easier than parallelizing with multiple processes when it’s viable. Some problems like asynchrony are similar but others like serialization, latency and bandwidth largely go away except at performance levels way higher than you’d probably get out of a hypothetical distributed version.\n I think people should be more willing to use C FFI to bind to libraries in other languages rather than putting them in a separate networked service ( example picking on users of my own library, although I don’t actually know what their constraints were). Yes you have to learn how to do C FFI and deal with unsafety, but I’d take that trade to avoid the network service.\n There are reasons people choose to split things into separate services other than availability and parallelism. For example ability to deploy updates quickly without coordinating with another team, fast CI, using a different language, isolation. We should build more alternatives that don’t involve separate systems, like tools for using auto-updating hot-reloaded dynamically linked libraries with sandboxing instead of microservices (eliminating “narrow”, “laggy” and “asynchronous”). I’m pretty sure at least one instance of hot-reloading dylib updates pushed over the network exists (I’d appreciate links!) bu\n......", "posttime": "2020-05-18 00:04:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "管道,narrow,需要", "title": "脆弱、狭窄、滞后的异步不匹配管道会扼杀生产力", "title_en": "Fragile narrow laggy asynchronous mismatched pipes kill productivity", "transed": 1, "url": "https://thume.ca/2020/05/17/pipes-kill-productivity/", "via": "", "real_tags": ["管道", "narrow", "需要"]}, {"category": "", "categoryclass": "", "imagename": "c8ce40af901c64c85bdf410cc6032ca1.jpg", "infoid": 1002533, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周我发表了一篇关于Deno的文章，以及如何使用Deno和Preact创建聊天应用程序。从那时起，出现了许多疑问。他们中的大多数都是关于如何做我们在Node中做过的相同的事情，但是是关于新的Deno生态系统。\n我试着收集了Node中一些最常用的主题，并寻找它们与Deno的替代方案。首先，我想说明一下，我们可以使用许多当前的Node.js模块。没有必要为所有事情寻找替代方案，因为许多模块都是可重用的。您可以访问pika.dev来查找要在Deno中使用的模块。也就是说，让我们从下面的清单开始吧：\n有了Node.js，我们可以使用Electron创建桌面应用程序。电子使用Chromium作为界面来运行Web环境。但是，我们能把电子和德诺一起用吗？还有其他选择吗？\n嗯，现在电子还远远不能在德诺的统治下被处决。我们必须寻找替代方案。因为Deno是用Rust制作的，所以我们可以使用web-view rust绑定在Deno中运行Destkop应用程序。\n这样，我们就可以使用原生操作系统Webview来运行任意多个Webview。\n从&#34；https://deno.land/x/webview/mod.ts&#34；；const contentType=&#39；text/html&#39；const sharedOptions={Width：400，Height：200，Resizable：TRUE，DEBUG：TRUE，NETWORM：FALSE，}；导入{Webview}；const webview 1=new Webview({title：&#34；Multiple Deno_Webview Example&#34；，url：`data：${contenttype}，&lt；html&gt；&lt；body&gt；&lt；h1&gt；1&lt；/h1&gt；&lt；/body&gt；&lt；/html&gt；`，.。sharedOptions，})；const webview2=new WebView({title：&#34；Multiple Deno_webview Example&#34；，url：`data：${contentType}，&lt；html&gt；&lt；body&gt；&lt；h1&gt；2&lt；/h1&gt；&lt；/body&gt；&lt；/html&gt；`，.。共享选项，})；等待承诺。全部([webview1.。run()，webview2。run()])；\nForeve和PM2是用于确保给定脚本作为守护进程连续运行的CLI工具。与Forever不同的是，PM2更完整，并且还充当负载均衡器。两者在Node中都非常有用，但是我们可以在Deno中使用它们吗？\n永远仅用于节点，因此使用它是不可行的。另一方面，使用PM2，我们可以运行非节点脚本，因此我们仍然可以将其用于Deno。\nExpress和Koa是最著名的Node框架。它们以其健壮的路由系统和HTTP助手(重定向、缓存等)而闻名。我们可以在德诺使用它们吗？答案不是..。但也有一些替代方案。\nDeno自己的STD库已经涵盖了Express或Koa提供的许多需求。https://deno.land/std/http/.。\n从&#34；https://deno.land/std/http/server.ts&#34；导入{getCookie}；从&#34；https://deno.land/std/http/cookie.ts&#34；；let Request=new ServerRequest()；请求导入{serverRequest}。Headers=新的Header()；请求。标题。设置(&#34；Cookie&#34；，&#34；Full=of；Tasty=巧克力&#34；)；const cookies=getCookies(Request)；控制台。日志(&#34；cookies：&#34；，cookies)；\n然而，申报路线的方式并不是很有吸引力。因此，让我们来看看更多的替代方案。\n从&#34；https://deno.land/x/oak/mod.ts&#34；；const app=new Application()；app导入{应用程序，}。使用((Ctx)=&gt；{ctx.。回应。Body=&#34；Hello World！&#34；；})；等待APP。监听({port：8000})；\n从&#34；https://deno.land/x/abc/mod.ts&#34；；const app=new Application()；app导入{Application}。静态(&#34；/static&34；，&#34；资产&#34；)；应用程序。GET(&#34；/hello&#34；，(C)=&gt；&#34；Hello！&#34；)。启动({port：8080})；\n将*作为Exp从&#34；https://raw.githubusercontent.com/NMathar/deno-express/master/mod.ts&#34；；const port=3000；const app=new exp导入。app()；app。使用(例如。static_(&#34；./public&#34；))；应用。使用(例如。bodyParser。json())；app.。get(&#34；/api/todos&#34；，async(req，res)=&gt；{等待res.。json([{name：&#34；买点牛奶&#34；}])；})；const server=等待APP。监听(端口)；控制台。log(`app侦听端口${server.。port}`)；\nMongoDB是一个具有巨大伸缩性和灵活性的文档数据库。在JavaScript生态系统中已经被广泛使用，有许多像Mean或MERN这样的堆栈使用它。它很受欢迎。\n所以，是的，我们可以将MongoDB与Deno一起使用。为此，我们可以使用此驱动程序：https://github.com/manyuanrong/deno_mongo.。\n从&#34；https://deno.land/x/mongo@v0.6.0/mod.ts&#34；；//初始化插件等待init()；const client=new mongoClient()；客户端导入{init，mongoClient}。connectWithUri(&#34；mongodb：//localhost：27017&#34；)；const db=client。数据库(&#34；test&#34；)；常量用户=db.。Collection(&#34；Users&#34；)；//INSERT常量INSERTID=等待用户。insert One({username：&#34；user1&#34；，password：&#34；pass1&#34；})；//findOne常量user1=等待用户。findOne({_id：insert tId})；//查找常量用户=等待用户。find({username：{$ne：null}})；//聚合常量文档=等待用户。Aggregation([{$Match：{username：&#34；Many&#34；}}，{$group：{_id：&#34；$username&#34；，总计：{$sum：1}])；//updateOne const{matchedCount，modfiedCount，upsertedId}=等待用户。updateOne(username：{$ne：null}，{$set：{username：&#34；username&#34；})；//delete eOne常量delete eCount=等待用户。delete One({_id：insert tId})；\n从&#34；https://deno.land/x/postgres/mod.ts&#34；；const client=new client({User：&#34；user&#34；，database：&#34；test&#34；，hostname：&#34；localhost&#34；，port：5432})；导入{Client}；等待客户端。connect()；const result=等待客户端。查询(&#34；SELECT*FROM People；&#34；)；控制台。日志(结果。行)；等待客户端。end()；\n从&#34；https://deno.land/x/mysql/mod.ts&#34；；const client=导入{Client}等待新客户端()。connect({hostname：&#34；127.0.0.1&#34；，username：&#34；root&#34；，db：&#34；dbname&#34；，poolSize：3，//连接限制密码：&#34；password&#34；，})；让result=等待客户端。EXECUTE(`INSERT INTO USERS(Name)VALUES(？)`，[&#34；aralroca&#34；，])；console。log(Result)；//{affectedRows：1，lastInsertId：1}。\n从&#34；https://denopkg.com/keroxp/deno-redis/mod.ts&#34；；const redis=等待连接({主机名：&#34；127.0.0.1&#34；，端口：6379})导入{CONNECT}；const ok=等待redis。set(&#34；Example&#34；，&#34；This is a Example&#34；)；Const Example=Await redis。GET(&#34；示例&#34；)；\nNodemon在开发环境中用于监视文件中的任何更改，自动重启服务器。这使得节点开发更加愉快，无需手动停止和重新启动服务器即可看到应用的更改。可以在德诺使用吗？\n在Node.js生态系统中，测试者有很多选择。然而，没有一种官方方法可以测试Node.js代码。\nDeno的优点之一是，我们可以将ESmodule与TypeScript一起使用，而不需要webpack、Parcel或Rollup等捆绑器。\n然而，您可能想知道，如果给定一棵文件树，我们是否可以将所有内容都放在一个文件中，以便在Web上运行它。\n嗯，是的，这是可能的。我们可以使用Deno的CLI来做到这一点。因此，不需要第三方捆绑器。\n在过去的几年里，更漂亮已经在JavaScript生态系统中广为人知，因为有了它，您就不必担心格式化文件了。\n事实是，它仍然可以在Deno上使用，但它失去了意义，因为Deno有自己的格式化程序。\n使用Deno时，Package.json将不复存在。我非常怀念的一件事是在Package.json中声明的脚本。\n一个简单的解决方案是使用Makefile并使用make执行它。但是，如果您错过了NPM语法，可以为Deno提供一个NPM风格的脚本运行器：\nNVM是用于管理多个活动节点版本的CLI，可根据您的项目轻松升级或降级版本。\n近年来，NPX在执行NPM包时变得非常流行，而不必安装它们。现在，许多项目不会存在于NPM中，因为Deno是一个独立的生态系统。那么，我们如何才能执行DENO模块，而不必使用Deno Install https://url-of-module.ts？安装它们\n与我们运行项目的方式相同，我们将模块的URL放入模块的URL中，而不是放入文件：\n如您所见，我们不仅需要记住模块的名称，还要记住整个URL，这使得它的使用更加困难。另一方面，它提供了更大的灵活性，因为我们可以运行任何文件，而不仅仅是像npx这样在Package.json中指定为二进制文件的文件。\n从海德/阿尔卑斯山-德诺出发：1.0.0号港口。WORKDIR/APP用户拒绝复制部门。运行deno cache dess.ts#缓存deps add。。运行Deno cache main.ts#main入口点。CMD[&#34；--Allow-Net&#34；，&#34；main.ts&#34；]。\n要将Deno用作lambda，在Deno STD库中有一个模块。https://deno.land/x/lambda.。\n从&#34；https://deno.land/x/lambda/mod.ts&#34；；导出异步函数处理程序(Event：APIGatewayProxyEvent，Context：Context)导入{APIGatewayProxyEvent，APIGatewayProxyResult，Context}：Promise&lt；APIGatewayProxyResult&gt；{Return{Body：`欢迎使用Deno${deno.。版本。Deno}🦕`，标题：{&#34；Content-Type&#34；：&#34；Text/HTML；Charset=utf8&#34；}，statusCode：200}；}。\n我确信我忘记了一些Node主题和它们的Deno替代方案，如果我错过了什么您想让我解释的地方，请告诉我。我希望这篇文章能帮助你和德诺打破僵局。", "note_en": "Last week I published an article about Deno, and how to create a  Chat app with Deno and Preact. Since then, many doubts have arisen. Mostly of them are about how to do the same thing we did in Node, but with the new Deno ecosystem.\n I&#39;ve tried to collect some of the most used topics in Node, and looked for their alternative with Deno. First of all, I would like to make it clear that we can use many of the current Node.js modules. There is no need to look for an alternative for everything, as many modules are reusable. You can visit  pika.dev to look for modules to use in Deno. That said, let&#39;s start with the list:\n    With Node.js we can create desktop applications using  Electron. Electron uses Chromium as interface to run a web environment. But, can we use Electron with Deno? Are there alternatives?\n  Well, right now Electron is far from being able to be executed under Deno. We must look for alternatives. Since Deno is made with Rust, we can use  web-view rust bindings to run Destkop application in Deno.\n This way, we can use the native OS webview to run as many webviews as we want.\n  import  {  WebView  }  from  &#34; https://deno.land/x/webview/mod.ts &#34; ; const  contentType  =  &#39; text/html &#39; const  sharedOptions  =  {  width :  400 ,  height :  200 ,  resizable :  true ,  debug :  true ,  frameless :  false , }; const  webview1  =  new  WebView ({  title :  &#34; Multiple deno_webview example &#34; ,  url :  `data: ${ contentType } , &lt;html&gt; &lt;body&gt; &lt;h1&gt;1&lt;/h1&gt; &lt;/body&gt; &lt;/html&gt; ` ,  ... sharedOptions , }); const  webview2  =  new  WebView ({  title :  &#34; Multiple deno_webview example &#34; ,  url :  `data: ${ contentType } , &lt;html&gt; &lt;body&gt; &lt;h1&gt;2&lt;/h1&gt; &lt;/body&gt; &lt;/html&gt; ` ,  ... sharedOptions , }); await  Promise . all ([ webview1 . run (),  webview2 . run ()]);\n   Forever and  PM2 are CLI tools for ensuring that a given script runs continuously as a daemon. Unlike Forever, PM2 is more complete and also serves as load balancer. Both are very useful in Node, but can we use them in Deno?\n Forever is intended for Node only, so using it is not feasible. On the other hand, with PM2 we can run non-node scripts, so we could still use it for Deno.\n        Express and  Koa are the best known Node frameworks. They&#39;re known for their robust routing system and their HTTP helpers (redirection, caching, etc). Can we use them in Deno? The answer is not... But there are some alternatives.\n   Deno&#39;s own STD library already covers many of the needs provided by Express or Koa.  https://deno.land/std/http/.\n import  {  ServerRequest  }  from  &#34; https://deno.land/std/http/server.ts &#34; ; import  {  getCookies  }  from  &#34; https://deno.land/std/http/cookie.ts &#34; ; let  request  =  new  ServerRequest (); request . headers  =  new  Headers (); request . headers . set ( &#34; Cookie &#34; ,  &#34; full=of; tasty=chocolate &#34; ); const  cookies  =  getCookies ( request ); console . log ( &#34; cookies: &#34; ,  cookies );\n However, the way to declare routes is not very attractive. So let&#39;s look at some more alternatives.\n   import  {  Application ,  }  from  &#34; https://deno.land/x/oak/mod.ts &#34; ; const  app  =  new  Application (); app . use (( ctx )  =&gt;  {  ctx . response . body  =  &#34; Hello World! &#34; ; }); await  app . listen ({  port :  8000  });\n   import  {  Application  }  from  &#34; https://deno.land/x/abc/mod.ts &#34; ; const  app  =  new  Application (); app . static ( &#34; /static &#34; ,  &#34; assets &#34; ); app . get ( &#34; /hello &#34; ,  ( c )  =&gt;  &#34; Hello! &#34; )  . start ({  port :  8080  });\n   import  *  as  exp  from  &#34; https://raw.githubusercontent.com/NMathar/deno-express/master/mod.ts &#34; ; const  port  =  3000 ; const  app  =  new  exp . App (); app . use ( exp . static_ ( &#34; ./public &#34; )); app . use ( exp . bodyParser . json ()); app . get ( &#34; /api/todos &#34; ,  async  ( req ,  res )  =&gt;  {  await  res . json ([{  name :  &#34; Buy some milk &#34;  }]); }); const  server  =  await  app . listen ( port ); console . log ( `app listening on port  ${ server . port } ` );\n  MongoDB is a document database with a huge scability and flexibility. In the JavaScript ecosystem has been widely used, with many stacks like MEAN or MERN that use it. It&#39;s very popular.\n  So yes, we can use MongoDB with Deno. To do this, we can use this driver:  https://github.com/manyuanrong/deno_mongo.\n import  {  init ,  MongoClient  }  from  &#34; https://deno.land/x/mongo@v0.6.0/mod.ts &#34; ; // Initialize the plugin await  init (); const  client  =  new  MongoClient (); client . connectWithUri ( &#34; mongodb://localhost:27017 &#34; ); const  db  =  client . database ( &#34; test &#34; ); const  users  =  db . collection ( &#34; users &#34; ); // insert const  insertId  =  await  users . insertOne ({  username :  &#34; user1 &#34; ,  password :  &#34; pass1 &#34; }); // findOne const  user1  =  await  users . findOne ({  _id :  insertId  }); // find const  users  =  await  users . find ({  username :  {  $ne :  null  }  }); // aggregation const  docs  =  await  users . aggregation ([  {  $match :  {  username :  &#34; many &#34;  }  },  {  $group :  {  _id :  &#34; $username &#34; ,  total :  {  $sum :  1  }  }  } ]); // updateOne const  {  matchedCount ,  modifiedCount ,  upsertedId  }  =  await  users . updateOne (  username :  {  $ne :  null  },  {  $set :  {  username :  &#34; USERNAME &#34;  }  } ); // deleteOne const  deleteCount  =  await  users . deleteOne ({  _id :  insertId  });\n     import  {  Client  }  from  &#34; https://deno.land/x/postgres/mod.ts &#34; ; const  client  =  new  Client ({  user :  &#34; user &#34; ,  database :  &#34; test &#34; ,  hostname :  &#34; localhost &#34; ,  port :  5432 }); await  client . connect (); const  result  =  await  client . query ( &#34; SELECT * FROM people; &#34; ); console . log ( result . rows ); await  client . end ();\n     import  {  Client  }  from  &#34; https://deno.land/x/mysql/mod.ts &#34; ; const  client  =  await  new  Client (). connect ({  hostname :  &#34; 127.0.0.1 &#34; ,  username :  &#34; root &#34; ,  db :  &#34; dbname &#34; ,  poolSize :  3 ,  // connection limit  password :  &#34; password &#34; , }); let  result  =  await  client . execute ( `INSERT INTO users(name) values(?)` ,  [  &#34; aralroca &#34; , ]); console . log ( result ); // { affectedRows: 1, lastInsertId: 1 }\n     import  {  connect  }  from  &#34; https://denopkg.com/keroxp/deno-redis/mod.ts &#34; ; const  redis  =  await  connect ({  hostname :  &#34; 127.0.0.1 &#34; ,  port :  6379 }); const  ok  =  await  redis . set ( &#34; example &#34; ,  &#34; this is an example &#34; ); const  example  =  await  redis . get ( &#34; example &#34; );\n   Nodemon is used in development environment to monitor any changes in your files, automatically restarting the server. This makes node development much more enjoyable, without having to manually stop and restart the server to see the applied changes. Can it be used in Deno?\n       In the Node.js ecosystem there are a lot of alternatives for test runners. However, there isn&#39;t one official way to test the Node.js code.\n        One of the strengths of Deno is that we can use ESmodules with TypeScript without the need for a bundler such as  Webpack,  Parcel or  Rollup.\n However, probably you wonder if given a tree of files, we can make a bundle to put everything in one file to run it on the web.\n Well, it&#39;s possible, yes. We can do it with Deno&#39;s CLI. Thus, there&#39;s no need for a third-party bundler.\n      In the last few years  Prettier has become quite well known within the JavaScript ecosystem because with it you don&#39;t have to worry about formatting the files.\n And the truth is, it can still be used on Deno but it loses its meaning, because Deno has its own formatter.\n     With Deno, the  package.json no longer exists. One of the things I really miss are the scripts that were declared in the  package.json.\n A simple solution would be to use a  makefile and execute it with  make. However, if you miss the npm syntax, there is an npm-style script runner for Deno:\n         Nvm is a CLI to manage multiple active Node versions, to easy upgrade or downgrade versions depending on your projects.\n     Npx in recent years has become very popular to execute npm packages without having to install them. Now many projects won&#39;t exist within npm because Deno is a separate ecosystem. So, how can we execute Deno modules without having to install them with  deno install https://url-of-module.ts?\n In the same way that we run our project, instead of a file we put the URL of the module:\n  As you can see, not only we have to remember the name of the module, but the whole URL, which makes it a little more difficult to use. On the other hand it gives a lot more flexibility as we can run any file, not just what&#39;s specified as a binary in the  package.json like  npx.\n    FROM  hayd/alpine-deno:1.0.0 EXPOSE  1993 # Port. WORKDIR  /app USER  deno COPY  deps.ts . RUN deno cache deps.ts  # Cache the deps ADD  . . RUN deno cache main.ts  # main entrypoint. CMD  [&#34;--allow-net&#34;, &#34;main.ts&#34;]\n      To use Deno as a lambda, there is a module in Deno STD library.  https://deno.land/x/lambda.\n import  {  APIGatewayProxyEvent ,  APIGatewayProxyResult ,  Context }  from  &#34; https://deno.land/x/lambda/mod.ts &#34; ; export  async  function  handler (  event :  APIGatewayProxyEvent ,  context :  Context ):  Promise &lt; APIGatewayProxyResult &gt;  {  return  {  body :  `Welcome to deno  ${ Deno . version . deno }  🦕` ,  headers :  {  &#34; content-type &#34; :  &#34; text/html;charset=utf8 &#34;  },  statusCode :  200  }; }\n    I&#39;m sure I forgot some Node topics and their Deno alternative, let me know if there&#39;s anything I missed that you&#39;d like me to explain. I hope this article helps you break the ice with Deno.", "posttime": "2020-05-17 23:49:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "node,deno", "title": "从Node到Deno", "title_en": "From Node to Deno", "transed": 1, "url": "https://dev.to/aralroca/from-node-to-deno-5gpn", "via": "", "real_tags": ["node", "deno"]}]