[{"category": "", "categoryclass": "", "imagename": "2654e0a537295a50e703dec4b52f0e59.jpg", "infoid": 1068279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "她说，在一个世纪前的回应促使介入医学的兴起 - 通过手术或药物治疗疾病，只有在症状表现出来。如今，介入医学是西方医疗保健中的主要心态。而且，梅尔顿，卫生科技初创公司的领先投资者，包括Livongo，Tia和Calibrate，说护理途径很好。\n “我们社会发生了什么？慢性病，慢性疼痛，糖尿病和肥胖，“她说。 “这不需要魔药，而且没有手术。通常，有治疗组件，行为变化和可移动的接触点。“\n 进入个性化医学。狂欢而强大的框架在硅谷初创公司中越来越受欢迎。它是一种递送系统，其中患者接受更加全面的整体护理，以考虑多种症状或共同生命。例如，在荷尔蒙健康中，个性化医学可以增加更多的数据和特异性，患有某人的避孕，而不是通常的试验过程。基本上，它与介入医学相反。\n “我们不只是一条胳膊或腿，我们不仅仅是肥胖或糖尿病或疼痛患者，”梅尔顿说。 “我们如何将你视为一个整个人？”\n 许多公司正在使用这种方法来重新注意肌肉骨骼（MSK）病症和慢性疼痛的患者。这些条件通常用上瘾的阿片类药物治疗，这是一个主要的公共卫生问题。据估计，5000万美国人患有慢性疼痛，企业家正在研究不像饼干现状的解决方案。金钱市场肯定存在：2017年，全球MSK医疗市场价值为574亿美元;慢性疼痛市场与MSK医学重叠，预计将于2030年达到1517亿美元的价值。\n “常时不是新的想法，它与允许指数变化的一刻延时混淆了许多因素，”这使得启动工作“，”梅尔顿说，在MSK医学中的繁荣和最近的活动。今天，我们将专注于三项初创公司采取不同的方法，以帮助患有慢性疼痛和联系相关条件的人：清除，Peerwell和铰链健康。\n  Avi Dorfman表示，将指导到消费者是治疗慢性疼痛的最有效的方法，所以他创立了清算。数字健康初创公司与来自哈佛，John Hopkins和NYC医院的医生和研究人员的医疗咨询委员会，为特殊的手术制作了一个可爱的无面型解决方案，让人们陷入困境。 \n上个月，清算由Bessemer和创始人基金筹集了2000万美元的种子轮。 梅尔顿还代表门槛投资。  清算提供四种产品：处方复合霜，包括FDA批准的成分，CBD霜，用于局部不适，营养保健品，补充联合健康，以及预先记录，在家庭锻炼目录。 它目前可用于加利福尼亚州，佛罗里达州，格鲁吉亚，伊利诺伊州，纽约，北卡罗来纳州，俄亥俄州，宾夕法尼亚州，田纳西州和德克萨斯州的患者。 ", "note_en": "She says the response just over a century ago prompted the rise of interventional medicine — treating illness through surgery or medicine only after symptoms manifest. Today, interventional medicine is the dominant mindset in Western healthcare. And, Melton, a lead investor in health tech startups including Livongo, Tia, and Calibrate, says the care pathway ages well.\n “What’s happening in our society? Chronic diseases, chronic pain, diabetes, and obesity,” she said. “That doesn’t require a magic pill and there’s not just a surgery. Oftentimes, there’s therapeutic components, behavior changes, and movable touchpoints.”\n Enter personalized medicine. The buzzy yet powerful framing is growing in popularity among Silicon Valley startups. It’s a delivery system in which patients receive more holistic care that takes into account multiple symptoms or co-morbidities. In hormonal health, for example,  personalized medicine could add more data and specificity to which birth control someone takes, instead of the usual process of trial and error. Essentially, it’s the opposite of interventional medicine.\n “We’re not just an arm or a leg, we’re not just obese or a diabetic or a pain sufferer,” Melton said. “How do we treat you as a whole person?”\n A number of companies are using this approach to reinvent care for patients with musculoskeletal (MSK) medical conditions and chronic pain. These conditions are commonly treated with addictive opioids, a major public health concern. As an estimated 50 million Americans suffer from chronic pain, entrepreneurs are working on solutions that don’t resemble the cookie-cutter status quo. And the money market is certainly there: in 2017, the global MSK medical market  was valued at $57.4 billion; the market for chronic pain, which overlaps with MSK medicine, is expected to  hit $151.7 billion in value by 2030.\n “Oftentimes it’s not new ideas, it’s conflating a number of factors that come together at one moment in time that allow exponential change,” that makes a startup work,” Melton said, of the boom and recent activity in MSK medicine. Today, we’ll focus on three startups taking different approaches to help people suffering from chronic pain and MSK-related conditions: Clearing, Peerwell, and Hinge Health.\n  Avi Dorfman says going direct to consumers is the most effective way to treat chronic pain, so he founded  Clearing. The digital health startup worked with a medical advisory board of physicians and researchers from Harvard, John Hopkins, and NYC’s Hospital for Special Surgery to create an opioid-free solution for people struggling with pain.\n Last month, Clearing raised a $20 million seed round led by Bessemer and Founders Fund. Melton also invested in the round on behalf of Threshold.\n Clearing offers four products: prescription compound cream that includes FDA-approved ingredients, CBD cream for topical discomfort, nutraceuticals to supplement joint health, and a directory of pre-recorded, at-home exercises. It currently is available to patients in California, Florida, Georgia, Illinois, New York, North Carolina, Ohio, Pennsylvania, Tennessee and Texas.", "posttime": "2021-06-26 01:20:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "骨骼,medical,医学", "title": "肌肉骨骼医学初创公司进入个性化健康技术市场 ", "title_en": "\n\t\t\t\tMusculoskeletal medical startups race to enter personalized health tech market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/musculoskeletal-medical-startups-race-to-enter-personalized-healthtech-market/", "via": "", "real_tags": ["骨骼", "medical", "医学"]}, {"category": "", "categoryclass": "", "imagename": "58c1369cf5da636bb58740d2fc141c8e.jpg", "infoid": 1068278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于伦敦的公司将自己描述为“Crypto基础设施公司”，旨在通过其“数字资产支付网关”为企业制造区块链。具体而言，它汇总了各种支付解决方案，并为企业提供了菲亚特和加密付款和支出。\n 更简单地说，Mercuryo旨在使用加密货币作为推进举措的工具，以便在下一步跨境转移或使其成为允许任何企业成为Fintech公司，而无需跟上其并发症。“\n  “对企业的快速和高效的国际支付的需要与以往任何一致，”佩尔朗托·联合创始人兼首席执行官佩特尔·科兹亚科夫说。虽然没有跨境支付公司的公司不足，但是启动强调加密是一种差异化因素。\n “我们的团队通过促进廉价和简单的交易使加密普遍提供了明确的计划，”Kozyakov说。 “然后可以使用加密货币来处理全球资金转移，大规模支出，并促进在其他事项中获取服务。”\n Mercuryo在2019年初开始船上客户，并且在4月份超过5000万美元的年度经常性收入（Arr）以来，已经看到了令人印象深刻的增长。其客户群正在接近100万，公司拥有伙伴关系，其中一些大型加密玩家，包括二明团，Bitfinex，Trezor，信任钱包，壁虎和横布。 2020年，该公司表示，其营业额飙升了50次，而税率营业额在2021年4月越过25亿美元。\n 为了构建这种势头，Mercuryo已经开始扩大到包括美国在内的新市场，在此，今年早些时候推出了所有国家的B2B客户的加密支付。它还计划“逐步”扩展到非洲，南美洲和东南亚。\n 目标全球LED Mercuryo的A系列A，其中还包括一群天使投资者的参与，并带来了自2018年成立以来以超过1000万美元的成立以来提出的初创公司的总数。 \n该公司计划利用其新资本推出加密货币借记卡（直接从钱包的加密平衡中全球支出），并继续扩大到新市场，如拉丁美洲和亚太地区。\n Mercuryo的各种产品包括带内置的加密交换和数字资产购买功能，小部件和大批量加密货币获取和OTC服务的多币钱包。\n Kozyakov表示，该公司不收取货币转换，并没有其他“隐藏费”。\n “我们为合作伙伴及其客户启用即时和轻松的跨境交易，”他说。 “此外，缺款服务缺乏中介机构，不需要额外的步骤来完成交易。相反，该过程仅缩小到两个操作：在收到资金时发送转移和加密到菲亚特转换时，菲亚特到加密交换。“\n Mercuryo还提供Crypto SaaS产品，为客户提供通过其菲亚特账户购买加密的方式，同时将数字资产管理委托给公司。\n “无论是虚拟账户还是第三方客户钱包，公司都处理银行大多数相关的加密货币流程，因此他们可以更多地关注其核心运营，”Kozyakov说。\n Mike Lobanov，Target Global的联合创始人表示，作为一个实验，他的公司测试了许多购买比特币的解决方案。 \n“做我们的勤奋，我们测量了”时间来加密“ - 去App商店需要多长时间，直到数字资产到达钱包之前，”他说。  根据洛巴托夫的说法，Mercuryo先到了6分钟，包括来自KYC和获得加密货币的资金的一切。  “第二次最佳结果是20分钟，而一些应用程序将永远采取处理我们的交易，”他补充道。 “这家公司是该领域的一个游戏变更者，自早期以来，我们很高兴成为他们的支持者。”  展望未来，启动计划释放一个产品，这些产品将为业务提供一种方式，以便同时向多个客户和演出工人发送即时批量支付，无论接收者所在吗？ ", "note_en": "The London-based company describes itself as “a crypto infrastructure company” that aims to make blockchain useful for businesses via its “digital asset payment gateway.” Specifically, it aggregates various payment solutions and provides fiat and crypto payments and payouts for businesses.\n Put more simply,  Mercuryo aims to use  cryptocurrencies as a tool for putting in motion next-gen cross-border transfers or as it puts it,  “to allow any business to become a fintech company without the need to keep up with its complications.”\n  “The need for fast and efficient international payments, especially for businesses, is as relevant as ever,” said Petr Kozyakov, Mercuryo’s co-founder and CEO. While there is no shortage of companies enabling cross-border payments, the startup’s emphasis on crypto is a differentiator.\n “Our team has a clear plan on making crypto universally available by enabling cheap and straightforward transactions,” Kozyakov said. “Cryptocurrency assets can then be used to process global money transfers, mass payouts and facilitate acquiring services, among other things.”\n Mercuryo began onboarding customers at the beginning of 2019, and has seen impressive growth since with annual recurring revenue (ARR) in April surpassing over $50 million. Its customer base is approaching 1 million, and the company has partnerships with a number of large crypto players including Binance, Bitfinex, Trezor, Trust Wallet, Bithumb and Bybit.  In 2020, the company said its turnover spiked by 50 times while run-rate turnover crossed $2.5 billion in April 2021.\n To build on that momentum, Mercuryo has begun expanding to new markets, including the United States, where it launched its crypto payments offering for B2B customers in all states earlier this year. It also plans to “gradually” expand to Africa, South America and Southeast Asia.\n Target Global led Mercuryo’s Series A, which also included  participation from a group of angel investors and brings the startup’s total raised since its 2018 inception to over $10 million.\n  The company plans to use its new capital to launch a  cryptocurrency debit card (spending globally directly from the crypto balance in the wallet) and continuing to expand to new markets, such as Latin America and Asia-Pacific.\n Mercuryo’s various products include a multicurrency wallet with a built-in crypto exchange and digital asset purchasing functionality, a widget and high-volume cryptocurrency acquiring and OTC services.\n Kozyakov says the company doesn’t charge for currency conversion and has no other “hidden fees.”\n “We enable instant and easy cross-border transactions for our partners and their customers,” he said. “Also, the money transfer services lack intermediaries and require no additional steps to finalize transactions. Instead, the process narrows down to only two operations: a fiat-to-crypto exchange when sending a transfer and a crypto-to-fiat conversion when receiving funds.”\n Mercuryo also offers crypto SaaS products, giving customers a way to buy crypto via their fiat accounts while delegating digital asset management to the company.\n “Whether it be virtual accounts or third-party customer wallets, the company handles most cryptocurrency-related processes for banks, so they can focus more on their core operations,” Kozyakov said.\n Mike Lobanov, Target Global’s co-founder, said that as an experiment, his firm tested numerous solutions to buy Bitcoin.\n “Doing our diligence, we measured ‘time to crypto’ – how long it takes from going to the App Store and downloading the app until the digital assets arrive in the wallet,” he said.\n Mercuryo came first with 6 minutes, including everything from KYC and funding to getting the cryptocurrency, according to Lobanov.\n “The second-best result was 20 minutes, while some apps took forever to process our transaction,” he added. “This company is a game-changer in the field, and we are delighted to have been their supporters since the early days.”\n Looking ahead, the startup plans to release a product that will give businesses a way to send instant mass payments to multiple customers and gig workers simultaneously, no matter where the receiver is located.", "posttime": "2021-06-26 01:20:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,跨境,payments", "title": "MercuySo在沿着50米的价格越过越过的密码跨境付款提高了7.5米 ", "title_en": "\n\t\t\t\tMercuryo raises $7.5M for crypto-focused cross-border payments after crossing $50M in ARR\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/mercuryo-raises-7-5m-for-crypto-focused-cross-border-payments-after-crossing-50m-in-arr/", "via": "", "real_tags": ["密码", "跨境", "payments"]}, {"category": "", "categoryclass": "", "imagename": "3c039aa2326c56d4766bba35777c9890.jpg", "infoid": 1068277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "探险队植根于玻璃葡萄酒索德尔的评论，他在美国说丰富的种子资本允许创始人在筹集一系列A的筹码之前进行了很多工作，有效推迟这些轮。但是，在那些创始人提高了一个后，由于在早期的阶段交易中表现出了持续的公司，他们的第B轮迅速迅速地遵循普遍的公司。\n  与Seseri聊天后更多和一些其他风险资本家关于该概念，第二个动态出现了。即“典型的”早期资金循环，正如Seseri所描述的那样，是“成为非典型的，因为先发制人的循环[其中]对窗外的典型期望走出窗外。”\n  交易所探索初创公司，市场和金钱。每天早上都在额外的紧缩或每周六获得交换时事通讯。\n  Series，她说，在种子交易后，可能会在几个月后来，B型队伍看到预期的收入阈值，部分地点是“已经下跌的大型多资产球员，并提供不同的产品而不是典型的VCS的不同产品 - 非常快速的术语床单，没有积极参与投资后，大量投资数额和高估值。“\n 专注于系列动态，旧拇指的初步初步持续到每年重复收入（ARR）的达到100万美元，现在经常发生实际意义。有些初创公司延迟了他们的一轮，直到他们达到2亿美元的ARR，归功于足够的种子资本。\n 虽然有些初创公司延迟了他们的一轮，但其他人早些时候提高了危急投资，也许甚至在arr中的几十万。\n 两组之间有什么不同？具有“精英状态”的初创公司能够向他们的系列展开A，而其他创始人花更多的时间将充足的种子资本汇集在一起​​以获得足够的规模来吸引A. \n动态不仅仅是美国现象。双层风险投资市场也在拉丁美洲出现，这是一个全球重要的，迅速扩大的启动地区。 （例如，巴西Fintech Startup Nubank，只是关闭了7.5亿美元。）\n 今天早上，我们潜入拉丁美洲风险投资市场及其早期动态。我们还有关于欧洲现场的票据，因此在下周期待该主题更多。我们走吧！\n  巨型队不再是拉丁美洲的例外;事实上，他们已经成为一个趋势，在过去几个月里宣布了一系列的趋势。\n 该公告本身经常强调圆形规模：例如，近期1亿美元的B次转向哥伦比亚的Proptech启动Habi被宣传为“最大的Birts Bersted在哥伦比亚。”这遵循其他2021条记录，如“墨西哥最大的系列” - 在线杂货店jüsto为6500万美元 - 并“由拉丁美洲金融金属筹集的最大系列” -  4300万美元用于拉丁美洲的格子“Belvo。 ", "note_en": "The expedition was rooted in commentary from  Rudina Seseri of Glasswing Ventures, who said abundant seed capital in the United States allows founders to get a lot done before they raise a Series A, effectively delaying these rounds. But that after those founders did raise that A, their Series B round could rapidly follow thanks to later-stage money showing up in earlier-stage deals in hopes of snagging ownership in hot companies.\n  After chatting with Seseri more and a number of other venture capitalists about the concept, a second dynamic emerged. Namely that the “typical” early-stage funding round, as Seseri described it, was “becoming the atypical because of the rise of preemptive rounds [in which] typical expectations on metrics go out the window.”\n  The Exchange explores startups, markets and money.   Read it  every morning on Extra Crunch or get  The Exchange newsletter every Saturday.\n  Series As, she said, could come mere months after a seed deal, and Series B rounds were seeing expected revenue thresholds tumble in part to “large, multi-asset players that have come down market and are offering a different product than typical VCs — very fast term sheets, no active involvement post-investment, large investments amounts and high valuations.”\n Focusing on just the Series A dynamic, the old rule of thumb that a startup would need to reach $1 million in annual recurring revenue (ARR) is now often moot. Some startups are delaying their A rounds until they reach $2 million in ARR thanks to ample seed capital.\n While some startups delay their A rounds, others raise the critical investment earlier and earlier, perhaps with even a few hundred thousand in ARR.\n What’s different between the two groups? Startups with “elite status” are able to jump ahead to their Series A, while other founders spend more time cobbling together adequate seed capital to get to sufficient scale to attract an A.\n The dynamic is not merely a United States phenomenon. The two-tier venture capital market is also showing up in Latin America, a globally important and rapidly expanding startup region. (Brazilian fintech startup Nubank, for example,  just closed a $750 million round.)\n This morning, we’re diving into the Latin American venture capital market and its early-stage dynamics. We also have notes on the European scene, so expect more on the topic next week. Let’s go!\n  Mega-rounds are no longer an exception in Latin America; in fact, they have become a trend, with ever-larger rounds being announced over the last few months.\n The announcements themselves often emphasize round size: For instance, the recent $100 million Series B round into Colombian proptech startup Habi was  touted as “the largest Series B for a startup headquartered in Colombia.” This follows other 2021 records such as “the largest Series A for Mexico ” —  $65 million for online grocer Jüsto — and “the largest Series A ever raised by a Latin American fintech” —   $43 million for  “Plaid for Latin America” Belvo.", "posttime": "2021-06-26 01:20:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,美国,venture,拉丁美洲", "title": "像美国一样，一个双层风险投资市场正在拉丁美洲出现 ", "title_en": "\n\t\t\t\tLike the US, a two-tier venture capital market is emerging in Latin America\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/like-the-us-a-two-tier-venture-capital-market-is-emerging-in-latin-america/", "via": "", "real_tags": ["风险投资", "美国", "venture", "拉丁美洲"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新消息警告结果，结果是“快速变化”，可能还不包括可靠的来源\n    谷歌在搜索可能具有较差结果的主题时，谷歌已启动警告用户，作为其努力解决搜索引擎上的“数据空白”的一部分。\n 新的警告是由Renee Diresta发现的，这是一个在斯坦福大学误导的学术界。 “它看起来像这些结果正在快速变化，”谷歌现在小心用户。 “如果这个主题是新的，它有时需要花时间以通过可靠的来源添加结果。”\n  “我第一次看到谷歌搜索的这种回复，”Diresta说。 “沟通某事的积极步骤是新闻/突破（我的搜索是为了打破文化战争故事），并突出这个事实并非所有已知或与发生的事情共识。”\n 虽然社交媒体经常与错误信息相关联，但研究人员长期以来一直注意到搜索引擎可以成为传播虚假的强大工具。数据空白，搜索引擎查询几乎没有结果，通常可能导致偏出过度的突出 - 打破新闻的特别关注。\n 在一个Blogpost，Danny Sullivan，谷歌搜索的公共联络人说：“我们已经训练过我们的系统来检测一个主题快速发展的话，尚未称重。我们现在将显示通知表示可以最好地回顾一下从更广泛的来源范围的信息。“\n 警告往往会出现有很多最近点击的搜索，但很少有信誉良好的网站。例如，最近关于在威尔士的不明飞行物瞄准的报告迅速在阴谋理论家中迅速传播，但没有少的主流关注。这意味着搜索“UFO 106英里/小时”术语短暂提出警告，Sullivan告诉Tech网站重新汇编。 \n“有人在威尔士释放出来的警察报告视频，它有一点点新闻报道。 但它仍然没有很多关于它的事情，“沙利文说。 “但是人们可能正在寻找它，他们可能会在社交媒体上进行解决 - 所以我们可以告诉它开始趋势。 我们也可以告诉那里的东西并没有很多必然的东西。 我们也认为可能是新的东西会出现。“ ", "note_en": "New message warns that results are ‘changing quickly’ and may not yet include reliable sources\n    Google has started warning users when they search for a topic that is likely to have poor results, as part of its effort to tackle “data voids” on the search engine.\n The new warning was spotted by  Renee DiResta, an academic who studies misinformation at Stanford University. “It looks like these results are changing quickly,” Google will now caution users. “If this topic is new, it can sometimes take time for results to be added by reliable sources.”\n  “First time I’ve seen this response from Google Search,” DiResta said. “Positive step to communicating that something is newsy/breaking (my search was for a breaking culture war story), and highlighting that facts are not all known or consensus on what happened is still being formed.”\n While social media is regularly linked with misinformation, researchers have long cautioned that search engines can be powerful tools for spreading falsehoods.  Data voids, search engine queries that have little to no results, can often lead to fringe claims being given undue prominence – a particular concern for breaking news.\n In a blogpost, Danny Sullivan, public liaison for search at Google, said: “We’ve trained our systems to detect when a topic is rapidly evolving and a range of sources hasn’t yet weighed in. We’ll now show a notice indicating that it may be best to check back later when more information from a wider range of sources might be available.”\n The warning tends to appear for searches with a lot of recent hits, but few from reputable sites. For instance, a recent report of a UFO sighting in Wales had spread rapidly among conspiracy theorists, but had little mainstream attention. That meant that a search for the terms “ufo 106 mph” briefly brought up the warning, Sullivan  told the tech site Recode.\n “Someone had gotten this police report video released out in Wales, and it’s had a little bit of press coverage. But there’s still not a lot about it,” Sullivan said. “But people are probably searching for it, they may be going around on social media – so we can tell it’s starting to trend. And we can also tell that there’s not a lot of necessarily great stuff that’s out there. And we also think that maybe new stuff will come along.”", "posttime": "2021-06-26 01:14:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,警告,starts,可能", "title": "如果搜索结果可能很差，谷歌开始警告用户 ", "title_en": "Google Starts Warning Users If Search Results Are Likely To Be Poor", "transed": 1, "url": "https://www.theguardian.com/technology/2021/jun/25/google-starts-warning-users-if-search-results-are-likely-to-be-poor", "via": "", "real_tags": ["google", "谷歌", "警告", "starts", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068275, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我只想在几个月内使用它后分享我对Kafka的想法，始终从实际的角度来看。我对Kafka Internals的基础知识不了解。我知道日志处理的原则等，但从来没有让我的手脏了。所以这只是新人的意见，而不是专家。\n  一切都开始，因为我们开始看到活动收集用例：一个网站，具有相当大的流量，想要收集活动，以实时测量发生的事情。像Google Analytics的定制版本，但没有采样。我们在过去几个月里工作了与Kafka一体化，以涵盖这些用例。\n  我必须承认我偏向了Kafka，我认为这是一个大型，复杂的技术，只添加了额外的复杂性。\n  我仍然认为是一样的，它很复杂，将Kafka添加到您的堆栈将添加一堆服务和一些额外的决策，以便进行配置等。在大多数情况下，将数据发送到文件的单个进程应用程序和服务器的小型HTTP服务器，在更少的停机时间内将执行更好。如果您比较了解，设置，配置和开始使用的负担，例如Redis，这是一个大量的工作。\n  当然，当事情变得困难时，当Kafka闪耀以及所有复杂性的时候，这些复杂性使您可以灵活地解决大量负载和复杂的生产者，消费者，处理器用例。但即使在这种情况下，你也需要不仅仅是Kafka 101。\n  为了诚实，这是真的，无论你使用什么技术，一个简单的负载平衡器都可以成为在某些情况下保持的噩梦。高负荷软件项目总是以某种方式变得复杂，与F1汽车需要高度复杂的系统，一堆工程师和力学，并持续维护快速，软件项目也是如此。\n  这里的关键是你多久达到复杂程度;理想情况下，工具应在您的项目中变得复杂。 \n无论如何，关于Kafka最有趣的事情是它使得它可以在规模上实现一些非常有用的东西：一个明确的方式来协调和测量和缩放数据消耗。我想知道为什么HTTP负载平衡器没有得到Kafka的消费者方法。和同样的指标。和一个非HTTP协议和协调工作人员的方式:)\n  坐标：Kafka不仅依靠服务器做事，客户知道“我应该消耗的分区是什么分区”。或者在经纪之间的负载平衡。\n  缩放：当您通过查看未处理的消息的数量时，您可以清楚地耗尽更多的计算能力。这听起来很明显，但这并不是，至少对我来说。这是一个非常古老的排队问题，可以理解和衡量（从电信系统的早期征收有很多关于排队的理论），但通常隐藏在大多数软件中。\n  Kafka不是唯一做这些事情的工具，我猜所有留言经纪人都这样做，但我从未使用过他们。\n  无论如何，我不知道的一些实用信息，但希望我知道：\n  您需要了解更多的事情，而不是预期的能够使用它：分区，消息，分配，经纪人，消费者，不同类型的超时......那就是表面。\n  自行建立群集是屁股的痛苦。使用汇合云是昂贵的，但它只是有效，这就是人们使用它的原因。 \n即使对于本地安装，Kafka也是一个皮塔饼。我建议使用RedPanda，一个命令，你有一个兼容Kafka兼容API和运行。没有动物园，没有docker-compose，没有kubernetes。\n  Kafka没有一个很好的HTTP界面（有充分的原因）。 HTTP代理是默认选择，但云云不提供（RedPanda Do）。我认为使用自定义协议是正确的选择，但是在基于HTTP的系统和Kafka之间存在阻抗不匹配（虽然不在所有情况下）。\n    管理消费者的错误很难。好的部分是数据在kafka中，所以你可以重播它，但是如果问题是你处于更大的麻烦的逻辑问题（不是颞小故障）。本文解释说很好。\n  所以，如果你问我，你需要知道在将Kafka添加到堆栈之前要做什么，但它确实会在您的平台使用开始增长时带来非常好的架构模式。\n  我们现在幸福地摄取了数百万的每分钟活动，几个月，没有任何重大问题。实际上，Kafka从一些复杂的情况下救了我们。可能是一个快速的HTTP服务器写入文件的批处理也将有效，但我认为当你想在没有太多痛苦的情况下缩放罢工时，Kafka是一个很好的解决方案。 ", "note_en": "I just want to share my thoughts on Kafka after using it for a few months, always from a practical point of view. I don’t know anything more than the basics about Kafka internals. I knew the principles of log processing and so on but had never got my hands dirty. So this is just the opinion of a newcomer, not an expert.\n  Everything began because we started seeing event-gathering use cases: a website, with a reasonably high amount of traffic that wants to gather events, to measure in real-time what’s going on. Like a customized version of Google analytics but without sampling. We’ve spent the last few months working on an integration with Kafka to cover these use cases.\n  I have to admit that I was biased against Kafka, I thought it was a large, complex piece of technology that added nothing but an extra layer of complexity.\n  I still think the same, it is complex, adding Kafka to your stack will add a bunch of services and some extra decisions to make about configuration and so on. In most cases, a single process app sending data to a file and a small HTTP server serving it will perform much better with less downtime. If you compare the burden of understanding, setting-up, configuring and starting to use compared to, for example, Redis, it’s a massive amount of work.\n  Of course, when things get difficult is when Kafka shines and all that complexity gives you the flexibility to tackle massive amounts of load and complex producer, consumer, processor use cases. But even in this situation, you’ll need to know much more than just Kafka 101.\n  To be honest, this is true no matter what tech you use, a simple load balancer can become a nightmare to maintain under certain circumstances. High-load software projects always get complex somehow, in the same way that an F1 car needs a highly complex system, a good bunch of engineers and mechanics, and constant maintenance to go fast, so does a software project.\n  The key here is how soon you hit the complexity; ideally, a tool should become complex as your project does.\n  Anyway, the most interesting thing about Kafka is that it enables something pretty useful for projects at scale: a clear way to coordinate and measure and scale data consumption. I’m wondering why HTTP load balancers didn’t get the consumer approach of Kafka. And the same kind of metrics. And a non-HTTP protocol and a way to coordinate workers :)\n  Coordinate: Kafka doesn’t only rely on the server to do things, clients know things like “What partition I should consume.” or load-balancing between brokers.\n  Scale: when consuming it is clear when you need more computing power just by looking at the number of unprocessed messages. This sounds obvious to do but it’s not, at least to me. This is a pretty old queueing problem that is useful to understand and measure (there is a lot of theory written about queueing from the early days in telecommunication systems) but it’s usually hidden in most pieces of software.\n  Kafka is not the only tool that does these things, I guess all message brokers do this but I never used them.\n  Anyway, some practical information that I didn’t know but wish I had known:\n  You need to know more things than I expected to be able to use it: partitions, messages, assignments, brokers, consumers, different kinds of timeouts… and that’s just the surface.\n  Setting up a cluster by yourself is a pain in the ass. Using Confluent cloud is expensive but it just works, that’s why people use it.\n  Even for a local install, Kafka is a PITA. I recommend using  Redpanda, a single command and you have a Kafka compatible API up and running. No Zookeeper, no docker-compose up, no Kubernetes.\n  Kafka does not have a good HTTP interface (for a good reason). HTTP Proxy is the default choice but Confluent cloud does not provide it (Redpanda does). I think using a custom protocol is the right choice but there is an impedance mismatch between HTTP based systems and Kafka (although not in all cases).\n    Managing errors in consumers is hard. The good part is that the data is in Kafka so you can replay it but the bad part is that if the problem is a logic problem (not a temporal glitch) you are in bigger trouble.  This article explains it pretty well.\n  So, if you ask me, you need to know what you are doing before you add Kafka to your stack but it does bring really good architectural patterns when your platform usage starts to grow.\n  We have been happily ingesting millions of events per minute for some months now, without any major problems. Actually, Kafka saved us from some complicated situations. Probably a fast HTTP server writing batches to a file would also have worked but I think that when you want to scale things up without much pain Kafka is a good solution.", "posttime": "2021-06-26 01:13:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kafka,starting", "title": "从Kafka开始 ", "title_en": "Starting with Kafka", "transed": 1, "url": "https://blog.tinybird.co/2021/06/25/starting-with-kafka/", "via": "", "real_tags": ["kafka", "starting"]}]