[{"category": "", "categoryclass": "", "imagename": "972c454cfc6a7a791155472cb14ffe65.jpg", "infoid": 1028828, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当Lucid Motors在9月份发布其新款电动汽车的最终量产版时，唯一不喜欢的就是价格。Air Dream Edition的规格令人瞠目结舌：1080马力(805kW)，2.5秒内从零到60英里每小时，续航里程503英里(810公里)。但这辆满载的超级轿车的MSRP售价为16.9万美元，与他们的价格不相上下。\n更便宜的版本也宣布了，价格分别为13.9万美元(空中大巡回赛)和9.5万美元(空中巡回赛)，卢西德告诉我们，入门级的Air也将在适当的时候上市，价格在8万美元以下。&(所有这些价格都没有考虑美国国税局7500美元的税收抵免或任何国家激励措施。)(所有这些价格都没有考虑到美国国税局(IRS)7500美元的税收抵免或任何州政府的激励措施。)。周三，它填补了最后的空白。", "note_en": "When  Lucid Motors revealed the final production version of its  new electric vehicle in September, the only thing not to like was the price. The specs for the Air Dream Edition were eye-opening: 1,080hp (805kW), zero to 60mph in 2.5 seconds, and a range of 503 miles (810km). But they were matched by the MSRP—$169,000 for this fully loaded hypersedan.\n Cheaper versions costing $139,000 (the Air Grand Touring) and $95,000 (the Air Touring) were also announced, and Lucid told us that an entry-level Air would also arrive in due time, at &#34;under $80,000.&#34; (All these prices are before taking into account the $7,500 IRS tax credit or any state incentives.) On Wednesday, it filled in that final blank.", "posttime": "2020-10-15 00:31:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "马达,single,价格", "title": "现在有了更便宜的单马达版本的Lucid Air EV", "title_en": "Now there’s a cheaper, single-motor version of the Lucid Air EV", "transed": 1, "url": "https://arstechnica.com/cars/2020/10/theres-a-new-entry-level-lucid-air-electric-car-starting-at-77400/", "via": "", "real_tags": ["马达", "single", "价格"]}, {"category": "", "categoryclass": "", "imagename": "b951098fb8cc3b43136d44f6bedbebe5.jpg", "infoid": 1028827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于今年流行的远程工作和社交热潮，该平台的财富大幅增长。自4月份以来，该平台一直在努力重启其在安全和隐私领域遭受重创的声誉-此前，该平台被指拥有E2E加密的误导性营销说法(当时它没有)。不过，e2e现在终于上路了。\n该公司在一篇博客文章中写道：“我们很高兴地宣布，从下周开始，Zoom的端到端加密(E2EE)服务将作为技术预览版提供，这意味着我们将在前30天积极征求用户的反馈。”全球的Zoom用户(免费和付费)可以在Zoom上接待多达200名参与者参加E2EE会议，从而为您的Zoom会议提供更高的隐私和安全性。“。\nZOOM在5月份收购了KeyBase，当时表示它的目标是开发“使用最广泛的企业端到端加密产品”。\n然而，首席执行官埃里克·袁(Eric袁)最初表示，这一级别的加密将仅为付费用户保留。但在面临暴风雨般的批评后，该公司在6月份迅速180度大转弯，表示将为所有用户提供最高级别的安全保障，无论他们是否付费使用其服务。\nZoom今天证实，想要访问E2EE的免费/基础用户将需要参与一次性验证过程-在此过程中，它将要求他们提供额外的信息，例如通过短信验证电话号码-表示正在实施这一过程，以试图减少“大量创建滥用账户”。\n“我们相信，通过实施基于风险的身份验证，结合我们目前的工具组合-包括我们与人权和儿童安全组织的合作，以及我们的用户锁定会议、报告滥用情况的能力，以及作为我们安全图标的一部分提供的无数其他功能-我们可以继续增强用户的安全，”它写道。\n下周推出的技术预览版是将E2E加密引入该平台的四个阶段过程的第一阶段。\n这意味着有一些限制-包括在E2EE Zoom Meetings中可用的功能(您将无法在主持前加入、云录制、流媒体、实时转录、分组会议室、投票、1：1私人聊天和会议反应)；以及可用于加入会议的客户端(对于第一阶段，所有E2EE会议参与者必须从Zoom桌面客户端、移动应用程序或Zoom Room加入)。\n根据Zoom的博客，E2EE推出的下一阶段-将包括“更好的身份管理和E2EE SSO集成”-“暂定”定于2021年。\n从下周开始，想要查看技术预览的客户必须在帐户级启用E2EE会议，并在每次会议的基础上选择加入E2EE。\n所有会议参与者必须启用E2EE设置才能加入E2EE会议。Zoom在常见问题解答中指出，主机可以在帐户、组和用户级别启用E2EE设置，并且可以在帐户或组级别锁定。\n正在使用的AES 256位GCM加密与Zoom目前使用的相同，但这里结合了公钥加密-这意味着密钥在分发给与会者之前由会议主持人在本地生成，而不是由Zoom的云执行密钥生成角色。\n“Zoom的服务器变成了不经意的中继，永远看不到解密会议内容所需的加密密钥，”它解释了E2EE的实现。\n如果您想知道如何确定您已经加入了E2EE Zoom会议，在会议屏幕左上角的绿色盾牌图标上方会显示一个深色挂锁。(ZOOM的标准GCM加密在此处显示复选标记。)。\n会议参与者还将看到会议负责人的安全代码，他们可以使用该代码来验证连接是否安全。“主持人可以大声读出这个代码，所有参与者都可以检查他们的客户是否显示了相同的代码，”Zoom指出。", "note_en": "The platform, whose fortunes have been supercharged by the pandemic-driven boom in remote working and socializing this year, has been  working on rebooting its battered reputation in the areas of  security and privacy since April — after it was called out on misleading marketing claims of having E2E encryption (when it  did not). E2E is now finally on its way though.\n “We’re excited to announce that starting next week, Zoom’s end-to-end encryption (E2EE) offering will be available as a technical preview, which means we’re proactively soliciting feedback from users for the first 30 days,” it writes in a blog post. “Zoom users — free and paid — around the world can host up to 200 participants in an E2EE meeting on Zoom, providing increased privacy and security for your Zoom sessions.”\n  Zoom acquired Keybase in May,  saying then that it was aiming to develop “the most broadly used enterprise end-to-end encryption offering”.\n However, initially, CEO Eric Yuan said this level of encryption would be reserved for fee-paying users only. But after facing  a storm of criticism the company enacted a  swift U-turn — saying in June that all users would be provided with the highest level of security, regardless of whether they are paying to use its service or not.\n Zoom confirmed today that Free/Basics users who want to get access to E2EE will need to participate in a one-time verification process — in which it will ask them to provide additional pieces of information, such as verifying a phone number via text message — saying it’s implementing this to try to reduce “mass creation of abusive accounts”.\n “We are confident that by implementing risk-based authentication, in combination with our current mix of tools — including our work with human rights and children’s safety organizations and our users’ ability to lock down a meeting, report abuse, and a myriad of other features made available as part of our security icon — we can continue to enhance the safety of our users,” it writes.\n Next week’s roll out of a technical preview is phase 1 of a four-stage process to bring E2E encryption to the platform.\n This means there are some limitations — including on the features that are available in E2EE Zoom meetings (you won’t have access to join before host, cloud recording, streaming, live transcription, Breakout Rooms, polling, 1:1 private chat, and meeting reactions); and on the clients that can be used to join meetings (for phase 1 all E2EE meeting participants must join from the Zoom desktop client, mobile app, or Zoom Rooms).\n The next phase of the E2EE rollout — which will include “better identity management and E2EE SSO integration”, per Zoom’s blog — is “tentatively” slated for 2021.\n From next week, customers wanting to check out the technical preview must enable E2EE meetings at the account level and opt-in to E2EE on a per-meeting basis.\n All meeting participants must have the E2EE setting enabled in order to join an E2EE meeting. Hosts can enable the setting for E2EE at the account, group, and user level and can be locked at the account or group level, Zoom notes in an FAQ.\n The AES 256-bit GCM encryption that’s being used is the same as Zoom currently uses but here combined with public key cryptography — which means the keys are generated locally, by the meeting host, before being distributed to participants, rather than Zoom’s cloud performing the key generating role.\n “Zoom’s servers become oblivious relays and never see the encryption keys required to decrypt the meeting contents,” it explains of the E2EE implementation.\n If you’re wondering how you can be sure you’ve joined an E2EE Zoom meeting a dark padlock will be displayed atop the green shield icon in the upper left corner of the meeting screen. (Zoom’s standard GCM encryption shows a checkmark here.)\n Meeting participants will also see the meeting leader’s security code — which they can use to verify the connection is secure. “The host can read this code out loud, and all participants can check that their clients display the same code,” Zoom notes.", "posttime": "2020-10-15 00:27:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下周,start,zoom", "title": "\n缩放以开始下周E2E加密推广的第一阶段", "title_en": "\n\t\t\t\tZoom to start first phase of E2E encryption rollout next week\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/zoom-to-start-first-phase-of-e2e-encryption-rollout-next-week/", "via": "", "real_tags": ["下周", "start", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "3363ebe2043b5f0245f2a3e81de99432.jpeg", "infoid": 1028826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果挖走了谷歌“零项目”(Project Zero)的一名关键成员，该团队是谷歌的一个黑客团队，在苹果的iOS和其他关键苹果软件中发现了数十个严重漏洞。\n去年，苹果和谷歌就Project Zero在iOS中发现的一系列漏洞展开了争执，苹果暗示谷歌夸大了这些漏洞。大约一年后，布兰登·阿扎德(Brandon Azad)于10月初在Twitter上宣布，他将离开谷歌的精英黑客团队，加入苹果。\n阿扎德写道：我在“零度计划”的队友是我见过的最善良、最聪明的人之一，我从他们身上学到了很多。我会很怀念和团队里的每个人一起工作的。感谢你们所有这些美妙的经历，并继续黑客！&#34；\n阿扎德被广泛认为是不为苹果工作的最好的iPhone黑客之一，他在无数的安全建议中被苹果点名，并在世界各地的主要网络安全会议上展示了关于苹果产品的高度技术性的发现。去年，母板对Project Zero进行了简介，并透露苹果一直试图挖走阿扎德的同事伊恩·比尔(Ian Beer)。\n你在苹果公司工作吗？或者你做iOS和其他苹果产品的研究？我们很想听到你的消息。您可以通过Signal安全地联系Lorenzo Franceschi-Bicchierai，电话：+1 917 257 1382，Wickr/Wire电子邮件：lorenzofb@vice.com。\n几周后，比尔写了一系列博客文章，披露政府黑客在iPhone中使用了多个未知漏洞-称为零日漏洞。比尔在苹果的代码中发现了数十个漏洞--市场价值一度超过200万美元--他也是一名受人尊敬的iPhone黑客。几年前，世界上最顶尖的独立iPhone黑客之一告诉我，啤酒是他的榜样。(记者无法联系到啤酒请其置评。)。\n这可能是苹果重新承诺在安全实践方面引领行业的一部分，或者至少在这方面更加透明和主动。\n当然，仅靠阿扎德并不能改变一切，苹果多年来一直在雇佣顶级黑客，其中包括几名曾为美国、英国、法国和其他国家的间谍机构从事黑客工作的人。\n根据一位专门从事网络安全的国防承包商的说法，从Project Zero挖走Azad对苹果来说是一笔相当不错的招聘。\n干得好，苹果，这位承包商告诉主板，他没有被授权向媒体发表讲话。\n然后他开玩笑说，iOS越狱者很难过，因为他们会错过阿扎德的免费研究，他指的是他的博客帖子，这些帖子可以用来创造更多的零日。\n苹果产品安全团队负责人Ivan Krstić在业内广受尊敬，他曾于2016年和2019年出现在黑帽上，介绍苹果备受期待但进展缓慢的漏洞赏金计划，并发出信号表明，他的公司比以前更愿意与安全社区打交道。Krstić没有立即回复记者的置评请求。\n与此同时，批评人士猛烈抨击苹果起诉一家初创公司，该公司向希望简化黑客流程的安全研究人员提供虚拟版本的iPhone，以及向希望在多个iOS版本上测试iOS应用的科技公司提供虚拟版本的iPhone。\n对苹果来说，10月可能是个吉利的月份。新的安全公关，新的iPhone黑客，哦，新的iPhone！\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "Apple has poached a key member of Google&#39;s Project Zero, a hacking team at Google that has found dozens of critical vulnerabilities in Apple&#39;s iOS and other critical Apple software.\n  Last year, Apple and Google fought over a series of vulnerabilities that Project Zero discovered in iOS, with Apple suggesting that Google was  overselling the vulnerabilities.  About a year later, Brandon Azad announced on Twitter at the beginning of October that he was leaving  Google&#39;s elite team of hackers to join Apple.\n   &#34;My teammates at Project Zero have been among the kindest and smartest people I&#39;ve met, and I&#39;ve learned so much from them,&#34; Azad wrote. &#34;I&#39;ll really miss working alongside everyone on the team. Thank you all for these wonderful experiences, and keep on hacking!&#34;\n  Azad has been widely considered one of the best iPhone hackers who didn&#39;t work for Apple, being named by Apple in  countless security advisories, and presenting highly technical findings on Apple&#39;s products at  major cybersecurity conferences around the world. Last year, Motherboard profiled Project Zero and revealed that Apple had been trying to poach a colleague of Azad, Ian Beer.\n Do you work at Apple? Or do you do research on iOS and other Apple products? We’d love to hear from you. You can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, Wickr/Wire at lorenzofb, or email  lorenzofb@vice.com\n  A few weeks later, Beer  wrote a series of blog posts revealing that government hackers had used multiple unknown vulnerabilities—called zero-days—in iPhones. Beer  has found dozens bugs in Apple&#39;s code—at one point worth more than $2 million in the market—and is also a revered iPhone hacker. Years ago, one of the top independent iPhone hackers in the world told me that Beer was his role model. (Beer could not be reached for comment.)\n   This may be part of a renewed commitment by Apple to lead the industry in security practices, or at least be more transparent and proactive about it.\n  Of course, Azad alone won&#39;t change everything, and Apple had been hiring top hackers for years, including several who used to hack for spy agencies in the US, UK, France, and other countries.\n   Poaching Azad from Project Zero is &#34;a pretty good damn hire&#34; for Apple, according to a defense contractor who specializes in cybersecurity.\n  &#34;Good job Apple,&#34; the contractor, who is not authorized to speak to the press, told Motherboard.\n   He then joked that &#34;iOS jailbreakers are sad because they&#39;re going to miss Azad&#39;s free research,&#34; referring to his blog post that could then be used to create more zero-days.\n  The head of Apple Product Security team,  Ivan Krstić, is himself widely respected in the industry, and has appeared at Black Hat in  2016 and  2019, to introduce Apple&#39;s much anticipated— but slow cooking— bug bounty program, and to signal that his company is more open to engage with the security community than before. Krstić did not immediately respond to a request for comment.\n  At the same time,  critics have slammed Apple for suing a startup that was providing virtual versions of iPhones to security researchers  who wanted to streamline their hacking processes, as well as to tech companies who wanted to test their iOS apps on multiple iOS versions.\n      October may be an auspicious month for Apple. New security PR, new iPhone hacker, and oh, new iPhones!\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-10-15 00:27:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,黑客,apple,苹果", "title": "苹果正在从谷歌的iPhone黑客团队挖人", "title_en": "Apple Is Poaching From Google's iPhone Hacking Team", "transed": 1, "url": "https://www.vice.com/en/article/g5pznq/apple-is-poaching-from-googles-iphone-hacking-team", "via": "", "real_tags": ["谷歌", "google", "黑客", "apple", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "699e7eb401992c305e4a4f03b79f7ab5.png", "infoid": 1028825, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zoom已经证实，它将于下周开始推出端到端加密(E2EE)，首先是技术预览，收集用户在前30天的反馈，随后将在全面发布之前再进行三个阶段。\n这一声明是其今天一年一度的Zoomtopia活动的一部分，在活动中，它还推出了一个新的课程和活动集成平台，以及其新的Zapps平台，将第三方应用程序直接带入视频通话。\n对于Zoom来说，E2EE已经到来了很长一段时间，这家视频通信巨头今年早些时候公布了只向付费计划中的人提供E2EE的计划，引发了巨大的争议。隐私权倡导者和民权组织争辩说，基本的安全功能不应该是一个高级功能，迫使Zoom走回头路，向所有用户承诺这一功能。Zoom最初计划的目的是否定对其服务的邪恶使用，并阻止不良行为者大规模创建辱骂账户。Zoom表示，作为更新计划的一部分，寻求E2EE的免费用户将不得不接受一次性验证过程，这可能涉及不得不提供他们的手机号码。\n通过E2EE，Zoom建立在其现有的GCM加密的基础上，除了会议主持人不是由Zoom的服务器管理加密密钥过程，而是生成加密密钥并使用公钥加密技术将密钥分发给每个参与者。换句话说，Zoom不知道也不能访问解密视频聊天内容所需的密钥-解密密钥是本地生成并存储在用户机器上的。\n左上角的一个小绿色盾牌日志告诉用户呼叫受E2EE保护，所有参与者都可以看到会议主持人的安全代码，并将其与屏幕上的代码进行核对。\n要在下周开始使用E2EE，主持人必须在他们的账户设置中激活E2EE，然后为他们参加的每个会议选择加入E2EE-所有参与者都可以在自己的Zoom应用程序中启用E2EE来加入通话。在第1阶段，E2EE呼叫的某些功能和特性将被禁用，例如分组会议室、云记录、轮询、实时转录、一对一聊天和反应。\nZoom没有给出下三个E2EE阶段的具体时间表，但它确实表示，第二阶段“2021年初步规划了路线图”，计划引入“更好的身份管理”和E2EE SSO(单点登录)集成。", "note_en": "Zoom has confirmed that it will begin rolling out end-to-end encryption (E2EE)  next week, starting with a technical preview to glean feedback from users for the first 30 days, which will be followed by an additional three phases ahead of its full launch.\n The announcement came as part of its annual Zoomtopia event today, where it also launched  a new integrated platform for classes and events and  its new Zapps platform to bring third-party apps directly into video calls.\n   E2EE has been a long time coming for Zoom, with the video communications giant creating significant controversy earlier this year when it  revealed plans to make E2EE available only to those on a paid plan. Privacy advocates and civil rights groups argued that basic security functionality shouldn’t be a premium feature, forcing  Zoom to backtrack and promise the functionality to all users. The purpose of Zoom’s original plan was to negate nefarious use of its service and deter bad actors from mass-creating abusive accounts. As part of its updated plan, Zoom said that free users seeking E2EE will instead have to go through a one-time verification process, which may involve having to provide their mobile phone number.\n With E2EE, Zoom builds on its existing GCM encryption, except rather than Zoom’s servers managing the encryption key process, the meeting host generates the encryption keys and uses public key cryptography to distribute the keys to each participant. In other words, Zoom has no knowledge or access to the keys needed to decrypt video chat content — the decryption keys are generated and stored locally on users’ machines.\n A little green shield log in the top-left tells users that the call is protected by E2EE, and all participants will be able to see the meeting host’s security code and check it against the code on their screen.\n  To start using E2EE next week, hosts must activate E2EE in their account settings and then opt-in to it for each meeting that they are on — all participants much enable E2EE in their own Zoom app to join a call. During phase 1, certain functionality and features will be disabled for E2EE calls, such as breakout rooms, cloud recording, polling, live transcription, one-to-one chats, and reactions.\n Zoom hasn’t given a concrete timeframe for the next three E2EE phases, but it did say that phase 2 is “tentatively roadmapped for 2021” for which it plans to introduce “better identity management” and E2EE SSO (single sign-on) integration.", "posttime": "2020-10-15 00:26:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,rolling,e2ee", "title": "Zoom表示，它将于下周开始推出端到端加密，首先是技术预览，然后是另外三个阶段", "title_en": "Zoom says it will begin rolling out end-to-end encryption next week, starting with a technical preview followed by three additional phases", "transed": 1, "url": "https://venturebeat.com/2020/10/14/zoom-prepares-to-roll-out-end-to-end-encryption-in-4-phases/", "via": "", "real_tags": ["表示", "rolling", "e2ee"]}, {"category": "", "categoryclass": "", "imagename": "01580a5308ec84cbd08ed78b9d9873f6.png", "infoid": 1028824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "内容递送网络(CDN)指的是地理上分布的一组服务器，它们协同工作以提供因特网内容的快速递送。\nCDN允许快速传输加载Internet内容所需的资产，包括HTML页面、JavaScript文件、样式表、图像和视频。CDN服务的受欢迎程度持续增长，如今大部分网络流量都是通过CDN提供服务的，包括来自Facebook、Netflix和Amazon等主要网站的流量。\n正确配置CDN还可以帮助网站抵御一些常见的恶意攻击，如分布式拒绝服务(DDOS)攻击。\nTL；DR A CDN是一个遍布世界各地的计算机网络，可以高效地提供内容。\n我经常发现自己需要托管公共静态文件。我希望以一种快速、高效、可靠和可伸缩的方式来实现。\n我还发现它在Reddit上很流行，谁知道还能去哪里呢。长话短说。一眨眼的功夫，我的域名就有了大量的流量。\n就在几周前，我非常幸运地将joel.net搬到了Hashnode。我之前的网络主机不可能处理那么多的流量。即使在流量激增期间，joel.net也一直在线。\n因为我还托管其他文件，所以我最好做好准备。所以我计划使用完整的CDN。\n这就是云焰的用武之地。我使用它们来托管joel.net的DNS。默认情况下，CloudFlare将通过免费的DNS提供这些CDN功能。🔥。\n你可以使用任何静态的网络主机，但是我选择S3是因为它是我已经熟悉的。\nS3存储桶名称必须与域名匹配。在本例中，我使用cdn.joel.net作为我的存储桶名称。\n现在，我需要将此存储桶配置为公共访问。因此，我转到权限，然后转到存储桶策略。\n我将存储桶名称cdn.joel.net插入到Resource中，然后将其粘贴到存储桶策略编辑器中。\n{：&#34；2012-10-17&#34；，：：[{：&#34；PublicReadGetObject&#34；，：&#34；Allow&#34；，：&#34；*&#34；，：&#34；s3：GetObject&#34；，：&#34；ARN：aws：s3：：cdn.joel.net/*&#34；}]}。\n我选中了使用这个存储桶来托管一个网站，并设置了我的index.html和我的404/404.html。我将为我的404创建一个目录，这样我也可以在那里托管与404相关的资产。\n此时，我可以上传一个文件，并通过从此页面访问终结点来确保它正常工作。\n最后一步是设置我的Cloudflare DNS以指向我新创建的S3存储桶。\n为此，我添加了一个名为CDN的新CNAME记录，并将目标设置为S3存储桶的域。\n此时，我应该可以使用我的自定义域名访问我的存储桶了。那么让我们测试一下我的404页http://cdn.joel.net.吧。看起来它起作用了！\n现在，为了检查最后一件事，我打开开发人员控制台，单击Network选项卡，单击Request cdn.joel.net并转到Headers。\n这里我可以看到内容编码：br。这意味着HTML是使用Brotli压缩算法压缩的，全部由Cloudflare自动为我完成。\n附：如果设置此设置，请确保您提供的是HTML和相关内容，这样您就不会违反Cloudflare TOS第2.8节。", "note_en": "A content delivery network (CDN) refers to a geographically distributed group of servers which work together to provide fast delivery of Internet content.\n A CDN allows for the quick transfer of assets needed for loading Internet content including HTML pages, javascript files, stylesheets, images, and videos. The popularity of CDN services continues to grow, and today the majority of web traffic is served through CDNs, including traffic from major sites like Facebook, Netflix, and Amazon.\n A properly configured CDN may also help protect websites against some common malicious attacks, such as  Distributed Denial of Service (DDOS) attacks.\n tl;dr A CDN is a network of computers around the world that deliver content efficiently.\n    I often find myself needing to host public static files. I want to do so in a way that is fast, efficient, reliable, and scalable.\n   I also found out it was trending on Reddit and who knows where else. So long story short. My domain had a load of traffic in the blink of an eye.\n  I was lucky enough to have recently moved  joel.net to  Hashnode just weeks earlier. My previous web host would not have been able to handle that amount of traffic. Even during this blast of traffic  joel.net was online the entire time.\n Since I also host other files, I better be prepared. So I plan on going full CDN.\n  This is where  Cloudflare comes in. I use them to host the DNS for  joel.net. Cloudflare will provide these CDN features  by default through their DNS offering, which is also FREE. 🔥\n   You could use any static web host, but I&#39;m choosing S3 for this because it&#39;s what I am already familiar with.\n   The S3 bucket name must match the domain name. In this case, I am using  cdn.joel.net for my bucket name.\n      Now I need to configure this bucket for Public access. So I head over to Permissions, then Bucket Policy.\n  I insert my bucket name,  cdn.joel.net, into  Resource and then paste this into the  Bucket policy editor.\n {  :  &#34;2012-10-17&#34;,  : [ {  :  &#34;PublicReadGetObject&#34;,  :  &#34;Allow&#34;,  :  &#34;*&#34;,  :  &#34;s3:GetObject&#34;,  :  &#34;arn:aws:s3:::cdn.joel.net/*&#34; } ]}\n   I check  Use this bucket to host a website and set up my  index.html and also my  404/404.html. I will create a directory for my 404 so that I can host assets related to the 404 in there as well.\n  At this point, I can upload a file and make sure it works by accessing the  Endpoint from this page.\n  The last step is to set up my Cloudflare DNS to point to my freshly created S3 bucket.\n I do this by adding a new  CNAME record with the name  cdn and the target set as the domain for the S3 bucket.\n  At this point, I should be able to access my bucket using my custom domain name. So let&#39;s test my 404 page  http://cdn.joel.net. Looks like it&#39;s working!\n  Now just to check one last thing, I open the Developer Console, click the  Network tab, click the request  cdn.joel.net and go to  Headers.\n Here I can see  content-encoding: br. That means the HTML was compressed using the Brotli compression algorithm all automatically for me by Cloudflare.\n     p.s. If setting this up, be sure you are serving HTML and related content so you are not in violation of  Cloudflare TOS section 2.8.", "posttime": "2020-10-15 00:21:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "个人,personal,cdn", "title": "我建立了自己的个人CDN", "title_en": "I Set Up My Own Personal CDN", "transed": 1, "url": "https://joel.net/how-i-setup-my-own-personal-cdn-using-cloudflare-and-s3", "via": "", "real_tags": ["个人", "personal", "cdn"]}, {"category": "", "categoryclass": "", "imagename": "92c4637b9b93ad6d788bf3dcc39e97d8.png", "infoid": 1028823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数以百万计的企业，无论大小，都依赖谷歌分析来了解客户的偏好，并为他们创造更好的体验。随着越来越多的商业转移到网上，企业面临着越来越大的压力，需要让每一笔营销收入都变得有价值，来自数字分析工具的见解变得更加关键。\n但随着消费者行为的重大转变，以及隐私驱动的对长期行业标准的改变，目前的分析方法没有跟上步伐。在弗雷斯特咨询公司(Forrester Consulting)的一项调查中，营销人员表示，改善分析的使用是当务之急，现有的解决方案使他们很难全面了解客户并从他们的数据中获得洞察力。\n为了帮助您从长期营销中获得更好的投资回报，我们正在创建一个新的、更智能的Google Analytics，它建立在我们去年在测试版中引入的App+Web属性的基础上。它的核心是机器学习，可以自动提供有用的见解，并让您完全了解跨设备和平台的客户。它在设计上是以隐私为中心的，所以即使行业变化，如对cookie和标识符的限制在您的数据中造成了空白，您也可以依赖Analytics。新的Google Analytics将给你必要的洞察力，让你为下一步做好准备。\n通过应用谷歌先进的机器学习模型，新的Analytics可以自动提醒您注意数据等产品的重大趋势，因为新的客户需求会导致需求上升。它甚至可以帮助您预测客户未来可能采取的行动。例如，它可以计算流失概率，以便在营销预算面临压力的情况下更有效地投资留住客户。我们正在继续增加新的预测指标，比如你可以从特定客户群中赚取的潜在收入。这使您可以创建受众以接触更高价值的客户，并运行分析以更好地了解为什么某些客户可能会比其他客户花费更多，这样您就可以采取行动来改善您的结果。", "note_en": "Millions of businesses, large and small, rely on Google Analytics to understand customer preferences and create better experiences for them. With more commerce moving online and businesses under increased pressure to make every marketing dollar count, insights from digital analytics tools are even more critical.\n  But with major shifts in consumer behavior and privacy-driven changes to longtime industry standards, current approaches to analytics aren’t keeping pace. In  a survey from Forrester Consulting, marketers said that improving their use of analytics is a top priority, and that existing solutions make it difficult to get a complete view of the customer and derive insights from their data.\n  To help you get better ROI from your marketing for the long term, we&#39;re creating a new, more intelligent Google Analytics that builds on the foundation of the App + Web property we  introduced in beta last year. It has machine learning at its core to automatically surface helpful insights and gives you a complete understanding of your customers across devices and platforms. It’s privacy-centric by design, so you can rely on Analytics even as industry changes like restrictions on cookies and identifiers create gaps in your data.  The new Google Analytics will give you the essential insights you need to be ready for what’s next.\n    By applying Google’s advanced machine learning models, the new Analytics can automatically alert you to significant trends in your data - like products seeing rising demand because of new customer needs. It even helps you anticipate future actions your customers may take. For example, it calculates churn probability so you can more efficiently invest in retaining customers at a time when marketing budgets are under pressure. We’re continuing to add new predictive metrics, like the potential revenue you could earn from a particular group of customers. This allows you to create audiences to reach higher value customers and run analyses to better understand why some customers are likely to spend more than others, so you can take action to improve your results.", "posttime": "2020-10-15 00:21:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,客户", "title": "新的Google Analytics", "title_en": "New Google Analytics", "transed": 1, "url": "https://blog.google/products/marketingplatform/analytics/new_google_analytics/", "via": "", "real_tags": ["google", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，在树林里散步后，我写下了令人费解的林木多样性。在我散步的路上，我发现十几个物种共享同一栖息地，显然在争夺同样的资源-主要是获得阳光。生态学原理说，一个物种应该赢得这场比赛，并驱逐所有其他物种，但树木没有读过生态学教科书。\n在那篇文章中，我还提到了另外三个关于树木的问题，这些问题长期以来一直困扰着我。在这部续集中，我想更深入地探讨其他问题。\n植物学家有一个精心设计的词汇来描述叶子的形状：心形(像瓦伦丁心脏)、楔形(楔形)、剑形(剑形)、钩状(像箭头，带有倒钩)、披针形(像矛头)、倒披针形(倒披针形)、掌状(小叶像手指一样放射)、指形(小提琴形)、肾形(肾形)、钩状(锯齿状)、匙形(勺形)。无论如何，这并不是一份完整的清单。\n史蒂文·沃格尔(Steven Vogel)在他2012年出版的“树叶的生活”(The Life Of A Leaf)一书中列举了许多可能对树叶形状产生影响的因素和力量。例如，树叶不能太重，否则会折断支撑它们升起的四肢。另一方面，它们不能太纤细，否则会被风吹得粉碎。树叶也不能产生太大的空气阻力，否则整棵树可能会在暴风雨中倒下。\n树叶的第一项工作是光合作用：收集阳光，将二氧化碳和水分子聚集在一起，合成碳水化合物。高效地这样做会进一步限制设计。树叶应该尽可能地面向太阳，以最大限度地增加吸收的光子流量。但温度控制也很重要；如果叶子太热或太冷，生物合成装置就会关闭。\n沃格尔指出，树叶形状的细微特征可以对热力和空气动力学性能产生可测量的影响。例如，对流冷却在树叶边缘附近最有效；温度随着距离最近的边缘的距离而升高。在过热有风险的环境中，将距离最小化的形状-例如橡树叶的分叶形状-似乎比更简单的盘状形状更有优势。但在褶边和紧凑形式之间的选择也取决于其他因素。具有凸起形状的宽大树叶可以拦截最多的阳光，但这并不总是一件好事。花边设计的叶子让斑驳的阳光穿透进来，让多层叶子分担光合作用的工作。\n自然选择是在这些相互作用的标准之间协商妥协的绝佳工具。如果有某种单一的特征组合对生长在特定栖息地的树叶最有效，我预计进化会找到它。但我看不到有证据表明在最佳解决方案上是收敛的。相反，即使是关系密切的物种也会长出相当独特的叶子。\n请看上图左上角象限的三片橡树叶子。它们显然是一个主题的变体。树叶的共同点是一系列的半岛突起交替地向中心线的左边和右边跳跃。主题上的变化与半岛的数量(这些标本每侧3到5个)、它们的形状(圆形或尖形)以及半岛之间海湾的深度有关。这些变异可以归因于仅仅几个基因位点的遗传差异。但是，为什么树叶会获得这些不同的特征呢？是什么进化力量使圆形的裂片更适合白栎树，而尖形的裂片更适合红橡树和松树呢？\n关于产生叶子形状的发育机制，人们已经了解了很多。在生物化学上，主要的参与者是被称为生长素的植物激素；它们的空间分布和在植物组织中的运输调节着当地的生长速度，从而调节着发育模式。(Jeremy Dkhar和Ashwani Pareek在2014年发表的一篇评论文章非常详细地介绍了树叶形态的这些方面。)。在数学和理论方面，Adam Runions、Miltos Tsiantis和Przemyslaw Prusinkiewicz设计了一种算法，可以生成具有令人印象深刻的逼真度的广谱树叶形状。(他们2017年的论文以及源代码和视频位于algorithmicbotany.org/papers/leaves2017.html.)。使用不同的参数值，相同的程序生成可识别为橡树、枫树、梧桐树等的形状。然而，所有这些工作又一次解决了“如何”的问题，而不是“为什么”的问题。\n树叶的另一个特性-它们的大小-似乎确实以一种简单的方式对进化压力做出反应。在所有陆地植物(不仅仅是树木)中，叶面积的变化幅度为百万分之一-从每片叶子约1平方毫米到1平方米不等。伊恩·J·赖特(Ian J.Wright)及其同事2017年发表的一篇论文报告称，这种变化与气候密切相关。温暖潮湿的地区喜欢大叶子；想想香蕉。寒冷、干燥的环境，如高山山脊，主要是带有更细小叶子的微小植物。所以自然选择在树叶领域是活的，而且很好，只是在形状上看起来没有明确的偏好。\n还是我错过了什么重要的东西？在自然界的其他地方，如果你严格放在优胜劣汰的严峻背景下看待它们，我们会发现华丽的变化似乎是无端的。例如，我在想鸟的化装羽毛。红衣主教和蓝鸟都是我家后院的常客，但我并没有花太多时间怀疑红色或蓝色是在那个栖息地生存的最佳颜色。我也不指望这两个物种会在某种紫色的阴影上交汇。它们艳丽的羽毛不是对物理环境的适应，而是通信系统的组成部分；它们向竞争对手或潜在的配偶发送信号。树叶的形状会不会也发生了类似的事情呢？不同的橡树物种是否保持着独特的叶子，以将自己与有助于授粉或种子传播的动物联系起来？我认为这个主意不太可能，但我没有更好的。\n这个问题当然太简单了！我们知道为什么树会长得很高。他们把手伸向天空。这是他们逃离森林下层阴暗深处并分享阳光的唯一希望。换句话说，如果你是一棵森林树，你需要长高，因为你的邻居很高，他们让你黯然失色。邻居长高是因为你高。这是一场经典的军备竞赛。沃格尔对这一点发表了尖锐的评论：\n在每个独立培育出树状植物的谱系中，各种物种都达到了很高的高度。在我看来那是最愚蠢的…。。我们几乎可以肯定地看到，进化式设计…的局限性是一堂实物课。。\n树干限制条约将允许所有个人生产更多的种子，并在更早的年龄开始生产种子。但是进化，这是一个愚蠢的过程，并没有意识到远见卓识并不是它的强项。\n当然，沃格尔对达尔文进化论的胡言乱语是开玩笑的。但我认为限制身高条约的问题是罗莎琳德·里德(Rosalind Reid)开的玩笑。(或者我们应该称它们为树呢？)。值得更认真地关注。\n美国东部的森林树木通常长到25或30米高，接近100英尺。建造这么高的建筑需要巨大的材料和精力投入。为了保证足够的强度和刚度，树干的围长必须随高度的幂({3}{2})而增加，因此横截面积((pi r^2))随高度的立方而增大。由此推论，树干高度增加一倍，其质量就会乘以16倍。\n高度过高会带来另一项持续的新陈代谢成本。每天，一棵活着的树必须将500升(重500公斤)的水从地面的根区抬到树冠上的叶子上。这就像从一栋建筑的地下室携带足够装满四五个浴缸的水到10楼。\n高度也加剧了对树木生命和健康的某些危害。树干越高，就会形成一个更长的杠杆臂，以应对任何可能倾覆树木的力量。使风险雪上加霜的是，平均风速随着离地面距离的增加而增加。\n站在森林地面上，我向后仰着头，头晕目眩地向上凝视着树叶茂盛的树冠，它们栖息在巨大的木柱上。我情不自禁地认为这些高跷植物是对资源的巨大浪费。它甚至比现在点缀在曼哈顿天际线上的针状亿万富翁公寓还要愚蠢。在那些建筑里，所有的楼层都有一定的用途。在森林里，树干上的树叶都被剥光了，有时树枝的长度超过了它们长度的90%，只有顶层公寓有人住着。\n如果树木能以某种方式聚集在一起，谈判达成一项协议-分区条例或建筑法规-它们都会受益。也许他们可以规定最高高度为10米。树冠不会改变；规则只会砍掉树干底部20米。\n如果每一棵树都能从协议中获益，为什么我们在自然界中看不到这样的被砍伐的森林在进化呢？对于为什么--不能--每个人都和睦相处这个问题，通常的回答是，进化并不是这样运作的。自然选择通常被认为是完全自私和个人主义的，即使它是有害的。一棵达到10米极限的树会自言自语：“是的，这很好，我不用踮起脚尖就能得到充足的光线。但它可能会更好。如果我的树干再伸展一两米，我会收集更多的太阳能。“。当然，其他树木也以完全相同的方式自圆其说，于是徒劳的军备竞赛又开始了。正如沃格尔所说，远见并不是进化论的强项。\n我愿意接受这种对进化论的冷淡看法，但我一点也不确定这是否真的解释了我们在森林中看到的东西。如果进化在这样的情况下没有合作的空间，怎么会发生所有的树实际上都停止生长在大约相同的高度呢？具体地说，如果将身高限制在10米的协议会被猖獗的作弊行为破坏，为什么同样的事情不会发生在30米的高度上？\n人们可能会猜测，30米是一个生理极限，如果可以的话，树木会长得更高，但一些物理限制阻止了这一点。也许他们只是不能再把水提得更高了。如果不是因为美国西部的红杉和海岸红杉，我会认为这是一个非常有前途的假设。这些树还没有听说过任何这样的物理屏障。它们通常长到70或80米，少数标本已经超过100米。因此，东海岸树木面临的问题不仅仅是“你为什么这么高？”还会问“你为什么不高一点呢？”\n我至少能想出一个很好的理由让森林树木长到一致的高度。如果一棵树比平均水平矮，它就会因为被留在阴凉处而受到影响。但站在人群的头和肩膀上也有缺点：这样一棵突出的树会暴露在更强的风中，更重的冰雪负荷，以及可能更高的雷击几率。因此，偏离太远，无论是低于或高于平均高度，都可能受到繁殖成功率下降的惩罚。但最大的问题仍然是：所有的树是如何就什么高度最好达成共识的？\n另一种可能性是：也许林木的高度毕竟不是军备竞赛的结果，而是对掠夺的反应。树木高高举起树叶，使它们远离食草动物。我不能说这是错的，但我觉得不太可能。没有长颈鹿在北美的森林里漫步(如果它们这样做了，10米就足以让树叶变得遥不可及)。大多数啃食树叶的动物是节肢动物，它们要么会飞(成虫)，要么会爬上树干(毛毛虫和其他幼虫)。因此，高度不能完全保护树叶，充其量也只能起到威慑作用。树叶不是一种有营养的饮食；也许一些小型食草动物认为树叶值得攀登10米，但不值得攀登30米。\n对于生物学家来说，树是一种相当高的木本植物。对数学家来说，树是一个没有环的图。事实证明，数学树和生物树有一些重要的共同性质。\n下图显示了两个数学图表。它们是点(更正式地称为顶点)的集合，由线段(称为边)链接。一个图称为连通的，如果你可以沿着某个边的序列从任何一个顶点行进到任何其他的顶点。这里显示的两个图表都是相连的。树形成连通图的一个亚种。它们是微小连接的：在任意两个顶点之间，恰好有一个技术细节：路径是一系列边，其中任何给定的边最多只能出现一次。这就排除了毫无意义的来回重复。诸如x，y，x，z之类的序列不是路径。小径。左边的图表是一棵树。红线显示了从a到b的唯一路径。右侧的图形不是树。从a到b有两条路线(红线和黄线)。\n这是描述数学树的另一种方式。这是一张遵守反婚姻法的曲线图：分枝使之四分五裂，让任何人都不能再结合在一起。生物树的工作方式通常是一样的：从树干分叉出来的两条肢体稍后不会回到树干上，也不会相互融合。换句话说，没有循环，也没有闭环。在下面所示的高度规则的生物树结构中，辐射出的永远不会再收敛的树枝的模式是很明显的。(这棵树是一种诺福克岛的松树，原产于南太平洋，但这个标本是在撒丁岛拍摄的。)。\n树木已经取得了巨大的成功，它们的树枝上没有环。为什么植物要让它的结构元素呈圆形生长呢？\n我能想到两个原因。首先是机械强度和稳定性。工程师们知道三角形(最小的闭合环)在建造刚性结构中的价值。也是拱门，两个不能单独站立的垂直元素互相靠在一起。树木不能利用这些技巧；它们的四肢是悬臂，只能在与树干或母肢的连接处支撑。环形结构将允许各种支撑和支撑。\n第二个原因是可靠性。提供从树根到树叶的多个通道将提高树木循环系统的健壮性。肢体底部附近的伤害将不再会毁灭所有超出损伤点的结构。\n在自然界的其他地方，甚至在树木解剖学的其他方面，在节点之间具有多条路径的网络被利用。下图中的网状通道是在一棵红橡树的一片叶子内分布液体和营养的静脉。最大的静脉(或肋骨)具有树状排列，但较小的通道在循环内形成嵌套的循环层次结构。(这个图案让我想起了一张古城地图。)。因为有许多冗余的路径，昆虫从这个网络的中间咀嚼不会阻碍与叶子其余部分的通信。\n在树干和树枝的更大规模的结构中没有环可能是指导树木生长的发展计划的自然结果。匈牙利-荷兰生物学家阿里斯蒂德·林登迈尔(Aristid Lindenmayer)发明了一系列形式语言(现在称为L-系统)来描述这种生长。语言是重写系统：您从单个符号(公理)开始，然后将其替换为由语法规则指定的一串符号。则由该替换产生的字符串成为相同重写过程的新输入，其符号中的每一个被根据语法规则形成的另一个字符串替换。最后，这些符号被解释为构造几何图形的命令。\n符号f、l和r是语言的基本元素；当解释为绘图命令时，它们表示向前、向左和向右。语法的第一个规则用字符串f[l f][r f]替换f的任何匹配项；第二个和第三个规则不改变任何内容，用它们自己替换l和r。方括号用子程序括起来。到达左方括号时，系统会记下其在图形中的当前位置和方向。然后执行括号内的指令，最后在到达右括号时回溯到保存的位置和方向。\n阶段0：f阶段1：f[r f][l f]阶段2：f[r f][l f][r f[r f][l f]][l f[r f][l f]]。\n当这个重写过程再继续几个阶段，然后转换成图形输出时，我们看到一棵小树苗正在长成一棵幼树，形状让人想起榆树。我忘了具体说明几个细节。在每个阶段，向前一步的长度减少0.6倍。所有的转弯，无论是左转还是右转，都是通过一个20度的角度。\n像这样的L-系统可以产生丰富多样的分支结构。同一程序的更精细版本可以创建逼真的生物树图像。(卡尔加里大学的算法植物学网站有很多例子。)。L-系统不能做的是创建闭环。这将需要一种根本不同的语法，例如接受两个符号或字符串作为输入并产生连接结果的转换规则。(请注意，在上面的阶段5图中，树的两个分支似乎重叠，但它们没有连接。该图形在交点处没有顶点。)。\n如果控制树木生长和发育的生化机制与L系统具有相同的约束条件，我们就可以很好地解释为什么在生物树的分枝过程中没有环路。但或许这个解释有点太理清了。我一直在说，树不会做圈圈，这通常是正确的。但是下面这棵树呢？几年前我在北卡罗来纳州罗利市的一条街上拍到的一棵紫薇树呢？(它让我想起了亨利·摩尔(Henry Moore)的一件肌肉发达的雕塑。)。\n这种植物是植物学意义上的树，但它肯定不是一棵数学树。一只树干从地下出来，立即分裂。在腰部有四个分支，然后其中三个重新组合。在齐胸的位置，出现了另一次分裂和另一次合并。这棵流氓树藐视了树王国的所有教规和习俗。\n而桃金娘并不是唯一的违法者。榕树原产于印度，它们的水平树枝由无数的支腿支撑着，这些支腿可以落到地面上。下面所示的榕树位于夏威夷的希洛，在树干应该位于的地方有一个掏空的空腔，周围环绕着数十或数百根支撑树枝，头顶上有横撑。上述L-系统永远不可能创建这样的网络。但是，如果榕树能做到这一点，为什么其他树木不能采用同样的技巧呢？\n在生物学中，问题是“为什么是x？”是“x的进化优势是什么？”的缩写。或者“x对有机体的生存和繁殖成功有何贡献？”回答这样的问题往往需要想象力的飞跃。我们观察了附着在树皮上的斑驳的棕色飞蛾，并提出它的颜色是伪装的，从而隐藏了昆虫，使其不被捕食者发现。我们看着一只炫耀的蝴蝶，得出结论，它的服装是不合时宜的--一个警告说，“我有毒，如果你吃了我，你会后悔的。”\n这些解释有可能变成平淡无奇的故事，法国人实际上称它们为“为什么故事”--“普尔奎伊论战”(Les Contt Des Pourqui)。就像吉卜林讲的大象是如何把鼻子放进去的故事。\n.", "note_en": "A few weeks ago, after taking a walk in the woods, I wrote about  the puzzling diversity of forest trees. On my walk I found a dozen species sharing the same habitat and apparently competing for the same resources—primarily access to sunlight. An ecological principle says that one species should win this contest and drive out all the others, but the trees haven’t read the ecology textbooks.\n In that essay I also mentioned three other questions about trees that have long been bothering me. In this sequel I want to poke at those other questions a bit more deeply.\n   Botanists have an elaborate vocabulary for describing leaf shapes:  cordate (like a Val­entine heart),  cuneate (wedgelike),  ensiform (sword shaped),  hastate (like an arrowhead, with barbs),  lanceolate (like a spearhead),  oblanceolate (a backwards spearhead),  palmate (leaflets radiating like fingers),  pandurate (violin shaped),  reniform (kidney shaped),  runcinate (saw-toothed),  spatulate (spoonlike). That’s not, by any means, a complete list.\n Steven Vogel, in his 2012 book  The Life of a Leaf, enumerates many factors and forces that might have an influence on leaf shape. For example, leaves can’t be too heavy, or they would break the limbs that hold them aloft. On the other hand, they can’t be too delicate and wispy, or they’ll be torn to shreds by the wind. Leaves also must not generate too much aerodynamic drag, or the whole tree might topple in a storm.\n Job One for a leaf is photosynthesis: gathering sunlight, bringing together molecules of carbon dioxide and water, synthesizing carbohydrates. Doing that efficiently puts further constraints on the design. As much as possible, the leaf should turn its face to the sun, maximizing the flux of photons absorbed. But temperature control is also important; the biosynthetic apparatus shuts down if the leaf is too hot or too cold.\n Vogel points out that subtle features of leaf shape can have a measurable impact on thermal and aerodynamic performance. For example, convective cooling is most effective near the margins of a leaf; temperature rises with distance from the nearest edge. In environments where overheating is a risk, shapes that minimize this distance—such as the  lobate forms of oak leaves—would seem to have an advantage over simpler, disklike shapes. But the choice between frilly and compact forms depends on other factors as well. Broad leaves with convex shapes intercept the most sunlight, but that may not always be a good thing. Leaves with a lacy design let dappled sunlight pass through, allowing multiple layers of leaves to share the work of photosynthesis.\n Natural selection is a superb tool for negotiating a compromise among such inter­acting criteria. If there is some single combination of traits that works best for leaves growing in a particular habitat, I would expect evolution to find it. But I see no evidence of convergence on an optimal solution. On the contrary, even closely related species put out quite distinctive leaves.\n Take a look at the three oak leaves in the upper-left quadrant of the image above. They are clearly variations on a theme. What the leaves have in common is a sequence of peninsular protrusions springing alternately to the left and the right of the center line. The variations on the theme have to do with the number of peninsulas (three to five per side in these specimens), their shape (rounded or pointy), and the depth of the coves between peninsulas. Those variations could be attributed to genetic differences at just a few loci. But  why have the leaves acquired these different characteristics? What evolutionary force makes rounded lobes better for white oak trees and pointy ones better for red oak and pin oak?\n Much has been learned about the developmental mechanisms that generate leaf shapes. Biochemically, the main actors are the plant hormones known as auxins; their spatial distribution and their transport through plant tissues regulate local growth rates and hence the pattern of development. (A 2014 review article by Jeremy Dkhar and Ashwani Pareek covers these aspects of leaf form in great detail.) On the mathematical and theoretical side, Adam Runions, Miltos Tsiantis, and Przemyslaw Prusinkiewicz have devised an algorithm that can generate a wide spectrum of leaf shapes with impressive verisimilitude. (Their 2017 paper, along with source code and videos, is at  algorithmicbotany.org/papers/leaves2017.html.) With different parameter values the same program yields shapes that are recognizable as oaks, maples, sycamores, and so on. Again, however, all this work addresses questions of  how, not  why.\n Another property of tree leaves—their size— does seem to respond in a simple way to evolutionary pressures. Across all land plants (not just trees), leaf area varies by a factor of a million—from about 1 square millimeter per leaf to 1 square meter. A 2017 paper by Ian J. Wright and colleagues reports that this variation is strongly correlated with climate. Warm, moist regions favor large leaves; think of the banana. Cold, dry environments, such as alpine ridges, host mainly tiny plants with even tinier leaves. So natural selection is alive and well in the realm of tree leaves; it just appears to have no clear preferences when it comes to shape.\n Or am I missing something important? Elsewhere in nature we find flamboyant variations that seem gratuitous if you view them strictly in the grim context of survival-of-the-fittest. I’m thinking of the fancy-dress feathers of birds, for example. Cardinals and bluejays both frequent my back yard, but I don’t spend much time wondering whether red or blue is the optimal color for survival in that habitat. Nor do I expect the two species to converge on some shade of purple. Their gaudy plumes are not adaptations to the physical environment but elements of a communication system; they send signals to rivals or potential mates. Could something similar be going on with leaf shape? Do the various oak species maintain distinctive leaves to identity themselves to animals that help with pollination or seed dispersal? I rate this idea unlikely, but I don’t have a better one.\n   Surely this question is too easy! We know why trees grow tall. They reach for the sky. It’s their only hope of escaping the gloomy depths of the forest’s lower stories and getting a share of the sunshine. In other words, if you are a forest tree, you need to grow tall because your neighbors are tall; they overshadow you. And the neighbors grow tall because you’re tall. It’s is a classic arms race. Vogel has an acute commentary on this point:\n In every lineage that has independently come up with treelike plants, a variety of species achieve great height. That appears to me to be the height of stupidity…. We’re looking at, almost surely, an object lesson in the limitations of evolution­ary design….\n A trunk limitation treaty would permit all individuals to produce more seeds and to start producing seeds at earlier ages. But evolution, stupid process that it is, hasn’t figured that out—foresight isn’t exactly its strong suit.\n Vogel’s trash-talking of Darwinian evolution is meant playfully, of course. But I think the question of height-limitation treaties Joke courtesy Rosalind Reid. (or should we call them  treeties?) deserves more serious attention.\n Forest trees in the eastern U.S. often grow to a height of 25 or 30 meters, approaching 100 feet. It takes a huge investment of material and energy to erect a structure that tall. To ensure sufficient strength and stiffness, the girth of the trunk must increase as the \\(\\frac{3}{2}\\) power of the height, and so the cross-sectional area \\((\\pi r^2)\\) grows as the cube of the height. It follows that doubling the height of a tree trunk multiplies its mass by a factor of 16.\n Great height imposes another, ongoing, metabolic cost. Every day, a living tree must lift 500 liters of water—weighing 500 kilograms—from the root zone at ground level up to the leaves in the crown. It’s like carrying enough water to fill four or five bathtubs from the basement of a building to the 10th floor.\n Height also exacerbates certain hazards to the life and health of the tree. A taller trunk forms a longer lever arm for any force that might tend to overturn the tree. Compounding the risk, average wind speed increases with distance above the ground.\n  Standing on the forest floor, I tilt my head back and stare dizzily upward toward the leafy crowns, perched atop great pillars of wood. I can’t help seeing these plants on stilts as a colossal waste of resources. It’s even sillier than the needlelike towers of apartments for billionaires that now punctuate the Manhattan skyline. In those buildings, all the floors are put to  some use. In the forest, the tree trunks are denuded of leaves and sometimes of branches over 90 percent of their length; only the penthouses are occupied.\n If the trees could somehow get together and negotiate a deal—a zoning ordinance or a building code—they would  all benefit. Perhaps they could decree a maximum height of 10 meters. Nothing would change about the crowns of the trees; the rule would simply chop off the bottom 20 meters of the trunk.\n If every tree would gain from the accord, why don’t we see such amputated forests evolving in nature? The usual response to this why-can’t-everybody-get-along question is that evolution just doesn’t work that way. Natural selection is commonly taken to be utterly selfish and individualist, even when it hurts. A tree reaching the 10-meter limit would say to itself: “Yes, this is good; I’m getting plenty of light without having to stand on tiptoe. But it could be even better. If I stretched my trunk another meter or two, I’d collect an even bigger share of solar energy.” Of course the other trees reason with themselves in exactly the same way, and so the futile arms race resumes. As Vogel said, foresight is not evolution’s strong suit.\n I am willing to accept this dour view of evolution, but I am not at all sure it actually explains what we see in the forest. If evolution has no place for cooperative action in a situation like this one, how does it happen that all the trees do in fact stop growing at about the same height? Specifically, if an agreement to limit height to 10 meters would be spoiled by rampant cheating, why doesn’t the same thing happen at 30 meters?\n One might conjecture that 30 meters is a physiological limit, that the trees would grow taller if they could, but some physical constraint prevents it. Perhaps they just can’t lift the water any higher. I would consider this a very promising hypothesis if it weren’t for the sequoias and the coast redwoods in the western U.S. Those trees have not heard about any such physical barriers. They routinely grow to 70 or 80 meters, and a few specimens have exceeded 100 meters. Thus the question for the East Coast trees is not just “Why are you so tall?” but also “Why aren’t you taller?”\n I can think of at least one good reason for forest trees to grow to a uniform height. If a tree is shorter than average, it will suffer for being left in the shade. But standing head and shoulders above the crowd also has disadvantages: Such a standout tree is exposed to stronger winds, a heavier load of ice and snow, and perhaps higher odds of lightning strikes. Thus straying too far either below or above the mean height may be punished by lower reproductive success. But the big question remains: How do all the trees reach consensus on what height is best?\n Another possibility: Perhaps the height of forest trees is not a result of an arms-race after all but instead is a response to predation. The trees are holding their leaves on high to keep them away from herbivores. I can’t say this is wrong, but it strikes me as unlikely. No giraffes roam the woods of North America (and if they did, 10 meters would be more than enough to put the leaves out of reach). Most of the animals that nibble on tree leaves are arthropods, which can either fly (adult insects) or crawl up the trunk (caterpillars and other larvae). Thus height cannot fully protect the leaves; at best it might provide a deterrent. Tree leaves are not a nutritious diet; perhaps some small herbivores consider them worth a climb of 10 meters, but not 30.\n   To a biologist, a tree is a woody plant of substantial height. To a mathematician, a tree is a graph without loops. It turns out that math-trees and bio-trees have some important properties in common.\n The diagram below shows two mathematical graphs. They are collections of dots (known more formally as vertices), linked by line segments (called edges).  A graph is said to be  connected if you can travel from any vertex to any other vertex by following some sequence of edges. Both of the graphs shown here are connected. Trees form a subspecies of connected graphs. They are  mini­mally connected: Be­tween any two vertices there is exactly one  Fiddly technical detail: A path is a sequence of edges in which any given edge can appear at most once. This rules out pointless back-and-forth repetition. A sequence such as  x, y, x, z is not a path. path. The graph on the left is a tree. The red line shows the unique path from  a to  b. The graph at right is not a tree. There are two routes from  a to  b (red and yellow lines).\n Here’s another way to describe a math-tree. It’s a graph that obeys the antimatrimonial rule: What branching puts asunder, let no one join together again. Bio-trees generally work the same way: Two limbs that branch away from the trunk will not later return to the trunk or fuse with each other. In other words, there are no cycles, or closed loops. The pattern of radiating branches that never reconverge is evident in the highly regular structure of the bio-tree pictured below. (The tree is a Norfolk Island pine, native to the South Pacific, but this specimen was photographed on Sardinia.)\n  Trees have achieved great success without loops in their branches. Why would a plant ever want to have its structural elements growing in circles?\n I can think of two reasons. The first is mechanical strength and stability. Engineers know the value of triangles (the smallest closed loops) in building rigid structures. Also arches, where two vertical elements that could not stand alone lean on each other. Trees can’t take advantage of these tricks; their limbs are cantilevers, supported only at the point of juncture with the trunk or the parent limb. Loopy structures would allow for various kinds of bracing and buttressing.\n The second reason is reliability. Providing multiple channels from the roots to the leaves would improve the robustness of the tree’s circulatory system. An injury near the base of a limb would no longer doom all the structures beyond the point of damage.\n Networks with multiple paths between nodes are exploited elsewhere in nature, and even in other aspects of the anatomy of trees. The reticulated channels in the image below are veins distributing fluids and nutrients within a leaf from a red oak tree. The very largest veins (or ribs) have a treelike arrangement, but the smaller channels form a nested hierarchy of loops within loops. (The pattern reminds me of a map of an ancient city.) Because of the many redundant pathways, an insect taking a chomp out of the middle of this network will not block communication with the rest of the leaf.\n  The absence of loops in the larger-scale structure of trunk and branches may be a natural consequence of the devel­opmental program that guides the growth of a tree. Aristid Lindenmayer, a Hungarian-Dutch biologist, invented a family of formal languages (now called L-systems) for describing such growth. The languages are rewriting systems: You start with a single symbol (the  axiom) and replace it with a string of symbols specified by the rules of a grammar. Then the string resulting from this substitution becomes a new input to the same rewriting process, with each of its symbols being replaced by another string formed according to the grammar rules. In the end, the symbols are interpreted as commands for constructing a geometric figure.\n   The symbols  f,  l, and  r are the basic elements of the language; when interpreted as drawing commands, they stand for  forward,  left, and  right. The first rule of the grammar replaces any occurrence of  f with the string  f [l f] [r f]; the second and third rules change nothing, replacing  l and  r with themselves. Square brackets enclose a subprogram. On reaching a left bracket, the system makes note of its current position and orientation in the drawing. Then it executes the instructions inside the brackets, and finally on reaching the right bracket backtracks to the saved position and orientation.\n  Stage 0: fStage 1: f [r f] [l f]Stage 2: f [r f] [l f] [r f [r f] [l f]] [l f [r f] [l f]]]\n When this rewriting process is continued for a few further stages and then converted to graphic output, we see a sapling growing into a young tree, with a shape reminiscent of an elm. I have neglected to specify a few details. At each stage, the length of a  forward step is reduced by a factor of 0.6. And all turns, both  left and  right, are through an angle of 20 degrees.\n  L-systems like this one can produce a rich variety of branching structures. More elaborate versions of the same program can create realistic images of biological trees. (The  Algorithmic Botany website at the University of Calgary has an abundance of examples.) What the L-systems  can’t do is create closed loops. That would require a fundamentally different kind of grammar, such as a transformation rule that takes two symbols or strings as input and produces a conjoined result. (Note that in the stage 5 diagram above, two branches of the tree appear to overlap, but they are not joined. The graph has no vertex at the intersection point.)\n If the biochemical mechanisms governing the growth and development of trees operate with the same constraints as L-systems, we have a tidy explanation for the absence of loops in the branching of bio-trees. But perhaps the explanation is a little too tidy. I’ve been saying that trees don’t do loops, and it’s generally true. But what about the tree pictured below—a crepe myrtle I photographed some years ago on a street in Raleigh, North Carolina? (It reminds me of a sinewy  Henry Moore sculpture.)\n  This plant is a tree in the botanical sense, but it’s certainly not a mathematical tree. A single trunk comes out of the ground and immediately divides. At waist height there are four branches, then three of them recombine. At chest height, there’s another split and yet another merger. This rogue tree is flouting all the canons and customs of treedom.\n And the crepe myrtle is not the only offender. Banyan trees, native to India, have their horizontal branches propped up by numerous outrigger supports that drop to the ground. The banyan shown below, in Hilo, Hawaii, has a hollowed-out cavity where the trunk ought to be, surrounded by dozens or hundreds of supporting shoots, with cross-braces overhead. The L-system described above could never create such a network. But if the banyan can do this, why don’t other trees adopt the same trick?\n   In biology, the question “Why  x?” is shorthand for “What is the evolutionary advantage of  x?” or “How does  x contribute to the survival and reproductive success of the organism?” Answering such questions often calls for a leap of imagination. We look at the mottled brown moth clinging to tree bark and propose that its coloration is camouflage, concealing the insect from predators. We look at a showy butterfly and conclude that its costume is aposematic—a warning that says, “I am toxic; you’ll be sorry if you eat me.”\n These explanations risk turning into just-so stories, The French actually call them “why stories”— les contes des pourquoi. like Kipling’s tale of how the elephant got its trunk in\n......", "posttime": "2020-10-15 00:20:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "树木,questions,树叶", "title": "更多关于树木的问题", "title_en": "More Questions About Trees", "transed": 1, "url": "http://bit-player.org/2020/more-questions-about-trees", "via": "", "real_tags": ["树木", "questions", "树叶"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全国の懐かし昭和レトロ自販機コーナーの最新稼働状況と完全リスト.。\n日本全国を旅して撮影·編集した動画をYoutube·ニコ動にアップしています.。\n各種懐かし自販機の調理のしくみをお店のご協力により特別に公開します.。\n群馬~新潟~京都~島根~山口~岡山を約3200 kmを走破、名店を巡る旅。\n秋の埼玉と群馬を1泊2日で巡る。秋の虫が鳴り響く深夜の丸美屋が最高でした.。\n桜満開の西日本を約3200 km走り探索。名店をじっくりと味わい巡る旅.。\n秋の北海道·東北地方を約3400 km走り探索。激渋自販機コーナーを味わう.。\n初夏の北陸·東北地方を約2400 km走り探索。自然とレトロ自販機を堪能.。\n真夏の西日本を約5500 km走り探索。70ヶ所の懐かし自販機コーナーを巡る旅。\n東北、北陸、群馬を一周して、66ヶ所の懐かし自販機コーナーを巡る旅。\n味わいの昭和レトロ自販機コーナー“懐かし自販機”へようこそ.。\nハンバーガー自販機、うどん·そば·ラーメン自販機、トーストサンド自販機など、昭和40~50年代に開発された食品自動調理販売機。最盛期には日本全国で数千台が稼働していましたが、主な設置場所であった街道沿いのオートスナックなども、現代ではほとんど絶滅し全国をくまなく探しても百台前後と、とてもレアな存在となりました.。今も現役で稼働している懐かし自販機や昭和レトロ自販機コーナーは、空気感や思い出を当時のまま宿し、渋い味わいと趣があります.。目の前にした瞬間にあのころへタイムスリップさせてくれる強烈な存在感、機械の裏側にいる人たちの愛情、各地を巡る旅情.。懐かし自販機巡りの旅はとても味わい深く、また癒されます.。長年自販機を大事に使い続けてきた人たちや、忘れかけていた日本の魅力に出会う旅です.。サイトをご覧になった皆さんも是非、懐かし自販機マップを参考に懐かし自販機巡りをしてみてください.。(写真や動画の撮影をする場合はお店の方に一声かけてからお願いします.。)。\n当サイトは旅人Uskが“懐かし自販機”を探して現存した自販機コーナーの全てを実際に巡り日本全国を旅した記録です.。各地で今も活躍し、旅情や郷愁を感じさせる“懐かし自販機コーナー”の味わい深い情景をプロの写真で紹介しています.。\n当サイトでは全国の皆さんからの懐かし自販機の情報を募集しております.。掲示板までお寄せください.。邮箱：ビジネス関係のお問い合わせはRetvender@gmail.comへお願いいたします。\n更新履歴2019年年08月20日“島根県益田市自販機のお店風花”を更新しました。2019年年06月09日“島根県川本町コインレストランかわもと”を更新しました。2019年年05月27日“広島県三次市福原酒店”を更新しました。2019年年04月12日“岡山県高梁市LOGLAND”を更新しました.。2019年年03月24日“岡山県真庭市ベンダーショップもみぢの里”を更新しました。2019年年03月05日“岡山県津山市仕出し弁当おかもと”を更新しました。2019年年02月08日“兵庫県香美町コインスナックふじ”を更新しました。2018年年01月11日“兵庫県神戸市石田鶏卵”を更新しました。2017年年11月16日“岐阜県山県市岐阜レトロミュージアム”動画を追加しました。2017年年05月26日“岐阜県山県市岐阜レトロミュージアム”を追加しました。2017年年05月13日“神奈川県相模原市中古タイヤ市場相模原店”を追加しました。2017年年05月11日“埼玉県行田市オートレストラン鉄剣タロー”を更新しました。2017年年05月04日“群馬県太田市オレンジハット太田藪塚店”を更新しました。2017年年03月03日“新潟県上越市レンタルスキー”を追加しました。2017年年01月21日“長野県廃コカコーラ”を追加しました。閉店情報メディア掲載等。\n☆好評発売中！“侘寂温泉[東日本編]”“侘寂温泉[西日本編]”全国懐かし自販機巡りのお供に！\n☆好評発売中！“昭和懐かし自販機巡礼”\n☆好評発売中！“日本懐かし自販機大全”\n☆好評発売中！“懐かし自販機動画オリジナル音源”サンプル無料ダウンロードできます！第一卷、第二卷！\n☆“音写旅人usk@懐かしレトロ自販機”推特更新中！\n☆ニッポン放送“上柳昌彦あさぼらけ”番組内で当サイト管理人が紹介されました！好了！\n貴重な映像としてオートスナックなどの自販機コーナー真っ盛りの時代を見られる作品でもあるのです.。\n熱く、切ない、思い出がいっぱい語られています.。\n24時間営業のコンビニが当たり前の現代、昔は国道·県道などの街道沿いによくあったオートスナック、コインスナックなどと呼ばれた自販機コーナーの店と、そこに設置されていたグーテンバーガー、トーストサンド、うどん·そば等の食品系旧式自販機を見かけることは、。残念ながらほとんど無くなってしまった.。\n1980年年代から日本各地を自転車·オートバイ、ヒッチハイクなどで放浪していた私が、初めてグーテンバーガーを食べたのは当時、北海道行きフェリーが発着していた旧東京フェリー埠頭の自販機だった.。硬貨を入れてボタンを押すと、加熱中の赤いランプが、ポッ··ポッ··と点滅を始め、高まる期待とともに待つこと一分···。コトッと出てきたグーテンバーガーはアツアツで何とも旨かった.。出発のはやる気持ちと、その熱さがやけにシンクロして未知なる旅の高揚感は最高潮に達した.。\n高三の夏、東京~会津を自転車で旅したときだった.。北関東の田舎道を走行中、昼時で空腹だが山奥で何もないという状況で偶然にも自販機コーナーを見つけ食べたグーテンバーガーの味が今も忘れられない.。ひと気の無い薄暗いコインスナックで、熱せられた紙箱の匂いまでをも思い出せるほど心に焼き付いている.。\n晩秋の北風冷たい曇天の下のバイク旅、東北の寂れた国道沿いのオートスナックに逃げ込んだ.。かじかんだ体を温めてくれた自販機のうどん.。小さなパック入りの七味を2，3入れ、備え付けの普通のより少し短い割り箸ですするとほっと生き返った.。国道を行き交うトラックの流れと、闇に染まり始めた夕餉のひとときに郷愁を感じながら、洗練とは対極の居心地の好さを味わっていた.。\n世の中が24時間営業では無かった昔の日本には、本当の夜があった.。午前2時から4時ころまでは深夜という名にふさわしい静寂と畏れがあった。世間の大半が眠る中、埠頭や国道で働く人や旅人たちを温めていたのが自販機だった.。当時から生き残る旧い自販機たちは夜の重みを憶えているに違いない.。\n旅の味わいを、深い想い出にしてくれるどこか懐かしく、そして温かいぬくもり.。無人のコインスナックには不思議な居心地の良さと、何とも言えぬ詩情があるのだ.", "note_en": "全国の懐かし昭和レトロ自販機コーナーの最新稼働状況と完全リスト。\n 日本全国を旅して撮影・編集した動画をYouTube・ニコ動にアップしています。\n 各種懐かし自販機の調理のしくみをお店のご協力により特別に公開します。\n 群馬～新潟～京都～島根～山口～岡山を約3200kmを走破、名店を巡る旅。\n 秋の埼玉と群馬を1泊2日で巡る。秋の虫が鳴り響く深夜の丸美屋が最高でした。\n 桜満開の西日本を約3200km走り探索。名店をじっくりと味わい巡る旅。\n 秋の北海道・東北地方を約3400km走り探索。激渋自販機コーナーを味わう。\n 初夏の北陸・東北地方を約2400km走り探索。自然とレトロ自販機を堪能。\n 真夏の西日本を約5500km走り探索。70ヶ所の懐かし自販機コーナーを巡る旅。\n 東北、北陸、群馬を一周して、66ヶ所の懐かし自販機コーナーを巡る旅。\n  味わいの昭和レトロ自販機コーナー「懐かし自販機」へようこそ。\n ハンバーガー自販機、 うどん・そば・ラーメン自販機、 トーストサンド自販機など、昭和40～50年代に開発された食品自動調理販売機。 最盛期には日本全国で数千台が稼働していましたが、主な設置場所であった街道沿いのオートスナックなども、現代ではほとんど絶滅し全国をくまなく探しても百台前後と、とてもレアな存在となりました。今も現役で稼働している 懐かし自販機や昭和レトロ 自販機コーナーは、空気感や思い出を当時のまま宿し、渋い味わいと趣があります。目の前にした瞬間にあのころへタイムスリップさせてくれる強烈な存在感、機械の裏側にいる人たちの愛情、各地を巡る旅情。 懐かし自販機巡りの旅はとても味わい深く、また癒されます。長年自販機を大事に使い続けてきた 人たちや、忘れかけていた日本の魅力に出会う旅です。サイトをご覧になった皆さんも是非、  懐かし自販機マップを参考に懐かし自販機巡りをしてみてください。 （写真や動画の撮影をする場合はお店の方に一声かけてからお願いします。）\n 当サイトは旅人  USK が「 懐かし自販機」を探して 現存した自販機コーナーの全てを実際に巡り日本全国を旅した記録です。 各地で今も活躍し、旅情や郷愁を感じさせる「懐かし自販機コーナー」の味わい深い情景をプロの写真で紹介しています。\n  当サイトでは全国の皆さんからの懐かし自販機の情報を募集しております。  掲示板までお寄せください。  ビジネス関係のお問い合わせは retrovender@gmail.com へお願いいたします。\n    更新履歴 2019年08月20日 「島根県益田市 自販機のお店 風花」を更新しました。 2019年06月09日 「島根県川本町 コインレストランかわもと」を更新しました。 2019年05月27日 「広島県三次市 福原酒店」を更新しました。 2019年04月12日 「岡山県高梁市 LOGLAND」を更新しました。 2019年03月24日 「岡山県真庭市 ベンダーショップもみぢの里」を更新しました。 2019年03月05日 「岡山県津山市 仕出し弁当 おかもと」を更新しました。 2019年02月08日 「兵庫県香美町 コインスナックふじ」を更新しました。 2018年01月11日 「兵庫県神戸市 石田鶏卵」を更新しました。 2017年11月16日 「岐阜県山県市 岐阜レトロミュージアム」動画を追加しました。 2017年05月26日 「岐阜県山県市 岐阜レトロミュージアム」を追加しました。 2017年05月13日 「神奈川県相模原市 中古タイヤ市場 相模原店」を追加しました。 2017年05月11日 「埼玉県行田市 オートレストラン鉄剣タロー」を更新しました。 2017年05月04日 「群馬県太田市 オレンジハット太田藪塚店」を更新しました。 2017年03月03日 「新潟県上越市 レンタルスキー」を追加しました。 2017年01月21日 「長野県 廃コカコーラ」を追加しました。    閉店情報   メディア掲載等\n  ☆  好評発売中！ 「侘寂温泉【東日本編】」  「侘寂温泉【西日本編】」 全国懐かし自販機巡りのお供に！\n ☆  好評発売中！ 「昭和懐かし自販機巡礼」\n ☆  好評発売中！ 「日本懐かし自販機大全」\n ☆  好評発売中！ 「懐かし自販機動画 オリジナル音源」 サンプル無料ダウンロードできます！　 Vol.1、 Vol.2！\n   ☆  「音写旅人USK@懐かしレトロ自販機」 Twitter更新中！\n ☆ ニッポン放送  「上柳昌彦 あさぼらけ」番組内で当サイト管理人が紹介されました！!\n                                               貴重な映像としてオートスナックなどの自販機コーナー真っ盛りの時代を見られる作品でもあるのです。\n   熱く、切ない、思い出がいっぱい語られています。\n 24時間営業のコンビニが当たり前の現代、昔は国道・県道などの街道沿いによくあったオートスナック、コインスナックなどと 呼ばれた自販機コーナーの店と、そこに設置されていたグーテンバーガー、トーストサンド、うどん・そば等の食品系旧式自販機を 見かけることは、残念ながらほとんど無くなってしまった。\n 1980年代から日本各地を自転車・オートバイ、 ヒッチハイクなどで放浪していた私が、初めてグーテンバーガーを食べたのは 当時、北海道行きフェリーが発着していた 旧東京フェリー埠頭の自販機だった。  硬貨を入れてボタンを押すと、加熱中の赤いランプが、ポッ・・ポッ・・と点滅を始め、高まる期待とともに待つこと一分・・・。 コトッと出てきたグーテンバーガーはアツアツで何とも旨かった。 出発のはやる気持ちと、その熱さがやけにシンクロして未知なる旅の高揚感は最高潮に達した。\n 高三の夏、東京～会津を自転車で旅したときだった。北関東の田舎道を走行中、昼時で空腹だが山奥で何もないという状況で 偶然にも自販機コーナーを見つけ食べたグーテンバーガーの味が今も忘れられない。 ひと気の無い薄暗いコインスナックで、熱せられた紙箱の匂いまでをも思い出せるほど心に焼き付いている。\n 晩秋の北風冷たい曇天の下のバイク旅、東北の寂れた国道沿いのオートスナックに逃げ込んだ。 かじかんだ体を温めてくれた自販機のうどん。小さなパック入りの七味を2，3入れ、 備え付けの普通のより少し短い割り箸ですするとほっと生き返った。 国道を行き交うトラックの流れと、闇に染まり始めた夕餉のひとときに郷愁を感じながら、洗練とは対極の居心地の好さを味わっていた。\n 世の中が24時間営業では無かった昔の日本には、本当の夜があった。 午前2時から4時ころまでは深夜という名にふさわしい静寂と畏れがあった。 世間の大半が眠る中、埠頭や国道で働く人や旅人たちを温めていたのが自販機だった。 当時から生き残る旧い自販機たちは夜の重みを憶えているに違いない。\n 旅の味わいを、深い想い出にしてくれるどこか懐かしく、そして温かいぬくもり。 無人のコインスナックには不思議な居心地の良さと、何とも言えぬ詩情があるのだ。", "posttime": "2020-10-15 00:19:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,介绍,website,自販機", "title": "专门介绍拉面自动售货机的日本网站", "title_en": "Japanese website dedicated to ramen vending machines", "transed": 1, "url": "http://jihanki.michikusa.jp/", "via": "", "real_tags": ["日本", "介绍", "website", "自販機"]}, {"category": "", "categoryclass": "", "imagename": "17013f1f9030dac24694679a8bf782b5.png", "infoid": 1028819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我们开始定期建设副业以来，已经有一年了。我们计划在12个月内启动10个项目。让我们看看现在都有些什么。所有的项目都是按时间顺序进行的。\n我们从来没有谈过那个，但这是我们的第一个项目。Alldocs是一个在线文本转换器，可以获取任何文本文件并将其转换为任何文本格式。\n当然，已经有很多在线转换器了，但他们看起来都想窃取我的数据。我们想让一些东西看起来更专业。我们仍在不时地努力，希望能提高搜索引擎的排名。目前，它每月有1.500的页面浏览量，而且这个数字增长缓慢。\nMouselless是一款漂亮的应用程序，可以在你的Mac上学习和查找键盘快捷键，这是我们在许多方面取得的最大成功。\n它已经被售出1600多次，收入超过3万美元。它也是神奇的SetApp目录的一部分。\n通过Floatie，我们为我们的项目建立了一个发布指标的平台，包括页面浏览量、跟踪时间、销售额、收入等等。\n大约有20000人查看了我们的数字，但只有大约100人表示有兴趣在我们的平台上发布他们的数字。这项工程现在被搁置了。\n是啊，那是个愚蠢的决定。我们开始建立我们的博客平台，并有一些想法来发展它，但太害怕了，不敢尝试。现在有太多的博客平台了。我们已经几次将其重命名并移到不同的域，这里有一个有趣的事实：您正在阅读的博客没有使用这个平台，而是它的设计。\n在Mouselless取得成功后，我们对尝试另一款MacOS应用感到有信心，甚至这次还想把它带到Windows上。\n长话短说，只有不到5%的购买者是Windows用户，但该应用程序的开发、测试、发布和支持是一个巨大的消磨时间的过程。我们可能再也不会开发Windows应用程序了。\n我们仍在维护MacOS版本，时不时地发布更新，并且喜欢自己使用它。\n我们回复了数百封有关我们产品的支持电子邮件，并考虑建立一个精益支持平台。我们对此有了一些想法，设计了界面，然后就停了下来。\n这是大量的开发工作，有很多竞争对手，我们不相信我们的想法足够独特。\n所以那一个还在等待中。不过，我喜欢这个名字。也许，有一天我们会再次开始做这件事，也可能不会。\n在感觉被困了一段时间后，我建立了前端新闻，它汇集了数百个博客的新闻。我试着让它变得非常开放，但只收到了很少的反馈，所以我决定几天后就取消它。\n另外，那个实验告诉我，我不想太公开地工作。写下每一个微小的步骤会让人感到压力，当没有足够的反馈时，会让人泄气。我更喜欢做一些事情，直到我(大部分)开心，然后分享它。\n这个项目已经有了几个名字，并且已经有了几个方向。它最初是一个在线文本编辑器。然后我们将其与无标题的博客平台合并，使其成为MacOS应用程序，并再次尝试将其转移到网络上。所有这些都没有真正奏效，所以我们最后暂停了。\nTipTap是我们不久前构建的文本编辑器，我们对版本2有宏伟的计划。\n我们不知道如何用它赚钱，但有数百万的下载量，这是我们建造的最成功的项目。我们喜欢做这件事，所以我们跟着它走，看看它以后会给我们带来什么。\nSkara是一个圆滑的团队知识库。它还在私人测试版中，我们将在一段时间内保持这样的状态，但计划很快就会定期邀请新用户。\n不过，这一次有点不同。几年前，我们已经开始了Skara，但作为一项与überdosis分开的努力。这让人感觉不对劲，所以就在几周前，它正式成为了überdosis的一部分。\n哦，还有11号，但我们还没准备好讨论这个。：​-​)我们在路上学到了很多，但我会把这些留到不同的岗位上。如果你对此有任何疑问，请在Twitter上分享，我会在下一篇帖子中回答他们。", "note_en": "It’s been a year since we started to build side projects regularly. We planned to launch ten projects in 12 months. Let’s look at what we’ve got now. All projects are in chronological order.\n  We’ve never talked about that one, but it has been our first project. Alldocs is an online text converter that takes any text file and converts it to any text format.\n Sure, there are many online converters already, but they all look like they want to steal my data. We wanted to make something looking more professional. We’re still working on it from time to time and hope to improve the search engine ranking. Currently, it has 1.500 page views/month, and the number grows slowly.\n   Mouseless is a beautiful app to learn and look up keyboard shortcuts on your Mac, and it is our most significant success in many regards.\n It has been sold more than 1,600 times and has more than $30,000 in revenue. It’s also part of the fantastic SetApp catalog.\n    With Floatie, we’ve built a platform to publish metrics for our projects, including page views, tracked time, sales, revenue, and many more.\n Around 20k people looked up our numbers, but only about 100 others showed interest in publishing their numbers on our platform. The project is on hold now.\n  Yeah, that was a stupid one. We started to build our blogging platform and had a few ideas to grow it but were too afraid to try it. There are just too many blogging platforms out there. We’ve renamed and moved it to different domains a few times, and here is one fun fact: The blog you’re reading doesn’t use the platform, but its design.\n  After the success of Mouseless, we felt confident to try another macOS app and even wanted to bring it to Windows this time.\n Long story short, less than 5 % of purchases were Windows users, but the development, testing, publishing, and support for the app was a tremendous time killer. We will probably never develop a Windows app again.\n We still maintain the macOS version, release an update now and then, and love to use it ourselves.\n   We answered hundreds of support emails for our products and thought about building a lean support platform. We had a few ideas for it, designed the interface, and then stopped.\n It’s a lot of development work, with many competitors, and we aren’t confident that our ideas are unique enough.\n So that one is still on hold. I like the name, though. Maybe, we’ll start to work on it again someday, perhaps not.\n  After feeling stuck for a while, I’ve built Frontend News, which aggregated news from hundreds of blogs. I tried to make that very open but received only a little feedback, so I decided to kill it after a few days.\n Also, that experiment showed me that I don’t want to work too public. It feels stressful to write about every tiny step and is demotivating when there’s not enough feedback. I prefer to work on something until I’m (mostly) happy and share it then.\n  This project had a few names and took a few directions already. It started as an online text editor. Then we merged it with the untitled blogging platform, made it a macOS app, and tried to move it to the web again. None of that really worked, so  we paused it in the end.\n  tiptap is a text editor we built a while ago, and  we have big plans for version 2.\n We have no idea how to make money with it, but with millions of downloads, it’s the most successful project we’ve ever built. We enjoy working on it, so we follow that and see what it’ll bring us later.\n  Skara is a slick knowledge base for teams. It’s still in private beta and we will keep it like that for a while, but plan to invite new users on a regular basis soon.\n This one is a little different though. We already started Skara a few years back, but as an endeavour separated from überdosis. It felt wrong, so it became officially a part of überdosis just a few weeks ago.\n Oh, and there is also #11, but we’re not ready to talk about that one. :​-​) We learned a lot on our way, but I’ll keep that for a different post. If you have any questions about that,  share it on Twitter and I’ll answer them in one of the next posts.", "posttime": "2020-10-15 00:19:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "项目,side,平台", "title": "附带项目一览表", "title_en": "List of Side Projects", "transed": 1, "url": "https://blog.ueber.io/post/list-of-side-projects/", "via": "", "real_tags": ["项目", "side", "平台"]}, {"category": "", "categoryclass": "", "imagename": "c5eb05c51a2a8fdd5992bc8c6d092065.jpeg", "infoid": 1028818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "写作是人类的超能力--如果写得好，它能提供信息、激发灵感和娱乐。也许这就是为什么博客在程序员中如此流行的原因。我们是一个天生好奇的群体，分享知识是我们精神中不可或缺的一部分。\n对于读者来说，好文章的好处是显而易见的。当作者花时间准备一篇高质量的文章时，知识就会从一个头脑无缝地流向另一个头脑。不过，我会争辩说，对作家来说，好处可能更大。写一篇好的技术文章需要深入的研究、仔细的思考和大量的实验。换句话说，作者必须先掌握主题，然后才能写作。\n仓促发表的文章吸引的读者很少，提供的信息更少。所以让我们花几分钟时间来思考一篇好文章是什么样子的，以及我们如何才能生产出更多的好文章。\n技术博客作者倾向于专注于他们工作的技术方面-通常是以牺牲他们的写作为代价的。别掉进这个圈套。技术写作就是写作，所有的标准规则都适用。这里是其中的几个。\n言简意赅。短句比长句好。段落也是如此。你的目标是告诉你的读者，而不是让他们不知所措。让事情变得简单。\n要有明确的目标。你文章中的每一件事都应该朝着同样的目标努力。避免与主题无关的切线。如果切线很有趣，请将它们保存到以后的文章中。\n找出你的论点。所有好的写作，包括技术写作，都有论据。参数可以是“此设计模式有用”或“此功能按以下方式工作”。如果你不确定你的论点是什么，退后一步，在继续之前确认一下。然后，你可以通过提出适当的证据，围绕论点来撰写你的文章。\n语法，语法，语法。标准的语法和拼写使散文清晰易懂。这在所有写作中都很重要，包括技术写作。打字错误和语法错误可能看起来并不重要，但当读者发现它们时，就会削弱你的信息。\n无情地编辑。作家可能犯的最大错误是未经编辑就发布。几乎可以肯定的是，你的初稿太长、太乱，或者错误百出。花点时间编辑你的文章，在删减不必要的材料时要积极进取。\n与任何类型的写作一样，科技写作必须吸引并保持读者的注意力。仅仅提供事实和数字是不够的。你需要说出读者的兴趣，并证明你的文章值得他们花时间。好的写作是做到这一点的最好方式。\n技术写作可能只是写作，但这并不意味着它不是独一无二的。如果您正在撰写关于技术主题的文章，那么使用该领域的示例是很自然的。对于程序员来说，这意味着使用代码片段。当然，编写代码本身就是另一种编写！这意味着我们早先的许多规则仍然适用。\n当您演示代码片段时，请尝试与您的读者产生共鸣。你的片段清楚了吗？它是否直接针对您的主题？它是否引入了不必要的复杂性？让我们看一个例子。假设您试图解释映射函数在Python中是如何工作的，并且您起草了以下代码片段。\n这段代码可以工作，而且它确实利用了MAP，但是在其他方面很难理解。函数和参数名称是无稽之谈，lambda函数的使用不必要地复杂，并且代码段没有特殊原因地使用一流函数。重点是让读者了解地图的功能--不要将它们与相关但切题的主题混淆。这里有一个更好的版本。\n在这个版本中，意图要清晰得多。Map函数是代码段的核心，变量名有意义，并且没有分散注意力的切线。在不必要的时候抵制使用高级功能的诱惑。您的目标应该是起草简单而直接的示例，不要被无关的内容弄得模糊不清。\n不过，有时候，清晰的代码是不够的。您的代码片段也需要有趣。例如，以下面的片段为例，它说明了类继承的概念。\n这段代码本身没有任何错误-它清晰、简洁，并且集中在我们感兴趣的主题上。唯一的问题是它不是特别引人入胜。汽车的例子被广泛使用，感觉有点乏味。我们再试一次。\n收据示例可能很平凡，但感觉像是您作为开发人员可能会实际做的事情。从这个意义上说，它比汽车的例子更相关。主题可能很无聊，但至少它是真实的，因此是相关的。\n相关性是帮助读者与您的片段建立联系的一种方式，但不是唯一的方式。不要害怕使用一点奇思妙想。既然你可以写星际飞船和恐龙，为什么还要写交通工具和动物呢？发挥你的想象力！为您的代码片段选择引人入胜的原创示例将保持您的读者的注意力和兴趣。\n现在，您已经有了一篇写得很好的文章，其中包含深思熟虑和引人入胜的代码片段，但是仍然有一种方法可以让您彻底失败：糟糕的表示。文章的视觉设计提供了结构，并控制主题如何相互流动。如果你不注意，你的话可能会被笨拙的设计所掩盖。\n大多数博客平台都有丰富的设计功能，无论是斜体、代码突出显示、项目符号、副标题还是图片。利用这个功能--它可以帮助你设计一篇视觉上有吸引力的文章，吸引读者，而不是把他们推开。\n好的视觉设计应该干净实用，带有些许风格。不过，按照惯例，我们的简明原则是适用的。没有必要在你的文章中散布不必要的图片或图表。一点点就能走很长一段路。当您决定使用非文本元素时，请慎重考虑。视觉元素和文本一样是你文章的一部分，应该给予同等的关注。请考虑下面的代码片段，这是一篇关于搜索算法的概念性文章。\nDef binary_search(Items，target)：Left=0 right=len(Items)-1 While Left&lt；=Right：MID=(Left+Right)//2 If Items[MID]==target：如果Items[MID]&gt；target：Right=MID-1 Else：Left=MID+1 Return False Company_Languages=[&#34；C++&#34；，&#34；Clojure&#34；，&#34；JavaScript&#34；，&#34；Python&#34；，&#34；Ruby&#34；]Candidate_Language=&#34；Python&#34；IF BINARY_SEARCH(COMPANY_LANGUAGE，CADIDATE_LANGUAGE)：PRINT(f&#34；我们也使用{CADIDATE_LANGUAGE}！&#34；)否则：PRINT(f&#34；您愿意学习另一种语言吗？&#34；)。\n不是很吸引人吧？内容很好，但缺少语法突出显示会让人分心，而且单调乏味。\n好多了！这是一个很小的改变，但会带来更愉快的视觉体验。这也表明你在花时间考虑细节。如果你用语法突出显示这类简单的东西来考虑细节，那么读者就会知道你在文章的内容中也考虑了细节。\n写作很难，但也很快乐。对于一个作家来说，把你的想法写在纸上是非常令人满意的。在这个过程中，你不仅可能学到一些新的东西，你的读者也可能学到一些新的东西。你写得越多，你得到的快乐就越多。\n对于技术博客写手来说，冒名顶替者综合症一直是一个令人担忧的问题。不管你学了多少，总会让人觉得别人知道得更多。不过要记住，你不是在写教科书。你在为你自己写作。你应该努力做到准确，并做足够的研究和测试来证实这一点，但归根结底，你仍然是一个业余爱好者。这没什么大不了的！\n好的写作既是关于教学的，也是关于学习的。如果你对一个话题感到好奇，甚至被它弄糊涂了，你能做的最好的事情就是写下它。这一过程将迫使你在此过程中不断学习。\n与编码、数据或工程一样，写作是一项需要练习的技能。但数量并不一定意味着质量。不要以多产为目标--要以深思熟虑为目标。所有的写作，无论是技术上的还是其他方面的，都是非常个人化的。它向世界表明了你是谁，如果你花时间做对了，读者会注意到的。", "note_en": "Writing is humanity’s superpower — when done well, it informs, provokes, and entertains. Perhaps that is why blogging is so popular among programmers. We’re a naturally curious community and sharing knowledge is an integral part of our ethos.\n For the reader, the benefits of good writing are obvious. When  an author takes the time to prepare a high-quality article, knowledge flows seamlessly from one mind to another. I would argue though that the benefits may be even greater for the writer. Writing a good technical article requires deep research, careful thought, and a significant amount of experimentation. In other words, an author must master their topic before they can write about it.\n A rushed article is one that will attract few readers and inform even fewer. So let’s take a couple of minutes to think about what a good article looks like and how we can produce more of them.\n  Technical bloggers tend to be focused on the technical side of their work — often at the expense of their writing. Don’t fall into this trap. Technical writing is just writing and all of the standard rules apply. Here are a few of them.\n Be concise. A short sentence is better than a long one. The same goes for paragraphs. Your goal is to inform your reader, not to overwhelm them. Keep things simple.\n Have a clear goal. Everything in your article should work towards the same goal. Avoid tangents that are unrelated to your main topic. If the tangents are interesting, save them for a future article.\n Identify your argument. All good writing, including technical writing, has an argument. The argument may be “this design pattern is useful” or “this feature works in the following way”. If you aren’t sure what your argument is, take a step back and identify it before moving on. Then you can build your article around the argument by presenting appropriate evidence.\n Grammar, grammar, grammar. Standard grammar and spelling makes for clear and relatable prose. This is important in all writing, including technical writing. It may seem like typos and grammar errors are unimportant, but when a reader spots them it will detract from your message.\n Edit ruthlessly. The biggest mistake a writer can make is publishing without editing. Your first draft is almost certainly too long, muddled, or riddled with error. Take the time to edit your article and be aggressive as you cut unnecessary material.\n As with any kind of writing, technical writing must capture the reader’s attention and keep it. Presenting facts and figures isn’t enough. You need to speak to the reader’s interests and prove that your article is worth their time. Good writing is the best way to do this.\n  Technical writing may just be writing, but that doesn’t mean it isn’t unique. If you’re writing about a technical topic then it’s natural to use examples from that domain. For programmers, this means using code snippets. Of course, writing code is itself another kind of writing! That means that many of our earlier rules still apply.\n As you are presenting a code snippet, try to empathize with your reader. Is your snippet clear? Does it address your topic directly? Does it introduce unnecessary complexity? Let’s look at an example. Imagine that you are trying to explain how the  map function works in Python and you draft the following code snippet.\n  This code works, and it does indeed make use of  map, but it’s otherwise unintelligible. The function and parameter names are nonsense, the use of a lambda function is unnecessarily complicated, and the snippet uses a first-class function for no particular reason. The whole point is to teach your reader about the  map function — don’t confuse them with related but tangential topics. Here is a better version.\n  In this version, the intent is much clearer. The  map function is the centerpiece of the snippet, the variable names are meaningful, and there are no distracting tangents. Resist the temptation to use advanced functionality when it’s not necessary. Your goal should be to draft simple and direct examples that aren’t muddied by extraneous content.\n Sometimes though, clear code isn’t enough. Your snippets also need to be interesting. For example, take the below snippet, which illustrates the concept of class inheritance.\n  There is nothing inherently wrong with this snippet — it is clear, concise, and focuses on the topic we’re interested in. The only problem is that it’s not particularly engaging.The   Car example is widely used and feels a bit uninspired. Let’s try again.\n  The  Receipt example may be mundane, but it feels like something that you might actually do as a developer. In that sense, it’s much more relevant than the  Car example. The subject matter may be boring, but at least it’s  real, and therefore relatable.\n Relevance is one way to help your readers connect with your snippets, but it’s not the only way. Don’t be afraid to use a little whimsy. Why write about  Vehicles and  Animals when you could write about  Starships and  Dinosaurs instead? Use your imagination! Choosing engaging and original examples for your code snippets will keep your reader focused and interested.\n  Now you have a well-written article with thoughtful and engaging code snippets, but there is still one way that you can tank the whole thing: poor presentation. The visual design of your article provides structure and governs how topics flow into one another. If you don’t pay attention, your words could be overshadowed by clunky design.\n Most blogging platforms have ample functionality for design, whether it’s  italics,  code highlighting, bullets, subheadings, or images. Make use of this functionality — it’s there to help you design a visually appealing article that draws the reader in rather than pushing them away.\n Good visual design is clean and functional, with a dash of style. Per usual though, our principle of simplicity and concision applies. There is no need to litter your article with unnecessary images or charts. A little bit goes a long way. And when you do decide to use non-text elements, do so thoughtfully. Visual elements are as much a part of your article as the text, and should show equal care. Consider the below code snippet for a notional article about searching algorithms.\n def binary_search(items, target):  left = 0  right = len(items) - 1    while left &lt;= right:  mid = (left + right) // 2  if items[mid] == target:  return True  if items[mid] &gt; target:  right = mid - 1  else:  left = mid + 1  return False company_languages = [&#34;C++&#34;, &#34;Clojure&#34;, &#34;JavaScript&#34;, &#34;Python&#34;, &#34;Ruby&#34;] candidate_language = &#34;Python&#34; if binary_search(company_languages, candidate_language):  print(f&#34;We use {candidate_language} too!&#34;) else:  print(f&#34;Are you willing to learn another language?&#34;)\n Not very appealing is it? The content is fine, but the lack of syntax highlighting is distracting and bland.\n  Much better! It’s a small change, but it makes for a more enjoyable visual experience. It also shows that you’re taking the time to consider the details. And if you considered the details with a simple thing like syntax highlighting, then the reader will know that you considered details in the content of your article as well.\n  Writing is hard, but it’s also joyful. For a writer, it can be immensely satisfying to put your thoughts to paper. Not only are you likely to learn something new in the process, but your reader might learn something new too. And the more you write, the more joy you will derive.\n For technical bloggers, imposter syndrome is always a concern. No matter how much you learn, it will always seem like someone else knows more. Remember though, you’re not writing a textbook. You’re writing for yourself. You should strive to be accurate, and do sufficient research and testing to confirm as much, but at the end of the day you’re still an amateur. And that’s OK!\n Good writing is as much about learning as it is about teaching. If you’re curious about a topic, or even confused by it, the best thing you can do is write about it. The process will force you to learn along the way.\n  As with coding, or data, or engineering, writing is a skill that takes practice. But quantity does not necessarily mean quality. Don’t aim to be prolific — aim to be thoughtful. All writing, whether technical or otherwise, is deeply personal. It says something to the world about who you are, and if you take the time to do it right, readers will take notice.", "posttime": "2020-10-15 00:18:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,科技,technical,文章", "title": "浅谈科技博客的写作", "title_en": "On Writing Technical Blogs", "transed": 1, "url": "https://medium.com/@severinperez/on-writing-technical-blogs-8c0c23f94f3", "via": "", "real_tags": ["博客", "科技", "technical", "文章"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有些软件工程文章似乎不会过时。例如，1986年的文章“理性设计过程：如何以及为什么伪造它”[DOI][pdf]。\n当时，软件工程学正在寻找所谓的理性设计过程，即，如果严格遵循的软件开发过程，将以最低的成本产生最高质量的软件。如今，该过程通常被称为“瀑布”，几乎与“糟糕的软件设计”同义词，已经被“敏捷”、“Scrum”、“看板”或“精益”等过程所取代。本质上，瀑布模型分为几个不同的阶段：需求收集、高级系统设计、低级模块设计、实现和文档编制。每个阶段结束时都有一个人工制品(文档或代码)，一旦生产出来，它就会被固定在石头上。\n我们永远也找不到一个能够让我们以完全理性的方式设计软件的过程。好消息是我们可以伪造它。我们可以把我们的系统展示给其他人，就好像我们是理性的设计者一样，在开发和维护期间假装这样做是值得的。\n引用的论文表明，需求是模糊的和不稳定的，因此，无论人们如何努力，最终的软件都不会遵循合理的设计过程。取而代之的是，论文主张通过制造这些文物来伪造理性的设计过程，就好像遵循了理性的设计过程一样。本质上，工件被更新以反映最新的决策，例如，如果在实现期间发现新的需求，则更新需求文档。\n注意到这件商品陈年情况很好，这是很有趣的。自发布以来，敏捷开发方法一直从工程角度出发，主张尽可能少地实现，以向客户交付价值。过了一会儿，业务方也加入了。精益思维已经明确承认，一个人通过制造产品来发现市场需求。“建措施学”是新的口头禅。在某种程度上，项目迭代地通过Rational设计过程，但每个阶段的执行仅用于从市场中学习新东西所需的数量。\n看待精益思维的另一种方式是减少在制品(WIP)。包含许多未实现需求的需求文档称为WIP。包含许多未实现模块的体系结构文档称为WIP。\n然而，虽然精益思维将大量注意力放在最小化在制品上，但它较少关注于伪装合理的设计过程：阅读带有许多TODO的修补文档或代码提高了新来者(无论是客户还是工程师)的门槛。对他们来说，最好是获得文档和代码的快照，就好像一切都“完成”了。", "note_en": "Some software engineering articles don’t seem to age. For example, the 1986 article “A rational design process: How and why to fake it”  [doi] [pdf].\n Back then, software engineering was looking for a so-called rational design process, i.e., a software development process that, if followed rigorously, would lead to the highest quality software with the lowest cost. Nowadays, that process is often called “waterfall” and is almost used synonymously with “bad software design”, having been replaced with processes like “agile”, “scrum”, “kanban” or “lean”. In essence, the waterfall model argues for a few different phases: requirements gathering, high-level system design, low-level module design, implementation and documentation. Each phase finishes with an artefact (documentation or code), that once produced is set in stone.\n We will never find a process that allows us to design softwarein a perfectly rational way. The good news is that we can fake it. We can present our system to othersas if we had been rational designers and it pays to pretend do so during development and maintenance.\n The cited paper makes the case that requirements are vague and volatile, hence the final software will not have followed a rational design process, no matter how hard one tries. Instead, the paper argues to fake a rational design process, by producing said artefacts, as if a rational design process had been followed. In essence, the artefacts are updated to reflect the latest decision, for example, the requirements document is updated if during implementation a new requirement is discovered.\n It is interesting to note how well the article has aged. Since its publication,  Agile development methods have long argued from the engineering side to implement as little as is needed for delivering value to the customer. A bit later, the business side joined.  Lean thinking has explicitly acknowledged that one discovers the market’s needs by building a product. “Build measure learn” is the new mantra. In a way, the project passes iteratively through the rational design process, but each phase is performed only for as much as is needed to learn something new from the market.\n Another way to see lean thinking is to reduce Work-In-Progress (WIP). A requirement document with many unfulfilled requirements is a WIP. An architecture document with many unimplemented modules is a WIP.\n However, while lean thinking puts a lot of focus on minimizing WIP, it puts less focus on faking a rational design process: Reading patched documentation or code with many  TODOs raises the bar for newcomers, both customers and engineers. It is best for them to get a snapshot of documentation and code, as if everything was “done”.", "posttime": "2020-10-15 00:18:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,design,文档", "title": "理性设计过程：如何以及为什么要伪造它", "title_en": "Rational Design Process: How and Why to Fake It", "transed": 1, "url": "https://cristian.kleinlabs.eu/posts/rational-design-process-how-and-why-to-fake-it/", "via": "", "real_tags": ["设计", "design", "文档"]}, {"category": "", "categoryclass": "", "imagename": "7787133c1f446b6c9053b5fee3629ec2.jpg", "infoid": 1028815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以太基金会为生态系统引入了一种新的智能合同语言，名为“Fe”(发音为Fee)。", "note_en": "The Ethereum Foundation has introduced a new smart contract language called 'Fe' (pronounced fee) for the ecosystem.", "posttime": "2020-10-15 00:17:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "foundation,基金会", "title": "Etherum Foundation为生态系统推出新的智能合同语言Fe", "title_en": "Ethereum Foundation introduces new smart contract language Fe for the ecosystem", "transed": 1, "url": "https://www.theblockcrypto.com/linked/80842/ethereum-new-smart-contract-language-fe", "via": "", "real_tags": ["基金会"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在生活中某一时刻做出的选择是大脑灰质复杂计算的结果，这是神经网络的结果，这让我们觉得发生在我们身上的每件事都与我们无关。\n从童年到成年，随着年龄的增长，我们的神经通路也在不断增长。这只是我们储存在记忆中的经验，以及我们已经获得的偏向，偏爱其中一个而不是另一个。\n当给你提供咖啡或茶时，如果你对咖啡有非常强烈的偏好，那么你的大脑会自动让你说出咖啡。这意味着，尽管你认为你是从提供给你的选择中选择了咖啡，但你的大脑已经提前计算出了这个选择，而这就是你的选择。当我说大脑时，我指的是神经网络，当我说神经网络时，我指的是你记忆的经验和你的偏见。\n你有时可能会换一种方式要一杯茶。当你喝了足够的咖啡，并且由于生理原因，你对咖啡的兴趣减弱时，就会发生这种情况。说你最近喝的咖啡味道不好。因此，人们对咖啡的偏好慢慢下降，取而代之的是茶。这一切又可以说是在没有您参与的情况下自动发生的。\n在上面的所有内容中，我一直在谈论你的大脑计算一个结果，而你这个人自动地成为这样一个决定的一部分。尽管你的大脑是你的一部分，我已经把它们分开展示了。因为让你成为一个内在的人的是弥漫在你整个存在中的自我意识。你并不是唯一的大脑。你觉得你存在于你的内心。\n为了让它听起来更有形，我们可以称之为“注意”。你的“注意力”在任何时刻定义了你的意识或你是一个有意识的存在。正是这种“关注”把你带到了当下。如果没有它，你可能会身临其境，但可能不会意识到正在发生什么。我们中的大多数人，大部分时间都沉浸在思考中，我们的注意力需要回到现在，关注与我们相关的事情。\n现在我已经澄清了两件事。一个是你经历的“记忆”，它会自动做出决定，给人一种你正在做这个决定的错觉。另一种是通过“专心”而不是沉浸在思考中来感受你的存在。\n“没有自由意志”阵营说，因为在你内心，你所做的一切都是预先决定的，或者你的选择是根据先例自动计算出来的，你这个人在你所做的选择中没有任何作用。\n虽然这看起来是真的，但我想说的是，你内心的人或感觉是一个不同的实体，而不是基于先验做出决定的神经网络部分。通常你没有注意，或者你没有完全意识到你现在的时刻。这使你处于一种自动驾驶模式或半意识模式，在这种模式下，你通过神经网络或你的经验记忆部分的自动计算，根据你过去的经验来决定事情。\n然而，有些状态下，你全神贯注于当下，不受你过去记忆的偏见，不受你的经历的蒙蔽，像婴儿一样新鲜，使你成为一个完全有意识的人，没有过去的包袱。无论你在这种状态下做出什么选择，都不受你的习惯性记忆或过去经历的束缚。", "note_en": "That the choice we make in our lives at a given moment is a result of a complex computation that happens in our grey matter which is an outcome of a neural network makes us feel that everything that happens in us has nothing to do with us.\n Our neural pathways keep growing as we age from childhood into adulthood. This is nothing but our experiences stored in memory and the biases we have acquired preferring one over other.\n When you are offered  Coffee or Tea, if you have a very strong preference for Coffee, then your brain automatically makes you tell coffee. This means though you think you chose Coffee out of the choices offered to you, your brain had computed the choice much in advance and that’s what was your choice. When I say brain, I mean the neural network and when I say a neural network, I mean your memorized experiences along with your biases.\n You may sometimes switch and ask for Tea. This can happen when you have had enough Coffee and your interest in Coffee has dwindled due to physiological reasons. Say the Coffee you had of late was not tasting good for you. So the preference for Coffee slowly goes down and is replaced by Tea. All this again can be said to be an automatic happening without Your involvement.\n In all the above, I have been talking about your brain computing an outcome and You the person automatically being part of such a decision. Even though your brain is part of you, I have shown them separately. Because what makes you as a person inside you is the self-awareness which pervades all through your being. You are not your brain alone. You feel you exist within you.\n To make it sound more tangible, we can call it the ‘Attention’. Your ‘Attention’ at any moment defines your awareness or you as a conscious being. It is the ‘Attention’ that brings you to the Present moment. Without it, you may be physically there, but may not be aware of what is going on. Most of us, most of the times are lost in thoughts and our attention need to be brought back to the present moment on matters that concern us.\n Now that I have clarified two things. One being the ‘memory’ of your experiences that makes automatic decisions giving an illusion that You are taking that decision. The other being the feeling of Your existence by being ‘attentive’ and not lost in thoughts.\n The ‘there is no free will’ camp says that because within you everything what you do is predetermined or your choices are automatically computed from priors, You the person has no role to play in the choices you make.\n While this appears to be true, I would like to say that the Person or the feeling of a being within you is a different entity than the neural network part that decides based on priors. Often you do not pay Attention or you are not fully aware of your present moment. This makes you in a sort of auto-pilot mode or semi-conscious mode where you decide things based on your past experiences by the automatic computation of the neural network or the experiential memory part of you.\n However, there are states where you are with complete attention to the present moment, unbiased by your past memory, unclouded by your experiences, fresh as a baby making you a fully conscious being without the baggage of the past. Whatever choices you make in this state are not bound by your habitual memory or your past experiences.", "posttime": "2020-10-15 00:17:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "意志,free,咖啡", "title": "自由意志存在", "title_en": "Free Will Exists", "transed": 1, "url": "https://medium.com/@thallukrish/free-will-exists-f76391951be8", "via": "", "real_tags": ["意志", "free", "咖啡"]}, {"category": "", "categoryclass": "", "imagename": "f2379bd1cdd9c4e53303a8c63dbdfc22.png", "infoid": 1028813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，育碧给了我一个机会，让我在一个几乎零售的州玩它即将推出的开放世界任务游戏“刺客信条”(Assassin&#39；s Creed Valhara)。在此之前，我在7月份进行了3.5小时的试玩，老实说，我的综合测试的长短相当简单：我喜欢这款游戏。育碧在这款我们非常喜欢的游戏“刺客信条·奥德赛”的续集中，很可能在新内容和熟悉内容之间取得了恰当的平衡。因此，我很乐观。\n然而，我还没有看到在最终的零售体验中，好的部分是如何结合在一起的，或者到目前为止，我看到的坚实的势头和步伐是否在发布版的审查下分崩离析。(或者，很明显，这款游戏是否会在一个巨大的开放世界引擎的负荷下崩溃或崩溃，所有这些都是在11月10日在无数新旧平台上发布的。)。\n与此同时，我将借此机会谈谈我在玩PC版时注意到的一些东西(通过育碧的私有云服务流传到我家)，然后在我们的评论区开放提问，以防我遗漏了什么(我可能遗漏了什么)。在此期间，我将利用这一时刻谈谈我在玩PC版时注意到的一些东西(这些东西是通过育碧的私有云服务流传送到我家的)，然后在我们的评论区公开提问，以防我遗漏了什么(我可能遗漏了什么)。\n更多的有机开放世界内容。如果你在过去的十年里玩过一个开放世界的育碧游戏，你就会知道游戏规则：你要面对一吨重的任务、赏金、差事和杂务，你可以期待弹出数量惊人的地图代金券，它们会把你送到任何地方，然后让你扭曲或骑马完成每一步。\n不管是谁在ACV上驾驶这艘船，他最终一定已经得到了这样一种安排取回任务的疲惫感觉，因为ACV尝试了一种不同的方法。与战役相关的任务线带领你穿过游戏世界的长长地带，无论是步行、骑马还是乘船，以发现新的地形，并在此过程中出现新的可能性。一个女人在这里尖叫求救；一个孩子让你在那里捉迷藏；一个老板出现在一条小路上一个令人毛骨悚然、雾气弥漫的沼泽里；一个充满敌意的小村庄让你敢去那边突袭。\n如果你想暂停你的主要任务，享受一下快速的消遣，那么一定要想办法：消遣通常都在路上，它们的要求(战斗，解谜)通常会让你从头到尾都在同一区域。或者，您也可以跳过分流，稍后再来(地图上标有简单的检索标记)。到目前为止，这种节奏主导了我所有的预览剧，我希望这种节奏能坚持完整的零售体验。\n一项我可以参与的任务。我对斯堪的纳维亚历史--尤其是9世纪北欧海盗首领为躲避饥荒而逃到英国--不够精通，无法证明ACV的故事有多么准确或恰当。但我要说的是，我最近的课程让我更好地参与了埃弗的维京之旅。在完成了一次又一次竞选任务的情节节拍之后--上周，在三个小时的旅程中杀死了麦西亚国王，并安插了一位富有同情心的木偶领袖--用讨人喜欢的灰色演员阵容(这一次，还有改进的面部动画)包围了游戏中的英雄埃沃尔(无论是男是女，取决于你)，效果要好得多。", "note_en": "Last week, Ubisoft offered me an opportunity to play its upcoming open-world quest game  Assassin&#39;s Creed Valhalla in an almost-retail state. This follows  my 3.5 hours of preview gameplay in July, and honestly, the long and short of my combined tests is pretty simple: I like this game just fine. Ubisoft may very well have struck the right balance between new and familiar content in this follow-up to  Assassin&#39;s Creed Odyssey, a game  we very much liked. As a result, I&#39;m optimistic.\n However, I&#39;ve yet to see exactly how the good bits fit together in the final retail experience or whether the solid momentum and pacing I&#39;ve seen thus far falls apart under launch-version scrutiny. (Or, obviously, whether the game will buckle or crash under the load of a massive open-world engine, all while launching on a zillion old and new platforms on November 10.)\n In the meantime, I&#39;ll take this moment to talk about some of the stuff I&#39;ve noticed thus far while playing the PC version (as streamed to my home via Ubisoft&#39;s private cloud services), then open the floor up to questions in our comments section in case I missed anything (which I probably did).\n  More organic open-world content. If you&#39;ve played an open-world Ubisoft game in the past decade, you know the drill: you&#39;re in for a metric ton of quests, bounties, errands, and chores, and you can expect a ridiculous number of map tokens to pop up that send you every which way and then make you warp or ride a horse to finish each step.\n Whoever steered the ship on  ACV must&#39;ve finally gotten the memo on how tiring this arrangement of fetch quests can feel, because  ACV tries a different approach. Campaign-related quest lines lead you through long stretches of the game&#39;s world, either on foot, horse, or boat, to uncover new terrain, and emergent possibilities appear along the way. A woman screams for help here; a child asks you to play hide andnseek there; a boss shows up in a creepy, mist-filled bog down one path; and a small, antagonistic village dares you to &#34;raid&#34; it over yonder.\n If you&#39;d like to pause your primary mission and enjoy a quick diversion, by all means: diversions are typically on the way, and their requirements (battling, solving puzzles) keep you generally within the same area from start to finish. Or feel free to skip the diversion and come back later (marked on your map for simple retrieval). I&#39;m hopeful that this pacing, which has dominated all of my preview play thus far, persists in the full retail experience.\n    A quest I can get into. I&#39;m not versed enough in Norse history—particularly the 9th-century period when its Viking leaders fled to England to escape famine—to vouch for how accurate or appropriate  ACV&#39;s storytelling is. But I will say, my more recent session did a much better job of keeping me engaged with Eivor&#39;s Viking journey. Following the plot beats from campaign mission to campaign mission—in last week&#39;s case, along a three-hour journey to kill the King of Mercia and install a sympathetic puppet leader—did much better to surround the game&#39;s hero, Eivor (either male or female, up to you), with a likable shades-of-gray cast (and with improved facial animations this time, to boot).", "posttime": "2020-10-15 00:03:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "刺客,creed,任务", "title": "刺客信条瓦尔哈拉在11月推出前的最后一次测试", "title_en": "One last Assassin’s Creed Valhalla test ahead of its November launch", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/one-last-assassins-creed-valhalla-test-ahead-of-its-november-launch/", "via": "", "real_tags": ["刺客", "creed", "任务"]}, {"category": "", "categoryclass": "", "imagename": "f0fa13999e4ced6094e7d4919b9c7be6.jpg", "infoid": 1028812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的融资活动由Left Lane Capital牵头，正是他领导了M1的B轮融资。要记住，所谓的内部融资现在是2020年看涨的迹象，而不是在之前的风险投资时代，当时它们被认为更酷。其他M1投资者包括Jump Capital，ClockTower Technology Ventures和Chicago Ventures，尽管似乎只有前两家参与了这轮融资。\n根据M1的说法，C系列发行距离B系列融资仅120天。一个很好的问题是，为什么M1筹集了更多资本，为什么Left Lane Capital想要为专注于消费者的金融科技提供商领导两轮融资。回到我们之前的报道，我们可以弄清楚。\n2月份，我们报道M1 Finance已经达到10亿美元的管理资产大关，即AUM。\n这家初创公司将三项不同的传统金融科技服务合并为一项(机器人咨询、新银行和贷款)，使其能够积极为套餐定价。该模型似乎正在发挥作用。几个月后，当M1在6月份提高B系列时，它已经达到14.5亿美元的资产净值，或者说在一个季度多一点的时间里增长了大约45%。那太好了。\n今天，该公司宣布已突破20亿美元的AUM大关，过去四个月涨幅超过38%。\nM1公布了较慢的AUM百分比增长，而在进入C系列的类似时间框架内，原始AUM增长较快。但不管这种细微差别如何，该公司的AUM增长很快。\n这一事实有助于解释它的新一轮谈判。如果你离开了Lane Capital，刚刚带领一轮融资进入公司，然后眼睁睁地看着它保持快速增长，你会想要迅速加倍投资。这不仅是为了购买更多的公司股份，也是为了在另一位投资者出现并购买自己的M1股份之前完成这轮融资，稀释你的股份，并夺取你作为这家初创公司最新首席投资者的优势地位。\n所以Left Lane领导了C系列，希望M1像谚语中的花园刺激物一样持续增长。\nM1的有趣之处在于，它在今年早些时候分享了一个占AUM百分比的收入目标，即它的目标是每年产生约1%的AUM收入。该公司首席执行官布莱恩·巴恩斯本周再次确认了TechCrunch的数字。\n因此，随着超过20亿美元的AUM，我们可以看到，M1的收入今天可能超过2000万美元，如果增长继续下去，到今年年底可能达到2500万美元的运行速度。\nM1是如何为其平台增加这么多资本的？Barnes告诉TechCrunch，M1的用户基数自今年年初以来增加了两倍，目前的用户正在从其他金融平台带来更多资金。这种组合正在使M1变得更大，而且速度更快。\n总而言之，我们上面关于Left Lane可能想要领导C系列以阻止其他公司这么做的评论-在当今炙手可热的风险投资市场上，抢先是经常发生的事情-并不是空洞的猜测。在回答有关其C系列的问题时，巴恩斯告诉TechCrunch，他的公司“幸运地对我们的C系列有巨大的投资者需求，部分原因是它这么快就达到了里程碑”。这听起来像是竞争将投资者引向我们的可能性，至少从我们目前的退出来看是这样。\nM1轮延续了我们今年跟踪的储蓄和投资热潮。同时，这一轮对中西部来说也是一场胜利。当M1达到30亿美元的AUM时，更多。开始倒计时。", "note_en": "The new financing event was led by  Left Lane Capital, the same investor that led M1’s Series B. Bear in mind that so-called inside rounds are now a  bullish sign in 2020, as opposed to in prior VC eras when they were viewed more cooly. Other M1 investors include  Jump Capital,  Clocktower Technology Ventures and  Chicago Ventures, though only the first two appear to have taken part in this round.\n Per M1, the Series C comes just 120 days after it raised a Series B. A good question is  why M1 has raised more capital, and why Left Lane Capital wanted to lead two rounds for the consumer-focused fintech provider. Going back to our prior coverage, we can figure it out.\n   In February,  we reported that M1 Finance had reached the $1 billion assets under management mark, or AUM.\n The startup combines three different traditional fintech services into one (roboadvising, neobanking and lending), allowing it to price the package aggressively. The model appears to be working. When M1  raised its Series B a few months later in June, it had reached the $1.45 billion AUM, or about 45% growth in just over a quarter. That’s very good.\n Today, the company announced that it has surpassed the $2 billion AUM mark, up more than 38% in the last four months.\n M1 posted slower AUM growth in percentage terms and greater growth in raw AUM over a similar time frame heading into its Series C. But regardless of that nuance, the company’s AUM grew quickly.\n  That fact helps explain its new round. If you were Left Lane Capital, had just led a round into the company, and then watched it keep growing rapidly, you’d want to double-down quickly. Not only to buy more of the company, but also to get the round done before another investor could show up and buy its own piece of M1, diluting you and nabbing your ascendant position as the startup’s most recent lead investor.\n So Left Lane led the Series C, hoping that M1 keeps growing like the proverbial garden irritant.\n  Something fun about M1 is that it shared a revenue target as a percent of AUM earlier in the year, namely that it aims to generate around 1% of its AUM in revenue each year. The company’s CEO Brian Barnes re-confirmed the number for TechCrunch this week.\n So, with more than $2 billion in AUM, we can see that M1’s revenues are probably on a run rate of more than $20 million today, and could crest a $25 million run rate by the end of the year, provided that growth continues as it has for the startup.\n How is M1 adding so much capital to its platform? Barnes told TechCrunch that M1 has tripled its userbase since the start of the year, and that its current users are bringing more funds in from other financial platforms. The combination is making M1 larger, and quickly.\n To wrap, our notes above about Left Lane probably wanting to lead the Series C to keep some other firm from doing it — pre-emption is a regular thing in today’s hot VC market — weren’t mere idle speculation. Barnes told TechCrunch in response to a question about its Series C that his company was “fortunate to have significant investor demand for our Series C, partly due to hitting milestones as quickly” as it has. That sounds like the possibility of competing lead investors to us, at least from our present remove.\n The M1 round continues the savings and investing boom we’ve tracked this year. And the round is a win for the Midwest at the same time. More when M1 reaches $3 billion in AUM. Start your countdown.", "posttime": "2020-10-15 00:00:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "finance,m1", "title": "\nM1 Finance在筹集3300万美元B系列资金仅仅几个月后就完成了4500万美元的C系列融资", "title_en": "\n\t\t\t\tM1 Finance closes $45M Series C mere months after it raised its $33M Series B\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/m1-finance-closes-45m-series-c-mere-months-after-it-raised-its-33m-series-b/", "via": "", "real_tags": ["finance", "m1"]}]