[{"category": "", "categoryclass": "", "imagename": "dbc0a17617f449900f9aee1f9f33bd4a.jpg", "infoid": 1067646, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Onyx的区块链平台，Liink使金融机构和企业用户能够以更高的速度和控制来制作安全的点对点数据传输。\n  Liink是一个网络，参与者可以访问越来越多的应用程序，可以帮助改善共同交易，交易和信息流。\n  连接到Liink与单一API集成一样简单，我们的平台在创新的探索环境中提供预设的软件开发工具。\n  连接全球金融机构和公司用户社区，我们正在为您和您的客户提供更好的结果。\n    我们创建了李华理解全球银行系统的广大复杂性。通过利用分布式分区技术，我们创建了一个更开放和高效的信息共享网络，包括世界上许多最大的金融机构。“\n  通过浏览，这些应用程序改进了如何进行连接，解锁传输信息的无摩擦体验。 ", "note_en": "Using Onyx’s blockchain platform, Liink enables financial institutions and corporate users to make secure, peer-to-peer data transfers with greater speed and control.\n  Liink is a network where participants can access a growing collection of applications that can help improve common transaction, trade and information flows.\n  Connecting to Liink is as simple as a single API integration, and our platform offers prebuilt software development tools within an innovative exploration environment.\n  Connecting a global community of financial institutions and corporate users, we are working to deliver better outcomes for you and your customers.\n    We created Liink understanding the vast complexities of the global banking system. Through leveraging distributed ledger technology, we have created a more open and efficient network of information sharing, comprised of many of the largest financial institutions in the world.”\n  With Liink, these applications improve how connections are made, unlocking a frictionless experience of transferring information.", "posttime": "2021-06-23 14:31:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "链接,liink", "title": "链接和JP。 摩根 ", "title_en": "Liink by J.P. Morgan", "transed": 1, "url": "https://www.jpmorgan.com/onyx/liink.htm", "via": "", "real_tags": ["链接", "liink"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "凭借Ruby和Python的混合语法，可以在不到一个小时内学习，而且它易于嵌入另一个应用程序以进行脚本。  ＃python喜欢导入语句。 从OS导入时钟开始，当时＃递归fibonacci函数。 如果n＆lt ;. def fib（n） 2然后返回n末端返回fib（n  -  1）+ fib（n  -  2）结束＃将所有fibonacci从0到5打印出来。 因为我在0 .. 5打印（FIB（i））结束  完整的语言（包括内部结构和运行时）是一个独立的可执行文件，其外部依赖性可以轻松复制到闪存驱动器。 而且语言本身可以在秒表中编译，没有任何依赖项（原因，您需要C编译器和可选的构建系统）。 ", "note_en": "With mixed syntax of ruby and python, that can be learned in less than an hour, and it&#39;s easy to embed into another application for scripting.\n # Python like import statement. from  os  import  clock  as  now # A recursive fibonacci function. def  fib ( n )  if  n  &lt;  2  then  return  n  end  return  fib ( n - 1 )  +  fib ( n - 2 ) end # Print all fibonacci from 0 to 5 exclusive. for  i  in  0 .. 5  print ( fib ( i )) end\n The complete language (including the internals and runtime) is a standalone executable with zero external dependency, that can be easily copied to a flash drive. And the language itself can be compiled from source in seconds without any dependencies (of cause you need a C compiler and  optionally a build system).", "posttime": "2021-06-23 14:31:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "脚本,small,fib", "title": "Pocketlang  - 一种用于脚本和嵌入的小型，快速友好的语言 ", "title_en": "PocketLang – a small, fast and friendly language for scripting and embedding", "transed": 1, "url": "https://thakeenathees.github.io/pocketlang/", "via": "", "real_tags": ["脚本", "small", "fib"]}, {"category": "", "categoryclass": "", "imagename": "a2a0bdf36e1db58d7f5b700bc87ae237.png", "infoid": 1067644, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想到了解某事的最佳方式是尝试从头开始建立它，看看会发生什么。\n 对于今年的JS @ PayPal会议，我认为这将是一个有趣的术语，即在30分钟的谈话中举行的码代码比特币。我从未尝试过一个现场编码的谈话，所以我想我会扔在深渊！\n 这是我在会议之前录制的全长视频，深入解释我所做的一切：\n         比特币是蒙娜丽莎，激光眼睛。我建造的是......右边的东西。\n   “块”就像包含各种数据的对象，它在比特币网络上传播，因此每个人都有相同的状态和事实源，包括相同的交易。\n 每个块都被加密绑定到上一个块，形成了一系列具有新数据和新事务的块。\n 每个块包含事务，这意味着硬币可以在网络上的不同演员之间传输。鲍勃送Jane 5硬币，Jane发送哈利3个硬币，等等。我们可以通过查看所有历史块来跟踪余额。 \n块需要被生成“开采”，这需要一定的计算能力和运气。这确保了网络：要破解或攻击比特币，您需要比网络上的其他人更多的计算能力。\n 任何成功挖掘街区的人都赚取了固定数量的硬币。这鼓励矿工继续挖掘。\n 交易也会出现可选费用。这些费用也由街区的矿工收集，以及块奖励。所以挖掘新块有一种双重激励。\n 挖掘块随着时间的推移逐渐逐渐变得更加难以更加困难或更容易，以确保每个新块以大约恒定的速率开采。保持块速率常量很重要：块时间太高，网络将无法使用。块时间太低，网络可以轻松地用冲突的块垃圾邮件。\n 网络中的每个节点和矿工都同意所有这些规则，以及块的格式。这使得创建虚假块非常困难，或者发送花费多次硬币的交易 - 即使您确实有大量的计算能力。\n   首先，我提出了块链的公共接口的某种类型。\n   需要发件人，接收者，金额和用户定义费用的事务。费用将确定交易在网络上的优先事项。 \nblock_time是我们在生成的每个块之间的目标。比特币瞄准每个街区之间的10分钟;我们将要去1秒钟，所以我们可以在本地迅速运行这个并尝试一下。\n Initial_Reward是每个街区的硬币的奖励。这种奖励涉及谁开采街区。这种奖励将随着时间的推移减半，并将鼓励更多矿工试图排雷，流程交易，并将网络保持安全和免疫从双重花费或其他攻击。\n right_halving_schedule是此奖励中的一半之前的块数。比特币通常每四年减半。我们的目标是每20个块，相当于每20秒。\n block_size_limit是可以包含在任何块中的最大交易数。我们将将其设置为10，但比特币的实际限制要大得多，并且基于块的MB大小。\n genesis_block定义了初始硬编码块。所有其他块都将具有此成因块作为其祖先。我们现在将颁发此街区到Satoshi，我们将定义默认难度和初始块奖励。\n 当我们在代码中使用它们时，每个人的含义都应该变得更加清晰。\n  接下来，让我们排除块链。这将是我们的“数据库”或所有块和事务的记录系统。 \n您可能认为像比特币一样的块链是一个链接列表，其中每个块是列表中的节点。\n   这棵树可能有许多竞争的分支。我们如何知道哪个分支信任？简单的！我们选择最长的分支，因为这是采取最多计算努力的分支。分支越长，我们可以拥有的更有信心，没有其他分支可以超越它。\n 因此，我们在内存中使用树数据结构来表示我们的块链，因为这允许我们在任何给定时间轻松计算最长分支。\n 我们通过Genesis_Block作为这棵树的根，因为这将永远是第一个块。硬编码这使得事情更容易，并没有提供特定的缺点。\n  接下来，让我们写一些代码来挖掘一个新的块。这将是当天最具挑战性的运动。\n   现有的区块链，此处以root代表。我们需要在此处调用getLongestbranchnode（）来查找当前的“真实”块链，我们希望在顶部挖掘另一个块。\n 矿工的Publickey。这需要成为块的一部分，因此网络上的其他人都知道谁将获得挖掘块的奖励。 \n交易列表。如果我们没有任何交易以发布到网络，则挖掘块并不有多点。\n 大部分都很容易。我们将矿工公钥，ID，父ID，时间，索引和事务插入到新块中。\n 我们将重新验证此处的交易以确保他们正确签名。每个其他节点都会在接受新块之前做同样的事情，我们希望最大限度地提高我们的街区的机会，而不会让任何人拒绝拒绝它的好借口。\n  我们希望每20个街区减半奖励。因此，我们计算当前块索引的当前奖励将是什么，假设奖励在1024开始，并且每20个块减半。这里有一些快速的数学来实现这一点，通过检查当前块索引是否已被20分开，如果是，则为奖励减半。否则我们保持同样的奖励。\n  实际上，比特币每年2016块或大约每2周重新计算一次难度一次。为简单起见，我们将重新计算每个新块的难度，以便我们可以实时演示。\n 这是一种计算困难的极其天真的方式，但它适用于这个例子。\n 如果该块花了太少的时间来生成，我们将增加1的困难。 \n这意味着我们不断重新校准创建下一个块的困难，基于我们需要多长时间创建上一个块。这使得块以大致常数的速率创建，无论有多少矿工都试图挖掘新块。\n 您拥有的矿工越多，“哈希汇率”越高，这是一个衡量世界各地使用多少计算权来挖掘新硬币的计算力。\n   这意味着哈希速率/难度应始终是恒定数，这使每个新块的平均时间保持相对恒定。\n 一旦我们创建了一个新块，我们仍然没有完成。如果难度是正确的，则基于上一个块，网络将仅接受该块。\n 我们在这里以一种非常天真的方式检查这个困难。我们哈希拦截，将哈希转换为一个数字，如果数字因难度均匀地划分，而且没有剩余的，我们允许它通过。\n 这意味着随着难度越来越高，块将传递难度检查的较小且较小的机会，我们必须越来越多地猜测生成一个新块。这需要更多的计算能力，更多的时间。\n 相反也是如此。如果难度编号越来越低，则新块将通过难度检查有更高的机会，并且生成新块将花费更少的猜测。这取得了更少的计算能力，更少的时间。 \n这种难度检查的简单版本有效，因为它更有可能是由2的低数字来分隔，比2比17更高的数字。因此，更容易生成其哈希被删除的块，并且更难生成一个块，其哈希恰好可被17可分离。\n  当新块传播到网络时，我们需要能够将其添加到我们的树数据结构中。\n  首先，我们要验证块是否与其哈希匹配，并且块内的所有事务都已正确签名。\n 然后，我们希望验证块通过所有正确的规则。目前，我们只是检查难度匹配。实际上，我们想检查块的每个字段并完全验证。我们不能相信网络上的任何其他节点，因此我们希望验证每件事。\n 如果块无效，此时它将被节点拒绝。由于整个网络遵循完全相同的分散规则，因此每个节点都将接受完全相同的有效块，并拒绝完全相同的无效块，而无需核心权限告诉他们哪些块有效。\n 因此，攻击者不仅需要花费大量的电力来用于运行计算来创建新块 - 它们也会非常困难地弯曲网络上的每个其他节点设置的规则，以便完整于A的完整性堵塞。\n 最后，我们只需要找到新块指定的父块，并将新块作为子节点添加到该父节点。这将现有树与新块扩展，因此我们可以在以后使用它来计算每个人的当前余额。 \n我们需要做的最后一件事是采取以下一切：\n  基于每个块中的这些值计算链上每个钱包的最终余额。\n  我们通过在任何特定时间找到最长的链，并在所有余额，费用和阻止奖励中找到最长的链条。我们需要执行此操作的所有数据都包含在每个块中。\n  您将注意事务是零和游戏。从一个帐户中减去每个量并添加到另一个帐户。每笔费用也一样。因此，交易只能使用已经存在于网络上的硬币，它们无法创建或销毁硬币。 （当然，您可以将硬币发送到死地址或在划船事故中丢失私钥。这不会破坏硬币，它只使它们永久地无法进入）。\n 然而，奖励不是一个零和游戏 - 我们正在向网络添加新硬币，而不会带走它们。这实际上是所有新比特币的来源。这也是比特币最终到达固定帽的情况。最终，块奖励一半，一半，减半到零。此时，没有任何新的比特币可以从系统中添加或减去，我们最终有2100万的固定帽。\n 此减半计划提供比特币，其S2F值，其价格每四年将其价格上升像发条一样。只是在开玩笑。\n  我们现在完成了数据结构/数据库的一端。我们有一个块链，我们能够创建新的块，将它们添加到树上，并根据树中最长的块链计算每个钱包的最终余额。 \n比特币不仅仅在单个计算机或服务器上运行。我们需要一种连接点对点网络的方法，与他人共享这些块，并将新事务发布到网络。所以我们需要一个节点！\n  同样，我们需要为我们的节点定义某些类型和存根，因此我们有一些东西可以对代码进行编码。\n      首先，我们将实例化我们需要运行该节点的内容：\n  我们需要一个加密密钥对。我们将使用公钥来识别节点/钱包/矿工，以及私钥以签署任何新事务。每个矿工，节点，钱包或任何其他actor都使用此公钥来识别网络上。私钥帮助他们证明了他们的身份。\n 我们需要连接到另一个节点的对等网络。为方便起见，我们在此处使用了假网络，因此我们可以广播和倾听活动。实际上，比特币将通过互联网连接到互联网上的真实点对点网络，而无需任何集中式服务器。\n 当然，我们需要块链本身，我们已经在上面实施了。我们将在此处实例化该块链，因此节点可以使用它来存储新块和挖掘新块并获得当前的钱包余额。\n 我们需要一个想象力。这将要存储传入的事务，直到可以添加到块 - 因为它需要一些时间来生成一个块，我们需要某处以保持交易的平均时间。 \n我们需要能够侦听从网络上的任何其他节点发送的事务：\n  此时，我们只是将交易推入Mempool。我们可以在这一点上验证它 - 但我们已经在将交易中纳入一个块之前这样做，所以我们现在会跳过它。\n Mempool是新交易的暂存区域。他们不是最终的或'真实'，而且没有人应该依靠这些Mempool交易看他们是否已付款。为了成为最终的，交易需要包括在新开采的块中。\n    为此，我们使用我们的私钥创建签名消息。这包含了发送者地址，接收者地址，我们要发送的金额，以及我们要附加到事务的费用（在网络上提供优先级）。\n 只有对公钥（公共地址）的相应私钥的人只能签署这样的事务。如果没有您的私钥，没有人可以代表您发送交易。当然，私钥永远不会与网络上的其他人分享。\n 一旦我们创建并签署此交易，仍有所待的所有待办事项就是将其播放到网络，因此可以由侦听的任何其他节点拾取，并添加到其Mempool中。\n  可以由网络上的任何其他节点创建块，这是大多数块将来自现实世界的位置。因此，我们需要能够倾听其他人的新块，并将它们添加到我们的区块链中。 \n我们已经定义了验证块在AddBlock中的块的完整性逻辑，因此我们只是在此处调用该方法。如果该块被拒绝，没有大不了的事，我们将继续像往常一样继续。\n 我们也将打破当前的Mempool。实际上，我们可能只希望从新块中的Mempool中过滤输出交易，但我们将在此处进行快捷方式以简化。\n    为避免杀死我的浏览器，我在异步循环中运行它每500ms的运行。在循环中，我们从Mempool中拔出有限数量的事务（基于我们之前定义的块大小限制），我们试图挖掘一个包含这些事务的新块。\n 实际上，我们通常会搜索具有最高费用的交易，因此我们可以获得挖掘块的最大奖励。在这里，为简单起见，我们只是按照它们被添加到Mempool的顺序服用它们。\n 如果我们在挖掘一个新块中成功，我们将该块发布到网络以被其他节点消耗。\n 如果其他人在我们这样做之前挖掘了一个新的块，我们会重新开始，并尝试在该块之上挖掘一个新的块 - 由于CreateBlock将始终尝试在任何给定时间的最长块链中挖掘。\n      运行此项目时，我的合作伙伴Jill创建了一个很棒的UI，可以帮助您可视化发生的事情，因为节点挖掘新块并来回发送事务： \n我希望这很有用，帮助您了解用于电力比特币的一些原则！  请记住，这是真正的比特币节点和挖掘软件的巨大简化。 它仅供学习目的，而且更多。 ", "note_en": "I figure the best way to learn about something is to try to build it from scratch and see what happens.\n For this year’s  JS@PayPal conference, I thought it would be an interesting exercise to live-code Bitcoin in a 30 minute talk. I’ve never attempted a live-coding talk, so I figured I would throw myself in the deep end!\n Here’s the full-length video I recorded before the conference, with in-depth explanations of everything I did:\n         Bitcoin is the Mona Lisa, with laser eyes. What I’m building is… that thing on the right.\n   A ‘block’ is just like an object containing various data, which is propagated across the Bitcoin network so everyone has the same state and source of truth, including the same transactions.\n Each block is cryptographically tied to the previous block, forming a long chain of blocks each with new data and new transactions.\n Each block contains transactions, which means coins can be transferred between different actors on the network. Bob sends Jane 5 coins, Jane sends Harry 3 coins, and so on. We can keep track of the balances by looking at all of the historical blocks.\n Blocks need to be ‘mined’ to be generated, which takes a certain amount of computational power and luck. This secures the network: to hack or attack Bitcoin, you need more computational power than everyone else on the network.\n Anyone who successfully mines a block, earns a reward of a fixed number of coins. This encourages miners to keep mining.\n Transactions are also sent with optional fees. These fees are also collected by the miner of a block, along with the block reward. So there is a double incentive to mine new blocks.\n Mining blocks gets incrementally harder or easier over time, to make sure each new block is mined at an approximately constant rate over time. Keeping the block rate constant is important: too high a block time, and the network will be unusable. Too low a block time, and the network can easily be spammed with conflicting blocks.\n Each node and miner in the network agrees on all of these rules, and on the format of the blocks. This makes it extremely difficult to create fake blocks, or to send transactions which spend the same coins multiple times — even if you do have a vast amount of computing power.\n   First, I came up with some types for the public interface of the block chain.\n   Transactions, which require a sender, receiver, amount, and a user-defined fee. The fee will determine the priority for the transaction on the network.\n       BLOCK_TIME is the time we’re aiming for between each block being generated. Bitcoin aims for 10 minutes between each block; we’re going to go for 1 second, so we can quickly run this locally and try it out.\n INITIAL_REWARD is the reward of coins, for each block. This reward goes to whoever mined the block. This reward will halve over time, and will encourage more miners to try to mine blocks, process transactions, and keep the network secure and immune from double-spends or other attacks.\n REWARD_HALVING_SCHEDULE is the number of blocks before this reward halves. Bitcoin typically halves every four years. We’ll aim for every twenty blocks, equivalent to every 20 seconds.\n BLOCK_SIZE_LIMIT is the maximum number of transactions that can be included in any block. We’ll set this to 10, but the real limit in Bitcoin is much larger and is based around the MB size of the block.\n GENESIS_BLOCK defines the initial hard-coded block. All other blocks will have this genesis block as their ancestor. We’ll award this block to  SATOSHI for now, and we’ll define a default difficulty and the initial block reward.\n The meaning of each of these should hopefully become clearer as we use them in our code.\n  Next, let’s stub out the block chain. This will be our ‘database’ or system-of-record for all blocks and transactions.\n      You might think a block chain like Bitcoin is a linked-list, where each block is a node in the list.\n   There can be many competing branches of this tree. How do we know which branch to trust? Easy! We pick the longest branch, since that is the branch that took the most computational effort to create. The longer the branch, the more confidence we can have that no other branch can overtake it.\n So, we use a tree data structure in memory to represent our block chain, because that allows us to easily calculate the longest branch at any given time.\n We pass in  GENESIS_BLOCK as the root of this tree, since that will always be the first block. Hard-coding this makes things easier and offers no particular disadvantage.\n  Next, let’s write some code to mine a new block. This will be the most challenging exercise of the day.\n   The existing blockchain, represented here as  root. We need to call  getLongestBranchNode() here to find the current ‘true’ block chain, which we want to mine another block on top of.\n The  publicKey of the miner. This needs to be part of the block, so everyone else on the network knows who will get the reward for mining the block.\n A list of  transactions. There’s not much point in mining a block if we don’t have any transactions to publish to the network.\n Most of this is easy. We insert the miner public key, the id, the parent id, the time, the index, and the transactions into the new block.\n We’re going to re-validate the transactions here to make sure they’re correctly signed. Every other node will do the same before they accept the new block, and we want to maximize our chances of our block being accepted without giving anyone a good excuse to reject it.\n  We want to halve the reward every 20 blocks. So we calculate what the current reward will be, for the current block index, assuming the reward starts at 1024 and halves each 20 blocks. Some quick math here to achieve that, by checking if the current block index is divisible by 20, and if so, halving the reward. Otherwise we keep the same reward.\n  In reality, Bitcoin recalculates difficulty once every 2016 blocks, or approximately every 2 weeks. For simplicity, we’re going to recalculate the difficulty for every single new block so we can demo this in real time.\n This is an extremely naive way of calculating the difficulty, but it works for this example.\n If the block took too little time to generate, we increase the difficulty by 1.\n This means that we’re constantly re-calibrating how difficult is is to create the next block, based on how long it took us to create the previous block. This keeps blocks being created at an approximately-constant rate, on average, no matter how many miners there are trying to mine new blocks.\n The more miners you have, the higher the ‘hash rate’, which is a measure of how much computational power is currently being used across the world to mine new coins.\n   This means that  Hash-Rate / Difficulty should always be a constant number, which keeps the average time for each new block relatively constant.\n Once we’ve created a new block, we’re still not done . The block will only be accepted by the network if the difficulty is correct, based on the previous block.\n We check this difficulty in a pretty naive way here. We hash the block, turn that hash into a number, and if the number is evenly divisible by the difficulty, with no remainder, we allow it to pass.\n This means as the difficulty number gets higher, there is a smaller and smaller chance that the block will pass the difficulty check, and we will have to make more and more guesses to generate a new block. This takes more computational power, and more time.\n The opposite is also true. If the difficulty number gets lower, there is a higher chance that a new block will pass the difficulty check, and it will take fewer guesses to generate a new block. This takes less computational power, and less time.\n This simple version of a difficulty check works because it is more likely that a number is divisible by a low number like  2 than by a higher number like  17. So it is easier to generate a block whose hash happens to be divisible by  2, and harder to generate a block whose hash happens to be divisible by  17.\n  When a new block is propagated to the network, we need to be able to add it to our tree data structure.\n  First, we want to verify the block matches its hash, and all of the transactions within the block are correctly signed.\n Then, we want to verify the block passed all of the correct rules. For now, we’re just checking the difficulty matches. In reality, we would want to check every single field of the block and validate it completely. We can’t trust any other node on the network, so we want to validate every single thing.\n If a block is not valid, at this point it will be rejected by the node. Since the entire network follows the exact same set of decentralized rules, every node will accept the exact same valid blocks, and reject the exact same invalid blocks, without needing a central authority to tell them which blocks are valid.\n So not only do attackers need to spend a large amount of money for electricity to run the computations to create new blocks — they also would have an extremely hard time bending the rules that are set by every other node on the network for the integrity of a block.\n Finally, we just need to find the parent block specified by the new block, and add the new block as a child node to that parent. This extends the existing tree with the new block, so we can use it later to calculate everyone’s current balances.\n  The final thing we need to do is have some way to take all of the following:\n  And calculate the final balances for each wallet on the chain based on those values in each block.\n  We do this by finding the longest chain at any given time, and adding up all of the balances, fees, and block rewards. All of the data we need to do this is contained in each block.\n  You’ll notice transactions are a zero-sum-game. Each amount is subtracted from one account and added to another account. The same goes for each fee. So transactions can only use coins that are already present on the network, they can not create or destroy coins. (Of course, you can send coins to a dead address or lose your private key in a boating accident. This does not destroy coins though, it only makes them permanently inaccessible).\n Rewards, however, are not a zero-sum-game — we’re adding new coins to the network, without ever taking them away. This is actually the source of all new Bitcoins. This is also how Bitcoins eventually reach their fixed cap. Eventually, the block reward halves and halves and halves down to zero. At which point no new Bitcoins can ever be added or subtracted from the system, and we end up with a fixed cap of 21 million.\n This halving schedule gives Bitcoin its S2F value, which programs its price to rise like clockwork every four years.  Just kidding.\n  We’re now done with the data-structure / database side of things. We have a block chain, we’re able to create new blocks, add them to the tree, and calculate the final balance of each wallet based on the longest chain of blocks in the tree.\n  Bitcoin doesn’t just run on a single computer or server. We need a way to connect to a peer-to-peer network, share these blocks with others, and publish new transactions to the network. So we need a node!\n  Again, we need to define some types and stubs for our Node, so we have something to code against.\n      First, we’re going to instantiate the stuff we need to run the node:\n  We need a cryptographic key pair. We’ll use the public key to identify the node/wallet/miner, and the private key to sign any new transactions. Each miner, node, wallet, or any other actor uses this public key to identify themselves on the network. The private key helps them prove their identity.\n We need to connect to a peer-to-peer network of other nodes. We’ve used a fake  Network here for convenience, so we can broadcast and listen for events. In reality, Bitcoin will connect to a real peer-to-peer network of nodes across the internet, without any centralized servers required.\n Of course we need the block-chain itself, which we already implemented above. We’ll instantiate that block-chain here, so the node can use it to store new blocks and mine new blocks and get current wallet balances.\n We need a mempool. This is going to store incoming transactions, until they can be added to a block — since it will take some time to generate a block, we need somewhere to keep the transactions in the mean time.\n  We’ll need to be able to listen for transactions being sent from any other nodes on the network:\n  At this point we just push the transaction into the mempool. We could and probably should validate it at this point — but we’re already doing that before including the transactions into a block, so we’ll skip it for now.\n The mempool is a staging area for new transactions. They aren’t final or ‘real’ yet and nobody should rely on these mempool transactions to see if they got paid. To become final, the transactions will need to be included in a newly mined block.\n    To do this, we create a signed message using our private key. This contains the sender address, the receiver address, the amount we want to send, and the fee we want to attach to the transaction (to give it priority on the network).\n Only the person with the corresponding private key to the public key (public address) can sign a transaction like this. Without your private key, nobody can send transactions on your behalf. And of course the private key is never shared to anyone else on the network.\n Once we’ve created and signed this transaction, all that remains to do is to broadcast it to the network, so it can be picked up by any other node that is listening, and added to their mempool.\n  Blocks can be created by any other node on the network, and this is where most blocks will come from in the real world. So we need to be able to listen for new blocks from others, and add them to our blockchain.\n  We’ve already defined the logic to validate the block’s integrity in  addBlock, so we’re just going to invoke that method here. If the block gets rejected, no big deal, we’ll just continue on as usual.\n We also are going to blank out the current  mempool. In reality, we probably want to only filter out the transactions from the mempool that actually appeared in the new block, but we’re going to take a shortcut here for simplicity.\n    To avoid killing my browser, I’m running this in an asynchronous loop which runs every 500ms. In the loop, we pull out a limited number of transactions from the mempool (based on the block size limit we defined earlier), and we attempt to mine a new block which includes those transactions.\n In reality, we would normally search for the transactions with the highest fees, so we get the maximum reward for mining the block. Here, for simplicity, we’re just taking them in the order they are added to the mempool.\n If we’re successful in mining a new block, we publish that block to the network to be consumed by other nodes.\n If someone else mines a new block before we do, we start over, and try mining a new block on top of that block instead — since  createBlock will always try to mine on top of the longest chain of blocks at any given time.\n      When you run this project, my partner Jill has created an awesome UI to help you visualize what is going on, as nodes mine new blocks and send transactions back and forth:\n   I hope this was useful, to help you understand some of the principles used to power Bitcoin!\n Remember, this is a  vast simplification of the real Bitcoin node and mining software. It’s intended for learning purposes only, and nothing more.", "posttime": "2021-06-23 14:30:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,比特币,javascript,建立,bitcoin", "title": "通过在JavaScript中建立它来了解比特币 ", "title_en": "Learning about Bitcoin by building it in JavaScript", "transed": 1, "url": "https://bluepnume.medium.com/building-bitcoin-in-javascript-1a82534765ec", "via": "", "real_tags": ["java", "比特币", "建立", "bitcoin"]}, {"category": "", "categoryclass": "", "imagename": "b18a126190c1dc013fdeff9fc4dbd075.jpg", "infoid": 1067643, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GOPRO刚刚宣布了用于使用的第三方公司/应用程序的新开放式API，称为Open GoPro，允许它们与其相机集成，从Gopro Hero 9. API（应用程序编程接口）允许通过无线的功能转换接口，包括控制以及媒体传输。最值得注意的是，API在一些企业伙伴关系交易背后不是“门控”，相反，任何人都可以开始工作创建应用程序与它集成。\n 如果您对您熟悉的GoPro API听起来，它可能是。这是一个仅仅十分之近，Gopro宣布他们的Gopro开发人员计划。从理论上讲，它涵盖了与今天的程序相同的功能。但在实践中，它没有开放。所以我们看到一些公司，如极地，实际上在他们的产品中实施它（OK，少数产品）。一些无人机公司，包括3dr＆amp; airdog。但它需要Gopro建立一个与之带来的复杂性的合作关系。其他公司，如哇，不能进入该计划（他们试过，希望将其与Wahoo Bike Computers集成）。\n 虽然，这个新的开放计划解决了这一点，因为不再是该程序的网守。这只是任何可以使用的开放界面。\n 对于想要开发真正的酷炫的东西™，潜力是巨大的。例如，在阅读通过所有文件中，在体育领域中，人们可以发展：\n  -  Garmin Connect IQ应用程序为自行车电脑或监视Gopro  - 一个桌面应用程序，以自动无线连接到您的GoPro并将所有内容卸载到本地计算机或NAS设备 -  FPV无人机控制集成，而无需破解事物除了\n 事实上，在发布时，第三方公司有五种具体情景：\n  -  AmazFit手表将从手腕上进行GoPro摄像头控制。 -  Sena骑自行车的头盔将有您的Gopro  -  Centurion船的语音控制：无线控制船心控制屏幕的GoPro  -  ORQA：FPV护目镜控制（无人机），以便在Goggles中看到相机状态 -  Pixellot：他们做运动广播，这个控件所有GOPRO和处理内容转移 \n然而，至少在第一次迭代中存在一些局限性，意味着世界并不完全是你的牡蛎。没有支持捕获视频流实行，也没有任何API连接到Gopro的在线平台，以前称为Gopro Plus（访问您的存储媒体）。仍然，也许以后。\n 对于人群中的极客，按下。对于其他人来说，害怕没有，当我在路上找到一些酷的应用程序时，我会圈回来（开发人员有机会开发它们）。\n   显然，这将得到令人讨厌的......真的很怪异。但不是令人古怪。我将把它留给您潜入完整的代码示例和演示，以及实际的API文档。相反，我认为我会把亮点摆脱出来。尽管如此，与任何开发项目一样，它需要一些编码来真正开始了解潜在（和限制）。\n GoPro说，对于这种迭代，它们集中在这些关键相机区域，所有这些都在设备层。意思是，直接与相机说话（与Gopro app或gopro cloud交谈）：\n  - 无线连接 - 相机状态 - 摄像机命令和控制 - 预览 -  SD卡访问\n 目前，这是在英雄上启动的9，但我会猜测我们会看到它会看到它向后扩展到其他相机，就像他们用Gopro实验室（现在支持英雄7，英雄8，英雄9和最多）。开始小了。此外，他们甚至在他们的文档中有一个表，只列出了一个条目。没有任何表格来列出一个项目。\n  现在Gopro的媒体电子邮件指出了有线和无线连接，尽管所有文档都刚刚提到无线。所以我的猜测很快就会到来。对于无线侧，有两种方法可以与相机交互： \n但是，为了访问WiFi，您需要通过蓝牙智能启用它。这就是Gopro相机多年来如何工作，因为您的手机通常通过BLE初始化连接，打开WiFi（因此，节省电池）。回到“旧中学日”，预先放电，WiFi一直只是在一直（，然后，一些干扰问题的原因也有一些自行车计算机......）。像往常一样，一个GoPro在最后一个按钮按/将睡眠状态后8小时内保持其BLE服务8小时（意味着，即使您关闭电源，它仍然在8小时内发送BLE广告，这是您如何找到的当你失去它时）。\n 为了连接到BLE，您的应用程序（或类似手表）将与相机建立配对，以与携带GoPro应用程序的方式相同。它将保存此配对进行后续配对。\n 同时，对于WiFi侧，对相机的身份验证仅需要输入Gopro的独特WiFi SSID＆amp;密码，相对容易地连接到应用程序和/或设备。但是，根据我现在可以理解的所有内容在文档中，限制是您不能将GoPro直接连接到您自己的家庭网络并以这种方式利用API。这对于将镜头直接卸载到网络上非常有用（类似于Gopro的云解决方案，而是对他们所做的。随着它的实施方式今天（假设我已经正确了解了一切），App直接连接到GoPro，然后通过GoPro运行的小型HTTP服务器通过直接WiFi连接来拉动数据。\n   但是，在这些中，您可以访问大量的设置或文件操作。例如，目前有一个113个不同的状态代码表可以查询以查找相机的状态。这是那些小片段：\n  状态代码6的适当的Snarky答案始终为“1”。我孩子，我孩子......大多是。\n 现在，简而言之，GoPro暴露的所有评论都基本上允许您假装在设备本身上的用户。这意味着您可以更改设置，启动/停止录制，更改分辨率，查看文件属性（如视频或照片），甚至下载这些视频。事实上，您甚至可以触发所谓的“涡轮增压”模式，以便更快地下载媒体。\n 该公司已在Github上发布了所有这些，包括Python和Bash的步行教程。然后在C / C ++，C＃，Python和Swift中演示。 \n然后他们潜水正在进行的每一步，并被划分为不同的章节。这是一章的小片段：\n  最后，为了好玩，值得注意的是，在文档中，有很多关于Gopro Hero 10可能看起来像特征（假定〜9月）的巧妙措辞的含义。例如，在“章节”部分中，有这个看似无害的Tidbit：\n  除了那个关于在你知道下一个版本的事情上写作的技术文档的一份提供了大量技术文件吗？（但是当您稍后忘记此文档时，希望此文档仍然有效），您会说这样的东西。否则，您只需说“所有Gopro相机限制文件大小......”，这是真的，直到今天。\n 当然，即使是有点不真实，因为其中一个GoPro实验室选项是调整这个设置并做出更大的文件大小，可在许多过去的摄像机上获得。在任何情况下，我的怀疑是英雄10最终会消除需要4GB的文件分部，这坦率地只是2021年的稳健烦恼。\n 哦，记住你需要确保你的英雄9是最新的固件，今天刚刚出来，以支持这一点。\n     这太棒了。简单的说。当然，我很乐意在更多的相机上看到它（希望很快，因为文件似乎意味着暗示），但是，这一点都是公司向前迈出了巨大的一步。虽然去年Gopro Labs非常适合电力用户（以及其中一些功能长达正常的功能，而新的实验室也在2021年），这一API实际上非常适合正常的消费者 - 即使他们还没有意识到。随着GoPro今天推出，与Amazfit这样的公司进行观看控制，甚至是一艘船公司（百分比船）直接从船的掌舵直接控制Gopro控制，这些是人们实际使用的真实解决方案。\n  a）Garmin连接IQ应用程序来控制GoPro（或更好，本机集成）：当然，本机集成是很好的，因为它看起来是Garmin，他们的virb foray完成。但连接IQ根本不需要任何Garmin干预，任何随​​机开发人员都可以这样做。如果你这样做，请打我，我会写它，Pronto！这将是在英雄9上的较新的Gopro后古特色内杀手，因为它正在做一个滚动的30秒缓冲区，所以我可以在我的自行车电脑上点击一些刚刚发生的疯狂事件。 \nb）将文件卸载到NAS：在他们的新闻套件中，他们提到Pixellot正在使用它来将内容卸载到他们的运动广播平台中。我基本上想要那个，而是在我的办公室。我希望能够用一堆GoPro进入DCR洞穴，插入它们，并通过WiFi将内容卸载到我的NAS服务器。或者在最糟糕的是计算机上的目录。我不想用手机来做这件事。 MAC或PC驱动应用程序是它的生活（嗯，理想情况下，如果没有任何应用程序，它会自动执行此操作，但这在这里不合理）。\n 我相信其他人将有其他想法。但是那些对我来说是大的，特别是文件卸载位。即使是现在，从奔跑回来，我坐在这里希望来自该运行的视频已经可以通过我的Mac＆amp访问。 PC，而不是与GoPro应用程序处理欺诈性应用程序，使它们同步到我的手机（占用空间，其中GoPro应用程序目前在手机上占用80GB），然后将内容复制到手机的照片中，并拥有我的手机在这一切都是全面的。\n 当然，我可能只可以自己写这个应用程序。或者，我可以吃冰淇淋。两者都是有效的选择。\n  在一天结束时，我就像你在新的购买上寻找最多的细节一样的运动员。这些帖子一般需要花费大量时间来放在一起，所以如果你＆＃39;重新购买Gopro Hero 9黑色或任何其他附件项目，请考虑使用下面的联盟链接！作为亚马逊助理，我从合格购买中获得。它不会花费你的任何东西，但你的购买可以帮助支持这个网站。甚至更多，如果您使用Backcountry.com或竞争激进的人使用优惠码DcrainMaker，请首次用户在适用的产品上节省15％！\n    当然 - 您可以随时注册成为DCR支持者！这使您可以获得一个免费的DCR，访问与场景后面的DCR隔离拐角视频系列包装，它也让您令人敬畏。很棒，这是完全相同的！ ", "note_en": "GoPro has just announced a new open API for 3rd party companies/apps to use, called  Open GoPro, allowing them to integrate with their cameras, starting with the GoPro Hero 9. The API (Application Programming Interface) allows a slew of functions over wireless interfaces, including control as well as transfer of media. Most notably, the API is not ‘gated’ behind some corporate partnership deal, instead, anyone can get to work creating apps to integrate with it.\n If a GoPro API sounds familiar to you, it might be. It was a mere half a decade ago that GoPro announced their GoPro Developer Program. In theory, it covered many of the same features as today’s program. But in practice, it wasn’t open. So we saw some companies,  like Polar, actually implement it in their products (ok, a handful of products). So did some drone companies,  including 3DR &amp;  AirDog. But it required GoPro to set up a partnership there with all the complexities that brought with it. Other companies, such as Wahoo though, couldn’t get into the program (they tried, hoping to integrate it with the Wahoo bike computers).\n Whereas, this new open program resolves that, as there’s no longer a gatekeeper to the program. It’s just an open interface anyone can use.\n And the potential is massive for people wanting to develop Really Cool Stuff™. For example, in reading through all the documents, in the sports realm, one could develop:\n – A Garmin Connect IQ App for your bike computer or watch to control the GoPro – A desktop app to automatically connect wirelessly to your GoPro and offload all the content to a local computer or NAS device – FPV drone control integration, without having to hack things apart\n And in fact, at launch, there are five specific scenarios that are being lit-up by 3rd party companies:\n – Amazfit watches will have GoPro camera control from the wrist. – Sena cycling helmets will have voice control of your GoPro – Centurion Boats: wirelessly control a GoPro from the boat’s helm control screen – Orqa: FPV goggle control (drones) to see camera status in goggles – Pixellot: They do sports broadcasting, this controls all the GoPro’s and handles content transfer\n However, there are some limitations that, at least in this first iteration, mean the world isn’t entirely your oyster. There’s no support for capturing the video stream live, nor is there any API connectivity into GoPro’s online platform, formerly known as GoPro Plus (to access your stored media there). Still, maybe later.\n For the geeks in the crowd, press on. For everyone else, fear not, I’ll circle back when I find some cool apps down the road worth mentioning (after developers have a chance to develop them).\n   Obviously, this is gonna get geeky…really geeky. But not as geeky as it could be. I’ll leave it to you to dive into the full code examples and demos, as well as actual API documentation. Instead, I figured I’d get the highlights out of the way. Invariably though, like any development project, it takes a bit of coding to really start to understand the potential (and limitations).\n GoPro says that for this iteration, they’re focused on these key camera areas, all at the device layer. Meaning, talking directly to the camera (versus talking to the GoPro app or GoPro cloud):\n – Wireless connectivity – Camera status – Camera command and control – Preview – SD card access\n At present, this is launching on the Hero 9, but I’m gonna take a guess we’ll see it expand backwards to other cameras, just like they did with GoPro Labs (now supported on the Hero 7, Hero 8, Hero 9, and Max). It makes sense to start small. Plus, they even have a table in their documentation that lists just a single entry. No point in having a table for listing one item.\n  Now GoPro’s media e-mail states both wired and wireless connectivity, though all the documentation just mentioned wireless. So my guess is wired is coming soon too. For the wireless side, there’s two ways to interact with the camera:\n  However, in order to get access to WiFi, you’ll need to enable it via Bluetooth Smart. This is how GoPro cameras have worked for years, in that your phone typically initializes the connection via BLE, turning on the WiFi (thus, saving battery). Back in the ‘old school days’, pre-BLE, WiFi was just on all the time (and, then, the cause of some interference issues with certain bike computers too…). As usual, a GoPro keeps its BLE service running in the background for 8 hours after the last button press/going to sleep (meaning, even after you power it off, it’s still sending BLE advertisements for 8 hours, which is  how you can find it when you lose it).\n In order to connect to BLE, your app (or device, like watch) will establish a pairing with the camera, in the same way you pair the GoPro app. It’ll save this pairing for subsequent pairings.\n Meanwhile, for the WiFi side, authentication to the camera merely requires inputting the GoPro’s unique WiFi SSID &amp; password, making it relatively easy to connect to for apps and/or devices. However, based on everything I can understand right now in the documentation, the limitation is that you can’t have the GoPro connect directly to your own home network and leverage the API that way. That would have been very useful for offloading footage directly onto your network (akin to what it does for GoPro’s cloud solution, but to them). With the way it’s implemented today (assuming I’ve understood everything correctly), an app connects directly to the GoPro, and then pulls data via that direct WiFi connection over a small HTTP server that the GoPro runs.\n   However, within those, you can access tons of settings or file operations. For example, there’s a table of some 113 different status codes at present that you can query to find the state of the camera. Here’s a small snippet of those:\n  The proper snarky answer to status code 6 is always ‘1’. I kid, I kid…mostly.\n Now, in a nutshell, all the comments that GoPro has exposed essentially allow you to pretend to be a user on the device itself. That means you can change settings, start/stop recording, change resolutions, look at file properties (like videos or photos), and even download those videos. In fact, you can even trigger so-called ‘Turbo’ mode for faster WiFi downloads of media.\n The company has  published all of this over on GitHub, including walk-through tutorials in Python and Bash. And then demos in C/C++, C#, Python, and Swift.\n    And then they dive through each step of what’s going on, and are chunked into different chapters. Here’s  a tiny snippet of one chapter:\n  Lastly, for fun, it’s worth noting that in the documentation there’s plenty of cleverly worded implications about what a GoPro Hero 10 might look like feature-wise (assumed for ~September). For example, in the ‘Chapters’ section, there’s this seemingly innocuous tidbit:\n  Except, as one that has written plenty of technical documentation on how things work when you know the next version will change it (but want this document to still be valid when you forget about it later), you say stuff like this. Otherwise, you’d simply say “All GoPro Cameras limit file sizes…”, which is true, till today anyway.\n Of course, even that’s a bit untrue, as one of the GoPro Labs options is to tweak this setting and do  far larger file sizes, which is available on a number of past cameras. In any case, my suspicion here is that the Hero 10 will finally do away with requiring 4GB file chunking, which is frankly just a solid annoyance in 2021.\n Oh, and remember you’ll  need to ensure your Hero 9 is on the latest firmware, which just came out today, in order to support this.\n     This is awesome. Simply put. Sure, I’d love to see it on more cameras (hopefully soon, as the documents seem to imply), but having this at all is a huge step forward for the company. While GoPro labs was  great for power users last year (and some of those features grew up to normal features, and  new Labs features in 2021 too), this API is actually great for normal consumers too – even if they don’t realize it yet. With GoPro launching today with companies like Amazfit doing watch control, and even a boat company (Centurion Boats) enabling GoPro control directly from the boat’s helm, these are real-world solutions that people will actually use.\n  A) Garmin Connect IQ app to control a GoPro (or, even better, native integration): Sure, native integration is great since it appears Garmin is done with their VIRB foray. But Connect IQ wouldn’t require any Garmin intervention at all, any random developer could do this. Hit me up if you do, and I’ll write about it, pronto! This would be killer within the  newer GoPro Hindsight feature on the Hero 9, since it’s doing a rolling 30-second buffer, so that I could tap something on my bike computer to grab whatever crazy event just happened.\n B) File offloading to a NAS: Within their press kit, they mention that Pixellot is using this for offloading of content into their sports broadcasting platform. I want basically that, but at my office. I want to be able to walk into the DCR Cave with a pile of GoPro’s, plug them in, and have the content offload quickly via WiFi to my NAS server. Or at worst, a directory on a computer. I don’t want to use my phone to do this. A Mac or PC driven app is where this would live (well, ideally it’d automatically do this without any app driving it, but that’s not plausible here).\n I’m sure other folks will have other ideas. But those are the big ones for me, especially the file offloading bit. Even right now, coming back from a run, I’m sitting here wishing the videos from that run were already accessible to my Mac &amp; PC, rather than dealing with fiddling with the GoPro app to get them synced over to my phone (taking up space, where the GoPro app currently occupies 80GB of storage on my phone), then duplicating that content into the phone’s Photos, and having my phone be preoccupied while it’s doing all that.\n Of course, I probably could just write this app myself. Or, I could eat ice cream. Both are valid choices.\n  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase. These posts generally take a lot of time to put together, so if you&#39;re shopping for the GoPro Hero 9 Black or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use  Backcountry.com or  Competitive Cyclist with coupon code  DCRAINMAKER, first time users save 15% on applicable products!\n    And of course – you can always  sign-up to be a DCR Supporter! That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!", "posttime": "2021-06-23 14:29:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gopro", "title": "GoPro宣布为第三方应用/设备的新“Open Gopro”API ", "title_en": "GoPro Announces New ‘Open GoPro’ API for 3rd Party Apps/Devices", "transed": 1, "url": "https://www.dcrainmaker.com/2021/06/gopro-announces-new-open-gopro-api-for-3rd-party-apps-devices.html", "via": "", "real_tags": ["gopro"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067642, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前有以下四个软盘：从基本切换到APL，按＆＃34; apl＆＃34; 切换，然后按＆＃34;重启＆＃34; 转变。 回到基本与＆＃34;基本和＃34; 首先开关。 更多阅读IBM＆＃39;在Bitsavers.org的伟大手册。 还有一些错误，仍然很多缺少功能：＆＃34;持有＆＃34; 键不能正常工作。 IBM 5110的磁带和磁盘驱动器尚未仿真。 尚未实现显示已注册的交换机。 某些键可能无法映射起心电（我只有德国键盘来测试它）。 等等。 ", "note_en": "There are currently the following four floppy disks:\t\t   To switch from BASIC to APL, press the &#34;APL&#34; switch, and then press the &#34;RESTART&#34; switch. Going back to Basic is the same with the &#34;BASIC&#34; switch first.\t\t For much more read IBM&#39;s great manuals at  bitsavers.org. \t\t There are also some bugs and still many missing features: The &#34;HOLD&#34; key does not work properly in BASIC mode. The tape and disk drives of the\t\tIBM 5110 are not yet emulated. The switch to display the registered is not yet implemented. Some keys might not be mapped corectly (I have only a\t\tGerman keyboard to test it). Etc.", "posttime": "2021-06-23 13:46:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,emulator,基本", "title": "javascript中的IBM 5110仿真器 ", "title_en": "IBM 5110 Emulator in JavaScript", "transed": 1, "url": "https://norbertkehrer.github.io/ibm_5110/emu5110.html", "via": "", "real_tags": ["java", "emulator", "基本"]}]