[{"category": "", "categoryclass": "", "imagename": "4a17be94f6c3fa429b484b9567f7c7f0.jpg", "infoid": 1032089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经推出了早起定价，125美元可以购买所有直播会议，外加视频点播。别拖拉了。在11月13日晚上11点59分，早起的鸟儿重返地球大气层(价格会上涨)之前，现在就购买通行证。(PT)。\n更多的省钱方法：带上早起的鸟儿团体票(100美元)-带上四名队员，免费获得第五名队员。我们还为学生(50美元)以及政府、军队和非营利性组织(95美元)提供折扣通行证。在寻找超凡脱俗的曝光率吗？早期创业参展商套餐(360美元)包括四张门票、数字展览空间、向与会者进行推介的环节，以及产生线索的能力。奖金节省：额外的Crunch订户可以获得20%的折扣。\nTC会议：太空是一个无与伦比的机会，可以向来自NASA、航空航天公司、美国空军和公共、私营和国防部门的领先太空公司的边界推进型创始人、投资者和官员学习、联系和建立网络。\n我们为会议安排了精彩的演讲、炉边聊天和采访。此外，你还可以找到专门主题的分组会议、观众问答和主要演讲者，以及合作伙伴和初创企业的展览区。\n下面是主题的体验，但请关注议程，因为我们将在接下来的几周增加更多的演讲者和会议。\n洛克希德·马丁太空公司(Lockheed Martin Space)负责商业民用空间的副总裁/总经理丽莎·卡拉汉(Lisa Callahan)讨论了太阳系科学和民用探索的方方面面-从从银河系运行的小行星表面铲火箭的机器人，到为人类重返月球表面做准备的机器人。\n汤普森中将负责培育非传统太空初创企业的生态系统和太空部队收购的未来，所有这些都是为了保护全球太空公地的最终目标。他将讨论美国在创业伙伴关系和新兴技术领域寻找什么，以及如何与这些年轻公司合作。\n企业风险投资基金是太空初创企业的关键投资来源，部分原因是它们往往涉及有助于创造收入的合作伙伴关系，也因为它们了解涉及的时间表。SpaceFund的Meagan Crawford和洛克希德·马丁风险投资公司的J.Christopher Moran讨论了这些基金如何与更标准的风险投资相适应，为生态系统提供动力。\nTC Sessions：太空2020将于12月16日至17日起飞，但我们现在开始了早起的鸟儿倒计时。两周后，11月13日晚上11：59，大笔储蓄将消失。(PT)。今天买一张早起的鸟儿通行证，用一大杯唐酒庆祝你精明的购物。\n贵公司是否有兴趣赞助TC Sessions：Space 2020？请单击此处与我们讨论可用的机会。", "note_en": "We’ve launched early-bird pricing, and $125 buys you access to all live sessions, plus video on demand. Don’t procrastinate.  Buy your pass now before the early-bird reenters Earth’s atmosphere (and prices go up) on November 13 at 11:59 p.m. (PT).\n More ways to save: Go further together with  early bird group tickets ($100) — bring four team members and get the fifth one free. We also offer  discount passes for students ($50) and  government, military and non-profits ($95). Looking for out-of-this-world exposure? An  Early Stage Startup Exhibitor Package ($360) includes four tickets, digital exhibition space, a pitch session to attendees and the ability to generate leads.  Bonus savings: Extra Crunch subscribers get a 20 percent discount.\n  TC Sessions: Space is an unrivaled opportunity to learn from, connect and network with boundary-pushing founders, investors and officials from NASA, the Aerospace Corporation, the U.S. Air Force and leading space companies spanning public, private and defense sectors.\n We’ve packed the conference with outstanding presentations, fireside chats and interviews. Plus, you’ll find breakout sessions on specialized topics, audience Q&amp;As with Main Stage speakers and the expo area for partners and early stage startups.\n Here’s a taste of the topics but  keep an eye on the agenda, because we’ll add more speakers and sessions in the coming weeks.\n  Lisa Callahan, vice president/general manager of commercial civil space at Lockheed Martin Space, discusses all aspects of scientific and civil exploration of the solar system — from robots scooping rockets from the surface of galaxy-traveling asteroids, to preparing for the return of humans to the surface of the Moon.\n  Lt. General Thompson is responsible for fostering an ecosystem of non-traditional space startups and the future of Space Force acquisitions, all to the end goal of protecting the global commons of space. He’ll discuss what the U.S. looks for in startup partnerships and emerging tech, and how it works with these young companies.\n  Corporate VC funds are a key source of investment for space startups, in part because they often involve partnerships that help generate revenue, and because they understand the timelines involved.  SpaceFund’s Meagan Crawford and  Lockheed Martin Ventures’ J. Christopher Moran discuss how these funds fit in with more standard venture to power the ecosystem.\n TC Sessions: Space 2020 takes flight on December 16-17, but we’re starting our early bird countdown right now. Great savings disappear in two weeks on November 13 at 11:59 p.m. (PT).  Buy your early bird passes today and celebrate your savvy shopping with a tall glass of Tang.\n Is your company interested in sponsoring TC Sessions: Space 2020?  Click here  to talk with us about available opportunities.", "posttime": "2020-10-30 02:16:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,tc,left,太空", "title": "\n还剩两周时间在TC Sessions：Space 2020获得早起的鸟类节省", "title_en": "\n\t\t\t\tTwo weeks left to score early bird savings at TC Sessions: Space 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/two-weeks-left-to-score-early-bird-savings-at-tc-sessions-space-2020/", "via": "", "real_tags": ["2020", "tc", "left", "太空"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您将很快连接到www.thelocal.se...", "note_en": "You will be connected to  www.thelocal.se in just a moment...", "posttime": "2020-10-30 02:15:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,推出,launches,连接", "title": "亚马逊在瑞典推出--但存在令人尴尬的翻译问题", "title_en": "Amazon Launches In Sweden -- But With Embarrassing Translation Issues", "transed": 1, "url": "https://www.thelocal.se/20201028/translation-fails-on-amazons-new-swedish-site", "via": "", "real_tags": ["amazon", "亚马逊", "推出", "launches", "连接"]}, {"category": "", "categoryclass": "", "imagename": "7b3f9021ea7798c4df33855ddbc4f79f.jpg", "infoid": 1032085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2005年，Herb Sutter发表了他的开创性文章“免费午餐结束了”(Sutter，2005)。他概述说，微处理器的顺序性能将很快停滞不前，业界将通过增加内核数量来提供更高性能的处理器作为回应。这种范式转换的结果是从编写软件的纯顺序编程模型转向具有多个执行线程的并发编程模型。当应用程序固有地表现出并行性时，当线程在不同的核心上执行时，在多个线程之间分配工作可以产生性能提升。\n多线程并发有两个主要缺点-(1)同步开销，例如锁的串行化性质，以及(2)编程、调试和验证的困难。在描述不同的同步策略(例如，粗粒度锁定、细粒度锁定和无锁算法)时，这两个属性之间通常存在负相关。\n硬件事务存储器(HTM)允许两个或更多线程安全地执行临界区。事务-并行，不使用诸如互斥锁之类的序列化原语。事务以原子性、一致性和隔离性的属性推测性地执行(Harris等人，2007年)，微体系结构负责检测竞争条件并从竞争条件中恢复。例如，如果一个线程写入另一个线程已读取的内存位置。这可以通过更简单的编程模型提供更高的并行性。\n事务内存扩展(TME)计划是ARM的A-Profile未来架构技术计划的一部分，该计划提供有关该架构的未发布版本的高级信息。TME是一种尽力而为的HTM架构，它不保证事务的完成。程序员必须提供后备路径来保证进度，例如互斥保护的临界区。它提供了强隔离，这意味着事务与其他事务和并发非事务性内存访问都是隔离的。它使用事务的扁平嵌套，其中嵌套的事务包含在外部事务中。在外部事务提交之前，嵌套事务的影响不会对其他观察者可见。当嵌套事务中止时，它会导致外部事务(及其内部的所有嵌套事务)中止。\nTSTART&lt；xd&gt；8-此指令开始新事务。如果事务成功启动，则目标寄存器设置为零，处理器进入事务状态。如果事务失败或被取消，则以事务方式执行的所有状态修改都将被丢弃。然后，向目标寄存器写入编码故障原因的非零值。\nTCOMMIT-此指令提交当前事务。如果当前事务是外部事务，则退出事务状态，并且将以事务方式执行的所有状态修改提交给架构状态。\nTCANCEL#&lt；imm&&gt;-此指令退出事务状态，并丢弃所有以事务方式执行的状态修改。在外部事务的TSTART指令之后的指令处继续执行。外部事务的TSTART指令的目标寄存器用TCANCEL的立即操作数写入。\nTtest&lt；xd&gt；t-此指令将事务深度写入目标寄存器，否则值为0。\n图2：说明了四条TME指令的语义。(1)显示了创建和提交事务的两个线程。线程T1与线程T2冲突，因此T2中止其事务并回滚到TSTART指令。T2&#39；的TCOMMIT账户从未联系到。(2)线程T1创建一个事务，但使用TCANCEL手动中止它。它将中止并回滚到TSTART。T1的TCOMMIT请求从未到达。(3)线程T1创建并提交测试事务深度的嵌套事务。当在外部事务中执行Ttest时，它返回1，而如果在内部事务中执行，它将返回2。\nGem5是一个开源的系统和处理器模拟器，广泛用于学术界和工业界的计算机体系结构研究。Gem5提供两种可供选择的存储系统-经典存储系统和Ruby存储系统。The Classic Memory System是从Gem5的前身M5继承而来，并实施了MOESI一致性协议(Sorin，Hill，&amp；Wood，2011)。相比之下，Ruby Memory System提供了一种灵活的方式来定义和仿真自定义缓存一致性协议，包括一系列互连和拓扑。协议是使用特定于域的语言SLICC(包括高速缓存一致性的规范语言)通过状态、转换、事件和动作指定的。默认情况下，Gem5包括各种可用的Ruby缓存一致性协议，但是，目前这些协议都不支持HTM。\nHTM可以以多种方式实现，具有不同的权衡。为了使ARM的TME成为原型，我们选择了一种在微体系结构中实现ISA扩展的特殊方式。简而言之，它使用惰性版本管理和具有高速缓存线粒度的紧急冲突检测(Bobba等人，2007)。其他实现也是可能的，并且针对Gem5设计的选择不一定反映任何硅实现-现有的或未来的。\n图3：橙色突出显示的框是微体系结构中已添加或修改以适应TME支持的组件。\n有几种技术可用于寄存器检查点，包括影子寄存器堆和冻结物理寄存器。在ge5中，我们选择了一种没有开销的功能正确的检查点机制，即整个寄存器文件的零周期瞬时备份。这允许我们在核心模型之间共享公共检查点机制。\n为了将HTM支持与特定于TME的功能分开，将用于创建和恢复检查点的通用接口添加到src/arch/目录。ISA可以根据其特定需求实现此接口，从而允许许多HTM功能被共享和重用。TME实现还必须能够回滚体系结构状态，并在事务失败或取消时丢弃推测性更新。这是通过重新调整ge5的异常机制来实现的。\n为了跟踪事务的读/写集并缓冲推测性内存更新，我们利用高速缓存一致性协议。Gem5包含Ruby协议MESI_THERE_LEVEL。MESI指的是缓存线可能处于的状态：已修改、独占、共享或无效状态(Sorin，Hill，&amp；Wood，2011)。该协议利用由更大的统一包含式专用L2高速缓存馈送的专用L1数据和指令高速缓存。L2缓存由更大的包含式共享L3缓存和Coherence目录提供支持。\n对MESI_Three_Level协议进行了增强，以支持TME。L1数据高速缓存用于缓冲与系统其余部分隔离的推测状态。因为L2缓存是包含的，所以它包含事务的读/写集中使用的相同行，但是保存它们的事务前的值。此配置的结果是事务的工作集必须仅驻留在L1数据缓存中。如果以事务方式读取或写入的行溢出，即从L1数据高速缓存逐出到L2高速缓存，则必须中止该事务，并且必须丢弃任何推测性写入的数据。\n为了跟踪事务读取和写入状态，向每个L1数据高速缓存线的标签添加两个额外的‘位’-如果它在事务的读取集中，则添加1位；如果它在写入集中，则添加另一个位。然后，在从一个高速缓存线状态转换到另一个高速缓存线状态时使用这些位。要提交事务，需要清除这两个位。要中止事务，如果该行同时被修改，并且在事务的写入集中，该行将转换为无效；与提交类似，这两个位也都会被清除。我们假设可以自动清除这些位，以便对于外部观察者，要么提交(变为非推测性)所有事务状态，要么丢弃并回滚。这满足原子性的事务内存属性。\n为了测试ge5中的新功能，我们概述了一个用C语言编写的简单程序，该程序使用TME事务并行更新直方图。此程序使用手动锁省略-锁用于保护共享数据结构，但在任何可能的情况下都会为了有利于事务而绕过(即避开)锁。如果事务不能取得进展，这可以满足后备路径的要求。\n我们首先定义一个非常简单的自旋锁，它使用AArch64的弱内存模型。\n#include&lt；stdatomic.h&gt；\r\rTyfinf atom_int lock_t；\r\r内联void lock_init(lock_t*lock){\rAtom_init(lock，0)；\r}\r\r内联空锁获取(lock_t*lock){\rWHILE(ATOM_EXCHAGE_EXPLICIT(LOCK，1，Memory_Order_Acquisition))\r；//旋转到收购为止\r}\r\r内联int lock_is_Acquired(lock_t*lock){\r返回ATOM_LOAD_EXPLICIT(LOCK，Memory_Order_Acquisition)；\r}\r\r内联void lock_release(lock_t*lock){\rATOM_STORE_EXPLICIT(LOCK，0，Memory_Order_Release)；\r}。\n接下来，我们编写一个函数来使用TME事务取消锁。如果成功解除锁定，LOCK_ACCENTER_ELIDED返回1，否则返回0。该函数启动一个新事务，并检查锁是否仍然空闲，从而将其添加到事务的读取集中。如果锁不是空闲的，事务将通过TCANCEL显式中止。在我们的示例中，作为参数传递的特定15位整数并不重要，但是，设置MSB可以确保事务可以重试。\n#include&lt；arm_acle.h&gt；\r\r#定义TME_MAX_RETRIES 3\r#定义TME_LOCK_IS_ACCENTED 65535\r\rInt lock_Acquisition_elided(lock_t*lock){\rInt num_retries=0；\rUint64_t状态；\r\r做{\rStatus=__tstart()；\r如果(状态==0){\r//检查是否获取了锁，并将其添加到我们的读集合中\rIF(LOCK_IS_ACCENTED(LOCK)){\r__t取消(Tme_Lock_Is_Acquired)；\r__builtin_unreacable()；\r}\r返回1；\r}\r++重试次数；\r}WHILE((STATUS&amp；_TMFAILURE_RTRY)&amp；&amp；(Num_Rtries&lt；TME_MAX_RETRIES))；\r\r//事务失败次数过多\r返回0；\r}\r\rVoid lock_release_elid(){\r__tCommit()；\r}。\n然后利用这些自旋锁和事务例程来创建更新堆上的全局共享数组结构的函数工作。此函数可以从多个线程并行调用。\n#include&lt；stdio.h&gt；\r#include&lt；stdlib.h&gt；\r\r#include&#34；lock.h&#34；\r\r#定义ARRAYSIZE 512\r#定义迭代次数10000\r\r波动率长整数直方图[ARRAYSIZE]；\rLock_t global_lock；\r\rVoid*work(void*void_ptr){\r//RNG种子使用线程id，\r//这将防止线程生成相同的数组索引。\rLong int idx=(Long Int)void_ptr；\rUNSIGNED INT SEED P=(UNSIGNED INT)IDX；\rINT I，RC；\r\rPrintf(&#34；来自线程%ld\\n&#34；，idx的问候)；\r\rFor(i=0；i&lt；迭代；i++)\r{\rInt number 1=rand_r(&amp；Seed)%ArraySIZE；\r\rRc=LOCK_ACCENTER_ELIDED(&amp；GLOBAL_LOCK)；\rIF(rc==0)//解锁失败\rLOCK_ACCENTER(&amp；GLOBAL_LOCK)；\r\r//启动临界区\rLong int temp=直方图[num1]；\r温度+=1；\r直方图[num1]=温度；\r//结束临界区\r\rIF(RC==1)\rLock_release_elid()；\r其他\rLOCK_RELEASE(&amp；GLOBAL_LOCK)；\r}\r\rPrintf(&#34；来自线程%ld\\n&#34；，idx的再见)；\r}\n最后，我们使用一个派生和联接工作线程的主函数将所有这些放在一起。\n#include&lt；assert.h&gt；\r#include&lt；pthread.h&gt；\r#include&lt；unistd.h&gt；\r\r\rint main(){\rLong int I，Total，number of Processors；\rPthread_t*个线程；\rINT RC；\r\rNumber OfProcessors=sysconf(_SC_NPROCESSORS_ONLN)；\r\rPrintf(&#34；TME具有%ld进程的平行直方图\\n&34；，number OfProcessors)；\r\rLock_init(&amp；global_lock)；\r\r//初始化数组\rFor(i=0；i&lt；ArraySIZE；I++)\r直方图[i]=0；\r\r//派生工作\r线程=(pthread_t*)malloc(sizeof(Pthread_T)*number OfProcessors)；\rFor(i=0；i&lt；number OfProcessors-1；i++){\rRc=pthread_create(&amp；threads[i]，null，work，(void*)i)；\rAssert(rc==0)；\r}\rWork((void*)(number OfProcessors-1))；\r\r//等待工作线程\rFor(i=0；i&lt；number OfProcessors-1；I++){\rRc=pthread_join(threads[i]，NULL)；\rAssert(rc==0)；\r}\r\r//校验数组内容\r总数=0；\rFOR(i=0；i&lt；数组；i++)\r总数+=直方图[i]；\r\r//免费资源\r释放(线程)；\r\rPrintf(&#34；合计为%lu\\n预期合计为%lu\\n&#34；，\r总计，迭代次数*number of fProcessors)；\r\r返回0；\r}。\n从版本10开始，GCC支持TME-这包括ALE内部功能。要编译带有TME指令的源文件，必须使用AArch64编译器，并通过进行码标志启用该功能，例如，-march=ARMv8-a+tme。\n具有两个处理器的TME并行直方图\r来自线程%1的问候\r来自线程0的问候\r来自线程1的再见\r来自线程0的再见\r总数是20000美元\r预计总数为20000\r正在退出@Tick 718668000，因为正在退出上次活动的线程上下文。\n为了验证是否有任何关键部分以事务方式执行，我们检查m5out/stats.txt，其中有几个与HTM相关的统计数据。\nHtm 35 22.01%22.01%#system.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause：：explicit事务中止的原因\rHtm 38 23.90%45.91%#system.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause：：transaction_size事务中止的原因\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause：：memory_conflict 86 54.09%100.00%#HTM事务中止的原因\rSystem.ruby.l0_cntrl0.equencer.htm。_TRANSACTION_ABORT_CAUSE：：TOTAL 159#HTM事务中止的原因\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：samples 9927#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：mean 63.466103#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：gmean 56.438036#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：stdev 29.。029108#外部事务花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：32-47 4854 48.90%48.90%#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：48-63 2 0.02%48.92%#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：64-79 195 1.96%50.88%#所用周期数。在外部交易中\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：80-95 462746.61%97.49%#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：96-111 1881.89%99.39%#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：112-127 60 0.60%99.99%#外部事务中花费的周期数\rSystem.ruby。.l0_cntrl0.sequencer.htm_transaction_cycles：：128-143 1 0.01%100.00%#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles：：total 9927#外部事务中花费的周期数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions：：samples 9927#外部事务中花费的指令数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions：：mean 12#外部事务中花费的指令数\r系统红宝石。L0_cntrl0.sequencer.htm_transaction_instructions：：gmean 12.000000#外部事务中花费的指令数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions：：12-13 9927 100.00%100.00%#外部事务中花费的指令数\rSystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions：：total 9927#外部事务中花费的指令数。\n这些是每个核心的统计信息，提供有关事务长度的信息(以周期数或指令数表示)，以及中止事务的原因。当使用TCANCEL时，EXPLICIT会递增-在我们的示例代码中，当观察到全局锁在事务已经启动之后被获取时，就会发生这种情况。当另一个处理元素试图修改事务的读或写集中的高速缓存线时，就会发生MEMORY_CONFLICATION。TRANSACTION_SIZE指示事务溢出出一级数据缓存；由于这很难准确跟踪，因此\n这些是采样直方图，其中包含以数量表示的事务大小。\n.", "note_en": "In 2005, Herb Sutter published his seminal article “The Free Lunch is Over” (Sutter, 2005). He outlined that the sequential performance of microprocessors would soon plateau, and the industry would respond by offering more performant processors by way of increased core counts. The consequence of this paradigm shift has been a move away from a purely sequential programming model for writing software to that of a concurrent one with multiple threads of execution. When applications inherently exhibit parallelism, dividing work between multiple threads can yield performance gains when the threads execute on different cores.\n Multithreading concurrency has two principal drawbacks—(1) the overheads of synchronization, for example, the serializing nature of locks, and (2) its difficulty to program, debug and verify. There is often an inverse correlation between these two properties when characterizing different synchronization strategies, for example, coarse-grained locking, fine-grained locking and lock-free algorithms.\n  Hardware Transactional Memory (HTM) allows two or more threads to safely execute critical sections—a.k.a. transactions—in parallel without using serializing primitives such as mutexes. Transactions are executed speculatively with the properties of atomicity, consistency and isolation (Harris, et al., 2007), and the microarchitecture is in charge of detecting and recovering from race conditions. For example, if one thread writes to a memory location that another thread has read. This can provide increased parallelism with a simpler programming model.\n  The  Transactional Memory Extension (TME) is part of Arm’s A-profile Future Architecture Technologies program, which provides advanced information on unreleased versions of the architecture. TME is a best effort HTM architecture which does not guarantee completion of transactions. The programmer must provide a fallback path to guarantee progress, such as a mutex-guarded critical section. It provides strong isolation, meaning transactions are isolated from both other transactions, and concurrent non-transactional memory accesses. It uses flattened nesting of transactions, in which nested transactions are subsumed by the outer transaction. The effects of a nested transaction do not become visible to other observers until the outer transaction commits. When a nested transaction aborts, it causes the outer transaction (and all its nested transactions within) to abort.\n  TSTART &lt;Xd&gt; - This instruction starts a new transaction. If the transaction started successfully, the destination register is set to zero and the processor enters  transactional state. If the transaction failed or was canceled, then all state modifications that were performed transactionally are discarded. The destination register is then written with a nonzero value that encodes the cause of the failure.\n TCOMMIT - This instruction commits the current transaction. If the current transaction is an outer transaction, then  transactional state is exited, and all state modifications performed transactionally are committed to the architectural state.\n TCANCEL #&lt;imm&gt; - This instruction exits  transactional state and discards all state modifications that were performed transactionally. Execution continues at the instruction that follows the TSTART instruction of the outer transaction. The destination register of the TSTART instruction of the outer transaction is written with the immediate operand of TCANCEL.\n TTEST &lt;Xd&gt; - This instruction writes the depth of the transaction to the destination register, or the value 0 otherwise.\n  Figure 2: Illustrates the semantics of the four TME instructions. (1) shows two threads creating and committing transactions. Thread T1 conflicts with thread T2, therefore T2 aborts its transaction and rolls back to the  TSTART instruction. T2&#39;s  TCOMMIT is never reached. (2) thread T1 creates a transaction but manually aborts it using  TCANCEL. It aborts and rolls back to  TSTART. T1’s  TCOMMIT is never reached. (3) thread T1 creates and commits a nested transaction in which the transactional depth is tested. When  TTEST is executed in the outer transaction it returns 1, whereas if it is executed in the inner transaction it returns 2.\n  gem5 is an open-source system and processor simulator widely used in academia and industry for computer architecture research. gem5 offers two alternative memory systems—classic and Ruby. The  Classic Memory System is inherited from gem5’s predecessor, M5, and implements a MOESI coherence protocol (Sorin, Hill, &amp; Wood, 2011). In contrast, the  Ruby Memory System offers a flexible way of defining and emulating custom cache coherence protocols, including a range of interconnects and topologies. Protocols are specified through states, transitions, events, and actions using the domain-specific language, SLICC (specification language including cache coherence). gem5 includes a variety of Ruby cache coherence protocols available for use by default, however, none of these protocols currently support HTM.\n HTM can be implemented in many ways with different trade-offs. To prototype Arm&#39;s TME, we have chosen one particular way of implementing the ISA extension in the microarchitecture. In short, it uses lazy version management and eager conflict detection with a cache line granularity (Bobba, et al., 2007). Other implementations are possible and the choices for the gem5 design do not necessarily reflect any silicon implementation – existing or future.\n    Figure  3:  The boxes highlighted in orange are components in the microarchitecture that have been added or modified to accommodate TME support.\n There are several techniques that can be used for register checkpointing, including shadow register files and freezing physical registers. In gem5, we opt for a functionally correct checkpointing mechanism with no overhead, that is, a zero-cycle instantaneous backup of the entire register file. This allows us to share a common checkpointing mechanism between core models.\n To separate the HTM support from TME-specific functionality, a generic interface for checkpoint creation and restoration is added to  src/arch/ directory. ISAs can implement this interface according to their particular needs, allowing much of the HTM functionality to be shared and reused. The TME implementation must also be able to roll back the architectural state and discard speculative updates on transactional failure or cancellation. This is achieved by repurposing gem5’s exception mechanism.\n To track a transaction’s read/write sets and buffer speculative memory updates, we leverage the cache coherence protocol. gem5 includes the Ruby protocol  MESI_Three_Level. MESI refers to the states that a cache line can be in: Modified, exclusive, shared or invalid (Sorin, Hill, &amp; Wood, 2011). The protocol utilizes private L1 data and instruction caches that are fed by a larger unified inclusive private L2 cache. The L2 caches are backed by a larger inclusive shared L3 cache and coherence directory.\n The  MESI_Three_Level protocol has been augmented to support TME. The L1 data cache is used to buffer speculative state isolated from the rest of the system. Because the L2 cache is inclusive, it contains the same lines used in a transaction’s read/write sets, but holds their pre-transactional values. The consequence of this configuration is that a transaction’s working set must reside solely in the L1 data cache. If a transactionally read or written line spills, that is, is evicted from the L1 data cache to the L2 cache, the transaction must abort, and any speculatively written data must be discarded.\n To track transactionally read and written states, two additional ‘bits’ are added to the tags of each L1 data cache line - 1 bit if it is in a transaction’s read set and the other bit if it is in the write set. These bits are then used when transitioning from one cache line state to another. To commit a transaction, both bits are cleared. To abort a transaction, the line is transitioned to  invalid if it is both  modified and in the transaction’s write set; similar to committing, both bits are also cleared. We assume these bits can be cleared atomically so that to external observers, either all the transactional state commits (becomes non-speculative), or is discarded and rolls back. This satisfies the transactional memory property of atomicity.\n  To test the new functionality in gem5, we outline a simple program written in C that uses TME transactions to update a histogram in parallel. This program uses manual lock elision—a lock is used to protect a shared data structure but is bypassed, that is, elided, whenever possible in favor of transactions. This satisfies the requirements of a fallback path if a transaction cannot make progress.\n We first define a very simple spinlock that works with  AArch64’s weak memory model.\n #include &lt;stdatomic.h&gt;\r\rtypedef atomic_int lock_t;\r\rinline void lock_init(lock_t *lock) {\r atomic_init(lock, 0);\r}\r\rinline void lock_acquire(lock_t *lock) {\r while (atomic_exchange_explicit(lock, 1, memory_order_acquire))\r ; // spin until acquired\r}\r\rinline int lock_is_acquired(lock_t *lock) {\r return atomic_load_explicit(lock, memory_order_acquire);\r}\r\rinline void lock_release(lock_t *lock) {\r atomic_store_explicit(lock, 0, memory_order_release);\r}\n Next, we write a function to elide the lock using a TME transaction.  lock_acquire_elided  returns 1 if the lock was successfully elided otherwise 0. The function starts a new transaction and checks that the lock is still free, therefore adding it to the transaction’s read set. If the lock is not free, the transaction is aborted explicitly via TCANCEL . The particular 15-bit integer passed as a parameter is unimportant in our example, however, setting the MSB ensures the transaction can be retried.\n #include &lt;arm_acle.h&gt;\r\r#define TME_MAX_RETRIES 3\r#define TME_LOCK_IS_ACQUIRED 65535\r\rint lock_acquire_elided(lock_t *lock) {\r int num_retries = 0;\r uint64_t status;\r\r do {\r status = __tstart();\r if (status == 0) {\r // check if lock is acquired and add it to our read-set\r if (lock_is_acquired(lock)) {\r __tcancel(TME_LOCK_IS_ACQUIRED);\r __builtin_unreachable();\r }\r return 1;\r }\r ++num_retries;\r } while ((status &amp; _TMFAILURE_RTRY) &amp;&amp; (num_retries &lt; TME_MAX_RETRIES));\r\r // the transaction failed too many times\r return 0;\r}\r\rvoid lock_release_elided() {\r __tcommit();\r}\n These spinlock and transaction routines are then leveraged to create the function  work  that updates a global shared array structure on the heap. This function can be called from multiple threads in parallel.\n #include &lt;stdio.h&gt;\r#include &lt;stdlib.h&gt;\r\r#include &#34;lock.h&#34;\r\r#define ARRAYSIZE 512\r#define ITERATIONS 10000\r\rvolatile long int histogram[ARRAYSIZE];\rlock_t global_lock;\r\rvoid* work(void* void_ptr) {\r // Use thread id for RNG seed,\r // this will prevent threads generating the same array indices.\r long int idx = (long int)void_ptr;\r unsigned int seedp = (unsigned int)idx;\r int i, rc;\r\r printf(&#34;Hello from thread %ld\\n&#34;, idx);\r\r for (i=0; i&lt;ITERATIONS; i++)\r {\r int num1 = rand_r(&amp;seedp)%ARRAYSIZE;\r\r rc = lock_acquire_elided(&amp;global_lock);\r if (rc == 0) // eliding the lock failed\r lock_acquire(&amp;global_lock);\r\r // start critical section\r long int temp = histogram[num1];\r temp += 1;\r histogram[num1] = temp;\r // end critical section\r\r if (rc == 1)\r lock_release_elided();\r else\r lock_release(&amp;global_lock);\r }\r\r printf(&#34;Goodbye from thread %ld\\n&#34;, idx);\r}\n Finally, we put this all together using a  main  function that spawns and joins worker threads.\n #include &lt;assert.h&gt;\r#include &lt;pthread.h&gt;\r#include &lt;unistd.h&gt;\r\r\rint main() {\r long int i, total, numberOfProcessors;\r pthread_t *threads;\r int rc;\r\r numberOfProcessors = sysconf(_SC_NPROCESSORS_ONLN);\r\r printf(&#34;TME parallel histogram with %ld procs\\n&#34;, numberOfProcessors);\r\r lock_init(&amp;global_lock);\r\r // initialise the array\r for (i=0; i&lt;ARRAYSIZE; i++)\r histogram[i] = 0;\r\r // spawn work\r threads = (pthread_t*) malloc(sizeof(pthread_t)*numberOfProcessors);\r for (i=0; i&lt;numberOfProcessors-1; i++) {\r rc = pthread_create(&amp;threads[i], NULL, work, (void*)i);\r assert(rc==0);\r }\r work((void*)(numberOfProcessors-1));\r\r // wait for worker threads\r for (i=0; i&lt;numberOfProcessors-1; i++) {\r rc = pthread_join(threads[i], NULL);\r assert(rc==0);\r }\r\r // verify array contents\r total = 0;\r for (i=0; i&lt;ARRAYSIZE; i++)\r total += histogram[i];\r\r // free resources\r free(threads);\r\r printf(&#34;Total is %lu\\nExpected total is %lu\\n&#34;,\r total, ITERATIONS*numberOfProcessors);\r\r return 0;\r}\n  TME is supported in GCC as of  version 10—this includes  ACLE intrinsics. To compile source files with TME instructions, an AArch64 compiler must be used with the feature enabled via the march flag, for example, - march=armv8-a+tme .\n       TME parallel histogram with 2 procs\rHello from thread 1\rHello from thread 0\rGoodbye from thread 1\rGoodbye from thread 0\rTotal is 20000\rExpected total is 20000\rExiting @ tick 718668000 because exiting with last active thread context\n To verify whether any critical sections executed transactionally, we check  m5out/stats.txt where several HTM-related statistics live.\n system.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause::explicit 35 22.01% 22.01% # cause of htm transaction abort\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause::transaction_size 38 23.90% 45.91% # cause of htm transaction abort\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause::memory_conflict 86 54.09% 100.00% # cause of htm transaction abort\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_abort_cause::total 159 # cause of htm transaction abort\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::samples 9927 # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::mean 63.466103 # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::gmean 56.438036 # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::stdev 29.029108 # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::32-47 4854 48.90% 48.90% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::48-63 2 0.02% 48.92% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::64-79 195 1.96% 50.88% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::80-95 4627 46.61% 97.49% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::96-111 188 1.89% 99.39% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::112-127 60 0.60% 99.99% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::128-143 1 0.01% 100.00% # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_cycles::total 9927 # number of cycles spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions::samples 9927 # number of instructions spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions::mean 12 # number of instructions spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions::gmean 12.000000 # number of instructions spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions::12-13 9927 100.00% 100.00% # number of instructions spent in an outer transaction\rsystem.ruby.l0_cntrl0.sequencer.htm_transaction_instructions::total 9927 # number of instructions spent in an outer transaction\n These are per-core statistics that provide information about the lengths of the transactions (in number of cycles or number of instructions), as well as the reason for aborting a transaction.  explicit is incremented when  TCANCEL  is used—in our example code, this happens when the global lock is observed to be taken after the transaction has already started.  memory_conflict occurs when another processing element attempts to modify a cache line in the transaction’s read or write sets.  transaction_size indicates that the transaction spilled out of the L1 data cache; since this is difficult to track accurately, the statistics instead capture transactional cache lines that are evicted from the L1 data cache due to a load/store originating in the same core. Due to factors such as the cache set replacement policy, this statistic often exhibits false positives.\n system.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::samples 159 # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::mean 0.729560 # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::stdev 0.591988 # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::0 55 34.59% 34.59% # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::1 92 57.86% 92.45% # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::2 12 7.55% 100.00% # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_read_set::total 159 # read set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_write_set::samples 159 # write set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_write_set::mean 0.169811 # write set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_write_set::stdev 0.376653 # write set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_write_set::0 132 83.02% 83.02% # write set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_write_set::1 27 16.98% 100.00% # write set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_aborted_write_set::total 159 # write set size of a aborted transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::samples 9927 # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::mean 1.987710 # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::gmean 1.983035 # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::stdev 0.110181 # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::1 122 1.23% 1.23% # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::2 9805 98.77% 100.00% # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_read_set::total 9927 # read set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_write_set::samples 9927 # write set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_write_set::mean 1 # write set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_write_set::gmean 1 # write set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_write_set::1 9927 100.00% 100.00% # write set size of a committed transaction\rsystem.ruby.l0_cntrl0.Dcache.htm_transaction_committed_write_set::total 9927 # write set size of a committed transaction\n These are sampled histograms containing the sizes of transactions in terms of number of \n......", "posttime": "2020-10-30 02:00:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,事务性,transactional,事务", "title": "Gem5中的ARM事务性内存扩展支持", "title_en": "Arm’s Transactional Memory Extension support in gem5", "transed": 1, "url": "https://community.arm.com/developer/research/b/articles/posts/arms-transactional-memory-extension-support-", "via": "", "real_tags": ["内存", "事务性", "事务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "写道：维基百科关于宏的页面实际上根本没有关于它的历史。我添加了一些内容，包括&gt；对科尔贝克和克林格的引用。=C2=A0如果有人想让它变得更好(或纠正我对FEXPR的可怕猜测)，请看一看：&gt；&gt；http://en.wikipedia.org/wiki/Macro_%28computer_science%29#Lisp_.2F_S-expression_macros``The最早的Lisp宏采用FEXPR的形式，这是一种类似函数的运算符，其输入不是参数计算的值，而是参数的语法形式，其输出是语法片段，将用来代替FEXPR的使用。&#39；&#39；FEXPR的参数绝对是语法形式，而不是`read&#39；；返回的源代码的文字列表结构。FEXPR的‘output’用作调用FEXPR的表达式的返回值。差别很细微，但很关键。这取决于LISP I的实现细节。LISP I不是简单的语言定义的实现。它是一种“元循环”语言定义的实现。在具有元循环成分的语言中，我们可以将函数划分为两类：“正常”函数和“水平交叉”函数。在LISP I实现中，名称可以绑定到EXPR或SUBR，这只是一个一级过程(区别很简单，EXPR是通过递归计算实现的过程，而SUBR是通过在底层平台(IBM704汇编)中直接执行实现的过程)。SUBR可以是原始代码，也可以是编译后的代码块。)。但也有类似的跨级版本，称为FEXPR和FSUBR。FEXPR是通过递归求值实现的跨层过程，FSUBR是通过直接执行实现的跨层过程，但是FEXPR和FSUBR不是通过物化和反射在程序上工作的元句法运算符，而是依赖于EVAL的元循环定义的元实现运算符(即，FEXPR或FSUBR运行在元EVAL的语义层，而不是EVAL)。McCarthy等人并没有忽视这一区别。FEXPR是围绕这样一个事实“设计”的，即该语言有一个通过递归下降列表结构实现的元循环定义。大多数(如果不是全部)鼓动重新考虑FEXPR的人都不理解这一区别。宏是在语法级别执行重写的程序，它是从它所操作的程序的具体表示中抽象出来的。另一方面，FEXPR是一个故意“不”从具体表示中抽象出来的程序。在后来Lisp中，FEXPR被DEFMACRO取代，DEFMACRO是一种允许程序员指定在程序运行之前应用的源到源转换的系统。FEXPR(和FSUBR)实际上并没有被替换。FEXPR和FSUBR从未打算作为源-源转换。宏工具被添加为一个独立的、不相关的功能。FEXPR的问题在于它们太强大了，并且对实现施加了太多约束。研究发现，FEXPR的某些惯用用法是“安全的”(具有明确的、直观的语义)，而另一些用法则是“不安全的”(具有模糊的语义，依赖于亚循环不动点(YIKS！)的存在。)。一个人不能用“不安全的FEXPR”进行有效的编程，所以他们很快就失宠了。‘Safe&#39；FEXPR原来是FEXPR的子集，可以理解为源-源翻译。由于宏提供了同样的功能而没有随之而来的问题，它们很快就成为元程序的首选方式。有了FEXPR，亚循环就不再必要了，EVAL也不再需要对列表结构进行操作。另一种看待它的方式是这样的：一种语言的外指语义有一个函数`Big-E&39；将‘表达式’映射到‘值’。如果我们愿意，我们可以定义一个函数Big-P(用于解析)，该函数将`列表结构‘映射到’表达式‘。如果我们愿意，我们可以定义一个将`列表结构映射到`表达式’的函数Big-P(用于解析)。LISP I定义Big-E[[]]=3D Apply(Big-E[[Car(Big-P^-1[[]])]]，map(lambda(Arg)Big-P^-1[[eval Arg]])(Cdr(Big-P^-1[[]])(或类似的东西)。重点在于，Big-E的语义定义是通过代码和列表结构之间的同构来定义的，并且与之有着千丝万缕的联系。FEXPR操作同构(讨厌)两侧的对象，因此不能将Big-P和Big-P^-1从语义中分离出来。然而，宏只在一侧操作对象，允许将Big-P作为句法转换进行分解和隐藏。这大大简化了Big-E的定义(本质上，它允许我们在简单的Scott域上定义Big-E，而不是在反射域上定义Big-E)。--=20~JRM", "note_en": "wrote:&gt; Wikipedia&#39;s page on macros had really no history on it at all. I added some, including&gt; references to Kohlbecker and Clinger. =C2=A0If anyone wants to make it better (or correct&gt; the terrible guesses I made about FEXPRs), take a look at it:&gt;&gt; http://en.wikipedia.org/wiki/Macro_%28computer_science%29#Lisp_.2F_S-expression_macros``The earliest Lisp macros took the form of FEXPRs, function-likeoperators whose inputs were not the values computed by the arguments but rather thesyntactic forms of the arguments, and whose output were syntactic fragments to be used in place of the FEXPR&#39;s use.&#39;&#39;The arguments to a FEXPR were definitely *not* the syntactic forms,but were insteadthe literal list structure of the source code as returned by `read&#39;.The `output&#39; of a FEXPRis used as the return value of the expression that invoked the FEXPR.The differenceis subtle but critical. It hinges on the implementation details of LISP I.LISP I was not simply an implementation of a language definition. It was animplementation of a *meta-circular* language definition. In a language witha meta-circular component, we can partition functions into two classes:those that are `normal&#39; and those that are `level crossing&#39;. In the LISP Iimplementation, a name could be bound to an EXPR or SUBR, whichis simply a first-class procedure (the difference being simply that anEXPR was a procedure implemented via a recursive evaluation whilea SUBR was a procedure implemented by direct execution in theunderlying platform (IBM 704 assembly). A SUBR was either a primitiveor a chunk of compiled code.) But there were analogous level-crossingversions of these called FEXPRs and FSUBRs. A FEXPR was a level-crossingprocedure implemented via recursive evaluation and an FSUBR was alevel-crossing procedure implemented by direct execution.But FEXPRs and FSUBRs were not meta-syntactic operators thatworked on programs via reification and reflection, but rathermeta-implementationoperators that relied on the meta-circular definition of EVAL (that is,a FEXPR or FSUBR runs at the semantic level of meta-EVAL, not EVAL.)This distinction was not lost on McCarthy et al. FEXPRs were *designed*around the fact that the language had a meta-circular definition that wasimplemented via recursive descent of list structure. Most, if not all, ofthe people agitating for the reconsideration of FEXPRs do not understand thisdistinction. A macro is a program that performs rewrites at a syntactic level.It is abstracted away from the concrete representation of the program itoperates on. A FEXPR, on the other hand, is a program that is deliberately*not* abstracted away from the concrete representation. It is as intimatelytied to that representation as EVAL.&gt; In later Lisps, FEXPRs were replaced by DEFMACRO, a system that&gt; allowed programmers to specify source-to-source transformations that&gt; were applied before the program is run.FEXPRs (and FSUBRs) weren&#39;t actually `replaced&#39;. FEXPRs andFSUBRs were never intended as source-&gt;source transforms. The macrofacility was added as a separate, unrelated feature. The problem withFEXPRs is that they are far too powerful and place too many constraintson the implementation. It was discovered that certain idiomatic uses ofFEXPRs were `safe&#39; (with well-defined, intuitive semantics) whereas otheruses were `unsafe&#39; (with vague semantics that rely on the existence ofmeta-circular fixed points (yikes!) and were difficult to reason about).One cannot effectively program with `unsafe&#39; FEXPRs, so they fellout of favor really quickly. `Safe&#39; FEXPRs turn out to be the subsetof FEXPRs that can be understood as source-&gt;source translations.Since macros provided that same power without the attendant problems,they quickly became the preferred way to meta-program. With FEXPRsno longer necessary, meta-circularity is no longer necessary andEVAL no longer needs to operate on list structure.Another way to look at it is this: the denotational semantics of alanguage have a function `Big-E&#39; that maps `expressions&#39; to `values&#39;.If we wish, we can define a function Big-P (for parse) that maps`list structure&#39; to `expressions&#39; and Big-P^-1 that maps them back.LISP I defines Big-E[[   ]] =3D apply( Big-E[[ car (Big-P^-1 [[ ]])]], map (lambda (arg) Big-P^-1 [[ eval arg ]]) (cdr (Big-P^-1 [[ ]]))(or something like that). The point is that the semantic definition ofBig-E is defined via the isomorphism between code and list structure andis inextricably linked to it. A FEXPR manipulates objects on both sidesof the isomorphism (yuck), so Big-P and Big-P^-1 cannot be factored outof the semantics. A macro, however, only manipulates objects on oneside, allowing Big-P to be factored out and hidden as a syntactic transform.This greatly simplifies the definition of Big-E (in essence, it allows us todefine Big-E over a simple Scott domain rather than a reflective one).--=20~jrm", "posttime": "2020-10-30 02:00:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "def,fexprs,fexpr", "title": "关于Fexprs和Def宏", "title_en": "On Fexprs and Defmacro", "transed": 1, "url": "https://www.brinckerhoff.org/scraps/joe-marshall-on-FEXPRS-and-DEFMACRO.txt", "via": "", "real_tags": ["def", "fexprs", "fexpr"]}, {"category": "", "categoryclass": "", "imagename": "a3a572cc4a4a2135f390b25b4d89d485.png", "infoid": 1032083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山有一个不幸的神话：Soylent是正常食物的健康、可行的替代品。\n当我质疑人们喝它的健康程度时，我通常会遇到困惑。索伦对你不好吗？它不是有你需要的所有维生素和营养素吗？它不是平衡得很好吗？\nSoylent最初是作为一种节省时间的方式创建的。正如创始人在他关于这个主题的第一篇文章标题中所解释的那样：\n“在我自己的生活中，我憎恨购买、准备、消费和清理食物所花费的时间、金钱和精力消耗了…。我不想减肥。我想保持这种状态，花更少的精力获取能量。“。\n他似乎觉得，在硅谷世界里，每个人每天都应该花16个小时编写代码，食物是浪费时间，需要在他的Scrum董事会上压缩成尽可能少的任务小时。这是不幸的，但不一定是糟糕的。\n更令人担忧的是下一段，它解释了现在公司的创立假设：\n“我假设身体不需要食物本身，只需要食物中含有的化学物质和元素。所以，我决定开始做一个实验。如果我只摄入身体用来补充能量的原料呢？“。\n这就是Soylent的基础。我们的身体不需要食物，而是食物中含有的化学物质和元素，更重要的是，我们知道这些化学物质和元素是什么，这一假说是出于节省吃饭时间的愿望而得出的。\n就在20年前，这个食物金字塔还在向美国的学生传授：\n值得庆幸的是，我们现在知道，这几乎完全是无稽之谈，对整整一代美国人造成了重大伤害，很可能导致了现代肥胖症的大部分流行。脂肪是很棒的，谷物几乎是完全不必要的，应该尽量减少。奶制品是可疑的。水果还可以，但是含有大量的果糖。\n谢天谢地，提出这些建议的美国机构已经改变了路线，现在建议使用更健康的饮食，主要由蔬菜、脂肪、肉类和最少的谷物组成。\n尽管所有的证据都表明饱和脂肪是你饮食中非常好的一部分，但他们的蛋白质和食物小贴士仍然建议将其降至最低：\n他说：“很多加工过的肉类都有低脂版本可供选择。看看营养事实标签，选择脂肪较少和饱和脂肪较少的产品。“。\n他们还在散布这样的信念，即吃胆固醇会提高你的胆固醇，这一点我们再一次知道这根本不是真的。\n现在，让我们停下来思考一下为什么这很重要。当你说“健康”，我说“健康”时，我们都可以在头脑中认为我们理解“健康”是什么意思，但对它是什么却有着截然不同的想法。如果你仍然相信糖业资助的食物金字塔，那么你可能会认为你需要每天吃一条面包。你对健康的想法包含了很多面包和意大利面，这是错误的，但如果我只是问你，“你吃得健康吗？”你会说“是的！”，你就不会说谎，本质上，只是误导。\n当有人说一种食物是健康的时，我们必须问问他们说的健康是什么意思。他们正在研究最新的研究成果吗？还是他们在使用陈旧的、糟糕的数据，并信任那些仍在受到游说、虚假数据和糟糕科学影响的政府机构？\n那么，让我们试着弄清楚Soylent所说的健康是什么意思，以便评估他们的说法。\n如果你访问Soylent的网站，他们是这样描述为什么它是健康的：\nSoylent的营养成分包括蛋白质、碳水化合物、脂肪、纤维、维生素和矿物质，如钾、铁和钙。它包括健康饮食的所有要素，不含过量的糖、饱和脂肪或胆固醇。“。\n为了了解它是否健康，我们需要深入研究其中的每一个，看看他们对每一个类别的健康是否有正确的想法，以及他们对这些健康有多诚实。\n声明1：Soylent不含过量的有害物质：糖、饱和脂肪、胆固醇。\n让我们从他们如何总结他们的解释开始，说“[Soylent]包括健康饮食的所有元素，没有过量的糖、饱和脂肪或胆固醇。”\n糖是不好的，我们都有相同的看法，但是饱和脂肪和胆固醇呢？我已经把这些称为营销中产生的旧神话，但让我们更深入地挖掘一下为什么关于它们不好的旧观念不是真的。\n没有很好的证据表明饱和脂肪对你有害，只是它们对你的好处不如单不饱和脂肪或多不饱和脂肪。这再一次是糖业传出的神话的一部分，也是一个非常顽固的关于离开的神话，尽管研究表明这是一个错误，我们应该减少碳水化合物的摄入量，用我们过去吃得更多的饱和脂肪取而代之。\n胆固醇也是如此。事实证明，吃胆固醇并不像我们过去认为的那样简单，吃一些胆固醇对大脑和性健康都很重要。改用高脂肪饮食的阿尔茨海默氏症患者症状明显减少，而且我们不再像我们过去认为的那样，将饮食胆固醇视为心脏病的风险因素。\n更糟糕的是，吃胆固醇太低的饮食可能会增加你患痴呆症和记忆力丧失的风险，这可能解释了为什么我们在开始丑化这些食物的同时，看到神经退行性疾病的增加。\n饱和脂肪和胆固醇至少是不坏的，有证据表明它们可能是你饮食中重要的一部分。当我们特别考虑到神经退行性风险时，不食用它们可能比食用它们有更大的风险。\n这对Soylent来说是个问题。当他们宣传他们已经将饱和脂肪和胆固醇降到最低的时候，这应该是一个警告信号，原因有两个：\n他们还没有研究什么对你有好处和坏处。他们坚持过时的、糟糕的数据，所以我们不能相信他们关于什么应该出现在你的饮食中，什么不应该出现在你的饮食中的观点。\n如果你生活在Soylent上，你患神经退行性疾病、记忆力丧失、性功能减退和其他问题的风险可能会更高。\n所以看起来他们三分之二的“我们没有多余的这种东西”部分是有问题的，但是他们关于糖的声明呢？\n我想没有人会不同意糖是不好的。我们非常清楚这一点。然而，我们可以挑战的是，他们没有“超量”的说法。\n在Soylent较受欢迎的产品之一Coffeist中，400卡路里中只有9克添加糖。如果你是一个身材较小的人，每天只需要1600卡路里的热量，你就会得到36克的额外糖。但是，如果你是一个相对活跃、健康的人，你可能需要2400卡路里，这将给你54g额外的糖。\n这是个问题。你一天需要的添加糖的量是0，任何超过这个量都是“过剩的”，但即使我们很慷慨，允许他们包括美国心脏协会推荐的限量，但它们仍然高于它们。AHA建议男性每天摄入约37.5克，女性每天摄入25克，假设你是活跃的，并且没有在你每天的卡路里需要量下进食，那么服用Soylent就会超过这个数字。\n所以当他们说“[Soylent]包含了健康饮食的所有元素，没有过量的糖、饱和脂肪或胆固醇”时，他们错了，或者至少在三个方面是“正确但具有误导性的”：\n这是他们三个主张中最令人担忧的，但正如我们将看到的，其他两个也好不到哪里去。\n当Soylent声称它拥有你需要的所有维生素和矿物质时，我们需要拆开几个隐含的说法：\n如果你通过Soylent食用它们，你就会像吸收它们的自然形态一样吸收它们并从中受益。\n但正如我们将看到的，这里也有一些问题。First Off…。\n关于拥有你所需的维生素和矿物质的说法是基于认识到食品中有这些我们需要的东西，而且为了让Soylent取代食物，它也需要拥有这些东西。\n对其中一些维生素和矿物质的需求是显而易见的，如果被忽视，会产生迅速的后果。如果你的饮食中没有钠，你就会死。如果你没有摄入维生素C，你就会得坏血病。\n但某些维生素和矿物质的缺乏也会产生更微妙的影响。摄入太少的硒，你可能会患上甲状腺功能减退症，并与之生活很长一段时间，而不会严重到需要治疗的地步。你可能在很长一段时间内缺钾，因此受到伤害，但却从未真正注意到这一点。\n现在，需要明确的是，Soylent做得很好，包括我们知道的他们饮料中的所有维生素和矿物质。但更有趣的是这个问题：我们知道你需要的所有维生素和矿物质吗？\n从来没有人坐下来拆解一个人，对你最佳运作所需的所有特定维生素和矿物质输入进行反向工程。他们中的大多数已经被弄清楚了，因为人们开始死于某种东西，在他们的饮食中添加一些食物来修复它，然后我们做了足够的工作，直到我们能够分离出修复它的具体东西。在水手们知道他们在长途旅行中需要桶装酸橙或酸菜很久之后，才发现了维生素C。很可能我们并不完全知道我们从食物中得到了什么，只是到目前为止我们所知道的。\n这种关于维生素和矿物质的不完善信息是有问题的，因为虽然酸橙中可能含有一些我们还不知道的有益物质(我们称之为维生素X)，但Soylent并非如此。我们可能会从经常食用石灰中获得一些我们完全不知道的至关重要的东西，但当我们剔除食物中所有的未知因素，仅仅将我们不知道的一堆粉末混合在一起，我们就会失去维生素X。而且很可能维生素X就像维生素D一样，你很可能需要数年、甚至几十年的时间才能患上癌症和因缺乏它而导致的健康并发症。\n问题是，到目前为止，我们只知道我们所知道的，但假设我们永远不会在不知道的情况下找到我们默认获得的另一个重要的营养部分，这是荒谬的。\n那么，Soylent是否含有我们目前所知的所有维生素和矿物质呢？是。它含有你需要的所有维生素和矿物质吗？大概不会吧。我想当我们后来发现它们的时候，它会增加它们，但谁知道三年没有足够的维生素X对你的身体会造成什么影响。我们可能还没有发现，因为所有的蔬菜都含有维生素X，但是当你停止吃蔬菜，开始喝神奇的硅谷食粉…。谁知道我们会发现什么新的缺陷。\n这涵盖了他们关于维生素和矿物质的声明的第一点和第二点，但第三项声明有一个问题需要我们强调。维生素就是维生素这个观点就是维生素。\n我们知道Soylent含有我们所知的所有维生素和矿物质，但这并不一定意味着你可以吸收它们或从中受益。\n让我们来看一个极端的例子。比方说每天早上我给你服用复合维生素和利尿剂。你会把它们都带走，一个小时后，当你的内脏积极地疏散到厕所里时，你会悄悄地抽泣。\n现在问题来了。你吃维他命了吗？你当然会摄入它们，但它们似乎不太可能在从你体内射出之前被适当地吸收到你的身体里。“消耗你的维生素和矿物质”和实际吸收它们是有区别的。\n那么让我们回到Soylent。它可能含有你需要的所有维生素和矿物质，但你是以同样的方式吸收它们的吗？你知道的唯一方法是只食用Soylent，不吃其他东西，几个月后检测你的水平，也许更长时间，但我们可以做出一些推断。\n我们知道，合成补充剂的吸收方式与我们在真正的食物中获得它们的方式不同，所以即使Soylent拥有一切，我们可能也不会以同样的方式使用它们，因为它不是原来的形式。那样的话，“100%”可能更像是20%，因为我们只能用一部分，更糟糕的是，吃东西的过程似乎对吸收很重要。例如，咀嚼有助于吸收维生素和矿物质，也有助于充分利用蛋白质。\n是的，这是我们没有明确答案的另一个领域，但有两种可能性：\n我们不完全了解维生素和矿物质是如何被吸收的，所以它们的自然形式是更安全的选择。\n我们完全明白，我们可以使用合成的、加工过的维生素和矿物质，效果会很好的。\n再一次，让我们把它分解成隐含的声明，就像我们对过去的声明所做的那样：\n在一瓶咖啡中，你会得到21克脂肪，37克碳水化合物和20克蛋白质。就卡路里而言，有189卡路里来自脂肪，148卡路里来自碳水化合物，80卡路里来自蛋白质。按百分比计算，那是45%的脂肪，35%的碳水化合物和20%的蛋白质。\n这没什么，但不太好。如果你想保持健康的体重，每天低于150克的碳水化合物要容易得多，如果你靠Soylent(2000卡路里的饮食)生活，那么你几乎就会得到这样的体重。我会扔掉大部分的碳水化合物填充物，而选择更多的脂肪，但那会让它更油腻，更不像奶昔。\n不过，更有趣的是另一个问题：蛋白质、碳水化合物和脂肪的质量如何？\nSoylent中的大部分蛋白质来自大豆分离蛋白，他们将其描述为具有“强大的氨基酸图谱”，虽然这是真的，但当谈到加工大豆作为我们的饮食蛋白质来源时，至少有很多东西让我们犹豫。\n老实说，陪审团对加工酱油还没有定论。但这种不确定足以让人不想消费太多。普通大豆似乎相当不错，但它所有的加工食品似乎都可能带来不同的癌症和性健康相关问题。它是非常来回的，但这足以让我怀疑它的好处，而且绝对足够不希望它成为我唯一的唯一蛋白质来源，作为一种进化到吃其他动物的动物。\n换句话说，你会相信一种我们经过数百万年进化而食用的蛋白质吗？还是20世纪60年代才发明的？\n他们的碳水化合物看起来相当健康，但从他们的血糖指数来看，这是一种衡量饮料对血糖水平影响程度的指标，这一点令人担忧。Soylent 2.0的血糖指数为49，大约相当于橙汁、士力架和意大利面。这本身并不是那么糟糕，但如果这是你所有的消费，那么每顿饭对你的血糖的影响就像一杯甜饮料或一盘满满的意大利面一样。这可不妙。\n所有这些问题都与他们的声明有关，为什么他们的健康应该让你犹豫不决。但是，即使你到目前为止还不同意这一逻辑，所有这些背后都有一个核心问题，这足以让人怀疑任何来自Soylent或其他发明的食品的健康主张。\n虽然我尊重Soylent正在尝试做的事情，但它落入了与举重机相同的陷阱。人类的自然过程有一定的格式塔，当你试图将其简化为核心部分，并用技术重新创造它时，你会失去一些东西，也得不到全部的好处。\n有时你失去的是无害的，但Soylent的危险在于，不知道的可能会慢慢杀死我们。\n比麦当劳还糟糕吗？可能不会，但至少你吃麦当劳感觉不舒服，这就是问题所在。这种认为Soylent是健康的想法会让你认为，如果你吃了Soylent，你就已经做了一天的好事，而不是把它当作最后的手段，就像蛋白质棒一样。\n要说它是健康的，我们必须知道它对你的健康有直接的好处，或者至少可以与蔬菜、肉类和坚果等真正的食物相媲美。我们没有证据证明这一点。也许它很接近，但关于它和这些合成食物有太多未知之处，我们不能说它是健康的。\n评估一些在自然界中没有发现的食物的默认标准不应该是“在被证明是坏的之前是健康的”，而应该是在被证明是健康的之前是坏的。", "note_en": "There’s an unfortunate myth in San Francisco: that Soylent is a healthy, viable replacement for normal food.\n When I challenge people drinking it on its healthiness, I’m usually met with confusion. Isn’t Soylent good for you? Doesn’t it have all of the vitamins and nutrients you need? Isn’t it well balanced?\n   Soylent was originally created as a way to save time. As the founder explains in  his first article on the subject:\n “In my own life I resented the time, money, and effort the purchase, preparation, consumption, and clean-up of food was consuming… I don’t want to lose weight. I want to maintain it and spend less energy getting energy.”\n He seemed to feel that in the Silicon Valley world where everyone ought to spend 16 hours a day coding, food was a waste of time and needs to be condensed into the fewest possible task hours on his scrum board. That’s unfortunate, but not necessarily  bad.\n What’s more concerning is the next paragraph, which explains the founding hypothesis for the now-company:\n “I hypothesized that the body doesn’t need food itself, merely the chemicals and elements it contains. So, I resolved to embark on an experiment. What if I consumed only the raw ingredients the body uses for energy?”\n This is what Soylent is founded upon. A hypothesis, arrived at from the desire to save time eating, that our bodies do not need  food, but rather the chemicals and elements it contains, and more importantly, that we know what those chemicals and elements are.\n   As recently as 20 years ago, this food pyramid was still being taught to students in the U.S.:\n    We now know, thankfully, that this is pretty much entirely nonsense and caused significant harm to an entire generation of Americans, likely leading to much of the modern obesity epidemic. Fats are great, grains are almost completely unnecessary and should be minimized. Dairy is suspect. Fruits are alright but have a significant amount of fructose.\n Thankfully, the U.S. agencies that make these recommendations have changed course and now recommend a healthier diet consisting of primarily vegetables, fats, meat, and minimal grains.\n   And despite all the evidence saying that saturated fat is a completely fine part of your diet, their protein  food tips  still say to minimize it:\n “Lower fat versions of many processed meats are available. Look on the Nutrition Facts label to choose products with less fat and saturated fat.”\n They are also still spreading the belief that eating cholesterol  raises your cholesterol, something that, again, we know simply isn’t true.\n Now, let’s pause and consider why this matters. When you say “healthy,” and I say “healthy,” we could both, in our heads, think we understand what “healthy” means, while both having very different ideas of what it is. If you still believe in the sugar-industry-funded food pyramid then you might think you need to eat a loaf of bread a day. Your idea of healthy contains a lot of bread and pasta, which is wrong, but if I just ask you  “do you eat healthy?” you would say  “yes!” and you wouldn’t be  lying, per se, just misinformed.\n When someone says a food is healthy, we have to ask what they mean by healthy. Are they are up on the latest research? Or are they using old, bad data and trusting government agencies that are  still being influenced by lobbying, fake data, and bad science?\n Well, let’s try to figure out what Soylent means by healthy, in order to evaluate their claims.\n  If you visit  Soylent’s site, here’s how they describe why it’s healthy:\n “Soylent’s nutritional makeup includes protein, carbohydrates, fats, fiber, and vitamins and minerals such as potassium, iron and calcium. It includes all of the elements of a healthy diet, without excess amounts of sugars, saturated fats, or cholesterol.”\n   In order to understand whether or not it’s healthy, we’ll need to dive into each one of these, and see if they have the right idea about health in each of these categories, and how honest they’re being about them.\n Claim 1: Soylent doesn’t have an excess of bad things: sugar, saturated fats, cholesterol\n Let’s start with how they conclude their explanation, saying  “[Soylent] includes all of the elements of a healthy diet, without excess amounts of sugars, saturated fats, or cholesterol.”\n   Sugar being bad we’re all on the same page about, but what about saturated fats and cholesterol? I’ve already called these out as  old myths that arose from marketing, but let’s dig in a little deeper on why the old ideas about them being bad aren’t true.\n There’s  no good evidence suggesting that saturated fats are bad for you, only that they aren’t quite as good for you as monounsaturated or polyunsaturated fats. This is, again, part of the collection of myths that came out of the sugar industry, and one that has been very stubborn about going away, despite research suggesting  it was a mistake and that we should reduce carb intake and replace it with the saturated fats we used to eat more of.\n The same is true for cholesterol. It turns out that  eating cholesterol does not raise your cholesterol in the simple ways we used to believe, and that eating some cholesterol is important for your brain and for sexual health. Alzheimer’s patients who switch to a high-fat diet see a  decrease in symptoms, and  we’re moving away from looking at dietary cholesterol as a risk factor for heart disease as we used to believe.\n Worse, eating a diet too low in cholesterol can  increase your risk of dementia and memory loss, which may explain why we’ve seen a rise in neurodegenerative diseases around the same time we started vilifying these foods.\n Saturated fats and cholesterol are at the very least not bad, and there’s evidence that they could be an important part of your diet. There may be more risk from  not consuming them than consuming them when we look at the neurodegenerative risks in particular.\n This is a problem for Soylent. When they advertise that they’ve minimized saturated fat and cholesterol, that should be a warning sign to you for two reasons:\n They haven’t done their research on what’s good and bad for you. They’re sticking to outdated, bad data, so we can’t trust the  rest of their notions about what should and shouldn’t be in your diet.\n If you lived on Soylent, you could be at higher risk for neurodegenerative disease, memory loss, decreased sexual function, and other problems.\n So it seems two-thirds of their “we don’t have excess amounts of this stuff” section is problematic, but what about their claims about sugar?\n I don’t think anyone will disagree that sugar is bad. We know that pretty conclusively. What we can challenge, though, is the claim that they don’t have “excess amounts” of it.\n In Coffeist, one of Soylent’s more popular products, there are  9g of added sugars out of 400 calories. If you’re a smaller person and only need ~1,600 calories a day, you’d be getting 36g of added sugar. But if you’re a relatively active, fit person, you might need more like 2,400 calories, which would give you 54g of added sugar.\n That’s a problem. The amount of added sugar you  need in a day is 0, and anything above that is “excess,” but even if we’re generous and allow them to include the American Heart Association recommended limits,  they’re still above them. The AHA recommends ~37.5g a day for a man, 25g a day for a woman, and assuming you’re active and not eating under your daily caloric needs, you’d be getting above that amount with Soylent.\n So when they say  “[Soylent] includes all of the elements of a healthy diet, without excess amounts of sugars, saturated fats, or cholesterol.” They’re wrong, or at least being “ true but misleading,” in three ways:\n  This is the most concerning of their three claims, but as we’ll see, the other two aren’t that much better.\n  When Soylent says it has all of the vitamins and minerals you need, there are a few implied claims that we need to unpack:\n If you consume them via Soylent, you absorb and benefit from them the same way you do with their natural forms.\n But as we’ll see, there are a few problems here, too. First off…\n  This claim around having the vitamins and minerals you need is based on recognizing that there are these  things in food that we need, and that in order for Soylent to replace food, it needs to have those things too.\n The need for some of these vitamins and minerals is obvious and gives rapid consequences if neglected. If you get no sodium in your diet,  you die. If you get no Vitamin C, you get scurvy.\n But there are also more subtle effects from deficiencies in certain vitamins and minerals. Get too little Selenium and  you can develop Hypothyroidism and live with it for a long time without it being bad enough to be treated. You could be low on Potassium for a long time, be suffering harm from it, and never really notice it.\n Now, to be clear, Soylent does a good job including all of the vitamins and minerals  that we know about in their drinks. But what’s more interesting is the question:  do we know all of the vitamins and minerals you need?\n No one has ever sat down and taken apart a human being and reverse engineered all of the specific vitamin and mineral inputs you need to function optimally. Most of them have been figured out because people started dying of something, adding some food to their diet fixed it, and then we did that enough until we were able to isolate what the specific thing that fixed it was. Vitamin C was discovered long after sailors knew they needed barrels of limes or sauerkraut on long journeys. Odds are good that we don’t know everything about what we get from food, just what we know so far.\n This imperfect information about vitamins and minerals is problematic, because while a lime probably has some other things in it that are beneficial that we’re yet unaware of (let’s call it Vitamin X), Soylent doesn’t. We could be getting something vitally important from regular lime consumption that we’re completely unaware of, but when we strip away all the unknowns in food and just mix together a bunch of powders from what we  do know about, we lose Vitamin X. And  it could very well be that Vitamin X is like Vitamin D, and it takes years, even decades, for you to develop cancers and health complications from its absence.\n The point is, we only know what we know  so far, but to assume that we’ll never find another important part of nutrition that we’ve been getting by default without knowing about it is ludicrous.\n So does Soylent contain all of the vitamins and minerals we know about so far? Yes. Does it contain all of the vitamins and minerals you need? Probably not. I assume it would add them later as we discover them, but who knows what 3 years without sufficient Vitamin X does to your body. We may have not discovered it yet because all vegetables contain Vitamin X,  but when you stop eating vegetables and start drinking magical silicon valley food powder… who knows what new deficiencies we’ll discover.\n That covers points 1 and 2 of their claims around vitamins and minerals, but there’s an issue with claim 3 that we need to highlight. This idea that a vitamin is a vitamin is a vitamin.\n  We know that Soylent contains all of the vitamins and minerals we know about, but that does  not necessarily mean you can absorb or benefit from them.\n Let’s take an extreme case. Say every morning I gave you a multivitamin and a diuretic. You would take them both, and an hour later, be quietly sobbing as your insides aggressively evacuate into the toilet.\n Now here’s the question. Did you get your vitamins? You certainly consumed them, but it seems unlikely that they properly absorbed into your body before getting projectiled back out of you. There is a difference between “consuming your vitamins and minerals” and actually absorbing them.\n So let’s come back to Soylent. It may have all of the vitamins and minerals you need, but do you absorb them the same way? The only way you would know is to consume only Soylent and nothing else and get your levels tested after a few months, maybe longer, but we can make some inferences.\n We know that  synthetic supplements are not absorbed the same way as when we get them in real food, so even though Soylent has everything, we’re likely not using all of it the same way since it’s not in its original form. In that case, “100%” may be more like 20%, since we can only use some of it. Worse, the process of  eating seems important for absorption. Chewing, for example, helps with  absorbing vitamins and minerals, as well as for  making full use of protein.\n And, yes, this is another area where we don’t have a clear answer, but there are two possibilities:\n We don’t fully understand how vitamins and minerals are absorbed, so their natural form is the safer bet.\n We totally get it and we can use synthetic, processed versions of vitamins and minerals and it’ll work out fine.\n    And once again, let’s break this up into its implicit claims as we’ve done with the past ones:\n   In a bottle of Coffeist, you’ll get 21g of fat, 37g of carbohydrates, and 20g of protein. In terms of calories, that’s 189 calories from fat, 148 from carbohydrates, and 80 from protein. As percentages, that’s 45% fat, 35% carbs, and 20% protein.\n This is okay, but it’s not great. If you want to maintain a healthy weight, that’s a lot easier at below 150g of carbs a day, and if you lived on Soylent (2,000 cal diet) you’d be getting almost exactly that. I would have ditched most of the carb filler and opted for more fat instead, but that would have made it much more oily and less shake-like.\n What’s more interesting though is the other question: what is the quality of the protein, carbs, and fat?\n   Most of the protein in Soylent comes from Soy Protein Isolate, which they describe as having a “robust amino acid profile,” and while that’s true, there’s plenty to at least give us pause when it comes to processed soy as our dietary protein source.\n I’ll be honest, the jury is still out on processed soy. But that unsureness is enough to not want to consume too much of it. Normal soy seems to be pretty much fine, but all of its  processed forms  seem like they could bring different cancerous and sexual health related issues with them. It’s very back and forth, but that’s enough to make me suspicious of its benefits, and definitely enough to not want it to be my  only protein source as an animal that evolved to eat other animals.\n Phrased another way,  would you put your faith in a kind of protein that we’ve evolved to eat over  millions of years? Or one that was  invented in the 1960s?\n Their carbs seem fairly benign, but  their Glycemic Index, the measure of how much the drink affects your blood sugar levels, is concerning. Soylent 2.0 has a glycemic index of 49, which is about  the same as orange juice, Snickers bars, and spaghetti. That’s not  so bad on its own, but if it’s all you’re consuming, then every meal is hitting your blood sugar the same way as a sweet drink or plate full of pasta would. That’s not good.\n All of these issues with their claims about why their healthy should give you pause. But even if you’re not on board with the logic so far, there is one, central problem underlying all of it, which is enough to be suspect of any claims to healthiness from Soylent or other invented foods.\n  While I respect what Soylent is trying to do, it falls into the same trap as weight machines. There’s a certain gestalt to natural human processes, and when you try to simplify it to its core pieces and recreate it with technology, you lose something and don’t get the full benefits.\n Sometimes what you lose is harmless, but  the danger with Soylent is that what don’t know may slowly kill us.\n Is it worse than McDonalds? Probably not, but at least you don’t feel good about eating McDonalds, and that’s where the problem is. This idea that Soylent is healthy tricks you into thinking that if you have your Soylent, you’ve done your good-eating-deed for the day, instead of thinking of it as a last resort like a protein bar.\n For us to say that it’s healthy, we would have to know that it has a direct boon to your health, or is at least comparable to real foods like vegetables, meat, and nuts. We have no evidence of that. Maybe it comes close, but there’s so much unknown about it and these kinds of synthesized foods that we can’t call it healthy.\n The default for evaluating some food that isn’t found in nature shouldn’t be that it’s “healthy until proven bad,” rather, bad until proven healthy.", "posttime": "2020-10-30 02:00:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "soylent,isn", "title": "不，Soylent不健康。这就是为什么。(2017)", "title_en": "No, Soylent Isn’t Healthy. Here’s Why. (2017)", "transed": 1, "url": "https://www.nateliason.com/blog/soylent", "via": "", "real_tags": ["soylent", "isn"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "引导应用程序时出错", "note_en": "Error bootstrapping app", "posttime": "2020-10-30 02:00:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,risc,应用程序", "title": "RISC-V开发的核心是无与伦比的", "title_en": "The Heart of RISC-V Development Is Unmatched", "transed": 1, "url": "https://www.sifive.com/blog/the-heart-of-risc-v-development-is-unmatched", "via": "", "real_tags": ["开发", "risc", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "28497ca2ed45da63fef6355696f79dbe.jpg", "infoid": 1032080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2013年12月26日，购物者在多伦多的伊顿中心购物。加拿大媒体/克里斯·杨(Chris Young)。\n渥太华-根据隐私官员的一项调查，在顾客不知情的情况下，加拿大各地商场的母公司凯迪拉克美景(Cadillac Fairview)使用的面部识别软件收集了500多万张加拿大购物者的图像。\n联邦隐私专员周四报告称，凯迪拉克美景违反了联邦和省级隐私法，在加拿大12个购物中心的数字信息亭内嵌入摄像头，并在未经用户同意的情况下捕捉用户的图像。\n安装在凯迪拉克Fairview的“寻路”目录中的面部识别软件被称为“匿名视频分析(AVA)”，并通过安装在防护玻璃后面的摄像头，于2017年在加拿大商场使用了一段短暂的测试期，然后在2018年5月至7月期间投入使用。\n该软件对目录内摄像头视野内的任何个人的脸部进行临时数字图像处理，并将图像转换为每个面孔的生物特征数字表示，然后使用这些信息来汇编购物中心游客的人口统计信息。\n根据加拿大隐私专员丹尼尔·塞里恩(Daniel Therrien)的一份声明，该公司表示，其摄像头的目标是“分析购物者的年龄和性别，而不是识别个人身份。”\n该公司表示，它没有收集个人信息，因为这些图像被短暂地查看了一下，然后被删除，然而，从图像中产生的信息是由一家名为Mappdin的第三方承包商存储的，凯迪拉克Fairview表示并不知道这一点。\n“当被问及收集这些数据的目的时，梅普丁无法回答，这表明负责编写代码的人不再为该公司工作，”该报告写道。\nTherrien在他的报告中指出，Cadillac Fairview不知道Mappdin存储了这些信息，“加剧了未经授权的人可能使用这些信息的风险，或者在数据泄露的情况下，被恶意行为者使用的风险。”\n凯迪拉克美景(Cadillac Fairview)是北美最大的零售和其他物业所有者和运营商之一，它“明确不同意”调查结果，并告诉委员们，购物中心入口的门上贴着贴纸，上面写着他们的隐私政策。\n这些贴纸引导访客访问宾客服务，以获取公司隐私政策的副本，但当调查人员询问多伦多伊顿分店的一名宾客服务员工时，这名员工“被这个要求搞糊涂了”，因此Therrien认为这些贴纸是“不充分的”措施。\nTherrien在一份声明中说：“购物者没有理由期待他们的图像是由一个不显眼的摄像头收集的，或者它会被用来与面部识别技术一起进行分析。”“考虑到生物特征数据的敏感性，缺乏有意义的同意尤其令人担忧，这是我们身体的一个独特而永久的特征，也是我们身份的关键。”\n这项调查是在2018年启动的，此前有几家媒体报道称，商场的咨询亭配备了未标记的摄像头，以监控游客人口统计数据。他们在本案中的检查包括访问凯迪拉克Fairview的多伦多总部采访关键人员，查看运行中的寻路目录中的AVA技术，以及从目录中提取记录进行法医分析。\n在一名用户在Reddit上发布了一张位于卡尔加里CF Chinook中心的显示屏上的图像后，该软件的存在被曝光，该屏幕上显示的编码语言包括“FaceEncoding”和“FaceAnalyzer”。\nTherrien专员的办公室与艾伯塔省信息和隐私专员吉尔·克莱顿以及不列颠哥伦比亚省信息和隐私专员迈克尔·麦克埃沃伊合作进行调查。\n克莱顿在一份声明中说：“当客户的个人信息被收集时，组织机构不仅必须明确和公开，他们还必须有适当的控制措施，以了解他们的服务提供商在幕后利用这些信息做了什么。”\n这三位专员表示担心，该公司没有接受他们的要求，即如果公司未来选择重新部署类似的技术，将承诺确保未来从购物者那里获得有意义的明确同意。\n在提供给CTV新闻的一份声明中，凯迪拉克·费尔维尤指出，问题已经解决，数据被删除，摄像头已经停用。此外，面部识别软件已不再使用，但该公司表示，它不会承诺“假设未来使用类似的技术”。\n“OPC报告中提到的500万个代表不是面孔。这些数字序列被软件用来在摄像机的视野中匿名分类购物者的年龄范围和性别，“该公司说。“我们感谢私隐专员就如何进一步加强我们的私隐措施所提交的报告和建议，并同意访客的私隐必须永远是最重要的。”\n查看更大的图像桑德拉·奥兰德和她的女儿乔治亚使用奇努克中心的数字购物中心目录，而没有意识到他们正在被售货亭记录下来。\n2018年3月1日周四拍摄的多伦多伊顿中心。加拿大媒体/克里斯托弗·卡萨罗夫(Christopher Katsarov)", "note_en": "Shoppers make their way through the Eaton Centre in Toronto on December 26, 2013. THE CANADIAN PRESS/Chris Young\n    OTTAWA -- \tWithout customers’ knowledge, more than five million images of Canadian shoppers’ were collected through facial recognition software used by Cadillac Fairview, a parent company of malls across the country,  according to an investigation by privacy officials.\n The federal privacy commissioner reported Thursday that Cadillac Fairview contravened federal and provincial privacy laws by embedding cameras inside digital information kiosks at 12 shopping malls across Canada, and captured users’ images without their consent.\n The facial recognition software installed in Cadillac Fairview’s “wayfinding” directories was called “Anonymous Video Analytics (AVA) and through cameras installed behind protective glass, was used in Canadian malls for a brief testing period in 2017 and then was in-use between May and July of 2018.\n The software took temporary digital images of the faces of any individual within the field of view of the camera inside the directory and converted the images into biometric numerical representations of each face and used that information to compile demographic information about mall visitors.\n   According to a statement from Privacy Commissioner of Canada Daniel Therrien, the company said the goal of its cameras was to “analyze the age and gender of shoppers and not to identify individuals.”\n The corporation said that it did not collect personal information because the images were briefly looked at and then deleted, however the information generated from the images was being stored by a third-party contractor called Mappedin, which Cadillac Fairview said it was unaware of.\n “When asked the purpose for such collection, Mappedin was unable to provide a response, indicating that the person responsible for programming the code no longer worked for the company,” reads the report.\n Therrien notes in his report that Cadillac Fairview not being aware of Mappedin’s storage of the information “compounded the risk of potential use by unauthorized parties or, in the case of a data breach, by malicious actors.”\n Cadillac Fairview—one of the largest owners and operators of retail and other properties in North America—“expressly disagreed” with the investigation’s findings, telling the commissioners that there were decals placed on shopping mall entry doors noting their privacy policy.\n These stickers directed visitors to visit guest services to obtain a copy of the company’s privacy policy, but when the investigators asked a guest services employee at the Eaton location in Toronto, the employee was “confused by the request” and so Therrien found the stickers to be an “insufficient” measure.\n “Shoppers had no reason to expect their image was being collected by an inconspicuous camera, or that it would be used, with facial recognition technology, for analysis,” said Therrien in a statement. “The lack of meaningful consent was particularly concerning given the sensitivity of biometric data, which is a unique and permanent characteristic of our body and a key to our identity.”\n The investigation was launched in 2018, following several media reports about information kiosks in malls being equipped with unmarked cameras to monitor visitor demographics. Their examination in this case included visiting Cadillac Fairview’s Toronto headquarters to interview key personnel, viewing the AVA technology inside the wayfinding directories in action, and extracting records from the directories for forensic analysis.\n The existence of the software came to light after a user posted an image to Reddit of a display screen at the CF Chinook Centre in Calgary showing coding language including “FaceEncoder” and “FaceAnalyzer.”\n Commissioner Therrien’s office worked with Alberta Information and Privacy Commissioner Jill Clayton as well as the Information and Privacy Commissioner of British Columbia Michael McEvoy on the investigation.\n “Not only must organizations be clear and up front when customers’ personal information is being collected, they must also have proper controls in place to know what their service providers are doing behind the scenes with that information,” Clayton said in a statement.\n The trio of commissioners have expressed concern that the company hasn’t accepted their request to commit to ensuring meaningful and express consent is obtained from shoppers in the future should it choose to redeploy similar technology in the future.\n In a statement provided to CTV News, Cadillac Fairview notes that the issue has been resolved, the data deleted, and the cameras have been deactivated. As well, the facial recognition software is no longer in use, but the company says it will not commit to its approach to “hypothetical future uses of similar technology.”\n “The five million representations referenced in the OPC report are not faces. These are sequences of numbers the software uses to anonymously categorize the age range and gender of shoppers in the camera’s view,” the company said. “We thank the Privacy Commissioner for the report and recommendations on how to further strengthen our privacy practices and agree that the privacy of our visitors must always be a top priority.”\n  view larger image  Sandra Oland and her daughter Georgia utilized the digital mall directory at Chinook Centre without realizing they were being recorded by the kiosk\n  The Eaton Centre in Toronto is photographed on Thursday, March 1, 2018. THE CANADIAN PRESS/Christopher Katsarov", "posttime": "2020-10-30 01:59:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,售货亭,shoppers,信息", "title": "在商场售货亭收集的500万加拿大购物者图像", "title_en": "5M Canadian shoppers' images collected at mall kiosks", "transed": 1, "url": "https://www.ctvnews.ca/canada/5-million-canadian-shoppers-images-collected-at-mall-kiosks-privacy-commissioner-1.5166162", "via": "", "real_tags": ["ios", "售货亭", "shoppers", "信息"]}, {"category": "", "categoryclass": "", "imagename": "19d6f84f5b993e836e0b065b7caf012b.png", "infoid": 1032078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好！👋我叫Jen，是个人理财和预算网络应用Lunch Money的创始人、工程师、设计师和客户支持。\n简而言之，我是一个只有一个人的公司。我回复客户支持电子邮件，编写代码并部署新功能。我还管理API文档和知识库，当有问题时查看日志，写双月刊时事通讯，我设计了徽标！\n随着公司规模的扩大，我工作的方方面面也必须如此，我将其分解为4个部分：客户支持、工程、产品和营销。\n老实说，寻找流程优化的机会是经营企业最有趣的部分之一。我很大程度上归功于到目前为止我是如何保持独立和理智的，目前拥有600多名用户和4.5万美元的ARR。在这篇文章中，我很兴奋地与大家分享我的一些最成功的策略，以及我处理午餐钱的经验轶事。\n在过去的14天里，这是我在所有部门做的事情：\n产品：推出了内部测试版测试程序和两套要测试的新功能。\n营销：向营销网站添加了新页面(规则和协作)，并更新了功能中的图标。\n让我能够忍受所有这些工作的，是因为这里有如此多的多样性(当然，这是生活的情趣！)。我喜欢在不同的任务之间切换，以保持工作的趣味性，同时让我的头脑保持清醒，同时总体上仍然富有成效。\n一个恰当的例子是：我刚刚完成了一个主要的重构，并将两个主要功能推到了测试版，所以现在写这篇博客对我的大脑来说就像是一次假期。\n显而易见的是，我喜欢超高效率(当然，不会让自己筋疲力尽)。即使我是单身人士，我仍然可以实现流程的自动化、优化和并行化。\n啊，当我一天几次将代码直接推送到生产中时，午餐钱的幸福开始了。\n现在有500多个用户，那些日子已经一去不复返了，从那以后，我需要采取更枯燥但更负责任的方法来实现保障措施，以防止发布错误的代码。\n首先，在每次更改之前，我都会彻底检查自己的代码。每一个主要的特性、改进和错误修复都生活在一个特性分支中，按照我在公司时代的习惯，这个分支仍然以Jen/为前缀。在确认当地一切正常后，我一定要先休息一下，不管是做一件完全不相关的任务、吃饭还是睡觉。这样做的目的是为了确保我在清晰地检查代码。\n虽然遵守这些代码审查标准可能会给我的整个过程增加额外的时间，但如果我不小心发布了错误代码，它可能会节省几个小时的错误修复、回答相关的支持票证和自我厌恶(我在这里是半开玩笑的)。\n午餐资金的新阶段-不再将主要功能直接推向生产https://t.co/RYsz7BnU3L🤯😂。\n-任(@午餐袋)2020年5月3日\n我最近还实施了一个面向午餐钱订阅者的内部Beta测试计划。随着越来越多的用户定期访问我的应用程序，发布一个尽可能无bug的版本的风险更高。\n作为一个由一人组成的工程团队，尽管有测试，但几乎不可能总是在第一次就把它做对(如果我错过了一个边缘案例怎么办？)。或者在本地进行广泛的测试(我认为我的用户使用某个功能的方式并不总是这样)。\nBeta测试计划提供了一些额外的好处。很高兴有一群用户，我可以和他们就午餐钱进行更坦率的对话，这也是向用户表明他们的反馈是有价值的一个很好的方式！\n虽然从长远来看，自动化任务可以节省大量时间，但立即实现自动化并不总是有意义的。\n太晚实现自动化并不是一件坏事。我已经做了足够多次的手工工作，以了解如何最终实现任务自动化，以及需要注意哪些边缘情况。我把它等同于在雇佣某人之前自己做一份工作--在某种程度上先摸索需求总是更好的，这样你就可以理解如何最好地利用你带来的人(并更欣赏他们！)。\n几个月来，我手动触发了每两个月一次的账户总结电子邮件，因为我不确定发送节奏是否合理。在观察了开放价格并收集了用户反馈后，这些服务现在会自动在每个月的5号和25号发布。\n我很高兴我没有花时间去自动化的是推荐程序。如果现有用户推荐了新用户，而新用户订阅了计划，则两个用户都将获得1个月的积分。\n最终，推荐计划只带来了11个额外的用户。对于那些这样做的人来说，手动处理奖励一点也不痛苦。如果我花时间召唤出所有的边缘案例，并使这个过程自动化，那么就不值得投入这些时间了。\n在我的任务管理系统中，我使用一个标签(🍏)来表示哪些任务是容易摘到的果实。对于外行来说，低垂的水果是很容易完成的快速任务，比如俏皮话或5分钟的修复。\n我发现，把这些放在身边，在你感觉通常没有动力的日子里处理它们，真的可以帮助你振作起来。仍然能够完成和发货是走出低迷的一种很好的方式。\n在午餐钱，很大一部分业务是使用Play的服务进行银行同步。Played按月收费，这意味着如果用户在4月30日注册，立即连接银行账户，但在14天的试用结束后没有订阅，他们将在4月份和5月份的发票上向我收取该用户的费用。\n这一认识，再加上我强烈反对支付超出我所需的费用，形成了很多用午餐钱买东西的做法。\n例如，数据保留政策过去是30天，这意味着如果您的试用结束，而您没有输入您的账单信息，您的数据将在30天内被删除。这肯定会保证我会为流失的用户支付过高的费用，这也是为什么数据保留政策后来被修改为5天的原因。\n总体而言，没有订阅的用户可以在午餐钱系统中花费长达26天的时间。这包括14天的试用期，可能延长1周的试用期和5天的宽限期。假设有足够多的用户连接他们的银行账户，将流失用户的成本降到最低的最好方法是确保他们的生命周期在一个日历月内。\n因此，我总是把博客帖子和产品发布等营销活动安排在每月的头几天。当我意识到这一点时，我的下一张格子布钞票第一次被否决了。\n更进一步说，新用户激增的好处是，他们的试用期或多或少是重叠的。通常，当新用户注册时，他们会查看产品，可能会发送错误报告、功能请求或其他反馈。如果我在几天内回复并解决他们的反馈，给他们安装补丁或交付他们要求的功能，他们最终往往会变成一个满意的客户。\n因此，我确定了以下周期，以最大限度地提高用户注册高峰带来的潜在转化率：\n在市场推广之后，比方说产品发布，我会看到注册人数立即增加，持续大约3天，然后慢慢减少。\n在接下来的几天里，我将通过支持票开始收到这些新用户的来信。我会优先回复他们，然后我就可以开始工作了。向这些用户表明，我致力于根据他们的反馈来增加午餐费用，这是一个伟大而诚实的销售策略。\n在第一波用户试用结束前大约3天，我结束了我的工程冲刺，并发送了一份时事通讯，详细介绍了最新的功能和改进。这再次向新用户强调，该产品正在持续开发中。\n最后，我有一个滴注活动，它会在用户试用到期前几天和实际到期日期自动通知用户。这段时间通常是我看到大多数用户转换🤞的时候。\n我曾经认为，如果我要雇一个人，首先应该是一名客户支持代理，但后来我改变了这个想法。用户经常感到惊讶(以一种好的方式！)。当他们意识到创始人正在直接响应他们的错误报告或功能请求时。\n始终如一地提供优质的客户支持是对午餐钱的长期投资，因为这无疑是将客户转变为冠军的一种很好的方式。在我接收和响应支持票证的同时，我还能够识别和检修用户的常见问题来源。\n我一直认为，客户支持将是业务中最重要、最难扩展的部分，特别是如果我的目标是保持一家只有一家公司的公司。\n根据EmailMeter和我的数据库中的数据，我的更改似乎正在发挥作用。尽管用户基础不断增长，入站支持电子邮件仍然相当稳定！\n反馈按钮位于每页的右下角。点击它会打开一个文本区，用户可以在其中提交功能请求、问题、错误报告或任何他们脑海中想要的东西。然后，我的服务器将反馈与相关用户信息捆绑在一封电子邮件中，并直接发送到我的收件箱。\n我练习清空收件箱，我把我的电子邮件视为待办事项清单。我个人的哲学是，任何未存档的电子邮件都有一个行动在等着我。从一开始，对我来说，将支持电子邮件与我在收件箱中收到的任何其他电子邮件结合起来是有意义的，因为我对它们的重要性都是平等的。\n在过去的3个月里，我每周都会收到100多张支持票。虽然我仍然可以在合理的时间内回复每个人，但每天醒来看到我的主收件箱里都是未读的电子邮件并不是最好的。\n优先级顺序是按接收日期排序的，该日期表示时间的实际紧急程度为0%。\n为了解决这些问题，我修改了支持流程，让用户自己挑选支持票证，并在Gmail中设置了一些简单的过滤器：\n有了这个系统，支持票证将放在我的电子邮件中的各个文件夹中，但会跳过我的收件箱。\n内置的优先级系统也很有帮助。例如，我会比功能请求更频繁地查看错误报告，因为错误报告可以表示应用程序中的严重问题，而功能请求通常是“很好拥有的”，不需要我立即关注。\n虽然通过添加FAQ页面可以快速识别和处理常见问题，但需要个性化支持的常见问题要概括起来有点棘手。在午餐钱的情况下，我收到了很多与银行同步有关的支持票。\n用户：我的大通账户有问题。我：你有什么问题？用户：我没有收到交易。我：请告诉我您遗漏的一笔交易样本，我会帮您查的。\n在问题进入解决阶段之前，至少交换了3封电子邮件。\n最终，我实现了一个特定的支持流来解决99%出现的问题。我让他们可以从他们同步账户的详细信息弹出窗口中访问到这一点，如果有什么不对劲的话，人们会在那里四处打听。\n该流程贯穿银行同步问题(帐户余额错误、交易丢失、同步延迟等)的常见场景。它在允许用户提交票证之前提供例程解决方案，或者在提交时请求特定的附加信息。\n例如，一个常见的问题是持久化2FA会导致Play频繁断开连接。当用户选择“我的帐户不同步”选项时，他们会看到这个通知，而不是现在从我这里听到。一旦他们确认2FA不是问题所在，他们就可以提交支持工单。\n在我开始为午餐钱工作后不久，我还为两家不同的公司做自由撰稿人(当我在国外生活在一个新城市时，我很兴奋地发现了这一点)。由于一天中醒着的时间有限，而且我有那么多需要和想要做的事情，我最终变得非常擅长上下文切换。\n我每天早上7：30起床，参加一家公司的站立会议。到上午11：30，我为两家公司总共工作了4个小时，正好赶上去健身房和吃午饭。午饭后，我去了一个联合工作区，在那里我会完成所有剩余的自由职业工作，然后再把下午和晚上剩下的时间花在午餐钱上。我花了7个月的时间兼顾所有3个项目，直到我最终决定是时候全职做我自己的项目了。\n这种激烈的上下文转换和自律的实践训练了我成为独奏家的生活。能够在一眨眼的时间内在工程、营销和客户支持之间切换，有助于提高我的整体时间效率，不断地意识到更大的图景是我完成一项乏味任务的动力来源。\n当我在高中的时候，我记得有人告诉我，在两个平等的候选人中-一个平均水平为99%，没有课外课程，另一个平均水平为89%，在不同的俱乐部有大量的从属关系，后者是被医学院录取的那个。这是因为医学院不想要一个专心学习的人，因为在压力大的时候，他们可能会发疯，而那些刻意为兴趣腾出时间的人很可能会脚踏实地。\n嗯，我还没有接近上医学院，但我觉得这一课对任何高压力的职业都是可以吸取的。毕竟，身兼数职的人本质上是多才多艺的。\n拥有与工作无关的爱好真的很有帮助。自2019年7月以来，我一直在参加面授课程，以加强我的普通话。虽然在工作日每隔一天抽出2个多小时并不总是受欢迎的，但我通常会因为走出家门或专注于与工作无关的事情而感觉良好，这让我能够更清晰地回到工作中来。\n尽管我觉得我不会去R&A；R；，我宁愿整个周末都在编写代码，但我知道，稍微抽出一点时间，专注于我最近没有时间的爱好会很好，比如：-探索自然🏞️-阅读📚-赶上我的普通话研究🇹🇼。\n-任(@午餐袋)2020年2月22日。\n作为一家只有一个人的公司，残酷的事实是，公司的成功高度依赖于我，无论是有意还是无意，我允许它取得多大的成功，公司就会取得多大的成功。\n但成功也是由我定义的，可以有多个层次，每个层次都是值得庆祝的理由。有一个支持我的伙伴和父母愿意和我一起庆祝所有的里程碑，无论是大的(500名用户)还是小的(5名用户)，我感到非常幸运。\n最后，我讨厌把午餐钱称为工作，因为我觉得它不符合通常与工作相关的情绪。我更愿意把它等同于能够整天玩电子游戏，并为此获得报酬。有时我会达到一个很高的水平，但那只会让我想要坚持下去。真正享受你所做的事情是最好的优化，会带你走得更远。", "note_en": "Hello! 👋 My name is Jen and I’m the founder, engineer, designer and customer support at  Lunch Money, a personal finance and budgeting web app.\n In short, I am a company of one. I answer the customer support emails and I code and deploy new features. I also manage the  API docs and  knowledge base, poke around the logs when there are issues, write the  bi-monthly newsletters and I designed the logo!\n As the company scales, so too must all aspects of my work which I break down into 4 parts: customer support, engineering, product and marketing.\n Finding opportunities for process optimization is honestly one of the more fun parts of running a business. I greatly attribute these to how I’ve been able to stay both solo &amp; sane up until now, currently with 600+ users and $45,000 ARR. In this post, I’m excited to share some of my most successful strategies along with anecdotes from my experience working on Lunch Money.\n  In the last 14 days, here’s what I got done across all departments:\n Product: Launched an internal beta testers program and two sets of new features to test\n      Marketing: Added new pages to the marketing site ( Rules and  Collaboration) and updated the icons in  Features\n What makes all this work bearable for me is the fact that there is so much variety (which, of course, is the spice of life!). I love being able to switch between tasks to keep the job interesting and my mind refreshed while still being productive overall.\n Case in point: I just finished a major refactor and pushed out 2 major features to beta, so writing this blog post right now feels like a vacation for my brain.\n To state the obvious, I enjoy being hyper-efficient (without burning myself out, of course). Even though I am a single person, I can still automate, optimize and parallelize processes.\n   Ah, the blissful beginnings of Lunch Money when I’d push code directly to production several times a day.\n At 500+ users now, those days are long gone and I’ve since needed to adopt the more boring but responsible approach of implementing safeguards to prevent shipping faulty code.\n For one,  I’ve been thoroughly reviewing my own code before every change. Every major feature, improvement and bug fix lives in a feature branch that I still, by habit from the corporate days, prepend with  jen/. After verifying everything works great locally, I make sure to take a break first, whether that’s working on a completely unrelated task, going for a meal or going to bed. The point of this is to ensure that I’m code reviewing with a clear head.\n While adhering to these standards of code reviewing myself may add extra time to my overall process, it potentially saves hours of bug-fixing, answering related support tickets and self-loathing (I’m half-kidding here) down the line if I accidentally ship bad code.\n New phase of Lunch Money– no more pushing major features straight to production 🤯😂  https://t.co/RYsz7BnU3L\n— Jen (@lunchbag)  May 3, 2020\n I also recently implemented an internal beta-testing program open to Lunch Money subscribers. With more users accessing my app on a regular basis, the stakes are higher to ship a version that’s as bug-free as possible.\n As an engineering team of one, it’s nearly impossible to always get it right the first time, despite having tests (what if I missed an edge case?) or testing locally extensively (how I think my users will use a feature is not always so).\n The beta-testing program has provided some additional benefits. It’s nice to have a cohort of users with whom I can have a more candid conversation about Lunch Money and it’s also a great way to show users that their feedback is valued!\n  While automating tasks can save a lot of time in the long-term, it doesn’t always make sense to automate right off the bat.\n  Automating too late is not a bad thing. I’ll have done the manual work enough times to understand how to eventually automate the task and what edge cases to look out for. I equate it to doing a job yourself before hiring someone– it’s always better to grok the requirements first to some degree so you can understand how to best utilize who you’ve brought on (and appreciate them more!).\n I manually triggered the emails for bi-monthly account summaries for months because I wasn’t confident the sending cadence was reasonable. After observing open rates and collecting user feedback, these are now automated to go out on the 5th &amp; 25th of every month.\n Something that I’m glad I didn’t spend the time to automate at all was the referral program. If an existing user refers a new user and the new user subscribes to a plan, then both users will receive credit for 1 month.\n In the end, the referral program only brought on 11 extra users. It was not a pain at all to manually process rewards for those who did. If I had spent time conjuring up all the edge cases and automating this process, it would not have been worth the time investment.\n  In my task management system, I use a tag (🍏) to denote which tasks are low-hanging fruits. For the uninitiated, low-hanging fruits are quick tasks that are easy to knock out, such as one-liners or 5-minute fixes.\n  I find that keeping these around and tackling them on days when you feel generally unmotivated can really help raise spirits. Still being able to get something completed and shipped is a great way to get out of a slump.\n   At Lunch Money, a big part of the business is using the services of Plaid for bank syncing. Plaid charges on a monthly basis which means that if a user signs up on April 30, connects a bank account immediately and doesn’t end up subscribing at the end of their 14-day trial, they will charge me for this user in both April &amp; May’s invoices.\n This realization coupled with my intense aversion to paying more than I need to has shaped a lot of practices at Lunch Money.\n For one, the data retention policy used to be 30 days which means if your trial ends and you didn’t put in your billing information, your data will be deleted in 30 days. This certainly guarantees that I’ll be overpaying for churned users and is the reason why the data retention policy has since been revised to 5 days.\n In total, a user who does not end up subscribing can spend up to 26 days in the Lunch Money system. This comprises of a 14-day trial, the potential for a 1 week trial extension and a 5 day grace period. Assuming enough users connect their bank accounts, the best way to minimize my costs for churned users is to ensure their lifetimes are within one calendar month.\n  As a result, I always schedule marketing pushes such as blog posts and product launches in the first few days of the month. When I came to this realization, my next Plaid bill went down for the first time.\n  Taking this a step further, the perk of having a spike in new users is that their trial periods more-or-less overlap. Usually when a new user signs up, they will poke around the product and maybe send in a bug report, a feature request or another piece of feedback. If I reply and address their feedback by putting in a fix or shipping their requested feature within days, more often than not, they end up converting into a happy customer.\n I’ve therefore identified the following cycle to maximize potential conversions from spikes in user signups:\n  After a marketing push, let’s say a product launch, I will see an immediate increase in signups lasting about 3 days and then slowly trailing off.\n Over the next few days, I’ll start hearing from these new users via support tickets. I prioritize responding to them and I get to work. Showing these users that I’m committed to improving Lunch Money based on their feedback is a great and honest sales tactic.\n About 3 days before the initial wave of user trials ends, I wrap up my engineering sprint and send out a newsletter detailing the latest features and improvements. This re-enforces to new users that the product is under continuous development.\n Finally, I have a drip campaign that automatically notifies users a few days before their trial expires and on the actual date of expiry. This period of time is when I typically see most users convert 🤞.\n  I used to think that if I were to hire someone, it would first be a customer support agent but I’ve since been moving away from that idea. Users are constantly surprised (in a good way!) when they realize the founder is responding to their bug reports or feature requests directly.\n Consistently providing great customer support is a long-term investment for Lunch Money as it is undoubtedly a great way to turn customers into champions. As I receive and respond to support tickets, I’m also able to identify and overhaul the common sources of trouble for users.\n I’ve always believed that customer support would be the most important and the hardest part of the business to scale, especially if I have the goal of staying a company of one.\n Corroborating data from  EmailMeter and my database, it seems my changes are making a difference. Despite a growing user base, inbound support emails remain fairly steady!\n   A feedback button is located at the bottom right corner of every page. Clicking on it opens up a text area wherein users can submit feature requests, questions, bug reports, or whatever else is on their mind. My server then bundles up the feedback with relevant user information into an email and sends it directly to my inbox.\n   I practice inbox-zero and I view my email as a To-Do list. My personal philosophy is that any unarchived email has an action waiting on me. From the beginning, it made sense for me to combine support emails with any other emails I would get in my inbox because I weigh them all equally in importance.\n I’ve been consistently receiving over 100 support tickets every week for the last 3 months. While I can still reply to everyone within a reasonable amount of time, it wasn’t optimal to wake up every day to my main inbox full of unread emails.\n   Priority order was by date received which is indicative of the actual urgency 0% of time.\n To address these, I revamped the support flow to have users triage their own support tickets and I set up some simple filters in Gmail:\n  With this system in place, support tickets would land in respective folders within my email, but skipping my inbox.\n The built-in priority system is also helpful. For instance, I’ll look at bug reports more frequently than feature requests because a bug report can denote a serious issue within the app whereas a feature request is usually a “nice to have” and doesn’t require my immediate attention.\n   While common questions can be quickly identified and handled with the addition of an FAQ page, common issues requiring personalized support are a bit trickier to generalize. In Lunch Money’s case, I get a lot of support tickets related to bank syncing.\n  User: I am having issues with my Chase accounts.  Me: What types of issues are you having?  User: I am not getting transactions.  Me: Please let me know a sample transaction that you’re missing and I will look into it for you.\n There are at least 3 emails exchanged before the issue can enter the resolution phase.\n Eventually, I implemented a specific support flow to address 99% of the issues that arise. I made this accessible from the details pop-up of their synced account, where one would be poking around if something was amiss.\n  The flow runs through the common scenarios of bank syncing issues (wrong account balance, missing transactions, delayed syncing, etc). It presents routine resolutions before allowing the user to submit a ticket or requests specific additional information along with the submission.\n For instance, a common issue is that persistent 2FA will cause Plaid to lose connection frequently. Instead of hearing it from me now, users will see this notice when they select the “My account is not syncing” option. Once they confirm that 2FA is not the issue, then they will be able to submit a support ticket.\n    Shortly after I started working on Lunch Money,  I was also freelancing for two different companies (while living abroad in a new city I was excited to discover, no less.). With limited waking hours in a day and so much I both needed and wanted to do, I ended up getting really good at context-switching.\n I woke up at 7:30am every day to attend a stand-up meeting for one company. By 11:30am, I wrapped up 4 hours of work total for both companies just in time to go to the gym and eat lunch. After lunch, I headed over to a co-working space where I’d finish up any remaining freelancing work before spending the rest of the afternoon and evening on Lunch Money. I juggled all 3 for 7 months before I finally decided it was time to go full-time on my own project.\n  This intense context-switching and practice of self-discipline trained me for the life of a solopreneur. Being able to switch between engineering, marketing and customer support in the blink of an eye helps with my overall time efficiency and being constantly aware of the bigger picture is my source of motivation for getting through a tedious task.\n  When I was in high school, I remember being told that between two otherwise equal candidates– one having 99% average and no extra-curriculars and the other with 89% average and numerous affiliations with different clubs, the latter is the one who would get accepted to medical school. The reason is because medical schools do not want someone who is all about studying because during stressful times, they might go crazy whereas the one who deliberately makes time for interests will likely stay grounded.\n Well I didn’t get close to going to medical school, but I feel the lesson can be extracted for any high-stress career. A wearer of many hats is by nature well-rounded after all.\n Having hobbies that are not work-related is really helpful. I’ve been consistently attending in-person classes to strengthen my Mandarin Chinese since July 2019. While being pulled away for 2+ hours every other day during the work week isn’t always welcomed at the time, I usually feel good about getting out of the house or focusing on something that isn’t work-related and it allows me to get back to the grind with a clearer mind.\n Even though I feel that I’m not due for R&amp;R and that I’d rather code through the weekend, I know it’ll be good to get away for a little bit and focus on hobbies I haven’t had time for lately, like: - exploring nature 🏞️ - reading 📚 - catching up on my Mandarin studies 🇹🇼\n— Jen (@lunchbag)  February 22, 2020\n  As a company of one, the hard truth is that the company’s success is highly dependent on me and will only ever be as successful as I allow it to be, either intentionally or unintentionally.\n But success is also defined by me, and can have multiple levels each being a reason for celebration. I feel incredibly blessed to have a supportive partner and parents who are willing to celebrate all the milestones, both big (500 users) and small (5 users) with me.\n Lastly, I hate calling Lunch Money work because I don’t feel that it fits the sentiments generally associated with work. I’d rather equate it to being able to play video games all day and get paid for it. Sometimes I’ll hit a hard level but that only makes me want to keep going at it. Genuinely enjoying what you do is the best optimization and will take you far.", "posttime": "2020-10-30 01:58:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "optimizations", "title": "作为一体的公司进行优化", "title_en": "Optimizations as a Company of One", "transed": 1, "url": "https://lunchbag.ca/company-of-one/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "a79ecd56ecf782573d7db8a998c5a9b2.jpg", "infoid": 1032077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "橡树岭领导力计算设施(OLCF)的计算科学家正在利用NVIDIA GPU计算能力和BlazingSQL(一种使用SQL语言进行GPU加速查询的新引擎)来大幅加快大数据分析，例如他们为新冠肺炎的药物发现工作所需的大数据分析。\nOLCF已经与BlazingSQL，Inc.签订了合同。用于在OLCF峰会上部署、扩展和支持BlazingSQL平台。这将帮助需要在几秒到几分钟内查询海量数据的OLCF用户。与OLCF的合作将改善BlazingSQL在Summit上对Power9和GPU的支持，并使用UCF联盟的统一通信X(UCX)开源通信框架提供与NVIDIA Mellanox InfiniBand和下一代NVIDIA NVLink的更好集成。\n美国国家计算科学中心(NCCS)的计算科学家延斯·格拉泽说：“当你有几个兆兆字节的数据时，使用CPU上的查询来分类信息可能需要几个小时，如果不是几天的话。”“理想情况下，我们不应该等那么久。我们需要找到一种解决方案，使科学家能够及时分析大量信息，并利用Summit的图形处理器。“。\n该团队在过去一年中一直致力于在Summit上部署新的NVIDIA Rapids and Dask生态系统，并了解如何利用它来帮助OLCF用户处理应用程序。现在，他们的COVID模拟正是需要这样的解决方案。唯一缺少的是使用查询语言轻松访问、操作和排序他们正在使用的数据集的方法。\n为了解决这一问题，该团队研究了金融和营销等商业应用程序如何处理大型结构化数据集的分析。他们发现，最近出现了一种新的解决方案，使他们能够利用Summit的强大功能和Rapids软件堆栈的速度：将BlazingSQL集成到Rapids/Dask生态系统中，提供一个GPU加速的开源平台来处理极快且可扩展的SQL查询以及其他数据分析。\n“科学模拟和实验可能涉及庞大的数据集。处理如此海量的信息需要足够的软件来扩展分析方法，这样数据就可以有效地分布在Summit的多个节点上，让我们能够重复查询输出数据，例如当我们应用新的机器学习模型时，“生物科学部生物物理学家、新冠肺炎高性能计算研究的联合负责人Ada Sedova说。由于研究小组试图找到针对新型冠状病毒的治疗方法，这个问题也找到了解决方案。\n随着今年SARS-CoV-2在世界各地肆虐，各地的科学家都在争先恐后地了解这种病毒，试图阻止它。\n研究人员几乎立即求助于OLCF-位于橡树岭国家实验室(ORNL)的美国能源部(DOE)科学办公室用户设施，也是美国最快的超级计算机Summit的所在地-试图帮助找到该病毒的弱点和可能对疗法开发有用的信息。\n模拟可能是这类研究的关键，但计算科学家必须经常将来自几个不同来源(如数据库)的大量信息与他们的模拟输出相结合，才能得出最终的解决方案。\n这些信息源加在一起产生了堆积如山的数据，这意味着即使是寻找给定列的最高值这样的基本操作，也需要科学家对大量记录进行排序。\n格拉泽解释说：“我们进行了这些大规模的模拟运行，使用Summit将分子对接到SARS-CoV-2病毒蛋白结构上，这产生了大量的数据，我们没有准备好查看、分类、处理和连接我们也需要的其他信息来源，如化学结构的数据，以完成分析。”\n虽然计算部分速度很快，但他们需要几天到几周的时间才能使用基于CPU的数据库软件完成分析部分，因为每次大规模计算都会产生1.3TB的表格数据。\n部分研究是在配备了高内存CPU和NVIDIAV100GPU节点以及32 GB HBM2的新Summit橱柜中进行的，这些节点是几个月前购买的，由美国能源部通过CARE法案为新冠肺炎相关研究提供补充联邦资金。\nORNL计算机科学和数学部高级研究员奥斯卡·埃尔南德斯表示：“新冠肺炎成为一个完美的案例研究，不仅是因为数据量大，还因为我们需要处理这些数据的紧迫性。”\n这项技术还可以证明在其他领域特别有帮助，例如化学信息学、辐射物理，甚至监测Summit自己的能效和系统性能。\nHernandez说：“这些字段中的一些会生成大量数据，当这些数据可以实时导航时，这些数据会更加强大和有用。”\n通过使用BlazingSQL，该团队能够展示出在TPCx-BB基准(零售商环境中的合成数据集)的基础上，拥有27个Summit新的高内存节点的最快商业解决方案相比于TPCx-BB基准提高了10倍。几乎同时和独立地，NVIDIA使用他们最新一代的NVIDIA A100张量核心图形处理器，在类似的基准测试中实现了近20倍的加速，这表明这项技术才刚刚开始打破纪录。\n该团队已经在邀请其他人参加会议。他们在10月15日举办了一个仅限受邀参加的研讨会，以展示“一个虚拟化学信息学实验室，它使用Summit超级计算机使用GPU分析大量数据”，并结合了使用Jupyter笔记本运行数据科学和利用Summit的GPU计算平台和互连进行交互分析。OLCF的Slate资源使在浏览器中启动Jupyter笔记本并通过笔记本连接到Summit的能力成为可能。\nOLCF AI Analytics Scalable Methods小组的计算机科学家Benjamín Hernández说：“Jupyter笔记本电脑和可扩展GPU加速的Python框架是OLCF的AI、ML和Data Analytics软件堆栈中的两个新产品，我们的用户过去曾热情地要求提供这两个产品。”\n通过这次研讨会，我们有机会向在创新和新颖的计算对理论和实验的影响(INSTITE)、高级科学计算研究(ASCR)的领导计算挑战(ALCC)、亿级计算项目(ECP)和加速应用准备中心(CAAR)工作的团队介绍这些框架。我们希望在不久的将来能够在我们的用户群体中更广泛地推广这些产品。“。\n组织者说：“与会者听到我们的供应商和OLCF在这次研讨会上展示了对GPU加速的Python数据生态系统的坚定承诺，感到非常兴奋。”\nUT-Battelle LLC为美国能源部科学办公室管理橡树岭国家实验室，该实验室是美国物理科学基础研究的最大单一支持者。能源部的科学办公室正在努力解决我们这个时代一些最紧迫的挑战。有关更多信息，请访问https://energy.gov/science。", "note_en": "Computational scientists at the Oak Ridge Leadership Computing Facility (OLCF) are using the power of NVIDIA GPU computing and BlazingSQL, a new engine for GPU-accelerated queries using the SQL language, to substantially speed up big data analysis, such as is needed for their work on drug discovery for COVID-19.\n OLCF has contracted with  BlazingSQL, Inc. for work on deploying, scaling, and supporting the BlazingSQL platform on OLCF Summit. This will help OLCF users who need to query massive amounts of data in seconds to minutes. The work with OLCF will improve BlazingSQL’s Power9 and GPU support on Summit as well as provide better integration with NVIDIA Mellanox InfiniBand and next-generation NVIDIA NVLINK using the UCF Consortium’s Unified Communication X ( UCX) open source communication framework.\n “When you have several terabytes of data, using queries on CPUs to sort information can take hours, if not days,” said Jens Glaser, computational scientist at the National Center for Computational Sciences (NCCS). “Ideally, we shouldn’t have to wait that long. We needed to find a solution that would allow scientists to analyze large amounts of information in a timely manner and make use of Summit’s GPUs.”\n The team had been working over the past year to deploy the new  NVIDIA RAPIDS and Dask ecosystem on Summit and understand how it could be leveraged to help OLCF users with applications. Now their COVID simulations required exactly such a solution. The only thing missing was a way to use query language to easily access, manipulate, and sort the datasets they were working with.\n To solve this, the team looked at how commercial applications such as finance and marketing approach the analysis of large structured datasets. They found that recently a new solution had emerged that would allow them to leverage the power of Summit and the speed of the  RAPIDS software stack: the integration of BlazingSQL into the RAPIDS/Dask ecosystem, providing a GPU-accelerated open-source platform to process extremely fast and scalable SQL queries, along with other data analytics.\n  “Scientific simulations and experiments can involve enormous datasets. Working with such large amounts of information requires adequate software for scaling methods of analysis, so data can be distributed efficiently across multiple nodes of Summit, letting us query the output data repeatedly, for instance when we apply a new machine learning model,” said Ada Sedova, a biophysicist in the Biosciences Division and co-lead on COVID-19 high-performance computing research. As a result of the team’s work trying to find therapeutics against the novel coronavirus, this problem found a solution as well.\n  As SARS-CoV-2 tore through the world this year, scientists everywhere raced to understand the virus in an attempt to stop it.\n Almost immediately, researchers turned to OLCF—a US Department of Energy (DOE) Office of Science user facility located at the Oak Ridge National Laboratory (ORNL) and home to the nation’s fastest supercomputer, Summit—to try to help find the virus’s weak spots and information that could be useful in the development of therapeutics.\n Simulations can be key to this type of research, but computational scientists must often combine large amounts of information from several different sources, such as databases, together with their simulation output to arrive at a final solution.\n Together, these sources of information produce a mountain of data, which means that even basic operations, like finding a given column’s top value, require scientists to sort through a massive set of records.\n “We had done these large simulation runs, using Summit to dock molecules to SARS-CoV-2 viral protein structures, which yielded an enormous amount of data that we were not prepared to look at, sort, manipulate, and join with other sources of information that we also needed, such as data on chemical structures, to finish the analysis,” explained Glaser.\n Although the computational part was fast, they were looking at days to weeks to finalize the analysis portions using CPU-based database software, as each of these large-scale calculations produced 1.3 terabytes of tabular data.\n Part of the research was run in the new Summit cabinets furnished with high-memory CPUs and NVIDIA V100 GPU nodes with 32 GB of HBM2, bought a few months earlier with supplemental federal funding for COVID-19-related research provided by the DOE through the CARES Act.\n  “COVID-19 came to be the perfect case study, not only because of the amount of data but also because of the urgency with which we needed to process it,” said Oscar Hernandez, senior researcher in ORNL’s Computer Science and Mathematics Division.\n The technology could also prove particularly helpful in other domains, such as cheminformatics, radiation physics, and even monitoring Summit’s own energy efficiency and system performance.\n “Some of these fields generate a lot of data that is more powerful and useful when it can be navigated in real time,” said Hernandez.\n By using BlazingSQL, the team was able to demonstrate a ten-fold improvement on the TPCx-BB benchmark, a synthetic dataset in the context of retailers, over the fastest commercial solution on CPUs, with 27 of Summit’s new high-memory nodes. Almost simultaneously and independently,  NVIDIA achieved a  nearly  20-fold speedup on  a similar  benchmark using their latest generation of NVIDIA A100 Tensor Core GPUs, showing that this technology is only just getting started breaking records.\n The team is already inviting others to the table. They held an invitation-only workshop on October 15th to demonstrate “a virtual cheminformatics lab that uses the Summit supercomputer to analyze massive amounts of data using GPUs” and incorporates interactive analysis using Jupyter Notebooks for running data science and taking advantage of Summit’s GPU computing platform and interconnects. The ability to launch a Jupyter notebook in a browser and connect to Summit through the notebooks was made possible by OLCF’s Slate resource.\n “Jupyter notebooks and scalable GPU-accelerated Python frameworks are two new offerings in OLCF’s AI, ML, and Data Analytics software stack, that our users have requested enthusiastically in the past,” said Benjamín Hernández, computer scientist in OLCF’s AI Analytics Scalable Methods group.\n “With this workshop, we had the opportunity to introduce these frameworks to the teams working in the Innovative and Novel Computational Impact on Theory and Experiment (INCITE); the Advanced Scientific Computing Research’s (ASCR) Leadership Computing Challenge (ALCC); the Exascale Computing Project (ECP); and the Center for Accelerated Application Readiness (CAAR). We expect to be able to promote these offerings more broadly among our user community in the near future,” he added.\n The organizers said that “participants were thrilled to hear about the strong commitment to the GPU-accelerated Python data ecosystem that was demonstrated by our vendors and the OLCF at this workshop.”\n UT-Battelle LLC manages Oak Ridge National Laboratory for DOE’s Office of Science, the single largest supporter of basic research in the physical sciences in the United States. DOE’s Office of Science is working to address some of the most pressing challenges of our time. For more information, visit   https://energy.gov/science .", "posttime": "2020-10-30 01:58:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加速,speeds,数据", "title": "BlazingSQL使用GPU加速的SQL加速Summit超级计算机上的查询", "title_en": "BlazingSQL Speeds Up Queries on Summit Supercomputer with GPU-Accelerated SQL", "transed": 1, "url": "https://www.olcf.ornl.gov/2020/10/28/in-a-groundbreaking-move-summit-joins-forces-with-blazingsql-to-speed-up-data-query-processing-on-supercomputers/", "via": "", "real_tags": ["加速", "speeds", "数据"]}, {"category": "", "categoryclass": "", "imagename": "5edc25cfdff6110cfb5a250368f8e1c0.png", "infoid": 1032076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的讲座大约进行了一半，我从这个网站上学到了很多东西。我希望Quantopian能有某种方式生存下去。\n在您的帐户设置中有一个“下载代码”按钮，允许您下载压缩文件中的所有代码。\nQ公司是否提供替代服务，例如Q公司，作为付费服务？\n我试着把所有有价值的帖子打印成PDF，作为我在这里与大家共度美好时光的回忆。：-)。\n非常想了解你们是否会提供一些收费服务：)让我们知道伙计们！！\n在您的帐户设置中有一个“下载代码”按钮，允许您下载压缩文件中的所有代码。\n要下载代码&#34；请转到=&gt；Account=&gt；Edit Account=&gt；Account选项卡=&gt；向下滚动(您将看到下载按钮)。\n我的讲座进行到一半：(我很难过地利用这些讲座自学定量金融，我非常享受它们，现在感到迷失了。)\n@Thomas Chang，你能解压这个zip文件吗？解压zip文件时遇到错误。\n下载整个论坛的按钮在哪里？这里有这么多有价值的信息，会不会都消失得无影无踪了呢？\n我可以下载该zip文件，但一旦它放到我的计算机上就无法打开。\n感谢Q这么多年来为我们提供了一个免费的平台！我在这里学到了很多，看到它走了我很难过。\n@Tentor，谢谢。我再次尝试下载，但在解压缩文件时仍然出现错误(代码-0x80070057)。我有超过23,000份文件。其中一些是基金算法。\n感谢Quantopian多年来所做的一切。我祝你在新的专业服务中一切顺利。\n感谢Quantopian所做的一切。在这个平台上的这一年里，我学到了很多东西。你确实让我的生活变得更好了。\n馊主意。就像现在一样，你可以把这个网站货币化，然后添加更多的内容。\n我同意曼纽尔的观点。这很令人难过，但事实就是这样。QUANT梦想将继续活在我们的心中：D。\n刚刚解决了下载问题。支持人员提供了帮助。很明显，我的存档工作卡在服务器上了。如果遇到类似问题，请与支持部门联系。\n这是非常不和谐的。如果能提前几周通知我们，我们将不胜感激！什么地方突然出了问题？？\n这一突如其来的举动背后的原因是什么？如果是财务问题，请记住，这里的许多人都愿意为众筹活动提供资金。我个人会发起这项活动，并找到支持这个网站的机构！你们已经为社区做了很多事情，社区能够并且将会帮助维护这个网站。\n正如Mark在上面提到的，QuantConnect是一个很好的选择。他们提供免费的在线回溯测试、研究环境和实时交易。这就是QP关闭网站上的功能后，很多社区都去进行实时交易的地方。它可能有点难学，但有很多相似之处。对于那些交易股票以外的资产类别的人，它还提供期权、期货、外汇和密码数据。\n谢谢你的零通知。真令人失望。Quantopian启动了我的职业生涯，所以我不能那么生气。很遗憾看到这一切发生。祝大家好运！\n对于任何感兴趣的人来说，我已经加入了Numerai社区，大约从今年3月开始。这是一个有趣的学习、赚取和燃烧的地方(核磁共振)。就像Quantopian是学习定量金融的好地方一样，Numerai也是学习定量金融领域的数据科学和机器学习的好地方。希望在那里见到你们中的一些人。\n让我们继续前进，谁将是下一位接手冒险、重启前途无量的新社区的挑战者？现在就有机会可以抓住！\n看到这样的事情发生，我感到非常难过。我想我是幸运的，因为我已经使用Zipline和Pyfolio转换到我自己的服务器和数据进行回测。如果有人需要帮助，请随时来找我。我最近还在我的Youtube频道上创建了几个视频，介绍如何在本地设置和运行Zipline和Pyfolio，如果它对任何人有帮助的话：https://www.youtube.com/c/ErolAspromatis。\n通读这一切，人们对付费替代方案感兴趣。我经常想知道Quantopian如何在没有收入的情况下支持它提供的那种服务。是否有付费的Quantopian替代方案，例如仅限会员使用的Quantopian？我很乐意订阅这个网站。像许多人一样，我有关键的代码，实际上每天都在用来做出投资决策。\n这些天很难与AI Quants竞争。Q是我第一次尝试Python，一开始我讨厌它，后来我开始喜欢它了。希望YY&#39；的所有Python技能都能用于其他行业的数据分析。\n哈哈，是的，这是个坏消息。我不知道是否只有一种算法被发现，它击败了所有其他算法，所以这个平台的目标已经达到了还是什么。如果Quantopian使用专有API，下载您的代码有什么好处？\n至少你的学习材料和论坛会保持可用状态吗？这是一个开始学习的好地方，只要把材料放在网上就不会造成成本或人力费用。如果您能将这些服务留在网上，我将不胜感激！\n非常感谢您这么多年的服务！祝你在前进的道路上好运！\n@John Fawcett，感谢您和您的团队。我对你们多年来所做的工作深表赞赏。特别感谢您的“下载”按钮。\n也感谢所有参与了我参加的各种讨论的人。我会想念你们所有人的。这是一次有趣的旅行。\n就在昨天，我们使用zipline模拟器发布了我们的桌面即服务(Desktop-as-A-Service)，它支持整个研究-回测-实时交易周期。查看：https://www.hotchilianalytics.com和我们的视频：https://www.youtube.com/watch?v=yFmNCDMb21w。\n我非常感谢Quantopian提供的资源，这是个令人难过的消息。也就是说，这份声明还有很多不尽如人意的地方。-为什么只有两周的通知？-为什么你不能让编辑开门，让人们在你关闭他们之前完成他们的项目？-你提供更换(付费)服务吗？显然不是？-这一变化的商业原因是什么？在冷落社区之前，你不认为你应该向社区做出任何解释吗？-社区需要一段时间来提升，也需要一段时间来降低(或者至少当它做得好的时候，他们应该这样做)。\n可怕的消息。听到Quantopian将不复存在，我很难过。希望讲座能在YouTube上保持不变。\n这是个坏消息。就像谷歌关闭了人们习惯的工具一样。这是一个不依赖于需要持续现金流的东西的例子。这是一件好事，来自www.Wealthlab.com的家伙们正在为期待已久的新WealthLab 7(WL7)而工作。没有人可以从您手中夺走桌面版本。同时，网络上也会有一些开发工具。我想这是最合适的组合了。讨论已经在此处开始：https://www.wealth-lab.com/Forum/Posts/The-future-of-WLD-40455和此处：https://www.wealth-lab.com/Forum/Posts/WL7-Sneak-Previews-40463.。欢迎加入！\n虽然免费社区平台正在消失，但我认为这标志着推动Live Portfolio产品的转变，并有可能进入经纪领域。我可能错了，但如果是这样的话，我会对未来和这个团队所做的事情感到兴奋。\n感谢您提供的所有信息和平台，让我们中的许多人能够涉足这个领域。一切顺利！\n显然，Quantopian找到了难以捉摸的阿尔法(可能来自社区内的某个地方)，现在他们把它私有化了？请原谅我的愤世嫉俗。在没有进一步信息的情况下，这种解释似乎是合理的。\n归根结底，钱总是赢的。把华尔街的场地夷为平地就是把大人物的场地夷为平地。谢谢\n如果是关于管理成本的问题，我们可以支付支持费用。然而，不知何故，我认为在未来的一段时间里，我们会知道事实，这将不会像纸条那样漂亮。恕我直言，我不使用这个平台，但我知道很多人使用这个平台。如果钱是问题所在，那就认为它已经解决了。如果您希望有人主持并保持其运行，请务必与我联系。最好的。\n非常感谢Quantopian的人们在过去几年的辛勤工作-如果没有Quantopian，就不会想到会有量化金融的职业生涯。\n也要向那些抨击全托邦不事先通知、突然行动、不提供理性理由等行为的人致谢。如果你只花5分钟在谷歌上搜索有关Quantopian的新闻，你就不会做出如此荒谬的言论。\n我确实非常怀疑这一点。任何在对冲基金工作了足够长时间的人都知道，投资没有真正的可重复的长期优势。看看近些年来CTA发生了什么。看看大多数对冲基金过去10年的表现吧。\n如果他们中了大奖，为什么要把钱还给史蒂芬·科恩呢？\n很可能没有人发现真正的、持久的阿尔法，所以他们正寻求将铲子卖给金矿工人。\n用电子邮件向我发送来自Quantopian社区的最新消息。我们大约每月发送一次这些电子邮件。\n我允许Quantopian查看此算法、Backtest或笔记本及其导入的数据集，以提供支持。", "note_en": "I was about halfway through the lectures and I&#39;ve been able to learn so much from this website. I hope there is some way for Quantopian to live on...\n There is a “Download Code” button in your account settings that allows you to download all of your code in a zip file.\n Is there an alternate service offered by Q, e.g. &#34;Q corporate&#34;, as a paid service?\n    I try to print all the valuable posts to PDFs as memories that I&#39;ve spent good time here with all of u. :-)\n Very keen to understand if you&#39;ll offer some billable service :) Let us know guys!!\n     There is a “Download Code” button in your account settings that allows you to download all of your code in a zip file.\n   To &#34;Download Code&#34; go to =&gt; Account =&gt; Edit Account =&gt; Account Tab =&gt; Scroll down (you&#39;ll see the Download button)\n    I am halfway through the lectures :( So sad I was using the lectures to teach myself quant finance, was enjoying them so much, feel lost now.\n    @Thomas Chang, were you able to extract the zip file? I ran into errors extracting the zip file.\n And where is the button that downloads the whole forum? So much valuable information here, will it all just vanish into oblivion?\n  I&#39;m able to download, but cannot open the zip file once it&#39;s on my computer.\n   Thanks Q for a free platform all these years! I learned a ton on here and sad to see it go.\n @Tentor, thanks. I tried downloading it again and still get an error (code - 0x80070057) when extracting the files. I have over 23,000 files. Some of those are fund algorithms.\n Thank you Quantopian for everything you did all of these years. I wish you the best with your new pro offering.\n Thank you Quantopian for everything. I learned a lot over the year i have been on this platform. You have definitly changed my life for the better.\n Bad idea. Just like it is, you can monetize the site and add some more content.\n I agree with Manuel. This is so sad but it is what it is. Quant dream will continue living in our hearts :D\n Just solved the download issue. The support folks helped. Apparently, my archive job was stuck on the server. Contact support if you have similar issues.\n This has been very jarring. A few weeks of notice would have been so much appreciated !!!!! What went suddenly wrong ??\n What is the reason behind this sudden move? If it is a financial issue, remember many of the folks here are willing to fund a crowdfunding campaign. I personally would set up the campaign and find institutions to back this site! You guys have done soo much for the community and the community can and will help to maintain the site....\n Like Mark mentions above,  QuantConnect is a good alternative. They offer free online backtesting, a research environment, and live trading. That&#39;s where a lot of the community went for live trading after QP shut down that functionality on the site. It can be a little tricky to learn, but has a lot of similarities. For those that trade asset classes other than equities, it offers options, futures, forex, and crypto data too.\n Thanks for the ZERO notice. How disappointing. Quantopian kickstarted my career so I cant be that mad... Sad to see this happen. Good luck to you all!\n  For anyone interested, I&#39;ve joined the  Numerai  community since around March of this year. It&#39;s a fun place to learn, earn, and burn (NMR). Just like Quantopian was a great place to learn about quant finance,  Numerai is a great place to learn about data science and machine learning in the quant finance domain. Hope to see some of you there.\n Let us go forward, who is the next challenger that will take over the adventure and restart a new community with a bright future? There is an opportunity to seize right now!\n Very sad to see this happen. Guess I&#39;m lucky as I&#39;ve already transitioned to my own server and data using Zipline and Pyfolio for backtesting. If anyone needs help, feel free to reach out to me. I&#39;ve also recently created a few videos on my YouTube channel on how to set up and run Zipline and Pyfolio locally if it helps anyone:  https://www.youtube.com/c/ErolAspromatis\n Reading through all of this, there is an interest in a paid alternative. I frequently wondered how Quantopian could support the kind of service it offered without income. Is there a paid alternative to Quantopian, such as a Members-Only Quantopian? I would gladly subscribe to this website. Like many, I have critical code actually being used daily to make investment decisions.\n Hard to compete with AI quants these days. The Q was my first foray into Python, which I hated at first, and then grew to enjoy. Hopefully y&#39;all&#39;s Python skills can be used for data analysis in other industries.\n Lol, yeah this is bad news. I don&#39;t know if there was just an algorithm that was found that beat out all the others and so the objective of this platform has been reached or what. What good is downloading your code if Quantopian uses a proprietary API?\n Will at least your learning material and forums stay available? This is a great place to start learning and just leaving the material online should not cause costs or manpower expenses. I would really appreciate if you could leave these services online!\n Thank you very much for so many years of service! And good luck with the road forward!\n    @John Fawcett, my thanks to you and your team. You all have my appreciation for the work you have done over the years. Special thanks for the “Download” button.\n Thank you also to all who engaged in the various discussions I participated in. I will be missing you all. It was an interesting journey.\n Just yesterday, we released our Desktop-As-A-Service that supports the full research-backtest-live trading cycle, using the zipline simulator. Check out:  https://www.hotchilianalytics.com and our video at:  https://www.youtube.com/watch?v=yFmNCDMb21w\n I have greatly appreciated the resource Quantopian has provided and this is sad news. That said, this announcement leaves a lot to be desired. - Why only 2 weeks notice? - Why can’t you leave open the editors and let people finish up projects before you shut them out? - Are you offering a replacement (paid) service? Apparently not? - What is the business reason for this change? Don’t you think you owe the community any kind of explanation before shutting them off cold? - Communities take a while to ramp up, and a while to ramp down (or at least they should, when it’s done properly.)\n Terrible news. Sad to hear Quantopian will be no more. Hopefully the lectures can be maintained on YouTube.\n  This is bad news. Just like Google closes down their tools that people got used to. It is an example not to rely on something that needed constant cash flow. It is a good thing that the guys from  www.wealth-lab.com are working on a long awaited new WealthLab 7 (WL7). No one can take a desktop version away from you. At the same time there will be some developing tools on the web. I think this is the combination to go. The discussion has started already here:  https://www.wealth-lab.com/Forum/Posts/The-future-of-WLD-40455 and here:  https://www.wealth-lab.com/Forum/Posts/WL7-Sneak-Previews-40463. Feel free to join!\n While the free community platform is going away, I believe this marks a transition to push the  Live Portfolio products and potentially move into the brokerage space. I may be wrong, but if this is the case I&#39;ll be excited for the future and what this team does.\n Thanks for all the information, the platform and allowing many of us to get our feet wet in this space. All the best!\n So apparently Quantopian found the elusive alpha (possibly from somewhere within the community), and now they are taking it private? Forgive my cynicism. Without further information, this explanation seems rational.\n  At the end of the day, money always wins. Leveling the wall street field was leveling it for the big guys. thanks\n If it&#39;s about the costs of managing it, we can pay to support. However, somehow I think that in time to come we will know the facts, which will be not as beautiful as the note. Apologies for being candid, I do not use this platform but I know so many who do. If money is the issue consider it resolved. Do contact me if you want someone to host it and and keep it running. Best.\n Many thanks to Quantopian folks for the hard work the past few years - wouldn&#39;t have thought of a career in quantitative finance if it weren&#39;t for Quantopian.\n Also to everyone who bashed Quantopian for giving no notice, making a sudden-move, providing no rational reason, and so on. If you just spent 5 minutes Googling news about Quantopian you wouldn&#39;t have made such ridiculous statements.\n I doubt that very much indeed. Anyone who has been in hedge funds long enough knows that there are no real repeatable long term edges in investment. Look at what has happened to CTAs in recent years. Look at the performance of most hedge funds over the past decade.\n Why would they have returned money to Steven Cohen if they had hit the jackpot?\n Highly probably no real, lasting alpha has been discovered by anyone and so they are looking to sell shovels to the gold miners.\n     Send me email updates with the latest news from the Quantopian community. We send these emails about once a month.\n I permit Quantopian to view  this algorithm,backtest or notebook and their imported datasets for the purpose of providing support.", "posttime": "2020-10-30 01:58:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "quantopian,community", "title": "Quantopian的社区服务即将关闭", "title_en": "Quantopian’s Community Services Are Closing", "transed": 1, "url": "https://www.quantopian.com/posts/quantopians-community-services-are-closing", "via": "", "real_tags": ["community"]}, {"category": "", "categoryclass": "", "imagename": "7b6293cf099b123bbd54cdf1fde6b09f.jpg", "infoid": 1032075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巨头们已经承认社区商店(夫妻店)在这个国家拥有强大的市场份额，并在最近几个季度争先恐后地寻找与它们合作的方法。印度首富穆凯什·安巴尼(Mukesh Ambani)在过去的一年里让这种动态变得更加有趣，因为他致力于帮助这些社区商店在线销售。\n但市场机会仍然太大，旧的零售业务有很多方面可能需要一些技术。这就是WareIQ，一家总部位于班加罗尔的Y Combinator支持的初创公司正在进行的押注。它刚刚从YC、FundersClub、Pioneer Fund、Soma Capital、Emles Venture Advisors和Flexport的创始人那里筹集了165万美元的种子融资。\n这家成立一年的初创公司运营着一个平台，以利用全国各地的仓库。它已经为这些仓库建立了管理系统，其中大多数主要从事线下B2B商务，以前几乎没有电子商务风险敞口。\nWareIQ联合创始人兼首席执行官Harsh Vaidya在接受TechCrunch采访时表示：“我们将印度各地的这些仓库连接到我们的平台，并利用它们的基础设施进行电子商务订单处理。”该公司将这项服务作为一项服务提供给零售企业。\n这些企业是谁？第三方卖家，其中一些向亚马逊和Flipkart销售，并使用WareIQ加快送货速度，时尚电商Nykaa等电商公司，Meesho等社交商务平台以及社区商店，以及社交媒体影响力人士。\n例如，任何在线商店都可以将其产品发送到WareIQ，WareIQ与几个流行的电子商务平台和市场集成在一起。Vaidya解释说，它与快递合作伙伴合作，将物品从一个仓库转移到另一个仓库，以提供最快的送货速度。\n由WareIQ缝合在一起的基础设施还使在线卖家能够建立自己的商店，并直接与客户打交道，从而节省了他们本应支付给亚马逊和其他老牌电商的费用。\n他表示：“卖家以前无法独自完成这项工作，因为这需要他们直接与维持自己严格合同和高安全性押金的仓储公司对话，而且他们仍需要与多家技术提供商合作，才能完成技术堆栈。”WareIQ还为这些卖家提供最后一英里的送货、现金收取和欺诈检测等几项服务。\n“在某种程度上，我们正在建立一个开源的亚马逊配送服务，任何卖家都可以将他们的商品送到我们的任何仓库，我们可以履行他们的亚马逊订单、Myntra订单、Flipkart订单或他们自己的网站订单。我们也遵守这些个人市场的标准，所以我们的卖家在亚马逊上得到了一个可靠的标签，“他说。\n他说，任何人都可以免费注册WareIQ，并按其处理的订单量收取费用。他说，这家初创公司目前与40多个履行中心合作，并计划部署新资本，将其网络扩展到二线和二线城市。它还在招聘一些技术职位。", "note_en": "The giants have acknowledged the strong hold neighborhood stores (mom and pop shops) have in the country, and in recent quarters  scrambled for ways to  work with them. Mukesh Ambani, India’s richest man, has made the dynamics more interesting in the past year as he  works to help these neighborhood stores sell online.\n But the market opportunity is still too large, and there are many aspects of the old retail business that could use some tech. That’s the bet  WareIQ, a Bangalore-headquartered, Y Combinator-backed startup is making. And it has just raised a $1.65 million Seed financing round from YC, FundersClub, Pioneer Fund, Soma Capital, Emles Venture Advisors, and founders of Flexport.\n  The one-year-old startup operates a platform to leverage the warehouses across the country. It has built a management system for these warehouses, most of which largely engage in offline business-to-business commerce and have had little to no prior e-commerce exposure.\n “We connect these warehouses across India to our platform and utilize their infrastructure for e-commerce order processing,” said Harsh Vaidya, co-founder and chief executive of WareIQ, in an interview with TechCrunch. The company offers this as a service to retail businesses.\n Who are these businesses? Third-party sellers, some of whom sell to Amazon and  Flipkart   and use WareIQ to speed up their delivery, e-commerce firms such as fashion e-tailer Nykaa, social commerce platforms such as Meesho as well as neighborhood stores, and social media influencers.\n Any online store, for instance, can send its products to WareIQ, which has integrations with several popular e-commerce platforms and marketplaces. It works with courier partners to move items from one warehouse to another to offer the fastest delivery, explained Vaidya.\n The infrastructure stitched together by WareIQ also enables an online seller to set up their own store and engage with customers directly, thereby saving fees they would have paid to Amazon and other established e-commerce players.\n “The sellers were not able do this on their own before because it required them to talk directly to warehousing companies that maintain their own rigid contracts, and high-security deposits, and they still needed to work with multiple technology providers to complete the tech-stack,” he said. WareIQ also offers these sellers last-mile delivery, cash collection, and fraud detection among several other services.\n “In a way, we are building an open source Amazon fulfilment service, where any seller can send their goods to any of our warehouses and we fulfil their Amazon orders, Myntra orders, Flipkart orders, or their own website orders. We also comply with the standard of these individual marketplaces, so our sellers get an assured tag on Amazon,” he said.\n WareIQ is free for anyone to sign up with any charge and it takes a cut by the volume of orders it processes. The startup today works with over 40 fulfilment centres and it plans to deploy the fresh capital to expand its network to tier 2 and tier 2 cities, he said. It’s also hiring for a number of tech roles.", "posttime": "2020-10-30 01:14:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,wareiq,合作", "title": "\n印度的WareIQ为其类似亚马逊的卖家送货平台筹集了165万美元", "title_en": "\n\t\t\t\tIndia’s WareIQ raises $1.65M for its Amazon-like delivery platform for sellers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/wareiq-raises-1-65m-for-its-amazon-like-delivery-platform-for-sellers-india/", "via": "", "real_tags": ["amazon", "亚马逊", "wareiq", "合作"]}, {"category": "", "categoryclass": "", "imagename": "9255fa8ca6b751661deb1027268a71d2.png", "infoid": 1032072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "拉普特夫海坐落在西伯利亚北海岸和俄罗斯的新西伯利亚群岛之间，被称为冰的发源地。每年秋天，冰在其海岸形成，然后被推到北冰洋向西进入格陵兰岛和挪威的斯瓦尔巴特群岛，春天在那里冰层破裂。每年，也就是说，直到这一次。自有记录以来，拉普特夫海自10月下旬以来首次没有开始结冰(见图表)。这只是气候变化如何迅速改变北极的最新例子。科学家们担心，它可能会对整个地区产生破坏性的连锁反应。\n延迟冻结是西伯利亚上半年史无前例的热浪造成的结果。创纪录的高温不仅助长了北极野火的爆发，烧毁了希腊大小的面积，还使海水变暖了5摄氏度以上，热量尚未消散，使拉普特夫海无法如期结冰。这种奇特的天气不是巧合。根据世界天气归因项目(World Weather Attribution Project)，一个分析气候变化和极端天气事件之间可能联系的科学家团队表示，如果没有气候变化，西伯利亚就不可能有炎热的气温。大西洋洋流的变化，也是气候变化的结果，可能也是造成冰缺乏的原因之一。\n拉普特夫海的困境是该地区更广泛变革的一部分。在过去的40年里，北极所谓的多年冰-在温暖的月份中幸存下来的海冰-的数量减少了一半。科学家们预计，很快可能根本就没有了。拉普特夫海正在发生的事情是这方面的一个严峻的伏笔。在20世纪80年代，多年的冰覆盖了三分之二的海洋；如今，冰可以一次消失几个月。这会导致海洋温度进一步上升，因为开阔的水域比冰保留了更多的热量。它还对北极脆弱的生态系统造成严重破坏，并可能威胁到北极浮游生物，后者在吸收二氧化碳方面发挥着重要作用。拉普特夫海的开阔水域是对快速变暖的世界后果的另一个警告。", "note_en": "THE LAPTEV SEA, nestled between the north coast of Siberia and Russia’s New Siberian Islands, is known as the birthplace of ice. Every year, ice forms along its coasts in the autumn before being pushed west across the Arctic Ocean to Greenland and Norway’s Svalbard archipelago, where it breaks up come spring. Every year, that is, until this one. For the first time since records began, the Laptev Sea has not begun to freeze by late October (see chart). This is only the latest example of how climate change is rapidly transforming the Arctic. Scientists worry that it could have damaging knock-on effects across the region.\n The delayed freeze is the result of an unprecedented heatwave in Siberia in the first half of the year. The record high temperatures, in addition to fuelling an outbreak of Arctic wildfires that have burned an area the size of Greece, have warmed ocean waters by more than 5°C. That heat has not yet dissipated, preventing the Laptev Sea from freezing on schedule. The peculiar weather is no coincidence. According to the World Weather Attribution project, a team of scientists that analyses possible links between climate change and extreme weather events, Siberia’s scorching temperatures would not have been possible without climate change. Changes to Atlantic currents, also the result of climate change, may also be contributing to the lack of ice.\n The Laptev Sea’s woes are part of a broader transformation in the region. In the last four decades, the amount of so-called multi-year ice—sea ice that survives the warmer months—in the Arctic has been reduced by a half. Scientists expect that soon there may be none at all. What is happening in the Laptev Sea is a grim foreshadowing of this. In the 1980s, multi-year ice covered two-thirds of the sea; these days ice can be absent for months at a time. This causes ocean temperatures to rise further, as open water retains more heat than ice. It also plays havoc with the Arctic’s delicate ecosystem and is likely to threaten Arctic plankton, which play an important role in absorbing carbon dioxide. The open water of the Laptev Sea is another warning of the consequences of a fast-warming world.", "posttime": "2020-10-30 01:08:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sea,可能", "title": "拉普特夫海没有结冰", "title_en": "The Laptev Sea hasn't frozen", "transed": 1, "url": "https://www.economist.com/graphic-detail/2020/10/28/more-bad-news-for-the-arctic-the-laptev-sea-hasnt-frozen", "via": "", "real_tags": ["sea", "可能"]}, {"category": "", "categoryclass": "", "imagename": "a25834e671f1317b78cd89cfeee6cb6d.png", "infoid": 1032071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“可知”杂志出自“年度评论”，这是一家致力于综合和整合知识以促进科学进步和造福社会的非营利性出版商。", "note_en": "Knowable Magazine is from  Annual Reviews, a nonprofit publisher dedicated to synthesizing and integrating knowledge for the progress of science and the benefit of society.", "posttime": "2020-10-30 01:08:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性交,joy,杂志", "title": "蜘蛛性交带来的不温和的快乐", "title_en": "The ungentle joy of spider sex", "transed": 1, "url": "https://knowablemagazine.org/article/living-world/2020/the-ungentle-joy-spider-sex", "via": "", "real_tags": ["性交", "joy", "杂志"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造\r帐目", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-10-30 01:08:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "因果关系,causality,创造", "title": "理解因果关系是机器学习面临的下一个挑战", "title_en": "Understanding Causality Is the Next Challenge for Machine Learning", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/artificial-intelligence/machine-learning/understanding-causality-is-the-next-challenge-for-machine-learning", "via": "", "real_tags": ["因果关系", "causality", "创造"]}, {"category": "", "categoryclass": "", "imagename": "c48ddc5e2c7328d89e9f62c5e2d86b4b.jpeg", "infoid": 1032069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么有些人的记忆力比其他人好？随着数字文化的爆炸，这个问题被赋予了新的意义，数字文化已经与记忆衰竭联系在一起。\n斯坦福大学研究人员在“自然”杂志上发表的一项新研究将习惯媒体多任务者的注意力疏忽与较差的记忆力联系起来，进一步阐明了这一点。\n那些报告同时使用多种形式数字媒体的人，比如一边看电视一边发短信和浏览社交媒体的人，在记住之前表现出的持续注意力更差，而且更容易忘记。\n根据主要作者凯文·马多尔的说法，虽然注意力的波动与学习、记忆和媒体多任务有关是合乎逻辑的，但令人惊讶的是，很少有研究探索我们在记忆之前做的事情是否会产生影响。\n与包括资深作者安东尼·瓦格纳(Anthony Wagner)在内的一组研究人员一起，马多尔使用了一种新的方法，通过记录瞳孔大小和大脑活动来评估持续注意力。\n他说：“你头骨后部阿尔法力量的增加与注意力疏忽、走神、分心等有关。”\n“我们也知道瞳孔直径缩小--特别是在你做不同的任务之前--与表现不佳有关，比如反应时间较慢，走神较多。”\n研究小组招募了80名年龄在18岁到26岁之间的成年人进行记忆任务，在此期间，他们使用脑电图(EEG)记录注意力转移和记忆的神经信号，并使用瞳孔测量法记录瞳孔大小。\n参与者保持注意力的能力是通过他们能够很好地识别图像中逐渐变化的情况来衡量的。\n他们在电脑屏幕上短暂地看到了物体的图像。在10分钟的延迟后，他们被展示了更多的图像，并被要求识别他们是更大还是更小，更令人愉快还是更不愉快，或者他们以前是否见过这张图像。\n他们还完成了问卷调查，以衡量他们处理多项媒体任务、冲动、日常注意力和走神的水平。\n结果显示，记忆前一刻的注意力疏忽会影响行为和神经记忆信号，并与更大的遗忘可能性相关。\n马多尔说，他们还表明，持续的注意力能力-这在重媒体一心多用的人中较差-可能在某种程度上解释了为什么有些人的记忆力比其他人好。\n马多尔说：“我认为人们对日常生活中媒体使用的积极、中立和消极影响的理解和意识不断增强。”\n“一些学者、教育家和公众表示，我们生活在一个‘注意力经济’中，我们应该注意如何与媒体打交道。我们的数据支持这一观点。“。\n“限制潜在的分心在准备记忆和减少我们不想要的走神或头脑空白方面很有用。”\n“在学校讲课或工作时，抵制媒体一心多用，或者将媒体一心多用限制在设定的时间内，也可能是有价值的。”\n从来没有比现在更重要的时间来解释事实，珍惜基于证据的知识，展示最新的科学、技术和工程突破。COSMOS由澳大利亚皇家学会(Royal Institution Of Australia)出版，该机构是一家致力于将人们与科学界联系起来的慈善机构。财政捐助，无论大小，都能在世界最需要的时候帮助我们获取值得信赖的科学信息。请今天捐款或购买订阅来支持我们。", "note_en": "Why do some people have better memories than others? This question has taken on new significance with the explosion of digital culture, which has been  associated with memory failure.\n A new study by Stanford University researchers,  published in the journal  Nature, has shed more light on this by linking attention lapses in habitual media multi-taskers to poorer memory.\n People who reported engaging in multiple forms of digital media at once, such as watching TV while texting and browsing social media, showed worse sustained attention just before remembering and were more likely to forget.\n While it’s logical that fluctuations in attention relate to learning, memory and media multi-tasking, surprisingly little research has explored whether the things we do before we remember might have an impact, according to lead author Kevin Madore.\n With a team of researchers, including senior author Anthony Wagner, Madore used a novel method of assessing sustained attention by recording pupil size and brain activity.\n “Increases in alpha power in the back of your skull have been related to attention lapses, mind wandering, distractibility and so forth,” he says.\n “We also know that constrictions in pupil diameter – in particular before you do different tasks – are related to failures of performance like slower reaction times and more mind wandering.”\n The team recruited 80 adults aged 18 to 26 for a memory task during which they recorded neural signals of attention lapsing and memory using electroencephalogram (EEG) and pupil size using pupillometry.\n Participants’ ability to sustain attention was measured by how well they were able to identify a gradual change in an image.\n They were briefly shown images of objects on a computer screen. After a 10-minute delay, they were shown more images and asked to identify if they were bigger or smaller, more pleasant or unpleasant, or if they had seen the image previously.\n They also completed questionnaires to measure their level of media multitasking, impulsivity, everyday attention and mind wandering.\n Results showed that attention lapses in the moment prior to remembering impacted on behavioural and neural memory signals and were associated with greater likelihood of forgetting.\n They also suggest that sustained attention ability – which was poorer in heavy media multitaskers – may go some way toward explaining why some people have better memories than others, says Madore.\n  “I think there is growing understanding and consciousness about positive, neutral and negative implications of media use in everyday life,” says Madore.\n “Some scholars, educators and members of the public have indicated that we’re living in an ‘attention economy’ and that we should be mindful about how we engage with media. Our data support this idea.”\n  “Limiting potential distractions can be useful in memory preparedness and reducing mind wandering or mind blanking that we don’t want.\n “Resisting media multitasking during school lectures or work zooms, or limiting media multitasking to set times, could also be valuable.”\n    There’s never been a more important time to explain the facts, cherish evidence-based knowledge and to showcase the latest scientific, technological and engineering breakthroughs. Cosmos is published by The Royal Institution of Australia, a charity dedicated to connecting people with the world of science. Financial contributions, however big or small, help us provide access to trusted science information at a time when the world needs it most. Please support us by making a donation or purchasing a subscription today.", "posttime": "2020-10-30 01:08:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,screening,注意力", "title": "多次筛查可能会扰乱你的记忆", "title_en": "Multi-screening may mess with your memory", "transed": 1, "url": "https://cosmosmagazine.com/health/body-and-mind/multi-screening-may-mess-with-your-memory/", "via": "", "real_tags": ["可能", "screening", "注意力"]}]