[{"category": "", "categoryclass": "", "imagename": "1401fc3bb840b11d5ad293d1c86daaf4.jpg", "infoid": 1029235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "舒尔提供Aonic50黑色或棕色饰面，他们在右耳杯上有物理控制音量，打开和关闭噪音消除，电源，激活语音辅助和跳过曲目。左耳杯上有一个用于充电的USB-C端口和一个2.5毫米立体声接口，用于使用随附的电缆进行有线连接，这使得您即使在内部电池耗尽或耳机断电(尽管没有明显的有源噪音抵消)的情况下也可以使用它们。\nAonic50还配备了一个圆形、扁平的手提箱-耳杯可以旋转，以适合拉链储物柜。这比这些ANC耳机的典型折叠设计占用了更多的空间，但它也不那么笨重，所以这取决于你是如何包装它们的，这是好的还是坏的。\n舒尔提供了一款适用于iOS和Android的移动应用程序，名为ShurePlus Play，可以提供EQ控制，以及更具体的有源噪音消除和通过管道输入外部声音的环境模式的调整。这允许大量的定制，但有一个主要的警告-EQ设置只适用于通过应用程序本身播放音乐时，这是一个不寻常的令人失望的选择。\n舒尔的Aonic50在两个领域表现出色：音质和舒适性/穿戴性。头带和耳杯上都有充足的人造皮革包裹的垫子，使它们佩戴起来非常舒适，即使是在更长的时间里也是如此，这对于家庭实用的工作来说是很棒的。我经常忘记在房子里走动时戴着它们，这让你对它们的合身程度有了一个了解。\n至于声音，舒尔的目标是相对中性、平淡的基调，准确地再现原始制作人对任何曲目的意图，结果很好。音乐细节清晰，低音不重，高音不过分强调。这是一个音频发烧友会喜欢的声音配置文件，尽管对于那些想要一个低音重的音响舞台的人来说，这可能不是最好的选择。这就是说，在这一类别中很容易找到支持低音的耳机，所以舒尔的产品，以其明确的高点，在非国大的竞技场上脱颖而出。需要明确的是，低音很出色，但总体来说，市场已经转向混浊的、人工增强的低音，而不是真正的渲染，这正是Aonic50提供的。\nAonic50上的按钮控制放置得当，涵盖了您想要直接从耳机控制的范围。在USB-C充电是生活中大多数移动设备以及许多计算机的标准的时代，USB-C充电受到了极大的赞赏。在这个时代，USB-C充电无疑是你生活中大多数移动设备的标准，也是许多计算机的标准。随附的立体声数据线是电池耗尽时的一个很好的补充-但舒尔宣传的20小时左右的电池续航时间估计是准确的，所以只要你记得偶尔充电，你就得花很长时间才能求助于立体声电缆。\n如果说舒尔的表现有一点不足的话，那就是噪音消除。ANC在屏蔽不想要的环境声音方面做得不错，但它不太符合Bose或索尼的高端ANC耳机的标准。它仍然能在大部分时间内完成工作，而且取舍更合理。\n正如我在上面说过的，现在寻找有源消噪耳机的人都被宠坏了，有很多选择。但是舒尔Aonic50提供了一些有洞察力的音频专业人士无法从包括Bose或索尼在内的替代品中找到的东西，这是一个无与伦比的极好的音响舞台和音质。可穿戴也是最重要的，对于想要家庭办公室无线隔音解决方案的发烧友来说，这是一个很好的选择。", "note_en": "Shure offers the Aonic 50 in either black or brown finishes, and they have physical controls on the right ear cup for volume, turning noise cancellation on and off, power, activating voice assistances and skipping tracks. There’s a USB-C port for charging, and a 2.5mm stereo connector on the left ear cup for using the included cable to connect via wire, which allows you to use them even while the internal battery is depleted or the headset is powered down (albeit without active noise cancelling obviously).\n The Aonic 50 also comes with a round, flat carrying case – the ear cups swivel to fit in the zippered storage compartment. This takes up more of a footprint than the typical folding design of these kind of ANC headphones, but it’s less bulky, too, so it depends on how you’re packing them whether this is good or bad.\n  Shure offers a mobile app for iOS and  Android   called ShurePlus Play that can provide EQ controls, as well as more specific tuning of both the active noise cancelling, and the environmental mode that pipes in outside sound. This allows for a lot of customization, but with one major caveat – EQ settings only apply when playing music via the app itself, which is an unusual and disappointing choice.\n  Shure’s Aonic 50 excel in a couple of areas where the company has a proven track record: Sound quality and comfort/wearability. The ample faux leather-wrapped padding on both the headband and the ear cups make them very comfortable to wear, even for longer sessions, which is great for work for home practicality. I often forgot I had them on while moving around the house, which gives you an idea of how well they fit.\n As for sound, Shure has aimed for a relatively neutral, flat tone that provides an accurate recreation of what the original producer intended for any track, and the results are great. Music detail is clear, and they’re neither too heavy on bass or overemphatic on treble. This is a sound profile that audiophiles will appreciate, though it might not be the best for anyone who’s looking for a bass-heavy soundstage. That said, bass-favoring headphones are easy to find in this category, so Shure’s offering, with its clear highs, stands apart from the field in the ANC arena. To be clear, the bass is excellent, but overall the market has moved towards muddy, artificially enhanced bass vs. true rendering, which the Aonic 50 delivers.\n The button controls on the Aonic 50 are well-placed and cover the spectrum in terms of what you’d want to be able to control right from the headset. USB-C charging is much-appreciated in an era where that’s far and away the standard for most of the mobile devices in your life, as well as many computers. The included stereo cable is a great addition for when the battery runs out – but Shure’s advertised 20-hour or so battery life estimate is accurate, so it’ll be quite a while before you have to resort to that as long as you remember to charge once in a while.\n If there’s one place where Shure’s performance falls a bit short, it’s in noise cancellation. The ANC does a decent job of blocking out unwanted environmental sound, but it’s not quite up to the standard of the like of Bose or  Sony’s   top-end ANC headphones. It still gets the job done most of the time, and the trade-off is better sound.\n  As I said above, people looking for active noise cancelling headphones are spoiled for choice these days. But the Shure Aonic 50 offers something that discerning audio pros won’t be able to find from alternatives including those from Bose or Sony, and that’s an excellent soundstage and sound quality that just can’t be beat. Wearability is also tops, which makes these a great options for audiophiles who want a wire-free, sound-blocking solution for a home office.", "posttime": "2020-10-16 21:04:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "aonic50,noise,耳机", "title": "\n舒尔的Aonic50无线降噪耳机提供一流的音频质量", "title_en": "\n\t\t\t\tShure’s Aonic 50 wireless noise cancelling headphones offer best-in-class audio quality\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/16/shures-aonic-50-wireless-noise-cancelling-headphones-offer-best-in-class-audio-quality/", "via": "", "real_tags": ["aonic50", "noise", "耳机"]}, {"category": "", "categoryclass": "", "imagename": "84bfd105c3e581a76780b41c00a4a6d6.jpg", "infoid": 1029234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "未来以大胆的销售面向消费者推出，这是一款每月150美元的订阅应用程序，几乎将用户与现实生活中的健身教练捆绑在一起。依靠Apple Watch的健康跟踪功能，这家初创公司的目标一直是建立一个集激励、问责和健身洞察力于一体的平台。\n在宣布由凯鹏华盈(Kleiner Perkins)牵头的首轮融资近18个月后，这家初创公司告诉TechCrunch，他们已经完成了由Trustbridge Partners牵头的2400万美元的首轮B轮融资，咖啡因资本(Caffeated Capital)和凯鹏华盈(Kleiner Perkins)再次参与。\n在家庭健身的热潮中，Future看到了自己的重大增长。首席执行官里希·曼达尔(Rishi Mandal)表示，近几个月来，随着数千家健身房关门，该公司的增长率增长了两倍。他说，就地避难所只是加速了正在进行的向技术进步的健身服务的转变，这种服务可以帮助忙碌的用户在一天中找到时间锻炼。\n曼达尔说：“该公司的经营理念是，现代生活不仅在大流行时期天生疯狂，在正常时期也是如此。”“有一套固定程序的想法是完全错误的。”\nFuture的月费为149美元，它的目标不是像peloton、Fitbit或苹果公司生产的其他数字健身程序那样吸引大众市场。它似乎更直接地针对用户，这些用户可能是获得私人教练的候选人，但可能没有准备好进行投资，或者不太需要指导说明，因为他们需要一般的指导方针和一些责任。\n随着这家初创公司接近获得更多资金，该团队有扩大网络的宏伟目标。曼达尔的目标是到明年这个时候在未来平台上拥有1000名教练。达到新的规模可能会给这项服务提供一个应对新挑战的机会。曼达尔看到了未来的机会，随着它的发展，它的教练服务将扩展到健身之外。“这是一个真正的机会，可以帮助人们在健康的各个方面提供帮助。”", "note_en": "Future launched with a bold sell for consumers, a $150 per month subscription app that virtually teamed users up with a real life fitness coach. Leaning on the health-tracking capabilities of the Apple Watch, the startup has been aiming to build a platform that teams motivation, accountability and fitness insights.\n   Close to 18 months after announcing a Series A led by  Kleiner Perkins,   the startup tells TechCrunch they’ve closed a $24 million Series B led by  Trustbridge Partners   with  Caffeinated Capital   and Kleiner Perkins participating again.\n Amid the at-home fitness boom, Future has seen major growth of its own. CEO  Rishi Mandal   says that the company’s growth rate has tripled in recent months as thousands of gyms closed their doors. He says shelter-in-place has merely accelerated an ongoing shift towards tech-forward fitness services that can help busy users find time during their day to exercise.\n ” The operating thesis of the company is that modern life is inherently crazy not just during pandemic times but in normal times,” Mandal says. “The idea of having a set routine is a complete fallacy.”\n At $149 per month, Future isn’t aiming for mass market appeal the same way other digital fitness programs being produced by Peloton,  Fitbit   or Apple are. It seems to be more squarely aimed at users that could be a candidate for getting a personal trainer but might bot be ready to make the investment or don’t need the guided instruction so much as they need general guidelines and some accountability.\n As the startup closes on more funding, the team has big goals to expand its network. Mandal aims to have 1,000 coaches on the Future platform by this time next year. Reaching new scales could give the service a chance to tackle new challenges. Mandal sees opportunities for Future to expand its coaching services beyond fitness as it grows, “there’s a real opportunity to help people with all aspects of their health.”", "posttime": "2020-10-16 21:04:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,健身,workout", "title": "\n在家庭健身热潮中，未来为其150美元/月的健身教练应用程序B系列筹集了2400万美元", "title_en": "\n\t\t\t\tFuture raises $24M Series B for its $150/mo workout coaching app amid at-home fitness boom\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/16/future-raises-24m-series-b-for-its-150-mo-exercise-app-amid-at-home-fitness-boom/", "via": "", "real_tags": ["程序", "健身", "workout"]}, {"category": "", "categoryclass": "", "imagename": "9e13abf16ac173a65c29c72a844be506.jpg", "infoid": 1029232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是有史以来功能最强大、功能最多、色彩最丰富的iPad Air。从今天开始，与新款iPhone 12一起，顾客可以订购全新的苹果iPad Air，从10月23日(星期五)开始供货。IPad Air有五种华丽的外观，采用全屏幕设计，10.9英寸的Liquid Retina显示屏，摄像头和音频升级，顶部按钮有一个新的集成Touch ID传感器，以及强大的A14仿生功能，大大提高了性能，使这款产品成为迄今为止功能最强大、功能最强大的iPad Air。\nIPad Air采用了全新的轻薄设计，有五种华丽的表面：银色、太空灰色、玫瑰金、绿色和天蓝色。新的全屏幕设计带来了更大的10.9英寸Liquid Retina显示屏，提供令人惊叹的视觉体验，拥有380万像素和先进的技术，包括全层压、P3宽色支持、真色调和抗反射涂层。为了让显示屏在四面八方延伸，顶部按钮中集成了下一代Touch ID传感器，提供了同样快速、简单和安全的方式来解锁iPad Air、登录应用程序或使用客户了解和喜爱的Apple Pay。IPad Air兼容Magic Keyboard及其浮动式设计，内置触控板、Smart Keyboard Folio和新的Smart Folio封面，以及苹果铅笔(第二代)，它可以磁性地连接到iPad的侧面，便于配对、充电和存储。1个。\nIPad Air采用苹果有史以来最先进的芯片A14仿生芯片，极大地提升了性能。即使是处理要求最高的应用程序，A14仿生也能让iPad Air在编辑4K视频、创作华丽的艺术品、玩身临其境的游戏等方面做得更好。A14 Bionic采用突破性的5纳米工艺技术，内置118亿个晶体管，提高了芯片几乎每个部分的性能和电源效率。这款最新一代的A系列芯片采用了新的6核设计，CPU性能提高了40%，新的4核图形架构使图形性能提高了30%。2.为了提供突破性的机器学习能力，A14 Bionic包括了一个新的16核神经引擎，速度是原来的两倍，能够每秒执行高达11万亿次操作，将机器学习应用程序带到了一个全新的水平。A14 Bionic还在CPU中包含第二代机器学习加速器，使机器学习计算速度提高10倍。这种新型神经引擎、CPU机器学习加速器和高性能GPU的组合，为图像识别、自然语言学习、运动分析等提供了强大的设备体验。\nIPad Air包括一个700万像素的前置FaceTime高清摄像头，现在配备了与iPad Pro相同的1200万像素后置摄像头，用于更高分辨率的照片和4K视频捕获。IPad Air的新设计以横向模式的立体声扬声器为特色，提升了音频体验，这样用户在观看视频的同时可以享受更广泛的立体声。iPad Air配备了USB-C端口，数据传输速度高达5Gbps，速度是5Gbps的10倍，连接相机、硬盘和高达4K的外部显示器的速度为2秒。凭借Wi-Fi 6的性能和60%的LTE连接速度，加上A14 Bionic，这是迄今为止功能最强大的iPad Air。\n新款iPad Air搭载iPadOS 14，带来了新的功能和设计，充分利用了iPad的独特功能，如大型多点触控显示屏和多功能配件。IPadOS14进一步将苹果铅笔集成到iPad体验中，以获得更好的笔记功能，以及处理手写笔记的新方式。在iPad上做笔记时，Smart Selection使用设备上的机器学习来区分手写和绘图，因此可以使用相同的熟悉手势轻松选择、剪切手写文本并将其粘贴到另一个文档中。形状识别允许用户绘制几何上完美的形状，并在Notes中添加图表和插图时对齐到位。数据检测器与手写文本无缝协作，识别电话号码、日期、地址和链接，使用户可以轻松执行诸如轻敲手写号码等操作来拨打电话。\nIPadOS 14还将Scribble带到了iPad上，允许苹果铅笔用户在任何文本字段中直接手写，做出快速回复iMessage或在Safari中搜索等操作-所有这些都不需要把苹果铅笔收起来。Scrible使用设备上的机器学习将手写内容实时转换为键入的文本，因此书写始终保持私密和安全。\nIPadOS 14在其他方面使iPad体验更加独特和强大，包括：\n新的紧凑型设计，用于来电FaceTime和电话、Siri交互和搜索，以帮助用户将注意力集中在手头的任务上。\n通用搜索，几乎可以快速找到任何东西，从定位和启动应用程序，到访问联系人、文件和信息，再到获得有关人员或地点的常见问题的答案。\n许多应用的新侧边栏，包括照片和文件，以及将控件合并到一个位置的简化工具栏，使它们比以往任何时候都更有用。\n重新设计精美的小部件，可在主屏幕上一目了然地显示及时的信息。\n新款iPad Air的设计初衷是环保，支持苹果在2030年实现碳中性的计划。IPad Air使用100%回收铝外壳和100%回收锡作为其主逻辑板上的焊料。IPad Air的新扬声器还使用了100%回收稀土元素的磁铁。IPad Air不含有害物质，能效高，使用木纤维包装，回收利用或来自负责任地管理的森林。\nIPad Air加入了功能强大的iPad Pro、第八代iPad和iPad mini的行列，组成了有史以来最先进的iPad阵容。支持苹果铅笔、同类最佳的性能、先进的显示屏和全天电池续航，4无论客户是否优先考虑便携性、功耗或价格，iPad都适合每个人。有关iPad系列的更多信息，请访问www.apple.com/ipad/compare。\nApple TV+和Apple Arade免费试用后，每月各4.99美元。特价优惠有效期为首次激活合格设备后的三个月。Apple Arade优惠将于10月22日开始。每个家庭共享组提供一份Apple TV+优惠和一份Apple Arade优惠。计划自动续订，直到取消。适用其他限制和条款；有关更多详细信息，请访问apple.com/promo.com。\n折价价值根据折价设备的状况、年份和配置而有所不同，也可能在在线折价和店内折价之间有所不同。顾客必须年满18岁。并非所有国家/地区都提供优惠。店内折价要求出示政府颁发的有效照片ID(当地法律可能要求保存此信息)。来自苹果或苹果折价合作伙伴的附加条款可能适用。", "note_en": "The most powerful, versatile, and colorful  iPad Air ever is here. Starting today, alongside the new  iPhone 12, customers can order the all-new iPad Air, with availability beginning Friday, October 23. Offered in five gorgeous finishes, iPad Air features an all-screen design with a larger 10.9-inch Liquid Retina display, camera and audio upgrades, a new integrated Touch ID sensor in the top button, and the powerful A14 Bionic for a massive boost in performance, making this by far the most powerful and capable iPad Air ever made.\n    iPad Air features a completely new thin and light design in five gorgeous finishes: silver, space gray, rose gold, green, and sky blue. The new all-screen design brings a larger 10.9-inch Liquid Retina display for a stunning visual experience, with 3.8 million pixels and advanced technologies, including full lamination, P3 wide color support, True Tone, and an anti-reflective coating. To allow the display to extend on all sides, a next-generation Touch ID sensor is integrated into the top button, providing the same fast, easy, and secure way to unlock iPad Air, log in to apps, or use Apple Pay, which customers know and love. iPad Air is compatible with Magic Keyboard and its floating design with built-in trackpad, the Smart Keyboard Folio, and new Smart Folio covers, as well as Apple Pencil (2nd generation), which attaches magnetically to the side of iPad for easy pairing, charging, and storing. 1\n    iPad Air delivers a massive boost in performance with Apple’s most advanced chip ever made, A14 Bionic. Handling even the most demanding apps, A14 Bionic makes iPad Air even better for editing 4K video, creating gorgeous works of art, playing immersive games, and more. Using breakthrough 5-nanometer process technology, A14 Bionic is packed with 11.8 billion transistors for increased performance and power efficiency in nearly every part of the chip. This latest-generation A-series chip features a new 6-core design for a 40 percent boost in CPU performance, and a new 4-core graphics architecture for a 30 percent improvement in graphics. 2 To deliver breakthrough machine learning capabilities, A14 Bionic includes a new 16-core Neural Engine that is twice as fast, and capable of performing up to 11 trillion operations per second, taking machine learning apps to a whole new level. A14 Bionic also includes second-generation machine learning accelerators in the CPU for 10 times faster machine learning calculations. This combination of the new Neural Engine, CPU machine learning accelerators, and high-performance GPU enables powerful on-device experiences for image recognition, natural language learning, analyzing motion, and more.\n    iPad Air includes a 7MP front-facing FaceTime HD camera and now features the same 12MP rear camera used in iPad Pro for higher resolution photos and 4K video capture. The new design of iPad Air features stereo speakers in landscape mode, elevating the audio experience so users can enjoy wider stereo sound while watching video. A USB-C port comes to iPad Air for up to 5Gbps data transfer, which is 10 times faster, 2 for connecting to cameras, hard drives, and external monitors up to 4K. With Wi-Fi 6 performance and 60 percent faster LTE connectivity, 3 along with A14 Bionic, this is by far the most powerful iPad Air ever.\n    The new iPad Air ships with iPadOS 14, which brings new features and designs that take advantage of the unique capabilities of iPad, such as its large Multi-Touch display, and versatile accessories. iPadOS 14 further integrates Apple Pencil into the iPad experience for better note-taking capabilities, and new ways to work with handwritten notes. When taking notes on iPad, Smart Selection uses on-device machine learning to distinguish handwriting from drawings, so handwritten text can easily be selected, cut, and pasted into another document as typed text using the same familiar gestures. Shape recognition allows users to draw shapes that are made geometrically perfect and snap right into place when adding diagrams and illustrations in Notes. Data detectors work seamlessly with handwritten text, recognizing phone numbers, dates, addresses, and links, making it easy for users to perform actions like tapping a handwritten number to make a call.\n  iPadOS 14 also brings Scribble to iPad, allowing Apple Pencil users to handwrite directly in any text field, making actions like replying to a quick iMessage or searching in Safari fast and easy — all without ever needing to put Apple Pencil away. Scribble uses on-device machine learning to convert handwriting into typed text in real time, so writing is always kept private and secure.\n  iPadOS 14 makes the iPad experience even more distinctive and powerful in other ways, including:\n  New compact designs for incoming FaceTime and phone calls, Siri interactions, and Search to help users stay focused on the task at hand.\n  Universal Search to quickly find practically anything, from locating and launching apps, to accessing contacts, files, and information, to getting answers to common questions about people or places.\n  New sidebars for many apps including Photos and Files, and streamlined toolbars that consolidate controls into a single place, making them more useful than ever.\n  Beautifully redesigned widgets that present timely information at a glance right on the Home Screen.\n    The new iPad Air is designed to be environmentally friendly and supports Apple’s plan to become carbon neutral by 2030. iPad Air uses a 100 percent recycled aluminum enclosure and 100 percent recycled tin for the solder on its main logic board. The new speakers in iPad Air also use magnets with 100 percent recycled rare earth elements. iPad Air remains free of harmful substances, is highly energy efficient, and uses wood fiber packaging that is recycled or comes from responsibly managed forests.\n    iPad Air joins the powerful iPad Pro, the eighth-generation iPad, and iPad mini to form the most advanced iPad lineup ever. With support for Apple Pencil, best-in-class performance, advanced displays, and all-day battery life, 4 whether customers prioritize portability, power, or price, there’s an iPad for everyone. Learn more about the iPad family at  apple.com/ipad/compare.\n        $4.99 per month each for Apple TV+ and Apple Arcade after free trial. Special offers are good for three months after the first activation of the eligible device. Apple Arcade offer begins October 22. One Apple TV+ offer and one Apple Arcade offer per Family Sharing group. Plans automatically renew until cancelled. Other restrictions and terms apply; visit  apple.com/promo for more information.\n Trade-in values vary based on the condition, year, and configuration of the trade-in device, and may also vary between online and in-store trade-in. Customers must be at least 18 years old. Offer may not be available in all countries. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). Additional terms from Apple or Apple’s trade-in partners may apply.", "posttime": "2020-10-16 21:03:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "摄像头,generation,ipad", "title": "第四代iPad Air，10.9英寸显示屏，1200万后置摄像头，起价599美元，今天开始预订，10月23日(星期五)开始发售", "title_en": "Fourth-generation iPad Air with 10.9-inch display, 12MP rear camera, starting at $599, pre-orders open today and available from Friday, October 23", "transed": 1, "url": "https://www.apple.com/newsroom/2020/10/all-new-ipad-air-with-advanced-a14-bionic-chip-available-to-order-starting-today/", "via": "", "real_tags": ["摄像头", "ipad"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我发表了价值1美元的MCU文章后，几位读者建议我看看应用处理器--这是运行Linux等真正操作系统所必需的MMU芯片。在过去的几年里，巨大的变化见证了连接互联网的设备变得更有功能(希望也更安全)，我发现自己把Linux放到了越来越多的地方。\n在初学者工程师中，应用程序处理器恳求尊敬：一个小小的PCB错误，你价值1万美元的原型就会变成一个压纸机。有一个由工程专业人士组成的神秘联盟，他们满怀信心地将这些芯片投入到设计中，而不知情的人则对他们的覆盆子PI和价格过高的工业SOM畏缩不前。\n本文的目标读者是熟悉微控制器但不熟悉微处理器或Linux的嵌入式工程师，因此我想整理一些内容，快速介绍您为什么想要运行嵌入式Linux，概述围绕应用程序处理器进行设计所涉及的内容，然后深入了解入门级嵌入式Linux系统应该检查的一些特定部分(以及应该避免的其他部分)。\n就像我的微控制器文章一样，我挑选的部件范围从这十年的大部分时间里拉动产品的老马，到具有耐人寻味的能力的新鲜面孔IC，你可以保持袖子不动。\n如果我对微控制器文章的口头禅是，你应该为这项工作挑选正确的部分，并且不要害怕学习新的软件生态系统，那么我对这篇文章的论点甚至更简单：一旦你在这些部分中的任何一个基本上引导到Linux，它们就变成了相同的开发环境。\n这使得运行嵌入式Linux的芯片几乎成为一种商品化的产品：只要你的处理器勾选了正确的复选框，你的应用程序代码就不会知道它是在ST还是MicroChip部件上运行-即使其中一个是全新的双核Cortex-A7，另一个是旧的ARM9。您的I2C驱动程序、GPIO调用-甚至是基于V4L的图像处理代码-都将无缝工作。\n至少，这是推销词。让一个角色开机是完全不同的考验-这就是我们要关注的。除了最后的一些较小的基准测试之外，一旦出现shell提示，我们将认为工作已经完成。\n与我对微控制器的回顾不同的是，这一次我将重点放在硬件设计上：与我回顾的微控制器不同，这些芯片在PCB设计难度方面差异很大-我如果省略这一讨论将是错误的。为此，我为所审查的每个应用程序处理器从头设计了一个开发板。实际上，每个处理器都有许多开发板：总共大约有25种不同的设计。这让我可以尝试不同的DDR布局和电源管理策略，并在此过程中修复一些错误。\n我故意从头开始设计这些线路板，而不是从别人的CAD文件开始。这帮助我发现每个CPU几乎没有什么“问题”，并且优化了成本和手工组装的设计。每一块电路板都是在一两天的时间内设计的，并使用了JLC的低成本4层PCB制造服务。\n这些主板不会在功耗或EMC方面赢得任何奖项：为了简单起见，我经常通过将通常由电源供电(和排序！)的电源板组合在一起来作弊。分开的。此外，我将板载外围设备限制在引导所需的最低限度，因此这些板上没有音频编解码器、小I2C传感器或以太网PHY。\n因此，我为这次复习搭建的板子类似于你高中历史课上的笔记，或者你为自己练习一段音乐以便以后学习的录音。因此，虽然我将发布电路板的图片和布局的屏幕截图来说明具体的观点，但这些并不是要用作参考设计或任何东西；整个评论的重点是让您找到一个您想要设计自己的小Linux电路板的地方。教人钓鱼，你知道吗？", "note_en": "After I published my $1 MCU write-up, several readers suggested I look at application processors — the MMU-endowed chips necessary to run real operating systems like Linux. Massive shifts over the last few years have seen internet-connected devices become more featureful (and hopefully, more secure), and I’m finding myself putting Linux into more and more places.\n Among beginner engineers, application processors supplicate reverence: one minor PCB bug and your $10,000 prototype becomes a paperweight. There’s an occult consortium of engineering pros who drop these chips into designs with utter confidence, while the uninitiated cower for their Raspberry Pis and overpriced industrial SOMs.\n This article is targeted at embedded engineers who are familiar with microcontrollers but not with microprocessors or Linux, so I wanted to put together something with a quick primer on why you’d want to run embedded Linux, a broad overview of what’s involved in designing around application processors, and then a dive into some specific parts you should check out — and others you should avoid — for entry-level embedded Linux systems.\n Just like my microcontroller article, the parts I picked range from the well-worn horses that have pulled along products for the better part of this decade, to fresh-faced ICs with intriguing capabilities that you can keep up your sleeve.\n If my mantra for the microcontroller article was that you should pick the right part for the job and not be afraid to learn new software ecosystems, my argument for this post is even simpler: once you’re booted into Linux on basically  any of these parts, they become identical development environments.\n That makes chips running embedded Linux almost a commodity product: as long as your processor checks off the right boxes, your application code won’t know if it’s running on an ST or a Microchip part — even if one of those is a brand-new dual-core Cortex-A7 and the other is an old ARM9. Your I2C drivers, your GPIO calls — even your V4L-based image processing code — will all work seamlessly.\n At least, that’s the sales pitch. Getting a part booted is an entirely different ordeal altogether — that’s what we’ll be focused on. Except for some minor benchmarking at the end, once we get to a shell prompt, we’ll consider the job completed.\n As a departure from my microcontroller review, this time I’m focusing heavily on hardware design: unlike the microcontrollers I reviewed, these chips vary considerably in PCB design difficulty — a discussion I would be in error to omit. To this end, I designed a dev board from scratch for each application processor reviewed. Well, actually,  many dev boards for each processor: roughly 25 different designs in total. This allowed me to try out different DDR layout and power management strategies — as well as fix some bugs along the way.\n I intentionally designed these boards from scratch rather than starting with someone else’s CAD files. This helped me discover little “gotchas” that each CPU has, as well as optimize the design for cost and hand-assembly. Each of these boards was designed across one or two days’ worth of time and used JLC’s low-cost 4-layer PCB manufacturing service.\n These boards won’t win any awards for power consumption or EMC: to keep things easy, I often cheated by combining power rails together that would typically be powered (and sequenced!) separately. Also, I limited the on-board peripherals to the bare minimum required to boot, so there are no audio CODECs, little I2C sensors, or Ethernet PHYs on these boards.\n As a result, the boards I built for this review are akin to the notes from your high school history class or a recording you made of yourself practicing a piece of music to study later. So while I’ll post pictures of the boards and screenshots of layouts to illustrate specific points, these aren’t intended to serve as reference designs or anything; the whole point of the review is to get you to a spot where you’ll want to go off and design  your own little Linux boards. Teach a person to fish, you know?", "posttime": "2020-10-16 21:00:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,embedded,设计", "title": "所以你想构建一个嵌入式Linux系统？", "title_en": "So you want to build an embedded Linux system?", "transed": 1, "url": "https://jaycarlson.net/embedded-linux/", "via": "", "real_tags": ["linux", "embedded", "设计"]}, {"category": "", "categoryclass": "", "imagename": "a498557a343dfd09fe4bac13a5a04699.png", "infoid": 1029230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过六个月的持续开发，我们非常自豪地宣布NIM 1.4版！除了1.0版之外，这可能是迄今为止最大的NIM版本，我们非常兴奋能发布它！\n它正好包含900个新的提交，这些新的提交还没有被移植到我们以前的版本中。与1.2相比，它有几个新的特性和标准库添加。我们试图将破坏更改保持在最低限度，但是如果不进行那些必要的更改，一些错误修复是不可能的，我们认为我们的用户将从中受益。\n检查您的操作系统的包管理器是否已经发布了1.4版，或者按照这里的说明进行安装。\n如果您使用Choosenim安装了以前版本的NIM，则获取NIM 1.4与以下操作一样简单：\n如果您没有Choosenim，您可以按照上述相同的安装链接进行操作。\n我们的贡献者太多了，太多了，无法在这里列出。非常感谢你们所有人，没有你们，我们不可能完成这次发布！\n如果您还没有看过NimConf 220提供的这段视频，我们推荐NimConf 220提供的这段视频，其中Araq解释了ARC背后的详细信息，并展示了一些基准来说明它的优点，这是一种新的引用计数算法，称为ARC。如果您还没有看过它，我们推荐使用NimConf 220提供的这段视频。\n据我们所知，ARC使用完整的标准库，除了当前的异步实现之外，因为这会引入ARC不处理的周期。还有其他开发中的异步实现不会引入周期。\nORC是现有的ARC算法加上一个周期收集器，并且--GC：ORC是我们这个版本的主要新特性！我们推荐阅读这篇介绍性的ARC/ORC帖子来了解ARC/ORC的优势。\n如果您尚未在NIM 1.2中使用ARC，则只需在命令行中传递--gc：arcon：\n如果您的代码使用循环数据结构，或者如果您不确定代码是否生成循环，则需要使用--gc：orc和not--gc：arc.。\n如果您有一个看起来是循环的对象，但您知道它不是循环的，您可以通过将其标记为{.acycyclical来帮助ORC。}使用以下方式：\n如果您在代码中使用system.deepCopy，则需要通过命令行上的--deepCopy：on启用它。这是一个创可贴，将来会有更好的解决方案。\n这种选择加入切换的原因是ARC和ORC不使用系统的旧运行类型信息(RTTI)。Deep Copy是在此基础上构建的。我们在构建ARC和ORC时考虑到了嵌入式设备，据报道，旧RTTI的开销是不可接受的。\n人们可能会遇到的第二个问题是自定义析构函数的严格排序要求；这也会影响旧代码，因为终结器映射到析构函数。例如：\nType CustomObject=ref object p：ptr int proc tricky()=#将使用默认析构函数变量x：CustomObject proc finalizer(x：CustomObject)=if x。P！=nil：dealloc(x.。P)proc newCustomObject()：CustomObject=new(result，finalizer)\nTemp.nim(15，6)错误：无法将另一个&#39；=销毁&#39；绑定到：CustomObject：ObjectType；以前的声明是在此处隐式构造的：temp.nim(8，7)。\n原因是只有在调用new(result，finalizer)之后，编译器才知道它需要为CustomObject类型生成一个自定义析构函数，但是当它编译时很棘手，会使用默认析构函数。\nType CustomObject=ref object p：ptr int proc finalizer(x：CustomObject)=if x。P！=nil：dealloc(x.。P)proc newCustomObject()：CustomObject=new(result，finalizer)proc Tricky()=#使用自定义析构函数var x：CustomObject。\n这是当前的限制，将在编译器的未来版本中进行改进。\n这是一个试验性功能，可以通过代码中的{.Experial：&#34；strictFuncs&#34；.}杂注或通过--Experial：strictFuncs开关获得。\n它为“副作用”引入了更严格的定义：如果可以通过未声明为var参数的参数访问对象，则对该对象的任何突变都将算作副作用。\n{。实验：&#34；strictFuncs&#34；.}type Node=ref object le，ri：node data：string func len(n：node)：int=#Valid：LEN在it！=nil：incresult it=it时没有副作用var it=n。Ri func mut(n：node)=let m=n#是将突变连接到参数m的语句。数据=#34；耶&34；#突变在此#错误：#{#39；mut#39；可能有副作用#从##39；n#39；可访问的对象可能会发生突变。\n为std/jsonutils模块添加了一些增强功能。添加了将JSON数组直接反序列化为HashSet和OrderedSet类型，并分别通过jsonutils.fromJson和jsonutils.toJson过程将这些类型序列化为JSON数组的可能性。\n添加了通过jsonutils.fromJson和jsonutils.toJson过程将JSON空对象反序列化为NIM选项对象和分别将NIM选项对象序列化为JSON对象(如果是Somee)或序列化为JSON空对象(如果通过jsonutils.fromJson和jsonutils.toJson过程为None)的可能性。\n向jsonutils.fromJson添加了一个Joptions参数，该参数当前包含两个布尔选项allowExtraKeys和allowMissingKeys。如果allowExtraKeys为true，则不要求解析JSON的NIM对象的每个JSON键都有一个字段。\n如果allowMissingKeys为true，则允许解析JSON的NIM对象具有没有对应JSON键的字段。\nOrdinal的默认散列已更改为更多的比特加扰。导入散列；proc散列(x：myint)：hash=hashIdentity(X)在实例化上下文中恢复oldo，而-d：nimIntHash1全局恢复它。\n子进程将不再继承从stdlib中的高级抽象创建的文件句柄。特别是，这些模块会受到影响：异步调度、异步网络、系统、本地套接字、网络和选择器。\n对于异步调度、异步网络、网络和本机套接字，所有创建套接字的进程都添加了可继承标志，允许用户控制结果套接字是否可继承。提供此标志是为了简化需要套接字继承的多进程服务器的编写。\n对于过渡周期，定义nimInheritHandles以默认启用文件句柄继承。由于操作系统之间的语义不同，此标志不会影响选择器模块。\n为了设置文件句柄或套接字继承，还引入了asyncdisch.setInherable、system.setInherable和nativesockets.setInherable。并非所有平台都定义了这些PROC。\n由ioselector_kqueue和ioselector_EPOLL为内部记账创建的文件描述符将不再泄露给子进程。\n精度=0的structils.format Float已经恢复到版本1的行为，该行为会生成拖尾点，例如，FormatFloat(3.14159，Precision=0)现在是3，而不是3。\nRelativePath(rel，abs)和relativePath(abs，rel)过去常常默默地给出错误的结果(参见#13222)；相反，它们现在使用getCurrentDir来解决这些情况，这现在可以在getCurrentDir抛出的边缘情况下抛出。RelativePath现在也可以通过-d：NodeJS用于js。\nJavaScript和NimScript标准库更改：Streams.StringStream现在在JavaScript中受支持，但限制是使用的任何缓冲区指针必须可强制转换为PTR字符串，任何不兼容的指针类型都将不起作用。词库和STREAMS模块过去由于错误而无法编译onNimScript，但此问题已修复。\n以下模块现在可以在JS和NimScript上编译：parsecsv、parsecfg、parsesql、xmlparser、htmlparser和ropes。另外，JS还支持cstructils.startsWith和cstructils.endsWith，for NimScript：json、parsejson、strtabs和unidecode。\n添加了Streams.readStr和Streams.peekStr重载以接受要修改的现有字符串，这避免了内存分配，类似于Streams.readLine(#13857)。\n对位操作模块的改进，包括位片、原始掩码函数的非变异版本、掩码/掩码以及对位与、位或和位异或的可变参数支持。\n糖度=&gt；和糖度。-&gt；更改：以前将(x，y：int)转换为(x：auto，y：int)，现在改为(x：int，y：int)以与常规proc定义保持一致(尽管您不能使用分号)。\n现在，=&gt；的左侧允许使用语法和名称。以下是这些更改的一个示例：\n进口糖foo(x，y：int){。NoSideEffect}=&gt；x+y#转换为proc foo(x：int，y：int)：auto{。NoSideEffect}=x+y。\nTime.DateTime的字段现在是私有的，可以使用getter和过时的setter进行访问。\nTIMES模块现在可以更一致地处理DATETIME的默认值。给定未初始化的DATETIME时，大多数pros会引发断言错误，例外是==和$(返回&#34；Uninitialized DateTime&#34；)。添加了proc times.isInitialized，可用于检查DateTime是否已初始化。\n修复在osproc.startProcess中对io流调用Close是noop的错误，如果进程同时从stdin读取和写入(例如到stdout)，则会导致挂起。\n根据Mozilla的建议，net.newContext现在默认为以“中间兼容性”为目标的密码列表，而不是全部。这一改变应该会保护用户不被使用弱的和不安全的密码，同时仍然提供与大多数互联网的充分兼容性。\n添加了一个新的模块std/jsonutils，该模块带有可挂钩的jsonTo、toJson、from Json操作，用于自定义类型的json序列化/反序列化。\n添加了一个新的proc heapqueue e.find[T](heap：HeapQueue[T]，x：t)：int来获取元素x的索引。\n添加了随机性.Gauss，它使用从高斯分布采样的制服比率方法。\n类型。$Changes：$(int，)现在是&#34；(int，)&#34；而不是&#34；(Int)&#34；；$tuple[]&#34；而不是&#34；tuple[]&#34；；$((int，Float)，int)现在是&#34；((int，Float)，int)&#34；而不是&#34；((int，Float)，int的元组)&#34；\n使logging.newRollingFileLogger中的maxLines参数为正，因为负值将导致为每个记录行创建一个没有意义的新文件。\n更改了日志记录中的日志，以便对JavaScript使用适当的日志级别，例如，debug使用console.debug，info使用console.info，warn使用console.warn，等等。\n表、哈希集、共享表和DQUE不再要求传递的初始大小必须是2的幂-这是在内部完成的。表和哈希集的Proc RightSize已弃用，因为不再需要它。CountTable.inc再次接受val：int，而不是val：正；也就是说，它可以再次“倒计时”。\nStd/with，sugar.dup现在支持对象字段赋值表达式：import std/with foo=object x，y：int var foo=foo()with foo：x=10 y=20 echo foo。\nProc math.round不再被弃用。使用strformat的建议并不适用于所有用例。ROUND的局限性和(缺乏)可靠性是有据可查的。\n将getProtobyname添加到winlean。将getProtoByname添加到本机套接字，该套接字从数据库返回与协议名称匹配的协议代码。\n添加了以下集合的毒性检测流程。其用法类似于procs，如sets.toHashSet和tables.toTable。以前，需要手动创建所需的空集合并添加项。ToCritBitTree，它从项目的openArray或对的openArray创建CritBitTree。\n=Destroy挂钩不再需要重置其目标，因为编译器现在会自动在需要的地方插入waMoved调用。\n为清楚起见，=钩子现在称为=copy。旧名称=仍然可用，因此不需要更新您的代码。此更改也已向后移植到1.2版，因此您可以使用可读性更高的版本，而不会影响兼容性。\n在新的运行时中，只要case对象没有自定义析构函数，现在就可以不受限制地将其赋给鉴别器字段。鉴别器值也不必是常量。如果您有一个案例对象的自定义析构函数，并且您确实想要自由分配鉴别器字段，建议您将该对象重构为2个对象，如下所示：\nType MyObj=对象案例种类：Bool of true：y：ptr UncheckkedArray[Float]of false：z：SEQ[int]proc`=delesty`(x：MyObj)=if x。Kind和x。Y！=nil：DeallocShared(x.。是)。\nType MySubObj=Object Val：PTR UncheckkedArray[Float]MyObj=Object案例种类：Bool of true：y：MySubObj of false：z：SEQ[int]proc`=delesty`(x：MySubObj)=if x。Val！=nil：Deal LocShared(x.。VAL)。\n枚举类型符号上的getImpl现在返回字段syms而不是ident。这有助于编写类型化的宏。可以使用--useVersion：1.0恢复向后兼容的旧行为。\nProc标头的类型化AST现在的参数将是syms而不是id，这有助于编写类型化宏。可以使用--useVersion：1.0恢复向后兼容的旧行为。\n不再使用.raise：[]异常跟踪机制跟踪从system.Defect继承的异常。这与内置操作更加一致。以下代码通常用于编译(现在仍然使用)：proc mydiv(a，b)：int{。提升：[].}=a div b#可以引发DivByZeroDefect。\nProc mydiv(a，b)：int{.。引发：[].}=if b==0：引发newException(DivByZeroDefect，&#34；除以零&#34；)否则：result=a div b。\n这样做的原因是DivByZeroDefect继承自Defect，并且With--Panics：On Defects变成了无法恢复的错误。\n有一个名为“strictFuncs”的新实验功能，它使.noSideEffect的定义更加严格。有关更多信息，请参见此处。\n“for-loop宏”(参见手册)不是Longeran的实验特性。换言之，如果您想要使用它们，您不必编写杂注{.experial：&#34；for LoopMacros&#34；.}。\n添加了.noalias杂注。它被映射到C的RESTRICE关键字，以提高该关键字可以实现的性能。\n项不再使用带有漏洞的枚举进行编译，因为其行为容易出错，请参见#14004。\n添加了STD/Effects特征模块，用于自省推断的效果。我们希望这能够使异步宏精确地记录可能引发的异常。\n杂注阻止{.gcsafe。}：...。和{.noSideEffect.。}：...。现在也可以改写为{.cast(Gcsafe)。}：...。和{.cast(NoSideEffect)。}：....。这是写这些的新首选方式，强调它们的不安全性质。\n新命令：nim r main.nim[args...]。它编译并运行main.nim，并暗示--usenimcacheso使用与NIM c-r相同的逻辑将输出保存到$nimcache/main$exeExt，以避免在源代码不变时进行重新编译。例如：NIM r编译器/nim.nim--help#仅在第一次编译echo&#39；import os；echo getCurrentCompilerExe()&#39；|nim r-#这对onim r编译器/nim.nim--fullhelp#无重新编译nim r--nimcache：/tmp main#二进制保存到/tmp/main起作用。\n--HINT：现在支持处理，表示--HINT：PROCESSING：ON(与其他提示和警告相同)，与所有其他布尔标志一致。(从1.3.3开始)。\n添加了新的提示--提示：msgOrigin将显示编译器消息(提示|警告|错误)是在哪里生成的；当它来自哪里并不明显时(因为多个位置生成相同的消息，或者因为消息涉及运行时格式)，这尤其有用。\n添加了新的标志--backend：js|c|cpp|objc(或-b：js等)，用于更改后端；可以与任何命令(如nim r、doc、check等)配合使用；可以安全地重新分配。\n添加了新标志--doccmd：cmd为RunnableExamples传递附加标志，例如：--doccmd：-d：foo--threadsuse--doccmd：跳过以跳过RunnableExamples和rst测试片段。\nRunnableExamples&#34；-b：cpp-r：off&#34；：现在支持代码，允许覆盖示例的编译和运行方式，例如更改后端。\n当--outdir未指定(带或不带--project)时，NIM doc现在会在$projectPath/htmldocs下输出；传递--project现在会自动生成索引并启用搜索。有关详细信息，请参阅docgen。\n$getType(无类型)现在是“无类型的”而不是“expr”，$getType(有类型的)现在是“有类型的”而不是“stmt”。\n接收器推理现在默认禁用，必须通过--sinkInference：ON显式启用。注意：对于标准库，接收器推理仍处于启用状态。此更改与--GC：ARC、--GC：ORC内存管理模式最相关。\nNimsuggest现在在def查询时返回转发声明和实现位置。以前，该行为只返回转发声明。\n修复“关键：1个已完成的未来，多个等待：只有1个等待将被唤醒(最后一个)”(#13889)。\n修复了使用{.borrow.}运算符时32位上的“”DISTINCT UINT64“”类型损坏“(#13902)。\n修复了版本1.2.0上的“C编译错误-gc：arc1.2.0”未知类型名称‘TGenericSeq’“(#13863)。\n修复“proc的var返回类型在c++后端不起作用”(#13848)。\n修复了当openarray源是本地字符串并使用gc：arc时，简单的‘var openarray[char]’赋值崩溃问题(#14003)\n修复了“对于我的枚举中的枚举，使用带孔的枚举得出不正确的结果”(#14001)。\n修复“恼人的警告：继承自更精确的异常类型，如ValueError、ioError或OSError[固有异常]”(#14052)。\n修复“RelativePath(”foo“，”/“)和”relativePath(“/”，“foo”)错误“(#13222)。\n修复“stdlib中的异常类型应继承自CatchableError或Defect，而不是Exception”(#10288)。\n修复“nim jsondoc-o：doc.json filename.nim使用无类型序列失败”(#14066)。\n修复“NIM文档无法运行NIM 1.2.0(NIM 1.0.4可以)”(#13986)。\n修复“导入os+在config.nims中使用existsDir/dirExists/existsFile/fileExists/findExe导致”调用不明确的错误“(#14142)。\n修复“导入os+在config.nims中使用existsDir/dirExists/existsFile/fileExists/findExe导致”调用不明确的错误“(#14142)\n修复“RunnableExamples文档生成编译器崩溃，异常为e语法”(#14177)。\n修复了“[ARC]”内部错误：环境缺失：“在终结器中”(#14243)。\n修复“windows中openprocess的返回值无效为NULL，而不是INVALID_HANDLE_VALUE(-1)”(#14289)。\n修复“除非NIM目录在$PATH中，否则在OpenBSD上构建koch失败”(#13758)。\n修复了“[GC：ARC]案例对象赋值信号：未为基元类型调用销毁”(#14312)。\n修复了“正在获取”警告：无法证明“结果”已初始化“用于具有var T返回类型的导入cpp进程”(#14314)。\n修复“在使用/-GC：ARC在循环中创建线程时遇到SIGSEV”(#13935)。\n修复“nimvm：sysfaal：未处理的异常：无法使用类型为‘tnode’[字段错误]的判别式‘Kind’访问‘Sons’”(#14340)\n修复了“RunnableExcept On Specified Error Failures With NIM doc”(#12746)。\n修复“NIM文档--对于子模块的相对路径，项目显示‘@@/’而不是‘../’”(#14448)。\n修复“runnableExamples应保留源代码文档注释、字符串和(可能)格式”(#8871)。\n修正了“借出不安全：在#14447之后，您可以使用”Items“循环进行序列修改”(#14498)。\n修正了“var op=fn()WRO”\n.", "note_en": "We are very proud to announce Nim version 1.4 after six months of continuous development!Other than version 1.0, this is probably the biggest Nim release yet and we’re very excited to release it!\n It contains exactly 900 new commits which have not already been backported to our previous versions.There are several new features and standard library additions compared to 1.2.We tried to keep breaking changes to a minimum, but some bugfixes weren’t possiblewithout making those necessary changes, and we feel that our users will benefitfrom them.\n    Check out if the package manager of your OS already ships version 1.4 orinstall it as described  here.\n  If you have installed a previous version of Nim using  choosenim,getting Nim 1.4 is as easy as:\n  If you don’t have  choosenim, you can follow the same install link as above.\n  Our contributors are amazing, and there are far too manyto list here.Big thanks to all of you, we couldn’t have pulled off this release without you!\n   A new reference counting algorithm called ARC was first shipped with Nim 1.2.If you haven’t watched it already, we recommend this video from  NimConf 2020.where Araq explains details behind ARC and shows some benchmarks thatillustrate the benefits.\n As far as we know, ARC works with the complete standard library except forthe current implementation of  async, because that introduces cycles thatARC doesn’t deal with.There are other  async implementations in development that don’t introduce cycles.\n ORC is the existing ARC algorithm plus a cycle collector, and  --gc:orc is ourmain new feature for this release!We recommend reading this introductory ARC/ORC postto get an idea about ARC/ORC’s advantages.\n  If you haven’t used ARC already with Nim 1.2, all you have to do is to pass  --gc:arcon the command line:\n   If your code uses cyclic data structures, or if you’re not sure if your codeproduces cycles, you need to use  --gc:orc and not  --gc:arc.\n If you have an object that looks cyclic, but you  know it isn’t, you can help ORC bymarking it as   { .acyclic. } in the following way:\n     If you use  system.deepCopy in your code, you need to enable it via --deepCopy:on on the command line.This is a band-aid and a better solution for this will arrive in the future.\n The reason for this opt-in switch is that ARC and ORC do not use the old runtimetype information (RTTI) that  system.deepCopy is built upon.We’ve built ARC and ORC with embedded devices in mind where the overhead of theold RTTI has been reported to be unacceptable.\n  The second gotcha people might encounter is the strict ordering requirementfor custom destructors; this affects old code as well, because finalizers aremapped to destructors.For example:\n type  CustomObject  =  ref  object  p :  ptr  int proc  tricky ()  =  # would use the default destructor  var  x :  CustomObject proc  finalizer ( x :  CustomObject )  =  if  x . p  !=  nil :  dealloc ( x . p ) proc  newCustomObject ():  CustomObject  =  new ( result ,  finalizer )\n  temp.nim(15, 6) Error: cannot bind another &#39;=destroy&#39; to: CustomObject:ObjectType;previous declaration was constructed here implicitly: temp.nim(8, 7)\n The reason is that only after the  new(result, finalizer) call the compiler knowsthat it needs to generate a custom destructor for the  CustomObject type,but when it compiled  tricky the default destructor was used.\n  type  CustomObject  =  ref  object  p :  ptr  int proc  finalizer ( x :  CustomObject )  =  if  x . p  !=  nil :  dealloc ( x . p ) proc  newCustomObject ():  CustomObject  =  new ( result ,  finalizer ) proc  tricky ()  =  # uses the custom destructor  var  x :  CustomObject\n This is a current limitation that will be improved in future versions of the compiler.\n  This is an experimental feature available via   { .experimental:   &#34;strictFuncs&#34; .} pragma inyour code or via the  --experimental:strictFuncs switch.\n It introduces a stricter definition of a “side effect”:If an object is reachable via a parameter that is not declared as a  var parameter,any mutation to that object counts as a side effect.\n  {. experimental :  &#34;strictFuncs&#34; .} type  Node  =  ref  object  le ,  ri :  Node  data :  string func  len ( n :  Node ):  int  =  # valid: len does not have side effects  var  it  =  n  while  it  !=  nil :  inc  result  it  =  it . ri func  mut ( n :  Node )  =  let  m  =  n  # is the statement that connected the mutation to the parameter  m . data  =  &#34;yeah&#34;  # the mutation is here  # Error: &#39;mut&#39; can have side effects  # an object reachable from &#39;n&#39; is potentially mutated\n    Added some enhancements to  std/jsonutils module.  Added a possibility to deserialize JSON arrays directly to  HashSet and OrderedSet types and respectively to serialize those types to JSON arraysvia  jsonutils.fromJson and  jsonutils.toJson procedures.\n  Added a possibility to deserialize JSON  null objects to Nim option objectsand respectively to serialize Nim option object to JSON object if  isSomeor to JSON null object if  isNone via  jsonutils.fromJson and jsonutils.toJson procedures.\n  Added a  Joptions parameter to  jsonutils.fromJson currentlycontaining two boolean options  allowExtraKeys and  allowMissingKeys.  If  allowExtraKeys is  true Nim’s object to which the JSON is parsed isnot required to have a field for every JSON key.\n  If  allowMissingKeys is  true Nim’s object to which JSON is parsed isallowed to have fields without corresponding JSON keys.\n            The default hash for  Ordinal has changed to something more bit-scrambling. import hashes; proc hash(x: myInt): Hash = hashIdentity(x) recovers the oldone in an instantiation context while  -d:nimIntHash1 recovers it globally.\n    File handles created from high-level abstractions in the stdlib will no longerbe inherited by child processes. In particular, these modules are affected: asyncdispatch,  asyncnet,  system,  nativesockets,  net and  selectors.\n  For  asyncdispatch,  asyncnet,  net and  nativesockets, an  inheritableflag has been added to all  procs that create sockets, allowing the user tocontrol whether the resulting socket is inheritable. This flag is provided toease the writing of multi-process servers, where sockets inheritance isdesired.\n  For a transition period, define  nimInheritHandles to enable file handleinheritance by default. This flag does  not affect the  selectors moduledue to the differing semantics between operating systems.\n  asyncdispatch.setInheritable,  system.setInheritable and nativesockets.setInheritable are also introduced for setting file handle orsocket inheritance. Not all platforms have these  procs defined.\n  The file descriptors created for internal bookkeeping by  ioselector_kqueueand  ioselector_epoll will no longer be leaked to child processes.\n  strutils.formatFloat with  precision = 0 has been restored to the version1 behaviour that produces a trailing dot, e.g.  formatFloat(3.14159, precision = 0)is now  3., not  3.\n    relativePath(rel, abs) and  relativePath(abs, rel) used to silently give wrong results(see #13222); instead they now use  getCurrentDir to resolve those cases,and this can now throw in edge cases where  getCurrentDir throws. relativePath also now works for js with  -d:nodejs.\n  JavaScript and NimScript standard library changes:  streams.StringStream isnow supported in JavaScript, with the limitation that any buffer  pointersused must be castable to  ptr string, any incompatible pointer type will notwork. The  lexbase and  streams modules used to fail to compile onNimScript due to a bug, but this has been fixed.\n  The following modules now compile on both JS and NimScript:  parsecsv, parsecfg,  parsesql,  xmlparser,  htmlparser and  ropes. Additionallysupported for JS is  cstrutils.startsWith and  cstrutils.endsWith, forNimScript:  json,  parsejson,  strtabs and  unidecode.\n  Added  streams.readStr and  streams.peekStr overloads toaccept an existing string to modify, which avoids memoryallocations, similar to  streams.readLine (#13857).\n      Improvements to the  bitops module, including bitslices, non-mutating versionsof the original masking functions,  mask/ masked, and varargs support for bitand,  bitor, and  bitxor.\n  sugar.=&gt; and  sugar.-&gt; changes: Previously  (x, y: int) was transformedinto  (x: auto, y: int), it now becomes  (x: int, y: int) for consistencywith regular proc definitions (although you cannot use semicolons).\n  Pragmas and using a name are now allowed on the lefthand side of  =&gt;. Hereis an example of these changes:\n  import  sugar foo ( x ,  y :  int )  {. noSideEffect .}  =&gt;  x  +  y # is transformed into proc  foo ( x :  int ,  y :  int ):  auto  {. noSideEffect .}  =  x  +  y\n  The fields of  times.DateTime are now private, and are accessed with getters and deprecated setters.\n  The  times module now handles the default value for  DateTime more consistently.Most procs raise an assertion error when givenan uninitialized  DateTime, the exceptions are  == and  $ (which returns  &#34;Uninitialized DateTime&#34;).The proc  times.isInitialized has been added which can be used to check ifa  DateTime has been initialized.\n  Fix a bug where calling  close on io streams in  osproc.startProcess was a noop and led tohangs if a process had both reads from stdin and writes (e.g. to stdout).\n          net.newContext now defaults to the list of ciphers targeting “Intermediate compatibility”per Mozilla’s recommendation instead of  ALL. This change should protectusers from the use of weak and insecure ciphers while still providesadequate compatibility with the majority of the Internet.\n  A new module  std/jsonutils with hookable  jsonTo,toJson,fromJson operations for jsonserialization/deserialization of custom types was added.\n  A new proc  heapqueue.find[T](heap: HeapQueue[T], x: T): int to get index of element  xwas added.\n        Added  random.gauss, that uses the ratio of uniforms method of sampling from a Gaussian distribution.\n    typetraits.$ changes:  $(int,) is now  &#34;(int,)&#34; instead of  &#34;(int)&#34;; $tuple[] is now  &#34;tuple[]&#34; instead of  &#34;tuple&#34;; $((int, float), int) is now  &#34;((int, float), int)&#34; instead of  &#34;(tuple of (int, float), int)&#34;\n          Made  maxLines argument  Positive in  logging.newRollingFileLogger,because negative values will result in a new file being created for each loggedline which doesn’t make sense.\n  Changed  log in  logging to use proper log level for JavaScript,e.g.  debug uses  console.debug,  info uses  console.info,  warn uses  console.warn, etc.\n  Tables, HashSets, SharedTables and deques don’t require anymore that the passedinitial size must be a power of two - this is done internally.Proc  rightSize for Tables and HashSets is deprecated, as it is not needed anymore. CountTable.inc takes  val: int again not  val: Positive; i.e. it can “count down” again.\n        std/with,  sugar.dup now support object field assignment expressions:  import  std / with type  Foo  =  object  x ,  y :  int var  foo  =  Foo () with  foo :  x  =  10  y  =  20 echo  foo\n  Proc  math.round is no longer deprecated. The advice to use  strformat insteadcannot be applied to every use case. The limitations and the (lack of) reliabilityof  round are well documented.\n  Added  getprotobyname to  winlean. Added  getProtoByname to  nativesockets which returns a protocol codefrom the database that matches the protocol  name.\n          Added the below  toX procs for collections. The usage is similar to procs such as sets.toHashSet and  tables.toTable. Previously, it was necessary to create therespective empty collection and add items manually.  critbits.toCritBitTree, which creates a  CritBitTree from an  openArray of items or an  openArray of pairs.\n  The  =destroy hook no longer has to reset its target, as the compiler now automatically inserts wasMoved calls where needed.\n  The  = hook is now called  =copy for clarity. The old name  = is still available so thereis no need to update your code. This change was backported to 1.2 too so you can use themore readable  =copy without loss of compatibility.\n  In the newruntime it is now allowed to assign to the discriminator fieldwithout restrictions as long as the case object doesn’t have a custom destructor.The discriminator value doesn’t have to be a constant either. If you have acustom destructor for a case object and you do want to freely assign discriminatorfields, it is recommended to refactor the object into 2 objects like this:\n  type  MyObj  =  object  case  kind :  bool  of  true :  y :  ptr  UncheckedArray [ float ]  of  false :  z :  seq [ int ] proc  `=destroy` ( x :  MyObj )  =  if  x . kind  and  x . y  !=  nil :  deallocShared ( x . y )\n    type  MySubObj  =  object  val :  ptr  UncheckedArray [ float ]  MyObj  =  object  case  kind :  bool  of  true :  y :  MySubObj  of  false :  z :  seq [ int ] proc  `=destroy` ( x :  MySubObj )  =  if  x . val  !=  nil :  deallocShared ( x . val )\n  getImpl on enum type symbols now returns field syms instead of idents. This helpswith writing typed macros. The old behavior for backwards compatibility can be restoredwith  --useVersion:1.0.\n  The typed AST for proc headers will now have the arguments be syms instead of idents.This helps with writing typed macros. The old behaviour for backwards compatibility canbe restored with  --useVersion:1.0.\n      Exceptions inheriting from  system.Defect are no longer tracked withthe  .raises: [] exception tracking mechanism. This is more consistent with thebuilt-in operations. The following always used to compile (and still does):  proc  mydiv ( a ,  b ):  int  {. raises :  [] .}  =  a  div  b  # can raise an DivByZeroDefect\n    proc  mydiv ( a ,  b ):  int  {. raises :  [] .}  =  if  b  ==  0 :  raise  newException ( DivByZeroDefect ,  &#34;division by zero&#34; )  else :  result  =  a  div  b\n  The reason for this is that  DivByZeroDefect inherits from  Defect andwith  --panics:on  Defects become unrecoverable errors.\n                There is a new experimental feature called “strictFuncs” which makes the definition of .noSideEffect stricter.  See herefor more information.\n  “for-loop macros” (see  the manual) are no longeran experimental feature. In other words, you don’t have to write pragma  { .experimental:   &#34;forLoopMacros&#34; .} if you want to use them.\n  Added the  .noalias pragma. It is mapped to C’s  restrict keyword for the increasedperformance this keyword can enable.\n  items no longer compiles with enums with holes as its behavior was error prone, see #14004.\n    Added the  std/effecttraits module for introspection of the inferred effects.We hope this enables  async macros that are precise about the possible exceptions thatcan be raised.\n  The pragma blocks   { .gcsafe. } :   ... and   { .noSideEffect. } :   ... can now also bewritten as   { .cast(gcsafe). } :   ... and   { .cast(noSideEffect). } :   .... This is the newpreferred way of writing these, emphasizing their unsafe nature.\n  New command:  nim r main.nim [args...] which compiles and runs main.nim, and implies  --usenimcacheso that the output is saved to $nimcache/main$exeExt, using the same logic as  nim c -r toavoid recompilations when sources don’t change.Example:  nim r compiler/nim.nim --help  # only compiled the first time echo  &#39;import os; echo getCurrentCompilerExe()&#39; | nim r -  # this works toonim r compiler/nim.nim --fullhelp  # no recompilationnim r --nimcache:/tmp main  # binary saved to /tmp/main\n  --hint:processing is now supported and means  --hint:processing:on(likewise with other hints and warnings), which is consistent with all other bool flags.(since 1.3.3).\n    Added the new hint  --hint:msgOrigin will show where a compiler msg (hint|warning|error)was generated; this helps in particular when it’s non obvious where it came fromeither because multiple locations generate the same message, or because themessage involves runtime formatting.\n  Added the new flag  --backend:js|c|cpp|objc (or -b:js etc), to change the backend; can beused with any command (e.g. nim r, doc, check etc); safe to re-assign.\n  Added the new flag  --doccmd:cmd to pass additional flags for runnableExamples,e.g.:  --doccmd:-d:foo --threadsuse  --doccmd:skip to skip runnableExamples and rst test snippets.\n    runnableExamples &#34;-b:cpp -r:off&#34;: code is now supported, allowing to overridehow an example is compiled and run, for example to change the backend.\n  nim doc now outputs under  $projectPath/htmldocs when  --outdir is unspecified(with or without  --project); passing  --project now automatically generatesan index and enables search.See  docgen for details.\n          $getType(untyped) is now “untyped” instead of “expr”,  $getType(typed) isnow “typed” instead of “stmt”.\n  Sink inference is now disabled per default and has to enabled explicitly via --sinkInference:on.  Note: For the standard library sink inference remainsenabled. This change is most relevant for the  --gc:arc,  --gc:orc memorymanagement modes.\n  nimsuggest now returns both the forward declaration and theimplementation location upon a  def query. Previously the behavior wasto return the forward declaration only.\n  Fixed “Critical: 1 completed Future, multiple await: Only 1 await will be awakened (the last one)”( #13889)\n        Fixed ““distinct uint64” type corruption on 32-bit, when using {.borrow.} operators”( #13902)\n      Fixed “C compile error with –gc:arc on version 1.2.0 “unknown type name ‘TGenericSeq’”( #13863)\n  Fixed “var return type for proc doesn’t work at c++ backend”( #13848)\n      Fixed “simple ‘var openarray[char]’ assignment crash when the openarray source is a local string and using gc:arc”( #14003)\n    Fixed “ for a in MyEnum gives incorrect results with enum with holes”( #14001)\n              Fixed “Annoying warning: inherit from a more precise exception type like ValueError, IOError or OSError [InheritFromException]”( #14052)\n  Fixed “relativePath(“foo”, “/”) and relativePath(“/”, “foo”) is wrong”( #13222)\n    Fixed “Exception types in the stdlib should inherit from  CatchableError or  Defect, not  Exception”( #10288)\n                    Fixed “nim jsondoc -o:doc.json filename.nim fails when sequences without a type are used”( #14066)\n        Fixed “Nim doc fail to run for nim 1.2.0 (nim 1.0.4 is ok)”( #13986)\n      Fixed “import os + use of existsDir/dirExists/existsFile/fileExists/findExe in config.nims causes “ambiguous call’ error”( #14142)\n  Fixed “import os + use of existsDir/dirExists/existsFile/fileExists/findExe in config.nims causes “ambiguous call’ error”( #14142)\n  Fixed “runnableExamples doc gen crashes compiler with  except Exception as e syntax”( #14177)\n                    Fixed “[ARC] “internal error: environment misses: a” in a finalizer”( #14243)\n          Fixed “Invalid return value of openProcess is NULL rather than INVALID_HANDLE_VALUE(-1) in windows”( #14289)\n    Fixed “Building koch on OpenBSD fails unless the Nim directory is in  $PATH”( #13758)\n  Fixed “[gc:arc] case object assignment SIGSEGV: destroy not called for primitive type “( #14312)\n    Fixed “Getting “Warning: Cannot prove that ‘result’ is initialized” for an importcpp’d proc with  var T return type”( #14314)\n        Fixed “SIGSEV encountered when creating threads in a loop w/ –gc:arc”( #13935)\n          Fixed “nimvm: sysFatal: unhandled exception: ‘sons’ is not accessible using discriminant ‘kind’ of type ‘TNode’ [FieldError]”( #14340)\n            Fixed “runnableExamples block with  except on specified error fails with  nim doc”( #12746)\n                        Fixed “ nim doc --project shows ‘@@/’ instead of ‘../’ for relative paths to submodules”( #14448)\n    Fixed “runnableExamples should preserve source code doc comments, strings, and (maybe) formatting”( #8871)\n        Fixed “lent is unsafe: after #14447 you can modify variables with “items” loop for sequences”( #14498)\n  Fixed “ var op = fn() wro\n......", "posttime": "2020-10-16 20:59:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nim", "title": "NIM 1.4", "title_en": "Nim 1.4", "transed": 1, "url": "https://nim-lang.org/blog/2020/10/16/version-140-released.html", "via": "", "real_tags": ["nim"]}, {"category": "", "categoryclass": "", "imagename": "6056dc85b9158a8361b9aaf1d3230fb6.jpg", "infoid": 1029229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个家庭办公室最重要的配件之一经常被忽视：椅子。随着今年与新冠肺炎有关的社交疏远和强制远程工作，我们中的许多人花在家里办公桌前的时间比以前多得多-如果没有合适的椅子，这些额外的时间可能会转化为不适或直接的背部疼痛。\n我从来没有买过便宜的办公椅--一把350美元的中靠背办公椅经常会变成痛苦的宝座，如果没有足够长的休息时间站起来走动的话。时髦的副翼座椅为长时间的坐着工作提供了更好的人体工程学支持-但对我们许多人来说，1100美元以上的价格有点让人难以接受。这就留下了家庭办公人员的秘密武器--游戏椅。\n我的经验是，当你买游戏椅时，你会花更多的钱买到更多-更舒适的椅子。它们是为最大限度的舒适性和人体工程学的长时间坐姿支撑而设计的，而且它们通常比办公椅更适合支撑更大更重的人。他们需要在合理的预算内做到这一点。\n今年早些时候，当封锁袭击了索尔特一家时，我并不知道我需要一把新椅子--1069美元的副翼座椅是不可能的。在网上搜索和在Reddit上阅读用户评论后，我决定选择420美元的SECRETLab Omega。在我买的东西送到后不久，安达联系了我，让我看看它450美元的Fnatic-效果很好，因为我在楼下有一间办公室(用于逃避孩子们去上班)，在楼上有一间办公室(用于工作，但孩子们仍然可以接近)。\n当你第一次打开欧米茄的装运容器时，你会看到大小和形状完美的泡沫块，新椅子的每个部分都有整齐的切口，还有一个同样整洁的小工具包来组装它。组装说明书是全彩色印刷的，并附有照片，印在一张海报大小的单张上。", "note_en": "One of the most important accessories of every home office frequently gets overlooked: the chair. With this year&#39;s COVID-19-related social distancing and mandatory remote work, many of us are spending a lot more time behind a desk at home than before—and without the right chair, that extra time can translate into discomfort or outright back pain.\n I&#39;ve never had much luck with &#34;cheap&#34; office chairs—a $350 mid-back office chair frequently turns into a throne of pain without sufficient extended breaks to get up and move around. Trendy Aeron chairs provide somewhat better ergonomic support for extended periods of seated work—but their $1,100 and up price tag is a little hard to swallow for many of us. This leaves the home office worker&#39;s secret weapon—the gaming chair.\n It has been my experience that you get more—and more comfortable—chair for your money when you shop for gaming chairs. They&#39;re designed for maximum comfort and ergonomic support for long seating periods, and they&#39;re generally designed to support larger and heavier people than office chairs are as well. And they need to do it within a reasonable budget.\n When the lockdown hit the Salter household earlier this year, it wasn&#39;t long before I knew I need a new chair—and a $1,069  Aeron was out of the question. After some searching online and reading user reviews at Reddit, I decided on the $420 Secretlab  Omega. Not long after my purchase arrived, Anda reached out to ask me to review its $450  Fnatic—which worked out well, since I have one downstairs office (for escaping my kids to work) and one upstairs office (for working, but staying accessible to the kids).\n     When you first open the Omega&#39;s shipping container, you&#39;re presented with perfectly sized and shaped foam blocks with neat cutouts for every part of your new chair, and an equally neatly presented little toolkit to assemble it with. The assembly instructions are printed in full color, with photographs, in a single, large poster-sized sheet.", "posttime": "2020-10-16 20:45:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,chairs", "title": "您是坐游戏椅还是坐在家里的椅子上工作？ARS测试两个500美元以下的产品", "title_en": "Gaming chairs or work from home chairs? Ars tests two under $500", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/gaming-chair-shootout-secretlab-omega-vs-anda-fnatic/", "via": "", "real_tags": ["游戏", "chairs"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我非常肯定，到目前为止，我生命中最艰难的选择是在我的两个爱好之间做出选择：一方面是音乐，另一方面是计算机编程。编程赢了，我想这将是一个更有利可图的职业领域，而且它更适合我的才华。从5岁到8岁，我上小提琴课，每一分钟都很讨厌。然后从8点到10点我学钢琴，我对此也很讨厌。17岁时，在一位朋友的坚持下(嗨，M。)。我买了一个萨克斯管，因为我喜欢它的声音，还学习了如何演奏。不需要读音符，只是跟着我喜欢的音乐一起演奏，我对此没有多少乐趣。由于双重肺炎引起的并发症，我最终不得不放弃了，但它给了我很大的满足感。然后我试了试长笛，但没有给我同样的感觉。\n学习如何演奏乐器是一种挫折中的练习，尤其是在刚开始的时候。有这么多动听的音乐，但你一首都弹不出来。但事情不一定是这样的。如果你能想出一种方法来逐渐学习如何演奏，同时在这个过程中还能制作出动听的音乐，那会怎么样？\n孩子们--今天，但在过去可能一样多--生活在一个充满强大诱惑的世界里。视频游戏被磨练成超级上瘾的，各种其他的分心事情都会与家庭作业和其他技能的获得竞争。我有几个这样的人，虽然他们相当聪明，但他们粘在电脑(和平板电脑)上的程度让我感到担忧。是的，我试图成为一名负责任的家长，但赢得这场争论并不总是那么容易，特别是因为我自己的日子都是在专业的电脑前度过的。\n当新冠肺炎出道时，我决定重新燃起我对音乐的热爱。又是钢琴，但这一次是因为我想要它，不是因为来自外部的压力和我自己的方式，而是我自己，专注于制作音乐，而不是“无聊的部分”，我想如果我能保持兴趣，总有一天我也会这样做的。到目前一切尚好。现在，六个月过去了，在各种软件工具的帮助下，我在弹奏和阅读笔记方面变得更好了。这些工具让我觉得它们可以改进。市面上有很多软件可以帮你弹奏，我找到了一个叫‘钢琴助推器’的软件，我很喜欢。但它也有它的缺点。所以我决定做一个更新的版本，在浏览器中运行，并对UI(代码都是新的)进行大量修改，以形成键盘教学套件的引擎。今天我很高兴地宣布，它现在已经完成了，希望它已经对其他人有用了。\n下面是我的一个儿子(卢卡)使用的早期测试版：\n为了给出一些背景，通常你不能用撬棍把卢卡从他的视频游戏中带走。在获得软件和他最喜欢的一首音乐(艾伦·沃克的“褪色”)的配乐后，他从完全不能阅读音符，到能够在几天的时间里跟着它一起演奏。在其中一首曲子上，他在键盘前连续练习了五个小时。显然，他的技术需要(大量)工作，而且只是右边的部分，但(1)他做得很开心，(2)有很大的进步。我在波兰的一位合作这个项目的同事(Radek)和他的儿子也有过类似的经历(只是他们做了“我的世界”主题)。\n这个软件的工作方式很简单：你找到一个你想练习的乐曲的MIDI文件，上传到软件中，你就可以退出比赛了。有一个支持MIDI的键盘是必须的(一个漂亮的屏幕当然会有帮助)。不幸的是，因为Mozilla太忙于改进世界而不是他们的浏览器，而且Firefox不支持WebMIDI，所以你必须使用Chrome，否则它不会工作。还有一些明显的缺点：休息点还没有处理，分数渲染肯定有很多地方可以改进。但是开始就在那里，如果它对我们有用，那么它也可能对你有用。我们有一些非常早期的测试者，我真的很感谢他们的贡献和错误报告，没有他们，这就不会是现在的完善和功能状态。该软件不需要创建服务、订阅或帐户，所有数据都存储在您的本地计算机上。有一个非常强大的“自动”模式，它会根据你仍然薄弱的部分自动创建一些可供练习的课程，一个整洁的进度指示器会告诉你在掌握正在练习的作品的过程中做得如何。\n有一个你想练习的曲目的半体面的MIDI文件是必须的，这样的MIDI文件有很多来源，我们在软件中内置了三个简单的测试文件，这样你就有了开始的东西，但如果你想要更多，你必须自己添加文件(使用软件中的界面，这是微不足道的)。\n所以，如果你周围有一个支持MIDI的键盘，并且你想提高你的钢琴演奏技能，那就去PianoJacq.com，这是我们对发动机试验台的暂定名称。随着时间的推移，我们将围绕它建立一个更完整的服务，但目前它应该已经足够有用，可以向更多的受众展示，并让人们有机会与我们一起帮助塑造它。在这种情况下：功能请求、错误报告、任何类型的反馈，无论是正面的还是负面的，都是非常受欢迎的。请欣赏！，Jacques Mattheij，Radek Korbecki&and；Andrew Fiorillo。\n该软件不是“开源”的，我们还没有决定长期如何推进这个项目，但代码在GitLab上，如果你想看看是什么让它运转或提出改进建议，当然非常欢迎你这样做。其中一个重点是让它独立于任何服务器工作，你可以从本地计算机的zip文件中轻松地部署它，就像你可以在Web上运行它一样，所以即使当你没有互联网连接或我们公司发生了一些事情时，它也可以工作，这与我认为Web应用程序的分发方式是一致的。请注意，对于我们来说，通过创建帐户来强迫我们的用户与我们建立关系是微不足道的，我们非常有意识地选择了不这样做。", "note_en": "I’m pretty sure that the hardest choice in my life to date has been the one between my two loves: music on the hand and computer programming on the other. The programming won out, I figured it would be a much more lucrative field to pursue a career in, besides it was a much better match for my talents. From the age of 5-8 I did violin lessons and hated every moment of it. Then from 8-10 I did piano, and hated that about as much. At 17 at the insistence of a friend (hi M.) I bought a saxophone because I loved the sound of it and learned how to play. No note reading involved, just playing along with music that I liked and I had enless fun with it. Due a complication stemming from a double pneumonia I ended up having to give it up but it gave a lot of satisfaction. Then I tried the flute for a bit but it did not give me the same feeling.\n Learning how to play an instrument is an exercise in frustration, especially in the beginning. There is so much beautiful music and yet, you can’t play any of it. But it need not be that way. What if you could come up with a way to gradually learn how to play while still making nice music in the process?\n Kids - today, but in the past probably just as much - are living in a world of very powerful temptations. Video games honed to be super addictive and all kinds of other distractions compete with homework and the acquisition of other skills. I’ve got a couple of those and while they are pretty clever the degree to which they are glued to their computers (and tablets) worries me. Yes, I try to be a responsible parent but it isn’t always easy to win that argument, especially not because my own days are spent in front of the computer professionally.\n When COVID-19 hit I decided to re-kindle my love for making music. Piano again, but this time because  I wanted it, not because of pressure from the outside and in my own way, and on my own, focusing on making music rather than the ‘boring parts’, I figured if I can stay interested that will one day come as well. So far so good. Now, six months later and with the help of various software tools I’m getting better at playing and reading notes. These tools left me feeling they could be improved upon. There is a lot of software out there that helps you play, I found one called ‘Pianobooster’ that I liked a lot. But it too had its shortcomings. So I decided to make a much updated version of it, running in the browser and with a bunch of modifications to the ui (the code is all new) to form the engine of a keyboard teaching suite. Today I’m happy to announce that it is now finished to the point where it is hopefully already useful to others.\n Here an early beta version of it is used by one of my sons (Luca):\n  To give some context, normally you can’t get Luca away from his video games with a crowbar. After being given access to the software and the score of one of his favorite pieces of music (Alan Walker’s ‘Faded’) he went from not being able to read notes at all to being able to play along with it in the space of a few days. On one of these he was at the keyboard for five hours at a stretch to practice. Obviously, his technique needs (a lot of) work and it is only the right hand part but (1) he’s having fun doing it and (2) there is a lot of progress. A colleague of mine in Poland who collaborated on this project (Radek) had a similar experience with his son (only they did the Minecraft theme).\n The way the software works is very simple: you find a midi file of the piece that you want to practice, upload it into the software and you’re off the races. Having a midi capable keyboard is a must (and a nice screen certainly helps). Unfortunately, because Mozilla is too busy improving the world instead of their browser and WebMIDI is not supported on Firefox you  have to use Chrome otherwise it won’t work. There are still some obvious shortcomings: rests are not dealt with at all yet, and the score rendering can definitely be improved in many places. But the start is there and if it is useful for us then it may be useful to you. We’ve had some very early beta testers and I would really like to thank them for their contributions and bug reports, without them this would not be at the state of polish and functionality that it is. The software does not require a service, subscription or account to be created, all of the data is stored on your local computer. There is a very powerful ‘auto’ mode that automatically creates little lessons to practice based on the parts where you are still weak, and a neat progress indicator shows you how you are doing on the way to mastery of the piece you are practicing.\n Having a half decent midi file of the piece that you want to practice is a must, there are many sources for such midi files, we’ve built in three simple test files into the software so you have something to start with, but if you want more than that you will have to add the files yourself (which is trivial, using the interface in the software).\n So, if you have a midi capable keyboard laying around and you want to improve your piano playing skills, head on over to  PianoJacq.com, which is our working title for the testbed of the engine. In time we will build a much more complete service around it but for now it should already be useful enough to be exposed to a larger audience and to give people the opportunity to help shape it with us. In that light: feature requests, bug reports, any kind of feedback, both positive and negative is much appreciated. Enjoy!, Jacques Mattheij, Radek Korbecki &amp; Andrew Fiorillo.\n The software is not ‘open source’, we have not yet decided on how we plan to go forward with this project in the longer term, but the code is on GitLab and if you want to see what makes it tick or suggest improvements then of course you are more than welcome to do so. One of the focal points was to make it work independent of any server and you can just as easily deploy it from a zip file on your local computer as you can run it on the web, so it will even work when you have no internet connection or if something should happen to our company, which is in line with how I think web applications should be distributed. Note that it would have been trivial for us to force our users into a relationship with us by having to make an account and we made a very conscious choice not to do this.", "posttime": "2020-10-16 20:39:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,easy,音乐", "title": "PianoJacq，学习钢琴的一种简单方法", "title_en": "Pianojacq, an easy way to learn to play the piano", "transed": 1, "url": "https://jacquesmattheij.com/2020-09-20-pianojacq-learn-to-play-piano/", "via": "", "real_tags": ["学习", "easy", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要在您的计算机上观看来自vlc的流，请运行：nix-shell--package vlc--run&#34；vlc https://dash.nixcon.net/dash/master.m3u8&#34；", "note_en": "To watch the stream from VLC on your computer, run: nix-shell --packages vlc --run &#34;vlc https://dash.nixcon.net/dash/master.m3u8&#34;", "posttime": "2020-10-16 20:39:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nixcon,vlc", "title": "NixCon现场直播", "title_en": "NixCon Live", "transed": 1, "url": "https://2020.nixcon.org/live.html", "via": "", "real_tags": ["nixcon", "vlc"]}, {"category": "", "categoryclass": "", "imagename": "5c0cf59f1bc44e5ed13792663ce31454.jpg", "infoid": 1029225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约9000台设备-大部分运行Android，但也有Linux和达尔文操作系统-已经被限制在星际风暴中。星际风暴是一个僵尸网络的名字，它的主要目的是创建一项营利性的代理服务，可能是为了匿名的互联网使用。\n这一发现是基于安全提供商BitDefender的研究人员收集的几件证据。核心证据是作为管理基础架构一部分的一系列六个专用节点。其中包括：\nBitdefender的研究人员在周四发布的一份报告中写道，这些节点一起负责检查节点可用性，连接到代理节点，托管web API服务，签署授权消息，甚至在开发阶段测试恶意软件。“与其他开发选择一起，这让我们相信僵尸网络被用作代理网络，有可能作为匿名服务提供。”\n这并不是研究人员第一次发现僵尸网络被用来提供准匿名互联网使用的网络。早在2008年，安全记者布莱恩·克雷布斯(Brian Krebs)就对此进行了多年来的报道。不同的研究人员也记录了它们。这次Bitdefender发现有趣的一件事是，匿名代理是在透明网而不是在暗网论坛上发布的。", "note_en": "Some 9,000 devices—mostly running Android, but also the Linux and Darwin operating Systems—have been corralled into the Interplanetary Storm, the name given to a botnet whose chief purpose is creating a for-profit proxy service, likely for anonymous Internet use.\n The finding is based on several pieces of evidence collected by researchers from security provider Bitdefender. The core piece of evidence is a series of six specialized nodes that are part of the management infrastructure. They include a:\n   Together, these nodes “are responsible for checking for node availability, connecting to proxy nodes, hosting the web API service, signing authorized messages, and even testing the malware in its development phase,” Bitdefender researchers wrote in a  report published on Thursday. “Along with other development choices, this leads us to believe that the botnet is used as a proxy network, potentially offered as an anonymization service.”\n It’s not the first time researchers have found botnets used to provide networks for quasi-anonymous Internet usage. Security journalist Brian Krebs has  reported on them over the years since as  early as 2008. Various  researchers have  also documented  them. One thing that Bitdefender found interesting about this time is that the anonymous proxy was being advertised on the clearnet rather than in darknet forums.", "posttime": "2020-10-16 20:25:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "物联网,感染,infected,网络", "title": "数千台受感染的物联网设备用于营利性匿名服务", "title_en": "Thousands of infected IoT devices used in for-profit anonymity service", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/thousands-of-infected-iot-devices-used-in-for-profit-anonymity-service/", "via": "", "real_tags": ["物联网", "感染", "infected", "网络"]}, {"category": "", "categoryclass": "", "imagename": "2e853217c940e448a8c33d93933e6add.jpg", "infoid": 1029224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "信息专员办公室(ICO)对英国航空公司(British Airways)处以2000万英镑(约合2600万美元)的罚款，原因是一起数据泄露事件影响了40多万名客户。\n这笔罚款比ICO最初表示打算在2019年开出的1.83亿GB要小得多。\n这起事件发生时，英航的系统被攻击者攻破，然后在输入客户详细信息时进行修改，以获取他们的详细信息。\n两个月后，一名安全研究人员让英国航空公司知道了这一点，然后通知了ICO。\n被盗资料包括登入资料、支付卡及旅游预订资料，以及姓名和地址资料。\n随后的调查得出结论，当时没有采取足够的安全措施，如多因素身份验证。\nICO指出，其中一些措施可以在英航当时使用的微软操作系统上使用。\n当组织机构围绕人们的个人数据做出糟糕的决定时，这可能会对人们的生活产生真正的影响。信息专员伊丽莎白·德曼(Elizabeth Denman)说，法律现在给了我们鼓励企业对数据做出更好决定的工具，包括投资于最新的安全措施。\n英国航空公司(British Airways)表示，一旦发现其系统受到攻击，就立即通知了客户。\n一位发言人表示：我们很高兴ICO认识到，自袭击发生以来，我们已经对 的系统安全做出了相当大的改善，我们完全配合了ICO的调查。\n数据保护官员卡尔·戈特利布(Carl Gottlieb)表示，在目前的气候下，2000万GB是一个很大的数字。\n这表明ICO是认真的，没有让苦苦挣扎的公司因数据保护失败而逍遥法外，他说。\n英航花了两年多的时间才直面这起极其严重的事件的后果。\n该公司违反了数据保护法，未能保护自己免受可预防的网络攻击。然后，它未能检测到黑客攻击，直到对数十万客户造成了损害。\n事件和罚款之间的滞后已经引起了隐私圈的关注，但我了解到信息专员办公室一直在有条不紊地工作，以求做到这一点。这是这位专员根据欧盟数据法规GDPR开出的第一张罚单，受到欧洲其他国家的密切关注，认为这可能是一项里程碑式的决定。\n2000万GB的最终数字让许多人感到震惊，他们原本预计它会更接近最初提出的令人眼花缭乱的183M，但对于数据隐私和GDPR来说，这仍然是一个重要的时刻。如果其他公司也未能保护客户，他们将把罚款视为未来的一种形式。", "note_en": "British Airways has been fined £20m ($26m) by the Information Commissioner&#39;s Office (ICO) for a data breach which affected more than 400,000 customers.\n  The fine is considerably smaller than the £183m that the ICO originally said it intended to issue back in 2019.\n   The incident took place when BA&#39;s systems were compromised by its attackers, and then modified to harvest customers&#39; details as they were input.\n It was two months before BA was made aware of it by a security researcher, and then notified the ICO.\n  The data stolen included log in, payment card and travel booking details as well name and address information.\n A subsequent investigation concluded that sufficient security measures, such as multi-factor authentication, were not in place at the time.\n The ICO noted that some of these measures were available on the Microsoft operating system that BA was using at the time.\n &#34;When organisations take poor decisions around people&#39;s personal data, that can have a real impact on people&#39;s lives. The law now gives us the tools to encourage businesses to make better decisions about data, including investing in up-to-date security,&#34; said Information Commissioner Elizabeth Denman.\n British Airways said it had alerted customers as soon as it had found out about the attack on its systems.\n &#34;We are pleased the ICO recognises that we have made considerable improvements to the security of our systems since the attack and that we fully co-operated with its investigation,&#34; said a spokesman.\n Data protection officer Carl Gottlieb said that in the current climate, £20m was a &#34;massive&#34; fine.\n &#34;It shows the ICO means business and is not letting struggling companies off the hook for their data protection failures,&#34; he said.\n   It&#39;s taken more than two years for BA to face the music over this extremely serious incident.\n The company breached data protection law and failed to protect themselves from preventable cyber attack. It then failed to detect the hack until the damage was done to hundreds of thousands of customers.\n The lag between incident and fine has raised eyebrows in privacy circles but I understand the Information Commissioner&#39;s Office has been working methodically to get it right. This is the commissioner&#39;s first fine under the EU data regulation GDPR and was being watched closely by the rest of Europe as a potential landmark decision.\n The final figure of £20m has come as a shock to many who were expecting it to be closer to the eye-watering £183m initially proposed but it is still a significant moment for data privacy and GDPR. Other companies will look at the fine as a shape of things to come if they also fail to protect customers.", "posttime": "2020-10-16 20:19:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,airways,ico", "title": "英国航空公司因数据泄露被罚款2000万GB", "title_en": "British Airways fined £20m over data breach", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-54568784", "via": "", "real_tags": ["数据", "airways", "ico"]}, {"category": "", "categoryclass": "", "imagename": "a37dca426644f923a08a6ec524bf5633.jpg", "infoid": 1029223, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1968年11月19日午夜前，在联合煤炭公司9号矿进行“猫眼换班”工作的99名工人走进9号煤矿的浴室，开始穿上厚厚的工作衫和沾满黑色污点的工作服。(​-​Eye Shift)。他们迷信，没有人敢把他们在矿井里的12到8个轮班称为“墓地轮班”。\n他们走进钢铁笼子，开始了近600英尺(​)、100英尺(​)的落差，落到了矿井油烟熏天的地面上。他们中年龄最大的是62岁的​，最小的只有19岁。他们住在西弗吉尼亚州北部名为伊达迈、进取号和辛斯顿的小矿业社区狭窄而崎岖的街道上。其中一个已经开采了40-​两年的煤，另一个只开采了8天。在CAT-​眼部换班的许多人都是退伍军人。到1968年，马里恩县已有1400人在越南作战。\n当他们到达底部时，矿工们分成了6到8个​的工作人员，登上了人工旅行-​电动火车-​，就像在铁轨上行驶或使用橡胶轮胎的车辆一样-​载着他们穿过9号庞大的蜘蛛隧道网络到达他们的工作站。在接下来的八个小时里，他们将切煤装煤。一名工作人员辛勤地解救一大块设备，这些设备在顶板坠落时被石板和碎片覆盖着，而其他人则从矿井丰富的煤层中挖出煤炭。\n但谋生并不是他们脑海中唯一的事情。他们知道，在他们之前工作的矿工轮班不得不停止挖掘三次，一次是两个半小时，而矿井的四个巨大的地面风扇将新鲜空气吸入隧道，稀释致命的甲烷气体。\n他们也知道，他们在为一家痴迷于尽可能多地开采煤炭的公司工作，这是全国最危险的工作。\n1963年，“大西洋月刊”称采煤为“殡仪业者的天堂”，这是有充分理由的。联邦政府从1900年开始编制煤矿死亡和严重事故的统计数据，到1968年11月，已有超过10.1万名煤矿工人被压死、毒气、触电或在地下焚烧，另有150万人受重伤。采煤业的工伤率是美国任何其他工业工作的4倍，比全国所有工人的平均水平高出14倍。\n至少还有15万名活跃和退休的煤矿工人患有尘肺，即黑肺，这是由于吸入煤尘而患上的，煤尘使他们的肺像渔网一样多孔，变成了喘息的残骸。\n合并后的煤炭公司和它经营第9号煤炭公司的鲁莽方式增加了这些严峻的统计数字。1954年，在11月一个寒冷的星期六，一次地下爆炸导致16名矿工死亡。一些工程师当时辩称，该矿太危险，太瓦斯，不能重新开工，但它的煤矿储量太丰富，所有者不能放弃。\n11年后，一个由4名​人组成的船员站在矿井577英尺深的卢埃林通风井内233英尺的脚手架上时，下面的火花点燃了一袋甲烷气体。这四个人就像是从火箭筒里被射出来的一样，在巨型竖井的嘴里绕来绕去。他们被撕碎的身体部位后来在距离竖井5英尺的一条小溪中被发现，这条小溪距离​有75米。\n合并煤炭公司干脆把这些损失作为做生意的代价注销了。到1968年，它已经成为全国最大的烟煤生产商。抱怨煤矿安全条件差的工人被忽视了，这家煤炭公司给了批评声音最大的人最危险的工作。\n联邦政府的态度也好不到哪里去。美国矿务局只分配了250名检查员来监督全国5400个矿井。16年来，他们只对一家运营商处以罚款。该局是煤炭行业的俘虏，其管理人员解雇或调动了那些过于努力地关闭大型煤矿的检查员。\n更糟糕的是，矿工自己的工会似乎更关心其丰厚的金库，而不是填满金库的人。美国矿工联合会(United Mine Workers Of America)有一个由一名矿工组成的安全部门。它的31区，也就是9号所在的地区，在1968年只花了14美元用于安全培训。\n十一月二十日午夜气温为35度。煤矿经营者对此不屑一顾，认为这是山里人的民间传说，但西弗吉尼亚州的每个矿工都知道11月和12月是爆炸季节。伴随着令人眼花缭乱的大气压下降的冷空气使矿井干涸，使它们充满了无味的甲烷气体，并与厚厚的煤尘混合在一起，由巨型电动连续采矿机搅动，旋转钻头像火车车厢的车轮那么大。即使是最微弱的火花也能将这种挥发性混合物变成类似火药的东西，并将矿井的竖井变成冒烟的地下大炮桶。\n这件事发生在距离9号煤矿仅7英里的莫农加。1907年12月初，在一个寒冷晴朗的日子，费尔蒙特煤炭公司6号和8号相互关联的煤矿发生地下爆炸，至少500名男子和男孩被粉碎。它可能造成了更多的死亡；没有人确切知道有多少新来的移民在这两个煤矿工作，其中大部分来自意大利和波兰。\n9号钻进了与莫农加煤矿相同的8英尺(​-​)厚、瓦斯充沛的匹兹堡煤层。它每天排放800万立方英尺的甲烷气体，足以为一个小城市供暖。矿井的四台高耸的地面通风机昼夜不停地运转，本应将足够的新鲜空气吸入矿井的隧道，以稀释和吹走这种无味但具有爆炸性的气体，但它们有时会破裂并关闭数小时。\n4点时，CAT-​眼班的工人们休息了一会儿，吃下了他们在矿井的“就餐洞”里带来的打包食物，然后休息了一下。\n就在这些人停下来吃东西的时候，Mods Run风扇，矿井的四个巨大的地面风扇之一，停了下来，扔掉了它的叶片。当这些人吃东西的时候，9号的西侧隧道开始充满致命的甲烷气体。78-​他们中的8个很快就会死。\n9号的安全系统被设计成在风扇停止通风后向矿工发出警告。每个风扇都连接到灯塔的一个展板上，灯塔是靠近矿井入口处的一座建筑，用于储存物资。当风扇减速或停止运转时，警示灯变成红色，警报响起，工人们撤离。作为Fail-​保险箱，该系统被设计为在风扇停机超过12分钟时切断9号的所有电源。\n也就是说，除非公司里有人认为切断电力和疏散矿工对切割和装载煤炭造成了太大的干扰。在Mods Run风扇停止工作之前的某个时候，一名煤炭公司员工关闭了风扇的警报系统。\n5点27分，一场猛烈的爆炸震撼了12英里外费尔蒙特的窗户，撕裂了矿井卢埃林入口的竖井。滚滚的蘑菇云，橙色和蓝色的火焰穿透其中，卷曲在矿井上方。酷热烧焦了9号停车场的几辆矿工的车。在这个庞大的矿井中的其他地方工作的13个人，争先恐后地爬到了水面上。一名起重机操作员使用临时吊桶又挖出了8个。\n当矿井喷出大火和烟雾时，消息传遍了9号被炸毁的阿巴拉契亚小社区。家人热泪盈眶，聚集在煤矿的煤渣砖公司商店，聚集在塑料家具中，凝视着滚滚的烟云。失踪男子的妻子中有一些是祖母，其他人还只有十几岁。那些以前经历过矿难的妇女怀疑是最糟糕的。他们对再也见不到他们的男人放弃了希望，到达后不久就回家了。其他以前没有受到地下爆炸影响的人则抱着希望，等待任何关于救援的消息。\n在感恩节前一周，煤矿工人被困在燃烧的洞中，这一可怕的戏剧性事件吸引了美国最大的日报和新闻网络，使这成为美国历史上第一次在全国范围内进行电视转播的重大矿难。虽然第一次爆炸导致一些矿工当场死亡，但其他人有足够的时间戴上防毒面具。救援人员后来发现了一个打开的急救工具箱和身体躺在一张帆布上，似乎一些被困人员躺在一起，以保存他们日益减少的新鲜空气供应。\n当煤炭行业的辩护者们在记者面前围着马车转的时候，新闻摄像机还在滚动。联合煤炭公司(Consolidation Coal Company)公关部负责人约翰·罗伯茨(John Roberts)将爆炸描述为“我们必须忍受的事情”，美国内政部助理部长J·科德尔·摩尔(J.Cordell Moore)和西弗吉尼亚州州长胡莱特·C·史密斯(Hulett C.Smith)也是如此。史密斯领导的该州，关于是否应该在公立学校开展性教育，而不是煤矿的安全问题，引发了更多的辩论。他对悲痛的家庭说，“我们必须认识到，这是一个危险的行业，这里发生的事情是作为一名矿工的危险之一。”\n但最令人惊讶的是W.A.的表演。“托尼”·博伊尔身穿华盛顿标志性制服--软呢帽，熨烫的西装，翻领上别着一朵红玫瑰。他在煤田的几次露面通常都是精心安排的，让他有时间穿上一条新工作服和闪亮的工作靴，但这一次博伊尔乘坐煤炭公司提供的直升机俯冲到了现场。\n当他走上公司商店匆忙搭建的讲台时，博伊尔震惊了许多聚集在一起听他说悲伤和愤怒话的人，相反，他用平淡的鼻音赞扬了Consolidation Coal Company的安全记录及其与工会合作的历史。他提醒这些家庭，好像他们还不知道一样，采煤是一种非常危险的谋生方式。UMWA主席为一家煤炭公司的严重疏忽(如果不是彻头彻尾的犯罪)辩护的公开场面，而他的78名矿工却被埋在燃烧的矿井中，这一公开场面震惊了许多围观者。“我当时就恨他，”朱迪·亨德森告诉“华盛顿邮报”，她现在已经是21岁的寡妇(Two-​One)。“我真不敢相信有人会在我们所有丈夫都被活埋的矿井前说出这样的话。”\n许多家庭一直抱有希望，直到感恩节后的第二天。11月29日星期五晚上，当他们聚集在詹姆斯·福克联合卫理公会教堂(James Fork United Methodist Church)内祈祷时，Consolidation Coal的总裁约翰·科克伦(John Corcoran)走上前，告诉他们封锁煤矿的时候到了。他已经在感恩节告诉一群地方部长没有希望了，但他不想在全国祈祷和感谢的日子里给这些家庭带来如此可怕的消息。\n这些悲痛的家庭-​有235名儿童失去了父亲，74名妇女在地下大火中失去了丈夫-​几乎没有理由相信，这场最新的煤矿灾难会得到与之前所有灾难不同的对待。国家对9号这样的悲剧的反应总是一样的：祈祷，对寡妇和儿童的同情之情的涌现，没有牙齿的煤矿安全立法，以及允许矿井里的事情照常进行的集体健忘症的回归。\n节选自“血流成河的煤炭：亚布朗斯基谋杀案和美国联合矿工之战”。版权所有©2020，作者：Mark A.Bradley。经出版商W.W.Norton&amp；Company，Inc.许可使用。版权所有。\n马克·A·布拉德利(Mark A.Bradley)曾是美国司法部律师、刑事辩护律师和中央情报局(CIA)情报官员。他是“血流成河的煤炭：亚布朗斯基谋杀案和美国联合矿工之战”的作者。他目前是美国国家档案和记录管理局信息安全监督办公室的主任，住在弗吉尼亚州的阿灵顿。", "note_en": "Just before midnight on November 19, 1968, ninety-​nine men working on the “cat-​eye shift” at Consolidation Coal Company’s Number 9 mine walked into its bathhouse and began pulling on their thick work shirts and darkly smudged overalls. Superstitious, none of them dared call their 12   to 8   turn in the mine the “graveyard shift.”\n They stepped into steel cages and started their nearly six-​hundred-​foot drop to the mine’s sooty floor. The oldest among them was sixty-​two, the youngest only nineteen. They lived on narrow, pitching streets in little northern West Virginia mining communities called Idamay, Enterprise, and Shinnston. One had mined coal for forty-​two years, another for just eight days. Many of the men on the cat-​eye shift were veterans. By 1968 1,400 men from Marion County had fought in Vietnam.\n When they reached the bottom, the miners broke into six- to eight-​man crews and boarded mantrips—​electric train–​like vehicles that ran on rails or had rubber tires—​that carried them through Number 9’s vast network of spidery tunnels to their workstations. For the next eight hours they would cut and load coal. One crew toiled at freeing a large piece of equipment that had been covered with slate and debris during a roof fall while the others clawed coal out of the mine’s rich seams.\n But earning a living was not the only thing on their minds. They knew that the shift of miners working before them had had to stop digging three times, once for two and a half hours, while the mine’s four giant surface fans drew fresh air into its tunnels and diluted deadly methane gas.\n They also knew that they were working at the most dangerous jobs in the country for a company that was obsessed with extracting as much coal as it could.\n  In 1963  The Atlantic called coal mining a “mortician’s paradise,” and for good reason. The federal government first began compiling statistics on coal-mining deaths and serious accidents in 1900, and by November 1968 over 101,000 coal miners had been crushed, gassed, electrocuted, or incinerated underground, while another 1.5 million had been seriously injured. Coal mining’s injury rate was four times higher than that of any other industrial job in the United States and fourteen times higher than the national average for all workers.\n At least another 150,000 active and retired coal miners had pneumoconiosis, or black lung, contracted by inhaling coal dust, which made their lungs as porous as fishing nets and turned them into wheezing wrecks.\n The Consolidation Coal Company and the reckless way it operated Number 9 had added to these grim statistics. In 1954 an underground blast killed sixteen miners working on a chilly Saturday in November. Some engineers argued then that the mine was too dangerous and gassy to reopen, but its coal deposits were too rich for its owners to abandon.\n Eleven years later, a four-​man crew was standing on a scaffold 233 feet inside the mine’s 577-​foot-​deep Llewellyn airshaft when a spark below ignited a pocket of methane gas. The four men were orbited up and out of the huge shaft’s mouth as if they had been shot out of a bazooka. Their shredded body parts were found later in a creek, seventy-​five feet from the shaft.\n Consolidation Coal Company simply wrote off these losses as the price of doing business. By 1968 it was the biggest bituminous coal producer in the country. Workers who complained about the mine’s poor safety conditions were ignored, and the coal company gave its loudest critics the most dangerous jobs.\n  The federal government’s attitude was no better. The United States Bureau of Mines had only 250 inspectors assigned to watch over the country’s 5,400 mines. They had fined only one operator in sixteen years. The bureau was a captive of the coal industry, and its managers fired or transferred inspectors who pushed too hard to close big mines.\n Worse, the miners’ own labor union seemed to care more about its fat coffers than the men who filled them. The United Mine Workers of America had a one-​man safety division. Its District 31, where Number 9 was located, spent only $14 on safety training in 1968.\n The temperature at midnight on November 20 was a chilly 35 degrees. Coal operators dismissed it as hillbilly folklore, but every miner in West Virginia knew that the months of November and December were the explosion season. Cold air accompanied by dizzying drops in barometric pressure dried out mines and caused them to fill with odorless methane gas and mix with thick coal dust, whipped up by giant electric continuous-mining machines, with rotary bits as big as a railroad boxcar’s wheels. The faintest spark could turn this volatile mixture into something like gunpowder and transform a mine’s shafts into smoking barrels of underground cannons.\n This had happened at Monongah, only seven miles from Number 9. On a cold clear day in early December 1907 an underground explosion inside the Fairmont Coal Company’s interconnected mines Numbers 6 and 8 pulverized at least five hundred men and boys. It likely killed a lot more; no one knew exactly how many newly arrived immigrants, mostly from Italy and Poland, worked in the two mines.\n Number 9 burrowed into the same eight-​foot-​thick, gassy Pittsburgh coal seam as the Monongah mines. It emitted eight million cubic feet of methane gas a day, enough to heat a small city. The mine’s four towering surface fans, which ran around the clock, were supposed to draw enough fresh air into the mine’s tunnels to dilute and blow away this odorless but explosive gas, but they sometimes broke and shut down for hours.\n  At 4   the men on the cat-​eye shift took a short break to eat the packed food they brought with them in the mine’s “dinner holes” and rest.\n Just as the men had stopped to eat, the Mods Run fan, one of the mine’s four huge surface fans, ground to a halt and threw off its blades. While the men ate, Number 9’s west-side tunnels began filling with deadly methane gas. Seventy-​eight of them would soon be dead.\n Number 9’s safety system was designed to warn its miners after a fan stopped ventilating. Each fan was connected to a display board in the lamp house, a building near the mine’s entrance used to store supplies. When a fan slowed or stopped running, a warning light turned red, an alarm sounded, and the men evacuated. As a fail-​safe, the system was designed to cut off all power to Number 9 if a fan was down for more than twelve minutes.\n That is, unless someone in the company decided that shutting off power and evacuating the miners interfered too much with cutting and loading coal. Sometime before the Mods Run fan stopped working, a coal company employee disabled the fan’s alarm system.\n At 5:27   an explosion so violent that it shook the windows in Fairmont twelve miles away tore through the shaft at the mine’s Llewellyn Portal. Billowing mushroom clouds, shot through with orange and blue flames, curled above the mine. The heat was so intense that it scorched several of the miners’ cars in Number 9’s parking lot. Thirteen men, working elsewhere in the sprawling mine, scrambled to the surface. A crane operator, using a makeshift bucket, extracted eight more.\n As the mine belched fire and smoke, word raced through the tiny Appalachian communities surrounding Number 9 that it had blown up. Family members, tears in their eyes, gathered in the mine’s cinder-block company store, clustered among its plastic furniture, and stared out at the rolling clouds of smoke. Some of the missing men’s wives were grandmothers, others were still in their teens. Those women who had experienced mining disasters before suspected the worst. They gave up hope of ever seeing their menfolk again and went home soon after they arrived. Others previously untouched by underground explosions clung to hope and waited for any news about a rescue.\n  The grisly drama of a shift of coal miners trapped in a burning hole a week before Thanksgiving attracted the country’s biggest dailies and news networks, making this the first major mine disaster in United States history to be nationally televised. While the first explosion had killed some of the miners instantly, others had enough time to put on their gas masks. Recovery crews later found an open first-​aid kit and bodies lying on a sheet of canvas, as if some of the trapped men had lain down together to conserve their dwindling supply of fresh air.\n The news cameras were still rolling when apologists for the coal industry trooped before reporters to circle the wagons. John Roberts, who headed Consolidation Coal Company’s public relations department, described the explosion as “something that we have to live with,” as did J. Cordell Moore, an assistant secretary at the U.S. Department of the Interior, and Hulett C. Smith, governor of West Virginia. Smith, who led a state in which there was more debate about whether there should be sex education in its public schools than about safety in its coal mines, lectured the grieving families that “we must recognize that this is a hazardous business and what has occurred here is one of the hazards of being a miner.”\n But the most astonishing performance was that given by W.A. “Tony” Boyle, wearing his signature Washington uniform of a fedora, a pressed suit, and a red rose in his lapel. His few appearances in the coalfields were usually carefully staged, allowing him time to don a new pair of overalls and shiny work boots, but this time Boyle swooped onto the scene in a helicopter furnished by the coal company.\n When he stepped up to the hastily erected podium in the company store, Boyle stunned many of those who had gathered to hear his expected words of sorrow and outrage by instead, in a flat, nasal voice, praising Consolidation Coal Company’s safety record and its history of cooperation with the union. He reminded the families, as if they did not already know it, that coal mining was a very dangerous way to make a living. The public spectacle of the UMWA’s president defending the grossly negligent, if not outright criminal, actions of a coal company while seventy-​eight of his coal miners lay entombed in its burning mine shocked many of the onlookers. “I hated him right then,” Judy Henderson, now a widow at just twenty-​one, told the  Washington Post. “I couldn’t believe someone could say that right in front of the mine where all our husbands were buried alive.”\n  Many of the families clung to hope until the day after Thanksgiving. On the evening of Friday, November 29, when they gathered to pray inside the James Fork United Methodist Church, John Corcoran, president of Consolidation Coal, stepped forward and told them the time had come to seal the mine. He had already told a group of local ministers on Thanksgiving that there was no hope, but he had not wanted to give the families such awful news on the nation’s day of prayer and thanks.\n The grieving families—​235 children had lost their fathers and 74 women had lost their husbands in the underground inferno—​had little reason to believe that this latest coal mining disaster would be treated any differently than all the ones that had come before it. The nation’s response to tragedies such as Number 9 had always been the same: prayers, an outpouring of sympathy for the widows and children, toothless coal-mining safety legislation, and a return to the collective amnesia that allowed things in the mines to go on as they always had.\n  Excerpted from  Blood Runs Coal: The Yablonski Murders and the Battle for the United Mine Workers of America. Copyright © 2020 by Mark A. Bradley. Used with permission of the publisher, W.W. Norton &amp; Company, Inc. All rights reserved.\n  Mark A. Bradley has been a U.S. Department of Justice lawyer, a criminal defense lawyer, and a CIA intelligence officer. He is the author of  Blood Runs Coal: The Yablonski Murders and the Battle for the United Mine Workers of America. Currently the director of the Information Security Oversight Office of the National Archives and Records Administration, he lives in Arlington, Virginia.", "posttime": "2020-10-16 20:18:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "北美,graveyard,矿井", "title": "&lt;北美&gt;深夜班", "title_en": "Graveyard Shift", "transed": 1, "url": "https://www.laphamsquarterly.org/roundtable/graveyard-shift", "via": "", "real_tags": ["北美", "graveyard", "矿井"]}, {"category": "", "categoryclass": "", "imagename": "d2a6dc90aafdb2ff1191aa5c9ae187bd.jpg", "infoid": 1029222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "30年前，拉吉夫·甘地(Rajiv Gandhi)经常在黎明时分开着一辆小卡车去新德里火车站。在那里，这位年轻的工程师与搬运工混在一起，等待长途火车的到来，车上载有一种珍贵的商品：标志性的马鲁蒂800(Maruti 800)的零部件，这款四四方方的汽车永远改变了印度人的出行方式。\n“我们过去常常站在那里等火车到达，清晨6点，把它卸下来，清理干净，然后带到(生产线)上，”他回忆道。如果有任何持续的延误，整个生产计划可能会停滞不前。\n这家工厂仍然矗立在德里郊区尘土飞扬的古鲁格拉姆(Gurugram)，马鲁蒂铃木(Maruti Suzuki)在那里从一次大胆的实验成长为世界第四大汽车市场无懈可击的冠军。今天，这个工厂和附近的Manesar的另一个工厂每年推出超过150万辆汽车-以每10秒一辆的惊人速度。这使得这家印度汽车制造商控制了该国约50%的乘用车市场。它最接近的竞争对手拥有略高于15%的市场份额。\n为了喂饱这头贪婪的制造业野兽，每天约有4000辆卡车驶入这两个设施。它们运载着3.9万批金属、塑料、橡胶和玻璃，最终组装成马鲁蒂铃木汽车，在甘地的密切关注下，甘地现在是该公司负责生产的执行董事。风险依然存在-但在一个基础设施糟糕、制造业实力不强、拖沓传统的国家，马鲁蒂铃木(Maruti Suzuki)打造了一条非凡的供应链。有人会说，这是这家汽车制造商取得巨大成功的秘诀。\n马鲁蒂铃木(Maruti Suzuki，当时名为Maruti Udyog)诞生于印度政府制造人民汽车的愿望，成立于1982年，是与日本铃木汽车(Suzuki Motors)的合资企业。现有的竞争包括生产著名的球茎大使的印度斯坦汽车公司，以及由Premier Automobiles制造的菲亚特1100的一个版本，该版本获得了这家意大利汽车制造商的许可。马鲁蒂·铃木(Maruti Suzuki)想要颠覆市场。因此，它为印度新兴的中产阶级设计了一款更好、更小、更便宜的汽车-掀背马鲁蒂800。\n它还想建造很多这样的建筑。该公司的目标是生产每年在印度各地售出的4万辆汽车的两倍以上。这样的销量将有助于将Maruti 800的价格保持在可承受的范围内，但车内的大多数零部件都必须在印度制造，以确保其价格合理。问题是，当时印度的汽车供应商基础无法提供所需的质量或数量。\n马鲁蒂铃木负责供应链的执行董事迪帕克·库马尔·塞西(Deepak Kumar Sethi)表示：“我们随后决定建立一个可以为马鲁蒂提供服务的供应商基地。”这意味着要在制造业寻找有资金和技术资源的公司；说服铃木的一些供应商与他们合作；然后等待，看看零部件是否足够好。塞西补充说：“最初，我们还创建了一些合资企业，我们在这些合资企业中投入资金，以表示我们的承诺。”这反映了日本经济学社(Keiretsu)的企业实践，经济学社是一组共享业务和持股的公司，由母公司固定。\n马鲁蒂狂热地推动本地化还有另一个原因：在20世纪80年代外汇短缺的情况下，印度政府只允许该公司进口价值一定数量的商品。“(政府)说，‘好吧，你同意本地化。这是你们将要生产的数量。所以，这些外汇单位是我们分配给你们的，“塞西解释说。“如果你本地化失败，不要回来找我们。你得不到更多的外汇，所以你生产的汽车就少了。“。(2007年，在Maruti Udyog在交易所上市四年后，政府退出了合资企业。)\n自20世纪80年代以来，马鲁蒂铃木已经投资了18家零部件制造合资企业，建立了400家国内供应商和70家国际供应商的供应商基础，目前其汽车的本地化程度超过95%。在这个过程中，马瑟森这样的公司通过与日本住友布线系统公司(Sumitomo Wiring Systems)的合作，帮助马瑟森成为了一家收入90亿美元的汽车零部件制造商。马瑟森曾是新德里的一家小型布线制造商。\n索纳集团(Sona Group)也是如此，该集团与光耀精工(Koyo Seiko)成立了一家合资企业，后来成长为日本最大的转向系统制造商。马鲁蒂·铃木在我们业务的初始阶段发挥了重要作用，当时他们将我们带入供应链。我想说的是，对于大多数印度汽车零部件制造商来说，情况都是如此，“索纳集团(Sona Group)首席执行官桑贾伊·卡普尔(Sunjay Kapur)表示。索纳集团于2017年退出了合作关系。毕竟，没有其他印度汽车公司可以提供类似的销量。\n这种在构建组成部分生态系统中的基础作用带来的好处不止一个。Sethi说：“我们可以转移大量位于不同地点的供应商，因为我们有足够的数量和规模。”因此，按价值计算，马鲁蒂铃木85%的零部件现在来自其两家工厂方圆100公里的范围内。这是针对印度中等交通网络的无价保险，与美国相比，印度卡车每年行驶的距离不到六分之一(Pdf)。\n长期合作和大量采购的另一个好处是，马鲁蒂铃木可以尽可能最好的价格采购这些部件。这对公司的财务至关重要，因为汽车制造商每赚一美元，就有一半以上花在材料成本上。“由于这种成本是从我们的供应商那里获得的，所以我们以合适的价格购买所有这些东西是非常重要的。或者，印度最好的价格，“塞西解释说。“显然，我们的客户也能享受到这一好处。”\n刚从工程学校毕业就加入了马鲁蒂铃木(Maruti Suzuki)供应商开发部(后来更名为供应链)的甘地还记得有一段时间，他不得不手动跟踪来自该国不同地区的零部件。“我们被要求与他们(供应商)一起监控日常供应，”他说，“你们派出去了吗？你什么时候发货的？是几号的卡车？预计什么时候？“。\n在20世纪80年代末到90年代，该公司按月运营，并将其传递给供应商。但是这个系统有两个主要的缺点。首先，供应商通常不平均分配他们的交货，这意味着满载零部件的卡车可能会在月底出现，尽管他们可能在几周前就需要了。为了避免这种混乱，马鲁蒂铃木会下大订单，从而导致第二个问题：大量库存。“库存太大了，很多时候你都很难找到东西，”塞西说。即使组件可用，您也可能无法跟踪它。\n与其他一些日本公司一样，铃木厌恶高库存水平，因为它们会将可用于其他地方的现金捆绑在一起，占用工厂的空间，使发现缺陷变得更加困难，并降低整体制造效率。但马鲁蒂铃木(Maruti Suzuki)一直沿用每月的计划，直到20世纪90年代，然后转向每日计划系统，供应商被告知每天确切地交付什么。\n真正的革命发生在世纪之交，当时该公司推出了e-Nagare，这是一个在线平台，将马鲁蒂铃木的生产设施与其供应商基础直接连接起来。它是铃木手动nagare(日语中“流”的意思)系统的在线改编，每个部件都被分配了一张卡片(看板)，在装配线和供应商之间流通。“我们在这个国家有一个很好的IT基础，”甘地说。“这是我们遥遥领先于日本的一个领域。因此，我们认为我们可以利用这一点，于是一个特别的团队开始了这个项目的工作。“。E-Nagare于2004年推出，它将公司的整个供应链连接到一个内联网上，内部网为供应商提供了每一份订单的详细说明。\n甘地说：“开发这种系统是当务之急。”“否则，我们都会发疯，管理供应链中的复杂性。”这并不完全是夸张。马鲁蒂铃木(Maruti Suzuki)从仅有的四款车型和少数几种车型迅速扩大了产品组合，以跟上不断变化的消费者需求。随着增加更多的汽车和更多的变种，该公司也订购了更多不同的零部件。例如，对于一辆红色轿车，它需要红色的保险杠和红色的镜子。这家汽车制造商现在生产17款车型和1480款变种。如果包括颜色变化，这个数字将超过10,000种。每辆车通常包含30,000多个单独的部件。\n雪上加霜的是，马鲁蒂铃木(Maruti Suzuki)在一条生产线上生产多款车型，这是一种常见的做法，意味着工人可能会先组装掀背车，然后是轿车，然后是运动型多功能车(SUV)。背后的逻辑是，它允许该公司根据市场需求削减库存和供应汽车。如果它要批量生产某些型号和变种，要么某款车的等待销售的单元太多。或者，在制造汽车的过程中，客户将不得不应对漫长的等待时间。“客户的需求和我们生产的产品必须完美匹配，”甘地解释说。\n这样的精确度需要很好的计划。这一过程在每年1月左右开始，届时马鲁蒂铃木的整个供应商基础都会收到年度预测。它概述了预期产量，并帮助供应商将自己的产能和资源与母船保持一致。然后，每三个月向供应链提供更新的生产计划，随后是每两周一次的计划。后者是在马鲁蒂铃木的生产、供应链和营销团队参加的一次会议上决定的，是不可改变的。在任何生产日期前24小时，马鲁蒂铃木都会在e-Nagare平台上发出每日送货时间表。其中包含所需部件的名称和编号、所需质量以及必须交付的卡车间隔和时间。\n一批精选的供应商-按数量计算约占马鲁蒂铃木供应商基础的5%-按照更紧凑的时间表工作，他们在几个小时的通知下将零部件送到工厂。这些供应商通常位于工厂附近，通过每日计划收到大量订单，但他们必须发送部件的实际顺序是实时更新的。他们发送零部件的顺序必须与e-nagare上的一致，因为在马鲁蒂铃木的生产线上，一辆红色轿车可能会跟随一辆蓝色掀背车。“如果部件不正确，那么生产线就会停止，”甘地说。\n在外界看来，这似乎是一个岌岌可危的局面，但分析人士认为，马鲁蒂铃木(Maruti Suzuki)在管理其供应链的数量、质量和效率方面的灵活性，在很大程度上是因为e-Nagare。汽车咨询公司Emerging Markets Automotive Advisors的联合创始人迪佩什·拉索尔(Deepesh Rathore)表示：“在印度，我认为它确实遥遥领先于其他任何汽车。”在印度以外，本土开发的e-Nagare也已成为铃木汽车公司(Suzuki Motor Corporation)的某种基准，该汽车制造商在东南亚的工厂目前正在实施该系统。\n但马鲁蒂铃木掌握供应链的终极证据是其在印度乘用车市场的压倒性主导地位。要每年生产150万辆价格敏感的印度人愿意购买的汽车并非易事。问问竞争对手就知道了。", "note_en": "Thirty years ago, Rajiv Gandhi would often drive a small truck to the New Delhi railway station at the crack of dawn. There, mingling with porters, the young engineer would wait for the arrival of long-distance trains bearing a precious commodity: components for the iconic Maruti 800, the boxy car that forever changed how Indians traveled.\n “We used to be standing there for the train to reach, early morning 6 o’clock, get it unloaded, cleared, and bring it to the (production) line,” he remembered. If there were any persistent delays, the entire production schedule could be stalled.\n That factory still stands in Gurugram, a dusty city on the outskirts of Delhi, where Maruti Suzuki built itself up from an audacious experiment to the unassailable champion of the world’s fourth largest car market. Today, this facility, and another at nearby Manesar, roll out over 1.5 million cars every year—at a remarkable rate of one vehicle every 10 seconds . This puts the Indian carmaker in control of around 50% of the country’s passenger car market. It’s nearest rival has a little over 15% share.\n  To feed this voracious manufacturing beast, some 4,000 trucks drive into the two facilities every day. They carry 39,000 consignments of metal, plastics, rubber, and glass that eventually come together as Maruti Suzuki cars, under the watchful gaze of Gandhi, now the company’s executive director responsible for production. The risks still persist—but in a country with lousy infrastructure, modest manufacturing prowess, and a tradition for tardiness, Maruti Suzuki has fashioned an extraordinary supply chain. It is, some would say, the secret to the carmaker’s runaway success.\n   Born out of the Indian government’s desire to build a people’s car, Maruti Suzuki (then known as Maruti Udyog) was established in 1982 as a joint venture with Japan’s Suzuki Motors. The existing competition included Hindustan Motors, which made the famous bulbous Ambassador, and a version of the Fiat 1100 built by Premier Automobiles, under license from the Italian carmaker. Maruti Suzuki wanted to upend the market. So, it came up with a better, smaller, and cheaper car for India’s burgeoning middle-class—the hatchback Maruti 800.\n It also wanted to build lots of them. The company’s target was to manufacture more than double the  40,000 cars that were sold across India every year. Such volumes would help keep the Maruti 800’s price tag within reach, but most components that went into the car had to be made in India to ensure its affordability. The problem was that India’s automotive vendor base back then just couldn’t deliver the required quality, or the quantity.\n  “We then decided to establish a vendor base that could serve Maruti,” said Deepak Kumar Sethi, Maruti Suzuki’s executive director in charge of supply chain. That meant scouting the manufacturing sector for companies that had the financial and technical wherewithal; convincing some of Suzuki’s vendors to partner with them; and then waiting to see if the components were good enough. “We also created, initially, a number of joint ventures where we put in our money as a token of our commitment,” added Sethi. This mirrored the Japanese corporate practice of keiretsu, a set of firms with shared businesses and shareholdings anchored by a mothership company.\n There was another reason for Maruti’s fevered push for localization: In the grips of a foreign exchange scarcity in the 1980s, the Indian government would only allow the company to import goods worth a certain amount. “[The government] said, ‘Alright, you agree to this localization. This is the volume you’ll produce. So, these many units of foreign exchange we allocate to you,&#39;” explained Sethi. “If you fail to localize, don’t come back to us. You’ll not get more foreign exchange, so then you produce fewer cars.” (The government exited the joint venture in 2007, four years after Maruti Udyog listed on the bourses.)\n Since the 1980s, Maruti Suzuki has invested in 18 joint ventures for component manufacturing, built a vendor base of 400 domestic and 70 international suppliers, with over 95% localization in its cars today. In the process, it took companies like Motherson, once a small-time, New Delhi wiring manufacturer, and helped  turn it into an automotive component maker with revenue of $9 billion through a partnership with Japan’s Sumitomo Wiring Systems.\n It did the same for Sona Group, which formed a joint venture with Koyo Seiko that grew to become the country’s largest steering system manufacturer. “Maruti Suzuki had a big role to play in the initial stages of our business when they brought us into the supply chain. I would say this is true for most Indian auto component players,” said Sunjay Kapur, CEO of the Sona Group, which exited the partnership in 2017. After all, there was no other Indian car company with similar volumes to offer.\n  Such a fundamental role in building the component ecosystem has had more than one benefit. “We could move a large number of our vendors who were differently located because we had the volume and scale,” said Sethi. As a result, 85% of Maruti Suzuki’s components, by value, now come from within a 100-km radius of its two factories. It is invaluable insurance against India’s middling transportation network,  where trucks annually cover less than one-sixth (pdf) of the distance compared to those in the US.\n The other advantage of long-term relationships and massive volumes is that Maruti Suzuki can procure these components at the best possible prices. This is essential to the company’s finances since for every dollar that the carmaker earns, it spends more than half on material costs. “With this kind of cost being sourced from our vendors, it’s very important that we buy all these things at the right price. Or, the best prices in India,” explained Sethi. “And obviously, this benefit travels to our customer.”\n   Gandhi, who joined Maruti Suzuki’s vendor development division (later renamed supply chain) fresh out of engineering school, remembers a time when he’d have to manually track components coming from different parts of the country. “We were required to monitor everyday’s supplies with them (vendors),” he said, “Have you dispatched or not? What time have you dispatched it? By what truck number? When is it expected?”\n In the late 1980s to 1990s, the company operated on a monthly schedule that was passed on to vendors. But the system had two major drawbacks. First, vendors often didn’t evenly distribute their deliveries, which meant that truck loads of components would turn up toward the end of the month, though they might have been required weeks earlier. To avoid this mess, Maruti Suzuki would place large orders that led to the second problem: massive inventories. “The inventory was so large that many times you would struggle to find things,” said Sethi. “Even though a component was available, you may not be able to trace it.”\n  Like  some other Japanese companies, Suzuki abhors high inventory levels because they tie up cash that can be used elsewhere, take up space in factories, make it more difficult to spot defects and reduce manufacturing efficiency overall. But Maruti Suzuki continued with its monthly schedules until the 1990s, before moving to a daily schedule system where vendors were told exactly what to deliver everyday.\n The real revolution came at the turn of the century, when the company rolled out e-Nagare, an online platform that connected Maruti Suzuki’s production facility directly with its vendor base. It was an online adaptation of the Suzuki’s manual nagare (Japanese for “flow”) system, where each component is assigned a card (a Kanban) that circulates between the assembly line and the vendor. “We had a good IT base in the country,” said Gandhi. “That was one area where we were far ahead of where Japan was. So, we thought we’d take advantage of that, and a special team started working on this project.” Launched in 2004, e-Nagare took the company’s entire supply chain onto an intranet, which provided detailed instructions to vendors on every order.\n “It was the need of the hour to develop this kind of a system,” said Gandhi. “Otherwise, we would’ve all gone crazy, managing the complexities in the supply chain.” That’s not entirely an exaggeration. From only four car models with a handful of variants, Maruti Suzuki was quickly expanding its product portfolio to keep up with changing consumer demand. And as it added more cars and more variants, the company was also ordering more components, which were different. For a red sedan, for instance, it needed red bumpers and red mirrors. The carmaker now produces 17 models and 1,480 variants. If you include color variations, that number exceeds 10,000 variants. And each car typically contains more than 30,000 individual parts.\n  To add to the chaos, Maruti Suzuki manufactures multiple car models on a single production line, a common practice that means workers could be assembling a hatchback, followed by a sedan, followed by a sports utility vehicle. The underlying logic is that it allows the company to cut down on inventory and supply cars according to market demand. If it were to produce certain models and variants in batches, either there’d be too many units of a certain vehicle waiting to be sold. Or, customers would have to deal with long waiting periods while the cars were manufactured. “What the customer wants and what we make has to match perfectly,” explained Gandhi.\n Such precision takes great planning. The process begins around January every year when Maruti Suzuki’s entire vendor base is provided with an annual forecast. It outlines the expected output, and helps suppliers align their own production capacity and resources with the mothership. Then, every three months, the supply chain is given an updated production schedule, which is followed by a fortnightly schedule. The latter, decided in a meeting attended by Maruti Suzuki’s production, supply chain, and marketing teams, is unalterable. Twenty four hours before any production day, Maruti Suzuki sends out a daily delivery schedule on the e-Nagare platform. These contain the names and numbers of the components needed, the required quality, and the truck bay and time with which they have to be delivered.\n A select batch of suppliers—around 5% of Maruti Suzuki’s vendor base, by volume—work on tighter schedules, where they send parts into the factory on a few hours notice. These vendors, usually located in close proximity to the factory, receive their broad order volumes through the daily schedule but the actual sequence in which they have to send the parts is updated live. And the order in which they send the parts must match what’s on the e-Nagare, since a red sedan could follow a blue hatchback on Maruti Suzuki’s production line. “If the component is incorrect, then the line stops,” said Gandhi.\n  It may seem like a precarious situation to the outside eye, but analysts believe that Maruti Suzuki’s dexterity with managing the volume, quality and efficiency of its supply chain is, in large part, because of e-Nagare. “Within India, I think it is miles ahead of anything else really,” said Deepesh Rathore, co-founder of Emerging Markets Automotive Advisors, an automotive consultancy. Outside India, too, the indigenously developed e-Nagare has become something of a benchmark for the Suzuki Motor Corporation, with the carmaker’s facilities in Southeast Asia now implementing the system.\n But the ultimate evidence of Maruti Suzuki’s mastery of its supply chain is in its overwhelming dominance of India’s passenger car market. It’s not easy to build 1.5 million cars a year that price conscious Indians will buy. Just ask the competition.", "posttime": "2020-10-16 20:18:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "铃木,suzuki,供应商", "title": "马鲁蒂铃木-赢得印度汽车市场的秘诀", "title_en": "Maruti Suzuki – The recipe for winning India’s car market", "transed": 1, "url": "https://classic.qz.com/perfect-company-2/1149106/the-recipe-for-winning-indias-car-market-japanese-innovation-with-a-touch-of-indian-it/", "via": "", "real_tags": ["铃木", "suzuki", "供应商"]}, {"category": "", "categoryclass": "", "imagename": "e930ee99ea2d0d138b6fa5b367b743ec.jpg", "infoid": 1029221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎收看火箭报道的3.20版！像往常一样，本周升降机领域有很多新闻。我们还预计从周日开始，三天内将有两次Starlink发射。当然，我们还得看看斯鲁布托伯对这件事的看法。\n一如既往，我们欢迎读者提交，如果您不想错过任何一期，请使用下面的框进行订阅(表单将不会显示在启用AMP的网站版本上)。每一份报告都将包括关于小型、中型和重型火箭的信息，以及日历上未来三次发射的快速展望。\n新谢泼德在10个月后再次飞行。蓝色起源公司的新谢泼德发射系统于周二重返飞行，执行运载火箭的第13次总体任务。据NASASpaceflight.com报道，该飞行器携带了12个商业有效载荷往返于太空边缘，其中包括美国国家航空航天局(NASA)开发的传感器套件，该套件可以使未来的月球着陆器在月球表面安全而精确地着陆。\n还有人们，什么时候？...。新谢泼德的试飞活动于2015年4月开始，已经持续了五年多。在围绕发射进行的近一个小时的网络直播中，主持人对人类何时可以首次在太空舱内飞行没有太多话要说，太空舱是为了作为亚轨道太空旅游的平台而开发的。蓝色起源也尚未开始售票。(由platykurtic和Ken the Bin提交)。\n维珍轨道寻求高达2亿美元的资金。据华尔街日报报导，维珍轨道正在寻求投资者注资1.5亿至2亿美元，整体估值为10亿美元。该公司正寻求最早在今年年底前筹集资金。\n一条盈利之路？…。ARS此前曾报道，维珍轨道已经花费超过5亿美元开发LauncherOne火箭，对于维珍如何才能收回这笔投资存在疑问。新的资金可能会支付18到24个月的运营成本，使公司能够进入轨道和某种运营节奏。\n跟上埃里克·伯杰的空间报道最简单的方法是注册他的时事通讯，我们会在你的收件箱里收集他的故事。\n瑞典加大了对Esrange的承诺。周三，瑞典政府宣布，它打算对埃斯兰奇发射场的基础设施进行大规模现代化改造，以满足航天领域对测试和发射能力日益增长的需求。目标是在2022年开始从Esrange发射小卫星进入轨道。\n测试和发射。到目前为止，瑞典和航天港已经在该国北部的这个地点共同投资了大约3000万美元，那里非常适合进行极地发射。两家德国公司，ISAR和火箭工厂奥格斯堡，正在该地点建设测试设施，很可能是未来轨道发射的前奏。欧洲航天局的可重用性项目Themis计划在2022年进行首次可重用性试飞。(由rodik提交)。\n阿尔法火箭完成最后验收测试。萤火虫航空航天公司表示，其阿尔法火箭第一级于10月9日(星期五)在德克萨斯州布里格斯的测试设施完成了最终验收测试。在网上发布的一段(相当令人印象深刻的)视频中，测试似乎持续了大约20秒。\n去了加州。在最后检查之后，第一级将被运送到范登堡空军基地，为发射做准备。该公司尚未提供首次发射尝试的最新时间表，但仍有大量工作要做，并将在2020年底之前很好地完成这次试飞。(Ken the Bin提交)。\n维珍银河即将进行下一次试飞。太空旅游企业维珍银河(Virgin Galaxy)周三表示，该公司仍将在未来几周内进行下一次太空试飞。据CNBC报道，该公司表示，我们预计我们的第一次太空飞行将于今年秋天晚些时候从美国太空港进行，我们很高兴地确认，我们仍在按计划完成这一时间表。\n明年会有骑士飞来飞去吗？这将是这家太空旅游公司计划完成其SpaceShipTwo航天器系统测试的两次太空飞行中的第一次，该系统上应该只有两名试飞员。维珍银河上个月表示，第二次测试太空飞行之后，舱内将有四名任务专家。如果两次试飞都成功，维珍银河预计将在2021年第一季度让创始人理查德·布兰森爵士(Sir Richard Branson)升空，标志着该公司商业旅游服务的开始。(由platykurtic和Ken the Bin提交)", "note_en": "Welcome to Edition 3.20 of the Rocket Report! As usual, there is a lot of news this week in the world of lift. We also have the prospect of two Starlink launches in three days, beginning Sunday. Of course, we&#39;ll have to see what Scrubtober thinks about this.\n As always, we  welcome reader submissions, and if you don&#39;t want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.\n  New Shepard flies again after 10 months. Blue Origin&#39;s New Shepard launch system returned to flight on Tuesday, conducting the 13th overall mission of the vehicle. The vehicle carried 12 commercial payloads to the edge of space and back, including a NASA-developed sensor suite that could enable future lunar landing craft to perform safe and precise touchdowns on the surface of the Moon,  NASASpaceflight.com reports.\n And people, when? ... The flight-test campaign for New Shepard began in April 2015 and has been going on for more than five years. During the nearly hour-long webcast surrounding the launch, the hosts did not have much to say about when humans may first fly inside the capsule, which was developed to serve as a platform for suborbital space tourism. Blue Origin also has yet to begin selling tickets. (submitted by platykurtic and Ken the Bin)\n Virgin Orbit seeks up to $200 million in funding. According to a report  in The Wall Street Journal, Virgin Orbit is seeking a $150 to $200 million infusion of capital from investors and an overall valuation of $1 billion. The company is seeking to raise the funds by as early as the end of this year.\n A path to profit? ...  Ars has previously reported that Virgin Orbit has spent more than $500 million developing the LauncherOne rocket, and there are questions about how Virgin can ever recoup that investment. The new funds would likely cover operational costs for 18 to 24 months, allowing the company to reach orbit and some sort of operational cadence.\n The easiest way to keep up with Eric Berger&#39;s space reporting is to sign up for his newsletter, we&#39;ll collect his stories in your inbox.\n Sweden steps up commitment to its Esrange. On Wednesday, the Swedish government  announced it intends an &#34;extensive modernization&#34; of the infrastructure at the Esrange launch site to meet the growing demand for testing and launching capability in the space sector. The goal is to begin launching small satellites into orbit in 2022 from Esrange.\n Tests and launches ... So far, Sweden and the spaceport have co-invested about $30 million into the site in the northern part of the country, which is ideally suited for polar launches. Two German companies, ISAR and Rocket Factory Augsburg, are building test facilities at the site, likely as a prelude to future orbital launches. And the European Space Agency&#39;s reusability program, Themis, plans to conduct its first reusability test flights in 2022. (submitted by rodik)\n Alpha rocket completes its final acceptance test. Firefly Aerospace said its Alpha rocket first stage completed its final acceptance test on Friday, October 9, at its test facility in Briggs, Texas. In a (rather impressive)  video posted online, the test appeared to last for about 20 seconds.\n Gone to California ... After a final inspection, the first stage will be transported to Vandenberg Air Force Base in preparation for launch. The company has not provided an updated schedule for its initial launch attempt, but it still has plenty of work to do and will do well to complete this test flight before the end of 2020. (submitted by Ken the Bin)\n Virgin Galactic nearing its next test flight. Space-tourism venture Virgin Galactic said Wednesday it remains on track to conduct its next test spaceflight in the coming weeks. &#34;We expect our first spaceflight from Spaceport America to occur later this fall, and we are pleased to confirm that we are still on track to meet this timeframe,&#34; the company said,  according to CNBC.\n A knight flying next year? ... This will be the first of two spaceflights that the space-tourism company has planned to complete testing of its SpaceShipTwo spacecraft system, which should have just two test pilots on board. Virgin Galactic said last month that the second test spaceflight will then have four &#34;mission specialists&#34; inside the cabin. If both test flights succeed, Virgin Galactic expects to fly founder Sir Richard Branson in the first quarter of 2021, marking the beginning of the company&#39;s commercial tourism service. (submitted by platykurtic and Ken the Bin)", "posttime": "2020-10-16 20:03:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,报道,report", "title": "火箭报道：瑞典投资发射场，SLS一个月热试射", "title_en": "Rocket Report: Sweden invests in launch site, SLS hotfire test in a month", "transed": 1, "url": "https://arstechnica.com/science/2020/10/rocket-report-sweden-invests-in-launch-site-sls-hotfire-test-in-a-month/", "via": "", "real_tags": ["火箭", "报道", "report"]}, {"category": "", "categoryclass": "", "imagename": "80aef321a7a7ed0047b08bbd1ee6f557.jpg", "infoid": 1029220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在经历了智能手机历史上最奇怪的一次发布后，微软Surface二人组来到了这里。微软(Microsoft)首款Android手机(抱歉，我们不包括诺基亚X)在发布前整整一年发布并进行了演示，这暗示了Surface二人组从问世到出货经历了多么漫长而曲折的道路。硬件显然可以追溯到为手机重振Windows的计划，但在该计划失败后，硬件被升级为今年最令人费解的Android手机。\nSurface Duo的卖点是，可折叠显示技术还没有成熟，所以现在就试试这款“我们现在就能做到最好”的版本吧，它有两个坚硬的5.6英寸OLED显示屏，用360的铰链连接在一起。微软将其称为生产力设备，因为它拥有平板电脑式可折叠智能手机的并排应用功能，没有任何陈旧的显示技术。微软网站还表示，这两款设备的设计初衷是启发人们重新考虑如何使用口袋里的这款设备，这表明该公司肯定将其视为主要设备。\n我提到微软的推销是因为，伙计，Surface二人组在做微软所说的它应该擅长的事情上做得不好。这款手机给人的感觉是，它完全没有考虑到人体工程学、手部大小、口袋大小，或者任何能构成一部好的Android手机的东西。它有严重的生产力问题，否定了你可以从双屏幕设计中获得的任何好处，它在日常使用中极其笨拙，而且它非常有缺陷。以1400美元的天价，这款手机缺少了你期待的一大堆功能，甚至连这里的硬件看起来也至少有一年的历史了。这款手机的要价高达1400美元，甚至连这里的硬件都看起来至少有一年的历史了。\nSurface二人组给人的感觉就像是一部毫无计划地拼凑在一起的手机，对这款手机历史的报道表明，这正是实际发生的事情。“我们希望温和地欢迎微软加入Android生态系统，但我们不会对价值1,400美元的智能手机进行曲线评分。微软需要将其淘汰出局。取而代之的是，这家公司上交了一部几乎不能胜任的智能手机，在审查期间，我真的不得不强迫自己使用。\nSurface二人组的主要特点是它非常漂亮。这是一个极简主义的玻璃三明治，有着复杂的珍珠白和铬配色方案，看起来很愉快。这款手机绝对超薄，与Moto Razr一样，它也是罕见的看起来不像难看的砖头的可折叠智能手机之一。如果你有两只空闲的手，把这两个人放在书本模式下，只是随意地翻阅一些东西，这是一件非常舒服的事情。微软设计语言的震撼和敬畏可能足以让一些人爱上这款设备，而忽略它所有的其他缺陷。我的意思是，当然不是我，而是一些人。\n八核高通骁龙855四个基于Cortex A76的内核(一个2.84 GHz，三个2.41 Ghz)和四个1.78 GHz的基于Cortex A55的内核。\n当描述Surface二人组时，人们想到的最多的词是扁平。手机的机身并不是完全扁平的，但它的正反面都有不间断的玻璃片。没有相机凸块，没有弯曲的侧面，只有四片玻璃。当关闭时，手机的外部也会给人一种极简主义的外观，没有灯，没有摄像头，也没有文字标记，只有一个单独的、反光的Windows徽标和微软徽标。Surface二人组看起来几乎不像是一款电子设备。你可以很容易地制作一台看起来就像Surface Duo的Moleskine笔记本。事实上，我敢打赌，微软就是从Moleskine那里得到Surface二人组的尺寸的。这款小笔记本的袖珍版尺寸为140 mm x 90 mm，而Surface Duo合上时尺寸为145.2 mm×93.3 mm。\n打开二人组，你会发现一系列奇怪的决定。首先是两个长宽比为4：3的60 Hz 5.6英寸显示屏，因此它们比大多数其他Android显示屏要宽得多，短得多。接下来，你会在手机的顶部和底部发现一些大得可笑的边框，这真的破坏了手机从外部散发出的数字Moleskine氛围。现在还不清楚为什么表圈这么大。我们当然有技术可以让它们变得更薄，正如我们稍后将讨论的那样，短而胖的4：3显示屏将从额外的高度中受益匪浅。我猜这是Surface Duo在瘦身方面做出的众多让步之一。\n几乎所有的电话都在设备的右半部分。在右半部分的底部边缘，你会看到USB-C端口，在右侧边缘有SIM卡托盘、音量摇杆、电源按钮和一个超薄的侧装式指纹读取器。右半部分负责接听电话，顶部挡板上有一个耳机，底部有一个麦克风插槽。内部结构也反映了这种布局：所有的手机芯片都在手机的右半部分，而左半部分几乎都是电池。除了另一个屏幕，手机左边唯一的东西就是手机唯一的媒体扬声器，它通过显示屏顶部的一个插槽退出。Surface Duo有一个单声道扬声器，没有耳机插孔，显示屏不稳定，并不完全是一台媒体机器。\n你会发现唯一的相机硬件在右边的顶部挡板上：一个LED闪光灯坐在一个可怕的1200万像素传感器旁边，还有一个看起来非常便宜的针孔镜头。360的铰链可以同时作为自拍相机和主相机使用，这很聪明。但在Surface Duo这样薄的设备中，相机从来没有机会做得很好。大多数手机需要额外的厚度才能塞进高质量的相机传感器(相机凸块)，而今天大多数智能手机的相机传感器都比Surface Duo的整个4.8 mm机身还厚。\n没有适合这么薄的配置文件的相机传感器的市场，所以微软可能真的不得不在行业零件箱中挖掘，并满足于任何适合的东西。我们知道微软提出了一些想法，试图解决这个问题。一款早期的Surface Duo原型在设备的一半后方有一个摄像头凸块，另一半上有草皮，这样手机仍然可以平折。该公司还拥有一种相机镜头的专利，这种镜头可以装入薄型相机，但在使用时会变得更高，就像老式的点拍相机一样。最后，我们没有相机凸块，也没有花哨的相机技术，只有一台薄而平滑的设备和一台折中的相机。\nSurface Duo的铰链摸起来就像笔记本的铰链。无论你把它放在哪里，它都够硬的，但仍然很容易移动。就像笔记本的铰链一样，在整个运动中都有持续的阻力，实际上根本没有任何辅助，所以你不会翻开或合上手机，而且你总是需要两只手才能打开手机。铰链可以向四周折叠，所以你可以通过将一个显示屏折叠到后面，将双屏幕手机变成一个单屏幕。在这种模式下切换两面也很容易-只需双击您想要点亮的显示屏即可。你可以用铰链做任何你想做的事情：像拿着书一样拿着手机，把手机放在桌子上，像帐篷一样支撑它，或者把它变成一台迷你笔记本。\n铰链机制的一个令人惊讶的事情是，当你关闭它时，没有任何类型的衬垫，但关闭过程仍然感觉安全，柔软和非犹太人。Galaxy Fold和Moto Razr要么有橡胶脚，要么有一个大塑料挡板，以保护屏幕不被砰地关上。在Surface Duo上，根本没有保险杠，所以关闭它意味着你将一块玻璃压在另一块玻璃上。你可能希望在热情的关机后听到碎裂的声音，但感觉就像铰链在做一些缓冲工作，你永远不会觉得你必须像非犹太人一样合上电话。\n微软全力以赴让Surface二人组变得尽可能纤薄。如果你测量一下Surface Duo打开时的厚度，你会发现它是有史以来最薄的智能手机之一，厚度只有4.8毫米。你必须回到2010年代中期的纤薄热潮中，才能找到像Surface二人组那样薄的产品--4.75毫米厚的Vivo X5Max，我认为它仍然是世界上最薄的智能手机。(它甚至还有一个耳机插孔！)。Surface二人组可能是世界上第二薄的智能手机，甚至可能排名第一，因为它没有Vivo X5Max那样的摄像头凸起。\n这款手机的内部结构真的令人难以置信，这表明微软竭尽全力让自己变得尽可能瘦。在一款正常的现代智能手机中，目标是减少主板面积，以获得更大的电池，制造商已经开始建造主板，就像一座普通的多层房子。不仅一块电路板的顶部和底部都有芯片，制造商已经开始堆叠多层电路板。像iPhone11这样的东西有三个芯片平面。底部有一块单面板，可以压在箱子的背面，然后在上面堆放一块双面板。Surface Duo则完全相反：它的主板非常大，实际上是单面的。每一块芯片都在电路板的一侧，背面平整，尽量降低高度。\n虽然在2010年代中期推动变薄只是一个毫无意义的噱头，但对于可折叠产品来说，薄是便携的一个主要因素。\n然而，微软并没有完全考虑到这款设备的薄薄将如何与其材料选择相冲突。该设备的侧面是塑料的，虽然它看起来和摸起来都很好，但薄的塑料并不是很结实。一切都很好，直到你到达USB-C端口，因为这个端口几乎和整个手机一样厚，周围只有最小的一条塑料。仅仅用手指推一下塑料，你就能移动它，这是令人震惊的。已经有报道称USB-C端口周围的塑料断裂和脱落，我毫不怀疑我可以用手指将其折断。半毫米厚的塑料(我测量过的)对任何东西都不够结实，更不用说像USB-C端口这样的高压点了。我提过没有无线充电吗？\nSurface二人组的一个奇怪之处在于，它给人的感觉就像你可以用指甲把它拆开。塑料的侧面根本不会缠绕在内部或外部的玻璃上，使玻璃面板的侧面暴露在外。实际上，在两块玻璃和塑料边缘之间有一道缝隙，你可以很容易地在里面粘一张纸，甚至一根指甲。这是一种制作手机的奇怪方式，通常情况下，无论侧面是用什么材料制成的，玻璃都会被凹进里面，任何缝隙都是无法穿透的。如果微软没有像往常一样将塑料边缘包裹在玻璃周围，那么容易折断的USB-C端口周围的面积会增加一倍左右，而整个手机也不会更厚，这似乎是个好主意！很明显，经过这样的描述，手机根本就不防水了。\n除了缺少无线充电和防水功能外，Surface二人组还没有NFC，这对于一款售价1400美元的设备来说是一个很大的遗漏。也只有60赫兹的显示屏，而这个价位范围内的大多数其他手机都会提供90或120赫兹的显示屏，界面要流畅得多。", "note_en": "After one of the strangest run-ups to launch in smartphone history, the Microsoft Surface Duo is here. Microsoft&#39;s first-ever Android phone (sorry, we&#39;re  not counting the Nokia X) was announced and demoed  an entire year before its release, hinting at what a long and winding road the Surface Duo took from inception to shipping. The hardware apparently dates back to plans to revitalize Windows for phones, but after that plan fell through, the hardware was upcycled into the most head-scratching Android phone of the year.\n The Surface Duo sales pitch is that foldable display technology isn&#39;t ready yet, so try this best-we-can-do-right-now version that features two rigid, 5.6-inch OLED displays attached together with a 360 hinge. Microsoft is calling this a &#34;productivity&#34; device thanks to it having the side-by-side app capability of a tablet-style foldable smartphone without any of the janky display technology.  Microsoft&#39;s website also says the Duo was designed to &#34;inspire people to rethink how they want to use the device in their pocket,&#34; indicating that the company definitely sees this as a primary device.\n I bring up Microsoft&#39;s sales pitch because, boy, is the Surface Duo bad at doing the things Microsoft says it&#39;s supposed to be good at. The phone feels like it was made without any respect to ergonomics, hand size, pocket-size, or anything that makes a good Android phone. It has crippling productivity problems that negate any benefit you could get from the two-screen design, it&#39;s extremely awkward in day-to-day use, and it&#39;s very buggy. The phone is missing a whole host of features you would expect for the stratospheric $1400 asking price, and even the hardware that is here seems like it&#39;s a least a year old.\n The Surface Duo feels like a phone that was slapped together without a plan, and the reports of the phone&#39;s history indicate  that&#39;s what actually happened. We would like to gently welcome Microsoft to the Android ecosystem, but we are not grading $1400 smartphones on a curve. Microsoft needed to knock this out of the park. Instead, the company turned in a borderline incompetent smartphone that I really had to force myself to use during the review period.\n    The main thing the Surface Duo has going for it is that it is very pretty. It&#39;s a minimalist glass sandwich with a sophisticated pearl white and chrome color scheme that is just a pleasure to look at. The phone is absolutely cracker-thin, and along with the Moto Razr, it&#39;s one of the rare foldable smartphones that doesn&#39;t look like an ugly brick. If you&#39;ve got two free hands, there&#39;s something very comfy about holding the Duo in book mode and just casually flipping through something. The shock and awe of Microsoft&#39;s design language is probably enough to make some people fall in love with the device and ignore all its other faults. I mean, not  me, of course, but some people.\n Eight-core Qualcomm Snapdragon 855 Four Cortex A76-based cores (One 2.84GHz, three 2.41Ghz) and four Cortex A55-based cores at 1.78GHz\n The word that most comes to mind when describing the Surface Duo is &#34;flat.&#34; The body of the phone is not perfectly flat, but it&#39;s uninterrupted sheets of glass on the front and back of both halves. There&#39;s no camera bump, no curved sides, just four sheets of glass. When closed up, the outside of the phone also gives off a minimalist look with no lights, cameras, or wordmarks, just a single, reflective  Windows logo Microsoft logo. The Surface Duo almost doesn&#39;t look like it&#39;s an electronic device. You could easily make a Moleskine notebook that looks just like a Surface Duo. In fact, I&#39;d bet a Moleskine is where a Microsoft got the dimensions for the Surface Duo. The  &#34;Pocket&#34; version of the little notebook is 140mm x 90mm, while a Surface Duo is 145.2mm × 93.3mm when closed.\n Crack open the Duo and you&#39;ll find a series of strange decisions. First there&#39;s the two 60Hz 5.6-inch displays with a 4:3 aspect ratio, so they are way wider and way shorter than most other Android displays. Next you&#39;ll find some comically huge bezels on the top and bottom of the phone, which really ruins the &#34;digital Moleskine&#34; vibe the device gives off from the outside. It&#39;s not really clear why the bezels are so large. We certainly have the technology to make them much, much thinner, and as we&#39;ll get into later, the short, fat 4:3 displays would greatly benefit from the extra height. I&#39;ll guess that this is one of the Surface Duo&#39;s many concessions to thinness.\n Pretty much all the phone bits on the right half of the device. On the bottom edge of the right half, you&#39;ll see the USB-C port, on the right edge there&#39;s the sim tray, a volume rocker, power button, and an ultra-skinny side-mounted fingerprint reader. The right half handles phone call duty, with an earpiece in the top bezel and a microphone slot on the bottom. The internals mirror this layout, too: all the phone chips are in the right half of the phone, while the left half is almost all battery. The only thing on the left side besides another screen is the phone&#39;s only media speaker, which exits via a slot in the top of the display glass. With a mono speaker, no headphone jack, and a wonky 4:3 display, the Surface Duo is not exactly a media machine.\n You&#39;ll find the only camera hardware in the right side&#39;s top bezel: an LED flash sits next to a terrible 12MP sensor with a very cheap looking pinhole lens. The 360 hinge allows this to double as both the selfie camera and the main camera, which is clever. But in a device as thin as the Surface Duo, the camera never had a shot at being good. Most phones need additional thickness to squeeze in a quality camera sensor (the camera bump), and today most smartphone camera sensors are thicker than the entire 4.8mm body of the Surface Duo.\n  There is not a market for camera sensors that fit into this thin of a profile, so Microsoft probably really had to dig through the industry parts bin and settle for anything that would fit. We know Microsoft kicked around a few ideas to try to fix this. One early Surface Duo prototype has a camera bump on the rear of one half of the device, with a divot on the other half so the phone can still fold flat. The company also has  a patent for a camera lens that would fit into a thin profile and then grow taller when it was in use, like an old-school point-and-shoot. In the end, we got no camera bumps and no fancy camera tech, just a thin, smooth device and a compromised camera.\n The Surface Duo hinge feels exactly like a laptop hinge. It&#39;s stiff enough to stay wherever you put it but still easy to move around. Like a laptop hinge, there is continuous resistance throughout the entire movement with really no assist at all, so you won&#39;t be flipping the phone open or closed, and you&#39;ll always need two hands to open the phone. The hinge folds all the way around, so you can turn your dual-screen phone into a single screen by folding one display all the way back. It&#39;s easy to switch sides in this mode, too—just double tap on the display you want to light up. You can do whatever you want with the hinge: hold the phone like a book, flatten the phone out against a table, prop it up like a tent, or turn it into a mini laptop.\n One amazing thing about the hinge mechanism is that there&#39;s no padding of any kind for when you close it, yet the closing process still feels safe, soft, and gentile. The Galaxy Fold and Moto Razr have either rubber feet or a big plastic bezel to protect the screen from being slammed closed. On the Surface Duo, there are no bumpers at all, so closing it means you are pressing one slab of glass against another. You might expect to hear a shattering noise after an enthusiastic close, but it feels like the hinge is doing some cushioning work, and you never feel like you have to be gentile closing the phone.\n Microsoft went all out to make the Surface Duo as thin as humanly possible. If you measure the Surface Duo when it&#39;s open, it qualifies as one of the thinnest smartphones of all time at just 4.8mm thick. You&#39;d have to go back to the thinness craze of the mid-2010s to find anything as paper-thin as the Surface Duo—the  4.75mm thick Vivo X5Max, which I think still holds the title of &#34;world&#39;s thinnest smartphone.&#34; (It even had a headphone jack!) The Surface Duo might be the world&#39;s second thinnest smartphone, or maybe even #1, since it doesn&#39;t have a camera bump like the Vivo X5Max.\n The internals of this phone are really incredible and show Microsoft pulled out all the stops to get as thin as possible. In a normal, modern smartphone, the goal is to reduce the motherboard area for a bigger battery, and manufacturers have started constructing motherboards like a multi-story house. Not only does a single board have chips on the top and bottom side, manufacturers have started stacking up multiple layers of circuit board. Something like an iPhone 11 has three planes of chips. The bottom has a single-sided board that can be pressed against the back of the case, then a double-sided board is stacked on top of that. The Surface Duo is the complete opposite: It has a massively large motherboard that is actually single sided. Every single chip is on one side of the board, and the backside is flat, reducing the height as much as possible.\n    While the push for thinness in the mid-2010s was a pointless gimmick, for foldables, thinness is a major factor for portability. This thing has to go in your pocket, after all. Folding in half means it grows to double the thickness. However, Microsoft&#39;s obsession with thinness means the phone is still only a svelte 9.9 mm when it&#39;s folded up, which is still only on the high-end of normal smartphone thickness. Staying in the realm of smartphone thickness is a nice improvement over the brick-like form factor of some other foldables. The Galaxy Z Fold 2, which made no concessions for thinness, is 16.8mm when it&#39;s folded up—that&#39;s basically two normal smartphones stacked on top of each other.\n Microsoft did not quite think out how the thinness of the device would clash with its material choices, though. The sides of the device are plastic, and while it looks and feels fine, thin plastic isn&#39;t very strong. Everything is fine until you get to the USB-C port, which, since the port is almost as thick as the entire phone, has only the tiniest sliver of plastic surrounding it. It&#39;s alarming how much you can move the plastic just by pushing it with your finger. There are  already reports of the plastic around the USB-C port cracking and breaking off, and I have no doubt I could snap it with my finger. Half a millimeter of plastic (I measured) isn&#39;t sturdy enough for anything, let alone a high-stress point like the USB-C port. Did I mention yet that there&#39;s no wireless charging?\n One odd thing about the Surface Duo is that it kind of feels like you could pick it apart with your fingernail. The plastic sides don&#39;t wrap around the inner or outer glass at all, leaving the sides of the glass panels exposed. There&#39;s actually a gap between both panes of glass and the plastic edges, and you can easily stick a piece of paper in there, or even a fingernail. It&#39;s an odd way to make a phone, where normally the glass would be recessed into whatever material the sides were made out of, and any gaps would be impenetrable. If Microsoft had wrapped the plastic edges up around the glass, like normal, the area around the easily-broken USB-C port would be about twice as thick, while the overall phone wouldn&#39;t have been any thicker, which seems like a good idea!  Obviously, after this description, the phone is in no way water-resistant.\n In addition to missing wireless charging and water resistance, the Surface Duo also doesn&#39;t have NFC, which is a big omission for a $1400 device. There&#39;s also only a 60Hz display, when most other phones in this price range will offer 90 or 120Hz displays, offering a much smoother interface.", "posttime": "2020-10-16 20:03:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "硬件,windows,android,duo,手机", "title": "Surface Duo评论-孤立的Windows硬件是一款糟糕的Android设备", "title_en": "Surface Duo review—Orphaned Windows hardware makes a poor Android device", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/surface-duo-review-orphaned-windows-hardware-makes-a-poor-android-device/", "via": "", "real_tags": ["硬件", "windows", "android", "duo", "手机"]}, {"category": "", "categoryclass": "", "imagename": "74f3099a80f81841af806b919681849e.jpg", "infoid": 1029217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罚款金额的大幅下降突显了冠状病毒大流行对法规的影响。在某些情况下，为了更快地解决可能影响业务增长的问题，我们看到监管机构试图加快响应速度，甚至放弃了之前对绿灯活动的一些保留意见，比如电动滑板车。\n但在英航罚款的案例中，我们看到了新冠肺炎影响的另一面：监管机构对已经在苦苦挣扎的公司采取了不那么严厉的处罚。这引发了一些问题，即他们的决定有多大的影响力，以及他们为未来的安全和数据保护忽视开创了什么样的先例。\n信息专员伊丽莎白·德纳姆(Elizabeth Denham)在一份声明中表示：“人们将个人信息委托给英国航空公司，而英国航空公司没有采取足够的措施来保护这些细节的安全。”“他们没有采取行动是不可接受的，影响了数十万人，这可能因此造成了一些焦虑和痛苦。这就是为什么我们向英国航空公司开出了2000万GB的罚单-这是我们迄今为止最大的一笔罚款。当组织机构围绕人们的个人数据做出糟糕的决定时，这可能会对人们的生活产生真正的影响。这项法律现在为我们提供了鼓励企业对数据做出更好决定的工具，包括投资于最新的安全措施。“。\n这是ICO有史以来开出的最高罚单。但与监管机构去年最初设定的1.84亿英镑的罚款-占英航2018年营收的1.5%-相比，这是一个重大的进步。当然，那是在冠状病毒大流行来袭之前，导致全球旅行停止，许多航空公司陷入困境。最初的订单经过了上诉程序，其中包括对该公司在当前市场的状况进行评估。\nICO在其关于降低罚款的声明中指出：“2019年6月，ICO向英航发出了罚款意向通知。”“作为监管过程的一部分，ICO在设定最终处罚之前，既考虑了英航的陈述，也考虑了新冠肺炎对其业务的经济影响。”\n调查结果的突出事实保持不变：ICO认定英航存在“安全漏洞”，这些漏洞本可以通过当时可用的安全系统(程序和软件)来防止。\nICO表示，因此，来自429,612名客户和员工的数据被泄露，包括“24.4万名英国航空公司客户的姓名、地址、支付卡号码和CVV号码”，并补充说，77000名客户的信用卡和CVV号码以及仅有10.8万名客户的卡号也被认为是此次泄露的一部分，此外还有英国航空公司员工和管理员账户的用户名和密码，以及多达612名英国航空公司高管俱乐部账户的用户名和个人识别码(似乎最后两个账户也没有完全核实)。\n最重要的是，英航从未检测到攻击，该公司表示：它收到了第三方的入侵通知。\nICO表示，其行动已得到欧盟其他DPA的批准：这是因为袭击发生时英国仍在欧盟，因此ICO代表欧盟当局进行了调查。", "note_en": "The major step down in the fine underscores what kind of an impact the coronavirus pandemic is having on regulations. In some cases, in order more quickly address issues that potentially impact business growth, we’ve seen regulators try to  speed up their responsiveness and even leave behind some previous reservations to green light activities, as in the case of e-scooters.\n But in the case of the BA fine, we’re seeing the other side of the Covid-19 impact: regulators are taking a less hard line with penalties on companies that are already struggling. That raises questions of how impactful their decisions are, and what kind of a precedent they are setting for future security and data protection neglect.\n   “People entrusted their personal details to BA and BA failed to take adequate measures to keep those details secure,” said Information Commissioner Elizabeth Denham in a statement. “Their failure to act was unacceptable and affected hundreds of thousands of people, which may have caused some anxiety and distress as a result. That’s why we have issued BA with a £20m fine – our biggest to date. When organisations take poor decisions around people’s personal data, that can have a real impact on people’s lives. The law now gives us the tools to encourage businesses to make better decisions about data, including investing in up-to-date security.”\n The fine is the highest-ever leveled by the ICO. But it’s a major step down from the £184 million penalty — 1.5% of BA’s revenues in the 2018 calendar year — that the regulator had  originally set last year. That was, of course, before the coronavirus pandemic hit, halting travel globally and bringing many airlines to their knees. The original order went through a process of appeal, which included an assessment of the state of the company in the current market.\n “In June 2019 the ICO issued BA with a notice of intent to fine,” the ICO noted in its statement on the reduced fine. “As part of the regulatory process the ICO considered both representations from BA and the economic impact of COVID-19 on their business before setting a final penalty.”\n The salient facts of the investigation’s findings remained the same: the ICO had determined that BA had “weaknesses in its security” that could have been prevented with security systems — procedures and software — that were available at the time.\n As a result, data from 429,612 customers and staff was leaked, including “names, addresses, payment card numbers and CVV numbers of 244,000 BA customers,” the ICO said, adding that the combined card and CVV numbers of 77,000 customers and card numbers only for 108,000 customers were also believed to be a part of the breach, as well as the usernames and passwords of BA employee and administrator accounts, and the usernames and PINs of up to 612 BA Executive Club accounts (these last two were also not completely verified, it seems).\n On top of that, BA never detected the attack, it said: it was notified of the breach by a third party.\n The ICO said that its action has been approved by other DPA’s in the European Union: this is because the attack happened while the UK was still in the EU, and so the investigation was carried out by the ICO on behalf of the EU authorities, it said.", "posttime": "2020-10-16 19:58:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ico", "title": "\n英国ICO将英国航空公司数据泄露罚款下调至2000万英镑，最初设定为1.84亿英镑", "title_en": "\n\t\t\t\tUK’s ICO downgrades British Airways data breach fine to £20M, after originally setting it at £184M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/16/uks-ico-downgrades-british-airways-data-breach-fine-to-20m-after-originally-setting-it-at-184m/", "via": "", "real_tags": ["ico"]}]