[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "回到2006-2007年，我和我的朋友整理了一个电子表格，里面有大约20项高水平的成就，叫做“一切都是一场比赛”。这包括像“在野外拍摄一只活的灰熊”，“以你的名字命名一些东西”，以及“在Reddit上获得10,000(发布)因果报应”这样的目标。尽管我们对这份清单上的内容和成功的标准进行了激烈的讨论，但我们中没有人真正做过任何实质性的事情来实现这些目标。2020年初，我决定解决其中一个长期存在的问题。但我打算用人工智能来做这件事，因为我想看看如何将人工智能应用到更多的问题上。我是Fast.ai的铁杆粉丝，我欣赏它的高级抽象和简单的接口。对于那些想要深入学习的人，我强烈推荐它和相关的课程。这是一篇关于我如何用ast.ai在Reddit上创建了一个机器人来获得因果报应的帖子。\n一般来说，Reddit上的内容可以分为两类，你可以称之为原创内容和发现内容。试图自动生成要发布的原创内容将会实现类似imgflip的人工智能模因生成器，并将生成的内容发布到r/memes。虽然生成的模因是比喻的有趣并列，但它们通常不如熟练于观察喜剧艺术的人类用户生成的模因好。试试表情包生成器，你就会明白我的意思了。在某种程度上，我确实尝试过发布其中的一个，只是为了看看它做得有多好。\n另一种方法是在网上找到内容并将其发布。我之所以选择这条路线来实现自动化，是因为虽然生成高质量的内容更有趣，但它也更具挑战性和复杂性。在试图赶上内容的“人类质量”方面，计算机并不处于劣势，而是处于优势地位，因为海报的主要区别在于搜索大量内容的能力和速度(谁最先找到并发布一些东西)。特别值得一提的是，我最终查看了基于新闻的subreddits，原因有几个：\n不过，为什么要使用人工智能呢？如果我要自动发帖，为什么不创建一个提交所有链接的机器人，然后让大众来整理我的命运呢？总体而言，在Reddit上发垃圾邮件是被鄙视的，尽管我相信禁止是由subreddit版主的自由裁量权决定的。虽然从理论上讲，我可能已经逃脱了惩罚，或者使用了某种通用的速率限制，并抱着最好的希望，但我希望我的机器人更像是社区中一个富有成效的成员，提交深思熟虑的内容，是我自己的延伸，而不是一个垃圾邮件机器人，在被强行移除之前，垃圾邮件机器人会成为它存在的祸根。\n我搜索并找到了许多好消息subreddits，但我最初的目标是/r/business和/r/worldnews，有点武断，有些因为我对这些领域似乎很感兴趣。/r/企业拥有相当大的社区(577,000名成员)，而新闻子编辑的发帖频率相对较低，因此它似乎是可以接近的第一目标。我会构建一个网络爬虫来观察流行的商业新闻站点的新文章，然后利用基于NLP的文章分类器来确定文章是否有很高的机会获得好评。\n要训练对文章进行分类的NLP模型，我需要文章文本及其对应的Reddit分数。不幸的是，官方Reddit API将您可以检索的历史帖子数据的数量限制在1000个项目。幸运的是，还有一种替代方法，您可以使用我不知羞耻地从Water Cooler改编的代码从presShit.io抓取历史POST数据：抓取整个subreddit(/r/2007scape)。脚本的输出文件具有如下所示的各行，每行包含一个POST的JSON对象：\n{&#34；作者&#34；：&#34；CALIPHATEMEDIA&#34；，&#34；AUTHER_FLAIR_CSS_CLASS&#34；：NULL，&#34；AUTHER_FLAIR_TEXT&#34；：NULL，&#34；BRAND_SAFE&#34；：TRUE，&#34；CAN_MOD_POST&#34；：FALSE，&#34；CONTET_MODE&#34；：FALSE，&#34；CREATED_UTC&#34；：1514767344，&#34；DOMAIN&#34；：&#34；Caliphateedia.info&#34；，&#34；FULL_LINK&#34；：&#34；https://www.reddit.com/r/business/comments/7nc5yf/south_korea_to_regulate_bitcoin_trading_further/&#34；，&#34；id&#34；：&#34；7nc5yf&#34；，&#34；IS_CROSSPOSTABLE&#34；：FALSE，&#34；IS_REDIT_MEDIA_DOMAIN&#34；：FALSE，&#34；IS_SELF&#34；：FALSE，&#34；IS_VIDEO&#34；：FALSE，&#34；LOCKED&#34；：FALSE，&#34；Num_Comments&#34；：0，&#34；Num_Crosssposts&#34；：0，&#34；Over_18&#34；：FALSE，&#34；Parent_White List_Status&#34；：&#34；All_ADS&#34；，&#34；permalink&#34；：&#34；/r/business/comments/7nc5yf/south_korea_to_regulate_bitcoin_trading_further/&#34；，&#34；钉住&#34；：FALSE，&#34；RETRIED_ON&#34；：1514841750，&#34；SCORE&#34；：1，&#34；SELF&#34；：&#34；&#34；，&#34；扰流器&#34；：FALSE，&#34；粘滞&#34；：FALSE，&#34；SUBREDIT&#34；：&#34；业务&#34；，&#34；subreddit_id&#34；：&#34；T5_2qgzg&#34；，&#34；subreddit_type&#34；：&#34；public&#34；，&#34\n在加载了文章文本之后，我做了一些处理来删除加载不正确的页面，并将页面文本截断到最多10k个字符。\n我对/r/业务的NLP模型进行了为期几天的培训，内容涉及2018-01-01至2020年4月中旬期间的大约271k篇文章。我为模型使用了AWD_LSTM(例如language_model_learner(data_lm，awd_lstm，drop_mult=0.3)和text_classfier_learner(data，awd_lstm，drop_mult=0.5))，并根据文章得分使用离散标签：中性(0-10分)、可(10-100)、好(100-500)和好(500+)。这些类有点随意，我针对不同的迭代和子代码对它们进行了更改。我最终在运行时关注的唯一一件事是非中性类分数，因此这可能是一个二进制分类器，或者更好的分类器，它将单个文章视为多个子reddit的候选，而不是针对每个subreddit训练一个单独的模型。关于世界新闻，我的文章数量大约是现在的两倍。在这两种情况下，由于内存的限制，我都训练了100k的文章块，每次都会重新加载现有模型并使用新数据进行调整。\n我选择了几个网站(Business Insider、路透社、彭博社、CNN、CNBC、BBC等)。基于/r/business的频繁站点，并将它们放入脚本中，并使用Requests和BeautifulSoup构建了一个爬行器。大约每分钟，我都会爬行站点根目录，寻找新的链接，并使用boilertube处理链接的页面，然后将其传递给NLP模型进行评分。非中性得分大于0.25(我为此特定模型选择的任意阈值)的新页面将被标记，并使用AWS SNS通过电子邮件发送给我。最初，我依赖于过滤这些收到的建议，然后自己使用Reddit应用程序提交文章。\n我的网站投票器就像一个个人新闻聚合器，我用它来为要发布的东西生成建议。要将我从这个循环中移除，有几个“最后一英里”的问题需要解决。通过Reddit API编写提交代码非常简单，但我不仅仅提交所有传递给我的文章，我还充当一个质量过滤器，选择不提交看起来不合适的内容。我还为Reddit的帖子收集了一个合适的标题。页面标题通常不适合直接作为帖子标题(例如，包含站点名称之类的冗余内容)，需要重新格式化，或者应该从内容中提取标题，例如，通过选择页面上最合适的H1标记。我没有改进模型以更好地对文章进行分类并提高评分机制的准确性，然后编写新的组件来提取标题，而是决定尝试将这些任务封装到一个机械的土耳其任务中，并让人类作为最终的看门人和标题生成器。我可以从这些土耳其人的机械任务中获取结果，并利用这些结果通过Reddit API将文章提交给Reddit。\nMechanical Turk是一项利用人类为您的应用程序完成小任务的服务。它对于增强AI应用程序和通过为它们标记任务来收集数据非常有用。但有效地使用它并不是没有困难的。关于机械土耳其人，需要了解的重要一点是，平台上的许多工人都在(明智地)优化任务完成数量。在使用任务的自定义限定符时，请确保您正在寻找的资格从问题中看不出来。同样，糟糕的命中(人工智能任务)是要求用户阅读一篇文章，如果他们认为该文章属于某个类别，则选中某个复选框。例如，我对/r/WorldNews候选人这样做是为了确保其中不涉及美国新闻，但是我向/r/WorldNews提交的第一个全自动提交是“强生公司停止在美国销售婴儿爽身粉”，由于美国内部新闻在/r/Worldnews上被禁止，因此在获得42个赞成票后被删除。确保您分配的工作至少看起来像是您将查看单个结果(例如，至少使用一次文本输入框)。对你的要求要小心和清楚，减少人为错误的机会。要求用户提供文章标题，而好意会导致一些用户写出糟糕的文章标题，而不是复制文章标题(如果他们想不出一个好的标题)。更好的任务是要求用户识别并复制文章中出现的文章标题，因为这具有更可靠的质量。将机械土耳其人的任务与我的机器人连接起来后，它就能够完全自动运行了。\n您可能会注意到，我们每天最多只邮寄几件东西。事实上，我们的机器人可能正在发帖。我们在这里可以采取的一个策略是，随着时间的推移，降低门槛，以鼓励发布更多的内容，因为每个帖子都有相对有限的负面影响(一些负面影响，然后变得默默无闻)和非常高的上行潜力。惠尔\n用fast.ai构建一个reddit post bot是一个有趣的项目，然而一点手工工作就击败了我几个月的网络爬行和计算时间。毫无疑问，如果我有足够的时间运行我的post bot，并将其扩展到更多的subreddits，我会很容易地越过10k大关。当然，POST机器人是衡量我努力程度的更好方式，在这个过程中，我了解了在更大的数据集上进行比对、人类标签和培训的斗争。希望作为读者的您能够从我分享的内容中了解到这一点。如果您对如何改进文本分类器或解决此问题有建议，请随时在下面给我留言！", "note_en": "Back in 2006-2007 my friend and I put together a spreadsheet of 20 or so high-level achievements called “Everything’s a Contest”. This included goals like “Photograph a live grizzly bear in the wild”, “Have something named after you”, and  “Get 10,000 (post) karma on Reddit”. Despite our heated discussions about what should be on this list and the criteria for success none of us ever really did anything substantial to complete any of these goals. In early 2020 I decided to tackle one of these long-standing contests.  But I was going to do it with AI since I wanted to see how I could apply AI to more of my problems. I’m a huge fan of  fast.ai and I appreciate its high-level abstractions and simple interfaces. For someone trying to get into deep learning, I would highly recommend it and the associated courses. This is a post about how I built a bot to gain karma on Reddit with fast.ai.\n  Content on Reddit, in general, falls into two categories which you might call original content and found content. Trying to automate generating original content to post would be implementing something like  imgflip’s AI meme generator and posting the resulting content to r/memes. While the memes that are generated are an amusing juxtaposition of tropes, they generally aren’t as good as memes that are generated by human users skilled in the art of observational comedy. Try the meme generator out and you’ll see what I mean. At some point, I did try posting one of those just to see how well it did.\n  The other approach would be finding content online and posting it. I chose this route for automation because while generating high-quality content is more interesting it’s also far more challenging and involved. Rather than being disadvantaged in trying to catch up to the “human quality” of content, a computer is at the advantage since the primary differentiator between posters is the ability to search through large amounts of content and speed (who finds and posts something first). In particular, I ended up looking at news based subreddits due to a few reasons:\n   Why use AI at all though? If I was going to automate posting why not just create a bot that submits all links and leaves it up to the masses to sort my fate. In general, spamming on Reddit is looked down upon, though I believe banning is up to the discretion of the subreddit moderators. While in theory I might have gotten away with it or used some sort of generic rate-limiting and hope for the best, I wanted my bot to be more like a productive member of the community submitting thoughtful content, an extension of myself, rather than a spam bot that would be the bane of its existence until forcibly removed.\n I searched for and found many good news subreddits but I targeted initially /r/business and /r/worldnews, somewhat arbitrarily and somewhat because those areas seemed interesting to me. /r/business had a sizeable community (577k members) and relatively low frequency of posts for a news subreddit so it seemed approachable as a first target. I would build a web crawler to watch popular business news sites for new articles, and then leverage an NLP-based article classifier to determine if the article had a high chance of receiving upvotes.\n   To train the NLP model that will classify articles I need the article text and their corresponding Reddit scores. Unfortunately, the official Reddit API limits the amount of historic post data you can retrieve to 1000 items. Luckily there is an alternative, you can grab historic post data from  pushshift.io using code I shamelessly adapted from  WaterCooler: Scraping an Entire Subreddit (/r/2007scape). The output file of the script has individual lines like the one below, containing a JSON object of a post per line:\n {&#34;author&#34;: &#34;CALIPHATEMEDIA&#34;, &#34;author_flair_css_class&#34;: null, &#34;author_flair_text&#34;: null, &#34;brand_safe&#34;: true, &#34;can_mod_post&#34;: false, &#34;contest_mode&#34;: false, &#34;created_utc&#34;: 1514767344, &#34;domain&#34;: &#34;caliphatemedia.info&#34;, &#34;full_link&#34;: &#34;https://www.reddit.com/r/business/comments/7nc5yf/south_korea_to_regulate_bitcoin_trading_further/&#34;, &#34;id&#34;: &#34;7nc5yf&#34;, &#34;is_crosspostable&#34;: false, &#34;is_reddit_media_domain&#34;: false, &#34;is_self&#34;: false, &#34;is_video&#34;: false, &#34;locked&#34;: false, &#34;num_comments&#34;: 0, &#34;num_crossposts&#34;: 0, &#34;over_18&#34;: false, &#34;parent_whitelist_status&#34;: &#34;all_ads&#34;, &#34;permalink&#34;: &#34;/r/business/comments/7nc5yf/south_korea_to_regulate_bitcoin_trading_further/&#34;, &#34;pinned&#34;: false, &#34;retrieved_on&#34;: 1514841750, &#34;score&#34;: 1, &#34;selftext&#34;: &#34;&#34;, &#34;spoiler&#34;: false, &#34;stickied&#34;: false, &#34;subreddit&#34;: &#34;business&#34;, &#34;subreddit_id&#34;: &#34;t5_2qgzg&#34;, &#34;subreddit_type&#34;: &#34;public&#34;, &#34;thumbnail&#34;: &#34;default&#34;, &#34;thumbnail_height&#34;: 140, &#34;thumbnail_width&#34;: 140, &#34;title&#34;: &#34;South korea to regulate bitcoin trading further with tougher measures&#34;, &#34;url&#34;: &#34;http://www.caliphatemedia.info/2017/12/south-korea-govt-to-introduce-tougher.html&#34;, &#34;whitelist_status&#34;: &#34;all_ads&#34;}\n After generating a file with all the historic posts, I loaded the contents referenced by the “url” field of each JSON line into  boilerpipe3 which is a python library that simplifies HTML documents into their primary content text.\n  After loading the article text I did some processing to remove pages that didn’t load properly and to truncate page text to 10k characters at most.\n  I trained the NLP model for /r/business over a few days on approximately 271k articles from 2018-01-01 to mid-April 2020. I used an  AWD_LSTM (e.g.  language_model_learner(data_lm, AWD_LSTM, drop_mult=0.3) and  text_classifier_learner(data, AWD_LSTM, drop_mult=0.5)) for the model with discrete labels based on the article score: neutral (0-10 points), okay (10-100), good (100-500), and great (500+). The classes are kind of arbitrary and I’ve changed them around for different iterations and subreddits. The only thing I ended up paying attention to at runtime was the non-neutral class score, so this could have been a binary classifier or even better a classifier that looks at an individual article as a candidate for multiple subreddits rather than training an individual model per subreddit. For world news I had around double the number of articles. In either case I trained in 100k article chunks due to memory limitations, reloading the existing model and tuning with the new data each time.\n   I chose a few sites (Business Insider, Reuters, Bloomberg, CNN, CNBC, BBC, etc.) based on frequent sites for /r/business and put them into a script and built a crawler using requests and BeautifulSoup. Every minute or so I’d crawl the site root for new links and process the linked page with boilerpipe and pass it through the NLP model for scoring. New pages with a non-neutral score of greater than 0.25 (an arbitrary threshold I picked for this particular model) would be flagged and emailed to me using AWS SNS. Initially, I relied on filtering these incoming suggestions and submitting the articles myself using the Reddit app.\n   My site poller is acting as a personal news aggregator that I use to generate suggestions for things to post. To remove me from this loop there are a few “last mile” problems to solve. Coding up submitting via the Reddit API is easy enough, but I don’t just submit all the articles that get passed to me, I act as a quality filter choosing not to submit things which don’t seem appropriate. I also gather an appropriate title for the Reddit post. The page title is usually not good as a post title (for example containing redundancies like the site name) directly and needs to be reformatted or the title should instead be extracted from the content for example by picking the most appropriate h1 tag on the page. Rather than refining the model to be better at classifying articles and improve the accuracy of the scoring mechanism, and then coding a new component for extracting the title, I decided to try to encapsulate these tasks into a mechanical turk task and have humans as the final gate-keeper and title generator. I can take the results from these mechanical turk tasks and submit the articles to Reddit via the Reddit API utilizing those results.\n  Mechanical turk is a service for leveraging humans to complete small tasks for your application. It’s great for augmenting AI applications and collecting data via labeling tasks for them. But using it effectively isn’t without difficulties. The important thing to know about mechanical turk is that many workers on the platform are (sensibly) optimizing for task completion quantity. When using a custom qualifier for tasks, ensure the qualification you’re looking for is not apparent from the question. Similarily a bad HIT (human intelligence task) would be one where you ask the user to read an article and check some box if they think it belongs in some category. For example, I did this with /r/worldnews candidates to ensure that among other things didn’t pertain to US news, however the first fully automated submission I made to /r/worldnews was “Johnson &amp; Johnson to stop selling baby powder in the United States” which was removed after receiving 42 upvotes since US internal news is banned on /r/worldnews. Make sure the work you assign at least appears as though you will look at the individual results (e.g. use text input boxes at least once). Be careful and clear about what you’re asking and reduce the opportunities for human error. Asking for the user to supply an article title, while well-intentioned results in some users writing poor article titles rather than copying the article title if they can’t think of a good one. A better task would be to ask the user to identify and copy the article title as it appears in the article since that has more reliable quality. After hooking up mechanical turk tasks to my bot, it was capable of running fully automously.\n     You may notice that we only post a few things per day at most. In fact, our bot is probably under posting. One strategy we could adopt here would be to lower the threshold as time goes on to incentivize posting more content as each post comes with a relatively limited downside (a few downvotes then into obscurity) and a very high upside potential. While we want to avoid being spammy, our behavior is probably a little too conservative.\n  The alignment problem (in AI) is when your system performs the way you told it to, for example optimizing upvotes, but it does so in a way that goes against what you actually want. For example regarding the post I referenced earlier related to US news that was posted to /r/worldnews and then removed by a moderator. While the post did get some upvotes (~42) it violated my expectation and preference that the bot would follow the rules. Because /r/worldnews isn’t full of US news articles that are downvoted and removed for violating the rules, my bot has a lack of examples of what it shouldn’t do. We could teach it the rules in the future augmenting the dataset with things that violate the rules with very negative scores. The problem of AI alignment is deeper though, as while I did identify one thing I didn’t want the bot to do, there are many unstated things I also don’t want the bot to do that it might do to try to optimize upvotes (for example posting photoshopped pictures, offensive content, making jokes about my mother, etc.) The problem of aligning your bots actions to your desires is an open one that requires a lot of careful thought to ensure we use AI responsibly.\n  In total over 1.5 months of running the system on two subreddits, I was able to garner around 3.7k Reddit karma. Unfortunately, I never got a big hit on /r/worldnews, though I got close on some occasions. For the highly competetive /r/worldnews my mechanical turk tasks were taking just a little too long. This could have likely been remedied by increasing the monetary reward associated with each task. The other 6.3k karma came because I got tired of waiting. While I tried many things, what ended up working was digging through “interesting facts” lists and finding things that hadn’t been posted to /r/todayilearned.\n   Building a reddit post bot with fast.ai was an fun project, however a bit of manual effort beat out my months of web crawling and compute time. There is no doubt that I would have easily crossed the 10k mark given enough time running my post bot and expanding it to additional subreddits. Certainly the post bot was a better way to scale my effort, and I learned in the process about the struggles of alignment, human labeling, and training on larger data sets. Hopefully you as the reader were able to get a sense for this from what I shared. Feel free to drop me a comment below if you have suggestions for how you would improve the text classifier or approach this problem!", "posttime": "2020-11-04 00:47:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上有,karma,文章", "title": "我在Reddit上有(和没有)Fast.ai的10K帖子业力", "title_en": "I got 10k post karma on Reddit with (and without) fast.ai", "transed": 1, "url": "https://www.a8b.io/posts/10k-karma-reddit-bot/", "via": "", "real_tags": ["上有", "karma", "文章"]}, {"category": "", "categoryclass": "", "imagename": "e04654e6d5a16dd4d2d1d666c3a3179d.jpg", "infoid": 1032997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然贝宝过去曾表示要将Honey的功能引入贝宝，但首席执行官丹·舒尔曼详细介绍了贝宝去年斥资40亿美元收购的交易发现平台的整合情况，以及该应用程序和其他应用程序更新的时间表。\n收购Honey为贝宝带来了1700万月度活跃用户。这些用户转向Honey的浏览器扩展和移动应用程序，以找到他们想要购买的商品的最佳折扣，跟踪价格等。\n但今天，Honey体验仍然与贝宝本身是分开的。这是该公司明年想要改变的。\n舒尔曼表示，该公司的应用程序将进行更新，包括Honey的购物工具，比如允许你跟踪想要购买的商品的愿望清单功能，提醒你打折和降价的价格监控工具，以及它的交易、优惠券和奖励。这些工具将成为贝宝结账解决方案本身的一部分。\n这意味着，该公司将能够从最初的交易寻找阶段跟踪客户，在这个阶段，他们表示对某一产品感兴趣，为他们提供折扣和优惠，然后引导他们在一个地方完成结账体验。\nPayPal还将根据消费者对Honey工具的参与度向商家提供“匿名需求数据”，以帮助他们推动销售，该公司表示。\n更重要的是，贝宝给出了蜜糖整合的时间表，以及它计划在明年推出的其他更新。\n贝宝(PayPal)表示，Bill Pay将于本月开始推出，预计2021年上半年将对数字钱包体验进行大规模重新设计。大部分新功能将在今年第二季度和下半年推出，目标是在明年年底之前推出大部分更改。\n这也包括贝宝10月底宣布的加密货币计划。该公司的目标是最初支持比特币、以太、比特币现金和Litecoin，最初是在美国。\n舒尔曼在财报电话会议上对投资者发表讲话时还指出，贝宝(PayPal)计划何时将密码带给更多用户和地区。他说，购买、出售和持有加密货币的能力将首先到达美国，然后将在明年上半年推出国际市场和Venmo应用程序。(目前，贝宝(PayPal)正在向美国用户提供加入应用程序内新密码功能的等待名单)。\n这一变化将允许贝宝的用户在公司2800万商家中使用加密货币购物，而不需要商家进行额外的整合。该公司解释说，这是因为它将如何处理结算过程，用户在贝宝(PayPal)商家结账时，将能够以设定的汇率即时将密码转换为法定货币。\n贝宝(PayPal)最近还加入了“现在购买，稍后付款”的竞赛，推出了新的“4次付款”分期付款计划，允许消费者将购买商品分成4次付款。这项服务在8月下旬在美国推出之前在法国首次亮相，此后又在英国推出(如Pay in 3)。在接下来的几个月里，这也将更多地整合到公司的应用程序中。\nVenmo-该公司预计明年的收入将达到9亿美元-将看到业务概况的扩大，并将获得加密能力、更基本的金融工具和购物工具，以及“用Venmo支付”结账体验的改造。\n舒尔曼将该公司对Venmo和贝宝(PayPal)应用程序进行彻底改革的计划称为一次“根本性的转变”，因为随着这些变化在未来一年的推出，这些应用程序将包括多少新功能，以及新的用户体验-基本上是重新设计-这将允许人们轻松地从一种体验转移到另一种体验，而不必更换应用程序或使用桌面浏览器。\n贝宝(PayPal)本周的收益并没有让华尔街的投资者感到兴奋，导致该股因缺乏2021年的指引而下跌。但对于贝宝的数字钱包应用程序来说，未来一年看起来是有趣的一年。", "note_en": "While PayPal had spoken in the past about bringing  Honey’s   capabilities into PayPal, CEO Dan Schulman detailed the integrations PayPal has in store for the deal-finding platform  it bought last year for $4 billion, as well as a time table for both this and the other app updates it has in store.\n The Honey acquisition had brought 17 million monthly active users to PayPal. These users turned to Honey’s browser extension and mobile app to find the best savings on items they want to buy, track prices and more.\n  But today, the Honey experience still remains separate from PayPal itself. That’s something the company wants to change next year.\n According to Schulman, the company’s apps will be updated to include Honey’s shopping tools like its Wish List feature that allows you to track items you want to buy, price monitoring tools that alert you to savings and price drops, plus its deals, coupons and rewards. These tools will become part of PayPal’s checkout solution itself.\n That means the company will be able to track the customer from the initial deal-hunting phase where they’re indicating their interest in a certain product, target them with savings and offers, then guide them through its checkout experience all in one place.\n PayPal will also provide “anonymous demand data” to merchants based on consumer engagement with Honey’s tools to help them drive sales, the company said.\n What’s more, PayPal put timeline on the Honey integrations and the other updates it plans to roll out over the course of the next year.\n Bill Pay will start to roll out this month, PayPal said, with a large redesign of the digital wallet experience expected for the first half of 2021. Much of the new functionality will be arriving in the second quarter and the second half of the year, with a goal of having the majority of the changes rolled out by the end of next year.\n This also includes PayPal’s plans for cryptocurrencies,  announced at the end of October. The company aims to support Bitcoin, Ethereum, Bitcoin Cash and Litecoin at first, initially in the U.S.\n Speaking to investors during the earnings call, Schulman also noted when PayPal plans to bring crypto to more users and geographies. He said the ability to buy, sell and hold cryptocurrencies will first arrive in the U.S., then will roll out to international markets and the Venmo app in the first half of next year. (Currently, PayPal is offering U.S. users to join a waitlist for the new crypto features in-app).\n  This change will allow PayPal’s users to shop using cryptocurrencies across the company’s 28 million merchants without requiring additional integrations on merchants’ part. The company explained this is due to how it will handle the settlement process, where users will be able to instantaneously transfer crypto into fiat currency at a set rate when checking out with PayPal merchants.\n PayPal also  recently joined the “buy now, pay later” race with its new “Pay in 4” installment program that lets consumers split purchases into 4 payments. This debuted in France ahead of its late August U.S. launch and has since rolled out to the U.K. (as Pay in 3). This too, will become more integrated into the company’s apps in the months ahead.\n Venmo — which the company expects to reach $900 million in revenues next year — will see the expansion of business profiles, and will gain crypto capabilities, more basic financial tools and shopping tools, as well as a revamp of the “Pay with Venmo” checkout experience.\n Schulman referred to the company’s plans to overhaul its Venmo and PayPal apps as a “fundamental transformation,” due to how much new functionality they will include as the changes roll out over the next year as well as the new user experience — basically, a redesign — that will allow people to move easily from one experience to the next instead of having to change apps or use a desktop browser, for example.\n PayPal’s earnings  hadn’t excited Wall St. investors this week, sending the stock down on its lack of 2021 guidance. But the year ahead for PayPal’s digital wallet apps looks to be an interesting one.", "posttime": "2020-11-04 00:28:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "钱包,honey,贝宝", "title": "\n贝宝详细说明了其2021年的数字钱包计划，包括加密、蜂蜜集成等", "title_en": "\n\t\t\t\tPayPal details its digital wallet plans for 2021, including crypto, Honey integration and more\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/paypal-details-its-digital-wallet-plans-for-2021-including-crypto-honey-integration-and-more/", "via": "", "real_tags": ["钱包", "honey", "贝宝"]}, {"category": "", "categoryclass": "", "imagename": "ea41dcf2705b1faf0b194bffeca434f6.jpg", "infoid": 1032996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在GitHub代码托管网站要求将正常的90天披露期限延长一倍后，谷歌安全团队谷歌零项目(Google Project Zero)披露了它认为GitHub存在严重缺陷的信息。\nGitHub的操作功能(开发人员工作流程自动化工具)中存在的漏洞，已成为在Google Project Zero(GPZ)标准90天期限到期前未得到妥善修复的罕见漏洞之一。在Google Project Zero(GPZ)标准的90天期限过后，GitHub的操作功能(Actions)中的漏洞已成为少有的未得到妥善修复的漏洞之一。据谷歌黑客称，超过95.8%的漏洞在最后期限内被修复。\n众所周知，GPZ对90天的最后期限通常很严格，但在谷歌给了它一切机会修复这个漏洞后，随着最后期限的临近，GitHub的回应似乎有点松懈。\n正如GPZ的菲利克斯·威廉姆(Felix Wilhelm)在一份披露时间表中详细描述的那样，谷歌安全团队于7月21日向GitHub的安全部门报告了这一问题，披露日期定在10月18日。\n当运行程序进程解析打印到STDOUT的每一行以查找工作流命令时，作为其执行的一部分打印不可信内容的每个GitHub操作都容易受到攻击。Wilhelm写道，在大多数情况下，设置任意环境变量的能力会导致在执行另一个工作流后立即远程执行代码。\n我花了一些时间查看流行的GitHub存储库，几乎任何具有稍微复杂的GitHub操作的项目都容易受到此错误类的攻击。\nGitHub在10月1日发布了一项建议，反对这些易受攻击的命令，但辩称Wilhelm发现的实际上是一个中度安全漏洞。GiHub为该漏洞分配了跟踪标识符cve-2020-15228。\n据Wilhelm称，10月12日，GPZ联系了GitHub，如果GitHub想要更多时间禁用易受攻击的命令，GPZ将主动提供14天的宽限期。\nGitHub随后接受了宽限期的提议，根据Wilhelm的说法，它希望在10月19日之后禁用这些易受攻击的命令。GPZ随后将新的披露日期设定为11月2日。\n然后在10月28日，GPZ通知GitHub截止日期将于下周到期，但没有得到任何回应。\nWilhelm解释说，由于GitHub没有做出官方回应，Project Zero联系了GitHub的非正式联系人，他们表示这个问题已经解决，[GPZ]显然将按计划在2020-11-02上市。\n但在截止日期的前一天，GitHub做出了官方回应，并要求再延长两天，在未来的日期通知客户修复情况。\nGitHub回应并提到，他们不会在2020-11-02年前禁用这些易受攻击的命令。威廉写道，他们要求额外的48小时，不是为了解决这个问题，而是通知客户，并在未来的某个时候确定一个硬日期。\n因此，GPZ在周一继续披露了它报告的漏洞，因为根据其政策，它可以提供104天-90天外加14天宽限期以外的延期。\n预计修复时间超过104天的漏洞将不会获得宽限期，Google Project Zero在其2020年的披露政策中声明。", "note_en": "Google Project Zero, the Google security team that finds bugs in all popular software, has disclosed what it classes a high-severity flaw on GitHub after the code-hosting site asked for a double extension on the normal 90-day disclosure deadline.\n The bug in GitHub&#39;s Actions feature – a developer workflow automation tool – has become one of the rare vulnerabilities that wasn&#39;t properly fixed before Google Project Zero&#39;s (GPZ) standard 90-day deadline expired. Over 95.8% of flaws are fixed within the deadline,  according to Google&#39;s hackers.\n    GPZ is known to be generally strict with its 90-day deadline, but it appears GitHub was a little lax in its responses as the deadline approached after Google gave it every chance to fix the bug.\n  As  detailed in a disclosure timeline by GPZ&#39;s Felix Wilhelm, the Google security team reported the issue to GitHub&#39;s security on July 21 and a disclosure date was set for October 18.\n  &#34;As the runner process parses every line printed to STDOUT looking for workflow commands, every GitHub action that prints untrusted content as part of its execution is vulnerable. In most cases, the ability to set arbitrary environment variables results in remote code execution as soon as another workflow is executed,&#34; wrote Wilhelm.\n   &#34;I&#39;ve spent some time looking at popular GitHub repositories and almost any project with somewhat complex GitHub actions is vulnerable to this bug class.&#34;\n GitHub issued  an advisory on October 1 and deprecated the vulnerable commands, but argued that what Wilhelm had found was in fact a &#34;moderate security vulnerability&#34;. GitHub assigned the bug the tracking identifier CVE-2020-15228.\n On October 12, GPZ contacted GitHub and proactively offered it a 14-day grace period if GitHub wanted more time to disable the vulnerable commands, according to Wilhelm.\n GitHub then took up the offer of a grace period, and per Wilhelm, it hoped to disable the vulnerable commands after October 19. GPZ then set the new disclosure date to November 2.\n Then on October 28, GPZ alerted GitHub that the deadline was expiring the following week but got no response.\n Due to lack of official response from GitHub, Project Zero contacted informal GitHub contacts who said &#34;the issue is considered fixed and that [GPZ] are clear to go public on 2020-11-02 as planned&#34;, explained Wilhelm.\n  But then a day before deadline, GitHub gave its official response and requested a further two days to notify customers of a fix at a future date.\n &#34;GitHub responds and mentions that they won&#39;t be disabling the vulnerable commands by 2020-11-02. They request an additional 48 hours, not to fix the issue, but to notify customers and determine a &#39;hard date&#39; at some point in the future,&#34; wrote Wilhelm.\n So GPZ on Monday proceeded to disclose the bug it reported because it can&#39;t, as per its policy, offer an extension beyond the 104 days – 90 days plus 14 days&#39; grace.\n &#34;Grace periods will not be granted for vulnerabilities that are expected to take longer than 104 days to fix,&#34;  Google Project Zero states on its 2020 disclosure policy.", "posttime": "2020-11-04 00:27:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,开发,漏洞,谷歌,github", "title": "谷歌对GitHub：时间到了--这个未修复的“高度严重”安全漏洞影响了开发人员", "title_en": "Google To GitHub: Time's Up -- This Unfixed 'High-Severity' Security Bug Affects Developers", "transed": 1, "url": "https://www.zdnet.com/article/google-to-github-times-up-this-unfixed-high-severity-security-bug-affects-developers/", "via": "", "real_tags": ["google", "开发", "漏洞", "谷歌", "github"]}, {"category": "", "categoryclass": "", "imagename": "a8ff3c12e4e676e6cb81d35940395a8b.jpg", "infoid": 1032994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是格列布·巴姆托夫关于JS党#148的一段虚构的摘录。Gleb是Cypress.io的工程副总裁。要获得完整的体验，你应该边看边听。\n通常，人们会说测试就像金字塔。想象一下像埃及那样的金字塔。\n在底部，您有一个非常广泛的单元测试层。而单元测试测试的是最小的代码片段。\n(假设您编写了一个将两个数字相加的函数；因此您编写了一个测试。如果我使用参数2和3调用该函数，是否会得到5？)。\n世界上每种语言都有一个单元测试框架，因为它非常简单。只需加载一段代码，运行它，检查您得到的结果，确保它符合您的预期。这就是金字塔底部通常非常宽的原因，因为只需编写数百个测试来测试您所有的小组件就很容易了。\n当你在金字塔中向更高的位置移动时，现在你正试图把代码单元放在一起。\n也许您正在尝试使用TODO类，但是表示一些东西，然后您要做一些其他的代码片断。您现在主要是想看看几个代码单元是否协同工作；它们是如何集成的。这就是您发现后端团队和前端团队实际上沟通不是很好的地方。所以我的模块与另一个模块不能很好地协同工作。\n端到端测试是指您试图像最终用户那样运行整个测试。例如，您在浏览器中打开一个网站，然后导航和使用您的Web应用程序，并检查它是否正确地更新了页面，是否正确地调用了后端。\n金字塔的顶部通常很尖。这是因为您不应该编写很多端到端测试。我认为现在这种想法已经过时了，因为为什么编写端到端测试会很难呢？\n很难安装端到端的测试跑步器。太挑剔了。它是不稳定的。这些测试不可靠，没有给您太多信心，因此您实际上花费在维护大多数端到端测试上的时间比您实际花在编写Web应用程序上的时间还要多。\n编写许多单元测试，编写许多集成测试，但只编写几个端到端测试(可能只是为了保持理智)。\n当我们看一看Cypress允许您做什么(即编写许多非常少的有用测试)时，您会想要编写更多的端到端测试。您希望使金字塔几乎像一个矩形，或者可能像一个披萨片，其中有很多端到端测试和几个单元测试。\n这又回到了效率的问题上。如果您测试一个将两个数字相加的小的单个函数…。是的，测试很简单，速度也很快，但它确实只达到了那个特定的功能。但是你的Web应用程序很大，潜在的错误来源不仅仅是你的函数中的逻辑错误：\n你必须在后端和前端以及它们之间的所有互联网小东西中正确设置。而现代的浏览器(这是一台极其复杂的机器)中，您认为它将完全执行“两个数字相加”的假设与最终结果是不同的。在现代浏览器中，您认为它将完全执行“两个数字相加”的假设与最终结果是不同的。\n那么，当你思考它的有效性是什么，或者你实际锻炼了多少？您能找到多少潜在错误？\n嗯，单元测试可以找到一些逻辑错误，这很棒。我一直都在为此编写单元测试。但是所有可能的误差源都是通过端到端测试发现的。\n如果您可以测试您刚刚部署的站点并了解主用户情景-就像人类用户稍后所做的那样-如果这能正常工作的话…。当真正的用户经历同样的事情时，它可能会成功。\n所以，如果我们翻转金字塔，把顶部做得越来越宽，我们会写更多的端到端测试，因为它们是有效的，我们让它几乎像披萨片一样，我们在那里写更多的端到端测试，或者如果我们从端到端测试开始，这是有意义的。\n最近发生了什么事？像Cypress这样的功能测试者或测试运行者找到一个文本，点击按钮，做所有这些事情，但它只验证应用程序是否工作。\n它不会验证应用程序看起来是否良好。我们都是人类。我们喜欢漂亮的东西，所以我们喜欢款式。有些人甚至将CSS添加到他们的应用程序中。我不知道为什么，但这太疯狂了。😉。\n一旦他们添加了CSS并设计了样式，他们希望确保应用程序看起来是一样的，并且不会不小心弄坏它。\n如果我们选择元素，并且您使用它们，并且您检查项目的数量，CSS仍然可以更改。然后应用程序看起来就像垃圾一样，用户会不高兴，没有人会从你的网站上买任何东西。\n赛普拉斯只是一个功能测试跑步者。它不关心CSS。很难写出所有的断言说：\n此元素的颜色应为蓝色，边框半径应为2…\n因此，人们所做的-因为它是真正的浏览器-是您可以获取并生成页面(或页面的一部分)的屏幕截图，然后您可以进行视觉测试。\n因此，您保存一个屏幕截图，它将成为基线或主图像。下次运行测试时，您将拍摄另一个屏幕截图，然后逐个像素地将其与您的基线图像进行比较。然后将这些基线图像与源代码一起存储在存储库中。\n计算机非常擅长逐个像素地比较图像，它们会告诉你：\n以前是这样的。现在是不同的颜色了。这里是它改变的地方。\n他们的意思是要更改这里的CSS吗？为什么它不再是蓝色而现在是红色？\n对我来说，视觉测试是一个非常有效的工具，配上完整的端到端测试，你可以直接加载应用程序，截图，现在你知道它永远不会意外改变。在应用程序做出反应、更改布局、出现新的DOM元素时执行某些操作。然后再截取另一张屏幕截图。\n砰的一声。现在你把它绑得太紧了，任何视觉改变(任何CSS、SVG，任何东西)都会随着像素的变化而改变，你就会知道你不小心破坏了样式。你会知道你不小心让Craigslist看起来像Reddit…。\n所以对我来说，现在最有用的金字塔是一个金字塔，完全是端到端的，功能和视觉测试。就这样。\n然后，我可以通过检测应用程序代码来跟踪代码覆盖率；将贯穿整个流程的端到端测试(就像真正的用户一样)在代码覆盖率方面非常有效。\n嗯，因为端到端测试测试了整个应用程序，如果它贯穿整个用户故事，那么一个测试就可以涵盖大部分内容。\n然后查看未覆盖的行，并为这些边缘情况编写端到端测试。如果您无法同时访问这两行，因为可能存在无法通过设计良好的接口访问的边缘情况，那么您可以编写端到端测试、API测试和组件测试，然后单击这些行，因此您知道这些代码的组件和单元测试也可以正常工作。\n但它变成了端到端测试的金字塔，其他类型测试的小三角形，对我来说，它看起来像一只螃蟹，因为它是一种很大的头盔壳，在它下面有小装甲的腿。\n我们和格莱布的谈话不止于此。收听整集，听听Cypress的故事，他们是如何围绕开源找到一种商业模式的，你如何让你的端到端测试不那么脆弱，等等。从这里开始播放，就在这里，👇。\n哦，别忘了在你最喜欢的播客应用中订阅JS Party，这样你就不会错过未来的剧集和洞察力。✌️", "note_en": "This is a fancified excerpt from Gleb Bahmutov on  JS Party #148. Gleb is VP of Engineering at  Cypress.io. To get the full experience you should listen while you read.\n    Typically, people say that testing is like a pyramid. Imagine a pyramid like in Egypt.\n   At the bottom you have a very wide layer of unit tests. And unit tests test the smallest piece of code.\n (Imagine you write a function that adds two numbers; so you write a test. If I call that function with arguments 2 and 3, do I get 5?)\n Every language under the sun has a unit testing framework, because it’s so easy. Just load a piece of code, run it, check the result that you get, make sure it’s what you expect. So that’s why the bottom of the pyramid is usually very wide, because it’s easy to just write hundreds of tests to exercise all your little components.\n  And when you move higher up in the pyramid and now you’re trying to put units of code together.\n Maybe you’re trying to use a  Todo class, but represent something and you do some other pieces of code. You’re now mostly trying to see if a couple of units of code work together; how they integrate. And that’s where you discover parts where the backend team and the frontend team actually did not communicate very well. So my module doesn’t work very well with another module.\n   An end-to-end test is when you’re trying to run the whole thing as the end user would. For example, you open a website in your browser and you navigate and you work with your web application and you check if it updates the page correctly, if it calls the backend correctly.\n The top of the pyramid is usually very sharp. That’s because you’re not supposed to write many end-to-end tests.  I think this is obsolete thinking nowadays, because why was it hard to write end-to-end test?\n It was hard to install the end-to-end test runner. It was finicky. It was flaky. The tests were flaky and didn’t give you much confidence, so you actually spent more time maintaining most end-to-end tests than you would actually spend time writing your web application.\n  Write many unit tests, write many integration tests, but just a few end-to-end tests (maybe just as a sanity).\n And when we look at what  Cypress allows you to do (which is write many useful tests that have very little flake) then you wanna write  more end-to-end tests. You wanna make the pyramid almost like a rectangle  or maybe as a pizza slice, where you have a lot of end-to-end tests and a few unit tests.\n  It goes back to efficiency. If you test a small, single function that adds two numbers… Yeah, the test is easy, it’s fast, but it really only hits that particular function. But your web app is  large and potential sources of errors are not just logical errors in your functions:\n  That you have to set correctly in the backend and the frontend and all the little internet stuff in between.  And the modern browser (which is an awfully, awfully complicated machine) where your assumptions that it will execute this add “two numbers together” completely is different from what the end thing will do.\n So when you think about what’s the effectiveness, or how much do you actually exercise? How many potential errors can you find?\n Well, the unit tests can find you a few logical errors, which is great. I write unit tests for that all the time.  But all possible sources of error are discovered by end-to-end tests.\n If you can test the site you just deployed and go through the main user story –just like a human user would do later on– if  that works… the chances are when the real user goes through the same thing, it will be successful.\n  So if we flip the pyramid and we make the top wider and wider, and we will write more end-to-end tests, because they’re effective and we make it almost like a pizza slice, where we write more end-to-end tests, or if we start with end-to-end tests, it makes sense.\n   And what happens recently? Well, a functional tester or test runner like Cypress finds a text, clicks on the button, does all those things, but  it only verifies that the application works.\n It  doesn’t verify that the applications looks good. And we’re all humans. We like pretty things, so we like styles. Some people even add CSS to their apps. I don’t know why, but it’s crazy. 😉\n Once they add CSS and they do the styling, they want to make sure the app looks the same, and they don’t accidentally break it.\n If we select elements, and you work with them, and you check the number of items, the CSS can still change. And then the application will look like crap, and users will be unhappy, and nobody is gonna buy anything from your website.\n Cypress is just a functional test runner.  It doesn’t care about CSS. And it’s very hard to write all the assertions saying:\n The color of this element should be blue, and the border radius should be 2…\n   So instead, what people do –because it’s a real browser– is you can take and generate a screenshot of your page (or a part of it) and then you can do visual testing.\n So you save a screenshot and it becomes a baseline or a master image. The next time you run the test you take another screenshot and then you  compare it pixel by pixel with your baseline imagine. And you store those baseline images with your source code in your repository.\n Computers are really good at comparing images pixel by pixel, and they’ll tell you:\n   It used to be this. Now it’s a different color. Here’s where it changed\n  Did they mean to change the CSS here? Why is it no longer blue and now red?\n Visual testing to me is such an effective tool, paired with a full end-to-end test.,You can literally load the application, take a screenshot, and now you know  it will never change accidentally. Do something where the application reacts, changes the layout, new DOM elements appear. Then you take another screenshot.\n Boom. Now you tie it so close, any visual change (any CSS, SVG, anything) will change with pixels, and you’ll know that you accidentally broke the styling. And you’ll know that accidentally you made Craigslist look like Reddit…\n   So to me, the most useful pyramid right now is a pyramid that’s wholly end-to-end, functional and visual tests. That’s it.\n And then, I can track code coverage instrumenting my application code; the end-to-end tests that will go through the whole flow, like a real user, are so effective at code coverage.\n    Well, because end-to-end tests exercise the whole application, a single test can cover most of it, if it goes through the whole user story.\n And then you look at the lines not covered, and you write end-to-end tests for those edge cases. And if you cannot reach both lines, because there could be edge cases that are unreachable through a well-designed interface, then you write end-to-end tests, API tests and component tests, and hit those lines, so you know that those components and unit tests of code work as well.\n But it becomes a pyramid of end-to-end tests, little triangles for other types of tests, and to me it looks like a crab, because it’s a big kind of helmet shell, and little armored legs under it.\n     Our conversation with Gleb doesn’t stop there. Listen to the entire episode to hear the story of Cypress, how they found a business model around open source, how  you can make your end-to-end tests less brittle, and much more. Play it from the start right here 👇\n  Oh, and don’t forget to subscribe to  JS Party in your favorite podcast app so you don’t miss future episodes and insights. ✌️", "posttime": "2020-11-04 00:17:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金字塔,pyramid,测试", "title": "测试金字塔应该看起来更像一只螃蟹", "title_en": "The testing pyramid should look more like a crab", "transed": 1, "url": "https://changelog.com/posts/the-testing-pyramid-should-look-more-like-a-crab", "via": "", "real_tags": ["金字塔", "pyramid", "测试"]}, {"category": "", "categoryclass": "", "imagename": "8c9aeb830b8d6dddcbc6a8bc54cf3607.jpeg", "infoid": 1032993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一个框架可以解析比特流和模糊比特流变化。目前，逻辑瓦片(PLC)配置和互连、基本IO和IOLOGIC配置、EBR配置、全局布线和基本DSP配置已经模糊化。剩下的工作包括完成IO和DSP的模糊化，以及PCIe、PLL和DPHY等硬IP的模糊化。\nSudo apt-get install build-Essential clang bison flex libreadline-dev\\gawk tcl-dev libffi-dev git Mercurial raphviz\\xdot pkg-config python python3 libftdi-dev\\qt5-default python3-dev libost-all-dev cmake libeogen 3-dev。\n单个命令行工具prjoxide支持用于位流打包和解包的子命令，以及用于nextpnr构建过程的BBA生成。要构建并安装它，请运行：\n默认情况下，它将安装到您可能需要添加到PATH中的~/.go/bin。您可以使用--root或CAROCK_INSTALL_ROOT环境变量来覆盖安装根目录。\n此可执行文件包含嵌入其中的所有数据；因此，如果需要，可以将其自由移动到系统上的另一个位置。因此，您需要在数据库更新后重新构建prjoxide。\n构建nextpnr-nexus，确保将其指向prjoxide工具的正确路径：\n主框架(Libprjoxide)是用Rust编写的。由于开发端包括对Fuzzer和其他实用工具使用pyo3的Python绑定，因此将需要nighly Rust。强烈建议使用Rustup安装此软件。\n如果运行Fuzzers，您可能还需要将USER_ENVIMENT.sh(将由上面的脚本创建)中的路径调整为Radiant。", "note_en": "A framework is in place to parse bitstreams and fuzz bitstream changes. Currently the logic tile (PLC) config and interconnect; basic IO and IOLOGIC config; EBR config; global routing and basic DSP config have been fuzzed. Remaining work includes finishing IO and DSP fuzzing; and fuzzing the hard IP like PCIe, PLLs and DPHY.\n       sudo apt-get install build-essential clang bison flex libreadline-dev \\ gawk tcl-dev libffi-dev git mercurial graphviz \\ xdot pkg-config python python3 libftdi-dev \\ qt5-default python3-dev libboost-all-dev cmake libeigen3-dev\n     A single command line tool  prjoxide supports subcommands for bitstream packing and unpacking as well as BBA generation for the nextpnr build process. To build and install it, run:\n  This will, by default, install to  ~/.cargo/bin which you may need to add to your  PATH. You can use  --root or the  CARGO_INSTALL_ROOT environment variable to override the installation root.\n This executable contains all data embedded in it; so it can be freely moved to another location on your system if required. Consequently, however, you will need to rebuild prjoxide after a database update.\n    Build nextpnr-nexus, making sure to point it to the correct path for the prjoxide tool:\n      The main framework (libprjoxide) is written in Rust. As the development side includes Python bindings using pyo3 for fuzzers and miscellaneous utilities, nightly Rust will be required. It is strongly recommended to use  rustup to install this.\n     If running fuzzers, you might also need to adjust the path to Radiant in  user_environment.sh (which will be created by the above script).", "posttime": "2020-11-04 00:17:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fpga,documenting,dev", "title": "Prjoxide：记录晶格公司的28 nm FPGA部件", "title_en": "Prjoxide: Documenting Lattice's 28nm FPGA parts", "transed": 1, "url": "https://github.com/daveshah1/prjoxide", "via": "", "real_tags": ["fpga", "dev"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Suzieq既是一个框架，也是一个使用该框架的应用程序，它专注于提高网络的可观察性。我们将可观察性定义为系统回答您在操作网络时提出的琐碎或复杂问题的能力。你回答问题的难易程度是衡量系统可观察性有多好的标准。一个好的可观察系统远远超出了监测和警报的范畴。Suzieq主要供网络工程师和设计人员使用。\n苏泽克做了好几件事。它从不同的设备和系统收集数据。它将数据标准化，然后以独立于供应商的方式存储数据。然后它就可以对这些数据进行分析。\n我们认为Suzieq很新颖，因为它是一个分类框架，允许您独立选择：\n您如何与数据交互，即您如何提问以及如何看到答案。\n通过我们在框架之上构建的应用程序，我们希望演示一种不同的、更系统的网络思考方法。我们想要展示从整体上考虑您的网络是多么有用。\n在Suzieq的这个非常早的版本中，我们为这个框架选择了一些答案来让球滚动起来。\n我们使用无代理模型收集数据，使用SSH或REST API作为传输。\n所有分析都通过CLI或Python对象公开。输出可以以各种格式呈现，从纯文本到JSON和CSV。\n我们支持从Cumulus、Arista、Junos和nXos路由器以及Linux服务器收集数据。我们聚集在一起：\n我们和苏泽克的合作才刚刚开始。作为一个较早发布的版本，您所看到的仅仅是此方法能带来什么的一个简短演示。我们有很多很多想法要在我们即将发布的版本中实现，但是我们想把它拿出来，这样人们就可以开始使用它了。并开始了解他们的网络以解决问题、验证或做出改变。\n你可以通过SLACK加入谈话。向Dinesh或Justin发送电子邮件，其中包含要向其发送Slake邀请的电子邮件地址。\n我们还在寻找合作伙伴，帮助我们使Suzieq成为一个真正有用的多供应商、开源平台，用于观察网络的方方面面。有关如何提供帮助的想法，请阅读协作文档。", "note_en": "Suzieq is both a framework and an application using that framework, that is focused on  improving the observability of your network. We define observaility as the ability of a system to answer either trivial or complex questions that you pose as you go about operating your network. How easily you can answer your questions is a measure of how good the system&#39;s observability is. A good observable system goes well beyond monitoring and alerting. Suzieq is primarily meant for use by network engineers and designers.\n Suzieq does multiple things. It collects data from different devices and systems. It normalizes the data and then stores it in a vendor independent way. Then it allows analysis of that data.\n We believe Suzieq is novel because it is a disaggregated framework that allows you to independently pick:\n how you interact with the data i.e. how you ask the questions and how you see the answers.\n With the applications that we build on top of the framework we want to demonstrate a different and more systematic approach to thinking about networks. We want to show how useful it is to think of your network holistically.\n In this very early release of Suzieq, we&#39;ve chosen some answers for the framework to get the ball rolling.\n We gather data using an agentless model using either SSH or REST API as the transport.\n   All the analysis are exposed either via a CLI or via Python objects. The output can be rendered in various formats from plain text to JSON and CSV.\n We support gathering data from Cumulus, Arista, JunOS and NXOS routers, and Linux servers. We gather:\n  We are just getting started with Suzieq. As befitting an early release, what you see is only a brief demonstration of what this approach can bring about. We&#39;ve many, many ideas to implement in our upcoming releases, but we wanted to get this out so that people can start using it. And start understanding their networks to solve problems, validate or to make changes.\n You can join the conversation via  slack. Send email to Dinesh or Justin with the email address to send the Slack invitation to.\n We&#39;re also looking for collaborators to help us make Suzieq a truly useful multi-vendor, open source platform for observing all aspects of networking. Please read the  collaboration document for ideas on how you can help.", "posttime": "2020-11-03 23:50:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,network", "title": "Suzieq：网络可观测性", "title_en": "Suzieq: Network Observability", "transed": 1, "url": "https://suzieq.readthedocs.io/en/latest/", "via": "", "real_tags": ["网络", "network"]}, {"category": "", "categoryclass": "", "imagename": "5470eb3c655cf88b1ad9ba87f0cba169.jpg", "infoid": 1032989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "蒂姆·吴(Tim Wu)在Medium上有一篇新文章，名为本·汤普森(Ben Thompson)的“战略对话”(Stratechery)；我认为，副标题更能描述吴的前提：\n汤普森最近开始在科技反垄断领域发表声明并进行分析，但在这方面，他的依据并不扎实。我意识到深厚的行业专业知识在他的领域很重要，特别是在设计有意义的补救措施时。缺乏法律或经济学背景并不意味着取消资格。尽管如此，我还是要说，如果汤普森的读者过于依赖他关于技术反垄断的言论，他们就有被误导的风险。因为，正如我们将要看到的，他的分析过于依赖于一种特殊的“数字市场从根本上不同”的论点，这一论点真的站不住脚。简单地说，我想说他是在诱导他的读者喝太多他的“聚合理论”酷爱，而不是鼓励他们更广泛地思考或更深入地阅读，以理解比他所呈现的稍微混乱的现实。\n我欣赏吴的文章，无论是它的细节(我不同意)，它的目的(隐含的)，它的手段(我重视)。该喝点酷爱饮料了！\n根据汤普森的说法，谷歌的案例需要主要通过他所说的聚合理论来理解，这是经济学家所说的双边市场理论的某种专门版本。他的理论认为，1)用户体验的质量，而不是对分销的控制，决定了数字市场的赢家；2)基于质量的领先是自我强化的，因为要么吸引了更多的供应商，要么客户更多的赢家获得了更多关于如何创造更好产品的反馈。(对于那些有经济学背景的人来说，汤普森的聚合理论基本上是一个双边市场理论和一些正反馈循环的混合体。)。汤普森说，“聚合器”(如果不是技术上的平台，也是经济上的平台)在这方面与传统的垄断者不同，因为他们“通过为消费者制造更好的产品来取胜”…。\n问题是，他的聚合理论并不是令人向往的。相反，它是对互联网如何“从根本上改变了竞争层面”的描述，在这个世界里，“互联网上的一切都只是零边际比特”。它还假设：“零分销成本。零边际成本。零交易。“。在某些方面，这就像20世纪60年代的旧经济模型，只是它们至少被标榜为模型，而不是对现实的描绘。\n吴在他的声明中似乎是认真的，他说，关于零边际成本重要性的断言，最好通过回顾过去来理解；他对聚集理论的类比可以追溯到20世纪20年代：\n以下是我对聚合理论的支持：想象一下，现在是20世纪20年代，我们在谈论品牌广告的发明，有人说，“哪个品牌吸引的人最多，它就会引起轰动，进一步有利于赢家。因此，传统的竞争指标已不复存在。我想我们都同意品牌很重要，事实上，强大品牌的发明确实改变了竞争。但认为竞争实际上已经永远改变可能有点太容易了。我们可以看到汤普森通过断言“互联网使交易成本为零”这样的话落入了新颖性陷阱--这句话会让任何严肃的经济学家哈哈大笑。\n我不能代表严肃的经济学家说话--我总体上很享受与他们的互动，在提出聚合理论的想法时，我得到的只有尊重--但这里唯一让我觉得幽默的是，互联网并没有对交易成本产生巨大影响。\n考虑一下双边市场的各种迭代，吴认为，我称之为聚合器的公司并不是特别特别的版本。在最基本的层面上，你可能有一个类似于邻里跳蚤市场的东西：市场的一边是人们卖东西的地方，另一边是买东西的地方。不过，最终，每一笔交易都需要采购供应、获取客户，并执行交易本身。这三项活动的成本都很高。\n在20世纪的过程中，越来越大的公司在管理这些交易成本方面变得越来越有效率。大大西洋太平洋茶叶公司(Great Atlantic&amp；Pacific Tea Company，俗称A&P)就是最好的例子。该公司在19世纪末迅速扩张，这对获得越来越多的客户至关重要(该公司也是做广告和利用精选商品的低价吸引顾客的先驱)；与此同时，A&P建立了一个后端业务来配合，垂直整合为批发商，特别是自己的自有品牌商品，再加上A&P的规模，帮助它实现了这些低价。到1930年，该公司拥有1.6万家门店，销售额接近30亿美元，占全国杂货店份额的10%。\n到1950年，A&P的市场份额达到了15%的顶峰，尽管那时A&P已经过渡到更少、更大的门店(约4500家)；该公司还面临着一场反垄断诉讼，最终将以一项有利的同意法令达成和解。然而，最终注定A&P失败的是，它无法适应日益被电视广告中的民族品牌主导的食品杂货市场，以及缺乏竞争力的劳动力成本，以及未能从市中心扩张到爆炸性的郊区。每一项都会带来更高的交易成本，A&P无法承受。\n几十年后，就主导地位而言，沃尔玛将追随A&P的脚步，尽管他们的战略始于远郊和郊区，并起到了倒退的作用；不过，需要开设门店来获得客户，建立物流网络来大规模采购和分销商品，以及实际进货和结账的基本限制仍然存在。沃尔玛的市场占有率也达到了15%左右(尽管是在一个更大的杂货市场)。\n与此同时，亚马逊利用互联网大幅降低了客户获取成本：推动这家零售商的基本洞察力是，在互联网上，货架空间是无限的，任何有互联网连接的人都可以使用；该公司的规模仍然小于沃尔玛-去年占普通商品的5%，尽管这个数字肯定因为大流行而大幅跃升-但它实现的速度要快得多：亚马逊只有26岁，而沃尔玛已经58岁了。\n危险在于：如果你认为竞争就是味道和喧嚣(在19世纪90年代)，或者汤普森的聚合理论(现在)，你可能最终会忽视所有其他也可能带来持久优势的战略和因素。以亚马逊为例。汤普森说，“互联网使(数字产品)的分销变得免费。”但是，正如所暗示的那样，这并没有使实物商品的分发变得免费。这就是为什么像亚马逊这样的公司能够，而且已经通过建立大型实体基础设施(仓库)获得了重大优势，这与20世纪的钢铁生产商没有什么不同，并强烈依赖忠诚度计划(Prime)。因此，亚马逊的竞争优势并不完全在于“在互联网上，一切都是零边际的。”\n我完全同意；这就是为什么我声明-反驳吴的断言-亚马逊不是一个聚合器。我在2017年的定义聚合器中特别提到了亚马逊：1。\n聚合器拥有以下所有三个特征：缺少其中任何一个都可能导致非常成功的业务(就苹果而言，可以说是历史上最成功的业务)，但这意味着该公司不是聚合器。\n这一点是直截了当的，但其他一切都依赖于此：聚合器与用户有直接的关系。这可能是一种基于支付的关系，一种基于账户的关系，或者简单地基于常规使用的关系(想想Google和未登录的用户)。\n传统上，当涉及到直接为用户/客户服务时，公司不得不招致(最多)三种类型的边际成本。\n商品销售成本(COGS)，即生产一件物品或提供一项服务的成本。\n分销成本，即将商品送到客户手中(通常通过零售)或促进提供服务(通常通过房地产)的成本。\n交易成本，即为商品或服务执行交易、提供客户服务等的成本。\n聚合器“销售”的商品是数字化的，因此边际成本为零(当然，它们可能具有显著的固定成本)2。\n这一特征意味着，像苹果硬件和亚马逊传统零售业务这样的企业都不是聚合器；两者都承担着为边缘客户服务的巨大成本(尤其是亚马逊，它们的规模如此之大，以至于服务的相对分销成本实际上只是一条护城河)。\n因为聚合器与数字产品打交道，所以有大量的供应；这意味着用户通过发现和管理获得价值，而大多数聚合器都是从提供卓越的发现开始的。\n然后，一旦聚合器获得了一定数量的最终用户，供应商将按照聚合器的条件进入聚合器的平台，有效地将自己商品化和模块化。然后，这些额外的供应商会使聚合器对更多的用户更具吸引力，从而在良性循环中吸引更多的供应商。\n这意味着，对于聚合器来说，客户获取成本会随着时间的推移而降低；边缘客户会因供应商数量的增加而被吸引到平台。这进一步意味着，聚合器享有赢家通吃的效应：由于聚合器对终端用户的价值不断增加，竞争对手要夺走用户或赢得新用户极其困难。\n这与非聚合器和非平台公司形成鲜明对比，这些公司面临着随着用户基础的增长而面临不断增加的客户获取成本。这是因为最初的客户通常是完美的产品市场匹配度；然而，随着匹配度的降低，产品的剩余价值也会减少，并迅速转为负值。一般来说，任何在内部创造客户价值的企业都不是聚合器，因为最终其客户获取成本将限制其增长潜力。\n谷歌是这一定义的典范，与亚马逊的区别是深远的，更不用说非互联网的双边市场了。从交易成本开始：虽然扩展互联网服务是一件非常困难的事情，需要极大的独创性、创造性和投资，但为多一个客户提供服务的边际交易成本为零。这就是为什么谷歌，从它推出的那一刻起，就可以被世界上的任何人使用。与亚马逊一样，该公司不需要建设实体店，但与亚马逊不同的是，该公司也不需要建设配送基础设施。而且，与现有的所有零售商不同，它不需要为供应付费。而且--这是使谷歌真正独一无二的部分--它甚至不需要产生供应。网络已经存在了！\n这就是为什么谷歌可以在美国搜索市场获得88%的市场份额(根据司法部的诉讼)，并在整个世界实现类似的份额水平。该公司的可扩展性实际上是无限的，因为服务额外的客户是固定成本的函数，而不是交易成本的函数；在这方面，正如两家公司各自的市场份额所表明的那样，它真的根本无法与亚马逊相提并论。\n同样的现实也适用于谷歌的边际成本(包括分销)；虽然谷歌在其数据中心和网络上花费了大量的固定成本，但任何一次搜索都是“免费的”，包括谷歌接受搜索词，计算结果，并将其交付给用户。此外，同样的原则也适用于谷歌的广告业务：谷歌上的绝大多数广告都是通过自助门户网站获得的，这些门户网站通过实时拍卖自动为广告定价。是的，实现这项业务所需的基础设施需要大量投资，但任何一次特定广告购买的唯一交易成本都是信用卡费用。\n这是一项需要更多分析的业务，而不是称之为“双边市场…”加上一些正反馈循环的东西“；首先，我认为所有的双边市场都有正反馈循环。然而，任何触及实体世界的市场，都会在一路上积累越来越多的微小成本，无论是劳动力成本、运输成本、租金成本等；此外，管理这些成本所带来的物流挑战本身也会招致管理复杂性的成本，而克服这些挑战的每一项投资都会成为沉没成本，使其难以在市场变化时进行调整(这一点尤其严重，因为进行这些投资需要时间)。\n另一方面，谷歌没有面临这些规模上的自然拖累。更多的搜索意味着更好的搜索，这要归功于数十亿用户对每个谷歌搜索结果的持续反馈(通过点击最好的结果)；出于同样的原因，更多的广告商意味着更好的广告结果。这对反垄断非常重要，因为在某种程度上，你需要一个危害理论：谷歌到底是如何让用户或广告商的情况变得更糟的？\n不管这是不是他理论的核心，汤普森也对转换成本采取了一种高度反经验的方法。他赞同20世纪90年代的老观点，即“竞争只需点击一次”，这在1999年可能是正确的，但现在不能当真-如果他的意思是离开谷歌、亚马逊或Facebook的成本接近于零。真正的问题是，对于普通人来说，从Facebook或Google转而使用其他东西-离开Gmail、朋友等等-是否有成本。断言这些成本接近于零是一种神奇的想法。事实上，谷歌近十年来最重要的战略之一--Tell--就是增加那些转换成本，那些进入壁垒。\n具体来看谷歌：该公司的核心产品搜索为其提供了开放的网络。事实上，这就是让公司立即规模化的原因，这是其他公司从未有过的。因此，所有其他搜索引擎--包括必应(Bing)、DuckDuckGo等--都可以获得完全相同的资源。\n诚然，谷歌确实有自己的本地搜索结果；Yelp有整个网站都在抱怨这一事实，认为应该强制搜索引擎在其本地搜索结果中包括第三方内容，因为这些结果对消费者更有利。然而，这对竞争对手来说是一个有利的标志：吴的立场是不是锁定了谷歌所谓的劣质本地搜索结果？\n与此同时，我对提到Gmail感到困惑；我不清楚为什么用户选择使用显然锁定在服务提供商手中的免费电子邮件服务会引起竞争担忧。这里的相关市场不是Gmail，而是电子邮件，不仅托管电子邮件的竞争非常激烈，而且设置自己的电子邮件服务器也相当简单。最重要的是，谷歌绝对无法阻止你这么做，即使他们想这样做。\n这就是为什么我认为“聚合器”的明确定义很重要的最大原因；虽然吴随意地将聚合器和平台混为一谈(“如果不是在经济上，如果不是在技术上的话”)，我认为这两者之间的区别是实质性的，也是至关重要的。我在“规范互联网竞争的框架”一书中详细探讨了这一区别，但关键还是回到了电子邮件的例子上：\n平台对它们的价值链至关重要。例如，如果没有Windows API，你就不能拥有Windows应用程序。\n相比之下，聚合器不是必需的，但它们很方便。你可以直接进入一个网站--只需输入它的URL--但是对于大多数消费者来说，对于大多数信息来说，搜索要容易得多。\n许多谷歌最热心的批评者吸引人的是，他们自己都渴望成为聚合者。例如，Yelp没有在当地经营任何业务。它不做饭，不理发，也不授课：它的商业模式是聚集如此多的用户，以至于当地企业觉得有必要加入Yelp，这样就比他们自己更好地接触到更多的客户。这同样适用于Trip Advisor或Expedia，或任何其他垂直搜索公司。所有这些网站只需点击一下即可。\n而且，至关重要的是，实际提供用户正在寻找的服务或信息的实体也是如此。例如，航空公司和酒店在忠诚度计划上投入了大量资金，因为他们希望最好的客户直接找到他们，而不是通过聚合器，无论这个聚合器是谷歌还是Booking.com。这不仅听起来像是竞争，而且听起来也是一个对客户非常友好的结果。\n我认为吴和许多科技评论家的错误之处在于错过了零边际成本和零转换成本的问题是如何相交的。首先，因为吴不相信谷歌在可伸缩性方面是独一无二的，他似乎认为该公司一定是在做一些邪恶的事情来夺取这样的市场份额。而且，出于同样的原因，肯定存在某种不公平的锁定，因为同样，公司不应该如此占据主导地位。这肯定是懒惰争论的秘诀，最终会将商业基础定为刑事犯罪。\n这一切与反垄断有何关系？反垄断应该处理的是市场中反竞争行为的现实，而不是公司如何运作的理想。法律很难确定刚才描述的这些持久优势中哪些是公平竞争的一部分(例如，更好的用户体验)，哪些不是(例如，收购危险的竞争对手，或将竞争对手拒之门外的排他性交易)…。\n我们可以这样总结汤普森的问题：为什么谷歌向苹果支付数十亿美元来获得发行权的控制权？为什么，为了将法律纳入其中，谷歌还没有了结这起案件？如果聚合理论是正确的-如果数字市场的竞争已经改变，最好的用户体验获胜-那么谷歌就不需要花费这笔钱。\n老实说，我不认为这太复杂：违约确实很重要，考虑到谷歌为每个美国用户赚取的收入超过250美元的事实，分享其中的一些收入是非常值得的，以确保它获得尽可能多的用户。具体考虑IOS：\n根据司法部(Department Of Justice)的说法，“这项协议覆盖了美国大约36%的一般搜索查询”；假设搜索查询的份额与收入份额一致(考虑到苹果用户群的相对购买力，几乎可以肯定不是这样)，该协议涵盖价值269亿美元的收入。\n进一步假设，如果谷歌不是默认的，该公司将失去25%的苹果设备搜索，否则它可能会获得；这相当于仅在美国就损失了67亿美元的收入，再一次，考虑到苹果用户的相对购买力，这个数字几乎肯定是保守的。\n此外，这些搜索将流向谷歌的竞争对手，不仅提供有价值的数据，帮助他们的搜索引擎变得更好，而且还提高了他们的广告产品的效率和相对吸引力。我仍然相信谷歌会继续\n.", "note_en": "Tim Wu has a new piece up on Medium called  Ben Thompson’s “Stratechery”; the subtitle, I think, is more descriptive of Wu’s premise:\n   Thompson has more recently begun to pronounce and analyze in the field of tech antitrust, and here he is on less solid ground. I appreciate that deep industry expertise is important in his area, especially, say, when designing remedies that make sense. Lacking a background in law or economics is not disqualifying. Nonetheless, I’d say Thompson’s readers are at risk of being misled if they rely too much on what he has to say about tech antitrust. For, as we shall see, his analysis relies too much on an idiosyncratic “digital markets are fundamentally different” thesis that really doesn’t hold up too well. Stated simply, I’d say he’s inducing his readers to drink too much of his “aggregation theory” Kool-Aid, as opposed to encouraging them to think more broadly or read more deeply to understand a slightly messier reality than he presents.\n I appreciate Wu’s article, both in terms of its specifics (which I disagree with), its goals (which are implied), and its means (which I value). Time to drink some Kool-Aid!\n     According to Thompson, the Google case needs be understood primarily through what he calls aggregation theory, which is something of a specialized version of what economists call a two-sided markets theory. His theory asserts that 1) the quality of the user experience, rather than control over distribution, is what determines the winners in digital markets; and 2) a lead based on quality is self-reenforcing, because either more suppliers are attracted or the winner, with more customers, gets more feedback on what makes for a better product. (For those with a background in economics, Thompson’s aggregation theory is basically a mixture of a two-sided market theory with some positive feedback loop stuff thrown in.) Thompson says that “aggregators” (platforms, in economic, if not technological, parlance) are in this manner different than traditional monopolists, for they “win by building ever better products for consumers”…\n The problem is that his aggregation theory isn’t aspirational. Instead, it is presented as a description of how the internet has “fundamentally changed the plane of competition” in a world where “on the internet everything is just zero marginal bits.” It also takes as its assumptions: “Zero distribution costs. Zero marginal costs. Zero transactions.” In that, in some ways, it is like the older economic models from the 1960s, except that they were at least billed as models, not depictions of reality.\n Wu appears to be serious in his statement that assertions about the importance of zero marginal costs are best understood by looking to the past; his analogy for Aggregation Theory reaches back to the 1920s:\n Here’s my send-up of aggregation theory: Imagine this is the 1920s and we were speaking of the invention of brand advertising, and someone says, “whichever brand has the most people attracting it will create a buzz that further favors the winner. Hence, traditional metrics of competition are out the window.” I think we’d all agree that brand matters, and indeed the invention of powerful brands did change competition. But it might be a little too easy to think competition actually has changed forever. And we can see Thompson falling into the novelty trap by asserting things like “the internet has made transaction costs zero” — a sentence that would make any serious economist howl with laughter.\n I can’t speak for serious economists — I’ve generally enjoyed my interactions with them, and have been treated with nothing but respect while presenting the idea of  Aggregation Theory — but the only thing I find humorous here is the idea that the Internet has  not had a massive impact on transactions costs.\n  Consider various iterations of two-sided markets, of which Wu believes the companies I call Aggregators are a not particularly special version of. At the most basic level you might have something like a neighborhood flea market: on one side the market is a place for people to sell things, and on the other a place to buy things. Ultimately, though, every transaction entails sourcing supply, acquiring a customer, and executing the transaction itself. All three of those activities are costly.\n Over the course of the 20th century, larger and larger firms became more and more efficient at managing these transaction costs. The Great Atlantic &amp; Pacific Tea Company, more commonly known as A&amp;P, was the best example of this. The company expanded rapidly in the late 1800s, which was critical in acquiring ever more customers (the company was also a pioneer in advertising and using low prices on select items to get customers into stores); meanwhile, A&amp;P built a back-end operation to match, vertically integrating into being a wholesaler, particularly of its own private label goods, which, combined with A&amp;Ps scale, helped it deliver on those low prices. By 1930 the company had 16,000 stores doing nearly $3 billion in sales, accounting for a 10% share of nationwide grocery stores.\n By 1950 A&amp;P’s market share peaked at 15%, although by that time A&amp;P had transitioned to fewer, larger stores (around 4,500); the company was also facing an antitrust lawsuit, that it would eventually settle with a favorable consent decree. What ultimately doomed A&amp;P, though, was its inability to adjust to a grocery market increasingly dominated by national brands advertised on television, along with uncompetitive labor costs and a failure to expand from city centers to the exploding suburbs. Each of these entailed higher transaction costs, and A&amp;P couldn’t bear them.\n A few decades later Walmart would follow in A&amp;P’s footsteps as far as dominance is concerned, although their strategy started with exurbs and suburbs and worked backwards; the fundamental limitations of needing to open stores to acquire customers, build out logistical networks to acquire and distribute goods at scale, and actually stock shelves and check out customers remained, though. Walmart too has reached about 15% market share (albeit of a larger general merchandise market).\n Amazon, meanwhile, has leveraged the Internet to dramatically decrease its customer acquisition costs in particular: the fundamental insight driving the retailer is that on the Internet shelf space is both infinite and available to anyone with an Internet connection; the company is still smaller than Walmart — 5% of general merchandise last year, although that number surely made a huge leap because of the pandemic — but it got there much more quickly: Amazon is only 26 years old, while Walmart is 58.\n  Here is the danger: If you think competition is all about flavor and buzz (in the 1890s) or Thompson’s aggregation theory (right now), you might end up overlooking all of the other strategies and factors that could also lead to a lasting advantage. Consider Amazon. Thompson says that “the internet has made distribution (of digital goods) free.” But, as implied, that hasn’t made the distribution of physical goods free. And that is why a company like Amazon can, and has, gained a major advantage by building up a large physical infrastructure (warehouses), not unlike a steel producer in the 20th century, and strongly relying on a loyalty program (Prime). So, it turns out Amazon’s competitive advantage isn’t all about the fact that “on the internet everything is just zero marginal bits.”\n I completely agree; that’s why I have stated — contra Wu’s assertion — that Amazon is  not an Aggregator. I mentioned Amazon specifically in 2017’s  Defining Aggregators: 1\n Aggregators have all three of the following characteristics; the absence of any one of them can result in a very successful business (in the case of Apple, arguably the most successful business in history), but it means said company is not an Aggregator.\n  This point is straight-forward, yet the linchpin on which everything else rests: Aggregators have a direct relationship with users. This may be a payment-based relationship, an account-based one, or simply one based on regular usage (think Google and non-logged in users).\n  Companies traditionally have had to incur (up to) three types of marginal costs when it comes to serving users/customers directly.\n The cost of goods sold (COGS), that is, the cost of producing an item or providing a service\n Distribution costs, that is the cost of getting an item to the customer (usually via retail) or facilitating the provision of a service (usually via real estate)\n Transaction costs, that is the cost of executing a transaction for a good or service, providing customer service, etc.\n  The goods “sold” by an Aggregator are digital and thus have zero marginal costs (they may, of course, have significant fixed costs) 2\n This characteristic means that businesses like Apple hardware and Amazon’s traditional retail operations are not Aggregators; both bear significant costs in serving the marginal customer (and, in the case of Amazon in particular, have achieved such scale that the service’s relative cost of distribution is actually a moat).\n  Because Aggregators deal with digital goods, there is an abundance of supply; that means users reap value through discovery and curation, and most aggregators get started by delivering superior discovery.\n Then, once an Aggregator has gained some number of end users, suppliers will come onto the Aggregator’s platform on the Aggregator’s terms, effectively commoditizing and modularizing themselves. Those additional suppliers then make the Aggregator more attractive to more users, which in turn draws more suppliers, in a virtuous cycle.\n This means that for Aggregators, customer acquisition costs decrease over time; marginal customers are attracted to the platform by virtue of the increasing number of suppliers. This further means that Aggregators enjoy winner-take-all effects: since the value of an Aggregator to end users is continually increasing it is exceedingly difficult for competitors to take away users or win new ones.\n This is in contrast to non-Aggregator and non-platform companies that face  increasing customer acquisition costs as their user base grows. That is because initial customers are often a perfect product-market fit; however, as that fit decreases, the surplus value from the product decreases as well and quickly turns negative. Generally speaking, any business that creates its customer value in-house is not an Aggregator because eventually its customer acquisition costs will limit its growth potential.\n Google is the canonical example of this definition, and the difference from Amazon, much less non-Internet two-sided markets, is profound. Start with the transaction costs: while scaling an Internet service is a profoundly difficult thing to do, requiring tremendous ingenuity, invention, and investment, the marginal transaction costs for serving one additional customer are zero. That is why Google, from the moment it launched, could be used by anyone in the world. Like Amazon, the company didn’t need to build out physical stores, but unlike Amazon, the company didn’t need to build out delivery infrastructure either. And unlike every retailer in existence it didn’t need to pay for supply. And — this is the part that makes Google truly unique — it didn’t even need to generate supply. The web already existed!\n This is why Google can achieve 88 percent market share in the U.S. search market (according to the  Department of Justice lawsuit), and achieve a similar level of share all over the entire world. The company’s scalability is effectively infinite, because serving additional customers is a function of fixed costs, not transaction costs; it really is not comparable to Amazon at all, in this regard, as the companies’ respective market shares demonstrates.\n The same reality applies to Google’s marginal costs (including distribution); while Google spends a tremendous amount of fixed costs on its data centers and networking, any one search is “free”, including Google accepting the search term, computing the result, and delivering it to the user. Moreover, this same principle applies to Google’s advertising business: the vast majority of advertising on Google is acquired via self-service portals that price ads automatically via real-time auctions. Yes, the infrastructure necessary to enable this business requires substantial investment, but the only transaction costs on any one specific advertising purchase are credit card fees.\n This is a business that requires more analysis than calling it a “two-sided market…with some positive feedback loop stuff thrown in”; for one, I would argue that  all two-sided markets have positive feedback loops. Any market that touches the physical world, though, accumulates an ever increasing number of tiny costs along the way, whether that be labor costs, shipping costs, rent costs, etc.; moreover, the logistical challenges entailed in managing those costs incur their own cost in managerial complexity, and every investment to overcome those challenges become sunk costs, making it difficult to adjust when the market changes (this is particularly acute because it takes time to make these investments).\n Google, on the other hand, faces none of these natural drags on scale. More search means better search, thanks to the ongoing feedback of billions of users ranking every Google search result (by clicking on the best result); more advertisers means better advertising results, for the same reason. This matters greatly for antitrust because at some point you need a theory of harm: how exactly is Google making things worse for users or advertisers?\n   Whether this is core to his theory or not, Thompson also takes a highly anti-empirical approach to switching costs. He endorses the old 1990s idea that “competition is just one click away,” which may have been true in 1999, but that can’t be taken seriously now — if what he means is that the costs of leaving Google or Amazon or Facebook are close to zero. The real question is whether there are, for the average person, costs to switching from Facebook or Google to use something else — leaving behind Gmail, friends, and so on. The assertion that those costs are near zero is magical thinking. Indeed, one of Google’s most important strategies over this decade — its tell — has been to increase those switching costs, those barriers to entry.\n Consider Google specifically: the company’s core product, Search, has for its supply the open web. Indeed, that is what let the company be at scale, instantly, in a way no other company ever has. It follows, though, that every other search engine — including Bing, DuckDuckGo, etc. — have access to the exact same supply.\n Admittedly, Google does have its own local results in particular; Yelp  has an entire website complaining about this fact, arguing that the search engine should be forced to include third-party content in its local search results because those results are better for consumers. That, though, is a mark in the competition’s favor: is Wu’s position that Google’s allegedly inferior local search results is lock-in?\n Meanwhile, I am puzzled by the reference to Gmail; it is unclear to me why it is a competition concern when a user chooses to use a free email service that is quite obviously locked to the service provider. The relevant market here is not Gmail, it is email, and not only is there a huge amount of competition for hosted email, it is fairly simple to set up your own email server. Critically, there is absolutely nothing Google can do to stop you from doing so, even if they wanted to.\n This drives at the biggest reason why I believe a distinct definition for “Aggregators” is important; while Wu casually conflates Aggregators and platforms (“in economic, if not technological, parlance”), I believe the distinction is substantial, and crucial. I explore that distinction at length in  A Framework for Regulating Competition on the Internet, but the critical point goes back to the email example:\n Platforms are essential to their value chains. You can’t have a Windows app, for example, without the Windows API.\n Aggregators, in contrast, are not essential, but they are convenient. You can go to a website directly — just type in its URL — but for most consumers, for most pieces of information, it is far easier to search.\n What is fascinating about many of Google’s most ardent critics is that they themselves aspire to be Aggregators. Yelp, for example, doesn’t operate any local businesses. It doesn’t prepare the food, or cut the hair, or teach the class: its business model is to aggregate so many users that local businesses feel compelled to be on Yelp, the better to reach more customers than they could on their own. The same applies to Trip Advisor, or Expedia, or any other vertical search company. All of those sites are only a click away.\n And, critically, so are the entities that actually provide the services or information that the user is seeking. Airlines and hotels invest heavily in loyalty programs, for example, because they want their best customers to come to them directly, not via an Aggregator, whether that Aggregator be Google or Booking.com. That not only sounds like competition, it also sounds like an exceptionally customer-friendly outcome.\n  Where I think Wu and many tech critics go wrong is missing how the question of zero marginal costs and zero switching costs intersect. First, because Wu does not believe that Google is unique as far as scalability is concerned, he appears to assume that the company must be doing something nefarious to command such market share. And, by the same token, there must be some sort of unfair lock-in, because again, companies ought not be so dominant. This is a sure recipe for lazy arguments that end up criminalizing the basics of business.\n How does all this relate to antitrust? Antitrust should be dealing with the reality of anticompetitive behavior in markets, not ideals of how companies work. And it is the difficult job of the law to determine which of these durable advantages just described are part of fair competition (for example, a better user experience) and which are not (for example, buying out dangerous rivals, or exclusionary deals that keep out competitors)…\n We may summarize the problem for Thompson this way: Why, exactly, did Google pay Apple billions to gain control over distribution rights? And why, to bring the law into it, hasn’t Google settled the case? If aggregation theory is right — if competition has changed in the digital market and the best user experience wins — then Google doesn’t need to spend that money.\n I honestly don’t think this is too complicated: defaults do matter, and given the fact that Google makes  somewhere north of $250 in revenue per U.S. user it is well worth sharing some of that revenue to ensure it gets as many users as possible. Consider iOS specifically:\n According to the Department of Justice “This agreement covers roughly 36 percent of all general search queries in the United States”; assuming that share of search queries is inline with share of revenue (which is almost certainly  not the case, given the relative spending power of Apple’s userbase), the agreement covers $26.9 billion worth of revenue.\n Further assume that, were Google not the default, the company would lose 25% of Apple device searches it might have gained otherwise; this equates to a revenue loss of $6.7 billion for the U.S. alone, and again, this number is almost certainly conservative given the relative spending power of Apple users.\n Moreover, those searches would go to Google’s competitors, not only giving valuable data that would help make their search engines better, but also increasing the efficiency and relative attractiveness of their ad products. I do still believe that Google would continue to w\n......", "posttime": "2020-11-03 23:49:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "互联网,internet,成本", "title": "互联网有什么不同吗？", "title_en": "Is the Internet Different?", "transed": 1, "url": "https://stratechery.com/2020/is-the-internet-different/", "via": "", "real_tags": ["互联网", "internet", "成本"]}, {"category": "", "categoryclass": "", "imagename": "f4025b8ea3e2247e9a42661ae319e839.jpg", "infoid": 1032988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个“重大的，如果是真的”故事之一。9月份，科学家们报告说，金星的大气层似乎含有磷化氢，这可能是生命的迹象。\n现在越来越多的人强调“如果”。随着科学家们重新审视金星声明背后的数据，并将其他数据集添加到混合数据中，最初关于磷化氢含量不明的说法受到了质疑。许多科学家说，这是一件好事。\n北卡罗来纳州立大学罗利分校的行星科学家保罗·伯恩(Paul Byrne)说：“这正是科学应该如何运作的。”他研究金星，但没有参与任何磷化氢论文。“现在就说这次探测对金星意味着什么还为时过早。”\n下面我们来仔细看看从“如果”到“真”所做的努力：\n9月14日，威尔士加的夫大学的天文学家简·格里夫斯(Jane Greaves)和他的同事报告说，他们使用两台不同的望远镜(SN：9/14/20)在金星的云层中看到了磷化氢的迹象。磷化氢似乎太丰富了，如果没有某种来源的补充，它就不可能存在。研究小组说，那个来源可能是生活在云中的奇怪的微生物，或者是一些奇怪的未知的金星化学物质。\n格里夫斯和他的同事首先在夏威夷用詹姆斯·克莱克·麦克斯韦望远镜发现了磷化氢，随后又在智利用强大的ALMA望远镜阵列发现了磷化氢。但ALMA的这些数据，特别是它们的处理方式，现在正受到质疑。\n关键的金星观测是光谱，也就是来自金星的一系列波长的光的曲线图。不同的分子阻挡或吸收特定波长的光，因此搜索光谱中的凹陷可以揭示行星大气中的化学物质。\n磷化氢在金星的光谱中出现了大约1.12毫米的凹陷，这个波长的光被认为是金星分子正在吸收的。如果金星的光谱可以画成一条横跨所有波长的直线，磷化氢就会在那个波长上形成一个很深的山谷。\n但真正的数据从来都不是那么容易读懂的。在现实生活中，其他来源--从地球大气层到望远镜本身的内部工作原理--会给这条优美的直线带来抖动或“噪音”。摆动越大，科学家们就越不相信这些下沉代表了有趣的分子。相反，任何特定的下跌可能只是一个随机的、超大的摆动。\n马里兰州格林贝尔特的NASA戈达德太空飞行中心的天体化学家马丁·卡迪纳说，当用ALMA这样的强力望远镜观察像金星这样明亮的物体时，这个问题会变得更加严重。科迪纳使用ALMA观测太阳系中的其他物体，如土星的卫星泰坦，但没有参与金星的工作。\n卡迪纳说：“这些凸起和摆动之所以出现在这里，是因为金星固有的亮度，这使得我们很难获得可靠的测量结果。”“你可以把它想象成被强光照得眼花缭乱：如果你的视野里有一道强光，那么你挑出较模糊细节的能力就会减弱。”\n所以天文学家们做了几件不同的事情来平滑数据，让真实的信号照亮。一种策略是写一个方程式来描述噪音引起的摆动。然后，科学家可以从数据中减去这个方程，以突出他们感兴趣的信号，就像模糊照片的背景，让肖像主题弹出一样。这是标准做法，卡迪纳说。\n但也有可能写出一个与噪声拟合得太好的方程式。可以使用的最简单的方程就是一条直线，也称为一阶多项式，用方程y=mx+b来描述。二阶多项式加上一项x的平方，三阶加上x的立方，依此类推。\nGreaves和他的同事使用一个12阶多项式，或一个有12个项的方程(加上一个常数，方程中的+b)来描述他们ALMA数据中的噪声。\n“这是一个危险信号，需要更详细地研究这一点，多项式拟合的结果可能是不可信的，”卡迪纳说，“这是一个危险信号，需要更详细地研究，而且多项式拟合的结果可能是不可信的。”一直到12的幂可能意味着研究人员减去比真正随机的噪音更多的噪音，让他们在数据中找到并不真正存在的东西。\n荷兰莱顿大学的天体物理学家伊格纳斯·斯内伦(Ignas Snellen)和他的同事们将同样的降噪配方重新应用于金星上的ALMA数据，并在10月19日发表在arxiv.org上的一篇论文中报告说，为了看看研究人员是否对他们的多项式拟合有点热衷，他们没有发现统计上显著的磷化氢迹象。\n然后，研究人员在金星光谱的其他部分尝试了同样的噪音过滤，在那里不应该发现有趣的分子。他们发现了五种不同的分子信号，但实际上并不存在。\n“我们的分析…。研究表明，至少可以用他们的方法获得少数虚假特征，因此[我们]得出结论，目前的分析没有为推断金星大气层中存在[磷化氢]提供坚实的基础。“该团队写道：”他们的方法至少可以获得少数虚假特征，因此[我们]得出结论，目前的分析没有为推断金星大气中存在[磷化氢]提供坚实的基础。\n与此同时，根据欧洲南方天文台(European Southern Observatory)的一份声明，ALMA的科学家在用于检测磷化氢的数据中发现了一个单独的、未指明的问题，并将这些数据从天文台的公共档案中删除，以进行仔细检查和重新处理。ALMA是该机构的一部分。\n“这种情况并不经常发生，”德国Garching的ESO ALMA区域中心的Martin Zwaan说，但这并不是第一次。当发现问题时，重新处理数据是标准做法。“在许多情况下，它不会对科学结果产生重大影响，”Zwaan说。“就金星上的磷化氢而言，这个(结果)还没有确定。”\n在科学家等待的同时，他们能做些什么呢？确认磷化氢的最好方法之一是在金星光谱中看到不同波长的等效信号。不幸的是，那里的消息也不是很好。在“天文学与天体物理学”杂志上发表的一篇论文中，巴黎天文台的天文学家Thérèse Encrenaz和他的同事(包括Greaves和其他一些原始论文的作者)研究了夏威夷运行的名为Texes的红外光谱仪的存档数据。这些观测可能在金星的云顶发现了磷化氢，这是比ALMA所能看到的更低的天空部分。\n在最初的论文发表之前，格里夫斯和他的同事曾与恩克雷纳兹接洽，希望在红外波长寻找磷化氢，但这些观测因新冠肺炎的大流行而被取消。因此，Encrenaz查看了她在2012年至2015年收集的数据-没有发现任何东西。\n“在云顶的水平上，根本没有[磷化氢]，”Encrenaz说。这并不一定意味着天空中没有磷化氢--只是没有明确的解释说明它是如何到达那里的。“简·格里夫斯的论文中的推理是磷化氢来自云层，”Encrenaz说。“所以问题很大。”\n金星的磷化氢仍然有办法度过难关。例如，如果它随时间变化，它可能会出现在天文学家观察的某些时间，而不是其他时间。然而，卡迪纳说，现在援引这种情况还为时过早。“如果信号不在那里，谈论它的时间变异性就没有意义了。”\n但马萨诸塞州剑桥市哈佛-史密森天体物理中心的天体化学家克拉拉·索萨-席尔瓦(Clara Sousa-Silva)说，这不是一场危机。她也是最初论文的合著者之一。她在一封电子邮件中写道，其他小组对这一发现提出质疑“完全正常，我预期(不，希望)会发生的事情会发生。”“这通常是我喜欢的项目的一个阶段，我希望人们能意识到这就是科学的样子。”\n美国宇航局金星探索分析小组成员伯恩说，所有这一切中的一线希望是，它让人们对金星感到兴奋。\n他说：“这些论文提供了很大的价值，并对这些非凡的主张进行了必要的评估。”“如果没有别的，那就是它揭示了我们对金星的了解是多么的少。”而我们得到这些答案的唯一方法就是去金星。“。\nI.A.G.斯内伦等人。对金星267 GHz ALMA观测的重新分析：没有统计意义的磷化氢检测。Arxiv：2010.09761。发布于2020年10月19日。\nT.Encrenaz等人。金星云顶PH3丰度的严格上限。“天文学与天体物理学”，出版社，2020年。DOI：10.1051/00046361/202039559", "note_en": "It was one of those “big, if true” stories. In September, scientists reported that Venus’ atmosphere seems to be laced with phosphine, a possible sign of life.\n Now there’s increasing emphasis on the “if.” As scientists take fresh looks at the data behind the Venus announcement, and add other datasets to the mix, the original claim of inexplicable amounts of phosphine is being called into doubt. And that’s a good thing, many scientists say.\n “It’s exactly how science should work,” says planetary scientist Paul Byrne of North Carolina State University in Raleigh, who studies Venus but was not involved in any of the phosphine papers. “It’s too early to say one way or the other what this detection means for Venus.”\n Here’s a closer look at efforts to get from “if” to “true:”\n  On September 14, astronomer Jane Greaves of Cardiff University in Wales and colleagues reported that they had seen  signs of phosphine in Venus’ clouds using two different telescopes ( SN: 9/14/20). The phosphine seemed to be too abundant to exist without some kind of source replenishing it. That source could be strange microbes living in the clouds, or some weird unknown Venusian chemistry, the team said.\n Greaves and colleagues first spotted phosphine with the James Clerk Maxwell Telescope in Hawaii and followed up with the powerful ALMA telescope array in Chile. But those ALMA data, and particularly the way they were handled, are now being called into question.\n   The key Venus observations were spectra, or plots of the light coming from the planet in a range of wavelengths. Different molecules block or absorb light at specific wavelengths, so searching for dips in a spectrum can reveal the chemicals in a planet’s atmosphere.\n Phosphine showed up as a dip in Venus’ spectrum at about 1.12 millimeters, a wavelength of light that the molecule was thought to be absorbing. If Venus’ spectrum could be drawn as a straight line across all wavelengths of light, phosphine would make a deep valley at that wavelength.\n But real data are never that easy to read. In real life, other sources — from Earth’s atmosphere to the inner workings of the telescope itself — introduce wiggles, or “noise,” into that nice straight line. The bigger the wiggles, the less scientists believe that the dips represent interesting molecules. Any particular dip might instead be just a random, extra-large wiggle.\n That problem gets even worse when looking at a bright object such as Venus with a powerful telescope like ALMA, says Martin Cordiner, an astrochemist at NASA’s Goddard Space Flight Center in Greenbelt, Md. Cordiner uses ALMA to observe other objects in the solar system, like Saturn’s moon Titan, but was not involved in the Venus work.\n “The reason those bumps and wiggles are here at all is because of the intrinsic brightness of Venus, which makes it difficult to get a reliable measurement,” Cordiner says. “You could think of it as being dazzled by a bright light: If there’s a bright light in your vision, then your ability to pick out fainter details becomes diminished.”\n So astronomers do a few different things to smooth out the data and let real signals shine through. One strategy is to write an equation that describes the wiggles caused by the noise. Scientists can then subtract that equation from the data to highlight the signal they’re interested in, like fuzzing out the background of a photo to let a portrait subject pop. That’s a standard practice, says Cordiner.\n But it’s possible to write an equation that fits the noise too well. The simplest equation one could use is just a straight line, also known as a first-order polynomial, described by the equation  y=mx+b. A second-order polynomial adds a term with  x squared, third-order with  x cubed, and so on.\n Greaves and colleagues used a twelfth-order polynomial, or an equation with twelve terms (plus a constant, the  +b in the equation), to describe the noise in their ALMA data.\n “That was a red flag that this needed to be looked at in more detail, and that the results of that polynomial fitting could be untrustworthy,” says Cordiner. Going all the way out to the power of 12 could mean a researcher subtracts more noise than is truly random, allowing them to find things in the data that aren’t really there.\n To see if the researchers were a little overzealous in their polynomial fitting, astrophysicist Ignas Snellen, of Leiden University in the Netherlands, and colleagues reapplied the same noise reduction recipe to the ALMA data on Venus and  found no statistically significant sign of phosphine, they report in a paper posted at arXiv.org on October 19.\n Then the researchers tried the same noise filtering on other parts of Venus’ spectrum, where no interesting molecules should be found. They found five different signals of molecules that aren’t really there.\n “Our analysis … shows that at least a handful of spurious features can be obtained with their method, and therefore [we] conclude that the presented analysis does not provide a solid basis to infer the presence of [phosphine] in the Venus atmosphere,” the team wrote.\n   Meanwhile, scientists at ALMA discovered a separate, unspecified issue in the data that were used to detect the phosphine and took those data off the observatory’s public archive to scrutinize and reprocess, according to a statement from the European Southern Observatory, of which ALMA is a part.\n “This does not happen very often,” says Martin Zwaan of the ESO ALMA Regional Center in Garching, Germany, but this isn’t a first. When issues are discovered, it is standard practice to reprocess the data. “In many cases, it does not affect the science outcome significantly,” Zwaan says. “In the case of the phosphine on Venus, this [outcome] has not been established yet.”\n What can scientists do while they wait? One of the best ways to confirm the phosphine is to see an equivalent signal at a different wavelength in Venus’ spectrum. Unfortunately,  the news isn’t great there either. In a paper to appear in  Astronomy &amp; Astrophysics, astronomer Thérèse Encrenaz of the Paris Observatory and colleagues (including Greaves and some other authors of the original paper) looked at archived data from an infrared spectrograph called TEXES that operates in Hawaii. Those observations could have spotted phosphine in Venus’ cloud tops, a lower part of the sky than what ALMA could see.\n Greaves and colleagues had approached Encrenaz to look for phosphine in infrared wavelengths before the original paper came out, but those observations were cancelled by the COVID-19 pandemic. So Encrenaz looked through data she had collected between 2012 and 2015 — and found nothing.\n “At the level of the cloud tops, there is no [phosphine] at all,” Encrenaz says. That doesn’t necessarily mean there’s no phosphine higher up in the sky — there’s just no clear explanation for how it would get there. “The reasoning in the paper by Jane Greaves was that phosphine was coming from the clouds,” Encrenaz says. “So there is a big problem.”\n  There are still ways for Venus’ phosphine to pull through. If it varies with time, for instance, it might be there some of the times that astronomers look and not at others. It’s too early to invoke that scenario, though, Cordiner says. “There’s no point of talking about the time variability of a signal if it isn’t there.”\n But this is not a crisis, says Clara Sousa-Silva, an astrochemist at the Harvard-Smithsonian Center for Astrophysics in Cambridge, Mass., and a coauthor of the original paper. Other groups challenging the finding “is completely normal and what I expected (nay, hoped) would happen,” she wrote in an e-mail. “This is usually a phase of a project that I enjoy, and I am hoping people will realize this is just what science looks like.”\n The silver lining in all of this is that it’s gotten people excited about Venus, says Byrne, who is a member of NASA’s Venus Exploration Analysis Group.\n “These papers provide much value and a needed assessment of these extraordinary claims,” he says. “If nothing else, it has shone a light on just how little we understand about Venus. And the only way we get those answers is if we go to Venus.”\n   I.A.G. Snellen et al.  Re-analysis of the 267-GHz ALMA observations of Venus: No statistically significant detection of phosphine. arXiv:2010.09761. Posted October 19, 2020.\n  T. Encrenaz et al.  A stringent upper limit on the PH 3 abundance at the cloud top of Venus.  Astronomy &amp; Astrophysics, in press, 2020. doi:10.1051/0004-6361/202039559.", "posttime": "2020-11-03 23:49:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学,sign,金星", "title": "对金星上“可能的生命迹象”的怀疑表明科学是如何运作的", "title_en": "Doubts over a ‘possible sign of life’ on Venus show how science works", "transed": 1, "url": "https://www.sciencenews.org/article/venus-phosphine-possible-sign-life-doubts-how-science-works", "via": "", "real_tags": ["科学", "sign", "金星"]}, {"category": "", "categoryclass": "", "imagename": "5e15d798db48e5d5c20dc8cdd0af58de.png", "infoid": 1032987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "鸭嘴兽凭借其毒刺、独特的鸭嘴和哺乳动物的产卵能力，已经作为地球上最奇怪的动物之一而闻名于世。现在，科学家们发现，这种进化上的怪异现象还有另一个令人着迷的适应--当它暴露在紫外光下时，它的皮毛在黑暗中会发光。\n根据最近发表在“哺乳动物”杂志上的一篇论文，这一新发现代表了“第一份关于单孔哺乳动物生物荧光的报告”，鸭嘴兽属于极其罕见的家族，“在紫外光下”。\n当动物吸收短波长的光并重新发射长波长的光，导致颜色变化时，就会发生生物荧光；它与生物发光不同，生物发光是生物从化学反应中独立产生光的能力。\n这种荧光已经在鸟类、昆虫、海洋生物和植物中观察到，但以前只在负鼠和飞鼠这两个哺乳动物家族中看到过。由于生物荧光哺乳动物的明显稀缺性，直到现在还没有太多的努力去寻找它们。\n由诺斯兰学院(Northland College)自然资源副教授保拉·斯佩特·阿尼奇(Paula Spaeth Anich)领导的科学家们受到启发，在鸭嘴兽中寻找生物荧光，因为团队成员在用黑灯研究地衣时，意外地在新大陆飞松鼠的毛皮中发现了粉红色的发光。\n阿尼奇和她的同事们发现，鸭嘴兽通过将三个填充标本暴露在黑暗的房间里的紫外光下，分享了发光的皮毛。\n阿尼奇在一份声明中说：“这是机缘巧合和好奇心的混合，导致我们用紫外线照射菲尔德博物馆的鸭嘴兽。”“但我们也很感兴趣的是，生物荧光皮毛的特性在哺乳动物的树中深入到了什么程度。”\n“人们认为，单孔动物在1.5亿多年前就从有袋类-胎盘血统中分出了分支，”她继续说。因此，看到远亲的动物也有生物荧光皮毛，这是很有趣的。\nAnich和她的同事们观察到来自芝加哥菲尔德自然历史博物馆的一名塔斯马尼亚男性和女性，以及一名来自澳大利亚大陆的男性身上的绿到青色，这名男性现在储存在内布拉斯加州大学州立博物馆(University Of Nebraska State Museum)。虽然菲尔德博物馆雄性标本的收藏日期不得而知，但另外两个标本都有超过一个世纪的历史：芝加哥的雌性标本可以追溯到1889年，而内布拉斯加州的雄性标本则是在1909年收集的。\n在鸭嘴兽和飞鼠等动物身上新发现的生物荧光表明，这种适应在哺乳动物中可能比预期的更广泛。科学家们认为，这种适应可能在其他物种中扮演着许多角色，如引诱猎物、性选择、种内交流和伪装。然而，仍然不清楚为什么鸭嘴兽会进化出五颜六色的显示器。\nAnich和她的同事在研究中说：“虽然在我们检查的所有鸭嘴兽样本中都发现了对紫外光做出反应的生物荧光，但样本量小限制了我们对这一特征的生态功能得出结论的能力。”\n“男性和女性样本的生物荧光模式和强度相同；因此，这一特征似乎不是性别二型性的，”研究小组补充道。“我们有信心，我们观察到的荧光并不是一般博物馆标本的特性。”\n研究小组推测，鸭嘴兽发光可能是一种对紫外线敏感的捕食者的隐形斗篷，但他们指出，最终需要对野生鸭嘴兽进行实地观察，才能揭开荧光皮毛背后的奥秘。\n不过，有一件事是肯定的：鸭嘴兽继续名副其实，它是地球上最怪异的动物之一。", "note_en": "With its venom-laced spurs, idiosyncratic duck bill, and mammalian egg-laying abilities, the platypus was already world famous as one of the weirdest animals on Earth. Now, scientists have discovered that this evolutionary oddity has yet another fascinating adaptation—its fur glows in the dark when exposed to ultraviolet light.\n  The new discovery represents “the first report of biofluorescence in a monotreme mammal,” the extremely rare family to which the platypus belongs, “under UV light,”  according to a recent paper published in the journal  Mammalia.\n   Biofluorescence occurs when animals absorb short wavelengths of light and re-emit longer wavelengths, causing a shift in color; it is distinct from bioluminescence, which is the biological ability to independently generate light from chemical reactions.\n  This fluorescent glow has been observed in birds, insects, marine life, and plants, but it had only been seen previously in two mammal families, opossums and flying squirrels. As a result of the apparent rareness of biofluorescent mammals, there hasn’t been much of an effort to seek them out—until now.\n  Scientists led by Paula Spaeth Anich, an associate professor of natural resources at Northland College, were inspired to look for biofluorescence in platypus after members of the team  unexpectedly detected a pink glow in the fur of New World flying squirrels while studying lichens with a blacklight.\n  Anich and her colleagues discovered that platypus share the glowing fur by exposing three stuffed specimens to UV light in a dark room.\n  “It was a mix of serendipity and curiosity that led us to shine a UV light on the platypuses at the Field Museum,” said Anich  in a statement. “But we were also interested in seeing how deep in the mammalian tree the trait of biofluorescent fur went.”\n  “It’s thought that monotremes branched off the marsupial-placental lineage more than 150 million years ago,” she continued. “So, it was intriguing to see that animals that were such distant relatives also had biofluorescent fur.”\n    Anich and her colleagues observed the greenish-to-cyan color on a Tasmanian male and female from the Field Museum of Natural History in Chicago, as well as a male from the Australian mainland that is now stored at the University of Nebraska State Museum. Though the collection date of the Field Museum male is not known, the other two specimens are each over a century old: the Chicago female dates back to 1889 and the Nebraska male was collected in 1909.\n  The new identification of biofluorescence in animals such as platypus and flying squirrels suggests that this adaptation may be more widespread in mammals than expected. Scientists think that the adaptation  may play many roles in other species, such as luring prey, sexual selection, intraspecies communication, and camouflage. However, it’s still not clear why platypus have evolved the colorful display.\n   “While biofluorescence in response to UV light was seen in all of the platypus specimens we examined, the small sample size limits our ability to draw conclusions about the ecological function of this trait,” Anich and her colleagues said in the study.\n  “The male and female specimens biofluoresced in the same patterns and intensity; therefore, it appears that the trait is not sexually dimorphic,” the team added. “We are confident that the fluorescence we observed is not a property of museum specimens in general.”\n  The team speculated that platypus glow may serve as a kind of invisibility cloak for UV-sensitive predators, but noted that field observations of wild platypus would ultimately be needed to unravel the mysteries behind the fluorescent fur.\n  One thing’s for certain, though: The platypus continues to live up to its reputation as one of the weirdest animals on Earth.", "posttime": "2020-11-03 23:48:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,绿色,discovered,鸭嘴兽", "title": "科学家们刚刚发现，鸭嘴草毛皮在紫外光下发出绿色的光", "title_en": "Scientists Just Discovered That Platypus Fur Glows Green Under UV Light", "transed": 1, "url": "https://www.vice.com/en/article/epddqm/scientists-just-discovered-that-platypus-fur-glows-green-under-uv-light", "via": "", "real_tags": ["科学家", "绿色", "鸭嘴兽"]}, {"category": "", "categoryclass": "", "imagename": "b611b9f380586a2db7f0182f8e5a697b.jpg", "infoid": 1032986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "说到这是一个绝佳的机会，这个机会可以让你的初创公司进入航天行业领先的专家和决策者的轨道。我们谈论的是来自美国国家航空航天局(NASA)、美国军方和风投公司的人们，他们决心资助开创性的太空初创企业。获得一个早期创业展示包来展示你的技术和才华-并给那些可以改变你的创业轨迹的人留下深刻的印象。注：只剩下8个名额，早鸟定价将于11月13日晚上11点59分结束。(PT)。\n360美元的参展商通行证包括一个数字展览空间，能够收集参观你的展览空间的线索，以及为你的同事提供三张会议门票。在一个经典的“但是等等，还有更多”的时刻，所有的参展商都可以向来自世界各地的与会者推销产品。我们谈论的是创始人、工程师、投资者、科技记者、潜在客户和来自公共部门和私营部门的合作者-更不用说在NASA和军方掌管钱袋的人了。\n超级奖金：参展商还可以听取以下组织的意见，讨论如何获得赠款资金。\nTechCrunch活动总是以顶级的行业演讲者为特色，在TC Sessions：Space上，您也不会有更低的期望。以下是活动日程的一个样本--我们将在接下来的几周里增加一些惊喜。\n从太空岩石回归到财务回报：一个投资者小组--由克里斯·博水森(Data Collective DCVC)、迈克·科利特(Mike Collett)(Promus Ventures)和苔丝·哈奇(Tess Hatch)(Bessemer Venture Partners)组成。一些投资者花费大量时间仰望星空，寻找下一个风险投资机会。这是一个不同于其他任何市场的市场，但这是否会改变基于股权的投资的数学呢？\n如何让空军购买你的东西-我们将与美国空军采购、技术和后勤助理部长威尔·罗珀(Will Roper)讨论了解空军需要什么以及如何将其出售给他们的最佳方式。\n太空防御领域的公私伙伴关系-美国太空部队司令杰伊·雷蒙德将军谈到了如何确保一个全新的战争领域的安全，以及美国军方的最新部门将如何寻求私营行业来实现这一目标。\n你的创业公司准备好迎接这个绝佳的机会了吗？在11月13日晚上11：59储蓄倒计时结束和价格上涨之前，确保你的早期创业参展套餐。(PT)。\n贵公司是否有兴趣赞助TC Sessions：Space 2020？请单击此处与我们讨论可用的机会。", "note_en": "Speaking of a stellar opportunity, this one lets you navigate your startup into the orbit of the space industry’s leading experts and decisions makers. We’re talking folks from NASA, the U.S. military and VCs determined to finance pioneering space startups. Get an  Early-Stage Startup Exhibitor Package to showcase your tech and talent — and impress the people who can change your startup’s trajectory.  Note: Only eight spots left, and early-bird pricing ends November 13 at 11:59 p.m. (PT).\n The $360 exhibitor pass includes a digital exhibition space, the ability to gather leads who visit your exhibit space and three tickets to the conference for your coworkers. In a classic, “but wait, there’s more” moment, all exhibitors will be able to pitch to conference attendees from around the world. We’re talking founders, engineers, investors, tech journalists, potential customers and collaborators from the public sector and private sectors — not to mention people who hold the purse strings at NASA and the military.\n  Super Bonus: Exhibitors also get to hear from with the following organizations to discuss how to access grant money.\n TechCrunch events always feature  top-level industry speakers, and you can expect nothing less at TC Sessions: Space. Here’s a sample from the  event agenda — and we’ll add a few surprises in the coming weeks.\n From Space Rock Returns to Financial Returns: An investor panel — with Chris Boshuizen (Data Collective DCVC), Mike Collett (Promus Ventures) and Tess Hatch (Bessemer Venture Partners). Some investors spend a lot of their time looking to the stars for the next venture capital opportunity. It’s a market unlike any other, but does that change the math on equity-based investment?\n How to Get the Air Force to Buy Your Stuff — We’ll talk with Will Roper, U.S.A.F. Assistant Secretary for Acquisition, Technology &amp; Logistics, about the best ways to understand what the Air Force needs and how to sell it to them.\n Public-private Partnerships in the Domain of Space Defense — General Jay Raymond, the head of the U.S. Space Force, talks about what it takes to secure an entirely new war-fighting domain, and how the newest branch of the U.S. military will be looking to private industry to make it happen.\n Is your startup ready for this stellar opportunity? Secure your  Early-Stage Startup Exhibitor Package before the countdown to savings ends and prices go up on November 13 at 11:59 p.m. (PT).\n Is your company interested in sponsoring TC Sessions: Space 2020?   Click here  to talk with us about available opportunities.", "posttime": "2020-11-03 23:31:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,推介,pitch", "title": "\n有没有合适的东西？在TC会议上展示和推介：Space 2020", "title_en": "\n\t\t\t\tGot the right stuff? Exhibit and pitch at TC Sessions: Space 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/got-the-right-stuff-exhibit-and-pitch-at-tc-sessions-space-2020/", "via": "", "real_tags": ["2020", "推介", "pitch"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于单轨列车的反馈", "note_en": "Feedback on Monorail", "posttime": "2020-11-03 23:21:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,github,注入,widespread,列车", "title": "GitHub：操作中广泛存在的注入漏洞", "title_en": "GitHub: Widespread Injection Vulnerabilities in Actions", "transed": 1, "url": "https://bugs.chromium.org/p/project-zero/issues/detail?id=2070&can=2&q=&colspec=ID%20Type%20Status%20Priority%20Milestone%20Owner%20Summary&cells=ids", "via": "", "real_tags": ["漏洞", "github", "注入", "列车"]}, {"category": "", "categoryclass": "", "imagename": "a2cc3137e4ee29dcbb58282675d87469.jpg", "infoid": 1032983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该交易所探索初创企业、市场和资金。每天早上在Extra Crunch上阅读它，或者每周六获得Exchange时事通讯。\n正如你可以想象的那样，所有这些巨型交易加在一起。根据世邦魏理仕第三季度整理的金融科技空间数据，金融科技初创企业融资总额的60%来自25轮融资，价值在1亿美元或以上。同一份报告指出，随着独角兽企业年龄增长而没有毕业于公开市场，风险投资越来越大，这一趋势进一步加剧了这一趋势。报告还指出，与第二季度相比，金融科技1亿美元的融资规模增长了24%，而规模较小的交易领域的投资同期下降了16%。\n与2019年第三季度相比，金融科技的总交易额下降了24%，全球交易总额为451笔。但投资于金融科技初创企业的美元再次小幅上升至106.31亿美元，这是2020年迄今最大的业绩，也是自2018年年中以来第二好的单季度业绩。\n奇怪的是，表现最好的是市场的底部，也是市场的顶部。正如我们所看到的，后期资金流动。但值得注意的是，与2020年第二季度相比，规模较小的风险投资(标记为种子或天使)的数量增长了20%。\nCB Insights的数据中有一些值得深入研究的趋势，包括以支付为重点的初创公司的风险投资正在发生什么，IPO市场可能会如何影响保险科技投资，以及罗宾汉(Robinhood)等财富管理初创公司和Chime等银行初创公司作为群体的表现如何。\n数据引人入胜，今天就让我们进入金融科技投资的状态。\n今天我们关注四大趋势，但我想首先指出的是，非洲的金融科技初创企业的交易数量似乎达到了创纪录的14笔。这一数字高于2020年第二季度的11笔和第一季度的9笔。我正在努力更多地关注非洲的科技领域，这些数字非常突出。\n随着最大的风险投资市场-北美、欧洲、亚洲-金融科技交易数量的下降，非洲和拉丁美洲的交易数量正在上升，值得关注。\n像Strip和Finix这样的支付初创公司占据了头条新闻，但它们只占其行业吸收的风险投资总额的一小部分。\n根据CB Insight的数据，2020年第三季度，对支付初创企业的风险投资上升，从2020年第二季度的23.79亿美元增加到39.59亿美元，2019年第三季度为29.27亿美元。\n除了2019年第四季度的异常情况外，一段时间以来，对以支付为重点的初创企业的投资一直在稳步上升。为什么？贝宝(PayPal)的收益提供了部分解释。正如我们昨天在这家消费者支付巨头公布第三季度业绩后报道的那样：", "note_en": "The Exchange explores startups, markets and money. Read it  every morning on Extra Crunch, or get  The Exchange newsletter every Saturday.\n  As you can imagine, all those mega-deals have added up. According to  data collated by CB Insights on the fintech space in the third quarter, 60% of all capital raised by financial technology startups came from just 25 rounds worth $100 million or more. Adding to the trend of  venture getting bigger — and later as unicorns age without graduating to the public markets — the same report noted that fintech investment from $100 million rounds grew 24% compared to Q2, while investment in the space from smaller deals fell 16% over the same timeframe.\n Overall fintech deal volume dipped 24% compared to Q3 2019, totaling 451 global deals. But dollars invested into fintech startups edged up once again to $10.631 billion, the largest result thus far in 2020 and the second-best single-quarter tally since mid-2018.\n Oddly, it was the bottom, as well as the top of the market that did best. As we’ve seen, late-stage money flowed. But, notably, the number of the smaller venture rounds, those marked seed or angel, grew by 20% compared to Q2 2020.\n  Inside the CB Insights data are a few trends worth digging into, including what’s going on with venture investment into payments-focused startups, how the IPO market may be impacting insurtech investment, and how both wealth management startups like  Robinhood   and banking startups like  Chime   are faring as cohorts.\n The data is fascinating, so let’s get into the state of fintech investing today.\n  We’re focused on four mega-trends today, but I wanted to start point out that African fintech startups saw what appears to be their all-time record in deal count at 14. That was up from 11 in Q2 2020, and nine in Q1. I’m working to pay more attention to the African tech scene, and those numbers stood out.\n As fintech deal count falls in the largest VC markets — North America, Europe, Asia — it is rising in Africa and Latin America, something to keep an eye on.\n    Payments startups  like Stripe and Finix get  their share of headlines, but they make up only a fraction of the total volume of venture capital investment that their sector absorbs.\n Per CB Insights, venture investment into payments startups ticked higher in Q3 2020, rising to $3.959 billion from $2.379 billion in Q2 2020, and $2.927 billion in Q3 2019.\n Aside from an anomalous final quarter in 2019, investment into payments-focused startups has been on a steady incline for some time. Why? PayPal earnings offer a partial explanation. As  we reported yesterday after the consumer payments giant reported its Q3 performance:", "posttime": "2020-11-03 23:03:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,风险投资,科技,fintech,金融", "title": "\n金融科技风险投资在2020年第三季度的4个收获", "title_en": "\n\t\t\t\t4 takeaways from fintech VC in Q3 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/4-takeaways-from-fintech-vc-in-q3-2020/", "via": "", "real_tags": ["2020", "风险投资", "科技", "fintech", "金融"]}, {"category": "", "categoryclass": "", "imagename": "206e17be9dd2cbbcef42d992ef48c782.png", "infoid": 1032982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Udacity提供在线课程，并在人工智能、编程、自动驾驶和云计算等与科技相关的学科中普及了“纳米学位”的概念，该公司已经以债务融资的形式获得了7500万美元。这笔资金将用于继续投资于其平台，以瞄准更多的商业客户。\nUdacity表示，部分业务增长迅速，第三季度预订量同比增长120%，2020年上半年平均运行率增长260%。\nUdacity表示，这一细分市场的客户包括“世界七大航空航天公司中的五家，四大专业服务公司中的三家，世界领先的制药公司，埃及的信息技术工业发展局，以及美国国防部四个分支机构中的三个”，这些公司与Udacity合作，为他们的特定需求量身定做课程，并使用其目录中的现成内容。\nUdacity还与公司合作，将程序作为其CSR任务的一部分，并与微软等科技公司合作，建立程序，让更多的开发人员使用他们的工具。\nUdacity首席执行官加布·达尔波托(Gabe Dalporto)于2019年加入公司，他表示：“我们看到企业和政府方面的巨大需求。”但到目前为止，它主要是流入的，有企业、财富500强公司和政府机构进入，并希望与我们合作。现在是时候组建一支销售团队来追赶他们了。“。\n对于一家多年来一直因为不那么乐观的原因而成为聚光灯下的公司来说，今天的消息是一个可喜的转折，部分原因是它发现要实现盈利的商业模式具有挑战性。\n近十年前，由包括斯坦福大学(Stanford)教授塞巴斯蒂安·特伦(Sebastian Thrun)在内的三名机器人专家创立的Udacity最初看到了与学院和大学合作建设在线技术课程的机会(特伦的学术地位和MOOC的流行，可能是这一战略的两个方面)。特伦当时在制造和运营谷歌的自动驾驶汽车和更大的登月项目方面发挥了重要作用。\n在那之后，事实证明挑战太大，成本太高，Udacity将自己定位为一家面向成年人的职业学习提供商，特别是那些没有时间或钱开始全日制课程，但想要学习技术技能的人，这些技能可以帮助他们找到更好的工作。\n这导致了一些实质性的用户增长，但仍然没有利润。最终，随着重组并向目前的形式靠拢，该公司面临着多轮裁员。\n目前，该公司仍提供直接面向消费者(Direct-to-Learning？)。Dalporto说，用不了多久，企业和政府客户就会占到公司业务的80%左右。\n此前，Udacity已经从一群非常杰出的投资者那里筹集了近1.7亿美元，其中包括安德森·霍洛维茨(Andreessen Horowitz)、贝利·吉福德(Ballie Gifford)、CRV、艾默生集团(Emerson Collective)等。最新一批资金是以一家名为Hercules Capital的公司提供的债务工具的形式提供的。\nDalporto表示，采取债务路线的决定是在最初获得一轮股权融资的多份条款说明书后做出的。\n他表示：“我们在股权方面有多份条款说明书，但后来我们收到了一份主动提供的债务条款说明书。”他说，这导致该公司建立了资本成本和稀释成本的模型，“结果证明这是更好的选择。”他补充说，就目前而言，股权“不在谈判桌上”，但该公司可能会考虑在上市过程中重新考虑这一想法。“在可预见的未来，我们的现金流为正，因此目前没有令人信服的理由，但我们可能会做一些更接近IPO的事情。”\n作为一种债务工具，这笔资金并不意味着重新审视Udacity的估值。该公司上一次资本化是在五年前，当时是10亿美元，但Dalporto不愿评论它收到的(未完成的)股权条款说明书中的情况发生了什么变化。\nUdacity看到的兴趣-无论是来自投资者还是作为一家公司-是在线教育公司在过去一年里受到的更大关注的一部分。在K-12和大学教育中，重点一直是建立更好的技术和内容，以帮助学生保持参与并继续学习，即使他们不能在正常的物理教室里学习，因为学校、学区、政府和公共卫生官员实施了社会距离，以减缓新冠肺炎的传播。\n但这并不是唯一一个呼吁在线教育的教室。在商界，也因大流行而疏远的组织正面临着一系列挑战。当员工不再毗邻工作时，他们如何才能保持员工的工作效率并让他们感觉自己是团队的一部分呢？他们如何确保他们的员工具备在新环境中工作所需的技能？他们如何确保他们自己的企业配备了正确的技术，以及运行这些技术的人员的专业知识，以应对这种最新和未来的“工作”迭代？各国政府如何才能确保他们的经济不会因为流感大流行而跌落悬崖呢？\n在线教育一直被视为解决所有这些问题的灵丹妙药，这为构建在线学习工具和其他基础设施的科技公司带来了大量机会-其他公司包括Coursera、LinkedIn、Pluralsight、Treehouse和Springboard等公司在面向员工的科技相关课程和学习平台领域。\n就像电子商务这样的其他细分市场一样，这不是突如其来的趋势，而是它的加速速度比人们预期的要快得多。\n考虑到Udacity的增长，专注于可持续的商业实践，并在多个行业扩大覆盖范围，我们很高兴能提供这项投资。我们期待着与该公司合作，帮助他们保持令人印象深刻的全球增长，并在提升技能和再技能方面继续创新，“Hercules Capital高级MD和技术集团负责人Steve Kuo在一份声明中表示。\n在企业和政府领域，Dalporto描述了Udacity已经活跃的一些场景，这些场景是Udacity已经提供的那种职业学习的自然发展。\n例如，能源公司壳牌(Shell)对结构和地质工程师进行再培训，“他们拥有良好的数学技能，但没有机器学习专业知识”，以便能够在数据科学领域工作，这是该公司在运营中建立更多自动化和进入新型能源技术所需的。\n他说，埃及和其他国家期待着印度取得的成功，一直在为当地居民提供技术专业培训，帮助他们在“外包经济”中找到工作。他说，埃及的这个项目已经有80%的毕业率和70%的“积极成果”(创造了就业机会)。\nDalporto说：“如果你只考虑人工智能和机器学习，对这些技能的需求正以每年70%的速度增长，但缺乏填补这些职位的人才。”\n他补充说，Udacity目前还没有考虑任何收购，还要6-12个月。“我们内部有如此多的需求和工作要做，因此没有令人信服的理由这样做。在某种程度上，我们会考虑这一点，但它需要与我们的战略联系起来。“", "note_en": "Udacity, which provides online courses and popularized the concept of “nanodegrees” in tech-related subjects like artificial intelligence, programming, autonomous driving and cloud computing, has secured $75 million in the form of a debt facility. The funding will be used to continue investing in its platform to target more business customers.\n Udacity   said that part of the business is growing fast, with Q3 bookings up by 120% year-over-year and average run rates up 260% in H1 2020.\n  Udacity said that customers in the segment include “five of the world’s top seven aerospace companies, three of the Big Four professional services firms, the world’s leading pharmaceutical company, Egypt’s Information Technology Industry Development Agency, and three of the four branches of the United States Department of Defense”, which work with Udacity to build tailor-made courses for their specific needs, as well as use off-the-shelf content from its catalogue.\n Udacity also works with companies to build programs as part of their CSR remits, and with tech companies like Microsoft to build programs to get more developers using their tools.\n “We’re seeing tremendous demand on the enterprise and government side,” said Gabe Dalporto, Udacity’s CEO who joined the company in 2019. “But to date it’s mostly been inbound, with enterprises, Fortune 500 companies and government organizations coming in and wanting to work with us. Now it’s time to build out a sales team to go after them.”\n The news today is a welcome turn of events for a company that has been in the spotlight over the years for less rosy reasons, partly because it found it challenging to land on a profitable business model.\n Founded nearly a decade ago by three robotics specialists including Sebastian Thrun, the Stanford professor who at the time was instrumental in building and running Google’s self-driving car and larger moonshot programs, Udacity initially saw an opportunity to partner with colleges and universities to build online tech courses (Thrun’s academic standing, and the vogue for  MOOCs, were possibly two fillips for that strategy).\n After that proved to be too challenging and costly, Udacity pivoted to positioning itself as a  vocational learning provider targeting adults,  specifically those who didn’t have the hours or money to embark on full-time courses but wanted to learn tech skills that could help them land better jobs.\n That resulted in some substantial user growth, but still no profit. Eventually, the company faced  multiple rounds of  layoffs as it restructured and gravitated closer to its current form.\n Currently, the company still provides direct-to-consumer (direct-to-learner?) courses, but it won’t be long, Dalporto said, before enterprise and government customers account for about 80% of the company’s business.\n Previously, Udacity had raised nearly $170 million from a pretty illustrious group of investors that include  Andreessen Horowitz, Ballie Gifford, CRV, Emerson Collective and more. This latest tranche is coming in the form of a debt facility from a single company, Hercules Capital.\n Dalporto said the decision to take the debt route came after initially getting a number of term sheets for an equity round.\n “We had multiple term sheets on the equity side, but then we received an unsolicited debt term sheet unsolicited,” he said. That led to the company modelling out the cost of capital and dilution, he said, and “it turned out it was the better option.” For now, he added, equity was “off the table” but it may consider revisiting the idea en route to a public listing. “For the foreseeable future, we are cash flow positive so there is no compelling reason right now, but we might do something closer to an IPO.”\n Being a debt facility, this funding does not mean a revisiting of Udacity’s valuation. The company was last capitalized  five years ago at $1 billion, but Dalporto would not comment on how that had changed in the (uncompleted) equity term sheets it had received.\n  The interest Udacity is seeing — both from investors and as a company — is part of the bigger spotlight that online education companies have had in the last year. In K-12 and university education, the focus has been on building better technology and content to help students stay engaged and continue learning even when they cannot be in their normal physical classrooms as schools, districts, governments and public health officials implement social distancing to slow the spread of COVID-19.\n But that’s not the only classroom where online education is getting called on. In the world of business, organizations that have also gone remote because of the pandemic are facing a matrix of challenges. How can they keep employees productive and feeling like part of a team when they no longer work next to each other? How do they make sure their workforces have the skills they need to work in the new environment? How do they make sure their own businesses are equipped with the right technology, and the expertise of people to run it, for this latest and future iterations of “work”? And how can governments make sure their economies don’t fall off a cliff as a result of the pandemic?\n Online education has been seen as something of a panacea for all of these questions, and that has spelled a lot of opportunity for tech companies building online learning tools and other infrastructure — with others including the likes of Coursera, LinkedIn, Pluralsight, Treehouse and Springboard in the area of tech-related courses and learning platforms for workers.\n As with other market segments like e-commerce, this isn’t about a trend emerging out of the blue, but about it accelerating much faster than people projected it would.\n “Given Udacity’s growth, focus on sustainable business practices, and expanding reach across multiple industries, we are excited to provide this investment. We look forward to working with the company to help them sustain their impressive global growth, and continued innovation in upskilling and reskilling,” said Steve Kuo, Senior MD and Technology Group Head at Hercules Capital, in a statement.\n In the areas of enterprise and government, Dalporto described a number of scenarios where Udacity is already active, which are natural progressions of the kind of vocational learning it was already offering.\n They include, for example, the energy company Shell retraining structural and geological engineers “who had good math skills but no machine learning expertise” to be able to work in data science, needed as the company builds more automation into its operation and moves into new kinds of energy technology.\n And he said that Egypt and other nations — looking to the success that India has had — have been providing technology expertise training to residents to help them find jobs in the “outsourcing economy.” He said that the program in Egypt has seen an 80% graduation rate and 70% “positive outcomes” (resulting in jobs).\n “If you take just AI and machine learning, demand for these skills is growing at a rate of 70% year-over-year, but there is a shortage of talent to fill those roles,” Dalporto said.\n Udacity is for now not looking at any acquisitions, he added, for another 6-12 months. “We have so much demand and work to do internally that there is no compelling reason to do that. At some point we will look at that but it needs to be linked to our strategy.”", "posttime": "2020-11-03 23:03:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "企业,tech", "title": "\nUdacity举债7500万美元，称其科技教育业务在企业转型后盈利", "title_en": "\n\t\t\t\tUdacity raises $75M in debt, says its tech education business is profitable after enterprise pivot\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/udacity-raises-75m-in-debt-says-its-tech-education-business-is-profitable-after-enterprise-pivot/", "via": "", "real_tags": ["企业", "tech"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着我们进入2021年，自由软件基金会正在寻求更新其高度优先的自由软件项目列表。这些软件项目应该纳入自由软件在现代计算领域面临的最重要的威胁和最关键的机遇。目前，金融稳定论坛正在寻求帮助，以决定纳入哪些内容。\rFSF高优先级项目列表曾经包括PowerVR逆向工程，认为它非常重要，尽管在PowerVR图形变得不那么常见之前从未发生过。事实上，许多金融稳定基金的高优先级项目从未像它们那样取得成功；Idon‘我们不会为这项事业贡献太多资源，而只是唤起人们对它们的关注。\rPDF支持是他们高度优先的项目之一，也是另一个例子，还有开源Skype替代品和反向工程其他流行技术。\r他们在2017年成立了一个委员会来维护名单后，对名单进行了全面改革，而现在，由于2021年即将到来，他们正寻求再次修改他们的高优先级项目重点。\r他们已经发出呼吁，要求您与高优先级自由软件项目委员会分享您认为应该出现在列表中的内容。反馈正在收集中，一直持续到1月初。\r目前在名单上的是不同的领域，他们认为自由软件是高度优先的，而不是以前专注于特定的项目：\r免费的手机操作系统--这可以说它已经完成了，从Ubuntu Touch到各种PinePhone的努力，再到Librem5上的PureOS，再到更多……。还有基于Android开源项目(AOSP)的Replicant和其他自由软件项目。\r去中心化、联合化和自主化--对更多去中心化服务的呼唤。\r免费的驱动程序、固件和硬件设计--我们不是都喜欢免费的软件驱动程序吗？近年来，越来越多的供应商将他们的开源驱动程序贡献给Linux内核。尽管开源固件和硬件设计是另一项艰难的努力，但至少像Raptor Computing Systems这样的公司及其libre POWER9系统已经展示了什么。它很受欢迎。\r实时语音和视频聊天--现在有各种各样的免费软件解决方案，尽管大众流行的是另一回事……\r鼓励社区中代表性不足的人做出贡献--有Outreachy、Google Summer of Code等。\r自由软件的国际化--这似乎一如既往地在继续发生。\r自由软件带来的安全性--安全性曾经是完整的吗？\r智能个人助理-Mycroft是谷歌主页(Google Home)和亚马逊(Amazon)等开源产品的最佳替代品。这是亚历克萨。\r帮助GNU/Linux发行版致力于自由-自由软件基金会继续支持Guix、Hyperbola、PureOS、Trisquel和其他发行版，大多数人从未听说过这些发行版，但发布时没有任何固件二进制文件或其他BLOB。\r政府采用自由软件--这是一个相当棘手且永无止境的问题……\r您希望从2021年自由软件基金会高优先级项目清单中看到什么？", "note_en": "As we roll into 2021 the Free Software Foundation is looking to update its high priority free software projects list. These are the software projects that should be incorporating &#34;the most important threats, and most critical opportunities, that free software faces in the modern computing landscape.&#34; For now the FSF is looking for help deciding what to include.\r   The FSF high priority projects list is what once included  PowerVR reverse engineering as being very important albeit never happened prior to PowerVR graphics becoming less common. In fact,  many FSF high priority projects never panned out as they weren&#39;t contributing much in the way of resources to the causes but just calling attention to them.\r    PDF support was among their high priority projects as well as another example as well as the likes of  an open-source Skype replacement and  reverse-engineering other popular technologies.\r   They  overhauled the list in 2017 after forming a committee to maintain the list while now as 2021 is just around the corner they are looking to revise their high priority projects focus once more.\r   They have  issued a call for input to share with the High Priority Free Software Projects committee what you feel should belong on the list. Feedback is being collected through early January.\r   Currently on  the list are different &#34;areas&#34; they feel are high priority for free software as opposed to previously focusing on particular projects:\r    Free phone operating system - This could be argued that it&#39;s already accomplished from the likes of Ubuntu Touch to the various PinePhone efforts to PureOS on the Librem 5 to more... There is also Replicant and other free software project built off the Android Open-Source Project (AOSP).\r    Decentralization, federation, and self-hosting - A call for more decentralized services.\r    Free drivers, firmware, and hardware designs - Don&#39;t we all love free software drivers and that&#39;s been going rather dandy and more vendors in recent years contributing their open-soruce drivers to the Linux kernel. Open-source firmware and hardware designs though is another tough effort but at least the likes of Raptor Computing Systems with their libre POWER9 system has shown what&#39;s popular.\r    Real-time voice and video chat - There exists various free software solutions these days albeit popular ones with the masses is another story...\r    Encourage contribution by people underrepresented in the community - There is Outreachy, Google Summer of Code, etc.\r    Internationalization of free software - This seems to continue to be happening as well as ever.\r    Security by and for free software - Is security ever complete?\r    Intelligent personal assistant - Mycroft is the best open-source alternative to the likes of Google Home and Amazon&#39;s Alexa.\r    Help GNU/Linux distributions be committed to freedom - The Free Software Foundation continues to endorse the likes of Guix, Hyperbola, PureOS, Trisquel, and other distributions most have never heard of but ship without any firmware binaries or other blobs.\r    Free software adoption by governments - A rather sticky and never-ending matter...\r   What do you hope to see out of the 2021 Free Software Foundation High Priority Project List?", "posttime": "2020-11-03 23:02:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,update,自由软件", "title": "FSF正在寻求更新其高优先级自由软件项目列表", "title_en": "The FSF Is Looking To Update Its High Priority Free Software Projects List", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=FSF-High-Priority-Projects-2021", "via": "", "real_tags": ["软件", "update", "自由软件"]}, {"category": "", "categoryclass": "", "imagename": "5ea50c11e87601962553e2d5ad6a8d28.jpg", "infoid": 1032980, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "塔吉特(Target)旗下杂货配送平台Shipt的工人抗议该公司最近实施的一项新算法，该算法规定了工人的时间表和工资。目前尚不清楚算法是如何做出这些决定的：Shipt向其20多万名员工提供的细节很少，该公司拒绝与公众分享任何东西，声称该系统是“专有的”。但是，即使没有接触到算法的内部工作原理，工人们也能感受到它的影响。自从9月份系统投入使用以来，他们声称自己的工资下降了，日程安排变得更加复杂和不可预测，将他们的生活推入了早熟和财务不确定之中。正如船工威利·索利斯(Willy Solis)所说：“这是我的事，我需要能够对我的时间做出明智的决定。”\n即使有越来越多的证据表明人工智能的危害和好处分布不均，什么时候允许算法做出重要决策的问题仍然存在。通常，被问到这个问题的人都是像我这样的人：那些在技术方面有专长，并在工业界和学术界担任特权职位的人。另一个根本的问题是：谁应该回答这个问题，又有什么依据？这是另一个没有被问到和没有回答的问题。像威利这样的人，他们的生活和机会都是由这些系统塑造的，几乎从来没有被包括在内。\n这在所有方面都是正确的。在关于算法治理和监管的对话中，那些受制于这些系统的人通常会被忽略。当他们被包括在内时，通常是作为一种象征或刻板印象，而不是作为一个被理解为人工智能决策核心的人。\n从某种意义上说，这并不令人惊讶。这些系统主要由私人公司生产，并出售给其他公司、政府和机构。他们受制于创建者的激励，无论他们还能做什么，最终都是为了提高使用者的利润、效率和增长。换句话说，这些都是强者的工具，通常是那些有权势的人用来对付那些没有权势的人。Shipt自己的首席公关官莫莉·斯奈德(Molly Snyder)自己也说过：“我们相信我们推出的模式是适合公司的。”在这里，我们看到了一种默许，即公司的目标与员工的目标是分开的。而且只有一方有权选择如何以及是否使用算法。\nShipt只是算法危害的一个例子。今年早些时候，英国政府部署了一种新的评分算法，但在可预见的种族和阶级界限上失败了。为了补偿考试中与COVID相关的中断，该算法基于教师估计和给定学校的历史表现等因素，猜测了它假设的学生在正常情况下会获得的分数。在这样做的过程中，它降低了贫困学生、黑人学生和棕色学生的分数，而给精英学校和富裕地区的学生打了更高的分。伦敦律师事务所Foxglove的律师科里·克里德(Cori Crider)表示：“人们拒绝就这些系统是如何运作的，以及我们是否想要它们进行实际辩论。”他的案件赢得了推翻不合格成绩的诉讼。\n英国的评分算法符合人们熟悉的模式。这些算法的细节很少对公众透明，甚至对所谓的专家也是如此。这些系统通常受到公司保密主张以及政府和机构限制访问和透明度的决定的审查。人们对他们的了解往往是营销部门和公关代表撰写的，在没有证据或核实的情况下呈现给公众。在英国，政府官员表示，评级算法“是为了让系统更公平”，这句话可以做好公关，但却没有给我们任何关于系统是否适合其任务的信息，甚至连他们可能依赖的“公平”的定义也没有。这种政府和企业保护主义以及缺乏准入意味着公众很难在知情的情况下决定何时以及是否适合使用人工智能。\n那些拥有关于这些系统内部运作的严密保密信息的人，在做出这类决策时往往也处于不利地位。科技行业异常集中。在美国，这意味着硅谷的少数公司处于人工智能开发的核心，包括构建它们授权给第三方的算法模型，或者为建造自己的人工智能初创企业租赁基础设施。而那些开发这项技术的人是一个同质的群体：主要是白人和男性，来自精英大学，拥有罕见的技术培训。\n他们代表着有权势的人和精英，虽然他们可能知道如何\n那么，当承担算法系统风险的人决定是否以及如何使用这些系统时，会是什么样子呢？它看起来不像一个整洁的流程图，也不像一套人工智能治理原则，也不像一屋子专家和学者对假想的仁慈的人工智能未来发表意见。看起来，那些将受制于这些系统的人将获得他们所需的信息，以便做出明智的选择。看起来，这些社区分享他们的经验，并做工作，以设想一个他们想要生活的世界。这可能包括也可能不包括这些技术或使用它们的机构。\n看起来像是塔瓦娜·佩蒂(Tawana Petty)在底特律禁止面部识别；英国学生抗议政府的评分算法；Shipt工人罢工；纽约洛克波特学区的家长和教师反对该学区采购这些系统。看起来像是社会运动和公民参与。归根结底，那些不得不生活在这些制度下的人，看起来是在要求决定塑造他们生活和生计的力量的权利，以及拒绝接受以牺牲他们为代价服务于强国利益的技术的统治的权利。\n在受影响最大的人有能力回答这个问题之前，我们不会知道什么时候使用算法是合适的。像我这样的专家不能替他们回答这个问题。\n梅雷迪思·惠特克(Meredith Whittaker)是AI Now Institute的联合创始人，也是纽约大学(New York University)Minderoo研究教授。", "note_en": "Workers for  Shipt, the grocery-delivery platform owned by Target, are protesting the firm’s recent implementation of a new algorithm dictating workers’ schedules and wages. How the algorithm makes these decisions isn’t clear: Shipt has provided few details to their more than 200,000 employees, and the company refuses to share anything with the public, claiming that the system is “proprietary.” But even without access to the inner workings of the algorithm, workers feel its impacts. Since the system went live in September, they claim that their wages have decreased and that scheduling is more complicated and unpredictable, throwing their lives into precarity and financial uncertainty. As Shipt worker  Willy Solis put it: “This is my business, and I need to be able to make informed decisions about my time.”\n Even as evidence of artificial intelligence’s unevenly distributed harms and benefits mount, the question of  when it is appropriate to allow algorithms to make important decisions persists. Often, the people asked this question are people like me: those who have expertise in technology, and are employed in privileged positions in industry and academia. Left unasked and unanswered is another fundamental query: Who should get to answer this question, and on what basis? People like Willy, whose lives and opportunities are shaped by these systems, are almost never included.\n This is true across the board. Those who are subject to these systems are generally ignored in conversations about algorithmic governance and regulation. And when they are included, it’s often as a token or stereotype, and not as someone whose expertise is understood as central to AI decision-making.\n In some sense, this shouldn’t be surprising. These systems are largely produced by private companies and sold to other companies, governments, and institutions. They’re beholden to the incentives of those who create them, and whatever else they might do, they’re ultimately designed to increase the profits, efficiency, and growth of those who use them. Put another way, these are the tools of the powerful, generally applied by those who have power over those who have less. Shipt’s own chief communications officer, Molly Snyder,  said it herself: “We believe the model we rolled out is the right one for the company.” Here we see a tacit acknowledgment that the goals of the company are separate from those of its workers. And only one side has the power to choose how, and whether, to use the algorithm.\n  Shipt is but one example of algorithmic harms. Earlier this year, the British government deployed  a new grading algorithm that failed spectacularly along predictable racial and class lines. Trying to compensate for COVID-related interruptions in testing, the algorithm guesstimated the scores it assumed students would have achieved under normal conditions, basing this assumption on things like teacher estimates and the historical performance of a given school. In doing so, it reduced the scores of poor, Black, and brown students, while giving higher marks to students from elite schools and wealthy areas.  Cori Crider, a lawyer from London law firm Foxglove, whose case won the reversal of the faulty grades, said, “There’s been a refusal to have an actual debate about how these systems work and whether we want them at all.”\n The British grading algorithm fit a familiar pattern. Details of these algorithms are rarely made transparent to the public,  even to so-called experts. These systems are routinely protected from scrutiny by claims of corporate secrecy and decisions by governments and institutions that limit access and transparency. What is known about them is often what’s written by marketing departments and public relations representatives, presented to the public without evidence or verification. In Britain, government officials said the grading algorithm “was meant to make the system more fair,” a line that makes good PR but gives us zero information about the suitability of the system for its task, nor even the definition of “fairness” they might be relying on. This government and corporate protectionism and lack of access mean it’s extremely difficult for the public to make an informed decision about when and whether the use of AI is appropriate.\n  Those who do have the closely guarded information about the inner workings of these systems are also often poorly positioned to make these types of decisions. The tech industry is extraordinarily concentrated. In the United States, this means that a handful of firms in Silicon Valley are at the heart of AI development, including building algorithmic models they license to third parties or leasing the infrastructure for AI startups who build their own. And those developing this technology are a homogenous group: predominantly white and male, hailing from elite universities, and possessing rare technical training.\n They represent the powerful and the elite, and while they may understand how to train a convolutional neural network, they are far removed from the contexts and communities in which their technology will be applied. Indeed, they are often unaware of how and where the technology they build is ultimately used. Technical know-how, whether in government or in the technology industry, cannot substitute for contextual understanding and lived experiences in determining whether it’s appropriate to apply AI systems in sensitive social domains. Especially given that these systems replicate and amplify the harms of structural racism and historical discrimination, which fall predominantly on Black, brown, and poor communities.\n  So what does it look like when the people who bear the risks of algorithmic systems get to determine whether — and how — they’re used? It doesn’t look like a neat flowchart, or a set of AI governance principles, or a room full of experts and academics opining on hypothetical benevolent AI futures. It looks like those who will be subject to these systems getting the information they need to make informed choices. It looks like these communities sharing their experiences and doing the work to envision a world they want to live in. Which may or may not include these technologies or the institutions that use them.\n It looks like  Tawana Petty’s work to ban facial recognition in Detroit;  British students protesting the government’s grading algorithm; Shipt workers on strike; and parents and teachers at the  Lockport school district in New York pushing back against the district’s procurement of these systems. It looks like social movements and civic engagements. And ultimately it looks like those who have to live under these systems reclaiming the right to determine the forces that shape their lives and livelihoods, and the right to refuse to be governed by technology that serves the interests of the powerful at their expense.\n  We won’t know the actual answer to when it is appropriate to use algorithms until the people who are most affected have the power to answer that very question. And experts like me can’t answer it for them.\n Meredith Whittaker is a cofounder of AI Now Institute and Minderoo research professor at New York University.", "posttime": "2020-11-03 22:56:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,人工智能,允许,affected", "title": "应该允许受人工智能决策影响最大的人在塑造关于算法治理和监管的对话中发挥核心作用", "title_en": "People who are most affected by AI decision-making should be allowed to play a central role in shaping conversations about algorithmic governance and regulation", "transed": 1, "url": "https://www.bostonglobe.com/2020/11/02/opinion/who-am-i-decide-when-algorithms-should-make-important-decisions/", "via": "", "real_tags": ["算法", "人工智能", "允许", "affected"]}]