[{"category": "", "categoryclass": "", "imagename": "ae9294b98dc9c0094463b2f6095cb615.jpeg", "infoid": 1067283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苏格兰的亚马逊仓库每年都会摧毁数百万未售出的产品，从发现英国新闻出口ITV的调查。\n ITV拍摄亚马逊，村庄在苏格兰邓菲尔姆林的仓库内覆盖了卧底镜头。镜头展示了笔记本电脑，电视，珠宝，耳机，书籍和面部面具被装入标记的箱子和＃34;毁灭。＆＃34;\n  一位匿名的前亚马逊员工告诉ITV，仓库的工作人员每周都有130,000件物品摧毁。这是由ITV观察的内部备忘录证实，这表明在4月份的一周内，124,000件物品被标记为＆＃34;毁灭。\n      ＆＃34;没有押韵的押韵或有理由被摧毁：Dyson Fans，Loovers，偶尔的MacBook和iPad;前几天，20,000个Covid（面部）面具仍在他们的包装纸中，＆＃34;前员工告诉ITV。他们说，大约一半标志着破坏的物品标记为毁灭的物品仍处于收缩包装中，而另一半的物品状况良好。\n 亚马逊发言人告诉内幕，Dunfermline将所有标记为整个英国破坏的所有产品。\n  如果130,000是每周平均值，那么每年将转化为超过600万产品，标志着破坏。 2019年，法国的卧底记者发现，亚马逊在一年内摧毁了超过300万产品。\n     ITV拍摄了标记的产品盒子和＃34;销毁＆＃34;装入卡车并驱动到回收中心，以及垃圾填埋场。 \n在内部人士的声明中，亚马逊发言人表示，ITV提到的垃圾填埋场也是一个回收中心。\n ＆＃34;我们正在努力实现零产品处置的目标，我们的优先事项是转售，捐赠给慈善组织，或回收任何未售出的产品。没有物品被送到英国垃圾填埋场。作为最后的手段，我们将把物品发送到能量恢复，但我们努力推动它发生在零的次数下的次数，＆＃34;发言人说。\n 2019年，星期日的邮件将卧底报告称为不同的英国仓库，在那里他们目睹未售出的产品被置于所谓的和＃34;毁灭区域。＆＃34;然后，邮件跟踪该仓库的产品，因为它们装入卡车并被送到废物处理场地和垃圾填埋场。\n     亚马逊＆＃39; S发言人没有评论自邮寄以来公司是否改变了其基础设施＆＃39; 2019年调查。\n  点击“注册”，您同意从Insider以及其他合作伙伴提供的营销电子邮件以及接受我们的服务条款和隐私政策。\n          形成一个＆＃39的两个交叉线; x＆＃39;它表示封闭互动或解雇通知的方法。 ", "note_en": "An Amazon warehouse in Scotland destroys millions of unsold products every year, an investigation from the British news outlet  ITV found.\n ITV filmed undercover footage inside Amazon&#39;s warehouse in Dunfermline, Scotland. The footage showed laptops, TVs, jewelry, headphones, books, and face masks being loaded into crates marked &#34;destroy.&#34;\n  An anonymous former Amazon employee told ITV that workers at the warehouse were given a weekly target of 130,000 items to destroy. This was corroborated by an internal memo viewed by ITV, which showed that during one week in April, 124,000 items were marked &#34;destroy.&#34;\n      &#34;There&#39;s no rhyme or reason to what gets destroyed: Dyson fans, Hoovers, the occasional MacBook and iPad; the other day, 20,000 COVID (face) masks still in their wrappers,&#34; the ex-employee told ITV. About half of the items marked for destruction were still in their shrink-wrap, while the other half were returned items in good condition, they said.\n An Amazon spokesperson told Insider that Dunfermline handles all products marked for destruction for the entire UK.\n  If 130,000 is a weekly average, that would translate to more than 6 million products marked for destruction every year. In 2019, undercover reporters in France found that Amazon destroyed  over 3 million products in one year.\n     ITV filmed the boxes of products marked &#34;destroy&#34; being loaded into trucks and driven to recycling centers, as well as to a landfill site.\n In a statement to Insider, the Amazon spokesperson said the landfill site mentioned by ITV was also a recycling center.\n &#34;We are working toward a goal of zero product disposal and our priority is to resell, donate to charitable organisations, or recycle any unsold products. No items are sent to landfill in the UK. As a last resort, we will send items to energy recovery, but we&#39;re working hard to drive the number of times this happens down to zero,&#34; the spokesperson said.\n In 2019, the  Mail on Sunday sent undercover reporters into a different UK warehouse where they witnessed unsold products being placed in a so-called &#34;destruction zone.&#34; The Mail then tracked the products from that warehouse as they were loaded into trucks and taken to a waste-disposal site and a landfill.\n     Amazon&#39;s spokesperson did not comment on whether the company had changed its infrastructure since the Mail&#39;s 2019 investigation.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-06-22 04:17:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,macbook,包括,warehouse", "title": "一份报告称，一份亚马逊仓库每周摧毁13万个项目，包括MacBook，Covid-19面具和电视，其中一些新的和未使用，其中一份报告称 ", "title_en": "One Amazon warehouse destroys 130,000 items per week, including MacBooks, COVID-19 masks, and TVs, some of them new and unused, a report says", "transed": 1, "url": "https://www.businessinsider.com/amazon-warehouse-destroys-destroy-items-returned-week-brand-new-itv-2021-6", "via": "", "real_tags": ["amazon", "亚马逊", "macbook", "包括", "warehouse"]}, {"category": "", "categoryclass": "", "imagename": "2b4cf61eb7853a0753ba0e7e57abbc32.jpg", "infoid": 1067282, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在ASMR流中暂停两个创作者，以推动抽搐的社区指南的界限，禁止在自然界中没有相当性的内容，但对其广告业务深度自我意识的平台仍然过于Risqué。亚马逊拥有的公司拒绝发表评论禁令的长度或引发他们的东西，而是指向其关于性成分规则的技术。\n amouranth（kaitlyn siragusa）和indiefoxx（jenelle dagres）可能会在星期一禁令后72小时恢复，但在撰写本文时，这两个频道都仍然无法使用。 Siragusa证实了多边形，在一条溪流之后她被暂停，她在其中瑜伽姿势造成耳朵发出麦克风。\n   在抽搐中所谓的“ASMR-Meta”，流拖船通过窃窃私语来提高他们的麦克风或产生舔声的观点，有时持有瑜伽姿势，伴随着上个月爆炸的抽搐中的热水浴缸周围的争议。在这两个情况下，一些抽搐创造者认为平台的规则是有选择地强制执行的。\n “asmr meta和疯狂的瑜伽姿势，相信它或不是我看着另外两个女孩在我将活动折叠成ASMR之前没有任何禁止的禁令，在没有任何禁令的情况下观看2-5k的曲调。在Twitter上写道。 “那些其他拖鞋仍未禁止并继续这样做。我的罪是因为默契的迹象而被淘汰，然后吹掉秘密并击中30k观众。“\n 因为ASMR Meta和Hot浴缸Meta由女娱乐者主导，因此整个情况在抽搐界中吸引了更多的厌食症，其中女娱乐仍然经常骚扰平台。\n 我将永远发现它讽刺地讽刺地发挥了“暴力视频游戏不会导致枪/暴力犯罪”（我同意），即时转动尾部和放大器;屈服于像“热水浴缸/ asmr女孩的糟糕的糟糕，那里创造了瘟疫其他女孩创造者的爬行者！”\n  在一个博客中，在当时从池和热水浴池流出妇女的博客，Twitch写道，“被发现是性感的不是我们的规则，而且抽搐不会对妇女或我们服务的任何人采取执法行动，因为他们的吸引力。“该公司澄清说，虽然卧室的泳衣可能会违反规则，但“上下文适当的”泳装是允许的。 \n“我们与性暗示政策的意图是在过度或明确性暗示中绘制一系列内容，而不是禁止所有可以被视为性暗示的内容 - 但我们承认我们的规则并不像他们的那样清晰。\n 禁止可以被解释为暗示的每种形式的内容也将导致我们目前允许的视频游戏和高级内容的限制，特别是考虑有时以性别方式呈现或呈现女性角色的方式。“\n 它的解决方案是在那里创建一个“游泳池，热水浴池和海滩”类，其中内容可以活。大多数抽搐类别都致力于特定的游戏，其中大多数平台的非游戏流中列出了流行的Catch-All类别“只是聊天”。\n ASMR拥有自己的类别，拥有240万粉丝，包括耳刺刺的ASMR流，不会用更新的裁剪推动抽搐规则的界限。到目前为止，该公司正在选择惩罚它决定穿过该线的任何人来惩罚更多的畜栏性暗示内容。但是，可以所有改变：上个月，抽搐说，它正在努力进一步澄清对性暗示内容的规则。\n 不幸的是，对于抽搐 - 对于女性创造者，受到不平坦政策影响的女性创作者 - 耳朵舔流的丰富曲线表明，直到那时，该公司将在灰色区域内绘制一条线，公司将逐渐确定相同的决定它自己的制作。 ", "note_en": "Both creators were  suspended following ASMR streams that pushed the bounds of Twitch’s community guidelines forbidding content that isn’t  quite sexual in nature but is still too risqué for a platform deeply self-conscious about its advertising business. The Amazon-owned company declined to comment on the length of the bans or what provoked them, but pointed TechCrunch toward its rules on sexual content.\n It’s possible that both Amouranth (Kaitlyn Siragusa) and Indiefoxx (Jenelle Dagres) will be reinstated Monday, 72 hours after their Friday ban, but both channels remained unavailable at the time of writing. Siragusa  confirmed to Polygon that she was suspended after a stream in which she did yoga poses while making ear-licking sounds into a microphone.\n   The so-called “ ASMR-meta” on Twitch, where streamers boost their views by whispering into their microphones or producing licking sounds, sometimes while holding yoga poses, follows the  controversy around hot tubs on Twitch that exploded last month. In both instances, some Twitch creators believe that the platform’s rules are selectively enforced.\n “With ASMR meta and crazy yoga poses, believe it or not I watched two other girls doing it to the tune of 2-5k views without any bans for months before I folded the activity into ASMR creating the infamous ‘ASMR’ meta,” Siragusa wrote on Twitter. “Those other streamers are still unbanned and continue to do it. My sin was taking inaction as a sign of tacit acceptance, and then blowing the top off the secret and hitting 30k viewers.”\n Because both the ASMR meta and the hot tub meta were dominated by female streamers, the whole situation has attracted even more misogyny within the Twitch community, where  female streamers are still regularly harassed off the platform.\n I will always find it ENORMOUSLY IRONIC that the generation that fought “violent video games don’t cause an uptick in gun/violent crimes”(I agree), instantly turn tail &amp; succumb to a bad take like “HOT TUB/ASMR GIRLS LITERALLY CREATE CREEPERS that plague other girl creators!”\n  In a blog addressing the proliferation of women streaming from pools and hot tubs at the time, Twitch wrote that “being found to be sexy by others is not against our rules, and Twitch will not take enforcement action against women, or anyone on our service, for their perceived attractiveness.” The company clarified that while a bathing suit in a bedroom might break the rules, “contextually appropriate” swimwear is allowed.\n  “Our intention with the Sexually Suggestive policy was to draw a line on content that is overtly or explicitly sexually suggestive, not to ban all content that could be viewed as sexually suggestive – but we acknowledge that our rules are not as clear as they could be.\n Prohibiting every form of content that could be interpreted as suggestive would also result in far more restrictions on the video games and premium content that we currently allow, especially considering the ways that female characters are sometimes objectified or presented in a sexualized manner.”\n Its solution at the time was to create a “Pools, Hot Tubs, and Beaches” category where that content could live. Most of Twitch’s categories are dedicated to specific games, with most of the platform’s non-gaming streams listed in the popular catch-all category “Just Chatting.”\n ASMR has its own category with 2.4 million followers, encompassing ear-tingling ASMR streams that don’t push the boundaries of Twitch’s rules with the more recent crop of those that do. So far, instead of building out a more thoughtful way to corral sexually suggestive content, the company is opting to punish anybody who it decides crosses the line. But it’s possible that could all change: Last month, Twitch said it was working on new policies to further clarify the rules on sexually suggestive content.\n Unfortunately for Twitch — and for the female creators disproportionately affected by its uneven policies — the abundance of ear-licking streams suggests that until then, the company will be making these same determinations over and over as it tries to draw a line within a gray area of its own making.", "posttime": "2021-06-22 04:16:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "asmr,suspends,抽搐", "title": "抽搐暂停两个流行的ASMR溪流上的一个流行的女性创作者 ", "title_en": "\n\t\t\t\tTwitch suspends two popular female creators over sexy ASMR streams\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/twitch-asmr-meta-amouranth-indiefoxx/", "via": "", "real_tags": ["asmr", "suspends", "抽搐"]}, {"category": "", "categoryclass": "", "imagename": "40afbcfce20e042570d284be40d33de8.jpg", "infoid": 1067281, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据Pickbook数据，当2020年5月，Couchbase最后一次估值为5.5亿美元的金额估值。尽管有其广泛的筹款历史，但并不是一个独角兽，并不是我们迄今为止首次亮相的独角兽。\n 我们想揭示它是否将是一个价格并开始交易的人，因此我们挖掘了Couchbase的商业模式及其财务表现，希望能够更好地了解公司及其市场Comps。\n  COICBASE S-1提交详细信息，该公司销售数据库技术。更具体地说，Couchbase为客户提供了数据库技术，包括公司的措辞中的NoSQL（“架构灵活性”），以及将数据与SQL查询提出问题的能力。\n COICBASE的软件可以部署在云上，包括公共云，混合环境中，甚至是在预定的设置中。该公司向大公司销售，在其财政年度的结束时吸引了541名客户，以便在去年收盘生成10780万美元的年度经常性收入。\n Couchbase将其收入分为两个主要桶。首先，订阅包括软件许可收入以及公司称之为“支持和其他”收入，它将其定义为“合同后支持”或PC，这是一揽子产品，包括“支持，错误修复和有权接收未指定的软件更新和升级“合同的长度。\n 该公司的第二次收入是服务，这是不言自明的，比订阅产品更低。 ", "note_en": "According to  PitchBook data, Couchbase was last valued at a post-money valuation of $580 million when it raised $105 million in May 2020. The company — despite its expansive fundraising history — is not a unicorn heading into its debut to the best of our knowledge.\n We’d like to uncover whether it will be one when it prices and starts to trade, so we dug into Couchbase’s business model and its financial performance, hoping to better understand the company and its market comps.\n  The Couchbase  S-1 filing details a company that sells database tech. More specifically, Couchbase offers customers database technology that includes what NoSQL can offer (“schema flexibility,” in the company’s phrasing), as well as the ability to ask questions of their data with SQL queries.\n Couchbase’s software can be deployed on clouds, including public clouds, in hybrid environments, and even on-prem setups. The company sells to large companies, attracting 541 customers by the end of its fiscal 2021 that generated $107.8 million in annual recurring revenue, or ARR, by the close of last year.\n Couchbase breaks its revenue into two main buckets. The first, subscription, includes software license income and what the company calls “support and other” revenues, which it defines as “post-contract support,” or PCS, which is a package of offerings, including “support, bug fixes and the right to receive unspecified software updates and upgrades” for the length of the contract.\n The company’s second revenue bucket is services, which is self-explanatory and lower-margin than its subscription products.", "posttime": "2021-06-22 04:16:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "hat", "title": "Red Hat的销售给IBM告诉我们关于Couchbase的估值？ ", "title_en": "\n\t\t\t\tWhat does Red Hat’s sale to IBM tell us about Couchbase’s valuation?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/what-does-red-hats-sale-to-ibm-tell-us-about-couchbases-valuation/", "via": "", "real_tags": ["hat"]}, {"category": "", "categoryclass": "", "imagename": "2e2e2d3a56519a75931f80ec0038b877.jpeg", "infoid": 1067280, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高度传染的delta变体是最快，最适合的冠状病毒菌株，它将＆＃34;挑选＆＃34;世界卫生组织官员周一警告，最脆弱的人，特别是在Covid-19疫苗接种率低的地方。\n 三角洲在印度识别出来，具有潜在的＆＃34;更致命，因为它更有效地在人类之间传递的方式，它最终会发现那些将受到严重生病的脆弱个人，必须是住院和潜在死亡，＆＃34; HOWENTIES计划的执行董事Mike Ryan博士在新闻发布会期间表示。\n  瑞安表示，世界领导人和公共卫生官员可以通过捐赠和分配Covid疫苗来帮助捍卫最脆弱的群体。\n ＆＃34;我们可以保护那些脆弱的人，那些前线工作者，＆＃34;瑞安说，＆＃34;以及我们哈文＆＃39;作为总干事（Tedros Adhanom Ghebreyesus）的事实曾经一次又一次地说过全球水平的灾难性道德失败。＆＃34;\n 谁星期五表示，三角洲正在成为全球疾病的主要变种。\n 该机构宣布Delta A＆＃34;关注的变体＆＃34;上个月。一个变体可以标记为＆＃34;关注＆＃34;据健康组织称，如果已被证明更具传染性，更致命或更具致命或更具抵抗力的疫苗和治疗。\n 三角洲现在替代阿尔法，这是在欧洲和后来的欧洲和后来席卷的高度传染性的变种，儿童疫苗教育中心主任Paul Discit博士在最近的一次面试中表示。 \n研究表明，比alpha更可传递大约60％，这比2019年底从武汉出现的原始菌株更具传染性。\n  三角洲现在蔓延到92个国家，Maria Van Kerkhove，周一表示，Covid技术领先的技术领先者＆＃39;根据疾病控制和预防的中心，现在占美国所有新案件的10％，并正在成为国家成为主导变种的途径。\n 英国最近看到三角洲成为那里的主导变体，超过其原生α变体，该alpha变体在该国最初在该国检测到。 Delta Variant现在占U.K.超过60％的新案例。\n 世卫组织官员们表示，有报道称，Delta变异也会导致更严重的症状，但需要更多的研究来确认这些结论。仍然存在迹象表明δ菌株可能会引起不同的症状而不是其他变体。\n 没有变种真正发现高传播性和致命性的组合，但增量是＆＃34;那些病毒中最能力，最快，最适合的病毒，＆＃34;谁官员说。\n ＆＃34;这个特殊的Δ变体更快，它更加令人牢采，它将挑选比以前的变体更有效的更脆弱，因此如果有人在没有疫苗接种的情况下留下，它们仍然存在于进一步的风险，而＃34瑞安周一表示。\n van kerkhove说＆＃34;不幸的是，我们不在合适的地方疫苗保护人们＆＃34; \n谁一直敦促富裕国家，包括美国捐赠剂量。 拜登政府早些时候在周一详细介绍它将送达5500万疫苗剂量，其中大多数将通过Covax分发，支持WHO背部免疫计划。  ＆＃34;这些疫苗对严重疾病和死亡非常有效。 这就是他们的意图，这就是他们需要用于＆＃34的东西; van kerkhove说。 ＆＃34;这是Covax和我们所有的合作伙伴都在倡导，这些疫苗达到了最大风险的人。＆＃34; ", "note_en": "The highly contagious delta variant is the fastest and fittest coronavirus strain yet, and it will &#34;pick off&#34; the most vulnerable people, especially in places with low  Covid-19 vaccination rates, World Health Organization officials warned Monday.\n Delta, first identified in India, has the potential &#34;to be more lethal because it&#39;s more efficient in the way it transmits between humans and it will eventually find those vulnerable individuals who will become severely ill, have to be hospitalized and potentially die,&#34; Dr. Mike Ryan, executive director of the WHO&#39;s emergencies program, said during a news conference.\n  Ryan said world leaders and public health officials can help defend the most vulnerable through the donation and distribution of Covid vaccines.\n &#34;We can protect those vulnerable people, those frontline workers,&#34; Ryan said, &#34;and the fact that we haven&#39;t, as Director-General (Tedros Adhanom Ghebreyesus) has said, again and again, is a catastrophic moral failure at a global level.&#34;\n The WHO said Friday that delta is becoming  the dominant variant of the disease worldwide.\n The agency declared delta a  &#34;variant of concern&#34; last month. A variant can be labeled as &#34;of concern&#34; if it has been shown to be more contagious, more deadly or more resistant to current vaccines and treatments,  according to the health organization.\n Delta is now replacing alpha, the highly contagious variant that swept across Europe and later the U.S. earlier this year, Dr. Paul Offit, director of the Vaccine Education Center at Children&#39;s Hospital of Philadelphia, said in a recent interview.\n  Studies suggest it is around 60% more transmissible than alpha, which was more contagious than the original strain that emerged from Wuhan, China, in late 2019.\n  Delta has now spread to 92 countries, Maria Van Kerkhove, the WHO&#39;s technical lead for Covid, said Monday. It now makes up at least 10% of all new cases in the United States, according to the Centers for Disease Control and Prevention, and is on its way to becoming the dominant variant in the nation.\n The United Kingdom recently saw delta become the dominant variant there, surpassing its native alpha variant, which was first detected in the country last fall. The delta variant now makes up more than 60% of new cases in the U.K.\n WHO officials have said there were reports that the delta variant also causes more severe symptoms, but that more research is needed to confirm those conclusions. Still,  there are signs that the delta strain could provoke different symptoms than other variants.\n No variant has really found the combination of high transmissibility and lethality, but delta is &#34;the most able and fastest and fittest of those viruses,&#34; WHO officials said.\n &#34;This particular delta variant is faster, it is fitter, it will pick off the more vulnerable more efficiently than previous variants, and therefore if there are people left without vaccination, they remain even at further risk,&#34; Ryan said Monday.\n Van Kerkhove said &#34;unfortunately we don&#39;t yet have the vaccines in the right places to protect people&#39;s lives.&#34;\n The WHO has been urging wealthy nations, including the U.S. to donate doses. The Biden administration earlier Monday detailed where it will send 55 million vaccine doses, the majority of which will be distributed through COVAX, the WHO-backed immunization program.\n &#34;These vaccines are highly effective against severe disease and death. That is what they are intended for, and that is what they need to be used for&#34; Van Kerkhove said. &#34;This is what COVAX and WHO and all of our partners have been advocating for, that these vaccines reach people most at risk.&#34;", "posttime": "2021-06-22 04:10:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "covid,fastest,疫苗", "title": "谁说三角洲是最快，最适合的Covid变体，将“挑选”最脆弱的 ", "title_en": "WHO Says Delta is the Fastest and Fittest Covid Variant and Will 'Pick Off' Most Vulnerable", "transed": 1, "url": "https://www.cnbc.com/2021/06/21/covid-delta-who-says-variant-is-the-fastest-and-fittest-and-will-pick-off-most-vulnerable-.html", "via": "", "real_tags": ["covid", "fastest", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "d717bfe70c3c158ff7c1f2bea7485287.png", "infoid": 1067278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tiktok创建者可能不再需要在至少到某些类型的内容中添加“生物中的链接”。今天，Tiktok推出了跳跃，一种新的创造者通过第三方集成为他们的视频添加交互的新方法。因此，例如，烹饪视频可以通过扫扫描，配方共享应用程序具有成分列表。您可能还可以通过Quizlet添加测验，或通过呼吸呼吸练习。该公司之前已经测试过此功能;截至今天，所有用户都能看到和互动跳跃，但只有A＆＃34;选择＆＃34;群体创建者实际上可以将它们添加到他们的内容中。\n 由于您的隐私首选项，此内容不可用。在此处更新您的设置，然后重新加载页面以查看它。\n 已批准使用Jump工作的一些平台包括上述扫扫描，呼吸和Quizlet以及维基百科，Statmuse和Tabelog。其他人喜欢Buzzfeed，Jumprope，IRL和Watcha将在未来几周推出。添加内容的例子包括电影评论和美容教程。\n  最接近的竞争对手将是Snapchat的迷你，这是基本上的迷你应用程序，让您通过原子购买电影票或从头空间进行冥想练习。 WeChat，Mount Messaging App，也有自己的迷你应用程序。\n “Tiktok已成为一个娱乐和学习的目的地，”Tiktok的产品负责人在新闻稿中写道。 “通过Tiktok跳跃，我们创造了我们社区的”最后一英里“＆＃39; S发现旅程，并帮助激发平台的动作和更深的互动”\n 更新，下午3:30 et：这个故事最初表示现在可以为所有用户提供跳跃。虽然所有用户都能够看到具有跳跃的内容，但只有一些创建者目前只能将它们添加到他们的帖子中。\n   ENGADGET推荐的所有产品由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括联盟链接。如果您通过其中一个链接购买某些内容，我们可能会获得联盟委员会。 \n由于您的隐私首选项，此内容不可用。 在此处更新您的设置，然后重新加载页面以查看它。 ", "note_en": "TikTok creators may no longer need to add a “link in bio,” at least to certain kinds of content. Today,  TikTok introduced Jump, a new way for creators to add interactivity to their videos via third-party integrations. So, for example, a cooking video could feature a list of ingredients via  Whisk, a recipe-sharing app. You might also be able to add a quiz via  Quizlet, or breathing exercises via  Breathwrk. The company has beta-tested this feature before; as of today, all users will be able to see and interact with Jumps, but only a &#34;select&#34; group of creators will actually be able to add them to their content.\n This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.\n Some of the platforms that have been approved to work with Jump include the aforementioned Whisk, Breathwrk and Quizlet, as well as Wikipedia,  StatMuse and  Tabelog. Others like BuzzFeed,  Jumprope,  IRL and  WATCHA will launch in the coming weeks. Examples of added content include movie reviews and beauty tutorials.\n  The closest competitor to Jump would be  Snapchat’s Minis, which are essentially mini apps that let you buy movie tickets through Atom or have meditation exercises from Headspace. WeChat, the popular Chinese messaging app, also has its own line of mini apps.\n “TikTok has become a destination both to be entertained and to learn,” wrote Sean Kim, TikTok’s head of product, in a press release. “Through TikTok Jump, we&#39;re creating that ‘last mile’ of our community&#39;s discovery journey and helping to spark action and deeper interaction both on and off the platform”\n Update, 3:30PM ET: This story originally said that Jumps were now available for all users. While all users are able to see content with Jumps, only some creators are currently able to add them to their posts.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-06-22 04:09:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,集成,wikipedia,添加", "title": "Tiktok推出Tiktok跳转让创作者通过添加包括扫歌曲，维基百科，Quizlet，更多的选择合作伙伴的迷你应用程序集成来增强他们的视频 ", "title_en": "TikTok launches TikTok Jump to let creators enhance their videos by adding mini-app integrations from select partners including Whisk, Wikipedia, Quizlet, more", "transed": 1, "url": "https://www.engadget.com/tiktok-jump-182544466.html", "via": "", "real_tags": ["程序", "集成", "wikipedia", "添加"]}, {"category": "", "categoryclass": "", "imagename": "1fa4a4bd8702271002dad620da331438.jpg", "infoid": 1067277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日本电信公司Softbank已宣布他们是第一位，也许是第一个，也许是徕卡携带新智能手机的品牌。 Leitz 1，如您的父母，与您的父母一起，具有巨大的2000万像素，1英寸传感器，如此多的玻璃，磁性镜头盖。  Engadget报告称Leitz 1是一种重创的锐利Aquos R6，具有相同的Leica制造的传感器; 但是，物理设计似乎似乎是视觉差异，并根据规格技术的零售价约为664美元。 ", "note_en": "Japanese telecom company Softbank has announced they&#39;ll be the first, and perhaps only, brand to carry a new smartphone from Leica. The  Leitz 1, as you&#39;d expect from its parentage, has a massive 20-megapixel, 1-inch sensor and so much glass that it comes with a magnetic lens cap.\n            Engadget reports that the Leitz 1 is a rebranded Sharp Aquos R6, which has the identical Leica-made sensor; however, there do appear to be visual differences in the physical design, and according to  Specs-Tech the R6 retails for about USD $664.", "posttime": "2021-06-22 04:09:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,镜头,lens,传感器", "title": "Leica正在推出智能手机，带镜头和磁性镜头盖 ", "title_en": "Leica Is Launching a Smartphone, with a Lens and Magnetic Lens Cap", "transed": 1, "url": "https://www.core77.com/posts/109217/Leica-is-Launching-a-Smartphone-With-a-Massive-Lens-and-Magnetic-Lens-Cap", "via": "", "real_tags": ["手机", "镜头", "lens", "传感器"]}, {"category": "", "categoryclass": "", "imagename": "1bdd0419bc9746cad6b18131c00d3d21.png", "infoid": 1067276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在堆中，我们使用Apache Spark来为我们的堆连接产品供电。我们的系统的这一部分是任务的，迅速移动大量数据和我们的客户＆＃39;仓库。使用Spark使我们能够轻松扩展我们的数据处理以支持我们最大的客户，并且我们还会出于over基于列的文件格式的开箱支持。\n 这篇博文界面涵盖了我们必须解决的第一个性能障碍之一。我们的数据处理工作似乎挂在我们的一些客户。我们的根本原因分析确定了兽人文件读取器的Spark实现中的慢速。\n 意外的算法GOTCHA导致树处理算法执行指数运行。这意味着即使具有50个节点的微小树也可能导致算法无限期地实现。\n 幸运的是，我们设法在我们身边的问题上工作，而不根据火花来解决修复。在修复我们的直接生产问题后，我们也有助于解决火花。\n  我们的客户关心用户，活动（操作用户在网站或产品上采取）和会话。他们还关心过滤这些实体。例如，他们可能对“联合王国发生的所有事件的计数”感兴趣。\n   事实证明，表示这组谓词的非常自然的方式是用二叉树，如此：\n  叶节点表示单个过滤条件，如“Country = UK”。非叶节点表示在其子树上执行的操作。 AND节点表示“只匹配符合我左子子树中的条件的数据以及在我的右子树中”。一个或节点会类似，但匹配左或右子树，而不需要同时匹配两个子树。 \n我提到了早些时候的“有50个节点的树木”。有没有人真正想要将这么多的过滤器应用于他们的数据？导致此原因的标准情况是客户想要过滤事件：\n  在不引入基于阵列的过滤器的情况下，以直接的方式表达这一点，需要一个带有50个叶节点的树。\n  现在我们已经涵盖了树木如何进入图片，让我们讨论为什么处理它们需要这么多时间。\n 虽然代表过滤器作为树木是一个标准的做法，但没有单一，广泛接受的实现。因此，像Spark这样的大型项目可能需要支持和集成多个基于树的表示。在我们的情况下，一些调试指向朝向从Spark的内部树木滤波器转换为orc特定的算法\r searchargument。\n 由于两种格式不等效100％，因此转换必须检查输入树是否可以在实际尝试之前转换。这导致了这样的代码：\n  起初，这看起来很合理。但是，Cantransform和变换的方法含有几乎相同的逻辑。因此，在代码重用的精神中，实现了这一点：\n  仍然看起来很合理。但是，注意到次要，但非常重要的区别：我们正调用两次转换方法。 \n为什么这会非常重要？做某事两次而不是只有一次听起来是次优，但不应该真的那么糟糕。正确的...？\n  更加谨慎地表明我们不仅仅是“两次做某事”。相反，它更接近“两次做某事;然后再次，在这两个调用中的每一个中;然后再次，......“等等。也就是说，我们“两次做某事”，提升到H的力量（其中H是树的高度）。\n 让我们稍微正式看看。让我们召集转换高度H，F（H）树所需的操作数。然后：\n  或者，再次翻译成单词，转换函数的复杂性在被转换的树的高度中是指数的。\n 对于高度45的树，我们得到F（45）= 2 ^ 44 * F（1）= 17,592,186,044,416 * F（1）。\n 为简单起见，假设F（1）= 1.假设现代CPU每秒可以运行〜3亿次操作，这一无辜的树木转换将需要〜5800秒，或大约一个半小时。树中的每个附加层使得操作需要2倍。\n 此外，请注意，1.5小时只需将过滤器表达式从一个树格式转换为另一个树格式所需的时间。一次。在1.5小时内没有分析客户数据。那部分尚未开始。 \n值得注意的是，在花费这个时间。运行火花作业时，所有实际数据处理都由Spark Executors完成。因此，大多数标准监测和优化方法都在很大程度上专注于执行者性能。但在我们的情况下，在执行者绩效指标中的任何地方都没有任何东西出现。看起来官员一直只是闲置。\n 虽然火花执行器负责数据处理，但是Spark驱动程序是负责查询规划的组件。上面的指数算法是查询规划的一部分。因此，它的缓慢意味着火花司机从未成功地计划查询。因此，求助者没有工作才能拾取 - 因此，他们是怠速。\n  在引入问题时，我表示该算法是“树的大小的指数”。然而，我们更加仔细的分析表明它不是树的大小，而是，它在树的高度是它是指数的。我们可以使用该细节来构建一个解决方法。\n 在我们这样做之前，让我们看看我们如何用这么深的树木结束。如果你没有积极地试图避免它，那实际上很容易。在我们的情况下，我们有代码如下所示：\n  此代码非常容易读写。然而，给定长期的和奇特列表，它导致了严重倾斜的树木。\n 给定45＆＃34;国家= X＆＃34;，这种直接实现的结果导致一个深度45的树，它立即触发指数行为。这会导致作业卡在谓词转换步骤上。\n  幸运的是，在我们的具体用例中，非常深的树木总是具有相同的操作。例如，我们可以拥有一个具有上述45个或节点的树，或者使用45个和节点。但是，我们从未创建过45层深的树木，含有和或ors的混合。这种一致性使我们可以自由操纵树，而不担心意外地改变语义。 \n这是因为，由于关联性，我们可以组合和子条款，但是我们想要的。我们可以创建由和条款子集组成的子树，然后将它们合并在一起，从而保留结果。\n 这使我们可以创建具有不同形状的等效谓词树。从一系列元素构建平衡树是一个相对标准的树算法。使用它而不是重右歪斜的树，导致巨大的性能增益，具有多小时的性能（或从未完成更大的树）以取出秒。\n   将此更改部署到我们的生产作业使与此代码相关的所有性能问题消失。我们不需要等待Spark释放或叉码Base才能改变Spark内部，这对于我们速度进行修复而言。\n 但是，我们知道正确的事情是从火花中删除来自火花的指数算法，因此我们接下来解决了这一点。\n  我们贡献了在[Spark-27105] [SQL]中的指数复杂性进行了修复，以通过Ivanvergiliev·拉请求的兽人谓词转换中的兽人谓词转换＃24068·apache /火花。它包含在Spark 3.0释放（Spark Release 3.0.0 | Apache Spark）中。\n 避免指数行为的高级别思想或多或少地清除 -  Don＆＃39; T呼叫与＆＃34的相同方法;检查变形性和＃34;和＃34;执行转型＆＃34;通过不同的代码路径使两种不同的行动避免了＆＃34;两次做某事，递归和＃34;我们上面覆盖的问题。\n 获取可读和可维护的代码结构，每个人都很满意，但花了一点时间。在许多不同的迭代之后，并将思想与多个人合并，我们最终用了可读和表演的代码。 \n如果您喜欢用算法优化解决生产性能问题，并改善您＆＃39的底层工具;重新使用，我们正在招聘！ 了解有关我们工程团队的令人敬畏的人的更多信息。 ", "note_en": "At Heap, we use Apache Spark to power our  Heap Connect product. This part of our system is tasked with moving large amounts of data quickly to our customers&#39; warehouses. Using Spark allows us to easily scale up our data processing to support our largest customers, and we also get out-of-the-box support for column-based file formats like ORC.\n This blog post covers one of the first performance hurdles we had to solve. Our data processing job was seemingly hanging for some of our customers. Our root cause analysis identified a slowness in the Spark implementation of the ORC file reader.\n An unexpected algorithmic gotcha caused a tree-processing algorithm to perform an exponential number of operations. This meant that even a tiny tree with 50 nodes could cause the algorithm to effectively go on indefinitely.\n Luckily, we managed to work around the problem on our side without depending on Spark for a fix. After fixing our immediate production issue, we also contributed to a fix for Spark.\n  Our customers care about users, events (the actions users take on their website or product), and sessions. They also care about filtering these entities. For example, they might be interested in the “count of all events which happened in the United Kingdom.”\n   It turns out that a very natural way to represent this set of predicates is with a binary tree, like this one:\n  The leaf nodes represent individual filter conditions, like “country = UK”. Non-leaf nodes represent an operation performed on their subtrees. An AND node says “only match data that conforms to the conditions in my left subtree and in my right subtree”. An OR node would be similar, but matching either the left or right subtree without requiring both subtrees to match at the same time.\n I mentioned “trees with 50 nodes” earlier. Does anyone really want to apply that many filters to their data? A standard situation that causes this is if the customer wants to filter for events which:\n  Expressing this in a straightforward way, without introducing array-based filters, requires a tree with 50 leaf nodes.\n  Now that we’ve covered how trees come into the picture, let’s discuss why processing them can require so much time.\n Although it’s a standard practice to represent filters as trees, there’s no single, widely accepted implementation. Thus, a large project like Spark might need to support and integrate with multiple such tree-based representations. In our case, some debugging pointed us towards an algorithm for converting from Spark’s internal tree-based filter into an ORC-specific\r SearchArgument.\n Since the two formats are not 100% equivalent, the conversion had to check whether the input tree could be converted before actually attempting to do so. This resulted in code like this:\n  At first, this looked pretty reasonable. However, the methods  canTransform and  transform contain almost identical logic. Thus, in the spirit of code reuse, the implementation did this instead:\n  Still looking pretty reasonable. However, notice the minor, yet very important difference: we’re calling the  transform method twice.\n Why would that be very important? Doing something twice instead of only once sounds sub-optimal, but shouldn’t really be that bad. Right...?\n  A more careful look shows that we’re not simply “doing something twice”. Instead, it’s closer to “doing something twice; then twice again, in each of these two invocations; then twice again, ...” and so on. That is, we’re “doing something twice”, raised to the power of H (where H is the height of the tree).\n Let’s take a slightly more formal look. Let’s call the number of operations required to transform a tree of height H, f(H). Then:\n  Or, translated back into words again, the complexity of the transform function is exponential in the height of the tree being transformed.\n For a tree with height 45, we get f(45) = 2 ^ 44 * f(1) = 17,592,186,044,416 * f(1).\n For simplicity, let’s assume that f(1) = 1. Assuming a modern CPU can run ~3 billion operations per second, this innocent-looking tree transformation would take ~ 5800 seconds, or about an hour and a half. Each additional layer in the tree makes the operation take 2x longer.\n Also, notice that 1.5 hours is the time it takes us to simply transform a filter expression from one tree format into another. Once. No customer data was analyzed during that 1.5-hour period. That part is yet to begin.\n It’s also interesting to note where this time is being spent. When running a Spark job, all the actual data processing is done by Spark Executors. Thus, most of the standard monitoring and optimization approaches are largely focused on Executor performance. But in our case, nothing was showing up anywhere in the Executor performance metrics. It seemed like the Executors were just idling all the time.\n While Spark Executors are responsible for the data processing, the Spark Driver is the component responsible for query planning. The exponential algorithm above was part of query planning. Thus, its slowness meant that the Spark Driver never managed to successfully plan the query. Because of this, there was no work for the Executors to pick up — and, thus, they were idling.\n  When introducing the problem, I said the algorithm was “exponential in the size of the tree”. However, our more careful analysis reveals that it’s not in the  size of the tree, but rather, it’s in the  height of the tree that it’s exponential. We can use that detail to build a workaround.\n Before we do that, let’s see how we ended up with trees that are so deep. It’s actually very easy to do so if you’re not actively trying to avoid it. In our case, we had code that looked like this:\n  This code was very easy to read and write. However, given a long list of  andPredicates, it resulted in heavily skewed trees.\n Given a list of 45 &#34;country = X&#34;, this straightforward implementation results in a tree with depth 45 that immediately triggers the exponential behavior. This causes jobs to get stuck on the predicate conversion step.\n  Luckily, in our specific use-case, very deep trees always had the same operation. For example, we could have a tree with 45 OR nodes like the above, or with 45 AND nodes. However, we never created 45-layer-deep trees that had a mix of ANDs and ORs. This consistency allowed us to manipulate the tree freely, without worrying about accidentally changing the semantics.\n This is because, due to associativity, we can combine the AND sub-clauses however we want. We can create a subtree composed of a subset of the AND clauses, and then merge them together, thus preserving the result.\n This allowed us to create an equivalent predicate tree that had a different shape. Building a balanced tree from an array of elements is a relatively standard tree algorithm. Using that instead of the heavily right-skewed tree resulted in enormous performance gains, with the performance going from multiple hours (or never finishing, for larger tree) to taking seconds.\n   Deploying this change to our production jobs made all the performance issues related to this code go away. We didn&#39;t need to wait for a Spark release or fork the codebase in order to change Spark internals, which was great for our velocity in getting a fix out.\n However, we knew that the right thing to do was to remove the exponential algorithm from Spark altogether, so we tackled that next.\n  We contributed a fix for the exponential complexity to Spark in  [SPARK-27105][SQL] Optimize away exponential complexity in ORC predicate conversion by IvanVergiliev · Pull Request #24068 · apache/spark. It was included in the Spark 3.0 release  ( Spark Release 3.0.0 | Apache Spark ).\n The high-level idea for avoiding the exponential behavior completely was more or less clear —  don&#39;t call into the same method for &#34;checking for transformability&#34; and &#34;performing the transformation&#34;. Making the two different actions go through different code paths avoids the &#34;doing something twice, recursively&#34; problem we covered above.\n Getting to a code structure that is readable and maintainable and everyone is happy with took a bit longer though. After a number of different iterations, and incorporating ideas from multiple people, we ended up with code that is both readable and performant.\n If you like to solve production performance issues with algorithmic optimizations, and to improve the underlying tools you&#39;re using,  we are hiring! Learn more about the awesome people on  our Engineering team.", "posttime": "2021-06-22 04:09:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "幂态,exponential,spark", "title": "意外的幂态行为 ", "title_en": "Accidentally Exponential Behavior in Spark", "transed": 1, "url": "https://heap.io/blog/accidentally-exponential-behavior-in-spark", "via": "", "real_tags": ["幂态", "spark"]}, {"category": "", "categoryclass": "", "imagename": "121652f9d0481bd4974cc470235d85bd.jpeg", "infoid": 1067274, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在其苏格兰仓库之一调查后，亚马逊被称为“淫秽”建议在线零售巨头每年摧毁数百万物品。\n ITV新闻发现，包括智能电视，笔记本电脑，无人机，吹风机和成千上万的密封面罩，包括在Dunfermline的亚马逊Fulfillment Center的盒子中分类为数千种密封面罩。\n 该网站的一个前雇员是英国的24个这样的仓库之一，表示他们的“目标是每周摧毁130,000个项目”。\n 匿名工作者补充说：“我曾经喘气。被摧毁的东西没有押韵或理由：戴冬粉丝，奥森，偶尔的MacBook和iPad;前几天，20,000个Covid（脸部）面具仍在他们的包装中。\n “总的来说，50％的物品未被打开，仍处于收缩包装。另一半是回报，状况良好。“\n 该调查还发现了一个泄露的文件，该文件显示，在4月份的一周内，超过124,000件物品被标记为“摧毁” - 与标有“捐赠”的同一时期中只有28,000个项目相比。\n  然而，Amazon发言人告诉PA新闻机构，虽然调查遵循垃圾填埋场的卡车，但没有任何物品被处理。 \n来自亚马逊的一份声明说：“我们正在努力实现零产品处置的目标，我们的优先事项是转售，捐赠给慈善组织或回收任何未售出的产品。\n “没有物品在英国垃圾填埋场。作为最后的手段，我们会将物品发送到能量恢复，但我们正在努力推动它发生在零的次数。\n “我们致力于减少我们的环境足迹，并建立一个循环经济计划，目的是减少回报，重新使用和转售产品，减少处理。”\n 能量回收是在剩余物体重新转换成能量之前从产品中剥离可回收材料并通过国家网格。\n 但发言人保持这是公司的最后一个手段 - 也否认处理物品更便宜，而不是将它们返回到国内卖家。\n 您的贡献将有助于我们继续提供对您很重要的故事\n   现在支持我们 \nMark Ruskell，苏格兰格林环境发言人和苏格兰议会（MSP）的中苏格兰和苏格兰（MSP），说：“亚马逊的净利润在这场危机期间飙升，而许多人则努力使其结束会议。  “因此，这种多亿万的公司认为将未使用的物品放在垃圾箱中比帮助人们更有利可图。  “这是对我们经济的局部起诉，以至于在人们的需求面前放弃了一次性文化。 即使它不反映更广泛的亚马逊政策，公司也必须回答为什么Dunfermline仓库具有如此高的浪费等，这么少的是转售或给予慈善机构。  “这种令人震惊的启示展示，政府必须做更多的是强迫公司设计浪费，并在他们未能做正确的事情的情况下进行制定和罚款。” ", "note_en": "AMAZON HAS BEEN branded as “obscene” after an investigation at one of its Scottish warehouses suggested the online retail giant is destroying millions of items every year.\n ITV News found that items, including smart TVs, laptops, drones, hairdryers and thousands of sealed face masks, were sorted into boxes marked “destroy” at the Amazon Fulfilment Centre in Dunfermline.\n One ex-employee at the site, one of 24 such warehouses across the UK, said their “target was to generally destroy 130,000 items a week”.\n The anonymous worker added: “I used to gasp. There’s no rhyme or reason to what gets destroyed: Dyson fans, Hoovers, the occasional MacBook and iPad; the other day, 20,000 Covid (face) masks still in their wrappers.\n “Overall, 50% of all items are unopened and still in their shrink wrap. The other half are returns and in good condition.”\n The investigation also found a leaked document which showed that more than 124,000 items were marked “destroy” during one week in April – compared to just 28,000 items in the same period labelled “donate”.\n  However, an Amazon spokesman told the PA news agency that while the investigation followed lorries to a landfill site, no items are disposed of in that way.\n   A statement from Amazon said: “We are working towards a goal of zero product disposal and our priority is to resell, donate to charitable organisations or recycle any unsold products.\n “No items are sent to landfill in the UK. As a last resort, we will send items to energy recovery, but we’re working hard to drive the number of times this happens down to zero.\n “We are committed to reducing our environmental footprint and building a circular economy programme with the aim of reducing returns, reusing and reselling products, and reducing disposals.”\n Energy recovery is when recyclable materials are stripped from products before the rest is reconverted into energy and put through the national grid.\n But the spokesman maintained this was a last resort for the company – and also denied it was cheaper to dispose of the items instead of returning them to the domestic sellers.\n Your  contributions will help us continue to deliver the stories that are important to you\n   Support us now\n  Mark Ruskell, Scottish Greens environment spokesman and Mid Scotland and Fife Member of Scottish Parliament (MSP), said: “Amazon’s net profit has soared during this crisis while many people have struggled to make ends meet.\n “It’s therefore obscene that this multi-billion corporation finds it more profitable to put unused items in the bin than help people out.\n “It is a damning indictment of our economy that the throwaway culture is put before people’s needs. Even if it is not reflective of wider Amazon policy, the company must answer for why the Dunfermline warehouse has such high levels of waste and so little is resold or given to charities.\n “This shocking revelation shows that governments must do more to force companies to design waste out of their systems, with regulation and fines where they are failing to do the right thing.”", "posttime": "2021-06-22 04:03:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,标记,items,苏格兰", "title": "亚马逊仓库中有数百万个新物品标记为“毁灭” ", "title_en": "Millions of new items in Amazon warehouse marked 'destroy'", "transed": 1, "url": "https://www.thejournal.ie/amazon-investigation-finds-items-marked-destroy-5472781-Jun2021/", "via": "", "real_tags": ["amazon", "亚马逊", "标记", "items", "苏格兰"]}, {"category": "", "categoryclass": "", "imagename": "6161a22e974497d54d9697f37ff8b4dc.jpg", "infoid": 1067273, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ubco的英雄产品，Ubco 2x2，是一款全轮驱动电动摩托车，看起来像泥土自行车，但像摩托车一样骑行。作为农民解决牧场和农场的解决方案的是什么，安全，快速扩大到包括普通舰队企业客户，演出经济工人和城市车手的城市版本的城市版本。\n 自2015年成立以来，该公司已制作了两辆145磅磅的公用事业自行车：工作自行车，原来的越野车和冒险自行车，这是为城市骑行而制造的新版本，但可以自我处理路。\n  现在，Ubco从七个高峰风险投入，Nuance Capital和TPK控股的赛中获得了新鲜的现金输液，希望继续扩展到现有的垂直，如食品交付，邮政服务和最后一英里物流。该公司已经在新西兰和英国的多米诺州合作，以及一系列其他国家客户，如新西兰邮政，国防部队，保护部门和Pāmu，或Landcorp农业有限公司和其他当地餐馆商店。\n “我们在新西兰拥有一个强大的企业市场，并在国际上制定了强大的销售管道，”蒂莫西·艾伦，首席执行官和联合创始人告诉TechCrunch。\n 虽然目前大多数UBCO的直接消费者销售额弥补了大多数乌布的收入，但该公司正在积极推进企业，更具体地，更具体地，认购服务。 2x2建在一个智能平台上，包括车辆和电力系统，云连接和数据分析，这使得订阅模型能够与车队管理系统一起工作。\n 由于它推动通过订阅将其年度经常性收入增加，UBCO预计收入从2020年的2020美元攀升至2020年的2020美元至840万美元。 Ubco的订阅模式，每周花费约50美元到60美元（75美元至85美元），在新西兰，澳大利亚，英国，欧洲和美国今年正在推出202年，并进入202年。消费者将获得访问权限根据该公司的发言人，根据未来几个月内的订阅。\n Allan认为订阅作为EV行业的未来，不仅是因为它允许很高的盈利机会，而且还因为它更加环保可持续。由于公司扩大了其业务模式的这一部分，希望引领循环经济空间。 \n该公司预测车辆通过订阅模式的运行将具有四次预期寿命，因为与燃烧车辆相比，总体销售的碳总体较少80％。\n “订阅意味着我们拥有车辆，所以我们管理生命周期，”Allan说。 “所以第一生命开始于高强度，这可能是披萨的6万公里，或者在农场上可能是30,000公里，这同样困难地出于不同的原因。然后，该车辆将缩小到较低的强度应用。之后，然后可以拔出电池，可能进入被动太阳能存储器或类似的东西。“\n 艾伦认为解决了生活终结问题作为个人和专业挑战，一个带有创造力的房间，因为没有人完全弄清楚正确的方式。他说，当它以允许更容易回收的方式到达车辆的工程时，他采取了自下而上的方法。\n “就像当你设计电池时，他妈的把阻燃泡沫放入其中，因为你不能在生活结束时得到它，”他说。 “所以它从正确的标签开始，工程意图，以便您为此类型的装配设计，然后您的业务或商业系统需要支持该概念。现在，我们有优势，因为经济学和激励措施是对齐的，并与新西兰的产品管理立法一致。“\n 试图通过电力汽车完善循环经济不仅仅是对环境做正确的事情。 Allan认为它将成为一个聪明的商业决定，一个将在客户中绘制，并将公司与企业客户提供竞争优势。\n “这是你作为客户的旅程的一部分，”艾伦说。 “如果我们可以以这样的方式设计订阅的订阅和车辆的生命，那就是我们从中驾驶的地方。大多数人都想做正确的事情，我们可以提供逻辑上适合经济学的东西，可以在规模上完成，可以全面管理。“ ", "note_en": "Ubco’s hero product, the Ubco 2X2, is an all-wheel drive electric motorbike that looks like a dirt bike but rides like a moped. What began as a solution for farmers to get around pastures and farms easily, safely and quickly has expanded to include an urban version of the bike that caters to fleet enterprise customers, gig economy workers and city riders.\n Since its founding in 2015, the company has produced two versions of its 145-pound utility bike: The Work Bike, the original off-road vehicle, and the Adventure Bike, the newer version that’s made for city riding but can handle itself off-road.\n  Now that Ubco’s got a fresh cash infusion from the round led by Seven Peak Ventures, Nuance Capital and TPK Holdings, it hopes to continue expanding into existing verticals, like food delivery, postal service and last-mile logistics. The company already works with Domino’s in New Zealand and the United Kingdom, as well as a range of other national clients, like the New Zealand Post, the Defense Force, the Department of Conservation and Pāmu, or Landcorp Farming Limited and other local restaurants and stores.\n “We have a strong enterprise market in New Zealand and have developed a strong pipeline of sales internationally,” Timothy Allan, CEO and co-founder, told TechCrunch.\n While direct consumer sales make up for most of Ubco’s revenue at present, the company is pushing aggressively into enterprise, and more specifically, subscription services. The 2X2 is built on an intelligent platform that includes vehicle and power systems, cloud connectivity and data analysis, which enables the subscription model to work alongside fleet management systems.\n Ubco expects revenue to climb from $2.1 million in 2020 to $8.4 million by the end of 2021 as it pushes to increase its annual recurring revenue through subscriptions. Ubco’s subscription model, which costs about $50 to $60 per week ($75 to $85 NZD) for fleet enterprise customers, is being rolled out in New Zealand, Australia, the U.K., Europe and the U.S. this year and into 202. Consumers will get access to the subscriptions as well within the next couple of months, according to a spokesperson for the company.\n Allan sees subscriptions as the future of the EV industry, not just because it allows for a high chance of profitability, but also because it’s far more environmentally sustainable. As the company expands this part of its business model, it hopes to lead the circular economy space.\n The company predicts that vehicles run through the subscription model will have four times the life expectancy as those sold outright and produce 80% less carbon overall compared to a combustion vehicle.\n “Subscription means we own the vehicle, so we manage the lifecycle,” said Allan. “So the first life starts at high intensity, and that might be 60,000 kilometers delivering pizza, or it might be 30,000 kilometers on a farm, which are equally hard for different reasons. Then after, that vehicle will go down to a lower intensity application. After that the battery can then be pulled out, and that might go into passive solar storage or something like that.”\n Allan sees solving the end-of-life issue as a personal and professional challenge, one with room for creativity since no one has fully figured out the correct way of doing it. He says he takes a bottom up approach when it comes to the engineering of the vehicle in a way that allows for easier recycling.\n “Like when you design a battery, fuck putting fire retardant foam into it because you can’t get it back at the end of life,” he said. “So it starts with correctly labeling, engineering with intent so that you’re designing for this type of assembly, and then your business or commercial system needs to support the concept. Now, we’ve got the advantage because the economics and incentives are aligned, and that all aligns with New Zealand’s product stewardship legislation.”\n Trying to perfect the circular economy through utility vehicles isn’t just about doing what’s right for the environment. Allan thinks it’ll be a smart business decision in the end, one that will draw in customers and give the company a competitive edge with enterprise clients.\n “This is a part of your journey with us as a customer,” said Allan. “If we can design subscriptions and the life of the vehicle in such a way that you feel good about it, that’s where we’re driving from. Most people want to do the right thing, and we can provide something that logically fits the economics, can be done at scale and can be managed holistically.”", "posttime": "2021-06-22 03:27:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "全球,fund,车辆", "title": "电动汽车自行车启动Ubco提高了1000万美元的资助其全球扩张 ", "title_en": "\n\t\t\t\tElectric utility bike startup Ubco raises $10 million to fund its global expansion\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/electric-utility-bike-startup-ubco-raises-10-million-to-fund-its-global-expansion/", "via": "", "real_tags": ["全球", "fund", "车辆"]}, {"category": "", "categoryclass": "", "imagename": "a90d59b8197943fb8455f9c9d98d34d4.jpg", "infoid": 1067272, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代表吉姆乔丹（R-OH）呼吁微软将与其他大型技术平台相同的反托拉斯审理，周一至公司的一封信。\n 在这封信中，乔丹要求微软总统布拉德史密斯如果他认为公司将受到本月早些时候在房子里引入的反托拉斯法案的影响。总共有五项账单，跨越为反托拉斯强制提供更多资金，以禁止购买小型竞争对手的大型技术平台。\n 反垄断套件迅速调查亚马逊，苹果，Facebook和谷歌。这些措施侧重于这四家公司的反复竞争行为，并不清楚他们如何影响像微软这样的其他大型公司。虽然Microsoft符合这些账单下的标准被视为“覆盖平台”，但与满足超过6000亿美元的市场上限和5000万月的每月活跃用户一样，但该法案不针对公司的特定业务。\n  “大型技术，包括Microsoft，Inc。，是为了获得保守派，”Jordan在他周一的信中说道。 “目前尚不清楚为什么微软避免了众议院民主党人的重大关注。”\n 明确地，微软将面临相同的拟议标准，如获取公司，如承担验证的负担，并使用户更多的数据更具便携式和可用于其他平台。但是，虽然亚马逊和苹果将面临更具结构性的变化，就像卖掉单独的业务线一样，微软可能不会受到规则的影响。\n 约旦的信，也指出了几个例子，他据称微软偏向保守派，因为裂谷在众议议上的房屋共和党核心核心中越来越多。虽然所有五个账单都被共和党和民主党的共同赞助商引入，但并非所有共和党人都在船上。华尔街日报上周报道，少数民族领导人凯文麦卡锡（R-CA）不支持账单。\n 乔丹似乎反对措施，选择对Tech采取不同的行动，例如改革沟通十分症的第230条，追随据称审查保守讲话的平台。 \n“民主党的弹劾管理人员不关心保守的审查。 他们的下一个大使？ Empower Big Tech和Big政府使其变得更糟，“Jordan上周在推文中说。  代表肯加斯（R-Co），房屋顶级共和党院副位置，叫做Jordan对Twitter的批评，说：“使用反垄断法律阻止大型技术的不良行为不是大政府，这是执法， “巴克说。  房子司法委员会计划在周三标记包裹。 目前尚不清楚每个成员如何投票。 本月早些时候，Rupert Murdoch的Lobbyists媒体公司，包括福克斯公司和新闻公司，敦促家庭共和党人投票赞成票据。 在上周五的展会上，福克斯新闻主持人Tucker Carlson还敦促立法者批准账单。  “科技垄断实际上是对该国的威胁，”卡尔森说。 “如果你关心民主，你需要分手垄断。” ", "note_en": "Rep. Jim Jordan (R-OH) is calling on Microsoft to face the same antitrust scrutiny as other large tech platforms in a letter to the company Monday.\n In the letter, Jordan asks Microsoft president Brad Smith if he believes the company would be affected by the swath of antitrust bills introduced in the House earlier this month. There are five bills in total, spanning from offering up more money for antitrust enforcers to banning large tech platforms from buying up small competitors.\n The antitrust package came out of a yearslong investigation into Amazon, Apple, Facebook, and Google. The measures focus on the anticompetitive behaviors of these four companies, and it’s not as clear how they would affect other large companies like Microsoft. While Microsoft meets the standard laid out under these bills to be considered a “covered platform,” like meeting the over $600 billion market cap and 50 million monthly active users, the bills don’t target the company’s specific lines of business.\n  “Big Tech, including Microsoft, Inc., is out to get conservatives,” Jordan said in his Monday letter. “It is unclear why Microsoft has avoided significant attention from House Democrats.”\n Assumably, Microsoft would face the same proposed standards in acquiring companies, like taking on the burden of proof, and making the data it takes from users more portable and usable on other platforms. But whereas Amazon and Apple would face more structural changes, like selling off separate lines of business, Microsoft would likely not be subject to the rules.\n Jordan’s letter, which also pointed out several instances he purports as Microsoft being biased against conservatives, comes as a rift is growing among the House Republican caucus over the package. While all five bills were introduced with Republican and Democrat co-sponsors, not all Republicans are on board.   The Wall Street Journal  reported last week that House Minority Leader Kevin McCarthy (R-CA) did not support the bills.\n Jordan also seems to oppose the measures, opting to take different action against tech, like reforming Section 230 of the Communications Decency Act, to go after platforms that allegedly censor conservative speech.\n “Democrat impeachment managers don’t care about conservative censorship. Their next big mission? Empower Big Tech and Big Government to make it worse,” Jordan said in a tweet last week.\n Rep. Ken Buck (R-CO), the top Republican on the House antitrust subcommittee, called Jordan out over his criticism on Twitter, saying, “Using antitrust laws to stop Big Tech’s bad behavior isn’t Big Government, it’s law enforcement,” Buck said.\n The House Judiciary Committee plans to mark up the package on Wednesday. It’s unclear how every member plans to vote. Earlier this month, lobbyists for Rupert Murdoch’s media companies, including Fox Corp. and News Corp., were urging House Republicans to vote in favor of the bills.  On his show last Friday,  Fox News host Tucker Carlson also urged lawmakers to approve the bills.\n “The tech monopolies are actually a threat to the country,” Carlson said. “If you care about democracy, you need to break up the monopolies.”", "posttime": "2021-06-22 03:21:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,微软,microsoft,rust,面对", "title": "共和党人说，微软应该面对与Facebook相同的反垄断审查 ", "title_en": "Microsoft Should Face the Same Antitrust Scrutiny as Facebook, Republican Says", "transed": 1, "url": "https://www.theverge.com/2021/6/21/22543973/microsoft-apple-amazon-google-facebook-jim-jordan-republicans-antitrust", "via": "", "real_tags": ["facebook", "微软", "microsoft", "rust", "面对"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067271, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "资料来源：Kingslake，Rudolf，1974年，＆＃34;罗切斯特相机和镜头公司＆＃34 ;,\r 罗切斯特纽约，摄影历史学会。\n      这是一个跨越近100年的最复杂的故事，我发现它经常\r 难以发现实际发生了什么，并解决了许多变化\r 在罗切斯特继续进行的公司的名称和收购，以及公司的组合，\r 特别是在1890年至1905年期间。通常会形成小公司\r 来自另一家公司的员工，并且通常他们会失败，他们的资产将是\r 由同一个或另一家公司吸收。公司也会经常\r 重组大资本和一套新的官员，通常是不同的名称，\r 并且很难决定它们是否是相同的或不同的公司。伊士曼特别善于收购公司和\r 然后让它在旧名称下运营多年，经常在其产品上标记\r ＆＃34;伊士曼柯达公司，继任者...＆＃34;甚至找到公司的地址\r 没有真正的有关所有权，因为通常三个或更多公司会占用相同的\r 建造。\n  我必须这一点承认我从唐里昂收到的伟大帮助\r 整理各种公司和个性以及所有权变更，以及\r 特别是让我访问他的巨大记录和文件。他真的应该是\r 给这个谈话而不是我。我从城市获得了大部分信息\r 目录，以及来自乔治·伊斯特曼家的目录文件。虽然我发现了\r 很多关于罗切斯特的众多光学和相机公司，我的记录很远\r 从完整的完整，毫无疑问，多年来继续找出有趣的事实\r 来。如果有人在我的故事中检测到错误，我希望他们能指出它，这样我就可以了\r 就它而言，让一切都正确。\n  我非常意识到我应该在中心之前开始这项研究\r 罗切斯特被撕成碎片，为内循环和城市更新腾出空间\r 项目。有些街道完全消失了，许多人改变了他们的名字，老了\r 建筑物已经被撕裂，为停车场腾出空间，往往是无望的\r 了解公司实际位置的地方。这个问题已经渲染更多\r 由1899年和1911年发生的街道重新卷积困难。\n  我故意省略主要用于制造电影的公司，\r 印刷纸，板夹等，更尤其是光学公司\r 多年来，只制作眼镜，这在罗切斯特一直是一个非常活跃的业务。\r 因此，我已经遗忘了弛豫，后卫和甚至施乐等公司的参考！这\r 两家大公司，百士和LOMB和柯达彼此相似明显＆＃39; s\r 活动，历史学家可以分别考虑它们，就像我一样\r 完毕。各种相机公司主要以某种方式与柯达有关，而且\r 镜头和快门公司主要与Bausch和Lomb相连。有过\r 当然，例外情况，正如我们所看到的那样。还有几家公司\r 没有与这些巨人中的任何一个联系。\n      罗切斯特的光学光学行业于1880年出生。在那年份，鲍斯克和兰姆\r 开始制作摄影镜片;罗切斯特\r 光学公司开始制作相机;和乔治\r 伊斯曼开始制造板块。但是，我的故事实际上在1853年开始时开始了\r J. Bausch创立了他微小的景观业务，围绕徒劳地等待客户。\n  John Jacob Bausch出生于德国德国的总苏森，贫困家庭，是\r 为贴身制造商学徒。在20岁时，在1850年，他决定移民到\r 美国，在帆船船上的一个令人痛苦的49天之旅后，落在纽约。他\r 前往水牛，那里有一个霍乱疫情，并且在尝试不成功后\r 为了找到工作，他搬到了罗切斯特，他再次在哪里有最大的困难\r 任何有效的就业。他终于在23岁时决定建立一个配镜师＆＃39; s商店\r reynolds街机以＆＃34; j的名义。 J. Bausch，Optician＆＃34;当时\r 在这个国家几乎没有人使用过眼镜，很多人甚至从未见过\r 对，所以他的销售差不多了。 1856年，他的贸易卡显示，他的商店被召唤\r ＆＃34; j。 J. Bausch光学学院。＆＃34; \n在他无尽的斗争中寻找工作，甚至生存，鲍斯克得到了极大的帮助\r 一位机柜制造商亨利·伦马尔先生，他可能在转舍林俱乐部见面。 lomb是\r 出生于1828年，并于1849年从德国移民。他是一个学士学位，1853年\r 决定加入Bausch，在那里他继续学习配镜师＆＃39;贸易，并提出\r Bausch家族，转向他们的收入。在内战的爆发，\r LOMB立即招募，最后升到了船长的等级。他回到了\r 罗切斯特于1863年，在次年内，该公司成为＆＃34; Bausch和Lomb，\r 配镜师。＆＃34;然后，业务有所改善，他们可以打开工厂\r 在安德鲁斯和水街的拐角处。 Henry Lomb 1865年结婚，在\r 次年搬到了纽约，并在那里充当坚定的销售代理。他于190年代去世，\r 因为他很多公民活动，特别是他对此的兴趣\r 罗切斯特理工学院，一个英俊的纪念轴在他的记忆中被竖立起来\r 1932年在罗切斯特。顺便提一下，该公司的名称已更改为\r ＆＃34;铜矿光学仪器公司＆＃34;从1866年到1876年，就像这种材料一样\r 广泛用于制作眼镜框架。这个名字被改变回来了\r ＆＃34; Bausch和Lomb光学公司＆＃34; 1876年。第二次世界大战后它变成了\r ＆＃34; Bausch和Lomb Inc。＆＃34;\n  在内战之后，对眼镜的兴趣迅速上升，公司建造\r 1868年在河流和水街上进行了扩大的工厂，六年后六年后\r 甚至在圣保罗街的当前楼层甚至更大的建筑物，日期为1874年\r 雕刻在门上。在第一次世界大战期间，他们在前面添加了一个大型建筑物\r 旧的。我们现在被告知公司计划放弃整个机构\r 并进入北古德曼街的旧邦德服装建筑。\n  返回到1875;在Bausch＆＃39的催促在Edward Edward，该公司决定\r 分为光学仪器，从显微镜开始，有一个\r 需求不断增长。要开始，他们聘请了一个名为Ernst Gundlach的气质角色，他先前在柏林制造了显微镜，然后是\r 生活在新泽西州的Hackensack。从1876年由Bausch和Lomb雇用Gundlach至\r 1878年，但它们经常争吵，最后分开。然而，显微镜工作，\r 在Edward Bausch＆＃39的方向上成功进行，并在1903年销售了\r 44,000名工具。\n  Bausch和Lomb在1883年向他们的线条添加了摄影镜头，并开始了\r 1888年的百叶窗制造。1892年，他们成为美国唯一许可的公司\r 制作蔡司Anastigmats和其他镜头。他们还制作了化合物和豆类百叶窗\r 与Deckel的协议。这些安排终于终止了第一次世界大战。\n  大约1903年的统计数据令人印象深刻。那时鲍斯克和兰姆正在制作大约20个\r 一年百万景观镜片，并制造了500,000张照片镜片和\r 550,000个百叶窗。如您所知，该公司仍然存在于几个分支机构\r 其他城市和国外，制作广泛的光学和电子产品\r 最好的质量。\n      我已经提到过那个困难的个人，在1878年离开鲍姆斯和LONG的人留下了一些情感。他的地址\r 那个时候是171个圣保罗街，而Bausch和Lomb在179号，所以他住了\r 实际上隔壁到工厂。 1879年，Gundlach由Lewis R. Sexton加入，\r 他们在家里设立并运营了一个光学商品，而且\r 塞克斯顿作为7学校的老师翻了一番，后来成为学校的校长17和\r 然后学校9.确定光学业务很好，Gundlach\r 搬到康涅狄格州哈特福德。，在1880年，他在未来四年内生活，给他\r 职业为＆＃34;配镜师。＆＃34;次年塞克斯顿移动了光学\r 建立到29个石头街道，他被另外两个眼镜师，J. C. Reich加入\r 和J. Zellweger。在1883年的罗切斯特目录中，他被列为＆＃34;恩斯特的经销商\r Gundlach＆＃39; Sicroscopes和目标。＆＃34;\n  Lewis R. Sexton于1884年8月去世后脱离光学，而Gundlach\r 立即回到罗切斯特。他在29个石头街道重组了这项业务\r ＆＃34; Gundlach光学公司＆＃34;与他自己，Reich，Zellweger和H. H. Turner，A\r 机械师，作为官员。他们声称他们的广告＆＃34;唯一的制造商\r E. Gundlach＆＃39; Sicroscopes和目标。＆＃34;在未来八年内公司\r 占用了几个不同的地方，最后在1892年在761南克林顿结束\r 大道，他们留在1930年的1930年。在1889年，Gundlach被他加入了\r 儿子卡尔多年来和他住在一起。 \nWarning: Can only detect less than 5000 characters\n来自Bausch和Lomb的下一个分支是inlex。 1910年\r 两个伯斯和LOMB快门设计师名为Rudolph Klein和Theodor Brueck（后者\r 设计了＆＃34;蜗壳＆＃34;快门于1902年发明了革命性的和\r 极其重要的快门延迟机构涉及旋转齿轮和摇摆托盘\r （美国专利号1,092,110）。该设备是第一次启用快门进行\r 将独立于温度和其他大气条件准确。\n  Klein和Brueck决定离开Bausch和Lomb并设立自己的业务，\r 被称为＆＃34; XL制造公司＆＃34 ;,制造新的快门。他们\r 由名为Morris Rosenbloom的批发珠宝商在经济上辅导，他们设置了\r 他们的第一个工厂在156个主要街道的街道上。但是，他们很快被发现了\r 那个C. P. Goerz也在制作一条所谓的＆＃34; x Excel L＆＃34;百叶窗，所以\r 避免混乱，他们扭曲了周围的字母并更名为他们的快门\r ＆＃34; inlex，＆＃34; 1911年，该公司被称为Ilex制造公司。非常\r 不久之后，慕尼黑的弗里德里希·德克尔允许允许他们的延迟机制\r 在着名的＆＃34线上的皇室基础; Compur＆＃34;百叶窗，被证明是一个\r 对iLex相当大的财务帮助。\n  从1912年到1916年公司，现在称为Ilex光学公司，占用空间\r 南克林顿大道761号的Gundlach建筑; 1917年他们\r 搬到了724个波特兰大道，最终在1930年到690波特兰，在那里\r 今天。 1921年，他们尝试在814圣的单独镜头厂进行实验。\r 保罗街称＆＃34; acme光学公司，＆＃34;但它只持续了几个\r 年。\n  Ilex公司的主要贡献之一是一个发明的发明\r 第二次世界大战期间自包含的内部闪光同步机制。这是\r 由Alfred Schwartz设计，当然，这个想法已被纳入所有人\r 自那时以来所有制造商的百叶窗。\n  多年来，伊斯克斯遭遇了许多繁荣的起伏。第一任总统，\r Morris Rosenbloom于1935年去世，并由他的儿子Rufus成功作为总裁兼E. C.\r 罗兰担任副总统。罗兰于1942年去世，并在战争之后公司＆＃39;幸运\r 沉到低潮中。最后，1963年，他们的剩余资产是由两名年轻聪明员工，尤金米勒和曼努埃尔基尔收购的，今天是公司\r 蓬勃发展，超过200名员工，并不得不增加工厂空间以跟上\r 随着其产品的需求。\n      谈到伊利克让我想起了埃格雷。埃尔格特光学公司\r 由三名年轻人创立，他们是童年的朋友：Mortimer A.伦敦，然后是一个\r 柯达的镜头检查员，大卫L. Goldstein和\r 伊尔克斯的Peter Terbuska。 （坚定的名字是L，G.和T）的首字母缩略词。 1946年他们开始了\r 通过租赁一些机床制作镜头抛光机械，并与之设置\r 在大西洋大道阁楼购物，他们自己做了所有自己的镜头制造，包装，\r 和卖。\n  到1952年，该公司已经长大地长大，使他们能够购买前衣服\r 植物在838史密斯街。当时，Goldstein是总裁，Terbuska曾秘书，\r 和伦敦财务主管。公司繁荣昌盛，员工近300人\r 为小型电影摄像机制造成千上万的镜头以及许多其他应用。 \n伦敦于1960年离开，1962年，该公司拥有古代的所有权\r 在慕尼黑建立Steinheil，但他们很快卖掉了这一点，我相信勒吉勒尔斯。\r 1964年，在股票持有人和第39次会议上存在困难，并将该公司重组\r 与阿尔弗雷德沃森担任总统。两年后，公司的资产被收购\r 由Mati（管理和科技公司），同时获得特纳波纹管。\r Mati在1969年才幸存下来，当他们消失了。 goldstein购买了剩下的\r 前Gundlach制造公司的资产\r 并重组它根据名称＆＃34;动态光学公司纳入，＆＃34;但这也是如此\r 1972年停止运营。\n      这么多Bausch和Lomb和他们的女儿\r 公司。我们现在将注意到William H发起的相机业务。\r 步行者在1880年来到罗切斯特并设置为＆＃34; wm。 H. Walker和Company＆＃34 ;,\r 在79街。 （他一定与詹姆斯T.帕尔布拉拉的沃克犬\r Takiv相机十年后）。 1882年，沃克与W. H. Reid和J. Inglis一起加入\r 制造干式盘子，凝块持续几年的企业。在1883年的沃克放弃了\r 制作摄像头，和罗切斯特光学公司＆＃34;由W. F.建立\r 卡尔顿接管他的资产。同时，1884年1月，沃克加入伊斯曼制作伊斯曼沃克滚筒持有人，以及\r 次年后，他成为伊斯特曼干板和电影公司的秘书。不久\r 在此之后，他被送往英格兰作为伊斯特曼＆＃39;在该国的代表。\n  新的罗切斯特光学公司是洛卡\n...... ", "note_en": "Source: Kingslake, Rudolf, 1974, &#34; The Rochester Camera and Lens Companies&#34;,\r Rochester NY, Photographic Historical Society.\n      This is a most complicated story spanning almost 100 years, and I find that it is often\r difficult to discover what actually did happen, and to sort out the numerous changes of\r name, and acquisitions, and combinations of companies that went on in Rochester,\r especially during the period from 1890 to 1905. Small companies would be formed, often by\r employees from another company, and as often they would fail and their assets would be\r absorbed by the same or by another company. Companies, too, would be frequently\r reorganized with larger capital and a new set of officers, with often a different name,\r and it is hard to decide whether they are the same or a different company.  Eastman was particularly good at acquiring a company and\r then letting it operate for years under its old name, often marking on its products\r &#34;Eastman Kodak Company, successor to ...&#34; Even locating the address of a company\r is no real clue to ownership because often three or more companies would occupy the same\r building.\n  I must at this point acknowledge the great assistance I have received from Don Lyon in\r sorting out the various companies and personalities and changes of ownership, and\r particularly for giving me access to his voluminous records and files. He really should be\r giving this talk instead of me. I have gained most of my information from the city\r directories, and also some from the catalog files at the  George Eastman House. Although I have found out\r a lot about the numerous optical and camera companies of Rochester, my records are far\r from complete, and shall no doubt continue to find out interesting facts for many years to\r come. If anyone detects an error in my story, I hope they will point it out so that I can\r get everything correct as far as it goes.\n  I am very conscious that I should have started this research before the center of\r Rochester was torn to shreds to make room for the inner loop and the Urban Renewal\r project. Some streets have completely disappeared, many have changed their names, old\r buildings have been torn down to make room for parking lots, and it is often hopeless to\r find out where a company actually was located. This problem has been rendered even more\r difficult by the renumbering of streets that occurred in 1899 and 1911.\n  I have deliberately omitted companies devoted primarily to the manufacture of film,\r printing paper, plate holders, and the like, and more especially to optical companies\r making only spectacles, which has been a very active business in Rochester over the years.\r Thus I have omitted reference to companies such as Haloid, Defender, and even Xerox! The\r two large companies,  Bausch and Lomb and  Kodak have kept remarkably clear of each other&#39;s\r activities, and it is possible for tine historian to consider them separately, as I have\r done. The various camera companies were mainly related in some way to Kodak, while the\r lens and shutter companies were mostly connected with Bausch and Lomb. There have been\r exceptions, of course, as we shall see. There have also been several companies that have\r had no connection with either of these giants.\n      The photo-optical industry in Rochester was born in 1880. In that year Bausch and Lomb\r began to make photographic lenses; the  Rochester\r Optical Company began to make cameras; and  George\r Eastman began to make plates. However, my story actually begins back in 1853 when J.\r J. Bausch founded his tiny spectacle business and sat around vainly waiting for customers.\n  John Jacob Bausch was born in Gross Suessen, Germany, of a poor family, and was\r apprenticed to a spectacle maker. At the age of 20, in 1850, he decided to emigrate to\r America, and after a harrowing 49-day journey in a sailing vessel, landed in New York. He\r proceeded to Buffalo, where there was a cholera epidemic, and after trying unsuccessfully\r to find work, he moved to Rochester, where again he had the greatest difficulty in finding\r any sort of employment. He finally, at age 23, decided to set up an optician&#39;s shop in the\r Reynolds Arcade under the name of &#34;J. J. Bausch, Optician&#34;. At that time\r scarcely anybody in this country used eyeglasses, and many people had never even seen a\r pair, so his sales were almost nil. In 1856, as his trade card shows, his shop was called\r the &#34;J. J. Bausch Optical Institute.&#34;\n  In his endless struggle to find work, and even to survive, Bausch was greatly helped by\r a Mr. Henry Lomb, a cabinet maker, whom he probably met at the Turn Verein club. Lomb was\r born in 1828 and had also emigrated from Germany in 1849. He was a bachelor, and in 1853\r decided to join Bausch, where he proceeded to learn the optician&#39;s trade, and lodged with\r the Bausch family, turning over his earnings to them. At the outbreak of the Civil War,\r Lomb immediately enlisted, and finally rose to the rank of captain. He returned to\r Rochester in 1863, and in the following year the firm became &#34;Bausch and Lomb,\r Optician.&#34; By then business had improved to the point where they could open a factory\r at the corner of Andrews and Water Streets. Henry Lomb married in 1865, and in the\r following year moved to New York to act as the firm&#39;s sales agent there. He died in 190S,\r and because of his many civic activities and particularly his great interest in the\r Rochester Institute of Technology, a handsome memorial shaft was erected in his memory in\r 1932 in Rochester. Incidentally, the name of the company was changed to the\r &#34;Vulcanite Optical Instrument Company&#34; from 1866 to 1876, as this material was\r being extensively used to make spectacle frames. The name was changed back to the\r &#34;Bausch and Lomb Optical Company&#34; in 1876. After World War II it became\r &#34;Bausch and Lomb Inc.&#34;\n  After the Civil War, interest in spectacles rose rapidly, and the company constructed\r an enlarged factory in 1868 at River and Water Streets, followed six years later by an\r even larger building at the present location in St. Paul Street, the date 1874 being\r carved over the door. During the first World War they added a large building in front of\r the old one. We are now told that the company plans to abandon the entire establishment\r and move into the old Bond Clothing building on North Goodman Street.\n  Returning to 1875; at the urging of Bausch&#39;s eldest son Edward, the firm decided to\r branch out into optical instruments, beginning with the microscope for which there was a\r growing demand. To get started, they hired a temperamental character named Ernst  Gundlach, who had previously made microscopes in Berlin and was then\r living in Hackensack, New Jersey. Gundlach was employed by Bausch and Lomb from 1876 to\r 1878, but they quarreled frequently and finally separated. The microscope work, however,\r proceeded successfully under Edward Bausch&#39;s direction, and by 1903 they had sold about\r 44,000 instruments.\n  Bausch and Lomb added photographic lenses to their line in 1883, and began the\r manufacture of shutters in 1888. In 1892 they became the only company in America licensed\r to make Zeiss Anastigmats and other lenses. They also made Compound and Compur shutters by\r agreement with Deckel. These arrangements were finally terminated in World War I.\n  Some 1903 statistics are impressive. At that time Bausch and Lomb was making some 20\r million spectacle lenses a year, and had manufactured 500,000 photographic lenses and\r 550,000 shutters. As you know, the company is still in existence with branches in several\r other cities and abroad, making a wide range of optical and electronic products of the\r highest quality.\n      I have mentioned that difficult individual, Ernst Gundlach, who left  Bausch and Lomb somewhat unwillingly in 1878. His address at\r that time was 171 St. Paul Street while Bausch and Lomb were at No. 179, so he lived\r practically next door to the plant. In 1879 Gundlach was joined by a Lewis R. Sexton, and\r together they set up and operated an optical goods establishment in their home, while\r Sexton doubled as a teacher in No. 7 school, later becoming principal of School 17 and\r then of School 9. Being certain that the optical business was in good hands, Gundlach\r moved to Hartford, Conn., in 1880, where he lived for the next four years, giving his\r occupation as &#34;Optician.&#34; The following year Sexton moved the optical\r establishment to 29 Stone Street, where he was joined by two other opticians, J. C. Reich\r and J. Zellweger. In the 1883 Rochester directory he was listed as &#34;Dealer in Ernst\r Gundlach&#39;s Microscopes and Objectives.&#34;\n  Lewis R. Sexton died in August 1884 after having dropped out of optics, and Gundlach\r immediately returned to Rochester. He reorganized the business at 29 Stone Street as the\r &#34;Gundlach Optical Company&#34;, with himself, Reich, Zellweger, and H. H. Turner, a\r machinist, as officers. They claimed in their advertising to be &#34;Sole Manufacturers\r of E. Gundlach&#39;s Microscopes and Objectives.&#34; During the next eight years the company\r occupied several different locations, finally ending up in 1892 at 761 South Clinton\r Avenue where they stayed until well into the 1930&#39;s. In 1889 Gundlach was joined by his\r son Karl, who lived with him for many years.\n  Early in 1895, for some reason, Ernst Gundlach left the firm and established a rival\r company called the &#34;Gundlach Photo-optical Company&#34; at 5 South Water Street, as\r that building was then being vacated by the  Rochester\r Optical Company. In an advertisement published in the American Journal of Photography,\r Vol. XV, for August 1895, he stated that &#34;Ernst Gundlach has severed all connections\r with the old &#39;Gundlach Optical Company&#39;, and we are now the sole owners of his patent of\r December 9, 1890, under which his celebrated &#39;Rapid Rectigraphic&#39;, &#39;Perigraphic&#39;, and\r other lenses were so long made.&#34; Thus from 1895 there were two Gundlach companies\r existing independently in Rochester.\n  Late in 1895, the name of the second company was changed to &#34;Ernst Gundlach, Lens\r Manufacturers&#34; and in 1896 it was changed again to &#34;Ernst Gundlach, Son, and\r Co.&#34; then at 202 Court Street, the officers being B. W. Fenn, Z. P. Taylor, G. B.\r Gilbert, and A. S. Gilbert. However, the business cannot have been very successful, for\r two years later the Gundlachs left the city and moved to Chicago. After they left, the\r plant was re-named &#34;The Rochester Lens Company,&#34; and operated by Fenn and\r Gilbert. It was finally acquired by  Wollensak in 1905.\n  To return to the original Gundlach Optical Company: In 1895 H. H. Turner was manager,\r J. Zellweger and J. C. Reich were opticians, and in 1896 they acquired the Milburn Korona\r Company, which had been founded two years before by Gustave G. Milburn, and so added\r Korona cameras to their previous line of lenses. In 1896 they began also to advertise\r shutters, and added the Turner-Reich Anastigmat (U.S. Pat. 539,370) to their lens list. In\r 1898 Turner was president and manager, Zellweger was vice-president, and Reich secretary\r and treasurer. In August 1902 the company acquired the Manhattan Optical Company Of\r Cresskill, New Jersey, and changed the name of the company to the &#34;Gundlach-Manhattan\r Optical Company.&#34; Their building at 761 South Clinton Avenue at various times acted\r as the home of other companies, including the Rochester Panoramic Camera Company (1905),\r the  Seneca Camera Company (1903-1910), and the  Ilex Optical Company (1912-1916).\n  Around 1926 the name was changed to the Gundlach Manufacturing Company, and in 1928 it\r was taken over by John E. Seebold, president, and Walter H. Ashby as vice-president, under\r the strange name of the &#34;Seebold Invisible Camera Company.&#34; Seebold left the\r following year and Ashby became president. They suffered badly in the depression and\r finally moved to Fairport in October 1935, their old building on Clinton Avenue becoming\r the Kane Furniture Store. Early in 1954 their remaining assets were acquired by Albert\r Drucker, of Burke and James in Chicago, and finally re-organized as &#34;Dynamic Optics\r Inc.&#34; with David Goldstein as president. The firm ceased operations in 1972. In 1946\r Mr. Turner&#39;s son, Donald, founded the Turner Bellows Company which is still in existence\r at 165 North Water Street, making thousands of bellows a day for Polaroid.\n      The second company to branch off from  Bausch and Lomb\r was Wollensak. Andrew Wollensak was first employed as a machinist by Bausch and Lomb in\r 1882, and became a foreman the following year. He helped Edward Bausch with the design of\r the Iris Diaphragm shutter in 1890, and probably worked on other shutters as well. In 1899\r he and his brother John decided to establish a new company for the purpose of\r manufacturing a line of high quality shutters which could be sold at a reasonable price.\r The brothers managed to obtain financial help from Stephen Rauber, former president of the\r Union Brewing Company in North Clinton Avenue, and the new company, Rauber and Wollensak,\r was established in a building at 280 Central Avenue. Mr. Rauber died in 1901, and the name\r of the firm was then changed to the Wollensak Optical Company. The following year\r Wollensak commenced the production of lenses as well as shutters. The famous &#39;Optimo&#39;\r shutter was designed by Andrew Wollensak in 1909, and was sold extensively until 1930. The\r company purchased the Rochester Lens Company in 1905, thereby obtaining the right to\r manufacture the &#39;Royal&#39; anastigmat line developed by that company.\n  Andrew Wollensak senior, president of the company since its foundation, died in January\r 1936, his brother John having died three years earlier. John left five children, of whom\r Andrew A. and Frank J. remained active in the business for many years, and I knew them\r both. In 1913 the company moved to 1415 Clinton Avenue North at Norton Street, and in 1924\r to 872 Hudson Avenue. In 1938 a larger and more desirable building a few yards to the\r south, at 850 Hudson Avenue, fell vacant (it had been a clothing factory), and Wollensak\r moved into it. Unfortunately, during the past 15 years, after several changes of\r ownership, including Revere and 3M, the company gradually went downhill and in 1972\r finally closed its doors.\n  Wollensak was one of Rochester&#39;s finest companies, and at their height in 1958 they had\r over 1200 employees. Their lenses, shutters, and other products were considered to be\r excellent, and during the war they made a wide variety of optical equipment for the armed\r forces. It is too bad that they could not manage to survive.\n      The next offshoot from  Bausch and Lomb was Ilex. In 1910\r two Bausch and Lomb shutter designers named Rudolph Klein and Theodor Brueck (the latter\r had designed the &#34;Volute&#34; shutter in 1902) invented the revolutionary and\r extremely important shutter delay mechanism involving a rotating gear and a rocking pallet\r (U.S. Pat. 1,092,110). This device for the first time enabled a shutter to be made which\r would be accurate independently of temperature and other atmospheric conditions.\n  Klein and Brueck decided to leave Bausch and Lomb and set up their own business, which\r was called the &#34;XL Manufacturing Company&#34;, to manufacture the new shutter. They\r were aided financially by a wholesale jeweler named Morris Rosenbloom, and they set up\r their first factory on his premises at 156 Main Street East. However, they soon discovered\r that C. P. Goerz was also making a line of so-called &#34;X excel L&#34; shutters, so to\r avoid confusion they twisted the letters around and renamed their shutter the\r &#34;Ilex,&#34; and in 1911 the firm was called the Ilex Manufacturing Company. Very\r soon after, Friedrich Deckel of Munich sought permission to use their delay mechanism on a\r royalty basis in the famous line of &#34;Compur&#34; shutters, which proved to be a\r considerable financial help to Ilex.\n  From 1912 to 1916 the company, now called the Ilex Optical Company, occupied space in\r the  Gundlach building at 761 South Clinton Avenue; in 1917 they\r moved to 724 Portland Avenue, and eventually in 1930 to 690 Portland, where they are\r today. In 1921 they tried the experiment of setting up a separate lens factory at 814 St.\r Paul Street called the &#34;Acme Optical Company,&#34; but it lasted only a couple of\r years.\n  One of the major contributions of the Ilex company was the invention of a\r self-contained internal flash synchronization mechanism during World War II. This was\r designed by Alfred Schwartz, and the idea has, of course, been incorporated in all\r shutters by all manufacturers since that time.\n  Ilex has suffered many ups and downs in prosperity over the years. The first president,\r Morris Rosenbloom, died in 1935 and was succeeded by his son Rufus as president and E. C.\r Roland as vice-president. Roland died in 1942, and after the war the company&#39;s fortunes\r sank to a low ebb. Finally, in 1963, their remaining assets were acquired by two young  Elgeet employees, Eugene Miller and Manuel Kiner, and today the company\r is thriving with over 200 employees, and having to increase its factory space to keep up\r with the demand for its products.\n      Talking of  Ilex reminds me of Elgeet. The Elgeet Optical Company\r was founded by three young men who had been boyhood friends: Mortimer A. London, then a\r lens inspector at  Kodak, with David L. Goldstein and\r Peter Terbuska of Ilex. (The firm&#39;s name is an acronym of L, G. and T). In 1946 they began\r by leasing some machine tools to make lens-polishing machinery, and with this they set up\r shop in an Atlantic Avenue loft, where they did all their own lens manufacture, packaging,\r and selling.\n  By 1952 the firm had grown sufficiently to enable them to purchase a former clothing\r plant at 838 Smith Street. At that time Goldstein was president, Terbuska was secretary,\r and London treasurer. The company prospered and with nearly 300 employees they\r manufactured thousands of lenses for small movie cameras and many other applications.\n  London left in 1960, and in 1962 the firm acquired ownership of the ancient\r establishment of Steinheil in Munich, but they soon sold this, I believe to Lear Siegler.\r In 1964 there were difficulties at stock-holder&#39;s meetings, and the firm was reorganized\r with Alfred Watson as president. Two years later the assets of the company were acquired\r by MATI (Management and Technology Inc.), who acquired Turner Bellows at the same time.\r MATI survived only until 1969, when they disappeared. Goldstein purchased the remaining\r assets of the former  Gundlach Manufacturing Company in Fairport\r and reorganized it under the name &#34;Dynamic Optics Incorporated,&#34; but this also\r ceased operations in 1972.\n      So much for  Bausch and Lomb and their daughter\r companies. We will now turn our attention to the camera business initiated by William H.\r Walker, who came to Rochester in 1880 and set up as &#34;Wm. H. Walker and Company&#34;,\r at 79 Exchange Street. (He must not be confused with James T. Walker Of Palmyra, who made\r the Takiv camera ten years later). In 1882 Walker joined with W. H. Reid and J. Inglis to\r make dry plates, a business continued by Inglis for several years. In 1883 Walker gave up\r making cameras, and the &#34;Rochester Optical Company&#34; was established by W. F.\r Carlton to take over his assets. Meanwhile, in January 1884 Walker joined  Eastman to make the Eastman-Walker Roll Holder, and the\r following year he became secretary to the Eastman Dry Plate and Film Company. Shortly\r after this he was sent to England as Eastman&#39;s representative in that country.\n  The new Rochester Optical Company was loca\n......", "posttime": "2021-06-22 03:20:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "相机,rochester", "title": "罗切斯特，纽约相机和镜头公司的历史 ", "title_en": "History of the Rochester, NY Camera and Lens Companies", "transed": 1, "url": "http://www.nwmangum.com/Kodak/Rochester.html", "via": "", "real_tags": ["相机", "rochester"]}, {"category": "", "categoryclass": "", "imagename": "210f593e732f9350456ce26758de933b.png", "infoid": 1067270, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本文中，我想为您提供之前发布的CVE-2021-20226（ZDI-2021-001）的技术描述。我发现这脆弱性并通过零日计划向供应商报告给供应商。本文并非旨在通知您漏洞的危险，而是从技术角度分享提示。\n 可以在下面的链接找到漏洞和攻击方法的概述。此博客将更详细地解释。\n  如果您有任何疑问或发现任何错误，如果您可以单独与我联系，我会感激。而且，本文中的代码基本上是指Linux内核5.6.19的Linux内核源代码。\n IO_URICE是2021年的主动更新的功能之一，并且信息随着版本的变化而变化（自发现时间以来已经进行了许多变化）。因此，请注意，即使在撰写博客时，信息也不是最新的。\n  我将解释我写的Poc的轮廓，但我不会发布实际代码。\n    请参阅Internet上发布的一些博客/幻灯片，以获取用户的角度的规格和详细说明。从这里，我将继续解释你理解它的假设的IO_uring的轮廓。\n 在IO_URIP中，文件描述符首先由专用的系统调用（IO_URE_SETUP）生成，并且通过发出MMAP（）系统调用，提交队列（SQ）和完成队列（CQ）在用户空间内存中映射/共享。这用作两侧的环形缓冲器（内核/用户空间）。通过将SQE（提交队列条目）写入共享内存，注册了每个系统呼叫的条目，例如读/写/发送/ reCV。然后通过调用io_ougn_enter（）启动执行。 \n顺便说一下，这次重要的部分是实现异步执行的实现，所以我将专注于此。首先解释它，IO_URE并不总是异步地执行，但它根据需要异步执行。请先参考以下代码。（在此之后，内核v5.8将用于解释行为。行为可能与您的环境略有不同。）\n #define _gnu_source #include＆lt; sched.h＆gt; #include＆lt; stdio.h＆gt; #include＆lt; string.h＆gt; #include＆lt; stdlib.h＆gt; #include＆lt; signal.h＆gt; #include＆lt; sys / syscall.h＆gt; #include＆lt; sys / fcntl.h＆gt; #include＆lt; err.h＆gt; #include＆lt; unistd.h＆gt; #include＆lt; sys / mman.h＆gt; #include＆lt; linux / io_uring.h＆gt; #define syschk（x）（{\\ typeof（x）__res =（x）; \\ if（__res ==（typeof（x）） -  1）\\ err（1，＆＃34; syschk（＆＃34;＃ X＆＃34;）＆＃34;）; \\ __res; \\}）静态intring_fd; struct iovec * io; #define size 32 char _buf [size]; int main（void）{//初始化uring struct io_uping_params params = {}; uring_fd = syschk（syscall（__ nr_io_uring_setup，/ *条目= * / 10，＆amp; params））; unsigned char * sq_ring = syschk（null，0x1000，prot_read | prot_write，map_shared，uring_fd，iing_off_sq_ring））; unsigned char * cq_ring = syschk（null，0x1000，prot_read | prot_write，map_shared，uring_fd，iing_off_cq_ring））; struct io_uring_sqe * sqes = syschk（mmap（null，0x1000，prot_read | prot_write，map_shared，uring_fd，iings_off_sqes））; io = malloc（sizeof（struct iovec）* 1）; io [0] .iov_base = _buf; IO [0] .iov_len = size; struct timespec ts = {.tv_sec = 1}; SQEES [0] =（struct io_uring_sqe）{.opcode = iOrience_op_timeout，//.flags = iosqe_io_hardlink，.len = 1，.addr =（unsigned long）＆amp; ts}; SQEES [1] =（struct io_uring_sqe）{.opcode = iOrience_op_readv，.addr = Io，.flags = 0，.len = 1，.off = 0，.fd = syschk（打开（＆＃34; / etc / passwd＆ ＃34;，o_rdonly））}; （（int *）（sq_ring + params.sq_off.array））[0] = 0; （（int *）（sq_ring + params.sq_off.array）[1] = 1; （*（int *）（sq_ring + params.sq_off.tail））+ = 2; int提交= syschk（syscall（__ nr_io_uping_enter，uring_fd，/ * to_submit = * / 2，/ * min_complete = * / 0，/ * flags = * / 0，/ * sig = * / null，/ * sigsz = * / 0 ））;虽然（1）{ULEEP（100000）; if（* _ buf）{puts（＆＃34; readv执行。＆＃34;）;休息;放（＆＃34;等待。＆＃34;）; }}\n 在此代码中，在执行ITORION_OP_TIMEOUT和IORING_OP_READV执行必要的设置之后，它开始执行，然后每0.1秒检查一次，以查看READV（）是否完成。似乎readv（）将在1秒后完成，考虑到它按环缓冲区的顺序执行。但是，当我实际运行时，结果如下。\n  也就是说，立即完成READV（）的执行。这是因为，正如我之前所说的那样，它根据需要异步地执行，但在这种情况下，可以立即完成READV（）的执行（因为已知其执行不会停止）。所以后续操作首先互动（ITORING_OP_TIMEOUT忽略）。作为测试，使用以下SystemTap [¹]脚本检查readv（）是否同步执行（=在系统调用的处理程序中）。\n [¹]：允许您灵活地执行脚本的工具，例如跟踪内核（但不仅）函数并在跟踪点输出变量。我喜欢这个工具，因为内核调试是一个麻烦。\n  ↓当在执行上述SystemTap脚本时执行先前的程序（文件名为样本的名称）时，这是输出。如果是异步，很容易想象执行任务在某些工作人员中注册，但由于它在此处执行，因此打印名为系统调用的可执行文件的名称。\n   那么我在哪里呢？答案是“传递给内核线程，因为确定需要异步执行”。有几个标准，如果它们相遇，它们将被排队进入异步执行的队列中。这里有些例子。 \n}否则如果（req-＆gt;标志＆amp; req_f_force_async）{...... / * *切勿尝试内联提交IOSQE_ASYNC设置，直接*到异步执行。 * / req-＆gt; work.flags | = io_wq_work_concurrent; io_queue_async_work（req）;\n  2.由为每次操作准备的逻辑决定。 （例如，在调用READV（）时添加IOCB_NOWAIT标志，如果预计执行停止，则返回EAGAIN）\n static int io_read（struct io_kiocb * req，struct io_kiocb ** nxt，bool force_nonblock）{...... ret = rw_verify_area（阅读，req-＆gt;文件，＆amp; kiocb-＆gt; ki_pos，iov_count）; if（！RET）{SSIZE_T RET2; if（req-＆gt; file-＆gt; f_op-＆gt; read_iter）ret2 = call_read_iter（req-＆gt;文件，kiocb，＆amp; erer）; else ret2 = loop_rw_iter（读取，req-＆gt;文件，kiocb，＆amp; erer）; / *捕获强制非阻塞提交的返回* / if（！force_nonblock || ret2！= -iagain）{kiocb_done（kiocb，ret2，nxt，req-＆gt; in_async）; } else {copy_iov：ret = io_setup_async_rw（req，io_size，Iovec，Inline_vecs，＆amp; erer）;如果（RET）转到OUT_FREE;返回-Again; }} ......}\n  返回EAGAIN时，它会导出进入异步执行的队列（如果它是一种使用文件描述符的操作，它会在此处获取对文件结构的引用）。\n 静态void __io_queue_sqe（struct io_kiocb * req，const struct io_uring_sqe * sqe）{...... ret = io_issue_sqe（req，sqe，＆amp; nxt，true）; / * *如果文件没有标记为Nowait，或者如果文件*＆＃39; t支持非阻塞读/写尝试* / if（RET == -AGAIN＆amp; ！（req-＆gt; flags＆amp; req_f_nowait）||（req-＆gt;标志＆amp; req_f_must_punt）））{punt：if（io_op_defs [req-＆gt;操作码] .file_table）{ret = io_grab_files（req）;如果（RET）GOTO ERR; } / * *排队到异步执行，Worker将在实际提交IOCB时发布*提交参考。 * / io_queue_async_work（req）; goto done_req; } ......}\n  static int io_issue_sqe（struct io_kiocb * req，const struct io_uring_sqe * sqe，struct io_kiocb ** nxt，bool force_nonblock）{struct io_ring_ctx * ctx = req-＆gt; ctx; int ret;切换（req-＆gt;操作码）{case iing_op_nop：ret = io_nop（req）;休息;案例IORING_OP_READV：CASE IORICE_OP_READ_FIXED：case iousing_op_read：if（sqe）{ret = io_read_prep（req，sqe，force_nonblock）; if（et＆lt; 0）破裂; } ret = io_read（req，nxt，force_nonblock）;休息;\n  3.使用IOSQE_IO_LINK | IOSQE_IO_HARDLINK标志（指定执行顺序）和更早地执行其执行顺序的操作以确定需要异步执行。 \n（如下面的代码中所述连接为链接，按顺序执行，如果在中间满足条件2，则将在异步执行队列中排出整个链接）\n 静态bool io_submit_sqe（struct io_kiocb * req，const struct io_uring_sqe * sqe，struct io_submit_state * struct，struct io_kiocb **链接）{...... / * *如果我们已经有一个头请求，则为异步队列这一个头部完成后提交。如果我们没有＆＃39; t有一个头，但是* iosqe_io_link在sqe中设置，开始一个新的头。一旦链条完成，这将是*提交同步。如果没有那些*条件是真的（正常请求），那么只需队列。 * / if（*链接）{...... list_add_tail（＆amp; req-＆gt; link_list，＆amp; head-＆gt; link_list）; / *链接的最后一个请求，inqueue链接* / if（！（sqe_flags＆amp;（iosqe_io_link | iosqe_io_hardlink）））{io_queue_link_head（head）; * link = null; }}否则{......如果（sqe_flags＆amp;（iosqe_io_link | iosqe_io_hardlink））{req-＆gt; flags | = req_f_link; init_list_head（＆amp; req-＆gt; link_list）; if（io_alloc_async_ctx（req））{ret = -eagain; goto err_req; } ret = io_req_defer_prep（req，sqe）; if（ret）req-＆gt; flags | = req_f_fail_link; *链接= req; } else {io_queue_sqe（req，sqe）; }}返回true; }\n  严格来说，IORING_OP_TIMEOUT是一个小小的特殊性，并且不会返回EAGAIN，如2.但（我认为）很容易理解，所以我用它作为一个样本。如下所示，通过将需要异步执行（IORING_OP_TIMEOUT）与另一个操作的操作链接，您可以看到先前的IORING_OP_READV在等待1秒后肯定执行。\n 将IOSQE_IO_HARDLINK标志添加到上面的示例代码中的IORING_OP_TIMEOUT操作，以阐明它链接到后续操作。\n    此时，如果以与以前相同的方式执行执行IO_READ（）的进程的名称，则会获得以下输出。\n  正如您通过查看进程列表所看到的，这是一个内核线程。\n $ PS AUX | Grep -a 2-u型1样品Garyo 131388 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0. S 19:03 0:00 [IO_WQ_MANAGER]根131390 0.0 0.0 0 0？ S 19:03 0:00 [IO_WQE_WORKER-0] \n此后，此内核线程将被称为“工人”。此工作人员由以下代码生成，然后，Dequeue和执行队列的异步执行任务。\n 静态bool create_io_worker（struct io_wq * wq，struct io_wqe * wqe，int index）{...... worker-＆gt; task = kthread_create_on_node（io_wqe_wayer，worker，wqe-＆gt;节点，＆＃34; io_wqe_worker-％d /％d＆＃34;，index，wqe-＆gt;节点）; ......}\n  旁边：如前所述，IORING_OP_TIMEOUT从下图略有不同，但它被描述为简单起见。严格来说，当调用io_timeout（）时，它会在处理程序中设置IO_TIMEOUT_FN（）并启动计时器。在通过定时器的时间设置后，调用IO_TimeOut_fn（）以将连接到异步执行队列中的链路的操作加载。换句话说，IORING_OP_TIMEOUT本身不会在异步执行队列中排队。超时用于解释中，因此很容易想象执行将停止。\n   发现异步处理由运行作为内核线程的工作者执行。但是，这里有预防措施。由于Worker runninng作为内核线程，因此执行上下文与调用IO_uping相关系统调用的线程不同。这里，“执行上下文”是指与处理相关联的任务组结构和与之相关联的各种信息。例如，mm（管理进程的虚拟内存空间），cred（保存UID / gid / capability），files_struct（保存文件描述符的表。文件_struct结构中的文件结构数组，文件描述符是其索引） 等等。\n 当然，如果它没有引用调用系统调用的线程中的这些结构，它可以指的是错误的虚拟内存或文件描述符表，或使用内核线程权限（≒root）发出I / O操作[² ]。\n [²]：顺便说一下，这是一种实际漏洞，而且当时它忘了切换信用，并且可以用root权限执行操作。虽然当时未实现相当于打开的Open（）的操作，但是可以在SendMsg的SCM_Credentials选项中通知通知发件人的权限的权限。这是D-Bus周围的问题，因为权威是由它确认的。 https://www.exploit-db.com/exploits/47779.\n 因此，在IO_URICE中，这些引用将传递给工人，以便工作者通过在执行之前通过切换自己的上下文来共享执行上下文。例如，您可以看到，然后将引用MM和CRECT传递给REQ-＆GT;在以下代码中工作。 \n静态内联void io_req_ward_grab_env（struct io_kiocb * req，const struct io_op_def * def）{if（！req-＆gt; work.mm＆amp; def-＆gt; caven-＆gt; caven-＆gt; comper_mm）{mmgrab（current-＆gt; mm）; Req-＆gt; Work.mm =电流 - ＆gt; mm; }如果（！req-＆gt; work.creds）req-＆gt; work.creds = get_current_cred（）; if（！req-＆gt; work.fs＆amp;＆amp; def-＆gt; capid_fs）{spin_lock（＆amp; current-＆gt; fs-＆gt;锁定）; if（！current-＆gt; fs-＆gt; in_exec）{req-＆gt; work.fs = current-＆gt; fs; req-＆gt; work.fs-＆gt;用户++; } else {req-＆gt; work.flags | = io_wq_wark_cancel; } Spin_unlock（＆amp; current-＆gt; fs-＆gt;锁定）; }如果（！req-＆gt; work.task_pid）req-＆gt; work.task_pid = task_pid_vnr（当前）; }\n  您可以看到对files_struct的引用传递给req-＆gt;在以下代码中工作。\n static int io_grab_files（struct io_kiocb * req）{...... if（ctx-＆gt; ring_fd）== ctx-＆gt; ring_file）{list_add（＆amp; req-＆gt; indight_entry，＆amp; ctx-＆gt ;填充_List）; Req-＆gt;标志| = req_f_inflight; req-＆gt; work.files = current-＆gt;文件; RET = 0; } ......}\n  然后，在执行之前，将它们替换为工作人员的当前内容（获取当前正在运行的Task_struct的宏）。\n 静态void io_wayer_handle_work（struct io_wayer * worker）__leleases（wqe-＆gt; lock）{struct io_wq_ware * work，* old_work = null，* put_work = null; struct io_wqe * wqe = worker-＆gt; wqe; struct io_wq * wq = wqe-＆gt; wq; do {......如果（工作 - ＆gt;文件＆amp; current-＆gt;文件！= work-＆gt;文件）{task_lock（current）; current-＆gt; files = work-＆gt;文件; Task_unlock（当前）; }如果（工作 - ＆gt; fs＆amp;＆amp; current-＆gt; fs！=工作 - ＆gt; fs）current-＆gt; fs =工作 - 和gt; fs; if（工作 - ＆gt; mm！= worker-＆gt; mm）io_wq_switch_mm（worker，work）; if（worker-＆gt; cur_creds！= work-＆gt; creds）io_wq_switch_creds（工人，工作）; ......工作 - ＆gt; func（＆amp;工作）; ......}虽然（1）; }\n  现在，让我们继续解释漏洞。在下面的代码中（我之前发布），您可以看到工作人员正在向执行系统调用的线程的文件传递给工作者将在不递增参考计数器的情况下引用的结构。\n static int io_grab_files（struct io_kiocb * req）{...... if（ctx-＆gt; ring_fd）== ctx-＆gt; ring_file）{list_add（＆amp; req-＆gt; indight_entry，＆amp; ctx-＆gt ;填充_List）; Req-＆gt;标志| = req_f_inflight; req-＆gt; work.files = current-＆gt;文件; RET = 0; } ......} \n顺便说一下，如简要介绍的说明，当在队列中延长任务时，从指定的文件描述符（传递给IO_kiocb结构）首先保留对队列中的队列中的参考。\n static int io_req_set_file（struct io_submit_state * state，struct io_kiocb * req，const struct io_uring_sqe * sqe）{struct io_ring_ctx * ctx = req-＆gt; ctx;无符号旗帜; int fd;标志= READ_ONCE（SQE-＆GT;标志）; fd = read_once（sqe-＆gt; fd）; if（！io_req_needs_file（req，fd））返回0; if（标志＆amp; iosqe_fixed_file）{if（不可能（！ctx-＆gt; file_data ||（未签名）fd＆gt; = ctx-＆gt; nr_user_files）return -ebadf; fd = array_index_nospec（fd，ctx-＆gt; nr_user_files）; req-＆gt; file = io_file_from_index（ctx，fd）; if（！req-＆gt;文件）返回-ebadf; req-＆gt;标志| = req_f_fixed_file; percpu_ref_get（＆amp; ctx-＆gt; file_data-＆gt; refs）; }否则{if（req-＆gt; caless_fixed_file）return -ebadf; trace_io_uping_file_get（CTX，FD）; req-＆gt; file = io_file_get（州，FD）; if（不太可能（！req-＆gt;文件））返回-ebadf;返回0; }\n   因此，工作人员不必再次从文件描述符中检索它，并且不需要引用files_struct结构。如果是这样，似乎没有问题是files_struct结构的参考计数器未递增（因为未使用它）。但是在Linux内核5.5及更高版本中，此假设不存在。这是因为现在可以通过IO_UPURS获得影响文件描述符表的系统调用，例如打开/关闭/接受。显然，这些系统调用会影响文件描述符表，因此它看起来可以用于利用的东西，\n 即使您只需调用Open / Close / Incept等，如果Files_struct结构可用，则不会发生任何内容。 - 当然，当通过多个线程处理相同的文件时，系统调用具有对策，因此无法在调用线程和工人之间引起竞争条件。\n 通过将Files_struct设置为0，新进程可以将其作为该进程的文件重用。重用时，工作人员将参考新进程的Files_struct。 - 但是，文件结构已经从文件描述符获得的，所以它̶c̶a̶n̶n̶o̶t̶得到一个参考文件结构的新的进程（这是一个谎言，我将描述在“搁置”的一部分。） - 这是可能的插入文件通过打开文件，结构进入新进程的文件描述符表。但它不会被引用。 （因为人们在编程时不使用固定文件描述符编号。）\n 在这里，我将在通过多个线程处理相同文件时，在对策中解释文件结构的参考计数器的机制。是的，这是一个扰流板。结论将是它实际上可以滥用。\n  要了解文件结构中的参考计数器如何工作，我们首先需要了解实际打开/关闭的内容。当然，行为根据要打开的实际文件而变化，但以下内容可以常见。 \n静态结构文件* __ alloc_file（int标志，const struct cred * cred）{struct文件* f; int错误; f = kmem_cache_zalloc（filp_cachep，gfp_kernel）; ...... atomic_long_set（＆amp; f-＆gt; f_count，1）; ......返回f; }\n   静态long do_sys_openat2（int dfd，const char __user * filename，struct open_how * how）{...... fd = get_unused_fd_flags（how-＆gt; flags）; if（fd＆gt; = 0）{struct文件* f = do_filp_open（dfd，tmp，＆amp; op）; if（is_err（f））{put_unused_fd（fd）; fd = ptr_err（f）; } else {fsnotify_open（f）; fd_install（fd，f）; }} putname（tmp）;返回FD; }\n     int __close_fd（struct files_struct * files，unsigned fd）{struct文件*文件;结构fdtable * fdt; spin_lock（＆amp; files-＆gt; file_lock）; fdt = files_fdtable（文件）; if（fd＆gt; = fdt-＆gt; max_fds）goto out_unlock; file = fdt-＆gt; fd [fd];如果（！文件）转到out_unlock; rcu_assign_pointer（fdt-＆gt; fd [fd]，null）; __put_unused_fd（文件，fd）; spin_unlock（＆amp; files-＆gt; file_lock）;返回filp_close（文件，文件）; Out_unlock：Spin_unlock（＆amp; files-＆gt; file_lock）;返回-ebadf; }\n     这里重要的是fget（）/ fput（）functio\n...... ", "note_en": "In this article, I would like to give you a technical description of CVE-2021–20226(  ZDI-2021–001 ) which is published before. I discovered this vulnerability and reported it to the vendor via the Zero Day Initiative. This article is not intended to inform you of the dangers of vulnerabilities, but to share tips from a technical point of view.\n An overview of the vulnerabilities and attack methods can be found at the links below. This blog will explain in a little more detail.\n  If you   have any questions or found any mistakes, I’d appreciate it if you could contact me individually. And, the code in this article basically refers to the Linux Kernel source code at  Linux kernel 5.6.19.\n io_uring is one of the actively updated features as of 2021, and the information changes as the version changes (many changes have been made since the time I discovered it). Therefore, please note that the information is not up-to-date even at the time of writing the blog.\n  I will explain the outline of the PoC I wrote, but I will not post the actual code.\n    Please refer to some blogs/slides posted on the Internet for specs and detailed descriptions from the user’s perspective.  From here, I will continue to explain the outline of io_uring on the assumption that you understand it.\n In io_uring, a file descriptor is first generated by a dedicated system call ( io_uring_setup), and by issuing  mmap() system call to it, Submission Queue(SQ) and Completion Queue(CQ) are mapped/shared in userspace memory. This is used as ring buffer by both sides(Kernel/Userspace). Entries for each system call such as read/write/send/recv are registered by writing SQE(Submission Queue Entry) to the shared memory. And then execution is started by calling  io_uring_enter().\n   By the way, the important part this time is the implementation of asynchronous execution, so I will focus on that. To explain it first, io_uring is not always executed asynchronously, but it is  executed asynchronously as needed. Please refer to the code below first.(After this, the Kernel v5.8 will be used to explain the behavior. The behavior may be slightly different from your environment.)\n #define _GNU_SOURCE #include &lt;sched.h&gt; #include &lt;stdio.h&gt; #include &lt;string.h&gt; #include &lt;stdlib.h&gt; #include &lt;signal.h&gt; #include &lt;sys/syscall.h&gt; #include &lt;sys/fcntl.h&gt; #include &lt;err.h&gt; #include &lt;unistd.h&gt; #include &lt;sys/mman.h&gt; #include &lt;linux/io_uring.h&gt; #define SYSCHK(x) ({ \\  typeof(x) __res = (x); \\  if (__res == (typeof(x))-1) \\  err(1, &#34;SYSCHK(&#34; #x &#34;)&#34;); \\  __res; \\ }) static int uring_fd; struct iovec *io; #define SIZE 32 char _buf[SIZE]; int main(void) {  // initialize uring  struct io_uring_params params = { };  uring_fd = SYSCHK(syscall(__NR_io_uring_setup, /*entries=*/10, &amp;params));  unsigned char *sq_ring = SYSCHK(mmap(NULL, 0x1000, PROT_READ|PROT_WRITE,  MAP_SHARED, uring_fd,  IORING_OFF_SQ_RING));  unsigned char *cq_ring = SYSCHK(mmap(NULL, 0x1000, PROT_READ|PROT_WRITE,  MAP_SHARED, uring_fd,  IORING_OFF_CQ_RING));  struct io_uring_sqe *sqes = SYSCHK(mmap(NULL, 0x1000, PROT_READ|PROT_WRITE,  MAP_SHARED, uring_fd,  IORING_OFF_SQES)); io = malloc(sizeof(struct iovec)*1);  io[0].iov_base = _buf;  io[0].iov_len = SIZE; struct timespec ts = { .tv_sec = 1 };  sqes[0] = (struct io_uring_sqe) {  .opcode = IORING_OP_TIMEOUT,  //.flags = IOSQE_IO_HARDLINK,  .len = 1,  .addr = (unsigned long)&amp;ts  };  sqes[1] = (struct io_uring_sqe) {  .opcode = IORING_OP_READV,  .addr = io,  .flags = 0,  .len = 1,  .off = 0,  .fd = SYSCHK(open(&#34;/etc/passwd&#34;, O_RDONLY))  };  ((int*)(sq_ring + params.sq_off.array))[0] = 0;  ((int*)(sq_ring + params.sq_off.array))[1] = 1;  (*(int*)(sq_ring + params.sq_off.tail)) += 2; int submitted = SYSCHK(syscall(__NR_io_uring_enter, uring_fd,  /*to_submit=*/2, /*min_complete=*/0,  /*flags=*/0, /*sig=*/NULL, /*sigsz=*/0));  while(1){  usleep(100000);  if(*_buf){  puts(&#34;READV executed.&#34;);  break;  }  puts(&#34;Waiting.&#34;);  } }\n In this code, after performing the necessary setup for the operations  IORING_OP_TIMEOUT and  IORING_OP_READV, it starts execution and then checks every 0.1 seconds to see if  readv() is complete. It seems that  readv() will be completed after 1 second, considering that it is executed in the order of ring buffer. However, when I actually run it, the result was as follows.\n  That is, execution of  readv() was completed immediately. This is because, as I said earlier, it is  executed asynchronously as needed, but in this case an execution of  readv() can be completed immediately (because it is known that its execution does not stop). So subsequent operation was compeleted first ( IORING_OP_TIMEOUT was ignored for the time being). As a test, check that  readv() is executed synchronously (= in the handler of the system call) with the following systemtap[¹] script.\n [¹]: A tool that allows you to flexibly execute scripts, such as tracing Kernel (but not only) functions and outputting variables at the traced points. I love this tool because Kernel debugging is a hassle.\n  ↓ This is the output when the previous program (name of the file is  sample) is executed while above systemtap script is being executed. If it is asynchronous, it is easy to imagine that the execution task is registered in some worker, but since it is executed synchronously here, the name of the executable file which called the system call is printed.\n   So where did  IORING_OP_TIMEOUT go? The answer is “ passed to the Kernel Thread because it was determined that asynchronous execution was needed”. There are several criteria for this, and if they meet, they will be enqueued into the Queue for asynchronous execution. Here are some examples.\n  } else if (req-&gt;flags &amp; REQ_F_FORCE_ASYNC) {  ......  /*  * Never try inline submit of IOSQE_ASYNC is set, go straight  * to async execution.  */  req-&gt;work.flags |= IO_WQ_WORK_CONCURRENT;  io_queue_async_work(req);\n  2. Decisions by the logic prepared for each operation. (e.g. Add IOCB_NOWAIT flag when calling  readv() and return EAGAIN if execution is expected to stop)\n static int io_read(struct io_kiocb *req, struct io_kiocb **nxt,  bool force_nonblock) {  ......  ret = rw_verify_area(READ, req-&gt;file, &amp;kiocb-&gt;ki_pos, iov_count);  if (!ret) {  ssize_t ret2; if (req-&gt;file-&gt;f_op-&gt;read_iter)  ret2 = call_read_iter(req-&gt;file, kiocb, &amp;iter);  else  ret2 = loop_rw_iter(READ, req-&gt;file, kiocb, &amp;iter); /* Catch -EAGAIN return for forced non-blocking submission */  if (!force_nonblock || ret2 != -EAGAIN) {  kiocb_done(kiocb, ret2, nxt, req-&gt;in_async);  } else { copy_iov:  ret = io_setup_async_rw(req, io_size, iovec,  inline_vecs, &amp;iter);  if (ret)  goto out_free;  return -EAGAIN;  }  }  ...... }\n  When EAGAIN is returned, it is enqueued into the Queue for asynchronous execution (if it is a type of operation that uses file descriptors, it gets references to the  file structure here).\n static void __io_queue_sqe(struct io_kiocb *req, const struct io_uring_sqe *sqe) {  ...... ret = io_issue_sqe(req, sqe, &amp;nxt, true); /*  * We async punt it if the file wasn&#39;t marked NOWAIT, or if the file  * doesn&#39;t support non-blocking read/write attempts  */  if (ret == -EAGAIN &amp;&amp; (!(req-&gt;flags &amp; REQ_F_NOWAIT) ||  (req-&gt;flags &amp; REQ_F_MUST_PUNT))) { punt:  if (io_op_defs[req-&gt;opcode].file_table) {  ret = io_grab_files(req);  if (ret)  goto err;  } /*  * Queued up for async execution, worker will release  * submit reference when the iocb is actually submitted.  */  io_queue_async_work(req);  goto done_req;  }  ...... }\n  static int io_issue_sqe(struct io_kiocb *req, const struct io_uring_sqe *sqe,  struct io_kiocb **nxt, bool force_nonblock) {  struct io_ring_ctx *ctx = req-&gt;ctx;  int ret; switch (req-&gt;opcode) {  case IORING_OP_NOP:  ret = io_nop(req);  break;  case IORING_OP_READV:  case IORING_OP_READ_FIXED:  case IORING_OP_READ:  if (sqe) {  ret = io_read_prep(req, sqe, force_nonblock);  if (ret &lt; 0)  break;  }  ret = io_read(req, nxt, force_nonblock);  break;\n  3. When the  IOSQE_IO_LINK|IOSQE_IO_HARDLINK flag is used(the execution order is specified) and the operation whose execution order is earlier is determined to require asynchronous execution.\n (Connect as a link as described in the code below, execute in order, and if condition 2 is met in the middle, whole link will be enqueued into the asynchronous execution queue)\n static bool io_submit_sqe(struct io_kiocb *req, const struct io_uring_sqe *sqe,  struct io_submit_state *state, struct io_kiocb **link) {  ......  /*  * If we already have a head request, queue this one for async  * submittal once the head completes. If we don&#39;t have a head but  * IOSQE_IO_LINK is set in the sqe, start a new head. This one will be  * submitted sync once the chain is complete. If none of those  * conditions are true (normal request), then just queue it.  */  if (*link) {  ......  list_add_tail(&amp;req-&gt;link_list, &amp;head-&gt;link_list); /* last request of a link, enqueue the link */  if (!(sqe_flags &amp; (IOSQE_IO_LINK|IOSQE_IO_HARDLINK))) {  io_queue_link_head(head);  *link = NULL;  }  } else {  ......  if (sqe_flags &amp; (IOSQE_IO_LINK|IOSQE_IO_HARDLINK)) {  req-&gt;flags |= REQ_F_LINK;  INIT_LIST_HEAD(&amp;req-&gt;link_list); if (io_alloc_async_ctx(req)) {  ret = -EAGAIN;  goto err_req;  }  ret = io_req_defer_prep(req, sqe);  if (ret)  req-&gt;flags |= REQ_F_FAIL_LINK;  *link = req;  } else {  io_queue_sqe(req, sqe);  }  } return true; }\n  Strictly speaking,  IORING_OP_TIMEOUT is a little special and does not return EAGAIN like shown in 2. But (I think) it is easy to understand, so I use it as a sample. As shown below, by linking an operation that requires asynchronous execution ( IORING_OP_TIMEOUT) with another operation, you can see that the previous  IORING_OP_READV is certainly executed after waiting for 1 second.\n Add  IOSQE_IO_HARDLINK flag to the  IORING_OP_TIMEOUT operation in the sample code above to clarify that it is linked to the subsequent operation.\n    At this time, if you display the name of the process that is executing  io_read() in the same way as before, you will get the following output.\n  As you can see by looking at the process list, this is a Kernel Thread.\n $ ps aux | grep -A 2 -m 1 sample garyo 131388 0.0 0.0 2492 1412 pts/1 S+ 19:03 0:00 ./sample root 131389 0.0 0.0 0 0 ? S 19:03 0:00 [io_wq_manager] root 131390 0.0 0.0 0 0 ? S 19:03 0:00 [io_wqe_worker-0]\n Hereafter, this Kernel Thread will be referred to as a “worker”. This worker is generated by the following code and then, dequeues and executes the asynchronous execution tasks from Queue.\n static bool create_io_worker(struct io_wq *wq, struct io_wqe *wqe, int index) {  ...... worker-&gt;task = kthread_create_on_node(io_wqe_worker, worker, wqe-&gt;node,  &#34;io_wqe_worker-%d/%d&#34;, index, wqe-&gt;node);  ...... }\n  Aside: As explained earlier,   IORING_OP_TIMEOUT  behaves slightly differently from the figure below, but it is described as such for simplicity. Strictly speaking, when   io_timeout()  is called, it sets   io_timeout_fn()  in the handler and starts the timer. After the time set by the timer has elapsed,   io_timeout_fn()  is called to load the operations connected to the link in the asynchronous execution queue. In other words,   IORING_OP_TIMEOUT  itself is not enqueued in the asynchronous execution queue. TIMEOUT is used in the explanation so that it is easy to imagine that execution will stop.\n   It was found out that asynchronous processing is performed by a worker running as a Kernel Thread. However, there is a precaution here. Since worker is runninng as a Kernel Thread, the execution context is different from the thread which calls io_uring related system calls. Here, the “execution context” means the  task_struct structure associated with the process and various information associated with it. For example,  mm (Manage the virtual memory space of the process) ,  cred (holds UID/GID/Capability), files_struct (holds a table for file descriptors. There’s an array of  file structure in  files_struct structure, and file descriptor is its index) and so on.\n Of course, if it doesn’t refer to these structures in the thread that calls the system call, it may refer to the wrong virtual memory or file descriptor table, or issue I/O operations with Kernel Thread privileges (≒ root) [²].\n [²]: By the way, this was an actual vulnerability, and at that time it forgot to switch cred, and operations were able to be executed with root privileges. Although the operation equivalent to open  open() was not implemented at that time, it was possible to notify the privilege in sendmsg’s SCM_CREDENTIALS option that notifies the sender’s authority. It is a problem around D-Bus because the authority is confirmed by it.  https://www.exploit-db.com/exploits/47779\n Therefore, in io_uring, those references are passed to the worker so that the worker shares the execution context by switching its own context before execution. For example, you can see that then references to  mm and  cred are passed to the  req-&gt;work in the following code.\n static inline void io_req_work_grab_env(struct io_kiocb *req,  const struct io_op_def *def) {  if (!req-&gt;work.mm &amp;&amp; def-&gt;needs_mm) {  mmgrab(current-&gt;mm);  req-&gt;work.mm = current-&gt;mm;  }  if (!req-&gt;work.creds)  req-&gt;work.creds = get_current_cred();  if (!req-&gt;work.fs &amp;&amp; def-&gt;needs_fs) {  spin_lock(&amp;current-&gt;fs-&gt;lock);  if (!current-&gt;fs-&gt;in_exec) {  req-&gt;work.fs = current-&gt;fs;  req-&gt;work.fs-&gt;users++;  } else {  req-&gt;work.flags |= IO_WQ_WORK_CANCEL;  }  spin_unlock(&amp;current-&gt;fs-&gt;lock);  }  if (!req-&gt;work.task_pid)  req-&gt;work.task_pid = task_pid_vnr(current); }\n  You can see that the reference to  files_struct is passed to the  req-&gt;work in the following code.\n static int io_grab_files(struct io_kiocb *req) {  ......  if (fcheck(ctx-&gt;ring_fd) == ctx-&gt;ring_file) {  list_add(&amp;req-&gt;inflight_entry, &amp;ctx-&gt;inflight_list);  req-&gt;flags |= REQ_F_INFLIGHT;  req-&gt;work.files = current-&gt;files;  ret = 0;  }  ...... }\n  Then, before execution, these are replaced with the contents of the worker’s  current (a macro that gets the  task_struct currently running thread).\n static void io_worker_handle_work(struct io_worker *worker)  __releases(wqe-&gt;lock) {  struct io_wq_work *work, *old_work = NULL, *put_work = NULL;  struct io_wqe *wqe = worker-&gt;wqe;  struct io_wq *wq = wqe-&gt;wq; do {  ...... if (work-&gt;files &amp;&amp; current-&gt;files != work-&gt;files) {  task_lock(current);  current-&gt;files = work-&gt;files;  task_unlock(current);  }  if (work-&gt;fs &amp;&amp; current-&gt;fs != work-&gt;fs)  current-&gt;fs = work-&gt;fs;  if (work-&gt;mm != worker-&gt;mm)  io_wq_switch_mm(worker, work);  if (worker-&gt;cur_creds != work-&gt;creds)  io_wq_switch_creds(worker, work);  ......  work-&gt;func(&amp;work);  ......  } while (1); }\n  Now, let’s move on to the explanation of the vulnerabilities. In the code below (I posted earlier), you can see that the worker is passing a reference to the  files_struct structure of the thread executing the system call to the structure that the worker will refer later  without incrementing the reference counter.\n static int io_grab_files(struct io_kiocb *req) {  ......  if (fcheck(ctx-&gt;ring_fd) == ctx-&gt;ring_file) {  list_add(&amp;req-&gt;inflight_entry, &amp;ctx-&gt;inflight_list);  req-&gt;flags |= REQ_F_INFLIGHT;  req-&gt;work.files = current-&gt;files;  ret = 0;  }  ...... }\n  By the way, as explained briefly earlier, when enqueueing a task in the Queue for asynchronous execution, the reference to the  file structure is retained first from the specified file descriptor (passed to the  io_kiocb structure).\n static int io_req_set_file(struct io_submit_state *state, struct io_kiocb *req,  const struct io_uring_sqe *sqe) {  struct io_ring_ctx *ctx = req-&gt;ctx;  unsigned flags;  int fd; flags = READ_ONCE(sqe-&gt;flags);  fd = READ_ONCE(sqe-&gt;fd); if (!io_req_needs_file(req, fd))  return 0; if (flags &amp; IOSQE_FIXED_FILE) {  if (unlikely(!ctx-&gt;file_data ||  (unsigned) fd &gt;= ctx-&gt;nr_user_files))  return -EBADF;  fd = array_index_nospec(fd, ctx-&gt;nr_user_files);  req-&gt;file = io_file_from_index(ctx, fd);  if (!req-&gt;file)  return -EBADF;  req-&gt;flags |= REQ_F_FIXED_FILE;  percpu_ref_get(&amp;ctx-&gt;file_data-&gt;refs);  } else {  if (req-&gt;needs_fixed_file)  return -EBADF;  trace_io_uring_file_get(ctx, fd);  req-&gt;file = io_file_get(state, fd);  if (unlikely(!req-&gt;file))  return -EBADF;  } return 0; }\n   So the worker does not have to retrieve it from the file descriptor again and does not need to refer to the  files_struct structure. If so, it seems that there is no problem that the reference counter of the  files_struct structure is not incremented(because it is not used).  But this assumption is not true in Linux Kernel 5.5 and later. This is because system calls that affect file descriptor tables, such as  open/ close/ accept , are now available via io_uring. Obviously, these system calls affect the file descriptor table, so it looks like something can be used for exploitation However,\n Even if you simply calls  open/ close/ accept etc., nothing can happen if the  files_struct structure is available.   — Of course, system calls have  countermeasures when handling the same file by multiple threads, so it is not possible to simply cause a race condition between the calling thread and the worker.\n By freeing the  files_struct with setting reference counter to 0, a new process may reuse it as a  files_struct for that process. The worker will get a reference to the new process’s  files_struct when reused.  — But  file structure is already obtained from the file descriptor, ̶s̶o̶ ̶i̶t̶ ̶c̶a̶n̶n̶o̶t̶ ̶g̶e̶t̶ ̶a̶ ̶r̶e̶f̶e̶r̶e̶n̶c̶e̶ ̶t̶o̶ ̶t̶h̶e̶ ̶f̶i̶l̶e̶ ̶s̶t̶r̶u̶c̶t̶u̶r̶e̶ ̶o̶f̶ ̶t̶h̶e̶ ̶n̶e̶w̶ ̶p̶r̶o̶c̶e̶s̶s̶ (This was a lie. I’ll describe in “aside” part.)  — It’s possible to insert a  file structure into the file descriptor table of a new process by opening a file. But it will not be referenced. (Because people don’t use fixed file descriptor number while programming.)\n Here, I will explain the mechanism around the reference counter of the  file structure in  countermeasures when handling the same file by multiple threads. Yes, it’s a spoiler. The conclusion will be that it can actually be abused.\n  To understand how the reference counters in the  file structure work, we first need to understand what open/close actually does. Of course, the behavior changes depending on the actual file to be opened, but the following can be said in common.\n    static struct file *__alloc_file(int flags, const struct cred *cred) {  struct file *f;  int error; f = kmem_cache_zalloc(filp_cachep, GFP_KERNEL);  ......  atomic_long_set(&amp;f-&gt;f_count, 1);  ......  return f; }\n   static long do_sys_openat2(int dfd, const char __user *filename,  struct open_how *how) {  ......  fd = get_unused_fd_flags(how-&gt;flags);  if (fd &gt;= 0) {  struct file *f = do_filp_open(dfd, tmp, &amp;op);  if (IS_ERR(f)) {  put_unused_fd(fd);  fd = PTR_ERR(f);  } else {  fsnotify_open(f);  fd_install(fd, f);  }  }  putname(tmp);  return fd; }\n     int __close_fd(struct files_struct *files, unsigned fd) {  struct file *file;  struct fdtable *fdt; spin_lock(&amp;files-&gt;file_lock);  fdt = files_fdtable(files);  if (fd &gt;= fdt-&gt;max_fds)  goto out_unlock;  file = fdt-&gt;fd[fd];  if (!file)  goto out_unlock;  rcu_assign_pointer(fdt-&gt;fd[fd], NULL);  __put_unused_fd(files, fd);  spin_unlock(&amp;files-&gt;file_lock);  return filp_close(file, files); out_unlock:  spin_unlock(&amp;files-&gt;file_lock);  return -EBADF; }\n     The important thing here is the  fget()/ fput() functio\n......", "posttime": "2021-06-22 03:20:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计数,privilege,io", "title": "CVE-2021-20226参考计数错误，导致本地特权Escalati ", "title_en": "CVE-2021–20226 a reference counting bug which leads to local privilege escalati", "transed": 1, "url": "https://flattsecurity.medium.com/cve-2021-20226-a-reference-counting-bug-which-leads-to-local-privilege-escalation-in-io-uring-e946bd69177a", "via": "", "real_tags": ["计数", "privilege", "io"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067269, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "WWDC 2021主题演讲使其更加清晰，苹果正在开放的常量衬底的组件构建。这不是他们的第一年 -  WWDC 2019是他们首先拉回幕后的地方。从那时起，很清楚他们有技能拉开硬件和amp;设备软件堆栈。我一定不太肯定，他们了解建立引人注目的AR生态系统所需的全部范围 - 一种成交。随着今年的功能，很明显，他们可能能够把它拉开。在那里，在开放 - 每年他们都会仔细移动。\n 如果他们能够让人们为该生态系统创造内容，我仍然不确定; “建立它，他们会来”可能还不够。\n   最终用户将通过提供体验的默认设备体验偏差。客户无法刚刚将耳机放在上方并倾倒到矩阵中的“构造”中，要求他们安装一些应用程序。它必须提供一些有用的盒子。\n  AR Metaverse不是关于沉浸式，聚焦的相互作用。短术将支持经验。这些经历需要在＆amp时为您提供上下文信息;在你需要它的地方 - 在你对世界的移动时，或者作为更有意地“告诉我更多”的互动的一部分。\n 窗口小部件是将您连接到这些偶然使用的场景中的许多情况的视觉效果，这些方案将跨越AR Metaverse。它们将提供由远程设备驱动的及时信息，以便耳机可以呈现丰富的信息，而无需执行大部分相关性的计算。 Swifui是这里犯罪的关键伙伴 - 可能是真正的力量，而不是小部件平台本身。\n “与您共享”将通过上下文筛选，而且，uhh，表面需要的内容。从许多来源采取不同类型的内容（今天的消息，将来举行举行举行的举行），并在合适的时间冒出正确的东西将是不是压倒性的人的关键。\n 聚光灯将利用对内容，上下文和输入的相同理解，但是当您故意通过MetaVerse寻求有关世界的更多信息时，支持这些情况。 \n支持所有这些智能人是意图框架，使开发人员能够将结构化操作暴露给系统经验，而没有系统必须具有定制的途径。\n  设备 - 本地语音识别是AR的基础 - 我们无法拍摄我们的脚和amp;当我们等待云端的往返时旋转我们的拇指，以得出如何处理如何处理“这五个项目，并在下周在办公室时记住它们”。语音 - 快速演讲 - 尤其是AR的关键，因为您不会永远能够用手。将其移动到设备表明Apple已获得足够的理解，以相信语音到文本模型足够稳定，以便以某种形式在固件中进行编码。理解也有先进，给出你可以离线执行许多操作。\n  用肢体操纵东西的能力将在AR中很重要，与您的声音相互作用将比更复杂的任务更为普遍。现实是我们拥有一台绑在头部的电脑，意图让我们更有能力。不要让我经历身体动作 - 移动事情，触摸东西 - 数字化。如果这种情况，我可能只是在物理世界中做到这一件事，而不是因为需要先向世界数字化。\n 快捷方式是解锁此 - 互动和amp的胶水;跨应用程序的连接将通过其他输入机制调用的复杂自动化组合在一起。应用程序将提供许多行动要执行，我们将能够结合，以使东西大于其部分的总和。\n  注意似乎是移动设备和amp的经验;桌面。但是，我们将看到的丰富信息＆amp;在MetaVerse内体验，我们需要一些东西来帮助我们目录，策划和组织所有这些信息。随着标记，提到等等的改进，提到等（由您当前使用的应用程序驱动）正在填写构建您在AR世界中关注您的数字笔记本的更大背景。\n 今天的快速注释导出它的上下文，Snapshots等从Apps的线程导致隐式系统理解MetaVerse＆amp;你周围的世界。您不想在网页或文档上拍笔记 - 您需要将该物理世界带入成权。\n 备注最终是一种审查＆amp的方法;了解你在偏见的“持有”的“持有”。 \n你不能只是魔法薄薄的空气。您必须建立它 - 这些组件需要实时耗尽设备。当然，它们通过体验基板在设备上浮出水面，但它们是关于将本地设备延伸到共享，接收和推导世界的内容。\n  直到我们拥有能够很容易生成的超高保真度的人才＆amp;共享，我们需要某种代理（AKA头像）。备忘录看起来很乐意在数字世界中代表自己。 Apple继续提高与Memoji适当表达您身份的方式，只会持续到未来。我们必须能够在正确的时间内表达正确的身份，在正确的地方，由自己控制，而不是生态系统。\n  地图 - 或者更具体地说是启用地图的数据 - 是为AR MetaVerse提供支持的氧气。没有它，没有骨头可以挂起任何其他经验。能够理解你在地球上的地方是允许其余的经验，以有效地定位在你身边。\n 利用Arkit的现场了解＆amp;位置锚定定位您的实际世界方向，当您从途中出现时是在较低级别的基础上建立建筑的一个很好的例子 - 尽管沿着映射的基础。\n 与新的增强细节建筑物＆amp;物理基础设施模型将矩形斑点延伸到地图数据内的桥梁，建筑物，正方形的复杂表示，甚至树放置甚至树放置都会对他们以前没有拥有的数据的信心。\n  这是音乐，对吗？不。它是音频的GPS。自从苹果几年前被苹果买了以来，我一直倾向于“这不是关于音乐”。\n 现在Shazamkit API让您识别任何音频，并使用匹配项来推动您的体验。这只是“认识到所有事情”的另一个方面，这将是为了支撑ar（并吓到每个人的生活）。 \nShazamkit API  - 围绕会话和输入的缓冲区驱动，以生成要匹配的所需签名 - 只是一个基于音频外的不同签名源生成其他匹配的跳跃跳跃和a-a-跳跃。点云的匹配签名 - 匹配的视频输入 - 似乎令人赏心不足地关闭。想象一下，而不是暴露媒体项目（例如歌曲），位置，地标，人，建筑物，商店，经验和过境点等。这将量身定制由Apps（或AppClips👀）＆amp驱动的经历;无论你在哪里，无论你在遇到什么。\n 当您考虑立即创建自定义目录时 - 一组签名W /您自己的元数据 - 它开始将窗帘拉回令人信服的基板，以发现增强。可以在设备上生成这些签名，以便在更大的服务目录中进行稍后共享或预先计算的包含，允许用户开始为自己绘制自己的世界，以及其他人。\n WWDC谈话中提供的示例利用了恒定的匹配流来创建屏幕体验，例如通过匹配能够及时启用自动内容前进。想象一下这个世界规模。\n 即使是“Shazam Library”编目用户匹配的匹配似乎是你在世界上旅行时收集的“持有”的一部分（或者备忘录）你通过你的船只通过你的包裹用来打嗝） 。\n 当您开始考虑Shazamkit作为预先生成的模型和amp的更高级别抽象;来自Arkit＆amp的内容锚点; Coreml，您可以看到基础如何开始进一步归信的值，并进一步堆叠堆栈。\n  由本地信息驱动的位置意识，以提升GPS的重量，Cameras等人知道您在空间内的位置是关键。知道你在地球上的地方＆amp;在本地空间内，直到您需要了解该空间内事物的语义含义。作为相对于您的空间方向的额外输入（AKA设备），“查找我的”-Style设备将有助于收紧物理世界的映射以启用增强 - 真的这是平台基板的一部分，但是同样的技术下潜身体和虚拟之间的关键桥。\n 使用超宽带硬件和amp; “查找我的”网络是一个级别的丰富程度，可以为物理锚启用 - 为您创造一种方法，以便与物理物品合作，并将其带入数字世界。这些设备只能是简单的信标，也可以与数据网络＆amp;测距他们可以成为丰富的航点，以支撑能够用物理覆盖数字。由于这些设备被发现，他们可以参与您的持有袋，并在局部空间中创建量身定制的体验。 \n这不是访问成权，而是生成偏见的经验。你不能只是把偏好的空间搬到一个大空荡荡的房间，并在佩戴护目镜并绊倒光明的人们来说。现实作曲家让我们引导它。主要是一种促进专业创建的模型的场景组成的经验，WWDC21为这些模型开辟了一种新的方式，似乎很漂亮。\n 在主题演讲中进行了演示，但只是一个API，“对象捕获”API使得能够通过相机生成物理世界的数字双胞胎。它不是点拍摄相机级别，因为它需要桌面设备来执行它的工作（即使是m1 ...类似ipad pro🤔）。它还不需要iPhone或iPad来捕获输入图像：任何单反的工作 - 虽然带LIDAR的Apple设备将提供我只能假设的深度地图信息，但是看起来很糟糕。\n 获取这些模型在没有专业的帮助下生成的级别足够好，足以让政府工作，并能够将它们集成到您的场景中 - 通过现实作曲家或realitykit  - 将解锁一堆内容一代以帮助在成交量中创建事物。没有那个，我们留下来支付艺术家做得很好，当我们不确定它是否是正确的工作，它是通过适当技能的艺术家的可用性所在的。\n   您已经获得了基线设备体验，并且提供了一种提供的基板。但是建立应用程序和amp呢？提供内容？我们需要那些开发者有针对性的工具＆amp;建立这些经历的API。苹果一直在这一点，事实证明。\n  SWIFTUI越来越能力，每个版本都有更多的能力，并且似乎是Apple的长期UI平台。它也不只是“低于玻璃”的经历。\n 由“可扩散的”概念提供“正确的工作”，在正确的时间，卸载到平台的范式范式 - 状态管理，声明性绑定和功能模式。\n 这个是缓慢的烧伤，它不像AR平台组件（第三维度在哪里？）。但是，AR一直不会成为“所有3D” - 有可能是最终的上下文经验，最终是2（.5）D体验。 RealityKit涵盖了所有3D体验的深度 - 并且将有一个融合两者的地方。最大限度地减少参与生态系统的基线成本是关键：3D沉浸式经验在技术上具有多种数量级，技术上和设计明智。 SWIFTUI模式具有在该空间中的价值，但它也可以是一个桥梁，用于获得2（.5）D的桥梁，以便以不要求提高成本的方式进入用户手中的桥梁。 \n但这不仅仅是关于开发人员体验 - 它也是降低基线计算成本。我们无法运行复杂的应用程序，直接在耳机上直接播放复杂的应用程序 - 物理学就不在那里。谣言是苹果护目镜将被束缚（无线）束缚，护目镜是在您的伴侣设备上计算的东西的投影。 Swifui的宣言“差异”模型将使这一点成为可能，并使渲染本身卸载到耳机，但驱动州和amp;来自伴侣设备的逻辑。\n  RealityKit是Swifui的沉浸式兄弟姐妹。这是一个完整的3D发动机，用于建立丰富，充满活力的体验。对于WWDC 21，RealityKit专注于生活质量改进 - 更好的ECS系统，以及改善渲染 - 辅助让更多人采用它。\n 这是一个表格赌注平台，用于实现AR的真实沉浸体验。我不认为这个平台已经完成，或者打算递送AR'，但它也代表了最明显的需求：建立一个可行的3D应用程序平台，而不要求每个人都落到金属水平和amp的水平;买一个游戏引擎。\n  AppClips可能是基础设施是在现实世界中发现应用程序的基础设施。当然，我们将有复杂的丰富的应用程序 - 说Facebook，或LinkedIn（😬） - 每个人都安装，但是将有其他经验偶然进入。类似于AppClips的原始意图（餐馆的菜单或踏板车租赁），他们会在需要时出现。\n 最终，AppClips是一个自动二进制部署工具，用于某些“小二进制”的定义。人们已经在AppClips中建造了AR经验，所以这似乎是扣篮。\n 在这里没有很多新的新功能，但他们已经完成了一些关键部件的循环 - 特别是当您导航到它时将直接带到应用程序的HTML元数据标记。无论锚点＆amp;位置上下文梦想将根据您的位置推动无缝安装。\n  今年Apple增加了阶段（物理音频时空发动机），主要专注于提高游戏的经验。但是音频是基于AR的 - 你不能只是玩一些简单的立体声音频，并期望结果是自然和引人注目的体验。您必须在混合的AR世界内建模用户，并使用该来定位来源和amp;计算影响。 \n阶段通过提供一种描述您的世界的方法来实现这一目标，并使其基于该世界计算音频影响。它摘要所有头部定位，原始设备的位置，以及在现实世界中分层的镜子体验。考虑到使音频不如“播放音频文件”那样简单的事实。您必须描述该音频和amp的属性;在应用程序或游戏体验中的环境形状，声音行为等似乎是您想要的。如果这些可以自动从现实世界网格生成和实际内置的场景中拉入，我们真的用天然气烹饪。\n 考虑系统如何使用此范例和模型，您可以为多个应用程序提供一个非常引人注目的世界系统系统。如果你眯着眼睛，你可以看到它们在不同的物理空间中建立一个苹果音乐音频源的能力，在没有物理音频源的情况下创建完美的多房间音频，他们在打开并告诉每个人的情况下。\n  在数字内容上驱动的同步体验显然将成为AR的关键体验。人们需要交换＆amp;实时地同步多个参与者跨多个参与者的数据 - 放置静态信息以供以后的发现不是超级引人注目的体验。\n 分享播放使人们能够通过FaceTime建立一个相互的会话。但是FaceTime只是今天的向量 - 从外部角度来看，没有关于分股，从根本上依赖它，可以添加其他向量。\n 在它的核心，分享是通过不透明传输的实时消息交换系统。这些消息是开发人员定义的，可以包含任何内容 - 媒体驱动的体验有效地仅包装，并针对该特定范例定制。\n 虽然他们今天没有结合，但SharePlay和Arkit的协作体验能够明确的播放模型，以创造跨越一个人的经验。\n   在平台上的设备上真正的难题是在设备上。有一些互动和amp;只能由本地设备提供的功能以及其解决方案是新颖的，并受到功率和amp的限制;延迟要求。又是艰难的。 \n对于全球可访问性意识日，Apple宣布了许多功能 - 其中一个是'Apple Watch的Assistivetouch'。此功能旨在促进为具有电机控制挑战的人使用手表，这一点瞥见了未来。它正在推动与手表的互动，只使用一只手，在手表上附加到。只是一些手势（夹紧，双夹，捏和双夹）或手腕运动（有效地通过倾斜控制），可以控制手表。这对我们所需要的人来说真棒。\n 但是，当我们谈论evaverse＆amp时; AR相互作用，通过手势的手势将是一个重要的相互作用方法。声音将有助于环境方案，但是当您在需要重点的场景时，您将要直接互动。这些手势本质上是基本的，但他们只是一开始。其他经历（挖清胶，Oculus）由视频跟踪驱动，但Apple已经有一个连接到您的手腕的设备！这可以做姿势！利用这一点作为手机/手表/护目镜的神圣三位一体的一部分，为您的AR Goggles体验创建一个voltron的体验似乎是一个垃圾扣篮。\n  以前创建ML已经增加了手势的检测和姿势，但不能真正告诉你它在做什么。当然，你可以派生单独的指挥者，但如果你想认识到它在做什么，你就是自己的。今年他们正在关闭这种差距。\n 这里的经验并不专注于以任意方式驾驶手势 - 这是创建ml，而不是输入堆栈 - 而是专注于手中的关键姿势的分类。他们对那些职位的动作。\n 值得注意的是，这些由视频＆amp驱动;图片。目前尚不清楚这在AR眼镜模型中可能有效哦嘿相机绑在你的脸上。\n  我们真的在v5吗？ hu！无论如何...... Arkit看起来像是在哪里寻找所有Snazzy-and Cool的功能。问题是它真的是RealworldPositioningAndunderstandKit。这是体验的一个非常重要的部分，但它不是一个完整的故事（Duh，看到这篇文章的其余部分！）。\n 您已经在行星（GPS）上进行了定位跟踪，以及本地（您的相机是点的位置），因此您可以找到有人能够增强其现实的内容。它仍然陷入手机中，但最终揭露世界相对位置的API将是相同的。 \nArkit的一些更细微的部分包括Motion＆amp; 面部跟踪 - 这些觉得它们是由面部混搭经验的驱动和运动运动跟踪。 但了解人民运动将是真实世界中人们引人注目的关键部分 - 你想放置那个小的'它是如此'漂浮在他们上面并准确地跟踪他们吗？  这是第一个  ...... ", "note_en": "The WWDC 2021 keynote made it ever clearer Apple is building the components of a metaverse substrate in the open. This isn’t their first year — WWDC 2019 was where they first pulled back the curtain. Since then, it’s been clear they have the skills pull off the hardware &amp; device software stack. I’ve been less sure they understood the full scope needed to build a compelling AR ecosystem – a  metaverse. With this years features, it’s become clear they might be able to pull it off. And it’s out there, in the open - every year they’re moving a little bit closer.\n I’m still  unsure of if they’ll be able to get people to create  content for that ecosystem; “ Build it and they will come” might not be enough any more.\n   End users will experience the metaverse through the default device delivered experience. Customers can’t just put the headset on and be dumped into the equivalent of the “ Construct” from The Matrix asking them to get some apps installed. It’s gotta provide  some usefulness out of the box.\n  The AR metaverse aren’t about immersive, focused interactions. Ephemerality will underpin the experiences. Those experiences need to provide you with contextual information when &amp; where you need it — either ambiently as you move about the world, or as part of a more intentional ‘tell me more’ interaction.\n Widgets are the  visuals that connect you to many of these occasional-use scenarios that are going to be prevalent across the AR metaverse. They’ll provide timely information driven by a remote device, so that the headset can present rich information without having to perform much of the computation for relevance itself. SwiftUI is a key partner in crime here — likely the real power, rather than the widget platform itself.\n “Shared with you” will sift through context, and, uhh, surface the content that you need. Taking the different  types of content from many sources (messages today, metaverse bag-of-holding in the future), and bubbling up the right things at the right time will be key to not overwhelming people.\n Spotlight will leverage the same understanding of the content, context, and inputs, but tailored to support those situations when you’re  intentionally seeking more information about the world through the metaverse.\n Underpinning all of these smarts is the intents framework that enables developers to expose structured operations to system experiences, without the system having to have tailored pathways for ever eventuality.\n  Device-local speech recognition is fundamental to AR — we can’t tap our feet &amp; twiddle our thumbs while we wait for a round-trip to the cloud to conclude how to handle “Group these five items, and remember them for next week when I’m at the office”. Speech — fast speech — is going to be key especially for AR since you won’t always be able to use your hands. Moving it to the device suggests that Apple has gained enough understanding to believe that the speech-to-text model is stable enough to encode in the firmware in some form. Understanding has advanced too, given you’ll be able to perform many operations offline.\n  The ability to manipulate things with your limbs is going to be important in AR, interacting with your voice is gonna be much more common for the more complex tasks. The reality is we have a computer strapped to our heads, with the intent of making us  more capable. Don’t just make me go through the  physical motions — moving things, touching things et al –  digitally. I might as well just do  that thing in the physical world if thats the case, and not be trapped by the need to digitise the world first.\n Shortcuts is the glue to unlock this — interactions &amp; connections across apps to bring together the complex automations that you can invoke through other input mechanisms. Apps will offer lots of actions to be performed, which we’ll be able to combine to make something greater than the sum of it’s parts.\n  Notes seems like an experience for mobile devices &amp; desktops. But with the wealth of information we’ll be seeing &amp; experiencing within the metaverse, we need  something to help us catalog, curate, and organise all that information. With the improvements in tagging, mentions, etc  and the quick notes (driven by your currently-being-used-app) are filling out the larger context of building out your digital notebook that will follow you in the AR world.\n Quick Notes deriving it’s context, snapshots etc from apps today is that thread that leads to implicit system understanding of the metaverse &amp; the world around you. You don’t want to take notes on a web page, or a document — you need to bring that physical world into the metaverse.\n Notes is ultimately a way to inspect &amp; understand your ‘ Bag of holding’ that follows you in the metaverse.\n   You can’t just magic the metaverse out of thin air. You’ve gotta build it — and those components need to live off-device. Sure, they are surfaced on the devices through the experience substrate, but they are about things that extends past your local device to sharing, receiving, and deriving context about the world.\n  Until we have models of people with super-high fidelity that able to be easily generated &amp; shared, we need some sort of proxy (aka avatar). Memoji seem pretty good for representing yourself in the digital world. Apple continues to improve the ways to express your identity appropriately with Memoji, and that will only continue into the future. We have to be able to express the right identity, at the right time, in the right places, controlled by ourselves, not the ecosystem.\n  Maps – or more specifically the data that enables maps – is the oxygen that powers the AR metaverse. Without it, there are no bones to hang any other experiences on. Being able to understand  where you are on the planet is what allows the rest of the experience to efficiently localise around you.\n Leveraging ARKit’s scene understanding &amp; location anchors to locate your physical real-world orientation when you emerge from transit is a great example of building on lower level foundations — albeit along side the foundation that is maps.\n With the new enhanced detail buildings &amp; physical infrastructure models that extend beyond rectangular blobs to complex representations of bridges, buildings, squares, and even tree placement within the map data shows a confidence in the  data that they haven’t had before.\n  It’s for music, right?  Nope. It’s GPS for audio. Ever since they got bought by Apple a few years ago, I’ve been leaning into ‘ this isn’t about music’.\n Now the ShazamKit API lets you recognise any audio, and use what matches to drive your experiences. This is just another aspect of ‘recognise all the things’ that is going to underpin AR (and scare the living 💩 out of everyone).\n The ShazamKit API — driven around sessions and buffers of inputs to generate the required signatures to match to — is only a hop-skip-and-a-jump away from generating other matches based on different signature sources outside of audio. Matching signatures of a point cloud – video input for matching – seem tantalisingly close. Imagine that instead of exposing media items (e.g. Songs), locations, landmarks, people, buildings, stores, experiences, and transit points etc were exposed instead. This would tailored experiences driven by apps (or AppClips 👀) &amp; the context of wherever you are, whatever you are experiencing.\n When you consider that you can now create custom catalogs — a set of signatures w/ your own metadata — it starts to pull back the curtain a little on a compelling substrate for discovery of  augmentations. These signatures can be generated on device for later sharing or pre-computed inclusion in a larger service catalog, allowing users to start painting their own world for themselves, and for others.\n The  examples provided in the WWDC talk leverage a constant stream of matches to create screen experiences, such as enabling automatic content advancement in time with the matches. Imagine this at world scale.\n Even the “Shazam Library” that catalogs a users matches starts to seem like part of your ‘Bag of holding’ you collect as you journey through the world (or metaverse) (Notes is the vessel you use to rummage through your bag of holding).\n When you start to think about ShazamKit as a higher level abstraction over pre-generated models &amp; content anchors from ARKit &amp; CoreML, you can see how the foundation starts to enable value to be accrued further and further up the stack.\n  Location awareness driven by  local information to lift the weight of GPS, cameras et al for knowing where you are within a space is key. Knowing where you are on the planet &amp; within a local space, is fine until you need to know the semantic meaning of things  within that space. As an additional input into the orientation of the space relative to you (aka the device), “Find My”-style devices will help tighten up the mapping of the physical world to enable augmentation — really this is part of the platform substrate, but the same tech underlies a key bridge between physical and virtual.\n With the ultra-wide-band hardware &amp; the “Find My” network a level of richness is enabled for physical anchors — creating a way for you to concretely interact with a physical item, and bring it into the digital world. These devices can just be simple beacons, but also with the data network &amp; ranging they can become rich waypoints to underpin the ability to overlay digital with the physical. As these devices are discovered they can participate in your bag of holding, and create tailored experiences with in a localised space.\n   This isn’t about accessing the metaverse, but the generation of experiences for the metaverse. You can’t just stand metaverse up as a big empty room and say ‘have at it’ to people wearing goggles and tripping the light fantastic. Reality Composer lets us  bootstrap it. Primarily an experience to facilitate composition of scenes on professionally created models sourced else where, WWDC21 opened up a new way for those models to be created, and it seems  pretty snazzy.\n Demoed in the keynote, but just an API, the “ Object Capture” API enables generating digital twins of the physical world through a camera. It’s not point-and-shoot-camera level, since it requires a desktop device to do it’s work (A mac, even with an M1… like an iPad Pro 🤔). It also doesn’t require an iPhone or iPad to capture the input images: any SLR will work – although an apple device with LIDAR will provide depth map information that I can only assume makes it  moar bettar.It  looks pretty damn good.\n Getting these models generated  without professional help at a level  good enough for government work, and able to integrate them into your scenes — either through Reality Composer or RealityKit — will unlock a bunch of content generation to help create  things in the metaverse. Without that, we’re left to paying artists to do a  great job, when we’re not sure if it’s the  right job yet, and it’s gated by the availability of artists with the appropriate skills.\n   You’ve got the baseline device experiences, and a metaverse provided substrate. But what about building apps &amp; delivering content? We’re going to need those developer-targeted tools &amp; APIs to build those experiences. Apple has been on this for a while, it turns out.\n  SwiftUI is getting more capable with every release, and appears to be the long-term UI platform for apple. It also isn’t just about ‘below the glass’ experiences.\n Driven by ‘diffable’ concepts providing ‘Right work, at the right time, offloaded to the platform’ paradigms — state management, declarative binding, and functional patterns for you views.\n This one is a slow burn, and it doesn’t feel like an AR platform component (Where’s the third dimension?). But AR isn’t going to be ‘all 3D, all the time’ — there are contextual experiences that are ultimately 2(.5)D experiences. RealityKit covers all the depth of a 3D experience — and there will be places that blend the two. Minimising the baseline cost of participating in the ecosystem is key: 3D immersive experiences have multiple-orders-of-magnitude more cost — technically and design wise. The SwiftUI patterns have value in that space, but it  also can be a bridge for getting 2(.5)D experiences into users hands in a way that doesn’t require committing to that increased cost.\n But it’s not just about the developer experience — it’s also about reducing the baseline computational cost. We can’t run complex apps, with complex logic, directly on headsets yet — the physics just isn’t there.  Rumours are that the apple goggles will be (wirelessly) tethered, with the goggles being a projection of things computed on your companion device. SwiftUI’s declarative, ‘diffing’ model will make this  possible, and have the rendering itself offloaded to the headset, but drive the state &amp; logic from a companion device.\n  RealityKit is the immersive sibling of SwiftUI. It’s a full 3D engine for building rich, dynamic experiences. For WWDC 21, RealityKit is focused on quality of life improvements — a better ECS system, and improved rendering — all in aid of getting more people to adopt it.\n This is a table-stakes platform for enabling true immersive experiences for AR. I don’t think this platform is done, or intends to deliver AR ‘as is’, but it also represents the most obvious need: Build a viable 3D app plat without asking everyone to drop to the level of METAL &amp; buying a game engine.\n  AppClips are likely to be the infrastructure underpinning discovery of apps in the real world. Sure, we’re going to have complex rich apps — say Facebook, or LinkedIn (😬) — that everyone installs, but there will be other experiences that you stumble into. Similar to the original intent of AppClips (menu at a restaurant, or scooter rental), they’ll appear when you need them.\n Ultimately, AppClips is a automated binary deployment tool for some definition of ‘Small Binary’. People are already building AR experiences in AppClips, so this seems a slam dunk.\n There isn’t a lot new here this year, but they’re closing out the loop for some key parts — specifically the HTML metadata tag to take you direct to an app when you navigate to it. Whatever the anchor &amp; location context dreams up will drive seamless installs based on your location.\n  This year Apple added  PHASE (Physical Audio Spatialisation Engine), primarily focused on improving the experience in games. But  audio is foundational to AR — you’d can’t just play some simplistic stereo audio and expect the result to be a natural and compelling experience. You’ve got to model the user within the blended AR world, and use that to position the sources &amp; compute the impact.\n PHASE makes this possible by providing a way to describe your world, and have it computationally impact the audio based on that world. It abstracts all the head positioning, location of originating device, and the aural experience that gets layered over the real world. Consider the fact that enabling that audio is not as simple as ‘play audio file’. You’ve got to describe the properties of that audio &amp; the environment — shape, sound behaviour etc. Within an app or game experience this seems just what you’d want. If these could pulled in automatically from the real world mesh generation  and with the scenes built in RealityKit, and we’re really cooking with gas.\n Consider how the  system uses this paradigm and model, you’ve got a very compelling world system for audio across more than a single app. If you squint a little you can see them building the ability place an Apple Music audio source in different physical spaces  virtually, creating perfect multi room audio without physical audio sources, and they’re doing it in the open and telling everyone about it.\n  Synchronised experiences driven around digital content is clearly going to be a key experience with AR. People will need to exchange &amp; synchronise data across multiple participants in real time — placing static information for later discovery isn’t a super compelling experience.\n SharePlay enables people to establish a mutual session through FaceTime. But FaceTime is just the vector  today — nothing about SharePlay, from an external perspective, is fundamentally dependent on it, and other vectors can be added.\n At it’s core, SharePlay is a realtime message exchange system over an opaque transport. These messages are developer defined and can contain anything — the media driven experiences are effectively just wrappers over this, and tailored for that specific paradigm.\n While they’re not combined today, SharePlay and ARKit’s collaborative experiences enable a clear pay-for-play model for creating experiences that span more than one person.\n   The really hard problems are on device — on the platform. There are some interactions &amp; capabilities that can only be offered by a local device, and their solutions are novel  and constrained by power &amp; latency requirements. Aka hard.\n  For Global Accessibility Awareness Day apple announced a number of features — one of which was ‘ AssistiveTouch for Apple Watch’. This feature, intended to facilitate use of a watch for those with motor control challenges, is a little bit of a glimpse into the future. It’s driving interaction with a watch using only one hand, on the arm the watch is attached to. Just some hand gestures (Clench, Double-Clinch, Pinch, and Double-Pinch), or wrist movement (effectively a pointer controlled through tilt), you can control the watch. This is awesome for those of us that need it.\n But when we’re talking about the metaverse &amp; AR interactions, gestures through the hands are going to be a significant interaction method. Voice will help with the ambient scenarios, but when you’re in a scenario that requires focus you’re going to want to directly interact. These gestures are rudimentary in nature, but they’re just the beginning. Others experiences (Hololens, Oculus) are driven by video tracking, but Apple already has a device attached to your wrist – a watch! That can do gestures! Leveraging this as part of the holy trinity of phone / watch / goggles to create a  Voltron for your AR goggles experience seems a slam dunk.\n  Previously Create ML had added the detection of  hand presence and poses, but couldn’t really tell you  what it was doing. Sure, you could derive individual phalanges, but you were on your own if you wanted to recognise  what it was doing. This year they’re closing that gap.\n The experience here isn’t focused on driving gestures in an arbitrary way — this is Create ML, not the input stack — but instead focused on classification of key poses of hands &amp; their motion to those positions.\n It’s important to note that these are driven by video &amp; images. It’s unclear how this might work in an AR glasses model OH HEY CAMERAS STRAPPED TO YOUR FACE.\n  Are we really on v5? Huh! Anyway… ARKit  looks like where you’d be looking for all the snazzy-and-cool features. The problem is that it’s  really RealWorldPositioningAndUnderstandingKit. It’s a  really important part of the experience, but it’s not a  complete story (duh, see the rest of this article!).\n You’ve got the positioning tracking at a planet (GPS), and local (where / what angle you camera is point), so you can find what someone might be able to augment their reality with. It’s still trapped in the phone, but ultimately the APIs for exposing the world-relative location is going to be the same.\n Some of the more subtle parts of ARKit include motion &amp; face tracking — these feel like they’re driven by face-mashup experiences, and sports motion tracking. But understanding peoples motion will be key part of the compelling augmentation of people in the real world — you want to place that little ‘It’s So-and-So’ floating on above them and track them accurately, right?\n It’s int\n......", "posttime": "2021-06-22 03:19:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,透明,building,amp", "title": "Apple在透明的视线中建造了常见的衬底 ", "title_en": "Apple is building the metaverse substrate in plain sight", "transed": 1, "url": "https://www.codevoid.net/ruminations/2021/06/20/wwdc-2021-apple-metaverse-plain-sight.html", "via": "", "real_tags": ["apple", "透明", "building", "amp"]}, {"category": "", "categoryclass": "", "imagename": "56bd6d87d86222a80ac1831e6a1d5c72.jpg", "infoid": 1067267, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人类可以做很多植物不能做的事情。我们可以走来走去，我们可以说话，我们可以听到和看到和触摸。但植物对人类有一个主要的优势：它们可以直接从太阳中能量。\n 将阳光直接转换为可用的能量 - 称为光合作用的过程 - 可能很快是一个壮举，人类能够模仿太阳的能量，以便清洁，可存储，高效的燃料。如果是这样，它可以打开一个全新的清洁能源前沿。足够的能量在一个小时内以阳光的形式击中地球，以满足全年的所有人类文明的能源需求。\n  Yulia Puskhar，普渡大学理学院的生物物理学家和物理学教授可能有一种方法可以通过模仿植物来利用这种能量。\n 通过光伏电池利用风电和太阳能，是可用的两种主要形式的清洁能源。添加第三合成光合作用 - 将大大改变可再生能源景观。轻松存储能量的能力，而无需需要庞大的电池，会显着提高人类能力和有效地发电社会的能力。\n  风力涡轮机和光伏都在环境效应和复杂因素方面具有缺点。 Pushkar希望人造光合作用可能能够绕过那些陷阱。\n “我们和世界各地的研究人员难以努力地努力提出无障碍能量，”普斯卡尔说。 “干净和可持续的能量，我们可以使用无毒，轻松的可用元素创建。我们的人造光合作用是前进的方向。“\n 光合作用是一种复杂的工艺舞蹈，植物以葡萄糖的形式转换太阳的光芒和水分子。为此，他们使用颜料，通常是着名的叶绿素，以及蛋白质，酶和金属。 \n最接近人造光合作用的过程今天是光伏技术，太阳能电池将太阳的能量转化为电力。这种过程是着名的低效，能够捕获大约20％的太阳能量。另一方面，光合作用是彻底效率的;它能够将60％的太阳能量作为相关生物分子中的化学能。\n 简单的光伏电池 - 太阳能电池板的效率 - 受半导体吸收光能的能力和细胞产生功率的能力的限制。这种限制是科学家可以使用合成光合作用的东西。\n “随着人造光合作用，没有基本的物理限制，”普斯卡尔说。 “你可以很容易地想象一个70％效率的系统，因为我们已经在自然光合作用中具有先例。如果我们获得非常雄心勃勃的，我们甚至可以设想一个高达80％的系统。\n “当涉及分裂水时，光合作用是大量有效的，这是人造光合作用的第一步。植物中的光系统II蛋白是一千倍的一秒钟。眨眼，它已经完成了。“\n Pushkar的小组通过建造自己的人工叶片模拟来模仿该过程，该过程收集光并分裂水分子以产生氢气。氢气可以通过燃料电池用作燃料，或者通过燃料电池添加到诸如天然气的其他燃料中，或内置于燃料电池中，以从车辆到小型电子设备，实验室和医院的所有内容。她最近的发现，最近在光合作用期间分裂的水分子的洞察力，最近发表在Chem Catalysis：Cell Press中。\n Pushkar的科学家们的实验室实验与天然照相II蛋白质和合成催化剂的组合试图了解最佳作品 - 为什么。她还优先考虑使用易受地球上的化合物和化学品，易于访问和与地球无毒。\n 然而，人造光合作用的进展是复杂的，因为光合作用如此多方面，一个事实被生物化学学生繁殖。 \n“反应非常复杂，”Pushkar说。 “分裂水分子的化学性质非常复杂，困难。”\n 科学家自20世纪70年代以来一直在努力人工光合作用。这是很长一段时间，但是当您记住光合作用时，没有数百万年的时间才能发展。而且，科学家认为，与飞行，沟通或智力不同，光合作用只发展了一次 - 大约30亿年前，只有约15亿年的地球的存在。\n Pushkar Posits认为，在未来10-15年内，将使商业人工光合作用系统可能会开始上网。她的研究由国家科学基金会资助。\n 参考文献：“多核3D金属催化剂通过自由基偶联或通过水亲核攻击实现O-O键形成？ WNA通过罗马ezhov，Alireza Karbakhshs Ravari，Gabriel Bury，Paul F. Smith和Yulia Pushkar，5月2021年5月3日，Cem Catalysis：Celm Pressysis：Cell Pressics中，引导了罗马ezhov DOI：10.1016 / J.CHECAT.2021.03.013 ", "note_en": "Humans can do lots of things that plants can’t do. We can walk around, we can talk, we can hear and see and touch. But plants have one major advantage over humans: They can make energy directly from the sun.\n That process of turning sunlight directly into usable energy – called photosynthesis – may soon be a feat humans are able to mimic to harness the sun’s energy for clean, storable, efficient fuel. If so, it could open a whole new frontier of clean energy. Enough energy hits the earth in the form of sunlight in one hour to meet all human civilization’s energy needs for an entire year.\n  Yulia Puskhar, a biophysicist and professor of physics in Purdue’s College of Science, may have a way to harness that energy by mimicking plants.\n Wind power and solar power, harnessed by photovoltaic cells, are the two major forms of clean energy available. Adding a third — synthetic photosynthesis — would dramatically change the renewable energy landscape. The ability to store the energy easily, without requiring bulky batteries, would dramatically improve humans’ ability to power society cleanly and efficiently.\n  Both wind turbines and photovoltaics have downside in terms of environmental effects and complicating factors. Pushkar hopes that artificial photosynthesis might be able to bypass those pitfalls.\n “We and other researchers around the world are working incredibly hard to try to come up with accessible energy,” Pushkar said. “Energy that is clean and sustainable that we can create with nontoxic, easily available elements. Our artificial photosynthesis is the way forward.”\n Photosynthesis is a complex dance of processes whereby plants convert the sun’s radiance and water molecules into usable energy in the form of glucose. To do this, they use a pigment, usually the famous chlorophyll, as well as proteins, enzymes and metals.\n The closest process to artificial photosynthesis humans have today is photovoltaic technology, where a solar cell converts the sun’s energy into electricity. That process is famously inefficient, able to capture only about 20% of the sun’s energy. Photosynthesis, on the other hand, is radically more efficient; it is capable of storing 60% of the sun’s energy as chemical energy in associated biomolecules.\n The efficiency of simple photovoltaic cells – solar panels – is limited by semiconductors’ ability to absorb light energy and by the cell’s ability to produce power. That limit is something scientists could surpass with synthetic photosynthesis.\n “With artificial photosynthesis, there are not fundamental physical limitations,” Pushkar said. “You can very easily imagine a system that is 60% efficient because we already have a precedent in natural photosynthesis. And if we get very ambitious, we could even envision a system of up to 80% efficiency.\n “Photosynthesis is massively efficient when it comes to splitting water, a first step of artificial photosynthesis. Photosystems II proteins in plants do this a thousand times a second. Blink, and it’s done.”\n Pushkar’s group is mimicking the process by building her own artificial leaf analog that collects light and splits water molecules to generate hydrogen. Hydrogen can be used as a fuel by itself via fuel cells or be added to other fuels such as natural gas, or built into fuel cells to power everything from vehicles to houses to small electronic devices, laboratories and hospitals. Her most recent discovery, an insight into the way water molecules split during photosynthesis, was recently published in the journal  Chem Catalysis: Cell Press.\n Scientists in Pushkar’s lab experiment with natural photosystem II proteins and synthetic catalysts combinations in attempts to understand what works best – and why. She also puts a priority on using compounds and chemicals that are readily abundant on Earth, easily accessible and nontoxic to the planet.\n Progress in artificial photosynthesis is complicated, though, by the fact that photosynthesis is so multifaceted, a fact bemoaned by biochemistry students everywhere.\n “The reaction is very complex,” Pushkar said. “The chemistry of splitting water molecules is extremely intricate and difficult.”\n Scientists have been working on artificial photosynthesis since the 1970s. That’s a long time, but not when you remember that photosynthesis took millions of years to evolve. Not only that, but scientists believe that, unlike flight, communication or intelligence, photosynthesis has evolved only once – about 3 billion years ago, only about 1.5 billion years into Earth’s existence.\n Pushkar posits that within the next 10-15 years, enough progress will have been made that commercial artificial photosynthesis systems may begin to come online. Her research is funded by the National Science Foundation.\n Reference: “Do multinuclear 3d metal catalysts achieve O–O bond formation via radical coupling or via water nucleophilic attack? WNA leads the way in [Co 4O 4] n+” by Roman Ezhov, Alireza Karbakhsh Ravari, Gabriel Bury, Paul F. Smith and Yulia Pushkar, 3 May 2021,  Chem Catalysis: Cell Press.  DOI: 10.1016/j.checat.2021.03.013", "posttime": "2021-06-22 03:14:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "光合作用,photosynthesis", "title": "人造光合作用承诺清洁，可持续的能源来源 ", "title_en": "Artificial Photosynthesis Promises Clean, Sustainable Source of Energy", "transed": 1, "url": "https://scitechdaily.com/artificial-photosynthesis-promises-clean-sustainable-source-of-energy/", "via": "", "real_tags": ["光合作用"]}, {"category": "", "categoryclass": "", "imagename": "5262a3ebddadfa73264ac9716094bce7.jpg", "infoid": 1067265, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正是在上周，通用汽车与两家公司签署协议，而是两家公司为其HydroTec氢燃料电池系统开发申请。乍一看，这似乎有点令人惊讶，自上周我们还看到本田停止其氢燃料电池供电的清晰度。这种举动只是对假设的最新支持，即氢电力可以加入BetAmax和历史书籍中的Zune。\n 事实上，历史书籍是你和＃39; ll找到gm＆＃39; s的第一个氢燃料电池电动车，1966 electrovan。近年来，我们看到了由GM为军事应用开发的一些燃料电池EV。但这些新交易都不涉及制造氢气动力汽车。\n 相反，上周二汽车制造商宣布它将与WABTEC合作 - 已经开发了一个电池电力机车 - 到GM＆＃39; S燃料电池和电池供电的工程机车。然后，周四，通用汽车透露它正在使用利勃海航空航天，为燃料电池开发航空航天应用（如辅助发电）。有趣的，我与Charlie Freese，GM＆＃39;全球Hydrotec和负责GM＆＃39; S燃料电池计划的男人执行董事。为什么公司仍然认为最轻的气体只有膨胀房间？\n  通用汽车在锂离子电池的新平台上投入了足够的时间和数十亿美元，所以我第一次问弗里斯为什么公司应该打扰燃料电池？\n ＆＃34;具有提供两种技术的能力让您了解技术在哪里最适合的位置，而且不必尝试将方形钉施加到圆孔中，＆＃34;弗里斯告诉ars。 ＆＃34;一个强大的燃料电池使电池看起来更好，因为您可以进入那种充电窗口，并且您可以做大量的东西可以更有效地运行。电池很好，很大的力量，氢燃料电池很棒，船上的大量能量很大，而这两个是很大的补充。＆＃34;\n  如果我期待任何融资的氢气乘用车，弗里斯族＆＃39;准​​备送一个。 ＆＃34;对氢气的争论是你不在任何地方的氢气和＃34;他说。 ＆＃34;我可以在街角购买氢气。今天的真实情况 - 除了在加利福尼亚州的零售店投资的一些地方 - 但挑战是，他们为零售客户做出了比商业有不同需求的零售客户顾客在航空航天业务或货运业务或铁路业务。＆＃34;\n 试图建立一个具有与现有汽油站相似覆盖的氢灌装站网络将是一个巨大的努力，因为每辆车辆在平均日期可能会看到几个乘用车速度很少。 ＆＃34;他们不知道他们在哪里＆＃39;重新想要它，但是当他们需要它时，他们希望它在那里，他们不想要捕捉的不便或焦虑的不便或焦虑对于氢气，＆＃34;弗里斯说。 ＆＃34;那个＆＃39;不是推动氢成本并获得最大限度地利用投资的好方法。＆＃34; \n＆＃34; Let＆＃39;不尝试将这种技术强制到最困难的事情中，＆＃34;弗里斯继续。 ＆＃34;我们找到了我们已经解决了客户问题的这些应用程序，并将我们带到卡车上。＆＃34;工厂和仓库今天已经运营了燃料电池供电的叉车，弗里德说货运卡车可以使用相同的加油点。\n 由于那些燃料电池供电的飞机和火车 - 常见的货物来加入机场和铁路码在机场和轨道院子里加入氢气加油 - 留下工厂和仓库的常见目的地 - 您可以在GM＆＃39的眼中拥有一个整个生态系统。 ＆＃34;我帮助一种运输方式，以及帮助其他模式，我的规模经济上升，我的成本下降了，整个所有权成本的整个东西都开始制作更有意义，＆＃34;弗里斯说。\n 可预测的路线在那里的路线＆＃39;很多常规加油的火车码和机场 - 可能使其值得安装液体储氢，特别是如果它们的叉车和地支撑车辆也由燃料电池供电。 ＆＃34;现在我的存储密度从重量测量和体积的角度提高，我的成本变得更好，我的效率变得更好，＆＃34;弗里斯说。 ＆＃34;所以它＆＃39; s只是一个更好的方式做事。＆＃34; ", "note_en": "In just the last week, General Motors signed agreements with not one but two companies to develop applications for its Hydrotec hydrogen fuel cell systems. At first glance, that might seem a little surprising, since last week we also saw  Honda discontinue its hydrogen fuel cell-powered version of the Clarity. That move was just the latest bit of support for the hypothesis that hydrogen power might join Betamax and the Zune in the history books.\n In fact, the history books are where you&#39;ll find GM&#39;s first hydrogen fuel cell electric vehicle,  the 1966 Electrovan. And in recent years we&#39;ve seen some  fuel cell EVs developed by GM for military applications. But neither of these new deals involves making a hydrogen-powered car.\n Instead, last Tuesday the automaker announced it would work with Wabtec— which has already developed a battery-electric locomotive—to engineer freight locomotives powered by GM&#39;s fuel cells and batteries. Then, on Thursday, GM revealed it was working with Liebherr-Aerospace to develop aerospace applications (like auxiliary power generation) for fuel cells. Intrigued, I spoke to Charlie Freese, GM&#39;s executive director for Global Hydrotec and the man in charge of GM&#39;s fuel cell program. Why does the company still think the lightest gas only has room to expand?\n  GM has invested plenty of time and billions of dollars in a new platform of lithium-ion batteries, so I first asked Freese why the company should bother with fuel cells, too?\n &#34;Having that ability to provide both technologies lets you see where the technology fits best, and not have to try to force a square peg into a round hole,&#34; Freese told Ars. &#34;A strong fuel cell makes a battery look even better because you can operate into that state of charge window and you can do a lot of things to operate more efficiently. Batteries are great for a lot of power, and the hydrogen fuel cell is great for a lot of energy on board, and the two are great complements.&#34;\n  If I was expecting any defense of hydrogen-powered passenger cars, Freese wasn&#39;t ready to deliver one. &#34;The argument against hydrogen is you don&#39;t have hydrogen everywhere,&#34; he said. &#34;I can&#39;t go buy hydrogen necessarily at the street corner. And that&#39;s true today—except for some of the places that have invested in retail outlets like in California—but the challenge is, they&#39;re doing it for retail customers which have a very different set of needs than commercial customers in the aerospace business or in the trucking business or the rail business.&#34;\n Trying to build out a network of hydrogen filling stations with similar coverage to existing gasoline stations would be an enormous effort for very little return, given how few passenger cars each station might see on an average day. &#34;They don&#39;t know where they&#39;re going to want it, but they want it there when they need it, and they don&#39;t want the inconvenience or the range anxiety of trying to hunt for hydrogen,&#34; Freese said. &#34;That&#39;s not a great way to drive down your hydrogen cost and get the maximum use out of your investment.&#34;\n  &#34;Let&#39;s not try to force this technology into the most difficult things first,&#34; Freese continued. &#34;Let&#39;s find these applications where we already solve a customer problem, and that led us to trucking.&#34; Factories and warehouses are already operating fuel cell-powered forklifts today, and Freese says that freight trucks could use the same refueling points.\n Add in hydrogen refueling at airports and rail yards thanks to those fuel cell powered planes and trains—common destinations for freight leaving factories and warehouses—and you have yourself a whole ecosystem in GM&#39;s eyes. &#34;I&#39;m helping one mode of transportation, and that&#39;s helping the other mode, my scale economies go up, my costs come down, the whole thing from a total cost of ownership starts to make so much more sense,&#34; Freese said.\n Predictable routes where there&#39;s a lot of regular refueling—like train yards and airports—might make it worth installing liquid hydrogen storage, particularly if their forklifts and ground support vehicles are also powered by fuel cells. &#34;Now my storage density improves from both a gravimetric and a volumetric standpoint, my cost gets better, and my efficiency gets better,&#34; Freese said. &#34;So it&#39;s just all around a better way to do things.&#34;", "posttime": "2021-06-22 02:38:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,gm,trains,燃料电池", "title": "飞机，火车，但不是汽车 - 为什么GM正在开发燃料电池 ", "title_en": "Planes, trains, but not automobiles—why GM is developing fuel cells", "transed": 1, "url": "https://arstechnica.com/cars/2021/06/planes-trains-but-not-automobiles-why-gm-is-developing-fuel-cells/", "via": "", "real_tags": ["开发", "gm", "trains", "燃料电池"]}]