[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1067498, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "回到2012年，我被黑了一点工具用于对图像进行错误级别分析。坦率地是一个坦率的UI，它已经使用了250岁以上的糟糕UI和＃39; 000人。\n 几天前，我随机偶然地偶然发现了杰西卡弗里德里希，大卫苏卡尔和JanLukáš.i的数字图像中的复制伪造纸上的纸张检测。我想看看我是否可以做一些类似的东西，并使它在浏览器中运行。它一个很好的调整，但我结束了一些工作的东西。我拍了一份我的照片电影仿真器作为UI的基础，改编了它，移植了旧的ELA代码并添加了一些新工具。结果被调用urententical。\n   如果你想要一些关于如何使用的指导，你可以选择毒药。优惠是一个12分钟的独白，形式的讲解视频ORA的全部束在帮助页上的隐秘文本。我很抱歉，也不是非常好的。\n  我猜这个新工具的最有趣的特征是克隆检测。所以让我透露给你我如何制作它的工作。我会尽力保持解释。如果有兴趣IT Imight仍在稍后编写算法的更新描述。\n  在图像上创建一个窗口，对于窗口的每个位置，窗口中的所有像素都将窗口中的所有像素作为键作为键，如果键已经在表中我们找到了克隆！标记它。否则将键添加到表格中\n 这实际上是有效的，但它只会找到完美的副本。我们希望匹配更具模糊。\n  因此，下一个关键步骤是使匹配更具模糊。我们通过压缩键来使其更加唯一。您可以将这一步转换为微小的JPEG，然后使用这些像素作为键将每个小块转换为键。 。实际实现是使用此步骤的HAAR小波。您可以看到通过单击克隆检测工具中的显示量化图像来使用压缩块。 \n因此，下一步是过滤所有块并丢弃镗孔。这是通过将高频率中的细节量进行比较到阈值来完成。您可以将其视为减去块的模糊图像该块然后查看像素的剩余剩余。在练习模糊不是必需的，因为小波步骤已经为US完成了。您可以将被拒绝的块视为量化图像中的黑点。\n 在此阶段，算法的工作原理，但它仍然显示了很多恰好恰好看起来相似的块的无趣副本。\n  所以现在我们拍摄了另一张我们发现的克隆。如果源和目的地之间的距离太小，我们拒绝它们。我们看看从类似地方开始的克隆，并被复制成相似的方向。如果我们发现少于最小的簇大小，其他类似的克隆，我们将克隆丢弃为噪音。\n  我尚未弄清楚如何许可代码和资产。但我计划以某种形式释放它。\n  一如既往地，在应用程序和帖子上都是赞赏的反馈。您希望未来的帖子更深入和技术或您可以如此的当前格式？ ", "note_en": "Back in 2012 I hacked to together a little  tool for performing Error Level Analysis on images.Despite being such a simple tool with, frankly, a bad UI it has been used by over  250&#39;000 people.\n A few days ago I randomly stumbled across the paper  Detection of Copy-Move Forgery in Digital Images by Jessica Fridrich, David Soukal, and Jan Lukáš.I wanted to see if I could do something similar and make it run in a browser.It took a good bit of tweaking but I ended up with something that works.I took a copy of my  photo film emulator as a base for the UI, adapted it a bit, ported the old ELA code and added some new tools.The result is called Forensically.\n   If you want some guidance on how to use forensically you get to pick your poison. On offer is a 12 minute monologue in form of a tutorial video ora whole bunch of cryptic text on the  help page. I&#39;m sorry that neither are very good.\n  I guess the most interesting feature of this new tool is the clone detection. So let me reveal to you how I made it work.I will try to keep the explanation simple. If there is interest in it Imight still write a more technical description of the algorithm later.\n  Create a TableMove a window over the image, for each position of the window Use all of the pixels in the window as a key If the key is already in the table We found a clone! Mark it. Else Add the key to the table\n This does actually work, but it will only find perfect copies. We want the matching to be more fuzzy.\n  So the next key step is to make the matching more fuzzy.We do this by compressing the key to make it less unique.You can think of this step as converting each of the littleblocks into a tiny JPEG and then using those pixels as a key.The actual implementation is using Haar wavelets for this step.You can see the compressed blocks that are used by clicking on  Show Quantized Image in the  Clone Detection Tool.\n   So the next step is to filter all of the blocks and to throw away the boring ones.This is done by comparing the amount of detail in the high frequencies to a threshold.You can think of it as subtracting a blurred image of the block from the block and then looking at how much is left of the pixels.In practice the blurring is not required because the wavelet step has already done it for us.You can see the rejected blocks as black spots in the quantized image.\n At this stage the algorithm works but it does still show a lot of uninteresting copies of blocks that just happen to look similar.\n  So now we take another look at all of the clones that we found.If the distance between the source and destination is too small we reject them.Next we look at clones that start from a similar place and are copied into a similar direction. If we find less than  Minimal Cluster Size other clones that are similar we discard the clone as noise.\n  I haven&#39;t figured out how I want to license the code and assets yet. But I do plan to release it in some form.\n  As always, feedback is appreciated both on the app and on the post.Would you like future posts to be more in depth and technical or do youlike the current format?", "posttime": "2021-06-23 01:09:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,photo,克隆", "title": "forexe，Web的照片取证（2015） ", "title_en": "Forensically, Photo Forensics for the Web (2015)", "transed": 1, "url": "https://29a.ch/2015/08/16/forensically-photo-forensics-for-the-web", "via": "", "real_tags": ["web", "photo", "克隆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "版权所有©2021W3C®（麻省理工学院，ercim，Keio，Beihang）。 W3C责任，商标和许可证文件许可规则适用。\n  分散的标识符（DIDS）是一种新型的标识符，概述可验证的，分散的数字身份。 a是指由DID的控制器确定的任何索赔（例如，一个人，组织，事物，数据模型，抽象实体等）。相比之下，联合的标识符，已经设计了，使他们可以与集中注册管理机构，身份提供者和认证授权解耦。具体而言，虽然其他缔约方可用于帮助启用与之相关的信息，但该设计使得Theconstroler能够证明它来证明它而不需要允许的任何其他方。 DIDS是将DIDSUBJECT与DID文件相关联的URI，允许与该主题的可信组织进行可信赖。\n  每个文件都可以表达加密材料，验证方法或服务，它提供了一组机制，使控制器能够证明对此的控制。服务与DOD主题相关的互动。如果DIDsubject是诸如数据模型的信息资源，则确实可以提供返回DOT本身的手段。\n  此文档指定DID语法，常见的数据模型，核心属性，序列化表示，执行操作，并解析解决它们所代表的资源。\n  本节介绍在发布时本文档的状态。其他文件可能会取代本文档。目前的W3C出版物列表和本技术报告的最新版本可以在HTTPS://www.w3.org/tr/的W3C技术报告索引中找到。\n  W3C分散的标识符工作组已将本文档发布为W3C候选推荐，并要求软件开发人员和DIDMethod规范作者提供实验实施，设计了TOTEST本文档中所有功能的可实现性。\n  要退出W3C候选推荐阶段，W3C执行组WillRequire两件事：1）对于机器可测试的规范性陈述，每个功能至少两个可互操作的实现，2）对于不可通过机器可测试的正常性，至少有两个演示每个功能。特征被定义为规范中的一个或多个功能统一的规范性语句。 \n目前，存在98实验性的方法规范，32实验表明方法驾驶员驾驶员，确定与给定实现的候选推荐测试套件是符合本规范和提交给符合测试套件的实现。建议理解其核心的核心问题并进行了核心测试套件，每个核心测试套件都包含最新的疑虑列表和建议的长哈丁可能导致该规范的变更。\n    在风险标记上添加到大多数DID参数，预期不实现的数据型号，以及TheApplication / DID + LD + JSON媒体类型。这种变化导致了DID WG＆＃39; sdecision执行第二个候选推荐阶段。所有其他译文都是编辑或预测＆＃34;在风险＆＃34;问题标记。\n  删除用于NextUpdate和NextVersionID的特定于特定于特定于特定于特定方法ID的风险问题标记。\n    引入抽象数据模型，可以序列化到包括JSON和JSON-LD的多个项目。\n  介绍DID规范注册表的目的是用于重新注册的扩展属性，表示，DICATE INPUTMETADATA和OUTPUT METADATA，DIDED METADATA，DID参数和DIDMETHOD。\n      为身份验证，断言，关键协议，能力调用和能力代表性的目的添加验证关系。\n  支持与DID文件相关多标识符的能力，例如DID控制器，也称为等效ID和规范ID。 \n一个表示部分，详细介绍了抽象数据模型如何以各种不同的格式呈现和消耗以及所有表示，生产者和消费者的一般。\n  详细说明了DID解决方案，并确保了URL解除了interfaceDefinition，即所有DIDS的interfacedefinition预计将曝光以及inputs和输出到这些进程。\n  欢迎有关本文件的评论。请在github上发布问题，或发送主题to public-did-wg@w3.org（订阅，档案）。\n  本文件由分散的标识符工作组作为候选人推荐草案公布。本文档旨在成为W3C推荐。\n GitHub问题是对本规范讨论的首选。或者，您可以向我们的邮件列表发送评论。请将它们发送到public-did-wg@w3.org（订阅，档案）。\n 作为候选建议的出版并不意味着W3C会员资格的认可。候选建议草案将工作组拟在随后的候选推荐快照中纳入更改。\n 这是一个文件草案，可以随时更新，更新，替换或已被其他文件替换。除了正在进行的工作之外，将这份文件引用这份文件是不合适的。 \n本文件由在W3C专利政策下运营的集团制作。 W3C维护与本集团可交付成果有关的任何专利披露的公开名单;该页面还包括用于披露专利的说明。具有实际知识的个人对个人认为包含必要索赔的专利，必须根据W3C专利政策的第6条披露信息。\n       本节介绍DIDS的正式语法，并执行了URL。术语＆＃34;通用＆＃34;用于区分此处定义的语法从其各自的特定方法中的SyntaxDefined。\n  通用的方法是与[RFC3986]符合[RFC3986]的URI方案。可以在下面找到ABNF定义，它使用[RFC5234]中的语法和Alpha和Digit的相应定义。在[RFC3986]中，在下面的ABNF中未定义的所有其他规则名称。所有确实必须符合ThedId语法ABNF规则。\n  did =＆＃34; DID：＆＃34;方法名称＆＃34;：＆＃34;特定方法 -  idmethod-name = 1 *方法 -  charmethod-char =％x61-7a / digitmethod-id = *（* iDchar＆＃34;：＆＃34;）1 * id托arch = alpha / digit /＆ ＃34;。＆＃34; /＆＃34;  - ＆＃34; /＆＃34; _＆＃34; / pct-encodedpct-encoded =＆＃34;％＆＃34; Hexdig Hexdig\n  对于与DID语法有关的方法的要求，Seesection§8.1方法语法。\n  DIFT URL是特定资源的网络位置标识符。它可用于检索像Deptations，验证方法，服务，DID文件的特定部分或其他资源的表现。\n  以下是使用[RFC5234]中的语法的ABNF定义。它构建了第3.1节中定义的DID STAVED语法。 [RFC3986]中展示的路径避免，查询和片段组件。所有URL都必须符合ThedID URL语法ABNF规则。如第8.1方法语法中所述，方法可以进一步限制骨髓。 \n虽然可以根据DID URL语法的主管使用分号（;）字符，但是本规范的未来版本可以使用它作为如[MATRIX-URIS]中所述的参数的子分隔符。 Toavoid未来冲突，开发人员应该避免使用它。\n  DID路径与通用URI路径相同，并符合RFC 3986，第3.3节中的路径避免的ABRF规则。与URI一样，可以通过DID方法指定路径语义，该方法可以使控制器能够进一步专注于这些语义。\n  A查询与通用URI查询相同，符合RFC 3986中的查询ABNF规则，第3.4节。在第3.2.1节中阐述了这种语法成果。\n  片段语法和语义是否与通用泛证相同，并符合RFC 3986，第3.5节中的Fragment ABNF规则。\n  将DID片段用作与DidDocument或外部资源的方法无关的参考。碎片identifer的一些例子如下所示。\n        为了最大限度地提高互操作性，敦促实施者以确保在横跨表示的方式中以相同方式解释碎片（参见§6表示）。例如，jonsjson指针[rfc6901]可以在did片段中使用，它不会以相同的方式在非JSON表示中脱节。\n  在§B.2应用程序/ DID + LD + JSON中，在本节中与语义上的语义上兼容的片段标识符的附加语义。对于信息交流如何取消引用DID碎片，请参阅第7.2节第7.2节DID URL取消引用。 \nDID URL语法支持基于§查询中描述的查询组件的参数的简单格式。将DIDParameter添加到DIFT URL意味着该参数成为资源的分类器的一部分。\n      有些参数完全独立于任何特定的DIDMethod和功能，以相同的方式为所有人做的。其他DID方法不支持的其他DID参数。在aresupport中的可选参数，它们预计将均匀地运行在DID方法支持它们。下表提供了常见的参数符合所有DID方法的方法。对所有参数的支持是可选的。\n  工作组正在寻求关于此功能的实施者反馈。如果在Chandidate推荐期结束时没有足够的实现经验，则将从规范中删除。\n通过Service ID识别从DID文档中的服务.IF存在，关联的值必须是ASCII字符串。\n  工作组正在寻求关于此功能的实施者反馈。如果在Chandidate推荐期结束时没有足够的实现经验，则将从规范中删除。\n根据RFC3986第4.2节的相对URI引用，它标识服务端点处的资源，它是通过使用服务参数从DidDocument中选择的资源。如果存在，则关联的值必须是ASCII字符串，并且必须使用百分比编码的核心字符作为在RFC3986Section 2.1中指定。\n  识别要解析的特定版本的DID文件（reversion ID可以是顺序的，或者是uuId，或特定于方法）.if存在，关联的值必须是ASCII字符串。 \n工作组正在寻求关于此功能的实施者反馈。如果在Chandidate推荐期结束时没有足够的实现经验，则将从规范中删除。\n识别要解决的DID文件的某个版本时间戳。这是，在Certaintime为A有效的DID文件。如果存在，则关联的值必须是ASCII字符串，该字符串是有效的XMLDateTime值，如W3C XML Schema定义语言（XSD）1.1第2部分的第3.3.7节中所定义的第2部分：数据类型[XMLSchema11-2]。此日期时间值必须为UTC 00:00:00而没有次级二进制精度。对于例如：2020-12-20t19：17：47z。\n  工作组正在寻求关于此功能的实施者反馈。如果在Chandidate推荐期结束时没有足够的实现经验，则将从规范中删除。\nDID文件的资源哈希值以添加完整性保护，在[hashlink]中asspecized。此参数是非规范性的。如果存在，则关联值必须是ASCII字符串。\n  实施者以及方法规范作者可能会useadational在这里列出的参数。对于MaximicalInteroperability，建议使用DIDSpecification Registrics机制[DID-SPEC-REPARTIS]，以避免与不同语义相同的参数的其他用途进行碰撞。\n  如果存在清晰的用例，则可以使用参数，其中ParameterNeed是引用资源的URL的一部分，其与单独使用确实不同。如果可以通过将元数据传递给DID解析器可以表达相同的功能，则预计不会使用参数。在[DID-Resolution]中讨论了用于处理这些参数的其他注意事项。\n  DID DIST和DID URL取消引用函数可以通过将输入元数据传递给DID URL的ARENOT部分的解析器来影响（参见第7.1.1节的解决方案选项）。这是可比较的TOTP，其中某些参数可以包含在HTTP URL中，在取消引用过程中作为HTTP标头oraltern传递。 Theimportant的区别是DIDURL的一部分的参数应该用于指定哪些资源是习惯的，而输入的元数据不是DID URL光的一部分，以控制如何解决该资源的解释。 \n一个相对的URL是DOD文件中的任何URL值，它在DOD中开始：＆lt;方法名称＆gt;：＆lt;方法 - 特定于id＆gt ;.常切地，它是任何URL值，它不会以第3.1节中定义的ABNF开头。 URL预计将在同一文件中引用资源。相对于URL可能是相对路径组件，查询参数和片段标识符。\n  解析相对的URL参考时，必须使用RFC3986第5节中指定的算法：必须使用参考分辨率。基本URI值是与DOD主题相加的DID，请参见第5.1.1段所做的主题。该计划是做过的。该权限是＆lt;方法名称＆gt;：＆lt;方法 - 特定于方法ID＆gt;，以及分别在§路径，§查询和§片段中定义的路径，查询和碎片值。\n  相对于URL通常用于引用验证方法和在没有使用AbsolutuRL的文档中的服务。存储大小是考虑因素的方法，可能是Useled URL以减少DID文档的存储大小。\n  {＆＃34; @上下文＆＃34 ;: [＆＃34; https：//www.w3.org/ns/did/v1&#34 ;,＆＃34; https：//w3id.org/security/suites / ed25519-2020 / v1＆＃34; ]＆＃34; ID＆＃34 ;:＆＃34;例：123456789abcdefghi＆＃34 ;,＆＃34; verificationmethod＆＃34 ;: [{＆＃34; id＆＃34 ;:＆＃34; did：＆＃34; ：123456789abcdefghi＃key-1＆＃34 ;,＆＃34;类型＆＃34 ;:＆＃34; ed25519verificedkey2020＆＃34; //外部（属性值）＆＃34;控制器＆＃34;：示例：123456789abcdefghi＆＃34 ;,＆＃34; pressekeymultibase＆＃34 ;:＆＃34; zh3c2avvlmv6gmmnam3uvajzpfkcjcwdwnzn6z3wxmqpv＆＃34; }，......]，＆＃34;身份验证＆＃34 ;: [//相对于用于引用上面验证方法的URL; ＃键-1＆＃34; ]}\n  在上面的示例中，相对的URL值将被转换为toan绝对执行的URL值为：示例：123456789abcdefghi＃key-1。\n  本规范定义了一种数据模型，可用于表达DidDocuments，并执行文档数据结构，然后可以是序列化的多个具体表示。本节提供了数据模型的AHigh级描述，在数据模型中表达不同类型的不同类型的方式的描述，以及用于扩展数据模型的指令。\n  DOD文件由条目的地图组成，其中每个条目由AKEY / VALEE对组成。 DOD文档数据模型包含至少两倍的条目类。第一类条目称为属性，并在第5节第5节中指定。由特定于代表的条目组成的第二类，并在第6节中指定。 \nDOD文档数据模型中的所有条目密钥都是字符串。所有条目值都使用下表中的抽象数据类型表示所有条目值，并且每个表示都是每个数据类型的具体序列化格式。\n  有限的键/值对序列，没有键在[infra]中出现两次asspecized。在[infra]中，地图有时被称为有序地图。\n    有限的有序的项目序列，不包含[infra]中指定的同一项目Twiceas。一个集合有时被称为[infra]中的有序集。\n  在[XMLSchema11-2]中指定的DateTime，能够无损地表达所有估值的日期和时间值。\n  通常用于代表[infra]中指定的人类可读朗布的代码单元序列。\n  没有[XMLSchema11-2]中规定的小数组件的实数。为了最大限度地，敦促实施者在RFC8259，第6节中遵守关于INTININTEGERS的建议，第6节：数字。\n  通常用于近似任意实际数字的值，如指定in [xmlschema11-2]。为了最大限度地，敦促实施者在RFC8259中遵守有关关于Doubles的建议，第6节：数字。 \n用于指示缺少[infra]中定义的值的值。\n  由于从[INFRA]使用的数据模型，从[INFRA]的使用方法，明确地排序了可以包含多于单位的属性值，例如列表，映射和集合。所有列表似乎在[infra]中的所有列表似乎都是订购的，无论是订单可证式。出于本说明书的目的，除非另有说明，否则地图和设置排序并不重要，并且预计不会产生或消耗确定性地秩序。\n  为了获得最大互操作性，建议扩展使用W3C的规范注册机制[DID-SPED-REPARTIS]。对新属性或其他扩展的使用机制是唯一可确保两种不同的表示能够能够一起拖曳的特定机制。\n  表示可以定义其他可扩展性机制，包括Onesthat不需要使用DID规范注册表。这种拓展机构应支持任何其他符合性代表的无损转换。表示表示的扩展机制应将所有属性和表示语法的映射到数据模型及其类型系统中。\n  两种特定实现始终可以同意乐队外出淘汰的互动的扩展或表示，这些扩展或表示在DID规范注册表[DID-SPEC-REPARTIES];此类实施之间的互操作性和较大的生态系统将是可靠的。\n  确实与DID文件相关联。使用数据模型表达了DID文件，可以序列化为表示。以下部分定义了DID文档中的属性，包括是否需要这些属性或可选。这些属性签署了DOD主题与伪装价值之间的关系。\n  下表包含本规范的核心属性的信息引用，其中包含预期值，以及它们是否被判断。表中的属性名称与NuremativeDefinitions相关联以及每个属性的更详细描述。 \n属性名称ID，类型和控制器可以在不同类型的地图中存在，不同类型的可能差异。  一组符合§验证方法属性中的规则的VerificationMethod映射，或符合第3.2节中规则的字符串执行URL语法。  代表JSON Web的地图  ...... ", "note_en": "Copyright © 2021   W3C ® (  MIT,   ERCIM,  Keio,  Beihang). W3C  liability,  trademark and  permissive document license rules apply.\n  Decentralized identifiers (DIDs) are a new type of identifier thatenables verifiable, decentralized digital identity. A  DID refers to anysubject (e.g., a person, organization, thing, data model, abstract entity, etc.)as determined by the controller of the  DID. In contrast totypical, federated identifiers,  DIDs have been designed so that they maybe decoupled from centralized registries, identity providers, and certificateauthorities. Specifically, while other parties might be used to help enable thediscovery of information related to a  DID, the design enables thecontroller of a  DID to prove control over it without requiring permissionfrom any other party.  DIDs are  URIs that associate a  DIDsubject with a  DID document allowing trustable interactionsassociated with that subject.\n  Each  DID document can express cryptographic material,  verificationmethods, or  services, which provide a set of mechanisms enabling a DID controller to prove control of the  DID.  Services enabletrusted interactions associated with the  DID subject. A  DID mightprovide the means to return the  DID subject itself, if the  DIDsubject is an information resource such as a data model.\n  This document specifies the DID syntax, a common data model, core properties,serialized representations, DID operations, and an explanation of the processof resolving DIDs to the resources that they represent.\n  This section describes the status of this document at the time of its publication. Other documents may supersede this document. A list of current  W3C publications and the latest revision of this technical report can be found in the   W3C technical reports index at https://www.w3.org/TR/.\n  The  W3C Decentralized Identifier Working Group has published this document as a W3C Candidate Recommendation and is requesting that software developers and DIDMethod specification authors provide experimental implementations designed totest the implementability of all of the features in this document.\n  To exit the  W3C Candidate Recommendation phase, the  W3C DID Working Group willrequire two things: 1) for normative statements that are machine testable, atleast two interoperable implementations per feature, and 2) for normativestatements that are not machine testable, at least two demonstrations ofimplementation per feature. A feature is defined as one or more functionallyrelated normative statements in the specification.\n  At present, there exist 98experimental DID Method specifications, 32 experimental DID Method driverimplementations, a Candidate Recommendation  test suite that determineswhether or not a given implementation is conformant with this specificationand 18 implementations submitted to the conformance test suite.Readers are advised to heed the  DID Core issues and   DID Core Test Suiteissues that each contain the latest list of concerns and proposed changesthat might result in alterations to this specification.\n    Addition of at risk markers to most of the DID Parameters, the data modeldatatypes that are expected to not be implemented, and theapplication/did+ld+json media type. This change resulted in the DID WG&#39;sdecision to perform a second Candidate Recommendation phase. All otherchanges were either editorial or predicted in &#34;at risk&#34; issue markers.\n  Removal of the at risk issue marker for the  method-specific-id ABNF ruleand for  nextUpdate and  nextVersionId.\n    The introduction of an abstract data model that can be serialized to multiplerepresentations including JSON and JSON-LD.\n  The introduction of a DID Specifications Registry for the purposes ofregistering extension properties, representations, DID Resolution inputmetadata and output metadata, DID Document metadata, DID parameters, and DIDMethods.\n      The addition of verification relationships for the purposes of authentication,assertion, key agreement, capability invocation and capability delegation.\n  The ability to support relating multiple identifiers with the DID Document,such as the DID controller, also known as, equivalent IDs, and canonical IDs.\n      A Representations section that details how the abstract data model can beproduced and consumed in a variety of different formats along with generalrules for all representations, producers, and consumers.\n  A section detailing the DID Resolution and DID URL Dereferencing interfacedefinition that all DID resolvers are expected to expose as well as inputsand outputs to those processes.\n  Comments regarding this document are welcome. Please file issuesdirectly on  GitHub,or send themto  public-did-wg@w3.org ( subscribe, archives).\n  This document was published by the  Decentralized Identifier Working Group as a Candidate Recommendation Draft. This document is intended to become a  W3C Recommendation.\n GitHub Issues are preferred for discussion of this specification. Alternatively, you can send comments to our mailing list. Please send them to  public-did-wg@w3.org ( subscribe,  archives).\n Publication as a Candidate Recommendation does not imply endorsement by the  W3C Membership. A Candidate Recommendation Draft integrates changes from the previous Candidate Recommendation that the Working Group intends to include in a subsequent Candidate Recommendation Snapshot.\n This is a draft document and may be updated, replaced or obsoleted by other documents at any time. It is inappropriate to cite this document as other than work in progress.\n  This document was produced by a group operating under the   W3C Patent Policy.  W3C maintains a  public list of any patent disclosures made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent. An individual who has actual knowledge of a patent which the individual believes contains  Essential Claim(s) must disclose the information in accordance with  section 6 of the  W3C Patent Policy.\n       This section describes the formal syntax for  DIDs and  DID URLs.The term &#34;generic&#34; is used to differentiate the syntax defined here from syntaxdefined by  specific  DID methods in their respectivespecifications.\n  The generic  DID scheme is a  URI scheme conformant with[  RFC3986]. The ABNF definition can be found below, which uses the syntax in[  RFC5234] and the corresponding definitions for  ALPHA and DIGIT. All other rule names not defined in the ABNF below aredefined in [  RFC3986]. All  DIDs  MUST conform to theDID Syntax ABNF Rules.\n  did = &#34;did:&#34; method-name &#34;:&#34; method-specific-idmethod-name = 1*method-charmethod-char = %x61-7A / DIGITmethod-specific-id = *( *idchar &#34;:&#34; ) 1*idcharidchar = ALPHA / DIGIT / &#34;.&#34; / &#34;-&#34; / &#34;_&#34; / pct-encodedpct-encoded = &#34;%&#34; HEXDIG HEXDIG\n  For requirements on  DID methods relating to the  DID syntax, seeSection  §  8.1 Method Syntax.\n  A  DID URL is a network location identifier for a specific resource. It can be used to retrieve things like representationsof  DID subjects,  verification methods,  services,specific parts of a  DID document, or other resources.\n  The following is the ABNF definition using the syntax in [  RFC5234]. It buildson the  did scheme defined in  §  3.1 DID Syntax. The   path-abempty,   query, and   fragment components aredefined in [  RFC3986]. All  DID URLs  MUST conform to theDID URL Syntax ABNF Rules.  DID methods can further restrict theserules, as described in  §  8.1 Method Syntax.\n    Although the semicolon ( ;) character can be used according to therules of the  DID URL syntax, future versions of this specification mayuse it as a sub-delimiter for parameters as described in [  MATRIX-URIS]. Toavoid future conflicts, developers ought to refrain from using it.\n  A  DID path is identical to a generic  URI path and conforms to the path-abempty ABNF rule in  RFC 3986, section 3.3. As with URIs, path semantics can be specified by  DID Methods, which inturn might enable  DID controllers to further specialize those semantics.\n  A  DID query is identical to a generic  URI query and conforms tothe  query ABNF rule in  RFC 3986, section 3.4. This syntaxfeature is elaborated upon in  §  3.2.1 DID Parameters.\n  DID fragment syntax and semantics are identical to a generic  URIfragment and conforms to the  fragment ABNF rule in  RFC 3986, section 3.5.\n  A  DID fragment is used as a method-independent reference into a  DIDdocument or external  resource. Some examples of DID fragmentidentifiers are shown below.\n        In order to maximize interoperability, implementers are urged to ensure that DID fragments are interpreted in the same way across representations (see  §  6. Representations). For example, whileJSON Pointer [  RFC6901] can be used in a  DID fragment, it will not beinterpreted in the same way across non-JSON  representations.\n  Additional semantics for fragment identifiers, which are compatible with andlayered upon the semantics in this section, are described for JSON-LDrepresentations in  §  B.2 application/did+ld+json. For informationabout how to dereference a  DID fragment, see  §  7.2 DID URL Dereferencing.\n  The  DID URL syntax supports a simple format for parameters based on the query component described in  § Query. Adding a DIDparameter to a  DID URL means that the parameter becomes part of theidentifier for a  resource.\n      Some DID parameters are completely independent of of any specific  DIDmethod and function the same way for all  DIDs. Other DID parametersare not supported by all  DID methods. Where optional parameters aresupported, they are expected to operate uniformly across the  DID methodsthat do support them. The following table provides common DID parameters thatfunction the same way across all  DID methods. Support for all DID Parameters is  OPTIONAL.\n  The DID Working Group is seeking implementer feedback on this feature. If thereis not enough implementation experience with this feature at the end of theCandidate Recommendation period, it will be removed from the specification.\nIdentifies a service from the  DID document by service ID.If present, the associated value  MUST be an  ASCII string.\n  The DID Working Group is seeking implementer feedback on this feature. If thereis not enough implementation experience with this feature at the end of theCandidate Recommendation period, it will be removed from the specification.\nA relative  URI reference according to  RFC3986 Section 4.2 that identifies a resource at a  service endpoint, which is selected from a  DIDdocument by using the  service parameter.If present, the associated value  MUST be an  ASCII string and  MUST use percent-encoding forcertain characters as specified in  RFC3986Section 2.1.\n  Identifies a specific version of a  DID document to be resolved (theversion ID could be sequential, or a  UUID, or method-specific).If present, the associated value  MUST be an  ASCII string.\n  The DID Working Group is seeking implementer feedback on this feature. If thereis not enough implementation experience with this feature at the end of theCandidate Recommendation period, it will be removed from the specification.\nIdentifies a certain version timestamp of a  DID document to be resolved.That is, the  DID document that was valid for a  DID at a certaintime. If present, the associated value MUST be an  ASCII string which is a valid XMLdatetime value, as defined in section 3.3.7 of   W3C XML Schema Definition Language(XSD) 1.1 Part 2: Datatypes [  XMLSCHEMA11-2]. This datetime value  MUST benormalized to UTC 00:00:00 and without sub-second decimal precision.For example:  2020-12-20T19:17:47Z.\n  The DID Working Group is seeking implementer feedback on this feature. If thereis not enough implementation experience with this feature at the end of theCandidate Recommendation period, it will be removed from the specification.\nA resource hash of the  DID document to add integrity protection, asspecified in [  HASHLINK]. This parameter is non-normative.If present, the associated value  MUST be an ASCII string.\n  Implementers as well as  DID method specification authors might useadditional DID parameters that are not listed here. For maximuminteroperability, it is  RECOMMENDED that DID parameters use the DIDSpecification Registries mechanism [  DID-SPEC-REGISTRIES], to avoid collisionwith other uses of the same DID parameter with different semantics.\n  DID parameters might be used if there is a clear use case where the parameterneeds to be part of a  URL that references a  resource with moreprecision than using the  DID alone. It is expected that DID parametersare  not used if the same functionality can be expressed by passinginput metadata to a  DID resolver. Additional considerations forprocessing these parameters are discussed in [  DID-RESOLUTION].\n  The  DID resolution and the  DID URL dereferencing functions canbe influenced by passing input metadata to a  DID resolver that arenot part of the  DID URL (see  §  7.1.1 DID Resolution Options). This is comparable toHTTP, where certain parameters could either be included in an HTTP URL, oralternatively passed as HTTP headers during the dereferencing process. Theimportant distinction is that DID parameters that are part of the  DIDURL should be used to specify  what  resource is beingidentified, whereas input metadata that is not part of the  DID URLshould be use to control  how that  resource is resolved ordereferenced.\n  A relative  DID URL is any URL value in a  DID document that doesnot start with  did:&lt;method-name&gt;:&lt;method-specific-id&gt;. Morespecifically, it is any URL value that does not start with the ABNF defined in §  3.1 DID Syntax. The URL is expected to referencea  resource in the same  DID document. Relative  DID URLs  MAYcontain relative path components, query parameters, and fragment identifiers.\n  When resolving a relative  DID URL reference, the algorithm specified in RFC3986 Section 5: Reference Resolution MUST be used. The  base URI value is the  DID that isassociated with the  DID subject, see  §  5.1.1 DID Subject. The scheme is  did. The  authority is acombination of  &lt;method-name&gt;:&lt;method-specific-id&gt;, and the path,  query, and  fragmentvalues are those defined in  § Path,  § Query, and  § Fragment, respectively.\n  Relative  DID URLs are often used to reference  verification methodsand  services in a  DID Document without having to use absoluteURLs.  DID methods where storage size is a consideration might userelative URLs to reduce the storage size of  DID documents.\n  { &#34;@context&#34;: [ &#34;https://www.w3.org/ns/did/v1&#34;, &#34;https://w3id.org/security/suites/ed25519-2020/v1&#34; ] &#34;id&#34;: &#34;did:example:123456789abcdefghi&#34;, &#34;verificationMethod&#34;: [{ &#34;id&#34;: &#34;did:example:123456789abcdefghi#key-1&#34;, &#34;type&#34;: &#34;Ed25519VerificationKey2020&#34;,  // external (property value) &#34;controller&#34;: &#34;did:example:123456789abcdefghi&#34;, &#34;publicKeyMultibase&#34;: &#34;zH3C2AVvLMv6gmMNam3uVAjZpfkcJCwDwnZn6z3wXmqPV&#34; }, ...], &#34;authentication&#34;: [  // a relative DID URL used to reference a verification method above &#34; #key-1&#34; ]}\n  In the example above, the relative  DID URL value will be transformed toan absolute  DID URL value of did:example:123456789abcdefghi#key-1.\n  This specification defines a data model that can be used to express  DIDdocuments and DID document data structures, which can then be serializedinto multiple concrete  representations. This section provides ahigh-level description of the data model, descriptions of the ways differenttypes of properties are expressed in the data model, and instructions forextending the data model.\n  A  DID document consists of a  map of  entries, where each entry consists of akey/value pair. The  DID document data model contains at least twodifferent classes of entries. The first class of entries is called properties,and is specified in section  §  5. Core Properties. The second classis made up of representation-specific entries, and is specified in section  §  6. Representations.\n    All entry keys in the  DID document data model are  strings. All entry values are expressed using oneof the abstract data types in the table below, and each  representationspecifies the concrete serialization format of each data type.\n  A finite ordered sequence of key/value pairs, with no key appearing twice asspecified in [  INFRA]. A map is sometimes referred to as an ordered map in [  INFRA].\n    A finite ordered sequence of items that does not contain the same item twiceas specified in [  INFRA]. A set is sometimes referred to as an ordered set in [  INFRA].\n  A date and time value that is capable of losslessly expressing all valuesexpressible by a  dateTime as specified in[ XMLSCHEMA11-2].\n  A sequence of code units often used to represent human readable languageas specified in [  INFRA].\n  A real number without a fractional component as specified in[ XMLSCHEMA11-2]. To maximizeinteroperability, implementers are urged to heed the advice regardingintegers in  RFC8259, Section 6: Numbers.\n  A value that is often used to approximate arbitrary real numbers as specifiedin [ XMLSCHEMA11-2]. To maximizeinteroperability, implementers are urged to heed the advice regardingdoubles in  RFC8259, Section 6: Numbers.\n    A value that is used to indicate the lack of a value as defined in [  INFRA].\n  As a result of the  data model being defined usingterminology from [  INFRA], property values which can contain more than oneitem, such as  lists,  maps and  sets, are explicitly ordered. All list-likevalue structures in [  INFRA] are ordered, whether or not that order issignificant. For the purposes of this specification, unless otherwise stated,  map and  set ordering is not important andimplementations are not expected to produce or consume deterministically orderedvalues.\n  For maximum interoperability, it is  RECOMMENDED that extensions use the W3C DID Specification Registries mechanism [  DID-SPEC-REGISTRIES]. The use ofthis mechanism for new properties or other extensions is the only specifiedmechanism that ensures that two different  representations will be able towork together.\n  Representations  MAY define other extensibility mechanisms, including onesthat do not require the use of the DID Specification Registries. Such extensionmechanisms  SHOULD support lossless conversion into any other conformant representation. Extension mechanisms for a  representation  SHOULDdefine a mapping of all properties and  representation syntax into the  data model and its type system.\n  It is always possible for two specific implementations to agree out-of-band touse a mutually understood extension or  representation that is notrecorded in the DID Specification Registries [  DID-SPEC-REGISTRIES];interoperability between such implementations and the larger ecosystem will beless reliable.\n  A  DID is associated with a  DID document. DID documents are expressed using the data model and can be serialized into a representation.The following sections define the properties in a  DID document,including whether these properties are required or optional. These propertiesdescribe relationships between the  DID subject and the value of theproperty.\n  The following tables contain informative references for the core propertiesdefined by this specification, with expected values, and whether or not they arerequired. The property names in the tables are linked to the normativedefinitions and more detailed descriptions of each property.\n  The property names  id,  type, and controller can be present in maps of different typeswith possible differences in constraints.\n  A  set of either  VerificationMethod  maps that conform tothe rules in  § Verification Method properties) or strings that conform to the rules in §  3.2 DID URL Syntax.\n  A  map representing a JSON Web\n......", "posttime": "2021-06-23 01:09:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "标识符,identifiers,方法", "title": "分散的标识符（DIDS）V1.0（W3C草案） ", "title_en": "Decentralized Identifiers (DIDs) v1.0 (W3C draft)", "transed": 1, "url": "https://www.w3.org/TR/did-core/", "via": "", "real_tags": ["标识符", "方法"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我发现区块链迷人，因为它将开源软件开发扩展到开源+状态。这似乎是计算范式的真正/令人兴奋的创新;我们不仅仅是分享代码，我们可以分享一个正在运行的计算机，任何人随时随地都可以以打开和权限的方式使用它。这场革命的种子可以使用比特币开始，所以我变得好奇，详细介绍了它，以便直观地了解它的工作原理。本着“我无法创造的东西我不明白的精神”，这比从头开始实现这一点更好的方法？\n 我们将在纯Python中创建，数字签名和广播比特币事务，从头开始，依赖于零依赖性。在此过程中，我们将学习比特币代表价值的一点。我们去取得它。\n （BTW如果此帖子的视觉格式烦恼您，请参阅jupyter笔记本版本，具有相同的内容）。\n  首先，我们希望生成一个全新的加密身份，这只是私人公共键馆。比特币使用椭圆曲线加密而不是更常见的东西，如RSA来保护事务。在这里，我不会完整介绍ECC，因为其他人已经做了明显更好的工作，例如更好的工作。我发现Andrea Corbellini的博客文章系列是一个特殊的资源。在这里，我们只是写代码，但要理解为什么它有效地工作，您需要通过该系列。\n 好吧，所以比特币使用secp256k1曲线。作为一个新手，我发现这部分令人着迷 - 有些不同的曲线图书馆您可以选择提供不同的专业人员和缺点和属性。 NIST发布了有关哪些使用的建议，但人们更喜欢使用不太可能在其内置后门的其他曲线（如SECP256K1）。无论如何，椭圆曲线是一个相当低的数学数学对象，只需3个整数来定义：\n 来自__future__导入注释#pep 563：推迟评估dataclasses导入dataclass＃https://docs.python.org/3/library/dataclasses.html我喜欢这些很多@ dataclass类曲线：＆＃34;＆＃ 34;＆＃34;椭圆曲线在整数模型的整数领域。曲线上的点满足Y ^ 2 = x ^ 3 + a * x + b（mod p）。 ＆＃34;＆＃34;＆＃34; p：int＃的有限字段的主要模量a：int b：int＃secp256k1使用a = 0，b = 7，所以我们＆＃39;重新处理曲线Y ^ 2 = x ^ 3 + 7（mod p （P = 0x = 0x000000600/6000000/7800300c600c600c600c600ca，＃a = 0 b = 0x000000600/380000c0000c0000c0000c0000c0000c0000c0000c0000c000000ca，＃a = 0 b = 0x00000000c0000c0000c0000c0000c0000c0000c000000c600c600ca，＃a = 0 b = 0x0000000000/3000000ca，＃a = 0 b = 0x00000000000000/3000000capp = 7）\n 除了实际曲线之外，我们除了曲线周期上的一个固定的“起点”，它还可以定义一个发电机点，这些曲线上的一些固定的“起始点”用于在曲线周围启动“随机行走”。发电机是公开的，并同意持续： \n@ dataclass类点：＆＃34;＆＃34;＆＃34;曲线上的整数点（x，y）＆＃34;＆＃34;＆＃34;曲线：曲线X：INT Y：INT G =点（bitcoin_curve，X = 0x79BE667EF9DCBBAC55A06295CE870B07029BFCDB2DCE28D959F2815B16F81798，Y = 0x483ada7726a3c4655da4fbfc0e1108a8fd17b448a68554199c47d08ffb10d4b8）＃我们可以验证该发电机点的确是曲线，即，Y 1 2 = X ^ 3 + 7（MOD p）打印（＆＃34;发电机在曲线上：＆＃34;（g。y ** 2  -  g.x ** 3  -  7）％bitcoin_curve。p == 0）＃一些其他完全随机的点当然不会在曲线上，_MOST_可能会随机进口。种子（1337）x =随机。 RandRange（0，比特币_Curve。P）Y =随机。 RandRange（0，比特币_Curve。P）打印（＆＃34;完全随机点不是：＆＃34;（y ** 2  -  x ** 3  -  7）％比特币_curve。p == 0）\n  最后，已知生成点G的顺序，并且有效地是我们在曲线周围的周期上的（x，y）整数元组方面使用的“设置的大小”。我喜欢将此信息组织成一个更多的数据结构，我会调用生成器：\n @ dataclass类生成器：＆＃34;＆＃34;＆＃34;曲线上的发电机：初始点和（预计）秩序＆＃34;＆＃34;＆＃34; g：点＃曲线上的发电点n：int＃发电点的顺序，所以0 * g = n * g = inf bitcoin_gen =生成器（g = g，＃g的顺序是已知的并且可以在数学上派生N = 0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFBAAEDCE6AF48A03BBFD25E8CD0364141\n 请注意，到目前为止，我们还没有完成任何事情，这一切都只是对某些数据结构的定义，并用与比特币中使用的椭圆曲线相关的公知常数填充它们。这即将改变，因为我们已准备好生成我们的私钥。私钥（或“秘密密钥”如我所说的）即将到来）只是满足1＆lt; = key＆lt;的随机整数。 n（召回n是g的顺序）：\n ＃secret_key = random.randrange（1，bitcoin_gen.nn）＃这是_would_ do secret_key = int的方式。 from_bytes（B＆＃39; Andrej很酷：P＆＃39;，＆＃39; Big＆＃39;）＃这是我将如何为再现性assert 1＆lt; secret_key＆lt;比特币_gen。 n打印（secret_key）\n  这是我们的秘密密钥 - 它是一个非常突出的整数，但任何知道它可以控制与它相关的比特币区块链中拥有的所有资金。在最简单的，最常见的vanilla用例的比特币是控制您帐户的单个“密码”。当然，在我上面的一些其他Andrej手动生成了他们的秘密密钥的情况下，与这个秘密密钥相关的钱包很可能是零比特币的平衡:)。如果它没有，我们确实非常幸运。\n 我们现在要生成公钥，这是事情开始变得有趣的地方。公钥是曲线上的点，从添加发电机点到自身的秘密时间。即，我们有：public_key = g + g + g +（秘密键时）+ g = secret_key * G.请注意，这里的'+'（添加）和'*'（次）符号都非常特别，略微混淆。秘密密钥是一个整数，但是发电机点G是一个（x，y）元组，它是曲线上的点，导致（x，y）元组公钥，再次曲线上的一个点。这是我们必须在椭圆曲线上实际定义加法运算符的地方。它具有一个非常具体的定义和几何解释（见上面的Andrea的发布），但实际实现相对简单： \nWarning: Can only detect less than 5000 characters\nWarning: Can only detect less than 5000 characters", "note_en": "I find blockchain fascinating because it extends open source software development to open source + state. This seems to be a genuine/exciting innovation in computing paradigms; We don’t just get to share code, we get to share a running computer, and anyone anywhere can use it in an open and permissionless manner. The seeds of this revolution arguably began with Bitcoin, so I became curious to drill into it in some detail to get an intuitive understanding of how it works. And in the spirit of “what I cannot create I do not understand”, what better way to do this than implement it from scratch?\n We are going to create, digitally sign, and broadcast a Bitcoin transaction in pure Python, from scratch, and with zero dependencies. In the process we’re going to learn quite a bit about how Bitcoin represents value. Let’s get it.\n (btw if the visual format of this post annoys you, see the  jupyter notebook version, which has identical content).\n  First we want to generate a brand new cryptographic identity, which is just a private, public keypair. Bitcoin uses  Elliptic Curve Cryptography instead of something more common like RSA to secure the transactions. I am not going to do a full introduction to ECC here because others have done a significantly better job, e.g. I found  Andrea Corbellini’s blog post series to be an exceptional resource. Here we are just going to write the code but to understand why it works mathematically you’d need to go through the series.\n Okay so Bitcoin uses the  secp256k1 curve. As a newbie to the area I found this part fascinating - there are entire libraries of different curves you can choose from which offer different pros/cons and properties. NIST publishes recommendations on which ones to use, but people prefer to use other curves (like secp256k1) that are less likely to have backdoors built into them. Anyway, an elliptic curve is a fairly low dimensional mathematical object and takes only 3 integers to define:\n from  __future__  import  annotations  # PEP 563: Postponed Evaluation of Annotations from  dataclasses  import  dataclass  # https://docs.python.org/3/library/dataclasses.html I like these a lot @ dataclass class  Curve :  &#34;&#34;&#34; Elliptic Curve over the field of integers modulo a prime. Points on the curve satisfy y^2 = x^3 + a*x + b (mod p). &#34;&#34;&#34;  p :  int  # the prime modulus of the finite field  a :  int  b :  int # secp256k1 uses a = 0, b = 7, so we&#39;re dealing with the curve y^2 = x^3 + 7 (mod p) bitcoin_curve  =  Curve (  p  =  0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEFFFFFC2F ,  a  =  0x0000000000000000000000000000000000000000000000000000000000000000 ,  # a = 0  b  =  0x0000000000000000000000000000000000000000000000000000000000000007 ,  # b = 7 )\n In addition to the actual curve we define a Generator point, which is just some fixed “starting point” on the curve’s cycle, which is used to kick off the “random walk” around the curve. The generator is a publicly known and agreed upon constant:\n @ dataclass class  Point :  &#34;&#34;&#34; An integer point (x,y) on a Curve &#34;&#34;&#34;  curve :  Curve  x :  int  y :  int G  =  Point (  bitcoin_curve ,  x  =  0x79BE667EF9DCBBAC55A06295CE870B07029BFCDB2DCE28D959F2815B16F81798 ,  y  =  0x483ada7726a3c4655da4fbfc0e1108a8fd17b448a68554199c47d08ffb10d4b8 , ) # we can verify that the generator point is indeed on the curve, i.e. y^2 = x^3 + 7 (mod p) print ( &#34;Generator IS on the curve: &#34; ,  ( G . y ** 2  -  G . x ** 3  -  7 )  %  bitcoin_curve . p  ==  0 ) # some other totally random point will of course not be on the curve, _MOST_ likely import  random random . seed ( 1337 ) x  =  random . randrange ( 0 ,  bitcoin_curve . p ) y  =  random . randrange ( 0 ,  bitcoin_curve . p ) print ( &#34;Totally random point is not: &#34; ,  ( y ** 2  -  x ** 3  -  7 )  %  bitcoin_curve . p  ==  0 )\n  Finally, the order of the generating point G is known, and is effectively the “size of the set” we are working with in terms of the (x,y) integer tuples on the cycle around the curve. I like to organize this information into one more data structure I’ll call Generator:\n @ dataclass class  Generator :  &#34;&#34;&#34; A generator over a curve: an initial point and the (pre-computed) order &#34;&#34;&#34;  G :  Point  # a generator point on the curve  n :  int  # the order of the generating point, so 0*G = n*G = INF bitcoin_gen  =  Generator (  G  =  G ,  # the order of G is known and can be mathematically derived  n  =  0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEBAAEDCE6AF48A03BBFD25E8CD0364141 , )\n Notice that we haven’t really done anything so far, it’s all just definition of some data structures, and filling them with the publicly known constants related to the elliptic curves used in Bitcoin. This is about to change, as we are ready to generate our private key. The private key (or “ secret key” as I’ll call it going forward) is simply a random integer that satisfies 1 &lt;= key &lt; n (recall n is the order of G):\n # secret_key = random.randrange(1, bitcoin_gen.n) # this is how you _would_ do it secret_key  =  int . from_bytes ( b &#39;Andrej is cool :P&#39; ,  &#39;big&#39; )  # this is how I will do it for reproducibility assert  1  &lt;=  secret_key  &lt;  bitcoin_gen . n print ( secret_key )\n  This is our secret key - it is a a pretty unassuming integer but anyone who knows it can control all of the funds you own on the Bitcoin blockchain, associated with it. In the simplest, most common vanilla use case of Bitcoin it is the single “password” that controls your account. Of course, in the exceedingly unlikely case that some other Andrej manually generated their secret key as I did above, the wallet associated with this secret key most likely has a balance of zero bitcoin :). If it didn’t we’d be very lucky indeed.\n We are now going to generate the  public key, which is where things start to get interesting. The public key is the point on the curve that results from adding the generator point to itself secret_key times. i.e. we have: public_key = G + G + G + (secret key times) + G = secret_key * G. Notice that both the ‘+’ (add) and the ‘*’ (times) symbol here is very special and slightly confusing. The secret key is an integer, but the generator point G is an (x,y) tuple that is a Point on the Curve, resulting in an (x,y) tuple public key, again a Point on the Curve. This is where we have to actually define the Addition operator on an elliptic curve. It has a very specific definition and a geometric interpretation (see Andrea’s post above), but the actual implementation is relatively simple:\n INF  =  Point ( None ,  None ,  None )  # special point at &#34;infinity&#34;, kind of like a zero def  extended_euclidean_algorithm ( a ,  b ):  &#34;&#34;&#34; Returns (gcd, x, y) s.t. a * x + b * y == gcd This function implements the extended Euclidean algorithm and runs in O(log b) in the worst case, taken from Wikipedia. &#34;&#34;&#34;  old_r ,  r  =  a ,  b  old_s ,  s  =  1 ,  0  old_t ,  t  =  0 ,  1  while  r  !=  0 :  quotient  =  old_r  //  r  old_r ,  r  =  r ,  old_r  -  quotient  *  r  old_s ,  s  =  s ,  old_s  -  quotient  *  s  old_t ,  t  =  t ,  old_t  -  quotient  *  t  return  old_r ,  old_s ,  old_t def  inv ( n ,  p ):  &#34;&#34;&#34; returns modular multiplicate inverse m s.t. (n * m) % p == 1 &#34;&#34;&#34;  gcd ,  x ,  y  =  extended_euclidean_algorithm ( n ,  p )  # pylint: disable=unused-variable  return  x  %  p def  elliptic_curve_addition ( self ,  other :  Point )  -&gt;  Point :  # handle special case of P + 0 = 0 + P = 0  if  self  ==  INF :  return  other  if  other  ==  INF :  return  self  # handle special case of P + (-P) = 0  if  self . x  ==  other . x  and  self . y  !=  other . y :  return  INF  # compute the &#34;slope&#34;  if  self . x  ==  other . x :  # (self.y = other.y is guaranteed too per above check)  m  =  ( 3  *  self . x ** 2  +  self . curve . a )  *  inv ( 2  *  self . y ,  self . curve . p )  else :  m  =  ( self . y  -  other . y )  *  inv ( self . x  -  other . x ,  self . curve . p )  # compute the new point  rx  =  ( m ** 2  -  self . x  -  other . x )  %  self . curve . p  ry  =  ( - ( m * ( rx  -  self . x )  +  self . y ))  %  self . curve . p  return  Point ( self . curve ,  rx ,  ry ) Point . __add__  =  elliptic_curve_addition  # monkey patch addition into the Point class\n I admit that it may look a bit scary and understanding and re-deriving the above took me a good half of a day. Most of the complexity comes from all of the math being done with modular arithmetic. So even simple operations like division ‘/’ suddenly require algorithms such as the modular multiplicative inverse  inv. But the important thing to note is that everything is just a bunch of adds/multiplies over the tuples (x,y) with some modulo p sprinkled everywhere in between. Let’s take it for a spin by generating some trivial (private, public) keypairs:\n # if our secret key was the integer 1, then our public key would just be G: sk  =  1 pk  =  G print ( f &#34; secret key:  { sk } \\n  public key:  { ( pk . x ,  pk . y ) } &#34; ) print ( &#34;Verify the public key is on the curve: &#34; ,  ( pk . y ** 2  -  pk . x ** 3  -  7 )  %  bitcoin_curve . p  ==  0 ) # if it was 2, the public key is G + G: sk  =  2 pk  =  G  +  G print ( f &#34; secret key:  { sk } \\n  public key:  { ( pk . x ,  pk . y ) } &#34; ) print ( &#34;Verify the public key is on the curve: &#34; ,  ( pk . y ** 2  -  pk . x ** 3  -  7 )  %  bitcoin_curve . p  ==  0 ) # etc.: sk  =  3 pk  =  G  +  G  +  G print ( f &#34; secret key:  { sk } \\n  public key:  { ( pk . x ,  pk . y ) } &#34; ) print ( &#34;Verify the public key is on the curve: &#34; ,  ( pk . y ** 2  -  pk . x ** 3  -  7 )  %  bitcoin_curve . p  ==  0 )\n secret key: 1 public key: (55066263022277343669578718895168534326250603453777594175500187360389116729240, 32670510020758816978083085130507043184471273380659243275938904335757337482424)Verify the public key is on the curve: True secret key: 2 public key: (89565891926547004231252920425935692360644145829622209833684329913297188986597, 12158399299693830322967808612713398636155367887041628176798871954788371653930)Verify the public key is on the curve: True secret key: 3 public key: (112711660439710606056748659173929673102114977341539408544630613555209775888121, 25583027980570883691656905877401976406448868254816295069919888960541586679410)Verify the public key is on the curve: True\n Okay so we have some keypairs above, but we want the public key associated with our randomly generator secret key above. Using just the code above we’d have to add G to itself a very large number of times, because the secret key is a large integer. So the result would be correct but it would run very slow. Instead, let’s implement the “double and add” algorithm to dramatically speed up the repeated addition. Again, see the post above for why it works, but here it is:\n def  double_and_add ( self ,  k :  int )  -&gt;  Point :  assert  isinstance ( k ,  int )  and  k  &gt;=  0  result  =  INF  append  =  self  while  k :  if  k  &amp;  1 :  result  +=  append  append  +=  append  k  &gt;&gt;=  1  return  result # monkey patch double and add into the Point class for convenience Point . __rmul__  =  double_and_add # &#34;verify&#34; correctness print ( G  ==  1 * G ) print ( G  +  G  ==  2 * G ) print ( G  +  G  +  G  ==  3 * G )\n  # efficiently calculate our actual public key! public_key  =  secret_key  *  G print ( f &#34;x:  { public_key . x } \\n y:  { public_key . y } &#34; ) print ( &#34;Verify the public key is on the curve: &#34; ,  ( public_key . y ** 2  -  public_key . x ** 3  -  7 )  %  bitcoin_curve . p  ==  0 )\n  With the private/public key pair we’ve now generated our crypto identity. Now it is time to derive the associated Bitcoin wallet address. The wallet address is not just the public key itself, but it can be deterministically derived from it and has a few extra goodies (such as an embedded checksum). Before we can generate the address though we need to define some hash functions. Bitcoin uses the ubiquitous SHA-256 and also RIPEMD-160. We could just plug and play use the implementations in Python’s  hashlib, but this is supposed to be a zero-dependency implementation, so  import hashlib is cheating. So first here is the SHA256 implementation I wrote in pure Python following the (relatively readable) NIST  FIPS PUB 180-4 doc:\n def  gen_sha256_with_variable_scope_protector_to_not_pollute_global_namespace ():  &#34;&#34;&#34; SHA256 implementation. Follows the FIPS PUB 180-4 description for calculating SHA-256 hash function https://nvlpubs.nist.gov/nistpubs/FIPS/NIST.FIPS.180-4.pdf Noone in their right mind should use this for any serious reason. This was written purely for educational purposes. &#34;&#34;&#34;  import  math  from  itertools  import  count ,  islice  # -----------------------------------------------------------------------------  # SHA-256 Functions, defined in Section 4  def  rotr ( x ,  n ,  size = 32 ):  return  ( x  &gt;&gt;  n )  |  ( x  &lt;&lt;  size  -  n )  &amp;  ( 2 ** size  -  1 )  def  shr ( x ,  n ):  return  x  &gt;&gt;  n  def  sig0 ( x ):  return  rotr ( x ,  7 )  ^  rotr ( x ,  18 )  ^  shr ( x ,  3 )  def  sig1 ( x ):  return  rotr ( x ,  17 )  ^  rotr ( x ,  19 )  ^  shr ( x ,  10 )  def  capsig0 ( x ):  return  rotr ( x ,  2 )  ^  rotr ( x ,  13 )  ^  rotr ( x ,  22 )  def  capsig1 ( x ):  return  rotr ( x ,  6 )  ^  rotr ( x ,  11 )  ^  rotr ( x ,  25 )  def  ch ( x ,  y ,  z ):  return  ( x  &amp;  y ) ^  ( ~ x  &amp;  z )  def  maj ( x ,  y ,  z ):  return  ( x  &amp;  y )  ^  ( x  &amp;  z )  ^  ( y  &amp;  z )  def  b2i ( b ):  return  int . from_bytes ( b ,  &#39;big&#39; )  def  i2b ( i ):  return  i . to_bytes ( 4 ,  &#39;big&#39; )  # -----------------------------------------------------------------------------  # SHA-256 Constants  def  is_prime ( n ):  return  not  any ( f  for  f  in  range ( 2 , int ( math . sqrt ( n )) + 1 )  if  n % f  ==  0 )  def  first_n_primes ( n ):  return  islice ( filter ( is_prime ,  count ( start = 2 )),  n )  def  frac_bin ( f ,  n = 32 ):  &#34;&#34;&#34; return the first n bits of fractional part of float f &#34;&#34;&#34;  f  -=  math . floor ( f )  # get only the fractional part  f  *=  2 ** n  # shift left  f  =  int ( f )  # truncate the rest of the fractional content  return  f  def  genK ():  &#34;&#34;&#34; Follows Section 4.2.2 to generate K The first 32 bits of the fractional parts of the cube roots of the first 64 prime numbers: 428a2f98 71374491 b5c0fbcf e9b5dba5 3956c25b 59f111f1 923f82a4 ab1c5ed5 d807aa98 12835b01 243185be 550c7dc3 72be5d74 80deb1fe 9bdc06a7 c19bf174 e49b69c1 efbe4786 0fc19dc6 240ca1cc 2de92c6f 4a7484aa 5cb0a9dc 76f988da 983e5152 a831c66d b00327c8 bf597fc7 c6e00bf3 d5a79147 06ca6351 14292967 27b70a85 2e1b2138 4d2c6dfc 53380d13 650a7354 766a0abb 81c2c92e 92722c85 a2bfe8a1 a81a664b c24b8b70 c76c51a3 d192e819 d6990624 f40e3585 106aa070 19a4c116 1e376c08 2748774c 34b0bcb5 391c0cb3 4ed8aa4a 5b9cca4f 682e6ff3 748f82ee 78a5636f 84c87814 8cc70208 90befffa a4506ceb bef9a3f7 c67178f2 &#34;&#34;&#34;  return  [ frac_bin ( p  **  ( 1 / 3.0 ))  for  p  in  first_n_primes ( 64 )]  def  genH ():  &#34;&#34;&#34; Follows Section 5.3.3 to generate the initial hash value H^0 The first 32 bits of the fractional parts of the square roots of the first 8 prime numbers. 6a09e667 bb67ae85 3c6ef372 a54ff53a 9b05688c 510e527f 1f83d9ab 5be0cd19 &#34;&#34;&#34;  return  [ frac_bin ( p  **  ( 1 / 2.0 ))  for  p  in  first_n_primes ( 8 )]  # -----------------------------------------------------------------------------  def  pad ( b ):  &#34;&#34;&#34; Follows Section 5.1: Padding the message &#34;&#34;&#34;  b  =  bytearray ( b )  # convert to a mutable equivalent  l  =  len ( b )  *  8  # note: len returns number of bytes not bits  # append but &#34;1&#34; to the end of the message  b . append ( 0b10000000 )  # appending 10000000 in binary (=128 in decimal)  # follow by k zero bits, where k is the smallest non-negative solution to  # l + 1 + k = 448 mod 512  # i.e. pad with zeros until we reach 448 (mod 512)  while  ( len ( b ) * 8 )  %  512  !=  448 :  b . append ( 0x00 )  # the last 64-bit block is the length l of the original message  # expressed in binary (big endian)  b . extend ( l . to_bytes ( 8 ,  &#39;big&#39; ))  return  b  def  sha256 ( b :  bytes )  -&gt;  bytes :  # Section 4.2  K  =  genK ()  # Section 5: Preprocessing  # Section 5.1: Pad the message  b  =  pad ( b )  # Section 5.2: Separate the message into blocks of 512 bits (64 bytes)  blocks  =  [ b [ i : i + 64 ]  for  i  in  range ( 0 ,  len ( b ),  64 )]  # for each message block M^1 ... M^N  H  =  genH ()  # Section 5.3  # Section 6  for  M  in  blocks :  # each block is a 64-entry array of 8-bit bytes  # 1. Prepare the message schedule, a 64-entry array of 32-bit words  W  =  []  for  t  in  range ( 64 ):  if  t  &lt;=  15 :  # the first 16 words are just a copy of the block  W . append ( bytes ( M [ t * 4 : t * 4 + 4 ]))  else :  term1  =  sig1 ( b2i ( W [ t - 2 ]))  term2  =  b2i ( W [ t - 7 ])  term3  =  sig0 ( b2i ( W [ t - 15 ]))  term4  =  b2i ( W [ t - 16 ])  total  =  ( term1  +  term2  +  term3  +  term4 )  %  2 ** 32  W . append ( i2b ( total ))  # 2. Initialize the 8 working variables a,b,c,d,e,f,g,h with prev hash value  a ,  b ,  c ,  d ,  e ,  f ,  g ,  h  =  H  # 3.  for  t  in  range ( 64 ):  T1  =  ( h  +  capsig1 ( e )  +  ch ( e ,  f ,  g )  +  K [ t ]  +  b2i ( W [ t ]))  %  2 ** 32  T2  =  ( capsig0 ( a )  +  maj ( a ,  b ,  c ))  %  2 ** 32  h  =  g  g  =  f  f  =  e  e  =  ( d  +  T1 )  %  2 ** 32  d  =  c  c  =  b  b  =  a  a  =  ( T1  +  T2 )  %  2 ** 32  # 4. Compute the i-th intermediate hash value H^i  delta  =  [ a ,  b ,  c ,  d ,  e ,  f ,  g ,  h ]  H  =  [( i1  +  i2 )  %  2 ** 32  for  i1 ,  i2  in  zip ( H ,  delta )]  return  b &#39;&#39; . join ( i2b ( i )  for  i  in  H )  return  sha256 sha256  =  gen_sha256_with_variable_scope_protector_to_not_pollute_global_namespace () print ( &#34;verify empty hash:&#34; ,  sha256 ( b &#39;&#39; ). hex ())  # should be e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855 print ( sha256 ( b &#39;here is a random bytes message, cool right?&#39; ). hex ()) print ( &#34;number of bytes in a sha256 digest: &#34; ,  len ( sha256 ( b &#39;&#39; )))\n  Okay the reason I wanted to implement this from scratch and paste it here is that I want you to note that again there is nothing too scary going on inside. SHA256 takes some bytes message that is to be hashed, it first pads the message, then breaks it up into chunks, and passes these chunks into what can best be described as a fancy “bit mixer”, defined in section 3, that contains a number of bit shifts and binary operations orchestrated in a way that is frankly beyond me, but that results in the beautiful properties that SHA256 offers. In particular, it creates a fixed-sized, random-looking short digest of any variably-sized original message s.t. the scrambling is not invertible and also it is basically computationally impossible to construct a different message that hashes to any given digest.\n Bitcoin uses SHA256 everywhere to create hashes, and of course it is the core element in Bitcoin’s Proof of Work, where the goal is to modify the block of transactions until the whole thing hashes to a sufficiently low number (when the bytes of the digest are interpreted as a number). Which, due to the nice properties of SHA256, can only be done via brute force search. So all of the ASICs designed for efficient mining are just incredibly optimized close-to-the-metal implementations of exactly the above code.\n Anyway before we can generate our address we also need the RIPEMD160 hash function, which I found on the internet and shortened and cleaned up:\n def  gen_ripemd160_with_variable_scope_protector_to_not_pollute_global_namespace ():  import  sys\n......", "posttime": "2021-06-23 01:08:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,python,划伤,tour,曲线", "title": "在Python的比特币划伤之旅 ", "title_en": "A from-scratch tour of Bitcoin in Python", "transed": 1, "url": "https://karpathy.github.io/2021/06/21/blockchain/", "via": "", "real_tags": ["比特币", "python", "划伤", "tour", "曲线"]}, {"category": "", "categoryclass": "", "imagename": "f8b746c90a0ed763e726acfcd1920e1c.jpg", "infoid": 1067494, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个破裂的老基石被最高法院从NCAA下来猛拉出来，它将导致那家粗暴的房子的总崩溃，只是你看。很快就会在Mark Emmert的脚下没有任何东西，而是几个腐烂的董事会。 NCAA应该签出：“这个财产受到谴责。”\n 这是一个不可避免的时刻，但埃蒙特和他的中尉在法律费用中度过了多年和数十亿美元，试图通过法院战斗运动员而不是回归基本上是他们被盗的财产。 “NCAA不高于法律，”Brett M. Kavanaugh Justice Brett M. Kavanaugh在NCAA v的一致9-0决定中写道。阿尔斯顿哦，但它认为这是。在整个现代法律史上，NCAA的管家依靠傲慢的假设，因为他们所做的本质所欠的法院归咎于：他们是业余主义和学术纯洁的守门人，即使他们剥离和融合和收集的后期rakeoffs。\n 在句子之后，在短语之后短语，最高宫廷离开NCAA无与伦之裸露，没有任何东西留下了它的自负。\n   “NCAA Couches为没有支付无害的标签支付学生运动员的论点，”Kavanaugh写道。 “但是标签不能伪造现实：NCAA的商业模式在美国几乎任何其他行业都会在美国的几乎是违法的。”繁荣。脚踝周围的裤子。\n 这句话肯定会导致赋予诉讼。这就是这一点，从Neil M.戈尔苏奇大致意见：“简单地说，这套诉讼涉及在被告运动市场控制的市场中承认水平价格修复，”他写道。\n  “平坦的非法”和“价格定影” - 这些是NCAA思想是一个狭隘的小案的大词。阿尔斯顿在其脸上，只是关于NCAA是否可以执行限制与研究生奖学金等某些教育相关福利的规则。但最高法院宽阔 - 而且这样做就踢了腿部，即NCAA一直在捍卫其在其他案件中捍卫其非法行为的腿，特别是运动员收回他们的名字，形象和肖像权利所带来的仍然在较低的法院。\n   ncaa认为它有一个魔法斗篷，但现在它已经消失了。它依赖于1984年统治的措辞叫做NCAA诉委员会的措辞。董事会的董事会，该委员会指出，具有学术传统的大学足球是从小联盟棒球的区别。 NCAA认为其“业余爱情”规则将运动员从法院赚钱“祝福”。 \n不再。这是卡瓦万撤回这种祝福。 “流浪点评”来自皇家人，他写得不屑一顾好像NCAA是一只胡同猫，没有辩护。他总结了NCAA多年来，NCAA在法院潜入的循环逻辑：“NCAA表示，由于NCAA的说法，大学可能会拒绝支付学生运动员，因为NCAA的大学运动的定义特征是学生运动员没有支付。“\n Kavanaugh在它适当的荒凉的背景下放置。 “医院不能同意护士收入，以创造一个”普及的“形式的帮助病人，”他写道。 “...电影工作室不能削减对镜头船员的优势，以点燃好莱坞的”业余主义精神“。”\n   Kavanaugh写道，为了太久，NCAA“从普通的反托拉斯审查中长期屏蔽了它的薪酬规则”，Kavanaugh写道。\n 戈斯鲁克也袭击了NCAA的推理作为特权状态的要求。它要求“从[反托拉斯法律]为其贸易束缚的条件下，我们应该忽视其限制，因为他们恰好落在高等教育，体育和金钱 - 我们不能同意，我们不能同意， “ 他写了。\n 魔术斗篷已经被撕掉了。在它的地方是埃蒙特和他的潜在客户的裸露膝盖，以及很多问题。允许运动员如何从他们的姓名，图像和肖像中受益影响运动部门的整体收入？运动员在较小的运动中的效果会是什么？是否必须有薪水帽保持竞争性平衡？由于没有发现NCAA自己的规则在法律之外，这是真的有什么这样的事情是“非法招聘”？\n  这些问题必须由自然市场力量或国家和联邦立法回答。肯定的是，他们将不再被一个利润的囤积官僚机构回答，这些官僚机构使用反复无常的规则预订和道德化“纯粹”的“纯洁”，作为其在学生背面的掠夺性商业实践的封面。\n   “我们很激动，”胜利的律师史蒂夫·佩曼是通过电子邮件写的。 “NCAA不再争辩说它有权尊重其他企业没有。” \nNCAA已成为另一个坏公司演员。 它已经消失的过度力量，你可以听到碎片。 什么会替换它？ 更好的东西。 法院正确认识到，大学运动员仍然必须注册和良好的学术地位。 这是一种愚蠢的谬误，总是，遏制NCAA的失控力量会以某种方式使系统更纯于它。 事实上，它将使其更加诚实，更直接。 更直的。  如何重建？ 这是第一块砖：一个人的自然名称和服务员经济权利本质上属于它们而不是NCAA。 从那个角色开始。 从现在开始的其他事情都会是稳定的，从现在开始造成更多的意义。  当天最重要的新闻故事，由邮政编辑策划并每天早上交付。 ", "note_en": "A cracked old cornerstone has been yanked out from under the NCAA by the Supreme Court, and it’s going to lead to the total collapse of that crude shanty house, just you watch. Soon there will be nothing left under Mark Emmert’s feet but a few rotten boards. The NCAA should put a sign out: “This property is condemned.”\n This was an inevitable moment, and yet Emmert and his lieutenants spent years and billions in legal fees trying to forestall it, fighting athletes through the courts instead of returning what was essentially their stolen property. “The NCAA is not above the law,” Justice Brett M. Kavanaugh wrote in a concurrence to the  unanimous 9-0 decision in  NCAA v. Alston. Oh, but it thought it was. Throughout its modern legal history, the NCAA’s stewards had relied on the arrogant supposition that the courts owed them acquiescence because of the nature of what they do: They were the gatekeepers of amateurism and of scholarly purity, even as they filched and conned and collected backroom rakeoffs.\n In sentence after sentence, phrase after phrase, the highest court left the NCAA unhoused and naked, with nothing left but its pretensions.\n   “The NCAA couches its arguments for not paying student athletes in innocuous labels,” Kavanaugh wrote. “But the labels cannot disguise the reality: The NCAA’s business model would be flatly illegal in almost any other industry in America.” Boom. Pants around ankles.\n That sentence is sure to lead to a blitz of litigation. So is this one, from Justice Neil M. Gorsuch in the majority opinion: “Put simply, this suit involves admitted horizontal price fixing in a market where the defendants exercise market control,” he wrote.\n  “Flatly illegal” and “price fixing” — those are big words for what the NCAA thought was a narrow little case.  Alston was, on its face, simply about whether the NCAA could enforce rules limiting certain education-related benefits such as graduate scholarships. But the Supreme Court went broad — and in doing so it kicked the legs out of every legal argument the NCAA has been using to defend its illegal behavior in other cases, especially those brought by athletes to reclaim their name, image and likeness rights, which are still in the lower courts.\n   The NCAA thought it had a magic cloak, but now it’s gone. It had relied heavily on wording in a 1984 ruling called  NCAA v. Board of Regents, which stated that the identification of college football with an academic tradition is what differentiated it from minor league baseball. The NCAA took that to mean its “amateurism” rules that restrict athletes from making money had been “blessed” by the courts.\n Not anymore. Here is Kavanaugh retracting that blessing. “Stray comments” from  Regents, he wrote dismissively as if the NCAA were an alley cat, did not amount to a defense. He summed up the circular logic the NCAA has been foisting off on courts for years: “The NCAA says that colleges may decline to pay student athletes because the defining feature of college sports, according to the NCAA, is that the student athletes are not paid.”\n Kavanaugh put that in its properly ludicrous context. “Hospitals cannot agree to cap nurses’ income in order to create a ‘purer’ form of helping the sick,” he wrote. “… Movie studios cannot collude to slash benefits to camera crews to kindle a ‘spirit of amateurism’ in Hollywood.”\n   For too long, the NCAA “has long shielded its compensation rules from ordinary antitrust scrutiny” with that sort of nonsense, Kavanaugh wrote.\n Gorsuch, too, attacked the NCAA’s reasoning as a request for privileged status. It demanded “a sort of judicially ordained immunity from the terms of [antitrust law] for its restraints of trade — that we should overlook its restrictions because they happen to fall at the intersection of higher education, sports, and money — we cannot agree,” he wrote.\n The magic cloak has been torn away. In its place are the bare knees of Emmert and his lead counsels, and a lot of questions. How will allowing athletes to benefit from their names, images and likenesses affect overall revenue for athletic departments? What will the effect be for athletes in smaller sports? Will there have to be salary caps to preserve competitive balance? Is there really any such thing anymore as “illegal recruiting” since the NCAA’s own rules have been found to be outside of the law?\n  Those questions will have to be answered by natural market forces, or by state and federal legislation. What’s sure is that they will no longer be answered by a profit-hoarding bureaucracy that used capricious rule-booking and moralizing on “purity” of amateurs as cover for its predatory business practices on the backs of students.\n   “We’re thrilled,” Steve Berman, one of the winning attorneys, wrote via email. “The NCAA can no longer argue that it’s entitled to deference other businesses don’t have.”\n The NCAA has become just another bad corporate actor. The inordinate power it had is gone, and you can hear the splintering. What will replace it? Something better. The court rightly recognized that college athletes still have to be enrolled and in good academic standing. It was a silly fallacy, always, that curbing the NCAA’s runaway power would somehow make the system more impure than it already is. In fact, it will make it more honest, more direct. Straighter.\n How to rebuild? Here’s the first brick: A person’s natural-born name and attendant economic rights inherently belong to them and not to the NCAA. Start with that cornerstone. Everything else that comes after will be solid and make a lot more sense from now on.\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-06-23 01:07:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "知道,longer,ncaa", "title": "很快，我们知道的NCAA将不再存在。 甩掉包袱。 ", "title_en": "Soon, the NCAA as we know it will no longer exist. Good riddance.", "transed": 1, "url": "https://www.washingtonpost.com/sports/2021/06/22/sally-jenkins-supreme-court-ncaa-decision/", "via": "", "real_tags": ["知道", "longer", "ncaa"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067493, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家说，该系统对环境影响很小，对牲畜养殖形成鲜明对比\n    根据一项新的研究，结合太阳能和微生物可以产生比大豆豆类等作物更多的蛋白质的10倍。\n 研究人员表示，该系统对环境影响很小，与牲畜养殖鲜明对比，导致巨大的气候加热气体以及水污染。\n  该概念使用从空气中的太阳能电池板和二氧化碳的电力来为微生物生长，以产生燃料，然后在生物反应器VATS中生长，然后加工成干燥的蛋白质粉末。科学家说，该过程使土地，水和肥料的高效利用能够部署，不仅可以在任何地方部署，而不仅仅是在具有强大的阳光或肥沃土壤的国家。\n 他们说，粮食安全是未来几十年来人类的“关键问题”，他们表示，随着全球人口生长，生物燃料与作物的土地竞争，大约800万人今天已经营造了约800万人。此外，在不削减动物和乳制品生产的情况下，解决气候危机将近不可能。\n 微生物已经用于制作许多常见的食物，如面包，酸奶，啤酒和Quorn。但其他研究人员称，将消费者转化为食用微生物蛋白可能是困难的，并且这种食物可能不会营养完整。\n Dorian Leger，在波茨坦的Max Planck分子植物生理学研究所，德国领导了新分析，说：“我们认为微生物食品非常有前途，并将成为解决潜在粮食危机的主要贡献者之一。 \n“它可能会在消费方面迅速拿起，但很难说。 “但我做了一些运动，如果我现在被提供了一种细菌蛋白质，我会有它。”\n 该团队专注于大豆豆，因为这些与森林的破坏相关，大多是喂养动物，但其他细菌产生棕榈油的主要元素。 “细菌非常灵活，因此他们最终可以调整到不同的产品，”leger说。\n 至少有十几家公司已经从微生物生产动物饲料，但细菌通常是从其他作物或甲烷或甲醇的糖中从化石燃料中喂食。基于芬兰的太阳能食品正在利用电力为人类创造食物。\n 公布的新评估在美国美国国家科学院的期刊上发布，是传统农业和太阳能微生物生产系统之间的土地利用和能源效率的第一次定量比较。\n 研究人员使用了今天技术的数据来计算过程的每个步骤的效率，包括从空中捕获CO 2并将微生物加工成人们可以吃的食物。他们发现微生物系统仅使用作物所需的1％，肥料的一小部分，其中大部分是在领域使用时浪费。\n 该分析估计，每年的每公顷（或每英亩）的​​太阳微生物过程可以从每公顷（或每英亩）产生15吨蛋白质，足以养活520人，科学家表示是保守的估计。相比之下，大豆豆类公顷可以产生1.1吨蛋白质，喂食40人。即使在阳光水平等阳光水平的国家，微生物蛋白质产量比每公顷的微生物蛋白质产量比植物至少需要五倍。\n 研究人员建议，微生物蛋白的成本与当前蛋白质（例如乳清或豌豆）吃的目前蛋白质相同。但它比目前的动物饲料昂贵几倍，尽管未来的技术改善预计将降低成本。 \nLeger表示植物对光合作用的能力显着，但在能效方面，主食仅将大约1％的太阳能转化为可食用的生物质。这是因为植物已经发展以竞争和再现，并且刚刚增长，并且使用比光伏面板更少的太阳光谱。\n 系统的所有组件都存在，但是leger表示他们现在需要一起测试，特别是在尺度上进行测试，特别是从空气中捕获CO 2，并确保使用的太阳能电池板可以回收利用。 “对于人类食物，也需要克服很多规定，”他说。\n Pete Iannetta在苏格兰詹姆斯·赫顿研究所，说：“”这是一个非常有趣的概念 - 你正在离婚从土地使用中的食物生产，这意味着你可以拥有可重新制造的所有土地。“\n 但他说，食物不仅由主要营养素组成，如蛋白质和碳水化合物：“有很多次要化合物对您的福祉很重要。” Iannetta还质疑微生物食品是否会成为主流：“例如，我们使用了很长时间的藻类作为潜在的食物资源，但它仍然没有被广泛接受。”\n 农业技术顾问博士博士表示：“直到模型与试验厂的测试和成本计算，包括[太阳能电池板]生产的生命周期评估，很难评论它是否有所改善[农业]已经持续了数千年的系统，尽管人口低于我们计划饲料的人口。“ ", "note_en": "The system would also have very little impact on the environment, in contrast to livestock farming, scientists say\n    Combining solar power and microbes could produce 10 times more protein than crops such as soya beans, according to a new study.\n The system would also have very little impact on the environment, the researchers said, in stark contrast to livestock farming which results in  huge amounts of climate-heating gases as well as water pollution.\n  The concept uses electricity from solar panels and carbon dioxide from the air to create fuel for microbes, which are grown in bioreactor vats and then processed into dry protein powders. The process makes highly efficient use of land, water and fertiliser and could be deployed anywhere, not just in countries with strong sunshine or fertile soils, the scientists said.\n Food security is a “critical issue” for humanity in coming decades, they said, with the global population growing, biofuels competing for land with crops, and about 800 million people already undernourished today. Furthermore, tackling the climate crisis will be near impossible without  slashing emissions from animal and dairy food production.\n Microbes are already used to make many common foods, such as bread, yoghurt, beer and Quorn. But other researchers said converting consumers to eating microbial protein might be difficult and that such foods may not be nutritionally complete.\n Dorian Leger, at the Max Planck Institute of Molecular Plant Physiology in Potsdam, Germany, who led the new analysis, said: “We think microbial foods are very promising and will be one of the major contributors to solving the potential food crisis.\n “It might pick up quite quickly on the consumer side, but it’s hard to say. “But I do some exercise, and if I was offered a bacterial protein shake now, I would have it.”\n The team focused on soya beans, as these are  linked to the destruction of forests and are mostly fed to animals, but other bacteria produce the main elements of palm oil. “Bacteria are very flexible, so they could eventually be tuned to different products,” Leger said.\n At least a dozen companies are already  producing animal feed from microbes but the bacteria are typically fed either sugars from other crops or methane or methanol from fossil fuels.  Solar Foods, based in Finland, is using electricity to create food for humans.\n The new assessment, published in the journal  Proceedings of the National Academy of Sciences of the United States of America, is the first quantitative comparison of land use and energy efficiency between traditional agriculture and solar-powered microbial production systems.\n The researchers used data on today’s technologies to calculate the efficiency of each step of the process, including capturing CO 2 from the air and processing the microbes into food that people could eat. They found the microbial system used just 1% of the water needed by the crops and a small fraction of the fertiliser, most of which is wasted when used in fields.\n The analysis estimated that the solar-microbial process could produce 15 tonnes of protein from each hectare (or per 2.5 acres) a year, enough to feed 520 people, which the scientists said was a conservative estimate. In comparison, a hectare of soya beans could produce 1.1 tonnes of protein, feeding 40 people. Even in countries with relatively low sunlight levels  like the UK, microbial protein production was at least five times greater from each hectare than plants.\n The microbial protein would cost about the same as current proteins eaten by people, such as whey or pea, the researchers suggested. But it was several times more expensive than current animal feeds, although future technological improvements are expected to lower costs.\n Leger said plants’ ability to photosynthesise is remarkable but, in terms of energy efficiency, staple crops only convert about 1% of solar energy into edible biomass. This is because plants have evolved to compete and reproduce as well as just grow, and use less of the solar light spectrum than photovoltaic panels.\n All the components of the system exist, but Leger said they now need to be tested together and at scale, in particular the capturing of CO 2 from the air and ensuring that used solar panels can be recycled. “For human food, there’s also a lot of regulation that needs to be overcome,” he said.\n Pete Iannetta, at the James Hutton Institute in Scotland, said: ““It’s a really interesting concept – you are divorcing food production from land use, which would mean you could have all that land available for rewilding.”\n But he said food is not only composed of the main nutrients, like protein and carbohydrate: “There are an awful lot of secondary compounds that are important for your wellbeing.” Iannetta also questioned whether microbial foods would become mainstream: “For example, we have used algae for a long time as a potential food resource, but it’s still not widely accepted.”\n Dr Toby Mottram, a consultant on agricultural technology, said: “Until the model is tested and costed with a pilot-scale plant, including a lifecycle assessment of [solar panel] production, it is hard to comment on whether it improves on [farming] systems which have been sustained for thousands of years, albeit for a lower population than we are planning to feed.”", "posttime": "2021-06-23 01:07:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太阳能,food,微生物", "title": "微生物和太阳能能力比植物产生10倍的食物' ", "title_en": "Microbes and solar power ‘could produce 10 times more food than plants’", "transed": 1, "url": "https://www.theguardian.com/environment/2021/jun/21/microbes-and-solar-power-could-produce-10-times-more-food-than-plants", "via": "", "real_tags": ["太阳能", "food", "微生物"]}]