[{"category": "", "categoryclass": "", "imagename": "77af7efe49398f8600827aa64aedb189.jpg", "infoid": 1007414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一个工具可以检查源代码中的编程错误和其他错误，这对开发人员很有用。现在，微软旗下的GitHub发布了Super Linter，以帮助开发人员避免设置具有多个Linter的代码库的麻烦。\n新的Super Linter建立在GitHub的Actions工具上，用于自动化某些开发工作流程，旨在帮助开发人员为使用多种编程语言构建的项目做出贡献。\nGitHub将其描述为用bash编写的各种链接的简单组合，以帮助验证源代码，以防止将损坏的代码上载到主分支(树中的其他分支合并到的关键分支)。\n顺便说一句，鉴于“黑人生命也是命”(Black Lives Matter)抗议活动，GitHub决定去掉“主人”(相对于奴隶)一词，取而代之的是“主要的生命也是奴隶”，但它还没有这么做。\n超级链接操作允许开发人员使用流行的Python、JavaScript、Go、XML、YAML和更多编程语言的链接来检查他们的代码库。因此，GitHub工程师卢卡斯·格雷夫利(Lucas Gravley)将超级短绒描述为“一只短绒”，可以统治所有这些短绒。\nGravley说，GitHub Super Linter是由GitHub Services DevOps工程团队出于必要而建造的，目的是保持我们文档和代码的一致性，同时使整个公司的沟通和协作成为更有成效的体验。\n该操作还帮助开发人员构建代码布局和格式的指导原则，简化代码审查，并最终将更干净的代码交付给客户和合作伙伴。\n当您将存储库设置为开始运行此操作时，每当您打开拉入请求时，它都会开始编写代码案例并通过Status API返回。Gravley解释说，它将让您知道是否有任何代码更改成功通过，或者是否检测到任何错误、它们在哪里以及它们是什么。\nSuper Linter不会修复问题，但会标记它们，因此开发人员可以在到达主分支之前回去修复它们。\n尽管GitHub是一个代码托管网站，但微软在2018年斥资75亿美元收购的该公司，帮助自动化了基于Linux内核Linus Torvalds GIT系统的开源软件分发和部署过程。\n托瓦尔兹构建了git，以确保不同版本的软件在分布式贡献者之间发展时可以被跟踪。\nGitHub的其他自动化服务包括Dependabot，这是它用于自动修复软件依赖中的错误的工具。\n当检测到用几种流行语言(如PHP、JavaScript、Ruby、Python、Java和.NET)编写的代码中存在漏洞时，它还会向项目发送自动安全警报。", "note_en": "Having a tool that checks source code for programming blunders and other errors is useful for developers. Now Microsoft-owned GitHub has released the &#39;Super Linter&#39; to help developers avoid the hassles of setting up code repositories with multiple linters.\n The new Super Linter is built on  GitHub&#39;s Actions tool for automating certain development workflows and aims to help developers contributing to projects built with multiple programming languages.\n    GitHub  describes it as a &#34;simple combination of various linters, written in bash, to help validate your source code&#34; for the purpose of preventing broken code from being uploaded to a &#39;master&#39; branch, the key branch that other branches in a tree are merged to.\n Incidentally, GitHub has decided to  drop the term &#39;master&#39; (versus slave) and replace it with &#39;main&#39; in light of the Black Lives Matter protests, but it hasn&#39;t done so yet.\n The Super Linter Action lets developers &#39;lint&#39; or check their code base using popular linters for Python, JavaScript, Go, XML, YAML, and more programming languages. As such, GitHub engineer Lucas Gravley describes the Super Linter as the &#34;one linter to rule them all&#34;.\n   &#34;The GitHub Super Linter was built out of necessity by the GitHub Services DevOps Engineering team to maintain consistency in our documentation and code while making communication and collaboration across the company a more productive experience,&#34;  says Gravley.\n The Action also helps developers build guidelines for code layout and format, streamline code reviews, and ultimately ship cleaner code to customers and partners.\n   &#34;When you&#39;ve set your repository to start running this action, any time you open a pull request, it will start linting the code case and return via the Status API. It will let you know if any of your code changes passed successfully, or if any errors were detected, where they are, and what they are,&#34; explains Gravley.\n The Super Linter doesn&#39;t fix problems but does flag them, so developers can then go back and fix them before they reach the master branch.\n While GitHub is a site to host code, the company, which  Microsoft bought for $7.5bn in 2018, has helped automate the process of distributing and deploying open-source software, based on Linus Torvalds&#39; git system for the Linux kernel.\n Torvalds built git to ensure different versions of software can be tracked as it evolves between distributed contributors.\n Other GitHub automation services include Dependabot, its tool for  automatically fixing bugs in software dependencies.\n It also delivers  automatic security alerts to projects when it detects vulnerabilities in code written in several popular languages, such as PHP, JavaScript, Ruby, Python, Java and .NET.", "posttime": "2020-06-20 23:48:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "github,开源,微软,开发,microsoft", "title": "微软的GitHub为开源开发者提供“一个Linter来统治所有人”", "title_en": "Microsoft's GitHub Offers Open-Source Developers 'One Linter to Rule Them All'", "transed": 1, "url": "https://www.zdnet.com/article/microsofts-github-now-open-source-developers-get-one-linter-to-rule-them-all/", "via": "", "real_tags": ["github", "开源", "微软", "开发", "microsoft"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Raspberry Pi 1至Raspberry Pi 3 Model B+，甚至Raspberry Pi Zero现在都可以通过一个新的非官方RPI-VK-Driver获得Vulkan支持，该驱动程序提供了比Broadcom OpenGL驱动程序更好的性能。虽然已经有用于Raspberry PI 4和使用更新的Broadcom VideoCore GPU(正式支持Vulkan)的未来型号的Vulkan驱动程序正在开发中，但一家独立开发商一直在为RPi4SBCS之前的VideoCore IV GPU开发Vulkan驱动程序。VideoCore 4并不完全兼容Vulkan，但是经过足够的努力，一个Vulkan驱动程序被带了出来。这个新的RPI-VK驱动程序是由马丁·托马斯(Martin Thomas)在过去两年里开发的，他是一名图形工程师，目前在NVIDIA工作，他在业余时间开发了这个驱动程序。据报道，这位非官方的Vulkan车手花了大约两年的时间才为周五发布的Vulkan车手塑形。VkQuake3在@Raspberry_PI 3B+上以100+FPS运行，使用新的低级RPI-VK-Driver pic.twitter.com/UhhYgQrAEi。\n-马丁·托马斯(@0martint)2020年6月19日。\n这个VideoCore IV的非官方Vulkan驱动程序实现了API的一个子集和遇到的各种硬件限制，但足以让vkQuake3之类的程序在驱动程序上以良好的速度运行。与VC4 OpenGL驱动程序相比，性能相当不错，这要归功于更好的内存管理、多线程命令提交和其他改进。通过此GitHub存储库了解更多有关适用于较旧主板的Raspberry Pi Vulkan驱动程序的详细信息。", "note_en": "The Raspberry Pi 1 through Raspberry Pi 3 Model B+ and even the Raspberry Pi Zero can now see Vulkan support via a new unofficial &#34;RPi-VK-Driver&#34; that is offering even better performance than the Broadcom OpenGL driver.\r   While there has been  a Vulkan driver in development for the Raspberry Pi 4 and future models with the newer Broadcom VideoCore GPU that officially supports Vulkan, an independent developer has been developing a Vulkan driver for the VideoCore IV GPU found in pre-RPi4 SBCs. VideoCore 4 isn&#39;t compliant with Vulkan in full, but with enough effort, a Vulkan driver was brought up.\r     This new RPi-VK-Driver was developed over the past two years by Martin Thomas, a graphics engineer currently working for NVIDIA who developed this driver in his spare time. It reportedly took about two years to get this unofficial Vulkan driver into shape for Friday&#39;s &#34;1.0&#34; release.\r  VkQuake3 running at 100+ FPS on a  @Raspberry_Pi 3B+ using the new low level RPi-VK-Driver  pic.twitter.com/UhhYgQrAEi\n— Martin Thomas (@0martint)  June 19, 2020\n   This unofficial Vulkan driver for VideoCore IV implements a subset of the API and various hardware limitations encountered but enough that the likes of vkQuake3 can run on the driver with good speed. Performance compared to the VC4 OpenGL driver is quite good thanks to better memory management, multi-threaded command submission, and other improvements.\r   More details on this Raspberry Pi Vulkan driver for older boards via  this GitHub repository.", "posttime": "2020-06-20 23:46:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,程序,nvidia,pi,engineer", "title": "NVIDIA的一名工程师编写了一个Vulkan驱动程序，可以在较老的覆盆子PI上运行", "title_en": "A Nvidia Engineer Wrote a Vulkan Driver That Works on Older Raspberry Pi", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=RPi-VK-Driver", "via": "", "real_tags": ["程序", "nvidia", "pi", "engineer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索Tadeusz Kościuszko(1746年-1817年)，波兰-立陶宛联邦和美国革命史上的一位杰出人物，他立了几个遗嘱，特别是1798年的一个，规定他在美国遗产的收益用于解放和教育非裔美国奴隶，包括他的朋友托马斯·杰斐逊(Thomas Jefferson)的奴隶，他指定他为遗嘱的执行人。杰斐逊拒绝执行遗嘱，遗嘱受到法律复杂性的困扰，包括后来遗嘱的发现。杰斐逊的拒绝在19世纪、20世纪和21世纪引发了讨论。Kościuszko于1798年回到欧洲，并一直住在那里，直到1817年在瑞士去世。19世纪50年代，Kościuszko在美国信托基金中剩下的钱被美国最高法院移交给了他在欧洲的继承人。\n1798年，kościuszko决定离开美国，回到俄国控制的波兰地区。他的朋友托马斯·杰斐逊(Thomas Jefferson)用假名给他提供了护照，并安排他秘密前往法国。[1][2]在离开同年(1798年)之前，他写了一份遗嘱，委托杰斐逊作为遗嘱执行人。在这份文件中，Kościuszko，在美国内战前60多年，请求解放美国的黑人奴隶。[1]。\nKościuszko离开了他的美国庄园，购买了黑奴的自由，包括杰斐逊自己的自由，并教育他们独立生活和工作。[2]1817年9月，在他10月去世前不久，他给杰斐逊写了一封信，提到了这笔遗产……其中的钱，在我死后，你知道固定的目的地。在Kościuszko去世几年后，77岁的杰斐逊辩称，由于年龄[4]和这笔遗产的众多法律复杂性，他无法执行遗嘱。[3][3]在Ko Cocuszko去世几年后，77岁的杰斐逊辩称，由于年龄[4]和这笔遗产的众多法律复杂性，他无法执行遗嘱。[5]杰斐逊推荐他的朋友约翰·哈特威尔·科克(John Hartwell Cocke)担任遗嘱执行人，他也反对奴隶制，但科克也拒绝执行这笔遗产。[4]他写信给杰斐逊说，在他们的教育中会遇到偏见，这种偏见可能会对我国人民产生影响。[4][4]联邦法院指定本杰明·L·李尔律师为遗产执行人。[4][4][4][4]联邦法院指定本杰明·L·李尔(Benjamin L.Lear)律师作为遗产执行人。李尔于1832年去世，案件仍未解决，因此他的遗嘱执行人乔治·邦福德上校也成为了Kościuszko遗产的遗嘱执行人。[6]。\nKościuszko总共立了四份遗嘱，其中三份在美国的遗嘱之后立下。[7]在他于1817年10月去世后的几个月内，另有两个人对他在美国的遗产提出了索赔；一个是科斯丘斯科·阿姆斯特朗，另一个是泽尔特纳家族，他们在他去世前就安置了他。双方都出示了由kościuszko撰写的遗嘱。[3]俄罗斯政府的一名代表也进行了询问。[3]Kościuszko的美国遗产案三次提交给美国最高法院。[注1]1852年，最高法院将遗产判给了Kościuszko在波兰的继承人。[9]在最高法院做出最终裁决之前，代表科斯丘斯科亲属行事的加斯帕德·托奇曼(Gaspard Tochman)在巴黎找到了一份1816年起草的遗嘱。这份遗嘱撤销了与杰斐逊联手立下的遗嘱和与科斯丘斯科·阿姆斯特朗有关的遗嘱，并已通过认证。根据这一发现，法院裁定，早先处理他在美国资产的遗嘱是无效的，这些资产应该移交给他在世的最近亲属。[3]。\n在他去世和最高法院判决之间的法律诉讼期间，他的遗产价值大幅下降；一名案件律师将此归因于邦福德上校将遗产用于自己的目的。[10]在1852年的裁决中，最高法院指出，他1847年6月在美国的遗产价值为43,504.40美元，但只能找到5,680美元。[3]。\nkościuszko为非洲裔美国人的工作和教育指定的资源都没有用于这一目的。[10]。\n废奴主义者威廉·劳埃德·加里森(William Lloyd Garrison)后来批评了杰斐逊的不作为，就像杰斐逊自20世纪末以来的历史学家一样，包括梅里尔·彼得森(Merrill Peterson)、加里·纳什(Gary Nash)和埃德蒙·S·摩根(Edmund S.Morgan)。[11]彼得森在他的杰斐逊传记中写道，\n[Kosciuszko]遗嘱的遗物丢失了。如果杰斐逊对这个目标感觉更坚定，他就会不顾法定的障碍和短暂的时间，冒险进行这个实验，因为[解放他的奴隶]实验是他经常向其他人推荐的，实际上，他自己也可能向科斯丘兹科建议过这个实验。[9]\n这个主题在21世纪初重新被讨论过。历史学家亨利·维切克强烈批评杰斐逊拒绝执行遗嘱。[12]历史学家安妮特·戈登·里德(Annette Gordon-Reed)反驳说，科斯丘斯科搞砸了，遗嘱是一场等待发生的诉讼灾难，因为杰斐逊知道了后来还有遗嘱，而且杰斐逊冒着财务风险。在2009年的杰斐逊传记中，克里斯托弗·希钦斯写道，他……冷酷地拒绝实现他朋友的遗愿。\n？助理大法官约瑟夫·斯托里在“阿姆斯特朗诉李尔案”[“美国最高法院判例汇编”第25卷，第12页，小麦案)中发布了一项还押决定。169(1827年)，基于未能提交遗嘱进行遗嘱认证。同样的遗产也是“埃斯托诉李尔案”[“美国最高法院判例汇编”第32卷，第130页(宠物7)]一案的主题。130，8 L.Ed。632)(1832年)，首席大法官约翰·马歇尔在其中写了一份简短的意见，建议还押，显然是还押给弗吉尼亚州。最后，在“埃尼斯诉史密斯”案[“美国最高法院判例汇编”第55卷，第14页)中的裁决。400 400(1852)没有提到个人作者；当时的首席大法官是罗杰·塔尼(Roger Taney)，唯一提到的司法管辖区是马里兰州、哥伦比亚特区和格罗德诺(现在在白俄罗斯)。[8]。\n？a b c d e Ottenberg，路易斯市(1958年1月)。遗嘱悲剧：杰斐逊和科斯丘兹科将军的遗嘱。美国律师协会期刊：22-26。ISSN电话：0747-0088。\n^Storozynski，Alex(2009)。农民王子：撒迪厄斯·科斯丘兹科与革命时代。纽约：托马斯·邓恩图书出版社，圣马丁出版社。第282-284页。ISBN978-0-312-38802-7。\n加里·B·纳什和格雷厄姆·罗素·高·霍奇斯(2008)。为什么我们都应该后悔杰斐逊违背了对Kościuszko的承诺。自由之友。历史新闻网。\n“杰斐逊与背叛”，埃德蒙·S·摩根(Edmund S.Morgan)著|“纽约书评”(The New York Review Of Books)。Nybooks.com。2008年06月26日。\n莫妮卡·玛丽·加德纳(1942)。KośCiuszko：传记。G.Allen&amp；Unwin，Ltd.。第136页。、Book()、Book()。\n加里·纳什；霍奇斯，格雷厄姆·罗素·高(2012)。自由之友：托马斯·杰斐逊、Tadeusz Kosciuszko和Agrippa Hull。纽约，纽约州：基础图书。第328页。ISBN978-0-465-03148-1。\n亚历克斯·斯托罗辛斯基(2009)。“农民王子：撒迪厄斯·科斯丘兹科与革命时代”。圣马丁出版社，纽约。第352页。ISBN电话：978-1-4299-6607-8。\n西德尼·苏尔金；伊迪丝·苏尔金(1944)。波兰的民主遗产，“为了你们的自由和我们的自由”：选集。波兰：Allen&amp；Unwin。\n亚纳诺普洛斯，阿萨纳西奥斯·N(1958-05-31)。美国冲突法中的动产遗嘱：对住所规则的批判。加州法律评论。\n阿姆斯特朗诉约翰逊等人案。由Kosciusko Armstrong对Thadeus Kosciusko的行政长官De Bonis non和Thadeus Kosciusko的继承人Lewis Johnson提起诉讼。哥伦比亚特区孤儿法庭。[1]。\n美国最高法院报告，1852年第14卷。约翰·F·恩尼斯等人。V.J.H.B.史密斯和其他人。科斯丘斯科将军的遗嘱-……398-432页。[2]", "note_en": "Jump to navigation  Jump to search  Tadeusz Kościuszko (1746–1817), a prominent figure in the history of the  Polish-Lithuanian Commonwealth and the  American Revolution, made several wills, notably one in 1798 stipulating that the proceeds of his American estate be spent on freeing and educating African-American slaves, including those of his friend  Thomas Jefferson, whom he named as the will&#39;s  executor. Jefferson refused the executorship and the will was beset by legal complications, including the discovery of later wills. Jefferson&#39;s refusal incited discussion in the 19th, 20th, and 21st centuries. Kościuszko returned to Europe in 1798 and lived there until his 1817 death in Switzerland. In the 1850s, what was left of the money in Kościuszko&#39;s U.S. trust was turned over by the U.S. Supreme Court to his heirs in Europe.\n   In 1798 Kościuszko decided to leave the  United States and return to the Russian-controlled sector of  Poland. His friend  Thomas Jefferson provided him with a passport in a false name and arranged for his secret departure to France.  [1]  [2] Before leaving that same year (1798) he wrote out a will, which he entrusted to Jefferson as executor. In the document, Kościuszko, over six decades before the  American Civil War, pleaded for the emancipation of America&#39;s Negro  slaves.  [1]\n Kościuszko left his American estate to buy the freedom of black  slaves, including Jefferson&#39;s own, and to educate them for independent life and work.  [2] In September 1817, shortly before his death in October, he wrote a letter to Jefferson mentioning the bequest - &#34;...of which money, after my death, you know the fixed destination.&#34;  [3] Several years after Kościuszko&#39;s death, Jefferson, aged 77, pleaded his inability to execute the will due to age  [4] and the numerous legal complexities of the bequest.  [5] Jefferson recommended his friend  John Hartwell Cocke, who also opposed slavery, to be executor, but Cocke also declined to execute the bequest.  [4] He wrote to Jefferson that there were &#34;prejudices to be encountered&#34; in their education and of &#34;an effect which might be produced on the minds of my own people.&#34;  [4] The federal court appointed an attorney, Benjamin L. Lear, to be executor of the estate. Lear died in 1832, the case still unresolved, and so his executor, Colonel  George Bomford, became the executor as well of the Kościuszko estate.  [6]\n Kościuszko had made a total of four wills, three of which postdated the American one.  [7] Within months after his death in October 1817, two other claims were made on his American estate; one by  Kosciusko Armstrong and one by the Zeltner family, who had housed him immediately before his death. Both parties produced wills written by Kościuszko.  [3] A representative of the Russian government also made inquiries.  [3] The case of Kościuszko&#39;s American estate went three times to the  U.S. Supreme Court.  [note 1] In 1852 the Supreme Court awarded the estate to Kościuszko&#39;s heirs in Poland.  [9] Before the final Supreme Court decision, Gaspard Tochman, acting on behalf of Kosciusko&#39;s relatives, had found an 1816 will drawn up in Paris. This will, which revoked the one made in concert with Jefferson and the one concerning Kosciusko Armstrong, was authenticated. In light of the discovery, the Court ruled that the earlier wills treating his American assets were invalid and that these assets should be turned over to his closest living relatives.  [3]\n During the legal proceedings between his death and the Supreme Court&#39;s decision, the value of his estate decreased substantially; this was attributed by a case attorney to Colonel Bomford&#39;s use of the estate for his own purposes.  [10] In its 1852 ruling, the Supreme Court stated that the June 1847 value of his US estate was $43,504.40 and that only $5,680 could be found.  [3]\n None of the resources that Kościuszko had earmarked for the  manumission and education of  African-Americans were ever used for that purpose.  [10]\n  The abolitionist  William Lloyd Garrison later criticized Jefferson&#39;s inaction, as have Jefferson historians since the late 20th century, including  Merrill Peterson,  Gary Nash and  Edmund S. Morgan.  [11] In his biography of Jefferson,  Peterson wrote,\n The object of [Kosciuszko&#39;s] will was lost. Had Jefferson felt stronger about the object, he would have ventured the experiment, despite statutory obstacles and the shortness of years, for the experiment [of freeing his slaves] was one he often commended to others and, indeed, one he may have himself suggested to Kosciuszko.  [9]\n The subject was revisited in the early 21st century. Historian  Henry Wiencek strongly criticized Jefferson&#39;s refusal of the executorship.  [12] Historian  Annette Gordon-Reed countered that &#34;Kosciusko screwed up,&#34; that the will was &#34;a litigation disaster waiting to happen&#34;, since Jefferson had learned there were later wills, and that Jefferson risked financial exposure. In a 2009 biography of Jefferson,  Christopher Hitchens wrote that he &#34;...coldly declined to execute his friend&#39;s dying wish.&#34;  [13]\n  ^  Associate Justice  Joseph Story issued a decision to remand in  Armstrong v. Lear, 25 U.S. 12 Wheat. 169 169 (1827), based on failure to submit the will for probate. The same estate was also the subject of  Estho v Lear, 32 U.S. 130 (7 Pet. 130, 8 L.Ed. 632)(1832), in which Chief Justice  John Marshall wrote a brief opinion suggesting remand, apparently to Virginia. Finally, the decision in  Ennis v. Smith, 55 U.S. 14 How. 400 400 (1852) mentions no individual author; the chief justice was then  Roger Taney, and the only jurisdictions mentioned were those of  Maryland, the  District of Columbia, and  Grodno (now in  Belarus).  [8]\n  ^     a     b     c     d     e   Ottenberg, Louis (Jan 1958).  &#34;A Testamentary Tragedy: Jefferson and the Wills of General Kosciuszko&#34;.  American Bar Association Journal: 22–26.  ISSN  0747-0088.\n   ^   Storozynski, Alex (2009).    The Peasant Prince: Thaddeus Kosciuszko and the age of revolution. New York: Thomas Dunne Books, St. Martin&#39;s Press. pp.  282–284.  ISBN   978-0-312-38802-7.\n   ^     a     b   Gary B. Nash and Graham Russell Gao Hodges (2008).  &#34;Why We Should All Regret Jefferson&#39;s Broken Promise to Kościuszko&#34;.  Friends of Liberty.  History News Network .\n  ^    &#34;Jefferson &amp; Betrayal by Edmund S. Morgan | The New York Review of Books&#34;. Nybooks.com. 2008-06-26 .\n  Gardner, Monica Mary (1942).  Kościuszko: A Biography. G. Allen &amp; Unwin., ltd. p. 136.  ,  Book ( ),  Book ( )\n Nash, Gary; Hodges, Graham Russell Gao (2012).   Friends of Liberty: Thomas Jefferson, Tadeusz Kosciuszko, and Agrippa Hull. New York, NY: Basic Books. p. 328.  ISBN   978-0-465-03148-1.\n Storozynski, Alex (2009).   The Peasant Prince: Thaddeus Kosciuszko and the Age of Revolution. St. Martin&#39;s Press, New York. p. 352.  ISBN   978-1-4299-6607-8.\n Sulkin, Sidney; Sulkin, Edith (1944).   The Democratic Heritage of Poland, &#34;For Your Freedom and Ours&#34;: An Anthology. Poland: Allen &amp; Unwin.\n Yiannopoulos, Athanassios N. (1958-05-31).  &#34;Wills of Movables in American Conflicts Law: A Critique of the Domiciliary Rule&#34;.  California Law Review .\n  Armstrong v. Johnson et al. Proceeding by Kosciusko Armstrong against Lewis Johnson, administrator de bonis non of Thadeus Kosciusko, and others, heirs of Thadeus Kosciusko. Orphan&#39;s Court, District of Columbia.  [1].\n United States Supreme Court Reports, Volume 14, 1852. John F. Ennis et al. v. J.H.B. Smith and others. &#34;General Kosciusko&#39;s wills -...&#34; Pages 398-432.  [2]", "posttime": "2020-06-20 23:26:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ko,tadeusz,遗嘱", "title": "Tadeusz KośCiuszko的遗嘱", "title_en": "Wills of Tadeusz Kościuszko", "transed": 1, "url": "https://en.wikipedia.org/wiki/Wills_of_Tadeusz_Ko%C5%9Bciuszko", "via": "", "real_tags": ["ko", "tadeusz", "遗嘱"]}, {"category": "", "categoryclass": "", "imagename": "9c56b3f7412e78230db0d40d337f268b.jpg", "infoid": 1007411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他站着只有四英尺高，他的身体被背部的隆起和弯曲的步态扭曲了，他发育迟缓的躯干给人一种头、手和脚太大的错觉。但他是科学思想家中的巨人，将阿尔伯特·爱因斯坦(Albert Einstein)、尼古拉·特斯拉(Nikola Tesla)和托马斯·爱迪生(Thomas Edison)视为朋友，他对数学和电气工程的贡献使他成为那个时代最受欢迎、最容易认出的人之一。\n20世纪初，可以看到查尔斯·施泰因梅茨(Charles Steinmetz)穿着西装，戴着大礼帽，在纽约斯克内克塔迪(Schenectady)的街道上兜售他的自行车，或者坐着独木舟沿着莫霍克河漂流，跪在临时桌面上，在纸上草草写下笔记和方程式，有时会被吹到水里。斯坦梅茨嘴唇上似乎粘着一支黑石帕纳特拉雪茄，当孩子们一看到他就退缩了-他相信，被这个带有德国口音的“古怪的、侏儒般的人物”吓坏了。这样的经历对施泰因梅茨来说更加痛苦，因为他一生中最渴望的是家庭和孩子。但斯坦梅茨知道他的畸形是先天性的(他的父亲和祖父都患有脊柱后凸，一种上脊椎的异常弯曲)，他选择了不结婚，担心把他的畸形遗传给后代。\n卡尔·奥古斯特·鲁道夫·施泰因梅茨1865年出生于德国布雷斯劳(现波兰弗罗茨瓦夫)，成为布雷斯劳大学数学和化学专业的一名优秀学生，但在当局对他参与社会党产生兴趣后，他被迫逃离这个国家。他于1888年抵达埃利斯岛，几乎被拒之门外，因为他是一个侏儒，但与施泰因梅茨同行的一位美国朋友让移民官员相信，这位年轻的德国博士是一个天才，他的存在有朝一日会让整个美国受益。再过几年，施泰因梅茨就会证明他的美国朋友是对的。\n到达后不久，他去了纽约扬克斯的Eickemeyer和Osterhold公司工作，他通过一个数学方程式(后来被称为迟滞定律或斯坦梅茨定律)识别并解释了支配电力损失的现象，导致交流和直流电力系统都取得了突破。美国正进入电气工程的黄金时代，当托马斯·爱迪生和通用电气得知施泰因梅茨在扬克斯用电动马达做什么时，该公司于1892年收购了埃克迈耶和奥斯特霍尔德公司，获得了施泰因梅茨的所有专利和服务。\n施泰因梅茨把自己的名字美国化为查尔斯·施泰因梅茨。他选择Proteus作为他的中间名-德国的教授们亲切地给他起了这个绰号，以表彰这位变形的海神。在希腊神话中，普罗提厄斯是一个居住在洞穴里的先知老人，他总是回到他的人形--驼背。施泰因梅茨非常喜欢这种比较。\n1894年，他来到了斯克内克塔迪，在接下来的30年里，他一直把这里称为家，他对通用电气的影响是立竿见影的。施泰因梅茨利用复杂的数学方程，发展了分析交流电路中数值的方法。他的发现改变了工程师们对电路和机器的看法，并使他成为几十年来电学领域最知名的名字。\n不久，当时最伟大的科学头脑前往斯克内克塔迪与这位多产的“小巨人”会面；这些会面的轶事至今仍在工程学课堂上流传。1965年，在“生活”杂志发表了一篇关于施泰因梅茨的报道后，其中一篇出现在“生活”杂志的信件页上。杰克·B·斯科特写信讲述了他的父亲在密歇根州迪尔伯恩的亨利·福特的鲁日河工厂与斯克内克塔迪巫师的遭遇。\n福特的电气工程师无法解决他们在巨型发电机上遇到的一些问题，他把斯泰因梅茨叫到了工厂。一到，斯坦梅茨就拒绝了所有的帮助，只要了一本笔记本，一支铅笔和一张婴儿床。根据斯科特的说法，斯坦梅茨听着发电机的声音，连续两天两夜在记事本上草草写下计算结果。第二天晚上，他要了一架梯子，爬上发电机，在发电机一侧画了一个粉笔记号。然后，他告诉福特持怀疑态度的工程师去掉标记处的一块板，并更换磁场线圈上的16个绕组。他们做到了，发电机发挥到了极致。\n亨利·福特非常激动，直到他从通用电气公司拿到了一张金额为10,000美元的发票。福特承认施泰因梅茨的成功，但对这个数字犹豫不决。他要了一份详细的账单。\n尽管他在职业上取得了成功，但斯坦梅茨的生活中存在着空虚，他采取了一种策略来纠正这种空虚，这有助于确保他作为“波西米亚科学家”的声誉。他在Schenectady的头几年是在通用电气工程师的“单身汉圈子”里度过的，徒步旅行、划独木舟和尝试摄影。斯坦梅茨与其中一名实验室助理成为亲密朋友，他是一位名叫约瑟夫·勒罗伊·海登(Joseph LeRoy Hayden)的年轻瘦小的金发男子，当时他们开发了第一盏磁弧灯，后来被用来照亮街角。海登开始为施泰因梅茨做饭，很快就在老板的实验室里放了一张婴儿床，这样他就可以在马拉松式的工作时间里打盹了。当海登宣布他打算结婚并在附近找一套公寓时，施泰因梅茨有了一个想法。\n到20世纪初，施泰因梅茨已经开始在温德尔大道(Wendell Avenue)上建造一座大房子，这座房子位于通用电气高管居住的地区。作为一名珍稀植物收藏家，他让人设计了一个温室和一个实验室，他计划在那里尽可能多地工作，以避免进入办公室。豪宅建成后，施泰因梅茨在温室里种满了兰花、蕨类植物和仙人掌(他喜欢它们奇怪的形状)，并专注于他一直想要的动物动物群。就像一个淘气的男孩一样，他对任何致命的东西都很着迷，他收集了鳄鱼、响尾蛇和黑寡妇蜘蛛。发明家古列尔莫·马可尼(Guglielmo Marconi)曾向斯坦梅茨问及他的吉拉怪物。“他死了，”斯坦梅茨回答说。“他太懒了，吃不下东西。”\n很快，施泰因梅茨每天晚上都会在家中与海登和他的妻子科琳(Corine)共进晚餐。科琳是一位胖乎乎、圆脸的法裔加拿大人。房子对斯坦梅茨来说太大了，海登夫妇怀疑可能会发生什么。最后，斯坦梅茨转向科琳。\n约瑟夫·海登(Joseph Hayden)对此表示完全支持。这将使他们长时间的工作变得更加方便，而且房子提供了他和科林自己永远负担不起的空间。海登开始珍视施泰因梅茨的怪癖，他明白这位波西米亚科学家真的渴望有一个属于他自己的家庭。科琳很不情愿，但施泰因梅茨轻轻地把她累垮了。\n“如果我们搬去和你一起住，”她最后告诉他，“我必须按照我认为合适的方式来管理房子。”\n“当然可以，亲爱的，”斯坦梅茨回答，强忍着笑容。科琳·海登随后概述了他们同居的条件-施泰因梅茨只愿意支付他那部分支出。无论他和她丈夫的工作有多重要，她都会按固定的时间表准备和供应饭菜。男士们只需放下所有东西，坐到桌子旁就可以了。施泰因梅茨同意科林的所有条件。\n这种生活安排，尽管开始时有些尴尬，但很快就蓬勃发展起来，特别是在海登夫妇开始生孩子-乔、米奇和比利-以及斯坦梅茨合法收养约瑟夫·海登作为他的儿子之后。海登的孩子们有一位祖父，“爸爸”施泰因梅茨，他确保他们在一个充满奇迹的家庭中长大。生日聚会包括液体和气体在本生燃烧器中爆炸，这些气体散落在房子周围装饰性的地方。施泰因梅茨的身高并不比在他的实验室和温室里跑来跑去的孩子们高多少，他给他们讲了龙和小妖精的故事，并用他从水桶里各种钠和氢的混合物中召唤出的烟花来说明这些故事。\n1922年，托马斯·爱迪生来拜访斯坦梅茨。到那时，爱迪生几乎已经聋了，斯坦梅茨用摩尔斯电码在爱迪生的膝盖上敲出了一条信息。爱迪生笑容满面，两人在茫然不知所措的记者面前继续沉默的交谈。\n斯坦梅茨的名气只是在他和海登一家住在温德尔大道上的那几年里才增长的。当一位社会党市长上任时，施泰因梅茨担任斯克内克塔迪教育委员会主席，并在实施更长的上课时间、学校膳食、学校护士、移民子女特别班和分发免费教科书方面发挥了重要作用。\n1921年的一个星期五下午，施泰因梅茨跳上他的电动车，前往莫霍克营地度周末，他在那里建了一座小房子，俯瞰着维埃勒河。当他到达时，他发现闪电损坏了大楼，打碎了一面巨大的银色玻璃镜。他整个周末都在煞费苦心地重建镜子，把碎片放在两块玻璃之间。一旦组装完毕，他就研究了图案，并确信破碎的镜子揭示了闪电放电的路径。回到通用电气，他带来了一台巨大的仪器，然后又带来了另一台。在晚上的几个奇怪的时间里，有雷鸣般的撞车声。这座城市充斥着各种猜测。斯克内克塔迪的巫师到底在28号楼做什么？\n1922年3月，记者应邀来到通用电气，聚集在施泰因梅茨建造的一个模范村庄前。在爱迪生亲眼目睹的喧闹和爆炸性的示威中，斯坦梅茨揭开了一台12万伏闪电发生器的面纱。以表演者的姿态，他拨动开关，制造出闪电，将大块木头劈成碎片，摧毁了一座白色小教堂的尖顶，并劈开了一棵微型树木。记者们惊叹不已。第二天，“纽约时报”的一个标题宣称，“摩登魔王随意投掷灯光。”施泰因梅茨的工作导致了用来保护电力设备免受雷击的措施。\n但据斯坦梅茨的传记作者乔纳森·诺顿·伦纳德(Jonathan Norton Leonard)说，在斯坦梅茨生命的末期，“他的科学工作已经变得很像一个男孩在玩机器。”那时，斯坦梅茨因其在该领域的贡献而赢得了电气工程师的尊重，但在他成名的巅峰时期，斯坦梅茨只是情不自禁地对那种他在职业生涯早期会鄙视的伪科学感到高兴。普罗提厄斯是他一生中最快乐的人。\n1923年秋天，施泰因梅茨和他的家人乘火车向西旅行，停下来看了大峡谷、约塞米蒂和好莱坞的演员道格拉斯·费尔班克斯。这次旅行让这位58岁的科学家筋疲力尽，10月26日，回到温德尔大道的家中，他的孙子比利用托盘给他送来了早餐，却看到斯坦梅茨一动不动地躺在床上，身边放着一本物理书。医生说，在他睡觉的时候，他的心脏衰竭了。斯克内克塔迪的巫师不见了。\n书籍：约翰·温斯罗普·哈蒙德。查尔斯·普罗提厄斯·斯坦梅茨：传记。凯辛格出版社，2006。罗纳德·克莱恩。斯坦梅茨：工程师和社会主义者。约翰·霍普金斯大学出版社，1998年。弗洛伊德·米勒。驯服闪电的人：查尔斯·普罗特厄斯·斯坦梅茨(Charles Proteus Steinmetz)。麦格劳-希尔，1962年。乔纳森·诺顿·伦纳德。洛基：查尔斯·普罗提厄斯·施泰梅茨的一生。道布尔迪，1929年。贝蒂·M·阿德尔森。“侏儒的生活：他们从公众好奇心到社会解放的旅程”。罗格斯大学出版社，2005年。沃尔特·海因斯·佩奇，亚瑟·威尔逊·佩奇，“世界的工作：我们时代的历史”，第8卷。Doubleday，Page&amp；Co.，1904年出版。\n文章：“现代魔王随意投掷闪电。”“纽约时报”，1922年3月3日。“作为‘变形人’，他改变了自己的形状”，“生活”，1965年4月23日。“致编辑的信。”生活，1965年5月14日。“查尔斯·斯坦梅茨：联盟的电气巫师。”联合学院杂志，1998年11月1日。“发明家斯坦梅茨。”www.yonkershistory.org。", "note_en": "He stood just four feet tall, his body contorted by a hump in his back and a crooked gait, and his stunted torso gave the illusion that his head, hands and feet were too big. But he was a giant among scientific thinkers, counting  Albert Einstein,  Nikola Tesla and  Thomas Edison as friends, and his contributions to mathematics and electrical engineering made him one of the most beloved and instantly recognizable men of his time.\n    In the early 20th century, Charles Steinmetz could be seen  peddling pedaling his bicycle down the streets of Schenectady, New York, in a suit and top hat, or floating down the Mohawk River in a canoe, kneeling over a makeshift desktop, where he passed hours scribbling notes and equations on papers that sometimes blew into the water. With a Blackstone panatela cigar seemingly glued to his lips, Steinmetz cringed as children scurried away upon seeing him—frightened, he believed, by the “queer, gnome-like figure” with the German accent. Such occurrences were all the more painful for Steinmetz, as it was a family and children that he longed for most in his life. But knowing that his deformity was congenital (both his father and grandfather were afflicted with kyphosis, an abnormal curvature of the upper spine), Steinmetz chose not to marry, fearful of passing on his deformity.\n  Born in 1865 in Breslau, Germany (now Wroclaw, Poland), Carl August Rudolph Steinmetz became a brilliant student of mathematics and chemistry at the University of Breslau, but he was forced to flee the country after the authorities became interested in his involvement with the Socialist Party. He arrived at Ellis Island in 1888 and was nearly turned away because he was a dwarf, but an American friend whom Steinmetz was traveling with convinced immigration officials that the young German Ph.D. was a genius whose presence would someday benefit all of America. In just a few years, Steinmetz would prove his American friend right.\n  Soon after his arrival, he went to work for Eickemeyer and Osterheld, a company in Yonkers, New York, and he identified and explained, through a mathematical equation that later became known as the  Law of Hysterisis, or Steinmetz’s Law, phenomena governing power losses, leading to breakthroughs in both alternating- and direct-current electrical systems. America was entering a golden age of electrical engineering, and when Thomas Edison and  General Electric learned what Steinmetz was doing with electric motors in Yonkers, the company bought out Eickemeyer and Osterheld in 1892, acquiring all of Steinmetz’s patents as well as his services.\n  Steinmetz Americanized his name to Charles Steinmetz. He chose  Proteus as his middle name—the nickname his professors in Germany had affectionately bestowed upon him in recognition of the shape-shifting sea god. In Greek mythology, Proteus was a cave-dwelling prophetic old man who always returned to his human form—that of a hunchback. Steinmetz thoroughly enjoyed the comparison.\n  In 1894 he arrived in Schenectady, the place he would call home for the next thirty years, and his impact at General Electric was immediate. Using complex mathematical equations, Steinmetz developed ways to analyze values in alternating current circuits. His discoveries changed the way engineers thought about circuits and machines and made him the most recognized name in electricity for decades.\n  Before long, the greatest scientific minds of the time were traveling to Schenectady to meet with the prolific “little giant”; anecdotal tales of these meetings are still told in engineering classes today. One appeared on the letters page of  Life magazine in 1965, after the magazine had printed a story on Steinmetz. Jack B. Scott wrote in to tell of his father’s encounter with the Wizard of Schenectady at Henry Ford’s River Rouge plant in Dearborn, Michigan.\n    Ford, whose electrical engineers couldn’t solve some problems they were having with a gigantic generator, called Steinmetz in to the plant. Upon arriving, Steinmetz rejected all assistance and asked only for a notebook, pencil and cot. According to Scott, Steinmetz listened to the generator and scribbled computations on the notepad for two straight days and nights. On the second night, he asked for a ladder, climbed up the generator and made a chalk mark on its side. Then he told Ford’s skeptical engineers to remove a plate at the mark and replace sixteen windings from the field coil. They did, and the generator performed to perfection.\n  Henry Ford was thrilled until he got an invoice from General Electric in the amount of $10,000. Ford acknowledged Steinmetz’s success but balked at the figure. He asked for an itemized bill.\n          Despite his professional successes, there was emptiness in Steinmetz’s life, which he rectified with a maneuver that helped secure his reputation as the “Bohemian scientist.” He spent his first few years in Schenectady in a “bachelor circle” of GE engineers, hiking, canoeing and experimenting with photography. Steinmetz became close friends with one of lab assistants, a thin, young blond man named Joseph LeRoy Hayden, as they developed the first magnetic arc lamp, later used to light street corners. Hayden began to cook for Steinmetz, and soon had a cot placed in his boss’s laboratory so he could nap during their marathon working hours. When Hayden announced that he intended to marry and find an apartment nearby, Steinmetz had an idea.\n  By the turn of the twentieth century, Steinmetz had started construction on a large house on Wendell Avenue, in the area where GE executives lived. A collector of rare plants, he had it designed with a greenhouse, as well as a laboratory, where he planned to work as much as possible to avoid going into the office. Once the mansion was finished, Steinmetz filled the greenhouse with orchids, ferns and cacti (he delighted in their strange shapes) and focused on the menagerie of animals he had always wanted. Like a mischievous boy, he was fascinated with anything that was lethal, and he gathered alligators, rattlesnakes and black widow spiders. The inventor  Guglielmo Marconi once asked about Steinmetz about his Gila monster. “He’s dead,” Steinmetz replied. “He was too lazy to eat.”\n  Soon, Steinmetz was dining each night in his home with Hayden and his wife, Corrine, a stout, round-faced French-Canadian. The house was too large for Steinmetz, and the Haydens suspected what might be coming. Finally, Steinmetz turned to Corinne.\n    Joseph Hayden was all for it. It would make their long working hours more convenient, and the house offered space he and Corrine could never afford on their own. Hayden had come to cherish Steinmetz’s eccentricities, and he understood that the Bohemian scientist really yearned for a family of his own. Corrine was reluctant, but Steinmetz gently wore her down.\n  “If we move in with you,” she eventually told him, “I must run the house as I see fit.”\n  “Of course, my dear,” Steinmetz replied, stifling a huge grin. Corrine Hayden then outlined the terms of their cohabitation—Steinmetz would pay only for his share of expenditures. She would prepare and served meals on a regular schedule, no matter how important his and her husband’s work was. The men would simply have to drop everything and sit down to the table. Steinmetz agreed to all of Corrine’s terms.\n  The living arrangement, despite some awkward starts, soon flourished, especially after the Haydens began to have children—Joe, Midge and Billy—and Steinmetz legally adopted Joseph Hayden as his son. The Hayden children had a grandfather, “Daddy” Steinmetz, who ensured that they grew up in a household filled with wonder. Birthday parties included liquids and gasses exploding in Bunsen burners scattered decoratively around the house. Not much taller than the children who ran about his laboratory and greenhouse, Steinmetz entertained them with stories of dragons and goblins, which he illustrated with fireworks he summoned from various mixtures of sodium and hydrogen in pails of water.\n  In 1922, Thomas Edison came to visit Steinmetz. By then, Edison was nearly deaf, and Steinmetz tapped out a message on Edison’s knee in  Morse Code. Edison beamed, and the two continued their silent conversation in front of bewildered reporters.\n  Steinmetz’s fame only grew in the years he lived with the Haydens on Wendell Avenue. When a Socialist mayor took office, Steinmetz served as president of the Schenectady Board of Education and was instrumental in implementing longer school hours, school meals, school nurses, special classes for children of immigrants and the distribution of free textbooks.\n  One Friday afternoon in 1921, Steinmetz hopped in his electric car and headed off for a weekend at Camp Mohawk, where he’d built a small house overlooking Viele Creek. When he arrived he’d discovered that lightning had damaged the building and shattered a large silver glass mirror. He spent the entire weekend painstakingly reconstructing the mirror, placing the slivers between two panes of glass. Once assembled, he studied the pattern and was convinced that the shattered mirror revealed the lightning’s path of electrical discharge. Back at General Electric, he brought in a gigantic apparatus, then another. There were thunderous crashes at odd hours of the night. The city was abuzz with speculation. What exactly was the Wizard of Schenectady doing in Building 28?\n  In March of 1922, reporters were invited to General Electric and gathered before a model village that Steinmetz had constructed. In a noisy and explosive demonstration witnessed by Edison himself, Steinmetz unveiled a 120,000-volt lightning generator. With a showman’s flourish, he flipped a switch and produced lighting bolts that splintered large blocks of wood, decimated the steeple on a white chapel and split a miniature tree. Reporters were awestruck. The following day, a headline in the  New York Times proclaimed, “ Modern Jove Hurls Lighting at Will.” Steinmetz’s work led to the measures used to protect power equipment from lightning strikes.\n  But toward the end of Steinmetz’s life, according to his biographer, Jonathan Norton Leonard, “his scientific work had become rather like a boy’s playing with machinery.” He had by then earned the respect of electrical engineers for his contributions to the field, but Steinmetz, at the peak of his celebrity, simply could not help but delighting in the kind of pseudo-science he would have scorned earlier in his career. Proteus was as happy as he’d ever been in his life.\n  In the fall of 1923, Steinmetz and his family traveled west by train, stopping to see the Grand Canyon, Yosemite and the actor Douglas Fairbanks in Hollywood. The trip exhausted the 58-year-old scientist, and on October 26, back in his home on Wendell Avenue, his grandson Billy brought him breakfast on a tray, only to observe Steinmetz lying motionless on his bed, a physics book by his side. In his sleep, doctors said, his heart had failed. The Wizard of Schenectady was gone.\n      Books: John Winthrop Hammond.  Charles Proteus Steinmetz: A Biography. Kessinger Publishing, 2006. Ronald Kline.  Steinmetz: Engineer and Socialist. Johns Hopkins University Press, 1998. Floyd Miller.  The Man Who Tamed Lightning: Charles Proteus Steinmetz. McGraw-Hill, 1962. Jonathan Norton Leonard.  Loki: The Life of Charles Proteus Steimetz. Doubleday, 1929. Betty M. Adelson.  The Lives of Dwarves: Their Journey from Public Curiosity to Social Liberation. Rutgers University Press, 2005. Walter Hines Page, Arthur Wilson Page,  The World’s Work: A History of Our Time, Volume 8. Doubleday, Page &amp; Co., 1904.\n  Articles: “Modern Jove Hurls Lightning at Will.”  New York Times, March 3, 1922. “As ‘Proteus’ He Changed His Shape”  Life, April 23, 1965. “Letters to the Editors.”  Life, May 14, 1965. “Charles Steinmetz: Union’s electrical wizard.”  Union College Magazine, November 1, 1998. “Charles Proteus Steinmetz, Inventor.”  www.yonkershistory.org.", "posttime": "2020-06-20 23:13:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "proteus,施泰因", "title": "斯克内克塔迪的巫师查尔斯·普罗特厄斯·斯坦梅茨(Charles Proteus Steinmetz)", "title_en": "Charles Proteus Steinmetz, the Wizard of Schenectady", "transed": 1, "url": "https://www.smithsonianmag.com/history/charles-proteus-steinmetz-the-wizard-of-schenectady-51912022/", "via": "", "real_tags": ["proteus", "施泰因"]}, {"category": "", "categoryclass": "", "imagename": "bff56bcd253d6c61d95c4a50f0be41e6.jpg", "infoid": 1007410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年6月12日，他的父母在他的电脑上发现了这张纸条，问了一个简单的问题。“一个没有收入的20岁年轻人怎么能拿到价值近100万美元的杠杆呢？”这条悲剧性的信息是由20岁的内布拉斯加州大学学生亚历山大·E·卡恩斯(Alexander E.Kearns)写的，他从大学回家，与父母住在伊利诺伊州内珀维尔(Nperville)。当天早些时候，卡恩斯结束了自己的生命。\n自那以后，罗宾汉的创始人以自杀的方式回应了卡恩斯的去世，承诺对他们的平台进行重大改革-特别是在期权交易方面。\n和其他许多人一样，卡恩斯在大流行期间开始进行股票投资，与专注于千禧一代的经纪公司罗宾汉(Robinhood)签约，该公司提供免佣金交易，一款有趣且易于使用的移动应用程序，甚至向新客户提供免费的股票奖励。在2020年第一季度，罗宾汉在其平台上新增了创纪录的300万个账户。随着新冠肺炎股票市场的剧烈波动，卡恩斯已经开始试验，交易期权。他的最后一张纸条充满了对罗宾汉的愤怒，说他“不知道”自己在做什么。\n事实上，卡恩斯手机上的一张截图显示，虽然他的账户上用红色显示了负730,165美元的现金余额，但这可能根本不代表无担保债务，而是他的临时余额，直到他分配的期权的股票真正结算到他的账户中。\n总部位于硅谷的罗宾汉没有透露卡恩斯账户的细节，理由是隐私问题：“听到这个可怕的消息，我们罗宾汉所有人都深感悲痛，我们周末联系到了卡恩斯的家人，表达了我们的哀悼之情。”\n不可能知道导致自杀的所有因素，尤其是年轻人。尽管如此，亚历山大·卡恩斯(Alexander Kearns)的悲惨死亡是一个警示故事，表明经纪业务的逐底竞赛带来的严重风险。罗宾汉(Robinhood)、E-Trade、TD ameritrade、嘉信理财(Charles Schwab)、互动经纪公司(Interactive Brokers)、富达(Fidelity)甚至美林(Merrill Lynch)都接受了免佣金交易和零最低余额，以努力吸引年轻客户，他们中的许多人对自己涉足的证券和市场知之甚少。\n“我以为一切都很顺利，”比尔·布鲁斯特(Bill Brewster)说，他是卡恩斯的表妹，也是芝加哥苏利马资本集团(Sullimar Capital Group)的研究分析师。布鲁斯特告诉福布斯，他的父亲说他热爱市场，真的很享受投资，“然后在周五晚上，我们接到了他母亲的电话，他去世了。”\n卡恩斯周四深夜在看了他的罗宾汉账户后显然陷入了绝望，账户里似乎有1.6万美元，但现金余额也显示为负730,165美元。在福布斯看到的最后一份笔记中，卡恩斯坚称，他从未授权过保证金交易，并震惊地发现，他的小账户竟然会出现如此明显的亏损。\n布鲁斯特说：“当他看到73万美元这个数字是负的时候，他认为他已经毁了他的整个未来。”“我的意思是，这是一个在他小的时候非常注重储蓄的孩子。”\n尽管罗宾汉不愿透露他账户的细节，但卡恩斯有可能在交易所谓的“看跌期权价差”。看跌期权赋予买家在到期前随时以执行价出售股票的权利，而卖家则被套上了以执行价购买标的股票的钩子，如果被转让的话。如果标的股票当天的收盘价比执行价低一便士或更多，这在到期时就会自动发生。\n在卡恩斯的报告中，他表示，他买入和卖出的看跌期权“本应相互抵消”，因为通常看跌期权价差包括以更高的执行价卖出看跌期权，以更低的执行价买入看跌期权，两者都有相同的到期日。交易产生净信用，如果股票价格在到期期间保持在较高的执行价以上，期权交易员就会保留这一净信用。这通常被认为是一种有限的风险策略，因为同时买入和卖出看跌期权意味着每股最大的损失是执行价之间的差额，减去开始交易时卖出看跌期权时赚取的金额。\n然而，当标的股票到期时的价格在两个执行价之间，或者在提前转让的情况下，可能会出现皱纹，这可能发生在卡恩斯的账户上。\n这里有一个例子，说明看涨期权价差如何在你的投资组合中产生出人意料的大量股票头寸。6月16日，亚马逊(Amazon)的股价为每股2,615美元。如果你对亚马逊持中性或看涨态度，你可以卖出7月17日到期的看跌期权，执行价为2,615美元，每个期权28美元。为了限制你的风险，交易的另一步是以较低的执行价2,610美元购买看跌期权，成本为26美元。这两美元的差额(乘以100)为你卖出的每一份合同产生200美元。签三份合同，你就能赚600美元。如果亚马逊在7月17日收盘突破2,615美元，你就清白了，并保留了所有收益，因为这两个期权到期都一文不值。如果股票收盘低于2610美元，你将遭遇900美元的最大损失：5.00美元(执行价之间的差额)减去2.00美元(预先赚取的收益)乘以三份合约。\n当股票在两个执行价之间收盘时，你以较低的执行价买入的看跌期权到期时一文不值，但你卖出的看跌期权是有钱的，在法律上约束你以执行价购买股票。在亚马逊看跌期权为2,615美元的三份合同的情况下，购买300股将是784,500美元。比方说，在一个周末，你可能会看到-78.45万美元的借方来购买股票，但你要到周一才会在你持有的股票中看到这只股票。\n卡恩斯可能没有意识到，他在罗宾汉主屏幕上显示的负现金余额只是暂时的，一旦标的股票记入他的账户，就会得到纠正。事实上，现金和购买力在前半部分期权处理后、后半部分期权行使之前显示为负值的情况并不少见-即使投资组合仍为正值。\n“可悲的是，我甚至不认为他犯了那么大的错误。这是一个接口问题，他们有圆滑的接口。到处都是五彩纸屑，“布鲁斯特说，他指的是顾客进行交易后，罗宾汉通常会展开的五颜六色的五彩纸屑阵雨。“他们试图将交易玩弄于股掌之间，并将其伪装成投资。”\n罗宾汉说：“我们致力于不断改进我们的平台，并正在审查我们提供的选项，以确定是否有任何适当的改变。”\n如果您或您认识的人正在考虑自杀，请拨打美国国家预防自杀生命线电话800-273-Talk(8255)或发短信至危机文本热线741-741。", "note_en": "The note found on his computer by his parents on June 12, 2020, asked a simple question. “How was a 20 year old with no income able to get assigned almost a million dollars worth of leverage?” The tragic message was written by Alexander E. Kearns, a 20-year-old student at the University of Nebraska, home from college and living with his parents in Naperville, Illinois. Earlier that day, Kearns took his own life.\n  Robinhood’s founders have since   responded  to Kearns’ death by suicide, pledging major changes to their platform—especially around options trading.\n     Like so many others, Kearns took up stock investing during the pandemic, signing up with Millennial-focused brokerage firm Robinhood, which offers commission-free trading, a fun and easy-to-use mobile app and even awards new customers free shares of stock. During the first quarter of 2020, Robinhood added a record 3 million new accounts to its platform. As the Covid-19 stock market swung wildly, Kearns had begun experimenting, trading options. His final note, filled with anger toward Robinhood, says that he had “no clue” what he was doing.\n  In fact, a  screenshot from Kearns’ mobile phone reveals that while his account had a negative $730,165 cash balance displayed in red, it may not have represented uncollateralized indebtedness at all, but rather his temporary balance until the stocks underlying his assigned options actually settled into his account.\n    Silicon Valley-based Robinhood is not sharing details of Kearns’ account, citing privacy concerns: “All of us at Robinhood are deeply saddened to hear this terrible news and we reached out to share our condolences with the family over the weekend.”\n  It’s impossible to know all of the factors contributing to suicide, especially in young people. Still, the tragic demise of Alexander Kearns is a cautionary tale of the serious risks associated with the race to the bottom in the brokerage business. Robinhood, E-Trade, TD Ameritrade, Charles Schwab, Interactive Brokers, Fidelity and even Merrill Lynch have all embraced commission-free trading and zero-minimum balances in an effort to attract younger customers, many of whom have little understanding of the securities and markets they are dabbling in.\n  “I thought everything was going fine,” says Bill Brewster, Kearns’ cousin-in-law and a research analyst at Chicago-based Sullimar Capital Group. His father said he was loving the markets and really enjoying investing, Brewster told  Forbes, “and then on Friday night, we got this call from his mom, and he had died.”\n  Kearns apparently fell into despair late Thursday night after looking at his Robinhood account, which appeared to have $16,000 in it but also showed a cash balance of negative $730,165. In his final note, seen by  Forbes, Kearns insisted that he never authorized margin trading and was shocked to find his small account could rack up such an apparent loss.\n  “When he saw that $730,000 number as a negative, he thought that he had blown up his entire future,” says Brewster. “I mean this is a kid that when he was younger was so conscious about savings.”\n  Although Robinhood won’t release the details of his account, it‘s possible that Kearns was trading what’s known as a “bull put spread.” Put options give buyers the right to sell the stock at the strike price anytime until expiration, while put-sellers are on the hook to buy the underlying stock at the strike price, if assigned. This happens automatically at expiration if the price of the underlying stock closes that day at a price one penny or more below the strike price.\n  In Kearns’ note, he says that the puts he bought and sold “should have cancelled out,” because normally a bull put spread involves selling put options at a higher strike price, and buying puts at a lower strike price, both with the same expiration. The trade generates a net credit, which the options trader keeps if the stock price stays above the higher strike price through expiration. It’s generally considered a limited risk strategy because the simultaneous purchase and sale of put options means the maximum loss on a per-share basis is the difference between the strike prices, less the amount earned when the puts are sold initiating the trade.\n  There can be wrinkles, however, when the price of the underlying stock at expiration is between the two strike prices, or in the case of early assignment, which may have occurred in Kearns’ account.\n  Here’s an example of how a bull put spread could produce an unexpectedly large stock position in your portfolio. On June 16, Amazon (AMZN) trades at $2,615 per share. If you’re neutral to bullish on Amazon, you could sell put options that expire on July 17 with a $2,615 strike price for $28 per option. To limit your risk, the other leg of the trade is to purchase puts at a lower strike price, $2,610, for a cost of $26. That two-dollar differential (multiplied by 100) generates $200 for every contract you sell. Do three contracts and you generate $600. If Amazon closes on July 17 above $2,615, you’re in the clear and keep all of the proceeds, as both puts expire worthless. If the stock closes below $2610, you will encounter your maximum loss of $900: $5.00 (difference between strike prices) minus $2.00 (proceeds earned up front) times three contracts.\n  When the stock closes between the two strike prices, the put you bought at the lower strike price expires worthless, but the one you sold is in the money and legally binds you to buy the stock at the strike price. In the case of three contracts of $2,615 Amazon puts, that would be $784,500 to purchase 300 shares. Over a weekend, say, you may see a –$784,500 debit to buy the stock, but you would not see the stock among your holdings until Monday.\n  Kearns may not have realized that his negative cash balance displaying on his Robinhood home screen was only temporary and would be corrected once the underlying stock was credited to his account. Indeed it’s not uncommon for cash and buying power to display negative after the first half of options are processed but before the second options are exercised—even if the portfolio remains positive.\n  “Tragically, I don’t even think he made that big of a mistake. This is an interface issue, they have slick interfaces. Confetti popping everywhere,” says Brewster referring to the shower of colorful confetti Robinhood routinely deploys after customers make trades. “They try to gamify trading and couch it as investment.”\n  Says Robinhood: “We are committed to continuously improving our platform and are reviewing our options offering to determine if any changes may be appropriate.”\n  If you or someone you know is thinking about suicide, please call the   National Suicide Prevention Lifeline  at 800-273-TALK (8255) or text the Crisis Text Line at 741-741.", "posttime": "2020-06-20 23:12:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗宾汉,robinhood,卡恩斯", "title": "20岁罗宾汉顾客在73万美元负余额后自杀", "title_en": "20-Year-Old Robinhood Customer Commits Suicide After $730k Negative Balance", "transed": 1, "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/06/17/20-year-old-robinhood-customer-dies-by-suicide-after-seeing-a-730000-negative-balance/#64cd11941638", "via": "", "real_tags": ["罗宾汉", "robinhood", "卡恩斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我估计我已经连续7年每天使用Mac大约10个小时，每周5天，一年48周，总共使用了16800个小时。我已经使用这台计算机编写了我启动的大多数软件组件的第一个版本。在这段时间里，这台机器毫无故障地运转着。它从来没有修过，我也从来没有打开过封底。然而，它的电池正在膨胀，所以现在是升级到更新的机器的好时机。在回收机器之前，我决定打开它一次，用吸尘器吸风扇，看看是否有什么不同。哦，天哪，真的很不一样！如果您想查看，可以在视频中找到风扇测试。\n如果你想阅读评论或留下评论，可以在YouTube视频下进行。如果你想为这篇文章投稿，可以在GitHub上提出拉取请求。\n我想提醒任何想尝试此操作的人，请先关闭他们的计算机。我不再关心这台机器了，所以我把它留在了休眠模式。我还建议将吸尘器设置到最低可能的设置，并且在扫地时要非常轻柔。任何松动的元件或电线都很容易吸进去。根据记录，我用了一把1.2毫米的P5Pentalobe螺丝刀来打开后面板。你几乎可以在任何五金店找到它。\n一旦我打开后面板，你可以看到电池严重膨胀。即使是这样的形状，它们也是稳定的，但我不建议试图在它们身上戳一个洞。你很可能会把内部电池板短路，它可能会开始排放有毒的锂气体。\n如你所见，风扇叶片和热管格栅都被长达7年的灰尘堵塞了！难怪机器总是过热。\n在彻底清理之后，我让CPU在最大负载下运行了大约5分钟。5分钟后，我能听到更高音调的气流声音。清洁前，没有气流噪音，只有风扇本身发出的低沉噪音。当我把手放在显示器后面时，我能感觉到热气再次流动。这是很多年没发生过的事了！不管怎样，这是这台机器的最后时刻。我会把它留给回收利用。或者也许会有人愿意修理它并使用它。等着瞧吧。\n关于在电子设备上使用吸尘器的注意事项：在真空软管内运动的灰尘颗粒会形成一些静电。这会在电子元件上产生一些静电放电。根据我的经验，只有当你在清洁一台非常非常尘土飞扬的台式计算机时，才会发生这种情况。如果你有空压机，那是更好的选择。", "note_en": "I estimated that I had used my mac for approximately 10 hours a day, 5 days a week, 48 weeks a year, for 7 years straight, for a total for whopping 16800 hours. I have written the first versions of most of the software components of my startup using this computer. And all this time, this machine worked without a hiccup. It was never repaired, and I never opened the back cover. However, its battery is getting swollen, so it is a good time to upgrade to a newer machine. Before recycling the machine, I decided to open it for once and vacuum the fans to see if it makes a difference. Oh boy, did it make a difference! You can find the fan test in the video if you want to check it out.\n   If you want to read the comments or leave a comment, do so under YouTube video. If you want to contribute to the article, make a pull request on GitHub.\n  I want to remind anyone who would like to try this to turn off their computers first. I don’t care about this machine anymore, so I just left it in sleep mode. I also recommend setting the vacuum to minimum possible setting and be very gentle while sweeping. It would be very easy to suck in any loose components or wires. For the record, I used a 1.2 mm P5 Pentalobe Screwdriver to open the back panel. You can find it pretty much in any hardware store.\n Once I open the back panel, you can see that batteries are badly swollen. Even in that shape, they are stable, but I would not recommend trying to poke a hole in them. You would be likely to short circuit the inner panels, and it could start venting poisonous lithium gasses.\n  As you can see, both the fan blades and the heat pipe grills are clogged with 7 years’ worth of dust! No wonder why the machine was overheating all the time.\n After a throughout vacuuming, I let the CPU to run at max load for about 5 minutes. After 5 minutes, I could hear the higher-pitched airflow sound. Before cleaning, there was no airflow noise and only a low-pitched noise from the fans themselves. When I put my hand behind the monitor, I can feel the hot air flowing again. This didn’t happen in years! Anyway, this is the final moments of this machine. I will leave it up for recycling. Or maybe someone will be willing to fix it and use it. We’ll see.\n Note on using the vacuum cleaner on electronics: The dust particles travelling inside the vacuum hose will build up some static. This can create some static discharge onto the electronic components. In my experience, this can only happen if you are cleaning a very very dusty desktop computer. If you have an air compressor available, it is a better option.", "posttime": "2020-06-20 23:12:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook,cleaning,风扇", "title": "使用16800小时后清洁我的Macbook", "title_en": "Cleaning My MacBook After 16800 Hours of Use", "transed": 1, "url": "https://quanticdev.com/articles/cleaning-macbook-after-16800-hours-of-use", "via": "", "real_tags": ["macbook", "cleaning", "风扇"]}, {"category": "", "categoryclass": "", "imagename": "9267f39c8f4c8b9e4601c76773e2b756.jpg", "infoid": 1007408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三年前，在Flash兴起(和衰落)很久之后，Adobe宣布其曾经无处不在的多媒体平台终于要消失了。但Adobe从未提供Flash何时结束使用的具体日期。现在我们知道了：Adobe Flash将于2020年12月31日正式死亡。\n虽然年轻人不知道Flash是情有可原的，但在90年代末和本世纪头十年，互联网上大量的人依赖Flash以动画、游戏甚至视频的形式为网站增加交互性。事实上，在早期，YouTube几乎完全依赖Flash向全球数百万人提供流媒体视频。\n然而，这种情况在本世纪头十年后半段发生了变化，这要归功于更强大的开源平台的崛起，如HTML5和CSS3，以及对设计成在手机上运行的更高效标准的需求。Adobe Flash(即2005年Adobe收购之前的Macromedia Flash)很快就开始失去吸引力。那是在你进入通常由Flash漏洞引起的众多安全问题之前。\n然后在2010年，史蒂夫·乔布斯发布了一封公开信，解释为什么苹果不会在iPad、iPhone或任何未来的产品上支持Flash，这标志着Flash终结的开始。从那以后，像依赖Flash的NewGround这样的产品和网站，一直在努力取代Flash或实施变通办法，以便让自己远离一个曾经有用但现在已经过时的平台。这就把我们带到了今天，偶然发现一些仍然需要Flash才能运行的东西，感觉就像用旋转电话给朋友打电话一样。\n虽然Flash不会在12月31日消失得无影无踪，但Adobe表示将停止分发和更新Flash。关键的是，这也意味着Flash将不会得到任何进一步的安全或隐私补丁。\n对于一个持续了20多年，并在90年代末和21世纪初的网络泡沫中扮演了重要角色的软件平台来说，Flash持续的时间可能比大多数人预期的要长得多。所以，给我们带来了像YTMND和Homestar Runner这样极好的浪费时间的软件，倒一杯吧。这是真的，但现在该走了。\nGizmodo的高级记者，前身是汤姆的指南和笔记本电脑杂志。在那之前是射箭教练和企鹅训练师。", "note_en": "Three years ago, long after the rise (and fall) of Flash, Adobe announced that its once-ubiquitous multimedia platform was finally going away. But  Adobe never provided a specific date for when Flash would reach its end-of-life. Now we know: Adobe Flash is going to officially die on   December 31, 2020.\n    While younger folks should be forgiven for not knowing about Flash, during the late 90s, and into the 2000s, huge swaths of the internet relied on Flash to add interactivity to websites in the form of animations, games, and even videos. In fact, in its early days, YouTube relied almost entirely on Flash to serve up streaming videos to millions of people around the world.\n However, that changed in the latter half of the 2000s thanks to the rise of more powerful open-source platforms, like HTML 5 and CSS 3, and the need for a more efficient standard designed to run on mobile phones. Adobe Flash (or Macromedia Flash as it was known before Adobe bought it out in 2005) quickly began to lose its appeal. And that’s before you get into the numerous security problems often caused by exploits in Flash.\n  Then in 2010, Steve Jobs signaled the beginning of the end for Flash when he posted an   open letter explaining why Apple would not be supporting Flash on the iPad, iPhone, or any future products. Ever since products and sites, like the Flash-reliant   Newgrounds, have been working to replace Flash or implement workarounds so as to ween themselves off a once-useful but now outdated platform. That brings us to today, where stumbling upon something that still needs Flash to run feels like calling up a friend using a rotary phone.\n While Flash won’t just vanish into thin air on December 31,   Adobe says that it will stop distributing and updating Flash. Critically, that also means Flash won’t be getting any further security or privacy patches.\n   For a software platform that lasted more than two decades and played a huge part in the Dot-com bubble of the late 90s and early 2000s, Flash lasted a lot longer than most people probably ever expected. So pour one out for the software that brought us wonderful time-wasters like YTMND and   Homestar Runner. It’s been real, but it’s time to go.\n Senior reporter at Gizmodo, formerly Tom&#39;s Guide and Laptop Mag. Was an archery instructor and a penguin trainer before that.", "posttime": "2020-06-20 22:52:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "adobe,flash", "title": "194天后“Adobe Flash真的要死了”", "title_en": "'Adobe Flash Is Actually Going to Die' In 194 Days", "transed": 1, "url": "https://gizmodo.com/adobe-flash-is-actually-going-to-die-this-time-for-rea-1844057085", "via": "", "real_tags": ["adobe", "flash"]}, {"category": "", "categoryclass": "", "imagename": "603c76f2c1ce382307314c4fa66f71b6.jpg", "infoid": 1007407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个黑眼睛，黑头发的男孩出生于1980年6月20日，在他几周大的时候就被遗弃了。原因对于任何费心去看的人来说都是显而易见的：他的右腿有点畸形。在一场疾病(可能是小儿麻痹症)之后，他被扔进了罗马尼亚社会主义共和国被遗弃的婴儿的海洋中。\n在那个时期记录孤儿护理的电影中，你会看到护士们像流水线上的工人一样，从看似源源不断的补给中裹着新生儿；她们用肌肉发达的手臂和漫不经心的冷漠，把每个新生儿都吊在一块布上，熟练地把它们打结成一个整齐的包裹，然后把它贴在一排沉默的、看起来忧心忡忡的乳突的末端。女人们不会对着婴儿咕咕叫或唱歌。你可以看到，在包裹动作中，当他们的头飞驰而过时，小脸试图理解发生了什么。\n在伊齐多的医院里，在南喀尔巴西亚山区小镇Sighetu Marmaţiei，他会用塞进嘴里的瓶子喂食，靠在婴儿床的栅栏上。在外面世界的孩子们开始品尝固体食物然后自己吃饭的年龄很久之后，他和他的同龄人仍然仰卧着，从开口处加宽的瓶子里吮吸，以便让稀饭通过。如果没有适当的护理或理疗，婴儿的腿部肌肉就会消瘦。3岁时，他被认为是“有缺陷的”，并被转移到镇上的Cămin Spital pentru Copii DeficienţI，一家不可恢复的儿童之家医院。\n水泥堡垒没有发出孩子们玩耍的声音，尽管一次住在里面的人多达500人。它悲哀地矗立在1928年埃利·威塞尔出生的小镇的鹅卵石街道和波光粼粼的河流之外，在纳粹驱逐之前享受着快乐的童年。\n伊齐多三楼病房的窗户已经安装了监狱栅栏。在孩提时代，他经常站在那里，俯视着一个被带刺铁丝网围住的空荡荡的泥土院子。通过冬天光秃秃的树枝，Izidor看到了另一家医院，那家医院就坐在他自己的医院的正前方，不让街道看到。真正的孩子，穿着鞋子和外套的孩子，牵着父母的手的孩子，从那家医院来来往往。没有一个来自伊齐多的Cămin Spital的人被带到那里，无论他们病得多么厉害，即使他们快要死了。\n就像所有因“不可挽回的”而住在医院的男孩和女孩一样，Izidor在长桌上吃到了几乎不能吃的、稀释的食物，长凳上的裸体孩子们敲打着他们的锡碗。他在人满为患的房间里长大，他的孤儿同伴们在那里没完没了地摇晃，或拳打脚踢自己的脸，或尖叫。失控的儿童被用成人镇静剂剂量，通过未消毒的针头给药，而许多生病的人则接受未经筛查的血液输注。乙型肝炎和艾滋病毒/艾滋病肆虐罗马尼亚孤儿院。\nIzidor注定要在这座建筑里度过他童年的余生，直到18岁才离开大门，那时，如果他完全丧失了行为能力，他将被转移到一家老人之家；如果他被证明是最低限度的功能障碍，他将被驱逐到街上流浪。他很有可能活不了那么久，那条腿干瘪的男孩会在童年时死去，营养不良，浑身发抖，无人关爱。\n当天是罗马尼亚最后一位共产主义独裁者Nicolae Ceaușescu被行刑队公开处决30周年，他统治了24年。1990年，外界发现了他的“儿童集中营”网络，其中估计有17万名被遗弃的婴儿、儿童和青少年被抚养。ceaușescu相信更多的人口会促进罗马尼亚的经济，她减少了避孕和堕胎，对没有孩子的人实施了税收处罚，并将生下10个或更多孩子的妇女誉为“女英雄母亲”。不可能照看另一个孩子的父母可以称他们的新出生的孩子为“ceauşescu的孩子”，就像“让他抚养它”一样。\n为了容纳一代不受欢迎或负担不起的儿童，ceauşescu下令在全国各地建造或改造数以百计的建筑。标牌上写着这样的标语：。\n在3岁时，被遗弃的儿童被分类。未来的工人将得到衣服、鞋子、食物和一些学校教育，以防万一-“儿童之家”-而“有缺陷的”儿童在他们的Că矿斯皮塔尔得不到任何东西。苏联的“排泄学”认为婴儿的残疾是固有的，是无法治愈的。即使是有可治疗问题的儿童-可能是对眼、贫血或唇裂-也被归类为“无法挽救”。\n罗马尼亚革命后，骨瘦如柴、尿液溅在地板上、粪便结块的儿童被外国新闻节目发现并拍摄下来，其中包括美国广播公司(ABC)的20/20节目，该节目在1990年播出了“一个国家的耻辱”(Shame Of A Nation)。就像45年前奥斯威辛集中营的解放者一样，早期参观这些机构的人一生都被他们看到的东西所困扰。简·阿伦森告诉我：“我们乘直升机飞越雪地到达锡雷特，午夜过后在零下的天气下降落，随行的是携带尤兹的罗马尼亚保镖。”作为一名曼哈顿的儿科医生和领养医学专家，她是新政府召集到罗马尼亚的首批儿科团队中的一员。“我们走进一座漆黑、冰冷的建筑，发现周围潜伏着一些年轻人--他们很小，但年纪较大，有些怪异的东西，就像巨魔一样，肮脏，臭气熏天。”他们在以一种单调的方式吟唱，胡言乱语。我们打开一扇门，发现了一群“白痴”--现在它被称为先天性缺碘综合症；未经治疗的甲状腺功能减退症阻碍了生长和大脑发育。我不知道他们多大，3英尺高，可能是20多岁。在其他房间里，我们看到6岁和7岁大小的青少年，没有第二性特征。有一些患有潜在遗传疾病的孩子躺在笼子里。你几乎要开始分离了。“。\n哈佛医学院(Harvard Medical School)和波士顿儿童医院(Boston Children‘s Hospital)的儿科和神经科学教授查尔斯·A·纳尔逊三世(Charles A.Nelson III)回忆道：“一天下午，我走进布加勒斯特的一家机构，一个小孩子站在那里哭泣。”“他心碎了，裤子都湿了。我问，‘那个孩子怎么了？’一名工人说，“嗯，他妈妈今天早上抛弃了他，他一整天都是这样。”就这样了。没有人安慰这个小男孩，也没有人把他抱起来。这就是我的介绍。“。\n罗马尼亚孤儿并不是20世纪心理学家看到的第一个被严重忽视的儿童。反应迟钝的二战孤儿，以及长期被隔离在医院的儿童，都对世纪中叶的儿童发展巨人如勒内·斯皮茨(RenéSpitz)和约翰·鲍尔比(John Bowlby)深感担忧。在一个致力于与营养不良、伤害和感染作斗争的时代，很难相信有足够的食物和医疗稳定的孩子会因为想念父母而消亡的想法。他们的研究导致了当时很大胆的观念，尤其是鲍尔比提出的，即仅仅是缺乏一个“依恋人物”，即父母或照顾者，可能会对心理和身体健康造成终生的破坏。\n神经学家倾向于将“依恋理论”视为心理学“软科学”中具有启发性和发人深省的工作。它在很大程度上依赖于案例研究或相关证据或动物研究。在心理学家哈里·哈洛(Harry Harlow)臭名昭著的“母性剥夺”实验中，他只把小恒河猴关在笼子里，只给它们提供用铁丝和木头或泡沫和毛巾布制成的母性传真件。\n1998年，在一次小型科学会议上，动物研究连续展示了罗马尼亚孤儿院的图像，改变了依恋研究的进程。首先，明尼苏达大学新生儿儿科教授达娜·约翰逊(Dana Johnson)分享了他在罗马尼亚收集的照片和视频，照片和视频显示，房间里挤满了从事“运动刻板印象”的孩子：摇摆、敲打他们的头、尖叫。紧随其后的是一位演讲者，她展示了她与无母亲的灵长类婴儿一起工作的视频，就像哈洛生产的婴儿一样-摇晃、旋转、自残。观众对这些相似之处感到震惊。“我们都流泪了，”纳尔逊告诉我。\n在ceaușescu倒台后的十年里，罗马尼亚新政府欢迎西方儿童发展专家同时帮助和研究仍在国家看护中心的数以万计的儿童。研究人员希望回答一些长期存在的问题：在神经发育中是否存在敏感期，在此之后，被剥夺的儿童的大脑不能充分利用后来提供的精神、情感和身体刺激？“母亲被剥夺”或“照顾者缺勤”的影响能用现代神经成像技术记录下来吗？最后，如果机构儿童被转移到家庭环境中，他或她能恢复吗？\n从丹佛机场出来就像在桌上打牌一样。大平原在这里几乎被夷为平地，公路路肩上的风、泥土和垃圾，沃尔格林、阿尔比和汽车区都被夷为平地。坐在租来的车里，我在伊齐多小区的半圆形和死胡同里缓缓行驶，直到我看到他礼貌地半挥手走出一座4500平方英尺的麦克豪宅的阴影。他在这里转租了一个房间，其他人也是如此，包括一些家庭-为歌利亚人建造的独栋住宅中的一个郊区公社。39岁的伊齐多是一个优雅、结实的人，眼睛里充满悲伤。他的举止是机警而又犹豫不决的。作为一家肯德基的总经理，他每周工作60到65个小时。\n“欢迎来到罗马尼亚，”他一边宣布，一边打开卧室的门。它是进入另一个时间，另一个地方的入口。从每次访问他的祖国，Izidor都带回了民间艺术和纪念品-手绘釉盘和茶杯，刺绣的茶巾，罗马尼亚国旗，镜头玻璃杯，木制雕像，梅子白兰地的切割玻璃瓶，以及罗马尼亚民间音乐的CD，沉重的小提琴。他可以进一家礼品店。有厚厚的酒色地毯、毯子和墙帘。周围的光线是栗色的，窗帘在高空阳光的映衬下拉上了。Izidor住在丹佛机场西南10英里处的一座罗马尼亚小屋里。\n“马拉穆尔ş的每个人都这样生活，”他告诉我，他指的是罗马尼亚北部的文化区，他就是在那里出生的。\n“你会看到那里的许多人的家里都有这些东西，”他澄清说。\n这听起来更准确。人们喜欢小摆设。“你来的时候听起来像罗马尼亚人吗？”我问你。\n“不，”他说。“当我开始讲话时，他们会问，‘你是哪里人？’我告诉他们：‘From Maramureş！’ ‘没有人相信他，因为他的口音，所以他不得不解释说：“从技术上讲，如果你想说得合乎逻辑，我是罗马尼亚人，但我已经在美国生活了20多年。”\n“不，我尽量不要。我想把罗马尼亚当做一个普通人来体验。我不想让所有人都知道我是“孤儿”。“ 。\n他严谨的英语使随意的短语听起来也很正式。在他的房间里，Izidor捕捉到了罗马尼亚的民间审美，但在表面之下还有其他东西在搅动。我想起了他22岁时自己出版的那本书，书名叫“被遗弃的一生”。这是一个可怕的故事，但是有一次，当他大约8岁的时候，Izidor度过了快乐的一天。\n一位好心的保姆开始在医院工作。Izidor在他的回忆录中写道：“Onisa是一位年轻的女士，有点胖乎乎的，留着长长的黑发和圆圆的玫瑰色脸颊。”“她喜欢唱歌，经常教我们一些她的音乐。”有一天，当另一位保姆用扫帚打伊齐多时，奥尼莎介入了。和她之前的几个人一样，奥尼莎发现了他的聪明才智。在半流动(有些是爬行或爬行)、稍微说话(有些只是发出声音)儿童的病房里，如果成年人有问题，比如那个人的名字是什么，或者他是什么时候死的，Izidor是首选的孩子。导演偶尔会偷看一眼，问伊齐多他和其他孩子是否被打了；为了避免报复，伊齐多总是说没有。\n那天，为了让他在被殴打后振作起来，奥尼萨承诺有一天她会带他回家过夜。Izidor怀疑这样的非同寻常的事件是否会发生，他感谢她提出了这个好主意。\n几周后，在一个下雪的冬日，奥尼莎给伊齐多穿上了她从家里带来的暖和的衣服和鞋子，牵着他的手，带着他走出了前门，穿过了孤儿院的大门。她慢慢地走着，带着这个小男孩沿着小巷穿过公立医院，进入了小镇。小男孩的腿不均匀，一瘸一拐地摇晃着。凉爽的空气拂过他的脸颊，雪在他的鞋底吱吱作响；风吹得树枝嘎嘎作响；一只鸟站在烟囱上。“这是我第一次走出国门，”他现在告诉我。他惊讶地看着汽车、房子和商店。他努力吸收和记忆每一件事，以便汇报给他所在病房的孩子们。\n“当我走进奥妮莎的公寓时，”他写道，“我简直不敢相信它有多漂亮；墙壁上覆盖着黑色的地毯，其中一块上面有一张最后的晚餐的照片。地板上的地毯是红色的。“。邻居的孩子们敲了敲奥尼萨的门，看看孤儿院的那个陌生男孩是否想出来玩耍，他做到了。奥尼莎的孩子们放学回家，伊齐多得知这是他们圣诞节假期的开始。当晚，他与奥尼萨的家人一起在朋友的餐桌上大吃大喝，第一次品尝了罗马尼亚特色菜，包括意大利马肉(填充卷心菜)、土豆炖牛肉配厚面，以及奶油馅的甜黄色海绵蛋糕。他记得每一口。晚饭后，那户人家的孩子在起居室地板上让伊齐多玩他的玩具。伊齐多跟随男孩的脚步，开着小火车穿过地毯。回到奥尼萨家，他第一次睡在柔软干净的床上。\n第二天早上，奥尼萨问伊齐多，他是想和她一起去上班，还是想和她的孩子们呆在一起。在这里，他犯了一个如此可怕的错误，以至于31年后，他仍然怀着悲痛的心情回忆着这件事。\n“我想和你一起去上班！”他打电话来了。他深深地幻想着奥妮莎是他的母亲，他不想和她分开。“我以最快的速度穿好衣服，然后我们就出门了，”他回忆道。“当我们走近她的工作地点时，我意识到她的工作地点在医院，我的医院，我开始哭…。虽然只过了24小时，但不知何故，我以为我现在要成为奥妮莎大家庭的一员了。直到我们再次来到大门口，我才意识到她的工作其实是在医院。当我们转到院子里时，我感到非常震惊，就像我忘了我是从那里来的一样。“。\n他试图折返，但不被允许。他找到了地球上最美妙的地方--奥尼萨的公寓--由于他自己的愚蠢，他让它溜走了。他哭得像个新人，直到其他保姆威胁要扇他耳光。\n今天，伊齐多住在距离罗马尼亚6000英里的地方。他过着孤独的生活。但在他位于铺设了路面的草原上的一个分区的卧室里，他从童年最快乐的夜晚重新创造了这个场景。\n“在奥尼萨的那天晚上，”我问道，“你认为你感觉到那里发生了一些你以前从未见过或感受过的家庭关系和情感吗？”\n“是的！你看到这个了吗？“。Izidor说着，拿起一块用勃艮第玫瑰编织的挂毯，背景是深色的树叶。“这和奥妮莎的几乎一模一样。我是因为这个原因在罗马尼亚买的！”\n“不，但对我来说，它们象征着‘和平’。这是我第一次在真正的家里睡觉。多年来我一直在想，为什么我不能有那样的家呢？ 。\n现在他知道了。但他知道，无论他收集了多少个镜头玻璃杯，都有缺失的部分。\n丹尼·鲁克尔夫妇和他们的三个年幼的女儿住在圣地亚哥的一套公寓里。他们认为增加一个男孩会很好，并听说当地一位独立制片人约翰·厄普顿(John Upton)正在安排收养罗马尼亚孤儿。马利打电话告诉他，他们想收养一个男婴。“那里有成千上万的孩子，”厄普顿回答说。“那会很容易的。”\n马利笑了。“没有多少是准确的！”她告诉我。我们坐在南加州葡萄酒之乡特梅库拉一座白色粉刷房屋的起居室里。孩子们和狗在令人眼花缭乱的炎热日子里砰的一声进进出出(拉克尔夫妇近年来从寄养中心收养了五个孩子)。Marlys现在是一名为有特殊需要的成年人提供就业指导的人，她就像黛安·基顿(Diane Keaton)中的角色，害羞地躲在大眼镜后面，留着一头蓬松的长发，但偶尔也会勇敢地爆发出来。丹尼是一名程序员，是个随和的人。Marlys称自己是一个居家的人，但有一次她搬到罗马尼亚住了两个月，试图收养她在视频中看到的一个男孩。\n由于“一个国家的耻辱”的失败，厄普顿在节目播出四天后飞往罗马尼亚，前往节目中最糟糕的地方，位于Sighetu MarmaţIEI的不可恢复儿童之家医院。他回去过几次。在一次访问中，他把一群孩子聚集在一个空房间里，为未来的养父母拍摄他们的照片。他的视频不会像他描述的那样，把孩子们赤身裸体地挤在一起，“就像他描述的水族馆里的小爬行动物一样”，而是像人一样，穿着衣服，说话。\n到那时，捐款已经开始来自世界各地的慈善机构。孩子们几乎没有接触到，因为工作人员浏览了最好的物品，但在那一天，出于对美国人的尊重，保姆们给孩子们穿上了捐赠的毛衣。虽然孩子们似乎很兴奋成为关注的中心，但厄普顿和他的罗马尼亚助手发现进展缓慢。一些人根本不说话，另一些人站不起来或站不住。当电影制片人问起孩子们的名字和年龄时，保姆们耸耸肩。\n在一张木凳的尽头坐着一个6岁大小的男孩-10岁的时候，Izidor的体重约为50磅。厄普顿是他见过的第一个美国人。伊齐多是从电视节目“达拉斯”中知道美国人的。有一天，一台捐赠的电视送来了，他曾游说让这一件事留在医院。导演已经同意了。周日晚上8点，流动的孩子、保姆和其他楼层的工作人员聚集在一起看达拉斯。那天，当传言说有一个美国人来了，孤儿院里的反应是，万能的上帝，来自巨型房屋之地的人！\n伊齐多知道保姆们不知道的信息。他告诉我：“约翰·厄普顿(John Upton)会问一个孩子，‘你多大了？’，那个孩子会说，‘我不知道，’保姆会说，‘我不知道，’我会大喊，‘他14岁！’”他会问另一个孩子，‘他姓什么？’我会大喊，‘Dumka！’ “。\n“伊齐多比工作人员更了解这里的孩子，”厄普顿在其中一盘录音带中抱怨道。在会议结束之前，他把Izidor抱到他的腿上，问他是否愿意去美国。伊齐多说他会的。\n回到圣地亚哥，厄普顿告诉拉克尔一家，这个7岁左右的聪明男孩希望来美国。“我们本来想领养一个婴儿，”马利说。“后来我们看到了约翰的视频，就爱上了伊齐多。”\n1991年5月，马利飞往罗马尼亚看望这个孩子，并试图把他带回家。就在旅行前，她得知伊齐多快11岁了，但她并不气馁。她和一位新朋友黛比·普林斯一起旅行，她也与厄普顿的一个孩子配对。在主任的办公室里，马利等着见伊齐多，黛比等着见一位名叫西普里安的金发小电线。\n“当Izidor进来的时候，”Marlys说，“我看到的只有他，就像其他一切都是模糊的一样。他和我想象的一样漂亮。我们的翻译问他办公室里的哪位来访者。\n..", "note_en": "The dark-eyed, black-haired boy, born June 20, 1980, had been abandoned when he was a few weeks old. The reason was obvious to anyone who bothered to look: His right leg was a bit deformed. After a bout of illness (probably polio), he had been tossed into a sea of abandoned infants in the Socialist Republic of Romania.\n  In films of the period documenting orphan care, you see nurses like assembly-line workers swaddling newborns out of a seemingly endless supply; with muscled arms and casual indifference, they sling each one onto a square of cloth, expertly knot it into a tidy package, and stick it at the end of a row of silent, worried-looking papooses. The women don’t coo or sing to the babies. You see the small faces trying to fathom what’s happening as their heads whip by during the wrapping maneuvers.\n  In his hospital, in the Southern Carpathian mountain town of Sighetu Marmaţiei, Izidor would have been fed by a bottle stuck into his mouth and propped against the bars of a crib. Well past the age when children in the outside world began tasting solid food and then feeding themselves, he and his age-mates remained on their backs, sucking from bottles with widened openings to allow the passage of a watery gruel. Without proper care or physical therapy, the baby’s leg muscles wasted. At 3, he was deemed “deficient” and transferred across town to a  Cămin Spital Pentru Copii Deficienţi, a Home Hospital for Irrecoverable Children.\n The cement fortress emitted no sounds of children playing, though as many as 500 lived inside at one time. It stood mournfully aloof from the cobblestone streets and sparkling river of the town where Elie Wiesel had been born, in 1928, and enjoyed a happy childhood before the Nazi deportations.\n The windows on Izidor’s third-floor ward had been fitted with prison bars. In boyhood, he stood there often, gazing down on an empty mud yard enclosed by a barbed-wire fence. Through bare branches in winter, Izidor got a look at another hospital that sat right in front of his own and concealed it from the street. Real children, children wearing shoes and coats, children holding their parents’ hands, came and went from that hospital. No one from Izidor’s  Cămin Spital was ever taken there, no matter how sick, not even if they were dying.\n  Like all the boys and girls who lived in the hospital for “irrecoverables,” Izidor was served nearly inedible, watered-down food at long tables where naked children on benches banged their tin bowls. He grew up in overcrowded rooms where his fellow orphans endlessly rocked, or punched themselves in the face, or shrieked. Out-of-control children were dosed with adult tranquilizers, administered through unsterilized needles, while many who fell ill received transfusions of unscreened blood. Hepatitis B and HIV/AIDS ravaged the Romanian orphanages.\n Izidor was destined to spend the rest of his childhood in this building, to exit the gates only at 18, at which time, if he were thoroughly incapacitated, he’d be transferred to a home for old men; if he turned out to be minimally functional, he’d be evicted to make his way on the streets. Odds were high that he wouldn’t survive that long, that the boy with the shriveled leg would die in childhood, malnourished, shivering, unloved.\n was the 30th anniversary of the public execution by firing squad of Romania’s last Communist dictator, Nicolae Ceaușescu, who’d ruled for 24 years. In 1990, the outside world discovered his network of “child gulags,” in which an estimated 170,000 abandoned infants, children, and teens were being raised. Believing that a larger population would beef up Romania’s economy, Ceaușescu had curtailed contraception and abortion, imposed tax penalties on people who were childless, and celebrated as “heroine mothers” women who gave birth to 10 or more. Parents who couldn’t possibly handle another baby might call their new arrival “Ceauşescu’s child,” as in “Let him raise it.”\n  To house a generation of unwanted or unaffordable children, Ceauşescu ordered the construction or conversion of hundreds of structures around the country. Signs displayed the slogan:  .\n At age 3, abandoned children were sorted. Future workers would get clothes, shoes, food, and some schooling in  Case de copii—“children’s homes”—while “deficient” children wouldn’t get much of anything in their  Cămine Spitale. The Soviet “science of defectology” viewed disabilities in infants as intrinsic and uncurable. Even children with treatable issues—perhaps they were cross-eyed or anemic, or had a cleft lip—were classified as “unsalvageable.”\n  After the Romanian revolution, children in unspeakable conditions—skeletal, splashing in urine on the floor, caked with feces—were discovered and filmed by foreign news programs, including ABC’s  20/20, which broadcast “ Shame of a Nation” in 1990. Like the liberators of Auschwitz 45 years before, early visitors to the institutions have been haunted all their lives by what they saw. “We flew in by helicopter over the snow to Siret, landing after midnight, subzero weather, accompanied by Romanian bodyguards carrying Uzis,” Jane Aronson tells me. A Manhattan-based pediatrician and adoption-medicine specialist, she was part of one of the first pediatric teams summoned to Romania by the new government. “We walk into a pitch-black, freezing-cold building and discover there are youngsters lurking about—they’re tiny, but older, something weird, like trolls, filthy, stinking. They’re chanting in a dronelike way, gibberish. We open a door and find a population of ‘cretins’—now it’s known as congenital iodine deficiency syndrome; untreated hypothyroidism stunts growth and brain development. I don’t know how old they were, three feet tall, could have been in their 20s. In other rooms we see teenagers the size of 6- and 7-year-olds, with no secondary sexual characteristics. There were children with underlying genetic disorders lying in cages. You start almost to disassociate.”\n  “I walked into an institution in Bucharest one afternoon, and there was a small child standing there sobbing,” recalls Charles A. Nelson III, a professor of pediatrics and neuroscience at Harvard Medical School and Boston Children’s Hospital. “He was heartbroken and had wet his pants. I asked, ‘What’s going on with that child?’ A worker said, ‘Well, his mother abandoned him this morning and he’s been like that all day.’ That was it. No one comforted the little boy or picked him up. That was my introduction.”\n  The Romanian orphans were not the first devastatingly neglected children to be seen by psychologists in the 20th century. Unresponsive World War II orphans, as well as children kept isolated for long periods in hospitals, had deeply concerned mid-century child-development giants such as René Spitz and John Bowlby. In an era devoted to fighting malnutrition, injury, and infection, the idea that adequately fed and medically stable children could waste away because they missed their parents was hard to believe. Their research led to the then-bold notion, advanced especially by Bowlby, that simply lacking an “attachment figure,” a parent or caregiver, could wreak a lifetime of havoc on mental and physical health.\n  Neuroscientists tended to view “attachment theory” as suggestive and thought-provoking work within the “soft science” of psychology. It largely relied on case studies or correlational evidence or animal research. In the psychologist Harry Harlow’s infamous “maternal deprivation” experiments, he caged baby rhesus monkeys alone, offering them only maternal facsimiles made of wire and wood, or foam and terry cloth.\n In 1998, at a small scientific meeting, animal research presented back-to-back with images from Romanian orphanages changed the course of the study of attachment. First the University of Minnesota neonatal-pediatrics professor Dana Johnson shared photos and videos that he’d collected in Romania of rooms teeming with children engaged in “motor stereotypies”: rocking, banging their heads, squawking. He was followed by a speaker who showed videos of her work with motherless primate infants like the ones Harlow had produced—swaying, twirling, self-mutilating. The audience was shocked by the parallels. “We were all in tears,” Nelson told me.\n In the decade after the fall of Ceaușescu, the new Romanian government welcomed Western child-development experts to simultaneously help and study the tens of thousands of children still warehoused in state care. Researchers hoped to answer some long-standing questions: Are there sensitive periods in neural development, after which the brain of a deprived child cannot make full use of the mental, emotional, and physical stimulation later offered? Can the effects of “maternal deprivation” or “caregiver absence” be documented with modern neuroimaging techniques? Finally, if an institutionalized child is transferred into a family setting, can he or she recoup undeveloped capacities? Implicitly, poignantly: Can a person unloved in childhood learn to love?\n  out from the Denver airport like playing cards on a table. The Great Plains have been ground down to almost nothing here, to wind and dirt and trash on the shoulder of the highway, to Walgreens and Arby’s and AutoZone. In a rental car, I drive slowly around the semicircles and cul-de-sacs of Izidor’s subdivision until I see him step out of the shadow of a 4,500-square-foot McMansion with a polite half-wave. He sublets a room here, as do others, including some families—an exurban commune in a single-family residence built for Goliaths. At 39, Izidor is an elegant, wiry man with mournful eyes. His manner is alert and tentative. A general manager for a KFC, he works 60-to-65-hour weeks.\n  “Welcome to Romania,” he announces, opening his bedroom door. It’s an entryway into another time, another place. From every visit to his home country, Izidor has brought back folk art and souvenirs—hand-painted glazed plates and teacups, embroidered tea towels, Romanian flags, shot glasses, wood figurines, cut-glass flasks of plum brandy, and CDs of Romanian folk music, heavy on the violins. He could stock a gift shop. There are thick wine-colored rugs, blankets, and wall hangings. The ambient light is maroon, the curtains closed against the high-altitude sunshine. Ten miles southwest of the Denver airport, Izidor is living in an ersatz Romanian cottage.\n  “Everyone in Maramureş lives like this,” he tells me, referring to the cultural region in northern Romania where he was born.\n  “You will see that many people there have these things in their homes,” he clarifies.\n That sounds more accurate. People like knickknacks. “Do you sound like a Romanian when you visit?” I ask.\n “No,” he says. “When I start to speak, they ask, ‘Where are you from?’ I tell them: ‘From Maramureş!’ ” No one believes him, because of his accent, so he has to explain: “Technically, if you want to be logical about it, I am Romanian, but I’ve lived in America for more than 20 years.”\n  “No, I try not to. I want to experience Romania as a normal human being. I don’t want to be known everywhere as ‘the Orphan.’ ”\n  His precise English makes even casual phrases sound formal. In his room, Izidor has captured the Romanian folk aesthetic, but something else stirs beneath the surface. I’m reminded of the book he self-published at age 22, titled  Abandoned for Life. It’s a grim tale, but once, when he was about 8, Izidor had a happy day.\n A kind nanny had started working at the hospital. “Onisa was a young lady, a bit chubby, with long black hair and round rosy cheeks,” Izidor writes in his memoir. “She loved to sing and often taught us some of her music.” One day, Onisa intervened when another nanny was striking Izidor with a broomstick. Like a few others before her, Onisa had spotted his intelligence. On the ward of semi-ambulatory (some crawled or creeped), slightly verbal (some just made noises) children, Izidor was the go-to kid if an adult had questions, like what was that one’s name or when had that one died. The director would occasionally peek in and ask Izidor if he and the other children were being hit; to avoid retribution, Izidor always said no.\n  On that day, to cheer him up after his beating, Onisa promised that someday she’d take him home with her for an overnight visit. Skeptical that such an extraordinary event would ever happen, Izidor thanked her for the nice idea.\n A few weeks later, on a snowy winter day, Onisa dressed Izidor in warm clothes and shoes she’d brought from home, took him by the hand, and led him out the front door and through the orphanage gate. Walking slowly, she took the small boy, who swayed on uneven legs with a deep, tilting limp, down the lane past the public hospital and into the town. Cold, fresh air brushed his cheeks, and snow squeaked under his shoes; the wind rattled the branches; a bird stood on a chimney. “It was my first time ever going out into the world,” he tells me now. He looked in astonishment at the cars and houses and shops. He tried to absorb and memorize everything to report back to the kids on his ward.\n “When I stepped into Onisa’s apartment,” he writes, “I could not believe how beautiful it was; the walls were covered with dark rugs and there was a picture of the Last Supper on one of them. The carpets on the floor were red.” Neighborhood children knocked on Onisa’s door to see if the strange boy from the orphanage wanted to come out and play, and he did. Onisa’s children arrived home from school, and Izidor learned that it was the start of their Christmas holiday. He feasted alongside Onisa’s family at their friends’ dinner table that night, tasting Romanian specialties for the first time, including  sarmale (stuffed cabbage), potato goulash with thick noodles, and sweet yellow sponge cake with cream filling. He remembers every bite. On the living-room floor after dinner, the child of that household let Izidor play with his toys. Izidor followed the boy’s lead and drove little trains across the rug. Back at Onisa’s, he slept in his first-ever soft, clean bed.\n  The next morning, Onisa asked Izidor if he wanted to go to work with her or to stay with her children. Here he made a mistake so terrible that, 31 years later, he still remembers it with grief.\n “I want to go to work with you!” he called. He was deep into a fantasy that Onisa was his mother, and he didn’t want to be parted from her. “I got dressed as fast as I could, and we headed out the door,” he remembers. “When we were near her work, I realized that her work was at the hospital,  my hospital, and I began to cry … It had only been 24 hours but somehow I thought I was going to be part of Onisa’s family now. It didn’t occur to me that her work was actually at the hospital until we were at the gate again. I felt so shocked when we turned into the yard it was like I’d forgotten I came from there.”\n He tried to turn back but wasn’t permitted. He’d found the most wonderful spot on Earth—Onisa’s apartment—and, through his own stupidity, had let it slip away. He sobbed like a newcomer until the other nannies threatened to slap him.\n Today Izidor lives 6,000 miles from Romania. He leads a solitary life. But in his bedroom in a subdivision on a paved-over prairie, he has re-created the setting from the happiest night in his childhood.\n “That night at Onisa’s,” I ask, “do you think you sensed that there were family relationships and emotions happening there that you’d never seen or felt before?”\n  “Yes! You see this?” Izidor says, picking up a tapestry woven with burgundy roses on a dark, leafy background. “This is almost identical to Onisa’s. I bought it in Romania for that reason!”\n    “No, but they signify ‘peace’ to me. It was the first time I slept in a real home. For many years I thought,  Why can’t I have a home like that? ”\n Now he does. But he knows there are missing parts—no matter how many shot glasses he collects.\n Danny and Marlys Ruckel lived with their three young daughters in a San Diego condo. They thought it would be nice to add a boy to the mix, and heard about a local independent filmmaker, John Upton, who was arranging adoptions of Romanian orphans. Marlys called and told him they wanted to adopt a baby boy. “There’s thousands of kids there,” Upton replied. “That’ll be easy.”\n Marlys laughs. “Not much of that was accurate!” she tells me. We’re seated in the living room of a white-stucco house in the Southern California wine-country town of Temecula. Kids and dogs bang in and out of the dazzling hot day (the Ruckels have adopted five children from foster care in recent years). Marlys, now a job coach for adults with special needs, is like a Diane Keaton character, shyly retreating behind large glasses and a fall of long hair, but occasionally making brave outbursts. Danny, a programmer, is an easygoing guy. Marlys describes herself as a homebody, but then there was that time she moved to Romania for two months to try to adopt a boy she saw on a video.\n  Undone by “Shame of a Nation,” Upton had flown to Romania four days after the broadcast, and  made his way to the worst place on the show, the Home Hospital for Irrecoverable Children in Sighetu Marmaţiei. He went back a few times. On one visit, he gathered a bunch of kids in an empty room to film them for prospective adoptive parents. His video would not show children packed together naked “like little reptiles in an aquarium,” as he’d described them, but as people, wearing clothes and speaking.\n By then, donations had started to come in from charities around the world. Little reached the children, because the staff skimmed the best items, but on that day, in deference to the American, nannies put donated sweaters on the kids. Though the children seemed excited to be the center of attention, Upton and his Romanian assistant found it slow-going. Some didn’t speak at all, and others were unable to stand up or to stand still. When the filmmakers asked for the children’s names and ages, the nannies shrugged.\n  At the end of a wooden bench sat a boy the size of a 6-year-old—at age 10, Izidor weighed about 50 pounds. Upton was the first American he’d ever seen. Izidor knew about Americans from the TV show  Dallas. A donated television had arrived one day, and he had lobbied for this one thing to stay at the hospital. The director had assented. On Sunday nights at 8 o’clock, ambulatory kids, nannies, and workers from other floors gathered to watch  Dallas together. When rumors flew up the stairs that day that an American had arrived, the reaction inside the orphanage was,  Almighty God, someone from the land of the giant houses!\n Izidor knew the information the nannies didn’t. He tells me: “John Upton would ask a kid, ‘How old are you?,’ and the kid would say, ‘I don’t know,’ and the nanny would say, ‘I don’t know,’ and I’d yell, ‘He’s 14!’ He’d ask about another kid, ‘What’s his last name?,’ and I’d yell, ‘Dumka!’ ”\n “Izidor knows the children here better than the staff,” Upton grouses in one of the tapes. Before wrapping up the session, he lifts Izidor into his lap and asks if he’d like to go to America. Izidor says that he would.\n Back in San Diego, Upton told the Ruckels about the bright boy of about 7 who hoped to come to the United States. “We’d wanted to adopt a baby,” Marlys says. “Then we saw John’s video and fell in love with Izidor.”\n  In May 1991, Marlys flew to Romania to meet the child and try to bring him home. Just before traveling, she learned that Izidor was almost 11, but she was undaunted. She traveled with a new friend, Debbie Principe, who had also been matched with a child by Upton. In the director’s office, Marlys waited to meet Izidor, and Debbie waited to meet a little blond live wire named Ciprian.\n  “When Izidor entered,” Marlys says, “all I saw was him, like everything else was fuzzy. He was as beautiful as I’d imagined. Our translator asked him which of the visitors in the office \n......", "posttime": "2020-06-20 22:49:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗马尼亚,romania,孩子", "title": "30年前，罗马尼亚剥夺了数千名婴儿与人类的接触", "title_en": "30 Years Ago, Romania Deprived Thousands of Babies of Human Contact", "transed": 1, "url": "https://www.theatlantic.com/magazine/archive/2020/07/can-an-unloved-child-learn-to-love/612253/", "via": "", "real_tags": ["罗马尼亚", "romania", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "e6ec262d823d376ab39da186043ce4fb.png", "infoid": 1007406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月前，我了解到拉兹洛·波尔加(Laszlo Polgar)，他把他的三个女儿都训练成了国际象棋特级大师。他声称，只要用他的特殊方法教任何孩子，他就能让他们成为天才。我很不高兴，因为虽然他有一本名为“提高天才”的书，但很难找到，而且只有匈利语和世界语的版本。\n许多SSC读者出资翻译了这本书，世界语翻译家戈登·蒂什勒(Gordon Tishler)挺身而出完成了这项工作。感谢所有参与其中的人。你可以在这里找到他的完整翻译：培养一个天才！\n我希望这本书能解释拉兹洛·波尔加抚养天才儿童的秘诀。它只有在非常宽泛的笔划下才能做到这一点。他似乎也没有太多保留。但看起来更像是他本身并没有什么秘密。与其他人不同的是，他做的主要事情是他在每次采访和纪录片中都谈到的事情：他从小就开始(大约在孩子三岁的时候)，近乎痴迷地专注于单一的主题，而且从来没有停止过。波尔加：\n天才教育的第一个特点--我可以说是区别于当代教育的最重要的新颖性--也是它的必要前提，就是针对某一具体领域的早期专业化。确实，荷马所说的“一个人不可能事事都是经验的或第一的”，这是真的。正因为如此，父母应该根据自己的判断选择一个特定的领域。重要的是，在3-4岁之前，应该选择一些身体或心理领域，这样孩子就可以开始他们的旅程了。\n他还有几件事要说，但它们更像是模糊的原则，而不是具体的细节。这本书的其余部分是他对天才含义的看法，他对匈牙利政府的抱怨，公立学校破坏儿童天生创造力的方式，以及各种相关的主题。\n也许这些东西值得注意一下。他花了很长时间来回应那些认为用他的方式教育孩子是不人道或不道德的人，当然这些说法需要回应。他的许多教学哲学和个人生活哲学都是在他回答这些问题的方式中体现出来的，鉴于他给出的细节很少，或许理解他更广阔的世界观是可行的。虽然很多人都在谈论公立学校是如何毁掉孩子们的思想的，但从一个把钱放在嘴边、做得更好的人的口中听到这句话总是很好的。\n但是，我们可以从这本书中收集到什么关于如何用波尔加方法教育孩子的信息呢？\n“天才加薪”最接近于具体处方的描述是，波尔加描述了在某种想象中的波尔加天才学校里的一天可能是什么样子：\n在天才教育中，教育者(无论是父母还是专业教师或导师)与孩子保持直接、持续和深入的接触是必要的。正因为如此，我们想象只有10-15名成员的团体。在实践中，儿童和成人之间必须形成一种密切的合作联系，在这种联系中，儿童不会感到“从属”。想想看，如果孩子在10岁的时候就已经知道他们知道很多，他们是一个和成年人一样有价值的人，并且在他们的生活中至少有一个领域他们掌握得和成年人一样好，或者比成年人掌握得更好，那将是多么有利的事情。\n-4个小时的专业学习(对我们来说，国际象棋)-1个小时的外语。第一年是世界语，第二年是英语，第三年是随意选择的另一种。在开始阶段，即强化语言教学阶段，有必要将学习时间增加到3个小时-代替专业学习-为期3个月。在夏天，去其他国家学习旅行。-1小时的一般学习(母语、自然科学和社会科学)-1小时的计算-1小时的道德、心理和教育学研究(以及幽默课，每小时20分钟讲笑话)-1小时的体操，自由选择，可以在校外单独完成。当然，学习时间的划分可以弹性对待。\n所有这一切都迫切需要更多的解释(特别是幽默课程听起来很吸引人)，但他真正解释的唯一部分是外语。他引用弗朗蒂舍克·马雷克的话说：“在幼儿时期学习外语是非常重要的，因为如果没有外语，一个人以后就不能自发、快速、恰当地表达自己”，我认为(尽管我可能有误解)，语言是最容易教给幼儿的东西之一，因此是让他们进入学习精神的好方法。他还认为语言很好，因为它们有明确的最终目标(流利地说)，而且在学习过程中取得了明显的进步，所以孩子们对学习它们感觉很好。他认为世界语非常适合这一点：作为一种逻辑构建的语言，它非常容易学习，而且它让孩子们相信学习是快速而容易的。然后，凭借他们的世界语知识，他们以后将能够更好地学习其他语言。我真的不确定该怎么看这件事-如果你从小说匈牙利语而不是英语，语言学习可能更重要，而且波尔加似乎是一个如此热情的世界语者，很难想象他会推荐它是出于纯粹的理性原因-但他相当坚持这一点。\n在整本书中，孩子们应该学习他们认为令人兴奋和愉快的东西，并不断取得可衡量的进步，这一想法在整本书中反复出现。这通常是在一种违反直觉的观点的背景下，有人问他“孩子们不会讨厌不得不学这么多吗？”波尔加回答说，孩子们可能不喜欢公立学校，他们经常坐在那里，永远不会觉得自己真的掌握了什么，但不会讨厌密集的天才教育，因为他们实际上觉得人们在努力让他们擅长一些事情：\n在强化教育的条件下，孩子很快就会感到有学问，感觉到独立，取得成功，很快就能独立应用他们的知识。让我们以语言学习为例。让我们假设有人去天才学校的口译班上课，他们在那里花了5-6个小时学习第一门外语，如果可能的话，那就是世界语。(确切地说，为什么使用这种语言，我将在下面澄清。)。几个月后，他们已经和其他国家的孩子通信了，他们参加了本国内外的会议-而且持续时间更长-在那里他们取得了巨大的成功，他们可以流利地用当时学到的语言交谈。这对孩子来说是一种美好的感觉吗？是的，很不错。它对孩子有用吗？是的，它很有用。它对社会有用吗？这是很有用的。在接下来的一年里，人们可以用另一门外语做同样的事情--比如说英语--在接下来的一年里，人们可以用另一门外语做同样的事情。\n同样的道理也适用于生活的任何领域。这样，孩子就会真正享受他们正在做的事情，而且他们会发现这是有意义的。在当代学校，学生们不明白他们为什么要学习。但是在天才教育学校，孩子们知道几个月后他们会说世界语，第二年讲英语，第二年讲德语等等，或者在国际象棋领域里；第一年他们会在第三级下棋，第三年在第一级，五年后成为硕士候选人，六到七年之后成为大师，八到十年之后成为国际大师，十五年之后成为特级大师。因此，孩子们看到了他们工作的目标和意义。\n有一点是肯定的：一个人永远不可能达到严肃的教育学原则。\n当然，没有动力是不可能取得巨大成功的。在5-6岁时，如果活动足够有趣，成功也能起到很强的激励作用。激励、鼓励、灌输激情和信任是非常重要的。如果父母和家教告诉孩子他们是愚蠢和坏的，孩子可能会真的相信这一点。但是，相反的情况也适用：如果我们说他们聪明能干，他们也会相信这一点。他们往往真的相信这一点，并更加努力地成为这样的人。我认为成功是非常重要的一条基本原则。当我开始这个实验的时候，我想，虽然我不会让我的女儿们避免失败，但她们仍然需要在成功的陪伴下成长。失败与成功的比例应该是1比10。\n正如阿德勒所证明的那样，成功或失败的经历极大地影响了孩子的自信或不确定性。根据P.Michel的说法，成功的经历、他人的钦佩和老师的认可，极大地刺激了进一步的行动，在很大程度上增加了孩子对自己知识和能力的信任。\n根据弗兰克的说法，失败、痛苦和恐惧会降低成就。在多次连续失败之后，甚至可能会产生破坏性的抑制复合体。随着压力的增加，行动变得更加肤浅，行为变得不那么平静。同样，在M.Juck看来，一个领域的成功会增加(而失败会降低)其他领域的抱负水平。赫尔姆的实验证明，成功的经历减少了解决后续任务所需的时间，增加了思维的弹性和概念的丰富性，而在失败之后，思维可能会出现障碍、僵化和相对的概念贫乏，解决问题的时间会增加。\n每个人都应该有极大的耐心。我们应该让孩子有成就感，但我们不应该妨碍自己(我们不应该放弃主要的棋子或棋子的优势)，因为在这种情况下，游戏的结构会改变。最好是家长或老师提供一个时间障碍，或者在游戏中编织故意的错误，这样孩子就可以自己使用这些错误。在游戏中，导师应该有意识地安排他们在黑板上的位置，以适合学生和孩子在他们这个年龄的发展。\n唤醒孩子的兴趣。孩子应该喜欢他们正在做的事情，也就是对它感兴趣。我们必须一点一点地使他们习惯于工作，在他们身上创造工作和娱乐的统一。让孩子习惯学习和工作也很重要。对于工作量来说，特别的培训是必要的。我把有组织的、与年龄相适应的工作称为积极休息。孩子的工作量应该是他们体验到的积极休息。例如，学生们必须去听他们喜欢的课程，课后感觉比以前休息得更多。如果演讲者讲课不熟练，半个小时后，他们几乎会因为无聊和疲惫而睡着。\n有很多这样的事情，总是告诫人们要确保孩子们享受密集的教育，但总是在如何做到这一点上只给出模糊的手势。我怀疑波尔加是一位天生有天赋的老师，他的女儿天生就是好奇的学生，他从来没有遇到过这方面的问题，也不指望别人会遇到这样的问题。在他关于游戏的部分中，其中一些似乎是显而易见的：\n我认为游戏是一种非常重要的现象，也许比许多把它放在台上的心理学家更重要。\n但是玩耍并不是工作的对立面。玩耍对孩子来说很重要，但玩耍也是工作的一部分。我们不应该在孩子的价值体系中将这两个因素分开；例如，如果一个孩子在一个易受影响的年龄听到“玩耍，孩子，不要工作！”这可能会导致他以后觉得工作是陌生的。相反，我认为孩子不仅喜欢玩耍，对他们来说，获取信息和解决问题也是一种享受。孩子的工作也可以是愉快的；学习也可以是愉快的，如果它足够激励人，如果它意味着不断提供适合孩子需要的问题来解决，那么学习也是如此。\n孩子需要的不是工作之外的游戏，而是有意义的行动。孩子们在婴儿期就已经喜欢做有意义的事情了。他们喜欢在游戏中解决问题，甚至是愉快的游戏。他们在活动中解决的问题越有意义，信息越丰富，他们的幸福感和成就感就越大。最后，在这个年龄段唤醒他们的快乐和美好的感觉才是最重要的。\n关于我的女儿们，我的经验是，学习给她们带来的乐趣比没有结果的游戏更多。我有一种感觉，被剥夺了信息的游戏往往只起到一个代理角色，代理行为，代理满足感。\n当我们审视那些能力出众的孩子的传记时，我们发现他们比同龄人玩得少得多，这一事实也证明了这一点。1920年，L.M.Turman在加利福尼亚州进行了深入而冗长的研究，揭示了异常聪明的儿童的游戏与他们的同龄人之间的许多不同之处。不出所料，需要精神行动的游戏对有天赋的孩子来说要有趣得多。与控制组相比，他们单独玩耍的频率略高一些。苏珊娜·米勒在她的“游戏心理学”一书中写道，有时能力异常的孩子如果没有同龄人在相同的智力水平上玩耍，可能会在与他人的游戏中遇到困难。因此，在成人阶段，我通常不会严格地将学习与娱乐分开，或将工作与爱好分开。\n在我看来，通过适当的方法可以显著增加工作量。我同意要求强化教学的教学倾向。强化教学的本质在于使用目标导向的工作量、年龄适当性、兴趣的保持以及成就和成功的生活体验。美国的G·多曼也有同样的想法。他打个比方：既然身体的不同肌肉只有通过定期训练才能发展和加强，那么大脑的能力也只有通过日常训练才能增长。缺乏有组织的逻辑思维和学习会导致智力下降，就像没有锻炼的身体部位萎缩一样。根据三十年的实践经验，多曼知道，大脑在1岁到6岁之间生长最快，几乎“毫不费力”地吸收了知识。通过游戏学习的能力在6岁以后下降，这时吸收信息变得更加困难的脑力劳动。\n当代心理学和教育学文献在某种意义上强调了同龄人群体的重要性。但在我的教学概念中，它受到的强调略有不同。在我看来，对一个孩子来说，最重要的不是有合适的同龄同伴，而是最好有精神上(精神上)合适的伴侣，与他们的智力水平相称的朋友。如果一个孩子的社会关系完全或很大程度上局限于同龄群体，这将减缓一个特别有能力的孩子的进步。\n有人说，孩子不应该和大人呆得太久，只有智力水平相差太远，如果孩子和大人的关系不合适，比如大人把一切强加给孩子，剥夺他们的独立性和主动性，这才是不利的。但是，如果他们试图正确地发展孩子的这些特征，这不是有害的，相反是有用的。关于这一点，我不想说孩子应该总是和成年人在一起。一个人必须找到与成年人和同龄人在一起的适当比例。我相信，与那些智力水平相近、兴趣相似、在这些互动中感觉良好的人一起度过他们的时间是决定性的。\nZsuzsa就是一个具体的例子：如果她在13岁时只和13岁的孩子下棋，这些孩子在许多方面比她弱，这对她来说就没有什么用处了。对于她的对手来说，在每一场比赛中都被“击倒”并不是一件好事。Zsuzsa自己不会受益，因为她需要类似水平的游戏伙伴，而这些只在成年人中才能找到。\n然而，这并不值得担心，因为年龄差异本身并不妨碍与他人建立友好关系，同时拥有好朋友和同事。而友谊往往来源于工作关系。因此，一个人的工作同时也是一种爱好。\n当然，每个人都应该把所有的东西都放到舞台上去！在教材内容和教学时长上，都要从孩子的年龄特点出发，因材施教，因材施教。起初我们应该只下半个小时的棋，过一段时间再下多一点。一周后，我们可以延长期限。起初我们只解决简单的问题，随着时间的推移，我们应该不断地发展到更复杂的问题。一个人应该让孩子多玩，但总是要有合适的伙伴，他们的游戏能力一般都是相似的。在某些情况下，他们可以变得更弱，也可以变得更强，这样孩子就可以体验到输赢的滋味。但一定要找到合适的比例。在孩提时代，他们应该玩得很快，所以他们应该玩很多闪电战和那些时间短的比赛。\n在这种情况下，年龄适当性也是非常重要的。首先要学习国王的动作。我们练习了几天，后来我们玩了“国王对国王”。任务是这样的：一位国王必须达到对手的底线，也就是说，必须到棋盘的另一边去。谁先这么做谁就赢了。如果某个国王可以站在另一个国王旁边，那么游戏就会在没有决定的情况下结束。当我们学得很好的时候，我们添加了下一个棋子，棋子。在这场比赛中，目标是一样的：到达另一边。几天后，我们加了车，然后加了骑士。\n3-4周后，我们到达了皇后。理解女王的伴侣跟随。\n..", "note_en": "A few months ago,  I learned about Laszlo Polgar, the man who trained all three of his daughters to be chess grandmasters. He claimed he could make any child a genius just by teaching them using his special methods. I was pretty upset because, although he had a book called  Raise A Genius, it was hard to find and only available in Hungarian and Esperanto.\n Many SSC readers contributed money to get the book translated, and Esperanto translator Gordon Tishler stepped up to do the job. Thanks to everyone involved. You can find his full translation here:   Raise A Genius!\n I was hoping that this book would explain Lazslo Polgar’s secrets for raising gifted children. It does so only in very broad strokes. Nor does he seem to be holding much back. But it looks more like he doesn’t really have secrets, per se. The main things he does differently from everyone else are the things he’s talked about in every interview and documentary: he starts young (around the time the child is three), focuses near-obsessively on a single subject, and never stops. Polgar:\n The first characteristic of genius education – I could say the most important novelty distinguishing it from contemporary instruction – and its necessary precondition, is early specialization directed at one concrete field. It is indeed true what Homer said, “A person cannot be experienced or first in everything.” Because of this parents should choose a specific field at their discretion. It is only important that by the age of 3-4 some physical or mental field should be chosen, and the child can set out on their voyage.\n He has a couple more things to say, but they’re more like vague principles than like specific details. The rest of the book is his opinions on the meaning of genius, his gripes about the Hungarian government, the ways public schooling destroys children’s natural creativity, and various related subjects.\n And maybe this stuff deserves some attention. He spends a long time responding to people who say it’s inhumane or immoral to educate children the way he does it, and certainly those claims need a response. A lot of his pedagogical philosophy and personal philosophy of life come out in the way he answers these questions, and given how few specifics he gives, maybe understanding his broader worldview is the way to go. And although a lot of people talk about how public school destroys children’s minds, it’s always good to hear it from the mouth of somebody who’s put his money where his mouth is and done a better job.\n But what can we glean from this book in terms of how one can educate a child in the Polgar method?\n The closest  Raise A Genius comes to anything like a specific prescription is Polgar’s description of what a day might be like in some kind of imaginary Polgar genius school:\n In genius education it is necessary that the pedagogue (whether the parents or professional teachers or tutors) stay in direct, constant and intensive contact with the child. Because of this we imagine groups of only 10-15 members. In practice an intensive collaborative contact between the child and an adult must be formed, in which the child does not feel “subordinate.” Think how advantageous it would be if the child already understands at the age of 10 that they know a great deal, that they are a person of the same value as an adult, and that in their life there is at least one field they master as well or better than adults.\n  – 4 hours of specialist study (for us, chess) – 1 hour of a foreign language. Esperanto in the first year, English in the second, and another chosen at will in the third. At the stage of beginning, that is, intensive language instruction, it is necessary to increase the study hours to 3 – in place of the specialist study – for 3 months. In summer, study trips to other countries. – 1 hour of general study (native language, natural science and social studies) – 1 hour of computing – 1 hour of moral, psychological, and pedagogical studies (humor lessons as well, with 20 minutes every hour for joke telling) – 1 hour of gymnastics, freely chosen, which can be accomplished individually outside school. The division of study hours can of course be treated elastically.\n All of this cries out for more explanation (in particular, the humor lessons sound fascinating), but the only part he really explains is the foreign language. He quotes Frantishek Marek: “Learning foreign languages in early childhood is very important, because without that a person cannot later express themself spontaneously, rapidly, and appropriately”, and I think suggests (though I might be misunderstanding) that languages are one of the easiest things to teach young children, and so a good way to get them into the spirit of learning things. He also thinks languages are nice because they have a defined end-goal (speaking fluently) and obvious progress along the way, so children feel good about learning them. He argues Esperanto is perfect for this: as a logical constructed language, it’s very easy to learn, and it convinces children that learning is fast and easy. Then with their Esperanto knowledge they’ll be much better able to pick up other languages later on. I’m not really sure what to think of this – language learning might be more important if you grow up speaking Hungarian rather than English, and Polgar seems so enthusiastic an Esperantist that it’s hard to picture him recommending it for purely rational reasons – but he’s quite insistent on it.\n This idea that children should learn things they find exciting and enjoyable – and where they keep making measurable progress – recurs throughout the book. Often it’s in the context of a kind of counterintuitive point, where someone asks him “Won’t kids hate having to learn so much?” and Polgar answers that kids may hate public school, where they sit around a lot and never feel like they’re really mastering anything, but won’t hate intensive genius education, where they actually feel like people are trying to make them good at things:\n In conditions of intensive instruction a child will soon feel knowledgeable, perceive independence, achieve success, and shortly become capable of independently applying their knowledge. Let us take an example from language learning. Let us suppose that someone visits a class for interpreters at a school for geniuses, where they are occupied for 5-6 hours with a first foreign language, Esperanto if possible. (Why precisely with this language I will clarify below.) After some months they are already corresponding with children in other countries, they participate in meetings in and outside of their country – and longer-lasting – where they experience serious successes, and they converse fluently in the language they have learned by then. Is this a nice feeling for a child? Yes, it is nice. Is it useful for the child? Yes, it is useful. Is it useful for society? It is useful. In the following year one can do the same with another foreign language – let us say English – and in the year after that another.\n The same is valid for any field of life. In this way a child really enjoys what they are doing, and they see that it makes sense. In contemporary schools students do not understand why they are learning. But in genius-education schools the children know that after a few months they will speak Esperanto, in the following year English, in the following year German, etc. Or in the field of chess; in the first year they play at level 3, after the third year at level 1, after five years as a master candidate, after 6-7 years as a master, after 8-10 years as an international master, and after the 15th year as a grandmaster. So the child sees the goal and meaning of their work.\n  One thing is certain: one can never achieve serious pedagogical results, especially at a high level, through coercion. One can teach chess only by means of love and the love of the game. If I may advise: one should make sure that before everything the father or mother should not diminish the child’s habit of chess playing by too much severity. We should make sure not to always win against the child; we should let them win sometimes so that they feel that they also are capable of thinking. In this way we should bring them to a feeling of success.\n  At the start it is most important to awake interest. We should make the child aware that who learns this knows this. And chess is learnable. If we educate the child such that they can be a partner, can accept, create, and initiate, then we can always entrust them with more independent tasks. We should get the child to love what they do – to such a degree that they do it almost obsessively. The Hungarian psychologist Tamas Vekerdy warns of the same thing, that infants more easily master things that awake and draw their interest, their attention. And even at the beginning, the child should feel joy. We should not be angry, if they jump around here and there during a chess game; indeed, it is a known fact in psychology that even though a child might frolic aimlessly because of their age-appropriate character, their thoughts can still stay on the task. We should not tell them everything; we should try to get the child themself to say something! We should not ourselves make all the moves; we should try to get the child themself to make the moves! This is the so-called Socratic method, and the essence of instruction in problem-solving – projected onto chess.\n Of course great success is not achievable without motivation. At the age of 5-6, if the activity is sufficiently interesting, success can also function as a strong incentive. Stimulation, encouragement, and instilling passion and trust are very important. If the parents and tutors tell the child that they are foolish and bad, the child will probably truly believe this. But the opposite also applies: if we say that they are clever and skillful, they will believe that as well. They often truly believe that, and try harder to actually become so. I consider it a basic principle that success is extraordinarily important. When I began the experiment, I thought that although I would not let my daughters avoid failure, they would nevertheless need to grow up accompanied by success. The proportion of failure to success should be 1 to 10.\n  The experience of success or failure, as Adler demonstrates, greatly influences the self-confidence – or uncertainty – of the child. According to P. Michel as well, the experience of success, the admiration of others, and the recognition of teachers, significantly stimulates further action, increases the trust of the child in their knowledge and ability to a high degree.\n According to Frank, failure, suffering, and fearfulness decrease achievement. Following a number of successive failures, even a damaging inhibitory complex can be created. With an increase in stress, action becomes more superficial and behavior less calm. Similarly, in the opinion of M. Juck, success experienced in one area increases (and failure decreases) the level of aspiration in other areas. Helm’s experiments prove that experience of success decreases the time necessary for solving later tasks, and increases the elasticity and ideational richness of the mind, while following failure there can be hindrances, rigidity, and relative ideational poverty in thinking, and problem-solving time increases.\n  One should have great patience. We should let the child arrive at a sense of success, but we should not handicap ourselves (we should not give up major pieces or an advantage in pawns), because in that case the structure of the game changes. Preferably the parents or teachers should provide a temporal handicap, or weave intentional mistakes into the game, so that the child can use them for themself. During the game the tutor should organize their position on the board intentionally as is appropriate for the student and the development of the child at their age.\n  To awaken the child’s interest. The child should like what they are occupied with, that is, be interested in it. One must little by little accustom them to the work and create in them the unification of work and play. It is important as well that the child become accustomed to learning and working. Particular training is necessary for the workload. I call well-organized and age-appropriate work active rest. A child’s workload should be such that they experience it as active rest. Students, for example, who must attend lectures which they then enjoy, feel more rested afterwards than before. And if the speaker lectures inexpertly, they almost fall asleep from boredom and fatigue after half an hour.\n There’s a lot of this, always exhorting people to make sure children enjoy being intensively educated, but always giving only vague gestures on how to do it. I suspect Polgar was a naturally gifted teacher, and his daughters naturally curious students, and that he never really encountered problems in this regard and doesn’t expect other people to either. Some of this seems apparent in his section on play:\n I think of play as a very important phenomenon, perhaps more important than do many of those psychologists who put it on a pedestal.\n But play is not the opposite of work. Play is very important for a child, but in play there is an element of work. One should not separate these two factors in a child’s value system; if for example a child hears at an impressionable age, “Play, son, don’t work!” this can later result in him feeling that work is alien. On the contrary, it is my opinion that a child does not like only play: for them it is also enjoyable to acquire information and solve problems. A child’s work can also be enjoyable; so can learning, if it is sufficiently motivating, and if it means a constant supply of problems to solve that are appropriate for the level of the child’s needs.\n A child does not need play separate from work, but meaningful action. Children already enjoy doing meaningful things in infancy. They like solving problems during play, even pleasurable play. The more meaningful and information-rich the problems they solve during their activities, the greater is their enjoyment and sense of success. In the end it is most important at this age to awaken enjoyment and good feelings in them.\n Regarding my daughters, it is my experience that learning presents them with more enjoyment than a sterile game. I have the feeling that play deprived of information often plays only a surrogate role, of surrogate action, of surrogate satisfaction.\n This is proven also by the fact that when we examine the biographies of exceptionally capable children, we find that they played much less than their peers. The profound and lengthy research of L. M. Turman in California in 1920 uncovered many differences between the play of unusually capable children and their peers. As expected, play that demanded mental action was much more interesting to the talented children. They played alone somewhat more often, compared to the control group. Susanna Millar writes in her book Psychology of Play that sometimes unusually capable children who lack peers at the same intellectual level can have difficulties in play with others. Thus I generally do not rigidly separate learning from play, or work from hobbies at an adult level.\n From my point of view, workloads could be measurably increased by appropriate methods. I agree with the pedagogical tendency to ask for intensive instruction. The essence of intensive instruction lies really in using goal-directed workloads, age-appropriateness, the holding of interest, and the lived experience of achievement and success. The American G Doman thinks the same. In his analogy: as the different muscles of the body can be developed and strengthened only by regular training, so also the capabilities of the brain can only grow by means of daily training. The lack of structured logical thought and learning causes a decrease in intelligence, just as un-exercised body parts atrophy. Doman knows, on the basis of three decades of practical experience, that the brain grows most rapidly between the ages of 1 and 6, and it almost “effortlessly” assimilates knowledge. The ability to learn by play decreases after 6 years of age, when assimilation of information becomes more difficult mental work.\n  The contemporary psychological and pedagogical literature emphasizes in one sense the importance of the peer group. But in my pedagogical concept it receives a slightly different emphasis. According to me, it is not primarily important for a child to have suitable companions of the same age, but preferably to have spiritually (mentally) appropriate partners, friends worthy of the level of their intellectual capabilities. If the social relationships of a child are exclusively or for the most part limited to groups of the same age, this will slow the progress of an exceptionally capable child.\n [Some say that children should not spend too long with adults, but this] is disadvantageous only if the intellectual level is too different, and if the relationship between child and adult is not suitable, for example, if the adult imposes everything on the child so they take away their independence and initiative. But if they try to correctly develop these traits in the child, it is not damaging, but on the contrary is useful. About this I do not want to say that a child should always be in the company of adults. One must find the right proportion of being with adults and peers. I believe that passing their time in the company of those who have a similar level of intellect and similar interests and sense this well in these interactions is decisive.\n Zsuzsa is a concrete example: if at the age of 13 she had played chess only with 13-year-olds, who were weaker than her in many categories, this would have been less than useful for her. And for her opponents it would not have been nice to be “knocked out” in every match. Zsuzsa herself would not have profited, because she needed playing partners at a similar level, and those were found only among adults.\n However, this was not a cause for concern, as the age difference itself did not prevent friendly relationships with others, and having good friends and colleagues at the same time. And friendship often flowed from work relationships. Thus one’s work is at the same time a hobby.\n  Of course, one should make everything appropriate to the stage! With regard to the content of instructional materials and also the duration of instruction, one should start from the traits of the age of the child, and tailor the tasks for the optimum ability of the child. At first we should only play chess for half an hour; after some time a bit more. After a week we can extend the duration. At first we should solve only simple problems, and with the passing of time we should always progress to more complicated ones. One should get the child to play a great deal, but always with suitable partners, who have a generally similar playing ability. On some occasions they can be weaker, on some stronger, so that the child experiences what winning and losing are like. But one must certainly find the right proportion. In childhood they should play rapidly, so they should play many blitz matches and those with a short time limit.\n  In this case age-appropriateness is also very important. First one should learn the movements of the king. We practiced this for several days, and later we play “king against king.” The task is this: one king must reach the opponent’s baseline, that is, one must go to the other side of the board. Whoever does this first wins. If some king can stand next the other, then the game ends without a decision. When we had learned this well, we added the next piece, the pawn. In this game the goal was the same: to get to the other side. After several days we added the rook, then the knight.\n After 3-4 weeks we arrived at the queen. Understanding the queen’s mate followe\n......", "posttime": "2020-06-20 22:30:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "培养,review,孩子", "title": "书评：培养天才(2017)", "title_en": "Book Review: Raise a Genius (2017)", "transed": 1, "url": "https://slatestarcodex.com/2017/07/31/book-review-raise-a-genius/", "via": "", "real_tags": ["培养", "review", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站允许您订阅本身不支持RSS的网站的RSS提要，方法是使用相应网站的API，然后将数据转换为RSS提要。\n如果您收到一个页面显示&#34；应用程序错误&#34；，只需再试一次。本网站解析短链接URL以给读者更好的体验，并将链接内容直接嵌入到RSS提要中。如果这花费的时间超过Web服务器允许的时间，您将收到此错误。\n有些网站，比如YouTube，支持RSS提要，但是很难找到，所以这个网站会提供URL。\n重要提示：请不要使此服务过载。不要提出超过你需要的要求。如果您需要经常更新的RSS订阅源，请在您自己的基础设施上托管该应用程序。此免费服务的托管资源非常有限。如果您使用该服务的方式降低了他人的体验，那么我将开始阻止您的请求。请负起责任，让尽可能多的人享受到这项免费服务。\n我免费提供这项服务。如果你觉得有用，请捐款。非常感谢各位的支持！", "note_en": "This website lets you subscribe to RSS feeds for websites that do not support RSS themselves, by using the respective website&#39;s API and then translating that data to RSS feeds.\n  If you get a page saying &#34;Application error&#34;, simply try again. This website resolves shortlink URLs to give the reader a better experience, and embeds linked content directly into the RSS feed. You will get this error if this takes longer than the web server allows.\n  Some websites, like YouTube, support RSS feeds but they are quite hard to find, so this website will provide the URL.\n      Important: Please do not overload this service. Do not make more requests than you need. If you require RSS feeds that are updated very frequently, then please host the app on your own infrastructure. The hosting for this free offering has very limited resources. If you use the service in a way that degrades the experience for others, then I will start blocking your requests. Please be responsible so that as many people as possible can enjoy this free service.\n    I provide this service free of charge. If you find it useful, please make a donation. I greatly appreciate any support!", "posttime": "2020-06-20 22:10:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rss,网站", "title": "RSS Box-用于不支持RSS的网站的RSS", "title_en": "RSS Box – RSS for websites that do not support RSS", "transed": 1, "url": "https://rssbox.herokuapp.com/", "via": "", "real_tags": ["rss", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从表面上看，我们似乎只是在谈论基于文本的文件，只包含英文字母表中的字母(偶尔还有标点符号)。当然，更深入地观察，情况并非如此。这个网站提供的是对作家和艺术家的历史的一瞥，这些作家和艺术家受到美国信息交换标准码(ASCII)允许的128个字符的约束。重点放在1980年代中期的文本文件和当时的世界，但即使是这些文件有时也是20世纪60年代和70年代的作品，这种文化的分支一直存在到今天。", "note_en": "On the face of things, we seem to be merely talking about text-based files, containing only the letters of the English Alphabet (and the occasional punctuation mark).  On deeper inspection, of course, this isn&#39;t quite the case. What this site offers is a glimpse into the history of writers and artists bound by the 128 characters that the American Standard Code for Information Interchange (ASCII) allowed them. The focus is on mid-1980&#39;s textfiles and the world as it was then, but even these files are sometime retooled 1960s and 1970s works, and offshoots of this culture exist to this day.", "posttime": "2020-06-20 21:33:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "usenet,英文", "title": "BBS和Usenet era文本文件", "title_en": "BBS and Usenet era Textfiles", "transed": 1, "url": "http://textfiles.com/", "via": "", "real_tags": ["usenet", "英文"]}, {"category": "", "categoryclass": "", "imagename": "4b7d9ecba1881eda1176c27aaa7da297.png", "infoid": 1007403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Alex是ML增强的范围索引，在功能上类似于B+树。我们的实现几乎是std：：map或std：：multimmap的临时替代品。您可以在我们的SIGMOD 2020文章中了解有关Alex的更多信息。\nAlex可用作仅限标头的库。所有相关的标头文件都在src/core中。在此存储库中，我们包括三个您可以编译和运行的程序：\n一个简单的基准测试，用于测量Alex上运行点查找和插入的吞吐量(下面将详细说明)。\n在Windows上，只需将此存储库作为CMake项目加载到Visual Studio中即可。在Linux/Mac上，使用以下命令：\n#使用CMake构建，这将创建一个新的构建目录。/build.sh#运行示例程序。/build/example#运行单元测试。/build/test_alex。\n但是，要观察Alex的真实性能，我们必须在更大的数据集上运行。您可以从Google Drive下载200M密钥(1.6 GB)的数据集。要在此数据集上运行一个工作负载示例：\n您还可以在您自己的数据集上运行此基准测试。您的键需要为二进制格式或文本格式(每行一个键)。如果键的数据类型不是DOUBLE，则需要在src/Benchmark/main.cpp中将#DEFINE KEY_TYPE DOUBLE修改为#DEFINE KEY_TYPE[您的数据类型]。\n与B+树一样，ALEX是一种索引排序数据的数据结构，并支持混合了点查找、短范围查询、插入、更新和删除的工作负载。在内部，ALEX使用分层组织成树的线性回归集合来模拟键的分布。ALEX使用此模型按键高效地搜索数据记录。ALEX还自动调整其内部模型和树结构，以有效地支持写入。\nAlex的灵感来自于Kraska等人的原始学习索引。然而，该工作只支持读取(即，点查找和范围查询)，而Alex还有效地支持写入(即，插入、更新和删除)。\n在只读工作负载上，Alex超过了Kraska等人最初学习到的索引。性能提高高达2.2倍，索引大小最多减小15倍。\n在各种读写工作负载中，Alex最多可将B+树(由STX B+Tree实施)的性能提高4.1倍，同时将索引大小降低2000倍。\nAlex目前在内存、单线程和数字键上操作，我们正在考虑如何向Alex添加对持久性、并发性和字符串键的支持。\nAlex的前提是使用一组线性回归对密钥分布进行建模，因此，当密钥分布很难用线性回归建模时，即密钥分布在小范围内高度非线性时，Alex的性能较差，未来可能的研究方向是使用更广泛的建模技术(例如，也考虑多项式回归模型)。\nAlex在存在极端异常值的情况下性能可能很差，这可能会导致键域和Alex的树深度变得不必要地大(请参阅本文的第5.1节)。未来可能的研究方向是添加特殊的逻辑来处理极端异常值，或者采用对稀疏密钥空间具有健壮性的建模策略。\nAlex是同时支持AlexMap和AlexMultimap的内部实现。它提供了稍微多一点的功能。\n键和有效负载(即映射的类型)是分开存储的，因此取消引用迭代器将返回键/有效负载对的副本，而不是返回引用。我们的迭代器具有直接分别返回对键或有效负载的引用的方法。\n目前我们只支持数字键类型，不支持任意的自定义键类型，所以不能更改类模板中的默认比较函数。\n这个项目欢迎大家提供意见和建议。大多数投稿需要您同意贡献者许可协议(CLA)，声明您有权并且实际上确实授予我们使用您的投稿的权利。欲了解详情，请访问https://cla.opensource.microsoft.com.。\n当您提交Pull请求时，CLA机器人将自动确定您是否需要提供CLA并适当地装饰PR(例如，状态检查、评论)。只需按照机器人提供的说明操作即可。使用我们的CLA，您只需在所有报告中执行此操作一次。\n此项目已采用Microsoft开放源代码准则。有关更多信息，请参阅行为准则常见问题解答，或联系opencode@microsoft.com提出任何其他问题或意见。", "note_en": "ALEX is a ML-enhanced range index, similar in functionality to a B+ Tree.Our implementation is a near drop-in replacement for std::map or std::multimap.You can learn more about ALEX in our  SIGMOD 2020 paper.\n    ALEX can be used as a header-only library.All relevant header files are found in  src/core.In this repository, we include three programs that you can compile and run:\n A  simple benchmark that measures the throughput of running point lookups and inserts on ALEX (explained in detail below).\n On Windows, simply load this repository into Visual Studio as a CMake project.On Linux/Mac, use the following commands:\n # Build using CMake, which creates a new build directory./build.sh# Run example program./build/example# Run unit tests./build/test_alex\n   However, to observe the true performance of ALEX, we must run on a much larger dataset.You can download a 200M-key (1.6GB) dataset from  Google Drive.To run one example workload on this dataset:\n  You can also run this benchmark on your own dataset.Your keys will need to be in either binary format or text format (one key per line).If the data type of your keys is not  double, you will need to modify  #define KEY_TYPE double to #define KEY_TYPE [your data type] in  src/benchmark/main.cpp.\n  Like the B+ Tree, ALEX is a data structure that indexes sorted data and supports workloads that contain a mix of point lookups, short range queries, inserts, updates, and deletes.Internally, ALEX uses a collection of linear regressions, organized hierarchically into a tree, to model the distribution of keys.ALEX uses this model to efficiently search for data records by their key.ALEX also automatically adapts its internal models and tree structure to efficiently support writes.\n ALEX is inspired by the  original learned index from Kraska et al..However, that work only supports reads (i.e., point lookups and range queries), while ALEX also efficiently supports write (i.e., inserts, updates, and deletes).\n  On read-only workloads, ALEX beats the  original learned index from Kraska et al. byup to 2.2X on performance with up to 15X smaller index size.\n Across the spectrum of read-write workloads, ALEX beatsB+ Trees (implemented by  STX B+ Tree) by up to 4.1X while never performing worse, withup to 2000X smaller index size.\n   ALEX currently operates in memory, single threaded, and on numerical keys.We are considering ways to add support for persistence, concurrency, and string keys to ALEX.\n  The premise of ALEX is to model the key distribution using a collection of linear regressions.Therefore, ALEX performs poorly when the key distribution is difficult to model with linear regressions, i.e., when the key distribution is highly nonlinear at small scales.A possible future research direction is to use a broader class of modeling techniques (e.g., also consider polynomial regression models).\n ALEX can have poor performance in the presence of extreme outlier keys, which can cause the key domain and ALEX&#39;s tree depth to become unnecessarily large(see Section 5.1 of  our paper).A possible future research direction is to add special logic for handling extreme outliers, or to have a modeling strategy that is robust to sparse key spaces.\n   Alex is the internal implementation that supports both AlexMap and AlexMultimap. It exposes slightly more functionality.\n  Keys and payloads (i.e., the mapped type) are stored separately, so dereferencing an iterator returns a copy of the key/payload pair, not return a reference.Our iterators have methods to directly return references to the key or payload individually.\n  Currently, we only support numerical key types.We do not support arbitrary user-defined key types.As a result, you should not change the default comparison function in the class template.\n   This project welcomes contributions and suggestions. Most contributions require you to agree to aContributor License Agreement (CLA) declaring that you have the right to, and actually do, grant usthe rights to use your contribution. For details, visit  https://cla.opensource.microsoft.com.\n When you submit a pull request, a CLA bot will automatically determine whether you need to providea CLA and decorate the PR appropriately (e.g., status check, comment). Simply follow the instructionsprovided by the bot. You will only need to do this once across all repos using our CLA.\n  This project has adopted the  Microsoft Open Source Code of Conduct.For more information see the  Code of Conduct FAQ orcontact  opencode@microsoft.com with any additional questions or comments.", "posttime": "2020-06-20 21:12:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ml,alex", "title": "Alex：ML增强的范围索引", "title_en": "Alex: A ML-enhanced range index", "transed": 1, "url": "https://github.com/microsoft/ALEX", "via": "", "real_tags": ["ml", "alex"]}, {"category": "", "categoryclass": "", "imagename": "2f3112e6dace0baf123c39880d249c24.jpg", "infoid": 1007402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科罗拉多州周五通过了一项全面的警察改革法案，其中包括禁止勒脖子，如果警察被判侵犯公民权利，他们将承担个人责任。根据科罗拉多州ACLU的说法，科罗拉多州是首批允许警察对民事不当行为诉讼承担经济责任的州之一。\n据哥伦比亚广播公司丹佛(CBS Denver)报道，州长贾里德·波利斯(Jared Polis)于周五上午签署了这项法案，授权如下：\n警察必须报告他们拦截怀疑犯罪的人的每一次事件；他们还必须包括该人的种族、性别和民族。\n如果警官被判侵犯个人民事权利的罪名成立，他们个人将承担最高25,000美元的损害赔偿责任。\n根据这项法案，警官可以关闭随身相机，以避免记录与案件无关的个人信息，或者如果他们正在卧底或执行无关的任务。当事件有很长的休息时间时，以及在行政、战术和管理讨论中，他们也可以关掉相机。\n法案称，如果警察不遵守这些规则，他们可能会受到刑事责任和法律处罚，并将面临纪律处分，包括解雇。故意不打开或篡改相机的警官将被吊销至少一年的证书。\n该法案还规定，警方在诉诸武力之前，应尽可能使用非暴力手段。有关使用武力的规定对在监狱、监狱或教养机构工作的警官不那么严格。\n该法案还规定，有条件的豁免权不是责任的抗辩理由，阻止一种在全国范围内普遍存在的做法。科罗拉多州的美国公民自由联盟(ACLU)在推特上表示，科罗拉多州是美国首批结束有条件豁免权的州之一。\n‼️Breaking‼️：@govofco已经签署#sb217成为法律。科罗拉多州成为美国首批结束有条件豁免权的州之一，这是这项历史性的全面警察问责法案的一部分。pic.twitter.com/ZHCKRpSaGL。\n-科罗拉多州ACLU(@ACLUofColorado)2020年6月19日。\n许多人认为，有条件的豁免权可以保护警察在民事诉讼中免除经济责任，从而导致过度使用武力。\n路透社(Reuters)在一项针对这种做法的全面调查中表示，警察可以利用合格豁免权作为盾牌，除非有证据表明他们过度使用武力违反了第四修正案，并且知道他们违反了明确确立的法律。根据最高法院的说法，明确制定的法律指的是以前类似的警察行为被指定为非法的案件。\n路透社分析了2015年至2019年上诉法院符合条件的豁免案件。在警方被控过度使用武力的252起案件中，超过一半的案件中，法院给予警方有资格的豁免权。他们还发现了数十起案件，在这些案件中，这种豁免权保护了涉嫌从事非法不当行为的警察。\n昨天，#SCOTUS拒绝审理八个不同的案件，这些案件提供了重新考虑其#有限制的社区理论的机会。https://t.co/FifZ8mbgL2。\n-司法研究所(@ij)2020年6月16日。\n据司法研究所(Institute For Justice)称，周一，最高法院拒绝了八起提供重新考虑合格豁免权的机会的案件。\n在一份新的新闻稿中，该研究所表示，在实践中，有条件的豁免权意味着，只有当联邦上诉法院或美国最高法院已经裁定某人在完全相同的情况下从事完全相同的行为违反宪法时，政府官员才能承担责任。\n司法研究所的律师安雅·比德韦尔说，有条件的豁免权意味着，只要政府官员侵犯了你的权利，他们就可以逍遥法外，只要他们以前所未有的方式侵犯了你的权利。这意味着最恶劣的虐待行为往往是没有人能承担责任的。", "note_en": "Colorado passed a sweeping police reform bill on Friday that, among other reforms, bans chokeholds and makes officers personally liable if they are found guilty of violating a person&#39;s civil rights. Colorado is one of the first states that will allow police officers to be financially liable for civil misconduct suits, according to the state&#39;s ACLU.\n  The bill, signed by Governor Jared Polis on Friday morning, mandates the following, according to  CBS Denver:\n Police must report every instance in which they stop someone who they suspect of a crime; they must also include that person&#39;s race, gender, and ethnicity\n  Officers can be held personally liable for damages up to $25,000 if they are found guilty of violating an individual&#39;s civil rights\n Officers can turn off body cameras &#34;to avoid recording personal information that is not case related,&#34; or if they are working undercover or are on an unrelated assignment, according to the  bill. They may also turn off their camera &#34;when there is a long break in the incident; and in administrative, tactical, and management discussions.&#34;\n  If officers do not follow these rules, they may be subject to criminal liability and penalty under the law, and will face discipline &#34;up to and including termination,&#34; the bill says. Officers who intentionally don&#39;t turn on or tamper with their camera will lose their certification for at least one year.\n The bill also states that police should &#34;apply nonviolent means, when possible, before resorting to the use of physical force.&#34; The rules on the use of physical force are less stringent for officers who work in jails, prisons, or correctional institutions.\n The bill also states that &#34;qualified immunity is not a defense to liability,&#34; blocking a practice that is common nationwide. The American Civil Liberties Union (ACLU) of Colorado tweeted that Colorado is one of the first states in the country to end qualified immunity.\n ‼️BREAKING‼️:  @GovofCO has signed  #SB217 into law. Colorado becomes one of the first states in the country to END qualified immunity as part of this historic comprehensive police accountability bill.  pic.twitter.com/ZHCKRpSaGL\n— ACLU of Colorado (@ACLUofColorado)  June 19, 2020\n Many have argued that qualified immunity, which protects police officers from financial liability in civil suits, enables excessive force.\n  Officers can use qualified immunity as a shield unless evidence shows that they violated the fourth amendment by using excessive force, and knew they were breaking &#34;clearly established&#34; law, Reuters said in a  comprehensive investigation into the practice. Clearly established law, according to the Supreme Court, refers to prior cases in which similar police actions were designated as illegal.\n Reuters analyzed qualified immunity cases in appellate courts from 2015 to 2019. In more than half of the 252 cases where police were accused of using excessive force, the courts granted police qualified immunity. They also found dozens of cases in which this immunity protected police who had allegedly engaged in unlawful misconduct.\n Yesterday,  #SCOTUS refused to hear eight separate cases that had presented opportunities to reconsider its doctrine of  #qualifiedimmunity.  https://t.co/FifZ8mbgL2\n— Institute for Justice (@IJ)  June 16, 2020\n On Monday, the Supreme Court refused eight cases that presented opportunities to reconsider qualified immunity, according to the Institute for Justice.\n In a  press release, the Institute said that in practice, qualified immunity &#34;means that government officials can only be held liable if a federal court of appeals or the U.S. Supreme Court has already held that someone violated the Constitution by engaging in precisely the same conduct under precisely the same circumstances.&#34;\n  &#34;Qualified immunity means that government officials can get away with violating your rights as long as they violated them in a way nobody thought of before,&#34; said Institute for Justice attorney Anya Bidwell. &#34;And that means that the most egregious abuses are frequently the ones for which no one can be held to account.&#34;", "posttime": "2020-06-20 20:52:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全面,passes,警察", "title": "科罗拉多州通过全面警察改革法案-CBS新闻", "title_en": "Colorado passes sweeping police reform bill – CBS News", "transed": 1, "url": "https://www.cbsnews.com/news/colorado-passes-sweeping-police-reform-bill/", "via": "", "real_tags": ["全面", "passes", "警察"]}, {"category": "", "categoryclass": "", "imagename": "e4675008ce408df25e6c45c58ced9336.jpg", "infoid": 1007401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年年底，当彭博社(Bloomberg)从大西洋媒体(Atlantic Media)手中收购CityLab时，该公司表示，CityLab暂时将继续作为一个独立的网站。CityLab是一家报道公共政策、城市研究和城市生活的交叉点。\n然而，没有人预料到CityLab会毫发无损，周四，彭博社(Bloomberg)重新启动了CityLab，留下了一些明显的指纹。新的彭博城市实验室现在位于bloomberg.com/CityLab，带有重新设计的品牌、标识和连接到其他彭博垂直网站和公司数据终端的菜单。CityLab的内容很快就会出现在彭博社的平台上，包括“商业周刊”杂志、电视、广播、视频，以及(大概是在大流行后)现场直播活动。\n在重新发布时，该网站推出了一系列自制的、读者提交的地图，展示了冠状病毒是如何“重新映射”我们的世界的，一个可以追溯到罗德尼·金(Rodney King)以来反对警察暴行的抗议活动的时间表，以及一个关于未来交通运输的丰富的数据可视化功能。这一话题组合提醒读者，不必是书呆子，就能看到一个城市的政策如何在其大都市以外产生深远影响。\n彭博传媒(Bloomberg Media)首席产品官朱莉娅·贝泽(Julia Beizer)表示，彭博之所以被CityLab吸引，是因为她所说的“为好奇的人提供智能内容”的精神。CityLab是十年来的第一次还是第二次收购，这取决于谁在算计。\nBeizer说：“随着我们的扩张和订阅业务的增长，我们正在寻找能够触及更广泛受众群体、与我们最擅长的业务密切相关的内容，这就是全球业务。”“当(CityLab)出现的时候，它感觉像是一个甜蜜点，因为城市对经济及其运作方式非常关键。”\n桑达格说：“在网络上，我们越来越关注不同类型的垂直市场，它们本质上就是‘X的未来’。”“对于医疗保健的未来，我们有预见性。零售业的未来，我们要结账了。从本质上讲，绿色是世界的未来。而城市实验室就是城市的未来。“。\n彭博社城市实验室(Bloomberg CityLab)的新任执行主编詹妮弗·桑达格(Jennifer Sondag)在给读者的介绍性信息中写道，城市实验室的内容(包括档案)将保持非付费状态-至少到2020年。(该网站偶尔会刊登彭博新闻(Bloomberg News)其他季度的付费文章。)。她还做出了其他保证：\n那么，有什么没有改变呢？几乎所有其他的东西。我们的读者仍然是我们工作的核心。我们将继续书写我们如何生活和工作，我们如何创造和制定政策，我们面临哪些挑战，以及正在尝试哪些新的解决方案。\n桑达格在这个媒体时代有点不同寻常，因为她整个20年的职业生涯都是在一家公司彭博(Bloomberg)度过的。她在彭博社担任了六年的标准和培训编辑，现在正在过渡到CityLab的最高职位。(她被列为彭博之道(Bloomberg Way)的合著者，这是一本混合风格的指南，也是为具有半邪教地位的彭博记者编写的文化手册。)。她形容CityLab的观众是“非常公民参与的”，包括大量参与当地政府和城市规划的读者，“他们非常了解这些问题”。\n随着彭博社(Bloomberg)寻求将CityLab打造成自己的公司，现有的受众-投资并了解政策-可能会被证明是一把双刃剑。举个例子？重新发布的新闻稿强调了与现代汽车公司(Hyundai Motor Company)的“合作伙伴关系”，即“独家赞助与彭博媒体工作室(Bloomberg Media Studios)合作创建的多平台地图实验室(MapLab)、定制内容和集成”，并援引该汽车公司执行副总裁的话说，该公司致力于“创新城市移动解决方案，以振兴以人为本的未来城市”。\nBeizer强调，现代汽车的赞助不会影响编辑产出，但很难不认为汽车公司的赞助与CityLab普通读者对城市未来的看法有些脱节。正如约书亚·本顿(Joshua Benton)所说(预言？)。当彭博社(Bloomberg)去年收购该网站时，“CityLab有一个相对较小但异常热情的粉丝群体(他们要么乘坐公共交通，要么骑自行车上班)，他们中的一些人似乎对新的所有者感到紧张。”\n桑达格说，她的新闻编辑部分散在美国各地(纽约、旧金山、匹兹堡、哥伦比亚特区和明尼阿波利斯)，外加欧洲的两名员工。她还期待着从彭博社记者那里获得来自彭博社记者的提示和当地专业知识，这些记者分布在该公司的120多个分社-几乎都位于全球各地的城市。\nSondag和Beizer都表示，他们认为彭博处于有利地位，可以制作更多CityLab读者喜欢看到和分享的地图和数据可视化。\n“从数字战略的角度来看，我们知道data viz是对(彭博的)用户和订户基础至关重要的关键公用事业之一，”Beizer说。“从我个人的角度来看，我认为讲故事的方式太多了，从古腾堡开始，我们新闻业的人就一直在做长长的文字专栏。我认为地图和其他类型的数据非常棒，因为我们可以用新的方式讲述故事。“。\n除了在新网站上升级为视觉密集型垂直版面的时事通讯MapLab外，CityLab还重新推出了一系列名为CityLab大学和透视(CityLab University And透视)的讲解员，这些讲解员利用了专家的观点和当地(主要是自由撰稿人)的账户。\n现有的解决方案部分-Sondag表示，它构成了CityLab内容的大部分-将继续报道在各个城市尝试和测试的政策。\n彭博城市实验室简介。了解城市的运作方式、面临的挑战以及需要的解决方案。\n今天发布的@CityLab为您带来了有关产生全球影响的当地故事的报道、地图和数据。查看[线程]https://t.co/FgoqhO0YIA pic.twitter.com/xM2tda3zxi-Bloomberg(@business)2020年6月18日。\n早上好，美丽的推特上的人们，@mslurabliss，@mariepastora和我一起研究了在冠状病毒感染的前六个月里，城市交通是如何改变和重新想象的，以下是我们通过@bizWeek Graphics和@CityLab：https://t.co/wrveJUPzWC pic.twitter.com/iLixuEoch发现的", "note_en": "When Bloomberg acquired  CityLab — which reports from the intersection of public policy, urban studies, and city living — from Atlantic Media at the end of last year, the company said CityLab  would continue as a standalone site for the time being.\n No one expected that CityLab would remain untouched, though, and on Thursday, Bloomberg relaunched CityLab with a few visible fingerprints. The new Bloomberg CityLab now lives at  bloomberg.com/citylab with newly redesigned branding, logos, and a menu linking to other Bloomberg verticals and the company’s data terminal. CityLab content will soon appear across Bloomberg platforms, including Businessweek magazine, TV, radio, videos, and (presumably virtually, until we’re post-pandemic) live events.\n At relaunch, the site led with a series of homemade, reader-submitted maps showing  how coronavirus has “remapped” our worlds, a timeline of  protests against police brutality dating back to Rodney King, and a  data visualization-rich feature on the future of transportation. The topical mix was a reminder that readers don’t have to be wonks to see how a city’s policies can reverberate far beyond its own metropolis.\n Julia Beizer, Bloomberg Media’s chief product officer, said Bloomberg was attracted to CityLab — its  first or  second acquisition in a decade, depending on who’s counting — because of the ethos she described as “smart content for curious people.”\n “As we expand and as we grow our subscription business, we’re looking for content that touches a wider group of audience and is closely connected to what we do best, which is global business,” Beizer said. “When [CityLab] came up, it felt like a sweet spot because cities are so key to economies and how they work.”\n  “Increasingly, on the web, we’ve been focused on different kinds of verticals that are essentially, ‘The Future of X,&#39;” Sondag said. “For the future of healthcare, we have  Prognosis. Future of retail, we have  Checkout.  Green is, essentially, the future of the world. And CityLab is the future of cities.”\n The new executive editor of Bloomberg CityLab,  Jennifer Sondag, wrote in  an introductory message to readers that CityLab content (including the archives) will remain unpaywalled — at least through 2020. (The site will occasionally feature paywalled articles from other quarters of Bloomberg News.) She made other reassurances, too:\n So, what hasn’t changed? Pretty much everything else. Our readers are still at the heart of what we do. We will continue to write about how we  live and  work, how we  create and make policy, what  challenges we face and what  solutions are being attempted.\n Sondag is a little unusual for this media age, in that she’s spent her entire 20-year career with one company, Bloomberg. She’s transitioning to the top job at CityLab from  a six-year stint as a standards and training editor at Bloomberg. (She is listed as a coauthor on  The Bloomberg Way,  a hybrid style guide and culture manual for Bloomberg journalists with semi-cult status.) She described the CityLab audience as “very civically engaged,” including plenty of readers involved in local government and urban planning “who know the issues extremely well.”\n That existing audience — invested and knowledgeable about policy — could prove a double-edged sword as Bloomberg seeks to make CityLab its own. One example? The relaunch’s press release highlights a “partnership” with Hyundai Motor Company as “the exclusive sponsorship of the multi-platform MapLab, custom content and integrations created in collaboration with Bloomberg Media Studios” and quotes an executive vice president on the car company’s “deep” commitment to “innovating urban mobility solutions to vitalize human-centered future cities.”\n Beizer stressed that the Hyundai sponsorship won’t affect editorial output, but it’s hard not to see a car company sponsorship as somewhat out of step with the average CityLab reader’s idea of the future of cities. As Joshua Benton  noted (foretold?) when Bloomberg acquired the site last year, “CityLab has a comparatively small but unusually passionate group of fans (all of whom either take public transportation or bike to work) and some of them seem nervous about the new ownership.”\n Sondag said her newsroom is scattered across the United States (New York, San Francisco, Pittsburgh, D.C., and Minneapolis) plus two staffers in Europe. She’s also looking forward to harvesting tips and local expertise from Bloomberg reporters in the company’s more than 120 bureaus — virtually all located in cities — across the globe.\n Both Sondag and Beizer said they felt Bloomberg was well positioned to produce more of the maps and data visualizations that CityLab readers like to see and share.\n “From a digital strategy perspective, we know that data viz is one of the key utilities that matters to [Bloomberg’s] users and subscriber base,” Beizer said. “From a personal perspective, I think there are so many ways to tell stories and we in the news business have been doing long columns of text since Gutenberg. I think maps and other kinds of data viz are great because we can tell stories in new ways.”\n In addition to  MapLab, a newsletter that has been upgraded to a visual-heavy vertical on the new site, CityLab is relaunching with a series of explainers called  CityLab University and  Perspective, which draws on expert takes and local (mostly freelance) accounts.\n The existing  Solutions section — which Sondag said makes up a majority of CityLab content — will continue to feature reported pieces about the policies being tried and tested in various cities.\n Introducing Bloomberg CityLab. Discover how cities work, the challenges they face, and the solutions they need.\n Launching today,  @CityLab brings you reporting, maps, and data about local stories that make a global impact. Check it out [THREAD]  https://t.co/FgoqhO0YIA  pic.twitter.com/xM2tda3zXi — Bloomberg (@business)  June 18, 2020\n    Morning you beautiful twitter people,  @mslaurabliss,  @mariepastora and I looked into how urban transportation has been transformed and reimagined during the first six months of the coronavirus, here’s what we found, via  @bizweekgraphics and  @CityLab :  https://t.co/wrveJUPzWC  pic.twitter.com/iLixuEsoch", "posttime": "2020-06-20 20:33:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "彭博社,relaunched,citylab", "title": "CityLab已在彭博社的保护伞下重新启动", "title_en": "CityLab has been relaunched under the Bloomberg umbrella", "transed": 1, "url": "https://www.niemanlab.org/2020/06/citylab-has-been-relaunched-under-the-bloomberg-umbrella/", "via": "", "real_tags": ["彭博社", "citylab"]}, {"category": "", "categoryclass": "", "imagename": "40952b107a44ff2f7919915596f6179e.jpg", "infoid": 1007400, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当两个完全接触开源情报艺术的新手尝试挑战地理位置时，会发生什么？事实证明，凭借坚持不懈和一些关键资源，我们能够非常接近！以下是我们是如何做到这一点的，以及我们学到了什么。\n我应该说，我从一开始就没有接受过正式的培训；然而，当我在Twitter上偶然看到@Quiztime账号时，我被吸引住了。我读了一些关于开源情报(OSINT)分析和技术的文章，并向一位志同道合的朋友提到了我的兴趣，他在一天晚上建议对一些挑战进行标记组合。\n乍一看，这似乎真的令人望而生畏。随便找个下雨的角落？我们到底要怎么缩小范围呢？但后来我注意到前一周的一条链接推文，还有另一张在同一趟旅行中拍摄的照片：\n好的，现在我们有两张相隔几天在几乎相同的地方拍摄的照片。尽管如此，一个展示了可能是任何街角的东西，另一个展示了-什么-什么树？一个随机的窗口？一把不起眼的椅子？！\n我吸了一口气，喝了一口啤酒，身子靠了进去。“好的，那这里有什么？”\n我们从看第一张照片开始。帖子上的报纸似乎是一个很好的起点；在谷歌上输入Die Son报纸，会弹出一堆来自南非报纸的结果。“死亡汉堡”是另一个。好的，那么，南非。\n我们把注意力转向第二张照片。由于这张照片是在Twitter上托管的，所以删除了可能会提供额外线索的元数据。照片上只有一些树木和天空，还有一把椅子，还有--等等--远处的建筑物。一条天际线。\n更仔细地看天际线，几座建筑看起来很有特色。我把注意力集中在一座黑白相间的摩天大楼上，这座摩天大楼让我印象深刻。\n我剪切了这张照片，放大了，在Yandex上进行了反向图像搜索，看看我还能找到哪些与同一座建筑在一起的照片。\n没有骰子，或者更确切地说，骰子太多了，我找不到我想要的那一个。我从各处都得到了结果。嗯。\n好吧，那我们还知道些什么？我的朋友大声沉思着，把推特上的订阅带回来了。发布它的人是一名安全研究人员，对吗？他们说他们当时在旅行？可能是出差，也可能是去参加会议…。？第一张照片上有一棵树，看起来可能是一座大学行政大楼……大学主办会议…。？\n我在谷歌上快速搜索了比勒陀利亚的几所大学，我决定即兴发挥，仔细看看比勒陀利亚的天际线。\n抓到你了！那就是那座黑白相间的建筑！也许现在我们可以找到第二张照片是在哪里拍的。\n更多的谷歌搜索证实，这就是南非比勒陀利亚的ABSA大楼。但我们不只想要这座城市：我们想确切地知道它是哪座建筑；如果可能的话，我们想知道它是哪个窗户。我们怎么才能进一步缩小范围呢？我们看了看地图，用谷歌搜索了南非大学周围地区的街景，结果看起来不太对劲。它不是应该离…更远吗。？但是在哪呢？\n背景里有几座小山，过了一会儿我的朋友指了指，拿出了一张该地区的地形图。这里有一些小山，这里有…。&#34；\n想法不错。你看着山丘，我要继续看着天际线，我决定了。我放大了另一座建筑，它与其他建筑略有不同，并在谷歌的帮助下认出了它：农业联盟中心。我想，如果我能在地图上找到ABSA大楼和农业联盟中心的位置，我就可以把它们之间的线与照片上出现的角度进行比较。不幸的是，我从来不擅长看地图，而且我已经盯着屏幕看了很长一段时间了。\n我向后一靠，紧闭双眼，此时喝完了我的第二瓶啤酒，我决定无论如何都是休息的时候了。我站了起来。我马上就回来，我说。不过，我想这张照片是在南方的某个地方拍的。可能吧。我给我的朋友看了地图和天际线，然后去了洗手间。\n离开桌子，我一直在想下一步该做什么。“比勒陀利亚之南”的情节不是很多，但无论如何，它是有意义的。也许我们可以再看一遍第一张照片，将街道交叉口的角度与地图进行比较，看看大学校园…上是否有任何可能的匹配。在第二张照片中看起来有一大片绿色区域或森林，所以也许我们可以找到一些公园？\n当我回来时，还在考虑这一切的时候，我的朋友咧嘴笑了起来，把平板电脑对着我。自由公园博物馆。\n果然，我们现在看到的是第二张照片中完全相同的窗口，现在的角度略有不同。\n你说南边，我想城市南边什么样的地方会有这样时髦的窗户。文化博物馆。BAM.&#34；\n他很快切换到另一个选项卡，上面有博物馆的地图，以及它与比勒陀利亚市中心的关系；完美匹配！我们击掌庆祝。\n我们从来没有想过第一张照片是在哪里拍的，但我们仍然把整个经历归结为一次胜利。第一次还不错！\n问问自己你实际能看到什么是一个很好的起点。列个清单很有帮助。\n有时使用某种文化知识(比如窗户形状和哪里可以找到不寻常的！)。可以提供突破，而不是任何特定于数据的东西。\n这有助于与朋友一起解决问题，从他们的想法中反弹，并分散努力。这有助于防止你们两个都掉进兔子洞，还能让事情变得有趣。谁知道我盯着地图上的十字路口看了多久呢？(或者我可能会在多长时间内放弃？)", "note_en": "What happens when two complete newcomers to the art of open-source intelligence try their hand at a geolocation challenge? Turns out that, with persistence and a few key resources, we were able to get pretty close! Here&#39;s how we did it and what we learned.\n I should say from the beginning that I have no formal training; however, when I came across the @quiztime account on Twitter, I was intrigued. I did a bit of reading about open-source intelligence (OSINT) analysis and techniques, and mentioned my interest to a like-minded friend who suggested tag-teaming some challenges one evening.\n   At first glance, this seemed really daunting. Some random rainy corner? How on earth were we supposed to narrow this down? But then I noticed a linked tweet from the previous week, with another photo taken on the same trip:\n  Okay, so now we had two photos taken in approximately the same place within a few days of each other. Still, one showed what could have been any street corner, and the other showed – what – some trees? A random window? A nondescript chair?!\n I huffed out a breath and took a sip of beer, and leaned in. “Okay, so, what’s here?”\n We started by looking at the first photo. The newspapers on the post seemed like a good place to start; punching  Die Son newspaper into Google popped up a bunch of results from a South African newspaper.  Die Burger was another. Okay, so, South Africa.\n We turned our attention to the second photo. Since the photo was hosted on Twitter, it was scrubbed of metadata that might have given additional clues. All that was in the photo was some trees and sky, and a chair, and - wait – buildings in the distance. A skyline.\n   Looking more closely at the skyline, a few buildings looked pretty distinctive. I focused my attention on a black and white skyscraper that stood out to me.\n  I cropped the photo and zoomed in and put it through a reverse-image search on Yandex, to see what other photos I could find with the same building in it.\n No dice, or rather so many dice that I couldn’t find the one I wanted. I was getting results from all over the place. Hmm.\n Okay, so what else did we know? My friend brought the Twitter feed back up, musing out loud. The person who had posted it was a security researcher, right? And they’d said they were on a trip at the time? Maybe it was a work trip, or to a conference…? The first photo had a tree and what looked like might be a university administrative building...universities host conferences…?\n Some quick Googling revealed several universities in Pretoria, and I decided to wing it and take a closer look at the Pretoria skyline.\n  Gotcha! There was the black and white building! Maybe now we could find where the second photo was taken.\n A few more Google searches confirmed that this was the ABSA building in Pretoria, South Africa. But we didn&#39;t want just the city: we wanted to know exactly which building it was; which window, if possible. How could we narrow it down further from here? We looked at the map and did some Google street views of the area around the University of South Africa and it didn’t look quite right. Shouldn’t it be further out…? But where?\n   &#34;There are some hills in the background there,&#34; my friend pointed out after a moment, and pulled up a topographical map of the area. &#34;There are some hills here, and here… &#34;\n &#34;Good thinking. You look at the hills, I’m going to keep looking at the skyline,&#34; I decided. I zoomed in on another building that stood a bit apart from the others and identified it with the help of Google: the Agricultural Union Centre. I thought that if I could find out on a map where the ABSA building and the Agricultural Union Centre were in relation to each other, I could then compare the line between them to the angle they appeared in the photo. Unfortunately, I’ve never been great at reading maps, and I’d been staring at the screen for quite a while already.\n  I leaned back and squeezed my eyes shut, and, having finished my second beer at this point, I decided it was time for a break anyway. I stood up. &#34;I&#39;ll be right back,&#34; I said. &#34;I think the photo was taken somewhere to the south, though. Probably.&#34; I showed my friend the map and the skyline and headed to the bathroom.\n Away from the table, I kept trying to think of what to do next. “South of Pretoria” wasn’t much to go on, but it was something, at any rate. Maybe we could look at the first photo again, compare the angles of the street intersection with a map to see if there were any likely matches on the university campus… it looked like there was a wide stretch of green area or forest in the second photo, so maybe we could find some kind of park?\n When I returned, still mulling all this, my friend had a wide grin, and turned the tablet towards me. &#34;The Freedom Park museum.&#34;\n Sure enough, we were now looking at a view of the exact same window in the second photo, now from a slightly different angle.\n   &#34;You said south, and I thought about what kind of places to the south of the city might have funky windows like that. Cultural museum. Bam.&#34;\n He quickly switched to another tab that had a map of the museum and its relation to Pretoria’s downtown; perfect match! We high-fived.\n   We never did figure out exactly where the first photo was taken, but chalked the whole experience up to a victory nonetheless. Not bad for a first time!\n  Asking yourself what you can actually  see is a good place to start. Making a list helps.\n Sometimes using a sort of cultural knowledge (like window shapes and where you might find unusual ones!) can provide a breakthrough, as opposed to anything specific to the data.\n It helps to tackle the problem with a friend to bounce ideas off of, and to split efforts. It helps keep you both from falling down a rabbit hole, and keeps things fun. Who knows how long I might have stared at intersections on a map? (Or how soon I might have given up?)", "posttime": "2020-06-20 19:21:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "osint,amateur,可能", "title": "OSINT业余时间", "title_en": "Osint Amateur Hour", "transed": 1, "url": "https://www.secjuice.com/geolocation-osint-amateur-hour/", "via": "", "real_tags": ["osint", "amateur", "可能"]}]