[{"category": "", "categoryclass": "", "imagename": "70fcf8496746bfe6fb3bbe8ad384de18.png", "infoid": 1066913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您遵循美国或其他码头，如Chrome Unboxed，您现在就意识到谷歌/阀门在Chromeos上播放蒸汽有充足的谣言。我们知道技术碎片在那里，最近在我们最近的播客中与Luke Short讨论过。但是，我们仍在等待官方宣布，将预期的谣言变为现实。\n 虽然不是官方确认，但我通过源将保持下列信息，这将保持下列信息：\n 现在有一些QA测试人员正在聘请用于分类游戏的“Chromeos Steam Mail发布团队”，在特定配置中找到缺陷和测试性能。\n 正如我没有第一手确认，那就用一粒盐来，但我觉得足够有信心，这很可能是为了发布这一点。\n 这可能与确认一样紧密，因为我们将在Google / Chromeos或Valve实际上在此问题上宣布任何内容之前。\n 这是绝对的好消息，因为这现在会把谷歌作为一个支持Linux游戏前沿和中心的额外公司 - 而不仅仅是阀门。我们都知道谷歌是一个在心脏的Linux商店，但我们还没有看到这一切都与他们的体育平台合作。\n 谁知道，也许在回流阀将有助于通过Steam目录带来Stadia？这不是一个完全疯狂的想法。你怎么看？ \nBoIningSteam让您免费访问我们的内容，但写作文章是一个不断的投资。 我们不使用广告或赞助，帮助我们通过帕勒顿或利巴妥捐赠，使我们能够通过Patreon或LiberaPay进行可持续的活动。 您可以按照我们的时事通讯，我们的RSS Feed，我们的Mastodon型材或我们的推特饲料进行我们所做的事情。 我们还有Peertube，YouTube和LBry频道。 如果你喜欢聊天，你也可以在#boilingsteam：matrix.org上找到我们。 （什么是矩阵？） ", "note_en": "If you follow us or other sources like   Chrome Unboxed you are by now aware that there’s ample rumors about Google/Valve working on bringing Steam on ChromeOS. We know the technology pieces are there, as recently discussed with  Luke Short in our recent podcast. However, we are still waiting for an  official announcement that would turn the expected rumors into reality.\n While not an official confirmation yet, I have received the following information through a source that will remain anonymous:\n There are now some QA testers being hired to work on the “ ChromeOS Steam Launch Team” to triage games, find defects and test performance in specific configurations.\n As I don’t have first hand confirmation, take this  with a grain of salt, but I feel confident enough that this is very likely true to publish this.\n That’s probably as close as a confirmation as we are going to get before Google/ChromeOS or Valve actually announces anything on this matter.\n This is absolutely excellent news, as this would now bring Google as an additional company supporting Linux Gaming front and center –  and not just Valve. We all know that Google is a Linux shop at heart, but we have yet to see how this all fits with their  Stadia platform.\n Who knows, maybe in return Valve will help bring titles to Stadia via the Steam catalogue? That would not be a completely crazy idea. What do you think?\n   BoilingSteam lets you access our content for free, but writing articles is a constant investment. We don&#39;t use ads or sponsporship, help us make our activities sustainable by donating via   Patreon or   LiberaPay if you prefer it anonymous. You can follow what we do via our   newsletter, our   RSS feed, our   Mastodon profile or our   Twitter feed. We also have   Peertube,   Youtube and   LBRY channels. If you&#39;d like to chat, you can also find us on #boilingsteam:matrix.org. ( what is Matrix?)", "posttime": "2021-06-20 00:53:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,chromeos", "title": "Chromeos上的蒸汽：不再是谣言了 ", "title_en": "Steam on ChromeOS: Not a Rumor Anymore", "transed": 1, "url": "https://boilingsteam.com/steam-on-chromeos-not-a-rumor-anymore/", "via": "", "real_tags": ["chrome", "chromeos"]}, {"category": "", "categoryclass": "", "imagename": "60004b378724fb2d57fdd1dee2413a54.jpg", "infoid": 1066912, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罐装金枪鱼蛋白质高，脂肪低，迄今为止最受欢迎的货架稳定的海鲜。\n 它也可以是神秘的，可疑和丑闻。正如华盛顿邮政在1月底报道的那样，地铁 - 世界上最大的三明治链 - 目前在加利福尼亚州的课程诉讼中，声称其金枪鱼三明治“是完全妨碍金枪鱼作为成分。”\n 新闻发布后，笑话迅速遵循。 Jessica Simpson（谁是着名的不知道海的鸡是否在2003年的鸡或金枪鱼）推文：“这是@Subway。这是令人困惑的。“竞争对手Jimmy John's开始向拍摄主题发送电子邮件爆炸：“金枪鱼👏三明治👏应该👏使用👏真实👏金枪鱼”。\n 其部分地铁已经分裂地否认了这一指控。 “在加利福尼亚州提交的投诉中的指控没有真相，”一位发言人写在纽约时报的电子邮件中。 “地铁将100％的煮熟的金枪鱼送到其餐厅，与蛋黄酱混合，并用新鲜的三明治，包裹和由我们的客人享受的沙拉使用。”\n 然而，从记者的角度来看，案件进一步调查 - 如果你愿意，深潜力。\n 因此，我采购了超过60英寸的地铁金枪鱼三明治。我拆除并冻结了金枪鱼肉，然后将其全国各地发布到商业食品测试实验室。我花了几周与金枪鱼专家聊天。我等待，等待，直到实验室结果回来。\n   罐装金枪鱼有其顽皮和反对者，但它肯定卖。据尼尔森控股，全球数据和分析公司，在美国，大约7亿个金枪鱼队在去年销售。 \n“我认为这是它的一部分是怀旧的，”食子纽约的首席食品评论家Ryan Sutton说，当被要求解释罐头鱼的升级时。 “这是很多人在饮食中。”\n 19世纪初的金枪鱼三明治崛起，当时人们实现罐头鱼可以转化为没有烹饪的快速和便宜的膳食。到20世纪50年代，金枪鱼在普及的鲑鱼中超过了鲑鱼，并且在20世纪80年代，尽管鱼类中的高水平汞造成了令人担忧，但估计的85％的美国人在他们的储藏室中有罐装金枪鱼。\n 经过几十年的金枪鱼消费量下降，2018年华尔街日记学故事表明，千禧一代被责备（“许多人不能打开和排出罐头”），虽然新的品牌提供了更多可持续选择的选择是看到他们的市场分享成长。\n 然后，在2020年，罐装货物充满了紧急性，因为购物者争先恐后地购买货架稳定的食物，不知道大流行可能持续多久。这一年度，根据Grand View Research，全球罐装金枪鱼市场的价值高达85.7亿美元。\n 地铁在全球拥有近40,000个地点，其中大约有一半的地区（作为Grub Street一旦计算出来，曼哈顿的地铁之间的平均距离为1,154英尺，或大约四个半块）。）地区的总数已经下降自2015年以来，纽约时报调查的趋势部分地部分地归因于有针对性和操纵的检查。\n 尽管如此，地铁的店面普遍存在，据该公司称，其金枪鱼三明治是最好的销售。 “地铁的金枪鱼三明治在我们最喜欢的三明治中排名第一，”连锁店的发言人在一封电子邮件中写道。\n   但是，可以安全地说，诉讼中的原告 - 不爱地铁的金枪鱼，他们认为是“除了金枪鱼的任何事情”，根据他们从1月份的申请。 （Dhanowa女士和Amin女士的法律团队拒绝对本条的案件发表评论。） \n原告究竟认为含有的三明治，他们不会说。但在1月份的申请中，他们据称，地铁通过销售产品“虚假宣传为”金枪鱼“，以便收取”优惠价格“。\n 当被问及案件的进展时，地铁的发言人在提交了原始投诉时重申了声明。\n “我们的金枪鱼的味道和质量使其成为地铁最受欢迎的产品之一，这些毫无指控威胁要损坏我们的特许经营者，”她在电子邮件中写道。\n “鉴于事实，诉讼构成了对地铁品牌和善意的鲁莽和不当的攻击，”她补充道。\n 通过所有这一点，我开始寻找可以测试地铁产品样本的商业实验室。少数人礼貌地拒绝了我的询问，引用了使我的金枪鱼的技术限制和公司政策有资格分析。最终，我发现自己在手机上用一个专门从事鱼类测试的实验室的发言人。他同意测试金枪鱼，但要求在本文中没有命名的实验室，因为他不想危及直接与美国最大的三明治链一起工作的机会。\n 对于大约500美元，他的实验室可以进行PCR测试 - 这迅速增加了数百万或数十亿份特定的DNA样品 - 并试图告诉我这种物质是否包含五种不同的金枪鱼种类中的五种。\n  根据海鲜名单，由美国食品和药物管理局编制，有15种游牧咸水鱼可以标记为“金枪鱼”。 \n地铁的金枪鱼和海鲜采购声明称，该连锁店仅销售Skipjack和Yellowfin Tuna  - 物种，实验室将被认为是Katsuwonus Pelamis和T. Albacares。\n 在它落在地铁三明治之前，这种金枪鱼，如大多数商业销售的金枪鱼，被渔民在独家经济区工作。 （例如，距离每个国家海岸大约200海里的区域;美国，超过13,000英里的海岸线，控制世界上最大的e.e.z.，含有340万广场海洋海洋。）\n 有五个组织在这些经济区内管理区域渔业。他们的工作是执行法规，并确保海洋生态系统的掠夺者留在海洋中，而不是在我们的盘子里，“斯坦福大学海洋科学教授，他共同指导了斯坦福的金枪鱼研究和保护中心。\n “在可持续水平上删除是许多人的优先事项，”博士在电子邮件中添加了“但仅限少数人练习。”例如，Bluefin Tuna现在是几十年过度捕捞后的濒危物种。\n 这些渔业使用三种方法来捕获金枪鱼：钱包塞，龙亭和杆线钓鱼。\n 极线钓鱼是这种好运的人参与：坐在船上并一次带来一个抓住。较大的钓鱼业务往往依赖于其他两种方法。\n 钱包Seiners落下了一所鱼类周围的一个大圆墙，然后“钱包”底部关闭，以防止鱼逃逸。龙坡将一个30或40英里长的线放入水中，然后等待鱼以捕获数百（或数千）的钩子。 \n然后将鱼类清洁，分类，最终，罐头。加泰罗尼岛海上产品总裁Dave Rudie（世界上前金枪鱼首都），与罐头的罐头一起销售每年大约一百万只罐头的金枪鱼，其中10,000个含有来自他的Bigeye。\n “真正完美的彩色金枪鱼 - 最聪明的红色 - 去寿司酒吧，”Rudie先生说。 “金枪鱼在烹饪中有点漂亮的颜色会更加漂亮，你在外面坐着，它是在中间的原始。”\n “我们还获得了一些更多的灰色金枪鱼，那些脱色金枪鱼，我们将其切割并冻结，”他继续。 “我们将它送到俄勒冈州的罐头。”\n 罐头往往遵循相同的一般过程。 “大多数罐头金枪鱼被Purse Seiners抓住，它在船上冻结了，”Rudie先生说。 “他们要把它带到罐头里，他们最有可能会煮它一次，然后他们会把肉从骨头上拉，他们会把它放在一个罐子里，然后它会被腐败 - 煮熟一点点 - 在他们密封罐头之前最后一次消毒它。“\n 然后有标签问题。当EASOCA是一个专注于海洋宣传的组织，在2010年代初进行了最大的“鱼类欺诈”调查之一，发现“海鲜可能会误标定为26至87％的常用鱼类，如石斑鱼，鳕鱼和鲷鱼，伪装的鱼不太理想，更便宜或更容易获得。“\n  这种区别可能是不可取的，或者所有令人不安的是每个消费者。但是当你试图弄清楚地铁金枪鱼三明治中的东西时，他们就重要了。\n 我被告知，如果我把地铁金枪鱼的Ziploc送入了一个带有几个冰袋的发泡胶水包装凉爽，并邮寄到全国各地，实验室可以测试它。 \n为了采购三明治标本，我访问了洛杉矶周围的三个不同地铁站。只有在三明治上只订购金枪鱼似乎没有额外的蔬菜，奶酪或敷料 - 因为实验室已经对识别至少一次煮熟的鱼的挑战，与梅奥混合，冷冻并在全国各地发货。\n 我的第一个冻结的金枪鱼装运，在运输过程中丢失了150美元的费用。但第二次尝试，样本完好无损。在两到三周后，实验室会告诉我它是否包含任何金枪鱼。\n  虽然地铁拒绝披露其金枪鱼供应商，但斯契，曾在加利福尼亚州的地铁经理三年，分享了有关该产品如何到达她的地点的一些细节。 （圣人要求不害怕雇主的报复害怕她的全名。）\n “金枪鱼在箱子里面，有六个铝袋，它就像一个压制的真空密封板块的金枪鱼，”圣人说。 “这是片状的，它显然在水中浸泡 - 就像盐水一样，所以它只是浸泡在盐水中 - 它只是片刻的金枪鱼。我们只是用手散开它“ - 当然 - ”和梅奥混合在一起。“\n 圣人说，每个商店都遵循公司指导方针，这指示某些肉类可以在商店的冷藏夹心棒中留出24,48或72小时。\n 她说，金枪鱼有72小时的抗议生活（地铁发言人也确认了时间框架），虽然圣人说她的商店经常在击中三天之前取代它。 “我们都同意 - 我们所有人都在那里工作 - 它得到了粗略的，”她说。\n 这是一个前地铁“三明治艺术家”，他在一年内坐在一年的地位，她说她无法想象哪些激励地铁必须用其他任何东西取代金枪鱼。 （Jen还要求不害怕雇主的报复害怕她的全名。） \n“我一直在处理这个金枪鱼，”詹登说道。 “成分在包装上，金枪鱼是一个相对便宜的肉。没有必要让替代金枪鱼使它更便宜。“\n 作为地铁金枪鱼的偶尔消费者，Jen表示她确信它的鱼。\n “我个人对鱼有一个真正弱的胃，这就是我们如何知道金枪鱼是真实的，”她说。 “上次我吃了它，我呕吐了。”\n 但圣人说，除了满足这些食品安全标准之外，她并不是很关心这个金枪鱼是否真实。\n “我们根本不真实地关心，”她对自己和她的三明治艺术家说。 “我猜，这可能听起来很奇怪，但客户会把它带起来，我们只是去，”我不知道。你想要什么样的奶酪？“”\n   “样品中没有出现可增加的金枪鱼DNA，因此我们没有从DNA获得扩增产物，”电子邮件读取。 “因此，我们无法识别物种。”\n 来自实验室的发言人提供了一些分析。 “有两个结论，”他说。 “一个人，这是如此大量处理，无论我们可以拉出什么，我们都无法识别。或者我们有一些，没有那么金枪鱼。“ （地铁拒绝评论实验室结果。） \n为了公平，当Inside Edition在今年早些时候从皇后区出发的三个地铁地区发送样本时，实验室发现标本确实是金枪鱼。\n 即使原告已经软化了原来的主张。在从6月份的新申请中，他们的投诉不在于地铁的金枪鱼根本是金枪鱼，但无论是“100％可持续地抓住鲣鱼和黄鳍金枪鱼”。\n 通过所有测试，有主要的警告需要考虑。一旦金枪鱼被煮熟，它的蛋白质变得变性 - 意味着鱼的特征性质可能被摧毁，这使得难以辨认，如果不是不可能的话，才能识别。\n 我所说的所有人也询问了为什么地铁会换掉其金枪鱼。\n “我不认为三明治的地方会故意误导，”来自卡塔利娜海上产品的鲁迪先生说。 “他们买了一罐金枪鱼，说'金枪鱼。如果在这种情况下有任何欺诈，它发生在罐头里。”\n Peter Horn是一个在PEW慈善信托基金会的非法捕鱼项目的主任，同意如果是这种情况，难以将责任归咎于地铁。\n “在辩护地铁，或者很多这些鱼贩，进一步你从骨头中捞出鱼，难以理解的是那种鱼是越来越难的，”他说。 \n“我们大多数人看到骨骼上的鱼，皮肤完好无损，我们可以识别出什么样的鱼，”他继续。 “你把头和尾巴放下，变得更加困难，但你仍然可以识别它。你把皮肤脱掉了，你把它从骨头上拿走了，你把它切成了切片，然后你只是有点说，'对，颜色和纹理是什么？“\n 索特顿先生，食品评论家建议这一事件可以鼓励消费者对他们的食物来自哪里感兴趣。\n “我希望这样的问题会导致全国各地的更多人，各地都花更多的时间考虑供应食物的环境，劳动和经济供应链的每一步，”他说。\n 甚至由于地铁价格超过了5美元的脚踏板，霍尔表示，该公司的明显廉价三明治提出了比其金枪鱼的完整性更重要的问题。\n “我们不能继续对价格下跌，”霍恩先生说，“因为我们都希望摇滚底部价格上的一切，这意味着什么，某个地方会被剥削，无论是人还是人海洋 - 可能都在。“ ", "note_en": "Canned tuna is high in protein, low in fat and by far the  most popular shelf-stable seafood in the United States.\n It can also be mysterious, questionable and scandalous. As  The Washington Post reported in late January, Subway — the  world’s largest sandwich chain — is currently facing a class-action lawsuit in the state of California that claims its tuna sandwiches “are completely bereft of tuna as an ingredient.”\n After the news broke, the jokes swiftly followed. Jessica Simpson (who  famously didn’t know whether Chicken of the Sea was chicken or tuna back in 2003)  tweeted: “It’s OK @SUBWAY. It IS confusing.” Jimmy John’s, a competitor, started sending email blasts with subjects like: “Tuna 👏 Sandwiches 👏 Should 👏 Use 👏 Real 👏 Tuna 👏.”\n Subway, for its part, has categorically denied the allegations. “There simply is no truth to the allegations in the complaint that was filed in California,” a spokeswoman wrote in an email to The New York Times. “Subway delivers 100 percent cooked tuna to its restaurants, which is mixed with mayonnaise and used in freshly made sandwiches, wraps and salads that are served to and enjoyed by our guests.”\n From a reporter’s perspective, however, the case bore further investigation — a deep dive, if you will.\n So, I procured more than 60 inches worth of Subway tuna sandwiches. I removed and froze the tuna meat, then shipped it across the country to a commercial food testing lab. I spent weeks chatting with tuna experts. I waited, and waited, until the lab results came back.\n   Canned tuna has its die-hards and naysayers, but it certainly sells. According to Nielsen Holdings, a global data and analytics company, about 700 million cans of tuna were sold in the U.S. over the last year.\n “I think part of it is just nostalgia,” said Ryan Sutton, the chief food critic for  Eater NY, when asked to explain the ascendancy of the canned fish. “It’s what a lot of people grew up eating.”\n Tuna sandwiches rose to prominence  in the early 1900s, when people realized canned fish could translate into a quick and cheap meal that involved no cooking. By the 1950s,  tuna had surpassed salmon in popularity, and during the 1980s, an  estimated 85 percent of Americans had canned tuna in their pantries despite growing concerns about high levels of  mercury in the fish.\n After a decades-long decline in tuna consumption, a  2018 Wall Street Journal story suggested that millennials were to blame (“many can’t be bothered to open and drain the cans”), though newer brands offering more sustainable options were seeing their market share grow.\n Then, in 2020, canned goods took on great urgency as shoppers  scrambled to buy shelf-stable food, not knowing how long the pandemic might last. That year, the global canned tuna market was valued at $8.57 billion, according to  Grand View Research.\n Subway has nearly 40,000 locations worldwide, about half of them in the U.S. (As  Grub Street once calculated, the average distance between Subways in Manhattan is 1,154 feet, or about four and a half blocks.) The total number of locations has been  in decline since 2015, a trend that a New York Times investigation attributed, in part, to targeted and manipulated inspections.\n Still, Subway’s storefronts are ubiquitous, and according to the company, its tuna sandwiches are some of the best selling. “Subway’s tuna sandwich ranks among our guests’ favorite sandwiches,” the chain’s spokeswoman wrote in an email.\n   But it’s safe to say that Karen Dhanowa and Nilima Amin — the plaintiffs in the lawsuit — do not love Subway’s tuna, which they believe is “anything but tuna,” according to their filing from January. (Ms. Dhanowa and Ms. Amin’s legal team declined to comment on the case for this article.)\n What exactly the plaintiffs believed the sandwiches contained, they wouldn’t say. But in their filing from January, they alleged that Subway has deliberately misled customers by selling products “falsely advertised as ‘tuna’” in order to charge a “premium price.”\n Subway’s spokeswoman, when asked about the progress of the case, reiterated the statement shared when the original complaint was filed.\n “The taste and quality of our tuna make it one of Subway’s most popular products and these baseless accusations threaten to damage our franchisees,” she wrote in an email.\n “Given the facts, the lawsuit constitutes a reckless and improper attack on Subway’s brand and goodwill,” she added.\n With all of that in mind, I began searching for a commercial lab that could test a sample of Subway’s product. A handful of them politely declined my inquiries, citing technical limitations and company policies that made my tuna ineligible for analysis. Eventually, I found myself on the phone with a spokesman for a lab that specializes in fish testing. He agreed to test the tuna but asked that the lab not be named in this article, as he did not want to jeopardize any opportunities to work directly with America’s largest sandwich chain.\n For about $500, his lab could conduct a PCR test — which rapidly makes millions or billions of copies of a specific DNA sample — and try to tell me whether this substance included one of five different tuna species.\n  According to  the Seafood List, which is compiled by the U.S. Food and Drug Administration, there are 15 species of nomadic saltwater fish that can be labeled “tuna.”\n Subway’s  tuna and seafood sourcing statement says the chain only sells skipjack and yellowfin tuna — species that a lab would recognize as Katsuwonus pelamis and T. albacares.\n Before it lands on a Subway sandwich, that tuna, like the majority of commercially sold tuna, is caught by fishermen working in exclusive economic zones. (E.E.Z.s are areas that extend roughly 200 nautical miles from each country’s coast; the U.S., with over 13,000 miles of coastline, controls the largest E.E.Z. in the world, containing 3.4 million square nautical miles of ocean.)\n There are five organizations that manage regional fisheries within those economic zones. Their job is to enforce regulations and “make sure the predators of ocean ecosystems remain in the ocean and not on our plates,” according to Barbara Block, a professor of marine sciences at Stanford University who co-directs Stanford’s Tuna Research and Conservation Center.\n “Removal at sustainable levels is a priority of many,” Dr. Block added in an email, “but practiced by few.” Bluefin tuna, for example, is now an endangered species following  decades of overfishing.\n There are three methods these fisheries use to catch tuna: purse seining, longlining and pole-and-line fishing.\n Pole-and-line fishing is the kind hobbyists take part in: sitting on a boat and bringing in one catch at a time. Larger fishing operations tend to rely on the other two methods.\n Purse seiners drop a large, round wall of netting around a school of fish and then “purse” the bottom of the net shut to prevent fish from escaping. Longliners drop one 30- or 40-mile-long line into the water, then wait for the fish to catch on hundreds (or thousands) of hooks.\n Then the fish is cleaned, sorted and, eventually, canned. Dave Rudie, the president of Catalina Offshore Products in San Diego (the former  tuna capital of the world), works with a cannery that sells about a million cans of tuna each year, 10,000 of which contain bigeye sourced from him.\n “The really perfect colored tuna — the brightest red — goes to the sushi bars,” Mr. Rudie said. “Tuna that’s a little bit paler in color will go more for the cooking, where you sear the outside and it’s raw in the middle.”\n “We also get some more off-color tuna and that off-color tuna, we cut it up and freeze it,” he continued. “And we send it up to a cannery in Oregon.”\n Canneries tend to follow the same general process. “Most canned tuna is caught by purse seiners and it’s frozen on the boat,” Mr. Rudie said. “They’re going to take it to a cannery, where they’re most likely going to cook it once, and then they’re going to pull the meat off the bone, and they’re going to put it in a can, and then it’s going to get retorted — cooked a little bit — to sterilize it the last time before they seal the can.”\n Then there’s the issue of labeling. When  Oceana, an organization focused on ocean advocacy, conducted one of the largest “fish fraud” investigations in the early 2010s, it discovered that “seafood may be mislabeled as often as  26 to 87 percent of the time for commonly swapped fish such as grouper, cod and snapper, disguising fish that are less desirable, cheaper or more readily available.”\n  Such distinctions might not be noticeable, or all that troubling, to every consumer. But when you’re trying to figure out what’s in a Subway tuna sandwich, they matter.\n I was told that if I packed a Ziploc of Subway tuna into a Styrofoam shipping cooler with a few ice packs and mailed it across the country, the lab could test it.\n To procure the sandwich specimens, I visited three different Subway locations around Los Angeles. It seemed logical to order only tuna on the sandwiches — no extra vegetables, cheese or dressing — as the lab was already wary about the challenges of identifying a fish that’s been cooked at least once, mixed with mayo, frozen and shipped across the country.\n My first frozen tuna shipment, which cost upward of $150, was lost in transit. But on second try, the sample arrived intact. In two to three weeks, the lab would tell me whether it contained any tuna.\n  Though Subway declined to disclose its tuna suppliers, Sage, who has been a Subway manager in California for three years, shared some details about how the product arrives at her location. (Sage asked not to use her full name out of fear of reprisal from her employer.)\n “The tuna comes in a case and inside the case, there are six aluminum pouches and it’s just like a pressed, vacuum sealed slab of tuna,” Sage said. “It’s flaky and it’s clearly soaked in water — it’s like a brine, so it’s just soaked in salt water — and it’s just flaky tuna. We just spread it apart with our hands” — gloved, of course — “and mix it with mayo.”\n Sage said that each store follows corporate guidelines, which instruct that certain meats can stay out in the store’s refrigerated sandwich bar for up to 24, 48 or 72 hours.\n Tuna, she said, has a 72-hour counter life (the time frame was also confirmed by Subway’s spokeswoman), though Sage said her store often replaces it before it hits three days. “We all agree — all of us that work there — it gets kind of gross,” she said.\n Jen, a former Subway “ sandwich artist” who worked at a location in Iowa for a year, said she couldn’t imagine what incentive Subway would have to replace the tuna with anything else. (Jen also asked not to use her full name out of fear of reprisal from her employer.)\n “I dealt with the tuna all the time,” Jen said. “The ingredients are right on the package and tuna is a relatively cheap meat. There would be no point to making replacement tuna to make it cheaper.”\n And as an occasional consumer of Subway’s tuna, Jen said she’s confident it’s fish.\n “I personally have a really weak stomach to fish, which is how we know the tuna is real,” she said. “Last time I ate it, I puked my guts out.”\n But Sage said that beyond meeting these food safety standards, she’s not very concerned about whether this tuna is real or not.\n “We don’t really care at all,” she said of herself and her fellow sandwich artists. “Which may sound kind of weird, I guess, but customers will bring it up and we just go, ‘I don’t know. What kind of cheese do you want?’”\n   “No amplifiable tuna DNA was present in the sample and so we obtained no amplification products from the DNA,” the email read. “Therefore, we cannot identify the species.”\n The spokesman from the lab offered a bit of analysis. “There’s two conclusions,” he said. “One, it’s so heavily processed that whatever we could pull out, we couldn’t make an identification. Or we got some and there’s just nothing there that’s tuna.” (Subway declined to comment on the lab results.)\n To be fair, when  Inside Edition sent samples from three Subway locations in Queens out for testing earlier this year, the lab found that the specimens were, indeed, tuna.\n Even the plaintiffs have softened their original claims. In a new filing from June, their complaints centered not on whether Subway’s tuna was tuna at all, but whether it was “100% sustainably caught skipjack and yellowfin tuna.”\n With all testing, there are major caveats to consider. Once tuna has been cooked, its protein becomes denatured — meaning that the fish’s characteristic properties have likely been destroyed, making it difficult, if not impossible, to identify.\n All of the people I spoke with also questioned why Subway would swap out its tuna.\n “I don’t think a sandwich place would intentionally mislabel,” Mr. Rudie from Catalina Offshore Products said. “They’re buying a can of tuna that says ‘tuna.’ If there’s any fraud in this case, it happened at the cannery.”\n Peter Horn, the director of the  Ending Illegal Fishing Project at the Pew Charitable Trusts, agreed that it would be difficult to place blame on Subway if this were the case.\n “In the defense of Subway, or quite a lot of these fishmongers, the further you get the fish from the bone, the harder it is to recognize what that fish is,” he said.\n “Most of us see the fish on the bone, skin intact, and we can recognize what sort of fish that is,” he continued.  “You drop the head and the tail off, it becomes more difficult, but you can still probably recognize it. You take the skin off it, you take it off the bone and you cut it into slices then you’re only sort of saying, ‘Right, what’s the color and texture?’”\n Mr. Sutton, the food critic, suggested that this incident could encourage consumers to take more interest in where their food comes from.\n “I would hope that an issue like this would cause more people across the country and all across the world to spend more time thinking about every step of the environmental, labor and economic supply chains that supply their food,” he said.\n And even as Subway’s prices have risen beyond the days of $5 footlongs, Mr. Horn said the company’s notably cheap sandwiches raise more important questions than the integrity of their tuna.\n “We can’t just continue to have a downward pressure on the price,” Mr. Horn said, “because if we all want everything at rock bottom prices, that means something, somewhere is going to be exploited, whether that’s people or the ocean — probably both.”", "posttime": "2021-06-20 00:52:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金枪鱼,tuna", "title": "实验室测试在地铁金枪鱼中找到“没有金枪鱼DNA” ", "title_en": "Lab test finds “no tuna DNA” in Subway tuna", "transed": 1, "url": "https://www.nytimes.com/2021/06/19/style/subway-tuna-sandwich-lawsuit.html", "via": "", "real_tags": ["金枪鱼", "tuna"]}, {"category": "", "categoryclass": "", "imagename": "5fff342aa4ac846753b14f93fc041a47.webp", "infoid": 1066911, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“当加密从万亿岁下降时，或者Meme股来自数十亿美元，#mainstreet损失将接近国家的规模，”伯里发了推文。 ", "note_en": "'When crypto falls from trillions, or meme stocks fall from tens of billions, #MainStreet losses will approach the size of countries,' Burry tweeted.", "posttime": "2021-06-20 00:52:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "母亲,burry,meme", "title": "迈克尔伯里警告了“所有撞车的母亲”即将来临 ", "title_en": "Michael Burry warns the 'mother of all crashes' is coming", "transed": 1, "url": "https://markets.businessinsider.com/currencies/news/big-short-michael-burry-warns-meme-stocks-crypto-crash-coming-2021-6-1030534935", "via": "", "real_tags": ["母亲", "burry", "meme"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066910, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索递归岛或湖泊是一个岛屿或湖泊岛屿或湖泊。 [1]\n      该岛在技术上是人为的，因为它是由于丹尼尔约翰逊大坝的创造而淹没了一个较小的现有湖泊所做的\n 如果Sääminginsalo被认为是一个岛屿，因为它由人工运河（Raikuu Canal）与一侧分开。\n       如果Kotasaari被认为是一个岛屿，因为它由人工运河（Summa Canal）与一侧分开。\n    火山口湖本身是由迈阿马山山爆发形成的火山口;一系列较小的爆发后来形成了Cindera地板上的煤渣锥，其中巫师岛最高，现在唯一可见湖面上方的表面。 [3]\n      如果Sääminginsalo被认为是一个岛屿，因为它由人工运河（Raikuu Canal）与一侧分开。由一些[谁是什么？]成为一个湖的一个湖的世界上最大的岛屿。另一个岛屿，苏布斯萨里（62°5'28“N 28°59'28”E / 62.09111°N 28.99111°E / 62.09111; 28.99111）在Hanhijärvi，也位于Sääminginsalo，大约大约一半Kokkosaari。\n 在Chaunoy湖中存在超过10个岛屿，其中最大的岛屿最大的少于十分之一的内容 \n如果Kotasaari被认为是一个岛屿，因为它由人工运河（Summa Canal）与一侧分开。\n                            大岛屿看起来像怀孕的袋鼠，较小的岛屿看起来像它的胚胎。莱茵河正在漂浮到湖泊＆＃34; Knielinger See＆＃34;在Knielingen.\n   在西南11公里的湖到湖中，含有较大的岛屿。这个岛屿湖中没有其他岛屿\n     岛上的湖被认为有一个名字，但尚未被识别出来\n 直到2020年，[13] Vulcan Point是一个在菲律宾卢塞湖田湖火山岛的主要火山口湖中存在的岛屿。 [14]在2020塔尔火山喷发期间，主要的火山口湖蒸发。 [13]\n              穆斯博尔德被声称存在于美国湖瑞安岛上的穆斯特普罗斯岛的季节性池塘，在美国湖上的斯莱·罗伊尔岛，[20]使其成为第四阶岛。在2020年，对岛屿的探险无法找到它。 [21]\n     ^是一个半岛，直到1906年，当运河被挖掘时，将其从内地分开。 [5] \n^ a b c记录，吉尼斯世界（2018年8月28日）。 2019年吉尼斯世界纪录。 第40-41页。 ISBN 978-1-912286-43-0。  ^ a b c d e f g h i j k l m n o海岸线 - 湖泊（ranta10），2020.芬兰环境中心，ILLY中心。 在CC-BY-4.0下发布。  ^＆＃34;一个湖的岛上在一个岛上的一个湖的一个湖和＃34; EarthObservatory.nasa.gov。 2015年2月22日。  ^ a b freedman，安德鲁; Meko，Tim; Karklis，Laris（1月17日）。 ＆＃34; Taal Volcano＆＃39; Crater Lake几乎是空的＆＃34; 华盛顿邮报。  ^＆＃34;一些有趣的岛屿和湖泊＆＃34; Topografisch Verbonded Elbruz。 2013年9月19日从原件存档。  ^ Valenzuela，奥兰多。 ＆＃34; Puerta Laguna Misteriosa [门至神秘泻湖]＆＃34; El Nuevo Diario（西班牙语）。  ^＆＃34;世界上最大的湖泊最大的岛屿＆＃34; Albert Lea Tripune。 2009年7月21日。 ", "note_en": "Jump to navigation  Jump to search  A  recursive island or lake is an  island or  lake that is itself within an island or lake.  [1]\n      The island is technically artificial as the lake it is in was made by flooding a smaller existing lake due to the creation of the  Daniel-Johnson dam\n If Sääminginsalo is considered an island, as it is separated from one side by an artificial canal ( Raikuu canal).\n       If Kotasaari is considered an island, as it is separated from one side by an artificial canal ( Summa canal).\n    Crater Lake itself is a caldera formed by the eruption of  Mount Mazama; a series of smaller eruptions later formed cinder cones on the caldera floor, of which Wizard Island is the highest, and the only one now visible above the lake&#39;s surface.  [3]\n      If Sääminginsalo is considered an island, as it is separated from one side by an artificial canal (Raikuu canal). Claimed by some [   by whom?] to be the world largest island in a lake in an island in a lake. Another island, Suursaari (      62°5′28″N  28°59′28″E ﻿ / ﻿  62.09111°N 28.99111°E ﻿ /  62.09111; 28.99111) in Hanhijärvi, is also located in Sääminginsalo, and it is about half the size of Kokkosaari.\n There exist more than 10 other islands in lake chaunoy, the largest of which is less than a tenth of the size of the one mentioned here\n       If Kotasaari is considered an island, as it is separated from one side by an artificial canal (Summa canal).\n                            The greater islands looks like a pregnant kangaroo, and the smaller island looks like its embryo. River  Rhine is floating west to the lake &#34;Knielinger See&#34; in  Knielingen\n   In a lake 11 km south west to the lake that contains the larger island. There are no other island in this islands lake\n     Lake that island is on is believed to have a name but as of yet has not been identified\n Until 2020,  [13]  Vulcan Point was an island that existed in  Main Crater Lake on  Volcano Island in  Lake Taal on  Luzon in the  Philippines.  [14] Main Crater Lake evaporated during the  2020 Taal Volcano eruption.  [13]\n              Moose Boulder was claimed to exist in the  seasonal pond of Moose Flats on Ryan Island in  Siskiwit Lake on  Isle Royale in  Lake Superior in the United States,  [20] making it a fourth order island. In 2020, an expedition to the island was unable to find it.  [21]\n     ^  Was a peninsula until 1906 when a canal was dug, separating it from the mainland.  [5]\n   ^     a     b     c   Records, Guinness World (August 28, 2018).   2019 Guinness World Records. pp. 40–41.  ISBN   978-1-912286-43-0.\n      ^     a     b     c     d     e     f     g     h     i     j     k     l     m     n     o   Shoreline - lakes (Ranta10), 2020.  Finnish Environment Centre, ELY centres. Released under CC-BY-4.0.\n    ^     &#34;Island in a Lake on an Island in a Lake on an Island&#34;.  earthobservatory.nasa.gov. February 22, 2015 .\n  ^     a     b    Freedman, Andrew; Meko, Tim; Karklis, Laris (January 17, 2020).  &#34;Taal volcano&#39;s crater lake is nearly empty&#34;.  Washington Post.\n ^     &#34;Some interesting islands and lakes&#34;. Topografisch Verbond Elbruz.  Archived from the original on September 19, 2013 .\n    ^    Valenzuela, Orlando.  &#34;Puerta laguna misteriosa [Door to mysterious lagoon]&#34;.  El Nuevo Diario (in Spanish).\n  ^     &#34;Largest island on the largest lake in the world&#34;.  Albert Lea Tribune. July 21, 2009 .", "posttime": "2021-06-20 00:52:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "岛屿,islands", "title": "岛上的岛屿在岛上的岛屿上的岛屿上的岛屿 ", "title_en": "Islands in lakes on islands in lakes on islands", "transed": 1, "url": "https://en.wikipedia.org/wiki/Recursive_islands_and_lakes#Islands_in_lakes_on_islands_in_lakes_on_islands", "via": "", "real_tags": ["岛屿", "islands"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066909, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4月，Linux基金会要求开源社区：Linux如何影响您的生活？毋庸置疑，回应从全球分享回忆，情绪和重要时刻永远改变了你的生活。我们感恩你花了时间告诉我们你的故事。\n 我们很高兴地分享我们收到的30个回复，从所有提交中随机选择。作为感谢这30个人分享他们的故事，并在庆祝Linux的30周年庆祝活动中，从南部非洲基金会采用了30个企鹅，以保护沿海鸟类荣誉，我们的每一个提交人都必须命名他们的企鹅。\n 看看下面的幻灯片阅读这些故事，一瞥他们的新采用的企鹅及其新名字！\n 感谢所有贡献的人，为未来30年的创新和其他30年来鼓励我们和社区。\n *每个采用的野生非洲企鹅被救出，并正在恢复众多私人员工在Sanccob的员工释放到野外的目标。\n      https://linuxfoundation.org/wp-content/uploads/2020/10/lf_logo.svg 0 0 kristin o＆＃39; connell https://linuxfoundation.org/wp-content/uploads/2020/10/lf_logo.svg Kristin O＆＃39; Connell 2021-06-14 09:50:11 2021-06-14 10:36:33 Linux如何影响你的生活 - 庆祝30年的开源 ", "note_en": "In April, The Linux Foundation asked the open source community: How has Linux impacted your life? Needless to say, responses poured in from across the globe sharing memories, sentiments and important moments that changed your lives forever. We are grateful you took the time to tell us your stories.\n We’re thrilled to share 30 of the responses we received, randomly selected from all submissions. As a thank you to these 30 folks for sharing their stories, and in celebration of the 30th Anniversary of Linux, 30 penguins were adopted* from the  Southern African Foundation for the Conservation of Coastal Birds in their honor, and each of our submitters got to name their adopted penguin.\n Check out the slides below to read these stories, get a glimpse of their newly adopted penguins and their new names!\n Thank you to all who contributed for inspiring us and the community for the next 30 years of innovation and beyond.\n *Each of the adopted wild African penguins have been rescued and are being rehabilitated with the goal of being released back into the wild by the wonderful and dedicated staff at SANCCOB.\n      https://linuxfoundation.org/wp-content/uploads/2020/10/lf_logo.svg  0  0     Kristin O&#39;Connell    https://linuxfoundation.org/wp-content/uploads/2020/10/lf_logo.svg    Kristin O&#39;Connell 2021-06-14 09:50:11 2021-06-14 10:36:33  How Linux Has Impacted Your Lives – Celebrating 30 Years of Open Source", "posttime": "2021-06-20 00:10:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,基金会,honors,企鹅", "title": "Linux基金会荣誉30 Linux成功案例的作者通过让他们命名企鹅 ", "title_en": "Linux Foundation Honors Authors of 30 Linux Success Stories By Letting Them Name a Penguin", "transed": 1, "url": "https://linuxfoundation.org/blog/how-linux-has-impacted-your-lives-celebrating-30-years-of-open-source", "via": "", "real_tags": ["linux", "基金会", "honors", "企鹅"]}, {"category": "", "categoryclass": "", "imagename": "2a2a43c5e94ee75fd48c737cba15a8f0.png", "infoid": 1066906, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所以，让我们有一个专门的UXN线程！ 声音马铃薯是什么？ UXN是一种由Forth-Machines的便携式8位虚拟计算机，能够在自己的汇编语言中运行简单的工具和游戏。 英文：想象一下，这是一个如此简单的工作站，可以在一个人的下午在一个人下实现。 想象一下，每个工具/应用程序都是几个字节。 UXN软件与Classic Nintendo的ROM最相似，除了控制台设计e ... ", "note_en": "So, let’s have a dedicated Uxn thread!     Sound potato   What? Uxn is a portable 8-bit virtual computer inspired by forth-machines, capable of running simple tools and games programmable in its own assembly language.   In English: Imagine a workstation that is so simple that it can be implemented in an afternoon by a single person. Imagine that every tool/application is a only a few bytes.  Software for Uxn are most similar to roms for the classic Nintendo, except that the console is designed e...", "posttime": "2021-06-20 00:07:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟,virtual,uxn", "title": "UXN  - 虚拟计算机 ", "title_en": "Uxn – Virtual AV Computer", "transed": 1, "url": "https://llllllll.co/t/uxn-virtual-av-computer/46103", "via": "", "real_tags": ["虚拟", "virtual", "uxn"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066905, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无限的ASCII图表，保存到Google Drive，调整大小，自由格式抽奖，并直接导出到Text / HTML。 ", "note_en": "Infinite ASCII diagrams, save to Google Drive, resize, freeform draw, and export straight to text/html.", "posttime": "2021-06-20 00:07:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "asciiflow,diagram,text", "title": "ASCIIFLOW图工具 ", "title_en": "ASCIIFlow Diagram Tool", "transed": 1, "url": "https://asciiflow.com/", "via": "", "real_tags": ["asciiflow", "diagram", "text"]}, {"category": "", "categoryclass": "", "imagename": "458ffa187a80d682f2bb2885824c025e.jpeg", "infoid": 1066904, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在WWDC 2020期间，Apple宣布他们将远离英特尔并为其MAC生产自己的Apple Silicon芯片。运行Apple Silicon Chips的所有Mac计算机的过渡需要两年时间。\n 快进至2020年11月17日，Apple发布了配备M1芯片的MacBook Pro，MacBook Air和Mac Mini型号。外面没有彻底不同;实际上;外面是相同的，差异是性能，冷却和电池寿命的显着改善。 M1在同一价格范围内优于每个英特尔笔记本电脑，并与Mac Pro类似地执行。\n 与以前的Mac模型相比，电池寿命明显更长，冷却尤为卓越。由于Apple与M1芯片的疯狂优化，新机器没有像Intel型号一样热，因为由于疯狂的优化，他们没有使用尽可能多的电池寿命，并且由于优化而令人难以置信。它有一个八核CPU，具有四个能源有效的核心和四个性能核心。根据运行的程序，它将使用不同的核心。\n 今年，我们预计较新的MAC上的M1X芯片以及更多的实用性。根据@Dylandkit谁是Twitter上的Apple分析师，我们期待了2021年的前一季度的M1X芯片Mac。保证的一件事是M1X芯片将提供比当前M1芯片更多的性能。根据MacWorld.co.uk的说法，与MacBook Pro和Mac Mini上的八个核心相比，我们可以期待一个16核-GPU，以及MacBook Air上的七个核心。\n  M1x是M1的扩展，它将包含更多雷电通道，更多CPU核心，更多GPU核心和更大的功率绘制。 M1X将在高端Mac Mini，MacBook Pro 14和16中具有较高的IMAC。\n -  Dylan（@Dylandkt）4月30日，2021年4月30日\n  在新MAC上可以预期更多Thunderbolt港口。当前MAC仅支持两个Thunderbolt端口，更多的端口允许用户连接更多的雷电配件而不购买额外的加密窗或适配器。 \n总之，我们期待更快的处理器，提高了GPU内核增加的图形性能，以及更大的14英寸屏幕来更换当前的13“MacBook Pro。 ", "note_en": "During WWDC 2020, Apple announced that they would be transitioning away from Intel and producing their own Apple Silicon chips for their Macs. The transition to all Mac computers running Apple Silicon chips would take two years.\n Fast forward to November 17, 2020, and Apple releases the MacBook Pro, MacBook Air, and Mac Mini models equipped with the M1 chip. The outside wasn’t drastically different; in fact; it was the same on the outside, the difference was the significant improvement in performance, cooling, and battery life. The M1 outperformed every Intel laptop within the same price range and performed similarly to the Mac Pro.\n When compared to previous models of the Mac, the battery life was significantly longer, and the cooling was exceptional. Because of Apple’s crazy optimization with the M1 chip, the new machines did not get hot like the Intel models, they did not use as much battery life because of the crazy optimization, and cooling was incredible because of the optimization. It had an eight- core CPU with four energy efficient cores and four performance cores. Depending on the programs that were running, it would use different cores.\n This year, we’re expecting an M1X chip on the newer Macs along with more practicality. According to @dylandkit who’s an Apple analyst on Twitter states that we’re expecting an M1X chip Mac for the last quarter of 2021. One thing that is assured is that the M1X chip will deliver more performance than the current M1 chip. According to Macworld.co.uk, we can expect to see a 16-core-GPU compared to the eight cores on the MacBook Pro and Mac Mini, and the seven cores on the MacBook Air.\n  M1X is an extension of the M1 that will contain more thunderbolt channels, more cpu cores, more gpu cores, and greater power draw. The M1X will be featured in the Higher end Mac Mini, the Macbook Pro 14 and 16, and a higher end iMac.\n— Dylan (@dylandkt)  April 30, 2021\n  More Thunderbolt ports can be expected on the new Macs. Current Macs only support two Thunderbolt ports, and more ports allow users to connect more Thunderbolt accessories without purchasing additional dongles or adapters.\n In conclusion, we’re expecting a faster processor, improved graphical performance due to increased GPU cores, and a larger 14” screen to replace the current 13” MacBook Pro.", "posttime": "2021-06-20 00:06:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,silicon,mac", "title": "Apple Silicon Chips：这秋天期待什么 ", "title_en": "Apple Silicon Chips: What to Expect This Fall", "transed": 1, "url": "https://themorningnews.com/news/2021/06/19/apple-silicon-chips-what-to-expect-this-fall/", "via": "", "real_tags": ["apple", "silicon", "mac"]}, {"category": "", "categoryclass": "", "imagename": "6cd0930f3044b8dc78a00250053d4315.jpg", "infoid": 1066903, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "＆＃34;在1974年 - 五年后，街道游戏中途袭击者在美国，苏维埃的孩子们来到自己的海军战争，＆＃34; Idov说。 ＆＃34;不是真正的视频游戏，Morskoi Boi更像是波球，灯：敌人船只的扁平切口爬到彩绘的背景下，＆＃34;玩家试图用鱼雷打它们。今天，游戏玩家和历史Buff可以在苏联街机博物馆在线尝试他们的街道战争。\n  ＆＃34;在1974年 - 五年后，街道游戏中途袭击者在美国，苏维埃的孩子们来到自己的海军战争，＆＃34; Idov说。 ＆＃34;不是真正的视频游戏，Morskoi Boi更像是波球，灯：敌人船只的扁平切口爬到彩绘的背景下，＆＃34;玩家试图用鱼雷打它们。今天，游戏玩家和历史Buff可以在苏联街机博物馆在线尝试他们的街道战争。\n  ＆＃34; Zaporozhets，苏联＆＃39;拒绝菲亚特600，是市场上最便宜的汽车 - 它的头工程师表示，价格截止值为“1000瓶伏特加”，＆＃39;＆＃34; Idov说。 ＆＃34;它的特质 - 在后面的发动机，可演于耳朵的空气摄入量，在地板上是一个可选的舱口，用于冰钓鱼 - 使其成为无数笑话的屁股。这些天，有一个整个社区致力于旧的旧＆＃39; zapors。＆＃39;据报道，1972年型号的骄傲所有者弗拉基米尔·普京·普京·普京·普京。＆＃34;\n  由于这款电池供电的驾驶游戏，那些太年轻的Zaporozhets可以享受苏联汽车文化。 ＆＃34;汽车实际留在磁铁中倒塌;这是旋转它的道路本身，就像乙烯基拼盘一样，＆＃34; Idov说。 ＆＃34;自制黑客包括用螺栓或茶匙更换汽车并翻转电池＆＃39; S极性 - 这使整个板旋转向后。＆＃34;\n  ＆＃34;这款便携式热水器 - 在酒店房间的隐私中享用茶或炸锅 - 是每一个苏联旅行者的必备运动员，＆＃34; Idov说。 ＆＃34;国外俄罗斯人通过将这些婴儿塞进110伏插座来缩短整个城市街区。无限更可怕的自制版本包括电线，两个火柴梗和两个剃刀刀片。＆＃34;\n  ＆＃34;一个电线无线电接收器 -  radiotochka，字面上＆＃34;无线电点＆＃34; -was一个Quintessentially苏联物体：一个壁挂式无线电，只广播一个通道，无法关闭一个频道，＆＃39; t关闭）并在第二次世界大战和＃34之后的几乎每个公寓里都安装了预装; Idov说。 ＆＃34;具有讽刺意味的是，它非常严重 - 一个旋钮，没有按钮导致一些非常醒目的设计。＆＃34;\n  苏联风格的享有功利和无聊的声誉。 ＆＃34;但这并非所有关于卡其色和腻子，这是由这段经济型胶带甲板的眼球爆炸色调所证明的，＆＃34; Idov说。 \n＆＃34;苏联人不在营销他们的消费品向西，＆＃34; Idov说＆＃34;这条广告从20世纪60年代初开始使用Sputnik到大胆的鹰苏维埃收音机; 至少梦想着陪同的英语副本已经设法获得了狡猾的疯狂男子时代的节奏。＆＃34;  ＆＃34;在20世纪60年代初，谦卑地谦卑地在＆＃39的yanks;厨房辩论，＆＃39; Khrushchev＆＃39;政府创建了VNIITE，A＆＃39;技术美学研究所＆＃39; 这基本上是一个国有的设计商店，＆＃34; Idov说。 ＆＃34;它的工作都没有成批量生产，但至少是其杂志Tekhnicheskaya Estetika，成为了一个击中。＆＃34;  此内容由第三方创建和维护，并导入本页以帮助用户提供其电子邮件地址。 您可以在Piano.io找到有关此产品和类似内容的更多信息 ", "note_en": "&#34;In 1974—five years after the arcade game Midway Sea Raider came out in the U.S.—Soviet kids got to wage naval warfare of their own,&#34; Idov says. &#34;Not really a video game, Morskoi Boi was more like pinball with lights: flat cutouts of enemy ships crawled against a painted backdrop,&#34; and players tried to hit them with torpedoes. Today, gamers and history buffs can try their hand at rudimentary arcade warfare online at the Museum of Soviet Arcade Games.\n  &#34;In 1974—five years after the arcade game Midway Sea Raider came out in the U.S.—Soviet kids got to wage naval warfare of their own,&#34; Idov says. &#34;Not really a video game, Morskoi Boi  was more like pinball with lights: flat cutouts of enemy ships crawled against a painted backdrop,&#34; and players tried to hit them with torpedoes.    Today, gamers and history buffs can try their hand at rudimentary arcade warfare online at the  Museum of Soviet Arcade Games.\n  &#34;The Zaporozhets, the Soviets&#39; answer to Fiat 600, was the cheapest car on the market—its head engineer had said that the price cutoff was &#39;1000 bottles of vodka,&#39;&#34; Idov says. &#34;Its idiosyncrasies—engine in the back, comically ear-like air intakes, an optional hatch in the floor for ice fishing—made it the butt of countless jokes. These days, there&#39;s a whole community devoted to loopy modifications of old &#39;Zapors.&#39; Vladimir Putin, proud owner of a 1972 model, is reportedly a member.&#34;\n  Thanks to this battery-powered driving game, those too young to own a Zaporozhets could enjoy Soviet car culture. &#34;The car actually stayed in place, held down by a magnet; it was the road itself that spun around it, like a vinyl platter,&#34; Idov says. &#34;Homemade hacks included replacing the car with a bolt or teaspoon and flipping the battery&#39;s polarity—which made the whole board spin backward.&#34;\n  &#34;This portable water heater—the better to make tea or bouillon in the privacy of your hotel room—was a must for every Soviet traveler,&#34; Idov says. &#34;Russians abroad had a reputation for shorting out whole city blocks by plugging these babies into 110-volt sockets. The infinitely more terrifying homemade version consisted of an electrical cord, two matchsticks and two razor blades.&#34;\n  &#34;A wire radio receiver— radiotochka, literally &#34;radio point&#34;—was a quintessentially Soviet object: a wall-mounted radio that broadcast only one channel, couldn&#39;t be turned off (only down) and came pre-installed in almost every apartment built after WWII,&#34; Idov says. &#34;Ironically, its very severity—one knob, no buttons—led to some pretty striking designs.&#34;\n  Soviet style has a reputation for being utilitarian and boring. &#34;But it was not all about khaki and putty, as evidenced by the eye-popping colors of this cheapo 1980s tape deck,&#34; Idov says.\n  &#34;The Soviets were not above marketing their consumer goods to the West,&#34; Idov says &#34;This ad from the early 1960s uses the Sputnik to boldly hawk Soviet radios; at least whoever dreamed up the accompanying English copy has managed to get the chirpy  Mad Men–era cadence right.&#34;\n  &#34;In the early 1960s, humbled by the Yanks at the &#39;Kitchen Debates,&#39; Khrushchev&#39;s government had created VNIITE, a &#39;technical aesthetics research institute&#39; that was basically a state-run design shop,&#34; Idov says. &#34;None of its work made it into mass production, but at least its journal,  Tekhnicheskaya Estetika, became a hit.&#34;\n  This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2021-06-20 00:06:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苏联,设计,examples", "title": "苏联设计的奇怪例子 ", "title_en": "Strange Examples of Soviet Design", "transed": 1, "url": "https://www.popularmechanics.com/cars/g499/8-strange-examples-of-soviet-design/?slide=1", "via": "", "real_tags": ["苏联", "设计", "examples"]}, {"category": "", "categoryclass": "", "imagename": "5053ffb0c6d89eb7f548e8ebd018112b.png", "infoid": 1066901, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用它超过25％的顶级Android应用程序，eventBus比以往任何时候都更受欢迎。所以我们很高兴今天宣布赛事3.1。从此发布开始，eventBus与普通Java（非Android）项目合作。这有两个主要优点：首先，它为所有Java开发人员开辟了EventBus，并使其可用于服务器和桌面应用程序。其次，它允许Android开发人员在本地单元测试中使用eventBus。之前，您必须使用速度速度和设备的仪器测试。与此相反，普通的Java单元测试在直接在桌面机上运行时巧妙地快速。第二个改进是一个新的线程模式：main_ordered。它是默认主线程模式的变型，也可以确保主线程中的事件传送。差异是当事件发布在主线程中时：主要是将事件传递给同步方式立即传递给用户。 Main_Ordered将仅将事件纳入呼叫\r帖子（...）稍后交付给订阅者。这使得事件处理更严格和更一致的顺序（因此是main_Ordered的名称）。例如，如果您在具有主线程模式的事件处理程序中发布另一个事件，则第二个事件处理程序将在第一个事件之前完成（因为它同步调用 - 将其与方法调用进行比较）。使用main_ordered，第一个事件处理程序将完成，然后将在稍后的时间点调用第二个事件处理程序（一旦主线程具有容量），则会调用。\n 我们正在考虑将Main_Ordered在Fexbus的未来版本中进行默认。因为Main和Main_Ordered行为略有不同，所以可能有一些情况可能会改变应用程序的行为。它在每种情况下都是一个贸易：当事件发布在主线程上时，主要是更快的，Main_Ordered提供更一致和可预测的事件交付。让我们知道你对它的看法。\n 还有一件事：我们很乐意在赛事中获得一些反馈，以及我们如何进一步改进它。我们的反馈表只需要一分钟。谢谢！ ", "note_en": "With  over 25% of the top Android apps using it, EventBus is more popular than ever before. So we’re very happy to announce EventBus 3.1 today. Starting with this release, EventBus works with  plain Java (non-Android) projects. This has two major benefits: Firstly, it opens up EventBus for all Java developers and makes it usable for server and desktop applications. Secondly, it allows Android developers to use EventBus in  local unit tests. Before, you had to use instrumentation tests which are slow and require a device. In contrast to this, plain Java unit tests are blazingly fast as they run directly on your desktop machine.   The second improvement is a new thread mode:  MAIN_ORDERED. It is a variation of the default MAIN thread mode and also ensures event delivery in the main thread. The difference is when an event is posted in the main thread: with MAIN it will pass on the event to subscribers immediately in a synchronous fashion. MAIN_ORDERED will only enqueue the event in the call to \r\t\t\t   post ( . . . ) for later delivery to subscribers. This gives event processing a stricter and more consistent order (thus the name MAIN_ORDERED). For example if you post another event in an event handler with MAIN thread mode, the second event handler will finish before the first one (because it is called synchronously – compare it to a method call). With MAIN_ORDERED, the first event handler would finish, and then the second one will be invoked at a later point in time (as soon as the main thread has capacity).\n We are considering making MAIN_ORDERED the default in a future version of EventBus. Because MAIN and MAIN_ORDERED behave slightly different, there may be some cases where this also may change an app’s behavior. It’s a trade off in every case: MAIN is faster when events are posted on the main thread and MAIN_ORDERED offers more consistent and predictable event delivery. Let us know what you think about it.\n One more thing: we would love to get some feedback on EventBus and how we can further improve it. Our  feedback form takes only a minute. Thank you!", "posttime": "2021-06-19 23:23:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,普通,事件", "title": "eventBus 3.1具有普通Java支持 ", "title_en": "EventBus 3.1 with plain Java support", "transed": 1, "url": "https://greenrobot.org/release/eventbus-3-1-plain-java-support/", "via": "", "real_tags": ["java", "普通", "事件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个月的Minutiae文章有一个主题：作为公立学校的生活\r老师在旧金山湾区2021年。\n 即使在互联网出现之前，抓住了学生作弊\r通常不是特别努力的。\r当一个小孩在课堂上不能在一起勾结句子时出现\r一篇文章充满了“容易解体”这样的短语\r并“强调悖论”，某些东西不会添加\r向上。\r（“虽然”这个词的出现是另一个可靠的红色\r旗帜。）\r捕捉这种渎职行为使得更容易\r抄袭检测软件的发展。\r您点击学生的提交，它会在屏幕上弹出\r已从已突出显示的SparkNotes复制的位。\r最近，我遇到了一名以为他弄明白的学生\r巧妙的方式击败这些计划。\r您知道有时候您有有多需要在短语上运行网络搜索并提取\r一堆带有URL的网站，看起来像随机生成的密码，\r谁的预览文本显示他们收集其他人的帖子\r并通过同义词库软件运行它们？\r这个孩子转过了一堆指分，看起来像预览\r文本。\r我要求学生在阅读时对每个章节写回应\r通过Philip K. Dick的那个高的人\r城堡;这是这个孩子的提交之一是如何开始的：\n 在CHAPET中，4名候选人焊接能力在W-M公司锐利\r即使作为美国前古老稀有性，它也会产生铁文章\r电话，在育儿商店这样的地方出售。最重要的兴趣\r来自日本人为这些事情制作了一个巨大的市场，没有\r一个专注地解决了他们。\n  弗兰克的焊接技能在W-M公司磨练，这使得\r锻铁物品以及战前美国工件伪造，售出\r在育儿商店这样的地方。日本人的大规模需求\r为这些物品创造了一个巨大的市场，没有人疑问\r密切。\n 我发现特别有趣的是，正如你可以看到的那样，其中一个\r主要角色被命名为弗兰克;学生的回应\r反复将此字符称为“Candid”（哪个，\r以上，进一步突变为“候选”）。\r抄袭检测软件确实被愚弄了！\r学生没有意识到的是教师不需要\r软件能够讲述诚实组成之间的区别\r句子和计算机生成的gibberish。\n 我发现的另一件事是很多\r学生 - 不仅仅是一对夫妇，还有几个\r每个类 - 一致地使用重构来代替报价\r标记和急性重音标记代替撇号。\r例如，这是一个重新签名斯科特问题的学生\r麦克劳德的zot !:\n 白兰地说，¨谁想和我一起出去？♥全部\r男孩们大喊大叫，我，我♥。\r白兰地的第一个约会在他家的尖顶。\r伍迪称斯皮克并告诉他，轮到他了\r日期白兰地。伍迪和白兰地去餐厅约会。伍迪问她\r如果她感觉到，她说♥是♥。 \n我不知道这是怎么发生的 - 我必须做一些戳\r围绕字符代码表来弄清楚如何复制\r影响。\r对我来说更有趣的是学生的混乱\r我指出，嘿，那些不是引号。\r它表明他们还没有阅读足够的常规书籍\r排版是内化的引号和撇号\r实际上看起来像印刷品。\n ellie报告在巴士站偷听了一些高中女孩\r谈论伟大的盖茨比：\n “并不真地。我知道的一件事是主角\r通过他/他代词来“\n 那个是不可能击败的，但这是一个荣誉\r从同一对话中提及：\n “那是好的，因为我只是在奇怪的事情上寻找\r正在发生，然后写下她不会得到的俚语\r'哦，屎'和'他妈的''\n 艾莉觉得这个孩子似乎没有那么担心\r在学校分配中遇到诅咒但是\r老师会被这样的宇宙俚语困扰。\r她真的认为“狗屎”和\r“他妈的”被zoomers创造出来？\n 与此同时，这是在老师电子邮件中的样子\r线程。\r这是一个逐字，非讽刺的报价： \nWarning: Can only detect less than 5000 characters", "note_en": "This month’s minutiae article has a theme: life as a public school\rteacher in the San Francisco Bay Area in 2021.\n Even before the advent of the internets, catching students cheating\rwas generally not particularly hard. \rWhen a kid who can’t string a sentence together in class shows up\rwith an essay full of phrases like “prone to disintegration”\rand “underscore the paradoxes”, something doesn’t add\rup. \r(The appearance of the word “whilst” is another reliable red\rflag.) \rCatching this sort of malfeasance has gotten even easier with the\rdevelopment of plagiarism detection software. \rYou click on a student’s submission and it pops onto the screen with\rthe bits that have been copied from Sparknotes already highlighted. \rRecently I encountered a student who thought that he had figured out an\ringenious way to defeat these programs. \rYou know how sometimes you will run a web search on a phrase and it pulls\rup a bunch of sites with URLs that look like randomly generated passwords,\rwhose preview text reveals that they collect other people’s posts\rand run them through thesaurus software? \rThis kid turned in a bunch of assignments that looked like that preview\rtext. \rI had asked students to write responses to each chapter as they read\rthrough Philip K. Dick’s  The Man in the High\rCastle; here was how one of this kid’s submissions began:\n In chapet 4 candidates welding abilities were sharpened at W-M corporation\rwhich makes created Iron articles even as pre-war American ancient Rarity\rphonies, sold at places like childan’s shop. the biggest interest\rfrom the Japanese has made an immense Marketplace for such things and no\rone addresses them intently.\n  Frank’s welding skills were honed at W-M Corporation, which makes\rwrought-iron objects as well as pre-war American artifact forgeries, sold\rat places like Childan’s shop. The massive demand from the Japanese\rhas created a huge market for such items, and no one questions them very\rclosely.\n What I found particularly amusing was that, as you can see above, one of\rthe main characters is named Frank; the student’s responses\rrepeatedly referred to this character as “Candid” (which,\rabove, was further mutated into “candidate”). \rAnd the plagiarism detection software was indeed fooled! \rWhat the student didn’t realize is that teachers don’t need\rsoftware to be able to tell the difference between honestly composed\rsentences and computer-generated gibberish.\n Another thing I’ve discovered is that many\rstudents—​not just a couple here and there, but several in\revery class—​consistently use umlauts in place of quotation\rmarks and acute accent marks in place of apostrophes. \rFor instance, here’s a student recapping an issue of Scott\rMcCloud’s  Zot!:\n Brandy says, ¨​who wants to go out with me?​¨ All\rthe boys yell ¨​ME, ME, ME​¨.\rBrandy​´​s first date was with Spike at his house.\rWoody calls Spike and tells him that it​´​s his turn to\rdate Brandy. Woody and Brandy go to Restaurant for a date. Woody ask her\rif she is feeling right and she says ¨​yes​¨.\n I don’t know how this happens—​I had to do some poking\raround on character code tables just to figure out how to replicate the\reffect. \rWhat’s more interesting to me is the students’ confusion when\rI point out that, hey, those aren’t quotation marks. \rIt suggests that they haven’t read enough books with conventional\rtypography to have internalized what quotation marks and apostrophes\ractually look like in print.\n Ellie reports overhearing some high school girls at the bus stop\rtalking about  The Great Gatsby:\n “Not really. The one thing I know is that the main character\rgoes by he/him pronouns”\n That one is pretty much impossible to beat, but here was an honorable\rmention from the same conversation:\n “Nah, which is good because I just look for when weird things\rare happening and then write slang words she won’t get like\r‘oh shit’ and ‘what the fuck’”\n Ellie was struck by the way this kid seemed concerned not that she would\rget in trouble for cursing in a school assignment but rather that the\rteacher would be baffled by such esoteric slang. \rDid she really think that the words “shit” and\r“fuck” were coined by zoomers?\n Meanwhile, here’s what it’s like in the teacher email\rthreads. \rThis is a verbatim, non-ironic quote:\n “I didn’t really hear you at first, steeped as I am in a\rculture of assumed patriarchal white privilege, rank privilege, and\rinequitable hierarchy.”\n The school where I’ve been teaching is notorious for its\rextremely lax attitude toward student discipline. \rBack when we were still on campus full time, rarely did a week go by\rwithout the fire alarm interrupting classes. \rThis was usually due to someone smoking in a bathroom, but one time\rduring my student teaching year it turned out that someone had tried to\rset one of the buildings on fire deliberately. \rOne of the vice principals came on the intercom a couple of days later\rto announce that the school was taking a zero-tolerance stance toward\rarson. \r“We will impose the harshest possible penalty,” she declared:\r“Five days of on-campus suspension!” \rMy mentor teacher burst out laughing. \r“That makes it official—​there is literally nothing you\rcan do to get expelled from this school,” he mused. \rBut that sort of thing actually has less of an effect on the overall\rculture of the school than day-to-day issues like the lack of consequences\rfor tardiness. \rMost teachers seem to take it as a given that of\r course half the class is going to wander in half an\rhour late during first period—​it’s so early, you\rknow!—​ and during fourth period,\rbecause you know how long those lines can get at the lunch places the kids\rall go to, halfway across town. \rI’ve sometimes even had to remind myself that, hey, wait, when I was\rin school, class started when the bell rang because everyone was\rthere! \rOf course, it’s different at a suburban school where parents are\rdriving their kids to the front gate instead of leaving them to get there\rby their own devices, except wait no it isn’t because from age\rsixteen on my old classmates were generally driving themselves. \rIt really is a matter of school culture.\n And this culture affects academics as well. \rPrior to the arrival of the covids, my program had a no-homework policy:\rif I wanted my students to write an essay, I had to block off a full week\rof class time so they could write it at their desks, and even assigning a\rbook meant that I had to either spend a month reading it out loud all the\rway through or at least devote big chunks of every class to silent\rreading. \r(I did a count of the number of books I was assigned in my last two years\rof high school English classes, and I came up with\r\t twenty-three. \rI assigned three per year and had parents emailing me to thank me for\rthe academic rigor of my class, as apparently a number of teachers\rweren’t assigning any books at all.) \rWith the move to distance learning came state-mandated homework minutes,\rbut soon the directives from the school in this regard became a confusing\rmishmash of “you’re legally required to assign this much\rhomework, so make sure you do that, only don’t, because the kids\rare overwhelmed”. \rThat too was in keeping with a theme. \rThe teacher email I mentioned above was from one of the conference\rthreads, but the emails sent to me personally from counselors and\radministrators have overwhelmingly broken down along these lines:\rsuch-and-such a student is feeling stressed, so please excuse her\rfrom this set of assignments. \rThis other student gets nervous about taking tests or giving presentations\ror working in groups, so please excuse him from work of those types. \rAnother initiative headed for mandate status is a school policy that no\rassignment can receive a grade of less than 50%, even if it was never\rturned in, the idea being that if you blow off all your work for months\ron end and then decide, with two weeks in the semester, that you actually\rdo want to pass the class, seeing that you have a zero is too\rdiscouraging. \rIt goes without saying that in tandem with this came a corollary that\rlate work must be accepted right up to the end of the term. \rAnd my direct supervisor repeatedly demanded that I pace my classes for\rthe benefit of the single student in each section who was struggling the\rmost, which quite literally would have meant putting students who had\rsigned up for Advanced Placement into a remedial course. \rColleagues from programs where these moves happened earlier have pointed\rout what the results have been: kids wind up with stellar grade point\raverages and glowing recommendations, get into top colleges, and…\rdrop out after about three weeks, saying that they feel like they’re\ryears behind everyone else and don’t know what’s going on,\rbecause they are and they don’t.\n Early in my previous career teaching test prep, a trainer told a story\rabout how during George W. Bush’s tenure as governor of Texas,\rthe state implemented a testing regime to identify students whose measured\rproficiency was not up to standard. \rAs it turned out, there were a lot: the first batch of test scores was\rabysmal. \rAnd so the state of Texas remedied this gap by… making the test\reasier. \rThe next time around, scores skyrocketed. \rProblem solved!\n Anyway, it turns out that you don’t need to go to Texas for that\rsort of thing. \rWith half the term remaining, teachers of seniors received a notification\rthat they would not be allowed to fail students unless they filled out a\rform right then and there declaring that the student was\r certain to receive an F. \rSee how that works? \rFirst you require that teachers accept late work right up to the end of\rthe term; then you load up your “F Confirmation Form”\rwith language indicating that only students “receiving a\rguaranteed F” (at a point when nothing could possibly be\r“guaranteed”) and who will “absolutely get\ran F” and are “definitely not going to pass”\r(at a point when nothing could possibly be “absolute” or\r“definite”) can be given failing grades. \rFailing grades are thus impossible. \rWow, a 100% pass rate! \rWhat a successful school!", "posttime": "2021-06-19 23:23:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,湾区,公立学校,public,学生", "title": "生活作为2021年旧金山湾区的公立学校老师 ", "title_en": "Life as a public school teacher in the San Francisco Bay Area in 2021", "transed": 1, "url": "http://adamcadre.ac/calendar/202105m.html", "via": "", "real_tags": ["旧金山", "湾区", "公立学校", "public", "学生"]}, {"category": "", "categoryclass": "", "imagename": "d77081a1cdcfd5069c6d6896ecfbc2b6.png", "infoid": 1066899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "|\r我今天收到了Google的电子邮件，标题是“更新到您的Google帐户”。\n 电子邮件的主旨是谷歌想要更改与我的帐户相关的国家/地区，大概是基于最近录制与我的帐户相关的IP地址。\n  我们将Google帐户与国家（或地区）联系起来，以便我们可以更好地为您提供服务。该协会用于确定两件事：提供服务的Google公司，处理您的信息并负责遵守适用的隐私法\n  管理我们关系的服务条款版本，这可能因当地法律而有所不同。\n      请记住，无论您的国家协会如何，Google服务都是相同的。此外，您在Google帐户中可能拥有的任何购买的内容和银行信息将保持不变。\n 我发现好奇的是，它表示服务基本相同。因此，对我来说，我没有任何改变的消费者。\n 对我来说有缺点，因为欧洲的隐私法比亚洲强，我失去了一些隐私保护。这是巧合吗？ \n我不想成为愤世嫉俗的，但对我来说似乎很怀疑。作为一个旅行的人（最近！），我永远不会为我自动完成。这从未发生过，所以它必须是最近的政策变革。\n 如果我四处走动，我想知道他们是否会每隔几个月改变这种变化？是否有一些标准触发这种情况发生？\n 此外，在电子邮件中，它会指示如何纠正您的相关国家/地区：\n 如果与您的帐户相关的国家/地区与您的居住国不匹配...您可以通过审查Google服务条款来查找有关您的国家协会的更多信息，以及如果您认为这是错误的话，请通过审查Google服务条款。\n  在一些搜索之后，我找到了如何使国家协会查询。这只是一个简短的形式，你选择了你的国家，并给出了为什么这是一个错误的原因。当您提交表格时，它说“将在几周内通过电子邮件回复您的些什么。”\n 哪将首先发生？国家协会的自动切换，或谷歌回复我的询问？这将是一场比赛！\n   您最近向我们发送了更改与您的Google帐户相关的国家/地区的请求。审核帐户后，我们认为您当前的国家协会是准确的，我们没有改变任何事情。 \n您所在的国家/地区：马来西亚您可以通过查看谷歌的服务条款来查看与您的帐户相关联的国家。  这似乎是忙碌的工作，但我认为尽你所能保护你的隐私是很重要的。 如果您无所作为，谷歌和其他人将在在利润增加时在线侵蚀您的权利。 如果我们不注意并提出这些问题，那么他们可能会被忽视，可能被视为真实的。 ", "note_en": "| \r\t\t       I got an email from Google today with the title “An update to your Google Account”.\n The gist of the email is that Google wants to change the country associated with my account, presumably based on recently recorded IP addresses associated with my account.\n  We associate your Google Account with a country (or region) so that we can better provide our services to you. This association is used to determine two things:The Google company that provides the services, processes your information and is responsible for complying with applicable privacy laws\n  The version of the Terms of Service that governs our relationship, which can vary depending on local laws.\n      Bear in mind that Google services are essentially the same, regardless of your country association. Also, any purchased content and banking information that you might have in your Google Account will remain the same.\n What I find curious is that it says the services are essentially the same between different countries. So, there is no advantage to me as a consumer for anything to change.\n There is a disadvantage for me, because the privacy laws in Europe are stronger than Asia, I lose some privacy protection. Is this a coincidence?\n I don’t want to be cynical, but it seems suspicious to me. As someone who travels a lot (not recently!), I would never want this done automatically for me. This has never happened before, so it must be a recent policy change.\n I wonder if they will they make this change every few months in the future if I move around? Is there some criteria that triggers this to happen?\n Further in the email, it gives an indication of how you can request to correct your associated country:\n If the country associated with your account doesn’t match your country of residence…You can find more information about your country association, and a way to request a change if you think that it’s wrong, by reviewing the Google Terms of Service.\n  After some searching, I found how to make a  Country Association Inquiry. It’s just a short form where you pick your country and give a reason why this is a mistake. When you submit the form, it says something like “We’ll get back to you by email within a few weeks.”\n Which will happen first? The automatic switching of the country association, or Google responding to my inquiry? It’s going to be a race!\n   You recently sent us a request to change the country associated with your Google Account. After reviewing your account, we think your current country association is accurate and we didn’t change anything.\n  Your country:MalaysiaYou can see the country associated with your account by looking at Google’s Terms of Service.\n This may seem like busy work but I think it’s important to do what you can to protect your privacy. If you do nothing, Google and others will erode your rights online if it correlates with increasing profits. If we don’t pay attention and raise these kind of issues, then they might go unnoticed and may be considered bona-fide.", "posttime": "2021-06-19 23:23:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,update,国家", "title": "您的Google帐户的不需要更新 ", "title_en": "An unwanted update to your Google Account", "transed": 1, "url": "https://roboleary.net/2021/05/01/unwated-change-to-your-google-account.html", "via": "", "real_tags": ["google", "update", "国家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依靠您的支持：本网站主要由广告支持。广告是允许这个网站在过去的16年中保持的。我们尽力确保只能清洁，相关广告显示，当检测到任何令人讨厌的广告时，我们努力尽快删除它们。如果您想在没有广告的情况下查看该网站，同时仍然支持我们的工作，请考虑我们的广告Phoronix保费。您还可以通过PayPal考虑提示。从70年代后期开发的Modula-2编程语言到80＆＃39; s最终会在2021年看到主线GNU编译集合（GCC）支持。\r   结构化的调制 -  2编程语言是，由尼克劳斯Wirth的Eth苏黎世，他的工作也以欧拉，帕斯卡和其他编程语言而闻名。 Modula-2仍然有一些今天用途与俄罗斯＆＃39; s glonass卫星。\r   与许多其他调制-2编译器一起，GM2＆＃34; GNU Modula-2＆＃34;已经为GCC平台维护，现在GM2＆＃39之后的十多年了。在GCC编译器上的上游致力于在上游工作。周四发布的邮件列表帖子，并希望将Modula-2 / GM2支持的最新补丁进行了主线GC代码库。请参阅此邮件列表帖子，用于所有技术细节，如果有兴趣。\r   GNU Modula-2代码实现了Modula-2的PIM2 / PIM3 / PIM4 / ISO方言，并且编译器前端不仅在X86 / x86_64上测试，还原了AARCH64。 ", "note_en": "We Rely On Your Support: This site is primarily supported by advertisements.  Ads are what have allowed this site to be maintained for the past 16 years. We do our best to ensure only clean, relevant ads are shown, when any nasty ads are detected, we work to remove them ASAP. If you would like to view the site without ads while still supporting our work,  please consider  our ad-free Phoronix Premium. You can also consider  a tip via PayPal.   The Modula-2 programming language developed from the late 70&#39;s to 80&#39;s might finally see mainline GNU Compiler Collection (GCC) support in 2021.\r   The structured Modula-2 programming language is that out of ETH Zurich by Niklaus Wirth who is known for his work as well on Euler, Pascal and other programming languages. Modula-2 still has some uses today like with Russia&#39;s GLONASS satellites.\r   Alongside many other Modula-2 compilers, GM2 &#34;GNU Modula-2&#34; has been maintained for GCC platforms and now more than one decade after GM2&#39;s 1.0 release this front-end has been working on getting upstream in the GCC compiler.  A mailing list post was made on Thursday with the latest patches looking to get the Modula-2/GM2 support into the mainline GC code-base. See that mailing list post for all the technical details if interested.\r   The GNU Modula-2 code implements the PIM2 / PIM3 / PIM4 / ISO dialects of Modula-2 and the compiler front-end has been tested not only on x86/x86_64 but also AArch64.", "posttime": "2021-06-19 23:23:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "主线,front,广告", "title": "Modula-2前端仍然在2021年朝着主线GCC ", "title_en": "Modula-2 Front-End Still Looking Towards Mainline GCC in 2021", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Modula-2-GCC-Mainline-Hope-2021", "via": "", "real_tags": ["主线", "front", "广告"]}, {"category": "", "categoryclass": "", "imagename": "0a91acd9e8af51be5ee9da5275a73174.jpeg", "infoid": 1066897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "北极圈北部五百英里，在一个苦涩的冬季大风中，一支驯鹿团队在西伯利亚苔原上疲惫不堪。这是1914年的仲冬。太阳持续了数周;空气朦胧，钻石硬雪。一个毛皮的人物把她的麻木腿拉出了一个碎袋子包，然后努力下车，因为她的指南承认他们丢失了她的木制雪橇。寒冷和饥饿，玛丽亚czaplicka幻想杀死其中一个驯鹿，以便她可以喝它的温暖，滋补血液。她想知道是否有希望实现自己的目标：与Tungu人民联系，今天知道为期间，从未遇到过欧洲女子的杰出牧民。\n  Czaplicka是五个迷人的迷人女性之一，从弗朗西斯Larson在“不熟练的海岸：英国人类学的隐藏女主角”中拉出历史的阴影之一。 Larson女士是英格兰达姆兰大学人类学的荣誉研究员。在完成博士后，她是牛津大学皮特河博物馆的研究助理，非凡的考古和人类学收藏。该博物馆成立于1884年，并由其福斯多斯，奥古斯斯亨利巷福克斯皮特河落实的条件是，该大学应该在新的人类学科学中任命一位讲师。\n  纪律的男性创始人渴望绘制并分类世界的文化。起初，这些基于博物馆的人类学家依赖于旅行者的报告和传教士的报告和信件，了解“原始”人民信仰，仪式，外观，房屋，食品和文物。他们很少认为有必要与他们所学习的人共度时光。但是，曾经有自己的讲师成为大学课程，所以需要学生。这些学生将帮助改变进行人类学研究的方式。\n  作为一个新计划，女性比既定方案更能获得人类学文凭。 1907年至1918年间，27名女性（与103名男子相比）注册，加入20世纪初，在20世纪初，在20世纪初，在20世纪初的妇女在他们的男性同行勉强承认，谁只能参加陪伴派对和沉默条件的讲座。他们预计，Larson女士告诉我们，“周边，文职和感恩”。 “未被揭露的海岸”的五名妇女克服了这些态度，成为英国第一个女性人类学家，在世界上一些最偏远的角落实现了突破性的研究。\n  凯瑟琳·罗德利，北英格兰工业家的女儿，委托她自己的船，在南太平洋举行到复活节岛，是世界上最多的孤立的社区之一。她编制了覆盖着岛屿的大石雕的第一个系统地图。 Barbara Freire-Marreco，来自萨里的舒适和传统的中产阶级家园，在新墨西哥州和亚利桑那州的Adobe Pueblos工作和生活。她沉浸了自己，因为没有男性人类学家可以做到，在那些社区的妇女的工作中，玉米母鸡，针线活，传统药物的准备 - 即使他们的生活方式被白人定居者侵蚀。波兰出生的Czaplicka穿过西伯利亚冬天的3,000英里，了解猎人在黑暗中度过了大部分时间的传统。她观察了助焊剂的文化，通过跨西伯利亚铁路完成了1904年永远改变。来自一款更加的黑人，来自一个温钢，但贫困的英国牧师的家庭，花了19个赛季与上埃及的农业农民住在一起。村庄之间的斗争很常见，她最可靠的指南被谋杀了。但是，她躲避了这类冲突，而不是逃离这种冲突，做出笔记和拍照。 Beatrice Blackwood是一个寡妇的一扇形长者孩子，走进新几内亚未映射的丛林。她也见过，而且衷心地不信任，女性人类学家玛格丽特米德的统治之星。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "Five hundred miles north of the Arctic Circle, in a bitter winter gale, a team of reindeer collapsed with exhaustion on the Siberian tundra. It was midwinter 1914. The sun had not risen for weeks; the air was hazy with diamond-hard snow. A furclad figure pulled her numb legs out of a buckskin bag, then struggled to get off her wooden sled as her guide admitted they were lost. Chilled and starving, Maria Czaplicka fantasized about killing one of the reindeer so that she could drink its warm, nourishing blood. She wondered if there was any hope of achieving her goal: to make contact with the Tungu people, known today as Evenks—nomadic reindeer-herders who had never met a European woman.\n  Czaplicka is one of five fascinating, intrepid women pulled from the shadows of history by Frances Larson in “Undreamed Shores: The Hidden Heroines of British Anthropology.” Ms. Larson is an honorary research fellow in anthropology at Durham University in England. After completing her doctorate, she was a research associate at Oxford University’s Pitt Rivers Museum, home of an extraordinary archaeological and anthropological collection. The museum was established in 1884, and a condition set by its benefactor, Gen. Augustus Henry Lane-Fox Pitt-Rivers, was that the university should appoint a lecturer in the new science of anthropology.\n  The discipline’s male founders were eager to chart and categorize the world’s cultures. At first, these museum-based anthropologists relied on travelers’ reports and letters from missionaries for details of “primitive” people’s beliefs, ceremonies, appearance, houses, food and artifacts. They rarely thought it necessary to spend time with the people they studied. But once anthropology became a university course with its own lecturer, it needed students. Those students would help change the way that anthropological research was conducted.\n  As a new program, the anthropology diploma was more accessible to women than the established programs were. Between 1907 and 1918, 27 women (compared with 103 men) registered, joining the few hundred women studying at Oxford in the early 20th century who were barely acknowledged by their male peers and who could attend lectures only in chaperoned parties and on condition of silence. They were expected, Ms. Larson tells us, to be “peripheral, clerical and grateful.” The five women of “Undreamed Shores” overcame these attitudes and became Britain’s first female anthropologists, achieving groundbreaking research in some of the most remote corners of the world.\n  Katherine Routledge, the daughter of a North England industrialist, commissioned her own boat and sailed to Easter Island, in the South Pacific, one of the most isolated communities in the world. There she compiled the first systematic map of the great stone statues that covered the island. Barbara Freire-Marreco, from a comfortable and conventional middle-class home in Surrey, worked and lived in the adobe pueblos of New Mexico and Arizona. She immersed herself, as no male anthropologist could have done, in the work expected of women in those communities—maize-husking, needlework, the preparing of traditional medicines—even as their way of life was eroded by white settlers. Polish-born Czaplicka trekked 3,000 miles through the Siberian winter to learn the traditions of hunters who spent much of the year in darkness. She observed a culture in flux, changed forever in 1904 by the completion of the Trans-Siberian Railway. Winifred Blackman, from a genteel but impoverished Anglican vicar’s family, spent 19 seasons living with the agricultural peasants of Upper Egypt. Fights between villages were common, and her most reliable guide was murdered. But instead of fleeing from such conflicts, she dodged about, making notes and taking photos. Beatrice Blackwood, the single-minded eldest child of a widow, traveled into the unmapped jungles of New Guinea. She also met, and heartily distrusted, the reigning star of female anthropologists, Margaret Mead.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-19 23:22:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "改变,shores,人类学", "title": "“未经衰退的海岸”评论：改变人类学的妇女 ", "title_en": "‘Undreamed Shores’ Review: The Women Who Changed Anthropology", "transed": 1, "url": "https://www.wsj.com/articles/undreamed-shores-review-the-women-who-changed-anthropology-11624025240", "via": "", "real_tags": ["改变", "shores", "人类学"]}, {"category": "", "categoryclass": "", "imagename": "8bbef27dfd8e76a437e2b43fc830f164.jpg", "infoid": 1066896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lojban是一种构造的语言。 其特征之一，真正吸引了我，是在书面或口语时毫不含糊的解析。 这意味着它可以...... ", "note_en": "Lojban is a constructed language. One of its features that really attracted me was its unambiguous parsing when written or spoken. This means that it could b...", "posttime": "2021-06-19 23:22:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lojban,introduction,书面", "title": "Lojban介绍 ", "title_en": "Introduction to Lojban", "transed": 1, "url": "https://m.youtube.com/watch?v=KgxOrTvpWJ4", "via": "", "real_tags": ["lojban", "书面"]}]