[{"category": "", "categoryclass": "", "imagename": "4cc33e1bca37120cdcc2fcb34da00718.jpg", "infoid": 1068574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您从Verge链接购买的内容，Vox Media可能会获得佣金。看看我们的道德声明。\n Windows 11在今年晚些时候到达Windows 10用户的免费升级，但许多人发现它们的硬件不兼容。微软已经改变了最低的硬件要求，这是在这里最令人惊讶的CPU变化。 Windows 11将仅正式支持第八次Gen和Newer Intel核心处理器，以及Apollo Lake和Nuder Pentium和Celeron处理器。\n 这潜在规定了数百万现有的Windows 10设备以全面支持升级到Windows 11，甚至是Microsoft自己的Surface Studio 2等设备，该公司现在仍然销售3,499美元。在Windows 11安装期间，不会正式支持的旧设备将在Windows 11安装中满足警告，因此不建议升级，但操作系统仍应安装。\n Windows 11还将仅正式支持AMD Ryzen 2000和更新的处理器，以及第2个Gen或Newer Epyc芯片。您可以在Microsoft的网站上找到支持的受支持的处理器的完整列表，但这是基本细分：\n     Microsoft，Microsoft指出，CPU生成要求是Windows 11安装程序的“软楼层”限制，这应该允许一些较旧的CPU能够使用警告安装Windows 11，但我们发布此故事后的小时数，该公司更新了该页面明确要求上面的芯片列表。我们已达到Microsoft以澄清其CPU要求和支持，并将相应地更新您。\n 许多Windows 10用户一直在下载Microsoft的PC Health应用程序（此处提供），以查看Windows 11是否在其系统上工作，只能发现它失败了检查。当Microsoft现在需要TPM（可信平台模块）时，这导致了一些额外的硬件支持混淆。\n 早期页面表示Windows 11还需要能够至少1.2个支持和UEFI安全引导的TPM。这两种技术都旨在提高Windows的安全性，并防止恶意软件和赎金软件篡改加密密钥和操作系统的其他安全元素。现在，看来微软可能是强制TPM 2.0，但我们再次检查。 \n虽然Microsoft为Windows 10以来，Microsoft需要TPM支持OEM硬件认证，但它尚未主动要求Windows进行完全启用。在Windows 11中发生变化，这意味着如果您的笔记本电脑或电脑没有启用这些BIOS选项，那么您必须要去搜索打开的设置。\n   “过去5  -  7年的几乎每个CPU都有一个TPM，”微软企业企业主任David Weston解释说明。 Weston推荐Windows 10未通过Microsoft的Windows 11升级检查器要求，应确保在AMD设备上启用英特尔系统上的“PTT”的BIOS选项，或“PSP FTPM”。由于每个BIOS都有不同的设置，如果您正在努力找到该选项，您可能需要引用笔记本电脑的手册。\n 如果您已启用TPM支持，但您仍然没有传递Windows 11升级检查器，它可能是因为您的CPU不受完全受支持的列表。英特尔已确认Microsoft的Windows 11 CPU要求。 “基于英特尔的广泛的平台将支持Windows 11：第8个Gen和Newer Intel核心处理器以及来自'Apollo Lake'代和更新的Intel Pentium处理器和英特尔Celeron处理器，”英特尔发言人说濒临边缘的陈述。\n 这是Windows硬件要求中的第一次显着转变，因为2012年的Windows 8释放，CPU变化是通过惊喜捕捉人员的理解。 Microsoft还需要面向前置的相机，用于所有Windows 11设备，除了从1月2023年1月开始的桌面PC。这是另一个更改，它将塑造Windows 11将在未来几年运行的硬件。\n 更新，5:45 AM ET：添加了有关Microsoft对Windows 11安装程序的软限制的详细信息。\n 更新，4:06 PM等：添加了Microsoft的兼容性页面现在已更改，具有不同的CPU和TPM要求。 ", "note_en": "If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n Windows 11 is arriving later this year as a  free upgrade for Windows 10 users, but many are discovering that their hardware isn’t compatible. Microsoft has  altered its minimum hardware requirements, and it’s the CPU changes that are most surprising here. Windows 11 will only officially support 8th Gen and newer Intel Core processors, alongside Apollo Lake and newer Pentium and Celeron processors.\n That potentially rules out millions of existing Windows 10 devices from upgrading to Windows 11 with full support, and even devices like Microsoft’s own Surface Studio 2 which the company is still  selling right now for $3,499. Older devices that aren’t officially supported will be met with a warning during the Windows 11 install that the upgrade is not recommended, but the OS should still install.\n Windows 11 will also only officially support AMD Ryzen 2000 and newer processors, and 2nd Gen or newer EPYC chips. You can find the full list of  supported processors on Microsoft’s site, but here’s the basic breakdown:\n     Originally,  Microsoft noted that CPU generation requirements are a “soft floor” limit for the Windows 11 installer, which should have allowed some older CPUs to be able to install Windows 11 with a warning, but hours after we published this story,  the company updated that page to explicitly require the list of chips above. We’ve reached out to Microsoft to clarify its CPU requirements and support, and we’ll update you accordingly.\n Many Windows 10 users have been downloading Microsoft’s PC Health App ( available here) to see whether Windows 11 works on their systems, only to find it fails the check. As Microsoft now requires a TPM (Trusted Platform Module), this has led to some additional confusion around hardware support.\n That earlier page said Windows 11  would also require TPM capable of at least 1.2 support and UEFI Secure Boot. Both of these technologies are designed to improve the security of Windows, and prevent malware and ransomware from tampering with encryption keys and other secure elements of the operating system. Now, it appears Microsoft may be mandating TPM 2.0, but again, we’re checking on that.\n While Microsoft has required TPM support for OEM hardware certification since Windows 10, it hasn’t actively required Windows to have this fully enabled. That’s changing in Windows 11, and it means if your laptop or PC shipped without these BIOS options enabled then you’re going to have to go searching for a setting to switch on.\n   “Almost every CPU in the last 5-7 years has a TPM,”  explains David Weston, director of enterprise and OS security at Microsoft. Weston is recommending that Windows 10 users failing Microsoft’s Windows 11 upgrade checker requirements should ensure BIOS options for “PTT” on Intel systems are enabled, or “PSP fTPM” on AMD devices. As every BIOS has different settings, you might need to refer to your laptop’s manual if you’re struggling to find the option.\n If you’ve enabled TPM support but you’re still not passing the Windows 11 upgrade checker, it’s likely because your CPU isn’t on the fully supported list. Intel has confirmed Microsoft’s Windows 11 CPU requirements. “A broad range of Intel-based platforms are expected to support Windows 11: 8th Gen and newer Intel Core processors, as well as Intel Pentium processors and Intel Celeron processors from the ‘Apollo Lake’ generation and newer,” says an Intel spokesperson in a statement to  The Verge.\n This is the first significant shift in Windows hardware requirements since the release of Windows 8 back in 2012, and the CPU changes are understandably catching people by surprise. Microsoft is also requiring a front-facing camera for all Windows 11 devices except desktop PCs from January 2023 onwards. It’s another change that will shape the hardware that Windows 11 will run on in the coming years.\n Update, 5:45AM ET : Added details about Microsoft’s soft limit for the Windows 11 installer.\n Update, 4:06PM ET:  Added that Microsoft’s compatibility page has now changed, with different CPU and TPM requirements.", "posttime": "2021-06-29 23:23:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,cpu,list", "title": "Windows用户惊讶于Windows 11的支持CPU列表 ", "title_en": "Windows Users Surprised by Windows 11's Short List of Supported CPUs", "transed": 1, "url": "https://www.theverge.com/2021/6/25/22549725/microsoft-windows-11-cpu-support-tpm-hardware-requirements", "via": "", "real_tags": ["windows", "cpu", "list"]}, {"category": "", "categoryclass": "", "imagename": "8e3ca1ad7620172a416275f2e495f24a.png", "infoid": 1068572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在今天的MWC活动中，三星展示了最新的SmartWatch接口，称为一个UI手表。该软件将在新的WEAR OS之上运行，该公司与Google共同开发。那些遵循三星的人会留意一个版本的一个UI已经存在的手表 - 它＆＃39;意图在银河系和手表之间进行界面感觉更加连贯。从我们今天所看到的，它看起来是佩戴操作系统的最新UI也会尝试这样做。在新闻稿中，该公司表示＆＃34;一个UI观看与新的统一平台一起创建一个完全新的Galaxy Watch体验。＆＃34;\n 当谷歌宣布最新的可穿戴平台与三星合作进行了合作时，它分享了如何从韩国公司学习如何优化某些流程以获得更好的响应性和电池性能。我们还看到了对导航的一些更改，如双击物理按钮即可在运行应用程序之间切换。但我们尚未完全崩溃更新的操作系统。\n  今天，三星展示了一些关于事情如何工作的细节。例如，当您在手机上安装兼容的应用程序时，它们也会在您的SmartWatch上下载到您的SmartWatch上。手机的设置也将侵入手腕 - 不同城市的各种时钟，＆＃39所选的不同城市将出现，而您则为您的数字且ve被封锁将保持阻止。这也适用于其他方式，所以如果你阻止你的手表，他们也会在你的银河电话上拿出黑名单。根据新UI的视频，手表的布局和＃39; S设置菜单也将＆＃34;密切反映＆＃34;在你的手机上。\n  Tizen＆＃39;缺点是缺乏第三方应用程序支持，并使用新的佩戴操作系统，打开了您可以安装的全新标题库。一个UI手表将提供Google Play商店，因此您可以直接从可穿戴的应用程序获取应用程序。其中一些应用程序包括Couch25k，Facer，Adidas，Golfbuddy，Carmbuddy，以及谷歌和＃39; S这样的应用程序，如地图，消息，YouTube音乐等。\n 三星和谷歌均表示，将有一个新的手表面部设计工具用于Android开发人员，以创建更有用的选项，更好地显示用户想要的数据。\n 虽然这绝不是令人遗憾的是新的磨损操作系统或一个UI手表，但它让我们更好地了解预期的内容。尽管如此，我们＆＃39必须等到它甚至要等到它向公众（或者当设备船用它时），不仅可以看到它的＆＃39; s，但如果它真正提供表现两家公司都承诺的好处。\n   ENGADGET推荐的所有产品由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括联盟链接。如果您通过其中一个链接购买某些内容，我们可能会获得联盟委员会。 \n由于您的隐私首选项，此内容不可用。 在此处更新您的设置，然后重新加载页面以查看它。 ", "note_en": "At its MWC event today, Samsung showed off its latest smartwatch interface called One UI Watch. This software will run on top of  the new Wear OS, which the company co-developed with Google. Those who follow Samsung closely will remember a version of  One UI already exists for watches — it&#39;s meant to make the interface between Galaxy phones and watches feel more coherent. From what we saw today, it appears the latest One UI for Wear OS will attempt to do that too. In  a press release, the company said &#34;One UI Watch together with the new unified platform will create an entirely new Galaxy Watch experience.&#34;\n When Google announced the latest wearable platform was made in collaboration with Samsung, it shared how it learned from the Korean company how to optimize certain processes for better responsiveness and battery performance. We also saw some changes to navigation, like a double click of a physical button to switch between running apps. But we have yet to get a full breakdown of the updated OS.\n  Today, Samsung showed a few more details on how things will work. For example, when you install compatible apps on your phone, they&#39;ll also be downloaded onto your smartwatch. Settings from your phone will also port over to your wrist — the various clocks for different cities you&#39;ve picked will show up, while the numbers you&#39;ve blocked will remain blocked. This also works the other way around, so if you block a person from your watch, they&#39;ll also get blacklisted on your Galaxy phones. According to a video of the new UI, the layout of the watch&#39;s Settings menu will also &#34;closely reflect&#34; that on your phone.\n  One of Tizen&#39;s shortcomings was a lack of third-party app support, and with the new Wear OS that opens up a whole new library of titles you can install. One UI Watch will offer the Google Play Store so you can get apps directly from your wearable. Some of the apps this brings include Couch25K, Facer, Adidas, GolfBuddy, Calm, as well as Google&#39;s apps like Maps, Messages, YouTube Music and more.\n Samsung and Google both also said there will be a new watch face design tool for Android developers to create more useful options that better display the data their users want at a glance.\n While this is by no means an exhaustive look at the new Wear OS or One UI Watch, it gives us a better idea of what to expect. To fully experience the software, though, we&#39;ll have to wait till it rolls out to the public (or when devices ship with it) to not only see what it&#39;s like but also if it truly delivers the performance benefits that both companies have promised.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-06-29 23:22:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手表,watch,应用程序", "title": "三星详细介绍了一个名为一个UI手表的新的SmartWatch用户界面，在今年晚些时候在即将举行的Galaxy手表中亮相 ", "title_en": "Samsung details a new smartwatch user interface called One UI Watch, debuting on an upcoming Galaxy Watch later this year", "transed": 1, "url": "https://www.engadget.com/samsung-one-ui-watch-wear-os-details-171505347.html", "via": "", "real_tags": ["手表", "watch", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "b7f203a1515abbd867502b40147cd03e.png", "infoid": 1068571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雄心勃勃的AR启动从一系列顶级投资者筹集了3750万美元，包括基准，第一轮，Kleiner Perkins和谷歌的渐变创业，他们正在投注其对托管增强现实内容的面向消费者的平台的愿景。其最近公开披露的融资是2018年10月的2700万美元的B系列。\n Discord收购的条款未披露，但最近几个月似乎抛弃了它在第一个多年建设中花费的大部分产品，这表明普通症6已经为其产品寻找广泛的受众的问题。\n   在2017年推出，ubiquity6希望构建一个应用程序，该应用程序将是移动电话用户将浏览增强现实内容的应用程序。 2019年底，启动推出了一个名为Displayland的产品，该产品旨在使用智能手机的相机游戏3D扫描物理环境的过程。\n 该公司寻找大规模采用的努力被移动AR市场妨碍了，这在近年来仍未获得了从科技巨头的投资，包括Apple和Google等困扰。\n 2020年代初，首席执行官Anjney Midha告诉TechCrunch，初创公司有大约65名员工。\n  最近几个月，泛互惠6已经执行了一个非常剧烈的枢轴，完全留下了增强的现实，支持建立一个桌面平台，让用户远程一起玩简单的在线派对游戏。 Beta平台称为后院，专为大流行时代的习惯而设计，因为美国泉水恢复行动时似乎正在下降。后院是本周停产的作为收购公告的一部分。\n 在宣布收购的中期岗位中，Midha似乎淡化了任何预期，普里奇斯6的增强现实技术将居住在内部不和谐。 \n“我们在普通症的使命始终是通过共享体验来解锁人们来联系的新方法，”Midha写道。 “今天加入不和谐使我们能够加速使命 - 难以努比力6的团队，后院产品和多人技术将集成到不和谐中。” ", "note_en": "The ambitious AR startup had raised $37.5 million from a series of top investors including Benchmark, First Round, Kleiner Perkins and Google’s Gradient Ventures who were betting on its vision of building a consumer-facing platform for hosting augmented reality content. Its most recent publicly disclosed financing was a $27 million Series B in October of 2018.\n Terms of the Discord acquisition weren’t disclosed, though in recent months the startup seemed to abandon most of the products it had spent its first several years building, suggesting that Ubiquity6 had been having some issues finding wide audiences for its products.\n   Launching back in 2017, Ubiquity6 hoped to build an app that would be the central way mobile phone users would browse augmented reality content. In late 2019, the startup  launched a product called Displayland, which aimed to gamify the process of 3D scanning physical environments with a smartphone’s camera.\n The company’s efforts to find mass adoption were hampered by a mobile AR market, which has largely failed to gain any momentum in recent years despite hefty investment from tech giants, including Apple and Google.\n In early 2020, CEO Anjney Midha told TechCrunch that the startup had some 65 employees.\n  In recent months, Ubiquity6 had executed a pretty drastic pivot, leaving augmented reality completely behind in favor of building out a desktop platform that allowed users to play simple online party games together remotely. The beta platform, called  Backyard, was designed for pandemic era habits that seem to be on the decline as the US springs back into action. Backyard was discontinued this week as part of the acquisition announcement.\n In a  Medium post announcing the acquisition, Midha seems to downplay any expectations that Ubiquity6’s augmented reality technology will be living on inside Discord.\n “Our mission at Ubiquity6 has always been to unlock new ways for people to connect through shared experiences,” Midha wrote. “Joining Discord today allows us to accelerate that mission — Ubiquity6’s team, Backyard product and multiplayer technology will be integrated into Discord.”", "posttime": "2021-06-29 23:22:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,协作,collaborative,收购", "title": "Discord获取增强现实启动泛素ithiquity6，它筹集了37.5米，最近枢转成为简单在线游戏的协作服务 ", "title_en": "Discord acquires augmented reality startup Ubiquity6, which had raised $37.5M and recently pivoted to become a collaborative service for simple online games", "transed": 1, "url": "https://techcrunch.com/2021/06/28/discord-acquires-augmented-reality-startup-ubiquity6/", "via": "", "real_tags": ["游戏", "协作", "收购"]}, {"category": "", "categoryclass": "", "imagename": "558be2d47a7c345a5128f7a0a3f8d302.jpg", "infoid": 1068570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Coinbase已收到德国金融监管机构（Bafin）的加密托管许可，允许乐队继续为德国市场提供服务。巴夫林周一宣布了新闻。\n Bafin在新闻稿中表示，Coinbase是第一家收到许可证的公司。\n 2019年11月，德国的议会 - 联邦议院 - 通过了一项法律，要求为德国申请加密拘留许可或离开德国的加密申请。 2020年1月1日在该国在该国运营的公司被要求宣布其目的申请于那个年度31日申请，并于11月30日申请。\n 批准发生在乐队队正在努力证明自己是一个交换，这些交易所在美国在美国直接上市后公开公开。\n  与此同时，铸造竞争对手指挥官已被监管机构警告，以停止在U.K.和日本在加拿大安大略省省外运作，以避免从安大略省证券委员会（OSC）的审查。\n 通过注册，您将收到关于COINDESK产品的电子邮件，您同意我们的条款和amp;条件和隐私政策。\n   COINDESK披露了关于加密货币，数字资产和金钱未来的信息，数字资产和未来的信息，是一种跨越最高的新闻标准，并遵守严格的编辑政策。 COINDESK是数字货币集团的独立运营子公司，投资加密货币和区块链初创公司。 ", "note_en": "Coinbase has received a crypto custody license from Germany’s Financial Supervisory Authority (BaFin), allowing Coinbase to continue serving the German market. BaFin  announced the news Monday.\n Coinbase is the first company to receive the license, BaFin said in a press release.\n In November 2019, Germany’s parliament – the Bundestag –  passed a law that required firms custodying crypto for Germans to apply for a crypto custody license or leave Germany. Companies that were already operating in the country on Jan. 1, 2020,  were required to announce their intent to apply by March 31 of that year and apply by Nov. 30.\n The approval comes at a time in which Coinbase is trying to prove itself to be an exchange that embraces regulation after having gone public in the U.S.  via a direct listing in April.\n  At the same time, Coinbase rival Binance has been warned by regulators to stop operating in the  U.K. and  Japan, and has  pulled out of Canada’s Ontario province to avoid scrutiny from the Ontario Securities Commission (OSC).\n By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n   Disclosure The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2021-06-29 23:22:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,license,德国", "title": "FOINBASE获得德国金融监管机关的加密托管许可，该公司是根据监管机构获得此类许可的第一家公司 ", "title_en": "Coinbase is granted a crypto custody license from Germany's Financial Supervisory Authority, the first company to get such a license according to the regulator", "transed": 1, "url": "https://www.coindesk.com/coinbase-receives-crypto-custody-license-from-german-regulator-bafin", "via": "", "real_tags": ["获得", "license", "德国"]}, {"category": "", "categoryclass": "", "imagename": "146e4713341fb825cc32fc8ffd7d507c.jpg", "infoid": 1068569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在纳斯达克星期一首次亮相后，Payoneer股票公司股价下跌约1.5％，使其成为截至10亿美元的市场上限。\n 该公司通过与FTAC Olympus收购公司合并，由Bancorp创始人Betsy Cohen经营的空白检查公司融合。\n 付款公司Payoneer股票在市场上首次亮相纳斯达克之后关闭了约1.5％，使其成为截至10亿美元的市场上限。\n 该公司通过与FTAC Olympus收购公司合并，由Bancorp创始人Betsy Cohen经营的空白检查公司融合。股票以前在Ticker Ftocu中列出了Cohen＆＃39;专用车辆。在交易时＆＃39; S 2月的公告，Payoneer价值33亿美元。\n  科恩和她的团队在2020年的狂热开始之前在SPAC趋势上：FTAC是他们的第四次专注的壳牌公司。 2018年SPAC宣布了去年年底的合并协议，支付提供商Paya。另一个，2017年1月公开，与国际金钱快递相结合。 FINTECH收购，2015年2月与CardConnect一起公开，后来被首先数据收购了大约7.5亿美元。\n 特殊用途收购公司称为Spacs，通过壳牌公司筹集资金来购买现有公司，并在过去一年中越来越受欢迎。\n Payoneer专门从事促进跨境付款。 FINTECH启动成立于2005年，由以色列企业家Yuval Tal成立，他们帮助开始了其他技术和电子商务支付公司。斯科特加蒂特于2010年加入首席执行官在2010年后，在第一个数据和万事达卡。三月，该公司与万事达卡合作，提供小型企业数字付款卡。 \nPayoneer＆＃39的平台上有超过500万用户，公司合作超过150个不同的不同货币，专门从事跨境付款。 Airbnb，亚马逊，谷歌和自由职业职位平台融合在其企业客户之外，以及数百万独立的承包商和小企业。  两次CNBC Disruptor 50公司是最新的纽约公司，用于击中公共市场，加入一个越来越多的名单，包括etsy，mongodb和peloton等名称。 虽然最大的产品通常来自Silicon Valley和旧金山，但2021年，纽约的街头召开了一年，其中ocdeCean，UIPath和指南针都已经公开了。  注册我们的每周，原始时事通讯超出列表，仔细看看CNBC Distruper 50家公司，以及在每个经济部门继续创新的创始人。 ", "note_en": "Shares of payments company Payoneer closed down roughly 1.5% after its market debut Monday on the Nasdaq, giving it a market cap of just over $1 billion.\n The company went public by merging with FTAC Olympus Acquisition Corp., a blank-check company run by Bancorp founder Betsy Cohen.\n Shares of payments company  Payoneer closed about 1.5% lower after its market debut Monday on the Nasdaq, giving it a market cap of just over $1 billion.\n The company went public by merging with FTAC Olympus Acquisition Corp., a blank-check company run by Bancorp founder Betsy Cohen. The shares were previously listed under the ticker FTOCU for Cohen&#39;s special purpose vehicle. At the time of  the deal&#39;s announcement in February, Payoneer was valued at $3.3 billion.\n  Cohen and her team were in on the SPAC trend before 2020′s mania began: FTAC is their fourth fintech-focused shell company. One 2018 SPAC announced a merger agreement late last year with payments provider Paya. Another, which went public in January 2017, combined with International Money Express. FinTech Acquisition, which went public in February 2015 combined with CardConnect, was later acquired by First Data for roughly $750 million.\n Special purpose acquisition companies, known as SPACs, raise money through a shell company to buy an existing firm and have become increasingly popular in the past year.\n Payoneer specializes in facilitating cross-border payments. The fintech start-up was founded in 2005 by Yuval Tal, an Israeli entrepreneur who helped start other tech and e-commerce payment companies. Scott Galit joined as CEO in 2010 after years at First Data and  Mastercard. In March, the company  partnered with Mastercard to offer small businesses a digital payments card.\n There are more than 5 million users on Payoneer&#39;s platform, and the company works with more than 150 different currencies, specializing in cross-border payments. Airbnb, Amazon, Google and freelance jobs platform  Upwork are among its corporate customers, as well as millions of independent contractors and small businesses.\n The two-time  CNBC Disruptor 50 company is the latest New York-based company to hit the public markets, joining a growing roster that includes names like  Etsy,  MongoDB and  Peloton. While the biggest offerings have typically come from Silicon Valley and San Francisco, 2021 is turning out to be a  blockbuster year for New York, with  DigitalOcean,  UiPath and  Compass all having gone public already.\n  SIGN UP  for our weekly, original newsletter that goes beyond the list, offering a closer look at CNBC Disruptor 50 companies, and the founders who continue to innovate across every sector of the economy.", "posttime": "2021-06-29 23:21:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "company", "title": "付款公司Payoneer通过SPAC合并关闭其NASDAQ首次亮相〜1.5％，使其成为1亿美元+的市场上限; 该公司最初是3.3亿美元的价值 ", "title_en": "Payments company Payoneer closed ~1.5% lower on its Nasdaq debut via a SPAC merger, giving it a market cap of $1B+; the company was originally valued at $3.3B", "transed": 1, "url": "https://www.cnbc.com/2021/06/28/payoneer-begins-trading-on-nasdaq-following-spac-merger-completion.html", "via": "", "real_tags": ["company"]}]