[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔&#39；s Arc GPU继续向发布靠近。在昨天的一次投资者会议上，英特尔重申将在2022年第一季度推出基于Alchesman架构的移动Arc GPU，而台式GPU将在第二季度的某个时候推出。工作站GPU随后将在第三季度发布。\n英特尔几乎没有发布任何关于Arc GPU配置或性能目标的官方细节，尽管泄露的规格和基准让我们对我们的预期有了非常广泛的了解。英特尔图形副总裁拉贾·科杜里（Raja Koduri）在推特上发了一张Arc GPU的图片，图片是一个&#34；野兽峡谷&#34；2018年和#39年运行的NUC机柜；“古墓丽影”的阴影，这意味着至少有一个GPU的物理尺寸足够小，可以放进那个箱子里。但定价、可用性，甚至这些卡的外观都不得而知。\n该公司计划在2022年在其台式机、笔记本电脑和工作站产品线中至少出货400万个GPU，但这只占专用GPU市场的一小部分。来自乔恩PodiDesearch的数据（由Tom & Suy 39；S硬件编译）表明，NVIDIA和AMD在日历年中销售了大约4700万台桌面GPU，Q4为2020和Q3为2021；在计算笔记本电脑GPU之前。在GPU市场上有另一个可行的选择将是好事，但这一小部分人赢了&#39；在目前GPU短缺的情况下，这并没有带来太大的影响。\n至于图形部门的未来，英特尔分享了其下一代Battlemage和Aspheral GPU架构的大致发布时间表，这些架构将于&#34；2023-2024&#34; 和&#34；2024+&#34; 分别地每种架构的性能目标都略高于之前的架构，不过这些产品的竞争力也将取决于英伟达和AMD在未来几年内推出的GPU。Battlemage GPU也将集成到英特尔&#39；s&#34；流星湖&#34；处理器，英特尔将使用的体系结构&#39；s的第14代核心处理器（假设没有延迟，并且英特尔当前的命名约定继续）。\n英特尔还取笑了一个名为&#34；《终局计划》34；提供Arc GPU的服务&#34；通过服务提供始终可访问、低延迟的计算体验&#34; Endgame是否是像Nvidia&#39这样的云游戏服务；s GeForce Now或提供GPU计算能力的更多workstation-y服务还有待观察。", "note_en": "Intel&#39;s Arc GPUs continue to creep closer to release.  At an investor meeting yesterday, Intel reiterated that it would be shipping mobile Arc GPUs based on its Alchemist architecture in the first quarter of 2022 and that desktop GPUs would follow at some point in Q2. Workstation GPUs would follow afterward in the third quarter.\n Intel has released few official details about any of the Arc GPU configurations or performance targets, though  leaked specs and benchmarks have given us a very broad idea of what we can expect. Intel graphics VP Raja Koduri tweeted a picture of an Arc GPU in a  &#34;Beast Canyon&#34; NUC enclosure running 2018&#39;s  Shadows of the Tomb Raider, which means at least one of the GPUs will be physically small enough to fit inside that case. But pricing, availability, and even what the cards will look like are unknown.\n The company plans to ship at least 4 million GPUs across its desktop, laptop, and workstation product lines in 2022, but that would represent only a sliver of the dedicated GPU market. Data from Jon Peddie Research (as compiled by Tom&#39;s Hardware) suggests that Nvidia and AMD sold some 47 million desktop GPUs in the calendar year between Q4 of 2020 and Q3 of 2021, and that&#39;s before you count laptop GPUs. Having another viable option in the GPU market will be good, but this small number won&#39;t put much of a dent in the current GPU shortage.\n     As for the future of its graphics division, Intel shared rough release timelines for its next-generation Battlemage and Celestial GPU architectures, which will be released in &#34;2023-2024&#34; and &#34;2024+&#34; respectively. Each architecture has a slightly higher performance target than the one before it, though how competitive these products are will also be determined by the GPUs that Nvidia and AMD are shipping in the next few years. Battlemage GPUs will also be integrated into Intel&#39;s &#34;Meteor Lake&#34; processors, the architecture that will be used in Intel&#39;s 14th-generation Core processors (assuming no delays and that Intel&#39;s current naming conventions continue).\n Intel also teased a mysterious GPU-related initiative called &#34;Project Endgame,&#34; a service that will offer Arc GPUs &#34;through a service for an always-accessible, low-latency computing experience.&#34; Whether Endgame is a cloud gaming service like Nvidia&#39;s GeForce Now or a more workstation-y service that offers GPU computing capacity remains to be seen.", "posttime": "2022-02-19 19:00:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,指望,arc,gpu", "title": "英特尔Arc台式机GPU将于第二季度上市，但别指望它们能解决GPU短缺的问题", "title_en": "Intel Arc desktop GPUs are coming in Q2, but don’t expect them to end the GPU shortage", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/intel-arc-desktop-gpus-are-coming-in-q2-but-dont-expect-them-to-end-the-gpu-shortage/", "via": "", "real_tags": ["英特尔", "指望", "arc", "gpu"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从去年对Facebook提起检举人投诉以来，弗朗西斯·豪根（Frances Haugen）一直坐着不动。今天的一份报告称，Facebook（现在的Meta）举报人向美国证券交易委员会（Securities and Exchange Commission）提交了两份新的投诉，指控该公司在内部承认自己在与错误信息作斗争，尽管它告诉投资者自己已经处理了这个问题。\n根据一名国会工作人员与《华盛顿邮报》和其他新闻媒体分享的经过编辑的投诉，Meta就其在平台上打击虚假信息的尝试做出了“对投资者的声明中的重大失实陈述和遗漏”。“一些投资者根本不想投资一家未能充分处理此类错误信息，然后在该主题上进行错误陈述和遗漏的公司，”一份投诉书说。\n豪根的新投诉称，虽然Facebook/Meta高管在财报电话和其他地方大力宣传他们为压制有关气候变化和新冠肺炎的错误信息所做的努力，但该公司内部知道自己做得不够。\n就在2021年初的第一季度，脸谱网员工发现，当脸谱网在手表标签上搜索“气候变化”时，气候错误信息排名很高。第二个结果是“气候错误信息”，一名员工写道，该信息已被浏览660多万次。\n据称，Facebook也知道自己大力推广的气候科学信息中心是一个失败，尽管有大量新闻稿和资金投入。据投诉称，即使是访问过该页面的人，内部文件也表示，他们对该页面的认识“非常低”。\n也许这是因为该公司在管理页面时似乎没有遵循自己的最佳实践。新闻链接只会每隔几天更新一次，并隐藏在页面的一半。此外，导航是通过笨重的水平滚动来完成的，而不是像网站的其他部分那样通过无限的垂直提要。该页面没有“关于”部分或细节，表明Facebook本身正在运行该页面。甚至这个标题也被笨拙地称为“气候科学中心”（仅基于这一点，如果我偶然发现了这一页，而我没有——我会认为这是某个十字军个人的一次性努力。）该页面也没有显示公众关注人数，Facebook甚至懒得给它一个标题图片。该网页于2021年9月正式更名为气候科学中心。当时，它有380万粉丝。虽然近400万粉丝会让许多品牌感到高兴，但对于一家像Meta这样规模的公司来说，这&#39；这是花生。公司通常不会为广受欢迎的产品重命名。\nFacebook确实在气候变化内容上贴上标签，并减少其事实核查合作伙伴认为虚假的内容的传播。但它通常不会删除帖子，因为它会删除新冠病毒的错误信息。\n然而，尽管消除了一些与新冠病毒有关的错误信息，举报者的投诉称，Facebook/Meta也没有兑现其在那里的公开声明。诉状称，Facebook的一项内部调查发现，三分之一的美国人表示，他们看到了与新冠病毒和投票有关的错误信息，2020年4月用户错误信息报告的激增可追溯到新冠病毒的话题。\n斯坦福大学法学院教授、斯坦福大学网络政策中心主任纳撒尼尔·佩斯利（Nathaniel Persly）告诉《华盛顿邮报》，利用举报者的投诉来解决错误信息问题是“创造性的”。“美国不能通过一项禁止虚假信息的法律，”他说。“那么你能做什么呢？你可以让平台对他们做出的承诺负责。这些承诺可以向用户、政府和股东做出。”考虑到许多投资者对关注环境、社会和治理投资策略（即所谓的ESG投资者）的兴趣，该策略可能会奏效。\nArnold&amp；最近负责SEC举报程序的波特告诉《华盛顿邮报》。她说：“如果公司向投资者说了一件事，但内部文件显示他们所说的是不真实的，那可能是SEC会考虑的。”。", "note_en": "Since filing whistleblower complaints against Facebook last year,  Frances Haugen hasn’t been sitting still. A report today says the Facebook (now Meta) whistleblower has filed two new complaints with the Securities and Exchange Commission that allege the company internally acknowledged it was struggling with misinformation even while telling investors it had a handle on the problem.\n  Meta made “material misrepresentations and omissions in statements to investors” regarding its attempts to fight misinformation on its platforms, according to redacted complaints that a congressional staffer shared with  The Washington Post and other news outlets. “Some investors simply will not want to invest in a company that fails to adequately address such misinformation and then engages in misstatements and omissions on the topic,” one complaint says.\n Haugen’s new complaints say that while Facebook/Meta executives trumpeted their efforts to tamp down misinformation about climate change and COVID in earnings calls and elsewhere, internally, the company knew it was falling short.\n  As recently as the first quarter of 2021, Facebook employees discovered that climate misinformation ranked high when they searched for “climate change” in the Watch tab on Facebook. The second result was “climate misinfo,” which had been viewed more than 6.6 million times, an employee wrote.\n Facebook also allegedly knew that its own heavily promoted Climate Science Information Center was a flop despite a slew of press releases and money thrown at it. Even among people who had visited the page, internal documents said that awareness of it was “very low,” according to the complaint.\n  Perhaps that’s because the company  doesn’t seem to follow its own best practices when managing the page. News links are only updated every few days and are buried over halfway down the page. Plus, navigation is done through a clunky horizontal scroll instead of an infinite vertical feed like the rest of the site. The page has no “about” section or details to suggest that Facebook itself is running the page. Even the title is awkwardly stylized as the “Climate science center.” (Based on that alone, if I had stumbled across the page—and I haven’t—I would have thought it was a one-off effort by some crusading individual.) The page also doesn’t show a public follower count, and Facebook hasn’t even bothered to give it a header image. The page was officially renamed the Climate Science Center in September 2021. At the time, it had 3.8 million followers. While almost 4 million followers would make many brands happy, for a company the size of Meta, that&#39;s peanuts. Companies generally don’t rename products that are wildly popular.\n    Facebook does place labels on climate change content and reduces the distribution of content that its fact-checking partners deem false. But it typically doesn’t remove posts, as it does with COVID misinformation.\n Yet despite removing some COVID-related misinformation, the whistleblower complaints allege that Facebook/Meta  hasn’t lived up to its public statements there, either. An internal Facebook survey found that a third of people in the US said they saw misinformation related to COVID and voting, the complaint says, and an April 2020 spike in misinformation reports from users was traced to the topic of COVID.\n   Using whistleblower complaints to address the misinformation problem is “creative,” Nathaniel Persily, a professor at Stanford Law School and director of the Stanford Cyber Policy Center, told The Washington Post. “You cannot pass a law in the US banning disinformation,” he said. “So what can you do? You can hold the platforms accountable to promises they make. Those promises could be made to users, to the government, to shareholders.” The strategy could work, given many investors’ appetites for focusing on environmental, social, and governance investment strategies (so-called ESG investors).\n For years, the SEC has told publicly traded companies that they need to make clear and accurate disclosures, Jane Norberg, a partner at Arnold &amp; Porter who recently ran the SEC’s whistleblower program, told the Post. “If the company says one thing to investors but internal documents show that what they were saying is untrue, that could be something the SEC would look at,” she said.", "posttime": "2022-02-19 18:58:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,misled,错误信息", "title": "告密者说，Facebook在虚假信息问题的范围上误导了投资者", "title_en": "Facebook misled investors on scope of misinformation problems, whistleblower says", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/facebook-misled-investors-on-scope-of-misinformation-problems-whistleblower-says/", "via": "", "real_tags": ["facebook", "misled", "错误信息"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看看9to5Google发现的这个完全疯狂的谷歌主页实验：搜索页面的底部突然出现了一排卡片。如果这种设计被广泛采用，它将很容易成为最大的谷歌。com设计永远不会改变。\n在实验中，谷歌。com在页面底部有一排六张卡片。那里&#39；天气、趋势搜索和#34；看什么&#34；股票卡、当地活动和新冠病毒新闻。点击一张卡片会将其展开或加载一个搜索结果页面。那里&#39；它也是一个&#34；隐藏内容&#34；开关，这将关闭卡。所有这些似乎都与谷歌非常相似。com应用程序，它有一个可滚动的列表&#34；发现&#34；卡。\n谷歌搜索最初流行的原因之一是因为搜索页面简单易用。当时的竞争对手包括雅虎（Yahoo）和Alta Vista（Alta Vista）等搜索引擎，它们为用户提供了大量的广告和内容。谷歌&#39；在早期，他的直率是一个主要的区别，它&#39；it’很有意思的一点是，看到该公司向雅虎时代靠拢一点，即使它&#39；这是对这个想法的更现代的理解。\n你一定想知道到底有多少人还在使用谷歌。com搜索页面。如果你有谷歌&#39；浏览器，Chrome，你基本上看不到它。铬合金&#34；新标签&#34；这个页面看起来很像谷歌。com，但它&#39；这不一样，地址栏兼作搜索栏的流行使得搜索主页相当过时。到目前为止，没有迹象表明谷歌计划将设计变更作为一项永久性功能发布，但该公司最近似乎愿意对搜索做出重大改变。黑暗模式（如截图所示）仅在五个月前推出。", "note_en": "Check out this totally wild Google homepage experiment spotted by  9to5Google: the search page suddenly has a row of cards at the bottom. If this design is widely adopted, it would easily be the biggest google.com design change ever.\n In the experiment, Google.com has a row of six cards at the bottom of the page. There&#39;s weather, trending searches, &#34;what to watch,&#34; a stock card, local events, and COVID news. Clicking on a card will either expand it or load a search-results page. There&#39;s also a &#34;hide content&#34; switch, which will turn the cards off. All of this seems very similar to the Google.com app, which has a scrollable list of &#34;discover&#34; cards.\n One of the reasons Google Search initially became popular was because the search page was plain and easy to use. The competition at the time included search engines like Yahoo and Alta Vista, which presented users with a massive  wall of ads and content. Google&#39;s starkness was a major differentiator in the early days, and it&#39;s interesting to see the company toy with moving a little closer to the days of Yahoo, even if it&#39;s presenting a more modern take on the idea.\n You have to wonder how many people actually still use the Google.com search page. If you have Google&#39;s browser, Chrome, you basically never see it. The Chrome &#34;new tab&#34; page looks  similar to Google.com, but it&#39;s not the same, and the prevalence of address bars that double as search bars makes a search homepage rather obsolete. So far, there are no indications that Google plans to release the design change as a permanent feature, but the company has seemed willing to make big changes to search lately.  Dark mode (shown in the screenshot) rolled out just five months ago.", "posttime": "2022-02-19 18:55:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,信息卡,busier,搜索", "title": "谷歌。com用一排信息卡测试一个更繁忙的主页", "title_en": "Google.com tests a busier homepage with a row of info cards", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/google-search-channels-yahoo-com-tests-news-and-weather-on-the-homepage/", "via": "", "real_tags": ["google", "谷歌", "信息卡", "busier", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数百万WordPress网站在过去一天收到了一个强制更新，以修复名为UpdraftPlus的插件中的一个关键漏洞。\n由于该漏洞的严重性，强制性补丁是应UpdraftPlus开发人员的请求发布的。该漏洞允许不受信任的订阅者、客户和其他人下载该网站的私有数据库，只要他们在该易受攻击的网站上有一个帐户。数据库经常包含有关客户或网站安全设置的敏感信息，使数百万网站容易受到严重数据泄露的影响，泄露密码、用户名、IP地址等。\nUpdraftPlus简化了备份和恢复网站数据库的过程，是互联网上使用最广泛的WordPress内容管理系统定时备份插件。它简化了对Dropbox、Google Drive、Amazon S3和其他云服务的数据备份。它的开发者表示，它还允许用户安排定期备份，比竞争对手的WordPress插件更快，使用的服务器资源更少。\n安全研究员马克·蒙帕斯说：“这个漏洞很容易被利用，如果真的被利用，结果会非常糟糕。”他发现了这个漏洞，并私下向插件开发人员报告了它。“它使低权限用户可以下载网站的备份，包括原始数据库备份。低权限帐户可能意味着很多事情。普通订户、客户（例如，在电子商务网站上）等。”\n网站安全公司Jetpack Scan的研究员蒙帕斯说，他在对该插件进行安全审计时发现了该漏洞，并于周二向UpdraftPlus开发者提供了详细信息。一天后，开发者发布了一个补丁，并同意在安装了插件的WordPress网站上强制安装。\nWordPress提供的统计数据。org显示，周四有170万个网站收到了该更新，截至记者发稿时，另有28.7万多个网站安装了该更新。WordPress称该插件拥有300多万用户。\n此缺陷允许任何在UpdraftPlus处于活动状态的WordPress安装上登录的用户行使下载现有备份的权限，该权限应仅限于管理用户。这是可能的，因为与检查当前备份状态相关的代码缺少权限检查。这允许获取一个内部标识符，该标识符在其他情况下是未知的，然后可用于在获得下载许可后通过检查。\n这意味着，如果你的WordPress网站允许不受信任的用户登录WordPress，并且你有任何现有的备份，那么你可能会受到技术熟练的用户的攻击，他们正在研究如何下载现有的备份。如果您的站点包含任何非公共内容，受影响的站点将面临数据丢失/数据被盗的风险，攻击者将访问站点备份的副本。我之所以说“技术熟练”，是因为在这一点上，还没有公开证据表明如何利用这一漏洞。目前，它依靠黑客对最新UpdraftPlus版本中的更改进行反向工程来解决问题。然而，你当然不应该依赖这个需要很长时间，而是应该立即更新。如果你是WordPress网站上的唯一用户，或者你的所有用户都是可信的，那么你就不会受到攻击，但我们仍然建议在任何情况下更新。", "note_en": "Millions of WordPress sites have received a forced update over the past day to fix a critical vulnerability in a plugin called UpdraftPlus.\n The mandatory patch came at the request of UpdraftPlus developers because of the severity of the vulnerability, which allows untrusted subscribers, customers, and others to download the site’s private database as long as they have an account on the vulnerable site. Databases frequently include sensitive information about customers or the site’s security settings, leaving millions of sites susceptible to serious data breaches that spill passwords, user names, IP addresses, and more.\n  UpdraftPlus simplifies the process of backing up and restoring website databases and is the Internet’s most widely used scheduled backup plugin for the WordPress content management system. It streamlines data backup to Dropbox, Google Drive, Amazon S3, and other cloud services. Its developers say it also allows users to schedule regular backups and is faster and uses fewer server resources than competing WordPress plugins.\n “This bug is pretty easy to exploit, with some very bad outcomes if it does get exploited,” said Marc Montpas, the security researcher who discovered the vulnerability and privately reported it to the plugin developers. “It made it possible for low-privilege users to download a site&#39;s backups, which include raw database backups. Low-privilege accounts could mean a lot of things. Regular subscribers, customers (on e-commerce sites, for example), etc.”\n Montpas, a researcher at website security firm  Jetpack Scan, said he found the vulnerability during a security audit of the plugin and provided details to UpdraftPlus developers on Tuesday. A day later, the developers published a fix and agreed to force-install it on WordPress sites that had the plugin installed.\n    Stats provided by WordPress.org  show that 1.7 million sites received the update on Thursday, and more than an additional 287,000 had installed it as of press time. WordPress says the plugin has 3+ million users.\n   This defect allows any logged-in user on a WordPress installation with UpdraftPlus active to exercise the privilege of downloading an existing backup, a privilege which should have been restricted to administrative users only. This was possible because of a missing permissions check on code related to checking current backup status. This allowed the obtaining of an internal identifier which was otherwise unknown and could then be used to pass a check upon permission to download.\n This means that if your WordPress site allows untrusted users to have a WordPress login, and if you have any existing backup, then you are potentially vulnerable to a technically skilled user working out how to download the existing backup. Affected sites are at risk of data loss / data theft via the attacker accessing a copy of your site’s backup, if your site contains anything non-public. I say “technically skilled” because at that point, no public proof of how to leverage this exploit has been made. At this point in time, it relies upon a hacker reverse-engineering the changes in the latest UpdraftPlus release to work it out. However, you should certainly not rely upon this taking long but should update immediately. If you are the only user on your WordPress site, or if all your users are trusted, then you are not vulnerable, but we still recommend updating in any case.", "posttime": "2022-02-19 18:53:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,关键,wordpress,备份", "title": "数百万WordPress网站被迫更新以修补关键插件漏洞", "title_en": "Millions of WordPress sites get forced update to patch critical plugin flaw", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/millions-of-wordpress-sites-get-forced-update-to-patch-critical-plugin-flaw/", "via": "", "real_tags": ["漏洞", "关键", "wordpress", "备份"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们对《和平缔造者》（Peacemaker）心存疑虑，这是HBO Max根据约翰·塞纳（John Cena&#39）改编的系列剧；2021年的角色&#39；这是自杀小组。但我&#39；我很高兴地报告，这些怀疑完全没有根据。该剧的创作者詹姆斯·冈恩成功地塑造了一个看似不可救药的角色，并让他踏上了一段情感之旅，让我们爱上了他。这部电影被一个浸透鲜血、充满动作感、厚颜无耻、不敬的主故事框住，成为了一流的娱乐节目。\n（下面是自杀小队的一个大破坏者。和平使者的一些破坏者，但没有重大披露。）\n甘恩在2020年的休息时间里写这部剧是为了好玩，后来DC Films找他谈自杀队中的一个角色的衍生剧时，他就把这部剧投了出去。HBO Max命令《和平使者》直接上映。当去年第一个挑逗者退出时，我承认自己有点怀疑。Cena和#39；他在自杀队的表现非常出色，但他不是&#39；这不完全是一个富有同情心的人物，也不是一个特别复杂的人物。另一方面，耿显然觉得这个角色有更多#39；事实证明，这一直觉是正确的。\n这部八集的连续剧设定在自杀队事件发生五个月后，特别是在电影《后学分》的场景之后。在这一场景中，我们得知和平缔造者阿卡·克里斯托弗·史密斯在一次看似致命的枪击事件中幸存下来。这一幕暗示了美国政府对他仍有一些用处，在这部剧中，他最终被招募去执行一项新任务：神秘的蝴蝶计划，由一名名叫克莱姆森·穆恩（Chukwudi Iwuji）的雇佣兵领导。他得到了贝尔·里夫监狱的A.R.G.U.特工约翰·埃科诺斯（史蒂夫·阿吉饰）、国家安全局特工、前沃勒助手埃米莉亚·哈考特（詹妮弗·霍兰德饰）和新队员莱奥塔·阿德巴约（丹妮尔·布鲁克斯饰）的协助。\n演员阵容还包括罗伯特·帕特里克（终结者2）饰演的克里斯&#39；脾气暴躁的父亲奥吉·史密斯（Auggie Smith），他认为自己的儿子是个&#34岁；南希男孩&#34；；弗雷迪·斯特里玛饰演阿德里安·蔡斯（又名治安警员），一位反社会的地区检察官，他打击犯罪，认为自己&#39；美国的和平缔造者&#39；s BFF；安妮·张饰演警探苏菲·宋；以及保镖和武术专家Nhut Le as Judomaster。当然，还有&#39；s伊格利，克里斯&#39；亲爱的美国秃鹰同伴，迪布拉德利贝克配音。\nCena的表现非常出色；他在塑造一个曾被描述为&#34；美国队长&#34; 克里斯正在为在自杀小组中杀死里克·弗拉格的罪行而挣扎，他&#39；被国旗#39；最后一句话&#34；和事佬真是个笑话&#34;\n在整个赛季中，他还被迫处理自己悲惨的背景故事，包括失去弟弟，而这段背景故事令人惊讶地尖锐。如果你是由像奥吉·史密斯这样的白人至上主义暴徒抚养长大的，他把他的儿子训练成了一个杀手，并且没有错过任何机会提醒克里斯他&#39；这是一种毫无价值的空间浪费，你可能也已经成长为一个沙文主义的杀人狂。\n克里斯&#39；他早年在Murn&#39上杀害一名参议员及其家人时，对自己塑造的和事佬形象越来越不安；这是命令。（治安警员对杀害妇女和儿童没有这种顾虑。）这家人原来是&#34岁；蝴蝶&#34；：一种来自垂死星球的外来物种，以人体为宿主，试图统治地球。随着任务的升温，克里斯确实拿出了他应得的一份蝴蝶，但他也和其中一只蝴蝶交上了朋友，并把它放在拖车的罐子里。\n它&#39；这是他父亲反复获得的内在的糊状的一面&#39；这很可笑，但这也让克里斯成为一个值得康复的人。毕竟，伊格利爱他，如果可以的话&#39；不要相信美国秃鹰的本能，你能相信什么？在内心深处，克里斯只是想要归属感，本赛季最棒的一个弧线就是他最终在他的蝴蝶计划队友中找到了一个家庭。", "note_en": "We had our doubts about   Peacemaker, the  HBO Max spinoff series based on John Cena&#39;s character from 2021&#39;s   The Suicide Squad. But I&#39;m happy to report that those doubts were entirely unfounded. Series creator James Gunn has successfully taken a seemingly irredeemable character and sent him on an emotional journey that made us love him—all framed in a blood-soaked, action-packed, cheekily irreverent main story that makes for top-notch entertainment.\n (One big spoiler for  The Suicide Squad below. Some spoilers for  Peacemaker, but no major reveals.)\n Gunn wrote the series for fun during his downtime in 2020 and ended up pitching it when DC Films approached him about a spinoff series for one of the characters in  The Suicide Squad. HBO Max ordered  Peacemaker straight to series. When the  first teaser dropped last year, I admitted to being a bit skeptical. Cena&#39;s performance in  The Suicide Squad was terrific, but he wasn&#39;t exactly a sympathetic character—or a particularly complex one. On the other hand, Gunn clearly felt there was more of the character&#39;s story to tell, and that instinct proved correct.\n The eight-episode series is set five months after the events of  The Suicide Squad, specifically after the post-credits scene, in which we learned that Peacemaker—aka Christopher Smith—had survived what appeared to be a fatal shooting. That scene hinted that the US government still had some use for him, and in the show, he ends up being recruited for a new mission: the mysterious Project Butterfly, led by a mercenary named Clemson Murn (Chukwudi Iwuji). He gets assistance from A.R.G.U.S. agent John Economos (Steve Agee) of the Belle Reve Penitentiary, National Security Agency agent and former Waller aide Emilia Harcourt (Jennifer Holland), and new team member Leota Adebayo (Danielle Brooks).\n  The cast also includes Robert Patrick ( Terminator 2) as Chris&#39; crusty father, Auggie Smith, who thinks his son is a &#34;nancy-boy&#34;; Freddie Stroma as Adrian Chase (aka Vigilante), a sociopathic district attorney who fights crime and thinks he&#39;s Peacemaker&#39;s BFF; Annie Chang as police detective Sophie Song; and Nhut Le as  Judomaster, a bodyguard and martial arts specialist. And of course, there&#39;s Eagly, Chris&#39; beloved American bald eagle companion, voiced by Dee Bradley Baker.\n    Cena turns in a truly standout performance; he brings a surprising sweetness and vulnerability to his portrayal of a character Gunn once described as &#34;douchebag Captain America.&#34; Chris is wrestling with his guilt over killing Rick Flag in  The Suicide Squad, and he&#39;s haunted by Flag&#39;s last words: &#34;Peacemaker. What a joke.&#34;\n He is also forced to deal with his own tragic backstory over the course of the season, including the loss of his brother, and that backstory is surprisingly poignant. If you were raised by a white supremacist thug like Auggie Smith—who trained his son to be a killer and misses no opportunity to remind Chris that he&#39;s a worthless waste of space—you might have grown up into a jingoistic mass murderer for hire, too.\n  Chris&#39; growing uneasiness with the Peacemaker persona he created manifests early on when he balks at killing a senator and his family on Murn&#39;s orders. (Vigilante has no such qualms about killing women and children.) The family turns out to be &#34;butterflies&#34;: an alien species from a dying planet who use human bodies as hosts and seek to dominate Earth. Chris does take out his fair share of butterflies as the mission heats up, but he also befriends one of them and keeps it in a jar in his trailer.\n It&#39;s that inner mushy side that repeatedly earns his father&#39;s ridicule, but it also makes Chris someone worth rehabilitating. Eagly loves him, after all, and if you can&#39;t trust the instincts of an American bald eagle, what can you trust? Deep down, Chris just wants to belong, and one of the best arcs of the season sees him eventually finding a family of sorts in his Project Butterfly teammates.", "posttime": "2022-02-19 18:51:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "怀疑,doubts,自杀", "title": "评论：我们有过怀疑，但和事佬是一个厚颜无耻、不敬的人", "title_en": "Review: We had our doubts, but Peacemaker is a cheeky, irreverent delight", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/review-we-had-our-doubts-but-peacemaker-is-a-cheeky-irreverent-delight/", "via": "", "real_tags": ["怀疑", "doubts", "自杀"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在不断扩大的虚拟现实领域中，健身和电子游戏的融合从未像现在这样自然。\n自从Wii Sports中的双节棍拳击和Oculus Rift中的多功能一体运动虚拟现实（All-in-One Sports VR）的捆绑游戏问世以来，我一直是健身游戏的粉丝。现在，有了&#39；这是Liteboxer VR中完全无线的拳击体验，仅限于Meta（née Oculus）Quest 2。\nLiteboxer是最新的虚拟现实游戏之一，它可以将健身房和私人教练放在你面前。这是一次拳击课的体验，很有趣，很吸引人，也很有挑战性，即使对像我这样的中级拳击手来说也是如此。该公司希望成为拳击界的领军人物，但虚拟现实可能不是其软件的最佳场所，至少目前还不是。我们对Liteboxer VR的预发行版进行了一番尝试，看看我们在metaverse中离真正的健身体验有多远。\nLiteboxer成立于2017年，是一家相对较新的健身公司，于2020年推出了第一款产品。这个同名的运动设备使用了一个“重新设计”的橡胶打孔袋，上面装有LED，可以告诉你何时何地打孔。与此设备相连的是一个放置平板电脑或手机的空间，您可以在这里访问Liteboxer&#39；s应用程序，用于实时（但非实时）拳击指令或模式选择。该设备的零售价分别为1500美元和1700美元，这取决于你是想把它安装到墙上，还是想把它用作独立平台。为了那笔钱，我&#39；我希望看到内置的屏幕，而不是我自己的。\nLiteboxer VR将整个系统虚拟化，将其放入所谓的&#34；metaverse和#34；将装备成本缩减至元任务2（300美元）。你仍然需要每月支付19美元的会员费，才能参加&#39；这比购买实体Liteboxer设备的费用少11美元。不过，如果你已经拥有拥有活跃会员资格的物理设备，那么你每月30美元的费用中就包括了虚拟现实课程的使用权。不幸的是，Liteboxer没有&#39；我们没有一个自由式的模式让非订阅者直接进入虚拟装备。\n物理设备订阅目前提供800多个课程，相比之下，拥有VR会员资格的课程约为500个。缩小尺寸的原因是取消了某些不太适合虚拟现实的运动，如波比或跳高。这是个好电话；我试过一些这样的锻炼，戴着虚拟现实耳机做波比看起来很痛苦。\n不过，Liteboxer计划在发布时发布新的VR特定内容，包括一种模式，在这种模式下，培训师就在你面前，让你可以在他们的虚拟手套上挥拳，而不是看着他们做常规动作并跟着做。这种（虚拟化的）物理交互是VR体验相对于其他家庭健身房解决方案显示其功能优势的地方。", "note_en": "The melding of fitness and video games has never been more natural than in the expanding realm of virtual reality.\n I’ve been a fan of fitness games since the days of boxing with nunchucks in Wii Sports and the tethered play of  All-In-One Sports VR for the Oculus Rift. Now, there&#39;s a totally wireless boxing experience in  Liteboxer VR, exclusively on the  Meta (née Oculus) Quest 2.\n Liteboxer is one of the newest VR games to put the gym and personal trainers right in front of you. It’s a boxing class experience that’s fun, engaging, and challenging, even for an intermediate-level boxer like me. The company is hoping to be the  Peloton of boxing, but VR may not be the best place for its software, at least not yet. We took the pre-release version of Liteboxer VR for a spin to see how far we are from real gym experiences in the metaverse.\n  Founded in 2017, Liteboxer is a relatively new fitness company that  launched its first product in 2020. The eponymous exercise equipment uses a “reimagined” rubberized punching bag rigged up with LEDs to show you when and where to land your punches. Attached to this equipment is a space to rest a tablet or phone, which is where you access Liteboxer&#39;s app for real-time (but not live) boxing instruction or mode selection. The equipment  retails for $1,500 or $1,700, depending on if you want to mount it to your wall or use it as a free-standing platform, respectively. For that amount of money, I&#39;d expect to see a screen built in instead of having to provide my own.\n      Liteboxer VR virtualizes the whole system by throwing it into the so-called &#34;metaverse,&#34; shrinking your equipment costs to that of a Meta Quest 2 ( $300). You’ll still need to pay a $19 monthly membership fee for classes—that&#39;s about $11 less than the subscription for physical Liteboxer equipment. If you already have the physical equipment with an active membership, though, access to VR classes is included in your $30 monthly fee. Unfortunately, Liteboxer doesn&#39;t have a freestyle mode for non-subscribers to simply get in and hit the virtual gear.\n The physical equipment subscription currently offers more than 800 classes, compared to around 500 classes with the VR membership. The reason for the shrunken size is the elimination of certain workouts that have less VR-friendly movements, like burpees or jumping jacks. That’s a good call; I tried some of those workouts, and doing burpees while wearing a VR headset is as miserable as it sounds.\n Liteboxer plans to release new VR-specific content at launch, though, including a mode in which the trainer is right in front of you, allowing you to land punches in their virtual mitts rather than watching them do the routine and following along. This kind of (virtualized) physical interaction is where the VR experience shows its functional advantages over other at-home gym solutions.", "posttime": "2022-02-19 18:47:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "挑战性,boxing,虚拟现实", "title": "“拳击的佩洛顿”很有趣，有挑战性，比虚拟现实中的IRL更好", "title_en": "The “Peloton of boxing” is fun, challenging, and better IRL than in VR", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/the-peloton-of-boxing-is-fun-challenging-and-better-irl-than-in-vr/", "via": "", "real_tags": ["挑战性", "boxing", "虚拟现实"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "点击“注册”，即表示您同意接收内幕人士以及其他合作伙伴的营销电子邮件，并接受我们的服务条款和隐私政策。\n埃隆·马斯克&#39；内幕人士透露，这家钻井公司提交了一份在迈阿密建造6.2英里地下交通系统的提案。\n据知情人士看到的提议称，北迈阿密海滩环线将在826国道沿线的七个车站之间，在黄金沼泽地运输中心和新港码头的阳光岛海滩之间，为特斯拉汽车提供渡轮服务。\n这家公司估计，这条环线最初每小时能承载7500多名乘客，并且可以扩展到每小时承载15000多名乘客。\n该项目的估计成本为1.85亿美元至2.2亿美元，按镗孔公司#39；这是我的提议。它预测，如果加快许可程序，建设将需要不到三年的时间。\n该提案还建议对6.2英里的北迈阿密海滩环线进行几次可能的扩建，包括连接硬石体育场3英里，连接佛罗里达国际大学39；s比斯坎校区。\n&#34;我们有很多交通堵塞，这将是一种缓解大量交通堵塞的方法，&#34；北迈阿密海滩委员会委员迈克尔·约瑟夫在接受《内幕》采访时说。\n约瑟夫说，通勤者和游客将受益于连接市中心和海滩的隧道网络。\n他说，北迈阿密海滩环线每英里的估计成本为&#34；与南佛罗里达州提议的其他类型的公共交通项目相比，这只是一小部分，而建设不会对当地经济造成破坏&#34;\n约瑟夫说，该市正试图为环路获得资金，并正在向地区、州和联邦政府寻求资金。\n2021年3月，约瑟夫告诉内幕和“39”；格雷斯·凯（Grace Kay）表示，他曾多次就地下交通系统与钻探公司进行沟通，并向隧道公司提交了一份工作文件供其审查。\n北迈阿密海滩环路&#39；它的范围不会像维加斯环路那么大，维加斯环路是一个29英里长的隧道系统，由钻探公司正在建设中。据这家无聊的公司称，拉斯维加斯环线预计将把特斯拉连接到拉斯维加斯的50多个车站&#39；s的网站。\n无聊的公司&#39；第一个地下运输系统，拉斯维加斯会议中心环路，于2021年4月开放。1.7英里长的隧道网络有三个站点。\n注册内部通知！了解你想知道的最新情况。\n形成&#39的两条交叉线；X&#39；。它表示关闭交互或取消通知的方法。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    Elon Musk&#39;s The Boring Company has submitted a proposal to construct a 6.2-mile underground transit system in Miami, Insider can reveal.\n The North Miami Beach Loop would ferry Tesla vehicles between seven stations along State Road 826, between the Golden Glades Transit Center and Sunny Isles Beach at Newport Pier, according to the proposal, seen by Insider.\n The Boring Company estimated that the loop would initially be able to carry more than 7,500 passengers per hour, and could be scaled to carry more than 15,000 per hour.\n The estimated cost of the project was put at $185 million to $220 million, per The Boring Company&#39;s proposal. It predicts that construction would take fewer than three years if the permitting process was expedited.\n     The proposal also recommends several potential extensions to the 6.2-mile North Miami Beach Loop, including a 3-mile connection to Hard Rock Stadium and a 1.8-mile link to Florida International University&#39;s Biscayne Campus.\n   &#34;We have a lot of traffic congestion and this would be a way of alleviating a great deal of that traffic,&#34; North Miami Beach commissioner Michael Joseph said in an interview with Insider.\n Commuters and visitors would benefit from having the tunnel network connecting the city center to the beach, Joseph said.\n He said the estimated cost per mile of the North Miami Beach Loop would be &#34;a fraction of what is seen in other types of mass transit projects proposed in South Florida, while the construction would not be as disruptive to the local economy.&#34;\n     Joseph said the city was trying to obtain funding for the loop, and was seeking finance from regional, state, and federal governments.\n  In March 2021, Joseph told  Insider&#39;s Grace Kay that he had spoken to The Boring Company several times about an underground transit system, and had submitted a working paper to the tunneling firm for review.\n The North Miami Beach Loop wouldn&#39;t be as extensive as the Vegas Loop, a 29-mile tunnel system that is under construction by The Boring Company. The Vegas Loop is expected to connect Teslas to more than 50 stations across Las Vegas, per The Boring Company&#39;s  website.\n     The Boring Company&#39;s first  underground transport system, the  Las Vegas Convention Center Loop, opened in April 2021. The 1.7-mile tunnel network has three stops.\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n              Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2022-02-19 18:42:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,马斯克,system", "title": "埃隆·马斯克（Elon Musk）的钻井公司提交了一份在迈阿密修建6.2英里地下交通系统的提案", "title_en": "Elon Musk's Boring Company has submitted a proposal for a 6.2-mile underground transit system in Miami", "transed": 1, "url": "https://www.businessinsider.com/elon-musk-boring-company-north-miami-beach-loop-proposal-tesla-2022-2?international=true&r=US&IR=T", "via": "", "real_tags": ["埃隆·马斯克", "马斯克", "system"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "平台独家内容是推动硬件销售的最佳方式之一，而艺术家叶（前称Kanye West）通过Instagram宣布，他的下一张专辑《顿达2》“将只在我自己的平台Stem Player上可用。而不是在苹果亚马逊Spotify或YouTube上。”\n虽然叶的推理与其他艺术家不同，他们最近公开谈论了Spotify的乔·罗根（Joe Rogan）的情况，以及他2亿美元的交易与支付给他们的金额之间的巨大差异，但结论是一样的。正如他在另一篇帖子中写道的那样，“如今，艺术家们只获得了音乐行业收入的12%。是时候将音乐从这个压迫性的系统中解放出来了。是时候控制并建立自己的音乐了。现在就去stemplayer.com订购吧。”\n这款售价200美元的Stem播放器去年与Kano Computing合作推出，与第一张Donda专辑一起发行，这样你就可以使用嵌入其米色外壳中的触敏光滑块操纵任何歌曲。叶在另一篇帖子中说：“我们目前有6.7万台，每天的收入是3000台。”。\n它在我们的测试中运行良好，允许用户在收听歌曲时轻松操纵歌曲的不同部分，无论是其中一首歌曲还是通过其基于网络的界面加载的任何其他歌曲。然而，添加循环和效果可能会变得更复杂。它有8GB的存储空间，通过USB-C、蓝牙或3.5毫米耳机插孔连接，以及一个97db的扬声器。\n这张即将发行的专辑的排他性细节尚不清楚——Stem播放器的拥有者下载这张专辑会花费多少钱但这并不是叶对限量发行音乐的首次探索。2016年2月，他通过Tidal独家发布了《巴勃罗的一生》，并在推特上表示，“它永远不会出现在苹果上，也永远不会出售。”同年4月1日，Pablo的生活在Spotify、Apple Music和Google Play上推出流媒体服务——叶最终解决了一名粉丝的诉讼，该粉丝表示，他们基于潮水的排他性注册了潮水。\n2017年，TMZ报道说，Kanye West取消了他与Tidad的合同，该媒体称，他认为公司欠他的数百万美元存在争议。它还援引消息人士的话说，他将“不再拥有独家经营权”\n控制音乐所绑定的硬件平台可能会使发布环境有所不同。自昨晚发布以来，这位艺术家一直在Instagram上发帖——关于皮特·戴维森、比利·埃利什和基德·库迪的老帖子已经不见了——分享了一份似乎是《唐达2》的跟踪列表，并重申了苹果公司最近提出的支付1亿美元购买第一张《唐达》专辑的说法。\n叶说,， “科技公司让音乐几乎是免费的，所以如果你不做merch运动鞋和巡演，你就不会吃东西。Jay Z让潮水和假媒体攻击他。用我大哥的话来说。来吧，抓住我。我愿意站着死，因为我不再跪着生活了。上帝保佑我。我100%经营这家公司，我不需要问f或许可。这是我们的第二代stemplayer，我们有更多的工作要做。我感觉就像纪录片第一集里的感觉。“他提到的纪录片是Jeen yuhs，最近在Netflix上首播。", "note_en": "Platform-exclusive content is one of the best ways to juice hardware sales, and Ye, the artist  formerly known as Kanye West, announced  via Instagram that his next album, Donda 2, “will only be available on my own platform, the Stem Player. Not on Apple Amazon Spotify or YouTube.”\n While Ye’s reasoning is separate from  other artists who’ve recently spoken out about Spotify’s Joe Rogan situation and the stark difference between his  $200 million deal vs. how much it pays them, the conclusion is the same. As he wrote  in another post, “Today artists get just 12% of the money the industry makes. It’s time to free music from this oppressive system. It’s time to take control and build our own. Go to stemplayer.com now to order.”\n   The  $200 Stem Player launched last year in a partnership with Kano Computing, shipping with the first Donda album so that you could manipulate any song using the touch-sensitive light sliders embedded in its beige shell. “We currently have 67,000 available and are making 3,000 a day,” said Ye in another post.\n It worked well in  our testing, allowing owners to easily manipulate different parts of a song while listening, whether for one of the included tracks or any others loaded via its web-based interface. However, adding loops and effects can get more complicated. It has 8GB of storage, connections via USB-C, Bluetooth, or 3.5mm headphone jack, and a 97db speaker.\n The details of the upcoming album’s exclusivity are murky — will it cost anything for Stem Player owners to download? — but this isn’t Ye’s first exploration into limited release music. In February 2016, he released The Life of Pablo exclusively via Tidal, tweeting that it “will never never never be on Apple. And it will never be for sale.” On April 1st of that year, The Life of Pablo launched for streaming on Spotify, Apple Music, and Google Play — Ye eventually  settled a lawsuit from a fan who said they signed up for Tidal based on its exclusivity.\n In 2017, TMZ reported Kanye West was canceling his contract with Tidal, and the outlet  said it was in dispute over millions of dollars he believed the company owed him. It also cited sources saying he would be “done with exclusives.”\n   Having control over the hardware platform the music is tied to may make this a different environment for the release. The artist has continued to post on Instagram since last night’s announcement — older posts about Pete Davidson, Billie Eilish, and Kid Cudi have disappeared — sharing what appears to be a tracklist for Donda 2 and reiterating a recent claim that Apple offered to pay $100 million for the first Donda album.\n According to Ye, “Tech companies made music practically free so if you don’t do merch sneakers and tours you don’t eat. Jay Z made Tidal and fake media attacked him. Well in the words of my big brother. Come and get me. I’m willing to die standing cause I ain’t living on my knees no more. God please cover me. I run this company 100% I don’t have to ask for permission. This is our 2nd generation stemplayer We have more things we working on. I feel like how I felt in the first episode of the documentary.” The documentary he mentions is   Jeen-yuhs, which recently debuted on Netflix.", "posttime": "2022-02-19 18:37:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "kanye,player,音乐", "title": "坎耶·韦斯特（Kanye West）200美元的Stem播放器将是获得下一张专辑《唐达2》的唯一途径", "title_en": "Kanye West’s $200 Stem Player will be the only way to get his next album, Donda 2", "transed": 1, "url": "https://www.theverge.com/2022/2/18/22940748/donda-2-stem-player-kanye-west-exclusive-music", "via": "", "real_tags": ["kanye", "player", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "点击“注册”，即表示您同意接收内幕人士以及其他合作伙伴的营销电子邮件，并接受我们的服务条款和隐私政策。\n尽管商业界有&#39；在这场大流行中，办公室空间并没有真正减少，一些公司可能预计员工很快就会回来，很多员工已经对家庭生活中的工作上瘾。\n2019冠状病毒疾病的流行程度远不及人们在家工作的主要原因。相反，许多人选择这种工作模式只是因为他们喜欢远程工作。\n&#34;在那些在家之外有工作场所的人中，61%的人现在说他们选择不进入自己的工作场所，而38%的人说他们&#39；他们在家工作，因为他们的工作场所关闭或无法使用，&#34；根据皮尤研究中心的最新报告&#34;在疫情早期，情况正好相反：64%的人说他们在家工作是因为办公室关闭，36%的人说他们选择在家工作&#34;\n皮尤和#39；s的分析基于对5889名有一份主要工作的美国成年人的调查结果。更广泛的一月份调查包括2022年1月24日至1月30日的10237名美国成年人的调查结果。\n此外，76%的办公室已经开放的员工报告他们的&#34；主要原因&#34；由于他们更喜欢这种工作方式，所以大部分时间都在家远程工作。2020年10月，60%的人这样说。在2022年1月的调查中，不到一半（42%）的人表示担心接触冠状病毒是在家工作的原因，这一比例低于2020年10月的57%。\n与2020年10月相比，有18岁以下孩子的工人表示育儿是一个因素的人数减少了，但这是&#39；2020年约为-45%，2022年为32%。\n&#34;我们&#39；重新看到的是，在家工作对人们有好处，&#34；皮尤研究中心研究副主任、新报告的合著者朱莉安娜·霍洛维茨告诉《内幕》&#34;我们甚至在2020年看到了这一点，当时&#39；我很快就转向了远程工作，我们看到，在大多数情况下，人们认为他们很容易在家里获得工作所需的东西，并继续在截止日期前完成工作，提高工作效率&#34;\n&#34;我们今天继续看到这一点，人们认为远程工作和远程工作可以帮助他们在工作和家庭方面取得平衡，而且它&#39；这是大流行结束后人们希望继续做的事情；霍洛维茨补充道。\n根据该报告，在2022年1月的调查中，59%能够在家工作的美国工人表示，他们大部分或全部时间都在家工作，低于2020年10月的71%。在家工作可能是兼顾育儿职责的父母或想节省通勤费用的人的理想选择。皮尤研究中心（Pew Research）的调查回应突显了远程工作的其他一些积极意义。\n64%的人表示，在家工作使平衡工作和个人生活变得更容易，16%的人表示，至少有一段时间在家工作让这种远程工作变得更难。正如霍洛维茨根据皮尤研究院（Pew research）和#34的其他研究所说的那样，这种平衡对那些一直试图管理工作和生活之间界线的员工来说可能是个好消息；我们知道，即使在大流行之前，灵活性和平衡工作与个人生活的能力对工人来说也是非常重要的&#34;\n新远程工作的人至少有一部分时间觉得工作效率很高——44%的人对此做出了回应#39；s&#34；让你更容易完成工作并在截止日期前完成，&#34；但有10%的人表示&#39；这很难。正如FlexJobs所指出的，更少的中断和更安静的空间增加了远程工作效率。\n然而，60%的人说他们&#39；因为在家工作，他们感觉与同事的联系减少了，只有4%的人说他们感觉与同事的联系更多。霍洛维茨指出，皮尤没有&#39；不要问受访者所说的&#34是什么意思；已连接&#34；-他们是否将这个问题理解为与同事的个人关系或其他问题。调查结果之外的其他负面因素可能是经理的倦怠或微观管理。\n尽管远程工作带来了一些负面影响，但这项调查和其他调查表明，远程工作者希望继续这种灵活的安排，并继续获得相关的好处。\n&#34;考虑到[工人]在调查中告诉我们的情况，&#34；霍洛维茨说&#34；就对未来的偏好而言，只要雇主允许远程工作，那么显然&#39；这是员工看到的好处&#34;\n注册内部通知！了解你想知道的最新情况。\n形成&#39的两条交叉线；X&#39；。它表示关闭交互或取消通知的方法。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    Although businesses haven&#39;t really reduced office  space in the pandemic and some companies may be  expecting workers to return soon, plenty of employees have become hooked on the work-from-home life.\n While the pandemic is far from over, it looks like COVID-19 concerns are becoming less of a major reason for people to work from home. Instead, many are choosing this work model just because they like teleworking.\n &#34;Among those who have a workplace outside of their home, 61% now say they are choosing not to go into their workplace, while 38% say they&#39;re working from home because their workplace is closed or unavailable to them,&#34; according to a  new report from Pew Research Center. &#34;Earlier in the pandemic, just the opposite was true: 64% said they were working from home because their office was closed, and 36% said they were choosing to work from home.&#34;\n Pew&#39;s  analysis is based on survey results of 5,889 employed US adults who have one primary job. The broader January survey includes results from 10,237 US adults from January 24 to January 30, 2022.\n     Additionally, 76% of workers with offices already open reported their &#34;major reason&#34; for working remotely from home all or most of the time was just due to the fact that they prefer this work style. In October 2020, 60% said this. Less than half (42%) cited concerns of exposure to coronavirus as a reason for working from home in the January 2022 survey — a smaller share than the 57% in October 2020.\n Fewer workers with kids under 18 said childcare was a factor compared to October 2020, but it&#39;s still relevant for some — 45% in 2020 versus 32% in 2022.\n &#34;What we&#39;re seeing is that working from home has worked for people,&#34; Juliana Horowitz, associate director of research at Pew Research Center and a co-author of the new report, told Insider. &#34;We saw this even in  2020 when it&#39;d been a quick shift to remote work, and we saw that for the most part people thought it was easy for them to have what they needed to work from home and to continue to meet deadlines and to be productive.&#34;\n &#34;We continue to see that today, and people see telework and remote work as something that can help them balance things in terms of work and family, and it&#39;s something that people would like to continue doing after the pandemic is over,&#34; Horowitz added.\n      According to the report, 59% of US workers who are capable of doing their job from home reported they were working from home most or all of the time in the January 2022 survey, less than the 71% in October 2020. Working from home may be  ideal for parents who are juggling childcare duties or for people who want to  save on commuting. Survey responses from Pew Research highlight some other positives of teleworking.\n Sixty-four percent said working from home has made it easier to balance work and personal life, with 16% working from home at least some of the time saying this kind of telework has made it harder. This balance may be good news for workers who have been trying to manage the line between work and life as Horowitz said based on other research from Pew Research, &#34;we know that flexibility and being able to balance work and personal life is very much a priority for workers even before the pandemic.&#34;\n And people newly working remotely at least some of the time are feeling productive  — 44% responded to it&#39;s &#34;easier for you to get your work done and meet deadlines,&#34; but 10% said it&#39;s harder. As noted by  FlexJobs, fewer interruptions and a quieter space add to remote productivity.\n However, 60% said they&#39;re feeling less connected to their colleagues due to work from home, and only 4% said they felt more connected. Horowitz noted Pew didn&#39;t ask what respondents meant by &#34;connected&#34; — whether they interpreted that question as personal connections with coworkers or something else. Other negatives outside of the survey results may be  burnout or  micromanaging from managers.\n     Regardless of some negatives that come with telework, this and other  surveys suggest that remote workers want to  continue this flexible arrangement and continue to reap its associated benefits.\n &#34;Given what [workers] told us in the survey,&#34; Horowitz said, &#34;in terms of preferences for the future, as long as employers allow telework it seems clear that that&#39;s something that employees have seen the benefits of.&#34;\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n              Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2022-02-19 18:34:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,远程工作,工作人员,workers", "title": "远程工作人员喜欢在家工作，即使对病毒的恐惧减弱了", "title_en": "Remote Workers Like Working From Home Even As Virus Fears Wane", "transed": 1, "url": "https://www.businessinsider.com/remote-workers-interested-in-working-from-home-pew-research-survey-2022-2?utm_source=reddit.com", "via": "", "real_tags": ["病毒", "远程工作", "工作人员", "workers"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于那些需要更新Kubernetes的人来说，这是谷歌在2014年创建的一个开源容器项目，用于自动化、监控和运行应用程序。\nKubernetes是云本地开发人员使用最多的工具之一，随着公司的发展，它可能会面临挑战，但Kubecost旨在通过其用于监控、管理和优化Kubernetes大规模支出的开源工具来缓解其中一些成长痛苦。\n该公司成立于2019年，由两名前谷歌员工韦布·布朗（Webb Brown）和阿杰·特里帕西（Ajay Tripathy）创建，他们之前曾为谷歌基础设施和谷歌云提供基础设施监控解决方案。\n布朗告诉TechCrunch：“到目前为止，随着向集装箱的重大转变，围绕成本、性能和可靠性的领域一直存在问题。”。“团队得到了好处，但完全牺牲了支出的可见度，有点像拥有数百万美元的工资单，但不知道哪个部门、团队或个人得到了什么。”\n布朗解释说，如果没有这种可见度，下游效应可能会出现在额外的浪费中——他已经看到团队在不知道产品成本的情况下超支了80%，在某些情况下。\nKubecost认识到团队需要有支出安全网来缓冲未来的冲击，因此开始提供实时成本可视性和洞察力，以持续监控和减少与Kubernetes相关的数百万美元云成本。\n布朗说，公司的核心产品是开源的，可供团队免费使用。它还为企业提供了一种商业产品，可以在几分钟内完成功能安装，并在不需要进行销售的情况下进行试用或使用。\n客户不必与Kubecost共享信息，但该技术将开源信息带入客户的环境，并与其云或内部数据中心集成。\n从那里，实时收集信息，提供洞察，显示公司在哪些领域花费资源，推动成本上升，以及成本上升的原因。然后，Kubecost提供有关如何降低成本的见解，并发送警报，或帮助制定策略，以便随着时间的推移进行管理。\nKubecost已经与2000多家公司合作，其中包括100多家企业客户——这一数字比去年增长了三倍，是参与度指标的五倍——并管理着超过20亿美元的Kubernetes支出。该公司的年度经常性收入同比增长三倍。布朗没有透露具体的公司估值，但确实表示估值比去年上涨了五倍。\n随着采用预计将继续其轨道，该公司在Coatue管理层的领导下，在种子投资者First round Capital和Afore Capital的参与下，获得了一轮2500万美元的A系列融资。作为投资的一部分，Coatue合伙人David Cahn将加入Kubecost的董事会。\n新资本将投资于全面招聘。Kubecost的起源始于开源，布朗计划在该社区和更多功能上进行一些重大投资。它还准备实施大量新功能，与生态系统中的其他产品集成，并在洞察和优化方面进行更多开发。\n此外，该公司还开始了“托管Kubecost”的旅程，这是一个为那些在试用该产品后希望让公司代表他们管理功能的团队带来的附加值。\n布朗说：“总的来说，从云到容器的根本性转变已经掀起了一股惊人的浪潮，从数据中心到云的转变同样巨大，因此我们预计这种转变将继续下去。”。“Kubernetes是现代企业技术的核心。我们计划在这方面进行更深入的研究，以实现转型，并开发出一款能够运行所有应用程序的高规模产品。”", "note_en": "For those who need a refresher on Kubernetes, it is an open source container project created by Google in 2014 to automate, monitor and run applications.\n Kubernetes is one of the most-used tools by cloud-native developers and can be challenging as a company grows, but  Kubecost aims to alleviate some of those growing pains through its open source tools for monitoring, managing and optimizing Kubernetes spend at scale.\n  The company was founded in 2019 by two former Google employees, Webb Brown and Ajay Tripathy, who previously worked on infrastructure monitoring solutions for Google infrastructure and Google Cloud.\n “There has been a problem in the space around cost, performance and reliability, by far, with this major transition to containers,” Brown told TechCrunch. “Teams were getting benefits, but totally sacrificing visibility in spending, kind of like having a payroll of millions of dollars, but not knowing what department, team or individuals are getting paid what.”\n  Without that visibility, Brown explained that the downstream effects could be seen in additional waste — he has seen teams overspend, in some cases, by 80% when they don’t know the cost of a product.\n Recognizing the need for teams to have spending safety nets to cushion for future shocks, Kubecost set out to provide the real-time cost visibility and insights required to continuously monitor and reduce millions of dollars in Kubernetes-related cloud costs.\n The company’s core product is open source and freely available for teams, something Brown said will always be true. It also has a commercial product for enterprises that can be functionally installed in minutes and tried or used without having to take to sales.\n Customers don’t have to share information with Kubecost, but instead the technology takes the open source information and brings it into the customer’s environment and integrates with its cloud or on-premise data center.\n From there, information is collected in real time and insights provided that show all the areas where a company is spending resources, driving up costs and why costs are going up. Kubecost then provides insights on how to reduce costs and sends alerts or can help set policies so that it can be managed over time.\n   Kubecost is already working with more than 2,000 companies, including over 100 enterprise customers — a number that went up three times over last year with five times the engagement metrics — and manages over $2 billion in Kubernetes spend. The company’s annual recurring revenue is growing three times year over year. Brown did not share a specific company valuation, but did say it went up five times from last year.\n With adoption expected to continue on its trajectory, the company secured $25 million in Series A funding in a round, led by Coatue Management, with participation from seed investors First Round Capital and Afore Capital. As part of the investment, Coatue partner David Cahn will join Kubecost’s board of directors.\n The new capital will be investing in hiring across the board. Kubecost’s origins started with open source, and Brown plans to make some major investments in that community and on more features. It is also preparing to implement tons of new features, integrations with other products in the ecosystem and more development on insights and optimizations.\n In addition, the company is also starting its journey with “Hosted Kubecost,” a value-add for teams that, after trying the product, want to let the company manage the functionalities on their behalf.\n “Overall, there has been an amazing wave of fundamental transformation from cloud to containers, which when you look at it is as big as the transition from data centers to the cloud, so we expect that to continue,” Brown said. “Kubernetes is at the heart of the modern enterprise tech stack. We plan to go deeper there to make transitions and get to a high-scale product that can run all applications through it.”", "posttime": "2022-02-19 18:27:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,支持,backs", "title": "Coatue支持Kubecost向数百万Kubernetes开发者提供数据的目标", "title_en": "\n\t\t\t\tCoatue backs Kubecost’s goal to supply data to millions of Kubernetes developers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/18/coatue-backs-kubercosts-goal-of-supply-data-to-millions-of-kubernetes-developers/", "via": "", "real_tags": ["开发", "支持", "backs"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要想了解Sirona和Nines的结合点，可以把它想象成一块蛋糕。蛋糕的第一层由医学图像数据库组成。第二层是放射科医生日常使用的软件，如查看或报告软件。第三种是人工智能算法，可以在这些图像中搜索模式或帮助医生做出决定。\nSirona的核心产品RadOS旨在将这两个最底层的部分结合起来，并允许人工智能算法在顶层进行分层——这正是Nines取得重大进展的地方。\n该公司发明了一些算法，声称它们实际上可以帮助医生做出决策。其中一种算法允许科学家测量肺结节（异常生长）的大小，以帮助检测呼吸道疾病。另一种算法评估脑部CT图像是否存在颅内出血和肿块效应。目的是帮助医生对病人进行分类。（两种算法均已获得FDA 510（k）许可。）\nSirona首席执行官卡梅伦·安德鲁斯（Cameron Andrews）对TechCrunch说，之所以进行这项收购，是因为要真正将算法集成到临床医生的工作流程中，需要统一第一层和第二层。他说，拉多斯已经准备好解决这个问题。\n说到医疗领域的人工智能，最近的情况好坏参半。一方面，IBM Watson Health将于1月份分拆，这对人工智能放射学乐观主义者来说是一个打击。但这还不足以抑制热情。同一个月，美国最大的门诊诊断成像提供商Radnet收购了两家投资于癌症、肺部疾病和神经退行性病变人工智能成像分析的公司。\n然后是房间里的大象：预期中的人工智能放射学革命尚未到来。对2021所美国放射学会的大约1400名成员进行的调查发现，目前只有30%的放射科医师在他们的临床实践中使用人工智能，而那些没有使用人工智能的人中有20%人计划在未来五年内购买新的人工智能工具。\nSirona的观点是，阻碍人工智能在放射学中应用的问题已经深入到行业的传统技术中。所有上述“层”都不是为了协同工作而设计的。\n安德鲁斯说，甚至在添加临床支持算法之前，放射科医生已经在使用三到四种不同的软件。然后，如果你想添加一个使用人工智能功能的新软件程序，你必须在这个捆绑包中再添加一个。正如《放射学人工智能》上的一篇评论文章所指出的，强大的人工智能软件需要在各个工作站上安装特定于供应商的软件。论文指出，这一过程在采用新技术时会增加复杂性。\n安德鲁斯说：“我们认识到，底层的放射学IT堆栈本身，以及更广泛的底层成像IT堆栈，基本上无法处理放射科医生的任务，以及第三方人工智能和软件供应商在未来十年将对其提出的任务。”。\n有鉴于此，Sirona收购Nines将把这些顶层算法整合成RADO。这对医生来说意味着什么？这意味着他们将能够无缝地从带注释的图像移动到报告。医生现在可以点击肺结节，使用Nines算法进行测量，然后再次点击，将测量结果插入报告。\n这似乎简单得令人难以置信。尽管如此，安德鲁斯说，这是“不可能实现的”。\n“人工智能和计算机视觉代表着将像素与单词关联起来的能力，[而]自然语言处理代表着将单词与像素本身关联起来的能力，”他解释道。“现在无法实现双向连接，因为用于创建报告的软件和用于查看图像的软件在功能上是分离的。它们与算法完全分离。”\nSirona只收购了Nines的临床数据管道、两种FDA批准的算法、机器学习引擎以及放射工作流程管理和分析工具。有趣的是，该公司尚未收购Nines的远程放射学部门。Nines还雇佣远程工作的放射科医生，为医院和诊所提供专业知识。\nAndrews说，远程放射学部门不适合Sirona，因为Sirona“不从事放射学服务业务”。但他拒绝讨论交易的细节。\n这笔交易的起源是投资者重叠和相互联系的结果。8VC是这两家公司的投资者，Sirona与Nines的投资者Accel Partners有联系。Sirona已经筹集了6250万美元。", "note_en": "To understand where Sirona and Nines fit together, think about the IT behind radiology as a layer cake. The first layer of that cake is made of medical image databases. The second layer is software that radiologists interact with on a day-to-day basis, like viewing or reporting software. The third consists of AI algorithms that can search for patterns in those images or help doctors make decisions.\n RadOS, Sirona’s core product, aims to bring together these bottom two pieces, and allow for AI algorithms to be layered on top — which is where Nines has made significant progress.\n  The company has created algorithms that it claims can actually aid in physician decision-making.  One of those algorithms allows scientists to measure the size of lung nodules (abnormal growths) to help detect respiratory diseases.  The other algorithm evaluates CT images of the brain for signs of intracranial hemorrhage and mass effect. The goal is to help doctors triage patients. (Both algorithms have received FDA 510(k) clearance.)\n  This acquisition is happening because, to truly integrate algorithms into clinicians’ workflow, you need to unify layers one and two, Sirona CEO Cameron Andrews told TechCrunch. RadOS, he said, was poised to solve that problem.\n When it comes to AI in healthcare, it’s been a mixed bag lately. On one hand, you have the  spinoff of IBM Watson Health in January — a blow to AI radiology optimists. But it’s not enough to dampen enthusiasm.  That same month, Radnet, the largest outpatient diagnostic imaging provider in the country, acquired two companies invested in AI imaging analysis for cancer, pulmonary diseases and neurodegeneration.\n  Then there’s the elephant in the room: The  anticipated AI radiology revolution has yet to arrive.  A survey of about 1,400 members of the American College of Radiology done in 2021 found that just 30% of radiologists currently use AI in their clinical practices, and 20% of those that did not use AI planned to purchase new AI tools within the next five years.\n Sirona’s pitch is that the issues that have stymied AI applications in radiology are baked deep into industry’s legacy tech. All those aforementioned “layers” aren’t designed to work together.\n Even before you add on clinical support algorithms, radiologists are already working with three or four different pieces of software, said Andrews. Then, if you want to add on a new software program that employs AI capabilities, you have to add yet another to that bundle.  As one review paper in Radiology Artificial Intelligence notes, robust AI software requires the installation of vendor-specific software on individual workstations. This process, the paper notes, can add complexity when it comes to adopting new technology.\n “We recognized that the underlying radiology IT stack itself, and the underlying imaging IT stack more broadly, is fundamentally unable to handle both the tasks that radiologists have, and the tasks that third-party AI and software vendors are going to be demanding of it in the next decade,” said Andrews.\n In that light, Sirona’s acquisition of Nines will unite those top-layer algorithms into RadOS. What does that actually mean for doctors? It means they’ll be able to move seamlessly from an annotated image, to report. A doctor could now click on a lung nodule, have it measured using Nines algorithm, and then with another click, insert that measurement into a report.\n This seems almost mind-numbingly simple. And yet despite that, it was “impossible to achieve,” Andrews said.\n  “AI and computer vision represents the ability to correlate pixels with words, [and] natural language processing represents the ability to correlate words back to the pixels themselves,” he explains. “That bi-directional connectivity cannot be achieved today because software used to create the report and the software used to look at images are functionally separate. And they’re totally separate from the algorithms.”\n Sirona has only acquired Nines’ clinical data pipeline, its two FDA-cleared algorithms, its machine learning engines and its radiology workflow management and analytics tools. The company, interestingly, has not acquired Nines’ teleradiology arm. Nines also employs radiologists who work remotely, and provide their expertise to hospitals and clinics.\n The teleradiology arm wasn’t a fit for Sirona because Sirona “isn’t in the radiology services business,” said Andrews. But he declined to discuss the details of the deal.\n The genesis of the deal came as a result of investor overlap and mutual connections. 8VC is an investor in both companies, and Sirona has connections with Accel Partners, an investor in Nines. Sirona has raised $62.5 million.", "posttime": "2022-02-19 18:24:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,人工智能,algorithms,medical", "title": "Sirona Medical收购Nines的人工智能算法，从头开始重建放射学的IT", "title_en": "\n\t\t\t\tSirona Medical acquires Nines’ AI algorithms to rebuild radiology’s IT from the ground up\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/18/sirona-medical-acquires-nines-ais-algorithms-to-rebuild-radiologys-it-from-the-ground-up/", "via": "", "real_tags": ["算法", "人工智能", "medical"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用户只能与个人朋友共享他们的实时位置。Snapchat表示，出于安全考虑，用户无法向所有Snapchat好友发送实时位置详细信息。该公司还指出，双方必须在Snapchat上接受对方作为朋友，然后才能分享自己的位置。当用户决定打开该功能时，系统会提示他们，该工具只适用于亲密的朋友和家人。\n自2017年以来，该应用程序为用户提供了在使用Snapchat时在Snap Map上与朋友共享位置的选项。现在，每个月有2.5亿人使用地图与朋友联系。该公司表示，这项新的实时功能是基于用户对他们如何与朋友使用Snap Map的反馈而建立的。报告指出，78%的美国Snapchat用户表示，他们毫不犹豫地在Snap地图上分享自己的位置，他们这样做是因为他们认为这是与他人保持联系的安全方式。\n该公司将发布这一新功能，作为其与致力于打击校园性侵犯的国家非营利组织It's On Us更广泛合作关系的一部分。除了新功能，该应用程序还将发布一个新的PSA，重点是提高旁观者的意识。\nSnapchat宣布从2月23日开始，用户可以更改用户名，一天前，这项新功能发布。用户名更改不会影响用户帐户的各个方面，例如他们的好友列表、快照代码、快照分数、记忆等。您将无法选择已经使用过的用户名，并且您只能每年更改一次用户名。", "note_en": "Users can only share their real-time location with individual friends. Snapchat says that for safety reasons, there isn’t an option for users to send their real-time location details to all of their Snapchat friends. The company also notes that both parties have to accept each other as friends on Snapchat before they can share their location. When users decide the turn on the feature, they’ll be prompted with a reminder that the tool is meant to be used with close friends and family only.\n Since 2017, the app has given users the option to share their location with their friends on the Snap Map when using Snapchat. Now, 250 million people use the Map to connect with their friends each month. The company says this new real-time feature was built on feedback from users about how they were using Snap Map with their friends. It notes that 78% of Snapchat users in the United States say they aren’t hesitant to share their location on the Snap Map and that they do so because they think it’s a safe way to stay connected with others.\n  The company is releasing the new feature as part of a broader partnership with  It’s On Us, a national nonprofit dedicated to combating campus sexual assault. In addition to the new feature, the app will also publish a new PSA focused on increasing bystander awareness.\n The launch of the new feature comes a day after  Snapchat announced that users will be able to change their usernames starting February 23rd. The username change won’t impact aspects of users’ accounts, such as their friend lists, Snap codes, Snap scores, memories, etc. You won’t be able to select usernames that have already been used and you can only change your username once a year.", "posttime": "2022-02-19 18:23:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "共享,rolling", "title": "Snapchat推出了一个新的好友系统，比如实时位置共享功能", "title_en": "\n\t\t\t\tSnapchat is rolling out a new buddy system-like real-time location sharing feature\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/18/snapchat-new-buddy-system-like-temporary-location-sharing-feature/", "via": "", "real_tags": ["共享", "rolling"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新创始人通常认为他们正在打造一种产品、一台营销机器或一台运转良好的机器。这可能都是真的，但这还不够。世界上到处都是次优产品获胜的例子。HD-DVD客观上比蓝光要好，但前者被索尼无情地碾碎了。有一千种解决方案比Jira更好，但成群结队的产品经理正在咬紧牙关地使用它。创业历史的编年史上有很多公司，它们制造出了超高效的机器，这些机器已经准备好实现难以置信的规模，但需求永远不会实现。其中一个很好的例子是WebVan，它建立了价值数百万美元的物流和运营，但却从来没有得到它所需要的客户——要对这场特定的灾难进行伟大的分析，请阅读Benchmark capital的故事“eBoys”。\n作为一名初创公司的首席执行官，你有三份工作：不要耗尽资金，确定公司的方向和文化，最重要的是雇佣合适的团队。后者是你做任何事情的关键，因为它使你能够改变方向。\n斯图尔特·巴特菲尔德（Stewart Butterfield）是一位创始人的好例子，他在这方面做得特别好。他曾多次尝试创办游戏公司，但每次都“失败”。在他第一次制作游戏时，他的公司想要一种分享图片和截图的机制。第二次制作游戏时，他发现很难与队友沟通，也很难让每个人都了解他们需要知道的事情。他们构建了解决这两个问题的工具，并将这些工具作为独立的业务进行拆分。你可能听说过它们——Flickr用于照片共享，Slack用于内部交流。事实证明，这两家公司都非常成功。这两个都是可能的，因为创始团队没有太严格地坚持他们最初的想法；他们发现了一个想法，确认它可能是个好主意，然后把公司转为中心。\n招聘最重要的一点是雇佣那些有灵感、有启发性和好奇心的人。你需要愿意开发深层领域专业知识的团队成员。如果您正在为电子病历构建一个符合HIPAA的SaaS解决方案，那么您不仅仅需要雇佣一个能够解决这些特定问题的团队。是的，这就是你现在所需要的，但是创业公司的魔力在于你不知道接下来会发生什么。一开始你并不是在建立一个专家团队——这可以等到你真正进入成长阶段，那时你需要真正的、深入的专家，他们能够以一流的方式解决这些问题。\n在创建公司的最初阶段，你正在收集一群关心患者保密性、数据安全性、合规性和用户体验的人，他们可以将这些技能应用于不同的问题。初创公司需要灵活；如果一个无可匹敌的竞争对手突然出现，通过重新定义你正在做的事情来回避挑战。不要在红色、血淋淋的海洋中与可能在每一个回合都超过你的庞然大物竞争；找到一个蓝海战略，在这个战略中，你选择了一块目前没有人感兴趣的市场。\n与我最近的一家公司合作，我们正在构建一个虚拟活动平台。这是令人兴奋的，因为我们在一场导致一系列封锁的大流行发生后的几周内启动了该项目，结果我们看到了惊人的增长。这也是令人兴奋的，因为出乎意料的是，我们最大的竞争对手是有史以来增长最快的初创公司。我们有一个令人惊叹的团队，能够进入一个没有其他人能够提供大规模服务的细分市场：为那些深切关注活动品牌体验的公司举办的白标活动。当然，这是一个非常小的市场份额，但这是一个蓝海战略，拥有极高价值的客户，他们为高度定制的活动支付了高数量级的费用。\n多年来，我曾为数百家初创公司担任顾问，既担任一家风险投资公司的投资组合总监，又担任独立顾问。毫无疑问，最强大的创业团队是那些多才多艺、饥肠辘辘、知识渊博的团队。初创公司推出最低可行产品（用词不当，因为它们不是最低可行的，它们不可行，它们不是产品）——通常被定义为“验证假设所能做的最小工作量”。在进行这些实验的过程中，这些公司对客户的需求了解了很多。他们了解定价，了解他们正在解决的问题，了解客户的购买动态，了解竞争格局和他们可以使用的不同商业模式。\n很多时候，一家公司会在六到九个月的时间里，意识到他们最初的假设并不完全准确。在这一点上，他们有一个选择：加倍努力，继续沿着这条路走下去——一些创业者能够将他们的公司发展壮大，并通过这种方式获得巨大的成功。另一个选择是转向；利用你在学习过程中获得的来之不易的知识，利用你建立的灵活团队选择不同的方向。放弃你正在构建的游戏，转而构建一个沟通工具。放弃多面手虚拟活动平台，打造一款专业的利基产品，让你在市场上站稳脚跟。或者对你的团队说：“嘿，这行不通，但我们在过去的一年里对这个行业了解了很多。你们还发现了什么问题，我们可以开始研究了？”\n过于专业化太早意味着你要为一家公司制造狙击步枪，它的完美设计是为了以一种严格定义的方式解决一个非常具体的问题。如果你幸运的话，这可能会奏效——但你真正需要的是一把猎枪和尽可能多的弹壳，以最大限度地增加成功的机会。相应地雇佣。", "note_en": "New founders often believe that they are building a product, a marketing machine or a well-oiled operations machine. That may all be true, but it isn’t enough. The world is full of examples where the second-best product wins. HD-DVD was objectively better than Blu-ray, but the former was brutally ground to dust by Sony. There are a thousand solutions that are better than Jira, but hordes of product managers are using it through gritted teeth. And the annals of startup history are litered with companies that built supremely efficient machines that were ready for incredible scale, only for the demand to never materialize. One great example of that is WebVan, which built millions of dollars’ worth of logistics and operations, only to never quite get the customers it needed — for a great analysis of that particular disaster,  read “eBoys”, the story of Benchmark capital.\n As a startup CEO, you have three jobs: Don’t run out of money, set the direction and culture of the company and — most importantly — hire the right team. The latter is the crux of everything you do, because it is what enables you to pivot.\n  Stewart Butterfield is a good example of a founder who does this particularly well. He has attempted to start a games company several times, and “failed” every time. The first time he built a game, his company wanted a mechanism for sharing pictures and screenshots. The second time he built a game, he discovered that it was hard to communicate with his teammates and keep everyone in the loop on what they needed to know. They built tools to solve both of these problems and spun those tools out as separate businesses. You may have heard of them — Flickr for photo sharing, and Slack for internal communication. Both turned out to be supremely successful companies. And both were possible because the founding team didn’t hold on too tightly to their original idea; they spotted an idea, validated that it might be a good idea and then pivoted the company.\n The important thing about hiring is to hire folks who are inspired, inspiring and curious. You need team members who are willing to develop deep domain expertise. If you are building a HIPAA-compliant SaaS solution for electronic patient records, you’re not just hiring a team that can solve those specific problems. Yes, that is what you need in the  now, but the magic of startups is that you don’t quite know what comes next. You’re not building a specialist team at first — that can wait until you hit a growth stage in earnest, when you need true, deep specialists who can solve these problems in a best-in-class way.\n At the earliest stages of founding a company, you are collecting a gang of humans who care about patient confidentiality, data safety, compliance and user experience, and who can apply those skills to different problems. Startups need to be nimble; if an unbeatable competitor shows up out of the blue, side-step the challenge by redefining what you are doing. Don’t fight in the red, blood-soaked ocean against behemoth competitors that can out-spend you at every turn;  find that blue-ocean strategy where you are choosing a slice of the market that nobody is interested in just now.\n With one of my recent companies, we were building a virtual events platform. That was exciting because we launched within weeks of a certain pandemic that caused a bunch of lockdowns — and we saw incredible growth as a result. It was also exciting because out of the blue,  our biggest competitor was the fastest-growing startup of all time. We had an amazing team, and were able to pivot into a niche that nobody else was serving at scale: white-label events for companies that deeply care about the branded experience of their events. Sure, it was a very small slice of the market, but it was a blue-ocean strategy with extremely high-value customers who paid orders of magnitude more for highly customized events.\n  Over the years, I’ve worked as an advisor to a few hundred startups, both in my role as director of Portfolio at a venture firm, and as an independent advisor. Without fail, the strongest startup teams are the ones that are versatile, hungry and knowledgeable. The startups launch minimum viable products (a misnomer, because they aren’t minimal, they aren’t viable and they aren’t products) — often defined as “the smallest amount of work you can do to validate a hypothesis”. In the process of running these experiments, the companies learn a tremendous amount about what the customers want. They learn about pricing, about the problems they are solving, about the buying dynamics of the customers, about the competitive landscape and the different business models that are available to them.\n A lot of the time, a company gets six-nine months down a path and realizes that their original assumptions weren’t completely accurate. At that point, they have a choice: double down and pig-headedly continue down the path — and some startup founders are able to will their companies into being and find tremendous success that way. The other option is to pivot; take the hard-earned knowledge you picked up along the way, and leverage the flexible team you’ve built to pick a different direction. Abandon that game you were building in favor of building a communications tool. Give up on the generalist virtual events platform and build a specialist, niche product that can give you a foothold in the market. Or turn to your team and say “hey; this isn’t going to work, but we learned a lot about this industry over the past year. What other problems have you guys spotted, that we can start looking at?”\n Over-specialization too early means you build a sniper rifle of a company, perfectly designed to solve a very specific problem in a tightly defined way. If you’re lucky, that may work — but what you really need to maximize your chances of success is a shotgun and as many shells as you can carry. Hire accordingly.", "posttime": "2022-02-19 18:21:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,versatile", "title": "建立一个多才多艺的创业团队，让创业变得更容易", "title_en": "\n\t\t\t\tBuild a versatile startup team to make pivots easier\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/18/building-a-startup-is-building-a-team/", "via": "", "real_tags": ["创业", "versatile"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国副司法部长丽莎·摩纳哥（Lisa Monaco）在本周慕尼黑网络安全会议上的一次演讲中宣布组建虚拟资产开发团队（VAXU），称该团队将帮助美国政府跟上“以市场产生创新的速度开发创新的威胁参与者”\n摩纳哥补充说，这包括“勒索软件的爆炸和加密货币的滥用”，并指出FBI目前正在追踪100多种不同的勒索软件变种。Channe分析报告说，骗子在全球2021的受害者中窃取了超过77亿美元的密码，比前一年增加了80%。\nFBI的VAXU部门将把加密货币专家、区块链分析和虚拟资产扣押结合在一个地方进行调查，并为FBI的其他人员提供培训。该专门部门将成为美国司法部国家加密货币执行小组（NCET）的一部分，该小组成立于2021年底，旨在调查数字资产的犯罪使用，特别关注虚拟加密货币交换和其他能够滥用加密货币或促进犯罪活动的技术。\n摩纳哥说：“勒索软件和数字勒索，就像加密货币引发的许多其他犯罪一样，只有在坏人得到报酬的情况下才有效，这意味着我们必须打破他们的商业模式。”。“货币可能是虚拟的，但给公司的信息是具体的：如果你向我们报告，我们可以跟踪资金，不仅帮助你，而且有望防止下一个受害者。”\n摩纳哥本周还宣布，联邦检察官尹永财（Eun Young Choi）已被任命为NCET的第一任主任，他在网络犯罪的审讯方面具有丰富经验。\n崔说：“NCET将发挥关键作用，确保随着围绕数字资产的技术的增长和发展，该部门反过来加快和扩大打击各类罪犯非法滥用数字资产的努力。”。\n就在宣布这一消息的几周前，美国司法部查获了9.4万枚比特币，目前价值36亿美元，据称这些比特币是在2016年对加密交易所Bitfinex的黑客攻击中被盗的，这是美国司法部“有史以来最大的”金融查封。", "note_en": "U.S. Deputy Attorney General Lisa Monaco announced the formation of the Virtual Asset Exploitation Team (VAXU) during a speech at the Munich Cyber Security Conference this week, saying the unit will help the U.S. government to keep pace with “threat actors who exploit innovations as fast as the marketplace produces them.”\n This includes “the explosion of ransomware and the abuse of cryptocurrency,” Monaco added, noting that the FBI is currently tracking more than 100 different ransomware variants.  Chainalysis reports that scammers wiped over $7.7 billion in cryptocurrency from victims globally in 2021, an increase of 80% compared to the previous year.\n  The FBI’s VAXU unit will combine cryptocurrency experts,  blockchain analysis and virtual asset seizure in one place to work investigations and provide training to the rest of the FBI. The specialized unit will form part of the National Cryptocurrency Enforcement Team (NCET), a division of the U.S. Justice Department created in late-2021 to investigate the criminal use of digital assets, with a particular focus on virtual cryptocurrency exchanges and other technologies that enable the misuse of cryptocurrency or facilitate criminal activity.\n “Ransomware and digital extortion, like many other crimes fueled by cryptocurrency, only work if the bad guys get paid, which means we have to bust their business model,” said Monaco. “The currency might be virtual, but the message to companies is concrete: if you report to us, we can follow the money and not only help you but hopefully prevent the next victim.”\n  Monaco also announced this week that Eun Young Choi, a federal prosecutor with experience in arraigning cybercriminals, has been appointed the first director of the NCET.\n “The NCET will play a pivotal role in ensuring that as the technology surrounding digital assets grows and evolves, the department in turn accelerates and expands its efforts to combat their illicit abuse by criminals of all kinds,” said Choi.\n The announcement comes just weeks after  the DOJ seized over 94,000 bitcoins, currently valued at $3.6 billion, that were allegedly stolen in the 2016 hack of crypto exchange Bitfinex, marking the “largest ever” financial seizure by the department.", "posttime": "2022-02-19 18:19:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,货币,eyes", "title": "FBI通过新的加密货币犯罪部门关注勒索软件利润", "title_en": "\n\t\t\t\tFBI eyes ransomware profits with new cryptocurrency crimes unit\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/18/fbi-ransomware-cryptocurrency-crimes/", "via": "", "real_tags": ["软件", "货币", "eyes"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到Equity，这是一个关于创业公司业务的播客，在这里我们将把数字和细微差别放在标题后面。\n本周，娜塔莎、亚历克斯和玛丽·安与克里斯和格蕾丝聚在一起，为我们周五的例行新闻综合报道做准备。然而，这一次，我们将迎来一个漫长的周末，让我们明确一点，每个人都需要。\n本周创业新闻：尽管早前有报道称出现了动荡，但Ro筹集了更多资金，Airbase与美国运通（Amex）合作，Deel希望为雇主提供一种用加密技术支付工资的方式，无论他们的员工在哪里。正如Twitter告诉我们的，他们并不是第一家尝试加密薪酬方法的公司。\n加密监管的世界正在升温，印度和美国都有消息要关注。我们的解读是，一些监管是好的，但并非每一场损失都能被视为一场胜利。来看看亚历克斯的科幻小说，留下来看看娜塔莎的船。\n我们还通过MindFi的视角观察了亚太地区有色人种的心理健康市场，她在美国很重要。我们有一些创业风格的问题，但通常对这些公司持乐观态度。\n我们以德国和美国的大麻市场收市。亚历克斯和娜塔莎看好这一切，而玛丽·安对大麻籽过敏。\n感谢大家上周收看我们的直播节目，我们下周将回到Hopin和Twitter空间，所以请注册收听我们的OG节目，无需编辑。不管怎样，有趣的节目一如既往，只是提醒我们周一休息，周二回来。拥抱！\n每周一太平洋标准时间早上7:00，周三和周五太平洋标准时间早上6:00，股票下跌，所以请订阅我们的Apple播客、Cloud、Spotify和所有播客。", "note_en": "Hello and welcome back to  Equity, a podcast about the business of startups, where we unpack the numbers and nuance behind the headlines.\n This week,  Natasha and  Alex and  Mary Ann got together with  Chris and  Grace to rock our regular Friday news roundup. This time, however, with extra zip, as we’re staring down a long weekend that, let’s be clear, everyone needs.\n   Startups news of the week:  Ro raises  even more despite  earlier reports of turbulence,  Airbase partners with Amex, and Deel wants to give employers a way to fund their payroll in crypto,  no matter where their employees are based. As Twitter  tells us, they aren’t the first company to try the crypto salary approach.\n The crypto regulatory world is heating up, with news from  both India and  the United States to chew on. Our read is that some regulation is good, but not every loss can be spun as a win. Come for Alex’s sci-fi connection, and stay for Natasha’s boat metaphor.\n We also took a look at the mental health market for people of color  through the lens of MindFi in the APAC region,  and She Matters here in the United States. We had some startup-style questions, but are generally bullish about the companies.\n And we closed with the cannabis market of  both Germany and  the United States. Alex and Natasha are bullish on, well, all of it while Mary Ann nurses a hemp seed allergy.\n Thanks to those of you who tuned into our live show last week, we’ll be back next week on Hopin and Twitter Spaces  so sign up to hear our OG show without edits. Anyways, fun show as always and just a reminder that w e’re off Monday, but back Tuesday. Hugs!\n Equity drops every Monday at 7:00 a.m. PST, Wednesday, and Friday at 6:00 a.m. PST, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2022-02-19 18:05:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加密,paycheck,美国", "title": "你想要加密支票吗？", "title_en": "\n\t\t\t\tDo you want your paycheck in crypto?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/18/do-you-want-your-paycheck-in-crypto/", "via": "", "real_tags": ["加密", "paycheck", "美国"]}]