[{"category": "", "categoryclass": "", "imagename": "bf78faf96e775beee066552ce1a9513d.png", "infoid": 1010443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CloudFlare TV的灵感来自于90年代的电视节目，这些节目分享了计算机和音乐视频领域最新、最令人兴奋的发展。我们对Cloudflare电视有三个基本要求：\n所有事情都应该在云中进行，我们永远不需要要求任何人“让他们的计算机开着”才能让流一天24小时运行。\n白手起家地构建Cloudflare电视背后的许多技术并不是计划的一部分，特别是考虑到我们咄咄逼人的时间表。那么，我们为什么决定追查它呢？在评估了多种直播解决方案后，我们得出了以下结论：\n对于大多数视频流平台来说，24x7线性流不是优先考虑的事情。这是有道理的：视频点播和基于事件的直播的兴起是以牺牲线性流媒体为代价的。\n大多数广播平台都有自己的访客应用程序，必须提前下载和设置。与点击日历邀请中的链接以加入视频呼叫相比，这引入了不必要的摩擦。\nCloudflare TV的核心目标之一是让演示者更容易，还有什么比让他们使用他们已经知道的工具更容易的呢？我们团队中的每个人都熟悉Zoom，许多将出现在Cloudflare TV上的嘉宾也是如此。更好的是，Zoom几乎总是有效的。\n因此，当我们发现Zoom允许您将实时视频推送到任何RTMP端点时，我们开始试验该功能。\n“RTMP”代表实时消息传递协议(Real-Time Messaging Protocol)，最初是为了通过Macromedia Flash使用TCP实现低延迟通信而开发的。RTMP已经超过了Flash，并被包括YouTube在内的平台广泛使用，以实现视频直播。RTMP是一种推送协议，像YouTube这样的平台提供的RTMP端点仅仅是URL。大多数视频广播应用程序都可以让你配置多个RTMP端点，这会告诉应用程序“嘿，把我手机或电脑上的实时视频发送到这些服务上。”如果您发现自己正在观看多个服务正在播放的直播视频，这很可能是由RTMP实现的。\nZoom允许您提供RTMP端点，并指示它将Zoom调用的实况视频发送到Cloudflare TV的RTMP。在使用此功能之前，我们需要能够接收RTMP视频提要。\napt-get install build-Essential libpcre3libpcre3-dev libssl-dev git zlib1g-dev-ymkdir~/build&amp；&amp；cd~/buildgit克隆git://github.com/arut/nginx-rtmp-module.gitwget http://nginx.org/download/nginx-1.14.1.tar.gztar xzf nginx-1.14.1.tar.gzcd nginx-1.14.1sudo./Configure--with-http_ssl_module--add-module=../nginx-rtmp-module。\n接下来，我们配置了nginx.conf，以便Nginx不仅可以接收RTMP提要，还可以将其流传输给最终用户。浏览器通常不能从RTMP源进行流媒体传输。我们需要Nginx来获取RTMP提要并创建HLS/DASH段。\n我们定义了一个名为live inside nginx.conf的应用程序。在直播应用中，我们可以添加指令来摄取RTMP和输出HLS：\n.RTMP{服务器{.。应用LIVE{允许全部播放；LIVE ON；#SAMPLE HLS ON；HLS_PATH/mnt/HLS/；HLS_Fragment 1；HLS_PLAYLIST_LENGTH 4；HLS_SYNC 100ms；}。\n一旦我们将Nginx设置为摄取RTMP和HLS，我们就按照Zoom关于Custom Live Streaming的说明进行操作。很快，我们就有了使用Cloudflare网络进行实时流Zoom调用的基本原型！\n因此，我们满足了首要要求，即让客人体验像加入视频通话一样简单。但Cloudflare电视不会是一个永无止境的召唤。我们需要一种方法来在一天中的多个呼叫之间平稳过渡，并重放一些我们最喜欢的片段。\n例如，我们可能有从1000到1100的现场节目，然后是两个小时的预录(或重放)内容。当实况节目在1100结束时，视频体验将中断，并且用户将需要点击刷新来观看时间表上的下一个节目。\n能够设置节目(“What Play When？”)。提前很多天。\n让“虚拟房间”接收来自不同来源的视频(现场活动、使用我们的Cloudflare Stream产品存储的预先录制的视频)。\n一旦我们有了时间表和“虚拟房间”，我们就可以动态地将当前正在播放的内容切换到适当的“虚拟房间”来流式传输内容。\n“勇敢”是英国广播公司发起的一个开源项目。使用Brave，我们能够设置多个虚拟房间，并使任何虚拟房间顺利上线。\n每时每刻都在把决赛(“空中补给”)推到Nginx。\nContentful是一个设计为API优先的无头内容管理平台；它消除了对数据库的需要，并帮助我们快速构建我们的日程安排功能。\n对于CMS来说，大多数必需的字段都非常简单：标题、演示者，当然还有时间段。其中的每一个都自动与cloudflare.tv/Schedule上面向公众的时间表同步。\n导出异步函数fetchEventRaw(id：string){let r=等待获取(`${contentful_api}/entry/${id}`，{Headers：{&#39；Content-Type&#39；：&#39；application/json&#39；，Authorization：`承载${contentful_admin}`，}，})return unrapch(r，&#39；无法检索事件&#39；)}\n更复杂的部分是将其与Zoom集成。每个细分市场都需要自己的Zoom会议，手动创建这些会议相当困难。因此，当我们在Contful中发布时，Contful会调用一个工作端点。工作人员端点自动生成Zoom会议，并向编程团队提供定制的邀请以发送给来宾。\n例如，当新事件添加到Contful时，Contful会通知我们的员工端点创建新会议并对其进行配置，以便将其推送到Cloudflare TV：\n导出异步函数createMeeting(EV：TVEevent){const Headers=await zoomHeaders()const Alternative_Hosts=ev.altHosts？ev.altHosts.join(&#39；，&#39；)：&#39；&#39；ev.zoomPassword=genPassword()让r=等待fetch(`https://api.zoom.us/v2/users/${ev.studio}@cloudflare.com/meetings`，{Method：&#39；POST&#39；，Header，Body：JSON.stringify({Topic：ev.Title，Type：2，Start_Time：ev.start，Duration：ev.Duration，时区：&#39；utc&#39；，Agenda：ev.description，密码：ev.zoomPassword，设置：{host_video：true，Participant_video：false，Alternative_Hosts，CN_Meeting：false，in_Meeting：false，Join_Beever_host：true，mute_on_entry：true，Watermark：false，use_pmi：false，Approval_type：2，Audio：&#39；Both，AUTO_RECORING：&#39；cloud&#39；，enforce_login：False，}，})let Data=等待展开(r，&#39；无法创建缩放会议&#39；)日志(&#39；zoom：&#39；，data)ev.meetingId=data.id ev.zoomUrl=data.join_url//将直播流配置数据推送到会议r=等待fetch(`https://api.zoom.us/v2/meetings/${ev.meetingId}/livestream`，{method：&#39；patch&#39；，Header，Body：JSON.stringify({//TODO：使STREAM_URL：cftv_RTMP_ENDPOINT，STREAM_KEY：ev.studio，page_url：&#39；https://cloudflare.tv&#39；，})，})等待解包(r，&#39；更新实况流配置失败)返回EV}。\n使用Content的另一个好处是我们团队的许多成员已经熟悉它，因此它减少了学习新工具的开销。\n到目前为止，我们已经描述了使Cloudflare电视成为可能的后端的不同部分(Nginx、Brave、Contful)。我们怎么才能把他们都聚在一起呢？CloudFlare Workers是将这些系统连接在一起的粘合剂。Cloudflare电视前端构建在工作人员站点上。前端调用我们的工作端点来获取数据，比如编程日历。\n我们才刚刚开始使用Cloudflare电视。我们有一个很长的愿望清单，上面列出了我们真正想要看到的功能。以下是我们迫不及待想要开发的一些功能：\nCloudflareTV直播流缩放RTMP Life@Cloudflare", "note_en": "Cloudflare TV is inspired by television shows of the 90s that shared the newest, most exciting developments in computing and music videos. We had three basic requirements for Cloudflare TV:\n Everything should happen in the cloud and we should never have to ask anyone “to leave their computer on” to have the stream running 24 hours a day\n   Building a lot of the technology behind Cloudflare TV from scratch was not part of the plan, especially given our aggressive timeline. So why did we decide to pursue it? After evaluating multiple live streaming solutions, we reached the following conclusion:\n 24x7 linear streaming is not something that is a priority for most video streaming platforms. This makes sense: the rise of video-on-demand and event-based live streaming has come at the expense of linear streaming.\n Most broadcasting platforms have their own guest apps which must be downloaded and set up in advance. This introduces unnecessary friction compared to clicking a link in the calendar invite to join a video call.\n  One of the core goals of Cloudflare TV was to make it easy for presenters, and what’s easier than letting them use the tools they already know? Everyone on our team is familiar with Zoom, and so are many of the guests who will be appearing on Cloudflare TV. Better yet, Zoom almost always &#34;just works&#34;.\n So when we discovered that Zoom lets you push live video to any RTMP end point, we started experimenting with the feature.\n “RTMP” stands for Real-Time Messaging Protocol and was originally developed to facilitate low-latency communication using TCP via Macromedia Flash. RTMP has outlived Flash and is widely used by platforms, including YouTube, to enable live video streaming. RTMP is a push protocol and platforms like YouTube provide RTMP endpoints which are simply URLs. Most video broadcast apps will let you configure multiple RTMP endpoints, which tells the app “ hey send my live video feed from my phone or computer to these services.” If you find yourself watching a live video that is being broadcasted on multiple services, it is very likely made possible by RTMP.\n  Zoom lets you provide RTMP endpoints and instruct it to send the live video feed of Zoom calls to, in our case, Cloudflare TV’s RTMP. Before we could use this feature, we needed to be able to ingest RTMP video feeds.\n  apt-get install build-essential libpcre3 libpcre3-dev libssl-dev git zlib1g-dev -ymkdir ~/build &amp;&amp; cd ~/buildgit clone git://github.com/arut/nginx-rtmp-module.gitwget http://nginx.org/download/nginx-1.14.1.tar.gztar xzf nginx-1.14.1.tar.gzcd nginx-1.14.1sudo ./configure --with-http_ssl_module --add-module=../nginx-rtmp-modulesudo makesudo make install\n Next, we configured   nginx.conf so NGINX can not only ingest the RTMP feed, but also make it streamable to the end user. A browser typically can’t stream from an RTMP source. We need NGINX to take the RTMP feed and create HLS/DASH segments.\n We defined an application called  live inside  nginx.conf. Within the live application, we can add directives to ingest RTMP and output HLS:\n ...rtmp { server { ... application live { allow play all; live on; # sample HLS hls on; hls_path /mnt/hls/; hls_fragment 1; hls_playlist_length 4; hls_sync 100ms; } }}\n Once we had NGINX set up to ingest RTMP and HLS, we followed Zoom’s instructions on  Custom Live Streaming. And soon enough, we had a basic prototype of live streaming Zoom calls using the Cloudflare network!\n  So we met our number one requirement of making the guest experience as easy as joining a video call. But Cloudflare TV isn&#39;t going to be one never-ending call. We needed a way to smoothly transition between multiple calls over the course of the day, and to replay some of our favorite segments.\n For example, we may have live programming from 1000 to 1100 followed by two hours of pre-recorded (or replayed) content. When the live programming ends at 1100, the video experience would break and the user would need to hit refresh to see the next show on the schedule.\n  Ability to set the programming (the  “what plays when?”) many days in advance\n Have “virtual rooms” ingesting video from different sources (live events, pre-recorded videos stored using our Cloudflare Stream product)\n Once we have a schedule and “virtual rooms”, we can dynamically switch what is currently playing on-air to the appropriate “virtual room” streaming the content.\n     Brave is an open-source project started by the BBC. Using Brave, we were able to set up multiple virtual rooms and smoothly make any virtual room go on-air.\n  pushing the final (“on air feed”) to NGINX  every second of the day\n  Contentful is a headless content management platform designed to be API-first; it eliminated the need for a database and helped us build our scheduling feature rapidly.\n Most of the necessary fields are pretty straightforward for a CMS: title, presenters, and, of course, the time slot. Each of these is automatically synced with the publicly-facing schedule at  cloudflare.tv/schedule.\n  export async function fetchEventRaw(id: string) { let r = await fetch(`${CONTENTFUL_API}/entries/${id}`, { headers: { &#39;Content-Type&#39;: &#39;application/json&#39;, Authorization: `Bearer ${CONTENTFUL_ADMIN}`, }, }) return unwrap(r, &#39;Failed to retrieve event&#39;)}\n The more complex piece was integrating this with Zoom. Each segment needs its own Zoom meeting, and it’d be pretty arduous to create these manually. So when we publish in Contentful, Contentful makes a call to a Worker endpoint. The Worker endpoint automatically generates a Zoom meeting — and provides the Programming Team with the customized invite to send to the guest.\n For example, when a new event is added to Contentful, Contentful notifies our Worker endpoint which creates a new meeting and configures it so it is being pushed to Cloudflare TV:\n export async function createMeeting(ev: TVEvent) { const headers = await zoomHeaders() const alternative_hosts = ev.altHosts ? ev.altHosts.join(&#39;,&#39;) : &#39;&#39; ev.zoomPassword = genPassword() let r = await fetch(`https://api.zoom.us/v2/users/${ev.studio}@cloudflare.com/meetings`, { method: &#39;POST&#39;, headers, body: JSON.stringify({ topic: ev.title, type: 2, start_time: ev.start, duration: ev.duration, timezone: &#39;UTC&#39;, agenda: ev.description, password: ev.zoomPassword, settings: { host_video: true, participant_video: false, alternative_hosts, cn_meeting: false, in_meeting: false, join_before_host: true, mute_upon_entry: true, watermark: false, use_pmi: false, approval_type: 2, audio: &#39;both&#39;, auto_recording: &#39;cloud&#39;, enforce_login: false, }, }), }) let data = await unwrap(r, &#39;Failed to create ZOOM meeting&#39;) log(&#39;zoom: &#39;, data) ev.meetingId = data.id ev.zoomUrl = data.join_url // push livestream configuration data to meeting r = await fetch(`https://api.zoom.us/v2/meetings/${ev.meetingId}/livestream`, { method: &#39;PATCH&#39;, headers, body: JSON.stringify({ //TODO: make configurable stream_url: CFTV_RTMP_ENDPOINT, stream_key: ev.studio, page_url: &#39;https://cloudflare.tv&#39;, }), }) await unwrap(r, &#39;Failed to update LiveStream config&#39;) return ev}\n The other upside to using Contentful is that many members of our team already have familiarity with it, so it reduces the overhead of learning a new tool.\n  So far, we’ve described the different pieces of the backend (NGINX, Brave, Contentful) that make Cloudflare TV possible. How do we bring them all together? Cloudflare Workers serves as the glue that brings these systems together. The  Cloudflare TV frontend is built on Worker Sites. The frontend calls our Worker endpoints to fetch data, such as the programming calendar.\n  We’re just getting started with Cloudflare TV. We have a long wish list of features we’d really like to see. Here are some of the features we can’t wait to work on:\n  CloudflareTV  Live Streaming  Stream  Zoom RTMP  Life @ Cloudflare", "posttime": "2020-07-08 06:31:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "构建,cloudflare,rtmp", "title": "从头开始构建Cloudflare电视", "title_en": "Building Cloudflare TV from Scratch", "transed": 1, "url": "https://blog.cloudflare.com/building-cloudflare-tv-from-scratch/", "via": "", "real_tags": ["构建", "rtmp"]}, {"category": "", "categoryclass": "", "imagename": "ebf63d9ed9e1c27efbfd1c242f0284ef.jpg", "infoid": 1010441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "继去年12月波音(Boeing)“星际客机”(Starliner)宇宙飞船试飞失败后，美国国家航空航天局(NASA)周一公布了一项调查结果，调查对象是此次发射失败的根本原因以及导致失败的文化。\n在审查过程中，一个独立团队确定了80项建议，供NASA和波音公司在星际客机航天器再次发射之前处理。除了呼吁更好的监督和文档编制之外，这些建议还强调需要更多的硬件和软件集成测试。值得注意的是，审查小组呼吁在每次飞行之前使用最大数量的可用飞行硬件进行端到端测试。\n这一点意义重大，因为在12月的试飞之前，波音公司并没有运行涵盖从发射到对接到空间站的大约48小时的集成软件测试。取而代之的是，波音公司将测试分成了几个部分。第一块从发射到星际客机与阿特拉斯V号助推器第二级分离的地方。\n因此，在12月份的飞行中，航天器从其阿特拉斯V号运载火箭上捕获了错误的任务。它本应该在倒计时的最后阶段拾起这一次，但它却在正确时间的11个小时外抓取了数据。这导致了进入轨道的延迟推进，并导致飞行器的推进器消耗了太多的燃料。正因为如此，星际客机没有与国际空间站对接。\n第二个错误是在飞船通过大气层返回地球的前几个小时捕获并修复的，原因是软件映射错误，该错误将导致星际客机服务舱上的推进器以错误的方式点火。星际客机几乎迷路了。这两个错误的结合促使美国国家航空航天局(NASA)启动了它所称的高能见度险些调查。\n美国宇航局载人航天负责人凯西·卢德斯在新闻发布会上说，每一次任务都是一次学习经历。\n调查发现，波音的软件存在问题，美国国家航空航天局(NASA)对这一过程的监督也存在问题。Lueders承认，NASA将更多的精力集中在审查任务的高风险领域(例如当Starliner靠近空间站的时候)，NASA投资了超过1000亿美元来设计、开发和发射空间站，同时还投入了国际捐款。\n卢德斯说，这一直是个棘手的问题。她说，考虑到波音公司(Boeing)相当普遍的软件问题，你把资源用在哪里，以确保你得到最大的回报？因此，美国国家航空航天局(NASA)认识到，它需要对软件进行更多的监督。\n波音公司在4月份宣布，将自费为美国国家航空航天局(NASA)进行第二次星际客机测试任务。该公司拨出4.1亿美元用于支付太空舱、阿特拉斯V号火箭以及与第二次任务相关的费用。\nNASA官员表示，他们希望在2020年晚些时候执行这项任务，但这将取决于波音和NASA是否完成了对Starliner软件的数十次升级，对这一新软件的综合测试取得了成功，以及空间站能否在今年年底排得满满的情况下完成这项额外的任务。\n如果这次试飞成功，美国宇航局将允许波音公司进行涉及三名宇航员的试飞。这可能会在2021年的某个时候发生。", "note_en": "Following the failed test flight of Boeing&#39;s Starliner spacecraft in December, NASA on Monday  released the findings of an investigation into the root causes of the launch&#39;s failure and the culture that led to them.\n Over the course of its review, an independent team identified 80 &#34;recommendations&#34; for NASA and Boeing to address before the Starliner spacecraft launches again. In addition to calling for better oversight and documentation, these recommendations stress the need for greater hardware and software integration testing. Notably, the review team called for an end-to-end test prior to each flight using the maximum amount of flight hardware available.\n This is significant, because before the December test flight, Boeing did not run an integrated software test that encompassed the roughly 48-hour period from launch through docking to the station. Instead, Boeing broke the test into chunks. The first chunk ran from launch through the point at which Starliner separated from the second stage of the Atlas V booster.\n  As a result of this, on the December flight, the spacecraft captured the wrong &#34;mission elapsed time&#34; from its Atlas V launch vehicle. It was supposed to pick up this time during the terminal phase of the countdown, but it grabbed data 11 hours off of the correct time instead. This led to a delayed push to reach orbit and caused the vehicle&#39;s thrusters to expend too much fuel. Because of this, Starliner did not dock with the International Space Station.\n A second error, caught and fixed just a few hours before the vehicle returned to Earth through the atmosphere, was due to a software mapping error that would have caused thrusters on Starliner&#39;s service module to fire in the wrong manner. Starliner was very nearly lost. The combination of these two errors prompted  NASA to initiate what it termed a &#34;High Visibility Close Call&#34; investigation.\n &#34;Every mission is a learning experience,&#34; said NASA&#39;s chief of human spaceflight, Kathy Lueders, during the news conference.\n  The investigation found both problems with Boeing&#39;s software as well as NASA&#39;s oversight of the process. Lueders acknowledged that the agency had focused its efforts more on reviewing &#34;high risk&#34; areas of the mission (such as when Starliner was in the vicinity of the space station, which NASA invested more than $100 billion to design, develop, and launch, along with international contributions.\n &#34;This was always a tough problem,&#34; Lueders said. &#34;Where do you apply the resources to make sure you&#39;re getting the biggest bang for your buck?&#34; As a result, NASA learned that it needs to do more oversight on software, she said, given Boeing&#39;s &#34;pretty pervasive software issues.&#34;\n  Boeing announced in April that it will fly a second Starliner test mission for NASA, at its own expense. The company set aside $410 million to pay for the capsule, Atlas V rocket, and costs associated with a second mission.\n NASA officials said they hoped to fly this mission later in 2020, but this will depend on whether Boeing and NASA complete dozens of upgrades to Starliner&#39;s software, integrated tests of this new software are successful, and the space station can accommodate this additional mission with a crowded schedule toward the end of this year.\n If this test flight is successful, NASA will allow Boeing to proceed with a test flight involving three astronauts. This could occur some time in 2021.", "posttime": "2020-07-08 06:12:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "评论员,reviewers,nasa", "title": "独立评论员提出80条建议让星空客机更安全", "title_en": "Independent reviewers offer 80 suggestions to make Starliner safer", "transed": 1, "url": "https://arstechnica.com/science/2020/07/independent-reviewers-offer-80-suggestions-to-make-starliner-safer/", "via": "", "real_tags": ["评论员", "reviewers", "nasa"]}, {"category": "", "categoryclass": "", "imagename": "9807df1f7303a9643f130a429a824853.jpg", "infoid": 1010440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软负责业务发展的前副总裁佩吉·约翰逊(Peggy Johnson)能为Magic Leap扭转局面吗？这家增强/混合现实公司在4月份解雇了大部分员工，虽然它设法又筹集了3.75亿美元来维持运营，但那次融资意味着创始人兼首席执行官罗尼·阿博维茨(Rony Abovitz)的离职。\n约翰逊将于8月1日正式上任。她自2014年以来一直在微软工作，在那里她参与了以262亿美元收购LinkedIn。在此之前，她在高通工作了24年。\n“Magic Leap的技术基础是不可否认的，毫无疑问，它有可能塑造XR和计算的未来，”约翰逊在一份声明中说。\nAlphabet‘s Loon推出其气球驱动的肯尼亚互联网服务-Loon正在创造高空气球，旨在为山区地形导致难以安装地面基础设施的地区提供手机服务和互联网接入。\n优步食品杂货快递将于本月晚些时候在拉丁美洲和加拿大推出，美国也将紧随其后-优步将在19个城市开始食品杂货快递，并计划本月晚些时候在迈阿密和达拉斯推出。\nAmazon Prime Video最终向全球所有客户推出了用户配置文件-有了用户配置文件，Prime Video观众将能够管理自己的观看列表并跟踪自己的观看进度，而不会将其与同一账户上的其他观众混为一谈。\n行事隐秘的数据初创公司Palantir已经秘密提交了IPO申请-除了秘密提交了IPO申请外，Palantir(以与美国政府和情报界合作而闻名)没有提供任何有关其IPO的信息。\nTikTok在美国面临禁令；撤出香港-国务卿迈克·庞皮欧(Mike Pompeo)告诉福克斯新闻(Fox News)，美国政府“肯定在考虑”禁止这款广受欢迎的视频应用。\nFacebook支持的Unacademy以5000万美元收购PrepLader-Unacademy是印度领先的教育技术公司之一，而PrepLader表示拥有超过8万订户。\n8个黑人投资者讨论种族、技术和资金的交集-我们调查了8个黑人风投，了解他们的投资战略和多元化的方式。\n电子邮件坏了，嘿的杰森·弗莱德来修复它--对这款广受欢迎的新电子邮件应用程序的创建者进行了深入采访。\n(提醒：Extra Crunch是我们的订阅会员计划，旨在使初创企业的信息大众化。您可以在这里注册。)。\n克里·华盛顿即将颠覆2020年--这位“丑闻”明星还投资了“翼”、“社区”和“字节”。她要来捣乱了！\n亲爱的索菲：新的在线课程规则对F-1学生意味着什么？-在新冠肺炎疫情爆发期间，国际学生在参加在线课程期间被允许留在美国，但ICE表示，这一规定将于今年秋天结束。移民律师索菲·奥尔科恩讨论了这对一家初创公司意味着什么，该初创公司的联合创始人是一名持有F-1签证的学生。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Can Peggy Johnson, the former vice president of business development at Microsoft, turn things around for Magic Leap? The augmented/mixed reality company laid off most of its staff in April, and while it managed to raise another $375 million to keep going, that fundraise meant the departure of founder and CEO Rony Abovitz.\n  Johnson will  officially take over on August 1. She’s been at Microsoft since 2014, where she was involved in the $26.2 billion acquisition of LinkedIn. Before that, she spent 24 years at Qualcomm.\n “Magic Leap’s technological foundation is undeniable, and there is no question that has the potential to shape the future of XR and computing,” Johnson said in a statement.\n  Alphabet’s Loon launches its balloon-powered Kenyan internet service — Loon is creating high-altitude balloons that are supposed to provide cell service and internet access in areas where mountainous terrain makes it difficult to install ground infrastructure.\n Uber grocery delivery launches in Latin America and Canada, US to follow later this month — Uber is starting grocery delivery in 19 cities, with plans to launch in Miami and Dallas later this month.\n Amazon Prime Video finally launches user profiles to all customers worldwide — With user profiles, Prime Video viewers will be able to manage their own watchlists and track their own viewing progress, without getting it all mixed up with other viewers on the same account.\n  Secretive data startup Palantir has confidentially filed for an IPO — Aside from the fact that it has filed confidentially, Palantir (which is known for its work with the U.S. government and intelligence community) did not provide any information about its offering.\n TikTok faces ban in the US; pulls out of Hong Kong — Secretary of State Mike Pompeo told Fox News that the U.S. government is “certainly looking” at banning the popular video app.\n Facebook-backed Unacademy acquires PrepLadder for $50 million — Unacademy is one of the leading edtech companies in India, while PrepLadder says it has more than 80,000 subscribers.\n  8 Black investors discuss the intersection of race, tech and funding — We surveyed eight Black VCs about their investment strategy and their approach to diversity.\n Email is broken and Hey’s Jason Fried is here to fix it — An in-depth interview with the creator of the popular new email app.\n (Reminder: Extra Crunch is our subscription membership program, designed to democratize information about startups.  You can sign up here.)\n  Kerry Washington is coming to Disrupt 2020 — The “Scandal” star has also invested in The Wing, Community and Byte. And she’s coming to Disrupt!\n Dear Sophie: What does the new online classes rule mean for F-1 students? — International students have been allowed to remain in the U.S. while taking online courses during the COVID-19 pandemic, but ICE says that will end this fall. Immigration lawyer Sophie Alcorn discusses what this means for a startup whose co-founder is a student with an F-1 visa.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-07-08 06:11:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch", "title": "\nDaily Crunch：Magic Leap有了新的首席执行官", "title_en": "\n\t\t\t\tDaily Crunch: Magic Leap gets a new CEO\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/07/daily-crunch-magic-leap-gets-a-new-ceo/", "via": "", "real_tags": ["crunch"]}, {"category": "", "categoryclass": "", "imagename": "548c2fd637eaefa8ff67251f781c0db7.jpeg", "infoid": 1010438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“没有空地这回事。”我和宝贝儿昨天才知道，偷偷穿过这片野性的工业园。我们今天在这一领域做得更深入，所以本周的报告将是简短的。\n星期一晚上刮起了雷雨，给我们带来了急需的降雨。当暴风雨周二开始消散时，35号州际公路走廊上空的天气雷达上开始出现一种不同类型的奇怪云层。美国国家气象局奥斯汀/圣安东尼奥办事处开始收集似乎是白蚁或蚱蜢的目击者报告。我的朋友罗布(Rob)在他的Feed上分享了NWS页面上的这段Fortean摘要：\n我重新分享了它，我的朋友埃里克(Eric)是一名专业生态学家，负责东奥斯汀的一个大型棕地修复项目(我也在其中工作)，他认为更有可能的解释是火蚁的婚礼飞行，这种情况发生在一年中的这个时候，特别是在晴朗的早晨发生了一场大型降雨活动之后。埃里克的大部分工作时间都是在这片土地上度过的。\n埃里克说：“雷达探测到了它，非常酷，也很令人担忧。”“我已经感觉到灼伤了。”\n是的，火蚁会飞。这就是它们繁殖和传播的方式。这是一只火蚁女王准备起飞的婚礼飞行，这是由国家科学基金会关于这种蚂蚁能够进行快速基因变化的报告提供的：\n“交配过一次，而且只有一次，在飞行中，雌鸟会飞起来，折断翅膀，挖土，开始产卵，建立一个新的群体。”作家史蒂文·奥斯塔德(Steven Austad)在这篇名为“赞美火蚁”的优秀作品中如是解释，这篇文章还指出，通过空中喷洒除草剂来根除火蚁的努力，是蕾切尔·卡森(Rachel Carson)在她的标志性作品“明天的寓言”“寂静的春天”(Silent Spring)中描述的鸟类大屠杀的主要原因。任何在院子里对付过火蚁的人都不会感到惊讶，在这场“地毯式轰炸”中，火蚁的射程增加了50%。\n奥斯塔德还准确地指出，火蚁可以让你摇摆。这是罕见的，我能够除草我的院子里没有做一次火蚁摇摆舞，这是我的家人的娱乐。(对于男性来说，来之不易的专业提示：在遇到火蚁后，在户外大小便之前，一定要确保你已经把手中的火蚁都拿掉了。)。\n如此巨大的生物涌现出现在天气雷达上总是令人敬畏的，知道有些物种仍然可以在城市化的环境中蓬勃发展，足以像这样表达，这让人感到欣慰。我在西德克萨斯看到过圣经中成群的狼蛛，路上的狼蛛太多了，你不能不从它们身上碾过，但至少它们不会飞。瓢虫可以：\n蝙蝠也可以。在我们附近的Bracken Cave，就在圣安东尼奥以北的I-35号公路(靠近New Braunfels)附近，我们幸运地拥有世界上最大的蝙蝠聚居地，是1500万墨西哥自由尾巴蝙蝠(与生活在奥斯汀国会大道桥下的同一物种)的家园-地球上最大的哺乳动物聚集地之一。蝙蝠保护国际组织(BAT Protection International)于1992年购买了这块土地，并一直在尽可能收购邻近的地块，并在奥斯汀-圣安东尼奥(Austin-San Antonio)的生长蔓延试图排挤蝙蝠之际，与该地点周围不兼容的开发作斗争。\n我已经和我的儿子去那里看过两次了，真的很令人惊讶。这个洞穴就像一个从灌木丛生的山野景观中升起的岩石泡泡，当你绕着东侧走去的时候，大地上有一个开口。随着太阳开始落下，蝙蝠开始剥离墙壁，在接下来的一两个小时里，你可以站在那里，看着蜂群充斥着你头部周围的空气，飞快地躲避。当你回到你的车里，你闻起来像鸟粪，而且你不介意。特别是因为你知道这个蜂群是如此之大，以至于圣安东尼奥空军基地的军用喷气式飞机不得不绕着它飞行。\n布雷肯洞穴在大流行期间暂时对游客关闭，但蝙蝠保护国际网站定期更新，并挤满了关于洞穴和城市蝙蝠的一般信息。\n昨天晚上，我们在一个卡车停靠站后面的一片沼泽树上发现了大量集中的燕麦巢，就在南得克萨斯州特斯拉充电站旁边，宝贝和我走到了海滩上。从奥斯汀一路走来，撒哈拉尘埃云是显而易见的，当太阳落下时，隔离岛上，德克萨斯州海滩上，你可以把车开到水线上，它看起来就像70年代的科幻电影中关于我们现在生活的臭氧未来的哑光天空。但是海湾吹起了微风，鹈鹕们在下午的暖流中漂浮着，看起来相当满意。当我们走回来的时候，我们看到一些海鸥在公寓后面为了一块食物垃圾而打架。\n下周回来的是一份报告，关于撒哈拉尘埃云的日出是否像预测的那样壮观，以及你可以在以油田服务公司命名的咸水湾找到什么样的野生动物。\n与此同时，本周早些时候，当火神的追随者们在黑暗中练习他们的普罗米修斯艺术时，这里有一段粉色天空的小环境视频。(有声音会更好。)", "note_en": "“There is no such thing as an empty lot.” So baby and I learned yesterday, sneaking through this feral patch of industrial park. We are deeper in the field today, so this week’s report will be brief.\n Thunderstorms blew in on Monday night, bringing us much-needed rain. When the storms began to clear Tuesday, strange clouds of a different sort started to appear on the weather radar, over the Interstate 35 corridor. The Austin/San Antonio office of the National Weather Service began to collect eyewitness reports of what appeared to be termites or grasshoppers. My friend Rob shared this Fortean outtake from the NWS page on his feed:\n   I re-shared it, and my friend  Eric, a professional ecologist who is in charge of a  major brownfield restoration project  in East Austin (one I also work on) and spends most of his working life in the field, suggested the more likely explanation was a nuptial flight of fire ants, which occur this time of year, especially after a big morning rain event with clearing skies.\n “Pretty cool and worrisome it was picked up on radar,” said Eric. “I feel the burn already.”\n Yes, fire ants can fly. It’s how they reproduce, and spread. Here’s a fire ant queen preparing to take off on her nuptial flight, courtesy of the  National Science Foundation’s report on the rapid genetic changes of which such ants are capable:\n   “Having mated once, and only once, while in flight, the females will alight, break off their wings, dig into the soil, and start laying eggs to found a new colony.” So explains writer Steven Austad in this excellent piece “ In Praise of Fire Ants,” which also notes how the effort to eradicate fire ants through aerial spraying of herbicide was the principal cause of the avian holocaust described by Rachel Carson in her landmark “fable for tomorrow”   Silent Spring. The fire ants, as anyone who has dealt with them in their yard will be unsurprised to hear, managed to increase their range by 50% during this “carpet bombing campaign.”\n Austad also accurately notes that fire ants can make you boogie. It is rare that I am able to weed my yard without doing the fire ant boogie at least once, to the entertainment of my family. (Hard-earned pro tip for guys: always make sure you have gotten all the fire ants off your hands before you relieve yourself outdoors following a fire ant encounter.)\n Biological emergences so massive they show up on the weather radar are always awesome, and it’s reassuring to know there are species that can still flourish in the urbanized environment enough to express like that. I have seen Biblical swarms of tarantulas in West Texas, so many on the roads that you can’t avoid running them over, but at least they can’t fly. Lady bugs can:\n    And so can bats. Near us at  Bracken Cave, just off I-35 north of San Antonio (close to New Braunfels), we are lucky to have the world’s largest bat colony, home to 15 million Mexican free-tailed bats (the same species that lives under Austin’s Congress Avenue Bridge)—one of the largest concentration of mammals on Earth. Bat Conservation International bought the land in 1992, and has been acquiring neighboring parcels as it can, and fighting incompatible development around the site as the Austin-San Antonio growth sprawl tries to crowd the bats out.\n    I’ve been down there to watch the emergence twice with my son, and it’s really astonishing. The cave is like a bubble of rock rising up out of the scrubby Hill Country landscape, and when you walk up around the eastern side there is an opening in the earth. As the sun begins to duck down, the bats start to peel of the walls, and for the next hour or two you can stand there as the swarm fills the air around your head, darting and dodging. When you get back in your car you smell like guano, and you don’t mind. Especially because you know the swarm is so big that the military jets from San Antonio’s Air Force bases have to fly around it.\n    Bracken Cave is temporarily closed to visitors during the pandemic, but  the Bat Conservation International website has regular updates, and is packed with information about the cave and urban bats generally.\n    Yesterday evening, not long after we found a massive concentration of grackle nests in a patch of mesquite trees behind a truck stop, right next to a South Texas Tesla charging station, baby and I walked down to the beach. The Saharan dust cloud was evident all the way from Austin, and as the sun went down over the barrier island, above the Texas beach where you can drive your vehicle right up to the waterline, it looked like the matte-painted sky from some 70s sci-fi movie about the ozone future we now live in. But the breeze was up off the Gulf, and the pelicans looked pretty content as they drifted the afternoon thermals. As we walked back, we saw some gulls fighting over a piece of food trash behind a condo.\n Back next week with a report on whether the Saharan dust cloud sunrises are as epic as predicted, and on what kind of wildlife you can find in saltwater inlets named after oilfield service companies.\n In the meantime, here’s a little ambient video of the pink sky coming up earlier this week, as the acolytes of Vulcan practice their Promethean art in the dark. (Better with sound.)", "posttime": "2020-07-08 06:10:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火蚁,fire", "title": "火蚁的飞翔", "title_en": "Flight of the Fire Ants", "transed": 1, "url": "https://edgelands.substack.com/p/flight-of-the-fire-ants", "via": "", "real_tags": ["火蚁", "fire"]}, {"category": "", "categoryclass": "", "imagename": "8d23627989c02f0535fbfa96c6ccd0f2.png", "infoid": 1010437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我们的框架在几个月前发布以来，许多用户问我们为什么选择CSS变量，而不是sass变量，尽管我们在框架中使用了sass。在本文中，我将介绍使用自定义属性的优点，以及为什么它们在我们的工作流程中变得至关重要。\n在本文中，我假设您熟悉CSS自定义属性和sass(或任何其他CSS预处理器)的基础知识。如果你不是，让我们从一个基本的例子开始：\n原生的自定义属性允许您定义变量，而不需要CSS扩展(即SASS)。\n它们是一样的吗？不怎么有意思!。与sass变量不同，自定义属性1)的作用域是声明它们的元素，2)级联，3)可以在JavaScript中操作。这三个特点开启了一个全新的可能性世界。让我给你看一些实际的例子！\n以下是如何使用sass变量创建两个(简化)颜色主题的示例：\n$COLOR-PRIMARY：蓝色；$COLOR-TEXT：黑色；$COLOR-BG：白色；/*INVERT*/$COLOR-PRIMARY-INVERT：红色；$COLOR-TEXT-INVERT：白色；$COLOR-BG-INVERT：黑色；.component{COLOR：$COLOR-TEXY；}}.component--暗{COLOR：$COLOR-TEXT-INVERT；BACKGROUND：$COLOR-BG-INVERT；a。\n在上面的示例中，我们有一个默认主题和一个深色主题，在该主题中我们反转了背景和文本的颜色。请注意，在黑暗主题中，我们需要检查使用颜色变量的每个属性，并使用新变量更新它们。\n只要我们坚持使用简化的(不现实的)示例，就不会出现问题。如果我们有一个包含大量元素的组件呢？我们将再次被迫重写使用颜色变量的所有属性，并替换变量。如果你改变了主成分，你必须仔细检查所有的修改器。所以是的.不是很方便！\n在构建我们的框架时，我们提出了一种基于CSS变量的不同方法。首先，让我们定义颜色变量：\n：root，[Data-Theme=&#34；默认&#34；]{--color-primary：蓝色；/*颜色对比度*/-color-bg：白色；--color-对比度-LOWER：HSL(0，0%，95%)；--COLOR-对比度-LOW：HSL(240，1%，83%)；--COLOR-对比度中等：HSL(240，1%，48%)；--COLOR-对比度高：HSL(240，4%，20。--COLOR-对比度-高：黑色；}[数据-主题]{背景色：vAR(--COLOR-BG)；COLOR：vAR(--COLOR-对比度-高)；}[数据-主题=&#34；暗&#34；]{--COLOR-PRIMARY：红色；/*COLOR对比度*/-COLOR-BG：黑色；--COLOR-COLRATION-LOWER：HSL(240，6%，15%)；--颜色对比度低：HSL(252%，4%，25%)；--颜色对比度介质：HSL(240，1%，57%)；--颜色对比度高：HSL(0，0%，89%)；--颜色对比度高：白色；}。\n仅供参考：在上面的示例中，我们使用data-*属性来应用颜色主题，但这与CSS变量和sass变量无关。此外，我们使用基于对比度级别的命名法定义了中性值的标度。\n重要的一点是，我们不需要为第二个(暗)主题创建新的颜色变量。与sass不同，我们可以覆盖现有自定义属性的值。\n.component{color：var(--color-对比度-Higher)；背景色：var(--color-bg)；边框-下：1px实心var(--color-对比度-低)；a{color：var(--color-primary)；}}。\n那部件的暗色变化呢？我们不需要额外的CSS。因为我们要覆盖而不是替换变量，所以我们只需要在第一次创建组件时应用正确的颜色变量。不管组件变得多么复杂，一旦您在_color s.scss文件中设置了颜色主题，并将颜色变量应用于组件的元素，您就可以用一种非常简单的方式应用颜色主题：\n在上面的示例中，我们已将暗主题应用于部分，并将默认颜色主题应用于.Child元素。没错，你可以嵌套颜色主题！\n这项技术通过使用CSS自定义属性而成为可能，它使您可以立即完成像这样很酷的事情。👇\n如果您想了解有关如何使用CodyHouse框架管理颜色的更多信息，以下是一些链接：\n文字(或模块化)比例是应用于排版元素的一组和谐(大小)值。以下是如何使用sass变量在SCSS中设置文字比例：\n标准方法是使用第三方工具(或计算)创建文字比例，然后将值导入到您的样式中，如上例所示。\n在构建我们的框架时，我们决定将整个比例公式合并到自定义样式/_typography.scss文件中。下面是我们如何使用CSS变量设置文字比例：\n：root{//正文字体大小--text-base-size：1em；//type scale--text-scale-rate：1.2；--text-xs：calc((1em/var(--text-scale-rate)/var(--text-scale-rate))；--text-sm：calc(var(--text-xs)*var(--text-scale-rate))；--text-md：calc(var(--text-sm)*var(--text-scale-rate)*var(--text-scale-rate))；--text-lg：calc(var(--text-md)*var(--text-scale-rate))；--text-xl：calc(var(--text-lg)*var(--text-scale-rate))；--text-XXL：Calc(var(--text-xl)*var(--text-scale-rate))；--text-XXXL：calc(var(--text-xxl)*var(--text-scale-rate))；}。\n这种方法的好处是什么？它使您可以通过只编辑两个变量来控制整个排版系统：--text-base-size(正文字体大小)和--text-scale-rate(比例乘数)。\n可以，但是您不能使用sass变量做同样的事情吗？否，如果要修改特定断点处的排版：\n上面的代码片段是我们响应方法的基石。因为我们使用EMS相对单位，所以当修改--text-base-size(正文字体大小)时，字体和间距都会受到影响。您最终得到的系统可以调整所有组件的大小，几乎不需要在组件级别设置媒体查询。\n间距比例等同于文字比例，但适用于间隔值。再一次，将比例公式包含到框架中使我们能够控制间距系统并使其具有响应性：\n：root{--space-unit：1em；--space-xxxs：calc(0.125*var(--space-unit))；--space-xxs：calc(0.25*var(--space-unit))；--space-xxs：calc(0.375*var(--space-unit))；--space-xs：calc(0.375*var(--space-unit))；--space-sm：calc(0.75*。--space-md：calc(1.25*var(--space-unit))；--space-lg：calc(2*var(--space-unit))；--space-xl：calc(3.25*var(--space-unit))；--space-XXL：calc(5.25*var(--space-unit))；--space-XXXL：calc(8.5*var(--space-unit))；--space-XXXXL：Calc(13.75*var(--space-unit))；}@Supports(--css：Variables){：root{@include断点(Md){--space-unit：1.25em；}。\n当与上一章中讨论的排版方法结合使用时，这种方法会变得特别强大。只需几行CSS，您就可以得到响应组件：\n我喜欢将EMS单位与此间距系统一起使用的一点是，如果间距和字体大小在特定断点处显示正确，那么几乎可以肯定它们在所有断点处都显示正确，而不管您更新--space-unit值的事实如何。由此推论，我可以在几乎不需要调整浏览器窗口大小的情况下进行设计(除非我想要更改组件的行为)；而且当我确实要调整窗口大小时，间距和版式也可以很好地调整。\n与sass变量不同，我们可以覆盖CSS变量的值。利用此功能的一种方法是将自定义属性注入到其他自定义属性中，从而创建可在组件级别上编辑的控件。\n下面是一个示例：当您设置文本组件的垂直间距时，您可能希望为元素指定行高和页边距：\n.文章{h1，h2，h3，h4{行高：1.2；页边距-底部：$SPACE-Xs；}ul，ol，p，块引用{行高：1.5；页边距-底部：$SPACE-Md；}}。\n但是，此间距根据文本使用位置的不同而不同。例如，如果希望文本更加紧凑，则需要创建组件变体，在其中应用不同的间隔值：\n.文章--sm{h1，h2，h3，h4{line-Height：1.1；March-Bottom：$SPACE-XXXS；}ul，ol，p，BLOCK QUOQUE{LINE-HEIGHT：1.4；LENGE-BOOT：$SPACE-sm；}}。\n.text-component{--component-body-line-high：Calc(var(--body-line-high)*var(--line-high-multiier，1))；--component-heading-line-high：Calc(var(--heading-line-high)*var(--line-high-multiier，1))；--line-high-multiier：1；--text-vspace-multiier：1；h1，h2，h3，h4{。空边距-底部：Calc(var(--space-XXXS)*var(--text-vSpace-Multiier))；}h2，h3，h4{空边-顶部：Calc(var(--space-sm)*var(--text-vSpace-Multiier))；}p，块报价，ul li，ol li{line-high：var(--component-body-line-high)；}ul，ol，p，块引用，.text-component__block，.text-component__img{空格-底部：calc(var(--space-sm)*var(--text-vspace-multiier))；}}。\n行高度乘数和--text-vspace-multiier是文本组件的两个作用域控件。当我们创建.text-component类的修饰符时，要编辑垂直间距，我们只需要覆盖这两个变量：\n.protle.text-component{//如博客帖子--line-高度-乘数：1.13；//增加文章行高--text-vspace-乘数：1.2；//增加垂直间距}。\n可以通过多种方式使用覆盖组件值的可能性。通常，只要您可以将组件的行为抽象为一个或多个变量，当该组件需要编辑时(或者您必须创建该组件的变体)，您的工作就会变得更轻松。\n我们的Auto Size Grid组件就是一个例子，在该组件中，我们使用CSS网格创建布局，其中库项目根据CSS中设置的最小宽度自动填充可用空间，然后我们提取项目的最小宽度值，并将其存储在变量中。\n设置图库项目的最小宽度，让我们的gridAuto Mixin为您完成繁重的工作https://t.co/IPkjDHGCSD😉pic.twitter.com/yfFijBffEv。\n-CodyHouse(@CodyWebHouse)2019年3月7日\n在创建自动调整网格大小组件的变体时，该最小宽度值是唯一需要修改的内容。\n简而言之：浏览器支持。不过，等一下！您可以在PostCSS插件的帮助下以本文描述的所有方式使用CSS自定义属性。您可以做的事情有一些限制，一些更改(例如，编辑垂直节奏)仅适用于现代浏览器。在这些特定情况下，只要不破坏旧浏览器的体验，您就可以自由使用CSS变量。有关当前使用CSS变量的限制的更多信息，请查看我们的文档。\n是!。只要Sass(或任何其他预处理器)允许您做在CSS中做不到的事情，而且您需要这些东西，为什么不使用它呢？Sass不是用户在访问您的网站时必须下载的库。它是您工作流程中的一个工具。例如，我们使用sass来定义使用CSS变量的颜色函数。\n在本文中，我们已经通过了几个示例来演示使用CSS自定义属性比使用sass变量的优势是什么。我们将重点放在它们如何使您能够创建控件，以加快您修改组件或设置影响排版和间距的规则的速度。我们已经涉及了很多领域，我希望你能从这篇文章中学到一些东西，并把它融入到你的工作中。😊。\n你想分享一下你是如何使用CSS变量的，还是对这篇文章有反馈意见？在推特上联系吧！", "note_en": "Since the release of our framework a few months ago, we&#39;ve been asked by many users why we opted for CSS variables, instead of SASS variables, even though we do use SASS in the framework. In this article, I&#39;ll go through the advantages of using custom properties and why they&#39;ve become crucial in our workflow.\n     In this article I&#39;m assuming you&#39;re familiar with the basics of both CSS custom properties and SASS (or any other CSS preprocessor). If you&#39;re not, let&#39;s start from a basic example:\n     Native, custom properties allow you to define variables without the need for CSS extensions (i.e., SASS).\n Are they the same? Not really! Unlike SASS variables, custom properties 1) are scoped to the element they are declared on, 2) cascade and 3) can be manipulated in JavaScript. These three features open a whole new world of possibilities. Let me show you some practical examples!\n  Here&#39;s an example of how you would create two (simplified) color themes using SASS variables:\n $color-primary: blue;\r$color-text: black;\r$color-bg: white;\r/* invert */\r$color-primary-invert: red;\r$color-text-invert: white;\r$color-bg-invert: black;\r\r.component {\r color: $color-text;\r background-color: $color-bg;\r\r a {\r color: $color-primary;\r }\r}\r\r.component--dark {\r color: $color-text-invert;\r background-color: $color-bg-invert;\r\r a {\r color: $color-primary-invert;\r }\r}\n In the example above, we have a &#39;default&#39; theme, and a &#39;dark&#39; theme where we invert the colors of background and text.  Note that in the dark theme we need to go through each property where the color variables were used, and update them with a new variable.\n As long as we stick to simplified (non-realistic) examples, no issue arises. What if we have a component with plenty of elements? Once again, we would be forced to rewrite all the properties where the color variables are used and replace the variables. And if you change the main component, you have to double check all the modifiers. So yeah...not so handy!\n While building our framework, we came up with a different approach based on CSS variables. First of all, let&#39;s define the color variables:\n :root, [data-theme=&#34;default&#34;] {\r --color-primary: blue;\r /* color contrasts */\r --color-bg: white;\r --color-contrast-lower: hsl(0, 0%, 95%);\r --color-contrast-low: hsl(240, 1%, 83%);\r --color-contrast-medium: hsl(240, 1%, 48%);\r --color-contrast-high: hsl(240, 4%, 20%);\r --color-contrast-higher: black;\r}\r\r[data-theme] {\r background-color: var(--color-bg);\r color: var(--color-contrast-high);\r}\r\r[data-theme=&#34;dark&#34;] {\r --color-primary: red;\r /* color contrasts */\r --color-bg: black;\r --color-contrast-lower: hsl(240, 6%, 15%);\r --color-contrast-low: hsl(252, 4%, 25%);\r --color-contrast-medium: hsl(240, 1%, 57%);\r --color-contrast-high: hsl(0, 0%, 89%);\r --color-contrast-higher: white;\r}\n FYI: in the example above we use data-* attributes to apply a color theme, but this has nothing to do with CSS variables vs. SASS variables. Also, we defined a scale of neutral values using a nomenclature based on the &#39;contrast level&#39;.\n The important point is that we don&#39;t need to create new color variables for our second (dark) theme. Unlike SASS, we can override the value of existing custom properties.\n  .component {\r color: var(--color-contrast-higher);\r background-color: var(--color-bg);\r border-bottom: 1px solid var(--color-contrast-low);\r\r a {\r color: var(--color-primary);\r }\r}\n What about the dark variation of the component?  We don&#39;t need additional CSS. Because we&#39;re overriding and not replacing variables, we only need to apply the correct color variables when we create the component for the first time. It doesn&#39;t matter how complicated the component becomes, once you&#39;ve set the color themes in your _colors.scss file, and applied the color variables to the elements of your components, you can apply color themes in a very simple way:\n  In the example above, we&#39;ve applied the &#39;dark&#39; color theme to the section, and the &#39;default&#39; color theme to the  .child element. That&#39;s right,  you can nest color themes!\n This technique, made possible by the use of CSS custom properties, allows you to do in no time cool stuff like this. 👇\n  Here are some links in case you want to learn more about how to manage colors using the CodyHouse framework:\n   A type (or modular) scale is a set of harmonious (size) values that are applied to typography elements. Here&#39;s how you can set a type scale in SCSS using SASS variables:\n  A standard approach would be creating the type scale using a third-party tool (or doing the math), then importing the values into your style like in the example above.\n While building our framework,  we decided to incorporate the whole scale formula into the custom-style/_typography.scss file. Here&#39;s how we set the type scale using CSS variables:\n :root {\r // body font size\r --text-base-size: 1em;\r \r // type scale\r --text-scale-ratio: 1.2;\r --text-xs: calc((1em / var(--text-scale-ratio)) / var(--text-scale-ratio));\r --text-sm: calc(var(--text-xs) * var(--text-scale-ratio));\r --text-md: calc(var(--text-sm) * var(--text-scale-ratio) * var(--text-scale-ratio));\r --text-lg: calc(var(--text-md) * var(--text-scale-ratio));\r --text-xl: calc(var(--text-lg) * var(--text-scale-ratio));\r --text-xxl: calc(var(--text-xl) * var(--text-scale-ratio));\r --text-xxxl: calc(var(--text-xxl) * var(--text-scale-ratio));\r}\n What&#39;s the advantage of such an approach?  It gives you the possibility to control the whole typography system by editing only two variables: the  --text-base-size (body font size) and the  --text-scale-ratio (the scale multiplier).\n &#39;Yes, but can&#39;t you do the same using SASS variables&#39;? No, if you want to modify your typography at specific breakpoints:\n  The snippet above is the cornerstone of our responsive approach. Because we use Ems relative units, when the  --text-base-size (body font size) is modified, both typography and spacing are affected. You end up with a system that resizes all your components with almost no need to set media queries on a component level.\n     The spacing scale is the equivalent of the type scale but applied to space values. Once again, including the scale formula into the framework allowed us to control the spacing system and make it responsive:\n :root {\r --space-unit: 1em;\r --space-xxxxs: calc(0.125 * var(--space-unit)); \r --space-xxxs: calc(0.25 * var(--space-unit));\r --space-xxs: calc(0.375 * var(--space-unit));\r --space-xs: calc(0.5 * var(--space-unit));\r --space-sm: calc(0.75 * var(--space-unit));\r --space-md: calc(1.25 * var(--space-unit));\r --space-lg: calc(2 * var(--space-unit));\r --space-xl: calc(3.25 * var(--space-unit));\r --space-xxl: calc(5.25 * var(--space-unit));\r --space-xxxl: calc(8.5 * var(--space-unit));\r --space-xxxxl: calc(13.75 * var(--space-unit));\r}\r\r@supports(--css: variables) {\r :root {\r @include breakpoint(md) {\r --space-unit: 1.25em;\r }\r }\r}\n This approach becomes particularly powerful when combined with the typography method discussed in the previous chapter. With just a few lines of CSS, you end up with responsive components:\n  One thing I love about using Ems units along with this spacing system is that if spacing and typography sizes look right at a specific breakpoint, they almost certainly look right at all breakpoints, regardless the fact that you update the  --space-unit value. A corollary to that is I can design with nearly no need to resize the browser window (except when I want to change the behavior of a component); and when I do resize the window, spacing and typography adapt gracefully.\n    Unlike SASS variables, we can override the value of CSS variables.  One way to take advantage of this feature is injecting custom properties into other custom properties, thus creating &#39;controls&#39; that can be edited on a component level.\n Here&#39;s an example: when you set the vertical spacing of a text component, you probably want to specify line-height and margin-bottom for your elements:\n .article {\r h1, h2, h3, h4 {\r line-height: 1.2;\r margin-bottom: $space-xs;\r }\r\r ul, ol, p, blockquote {\r line-height: 1.5;\r margin-bottom: $space-md;\r }\r}\n This spacing, however, varies according to where this text is used. For example, if you want your text to be more condensed, you need to create a component variation where you apply different spacing values:\n .article--sm {\r h1, h2, h3, h4 {\r line-height: 1.1;\r margin-bottom: $space-xxxs;\r }\r\r ul, ol, p, blockquote {\r line-height: 1.4;\r margin-bottom: $space-sm;\r }\r}\n   .text-component {\r --component-body-line-height: calc(var(--body-line-height) * var(--line-height-multiplier, 1));\r --component-heading-line-height: calc(var(--heading-line-height) * var(--line-height-multiplier, 1));\r --line-height-multiplier: 1;\r --text-vspace-multiplier: 1;\r\r h1, h2, h3, h4 {\r line-height: var(--component-heading-line-height);\r margin-bottom: calc(var(--space-xxxs) * var(--text-vspace-multiplier));\r }\r\r h2, h3, h4 {\r margin-top: calc(var(--space-sm) * var(--text-vspace-multiplier));\r }\r\r p, blockquote, ul li, ol li {\r line-height: var(--component-body-line-height);\r }\r \r ul, ol, p, blockquote, .text-component__block, .text-component__img {\r margin-bottom: calc(var(--space-sm) * var(--text-vspace-multiplier));\r }\r}\n The --line-height-multiplier and --text-vspace-multiplier are the two scoped controls of the text-component. When we create a modifier of the  .text-component class, to edit vertical spacing we only need to override those two variables:\n .article.text-component { // e.g., blog posts\r --line-height-multiplier: 1.13; // increase article line-height\r --text-vspace-multiplier: 1.2; // increase vertical spacing\r}\n    The possibility to override the value of a component can be used in many ways. In general, anytime you can abstract the behavior of a component in one or more variables, you&#39;re making your life easier when that component needs editing (or you have to create a variation of the component).\n An example is our  Auto Sized Grid component, where we use CSS grid to create a layout where the gallery items auto-fill the available space based on a min-width set in CSS, then we abstract the min-width value of the items, storing it in a variable.\n Set the min-width of the gallery item, and let our gridAuto mixin do the heavy lifting for you 😉 https://t.co/IPkjDHGCSD  pic.twitter.com/yfFijBffEv\n— CodyHouse (@CodyWebHouse)  7 March 2019\n That min-width value is the only thing you need to modify when you create a variation of the Auto Sized Grid component.\n  In two words: browser support. Hold on, though! You can use CSS custom properties in all the ways described in this article with the help of a  PostCSS plugin. There are some limitations in the things you can do, and some changes (e.g., editing vertical rhythm) only apply to modern browsers. In these specific cases, you&#39;re free to use CSS variables as long as you&#39;re not disrupting the experience in older browsers.  Check out our documentation for more info about the limitations of using CSS Variables today.\n  Yes! As long as SASS (or any other preprocessor) allows you to do stuff you can&#39;t do in CSS, and you need that stuff, why not using it? SASS is not a library users have to download when they access your website. It&#39;s a tool in your workflow. We use SASS, for example, to define  color functions that work with CSS variables.\n  In this article, we&#39;ve gone through a few examples that demonstrate what&#39;s the advantage of using CSS custom properties over SASS variables. We&#39;ve focused on how they enable you to create &#39;controls&#39; that speed up the way you modify components, or set rules that affect typography and spacing. We&#39;ve covered a lot of ground, and I hope you can take something from this post and include it in your work. 😊\n Would you like to share how you&#39;re using CSS variables, or do you have feedback on the article?  Get in touch on Twitter!", "posttime": "2020-07-08 06:09:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "css", "title": "为什么我们更喜欢CSS自定义属性而不是SASS变量", "title_en": "Why We Prefer CSS Custom Properties to SASS Variables", "transed": 1, "url": "https://codyhouse.co/blog/post/css-custom-properties-vs-sass-variables", "via": "", "real_tags": ["css"]}, {"category": "", "categoryclass": "", "imagename": "579b221dfb10afd4e8935aa4a6b6c9b8.png", "infoid": 1010436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "钻探公司的目标是建设必要的隧道基础设施，以实现快速、安全和舒适的运输，包括Loop和Hyperloop。要想可行地建设大型隧道网络，必须首先迅速创新，提高隧道速度，降低隧道成本。\n这场比赛挑战团队拿出隧道解决方案，并回答问题，“你能打败蜗牛吗？”“钻孔公司”正在测算每个人(学生、公司、业余爱好者等)的兴趣。在2021年春季举行的首届非钻孔大赛中，来自世界各地的人员在钻孔公司的掘进工厂设计、建造和比赛他们自己的隧道施工解决方案。\n参赛队伍将角逐一条横截面积为0.2平方米(相当于0.5米直径的圆圈)的30米长隧道。获奖类别包括：\n最快完成隧道和行驶表面(我们将驾驶一辆特斯拉遥控汽车通过隧道)", "note_en": "The Boring Company’s goal is to build the tunnel infrastructure necessary to enable fast, safe, and comfortable transportation, including Loop and Hyperloop. To feasibly build a large network of tunnels, one must first rapidly innovate to increase tunneling speed and reduce tunneling costs.\n This competition challenges teams to come up with tunneling solutions and answer the question,  “ Can you beat the snail?”. The Boring Company is gauging interest from everyone (students, companies, hobbyists, etc.) from around the world to design, build, and race their own tunneling solution at The Boring Company’s Dig-a-Factory in the first Not-a-Boring Competition in Spring 2021.\n Teams will compete to bore a 30-meter tunnel with a cross-sectional area of 0.2 square meters (equivalent to a circle with a 0.5-meter diameter).  Winning categories will include:\n Fastest to complete tunnel and a driving surface (we will drive a Tesla remote controlled car through the tunnel)", "posttime": "2020-07-08 06:09:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比赛,boring,隧道", "title": "不枯燥的比赛", "title_en": "Not-a-Boring Competition", "transed": 1, "url": "https://www.boringcompany.com/competition", "via": "", "real_tags": ["比赛", "boring", "隧道"]}, {"category": "", "categoryclass": "", "imagename": "d5c2de3589f1d47106d1a21a60f8b4fd.jpg", "infoid": 1010434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇博客文章中，我想向你展示一个“直到你成功为止”的产品开发方法的实际例子。在我看来，这基本上意味着你试图领先于你目前的情况几步。你在“伪装”你进步更多的想法，但实际上你并没有。这种方法给了我的产品无价的答案，否则我很难得到这些答案。\n3年前，我的前任经理来找我，告诉我做1500个左右的横幅广告。我工作的公司得到了新产品，他们想在不同的国家销售。我们有6种产品，有5种颜色，我们的目标是为3个国家制作广告横幅。目标是为每个横幅广告创建15种格式。对绘图部来说，这是一场噩梦。我是它的组长。\n当我想象自己做1500个横幅广告时，我想哭。这种创建数千条横幅的场景每个月都很容易发生。手动制作1500个广告横幅是可能的，但这只是…。太无聊了！我想成为创造者，而不是创造者。\n我立即开始用谷歌搜索如何自动创建横幅集的过程。我找到了一些解决方案，但它们几乎毫无用处。他们不够灵活。\n我决定创建自己的解决方案。我尝试了Photoshop，更具体地说是那里的“动作”功能。基本上，动作功能是在Photoshop中记录我的步骤。所以，我可以记录我是如何手动生成横幅的，然后再播放一次，然后再生成横幅。这很简单：但却很强大。使用我创建的这个脚本，我能够自动执行流程的某些部分，并帮助我们的部门提高速度。\n我对一个有同样问题的平面设计师社区很感兴趣。我和我的朋友伊万在几个小时内创建了一个登录页。托马斯在5分钟内就画出了标识，然后我们提出了定价方案。我制作了脚本和…的视频。\n我很惊讶有那么多人和我们有同样的问题。更令人惊叹的是，有5个人买了剧本。这不便宜，大约110欧元。回过头来看，我想是…。真是个奇迹。它向我表明，问题确实存在，人们愿意为解决方案买单。\n当时，我对构建产品、销售、消费者行为或SaaS(软件即服务)一无所知。嗯，我知道这个理论，但只是从视频、朋友或讲座上知道的。但是我没有任何切实的经验。\n我创建了一个免费版本的Photoshop广告生成器，作为一个免费增值模型，它只能自动化6个横幅格式，而完整版可以自动化20个格式。我把它免费给了人们，以换取他们的反馈。\n坦率地说，它失败了。我过于乐观了，以为产品会做得更好。另一方面，它激励我问人们什么对他们不起作用，以及我如何才能变得更好。我甚至免费赠送了完整的专业自由职业者版，售价110欧元，以换取反馈。\n那时候我就放手了。我没有钱来构建这个产品，我觉得我没有足够的经验从头开始构建这个软件。\n一年半后，我决定再次探讨这个话题。我从产品管理、用户体验设计中学到了新东西，我与那些每天都在处理产品开发的朋友们走得更近了。所以我试了试。\n最后一个脚本并不适用于横幅的所有图形，它只适用于少数几个特定的图形。它很好，但是一旦您想要生成一些复杂的横幅，这个脚本就不能顺利工作。与此同时，Photoshop开发了一些其他功能，改变了游戏规则。我的游戏。\n从技术上讲，脚本是最容易做的，但是，它们是相当有限的。我决定更多地了解在Photoshop中什么是可行的。我了解了插件，这似乎是做事情的正确方式。然而，要做一个插件，我需要一个前端开发人员，因为我不能在足够的级别上编码。\n问题是，与开发人员一起构建东西是最昂贵的事情。我甚至不知道人们是否还对这个解决方案感兴趣。我所知道的唯一一件事就是我想尽可能多地改进广告横幅的生成，但是它应该如何工作呢？我一点头绪都没有。\n但我有一些我认为很强大的东西。设计师的超级大国。真的吗，山姆？超级大国？…。是的，超级大国。听我解释。\n如果我想摆脱生成，我应该怎么做？我只要按下魔法按钮，一切就都准备好了。但它是如何运作的呢？现在是🥁Designer超能力的时候了(我相信它是设计师的工具包)。\n我意识到我可以“伪造”整个插件和其中的交互。伪造插件的原因是我需要看看人们是否仍然对我的解决方案感兴趣。\n我知道这个插件的演示将为我提供一个很好的工具来解释图形设计人员该扩展的威力，并且可以给开发人员一个构建什么的远景。\n然后我需要以某种方式伪造生成横幅的算法。所以我录制了屏幕视频，去掉了一些部件。我删除了需要手动重新组织横幅中组件的这些部分。最后，这些屏幕记录看起来像是一个很棒的生成算法。\n现在是最后一部分了。我需要把这些部分连接起来。为此，我使用了Adobe After Effects。\n我把这段视频给我的朋友看，他们认为我已经学会了编程。在这一点上，我知道我做得很好。\n🗒旁注：当你想到这一点时，你会发现这是一个超级大国。使用一些工具，你可以向人们(在我的例子中是平面设计师)展示他们的未来，激发他们的想象力。你可以采纳一些想法，让它们看起来很真实。突然之间，所有的人都可以看到您的产品应该如何运行，应该做些什么。这不是很有力吗？\n视频完成后，我创建了一个登录页面，并将插件发布到当地的Facebook设计/营销社区\n我在帖子中添加了我的登录页面，然后我将其分享到其他组/论坛，我得到了400名注册用户。\n我甚至与一家设计机构达成了一些协议，他们告诉我他们会给我们一些钱来开发一个插件。此外，我甚至和他们开了两次会。就根据这段视频。\n最终，这笔交易一无所获。这是合理的。原因是：事实是，我刚刚发布了这段视频。我什么都没有了。只是一些用胶带连接的部分。当时，我不知道我们能与真正的代码走得多近。\n播放“假的”视频对于分享愿景和测试是否需要解决方案是非常有效的。另一方面，如果视频过于雄心勃勃，人们就会以此为常态，把期望建立在视频上。如果事后真正的产品与视频不符，他们很可能会不满意，因为产品非常不完整。在测试版测试期间，当我与一位用户通话时，这件事就发生在我身上。她预计完整的产品应该能像视频上那样工作。所以有时候现实一点比较好。否则，您将创建不愉快的初始用户。但我认为这是一种权衡，你需要依靠这一点。\n一旦我发现这个产品仍然很受欢迎，我就找到了一个叫Petr的程序员，我们开始了插件的开发。这段视频也是一个很好的工具，可以用来交流我想要实现的目标。当然，视频显示了快乐的道路，之后我需要设计“如果”的场景。但它完美地满足了我的期望。\n然后我们进行了测试版测试，有50人参加了测试。现在的产品是现场直播的。\n创建视频是一个强大的工具，但如果它过于雄心勃勃，你会让第一批用户不高兴。\n有些人会认为产品实际上在工作，但并不确定，这就是权衡。我建议你用它们来创建测试版测试器。正如我在上一篇文章中所写的那样，它可以在以后给你带来价值。\n在这个例子之后，我会更敏感地使用产品的假演示。我仍然相信它可以帮你节省一大笔钱，帮助你验证你的想法，并让你的想法获得牵引力。\n我希望这个例子能向设计师展示他们有多强大。此外，它还将向非设计师展示他们与设计师在船上可以实现的目标。\n如果你对我未来通过设计师的眼光建造产品的内容感兴趣，请随时加入下面的时事通讯。\n第一个收到我们的最新内容，可以随时选择退出。我们承诺不会向您的收件箱发送垃圾邮件，也不会与任何第三方共享您的电子邮件。", "note_en": "In this blog post, I would like to show you a practical example of a “fake it till you make it” approach to product development. To my mind, it basically means that you are trying to stay a few steps ahead of your current situation. You are “faking” the idea that you have progressed more, but you actually haven’t. This approach gave me invaluable answers for my product which were hard to get otherwise.\n  3 years ago, my former manager came to me and told me to do around 1500 banner ads. The company I worked for got new products and they wanted to market them in different countries. We got 6 products in 5 colors and the aim was to create ad banners for 3 countries. The goal was to create 15 formats of each banner ad. It was a nightmare for the graphic department. And I was its team leader.\n When I imagined myself doing 1500 banner ads, I wanted to cry. This scenario of creating thousands of banners could happen easily every month. It is possible to do manually 1500 ad banners, but it is just… too boring! I wanted to be a creator, not a generator.\n I started immediately googling how I can automate the process of creating banners sets. I found some solutions but they were pretty useless. They weren’t flexible enough.\n I decided to create my own solution. I experimented with Photoshop, more specifically with the “Actions” feature there. Basically, the Actions feature was recording my steps in Photoshop. So, I could record how I manually generated banners, then play it again and generate the banners. It was pretty simple: Yet powerful. With this script I created, I was able to automate some parts of the process and help our department to be faster.\n I was interested in a community of graphic designers who had the same problem. With my friend  Ivan, I created a landing page in a few hours.  Tomas sketched the logo in 5 minutes, then we came up with pricing. I created a video of the script and…\n    I was amazed by how many people had the same problem as us. What was more amazing was that 5 people bought the script. It wasn’t cheap, it cost around 110€. Looking back retrospectively, I think it was… a miracle. It showed me that the problem was there and people were willing to pay for the solution.\n At that time I didn’t know anything about building a product, selling, consumer behavior, or SaaS (Software as a Service). Well, I knew the theory, but just from videos, friends, or lectures. But I didn’t have any tangible experience.\n  I created  a free version of a Photoshop ad generator as a Freemium model, which could automate only 6 banner formats in contrast to the full version which could automate 20 formats. I gave it for free to people in exchange for getting feedback from them.\n   Frankly put, it failed. I was overly optimistic and thought that the product would do better. On the other hand, It motivated me to ask people what was not working for them and how I could get better. I even gave the full professional freelancers version, which cost 110€, for free in exchange for feedback.\n    At that time I let it go. I didn’t have money to build the product and I didn’t feel that I had enough experience to build the software from scratch.\n  After a year and a half, I decided to explore this topic again. I learned new things from Product Management, User Experience design, I was closer to friends who were dealing with product development on a daily basis. So I gave it a try.\n The last script didn’t work for all graphics of banners, it worked only for a few specific graphics. It was good, but once you wanted to generate some complicated banner, this script did not work smoothly. Meanwhile, Photoshop developed a few other features, which changed the game. My game.\n  Scripts are technically the easiest to do however, they are quite limited. I decided to learn more about what was feasible in Photoshop. I’d learned about plugins, which seemed like the right way to do things. However, to do a plugin, I needed a front end developer, because I couldn’t code on a sufficient level.\n The problem is that building something with a developer is the most expensive thing to do. And I didn’t even know if people were still interested in the solution. The only thing I knew was that I wanted to improve generating ad banners as much as I could, but how it should work? I had no clue.\n  But I had something that I believed was powerful. Designer superpower. Really, Sam? Superpower?… Yes, superpower. Let me explain.\n If I want to get rid of generating, what should I do? I could  just hit some magic button and everything would be set. But how would it work? It’s time for 🥁 designer superpower, (which I believe is a designers’ toolset).\n  I realized that I could “fake” the whole plugin and interactions in it. The reason for faking the plugin was that I needed to see if people were still interested in my solution.\n I knew that the demo of the plugin would serve me as a great tool for explaining graphic designers the power of that extension and could give developers a vision of what to build.\n    Then I needed somehow to fake the algorithm of generating banners. So I recorded screen videos and I got rid of some parts. I removed these parts where I needed to manually re-organize components in banners. In the end, these screen recordings looked like a great generating algorithm.\n Now the final part. I needed to connect these parts. For this purpose I used Adobe After Effects.\n   I showed this video to friends of mine and they thought that I had learned how to code. At that point, I knew I had done it well.\n 🗒Side note: When you think of that, this is a superpower. With some tools, you can show people (in my case graphic designers) the future them and spark imagination. You can take some ideas and make them look real. Suddenly, all the people can see how your product should behave and what it should do. Isn’t that powerful?\n  After the video was complete, I created a landing page and posted the plugin into local facebook design/marketing communities\n  I added my  landing page in the post, then I shared it to other groups/forums and I got 400 signups.\n I even got some deal with a design agency, which told me that they would give us some money to develop a plugin. Moreover, I even had 2 meetings with them. Just based on the video.\n In the end, nothing came from this deal. That was reasonable. Here is why: The truth was, that I had just released the video. I didn’t have anything else. Just some parts connected with duct tape. At that time, I had no clue how close we could get with the real code.\n  Showing a “fake” video is powerful for sharing a vision and testing if there is a need for a solution. On the other hand, if the video is too ambitious, people will take it as a norm and will base their expectations on the video. If the real product doesn’t match the video afterward, they will probably be unsatisfied because the product is incomplete. This thing happened to me when I had a call with a user during beta testing. She expected that the complete product should work as it was on the video. So sometimes it is better to be realistic. Otherwise, you will create unhappy initial users. But I believe it is a trade-off and you need to count on that.\n Once I saw that the product was still in demand I found a programmer called Petr and we started with the development of the plugin. The video was also a great tool for how to communicate what I wanted to achieve. Of course, video showed happy path and I needed to design “what if” scenarios, afterwards. But it served my expectations perfectly.\n Then we went through beta testing, which 50 people joined. Nowadays the  product is live.\n   Creating a video is a powerful tool but if it is too ambitious, you will create unhappy first users.\n Count on the trade-off that some people will think that product is actually working, but are unsure. I suggest you create beta testers out of them. It can bring you value afterward,  as I wrote in my previous article.\n After this example, I would use a fake demo of the product more sensitively. I still believe it can save you a lot of money, help you validate your idea and get you traction in your idea.\n I hope this example will show designers how powerful they are. Furthermore, it will show non-designers what they can achieve with designers onboard.\n If you are interested in my future content about building products through designer eyes, feel free to join the newsletter below.\n Be the first to receive our latest content with the ability to opt-out at anytime. We promise to not spam your inbox or share your email with any third parties.", "posttime": "2020-07-08 05:49:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "注册,video,产品", "title": "我收到了400个注册的视频，上面有一个不存在的产品", "title_en": "I got 400 signups with a video of a product that didn’t exist", "transed": 1, "url": "https://www.lunadio.com/blog/i-got-400-signups-with-a-video-of-a-product-that-didnt-exist/", "via": "", "real_tags": ["注册", "video", "产品"]}, {"category": "", "categoryclass": "", "imagename": "5dd05f3b0a91a76beff9a02aef5a3f52.jpg", "infoid": 1010433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "参议院司法委员会一致通过了美国备受争议的“赚取IT法案”的修订版，这是该法案成为法律的关键一步。在此之前，一系列的改变和妥协似乎解决了批评者最关心的问题，同时引入了新的问题。\n立法草案[PDF]名义上是为了帮助消除网络上的儿童性虐待材料(CSAM)，方法是修改《通信正当法》(Communications Decency Act)第230条，该条款强烈保护网站和应用程序，如Facebook和Twitter，无论其用户在这些平台上分享了什么，都不承担责任，外加或减去一些警告。然而，拟议中的法律相当忽视了这样一个事实，即第230条已经不保护互联网巨头，如果他们的网民上传非法内容的话。\n该法律的初步草案还包含两项提案，引起了广泛的团体和组织的严重关切。首先，创建一个由19人组成的新委员会，该委员会将由司法部长领导，由执法部门主导，将创建科技公司必须遵守的内容规则，以保留法律保护。其次，也是让安全人员武装起来的建议是，这些规则可能会要求科技公司提供仅限联邦调查局访问加密通信的权限。\n这个想法是，公司将必须通过遵循委员会创建的最佳实践来“赚取”他们的法律盾牌-因此法案的名字是“赚取IT”。\n在上述各点遭到重大反对后，司法委员会作出修改，以期获得全体成员的完全赞同。在现已通过的法案版本中，该委员会名为全国在线儿童性剥削预防委员会(National Commission on Online儿童性剥削预防)，仍将制定其规则，但网络平台将“自愿”遵守这些规则。相反，委员会主席林赛·格雷厄姆(R-SC)表示，如果科技公司确实遵守了欧盟委员会的规定，这“将成为任何民事诉讼的抗辩理由”。\n由于担心这项法律被用来迫使科技公司引入加密后门，参议员帕特里克·莱希(Patrick Leahy，D-VT)提出了一项修正案[PDF]，声明如果在线平台无法在自己的服务中破解端到端加密，它们将不会面临民事或刑事责任。\n综上所述，这些修正案旨在吸引国会对该法案的广泛支持，并为开放第230条铺平道路。在这种情况下，它起到了作用，委员会在周四以22票对0票批准了修订后的版本，使其朝着成文法又向前迈进了一小步。\n然而，隐私权倡导者和科技巨头，以及一些立法者，仍然强烈反对这项法律。首先，拟议中的委员会将不会由民选官员组成，仍将能够制定不需要国会批准的规则，将超乎寻常的审查权力交到极少数问责有限的人手中。\n虽然修订后的版本没有创建一个将在全国范围内应用的联邦标准，但修订后的“赚取IT法案”将授权各州引入自己的规则。这很可能导致批评人士在早先的草案中警告的同样影响：毕竟网站和应用程序将被迫在其加密服务中添加后门。\n第230节作者对特朗普、巴尔、拜登、美国国会对关键技术法的激进无知感到绝望。\n多读。\n如果在一些州被迫取消端到端加密，软件制造商很可能会简单地完全删除它，而不是试图根据用户所在的位置提供同一产品的不同版本。实际上，这将是一个走后门的法案。或者通信提供商可以简单地干脆扼杀这些服务。\n电子前沿基金会(EFF)警告说：“只需一个州就能激起一波针对网络平台的起诉和诉讼。就像一些联邦执法机构宣称他们反对加密一样，一些州和地方警察也表示反对。“。\n包括App Association、民主与技术中心、自由之家(Freedom House)、刑事辩护律师协会、开放技术研究所(Open Technology Institute)和互联网协会(Internet Society)在内的15个民间社会组织在改革出台后发给司法委员会两位负责人的一封信[PDF]也很关键。\n“经理的修正案实际上将使”赚取IT法案“变成一项完全不同的法案，”它指出，并补充道：“最令人担忧的是，新的措辞将修改第230条，将州民事和刑法排除在其保护…之外。”如果州法律规定疏忽或鲁莽运输CSAM是非法的，交互式计算机服务很可能根本无法托管用户生成的内容。\n更糟糕的是，新的语言可能允许州立法者针对重要的用户隐私功能，如端到端加密。通过将违反州法律的行为排除在第230条的保护之外，法院可能会做出破坏端到端加密使用的裁决。“\n它要求委员会“推迟加价，以便感兴趣的各方可以更详细地审查拟议的修正案，并与委员会合作，解决潜在的担忧”。但参议院委员会没有注意到这一要求，而是批准了修订后的法案，并将其作为一个整体提交给参议院进行审查。\n代表大部分科技行业的互联网协会(Internet Association)尤其持批评态度，其政府事务主管迈克·莱蒙(Mike Lemon)在一份声明中表示：“这项法案无助于实现我们的共同目标，反而会在涉及CSAM的州法律中造成有害的缺乏连贯性。”缺乏明确的联邦标准将阻碍供应商继续努力解决这一问题。“。\n立法者对该法案的辩护大多基于第230条，该条款已成为那些热衷于约束科技巨头的人的焦点。与此同时，该条款的作者警告说，那些试图改变它的人似乎很难理解它。\n参议院委员会最高民主党人黛安·范斯坦(D-CA)说：我认为重要的是要记住，国会制定230条款是一种特权。这不是宪法赋予的权利。\n德克萨斯州参议员特德·克鲁兹(R-TX)说，这项法律“应该是对大型科技公司的一个警告信号，表明如果不是压倒性的，两党对大型科技公司的关注即使不是压倒性的，也是强烈的，尤其是第230条不会永远充当牢不可破的盾牌。”\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "An amended version of America&#39;s controversial proposed EARN IT Act has been unanimously approved by the Senate Judiciary Committee – a key step in its journey to becoming law. This follows a series of changes and compromises that appear to address critics’ greatest concerns while introducing fresh problems.\n  The draft  legislation [PDF] is nominally supposed to help rid the web of child sexual abuse material (CSAM) by altering Section 230 of the Communications Decency Act, which strongly shields websites and apps, like Facebook and Twitter, from liability regardless of whatever their users share on those platforms, plus or minus some caveats. The proposed law rather ignored the fact that Section 230 already doesn&#39;t protect internet giants if their netizens upload illegal content, though.\n  Initial drafts of the law also contained two proposals that raised serious concerns from a broad range of groups and organizations. Firstly, the creation of a new 19-person committee that would be led by the Attorney General and dominated by law enforcement which would create content rules that tech companies would have to follow to retain legal protections. Secondly, and the suggestion that has security folks up in arms, is that those rules could require tech companies to provide Feds-only access to encrypted communications.\n  The idea is that companies would have to “earn” their legal shield – hence the name of the bill, EARN IT – by following the best practices created by the committee.\n  Following significant pushback on those points, the Judiciary Committee made changes aimed at gaining the full approval of all its members. In the now-OK&#39;d version of the bill, the commission, called the National Commission on Online Child Sexual Exploitation Prevention, would still create its rules but it would be “voluntary” for online platforms to follow them. Instead, if tech companies did follow the commission’s rules, it “would be a defense in any civil suit,” said committee chair Lindsay Graham (R-SC).\n  Concerns over the law being used to force tech companies to introduce encryption backdoors led to  an amendment [PDF], put forward by Senator Patrick Leahy (D-VT), that stated online platforms won’t face civil or criminal liability if they are unable to break end-to-end encryption in their own services.\n  Taken together, the amendments are intended to attract wide congressional support for the bill, and pave the way to open up Section 230. And in this instance, it worked, with the committee green-lighting the revised version by 22-0 votes on Thursday, allowing it to progress a little further toward the statute books.\n    However, privacy advocates and tech titans, as well as some lawmakers, remain strongly opposed to the law. For one, the proposed commission will not be made up of elected officials, and will still be able to create rules that do not need congressional approval, putting an extraordinary amount of censorship power into the hands of very few people with limited accountability.\n  While the revised version steps away from creating a federal standard that will apply across the country, the revised EARN IT Act will instead empower individual states to introduce their own rules. That could well result in the same impact critics warned about in the earlier drafts: that websites and apps would be obliged to add backdoors into their encrypted services after all.\n  Section 230 authors despair of Trump, Barr, Biden, US Congress’ aggressive ignorance of critical tech law\n  READ MORE\n  If forced to remove end-to-end encryption in some states, it is very likely software makers would simply remove it entirely rather than try to provide different versions of the same product depending on where users were located. In effect, it would be a backdoor bill through the backdoor. Or communications providers could simply kill off those services altogether.\n  The Electronic Frontier Foundation (EFF)  warned: “It will only take one state to inspire a wave of prosecutions and lawsuits against online platforms. And just as some federal law enforcement agencies have declared they’re opposed to encryption, so have some state and local police.”\n  A  letter [PDF] signed by 15 civil society organizations, including The App Association, Center for Democracy &amp; Technology, Freedom House, Association of Criminal Defense Lawyers, the Open Technology Institute, and The Internet Society, sent to the two heads of the Judiciary Committee after the changes were introduced, was also critical.\n    “The  manager’s amendment would effectively make the EARN IT Act into an entirely different bill,” it noted, adding: “Most worrisome, the new language would amend Section 230 to exclude state civil and criminal laws from its protection… If a state law makes it illegal to negligently or recklessly transport CSAM, interactive computer services will likely be unable to host user-generated content at all.\n  &#34;Worse, the new language potentially allows for state lawmakers to target important user-privacy features like end-to-end encryption. By excluding violations of state laws from the protections of Section 230, courts may make rulings that undermine the use of end-to-end encryption.”\n  It asked the committee to “postpone the markup so that interested parties can examine the proposed amendments in more detail, and work with the Committee to address potential concerns.” But the Senate committee didn’t heed the request, and OK&#39;d the revised bill instead, sending it to the Senate as a whole for review.\n  The Internet Association, which represents much of the tech industry, was particularly critical, with its government affairs director Mike Lemon saying in a  statement: “This bill will not help achieve our shared goal and instead will create a harmful lack of coherence in state laws involving CSAM. The lack of clear federal standards would impede providers from their continued work to tackle this issue.”\n  Much of lawmakers’ defense of the bill is based around Section 230, which has become a focal point for those keen to rein in technology giants. Meanwhile, the section&#39;s  authors have warned it appears to be poorly understood by those who seek to change it.\n  The top Democrat on the Senate committee, Dianne Feinstein (D-CA), said: &#34;I think it’s important to remember that Congress created Section 230 as a privilege. It&#39;s not a constitutional right.&#34;\n  And Senator Ted Cruz (R-TX) said that the law “ought to be a warning sign to Big Tech that there is a strong, if not overwhelming, bipartisan concern with Big Tech, and that Section 230 in particular will not serve as an unbreakable shield for all time.&#34; ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-07-08 05:31:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,赚取,pandemic,委员会", "title": "你可能会被大流行分心，但仅供参考：美国参议院小组OK的后门赚取IT法案", "title_en": "You may be distracted by the pandemic but FYI: US Senate panel OK's backdoors-by-the-backdoor EARN IT Act", "transed": 1, "url": "https://www.theregister.com/2020/07/06/revised_earn_it_act/", "via": "", "real_tags": ["美国", "赚取", "pandemic", "委员会"]}, {"category": "", "categoryclass": "", "imagename": "7810a74b49edfb5a4d5b9333119bf3b3.jpg", "infoid": 1010431, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波士顿(CBS)-第七名前eBay员工目前正面临联邦指控，罪名是与一场网络跟踪运动有关，据称这场运动的目标是一对纳蒂克夫妇，他们在时事通讯中撰写了关于该公司的批评内容。\n菲利普·库克(Philip Cooke)，55岁，来自加利福尼亚州圣何塞。被控合谋实施网络跟踪和合谋篡改证人。库克曾是圣克拉拉的一名警长，也是eBay欧洲和亚洲办事处的安全行动主管，预计他将于晚些时候在波士顿联邦法院出庭。\n45岁的詹姆斯·鲍格(James Baugh)来自加利福尼亚州圣何塞，他是eBay前安全和安保总监，也是前eBay全球弹性总监。48岁的大卫·哈维尔(David Harville)来自纽约市，是首批被起诉的六人之一。\n被起诉的还有圣何塞32岁的斯蒂芬妮·波普(Stephanie Popp)、加利福尼亚州雷德伍德城26岁的斯蒂芬妮·斯托克韦尔(Stephanie Stockwell)、圣何塞26岁的维罗妮卡·泽克(Veronica Zeak)和圣何塞51岁的布莱恩·吉尔伯特(Brian Gilbert)。两人都被控合谋进行网络跟踪和合谋篡改证人。\n联邦检察官说，eBay的员工据称下令送货，如血淋淋的猪万圣节面具，葬礼花圈，以及送到邻居家的色情物品。\n美国检察官安德鲁·莱林(Andrew Lling)在6月份表示：“这是一家大公司的高级员工决心、系统地试图摧毁纳蒂克一对夫妇的生活，这一切都是因为他们发布了公司高管不喜欢的内容。”", "note_en": "BOSTON (CBS) – A seventh former eBay employee is now facing federal charges in connection with a  cyberstalking campaign that allegedly targeted a Natick couple who wrote critical content about the company in its newsletter.\n Philip Cooke, 55, of San Jose, Calif. is charged with conspiracy to commit cyberstalking and conspiracy to tamper with witnesses. Cooke, who was a former Santa Clara police captain and was supervisor of security operations at eBay’s European and Asian offices, is expected to be appear in Boston federal court at a later date.\n James Baugh, 45, of San Jose, California, eBay’s former director of safety and security and former eBay director of global resiliency David Harville, 48, of New York City, was among the first six charged.\n Also charged were Stephanie Popp, 32, of San Jose; Stephanie Stockwell, 26, of Redwood City, Calif.; Veronica Zeak, 26, of San Jose; and Brian Gilbert, 51, of San Jose. Each is charged with conspiracy to commit cyberstalking and conspiracy to tamper with witnesses.\n Federal prosecutors said the eBay employees allegedly ordered deliveries such as a bloody pig Halloween mask, funeral wreath, and pornography that was sent to a neighbor’s house.\n “It was a determined, systematic effort of senior employees of a major company to destroy the lives of a couple in Natick, all because they published content company executives didn’t like,” said U.S. Attorney Andrew Lelling in June.", "posttime": "2020-07-08 05:30:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "夫妇,employee,ebay", "title": "7名前eBay员工在针对纳蒂克夫妇的网络跟踪行动中被起诉", "title_en": "7th Former eBay Employee Charged In Cyberstalking Campaign Targeting Natick Couple", "transed": 1, "url": "https://boston.cbslocal.com/2020/07/07/ebay-cyberstalking-campaign-natick-philip-cooke/", "via": "", "real_tags": ["夫妇", "employee", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "2819ed6204ae19936d79fa7a7fad8f17.png", "infoid": 1010430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全套工程师(员工/负责人)", "note_en": "Full Stack Engineer (Staff / Principal)", "posttime": "2020-07-08 05:29:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,建筑,gc,员工", "title": "BuildZoom(GC Marketplace)正在招聘开发人员和建筑工程师", "title_en": "BuildZoom (GC marketplace) is hiring developers and construction engineers", "transed": 1, "url": "https://jobs.lever.co/buildzoom", "via": "", "real_tags": ["开发", "建筑", "gc", "员工"]}, {"category": "", "categoryclass": "", "imagename": "68aa7620fcb3259d6d3ae01e9ac10a80.png", "infoid": 1010429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "某些PowerPoint功能无法在Google幻灯片中显示，如果您进行更改，这些功能将被删除", "note_en": "Some PowerPoint features can&#39;t be displayed in Google Slides and will be dropped if you make changes", "posttime": "2020-07-08 05:29:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变形金刚,zoo,功能", "title": "变形金刚动物园(更深层次的潜水)[幻灯片]", "title_en": "Transformer Zoo (a deeper dive) [slides]", "transed": 1, "url": "https://docs.google.com/presentation/d/1dIadh_nIszxXG8-672vJmvFGT6jBp0mOqzNV4g3e2Lc/edit?usp=sharing", "via": "", "real_tags": ["变形金刚", "zoo", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为招聘经理，我看了很多简历。很多简历。在过去的七年里有几千人。通过看这本书，我对我认为怎样才是一份好的求职申请提出了自己的看法。以下是给产品管理行业求职者的一些小建议。\n你可能在想：见鬼，谁看了我的求职信？回答：我知道。请不要将此理解为建议您写任何旧的标准求职信。我想强调一个最重要的词：有意义。\n招聘经理或招聘人员在你申请时得到的关于你是谁的信息少得令人难以置信。你的简历让我们得以一窥你的世界和你过去的经历。但是，只有几页或几个要点，很难理解工作和教育清单背后的技能、价值观和激情。当我一次阅读数百份简历时，流行语和工作职责可能会混淆在一起。\n如果您是一名产品管理专业人员，您总是在考虑您的受众：您的用户或客户是谁，您如何调整您的产品或消息传递以在正确的时间到达正确的地点？运用同样的方法：求职信是你让那些评估你候选人资格的人(你的听众)更深入地了解你的机会。请帮助我们了解您所产生的影响，您取得的成果，以及您一直热衷的事情。帮助我们了解您是如何运营的，以及对您来说最重要的是什么。对最重要的部分进行优先排序并突出显示。给我们讲讲你作为人类是谁的故事。\n不要落入常见的陷阱。当你为求职撒下一张大网时，可以很容易地写一个模板，然后试着根据工作稍微调整一下。您应该避免使用过于标准的模板：它会显示的！具体一点：告诉考官为什么你特别适合这份工作。把你的经历和工作要求联系起来。我喜欢听到个人的成就，但我经常看到这些伟大的成就与他们申请的工作无关。明智地选择你的轶事。这可能意味着您需要对该职位做更多的调查，以便更好地了解该职位在该组织中的位置。如果你对这个角色充满热情，我强烈建议你做这个研究，以帮助你加强你的经验和工作之间的联系。\n当你已经有经验的时候，这可能会很容易，但你可能会转而寻找一种新的工作类型，或者申请一份你还在发展技能的工作-这很棒！一定要讲述你为什么要做出这个改变的故事。为什么是这个行业，为什么是这个角色，为什么是现在？即使你还没有确切的头衔或掌握确切的技能，描述一下你在哪里可能已经具备了新角色的相关技能或价值观，这会很有帮助。不要盲目地申请你缺乏经验的职位，这样你就不会讲述你为什么想要做出改变的故事。你的故事是关键！\n最后，审阅你写的每一封求职信，确保去掉了模板空间或通用语言-你不知道有多少求职信提到了错误的公司、错误的工作，或者在评论中留下了像“在这里添加成就”这样的内容。虽然这是一个非常常见的错误，而且它可能会发生在我们最好的人身上，但不要成为这个人。\n我确信，在某些行业，您对某些短语或缩略语的了解实际上会对您的应用程序起到加分作用。然而，我建议在有疑问的时候，把它说出来。我看过很多简历，其中一半的职位描述是我不熟悉的术语，这让我相当疏远。再说一次，你只给了我非常有限的关于你自己的信息，如果我不能理解一半，我就不能看到你的价值。我们正在努力创造更具包容性的工作场所，所以我希望聘请想要用每个人都能理解的语言向我解释事情的团队成员。展示你在沟通中的清晰度。\n同样，我建议避免过多的虚荣心指标。虽然写你已经“增加了500%的参与度”听起来可能令人印象深刻，但我不会有一个框架来真正理解上下文中的这种增加。再一次告诉我，除了数字本身之外，您还获得了哪些用户或业务成果。\n这些建议很大程度上是针对网上求职的。作为一名招聘经理，我会阅读和审阅我空缺职位的每一份简历和求职信。尽管如此，我仍然建议你在可能的情况下与在公司工作的个人建立联系。这会让你有更多的机会讲述自己的故事，如果你不适合某个角色，还可以快速获得反馈，告诉你为了变得更合适，你可能需要做些什么。这也让你有机会面试公司本身的某个人--记住，你应该像他们面试你一样面试公司--当你真的想要这份工作的时候，这可能会让你感觉很难。花时间建立联系，这是非常值得的。\n如果你从这篇文章中去掉了一件事：讲述你的故事。我们在听呢！\n🙏非常感谢尼基·费根、帕特里克·罗伯茨、阿德里亚娜·巴斯和迈克尔·弗里德曼的帮助，他们提出了这一建议。", "note_en": "As a hiring manager, I read a lot of resumes.   A lot of resumes. Thousands over the last seven years. In seeing this volume, I’ve formulated opinions about what I think makes for a great job application. Here are a few small tidbits of advice to job seekers in the product management industry.\n  You’re probably thinking: who the hell reads my cover letter? Answer:  I do. Please don’t read this as a recommendation to write just any old standard cover letter. I want to highlight the most important word:  meaningful.\n A hiring manager or recruiter gets an unbelievably small amount of information about who you are as a human when you apply. Your resume gives us a glimpse into your world and past experience you’ve had. But with just a few pages or bullet points, it can be very hard to understand the skills, values, and passion behind that list of jobs and education. When I’m reading hundreds of resumes at a time, the buzzwords and job responsibilities can blur together.\n If you’re a product management professional, you’re always thinking about your audience: who are your users or customers, and how do you tailor your product or messaging to reach them in the right place at the right time? Apply the same approach: a cover letter is your chance to give those reviewing your candidacy (your audience) more insight into  you. Help us understand the impact you’ve had, the outcomes you’ve achieved, the things you’ve been passionate about. Help us understand how you operate and what matters most to you. Prioritize and highlight the most important pieces. Tell us the story of who you are as a human.\n Don’t fall into common traps. When you’re casting a wide net for your job search, it can be easy to write one template and try to slightly tweak it for the job. You should avoid a template that is too standard: it will show! Get specific: Tell the reviewer why you’re a good fit specifically for  this job. Make a connection between your experience and the job requirements. I love hearing about individual’s accomplishments, but I often see that these great outcomes have nothing to do with the work they are applying for. Choose your anecdotes wisely. This may mean you need to do a little more investigation into the position to understand better where it sits within that organization. If you’re passionate about this role, I highly recommend doing this research to help you strengthen the connection between your experience and the job.\n This can be easy when you already have experience, but you may be looking instead to transition into a new type of work or apply for a job where you’re still developing your skills — that’s great! Make sure to tell the story about why you’re making this change. Why this industry, why this role, why now? It can be helpful to describe where you might already have relevant skills or values for the new role, even if you haven’t had the exact title or mastered the exact skills just yet. Don’t blindly apply for roles where you lack the experience  and then you don’t tell the story about why you’re looking to make a change. Your story is key!\n Finally, review every cover letter you write to make sure you remove the template spaces or generic language — you have no idea how many cover letters mention the wrong company, the wrong job, or leave in comments like “add accomplishments here.” While this is a very common mistake, and it can happen to the best of us, don’t be this person.\n  I am sure there are some industries where your knowledge of certain phrases or acronyms will actually be a plus for your application. However, I recommend that when in doubt, spell it out. I see a lot of resumes where half of the job description is terms that I’m unfamiliar with, and this is quite alienating. Again, you’re only giving me a very limited amount of information about yourself, and if I can’t understand half of it, I won’t be able to see as much of your value. We are trying to make  more inclusive workplaces, so I am looking to hire team members who want to explain things to me in language that everyone can understand. Show that you’re capable of that clarity in communication.\n Similarly, I recommend avoiding too many vanity metrics. While it might sound impressive to write that you’ve “increased engagement by 500%,” I won’t have a framework to really understand that increase in context. Again, tell me the story about what user or business outcomes you achieved as a result of this increase in addition to just the number itself.\n  Much of this advice is geared towards applying to jobs online. As a hiring manager, I read and review  every single resume and cover letter that comes in the door for my open roles. That said, I still recommend making connections with individuals who work at the company when you can. This gives you more chances to tell your story as an individual, and if you’re not the right fit for a role, to get quick feedback on what you might need to do in order to become a better fit. It also gives you a chance to interview someone at the company itself — remember you should be interviewing the company just as much as they are interviewing you — which can feel hard at times when you really want the job. Spend time making connections, it is well worth it.\n If you take away one thing from this article:  tell your story. We’re listening!\n 🙏 Many thanks to Nikki Faigen, Patrick Roberts, Adriana Buss, and Michael Freedman for their help in putting together this advice.", "posttime": "2020-07-08 05:28:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "求职信,cover", "title": "请写一封求职信", "title_en": "Please, Write a Cover Letter", "transed": 1, "url": "https://medium.com/@_asilverman/please-write-a-cover-letter-dd200c2e71ea", "via": "", "real_tags": ["求职信", "cover"]}, {"category": "", "categoryclass": "", "imagename": "da518d994f8acb446e13fa6ce406bdb7.jpg", "infoid": 1010427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丹尼尔·罗德里格斯(Daniel Rodriguez)是Picap的首席执行官兼联合创始人，该公司已经为其移动平台筹集了700多万美元的风险投资，该平台的业务遍及八个拉丁美洲国家。\n我问他为什么我们不走最短的路去海滩。当时我只有8岁，对地图着迷，并质疑父亲的选择。几年后，我了解到我建议的路线陷入了各种武装团体的泥潭，他们的利益与我或其他哥伦比亚家庭的利益不一致。\n你可能熟悉困扰哥伦比亚几十年的冲突，但你可能没有意识到机构、倡导团体和政府在建设一个公民有选择和流动性不受武装冲突限制的未来方面取得的进展。\n事实上，根据世界银行的衡量，哥伦比亚有时会提高其“经商便利性”排名。这个国家、它的机构和它的领导人在确保机会遍及全国各个角落方面还有更长的路要走，特别是在新冠肺炎放大了持续存在的不平等的时候。但有一件事是肯定的，如果哥伦比亚进一步拥抱创新，通往繁荣的道路将看起来要好得多。\n在过去的十年里，我一直致力于哥伦比亚的繁荣之路。我通过在哥伦比亚最负盛名的洛斯安第斯大学学习，筹集了1000多万美元的风险投资，并创建了两家公司，为7万多哥伦比亚人创造了直接和间接的收入，从而做到了这一点。我直接留住了数百名计算机工程师，向年轻的哥伦比亚人展示，不为寻找职业机会而移民也有可能赚取良好的生活。见鬼，我甚至说服了一些过去的移民回到哥伦比亚，在Picap为我工作。\n我对哥伦比亚繁荣的贡献，以及数以千计在哥伦比亚制造技术的天才工程师的贡献都岌岌可危。这是有风险的，因为哥伦比亚当局和立法部门在更新交通和技术监管方面进展缓慢，因为监管可能会持续几十年，因为社会创新的速度是以几十年来衡量的。\n在哥伦比亚，我们需要更新管理技术和运输的法规。哥伦比亚当局和监管机构对优步(Uber)和Picap施加的无处不在的威胁，不仅是将科技精灵重新投入瓶子的徒劳尝试，还会推迟建立长期合作伙伴关系以实现共同成功的关键对话。\n当务之急是哥伦比亚和世界各国建立监管框架，同时促进公共利益和技术创新。事实上，我们有证据表明，当采用新的移动模式和技术时，可以扩大各种好处。以Gojek或Grab为例，它最初像Picap一样，是两轮叫车平台。每一个现在都价值数十亿美元，并促进商业、金融服务等，所有这些都是为了社会的利益，这些社会随后产生更多的消费者剩余，使经济活动正规化，并刺激新的创新形式。随着监管的进步，Picap和其他公司可以在哥伦比亚和拉丁美洲更多的地方做到这一点。\n哥伦比亚的一些国会领导人在增进对技术平台的理解方面做出了相当大的努力，但无论他们的努力多么值得称赞，都没有取得进展。现在，例如，哥伦比亚的领导人必须比以往任何时候都更多地认识到，私人交通服务需要为公民服务的监管，这些监管为新的移动选择提供动力。世界上每个国家都面临着一个清算，基于新冠肺炎有多容易削弱国家支持的独立的健康、流动性和经济活动体系。技术将是每个国家加强健康、机动性和经济活动的必然组成部分。我们已经看到，包括Pibox by Picap在内的交付平台在帮助各国保持社会距离方面发挥着越来越大的作用。然而，各国仍有机会区分和思考不仅在大流行期间的防御战略，而且还有如何为未来重塑自己。\n哥伦比亚可以向韩国学习，韩国多年来一直将自己定位为满足世界未来对硅芯片类型的需求，这些芯片后来成为LG和三星的家喻户晓的品牌。韩国做到了这一点，不是通过阻碍技术进步，而是通过促进专有技术的发展，投资于教育，并与技术合作。作为技术专家，没有什么比帮助哥伦比亚发展经济活动更令我们自豪的了，这些经济活动将从长远来看增强国家的实力。我看到了未来，我每天都在实践，我知道拉丁美洲，特别是哥伦比亚，需要投资于留住技术人才，推进吸引技术投资的监管框架，否则我们的经济将在未来几年从新冠肺炎那里潜在的复苏中挣扎得更远。\n最近，移动平台行业组织Alianza IN在哥伦比亚成立，旨在推动与哥伦比亚立法者和监管机构就哥伦比亚MinTIC(信息技术和通信部)可以纳入的原则进行对话，以帮助吸引更多投资，留住人才，并积极为移动和技术平台成为该国经济未来关键合作伙伴的未来做准备。技术平台已经是当今社会的一部分，Alianza IN的行动是在确保更新的监管框架服务于数百万依赖移动性和技术平台获得收入、移动性和提高生活质量的哥伦比亚公民的道路上迈出的一大步。\n去年，哥伦比亚科技公司获得了超过12亿美元的投资资本。我这一代人和科技界的哥伦比亚同事在短短20年内取得的新头条给我留下了深刻的印象。但我可以向你们保证，如果哥伦比亚政界人士和当局不解决改善包括Picap在内的技术和新移动性监管的根本需求，哥伦比亚在21世纪的头条新闻将会受到阻碍。我们有增长的空间，并向世界展示我们的坚韧和韧性将如何帮助应对不仅是哥伦比亚或拉丁美洲的挑战，而且是全球挑战。\n我期待着很快见到这位年轻的哥伦比亚妇女，她将在20年甚至3年内开发出一种服务于数十亿人的可再生能源或疾病预防创新。我们必须清除路障。我们已经开始在哥伦比亚各地的某些方面做到这一点；我们需要在技术方面继续做到这一点。我和我这一代人将继续吸引资本，留住人才，进一步发展竞争优势，使哥伦比亚在21世纪处于领先地位。\n我希望哥伦比亚政府、监管机构和杜克政府也这样做。", "note_en": "Daniel Rodriguez is CEO and co-founder of  Picap, which has raised more than $7 million of venture capital for its mobility platform, which operates across eight Latin American countries.\n  I had asked him why we never took the shortest path to the beach. Just eight years old, I was fascinated by maps and was questioning my father’s choice. Years later I would learn the route I suggested was mired with armed groups of all stripes whose interests didn’t align with mine or that of other Colombian families.\n You may be familiar with the conflicts that plagued Colombia for decades, but you might not be aware of the progress institutions, advocacy groups and its government have made with regard to building a future where citizens have options and mobility that’s not constrained by armed conflict.\n In fact, Colombia has at times improved its “ease of doing business” ranking as measured by the World Bank. The country, its institutions and its leaders have a longer way to go when it comes to ensuring that opportunity reaches all corners of the country, particularly at a time that COVID-19 magnifies the inequities that persist. But one thing is for sure, the path to prosperity would look a lot better if Colombia further embraced innovation.\n I have dedicated the last decade to Colombia’s path to prosperity. I have done so by studying at Colombia’s most prestigious Universidad de Los Andes, raising more than $10 million in venture capital and building two companies that generate direct and indirect earnings for more than 70,000 Colombians. I have directly retained hundreds of computer engineers by showing young Colombians that it’s possible to earn a good living without emigrating for professional opportunities. Heck, I’ve even convinced a few past emigrants to return to Colombia and work for me at  Picap.\n My contribution to Colombia’s prosperity and the contribution of thousands of talented engineers that build technology in Colombia is at risk. It’s at risk because the Colombian authorities and the legislative branch have been slow to update transportation and technology regulation designed for an era when regulation could last decades because the pace of societal innovation was measured in, well, decades.\n In Colombia, we need to update regulations governing technology and transportation. The ever present threats that Colombian authorities and regulators have imposed on Uber and Picap are not only futile attempts to put the technology genie back into the bottle, but also delay the critical conversations that would build long-term partnership for mutual success.\n It’s urgent that Colombia and countries around the globe construct regulatory frameworks that simultaneously advance the public good and technology innovation. We, in fact, have evidence of the kinds of benefits that can expand when new mobility models and technologies are embraced. Take GoJek or Grab which started, like Picap, as two-wheel ride-hailing platforms. Each is now worth billions and facilitates commerce, financial services and more, all for the benefit of societies which then produce more consumer surplus, formalize economic activity and stimulate new forms of innovation. Picap, and others, can do this in Colombia and more places across Latin America with regulatory advancements.\n There are congressional leaders in Colombia who have made considerable efforts to advance their understanding of technology platforms, but their efforts, however laudable, have not advanced. Now, more than ever, Colombia’s leaders must, for example, recognize that private transport services need regulation that works for the citizens that power new mobility options. Every country in the globe faces a reckoning based on how easily COVID-19 weakened state-supported and independent systems of health, mobility and economic activity. Technology will be an inevitable component of strengthening health, mobility and economic activity in every country. We’ve already seen that delivery platforms, including Pibox by Picap, increasingly play a role in helping countries preserve social distancing. And yet there’s an opportunity for states to differentiate and think about not just defensive strategies during the pandemic, but also how to remake themselves for the future.\n Colombia can learn from the example of South Korea, which for years positioned itself to fulfill the world’s future demands for the types of silicon chips that subsequently made LG and Samsung household names. South Korea did this not by impeding technological advancement, but by facilitating the development of know-how, investing in education and partnering with technology. As technologists, there’s nothing that would make us prouder than helping Colombia develop the kinds of economic activity that will strengthen the country in the long-term. I’ve seen the future, I practice it daily, and I know that Latin America, and Colombia in particular, need to invest in retaining tech talent and advancing regulatory frameworks that attract technology investment, or our economies will struggle even further in the coming years of potential recovery from COVID-19.\n Recently, the Alianza IN, a mobility platform trade group, launched in Colombia with the goal of advancing conversations with Colombian lawmakers and regulators on the principles that the Colombian MinTIC (Ministry of Information Technologies and Communications) could incorporate to help attract more investment, retain talent and proactively prepare for a future in which mobility and technology platforms are critical partners of the country’s economic future. Technology platforms are already a part of the present, and the Alianza IN’s actions are a great step on the path toward ensuring that updated regulatory frameworks serve the millions of Colombian citizens who depend on mobility and technology platforms for income, mobility and improved quality of life.\n Last year, Colombian technology companies received more than $1.2 billion of investment capital. I am impressed with the new headlines my generation and Colombian colleagues across technology have achieved in only 20 years. But I can assure you that Colombia’s headlines in the 21st century will be stunted if Colombian politicians and authorities do not address the underlying need to improve regulation that embraces technology and new mobility, including Picap. We have room to grow and show the world how our tenacity and resilience will help address not just Colombian or Latin American challenges, but global challenges.\n I look forward to soon meeting the young Colombian woman who in 20 or even three years will have developed a renewable energy or disease-prevention innovation that serves billions of people. We have to remove roadblocks. We’ve begun doing so across Colombia on some fronts; we need to continue to do so on the technology front. I, alongside, my generation, will continue to attract the capital, retain the talent and further develop the competitive advantages that will position Colombia to lead in the 21st century.\n I hope that the Colombian government, regulators and the Duque administration does this, as well.", "posttime": "2020-07-08 05:10:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "障碍,roadblocks,哥伦比亚", "title": "\n监管障碍阻碍了哥伦比亚的科技和运输业", "title_en": "\n\t\t\t\tRegulatory roadblocks are holding back Colombia’s tech and transportation industries\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/07/regulatory-roadblocks-are-holding-back-colombias-tech-and-transportation-industries/", "via": "", "real_tags": ["障碍", "哥伦比亚"]}, {"category": "", "categoryclass": "", "imagename": "ef91fbfb67037f36c47696c7d0c77374.jpg", "infoid": 1010426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "灯光暗了下来。现在是您首选的云供应商年度主题演讲开始的时候了。一段鼓舞人心的视频播放着被慈善机构认为是“公司舞曲”的音乐，但实际上听起来就像是安眠药中加速的恩雅。\n萨蒂娅/安迪/一个机器人走上舞台欢迎我们所有人参加他们的会议。首先，在这个不确定的时代，有一张必须严肃的面孔。紧随其后的是一家公司的首席执行官对种族正义的点头，该公司的整个黑人高级领导团队都可以轻松地坐在丹尼的摊位上，而不会拥挤。现在适当地省去了严肃的话题，他们转向即将或将在未来几个月内发布的奇幻新创作。\n这很奇怪。他们每年都这样做，但你看不到你的账单反映了任何这些奇妙的服务。你想知道卖的是什么，卖给了谁。\n他们在卖幻想，而你一直都在买。\n我以修理AWS账单为生，通常是为每年云支出从“几百万美元”到“汤加年度GDP以北”的公司服务。我不会假装这是云客户群的完美样本，但我看到了足够多的不同云环境，可以在趋势经过我的办公桌时识别出它们。总有一天，我会对数据进行适当的统计分析，并让自己接受实际上是合唱团的井的考验。但在那之前，恐怕你得把我的印象告诉我，我认为这是下一个最好的事情。\n所有支出的大部分是并且一直是EC2实例的直接成本。接下来的四个依次是RDS、弹性块存储(间接EC2成本)、S3和数据传输(是的，另一个EC2成本)。\n没错。云实际上是一堆别人的虚拟化计算机被卖给你。剩下的主要是装点门面。\n当然，也有例外：我已经为大量使用DynamoDB的公司找到了一些有趣的节省机会，一些人看到了将Kafka之类的东西从EC2实例转换到Amazon MSK的巨大成功。\n我不是在说你和你宝贵的独角兽公司；当然，你的账单是不同的。您可能是去年的acoud.guru，一家在Serverless Conf上自豪地声称他们每月的总计算费在1,000美元到2,000美元之间的公司！不过，从统计上看，你不是。今年，在收购LinuxAcademy及其每年270万美元的AWS账单后，你离acLoud.guru更近了一步。\n云的承诺是我们可以利用大量更高级别的服务。我们可以弹性地扩大规模以满足需求，然后在高峰过去后缩减规模。我们可以利用由专家构建和运行的一系列托管服务，将自己从没有增加直接业务价值的无差别劳作中解脱出来。\n总的来说，我们不做这些事情。我们对待云就像对待一个昂贵的数据中心，我们重点介绍了少数几个例外案例，这些案例除了这一令人悲哀的事实之外，几乎说明了任何其他故事。\n这就是塑造(有效)云营销的故事的直接内容。我们设想，在下一次冲刺之后，我们将以某种方式打破做出糟糕IT决策的循环，并开始做出良好的IT决策。\n大企业受困于流程，以至于他们无法挣脱足够长的时间进行创新，想象自己正在转型为灵活的初创企业。奇怪的是，初创公司并没有想象相反的情况--这就是我们看到营销魔力出现的地方。\n如果你仔细观察，所有主要的云参与者(坦率地说，也包括次要的参与者)对Kubernetes的关注都更加突出了这一点。\n这里有一些新的和时髦的东西；公司谈论他们的容器编排故事或他们的服务网(将其多元化为“服务Meesh”)产品。这里有一些新的和差异化的东西，削弱了人们对VM的陈旧看法。\n除了一个小问题，Kubernetes及其生态系统真正释放的是将现有工作负载推入容器的能力，并不知道容器内发生了什么(您猜对了！)。云公司准备向您销售的计算。\n“…。今天，所有这些新服务都可供您使用！“。\n他们几乎是顺带提到了新一代计算实例。每个人都点点头，等待下一张幻灯片。\n但是这个“小”的发布将会给它的客户的所有产品的单位经济性带来最大的变化，这是整个会议上宣布的最大的变化。\n事实是，在云中运行虚拟机是乏味的，人们渴望一些新的和令人兴奋的东西。\nKubernetes就是在这种渴望下诞生的；它允许人们在虚拟机上运行工作负载，就像他们自己是云提供商一样。他们调整和重新平衡泰坦尼克号上的甲板椅，努力跟上爆炸性的集装箱编排世界，以至于他们可以忽略这样一个严峻的认识：他们的整个职业生涯现在都花在了一家不付钱的公司制造的产品上。\n存储数据、处理数据、将数据从一个地方移动到另一个地方：这就是超定标器的云引擎的动力所在。这就是你把整个IT预算花在上面的，也是你正在观看而不是工作的精心制作的舞台剧巧妙地向你隐藏的东西。\n随时关注最新的AWS新闻、观点和工具，所有这些都充满爱意地夹杂着一些尖刻的言辞。\n我们是互联网上唯一尖酸刻薄的资源，几乎所有的东西都是aws…。我们知道这一点。", "note_en": "The lights go down. It’s time for your preferred cloud vendor’s annual keynote to start. An inspiring video plays to what was charitably deemed “corporate dance music” but in practice sounds like a sped-up Enya on quaaludes.\n Satya / Andy / a robot walks on stage to welcome us all to their conference. First, there’s the obligatory Serious Face about These Uncertain Times. That’s followed by the nod to racial justice by the CEO of a company whose entire Black senior leadership team could comfortably fit inside a Denny’s booth without crowding. The Serious Topics now suitably dispensed with, they turn to fantastical new creations that are or will be released within the coming months.\n It’s odd. They do this every year, but you don’t see your bill reflecting any of these fantastical services. You wonder what’s being sold and to whom.\n They’re selling a fantasy, and you’ve been buying it all along.\n  I  fix AWS bills for a living, generally for companies with annual cloud spend ranging from “a couple of million dollars” to “north of Tonga’s annual GDP.” I don’t pretend that this is a perfect sampling of the cloud customer base, but I see enough varied cloud environments to identify trends as they cross my desk. One of these days, I’ll perform a proper statistical analysis of the data and subject myself to the  Well Actually Chorus. But until then, I’m afraid you’ll have to take my impressions on what I’ve seen as the next best thing.\n A  majority of spend across the board is and always has been the direct cost of EC2 instances. The next four are, in order, RDS, Elastic Block Store (an indirect EC2 cost), S3, and data transfer (yup, another EC2 cost).\n That’s right. The cloud really  is a bunch of other people’s virtualized computers being sold to you. The rest of it is largely window dressing.\n Sure, there are exceptions: I’ve found some fascinating savings opportunities for companies making heavy use of DynamoDB, and some folks are seeing great success with transitioning things like Kafka from EC2 instances to Amazon MSK.\n I’m not talking about YOU and your precious unicorn company; of course, YOUR bill is different. You might be  acloud.guru last year, a company who proudly claimed at ServerlessConf that  their total compute bill was between $1,000 and $2,000 per month! Statistically though, you’re not. You’re closer to acloud.guru  this year after acquiring LinuxAcademy and its  $2.7 million a year AWS bill.\n   The promise of the cloud is that we can leverage a host of higher-level services. We can elastically scale up to meet demand then scale back down when the spike has passed. We can take advantage of a bunch of managed services built and run by experts and free ourselves from the undifferentiated toil that adds no direct business value.\n On balance, we do none of those things. We treat the cloud like it’s an expensive data center, and we highlight the few exception cases that tell almost any other story than that sad truth.\n This is what feeds directly into the narratives that shape (effective) cloud marketing. We imagine that somehow we’re going to break the cycle of making bad IT decisions and begin making good IT decisions just after this next sprint.\n  Large enterprises so encumbered with process that they can’t break free long enough to innovate imagine themselves as transforming into nimble startups. Startups strangely don’t imagine the opposite—and that’s where we see the marketing magic come to life.\n  If you look carefully along the seams, the increased focus by all of the major cloud players (and, to be frank, the minor ones too) on Kubernetes highlights this.\n Here is something new and trendy; companies talk about their container orchestration stories or their service mesh (which pluralizes to “service meesh”) offerings. Here’s something new and differentiated that detracts from the old-and-busted perception of VMs.\n Except for the minor point that what Kubernetes and its ecosystem really unlock is the ability to shove existing workloads into containers, have no real idea what’s going on inside of them, and put them onto (you guessed it!) the compute that the cloud company is poised to sell you.\n   “…and all of these new services are available for your use today!”\n Almost in passing, they mention a new generation of compute instances. Everyone nods and waits for the next slide.\n But that “minor” release is going to cause the single greatest change in its customers’ unit economics of everything announced this entire dog-and-pony show of a conference.\n The fact is that running virtual machines in the cloud is  boring, and people crave something new and exciting.\n Kubernetes was born out of this craving; it lets people running workloads on virtual machines cosplay as if they were cloud providers themselves. They shuffle and rebalance the deck chairs on the Titanic, working hard enough at keeping abreast of the exploding world of container orchestration that they can ignore the grim realization that their entire careers are now spent working on a product made by a company that doesn’t pay them.\n Storing data, crunching that data, moving that data from place to place: That’s what fuels the cloud engines of the hyperscalers. That’s what you spend your entire IT budget on and that’s what the elaborate stage show you’re watching instead of working is artfully concealing from you.\n Stay up to date on the latest AWS news, opinions, and tools, all lovingly sprinkled with a bit of snark.\n   We’re the internet’s only snarky, sarcastic resource for literally anything and everything AWS… and we know it.", "posttime": "2020-07-08 05:09:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谎言,lies", "title": "谎言、该死的谎言和基调", "title_en": "Lies, Damned Lies, and Keynotes", "transed": 1, "url": "https://www.lastweekinaws.com/blog/lies-damned-lies-and-keynotes/", "via": "", "real_tags": ["谎言", "lies"]}, {"category": "", "categoryclass": "", "imagename": "b095d5ed09d18e54031a986739fe4a80.png", "infoid": 1010425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约1.5年前，我对美国YouTube热门视频进行了分析。这项分析是在2017年和2018年的一些月份的趋势视频上进行的。分析在Kaggle和Reddit上引起了很大的兴趣；我也收到了一些赞扬所做工作的电子邮件。那是一年半以前的事了。\n今天，我提出该分析的改进和扩展版本。这一分析更为先进，并包含了新的有趣元素。在这份分析中，分析了2019年全年的所有热门视频(超过7万个视频)。\n标题、描述、缩略图、标签、视图、喜欢/不喜欢和评论都被分析，以产生本文所示的结果。继续阅读以了解有关分析和数据的更多信息，或者您可以直接跳到结果部分。\n如你所知，YouTube是当今世界上最受欢迎和使用最多的视频平台。YouTube有一个热门视频列表。我将引用YouTube上的热门视频描述：\n流行趋势帮助观众看到YouTube上和世界上正在发生的事情。Trending的目标是让广大观众感兴趣的视频浮出水面。有些趋势是可以预测的，比如流行艺术家的新歌或新的电影预告片。另一些则令人惊讶，比如一段病毒式的视频。Trending不是个性化的，它向所有用户显示每个国家/地区的相同热门视频列表。\n热门视频列表大约每15分钟更新一次。每次更新时，视频可能会在列表中上移、下移或停留在同一位置。\n分析的主要目标是通过探索数据和使用有效的可视化来发现有趣的事实和模式。\n哪些视频在趋势列表中出现最多(因为某些视频可能在趋势列表中出现超过一天)？\n热门视频的标题长度是多少？平均/最小/最大标题长度是多少？\n热门视频的前几类是什么？“娱乐”视频比“游戏”视频更流行吗？\n从发布视频到第一次出现在趋势排行榜之间有多少天？\n热门视频缩略图中最常见的对象是什么？(对所有缩略图运行AI对象检测算法)。\n这个分析是使用Python和一组强大的Python库来执行的，这些Python库包括Pandas、Matplotlib、NLTK、ImageAI、wordcloud等等。\n您可以在此链接的Jupyter笔记本中找到用于此分析的所有代码。您可以随意阅读代码并随心所欲地重用它。还要注意的是，笔记本中包含的分析比本文中显示的要多，因此，如果您想查看所有内容，请在阅读完本文后参考笔记本。\n使用YouTube API检索此分析中使用的数据。一个脚本计划在2019年全年每天运行，并从YouTube API获取有关当天热门视频的数据。然后，该脚本将处理从YouTube接收的数据，并将其存储在文本文件中。\n刮剧本不是我的作品。它可以在Github：Trending-YouTube-Screper上找到。我将脚本放在AWS EC2实例上，并使用Crontab安排它每天在特定时间运行。\n2019年结束后，我使用FileZilla应用程序连接到AWS实例，并下载了脚本生成的所有数据。2019年的每一天都有一个文件。要执行分析，我需要处理数据，以便将文件合并到单个CSV文件中。\n如果你想下载这份描述2019年美国流行视频的分析中使用的数据，你可以通过这个链接在GumRoad上安全地购买，或者使用下面的按钮。除了美国，你还将获得英国、加拿大、丹麦、马来西亚、沙特阿拉伯和其他国家的热门视频数据。\n在这篇文章中，将分析美国的热门视频，这些视频总共构成了72,994个视频。YouTube通常每天在趋势列表中放置200个视频，这意味着我们应该有73,000个(365x200)个视频。我们有72994个。这可能是因为有几天，Trending的视频数量略低于200个。\n所以我们有72,994个趋势视频的数据要分析。在YouTube上，同一个视频可能会连续很多天出现在热门榜单上。这意味着这72,994个视频并不是唯一的视频。事实上，在72,994个视频中，我们有11,177个独特的视频。\n换句话说，2019年全年有11,177个视频出现在趋势排行榜上。有些人可能在名单上停留了10天，有些人在名单上停留了20天，等等。我们将在稍后的分析中看到更多关于这方面的信息。\n下表显示了我们拥有的每个视频的数据示例：\n正如我们所看到的，我们有视频的ID，它是YouTube上视频的唯一值(没有两个视频具有相同的ID)。我们还有视频的标题、发布日期和时间、发布它的渠道、它的类别以及它的描述和标签。我们也有视频的点击量、喜欢、不喜欢和评论的数量。表中还显示了更多的数据。\n我们可以看到有一个名为“TRENDING_DATE”的字段。此字段指定此视频的流行日期。正如我们前面所说的，相同的视频可能会出现在趋势视频列表中超过一天。这意味着我们可能会在数据中找到相同视频ID的另一条记录，但具有不同的“TRENDING_DATE”，并且可能有不同数量的观看、评论、点赞等(因为这些数字可能会从一天增加到另一天)。\n现在让我们开始这篇文章最精彩的部分，让我们来看看分析结果。\n请注意，对于以下分析，除非另有说明，否则我们将分析应用于所有72,994个趋势视频，而不只是唯一的趋势视频。背后的原因是我们对YouTube认为流行的视频感兴趣。因此，如果一段视频被认为流行了3天，那么我们认为它比只流行1天的视频具有更大的流行力量和更多的流行特征；因此，它应该有更多的权重。因此，我们在分析中包括了该视频的3个实例。\n对于某些分析，只考虑独特的视频更合适。如果是这样的话，你会看到一张纸条告诉你这一点。\n点击量最高的热门视频是BTS乐队的一首歌，名为《有爱的男孩》。这段视频发布于2019年4月12日，2019年4月23日，它以195,376,667次的点击量出现在热门榜单上，这是2019年热门视频的最高点击量。\n在下表中，您可以看到根据播放量排名前3位的热门视频。这些热门视频出现在热门排行榜上时拥有的浏览量比任何其他热门视频都要多。此表仅考虑了独特的趋势视频(了解更多信息)。\n现在我们来看看热门视频的点击量分布情况。下面的直方图显示了此分布：\n请注意，y轴是对数缩放的。是10,100,1000…。不是10、20、30…。\n我们可以看到，绝大多数热门视频在成为热门视频时的点击量都不到2000万次。事实上，当它们成为热门视频时，大约94%的热门视频的点击量不到1000万次，大约99.9%的视频点击量不到1亿次。\n现在，我们可能会问：点击量最少的热门视频是什么？下表显示了出现在趋势列表中点击量最低的3个趋势视频。此表仅考虑了独特的趋势视频(了解更多信息)。\n你可以看到，这三个视频在发布当天就出现在了趋势排行榜上。也许他们在发布后的最初几个小时内就收到了大量的浏览量，这将他们送上了趋势排行榜。\n我们之前提到过，在超过一天的时间里，出现在热门排行榜上的视频很多。我们现在只考虑每个视频的第一次出现。我们想知道一段热门视频在第一次成为热门视频时有多少点击量。\n下图显示了趋势视频首次出现在趋势列表中时的观看次数分布：\n请注意，y轴是对数缩放的。是10,100,1000…。不是10、20、30…。\n我们可以看到，有一段视频在点击量达到1.5亿次时成为了热门。我们可以看到另一个当它有大约6000万点击量时变得流行起来。但当点击量不到3000万次时，大多数视频都成为了热门。\n90%的热门视频在点击量低于2752317次时首次成为热门。\n一段视频在第一次成为热门时的最低点击量是53,796次。\n当视频第一次成为热门时，它的平均点击量为1,387,466次。中位数(第50个百分位值)为777,510次。\n有些视频不会只在一天内出现在热门排行榜上，也不会在两天内出现。有一些视频在热门榜上出现了30天。下表显示了趋势列表中出现次数最多的视频。在趋势排行榜上出现了30天的视频有6个。\n标题是每个视频的重要组成部分。在决定是否点击视频之前，他们会为人们描述视频。正因为如此，视频标题是决定视频成功与否的重要因素之一，视频标题对视频点击率(CTR)起着至关重要的作用。以下是关于2019年热门视频标题的一些有趣的事实。\n6%的热门视频标题都是全大写的(如下图所示)。这不考虑数字、符号和表情符号。例如，以下所有标题都被认为是全大写的：“First Title”、“Second Title”、“#3 Title🎉”。\n如果我们计算每个趋势视频标题中全大写单词的数量，我们会得到以下分布图：\n这意味着大约50%的流行视频的标题中没有全大写的单词，大约20%的标题中有1个全大写的单词，大约10%的标题中有2个全大写的单词，以此类推。\n有没有一些词在热门视频标题中比其他词出现得更多？为了找到答案，我分析了所有热门视频的标题，并统计了这些标题中每个单词的出现次数。在此之前，单词中的符号被删除，缩写被它们的扩展所取代。例如，“are‘t”和“we’ll”分别被替换为“are not”和“we will”。\n以下是热门标题中最常见的100个单词的词云。单词的大小反映了它的普遍程度：\n你可以看到最常见的单词是“the”，因为它是最大的。您还可以看到大的“a”、“to”和“in”。这样的话被称为“停用词”。停用词是在给定语言(在我们的例子中是英语)中非常常见的词。为了获得更好的结果，我们将从我们的分析中排除停用词。\n我们现在可以更有意义地看到流行视频标题中最常见的词。要查看确切的共性(频率)值，下表显示了最常见的15个单词及其频率：\n有关单词标记化的过程、方法、停用单词规范等的更多详细信息，请查看项目笔记本中的代码。\n现在让我们来看看热门视频标题中最常见的符号是什么。以前，我们忽略符号来生成上面的单词Cloud。现在，我们将只考虑符号。下表显示了最常见的符号：\n我们可以看到，“-”是出现频率最高的符号。它在热门标题中出现了大约2.3万次。紧随其后的是烟斗“|”，它在热门标题中出现了大约21000次。然后我们找到“。”它发生了16,560次。\n现在只考虑表情符号，让我们来看看热门视频标题中最常见的表情符号：\n因此，🔥是最常见的，频率为154%，其次是™️，然后是®。\n但首先，什么是2克？2-gram是由2个单词组成的序列。例如，如果我们有这样一句话：“您今天好吗？”，那么我们可以从中提取三个2克单词：“您好吗”、“您好吗？”、“您今天好吗？”\n如果我们从所有热门视频标题中提取2-gram，那么最常见的是什么？下面的单词“云”回答了这个问题。请注意，每个2-gram的单词都用“-”连接。\n在“云”这个词中，我们可以看到一些趋势：我们可以看到“反应”、“反应”、“复仇者终极游戏”、“星球大战”、“安瓦尔·吉巴维”等等。\n热门视频标题有多长？下面的框图通过显示标题长度的分布来回答这个问题。\n我们可以看到，大多数热门视频的标题长度在36到64个字符之间。标题的平均长度为51个字符。最大标题长度为100，这是YouTube上的最大标题长度限制，最小标题长度为3。实际上，有一个标题长度为3的视频，就是这个名为“DHL”的视频，它在热搜榜上出现了7天：\n我们可以看到，Linus Tech Tips是拥有最多热门视频(365个视频)的频道。令人惊讶的是，这是一个科技频道！该频道始于2008年，目前(2020年6月22日)发布了5018个视频。现在看起来是这样的：\n热门视频最多的第二个频道是Babish，有361个热门视频。这个频道始于2006年，现在已经发布了311个视频。现在看起来是这样的：\n最后，热门视频数量排名第三的频道是Bon Appétit，拥有355个热门视频。这个频道始于2008年，现在已经发布了1149个视频。频道页面现在的外观如下所示：\nYouTube将视频分类。示例类别有：娱乐、音乐、体育、喜剧、教育等。下面的条形图显示了每个类别的趋势视频数量。该图表没有包括所有类别，因为有一些类别在2019年没有热门视频。\n娱乐类以20849个热门视频位居第一(占2019年热门视频的28.6%)。在娱乐之后是音乐类别，有10236个趋势视频(占2019年趋势视频的14%)。紧随其后的是体育类别，有7565个趋势视频(占2019年趋势视频的10.4%)。\n通过查看这张图表，可以了解哪些类型的视频比其他类型的视频更多地出现在趋势排行榜上。\n周六发布的热门视频比周一多吗？晚上发布的热门视频比早上多吗？让我们用漂亮的视觉效果来回答这些问题。\n注：以下两个图表显示了以GMT时区表示的日期/时间，该时区现在比华盛顿特区早4小时。\n下图显示了一周内每天发布的趋势视频数量，按视频数量排序：\n我们可以看到，周二发布的热门视频(11,986个)比一周中的其他几天都多。一周中除星期六以外的其他日子都与周二相差不远。周六，它上只发布了7345个热门视频。\n下图显示了一天中每小时发布的趋势视频数量，从0开始，代表上午12点，以23结束，代表晚上11点：\n我们可以看到，发布热门视频的高峰期是16点到18点(即下午4点到6点)。如果我们将其转换为华盛顿时间(实际上是夏令时)，我们会看到高峰时间在华盛顿时间下午12点到2点之间。\n我们还可以看到，在华盛顿时间上午2点到7点之间(实际上是夏令时)，6点到11点(即6点到11点之间)发布的热门视频要少得多。\n上面的两个图表并不一定意味着周二发布的视频成为热门的可能性更高，因为总体来说，周二可能是上传视频更多的一天。因此，我们需要知道2019年一周内每天发布的所有视频(而不仅仅是热门视频)的数量，才能做出这样的声明。同样的道理也适用于一天中的几个小时。\n热门视频有多少评论？下面的直方图通过显示我们热门视频的评论数量分布来回答这个问题：\n请注意，y轴是对数缩放的。是10,100,1000…。不是10、20、30…。\n我们可以看到，绝大多数热门视频的评论都在10万条以下。更准确地说，98.7%的热门视频的评论少于10万条，90%的热门视频的评论少于23926条。\n我们可以注意到，有一些视频的评论数量很大：我们看到一个视频有大约310万条评论；我们还看到其他几个视频的评论数量在60万到310万之间。\n下表显示了根据评论数量排名前3位的热门视频：\n我们可以看到，BTS乐队的“恋爱男孩”拥有最多的评论(3120,684条)。我们之前看到这首歌的点击量也是最多的。这首歌之后是YouTube Rewind 2018视频，有2439,661条评论，然后是BlackPink乐队的“Kill This Love”歌曲，有1051,015条评论。\n就像我们对点击量所做的那样，当乳清第一次出现在热门榜单上时，我们将看到视频的评论数量。下图向我们展示了这一点：\n请注意，y轴是对数缩放的。是10,100,1000…。不是10、20、30…。\n我们可以看到，绝大多数视频在第一次出现在热门排行榜时，评论都不到5万条。事实上：\n90%的热门视频在评论少于14485条时首次成为热门。\n一段视频第一次成为热门时，最少只有7条评论。\n当视频第一次成为热门时，它的平均评论数量为7718条。中位数(第50个百分位值)为3056条评论。\n类似于我们对查看和评论所做的操作，我们希望看到热门视频的喜欢/厌恶数量的分布情况。下面的直方图显示了点赞分布：\n请注意，y轴是对数缩放的。是10,100,1000…。不是10、20、30…\n95%的热门视频点赞不到50万个，72.4%的点赞不到10万个。\n然后我们转向厌恶。此直方图显示了对我们的热门视频的厌恶分布：\n请注意，y轴是对数缩放的。是10,100,1000…。不是10、20、30…。\n99.4%的热门视频不喜欢10,000个，91.5%的不喜欢不超过10,000个。\n我们可以看到，2018年和2019年的YouTube倒带视频是2019年最不受欢迎的两个趋势视频。请注意，表中三个视频的不喜欢数量大于喜欢数量，但尽管如此，它们还是成为了热门。\n正如我们上面看到的那样，虽然“恋爱男孩”是最受欢迎的热门视频，但它也是最不受欢迎的视频的第5位，有446,003个不喜欢的视频。\n换句话说，一段视频从发布到出现在趋势排行榜之间有多少天？下面的框图可以回答这个问题：\n平均而言，一段视频在发布5.6天后就会出现在热门榜单上。此外，95%的视频在不到13天的时间里就出现在了热门榜单上。我们还可以看到，在不到一天的时间里，就有一些视频登上了热搜榜。\n现在，如果我们只考虑视频在趋势列表中的第一次出现，我们会得到这个框图：\n在这种情况下，视频平均需要1.5天才能成为热门。97%的视频在发布后不到2天就出现在热门榜单上。\n我们知道每个YouTube视频都可以有一个描述，并且最多。\n..", "note_en": "Around 1.5 years ago, I did an  analysis of YouTube trending videos in US. That analysis was performed on trending videos of some months in 2017 and 2018. The analysis received a lot of interest on  Kaggle and  Reddit; I also received some emails praising the work done. That was 1.5 years ago.\n Today, I present an improved and expanded version of that analysis. This analysis is more advanced and contains new interesting elements. In this analysis,  All trending videos for the whole year of 2019 were analyzed (More than  70,000 videos).\n Titles, descriptions, thumbnails, tags, views, likes/dislikes, and comments were all analyzed to produce the results shown in this post. Continue reading to know more about the analysis and the data or you can  jump directly to the results section.\n  YouTube, as you know, is the most popular and most used video platform in the world today. YouTube has  a list of  trending videos. I’ll quote the description of trending videos from  YouTube itself:\n Trending helps viewers see what’s happening on YouTube and in the world. Trending aims to surface videos that a wide range of viewers would find interesting. Some trends are predictable, like a new song from a popular artist or a new movie trailer. Others are surprising, like a viral video. Trending isn’t personalized and displays the same list of trending videos in each country to all users.\n  The list of trending videos is updated roughly every 15 minutes. With each update, videos may move up, down, or stay in the same position in the list.\n  The main goal of the analysis is to find interesting facts and patterns by exploring the data and by using effective visualizations.\n  Which videos appeared on the trending list the most (because some videos might appear on the trending list for more than one day)?\n    What are the title lengths of the trending videos? What is the average/minimum/maximum title length?\n    What are the top categories of trending videos? Are “Entertainment” videos more trending than “Gaming” videos?\n    How many days are between publishing a video and its first appearance on the trending list?\n      What are the most common objects in the thumbnails of trending videos? (Running AI object detection algorithm on all thumbnails)\n   This analysis was performed using Python and a powerful group of Python libraries including Pandas, Matplotlib, NLTK, ImageAI, WordCloud, and more.\n   You can find all the code used for this analysis in a Jupyter notebook  on this link. Feel free to read the code and re-use it however you want. Also note that the notebook contains more analyses than the ones shown here in this post, so if you want to see everything, refer to the notebook after you finish reading this post.\n  The data used in this analysis was retrieved using YouTube API. A script was scheduled to run  each day throughout 2019 and fetch data from YouTube API about the trending videos of that day. The script would then process the data received from YouTube and store them in text files.\n The scraping script is not my work. It can be found on Github:   Trending-YouTube-Scraper. I put the script on a AWS EC2 instance and scheduled it—using Crontab—to run every day at a specific time.\n After 2019 ended, I connected to the AWS instance using FileZilla application and downloaded all the data produced by the script. There was a file for each day of 2019. To perform the analysis, I needed to process the data in order to merge the files into a single CSV file.\n If you want to  download the data used in this analysis which describes 2019&#39;s trending videos in the United States, you can buy it securely on Gumroad    on this link or by using the button below. Along with United States, you&#39;ll also get trending-videos data for United Kingdom, Canada, Denmark, Malaysia, Saudi Arabia, and other countries as well.\n  In this post, United-States trending videos will be analyzed, which constitute a total of  72,994 videos. YouTube usually place 200 videos in the trending list each day which would mean that we should have 73,000 (365 x 200) videos. We have 72,994. This is probably because on a few days, the number of Trending videos was slightly less than 200.\n So we have data on 72,994 trending videos to analyze. On YouTube,  the same video might appear on the trending list for many days. This means that the 72,994 videos are not unique videos. In fact, among the 72,994 videos,  we have 11,177 unique videos.\n In other words, 11,177 videos showed on the trending list throughout 2019. Some of them might have stayed on the list for 10 days, some for 20 days, etc. We will see later in the analysis more info about this.\n The following table shows an example of  the data that we have for each video:\n   As we can see, we have the ID of the video which is a unique value for the video across YouTube (No two videos have the same ID). We also have the title of the video, its publishing date and time, the channel that published it, its category, and its description and tags. We also have the number of the views, likes, dislikes, and comments of the video. There are also a few more data shown in the table.\n We can see that there is a field named “trending_date”. This field specifies the date on which this video was trending. As we said earlier, the same video might appear on the trending-videos list for more than one day. This means that we might find another record in the data for the same video ID but with different “trending_date” and maybe different number of views, comments, likes, etc. (because those numbers are likely to increase from one day to another).\n   Now let’s start the best part of this post, let’s see the analysis results.\n Please note that for the following analyses,  unless otherwise stated, we applied the analysis on all of the  72,994 trending videos,  not on the unique trending videos only. The reasoning behind this is that we are interested in videos considered trending by YouTube. So if a video is considered trending for 3 days, then we believe that it has more trending power and more trending characteristics than a video that was trending for 1 day only; thus, it should have more weight. So  we include the 3 occurrences of that video in the analysis.\n For some analyses, considering only unique videos is more appropriate. When that is the case, you will see a note telling you about that.\n  The Trending Video with the Highest Number of Views is a song by BTS band named “Boy With Luv”. The video was published on 12/April/2019 and on 23/04/2019, it appeared on the trending list with 195,376,667 views which is the highest number of views a trending video had in 2019.\n In the table below, you can see  the top 3 trending videos based on the number of views. These trending videos had views when they appeared on the trending list more than any other trending video. This table was produced by considering unique trending videos only ( For more).\n    And now we will look at the distribution of views for trending videos. The histogram below shows this distribution:\n    Notice that the y-axis is  log scaled. It is 10, 100, 1000… not 10, 20, 30…\n We can see that the vast majority of trending videos had less than 20 million views when they became trending. In fact, when they became trending, around  94% of trending videos had less than 10 million views and around 99.9% had less than 100 million views.\n Now, we might ask:  What are the trending videos with the least amount of views? The table below shows the 3 trending videos with the lowest number of views when appearing on the trending list. This table was produced by considering unique trending videos only ( For more).\n    You can see that these three videos appeared on the trending list on the same day they were published on. Maybe they received a high number of views in the first few hours after they were published which sent them to the trending list.\n  We mentioned earlier that there were many videos that appeared on the trending list on more than one day. We now want to consider the first appearance only of each video. We want to know how many views a trending video had when it became trending for the first time.\n The following graph shows the distribution of the number of views of trending videos when first appearing on the trending list:\n    Notice that the y-axis is  log scaled. It is 10, 100, 1000… not 10, 20, 30…\n We can see that there is one video that became trending when it had ~150 million views. We can see another one that became trending when it had ~60 million views. But most of the videos became trending when they had less than ~30 million views.\n  90% of trending videos became trending for the first time when they had less than  2,752,317 views.\n  The  minimum number of views a video had when it first became trending was  53,796 views.\n  The average number of views a video had when it first became trending was  1,387,466 views. The median (the 50th percentile value) was  777,510 views.\n  Some videos don’t appear on the trending list for only one day, nor for two days. There are some videos that appeared on the trending list for  30 days. The following table shows the videos that appeared on the trending list the most. There are 6 videos that appeared for 30 days on the trending list.\n         Titles constitute an important part of each video. They describe the video for people before deciding to click on the video or not. And because of that, video title is one of the important factors in video success; video title plays an essential role in determining video  click-through-rate (CTR). Here are some interesting facts about 2019’s trending-videos titles.\n 6% of trending-videos titles are fully uppercase (LIKE THIS). Numbers, symbols, and emojis are not taken into account for this. For example, all the following titles are considered fully uppercase: “FIRST TITLE”, “2ND TITLE”, “#3 TITLE 🎉”.\n  If we count the number of fully-uppercase words in each of the trending-videos titles we get the following distribution graph:\n    This means that around 50% of trending videos have no fully-uppercase word in their titles, around 20% have 1 fully-uppercase word in their titles, around 10% have 2 fully-uppercase words in their titles, etc.\n  Are there some words that occur in trending video titles more than others? To find out the answer, I analyzed the titles of all trending videos and counted the occurrences of each word in those titles. Before that, symbols were removed from the words and contractions were replaced with their expansions. For example, “aren’t” and “we’ll” were replaced with “are not” and “we will” respectively.\n Here is a word cloud of the most common 100 words in the trending titles. The size of the word reflects how common it is:\n    You can see that the most common word is “the” because it is the largest. You can also see large “a”, “to”, and “in”. Such words are called  stop words. Stop words are words that are very common in a given language (English in our case). To get better results, we will exclude stop words from our analysis.\n     We can now see more meaningfully the most common words in trending-videos titles. To see the exact commonness (frequency) values, the following table shows the most common 15 words with their frequencies:\n    For more details on the process, method used for word tokenization, stop words specifications, etc., please review the code in the project notebook.\n Now let’s see what are the  most common symbols in the titles of trending videos. Previously, we ignored symbols to produce the word clouds above. Now, we will consider only symbols. The table below shows the most common symbols:\n    We can see that “ -” is the most occurring symbol. It occurred around  23,000 times in trending titles. After that comes the pipe “|” which occurred around 21,000 times in trending titles. Then we find “.” which occurred 16,560 time.\n Now considering only emoji symbols, let’s see the  most common emojis in the titles of trending videos:\n    So 🔥 is the most common with frequency of 154 followed by ™️ then ®.\n   But first, what are 2-grams? A 2-gram is a sequence of 2 words. For example, if we have the following sentence: “How are you today?”, then we can extract three 2-grams out of it: “How are”, “are you”, “you today?”.\n If we extract the 2-grams from all trending-videos titles, what will be the most common ones? The word cloud below answers this question. Notice that the words of each 2-gram are connected with a “-“.\n        In the word cloud, we can identify some trends: we can see “reacts to”, “react to”, “avenger endgame”, “star wars”, “anwar jibawi”, etc.\n  How long are trending-videos titles? The following box plot answers this question by showing the distribution of titles lengths.\n    We can see that most trending videos have a title length between 36 and 64 characters. The average title length is 51 characters. The maximum title length is 100 which is the maximum title limit on YouTube and the minimum title length is 3. There is, actually, one video with a title length of 3 which is this video titled “DHL” which appeared on the trending list for 7 days:\n         We can see that   Linus Tech Tips is the channel with most trending videos (365 videos). And the surprise is that it is a technology channel! This channel started in 2008 and has now (22/June/2020) 5,018 published videos. This is how it looks now:\n            The second channel with most trending videos is  Binging with Babish with 361 trending videos. This channel started in 2006 and has now 311 published videos. This is how it looks now:\n            And finally,  the third top channel in the number of trending videos is  Bon Appétit with 355 trending videos. This channel started back in 2008 and has now 1,149 published videos. This is how the channel page looks like now:\n             YouTube groups videos into categories. Example categories are: Entertainment, Music, Sports, Comedy, Education, etc. The following bar chart shows  the number of trending videos for each category. The chart doesn’t include all categories because there are some categories with no trending videos in 2019.\n   Entertainment category comes first with 20,849 trending videos (28.6% of 2019’s trending videos). After Entertainment comes  Music category with 10,236 trending videos (14% of 2019’s trending videos). Then at the third place comes  Sports category with 7,565 trending videos (10.4% of 2019’s trending videos).\n Looking at this graph gives an idea on what types of videos appear on the trending list more than others.\n  Were there more trending videos published on Saturday more than on Monday? Were there more trending videos published in the evening more than the morning? Let’s answer these questions with nice visualizations.\n Note: The following two graphs show dates/times in GMT time zone which is now 4 hours ahead of Washington, DC.\n The following graph shows the number of trending videos published in every day of the week sorted by the number of videos:\n    We can see that there were more trending videos published on  Tuesday (11,986) than the other days of the week. All other days of the week except Saturday are not far behind Tuesday. For Saturday, there were only 7,345 trending videos published on it.\n The following graph shows the number of trending videos published in every hour of the day starting with 0 which represents 12 AM and ending with 23 which represents 11 PM:\n    We can see that the peak hours for publishing trending videos were between 16 and 18 (i.e. between 4 PM and 6 PM). If we translate this to Washington time (with daylight saving time in effect), we see that  the peak hours were between 12 PM and 2 PM Washington time.\n We can also see that much fewer trending videos were published between 6 and 11 (i.e. between 6 AM and 11 AM) which is between 2 AM and 7 AM in Washington time (with daylight saving time in effect).\n The two graphs above don’t  necessarily mean that videos published on Tuesday have higher chances of becoming trending because Tuesday might be the day that witnessed more uploaded videos in general than other days. So we need to know the number of all videos (not just trending videos) that were published on each day of the week in 2019 to be able to make such claims. The same applies for hours of the day as well.\n  How many comments trending videos have? The histogram below answers this question by showing the distribution of the number of comments for our trending videos:\n    Notice that the y-axis is log scaled. It is 10, 100, 1000… not 10, 20, 30…\n We can see that the vast majority of trending videos have less than 100,000 comments. More precisely, 98.7% of trending videos have less than 100,000 comments and 90% of trending videos have less than 23,926 comments.\n We can notice that there are some videos with huge numbers of comments: we see one video with ~3,100,000 comments; we also see other few videos with numbers of comments ranging between 600,000 and 3,100,000.\n The table below shows the  top 3 trending videos based on the number of comments:\n    We can see that “Boy With Luv” song by BTS band had the largest number of comments (3,120,684). We saw previously that this song had the largest number of views as well. After this song comes YouTube Rewind 2018 video with 2,439,661 comments then “Kill This Love” song by BLACKPINK band with 1,051,015 comments.\n  Like we did with the number of views, we will see the number of comments videos have when whey appear on the trending list for the first time. The following graph shows us that:\n    Notice that the y-axis is log scaled. It is 10, 100, 1000… not 10, 20, 30…\n We can see that the vast majority of videos had less than 50,000 comments when they first appeared on the trending list. In fact:\n 90% of trending videos became trending for the first time when they had less than  14,485 comments.\n  The  minimum number of comments a  video had when it first became trending was  7 comments only.\n  The average number of comments a video had when it first became trending was  7,718 comments. The median (the 50th percentile value) was  3,056 comments.\n  Similar to what we did with views and comments, we want to see the distribution of the number of likes/dislikes for trending videos. The histogram below shows the likes distribution:\n    Notice that the y-axis is log scaled. It is 10, 100, 1000… not 10, 20, 30…\n 95% of trending videos have less than 500,000 likes and 72.4% have less than 100,000 likes.\n     Then we move to dislikes. This histogram shows the distribution of dislikes of our trending videos:\n    Notice that the y-axis is log scaled. It is 10, 100, 1000… not 10, 20, 30…\n 99.4% of trending videos have less than 100,000 dislikes and 91.5% have less than 10,000 dislikes.\n     We can see that YouTube Rewind videos of 2018 and 2019 are the two most disliked trending videos in 2019. Note that the number of dislikes for the three videos in the table is larger than the number of likes but they became trending despite that.\n And although “Boy With Luv” song was the most liked trending video as we saw above, it is also the 5th most disliked video with 446,003 dislikes.\n  In other words, how many days are between publishing a video and its appearance on the trending list? The box plot below can answer this question:\n    On average, a video appears on the trending list after 5.6 days of publishing it. Also, 95% of the videos took less than 13 days to appear on the trending list. We can also see that there were some videos that appeared on the trending list in less than a day.\n Now if we consider only the first appearance of a video on the trending list, we get this box plot:\n    In this case, the video takes on average 1.5 days to become trending. And 97% of the videos appeared on the trending list in less than 2 days after they were published.\n   We know that each YouTube video can have a description and that the maximum\n......", "posttime": "2020-07-08 05:08:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,美国,热门,视频", "title": "我分析了美国所有YouTube热门视频整整一年", "title_en": "I analyzed all YouTube trending videos in US for a whole year", "transed": 1, "url": "https://ammar-alyousfi.com/2020/youtube-trending-videos-analysis-2019-us", "via": "", "real_tags": ["youtube", "美国", "热门", "视频"]}]