[{"category": "", "categoryclass": "", "imagename": "1afba9c92023964a9f50f4c4fe72bf0c.jpg", "infoid": 1030463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雅伦·辛格(Yaron Singer)在对抗性机器学习方面的工作推动了他在哈佛大学(Harvard)在七年内爬上终身教职阶梯，成为正式教授。对抗性机器学习是一种使用误导性数据愚弄人工智能模型的方法。现在，辛格与一名前博士导师和两名前学生共同创立的初创公司Robust Intelligence正在悄悄走出困境，将他的研究推向市场。\n今年，人工智能将占到500亿美元的企业支出，尽管企业仍在研究如何将这项技术应用到他们的业务流程中。各公司也仍在研究如何保护他们的好人工智能免受坏人工智能的影响，比如通过算法生成的语音深度假，它可以欺骗语音身份验证系统。\n“在互联网的早期，它被设计成每个人都是好演员。然后，人们开始建造防火墙，因为他们发现并不是每个人都是这样的，“谷歌前工程高级副总裁比尔·考夫兰(Bill Coughran)说。“我们看到同样的迹象发生在这些机器学习系统上。哪里有钱，哪里就有坏演员。“。\n进入Robust Intelligence，这是一家由首席执行官辛格领导的新创业公司，该公司表示，该公司的平台经过培训，可以检测100多种对抗性攻击。尽管其创始人和团队中的大多数人都有剑桥血统，但这家初创公司已经在旧金山设立了总部，并于周三宣布，它在由红杉(Sequoia)牵头的种子和首轮融资中筹集了1400万美元。Coughran现在是这家风险投资公司的合伙人，他是此次融资的主要投资者，工程资本(Engineering Capital)和鱼叉风险投资公司(Harpoon Ventures)也参与了此次融资。\n辛格在加州大学伯克利分校(University Of California At Berkeley)获得计算机科学博士学位后，于2011年加入谷歌担任博士后研究员。他花了两年时间研究算法和机器学习模型，以使这家科技巨头的产品运行得更快，并看到人工智能在坏数据的情况下是多么容易脱轨。\n他说：“一旦你开始看到这些漏洞，就会变得非常非常可怕，特别是当我们考虑到我们多么想使用人工智能来自动化我们的决策时。”\n欺诈者和其他不良行为者可以利用人工智能模型在处理陌生数据方面的相对僵化。例如，辛格说，401美元的支票可以通过添加几个人眼看不见的像素来操纵，但会导致人工智能模型将支票错误地读取为701美元。辛格说：“如果诈骗者拿到支票，他们就可以侵入这些应用程序，并开始大规模地这样做。”对数据输入的类似修改可能导致欺诈性金融交易，以及欺诈性语音或面部识别。\n2013年，辛格在哈佛大学担任助理教授后，决定将研究重点放在设计保护人工智能模型的机制上。Robust Intelligence来自辛格近十年的实验室工作，在此期间，他与三名哈佛学生合作，他们后来成为辛格的联合创始人：辛格指导的博士生埃里克·巴尔坎斯基(Eric Balkanski)；研究生亚历山大·莱利(Alexander Rilee)；以及与辛格共同撰写学术论文的本科生大叶幸津(Kojin Oshiba)。在25篇论文中，辛格的团队在设计算法以检测误导性或欺诈性数据方面取得了突破性进展，并帮助使这个问题引起了政府的关注，甚至获得了Darpa的早期拨款来进行研究。Rilee和Oshiba仍在参与Robust的日常活动，前者涉及政府和市场，后者涉及安全、技术和产品开发。\n鲁棒智能将推出两种产品，一种是人工智能防火墙，另一种是“红色团队”产品，在这些产品中，强大的功能就像敌对的攻击者。防火墙的工作原理是围绕组织现有的人工智能模型，通过Robust的算法扫描受污染的数据。另一款产品名为Rime(或“Robust Intelligence Machine Engine”)，它通过输入基本错误并故意对模型发起对抗性攻击，对客户的AI模型进行压力测试，看看它是如何站稳脚跟的。\n辛格说，这家初创公司目前正在与大约10个客户合作，其中包括一家大型金融机构和一家领先的支付处理商，但由于保密，Robust不愿透露任何名字。辛格秘密推出，希望获得更多客户，并将团队规模扩大一倍，目前团队有15名员工。正从哈佛大学休假的辛格对自己在学术界的未来感到羞怯，但他表示，目前他专注于自己在旧金山的首席执行官职位。\n“对我来说，我已经攀登了哈佛大学的终身教职这座山，但现在我认为我们找到了一座更高的山，那座山正在确保人工智能的安全，”他说。", "note_en": "Yaron Singer climbed the tenure track ladder to a full professorship at Harvard in seven years, fueled by his work on adversarial machine learning, a way to fool artificial intelligence models using misleading data. Now, Singer’s startup, Robust Intelligence, which he formed with a former Ph.D. advisee and two former students, is emerging from stealth to take his research to market.\n  This year, artificial intelligence is set to account for $50 billion in corporate spending, though companies are  still figuring out how to implement the technology into their business processes. Companies are still figuring out, too, how to protect their good AI from bad AI, like an algorithmically generated voice deepfake that can spoof voice authentication systems.\n “In the early days of the internet, it was designed like everybody’s a good actor. Then people started to build firewalls because they discovered that not everybody was,” says Bill Coughran, former senior vice president of engineering at Google. “We’re seeing signs of the same thing happening with these machine learning systems. Where there’s money, bad actors tend to come in.”\n Enter Robust Intelligence, a new startup led by CEO Singer with a platform that the company says is trained to detect more than 100 types of adversarial attacks. Though its founders and most of the team hold a Cambridge pedigree, the startup has established headquarters in San Francisco and announced Wednesday that it had raised $14 million in a seed and Series A round led by Sequoia. Coughran, now a partner at the venture firm, is the lead investor on the fundraise, which also comes with participation from Engineering Capital and Harpoon Ventures.\n  Singer followed his Ph.D. in computer science from the University of California at Berkeley, by joining Google as a postdoctoral researcher in 2011. He spent two years working on algorithms and machine-learning models to make the tech giant’s products run faster, and saw how easily AI could go off the rails with bad data.\n “Once you start seeing these vulnerabilities, it gets really, really scary, especially if we think about how much we want to use artificial intelligence to automate our decisions,” he says.\n Fraudsters and other bad actors can exploit the relative inflexibility of artificial intelligence models in processing unfamiliar data. For example, Singer says, a check for $401 can be manipulated by adding a few pixels that are imperceptible to the human eye yet cause the AI model to read the check erroneously as $701. “If fraudsters get their hands on checks, they can hack into these apps and start doing this at scale,” Singer says. Similar modifications to data inputs can lead to fraudulent financial transactions, as well as spoofed voice or facial recognition.\n  In 2013, upon taking an assistant professor position at Harvard, Singer decided to focus his research on devising mechanisms to secure AI models. Robust Intelligence comes from nearly a decade in the lab for Singer, during which time he worked with three Harvard pupils who would become his cofounders: Eric Balkanski, a Ph.D. student advised by Singer; Alexander Rilee, a graduate student; and undergraduate Kojin Oshiba, who coauthored academic papers with the professor. Across 25 papers, Singer’s team broke ground on designing algorithms to detect misleading or fraudulent data, and helped bring the issue to government attention, even receiving an early Darpa grant to conduct its research. Rilee and Oshiba remain involved with the day-to-day activities at Robust, the former on government and go-to-market, and the latter on security, technology and product development.\n Robust Intelligence is launching with two products, an AI firewall and a “red team” offering, in which Robust functions like an adversarial attacker. The firewall works by wrapping around an organization’s existing AI model to scan for contaminated data via Robust’s algorithms. The other product, called Rime (or “Robust Intelligence Machine Engine”), performs a stress test on a customer’s AI model by inputting basic mistakes and deliberately launching adversarial attacks on the model to see how it holds up.\n The startup is currently working with about ten customers, says Singer, including a major financial institution and a leading payment processor, though Robust will not name any names due to confidentiality. Launching out of stealth, Singer hopes to gain more customers as well as double the size of the team, which currently stands at 15 employees. Singer, who is on leave from Harvard, is sheepish about his future in academia, but says he is focused on his CEO role in San Francisco at the moment.\n “For me, I’ve climbed the mountain of tenure at Harvard, but now I think we’ve found an even higher mountain, and that mountain is securing artificial intelligence,” he says.", "posttime": "2020-10-22 11:31:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,走出,series,辛格", "title": "Robust Intelligence帮助开发人员以安全的方式部署AI模型，凭借由红杉(Sequoia)牵头的1400万美元种子和首轮融资走出了隐形状态", "title_en": "Robust Intelligence, which helps developers deploy AI models in a secure manner, comes out of stealth with $14M in seed and Series A funding led by Sequoia", "transed": 1, "url": "https://www.forbes.com/sites/kenrickcai/2020/10/21/robust-intelligence-adversarial-machine-learning-series-a-sequoia/", "via": "", "real_tags": ["开发", "走出", "series", "辛格"]}, {"category": "", "categoryclass": "", "imagename": "ef8992ce33f33fbe94dd7a15e3fd00e7.png", "infoid": 1030462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论媒体操纵策略是用来散布对社会机构的不信任，还是用来破坏权力关系的稳定，还是用来伤害人和社区，我们都提供了一个描述这些攻击的通用词汇。\n查看所有定义", "note_en": "Whether media manipulation tactics are used to sow distrust in social institutions, to destabilize relations of power, or to inflict harm on people and communities, we offer a common vocabulary for describing these attacks.\n   See all definitions", "posttime": "2020-10-22 11:27:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操纵,manipulation,用来", "title": "媒体操纵案例手册", "title_en": "The Media Manipulation Casebook", "transed": 1, "url": "https://mediamanipulation.org/", "via": "", "real_tags": ["操纵", "用来"]}, {"category": "", "categoryclass": "", "imagename": "bc310f20d36787df57a738273da5498d.jpg", "infoid": 1030461, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从美学和环保的角度来看，木材都被认为是一种很有吸引力的建筑材料。建造有用的木制品需要复杂的结构和将部件连接在一起的方法。研究人员创造了一种新颖的3D设计应用程序，极大地简化了设计过程，并提供了铣床指令，以高效地生产设计的部件。这些设计不需要钉子或胶水，这意味着使用该系统制造的物品可以很容易地组装、拆卸、重复使用、维修或回收。\n木工是一种和人类本身一样古老的做法。艺术和工程各占一半，它比喻地和字面上塑造了我们周围的世界。然而，尽管木工无处不在，但它是一项困难和耗时的技能，导致家具等手工木制品的价格相对较高。由于这个原因，我们周围的许多木制家具往往，至少在某种程度上，是由机器制造的。一些机器可以高度自动化，并通过人类设计师在计算机上创建的设计进行编程。这本身就可能是一个非常技术性和创造性的挑战，到目前为止，许多人都无法企及。\n东京大学创意信息学系的研究人员已经创建了一个3D设计应用程序，可以快速、轻松、高效地创建结构木构件。他们称之为Tsugite，日语中细木工的意思，通过一个简单的3D界面，在木工或3D设计方面经验很少或没有经验的用户可以在几分钟内创建功能木结构的设计。然后，这些设计可以指示铣床雕刻结构部件，然后用户可以按照屏幕上的说明将这些结构部件拼接在一起，而不需要额外的工具或粘合剂。\n“我们的目的是让没有特殊经验的人可以接触到细木工艺术。当我们在用户研究中测试界面时，3D建模新手不仅设计了一些复杂的结构，而且还喜欢这样做，“研究人员Maria Larsson说。“Tsugite使用起来很简单，因为它可以引导用户一步一步地完成这个过程，从一系列现有的设计开始，然后可以根据不同的目的对这些设计进行修改。但更高级的用户可以直接跳转到手动编辑模式，以获得更自由的创造力。\nTsugite为用户提供了木接缝的详细视图，即所谓的体素，本质上是3D像素，在这种情况下是小立方体。这些体素可以在要连接的组件的一端四处移动；这会自动调整相应组件末端的体素，从而保证它们紧密配合在一起，而不需要钉子或甚至胶水。可以连接两个或更多组件，并且软件算法将相应地调整所有组件。不同的颜色告知用户关节的属性，例如它们滑动在一起的难易程度，或者潜在的弱点等问题。\nTsugite的独特之处在于，它将制造过程直接纳入到设计中。这意味着，具有物理限制(如自由度、刀具大小等)的铣床只能给出它们能够创建的设计。3D打印机与铣床有着共同的祖先，困扰着3D打印机用户的是，3D打印机的软件并不总是能确定机器本身的行为方式，这可能会导致打印失败。\n“在计算机图形学领域，有一些关于如何对各种各样的关节几何进行建模的伟大研究。但这种方法往往缺乏对制造和材料特性的实际考虑。“Larsson说。“反过来说，结构工程和建筑领域的研究可能在这方面很深入，但他们可能只关注少数几种节点。我们看到了将这些方法的优势结合起来创建Tsugite的潜力。它可以探索各种各样的关节，但又能将它们保持在现实的物理限制之内。“。\n将制造限制纳入设计过程的另一个好处是，Tsugite的底层算法可以更容易地导航到它们可以呈现给用户的所有不同的可能性，因为那些物理上不可能的可能性根本不会作为选项提供。研究人员希望通过进一步的改进和进步，Tsugite不仅可以扩大到设计家具和小型建筑，还可以设计整个建筑。\n“根据联合国的数据，建筑和建筑业排放的二氧化碳几乎占全球排放量的40%。木材可能是我们拥有的唯一天然和可再生的建筑材料，而高效的细木工可以进一步增加可持续发展的好处，“Larsson说。例如，当木材与细木工连接时，而不是金属固定时，它减少了混合材料。这对分类和回收很有好处。此外，脱胶接头可以在不破坏建筑构件的情况下拆卸。这为建筑物在其他地方拆卸和重新组装提供了可能性。或更换有缺陷的部件。这种重复使用和维修的灵活性增加了木材的可持续性好处。“。\n参考文献：Maria Larsson，Hironori Yoshida，Nobuyuki Umetani和Takeo Igarashi，2020年10月的“Tsugite：交互式设计和制造木材关节”，第32届ACM年度用户界面软件和技术研讨会(UIST‘20)论文集。DOI：10.1145/3379337.3415899。\n这项研究得到了JST ACT-I资助号JPMJPR17UT、JSPS KAKENHI资助号17H00752和JST CREST资助号JPMJCR17A1的支持。", "note_en": "Wood is considered an attractive construction material for both aesthetic and environmental purposes. Construction of useful wood objects requires complicated structures and ways to connect components together. Researchers created a novel 3D design application to hugely simplify the design process and also provide milling machine instructions to efficiently produce the designed components. The designs do not require nails or glue, meaning items made with this system can be easily assembled, disassembled, reused, repaired, or recycled.\n Carpentry is a practice as ancient as humanity itself. Equal parts art and engineering, it has figuratively and literally shaped the world around us. Yet despite its ubiquity, carpentry is a difficult and time-consuming skill, leading to relatively high prices for hand-crafted wooden items like furniture. For this reason, much wooden furniture around us is often, at least to some degree, made by machines. Some machines can be highly automated and programmed with designs created on computers by human designers. This in itself can be a very technical and creative challenge, out of reach to many, until now.\n  Researchers from the Department of Creative Informatics at the University of Tokyo have created a 3D design application to create structural wooden components quickly, easily, and efficiently. They call it Tsugite, the Japanese word for joinery, and through a simple 3D interface, users with little or no prior experience in either woodworking or 3D design can create designs for functional wooden structures in minutes. These designs can then instruct milling machines to carve the structural components, which users can then piece together without the need for additional tools or adhesives, following on-screen instructions.\n “Our intention was to make the art of joinery available to people without specific experience. When we tested the interface in a user study, people new to 3D modeling not only designed some complex structures, but also enjoyed doing so,” said researcher Maria Larsson. “Tsugite is simple to use as it guides users through the process one step at a time, starting with a gallery of existing designs that can then be modified for different purposes. But more advanced users can jump straight to a manual editing mode for more freeform creativity.”\n  Tsugite gives users a detailed view of wooden joints represented by what are known as voxels, essentially 3D pixels, in this case small cubes. These voxels can be moved around at one end of a component to be joined; this automatically adjusts the voxels at the end of the corresponding component such that they are guaranteed to fit together tightly without the need for nails or even glue. Two or more components can be joined and the software algorithm will adjust all accordingly. Different colors inform the user about properties of the joints such as how easily they will slide together, or problems such as potential weaknesses.\n Something that makes Tsugite unique is that it will factor the fabrication process directly into the designs. This means that milling machines, which have physical limitations such as their degrees of freedom, tool size and so on, are only given designs they are able to create. Something that has plagued users of 3D printers, which share a common ancestry with milling machines, is that software for 3D printers cannot always be sure how the machine itself will behave which can lead to failed prints.\n “There is some great research in the field of computer graphics on how to model a wide variety of joint geometries. But that approach often lacks the practical considerations of manufacturing and material properties,” said Larsson. “Conversely, research in the fields of structural engineering and architecture may be very thorough in this regard, but they might only be concerned with a few kinds of joints. We saw the potential to combine the strengths of these approaches to create Tsugite. It can explore a large variety of joints and yet keeps them within realistic physical limits.”\n Another advantage of incorporating fabrication limitations into the design process is that Tsugite’s underlying algorithms have an easier time navigating all the different possibilities they could present to users, as those that are physically impossible are simply not given as options. The researchers hope through further refinements and advancements that Tsugite can be scaled up to design not just furniture and small structures, but also entire buildings.\n “According to the U.N., the building and construction industry is responsible for almost 40% of worldwide carbon dioxide emissions. Wood is perhaps the only natural and renewable building material that we have, and efficient joinery can add further sustainability benefits,” said Larsson. “When connecting timbers with joinery, as opposed to metal fixings, for example, it reduces mixing materials. This is good for sorting and recycling. Also, unglued joints can be taken apart without destroying building components. This opens up the possibility for buildings to be disassembled and reassembled elsewhere. Or for defective parts to be replaced. This flexibility of reuse and repair adds sustainability benefits to wood.”\n Reference: “Tsugite: Interactive Design and Fabrication of Wood Joints” by Maria Larsson, Hironori Yoshida, Nobuyuki Umetani and Takeo Igarashi, October 2020,  Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST ’20).  DOI: 10.1145/3379337.3415899\n This research is supported by JST ACT-I grant number JPMJPR17UT, JSPS KAKENHI grant number 17H00752, and JST CREST grant number JPMJCR17A1, Japan.", "posttime": "2020-10-22 11:27:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,接头,software,设计", "title": "简单软件创建复杂的木质接头，无需钉子、胶水", "title_en": "Simple Software Creates Complex Wooden Joints That Interlock with No Nails, Glue", "transed": 1, "url": "https://scitechdaily.com/simple-software-creates-complex-wooden-joints-that-interlock-with-no-nails-glue-or-tools-needed/", "via": "", "real_tags": ["软件", "接头", "software", "设计"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030460, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何一位成功的创始人都会告诉你，团队、产品和市场是打造成功企业的最关键因素。你可能会听到他们中的许多人谈到“客户至上”或“客户至上”。但他们成功的最被低估的因素之一不仅仅是客户，还有他们早期采用者的质量。\n虽然我们都同意早期采用者是好的，但他们并不都是生来平等的。错误的用户可能会让创业者脱轨，导致他们失去重点，解决错误的问题。就像一个糟糕的团队或糟糕的产品一样，错误的早期采用者可能会将公司推向失败。\n你应该挑剔你的服务对象，特别是在你产品开发过程的初始阶段。寻找早期采用者应该是一项类似于雇佣团队的投资。企业家应该招募、面试、鉴定早期采用者并与之合作，这将帮助他们取得最大的成功。这不是一个简单的过程，不应该想当然。\n那么，您如何找到合适的早期采用者呢？这是一个很难回答的问题。这一切都取决于你的市场、产品和判断力。但这里有一些你应该注意的特点。\n正确的早期用户深受您正在解决的问题的影响。他们知道问题存在，渴望更好的解决方案。他们可能已经尝试过其他解决方案，并渴望得到更好的解决方案。\n早期采用者将敏锐地意识到这个问题。他们将以不同的方式解释这个问题，以及它如何影响他们的工作、生活或进行某些活动的能力。他们甚至可能试图以某种方式解决这个问题，可能是使用Excel、一些无代码的应用程序、第三方工具或手动流程。\n用户有各种各样的问题。其中大部分是你永远解决不了的。其他的可能在您的路线图中，但不是今天的核心。将重点放在具有您要解决的特定问题的用户身上是至关重要的。与核心问题或潜在解决方案无关的各种系统、工作流和集成可能会出现问题。排除希望解决所有问题的用户。排除那些想要解决不同的、可能相关的问题的用户。\n最好的早期采用者需要解决特定的问题。确保它与您的愿景和产品解决方案相匹配是至关重要的。\n您为他们提供的解决方案将缓解他们的痛点，最好的早期采用者会非常兴奋地帮助您帮助他们。他们越兴奋，他们从问题中感受到的痛苦就越多。\n早期采用者是合作伙伴。他们应该很高兴与你合作，帮助你解决他们的问题，并提供反馈。他们还应该感到兴奋，因为他们将先于他人使用您的解决方案，并发展竞争优势。\n当你获得很好的早期采用者时，他们会经常和兴奋地向你发送反馈。他们会为帮助您设计解决方案而感到自豪，并感觉自己是团队中的一员。\n必须授权早期采用者快速做出决定。与您梦想中的企业客户合作听起来不错，但如果他们不能获得批准、不能快速行动或不能激活您的解决方案，您将受制于他们的官僚作风。\n与早期采用者合作是一种合作伙伴关系，而不是一种交易。重要的是，早期采用者可以采用您的原型、测试版或产品，并在他们的团队或组织中实现它。\n这个人和公司一样重要。他们是否有权做出正确的决定？他们能把时间和资源投入到问题和解决方案上吗？他们是否有能力帮助您创建正确的解决方案？如果他们不能满足这些标准，你应该找另一个可以的早期采用者。\n最好的产品是通过反复试错的过程与客户共同打造的。经历痛苦的早期采用者是不够的；您需要一个能够容忍产品开发过程中涉及的风险的合作伙伴。他们不仅具有高风险容忍度，而且还应该愿意并能够在整个过程中进行持续的实验。\n实验对这一过程至关重要。您需要确保与客户合作，该客户认识到过程是关于学习和改进的，而不是成品。\n在与客户面谈时，你应该坦率地说明这一过程，并确保他们对此感到满意。如果一个潜在的客户不能致力于这个过程，你可以保持联系，在产品开发得更好的时候邀请他们使用它，这是没有问题的。\n不要只满足于最初几个对你的产品感兴趣的客户。花时间绘制市场地图，以便更好地了解市场、行业和潜在客户。了解更多关于这些公司的信息，找出最好的联系人。联系并进行访谈，更多地了解他们的组织、问题对他们的影响，以及他们关于问题和解决方案的目标。一定要深入研究并提出尖锐的问题，以评估他们的风险承受能力、当前的解决方案，以及他们是否有权做出必要的决策。\n如果一个潜在客户看起来问题不大，你就应该离开。如果他们不能只专注于一个问题，那就继续前进。如果他们没有被授权做决定，问问他们的经理，看看你能不能往上爬。\n您应该花大量的时间了解这些客户，并选择最好的应聘者。毫不犹豫地多次联系他们，与他们交谈，以建立对你决策的信心。在您试验和制作解决方案时，这些将是合作伙伴，因此请确保找到可能的最佳合作伙伴。\n选择最好的早期采用者并不意味着其他人就不会是好的未来客户。所有这些客户现在都是潜在客户。当您达到特定的里程碑并完成更多功能时，有些可能是很好的客户；其他的可能是以后的客户。保持联系并共享有关产品和功能集的最新信息。\n招募高质量的早期采用者是困难的，但对公司的成功至关重要。提前花时间对不符合您当前愿景和使命的客户说不。虽然这一过程困难且成本高昂，但随着产品的成熟，这笔投资将是值得的。", "note_en": "Any successful founder will tell you that team, product, and market are the most critical factors to building a successful business. And you’ll probably hear many of them talk about being “customer-obsessed” or “customer first.” But one of the most underrated factors in their success is not just the customers but also the quality of their early adopters.\n While we can all agree that early adopters are good, they are not all created equal. The wrong users can derail entrepreneurs, causing them to lose focus and solve the wrong problems. Like a bad team or poor product, the wrong early adopters can push a company towards failure.\n You should be picky about who you serve, especially during the initial phase of your product development process. Finding early adopters should be an investment similar to hiring a team. Entrepreneurs should recruit, interview, qualify, and partner with early adopters that will help them become most successful. It’s not a simple process and shouldn’t be taken for granted.\n So how do you find the right early adopters? That’s a difficult question to answer. It’s all going to come down to your market, product, and judgment. But here are some characteristics that you should look for.\n  The right early users are deeply affected by the problem that you’re solving. They know the problem exists and are hungry for a better solution. They’ve probably tried other solutions and yearn for something better.\n Early adopters will be keenly aware of the problem. They will explain the problem in various ways and how it affects their ability to work, live, or perform some activity. They’ve probably even tried to solve it somehow, maybe using Excel, some no-code app, a third-party tool, or a manual process.\n  Users have all kinds of problems. Most of which you’ll never solve. Others might be in your roadmap but are not core today. It’s essential to focus on users with the specific problem that you are solving for. Problems can emerge from various systems, workflows, and integrations that have nothing to do with the core problem or your potential solution. Eliminate the users who are looking to solve all of their problems. Eliminate the users who want a different, possibly related, problem solved.\n The best early adopters need to solve a specific problem. It’s vital to ensure that it matches your vision and product solution.\n  The solution you’re offering them is going to alleviate a pain point, and the best early adopters are more than excited to help you help them. The more excited they are, the more pain they experience from the problem.\n Early adopters are partners. They should be excited about working with you, helping you solve their problem, and providing feedback. They should also be excited that they will be using your solution before others and developing a competitive edge as well.\n When you acquire great early adopters, they will be the ones sending you feedback often and with excitement. They’ll be proud to help you craft your solution and feel like their part of the team.\n  Early adopters must be empowered to make decisions quickly. Working with your dream enterprise customer sounds great, but if they can’t get approval, move quickly, or activate your solution, you’ll be at the mercy of their bureaucracy.\n Working with early adopters is a partnership, not a transaction. It’s important that early adopters can take your prototype, beta, or product and implement it within their team or organization.\n The person is as vital as the company. Are they authorized to make the right decisions? Can they dedicate the time and resources to the problem and solution? Are they empowered to help you create the right solution? If they can’t meet these criteria, you should find another early adopter who can.\n  The best products are built with customers, through an iterative process of trial and error. Early adopters who experience the pain are not enough; you need a partner who can tolerate the risks involved in the product development process. Not only do they have a high-risk tolerance, but they should also be willing and able to engage in ongoing experiments throughout the process.\n Experimentation is critical to the process. You need to ensure that you partner with a customer that recognizes the process is about learning and improvement, not a finished product.\n When interviewing customers, you should be upfront about this process and ensure they are comfortable with it. It’s okay if a potential customer can’t commit to the process, you can keep in touch and invite them to the product when it’s a bit more developed.\n  Don’t just settle for the first few customers that show interest in your product. Spend time doing market mapping to better understand the market, sectors, and potential customers. Learn more about the companies and find who the best possible contacts would be. Reach out and conduct interviews to learn more about their organization, how the problem affects them, and their goals regarding the problem and solution. Make sure to dig in and ask tough questions to assess their risk-tolerance, current solutions, and whether they are authorized to make the necessary decisions.\n If a potential customer seems like the problem isn’t that big of a deal, you should move on. If they can’t focus on just the one problem, move on. If they aren’t authorized to make decisions, ask about their manager and see if you can work your way up.\n You should spend a good amount of time learning about each of these customers and selecting the best candidates. Don’t hesitate to reach out multiple times and have conversations with them to build confidence in your decisions. These will be partners as you experiment and craft your solution, so ensure you find the best possible partners.\n  Choosing the best early adopters doesn’t mean that the others will not be good future customers. All of these customers are now leads. Some might be great customers once you hit a particular milestone and finish more features; others might be customers down the road. Keep in touch and share updates on the product and feature set.\n Recruiting high-quality early adopters is difficult but vital to the success of a company. Spend the time upfront to say no to customers that don’t fit your current vision and mission. While the process is difficult and costly, it’ll be worth the investment as the product matures.", "posttime": "2020-10-22 11:24:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "采用,adopters", "title": "早期采用者：对服务对象要挑剔", "title_en": "Early Adopters: Be Picky About Who You Serve", "transed": 1, "url": "https://www.johnkoht.com/blog/early-adopters-be-picky-about-who-you-serve", "via": "", "real_tags": ["采用", "adopters"]}, {"category": "", "categoryclass": "", "imagename": "6388bb76ed49f9a6f9b846f05d675a46.jpg", "infoid": 1030459, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位高管告诉ET，印度是Snapchat长期增长战略的关键市场，因为它的文化多样性，因为该公司在印度正见证着快速增长。本地化和本地化经验是我们印度增长战略的重要组成部分。Snapchat的母公司Snap Inc的国际市场部董事总经理纳娜·穆鲁格桑(Nana Murugesan)表示：我们目前专注于确保我们与印度人的文化相关性和地方性。在早年忽视印度之后，Snap最近通过推出本地化版本的产品，将重点放在了印度市场。这包括重新设计的Android应用程序，支持9种印度语言，以及其内容发现平台Discover的印度特有版本。本地化无疑让我们看起来更像是印度社区的本地应用程序，它确实帮助我们延续了在印度的增长势头，他说。Murugesan表示，2020年第三季度，这款昙花一现的即时通讯应用见证了来自印度的日活跃用户同比增长近150%，但没有透露任何具体细节。市场研究公司Statista的数据显示，虽然Snapchat没有提供其用户群的国别分类，但印度已经成为这款即时通讯服务在美国以外的最大市场，截至今年7月，印度拥有约3380万用户。阅读：Snapchat首席执行官埃文·斯皮格尔周三在Snapchat与分析师的财报电话会议上表示，Snap将在印度发展其应用程序，因为Snapchat的内容发现平台Discover于2018年11月在印度首次亮相，随着用户基础的激增，该平台的收视率按季度增长了近50%。该平台目前通过来自32家出版商的60多个频道提供与文化相关的精选内容，涉及各种流派，包括新闻、宝莱坞文化、美容、喜剧、烹饪和体育。新的移动优先节目为了加强其内容提供，Snap与娱乐和艺术家管理公司Only Voder，喜剧合资企业Weirdass Comedy和数字媒体公司Qyuki合作，宣布了其第一批面向印度市场的移动优先许可和原创节目。该公司还将提供其广受欢迎的原创节目手机交换的印地语版本。Snap还与MoonFrog Labs合作，成为其在印度的第一个游戏合作伙伴，后者为Snap Games打造了一个定制版本的Ludo Club，将于今年晚些时候首次亮相。与此同时，社交游戏开发商Mojiworks推出的热门抓拍游戏“Ready Chef Go”将以多萨·达什(Dosa Dash)厨房挑战的形式获得印度特色。Murugesan告诉ET，在过去的一年里，印度有超过4000万独立观众在Snapchat上观看了一个节目。阅读：Snap推出第三方迷你应用&amp；改进的开发者工具推动增强现实该公司的另一个关键重点领域是使开发人员和学生能够利用增强现实等新技术，为印度用户构建更具文化相关性的体验。Snap自称是一家相机公司。印度正在经历数字经济的爆炸式增长，许多人，特别是在Covid期间，都在努力提高自己的技能，因为他们是在家里。增强现实对我们来说是一个非常独特的机会和差异化，我们非常关注，不仅是有趣的部分，更重要的是创造性的数字技能，我们认为至关重要的学习技能。穆鲁格桑说：我们正专注于围绕它建立一个创意社区。阅读：在整个AR-Filter热潮中，Snap在过去一年里通过在珍珠学院、印度设计与创新学院(ISDI)、共生浦那和马尼帕尔理工学院等几所高中和大学举办线下和在线研讨会，培训了1000多名学生构建基于增强现实的体验。我们还在印度建立一个由专业镜片创作者组成的社区，我们称之为OLCs(官方镜片创作者)。穆鲁格桑说，目前印度大约有7个这样的创造者。Snap Inc报告称，在截至9月份的季度里，该公司营收同比增长52%，从去年的4.462亿美元增至6.787亿美元，而该公司当季净亏损从去年同期的2.27亿美元降至2亿美元。", "note_en": "India is a critical market for  Snapchat&#39;s long-term growth strategy due to its cultural diversity, a top executive told ET, as the company is witnessing rapid growth in the country.  &#34;Localisation and local experiences are a big part of our India growth strategy. We are currently focused on making sure that we are culturally relevant and local for Indians,&#34; said Nana Murugesan, managing director of International Markets at Snap Inc, the parent company of Snapchat.  After ignoring the country in its earlier years, Snap has been lately focusing on the Indian market by rolling out localised version of its offerings. This includes a re-engineered Android app with support for nine Indian languages and an India-specific version of its content discovery platform Discover.  &#34;Localisation definitely has made us look much more like a local app for the Indian community and it has really helped us continue our growth momentum in the country,&#34; he said.  The ephemeral messaging app has witnessed nearly 150% year-on-year growth in its daily active users from India in the third quarter of 2020, Murugesan said, without disclosing any specific details.  While Snapchat doesn&#39;t provide a country-wise breakdown of its member base, India has emerged as the largest market for the messaging service outside the United States, with about 33.8 million users as of July this year, according to market research firm Statista.    Read:  Snap to evolve its app for India as user base surges amid lockdown  Snapchat&#39;s content discovery platform Discover, which debuted in the country in November 2018, has seen its viewership rise nearly 50% on a quarterly basis, chief executive Evan Spiegel said in the company&#39;s earnings call with analysts on Wednesday. The platform currently offers culturally relevant curated content through over 60 channels from 32 publishers across various genres including news, Bollywood culture, beauty, comedy, cooking, and sports.   New mobile-first shows  To strengthen its content offerings, Snap has announced its first slate of mobile-first licensed and original shows for the India market in partnership with entertainment and artist management firm Only Much Louder, comedy venture Weirdass Comedy and digital media firm Qyuki. The company will also offer a Hindi version of its popular original show Phone Swap.  Snap has also roped in Moonfrog Labs as its first  gaming partner in India, which has built a custom version of &#39;Ludo Club&#39; for Snap Games, debuting later this year. Meanwhile, the popular Snap game Ready Chef Go by social game maker Mojiworks, will get an Indian touch in form of a &#39;Dosa Dash&#39; kitchen challenge. Over 40 million unique viewers in India have watched a show on Snapchat over the past year, Murugesan told ET.   Read:  Snap debuts third-party mini apps &amp; improved developer tools    Push for  Augmented Reality  Another key focus area for the firm, which bills itself as a camera company, is enabling developers and students to take advantage of new technologies like augmented reality to build more culturally relevant experiences for its users in India.  &#34;India is going through an explosion in the digital economy and a lot of people, especially during Covid are trying to upskill themselves since they are at home. Augmented Reality is a very unique opportunity and differentiation for us and we are very focused on, not just the fun parts but more importantly the creative digital skills, learning skills that we believe are vital. We are focused on building a creative community around it,&#34; Murugesan said.   Read:  The big picture in the entire AR-filter craze  Over the past year, Snap has  trained over a thousand students in building augmented reality-based experiences through offline and online workshops at several high schools and colleges like Pearl Academy, Indian School of Design and Innovation (ISDI), Symbiosis Pune, and Manipal Institute of Technology, among others.  &#34;We are also building a community of professional lens creators in India, whom we call OLCs (official lens creators). There are about seven such creators in India right now,&#34; Murugesan said.  For the quarter ended September, Snap Inc reported saw a 52% year-on-year increase in revenues to $678.7 million from $446.2 million last year, while the company&#39;s net loss fell to $200 million for the quarter, from $227 million loss in the same quarter last year.", "posttime": "2020-10-22 11:08:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,印度,india", "title": "Snap高管表示，Snapchat在印度的DAU在第三季度同比增长150%，Snap宣布了一系列针对印度的新原创系列和迷你游戏", "title_en": "Snap executive says Snapchat's DAU in India grew 150% YoY in Q3, as Snap announces a slate of new India-specific original series and mini games", "transed": 1, "url": "https://economictimes.indiatimes.com/tech/technology/snapchat-doubles-down-on-india-with-new-original-series-games/articleshow/78788934.cms", "via": "", "real_tags": ["游戏", "印度", "india"]}, {"category": "", "categoryclass": "", "imagename": "26177261b03b0362a01279d5cc8a73f2.jpg", "infoid": 1030457, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家法院已经批准了本周早些时候提出的基奇纳-滑铁卢信使应用Kik与美国证券交易委员会(SEC)之间的和解方案。Kik周三发表的一份声明称，批准解决了Kik与SEC之间的“所有正在进行的问题”。\n“证交会提出的和解条款让我们可以把这件事抛诸脑后，专注于我们的使命。”\n根据周三发布的最终判决，Kik将在未来30天内向委员会一次性支付500万美元的罚款。在接下来的三年里，Kik还必须在参与未来数字资产的枚举发行、报价、销售和转让之前向委员会发出通知。\n“这是Kik和SEC之间一场旷日持久、代价高昂的公开斗争。尽管我们恭敬地不同意法官Hellerstein在裁决中的分析，并准备提起上诉，但SEC提出的和解条款让我们可以把这件事抛诸脑后，专注于我们的使命，“Kik在声明中称。我们期待着Kin生态系统和每月赚取和消费Kin的数百万主流消费者有一个令人兴奋的未来。“。\n在过去的三年里，Kik和SEC一直卷入了一场关于Kik 2017年首次发行硬币(ICO)的法律战，该发行涉及Kin加密货币，最初是通过Kik在公共以太区块链上发行的加密货币令牌。\n在批准和解之前不久，美国纽约南区地区法院做出了有利于SEC的裁决，SEC声称Kik Interactive Inc.。违反证券法，未能登记2017年其Kin令牌的分发。\nSEC对Kik的追逐导致Kik的应用程序最初被关闭并出售，此外，2019年还收购了Kik的员工。\n在周三的声明中，Kik表示，和解协议不要求Kin令牌作为证券交易委员会的安全注册。根据最终判决，Kik在发行、提供、出售或转移加密货币之前不需要寻求委员会的批准或同意。\nSEC执行部网络部门主管Kristina Littman在声明中称，“寻求利用公开市场将业务资本化的发行人可能无法逃避联邦证券法的注册要求.”“法院的判决承认，Kik参与了单一的、非法的证券发行活动。”", "note_en": "A court has approved the settlement between Kitchener-Waterloo messenger app Kik and the US Securities Exchange Commission (SEC), which was proposed  earlier this week. A statement issued by Kik Wednesday claimed the approval resolves “all ongoing matters” between Kik and the SEC.\n “The SEC offered settlement terms that allow us to put this behind us and focus on our mission.”\n Per the  final judgment issued Wednesday, Kik will pay a one-time fine of $5 million USD to the commission within the next 30 days. For the next three years, Kik is also required to provide notice to the commission before engaging in enumerated future issuances, offers, sales, and transfers of digital assets.\n “This has been a long, expensive, and public battle between Kik and the SEC. Although we respectfully disagree with Judge Hellerstein’s analysis in his ruling and were prepared to pursue an appeal, the SEC offered settlement terms that allow us to put this behind us and focus on our mission,” Kik said in its statement. “We look forward to an exciting future for the Kin Ecosystem and the millions of mainstream consumers who earn and spend Kin every month.”\n For the last three years, Kik and the SEC have been embroiled in a legal battle over Kik’s  2017 initial coin offering (ICO) involving the Kin cryptocurrency, which began as a cryptocurrency token issued on the public Ethereum blockchain through Kik.\n The approval of the settlement follows shortly after the US District Court for the Southern District of New York  ruled in favour of the SEC, which claimed that Kik Interactive Inc. violated securities law by failing to register the 2017 distribution of its Kin tokens.\n The SEC’s pursuit of Kik led to the initial  shutdown and  sale of Kik’s app, in addition to the acquisition of its employees in 2019.\n In its Wednesday statement, Kik said the settlement does not require the registration of the Kin token as a security with the SEC. According to the final judgment, Kik does not need to seek the commission’s approval or consent prior to issuing, offering, selling, or transferring cryptocurrencies.\n  “Issuers seeking to use the public markets to capitalize their businesses may not evade the registration requirements of the federal securities laws,” Kristina Littman, chief of the SEC Enforcement Division’s cyber unit, said in a  statement. “The court’s decision recognized that Kik was engaged in a single, illegal offering of securities.”", "posttime": "2020-10-22 10:47:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,kik", "title": "联邦地区法院批准Kik与SEC达成和解，Kik将支付500万美元罚款，以了结2017年象征性出售的纠纷，该交易筹集了约1亿美元", "title_en": "Federal district court approves the settlement between Kik and the SEC where Kik will pay a $5M fine to settle dispute over a 2017 token sale that raised ~$100M", "transed": 1, "url": "https://betakit.com/court-approves-kiks-settlement-with-sec-ending-years-long-battle/", "via": "", "real_tags": ["交易", "kik"]}, {"category": "", "categoryclass": "", "imagename": "ad6d64f26984d199d3c09591cf7431f8.jpg", "infoid": 1030455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年10月21日凌晨3点37分，美国国家航空航天局(NASA)航天器首次成功刷到一颗古老小行星的表面，采集了样本并将其送回地球。“华尔街日报”的罗伯特·李·霍兹解释了奥西里斯-雷克斯在本努的任务如何揭示地球上生命的起源。图片来源：讲义/法新社/盖蒂图片", "note_en": "10/21/2020 3:37AM          For the first time, a NASA spacecraft successfully brushed the surface of an ancient asteroid to collect samples and return them to Earth. WSJ’s Robert Lee Hotz explains how Osiris-REx’s mission to Bennu could shed light on the origins of life on Earth. Photo: Handout/AFP/Getty Images", "posttime": "2020-10-22 10:06:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,nasa,美国宇航局,接触,osiris", "title": "美国宇航局的奥西里斯-雷克斯成功接触到小行星本努", "title_en": "NASA’s Osiris-Rex Successfully Touches Asteroid Bennu", "transed": 1, "url": "https://www.wsj.com/video/nasas-osiris-rex-successfully-touches-asteroid-bennu/657B16F1-70AA-43DD-A624-22B2C913B6B8.html", "via": "", "real_tags": ["美国", "nasa", "美国宇航局", "接触", "osiris"]}, {"category": "", "categoryclass": "", "imagename": "48fbd57131941a86aab78078267b7829.jpg", "infoid": 1030454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克(Elon Musk)在第三季度财报电话会议上表示，特斯拉完整的自动驾驶套件准备在2020年底向所有购买了这一功能的司机广泛发布。\n马斯克在谈到周二深夜开始向最少人推出FSD套件时表示：“我们起步非常缓慢，非常谨慎，因为世界是一个非常复杂和混乱的地方。”“我们昨晚把它放在那里，然后看看进展如何，然后可能在本周末或下周初把它发布给更多的人。然后逐步加大力度，直到我们有望在今年年底有一个大范围的发行。“。\n10月8日，马斯克表示，最新版本的FSD软件将能够“零干预驱动”。将在几周内发布有限的测试版。“。\n四天后，马斯克宣布将于10月20日推出FSD套装的限量版。特斯拉信守诺言，一些幸运的司机在周二晚上获得了这一能力。\n然而，如果进展顺利，马斯克已经在寻找更广泛的FSD软件版本。目前还不清楚谁目前拥有该软件，也不知道他们是如何被选中接收该软件的。尽管如此，谨慎构建的自动驾驶功能将利用特斯拉的神经网络来提高其性能。\n马斯克说：“当然，随着系统收集更多的数据，它会变得更加健壮。”“这有点像‘谷歌，作为一个搜索引擎，是如何变得更好的？’这是因为人们总是通过向它提问并点击特定的链接来对其进行编程。“。\n特斯拉的神经网络也是以同样的方式运作。每行驶一英里，软件的操作就变得更加复杂和准确。据特斯拉人工智能负责人安德烈·卡帕西(Andrej Karpath)称，不断学习的神经网络已经从超过30亿英里的自动驾驶辅助驾驶中接收到了信息。\n马斯克对年底推出FSD阵容的估计，以及他推出特斯拉机器人出租车车队的时间表。叫车服务将需要一个零干预的FSD套件，可以在没有司机的情况下操作。为了让机器的士车队在2021年之前成形，消防处必须提前完成。\n随着这项广受期待的技术即将发布，特斯拉正在为公司历史上最重要的一年做准备。在连续第五个季度实现盈利后，特斯拉的产量正在上升，预计年产量将达到100万辆。随着更多的汽车上路，由于与神经网络的合作，FSD套件只会变得更加复杂。\n消防处是否真的在今年年底前为所有客户提供服务，还有待观察。然而，鉴于特斯拉最近能够及时、准确地发布其新软件，车主和发烧友完全有理由相信，到2021年，这家电动汽车制造商将把FSD推出给所有有能力的汽车。", "note_en": "Tesla’s Full Self-Driving suite is poised for a wide-release by the end of 2020 to all drivers who purchased the capability, Elon Musk said, during its Q3 Earnings Call.\n “We’re starting very slow and very cautiously because the world is a very complex and messy place,” Musk said when talking about the Beta rollout of the  FSD suite to a minimal group of people, which began late Tuesday night. “We put it out there last night, and then we’ll see how it goes, and then probably release it to more people this weekend or early next week. Then gradually step it up until we hopefully have a wide-release by the end of this year.”\n On October 8th, Musk stated that the  latest build of the FSD software would be capable of “zero-intervention drives. Will release limited beta in a few weeks.”\n  Four days later, Musk announced that the FSD suite’s limited release would be available on October 20th. Tesla kept its word, and some lucky drivers received the capability on Tuesday evening.\n However, Musk is already looking toward wider releases of the FSD software if things go well. It is unknown who currently has the software or how they were selected to receive it. Still, the cautious build of the autonomous driving functionality will utilize  Tesla’s Neural Network to improve its performance.\n “Of course, as the system collects more data, it becomes more robust,” Musk said. “It’s sort of like ‘How does Google, as a search engine, get better?’ It’s because people are programming it by asking it questions all the time and clicking on particular links.”\n Tesla’s Neural Network operates in the same fashion. With every mile driven, the software gets more complex and accurate with its maneuvers. The constantly-learning Neural Net has received information from over 3 billion miles of Autopilot-assisted driving, according to Tesla’s Head of Artificial Intelligence,  Andrej Karpathy.\n Musk’s estimations for the end-of-year rollout of FSD lineup with his timeline for  introducing Tesla’s Robotaxi fleet. The ride-hailing service would require a zero-intervention FSD suite that could operate without a driver. In order for the Robotaxi fleet to take shape by 2021, FSD would have to be completed beforehand.\n With the pending release of the widely-anticipated technology, Tesla is setting itself up for the biggest year in company history. After marking a  fifth-consecutive profitable quarter that showed production numbers are rising, Tesla is poised to produce 1 million vehicles a year. With more cars on the road, the FSD suite will only become more complex thanks to its partnership with the Neural Network.\n   Whether FSD actually makes its way to all customers by the end of the year remains to be seen. However, with Tesla’s recent ability to maintain timely and accurate releases of its new software, owners and enthusiasts have every reason to believe the electric automaker will get FSD out to all capable cars by the time 2021 rolls in.", "posttime": "2020-10-22 10:06:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,特斯拉,全自动,wide,fsd", "title": "特斯拉将在今年年底前广泛发布全自动驾驶", "title_en": "Tesla to wide-release Full Self-Driving 'by the end of this year'", "transed": 1, "url": "https://www.teslarati.com/tesla-fsd-suite-wide-release/", "via": "", "real_tags": ["发布", "特斯拉", "全自动", "wide", "fsd"]}, {"category": "", "categoryclass": "", "imagename": "a48b32d65e901529cb5c6acae32fac9a.jpg", "infoid": 1030452, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这种恶魔般的铁甲，除了拥有动物界最酷的名字之一外，还拥有最坚硬的天然外骨骼之一。一组科学家终于解开了这种特别耐用的盔甲背后的秘密，以及这些昆虫是如何在被汽车碾压的情况下生存下来的。\n正如智者常说的那样，一根在风中弯曲的芦苇比一棵在暴风雨中折断的大树更坚固。今天发表在“自然”杂志上的一项新研究表明，恶魔般的铁甲虫(Phloeodes Dedelicus)就是这些圣人话语的追随者。它们的外骨骼特别坚韧，但当压力真的太大时，它们的保护壳就会呈现弹性，导致某种拉伸而不是断裂。\n做出这一发现的科学家-来自普渡大学(Purdue University)和加州大学欧文分校(University of California-Irvine)的一个团队-表示，这种恶魔般的铁甲虫采用的独特策略可以激发创新材料的创造，即能够消散能量的部件，以防止灾难性的断裂。UCI的材料科学和工程学教授David Kisailus领导了这项新的研究。\n这种凶猛的铁甲虫发现于美国西南部，喜欢躲在岩石下，挤在树皮后面。这些甲虫不会飞，所以他们开发了一对有趣的防御策略来保护自己免受鸟类、啮齿动物和蜥蜴等捕食者的攻击。除了装死(这本身就是一种经典而有效的策略)，这些坦克状的虫子还配备了科学上已知的最坚硬的外壳之一。这种外骨骼非常坚固，这些甲虫可以在被汽车碾压的情况下幸免于难。更实际的情况是，当它们被鸟啄的时候，这个壳可以保护它们的内脏。\n为了更好地了解这些甲虫及其耐用的外骨骼，研究人员刺激了这种盔甲的局限性，用显微镜和CT扫描仪对其进行了研究，甚至还打印了自己的3D版本来验证他们的理论。\n实验表明，恶魔般的铁甲虫可以承受150牛顿的外力，相当于其体重的3.9万倍。根据普渡大学的一份新闻稿，如果我们将其与人类进行比较(考虑到涉及的规模差异很大，这不是一个很好的例子，但仍然很有趣)，这将需要一个200磅的人忍受780万磅的挤压。一个轮胎从头顶飞过会产生100牛顿的力，这解释了这些甲虫如何在与汽车的碰撞中幸存下来。研究人员说，其他种类的甲虫甚至连一半的负荷都承受不了。\n用显微镜和CT扫描仪对外骨骼进行的物理分析表明，这种生物耐用性的关键在于这种生物的鞘。在会飞的甲虫中，鞘翅目是它们后翼的保护性翼盒(在瓢虫中，鞘翅目是红黑相间的圆点贝壳，在它们该飞的时候会打开)。然而，对于陆地上恶魔般的铁衣甲虫来说，它的两个鞘翅目进化出了不同的目的，保护它的内脏，而不是它的翅膀。在这样做的过程中，它变得比在其他甲虫身上发现的鞘翅目要坚韧得多。\n外层防止过度运动，保持外骨骼结构完整。这层外层的蛋白质比平常多--重量比甲虫身体的其他部位多10%左右--这就增加了额外的力量。\n与此同时，内侧缝合线-沿着甲虫腹部长度将两个鞘分开的线-以连接的叶片为特色，最好的描述是互锁拼图的碎片。这些刀片或缝合线紧密相连，防止任何内部运动，并保持拱形外骨骼的结构完好无损。\n但还记得我们的“风中芦苇”的比喻吗？如果事情开始变得太激烈，压力太大，就必须有一些让步，以免甲虫最终像顽固的树一样折断。在这种情况下，互锁缝合线会经历一个称为分层或分层压裂的过程，在这个过程中，连接的结构慢慢地相互拉开，从而允许能量耗散和弹性变形。如果力太大，这种连锁结构将完全崩溃，但破坏过程比普通的老式断裂发生得更慢、更温和。在现实世界的场景中，这意味着在完全失败之前需要更长的时间，对于甲虫来说，这可能是生死攸关的问题。\nKisailus在加州大学欧文分校的一份声明中解释说：“当你打碎一块拼图时，你预计它会在颈部，也就是最薄的部分分离。”“但我们没有看到这种甲虫出现那种灾难性的分裂。取而代之的是，它分层，为结构提供了一个更优雅的失败。“。\n为了给甲虫争取更多的时间，叶片上有一层像砂纸一样的带刺涂层，在滑动过程中提供了一些但不是太多的阻力。\n通过运行计算机模拟和打印这些结构的3D模型，研究人员能够复制这些保护效果，进一步强化了他们的假设。他们还基于同样的策略制造了一种紧固件，事实证明，它即使不是更好，也和传统的工程紧固件一样好。\n普渡大学土木工程教授巴勃罗·扎瓦蒂耶里(Pablo Zavattieri)在一份大学声明中表示：“这项研究表明，我们或许能够从使用坚固易碎的材料转变为既结实又坚韧的材料，方法是在它们断裂时消耗能量。”“这就是大自然让这只凶猛的铁甲虫能够做到的。”\n有了这些知识，工程师们也许能够制造出特别坚韧的材料，比如改进的飞机燃气轮机，这涉及到需要用机械紧固件固定在一起的金属和复合材料。事实上，我们并不总是需要重新发明轮子--通常，大自然已经相当优雅地解决了一个问题。\n更正：这篇文章的前一个版本错误地说，Kisailus是普渡大学的教授；实际上，他在加州大学欧文分校工作。\n实际上很有趣的是，缝合线克服了贝壳两半连接的接缝自然产生的弱点。接缝产生了一个应力提升管，通常会使贝壳更容易在那里“折断”(就像糖果条上的划线一样)。缝合线加强了这一区域，使融合的外壳更坚韧。电脑测试很有趣，因为我把做类似的测试作为我工作的一部分。", "note_en": "The diabolical ironclad beetle, in addition to having one of the coolest names in the animal kingdom, boasts one of the toughest natural exoskeletons. A team of scientists has finally figured out the secret behind this extra durable armor and how these insects can survive getting run over by a car.\n    As wise people often say, a reed that bends in the wind is stronger than a mighty tree that breaks during a storm. New   research published today in Nature suggests the diabolical ironclad beetle ( Phloeodes diabolicus) is an adherent of these sage words. Their exoskeletons are extra tough, but when the pressure literally gets to be too much, their protective shells take on an elastic quality that results in a kind of stretching rather than breaking.\n The scientists who made this discovery—a team from Purdue University and the University of California-Irvine—say the unique strategy employed by the diabolical ironclad beetle could inspire the creation of innovative materials, namely components capable of dissipating energy to prevent catastrophic breakage. David Kisailus, a professor of materials science and engineering at UCI, led the new research.\n  Found in the U.S. southwest, the diabolical ironclad beetle likes to hide under rocks and squeeze behind tree bark. These beetles cannot fly, so they’ve developed a pair of interesting defensive strategies to protect themselves against predators such as birds, rodents, and lizards. In addition to playing dead (a classic and effective strategy in its own right), these tank-like bugs are equipped with one of the toughest shells known to science. So strong is this exoskeleton that these beetles can survive getting run over by a car. More practically, this shell protects their internal organs when, say, they’re getting pecked at by birds.\n To better understand these beetles and their durable exoskeletons, the researchers prodded the limits of this armor, studied it with microscopes and CT scanners, and even 3D-printed their own versions to test their theories.\n   Experiments showed that diabolical ironclad beetles can withstand an applied force of 150 newtons, which is 39,000 times its body weight. If we were to compare this to humans (not a great example, given the vastly different scales involved, but fun nonetheless), that would require a 200-pound person to endure the crush of 7.8 million pounds, according to a Purdue press release. A tire passing overhead would inflict 100 newtons of force, which explains how these beetles can survive run-ins with cars. The researchers say other beetle species can’t handle even half of this load.\n   Physical analysis of the exoskeleton with microscopes and CT scanners showed that the key to this durability lies in this creature’s elytra. In flying beetles, elytra serve as the protective wing-cases for their hindwings (in ladybugs, elytra are the red and black polka-dotted shells that open up when it’s time for them to fly). For the terrestrial diabolical ironclad beetle, however, its two elytra evolved a different purpose, protecting its internal organs instead of its wings. And in so doing, it has become considerably tougher than the elytra found in other beetles.\n  The outer layer prevents excessive motion, keeping the structure of the exoskeleton intact. This outer layer features more protein than usual—about 10% more by weight than other parts of the beetle’s body—which adds extra strength.\n   At the same time, the medial suture—the line that divides the two elytra along the length of the beetle’s abdomen—features connective blades that are best described as the pieces of an interlocking jigsaw puzzle. These blades, or sutures, interlock tightly, preventing any internal motion and keeping the structure of the overarching exoskeleton intact.\n  But remember our reed-in-the-wind analogy? Should things start to get too intense, and the stresses too powerful, there has to be some give, lest the beetle ends up broken like the stubborn tree. In this case, the interlocking sutures go through a process called delamination, or layered fracturing, in which the connecting structures slowly pull away from each other, allowing for the dissipation of energy and elastic deformation. This interlocked configuration will collapse completely if the forces are too extreme, but the breakage process happens more slowly and more gently than a plain old snap. In a real-world scenario, this means an extended time until complete failure, which, for the beetle, could be a matter of life and death.\n “When you break a puzzle piece, you expect it to separate at the neck, the thinnest part,” explained Kisailus in a UC-Irvine statement. “But we don’t see that sort of catastrophic split with this species of beetle. Instead, it delaminates, providing for a more graceful failure of the structure.”\n  To buy the beetle even more time, the blades feature a prickly coating that acts like sandpaper, providing some but not too much resistance during slippage.\n By running computer simulations and printing 3D models of these structures, the researchers were able to replicate these protective effects, further strengthening their assumptions. They also built a fastener based on the same strategy, and it proved to be just as good as conventional engineering fasteners, if not better.\n  “This work shows that we may be able to shift from using strong, brittle materials to ones that can be both strong and tough by dissipating energy as they break,” said Pablo Zavattieri, professor of civil engineering at Purdue, in a university statement. “That’s what nature has enabled the diabolical ironclad beetle to do.”\n  With this knowledge, engineers might be able to build extra-tough materials, such as improved aircraft gas turbines, which involve metals and composite materials that need to be held together with mechanical fasteners. Indeed, we don’t always need to reinvent the wheel—often, nature has already solved a problem quite elegantly.\n  Correction: A previous version of this article incorrectly said that Kisailus is a professor at Purdue; actually, he is with the University of California-Irvine.\n        It’s actually quite interesting that the suture overcomes a weak point that is naturally created by the seam where that shell halves are joined. The seam creates a stress riser that would normally make the shell easier to “snap” there (Like the scored lines on a candy bar). The suture reinforces that area and makes the fused shell much tougher. The computer tests were interesting because I do similar tests as part of my job.", "posttime": "2020-10-22 09:47:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "甲壳虫,beetle,甲虫", "title": "这只坚不可摧的甲壳虫是如何在被车碾过后幸存下来的", "title_en": "How This Uncrushable Beetle Can Survive Being Run Over By a Car", "transed": 1, "url": "https://gizmodo.com/how-this-uncrushable-beetle-can-survive-being-run-over-1845436795", "via": "", "real_tags": ["甲壳虫", "beetle", "甲虫"]}, {"category": "", "categoryclass": "", "imagename": "2858dc2dd5b6ffb827e3c8d55dacb36a.jpg", "infoid": 1030451, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦-Facebook周四宣布，在美国推出约会服务一年多一点后，它已将约会服务扩展到欧洲。\n该平台简称为Facebook约会，旨在帮助Facebook用户通过兴趣、活动和团体等共同之处找到伴侣。那些想要选择加入这项服务的人必须建立一个Facebook约会档案，该服务在Facebook应用程序中有一个专门的空间。\n一旦注册，Facebook用户就可以在他们的约会资料上分享个人故事，也可以分享他们的Facebook或Instagram主账号上的故事。(假设这里有结尾引用？)。\n还有一项“秘密迷恋”功能，用户可以选择9个他们感兴趣的Facebook好友或Instagram追随者。如果这些人中的一个也选择你作为他们的暗恋对象，那么就会产生匹配。这里有更多关于它是如何工作的信息。\n26岁的公关顾问朱莉娅·波特利(Julia Portelly)在接受CNBC采访时表示，尽管这些天她很少使用Facebook，但她肯定会在新的约会服务网站上闲逛。她说：我在想，他们(Facebook)会不会给这款游戏带来一些全新的东西，或者只是收缩功能，改变用途？\n另一位约会应用用户说：我不再经常使用Facebook了，我不知道我是否相信他们检查人们身份的能力，所以我可能不信任他们。\n与Tinder、Hinger和Bumble等其他约会服务不同，Facebook的约会功能是完全免费的，没有额外的服务。\n一位30岁出头的单身男教师告诉CNBC：如今有如此多的服务机构用潜在的配对来嘲弄你，然后又把他们藏在付费墙后面。我要说的是，让爱自由吧--我已经准备好让Facebook来帮助解决这个问题。\n冠状病毒的流行颠覆了约会，封锁和社交疏远措施使世界各国的面对面约会变得困难。政客们在这个问题上面临着棘手的问题，英国首相鲍里斯·约翰逊上周表示，在英国某些地区，室内性行为是禁止居住在不同家庭的夫妇发生性行为的。\nFacebook表示，它正在推出一项功能，允许在Facebook约会上配对的单身人士进行视频聊天。\n该功能于2018年5月在Facebook的F8开发者大会上首次公布，于2019年9月在美国推出，立即导致拥有约会应用Tinder的Match股价下跌4.5%。这项服务目前在全球52个国家和地区提供，其中包括欧洲的32个国家。\nFacebook声称，自推出以来，该平台已经在20个国家产生了15亿个匹配。当CNBC询问有多少用户选择加入Facebook约会时，该公司没有立即做出回应。\n穆斯林约会应用MuzMatch的首席执行官兼创始人沙兹·尤纳斯(Shaz尤纳斯)表示，到目前为止，Facebook约会有点像是一件无关紧要的事情。\n摩根士丹利(Morgan Stanley)前投资银行家尤纳斯表示，Match Group的股票在宣布时有所下跌，但很快就回升了。Facebook的品牌推广不是很好，但它不能被低估。\nFacebook与之相匹敌的能力。。。个人基于他们的实际行为是无与伦比的。这是他们真正的优势，没有人能与之匹敌。即使有1%的用户使用它，单纯从他们的规模来看，这仍然是一个非常成功的产品。这就是说，正如约会世界所显示的那样，约会应用的会员通常在多个平台上，所以任何让人们正常使用约会应用产品的事情都只会对该行业有所帮助。", "note_en": "LONDON —  Facebook announced Thursday that it has expanded its dating service to Europe, a little over a year after it launched in the U.S.\n The platform, known simply as &#34;Facebook Dating,&#34; is designed to help Facebook users find partners through things they have in common such as interests, events and groups. Those wanting to opt-in to the service, which has a dedicated space in the Facebook app, must set up a Facebook Dating profile.\n  Once registered, Facebook users can share personal &#34;Stories&#34; on their dating profile, as well as Stories from their main Facebook or Instagram account.&#34;(assume end quote here?)\n There&#39;s also a &#34;Secret Crush&#34; feature that enables users to select up nine Facebook friends or Instagram followers that they&#39;re interested in. If one of those people also selects you as their crush then a match is generated. Here is  a bit more on how it all works.\n Julia Portelly, a 26-year-old PR consultant, told CNBC that she&#39;ll definitely have a &#34;poke around&#34; the new dating service despite not using Facebook much these days. &#34;I&#39;m wondering if they [Facebook] will bring something completely new to the game, or just pinch features and repurpose them?&#34; she said.\n  Another dating app user said: &#34;I don&#39;t use Facebook much anymore and I don&#39;t know if I trust their ability to check people&#39;s identities, so probably not for me.&#34;\n Unlike other dating services such as Tinder, Hinge, and Bumble, the Facebook Dating feature is completely free to use, with no premium offering.\n  A single male teacher in his early 30s told CNBC: &#34;So many services these days taunt you with potential matches but then hide them behind paywalls. Set love free I say — I&#39;m ready for Facebook to help set this straight.&#34;\n Dating has been upended by the coronavirus pandemic, with lockdowns and social distancing measures making in-person dates difficult in countries around the world. Politicians have faced tricky questions on the matter, with U.K. Prime Minister Boris Johnson last week saying &#34;sex indoors&#34; is banned for couples living in separate households in certain parts of the country.\n Facebook said it is in the process of rolling out a feature that will allow singles who have matched on Facebook Dating to have video chats.\n First announced at Facebook&#39;s F8 developer conference in May 2018, the dating feature launched in the U.S. in September 2019, immediately sending shares in Match, which owns dating app Tinder, down 4.5%. The service is now available in 52 countries worldwide including 32 in Europe.\n Facebook claims that the platform has generated 1.5 billion matches across 20 countries since it launched. The company did not immediately respond when CNBC asked how many of its users have opted-in to Facebook Dating.\n Shaz Younas, chief executive and founder of Muslim dating app muzmatch, said Facebook Dating has been a bit of a &#34;non-event&#34; so far.\n &#34;Match group stock dipped when it was announced but quickly recovered,&#34; said Younas, a former investment banker with Morgan Stanley. &#34;Facebook branding isn&#39;t great, but it cannot be underestimated.&#34;\n &#34;Facebook&#39;s ability to match . . . individuals based on their actual behavior is unparalleled. That is a real edge for them that no one can match. Even if 1% of their userbase uses it, that is still a wildly successful product purely based on their size. That said, as has been shown in the dating world, dating app members are often on multiple platforms, so anything to normalise people using dating app products only helps the sector too.&#34;", "posttime": "2020-10-22 09:46:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,dating", "title": "在爱尔兰监管机构2月份迫使Facebook计划首次亮相后，Facebook在欧洲推出了约会服务，声称它在20个国家进行了15亿次约会", "title_en": "Facebook Dating launches in Europe, after Ireland's regulators forced a delay of its planned debut in February, claims it made 1.5B matches across 20 countries", "transed": 1, "url": "https://www.cnbc.com/2020/10/21/facebook-dating-launches-in-europe.html", "via": "", "real_tags": ["facebook", "dating"]}, {"category": "", "categoryclass": "", "imagename": "eb3106922447d7c0c3a7933977570e3e.jpg", "infoid": 1030449, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个巨大的机器人看起来像一个结婚的特德韦尔，我在所有星球大战机器人中最喜欢的机器人。我承认，我担心它看起来像是有机的，就像“黑客帝国”中的哨兵，有章鱼博士扭动的手臂和夹紧的钳子。但机器人类似前夜的外观让我平静下来。\n这房间是无菌的。十几个戴着面具、戴着手套的服务员在发出蓝色的嗡嗡声。我想象我是一名即将步入火箭飞船太空舱的宇航员。\n除非出了非常非常糟糕的事情，否则我不会在这次特别的旅行中去任何地方。事实上，我已经被不同的工作人员反复要求描述一下未来几个小时我预计在这个房间里会发生什么：\n我来这里是为了通过机器人手术切除我的乙状结肠，因为里面有癌症。\n我今年34岁。时间是2020年10月12日。五周前，我被诊断出患有结肠癌。\n我一直是个立式雨刷。不完全确定原因。我肯定有一次在坐着擦拭的时候不小心碰到了一大堆大便。这类事情可以改变一个人。\n这段有趣的轶事确实是我们故事中的一个因素，因为它意味着我对我的粪便一直都有很好的感觉。一致性、质量和颜色，无论是在碗里还是在茶点上都是如此。你知道吗，你的粪便甚至有一个七级科学分类系统，叫做布里斯托尔粪便分级系统。\n我第一次注意到血迹是在两三年前。大约每月一次，我会擦拭并注意到略带红色的色调。不是鲜红，更像是泥红色。便便红。起初，我没怎么想过这件事。只是一个小小的好奇。当然，这并不是每次都会发生。尽管如此，我还是决定在那一年与我的初级保健医生进行年度体检时，检查表格上的大便血框。\n简单地说一下你的初级保健医生这个短语。就像在“忘记莎拉·马歇尔”中一样，我真正想到的最后一个医生是我的儿科医生。自从成年以来，我已经在两个国家的三个城市生活过，这意味着我通常不知道我的初级保健医生是谁或曾经是谁，只知道我需要找一位医生给我推荐，才能把我脚上的疣去掉。\n不管怎么说，这一季是医生，他告诉我不用担心血液问题。可能是痔疮。\nWTF是痔疮吗？我对他说，这听起来不错。后来我在谷歌上搜索了一下，得知是一种在你屁股上稍微露出来的静脉，而且我真的不想露一点，所以它就流了血。我对他说，这听起来不错。后来我用谷歌搜索了一下，才知道这是一种在你屁股上稍微露出来的静脉，所以它在流血。似乎这是一件可能发生的事情，所以我或多或少地回到了定期安排的节目中，只是偶尔擦了一下大便红色的纸巾。这位医生还说，我可能有几年不需要来体检了，每年的体检都是神话，是水世界里的旱地。\n快进到2020年。一切都很糟糕。带血的湿巾又卷土重来了。因为，当然，他们是。大约四个月前，我注意到我每天的第一次大便(我通常排2次)会有这个紫红色的条纹嵌入其中，就像来自地狱的赛车条纹。而且几乎每天早上都会发生这样的事情。不管过去的体检医生告诉我什么，这看起来都不太对劲。然后有一天早上，我感觉我的屁股上真的有血在滴。\n现在我认为自己基本上是一个健康的人。我吃得相当好(尽管我偶尔喜欢酸面团和朦胧的IPA)，我经常跑步、骑自行车和徒步旅行，我在2016年参加了铁人三项赛，此后还参加了几次超级马拉松。我也不喜欢生病(谁喜欢呢？)。但是，就像我生活中的大多数事情一样，我想在健康方面做得很好。对我来说，理想的牙科预约应该是这样的：哇，查理，这是我们见过的最直、最白的牙齿。我们希望你能进来，成为我们Instagram广告的模特，也是我们假牙的3D牙模。祝贺你。这是两把免费的牙刷。你也再也不需要用牙线了。\n任何偏离这一理想的事情都会让我感到不安，我确实认为我可以修复任何事情。不管怎样，我仍然相信，如果我在山顶上遇到一朵蓝色的花，我距离成为蝙蝠侠只有几个月的时间了。我已经有斗篷了(它实际上是一件哈利波特的长袍，不过，嘿，我穿得很破烂)。\n与此同时，我用轻微的忧郁症来抵消这一点。可以这么说，我要看看槲寄生里的毒橡树。在这种情况下，这是一份礼物。我又在谷歌上搜索大便、带血的大便，可怕的结肠癌又回来了。上次，我把目光从这些搜索结果上移开。但是血淋淋的赛车条纹并没有消失。我需要给自己做个检查。\n然后，我想起了工作中的一封电子邮件：我有资格成为OneMedical的会员。我知道有关于OneMedical的炒作，当然我已经看过广告牌了，但我仍然不能确切地确定它们都是关于什么的。你知道，我上次体检已经有几年了，所以我没有初级保健，手上有个血淋淋的问题。我下载了OneMedical应用程序，上传了一张我的保险卡的照片，哔，几天后我就和他们附近的一家诊所的新医生约好了。我已经很喜欢这种体验了--我可以随时发短信提问(参见上面的脚疣)。我将OneMedical描述为一个诊所网络，它有一个应用程序，可以安排预约时间，并与医生发短信。当然，ZocDoc有点做日程安排的事情，但ZocDoc感觉你在筛选分类广告。请给我一些非用户生成的基于评级的策展。\n所以，我见了医生，非常喜欢他，讨论了我的血淋淋的大便，羞怯地问他是否会成为我新的主要看护人。他同意了，他还让我去加州大学旧金山分校做结肠镜检查。当然，我还年轻，很可能是痔疮，我们一致认为，但这是唯一确定的方法。\n在处理了转诊文件后，我们终于在几周后的9月9日接受了结肠镜检查。\n什么是结肠镜检查？这是一种外科手术，医生会一直钻到你的屁股上，看看里面发生了什么。你完全被击昏了，所以你什么也感觉不到。你唯一需要做的就是我们这一行喜欢称之为肠道准备的东西。\n请允许我描述一下肠道准备：在手术的前一天，你要把你永远活着的内脏排出几个小时，直到你完全干净，从头到尾。他们会给你开一张处方，给你开一大罐透明泻药，你每隔15分钟左右就会喝一次，持续几个小时。在今天囤积卫生纸的经济中，我会确保你的库存，因为这会变得乱七八糟。\n除了泻药，你还可以喝清澈的液体--这很让人困惑，因为你可以喝清咖啡、佳得乐、肉汤，甚至是绿色的果冻。\n但仅此而已。很简单。在我肠道准备的日子里，我又看了一遍“陌生人的事情”第三季。这可能不是最好的选择，因为我不得不断断续续地暂停Netflix，以贡献我自己的液化形式的Mind-Flayer，但它完成了任务，正如预期的那样，我又一次哭着读完了达斯汀和苏西的童年赞美诗。\n好的，接下来，我在9月9日醒来。我的约会是下午2点左右。正常的一天，对吧？\n一片奇怪的、世界末日般的橙红色天空笼罩着旧金山湾区。这是你需要知道的。阅读更多内容：ZPOj4X3jRgpic.twitter.com/https://t.co/JxpYSnUPG9\n--《旧金山纪事报》(@sfchronicle)2020年9月9日。\n我决定在令人毛骨悚然的火星火光下走到加州大学旧金山分校帕纳苏斯分校(UCSF Parnassus)大楼，想象自己是地球上最后一个人(希望我不会踩到老花镜)。卡莉计划几个小时后开车来接我。\n不出所料，手术是无痛的。我唯一进一步的结肠镜检查建议是，每次就诊时都要随身携带一本书，因为总会有一些延误或候诊室。\n大约一个小时后，我醒来时感觉到麻醉后的眩晕。只是其他人都不高兴。卡莉在房间里，这让我大吃一惊。我的医生看起来很严肃。\n除了两个小息肉(她切除了)，我的结肠镜医生在我的乙状结肠里发现了一个肿瘤。在这一点上，我分不清乙状结肠和分号，但我知道这不是好消息。2020加油！\n尽管困难重重(我的青春，我的健康)，我现在还是得了癌症。嗯，我可能有一阵子了，但我们刚发现我有。\n我的医生说，我需要与加州大学旧金山分校的结直肠手术团队会面，我还需要做CT扫描(CAT扫描)，看看癌症是否已经扩散到我身体的其他地方。\n我们已经讨论过我精力充沛的原始蝙蝠侠级别的健康状况。我是一个面容清新，偶尔留着胡须的34岁的人，有着孩子般的心和黑猩猩的力量(不，那是人)。\n说到不幸的遗传学，原来我有一些结肠癌家族史。\n这里是独家新闻：我的爸爸(这是给爸爸的酷话题)在他以前的结肠镜检查中有良性(非癌症)息肉。什么是圆珠笔？它是你结肠里的一个小生长物，可能会演变成肿瘤。就像查曼德如何变成查玛龙一样，息肉可以随着更大的破坏力而变得更大、更严重。息肉通常在结肠镜检查时被剪掉，然后送去做病理检查(也就是看看里面有没有癌症)。大多数人都不这么认为。这就是我父亲的息肉经历。尽管他没有患过癌症，但他仍然需要比那些没有息肉的人更经常地接受结肠镜检查。\n大约十年前，我自己的肿瘤开始时是一种低等的息肉。我们不知道确切的情况。但如果我在10年前或5年前做过结肠镜检查，他们可能已经看到了，然后把它剪掉了，你就不会读到这篇文章了。\n如果你再往上走，你会发现我父亲的姑姑(我父亲的母亲的妹妹)在60岁出头时死于结肠癌。他的另一位姑姑(同一边，同一家)死于结肠癌，享年80多岁。在我请父母帮忙填写加州大学旧金山分校众多癌症历史调查之一之前，我并不知道这两个事实。另外，在我母亲这边，我祖父的母亲(我的曾祖母，我从未见过)可能患有结肠癌。\n所以，结肠癌在我的家谱中四处传播。但是我的父母都没有，我的祖父母也没有，我想这是件好事。也就是说，我了解到我的祖父母确实患有其他类型的癌症。\n弄糊涂了，对吧？我再怎么强调这一点也不为过：了解你的家庭病史，并把它写在手机上的便条上。每次预约之前，您都会被要求提供此信息10,000次。但是，更重要的是，你的家族史可以向你和你的医生发出信号，告诉他们在某些情况下是否有更高的风险。\n我只是对这一切一无所知。我知道那里有一些心脏病发作，但并不是真的与癌症有关。理想情况下，每个人在出生时、年满18岁或第一次玩任天堂时，都会得到某种形式的家族史报告。\n但这就是问题所在。您不会自动获取健康信息。除了你，没有人拥有你的医疗健康故事。你必须成为自己的健康倡导者。剧透警告，但这是我在整个癌症经历中学到的第一课。健康素养与金融、文学或识字同样重要。\n有一些工具可以提供帮助，我现在还在深入研究它们。我现在对iOS上的苹果健康功能更感兴趣了。我希望它能成为我随身携带的健康数据的某种私人、安全的储存库。比如说，亲爱的读者们，你们当中有多少人知道自己的血型？这里有各种各样的小信息，你现在可以找到它们，为未来的你付钱。因为，其他人不会这么做的。这就像是一场寻宝游戏。好了，传教说得够多了，伙计。\n回到我们的故事，我们刚刚得知我屁股上长了癌症，我们还填了几份可怕的家族史报告。这就是加州大学旧金山分校开足马力的地方(天哪，我爱加州大学分校吗？是的，是的，我知道。他们绝对、令人惊叹地出色、有能力，并且改变了生活！)。\n我现在开始预约各种各样的预约，首先是前面提到的：(1)腹部和胸部的CT扫描，(2)然后是结直肠外科医生的会诊。(2)我现在开始预约各种预约，首先是前面提到的：(1)腹部和胸部的CT扫描，(2)然后是结直肠外科医生的会诊。\n因为，正如我后来从我的结直肠外科医生(谁是最好的！)那里了解到的那样，当结肠癌扩散时，它通常会从癌性息肉(阶段1)演变为肿瘤(阶段2)。之后，它可以穿透结肠壁进入附近的淋巴结(阶段3)。最后，如果它扩散到其他器官，首先通常是肝脏和肺，它就变成了(阶段4)。至少，这是我对各个阶段的理解。我确信我错过了一些技术细节和细微差别。当你读到查德威克·博斯曼的故事时，你会知道他最初在2016年被诊断出患有3期结肠癌，最终变成了4期。总而言之，你希望你的分期尽可能低。\n在这一点上，CT前扫描，卡莉和我不知道我处于什么阶段。嗯，我们确实知道我在2点到4点之间的某个地方。这些约会将帮助我们了解我在哪里。具体地说，CT扫描将告诉我们是否处于第4阶段。\n卡莉和我下周大部分时间都在发呆。我们的父母和兄弟姐妹也是如此。老实说，我记不清我们在这一点上告诉了多少朋友，我认识几个，但不是那么多。我不知道该说什么，也不知道该怎么感觉。\n就像“南方公园”中的“辛普森一家”所做的那样，无论你有什么感觉或想法，通常都会有这样一首歌。(注：“辛普森一家”的主人公是“辛普森一家”。)。\n作为一个想要坚忍的人，我任由我的负面想象泛滥。我在想，我可能只有几年(几个月)的时间了。留下来活着。\n我的CT扫描安排在周四下午，和外科医生的会议安排在周五上午。从那时到现在，我们有可怕的互联网来做可怕的搜索，我们有我的结肠镜检查的两页摘要打印出来，里面充满了一些可怕的肿瘤照片。这个肿瘤看起来像蝌蚪和眼球的混合体(这是我通常喜欢的两样东西)。我一点也不喜欢看这张照片，但这两页的摘要不知何故一直在我们家四处走动，无论我往哪里看，我都看到那只粉红色的蝌蚪眼在盯着我，我想知道，你是我的死刑宣判吗？\n周四，我和卡莉走到加州大学旧金山分校的CT扫描地点。今天，它对外面的人类生活的敌意略有减少，所以这是件好事。在前台办理完登机手续后，我迅速穿过第一个候车室进入第二个候车室。总有第二个候车室。\n就是在这里，我意识到一个重大健康问题的声音正在迅速地打开和关闭医院的大门。我在我的平装本Flow的封底上草草写下了这句简明的话，然后用CT机等着轮到我。我得到了两瓶由知名饮料制造商通用电气提供的对比酒。这些碘鸡尾酒可以帮助机器看清我的内脏。它们尝起来就像你在喝打印机墨水。它们一点也不坏。这里的其他人都至少50岁了。我决定做五分钟的墙面坐姿来证明我的活力。最后，我被叫回了机器。\nCT机看起来就像一个冷睡室，与威兰公司的次元门户交叉。不到一分钟就结束了。\n扫描已经做好了，现在该由放射科医生来读了。我确信一些巧妙的TensorFlow或PyTorch深度学习计算机视觉模型可能会对此有所帮助，但我无法访问数据集。\n第二天早上，我们驱车前往加州大学旧金山分校的结肠直肠手术中心。它位于大蔡斯中心-使命湾区美丽的鬼城。在出发前，我抬头看着太阳，心想，下次我看到数十亿英里外燃烧着的气球你(彭彭)，我们就会知道CT结果，我们就会知道计划。\nCT扫描没有问题。没有迹象表明癌症扩散到其他器官，排除了4期。这是有史以来最好的消息。\n我们听到的第二个好消息是肿瘤处于一个相对较好的手术位置。在那天早上的即兴直肠检查之后(你好！)。为了确保直肠没有癌症，我的外科医生给了我们一个情况概述和一个攻击计划。\n他要切除我的整个乙状结肠(大约一英尺长)，然后简单地把直肠连接到结肠的其余部分。他将通过机器人手术(使用像特雷德韦尔一样的达芬奇手术系统)来完成这项工作，这样伤疤就会很小，恢复起来就容易得多了。这就是说，他将使用类似特雷德韦尔的达芬奇手术系统(Wed-Treadwell-like da Vinci Surgical System)来完成这项手术。\n我们将只能告诉我是否我的阶段2或阶段3手术后。他计划切除附近的淋巴结，病理报告会告诉我们它们是否是癌变的。如果他们是阳性的，那就是第三阶段。\n卡莉和我有个计划。我们是重新规划的人。我们需要这个。随着我们进入下一个议程项目，我们的一些阴霾消失了。\n看看那些不经意间的微笑。等等--我们没有忘记，我得了癌症。我们只是彼此相爱。\n最初定于2019年，然后在2020年蹦蹦跳跳之后，我们可爱的私奔穿上了一根非常小的针和一个小小的仪式，它是美丽和美妙的，也正是我们所希望的。\n现在，让我们来看一下我们结婚后的第一个动作：10月12日星期一的手术(以及前一天的另一轮肠道准备)。\n关于手术本身，我没有太多要补充的。我当时在场。但是我什么都不记得了。谢天谢地。我还没有在YouTube上看过达芬奇机器人是如何工作的。手术前我不想知道，现在我也没准备好看。\n然后，在手术室里瞥了一眼我的多腿机器人朋友后，它的灯熄灭了。\n我知道的下一件事是五个小时后，我躺在医院的病床上，打电话给卡莉，告诉她我的房间号码。恢复区的护士太棒了。我接上了静脉注射器，他们在监视我的进进出出(我的食物、小便和大便)。他们每四个小时做一次，所以你不会在这里睡个好觉，但是很高兴知道他们对你关怀备至。\n在接下来的24小时里，我最大的目标就是四处走动。作为超级英雄，我在手术当天晚上9点试着走路(手术大约在下午6点结束)，然后我站了起来，但我的心跳开始加速，所以我慢慢地回到床上。然后，在午夜，我的护士帮我再试一次，我就这么做了。我像僵尸一样在走廊里走来走去，推着我的静脉输液架走来走去。这是一场巨大的胜利。那天我又走了六次，往返于“野性之旅”和“雨伞学院”第二季的大部分时间之间。\n当然，我的内心感觉就像有人拿了搅拌机给他们，但我现在精神很好，有加州大学旧金山分校的团队卡莉和我妈妈难以置信的支持。\n旁注：静脉注射很有趣。它们就像进入你身体的敞开的端口，允许医疗队移除或添加液体。\n.", "note_en": "The giant robot looks like a WED Treadwell,  my favorite robot of all the Star Wars droids. I admit, I was worried that it would look organic, like a Sentinel from The Matrix, with wriggling Dr. Octopus arms and pinchy pincers that pinch. But I&#39;m calmed by the robot&#39;s EVE-like exterior.\n The room is sterile. A dozen masked, gloved attendants in blue buzz. I imagine I&#39;m an astronaut about to step into the rocketship capsule.\n Except I won&#39;t be going anywhere on this particular journey, unless something goes very, very wrong. In fact, I&#39;ve already been asked repeatedly by various staffers to describe what I&#39;m expecting to happen in this room over the next few hours:\n &#34;I&#39;m here to remove my sigmoid colon via robotic surgery because of the cancerous tumor inside.&#34;\n I&#39;m 34 years old. It&#39;s October 12th, 2020. Five weeks ago I was diagnosed with colon cancer.\n  I&#39;ve always been a standing wiper. Not sure entirely why. I must have once, accidentally, touched a load of poo during a seated wipe. That sort of thing can change a person.\n This charming anecdote does factor into our story, because it means I&#39;ve always had a pretty good sense for my poo. Consistency, quality, and color, both in the bowl and on the TP. Did you know, there&#39;s even a seven-stage scientific classification system for your poo, called the  Bristol stool scale?!\n  I first noticed blood two or three years ago. On a monthly or so cadence, I&#39;d wipe and notice a reddish tinge. Not bright red, more like muddy-red. Poopy-red. Initially, I thought little of it. Just a minor curiousity. It certainly didn&#39;t happen every time. Still, I decided to check off the  Blood in stool box on the forms at my annual physical with my primary care doctor that year.\n A brief aside on the phrase &#34;your primary care doctor.&#34; Like in  Forgetting Sarah Marshall, the last doctor I really thought of as &#34;my doctor&#34; was my pediatrician. Since &#34;becoming an adult&#34;, I&#39;ve lived in three cities in two countries, which means that&#39;ve generally had no idea who my primary care doctor is or was, only that I&#39;d need to find one to give me a referral to get this wart on my foot removed.\n  Anyway, this season&#39;s Dr. Who told me not to worry about the blood. &#34;It&#39;s probably hemorrhoids.&#34;\n WTF is a hemorrhoid? I wondered to myself as I said to him, &#34;Sounds good.&#34; Googled it after, and I learned that it&#39;s a vein that pokes out a little in your butt and doesn&#39;t really want to be poking out a little, so it bleeds. Seems like a thing that can happen, so I more or less returned to regularly scheduled programming and just dealt with the occasional poopy-red wipe. This doc also said I probably don&#39;t need to come for a physical for a few years, that annual physicals are a myth, dry land in a water world.\n Fast-forward to 2020. Everything sucks. And the bloody wipes are making a resurgence. Because, of course, they are. About four months ago I noticed that my first poop of the day (I usually go 2x) would have this purple-red streak embedded in it, like a racing stripe from hell. And it would happen almost without fail every single morning. That just didn&#39;t seem right, no matter what Doctors of Physicals Past told me. And then one morning I felt like I had actual blood dripping from my butt.\n Now I consider myself to be a mostly healthy person. I eat fairly well (even though I enjoy the occasional sourdough loaf and hazy IPA), I run and bike and hike regularly, I ran an IRONMAN in 2016 and a few ultramarathons since. I also don&#39;t like being sick (who does?). But, like with most things in my life, I want to be &#34;good&#34; at health. An ideal dental appointment for me would go something like this, &#34;Wow, Charlie, these are the straightest, whitest teeth we&#39;ve ever seen. We&#39;d like you to come in and be the model for our Instagram ads and also be our 3D teeth model for dentures. Congratulations. Here&#39;s  two free toothbrushes. You also never need to floss again.&#34;\n Anything that deviates from that ideal makes me squirm and I do think I can fix anything. For what it&#39;s worth I still believe that, if I ever encounter a blue flower on a mountain-top, I&#39;m only a few months of mystical training away from becoming Batman. I already have the cape (it&#39;s actually a Harry Potter robe, but, hey, I&#39;m scrappy).\n At the same time, I counterweight this with a mild touch of hypochondria. I&#39;ll see the poison oak in the mistletoe, so to speak. In this case it was a gift. I googled again for  stool, bloody stool and the dreaded  colon cancer came back. Last time, I averted my eyes from these search results. But the bloody racing stripes weren&#39;t going away. I needed to get myself checked out.\n Then I remembered an email from work: I was eligible for a  OneMedical membership. I knew there was hype about OneMedical, certainly I&#39;ve seen the billboards, but I still wasn&#39;t exactly sure what they were all about. It had been a few years since my last physical, as you know, so I was primary-care-less, with a bloody problem on my hands. I downloaded the OneMedical app, uploaded a photo of my insurance card, beep-boop, and I&#39;ve got an appointment with a new doc in a few days in one of their nearby clinics. Already, I loved the experience - I could text my questions any time (see  foot wart above). I&#39;d describe OneMedical as a network of clinics with an app for scheduling appointments and texting with a doc. Sure, ZocDoc kinda does the scheduling thing, but Zocdoc feels like you&#39;re sifting through the classifieds. Gimme some non-user-generated-ratings-based curation, please.\n So, I met with the doc, liked him a lot, discussed my bloody poops, and sheepishly asked if he&#39;d be my new primary care. He agreed, and he also referred me to UCSF for a colonoscopy. Sure, I&#39;m young, and it&#39;s probably hemorrhoids, we agreed, but it&#39;s the only way to be sure.\n After some jiggling about with the referral documentation, we finally get the colonoscopy scheduled for a few weeks later on Sept 9th.\n    What&#39;s a colonoscopy? It&#39;s a surgical procedure where the doctor goes all the way up your butt to see what&#39;s going on in there. You are completely knocked out, so you feel nothing. The only thing you need to do is what we in the business like to call &#34;bowel prep.&#34;\n Allow me to describe bowel prep: the day before the procedure, you will poop your ever-living guts out for a few hours until you are clean-as-a-whistle, stem to stern. They&#39;ll give you a prescription for a gigantic jug of clear laxatives that you&#39;ll drink every 15 minutes or so for a few hours. In today&#39;s toilet-paper hoarding economy, I&#39;d make sure that you are stocked up, because this gets messy.\n Other then the laxatives, you&#39;re allowed to drink clear liquids - which is confusing because you can enjoy such clear liquids as black coffee, Gatorade, broth, even green jello.\n But that&#39;s it. Easy. I watched Stranger Things season 3 again during my bowel prep day. Might not have been the best choice, as I intermittently had to pause Netflix to contribute my own liquified form of the Mind-Flayer, but it got the job done, and I cried my way thru Dustin and Suzie&#39;s hymn to childhood, again, as expected.\n Okay, next, I woke up on September 9th. My appointment is around 2 PM. Normal day, right?\n  A strange, apocalyptic orange-red sky looms over the Bay Area. Here&#39;s what you need to know. Read more:  https://t.co/JxpYSnUPG9  pic.twitter.com/ZPOj4X3jRg\n— San Francisco Chronicle (@sfchronicle)  September 9, 2020\n   I decide to walk over to the UCSF Parnassus building in the creepy Mars firelight, imagining I&#39;m the last man on Earth (and hoping I don&#39;t step on my reading glasses). Carly makes a plan to pick me up in a few hours in our car.\n As expected, the procedure was painless. My only bit of further colonoscopy advice here is to ALWAYS bring a book with you, to every single medical appointment you have, because there&#39;s always going to be some sort of delay or waiting room.\n An hour or so later, I woke up feeling the feels of that post-anesthesia giddiness. Except no one else was happy. Carly was in the room, a surprise to me. And my doctor looked quite serious.\n In addition to two small polyps (which she removed), my colonoscopy surgeon found a tumor in my sigmoid colon. At this point, I don&#39;t know a sigmoid colon from a semi-colon, but I knew it wasn&#39;t good news. Go 2020!\n Despite the odds (my youth, my health), I now had cancer. Well, I probably had it for awhile, but we just found out I had it.\n My doc said I&#39;d need to meet with  UCSF&#39;s colorectal surgery team, and I&#39;d also need to get CT scans (&#34;cat scans&#34;) to see if the cancer had spread anywhere else in my body.\n     We&#39;ve already discussed my vigorous, proto-Batman level of health. And how I&#39;m a fresh-faced, occasionally-bearded, 34 year old with the heart of a child and the strength of a chimpanzee (no, that&#39;s a  humanzee).\n Speaking of unfortunate genetics, it turns out that I have some family history of colon cancer.\n Here&#39;s the scoop: my pops (that&#39;s cool talk for Dad) has had benign (non-cancerous) polyps in his previous colonoscopies. What&#39;s a poylp? It&#39;s a little growth thingy in your colon that may evolve into a tumor. Just like how a Charmander becomes a Charmeleon, polyps can grow bigger and more serious with more destructive power. Polyps are usually just snipped out during your colonoscopy and sent off for pathology (aka to see if they have cancer in them). Most do not. This is the case with my dad&#39;s polyp experience. Even though none of his have been cancerous, he still needs to go in for colonoscopies more regularly than those who don&#39;t have polyps.\n My own tumor began as a lowly polyp, perhaps some ten years ago. We don&#39;t know exactly. But if I&#39;d had a colonoscopy ten years ago, or five years ago, they might have seen it and snipped it out and you wouldn&#39;t be reading this.\n If you go further up the Harrington tree, you&#39;ll learn that my dad&#39;s aunt (my father&#39;s mother&#39;s sister) died of colon cancer in her early 60s. And his other aunt (same side, same family) died of colon cancer in her 80s. Two factoids that I had no idea about until I asked my parents for their help filling out one of the many UCSF cancer history surveys. Also, on my mom&#39;s side, my grandfather&#39;s mother (my great-grandmother, who I never met) probably had colon cancer.\n So, colon cancer is bouncing around in my family tree. But neither of my parents have it, and none of my grandparents had it, which I suppose is good. That said, I learned that my grandparents did have  other sorts of cancers.\n Getting confusing, right? I cannot stress this enough:  Learn your family&#39;s medical history and write it down in a note on your phone. You&#39;ll be asked for this info 10,000 times before every single appointment. But, more importantly, your family history can be a signal to you and your docs whether are &#34;higher-risk&#34; for certain conditions.\n I just didn&#39;t know about any of this. I knew there were some heart attacks in there, but not really about any of the cancer stuff. Ideally, each person would be given some sort of family history report when they&#39;re born or when they turn 18 or when they get their first Nintendo.\n But that&#39;s just it. You don&#39;t get health info automatically. There&#39;s no one, other than you, to own your medical health story.  You must become your own health advocate. Spoiler alert, but this is the number one lesson I learned during this entire cancer experience. Health literacy is just as important as financial literary or literacy literacy.\n There are tools to help, and I&#39;m still digging into them now. I&#39;m much more excited now by the Apple Health stuff on iOS. I&#39;m hoping it can become some sort of private, secure repository for my health data that I carry with me. For example, how many of you, dear readers, know your blood type? There&#39;s all sorts of little info-nuggets that you can track down NOW to pay-it-forward for FUTURE you. Cause, ain&#39;t nobody else gonna. It&#39;s like a scavenger hunt. Okay, enough proselytizing, dude.\n  Back to our story, we&#39;ve just learned that I have a cancerous tumor up my butt and we&#39;ve also filled out a few frightening family history reports. This is where UCSF kicks it into high gear (and, my goodness, do I love UCSF? Yes, yes I do. They are absolutely, amazingly wonderful, competent, and life-changing!).\n I&#39;m now starting to get booked for all sorts of appointments, starting with the ones previously mentioned: (1) CT scans of my abdomen and chest and (2) then the consult with the colorectal surgeon.\n Because, as I later learned from my colorectal surgeon (who is the best!), when colon cancer spreads, it usually does the evolution thing from cancerous polyp (Stage 1) into tumor (Stage 2). After that, it can break through the wall of the colon into the nearby lymph nodes (Stage 3). Finally, it becomes (Stage 4) if it spreads to other organs, the first often being the liver and the lungs. At least, this is how I understand the various stages. I&#39;m sure I&#39;m missing some technical details and nuance. When  reading about Chadwick Boseman, you&#39;ll learn that he was initially diagnosed with Stage 3 colon cancer in 2016, which eventually became Stage 4. In sum, you want your stage to be as low as possible.\n At this point, pre-CT scan, Carly and I have no idea what stage I&#39;m at. Well, we do know that I&#39;m somewhere from 2 - 4. These appointments are going to help us understand where I&#39;m at. Specifically, the CT scans will tell us if I&#39;m Stage 4 or not.\n Carly and I are in a daze for most of the next week. And so are our parents and our siblings. I honestly can&#39;t remember how many friends we told at this point, I know a few, but not that many. I didn&#39;t know what to say or feel.\n Much like the South Park lament &#34;The Simpsons did it!&#34;, there&#39;s usually an  xkcd for whatever you&#39;re feeling or thinking:\n  As a wannabe stoic, I allow my negative visualization to run rampant. I&#39;m thinking of the possibility that I&#39;ve got only a few years (months?) left to live.\n My CT scans are scheduled for Thursday afternoon and the meeting with the surgeon is Friday morning. Between then and now, we have the horrible Internet to do horrible searches and we have the two-page summary printout of my colonoscopy, replete with some terrifying photos of the tumor. The tumor looks like a cross between a tadpole and an eyeball (two things that I&#39;d normally love). I don&#39;t like looking at this picture, at all, but the two-page summary somehow keeps traveling around our house, and no matter where I look, I see the pink tadpole eye staring back at me, and I wonder, &#34;Are you my death sentence?&#34;\n  On Thursday, Carly and I walk over to the UCSF CT scanning place. It&#39;s slightly less hostile to human life outside today, so that&#39;s nice. After checking in with the front desk, I quickly pass through the first waiting room into the second waiting room. There&#39;s always a second waiting room.\n It&#39;s here I realize that the  sound of a major health issue is rapidly opening and shutting hospital doors. I scribble this pithy witicism into the back cover of my paperback copy of  Flow and wait my turn with the CT machine. I&#39;m given two bottles of &#34;contrast&#34; provided by reknowned-drink-maker General Electric to drink. These iodine cocktails will help the machine see my inside stuff. They taste like you&#39;re drinking printer ink. They&#39;re not that bad at all. Everyone else in here is at least fifty years old. I decide to do a five minute wall-sit to prove my vigor. Finally, I&#39;m called back to the machine.\n The CT machine looks like a coldsleep chamber crossed with a Weyland Corporation interdimensional portal. It&#39;s over in less than a minute.\n  The scans are done and now it&#39;s up to the radiologist to read them. I&#39;m sure some neat TensorFlow or PyTorch deep learning computer vision model could help here, but I don&#39;t have access to the dataset.\n The next morning we drive over to the  UCSF Center for Colorectal Surgery. It&#39;s in the beautiful ghost town of the greater Chase Center-Mission Bay area. I look up at the sun before heading in, thinking, &#34;The next time I see you, ball of gas burning billions of miles away (quoth Pumbaa), we&#39;ll know the CT results and we&#39;ll know the plan.&#34;\n  The CT scans were clean. There&#39;s no sign that the cancer spread to other organs, ruling out Stage 4. This is the best news ever.\n The second best news we hear is that the tumor is in a relatively excellent spot for surgery. After an impromptu rectal exam that morning (hello!) to make sure there was no cancer in the rectum, my surgeon gives us an overview of the situation and a plan of attack.\n He&#39;s going to remove my entire  sigmoid colon (which is about a foot long), and then simply reattach the rectum to the rest of the colon. And he&#39;s going to do this all via &#34;robotic surgery&#34; (using the WED Treadwell-like  da Vinci Surgical System), so the scars will be teeny and the recovery much easier.\n We&#39;ll only be able to tell if I&#39;m Stage 2 or Stage 3 post-surgery. He&#39;s planning to remove the nearby lymph nodes and a pathology report will tell us if they&#39;re cancerous. If they&#39;re positive, it&#39;s Stage 3.\n  Carly and I have a plan. We&#39;re planners. We needed this. A bit of our haze is lifted as we head into our next agenda item.\n    Look at those oblivious smiles. Wait -- we aren&#39;t oblivious, I have cancer. We just love eachother.\n Originally slated for 2019, then after bouncing around in 2020, our cute elopement threaded a very small needle with a teeny ceremony and it was beautiful and wonderful and just what we hoped for.\n Now, onto our first act as a married couple: my surgery on Monday, Oct 12th (and another round of bowel prep the day before).\n  I don&#39;t have much to add about the surgery itself. I was there. But I don&#39;t remember anything. Thank goodness. I also haven&#39;t yet watched any YouTubes of how the da Vinci robot works. I didn&#39;t want to know before the surgery, and I&#39;m not quite ready now to see it.\n   And, then, after glimpsing my many-limbed robotic friend in the surgery room, it&#39;s lights out.\n The next thing I know it&#39;s five hours later and I&#39;m in a hospital bed and calling Carly to give her my room number. The nurses in the recovery area are amazing. I&#39;m hooked up to an IV and they&#39;re monitoring my &#34;ins&#34; and my &#34;outs&#34; (my foods and my pees and poops). They do this every four hours, so you&#39;re not exactly going to get a perfect night&#39;s sleep here, but it&#39;s great to know that they&#39;re paying good attention to you.\n The big goal for me for the next 24 hours is to walk around. Being the Big Hero 6 that I am, I try to walk at 9 PM on the day of my surgery (which concluded around 6 PM), and I stand up, but my heart starts racing, so I slowly plop back into bed. Then, at midnight, my nurse helps my try again, and I do it. I shuffle around the hallway like a zombie, wheeling along my IV stand. It&#39;s a huge win. I end up walking six more times that day, between many Breath of the Wild sessions and most of The Umbrella Academy Season 2.\n Sure, my guts feel like someone took a blender to them, but I&#39;m in great spirits, with incredible support from the UCSF team, Carly, and my mom.\n Side note that IVs are interesting. They&#39;re like open ports into your body, allowing the medical team can either remove or add fluid\n......", "posttime": "2020-10-22 09:42:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "结肠癌,colon,医生", "title": "“我的结肠癌”札记", "title_en": "Notes on My Colon Cancer", "transed": 1, "url": "https://www.charlieharrington.com/colon-cancer", "via": "", "real_tags": ["结肠癌", "colon", "医生"]}, {"category": "", "categoryclass": "", "imagename": "e2c3f56646e135bfd578db80220c9ed2.jpg", "infoid": 1030448, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "学习如何定义你的在线角色，并找出不同的方法来扩大你的触角。这是我关于园艺你的推特的系列文章的第一部分。", "note_en": "Learn how to define your online persona, and find out different ways to increase your reach. This is the first part of my series about Gardening Your Twitter.", "posttime": "2020-10-22 09:42:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,园艺,gardening,扩大", "title": "园艺你的推特", "title_en": "Gardening Your Twitter", "transed": 1, "url": "https://steipete.com/posts/growing-your-twitter-followers/", "via": "", "real_tags": ["推特", "园艺", "gardening", "扩大"]}, {"category": "", "categoryclass": "", "imagename": "fb34f5b3e1dc4745e9db3c7aa6ebf0f4.jpg", "infoid": 1030447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它们明亮的碟状眼睛，纽扣鼻子和丰满的毛茸茸的身体，慢吞吞的懒猴-一群小型的夜间活动的亚洲灵长类动物-看起来像可爱的活生生的填充动物。但它们无害的外表掩盖了一种令人震惊的攻击性：它们恶毒地咬了一口，里面装满了腐肉的毒液。更令人惊讶的是，新的研究显示，被它们毒咬的最频繁的接受者是其他行动迟缓的懒猴。\n“这种非常罕见的怪异行为发生在我们最亲近的灵长类亲戚身上，”牛津布鲁克斯大学(Oxford Brookes University)的灵长类保护者安娜·内卡利斯(Anna Nekaris)说，她是周一发表在“当代生物学”(Current Biology)上的这一发现的主要作者。“如果Monty Python上的兔子杀手是一只真正的动物，它们会是缓慢的懒猴--但它们会互相攻击。”\n甚至在这个新发现之前，懒猴就已经作为进化上的怪胎脱颖而出了。科学家们只知道另外五种有毒哺乳动物：吸血蝙蝠、两种地鼠、鸭嘴兽和眼镜蛇(一种发现于古巴、多米尼加共和国和海地的食虫哺乳动物)。\n研究人员刚刚开始解开懒猴毒液的许多谜团。其中一个关键成分与猫皮屑中发现的引发人类过敏的蛋白质相似。但其他不明化合物似乎增加了额外的毒性，并导致极端的疼痛。奇怪的是，为了产生毒液，甜瓜大小的灵长类动物将手臂举过头顶，迅速舔舔位于上臂上的有毒分泌油的腺体。然后毒液聚集在它们有凹槽的犬齿中，这些犬齿足够锋利，可以切开骨头。\n“它们被咬的结果真的非常可怕，”内卡利斯博士说。“它会导致坏死，所以动物可能会失去一只眼睛、头皮或半张脸。”\n在这项研究之前，许多人仍在争论慢速懒猴毒液的主要用途。捕获猎物的可能性被排除了，因为树胶是它们的主要食物。这使得对捕食者或寄生虫的防御成为主要假设。但多年来，坊间证据也暗示，懒猴可能会用它们的毒液来对付自己的毒液。\n例如，懒猴在非法宠物交易中很受欢迎。印尼的非法宠物交易商告诉内卡利斯博士，他们拔掉动物的牙齿不是为了保护未来的主人，而是为了防止迟钝的懒猴相互伤害，破坏它们的价格。接受她采访的偷猎者还抱怨说，有时他们捕捉到的“丑陋”的懒猴身上有大量的疤痕或裂开的伤口，他们不得不放手，因为没有宠物买家会想要它们。\n此外，动物园和救援设施的工作人员报告说，迟钝的懒猴最常见的死亡原因之一是被其他迟钝的懒猴叮咬。\n为了弄清懒猴在自然界中使用毒液的速度有多慢，内卡利斯博士用无线电项圈追踪了82只爪哇懒猴，这是印度尼西亚的一种极度濒危物种。像其他类型的慢猴一样，爪哇懒猴会形成长期的交配对，它们占据着小块区域，其中有一棵或几棵产树胶的树。\n在八年的时间里，研究人员在一片2平方英里的森林中花了7000多个小时监测他们的研究对象。他们每隔几个月就会重新捕获这些动物进行健康检查。\n令人震惊的是，在所有捕获的懒猴中，20%的迟钝懒猴都有新的咬伤-通常是严重的、肉质腐烂的伤害，导致耳朵、脚趾或更多失去。雄性比雌性更频繁地被叮咬，离开父母领地的幼小动物也是如此。虽然坏死伤口是经常发生的，但捕食并不常见；自2012年以来，研究人员只有一只爪哇慢猴死于一只捕食者，这是一只野狗。\n内卡利斯博士和她的同事们得出结论，懒猴具有明显的地域性，它们经常用它们的毒液来解决争端。这使它们跻身于为数不多的已知使用毒液用于这一目的的物种之列，包括锥形蜗牛、幽灵虾和雄性鸭嘴兽。\n斯旺西大学的进化生物学家凯文·阿巴克尔没有参与这项新的研究，他说，这些发现代表着“对我们知识的一个非常酷的补充”。\n伦敦自然历史博物馆(Natural History Museum)的毒液专家罗纳德·詹纳(Ronald Jenner)也没有参与这项研究，他说，这篇论文还为同一物种的个体如何利用毒液相互竞争有限的资源(如配偶或领土)提供了独特的见解-很少有研究对此进行研究。据我所知，这是有史以来对这一主题进行的最广泛的实地研究。", "note_en": "With their bright saucer eyes, button noses and plump, fuzzy bodies, slow lorises — a group of small, nocturnal Asian primates — resemble adorable, living stuffed animals. But their innocuous looks belie a startling aggression: They pack vicious bites loaded with flesh-rotting venom. Even more surprising, new research reveals that the most frequent recipients of their toxic bites are other slow lorises.\n “This very rare, weird behavior is happening in one of our closest primate relatives,” said Anna Nekaris, a primate conservationist at Oxford Brookes University and lead author of the findings,  published Monday in Current Biology. “If the killer bunnies on Monty Python were a real animal, they would be slow lorises — but they would be attacking each other.”\n Even before this new discovery, slow lorises already stood out as an evolutionary oddity. Scientists know of just five other types of venomous mammals:  vampire bats, two species of  shrew,  platypuses and  solenodons (an insectivorous mammal found in Cuba, the Dominican Republic and Haiti).\n Researchers are just beginning to untangle the many mysteries of slow loris venom. One key component resembles the protein found in  cat dander that triggers allergies in humans. But other unidentified compounds seem to lend additional toxicity and cause extreme pain. Strangely, to produce the venom, the melon-sized primates raise their arms above their head and quickly lick venomous oil-secreting glands located on their upper arms. The venom then pools in their grooved canines, which are sharp enough to slice into bone.\n “The result of their bite is really, really horrendous,” Dr. Nekaris says. “It causes necrosis, so animals may lose an eye, a scalp or half their face.”\n   Before this study, many still debated the primary purpose of slow loris venom. Capturing prey was ruled out because tree gum is their primary food. That made defense against predators or  parasites into leading hypotheses. But anecdotal evidence has also hinted for years that slow lorises may use their venom against their own.\n For example, slow lorises are popular in the illegal pet trade. Illegal pet traders in Indonesia told Dr. Nekaris that they remove the animals’ teeth not to protect future owners, but to prevent slow lorises from harming each other and ruining their price. Poachers interviewed by her also complained of sometimes capturing “ugly” slow lorises with extensive scarring or gaping wounds that they had to let go because no pet buyer would want them.\n Additionally, zoo and rescue facility staff report that one of the most frequent causes of death for slow lorises is bites from other slow lorises.\n To get to the bottom of how slow lorises use their venom in nature, Dr. Nekaris used radio collars to track 82 Javan slow lorises, a critically endangered species in Indonesia. Like other types of slow lorises, Javan slow lorises form long-term mating pairs that occupy small territories containing one or several gum-producing trees.\n Over an eight-year span, the researchers spent more than 7,000 hours monitoring their study subjects in a two-square mile patch of forest. They recaptured the animals every few months for health checks.\n Shockingly, across all captures, 20 percent of slow lorises had fresh bite wounds — oftentimes severe, flesh-rotting injuries that entailed a lost ear, toe or more. Males suffered more frequent bites than females, as did young animals dispersing from their parents’ territories. While necrotic wounds were a regular occurrence, predation was not; since 2012, the researchers have lost just one Javan slow loris to a predator, which was a feral dog.\n  Dr. Nekaris and her colleagues concluded that slow lorises are remarkably territorial, and that they frequently use their venom to settle disputes. This puts them among just a handful of other species known to use venom for this purpose, including cone snails, ghost shrimp and male platypuses.\n The findings represent “a really cool addition to our knowledge,” said Kevin Arbuckle, an evolutionary biologist at Swansea University, who was not involved in the new study.\n The paper also lends unique insight into how individuals of the same species may use venom on one another to compete for limited resources such as mates or territory — something that few studies have examined, said Ronald Jenner, a venom specialist at the Natural History Museum in London, who also was not involved in the research. “To my knowledge, this is the most extensive field study ever done on this topic.”", "posttime": "2020-10-22 09:41:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "懒猴,lorises,毒液", "title": "懒猴是世界上仅有的几种有毒哺乳动物之一", "title_en": "Slow lorises are one of the world’s only venomous mammals", "transed": 1, "url": "https://www.nytimes.com/2020/10/19/science/slow-loris-venom.html", "via": "", "real_tags": ["懒猴", "lorises", "毒液"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Pixie，我们正在开发Kubernetes本地监控系统，该系统完全在用户集群内存储和处理结果数据。这是讨论有效构建Kubernetes原生应用程序的技术和最佳实践的一系列帖子中的第一篇。在这篇文章中，我们探讨了使用完全位于集群内的空隙部署和分别在云和集群之间拆分控制和数据平面的系统之间的权衡。\n为Kubernetes平台构建的一个好处是，它简化了将应用程序部署到用户环境的过程，通常只需要几个简单的步骤，如应用一组YAML或安装Helm Chart。在几分钟内，用户就可以轻松地在其群集上拥有该应用程序的运行版本。但是，现在这些应用程序完全在Prem上运行，开发人员很难进行管理。在许多情况下，推出重大更新或错误修复依赖于让用户手动更新其部署。这对开发人员来说是不可靠的，对用户来说是繁重的。\n为了解决这个问题，我们提出了一个互联的本地架构，它将管理应用程序的数据和控制面的责任分别委托给在集群和开发人员管理的云环境中运行的部署。更具体地说，部署在用户集群中的应用程序只负责收集数据并使数据可访问。一旦建立了此数据层的基础，逻辑基本保持稳定，并且不会频繁更新。同时，云托管系统管理应用程序的核心功能和编排。因为云是由开发者自己管理的，所以他们可以自由地执行更新，而不需要依赖用户。这允许开发人员快速迭代其系统的功能，同时保持Prem上的数据局部性。\n这种责任分立的架构在许多硬件产品中很常见，因为外部因素可能会使部署在物理设备上运行的软件的更新具有挑战性。例如，尽管有这些物理限制，Ubiqiti的UI通过将功能委托给他们的云并将他们的物理路由器保持在数据平面内，能够提供丰富的功能集。同样，WebRTC是大多数现代浏览器中内置的标准，用于处理语音和视频数据。尽管浏览器更新不频繁，但分离的数据层和控制层允许开发人员在WebRTC之上自由构建各种不同的应用程序集。这种体系结构在企业软件中仍然相对少见，但已经被流行的产品(如Harness、Streamset和Anthos)采用。\n然而，设计互联的本地架构说起来容易做起来难。在构建这样的系统时，您可能会遇到的一个挑战是如何通过托管在云中的UI从用户集群上运行的应用程序查询数据。为此，我们探索了两种方法：\n为简洁起见，我们将用户集群上运行的应用程序称为卫星。\n在卫星上执行查询的最简单方法是让UI直接向卫星本身发出请求。要做到这一点，UI必须能够从云中获取卫星的(1)状态和(2)地址，以便它知道卫星是否可用于查询以及它应该向何处发出请求。\n跟踪程序状态的常用技术是在程序(卫星)和监控系统(云)之间建立心跳序列。这通常是通过让卫星首先向云发送注册消息来实现的。在注册期间，卫星要么提供标识符，要么通过云分配标识符，该标识符用于在后续的心跳消息中标识卫星。\n注册后，卫星开始向云端发送周期性的心跳信号，以表明它是活的和健康的。可以在这些心跳中发送附加信息。在我们的示例中，我们还附加了卫星的IP地址。或者，如果IP地址不受更改，也可以在注册期间发送。云记录卫星的状态和地址，以便UI可以查询。\n现在，当UI想要向卫星发出请求时，它首先向云查询地址，然后直接向该地址发出请求。\n太棒了！那还不算太糟。在许多情况下，许多云/分布式卫星架构已经通过心跳通信来跟踪卫星状态，因此发送额外的地址不成问题。然而.。如果您的UI在浏览器上运行，并且您的卫星正在通过HTTPS响应(很可能使用自签名证书)，那么您还没有完成……。\n因为卫星的SSL证书，浏览器阻止了我们的请求！用户可以继续并直接导航到卫星的地址，在那里浏览器提示用户是否要绕过无效的证书。\n然而，这将需要在每个卫星上完成，并且会破坏用户的整体体验。可以为IP地址生成SSL证书，但这并不常见，大多数免费的证书颁发机构都不提供此功能。如果卫星的IP地址变化，这种方法也很复杂。\n在您控制的子域下预先生成SSL证书，例如：&lt；uuid&gt；.sat ites.youdomain.com。使用任何免费的证书颁发机构都很容易完成此步骤，如果子域具有众所周知的DNS地址，则可以安全地完成此步骤。您应该确保生成比预期卫星数量更多的SSL证书。\n当卫星注册到云时，应该为其分配一个未使用的SSL证书和关联的子域。SSL证书应该安全地发送到卫星，并且卫星的代理应该更新以使用新的证书。\n当云从其心跳接收到卫星的IP地址时，它会更新卫星子域的DNS记录以指向该IP地址。\n在执行查询时，UI现在可以安全地向卫星分配的子域发出请求，而不是直接向其IP地址发出请求，所有这些都具有有效的证书！\n最后，直接向卫星发出请求比我们最初想象的更复杂(也更麻烦)。该解决方案也不能很好地扩展，因为需要预先生成SSL证书。没有固定的卫星数量，或者没有卫星数量的上限，不久之后，所有的证书都已经分配完毕，需要有人介入并手动生成更多的证书。可以动态生成证书及其DNS记录，但我们发现这些操作可能需要太长时间才能传播到所有网络。还需要注意的是，此方法可能会违反自动生成SSL的服务条款，并且容易受到通配符证书的常见安全风险的影响。\n当卫星位于防火墙之后时，只能由网络内的用户查询。这进一步确保不会有敏感数据离开网络。\n正如在前面的方法中看到的，让UI向云发出请求以避免任何证书错误是最容易的。但是，我们仍然希望由卫星本身来处理实际的查询执行。为了解决这个问题，我们设计了另一种方法，遵循以下一般步骤：\n云必须能够同时处理对许多不同卫星的多个查询。作为响应，卫星将流式传输批量数据，服务器需要将这些数据发送给正确的请求者。有这么多消息来回飞来飞去，所有这些消息都需要包含在它们自己的请求/应答通道中，我们认为这将是消息总线的完美工作。\n我们建立了一个希望消息总线满足的标准列表：\n它应该快速接收和发送消息，特别是在接收端有用户等待的情况下。\n它应该能够处理相对较大的消息。卫星的查询响应可以批处理成许多较小的消息，但是单个数据点的大小仍然不是很小。\n类似地，由于卫星的响应可能被批处理成许多消息，因此消息总线应该能够在任何给定时间处理大量涌入的消息。\n随时开通新频道应该很容易。我们可能希望为每个请求或每个卫星创建一个新频道，所有这些我们都没有固定的数字。\n我们简要地考虑了Google Pub/Sub，它有严格的配额要求(每个Google项目只有10,000个主题)，以及其他项目，如Apache Pulsar。但是，我们主要考虑了两个消息传递系统：Apache Kafka和NATS。卡夫卡和NATS的总体比较已经在其他博客中进行了详细的讨论。在这篇博客文章中，我们的目标是根据上面的要求对这两个系统进行比较。\n我们在很大程度上依赖于其他人执行的基准测试，以基于消息大小和消息量来判断延迟。这些结果倾向于NATS。\n我们还想在我们的特定用例上测试每个系统，并执行以下基准测试：\n服务器上运行的名为RequestProxyer的服务接收消息并将其放在主题A上。\nRequestProxyer读取有关主题B的消息，并将响应写回WebSocket。\n在这种情况下，为基准记录的延迟是从RequestProxyer中接收到WebSocket消息的时间，到服务器从订阅者接收响应消息的时间。\n这些基准测试在具有N1-STANDARD-4节点的3节点GKE集群上运行，具有6字节的静态消息。这些结果可能并不适用于所有环境。我们也承认这些系统不是为这个特定的用例而构建的。\n我们最终选择了NATS作为我们的消息传递系统。上面别人执行的基准测试和我们自己的基准测试表明，NATS能够有效地处理我们的请求和响应消息传递模式。我们还发现，在NATS中即时创建主题非常容易，而在Kafka上创建主题可能相当复杂，因为分区必须在启动前确定。鉴于我们将支持许多短期查询，我们希望避免任何主题创建开销。这些要点，再加上NATS较低的操作复杂性，使其成为我们案件的明显赢家。重要的是要注意到，卡夫卡的系统是为了提供额外的保证而建造的，并有许多积极的方面，这可能是其他用例所必需的。\n我们的查询请求管道的实际实现看起来与我们上面运行的基准测试案例非常相似。\n负责处理查询请求的云服务收到消息，并在新的goroutine中启动一个RequestProxyer实例。\nRequestProxyer为查询生成一个ID，并将查询及其ID转发到正确的卫星，方法是将一条消息放在卫星/&lt；sat_id&gt；NATS主题上。它等待对REPLY-&lt；Query-ID NATS主题的响应。\n负责处理卫星通信(如心跳)的服务订阅了sat/*NATS主题。它读取查询请求，并通过其通常的通信信道将其发送到适当的卫星。卫星将响应流回此服务。然后，该服务将这些响应放在REPLY-&lt；query-id&gt；NATS主题上。\nRequestProxyer接收关于Reply-&lt；query-id&gt；主题的响应，并将它们发送回UI。\n值得注意的是，在这种方式下，由于数据现在是通过云传输，而不是直接从卫星传输到浏览器，因此可能会有额外的网络延迟。\n在防火墙后的群集中，通过云代理请求将允许网络外用户访问数据。这既可以是积极的，也可以是消极的，因为它使应用程序更容易使用，但依赖于离开网络的潜在敏感数据。\n我们在Pixie中使用了这两种方法，并且发现任何一种方法都可以让我们高效可靠地查询客户集群中的数据。通过提供这两个选项，客户可以灵活地选择最符合其安全需求的架构。我们相信这些技术对于任何内部互联架构都很有用，具体的方法应该根据总体用例和特定于系统本身的约束来选择。\n总体而言，为Kubernetes原生应用程序设计一个分离的数据/控制平面架构将帮助开发人员快速迭代，尽管Kubernetes部署具有本地性质。", "note_en": "At Pixie, we are working on a Kubernetes native monitoring system which stores and processes the resulting data entirely within a user’s cluster. This is the first in a series of posts discussing techniques and best practices for effectively building Kubernetes native applications. In this post, we explore the trade-offs between using an air-gapped deployment that lives completely within a cluster and a system which splits the control and data planes between the cloud and cluster, respectively.\n  One benefit of building for the Kubernetes platform is that it simplifies the process of deploying applications to a user’s environment, often requiring only a few simple steps such as applying a set of YAMLs or installing a Helm Chart. Within minutes, users can easily have a running version of the application on their cluster. However, now that these applications are running entirely on prem, it becomes difficult for the developer to manage. In many cases, rolling out major updates or bug fixes relies on having the user manually update their deployment. This is unreliable for the developer and burdensome for the user.\n  To address this problem, we propose a connected on-prem architecture which delegates the responsibility of managing the data and control planes of the application to the deployment running in the cluster and a developer-managed cloud environment, respectively. More concretely, the application deployed in the user’s cluster is solely responsible for collecting data and making that data accessible. Once the foundation of this data layer is established, the logic remains mostly stable and is infrequently updated. Meanwhile, a cloud-hosted system manages the core functionality and orchestration of the application. As the cloud is managed by the developer themselves, they are freely able to perform updates without any dependency on the users. This allows the developer to iterate quickly on the functionality of their system, all while maintaining data locality on prem.\n This split-responsibility architecture is common in many hardware products, since external factors may make it challenging to deploy updates to software running on physical devices. For instance, despite these physical limitations,  Ubiqiti’s UI is able to offer a rich feature-set by delegating functionality to their cloud and keeping their physical routers within the data plane. Similarly,  WebRTC is a standard built into most modern browsers for handling voice and video data. Although browser updates are infrequent, having the separated data and control layers allows developers to freely build a diverse set of applications on top of WebRTC. This architecture is still relatively uncommon in enterprise software, but has been adopted by popular products such as  Harness,  Streamsets, and  Anthos.\n However, designing a connected on-prem architecture is easier said than done. When building such a system, one challenge you may encounter is how to query data from an application running on the user’s cluster via a UI hosted in the cloud. We explore two approaches for doing so:\n  For brevity, we will refer to the application running on the user’s cluster as a satellite.\n  The simplest approach for executing the query on a satellite is to have the UI make the request directly to the satellite itself. To do this, the UI must be able to get the (1) status and (2) address of the satellite from the cloud, so that it knows whether the satellite is available for querying and where it should make requests to.\n   A common technique to track the status of a program is to establish a heartbeat sequence between the program (the satellite) and the monitoring system (the cloud). This is typically done by having the satellite first send a registration message to the cloud. During registration, the satellite either provides an identifier or is assigned an identifier via the cloud, which is used to identify the satellite in subsequent heartbeat messages.\n Following registration, the satellite begins sending periodic heartbeats to the cloud to indicate it is alive and healthy. Additional information can be sent in these heartbeats. In our case, we also attach the satellite’s IP address. Alternatively, the IP address could have been sent during registration, if it is not subject to change. The cloud records the satellite’s status and address so that it can be queried by the UI.\n Now, when the UI wants to make a request to a satellite, it first queries the cloud for the address, then directly makes the request to that address.\n Great! That wasn’t too bad. In many cases, many cloud/distributed satellite architectures already communicate via heartbeats to track satellite state, so sending an additional address is no problem. However... If your UI is running on a browser and your satellite is responding over HTTPS (likely with self-signed certs), you are not done yet...\n   The browser is blocking our requests because of the satellite’s SSL certs! A user could go ahead and navigate directly to the satellite’s address, where the browser prompts the user with whether or not they want to bypass the invalid cert.\n  However, this would need to be done per satellite and is disruptive to the user’s overall experience. It is possible to generate SSL certs for IP addresses, but this is uncommon and isn’t available with most free Certificate Authorities. This approach is also complicated if the satellite’s IP address is subject to change.\n   Pre-generate SSL certs under a subdomain that you control, for instance:  &lt;uuid&gt;.satellites.yourdomain.com. This step is easy to do with any free Certificate Authority  and can be safely done if the subdomain has a well-known DNS address. You should make sure to generate more SSL certs than the number of expected satellites.\n When an satellite registers with the cloud, it should be assigned an unused SSL cert and associated subdomain. The SSL cert should be securely sent to the satellite and the satellite’s proxy should be updated to use the new cert.\n When the cloud receives the satellite’s IP address from its heartbeats, it updates the DNS record for the satellite’s subdomain to point to the IP address.\n When executing queries, the UI can now safely make requests to the satellite’s assigned subdomain rather than directly to its IP address, all with valid certs!\n In the end, making requests directly to the satellites turned out to be more complicated (and hacky) than we’d originally thought. The solution also doesn’t scale well, since the SSL certs need to be pre-generated. Without having a fixed number of satellites, or an upperbound on the number of satellites, it isn’t long before all the certs have been assigned and someone needs to step in and manually generate more. It is possible to generate the certs and their DNS records on the fly, but we’ve found these operations can take too long to propagate to all networks.  It is also important to note that this approach may violate the terms of service for automated SSL generation and is susceptible to usual security risks of wildcard certificates.\n When a satellite is behind a firewall, it will only be queryable by users within the network. This further ensures that no sensitive data leaves the network.\n   As seen in the previous approach, it is easiest to have the UI make requests to the cloud to avoid any certificate errors. However, we still want the actual query execution to be handled by the satellites themselves. To solve this, we architected another approach which follows these general steps:\n  The cloud must be able to handle multiple queries to many different satellites at once. A satellite will stream batches of data in response, which the server needs to send to the correct requestor. With so many messages flying back and forth, all of which need to be contained within their own request/reply channels, we thought this would be the perfect job for a message bus.\n   We built up a list of criteria that we wanted our message bus to fulfill:\n It should receive and send messages quickly, especially since there is a user waiting at the receiving end.\n It should be able to handle relatively large messages. An satellite’s query response can be batched into many smaller messages, but the size of a single datapoint can still be non-trivial.\n Similarly, since an satellite’s response may be batched into many messages, the message bus should be able to handle a large influx of messages at any given time.\n It should be easy to start new channels at any time. We may want to create a new channel per request or per satellite, all of which we have no fixed number.\n We briefly considered Google Pub/Sub, which had strict quota requirements (only 10,000 topics per Google project), and other projects such as Apache Pulsar. However, we primarily considered two messaging systems: Apache Kafka and NATS. General comparisons between Kafka and NATS have been discussed at length in other blogs. In this blog post, we aim to compare these two systems based on our requirements above.\n We relied heavily on benchmarks that  others have performed to judge latency based on message size and message volume. These results lean in favor of NATS.\n We also wanted to test each system on our particular use-case, and performed the  following benchmark to do so:\n A service running on the server, called RequestProxyer, receives the message and puts it on topic A.\n  RequestProxyer reads the message on topic B, and writes a response back out to the WebSocket.\n  In this case, the latency recorded for the benchmark is the time from which the websocket message is received in the RequestProxyer, to the time in which the server receives the response message from the subscriber.\n These benchmarks were run on a 3-node GKE cluster with n1-standard-4 nodes, with a static 6-byte message. These results may not be generalizable to all environments. We also acknowledge that these systems were not built for this particular use-case.\n        We ended up choosing NATS as our messaging system. Benchmarks performed by others and our own benchmark above showed that NATS is capable of efficiently handling our request and response messaging patterns. We also found it was extremely easy to create topics on-the-fly in NATS, whereas creating topics on Kafka can be fairly complicated since partitioning must be determined before start-up. Given that we will support many short-lived queries, we want to avoid any topic creation overhead. These points, paired with the lower operational complexity of NATS made it the clear winner for our case. It is important to note that Kafka&#39;s system is built to provide additional guarantees and has many positives, which may be necessary for other use cases.\n   The actual implementation of our query request pipeline looks very similar to the benchmark case we ran above.\n The cloud service responsible for handling the query requests receives the message and starts up a RequestProxyer instance in a new goroutine.\n The RequestProxyer generates an ID for the query and forwards the query and its ID to the correct satellite by putting a message on the  satellite/&lt;satellite_id&gt; NATS topic. It waits for the response on the  reply-&lt;query-ID NATS topic.\n The service responsible for handling satellite communication (such as heartbeats) is subscribed to the  satellite/* NATS topic. It reads the query request and sends it to the appropriate satellite via its usual communication channels. The satellite streams the response back to this service. The service then puts these responses on the  reply-&lt;query-id&gt; NATS topic.\n The RequestProxyer receives the responses on the  reply-&lt;query-id&gt; topic and sends them back to the UI.\n It is worth noting that in this approach, since data is now funneled through the cloud rather than directly from the satellite to the browser, there may be additional network latency.\n In clusters behind a firewall, proxying the request through the cloud will allow data access to out-of-network users. This can be both a positive and negative, as it makes the application easier to use but relies on potentially sensitive data exiting the network.\n  We use both approaches in Pixie, and have found either method allows us to efficiently and reliably query data from our customer’s clusters. By providing both options, customers have the flexibility of choosing the architecture that best meets their security needs. We believe these techniques can be useful for any on-prem connected architecture, and the particular approach should be chosen depending on the overall use-case and constraints specific to the system itself.\n Overall, designing an split data/control plane architecture for Kubernetes native applications will help developers iterate quickly despite the on-prem nature of Kubernetes deployments.", "posttime": "2020-10-22 09:41:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "群集,kubernetes,卫星", "title": "通过部署群集内数据平面构建Kubernetes原生SaaS应用", "title_en": "Building Kubernetes native SaaS applications by deploying in-cluster data planes", "transed": 1, "url": "https://blog.pixielabs.ai/blog/hybrid-architecture/hybrid-architecture/", "via": "", "real_tags": ["群集", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Asciidoctor是一个快速、开源的文本处理器和发布工具链，用于将AsciiDoc内容转换为HTML5、DocBook、PDF和其他格式。Asciidoctor是用Ruby编写的，可在所有主要操作系统上运行。Asciidoctor项目托管在GitHub上。\n为了简化安装，Asciidoctor被打包并作为RubyGems.org的RubyGem(又名gem)分发给RubyGems.org。它还作为流行的Linux发行版和MacOS的软件包分发。除了在Ruby上运行之外，Asciidoctor还可以使用AsciidoctorJ在JVM上执行，或者使用Asciidoctor.js在任何JavaScript环境(包括浏览器)中执行。\n我们想表彰我们的赞助商通过支持这个项目来改善技术文档状况的承诺。谢谢赞助商！没有你们的慷慨支持，Asciidoctor就不可能实现。\nAsciidoctor读取以纯文本编写的内容，如下图左侧面板所示，并将其转换为HTML5，如右侧面板所示。Asciidoctor将默认样式表应用于HTML5文档，以提供愉快的开箱即用体验。\nAsciidoctor读取并解析以AsciiDoc语法编写的文本，然后将解析树提供给一组内置转换器以生成HTML5、DocBook 5和手册页输出。您可以选择使用自己的转换器或加载支持倾斜的模板来自定义生成的输出或生成其他格式。\nAsciidoctor是其前身AsciiDoc Python(asciidoc.py)的临时替代品。Asciidoctor测试套件有2350个测试，以确保与AsciiDoc语法兼容。\n除了经典的AsciiDoc语法之外，Asciidoctor还识别其他标记和格式选项，例如基于字体的图标(例如，icon：fire[])和UI元素(例如，button：[save])。Asciidoctor还提供了基于Foundation的现代、响应迅速的主题，以设置HTML5输出的样式。\n您可以使用JRuby在JVM上运行Asciidoctor。要直接从Java和其他JVM语言调用Asciidoctor API，请使用AsciidoctorJ。Apache Maven、Gradle和Javadoc都有可用的插件，这些插件允许您使用AsciidoctorJ将AsciiDoc处理直接集成到您的构建中。\nAsciidoctor也可以在JavaScript中运行。Opal用于将Ruby源代码转换为JavaScript以生成Asciidoctor.js。Asciidoctor.js是一个全功能版本的Asciidoctor，可以在任何JavaScript环境下工作，例如Web浏览器或Node.js。它用于支持Chrome、Atom、支架和其他基于Web的工具的AsciiDoc预览扩展。\nAsciidoctor可以在Linux、MacOS和Windows上运行，并且需要以下Ruby实现之一：\n如果您使用的是非英语Windows环境，则在调用Asciidoctor时可能会遇到Encoding：：UnfinedConversionError。要解决此问题，我们建议将控制台中的活动代码页更改为UTF-8：\n一旦您进行了此更改，所有的Unicode难题都将不复存在。如果您使用的是Eclipse之类的IDE，请确保在那里也将编码设置为UTF-8。当您在任何地方使用UTF-8时，Asciidoctor都能工作得最好。\n可以使用(A)适用于流行Linux发行版的软件包管理器、(B)适用于MacOS的Homebrew、(C)gem install命令(建议Windows用户使用)、(D)Asciidoctor Docker映像或(E)捆绑程序来安装Asciidoctor。\n使用操作系统的包管理器安装gem的好处是，如果您的计算机上尚未安装Ruby和RubyGems库，则它可以处理这些包的安装。\n软件包管理器安装的Asciidoctor版本可能与最新版本的Asciidoctor不匹配。请咨询您的发行版的软件包存储库，以了解每个发行版打包的是哪个版本。\n如果您想使用比软件包管理器安装的版本更新的Asciidoctor版本，请参阅gem安装说明。\n在Debian和基于Debian的发行版(如Ubuntu)上，使用apt安装Asciidoctor。要安装该软件包，请打开终端并键入：\n在基于RPM的Linux发行版(如Fedora、CentOS和RHEL)上，使用DNF软件包管理器安装Asciidoctor。要安装该软件包，请打开终端并键入：\n您可以使用MacOS软件包管理器HomeBREW安装Asciidoctor。如果您的计算机上没有HomeBREW，请先完成brew.sh上的安装说明。一旦安装了HomeBREW，您就可以安装asciidoctor gee了。打开终端并键入：\nHomebrew将asciidoctor gem安装到独立于系统gem的独占前缀中。\n或者使用RubyInstaller，下载适用于您的Windows版本的软件包，然后在安装之后继续执行gem安装说明。\n在使用gem install安装Asciidoctor之前，您应该使用RVM在您的主目录(即用户空间)中安装Ruby。然后，您可以安全地使用gem命令安装或更新Asciidoctor gem。使用RVM时，gem安装在与系统隔离的位置。\n要升级gem，请在Gemfile中指定新版本，然后再次运行包。不建议使用包更新(不指定gem)，因为它还会更新其他gem，这可能不是预期的结果。\n如果您使用软件包管理器安装了Asciidoctor，则您的操作系统可能配置为自动更新软件包，在这种情况下，您不需要手动更新gem。\n如果以前使用gem命令安装了Asciidoctor，则需要在发布新版本时手动升级Asciidoctor。您可以通过键入以下命令升级GEM：\n使用gem install安装新版本的gem时，最终会安装多个版本。使用以下命令删除旧版本：\n如果成功安装了Asciidoctor gem，则您的PATH上将提供asciidoctor命令行界面(CLI)。要验证它是否可用，请在您的终端中运行以下命令：\n您应该会在终端中看到有关Asciidoctor版本和Ruby环境的信息。\nAsciidoctor还提供API。该API旨在与其他Ruby软件集成，如Rails、Sinatra和GitHub，以及其他语言，如Java(通过AsciidoctorJ)和JavaScript(通过Asciidoctor.js)。\nAsciidoctor命令允许您从命令行(即终端)调用Asciidoctor。\n以下命令将文件readme.adoc转换为HTML，并将结果保存到同一目录下的文件readme.html中。生成的HTML文件的名称通过将其文件扩展名更改为.html来派生自源文件。\n您可以通过添加各种标志和开关来控制Asciidoctor处理器，您可以了解如何使用这些标志和开关：\n请参考以下资源了解有关如何使用asciidoctor命令的更多信息。\n通过API使用Asciidoctor时，默认的安全模式为：secure。在安全模式下，将禁用几个核心功能，包括include指令。如果要启用这些功能，则需要将安全模式显式设置为：server(推荐)或：safe。\n您还可以使用以下方法将AsciiDoc字符串转换为可嵌入的HTML(用于插入到HTML页面中)：\nHttps://asciidoctor.org[AsciiDoc].写作艺术中的Content=&#39；_Zen_。&#39；html=Asciidoctor.Convert内容，Header_Footer：true，Safe：：Safe。\n如果您需要访问解析的文档，可以将转换拆分成离散的步骤：\nHttps://asciidoctor.org[AsciiDoc].写作艺术中的Content=&#39；_Zen_。&#39；document=Asciidoctor.load content，HEADER_FOOTER：TRUE，SAFE：：Safeput Docent.doctitlehtml=Docent.Convert。\n请记住，如果您不喜欢Asciidoctor生成的输出，您可以更改它！Asciidoctor支持自定义转换器，可以处理从解析的文档到生成的输出的转换。\n一种简单的逐段定制输出的方法是使用模板转换器，模板转换器允许您提供支持倾斜的模板文件来处理文档中任何节点的转换。\n无论如何，您都可以100%控制输出。有关如何使用API或自定义输出的详细信息，请参阅用户手册。\n欢迎新投稿人！如果您在源代码、文档或网站内容中发现错误或遗漏，请毫不犹豫地提交问题或打开带有修复的拉取请求。\n贡献指南提供了有关如何创建问题、功能请求、代码和文档以及如何向Asciidoctor项目提交问题、功能请求、代码和文档的信息。\nAsciidoctor是为了帮助您轻松编写和发布您的内容而开发的。但是，没有您的反馈，我们无法做到这一点！我们鼓励您在讨论列表、Twitter或聊天室中提出问题并讨论项目的任何方面。\nGitHub上的Asciidoctor组织托管项目的源代码、问题跟踪器和子项目。\n版权所有©2012-2019 Dan Allen、Sarah White、Ryan Waldron和Asciidoctor的个人贡献者。本软件的使用是根据MIT许可条款授予的。\nAsciidoctor由丹·艾伦和莎拉·怀特领导，在Asciidoctor令人敬畏的社区中收到了许多个人的贡献。该项目由瑞安·沃尔德隆于2012年发起，基于尼克·亨格维尔德撰写的原型。\nAsciiDoc是由Stuart Rackham创立的，已经收到了AsciiDoc社区中许多个人的贡献。", "note_en": "Asciidoctor is a  fast,  open source text processor and publishing toolchain for converting  AsciiDoc content to HTML5, DocBook, PDF, and other formats.Asciidoctor is written in Ruby and runs on all major operating systems.The Asciidoctor project is  hosted on GitHub.\n To simplify installation, Asciidoctor is packaged and distributed as a RubyGem (aka gem) to  RubyGems.org.It’s also distributed as a package for popular Linux distributions and macOS.In addition to running on Ruby, Asciidoctor can be executed on a JVM using  AsciidoctorJ or in any JavaScript environment (including the browser) using  Asciidoctor.js.\n We want to recognize our  sponsors for their commitment to improving the state of technical documentation by supporting this project.Thank you sponsors!Without your generous support, Asciidoctor would not be possible.\n Asciidoctor reads content written in plain text, as shown in the panel on the left in the image below, and converts it to HTML5, as shown rendered in the right panel.Asciidoctor applies a default stylesheet to the HTML5 document to provide a pleasant out-of-the-box experience.\n Asciidoctor reads and parses text written in the AsciiDoc syntax, then feeds the parse tree to a set of built-in converters to produce HTML5, DocBook 5, and man(ual) page output.You have the option of using your own converter or loading  Tilt-supported templates to customize the generated output or produce additional formats.\n Asciidoctor is a drop-in replacement for its predecessor, AsciiDoc Python ( asciidoc.py).The Asciidoctor test suite has  &gt; 2,350 tests to ensure compatibility with the AsciiDoc syntax.\n In addition to the classic AsciiDoc syntax, Asciidoctor recognizes additional markup and formatting options, such as font-based icons (e.g.,  icon:fire[]) and UI elements (e.g.,  button:[Save]).Asciidoctor also offers a modern, responsive theme based on  Foundation to style the HTML5 output.\n You can run Asciidoctor on the JVM using JRuby.To invoke the Asciidoctor API directly from Java and other JVM languages, use  AsciidoctorJ.There are plugins available for  Apache Maven,  Gradle, and  Javadoc, which allow you to integrate AsciiDoc processing directly into your build using AsciidoctorJ.\n Asciidoctor also runs in JavaScript. Opal is used to transcompile the Ruby source to JavaScript to produce  Asciidoctor.js.Asciidoctor.js is a fully-functional version of Asciidoctor that works in any JavaScript environment, such as a web browser or Node.js.It’s used to power the AsciiDoc preview extensions for Chrome, Atom, Brackets and other web-based tooling.\n Asciidoctor works on Linux, macOS and Windows and requires one of the following implementations of  Ruby:\n  If you’re using a non-English Windows environment, you may bump into an  Encoding::UndefinedConversionError when invoking Asciidoctor.To solve this issue, we recommend changing the active code page in your console to UTF-8:\n  Once you make this change, all your Unicode headaches will be behind you.If you’re using an IDE like Eclipse, make sure you set the encoding to UTF-8 there as well.Asciidoctor works best when you use UTF-8 everywhere.\n Asciidoctor can be installed using (a) package managers for popular Linux distributions, (b) Homebrew for macOS, (c) the  gem install command (recommended for Windows users), (d) the Asciidoctor Docker image, or (e) Bundler.\n The benefit of using your operating system’s package manager to install the gem is that it handles installing Ruby and the RubyGems library if those packages are not already installed on your machine.\n The version of Asciidoctor installed by the package manager may not match the latest release of Asciidoctor.Consult the package repository for your distribution to find out which version is packaged per distribution release.\n  If you want to use a version of Asciidoctor that is newer than what is installed by the package manager, see the  gem installation instructions.\n   On Debian and Debian-based distributions such as Ubuntu, use APT to install Asciidoctor.To install the package, open a terminal and type:\n On RPM-based Linux distributions, such as Fedora, CentOS, and RHEL, use the DNF package manager to install Asciidoctor.To install the package, open a terminal and type:\n You can use Homebrew, the macOS package manager, to install Asciidoctor.If you don’t have Homebrew on your computer, complete the installation instructions at  brew.sh first.Once Homebrew is installed, you’re ready to install the  asciidoctor gem.Open a terminal and type:\n  Homebrew installs the  asciidoctor gem into an exclusive prefix that’s independent of system gems.\n Or you use the  Rubyinstaller, download the package for your Windows Version and after the installation go ahead with  gem installation instructions.\n Before installing Asciidoctor using  gem install, you should use  RVM to install Ruby in your home directory (i.e., user space).Then, you can safely use the  gem command to install or update the Asciidoctor gem.When using RVM, gems are installed in a location isolated from the system.\n  To upgrade the gem, specify the new version in the Gemfile and run  bundle again.Using  bundle update (without specifying a gem) is  not recommended as it will also update other gems, which may not be the desired result.\n If you installed Asciidoctor using a package manager, your operating system is probably configured to automatically update packages, in which case you don’t need to update the gem manually.\n     If you previously installed Asciidoctor using the  gem command, you’ll need to manually upgrade Asciidoctor when a new version is released.You can upgrade the gem by typing:\n  When you install a new version of the gem using  gem install, you end up with multiple versions installed.Use the following command to remove the old versions:\n If the Asciidoctor gem installed successfully, the  asciidoctor command line interface (CLI) will be available on your PATH.To verify it’s available, run the following in your terminal:\n  You should see information about the Asciidoctor version and your Ruby environment printed in the terminal.\n  Asciidoctor also provides an API.The API is intended for integration with other Ruby software, such as Rails, Sinatra and GitHub, and other languages, such as Java (via  AsciidoctorJ) and JavaScript (via  Asciidoctor.js).\n The  asciidoctor command allows you to invoke Asciidoctor from the command line (i.e., a terminal).\n The following command converts the file README.adoc to HTML and saves the result to the file README.html in the same directory.The name of the generated HTML file is derived from the source file by changing its file extension to  .html.\n  You can control the Asciidoctor processor by adding various flags and switches, which you can learn about using:\n     Refer to the following resources to learn more about how to use the  asciidoctor command.\n When using Asciidoctor via the API, the default safe mode is  :secure.In secure mode, several core features are disabled, including the  include directive.If you want to enable these features, you’ll need to explicitly set the safe mode to  :server (recommended) or  :safe.\n You can also convert an AsciiDoc string to embeddable HTML (for inserting in an HTML page) using:\n   content =   &#39; _Zen_ in the art of writing https://asciidoctor.org[AsciiDoc]. &#39;html =  Asciidoctor.convert content,  header_footer:  true,  safe:  :safe\n If you need access to the parsed document, you can split the conversion into discrete steps:\n content =   &#39; _Zen_ in the art of writing https://asciidoctor.org[AsciiDoc]. &#39;document =  Asciidoctor.load content,  header_footer:  true,  safe:  :safeputs document.doctitlehtml = document.convert\n Keep in mind that if you don’t like the output Asciidoctor produces,  you can change it!Asciidoctor supports custom converters that can handle converting from the parsed document to the generated output.\n One easy way to customize the output piecemeal is by using the template converter.The template converter allows you to supply a  Tilt-supported template file to handle converting any node in the document.\n However you go about it, you  can have 100% control over the output.For more information about how to use the API or to customize the output, refer to the  user manual.\n New contributors are always welcome!If you discover errors or omissions in the source code, documentation, or website content, please don’t hesitate to submit an issue or open a pull request with a fix.\n   The  Contributing guide provides information on how to create, style, and submit issues, feature requests, code, and documentation to the Asciidoctor Project.\n Asciidoctor is developed to help you easily write and publish your content.But we can’t do it without your feedback!We encourage you to ask questions and discuss any aspects of the project on the discussion list, on Twitter or in the chat room.\n  The Asciidoctor organization on GitHub hosts the project’s source code, issue tracker, and sub-projects.\n Copyright © 2012-2019 Dan Allen, Sarah White, Ryan Waldron, and the individual contributors to Asciidoctor.Use of this software is granted under the terms of the MIT License.\n Asciidoctor is led by  Dan Allen and  Sarah White and has received contributions from  many individuals in Asciidoctor’s awesome community.The project was initiated in 2012 by  Ryan Waldron and based on  a prototype written by  Nick Hengeveld.\n AsciiDoc was started by Stuart Rackham and has received contributions from many individuals in the AsciiDoc community.", "posttime": "2020-10-22 09:41:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "海鞘,asciidoctor", "title": "海鞘动物", "title_en": "Asciidoctor", "transed": 1, "url": "https://asciidoctor.org/", "via": "", "real_tags": ["海鞘"]}]