[{"category": "", "categoryclass": "", "imagename": "cc3881b390cf1e4e24bbc69d0fc92aad.png", "infoid": 1009063, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈德森在他的投资者生涯中见过很多初创公司，他知道在还没有产品的情况下，如何才能推销一个想法。正如他将解释的那样，这通常是一项很难学习的技能，需要练习才能制定出正确的信息，既能显示可实现的目标，又能让投资者放心。\n查尔斯·哈德森(Charles Hudson)是先驱风险投资公司的管理合伙人，在那里他专注于对构建B2B和B2C软件应用程序的公司进行种子前投资。在此之前，他是Uncork Capital(前身为SoftTech VC)和美国中央情报局(Central Intelligence Agency)风险投资部门In-Q-tel的投资者。一路上，他在初创公司和组织担任过各种高管和董事会职位。\n哈德森在TC早期的会议是早期创始人的必看之处。初创企业最初是一个想法，通常这个想法需要资金才能转化为产品。哈德森将帮助向创始人展示如何在产品制造之前让投资者买入这一概念。\nTC早期阶段在7月份进行了两天多的时间，大约有50多名专家参与了初创企业的核心能力，如筹资、运营和营销。这个虚拟活动展示了初创企业世界中一些最好的运营商、投资者和创始人。听听Ann Miura-Ko关于如何找到适合市场的产品。阿里·帕尔托维(Ali Partovi)将谈论如何聘用早期工程师，卡林·马鲁尼(Caryn Marooney)的会议将探讨如何让你的品牌脱颖而出。\n更重要的是，大多数演讲者碰巧是投资者，他们都参加了TechCrunch的CrunchMatch，这是我们的项目，基于共同的兴趣将创始人与投资者联系起来。\n这是小字。在50多个分组会议中，每个分组会议的出席人数限制在100人左右。当然，我们预计会有更多的参会者，所以每个课程的注册都是以先到先得的方式进行的。\n今天买票，你就可以报名参加我们今天宣布的突破，以及那些已经发布的突破。通行证持有者也将在我们宣布下一批之前收到24小时的提前通知。(是的，如果存在日程冲突，您可以“放弃”分组会议，转而选择新的分组会议。)。\n今天就可以获得TTC早期通行证，并进入我们今天宣布的会议以及未来几天将发表的会议的内部轨道。", "note_en": "Hudson has seen a lot of startups over his career as an investor and knows what it takes to sell an idea when there isn’t yet a product. As he’ll explain, this is often a tough skill to learn, and it takes practice to craft the correct message that shows obtainable goals while putting the investor at ease.\n Charles Hudson is a managing partner at  Precursor Ventures,   where he focuses on pre-seed investments in companies building B2B and B2C software applications. Before this role, he was an investor at Uncork Capital (formerly SoftTech VC) and In-Q-Tel, the VC arm of the U.S.’s Central Intelligence Agency. Along the way, he’s held various executive and board positions at startups and organizations.\n  Hudson’s session at  TC Early Stage is a must-watch for early-stage founders. Startups begin as an idea, and often that idea needs funds to turn into a product. Hudson will help show founders how to get an investor to buy into the concept before the product is built.\n TC Early Stage takes place over two days in July and features   50+ experts across startup core competencies , such as fundraising, operations, and marketing. The virtual event features some of the best operators, investors, and founders in the startup world. Hear from Ann Miura-Ko on how to find a product-market fit. Ali Partovi is set to talk about how to hire early engineers, and Caryn Marooney’s session will explore how to make your brand stand out.\n What’s more, most of the speakers, who happen to be investors, are participating in TechCrunch’s CrunchMatch, our program that connects founders to investors based on shared interests.\n Here’s the fine print. Each of the 50+ breakout sessions is limited to around 100 attendees. We expect a lot more attendees, of course, so signups for each session are on a first-come, first-serve basis.\n Buy your ticket today , and you can sign up for the breakouts we are announcing today, as well as those already published. Pass holders will also receive 24-hour advance notice before we announce the next batch. (And yes, you can “drop” a breakout session in favor of a new one, in the event there is a schedule conflict.)\n Get your   TC Early Stage pass today  and jump into the inside track on the sessions we announced today, as well as the ones to be published in the coming days.", "posttime": "2020-07-01 00:01:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "charles,投资者", "title": "\n听查尔斯·哈德森解释如何在早期阶段推销一个想法(没有产品)", "title_en": "\n\t\t\t\tHear Charles Hudson explain how to sell an idea (without a product) at Early Stage\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/hear-charles-hudson-explain-how-to-sell-an-idea-without-a-product-at-early-stage/", "via": "", "real_tags": ["charles", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "556850edbc271017f59ea52a4979399f.jpeg", "infoid": 1009061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纽约时报”的文章将不再出现在苹果新闻应用程序中。今天，“纽约时报”宣布终止与苹果新闻的合作关系。问题似乎是，虽然其他服务，如谷歌新闻，将读者送到出版商的网站，但苹果新闻通常会让读者留在应用程序中。或者，正如“纽约时报”所说，苹果的做法与“纽约时报”与付费读者建立直接关系的目标不符。\n时报首席运营官梅雷迪思·科皮特·列文(Meredith Kopit Levien)在给员工的备忘录中写道，“时报和平台之间健康模式的核心是让这些读者回到我们的环境中，在我们的环境中，我们控制着报告的呈现、与读者的关系，以及我们业务规则的性质。”“我们与苹果新闻的关系不符合这些参数。”\n时报是首批离开Apple News的媒体机构之一，它从来都不是苹果付费订阅服务Apple News+的一部分，后者很难招募到一些较大的出版商。但科技公司和新闻出版商之间的紧张关系并不是什么新鲜事。\n在“纽约时报”分享的一份声明中，苹果发言人表示，苹果新闻“致力于通过成熟的广告、订阅和商务商业模式支持高质量的新闻报道”。", "note_en": "Articles from  The New York Times will no longer appear in the Apple News app. Today, the  NYT  announced that it is ending its partnership with Apple News. The issue seems to be that while other services, like Google News, send readers to publishers’ websites, Apple News generally keeps readers in the app. Or, as  NYT puts it, Apple’s approach does not align with The Times’ goal of building direct relationships with paying readers.\n “Core to a healthy model between The Times and the platforms is a direct path for sending those readers back into our environments, where we control the presentation of our report, the relationships with our readers, and the nature of our business rules,” Meredith Kopit Levien, The Times’ chief operating officer, wrote in a memo to employees. “Our relationship with Apple News does not fit within these parameters.”\n  The Times is one of the first media organizations to leave Apple News, and it was never a part of Apple’s paid subscription service  Apple News+, which had a  hard time recruiting some of the larger publishers. But the tension between tech companies and news publishers is nothing new.\n In a statement shared by  The NYT, an Apple spokesperson said that Apple News is “committed to supporting quality journalism through the proven business models of advertising, subscriptions, and commerce.”", "posttime": "2020-07-01 00:00:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,文章,times,读者", "title": "《纽约时报》将其文章从苹果新闻中删除", "title_en": "The New York Times Removes Its Articles From Apple News", "transed": 1, "url": "https://www.engadget.com/new-york-times-leaves-apple-news-app-183623496.html", "via": "", "real_tags": ["苹果", "apple", "文章", "times", "读者"]}, {"category": "", "categoryclass": "", "imagename": "f34020ccea9b8c59e47b4c609b849bc2.jpg", "infoid": 1009060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它应该是一个关于不同的压迫结构如何相互作用的理论，但它并不完全是可证伪的，因为这个理论是用来纠正这种压迫的，因此创造了新的等级结构，改变了你已经观察到的结构。例如，与马克思主义社会和阶级斗争理论相比，共产主义革命实际上创造了一套具有压迫关系的新阶级，但一直假装旧的阶级仍然有效和有效。受害者变成了欺凌弱小的人，并以声称自己仍然是受害者来为他们的欺凌行为辩护。", "note_en": "It’s supposed to be a theory about how different structures of oppression interact, but it’s not exactly falsifiable because the theory is meant to be used to correct for this oppression, and therefore creates new hierarchical structures which change the ones you already observe. Compare for example to the Marxist societies and the theory of class warfare, where communist revolution actually created a new set of classes with oppressive relationships, but kept pretending that the old set of classes were still valid and in force. The victims become the bullies, and justify their bullying by claiming they’re still the victims.", "posttime": "2020-06-30 23:51:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "引脚,language,理论", "title": "更新SPI引脚标签的语言以删除对奴隶制的随意引用", "title_en": "Updating the Language of SPI Pin Labels to Remove Casual References to Slavery", "transed": 1, "url": "https://hackaday.com/2020/06/29/updating-the-language-of-spi-pin-labels-to-remove-casual-references-to-slavery/", "via": "", "real_tags": ["引脚", "language", "理论"]}, {"category": "", "categoryclass": "", "imagename": "6e554fa84199a90c2d5d047c4dbcc509.png", "infoid": 1009058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们再次宣布，谷歌已经收购了诺斯，它是人机界面和智能眼镜领域的先驱。他们已经建立了强大的技术基础，我们很高兴有诺思加入我们的更广泛的努力，以建立有用的设备和服务。\n从个人电脑上的10个蓝色链接，到手机上的地图，再到厨房里分享食谱的谷歌Nest Hub，谷歌一直努力为人们的日常生活提供帮助。我们正在建设一个帮助你的未来，在这个未来，你的所有设备都在一起工作，技术消失在背景中。我们称之为环境计算。\n随着我们继续投资于我们的硬件努力和环境计算未来，诺斯的技术专长将会有所帮助。他们将加入总部设在加拿大滑铁卢基奇纳的谷歌团队，基奇纳是北方的家乡，也是一个拥有令人印象深刻的技术人才的地区。我们非常高兴地欢迎我们的新同事，并致力于不断发展的基奇纳滑铁卢全球科技社区。有关这一声明对North及其客户和合作伙伴社区意味着什么的更多信息，请阅读North创始人的这篇博客文章。", "note_en": "Today we&#39;re announcing that Google has acquired North, a pioneer in human computer interfaces and smart glasses. They&#39;ve built a strong technology foundation, and we&#39;re excited to have North join us in our broader efforts to build helpful devices and services.\n  From 10 blue links on a PC, to Maps on your mobile phone, to Google Nest Hub sharing a recipe in the kitchen, Google has always strived to be helpful to people in their daily lives. We’re building towards a future where helpfulness is all around you, where all your devices just work together and technology fades into the background. We call this ambient computing.\n  North’s technical expertise will help as we continue to invest in our hardware efforts and ambient computing future. They&#39;ll join the Google team based in Kitchener-Waterloo, Canada—North’s hometown and an area with impressive tech talent. We&#39;re excited to welcome our new colleagues, and committed to the growing global tech community of Kitchener-Waterloo. For more on what this announcement means for North and its community of customers and partners, read this  blog post from North’s founders.", "posttime": "2020-06-30 23:50:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,acquires,技术", "title": "谷歌收购北方", "title_en": "Google Acquires North", "transed": 1, "url": "https://blog.google/products/hardware/focus-helpful-devices-google-acquires-north/", "via": "", "real_tags": ["google", "谷歌", "acquires", "技术"]}, {"category": "", "categoryclass": "", "imagename": "121fa6767a545f6288ab23eeba8e31f3.jpg", "infoid": 1009057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "A‘这是什么？’HI Sutton在他的Covert Shores网站上获得了来自FishMonster的Facebook视频，视频显示上周在佛罗里达州基韦斯特附近发现了一辆奇怪的车辆。实际上，它水面上唯一的部分是一个支撑天线阵列的桅杆。这辆车几乎可以肯定是美国Liquid Robotics公司(现在归波音公司BA﻿所有)制造的波浪滑翔机，这些天线表明它是美国海军一个名为传感器托管自主遥控飞机(SHARC)项目的一部分。\n这个物体起初看起来像碎片-但它是在自己的力量下移动的。波浪滑翔机利用自然能量为持续数周、数月或数年的任务提供动力，无需加油。表面有一个“浮子”，就像一个10英尺长的冲浪板，上面覆盖着太阳能电池，驱动着它的电子设备。它通过系绳连接到30英尺以下的水下“潜艇”单元。随着海浪将冲浪板上下移动，铰接式潜水器会将上下运动转化为向前运动(这里的视频演示了这一动作)。典型的速度只有1-3节，但波浪滑翔机可以无限期地前进；2013年，滑翔机进行了一次史诗般的8000英里(约合1800公里)、长达一年的横渡太平洋之旅。\n尽管它们已经被用于科学研究，但它们的长期耐力和低调使波浪滑翔机成为军事情报收集的理想选择，这可能是波音在2016年收购Maker Liquid Robotics的原因。多年来，美国海军一直在与波浪滑翔机合作，对它们狩猎潜艇的潜力表现出了兴趣。波浪滑翔机可以长时间游荡，拖着水下声纳阵列，进行通信和联系，将飞机或船只引导到目标上。一支低成本的波浪滑翔机舰队可以缓慢地扫过感兴趣的区域，覆盖的区域比几艘昂贵的载人船大得多。\n海军的潜猎浪滑翔机被称为传感器托管自主研究飞船，简称SHARC。2011年，海军开始为他们的实验SHARC滑翔机配备“拖曳阵列集成”(Tail)，这是一种被动拖曳声阵。这是一套专门的灵敏水听器，它利用滑翔机安静的推进能力来接收远处的船用发动机。(它还提供了首字母缩写SHARC Tail)。\n从那时起，海军的波浪滑翔机计划变得更加雄心勃勃。目前的研发预算文件显示，2019年和2020年的研发支出为每年600万美元，2021年翻了一番，2022年随着项目完成而逐渐减少。SHARC现在是使用自主无人驾驶系统收集信息的更广泛努力的一部分。SHARC的特殊角色是：\n“为舰队提供低成本、不对称的优势，以支持多种机密任务。这包括对潜艇或相关潜艇活动的持续、自主的态势感知和预警，以潜在地支持TASWO/陷阱(即反潜艇行动)，以及广泛、秘密地实施能力，以加强战场(IPB)和打击任务的情报准备。“。(我强调)。\n与水面舰艇相比，波浪滑翔机在声音上是无声的，视觉和雷达信号都很低，是隐身的。与潜艇不同的是，它们不断地将数据反馈给远程操作员。\n目前的计划要求一支由20名海军SHARC组成的舰队在2021年执行一项全面的示范任务，作为一个合作的蜂群一起工作，收集信息。确切地说哪些信息是机密的。预算项目计划提到“机密有效载荷通过信号和图像数据的同时宽带数据链路执行关键情报、监视和侦察(ISR)任务”。此外，SHARCS可能正在收集信号情报、窃听通信和检测雷达发射-因此需要所有这些天线-但他们可能做的更多。\n然而，美国并不是唯一拥有这项技术的国家。早在2016年，我就注意到俄罗斯海军正在测试一款几乎一模一样的名为Fugu的波浪滑翔机。尽管如此，尽管它最有可能是我们的设备，但在基韦斯特15英里外看到的设备可能只是他们的设备之一。这将不是第一次使用无人驾驶水艇进行间谍活动。\n6月30日更新：多亏了一些敏锐的读者，我们现在知道了这些神秘的天线是什么，以及它们告诉我们关于这架滑翔机在佛罗里达附近执行任务的信息。\n在我的推特上关注我。我可以在我的个人网站上查看，或者在这里查看我的一些其他工作。", "note_en": "A ‘ what is this?’ Facebook video from FishMonster, picked up by HI Sutton on his  Covert Shores site, shows a curious vehicle spotted off Florida’s Key West last week. Virtually the only part of it above water is a mast supporting an array of antennae.  The vehicle is almost certainly a  Wave Glider made by U.S. company  Liquid Robotics (now owned by Boeing    BA﻿ ) , and the antennas suggest it is part of a U.S. Navy program known as Sensor Hosting Autonomous Remote Craft, or SHARC.\n    The object at first looked like debris — but it is moving under its own power. The Wave Glider harnesses natural energy to power missions lasting weeks, months, or years without refueling. On the surface is a ‘float’ like a 10-foot-long surfboard covered in solar cells driving its electronics. This is connected via a tether to an underwater ‘sub’  unit 30 feet below. As waves move the surfboard up and down, the articulated sub converts up-and-down into forward motion (video demonstrating  the action here). Typical speed is just 1 - 3 knots, but the Wave Glider can keep going indefinitely; in 2013, one made an epic 8,000-mile,  year-long journey across the Pacific.\n       Although they have been used for scientific research, their long endurance and low profile make Wave Gliders ideal for military intelligence gathering, which is likely why  Boeing bought makers Liquid Robotics in 2016. The U.S. Navy has been working with Wave Gliders for many years, showing interest in their  potential for hunting submarines. A Wave Glider can loiter for extended periods, towing an underwater sonar array and communicating and contacts to direct aircraft or ships on to a target. A fleet of low-cost Wave Gliders could sweep slowly across an area of interest, covering a much wider area than a few expensive manned ships.\n  The Navy&#39;s sub-hunting Wave Glider is known as Sensor Hosting Autonomous Research Craft, or SHARC. In 2011 the Navy  started equipping their experimental SHARC gliders with the ‘Towed Array Integrated &#34;L&#34;  (TAIL),’ a passive towed acoustic array. This is a set of specialized sensitive hydrophones which take advantage of the glider’s quiet propulsion to pick up distant marine engines. (It also gives the acronym SHARC TAIL).\n    Since then the Navy’s Wave Glider plans have grown more ambitious.  Current R&amp;D budget documents show spending of $6 million a year in 2019 and 2020, doubling in 2021 and tailing off with project completion in 2022. SHARC is now part of a wider effort to use autonomous unmanned systems to gather information. SHARC’s particular role is to:\n  “provide the fleet with a low cost, asymmetric advantage in support of  multiple classified missions. This includes persistent, autonomous situational awareness and  early warning of submarines or related submarine activity in potential support of TASWO/TRAPS [i.e. Anti-Submarine operations] as well as broad area,  clandestine implementation of capabilities that enhance Intelligence Preparation of the Battlefield (IPB) and strike missions.” (My emphasis).\n  Wave Gliders, being  acoustically silent and with a low visual and radar signature are stealthy compared to surface vessels. Unlike submarines they continuously feed data back to remote operators.\n  Current plans call for a fleet of 20 Navy SHARCS to carry out a full-scale demonstration mission in 2021, working together as a co-operative swarm to gather information. Exactly what information is classified. The  budget project plan mentions “classified payloads conducting critical Intelligence, Surveillance and Reconnaissance (ISR) missions with simultaneous, wideband data links for signal and imagery data.“  The SHARCS may be gathering signals intelligence, eavesdropping on communications and detecting radar emissions – hence the need for all those antennae —but they may be doing much more.\n  However, the U.S. is not the only one with this technology. Back in 2016 I noted a  near-identical copy of the Wave Glider called Fugu being tested by the Russian Navy. So, while it is most likely one of ours, the device seen 15 miles off Key West might just be one of theirs. It would not be the first  time unmanned water craft were used for spying.\n  Update Tues 30th June: Thanks to some sharp-eyed readers, we now know  what those mysterious antennae are and what they tell us about the glider&#39;s mission off Florida.\n Follow me on  Twitter.  Check out my  website or some of my other work  here.", "posttime": "2020-06-30 23:49:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "间谍,unmanned,滑翔机", "title": "佛罗里达附近神秘的无人驾驶飞机可能是秘密共享间谍船", "title_en": "Mystery Unmanned Craft Seen Off Florida May Be Secret Sharc Spy Vessel", "transed": 1, "url": "https://www.forbes.com/sites/davidhambling/2020/06/29/mystery-unmanned-craft-seen-off-florida-may-be-sharc-spy-vessel/#247902cb4872", "via": "", "real_tags": ["间谍", "unmanned", "滑翔机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于Lua5.4.0发布了，这让我真的很高兴，我决定写一篇小帖子来介绍编译到Lua的语言。\nMoonscript已经存在了一段时间了(这也是我在最初的出版物中忘记将其添加到这篇文章中的原因之一)，而且它很稳定，并且在业界得到了使用，它可能是目前最流行的Lua语言编译程序。我相信Itch.io的很大一部分是由moonscript和nginx提供支持的。MoonScript感觉像是CoffeeScript，但对于Lua来说。如果您将其与同一作者的Lapis web框架配对，您就有了一个令人愉快的设置来启动您的下一个Web应用程序。\nMoonScript是一种编译成Lua的动态脚本语言。它为您提供了速度最快的脚本语言之一的强大功能，并结合了一组丰富的功能。\n类事物名称：&#34；未知&#34；类Person扩展事物Say_Name：=&gt；Print&#34；您好，我是#{@name}！&#34；with Person！.name=&#34；MoonScript&#34；\\Say_Name！\n我相信Fennel是目前最流行的Lua语言新编译器。有很多人首先是茴香开发人员，其次是Lua开发人员。它看起来相当整洁，在语法和宏系统上有Lisp的味道，但它不是Common Lisp，它的语义在大多数地方都符合Lua语义。\n可嵌入：Fennel是一个单文件库，也是一个可执行文件。将其嵌入到其他程序中，以支持运行时可扩展性和交互式开发。\n它非常整洁，就像Lua一样，它可以在小型ESP32上一直运行到运行OpenResty的数据中心中强大的服务器上。\n；；示例：读取键盘状态并相应地移动播放器(local dirs{：Up[0-1]：down[0 1]：Left[-1 0]：Right[1 0]})(每个[Key Delta(Pair Dirs)](When(love.keyboard.isDown key))(let[[dx dy]delta[px py]player x(+px(*dx player.Speed dt))y(+py(*dy player.Speed dt))。\n对于Lua来说，urn也是一种类似Lisp的语言。虽然茴香是Lisp服装中的Lua，但urn更多地属于Lisp家族，受到Common Lisp和Clojure的影响。\n谁不喜欢模式匹配呢？所有语言现在都应该有它了，…。\n&gt；(案例&#39；(&#34；x&#34；(Foo 23)。[(string？@？x)(..。&#34；获得字符串&#34；x)]。[(&#34；x&#34；(foo.。？x))(..。&#34；获得了一些剩余值&#34；(Pretty X)])out=&#34；获得了一些剩余值(2 3)&#34；\n通过快速查看，排名为N的非谓词类型：∀限定符可以出现在类型中的任何位置，不仅在顶层，\n设map f=函数|[]-&gt；[]|CONS(x，xs)-&gt；CONS(f x，map f xs)让Filter p xs=[x|with x&lt；-xs，p x]。\n请注意，尽管Amulet ML编译为Lua，但它基本上是用Haskell编写的，并带有SML和OCaml中的一些位。\n你可以在Twitter、Mastodon、Secure ScuttleButt或WebMentions上联系我。", "note_en": "Since  Lua 5.4.0 is out, and that made me really happy, I decided to dedicate a small post to languages that  compile to Lua.\n  Moonscript has been around for a while (one of the reasons I forgot to add it to this post in my initial publication) and is stable and used in the industry, it is probably the most popular  compile to Lua language out there. I believe that a large part of  Itch.io is powered by moonscript and NginX. Moonscript feels like CoffeeScript but for Lua. If you pair it with the  Lapis web framework by the same author, you have a delightful setup to launch your next web application.\n MoonScript is a dynamic scripting language that compiles into Lua. It gives you the power of one of the fastest scripting languages combined with a rich set of features.\n  class Thing name: &#34;unknown&#34;class Person extends Thing say_name: =&gt; print &#34;Hello, I am #{@name}!&#34;with Person! .name = &#34;MoonScript&#34; \\say_name!\n   I believe Fennel is the most popular  new  compile to Lua language current out there. There are a lot of people being Fennel developers first and Lua developers second. It looks quite neat, it has a Lisp flavour in its syntax and macro system but it is not a  Common Lisp, its semantics conform to Lua semantics in most places.\n Embeddable: Fennel is a one-file library as well as an executable. Embed it in other programs to support runtime extensibility and interactive development.\n It is quite neat and like Lua, it can run on a small ESP32 all the way to beefy server in a datacenter running OpenResty.\n   ;; Sample: read the state of the keyboard and move the player accordingly(local dirs {:up [0 -1] :down [0 1] :left [-1 0] :right [1 0]})(each [key delta (pairs dirs)] (when (love.keyboard.isDown key) (let [[dx dy] delta [px py] player x (+ px (* dx player.speed dt)) y (+ py (* dy player.speed dt))] (world:move player x y))))\n   Urn is also a Lisp-like language for Lua. While Fennel is Lua in Lisp clothes, Urn is more into the Lisp-family being influenced by Common Lisp and Clojure.\n   Who doesn’t like pattern matching? All languages should have it by now…\n &gt; (case &#39;(&#34;x&#34; (foo 2 3)). [(string? @ ?x) (.. &#34;Got a string &#34; x)]. [(&#34;x&#34; (foo . ?x)) (.. &#34;Got some remaining values &#34; (pretty x))])out = &#34;Got some remaining values (2 3)&#34;\n    Rank-N, impredicative types via Quick Look: ∀ quantifiers can appear anywhere in a type, not only the top-level,\n  let map f = function| [] -&gt; []| Cons (x, xs) -&gt; Cons (f x, map f xs)let filter p xs = [ x | with x &lt;- xs, p x ]\n  Be aware that even though Amulet ML compiles to Lua, it is written basically in Haskell with some bits in SML and OCaml.\n  You can reach out to me on  Twitter, or  Mastodon,  Secure Scuttlebutt, or through  WebMentions.", "posttime": "2020-06-30 23:49:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,lua,compile", "title": "编译为Lua的语言", "title_en": "Languages That Compile to Lua", "transed": 1, "url": "https://andregarzia.com/2020/06/languages-that-compile-to-lua.html", "via": "", "real_tags": ["编译", "lua", "compile"]}, {"category": "", "categoryclass": "", "imagename": "6035b1ff56f4fc9dbdeb7be398142d9f.jpeg", "infoid": 1009054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，我们看了一看有史以来制造的空气动力学效率最高的车辆。当时，在美国销售的阻力最低的生产车是保时捷泰康(Porsche Taycan)，它在空气中的阻力系数(CD)为0.22。但相当优秀的电动保时捷不会戴很长时间的王冠。Lucid Motors正在准备生产其第一款电池电动汽车Air，该公司刚刚公布了一些风洞测试结果。在北卡罗来纳州的风切变设施进行的测试已经确定，Air的CD只有0.21。\n如果你想用给定的能量旅行最远的距离，尽可能容易地在空气中移动是很重要的。因此，优化汽车的低阻力变得更加重要，首先是因为欧洲的监管机构要求更高效的汽车，然后是最近，因为续航里程已成为电池电动汽车最重要的属性。\n空气动力效率在实现世界一流的续航里程和性能方面起着关键作用，对电动汽车来说尤其有价值，因为它提供了独立于电池组大小的智能续航里程。因此，很自然，我们在整个Lucid Air的开发过程中都将重点放在空气动力学上。我们的航空团队与设计和工程同行无缝合作，从一开始就将空气效率确立为Lucid Air的核心宗旨，使我们能够达到这一新标准，Lucid Motors首席执行官兼首席技术官彼得·罗林森(Peter Rawlinson)说。\n减少阻力也是赛车设计师主要关心的问题，早在他们发现其他空气动力学特性称为下压力之前。超低阻力流线型客机在勒芒最为常见，在那里，一条3英里(4.8公里)的直道允许一些极高的最高速度。同样，Lucid Air的最高速度得益于它的低阻力；其中一款Alpha原型车在测试中已经超过了235英里/小时(378公里/小时)，罗林森最近告诉我，他确信这款车有更多的展示，尽管量产车将有一个人为限制的Vmax，以满足轮胎的安全评级。\nLucid表示，其测试版原型在测试中通常能达到400英里(643公里)的高速公路里程，而现实世界中400英里的里程是该公司对Air的目标，Air将于今年晚些时候投入生产。目前，唯一拥有如此长腿的Bev是特斯拉Model S，由于过去八年的渐进式改进过程，它最近突破了这一心理障碍。\n然而，当量产的Air在9月份向世界展示时，它不会是有史以来阻力最低的量产汽车。这一荣誉由两款只能在展厅短暂找到的流线型客机持有：通用汽车EV1和大众XL1。", "note_en": "A few weeks ago, we took a look at  the most aerodynamically efficient vehicles ever made. At the time, the lowest-drag production car for sale in the US was the Porsche Taycan, which cuts through the air with a drag coefficient (Cd) of 0.22. But the rather excellent electric Porsche won&#39;t wear that crown for very long.  Lucid Motors is readying production of its first battery electric vehicle, the Air, and it has just released the results of some wind tunnel testing. Tests at the Windshear facility in North Carolina have determined that the Air has a Cd of only 0.21.\n Moving through the air as easily as possible is important if you want to travel the farthest distance using a given amount of energy. As such, optimizing a car for low drag has become more important, first as regulators in Europe demanded more efficient cars, then more recently as range has become the most important attribute of a battery electric vehicle.\n &#34;Aerodynamic efficiency plays a key role in achieving world-beating range and performance and is particularly valuable to an EV in that it provides &#39;smart range&#39; independent of battery pack size. So naturally we intensively focused upon aerodynamics throughout the Lucid Air’s development. Our aero team worked seamlessly with design and engineering counterparts, establishing aero efficiency as a core tenet of Lucid Air from its very inception, enabling us to achieve this new standard,&#34; said Peter Rawlinson, CEO and CTO of Lucid Motors.\n  Cutting drag was also a main concern for race car designers, back  before they discovered that other aerodynamic property called downforce. Ultra-low drag streamliners were most common at Le Mans, where a three-mile (4.8km) straight allowed for some extremely high top speeds. Similarly, the Lucid Air&#39;s top speed benefits from its low drag; one of the alpha prototypes has already bettered 235mph (378km/h) in testing, and Rawlinson told me recently that he&#39;s sure the car has more to show, although production cars will have an artificially limited Vmax to meet the safety rating of their tires.\n Lucid says its beta prototypes are regularly achieving over 400 miles (643km) of highway range in testing, and a real-world range of 400 miles is the company&#39;s target for the Air, which goes into production later this year. Currently, the only BEV with such long legs is the Tesla Model S,  which recently broke through that psychological barrier thanks to a process of incremental improvement over the past eight years.\n However, when the production Air is revealed to the world in September, it won&#39;t be the lowest-drag production car ever. That honor is held by a pair of streamliners that could only briefly be found in showrooms: the General Motors EV1 and the Volkswagen XL1.", "posttime": "2020-06-30 23:24:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "阻力,air", "title": "这个空气动力学怎么样？晴空的阻力系数只有0.21", "title_en": "How’s this for aerodynamic? The Lucid Air’s drag coefficient is only 0.21", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/this-will-be-the-most-aerodynamically-efficient-electric-car-in-production/", "via": "", "real_tags": ["阻力", "air"]}, {"category": "", "categoryclass": "", "imagename": "33daaf6edb4b2694be586640b1630948.jpg", "infoid": 1009053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎收看“人机界面”试播集，这是我们即将开始的新系列节目，我们将带您近距离了解复杂系统，并请专家向您解释所有按钮和开关的作用。试播集在这里特别合适，因为我们将以世界上最著名的空中优势战斗机之一麦克唐纳·道格拉斯F-15C鹰作为本系列的开始。F-15C及其变种在世界各地的多个空军服役，包括美国、日本和以色列，这种飞机有出色的战斗记录-在其所有部署和操作人员中，像F-15C这样的空中优势F-15已经获得了100多次空对空杀伤和零损失。\n在冠状病毒让一切变得疯狂之前，我们在加利福尼亚州弗雷斯诺空军国民警卫队基地的飞行线路上用一架F-15C获得了一些时间。我们的导游是空军飞行员安德里亚·泰姆利上校，他在服役23年后于2018年退休。Themely上校有大约3400小时驾驶高性能喷气式战斗机，特别是在F-15C上大约有1100小时，她的最后一个职位是指挥空军第80飞行训练联队。\n几年前，我在NAS Oceana的海军F/A-18模拟器上亲身了解到，像F-15C这样的第四代喷气式战斗机通常配备了70年代和80年代的屏幕和按钮混杂在一起，角落里还塞着其他看起来更时髦的操纵器。(编者注：美国海军的F/A-18模拟器位于NAS Ocean ana的F/A-18模拟器中)，像F-15C这样的第四代喷气式战斗机通常配备了70年代和80年代的屏幕和按钮，角落里还塞着其他看起来更时髦的控件。这反映了这样一个事实，像F-15C及其同时代的战斗机大多是20世纪70年代的产品，随着时间的推移，更多的现代改进是固定的。\n我们的加利福尼亚和F-15C也不例外，Themely上校花了大量视频解释驾驶舱内的物理控制-开关和操纵杆，这些开关和操纵杆可以启动功能，而在更现代的第五代战斗机上，这些功能可能主要是通过触摸屏访问的。\n要解决的控制数量可能看起来令人望而却步，但飞机驾驶舱有一个秘密-在任何给定的时刻，你往往只关心几件事，所以一旦你熟悉了这些仪器，你就会专注于你需要的东西，而忽略其他的东西。这和人们开车或操作任何复杂的机器时做的事情完全一样。\n我们对人机界面作为一个系列的可能性感到非常兴奋，我们也希望看到更多更酷的机器像这样被解释。客机、潜艇、大型推土机、发电厂、巨型食车恐龙卡车--我们有一长串想看的东西，如果你有什么建议，请随时在评论中留言。\n我个人对于这个系列的愿望清单是让一些阿波罗时代的飞行控制员带我们参观NASA在休斯顿修复的任务操作控制室2，但自从耗资数百万美元修复以来，NASA一直保持沉默，不允许在MOCR2的地板上进行任何拍摄。我们一定会不断询问的！", "note_en": "Welcome to the pilot episode of &#34;Human Interface,&#34; a new series we&#39;re kicking off wherein we take you up close and personal with complex systems and have an expert explain what all the buttons and switches do. &#34;Pilot episode&#34; is particularly appropriate here, because we&#39;re kicking off the series with a look at a McDonnell Douglas F-15C Eagle, one of the world&#39;s most famous air superiority fighters. The F-15C and its variants are in service with multiple air forces around the world, including the United States, Japan, and Israel, and the aircraft has an outstanding combat record—across all its deployments and operators, air-superiority F-15s like the F-15C have racked up more than 100 air-to-air kills and zero losses.\n Before the coronavirus made everything crazy, we were able to score some time with an F-15C on the flight line at Fresno Air National Guard Base in California. Our tour guide was Air Force pilot  Colonel Andrea Themely, who  retired in 2018 after serving for 23 years. Col. Themely has about 3,400 hours piloting high-performance jet fighters and about 1,100 hours specifically in F-15Cs, and her last post was commanding the Air Force&#39;s  80th Flying Training Wing.\n  As I found out firsthand a few years ago in  the Navy&#39;s F/A-18 simulator at NAS Oceana, a  fourth-generation jet fighter like the F-15C is typically equipped with a mish-mash of &#39;70s- and &#39;80s-era screens and buttons, with other more current-looking &#39;00s-era controls shoehorned into the corners. This reflects the fact that fighters like the F-15C and its contemporaries are mostly products of the 1970s, with more modern improvements bolted on over time.\n Our California ANG F-15C is no exception, and Col. Themely spends a lot of the video explaining the physical controls in the cockpit—switches and levers that actuate functions that on a more modern  fifth-generation fighter might instead be primarily  accessed via touchscreen.\n The amount of controls to address might appear overwhelming, but there&#39;s a secret to aircraft cockpits—you tend to only care about a few things at any given moment, so once you&#39;re familiar with the instruments, you focus on what you need and ignore the rest. It&#39;s the exact same thing people do when driving a car or operating any complex piece of machinery.\n  We&#39;re really excited about the possibilities of &#34;Human Interface&#34; as a series, and we have  many more cool machines we&#39;d like to see explained like this. Airliners, submarines,  huge earth moving machines, power plants,  giant car-eating dinosaur monster trucks—we&#39;ve got a long list of stuff we&#39;re trying to get in to see, and if you have any suggestions, please feel free to leave them in the comments.\n My personal bucket list item for the series would be to have some Apollo-era flight controllers walk us through  NASA&#39;s restored Mission Operations Control Room 2 in Houston, but since its multi-million dollar restoration, NASA has been reticent to allow any filming on the floor of MOCR2. We&#39;ll definitely keep asking!", "posttime": "2020-06-30 23:24:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "战斗机,interface,操作", "title": "人机界面：F-15C战斗机驾驶舱里(几乎)每个按钮的作用", "title_en": "Human Interface: What (almost) every button in an F-15C fighter’s cockpit does", "transed": 1, "url": "https://arstechnica.com/features/2020/06/human-interface-come-on-a-tour-of-an-f-15c-fighter-jet-cockpit/", "via": "", "real_tags": ["战斗机", "interface", "操作"]}, {"category": "", "categoryclass": "", "imagename": "60545565511e341e94c1f89051e56009.jpg", "infoid": 1009052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二表示，作为对种族平等承诺的一部分，它将把2%的现金持有量-最初最高可达1亿美元-分配给直接支持种族平等的组织。\n“我们知道好的故事可以产生共鸣和理解。该公司在人才收购总监亚伦·米切尔(Aaron Mitchell)和财政部主任香农·阿尔文(Shannon Alwyn)的博客文章中表示，像Ava DuVernay的第13个月和解释的的种族财富差距这样的故事表明，美国系统性的种族主义如何维持了黑人和白人家庭之间长达数百年的经济差距。\n“我们相信，给这些社区带来更多资本，可以给这些社区的人们和企业带来有意义的改变，帮助更多的家庭购买第一套住房或为上大学存钱，更多的小企业开始创业或发展壮大。”\nNetflix表示，根据FDIC的数据，黑人拥有或领导的银行仅占美国商业银行资产的1%-这一因素导致19%的黑人家庭拥有负财富或根本没有资产-根据美国联邦储备委员会(Federal Reserve)的数据，这一比例是白人家庭的两倍多。\n“几十年来，黑人银行一直在努力改善他们的社区，但由于缺乏资金，他们处于不利地位。包括我们在内的大型跨国公司的大部分资金都存放在大银行，它们也更多地专注于改善股本，但不是在这些黑人领导的机构能够并正在做的基层。因此，我们希望将部分资金专门用于这些社区，并希望激励其他大公司对其现金存款采取同样的做法。“。\n该公司表示，这1亿美元承诺的第一步将是将3500万美元的现金放在两个工具中：2500万美元将转移到一个新成立的基金，名为黑人经济发展倡议(Black Economic Development Initiative)。它将由地方倡议支持公司(Local Initiative Support Corporation)管理，该公司是一家非营利性组织，在发展投资不足的社区方面有过往记录。他们将把资金投资于服务于美国中低收入社区和黑人社区发展公司的黑人金融机构；1000万美元将以社会转型存款的形式捐给希望信用合作社基金，以推动整个南方腹地服务不足的社区的经济机会。\n这个想法是为了获得新的资本，以帮助推动这些群体服务的中低收入社区的社会流动性和机会。\n“随着我们的发展，我们计划将更多的现金重新投向黑人领导和专注的机构，我们希望其他机构也能这样做。例如，如果标准普尔500指数成份股公司中的每一家公司都将适度的现金持有量配置到黑人经济发展倡议(Black Economic Development Initiative)等项目中，每1%的现金就代表着200-300亿美元的新资本。这将有助于建立更强大的社区，为更多的黑人家庭提供通向繁荣和更公平未来的途径。“", "note_en": "said Tuesday that going foward it will allocate 2% of its cash holdings — initially up to $100 million — to   and organizations that directly support   as part of a commitment to racial equity\n “We know great stories can create empathy and understanding. Stories like Ava DuVernay’s    13TH and  Explained’s   Racial Wealth Gap show how systemic racism in America has sustained a centuries-long financial gap between Black and White families,” the company said in blog post by Aaron Mitchell, Director, Talent Acquisition and Shannon Alwyn, Director, Treasury.\n  “We believe bringing more capital to these communities can make a meaningful difference for the people and businesses in them, helping more families buy their first home or save for college, and more small businesses get started or grow.”\n  According to the FDIC, Netflix said, banks that are Black-owned or led represent a mere one percent of America’s commercial banking assets — a factor contributing to 19% of Black families having either negative wealth or no assets at all – more than double the rate of White households – according to the U.S. Federal Reserve.\n “Black banks have been fighting to better their communities for decades but they’re disadvantaged by their lack of access to capital. The major banks, where big multinational companies including ours keep most of their money, are also focusing more on improving equity, but not at the grassroots level these Black-led institutions can and do. So we wanted to redirect some of our cash specifically toward these communities, and hope to inspire other large companies to do the same with their cash deposits.”\n The company said the first step in this $100 million commitment will be to put $35 million of cash in two vehicles: $25 million will be moved to a newly established fund called the Black Economic Development Initiative. It will be managed by the Local Initiatives Support Corporation, a non-profit with a track record of developing underinvested communities. They will invest the funds into Black financial institutions serving low and moderate-income communities and Black community development corporations in the U.S; $10 million will go to   Hope Credit Union in the form of a   Transformational Deposit to fuel economic opportunity in underserved communities across the Deep South.\n  The idea is for the fresh capital to help fuel social mobility and opportunity in the low- and moderate-income communities these groups serve.\n “We plan to redirect even more of our cash to Black-led and focused institutions as we grow, and we hope others will do the same. For example, if every company in the S&amp;P 500 allocated a modest amount of their cash holdings into efforts like the Black Economic Development Initiative, each one percent of their cash would represent $20-$30 billion of new capital. And that would help build stronger communities, offering more Black families pathways to prosperity and a more equitable future.”", "posttime": "2020-06-30 23:23:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "经济,black,社区", "title": "Netflix将2%的现金用于黑人社区的经济发展，1亿美元启动", "title_en": "Netflix Giving 2% Of Cash Going Forward To Economic Development Of Black Communities, $100M To Start", "transed": 1, "url": "https://deadline.com/2020/06/netflix-2-cash-100m-financial-institutions-supporting-black-communities-1202973648/", "via": "", "real_tags": ["经济", "black", "社区"]}, {"category": "", "categoryclass": "", "imagename": "4c085a261a3a014104c9e90d6647512f.jpg", "infoid": 1009051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CMU研究小组(包括语言技术学院的博士生Shrimai Prabhumoye，以及硕士学生Aman Madaan，Amrith Setlur和TanMay Parekh)开发的礼貌转移引擎基于类似的风格转移机制，你可能在摄影人工智能项目中更熟悉，在那里，软件可以将一张照片的风格应用到任何另一张照片上。该项目使用了安然员工交换的50万封电子邮件的数据集，这些电子邮件被公开，作为针对该公司的腐败和欺诈丑闻导致的法律诉讼的一部分。\n尽管该公司做了错事，但员工之间交换的许多电子邮件-如果你曾在大公司工作过-就不足为奇了-充满了共同的细节，礼貌地提出了要求和回复。事实证明，这是一个很好的基础形式，可以用来训练计算语言学算法，然后用来接受基本或不礼貌的请求，比如“给我看上个月的报告”，然后把它变成更具人性和礼仪的东西，比如“你能把上个月的报告发给我吗？”\n这项任务可能看起来相对简单--在任何阶段加上“请”和“谢谢”，你就差不多完成了，对吧？事实上，研究人员说，这实际上涉及到更多的微妙之处，因为事实上，当我们努力做到礼貌时，我们会做更多的事情，比如将实际上是命令的内容重新表述为请求，就像上面的例子一样。\nCMU团队开发的自动化方法仅适用于北美英语，如在正式(即，工作场所)，目前还需要做大量的工作才能将其本地化，因为对于礼貌的定义，地域和语言差异很大，所以需要做大量的工作才能将其本地化。但即使在目前的形式下，它在用于自动化客户服务聊天机器人或在电子邮件客户端中自动提示文本时也可以提供很多好处。\n显然，大量使用自动文本建议的公司对此很感兴趣，比如苹果公司，它与空军研究实验室、海军研究办公室、国家科学基金会和NVIDIA一起为这项研究提供了支持。", "note_en": "The politeness transfer engine that the CMU research team (including Language Technology Institutes Ph.D student Shrimai Prabhumoye, as well as Master’s students Aman Madaan, Amrith Setlur and Tanmay Parekh) developed is based on similar style transfer mechanisms you may be more familiar with from photography  AI   projects, where software can apply the style of one photograph to any other. This project used a dataset of half a million emails exchanged by Enron employees, which were made public as part of legal proceedings against the company resulting from its corruption and fraud scandals.\n Despite the company’s wrongdoing, many of the emails exchanged between employees were – unsurprisingly, if you’ve ever worked in a large corporation – laden with common niceties and politely formed requests and responses. These proved a good basis form which to train a computational linguistics algorithm that could then be used to take either basic or impolite requests, like ‘Show me last month’s reports,’ and turn that into something with a little more basic human kindness and decency, like ‘Could you please send me the reports from last month?’\n  It might seem like the task is relatively simple – append a ‘please’ and ‘thank you’ to any phase and you’re mostly there, right? In fact, the researchers say that it actually involved a lot more subtlety, since in fact when we are striving to be polite we do a lot more, like rephrase what’s actually an order to be a request, as in the example above.\n The automated method that the CMU team developed works only in North American English, as employed in a formal (ie. workplace) setting for now, and there will be lots of work required in order to localize it since regional and linguistic differences regarding what’s considered polite vary greatly. But even in its current form, it could provide a lot of benefit when used for automated customer service chatbots, for instance, or in autosuggesting text in an email client.\n There’s clearly an interest in this from companies who make significant use of automated text suggestions – like Apple, which provided support for this research alongside the Air Force Research Laboratory, the Office of Naval Research, the National Science Foundation and NVIDIA.", "posttime": "2020-06-30 23:23:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,研究,researchers", "title": "\nCMU的研究人员开发了一个自动礼貌引擎，用于基于文本的交流", "title_en": "\n\t\t\t\tCMU researchers develop a an automatic politeness engine for text-based communications\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/cmu-researchers-develop-a-an-automatic-politeness-engine-for-text-based-communications/", "via": "", "real_tags": ["开发", "研究"]}, {"category": "", "categoryclass": "", "imagename": "a1e03f13b93caa82816da7f2f4e8b479.gif", "infoid": 1009050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，赫尔南德斯与一些由运营商转变为投资者的公司联手，从创造性的角度解决了科技公司的多样性问题。\n总部设在伦敦和纽约的风险投资集团(Venture Collective)今天成立，目的是让获得资本变得更加平等。公平警告：它的实验结构很复杂，因为TVC既是部分投资工具，也是部分管理公司。但在一个科技难以取得进展的应得领域，这是一种创造性的战略。\n这个团队经验丰富：创始合伙人尼克·谢克德米安(Nick Shekerdemian)曾是YC初创公司的创始人，推出了一个多元化招聘平台，他的联合创始人吉娜·基尔奇(Gina Kirch)是他的投资者之一，也是贝莱德(BlackRock)的前董事。其他合伙人包括前Primary Venture Partners投资者凯特·赫尔南德斯(Cat Hernandez)和埃利奥特·里士满(Elliot Richmond)，他们在英国以外的地区投资，之前曾在莫里斯公司(Moelis&Amp；Company)工作。\n对于初创企业，企业每月将向一家公司投资10万美元，并可以灵活地做更多事情。TVC打算为后续几轮预留100万至500万美元。\n对于家族理财室，TVC收取年费，作为他们认为在硅谷有利可图的种子前交易的情报。如果家族理财室或其网络中的某人想要投资，TVC最终会部署一定数量的资本。它希望总资本承诺将随着时间的推移而增加。\n尽管TVC表示，这种结构模式是隐形的，但将这些家族理财室投资的结构与特殊目的载体的结构进行比较是合理的。特殊目的公司是存在于基金资本分配之外的投资工具，与传统的辛迪加相比，它们更具冲动。\n最大的区别是SPV的结构是以交易为中心的，而TVC的结构是以资本分配为中心，部署到多个交易中。他们基本上充当了有前途的初创公司和家族理财室之间的中间人。\n这对家族理财室来说是个好消息，因为他们经常扮演机构投资者的角色，这是长达十年的合作关系。长期押注的问题是，2010年热门的东西在2020年可能不会热门。TVC的模式让有限责任公司每年在自己感兴趣的领域配置资本。因此，新近看好远程工作的LP(出于某种疯狂的原因)可以参与早期交易，而不是等待他们几年前投资的AR/VR基金采取这一行动。\n由于所有这些机制，TVC的总“基金规模”将根据周的不同而变化。这是一个独特的例子，说明了首次投资的基金经理是如何在动荡的环境中进行投资的。\n今天，TVC推出了基于股权的融资，数额不详。该公司拒绝分享管理下的总资产。\n因此，TVC成功的一个重要因素是它是否能让创始人和家族理财室都相信，它的观点是值得建立的。TVC的灵活性可能是一件好事，但如果家族理财室退出，它也可能存在风险和不可靠。或者，例如，如果出现了长期的衰退。\n作为一种甜头，该公司表示，它将捐赠三分之二的合作伙伴时间来帮助投资组合中的公司。\n但是，这如何适应多样性呢？这一切都回到了TVC的目标，即让获得资本的机会更加平等。\n根据该团队的说法，大多数公司都失败了，但支持A系列的预种子基金也是资源最紧张的(基金规模较小，管理费固定)。因此，公司必须有选择地选择他们认为是离群点的公司，并更定期地花时间与这些公司打交道。这对代表不足的创始人的影响不成比例，他们可能会因为无法获得资源而起步较慢。\nTVC认为，它的战略将通过在这段时间内大力支持初创公司，帮助增加可风险投资的初创公司的数量，而不会竞争和抬高只有几个离群点的估值。\n该公司通过多样性、地理位置、年龄和社会背景来定义代表性不足的创始人。当被问及是否会公开披露多样性指标时，TVC表示，“它希望深思熟虑地考虑如何让我们的投资在长期内承担责任，我们正在权衡这一点与不作规定的愿望。”\n我们认为，作为早期投资者，我们的部分工作是确保随着业务规模的扩大，这一意图是最重要的。这可以有多种形式--跟踪/报告多样性指标就是其中之一。本质上，这不是装点门面，“该公司告诉TechCrunch。一般说来，TVC专注于帮助更多的人获得资金，并指出财务选择权是“我们正在争取的飞轮”。\n在采购方面，TVC正在与纽约和伦敦的专注于科技的团体合作，并将在大学和学院层面寻找人才。该公司还表示，将与“最著名的科技公司”代表不足的运营商建立关系，并与专注于多元化的创始人共同投资。\nTVC还推出了一个名为“The Collective”的团体，其中包括不同的创始人、运营商和投资者，他们将作为交易流动渠道提供帮助。", "note_en": "So, Hernandez has teamed up with a number of operators-turned-investors to tackle tech’s diversity problem from a creative angle.\n  The Venture Collective, based in London and New York, launches today to make access to capital more equal. Fair warning: its experimental structure is knotty, as TVC is part investment vehicle and part management company. But it’s a creative strategy in a deserving sector that tech struggles to make progress within.\n The team is stacked with a variety of experience: Founding partner Nick Shekerdemian is a former YC startup founder who launched a diversity recruitment platform, and his co-founder, Gina Kirch, was one of his investors, as well as a former director at BlackRock. Other partners include former  Primary Venture Partners   investor Cat Hernandez and Elliot Richmond, who invests out of the United Kingdom and previously worked at Moelis &amp; Company.\n   For startups, the business will invest a $100,000 check into one company per month, with the flexibility to do more. TVC intends to reserve between $1 to $5 million for follow-on rounds.\n For family offices, TVC charges an annual fee to serve as intel for what they think are lucrative pre-seed deals in the Valley. If a family office or someone within its network wants to invest, TVC  will ultimately deploy an allocated amount of capital. It hopes that total capital commitments will increase over time.\n While TVC says the structure model is in stealth, it is reasonable to compare the structures of these family office investments to the structures of  special purpose vehicles. SPVs are investment vehicles that exist outside a fund’s capital allotment and are more spur of the moment, versus traditionally syndicated.\n The biggest difference is that SPV structure is centered around deals, but TVC’s structure is centered around a capital allotment, deployed into multiple deals. They essentially act as middlemen between promising startups and family offices.\n It’s good news for family offices, as they often take the role of institutional investors, which are decade-long relationships. The problem with lengthy bets is that what was hot in 2010 might not be hot in 2020. TVC’s model lets LPs deploy capital in their interest areas on a year by year basis. So an LP who is newly bullish on remote work (for some wild reason) could get their hands in early deals instead of waiting for the AR/VR fund they invested in years ago to make that move.\n   Because of all of these mechanisms, TVC’s total “fund size” will change depending on the week. It’s a unique example of how first-time fund managers are  tackling investing in a volatile landscape.\n Today TVC launches with an undisclosed amount of equity-based financing. The company declined to share total assets under management.\n So a big factor in TVC’s success is if it can convince both founders and family offices that its perspective is worth the set up. TVC’s flexibility can be a blessing, but it also can be risky and unreliable in case family offices pull out. Or if there is an extended recession, for example.\n As a sweetener, the company says that it will donate two-thirds of partner time to helping portfolio companies.\n But how does this fit into diversity? It all goes back to TVC’s goal to make access to capital more equal.\n According to the team, pre-seed to Series A is where most companies fail, but the very funds that back pre-seed are also the most strapped for resources (small fund sizes, fixed management fees). Thus, firms have to selectively pick the companies they think are outliers and spend time with those companies on a more regular basis. This disproportionately impacts underrepresented founders, who might have a slower start due to lack of access to resources.\n TVC thinks its strategy will help grow the number of startups that are venture-backable by heavily supporting them through this time, without competing and driving up valuations for only a few outliers.\n The company defined underrepresented founders through diversity, geography, age and social background. When asked if they will publicly disclose diversity metrics, TVC said “it wants to be thoughtful about how we hold our investments accountable in the long-term and we are balancing that with a desire to not be prescriptive.”\n “We believe that part of our job as early investors is to ensure that this intent is top of mind as the business scales. That can come in many forms — tracking/reporting on diversity metrics being one of them. At its core, this isn’t about window dressing,” the firm told TechCrunch. Generally, TVC is focused on helping more people get funding, and pointed toward financial optionality as the “flywheel we’re playing for.”\n In terms of sourcing, TVC is partnering with tech-focused groups in New York and London and will identify talent at the university and college level. It also said it will build relationships with underrepresented operators “at the most prominent tech companies” and co-invest with diversity-focused founders.\n TVC also launched a group called “The Collective” that includes diverse founders, operators and investors, who will help as a deal flow channel.", "posttime": "2020-06-30 23:22:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "collective", "title": "\nVenture Collective启动对种子前期投资的新押注", "title_en": "\n\t\t\t\tThe Venture Collective launches with a new bet on pre-seed investing\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/the-venture-collective-launches-with-a-new-bet-on-pre-seed-investing/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "4ad2bcfdea2f3a597e1eb39dd9f83a0f.jpg", "infoid": 1009049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是来自美国网络司令部的警告，美国网络司令部是国防部的一个部门。国防部和美国国家安全局的前姊妹机构，美国国家安全局表示，企业应该尽快修补他们易受攻击的设备。\n请立即修补所有受CVE-2020-2021影响的设备，特别是在使用SAML的情况下。外国APT可能很快就会尝试利用。我们感谢@PaloAltoNtwks对此漏洞的主动响应。\n这个缺陷存在于为几个帕洛阿尔托网络(Palo Alto Networks)防火墙和企业VPN设备提供动力的软件中，这些设备允许员工从家里访问他们的公司网络-访问在疫情期间至关重要-同时将未经授权的用户拒之门外。\n通常情况下，员工必须输入他们的公司用户名和密码，通常还必须输入双因素代码。但在某些情况下，该漏洞可能会让攻击者在不需要密码的情况下控制其中一台设备，授予它们访问网络其余部分的权限。\nPalo Alto表示，修复程序是在软件更新中推出的，但企业也可以关闭SAML-一种让用户登录网络的方式-以减轻该漏洞。\n但企业安装这些修复程序的时间紧迫。VPN设备和防火墙是黑客的巨大目标，因为它们可以提供对企业网络的畅通无阻的访问。\n去年，研究人员发现包括帕洛阿尔托在内的三家公司的VPN设备存在缺陷。尽管修复程序很快就推出了，但修补速度较慢的企业发现他们的网络受到了攻击，促使国土安全部的网络顾问部门发布了警报。在某些情况下，黑客利用该漏洞在整个网络中传播勒索软件。\n帕洛阿尔托表示，目前还没有证据表明黑客利用了这一漏洞。但考虑到网络面临的直接风险，公司应该尽快打补丁。", "note_en": "That’s  the warning from US Cyber Command, a division of the Dept. of Defense and former sister-agency to the NSA, which said enterprises should patch their vulnerable devices as soon as possible.\n Please patch all devices affected by CVE-2020-2021 immediately, especially if SAML is in use. Foreign APTs will likely attempt exploit soon. We appreciate  @PaloAltoNtwks’ proactive response to this vulnerability.\n The flaw lies in the software that powers several Palo Alto Networks firewalls and enterprise VPN appliances, which let employees access their corporate network from home — access that is crucial during the pandemic — while keeping unauthorized users out.\n Typically employees must enter their corporate username and password, and often a two-factor code. But the flaw could, under certain conditions, let an attacker take control of one of these devices without needing a password, granting them access to the rest of the network.\n Palo Alto said  that a fix was pushed out in a software update, but enterprises can also switch off SAML — a way of letting a user log in to the network — to mitigate the flaw.\n But the clock is ticking on enterprises getting those fixes installed. VPN appliances and firewalls are a huge target for hackers as they can provide unfettered access to a corporate network.\n Last year, researchers  found flaws in three corporate VPN appliances — including Palo Alto. Although fixes were quickly rolled out, enterprises that were slow to patch found their networks under attack, prompting Homeland Security’s cyber advisory unit to issue an alert.  In some cases, hackers used the vulnerability to  spread ransomware  across the network.\n For the time being, Palo Alto says there’s no evidence yet of hackers exploiting this vulnerability. But given the immediate risk to networks, companies should patch as soon as possible.", "posttime": "2020-06-30 23:22:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,美国,机构,agency,网络", "title": "\n美国政府机构警告帕洛阿尔托VPN存在新的安全漏洞", "title_en": "\n\t\t\t\tUS government agency warns of fresh Palo Alto VPN security flaw\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/cyber-command-palo-alto-vpn-flaw/", "via": "", "real_tags": ["漏洞", "美国", "机构", "agency", "网络"]}, {"category": "", "categoryclass": "", "imagename": "dcaa4ba15b1d80a60fb0eb46faac72a6.jpg", "infoid": 1009048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于12纳米制程技术，这些新平台承诺为Android Wear生态系统注入新的活力。\n用户首先会注意到的一件事是，与上一代Wear 3100芯片相比，4100+平台将支持更丰富的环境模式，现在可以在这种节能模式下显示更多颜色，同时支持睡眠跟踪、实时并发症和自适应亮度。\n传统上，在Android Wear生态系统中，与实时模式相比，环境模式被大幅缩减，但这个新平台将改变这一点。根据高通的数据，大多数智能手表95%的时间是在环境模式下度过的，因此这是一个需要改进的明显特征。在运动模式方面，这款手表回到了类似的模式，现在的功能类似，可以让你在跑步时保持最新状态，例如，当你使用各种传感器、地图和GPS时。\n至于实际技术，4100+平台由主系统Cortex A53驱动的芯片系统组成，承诺与上一代相比性能提高85%，同时电池续航时间延长25%。GPU本身的速度是上一代的2.5倍，这应该会带来更流畅的用户体验。步数、心率监测等都是由一个永远在线的微型协处理器(它的尺寸为5mmx4 mm)来处理的，而4G调制解调器则提供高速连接。\n另一个主要优势，特别是面向运动的智能手表，是改进的GPS支持，功耗要求显著降低。\n对于联网的智能手表，高通承诺将把电池续航时间提高25%(而这些联网手表的电池续航时间传统上相当糟糕)。\n如果你真的想延长电池续航时间，最近的许多Android Wear手表都可以让你切换到低电池模式，这意味着到目前为止，你只能看到时间。这一“增强型手表模式”在新的4100+平台上进行了重大更新，增加了步进和心率支持、电池指示灯、闹钟和提醒(是的，你仍然可以看到时间和日期)。毕竟，它是一块手表)。\n值得一提的是，高通将推出4100平台的两个变种，即4100+和4100+，前者以芯片上的主系统、永远在线的协处理器和各种连接芯片为特色，后者将不会以永远在线的协处理器为特色。\n首批使用新4100芯片的手表将来自TicWatch系列的制造商Mobvoi和IMOO，后者将推出一款基于该平台的以儿童为中心的智能手表。", "note_en": "Based on a 12nm process technology, these new platforms promise to breathe new life into the Android Wear ecosystem.\n One of the first things users will notice is that, compared to the previous generation of Wear 3100 chips, the 4100+ platform will offer support for a far richer ambient mode, which can now show more colors in this energy-efficient mode all while supporting sleep tracking, live complications and adaptive brightness.\n  Traditionally, in the Android Wear ecosystem, the ambient mode was quite pared down compared to the live mode, but this new platform is going to change that. According to Qualcomm’s data, most smartwatches spent 95% of their time in ambient mode, so that was an obvious feature to improve upon. For its sports mode, the watch falls back to a similar mode, which now features similar capabilities to keep you up to date while you are on a run, for example, and are using various sensors, maps and the GPS.\n  As for the actual technology, the 4100+ platform consisted of a main system Cortex A53-powered system on a chip that promises 85% higher performance compared to the previous generation, all while offering 25% longer battery life. The GPU itself is 2.5 times faster than only a generation ago, which should make for a far smoother user experience. Step counting, heart rate monitoring and more is handled by a tiny always-on co-processor, (it measures 5mmx4mm), while a 4G modem provides high-speed connectivity.\n  One other major advantage, especially for sport-oriented smartwatches, is improved GPS support with significantly lower power requirements.\n For connected smartwatches, Qualcomm promises a 25% improvement in battery life (and these connected watches have traditionally had pretty dismal battery life).\n If you really want to conserve battery life, a lot of recent Android Wear watches let you switch to a low-battery mode, which until now meant you only got to see the time. This ‘enhanced watch mode’ is getting a major update on the new 4100+ platform with the addition of step and heart rate support, a battery indicator, alarms and reminders (and yes, you can still see the time and date, too. It’s a watch, after all).\n  It’s worth stressing that Qualcomm will launch two variants of the 4100 platform, the 4100+, which features the main system on a chip, the always-on co-processor and the various connectivity chips, as well as the 4100, which will not feature the always-on co-processor.\n The first watches to use the new 4100 chips will come from Mobvoi, the makers of the TicWatch line, and imoo, which will launch a kid-centric smartwatch based on the platform.", "posttime": "2020-06-30 23:22:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,芯片,launches,手表", "title": "\n高通发布新款智能手表芯片", "title_en": "\n\t\t\t\tQualcomm launches its new smartwatch chips\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/30/qualcomm-launches-its-new-smartwatch-chips/", "via": "", "real_tags": ["发布", "芯片", "launches", "手表"]}, {"category": "", "categoryclass": "", "imagename": "ad3f9b8ee630a3c06b5be9c7cee4fa5f.jpg", "infoid": 1009046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约十年前，我有机会在厄瓜多尔的基多住了不到一年。我认为，每一个想要建设更具生产力的地方的北美人，都可以作为一名居民，而不仅仅是一名游客，从体验全球南方的城市中受益。虽然这些地方在城市形态、建筑和文化上有巨大的差异，但也有一些重要的共同点。一个很大的问题是，日常生活和商业的基础设施比我们在美国习惯的正式秩序和标准化要少得多。事情只是变得更混乱了。\n在居住在厄瓜多尔之前，我被误导相信，那里的事情不会像在这里那样好。另一方面，我离开了厄瓜多尔，感觉有一些教训美国应该好好考虑一下。秩序和效率并不总是如人们所说的那样。让我通过一个故事来解释一下，我在基多布置公寓家具的那一天，与美国的相同过程相比。\n我和我的室友在一套令人惊叹的殖民地式复式公寓里租了楼上的公寓，公寓铺着硬木地板，有充足的自然光，当然，如果不是因为价格标签，这在加州是不会显得格格不入的。年迈的女房东独自带着她的三条狗住在楼下。这个地方完全没有家具，所以我们在一个星期六出发，去买下一年我们需要的东西，把它称为家。\n这意味着，首先，要跳上一辆公交车。基多有BRT(快速公交)系统(现在正在建设一条地铁)，但它的三条BRT线路极其拥挤，沿着城市的南北轴线运行，使得东西走向变得更加困难。\n幸运的是，有大量的非正式公共交通：由私营运营商运营的大型蓝色公交车将穿梭在每条主干道上，在前挡风玻璃上挂着一大堆标志-多达12个-列出了主要目的地：社区、大学和其他地标。没有路线图，没有提前时间表-但只要对这座城市有一点基本的地理知识，我发现你可以可靠地从任何地方跳到任何地方，只需25到50美分，而且在车站的等待时间不超过5分钟。\n在乘坐公共交通出行的便利性方面，几乎没有一个美国城市能与基多竞争-我被告知基多将是一个贫穷和功能失调的地方。这些非正式公交线路的网络并没有从上面得到协调：我花了一个小时在谷歌上搜索，才明白在一个地方没有总时刻表和系统图。这个系统虽然混乱，但却很聪明：如果有出行需求(在A点和B点之间的公交车上人满为患)，就会有人找出问题所在，并加以利用。这个系统缺乏易读性的地方-我确实喜欢在离家前在网上钻研交通线路图和计划我的旅行-它获得了快速、迭代的适应性。\n我们去了一个由几个街区组成的小镇，那里有很多家具店。每一家单独的商店都很小，有有限的、独特的选择。但由于他们中的六个人离得很近，很容易漫步和比较商店。不到一个小时左右，我们就有了一套我们喜欢的餐厅用具，几盏灯和一张沙发。我们从一个巨大的露天市场从个别小贩那里买来的二手炉子和冰箱，在那里你几乎可以买到任何东西。在这两种情况下，我们都坚持让他们为我们插上电源，然后我们在一小时后回来验证它是否正常工作。讨价还价，交了定金，就该找交通工具了。\n运输车由两个人组成，开着一辆没有标志的卡车。梅尔卡多酒店外的一整条街似乎都在非正式地为这些卡车服务：只要找个人停着等着，让他们知道他们要拖的是什么，如果你想让他们帮你把卡车搬上楼梯进入公寓(我们做到了)，还可以多付一点钱。几个小时后，我们少了几百美元，在用绳子锁着的冰箱旁边的皮卡车床上经历了一次令人焦虑的旅行后，我们回到了家，家具几乎齐全。\n我们很喜欢家具，尽管烤箱很快就坏了，需要通过口口相传的方式找到一名维修员，他可以找到合适的更换部件。同时，我还学会了在炉子上做很多意想不到的东西！这是个不错的煤气炉，由一大罐独立的丙烷(你可以用一辆卡车运送，每周有几个早上在附近巡逻)。\n整个经历与我在美国布置家具的经历形成了鲜明对比。在这里，这个过程总是涉及开车去大卖场(其中很少有交通工具很方便，特别是如果你需要多次停留的话)，信用检查，一些承诺几个月付款计划的文书工作，一到两周的预定送货时间，以及经常与快递公司发生一些麻烦，要求打一个电话，我坐在那里等待。\n因为那个麻烦，我得到了更大程度的保护，以防事情出错。去年，当一台洗碗机来到我家时，旁边已经有一个很大的凹痕，我一点钱都没有花；他们把它拿走，道歉，退还了送货费，并允许我在一周后重新安排更换设备。几年前，我们买了一张沙发，在送货时发现，它不可能通过我们后院Adu的一个棘手的门口(异常狭窄，只有29英寸，但也是一个90°的小转弯)。没问题：把沙发放回去，又去挑了一张。\n你会认为选择范围更广会是美国体制的一项福利，但对我们来说并非如此：大包厢里的选择是重复的，而且受到当前市场趋势的严重影响。所有房间里都没有一张沙发小到可以转弯，穿过门进入我们的起居室。当我对售货员说这番话时，她嘲弄地告诉我应该考虑大一点的房子。(真实故事！)。我们离开，在这条路上的另一家大卖场买了一张沙发。两周后如期交付。\n我很清楚，美国中产阶级做事的方式--家得宝/宜家/Roomers to Go模式--有其优势，特别是在降低买家上当受骗、没有追索权的风险方面。但值得深思的是，这些商店承诺的质量和可靠性的隐性成本。\n最大的此类成本是生产商、零售商和消费者的进入门槛都要高得多。在美国，你找不到很多卖家具和电器的小店主；在基多这样的城市里，这种做法很管用，因为这是一个露天市场的物理模型，那里有许多小的零售空间，彼此步行很近。(当然，现在有小商家的在线选择，比如Craigslist、Facebook Marketplace等，但这种模式也有很大的缺点，因为你真的希望在购买之前能够触摸和测试一些东西。)。大卖场对市场的垄断也将规模较小的手工生产商拒之门外。对于购物者来说，成为一个快乐的消费者，而没有几个小时的额外麻烦，恼人的运输物流，以及不确定性，其代价往往是债务，形式是汽车付款和信用卡。\n在基多布置房子的经历真的、真的让人释放了一些东西，因为两个外国人的西班牙语水平不太好，没有当地的银行账户，也没有当地接受的信用卡，而且对这个城市相当不熟悉。我们在一个下午能完成的工作量是惊人的。选择的范围实际上相当不错。四处走动是轻而易举的事。\n美国的体系-拥有垂直整合的供应链、仓库和航运网络、专有信贷额度的大卖场-对一群特定的人来说是有效的：资本所有者。也就是说，高管和股东。这种零售模式通过从供应链的每个部分榨取每一点冗余，在从顶部榨取利润方面几乎是最有效的。\n从CEO(或城市管理者)的角度来看，美国的发展模式也符合这种特定的效率模式。分开的土地用途；有巨大停车场的大型购物广场；为18轮车建造的步行街；以及指定的走廊上只允许交通：所有这些都有利于大盒子模式的商业。\n对于其他所有人来说，我认为有一个强有力的论点，那就是我们在自上而下的秩序和效率方向上走得太远了，回到一个混乱的城市和充斥着小企业主的混乱市场--我听说过拥有更多资本家的资本主义--将产生令人惊讶的好处。我只是要去南美看看他们中的几个。", "note_en": "About a decade ago, I had the opportunity to live in Quito, Ecuador for a little under a year. I think every North American who wants to build more productive places can benefit from experiencing a city of the Global South as a resident, not just a tourist. While there&#39;s an enormous amount of variation among these places in urban form, architecture, and culture, there are some important commonalities too. One big one is that the infrastructure of day-to-day life and commerce exhibits a lot less of the formal order and standardization we&#39;re used to encountering in the United States. Things are just  messier.\n I was led to believe, before living in Ecuador, that Things Just Don&#39;t Work as Well There As They Do Here. I left Ecuador, on the other hand, feeling like there are some lessons the United States would do well to consider. Order and efficiency aren&#39;t always all they&#39;re cracked up to be. Let me explain via a story about the day I furnished my apartment in Quito, in comparison to the same process in the States.\n  My housemate and I had rented the upstairs apartment in a stunning old colonial duplex with hardwood floors and ample natural light that would not have been out of place in California, except of course for the price tag. The elderly landlady lived alone downstairs with her three dogs. The place came totally unfurnished, so we set out on a Saturday to get what we needed to call it home for the coming year.\n This meant, first, hopping on a bus. Quito has a BRT (bus rapid transit) system (and now  a subway under construction), but its three BRT lines are extremely crowded and run along the city&#39;s north-south axis, leaving east-west trips more difficult.\n  Fortunately there was an enormous amount of informal public transit to be had: big blue buses run by private operators would ply every major avenue, with a bevy of signs—up to a dozen—in the front windshield listing major destinations: neighborhoods, universities, other landmarks. No route map, no advance schedule—but with a little basic geographic knowledge of the city, I found you could reliably hop a bus from anywhere to anywhere for 25 or 50 cents with no more than a 5-minute wait time at the stop.\n Scarcely any U.S. city can compete with Quito—a place I was told would be poor and dysfunctional—in the ease of getting around on public transit. The network of these informal bus lines has not been coordinated from above: it took me an hour of Googling to understand that there  was no master schedule and system map in one place. The system is  chaotic but smart: if there is demand for a trip (in the form of overcrowding on buses between points A and B), someone is going to figure it out and capitalize on it. What this system lacks in legibility—I do enjoy poring over transit route maps online and planning out my trip before I leave home—it gains in rapid, iterative adaptability.\n We went to a part of town comprised of a few blocks heavily populated with furniture stores. Each individual store was quite small and had a limited, idiosyncratic selection. But with a half dozen of them in close proximity, it was easy to wander and comparison shop. Within an hour or so, we had a dining room set we loved, a couple lamps and a couch. A used stove and refrigerator we procured from individual vendors at a vast open-air market where you could buy practically anything. In both cases we insisted they plug the unit in for us and then we came back in an hour to verify that it worked. Haggle over the price, put down a deposit, and it was time to look for transport.\n  Transport consisted of two guys with an unmarked truck. A whole street outside the  mercado seemed unofficially devoted to these trucks: just find someone parked and waiting, let them know what they&#39;d be hauling, and pay a little extra if you wanted them to help you get it up the stairs and into the apartment (we did). In a few hours, several hundred dollars poorer, and having experienced an anxiety-inducing ride in the bed of a pickup truck next to a refrigerator secured with ropes, we were home and near-fully furnished.\n We loved the furniture, though the oven soon broke and required tracking down a maintenance man through word of mouth who could get the right replacement parts. Meanwhile, I learned to cook a lot of unlikely things on the stovetop! It was a nice gas stove fueled by a large free-standing tank of propane (which you could get delivered by a truck that made the neighborhood rounds a couple mornings each week).\n  The whole experience stands in contrast to my experiences furnishing homes in the United States. Here, the process always involves a drive to a big-box store (few of these are convenient via transit, especially if you need to make multiple stops), a credit check, some paperwork to commit to a multi-month payment plan, a scheduled delivery a week or two out, and often some hassle with the delivery company requiring a phone call in which I sit on hold.\n For that trouble I get a much greater degree of protection against things going wrong. When a dishwasher arrived at my house last year with a large dent already in the side, I was not out any money; they took it away, apologized, refunded me the delivery charge, and allowed me to reschedule for a replacement unit a week later. A few years ago, we bought a couch that, it turned out upon delivery, was impossible to maneuver through a tricky doorway in our backyard ADU (unusually narrow at 29 inches, but also a tight 90° turn). No problem: returned the couch and went to pick out another one.\n You&#39;d think a greater range of choices would be a perk of the U.S. system, but it wasn&#39;t for us: the selection at the big boxes was repetitive and heavily influenced by current market trends. There was not a single couch in all of Rooms To Go small enough to make the turn and get through the door into our living room. When I made this observation to the salesperson, she mockingly told me I should consider a bigger house. (True story!) We left and bought a couch from a different big-box store down the road. It was delivered on schedule two weeks later.\n  It&#39;s clear to me that the way the middle classes do things in the U.S.—the Home Depot / IKEA / Rooms to Go model—has its advantages, especially in reduced risk for the buyer of being scammed and left without recourse. But worth contemplating are the hidden costs of the quality and reliability that these stores promise.\n The biggest such cost is the much higher bar of entry for producer, retailer, and consumer alike. You don&#39;t find many small proprietors selling furniture and appliances in the U.S.; it works in cities like Quito because of the physical model of an open-air marketplace with many small retail spaces in close walking proximity to one another. (There are of course now online options for small vendors—Craigslist, Facebook Marketplace, etc.—but that model has its own substantial downsides for something you really want to be able to touch and test out before purchase.) The big-box stranglehold on the market shuts out smaller and artisanal producers, as well. And for the shopper, the price of being a happy consumer without hours of extra hassle, annoying transportation logistics, and uncertainty is often debt, in the form of the car payment and the credit card.\n There was something really, really liberating about the experience of furnishing a home in Quito, as two foreigners with questionable-to-good Spanish, no local bank accounts or locally-accepted credit cards, and fairly unfamiliar with the city. The amount that we were able to get done in a single afternoon was astonishing. The range of options was actually quite good. Getting around was a breeze.\n The U.S. system—the big box store with the vertically integrated supply chain, the warehouse and shipping network, the proprietary credit line—is efficient for one particular group of people: owners of capital. That is to say, executives and shareholders. This model of retail about as effective as could be at extracting profit off the top, by squeezing every bit of redundancy out of each part of the supply chain.\n And the U.S. development pattern, too, plays into that particular model of &#34;efficiency&#34; from the CEO&#39;s (or city manager&#39;s) vantage point. Separated land uses; giant shopping plazas with giant parking lots; stroads built for 18-wheelers; and transit-only on designated corridors: all of these things  favor the big box model of commerce.\n For everyone else, I think there&#39;s a strong argument that we&#39;ve swung too far in the direction of top-down order and efficiency, and that a swing back toward a messy city and a messy marketplace full of small proprietors—what I&#39;ve heard called &#34;capitalism with more capitalists&#34;—would yield surprising benefits. I just had to go to South America to see a few of them.", "posttime": "2020-06-30 23:13:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "效率,inefficient,美国", "title": "效率低下，但很智能", "title_en": "Inefficient, but Smart", "transed": 1, "url": "https://www.strongtowns.org/journal/2020/6/5/inefficient-but-smart", "via": "", "real_tags": ["效率", "美国"]}, {"category": "", "categoryclass": "", "imagename": "026165c068e143fd1220e46342373feb.jpg", "infoid": 1009045, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我写的第一篇博文是丢失的，我保存的最古老的一篇是2005年9月8日。已经快15年了，我很高兴看到我在写作和理解世界方面有了很大的进步。\n保持这样的网站不仅仅是写照片和选择照片。这需要精心策划和修改东西的组织方式，以确保不会丢失任何东西。\n有一件事我不想失去，那就是所有那些来访的令人惊叹的人的评论，他们都花了一些时间来表示赞赏或不同意。最后一个总是学习的好机会，并确保你的信仰仍然是合理和合乎逻辑的。\n所以我一头扎进评论数据库，发现有些评论丢失或放错了地方，因为网站的帖子改变了链接。\n一些链接被破坏了，不得不拼凑起来；另一些链接是错误的，他们的评论消失了。\n我相信我保存了所有的评论，在这个过程中，我走上了一条关于脆弱的回忆和事后诸葛亮的大道，我们建立的网络就是这样的。\n还记得Flickr吗？它仍然活着并在运行，但并不是我在2007年认识的每个人都在使用它。你在我以前的帖子中看到的很多照片都来自那里，但是属性链接被破坏了，因为用户决定删除他们的账户。有些人还在工作，但摄影师要么离开了，要么去世了。\n由于历史原因，这些链接仍然存在，因为重要的是要表明这些照片有所有者，有才华的人友好地分享他们的作品，而不要求回报。\n而且问题并不仅限于“找不到页面”信息中的版权归属问题。就连文件似乎也在恶化。\n随着技术的进步，我们有了更好的相机和更好的监视器。原本纯净的照片现在看起来褪色或像素化了。储存也是一个问题。保留一个网站意味着存储所有的文件，对于一个25岁的年轻人来说，预算很小，这意味着节省每一分钱。所以我确保在图像质量和文件大小上保持良好的平衡。它在抵抗时间的考验方面做得并不令人惊叹。\n网站有生命周期，我发现的一些链接不再起作用。谷歌和我一样讨厌断开的链接，但我也讨厌对读者不公平。指向不再存在的其他资源的链接仍然存在于我写的文章中。再说一次，为了证明存在的理由。\n我知道这个问题已经有一段时间了，因此我养成了保存我用来参考的每个文件的习惯。PDF、视频、图像、音乐等。它们可能不会在文章中使用，因为有指向原始版本或作者的链接，但如果有一天该链接停止工作，其价值不会随之丢失。(这就是为什么这个站点的容量超过9 GB)。\n回到过去，和许多网站一样，这个网站是由WordPress提供支持的。它有自己的评论系统。然后碟子1出现了，我试了一会儿。在我停止使用WordPress之后，我继续运行同样的评论服务。这就是所有的链接都改变以提高搜索引擎排名的时候，很多评论在数据库中丢失了。\n这份名单可能还会继续，关键是他们已经消失了，一些好的内容也随之而来。\n社交网络不一定要消失才能让你无法访问那里的内容。一篇内容的所有者可能会出于各种原因锁定他们的个人资料，您或您的读者将无法再看到它。\n对版权侵权的法律行动也可能剥夺对公开信息的访问权。想想看，当YouTube视频被发现违反指导方针时会发生什么。\n我们正在犯一些同样的错误。想想有多少社交网络使用URL缩短器。如果bit.ly决定关闭，并且所有这些链接都停止工作，会发生什么情况？\n我们正在建设的网站使用WordPress、Drupal等内容管理软件。他们会经受住时间的考验吗？还是我们会在某个时候不得不将他们迁移到一个新的系统？刁钻的问题不会。在那之前，我们可以忠于我们的使命，继续出版。\n如果你希望有一个美好的结局，请不要放弃。\n通过这些磨难和我们一直在进行的所有实验，我们可以在我们之间进行交流，我们看到了很多好的结果。可能很久没有人注意到的创造者们发现了聚光灯。\n社交网络已经找到了或多或少稳定的商业模式，而不会侵犯我们的隐私。以Patreon和Etsy为例。\n我们已经建立了一个经济和服务，这些在处理新冠肺炎锁闭事件时是很重要的。\n如果我们打击假新闻，我们就能看到关于世界上正在发生的事情的各种重要观点。我们可以联系住在大洋彼岸、碰巧会弹吉他的人类。\n我们建立的网络是一个有生命的东西，今天面临着挑战。它发展得太快了，被假新闻和骗局感染了。同时，通过阿拉伯之春和“黑人生命也是命”运动，它帮助我们看到了我们社会的问题所在。\n这是由我们来策划和教育的。我们应该努力确保我们在出版时考虑到质量，并采取措施尽可能地让它活下去。我们必须互相教育如何使用网络，如何不成为错误信息和假新闻的受害者。\n这是我们能够确保像随机善行这样的社区继续存在的唯一方法，以激励人们了解网络可以变得多么令人惊叹。\nJason Leung Disqus是为使用网络平台的网站和在线社区提供的全球博客评论托管服务。该公司的平台包括各种功能，如社交整合、社交网络、用户档案、垃圾邮件和审核工具、分析、电子邮件通知和移动评论。维基百科↩︎", "note_en": "The first blog post I wrote was lost, the oldest one I kept is from September 8, 2005. It’s been almost 15 years and I am very happy to see how much better I got in writing and in understanding the world.\n Keeping a site like this is not just about writing and choosing photos. It takes curation and revising how things are organised to make sure nothing gets lost.\n One of the things that I didn’t want to lose were the comments from all the amazing people that have stopped by and given some of their time to show appreciation or disagreement. The last one is always a good opportunity to learn and make sure your beliefs are still sound and logic.\n So I dove into the database of comments, finding some of them lost and misplaced because the website’s posts changed links.\n Some of the links were broken and had to be pieced together; others were wrong and their comments gone.\n I believed I saved all of the comments and in the process drove down an avenue of memories and hindsight on fragile the web we built is.\n  Remember flickr ? It’s still alive and running but not everyone I knew back in 2007 still uses it. A lot of the photos you see in my old posts come from there, but the attribution link is broken because the user decided to delete their account. Some are still working, but the photographer moved on, or passed away.\n Those links are still here for historical reasons, and because it is important to show that those photos have owners, talented people that were kind to share their work without asking for return.\n And the problem doesn’t stop at the attributions of copyright that land in a “Page Not Found” message. Even the files seem to deteriorate.\n As technology evolved, we got better cameras and better monitors. Photos that were pristine now look faded or pixelated. Storage was also a problem. Keeping a website means storing all the files and for a 25 year old with a small budget that meant saving every cent. So I made sure to keep a good balance in image quality and file size. It didn’t do an amazing job resisting the test of time.\n  Websites have a life cycle, and some of the links I found no longer work. Google hates broken links as much as I do, but I also hate to be unjust to the reader. Links that point to other resources, that no longer exist, are still present in the articles I wrote. Again, for the reason of proof of existence.\n I have known of this problem for a while now, and for that reason I got into the habit of saving every file that I use for reference. PDFs, videos, images, music, etc. They may not be used in the article, because there is a link to the original version or author, but if one day that link stops working, the value won’t be lost with it. (This is why this site amounts to over 9 GB)\n  Back in the day, like many, this site was powered by WordPress. It had it’s own comment system. Then disqus  1 appeared, and I tried it for a while. After I stopped using WordPress, I kept the same comment service running. This was when all the links changed to improve the Search Engine Rankings, and a lot of comments got lost in the database.\n    The list could go on, the point is that they have disappeared and some good content along with them.\n And a social network doesn’t have to vanish for you to lose access to what’s there. The owner of a piece of content may lock their profile for any number of reasons and you or your readers won’t be able to see it ever again.\n Legal action on copyright infringement can also take away access to something that was public. Just think about what happens when a YouTube video is found to be at fault with the guidelines.\n  And we are making some of the same mistakes. Think about how many Social Networks use URL shorteners. What happens if Bit.ly decides to close and all those links stop working?\n The websites that we are building use content management software like WordPress, Drupal and others. Will they withstand the test of time or will we have to migrate them to a new system at some point? Trick question, it won’t. Until then we can stay true to our mission and keep on publishing.\n If you were hoping for a bright ending, please don’t give up just now.\n  Through these ordeals and all the experiments we have been running in the way we can communicate among ourselves, we saw a lot of good come out of it. Creators that could have gone unnoticed for ages found a spotlight.\n Social Networks have found business models that are more or less stable without infringing on our privacy. Take  Patreon and  Etsy as an example.\n We have built an economy and services that were important when dealing with the covid-19 lock down.\n And if we fight fake news, we are able to see a variety of important perspectives about what is going on in the world. We can connect with a Human who lives across the ocean and who happens to play guitar.\n The web we built is a living thing and is faced with challenges today. It grew too fast, got infected by fake news and scams. In the meantime, it helped us see what is wrong in our society through the Arab Spring and the Black Lives Matter movements.\n It’s up to us to curate and educate. We should try to make sure that we publish with quality in mind and take steps to see it live on as much as possible. And we have to educate each other on how to use the web and how not to be a victim of misinformation and fake news.\n That’s the only way that we can make sure that communities like  Random Acts of Kindness stay alive to serve as inspiration on how amazing the web can be.\n      jason leung Disqus is a worldwide blog comment hosting service for web sites and online communities that use a networked platform. The company’s platform includes various features, such as social integration, social networking, user profiles, spam and moderation tools, analytics, email notifications, and mobile commenting.  Wikipedia  ↩︎", "posttime": "2020-06-30 23:13:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,评论", "title": "网络正在变得陈旧", "title_en": "The Web Is Getting Old", "transed": 1, "url": "https://brunoamaral.eu/post/the-web-is-getting-old/", "via": "", "real_tags": ["web", "评论"]}]