[{"category": "", "categoryclass": "", "imagename": "fd319e5758693f00d4b6f1487f83740f.jpg", "infoid": 1011763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可再生能源在2020年第一季度打破了欧洲电力组合的另一项纪录，份额达到40%，创下有记录以来的最高季度数字。\n这是根据欧洲电力市场的最新季度报告得出的结论，该报告显示，可再生能源本季度非常成功，同比增长38TWh，成为受疫情影响最小的能源。\n与此同时，化石燃料发电量从2019年第一季度的38%降至今年同期的33%，仅燃煤发电量就降至30%。\n欧盟委员会的报告还估计，放弃化石燃料导致成员国发电的碳足迹减少了20%。\n报告还指出，随着2020年前三个月新的电动汽车注册量翻了一番，新增了近2.5万个公共充电站，对电动汽车(EVS)的需求继续增长。\n报告的结果还显示，欧洲的用电量同比下降了约3%，这主要归因于温暖的冬季条件和新冠肺炎危机导致的经济活动受限。", "note_en": "Renewable energy broke another record for the European  electricity mix in the first quarter of 2020, reaching a 40% share, the highest quarterly figure on record.\n That’s according to the latest quarterly report on European Electricity Markets, which suggests  renewables had a very successful quarter, expanding by 38TWh year-on-year and becoming the least affected energy source by the pandemic.\n  At the same time, the electricity generated by fossil fuels fell from 38% in the first quarter of 2019 to 33% during the same period this year, with coal generation alone dropping to 30%.\n The European Commission’s report also estimates the shift away from fossil fuels caused the carbon footprint of electricity generation in the member states to decrease by 20%.\n It also notes demand for electric vehicles (EVs) continued to grow as new EV registrations doubled and almost 25,000 new public charging points were added in the first three months of 2020.\n Findings of the report also show electricity consumption in Europe declined by approximately 3% year-on-year, a development which is mostly attributed to warm winter conditions and restricted economic activity due to Covid-19 crisis.", "posttime": "2020-07-14 22:52:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打破,smash,报告", "title": "可再生能源打破新纪录，提供欧洲40%的电力", "title_en": "‘Renewables smash new record providing 40% of European electricity’", "transed": 1, "url": "https://www.energylivenews.com/2020/07/14/renewables-smash-new-record-providing-40-of-european-electricity/", "via": "", "real_tags": ["打破", "smash", "报告"]}, {"category": "", "categoryclass": "", "imagename": "277ad96bce1bb6f1b558da0a31a0435f.png", "infoid": 1011762, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的购物车不是为你的标准杂货采购之旅准备的。相反，亚马逊解释说，这款智能车可以处理2袋或更少的中小型杂货旅行。\n这与该技术如何识别购物车篮子中的物品有关。\n亚马逊表示，亚马逊Dash购物车结合了计算机视觉算法和传感器融合技术来识别购物车中的物品。然后，当你通过商店的Dash Cart车道离开时，传感器会自动识别购物车，你的付款会使用你在亚马逊账户上存档的信用卡进行处理。\n要开始使用购物车，你需要用购物车上的阅读器扫描亚马逊应用程序中的二维码。然后你把一两个袋子放进购物车，然后开始购物。在购物车中添加物品时，您需要等待听到嘟嘟声。如果购物车变成橙色，则无法读取项目，您需要重试。\n除了传感器技术，购物车的顶部还有一个屏幕，允许客户访问他们的Alexa购物清单，结账，以及查看他们当前的小计。购物车还将配备优惠券扫描仪，您可以在购物时使用优惠券。\n根据亚马逊提供的视频(几乎没有具体细节)，购物车似乎确实要求产品的条形码是可见的。例如，在视频的一帧中，购物者在将商品添加到购物车之前用手指揭开条形码。视频还显示了装载时条形码面对购物者和购物车屏幕的产品。\n在另一个部分，视频解释了如何“添加没有条形码的商品”，比如农产品。在这种情况下，购物者在屏幕上键入PLU编号并确认重量。\n亚马逊的网站没有详细说明条形码读取是如何涉及到的，但表示这款手推车使用的是“计算机视觉算法”和“传感器融合”。这似乎意味着智能车是亚马逊现有技术“走出去”(Just Walk Out)的下一步，亚马逊Go商店都在使用这项技术。但随着“走出去”的出现，商店正在通过安装在摄像头上的系统以及货架传感器技术来使用计算机视觉来识别产品何时被拿走或退回商店货架。与此同时，Dash手推车将在普通杂货店进行测试，而不是亚马逊Go商店。\n虽然很明显，这辆手推车不仅仅是轮子上的条形码扫描仪，但亚马逊的网站对这项技术使用条形码读取的情况并不完全透明。\n我们还要求亚马逊进一步详细说明它的新技术是如何工作的，他们告诉我们，事实上，购物车确实“首先寻找条形码来快速识别产品”。\n然而，如果条形码被挡住了--例如，被顾客的手挡住了--计算机视觉算法就会尝试识别物体。\n与亚马逊Go商店相比，将Just Walk Out技术引入杂货店将是极其具有挑战性的，亚马逊Go商店的规模是一家便利店。杂货店有更多的商品，购物车需要能够识别，而且新产品也随时都可以买到。\n亚马逊在3月份宣布，将开始向其他零售商出售其无收银员商店技术。一旦技术经过测试和改进，它很可能对其智能车也有类似的计划。当被问及未来的计划时，亚马逊拒绝透露。", "note_en": "The cart today isn’t meant for your standard grocery shopping trip where you’re stocking up. Instead, Amazon explains, the smart cart can handle small-to-medium sized grocery trips of 2 bags or fewer.\n This has to do with how the technology works to identify the items in the cart’s basket.\n  The Amazon Dash Cart uses a combination of computer vision algorithms and sensor fusion to identify the items in the cart, says Amazon. Then, when you exit through the Dash Cart lane in the store, sensors automatically identify the cart and your payment is processed using the credit card you have on file with your Amazon account.\n To start using the cart, you’ll scan a QR code in the Amazon app with the reader on the cart. You then place your one or two bags in the cart and begin shopping. As you add items in the cart, you’ll need to wait to hear a beep. If the cart turns orange, it wasn’t able to read the item and you’ll need to try again.\n In addition to the sensor tech, the cart has a screen at the top that allows customers to access their Alexa Shopping List and check things off, as well as view their current subtotal. The cart will also be equipped with coupon scanner where you can apply the coupons as you shop.\n Based  on the video Amazon provided (and very little specific detail), the cart did seem to require the product’s barcode to be visible. In one frame of the video, for example, the shopper uncovers the barcode with their finger before adding the item to the cart. The video also shows products with the barcode facing the shopper and the cart’s screen, when being loaded.\n In another section, the video explains how to  “add items without a barcode,” like produce. In this case, the shopper types in the PLU number on the screen and confirms the weight.\n Amazon’s website doesn’t detail how barcode reading is involved, but says the cart is using “computer vision algorithms” and “sensor fusion.” That seems to imply the smart cart is the next step beyond Amazon’s existing technology, “Just Walk Out,” which is used across its Amazon Go stores. But with “Just Walk Out, the stores are using computer vision through camera-mounted systems alongside shelf sensor tech to identify when products are taken or returned to store shelves. The Dash Cart, meanwhile, will be tested at a regular grocery store — not an Amazon Go store.\n While clearly the cart is not just a barcode scanner on wheels, Amazon’s website wasn’t being fully transparent about the technology’s use of barcode reading.\n We also asked Amazon to further detail how its new technology works and were told that the cart does, in fact, “first look for a barcode to quickly identify the product.”\n However, if the barcode is obstructed — for example, by the customer’s hand — the computer vision algorithms will then try to identify the object instead.\n Bringing Just Walk Out technology to a grocery store would be extremely challenging compared with an Amazon Go store, which is a convenience store in size. Grocery stores have more items the cart would need to be able to identify and new products become available all the time, as well.\n Amazon announced in March it  would begin selling its cashierless store technology to other retailers. Likely, it has similar plans for its smart cart, once the technology is tested and improved. Amazon declined to speak to its future plans, when asked.", "posttime": "2020-07-14 22:52:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,dash,cart,购物车", "title": "\n亚马逊将测试Dash Cart，这是一款智能杂货购物车，可以看到你买了什么", "title_en": "\n\t\t\t\tAmazon to test Dash Cart, a smart grocery shopping cart that sees what you buy\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/amazon-to-test-dash-cart-a-smart-grocery-shopping-cart-that-sees-what-you-buy/", "via": "", "real_tags": ["亚马逊", "amazon", "dash", "cart", "购物车"]}, {"category": "", "categoryclass": "", "imagename": "33035adddc477a87a84cb5a219fde3fc.png", "infoid": 1011761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早期阶段的独特之处在于，它更像是一个创业训练营，被粉碎成为期两天的虚拟形式，而不是传统的会议。来自整个行业的专家将就一个特定的主题进行演讲，从如何起草第一份合同(詹姆斯·阿隆索(James Alonso)和亚当·扎加里斯(Adam Zagaris))到如何让人们痴迷于你的品牌(艾米莉·海沃德(Emily Heyward))，与会者将能够在每次演讲后参与现场问答。\n我们还将有几次“主舞台”聊天，所有与会者都可以参加，包括与创始人迪伦·菲尔德(Dylan Field，Figma)和玛丽亚姆·纳菲奇(Mariam Nafciy，Minted.com)，以及投资者詹姆斯·巴克豪斯(James Buckhouse)和杰斯·李(Jess Lee，红杉资本)，里德·霍夫曼(Reid Hoffman)和莎拉·郭(Sarah Guo，Greylock)的炉边聊天。\n在两天的活动中，有超过35个分组会议同时进行。如果你是一个早期的创始人，你真的不会错过它。\n除了招聘、品牌建设、公关、法律和成长型营销等核心能力外，我们还将举行大量专注于早期筹款的分组会议。\n筹款可以有点像多米诺骨牌。一旦你有了一个投资者，就很容易带着其他投资者一起去做了。但获得第一个“是”可能是最困难的部分。听听创始人基金的种子期投资者和合伙人Cyan Banister对超早期筹资的注意事项。\n当你开始你的公司时，有成千上万个可以避免的小错误可以把成功变成失败。通过Initialized Capital创始人兼管理合伙人Garry Tan的关键经验，了解如何绕过这些问题，并最大限度地提高成功机会。\n了解如何将并购视为一个可能的退出机会，离开一位前Facebook企业发展主管转变为投资者的人。了解收购者在寻找什么，以及你应该问什么问题。在您建立和发展公司的过程中，为您自己创造选择余地。\n你的球场平台不仅仅是你业务的反映，它本身也是一种产品。你的初创企业的成功，以及避免跑道尽头，取决于产品的转化率。听听Plexo Capital创始合伙人Lo Toney关于如何在制作投球台时像PM一样思考可以产生出色的结果。\n随着科技接管越来越多的行业，债务不仅成为一些初创企业的可行选择，在某些情况下，还成为最优的融资途径。听听WTI风险投资合伙人乔希·布罗迪(Josh Brody)关于如何评估股权与债务、承担债务的正确和错误方式，以及如何选择了解并拥抱与向早期企业放贷相关的内在风险的贷款人。\nWebflow在联合创始人兼首席执行官弗拉德·马格达林(Vlad Magdalin)信任Accel的阿伦·马修(Arun Mathew)作为他们的第一个机构投资者之前，已经自力更生并实现了七年的盈利。听听马格达林如何在没有机构投资的情况下设计了一个可持续、高增长的企业，以及导致他接受风险投资的令人惊讶的因素。\n创始人经常犯一些令人震惊的时机错误，这些错误可能会让原本成功的筹资活动变成失败。我们将讨论如何避免它们，以及如何从您关闭种子的时间开始对工作进行排序，以确保您找到合适的合作伙伴(以合适的价格！)。适用于A系列及以后的产品。\n作为Greylock的合伙人，Saam Motamedi在种子期和早期阶段投资于下一代企业软件创业者，是创业者在产品市场适配性和投放市场规模方面的第一个合作伙伴。他将分享企业创始人要想让他们的早期公司成功适应产品市场应该关注的三件事，以及为什么早期投资往往归结为押注于创始团队。\n多年来，这家种子阶段的风险投资公司已经形成了自己的初创经济，其公司和创始人网络跨越了科技行业和其他领域。通过与招生主管道尔顿·考德威尔(Dalton Caldwell)的讨论，了解Y Combinator今天是如何工作的，以及如何成为它的一部分。\n当你没有与查尔斯·哈德森合作的产品时，如何推销一个想法。\n赚钱是需要钱的。但首先，你必须把钱弄上船。听听种子期投资者查尔斯·哈德森(Charles Hudson)关于当你所要展示的只是一个伟大的想法和对市场的了解时，如何才能转化投资者。\n随着银行和更广泛的金融服务的脱媒，结构良好的初创企业进入这些市场真的会有重大优势。从对重要的增长指标进行基准评估到适应监管改革，更多地了解Canvas Ventures合伙人丽贝卡·林恩评估创始团队的方法，并让公司具备充分利用金融科技机遇的能力。\n现在有一千家微型风投创业者可以从中筹集资金，这造成了令人困惑的市场动态。向Uncork Capital的执行合伙人Jeff Clavier学习筹款技巧和诀窍。\n学习正确和错误的方法来为你的初创企业寻找和接近合适的投资者。在这段与詹姆斯·柯里尔(James Currier)的闪电谈话中，探索风投寻找的6个让你的过程变得更快的要素。詹姆斯·柯里尔是130多家初创企业的投资者，也是NFX Capital的管理合伙人。\n那只是筹款而已。我们还有几十个其他的会议集中在市场营销和运营上。活动将于7月21日和22日举行。", "note_en": "Early Stage is unique in that it’s more of an entrepreneurial bootcamp, smashed into a two-day virtual format, than a traditional conference. Experts from across the industry will give presentations on a specific topic, from  How To Draw Up Your First Contracts (James Alonso and Adam Zagaris) to  How to Get People Obsessed with your Brand (Emily Heyward), and attendees will be able to participate in a live Q&amp;A following each presentation.\n We’ll also have several ‘main stage’ chats that are available to all attendees, including fireside chats with founders Dylan Field (Figma) and Mariam Naficy (Minted.com) and investors James Buckhouse and Jess Lee (Sequoia) and Reid Hoffman and Sarah Guo (Greylock).\n  There are upwards of 35 breakout sessions happening concurrently over the two days of the event. If you’re an early stage founder, you really can’t miss it.\n Alongside core competencies like recruiting, brand building, PR, legal, and growth marketing, we’ll also have a great many breakout sessions focused on early stage fundraising.\n   Fundraising can be a bit like dominoes. Once you get one investor on board, it’s much easier to bring others along for the ride. But getting that first ‘yes’ can be the most difficult part. Hear the do’s and don’ts of hyper early stage fundraising from Cyan Banister, seed-stage investor and partner at Founders Fund.\n  When you’re starting your company, there are thousands of small, avoidable mistakes that can turn success into failure. Learn how to navigate around those and maximize your chance of success with key learnings from Garry Tan, founder and managing partner at Initialized Capital.\n  Learn how to think about M&amp;A as a possible exit opportunity from a former Facebook corporate development executive turned investor. Understand what acquirers are looking for and what questions you should be asking. Create optionality for yourself as you build and grow your company.\n  Your pitchdeck is not just a reflection of your business, it’s a product unto itself. Your startup’s success, and avoiding the end of your runway, depends on the conversion rate of that product. Hear from Plexo Capital founding partner Lo Toney about how thinking like a PM when crafting your pitch deck can produce outstanding results.\n  As tech takes over more and more industries, debt is becoming not only a viable option for some startups, but, in some cases, an optimal financing path. Hear from WTI Venture Partner Josh Brody on how to evaluate equity vs. debt, the right and wrong ways to take on debt, and how to pick a lender that understands and embraces the inherent risks associated with lending to early stage businesses.\n  Webflow was bootstrapped and profitable for seven years before co-founder and CEO, Vlad Magdalin trusted Accel’s Arun Mathew as their first institutional investor. Hear how Magdalin designed a sustainable, high-growth business without institutional investment, and the surprising factors that led him to take VC investment.\n  There are some shockingly common timing mistakes founders make that can turn an otherwise successful fundraise into a failure. We’ll talk through how to avoid them and how to sequence efforts from the time you close your seed to ensure you find the right partner (at the right price!) for Series A and beyond.\n  As a Partner at Greylock, Saam Motamedi invests in the next generation of enterprise software entrepreneurs at the seed and early stages, and is the first partner to entrepreneurs as they navigate product-market fit and go-to-market scale. He’ll share the three things enterprise founders should focus on to successfully get their early stage companies to product market fit, and why making early stage investments often comes down to betting on the founding team.\n  The seed-stage venture firm has come to form its own startup economy over the years, with its network of companies and founders interconnecting across the tech industry and beyond. Find out how Y Combinator works today, and how you can become a part of it, in this discussion with head of admissions Dalton Caldwell.\n How to sell an idea when you don’t have a product with Charles Hudson\n It takes money to make money. But first, you must get the money on board. Hear from seed-stage investor Charles Hudson about what it takes to convert investors when all you have to show is a great idea and an understanding of the market.\n  With the disintermediation of banks, and financial services more broadly, startups that are well structured can really have major advantages entering those markets. From benchmarking growth metrics that matter to navigating regulatory changes, learn more about Canvas Ventures partner Rebecca Lynn’s approach towards evaluating founding teams and equipping companies with what it takes to make the most of opportunities in fintech.\n  There are now a thousand micro-VCs entrepreneurs can raise capital from, creating confusing market dynamics. Learn tips and tricks on fundraising from Uncork Capital’s Managing Partner, Jeff Clavier.\n  Learn the right and wrong ways to find and approach the right investors for your startup. Discover the 6 elements VC’s look for that will make your process fast, in this lightning talk with James Currier, investor in over 130 startups and Managing Partner at NFX Capital.\n And that’s just fundraising. We have dozens of other sessions focused on marketing and operations. The event goes down July 21 and 22.", "posttime": "2020-07-14 22:51:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "想要,learn,企业", "title": "\n您可能想要了解的有关筹款的所有内容都将在TC早期阶段进行介绍。", "title_en": "\n\t\t\t\tEverything you could possibly want to learn about fundraising will be covered at TC Early Stage\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/everything-you-could-possibly-want-to-learn-about-fundraising-will-be-covered-at-tc-early-stage/", "via": "", "real_tags": ["想要", "learn", "企业"]}, {"category": "", "categoryclass": "", "imagename": "8a73859a207f4e2e9aac4b95a722726e.jpg", "infoid": 1011760, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "唯一的创始人兼公司首席执行官萨姆·奥沙伊刚刚从宾夕法尼亚大学毕业，获得了跨越工程学和商学的双学位，然后加入了夏季的一批人。Oshay正在通过使用机器学习来驱动更多数据驱动的决策制定，从而给ERP带来了现代的转折。\n我们与SAP、Infor和Evercore等其他ERP的不同之处在于，我们可以告诉用户一些他们还不知道的事情。“。他说，这些传统的ERP基本上是数据输入系统。例如，您可以输入价目表，但在预测方面无法对其执行任何操作。\n“我们可以浏览历史数据，提出定价建议和预测。因此，我们是一个ERP，它不仅进行数据分析，而且还导入外部数据，并将其与内部数据进行匹配，以做出建议和预测。“Oshay解释说。\n虽然他预计不会局限于批发业务，但他从批发业务起步是有道理的，因为他的家族有经营这类业务的历史。事实上，他的祖父在第二次世界大战后移民到美国，开始了一家五金批发企业，他的叔叔至今仍在经营。他的父亲开始了自己的生意，销售批发运输用品，他在家族企业中长大，这给了他一些大多数最近的大学毕业生可能不会有的洞察力。\n“我对批发业务有了很深的了解。我所观察到的是，我父亲的企业出现了很多问题，归根结底是他的ERP系统出现了问题。我突然想到，如果有人要建立一个ERP扩展或更好的ERP，他们可以释放出目前锁定在这些遗留系统中的如此多的价值，“他说。\n因此，他做了优秀的企业家会做的事情，并开始建造它。首先，他的系统可以接入SAP或NetSuite等遗留系统，但计划是一步一步打造更好的ERP。就目前而言，它是关于批发的，但他对他的公司有更广阔的视野。\n他最初在大三2019年秋季学期申请YC，并被冬季批次录取，但推迟到2020年夏季组完成学业。他在宾夕法尼亚大学剩下的时间都在冲刺提前毕业，修了10门课才接近完成学业(他和学位之间只有一篇论文)。\n他说，由于这批货物是远程交付的，YC团队已经考虑到了这一点，并仍在为夏季小组提供有意义的体验。“所有YC通常会做的事情仍然在发生，只是远程进行而已。据我所知，我们正在进行的一些活动是专门为这种奇怪的情况而设计的。YC团队花了相当多的心思让这批东西变得有意义，我认为他们已经成功了，“他说。\n虽然大流行给处于早期阶段的企业带来了新的挑战，但他说，在某些方面，这帮助他更好地集中精力。他没有和朋友出去，而是在家里埋头工作，几乎没有分心。\n正如您预期的那样，该产品现在还处于早期阶段，但他有三个客户正在运营，还有两个客户处于实现阶段。到目前为止，他还有两名员工，一名前端工程师和一名后端工程师。\n目前，他将继续打造他的产品和业务，他认为这场流行病可能会让企业更愿意改变像传统ERP这样的系统。他说：“如果他们想尝试一些新的东西，你可以让他们更容易尝试，我发现那是一个你可以进行销售的地方。”", "note_en": "Sole founder and company CEO Sam Oshay just graduated from the University of Pennsylvania with a dual degree that straddled engineering and business, before joining the summer batch. Oshay is bringing a modern twist to ERP by using machine learning to drive more data-driven decision making.\n “What makes us different from other ERPs like SAP, Infor and Evercore is that we can tell the user something that they don’t already know.” He says these traditional ERPs are basically data entry systems. For example, you could enter a pricing list, but you can’t do anything with it in terms of predictions.\n  “We can scan historical data and make pricing recommendations and predictions. So we are an ERP that not only does data analysis, but also imports external data and matches it to internal data to make recommendations and predictions,” Oshay explained.\n While he doesn’t expect to remain confined to just the wholesale side of the business, it makes sense that he started with it because his family has a history of running these kinds of businesses. In fact, his grandfather immigrated to the U.S. after World War II and started a hardware wholesale business that his uncle still runs today. His dad started his own business selling wholesale shipping supplies, and he grew up in the family business, giving him some insight that most recent college grads probably wouldn’t have.\n “I learned about the wholesale business at a very deep level. And what I observed is that so many of the issues with my dad’s business came down to issues with his ERP system. It occurred to me that if someone were to build an ERP extension or a better ERP, they could unlock so much of the value that is currently locked inside these legacy systems,” he said.\n So he did what good entrepreneurs do, and began building it. For starters, his system plugs into legacy systems like SAP or NetSuite, but the plan is to build a better ERP, one step at a time. For now, it’s about wholesale, but he has a much broader vision for his company.\n He originally applied to YC during the Fall 2019 semester of his junior year, and was admitted to the winter batch, but deferred to the Summer 2020 group to complete his studies. He spent his remaining time at UPenn sprinting to early graduation, taking 10 classes to come close to finishing his studies (with just a dissertation standing between him and his degree).\n With this batch being delivered remotely, he says that the YC team has taken that into account and is still offering a meaningful experience for the summer group. “All of the events that YC would normally be doing are still happening, just remotely. And to my knowledge, some of the events we’re doing are designed specifically for this weird set of circumstances. The YC team has put quite a bit of thought into making this batch meaningful and I think they’ve succeeded,” he said.\n While the pandemic has created new challenges for an early-stage business, he says that in some ways it’s helped him focus better. Instead of going out with friends, he’s home with his head down working on his company with little distraction.\n As you would expect, it’s early days for the product, but he has three customers who are operational and two more in the implementation phase. He also has two employees so far, a front end and back end engineer.\n For now, he’s going to continue building his product and his business, and he sees the pandemic as a time when businesses might be more open to changing a system like a legacy ERP. “If they want to try something new, and you can make it easier for them to try that, I’ve found that’s a place where you can make a sale,” he said.", "posttime": "2020-07-14 22:51:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "giants,erp", "title": "\nRecurrency正在用ERP的现代转折与SAP这样的巨头展开竞争", "title_en": "\n\t\t\t\tRecurrency is taking on giants like SAP with a modern twist on ERP\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/recurrency-is-taking-on-giants-like-sap-with-a-modern-twist-on-erp/", "via": "", "real_tags": ["giants", "erp"]}, {"category": "", "categoryclass": "", "imagename": "c1481866f8ac975e5bd0efeda6491de0.jpg", "infoid": 1011758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tracable是一家开发端到端云应用安全解决方案的初创公司，今天从秘密行动中脱颖而出，获得了2000万美元的资金。首席执行官乔蒂·班萨尔(Jyoti Bansal)计划专注于获取全球客户，同时壮大Tracable的团队，加快研发。\n云原生应用通常使用成百上千个API微服务(即松散耦合的服务)构建，这使得它们很难大规模保护。Gartner预测，到2022年，API滥用将成为最频繁的攻击载体，考虑到截至2018年API调用占网络流量的83%，这并不令人惊讶。\nTracable使用机器学习算法来保护这些API，这些算法可以分析从用户和会话一直到代码的应用程序活动。Bansal声称，这些算法学习区分假阳性率低于1%的正常和异常行为，并为可能偏离正常标准的活动提供警报。\n“云原生应用显然已经成为黑客最喜欢的攻击目标。这些应用程序都是API驱动的，API向外界公开业务逻辑。Bansal告诉VentureBeat：“现有的应用程序安全方法不是为现代应用程序架构构建的，它们在狭窄的上下文中使用数据来检测威胁活动。Tracable的方法是直接从应用程序向我们的机器学习技术TraceAI提供极其丰富和高度有用的分布式跟踪数据。这种实时跟踪数据和机器学习的结合独特地使Tracable能够高度准确地区分合法和恶意用户以及应用程序活动。“。\n班萨尔是AppDynamics的创始人和前首席执行官，他与AppyDynamics前副总裁桑杰·纳加拉伊共同创立了Tracable。(思科于2017年以约37亿美元收购了AppDynamics。)。在AppDynamics工作期间，Bansal对越来越多地采用云原生架构有很好的看法。他说，他很快意识到现有的云应用安全方法存在不足-大多数方法只提供有限的应用层可见性，并受到高误报率的影响，而其他方法则旨在使用易于理解的协议保护传统应用，而不是使用自定义API的分布式应用。\n我们的一个客户拥有大约700个API终端。这些会话的范围从10个API调用到100个API调用，“Nagaraj解释说。“从理论上讲，这将归结为700的10次方，或700的100个可能人物的次方。但与自然语言一样，应用程序也有自己的语法，其中API类似于自然语言中的单词，并且API交互基于潜在的语法。这些端点中的每个端点都有多达6,000个响应正文密钥和大约100个请求密钥和数百个标头。在规模上验证这种错综复杂的关系的组合复杂性不是暴力分析或基于规则的引擎所能解决的。取而代之的是，它需要先进的、可扩展的机器学习技术。“。\n“云原生应用显然已经成为黑客最喜欢的攻击目标。这些应用程序都是API驱动的，API向外界公开业务逻辑。Bansal说：“现有的应用程序安全方法不是为现代应用程序架构构建的，它们在狭义环境中使用数据来检测威胁活动。\nBansal说，Tracable有很多付费客户，但为了促进该平台的采用，他和Nagaraj将底层的分布式跟踪技术以开源方式提供。名为Hypertrace的它使DevOps团队能够观察和监控生产应用程序，具有支持可跟踪的相同的跟踪和可观察性功能。\n班萨尔自己不同寻常的风险投资公司(Ventures)牵头了Tracable价值2000万美元的首轮融资。这是这家风险投资公司自2019年4月以来最大的承诺之一，当时它参与了Bansal的Harness.io的6000万美元融资，这是一家利用人工智能检测应用部署质量并自动回滚失败应用部署的初创公司。\nTracable退出隐形之前，推出了Salt Security，这是一家类似的网络安全初创公司，它开发了一种保护解决方案，可以发现API并发现漏洞。SALT和Tracable在方法上类似于弹性光束，但不完全相同，弹性光束是一家API网络安全公司，于2018年6月被总部位于科罗拉多州丹佛的Ping Identity收购。其他竞争对手包括Sphere Defense，它采用基于机器学习的方法来创建Web应用程序防火墙，以及Wallarm，它为API以及网站和微服务提供人工智能支持的安全平台。", "note_en": "Traceable, a startup developing an end-to-end cloud app security solution, today emerged from stealth with $20 million in funding. CEO Jyoti Bansal plans to focus on acquiring customers globally while growing Traceable’s team and accelerating R&amp;D.\n Cloud-native apps are often built with hundreds or even thousands of API microservices (i.e., loosely coupled services), making them difficult to protect at scale. Gartner  predicts that by 2022 API abuses will be the most frequent attack vector, which isn’t surprising,  considering API calls represented 83% of web traffic as of 2018.\n  Traceable works to protect these APIs with machine learning algorithms that analyze app activity from the user and session all the way down to the code. These algorithms learn to distinguish between normal and anomalous behavior with a false positive rate of less than 1%, Bansal claims, and to provide alerts for activity that might deviate from the norm.\n “Cloud-native applications have clearly become hackers’ favorite targets. These applications are all API-driven, with APIs exposing business logic to the outside world. Existing application security approaches aren’t built for modern application architectures and use data in a narrow context to detect threat activity,” Bansal told VentureBeat. “Traceable’s approach is to feed TraceAI, our machine learning technology, with extremely rich and highly useful distributed tracing data directly from the application. This combination of real-time trace data and machine learning uniquely enables Traceable to distinguish between legitimate and malicious users and application activity with a high degree of accuracy.”\n Bansal, the founder and former CEO of AppDynamics, cofounded Traceable with former AppyDynamics VP Sanjay Nagaraj. (Cisco acquired AppDynamics in 2017 for roughly $3.7 billion.) While at AppDynamics, Bansal had a prime view of the growing adoption of cloud-native architectures. He says he soon realized existing approaches to cloud app security fell short — most only provided limited visibility into the app layer and suffered from high false-positive rates, while others were designed to protect traditional apps with well-understood protocols as opposed to distributed apps using custom APIs.\n “One of our customers has approximately 700 API endpoints. These sessions ranged anywhere from 10 API calls to 100 API calls,” explained Nagaraj. “Theoretically, this would come down to 700 to the power of 10, or 700 to the power of 100 possible personas. But like in natural language, applications have their own grammar, where APIs are akin to words in natural language and API interaction is based on a latent grammar. Each of these endpoints had as many as 6,000 response body keys and around 100 request keys and hundreds of headers. The combinatorial complexity of validating this intricate relationship at scale is something that cannot be solved by brute-force analysis or a rules-based engine. Instead, it requires advanced and scalable machine learning techniques.”\n “Cloud-native applications have clearly become hackers’ favorite targets. These applications are all API-driven, with APIs exposing business logic to the outside world. Existing application security approaches aren’t built for modern application architectures and use data in a narrow context to detect threat activity,” said Bansal.\n Bansal says Traceable has a number of paying customers, but to spur adoption of the platform, he and Nagaraj made the underlying distributed tracing technology available in open source. Dubbed Hypertrace, it enables DevOps teams to observe and monitor production applications with the same tracing and observability features powering Traceable.\n Bansal’s own Unusual Ventures led Traceable’s $20 million series A round. This is one of the venture firm’s largest commitments since April 2019, when it participated in a $60 million round in Bansal’s Harness.io, a startup that leverages AI to detect the quality of app deployments and automatically roll back failed ones.\n Traceable’s exit from stealth follows the launch of  Salt Security, a cybersecurity startup similarly developing a protection solution that discovers APIs and spots vulnerabilities. Salt and Traceable are similar in approach — but not identical — to Elastic Beam, an API cybersecurity company that was acquired by Denver, Colorado-based Ping Identity in June 2018. Other rivals include Spherical Defense, which adopts a machine learning-based approach to web application firewalls, and Wallarm, which provides an AI-powered security platform for APIs, as well as websites and microservices.", "posttime": "2020-07-14 22:50:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,程序,开发,人工智能,led", "title": "Tracable是一家为云应用程序开发人工智能安全工具的初创公司，它从秘密行动中脱颖而出，在首席执行官自己不同寻常的风险投资公司的带领下，筹集了2000万美元的首轮融资", "title_en": "Traceable, a startup developing AI-powered security tools for cloud apps, emerges from stealth and raises $20M Series A led by the CEO's own Unusual Ventures", "transed": 1, "url": "https://venturebeat.com/2020/07/14/traceable-raises-20-million-for-ai-system-that-shields-cloud-app-apis-from-cyberattacks/", "via": "", "real_tags": ["风险投资", "程序", "开发", "人工智能", "led"]}, {"category": "", "categoryclass": "", "imagename": "33695374e61e3ec3e939442665ef68ae.jpg", "infoid": 1011757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Verizon已经转向谷歌云的联系中心AI，使其客户服务电话和聊天机器人对话自动化。\n美国电信巨头Verizon周一滔滔不绝地表示：“由于与谷歌云(Google Cloud)的新合作，寻求支持的Verizon客户可能很快就会找到更自然、更流畅的数字体验。”\n“在这种体验的背后，他们不会看到的是对话式人工智能，它可以帮助客服工程师回应客户询问，也可以直接帮助消费者。”\n我们被告知，联系中心的人工智能技术将使用自然语言识别技术，在客户说话的过程中将其转录下来。这种语音到文本的输出将输入到Dialogflow，这是一个分析文本并实时生成响应的平台。同样，与在线支持聊天机器人的书面对话将由谷歌的人工智能实时处理。\n总体目标是让用户在计算机系统、键盘或电话上使用自然语言抱怨，人工智能应该能够找出客户想要什么，并帮助他们解决问题，而不需要他们导航菜单或发出简单的命令。\n据推测，其目标是快速分拣出简单的东西，而不需要人工操作员上线处理。我们希望，有更棘手问题的订阅者也应该被引导到人类那里，而不必通过菜单或无关程序的脚本进行谈判。\n软件代理还可以根据订户的请求建议相关的在线文档，例如关于如何查看或支付账单的信息。\n无论是通过语音呼叫还是聊天，客户都不需要查看菜单提示或选项树；他们只需说出或键入他们的请求，自然语言识别功能就能找到帮助他们的最佳方式。威瑞森声称，没有矫揉造作的语言或机器人般的命令。\n有趣的是，如果你接通一个人，或者要求和一个人说话，工作人员很可能只会告诉你人工智能想说的话：软件会在幕后向呼叫中心的工作人员提供提示。\n电信公司说，对于实时座席请求，联系中心人工智能座席辅助功能为Verizon的客户服务座席提供了一个实时数字助手，该助手可以在知识库中获取相关文章，然后在对话的每一轮中向座席推荐个性化的回复，帮助服务座席有效地回答客户的问题并解决任何问题，电信公司说，这一功能可以帮助Verizon的客户服务工程师获取知识库中的相关文章，然后在对话的每一轮对话中向座席推荐个性化的回复，帮助服务人员有效地回答客户问题并解决任何问题。\n谷歌的联系中心人工智能服务于去年7月推出，并于11月正式投入使用。它有两个主要工具：虚拟代理和代理辅助。前者执行基本的交互，并将客户与真人联系起来，以获得进一步的支持。后者处理和转录呼叫，并向人类代理建议解决问题的循序渐进的指令。\n目前还不清楚Verizon将如何以及何时部署谷歌的软件。The Register已经要求这家蜂窝网络巨头发表评论。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Verizon has turned to Google Cloud’s Contact Center AI to automate its customer-service phone calls and chatbot conversations.\n  “Verizon customers in search of support may soon find a more natural and streamlined digital experience, thanks to a new collaboration with Google Cloud,” the US telecoms giant  gushed on Monday.\n  “What they won’t see behind this experience is the conversational artificial intelligence that can help customer care agents respond to customer queries, as well as assist consumers directly.”\n  The Contact Center AI technology will, we&#39;re told, use natural-language recognition to transcribe on-the-fly customers as they talk down the line. This speech-to-text output will be fed into  Dialogflow, a platform that parses the text and generates responses in real-time. Similarly, written conversations with online support chatbots will be processed in real-time by Google&#39;s AI.\n  The overall aim is to allow subscribers to rant, er, complain away using natural language at the computer system, from their keyboards or over the phone, and the artificial intelligence should be able to work out what customers want, and help them out, without them having to navigate a menu or bark simple commands.\n  And presumably the aim is to sort out simple stuff quickly without a human operator having to come on the line and deal with it. Subscribers with trickier problems should also, we hope, be directed to a human being without having to negotiate their way through a menu or a script of irrelevant procedures.\n  The software agents can also suggest relevant online documentation, such as information on how to view or pay a bill, based on a subscriber&#39;s request.\n    &#34;Whether through voice call or chat, customers will not need to go through menu prompts or option trees; they simply say or type their request, and the natural-language recognition feature finds the best way to assist them. No stilted speech or robot-like commands,&#34; Verizon claimed.\n  Amusingly, if you get through to a human, or demand to speak to a person, the staffer will probably just tell you what the AI wanted to say anyway: the software will, behind the scenes, provide prompts to the call-center workers.\n  &#34;For live agent requests, the Contact Center AI Agent Assist feature offers Verizon’s customer care agents a real-time digital assistant that fetches relevant articles within the knowledge base, and then recommends personalized responses to agents at each turn of the conversation, assisting the care agents in effectively answering customer questions and addressing any issues,&#34; the telco said.\n  Google’s Contact Center AI service was launched last July and made available for general use in November. It features two main tools: virtual agent and agent assist. The former carries out basic interactions and connects customers to real humans for further support. The latter processes and transcribes calls and suggests to human agents step-by-step instructions to solve an issue.\n  It’s unclear how and when Verizon will deploy Google’s software.  The Register has asked the cellular network giant for comment. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-07-14 22:49:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,机器人,bot,客户", "title": "你打电话给威瑞森。一个Google机器人回答。你要求一个人类", "title_en": "You call Verizon. A Google bot answers. You demand a human", "transed": 1, "url": "https://www.theregister.com/2020/07/13/if_customer_service_for_verizon/", "via": "", "real_tags": ["google", "机器人", "bot", "客户"]}, {"category": "", "categoryclass": "", "imagename": "2ed689e8180620e70917b437b25241c9.png", "infoid": 1011756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已向SAP客户披露了一个严重漏洞，该漏洞在CVSS错误严重程度量表上的严重程度评分为10分(满分10分)。\nSAP广泛部署的企业资源规划(ERP)软件集合用于管理其财务、物流、面向客户的组织、人力资源和其他业务领域。因此，这些系统包含大量敏感信息。\n根据国土安全部的警报，成功利用该漏洞为攻击者打开了读取和修改财务记录；更改银行详细信息；读取个人身份信息(PII)；管理购买流程；破坏或中断操作；实现操作系统命令执行；以及删除或修改痕迹、日志和其他文件的大门。\n他们指出，发现该漏洞的Onapsis Research Labs研究人员已将该漏洞(CVE-2020-6287)命名为Recon，它影响了超过4万名SAP客户。SAP周二发布了该问题的补丁，作为其2020年7月安全报告的一部分。\nOnapsis首席执行官马里亚诺·努涅斯告诉Threatpost：“它代表NetWeaver上的远程可利用代码。”“此漏洞存在于SAP NetWeaver Java版本7.30至7.50(截至[我们的分析出版物]的最新版本)中。到目前为止测试的所有支持包都是易受攻击的。SAP NetWeaver是几种SAP产品和解决方案的基础层。“。\n根据该公司的说法，利用该漏洞的攻击者将在各种不同的情况下不受限制地访问关键业务信息和流程。\n据Onapsis称，该漏洞影响到每个运行SAP NetWeaver Java技术堆栈的SAP应用程序中存在的默认组件。研究人员说，这一技术组件用于许多SAP业务解决方案，如SAP S/4HANA、SAP SCM、SAP CRM、SAP CRM、SAP Enterprise Portal、SAP Solution Manager(Solman)和许多其他解决方案。\n根据国土安全部的说法，该漏洞是由于SAP NetWeaver的Web组件中与Java一样缺乏身份验证造成的，从而允许SAP系统上的多个高权限活动。未经验证的远程攻击者可以通过HTTP接口攻击此漏洞，该接口通常向最终用户公开，在许多情况下还会向Internet公开。\n警报称：“如果攻击成功，未经验证的远程攻击者可以通过创建高权限用户并使用SAP服务用户帐户(&lt；sid&gt；adm)的权限执行任意操作系统命令，从而获得对SAP系统的不受限制的访问权限，该帐户拥有对SAP数据库的无限制访问权限，并且能够执行应用程序维护活动，例如关闭联合SAP应用程序。”\nNunez说，换句话说，未经验证的攻击者可以创建具有最大权限的新SAP用户，绕过所有访问和授权控制(如职责分离、身份管理以及治理、风险和合规解决方案)，并获得对SAP系统的完全控制。\nOnapsis在周二发布的一份技术分析报告中表示：“由于SAP NetWeaver Java是几种SAP产品的基本基础层，具体影响将因受影响的系统而异。”具体地说，在NetWeaver Java之上运行的不同SAP解决方案有一个共同的特殊性：它们通过API和接口进行超级连接。换言之，这些应用程序连接到内部和外部的其他系统，通常利用高特权的信任关系。“。\n虽然这已经足够糟糕了，但当受影响的解决方案暴露在互联网上，将公司与业务合作伙伴、员工和客户联系起来时，Recon漏洞的风险会增加。研究人员说，这些系统-Onapsis估计至少有2500个-远程攻击的可能性增加。在这些易受攻击的安装中，33%在北美，29%在欧洲，27%在亚太地区。\n“由于攻击者通过利用未打补丁的系统获得的不受限制的访问类型，该漏洞还可能构成企业IT控制中的一个缺陷，以满足监管要求-潜在地影响财务(萨班斯-奥克斯利法案)和隐私(GDPR)合规性，”根据这份记录，“这一漏洞可能会影响财务(萨班斯-奥克斯利法案)和隐私(GDPR)合规性。”\n研究人员建议，应该立即应用SAP的补丁。虽然目前还没有迹象表明这一漏洞已被利用，但努内兹告诉Threatpost，SAP客户现在应该保持高度警惕，因为漏洞已经宣布，国土安全部已经发出了美国CERT警报。\n“现在漏洞和补丁已经发布，熟练的黑客可以快速开发利用代码，”他说。因为有许多易受攻击的暴露在互联网上的SAP系统，所以攻击的复杂性大大降低。“。\n尽管如此，Onapsis团队承认，由于任务关键型应用程序的复杂性和有限的维护窗口，组织经常面临快速应用SAP安全说明的挑战。\nNunez告诉Threatpost：“很难修补像SAP这样的关键任务应用程序，因为它们需要持续可用。”“测试可能需要很长时间，这取决于应用程序的复杂性和定制化。此外，可用于应用补丁程序的维护窗口也很有限。“。\n他补充说：“对于SAP客户来说，Recon等关键漏洞突显了保护关键任务应用程序的必要性，方法是扩展现有的网络安全和合规计划，以确保这些应用程序不再处于盲区。这些系统是企业的命脉，在严格的合规要求范围内，因此没有什么比这更重要的了。“。\nBEC和企业电子邮件诈骗正在激增，但DMARC可以提供帮助-如果处理得当的话。7月15日下午2点。ET，与Valimail全球技术总监Steve Whitter和Threatpost一起参加一个免费的网络研讨会，名为“DMARC：7个常见的商业电子邮件错误”。此技术“最佳实践”会议将涵盖构建、配置和管理电子邮件身份验证协议，以确保您的组织受到保护。单击此处注册参加由Valimail赞助的Threatpost网络研讨会。", "note_en": "A critical vulnerability, carrying a severity score of 10 out of 10 on the CvSS bug-severity scale, has been disclosed for SAP customers.\n SAP’s widely deployed collection of enterprise resource planning (ERP) software is used to manage their financials, logistics, customer-facing organizations, human resources and other business areas. As such, the systems contain plenty of sensitive information.\n According to  an alert from the Department of Homeland Security, successful exploitation of the bug opens the door for attackers to read and modify financial records; change banking details; read personal identifiable information (PII); administer purchasing processes; sabotage or disrupt operations; achieve operating system command execution; and delete or modify traces, logs and other files.\n  The bug ( CVE-2020-6287) has been named RECON by the Onapsis Research Labs researchers that found it, and it affects more than 40,000 SAP customers, they noted. SAP  delivered a patch for the issue on Tuesday as part of its July 2020 Security Note.\n “It stands for Remotely Exploitable Code On NetWeaver,” Mariano Nunez, CEO of Onapsis, told Threatpost. “This vulnerability resides inside SAP NetWeaver Java versions 7.30 to 7.50 (the latest version as of [our analysis publication]. All Support Packages tested to date were vulnerable. SAP NetWeaver is the base layer for several SAP products and solutions.”\n An attacker leveraging this vulnerability will have unrestricted access to critical business information and processes in a variety of different scenarios, according to the firm.\n  The bug affects a default component present in every SAP application running the SAP NetWeaver Java technology stack, according to Onapsis. This technical component is used in many SAP business solutions, such as SAP S/4HANA, SAP SCM, SAP CRM, SAP CRM, SAP Enterprise Portal, SAP Solution Manager (SolMan) and many others, the researchers said.\n According to DHS, the vulnerability is introduced due to the lack of authentication in a web component of the SAP NetWeaver AS for Java, allowing for several high-privileged activities on the SAP system. A remote, unauthenticated attacker can exploit this vulnerability through an HTTP interface, which is typically exposed to end users and, in many cases, exposed to the internet.\n “If successfully exploited, a remote, unauthenticated attacker can obtain unrestricted access to SAP systems through the creation of high-privileged users and the execution of arbitrary operating system commands with the privileges of the SAP service user account ( &lt;sid&gt;adm), which has unrestricted access to the SAP database and is able to perform application maintenance activities, such as shutting down federated SAP applications,” according to the alert.\n  Put another way, an unauthenticated attacker could create a new SAP user with maximum privileges, bypassing all access and authorization controls (such as segregation of duties, identity management, and governance, risk and compliance solutions) and gaining full control of SAP systems, Nunez said.\n “With SAP NetWeaver Java being a fundamental base layer for several SAP products, the specific impact would vary depending on the affected system,” according to Onapsis, in a  technical analysis released on Tuesday. “In particular, there are different SAP solutions running on top of NetWeaver Java which share a common particularity: they are hyper-connected through APIs and interfaces. In other words, these applications are attached to other systems, both internal and external, usually leveraging high-privileged trust relationships.”\n And while this is bad enough, the RECON vulnerability’s risk increases when the affected solutions are exposed to the internet, to connect companies with business partners, employees and customers. These systems – Onapsis estimates there are at least 2,500 of them – have an increased likelihood of remote attacks, researchers said. Out of those vulnerable installations, 33 percent are in North America, 29 percent are in Europe and 27 percent are in Asia-Pacific.\n “Because of the type of unrestricted access an attacker would obtain by exploiting unpatched systems, this vulnerability also may constitute a deficiency in an enterprise’s IT controls for regulatory mandates—potentially impacting financial (Sarbanes-Oxley) and privacy (GDPR) compliance,” according to the writeup.\n  SAP’s patch should be applied immediately, researchers recommended. While for now there is no indication that this has been exploited yet, Nunez told Threatpost that SAP customers should be on high alert now that the vulnerability has been announced and the DHS has sent out its US CERT alert warning.\n “Now that the vulnerability and patch have been released, skilled hackers can quickly develop exploit code,” he said. “Because there are many vulnerable Internet exposed SAP systems, the complexity of the attack is significantly less.”\n That said, because of the complexity of mission-critical applications and limited maintenance windows, organizations are often challenged to rapidly apply SAP security notes, the Onapsis team acknowledged.\n “It’s difficult to patch mission-critical applications such as those from SAP because they need to be constantly available,” Nunez told Threatpost. “Testing can take a long time depending upon complexity and customization of the apps. Also, there are limited maintenance windows available to apply the patches.”\n He added, “For SAP customers, critical vulnerabilities such as RECON highlight the need to protect mission-critical applications, by extending existing cybersecurity and compliance programs to ensure these applications are no longer in a blind spot. These systems are the lifeblood of the business and under the scope of strict compliance requirements, so there is simply nothing more important to secure.”\n BEC and enterprise email fraud is surging, but DMARC can help – if it’s done right. On July 15 at 2 p.m. ET, join Valimail Global Technical Director Steve Whittle and Threatpost for a  FREE webinar, “DMARC: 7 Common Business Email Mistakes.” This technical “best practices” session will cover constructing, configuring, and managing email authentication protocols to ensure your organization is protected.  Click here to register for this Threatpost webinar, sponsored by Valimail.", "posttime": "2020-07-14 22:48:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "错误,sap", "title": "严重的SAP错误允许完全接管企业系统", "title_en": "Critical SAP Bug Allows Full Enterprise System Takeover", "transed": 1, "url": "https://threatpost.com/critical-sap-bug-enterprise-system-takeover/157392/", "via": "", "real_tags": ["错误", "sap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011753, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于苹果ARM的发布，我想我可能会就我最近写的一段代码写一篇帖子，专门研究ARM64，以及它在各种硬件上的基准测试。\n我一直在为一个项目实现一些紧凑的数据结构。该实现的CPU热点之一是需要对可能很大的内存位运行快速人口计数。\n如果您以前从未见过人口计数，则它是一个字节(或字节列表)中设置为1的位数的计数，例如：\n现在，在过去十年左右的时间里，每个合理的x86_64/AMD641CPU都有一个内置指令：POPCNT。它的工作方式如下(在围棋汇编器中)：\n通过SSA编译器重写(在1.9中添加)，GO在数学/位中使用内置指令，但一次最多只能使用uint64；使用汇编在[]字节上循环要高效得多。\n@tmthrogd在github.com/tmthrogd/go-popcount上创建了一个非常不错的x86_64汇编优化包。它工作得很好，绕过了一个奇怪的Intel小错误(参见有用的评论)，而且仍然比循环和使用Go标准库更快，后者也很有帮助地进行了基准测试。\n最近，我买了一部新的8 GB覆盆子PI 4。给它装上漂亮的新款Manjaro 20.06，并设置了我平常的环境。作为测试，我想试一下我最新的WIP数据结构代码。当然，瓶颈就在我预期的地方：人口计数。\n我发现ARM64有一条类似POPCNT的指令，逻辑上称为CNT。我想，既然我一直在玩Go Assembly for memmove，为什么不尝试一下新的架构呢？\nGo已经在ARM上为OnesCount提供了SSA-Rewrite(在1.11中添加)，但是同样，一次只有uint64。桌上可能会有一些表演。\n官方建筑指南已经准备好了，我得去工作了。还有很多东西要学。一些注意事项：\nneon是向ARM体系结构添加向量指令的名称，因此我将同时使用一个不熟悉的体系结构及其向量指令。\n在x86-land中，POPCNT和矢量化是两个独立的概念。POPCNT作为一条指令，处理日常的64位整数寄存器，而不是向量寄存器(尽管它出现的时间与向量指令的加法SSE4大致相同)2。\nARM/霓虹灯对CNT的作用不同。由于您可以加载项目数组(例如，ARM64向量寄存器中的16个字节)，因此CNT将对它们进行单独计数。事实上，您只能在单字节的向量中执行此操作。\n因此，这意味着以下签名大致是思考问题的方式：\n函数popCountx86(在uint64中)uint64//一次寄存器，64位(8字节)函数popCountNeon(在[16]字节中)[16]uint8//16字节全部并行计数。\n编写指令以使GO的汇编器对您给出的指令感到满意，这有点令人沮丧。\n在golang.org/pkg/cmd/Internal/obj/arm64上有一个很好的说明，它概述了许多不同之处。例如，所有向量指令都以V开头，不同于ARM64切换到的(它们过去通常在32位ARM上以V开头)-因此，虽然我理解连续性的愿望(甚至有点喜欢它，知道它是向量op)，但记住它与原始文档相比又有一些不同。\n但更令人沮丧的是，即使您的指令受支持(而且大多数指令都受支持)，知道如何在Go汇编程序中使用指令归结起来就是“假设数据从左到右，并希望测试套件中有一个示例”\n我是围棋的铁杆粉丝，但围棋进入第9计划的历史和附带的汇编器(相关地，还有奇怪的调用约定)是我对围棋的不满之一，甚至比缺乏泛型(这是改天再讨论的话题)更让我不满。当然，计划9中有一些好想法影响了围棋的设计-从设计层面来说，这很棒！-但在实现层面，我有点希望它遵循了精确度。在Intel VS GNU中，无论你想要什么，都可以。并忽略任何已经存在的文档。\n实际上，与其说它是一个分支，不如说它是一个扩展--它提供了相同的API，只是提供了针对ARM64芯片的手写汇编。\n向量对其部分结果求和(最多32个单独的向量，以适应8位计数)，试图避免数据依赖。\n另一件需要平衡的事情是从内存加载多少与优化吞吐量需要做多少工作。结果是一次大约是8个向量(128字节)，这可能会随CPU的不同而有所不同，但这是一个很好的起点。\n这纯粹是主观的，但在编写ARM64汇编时，有很多时候我感觉“嘿，那很方便”。当然，现代x86_64芯片解释了所有这些不同之处，并使它们具有出色的性能-通过更深的指令流水线或具有最终采用相同技巧的微操作指令队列。但同时，当您开始在指令级工作时，这是一种新鲜的空气。\n很多时候，当您处理一个数组时，您会将一大块内存放入寄存器，执行一些转换，然后将其放回原处。\n读取时将1字节*大小的结构加载到以下矢量寄存器中-到目前为止还不错，这类似于x86上的VMOVDQU指令族(尽管该指令的大小结构变体是最近添加的)。它具有通过地址/偏移量/大小计算在多个背靠背指令中加载多个寄存器的类似能力，但ARM有一个很好的一行程序。\n但我真的很喜欢R1在加载后按读取大小(64)自动递增-因此是后递增。许多来自内存的加载都有类似的标志。它具有很强的描述性，意思是“增加偏移寄存器和减小寄存器大小并测试”代码的相应部分，而不是以后再增加(并找到最佳时间)。\n这是历史遗留下来的，但是在尝试手工汇编指令时，具有固定大小指令的一致性是一件好事。当我发现并报告了围棋中的一个bug时，我不得不做一些手工组装。它默默地编写了错误版本的指令，同时接受正确的指令作为输入。向围棋社区致敬-专家在一两天内就修复了它，所以我期待着包含修复的下一个版本！\n尽管如此，这意味着只要有一只稳定的手和一份体系结构指南的副本，我就可以可行地实现任何缺失的指令。\n同样在一致性区域中，大多数二进制操作都使用input1_reg、input2_reg和output_reg，只有少数例外。省略output_reg是GO的汇编程序语法糖，用于将输出设置为input2。同样出于历史原因(试图保持指令较小)，x86通常将存储到第二寄存器作为操作的主要或唯一版本，这可能会导致更多的整体操作(以及认知开销IMO)。\n让我们来看看一些基准测试。关于人口计数，最有趣的是这个小例程做了一些有用的事情，显示了CPU、片上缓存和主存之间的CPU界限和内存带宽之间的权衡。当阵列大小小到足以装入CPU缓存(但大到足以运行计算循环几次)时，CPU是限制因素-它可以计算多少位。对于较大的数据大小，内存带宽成为界限；CPU正在等待获得足够的数据来处理。\n为此，存储库中的基准曲线最大吞吐量约为16K(大多数可能的工作，同时仍在缓存中)，然后随着内存的限制逐渐下降到稳定状态。因此，我将截断完整的基准，以比较峰值吞吐量和长尾。\n未优化(GO实施)：BenchmarkCountBytesGo/16K 297778 8056 ns/OP 2033.78 MB/s BenchmarkCountBytesGo/512M 8 279380432 ns/OP 1921.65 MB/s优化(我的手卷月份)：BenchmarkCountBytes/16K 520807 2303 ns/OP 7113.24 MB/s BenchmarkCountBytes/512M 8 131214574 ns/OP 4091.55 MB/s\n这是我在当地的PI上的成品。我可能可以做得更好，但在从内存中抓取和为popcount进行向量相加之间改变块大小的情况在这里达到了顶峰，所以我相当满意。\n有趣的是，大约4.1 GB/s的内存带宽与PI 4的初始读取基准完全一致，表明它接近饱和，这是个好消息。\n所以我的下一个想法是和我在Packet的老朋友一起启动一台ARM64服务器。他们有一只c2大手臂，一定会很棒的！\n未优化：BenchmarkCountBytesGo/16K 69939 17208 ns/OP 952.09 MB/s BenchmarkCountBytesGo/512M 2 582293709 ns/OP 921.99 MB/s优化：BenchmarkCountBytes/16K 458394 458394 2614 ns/OP 6267.80 MB/s BenchmarkCountBytes/512M 12 93371433 ns/OP 5749.84 MB/s。\n这不一定是Packet的错-他们很早就有ARM硬件可用，更重要的是，eMag只是一个有点老的芯片设计。在Google上搜索它们的相关基准测试显示出类似的特征，它是跨多个内核均匀分布的工作负载的一个相当好的芯片，但我主要是用这个基准测试单核吞吐量，它不是为此而构建的。\n未优化：BenchmarkCountBytesGo/16K 1000000 2281 ns/OP 7182.90 MB/s BenchmarkCountBytesGo/512M 31 76826628 ns/OP 6988.08 MB/s优化：BenchmarkCountBytes/16K 4199566 571ns/OP 28673.85 MB/s BenchmarkCountBytes/512M 85 27507419 ns/OP 19517.31 MB/s。\n哇。仅使用默认的Go实现，它就接近我优化的PI 4，但是使用真正的汇编程序，它完全是令人印象深刻的。\n我手头上最好的CPU可能是我的Haswell(E3-1231v3)文件服务器--当然它有点旧，但根据我之前的帖子，它至少是围棋世界中一个不错的基准：\n未优化：BenchmarkCountBytesGo/16K 893949 1330 ns/OP 12316.43 MB/s BenchmarkCountBytesGo/512M 21 53529366 ns/OP 10029.47 MB/s优化：BenchmarkCountBytes/16K 2068282 574 ns/OP 28524.35 MB/s BenchmarkCountBytes/512M 28 40770214 ns/OP 13168.21 MB/s。\n我们可以看到Go针对uint64的内置优化所产生的效果，因为它更接近@tmthrog的手滚汇编。显然，使用这个库还是更好，但至少在优化Go标准库的数学/位包方面已经做了一些工作。\n尽管如此，哈斯韦尔在这次测试中的表现与Graviton2大致相当，只是较新的芯片似乎有更好的内存带宽。这绝对让我想要玩更大的ARM硬件，我更愿意相信亚马逊的单位成本性能论据是有道理的。\n为了好玩，让我们在AWS上尝试更现代的内核(至强白金8175M CPU@2.50 GHz)，将其与以下各项进行比较：\n未优化：BenchmarkCountBytesGo/16K 795211 47282854 ns/op 10855.33 MB/s BenchmarkCountBytesGo/512M 18 64222468 ns/op 8359.55 MB/s优化：BenchmarkCountBytes/16K 1783059 673ns/op 24344.22 MB/s BenchmarkCountBytes/512M 24 1509 ns/op 11354.45 MB/s。\n&amp；mldr我想我有点失望，但它跟踪的是cpuBenchmark.net上的单核心基准测试。事实上，该列表或多或少总结了此特定情况下的单核Xeon世界。\n如果采用新的Graviton2处理器，ARM64的潜力真的给我留下了深刻的印象。此外，PI 4 8 GB已经成为一个非常有趣的小电路板，因为它有足够的RAM来拥有合理的页面缓存。\n在arxiv上有一篇整洁的文章，介绍了使用AVX2指令(大约是Haswell或更新的CPU，同样适用于GO)进行更快的人口计数实现。既然这些指令都是可用的，那么可能值得对更多的x86_64GO汇编进行基准测试才能使用它。\n与前面提到的AVX-512中的新指令类似；如果它们变得更加常见，那么对它们进行基准测试将是一件很有趣的事情。\n如果我每打一次ARM64和AMD64就有五分钱。尽管它们是Go(和Debian)的体系结构绰号，但我更喜欢GNU三元组形式的aarch64和x86_64(为了清楚起见，我在本文的其余部分使用后者)。↩︎。\n这在AVX-512中得到了升级，AVX-512是x86_64环境中的新热点，但这些芯片非常昂贵，而且只有少数芯片真正实现了这一点。↩︎", "note_en": "Apropos of Apple’s ARM announcment, I thought I might write up a post on a recent bit of code I wrote that specifically looks at ARM64, and its benchmarks on various hardware.\n I’ve been implementing some compact data structures for a project. One of the CPU hotspots for the implementation is the need to run a quick population count across a potentially large bit of memory.\n If you’ve never seen population count before, it’s the count of the number of set 1 bits in a byte (or list of bytes) – for example:\n  Now, every reasonable x86_64/amd64  1 CPU in the past decade or so has a built-in instruction for this:   POPCNT. It works like this (in Go Assembler):\n  Go uses the built-in instruction for this in the  math/bits via SSA compiler rewrites (which it added in 1.9), but only up to a uint64 at a time; using assembly to loop over a  []byte is considerably more efficient\n @tmthrgd created a really nice little x86_64-assembly-optimized package at  github.com/tmthrgd/go-popcount. It works great, works around a weird little Intel bug (see the helpful comments) and is still faster than looping and using the Go standard library, which it helpfully benchmarks as well.\n Recently, I picked up one of the new 8GB Raspberry Pi 4s. Loaded it up with the nice new  Manjaro 20.06 and set up my usual environment. As a test, I wanted to try my latest WIP data structure code.Of course, the bottleneck was right where I expected it to be: in the population count.\n  I discovered that ARM64 has a  POPCNT-like instruction, logically enough called  CNT. I thought, since I’ve been playing with Go assembly for memmove, why not try my hand at the new architecture?\n Go already has the SSA-rewrite for OnesCount on ARM (added in 1.11), but again, only a uint64 at a time. There might be some performance on the table.\n Official architecture guide at the ready, I got to work. And there was a lot to learn. Some notes:\n  NEON is the name for the addition of vector instructions to the ARM architecture, so I’d be working with both an unfamiliar architecture  and its vector instructions.\n In x86-land,  POPCNT and vectorization are two separate concepts.  POPCNT, as an instruction, deals with everyday, 64-bit integer registers, and not the vector registers (even though it appeared approximately the same time as the addition to vector instructions, SSE4)  2.\n ARM/NEON did  CNT differently. Since you can load an array of items (say, 16 bytes, in the ARM64 vector registers),  CNT will count them individually. In fact, you can  only do it in vectors of single bytes.\n So this means that the following signatures are approximately the way to think about it:\n func  popCountx86 ( in  uint64 )  uint64  // register-at-a-time, 64-bit (8 bytes)  func  popCountNeon ( in  [ 16 ] byte )  [ 16 ] uint8  // 16 bytes all counted in parallel.\n   Writing instructions so that Go’s assembler is happy with the instructions you’re giving it is a bit frustrating.\n There’s a good gloss at  golang.org/pkg/cmd/internal/obj/arm64 which gives an overview of many of the differences.For example, all vector instructions start with  V, different than what ARM64 switched to (they used to commonly start with V on 32-bit ARM) – so while I understand the desire for continuity (and even subtly like it, knowing it’s a vector op) it’s just makes another little difference to remember vs. the original documentation.\n But more frustrating is, even if your instruction is supported (and most of them are) knowing how to  use the instruction in Go assembler boils down to “assume data goes left-to-right and hope there’s an example  in the test suite”\n I’m a big Go fan, yet Go’s history into Plan 9 and accompanying assembler (and, relatedly, odd calling conventions) is one of my gripes about Go, even more than lack of generics (which is a topic for another day).Sure, there were some good ideas in Plan 9 that influenced the design of Go – from a design level, it’s great! – but on the implementation level, this is one place where I kinda wish it had followed precident.Take whichever side you want in the Intel vs GNU syntax debate,  creating a third option means relearning all the quirks from scratch, and ignoring any documentation that already exists.\n   Really, it’s more of an extension than a fork – it provides the same API, just with handwritten assembly for ARM64 chips.\n   Vector sum their partial results (up to 32 individual vectors, to fit the 8-bit counts), trying to avoid a data dependency\n The other thing to balance was how much to load from memory vs. how much work to do to optimize throughput. That ended up being about 8 vectors (128 bytes) at a time.That may vary as a function of CPU, but it’s a good place to start.\n  This is purely subjective, but there were a number of moments where I felt “hey, that’s handy” in writing ARM64 assembly.Of course modern x86_64 chips account for all of these differences and makes them performant – through deeper instruction pipelines or having  micro-op instruction queues that ultimately pull the same tricks.But at the same time, when you’re dropping down to work at the instruction level, it’s kind of a breath of fresh air.\n  A lot of the time when you’re working with an array of whatever you’re pulling a chunk of memory into registers, doing some transform, and putting it back.\n  Reads as load 1-byte*size structures into the following vector registers – so far so good, this is similar to the   VMOVDQU instruction family (though the size-structure variants on that instruction are a recent addition) on x86. It has a similar ability to load many registers in multiple back-to-back instructions through address/offset/size calculation, but ARM has a nice one-liner that way.\n But I really like the auto-increment of  R1 by the read size (64) after loading – hence post-increment. Many loads from memory have a similar flag. It’s very descriptive and means things like “increment the offset register and decrement the size register and test” things live with their appropriate parts of the code, instead of having to increment later (and finding the optimal time)\n  This is a holdover from history, but the consistency of having fixed-size instructions is a nice thing when trying to hand-assemble an instruction. I had to do some hand-assembly when  I discovered and reported a bug in Go. It was silently writing the wrong version of the instruction while accepting the correct one as input. Kudos to the Go community – it was fixed by an expert within a day or two, so I’m looking forward to the next version that contains the fix!\n Still, this meant with a  steady hand and a copy of  the architecture guide I could feasibly implement any instructions that were missing.\n Also in consistency-land, most binary operations take  input1_reg, input2_reg, output_reg with few exceptions. Omitting the output_reg is Go’s assembler syntactic sugar to set output to input2. x86, again for historical reasons (trying to keep instructions small), often has the store-to-the-second-register as the primary or only version of an operation, which can lead to more operations overall (and cognitive overhead IMO).\n  So let’s take a look at some benchmarks.The most interesting thing about looking at population count is that this little routine does something useful and shows tradeoffs between CPU bounds and memory bandwith between the CPU, the on-chip caches, and main memory.At array sizes small enough to fit into CPU cache (but big enough to run the compute loop a few times), the CPU is the limiting factor – how many bits it can count.For larger data sizes, the memory bandwidth becomes the bound; the CPU is waiting on getting enough data to crunch through.\n To this end, the benchmark curves in the repository max out in throughput at about 16K (most work possible, while still being in cache) and then trail down into a steady state as memory becomes the bound. So I’ll truncate the full benchmarks to compare peak throughput and long tail.\n   Unoptimized (Go implementation):BenchmarkCountBytesGo/16K 297778 8056 ns/op 2033.78 MB/sBenchmarkCountBytesGo/512M 8 279380432 ns/op 1921.65 MB/sOptimized (My hand-rolled assember):BenchmarkCountBytes/16K 520807 2303 ns/op 7113.24 MB/sBenchmarkCountBytes/512M 8 131214574 ns/op 4091.55 MB/s\n This was my finished product on my local Pi. I may be able to do better, but varying the block sizes between grabbing from memory and doing the vector addition for popcount topped out about here, so I’m fairly satisfied.\n Interestingly, the ~4.1GB/s memory bandwidth follows exactly with  initial read benchmarks of the Pi 4 suggesting it’s close to saturation, which is good news.\n  So my next thought was to spin up an ARM64 server with my old friends at  Packet. They have a  c2.large.arm and it’s gonna be great!\n Unoptimized:BenchmarkCountBytesGo/16K \t 69939\t 17208 ns/op\t 952.09 MB/sBenchmarkCountBytesGo/512M \t 2\t 582293709 ns/op\t 921.99 MB/sOptimized:BenchmarkCountBytes/16K \t 458394\t 2614 ns/op\t6267.80 MB/sBenchmarkCountBytes/512M \t 12\t 93371433 ns/op\t5749.84 MB/s\n  This isn’t necessarily Packet’s fault – they were early onto having ARM hardware available and it’s more that the eMag is just a somewhat older chip design. Related benchmarks upon Googling for them show similar characteristics.It’s a fairly good chip on evenly distributed workloads across many cores, but I’m mostly testing single-core throughput with this benchmark, which it’s not built for as much.\n   Unoptimized:BenchmarkCountBytesGo/16K 1000000 2281 ns/op 7182.90 MB/sBenchmarkCountBytesGo/512M 31 76826628 ns/op 6988.08 MB/sOptimized:BenchmarkCountBytes/16K 4199566 571 ns/op 28673.85 MB/sBenchmarkCountBytes/512M 85 27507419 ns/op 19517.31 MB/s\n Wow. With just the default Go implementation it’s close to my optimized Pi 4, but with the real assembler it’s downright impressive.\n   My best CPU on hand is probably my Haswell (E3-1231v3) fileserver – sure it’s a little old but it’s at least a  decent baseline in the Go world, given my previous post:\n Unoptimized:BenchmarkCountBytesGo/16K 893949 1330 ns/op 12316.43 MB/sBenchmarkCountBytesGo/512M 21 53529366 ns/op 10029.47 MB/sOptimized:BenchmarkCountBytes/16K 2068282 574 ns/op 28524.35 MB/sBenchmarkCountBytes/512M 28 40770214 ns/op 13168.21 MB/s\n We can see the effect that Go’s built-in optimization for  uint64 has, in that it’s closer to the hand-rolled assembly from  @tmthrgd.It’s still clearly better to use the library, but at least some work has gone into optimizing the  math/bits package of Go’s standard library.\n Nonetheless, the Haswell does roughly as well as the Graviton2 on this test, except the newer chip has seemingly better memory bandwidth. Definitely makes me want to play with bigger ARM hardware.I’m more willing to believe that there’s something to the performance per unit cost argument from Amazon.\n  For fun, let’s try a more modern core (Xeon Platinum 8175M CPU @ 2.50GHz) on AWS to compare that to:\n Unoptimized:BenchmarkCountBytesGo/16K 795211 1509 ns/op 10855.33 MB/sBenchmarkCountBytesGo/512M 18 64222468 ns/op 8359.55 MB/sOptimized:BenchmarkCountBytes/16K 1783059 673 ns/op 24344.22 MB/sBenchmarkCountBytes/512M 24 47282854 ns/op 11354.45 MB/s\n &amp;mldrI guess I’m slightly disappointed, but it tracks with the single-core benchmarks on  cpubenchmark.net. In fact, that list more-or-less sums up the single-core Xeon world for this particular case.\n  I’m really impressed with the potential for ARM64 if the new Graviton2 processors are where it’s going. That, and the Pi 4 8GB has been a really fun little board, now that it has enough RAM to have a reasonable page cache.\n There’s a  neat paper on the arXiv with a faster population count implementation of using AVX2 instructions (so, approximately Haswell or newer CPUs, which again works for Go). Since those instructions are available, it may be worth benchmarking some more x86_64 Go assembly to use it.\n Similarly with the aforementioned new instructions in AVX-512; it’d be fun to benchmark them if they become more commonplace.\n If I had a nickel for every time I typoed  arm64 and  amd64. Even though they’re the architecture monikers for Go (and Debian), I prefer the GNU triplet forms of  aarch64 and  x86_64 (the latter I use in the rest of the post for clarity).  ↩︎\n This is getting an upgrade in  AVX-512, which is the new hotness on the x86_64 landscape, but those chips are very expensive and only a handful of them acutally implement this yet.  ↩︎", "posttime": "2020-07-14 22:26:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "汇编,popcount,指令", "title": "Golang中的ARM64 Popcount及其汇编器", "title_en": "ARM64 Popcount in Golang and Assembler", "transed": 1, "url": "https://barakmich.dev/posts/popcnt-arm64-go-asm/", "via": "", "real_tags": ["汇编", "popcount", "指令"]}, {"category": "", "categoryclass": "", "imagename": "0a6713cf037df64b82af04fba58a835d.png", "infoid": 1011752, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流式系统不同步地消耗输入和产生输出：系统在任何时刻的输出可能不会反映到目前为止看到的所有输入。这些系统提供了关于其输出如何与其输入相关的各种保证。在较弱的(但不是不受欢迎的)保证中，就是最终的一致性。非正式地说，最终一致性意味着如果输入停止更改，输出将最终得到正确的结果。\n在这篇文章中，我们将看到，只要它的输入流没有停止，自然的最终一致的计算就会产生无限大的系统错误。如果您正在进行哪怕是微不足道的计算，您应该准备好让您的结果永远不一致(这是一种不太流行的一致性定义)。至少在您暂停输入流并等待正确答案之前。\n并不是所有的东西都输了！有提供强大一致性保证的流处理系统。物化和差分数据流都通过提供始终正确的答案来避免这些类别的错误，其他几个流系统也是如此。\n如果您希望在结果中避免系统错误和持续错误，您可能应该检查您使用的流处理器是否提供更强的一致性保证。\n最终一致性是分布式计算中用来实现高可用性的一致性模型，它非正式地保证，如果没有对给定数据项进行新的更新，则最终对该数据项的所有访问都将返回上次更新的值。\n最常为键值存储调用最终一致性，其中每个键跟踪一个独立值，可以合理地想象不更新与键相关联的值的时间足够长，以至于可能会得出正确的答案。例如，如果数据库存储了从人们到他们地址的映射，您对您自己地址的更新可能不会立即可见，但是如果您给它几分钟时间，它可能会自动整理出来(如果您不进一步更新您的地址)。\n要求只是人们停止更新特定的键，而不是完全停止使用数据库。世界上的其他地方可以一直读出地址，甚至可以一直读出您的陈旧地址，最终一致的系统必须最终更新您的地址(假设您不会一直重新提交更新)。最终一致性是键值存储的一致性的可行定义，其中绝大多数操作不冲突，可以合理地期待等待任何不一致。\n外面有很多流计算。我将把重点放在一个与我们的一致性研究非常一致的课程上：增量视图维护。增量视图维护是指您定义了视图(本质上是绑定到查询的名称)，并希望看到输出答案随着输入数据的更改而更改。\n假设您定义了一个可以应用于静态数据集的查询，如下所示。\n现在，底层数据可能会发生变化。当他们这样做时，我们应该对输出进行相应的更改。在本例中，我们希望看到数据中的记录计数发生了怎样的变化。\n我们可能会编写更复杂的查询。例如，此查询确定其值在所有键中最大的键集：\n随着数据的更改，我们希望看到生成的关键点集跟踪最大值。\n下一个查询确定每个键的值的标准差，然后选择那些大得出奇的值。\n随着数据的移动，当前的离群值集合也会移动，我们将很高兴被警告它们，这样我们就可以采取一些重要的行动。\n对于这些查询是否是令人兴奋的计算，我没有强烈的看法，但我们将使用它们作为流计算的示例，这些流计算可能会出现令人惊讶的错误。如果您的计算比这些示例更复杂，您可能会有更多需要担心的问题。\n不是很清楚，是吗？即使我们写入的是明确的键，我们希望正确的是所有这些键的聚合，而不是与特定键相关联的值。这个结果取决于所有的价值观。我们仍然可以推断出最终一致性的定义，这意味着如果输入完全停止更改，系统最终将更新为正确的数据记录计数。\n虽然您不应该期望在野外看到这种情况，但是只要有任何未处理的输入记录尚未处理，最终一致的流系统肯定可以延迟其处理。\n这实际上并不像你想象的那样不合理。许多流处理器故意分批输入以提高效率，并且只有在输入流中获得片刻新鲜空气后才开始工作。此技术允许他们通过批处理和重新排序更新(例如，将所有更新捆绑到同一键)，在负载高峰期间提高吞吐量。看到更新无序是很自然的，但最极端的情况是，这种技术的结果是在负载高峰期间没有更新。\n虽然这不一定是您在专业流处理器中会看到的，但最终一致性并不会阻止这样的行为。因此，虽然这不是担心最终一致性的最现实的原因，但它描绘了一幅关于我们可能需要注意的东西的图景。\n让我们忽略这样一种可能性，即技术上正确的最终一致的处理器可能不会产生任何结果，相反，让我们来看看在不断变化的输入流上，对于更合理的系统会发生什么。\n这就是在SQL中表示“argmax”的方式，它大致相当于集合data和select max(data.value)from data之间的连接。\n一个通情达理的人可能会期望在这里看到具有最大值的密钥，并让最终一致的系统最终向其显示一些最大密钥。有些摸不着头脑，你可能会回到“任何钥匙”，因为在你看到它们的那一刻，它们可能不再是最大的。但最终我们应该会看到一些钥匙，对吧？\n假设data和select max(data.value)from data之间的连接接收到其最终一致的数据输入晚于select max(data.value)from data。这不是不合理的，因为维护最大值可能比维护整个集合(数据)更容易。随着每条数据记录的到达，即使是那些在提交时具有最大值的记录也可能会发现，最大值在到达之前就已经前进了。它们不再与最大值匹配，并且不会作为输出生成。\n让我们在差分数据流中演示这一点。我们将不得不伪装一些东西，因为不幸的是，它的一致性保证太强了。幸运的是，我们可以直接将瞬时延迟编程到数据流中。\n设想一个集合中可能有多个键，但我们只需要一个键。我们将定期增加与密钥关联的值(可能是使用的带宽、花费的资金、最近的访问或…)。。重要的是，我们将通过更新之间的时间间隔沿一条路径延迟更新。\n我们将添加向数据添加元素的更改，一次一个。大致是这样的。\n关键字和值并不重要，除了最大值增加之外。如果最大值在与一致性的“最终”性质相关的延迟时间内增加，则我们看不到任何结果：\n可以说，我们没有看到任何重要报告。如果我们停止输入流，并允许连接的一个输入赶上另一个，我们最终会这样做。\n如果我们延迟最大计算而不是数据流，会发生什么？如果更新覆盖了它们之前的值(即IF(key，2000)覆盖(key，1000))，那么我们也看不到任何输出，因为在最大值到达时，值已经改变。\n最终的一致性非常适合于对齐数据的问题，因为这两个数据流中的任何一个的内容都可能会继续移动。在我们的例子中，最大值是有规律地向前推进的，因此当延迟的数据想要查找它时找不到它。或者，最大值经常落后，并且再也找不到产生它的值。也许你会很幸运，而且永远都不会是！\n让我们用我能想到的最简单的“统计”例子来做第三次挥杆。在本例中，我们将确定平均值和标准偏差，并查找偏离平均值几个以上的记录。\n标准差是方差的平方根，方差是与平均值的平方距离的平均值。\n随着数据的变化，平均值也会发生变化，如果必须返回到所有以前的数据来更新与平均值的平方距离，这将是一件烦人的事情。幸运的是，有一种聪明的方法来维护数字流的方差，即使用不同的方差公式：\n这两个平均值都可以递增地维护(通过计数和)。这在理论上似乎很好，模一些数值稳定性问题确实运行得相对较好(我们目前在Materialize中使用它)。\n但是…。如果聚合不完全同步，会发生什么情况？为了让您体验一下我们即将到来的那种焦虑，请记住方差应该始终是非负的。我们可以确认这一点，因为它的差异项有一个有界的关系：\n平均平方总是至少是平方平均值。这确保了方差始终为非负值。\n如果沿着不总是一致的数据流路径计算这两个和，则第二项可能大于第一项，并且方差可能明显变为负值。如果你取平方根，…。显然，这不起作用(相关问题：您的流处理器是否能正确地从异常中恢复？)。\n但是假设方差实际上并没有变成负值，它只是以令人惊讶的小而告终。我们上面的查询Recall，拉出了比它们应该在的位置多个标准差的记录。如果偏差接近于零，那可能是所有人都高于平均水平。或者，因为平均值暂时很大，也许每个人都超过了这个数字。谁知道呢？\n这是流媒体最终一致性的痛点之一：谁知道呢？\n如果你想使用上面的信息来做决定，它可能经常是错误的。比方说，您想要等待它正确；您要等待多长时间？如果您想要将一项购买标记为有风险，或者想要接受看似出人意料的优惠，或者想要执行一些其他具有后果的低延迟操作，请使用…。你怎么做到的？您必须在您的“低延迟”系统中内置多长时间才能解决暂时性错误？\n在这一点上，有点担心不一致是合理的。如果您的数据并不总是一致，您可以进行一些自然烟雾测试。我想我应该通过它们中的一个来交谈，即使没有其他原因，也只是为了炫耀一些工作正常的东西。\n我们经常通过计算集合中每个值的出现次数，将大型集合细化为直方图。我收集了一批纽约市的出租车，记录了每一次的乘车情况，包括乘客数量、车费金额和路程等信息。我们可以合理地对我们看到每对(乘客数、票价)对、或每对(乘客数、距离)或每对(票价、距离)的次数感兴趣。\n这些直方图中的每一个都可能是独立有趣的；我们可以计算每对的结果，或者跟踪不同对的数量，或者跟踪计数最大的对。我们可以尝试并确定这三个属性中的任何一个都显示出它们的属性对之间的相关性。\n这些直方图中的每一个还在其保留的各个属性上定义直方图。Histogram1和Histogram2都告诉我们每个乘客有多少人。Histogram1和Histogram3都告诉我们每笔车费支付的频率。历史图表2和历史图表3都告诉我们旅行距离的分布。\n我们可以将监视器连接到每个错误流，并在出现单个记录时大声抱怨。差异数据流有一个Assert_Empty()方法，它就是这样做的。如果在这些Errors_*集合上运行它，它不会生成这样的报告，因为差异数据流甚至没有瞬时不一致。\n最终一致性对于键值存储可能有一定意义，但对于具有低延迟要求的计算似乎没有太大意义。如果您的流处理器只提供最终的一致性保证，那么您应该认真考虑一下您实际希望它为您做些什么。\n也就是说，像Noria这样的系统针对维护视图的键控查找，您可能会合理地期望停止更新影响查询结果的记录。这些系统可能会为“分析性”查询提供令人惊讶的结果，但是如果您不打算这样做(或者可以吸收这种复杂性)，那么它们的一致性保证对您来说可能没什么问题。\n最终，一致性保证归根结底取决于系统计划为您提供多少保证，以及在它和用例之间需要做多少额外的工作。在Materialize，我们打赌你们中的大多数人不想成为一致性专家，也不想要令人惊讶的错误结果。\n如果您对不断变化的数据的一致SQL视图感兴趣，请立即查看物化，在下面注册以刺激重复出现的电子邮件内容，查看文档，或者只是匆忙从我们的存储库中抓取代码本身的副本并开始尝试！", "note_en": "Streaming systems consume inputs and produce outputs asyncronously: the output of a system at any moment may not reflect all of the inputs seen so far. These systems provide various guarantees about how their outputs relate to their input. Among the weaker (but not unpopular) guarantees is  eventual consistency. Informally, eventual consistency means if the input stops changing, the output will eventually arrive at the correct result.\n In this post we’ll see that for as long as its input streams haven’t been stopped, natural eventually consistent computations can produce  unboundedly large and systematic errors. If you are doing even slightly non-trivial computations, you should be prepared for your results to be  never-consistent (a much less popular consistency definition). Until you pause the input streams and await correct answers, at least.\n Not all is lost! There are stream processing systems that provide strong consistency guarantees.  Materialize and  Differential Dataflow both avoid these classes of errors by providing  always correct answers, as do several other streaming systems.\n If you want to avoid systematic and on-going errors in your results, you should probably check if the stream processor you use provides stronger consistency guarantees.\n   Eventual consistency is a consistency model used in distributed computing to achieve high availability that informally guarantees that, if no new updates are made to a given data item, eventually all accesses to that item will return the last updated value.\n Eventual consistency is most often invoked for key-value stores, where each key tracks an independent value and one can reasonably imagine not updating the value associated with a key for long enough that the right answer might shake out. For example, if a database stores a map from people to their addresses, your update to your own address might not be visible immediately, but if you give it a few minutes it will probably sort itself out (if you don’t further update your address).\n The requirement is only that folks stop updating a specific key, not that they stop using the database entirely. The rest of the world can keep reading out addresses, even keep reading out your stale address, and an eventually consistent system is obliged to eventually update your address (assuming you don’t keep re-submitting updates). Eventual consistency is a workable definition of consistency for key-value stores, where the vast majority of operations do not conflict, and one can reasonably expect to wait out any inconsistency.\n   There are many streaming computations out there. I’m going to focus on a class that lines up well with our study of consistency: incremental view maintenance. Incremental view maintenance is where you’ve defined a view, essentially a name bound to a query, and want to see the output answers change as the input data change.\n Let’s say you’ve defined a query that could be applied to a static dataset, something like\n  Now, the underlying  data might change. As they do, we should produce the corresponding changes to the output. In this case, we would like to see how the  count of the records in  data have changed.\n There are more complicated queries we might write. For example, this query determines the set of keys whose values are the largest among all keys:\n  As  data change, we would like to see the resulting set of keys track the maximum values\n This next query determines the standard deviation of values for each key, and then selects out those values that are surprisingly large.\n  As  data move around, the set of current outliers moves around too, and we would be delighted to be warned of them so that we can take some important action.\n I don’t have strong opinions about whether these are exciting queries to compute, but we’ll use them as examples of streaming computations that can go surprisingly wrong. If your computations are more sophisticated than these examples, you might have even more to worry about.\n    It’s not really clear, is it? Even if there were clear keys we are writing to, the thing we want to be correct is an aggregation across all of them rather than the value associated with a specific key. That result depends on all values. We could still extrapolate the definition of eventual consistency out to mean that if the input stops changing entirely, the system will eventually update to the correct count of records in  data.\n Although you shouldn’t expect to see this in the wild, an eventually consistent streaming system is certainly permitted to delay its processing as long as there are any outstanding input records that haven’t been processed yet.\n This is actually not as unreasonable as you might think. Many stream processors intentionally batch up their inputs to improve their efficiency, and get started only once they get a moment of fresh air in their input stream. This technique allows them to improve their throughput during load spikes, by batching and re-ordering updates (for example, bundling all updates to the same key). It would be natural to see updates out of order, but taken to the extreme this technique results is no updates during the load spike.\n While this is not necessarily something you’ll see in a professional stream processor, nothing about eventual consistency prevents behavior like this. So, while it’s not the most realistic reason to be worried about eventual consistency, it paints a bit of a picture about what we might need to watch out for.\n Let’s ignore the possibility that a technically correct eventually consistent processor could produce no results, and instead look at what happens for more reasonable systems on continually changing input streams.\n    This is how you express “argmax” in SQL, and it is roughly equivalent to a join between the collections  data and  select max(data.value) from data.\n A reasonable person might expect to see the keys with maximum values here, and have an eventually consistent system eventually show it some maximal keys. Some head scratching and you might walk that back to “any keys at all” because they might no longer be maximal at the moment you see them. But  eventually we should see  some keys, right?\n   Imagine the join between  data and  select max(data.value) from data receives its eventually consistent inputs consistently later for  data than for  select max(data.value) from data. This is not unreasonable, as it can be easier to maintain a  max than to maintain an entire collection ( data). As each record of  data arrives, even those records with maximal values at the time of their submission may find that the maximum has advanced before they got there. They no longer match the maximum value, and are not produced as output.\n Let’s demonstrate this in  Differential Dataflow. We’ll have to fake some things out, because its consistency guarantees are unfortunately too strong. Fortunately, we can directly program transient delays in to the dataflow.\n Imagine a collection that may have multiple keys in it, but we’ll only need one. We’ll increment the value associated with the key regularly (perhaps this is bandwidth used, or money spent, or most recent access, or …). Importantly, we’ll delay the update along one path by the gap in time between updates.\n  We’ll feed in changes that add elements to  data, one at a time. Roughly like so\n  The keys and values aren’t important, other than that the maximum increases. If the maximum increases within the time of the delay associated with the “eventual” nature of the consistency, we see no results:\n  Suffice it to say we didn’t see any  KEY reports. We would, eventually, if we were to stall the input stream and allow one of the inputs to the join to catch up to the other.\n What happens if we  delay the  max computation instead of the  data stream? If the updates overwrite their previous values ( i.e. if  (key, 2000) overwrites  (key, 1000)) then we also see no outputs, because by the time the maximum arrives the value has changed.\n Eventual consistency is pretty badly suited to problem of aligning data, when the contents of either of those streams of data can be expected to move on. In our case, the maximum is regularly advancing, and consequently not found when delayed data want to look for it. Alternately, the maximum is regularly behind, and can no longer find the values that produced it. Maybe you’ll be lucky and it will always be neither!\n  Let’s take a third swing using the simplest “statistical” example I could think up. In this example, we’ll determine the average and the  standard deviation, and look for records that are more than a few deviations away from the the average.\n  The standard deviation is the square root of the  variance, which is the average of the squared distances from the average.\n As data change the average changes, and it would be annoying to have to return to all of your prior data to update the the squared distance from the average. Fortunately, there is a clever way to  maintain the variance of a stream of numbers, by using a different formula for the variance:\n  These two averages can each be maintained incrementally (by a count and a sum). This seems great on paper, and modulo  some numerical stability issues does work out relatively well (we currently use it in Materialize).\n But … what happens if the aggregates are not exactly in sync? To give you a taste of the sort of anxiety we’ll soon be rolling in, recall that the variance should always be non-negative. We can confirm this because its terms in difference have a bounded relationship:\n  The average square is always at least the squared average. This ensures that the variance is always non-negative.\n  If these two sums are computed along dataflow paths that are not always consistent, the second term can be larger than the first, and the variance can apparently go negative. If you take the square root, … well obviously that doesn’t work (relevant question: does your stream processor correctly recover from exceptions?) .\n But let’s say that the variance doesn’t actually go negative and it just ends up surprisingly small. Our query up above, recall, pulls out records that are multiple standard deviations from where they should be. If the deviation is nearly zero, that could be everyone above average. Or, because the average is transiently large, perhaps everyone above that. Who even knows?\n And that is one of the pain points for eventual consistency in streaming: who even knows?\n If you wanted to use the information above to make decisions, it could often be wrong. Let’s say you want to wait for it to be correct; how long do you wait? If you want to flag a purchase as risky, or bite at an offer that seems surprisingly good, or perform some other low-latency action that has consequences … how do you do that? How much time do you have to build in to your “low latency” system to account for transient wrongness?\n   It’s reasonable at this point to worry a bit about inconsistency. There are some natural smoke tests you can do to see if your data are not always consistent. I thought I’d talk through one of them, if for no other reason than to show off something working correctly.\n We often distill large collections down to  histograms by counting the number of occurrences of each value in the collection. I have a collection of NYC taxi rides which record each ride with information like the passenger count, fare amount, and distance. We could reasonably be interested in the number of times we see each (passenger count, fare amount) pair, or each (passenger count, distance) pair, or each (fare amount, distance pair).\n  Each of these histograms could be independently interesting; we could count the results for each pair, or track the number of distinct pairs, or track the pair with the largest count. We could try and determine any of the three exhibit a correlation between their pair of attributes.\n Each of these histograms also define a histogram over the individual attributes it has retained. Both  histogram1 and  histogram2 tell us how many of each passenger count there are. Both  histogram1 and  histogram3 tell us how often each fare is paid. Both  histogram2 and  histogram3 tell us the distribution of distances of trips.\n   We can attach monitors to each of the  error streams and complain loudly if there is ever a single record present. Differential dataflow has a method   assert_empty() that does exactly this. If you run it on these  errors_* collections it produces no such reports, as differential dataflow doesn’t have even transient inconsistencies.\n  Eventual consistency may make some sense for key-value stores, but it doesn’t seem to make much sense for  computations that have  low-latency requirements. If your stream processor only provides eventual consistency guarantees, you should have a very serious think about what you actual expect it to do for you.\n That being said, there are systems like  Noria that target keyed look-ups for maintained views, for which you might reasonably expect updates to cease for the records that influence your query results. These systems may give surprising results for “analytic” queries, but if you aren’t planning on doing that (or can absorb that complexity) then their consistency guarantees might be fine for you.\n Ultimately, consistency guarantees come down to how much the system is planning on guaranteeing for you, and how much additional work you’ll need to do between it and your use case. At Materialize we’re betting that most of you don’t want to become consistency experts, and don’t want surprisingly incorrect results.\n If you are interested in consistent SQL views of your continually changing data,  check out Materialize now, sign up below for stimulating recurring email content, check out  the documentation, or just rush over and grab a copy of  the code itself from our repository and start trying it out!", "posttime": "2020-07-14 22:25:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流式,consistency,可能", "title": "最终的一致性不适用于流式传输", "title_en": "Eventual Consistency isn’t for Streaming", "transed": 1, "url": "https://materialize.io/eventual-consistency-isnt-for-streaming/", "via": "", "real_tags": ["流式", "可能"]}, {"category": "", "categoryclass": "", "imagename": "bb1b5441c41c6e51947d4b9ae06b67b6.jpg", "infoid": 1011751, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就像发条一样，我的某些朋友在大型视频游戏即将上线时会发短信或即时通讯。他们认识的人中，我就是那种能在公众面前玩到像“粉碎传奇”(New Smash Bros.)或“半条命”(Half-Life)这样的游戏的人，他们喜欢用这样的问题把我的禁令推到极限，比如它是否符合炒作的要求？或者没有剧透：我应该买吗？\n随着对马的幽灵，很可能是索尼PS4的最后一款主要的第一方游戏，在过去的几周里，我收到了数量惊人的这样的问题。你可能会说它们很令人惊讶，因为对马是一个全新的游戏系列，而不是人们热切期待的续集。但惊喜是以不同的形式出现的，因为我所有的朋友都突然冒出来问我同样的问题：这款索尼的新游戏有希望吗？\nPS4的粉丝们可能还在为这款游戏机的最后一款主要独家游戏-6月推出的残酷的“最后的我们”第二部分-而感到头晕目眩，这款游戏围绕着全球大流行后的生物和社会破坏展开。TLOU2是一款勇敢、富有挑战性和引人入胜的游戏，但我收集到的共识是，人们现在渴望一种不同的冒险。\n所以我现在开始我对对马幽灵的评论，大声而坚定地说，是的，这个游戏在所有最好的方面都是有希望的。Sly Cooper等系列的制作商Sly Cooper和臭名昭著的Sucker Punch最新推出的冒险游戏，不知从哪里冒出来，让我大吃一惊。我感到震惊的部分原因是，当这款游戏的游戏性在4月份被披露时，我几乎把它写成了刺客信条的克隆。你不会因为做同样的事而被指责；我们现在已经进入开放世界冒险潮流大约400年了，而这些游戏肯定是模糊在一起的。\n不过，这里没有模糊之处。对马脱颖而出有很多原因，也许最关键的原因是它做了一件自圣安德烈斯侠盗猎车手以来我在这一类型中从未见过的事情：它牢牢地钉住了玩家、主角和配角之间建立世界的关系。作为这项运动的英雄，我很少在努力给我的家庭和国家带来荣誉的同时失去使命感或地位。当他交朋友、结成联盟、沉思损失或面对悲剧时，我陪着他走过的每一步，这种感觉都得益于步伐敏捷的新武士超级大国的涌现。\n对马的幽灵决不是一款完美的游戏，但它抓住了重要的东西：它30小时的任务会让你感觉自己像一个关于复仇、原则和内心平静的故事的明星。\n在我们开始玩这个游戏之前，我们应该先从它的外观开始，因为，天哪：\n看到那个画廊有多多姿多彩了吗？如果我告诉你，上面所有的图片都是从游戏的前12个小时拍摄的，在最后的游戏中，还有更漂亮的东西等着你，会怎么样？\n整个游戏充满了值得抓屏的时刻，这可能就是为什么GET为照片工具专门设计了一个d-pad按钮，而不是把它埋在暂停菜单下。在游戏中冻结世界，照片工具将给你完全的相机和视觉过滤器控制，同时让动画系统保持活动状态。这一部分是至关重要的，因为GET继承了PS4独家推出的地平线：令人难以置信的草、树和树叶动画方面的零黎明-然后更进一步，采用了令人难以置信的光影系统，用适当的、迷人的饱和阳光(或月光)沐浴在任何地区，无论是室内还是室外。\n顺便说一句，那些有风的、漂浮的粒子效果在这个游戏中很重要，我稍后会讲到它们。\n更好的消息是，无论你是在标准PS4上还是在PS4 Pro上玩，你都可以期待一个几乎锁定的30fps刷新，就像TLOU2一样。PS4 Pro的用户还可以在1440p的30fps锁定和1080p的解锁帧速率之间进行选择。然而，这些Pro选项之间的帧率差异几乎看不出来，因为在我的测试中，帧率似乎从未超过40fps。我选择了锁定30fps的选项，以避免帧频抖动，我想知道这个选项是不是专门作为对最终的PlayStation5玩家的快速和肮脏的额外奖励(假设它是向前兼容的，索尼还没有证实这一点)。\n然而，在当前一代游戏机上的性能不仅仅是每秒的帧数，而且GET在另一个方面也是一头猛兽：加载时间，或者说没有加载时间。这款开放世界的游戏让你可以跑步或骑马穿越它的世界，但如果你只是想在地图上点击一个图标，快速旅行-或者如果你在中途死亡并再次尝试-等待时间很少超过10秒，而且通常要短得多。\nGOT还包括一个戏剧性的和引人注目的黑泽一郎过滤器作为视觉选项。这是对日本标志性电影导演(七武士)的致敬，正如你可能预期的那样：全黑白，带有胶片颗粒效果和温和的音频过滤器。这款滤镜最棒的地方在于，Sucker Punch花了很大力气来调整背景物体的阴影和前景物体的对比度。在戏剧性的月光下，绿树成荫的小路，成群的敌人，以及被戏剧性的月光刻成的城镇，看起来都很清晰，启用了黑白过滤器就很容易导航，这是一项相当高的技术壮举。\n不幸的是，从发布之日起，这个漂亮的滤镜在战斗中禁用了一个关键的彩色闪光系统，该系统可以帮助玩家对基于任何颜色闪光的攻击做出反应。(巧合的是，玩家在玩全色游戏时也不能选择闪烁的颜色；如果你是色盲，这是个坏消息。)。我希望Sucker Punch能为这些攻击想出另一种视觉效果，就像一系列巨大的闪烁图标。但多亏了这个问题，我不得不禁用黑泽一郎的过滤器，这样我才能在游戏后面的战斗部分幸存下来。", "note_en": "Like clockwork, certain friends of mine text or IM when a big video game is about to launch. I&#39;m the guy they know who gets games like a new   Smash Bros. or   Half-Life before the general public, and they love to push my embargoes to the limits with questions like &#34;does it live up to the hype?&#34; or &#34;no spoilers: should I buy it?&#34;\n With  Ghost of Tsushima, likely the last major new first-party game for Sony&#39;s PS4, I got a surprising number of these questions over the past few weeks. You might say they were surprising because  Tsushima is an entirely new game series, not a hotly anticipated sequel. But the surprise came in a different form, as all of my friends came out of the woodwork to essentially ask me the same question: &#34;Is this new Sony game  hopeful?&#34;\n PS4 fans are likely still reeling from the console&#39;s last major exclusive, June&#39;s brutal   Last of Us Part II—a game that revolves around the biological and social devastation following a global pandemic.  TLOU2 is a brave, challenging, and compelling game, but the consensus I&#39;ve gathered is that people are hungry for a different kind of adventure right now.\n So I&#39;m starting my review of  Ghost of Tsushima by loudly and emphatically saying yes, this game is hopeful in all of the best ways. The latest adventure game from Sucker Punch, makers of series like  Sly Cooper and   inFamous, has come out of nowhere to blow me away. I&#39;m stunned in part because I nearly wrote the game off as  an  Assassin&#39;s Creed clone when its gameplay was revealed in April. You wouldn&#39;t be blamed for doing the same; we&#39;re now roughly 400 years into the &#34;open-world adventure&#34; trend, and these games sure do blur together.\n There&#39;s no blurring here, though. Tsushima stands out for many reasons, perhaps most crucially because it does something I haven&#39;t seen in the genre since   Grand Theft Auto San Andreas: it  nails the world-building relationship between the player, the protagonist, and the supporting cast. I rarely lost my sense of purpose or place while striving to bring honor back to my family and country as Jin Sakai, the game&#39;s hero. When he made friends, formed alliances, meditated on loss, or faced tragedy, I was there with him every step of the way, and this feeling was aided by a smartly paced stream of new samurai superpowers.\n Ghost of Tsushima is by no means a perfect game, but it nails the important stuff: its 30-hour quest will make you feel like the star of a story about revenge, principle, and inner peace.\n  Before we dive into how the game plays, we should start with how it looks, because, goodness:\n    See how diverse and gorgeous that gallery is? What if I told you that all of the above images are captured from the game&#39;s first 12 hours and that there&#39;s even more beautiful stuff waiting for you in the final game?\n The complete game is stuffed with moments worthy of screen grabs, which might be why  GoT dedicates a d-pad button to a photo tool, as opposed to burying it beneath a pause menu. Freeze the world midgame, and the photo tool will give you total camera and visual-filter control while leaving the animation systems live. That part is crucial, because  GoT follows the legacy of PS4 exclusive   Horizon: Zero Dawn in terms of unbelievable grass, tree, and foliage animation—then goes further with an unbelievable lighting-and-shadow system that bathes any region, indoor or out, with appropriate, attractively saturated sunlight (or moonlight).\n Those windy, floaty-particle effects matter in this game, by the way, and I&#39;ll get to them in a bit.\n In even better news, you can expect a mostly locked 30 fps refresh, much like with  TLOU2, whether you play on standard PS4 or on PS4 Pro. PS4 Pro owners also get to choose between a 30 fps lock at 1440p and an unlocked frame rate at 1080p. However, the frame-rate difference between these Pro options is hardly perceptible, since the frame rate never seemed to jump beyond 40 fps in my testing. I opted for the locked 30 fps option to avoid frame-pacing judder, and I wonder if this option was left specifically as a quick-and-dirty bonus for eventual PlayStation 5 players (assuming it&#39;s forward-compatible, which Sony hasn&#39;t yet confirmed).\n Performance on a current-gen console isn&#39;t just about the frames per second, however, and  GoT is a beast in one other department: loading times, or lack thereof. This open-world game lets you run or ride on a horse through its worlds, but if you just want to tap an icon on your map and fast-travel—or if you die midmission and try again—the wait time is rarely more than 10 seconds and usually far less.\n    GoT also includes a dramatic and compelling &#34;Kurosawa filter&#34; as a visual option. This homage to the iconic Japanese film director ( Seven Samurai) works as you might expect: all in black-and-white with a film-grain effect and a mild audio filter. The best thing about this filter is that Sucker Punch has gone to great lengths to adjust the shades of backdrop objects and the contrast of foreground ones. Foliage-lined paths, crowds of foes, and towns carved by dramatic moonlight all look clear and are easy to navigate with the black-and-white filter enabled, and that&#39;s quite a technological feat.\n Unfortunately, as of launch, this handsome filter disables a crucial color-flash system during combat, which helps players react to attacks based on whatever color flashes. (Coincidentally, players also cannot choose which colors flash during full-color gameplay; bad news if you&#39;re colorblind.) I wish Sucker Punch had come up with an alternative visual tell for these attacks, like a giant series of flashing icons. But thanks to that issue, I had to disable the Kurosawa filter so that I could survive the game&#39;s later combat sections.", "posttime": "2020-07-14 22:05:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "幽灵,tsushima,游戏", "title": "对马幽灵评论：一个开放世界的、荣耀、隐秘和复仇的跆拳道", "title_en": "Ghost of Tsushima review: An open-world haiku of honor, stealth, and revenge", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/ghost-of-tsushima-review-an-open-world-haiku-of-honor-stealth-and-revenge/", "via": "", "real_tags": ["幽灵", "tsushima", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "a12988c9779731f7e539def86bfef5a3.jpg", "infoid": 1011750, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "班萨尔说，安全传统上着眼于保护网络和硬件，但今天的攻击面更多地是在软件层面，这就是为什么他决定创办另一家公司。“该软件正在成为很多事情的主要攻击媒介。如果你看看大多数复杂的数据泄露事件[…]。它们发生在代码中，而不再发生在网络或基础设施中，“他解释说。\nTracable使用软件代理来监控代码的异常行为，比如有人通过API以不寻常的方式移动数据。该解决方案利用机器学习来了解随着时间的推移，正常行为是什么样子。当它建立这种理解时，它可以识别异常活动，并对其进行标记或将其关闭。\n它集成了其他工具，如Slake，并自动发出可能出现问题的警告。这可能涉及到一个操作，比如让团队知道它将关闭API访问5到10分钟，以允许某人探索问题。如果这是一个错误，软件会学到一些东西，但如果有问题，团队可以继续阻止访问并修复它。\n该公司还宣布从不同寻常的风险投资公司和大型实验室获得2000万美元的首轮融资。值得注意的是，班萨尔经营着这两家公司。他承认自己是个大忙人，但他说经营公司是他喜欢做的事情。尽管他本可以在出售AppDynamics后退休，但这根本不是他的天性。\n“有些人在某个岗位上工作，一旦退休，他们就会做自己喜欢做的事情。我意识到的是，建筑公司是我喜欢的。“他说。\n作为一个创建了三家初创公司的人，班萨尔认为多样性和包容性是一个关键的成功因素，这是你必须真正努力的东西。他说：“从招聘实践到如何给团队带来不同种类的多样性，你必须对此采取积极主动的态度。”他说，其中一个错误是人们倾向于雇佣像他们这样的人，他很早就意识到，寻找“文化契合度”会鼓励更多同质化的团队。作为AppDynamics的早期招聘过滤器，他取消了这一点。\n“我意识到，文化契合的想法是一件坏事，因为它变成了像‘我要和这个人喝杯啤酒’这样的事情，他们和我相似吗，或者我可以与之产生共鸣的人？”但这真的不是一件好事，因为这会降低你招聘和面试过程中的多样性。“他说。\n在大流行和经济疲软的情况下，他并不害怕成立第三家公司。事实上，就在崩盘前两个月，他在2008年推出了AppDynamics。“事后看来，我觉得这是发生在我身上的最好的事情之一，因为它塑造了我们作为一家公司的形象-非常痴迷于客户，非常专注于打造市场上最好的产品，并在公司内部拥有非常强大的文化。这让我们非常成功，“他说。\n他说，他正试图在Harness和可追溯性方面建立类似的心态。在他看来，经济衰退往往会迫使一家公司集中精力，淘汰那些无法做到这一点的公司。可追溯性是他为解决一个大问题所做的最新努力，无论是否流行，他都在向前迈进。", "note_en": "Bansal says that security has traditionally looked at protecting the network and hardware, but today the attack surface is more at the software level, and that’s why he decided to start another company. “The software is becoming the primary attack vector for a lot of things. If you look at most of the sophisticated data breaches […], they are happening in the code, not in the network or the infrastructure anymore,” he explained.\n Traceable uses software agents to monitor the code for anomalous behavior like someone moving data via an API in an unusual way. The solution leverages machine learning to learn over time what normal behavior looks like. As it builds that understanding, it can identify abnormal activity and flag it or shut it down.\n  It integrates in other tools like Slack and sends out automated warnings that something could be amiss. This could involve an action like letting the team know it’s shutting down API access for five or 10 minutes to allow someone to explore the problem. If it’s a mistake, the software learns something, but if there’s something wrong the team can continue to block access and fix it.\n The company also announced $20 million in Series A funding from  Unusual Ventures   and Big Labs. It’s worth noting that Bansal runs both of these firms. He admits he’s a busy guy, but says running companies is what he loves to do. Even though he could have retired after selling  AppDynamics,   it’s simply not how he is wired.\n “Some people work in some role and once they retire they’re going to do what they enjoy. What I realized is that building companies is what I enjoy,” he said.\n As someone who has built three startups, Bansal sees diversity and inclusion as a key success factor, something you have to really work at. “You have to be proactive about this from your recruitment practices to how you try to bring different kinds of diversity in your team,” he said. One of the mistakes he says is that people tend to hire people like themselves, and he learned early on that looking for a “cultural fit” would encourage more homogenized teams. He eliminated that as a hiring filter early on at AppDynamics.\n “What I realized is the culture fit idea is a bad thing because it becomes about things like ‘Am I going to grab a beer with this person’ and are they similar to me or someone who I can relate to? But that’s not a good thing really like because that reduces the diversity in your hiring and interview process,” he said.\n He is not intimidated about launching a third company in the middle of the pandemic and a weakening economy. In fact, he launched AppDynamics in 2008 just two months before the crash. “In hindsight I felt like that was one of the best thing that happened to me because it shaped who we were as a company — very customer obsessed, heavily focused on building the best product in the market and having a very strong culture inside the company. And that made us very successful,” he said.\n He says he is trying to build a similar mindset at  Harness   and Traceable. To him, a recession tends to force a company to focus and weeds out companies that can’t do that. Traceable is his latest effort to solve a big problem, and pandemic or not, he’s moving forward.", "posttime": "2020-07-14 22:04:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,bansal", "title": "\nJyoti Bansal的第三家初创公司致力于代码安全", "title_en": "\n\t\t\t\tJyoti Bansal’s third startup goes after code security\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/jyoti-bansals-third-startup-goes-after-code-security/", "via": "", "real_tags": ["代码", "bansal"]}, {"category": "", "categoryclass": "", "imagename": "58571d45e4712fcacc5cc08c557963de.png", "infoid": 1011748, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify今天正在修改其播客排行榜，以帮助听众找到新的节目，并跟上他们所在地区的人们正在欣赏的内容。这为Spotify带来了播客行业中一项知名且有争议的功能，使这款应用程序与苹果播客等其他流行播放器不相上下。\n最初的两个播客排行榜将被称为“趋势”(Trending)和“榜首”(Top)。趋势部分基于听众数量的增长速度，包括50个上升的节目，而Top将是总体上最受欢迎的200个节目，并将按地区进行本地化。TOP目前已经以小得多的形式存在，在某些地区也可以分为商业、喜剧和技术等类别。这些图表将在26个国家提供，包括美国、墨西哥、英国、巴西和德国。两者都将每天更新。\n播客排行榜可能会引起争议，特别是因为决定其排名的算法通常是不透明的。人们也试图玩弄它们，让业内人士质疑它们的合法性。Spotify的一位发言人告诉The Verge，它已经建立了“重叠系统”，将监控欺诈活动，并将不良行为从服务中移除。\nSpotify过去曾与试图夸大音乐播放和版税的收听机器人进行过斗争。在这些情况下，作弊系统的动机更高，因为欺诈者是按收听次数付费的，只要他们发布和创作了音乐。播客不是按收听付费的，这也是Spotify想要专注于该行业的原因之一。\n尽管如此，人们还是试图弄清楚如何在其他平台上玩弄播客排行榜。这些排行榜可以让听众接触到他们没有听过的播客，从而让节目变得更受欢迎。2018年，播客约翰·佩罗蒂(John Perotti)能够在网上支付5美元给一个人，然后这个人设法让他的小节目在苹果公司的播客排行榜上名列第55位。同样的情况也可能发生在Spotify上，因为播客们寻求更多的关注和听众。", "note_en": "Spotify is revamping its podcast charts today to help listeners find new shows and keep up with what people are enjoying in their area. This brings a well-known, and controversial, feature in the podcasting industry to Spotify, making the app more on par with other popular players, like Apple Podcasts.\n The two initial podcast charts will be called Trending and Top. Trending, which is based partially on the speed of growth in listener numbers, includes 50 rising shows, while Top will be the 200 most popular shows overall and will be localized by region. Top, which already exists in a much smaller form currently, can also be separated into categories, like business, comedy, and technology, in certain regions. The charts will be available in 26 countries, including the US, Mexico, the UK, Brazil, and Germany. Both will be updated daily.\n Podcast charts can be controversial, especially because the algorithms that determine their rankings are often opaque. People try to game them, too, making people in the industry question their legitimacy. A Spotify spokesperson tells  The Verge it has “overlapping systems” in place that’ll monitor fraudulent activity and remove bad actors from the service.\n Spotify has  battled listener bots in the past that try to inflate music plays and royalties. In those cases, the incentive to cheat the system was higher because the scammers were paid per listen, so long as they published and created the music. Podcasters aren’t paid per listen, which is one reason Spotify has wanted to focus on the industry.\n Still, people have  tried to figure out how to game the podcast charts on other platforms. The charts could make shows more popular sheerly by exposing listeners to podcasts they haven’t heard. In 2018, podcaster John Perotti was able to pay $5 to someone online who then managed to get his tiny show to number 55 on Apple’s top podcast chart. The same could happen on Spotify as podcasters seek more attention and listeners.", "posttime": "2020-07-14 21:59:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,节目,shows", "title": "Spotify推出了一个包含50个上升节目的趋势播客排行榜，并将其TOP排行榜扩大到按地区划分的200个最受欢迎节目的总排行榜", "title_en": "Spotify is launching a Trending podcast chart with 50 rising shows, and expanding its Top chart to the 200 most popular shows overall, localized by region", "transed": 1, "url": "https://www.theverge.com/2020/7/14/21323202/spotify-podcast-chart-trending-top-update-feature?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["播客", "节目", "shows"]}, {"category": "", "categoryclass": "", "imagename": "2457fcd25923d86842e14d6fa3d530d0.png", "infoid": 1011747, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Magic Transition是Cloudflare的L3 DDoS清理服务，用于保护网络基础设施。作为我们对Magic Transportation的持续投资和我们的DDoS保护功能的一部分，我们很高兴能谈论一款帮助保护Magic Transportation客户的新软件：flow trackd。flowrackd是一个软件定义的DDoS保护系统，它显著提高了我们自动检测和缓解即使是最复杂的基于TCP的DDoS攻击的能力。如果您是Magic Transportation客户，此功能将在2020年7月29日免费默认启用。\n在2020年第一季度，每两个缓解Cloudflare的L3/4 DDoS攻击中就有一个是ACK泛洪，所有L3/4攻击中超过66%是基于TCP的。大多数类型的DDoS攻击都可以通过查找所有攻击数据包中存在的独特特征并使用该特征来区分“好”数据包和“坏”数据包来缓解。这称为无状态缓解，因为任何具有这些独特特征的数据包都可以被简单地丢弃，而不会记住有关其之前的其他数据包的任何信息(或状态)。但是，当攻击数据包没有唯一特征时，则需要进行有状态缓解，因为某个数据包的好坏取决于它之前的其他数据包。\n最复杂的TCP泛洪类型需要状态缓解，其中必须跟踪每个TCP连接，以便知道是否有任何特定的TCP数据包是活动连接的一部分。这种缓解称为流跟踪，通常在Linux中由iptables连接跟踪模块实现。但是，使用ConnecTrack的DDoS保护并不像翻转iptable交换机那么简单，尤其是在Cloudflare操作的规模和复杂性方面。如果您有兴趣了解更多信息，在本博客中我们将讨论实现iptables Conntrace的技术挑战。\n复杂的TCP DDoS攻击会带来威胁，因为它们更难检测和缓解。因此，如果缓解规则不准确，它们可能会导致服务降级、停机和误报增加。那么，Cloudflare如何在不影响合法流量的情况下阻止无模式DDoS攻击呢？\n使用Cloudflare的传统产品，可以通过WAF服务保护HTTP应用程序，通过Spectrum保护TCP/UDP应用程序。这些服务是反向代理，这意味着流量双向通过Cloudflare。在此双向拓扑中，我们可以看到整个TCP流(即客户端和服务器发送的数据段)，因此可以跟踪底层TCP连接的状态。这样，我们就可以知道TCP数据包是否属于现有的流，或者它是否是“非状态”的TCP数据包。脱离状态的TCP数据包看起来就像普通的TCP数据包，但它们不属于客户端和服务器之间的任何真正连接。这些数据包很可能是攻击的一部分，因此会被丢弃。\n当我们充当客户端和服务器之间的代理时，可以跟踪TCP流，这使我们能够吸收和缓解状态外的TCP洪流，这一点并不是微不足道的。然而，当我们只看到连接的一半时，这就变得更具挑战性了：入口流。这种对入站流(而不是出站流)的可见性是Cloudflare的Magic Transfer服务的默认部署方法，因此我们在识别状态外数据包方面有很多工作要做。\n借助Magic Transition，Cloudflare可以代表客户接收入站互联网流量，清除DDoS攻击，并通过隧道将干净的流量路由到客户的数据中心。然后，数据中心使用称为直接服务器返回(DSR)的技术直接响应Eyes Ball客户端。\n使用DSR时，当Eyball客户端发起TCP握手时，它会发送一个SYN数据包，该数据包通过Cloudflare路由到源数据中心。然后，源设备绕过Cloudflare，直接向客户端发出SYN-ACK响应。最后，客户端使用ACK进行响应，该ACK再次通过Cloudflare路由到源，然后认为连接已建立。\n在单向流中，我们看不到从源发送到Eyball客户端的SYN+ACK，因此不能利用我们现有的流跟踪功能来识别脱离状态的数据包。\n为了克服单向流的挑战，我们最近完成了代号为flowtrackd(“流跟踪守护程序”)的新系统的开发和推出。flowtrackd是一个挂接到网络接口的状态机。它仅使用通过Cloudflare路由的入口流量跟踪单向TCP流，以确定TCP连接的状态。然后，flowtrackd能够确定数据包是新连接的一部分、打开的连接、正在关闭的连接、关闭的连接，还是处于非状态的数据包。一旦检测到大量非状态数据包，flowtrackd将质询(强制RST)或丢弃这些数据包。\n确定流状态的状态机是内部开发的，是对Gatebot和DOSD的补充。Gatebot、DOSD和Flowtrackd共同提供全面的多层DDoS保护。\n而且它起作用了！在将flowtrackd发布给早期访问客户后不到一天，flowtrackd自动检测并缓解了峰值为每秒600万个数据包的ACK泛滥。未报告停机、服务中断或误报。\n与网络基础设施有限的传统清理中心提供商不同，Cloudflare可从我们在全球200多个地点的每个数据中心提供DDoS保护。我们编写自己的软件定义的DDoS保护系统。请注意，我之所以说System s，是因为与使用专用第三方设备的供应商不同，我们能够编写和启动我们需要的任何软件，将其部署在我们的技术堆栈中的最佳位置，因此不依赖于其他供应商，也不局限于一种设备的功能。\nFlowtrackd加入了Cloudflare DDoS保护大家庭，其中包括我们经验丰富的Gatebot和年轻而精力充沛的DDoS。我们的每个数据中心都将提供flowtrackd，总缓解能力超过37Tbps，保护我们的Magic Transport客户免受最复杂的TCP DDoS攻击。\n刚开始使用魔术交通吗？将您的传统提供商替换为Magic Transportation，在当前合同到期之前无需支付任何费用。优惠将于2020年9月1日到期。有关详细信息，请单击此处。", "note_en": "Magic Transit is Cloudflare’s L3 DDoS Scrubbing service for protecting network infrastructure. As part of our ongoing investment in Magic Transit and our  DDoS protection capabilities, we’re excited to talk about a new piece of software helping to protect Magic Transit customers:   flowtrackd. flowrackd is a software-defined DDoS protection system that significantly improves our ability to automatically detect and mitigate even the most complex TCP-based DDoS attacks. If you are a Magic Transit customer, this feature will be enabled by default at no additional cost on July 29, 2020.\n   In the first quarter of 2020, one out of every two L3/4  DDoS attacks Cloudflare mitigated was an  ACK Flood, and over 66% of all L3/4 attacks were  TCP based. Most types of DDoS attacks can be mitigated by finding unique characteristics that are present in all attack packets and using that to distinguish ‘good’ packets from the ‘bad’ ones. This is called &#34;stateless&#34; mitigation, because any packet that has these unique characteristics can simply be dropped without remembering any information (or &#34;state&#34;) about the other packets that came before it. However, when attack packets have no unique characteristics, then &#34;stateful&#34; mitigation is required, because whether a certain packet is good or bad depends on the other packets that have come before it.\n The most sophisticated types of TCP flood require stateful mitigation, where every TCP connection must be tracked in order to know whether any particular TCP packet is part of an active connection. That kind of mitigation is called &#34;flow tracking&#34;, and it is typically implemented in Linux by the  iptables conntrack module. However, DDoS protection with conntrack is not as simple as flipping the iptable switch, especially at the scale and complexity that Cloudflare operates in. If you&#39;re interested to learn more, in  this blog we talk about the technical challenges of implementing iptables conntrack.\n Complex TCP DDoS attacks pose a threat as they can be harder to detect and mitigate. They therefore have the potential to cause service degradation, outages and increased false positives with inaccurate mitigation rules. So how does Cloudflare block patternless DDoS attacks without affecting legitimate traffic?\n  Using Cloudflare&#39;s traditional products, HTTP applications can be protected by the  WAF service, and TCP/UDP applications can be protected by  Spectrum. These services are &#34; reverse proxies&#34;, meaning that traffic passes through Cloudflare in both directions. In this bidirectional topology, we see the entire TCP flow (i.e., segments sent by both the client and the server) and can therefore track the state of the underlying TCP connection. This way, we know if a TCP packet belongs to an existing flow or if it is an “out of state” TCP packet. Out of state TCP packets look just like regular TCP packets, but they don’t belong to any real connection between a client and a server. These packets are most likely part of an attack and are therefore dropped.\n  While not trivial,  tracking TCP flows can be done when we serve as a proxy between the client and server, allowing us to absorb and mitigate out of state TCP floods. However it becomes  much more challenging when we only see half of the connection: the ingress flow. This visibility into ingress but not egress flows is the default deployment method for Cloudflare’s Magic Transit service, so we had our work cut out for us in identifying out of state packets.\n  With Magic Transit, Cloudflare receives inbound internet traffic on behalf of the customer, scrubs DDoS attacks, and routes the clean traffic to the customer’s data center over a tunnel. The data center then responds directly to the eyeball client using a technique known as Direct Server Return (DSR).\n  Using DSR, when a TCP handshake is initiated by an eyeball client, it sends a SYN packet that gets routed via Cloudflare to the origin data center. The origin then responds with a SYN-ACK directly to the client, bypassing Cloudflare. Finally, the client responds with an ACK that once again routes to the origin via Cloudflare and the connection is then considered established.\n  In a unidirectional flow we don’t see the SYN+ACK sent from the origin to the eyeball client, and therefore can&#39;t utilize our existing flow tracking capabilities to identify out of state packets.\n  To overcome the challenges of unidirectional flows, we recently completed the development and rollout of a new system, codenamed flowtrackd (“flow tracking daemon”). flowtrackd is a state machine that hooks into the network interface. It tracks unidirectional TCP flows using only the ingress traffic that routes through Cloudflare to determine the state of the TCP connection. flowtrackd is then able to determine if a packet is part of a new connection, an open one, a connection that is closing, one that is closed, or if it’s an out of state packet. Once a high volume of out-of-state packets is detected, flowtrackd will either challenge (force RST) or drop the packets.\n  The state machine that determines the state of the flows was developed in-house and complements Gatebot and dosd. Together Gatebot, dosd, and flowtrackd provide a comprehensive multi layer DDoS protection.\n  And it works! Less than a day after releasing flowtrackd to an early access customer, flowtrackd automatically detected and mitigated an ACK flood that peaked at 6 million packets per second. No downtime, service disruption, or false positives were reported.\n   As opposed to legacy scrubbing center providers with limited network infrastructures, Cloudflare provides DDoS Protection from every one of our data centers in over 200 locations around the world. We write our own software-defined DDoS protection systems. Notice I say system s, because as opposed to vendors that use a dedicated third party appliance, we’re able to write and spin up whatever software we need, deploy it in the optimal location in our tech stack and are therefore not dependent on other vendors or be limited to the capabilities of one appliance.\n flowtrackd joins the Cloudflare DDoS protection family which includes our veteran  Gatebot and the younger and energetic  dosd. flowtrackd will be available from every one of our data centers, with a total mitigation capacity of over 37 Tbps, protecting our Magic Transit customers against the most complex TCP DDoS attacks.\n New to Magic Transit? Replace your legacy provider with Magic Transit and pay nothing until your current contract expires. Offer expires September 1, 2020. Click  here for details.", "posttime": "2020-07-14 21:59:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "单向,ddos,数据包", "title": "Flowtrackd：单向TCP流量跟踪的DDoS保护", "title_en": "Flowtrackd: DDoS Protection with Unidirectional TCP Flow Tracking", "transed": 1, "url": "https://blog.cloudflare.com/announcing-flowtrackd/", "via": "", "real_tags": ["单向", "ddos", "数据包"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网站暂时无法为您的请求提供服务，因为它超出了资源限制。请稍后重试。", "note_en": "The website is temporarily unable to service your request as it exceeded resource limit.Please try again later.", "posttime": "2020-07-14 21:59:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,游戏,学校,puts,请求", "title": "波兰将电脑游戏《这场地雷之战》列入学校阅读清单", "title_en": "Poland puts computer game “This War of Mine” on school reading list", "transed": 1, "url": "https://notesfrompoland.com/2020/06/18/poland-puts-computer-game-this-war-of-mine-on-school-reading-list/", "via": "", "real_tags": ["电脑", "游戏", "学校", "puts", "请求"]}, {"category": "", "categoryclass": "", "imagename": "a71e7b6df5d8da92f562881f15f13dc3.jpg", "infoid": 1011744, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "约翰·凯门尼(John Kemeny)和汤姆·库尔茨(Tom Kurtz)教授与一群达特茅斯大学的本科生一起发明了基本的计算机语言。", "note_en": "Professors John Kemeny and Tom Kurtz along with a band of Dartmouth undergraduates invent the Basic computer language.", "posttime": "2020-07-14 21:58:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "basic,birth,john", "title": "Basic诞生(2014)[视频]", "title_en": "Birth of BASIC (2014) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=WYPNjSoDrqw", "via": "", "real_tags": ["basic", "birth", "john"]}]