[{"category": "", "categoryclass": "", "imagename": "51e4f6d54ad3a9c2ee172e57cca86974.jpg", "infoid": 1029889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉(Tesla)大幅削弱了其二手车保修，这是这家汽车制造商又一次奇怪地杀害了一名消费者信心建设者。\n上周，我们报道了特斯拉取消了大胆的“不问问题”的7天退货政策，该政策被这家汽车制造商和首席执行官埃隆·马斯克(Elon Musk)直接用作建立信心的工具。\n特斯拉过去曾为二手车Model S和Model X提供2至4年的保修：\n特斯拉交付时车龄在4岁以下、行驶里程不足50,000英里的S型和X型车：二手车S型和X型从您交付之日起，享有4年或50,000英里的二手车有限保修保护，以先到者为准。旧车仍然适用原电池和驱动单元有限保修的余额。特斯拉二手车有限保修不会延长或以其他方式更改原始保修。\n特斯拉交付时车龄超过4年或超过50,000英里、6岁以下且行驶里程100,000英里的Model S和Model X：二手车延长有限保修提供最长2年的交付后保修或最长100,000英里的保修，以先到者为准。原电池和驱动单元有限保修的余额仍适用于二手车。特斯拉二手车有限保修不会延长或以其他方式更改原始保修。\n现在，特斯拉已经将其二手车保修更新为仅比原来的保修高出一年或1万英里：\n“特斯拉二手车在基本车辆有限保修的剩余4年或50,000英里的保修期内。过期后，二手车有限保修提供1年或10,000英里的额外保修。如果基本车辆有限保修已经过期，二手车辆有限保修将从您的交付日期起提供1年或10,000英里的保修。“。\n虽然在新车保修基础上增加的新二手车保修对从特斯拉购买的较新二手车有利，但它确实削弱了2016年及以上二手车的任何形式的保修。\n不再是2到4年的保修期，现在他们只有1年或10000英里的保修期。\n令人奇怪的是，特斯拉背靠背地走了这两步棋。7天退货政策和二手车保修都是为了建立人们对特斯拉汽车的信心。\n公平地说，这些建立信心的举措让他们领先于竞争对手，现在取消他们就可以与他们平起平坐，这在观点上并不坏，但仍然值得注意。\n我买了两辆特斯拉二手车，一辆是直接从特斯拉买的，另一辆是从第三方买的，在这两种情况下，保修都非常重要。\n这两款车都有特斯拉最初的8年不限里程动力总成保修，这对我来说非常有用，因为我2012年S型P85的签名目前在保修结束前两个月得到了一个新的电池组和电动马达。\n我还拿到了S型车两年的二手车保修单，保修期涵盖了几次维修，但这并不是什么疯狂的事情。\n现在只有1年和1万英里，我认为更多的人会考虑第三方交易来购买二手特斯拉。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从何说起？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Tesla has significantly weakened its used car warranty in another strange killing of a consumer confidence builder from the automaker.\n  Last week, we reported on  Tesla canceling its ballsy ‘no questions asked’ 7-day return policy, which was used as a confidence builder by the automaker and directly by CEO Elon Musk.\n  Tesla used to offer 2 to 4 -year warranty on used Model S and Model X vehicles:\n Model S and Model X that were under 4 years old and under 50,000 miles at the time of Tesla delivery: Used Model S and Model X are protected by a Used Vehicle Limited Warranty for 4 years or 50,000 miles, whichever comes first, starting from your delivery date. The balance of original Battery and Drive Unit Limited warranty still applies for used vehicles. The Tesla Used Vehicle Limited Warranty does not extend or otherwise alter the original warranty.\n Model S and Model X that were over 4 years old or over 50,000 miles and under 6 years old and 100,000 miles at the time of Tesla delivery: Used Vehicle Extended Limited Warranty provides coverage for up to 2 years post-delivery or up to 100,000 miles, whichever comes first. The balance of the original Battery and Drive Unit Limited Warranty still applies for used vehicles. The Tesla Used Vehicle Limited Warranty does not extend or otherwise alter the original warranty.\n Now Tesla has updated its used vehicle warranty to only one year or 10,000 miles over the original warranty:\n “Tesla used vehicles are covered by the remainder of 4 years or 50,000 miles left on the Basic Vehicle Limited Warranty. After expiration, the Used Vehicle Limited Warranty provides additional coverage of 1 year or 10,000 miles. If the Basic Vehicle Limited Warranty has already expired, the Used Vehicle Limited Warranty will provide coverage of 1 year or 10,000 miles, starting from your delivery date.”\n While the new used car warranty being added on top of the new car warranty is good for more recent used vehicles purchased from Tesla, it really cripples any kind of warranty on used Tesla vehicles from 2016 and older.\n Instead of getting 2 to 4 years of warranty, now they only get 1 year or 10,000 miles.\n  It’s strange that Tesla made these two moves back to back. Both the 7-day return policy and used car warranty were aimed at building confidence in Tesla vehicles.\n To be fair, those confidence builder initiatives put them ahead of the competition, and now removing them puts them on par, which is not bad in perspective, but it’s still noteworthy.\n I bought two used Tesla vehicles, one from Tesla directly and one from a third-party, and in both cases, the warranty was really important.\n Both cars had Tesla’s original 8-year unlimited mileage powertrain warranty that has proven extremely useful to me since my 2012 Model S P85 Signature is currently getting a new battery pack and electric motor just 2 months before the warranty ends.\n I also got a two year used car warranty on the Model S, which covered a few repairs, but it was nothing crazy.\n Now with only 1-year and 10,000 miles, I think more people will look at third-party transactions to buy used Teslas.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-10-20 03:23:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,二手车,slashes,保修", "title": "特斯拉大幅削减二手车保修至一年或10K英里", "title_en": "Tesla slashes its used car warranty to one year or 10k miles", "transed": 1, "url": "https://electrek.co/2020/10/19/tesla-slashes-used-car-warranty/", "via": "", "real_tags": ["特斯拉", "二手车", "slashes", "保修"]}, {"category": "", "categoryclass": "", "imagename": "1f2b2be319b55f9d6b730c81d2e39952.png", "infoid": 1029888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开源的Git项目刚刚发布了Git2.29版本，包含了来自89个贡献者的功能和错误修复，其中24个是新的。上次我们追上你的时候，Git 2.28刚刚发布。再过一个版本，让我们来看看自那以后发生的最有趣的特性和变化。\nGit2.29包含对使用内容的SHA-256散列(而不是使用SHA-1)编写存储库对象的试验性支持。\n这一切意味着什么？为了解释，让我们从头说起。\n当您将文件添加到存储库时，Git会将其内容复制到其本地数据库中的BLOB对象中，并创建引用BLOB的树状对象。同样，当您运行git Commit时，这将创建一个引用表示提交状态的树的提交树对象。这些对象如何“引用”彼此，在与Git交互时如何识别它们？答案是，基于其内容的散列，每个对象都被赋予一个唯一的名称，称为其唯一的对象ID。Git使用SHA-1作为其选择的散列算法，并依赖于不同对象的对象ID是唯一的。\n回到这篇博客文章中，我们估计，即使你有500万程序员每秒编写一个提交，在太阳吞噬地球之前，你也只有50%的机会意外地产生碰撞，但确实存在一些公开发表的攻击，它们利用SHA-1的弱点，可以减少产生碰撞所需的工作量，但这些攻击的执行成本仍然高达数万美元，而且还没有发布针对Git的已知示例。\n正如我们在之前的博客文章中所说的那样，Git(以及使用它的提供商，如GitHub)检查它散列的每个对象，看看是否有证据表明该对象是冲突对的一部分。这可以防止GitHub同时接受该对中的良性和恶意两部分，因为在任何合理的时间内生成冲突所需的数学技巧都可以被Git检测和拒绝。\n即便如此，密码散列中的任何弱点都是不好的征兆。即使Git已经实现了阻止已知攻击执行的检测，也不能保证将来不会发现和使用新的攻击。因此，Git项目一直在准备过渡计划，以开始使用一种新的对象格式，并且没有已知的攻击：SHA-256。\n$git--version git version2.29.0$git init--object-format=sha256repo/HOME/ttaylorr/repo/.git/$cd repo$ECHO&#39；您好，sha-256！&#39；&gt；readme.md$git add readme.md$git Commit-m&#34；readme.md：初始提交&#34；[主(根-提交)6e92961]readme.md：初始提交1个文件已更改，1插入(+)创建模式100644 README.md$git rev-parse head 6e929619da9d82c78dd854dfe237c61cbad9e95148c1849b1f96ada5ee800810\n从2.29版开始，Git可以在完全SHA-1或完全SHA-256模式下运行。目前，使用不同对象格式的存储库不可能相互互操作，但计划提供最终的支持。还需要注意的是，在撰写本文时，还没有主要的提供商(包括GitHub)支持托管启用了SHA-256的存储库。\n在未来的版本中，Git将通过计算其写入的每个对象的SHA-1和SHA-256散列，并在它们之间存储转换表，从而支持不同对象格式的存储库之间的互操作。这最终将允许使用SHA-256存储其对象的存储库与(充分最新的)SHA-1客户端交互，反之亦然。它还允许转换后的SHA-256存储库让它们对旧SHA-1提交的引用仍然正常工作(例如，如果我编写了一个提交，其消息通过其SHA-1名称引用了以前的提交，那么Git仍然能够遵循该引用，即使在通过查询转换表将存储库转换为使用SHA-256之后也是如此)。\n有关Git中SHA-256的更多信息，以及未来发布的一些版本可能是什么样子，您可以阅读Git的过渡计划。\n当您运行git Fetch Origin时，来自远程原始数据存储库的所有分支都将提取到您的本地文件引用/远程/原始/原始数据层次结构中。Git如何知道要获取哪些分支，以及将它们放在哪里？\n答案是您的配置文件包含每个遥控器的一个或多个“refspecs”(请记住，“ref”是Git对历史上任何命名点的描述：分支、标记等)。当您运行git克隆时，它会设置一个默认refspec，以便在您从原始存储库中提取时使用：\n这个refspec告诉Git获取冒号左侧的内容(引用/头/中的所有内容；即所有分支)，并将它们写入右侧的层次结构中。左手边的意思是“全部匹配”，右手边的意思是“用匹配的零件替换”。\n可以有多个参照等级库，它们可以参照单个参照。例如，此命令指示Git另外从远程获取任何git笔记(a--add参数很重要，这样我们就不会覆盖获取分支的默认refspec)：\n参考规格也被GIT推送使用。即使你只输入一个git推送原点myBranch，最后的那个myBranch也真的是对refs/head/myBranch：refs/head/myBranch的一种速记。这使您可以表达更复杂的场景。假设您正在添加标签，并希望推送您拥有的所有标签，但您还没有完全准备好分享所有分支的提示。在这里，您可以编写如下内容：\n在Git 2.29之前，refspecs只能用来说明您需要选择哪种参照。因此，如果要提取除一个分支之外的所有分支，则必须将它们作为参数逐个列出。当然，这假设您事先知道所有其他引用的名称，因此在实践中应该类似于：\n$git ls-Remote Origin&#39；Refs/Heads/*&#39；|grep-v ref-to-exclude|awk&#39；{print$2：$2}&#39；|xargs git获取原点。\n要获取除要排除的参考/头/参考之外的所有参考中的参考/头/*，请执行以下操作。是啊，一定有更好的办法。\n在Git 2.29中，有：负折射。现在，如果refspec以^开头，则表示要排除哪些引用。因此，您可以改写如下内容，而不是上面的内容：\n并达到同样的效果。当存在负refspec时，如果引用与至少一个正refspec匹配并且不匹配任何负refspec，则服务器认为该引用值得发送。负反射的行为完全符合您的预期，但有几个警告：\n负参照规范可以包含通配符模式，但不能指定目标。这些无论如何都不会有任何意义(你不会想说^refs/head/foo/*：refs/head/bar/*，这就是说，从字面上来说，“把头从Foo映射到bar，但不要一开始就给我发任何foo/reff”)。要排除通配符refspec，只需编写^refs/head/foo/*。\n正折射可以通过对象ID引用单个对象，而负折射不能。\n当然，这些负反射在配置值中也同样有效。如果您总是想获取除foo之外的所有分支，只需将其添加到您的配置中即可：\n虽然您几乎肯定使用过(或听说过)git日志，但对于git Shorlog可能不一定如此。对于那些没有这样做的人来说，Git Shorlog的行为很像Git日志，不同的是它不是按顺序显示提交，而是按照作者对它们进行分组。\n事实上，Git版本说明以版本中所有补丁的简短日志结尾，这些补丁由其作者细分，由Git Short log生成[来源]。在撰写本文时，它们看起来如下所示：\nAaron Lipman(12)：t6030：Modiize&#34；git二等分运行&#34；测试版本列表：允许二等分和第一父标志cmd_bisect__helper：延迟解析无签出标志[...]Adrian Moennich(1)：CI：修复不一致的缩进Alban Gruin(1)：t6300：修复与%(Contents：Size)[...]相关的问题。\n在旧版本的Git中，Git Shorlog日志只能按提交作者分组(默认行为)，也可以选择按提交者身份分组(使用.git Shorlog-c)。这限制了谁通过提交的作者/提交者获得提交的信用。所以，如果你的项目使用的是“合著者”预告片(就像这个在git/git中提交的预告片一样)，那么你的合著者就不走运了：没有办法告诉你git短日志是合著者的群组提交。\n…。也就是说，直到Git2.29！在此版本中，Git Shorlog学习了一个新的分组参数-GROUP参数，以指定如何对提交进行分组和分配信用。它使用--group=Author(前面的默认行为)和a--group=commter log(等同于git Shorlog-c)，但它还接受参数：--group=trailer：&lt；field&gt；。\n通过后者，我们可以按合著者对提交进行分组，还可以使用更具创造性的用途。如果您的项目使用的是预告片审阅者，您可以使用git快捷日志查看谁审阅的补丁最多：\n$GIT SHORTLOG-NS--GROUP=预告片：审阅-由v2.28.0..。海德-N5 40埃里克·阳光10泰勒·布劳4布莱恩·M·卡尔森2以利亚·纽伦1杰夫·金。\nGit Shortlog还允许多个参数--group=&lt；type&gt；，在这种情况下，每个分组都会计算一次提交。因此，如果你想看看谁贡献最多，无论这个人是第一作者，还是被列为共同作者，那么你可以写道：\n…。使作者和合著者处于平等的地位。除了计数，您还可以使用--format选项找到其他有趣的方式来显示数据。例如：\n$GIT SHORTLOG--format=&#34；...在%AS&#34；上帮助%an。--group=预告片：帮助-由v2.28.0..v2.29.0 Chris Torek(3)：...在2020-08-12帮助勒内·沙尔夫...在2020-08-12帮助勒内·沙尔夫...在2020-08-12帮助勒内·沙尔夫大卫·阿吉拉尔(1)：...帮助孙林在2020-05-07 Denton Liu(1)：...在2020-08-21帮助Shourya Shukla Derrick Stolee(2)：...帮助Taylor Blau在2020-08。-25...在2020-09-17帮助泰勒·布劳[...]。\nGit for-each-ref在Git2.29中学习了一些新技巧。既然它们很多，我们就从这里开始吧：\nGit for-each-ref通常输出每个ref的名称、类型和对象ID，但是您可以通过它的“--format”选项找到更多信息。Git 2.29学习了一些新字段，包括内容：Size、主题：Sanitize，以及更一致的元素：短修饰符，以获取缩写的对象ID。最后几个是由从事Git项目的谷歌代码之夏(Google Summer Of Code)学生哈里姆·维尔马(Hariom Verma)贡献的。[来源，来源]。\nGit for-each-ref现在可以接受多个不合并的参数和不合并的参数，如果至少一个不合并的参数可以访问，则打印引用，而不能从任何不合并的参数中访问。[来源]。\n现在，所有的GIT for-each-ref更新都消失了，让我们继续看一下其他所有的花絮：。\n当您的git合并导致合并冲突时，您会看到如下所示的消息(此示例由Elijah Newren提供)：Conflicts(Rename/Delete)：foo.c DELETED in b01dface...(此示例由Elijah Newren提供)：Conflict(Rename/Delete)：foo.c DELETED in b01dface...。删除了不必要的东西，并在Head中重新命名。Foo.c左侧树的版本头。\n你能说出这条信息是什么意思吗？在2.29之前的Git版本中，这一点是模棱两可的：Git是删除了头部中的内容并重命名了文件，还是将“删除了不必要的内容”作为提交消息的名称？事实证明是后者，但你没有办法知道这一点！\n在2.29中，Git现在将COMMIT消息的主题括在括号中，使冲突消息的哪一部分来自COMMIT，哪些部分由Git生成。\n这里有一个简单的问题！Git支持名为.merge.renormalize的配置选项。如果你不熟悉Git的近5000行/人git-config的全部内容，这里有一个刷新器：.merge.renormalize会导致Git检出和签入三向合并的每个阶段。如果您正在处理的两个分支之间的行尾发生变化，这可能会很有用。这个配置过去不会被.git checkout-m命令(以及一些相关的调用)拾取，但现在它可以了！[来源]。\n在Git2.26的亮点中，我们讨论了v2协议，该协议在该版本中成为默认协议。在2.26和2.27之间，发现并修复了这个新协议中的错误(有关详细信息，请参阅4fa3f00abb)。为了安全起见，Git 2.27回到了协议“V0”，以简化过渡，并在Git 2.28中标记了这一功能实验版本。现在我们有一些机会来消除Git 2.28之后的任何挥之不去的错误，协议v2在Git 2.29中被重新启用为默认协议。[来源]。\n当试图确定错误的来源时，Git二等分是一个非常方便的工具。您标记一个“好”和“坏”端点，然后Git将引导您在端点之间进行二进制搜索，以找到导致问题的提交。在Git 2.29中，Git二等分学习了一个新的“父级优先”选项来修改在这些端点之间遍历哪些提交。理解此选项的一种方法是想象当通过合并一分为二时会发生什么。在此之前，除了合并提交本身之外，您的一分为二还将包括正在合并的分支上的提交。传递“第一父级”会告诉Git避免将仅在合并中的分支上的提交视为潜在的bug来源。如果您的工作流是这样的：只有主分支上的合并是有趣的停止点(因为您主要通过合并Pull请求来工作，并且每个单独的Pull请求可能都有可能甚至不会构建的正在进行的提交)，那么“第一父级”允许您跳过所有这些操作。\nGit可选地包括一个远程后端，用于从一个新的MediaWiki实例进行推送和拉取。它通常不受支持，并且在默认情况下不会编译，但最近发现的漏洞可能导致执行任意命令，此版本中已打了补丁。请注意，只有在对不受信任的MediaWiki实例使用mediawiki后端时，您才会受到此漏洞的影响(如果您必须问自己是否受到影响，则很可能不会)。[SOURCE]。\nGit使用低级的.git index-pack命令接收一个.git推送命令或处理一个.git获取。在Git2.29中，Git索引包学会了在多核计算机上更高效地工作，这意味着您的所有推送和读取只需升级就可以变得更快。[来源，来源]。\n当您创建合并提交时，默认消息类似于“Merge at$upstream”into$DEST“。从历史上看，合并到主分支会省略“Into$DEST”部分。Git 2.29是从dmerge.suppressDest配置中了解到的。此多值配置变量中的任何分支都会导致GIT合并程序省略“INTO$DEST”部分.[来源]。\n这只是最新版本更改的一个示例。有关更多信息，请在Git存储库中查看2.29的发行说明，或查看任何以前的版本。", "note_en": "The open source Git project  just released Git 2.29 with features and bug fixes from over 89 contributors, 24 of them new. Last time  we caught up with you, Git 2.28 had just been released. One version later, let’s take a look at the most interesting features and changes that have happened since then.\n  Git 2.29 includes experimental support for writing your repository’s objects using a SHA-256 hash of their contents, instead of using SHA-1.\n What does all of that mean? To explain, let’s start from the beginning.\n When you add files to a repository, Git copies their contents into  blob objects in its local database, and creates  tree objects that refer to the blobs. Likewise, when you run  git commit, this creates a  commit object that refers to the tree representing the committed state. How do these objects “refer” to each other, and how can you identify them when interacting with Git? The answer is that each object is given a unique name, called its  object id, based on a hash of its contents. Git uses SHA-1 as its hash algorithm of choice, and depends on the object ids of different objects to be unique.\n Back in  this blog post, we estimated that even if you had five million programmers writing one commit every second, you would only have a 50% chance of accidentally generating a collision before the Sun engulfs the Earth.  Some  published  attacks exist which use tricks that exploit weaknesses in SHA-1 that can reduce the effort required to generate a collision, but these attacks still cost tens of thousands of dollars to execute, and no known examples have been published which target Git.\n Like we stated back in that earlier blog post, Git (and providers that use it, like GitHub) checks each object it hashes to see if there is evidence that that object is part of a colliding pair. This prevents GitHub from accepting both the benign and malicious halves of the pair, since the mathematical tricks required to generate a collision in any reasonable amount of time can be detected and rejected by Git.\n Even so, any weaknesses in a cryptographic hash are a bad sign. Even though Git has implemented detections that prevent the known attacks from being carried out, there’s no guarantee that new attacks won’t be found and used in the future. So the Git project has been preparing a transition plan to begin using a new object format with no known attacks: SHA-256.\n  $  git --version git version 2.29.0$  git init --object-format=sha256 repo Initialized empty Git repository in /home/ttaylorr/repo/.git/$   cd repo$   echo   &#39;Hello, SHA-256! &#39;  &gt;README.md$  git add README.md$  git commit -m   &#34;README.md: initial commit &#34; [master (root-commit) 6e92961] README.md: initial commit  1 file changed, 1 insertion(+)  create mode 100644 README.md$  git rev-parse HEAD 6e929619da9d82c78dd854dfe237c61cbad9e95148c1849b1f96ada5ee800810\n As of version 2.29, Git can operate in either a full SHA-1 or full SHA-256 mode. It is currently not possible for repositories using different object formats to interoperate with one another, but eventual support is planned. It is also important to note that there are no major providers (including GitHub) which support hosting SHA-256-enabled repositories at the time of writing.\n In future releases, Git will support interoperating between repositories with different object formats by computing both a SHA-1 and SHA-256 hash of each object it writes, and storing a translation table between them. This will eventually allow repositories that store their objects using SHA-256 to interact with (sufficiently up-to-date) SHA-1 clients, and vice-versa. It will also allow converted SHA-256 repositories to have their references to older SHA-1 commits still function as normal (e.g., if I write a commit whose message references an earlier commit by its SHA-1 name, then Git will still be able to follow that reference even after the repository is converted to use SHA-256 by consulting the translation table).\n For more about SHA-256 in Git, and what some of the future releases might look like, you can read  Git’s transition plan.\n   When you run  git fetch origin, all of the branches from the remote  origin repository are fetched into your local  refs/remotes/origin/ hierarchy. How does Git know which branches to fetch, and where to put them?\n The answer is that your configuration file contains one or more “refspecs” for each remote (remember that a “ref” is Git’s word for any named point in history: branches, tags, etc). When you run  git clone, it sets up a default refspec to be used when you fetch from your origin repository:\n  This refspec tells Git to fetch what’s on the left side of the colon (everything in  refs/heads/; i.e., all branches) and to write them into the hierarchy on the right-hand side. The  * means “match everything” on the left-hand side and “replace with the matched part” on the right-hand side.\n You can have multiple refspecs, and they can refer to individual refs. For example, this command instructs Git to additionally fetch any  git notes from the remote (the  --add is important so that we don’t overwrite the default refspec that fetches branches):\n  Refspecs are used by  git push, as well. Even if you type only  git push origin mybranch, that last  mybranch is really a shorthand for  refs/heads/mybranch:refs/heads/mybranch. This allows you to express more complicated scenarios. Say you’re tagging and want to push all of the tags you have, but you’re not quite ready to share the tips of all of your branches. Here, you could write something like:\n  Prior to Git 2.29, refspecs could only be used to say which selection of reference(s) you want. So, if you wanted to fetch all branches except one, you’d have to list them out as arguments one by one. Of course, that assumes that you know the names of all the other references beforehand, so in practice this would look something like:\n $  git ls-remote origin   &#39;refs/heads/* &#39;  |  grep -v ref-to-exclude |  awk &#39;{ print $2:$2 }&#39; |  xargs git fetch origin\n to get all refs in  refs/heads/* except for  refs/heads/ref-to-exclude. Yeesh; there must be a better way.\n In Git 2.29, there is: negative refspecs. Now, if a refspec begins with  ^ it indicates which references are to be excluded. So, instead of the above, you could write instead something like:\n  and achieve the same result. When a negative refspec is present, the server considers a reference worth sending if it matches at least one positive refspec and does not match any negative refspecs. Negative refspecs behave exactly as you expect, with a couple of caveats:\n Negative refspecs can contain wildcard patterns, but cannot specify the destination. These wouldn’t mean anything, anyway (you wouldn’t want to say  ^refs/heads/foo/*:refs/heads/bar/* which means, literally, “map heads from  foo to  bar, but don’t send me any  foo refs to begin with”). To exclude a wildcard refspec, you’d just write  ^refs/heads/foo/*.\n While positive refspecs can refer to a single object by its object id, negative refspecs cannot.\n And of course those negative refspecs work equally well in configuration values. If you always want to fetch every branch except  foo, you can just add it to your config:\n    While you have almost certainly used (or heard of)  git log, the same might not be necessarily true of  git shortlog. For those who haven’t,  git shortlog acts a lot like  git log, except instead of displaying commits in a sequence, it groups them by the author.\n In fact, the Git release notes end with a shortlog of all of the patches in the release, broken out by their author, generated by  git shortlog [ source]. At the time of writing, they look something like this:\n Aaron Lipman (12): t6030: modernize &#34;git bisect run&#34; tests rev-list: allow bisect and first-parent flags cmd_bisect__helper: defer parsing no-checkout flag [...]Adrian Moennich (1): ci: fix inconsistent indentationAlban Gruin (1): t6300: fix issues related to %(contents:size)[...]\n In older versions of Git,  git shortlog could only group by commit author (the default behavior), and optionally by the committer identity (with  git shortlog -c). This restricts who gets the credit for a commit by who that commit’s author/committer is. So, if your project uses  the ‘Co-authored-by’ trailer (like  this commit in  git/git does), then your co-authors are out of luck: there is no way to tell  git shortlog to group commits by co-authors.\n …That is, until Git 2.29! In this release,  git shortlog learned a new  --group argument, to specify how commits are grouped and assigned credit. It takes  --group=author (the default behavior from before) and  --group=committer (equivalent to  git shortlog -c), but it also accepts a  --group=trailer:&lt;field&gt; argument.\n Passing the latter allows us to group commits by their co-authors, and it also allows for more creative uses. If your project is using the  Reviewed-by trailer, you can use  git shortlog to see who is reviewing the most patches:\n $  git shortlog -ns --group=trailer:reviewed-by v2.28.0..  | head -n5  40 Eric Sunshine  10 Taylor Blau  4 brian m. carlson  2 Elijah Newren  1 Jeff King\n git shortlog also allows multiple  --group=&lt;type&gt; arguments, in which case commits are counted once per each grouping. So, if you want to see who is  contributing the most whether that individual is the primary author, or is listed as a co-author, then you can write:\n  …putting authors and co-authors on equal footing. Instead of counting, you can also use the  --format option to find other fun ways to show the data. For example:\n $  git shortlog --format=  &#34;...helped %an on %as &#34; --group=trailer:helped-by v2.28.0..v2.29.0 Chris Torek (3):  ...helped René Scharfe on 2020-08-12  ...helped René Scharfe on 2020-08-12  ...helped René Scharfe on 2020-08-12 David Aguilar (1):  ...helped Lin Sun on 2020-05-07 Denton Liu (1):  ...helped Shourya Shukla on 2020-08-21 Derrick Stolee (2):  ...helped Taylor Blau on 2020-08-25  ...helped Taylor Blau on 2020-09-17 [...]\n   git for-each-ref learned a few new tricks in Git 2.29. Since there are a good handful of them, let’s start there:\n git for-each-ref usually outputs the name, type, and object id of each ref, but you can find out a lot more with its   --format option. Git 2.29 learned some new fields, including  contents:size,  subject:sanitize, and more consistent  :short modifiers to get abbreviated object ids. These last few were contributed by  Hariom Verma, a Google Summer of Code student working on the Git project.[ source,  source]\n git for-each-ref can now take multiple  --merged and  --no-merged arguments, printing references if they are reachable from at least one  --merged argument, and aren’t reachable from any  --no-merged ones.[ source]\n Now with all of the  git for-each-ref updates out of the way, let’s move on to all of the rest of the tidbits:\n When your  git merge results in a merge conflict, you’re greeted by a message that looks something like the following (this example is  courtesy of Elijah Newren):  CONFLICT (rename/delete): foo.c deleted in b01dface... Removedunnecessary stuff and renamed in HEAD. Version HEAD of foo.c leftin tree.\n Can you tell what this message means? In versions of Git prior to 2.29, it was ambiguous: did Git remove stuff and rename files in  HEAD, or is “Removed unnecessary stuff” the name of a commit message? It turns out that it’s the latter, but you had no way of knowing that!\n In 2.29, Git will now enclose the subject of a commit message in parenthesis, making much clearer what part of the conflict message came from a commit, and what part was generated by Git.\n Here’s an easy one! Git supports a configuration option called  merge.renormalize. In case you’re not familiar on the entirety of Git’s  nearly 5,000 line  man git-config, here’s a refresher:  merge.renormalize causes Git to check-out and check-in each stage of a three-way merge. This can be useful if the line-endings change between two branches you’re working on.This configuration used to not get picked up by  git checkout -m (and a few related invocations), but now it is![ source]\n In our highlights from Git 2.26, we talked about  protocol v2, which became the default in that release. Between 2.26 and 2.27, a bug in this new protocol was found and fixed (see   4fa3f00abb for the juicy details). For safety,  Git 2.27 went back to protocol “v0” to ease back the transition, and  marked the feature experimental in Git 2.28.Now that we’ve had a few chances to iron out any linger bugs after Git 2.28, protocol v2 is re-enabled as the default protocol in Git 2.29.[ source]\n git bisect is an incredibly handy tool to use when trying to determine the source of a bug. You mark a “good” and “bad” endpoint, and then Git leads you through a binary search between the endpoints to find the commit that introduced the problem.In Git 2.29,  git bisect learned a new  --first-parent option to modify which commits are traversed between those endpoints. One way to understand this option is to imagine what happens when bisecting through a merge. Before, your bisection would include commits on the branch being merged in, in addition to the merge commit itself.Passing  --first-parent tells Git to avoid considering commits that are only on the branch being merged in as a potential source of the bug. If your workflow is such that only the merges on the main branch are interesting stopping points (because you primarily work by merging pull requests, and each individual pull request may have work-in-progress commits that might not even build), then  --first-parent lets you skip all that.\n Git optionally includes a remote backend for pushing and pulling from a  MediaWiki instance. It is generally unsupported and not compiled by default, but a recently discovered vulnerability can lead to arbitrary command execution, which has been patched in this release.Note that you are only affected by this vulnerability if you use the mediawiki backend against an untrusted MediaWiki instance (chances are if you have to ask yourself whether or not you are affected, you probably aren’t).[ source]\n Git uses the low-level  git index-pack command to receive a  git push or process a  git fetch. In Git 2.29,  git index-pack learned to work more efficiently on multi-core machines, which means all of your pushes and fetches should get faster just by upgrading.[ source,  source]\n When you create a merge commit, the default message reads something like “Merge  $upstream into  $dest“. Historically, merges into the main branch would omit the “into  $dest” part.Git 2.29 learned  the  merge.suppressDest configuration. Any branch in this multi-valued config variable will cause  git merge to omit “into  $dest” part.[ source]\n  That’s just a sample of changes from the latest release. For more, check out  the release notes for 2.29, or  any previous version in  the Git repository.", "posttime": "2020-10-20 03:23:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "git", "title": "Git 2.29亮点", "title_en": "Git 2.29 Highlights", "transed": 1, "url": "https://github.blog/2020-10-19-git-2-29-released/", "via": "", "real_tags": ["git"]}, {"category": "", "categoryclass": "", "imagename": "9408d590fdc384d3adba9eaa4525abd3.jpg", "infoid": 1029887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着总统大选的临近，拥有5900万美国自由职业者的自由职业者的未来是这些工人的一个关键担忧。\n拜登在他的竞选网站上表达了对保护组织权(PRO)法案的支持。\nPRO法案将使用与加州AB-5法律相同的三管齐下的ABC测试来决定谁是全国范围内的自由职业者。\nAB-5将承包商归类为员工，这使得自由职业者很难为所在行业的企业工作。\n随着总统大选的临近，来自马萨诸塞州查尔斯敦的自由撰稿人卡罗琳·博思韦尔(Carolyn Bothwell)一直在听取她创办的自由职业者社区自由职业者社区(Freelance Founders)中忧心忡忡的成员关于选举结果可能对他们的业务意味着什么的意见。\n一些人想知道，民主党候选人副总统乔·拜登(Joe Biden)公开支持加州工会支持的AB-5法案，对他们的企业未来意味着什么。AB-5法案旨在通过赋予拼车司机全职员工的地位和保护，防止他们被错误分类。AB-5在2020年1月1日生效后不得不反复修改，因为它让这么多其他类型的自由职业者失业。博思韦尔说，他们真的很担心这一点。这是因为拜登--历史上一直是工会的支持者--想要一部类似于AB-5的联邦法律，这可能会对谁可以成为自由职业者施加严格的限制。\n随着越来越多的美国自由职业者比以往任何时候都多，随着总统选举的临近，自由职业工作的未来对一些工人来说是一个关键问题。最近Upwork的一项名为自由职业前进2020的调查发现，2019年有5900万美国人从事某种形式的自由职业，比前一年增加了200万。\n全国各地的许多自由职业者一直在关注有关AB-5的头条新闻。2020年1月1日生效的这项法律旨在解决零工经济中的不公平问题，包括Lyft和优步(Uber)等拼车公司的独立承包商政策。它假设该州的每个工人都是雇员，除非雇主能使用严格的ABC测试证明不是这样。这项测试的基础是严格的ABC测试。\n测试的B-Pong表示，要被视为承包商，工人必须从事招聘公司通常业务流程之外的工作-这使得许多自由职业者更难或不可能在自己所在的行业为客户工作。包括纽约州和新泽西州在内的其他州也考虑过类似的措施，到目前为止都没有成功。\n加州一家上诉法院本周一直在听取优步(Uber)和Lyft的律师的辩论，他们试图推翻下级法院的一项裁决，该裁决称，他们必须将司机重新归类为员工。\n除了拼车司机，AB-5还将许多其他类型的自由职业者纳入了它的网中，这让一些雇主决定不从该州雇佣自由职业者，并引发了那些没有获得豁免的分拆领域的自由职业者的强烈抗议。这部法律现在已经修改了很多次，为100多个行业提供了豁免。研究独立劳动力的Emergent Research合伙人史蒂夫·金(Steve King)表示，修复工作可能会继续下去。他说，这本书仍然写得令人困惑。\n在选举日，加州居民现在将被要求对22号提案进行投票，这是一项将推翻AB-5的投票措施，得到了一群拼车和零工经济公司的支持，这些公司正在投资超过1.8亿美元来击败该提案。22号提案将认为拼车司机是独立的承包商，而不是员工或代理人。投票倡议还将要求基于APP的拼车公司提供保证的最低工资，医疗福利补贴，工作场所受伤的医疗和残疾保险，以及针对骚扰和歧视的额外保护。金说，它实际上创造了第三类工人。\n拜登反对22号提案。在5月26日的一条推文中，也就是他得到AFL-CIO支持的同一天，他敦促加州人在这个问题上投反对票。\n与此同时，其他州的自由职业者担心的是，拜登已经表达了对保护组织权(PRO)法案的支持，他在推特上表示，他将在9月9日签署该法案。7并在他的竞选网站上表示支持拜登加强工人组织、集体谈判和工会的计划。PRO法案将使用与AB-5相同的三管齐下的ABC测试来决定谁是全国范围内的自由职业者。\n得到民主党人大力支持的PRO法案将削弱各州的工作权法律，这些州允许员工选择退出工会并支付工会会费。它还赋予国家劳动关系委员会(National Labor Relations Board)对报复工人组织的公司处以罚款的能力，并将集体谈判权给予许多现在没有集体谈判权的工人。\n卡车司机总经理吉姆·霍法(Jim Hoffa)在一篇博客文章中指出，他支持这项立法：工人的错误分类正在上升，太多的美国工薪阶层正在崩溃。\n一些自由职业者非常担心如果PRO法案与ABC测试一起通过会发生什么，以至于这会影响他们对候选人的选择。来自新泽西州长谷的自由撰稿人金·卡文(Kim Kavin)表示：在这个问题上，我的投票是100%，因为我们谈论的是我收入的100%。她与人共同创立了一个名为Fight for Freelancers NJ的Facebook小组，反对一项类似于新泽西州提出的AB-5的法律，但没有通过投票。尤其是在我们目前面临的经济形势下，我想继续谋生。\n拜登竞选团队没有回应就候选人在AB-5和PRO法案上的立场发表评论的请求。然而，在他的网站上关于加强工人组织的计划中，拜登表示，如果当选，他将通过故意将员工错误归类为独立承包商，积极追查违反劳动法、参与工资盗窃或骗税的雇主。\n声明接着说，作为总统，拜登将制止雇主故意将员工错误归类为独立承包商。他将制定立法，根据所有联邦劳动法、就业法和税法，将工人错误分类定为实质性违法行为，并在对其他违规行为施加的处罚之外增加处罚。而且，他将在奥巴马-拜登政府的努力基础上再接再厉，推动一项咄咄逼人的、全力以赴的执法努力，这将极大地减少工人的错误分类。\n他将指示美国劳工部参与有意义的协作执法伙伴关系，包括与国家劳动关系委员会(NLRB)、平等就业机会委员会、国税局、司法部以及州税收、失业保险和劳工机构的合作。而且，虽然特朗普通过破坏执法机构并大幅削减他们的调查人员队伍来削弱执法力度，但拜登将为大幅增加劳动和就业执法机构的调查人员数量提供资金，以促进大规模的反错误分类努力。\n特朗普政府也对工人分类采取了立场。劳工部在9月份提出了一项新的规则，根据公平劳动标准法案澄清员工和独立承包商的地位。它将采用一项经济现实测试，考察工人是自己创业，还是在经济上依赖雇主工作。他们是否为自己做生意的决定将取决于工人对工作的性质和控制程度，以及基于主动性和投资的盈亏机会。\n分析还将考察这项工作所需的技能数量、工人与招聘实体之间工作关系的永久性程度，以及这项工作是否是一个综合生产单位。该规则的30天评议期将于2020年10月26日结束。这项分析还将考察这项工作所需的技能水平、工人与招聘实体之间的工作关系的永久性程度，以及这项工作是否是一个一体化的生产单位。该规则的30天评议期将于2020年10月26日结束。\n在自由职业者联盟，执行董事拉斐尔·埃斯皮纳说，需要更多关于自由职业者生计将如何受到影响的教育，如果支持法案按成文推进。尽管该组织的成员倾向于民主党人，但埃斯皮纳说，许多自由职业者通常感觉不到任何一个政党的代表。\n埃斯皮纳说，那些意识到加州AB-5负面影响的人非常担心下一任总统对他们的行业意味着什么。\n自由职业者联盟一直在积极接触立法者，以确保他们意识到PRO法案对其成员的潜在影响。9月9日。10日，自由职业者联盟与参议院少数党领袖查克·舒默(D-NY)举行了一次市政厅会议，该组织在会上提出了对亲法案的担忧。埃斯皮纳说，他承诺与我们合作，确保我们不会在联邦层面上得到与加州相同的结果。\n埃斯皮纳说，我们正在尽最大努力与立法者建立沟通渠道，帮助我们指导PRO法案和任何类似的立法，使自由职业者不受其负面影响。我们也在努力创造一个空间来提高人们的意识，这样自由职业者的声音就可以被听到，立法者可以听到这样的法律是如何损害自由职业劳动力的。我们希望很快就能在围绕PRO法案和州一级的任何类似立法的对话中发挥更积极的作用。\n随着大流行的要求，许多人失去工作或被迫寻找更灵活的工作安排，工人分类问题在未来几年可能会变得更加重要。\n埃斯皮纳说，考虑到之前的趋势，我预计疫情爆发后，自由职业者的数量将会增长。2008年后，决定成为自由职业者的人数大幅增加。对许多人来说，无论书上有什么关于自由职业者如何分类的法律，都将决定独立谋生的难易程度。", "note_en": "With 59 million Americans freelancing, the future of freelance work is a key concern for these workers as the presidential election approaches.\n Biden has expressed support for the Protecting the Right to Organize (PRO) Act on his campaign website.\n The PRO Act would use the same three-pronged ABC test as California&#39;s AB-5 law to decide who is a freelancer nationwide.\n AB-5 classifies contractors as employees and makes it hard for freelancers to work for businesses in their industry.\n With the presidential election coming, Carolyn Bothwell, a freelance copywriter from Charlestown, Massachusetts, has been hearing from concerned members of the freelancer community she started, Freelance Founders, about what the results may mean for their business.\n Some are wondering what Democratic candidate Vice President  Joe Biden&#39;s public support for AB-5, a union-backed California law, aimed at preventing the misclassification of rideshare drivers by giving them the status and protections of full-time employees, means for the future of their businesses. AB-5 had to be modified repeatedly after taking effect on Jan. 1, 2020, because it was putting so many other types of freelancers out of work. &#34;They are really worried about it,&#34; says Bothwell. That&#39;s because Biden -- historically a supporter of unions -- wants a federal law similar to AB-5 that could place steep restrictions on who can be a freelancer.\n  With more Americans freelancing than ever before, the future of freelance work is a key concern for some workers as the presidential election approaches. A recent Upwork survey,  Freelance Forward 2020, found that 59 million Americans did some form of freelancing in 2019, up 2 million from the year before.\n Many freelancers across the nation have been keeping an eye on headlines about AB-5. The law that took effect on Jan. 1, 2020 is an attempt to address inequities in the gig economy including the independent contractor policies of ride-sharing companies such as Lyft and Uber. It assumes that every worker in the state is an employee unless employers can prove otherwise using the rigorous &#34;ABC test&#34; it is based on.\n The B-prong of the test says that to be considered a contractor, a worker must perform work that is outside of the usual course of business for the hiring company — making it harder or impossible for many freelancers to work for clients in their own industry. Similar measures have been considered in other states, including New York and New Jersey, so far unsuccessfully.\n A California Appeals Court has been hearing arguments this week by lawyers for  Uber and  Lyft as they try to overturn a lower court ruling that said they had to reclassify their drivers as employees.\n In addition to rideshare drivers, AB-5 swept many other types of freelancers into its net, making some employers decide not to hire freelancers from the state and prompting a heated outcry from freelancers in fields that did not get carve-outs that exempted them. The law has now been amended so many times it offers exemptions for more than 100 industries. The fixes are likely to continue, says Steve King, partner in Emergent Research, which studies the independent workforce. &#34;It&#39;s still really confusingly written,&#34; he says.\n  On Election Day, California residents will now be asked to vote on  Proposition 22, a ballot measure that would overturn AB-5, backed by a group of rideshare and gig economy companies that are investing more than $180 million in defeating it. Proposition 22 would deem rideshare drivers to be independent contractors, rather than employees or agents. The ballot initiative would also require app-based rideshare companies to provide a guaranteed minimum wage, a subsidy for health benefits, medical and disability coverage for workplace injuries, and added protection against harassment and discrimination. &#34;It effectively creates a third category of worker,&#34; says King.\n Biden has opposed Proposition 22. In a tweet on May 26, the same day he was endorsed by the AFL-CIO, he urged Californians to vote no on this issue.\n  What concerns freelancers in other states, in the meantime, is that Biden has expressed support for the Protecting the Right to Organize (PRO) Act, tweeting that he would sign it on Sept. 7 and expressing his support in the  Biden Plan for Strengthening Worker Organizing, Collective Bargaining and Unions on his campaign website. The PRO Act would use the same three-pronged ABC test as AB-5 to decide who is a freelancer nationwide.\n The PRO Act, heavily supported by Democrats, would weaken right-to-work laws in states that let employees opt out of participating in unions and paying union dues. It also gives the National Labor Relations Board the ability to fine companies that retaliate against workers for organizing and give collective bargaining rights to many workers who do not have them now.\n Jim Hoffa, the Teamsters general president, noted his support of the legislation in a  blog post: &#34;The misclassification of workers is on the rise and too many working Americans are falling through the cracks.&#34;\n Some freelancers are so fearful of what would happen if the PRO Act were enacted with the ABC test that this is affecting their choice of candidates. &#34;My vote is 100% on this issue because we are talking about 100% of my income,&#34; says Kim Kavin, a freelancer writer from Long Valley, New Jersey. She co-founded a Facebook group called Fight for Freelancers NJ to oppose a law similar to AB-5 that was proposed in New Jersey but did not make it to a vote. &#34;Especially in the current economic situation we face, I want to keep earning a living.&#34;\n  The Biden campaign did not respond to a request for comment on the candidate&#39;s positions on AB-5 and the PRO Act. However, in the plan for strengthening worker organizing on his website, Biden says that if elected, he will  &#34;aggressively pursue employers who violate labor laws, participate in wage theft, or cheat on their taxes by intentionally misclassifying employees as independent contractors.&#34;\n  &#34;As president, Biden will put a stop to employers intentionally misclassifying their employees as independent contractors,&#34; the statement goes on to say. &#34;He will enact legislation that makes worker misclassification a substantive violation of law under all federal labor, employment, and tax laws with additional penalties beyond those imposed for other violations. And, he will build on  efforts by the Obama-Biden Administration to drive an aggressive, all-hands-on-deck enforcement effort that will dramatically reduce worker misclassification.\n He will direct the U.S. Department of Labor to engage in meaningful, collaborative enforcement partnerships, including with the National Labor Relations Board (NLRB), the Equal Employment Opportunity Commission, the Internal Revenue Service, the Justice Department, and state tax, unemployment insurance, and labor agencies. And, while Trump has weakened enforcement by sabotaging the enforcement agencies and  slashing their investigator corps, Biden will fund a dramatic  increase in the number of investigators in labor and employment enforcement agencies to facilitate a large anti-misclassification effort.&#34;\n  The  Trump administration has also taken a position on worker classification. The Department of Labor in September proposed a  new rule to clarify employee and independent contractor status under the Fair Labor Standards Act. It would adopt an &#34;economic reality&#34; test that looks at whether workers are in business for themselves or are economically dependent on the employer for work. The determination of whether they are in business for themselves would depend on the nature and degree of the workers&#39; control over the work and the opportunity for profit and loss based on initiative and investment.\n The analysis would also look at the amount of skill required for the work, the degree of permanence of the working relationship between the worker and the hiring entity, and whether the work is an &#34;integrated unit of production.&#34;  The 30-day comment period on the rule ends on Oct. 26, 2020.\n At the Freelancers Union, executive director Rafael Espinal says there needs to be more education about how freelancers&#39; livelihood will be affected if the PRO Act moves forward as written. Although the group&#39;s membership leans Democrat, Espinal says many freelancers generally don&#39;t feel represented by either party.\n  &#34;Those who are aware of the negative impacts of AB-5 in California are extremely concerned about what the next presidency can mean for their industry,&#34; says Espinal.\n  The Freelancers Union has been actively reaching out to legislators to make sure they are aware of the potential impact of the PRO Act on its members. On Sept. 10, the Freelancers Union held a town hall with Senate Minority Leader  Chuck Schumer (D-NY), where the group raised concerns about the PRO Act. &#34;He committed to working with us and making sure we don&#39;t have the same outcome that came out of California at the federal level,&#34; says Espinal.\n  &#34;We are doing our best to build lines of communication with legislators that can help us guide the PRO Act and any similar legislation to a point where freelancers are not negatively impacted by it,&#34; says Espinal. &#34;We also are working on creating a space to raise awareness so freelancers&#39; voices can get heard and legislators can hear how laws like this have been detrimental to the freelance workforce. We hope to get to a point soon in which we are playing a more active role in the conversations around the PRO Act and any similar legislation on the state level.&#34;\n With many people losing jobs or forced to find more flexible work arrangements by the demands of the pandemic, the issue of worker classification is likely to increase in importance in the next few years.\n &#34;I expect the number of freelancers to grow after pandemic, given previous trends,&#34; says Espinal. &#34;After 2008, there was a huge increase in the number of people who decided to go freelance.&#34; And for many, whatever laws are on the books about how they are classified will determine how easy, or difficult, it is to earn a living independently.", "posttime": "2020-10-20 03:23:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "总统,freelancers,自由职业者", "title": "为什么数百万自由职业者担心拜登担任总统可能会让他们失业", "title_en": "Why millions of freelancers fear a Biden presidency may put them out of work", "transed": 1, "url": "https://www.cnbc.com/2020/10/17/why-freelancers-fear-a-biden-presidency-may-put-them-out-of-work.html", "via": "", "real_tags": ["总统", "自由职业者"]}, {"category": "", "categoryclass": "", "imagename": "e97dc2604431799091f36feaeb7fbdc3.jpeg", "infoid": 1029886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "六名男子被控实施了一些世界上最具破坏性的黑客攻击，包括NotPetya圆盘刮水器和导致数十万乌克兰人断电的电网攻击，这些人已在美国联邦法院被起诉。这六名男子被控实施了世界上一些最具破坏性的黑客攻击，包括NotPetya磁盘刮水器和导致数十万乌克兰人断电的电网攻击。\n起诉书称，这六名男子都是一个厚颜无耻的黑客组织的官员，该组织最为人所知的名字是沙虫，该组织代表俄罗斯主要情报局74455部队工作，该部队在俄语中的缩写为GRU。检察官说，这些官员是有史以来最具破坏性和破坏性的一系列计算机攻击的幕后黑手，这些攻击被认为是单一组织所为。所谓的目标是：破坏外国的稳定，干涉他们的内政，造成金钱损失。\n2017年的磁盘擦除蠕虫NotPetya就是其中之一，它关闭了世界各地数千家公司和政府机构的运营。NotPetya伪装成勒索软件，实际上是永久破坏数PB数据的恶意软件。结果，除其他外，医院拒绝病人，航运公司陷入瘫痪数天或数周，以及交通基础设施无法发挥作用。\n受到攻击的包括宾夕法尼亚州遗产谷医疗系统(Heritage Valley Health System)的医院和其他医疗设施；联邦快递公司(FedEx Corporation)的子公司TNT Express BV；以及一家美国大型制药公司，它们在攻击中总共遭受了近10亿美元的损失。美国情报机构很久以前就确定GRU是这次袭击的幕后黑手，但周一是第一次对其提出指控。\n乌克兰政府和关键基础设施：2015年12月至2016年12月期间，使用名为BlackEnergy、Industroyer和KillDisk的恶意软件对乌克兰电网、财政部和国家财政部进行破坏性恶意软件攻击。\n法国大选：2017年4月和5月，针对法国总统伊曼纽尔·马克龙的鱼叉式网络钓鱼运动和相关的黑客泄密活动，目标是2017年法国大选前的政党、法国政客和法国地方政府；\n平昌冬奥会东道主、参与者、合作伙伴和与会者：2017年12月至2018年2月，针对韩国公民和官员、奥运会运动员、合作伙伴和游客以及国际奥委会(IOC)官员的鱼叉式网络钓鱼活动和恶意移动应用程序；\n平昌冬奥会IT系统(奥运驱逐舰)：2017年12月至2018年2月，利用被称为奥运驱逐舰的恶意软件，入侵支持2018年平昌冬奥会的计算机，最终在2018年2月9日，对开幕式进行破坏性恶意软件攻击；\n诺维乔克中毒调查：2018年4月，针对禁止化学武器组织(Organization For The Prohibition Of Chemical Weapons)和英国国防科技实验室(Defense Science And Technology Laboratory)对谢尔盖·斯克里帕尔(Sergei Skripal)、他的女儿谢尔盖·斯克里帕尔(Sergei Skripal)和几名英国公民的神经毒剂中毒事件进行的鱼叉式钓鱼活动进行了调查；以及。\n格鲁吉亚公司和政府实体：2018年针对一家主要媒体公司的鱼叉式网络钓鱼运动，2019年危害议会网络的努力，以及2019年广泛的网站污损运动。\n·对格鲁吉亚议会官方域名进行了技术侦察，并试图未经授权进入其网络。\n这六名男子每人都被控七项合谋进行计算机欺诈和滥用、合谋实施电信欺诈、电信欺诈、损坏受保护的计算机和严重盗用身份的罪名。\n检察官在起诉书中写道，阴谋的目的是为了俄罗斯的战略利益，通过未经授权访问(黑客)受害者的电脑，部署破坏性恶意软件，并采取其他破坏性行动。为了推进这一阴谋，Andrienko、Detistov、Frolov、Kovalev、Ochichenko、Pliskin和其他大陪审团已知和未知的人采购、维护和利用服务器、电子邮件帐户、恶意移动应用程序和相关的黑客基础设施，以从事针对受害者使用的计算机的鱼叉式网络钓鱼活动和其他网络入侵方法。\n检察官还表示，其中四名男子开发并部署了世界各地使用的破坏性恶意软件。", "note_en": "Six men accused of carrying out some of the world&#39;s most destructive hacks—including the NotPetya disk wiper and power grid attacks that knocked out electricity for hundreds of thousands of Ukrainians—have been indicted in US federal court.\n The indictment said that all six men are officers in a brazen hacker group best known as Sandworm, which works on behalf of Unit 74455 of the Russian Main Intelligence Directorate, abbreviated from Russian as GRU. The officers are behind the &#34;most disruptive and destructive series of computer attacks ever attributed to a single group,&#34; prosecutors said. The alleged goal: to destabilize foreign nations, interfere with their internal politics, and cause monetary losses.\n Among the hacks is NotPetya, the 2017 disk-wiping worm that  shut down the operations of thousands of companies and government agencies around the world. Disguised as ransomware, NotPetya was in fact malware that permanently destroyed petabytes of data. The result, among other things, was hospitals that turned away patients, shipping companies that were paralyzed for days or weeks, and transportation infrastructure that failed to function.\n Those hit by the attack included hospitals and other medical facilities in the Heritage Valley Health System (&#34;Heritage Valley&#34;) in Pennsylvania; a FedEx Corporation subsidiary, TNT Express BV; and a large US pharmaceutical manufacturer, which together suffered nearly $1 billion in losses from the attacks. US intelligence long ago determined the GRU was behind the attack, but Monday is the first time charges have been filed in connection with it.\n  Ukrainian Government &amp; Critical Infrastructure: December 2015 through December 2016 destructive malware attacks against Ukraine&#39;s electric power grid, Ministry of Finance, and State Treasury Service, using malware known as BlackEnergy, Industroyer, and KillDisk;\n French Elections: April and May 2017 spear-phishing campaigns and related hack-and-leak efforts targeting French President Emmanuel Macron&#39;s &#34;La République En Marche!&#34; (&#34;En Marche!&#34;) political party, French politicians, and local French governments prior to the 2017 French elections;\n PyeongChang Winter Olympics Hosts, Participants, Partners, and Attendees: December 2017 through February 2018 spear-phishing campaigns and malicious mobile applications targeting South Korean citizens and officials, Olympic athletes, partners, and visitors, and International Olympic Committee (&#34;IOC&#34;) officials;\n PyeongChang Winter Olympics IT Systems (Olympic Destroyer): December 2017 through February 2018 intrusions into computers supporting the 2018 PyeongChang Winter Olympic Games, which culminated in the February 9, 2018, destructive malware attack against the opening ceremony, using malware known as Olympic Destroyer;\n Novichok Poisoning Investigations: April 2018 spear-phishing campaigns targeting investigations by the Organisation for the Prohibition of Chemical Weapons (&#34;OPCW&#34;) and the United Kingdom&#39;s Defence Science and Technology Laboratory&#39;s (&#34;DSTL&#34;) into the nerve agent poisoning of Sergei Skripal, his daughter, and several UK citizens; and\n Georgian Companies and Government Entities: a 2018 spear-phishing campaign targeting a major media company, 2019 efforts to compromise the network of Parliament, and a wide-ranging website defacement campaign in 2019.\n  · Conducted technical reconnaissance of the Parliament of Georgia official domain and attempted to gain unauthorized access to its network.\n All six men are each charged with seven counts of conspiracy to conduct computer fraud and abuse, conspiracy to commit wire fraud, wire fraud, damaging protected computers, and aggravated identity theft.\n &#34;The object of the conspiracy was to deploy destructive malware and take other disruptive actions, for the strategic benefit of Russia, through unauthorized access (&#39;hacking&#39;) of victim computers,&#34; prosecutors wrote in the indictment. &#34;In furtherance of the conspiracy, Andrienko, Detistov, Frolov, Kovalev, Ochichenko, Pliskin, and others known and unknown to the grand jury procured, maintained, and utilized servers, email accounts, malicious mobile applications, and related hacking infrastructure to engage in spearphishing campaigns and other network intrusion methods against computers used by the victims.&#34;\n The prosecutors also said that four of the men developed and deployed destructive malware used around the world.", "posttime": "2020-10-20 03:09:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,黑客,犯有,accused", "title": "六名被控犯有世界上最具破坏性的黑客事件的俄罗斯人被起诉", "title_en": "Six Russians accused of the world’s most destructive hacks indicted", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/six-russians-accused-of-the-worlds-most-destructive-hacks-indicted/", "via": "", "real_tags": ["俄罗斯", "黑客", "犯有", "accused"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "漫威娱乐宣布，它将把粉丝选择在其数字订阅漫威无限上阅读新闻稿的等待时间减半，图书在印刷发行仅三个月后就出现在该服务上。更改立即生效。\n漫威无限于2007年推出，并提供对出版商的数字图书图书馆的访问-目前已有超过2.7万期-每月或每年的订阅费。这项服务以iOS、Android和网络应用的形式提供。\n此举正值之前六个月的窗口期意味着漫威无限的发行时间表与出版商因COVID在4月和5月暂时暂停发行的时间不谋而合。通过将6个月的窗口缩短为3个月，基本上避免了暂停。\n在此之前，DC上个月宣布了自己的DC宇宙无限数字订阅服务，现有的DC宇宙多媒体应用将转变为数字漫画订阅服务，并在印刷发行六个月后发布。\n漫威新媒体营销副总裁杰西卡·马洛伊在一份声明中表示：“自今年年初以来，我们已经看到我们的故事在漫威无限上的阅读量达到了数千万次，我们看到越来越多的粉丝现在希望深入了解更多他们最喜欢的故事，包括蜘蛛侠、美国队长、漫威队长、黑豹、X战警等等，”漫威新媒体营销副总裁杰西卡·马洛伊(Jessica Malloy)在一份声明中表示。“漫威无限版的这一扩展恰恰提供了这样的效果：粉丝们现在可以更快地阅读更多他们最喜欢的漫画！没有其他服务可以在一个地方提供这样的价值和访问如此多的漫威漫画。我们很高兴现在能够为读者提供更多内容。“。\n是的，我想收到“好莱坞报道”发来的电子邮件，介绍他们觉得我可能感兴趣的最新新闻、产品和事件。", "note_en": "Marvel Entertainment has announced that it is halving the wait time for fans choosing to read releases on its digital subscription Marvel Unlimited, with titles now appearing on the service just three months after print release. The change takes effect immediately.\n Marvel Unlimited launched in 2007, and offers access to the publisher’s digital library of titles — currently numbering more than 27,000 issues — for either a monthly or annual subscription fee. The service is available as an iOS, Android and web app.\n    The move comes at a time when the previous six-month window had meant that Marvel Unlimited’s release schedule had coincided with the publisher’s temporary release suspension in April and May due to COVID. By cutting the six-month window to three months, the suspension is essentially avoided.\n  The announcement also follows DC’s  announcement of its own DC Universe Infinite digital subscription service last month, which will see the existing DC Universe multimedia app transformed into a digital comic subscription service with releases appearing six months after print release.\n  “Since the beginning of the year, we’ve seen our stories read tens of millions of times on Marvel Unlimited, and we’ve seen a rising number of fans now looking to dive into more of their favorite stories featuring Spider-Man, Captain America, Captain Marvel, Black Panther, the X-Men, and more,” Jessica Malloy, Marvel New Media VP of marketing, said in a statement. “This expansion for Marvel Unlimited delivers exactly that: fans can now read more of their favorite comics sooner! No other service can provide this kind of value and access to so many Marvel comics in one place. We’re thrilled to now be able to offer even more to readers.”\n    Yes, I want to receive emails from The Hollywood Reporter about the latest news, products and events that they feel might be of interest to me.", "posttime": "2020-10-20 03:06:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "缩短,shortens,漫威", "title": "漫威缩短纸质漫画和数字漫画之间的窗口", "title_en": "Marvel Shortens Window Between Print and Digital Comics", "transed": 1, "url": "https://www.hollywoodreporter.com/heat-vision/marvel-shortens-window-between-print-and-digital-comics", "via": "", "real_tags": ["缩短", "shortens", "漫威"]}, {"category": "", "categoryclass": "", "imagename": "c0f7f9cc7df50886b35d7a29bd4bf4d8.png", "infoid": 1029884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的解释、模式匹配和翻译信息的能力是非凡的，这有助于我们在生活和工作中发挥作用。然而，在进行一场艰难的谈话时，这种过早的分析可能会伤害我们。\n例如，如果你的队友问，“有没有办法更快地完成这个项目？”你可能会认为这意味着“你走得太慢了”，或者我不相信你已经想清楚了。\n或者，如果你的室友说，“我觉得我最近一直在做所有的家务”，你可能会在内心反对，“那不是真的！”今天早上我洗了碗！“。\n一个无害的问题可能会升级为一系列误解，让我们感到受到攻击或被忽视。在大多数情况下，这些反应是潜移默化地发生的，我们会感到不舒服或防御性，而不知道自己是如何做到这一点的。\n没有简单的方法来打破(暂停)这一非常自然、非常人性化的解释循环，但如何倾听并达成相互理解的问题是有答案的。这个答案是转述的。\n释义就是分享你用自己的话对所听到的内容的解释。\n释义会鼓励你注意说话人在说什么，因为你需要把它重复给他们听。\n释义可以让说话者在听到镜像回给他们的信息后改正他们自己的信息。\n设定意图，在谈话开始时解释说话人所说的话。如果你不能解释他们说的话，请他们重复一遍。\n我：我明白了，所以你想让我………。对不起，您能重复一遍吗？\n我：你想让我把这个季度的产品路线图寄过来。好的，我会的！\n请演讲者重复他们说的话是可以的。你不需要第一次就把它做对，你只需要把它做对就行了。\n存在于你头脑中的软件与存在于说话者头脑中的软件不同。给演讲者一个与你合作的机会，以获得正确的解释。\n队友：“我注意到你最近在项目会议上没有注意。你介意多参加吗？“。\n释义：“你已经注意到我在开会时不专心，而你想让我更多地参与？”\n队友：“不，你在大多数会议中都要专心。我只注意到你们在我们每天的项目会议上没有注意到这一点。“\n沟通并不容易，有时很难在第一次就做对。给演讲者一个修改他们所说内容的机会。\n释义是：“你很难理解我在做什么。我应该给你更多的最新消息吗？“。\n经理：“事实上，我知道你在做什么。我只是不能理解这个项目是否还能赶得上最后期限。“。\n队友：“当我在解释一些事情时，你打断了我的话，这让我觉得我的意见无关紧要。”\n非释义：“我没有意识到我在做这件事，对不起。”\n释义：“我已经打断你几次了，这让你觉得我不重视你的意见。我没意识到我在这么做。对不起。“。\n迈克尔·施莱纳在“需要被理解”一书中指出，“似乎总是潜伏在背景中的潜意识恐惧是，如果我们不被理解，就好像我们从未存在过一样。”\n转述的反应感觉更好，因为它传达了理解，从而证实了我们的存在。当我们感到被理解时，我们就会感到安全。\n释义还能让你更容易认出并回应说话者在反馈给你的信息中表达的话语和感受。\n队友：“当我在解释一些事情时，你打断了我的话，这让我觉得我的意见无关紧要。”\n释义：“我已经打断你几次了，这让你觉得我不重视你的意见。我没意识到我在这么做。我很重视你的意见。对不起。“。\n“对劳资谈判的研究表明，如果每个谈判者在回应之前都同意准确地重复前一位发言者所说的话，那么达成冲突解决所需的时间就会减少一半。”-马歇尔·B·罗森伯格(Marshall B.Rosenberg)在“非暴力沟通”(Non Violent Communication)中写道。\n释义可以最大限度地减少误解。在谈话结束时，您和演讲者将带着相同的解释离开，这将减少后续工作的需要。\n彼得：“嗨，你今天晚上想要TPS报告。你说的TPS是指茶党规格吗？“。\n彼得：“你想让我今天晚上把茶会说明书寄给你吗？”\n释义在专业环境中很有用，但在个人环境中可能是无价的。\n我们越是关心与我们交谈的人，我们就越需要被他们理解，也越害怕被他们看不见。\n当与朋友或家人进行情绪激动的谈话时，转述一下，让他们感觉被看到了。\n释义：“你感到沮丧、疲惫和悲伤。我是为你而来的。“。\n解释一下没有什么坏处，就像在考试中仔细检查答案一样没有坏处，但并不是在每种情况下都能增加价值。\n在释义时，请记住您使用的语气很重要。没有一个适用于所有情况的语气，但作为一般的指导方针，使用奇怪的语气而不是陈述性的语气，绝对要避免任何听起来有点讽刺的语气。\n你的语气应该传达出澄清和理解演讲者所说的话的愿望。如果你没有这个愿望，不要假装，以后再谈。你可以这样回答，“我需要一点时间来处理这件事。您介意我稍后再联系您继续谈话吗？“。\n有时，我会在转述之前先表达我的意图，以防我无法调节语气：“我能把你说的重复一遍吗，以确保我听懂了？”或者“这是我从你说的话中理解的……”\n释义就像魔术精灵粉，你可以把它撒在任何谈话上，让它更积极、更有成效。这会让你正在说话的人感到被理解和认可。通过释义，你会节省时间，你的工作会更准确，你会因为善于沟通和倾听而受到称赞。\n本周试着转述一下，看看你是否注意到了不同之处。如果这对你来说是一次新的尝试，请回复这篇文章，让我知道进展如何！\n感谢您的阅读!。如果你想收到更多关于产生重大影响的小点子的帖子，请订阅下面的帖子！如果你觉得这篇文章很有用，请随时与家人、朋友和同事分享。", "note_en": "Our ability to interpret, pattern-match, and translate information is remarkable, and helps us function in life and at work. While engaged in a tough conversation, however, this premature analysis may hurt us.\n For example, if your teammate asks,  “Is there any way this project can be done faster?” you might take that to mean,  “You are moving too slowly,” or  &#34;I don&#39;t trust that you&#39;ve thought this through.&#34;\n Or if your roommate says,  “I feel like I’ve been doing all the chores lately,” you might object internally with,  “That’s not true! I did the dishes this morning!”\n    A harmless question could escalate into a series of misunderstandings, leaving us feeling attacked or invisible. In most cases, these reactions happen imperceptibly, and we move towards feeling uncomfortable or defensive without knowing how we got there.\n There’s no easy way to  breakpoint (pause) this very natural, very human cycle of interpretation, but there is an answer to the question of how to  listen and come away with mutual understanding. That answer is  paraphrasing.\n  Paraphrasing is sharing your interpretation of what you’ve heard in your own words.\n  Paraphrasing encourages you to pay attention to what the speaker is saying because you’ll need to repeat it back to them.\n  Paraphrasing allows the speaker to correct their own message after hearing it mirrored back to them.\n   Set the intention to paraphrase what the speaker says near the beginning of the conversation. If you aren’t able to paraphrase what they said, ask them to repeat it.\n   Me: I see, so you want me to………sorry, could you repeat that?\n  Me: You want me to send over this quarter’s product roadmap. Yes, will do!\n Asking the speaker to repeat what they said is okay. You don’t need to get it right the first time, you just need to get it right.\n  The software that lives inside your mind is not the same as the software that lives inside the speaker’s mind. Give the speaker a chance to work with you to get to the right interpretation.\n Teammate: “I&#39;ve observed that you haven&#39;t been paying attention during the project meetings recently. Would you mind participating more?”\n Paraphrased: “You&#39;ve noticed I don’t pay attention during meetings, and you want me to participate more?”\n Teammate: “No, you pay attention during most meetings. I’ve only noticed that you haven’t been paying attention during our daily project meetings.”\n  Communication isn’t easy, and sometimes it’s hard to get it right the first time. Give the speaker a chance to revise what they said.\n  Paraphrased: “You&#39;re having trouble understanding what I&#39;m working on. Should I give you more updates?”\n Manager: “Actually, I do know what you’re working on. I’m just unable to understand whether the project will still make the deadline.”\n    Teammate: “When you cut me off as I’m explaining something, it makes me feel like my opinion doesn&#39;t matter.”\n Non-paraphrased: “I didn’t realize I was doing that, I’m sorry.”\n  Paraphrased: “I’ve cut you off a few times, and that makes you feel like I don&#39;t value your opinion. I didn’t realize I was doing that. I’m sorry.”\n Michael Schreiner notes in  The Need to be Understood that, “The unconscious fear that seems to always be lurking in the background is that if we aren’t understood it will be as if we never existed.”\n The response with paraphrasing feels better because it conveys understanding and thus validates our existence. When we feel understood, we feel safe.\n Paraphrasing also makes you more likely to recognize and respond to the  words and  feelings the speaker expressed in their feedback to you.\n Teammate: “When you cut me off as I’m explaining something, it makes me feel like my opinion doesn&#39;t matter.”\n Paraphrased: “I’ve cut you off a few times, and that makes you feel like I don&#39;t value your opinion. I didn’t realize I was doing that.  And I do value your opinion. I’m sorry.”\n  “Studies in labor-management negotiations demonstrate that the time required to reach conflict resolution is cut in half when each negotiator agrees, before responding, to accurately repeat what the previous speaker had said.” - Marshall B. Rosenberg in  Nonviolent Communication.\n Paraphrasing minimizes misunderstandings. At the end of a conversation, you and the speaker will leave with the same interpretation, which will reduce the need for a follow-up.\n       Peter: “Hi, you wanted the TPS report this evening. By TPS did you mean the tea party spec?”\n      Peter: “You want me to send you the tea party spec this evening?”\n     Paraphrasing is useful in a professional context, but can be invaluable in a personal context.\n The more we care about the person we’re speaking with, the more we need to feel understood by them and the more we fear becoming invisible to them.\n When engaged in an emotional conversation with friends or family, paraphrase to help them feel seen.\n  Paraphrased: “You’re feeling frustrated, tired, and sad. I’m here for you.”\n  It never hurts to paraphrase just like it never hurts to double-check your answers on a test, but it doesn’t add value in every situation.\n    While paraphrasing, keep in mind that the tone you use is important. There’s no one-size-fits-all tone for every situation, but as a general guideline, use a curious tone over a declarative tone, and definitely steer clear of any tone that sounds remotely sarcastic.\n   Your tone should convey the desire to clarify and understand what the speaker said. If you don&#39;t have this desire, don&#39;t fake it, just revisit the conversation later. You can respond with something like,  “I need a moment to process this. Would you mind if I reached out to you later to continue the conversation?”\n Sometimes, I express my intent upfront before paraphrasing, just in case I’m unable to regulate my tone:  “Can I repeat what you said back to you, just to make sure I understand?” or “ Here’s what I understood from what you said...”\n  Paraphrasing is like magic pixie dust you can sprinkle onto any conversation to make it more positive and productive. It will leave the person you&#39;re speaking with feeling understood and validated. By paraphrasing, you will save time, your work will be more accurate, and you&#39;ll be applauded for being a good communicator and listener.\n Try paraphrasing this week and see if you notice a difference. If this is a new experiment for you, please respond to this post and let me know how it went!\n  Thank you for reading! If you’d like to receive more posts about small ideas that produce a big impact, please subscribe below! If you found this post useful, feel free to share it with family, friends, and coworkers.", "posttime": "2020-10-20 03:02:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "误解,misunderstandings,理解", "title": "不再有误解：解释-何时、为什么和如何", "title_en": "No More Misunderstandings: Paraphrasing – When, Why, and How", "transed": 1, "url": "https://smallbigideas.substack.com/p/no-more-misunderstandings", "via": "", "real_tags": ["误解", "理解"]}, {"category": "", "categoryclass": "", "imagename": "3051f09faf5e801f766ab0d970f74016.jpg", "infoid": 1029881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项任务是对十几种不同的低温流体管理系统的测试，其中包括液氢，液氢确实是一种很难处理的物质。测试将在轨道上的单一航天器上进行，这意味着它的设计和适应将特别复杂。\n当然，有效载荷本身及其低温系统将由洛克希德公司和他们在NASA的合作伙伴设计和建造，但该公司在开发过程中需要与发射供应商密切合作，特别是在实际发射之前。\n相对论创始人兼首席执行官蒂姆·埃利斯解释说，该公司从上到下3D打印整个火箭的方法特别适合这一点。\n“我们正在建造一个定制的有效载荷整流罩，它有他们需要的特定有效载荷加载接口，定制配件和适配器，”他说。“当然，它仍然需要平滑--对于一个外行来说，它看起来就像是一枚普通的火箭，”他补充道。\n每个整流罩(运载火箭覆盖有效载荷的外部部分)都必须是定制的，但这一个更是如此。在发射前对十几个低温操作进行加载和测试，这一微妙之处需要进行大量修改，而在其他日子里，这些修改将导致制造复杂性的大幅增加。\n埃利斯解释说：“如果你看看今天使用的制造工具，你会发现它们与过去60年没有太大不同。”“它是固定的工具，巨大的机器，看起来令人印象深刻，但只制作了一个形状或一个手工设计的物体。这需要12-24个月的时间才能完成。“。\n埃利斯说：“使用我们的3D打印方法，我们可以在30天内打印出整个整流罩。”“它也是软件定义的，所以我们只需更改文件即可更改尺寸和形状。对于这个特定的对象，我们有一些自定义功能，我们可以更快地完成这些功能并进行调整。尽管任务还有三年的时间，但随着发射的临近，总会有最后一刻的变化，我们可以适应这一点。否则，你现在就得锁定设计了。“。\n埃利斯对有机会与这样一个主要承包商公开承担任务感到兴奋。这些庞大的公司投入了数十亿美元的政府资金，并参与了许多启动活动，因此，重要的是要在他们的好账簿上，或者至少在他们的名单上。像这样一个复杂但风险相对较低的任务(与载人发射或价值数十亿美元的卫星相比)，对于像相对论这样的公司来说，是展示其能力的绝佳机会。(由于已经预售了许多运载火箭，人们对3D打印运载火箭显然不乏兴趣，但总是越多越好。)\n不过，如果一切继续按计划进行，该公司将在那之前进入太空。首次轨道试飞定于2021年底进行。埃利斯提到：“实际上，我们现在正在打印发布硬件，最近几周。”\n美国国家航空航天局(NASA)的引爆点项目为洛克希德公司提供了8970万美元的这项实验合同，顾名思义，该项目旨在帮助将前景看好的技术转化为商业可行性。由于每年有数亿美元奖励给从事登月器和机械臂等项目的公司，这有点像该机构的风险基金。", "note_en": "The mission is a test of a dozen different cryogenic fluid management systems, including liquid hydrogen, which is a very difficult substance to work with indeed. The tests will take place on a single craft in orbit, which means it will be a particularly complicated one to design and accommodate.\n The payload itself and its cryogenic systems will be designed and built by Lockheed and their partners at  NASA,   of course, but the company will need to work closely with its launch provider during development and especially in the leadup to the actual launch.\n  Relativity founder and CEO Tim Ellis explained that the company’s approach of 3D printing the entire rocket top to bottom is especially well suited for this.\n  “We’re building a custom payload fairing that has specific payload loading interfaces they need, custom fittings and adapters,” he said. “It still needs to be smooth, of course — to a lay person it will look like a normal rocket,” he added.\n Every fairing (the external part of the launch vehicle covering the payload) is necessarily custom, but this one much more so. The delicacy of having a dozen cryogenic operations being loaded up and tested until moments before launch necessitates a number of modifications that, in other days, would result in a massive increase in manufacturing complexity.\n “If you look at the manufacturing tools being used today, they’re not much different from the last 60 years,” Ellis explained. “It’s fixed tooling, giant machines that look impressive but only make one shape or one object that’s been designed by hand. And it’ll take 12-24 months to make it.”\n   “With our 3D printed approach we can print the entire fairing in under 30 days,” Ellis said. “It’s also software defined, so we can just change the file to change the dimensions and shape. For this particular object we have some custom features that we’re able to do more quickly and adapt. Even though the mission is three years out, there will always be last minute changes as you get closer to launch, and we can accommodate that. Otherwise you’d have to lock in the design now.”\n Ellis was excited about the opportunity to publicly take on a mission with such a major contractor. These enormous companies field billions of government dollars and take part in many launches, so it’s important to be in their good books, or at least in their rolodexes. A mission like this, complex but comparatively low stakes (compared with a crewed launch or billion-dollar satellite) is a great chance for a company like Relativity to show its capabilities. (Having presold many of its launches already, there’s clearly no lack of interest in the 3D printed launch vehicles, but more is always better.)\n  The company will be going to space before then, though, if all continues to go according to plan. The first orbital test flight is scheduled for late 2021. “We’re actually printing the launch hardware right now, the last few weeks,” Ellis mentioned.\n The  NASA Tipping Point program that is funding Lockheed with an $89.7 million contract for this experiment is one intended to, as its name indicates, help tip promising technologies over the edge into commercial viability. With  hundreds of millions awarded yearly for companies pursuing things like lunar hoppers and robotic arms, it’s a bit like the agency’s venture fund.", "posttime": "2020-10-20 02:29:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,火箭,打印,picks", "title": "\n洛克希德公司为NASA实验任务挑选相对论的3D打印火箭", "title_en": "\n\t\t\t\tLockheed picks Relativity’s 3D-printed rocket for experimental NASA mission\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/lockheed-picks-relativitys-3d-printed-rocket-for-experimental-nasa-mission/", "via": "", "real_tags": ["nasa", "火箭", "打印", "picks"]}, {"category": "", "categoryclass": "", "imagename": "cc0a2cc36c57e3449faf2b6a5bc9f6c6.png", "infoid": 1029879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "文档驱动开发是一种API开发方法，您首先编写文档，然后根据规范实现API。如果您的系统中有API的任何客户端(例如前端应用程序)，那么您也可以根据规范来实现它们。此方法通常也称为API优先。\n经常有这样的想法，即API更改应该由后端驱动，并且后端可以随时更改API，然后API客户端(例如前端应用程序)必须遵守对后端所做的任意更改。\n许多开发人员认为，在实现后端API之前，您不能开始在API客户端(例如前端应用程序)上工作。事实并非如此：如果您先编写文档，那么客户端应用程序和API服务器都可以同时实现。\n然而，当涉及到API时，并不是所有东西都算作文档。API必须以标准格式(如OpenAPI)记录，这样我们才能利用文档驱动开发的好处。我见过很多团队使用Confluence、Google Docs、Sharepoint、Dropbox Papers等工具记录他们的API。这不起作用，因为我们无法从它们生成标准规范，以便与其他工具结合使用来测试我们的API实现。\n这在实践中是如何运作的呢？它到底有没有好处呢？我将向您展示如何实践文档驱动的开发，以使用Flask开发REST API。对于任何其他类型的API，该方法都是相同的，并且它可以与任何其他框架一起使用。\n我们将实现一个简单的API来管理待办事项列表。待办事项的架构将具有以下属性：\n创建的属性ID将由后端设置，因此对于API客户端是只读的。属性TASK表示必须完成的任务，而STATUS属性表示任务的状态，并且只能采用枚举值之一。为了最佳实践和可靠性，我们将使包含模式中未列出的任何属性的任何请求无效。\n/TODO表示待办事项的集合，我们将使用它来获取待办事项列表并创建新的待办事项。我们将使用/todo/{item_id}来管理特定任务，并使用它来检索、更新和删除特定任务的详细信息。\n现在我们已经完成了设计API的过程，在开始实现之前，让我们先对其进行文档记录！\n我在开始时提到过，我们将实现REST API，所以我们将使用OpenAPI来记录它。创建一个名为oas.yaml的文件，并向其中写入以下内容：\nOpenapi：3.0.3信息：标题：TODO API描述：允许您管理待办事项列表版本的API：1.0.0路径：/TODO/：Get：Summary：返回待办事项列表响应：&#39；200&#39；：描述：JSON任务数组内容：Application/json：Schema：Type：Array Items：$ref：&#39；#/Components/Schemas/GetTaskSchema&#39；发布：摘要：创建任务请求Body：Required：True Content：Application/Json：Schema：$ref：&#39；#/components/schemas/CreateTaskSchema&#39；响应：&#39；201&#39；：描述：创建的任务内容的Json表示形式：Application/Json：Schema：$ref：&#39；#/Components/Schemas/GetTaskSchema&#39；/todo/{item_id}：参数：-in：路径名：item_id必填：true schema：type：string format：uuid get：Summary：返回任务的详细信息响应：&#39；200&#39；：描述：任务内容的JSON表示形式：application/json：schema：$ref：&#39；#/Components/Schemas/GetTaskSchema&#39；&#39；404&#39；：$ref：&#39；#/Components/Responses/NotFound&#39；PUT：摘要：更新现有任务请求Body：Required：True Content：Application/Json：Schema：$ref：&#39；#/components/schemas/CreateTaskSchema&#39；Responses：&#39；200&#39；：描述：任务内容的Json表示形式：Application/Json：Schema：$ref：&#39；#/Components/Schemas/GetTaskSchema&#39；&#39；404&#39；：$Ref：&#39；#/Components/Responses/NotFound&#39；删除：摘要：删除现有任务响应：&#39；204&#39；：描述：已成功删除资源&#39；404&#39；：$ref：&#39；#/Components/Responses/NotFound&#39；Components：Responses：NotFound：Description：未找到指定的资源。内容：application/json：schema：$ref：&#39；#/Components/Schemas/Error&#39；架构：Error：Type：Object Properties：Code：Type：Number Message：Type：String Status：Type：String CreateTaskSchema：Type：Object Required：-任务添加属性：FALSE属性：STATUS：TYPE：String枚举：-PENDING-PROGRESS-COMPLETED DEFAULT：PENDING TASK：TYPE：String GetTaskSchema：TYPE：Object Required：-Created-id-Priority-Status-Task AdditionalProperties：FALSE属性：ID：TYPE：STRING FORMAT：UUID Created：TYPE：INTEGER DESCRIPTION：UNIX时间映射状态格式的日期：类型：字符串枚举：-挂起-进度-已完成任务：类型：字符串。\n既然我们已经有了API规范，我们就可以开始实现API服务器了。如果您使用的另一个团队必须实现API的客户端应用程序(如前端应用程序)，请确保中心位置(如GitHub存储库或URL端点)的所有团队都可以使用API规范。稍后我会再写一篇文章来说明你是如何做到这一点的。\n要实现该API，我们将结合使用Flask和Flask-Smorest。Flask-Smorest是一个rest API框架，它使用棉花糖来验证模式。出于说明的目的，我们将保持这一超级简单，整个应用程序将在一个文件中，项目列表将由内存中的列表表示。在真实的应用程序中，您希望使用持久存储，并确保不同的组件进入不同的模块。要使代码正常工作，您需要的唯一依赖项是最平滑的烧瓶，因此请确保安装了它。创建一个名为app.py的文件，并将以下内容复制到其中：\n导入时间从flask导入UUID从flask导入Flask从flask导入MethodView从flask_momoest导入Api，Blueprint，从棉花糖中止导入架构，字段，排除，验证app=Flask(__Name__)app.config[&#39；API_Title&#39；]=&#39；TODO API&#39；app.config[&#39；API_Version&#39；]=&#39；1.0.0&#39；app.config[&#39；OPENAPI_Version&#39；]=&#39；3.0.3&#39；App.config[&#39；OPENAPI_JSON_PATH&#39；]=&#34；API-spec.json&#34；app.config[&#39；OPENAPI_URL_PREFIX&#39；]=&#34；/&#34；app.config[&#39；OPENAPI_SWAGGER_UI_PATH&#39；]=&#34；/docs&#34；app.config[&#39；OPENAPI_SWAGGER_UI_URL&#39；]=&#34；Https://cdn.jsdelivr.net/npm/swagger-ui-dist/&#34；api_title=&#39；api_version=&#39；1.0.0&#39；api=API(APP)类创建任务模式(架构)：类元：未知=排除状态=fields.String(默认值=&#39；待定&#39；，验证=有效.OneOf([&#39；待定&#39；，&#39；进度&#39；，&#39；完成&#39；])，)task=fields.String()class GetTaskSchema(CreateTaskSchema)：Created=fields.Integer(Required=True)id=fields.UUID(Required=True)Blueprint=Blueprint(&#39；TODO&#39；，&#39；TODO&#39；，url_prefix=&#39；/TODO&#39；，description=&#39；API\n如果您现在运行它，您将收到一个错误，指出我们需要为/todo/{item_id}URL路径中的item_id参数提供一个示例。您还将看到一些关于规范格式问题的警告，您可以安全地忽略这些警告，因为API规范是有效的(您可以使用如下所示的外部工具进行验证：https://editor.swagger.io/).。让我们继续为item_id添加一个示例：\n/todo/{item_id}：参数：-in：路径名：item_id必填：true schema：type：string format：uuid示例：d222e7a3-6afb-463a-9709-38eb70cc670d...。\n如果现在再次运行Dredd，将会有5个测试通过，3个失败。如果仔细观察这些故障，您会发现所有这些故障都与/todo/{item_id}URL路径下的现有资源上的操作相关。看起来Dredd正在选择我们在规范中提供的示例ID，并期望存在具有该ID的资源。显然，在我们开始运行API之前不存在任何资源，因此我们希望Dredd首先使用post/todo/实际创建一个资源，获取创建的资源的ID，并使用它测试/todo/{item_id}URL路径下的端点。我们该怎么做呢？使用Dredd钩子！\nDredd钩子提供了一个简单的接口，允许用户在事务之前和之后执行操作。每个事务都由“名称”标识，“名称”是唯一标识操作的不同参数的组合。要列出规范中的所有可用名称，请运行以下命令：\n我们需要/todo/{item_id}URL路径下成功操作的名称，即返回200和204等成功状态代码的操作(即不返回404的操作)。创建一个名为hooks.y的文件，并将以下内容复制到其中：\nImport json import Dredd_Hooks Response_Stash={}@Dredd_Hooks.After(&#39；/TODO/&&gt;；创建任务&&gt;201&&gt;应用程序/json；)定义SAVE_CREATED_TASK(TRANSACTION)：RESPONSE_PAYLOAD=transaction[&#39；results&#39；][&#39；fields&#39；][&#39；body&#39；][&#39；values&#39；][&#39；actual&#39；]task_id=json.load(Response_Payload)[&#39；id&#39；]response_stash[&#39；Created_task_id&#39；]=task_id@Dredd_hooks.Being(&#39；/todo/{item_id}&gt；)返回任务&gt；200&gt；应用程序/json&#39；)def BEVER_GET_TASK(Transaction)：Transaction[&#39；fullPath&39；]=&#39；/todo/&#39；+response_stash[&#39；created_task_id&#39；]@dredd_hooks.Being(&#39；/todo/{item_id}&gt；)更新现有任务&gt；200&gt；应用程序/json&#39；def PUT_TASK(TRANSACTION)：transaction[&#39；fullPath&#39；]=&#39；/todo/&#39；+response_stash[&#39；Created_task_id&#39；]@Dredd_hooks.pre(&#39；/TODO/{Item_id}&gt；删除现有任务&gt；204&#39；)def BEFORE_DELETE_TASK(TRANSACTION)：TRANSACTION[&#39；fullPath&#39；]=&#39；/TODO/&#39；+response_stash[&#39；CREATED_TASK_ID&#39；]。\n我将在另一个教程中详细介绍Dredd和Dredd Hooks。您可以使用以下命令通过这些挂钩运行Dredd：\n对，所以现在我们可以确定我们的API实现符合规范。如果另一个开发前端应用程序的团队也进行了类似的测试，我们可以相当肯定的是，服务器和前端应用程序都会很好地集成在一起，并且没有错误。或者至少我们不会因为不符合API而遇到集成错误。\n现在假设我们想要更改API。随着时间的推移，我们希望能够为每项任务分配优先级。这将在任务资源有效负载中产生一个称为“优先级”的新字段，该字段可能具有下列值之一：\n我们应该如何对待这一变化呢？我们正在实践文档驱动的开发，所以首先我们将更改规范。一旦我们更新了规范，我们就可以同时更改后端和前端。对后端API的任何不符合规范的更改都将导致测试失败，不应该发布。\n..。CreateTaskSchema：Type：Object Required：-Task AdditionalProperties：False属性：Priority：Type：String enum：-Low-Medium-High Default：Low Status：Type：String Enum：-Pending-Progress-Completed Default：Pending Task：Type：String GetTaskSchema：Type：Object Required：-Created-id-Priority-Status-Task AdditionalProperties属性：False属性：ID：Type：String Format：UUID Created：Type：Integer Description：日期格式为UNIX时间映射优先级：TYPE。用法：string枚举：-低-中-高默认：低状态：type：string枚举：-挂起-进度-已完成任务：type：string。\n类CreateTaskSchema(Schema)：class Meta：UNKNOWN=排除优先级=fields.String(默认=&#39；低&#39；，&#39；，验证=validate.OneOf([&#39；低&#39；，&#39；中&#39；，&#39；高&#39；])，)status=fields.String(默认=&#39；等待&#39；，验证=validate.OneOf([&#39；等待&#39；，&#39；进度&#39；，&#39；完成&#39；])，)task=fields.String()类GetTaskSchema(CreateTaskSchema)：Created=fields.Integer(Required=True)id=fields.UUID(Required=True)。\n如果再次运行dredd命令，测试现在通过。在此示例中，更新棉花糖架构足以更新应用程序。在实际的应用程序中，您将把数据持久化到数据库中，并且还需要运行一些迁移来更新模型。", "note_en": "Documentation-driven development is an approach to API development where you write the documentation first, and then implement the API as per the specification. If you have any clients of the API within your system (for example a frontend application) then you implement them against the specification as well. This approach is often also called API-first.\n There’s often this idea that API changes should be driven by the backend, and that the backend can change the API at any time and then the API client (for example a frontend application) has to comply with whichever arbitrary changes were made to the backend.\n Many developers have the idea that you can’t start working on an API client (for example a frontend application) until the backend API is implemented. This is simply not true: if you write the documentation first, then both the client application and the API server can be implemented at the same time.\n However, not everything counts as documentation when it comes to APIs. APIs must be documented in standard formats, such as OpenAPI, so that we can leverage the benefits of documentation-driven development. I’ve seen many teams documenting their API using tools such as Confluence, Google Docs, Sharepoint, Dropbox Papers, and similar. This doesn’t work because we can’t generate standard specifications from them that we can use in combination with other tools to test our API implementation.\n How does this work in practice? And is it beneficial at all? I’m going to show you how to practice documentation-driven development to develop a REST API with Flask. The approach is the same for any other kind of API and it works with any other framework.\n We’ll implement a simple API to manage a list of to-do items. The schema for the to-do item will have the following attributes:\n  The attributes ID created will be set by the backend and therefore will be read-only for the API client. The attribute task represents the task that has to be done, and the status attribute represents the status of the task and can only take one of the enumerated values. For best practice and reliability, we’ll invalidate any requests that include any properties not listed in the schema.\n   /todo represents the collection of to-do items, and we’ll use it to fetch a list of our to-do items and to create new to-do items. We’ll use  /todo/{item_id} to manage specific tasks, and we’ll use it to retrieve the details of a specific task, to update it, and to delete it.\n Now that we have gone through the process of designing our API, let’s document it first before we jump onto the implementation!\n I mentioned at the beginning that we’d be implementing a REST API, so we’ll use OpenAPI to document it. Create a file called  oas.yaml and write the following content to it:\n openapi: 3.0.3 info:  title: TODO API  description: API that allows you to manage a to-do list  version: 1.0.0 paths:  /todo/:  get:  summary: Returns a list of to-do items  responses:  &#39;200&#39;:  description: A JSON array of tasks  content:  application/json:  schema:  type: array  items:  $ref: &#39;#/components/schemas/GetTaskSchema&#39;  post:  summary: Creates an task  requestBody:  required: true  content:  application/json:  schema:  $ref: &#39;#/components/schemas/CreateTaskSchema&#39;  responses:  &#39;201&#39;:  description: A JSON representation of the created task  content:  application/json:  schema:  $ref: &#39;#/components/schemas/GetTaskSchema&#39;  /todo/{item_id}:  parameters:  - in: path  name: item_id  required: true  schema:  type: string  format: uuid  get:  summary: Returns the details of a task  responses:  &#39;200&#39;:  description: A JSON representation of a task  content:  application/json:  schema:  $ref: &#39;#/components/schemas/GetTaskSchema&#39;  &#39;404&#39;:  $ref: &#39;#/components/responses/NotFound&#39;  put:  summary: Updates an existing task  requestBody:  required: true  content:  application/json:  schema:  $ref: &#39;#/components/schemas/CreateTaskSchema&#39;  responses:  &#39;200&#39;:  description: A JSON representation of a task  content:  application/json:  schema:  $ref: &#39;#/components/schemas/GetTaskSchema&#39;  &#39;404&#39;:  $ref: &#39;#/components/responses/NotFound&#39;  delete:  summary: Deletes an existing task  responses:  &#39;204&#39;:  description: The resource was deleted successfully  &#39;404&#39;:  $ref: &#39;#/components/responses/NotFound&#39; components:  responses:  NotFound:  description: The specified resource was not found.  content:  application/json:  schema:  $ref: &#39;#/components/schemas/Error&#39;  schemas:  Error:  type: object  properties:  code:  type: number  message:  type: string  status:  type: string  CreateTaskSchema:  type: object  required:  - task  additionalProperties: false  properties:  status:  type: string  enum:  - pending  - progress  - completed  default: pending  task:  type: string  GetTaskSchema:  type: object  required:  - created  - id  - priority  - status  - task  additionalProperties: false  properties:  id:  type: string  format: uuid  created:  type: integer  description: Date in the form of UNIX timestmap  status:  type: string  enum:  - pending  - progress  - completed  task:  type: string\n Now that we have the API specification we are in an excellent position to start implementing the API server. If you’re working with another team that has to implement a client application for the API, such as a frontend application, make sure you make the API specification available to all teams in a central location, such as a GitHub repository or URL endpoint. I’ll write another post later on illustrating how you can do that.\n To implement the API we’ll use Flask in combination with  flask-smorest.  Flask-smorest is a REST API framework that uses marshmallow to validate schemas. For illustration purposes we’re going to keep this super simple and the whole app will be in one file, and the list of items will be represented by an in-memory list. In a real app you want to use persistent storage and make sure different components go into different modules. The only dependency you’ll need to get the code working is  flask-smorest, so make sure it’s installed. Create a file called  app.py and copy the following content to it:\n import time import uuid from flask import Flask from flask.views import MethodView from flask_smorest import Api, Blueprint, abort from marshmallow import Schema, fields, EXCLUDE, validate app = Flask(__name__) app.config[&#39;API_TITLE&#39;] = &#39;TODO API&#39; app.config[&#39;API_VERSION&#39;] = &#39;1.0.0&#39; app.config[&#39;OPENAPI_VERSION&#39;] = &#39;3.0.3&#39; app.config[&#39;OPENAPI_JSON_PATH&#39;] = &#34;api-spec.json&#34; app.config[&#39;OPENAPI_URL_PREFIX&#39;] = &#34;/&#34; app.config[&#39;OPENAPI_SWAGGER_UI_PATH&#39;] = &#34;/docs&#34; app.config[&#39;OPENAPI_SWAGGER_UI_URL&#39;] = &#34; https://cdn.jsdelivr.net/npm/swagger-ui-dist/&#34; API_TITLE = &#39;Orders API&#39; API_VERSION = &#39;1.0.0&#39; api = Api(app) class CreateTaskSchema(Schema):  class Meta:  unknown = EXCLUDE  status = fields.String(  default=&#39;pending&#39;,  validate=validate.OneOf([&#39;pending&#39;, &#39;progress&#39;, &#39;completed&#39;]),  )  task = fields.String() class GetTaskSchema(CreateTaskSchema):  created = fields.Integer(required=True)  id = fields.UUID(required=True) blueprint = Blueprint(  &#39;todo&#39;, &#39;todo&#39;, url_prefix=&#39;/todo&#39;,  description=&#39;API that allows you to manage a to-do list&#39;, ) TODO_LIST = []  @blueprint.route(&#39;/&#39;) class TodoItems(MethodView):  @blueprint.response(GetTaskSchema(many=True))  def get(self):  return TODO_LIST  @blueprint.arguments(CreateTaskSchema)  @blueprint.response(GetTaskSchema, code=201)  def post(self, item):  item[&#39;created&#39;] = time.time()  item[&#39;id&#39;] = str(uuid.uuid4())  TODO_LIST.append(item)  return item  @blueprint.route(&#39;/&lt;item_id&gt;&#39;) class TodoItem(MethodView):  @blueprint.response(GetTaskSchema)  def get(self, item_id):  for item in TODO_LIST:  if item[&#39;id&#39;] == item_id:  return item  abort(404, message=&#39;Item not found.&#39;)  @blueprint.arguments(CreateTaskSchema)  @blueprint.response(GetTaskSchema)  def put(self, update_data, item_id):  for item in TODO_LIST:  if item[&#39;id&#39;] == item_id:  item.update(update_data)  return item  abort(404, message=&#39;Item not found.&#39;)  @blueprint.response(code=204)  def delete(self, item_id):  for index, item in enumerate(TODO_LIST):  if item[&#39;id&#39;] == item_id:  TODO_LIST.pop(index)  return  abort(404, message=&#39;Item not found.&#39;) api.register_blueprint(blueprint)\n   As per the app configuration, you can visit the API documentation auto-generated from the app with a Swagger UI theme under  /docs.\n Great, now, how do we test this implementation to make sure it’s compliant with the specification? You can use a bunch of different tools and frameworks to accomplish this. Here I’ll show you how you can do it with  Dredd.  Dredd is an npm package, so to install it run the following command:\n    If you run this now, you’ll get an error saying that we need to provide an example for the item_id parameter in the  /todo/{item_id} URL path. You’ll see also some warnings about issues with the specification format, which you can safely ignore as the API spec is valid (you can validate that with external tools like this:  https://editor.swagger.io/). Let’s go ahead and add an example fo item_id:\n /todo/{item_id}:  parameters:  - in: path  name: item_id  required: true  schema:  type: string  format: uuid  example: d222e7a3-6afb-463a-9709-38eb70cc670d  ...\n If you run Dredd now again, you’ll get 5 tests passing and 3 failures. If you look closer at the failures, you’ll see that all of them are related to operations on existing resources under the  /todo/{item_id} URL path. It seems Dredd is picking up the example ID we provided in the spec and expecting a resource with such ID to exist. Obviously no resource exists until we start running the API, so we want Dredd to actually create a resource first using POST  /todo/, fetch the ID of the created resource, and use it to test the endpoints under the  /todo/{item_id} URL path. How do we do that? Using dredd hooks!\n Dredd hooks offer a simple interface that allow use to take action before and after a transaction. Every transaction is identified by a “name”, which is a combination of different parameters that uniquely identify an operation. To list all names available in your specification, run the following command:\n    We want the names of the successful actions under the  /todo/{item_id} URL path, namely actions that return a success status code such as 200 and 204 (i.e. not those returning 404). Create a file called hooks.y and copy the following content to it:\n import json import dredd_hooks response_stash = {}  @dredd_hooks.after(&#39;/todo/ &gt; Creates an task &gt; 201 &gt; application/json&#39;) def save_created_task(transaction):  response_payload = transaction[&#39;results&#39;][&#39;fields&#39;][&#39;body&#39;][&#39;values&#39;][&#39;actual&#39;]  task_id = json.loads(response_payload)[&#39;id&#39;]  response_stash[&#39;created_task_id&#39;] = task_id  @dredd_hooks.before(&#39;/todo/{item_id} &gt; Returns the details of a task &gt; 200 &gt; application/json&#39;) def before_get_task(transaction):  transaction[&#39;fullPath&#39;] = &#39;/todo/&#39; + response_stash[&#39;created_task_id&#39;]  @dredd_hooks.before(&#39;/todo/{item_id} &gt; Updates an existing task &gt; 200 &gt; application/json&#39;) def before_put_task(transaction):  transaction[&#39;fullPath&#39;] = &#39;/todo/&#39; + response_stash[&#39;created_task_id&#39;]  @dredd_hooks.before(&#39;/todo/{item_id} &gt; Deletes an existing task &gt; 204&#39;) def before_delete_task(transaction):  transaction[&#39;fullPath&#39;] = &#39;/todo/&#39; + response_stash[&#39;created_task_id&#39;]\n I’ll talk more about dredd and dredd hooks in another tutorial. You can run Dredd with these hooks with the following command:\n    Right, so now we are certain that our API implementation complies with the specification. If another team working on a frontend application has made similar tests, we can be quite certain that both the server and the frontend app will integrate nicely and without errors. Or at least we won’t encounter integration errors due to non-compliance with the API.\n Let’s now say that we want to make a change to the API. As it turns, we’d like to be able to assign a priority to each task. This will result in a new field in task resource payload called “priority”, which may have one of the following values:\n   How should we approach this change? We are practicing documentation-driven development, so first we’ll change the specification. Once we’ve updated the specification, we can change both the backend and the frontend. Any change to the backend API that doesn’t comply with the spec will result in a failed test and shouldn’t be released.\n  ...  CreateTaskSchema:  type: object  required:  - task  additionalProperties: false  properties:  priority:  type: string  enum:  - low  - medium  - high  default: low  status:  type: string  enum:  - pending  - progress  - completed  default: pending  task:  type: string  GetTaskSchema:  type: object  required:  - created  - id  - priority  - status  - task  additionalProperties: false  properties:  id:  type: string  format: uuid  created:  type: integer  description: Date in the form of UNIX timestmap  priority:  type: string  enum:  - low  - medium  - high  default: low  status:  type: string  enum:  - pending  - progress  - completed  task:  type: string\n     class CreateTaskSchema(Schema):  class Meta:  unknown = EXCLUDE  priority = fields.String(  default=&#39;low&#39;,  validate=validate.OneOf([&#39;low&#39;, &#39;medium&#39;, &#39;high&#39;]),  )  status = fields.String(  default=&#39;pending&#39;,  validate=validate.OneOf([&#39;pending&#39;, &#39;progress&#39;, &#39;completed&#39;]),  )  task = fields.String() class GetTaskSchema(CreateTaskSchema):  created = fields.Integer(required=True)  id = fields.UUID(required=True)\n If you run the Dredd command again, the tests now pass. In this example, updating the marshmallow schemas is sufficient to update the app. In a real application, you’ll be persisting data to a database and you’ll need to run some migrations to update your models as well.", "posttime": "2020-10-20 02:25:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,driven,api", "title": "文档驱动的API开发：什么是文档驱动的开发，您是如何实现的，以及", "title_en": "Documentation-driven development for APIs: what is it, how do you do it and", "transed": 1, "url": "https://medium.com/python-geek/documentation-driven-development-for-apis-what-is-it-how-do-you-do-it-and-why-you-should-do-it-b6ebbf9ba371", "via": "", "real_tags": ["开发", "driven", "api"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国务院国际信息局(IIP)“美国参考”从华盛顿报道，金融犯罪执法网络(FinCEN)对Helix and Coin Ninja(可兑换虚拟货币“混合器”或“Tumblers”)的创始人、管理人和主要运营商拉里·迪恩·哈蒙(Larry Dean Harmon)进行了6000万美元的民事罚款，原因是他违反了“银行保密法”(BSA)及其实施条例。\nHarmon先生在2014年至2017年经营Helix作为一家未注册的货币服务企业(MSB)，在2017年至2020年经营Coin Ninja。*哈蒙先生目前正在美国哥伦比亚特区地区法院被起诉，罪名是合谋洗钱货币工具，以及经营与其经营Helix相关的无照汇款业务。\n正如FinCEN在2013年的指导中澄清的那样，可兑换虚拟货币的交易所和管理人是BSA下的货币传输者。因此，他们有义务向FinCEN注册；制定、实施和维护反洗钱合规计划；并满足所有适用的报告和记录保存要求。*FinCEN在2019年进一步澄清，作为可兑换虚拟货币的搅拌者和搅拌者的金融机构也必须满足这些同样的要求。\n哈蒙以Helix和Coin Ninja的名字经营业务，通过各种手段接受和传输比特币，经营可兑换虚拟货币的交易所。从2014年6月到2017年12月，Helix为其客户进行了超过122.5万笔交易，并与超过3.11亿美元的虚拟货币钱包地址相关联。*FinCEN的调查发现，至少有35.6万笔比特币交易是通过Helix进行的。*哈蒙将Helix作为比特币混合器(或称Tumbler)运营，并在互联网最黑暗的地方为其服务做广告，以让客户匿名支付毒品、枪支和儿童色情等物品。哈蒙随后创立并担任Coin Ninja的首席执行官，该公司以未注册的MSB的形式运营，与Helix的运营方式相同。\nFinCEN的调查显示，哈蒙先生故意违反了BSA的注册、程序和报告要求，没有注册为MSB，没有实施和保持有效的反洗钱计划，以及没有报告可疑活动。\n具体地说，调查表明，哈蒙先生故意无视他在BSA下的义务，并实施了允许Helix规避BSA要求的做法。*这包括未能收集和核实超过120万笔交易的客户姓名、地址和其他标识符。哈蒙通过Helix进行操作，甚至主动删除了他确实收集到的最低限度的客户信息。但调查显示，哈蒙与毒贩、造假者和欺诈者以及其他犯罪分子进行了交易。\nFinCEN与美国司法部计算机犯罪和知识产权部门、哥伦比亚特区联邦检察官办公室、联邦调查局和国税局刑事调查局密切协调今天的行动。", "note_en": "WASHINGTON—The Financial Crimes Enforcement Network (FinCEN) has assessed a $60 million  civil money penalty against Larry Dean Harmon, the founder, administrator, and primary operator of Helix and Coin Ninja, convertible virtual currency “mixers,” or “tumblers,” for violations of the Bank Secrecy Act (BSA) and its implementing regulations.\n Mr. Harmon operated Helix as an unregistered money services business (MSB) from 2014 to 2017 and Coin Ninja from 2017 to 2020.  Mr. Harmon is currently being prosecuted in the U.S. District Court for the District of Columbia on charges of conspiracy to launder monetary instruments and the operation of an unlicensed money transmitting business in connection with his operation of Helix.\n As FinCEN clarified in its  2013 Guidance, exchangers and administrators of convertible virtual currency are money transmitters under the BSA.  As such, they have an obligation to register with FinCEN; to develop, implement, and maintain an anti-money laundering compliance program; and to meet all applicable reporting and recordkeeping requirements.  FinCEN issued further  clarification in 2019 that financial institutions that are mixers and tumblers of convertible virtual currency must also meet these same requirements.\n Mr. Harmon, doing business as Helix and Coin Ninja, operated as an exchanger of convertible virtual currencies by accepting and transmitting bitcoin through a variety of means.  From June 2014 through December 2017, Helix conducted over 1,225,000 transactions for its customers and was associated with virtual currency wallet addresses that sent or received over $311 million dollars.  FinCEN’s investigation has identified at least 356,000 bitcoin transactions through Helix.  Mr. Harmon operated Helix as a bitcoin mixer, or tumbler, and advertised its services in the darkest spaces of the internet as a way for customers to anonymously pay for things like drugs, guns, and child pornography.  Mr. Harmon subsequently founded, and acted as Chief Executive Officer of, Coin Ninja, which operated as an unregistered MSB and in the same manner as Helix.\n FinCEN’s investigation revealed that Mr. Harmon willfully violated the BSA’s registration, program, and reporting requirements by failing to register as a MSB, failing to implement and maintain an effective anti-money laundering program, and failing to report suspicious activities.\n Specifically, the investigation demonstrated that Mr. Harmon deliberately disregarded his obligations under the BSA and implemented practices that allowed Helix to circumvent the BSA’s requirements.  This included a failure to collect and verify customer names, addresses, and other identifiers on over 1.2 million transactions.  Harmon, operating through Helix, actively deleted even the minimal customer information he did collect.  The investigation revealed that Mr. Harmon engaged in transactions with narcotics traffickers, counterfeiters and fraudsters, as well as other criminals.\n FinCEN closely coordinated today’s action with the U.S. Department of Justice’s Computer Crimes and Intellectual Property Section, the U.S. Attorney’s Office for the District of Columbia, the Federal Bureau of Investigation, and the Internal Revenue Service Criminal Investigation division.", "posttime": "2020-10-20 02:25:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,搅拌,mixer,货币", "title": "首个比特币“搅拌者”因违反反洗钱法而受罚", "title_en": "First Bitcoin “Mixer” Penalized for Violating Anti-Money Laundering Laws", "transed": 1, "url": "https://www.fincen.gov/news/news-releases/first-bitcoin-mixer-penalized-fincen-violating-anti-money-laundering-laws", "via": "", "real_tags": ["比特币", "搅拌", "mixer", "货币"]}, {"category": "", "categoryclass": "", "imagename": "ce65c382b5edeba4dde3fd0ffcd76cfe.jpg", "infoid": 1029877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月15日，匹兹堡的一个联邦大陪审团发回了一份起诉书，指控6名电脑黑客，他们都是俄罗斯联邦(俄罗斯)的居民和国民，以及俄罗斯主要情报局(GRU)74455部队的官员，GRU是武装部队总参谋长的军事情报机构。\n这些GRU黑客及其同谋参与了旨在支持俄罗斯政府破坏、报复或以其他方式破坏稳定的努力的计算机入侵和攻击：(1)乌克兰；(2)格鲁吉亚；(3)法国选举；(4)试图追究俄罗斯在外国领土上使用武器级神经毒剂诺维乔克(Novichok)的责任；(5)在俄罗斯运动员因俄罗斯政府支持的兴奋剂工作而被禁止在本国国旗下参加之后，2018年平昌冬奥会。\n他们的电脑攻击使用了一些迄今世界上最具破坏性的恶意软件，包括：KillDisk和Industroyer，它们各自导致乌克兰停电；NotPetya，仅给起诉书中确认的三名受害者就造成了近10亿美元的损失；以及奥运破坏者，它扰乱了用于支持2018年平昌冬奥会的数千台电脑。起诉书指控被告共谋、电脑黑客、电信欺诈、严重的身份盗窃和虚假注册域名。\n根据起诉书，从2015年11月左右开始，至少持续到2019年10月左右，被告及其同谋者为了俄罗斯的战略利益，通过未经授权访问受害者电脑(黑客)，部署了破坏性恶意软件，并采取了其他破坏性行动。*如指控的那样，该阴谋对以下破坏性、破坏性或以其他方式破坏稳定的计算机入侵和攻击负责：\n乌克兰政府和关键基础设施：2015年12月至2016年12月，使用名为BlackEnergy、Industroyer和KillDisk的恶意软件对乌克兰电网、财政部和国家财政部进行破坏性恶意软件攻击；\n法国选举：2017年4月和5月，针对法国总统马克龙的“共和国和马尔凯！”的网络钓鱼运动和相关的黑客和泄密行动。(恩，Marche！)。2017年法国大选前的政党、法国政界人士和地方政府；\n全球企业和关键基础设施(NotPetya)：2017年6月27日，破坏性恶意软件攻击，使用名为NotPetya的恶意软件感染世界各地的计算机，包括宾夕法尼亚州西区遗产谷健康系统(遗产谷)的医院和其他医疗设施；联邦快递公司的子公司TNT Express B.V.；以及一家美国大型制药商，它们在攻击中总共遭受了近10亿美元的损失；\n平昌冬奥会东道主、参与者、合作伙伴和与会者：2017年12月至2018年2月，针对韩国公民和官员、奥运会运动员、合作伙伴和游客以及国际奥委会(IOC)官员的鱼叉式网络钓鱼活动和恶意移动应用；\n平昌冬奥会IT系统(奥运驱逐舰)：2017年12月至2018年2月入侵2018年平昌冬奥会支持计算机，最终在2018年2月9日，利用被称为奥运驱逐舰的恶意软件，对开幕式进行破坏性恶意软件攻击；\n诺维乔克中毒调查：2018年4月，针对禁止化学武器组织(OPCW)和联合王国国防科技实验室(DSTL)对谢尔盖·斯克里帕尔(Sergei Skripal)、他的女儿谢尔盖·斯克里帕尔(Sergei Skripal)和几名英国公民神经毒剂中毒事件的调查，发起了刺探钓鱼运动；以及。\n格鲁吉亚公司和政府实体：2018年针对一家主要媒体公司的鱼叉式钓鱼运动，2019年危害议会网络的努力，以及2019年广泛的网站污损运动。\n网络安全研究人员已经使用“沙虫团队”、“远程机器人”、“巫毒熊”和“铁海盗”等标签追踪了阴谋者和他们的恶意活动。\n这些指控是由助理司法部长约翰·C·德默斯(John C.Demers)、联邦调查局副局长大卫·鲍迪奇(David Bowdich)、宾夕法尼亚州西区联邦检察官斯科特·W·布雷迪(Scott W.Brady)以及负责联邦调查局亚特兰大、俄克拉何马城和匹兹堡外地办事处的特工宣布的。分别是“克里斯”·哈克、梅丽莎·R·戈德博尔德和迈克尔·A·克里斯曼。\n负责国家安全事务的助理司法部长约翰·C·德默斯(John C.Demers)说，“没有哪个国家像俄罗斯那样恶意或不负责任地将其网络能力武器化，肆意造成前所未有的破坏，以追求小小的战术优势，并满足敌意。今天，国务院指控这些俄罗斯官员实施了有史以来最具破坏性和破坏性的一系列计算机攻击，包括通过释放NotPetya恶意软件。没有哪个国家会在这样做的同时重新夺回伟大。”\n联邦调查局副局长大卫·鲍迪奇说：“联邦调查局一再警告说，俄罗斯是一个能力很强的网络对手，这份起诉书中披露的信息说明了俄罗斯网络活动的真正普遍性和破坏性。”“但这份起诉书也突显了FBI的能力。“我们有调查这些恶意恶意软件攻击的工具，找出肇事者，然后将风险和后果强加给他们。“正如今天所证明的那样，我们将毫不留情地追捕那些威胁美国及其公民的人。”\n宾夕法尼亚州西区的联邦检察官斯科特·W·布雷迪(Scott W.Brady)表示：“两年多来，我们一直在不知疲倦地揭露这些俄罗斯GRU官员，他们参与了一场全球黑客、破坏和破坏稳定的运动，代表着历史上破坏性最大、代价最高的网络攻击。俄罗斯政府官员犯下的罪行针对的是遭受真正伤害的真正受害者。我们有义务追究那些犯罪的人的责任--无论他们住在哪里，也不管他们为谁工作-以便代表这些受害者伸张正义。”\n负责匹兹堡、亚特兰大和俄克拉何马城的联邦调查局匹兹堡特别探员迈克尔·A·克里斯曼(Michael A.Christman)表示：“我们在匹兹堡、亚特兰大和俄克拉何马城的团队花了多年时间追踪GRU成员，他们的非凡才华和奉献精神是无与伦比的。”“这些罪犯低估了通过执法、私营部门和国际伙伴关系共享情报、资源和专业知识的力量。”\n被告Yuriy Sergeyevich Andrienko(ЮрийСергеевичАндриенко)，32岁；Sergey Vladimirovich Detistov(СергейВладимировичДетистов)，35岁；Pavel Valeryevich Frolov(ПавелВалерьевичФролов)，28岁；Anatoliy Sergeyevich Kovalev(АнатолийСергеевичКовалев)，29岁；Artem Valeryevich Ochichenko(АртемВалерьевичОчиченко)，27岁；和32岁的皮特·尼古拉耶维奇·普利斯金(ПетрНиколаевичПлискин)均被控七项罪名：合谋进行电脑诈骗和滥用、合谋实施电信诈骗、电信诈骗、损坏受保护的电脑以及严重的身份盗窃。*每项罪名都对每位被告提出指控。然而，起诉书中包含的指控仅仅是指控，除非并直到证明有罪，否则被告被推定无罪。\n起诉书指控每名被告为进一步实施被指控的罪行而犯下以下公开行为：\n·黑客对格鲁吉亚议会官方域名进行了技术侦察，并试图未经授权进入其网络。\n被告及其同谋对世界各地的计算机网络造成了破坏和破坏，包括法国、格鲁吉亚、荷兰、大韩民国、乌克兰、英国和美国。\n例如，NotPetya恶意软件传播到世界各地，损坏了关键基础设施中使用的计算机，并造成了巨大的经济损失。然而，这些损失只是伤害的一部分。例如，NotPetya恶意软件损害了遗产谷通过其两家医院、60个办公室和18个社区卫星设施向宾夕法尼亚州西区公民提供关键医疗服务的能力。这次攻击导致无法获得患者名单、患者历史、体检文件和实验室记录。传统谷无法访问其关键任务计算机系统(如与心脏病学、核医学、放射学有关的系统)。约一周，管理计算机系统近一个月，从而对公众健康和安全造成威胁。\n合谋实施计算机欺诈和滥用最高可判处五年监禁；合谋实施电信欺诈最高可判处20年监禁；两项电信欺诈罪名最高可判处20年监禁；故意损坏受保护计算机最高可判处10年监禁；两项严重身份盗窃罪最高可判处两年监禁。起诉书还指控域名注册不实，这将使电信欺诈的最高监禁刑期增加到27年；故意损坏受保护电脑的最高监禁刑期增加到17年；严重身份盗窃的强制性监禁刑期增加到4年。然而，这些潜在的最高刑期是国会规定的，仅供参考，因为指定的法官将决定被告的任何判决。\n被告科瓦列夫此前在哥伦比亚特区的联邦起诉书编号CR 18-215中被控密谋未经授权进入参与2016年美国选举管理的美国个人和实体的电脑。\n审判检察官希瑟·阿尔皮诺和国家安全司反情报和出口管制科副科长肖恩·纽威尔，宾夕法尼亚州西区检察官办公室的助理美国检察官查尔斯·埃伯利和杰西卡·斯莫拉尔正在对此案提起公诉，以及联邦调查局亚特兰大、俄克拉何马城和匹兹堡的外地办事处在联邦调查局网络司的协助下进行调查。\n刑事审判处国际事务办公室在此案中提供了关键协助，该部门还赞赏乌克兰当局、韩国和新西兰政府、格鲁吉亚当局和英国情报机构以及美国联邦调查局的许多法律专员和世界各地的其他外国当局提供的重大合作和协助，以及众多受害者在调查中给予合作并提供宝贵协助。\n该部门还感谢谷歌，包括其威胁分析小组(TAG)；思科，包括其Talos情报小组；Facebook；以及Twitter，感谢他们在此次调查中提供的协助；一些私营部门公司因违反这些公司的服务条款而独立关闭了许多账户。", "note_en": "On Oct. 15, 2020, a federal grand jury in Pittsburgh returned an indictment charging six computer hackers, all of whom were residents and nationals of the Russian Federation (Russia) and officers in Unit 74455 of the Russian Main Intelligence Directorate (GRU), a military intelligence agency of the General Staff of the Armed Forces.\n These GRU hackers and their co-conspirators engaged in computer intrusions and attacks intended to support Russian government efforts to undermine, retaliate against, or otherwise destabilize: (1) Ukraine; (2) Georgia; (3) elections in France; (4) efforts to hold Russia accountable for its use of a weapons-grade nerve agent, Novichok, on foreign soil; and (5) the 2018 PyeongChang Winter Olympic Games after Russian athletes were banned from participating under their nation’s flag, as a consequence of Russian government-sponsored doping effort.\n Their computer attacks used some of the world’s most destructive malware to date, including: KillDisk and Industroyer, which each caused blackouts in Ukraine; NotPetya, which caused nearly $1 billion in losses to the three victims identified in the indictment alone; and Olympic Destroyer, which disrupted thousands of computers used to support the 2018 PyeongChang Winter Olympics.  The indictment charges the defendants with conspiracy, computer hacking, wire fraud, aggravated identity theft, and false registration of a domain name.\n According to the indictment, beginning in or around November 2015 and continuing until at least in or around October 2019, the defendants and their co-conspirators deployed destructive malware and took other disruptive actions, for the strategic benefit of Russia, through unauthorized access  to victim computers (hacking).  As alleged, the conspiracy was responsible for the following destructive, disruptive, or otherwise destabilizing computer intrusions and attacks:\n Ukrainian Government &amp; Critical Infrastructure: December 2015 through December 2016 destructive malware attacks against Ukraine’s electric power grid, Ministry of Finance, and State Treasury Service, using malware known as BlackEnergy, Industroyer, and KillDisk;\n  French Elections: April and May 2017 spearphishing campaigns and related hack-and-leak efforts targeting French President Macron’s “La République En Marche!” (En Marche!) political party, French politicians, and local French governments prior to the 2017 French elections;\n  Worldwide Businesses and Critical Infrastructure (NotPetya): June 27, 2017 destructive malware attacks that infected computers worldwide using malware known as NotPetya, including hospitals and other medical facilities in the Heritage Valley Health System (Heritage Valley) in the Western District of Pennsylvania; a FedEx Corporation subsidiary, TNT Express B.V.; and a large U.S. pharmaceutical manufacturer, which together suffered nearly $1 billion in losses from the attacks;\n  PyeongChang Winter Olympics Hosts, Participants, Partners, and Attendees: December 2017 through February 2018 spearphishing campaigns and malicious mobile applications targeting South Korean citizens and officials, Olympic athletes, partners, and visitors, and International Olympic Committee (IOC) officials;\n  PyeongChang Winter Olympics IT Systems (Olympic Destroyer): December 2017 through February 2018 intrusions into computers supporting the 2018 PyeongChang Winter Olympic Games, which culminated in the Feb. 9, 2018, destructive malware attack against the opening ceremony, using malware known as Olympic Destroyer;\n  Novichok Poisoning Investigations: April 2018 spearphishing campaigns targeting investigations by the Organisation for the Prohibition of Chemical Weapons (OPCW) and the United Kingdom’s Defence Science and Technology Laboratory (DSTL) into the nerve agent poisoning of Sergei Skripal, his daughter, and several U.K. citizens; and\n  Georgian Companies and Government Entities: a 2018 spearphishing campaign targeting a major media company, 2019 efforts to compromise the network of Parliament, and a wide-ranging website defacement campaign in 2019.\n Cybersecurity researchers have tracked the Conspirators and their malicious activity using the labels “Sandworm Team,” “Telebots,” “Voodoo Bear,” and “Iron Viking.”\n The charges were announced by Assistant Attorney General John C. Demers; FBI Deputy Director David Bowdich; U.S. Attorney for the Western District of Pennsylvania Scott W. Brady; and Special Agents in Charge of the FBI’s Atlanta, Oklahoma City, and Pittsburgh Field Offices, J.C. “Chris” Hacker, Melissa R. Godbold, and Michael A. Christman, respectively.\n “No country has weaponized its cyber capabilities as maliciously or irresponsibly as Russia, wantonly causing unprecedented damage to pursue small tactical advantages and to satisfy fits of spite,” said Assistant Attorney General for National Security John C. Demers.  “Today the department has charged these Russian officers with conducting the most disruptive and destructive series of computer attacks ever attributed to a single group, including by unleashing the NotPetya malware.  No nation will recapture greatness while behaving in this way.”\n “The FBI has repeatedly warned that Russia is a highly capable cyber adversary, and the information revealed in this indictment illustrates how pervasive and destructive Russia’s cyber activities truly are,” said FBI Deputy Director David Bowdich.  “But this indictment also highlights the FBI’s capabilities.  We have the tools to investigate these malicious malware attacks, identify the perpetrators, and then impose risks and consequences on them.  As demonstrated today, we will relentlessly pursue those who threaten the United States and its citizens.”\n “For more than two years we have worked tirelessly to expose these Russian GRU Officers who engaged in a global campaign of hacking, disruption and destabilization, representing the most destructive and costly cyber-attacks in history,” said U.S. Attorney Scott W. Brady for the Western District of Pennsylvania.  “The crimes committed by Russian government officials were against real victims who suffered real harm.  We have an obligation to hold accountable those who commit crimes – no matter where they reside and no matter for whom they work – in order to seek justice on behalf of these victims.”\n “The exceptional talent and dedication of our teams in Pittsburgh, Atlanta and Oklahoma City who spent years tracking these members of the GRU is unmatched,” said FBI Pittsburgh Special Agent in Charge Michael A. Christman.  “These criminals underestimated the power of shared intelligence, resources and expertise through law enforcement, private sector and international partnerships.”\n The defendants, Yuriy Sergeyevich Andrienko (Юрий Сергеевич Андриенко), 32; Sergey Vladimirovich Detistov (Сергей Владимирович Детистов), 35; Pavel Valeryevich Frolov (Павел Валерьевич Фролов), 28; Anatoliy Sergeyevich Kovalev (Анатолий Сергеевич Ковалев), 29; Artem Valeryevich Ochichenko (Артем Валерьевич Очиченко), 27; and Petr Nikolayevich Pliskin (Петр Николаевич Плискин), 32, are all charged in seven counts: conspiracy to conduct computer fraud and abuse, conspiracy to commit wire fraud, wire fraud, damaging protected computers, and aggravated identity theft.  Each defendant is charged in every count.  The charges contained in the indictment are merely accusations, however, and the defendants are presumed innocent unless and until proven guilty beyond a reasonable doubt.\n The indictment accuses each defendant of committing the following overt acts in furtherance of the charged crimes:\n ·       Conducted technical reconnaissance of the Parliament of Georgia official domain and attempted to gain unauthorized access to its network.\n The defendants and their co-conspirators caused damage and disruption to computer networks worldwide, including in France, Georgia, the Netherlands, Republic of Korea, Ukraine, the United Kingdom, and the United States.\n The NotPetya malware, for example, spread worldwide, damaged computers used in critical infrastructure, and caused enormous financial losses.  Those losses were only part of the harm, however.  For example, the NotPetya malware impaired Heritage Valley’s provision of critical medical services to citizens of the Western District of Pennsylvania through its two hospitals, 60 offices, and 18 community satellite facilities.  The attack caused the unavailability of patient lists, patient history, physical examination files, and laboratory records.  Heritage Valley lost access to its mission-critical computer systems (such as those relating to cardiology, nuclear medicine, radiology, and surgery) for approximately one week and administrative computer systems for almost one month, thereby causing a threat to public health and safety.\n The conspiracy to commit computer fraud and abuse carries a maximum sentence of five years in prison; conspiracy to commit wire fraud carries a maximum sentence of 20 years in prison; the two counts of wire fraud carry a maximum sentence of 20 years in prison; intentional damage to a protected computer carries a maximum sentence of 10 years in prison; and the two counts of aggravated identity theft carry a mandatory sentence of two years in prison.  The indictment also alleges false registration of domain names, which would increase the maximum sentence of imprisonment for wire fraud to 27 years in prison; the maximum sentence of imprisonment for intentional damage to a protected computer to 17 years in prison; and the mandatory sentence of imprisonment for aggravated identity theft to four years in prison.  These maximum potential sentences are prescribed by Congress, however, and are provided here for informational purposes only, as the assigned judge will determine any sentence of a defendant.\n Defendant Kovalev was previously charged in federal indictment number CR 18-215, in the District of Columbia, with conspiring to gain unauthorized access into the computers of U.S. persons and entities involved in the administration of the 2016 U.S. elections.\n Trial Attorney Heather Alpino and Deputy Chief Sean Newell of the National Security Division’s Counterintelligence and Export Control Section and Assistant U.S. Attorneys Charles Eberle and Jessica Smolar of the U.S. Attorney’s Office for the Western District of Pennsylvania are prosecuting this case.  The FBI’s Atlanta, Oklahoma City, and Pittsburgh field offices conducted the investigation, with the assistance of the FBI’s Cyber Division.\n The Criminal Division’s Office of International Affairs provided critical assistance in this case.  The department also appreciates the significant cooperation and assistance provided by Ukrainian authorities, the Governments of the Republic of Korea and New Zealand, Georgian authorities, and the United Kingdom’s intelligence services, as well as many of the FBI’s Legal Attachés and other foreign authorities around the world.  Numerous victims cooperated and provided valuable assistance in the investigation.\n The department is also grateful to Google, including its Threat Analysis Group (TAG); Cisco, including its Talos Intelligence Group; Facebook; and Twitter, for the assistance they provided in this investigation.  Some private sector companies independently disabled numerous accounts for violations of the companies’ terms of service.", "posttime": "2020-10-20 02:24:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,官员,officers,俄罗斯", "title": "六名GRU官员被控与全球部署恶意软件有关", "title_en": "Six GRU Officers Charged in Connection with Worldwide Deployment of Malware", "transed": 1, "url": "https://www.justice.gov/opa/pr/six-russian-gru-officers-charged-connection-worldwide-deployment-destructive-malware-and", "via": "", "real_tags": ["软件", "官员", "officers", "俄罗斯"]}, {"category": "", "categoryclass": "", "imagename": "fb8f830e91610e836f6a688410d09cf6.jpg", "infoid": 1029876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这张照片在秘鲁的一个山坡上绵延40码，显示了一种生物，有尖尖的耳朵，球状的眼睛和长长的条纹尾巴。它看起来像是一只猫在懒洋洋地躺着，就像猫经常做的那样。\n秘鲁文化部上周宣布，考古学家在重建联合国教科文组织遗产纳斯卡线(Nazca Lines)时无意中发现了褪色的蚀刻。\n专家称，这幅猫形地形图可以追溯到公元前200年至公元前100年，是此前在首都利马东南约250英里(约合250公里)的纳斯卡镇和帕尔帕镇之间发现的大型动植物雕刻中的最新发现。\n文化部在一份声明中说：“这一发现再次显示了这个遗址丰富多彩的文化遗产。”\n1927年，秘鲁的一位航空测量员首次发现了纳斯卡线。在现场出土了一只蜂鸟、一只猴子和一只虎鲸的图像。自1994年以来，教科文组织已将纳斯卡和帕尔帕的线条和地理符号指定为世界遗产。\n据信，这幅猫蚀刻画比之前在纳斯卡出土的任何史前地理符号都要古老。\n秘鲁纳斯卡线的首席考古学家约翰尼·艾拉(Johny Isla)告诉西班牙新闻机构Efe，“我们仍在发现新的遗像，这相当令人震惊，但我们也知道还有更多有待发现的东西。”\n这些设计被认为是古代秘鲁人刮掉一层深色和岩石的泥土时创造的，这层泥土与下面的浅色沙子形成了鲜明对比。研究人员认为，这些数字曾经是旅行的标志。\n艾拉说，无人机摄影在最近几年带来了几项发现。2019年，来自日本的研究人员在卫星摄影和三维成像的辅助下，在遗址上发现了140多个新的地形文字。\n即使在冠状病毒大流行期间，该遗址的研究和保护工作仍在继续，当时大多数旅游景点都已关闭。考古学家和员工正在米拉多自然保护区(Mirador Natural)工作，这是受保护地点的一个瞭望点，这时他们开始挖掘出一些有趣的东西。当他们清理土堆时，出现了清晰的线条，显示出一只猫蜿蜒的身体。\n文化部在一份声明中说：“这个数字几乎看不见，即将消失，因为它位于一个相当陡峭的斜坡上，容易受到自然侵蚀的影响。”\n当局表示，即使是流浪的脚印也可能破坏脆弱的地面，并已制定了严格的规定，禁止非法侵入该地点。在大流行关闭旅游之前，游客只能从飞机和瞭望点查看线条和数字。\n秘鲁官员说，2014年，绿色和平活动人士在一只大型蜂鸟的设计附近留下了鞋印，当时他们放置了一个促进可再生能源的标志。\n秘鲁官员兼考古学家路易斯·詹姆·卡斯蒂略(Luis Jaime Castillo)当时告诉“卫报”：“你走到那里，脚印将持续数百年或数千年。”“他们摧毁的那条线路是所有线路中最显眼、最受认可的。”\n2018年，一名卡车司机在故意驾驶他的拖拉机拖车穿过三行地形文字后被捕。\n就在秘鲁努力保护其古迹的同时，官员们本月为一名幸运的游客重新开放了马丘比丘，因为他在大流行期间被困，并等了七个月才看到16世纪的印加城堡。", "note_en": "The image, stretching for 40 yards on a hillside in Peru, shows a creature with pointy ears, orb-like eyes and a long striped tail. It appears to be a cat lounging, as cats often do.\n Archaeologists stumbled across the faded etching while remodeling a section of a UNESCO heritage site known as the Nazca Lines, Peru’s Ministry of Culture announced last week.\n The catlike geoglyph — which experts say dates to 200 B.C. to 100 B.C. — is the latest discovery among the carvings of larger-than-life animals and plants previously found between the towns of Nazca and Palpa, in a desert plain about 250 miles southeast of the capital, Lima.\n “The discovery shows, once again, the rich and varied cultural legacy of this site,” the ministry said in a statement.\n The Nazca Lines were first discovered by  a Peruvian aerial surveyor in 1927. Images of a hummingbird, a monkey and an orca were unearthed at the site. UNESCO has designated the  Lines and Geoglyphs of Nasca and Palpa a World Heritage Site since 1994.\n The cat etching is believed to be older than any of the prehistoric geoglyphs previously unearthed at Nazca.\n “It’s quite striking that we’re still finding new figures, but we also know that there are more to be found,” Johny Isla, Peru’s chief archaeologist for the Nazca lines, told Efe, a Spanish news agency.\n The designs were believed to have been created when ancient Peruvians scraped off a dark and rocky layer of earth, which contrasts with lighter-colored sand underneath. Researchers believe that the figures once  served as travel markers.\n Drone photography has led to several discoveries in recent years, Mr. Isla said. In 2019, researchers from Japan, aided by satellite photography and three-dimensional imaging,  unearthed more than 140 new geoglyphs at the site.\n Research and conservation work had continued at the site even during the coronavirus pandemic, when most tourist sites have been closed. Archaeologists and employees were working on the Mirador Natural, a lookout point in the protected site, when they began unearthing something intriguing. When they cleaned the mound, clear lines showing the sinuous body of a cat emerged.\n “The figure was barely visible and was about to disappear because it is situated on quite a steep slope that’s prone to the effects of natural erosion,” the culture ministry said in a  statement.\n The authorities said that even a stray footprint could mar the fragile grounds, and have imposed strict rules against trespassing at the site. Before the pandemic shut down tours, visitors were permitted to view the lines and figures only from planes and lookout points.\n  In 2014, Greenpeace activists  left shoe marks near a large hummingbird design when they placed a sign that promoted renewable energy, Peruvian officials said.\n “You walk there and the footprint is going to last hundreds or thousands of years,” Luis Jaime Castillo, a Peruvian official and archaeologist,  told The Guardian at the time. “And the line that they have destroyed is the most visible and most recognized of all.”\n In 2018,  a truck driver was arrested after intentionally driving his tractor-trailer across three lines of geoglyphs.\n Even as Peru works to preserve its ancient sites, officials reopened  Machu Picchu this month for one lucky tourist after he became stranded during the pandemic and waited seven months to see the 16th-century Inca citadel.", "posttime": "2020-10-20 02:24:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "猫咪,cat,纳斯卡", "title": "秘鲁纳斯卡线遗址发现2K年前的猫咪蚀刻", "title_en": "2k-Year-Old Cat Etching Found at Nazca Lines Site in Peru", "transed": 1, "url": "https://www.nytimes.com/2020/10/19/world/americas/peru-cat-nazca-lines-nasca.html", "via": "", "real_tags": ["猫咪", "cat", "纳斯卡"]}, {"category": "", "categoryclass": "", "imagename": "34afa80e2a658d3608af0a50877a34f9.jpeg", "infoid": 1029874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Datasette(以前)是我用于浏览和发布结构化数据的开源工具。在Datasette中嵌入了很多想法。我意识到我并没有把很多东西写下来。\nDatasette为您的数据提供只读API。它不尝试处理写入。完全避免写入是众多有趣属性的基础，其中许多属性将在下面进一步展开。简而言之：\n在2018年，托管没有读/写持久性要求的web应用非常便宜--通常是免费的(Zeit Now和Heroku都有慷慨的免费层级)。这是一件大事：即使每月支付几美元也足以对共享数据进行统计，因为现在你必须找出谁来支付，并确保未来的支付不会过期。\n因为是只读的，所以很难扩展：只需添加更多实例，每个实例都有自己的数据副本。在扩展Web应用程序时，与可写数据存储相关的所有难题都可以完全跳过。\n由于数据库文件是使用SQLite的不可变模式打开的，因此我们可以接受任意SQL查询，而不会有损坏数据的风险。\n每当您的数据发生更改时，您都需要发布整个数据库的全新副本。有了合适的主机，这很容易做到：在现有实时部署的同时部署全新的数据和应用程序副本，然后在负载平衡器级别将传入的HTTP流量切换到您的API。Heroku和Zeit现在都支持这一开箱即用的策略。\n由于数据是只读的，并且封装在单个二进制SQLite数据库文件中，因此我们可以将数据捆绑为应用程序的一部分。这意味着我们可以轻松地创建和发布Docker镜像，这些镜像既可以提供数据，也可以提供访问它的API和UI。我们还可以发布到允许我们运行Python应用程序的任何宿主提供程序，而不需要提供可变数据库。\nDatasette Package命令获取一个或多个SQLite数据库，并将它们与Datasette应用程序捆绑在单个Docker映像中，随时可以部署到可以运行Docker容器的任何位置。\n关系数据库很棒：一旦您知道如何使用它们，就可以使用精心设计的模式来表示您能想象到的任何数据。\n如果数据过于非结构化，不适合关系模式怎么办？SQLite包括对JSON数据的出色支持-因此，如果您不能塑造适合表模式的数据，您可以将其存储为JSON的文本BLOB-并使用SQLite的JSON函数来过滤或提取特定字段。\n那么二进制数据呢？即使是这样，SQLite也会很高兴地存储二进制blob。我的Datasette-Render-Image插件(这里是实时演示)是一个处理存储在SQLite blob中的二进制图像数据的工具示例。\n如果我的数据太大怎么办？Datasette不是一个“大数据”工具，但是如果您对大数据的定义不适合RAM，那么这个门槛会一直在增加(单个AWS实例上2TB的RAM现在的成本不到4美元/小时)。\n我个人从多GB SQLite数据库和Datasette中获得了很好的结果。单个SQLite数据库的理论最大大小约为140TB。\nSQLite还内置了对好得出奇的全文搜索的支持，并且由于模块的可扩展性，它以SpatiaLite扩展的形式提供了出色的地理空间功能。Datasette从这个更广泛的生态系统中获益良多。\n大多数开发人员避免将SQLite用于生产Web应用程序的原因是，它不能出色地处理大量并发写入。由于数据集是只读的，我们可以完全忽略此限制。\n既然Datasette实例中的数据永远不会更改，为什么不永远缓存对它的调用呢？\nDatasette在每个API响应中发送一个遥远的HTTP缓存过期标头。这意味着浏览器只会在第一次访问特定URL时获取数据，如果您在CDN(如Fastly或Cloudflare)后面托管Datasette，则每个唯一的API调用只会访问Datasette一次，然后CDN基本上会永远缓存它。\n这意味着使用廉价托管的Datasette支持的API将JavaScript应用程序部署到即使是高流量站点的首页也是安全的-CDN将很容易承担负载。\n早在7月份，Zeit就将Cloudflare添加到了每个部署中(甚至包括他们的免费层)，因此，如果您在那里托管，就可以免费获得CDN好处。\n如果您重新发布数据的更新副本，该怎么办？Datasette也涵盖了这一点。您可能已经注意到，每个DataSet数据库在部署时都会自动获得一个散列后缀：\n此后缀基于整个数据库文件内容的SHA256散列，因此对数据的任何更改都将导致新的URL。如果您查询以前的后缀，Datasette会通知您并将您重定向到新的后缀。\n如果您知道要更改数据，则可以根据无后缀的URL构建应用程序。这将不会被高速缓存，并且将总是302重定向到正确的版本(并且这些重定向非常快)。\n重定向发送一个HTTP/2Push报头，这样，如果您在理解推送的CDN(比如Cloudflare)后面运行，您的浏览器就不必发出两个请求来跟踪重定向。您可以使用Chrome DevTools查看实际操作：\n最后，如果出于某种原因需要退出HTTP缓存，您可以在URL查询字符串中包含？_ttl=0，以针对每个请求禁用它。-例如，如果您想要返回复仇者联盟的随机成员，则缓存响应没有意义：\nDatasette的目标是尽可能减少在网上发布有趣数据的摩擦。\n#部署到Herokudatasette发布Heroku mydatabase ase.db#或部署到Zeit NowDataette立即发布mydatabase.db。\n这些命令获取一个或多个SQLite数据库，将它们上传到主机提供商，配置一个Datasette实例为它们提供服务，并返回新部署的应用程序的公共URL。\n开箱即用，Datasette现在既可以发布到Heroku，也可以发布到Zeit。PUBLISH_SUBMAND插件钩子意味着可以通过编写插件来支持其他提供程序。\nDatasette认为，只要有可能，数据都应该伴随着源信息和许可证。可以与您的数据捆绑在一起的metadata.json文件支持这些功能。您还可以在运行数据集发布时提供源和许可证信息：\n当您使用这些选项时，Datasette将在部署过程中为您创建相应的metadata.json文件。\n我真的很喜欢分面搜索：每当我想要开始理解数据集合时，它都是我求助的第一个工具。我在Solr、Elasticsearch和PostgreSQL的基础上构建了多方面搜索引擎，许多我最喜欢的工具(如Splunk和Datadog)都将其作为核心功能。\nDataset自动尝试计算每个表的面。你可以在这里阅读关于Datasette facets特性的更多信息--作为一个巨大的分面搜索迷，它是我一直以来最喜欢的项目特性之一。现在我可以将SQLite添加到我用来构建分面搜索的技术列表中了！\nCSV是迄今为止最常用的在线共享和发布数据格式。几乎每个有用的数据工具都可以导出到它，并且它仍然是电子表格导入和导出的通用语言。\n它有许多缺陷：它不能很容易地表示嵌套的数据结构，包含逗号的值的转义规则实现不一致，并且它没有表示字符编码的标准方式。\nDatasette旨在将SQLite提升为更好的发布数据的默认格式。我更愿意下载一个充满预结构化数据的.db文件，而不是下载一个.csv，然后不得不将其重新组织为一项单独的工作。\n但与庞大的CSV生态系统良好互动是至关重要的。Datasette具有强大的CSV导出功能：您可以看到的任何数据都可以导出-包括任意SQL查询的结果。如果您的查询可以分页，Datasette可以向下传输单个CSV文件中的每一页。\nDatasette的姊妹工具CSV-to-sqlite处理等式的另一边：将数据从CSV导入SQLite表。此外，Datasette Publish Web应用程序允许用户上传其CSV，并将其直接部署到自己的全新Datasette实例中-不需要命令行。\n现在很多人都对GraphQL感到兴奋，因为它允许API客户端准确地请求他们需要的数据，包括在单个查询中遍历到相关对象。\n大多数API不允许人们向它们传递任意SQL查询的原因有很多：\n性能：如果有人发送的意外(或故意)昂贵的查询耗尽了我们的资源，该怎么办？\n隐藏实现细节：如果人们针对我们的API编写SQL，我们就永远不能更改数据库表的结构。\n在安全性方面：数据是只读的，使用SQLite的不可变模式。您不能用查询插入来破坏它，更新只会抛出无害的错误。\n在性能方面：SQLite有一种机制来取消耗时超过特定阈值的查询。默认情况下，Datasette将其设置为1秒，但如果需要，您可以更改该配置(在笔记本电脑上浏览多GB数据时，我经常将其设置为10秒)。\n关于隐藏的实现细节：因为我们发布的是静态数据，而不是维护不断发展的API，所以我们基本上可以忽略这个问题。如果您确实担心这个问题，您可以利用预录查询和SQL视图定义将精心选择的向前兼容视图公开到您的数据中。\n我在上面提到了Datasette的SQL时间限制。它们不仅仅是为了避免恶意查询：“乐观SQL求值”的概念已经融入到Datasette的一些核心特性中。\n考虑建议的方面-Datasette检查您查看的任何表，并尝试建议值得针对其进行方面的列。\n其工作方式是Datasette遍历表中的每一列，并运行查询以查看该列的唯一值是否少于20个。在大型表上，这可能会花费令人望而却步的时间，因此Datasette对这些查询设置了激进的超时：只有50ms。如果查询在该时间内运行失败，它将被静默删除，并且该列不会作为建议的方面列出。\nDatasette的JSON API为JavaScript应用程序提供了使用相同模式的机制。如果将？_TimeLimit=20添加到任何Datasette API调用，底层查询将只有20ms的运行时间。如果成功，您将从API获得非常快速的错误响应。这意味着您可以设计自己的功能，尝试乐观地运行昂贵的查询，而不会损害应用程序的性能。\n使用OFFSET/LIMIT的SQL分页有一个致命的缺陷：如果以每页20的速度请求页码300，底层SQL引擎需要计算和排序前面的所有6000行，然后才能返回您请求的20行。\n键集分页(通常也称为其他名称，包括基于指针的分页)是一种更有效的数据分页方法。它对有序数据起作用。每页返回一个表示您最后看到的记录的令牌，然后当您请求下一页时，引擎只需过滤大于该标记化值的记录，并扫描接下来的20条记录即可。\n(实际上，它扫描21个。通过请求比您打算显示的记录多一条记录，您可以检测是否存在另一页结果-如果您请求21条记录，但得到的结果少于或等于20条，则您知道您是在最后一页。)。\n数据集默认为按主键(或SQLite行ID)排序。这非常适合进行高效的分页：对主键列运行SELECT以查找大于X的值是任何数据库都能支持的最快的范围扫描查询之一。这允许用户根据自己的喜好进行分页，而无需支付偏移/限制性能损失。\n这也是“将所有行导出为CSV”选项的工作方式：当您选择该选项时，Datasette会向您的浏览器打开一个流，并在内部开始对整个表进行键集分页。这样即使在流回数百万行的情况下也能保持对资源使用的控制。\n这就是Datasette的用武之地：它还处理任何其他排序顺序的键集分页。如果按任何列排序并单击“下一步”，您将请求上一次看到的值之后的下一组行。这甚至适用于包含重复值的列：如果您按这样的列排序，Datasette实际上会结合主键按该列排序。它生成的“NEXT”分页标记对排序值和主键都进行了编码，这样当您单击链接时，它就可以正确地为您提供下一页。\n尝试单击此页面上的“下一步”，查看针对已排序列的键集分页操作。\n我喜欢互动演示。我决定，如果Datasette的每个版本都有一个永久性的交互式演示来说明它的功能，那将会很有用。\n多亏了Zeit Now，这很容易设置。实际上，我已经更进一步：在GitHub上成功推送到Master的每一次推送都会部署到一个永久的URL。\nHttps://latest.datasette.io/-对数据集主设备的最新提交。您可以查看https://latest.datasette.io/-/versions上当前部署的提交散列，并将其与https://github.com/simonw/datasette/commits进行比较。\nHttps://v0-25.datasette.io/是0.25标签版本数据集的永久网址。另请参阅https://v0-24.datasette.io/和https://v0-23-2.datasette.io/。\n此演示使用的数据库与Datasette的单元测试装置创建的数据库完全相同。单元测试已经设计用于执行每个功能，因此重用它们作为实时演示非常有意义。\n通过从GitHub签出完整的Datasette存储库并运行以下命令，您可以在自己的计算机上查看此测试数据库：\n下面是Datasette Travis CI配置中的代码，它为每个提交和发布的标记部署一个实时演示。\nDatasette的单元测试包括一些断言，以确保文档中提到每个插件挂钩、配置设置和底层视图类。在不更新文档(或至少确保文档中有相应的标题)的情况下添加或修改这些内容的提交或拉入请求将无法通过其测试。\nDatasette的文档现在相当不错，ChangeLog提供了我添加到项目中的新功能的详细概述。我在8月份的PyBay会议上展示了Datasette，我已经发表了那次演讲的注释幻灯片。我在5月份为Changelog播客接受了关于Datasette的采访，我在那次对话中的笔记包括了一些我最喜欢的演示。\nDatasette现在有了一个官方Twitter账号-你可以在那里关注@Datetteproj，以获得关于该项目的最新消息。", "note_en": "Datasette ( previously) is my open source tool for exploring and publishing structured data. There are a lot of ideas embedded in Datasette. I realized that I haven’t put many of them into writing.\n   Datasette provides a read-only API to your data. It makes no attempt to deal with writes. Avoiding writes entirely is fundamental to a plethora of interesting properties, many of which are expanded on further below. In brief:\n Hosting web applications with no read/write persistence requirements is incredibly cheap in 2018—often free (both  ZEIT Now and a  Heroku have generous free tiers). This is a big deal: even having to pay a few dollars a month is enough to dicentivise sharing data, since now you have to figure out who will pay and ensure the payments don’t expire in the future.\n Being read-only makes it trivial to scale: just add more instances, each with their own copy of the data. All of the hard problems in scaling web applications that relate to writable data stores can be skipped entirely.\n Since the database file is opened using SQLite’s  immutable mode, we can accept arbitrary SQL queries with no risk of them corrupting the data.\n Any time your data changes, you need to publish a brand new copy of the whole database. With the right hosting this is easy: deploy a brand new copy of your data and application in parallel to your existing live deployment, then switch over incoming HTTP traffic to your API at the load balancer level. Heroku and Zeit Now both support this strategy out of the box.\n  Since the data is read-only and is encapsulated in a single binary SQLite database file, we can bundle the data as part of the app. This means we can trivially create and publish Docker images that provide both the data and the API and UI for accessing it. We can also publish to any hosting provider that will allow us to run a Python application, without also needing to provision a mutable database.\n The  datasette package command takes one or more SQLite databases and bundles them together with the Datasette application in a single Docker image, ready to be deployed anywhere that can run Docker containers.\n   Relational database are great: once you know how to use them, you can represent any data you can imagine using a carefully designed schema.\n What about data that’s too unstructured to fit a relational schema? SQLite includes excellent  support for JSON data—so if you can’t shape your data to fit a table schema you can instead store it as text blobs of JSON—and use SQLite’s JSON functions to filter by or extract specific fields.\n What about binary data? Even that’s covered: SQLite will happily store binary blobs. My  datasette-render-images plugin ( live demo here) is one example of a tool that works with binary image data stored in SQLite blobs.\n What if my data is too big? Datasette is not a “big data” tool, but if your definition of big data is something that won’t fit in RAM that threshold is growing all the time (2TB of RAM on a single AWS instance  now costs less than $4/hour).\n I’ve personally had great results from multiple GB SQLite databases and Datasette. The theoretical maximum size of a single SQLite database is  around 140TB.\n SQLite also has built-in support for  surprisingly good full-text search, and thanks to being extensible via modules has excellent geospatial functionality in the form of the  SpatiaLite extension. Datasette benefits enormously from this wider ecosystem.\n The reason most developers avoid SQLite for production web applications is that it doesn’t deal brilliantly with large volumes of concurrent writes. Since Datasette is read-only we can entirely ignore this limitation.\n  Since the data in a Datasette instance never changes, why not cache calls to it forever?\n Datasette sends a far future HTTP cache expiry header with every API response. This means that browsers will only ever fetch data the first time a specific URL is accessed, and if you host Datasette behind a CDN such as  Fastly or  Cloudflare each unique API call will hit Datasette just once and then be cached essentially forever by the CDN.\n This means it’s safe to deploy a JavaScript app using an inexpensively hosted Datasette-backed API to the front page of even a high traffic site—the CDN will easily take the load.\n Zeit added Cloudflare to every deployment (even their free tier)  back in July, so if you are hosted there you get this CDN benefit for free.\n What if you re-publish an updated copy of your data? Datasette has that covered too. You may have noticed that every Datasette database gets a hashed suffix automatically when it is deployed:\n  This suffix is based on the SHA256 hash of the entire database file contents—so any change to the data will result in new URLs. If you query a previous suffix Datasette will notice and redirect you to the new one.\n If you know you’ll be changing your data, you can build your application against the non-suffixed URL. This will not be cached and will always 302 redirect to the correct version (and these redirects are extremely fast).\n  The redirect sends an HTTP/2 push header such that if you are running behind a CDN that understands push ( such as Cloudflare) your browser won’t have to make two requests to follow the redirect. You can use the Chrome DevTools to see this in action:\n  And finally, if you need to opt out of HTTP caching for some reason you can disable it on a per-request basis by including  ?_ttl=0  in the URL query string. —for example, if you want to return a random member of the Avengers it doesn’t make sense to cache the response:\n   Datasette aims to reduce the friction for publishing interesting data online as much as possible.\n  # deploy to Herokudatasette publish heroku mydatabase.db# Or deploy to Zeit Nowdatasette publish now mydatabase.db\n These commands take one or more SQLite databases, upload them to a hosting provider, configure a Datasette instance to serve them and return the public URL of the newly deployed application.\n Out of the box, Datasette can publish to either Heroku or to Zeit Now. The  publish_subcommand plugin hook means other providers can be supported by writing plugins.\n  Datasette believes that data should be accompanied by source information and a license, whenever possible. The  metadata.json file that can be bundled with your data supports these. You can also provide source and license information when you run  datasette publish:\n  When you use these options Datasette will create the corresponding  metadata.json file for you as part of the deployment.\n  I really love faceted search: it’s the first tool I turn to whenever I want to start understanding a collection of data. I’ve built faceted search engines on top of Solr, Elasticsearch and PostgreSQL and many of my favourite tools (like Splunk and Datadog) have it as a core feature.\n Datasette automatically attempts to calculate facets against every table. You can read  more about the Datasette Facets feature here—as a huge faceted search fan it’s one of my all-time favourite features of the project. Now I can add SQLite to the list of technologies I’ve used to build faceted search!\n  CSV is by far the most common format for sharing and publishing data online. Almost every useful data tool has the ability to export to it, and it remains the lingua franca of spreadsheet import and export.\n It has many flaws: it can’t easily represent nested data structures, escaping rules for values containing commas are inconsistently implemented and it doesn’t have a standard way of representing character encoding.\n Datasette aims to promote SQLite as a much better default format for publishing data. I would much rather download a .db file full of pre-structured data than download a .csv and then have to re-structure it as a separate piece of work.\n But interacting well with the enormous CSV ecosystem is essential. Datasette has  deep CSV export functionality: any data you can see, you can export—including the results of arbitrary SQL queries. If your query can be paginated Datasette can stream down every page in a single CSV file for you.\n Datasette’s sister-tool  csvs-to-sqlite handles the other side of the equation: importing data from CSV into SQLite tables. And the  Datasette Publish web application allows users to upload their CSVs and have them deployed directly to their own fresh Datasette instance—no command line required.\n  A lot of people these days are excited about  GraphQL, because it allows API clients to request exactly the data they need, including traversing into related objects in a single query.\n  There are a number of reasons most APIs don’t allow people to pass them arbitrary SQL queries:\n Performance: what if someone sends an accidental (or deliberate) expensive query that exhausts our resources?\n Hiding implementation details: if people write SQL against our API we can never change the structure of our database tables\n  On security: the data is read-only, using SQLite’s immutable mode. You can’t damage it with a query—INSERT and UPDATEs will simply throw harmless errors.\n On performance: SQLite has a mechanism for canceling queries that take longer than a certain threshold. Datasette sets this to one second by default, though you can  alter that configuration if you need to (I often bump it up to ten seconds when exploring multi-GB data on my laptop).\n On hidden implementation details: since we are publishing static data rather than maintaining an evolving API, we can mostly ignore this issue. If you are really worried about it you can take advantage of  canned queries and  SQL view definitions to expose a carefully selected forward-compatible view into your data.\n  I mentioned Datasette’s SQL time limits above. These aren’t just there to avoid malicious queries: the idea of “optimistic SQL evaluation” is baked into some of Datasette’s core features.\n Consider  suggested facets—where Datasette inspects any table you view and tries to suggest columns that are worth faceting against.\n The way this works is Datasette loops over  every column in the table and runs a query to see if there are less than 20 unique values for that column. On a large table this could take a prohibitive amount of time, so Datasette sets an aggressive timeout on those queries:  just 50ms. If the query fails to run in that time it is silently dropped and the column is not listed as a suggested facet.\n Datasette’s JSON API provides a mechanism for JavaScript applications to use that same pattern. If you add  ?_timelimit=20 to any Datasette API call, the underlying query will only get 20ms to run. If it goes over you’ll get a very fast error response from the API. This means you can design your own features that attempt to optimistically run expensive queries without damaging the performance of your app.\n  SQL pagination using OFFSET/LIMIT has a fatal flaw: if you request page number 300 at 20 per page the underlying SQL engine needs to calculate and sort all 6,000 preceding rows before it can return the 20 you have requested.\n  Keyset pagination (often known by other names, including cursor-based pagination) is a far more efficient way to paginate through data. It works against ordered data. Each page is returned with a token representing the last record you saw, then when you request the next page the engine merely has to filter for records that are greater than that tokenized value and scan through the next 20 of them.\n (Actually, it scans through 21. By requesting one more record than you intend to display you can detect if another page of results exists—if you ask for 21 but get back 20 or less you know you are on the last page.)\n  Datasette defaults to sorting by primary key (or SQLite rowid). This is perfect for efficient pagination: running a select against the primary key column for values greater than X is one of the fastest range scan queries any database can support. This allows users to paginate as deep as they like without paying the offset/limit performance penalty.\n This is also how the “export all rows as CSV” option works: when you select that option, Datasette opens a stream to your browser and internally starts keyset-pagination over the entire table. This keeps resource usage in check even while streaming back millions of rows.\n Here’s where Datasette gets fancy: it handles keyset pagination for any other sort order as well. If you sort by any column and click “next” you’ll be requesting the next set of rows after the last value you saw. And this even works for columns containing duplicate values: If you sort by such a column, Datasette actually sorts by that column combined with the primary key. The “next” pagination token it generates encodes both the sorted value and the primary key, allowing it to correctly serve you the next page when you click the link.\n Try clicking “next”  on this page to see keyset pagination against a sorted column in action.\n  I love interactive demos. I decided it would be useful if every single release of Datasette had a permanent interactive demo illustrating its features.\n Thanks to Zeit Now, this was pretty easy to set up. I’ve actually taken it a step further: every successful push to master on GitHub is also deployed to a permanent URL.\n  https://latest.datasette.io/—the most recent commit to Datasette master. You can see the currently deployed commit hash on  https://latest.datasette.io/-/versions and compare it to  https://github.com/simonw/datasette/commits\n https://v0-25.datasette.io/ is a permanent URL to the 0.25 tagged release of Datasette. See also  https://v0-24.datasette.io/ and  https://v0-23-2.datasette.io/\n The database that is used for this demo is the exact same database that is created by Datasette’s  unit test fixtures. The unit tests are already designed to exercise every feature, so reusing them for a live demo makes a lot of sense.\n You can view this test database on your own machine by checking out the full Datasette repository from GitHub and running the following:\n  Here’s  the code in the Datasette Travis CI configuration that deploys a live demo for every commit and every released tag.\n   Datasette’s unit tests  include some assertions that ensure that every plugin hook, configuration setting and underlying view class is mentioned in the documentation. A commit or pull request that adds or modifies these without also updating the documentation (or at least ensuring there is a corresponding heading in the docs) will fail its tests.\n  Datasette’s  documentation is in pretty good shape now, and  the changelog provides a detailed overview of new features that I’ve added to the project. I presented Datasette at the PyBay conference in August and I’ve published  my annotated slides from that talk. I was  interviewed about Datasette for the Changelog podcast in May and  my notes from that conversation include some of my favourite demos.\n Datasette now has an official Twitter account—you can follow  @datasetteproj there for updates about the project.", "posttime": "2020-10-20 02:23:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,ideas,datasette", "title": "《数据集》(2018)中的有趣想法", "title_en": "The interesting ideas in Datasette (2018)", "transed": 1, "url": "https://simonwillison.net/2018/Oct/4/datasette-ideas/", "via": "", "real_tags": ["数据", "ideas", "datasette"]}, {"category": "", "categoryclass": "", "imagename": "5edc25cfdff6110cfb5a250368f8e1c0.png", "infoid": 1029873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站上的材料仅供参考，不构成出售要约、邀请买入、推荐或认可任何证券或策略，也不构成Quantopian提供投资咨询服务的要约。\n此外，这些材料没有就任何证券或具体投资的适宜性提供意见。本文中包含的任何信息均不应被视为建议从事或不参与任何与投资有关的行动方案，因为Quantopian或其任何联属公司均不承诺提供投资建议、为受1974年雇员退休收入保障法(经修订)约束的任何计划或实体担任顾问、为个人退休账户或个人退休年金提供建议，或以受信身份就本文提供的材料提供建议。如果您是个人退休或其他投资者，请联系您的财务顾问或其他与Quantopian无关的受托机构，询问此处描述的任何给定投资理念、策略、产品或服务是否适合您的情况。所有的投资都有风险，包括本金损失。Quantopian不保证网站中表达的观点的准确性或完整性。这些观点可能会改变，并可能因为各种原因而变得不可靠，包括市场状况或经济环境的变化。", "note_en": "The material on this website is provided for informational purposes only and does not constitute an offer to sell, a solicitation to buy, or a recommendation or endorsement for any security or strategy, nor does it constitute an offer to provide investment advisory services by Quantopian.\n In addition, the material offers no opinion with respect to the suitability of any security or specific investment. No information contained herein should be regarded as a suggestion to engage in or refrain from any investment-related course of action as none of Quantopian nor any of its affiliates is undertaking to provide investment advice, act as an adviser to any plan or entity subject to the Employee Retirement Income Security Act of 1974, as amended, individual retirement account or individual retirement annuity, or give advice in a fiduciary capacity with respect to the materials presented herein. If you are an individual retirement or other investor, contact your financial advisor or other fiduciary unrelated to Quantopian about whether any given investment idea, strategy, product or service described herein may be appropriate for your circumstances. All investments involve risk, including loss of principal. Quantopian makes no guarantees as to the accuracy or completeness of the views expressed in the website. The views are subject to change, and may have become unreliable for various reasons, including changes in market conditions or economic circumstances.", "posttime": "2020-10-20 02:23:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,金融,quantitative,提供", "title": "Quantopian--一个定量金融算法工具箱", "title_en": "Quantopian – A Quantitative Finance Algorithm Toolbox", "transed": 1, "url": "https://www.quantopian.com/home", "via": "", "real_tags": ["算法", "金融", "提供"]}, {"category": "", "categoryclass": "", "imagename": "0f774893317d4ba5421d5c410517a8e9.jpg", "infoid": 1029872, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前谷歌技术领导(TechLead)反对管理者至高无上、人力资源暴力和程序员。#ProgammerLivesMatter其他新闻，警察暴行和种族...", "note_en": "Ex-Google TechLead makes a stand against manager supremacy, HR brutality, and programmerists. #ProgammerLivesMatter In other news, police brutality and racis...", "posttime": "2020-10-20 02:23:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programmerlivesmatter,领导", "title": "ProgrammerLivesMatter", "title_en": "ProgrammerLivesMatter", "transed": 1, "url": "https://www.youtube.com/watch?v=ouKgUdqZMds", "via": "", "real_tags": ["领导"]}, {"category": "", "categoryclass": "", "imagename": "02783dd18d43bbaa321105b9ed230ab6.jpg", "infoid": 1029870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有理数是最熟悉的数字：1、-5、1/2，以及可以写成正整数或负整数比率的所有其他值。但他们仍然很难合作。\n问题是它们里面有洞。如果放大有理数序列，可能会接近一个本身不是有理数的数。这短路了很多基本的数学工具，就像大多数微积分一样。\n数学家通常通过将有理数排成一行，并用无理数填补空白来解决这个问题，从而创建一个完整的数字系统，我们称之为实数。\n但是，还有其他方式来组织有理逻辑和填补空白：p-ady型数字。它们是可供选择的数字系统的无限集合，每个系统都与唯一的质数相关联：2-adics、3-adics、5-adics等等。\nP-ADIC可能看起来非常陌生。例如，在3-adics中，82比81更接近1。但这种奇怪很大程度上是肤浅的：在结构层面上，p-adics遵循数学家希望在行为良好的数字系统中遵循的所有规则。\n在一个多世纪前发展起来的p-ady数已经成为研究有关几千年前有理数的问题的重要背景。\nP进制数基于模算术，这是一种对循环本身进行计数的方法，就像时钟一样。正如24小时时钟上的1300等于下午1点一样，数学家说13“模12”等于1。\n要了解p-ady数系统是如何从模算术中出现的，首先要对所有以特定素数为模的整数进行分类。例如，对以3为模的整数进行分类时，会将它们分类到三个桶或房间中。\n你也可以对3的高次幂的整数进行分类：模9(3 2)或模27(3 3)。\n数学家对以3为模的幂的整数进行排序，以检测其素因式分解的特征：等于0模3的整数在同一房间，并且在其素因式分解中至少有一个3；等于0模9的整数至少有两个；等于0模27的整数至少有三个。\n现在想象一下模3、9和27的整数像一座塔一样堆叠在一起。塔的每一层都是对下面一层的精确的三层覆盖。这种模式将永远持续下去，从而创建了以3为模的更高幂的整数的优雅排列。\n每个p进整数是通过沿着塔上的无限路径定义的。鸟瞰这座塔，可以看到所有p进整数的全貌。\n21世纪数学中最大的进步之一是一种被称为“完美拟态空间”的物体，它体现了这一观点。它是由波恩大学的彼得·肖尔茨开发的，他在2018年获得了菲尔兹奖，部分原因是这项工作。这只是数学家如何利用这些无限层级的塔楼的一个例子。\n约翰·霍普金斯大学的大卫·萨维特说：“你不考虑塔楼的各个楼层，而是一次性考虑整座塔。”这是现代数论、朗兰兹计划和算术几何中随处可见的基本见解。\n数学家根据p的每个幂在数字的“基数p”展开式中出现的频率来写p进数字。例如，在3-adics中是这样写11的：\nP-ady数的大小由p在其素因式分解中的盛行度决定。PS越多的数字越小。例如，在3-adics中，486是“小”的，因为它的素因式分解中有许多3(486=2x3x3)。\n考虑大小的另一种方式是考虑哪些数字接近0。在p-adics中，当整数在塔楼的较高层共用一个房间时，他们之间的距离会更近。数字0和486共用一个房间直到第五层，而数字0和6只在第一层共用一个房间-表明0比6更接近486(因此486小于6)。\nP级塔通过在地下扩展塔来容纳分数。分子中p次方较大的数字较小，分母中p次方较大的数字较大。\n算术也有不同的感觉。以和486+486=972为例。在实数中，972比486大得多。但在3-adics中，972的大小与486相同，因为和(972)和被和(486)在素因式分解中都有相同数量的3。\nP-adics的形状与实数线不同：它们形成了一个分形，由p-adic塔顶的无限个嵌套房间组成。但是这个分形有它自己的缺口。数学家通过形成p进有理数的“补全”来填充它们-这一过程类似于将无理数值加到数字线上。至少在这个意义上，p-ady数和实数的基本原理是相似的。\n剑桥大学和杜克大学的杰西卡·芬岑说：“它们都是完成体，所以它们实际上有很多共同之处。”\nP-ady数系统的无穷族为数学家提供了探索有理数问题的广泛环境。\n例如，数学家想知道像3x3+4y3+5z3=0这样的多项式方程何时有有理解。这通常是一个很难回答的问题。但是要找到p元的解就相对容易了。\n“事情想要在P-ADICS上变得更好。他们想要有解决方案，“华盛顿大学的比安卡·维雷(Bianca Viray)说。\n数学家用来回答这个问题的一个工具是局部-全局原理，或可追溯到20世纪20年代的哈斯原理。提出如果一个多项式在实数中有解，并且在所有p-ady数中都有解，那么该多项式在有理数中也有解。局部-整体原理对于某些类型的多项式是成立的，而对另一些类型的多项式则不成立。\n局部-整体原理背后的前提似乎很奇怪：为了证明有理数中解的存在，数学家们在无穷多的其他数字系统-实数和所有p-adic中寻找解。\n像这样工作的需要突显了有理数中的空洞造成的问题的程度：你需要穿越宇宙才能绕过它们。同时，它表明，在一个由无限多个数字系统组成的宇宙中，将我们自己限制在恰好离家最近的那个数字系统几乎是很奇怪的。\n“我们都在地球上，我们与雷亚尔合作，但如果你去(任何地方)其他地方，你就会与p-adics合作，”Viray解释说。“雷亚尔才是异常值。”", "note_en": "The rational numbers are the most familiar numbers: 1, -5, ½, and every other value that can be written as a ratio of positive or negative whole numbers. But they can still be hard to work with.\n The problem is they contain holes. If you zoom in on a sequence of rational numbers, you might approach a number that itself is not rational. This short-circuits a lot of basic mathematical tools, like most of calculus.\n Mathematicians usually solve this problem by arranging the rationals in a line and filling the gaps with irrational numbers to create a complete number system that we call the real numbers.\n But there are other ways of organizing the rationals and filling the gaps: the  p-adic numbers. They are an infinite collection of alternative number systems, each associated with a unique prime number: the 2-adics, 3-adics, 5-adics and so on.\n  The  p-adics can seem deeply alien. In the 3-adics, for instance, 82 is much closer to 1 than to 81. But the strangeness is largely superficial: At a structural level, the  p-adics follow all the rules mathematicians want in a well-behaved number system.\n Developed over a century ago,  p-adic numbers have become an essential setting in which to investigate questions about rational numbers that go back millennia.\n  The  p-adic numbers are based in modular arithmetic, which is a method of counting that loops back on itself, like a clock. Just as 1300 on a 24-hour clock is the same as 1 p.m., mathematicians say that 13 “modulo 12” is equivalent to 1.\n To see how  p-adic number systems emerge from modular arithmetic, start by classifying all integers modulo a specific prime number. Classifying the integers modulo 3, for example, sorts them into three buckets, or rooms.\n  You could also classify integers modulo higher powers of 3: modulo 9 (3 2 ) or modulo 27 (3 3).\n  Mathematicians sort integers modulo powers of 3 to detect features of their prime factorizations: Integers that are equivalent to 0 modulo 3 are in the same room and have at least one 3 in their prime factorizations; integers that are equivalent to 0 modulo 9 have at least two; integers equivalent to 0 modulo 27 have at least three.\n Now imagine the integers modulo 3, 9 and 27 stacked atop each other like a tower. Each level of the tower is an exact threefold covering of the level below it. This pattern continues forever, creating an elegant arrangement of the integers modulo ever-higher powers of 3.\n  Each  p-adic integer is defined by following an infinite path up the tower. A bird’s-eye view of this tower gives a picture of all the  p-adic integers.\n One of the biggest advances in 21st-century mathematics is an object called a “perfectoid space,” which embodies this perspective. It was developed by  Peter Scholze of the University of Bonn, who  won the Fields Medal in 2018 in part for this work. It’s just one example of how mathematicians make use of these infinitely layered towers.\n “Instead of considering the individual levels of the tower, you consider the whole tower at once,” said  David Savitt of Johns Hopkins University. “This is a fundamental insight that crops up everywhere in modern number theory, in the  Langlands Program and arithmetic geometry.”\n  Mathematicians write  p-adic numbers based on the frequency with which each power of  p appears in the number’s “base  p” expansion. For example, this is how you write 11 in the 3-adics :\n  The size of a  p-adic number is determined by the prevalence of  p in its prime factorization. Numbers with more  ps are smaller. For example, in the 3-adics, 486 is “small” because it has many 3s in its prime factorization (486 = 2 x 3 x 3 x 3 x 3 x 3).\n Another way to think about size is to think about which numbers are close to 0. In the  p-adics, integers are closer together when they share a room at higher levels of the tower. The numbers 0 and 486 share a room up to the fifth level, whereas 0 and 6 share a room on only the first level — indicating that 0 is closer to 486 than to 6 (and thus 486 is smaller than 6).\n The  p-adic towers accommodate fractions by expanding the tower belowground. Numbers with large powers of  p in the numerators are small, and numbers with larger powers of  p in the denominators are large.\n Arithmetic has a different feel, too. Take, for example, the sum 486 + 486 = 972. In the real numbers, 972 is much bigger than 486. But in the 3-adics, 972 is the same size as 486, because both the sum (972) and the summand (486) have the same number of 3s in their prime factorization.\n The  p-adics take a different shape than the real number line: They form a fractal made of the infinitely nested rooms at the “top” of the  p-adic tower. But this fractal has its own gaps. Mathematicians fill them by forming the “completion” of the  p-adic rationals — a procedure analogous to adding irrational values to the number line. In this sense, at least, the principles underlying the  p-adic numbers and the real numbers are similar.\n “They’re all completions, so they actually have a lot in common,” said  Jessica Fintzen of the University of Cambridge and Duke University.\n  The infinite family of  p-adic number systems provides mathematicians with a wide range of settings in which to explore questions about rational numbers.\n For example, mathematicians would like to know when polynomial equations like 3 x 3 + 4 y 3 + 5 z 3 = 0 have rational solutions. This is generally a hard question. But it’s relatively easy to find  p-adic solutions.\n “Things want to be nice over the  p-adics. They want to have solutions,” said  Bianca Viray of the University of Washington.\n One tool mathematicians use to answer this question is the local-global principle, or the Hasse principle, which dates to the 1920s. It proposes that if a polynomial has a solution in the real numbers and in all of the  p-adic numbers, then that polynomial also has a solution in the rational numbers. The local-global principle is true for some types of polynomials but not others.\n The premise behind the local-global principle seems strange: To prove the existence of solutions within the rational numbers, mathematicians look for solutions in infinitely many other number systems — the reals and all the  p-adics.\n  The need to work like this highlights the extent of the problems created by the holes in the rational numbers: You need to cross the universe just to get around them. At the same time, it suggests that in a cosmos of infinitely many number systems, it would be almost strange to restrict ourselves to the one that just happens to be closest to home.\n “We’re all on Earth and we work with the reals, but if you went [anywhere] else, you’d work with the  p-adics,” Viray explained. “It’s the reals that are the outliers.”", "posttime": "2020-10-20 02:22:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无限,universe,有理数", "title": "数系的无限宇宙", "title_en": "An Infinite Universe of Number Systems", "transed": 1, "url": "https://www.quantamagazine.org/how-the-towering-p-adic-numbers-work-20201019/", "via": "", "real_tags": ["无限", "universe", "有理数"]}]