[{"category": "", "categoryclass": "", "imagename": "886f30418296e2e9002ebacfdafd950f.jpg", "infoid": 1068637, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，6月28日，ars令人遗憾的是，他难以理解，他也令人遗憾地了解这篇文章的作品，他在线互动附近的手柄，据报道，周末在线互动。我们今天重新传中这篇文章，以记住他们对经典游戏仿真界和ARS的巨大贡献。您还可以阅读2011件关于BSNES开发准确性的追求。\n  如果您或您所知的人正在努力与自杀思想斗争，请在800-273-8255联系国家自杀预防寿命，或达到类似的国际热线。我们＆＃39; D还鼓励读者捐赠给美国联邦的自杀预防，如果他们＆＃39所搬家。\n   作为BSNES的首席编码器，我一直在尝试在过去的15年里完善超级任天堂仿真。我们现在处于这个目标的观点，但我们面临着最后一个挑战：SNES视频处理器的准确周期定时。获得最终的仿真精度将需要社区努力，我希望有些人可以帮助。但首先，让我回顾我们和＃39的距离。今天，Snes仿真在一个非常好的地方。禁止对仿真的不寻常外围设备（例如基于光传感器的高尔夫俱乐部，运动自行车或用于在日本的活赛马比赛上放置真实赌注的拨号调制解调器），每个官方许可的SNES标题都是完全播放，没有众所周知的游戏有任何辉煌的问题。\n SNES仿真使我精确的是i＆＃39;甚至被认为将我的仿真器分成两个版本：Higan，它侧重于绝对准确性和硬件文档;和BSNES，专注于性能，功能和易用性。\n    所以它，吧？在一份工作中做得很好的荣誉，谢谢你所有的鱼？好吧......不太。\n 今天，我们为几乎每个狭小带的组件享受循环级别准确性。唯一的例外是PPU（图片处理单元），用于生成发送到屏幕的视频帧。我们大多了解PPU的工作方式，但我们必须猜测一些导致少于完全完美的功能。\n 剩下的问题是相对较小的问题，在盛大的事情方案中。如果你＆＃39;重复追求追求百分之百的忠实仿真完善的奉献，我并不能让你进一步改善SNES PPU仿真的必要性。与生活中的任何目标一样，我们越来越靠完美，回报越小。 \n我可以告诉你为什么这对我来说很重要：它的生活和＃39;工作，我不想说我这靠近完成而没有得到最后一块。我变老了，我赢了，我赢了。我希望这个最后的事情解决了，所以我可以对我的退休感到充满信心，因为SNES一直忠实地通过仿真完全保存。没有石头被遗忘，没有区域未完成。我想说它＆＃39所做的。\n 如果您＆＃39;仍然有兴趣，请阅读深入潜入问题的背景和我提出的解决方案。\n    箭头表示SNE中的各种处理器可以彼此通信的方向，并且虚线表示存储器芯片连接。\n 现在要带走的关键是要注意的，视频和音频输出专门从PPU和DSP发送。这意味着它们像“黑匣子”一样，我们在内部没有任何可见性。后来这将是重要的。\n  想象一下，你正在模仿CPU＆＃39; s＆＃34;乘法＆＃34;需要两个寄存器（变量）的指令将它们乘以，并生成结果和一些表示结果状态（例如溢出）的标志。\n 我们可以设计一个软件程序，该软件程序将每个可能的值从0到255乘以乘法器和多样性。然后我们可以输出乘法的数字和标志结果。这将产生两个65,536个条目表。\n    通过分析这些表，我们可以准确地确定CPU结果设置某种方式。然后我们可以修改我们的仿真器，所以在运行相同的测试时，我们在同一时间产生完全相同的表。 \n现在让＆＃39; S说CPU有16位x 16位乘法。测试每个可能的值都会产生40亿个结果，这开始推动在合理的时间内测试的实际测试。如果CPU具有32位x 32位乘法，则测试宇宙热死前的所有输入组合是不可行的（至少有当前技术，至少）。\n 在这样的情况下，我们必须使用测试来获得更多选择性，并尝试何时何时可以更改标记可能会更改时，结果可能会溢出。否则我们＆＃39; D有一个永远不会完成的测试。\n 乘法是一个相当琐碎的操作，但这是逆向工程背后的一般过程，它延伸到更复杂的操作，例如snes＆＃39;水平消隐DMA（直接内存访问）转移工作。我们创建了试图检测到边缘案例发生的情况的测试，然后确认我们的仿真表现与真正的SNES相同。\n  SNES包含两个振荡器：在〜21MHz上运行的晶时钟，控制CPU和PPU;和一个在〜24MHz上运行的陶瓷谐振器，用于控制SMP和DSP。盒式切割器有时会使用〜21MHz CPU振荡器，有时包括在不同频率下运行的自己的振荡器。\n  时钟是任何系统的核心定时元素，并且SNES旨在以某些频率和时间执行各种任务。\n 如果您想象一个100Hz时钟，它是一种带有数字引脚的设备，该设备转换为逻辑高（例如+5伏），然后返回到每秒100次逻辑低（0伏或地）。因此，每一秒，销电压都会波动200次：100个上升时钟边缘和100个下降时钟边缘。\n 时钟周期通常被视为一个完整的转换，因此100Hz时钟将产生每秒100个时钟周期。有一些系统需要区分上升和下降边缘，并且对于那些，我们将其进一步分解成半循环以表示时钟信号的每个相（高或低）。 \n真实仿真器的关键目标是以完全相同的方式执行任务，并且与真实硬件完全相同。它不得不具体地执行任务的问题。重要的是，在给出相同的输入时，模拟器会生成与真实硬件相同的时机相同的输出。\n  有时，操作随着时间的推移而发生。例如，拍摄CPU乘法。 SNE CPU在八个CPU OPOD循环中，SNE CPU在后台计算乘法结果，而不是暂停等待乘法来完成乘法。这允许您的代码在等待乘法时才能完成其他事情。\n 任何商业发布的软件都可能等待这一点八个周期，因为如果您在它之前尝试阅读结果＆＃39;准​​备好，您将获得部分计算的结果。然而，早期的Snes仿真器立即给出了正确的结果，而不等待这些额外的周期。\n 当Hobbyists开始通过仿真器创建和测试Homebrew软件时，这种差异开始导致一些问题。这些软件中的一些，例如许多早期的超级马里奥世界ROM黑客，这些软件只在这些早期的仿真器上正确工作，而不是真正的SNES硬件。那个＆＃39;因为它们是用仿真器设计的直接（和不真实的 - 与实际硬件）乘法的设计。\n 随着仿真器的改进，这款旧软件已破坏，我们必须随后在我们的较新的模拟器中提供兼容性选项，以便不会失去此软件。是的，就像要说的那样，我们的仿真者必须模仿其他仿真器！梅塔！\n    关于CPU乘法延迟的好处是它非常可预测：八个计算周期在请求乘法后立即启动。通过编写代码来读取每个周期后的结果，我们能够确认SNES CPU正在使用展位算法进行乘法。\n  其他操作对模型并不那么简单，因为它们在后台异步发生。 SNES CPU＆＃39; S DRAM刷新是一个这样的案例。 \n在每个扫描线的渲染过程中，在某个点处，整个SNE CPU冻结短时间，随着RAM芯片的内容刷新。需要这是因为作为成本切割度量，SNES为其主CPU存储器使用动态RAM（而不是静态RAM）。必须定期刷新动态RAM，以随着时间的推移保持其内容。\n  弄清楚这些操作的精确时间的关键洞察是利用SNES PPU的水平和垂直计数器。这些计数器前进并在每个水平和垂直消隐时段后复位。然而，他们的精确度只是Snes＆＃39的四分之一; CPU振荡器频率;也就是说，水平计数器仅增量一次每四个时钟周期一次。\n 通过多次读取计数器，我能够确定计数器对准的时钟周期的哪个四分之一。通过将此洞察力与专门制作的功能相结合，可以通过精确，用户指定的时钟周期循环，可以完全将SNES CPU完全对准到我想要的任何精确的时钟周期位置。\n 通过迭代循环中的一系列时钟周期，我可以完全确定发生某些操作（例如DRAM刷新，HDMA传输，中断轮询等），并且我能够精确地在仿真下再现。\n SNES SMP芯片也有自己的定时器，并且同样的逆向工程也成功地反对该处理器。我可以单独花一整篇文章谈论SMP测试寄存器，这允许编码器控制SMP的时钟分频器及其定时器，以及其他可怕的东西。就这样说，虽然这不是一种简单或快速的过程，但我们最终胜利。\n  在需要被驯服的各种游戏盒内，有一系列SNES协处理器。从专用通用CPU如Superfx和SA-1，与DSP-1和CX4等数字信号处理器，与S-DD1和SPC7110这样的解压缩加速器，到来自Sharp和Epson的实时时钟，以及更多。 ..\n 这意味着SNES仿真器需要能够处理Superfx的指令和像素缓存; SA-1的内存总线冲突仲裁器（允许SNES CPU和SA-1同时共用相同的ROM和RAM芯片）; DSP-1和CX4的嵌入式固件; S-DD1和SPC7110的基于预测的算术编码器;和奇数BCD（二进制编码的小数）的实时时钟边缘情况。慢慢但肯定地，通过应用上述技术来确定正确和时间，我们能够接近完美地模拟所有这些芯片。 \n它实际上采取了巨大的努力，数千美元来从各种游戏中使用的数字信号处理器中取出并提取编程固件。在一个例子中，NEC UPD772X的仿真导致了来自Higan的代码，用于挽救斯蒂芬霍金的后期教授＆＃39;声音！\n 在另一个情况下，我们必须反向工程师的日立HG51B架构的整个指令集，因为这种架构从未被公开记录过。在另一个游戏（Hayazashi Nidan Morita Shougi 2）最终包含一个完整的32位，21MHz ARM6 CPU，以加速其日本国际象棋引擎！\n 仅保留所有SNES协处理器是一个充满挑战和惊喜的多年旅程。\n  不要与DSP-1盒式切割机混淆，索尼S-DSP（数字信号处理器）芯片是从SNES产生独特的声音。该芯片组合了八个语音通道，具有4位ADPCM编码以产生16位立体声信号。\n 在表面上，并且根据前面的系统图，DSP最初看起来像一个黑色盒子：您可以配置语音通道和混音器设置，并坐下，因为它会将声音发送到扬声器时。\n 但是一个关键的功能允许开发人员通过BlarGG的名称来完全反向工程师这个芯片：Echo缓冲区。 SNES DSP具有一个功能，将从先前样本的输出混合在一起以产生回声效果。这发生在音频生成过程的最终（除了可以应用于静默所有音频输出的最后一个最终静音标志。）\n 通过仔细循环定时代码并监视这些回声结果，可以发现SNES DSP将采用SNES DSP的确切操作顺序，以生成每个样本，并产生周期准确的位完美音频。 ", "note_en": "Update, June 28, 2021: Ars was saddened to learn that the author of this piece, who also used the handle Near in online interactions,  reportedly took their own life over the weekend. We&#39;re republishing this piece today in memory of their towering contributions to the classic gaming emulation community and to Ars. You can also read  their 2011 piece on the quest for accuracy in bsnes development.\n  If you or someone you know is struggling with suicidal thoughts, please contact  the National Suicide Prevention Lifeline at 800-273-8255, or  reach out to a similar international hotline. We&#39;d also encourage readers to  donate to the American Federation for Suicide Prevention if they&#39;re so moved.\n   As the lead coder of  bsnes, I&#39;ve been attempting to perfect Super Nintendo emulation  for the past 15 years. We are now at a point where that goal is in sight, but there we face one last challenge: accurate cycle timing of the SNES video processors. Getting that final bit of emulation accuracy will require a community effort that I hope some of you can help with. But first, let me recap how far we&#39;ve come.  Today, SNES emulation is in a very good place. Barring unusual peripherals that are resistant to emulation (such as  a light-sensor based golf club, an  exercise bike, or a dial-up modem  used to place real-money bets on live horse races in Japan), every officially licensed SNES title is fully playable, and no game is known to have any glaring issues.\n SNES emulation has gotten so precise that I&#39;ve even taken to splitting my emulator into two versions:  higan, which focuses on absolute accuracy and hardware documentation; and  bsnes, which focuses on performance, features, and ease of use.\n    So that&#39;s it, right? Kudos on a job well done, thanks for all the fish? Well... not quite.\n Today, we enjoy cycle-level accuracy for nearly every component of the SNES. The sole exception is the PPUs (picture processing units), which are used to generate the video frames sent to your screen. We  mostly know how the PPUs work, but we have to make guesses for some functionality that result in less than total perfection.\n The remaining issues are relatively small ones, in the grand scheme of things. If you&#39;re not interested in the pursuit of one hundred percent faithful emulation perfection for its own sake, I am not going to be able to convince you of the need for improving SNES PPU emulation further. As with any goal in life, the closer we get to perfection, the smaller the returns.\n I can tell you why this is important to  me: it&#39;s my life&#39;s work, and I don&#39;t want to have to say I came  this close to finishing without getting the last piece of it right. I&#39;m getting older, and I won&#39;t be around forever. I want this final piece solved so that I can feel confident in my retirement that the SNES has been faithfully and completely preserved through emulation. No stone was left unturned, no area left unfinished. I want to say that it&#39;s  done.\n If you&#39;re still intrigued, read on for a deep dive into the background of the problem and my proposed solutions.\n    The arrows indicate the direction that the various processors in the SNES can communicate with one another, and the dotted lines represent memory chip connections.\n The key thing to take away right now is to note that the video and audio output are sent directly from the PPU and DSP specifically. That means they function like “black boxes” where we don’t have any visibility into what happens inside. This will be important later on.\n  Imagine you are emulating a CPU&#39;s &#34;multiply&#34; instruction, which takes two registers (variables), multiplies them together, and produces a result and some flags that represent the status of the result (such as  overflow).\n We could devise a software program that multiplies every possible value from 0 to 255 as both the multiplier and multiplicand. Then we could output both the numeric and flag results of the multiplication. This would produce two 65,536-entry tables.\n    By analyzing these tables, we could determine exactly how and when the CPU results were set certain ways. Then we could modify our emulators so, when running the same test, we produce exactly the same tables at the same times.\n Now let&#39;s say the CPU had 16-bit x 16-bit multiplications. Testing every possible value would generate 4 billion results, which is starting to push what is practical to test in a reasonable amount of time. If the CPU had 32-bit x 32-bit multiplications, it wouldn’t be practical to test all combinations of inputs before the heat death of the universe (with current technology, at least).\n In cases like this, we would have to get more selective with our tests and try to determine exactly when flags might change, when results might overflow, and so forth. Otherwise we&#39;d have tests that would never complete.\n Multiplication is a fairly trivial operation, but this is the general process behind reverse engineering, and it extends to more complex operations such as how the SNES&#39; horizontal blanking DMA (direct memory access) transfers work. We create tests that try to detect what happens on edge cases, then confirm that our emulation behaves identically to a real SNES.\n  The SNES contains two oscillators: a crystal clock that runs at ~21MHz, which controls the CPU and PPUs; and a ceramic resonator that runs at ~24MHz, which controls the SMP and DSP. Cartridge coprocessors will sometimes use the ~21MHz CPU oscillator and sometimes include their own oscillators that run at different frequencies.\n  A clock is the core timing element of any system, and the SNES is designed to perform various tasks at certain frequencies and times.\n If you imagine a 100Hz clock, it is a device with a digital pin that transitions to logic high (+5 volts, for instance), and then back to logic low (0 volts, or ground) 100 times per second. So every second, the pin voltage will fluctuate 200 times total: 100 rising clock edges and 100 falling clock edges.\n A clock cycle is generally treated as one full transition, so a 100Hz clock would generate 100 clock cycles per second. There are some systems that require distinguishing between rising and falling edges, and for those, we break this further down into half-cycles to denote each phase (high or low) of the clock signal.\n The key goal of an authentic emulator is to perform tasks in exactly the same ways and at exactly the same times as the real hardware. It doesn&#39;t much matter specifically  how the tasks are performed. All that matters is that the emulator, when given the same inputs, generates the same outputs with the same timing as real hardware.\n  Sometimes, operations happen over time. Take SNES CPU multiplication, for instance. Rather than pausing to wait for multiplication to complete, the SNES CPU calculates the multiplication result one bit at a time in the background over eight CPU opcode cycles. This allows your code to possibly do other things while waiting on the multiplication to complete.\n Any commercially released software is likely to wait those eight cycles, because if you try to read the result before it&#39;s ready, you will get a partially computed result instead. Yet earlier SNES emulators gave correct results  immediately, without waiting these extra cycles.\n When hobbyists started creating and testing homebrew software via emulators, this discrepancy started to cause some problems. Some of this software, such as many early  Super Mario World ROM hacks, only worked correctly on these earlier emulators, and not on real SNES hardware. That&#39;s because they were designed with the emulator&#39;s immediate (and inauthentic-to-real-hardware) multiplication results in mind.\n As emulators improved, this old software broke, and we have had to subsequently offer compatibility options in our newer emulators in order to not lose this software to time. Yes, as surreal as it is to say, these days our emulators have to emulate other emulators! How meta!\n    The nice thing about the CPU multiplication delay is that it&#39;s very predictable: the eight computation cycles start immediately after requesting a multiplication. By writing code to read the results after every cycle, we were able to confirm that the SNES CPU was using the  Booth  algorithm for multiplication.\n  Other operations are not so simple to model, since they happen asynchronously in the background. The SNES CPU&#39;s DRAM refresh is one such case.\n During the rendering of every scanline, at a certain point, the entire SNES CPU freezes for a short duration as the contents of the RAM chip are refreshed. This is needed because, as a cost-cutting measure, the SNES used dynamic RAM (rather than static RAM) for its main CPU memory. Dynamic RAM must be periodically refreshed in order to preserve its contents over time.\n  The key insight to figuring out the precise timing of these operations was to take advantage of the SNES PPU’s horizontal and vertical counters. These counters advance and are reset after each horizontal and vertical blanking period. However, their precision is only a quarter of the SNES&#39; CPU oscillator frequency; that is to say, the horizontal counter increments only once every four clock cycles.\n By reading the counters multiple times, I was able to determine which quarter of a clock cycle the counter was aligned with. By combining that insight with a specially crafted function that could step by a precise, user-specified number of clock cycles, it became possible to perfectly align the SNES CPU to any exact clock cycle position I wanted.\n By iterating over a range of clock cycles in a loop, I could determine exactly when certain operations (such as DRAM refresh, HDMA transfers, interrupt polling, etc.) would occur, and I was able to reproduce this precisely under emulation.\n The SNES  SMP chip has its own timers as well, and similar reverse engineering was successful against that processor as well. I could spend an entire article talking about the SMP TEST register alone, which allows coders to control the clock divider of the SMP and its timers, among other horrible things. Suffice it to say that, while it was not an easy or fast process, we were ultimately victorious.\n  There were a whole host of SNES coprocessors used inside various game cartridges that needed to be tamed as well. From dedicated general-purpose CPUs like the  SuperFX and  SA-1, to digital signal processors like the DSP-1 and Cx4, to decompression accelerators like the S-DD1 and SPC7110, to real-time clocks from Sharp and Epson, and more...\n That means an SNES emulator needs to be able to handle the instruction and pixel caches of the SuperFX; the memory bus conflict arbitrator of the SA-1 (which allowed the SNES CPU and SA-1 to share the same ROM and RAM chips simultaneously); the embedded firmware of the DSP-1 and Cx4; the prediction-based arithmetic coders of the S-DD1 and SPC7110; and the odd BCD (binary-coded decimal) edge cases of the real-time clocks. Slowly but surely, by applying the above techniques to determine correctness and timing, we were able to near-perfectly emulate all of these chips.\n It actually took a massive effort and thousands of dollars to decap and extract the programming firmware from the digital signal processors used in various games. In one instance, emulation of the NEC uPD772x led to  code from higan being used to save the late professor Stephen Hawking&#39;s voice!\n In another case, we had to reverse-engineer the entire instruction set of the Hitachi HG51B architecture, because this architecture was never publicly documented. In yet another, one game ( Hayazashi Nidan Morita Shougi 2) ended up containing a full-blown 32-bit, 21MHz ARM6 CPU to accelerate its Japanese chess engine!\n Preserving all of the SNES coprocessors alone was a multi-year journey full of challenges and surprises.\n  Not to be confused with the DSP-1 cartridge coprocessor, the Sony S-DSP (digital signal processor) chip is what generated the distinctive sound from the SNES. This chip combined eight voice channels with 4-bit ADPCM encoding to produce a 16-bit stereo signal.\n On the surface, and per the system diagram from earlier, the DSP initially looks like a black box: you configure the voice channels and mixer settings and sit back as it generates sound to be sent to your speakers.\n But one key feature allowed a developer by the name of blargg to fully reverse-engineer this chip: the echo buffer. The SNES DSP has a feature that mixes the outputs from previous samples together to produce an echo effect. This happens at the very end of the audio generation process (aside from one last final mute flag that can be applied to silence all audio output.)\n By writing carefully cycle-timed code and monitoring those echo results, it became possible to discover the exact order of operations the SNES DSP would take to generate each sample and to produce cycle-accurate, bit-perfect audio.", "posttime": "2021-06-29 23:53:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "snes,emulators", "title": "Snes仿真器如何从完全完美中获得几个像素 ", "title_en": "How SNES emulators got a few pixels from complete perfection", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/how-snes-emulators-got-a-few-pixels-from-complete-perfection/", "via": "", "real_tags": ["snes", "emulators"]}, {"category": "", "categoryclass": "", "imagename": "2f7755817120e09fbbd082aa669c32bc.png", "infoid": 1068636, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高通公司已宣布向Snapdragon 888的中期更新，Snapdragon 888 Plus。像往常一样，这是一个完全相同的芯片，作为2月份市场的先前版本，只需更快的时钟速率。那些寻找严肃甚至明显的升级的人将失望。这是最小的＆＃34;加上＆＃34;升级高通公司已经完成了。\n 高通公司表示，Prime CPU核心 - 芯片之一＆＃39; S八个核心 - 现在可以获得3.0 GHz，这是对基础芯片2.84 GHz的5％改进。在核心核心之后（处理前景处理和主要线程职责的东西），三个＆＃34;中等＆＃34;和四＆＃34;小＆＃34;核心保持不变。\n 该公司还提到了和＃34; AI发动机＆＃34;现在速度增加了20％。这是一个模糊的衡量整个电话CPU，GPU，DSP和软件处理AI任务的方法。它没有一个具体的对象，你可以指出那些已经更高的速度，良好的运气将过度普遍的ai表现联系在现实世界中的任何实际性能改进。\n 这是Snapdragon 888 Plus的整个更改的整个变化。去年＆＃39; S Snapdragon 865加上Wi-Fi 6e支持，增加了10％的CPU和GPU，因此这是一个对比较的失望。它＆＃39;裸露的最低高通可以做出证明新的芯片发布，这一更新可能只有履行对合作伙伴的路线图承诺。\n 高通公司表示华硕，荣誉，摩托罗拉，体内和小米被排队到船舶888加上手机，其中应该在Q3的某个时间出来。 ", "note_en": "Qualcomm has announced the mid-cycle update to the  Snapdragon 888, the  Snapdragon 888 Plus. As usual, this is the exact same chip as the previous version that hit the market in February, just with a faster clock rate. Those looking for a serious—or even noticeable—upgrade will be disappointed. This is the smallest &#34;Plus&#34; upgrade Qualcomm has ever done.\n Qualcomm says the Prime CPU core—one of the chip&#39;s eight cores—can now hit 3.0 GHz, which is a five percent improvement over the 2.84 GHz of the base chip. After the Prime core (which handles things like foreground processing and main thread duties), the three &#34;medium&#34; and four &#34;small&#34; cores remain unchanged.\n The company also mentioned that the &#34;AI Engine&#34; is now 20 percent faster. This is a nebulous measurement of how the entire phone—CPU, GPU, DSP, and software—processes AI tasks. It&#39;s not a single concrete object you can point to that has been clocked higher, and good luck tying overhyped AI performance to any actual performance improvements in the real world.\n That&#39;s the entirety of the changes to the Snapdragon 888 Plus. Last year&#39;s  Snapdragon 865 Plus added Wi-Fi 6E support and a 10 percent faster CPU and GPU, so this is a disappointment in comparison. It&#39;s the bare minimum Qualcomm could do to justify a new chip release, and this update probably only exists to fulfill roadmap promises made to partners.\n Qualcomm says Asus, Honor, Motorola, Vivo, and Xiaomi are lined up to ship Snapdragon 888 Plus phones, which should be out sometime in Q3.", "posttime": "2021-06-29 23:52:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "qualcomm,bare,芯片", "title": "Qualcomm为新的Snapdragon 888 Plus SoC的最低限度 ", "title_en": "Qualcomm does the bare minimum for the new Snapdragon 888 Plus SoC", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/qualcomms-new-snapdragon-888-plus-soc-has-a-new-name-not-much-else/", "via": "", "real_tags": ["qualcomm", "bare", "芯片"]}, {"category": "", "categoryclass": "", "imagename": "60c8810f7dc88a374262a4c916de7b58.jpg", "infoid": 1068635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄罗斯太空公司Roscosmos在周一发布了照片，显示了封闭在其有效载荷整流罩中的众多Nauka空间站模块。这将是俄罗斯＆＃39;在十多个十多年来的国际空间站的第一个重要补充，它将提供俄罗斯人，他们的第一模块主要用于研究。 ＆＃34; Nauka＆＃34;意味着俄语科学。\n 这是一个相当大的模块，包括船员宿舍，用于科学实验的气闸等。大约24公吨的质量大约是Zvezda服务模块的最大俄罗斯段大约20％。\n 这次发布的时机，预定于7月15日在质子火箭上，是值得注意的。对于一个，多用途的Nauka模块由于该项目缺乏技术问题的预算缺乏预算，超过了十几年。有时，模块似乎从未实际发射过。\n 此外，俄罗斯在其未来参与国际空间站计划的情况下，俄罗斯正在推出其最大的模块是不确定的。俄罗斯官员表示，轨道上的现有硬件，大部分时间超过二十年，旧约无法修复。俄罗斯人表示，他们可能会在2025年撤出该计划，并建造一个全新的车站。\n    那么为什么在退出车站前几年推出一个新模块？一种可能性是俄罗斯人只是张贴。一些美国宇航局官员私下推测，这可能是从美国获得新资金的角度。随着Spacex＆＃39; S船员龙车的成功，接近波音和＃39; S Starliner的可用性，美国宇航局不再将数亿美元送到RoscoSmos购买豆腐座，以便进入车站。这是俄罗斯＆＃39;空间计划的重要资金来源。\n 然而，美国宇航局希望将车站放在另一十年，为此需要俄罗斯人。国际空间站的第一个要素于1998年推出，它的设计使美国和俄罗斯段依赖于态度控制，权力和其他关键资源。美国宇航局官员怀疑俄罗斯可能会寻求俄罗斯＆＃34;维护＆＃34;来自美国的资金，以便保持其部分空间站。\n Nauka＆＃39;发射是俄罗斯＆＃39;空间计划的重要象征性胜利，因为Roscosmos越来越罕见地发展和飞行新硬件。主要是，该计划维持并推出数十年的旧航天器，如豆腐车辆和质子火箭。 \n在封装在其有效载量公平中，Nauka现在将搬到A＆＃34;填充站＆＃34; 在哈萨克斯坦的Baikonur Cosmodrome，它将被燃料和加压。 之后，它将与其质子火箭交配，以便在7月15日尽快发生的发射。 ", "note_en": "The Russian space corporation, Roscosmos,  released photos on Monday showing the much-anticipated Nauka space station module enclosed in its payload fairing. This will be Russia&#39;s first significant addition to the International Space Station in more than a decade, and it will provide the Russians with their first module dedicated primarily to research. &#34;Nauka&#34; means science in Russian.\n This is a sizable module, including crew quarters, an airlock for scientific experiments, and much more. With a mass of about 24 metric tons, it is about 20 percent larger than the biggest Russian segment of the station, the Zvezda service module.\n The timing for this launch, scheduled for as early as July 15 on a Proton rocket, is notable. For one, the multi-purpose Nauka module is more than a dozen years late due to a lack of budget for the project on top of technical issues. At times, it seemed like the module was never actually going to launch.\n Additionally, Russia is launching its largest module at a time when its future participation in the International Space Station program is uncertain. Russian officials have said the existing hardware on orbit, much of which is more than two decades old, is aging beyond repair. The Russians  have said they may pull out of the program in 2025 and build a brand-new station.\n    So why launch a new module just a few years before exiting the station? One possibility is that the Russians are simply posturing. Some NASA officials have speculated privately that this may be an angle to obtain new funds from the United States. With the success of SpaceX&#39;s Crew Dragon vehicle and nearing availability of Boeing&#39;s Starliner, NASA is no longer annually sending hundreds of millions of dollars to Roscosmos to purchase Soyuz seats for access to the station. This was an important source of funding for Russia&#39;s space program.\n However, NASA would like to keep the station flying for another decade, and for this it needs the Russians. The first elements of the International Space Station were launched in 1998, and it was designed such that the US and Russian segments were dependent upon one another for attitude control, power, and other critical resources. The NASA officials suspect Russia may seek &#34;maintenance&#34; funding from the United States in return for keeping its part of the space station going.\n Nauka&#39;s launch is an important symbolic win for Russia&#39;s space program, in that it is increasingly rare for Roscosmos to develop and fly new hardware. Mostly, the program maintains and launches decades-old spacecraft such as the Soyuz vehicle and the Proton rocket.\n After being encapsulated in its payload fairing, Nauka will now move to a &#34;filling station&#34; at the Baikonur Cosmodrome in Kazakhstan, where it will be fueled and pressurized. After that, it will be mated to its Proton rocket for a launch that may occur as soon as July 15.", "posttime": "2021-06-29 23:52:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,推出,launching", "title": "为什么俄罗斯如果它拔出，为什么将一个新的模块推出空间站？ ", "title_en": "Why is Russia launching a new module to the space station if it’s pulling out?", "transed": 1, "url": "https://arstechnica.com/science/2021/06/decades-in-the-making-russias-nauka-module-to-finally-take-flight/", "via": "", "real_tags": ["俄罗斯", "推出", "launching"]}, {"category": "", "categoryclass": "", "imagename": "754d45756bc0f280e04eee22688b2ae8.jpg", "infoid": 1068634, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一秋季正在塑造，为经典科学小说的粉丝是一个很好的粉丝。我们不仅是10月22日的Dunis Villeneuve＆＃39;苹果电视+终于宣布了炉排的首映日期，夏季预期的基础，电视适应的ISAAC Asimov＆＃39;有影响力的系列。前三集将于2021年9月24日首次亮相，并在此之后发布的每周发作。\n “从基金会系列首次出现的几十年来看，Asimov的预言科幻作品从未比现在更加相关，”Showrunner David Goyer在一份声明中说。 “成长，我吞噬了基础，梦想有一天在屏幕上看到它 - 但一个特征电影似乎不足以拥抱野心。由于流媒体的更广阔的景观和与苹果和斯塔法的宝贵伙伴关系，我们能够以真正的方式正义的方式将该系列带到屏幕上。“\n  当革命博士哈里·索尔顿（Jared Harris）预测帝国的即将垮台，他和一支忠诚的粉丝乐队冒险到银河系的远航，以建立基础，以试图重建并保持文明的未来。由Hari＆＃39; S索赔，统治聪明 - 一条长长的皇帝克隆 - 担心他们对星系的掌握可能会削弱，因为它们被迫估计永远失去遗产的潜在现实。\n 哈里斯播放斯尔顿，李踏踏车与兄弟日，银河系当前的皇帝和一部分长的皇帝克隆（上述康斯群岛）。 Lou Llobell播放Seldon＆＃39; Gaal; Leah Harvey在Terminus的守望者中扮演了一个性别交换的狂欢者;和劳拉·贝尔恩扮演Eto Demerzel，友人给兄弟日。\n    其他列出的字符包括兄弟黄昏（Terrence Mann），裁决家庭和最古老的生活成员，以及哥哥黎明（Cassian Bilton），最年轻的成员和兄弟的兄弟。 ＆＃39;还有丹尼尔·麦弗森，作为雨果，T＆＃39;尼亚米勒作为Halima，Pravessh Rana作为罗文，克拜兰萨氏作为Phara，Mido Hamada作为影子大师Obrecht，Amy Tyger作为Azura，以及Buddy Skelton作为Keir。\n  自从我们在全球开发的20020年6月在全球开发商会议（WWDC）中亮相以来，它已经超过一年。其中包括Goyer的一些简短评论，并指出在过去50年中的所有过去的努力适应基础，以及该系列对星球大战的巨大影响力。也有一些伴随着场景的照片，但大多数情况下它只是介绍了基本前提，以及在大流行关机前完成的一些视觉令人惊叹的镜头。从那时起，本月早些时候苹果电视+发布了苹果电视+夏天及其超越＆＃34的几个简短瞥见预览预告片。\n 这个新的两分钟的茶叶随着孤独的人物行走，穿过暗走廊到秘密实验室，克隆胎儿悬浮在流体中。它＆＃39;兄弟黄昏。 ＆＃34;你可以＆＃39; t在这里，＆＃34;埃托告诉他。 ＆＃34;我可以＆＃39; t成为第一个想看我最年轻的自我的人和＃34;他回复了。 ＆＃34;奇怪，看着自己出生。＆＃34;接下来，我们削减了兄弟日吹嘘他们的遗传王朝如何统治四个世纪以来，为成千上万的世界带来了和平。但他咆哮，这种稳定现在受到单身男人的威胁。 \n当然，这将是愚蠢的，谁坚持他的辩护，他不是革命性的。 此外，他对文明消亡的令人惊叹的计算被Gaal视为正确。 ＆＃34;订单将消失，＆＃34; Seldon坚持认为，随着混乱和破坏的场景。 ＆＃34;战争将无休止。 你可以＆＃39;拯救自己。 但你可以拯救你的遗产。＆＃34; 它＆＃39;是一个厄运和忧郁的消息，但是，虽然，但是，Seldon Amasses一个跟随，很多兄弟日＆＃39; s chagrin。 当兄弟的日子都知道太好了，＆＃34;单词有一种扇形野火的方式。 ＆＃34;  基金会将在2021年9月24日在苹果电视+上放映。再次，在这一三张发作后，新事件将每周五，每周都遵循每周一次。 ", "note_en": "This fall is shaping up to be a good one for fans of classic science fiction. Not only are we getting Denis Villeneuve&#39;s film adaptation of   Dune on  October 22, but Apple TV+ has finally announced the premiere date for the streamer&#39;s hotly anticipated   Foundation, a TV adaptation of Isaac Asimov&#39;s hugely influential series. The first three episodes will debut on September 24, 2021, with weekly episodes released after that.\n “In the decades since the  Foundation series first saw print, Asimov’s prophetic science-fiction work has never been more relevant than it is now,” said showrunner David Goyer in a statement. “Growing up, I devoured  Foundation and dreamed of one day seeing it on screen—but a feature film didn’t seem big enough to embrace the ambition. Thanks to the broader landscape of streaming and a valuable partnership with Apple and Skydance, we are able to bring the series to the screen in a way that truly does it justice.”\n  When revolutionary Dr. Hari Seldon (Jared Harris) predicts the impending fall of the Empire, he and a band of loyal followers venture to the far reaches of the galaxy to establish The Foundation in an attempt to rebuild and preserve the future of civilization. Enraged by Hari&#39;s claims, the ruling Cleons — a long line of emperor clones—fear their grasp on the galaxy may be weakening as they’re forced to reckon with the potential reality of losing their legacy forever.\n Harris plays Seldon, with Lee Pace co-starring as Brother Day, current emperor of the galaxy and part of a long line of emperor clones (the aforementioned Cleons). Lou Llobell plays Seldon&#39;s mathematical genius protegé, Gaal; Leah Harvey plays a gender-swapped Salvor, warden of Terminus; and Laura Birn plays Eto Demerzel, aide to Brother Day.\n    Other listed characters include Brother Dusk (Terrence Mann), the ruling family&#39;s oldest living member, and Brother Dawn (Cassian Bilton), the youngest member and heir apparent to Brother Day. There&#39;s also Daniel MacPherson as Hugo, T&#39;Nia Miller as Halima, Pravessh Rana as Rowan, Kubbra Sait as Phara, Mido Hamada as Shadow Master Obrecht, Amy Tyger as Azura, and Buddy Skelton as Keir.\n  It has been more than a year since we  got the first teaser, unveiled in June 2020 at the Worldwide Developers Conference (WWDC). That included some brief commentary from Goyer, noting all the past efforts to adapt  Foundation over the last 50 years, as well as the enormous influence the series had on  Star Wars. There were some accompanying behind-the-scenes photographs, too, but mostly it just introduced the basic premise, along with some visually stunning shots of the scenes that had been completed before the pandemic shutdown. Since then there has been nothing, save for a  few brief glimpses earlier this month when Apple TV+ released its &#34;summer and beyond&#34; preview trailer.\n This new two-minute teaser opens with a lone figure walking through a dark corridor to a secret laboratory where cloned fetuses are suspended in fluid. It&#39;s Brother Dusk. &#34;You can&#39;t be here,&#34; Eto tells him. &#34;I can&#39;t be the first person who wanted to see my youngest self,&#34; he replies. &#34;Strange, watching yourself being born.&#34; Next we cut to Brother Day bragging about how their genetic dynasty has reigned for over four centuries, bringing peace to thousands of worlds. But he rants that this stability is now being threatened by a single man.\n That would be Seldon, of course, who insists in his defense that he is not a revolutionary. Furthermore, his alarming calculations about the demise of civilization are deemed correct by Gaal. &#34;Order will vanish,&#34; Seldon insists, as scenes of chaos and destruction play out. &#34;Wars will be endless. You can&#39;t save yourselves. But you can save your legacy.&#34; It&#39;s a doom-and-gloom message, but, nonetheless, Seldon amasses a following, much to Brother Day&#39;s chagrin. And as Brother Day knows all too well, &#34;Words have a way of fanning into wildfires. &#34;\n Foundation will premiere on Apple TV+ on September 24, 2021. Again, after those first three episodes, new episodes will follow weekly, every Friday.", "posttime": "2021-06-29 23:52:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,apple,发出,release,兄弟", "title": "我们终于为Apple TV +系列基础发出了发布日期和新的预告片 ", "title_en": "We finally have a release date and new teaser for Apple TV+ series Foundation", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/we-finally-have-a-release-date-and-new-teaser-for-apple-tv-series-foundation/", "via": "", "real_tags": ["发布", "apple", "发出", "release", "兄弟"]}, {"category": "", "categoryclass": "", "imagename": "2690ee9f646d812a157ec824846c4b3b.jpg", "infoid": 1068633, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，Linux基金会创建了一个名为Open Voice Network（OVN）的新开源行业关联。新集团是Linux基金会独立管辖的基金，具有改善语音识别技术的信任，选择，包容性和开放性的目标。\n 虽然类似于亚马逊＆＃39;在某种程度上，OVN索赔了对道德的主要关注。虽然亚马逊＆＃39;努力确实触及了用户选择和自由，但其主要目标比OVN＆＃39; S-to提供的主要目标相当较窄。同一产品上的多个，同时语音服务，每个都有自己的唤醒词。＆＃34;亚马逊并没有对这些个人服务的道德限制或指导方面的伦理限制或指导方针说出大量的伦理限制或指导方针，无论是在其当前的使命声明中还是2019年新闻稿宣布宣布它。\n 开放式语音网络是一个中立的非营利组织与其创始成员登记处的一些令人印象深刻的名称，包括目标和微软。 Ovn＆＃39;目标不是开发技术本身，而是提供开放，值得信赖性和包容性标准和使用指南。\n OVN＆＃39; S初始新闻稿进一步详细说明，指出关联将通过专注于这些领域开始：\n 标准开发：对全球标准的研究和建议，以实现用户选择，包容性和信任。\n 行业价值和意识：识别和分享对话AI的最佳实践，这些既有水平和特定于垂直行业，作为语音援助的洞察力和价值。\n 宣传：与现有的行业协会合作，包括有关监管和立法问题，包括数据隐私。 \n开放式语音网络的成员资格需要支持其研究，意识和宣传与直接资源贡献以及积极参与其会议和研讨会。\n    Mike Dolan，Linux Foundation的高级副总裁和项目经理，说明了这个＆＃34;语音[命令]预计是数字世界的主要界面......它已经越来越多地用于超越智能扬声器，包括应用程序所有类型的汽车，智能手机和家用电子设备。＆＃34;他继续说那个＆＃34; [语音]的潜在影响是惊人的，我们兴奋地把它带到了Linux基金会的开放治理模型下。＆＃34;\n 乔尔·克拉姆的体系结构的目标副总裁描述了目标＆＃34;连续探索和拥抱新技术，＆＃34;包括语音识别，并指出那个＆＃34; Linux基金会，在推进所有人的角色方面，这是这项计划的完美家。＆＃34;\n Microsoft Azure Ai General Manager Ali Dalloul强调了技术本身的重要性，说，＆＃34;说话是人和＃34;  - 以粗体陈述＆＃34;声音正在迅速成为主要的互动模态在家庭和工作的用户及其设备和服务之间。＆＃34; （我们aren＆＃39; t确定我们同意语音命令作为与设备和系统的主要沟通方法，也将很快到达 - 但是它仍然是＆＃39;肯定越来越重要。）\n 创建Ovn会员和Schwarz Gruppe首席数字官员Rolf Schumann指出了语音识别的道德设计和标准的Stark需求：＆＃34;声音包括比指纹更多的信息，并且可以留出有关用户的情绪状态或心理健康的数据。因此，将数据保护标准放在适当位置，以保护用户＆＃39;隐私至关重要。这是我们将对语音未来做出贡献的唯一方式。＆＃34;\n 赞助公开语音网络的会员资格适用于铂金，黄金和＆＃34;倡导和＃34;每年级别为10万美元，50k美元和7.5千克，铂金赞助商在Ovn指导委员会和其他两个层面和＃34上服务;代表＆＃34;在委员会。希望参与涉及的个人和较小的企业可以这样做开放的语音网络的朋友 - 一种需要志愿者参与和签署宪章但没有现金捐款的承诺。 ", "note_en": "Last week, the Linux Foundation created a new open source industry association called the Open Voice Network (OVN). The new group is an independently governed directed fund of the Linux Foundation, with the goals of improving trust, choice, inclusivity, and openness in voice recognition technology.\n While similar to Amazon&#39;s  Voice Interoperability Initiative in some ways, the OVN claims a primary focus on ethics. Although Amazon&#39;s effort does touch on user choice and freedom, its primary goal is considerably narrower than OVN&#39;s—to provide &#34;multiple, simultaneous voice services on the same product, each with its own wake word.&#34; Amazon did not say much about ethical restrictions or guidelines for those individual services, either in its  current mission statement or in the 2019  press release announcing it.\n The Open Voice Network is a neutral nonprofit industry association with some impressive names in its founding-member registry, including Target and Microsoft. OVN&#39;s goal is not to develop the technology itself but to deliver open, trustworthy, and inclusive standards and usage guidelines.\n OVN&#39;s initial press release goes into further detail, stating that the association will begin by focusing in these areas:\n Standards development: research and recommendations toward the global standards that will enable user choice, inclusivity, and trust.\n Industry value and awareness: identification and sharing of conversational AI best practices that are both horizontal and specific to vertical industries, serving as the source of insight and value for voice assistance.\n Advocacy: working with and through existing industry associations on relevant regulatory and legislative issues, including those of data privacy.\n Membership in the Open Voice Network entails supporting its research, awareness, and advocacy with direct resource contribution as well as active participation in its conferences and workshops.\n    Mike Dolan, senior VP and project manager at the Linux Foundation, says that &#34;voice [command] is expected to be a primary interface to the digital world... it is already increasingly being used beyond smart speakers to include applications in automobiles, smartphones, and home electronics devices of all types.&#34; He goes on to say that &#34;the potential impact of [voice] is staggering, and we&#39;re excited to bring it under the open governance model of the Linux Foundation.&#34;\n Target VP of Architecture Joel Crabb describes Target as &#34;continuously exploring and embracing new technologies,&#34; including voice recognition, and states that &#34;the Linux Foundation, with its role in advancing open source for all, is the perfect home for this initiative.&#34;\n Microsoft Azure AI General Manager Ali Dalloul underlines the importance of the technology itself, saying, &#34;to speak is human&#34;—and following that up with a bold statement that &#34;voice is rapidly becoming the primary interaction modality between users and their devices and services at home and work.&#34; (We aren&#39;t certain we agree that voice command as the  primary method of communication with devices and systems will arrive soon—or perhaps ever—but it&#39;s certainly increasingly important.)\n Founding OVN member and Schwarz Gruppe Chief Digital Officer Rolf Schumann points out the stark need for ethical design and standards in voice recognition: &#34;voice includes more information than a fingerprint and can entail data about the emotional state or mental health of a user. Therefore, it is of utmost importance to put data protection standards in place to protect the user&#39;s privacy. This is the only way we will contribute to the future of voice.&#34;\n Sponsoring memberships of the Open Voice Network are available to enterprises in Platinum, Gold, and &#34;Advocate&#34; levels at $100K, $50K, and $7.5K annually, respectively, with Platinum sponsors serving on the OVN steering committee and the other two levels &#34;represented&#34; on the committee. Individuals and smaller businesses wishing to get involved may do so as  Friends of the Open Voice Network—a commitment that requires volunteer participation and signing a charter but no cash contributions.", "posttime": "2021-06-29 23:52:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,基金会,foundation,包括", "title": "Linux基金会正在努力改善语音识别道德 ", "title_en": "The Linux Foundation is working to improve voice recognition ethics", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/the-linux-foundation-is-working-to-improve-voice-recognition-ethics/", "via": "", "real_tags": ["linux", "基金会", "包括"]}]