[{"category": "", "categoryclass": "", "imagename": "eee98beab20950f05723a325d2337dca.png", "infoid": 1015220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "接下来，在我们与虚拟活动策划者的一系列会谈中，我们将与虚拟活动平台Hopin的创始人约翰尼·博法哈特(Johnny Boufarhat)会面，讨论我们共同为Disrupt开发的虚拟场馆。\nHopin成立于2007年，旨在帮助组织者虚拟重现面对面的活动体验。到目前为止，它已经与包括联合国和戴尔在内的合作伙伴举办了活动。今年6月，Hopin宣布已经筹集了4000万美元的首轮融资，由IVP牵头。\n在与约翰尼的讨论中，我们将涵盖的主题包括：新冠肺炎如何加速了对虚拟活动的需求，他对虚拟场馆的看法，颠覆性的虚拟场馆，与会者体验，合作伙伴体验，赞助商如何利用活动，以及活动的未来可能是什么样子。如果您对参加、成为赞助商或了解更多关于Disrupt的知识感兴趣，这是为您准备的。\n除了下周与约翰尼的谈话外，我们今天上午10点还将主持一场会议。我们将与人工智能驱动的事件网络解决方案GRIP的创始人Tim Groot进行PDT合作，我们将使用该解决方案为Disrupt提供动力(请在此处注册)。\n和我们一起对话Slido的创始人吧，我们将用这家公司来推动Disrupt的参与。稍后会有更多关于这方面的报道！", "note_en": "Next in our   series of talks  with virtual event masterminds, we’ll be meeting with   Johnny Boufarhat , founder of virtual events platform, Hopin, about the virtual venue we’re developing together for   Disrupt .\n Hopin  was founded in 2007 with the aim to help organizers recreate the in-person event experience virtually. So far, it’s hosted events with partners including the U.N. and Dell. In June of this year, Hopin   announced  that it had raised a $40 million Series A led by IVP.\n  In our discussion with Johnny, we will cover topics including: how COVID-19 has accelerated the demand for virtual events, his perspective on virtual venues, the Disrupt virtual venue, the attendee experience, the partner experience, how sponsors can leverage the event and what the future of events might look like. If you’re interested in attending, becoming a sponsor or learning more about Disrupt, this is for you.\n    In addition to our talk with Johnny next week, we’re hosting a session today at 10 a.m. PDT with Tim Groot, the founder of the AI- driven event networking solution, Grip, that we will use to power Disrupt (  register here ).\n  Join us for a conversation with the founder of Slido, the company we will use to power engagement at Disrupt. More on this soon!", "posttime": "2020-07-31 00:40:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "事件,virtual,虚拟", "title": "\n与Hopin创始人约翰尼·鲍法哈特(Johnny Boufarhat)谈论虚拟事件和颠覆", "title_en": "\n\t\t\t\tTalking virtual events and Disrupt with Hopin founder Johnny Boufarhat\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/talking-virtual-events-and-disrupt-with-hopin-founder-johnny-boufarhat/", "via": "", "real_tags": ["事件", "virtual", "虚拟"]}, {"category": "", "categoryclass": "", "imagename": "0ee76c9de9929efc411533ed80a099a7.jpg", "infoid": 1015219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在两周前首次推出了TechCrunch榜单，以帮助创始人找到准备好首先撰写并领导对22个特定市场垂直市场(如企业应用程序或数字生物技术)进行检查的风险投资公司。我们最初的391名投资者名单是基于1200多名创始人的直接推荐，他们经常提供关于帮助他们创建初创企业的投资者的详细信息。\n我很高兴地告诉大家，自从第一次发布以来，我们收到了大量涌入TechCrunch的推荐和电子邮件，我们已经准备好公布TechCrunch名单的全面更新。\n现在，我们使用了2600多份创始人推荐-是最初数据集的两倍多-我们已经强调了我们名单上的一些现有投资者，并增加了116名新投资者，他们已经被创始人认可为愿意不择手段、开出关键的第一轮检查和领导风险投资的投资者。\n我很高兴地报告，我们开始有少量的投资者从美国以外的地方涌入，特别是在欧洲。尽管如此，我们仍然需要来自欧洲、拉美、非洲和亚洲的更多创始人推荐来充实这份榜单。如果您是这些地区的创始人，我们特别鼓励您帮助我们确定引领这些生态系统的无畏投资者。\n如果您是一位创始人，并且还没有提交您的推荐，请填写我们非常简短的调查。\n如果您对TechCrunch名单有疑问，我们已经整理了一个常见问题页面，其中描述了资格和后勤、名单背后的一些逻辑，以及如何与我们联系。\n感谢每一位帮助过我们的创始人-我们希望TechCrunch榜单将成为全球最优秀、最雄心勃勃的投资者的最新概要，并成为创始人发起筹资活动的关键工具。", "note_en": "We first launched   The TechCrunch List two weeks ago to help founders find VCs who are ready to write first and lead checks into 22 specific market verticals like enterprise applications or digital biotech. We based that initial list of 391 investors on direct recommendations from more than 1,200 founders, who often supplied a great level of detail about the investors who helped them on their journeys to build their startups.\n  I’m pleased to report that since that initial launch, we have had an avalanche of recommendations and emails flow into TechCrunch, and we are ready to unveil a full update to The TechCrunch List.\n Now using more than 2,600 founder recommendations — more than double our original dataset — we have underscored a number of the existing investors on our list as well as added 116 new investors who have been endorsed by founders as investors willing to cut against the grain and write those critical first checks and lead venture rounds.\n I’m pleased to report that we are starting to get a trickle of investors flowing in from outside the United States, particularly in Europe. That said, we still need more founder recommendations from Europe, LatAm, Africa, and Asia to round out the list. If you are a founder from these regions, you are particularly encouraged to help us identify the intrepid investors that are leading these ecosystems.\n If you are a founder and haven’t submitted your recommendation yet,   please fill out our very brief survey.\n If you have questions about The TechCrunch List, we have put together a   Frequently Asked Questions page that describes the qualifications and logistics, some of the logic behind the List, and how to get in touch with us.\n Thank you to every founder who has helped us — our hope is that The TechCrunch List will be an up-to-date compendium of the best and most ambitious investors worldwide and a key tool in the chest for founders launching their fundraises.", "posttime": "2020-07-31 00:40:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "企业,updated,投资者", "title": "\n我们已经更新了TechCrunch榜单，有116家新的风投准备好首先撰写并领导对初创企业的检查", "title_en": "\n\t\t\t\tWe’ve updated The TechCrunch List with 116 new VCs ready to write first and lead checks into startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/the-techcrunch-list-update/", "via": "", "real_tags": ["企业", "updated", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "c41b1694c59e133846e4d3d8e0f06065.jpg", "infoid": 1015218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您的第一次机会-在您的中断2020通行证上节省高达300美元-将于7月31日晚上11：59到期。(PT)。当每一美元都很重要的时候，不要推迟储蓄。今天就购买通行证，然后准备好抓住成功的钥匙，推动您的业务向前发展。\n你总是可以指望Disrupt带来一个出色的演讲者阵容，今年在这方面也没有什么不同。行业领军人物将为我们的虚拟舞台增光添彩，分享他们来之不易的洞察力，讨论趋势，分享他们通往创业成功的具体道路。\n世界各地数以百万计的人欢迎智能助手的卫冕女王亚历克莎走进他们的家中。听听Alexa是如何从两个最了解她的人那里成为主导力量的-亚马逊Alexa Experience&Amp；Echo Devices副总裁托尼·里德(Toni Reid)和Alexa人工智能副总裁兼首席科学家罗希特·普拉萨德(Rohit Prasad)。\nAirtable联合创始人兼首席执行官刘强东在协作企业软件领域积累了相当不错的简历。TC编辑将与刘讨论构建非常复杂的产品带来的挑战-并教客户如何使用它。我们将请他就企业软件销售、无代码软件和低代码软件以及高速增长的状况发表意见。\nDisrupt的名人演讲者并不是什么新鲜事，但他们从来不会出现在那里，只是因为他们很有名。例如，克里·华盛顿将和我们一起谈论她最近在科技投资和运营方面的举措。此外，我们还将讨论向Netflix、Hulu、Quibi、Disney+和HBO等流媒体平台的快速转变，以及网络试图演变的方式。\n你还会发现大量内容，专注于帮助初创企业的早期创始人建立一个更强大的企业。进入额外的咀嚼阶段，参加旨在提供可操作的提示和策略的会议，您可以将其调整并应用于您自己的业务。每期会议将由一位领先的专家负责--考虑市场营销、投资和业务发展。\n我们谈论的是每个早期创始人都需要掌握的主题--或者至少要充分理解，以便聘用合适的人或与合适的人合作。需要制作一个更有说服力的节拍甲板吗？您需要一个销售团队吗？您如何组建一个销售团队？这就是适合你的地方。\nDisrupt 2020提供了更多功能：Startup Battlefield、Digital Startup Alley、拥有数千名全球参与者的世界级网络，以及CrunchMatch，使您能够快速、轻松、有序地找到他们并与他们联系。\n7月31日晚上11：59钟声敲响时，早起的定价-以及高达300美元的节省-在短短48小时内就消失了。(PT)。不要错过尽可能低的价格。现在就购买您的破坏2020通行证。抓住钥匙，推动您的业务向前发展。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "Your first opportunity —  saving up to $300 on your Disrupt 2020 pass — expires on July 31 at 11:59 p.m. (PT). Don’t put off saving when every dollar counts.  Purchase your pass today, and then get ready to grab the keys to success and drive your business forward.\n You can always count on Disrupt to deliver an outstanding  lineup of speakers, and this year is no different in that respect. Leading industry movers and shakers will grace our virtual stages to share their hard-won insight, discuss trends and share their specific path to startup success.\n   Millions of people around the world have welcomed Alexa, the reigning queen of smart assistants, into their homes. Hear how Alexa came to be such a dominating force from the two people who know her best — Toni Reid, vice president of Alexa Experience &amp; Echo Devices at Amazon, and Rohit Prasad, vice president and head scientist of Alexa Artificial Intelligence.\n Airtable co-founder and CEO Howie Liu has amassed quite a resume in collaborative enterprise software. TC editors will talk with Liu about the challenges that come with building a very complex product — and teaching the customer base how to use it. We’ll ask him to weigh in on the state of enterprise software sales, no- and low-code software and hyper-growth.\n Celebrity speakers at Disrupt are nothing new, but they’re never there simply because they’re famous. Case in point, Kerry Washington will join us to talk about her recent move toward tech investment and operations. Plus, we’ll discuss the rapid shift toward streaming platforms like Netflix, Hulu, Quibi, Disney+ and HBO and ways networks are trying to evolve.\n You’ll also find plenty of content focused on helping early-stage startup founders build a stronger business. Head to the Extra Crunch Stage for sessions designed to provide actionable tips and tactics you can adapt and apply to your own business. Each session will be helmed by a leading expert — think marketing, investment and business development.\n We’re talking topics that every early-stage founder needs to master — or at least understand well enough to hire or partner with the right people. Need to craft a more compelling pitch deck? Do you need a sales team and how do you build one? This is the place for you.\n Disrupt 2020 offers so much more:  Startup Battlefield,  Digital Startup Alley, world-class networking with thousands of global attendees — and  CrunchMatch to make finding and connecting with them fast, easy and organized.\n Early-bird pricing — and up to  $300 in savings — disappears in just 48 hours on July 31 when the clock strikes 11:59 p.m. (PT). Don’t miss out on the lowest possible price.  Buy your Disrupt 2020 pass now. Grab the keys and drive your business forward.\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by   filling out this form .", "posttime": "2020-07-31 00:40:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,早起,left,购买", "title": "\n只剩下48小时的早起鸟儿通行证将扰乱2020年", "title_en": "\n\t\t\t\tJust 48 hours left on early bird passes to Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/just-48-hours-left-on-early-bird-passes-to-disrupt-2020/", "via": "", "real_tags": ["2020", "早起", "left", "购买"]}, {"category": "", "categoryclass": "", "imagename": "cf5015d2e29a101ba21af1c8e9197f95.jpeg", "infoid": 1015217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这并不是Boom和劳斯莱斯第一次合作：Boom指出，到目前为止，两家公司在开发过程的各个方面进行了多次不同的合作。劳斯莱斯开发民用飞机发动机的历史可以追溯到第二次世界大战，是世界第二大飞机发动机制造商。\nBoom相对较新的地位应该会很大程度上受益于劳斯莱斯在创造飞机推进系统方面的悠久传统-而且劳斯莱斯参与创造了奥林巴斯593涡轮喷气式飞机，为最初的协和式飞机提供动力，这并不会有什么坏处。\nOverture的目标是成为世界上最快的客机，飞行时间是传统商用喷气式飞机的一半(例如，纽约到伦敦只需三个半小时)。该公司的目标是为经常出差的客户提供基本上专门的商务舱服务，并在未来5到10年的某个时候做到这一点。\nXB-1演示喷气式飞机的展示日期定在今年10月7日，这是我们第一次亲眼看到Boom真正打算驾驶的全功能飞机。", "note_en": "This isn’t the first time Boom and Rolls-Royce have worked together: The two companies have had a number of different collaborations on aspects of their development process to date, Boom notes. Rolls-Royce has a history of developing engines for civil aircraft applications dating all the way back to the Second World War, and is the second-largest maker of aircraft engines in the world.\n Boom’s relative newcomer status should benefit greatly from the long tradition Rolls-Royce has in creating aircraft propulsion systems – and it doesn’t hurt that Rolls-Royce had a hand in creating the Olympus 593 turbojet that powered the original Concorde.\n  The Overture aims to be the world’s fastest passenger aircraft, with flights taking half the time they do on conventional commercial jets (New York to London in just three-and-a-half hours, for instance). The company aims to provide essentially dedicated business class service to a frequent business traveler clientele, and to do so sometime in the next five to 10 years.\n The XB-1 demonstrator jet has a set reveal date of October 7 this year, which is the first time we’ll get a first-hand look at a fully functional aircraft that Boom really intends to fly.", "posttime": "2020-07-31 00:39:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "制造,commercial,飞机", "title": "\nBoom超音速公司招募劳斯莱斯帮助制造世界上速度最快的商用飞机的发动机", "title_en": "\n\t\t\t\tBoom Supersonic enlists Rolls-Royce to help build the engines for world’s fastest commercial aircraft\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/boom-supersonic-enlists-rolls-royce-to-help-build-the-engines-for-worlds-fastest-commercial-aircraft/", "via": "", "real_tags": ["制造", "飞机"]}, {"category": "", "categoryclass": "", "imagename": "114734a6e1c06d74e80de52f81065027.jpeg", "infoid": 1015213, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1985年7月23日，也就是35年前的一周多一点，纽约林肯中心举行了一场星光闪耀的发射。由流行歌星黛比·哈里、现场管弦乐队和传奇艺术家安迪·沃霍尔主演。这不是艺术展，这是不同的。明星云集的发布会是为了一款将永远改变一切的新电脑。\n这期的故事不是关于技术的。这是关于幕后黑手的事。这是一个关于贪婪、仇恨和肆无忌惮的复仇欲望的故事，最终演变成了一场消耗战。\n如果你想每两周在你的收件箱里放一次Dork Web，请填写下面的电子邮件。\n如果您正在您的电子邮件客户端中阅读这篇文章，感谢您将我带到您的收件箱。如果这是您的第一次，本指南将向您展示如何从Dork Web获取更多信息。\n本期的音乐来自水墨点。如果你玩过Fallout，你可能会很熟悉。我觉得这很符合杰克·特拉米尔的故事。点击播放，继续阅读。\n杰克·特拉米尔出生在波兰的罗兹。他从纳粹的奥斯威茨死亡集中营幸存下来，移民到美国，在美国陆军服役，在那里他学会了如何修理打字机。研究特拉米尔的一生，如果用一个词来形容他，那就是“被驱使”。如果有两个词，那么第二个词就太淫秽了，不能在这里使用。\n退伍并当了一段时间的出租车司机后，特拉米尔在一家打字机修理店工作。在给他的雇主带来了一笔巨大的交易而没有得到任何回报之后，他辞职了。特拉米尔和一位军人朋友用军方支持的贷款买下了一家维修店。他们决定取名为“准将便携式打字机”，因为将军和海军上将已经被带走了。\n20世纪50年代，他从华沙条约国家向加拿大进口打字机零部件。然后，他可以生产出口到美国的“加拿大制造”打字机。在将Commodore上市后，面对日本的竞争和一些不可靠的贷款公司交易，Tramiel以40万美元的价格将其17%的股票出售给了加拿大商人欧文·古尔德(下文)。\n古尔德建议特拉米尔访问日本，看看接下来会发生什么。他回来时确信计算器就是未来。准将的LED数字计算器大受欢迎。芯片供应商TI提高了他们的价格，同时发布了他们自己的计算器，以降低Tramiel的价格，并迫使Commodore退出市场。\n特拉米尔从TI的恶作剧中拿到的现金很少，他说服古尔德向准将注入更多的资金，以换取更多的股份。他用这笔现金收购了陷入困境的芯片制造商MOS Technology。现在准将可以在他们自己的游戏中击败TI了。\nMOS的首席设计师查克·桑德尔告诉特拉米尔，计算器就像打字机一样，是一个死胡同的行业。兜售未来的是办公桌大小的电脑。特拉米尔给了商德尔6个月的时间来证明这一点，他制造并发运了一台个人电脑。\nPET(左)、Tandy的TRS-80(右)和Apple II组成了1977年的三连胜，开启了美国的个人电脑革命。(上图由波士顿收藏家Timothy Colegrove通过维基百科提供)。\n准将的电话都挂断了。他们每天接到50个电话，都是想卖PET的人打来的。销售量跟不上需求。PET的成功在一定程度上要归功于它内置的BASIC解释器。准将把Basic外包给了一家叫Micro-Soft的小公司。微软同意在交付后按PET付款。延误对现金流的影响如此之大，以至于他们几乎破产。只有苹果为他们的Apple II许可了MicrosoftBasic才能保存MicrosoftBasic。\n雅达利使用MOS‘6507芯片建造雅达利视频计算机系统，也是在1977年发布的。VCS缺少键盘和BASIC语言。相反，它有颜色和声音。流行的街机游戏“坦克”、“乒乓球”和“越狱”的家庭版大受欢迎。\n雅达利VCS大受欢迎，雅达利被卖给了华纳电信。起初，这被认为是华纳的精明之举，但在几个不成功的产品之后，雅达利变成了一个无底洞。在敲诈员工奖金后，雅达利的几名开发人员辞职成立了动视公司(Activision)。凭借对VCS的深入了解，他们炮制了一场又一场的热门游戏。\n雅达利硬件引擎Jay Miner(上图)致力于为VCS和8位计算机系列开发图形芯片。Miner对他们的限制感到沮丧，要求雅达利允许他们在带有定制芯片的新16位系统上工作。雅达利拒绝了，他辞职了。\n动视都着火了。投资者想要一台动视游戏机。首席执行官拉里·卡普兰(Larry Kaplan)通过剥离出一家名为Hi-Toro的企业，让Miner参与了新电脑的研发工作。1982年，Hi-Toro更名为Amiga Corporation，以避免与日本Hi-Toro Lawnmower公司混淆。\nVCS在1982年更名为2600。Amiga在同一年发布了PowerStick和Joyboard附加组件。这些外围设备不是主要的摇钱树，但它们几乎可以让灯保持亮着。\n1983年，美国游戏机市场崩盘，导致Coleco、仙童、Magnvox和无数其他公司退出市场。由于华纳通信(Warner Communications)的救助，雅达利勉强度日。Activision勉强活了出来，退出了Amiga。\nAhoy上面的视频精彩地报道了这起坠机事件。在欧洲，ZX Spectrum和Commodore 64家用计算机正在腾飞。在日本，任天堂推出了家庭电脑系统(NES在美国)。\n虽然准将的C64在欧洲大受欢迎，但德州仪器的TI-99/4a在市场的低端羞辱了准将。与德州仪器(Texas Instruments)的TI-99/4a相比，Commodore的低端VIC-20计算机1982年的销量惨不忍睹。特拉米尔宣布了一场价格战。1983年，他将VIC-20的价格从599美元降至249美元。当TI降价时，Tramiel会再次削减VIC-20。最终，TI以低于成本价99美元的价格出售了他们的4a，这一举动给他们带来了沉重的打击，以至于他们离开了家用电脑市场。Spectravideo的哈里·福克斯(Harry Fox)当时说，“德州仪器被杰克给骗了。”\n到1983年底，特拉米尔已经粉碎了他的敌人，看到他们被赶在他面前，听到他们经销商的哀叹。他用VIC-20控制了低端市场，用C64控制了高端市场。零售商讨厌他，但又负担不起不进货他的产品。雅达利已经崩溃，每周消耗一百万美元。我被羞辱得无地自容。\n古尔德自60年代以来一直支持特拉米尔。有几种可能的原因，但只有两个知道发生了什么的人已经死亡。特拉米尔走了出去，再也没有回头。他成立了一家名为特拉梅尔科技有限公司(Tramel Technology Limited)的公司，并带着妻子环游世界，同时考虑下一步该做什么。\n古尔德用马歇尔·F·史密斯取代特拉米尔。马歇尔没有零售、消费或电子产品的经验，但他照做了。Commodore计划克隆个人电脑与IBM竞争，甚至获得生产Commodore品牌的英特尔兼容CPU的许可权。他们只需要微软的MS-DOS就可以进行克隆。当他们试图达成协议时，比尔·盖茨一怒之下亲自驳回，在谈到特拉米尔夫妇时说，\n“我永远不会和他们打交道。在你驳回诉讼之前，我们甚至不会谈论MS-DOS，然后我们会讨论相关条款。“。\n“诉讼”是杰克·特拉米尔的特辑。一年前，Commodore宣布他们将以比其他平台更低的价格出售微软的Multiplan电子表格。比尔·盖茨违反了反垄断规定，告诉特拉米尔，他们(准将)不能这么做。作为回应，Tramiel对微软发起了2400万美元的反垄断诉讼。海军准将撤销了诉讼，最终获得了MS-DOS许可证，但损害是永久性的。\nAmiga的硬件达到了负担得起的阶段，但开发商申请了第二次抵押贷款来代替工资。Amiga在1984年1月的冬季CES展上介绍了洛林。原型藏在一块看不见的嵌板后面。人们被洛林的演示震撼了，包括雅达利的工作人员。\n雅达利需要一些东西，任何东西来取代它的8位线。与Amiga的讨论始于1983年。交易很简单：雅达利将使用Amiga的芯片建造他们的“米奇”游戏机。他们会制造芯片，并向Amiga公司支付建造的每台控制台或游戏机的费用。雅达利提供了急需的50万美元预付款。随着讨论的进行，他们争取将米奇变成一台计算机的权利。阿米加需要钱就拿走了。雅达利可能是明天的问题。\n特拉米尔的环游世界之旅因华纳首席执行官史蒂夫·罗斯(Steve Ross)的电话而缩短，他询问是否想要接管雅达利(Atari)。特拉米尔前往加利福尼亚州，并在附近设立了一个办公室，讨论收购事宜。在加利福尼亚州时，一名准将高管向特拉米尔讲述了他在CES上看到的一名C64杀手。Amiga首席执行官戴夫·莫尔斯与特拉米尔和他的儿子们见过几次面。特拉米尔的儿子们都被雇为准将副总裁，他们坐在一起讨论，这些讨论是为了帮助他们的父亲评估C64杀手。\nAmiga首席执行官戴夫·莫尔斯提出了每股3美元的初始报价。每次他试图谈判的时候，特拉米尔夫妇的还价都放弃了。最终特拉米尔夫妇的出价降至1美元以下，谈判破裂。Amiga团队不想与Tramiels有任何瓜葛。他们会坚持使用雅达利，一切都会好起来的。\n由于不知道Amiga和Atari的谈判，Tramiel挖走了准将最优秀的技术人员，包括设拉子·希夫吉(Shiraz Shivji)(上图)。Shivji是C64设计师之一，也是Commodore新Unix工作站的首席硬件设计师。施瓦吉的团队开始了这个基于摩托罗拉68000处理器的项目，RBP(最低价的缩写)。\n1984年上半年，特拉米尔用甜言蜜语说服华纳将公司、资产和负债全部交出，以换取新公司的股份。华纳将摆脱雅达利，并将从任何扭亏为盈中获利。特拉米尔、他的儿子和员工会搬到新的雅达利公司，不用预付首付。\n当Amiga公司听说Tramiel要接管Atari时，他们需要撤退。如果Tramiels夫妇滥用50万美元的雅达利贷款协议，Amiga可能会完全失去筹码。他们需要尽快找到50万美元。\n在6月份的1984年夏季CES上，洛林的原型现在是硅。Commodore发布了一款已经过时的便携式C64，同时发布了两台功能较弱的C64不兼容的机器。与此同时，特拉米尔夫妇与华纳举行了会议。\nAmiga的RJ Mical和Dale Luck为一月份的冬季CES展制作了一个以弹跳球为特色的演示。第一天晚上，他们用6包温啤酒来提炼。戴尔在上面谈到了这一点，你可以在下面的一台真正的Amiga 1000上看到它。\n弹跳球震惊了观众。当屏幕显示它与其他演示程序一起运行时，人群开始寻找作弊的迹象。Amiga Lorraine在CES上引起了巨大的轰动，但首席执行官戴夫·莫尔斯仍然需要买家。他在硅谷图形公司(Silicon Graphics)、索尼(Sony)、惠普(Hewlett Packard)甚至苹果公司(Apple)都听到了同样的担忧，向他们兜售Amiga。没有人想要任何不与IBM兼容的东西。\n准将知道特拉米尔的偷猎队正在做一件大事，所以他们看了看阿米加。如果他们买了这个产品，他们就会比雅达利抢先一步。唯一可能出错的是如果Tramiel阻止他们在一台新电脑上使用芯片。但由于特拉米尔与雅达利捆绑在一起，这是永远不会发生的。\n特拉米尔不需要买下阿米加公司。他已经拥有芯片的权利了。设拉子的RBP甚至没有用过它们。海军准将的unix系统还需要两年时间。RBP可能会夺走新的16位市场，让准将黯然失色。唯一可能出错的是，如果有人用类似价位的Lorraine芯片制造了一台竞争对手的电脑。因为特拉米尔拥有永远不会发生的权利。\nAmiga和Commodore团队因为共同热爱不为杰克·特拉米尔所有而紧密联系在一起。戴夫·莫尔斯(Dave Morse)坦率地说：Amiga需要一笔超过50万美元的贷款，以便在3天内偿还Atari，以确保筹码不会自动流向Tramiel。准将需要一台新的低成本计算机来取代C64，而洛林可能就是它。准将批准了一笔贷款，并专注于许可芯片。\n两天后，Amiga的戴夫·莫尔斯(Dave Morse)带着一张50万美元的支票来到雅达利的办公室。Atari无法理解为什么Amiga不想让他们使用Mickey控制台中的芯片。与此同时，特拉米尔正在与雅达利会面，以结束谈判。当被问及如何处理这张支票时，他说，\n“当有人递给你一张50万美元的支票时，你就接受了。你很快就能把钱存入银行。“。\n如果特拉米尔知道全部情况，他可能不会接受这张支票，但50万美元对于带进雅达利来说是一大笔钱。在接下来的几天里，Tramiel接管了Atari，以换取Tramiel新成立的Atari公司的股票。\nCommodore在1984年开始时是市值10亿美元的股市宠儿，但现在已经严重崩溃。市场知道特拉米尔正在行动，准将只有C64，没有什么新鲜事。古尔德预计股价会受到打击，但绝不会像这样。受够了员工被挖走，准将执行了特拉米尔的战术。\n准将对包括Shiraz Shivji在内的四名前员工提起诉讼，指控他们窃取知识产权。禁止“准将4”在雅达利工作的禁令，减缓了RBP的发展。他们暂时阻止了特拉米尔的所作所为，但需要自己的项目来止血。\n准将的交易包括许可洛林的芯片。为什么不干脆买下整个公司呢？古尔德也在船上，经过激烈的谈判，以每股4.25美元的价格达成了协议，只有4x Tramiel的最终报价。除了烧钱，没有必要买下阿米加。最后的文书工作花了更长的时间，但这笔交易是板上钉钉的。\n到7月下旬，Tramiel解雇了几乎所有参与8位产品线的人，以专注于RBP。准将的禁令减缓了RBP的发展。他需要对付准将的筹码。杰克的儿子伦纳德·特拉米尔从阿米加那里找到了50万美元的支票和贷款协议，并把它给他父亲看。\nTramiel与华纳重新谈判，声称Atari在出售时因Amiga交易的失败而贬值，忘记了他告诉Atari兑现支票。华纳在8月份将Amiga的合同转移给了雅达利公司(Atari Corp)，他的法律团队对准将和杰伊·米纳提起了欺诈诉讼。诉讼要求永久禁令，阻止准将使用Amiga芯片，并赔偿1亿美元。\n如果特拉米尔的策略是阻止准将收购阿米加公司，那是行不通的。随着诉讼加剧，准将的购买完成。1984年剩下的时间用来腾出新准将-阿米加和雅达里的工作人员。\n每台计算机都有硬件，但都没有正常运行的操作系统。准将购买并授权了数字研究公司的宝石桌面。当雅达利公开宣布他们将使用它时，准将放弃了宝石。\nAmiga硬件几乎准备好了，但是没有可以正常工作的操作系统。在1985年1月的CES展会上，准将重点展示了他们的新C128。那里只有两个主要的个人电脑玩家：准将和他们的宿敌雅达利。如果不是在雅达利地区，C128将是目前仅次于苹果Macintosh的第二先进系统。\n子堆栈不处理YouTube时间戳，但你可以在上面视频的9分钟内看到雅达利区域。\n虽然雅达利的65XE和130XE将与C64和C128展开竞争，但设拉子·希夫吉的最低价“Jackintosh”却在舞台上拉拢观众。\n和苹果的麦金塔电脑一样，它也有一个图形用户界面，一个3.5英寸的软盘驱动器，一个摩托罗拉68000中央处理器和128kb的内存，但是价格还不到400美元！有计划推出256KB甚至512KB的超大版本，售价为600美元。在Atari的区域上方悬挂着“权力无价”的字样。\nShivji的雅达利130ST显示单元是中空的外壳，但人们可以看到它们。阿米加准将号无处可见。准将没有谈论电脑，而是发布了一份声明，称现在是福布斯500强公司。\n在1985年6月的夏季CES展览会上，准将再次将重点放在C128上。雅达利推出了雅达利260STD，售价为499美元，并宣布520ST已经在加拿大和欧洲发货。这不是真的，但已经无关紧要了。\n到6月底，Amiga硬件已经完成，但软件尚未完成。阿米加准将从英国Commodore和MetaComCo的其他部门请来工程师帮助完成操作系统。它有缺陷，经常坠毁，但到了7月中旬，它大部分都起作用了。然而，还有另一个问题。启动计算机所需的Kickstart ROM尚未准备好。没有它，阿米加就是一块昂贵的砖头。一种昂贵的变通办法进一步推高了价格。\n到七月初，准将陷入了严重的麻烦之中。SX-64和新的Plus/4已经泡汤了，C128也卖不出去。准将的股票几乎一文不值。准将的银行对收回贷款颇有微词。\n欧文·古尔德用百事可乐(PepsiCo)前高管托马斯·拉蒂根(Thomas Rattigan)取代了准将首席执行官。准将需要一场大胜才能度过这一年。古尔德同意为1985年剩下的时间仅为Amiga制定2500万美元的巨额营销预算。其中大部分是为圣诞节准备的，但也有大量的钱留到了准将有史以来的第一个发布会上。只有一个问题。\n1985年7月23日下午6：30，数百人坐在纽约林肯中心的薇薇安·博蒙特剧院。他们都在等待准将的新Amiga电脑的揭幕仪式。\n软件工程负责人鲍勃·帕里索(Bob Pariseau)担任仪式主持人。他用一个多任务Boing演示展示了Amiga的直觉桌面。现场表演数字化汤姆斯和电吉他的声音响起，人群发出了欢呼声。他们对动画赞不绝口。然后，他们看到Amiga模拟IBM PC，在Lotus1-2-3 for MS-DOS上显示电子表格。在等待装载时，Pariseau说，\n“我为延迟表示歉意，但在Amiga计算机上加载Lotus 1-2-3所需的时间与在IBM PC上加载Lotus 1-2-3所需的时间完全相同。”\n在Pariseau以Boing球的演示结束后，他把球交给了安迪·沃霍尔。安迪·沃霍尔在舞台上用数码捕捉流行歌星黛比·哈里时玩着一个油漆包。结果看起来像他的玛丽莲·梦露的画作，这才是最重要的。发布会以一部配上音乐的芭蕾舞动画结束。\n与会者来到了一个大厅区域，大厅里挤满了第三方开发商。电子艺术、Infocom和其他公司展示了Amiga的新产品。阿米加准将成功地完成了任务。杰伊·米纳的个人超级电脑就在这里，用立体声直播。\n尽管这是一个伟大的时刻，但为时已晚。雅达利已经向全球发运了520ST。Amiga售价1295美元，物有所值。花799美元，你现在就可以拥有一台雅达利520ST，鼠标，磁盘驱动器，软件和单色显示器。\n阿米加快要完工了。该系统需要批量生产、营销和销售。Commodore通过低成本连锁店销售产品。杰克·特拉米尔在PET中使用了高端专家，并在VIC-20和Commodore 64上对他们进行了诱饵和调换。许多专家再也不会卖准将产品了。\n明智的做法是以尽可能低的价格批量生产，像Commodore那样建造一切，使其对零售商来说太有吸引力，不会拒绝并投放大牌赞扬Amiga功能的广告，就像下面的VIC-20广告一样。\n事情不是这样的。事实上，这几乎与发生的情况相反。\nAmiga是一台革命性的计算机，远远超过了它的时代，几乎没有人能理解它。它也很贵。K-Mart不会把一台1295美元的电脑卖到300美元的Commodore 128，甚至799美元的Atari 520ST。\n没有人知道如何定义Amiga，尤其是准将的营销部。这导致了一些80年代“我不知道我在看什么”的广告，比如臭名昭著的“心灵旅行者”广告(上图)。\n新任首席执行官托马斯·拉蒂根(Thomas Rattigan)对阿米加(Amiga)并不了解。他聘请了他以前所在行业的营销主管。他们带来了。\n.", "note_en": "On July 23rd 1985, a little over a week and 35 years ago a star-spangled launch took place at the Lincoln Center, New York. Featuring pop star Debbie Harry, a live orchestra, and legendary Artist Andy Warhol. This was no art show, this was different. The star-studded launch was for a new computer that would change things forever.\n   This issue’s story isn’t about technology. It’s about the people behind it. It’s a story of avarice, hatred and an unbridled lust for revenge that descended into a war of attrition.\n If you’d like The Dork Web in your inbox every fortnight, fill in your email below.\n  If you’re reading this in your email client, thanks for bringing me into your inbox. If it’s your first time, this  guide shows how to get more from The Dork Web.\n  This issue’s music comes from The Ink Spots. If you’ve played Fallout it might be familiar. I thought it fits Jack Tramiel’s story well. Hit play and read on.\n  Jack Tramiel was born in Lodz, Poland. He survived Nazi&#39;s Auschwhitz death camp, emigrated to the United States and served in the US Army where he learned how to repair typewriters. Studying Tramiel&#39;s life, if one word described him it&#39;d be, “driven”. If two words were available, the second one would be too obscene to use here.\n After leaving the army and a spell as a taxi driver, Tramiel worked at a typewriter repair shop. After bringing a huge deal to his employer and getting nothing in return he quit. Tramiel and an army friend bought a repair shop with a military-backed loan. They settled on the name Commodore Portable Typewriter because General and Admiral were already taken.\n In the 1950s he imported typewriter parts from Warsaw Pact countries to Canada. He could then produce “Canadian made” typewriters for export to the US. After taking Commodore public, facing Japanese competition and some dodgy loan company dealings Tramiel sold 17% of his stock to Canadian businessman Irving Gould (below) for $400,000.\n   Gould suggested Tramiel visit Japan to find out what was coming out next. He came back convinced that calculators were the future. Commodore’s LED digital calculators were a huge hit. Chip supplier TI jacked up their prices while releasing their own caculators to undercut Tramiel and force Commodore out of the market.\n Low on cash from TI’s shenanigans Tramiel convinced Gould to inject more money into Commodore in exchange for more shares. He used the cash to buy struggling chip manufacturer MOS Technology. Now Commodore could beat TI at their own game.\n MOS’ lead designer Chuck Peddle told Tramiel that calculators, like typewriters were a dead end business. To Peddle the future was in desk-sized computers. Tramiel gave Peddle 6 months to prove it by building and shipping a personal computer.\n   The PET (left), with Tandy’s TRS-80 (right) and the Apple II formed the 1977 trifecta kickstarting America’s Personal Computer revolution. (Image above courtesy of Boston-based collector Timothy Colegrove via wikipedia)\n Commodore’s phones rang off the hook. They had 50 calls a day from people wanting to sell the PET. Distribution couldn’t keep up with demand. The PET’s success was partly due to it&#39;s built-in BASIC interpreter. Commodore outsourced BASIC to a small firm called Micro-Soft. Micro-Soft agreed to be paid per PET once delivered. Delays hurt cash flow so much they nearly went under. Micro-Soft were saved only by Apple licensing Micro-Soft BASIC for their Apple II.\n  Atari used MOS’ 6507 chip to build their Atari Video Computer System, also released in 1977. The VCS lacked a keyboard and BASIC language. Instead it had colour  and sound. Home versions of popular arcade games Tank, Pong and Breakout took off.\n The Atari VCS was an enormous hit and Atari was sold to Warner Telecommunications. Initially this was seen as a shrewd move for Warner but after several unsuccessful products Atari became a bottomless money pit. After gouging staff out of bonus payments several Atari developers quit to set up Activision. Armed with intimate knowledge of the VCS, they churned out hit game after hit game.\n   Atari hardware enginer  Jay Miner (above) worked on graphics chips for the VCS and 8-bit computer range. Frustrated by their limits Miner asked Atari for permission to work on a new 16-bit system with custom chips. Atari refused and he quit.\n Activision were on fire. Investors wanted an Activision games machine. CEO Larry Kaplan brought Miner in to work on the new computer through a spin-off venture, Hi-Toro. In 1982, Hi-Toro changed their name to Amiga Corporation to avoid confusion with the Japanese Hi-Toro Lawnmower company.\n The VCS was rebranded as the 2600 in 1982. Amiga released the Powerstick and Joyboard add-ons in the same year. These peripherals weren&#39;t major money spinners but they just about kept the lights on.\n  In 1983 the US games console market imploded taking Coleco, Fairchild, Magnavox and countless others out of the market. Atari scraped by thanks to Warner Communications bailouts. Activision barely made it out alive and pulled out of Amiga.\n  Ahoy’s video above brilliantly covers the crash. In Europe, the ZX Spectrum and Commodore 64 home computers were taking off. In Japan Nintendo launched the Family Computer System (NES in the US).\n While Commodore&#39;s C64 hit it big in Europe, Texas Instruments’ TI-99/4a humiliated Commodore at the market’s low end. Compared to Texas Instruments’ TI-99/4a, Commodore’s low-end VIC-20 computer’s 1982 sales were atrocious. Tramiel declared  a price war. Over 1983, he dropped VIC-20 prices from $599 to $249. When TI cut prices, Tramiel would cut the VIC-20 again. In the end TI sold their 4a below cost at $99, a move that hurt so badly that they left the home computer market. Spectravideo’s Harry Fox said at the time, “TI got suckered by Jack”.\n  By late 1983 Tramiel had crushed his enemies, seen them driven before him and heard the lamentations of their dealerships. He controlled the low end of the market with the VIC-20 and the high end with the C64. Retailers hated him but couldn’t afford not to stock his products. Atari had imploded and was burning a million dollars a week. TI were utterly humiliated.\n  Gould had backed Tramiel since the 60s. There were several possible causes but the only two people who know what happened are dead. Tramiel walked out and never looked back. He set up a company, Tramel Technology Limited and took his wife on a round the world cruise while figuring out what to do next.\n Gould replaced Tramiel with Marshall F. Smith. Marshall had no retail, consumer or electronics experience but did as he was told. Commodore planned a PC clone to compete with IBM, even licensing rights to produce Commodore-branded Intel compatible CPUs. All they needed for the clone was Microsoft’s MS-DOS. When they tried to strike a deal, Bill Gates personally dismissed it in a fit of rage, saying of the Tramiels,\n “I will never deal with them. We’re not even going to talk about MS-DOS until you dismiss the lawsuit and then we’ll talk about terms for that.”\n “The lawsuit” was a Jack Tramiel special. A year earlier, Commodore announced they&#39;d sell Microsoft’s Multiplan spreadsheet at a lower price than any other platform. In violation of Antitrust rules, Bill Gates told Tramiel they (Commodore) couldn’t do it. In response Tramiel launched a $24 million anti-trust lawsuit against Microsoft. Commodore dropped the lawsuit and eventually secured MS-DOS licences, but the damage was permanent.\n   Amiga’s hardware reached the breadboard stage but developers took out second mortgages in-lieu of salaries. Amiga introduced Lorraine at the January 1984 Winter CES show. The prototype was hidden behind a panel away from sight. People were blown away by the Lorraine’s demos, including Atari staff.\n Atari needed something,  anything to replace it’s 8-bit line. Discussions with Amiga started in 1983. The deal was simple: Atari would build their “Mickey” console using Amiga’s chips. They’d manufacture the chips and pay Amiga Corporation for each console or arcade machine built. Atari offered a desperately needed $500,000 advance. As discussions progressed they pushed for the right to turn Mickey into a computer. Amiga needed the money and took it. Atari could be tomorrow’s problem.\n Tramiel’s round-world trip was cut short by a call from Warner CEO Steve Ross asking if he wanted to take over Atari. Tramiel headed to California, and set up an office nearby to discuss an acquisition. While in California a Commodore exec told Tramiel about a C64 killer he saw at CES. Amiga CEO Dave Morse met Tramiel and his sons several times. Tramiel’s sons were all still employed as Commodore VPs while they sat in discussions set up to help their Dad evaluate the C64 killer.\n Amiga CEO Dave Morse put forward an initial $3 per share offer. Every time he tried to negotiate the Tramiels’ counter-offer dropped. Eventually the Tramiels’ offer dropped below $1 and talks disintegrated. The Amiga team wanted nothing to do with the Tramiels. They’d stick with Atari, and everything would work out fine.\n   Unaware of Amiga-Atari discussions, Tramiel poached Commodore’s best technical staff including Shiraz Shivji (above). Shivji was one of the C64 designers and the lead hardware designer on Commodore’s new Unix workstation. Shivji&#39;s team started work on the project, RBP (short for Rock Bottom Price) based on Motorola’s 68000 CPU.\n Over the first half of 1984, Tramiel sweet-talked Warner into handing over the company, it’s assets and none of it’s liabilities in exchange for little more than shares in the new firm. Warner would be free of Atari and would profit from any turnaround. Tramiel, his sons and staff would move to the new Atari company for no money down.\n When Amiga Corporation heard that Tramiel was going to take over Atari, they needed to get out. If the Tramiels abused the $500,000 Atari loan agreement Amiga could lose the chips entirely. They needed to find $500,000, and quick.\n  At June’s 1984 Summer CES show the Lorraine prototype was now silicon. Commodore released an already obsolete portable C64 alongside two less powerful C64-incompatible machines. Meanwhile the Tramiels held meetings with Warner.\n Amiga’s RJ Mical and Dale Luck had worked on a demo featuring a bouncing ball for the January Winter CES show. On the first night they refined it over a 6 pack of warm beer. Dale talks about it above, and you can see it on an actual Amiga 1000 below.\n  The bouncing ball shocked viewers. When the screen showed it running alongside other demos the crowd started to look for signs of cheating. The Amiga Lorraine built a huge buzz at CES but CEO Dave Morse still needed a buyer. He hawked the Amiga around Silicon Graphics, Sony, Hewlett Packard and even Apple hearing the same concerns. Nobody wanted anything that wasn’t IBM compatible.\n Commodore knew Tramiel’s poached team were working on something big, so they looked at the Amiga. If they bought the product they’d get the Jump on Atari. The only thing that could go wrong was if Tramiel stopped them using the chips in a new computer. But as Tramiel was tied up with Atari that could never happen.\n Tramiel didn’t need to buy Amiga Corporation. He already had the chip rights. Shiraz’s RBP didn’t even use them. Commodore’s Unix system was still two years away. The RBP could take the new 16-bit market and leave Commodore in the dust. The only thing that could go wrong was if someone built a rival computer with the Lorraine chips at a similar price point. As Tramiel had the rights that could never happen.\n The Amiga and Commodore teams bonded over their shared love of not being owned by Jack Tramiel. Dave Morse put his cards on the table: Amiga needed a loan of over $500,000 to pay Atari within 3 days to ensure that the chips didn’t automatically go to Tramiel. Commodore needed a new low-cost computer to replace the C64 and Lorraine could be it. Commodore approved a loan and focused on licensing the chips.\n Two days later Amiga’s Dave Morse went to Atari’s offices with a $500,000 cheque. Atari couldn’t understand why Amiga didn’t want to let them use the chips in the Mickey console. At the same time Tramiel was in a meeting with Atari wrapping up negotiations. When asked what to do about the cheque he said,\n “When somebody hands you a check for $500,000 you take it. You get it into the bank quickly.”\n Had he known the full picture Tramiel might not have taken the cheque, but $500,000 was a lot of money to bring into Atari. Over the next few days Tramiel took over Atari in exchange for stock in Tramiel’s new Atari Corporation company.\n Commodore started 1984 as a billion dollar stock market darling but by now was crashing hard. The markets knew Tramiel was on the move, that Commodore only had the C64 and that there was nothing new. Gould expected a stock price hit, but nothing like this. Fed up with staff being poached, Commodore executed the Tramiel playbook.\n Commodore filed a lawsuit against four former staff including Shiraz Shivji for stealing intellectual property. An injunction was filed to stop the “Commodore 4” from working at Atari, slowing down RBP development. They stopped whatever Tramiel was up to for now, but needed their own project to stop the bleeding.\n Commodore’s deal involved licencing the Lorraine’s chips. Why not just buy the whole company? Gould was on board and after tight negotiations struck a deal at $4.25 per share, only 4x Tramiel’s final offer. Aside from burning money there was no need to buy Amiga. The final paperwork took longer, but the deal was in the bag.\n By late July, Tramiel fired nearly everyone involved in the 8-bit product lines to focus on the RBP. Commodore’s injunction slowed down RBP development. He needed leverage against Commodore. Jack&#39;s son Leonard Tramiel found the $500,000 cheque from Amiga along with the loan agrement and showed it to his father.\n Tramiel renegotiated with Warner, claiming Atari’s value dropped at the time of sale by the loss of the Amiga deal, forgetting he told Atari to cash the cheque. Warner transferred the Amiga contract to Atari Corp. In August his legal team filed a fraud lawsuit against Commodore and Jay Miner. The lawsuit requested a permanent injunction to stop Commodore using the Amiga chips and $100 million in damages.\n  If Tramiel’s strategy was to stop Commodore from buying Amiga Corporation it didn’t work. Commodore’s purchase completed as lawsuits intensified. The rest of 1984 was spent freeing up staff at the new Commodore-Amiga and Atari.\n Each computer had hardware but neither had a functioning Operating System. Commodore bought and licenced Digital Research’s GEM desktop. When Atari publicly announced they’d use it, Commodore dropped GEM.\n The Amiga hardware was almost ready but there was no functioning Operating System. At the January 1985 CES show Commodore focused on their new C128. There were only two major personal computer players there: Commodore, and their old enemy Atari. The C128 would be the second most advanced system present after the Apple Macintosh if it wasn’t for something in the Atari area.\n  Substack doesn&#39;t handle Youtube timestamps but you can see the Atari area from 9 minutes into the video above.\n Although Atari’s 65XE and 130XE would compete with the C64 and C128, Shiraz Shivji’s Rock Bottom Price “Jackintosh” was on stage wooing the audience.\n Like the Apple Macintosh it had a GUI interface, a 3.5” floppy disk drive, a Motorola 68000 CPU and 128kb of RAM but at under $400! There were plans for a 256kb and even massive 512kb version that would go on sale for $600. Above Atari’s area hung the words, “Power Without The Price”.\n Shivji’s  Atari 130ST display units were hollow cases, but people could see them. The Commodore Amiga was nowhere to be seen. Instead of talking about about computers, Commodore released a statement about now being a Forbes 500 company.\n At the June 1985 Summer CES exhibition Commodore again focused solely on the C128. Atari introduced the Atari 260STD at $499 and announced the 520ST was already shipping in Canada and Europe. This wasn’t true but it no longer mattered.\n By the end of June the Amiga hardware was complete but the software was unfinished. Commodore Amiga pulled in engineers from other parts of Commodore and MetaComCo in the UK to help finish the Operating System. It was buggy and crashed often but by mid-July it mostly worked. There was however, another problem. The Kickstart ROM needed to start the computer wasn’t ready. Without it the Amiga was an expensive brick. An expensive workaround pushed up prices even more.\n By the start of July Commodore was in serious trouble. The SX-64 and new Plus/4 were dead in the water and the C128 wasn’t selling. Commodore shares were almost worthless. Commodore’s banks grumbled about calling in loans.\n Irving Gould replaced the Commodore CEO with former PepsiCo exec Thomas Rattigan. Commodore needed a big win to make it through the year. Gould agreed a massive $25 million marketing budget for the rest of 1985 just for the Amiga. Most of this was for the Christmas season but a large amount was put aside for Commodore’s first ever launch event. There was only one problem.\n   At 6:30pm on the 23rd of July 1985, hundreds of people sat in the Vivian Beaumont theater at New York’s Lincoln center. They were all waiting for the unveiling of Commodore’s new Amiga computer.\n Head of Software Engineering Bob Pariseau acted as master of ceremonies. He showed off the Amiga’s Intuition desktop with a multitasking Boing demo. The crowd roared at the sound of live performances of digitised tomtoms and electric guitars. They gushed at the animations. Then they saw the Amiga emulate an IBM PC, display spreadsheets on Lotus 1-2-3 for MS-DOS. While waiting for it to load, Pariseau said,\n “I apologise for the delay but it takes exactly as long to load Lotus 1-2-3 on an Amiga computer as it takes on an IBM PC”\n After Pariseau ended with the Boing ball demo, he handed over to Andy Warhol. Andy Warhol played with a paint package on a digitized capture of pop star Debbie Harry on stage. The result looked like his Marilyn Monroe paintings which is all that mattered. The launch ended with a ballet animation set to music.\n Attendees came to a lobby area filled with 3rd-party developers. Electronic Arts, Infocom and others showed off new Amiga products. Commodore Amiga had pulled it off. Jay Miner’s personal super computer was here, live in stereo.\n  As great a moment as it was, it was too late. Atari had shipped the 520ST worldwide. The Amiga’s $1295 price tag was worth every penny. For $799 you could have an Atari 520ST, Mouse, Disk Drive, software and monochrome monitor, right now.\n  The Amiga was almost complete. The system needed to be mass-produced, marketed and sold. Commodore sold products through low-cost chains. Jack Tramiel used high-end specialists for the PET and bait-and-switched them over the VIC-20 and Commodore 64. Many specialists would never sell Commodore products again.\n The smart thing would be to mass produce as cheaply as possible, build everything as Commodore had done, make it too attractive for retailers to reject and run adverts with a big name extolling the Amiga’s features, like the VIC-20 ad below.\n  This was not what happened. In fact, this was nearly the opposite of what happened.\n The Amiga was a revolutionary computer so far ahead of it’s time few people understood it. It was also expensive. K-Mart wouldn’t sell a $1295 computer next to $300 Commodore 128s or even $799 Atari 520STs.\n  Nobody knew how to define the Amiga, least of all Commodore’s marketing department. This lead to some peak 1980s I-don’t-know-what-I’m-watching commercials, like the infamous mind voyager commercial, above.\n New CEO Thomas Rattigan didn&#39;t understand the Amiga. He hired marketing executives from his previous industry. They brought in\n......", "posttime": "2020-07-31 00:34:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "烧伤,burn,准将", "title": "撞车与烧伤：Amiga St的故事", "title_en": "Crash and Burn: The Amiga ST Story", "transed": 1, "url": "https://thedorkweb.substack.com/p/crash-and-burn-the-amiga-st-story", "via": "", "real_tags": ["烧伤", "burn", "准将"]}, {"category": "", "categoryclass": "", "imagename": "739bbecd63f67b4276c86e82ceb0756b.png", "infoid": 1015212, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们Stratiteq喜欢探索新技术，看看它们如何应用到现实生活中。这是我们最近的一个项目的故事。\n该项目的灵感来自美国国家航空航天局(NASA)去年宣布的蜻蜓飞行任务，该任务将于2026年发射，目标是探索土星最大的卫星泰坦(Titan)。蜻蜓将成为一个类似于无人机的航天器，在大小上就像火星漫游车一样，它将是有史以来第一个能够将其整个科学研究有效载荷从泰坦表面的一个地方转移到另一个地方进行物质分析的飞行器。蜻蜓并不是唯一一个不会使用无人机技术的任务。将于明天(2020年7月30日)发射的火星毅力月球车还将搭载火星直升机前往火星，以便在另一个世界首次测试这项技术。\n我们的项目，蜻蜓迷你，是一种由漫游车和无人机组成的自主车辆系统。漫游车由一台名为NVIDIA Jetson Nano的小型计算机驱动，这是一台能够处理不同AI算法的小型超级计算机。它可以自主移动，但也可以进行远程控制。它配备了摄像头和手机，可以作为连接互联网的智能接入点。此外，我们不仅是一个通信设备，我们还可以对它进行远程控制。它配备了一个摄像头和一部手机，用作连接互联网的一个无线接入点。此外，我们还可以作为一个通信设备，我们还可以对它进行远程控制。它配备了一个摄像头和一部手机，用作连接互联网的智能接入点。此外，我们还可以作为一种通信设备，我们还可以对它进行远程控制。这让它可以更好地了解周围地区。收集到的数据通过Jetson Nano进行处理，数据点被上传到微软的Azure云中。\n为了测试我们的漫游车，我们决定去冰岛旅行。除了能够在良好的环境中录制，冰岛距离我们在马尔默的总部超过2000公里，我们认为这是一个足够令人印象深刻的距离，可以测试这个项目。测试是在冰岛南部进行的，我们小心翼翼地只在允许的地区进行测试，因为你可能知道，冰岛的苔藓是受保护的，如果受到破坏，需要数年时间才能恢复。如果你正在计划一个类似的实验，请记住这一点。请随时查看下面的视频，看看参与该项目的人对此有何评论。\n为了更好地执行这个项目，有不同的挑战。我们必须弄清楚的第一件事是如何移动月球车。我们为Jetson Nano配备了智能摄像头，并通过深度学习对其进行了障碍检测的培训。\n避撞在办公室工作得很好，但在现实世界中有未知的障碍，所以我们决定在ios手机上使用FcRN(完全卷积残差网络)模型，如前所述，我们将其添加到漫游车中，以便能够连接互联网。有了苹果的Core ML，我们能够很容易地做出深度预测。\n手机也被用来提供来自传感器的数据，所以我们在Azure云中建立了一个API服务器，在那里我们可以发送GPS位置、海拔、指南针数据和其他数据点。数据按会话组织，并在Power BI报告中可视化。\nRyze和Tello的无人机系统似乎不像是我们使用案例的理想无人机，因为它重量轻，可编程。这款无人机拥有强大的Python SDK，可以轻松连接Jetson Nano。\n为了能够手动控制月球车，我们在一个新的仪表盘上创建了一个新的仪表盘，并在上面添加了一些手动控制。我们决定使用MQTT，这是一种用于小型物联网设备的轻量级传输协议。除了控件，我们还添加了最新的数据，以及用Core ML创建的摄像头快照和深度估计图片，使用Azure Application Insights对整个通信进行了实时监控。\n冰岛是北大西洋海雀的故乡，这种小鸟的喙颜色非常鲜艳。这些鸟只生活在北大西洋北部，它们在冰岛北部受到保护。到目前为止，我们已经在几个使用案例中看到了人工智能如何帮助追踪濒危物种，我们第一个使用案例的灵感就来自于此。我们决定重新培训一款能够检测海雀的定制型号，并用我们录制的视频在Jetson Nano上对该型号进行了测试。我们还决定探索搜救场景的可能用途，因为无人机不能覆盖广阔的区域。\n还有许多其他用例可以使用这种技术。我们的暑期实习生塞西莉亚·伦德伯格写了一篇博客文章，讲述了她在Stratiteq做的一个项目，展示了如何使用这种技术来测量社会距离，你可以在这里阅读到关于它的所有信息。\n我们将继续致力于这个项目，我们将发布一系列技术博文，介绍我们在建设这个项目时是如何解决具体挑战的；如果您愿意了解更多信息，我们可以随时在Dev.to上关注我们。\n特别感谢夏洛特、埃利亚斯、埃里克、弗兰克、约尔根、约瑟芬、金、保罗、拉斯穆斯、西尼萨和尤尔代尔，并感谢所有其他帮助完成这个项目的Stratiteq员工。", "note_en": "We at Stratiteq love to explore new technologies and see how they can be applied in real life. Here is a story of one of our recent projects.\n  Inspiration for this project came from    NASA’s Dragonfly    mission   that was announced last year and will be launched 2026 with the goal of exploring Titan, the largest moon of Saturn. Dragonfly will be a drone-like spacecraft, size-wise like the Mars -rover, and it will be the first vehicle ever that is capable to transfer its entire scientific payload from one place to another on Titan’s surface for material analysis. Dragonfly is not the only mission that will use drone technology. The Perseverance rover that will be launched tomorrow (July 30, 2020) will also carry the    Mars Helicopter   with it to Mars in order to test this technology for the first time on another world.\n  Our project, Dragonfly Mini, is an autonomous vehicle that consist of a rover and a drone. The rover is powered by an    NVIDIA Jetson Nano  , a small supercomputer that is capable of processing different AI algorithms. The rover can move autonomously, but it can also be controlled remotely. It is equipped with a camera and mobile phone that is used as an access point to the Internet.   Besides being a communication device, we also made full usage of the mobile phone cameras, sensors and its processing power.   The rover is capable of controlling camera equipped drone, which gives it better overview of the surrounding area. Collected data is processed with the Jetson Nano and data points are uploaded to    Microsoft’s Azure cloud  .\n  In order to test our rover, we decided to take a trip to Iceland. Besides being able to record in a nice environment, Iceland is over 2000 kilometres away from our home office in Malmö and we consider it to be an impressive enough distance for a test of this project. Tests were done in the southern part of Iceland and we were careful to test it on allowed areas only, since, as you probably know, moss on Iceland is protected and if damaged takes years to grow back. If you are planning a similar experiment, please have that in mind. Feel free to check the video below to see what people who worked on the project said about it.\n     There were different challenges in order to execute this project. The first thing we had to figure out is how to move the rover. We equipped the Jetson Nano with a camera, and we trained it for obstacle detection through deep learning.\n      Collision avoidance worked well in the office, but in the real world there are unknown obstacles so we decided to use the FCRN (Fully Convolutional Residual Network) model on the iOS phone, which we, as mentioned earlier, added to the rover to be able to have Internet connection. With      Apple’s Core ML   we were able to easily make depth prediction.\n      The mobile phone was also used to provide the data from its sensors, so we built an API in Azure cloud where we were sending GPS location, altitude, compass data and other data points. Data was organised in sessions and it was visualized in Power BI reports.\n      The     Ryze Tello   drone  seemed like an ideal drone for our use case because it is lightweight and programmable. This drone has a Python SDK which can be easily connected with Jetson Nano.\n To be able to control the rover manually we created a dashboard and we added manual controls to it. We decided to use MQTT, a lightweight transfer protocol used for small IoT enabled devices. Beside controls, we also added the latest data, together with a camera snapshot and depth estimation picture created with Core ML. The whole communication was monitored live with Azure Application Insights.\n     Iceland is home to the Atlantic puffins, small birds with brightly coloured beaks. These birds live only in the North Atlantic Ocean and they are protected on Iceland. So far, we have seen several use cases how    AI can help track endangered species   and inspiration for our first use case came from  that. We decided to train a custom model that is capable to detect puffins and we tested the model on the Jetson Nano with the videos we recorded. We also decided to explore possible usage for search and rescue scenarios, since drones can cover vast areas.\n  There are many other use cases where such technology can be used. Our summer intern, Cecilia Rundberg, wrote a blog post about the project she did at Stratiteq, demonstrating how such technology can be used for measuring the social distancing. You can read all about it    here  .\n  We’ll continue working on this project and we’ll publish a series of technical blogposts on how we   solved specific challenges while building this project  ; feel free to    follow us on Dev.to   if you like to know more about it.\n  Special thanks go out to Charlotte, Eliass, Erik, Frank, Jörgen, Josefine, Kim, Paul, Rasmus, Sinisa, Yurdaer and to all other Stratiteq employees who helped with this project.", "posttime": "2020-07-31 00:32:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蜻蜓,dragonfly,无人机", "title": "蜻蜓迷你-2000公里任务", "title_en": "Dragonfly Mini – 2000km mission", "transed": 1, "url": "https://blog.stratiteq.com/dragonfly-mini-2000km-mission", "via": "", "real_tags": ["蜻蜓", "dragonfly", "无人机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你再也不用去找这些东西了。当你一天做几次通常需要多次按键的事情时，可以使用它们。\n只需轻触食指即可切换输入区域设置或启动密码管理器。\n我们专门为月球着陆器设计了这三个容易拿到的按键，每个按键上都有一个垂直的轮廓和一个专用的背光槽。\n当你搭起帐篷并倾斜键盘时，它会自动倾斜，所以它总是在你期望的地方。\n无论你的手是什么大小，月球着陆器的拇指和翅膀模块都可以进行调整，以完美地适应你的需求。\n拇指模块向下铰接，让您的手在被机翼支撑的同时展开。\n当它该走的时候，只要把机翼折叠到月球着陆器下面就行了。它会磁性地卡入它的堆放位置。\n月球着陆器两边各有三个状态LED和一个用于音频输出的蜂鸣器。在您工作时获得视觉和听觉反馈，或者不获取(您选择)。\n强大的ARM处理器内置在月球着陆器中，无需汗水即可驱动流畅的LED动画和其他要求苛刻的固件功能。\n月球着陆器配有一根可拆卸的USBC型电缆，盒子里还有一个C-to-A加密狗。\n在月球着陆器上运行的功能强大的固件被称为QMK，它是开源的，可以在GitHub上获得。\n虽然您可以使用我们的配置器快速组合布局，但完全访问固件源代码意味着您可以想挖多深就挖多深。\n你不必编写代码来定制月球着陆器。羚羊是免费的，简单的，强大的。点击鼠标即可实现终极键盘布局。\n你不喜欢什么东西在哪里吗？动起来。所有的键都可以重新映射和重新分配，大多数人都会反复检查他们的布局，直到他们恰到好处为止。\n月球登陆器可以模仿老鼠。点击，点击，指向，点击。你决定鼠标键在哪里。\n为行业标准软件中的那些引起RSI的键组合创建专用键。Ctrl+Shift+Alt+W突然只需按一次键。\n轻触您的Z键，它会按预期发送字母Z。按住它，它就会变成Alt。\n这就是双功能按键的强大之处。当被点击时，他们会发送一个字符。按住时，它们充当修饰符。Alt、Ctrl和朋友从未像现在这样容易联系到。\n使用您的Shift键可获得更多信息。按住它，它就起到了Shift的作用。点击它自己，它会发送括号-左移的左括号，右移位的关闭括号。\nHyper是Ctrl+Shift+Alt+Win/Cmd，而Meh是Ctrl+Shift+Alt。您机器上任何正常的应用程序都不会使用这些快捷方式，这意味着您可以获得免费的系统范围的快捷方式。\n将宏动态录制到两个插槽中的一个插槽中，然后通过击键播放它们。它们是短暂的，当键盘断电时会被就地移除。", "note_en": "You&#39;ll never have to hunt for these. Use them for things you do several times a day and that usually take multiple keypresses.\n Switch your input locale or launch your password manager with a single tap of your index finger.\n  We designed these three easy-to-reach keys exclusively for the Moonlander, with a vertical profile and a dedicated backlight slot on each key.\n It automatically angles when you tent and tilt the keyboard, so so it&#39;ll always be where you expect it.\n No matter what size hands you have, the Moonlander&#39;s Thumb and Wing modules can be adjusted to accommodate you perfectly.\n  The thumb module articulates down, letting your hand spread out while being supported by the Wing.\n When it&#39;s time to go, just fold the Wing under the Moonlander. It&#39;ll magnetically click into its stowed position.\n The Moonlander comes with three status LEDs on each side and a buzzer for audio output. Get visual and audible feedback as you work, or not (you choose).\n  The powerful ARM processor built into the Moonlander drives fluid LED animations and other demanding firmware features without breaking a sweat.\n The Moonlander comes with a detachable USB Type-C cable as well as a C-to-A dongle in the box.\n The powerful firmware that runs on the Moonlander is called  QMK, and it’s open-source, available on GitHub.\n  While you can use our configurator to quickly put together a layout, having complete access to the firmware source code means you can dig as deep as you’d like.\n You don&#39;t have to code to customize the Moonlander. Oryx is free, simple, and powerful. Point-and-click your way to the ultimate keyboard layout.\n  Don&#39;t like where something is? Move it. All keys can be remapped and reassigned, and most people iterate over their layouts until they&#39;re  just right.\n The Moonlander can emulate a mouse. Tap, tap, point, click. You decide where the mouse keys are.\n Create dedicated keys for those   RSI-inducing key combinations found in industry-standard software.  Ctrl+ Shift+ Alt+ W suddenly takes just a single keystroke.\n Tap your  Z key, and it sends the letter Z as expected. Press and hold it down, and it becomes Alt.\n  That’s the power of dual-function keys.  When tapped, they send a character. When held, they act as a modifier.  Alt,  Ctrl, and friends have never been easier to reach.\n Use your  Shift key for more. Press and hold it, and it acts as Shift. Tap it on its own, and it sends parentheses — open parens on the  Left Shift, close parens on the  Right Shift.\n Hyper is  Ctrl+ Shift+ Alt+ Win/Cmd, while Meh is  Ctrl+ Shift+ Alt. No sane application on your machine uses these, which means you get free system-wide shortcuts.\n Record macros on the fly into one of two slots, then play them back with a keystroke. They&#39;re ephemeral and local — removed when the keyboard loses power.", "posttime": "2020-07-31 00:32:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "键盘,月球,moonlander", "title": "ZSA月球着陆器：下一代人体工学键盘", "title_en": "ZSA Moonlander: A next-generation ergonomic keyboard", "transed": 1, "url": "https://zsa.io/moonlander", "via": "", "real_tags": ["键盘", "月球"]}, {"category": "", "categoryclass": "", "imagename": "4c9a391d6fb00d0dc8fcefc8cbc3caa8.jpg", "infoid": 1015209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2000年她在斯坦福任职期间，科勒就致力于将机器学习技术应用于生物学。但是这个概念并不是今天家喻户晓的词；相比之下，我们在几乎每个领域依赖的ML技术当时都相当原始，但对许多有远见的人来说，显然是一个前景广阔的工具。\n科勒于2012年离开，与安德鲁·吴(Andrew Ng)一起创立了最初的MOOC平台Coursera，暂时离开了计算生物学的世界。然而，四年后，她离开Coursera，负责谷歌健康研发部门Calico的计算工作。她在这里的工作显然激发了她在2018年走自己的路，并在GV和其他人的支持下成立了Insitro，金额高达1亿美元。\n开发新药的成本可能高达数十亿美元，这使得制药公司在受治疗疾病影响的人口不够多的情况下追求这些药物是不切实际的。药物开发的成本必须降低，科勒和其他人一起认为数据是关键。\n这些制药公司已经从候选药物的人体测试和其他过程中积累了巨大的数据库，但一直无法有效地利用这些数据库。Insitro的目标是改变这一点。\n科勒在TechCrunch的康妮·洛伊佐斯(Connie Loizos)去年主持的一次演讲中说：“我们现在正处于一个历史时刻，各种技术的融合几乎同时出现，使得生物学中能够产生真正庞大、有趣和与疾病相关的数据集。”\n“同时，我们在机器学习方面看到了…。能够理解这些数据并提出新见解的技术，有望治愈疾病。我们从事的业务实际上是为训练机器学习模型…而构建数据。我们认为这是一个小小的水晶球，可以让你避免做复杂甚至不可能的实验。“。\n由此产生的“体外”(即在实验室)和“在硅胶”(在计算机中)技术的组合被他们称为“内建”--不是很好的拉丁语，但可能是这一领域的新主导范例。\n随着一系列合作和研究的进行，以及就在今年5月刚刚筹集了惊人的1.43亿美元的B系列资金，Insitro正在变得强大，毫无疑问，Koller将在我们的全在线Disrupt SF 2020上对此有很多话要说。\n我们希望您能在9月14-18日加入我们的Disrupt Online。只需245美元，即可凭您的Digital Pro Pass获得前排座位，或使用数字创业小巷展商套餐。今天价格上涨，所以今天就抢夺门票吧！", "note_en": "Koller was working on applying machine learning techniques to biology as early as 2000 during her tenure at Stanford. But the concept was hardly the household word it is today; The ML techniques we’ve come to rely on in practically every domain were then quite primitive by comparison, yet to many a forward-thinking mind clearly a tool with immense promise.\n Leaving in 2012 to join Andrew Ng in founding one of the original MOOC platforms, Coursera, Koller temporarily left behind the world of computational biology. Four years later, however, she left Coursera to head up computing efforts at Google’s health R&amp;D arm, Calico. Her work here clearly inspired to go her own way in 2018 and — with the blessing of GV and others to the tune of $100M —  found Insitro.\n  The cost of developing new drugs can reach into the billions, making it impractical for pharmaceutical companies to pursue them in cases where the population affected by the treated condition is not large enough. The cost of drug development must drop, and Koller joined others in believing that data was the key.\n These pharmaceutical companies have amassed enormous databases from human testing of drug candidates and other processes, but have been unable to effectively leverage them.  Insitro   aims to change that.\n “We’re now at a moment in history where a confluence of technologies emerged all at around the same time to allow really large and interesting and disease-relevant data sets to be produced in biology,”  said Koller at a talk hosted by TechCrunch’s Connie Loizos last year.\n  “In parallel, we see on the machine learning side… technologies that are able to make sense of that data and come up with novel insights that can hopefully cure disease. We’re in the business of actually building data for the sole purpose of training machine learning models… what we think of as little crystal balls that would allow you to avoid doing experiments that are complex or even impossible.”\n The resulting combination of “in vitro” (i.e. in the lab) and “in silico” (in computer) techniques they call insitro — not good latin, but nevertheless perhaps the new reigning paradigm in this field.\n With a number of partnerships and studies ongoing and a staggering $143M Series B raised just this May, Insitro is going strong and Koller will no doubt have a lot to say about it at our all-online Disrupt SF 2020.\n We hope you can join us at  Disrupt online this September 14-18. Get a front-row seat with your  Digital Pro Pass for just $245 or with a  Digital Startup Alley Exhibitor Package. Prices increase today, so  grab your tickets today!", "posttime": "2020-07-31 00:09:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,insitro,技术", "title": "\nCoursera和Insitro创始人达芙妮·科勒(Daphne Koller)将颠覆2020年", "title_en": "\n\t\t\t\tCoursera and Insitro founder Daphne Koller is coming to Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/coursera-and-insitro-founder-daphne-koller-is-coming-to-disrupt-2020/", "via": "", "real_tags": ["2020", "insitro", "技术"]}, {"category": "", "categoryclass": "", "imagename": "de2b4cde63ac23e8367c675e330655a0.jpg", "infoid": 1015208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼尔斯·马蒂森之前在苹果工作，现在是智能家居科技公司Minut的首席执行官和联合创始人。\n然而，如果你目前依赖于设备销售，改变整个商业模式的前景可能看起来令人望而生畏。\n在Minut，我们正在建造智能家居监控器(隐私安全的噪音、运动和温度监控)，最近尽管缺乏这一过程的资源，但我们还是进行了过渡。以下是我们学到的七个教训：\n与软件相比，硬件有一个优势：客户知道您的产品是有成本的。现在，这使得硬件初创公司可以在第一次迭代中产生收入，但随着公司的发展和需要创新，这是不可持续的：软件和用户体验需要不断改进和出色的支持，就像纯软件初创公司一样。\n这就是为什么我们看到大多数硬件初创公司最终都会推出订阅模式，并限制免费提供的产品。即使是老牌公司 - 也认为，斯特拉瓦或Wink - 在运营多年后，往往最终不得不从根本上限制免费功能。\n经验丰富的创始人和金融市场青睐订阅模式和经常性收入。对于除了销售之外还受益于服务收入的公司来说，市场估值倍数通常要高得多。", "note_en": "Formerly at Apple,  Nils Mattisson is now CEO and co-founder of smart home tech company  Minut.\n  Yet, if you currently rely on device sales, the prospect of changing your entire business model might seem daunting.\n At  Minut, we are building smart home monitors (privacy-safe noise, motion and temperature monitoring) and recently made the transition despite the lack of resources on the process. Here are the seven lessons we learned:\n   Hardware has one advantage over software: customers understand there is a cost to your product. Now, this allows hardware startups to generate revenue with their first iteration, but it’s unsustainable as the company grows and needs to innovate: the software and user experience need continuous improvement and excellent support, just like in a software-only startup.\n That’s why we see most hardware startups eventually launching a subscription model and limit what’s available for free. Even established companies  —  think  Strava or  Wink  —  often end up having to radically limit free features after years of operations.\n Experienced founders and financial markets favor subscription models and recurring revenue. Market valuation multiples are typically much higher for companies that benefit from service revenue in addition to sales.", "posttime": "2020-07-31 00:08:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "硬件,初创,recurring", "title": "\n硬件初创企业的经常性收入之路", "title_en": "\n\t\t\t\tThe road to recurring revenue for hardware startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/the-road-to-recurring-revenue-for-hardware-startups/", "via": "", "real_tags": ["硬件", "初创", "recurring"]}, {"category": "", "categoryclass": "", "imagename": "2fdae3f10d14d41de07711ebbbd79976.jpg", "infoid": 1015207, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数据显示，与2019年上半年相比，亚马逊收到的传票和搜查令增加了23%，法院命令增加了29%。这包括从亚马逊Echo设备以及Kindle和Fire平板电脑收集的数据。\n与一年前相比，对该公司云服务-亚马逊网络服务(Amazon Web Services)的请求数量也有所上升。\n但目前还不清楚是什么原因导致美国政府对用户数据的需求上升。亚马逊的一位发言人没有回复记者的置评请求。\n但与去年同期相比，该公司的海外请求数量下降了约三分之一。亚马逊拒绝了其收到的177个海外请求中的92%，在10个案例中提交了部分用户数据，在4个案例中提交了所有请求的数据。\n亚马逊还表示，它收到了0至249份国家安全请求，与之前的报告持平。司法部关于披露机密请求的规定只允许公司在数字范围内做出回应。\n亚马逊是最后几家发布透明度报告的大型科技公司之一，尽管来自隐私倡导者的压力越来越大。但与硅谷竞争对手相比，它的报告在细节上仍然要轻得多。\n该公司的Ring智能相机部门尽管因其糟糕的安全做法以及与执法部门的密切关系而受到批评，但尚未公布任何与警方要求用户数据有关的数据。", "note_en": "The figures show that Amazon received 23% more subpoenas and search warrants, and a 29% increase in court orders compared to the first half of 2019. That includes data collected from its Amazon Echo devices and its Kindle and Fire tablets.\n   The number of requests to the company’s cloud services, Amazon Web Services, also went up compared to a year earlier.\n But it’s not clear what caused the rise in U.S. government demands for user data. A spokesperson for Amazon did respond to a request for comment.\n But the company saw the number of overseas requests drop by about one-third compared to the same period a year earlier. Amazon rejected 92% of the 177 overseas requests it received, turning over partial user data in 10 cases and all requested data in four cases.\n Amazon also said it received between 0 and 249 national security requests, flat from previous reports. Justice Department rules on disclosing classified requests only allow companies to respond in numerical ranges.\n Amazon was  one of the last major tech companies to issue a transparency report, despite mounting pressure from privacy advocates. But its report remains  far lighter on details compared to its Silicon Valley rivals.\n The company’s Ring smart camera division, despite facing criticism for its  poor security practices and its  close relationships with law enforcement, has  yet to release any data related to police requests for user data.", "posttime": "2020-07-31 00:08:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,警方,police", "title": "\n亚马逊表示，警方对客户数据的要求有所上升", "title_en": "\n\t\t\t\tAmazon says police demands for customer data have gone up\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/amazon-police-data-demands/", "via": "", "real_tags": ["亚马逊", "amazon", "警方", "police"]}, {"category": "", "categoryclass": "", "imagename": "9b45e7ba72f5b62487a1c58a291e29b2.jpg", "infoid": 1015206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我开始使用Point解决所有令人沮丧和复杂的信用卡问题。信用卡公司和持卡人之间的激励是不一致的，“Point联合创始人兼首席执行官帕特里克·莫罗佐夫斯基告诉我。\n当Mrozowski第一次获得信用卡时，他正在花费一大笔钱来达到一定的消费水平，并解锁注册奖金。月底，他莫名其妙地欠下了信用卡债务。\n“今天的美国运通会是什么样子？”他说要总结一下波恩特的远见。归根结底有两个重要的原则--负责预算，这样你就不会背负债务，以及从你实际接触的品牌那里获得回报。\n许多挑战者银行希望为银行资金不足的人提供简单的银行体验。点没有相同的位置。创建Point帐户更像是加入会员计划。\n当您注册时，您将获得一张具有一定保险级别的借记卡，因为它是万事达卡世界借记卡。您可以参加一些旅行取消保险、租车保险、购买保险等。\n正如创业公司的名字所暗示的那样，你每次购买都会获得积分。Spotify和Netflix等订阅获得5倍积分，食品、杂货快递和拼车获得3倍积分，其他所有服务都获得1倍积分。积分可以兑换成美元-每分价值0.01美元。除此之外，Point还将创建一个Feed，提供折扣、内容、活动等内容。\n由于其溢价定位，Point不是免费的。您必须每月支付6.99美元或每年支付60美元才能加入积分。Point不收取任何国外交易费。\n您可以使用Play将您的Point帐户与另一个银行帐户连接起来。它允许您使用ACH转账为您的帐户充值。在幕后，Point与Radius Bank合作，负责银行基础设施，这是一家FDIC保险的银行。\n该公司本月早些时候宣布，已筹集1050万美元的首轮融资，由Valar Ventures牵头，Y Combinator、Kindred Ventures、Finvure Studio和商业天使也参与其中。", "note_en": "“I started Point as a solution about everything that is frustrating and complicated about credit cards. The incentives between credit card companies and cardholders are misaligned,” Point co-founder and CEO Patrick Mrozowski told me.\n When Mrozowski first got a credit card, he was spending a ton of money to reach a certain level of spending and unlock the sign-up bonus. At the end of the month, he ended up with credit card debt for no valid reason.\n  “What would American Express would look like today?” he says to sum up Point’s vision. It comes down to two important principles — being in charge of your budget so that you don’t end up with debt and unlocking rewards from brands that you actually interact with.\n Many challenger banks want to provide a simple banking experience for the underbanked. Point doesn’t have the same positioning. Creating a Point account is more like joining a membership program.\n When you sign up, you get a debit card with some level of insurance as it’s a Mastercard World Debit card. You can expect some trip cancellation insurance, rental car insurance, purchase insurance, etc.\n As the name of the startup suggests, you earn points with each purchase. You get 5x points on subscriptions, such as Spotify and Netflix, 3x points on food, grocery deliveries and ride sharing, and 1x points on everything else. Points can be redeemed for dollars — each point is worth $0.01. In addition to that, Point is going to create a feed of offers with discounts, content, events and more.\n Due to its premium positioning, Point isn’t free. You have to pay $6.99 per month or $60 per year to join Point. Point doesn’t charge any foreign transaction fees.\n You can connect your Point account with another bank account using Plaid. It lets you top up your account using ACH transfers. Behind the scene, Point works with Radius Bank for the banking infrastructure, an FDIC-insured bank.\n The company announced  earlier this month that it has raised a $10.5 million Series A led by Valar Ventures with Y Combinator, Kindred Ventures, Finventure Studio and business angels also participating.", "posttime": "2020-07-31 00:08:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "希望,provide,point", "title": "\nPoint希望用借记卡提供信用卡奖励", "title_en": "\n\t\t\t\tPoint wants to provide credit card rewards with debit cards\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/point-wants-to-provide-credit-card-rewards-with-debit-cards/", "via": "", "real_tags": ["希望", "provide", "point"]}, {"category": "", "categoryclass": "", "imagename": "3d0405e2fd528c00ef4359ceb02d5a8c.jpeg", "infoid": 1015205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dafny是一种带有程序验证器的编程语言。当您键入程序时，验证器会不断检查您的肩膀并标记任何错误。此GitHub站点包含以下材料：\n有关Dafny语言和工具的文档位于此处。在线和pdf版都有参考手册。(如果需要，可以生产乳胶版本。)。\n您可以在Stack Overflow上询问有关Dafny的问题，也可以在Dafny上参与一般性讨论。\n开始使用Dafny最简单的方法是使用rise4ful，在那里您可以编写和验证Dafny程序，而无需安装任何东西。在rise4ful上，您还可以找到Dafny在线教程。在您自己的机器上使用VS Code安装Dafny也很容易，这比在Web浏览器中给您提供了更好的用户体验。\nDafny类型系统的语言参考，它还描述了每种类型的可用表达式。\n欧几里德(从设计其程序要被验证的语言的思维模式)，\nCoQ和VeriFast(比如包含协同归纳数据类型的能力，以及能够编写归纳和协同归纳证明的能力)。\n为了强制执行一些基本的样式约定，我们采用了预提交。我们重用了它们的默认钩子。当您克隆Dafny时，请按照说明安装Pre-Commit。例如，在OSX上。\n该项目采用了Microsoft开放源代码行为准则。有关更多信息，请参阅行为准则常见问题或联系opencode@microsoft.com提出任何其他问题或意见。\n达夫尼本身是根据麻省理工学院的许可证获得许可的。(有关详细信息，请参阅根目录中的LICENSE.txt。)。子目录Third_party包含第三方材料；有关详细信息，请参阅NOTICES.txt。", "note_en": "Dafny is a programming language with a program verifier. As you type in your program, the verifier constantly looks over your shoulders and flags any errors. This github site contains these materials:\n  Documentation about the dafny language and tools is located here.A reference manual is available both  online and as  pdf. (A LaTeX version can be produced if needed.)\n  You can ask questions about Dafny on  Stack Overflow or participate in general discussion on Dafny&#39;s   .\n  The easiest way to get started with Dafny is to use  rise4fun, where you can write and verify Dafny programs without having install anything. On  rise4fun, you will also find the online Dafny tutorial.It is also easy to  install Dafny on your own machine in VS Code, which gives you a much better user experience than in the web browser.\n     Language reference for the  Dafny type system, which also describes available expressions for each type\n  Euclid (from the mindset of a designing a language whose programs are to be verified),\n     Coq and VeriFast (like the ability to include co-inductive datatypes and being able to write inductive and co-inductive proofs).\n    To enforce some basic style conventions, we&#39;ve adopted  pre-commit. We&#39;reusing  their default hooks. When you cloneDafny, install pre-commit as per  the instructions.For example, on OSX you do\n      This project has adopted the  Microsoft Open Source Code of Conduct. For more information see the  Code of Conduct FAQ or contact  opencode@microsoft.com with any additional questions or comments.\n  Dafny itself is licensed under the MIT license. (See LICENSE.txt in the root directory for details.) The subdirectory  third_party contains third party material; see NOTICES.txt for more details.", "posttime": "2020-07-31 00:05:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,支持,verification,dafny", "title": "Dafny：支持验证的编程语言", "title_en": "Dafny: Verification-Aware Programming Language", "transed": 1, "url": "https://github.com/dafny-lang/dafny", "via": "", "real_tags": ["编程", "支持", "dafny"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "问题描述：在全新的RHEL 8.2最小安装上应用RHSA-2020：3216 grub2安全更新和RHSA-2020：3218内核安全和错误修复更新会导致系统无法启动。如何重现：一致要重现的步骤：1.在以EFI模式运行的系统上，从2020年7月29日下载的二进制DVD iso安装RHEL 8.2&34；最小版本。2.在以EFI模式运行的系统上安装RHSA-2020：3216 grub2安全更新和RHSA-2020：3218内核安全和错误修复更新。应用截止到2020年7月29日的最新更新&#34；yum update&#34；3.重新启动系统实际结果：开机自检后系统挂起，GRUB菜单从未加载预期结果：系统应显示内核版本选择菜单，然后引导至RHEL附加信息：可在RHEL 8.2的多个连续全新安装和一个现有RHEL 8.2系统上重现。\n您可以通过在BIOS中禁用安全引导来解决此问题。不太理想。当然可以，但是如果你看不到GRUB..。听起来好像安全引导链上出了什么问题。\n我在故障排除模式下使用安装ISO引导我的系统，将其chroot到/mnt/sysimage，使用grub2-mkconfig重新生成grub.cfg，然后执行grub2-install.现在我可以通过GRUB，但在切换根目录时遇到了紧急shell故障。\n(回复评论#6中的Sandro Bonazzola)&gt；我使用处于疑难解答模式的安装ISO引导我的系统，chroot&gt；到/mnt/sysimage，使用grub2-mkconfig重新生成grub.cfg并执行&gt；grub2-install.&gt；现在我可以跳过GRUB，但在紧急shell失败的切换&&gt;根上遇到了问题。通过实际将grubenv文件复制到/boot解决了这个问题。\n您好，如果您是Red Hat的客户，请务必打开Red Hat支持的支持案例。这将允许我们的支持工程师收集调试数据，这些数据可能有助于了解在这些个别情况下发生的情况。谢谢你，克里夫。\n另请参阅RHEL7上的BZ 1862045。在禁用了安全引导的HPE硬件上运行。解决方案是将GRUB2/shim/mokutil降级。\n我也遇到了这个问题，并通过以下方法解决了问题：1)引导到hel-8(centos-8)故障排除模式2)chroot到/mnt/sysimage3)设置网络4)yum降级shim-x64 grub2\\*5)重新引导将引导模式切换到bios中的遗留模式无济于事。\n(回复Jarola v Suchanek的备注#15)&gt；我也遇到了这个问题，并通过&gt；&gt；1)引导至rhl-8(centos-8)故障排除模式&gt；2)已Chroot引导至/mnt/sysimage&gt；3)设置网络&gt；4)yum降级shim-x64 grub2\\*&gt；5)重新引导&gt；将引导模式切换到旧版。您能试着逐个降低它们的等级，以确认是哪个软件包导致了这个问题吗？因为如果我理解正确的话，当安全引导被禁用时问题就会发生，这应该是可能的。\n解决方案告诉我保护百胜不升级我从RHEL8.2买了新笔记本电脑没有百胜升级系统。但是我可能需要运行‘yum update`来安装一些依赖项这个保护yum不升级的解决方案对我来说足够了吗？通过在/etc/yum.confRawexclude=grub2*shim*mokutil中添加以下条目来保护yum不升级软件包。\n问题存在于grub2-efi-x64中，特别是grubx64.efi中。除了使用前一个RPM中的grubx64.efi之外，您可以拥有所有其他最新内容，并且系统可以再次引导(当然，假设SecureBoot被关闭)。\n(回复评论#21中的Christof Efkemann)&gt；问题存在于grub2-efi-x64中，特别是grubx64.efi中。您可以&gt；拥有最新的其他所有内容，但使用上一个RPM中的grubx64.efi，&gt；系统可以重新启动(当然，假设关闭了SecureBoot)。因此，我已经得到了明确的数据-哪个版本是您的上一个RPM？(当然，假设关闭了SecureBoot)。我已经得到了明确的数据-哪个版本是您的上一个RPM？(当然，假设您关闭了SecureBoot)。我已经得到了明确的数据-哪个版本是您的上一个RPM？\n(回复彼得·琼斯的评论#23)&gt；只是为了让我有明确的数据-哪个版本是您以前的RPM？之前安装的RPM是grub2-efi-x64-1：2.02-81.el8.x86_64。\n另一个注意事项：正如我所说的，我们可以使用2.02-81.el8.x86_64RPM中的grubx64.efi引导新内核(4.18.0-193.14.2.el8_2.x86_64)。但是，这似乎只有在完全绕过填充程序的情况下才有效。例如：UEFI-&gt；shim-&gt；grubx64.efi(2.02-87)-&gt；*CRASH*UEFI。*CRASH*UEFI-&gt；grubx64.efi(2.02-87)-&gt；*Crash*UEFI-&gt；grubx64.efi(2.02-81)-&gt；kernel-&gt；*成功*。\n(回复评论#28中的Christof Efkemann)&gt；另一个观察：&gt；如我所说，我们能够使用来自&gt；2.02-81.el8.x86_64 rpm的grubx64.efi引导新内核&gt；(4.18.0-193.14.2.el8_2.x86_64)。&gt；然而，这似乎只有在完全绕过填补程序时才有效。&gt；&gt；即。Grubx64.efi(2.02-87)-&gt；*Crash*&gt；UEFI-&gt；填隙-&gt；grubx64.efi(2.02-81)-&gt；*Crash*&gt；UEFI-&gt；grubx64.efi(2.02-87)-&gt；*Crash*&gt；UEFI-&gt；grubx64.efi(2.02-。如果您降级了填充包，会发生什么情况？\n注意：您需要先登录，然后才能对此错误进行评论或更改。", "note_en": "Description of problem:Applying the RHSA-2020:3216 grub2 security update and the RHSA-2020:3218 kernel security and bug fix update on a fresh &#34;minimal&#34; installation of RHEL 8.2 renders the system unbootable.How reproducible:ConsistentlySteps to Reproduce:1. Install RHEL 8.2 &#34;minimal&#34; version from Binary DVD iso downloaded on 7/29/2020 on system running in EFI mode2. Apply current updates as of 7/29/2020 with &#34;yum update&#34;3. Reboot systemActual results:System hangs after POST and the grub menu never loadsExpected results:System should display kernel version selection menu and then boot to RHELAdditional info:Reproducible on several consecutive clean installs of RHEL 8.2 and on one existing RHEL 8.2 system.\n    You may be able to work around this by disabling secure boot in the BIOS. Not ideal.. for sure but if you can&#39;t see grub.. sounds like something is up in the secure boot chain.\n  I booted my system with the installation ISO in troubleshoot mode, chrooted to /mnt/sysimage, regenerated the grub.cfg with grub2-mkconfig and executed grub2-install.Now I can go past grub but got stuck to emergency shell failing swtching root.\n  (In reply to Sandro Bonazzola from  comment #6) &gt; I booted my system with the installation ISO in troubleshoot mode, chrooted&gt; to /mnt/sysimage, regenerated the grub.cfg with grub2-mkconfig and executed&gt; grub2-install.&gt; Now I can go past grub but got stuck to emergency shell failing swtching&gt; root.solved this by actually copying the grubenv file to /boot/grub2 instead of relying on the symlink to efi.\n  Hi, If you are Red Hat customers, please do open a support case with Red Hat Support. This will allow our support engineers to gather debugging data that may help to understand what is happening in these individual situations. Thanks,Cliff\n  See also  BZ 1862045 on RHEL7.Happens on HPE hardware with secure boot disabled.Solution is to downgrade grub2 / shim / mokutil\n    I hit it as well and resolved by1) booting to rhel-8 (centos-8) troubleshooting mode2) chrooted to /mnt/sysimage3) setup networking4) yum downgrade shim-x64 grub2\\*5) rebootSwitching boot mode to legacy in bios does not help.\n  (In reply to Jaroslav Suchanek from  comment #15) &gt; I hit it as well and resolved by&gt; &gt; 1) booting to rhel-8 (centos-8) troubleshooting mode&gt; 2) chrooted to /mnt/sysimage&gt; 3) setup networking&gt; 4) yum downgrade shim-x64 grub2\\*&gt; 5) reboot&gt; &gt; Switching boot mode to legacy in bios does not help.Thanks a lot for the information. Could you please try to downgrade them individuallyto confirm which package is causing the issue? Since if I understood correctly theproblem happens when Secure Boot is disabled, that should be possible.\n  Solution tells to protect yum from upgradingI got new laptop from RHEL8.2 have not yum upgrade system. But I might need to run `yum update` in order to install some dependencieswould this solution of protecting yum from upgrading is enough for me ?Protect yum from upgrading the packages by adding the following entry in /etc/yum.confRawexclude=grub2* shim* mokutil\n  The problem is in grub2-efi-x64, specifically in the grubx64.efi. You can have everything else up-to-date but use grubx64.efi from the previous RPM, and the system can boot again (assuming that SecureBoot is turned off, of course).\n  (In reply to Christof Efkemann from  comment #21) &gt; The problem is in grub2-efi-x64, specifically in the grubx64.efi. You can&gt; have everything else up-to-date but use grubx64.efi from the previous RPM,&gt; and the system can boot again (assuming that SecureBoot is turned off, of&gt; course).Just so I&#39;ve got clear data - which version is &#34;the previous RPM&#34; for you?\n  (In reply to Peter Jones from  comment #23) &gt; Just so I&#39;ve got clear data - which version is &#34;the previous RPM&#34; for you?The previously installed RPM was grub2-efi-x64-1:2.02-81.el8.x86_64\n  One additional observation:Like I said, we were able to boot the new kernel (4.18.0-193.14.2.el8_2.x86_64) with the grubx64.efi from the 2.02-81.el8.x86_64 RPM.However, this seems to work only when bypassing shim altogether.I. e.:UEFI -&gt; shim -&gt; grubx64.efi (2.02-87) -&gt; *crash*UEFI -&gt; shim -&gt; grubx64.efi (2.02-81) -&gt; *crash*UEFI -&gt; grubx64.efi (2.02-87) -&gt; *crash*UEFI -&gt; grubx64.efi (2.02-81) -&gt; kernel -&gt; *success*\n  (In reply to Christof Efkemann from  comment #28) &gt; One additional observation:&gt; Like I said, we were able to boot the new kernel&gt; (4.18.0-193.14.2.el8_2.x86_64) with the grubx64.efi from the&gt; 2.02-81.el8.x86_64 RPM.&gt; However, this seems to work only when bypassing shim altogether.&gt; &gt; I. e.:&gt; UEFI -&gt; shim -&gt; grubx64.efi (2.02-87) -&gt; *crash*&gt; UEFI -&gt; shim -&gt; grubx64.efi (2.02-81) -&gt; *crash*&gt; UEFI -&gt; grubx64.efi (2.02-87) -&gt; *crash*&gt; UEFI -&gt; grubx64.efi (2.02-81) -&gt; kernel -&gt; *success*This is with shim-x64-15-14.el8_2.x86_64 right? What happens if you downgrade the shim package?\n   Note You need to  log in before you can comment on or make changes to this bug.", "posttime": "2020-07-31 00:04:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安全更新,security,gt", "title": "Grub2安全更新导致系统无法引导", "title_en": "Grub2 security update renders system unbootable", "transed": 1, "url": "https://bugzilla.redhat.com/show_bug.cgi?id=1861977", "via": "", "real_tags": ["安全更新", "security", "gt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "712 Brandon Smith异步函数getPeople(){const Members=等待获取(&#34；/Members&#34；)；const非成员=等待获取(&#34；/Non-Members&#34；)；返回成员。Concat(非成员)；}。\n花点时间看一下。类似这样的代码可能存在于更多的JavaScript代码库中。有时，它就在更了解情况的人的眼皮底下，包括我自己。事实上，我在一个案例中犯了这个错误，这就是促使我最初写这篇文章的原因。\n你现在看到了吗？实际上，甚至编写这个版本都很棘手，因为如果没有异步/等待，就很难犯这个错误。\n我们采用了两个独立的异步任务，并将它们放入一个序列中。此功能所需的时间是所需时间的两倍。\n异步函数getPeople(){const Members=FETCH(&#34；/Members&#34；)；Const Non Members=Fetch(&#34；/Non-Members&#34；)；Const Both=等待承诺。All([Members，NonMembers])；返回两者[0]。Concat(两者均为[1])；}。\n函数getPeople(){const Members=Fetch(&#34；/Members&#34；)；const Non Members=Fetch(&#34；/Non-Members&#34；)；Return Promise。全部([成员，非成员])。则(Both=&gt；Both[0]。CONCAT(两者[1]))；}。\n请注意，当写成简单的承诺时，糟糕的版本要复杂得多。Promises API鼓励并行性，当您需要按顺序放置东西时，它会变得笨拙。异步/等待在很大程度上是作为一种解决方案出现的，用于当您确实需要按顺序发生事情时，比如当您需要将一个请求的输出作为参数提供给下一个请求时。而且可以说，这至少让这两个案件都变得更干净了。但重要的是，它颠倒了它们，使顺序流比平行流更容易。\n即使您理解语法最终要转换成的承诺代码，也很容易落入这种陷阱。如果你还不了解承诺以及异步/等待到底在做什么，那就更不用说了。\n我不会说异步/等待是不好的(或者，也许被认为是有害的)。特别是在那些没有合理API(如承诺)的语言中，或者在闭包方面有其他限制使它们不那么容易使用的语言中，异步/等待可以使代码总体上更具可读性。\n但它们确实伴随着一个相当大的陷阱。该语法的优点和缺点都在于，它允许我们接受异步的事物，并假装它们再次是连续的。我们的大脑更容易对顺序过程进行推理。\n但我认为，使用Async/AWait编写内容的最简单、最清晰的方法往往是错误的，这是一种遗憾。并以一种可能永远不会被注意到的微妙方式出错，因为它只影响性能，而不影响正确性。\n我是语言和图书馆的忠实拥护者，因为语言和图书馆让做通常正确的事情变得容易，做通常错误的事情变得困难。这就是说，对于异步/等待如何能够以不同的方式实现，我没有一个建议。我只是后悔事情变成这样。\n但至少，我认为随着越来越多的语言采用这种语法，人们意识到它很容易被误用，这一点变得越来越重要。\n如果您不确定代码是如何运行的，请查看瀑布图，看看是否有机会使应用程序更快。\n您还可以使用这个经验法则：如果等待的函数调用没有使用另一个等待的函数调用的结果(或从结果派生的结果)，则应该使用Promise.all()使它们同时发生。", "note_en": "712  Brandon Smith    async  function  getPeople ( )  {  const members  =  await  fetch ( &#34;/members&#34; ) ;  const nonMembers  =  await  fetch ( &#34;/non-members&#34; ) ;  return members . concat (nonMembers ) ; }\n  Take a minute to look. Code just like this probably exists in more JavaScript codebases than not. Sometimes it flies right under the nose of people who know better, myself included. In fact a case where I made this mistake was what prompted me to write this post in the first place.\n      Do you see it now? It was actually tricky to even write this version, because this mistake is so hard to make  without async/await.\n    We&#39;ve taken two independent, asynchronous tasks, and put them into a  sequence. This function takes twice as long as it needs to.\n    async  function  getPeople ( )  {  const members  =  fetch ( &#34;/members&#34; ) ;  const nonMembers  =  fetch ( &#34;/non-members&#34; ) ;  const both  =  await Promise . all ( [ members , nonMembers  ] ) ;  return both [ 0 ] . concat (both [ 1 ] ) ; }\n    function  getPeople ( )  {  const members  =  fetch ( &#34;/members&#34; ) ;  const nonMembers  =  fetch ( &#34;/non-members&#34; ) ;  return Promise . all ( [ members , nonMembers  ] )  . then ( both  =&gt; both [ 0 ] . concat (both [ 1 ] ) ) ; }\n      Take note how much more complicated the &#34;bad&#34; version was when written as plain promises. The Promises API encourages parallelism, and gets clunky when you need to put things in sequence. Async/await largely arose as a solution for when you  do need things to happen in sequence, like when you need to feed the output of one request into the next as a parameter. And it does arguably make both cases at least a little cleaner. But importantly, it inverts them, making  thesequential flow easier than the parallel flow.\n  Even if you understand the Promises code that the syntax ends up translating to, it&#39;s easy to fall into this trap. If you  don&#39;t already understand Promises and what exactly async/await is really doing, even more so.\n  I wouldn&#39;t go so far as to say that async/await are &#34;bad&#34; (or perhaps,  &#34;considered harmful&#34;). Especially in languages that don&#39;t have a reasonable API like Promises, or do have other restrictions around closures that make them less trivial to use, async/await can make code much more readable overall.\n  But they do come with a pretty large pitfall. Both the strength and the weakness of the syntax is that it allows us to take asynchronous things and pretend they&#39;re sequential again. Our brains have an easier time reasoning about sequential processes.\n  But I think it&#39;s a shame that the easiest and clearest way to write something with async/await is, more often than not, wrong. And wrong in a subtle way that may never be noticed, because it only affects performance, not correctness.\n  I&#39;m a big believer in languages and libraries that make it easy to do the thing that&#39;s usually right, and hard to do the thing that&#39;s usually wrong. That said, I don&#39;t have a proposal for how async/await could have been done differently. I just regret the way things turned out.\n  But at the very least, I think it&#39;s increasingly important - as more and more languages adopt this syntax - that people are aware of how it can easily be misused.\n    If you&#39;re ever not sure how your code is behaving, look at the waterfall graph and see if you might have an easy opportunity to make your application much faster.\n  You can also use this rule of thumb: If an  awaited function call doesn&#39;t use the result from another  awaited function call (or something derived from the result), you should use  Promise.all() to make them happen at the same time.", "posttime": "2020-07-31 00:04:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小心,async,代码", "title": "小心异步/等待", "title_en": "Beware of Async/Await", "transed": 1, "url": "https://www.brandonsmith.ninja/blog/async-await", "via": "", "real_tags": ["小心", "async", "代码"]}, {"category": "", "categoryclass": "", "imagename": "f2f8a076872fec296c288f9d1bc0980d.png", "infoid": 1015202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "圣地亚哥·奥尔蒂斯发明数学/数据/科学项目", "note_en": "Santiago Ortiz invents math/data/science projects", "posttime": "2020-07-31 00:04:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维恩图,venn,数学", "title": "七套维恩图", "title_en": "Seven Sets Venn Diagram", "transed": 1, "url": "http://moebio.com/research/sevensets/", "via": "", "real_tags": ["维恩图", "venn", "数学"]}]