[{"category": "", "categoryclass": "", "imagename": "1a41fb9040212501a19e576754010d1d.jpg", "infoid": 1017184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软宣布将发布自己的开源服务Mesh--名为Open Service Mesh(OSM)平台--并尽快将其转移到云原生计算基金会(CNCF)。\n这让这家总部位于雷德蒙德的公司有别于其云竞争对手谷歌(Google)，后者最近宣布，它自己的Istio服务网将不再是供应商中立的CNCF的一部分，而是将隶属于谷歌自己的Open Usage Commons基金会。\n服务网格已迅速成为现代云本机计算堆栈的重要组成部分，因为它本质上实现了当今基于微服务的架构的不同部分之间的通信、监控和负载平衡。\n这与流行的容器编排服务Kubernetes的粒度级别不同。当与Kubernetes协同运行时，服务网状网可实现更深层次的安全策略和加密实施，以及自动负载平衡和断路功能。\n除了关于开源软件和治理问题的哲学辩论之外，微软希望让自己脱颖而出的地方是提供尽可能多的简单性。\n微软Azure Compute产品管理总监兼CNCF董事会成员Gabe Monroy对TechCrunch表示：“我们的客户一直在告诉我们，当今市场上出现的解决方案非常复杂，Istio就是一个很好的例子，”微软Azure Compute产品管理总监兼CNCF董事会成员加布·蒙罗伊(Gabe Monroy)告诉TechCrunch。\n“这不只是我一个人说的。我们在[Azure Kubernetes Service]支持队列中看到了试图使用这些东西的客户的数据--他们就在这里苦苦挣扎。他补充说，这只是一种难以使用的技术--难以规模化建造的技术。\n到目前为止，微软一直将自己定位为服务网状网之战的中立方，为Azure客户提供支持各种选项的服务网状网界面，包括Istio、Linkerd和Consul等流行的开源选项，以及亚马逊网络服务公司自己的App Mesh。\n现在，根据微软的说法，OSM的目的是尽可能地成为一种轻量级的选择。它在Kubernetes上运行，数据平面元素基于流行的特使代理，所有这些都配置了服务网格接口API。供应商说，长话短说？OSM将特使代理作为侧车容器注入到应用程序的每个实例旁边。\n通过这次发布，微软不仅将自己与过去几个月来在开放源码软件社区中肆虐的开放治理方面的辩论保持一致，而且还在寻求解决客户的痛点。\n然而，并不是每个人都认为这是一次扣篮，Linkerd的联合创始人奥利弗·古尔德(Oliver Gould)在Twitter上强调了Linkerd和OSM用户体验在发布后的相似之处。", "note_en": "Microsoft has announced that it will release its own open source service mesh — called  Open Service Mesh (OSM) — and transfer it to the Cloud Native Computing Foundation (CNCF) as soon as possible.\n This sets the Redmond-based company apart from its cloud rival Google, which recently announced that its own  Istio service mesh will no longer be part of the vendor-neutral CNCF and will instead sit under  Google&#39;s own Open Usage Commons foundation.\n   The  service mesh has quickly become a vital part of the modern cloud native computing stack, as it essentially enables communication, monitoring, and load balancing between disparate parts of today’s microservices-based architecture.\n This differs from the popular container orchestration service Kubernetes in its level of granularity. When run in tandem with Kubernetes, a service mesh enables deeper security policy and encryption enforcement and automated load balancing and circuit breaking functionality.\n Where Microsoft is looking to set itself apart — aside from the philosophical debate over open source software and governance issues — is in offering as much simplicity as possible.\n  &#34;What our customers have been telling us is that solutions that are out there today, Istio being a good example, are extremely complex,” Microsoft director of product management for Azure Compute and CNCF board member Gabe Monroy  told TechCrunch.\n  “It’s not just me saying this. We see the data in the [Azure Kubernetes Service] support queue of customers who are trying to use this stuff — and they’re struggling right here. This is just hard technology to use — hard technology to build at scale,&#34; he added.\n  Until now Microsoft had set itself out as a neutral party in the service mesh battle, offering Azure customers a Service Mesh Interface that supported various options, including popular open source options such as Istio, Linkerd and Consul, as well as Amazon Web Services&#39; own App Mesh.\n Now, according to Microsoft, OSM is intended to be as lightweight an option as possible. It runs on Kubernetes, and the data plane element is based on the popular Envoy proxy, all configured with service mesh interface APIs. Long story short? &#34;OSM injects an Envoy proxy as a sidecar container next to each instance of an application,&#34; the  vendor states.\n With this launch Microsoft is not only aligning itself with the open governance side of the debate which has been raging through the open source software community for the past few months, but is also looking to solve a  customer pain point.\n Not everybody sees it as such a slam dunk however, with Oliver Gould, the cofounder of Linkerd creator Buoyant, taking to Twitter to  highlight similarities between the Linkerd and OSM user experiences in the aftermath of the launch.", "posttime": "2020-08-09 21:41:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,开源,microsoft,谷歌,微软", "title": "对抗谷歌，微软承诺为CNCF提供自己的开源服务网", "title_en": "Countering Google, Microsoft Promises Its Own Open Source Service Mesh for the CNCF", "transed": 1, "url": "https://www.infoworld.com/article/3570417/microsoft-breaks-ranks-with-its-own-service-mesh.html", "via": "", "real_tags": ["google", "开源", "microsoft", "谷歌", "微软"]}, {"category": "", "categoryclass": "", "imagename": "01904a310cbaf4fded7032320000a7f4.png", "infoid": 1017183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公众诉诸法庭程序的权利作为一项法律原则是有目共睹的，但需要不断地加以捍卫。在一定程度上，这是因为私人当事人不断要求由公共资金资助的法院秘密解决他们的纠纷。正如我们和其他人以前写过的那样，这个问题在专利案件中尤其严重，在这些案件中，案件双方的当事人往往同意尽可能多地将诉讼隐藏在人们的视线之外。这剥夺了公众完全有权看到的可能影响其参与权的材料，比如确立(或破坏)专利权人根据他们声称拥有的专利提起诉讼的权利的文件。\n尽管这个问题普遍存在，但当我们看到世界上最爱打官司的联合石油公司(Uniloc)提起的诉讼时，双方同意的保密程度令人震惊。在Uniloc诉苹果案中，重要的、消极的动议文件被归档，整页文本都经过了编辑，其中包括不可能被列为机密的信息，比如案例引用。那些文件是关于什么的？Uniloc是否有权起诉包括苹果在内的任何人侵犯案件中的专利。由于Uniloc是一家多产的专利诉讼当事人-仅2018年就提起了170多起专利侵权诉讼-有关其起诉权的问题对公众产生了强大的影响，包括一系列技术产品的制造商和用户。\n当EFF看到这些法庭记录的封存是多么令人震惊时，我们联系了当事人，告诉他们公众查阅的权利扩大到了大部分(如果不是全部)被封存的文件。当Uniloc明确表示不会修改其密封请求时，我们提交了一项动议，要求进行干预，并解封所有东西。这起案件的法官同意我们的观点，裁定这些密文极其不恰当，并下令将所有东西解封。\nUniloc没有对这一决定提出上诉，而是试图修改其密封请求，并要求法院给予第二次机会。没有这样的运气：法官威廉·阿尔苏普(William Alsup)拒绝了，认为联合利华可以也应该在一审中提出适当的封存请求，而不是试图看看它可以在法庭上逍遥法外多少秘密。他还批准了EFF的许可，如果Uniloc选择挑战上诉决定，EFF可以介入为其辩护；毕竟，案件中的另一方苹果对Uniloc的任何封存请求都没有采取任何立场。当Uniloc提出上诉时，EFF介入，代表公众为这一决定辩护。\n上个月，联邦巡回法院一致通过，以压倒性多数支持阿尔苏普法官的决定。重要的是，它拒绝了Uniloc试图筛选公众访问权的企图，确认“所有文件都可以推定为可访问的，Uniloc有责任提供令人信服的理由，保护特定材料不被公众看到。”它还同意“联合石油公司最初的密封请求严重过度”，而且“特别公然”违反了法院关于密封请求的当地规则。总而言之，阿尔苏普法官完全有自由裁量权，可以完全否认这一点，而不会给予联合利华再次尝试的特权。\n联邦巡回法院认识到，地区法院需要并应该行使其自由裁量权，拒绝不正当的密封请求。该意见尖锐地指出，初审法院法官“肩负着解决复杂法律和事实纠纷的重任”，在批准地区法院的裁决发出的信息之前，“不应被迫花费大量时间努力遏制过度热衷的盖章努力”-“当事人应在一审中提交狭隘的、有充分支持的盖章请求，从而消除司法干预的需要。”\n但是，Alsup法官裁决的一个方面没有得到确认：将一份包含第三方信息的文件与有关Uniloc的信息混为一谈的决定。对于这份文件，联邦巡回法院发现，地区法院没有做出足够的调查结果，无法审查这一决定，并将案件发回地区法院，由其做出“具体裁决”。这份文件列出了获得联合利华某些专利许可的公司及其支付的金额。我们将继续关注，并在必要时进行斗争，以确保公众的访问权得到应有的重视。\n联邦巡回法院的决定是公众的一次胜利，他们已经等了太久才看到法庭记录，他们有很强的合法访问权的推定。对于Uniloc来说，这也是一次失败，在整个诉讼过程中，Uniloc试图避免公众准入的默认规则，但失败了。我们希望这一结果向Uniloc和其他专利诉讼当事人发出一个强烈的信息，即他们对保密的偏好不会超过公众了解我们法庭上发生的事情的权利。", "note_en": "The public’s right of access to court proceedings is well-established as a legal principle, but it needs constant defending. In part, that’s because private parties keep asking publicly-funded courts to resolve their disputes in secret. As  we and  others have written before, this problem is especially great in patent cases, where parties on opposite sides of a case often agree with each other to keep as much of the litigation as possible hidden from view. That deprives the public of material it has every right to see that could affect its rights to engage, like documents establishing (or undermining) a patent owner’s right to bring suit on the basis of a patent which they claim to own.\n Although this problem is pervasive, when we looked at a lawsuit filed by Uniloc—one of the most litigious patent trolls in the world—the amount of secrecy the parties agreed to was shocking. In   Uniloc v. Apple, important, dispositive motion papers were filed with entire pages of text redacted, including information that could not possibly qualify as confidential, like case law citations. And what were those papers about? Whether Uniloc had the right to sue anyone, including Apple, for infringing the patents in the case. Because Uniloc is a prolific patent litigant—filing more than 170 patent infringement lawsuits in 2018 alone—questions about its right to sue have powerful ramifications on the public, including makers and users of a wide array of technology products.\n When EFF saw how egregious the sealing of these court records was, we reached out to the parties and told them the public’s right of access extended to much, if not all, of what had been filed under seal. When it became clear that Uniloc would not modify its sealing requests, we filed a motion to intervene and to unseal everything. The judge in this case agreed with us,  ruling that the redactions were wildly improper and ordered everything unsealed.\n Instead of appealing that decision, Uniloc tried to modify its sealing requests and asked the court for a second chance. No such luck: Judge William Alsup  refused, holding that Uniloc could and should have made a proper sealing request in the first instance, instead of trying to see how much secrecy it could get away with in court. He also granted EFF leave to intervene to defend the decision on appeal if Uniloc chose to challenge it; after all, the other party in the case, Apple, had taken no position on any of Uniloc’s sealing requests. When Uniloc did appeal, EFF  stepped in to defend the decision on the public’s behalf.\n Last month, the Federal Circuit,  in a unanimous decision, overwhelmingly upheld Judge Alsup’s decision. Importantly, it rejected Uniloc’s attempt to winnow the public’s right of access, confirming that “all filings were presumptively accessible, and it was Uniloc’s duty to provide compelling reasons for shielding particular materials from public view.” It also agreed that “Uniloc’s original sealing request was grossly excessive,” and a “particularly flagrant” violation of the court’s local rules regarding sealing requests. In all, Judge Alsup was well within his discretion to deny it in full, without giving Uniloc the privilege of trying again.\n The Federal Circuit recognized that district courts need and should exercise their discretion to deny improper sealing requests. The opinion pointedly notes that trial court judges are “heavily burdened with the task of resolving complex legal and factual disputes,” and “should not be forced to spend large swaths of their time struggling to rein in overzealous efforts to seal,” before approving of the message sent by the district court’s decision—“that litigants should submit narrow, well-supported sealing requests in the first instance, thereby obviating the need for judicial intervention.”\n However, one aspect of Judge Alsup’s decision was not affirmed: the decision to lump a document containing third-party information into the same category as information about Uniloc. For this document, which identifies companies that licensed certain of Uniloc’s patents and the amounts they paid, the Federal Circuit found the district court had not made enough findings for it to review the decision, and remanded the case to the district court to make “particularized determinations.” We will keep watching—and, if necessary, fighting—to make sure the public’s right of access gets the weight it deserves.\n The Federal Circuit’s decision is a victory for the public, which has waited far too long to see court records to which it has a strong presumption of rightful access. It is also a defeat for Uniloc, which tried, but failed, to avoid the default rule of public access throughout these proceedings. We hope this outcome sends a strong message to Uniloc and other patent litigants that their preference for secrecy cannot overcome the public’s right to know what happens in our courts.", "posttime": "2020-08-09 21:39:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "公众,defends,uniloc", "title": "EFF为公众获取专利所有权法庭记录的权利辩护", "title_en": "EFF Defends Public’s Right to Access Court Records About Patent Ownership", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/08/victory-eff-defends-publics-right-access-court-records-about-patent-ownership", "via": "", "real_tags": ["公众", "defends", "uniloc"]}, {"category": "", "categoryclass": "", "imagename": "22c30ed8e06b3e59fb72ab67d46b2d30.png", "infoid": 1017182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "5月初，我需要改变一下平时在YouTube上打的兔子洞的节奏，因为在几个月的隔离期间，我已经拆除了几个这样的兔子洞。我发现Internet Temple几乎就像是找到了一家好的酒吧或音乐场所；我不是通过视频平台的算法来提供内容，而是必须认识某人，获得小费，然后键入完整的URL。\nTemple在我的浏览选项卡上做了一个直截了当的入口，只不过是一个裁剪过的YouTube嵌入和一个没有滚动功能的聊天框。然后事情变得很奇怪。\n我目睹了一场令人惊叹的音乐表演，充满了自动调音(歌曲之间的笑声也是自动调谐的)。这位歌手穿着雪人印花拳击短裤，一件印有抽象人形图像的超大号毛衣，戴着一顶帽子，上面写着WWW DOT COM My Ask。他手里拿着三只绵羊填充玩具跳舞，而他身后的一个绿色屏幕上挤满了观众选择的图像。他们选择了史莱克和Unicode虾表情符号的图片。\n我后来了解到，所有这一切并不像看起来那么愚蠢。相反，Internet Temple的所有者致力于摧毁Web2.0的概念，他们从三个独立的、耐人寻味的项目开始。\n表演者克莱顿·柯林斯(Clayton Collins)和场地创建者托比·奥尔登(Toby Alden)(他们/他们)是边缘人，他们按照过去的互联网精神制作独特的网站。柯林斯有时被称为克莱顿在线(Clayton Online)，她的日常工作是维护管理公交车时刻表的软件。奥尔登是一名全职游戏开发人员，致力于开发一款独立的视频游戏。这对波特兰二人组的课外创作基本上是社交媒体的替代品，而且它们几乎是免费制作的。\n第一个是网庙，以90年代末日本游戏精灵拥挤的背景拼贴为特色。寺庙举办了现场音乐、DJ布景(其中一些通过谷歌Hangout自豪地以糟糕的质量流媒体播放)和诗歌朗诵。这个设计，前面和中心有一个阶段，与Twitch相反。\n奥尔登说，如果你在Twitch上流媒体，你就是在设计上与其他所有人竞争。他们指出，该网站不断推动跳转到其他流或观看广告，部分原因是对推荐算法的依赖日益增加。\n柯林斯和奥尔登并不认同某个特定的运动，但他们意识到，其他像他们这样的项目也在互联网的角落里蓬勃发展，既有小圈子的，也有独狼程序员的。尽管DIY互联网文化从BBS时代就存在了，但它的现代版本与被控出售数据、避税和允许错误信息的主要社交媒体公司形成了鲜明对比-最近一次是在7月29日的国会听证会上。\n奥尔登说，你过去常常上网输入你最喜欢的网站的URL，看看hardcoregaming101.net是否更新了。现在，它主要是五六个网站：YouTube、Facebook、Twitter、Insta、亚马逊等等。\n你甚至不需要说，等等，柯林斯插嘴说。就是这样。就是他们。&#34；\n这座寺庙是在2016年的三天时间里用Node.js编写的。最近，它开始绕过YouTube Live(你可能会从这样的网站上期待的那种流媒体聊天系统)，从柯林斯的SaladBowl平台借用代码，在SaladBowl平台上，他直接从自己的电脑上托管和流式播放视频，以绕过版权罢工。根据柯林斯的说法，这项服务是为了对抗公司将艺术品变成私有财产的运动。他用这项服务向朋友们播放他的个人.MP4视频收藏，但更大的目标是为大众提供DIY流媒体工具。", "note_en": "In early May, I needed a change of pace from my usual YouTube rabbit holes, having gone down a few of those during months of quarantine. My discovery of  Internet Temple almost felt like finding a good bar or music venue; instead of being served content by a video platform’s algorithm, I had to know someone, get a tip, and type an entire URL.\n The Temple made a blunt entrance on my browsing tab with little more than a cropped YouTube embed and a chat box with no scrolling feature. And then it got weird.\n I witnessed a startling musical performance drenched in autotune (the laughs between songs were also autotuned). The singer wore snowman print boxers, an oversized sweater featuring abstract humanoid images, and a hat reading &#34;WWW DOT COM MY ASS.&#34; He danced with three stuffed sheep in his hands, while behind him, a green screen was flooded with imagery chosen by audience members. They had selected images of Shrek and Unicode shrimp emojis.\n All of this, I would come to learn, was not as silly as it appeared. Rather, Internet Temple&#39;s proprietors are invested in decimating the concept of Web 2.0, and they’ve started with three separate, intriguing projects.\n  Performer Clayton Collins and venue creator Toby Alden (they/them) are a fringe breed, making idiosyncratic websites in the spirit of a bygone Internet. Collins, who sometimes goes by &#34;Clayton Online,&#34; has a day job maintaining software that manages bus schedules. Alden is a full-time game developer working on an indie video game. The Portland duo&#39;s extracurricular creations are essentially alternatives to social media, and they&#39;re being made for next to no money.\n  The first of these, Internet Temple, features a crowded background collage of late-&#39;90s Japanese game sprites. The Temple has hosted live music, DJ sets (some proudly streamed with abysmal quality through Google Hangouts), and poetry readings. The design, with one stage front-and-center, is antithetical to Twitch.\n &#34;If you&#39;re streaming on Twitch, you&#39;re competing with everyone else on there by design,&#34; Alden says. They point to the constant nudging by said website to jump to other streams or watch ads, fueled in part by an increasing dependence on the recommendation algorithm.\n  Collins and Alden don&#39;t identify with a particular movement, but they&#39;re aware that other projects like theirs flourish in the Internet&#39;s corners, both by way of small cliques and lone-wolf programmers. Although DIY Internet culture has existed since the days of BBSes, its modern versions stand in contrast to major social media companies accused of selling data, avoiding taxes, and allowing misinformation—most recently by Congress in  a July 29 hearing.\n &#34;You used to go online and type in the URLs of your favorite sites to see if hardcoregaming101.net had updated,&#34; Alden says. &#34;Now it&#39;s mostly five or six sites: YouTube, Facebook, Twitter, Insta, Amazon, and so on.&#34;\n &#34;You don&#39;t even need to say, &#39;And so on,&#39;&#34; Collins interjects. &#34;That&#39;s it. Those are them.&#34;\n  The Temple was written in Node.js over the course of three days in 2016. It&#39;s recently begun sidestepping YouTube Live (the kind of stream-and-chat system you might expect from a site like this) by borrowing code from Collins&#39; platform  Saladbowl, where he hosts and streams videos directly from his computer to bypass copyright strikes. This service is, according to Collins, a fight against the &#34;corporate movement to make art private property.&#34; He uses it to broadcast his personal .MP4 video collection to friends, but the bigger goal is a DIY streaming tool for the masses.", "posttime": "2020-08-09 21:14:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,网站,site,youtube", "title": "DIY网站建设者与羊群堆积的算法馈送进行斗争", "title_en": "DIY site builders battle algorithmic feeds with sheep-filled wackiness", "transed": 1, "url": "https://arstechnica.com/gaming/2020/08/diy-site-builders-battle-algorithmic-feeds-with-sheep-filled-wackiness/", "via": "", "real_tags": ["算法", "网站", "site", "youtube"]}, {"category": "", "categoryclass": "", "imagename": "fa41d77babfb8c01f6b086ab7ffc381f.jpg", "infoid": 1017181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Netflix最近推出的第二季中，雨伞学院(Umbrella Academy)在20世纪60年代初被转移到达拉斯，在那里，哈格里夫斯一家必须再次努力修复他们的家庭纽带，同时避免核灾难-这可能是他们自己造成的世界末日。\n再一次，这部剧需要一段时间才能变得好起来，早期的几集将我们的英雄们分开，并将一些太多的离题带到了肯尼迪遇刺事件和杰克·鲁比(Jack Ruby)的世界。但一旦雨伞学院团聚-特别是在他们有机会与年轻版本的父亲对峙之后-故事就全速前进到了壮观而感人的结局。\n在原创内容播客的最新一集中，我们对这部剧和它令人愉快的音乐数字赞不绝口，甚至在重温最后一集时也有点哽咽。在我们开始评论之前，我们先讨论一下迪士尼将于下个月在迪士尼+上映“花木兰”的消息，加价29.99美元。\n您可以在下面的播放器中收听我们的评论，使用Apple播客订阅，或者在您选择的播客播放器中找到我们。如果你喜欢这个节目，请在苹果上留言让我们知道。您也可以在Twitter上关注我们或直接向我们发送反馈。(或推荐节目和电影供我们评论！)。\n如果你想跳过，下面是这一集的详细情况：0：00 Intro 0：36《花木兰》讨论18：03《雨伞学院》点评40：20《雨伞学院》剧透讨论", "note_en": "In season two, which recently launched on  Netflix,   the Umbrella Academy has been transported to Dallas in the early 1960s, where the Hargreeves must once again try to repair their familial bonds while also averting a nuclear apocalypse — an apocalypse that they themselves may be causing.\n Once again, the show takes a while to get good, with early episodes that keep our heroes apart and take a few too many digressions into the world of the JFK assassination and Jack Ruby. But once the Umbrella Academy is reunited — and especially after they get a chance to confront a younger version their father — the story moves full speed ahead to a spectacular and moving finale.\n  We have plenty of praise for the show and its delightful musical numbers on the latest episode of the Original Content podcast, and even get a little choked up when recapping the final episode. And before we get to our review, we discuss the news that  Disney will be releasing “Mulan” on Disney+ next month, for an additional price of $29.99.\n You can listen to our review in the player below,  subscribe using Apple Podcasts or find us in your podcast player of choice. If you like the show, please let us know by leaving a review on Apple. You can also  follow us on Twitter or  send us feedback directly. (Or suggest shows and movies for us to review!)\n If you’d like to skip ahead, here’s how the episode breaks down: 0:00 Intro 0:36 “Mulan” discussion 18:03 “Umbrella Academy” review 40:20 “Umbrella Academy” spoiler discussion", "posttime": "2020-08-09 21:13:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,内容,content,学院", "title": "\n原创内容播客：《雨伞学院》(The Umbrella Academy)回归混乱但令人愉悦的第二季", "title_en": "\n\t\t\t\tOriginal Content podcast: ‘The Umbrella Academy’ returns for a messy-but-delightful second season\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/09/original-content-podcast-the-umbrella-academy-returns-for-a-messy-but-delightful-second-season/", "via": "", "real_tags": ["播客", "内容", "content", "学院"]}, {"category": "", "categoryclass": "", "imagename": "8e6d00d4a5d7c01c93730768dab3f71a.png", "infoid": 1017180, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL；DR：本文比较了六种静态工具来验证和评分Kubernetes YAML文件的最佳实践和遵从性。\nYAML的挑战之一是很难表达清单文件之间的约束或关系。\n如果您希望检查部署到集群中的所有映像是否都是从受信任的注册表中提取的，该怎么办？\n如何防止没有PodDisruptionBudgets的部署提交到群集？\n而且，由于围绕资源定义的有效性和安全性的保证得到了改进，因此您可以相信生产工作负载遵循最佳实践。\nKubernetes YAML文件的静态检查生态系统可以分为以下几类：\nAPI验证器-此类别中的工具根据Kubernetes API服务器验证给定的YAML清单。\n内置检查器-此类别中的工具捆绑了针对安全性、最佳实践等的自以为是的检查。\n自定义验证器-此类别的工具允许使用几种语言(如Rego和Javascript)编写自定义检查。\n以下清单有几个问题，并且没有遵循最佳实践-您能发现多少个问题？\nApiVersion：app/v1种类：部署元数据：名称：HTTP-ECHO规范：副本：2选择器：MatchLabels：APP：HTTP-ECHO模板：元数据：标签：APP：HTTP-ECHO规范：容器：-名称：HTTP-ECHO图像：hashicorp/http-ECHO参数：[&#34；-text&#34；，&#34；hello-world&#34；]端口：-tainerPort：5678-apiVersion：V1 Kind：服务元数据：名称：HTTP-ECHO规范：端口：-PORT：5678协议：TCP目标端口：5678选择器：APP：HTTP-ECHO。\n您可以找到上面的YAML清单文件base-valid.yaml以及本文中引用的其他清单。\n该清单描述了始终在端口5678上回复Hello World消息的Web应用程序。\n因此，您可以使用API模式来验证给定的YAML输入是否符合该模式。\nKubeval base-valid.yaml pass-base-valid.yaml包含有效部署(http-echo)pass-base-valid.yaml包含有效服务(http-echo)。\nApiVersion：app/v1种类：部署元数据：名称：HTTP-ECHO规范：副本：2模板：元数据：标签：APP：HTTP-ECHO规范：容器：-名称：HTTP-ECHO图像：hashicorp/http-ECHO参数：[&#34；-text&#34；，&#34；hello-world&#34；]端口：-tainerPort：5678-apiVersion：V1 Kind：服务元数据：名称：HTTP-ECHO规范：端口：-PORT：5678协议：TCP目标端口：5678选择器：APP：HTTP-ECHO\nKubeval kubeval-valid.yaml warn-kubeval-valid.yaml包含无效的部署(http-echo)-选择器：需要选择器PASS-kubeval-valid.yaml包含有效的服务(http-echo)#let&#39；s检查返回值ECHO$？1。\n使用APP/v1 API版本的部署必须包括与Pod标签匹配的选择器。\n上述清单不包括选择器和针对报告的清单运行kubeval的错误和非零退出代码。\n您可能想知道，使用上面的清单运行kubectl application-f时会发生什么？\nKubectl Apply-f kubeval-valid.yaml错误：验证&#34；kubeval-valid.yaml&#34；时出错：验证数据时出错：ValidationError(Deployment.spec)：io.k8s.api.apps.v1.DeploymentSpec；中缺少必填字段&#34；选择器&#34；如果选择忽略这些错误，请使用--VALIDATE=FALSE关闭验证。\nApiVersion：app/v1种类：部署元数据：名称：HTTP-ECHO规范：副本：2选择器：MatchLabels：APP：HTTP-ECHO模板：元数据：标签：APP：HTTP-ECHO规范：容器：-名称：HTTP-ECHO图像：hashicorp/http-ECHO参数：[&#34；-text&#34；，&#34；hello-world&#34；]端口：-tainerPort：5678-apiVersion：V1 Kind：服务元数据：名称：HTTP-ECHO规范：端口：-PORT：5678协议：TCP目标端口：5678选择器：APP：HTTP-ECHO。\n像kubeval这样的工具的优势在于，您可以在部署周期的早期捕获此类错误。\n此外，您不需要访问群集即可运行检查-它们可以脱机运行。\n然而，在大多数情况下，您可能希望针对特定的Kubernetes版本运行验证。\n要查看可用于验证的版本，请查看kubeval用于执行验证的版本。\n如果需要脱机运行kubeval，可以下载模式，然后使用--schema-location标志使用本地目录。\n除了单独的YAML文件之外，您还可以对目录和标准输入运行kubeval。\n您还应该知道Kubeval可以轻松地与您的持续集成管道集成。\n如果您希望在将清单提交到群集之前包括检查，您将很高兴知道kubeval支持三种输出格式：\n您还可以使用其中一种格式进一步解析输出，以创建结果的自定义摘要。\nKubeval的一个限制是目前不能根据自定义资源定义(CRD)进行验证。\nKubeval是检查和验证资源的最佳选择，但请注意，通过测试的资源不能保证符合最佳实践。\n例如，在容器图像中使用最新的标签不被认为是最佳实践。\n但是，Kubeval不会将其报告为错误，并且会在没有警告的情况下验证YAML。\n如果您想要给YAML评分并捕捉违规行为(如最新的标签)，该怎么办？\nKube-Score base-valid.yaml apps/v1/Deployment http-echo[Critical]容器映像标记·http-echo-&gt；建议使用固定标记使用最新标记的映像以避免意外升级[Critical]Pod NetworkPolicy·Pod没有匹配的网络策略创建针对此Pod的网络策略[Critical]Pod Probe·容器缺少可读性Probe A readinessProbe应用于指示服务何时可以接收。如果没有它，Pod将冒着在启动之前接收流量的风险。它还可以在部署期间使用，并且可以在新版本的应用程序出现故障时防止停机。详细信息：https://github.com/zegl/kube-score/blob/master/README_PROBES.md[关键]容器安全上下文·http-ECHO-&gt；容器没有配置安全上下文集securityContext以在更安全的上下文中运行容器。[关键]容器资源·http-echo-&gt；未设置CPU限制建议避免资源DDOS的资源限制。未设置resources.limits.cpu·http-echo-&gt；内存限制建议使用资源限制以避免资源DDOS。不设置resource ces.limits.memory·http-echo-&gt；CPU请求建议使用资源请求，以确保应用程序可以在不崩溃的情况下启动和运行。未设置资源请求。未设置内存请求。建议使用资源请求，以确保应用程序可以在不崩溃的情况下启动和运行。Set resource ces.request.memory[关键]部署有PodDisruptionBudget·找不到匹配的PodDisruptionBudget建议定义PodDisruptionBudget，以避免Kubernetes维护操作期间意外停机，例如清空节点。[警告]部署具有主机PodAntiAffity·部署没有设置主机PodAntiAffity，建议设置阻止在同一节点上计划部署中的多个Pod的podAntiAffity。这提高了在节点变得不可用的情况下的可用性。\n这些都是您应该解决的有效问题，以使您的部署更加健壮和可靠。\nKube-SCORE命令打印一个友好的输出，其中包含所有警告和严重违规，这在开发过程中非常有用。\n如果您计划将其用作持续集成管道的一部分，则可以使用带有标志--output-format ci的更简明的输出，它还会打印级别为OK的检查：\nKube-Score base-valid.yaml--output-format ci[OK]http-echo apps/v1/Deployment[OK]http-echo apps/v1/ployment[Critical]http-echo apps/v1/Deployment：(http-echo)未设置CPU限制[Critical]http-echo apps/v1/Deployment：(http-echo)未设置内存限制[Critical]http-echo apps/v1/Deployment：(http-echo)CPU请求未设置[Critical]http-ECHO APPS/v1/Deployment：(http-echo)CPU请求未设置[Critical]http-echo apps/v1/Deployment：(http-echo)CPU请求未设置[Critical]http-echo apps/v1/Deployment：(HTTP-ECHO)内存请求未设置[关键]http-ECHO APPS/v1/Deployment：(HTTP-ECHO)具有最新标记的映像[OK]http-ECHO应用程序/v1/Deployment[关键]http-ECHO应用程序/v1/Deployment：Pod没有匹配的网络策略[关键]http-ECHO应用程序/v1/Deployment：容器缺少读取可能[关键]http-ECHO应用程序/v1/Deployment：(HTTP-ECHO)容器没有配置安全上下文[关键]http-ECHO应用程序/v1/Deployment：(HTTP-ECHO)容器没有配置安全上下文[关键]http-ECHO应用程序/v1/Deployment：找到[警告]http-echo应用程序/v1/Deployment：部署没有主机podAntiAffinity设置[OK]http-echo v1/Service[OK]http-echo v1/Service。\n与kubeval类似，当关键检查失败时，Kube-Score返回非零退出代码，但您将其配置为即使在出现警告时也失败。\n还有一个内置的检查，可以针对不同的API版本验证资源-类似于kubeval。\n然而，这个信息是硬编码在Kube-Score本身中的，您不能选择不同的Kubernetes版本。\n因此，如果您升级集群，或者您有几个不同的集群运行不同的版本，这可能会被证明是一个严重的限制。\nKube-Score检查是实施最佳实践的优秀工具，但是如果您想要定制一个或添加您自己的规则怎么办？\n如果您想要编写自定义检查以符合您的组织策略，您可以使用以下四个选项之一-config-lint、铜缆、conftest或Polaris。\nConfig-lint是一个设计用于验证用YAML、JSON、Terraform、CSV和Kubernetes清单编写的配置文件的工具。\n这些规则以YAML文件的形式编写，称为规则集，具有以下结构：\nType字段指示您将使用config-lint检查的配置类型-对于Kubernetes清单，它始终是Kubernetes。\n假设您希望检查部署中的映像是否总是从受信任的存储库(如my-company.com/myapp：1.0)提取的。\n-id：my_Deployment_image_tag严重性：失败消息：部署必须使用有效的映像标记资源：部署断言：-Every：key：spec.template.spec.tainers表达式：-key：image op：start-with value：&#34；my-company.com/&#34；\n在上述规则中，检查部署中的每个容器(key：spec.templates.spec.tainers)是否使用可信镜像(即镜像以&#34；my-company.com/&#34；开头)。\n版本：1描述：Kubernetes规范文件规则类型：Kubernetes文件类型：Kubernetes文件：-&#34；*.yaml&#34；规则：-id：Deployment_Image_Repository严重性：失败消息：部署必须使用有效的映像存储库资源：部署断言：-Every：key：spec.template.spec.tainers表达式：-key：image op：start-with value：&#34；my-company.com/&#34；\nConfig-lint-ules check_image_repo.yaml base-valid.yaml[{&#34；AssertionMessage&#34；：&#34；每个表达式都失败：表达式失败：镜像不以my-company.com/&#34；，&#34；类别&#34；：&#34；&#34；，&#34；CreatedAt&#34；：&#34；2020-06-04T01：29：25.。Test-data/base-valid.yaml&#34；，&#34；LineNumber&#34；：0，&#34；ResourceID&#34；：&#34；http-echo&#34；，&#34；ResourceType&#34；：&#34；Deployment&#34；，&#34；RuleID&#34；：&#34；Deployment_Image_pository&#34；，&#34；RuleMessage&#34；：&。，&#34；状态&#34；：&#34；故障&#34；}]。\nApiVersion：app/v1 Kind：Deployment Metadata：Name：HTTP-ECHO SPEC：Replicas：2选择器：matchLabels：app：HTTP-ECHO模板：METADATA：Labels：App：HTTP-ECHO规范：Containers：-Name：HTTP-ECHO image：my-company.com/http-ECHO：1.0 args：[&#34；-text&#34；，&#34；hello-world&#34；]ports：-tainerPort：5678\n对上述清单运行相同的检查，将不会报告任何违规行为：\nConfig-lint是一个很有前途的框架，它允许您使用YAML DSL为Kubernetes YAML清单编写自定义检查。\n相反，测试是用JavaScript编写的，并且Cu提供了一个具有几个基本帮助器的库来帮助读取Kubernetes对象和报告错误。\n让我们写一个检查，以确保部署只能从受信任的存储库(如my-company.com)提取容器映像。\n$$。ForEach(function($){if($.Kind=&#39；Deployment&#39；){$.spec.template.spec.tainers。ForEach(函数(容器){var image=new(容器.image)；if(image.regiation.。LastIndexOf(&#39；my-company.com/&#39；)！=0){错误。Add_error(&#39；no_company_repo&#39；，&#34；Image&#34；+$.adata.name+&#34；不是来自my-company.com repo&#34；，1)}})；\n现在，要对我们的base-valid.yaml清单运行此检查，您可以使用铜质验证命令：\n铜缆验证--in=base-valid.yaml--validator=check_image_tag.js检查no_company_repo失败，严重程度为1，原因是映像http-echo不是来自my-company.com repoValidation失败。\n正如您可以想象的那样，您可以编写更复杂的检查，比如验证Inress清单的域名，或者拒绝任何以特权身份运行的Pod。\nDockerImage函数读取指定的输入文件并创建包含以下属性的对象：\nFindByName函数可帮助从输入文件中查找给定种类和名称的资源。\n默认情况下，它将整个输入YAML文件加载到$$变量中，并使其在脚本中可用(如果您过去使用jQuery，您可能会发现这种模式很熟悉)。\n除了不必学习自定义语言之外，您还可以访问用于编写检查的整个JavaScript语言，如字符串插值、函数等。\n值得注意的是，当前的铜版嵌入了ES5版本的JavaScript引擎，而不是ES6。\n如果Javascript不是您的首选语言，而您更喜欢一种用于查询和描述策略的语言，则您应该查看conftest。\nConftest是一个配置数据测试框架，可用于检查和验证Kubernetes清单。\n与前面的示例一样，您将检查容器是否来自受信任的来源。\n软件包mainden[msg]{input.Kind==&#34；Deployment&#34；image：=input.spec.template.spe.tainers[_].image不是以(image，&#34；my-company.com/&#34；)msg：=sprintf(&#34；image&#39；%v&#39；不是来自my-company.com存储库&#34；，[image])}开头。\nConftest--policy./conftest-checksbase-valid.yaml FAIL-base-valid.yaml-image&#39；hashicorp/http-echo&#39；不是来自my-company.com存储库1个测试，1个通过，0个警告，1个失败。\n上面的rego文件指定了一个拒绝块，当为true时，该块的计算结果为违规。\n当您有多个拒绝块时，conftest会单独检查它们，总体结果是任何块的违规都会导致违规。\n除了默认的输出格式之外，conftest还通过--output标志支持JSON、TAP和表格格式，如果您希望将报告与现有的持续集成管道集成，这是非常棒的。\n为了帮助调试策略，conftest有一个方便的--trace标志，它打印有关conftest如何解析指定的策略文件的跟踪信息。\nConftest策略可以在OCI(Open Container Initiative，开放容器倡议)注册表中作为工件发布和共享。\n命令PUSH和PULL允许发布人工产物并从远程注册表中拉出现有的人工产物。\n让我们看一个使用confltest推送将上述策略发布到本地docker注册表的演示。\n从另一个终端导航到上面创建的conftest-check目录，然后运行以下命令：\n现在，创建一个临时目录并运行conftest Pull命令，该命令会将上面的捆绑包下载到临时目录：\n您将看到临时目录中有一个新的子目录策略，其中包含前面推送的策略文件：\nConfltest--更新127.0.0.1:5000/amitsaha/opa-bundle-example:latest库-VALID.yaml..失败-BASE-VALID.yaml-Image&#39；hashicorp/Http-ECHO&#39；不是来自my-company.com存储库2个测试，1个通过，0个警告，1个失败。\n但是，如果您正在使用或运行容器注册表，那么您可能会走运。\n，这使得使用Confltest从现有的OPA捆绑包运行测试成为可能。\nPolaris可以安装在集群中，也可以作为命令行工具静态分析Kubernetes清单。\n作为命令行工具运行时，它包括几个内置检查，涵盖安全和最佳实践等领域-类似于Kube-SCORE。\n此外，您还可以使用它编写与config-lint、cub和conftest类似的自定义检查。\n换句话说，北极星结合了两个类别中的最好：内置和自定义检查器。\n上面的命令将打印一个JSON格式的字符串，详细说明运行的检查和每个测试的结果。\n{&#34；PolarisOutputVersion&#34；：&#34；1.0&#34；，&#34；AuditTime&#34；：&#34；0001-01-01T00：00：00Z&#34；，&#34；SourceType&#34；：&#34；路径&#34；，&#34；SourceName&#34；：&#34；test-data/base-valid.yaml&#34；，&。Test-data/base-valid.yaml&#34；，&#34；ClusterInfo&#34；：{&#34；版本&#34；：&#34；未知&#34；，&#34；节点&#34；：0，&#34；Pods&#34；：2，&#34；命名空间&#34；：0，&#34；控制器&#34；：2}，&#34；结果&#34；：[/*长列表*/]}。\n与Kube-Score类似，Polaris确定了清单不符合推荐最佳做法的几种情况，其中包括：\n如果您对详细结果不感兴趣，传递标志--格式分数将打印1-100范围内的数字，北极星将其称为分数：\n如果检查Polaris AUDIT命令的退出代码，您会发现它是0。\n要使用非零代码使Polaris审计退出，您可以使用另外两个标志。\nSET-EXIT-CODE-BREST-SCORE标志接受1-100范围内的阈值分数，当分数低于阈值时将退出，退出代码为4。\n这在基线分数为75分的情况下非常有用，并且您希望在分数降低时得到警告。\n当任何危险检查失败时，--set-exit-code-on-anger标志将退出，退出代码为3。\n现在让我们看看如何为Polaris定义自定义检查，以测试部署中的容器映像是否来自受信任的注册表。\n自定义检查以YAML格式定义，并使用JSON Schema描述测试本身。\nCheckImageRepo：成功消息：图像注册表有效失败消息：图像注册表无效类别：图像目标：容器架构：&#39；$schema&#39；：http：//json-schema.org/draft-07/schema type：对象属性：image：type：string pattern：^my-company.com/.+$。\n类别是指其中一个类别-映像、运行状况检查、安全、网络和资源。\nTarget是确定对哪个规范对象应用检查的字符串，应该是Container、Pod或。\n.", "note_en": "TL;DR:  The article compares six static tools to validate and score Kubernetes YAML files for best practices and compliance.\n  One of the challenges with YAML is that it&#39;s rather hard to express constraints or relationships between manifest files.\n What if you wish to check that all images deployed into the cluster are pulled from a trusted registry?\n How can you prevent Deployments that don&#39;t have PodDisruptionBudgets from being submitted to the cluster?\n  And since the guarantee around the validity and safety of the resource definitions is improved, you can trust that production workloads are following best practices.\n The ecosystem of static checking of Kubernetes YAML files can be grouped in the following categories:\n API validators — Tools in this category validate a given YAML manifest against the Kubernetes API server.\n Built-in checkers — Tools in this category bundle opinionated checks for security, best practices, etc.\n Custom validators — Tools in this category allow writing custom checks in several languages such as Rego and Javascript.\n      The following manifest has a few issues and isn&#39;t following best practices —  how many can you spot?\n apiVersion : apps/v1 kind : Deployment metadata :  name : http -echo spec :  replicas :  2  selector :  matchLabels :  app : http -echo  template :  metadata :  labels :  app : http -echo  spec :  containers :  -  name : http -echo  image : hashicorp/http -echo  args :  [ &#34;-text&#34; ,  &#34;hello-world&#34; ]  ports :  -  containerPort :  5678 --- apiVersion : v1 kind : Service metadata :  name : http -echo spec :  ports :  -  port :  5678  protocol : TCP  targetPort :  5678  selector :  app : http -echo\n  You can find the above YAML manifest as the file  base-valid.yaml along with the other manifests referred to in the article in this  .\n The manifest describes a web application that always replies with a &#34;Hello World&#34; message on port 5678.\n          Hence, you can use the API schema to validate whether a given YAML input conforms to the schema.\n     kubeval base-valid.yaml PASS - base-valid.yaml contains a valid Deployment  (http-echo )PASS - base-valid.yaml contains a valid Service  (http-echo )\n     apiVersion : apps/v1 kind : Deployment metadata :  name : http -echo spec :  replicas :  2  template :  metadata :  labels :  app : http -echo  spec :  containers :  -  name : http -echo  image : hashicorp/http -echo  args :  [ &#34;-text&#34; ,  &#34;hello-world&#34; ]  ports :  -  containerPort :  5678 --- apiVersion : v1 kind : Service metadata :  name : http -echo spec :  ports :  -  port :  5678  protocol : TCP  targetPort :  5678  selector :  app : http -echo\n   kubeval kubeval-invalid.yaml WARN - kubeval-invalid.yaml contains an invalid Deployment  (http-echo ) - selector: selector is requiredPASS - kubeval-invalid.yaml contains a valid Service  (http-echo ) # let&#39;s check the return value  echo  $? 1\n  Deployments using the  app/v1 API version have to include a selector that matches the Pod label.\n The above manifest doesn&#39;t include the selector and running kubeval against the manifest reported an error and a non-zero exit code.\n You may wonder what happens when you run  kubectl apply -f with the above manifest?\n  kubectl apply -f kubeval-invalid.yaml error: error validating  &#34;kubeval-invalid.yaml&#34; : error validating data: ValidationError (Deployment.spec ):missing required field  &#34;selector&#34;  in io.k8s.api.apps.v1.DeploymentSpec ;  if you choose to ignore these errors,turn validation off with --validate =false\n   apiVersion : apps/v1 kind : Deployment metadata :  name : http -echo spec :  replicas :  2   selector :  matchLabels :  app : http -echo   template :  metadata :  labels :  app : http -echo  spec :  containers :  -  name : http -echo  image : hashicorp/http -echo  args :  [ &#34;-text&#34; ,  &#34;hello-world&#34; ]  ports :  -  containerPort :  5678 --- apiVersion : v1 kind : Service metadata :  name : http -echo spec :  ports :  -  port :  5678  protocol : TCP  targetPort :  5678  selector :  app : http -echo\n The advantage of a tool like kubeval is that you can catch such errors early in your deployment cycle.\n Also, you don&#39;t need access to a cluster to run the checks — they could run offline.\n  In most cases, however, you might want to run validations against a specific Kubernetes release.\n    To see the versions available for validating against, check out the   which kubeval uses to perform its validation.\n If you need to run kubeval offline, you can download the schemas and then use the  --schema-location flag to use a local directory.\n In addition to individual YAML files, you can run kubeval against directories as well as standard input.\n You should also know that Kubeval makes it for easy integration with your Continuous Integration pipeline.\n If you want to include the checks before you submit your manifests to the cluster, you will be pleased to know that kubeval supports three output formats:\n  And you may be able to use one of the formats to parse the output further to create a custom summary of the results.\n One limitation of kubeval is that it is currently not able to validate against Custom Resource Definitions (CRDs).\n  Kubeval is an excellent choice to check and validate resources, but please notice that a resource that passes the test isn&#39;t guaranteed to conform to best practices.\n As an example, using the latest tag in the container images isn&#39;t considered a best practice.\n However, Kubeval doesn&#39;t report that as an error, and it will validate the YAML without warnings.\n What if you want to score the YAML and catch violations such as the latest tag?\n          kube-score score base-valid.yaml apps/v1/Deployment http-echo [CRITICAL ] Container Image Tag · http-echo - &gt; Image with latest tag Using a fixed tag is recommended to avoid accidental upgrades [CRITICAL ] Pod NetworkPolicy · The pod does not have a matching network policy Create a NetworkPolicy that targets this pod [CRITICAL ] Pod Probes · Container is missing a readinessProbe A readinessProbe should be used to indicate when the  service is ready to receive traffic. Without it, the Pod is risking to receive traffic before it has booted. It is also used during rollouts, and can prevent downtime  if a new version of the application is failing. More information: https://github.com/zegl/kube-score/blob/master/README_PROBES.md [CRITICAL ] Container Security Context · http-echo - &gt; Container has no configured security context Set securityContext to run the container  in a  more secure context. [CRITICAL ] Container Resources · http-echo - &gt; CPU limit is not  set Resource limits are recommended to avoid resource DDOS. Set resources.limits.cpu · http-echo - &gt; Memory limit is not  set Resource limits are recommended to avoid resource DDOS. Set resources.limits.memory · http-echo - &gt; CPU request is not  set Resource requests are recommended to  make sure that the application can start and run without crashing. Set resources.requests.cpu · http-echo - &gt; Memory request is not  set Resource requests are recommended to  make sure that the application can start and run without crashing. Set resources.requests.memory [CRITICAL ] Deployment has PodDisruptionBudget · No matching PodDisruptionBudget was found It is recommended to define a PodDisruptionBudget to avoid unexpected downtime during Kubernetes maintenance operations, such as when draining a node. [WARNING ] Deployment has  host PodAntiAffinity · Deployment does not have a  host podAntiAffinity  set It is recommended to  set a podAntiAffinity that stops multiple pods from a deployment from being scheduled on the same node. This increases availability  in  case the node becomes unavailable.\n   Those are all valid points that you should address to make your deployment more robust and reliable.\n The  kube-score command prints a human-friendly output containing all the  WARNING and  CRITICAL violations, which is great during development.\n If you plan to use it as part of your Continuous Integration pipeline, you can use a more concise output with the flag  --output-format ci which also prints the checks with level  OK:\n kube-score score base-valid.yaml --output-format ci  [OK ] http-echo apps/v1/Deployment [OK ] http-echo apps/v1/Deployment [CRITICAL ] http-echo apps/v1/Deployment:  (http-echo ) CPU limit is not  set [CRITICAL ] http-echo apps/v1/Deployment:  (http-echo ) Memory limit is not  set [CRITICAL ] http-echo apps/v1/Deployment:  (http-echo ) CPU request is not  set [CRITICAL ] http-echo apps/v1/Deployment:  (http-echo ) Memory request is not  set [CRITICAL ] http-echo apps/v1/Deployment:  (http-echo ) Image with latest tag [OK ] http-echo apps/v1/Deployment [CRITICAL ] http-echo apps/v1/Deployment: The pod does not have a matching network policy [CRITICAL ] http-echo apps/v1/Deployment: Container is missing a readinessProbe [CRITICAL ] http-echo apps/v1/Deployment:  (http-echo ) Container has no configured security context [CRITICAL ] http-echo apps/v1/Deployment: No matching PodDisruptionBudget was found [WARNING ] http-echo apps/v1/Deployment: Deployment does not have a  host podAntiAffinity  set [OK ] http-echo v1/Service [OK ] http-echo v1/Service [OK ] http-echo v1/Service [OK ] http-echo v1/Service\n Similar to kubeval,  kube-score returns a non-zero exit code when there is a  CRITICAL check that failed, but you configured it to fail even on  WARNINGs.\n There is also a built-in check to validate resources against different API versions — similar to kubeval.\n However, this information is hardcoded in kube-score itself, and you can&#39;t select a different Kubernetes version.\n Hence, if you upgrade your cluster or you have several different clusters running different versions, this can prove to be a severe limitation.\n   Kube-score checks are an excellent tool to enforce best practices, but what if you want to customise one, or add your own rules?\n   If you want to write custom checks to comply with your organisational policies, you can use one of the next four options - config-lint, copper, conftest or polaris.\n  Config-lint is a tool designed to validate configuration files written in YAML, JSON, Terraform, CSV, and Kubernetes manifests.\n     The rules are written as YAML files, referred to as rulesets and have the following structure:\n   The  type field indicates what type of configuration you will be checking with  config-lint —  it is always  Kubernetes for Kubernetes manifests.\n Let&#39;s say you wish to check whether the images in a Deployment are always pulled from a trusted repository such as  my-company.com/myapp:1.0.\n  -  id : MY_DEPLOYMENT_IMAGE_TAG  severity : FAILURE  message : Deployment must use a valid image tag  resource : Deployment  assertions :  -  every :  key : spec.template.spec.containers  expressions :  -  key : image  op : starts -with  value :  &#34;my-company.com/&#34;\n   In the above rule, the   checks that each container in a Deployment ( key: spec.templates.spec.containers) uses a trusted image (i.e. the image starts with  &#34;my-company.com/&#34;).\n  version :  1 description : Rules for Kubernetes spec files type : Kubernetes files :  -  &#34;*.yaml&#34; rules :   -  id : DEPLOYMENT_IMAGE_REPOSITORY  severity : FAILURE  message : Deployment must use a valid image repository  resource : Deployment  assertions :  -  every :  key : spec.template.spec.containers  expressions :  -  key : image  op : starts -with  value :  &#34;my-company.com/&#34;\n   config-lint -rules check_image_repo.yaml base-valid.yaml  [  {  &#34;AssertionMessage&#34; :  &#34;Every expression fails: And expression fails: image does not start with my-company.com/&#34;,  &#34;Category&#34; :  &#34;&#34;,  &#34;CreatedAt&#34; :  &#34;2020-06-04T01:29:25Z&#34;,  &#34;Filename&#34; :  &#34;test-data/base-valid.yaml&#34;,  &#34;LineNumber&#34; : 0,  &#34;ResourceID&#34; :  &#34;http-echo&#34;,  &#34;ResourceType&#34; :  &#34;Deployment&#34;,  &#34;RuleID&#34; :  &#34;DEPLOYMENT_IMAGE_REPOSITORY&#34;,  &#34;RuleMessage&#34; :  &#34;Deployment must use a valid image repository&#34;,  &#34;Status&#34; :  &#34;FAILURE&#34;  } ]\n   apiVersion : apps/v1 kind : Deployment metadata :  name : http -echo spec :  replicas :  2  selector :  matchLabels :  app : http -echo  template :  metadata :  labels :  app : http -echo  spec :  containers :  -  name : http -echo   image : my -company.com/http -echo : 1.0   args :  [ &#34;-text&#34; ,  &#34;hello-world&#34; ]  ports :  -  containerPort :  5678\n Run the same check with the above manifest and there will be no violations reported:\n  Config-lint is a promising framework that lets you write custom checks for Kubernetes YAML manifests using a YAML DSL.\n       Instead, tests are written in JavaScript and Copper provides a library with a few basic helpers to assist in reading Kubernetes objects and reporting errors.\n    Let&#39;s write a check to make sure that deployments can pull container images only from a trusted repository such as  my-company.com.\n  $$ . forEach ( function ( $ ) {  if  ($ .kind  ===  &#39;Deployment&#39; )  { $ .spec .template .spec .containers . forEach ( function ( container )  {  var image  =  new   (container .image ) ;  if  (image .registry . lastIndexOf ( &#39;my-company.com/&#39; )  !=  0 )  { errors . add_error ( &#39;no_company_repo&#39; , &#34;Image &#34;  + $ .metadata .name  +  &#34; is not from my-company.com repo&#34; ,  1 )  }  } ) ;  } } ) ;\n Now, to run this check against our  base-valid.yaml manifest, you can use the  copper validate command:\n copper validate --in =base-valid.yaml --validator =check_image_tag.js Check no_company_repo failed with severity 1 due to Image http-echo is not from my-company.com repoValidation failed\n As you can imagine, you can write more sophisticated checks such as validating domain names for Ingress manifests or reject any Pod that runs as privileged.\n  The  DockerImage function reads the specified input file and creates an object containing the following attributes:\n The  findByName function helps find a resource given a  kind and  name from an input file\n  By default, it loads the entire input YAML file into the  $$ variable and makes it available in your scripts (if you used jQuery in the past, you might find this pattern familiar).\n In addition to not having to learn a custom language, you have access to the entire JavaScript language for writing your checks such as string interpolation, functions, etc.\n It is worth noting that the current copper release embeds the ES5 version of the JavaScript engine and not ES6.\n  If Javascript isn&#39;t your preferred language and you prefer a language designed to query and describe policies, you should check out conftest.\n  Conftest is a testing framework for configuration data that can be used to check and verify Kubernetes manifests.\n      As for the previous example, you will check that the container is coming from a trusted source.\n  package maindeny [msg ]  { input .kind  ==  &#34;Deployment&#34; image  := input .spec .template .spec .containers [ _ ] .image  not  startswith (image ,  &#34;my-company.com/&#34; ) msg  :=  sprintf ( &#34;image &#39;%v&#39; doesn&#39;t come from my-company.com repository&#34; ,  [image ] ) }\n  conftest  test --policy ./conftest-checks base-valid.yaml FAIL - base-valid.yaml - image  &#39;hashicorp/http-echo&#39; doesn&#39;t come from my-company.com repository1 tests, 1 passed, 0 warnings, 1 failure\n  The above Rego file specifies a  deny block which evaluates to a violation when true.\n When you have more than one  deny block, conftest checks them independently, and the overall result is a violation of any of the blocks results in a breach.\n Other than the default output format, conftest supports JSON, TAP, and a table format via the  --output flag, which is excellent if you wish to integrate the reports with your existing Continuous Integration pipeline.\n To help debug policies, conftest has a convenient  --trace flag which prints a trace of how conftest is parsing the specified policy files.\n Conftest policies can be published and shared as artefacts in OCI (Open Container Initiative) registries.\n The commands,  push and  pull allow publishing an artefact and pulling an existing artefact from a remote registry.\n Let&#39;s see a demo of publishing the above policy to a local docker registry using  conftest push.\n   From another terminal, navigate to the  conftest-checks directory created above and run the following command:\n    Now, create a temporary directory and run the  conftest pull command which will download the above bundle to the temporary directory:\n  You will see that there is a new sub-directory  policy in the temporary directory containing the policy file pushed earlier:\n   conftest  test --update 127.0.0.1:5000/amitsaha/opa-bundle-example:latest base-valid.yaml  ..FAIL - base-valid.yaml - image  &#39;hashicorp/http-echo&#39; doesn&#39;t come from my-company.com repository2 tests, 1 passed, 0 warnings, 1 failure\n  However, if you are using   or running your container registry, you might be in luck.\n The  , which makes it possible to use conftest to run tests from existing OPA bundles.\n    Polaris can be either installed inside a cluster or as a command-line tool to analyse Kubernetes manifests statically.\n When running as a command-line tool, it includes several built-in checks covering areas such as security and best practices — similar to kube-score.\n Also, you can use it to write custom checks similar to config-lint, copper, and conftest.\n In other words, polaris combines the best of the two categories: built-in and custom checkers.\n     The above command will print a JSON formatted string detailing the checks that were run and the result of each test.\n  {  &#34;PolarisOutputVersion&#34; :  &#34;1.0&#34; ,  &#34;AuditTime&#34; :  &#34;0001-01-01T00:00:00Z&#34; ,  &#34;SourceType&#34; :  &#34;Path&#34; ,  &#34;SourceName&#34; :  &#34;test-data/base-valid.yaml&#34; ,  &#34;DisplayName&#34; :  &#34;test-data/base-valid.yaml&#34; ,  &#34;ClusterInfo&#34; :  {  &#34;Version&#34; :  &#34;unknown&#34; ,  &#34;Nodes&#34; :  0 ,  &#34;Pods&#34; :  2 ,  &#34;Namespaces&#34; :  0 ,  &#34;Controllers&#34; :  2  } ,  &#34;Results&#34; :  [  /* long list */  ] }\n  Similar to kube-score, polaris identifies several cases where the manifest falls short of recommended best practices which include:\n    If you are not interested in the detailed results, passing the flag  --format score prints a number in the range 1-100 which polaris refers to as the  score:\n   If you inspect the exit code of the  polaris audit command, you will see that it was  0.\n To make  polaris audit exit with a non-zero code, you can make use of two other flags.\n The  --set-exit-code-below-score flag accepts a threshold score in the range 1-100 and will exit with an exit code of 4 when the score is below the threshold.\n This is very useful in cases where your baseline score is 75, and you want to be alerted when it goes lower.\n The  --set-exit-code-on-danger flag will exit with an exit code of 3 when any of the  danger checks fail.\n Let&#39;s now see how you can define a custom check for  polaris to test whether the container image in a Deployment is from a trusted registry.\n Custom checks are defined in a YAML format with the test itself described using JSON Schema.\n  checkImageRepo :  successMessage : Image registry is valid  failureMessage : Image registry is not valid  category : Images  target : Container  schema :  &#39;$schema&#39; : http ://json -schema.org/draft -07/schema  type : object  properties :  image :  type : string  pattern : ^my -company.com/.+$\n  category refers to one of the categories -  Images,  Health Checks,  Security,  Networking and  Resources.\n target is a string that determines which  spec object the check is applied against - and should be one of  Container,  Pod, or\n......", "posttime": "2020-08-09 21:11:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kubernetes,检查", "title": "验证Kubernetes YAML以获得最佳实践和策略", "title_en": "Validating Kubernetes YAML for best practice and policies", "transed": 1, "url": "https://learnk8s.io/validating-kubernetes-yaml", "via": "", "real_tags": ["检查"]}, {"category": "", "categoryclass": "", "imagename": "0058383b157d7c4f7e1da37985b1b679.png", "infoid": 1017179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(彭博商业周刊)--想象一下今天是感恩节或圣诞晚餐，整个大家庭都会出现。在那张长长的餐桌上有一个小角落，你可以把它放在那里……", "note_en": "(Bloomberg Businessweek) -- Imagine it’s Thanksgiving or Christmas dinner, the one where the entire extended family shows up. There’s a little corner of the long dinner table where you put the rela...", "posttime": "2020-08-09 21:10:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肆无忌惮,running,商业", "title": "QAnon肆无忌惮，现在是介入的时候了", "title_en": "QAnon is running amok and the time has come for interventions", "transed": 1, "url": "https://www.bloombergquint.com/businessweek/qanon-is-running-amok-and-the-time-has-come-for-interventions", "via": "", "real_tags": ["肆无忌惮", "running", "商业"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017178, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能(AI)对世界上的善做出了重大贡献。从减少污染到使用自动驾驶汽车使道路更安全，再到通过医疗大数据分析实现更好的医疗保健，人工智能仍有大量尚未开发的潜力。不幸的是，就像世界上的任何技术一样，人工智能可以被那些不那么高尚的人使用。\n有一种基于人工智能的技术叫做“深度假冒”(深度学习和假冒相结合)，它利用深度神经网络轻松地制作假视频，其中一个人的面孔叠加在另一个人的面孔上，这就是一种基于人工智能的技术。这些工具易于使用，即使对于没有编程或视频编辑背景的人也是如此。这项技术可以用来制作几乎任何人的攻击性视频，包括名人、政客和企业公众人物。在这个空前互联和即时通信的时代-新闻可以在几个小时内像病毒一样传播开来-这样的视频可能会对视频中的人以及相关社区的社会和文化心理造成巨大伤害。\nDeepfakes就在市场上。但是，如果能够自动检测到这些视频，则可以减轻危害。还有什么比使用人工智能本身更好的方法来做到这一点呢？\n虽然基于人工智能的深度假视频检测方法确实存在，但来自印度塔帕尔工程技术研究所和Indraprpara信息技术研究所的研究人员已经开发出一种新的算法，提高了准确性和精确度。他们的工作可能是寻求对抗我们今天所面临的众多信息需求中的一种的里程碑。\n大体上，他们的方法由一个分类器组成，该分类器决定输入的视频是真实的还是(深度)假的。为了做出准确的决策，就像所有基于人工智能的应用程序一样，它们的算法必须首先进行训练。为此，研究人员首先创建了一个包含200个长相相似的不同政客组合的视频的数据集；其中100个是真实的，另外100个是使用Deepfac生成的。这些视频的一部分帧被标记并作为训练数据馈送到算法；其余的被用作验证数据集，以测试程序是否能够正确地捕获人脸交换的视频。\n算法本身可以分为两个层次。在第一级，视频帧经过一些轻微的图像处理，例如重新缩放、缩放和水平翻转，为后续阶段做准备。第二级包括两个主要部分：卷积神经网络(CNN)和长短期记忆(LSTM)阶段。\nCNN是一种特殊类型的神经网络，可以从连续的视频帧中自动提取特征。提取了什么特征以及它们是如何定义的，只有CNN知道。LSTM是一种递归神经网络，对于处理时间序列数据(在这种情况下，是连续的视频帧)特别有用。在比较原始视频和深度假视频时，LSTM网络很容易检测到后者的帧不一致。该算法仅使用大约两秒的视频素材就可以识别它们。\n对这种新方法的性能进行了测试，并与其他现有的基于人工智能的深度假视频检测技术进行了比较。对于从本研究整理的视频数据集中检索到的181,608个真实和深度伪帧，该方法获得了较高的准确率(98.21%)和准确率(99.62%)，而总的训练时间要短得多。结果表明，该方法具有较高的正确率(98.21%)和较高的正确率(99.62%)。\n这项研究突出了人工智能的好处和坏处。虽然人工智能可以用来损害声誉和传播错误信息，但它也可以用来防止信息传播，在新冠肺炎大流行这样的危机中，人们强烈感受到了信息传播的危害。\n请阅读“电子成像杂志”的原文：库尔、库马尔和库马拉古鲁，“深度假象：使用卷积长期短期记忆检测脸部交换视频剪辑的时间序列分析”，DOI 10.1117/1.JEI.29.3.033013。", "note_en": "Artificial intelligence (AI) contributes significantly to good in the world. From reducing pollution to making roads safer with self-driving cars to enabling better healthcare through medical big-data analysis, AI still has plenty of untapped potential. Unfortunately, just like any technology in the world, AI can be used by those with less noble intentions.\n    Such is the case with a certain AI-based technique called &#34;deepfake&#34; (combination of &#34;deep learning&#34; and &#34;fake&#34;), which uses deep neural networks to easily create fake videos in which the face of one person is superimposed on that of another. These tools are easy to use, even for people with no background in programming or video editing. This technique can be used to create compromising videos of virtually anyone, including celebrities, politicians, and corporate public figures. In this era of unprecedented connectedness and instant communication-when news can become viral in a matter of hours-such videos can cause great harm to those in the videos as well as to the social and cultural psyche of the associated communities.\n    &#34;Deepfakes&#34; are out there. But, the harm can be mitigated if these videos can be automatically detected. And what better way to do that than to use AI itself?\n  While AI-based deepfake video detection methods do exist, researchers from Thapar Institute of Engineering and Technology and Indraprastha Institute of Information Technology in India  have developed a new algorithm with increased accuracy and precision. Their work could be a milestone in the quest to counter one of the many kinds of infodemics that we face today.\n  Broadly, their approach consists of a classifier that decides whether an input video is real or (deep) fake. To make accurate decisions possible, like all AI-based applications, their algorithm had to be trained first. To this end, the researchers began by creating a dataset of 200 videos of various, similar-looking pairs of politicians; 100 of these were real and the other 100 were generated using deepfake. A portion of the frames of these videos were labeled and fed to the algorithm as training data; the rest were used as a validation dataset to test if the program could correctly catch face-swapped videos.\n    The algorithm itself can be divided into two levels. At the first level, the video frames undergo some light image processing, such as rescaling, zooming, and horizontal flipping, as preparation for subsequent stages. The second level comprises two main components: a convolutional neural network (CNN) and a long short-term memory (LSTM) stage.\n  The CNN is a special type of neural network that can automatically extract features from sequential video frames. What features are extracted and how they are defined is known only to the CNN. The LSTM is a type of recurrent neural network that is especially useful for processing time-series data (in this case, sequential video frames). Upon comparing the original and deepfake videos, the LSTM network easily detects inconsistencies in the frames of the latter. The algorithm can identify them using only about two seconds of video material.\n  The performance of this new method was tested and compared with that of other existing state-of-the-art AI-based techniques for detecting deepfake videos. For a total of 181,608 real and deepfake frames retrieved from the dataset of videos collated in this study, the proposed method achieved higher accuracy (98.21%) and precision (99.62%), with a much lower total training time.\n  This study highlights the boon and the bane of AI. While AI can be used to damage reputations and spread misinformation, it can also be used to prevent infodemics, the harms of which are sharply felt amid crises like the COVID-19 pandemic.\n  Read the original article in the  Journal of Electronic Imaging: Kaur, Kumar, and Kumaraguru, &#34;Deepfakes: temporal sequential analysis to detect face-swapped video clips using convolutional long short-term memory,&#34; doi  10.1117/1.JEI.29.3.033013.", "posttime": "2020-08-09 21:10:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,算法,deepfake,视频", "title": "使用人工智能算法阻止深度假新闻，该算法可以判断人脸何时不合适", "title_en": "Stopping deepfake news with an AI algorithm that can tell when a face doesnt fit", "transed": 1, "url": "https://spie.org/news/stopping-deepfake-news-with-an-ai-algorithm-that-can-tell-when-a-face-doesnt-fit", "via": "", "real_tags": ["人工智能", "算法", "deepfake", "视频"]}, {"category": "", "categoryclass": "", "imagename": "ba3af1f8c0c346685122d4f4f1376bd5.jpg", "infoid": 1017177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "官员们说，大众汽车(Volkswagen)一名被控参与合谋逃避美国清洁空气法的前高管在克罗地亚被捕，这表明在大众汽车排放作弊行为首次曝光近五年后，当局仍在继续追查此案。\n克罗地亚内政部周三表示，前高管阿克塞尔·艾泽(Axel Eiser)于6月9日在与斯洛文尼亚边境的一个过境点被捕，目前是根据美国的逮捕令被拘留的。斯洛文尼亚边境通常是松散的，但由于冠状病毒大流行，已经加强了控制。\n美国司法部(US Department Of Justice)去年对艾瑟提出的指控显示，当时他是大众奥迪(Audi)部门的发动机开发主管，当时工程师们正在开发旨在欺骗排放检查员认为这些汽车符合排放规则的软件。汽车在路上的大部分时间里污染的程度远远超过了允许的程度。\n克罗地亚和美国去年签署了一项引渡条约。克罗地亚内政部将有关引渡艾瑟的程序的问题提交给该国司法部，司法部没有立即回应提供信息的请求。美国司法官员拒绝置评。\n根据起诉书和该案中的其他文件，艾瑟是一个团队的成员，该团队在2006年左右意识到，奥迪柴油车在提供奥迪认为客户想要的豪华功能的同时，无法满足美国的排放法规。此外，减少有毒氮氧化物排放所需的设备将占用高端音响系统所需的空间。\n大众承认，为了解决这个问题，工程师们开发了一种软件，可以识别汽车何时接受测试，并暂时将排放量降低到合法水平。该非法软件是在2009年至2016年期间安装在奥迪上的。\n记者无法联系到艾瑟请其置评，但他在2017年德国议会一个委员会作证时为自己的行为进行了辩护。\n如果艾瑟被引渡到美国，他将只是这起案件中面临指控的数十名嫌疑人中的第三人。大多数被控违反美国清洁空气法的前大众和奥迪经理和工程师据信都在德国，德国不引渡本国公民。嫌疑人在德国也面临指控，但那里的惩罚往往没有美国那么严厉。\n艾瑟最初逃脱了排放作弊的指责。2016年初，他被提升为大众汽车(Volkswagen)所有部门的发动机开发主管，几个月前，美国环境保护局(Environmental Protection Agency)公开指控这家汽车制造商违反清洁空气规定。美国当局于2019年1月起诉了他和其他几名前奥迪高管。\n目前尚不清楚艾泽为何前往克罗地亚，他在那里不再受德国法律保护。美国当局经常展示他们追踪美国官员追捕的人的行动的能力。\n2017年，前大众汽车(Volkswagen)经理奥利弗·施密特(Oliver Schmidt)在美国逗留后途经迈阿密国际机场(Miami International Airport)时逮捕了被控参与掩盖排放违规行为的奥利弗·施密特(Oliver Schmidt)。施密特后来承认了共谋指控，并被判处七年监禁，目前仍在密歇根州的一家联邦设施服刑。\n到目前为止，另一名在美国面临起诉的大众员工是住在加州的工程师詹姆斯·梁(James Leung)。2017年，在承认参与排放欺诈后，他被判处40个月监禁。监狱记录显示，梁于去年11月从加利福尼亚州的一座联邦监狱获释。", "note_en": "A former high-ranking executive at Volkswagen who is accused of being part of a conspiracy  to evade U.S. clean air laws has been arrested in Croatia, officials said, a sign that authorities continue to pursue the case almost five years after the carmaker’s emissions cheating was first exposed.\n Axel Eiser,  the former executive, was arrested on June 9 at a crossing along the border with Slovenia, the Croatian Interior Ministry said Wednesday, and was being held on a United States warrant. Controls at the Slovenian border, which are normally loose, have been stepped up because of the coronavirus pandemic.\n  Mr. Eiser was head of engine development at Volkswagen’s Audi unit at the time engineers were developing  software designed to trick emissions inspectors into thinking that the cars complied with emissions rules,  according to charges that were filed against him last year by the U.S. Department of Justice. The cars polluted far more than allowed most of the time they were on the road.\n Croatia and the United States signed an  extradition treaty last year. The Croatian Interior Ministry referred questions about the procedure for extraditing Mr. Eiser to the country’s Ministry of Justice, which did not immediately respond to a request for information. United States Justice officials declined to comment.\n Mr. Eiser was part of a team that, around 2006, realized that Audi diesels could not meet American emissions regulations while still offering the luxury features that the carmaker thought customers wanted, according to the indictment and other  documents in the case. Among other things, equipment needed to reduce emissions of poisonous nitrogen oxides would have taken away space needed for a high-end sound system.\n Volkswagen has admitted that, to solve the problem, engineers developed software that could recognize when a car was being tested and temporarily reduce emissions to legal levels. The illegal software was installed in Audis from 2009 to 2016.\n Mr. Eiser could not be reached for comment, but he defended his behavior during testimony before  a committee of the German Parliament in 2017.\n If he is extradited to the United States, Mr. Eiser would be only the third of several dozen suspects in the case to face charges there. Most of the former Volkswagen and Audi managers and engineers charged with violating the U.S. Clean Air Act are believed to be in Germany, which does not extradite its own citizens. The suspects also face charges in Germany, but penalties there tend to be less severe than in the United States.\n Mr. Eiser initially escaped blame for the emissions cheating. He was promoted to head of engine development for all Volkswagen divisions in early 2016, several months after the Environmental Protection Agency publicly accused the carmaker of clean air violations. U.S. authorities indicted him and several other former Audi executives in January 2019.\n It is unclear why Mr. Eiser went to Croatia, where he was no longer protected by German law. American authorities have often demonstrated their ability to track the movements of people sought by U.S. officials.\n In 2017, the F.B.I. arrested  Oliver Schmidt, a former Volkswagen manager accused of being involved in covering up the emissions violations, while he was passing through Miami International Airport after a sojourn in the United States. Mr. Schmidt later pleaded guilty to conspiracy charges and received a seven-year prison sentence, which he is still serving at a federal facility in Michigan.\n The only other Volkswagen employee to face prosecution in the United States so far was  James Liang, an engineer who lived in California. He received a 40-month sentence in 2017 after admitting his involvement in the emissions fraud. Mr. Liang was released from a federal prison in California in November, according to prison records.", "posttime": "2020-08-09 20:20:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高管,executive,美国", "title": "前大众高管因排放案在克罗地亚被捕", "title_en": "Former VW Executive Is Arrested in Croatia in Emissions Case", "transed": 1, "url": "https://www.nytimes.com/2020/06/17/business/VW-dieselgate-arrest-croatia.html", "via": "", "real_tags": ["高管", "executive", "美国"]}, {"category": "", "categoryclass": "", "imagename": "b00b8e87b15ade5b9741ccf437d0965e.jpg", "infoid": 1017175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份新的报告揭露了一名联邦承包商是如何将政府跟踪软件秘密安装到数百个移动应用程序中的。\n从这一追踪中收集到的数据随后被卖回给美国政府，目的不详。\n这种策略是欺骗性的，因为跟踪并未披露。然而，这似乎是完全合法的。", "note_en": "A new report exposes how a federal contractor secretly puts government tracking software into hundreds of mobile apps.\n The data gleaned from this tracking is then sold back to the US government for undisclosed purposes.\n This tactic is deceptive because the tracking isn’t disclosed. However, it appears to be totally legal.", "posttime": "2020-08-09 19:07:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,软件,程序,应用程序,apps", "title": "数以百计的应用程序有美国政府使用的隐藏跟踪软件", "title_en": "Hundreds of apps have hidden tracking software used by the US government", "transed": 1, "url": "https://www.androidauthority.com/government-tracking-apps-1145989/", "via": "", "real_tags": ["美国", "软件", "程序", "应用程序", "apps"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此页使用框架，但您的浏览器不支持它们。这是框架内容页。", "note_en": "This page uses frames, but your browser doesn&#39;t support them. Here is the  frame contents page.", "posttime": "2020-08-09 19:05:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞行,public,框架", "title": "眩晕--一个公共领域的3D飞行模拟器", "title_en": "Vertigo – a public domain 3D flight simulator", "transed": 1, "url": "http://stjerneskud.info/vertigo/", "via": "", "real_tags": ["飞行", "public", "框架"]}, {"category": "", "categoryclass": "", "imagename": "725c4c8c847bb1c528772850cc89804e.jpg", "infoid": 1017173, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克(Elon Musk)的隧道建设初创公司The Drill Company已经获得批准，将扩大其在拉斯维加斯地下的交通网络。\n环路网络现在将包括一个车站，位于拉斯维加斯会议中心(LVCC)附近的新度假村世界(Resorts World)，该系统将于今年晚些时候在那里开通。\n马斯克上个月分享了首个商业环线车站的效果图，展示了特斯拉Model 3电动车的停车位，这些电动车将用来运送乘客，从会议中心的一边到另一边，行程长达一英里。\n这是钻探公司的第一个商业项目，马斯克在2016年因对家乡洛杉矶的交通感到失望而创立了该公司。\n这家初创公司声称，通过将当前隧道挖掘技术的时间和成本降低10倍，能够为城市交通提供这一全新的选择。\n马斯克表示，地下网络也不会干扰现有的交通基础设施。马斯克也是特斯拉(Tesla)和太空探索技术公司(SpaceX)的负责人。\n“为了解决破坏灵魂的交通问题，道路必须是3D的，”无聊公司的网站上写道。\n他说：“一个多层深的大型隧道网络将有助纾缓任何城市的挤塞情况。无论一个城市发展到多大，总能增加更多的层次。“\n克拉克县专员周四宣布批准拉斯维加斯项目的最新延期，预计将于今年年底开工建设。\n拉斯维加斯度假村世界总裁斯科特·西贝拉(Scott Sibella)说：“我们很高兴获得县委员会的批准，推进我们拟议中的客运站和隧道，并渴望采取下一步行动，为我们的会议嘉宾和游客创造一个创新的交通解决方案。”\nLVCC环路最终可能一直延伸到麦卡伦国际机场，以每小时155英里的速度在拉斯维加斯大道下运送乘客。\n根据钻孔公司的说法，在高峰时段从拉斯维加斯大道一端到另一端的旅行时间可能会从30分钟缩短到只有3分钟。\n该公司目前正在与美国各地的其他城市进行谈判，以改善交通基础设施，包括芝加哥和洛杉矶。\n一条原型隧道已经在该公司的洛杉矶总部挖掘并进行了测试。2018年的一次示威活动中，一辆特斯拉穿着溜冰鞋穿过了一条一英里长的隧道，这条隧道的建造成本为1000万美元。\n根据钻孔公司的网站，目前许多项目的成本在每英里1亿至10亿美元之间。\n拉斯维加斯会议和游客管理局今年早些时候透露，拉斯维加斯会议中心下面的环路正在建设中，耗资5250万美元。\n它正以每天100英尺的速度完工，一旦完工，将有能力每小时运送多达4400名乘客。\n输入您的电子邮件地址请输入电子邮件地址电子邮件地址无效填写此字段电子邮件地址无效电子邮件已存在。登录以更新您的时事通讯首选项，我希望每周通过电子邮件接收生活方式世界上最好的功能和趋势。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n想要讨论现实世界的问题，参与最引人入胜的讨论，听取记者的意见吗？立即开始您的独立高级订阅。\n已经注册了？登录\n独立高级评论可以由我们会员计划的成员发布，独立高级。它允许我们参与度最高的读者辩论重大问题，分享他们自己的经验，讨论现实世界的解决方案，等等。我们的记者将尝试回应，在他们可能的情况下加入这些帖子，以创造一次真正的独立溢价会议。关于所有主题的最有洞察力的评论将每天发表在专门的文章中。您也可以选择在有人回复您的评论时通过电子邮件发送。\n对于那些没有订阅独立高级的人，现有的开放评论线程将继续存在。由于这个评论社区的巨大规模，我们不能对每个帖子给予同等程度的关注，但出于公开辩论的利益，我们保留了这一区域。请继续尊重所有评论者，并进行建设性的辩论。", "note_en": "Elon Musk’s tunnelling startup, The  Boring Company, has received approval to expand its transportation network beneath Las Vegas.\n  The Loop network will now include a station at the new Resorts World nearby the Las Vegas Convention Center (LVCC), where the system is set to open later this year.\n    Mr Musk shared  renders of the first commercial Loop station last month, revealing parking bays for the Tesla Model 3 electric cars that will be used to carry passengers on the mile-long journey from one side of the convention centre to the other.\n            It is the first commercial venture for The Boring Company, which Mr Musk founded in 2016 out of frustration with traffic in his hometown of Los Angeles.\n    The startup claims to be able to offer this radical new option for urban transportation by reducing the time and cost of current tunnel-digging technologies by a factor of 10.\n    The underground networks will also not interfere with existing transportation infrastructure, according to Mr Musk, who also heads  Tesla and SpaceX.\n    “To solve the problem of soul-destroying traffic, roads must go 3D,” The Boring Company’s website states.\n  “A large network of tunnels many levels deep would help alleviate congestion in any city. No matter how large a city grows, more levels can always be added.”\n      Approval for the latest extension to the Las Vegas project was announced by Clark County commissioners on Thursday, with construction expected to begin at the end of the year.\n  “We are thrilled to receive approval from the County Commission to move forward with our proposed passenger station and tunnel and are eager to take the next steps in creating an innovative transportation solution for our convention guests and visitors,” said Scott Sibella, president of Resorts World Las Vegas.\n           The LVCC Loop could eventually extend all the way out to the McCarran International Airport, transporting passengers under the Las Vegas Strip at speeds of up to 155mph.\n     Travelling at peak hours journey times from one end of the Strip to the other could be cut from 30 minutes to just 3 minutes, according to The Boring Company.\n  The company is currently in discussions with other cities throughout the US to improve transport infrastructure, including Chicago and Los Angeles.\n    A prototype tunnel has already been dug and tested at the company’s LA headquarters. A demonstration in 2018 transported a Tesla along skates through a mile-long tunnel, which was constructed at a cost of $10m.\n     Many current projects cost anywhere between $100m and $1 billion per mile, according to The Boring Company’s website.\n    The Loop beneath the LVCC is being built at a cost of $52.5m, the Las Vegas Convention and Visitors Authority revealed earlier this year.\n  It is being completed at a rate of 100ft per day and once completed will have the capacity to transport up to 4,400 passengers per hour.\n        Enter your email address      Please enter an email address  Email address is invalid  Fill out this field  Email address is invalid  Email already exists. Log in to update your newsletter preferences    I  would like to receive the best features and trends across the world of lifestyle every week by email\n        You may not agree with our views, or other users’, but please respond to them respectfully\n  Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n    You may not agree with our views, or other users’, but please respond to them respectfully\n  Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n                 Want to discuss real-world problems, be involved in the most engaging discussions and hear from the journalists? Start your Independent Premium subscription today.\n       Already registered?  Log in\n          Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment.\n  The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates.", "posttime": "2020-08-09 18:40:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,扩大,musk", "title": "埃隆·马斯克(Elon Musk)的隧道挖掘企业刚刚获准扩大规模", "title_en": "Elon Musk’s tunnel-digging venture just got approval for expansion", "transed": 1, "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/news/elon-musk-tesla-tunnel-boring-company-las-vegas-loop-a9659221.html", "via": "", "real_tags": ["埃隆·马斯克", "扩大", "musk"]}, {"category": "", "categoryclass": "", "imagename": "8431130caa7df6943fdb7f5f0c310e3a.jpeg", "infoid": 1017171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这部分其实还挺酷的。整个转换器是使用通常的兆秒堆栈开发的，用来解析Hinc代码，使用haskell-src-exts来漂亮地打印Haskell代码。除了用MISO开发的前端之外，所有这些都被编译成单个JavaScript文件。真的，完全没有服务器！", "note_en": "That part is actually quite cool. The whole transpiler is developed using a usual stack of  megaparsec to parse  hinc code and  haskell-src-exts to pretty print Haskell code. All of this, in addition to the front-end developed with Miso, is compiled to a single JavaScript file. Really, completely serverless!", "posttime": "2020-08-09 17:47:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "身着,haskell", "title": "Hinc：身着新衣的哈斯克尔", "title_en": "Hinc: Haskell In New Clothes", "transed": 1, "url": "https://github.com/serras/hinc", "via": "", "real_tags": ["身着", "haskell"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017170, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有什么比一个好的咆哮更好的了！它可能不会改善世界，也可能不会解决引发咆哮的问题，但事后感觉很好。\n这场咆哮是关于在国有化之类的词中使用“z”是错误的，或者说是美国式的。必须承认，有些词中有带“z”的纯美式单词，比如advertize，或者可能是错误的，比如surmize。有时这只是一个错误-一个拼写不知道，也没有人寻找其正确拼写的单词，在诚实但错误地相信它是正确的情况下，被任意地赋予了一个“z”。有时，美语中带有z字形的单词代表了一种更古老的(可能是伊丽莎白时代的)英语形式，这种语言在英国标准化之前就传到了美国。更有可能的是，美国的“z”是诺亚·韦伯斯特(Noah Webster)在1828年出版他著名的词典时试图“标准化”或“改进”美国英语用法的努力之一，在这本词典中，他决定对拼写进行刻意而广泛的修改-他被描述为一位伟大的拼写改革家(我在学校时也曾尝试过改革拼写，但没有得到赏识)。显然，韦伯斯特决定在他认为需要发音的任何地方使用“z”。这是一个极不寻常的例子，字典引领了书面语言，而不是试图反映它。\n这场争论与美国人无关。如果我们忽略美国人故意选择不同拼写的各种单词，大多数带“z”的单词，或者发音像“z”的“s”，似乎都非常清楚地归入那些必须带“s”的单词(比如妥协，那里的派生是-misser)，那些必须带“z”的单词(比如奖品)，以及其他的，围绕这些词的争议显然很激烈(如果只是在这里)。\n我花了很大力气来研究这一点，不仅看了各种课本和风格手册，而且查阅了一系列多年来的文献，看看哪种拼法更受欢迎。我指的只是上面给出的第三种情况，即作家或他们的出版商已经开始将使用图书视为可以接受的替代图书(我们都同意，误用另外两种图书将是错误的)。\n在我看来，在第二次世界大战之前，在英国印刷的书籍中，“z”的使用占据了压倒性的主导地位，尽管一些印刷厂甚至在维多利亚时代也可以发现使用“s”的比例要小得多。教科书阐述了使用“z”的正确性，其中一些教科书相当详细地列出了根据来源使用“s”或“z”的理由。第二次世界大战后，“s”更多地被认为是一种可能的选择，一些家庭式的手册(尽管不是牛津的)表明了对“s”的偏好-不是因为任何关于“z”是错的建议，记住，而是因为‘s’已经被容忍了，而且它避免了记住哪个用法是哪个用法。最近的手册和字典似乎已经放弃了a‘z’的规定用法，尽管在正确的情况下，它通常是作为替代用法提供的。\n在我看来，总结一下，并正确地、非美式地使用a‘z’，似乎是：\n总体而言，“z”替代方案与美国没有任何关系；\n“s”的使用主要是由那些相信它(显然是错误的)的人通过类比法语中的类似单词而开始使用的，而实际上英语的使用是平行发展的，并来自希腊语，始终保留了“z”(例如，英语中的实现与法语中的la réalization相比)--在英语印刷的早期，法语[最近盎格鲁-诺曼贵族的语言]被认为是时髦的，而在某些方面，在英语印刷的早期，法语(最近是盎格鲁-诺曼贵族的语言)被认为是时髦的，而在英语印刷的早期，法语[最近是盎格鲁-诺曼贵族的语言]被认为是时髦的；\n“s”之所以在最近几年流行起来，是因为它被认为是可以接受的(因为上述原因)，而且因为无法正确地训练未受过教育的人抓住正确的时机来部署“z”或“an‘s”。请注意蒂洛森的豪斯风格(见下文)，他们认为“z”一词的用法是正确的，但他们决定采用“z”，因为这样会减少麻烦。\n随着“s”的使用流行起来，词典们不得不顺应潮流，现在把它引用为“正确的”。这是有争议的，但字典不一定提倡正确的用法，而是遵循普遍的做法(然后被认为是正确的，造成螺旋式下降)。\n对我自己来说，我很高兴在合适的地方继续使用‘z’，我确实努力想把它弄对，但我必须承认有时是前后不一致的。当然，使用“z”的形式会邀请人们来找我，我会把他们介绍给“牛津英语词典”(大词典)，通常事情就这样结束了。总的来说，这不是一本可以挑衅的书。\n我想，即使在拿到事实之后，也会有人坚持‘s’选项，这取决于他们--我无能为力。我所要求的是，决心使用“s”的人不要认为那些使用“z”的人在使用美式英语！\n许多伟大的出版社都喜欢“-ize”等结尾，像伦敦交通这样有影响力的大型组织总是在海报和其他公共交流中使用“-ize”形式，尽管他们的现代个人电脑原创材料还有很多不尽如人意的地方。\n我在下面(实际上是在下一专栏)附上了各种参考资料，这些参考资料对这一问题有更多的了解。请注意，一些选择了这种形式的家居风格指南提到了所谓的争议，即当局对哪种拼写更正确存在争议。家居风格指南本身并不是权威，尽管他们可能会依赖它们并参考它们。在我寻找的“权威”中，它们都表明“-ize”在词源上是正确的，我还没有找到任何解释“权威”如何正确的权威；如果有读者知道其中一个，我会很高兴听到，并乐意在下面引用它。\n我感觉好些了吗？嗯，事实上，我想我是这样想的。\n--广告、宣扬、通知(通知)、惩戒、割礼、包含、妥协、毁灭、蔑视、设计、剥夺公民权、伪装、企业、特许经营、企业、消费税、锻炼、特许经营、即兴创作、切割、商品、处所(Vb)、企业(强行开启)、重演、赛斯(法律)、监督、猜测、惊喜、电视。\n-ize，加在in-ism(批评)、-ization(文明)、-izer(开胃)、-y(痛苦)或完整名词(Canalize)词干上的正常后缀。这本书中列举了许多常见的例子。\n牛津大学出版社的哈特排版和读者规则，由贺拉斯·哈特1893年出版，这个版本(第37期)1967年出版。\n在同时使用两种拼写的情况下，应该使用-ize结尾，而不是-ise结尾。通常，-ize是用于以-ism、-ization、-izer、-y结尾的名词词干或完整名词的后缀。\n例如：Agony−折磨文明−文明开胃菜−平息批评−批评运河−管化晶体管−晶体管。\n当名词有-is-作为词干的一部分时，结尾-ise是正确的，例如在音节-vis-(See)，-cis-(Cuting)，-mis-(Put)中，也用于那些没有以in-ism，-ization等结尾的名词。例外情况是agranizment­/agranizize，Recognition/Recognition，以及在C.O.D.中注明为‘同化为动词in-ize&39；’的其他名词。如果有任何疑问，请参考C.O.D.和Collins，作者和印刷商字典。下面是一些更常用的词：\n做广告宣传财务总监伪装财务总监，错误地建议财务总监、财务总监、企业财务总监、财务总监、前提顾问、财务总监、企业财务总监(公开)惩戒财务总监、财务总监，对财务总监进行严惩，对财务总监、财务总监、财务总监进行包皮环切，对财务总监行使财务责任行使公开性处分，对财务总监进行严惩不贷、严惩不贷、不遗余力地对财务总监进行包皮环切、对财务总监进行包皮环切、对财务总监行使财务责任进行严惩。专业知识*监督妥协的*特许经营*。\n在分析、催化、瘫痪等词中，-lys­是希腊语的一部分，而不是像-ize这样的后缀。因此，没有与-ize单词平行的拼写，因此-yze的拼写在词源上是错误的，不能使用-除非是遵循美国的印刷风格。\n-ize，-ise 1(-iz)，suf.。形成VBS。W.Senses(I)V.T.。以特定方式对待(质问、垄断)，(2)VI.。遵循特定的实践(哲学化)，有特定的感受(同情)，(3)V.T.。使或进入特定状态(英化、粉碎、挥发)，(4)V.T.。按照(包扎、巴氏杀菌)、(5)V.T.的方法处理或采取行动。浸透、影响或提供\n(氧化、梅毒、附属化)；因此，使之成为一种物质[f.或在F-iser f.ll-izare f.Gk-izare f.LL-izare f.Gk-ize之后]。\n-苏黎世，泽西。形成VBS，意思是尤指。使成为这样(美国化、醚化)。与-ise拼写正确的单词(advertise，shanning&amp；c)的词源不同。[gk-iso.。\n欧内斯特·高尔斯爵士，HMSO 1973(第二个小鬼，1954年第二版原著)。\n在像组织这样的动词和像组织这样的名词应该用s还是z拼写的问题上，权威人士意见不一。在这个国家，有些动词(如adverse，comclude，deside，edulse，exercise和gummise)从来不用z拼写。还有其他的(如组织)，许多人，特别是如果他们接受过古典教育，更喜欢z；但最新的权威人士倾向于认为，在这些情况下，s是允许的。既然如此，最简单的方法就是在所有情况下都使用s，因为这永远不会出错，而z有时会出错。但不要谴责那些在正确的地方使用z的人。*。\n*福勒更为严厉的观点是，在动词是通过使用相当于希腊语后缀-izein的后缀构成的地方，应该始终使用ize(在拉丁化时保留z)，但应该继续使用ise来表示上面引用的那些以不同方式组成的单词。高尔斯在“完全朴素的词语”中明确拒绝了这一观点，但允许它出现在他的修订版福勒的“现代英语用法”中。我认为，他的第一个更宽容的观点显然更可取。我不能认为实现或拉丁化是错误的。B.D.F。\n{Nb.。我查过福勒的“现代英语用法”(第二版)，显然更喜欢这种形式，但这并不令人惊讶，因为它出自牛津克拉伦登出版社(Oxford‘s Clarendon Press)，这种偏好是他们的家居风格的一部分。然而，关于选择的主题的字母顺序的条目构成了一个强有力的理由，同时也引起了人们的注意，它是牛津大学出版社、剑桥大学出版社和泰晤士报的标准格式，读者可以选择自己去查。我应该说，“泰晤士报”最近已经放弃了“雷霆战机”，不过，“雷霆战机”已经今非昔比了。}。\n在像组织这样的动词和像组织这样的名词应该用s还是z拼写的问题上，权威人士意见不一。经合组织支持Universal ize，认为后缀总是起源于希腊语或拉丁语，而且在这两种语言中都是以z拼写的。包括大多数英语印刷商在内的其他权威机构建议使用Universal ise。福勒站在这两种观点之间。他指出，经合组织的建议把问题过于简单化了，因为有些动词(例如，广告、包含、鄙视、锻炼和猜测)在这个国家从来不拼写。另一方面，他说，很难记住这些ISE动词是什么，这是让ISE变得普遍的唯一原因，而牺牲意义来换取轻松似乎是不合理的。这一严酷的结论不会向每个人推荐。这对英语用法的A.B.C.的作者来说并非如此，他们直截了当地说，这里给出的建议是全部以ISE结尾，我尊敬地同意这一判决。\n这个问题长期以来一直受到当局的争议，没有达成一个普遍可以接受的解决方案。学术的份量倾向于区分源于拉丁语或希腊语的单词(-izare，-izein)和起源于法语的单词(-iser)。语音方面的考虑对z有利。\n主题因那些常用的词(广告、惩罚、包含等)而变得复杂。它只能以s结尾。如果我们在有争议的情况下选择z，我们必须牢记这些例外情况，而那些准备抄写和排字的人可以很好地避免这一任务。\n此外，我们发现我们的客户经常不能接受这种风格，这种风格几乎从未接受过，以至于选择这种风格作为我们的基本风格会使作曲室的实践严重复杂化。", "note_en": "There is nothing like a good rant!  It may not \t\t\t\t\t improve the world, and it may not \t\t\t\t\t fix the issue that initiated the rant, but it feels so  good afterwards.\n  This rant is about the suggestion that the use of a ‘z’ in words like nationalization is somehow wrong, or American. It must be admitted that there are words with a ‘z’ in them that are purely American, like advertize, or maybe just wrong, like surmize. Sometimes it is simply error — a word whose spelling is not known, and whose correct spelling is not sought, is arbitrarily given a ‘z’ in the honest but mistaken belief it is correct. Sometimes words with a z-form in American represent an older (perhaps Elizabethan) form of English that made its way to the USA before the language was standardized in England. More likely, the American ‘z’ is one of Noah Webster’s attempts to ‘standardize’ or ‘improve’ American usage of English when he produced his famous dictionary in 1828, in which his decision to make deliberate and extensive revisions of spelling was implemented — he has been described as a great spelling reformer (I also had a go at reforming spelling when I was at school but it wasn’t appreciated). Webster evidently decided to use a ‘z’ wherever he considered the pronunciation called for it. This was a \t\t\t\t\thighly unusual example of a dictionary leading the written \t\t\t\t\tlanguage rather than attempting to reflect it.\n  This polemic is nothing to do with the Americans. If we overlook the various words that the Americans deliberately choose to spell differently, the majority of words that take a ‘z’, or an ‘s’ that is pronounced like a ‘z’, seem to fall very clearly into those that must take an ‘s’ (like  compromise, where the derivation is –misser), those that must take a ‘z’, (like  prize), and the rest, about which controversy apparently rages (if only here).\n  I have been to a great deal of trouble to look into this, looking not only at various text books and style manuals, but also at a range of literature over the years to see which spelling was preferred. I refer only to cases of the \t\t\t\t\tthird type given above where writers  or \t\t\t\t\ttheir publishers have come to regard the \t\t\t\t\tuse of &#39;s&#39; as an acceptable alternative to the &#39;z&#39; (we are \t\t\t\t\tall agreed that misuse of the two other types would be an \t\t\t\t\terror).\n  It seems to me that in books printed in England the use of the ‘z’ overwhelmingly predominated until the Second World War, though on a far smaller scale the ‘s’ can be found used by some printing houses, even in Victorian times. Textbooks set out the correctness of using ‘z’, some of them setting out in considerable detail the rationale for use of ‘s’ or ‘z’ depending on origin. After the Second World War the ‘s’ alternative is more frequently offered as a possibility and some house style manuals (though not Oxford’s) indicate a preference for ‘s’ — not because of any suggestion that ‘z’ is wrong, mark you, but because ‘s’ had come to be tolerated and it avoided having to remember which usage is which. Recent manuals and dictionaries seem to have given up on the prescriptive use of a ‘z’, though it is usually offered as an alternative where correct.\n  It seems to me, summarizing, and using a ‘z’ correctly and non-Americanly, that:\n  On the whole the ‘z’ alternative has nothing whatever to do with America;\n    The ‘s’ principally came into use by those believing it (apparently wrongly) to be correct by analogy with similar words that were current in French, when in fact the English use developed in parallel and came via Latin from the Greek, retaining the ‘z’ throughout (for example &#39;the realization&#39; in English compares with ‘la réalisation’ in French) — in some quarters during the early days of English printing French [recently the language of the Anglo-Norman aristocracy] was regarded as posh;\n  The ‘s’ took hold in comparatively recent years because it was regarded as acceptable (because of the foregoing reason) and because of the hopelessness of training uneducated people correctly to grasp the correct occasion to deploy a ‘z’ or an ‘s’. Note  Tillotson’s House Style (below) where they opine that use of ‘z’ is correct but they have decided to adopt the &#39;s&#39; because it gives rise to less trouble...\n  As the use of the ‘s’ caught on, dictionaries had to follow the trend, and are now quoting it as ‘correct’. It is arguable, but dictionaries do not necessarily promote correct usage, but follow prevailing practice (which is then taken as correct, creating a spiral of decline).\n  For myself, I am very happy to keep using a ‘z’ where it is appropriate, and I do try hard to get it right but must admit to being inconsistent sometimes.  Using the ‘z’ form, of course, invites people to pick me up on it, whence I refer them to the Oxford English Dictionary (the big one) and that generally ends the matter. On the \t\t\t\t\twhole it is not a book to pick a fight with.\n  I suppose even after being presented with the facts there will be people who will persist with the ‘s’ option, and that’s up to them — nothing more I can do. All I ask is that people determined to use the ‘s’ do not regard those using the ‘z’ as using Americanisms!!!\n  Many of the great publishing houses are happy with ‘  -ize’ etc endings, and large, influential organizations such as London Transport invariably used the ‘-  ize’ form in posters and other public communications, though their modern PC-originated material leaves much to be desired.\n  I attach below  (actually it is in the \t\t\t\t\tnext column) various references that shed more light on the matter. Note that some house style guidance which has opted for the &#39;-  ise&#39; form refers to alleged controversy about the more correct spelling about which &#39;the authorities differ&#39;. House style guides are not authorities of themselves, although they may rely on them and refer to them. Of the ‘authorities’ I have sought, they all indicate &#39;-  ize&#39; as etymologically correct and I have not yet found any &#39;authority&#39; that explains how &#39;-  ise&#39; can be correct; if any reader knows of one I&#39;d be glad to hear of it and will be happy to quote it below.\n  And do I feel better? Well as a matter of fact, I rather think I do.\n  -ise, the following end in -ise, not -ize: advertise, affranchise, apprise (to inform), chastise, circumcise, comprise, compromise, demise, despise, devise, disfranchise, disguise, emprise, enfranchise, enterprise, excise, exercise, franchise, improvise, incise, merchandise, premise (vb.), prise (to force open), reprise, seise (law), supervise, surmise, surprise, televise.\n    -ize, the normal suffix added to the stems of nouns in -ism (criticize), -ization (civilize), -izer (appetize), -y (agonize), or to a complete noun (canalize). Many common examples are given in this book.\n    Hart’s Rules for Compositors and Readers at the Oxford University Press, orig by Horace Hart 1893, this edition (37th) 1967\n    THE  -ize, not -ise, ending should be used where both spellings are in use. Generally,  -ize is a suffix applied to the stems of nouns ending in  -ism, -ization, -izer, -y, or to the complete noun.\n  Examples:   agony − agonize   civilization − civilize   appetizer − appetize   criticism − criticize   canal − canalize   transistor − transistorize\n  The ending -ise is correct when the noun has  –is ­as part of the stem, e.g. in the syllables  -vis­ (seeing), -cis- (cutting),  -mis- (putting), and is also used for those nouns which do not terminate in  -ism, -ization, etc. Exceptions are aggrandize­ment/aggrandize, recognition/recognize, and others noted in  C.O.D. as `assimilated to verbs in -ize&#39;. Reference should be made to  C.O.D. and Collins,  Authors&#39; and Printers&#39; Dictionary, if there is any doubt. Some of the more common  -ise words  follow:\n  advertise         disguise            misadvise   advise             emprise            premise   apprise            enterprise        prise (open)   chastise           excise              reprise   circumcise       exercise           revise   comprise         expertise         supervise   compromise     franchise         surmise   demise            improvise        surprise   despise            incise              televise   devise             merchandise    treatise\n  In words such as analyse, catalyse, paralyse,  -lys­is part of the Greek and not a suffix like  -ize. There is therefore no parallel with  -ize words, and consequently the spelling  -yze is etymologically incorrect, and not to be used — except when following American printing style.\n    -ize, -ise 1(-iz), suf. forming vbs. w. senses  (I) v.t. treat in specified way  (catechize, monopolize),(2) v.i. follow specified practice  (philosophize), have specified feeling  (sympathize),(3) v.t. &amp; i. bring or come into specified state  (Anglicize, pulverize, volatilize), (4) v.t.  &amp; i.treat or act according to method of  (bowdlerize, pasteurize), (5) v.t. impregnate with or affect with or provide with\n  (oxidize, syphilize, accessorize); so –ize A&#39;TION, -iZER&#39;, a  sufs.[f. or after  F -iser f.LL  -izare f.Gk -ize].\n    -ize, sur. forming vbs meaning esp.  make or become such (Ameri­canize, etherealize). The words properly spelt with  -ise (advertise, surprise &amp;c.)are of different origin. [Gk  –izo.\n  The Complete Plain Words, Sir Ernest Gowers, HMSO 1973 (2nd imp, 2nd edn of 1954 original work)\n    On the question whether verbs like  organise and nouns like  organi­sation should be spelt with an s or a z the authorities differ. There are some verbs (e.g.  advertise, comprise, despise, advise, exercise and  surmise) which are never spelt with a z in this country. There are others (such as  organize) for which many people, particularly if they have had a classical education, prefer a z; but the latest authorities incline to the view that in these cases s is permissible. This being so, the simplest course is to use an s in all cases, for that will never be wrong, whereas z sometimes will be. But do not condemn those who use a z in its right place.*\n  *Fowler&#39;s more austere view was that  ize should always be used where the verb has been formed by using the suffix equivalent to the Greek suffix  -izein (which retained its z when Latinised), but that  ise should continue to be always used for words such as those quoted above which have been formed in a different way. Gowers specifically rejected this view in  The Complete Plain Words but allowed it to stand in his revised edition of Fowler&#39;s  Modern English Usage. His first, more permissive view is, I think, clearly preferable. I cannot regard  realise or  Latinise as wrong. B.D.F.\n  {NB. I have checked &#39;Fowler&#39;s Modern English Usage, 2nd edn, and the &#39;z&#39; form is clearly preferred, but this is hardly surprising as it emanates from Oxford&#39;s Clarendon Press of which this preference is part of their house style. However the alphabetical entry on the subject of choosing &#39;-  ize&#39; make a powerful case and also draws attention to it being the standard form of the Oxford University Press, Cambridge University Press and  The Times, and readers may choose to look it up for themselves. I should state  The Times has \t\t\t\t\trecently given up on the &#39;z&#39;, but then the Thunderer is not what it \t\t\t\t\twas.}\n      On the question whether verbs like  organise and nouns like organisation should be spelt with an s or a z the authorities differ. The O.E.D. favours universal  ize, arguing that the suffix is always in its origin either Greek or Latin and in both languages it is spelt with a z. Other authorities, including most English printers, recommend universal  ise. Fowler stands between these two opinions. He points out that the O.E.D.&#39;s advice over-simplifies the problem, since there are some verbs (e.g.  advertise, comprise, despise, exercise and  surmise) which are never spelt  ize in this country. On the other hand, he says &#34; the difficulty of remembering which these  ise verbs are is the only reason for making  ise universal, and the sacrifice of significance to ease does not seem justified &#34;. This austere conclusion will not commend itself to everyone. It does not do so to the authors of the  A.B.C. of English Usage, who say roundly &#34; the advice given here is to end them all in  ise &#34;, a verdict with which I respectfully agree.\n      This question has long been disputed by authorities without a generally acceptable solution being reached. The weight of scholarship favours a distinction being made between words of Latin or Greek origin  (-izare, -izein) and of French origin  (-iser). Phonetic considerations favour the z.\n  The subject is complicated by those words in common use  (advertise, chastise, comprise, etc.) which can only take the s ending. If we choose the z in debatable cases we must bear these exceptions in mind, a task which those who prepare copy and set type may well be spared.\n  Further, we find the &#39;z&#39; frequently unacceptable to our customers, the &#39;s&#39; scarcely ever so, that to choose the &#39;z&#39; as our basic style would seriously complicate composing room practice.", "posttime": "2020-08-09 17:47:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ize", "title": "‘-ize’有它！-关于-ise或-ize作为结尾的用法(英国惯例)", "title_en": "The ‘-ize’ have it! – About the use of -ise or -ize as an ending (UK practice)", "transed": 1, "url": "http://www.metadyne.co.uk/ize.html", "via": "", "real_tags": ["ize"]}, {"category": "", "categoryclass": "", "imagename": "3114250181638ad84e88581ca379b021.png", "infoid": 1017169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数代码插件的设计都很糟糕，有些甚至是付费的。该项目旨在通过在Tailwind、Ffltter和SwiftUI中生成响应布局来提高标准。我们的计划是最终增加对Jetpack Compose的支持，可能还会增加对标准HTML或其他框架(如Reaction Native、Bootstrap或Fluent)的支持。欢迎您提供反馈、想法和合作伙伴关系！\n这个插件采用了一种非传统的方法来提高代码质量：它甚至在开始转换到代码之前就优化了布局。标准的图形节点(代表每一层)是一件令人愉快的工作，但是如果不修改用户项目，它就不能修改一个层。出于这个原因，我决定将其虚拟化，重新创建官方实现并将其命名为AltNodes。在将节点转换为AltNode的过程中，插件执行以下操作：\n这个过程也可以看作是一个中间表示，有一天可能允许这个插件生活在Figma之外。\n查找未知对象(具有多个子项且没有垂直或水平对齐的组或框架)时，尾随模式对最佳情况使用插图，对最差情况使用从标准CSS向左、从上到上的插图。颤振模式使用Stack和Positioned.Fill。这两个通常都不推荐，而且很容易就会击败响应能力。在许多情况下，只需将某些元素包装在组或框架中即可解决以下问题：\n提示：您也可以选择单个项目，而不是选择整个页面。这对于调试和组件化都很有用。例如：您可以使用插件生成单个元素的代码，然后使用for循环复制它。\n宽度：顺风的最大宽度为256px。如果项目通过此设置，宽度将设置为w-full(除非它已经是相对的，如w-1/2、w-1/3等)。这通常是一个功能，但要小心：如果项目中的大多数图层大于256px，插件的效果可能不是最优的。\n高度：插件尽可能避免设置高度，因为宽度和高度在CSS中的工作方式不同。H-Full的意思是达到父母的完全高度，但父母必须要有，而W-Full并不要求这样。在实验期间，在大多数情况下，避免固定的高度会带来更好的响应性，并避免不确定的情况。\n对齐：当前项目按照其平均位置在行/列内对齐。TODO：找到改进这一点的方法。\n堆栈：在一些更简单的情况下，可以将堆栈替换为Container和BoxDecation。发现这些案例并对其进行优化。\n材质样式：文字可以与现有材质样式匹配(如当文字大小为20时输出Headline6)。\n识别FlatButton：该插件可以识别特定的按钮并输出它们，而不是总是使用Container或Material。\n项目配置为使用webpack或ROLLUP进行建设。作者找不到在webpack中正确配置Svelte的方法，所以添加了Rollup。但Rollup的稳定性比webpack差很多，在编辑打字文件时，它会在手表模式下定期崩溃。所以，如果你打算只处理打字稿，我再次建议你坚持使用webpack。如果您要在UI中进行更改，您现在需要使用Rollup。\n此自述文件和图标的Figma文件也已打开，欢迎更改！请在这里检查。\n我做出决定时考虑的是它将如何让大多数人受益，但我可以(而且很可能会这样做！)。错了很多次。发现一个窃听器？有改进的主意吗？请随时添加问题或给我发电子邮件。拉取请求也非常受欢迎。", "note_en": "Most  design to code plugins are bad, some are even paid. This project aims to raise the bar by generating  responsive layouts in  Tailwind,  Flutter and  SwiftUI. The plan is to eventually add support for  Jetpack Compose and possibly standard HTML or other frameworks like  React Native,  Bootstrap or  Fluent. Feedback, ideas and partnerships are appreciated!\n   This plugin takes an unconventional approach to improve code quality: it optimizes the layout before the conversion to code even begins. The standard Figma  Nodes (what represents each layer) is a joy to work with, but it can&#39;t modify a layer without modifying the user project. For this reason, I decided to virtualize it, remaking the official implementation and naming them  AltNodes. During the process of converting a  Node into an  AltNode, the plugin does the following:\n  That process can also be seen as an  Intermediate Representation and might allow this plugin to, one day, live outside Figma.\n  When finding the unknown (a  Group or  Frame with more than one child and no vertical or horizontal alignment), Tailwind mode uses  insets for best cases and  left,  top from standard CSS for the worst cases. Flutter mode uses  Stack and  Positioned.fill. Both are usually not recommended and can easily defeat the responsiveness. In many scenarios, just wrapping some elements in a  Group or  Frame can solve:\n  Tip: Instead of selecting the whole page, you can also select individual items. This can be useful for both debugging and componentization. For example: you can use the plugin to generate the code of a single element and then replicate it using a for-loop.\n    Width: Tailwind has a maximum width of 256px. If an item passes this, the width will be set to  w-full (unless it is already relative like  w-1/2,  w-1/3, etc). This is usually a feature, but be careful: if most layers in your project are larger than 256px, the plugin&#39;s result might be less than optimal.\n Height: The plugin avoids setting the height whenever possible, because width and height work differently in CSS.  h-full means get the full height of the parent, but the parent  must have it, while  w-full doesn&#39;t require it. During experiments, avoiding a fixed height, in most cases, brought improved responsiveness and avoided nondeterministic scenarios.\n  Align: currently items are aligned inside a Row/Column according to their average position. Todo: find a way to improve this.\n  Stack: in some simpler cases, a  Stack could be replaced with a  Container and a  BoxDecoration. Discover those cases and optimize them.\n Material Styles: text could be matched to existing Material styles (like outputting  Headline6 when text size is 20).\n Identify FlatButtons: the plugin could identify specific buttons and output them instead of always using  Container or  Material.\n  The project is configured to be built with Webpack or Rollup. The author couldn&#39;t find a way to correctly configure Svelte in Webpack, so Rollup was added. But Rollup is a lot less stable than Webpack and crashes regularly in watch mode when editing Typescript files. So, if you are going to work with Typescript only, I reccommend sticking with Webpack. If you are going to make changes in the UI, you  need to use Rollup for now.\n  The Figma file for this README and icon is also open and welcome to changes!  Check it here.\n I took decisions thinking about how it would benefit the majority of people, but I can (and probably will!) be wrong many times. Found a bug? Have an idea for an improvement? Feel free to  add an issue or email me. Pull requests are also more than welcome.", "posttime": "2020-08-09 17:46:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "flutter,swiftui", "title": "将Figma布局转换为Ffltter、SwiftUI和Tailwind。OSS和99%的测试", "title_en": "Convert Figma Layouts to Flutter, SwiftUI and Tailwind. OSS and 99% Tested", "transed": 1, "url": "https://github.com/bernaferrari/FigmaToCode", "via": "", "real_tags": ["flutter", "swiftui"]}, {"category": "", "categoryclass": "", "imagename": "d62cf9a25cdeeaf1f3f289ee45bbcc83.jpg", "infoid": 1017168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国金融科技iwoca已经获得了1亿GB的资金，以帮助冠状病毒业务中断贷款计划(CBILS)的客户。根据周一(8月3日)的一份公告，该公司打算扩大其CBILS计划，并开始利用筹集的资金接受新的客户申请。\nIwoca表示，银行对通过CBILS寻求财务帮助的公司很感兴趣。因此，他们正在努力应对大量涌入的新应用程序。该公司正寻求与银行合作，以确保公司能够快速获得CBILS融资解决方案。\nIwoca首席执行官兼联合创始人Christoph Rieche在声明中表示：“我们希望给小企业最好的机会，让他们找到他们如此明显需要的支持，这意味着银行必须与我们合作，”iwoca首席执行官兼联合创始人克里斯托夫·里切(Christoph Rieche)在声明中表示。“数千家申请CBILS的企业在没有得到银行决定的情况下被搁置了数周甚至数月，这是不可接受的。\n该公司正在寻求让英国最大的银行将他们无法容纳的业务发送给金融科技的供应商。此外，iwoca指出，自推出反弹银行贷款以来，申请量和批准量之间的差距每周都在扩大。\n另外，iwoca已经推出了iwocaPay服务，旨在通过即时向供应商付款，同时让公司自己付款，来缓解未付发票的挑战。这一推出正值贸易信贷紧缩之际，每四家公司中就有一家担心自己无法经受住当前的经济气候。\n今年3月，iwoca推出了新的OpenLending平台，该平台可以将银行和FinTech连接起来，同时将该公司的贷款能力扩展到可能需要它的200万家英国公司。当时，人们注意到移动应用Monese最近成为了平台的一部分，数字会计技术Xero打算很快加入。\n注册PYMNTS.com时事通讯，获取热门新闻和病毒式热门新闻的最新消息。", "note_en": "U.K. FinTech  iwoca has notched £100 million in funding to help coronavirus business interruption loan scheme (CBILS) clients. The company intends to grow its CBILS program and begin taking new client applications with the financing it raised, according to a Monday (August 3)  announcement.\n iwoca said that banks have experienced much interest from companies looking for financial help via CBILS. As a result, they are grappling with an influx of new applications. The company is looking to work with banks to ensure that companies can gain quick access to the CBILS finance solution.\n “We want to give small businesses the best chance of finding the support they so clearly need, which means the banks must work with us,” iwoca CEO and Co-founder  Christoph Rieche said in the announcement. “It’s not acceptable that thousands of the businesses applying for CBILS are left hanging for weeks or even months without getting a decision from their bank.\n The company is seeking to have the biggest banks in Britain send business that they can’t accommodate to FinTech providers. Additionally, iwoca noted that the gap between the volume of applications and approvals have expanded each week since the rollout of its  Bounce Bank Loans.\n Seperately, iwoca has  rolled out its iwocaPay service, meant to mitigate the challenges of unpaid invoices by instantaneously paying suppliers while letting companies pay on their own time. The rollout comes amid a crunch on trade credit, which has seen one in four companies concerned that they won’t weather the current economic climate.\n In March, iwoca unveiled its new OpenLending platform, which can  connect banks and FinTechs while extending the company’s lending capabilities to the two million British companies that could potentially need it. At the time, it was noted that mobile app Monese recently became a part of the platform, and that digital accounting technology Xero intended to join soon.\n      Sign up for the PYMNTS.com Newsletter to get updates on top stories and viral hits.", "posttime": "2020-08-09 17:20:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,coronavirus,商业,冠状病毒,中小企业", "title": "Iwoca是一家面向中小企业的在线贷款初创公司，它筹集了1亿GB的资金，以支持中小企业通过英国的冠状病毒商业中断贷款计划寻求融资", "title_en": "iwoca, an online lending startup for SMBs, raises £100M to support SMBs looking for financing via the UK's Coronavirus Business Interruption Loan Scheme", "transed": 1, "url": "https://www.pymnts.com/news/b2b-payments/2020/iwoca-notches-100m-to-support-pandemic-relief-loans/", "via": "", "real_tags": ["病毒", "商业", "冠状病毒", "中小企业"]}]