[{"category": "", "categoryclass": "", "imagename": "aa972f31d441db2a786e33a3a85c6c3d.jpg", "infoid": 1015640, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在具有里程碑意义的赛博朋克电影《阿基拉》(Akira)中，关于核破坏的一个诡异的先见之明预示着2020年东京奥运会将被取消。由于不同寻常的巧合，我在3月11日，也就是2011年福岛核灾难的周年纪念日，也是面对面课程的最后一天，在我的“亚洲赛博朋克”课上教授了这部电影。分散学生对阿基拉事件的世界末日转折的注意力，感觉既辛酸又具有讽刺意味。\n但更令人心酸的是，在研究这门课的时候，我又回到了一件我几乎忘了的琐事上：1993年，威廉·吉布森(William Gibson)访问新加坡，为《连线》第二期撰文时，将这个城市国家描述为“被判处死刑的迪士尼乐园”。\n在某些方面，我一点也不惊讶我的兔子洞把我带回了家。当然，我对赛博朋克反乌托邦的兴趣，不同地设定在未来，但总是指向怀旧、肮脏的过去，在我长大的这个小岛上汇聚在一起。新加坡本身就是一个赛博朋克反乌托邦，它为自己成为全球资本主义典范而感到自豪，同时也将其殖民历史视为宝贵的。\nJerrine Tan在新加坡出生和长大。她拥有布朗大学的英语博士学位，目前在芒特霍利奥克学院英语系教授全球英语文学。\n吉布森出现的时候，赛博朋克正在崛起。他里程碑式的小说《神经漫游者》(1984)紧随雷德利·斯科特的《银翼杀手》(1982)之后，排在大藤胜弘的《Akira》(1988)之前，这两部小说都以2019年为背景。30多年来，2019年一直是赛博朋克未来的主要占位符。最近重温了阿基拉，我有了一种神奇的体验。反映在阿基拉的未来主义，压抑的新东京是我的家。未来已经在这里了。\n和新东京一样，我们在新加坡看到的很多东西都是全新的。高耸的摩天大楼预示着天际线，因为不平等支撑着社会。这两个城市都以岛屿的形式存在，依赖于巨大的联系网络；两个城市都是由一个厌恶抗议的无所不在的政府管理的。在他的连线文章中，吉布森将这个岛国称为新加坡有限公司，“由一个外观和感觉都像一家非常大的公司的国家进行微观管理。”事实上，首都是这座城市的命脉。在没有任何自然资源的情况下，新加坡以金融中心的身份存在，并依靠贸易维持自己的生存。新加坡对吉布森文章的免疫反应当然是禁止“连线”。\n在将新加坡描述为迪士尼乐园时，吉布森向法国哲学家让·鲍德里亚(Jean Baudrillard)的Simulacra和模拟致敬。(顺便说一句，Simulacra是“黑客帝国”中唯一一本被适当掏空用作隐藏工具的书，这本书深受神经巫师的影响。)。在拟像中，开始时是真实的图像，最终揭示出图像就是全部。因此，图像不仅掩盖或歪曲了真实，而且揭示了根本不存在真实。吉布森形容“试图在心理上与旧新加坡建立联系的感觉相当痛苦，就好像迪士尼乐园的新奥尔良广场是在实际的法国区原址上建立起来的，在这个过程中把它抹去了，但在它的位置上留下了一个玻璃般的拟像。”2020年，新加坡的情况只会更加如此。\n去年，新加坡开通了蜿蜒的洛尼路高速公路。要竖起它的八条小巷，需要清理广阔的林区，以及武吉布朗公墓(Bukit Brown)，那里埋葬着数千名早期移民的坟墓，可能还有日本占领下受害者的身体。它已被列入世界古迹观察名单，联合国文化权利特别报告员要求保护它，但无济于事。旧的国家图书馆在日本入侵期间曾是英国人的救助站，为了给通勤者节省5分钟的隧道让路，也被拆除了。去年12月回家时，我发现我长大的地方附近的一个心爱的公园被屠杀了-山的一侧被雕刻开了，满是鱼的百合池被填满了。有人告诉我，新的高速公路。作为一个外国人，吉布森暗示，新加坡过去的缺席引发了精神上的痛苦。作为一名公民，眼看着对过去的坚决抹杀，我被张口的鱼所困扰。\n在新加坡，吉布森的“玻璃拟像”如今是真正的玻璃包裹的花朵穹顶，坐落在填海造地的顶部，并在新加坡旅游局的广告和2018年的“疯狂的亚洲富人”(Crazy Rich Asians)中占据显著位置(这也可能是STB的广告)。为了建造它们，数百万吨沙子从邻国运来-象征着新加坡通过蚕食周围的人来保护其对土地稀缺的担忧的脆弱性的永恒工程。土地面积，就像资本积累一样，是一场零和游戏。它还导致现有生态系统的破坏，水土流失，以及其他地方的人民流离失所。滨海湾地区的大部分填海造地都致力于“绿色建筑”--巨大的人造“超级大树”，它们的手指伸向天空，还有未来风格的玻璃穹顶，它们有温控的空间，用来建造美丽的花园，以迎合经济转向生态意识的需要：绿色是绿色的体现。\n这些设施，连同新开放的“宝石”樟宜机场，允许采取虚伪的一步两步。新加坡以花园城市的形象出现，这是在我们名副其实的创造者李光耀的愿景中发展起来的。珠宝看起来像是一个有空调的未来主义天堂。位于商场中心的壮观的生物穹顶号称拥有世界上最高的室内瀑布和一个带有人造雾的“森林谷”。机场综合体吹捧自己是一座生态建筑，利用自然光，使用高科技消化器和微生物将食物垃圾转化为水，就像科幻电影中的东西。但是，如果它不存在，那会有多大的生态价值呢！\n与此同时，新加坡公共快速交通推动了推土机通过Macritchie水库的计划，Macritchie水库是该岛宝贵的自然空间之一。但李光耀对绿色新加坡的愿景总是以经济为导向。对他来说，清洁和绿色将“意味着新加坡是一个组织良好的城市，因此是一个吸引游客和外国投资的好目的地”。这一幻想在“宝石樟宜”中得到了体现：“自然景观”，如瀑布“汇丰雨涡”和森林“资生堂森林谷”，都是以它们的企业赞助商的名字命名的。\n为了建造人工的、游客友好的绿色天堂而摧毁健康的红树林和蓬勃发展的社区，这具有讽刺意味，这令人恼火，但也很能说明问题。对鲍德里亚来说，迪斯尼乐园的存在并不是为了逃避现实，而是为了揭露任何现实的缺失。新加坡在很多方面也变成了纯粹的拟像。许多旅行者巧妙地将自己标榜为理想的“中途停留”目的地，为无聊的游客提供按小时计时的滑稽表演，但他们从未体验过机场以外的新加坡。2018年，《纽约时报》在新加坡刊登了一期《36小时》。这是不是太宽泛了？2019年，《泰晤士报》的新加坡体验已经成为一次“新加坡樟宜机场27小时假期”。作为这个国家首屈一指的提炼者，珍珠樟宜也可以是新加坡。它的网站甚至吹嘘说，“你甚至可以在新加坡樟宜机场住上一个星期，而不需要走出杂乱无章的航站楼。”随着新冠肺炎摧毁航空业和旅游业，迫使家庭和社会重新考虑自己的价值观，新加坡人将不得不考虑，这些面向公众的空洞商业噱头对我们的民族自豪感有多重要。\n一个高度安全的“储存和展示”设施设在机场的免税区，被称为新加坡自由港，这也是鲍德里亚后现代论点的例证。在里面，有价值的美术作品隐藏着，永远不会被看到。它还不如不存在。艺术是资本，而不是艺术。在设施的前面是一座38米长的雕塑，Cage Sans Frontieres(无边界笼子)，这是一个无稽之谈的名字，因为它是一个无关紧要的网状结构，没有任何东西可以区分开来。层层无意义的无意义。\n新加坡目前的声誉是最近才出现的现象，建立在其他地方不景气的经济体的支持上。当我2007年第一次来到美国时，人们会问我，他们是会因为嚼口香糖而被绞死(你不会)，还是会因为吸毒而面临死刑(你可能会)。在2008年美国金融危机和随后的欧元崩溃之后，新加坡的侵犯人权行为对世界来说变得不那么重要了，因为这个城市国家开始成为资本主义持续胜利的象征。现在，我无意间听到哈佛商学院(Harvard Business School)的学生每隔一秒就在吹嘘他们在新加坡实习期间的“棒球时光”。事实上，“泰晤士报”对樟宜机场的评论惊叹不已，尽管它注意到了“幻想与反乌托邦”之间的“细微差别”。“疯狂的亚洲富人”的成功一直是这个城市国家最好的广告宣传活动，以至于全球想象中的新加坡都是由豪华酒店、令人难以置信的摩天大楼，以及，嗯，疯狂的亚洲富人组成的。新加坡当时还没有\n如果我们从过去寻找对未来的警告，我们就会理解Joy所说的新加坡“诗意的天际线”的阴暗意味。在气候灾难的边缘，我们必须知道，无节制的增长将使我们所有人都陷入贫困。走向绿色必须是实实在在的，我们不能为了资本积累的空洞梦想而坚持下去。\n“连线”杂志派吉布森去新加坡，看看干净的反乌托邦是否代表着我们的科技未来。25年后，答案是响亮的“是”。吉布森指出，新加坡对自己的IT愿景是“一个连贯的信息城市，它的架构是从头开始规划的。”他们预计整个数据高速公路都会流入和流经他们的城市。“。这听起来像是对赛博朋克反乌托邦的描述，令人不寒而栗。但吉布森猜测，如果新加坡被证明是正确的，真正的悲剧是“真正被证明的将是非常可悲的事情；而且不是关于新加坡，而是关于我们的种族。”他们将证明，通过积极压制言论自由是有可能蓬勃发展的。他们将证明，信息不一定想要免费。“。\n今天，许多辛勤工作的新加坡人响亮地选择了一个承诺经济稳定的政府，尽管审查法律变得越来越严格，不平等现象普遍存在。吉布森自责他的悲观情绪，开玩笑说“也许新加坡的命运将会变成一个自鸣得意的、新瑞士的秩序和繁荣的飞地。”在以日内瓦为灵感的新加坡自由港和与瑞士匹敌的私人银行体系之间，似乎在许多方面，我们已经到达了这个未来。我们不仅来了，而且已经来了，因为世界将新加坡视为乌托邦的反乌托邦，就是对晚期资本主义本身的拥抱。\n但吉布森并不完全正确。新加坡被自己的人民称为小红点，这是一个全国性的笑话。这是一个笑话，因为对它的人民来说，新加坡和它的可能性总是超出了它的地理面积。旧的新加坡还在那里，尽管它正在迅速褪色。在小印度的塞朗贡路(Serangoon Road)沿线泰普桑(Thaipusam)庆祝活动的嘈杂声中，印度教礼拜者与他们的卡瓦迪(Kavadis)跳舞；在清真寺像卷烟一样升起的祈祷中，在朦胧的橙色潮湿黄昏中消散；在Buah Keluak Peranakan的祖母们为饥饿的孙女们做准备。\n新加坡的自我概念与赛博朋克的悖论一样，既包括传统的，也包括后现代的。我们在我们殖民历史的脚下恳求，同时我们相信自己是本土的，像希腊神话中那样，从龙牙中冒出来--白手起家，因此没有过去。这个比喻在岛上的地质学中是字面意义的：龙齿门是新加坡港口的一个地质特征，指引着古代的水手。它被英国人摧毁了。\n新加坡一直以回文的形式存在：一系列模糊的历史堆积得如此之深，以至于来历似乎遥不可及。毕竟，这个岛最受人喜爱的起源故事是一个神话：一位印尼王子启航，在一场令人眼花缭乱的暴风雨中，在一个岛屿上看到了一只辛加(狮子)，并将其命名为新加坡狮城。东南亚没有狮子。这个民族国家的象征是一头鱼尾狮，一种起源混合的神话生物：一半是狮子，一半是鱼-同时它的存在超出了世俗的可能性。\n从吉布森(Gibson)到“银翼杀手”(Blade Runner)，再到以未来(2019年)为背景的阿基拉(Akira)，现在已经过去了，也就是新加坡的“两百周年”，这是英国人登陆新加坡200周年的奇怪庆祝活动，标志着我们的出生具有明确的殖民性，以突出“我们现在所处的位置”(一个脱离过去的现在，因此患有健忘症和近视)，我突然意识到，未来已经到来。新加坡一直是为那些记得它的人而存在的，但如果一个国家不重视记忆，那么它的身份就岌岌可危。我发现自己坐在我的公寓里，被隔离在马萨诸塞州西部，迷失了方向，迷失了方向。想家，想家。\n《连线观点》发表外部撰稿人的文章，代表了广泛的观点。点击此处阅读更多观点。提交一篇专栏文章，电子邮件地址为：tOptions@wired.com。\n🎙️收听“连线”，这是我们关于未来如何实现的新播客。收看最新剧集，订阅📩时事通讯，跟上我们所有节目的最新动态。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "An eerily prescient moment in the landmark cyberpunk film  Akira about nuclear destruction predicts the cancellation of the 2020 Tokyo Olympics. By preternatural coincidence, I taught the film in my “Cyberpunk in Asia” class on March 11—the anniversary of the 2011 Fukushima nuclear disaster, and the last day of in-person classes. Distracting students from an apocalyptic turn of events with  Akira felt both poignant and ironic.\n But more poignant, while researching the class, I was returned to a piece of trivia I had almost forgot: Upon visiting Singapore for an essay in WIRED’s second-ever issue in 1993, William Gibson described the city-state as “ Disneyland with the Death Penalty.”\n In some ways, I wasn’t at all surprised my rabbit hole led me, well, home. Of course my interest in cyberpunk dystopias, divergently set in the future, yet always gesturing to a nostalgic, grimy past, converges in the tiny island I grew up on. A cyberpunk dystopia itself, Singapore takes pride in its emergence as a global capitalist exemplar while treating its colonial past as precious.\n Jerrine Tan was born and raised in Singapore. She has a PhD in English from Brown University and currently teaches Global Anglophone Literature in the English department at Mount Holyoke College.\n Gibson emerged just as cyberpunk was on the rise. His landmark novel  Neuromancer (1984) followed Ridley Scott’s  Blade Runner (1982) and preceded Katsuhiro Otomo’s  Akira (1988), which are both set in 2019. For over 30 years, the year 2019 served as cyberpunk’s primary placeholder for the future. Rewatching  Akira recently, I had an experience with the uncanny. Reflected in  Akira’s futuristic, oppressive Neo Tokyo was my home. The future was already here.\n  Like Neo Tokyo, much of what we see of Singapore is brand spanking new. Towering skyscrapers adumbrate the skyline as inequality undergirds society. Both cities exist as islands that rely on vast networks of connections; both are run by an all-seeing government with a distaste for protest. In his WIRED essay, Gibson refers to the island country as Singapore Ltd., “micromanaged by a state that has the look and feel of a very large corporation.” Indeed, capital is the city’s lifeblood. Without any natural resources, Singapore exists as a financial hub and relies on trade to sustain itself. Singapore’s immune reaction to Gibson’s piece was, of course, to ban WIRED.\n  In describing Singapore as Disneyland, Gibson pays homage to French philosopher Jean Baudrillard’s  Simulacra and Simulations. (Incidentally,  Simulacra is the only book—fittingly hollowed out to be used as a tool of concealment—featured in  The Matrix, which was heavily influenced by  Neuromancer.) In the simulacrum, what begins as an image of the real eventually reveals that the image  is all there is. Ergo, the image does not merely conceal or distort the real, but reveals that there is no real at all. Gibson describes “the sensation of trying to connect psychically with the old Singapore [as] rather painful, as though Disneyland&#39;s New Orleans Square had been erected on the site of the actual French Quarter, obliterating it in the process but leaving in its place a glassy simulacrum.” In 2020, this is only more true of Singapore.\n  Last year, Singapore opened the snaking Lornie Road Highway. Erecting its eight lanes required clearing vast forested areas as well as the Bukit Brown cemetery, which housed thousands of grave sites of early migrants, and possibly the bodies of victims of the Japanese Occupation. It had been placed on the World Monuments Watch list, and the United Nations special rapporteur for cultural rights had demanded it be preserved, to no avail. The old National Library, which served as an aid station for the British during the Japanese invasion, was also demolished to make way for a tunnel that would save commuters five minutes. Visiting home last December, I found that a beloved park near where I grew up had been butchered—one side of the hill carved open, the lily pond full of fish filled in.  New expressway, I was told. As a foreigner, Gibson intimated that the absence of the past in Singapore incited psychic pain. As a citizen, watching a resolute obliteration of the past in progress, I am haunted by gaping fish.\n  In Singapore, Gibson’s “glassy simulacra” are today actual glass-encased flower domes sitting atop reclaimed land and feature prominently in Singapore Tourism Board ads and in 2018’s  Crazy Rich Asians (which may as well have been an STB ad). To build them, millions of metric tons of sand were shipped from  neighboring countries—emblematic of Singapore’s eternal project to protect the fragility of its anxieties around land scarcity by cannibalizing those around it. Land mass, like capital accumulation, is a zero-sum game. It’s also led to the  destruction of existing ecosystems, soil erosion, and displacement of peoples elsewhere. Much of the reclaimed land in the Marina Bay area has been dedicated to “green structures”—colossal man-made “super trees” that reach their grotesque steely fingers skyward, and futuristic glass domes with temperature-controlled spaces for beautiful gardens which pander to an economic turn toward eco-consciousness:  There is green to be made from going green.\n These fixtures, along with the newly opened megamall that is “Jewel” Changi Airport, allow for a hypocritical one-two step. Singapore presents itself as a Garden City, developed in the vision of our veritable Creator, Lee Kwan Yew. Jewel looks like a futuristic paradise with air-conditioning. The spectacular bio-dome in the heart of the mall boasts the world’s tallest indoor waterfall and a “forest valley” with manufactured fog. The airport complex touts itself as an eco-building, making use of natural light and using high-tech digesters and microbes to turn food waste into water, like something out of a sci-fi movie. But how much more ecological if it didn’t exist!\n Meanwhile, the Singapore Mass Rapid Transit pushed for plans to bulldoze through Macritchie reservoir, one of the island’s precious natural spaces. But Lee’s vision for a green Singapore was always economically oriented. To him, being clean and green would “signify that Singapore was a well-organized city and hence a good destination for tourists and  foreign investments.” This fantasy has been literalized in Jewel Changi: The clunkily named “natural features” like the waterfall, “HSBC Rain Vortex,” and the forest, “Shiseido Forest Valley,” are named after their corporate sponsors.\n  The irony of destroying healthy mangroves and thriving communities in order to build artificial, tourist-friendly green paradises is galling, but also telling. For Baudrillard, Disneyland exists not to offer a reprieve from reality, but to lay bare the absence of any reality at all. Singapore has also become pure simulacrum in so many ways. Deftly selling itself as an ideal “stopover” destination, a by-the-hour burlesque show for bored tourists, many travelers never experience Singapore beyond the airport. In 2018  The New York Times ran a “36 Hours” installment in Singapore. Was this too broad? In 2019, the  Times’ Singapore experience had become a “27-Hour Vacation in Singapore’s Changi Airport.” As the country’s prime synecdoche, Jewel Changi may as well  be Singapore. Its website even boasts, “You might even be able to live in Singapore’s Changi Airport for a week without stepping out of the sprawling terminals.” As Covid-19 decimates the airline and tourism industries and forces families and societies to reconsider their values, Singaporeans will have to reckon with just how important these hollow public-facing commercial gimmicks are to our national pride.\n  A high-security “storage and display” facility housed in the airport’s duty-free zone, known as Freeport Singapore, also exemplifies Baudrillard’s postmodern argument made flesh. Within, valuable fine art is hidden, never to be seen. It might as well not exist. Art persists as capital and not art. At the front of the facility is a 38-meter-long sculpture,  Cage Sans Frontieres (cage without borders), a nonsensical name for a latticework of gaps that separates nothing from nothing. Layers of meaninglessness upon meaninglessness.\n Singapore’s current reputation is a recent phenomenon, built on the backs of ailing economies elsewhere. When I first arrived in America in 2007, people would ask me if they would be hanged for chewing gum (you will not) or face the death penalty for doing drugs (you might). In the wake of the 2008 financial crisis in America, and then the crumbling of the Euro, Singapore’s human rights infringements became less important to the world as the city-state emerged as a symbol of persistent capitalistic triumph. Now I overhear every second Harvard Business School student brag about the “baller time” they had during an internship in Singapore. Indeed, the  Times&#39; review of Changi Airport gasps in wonder even as it observes the “fine line” between “fantasy and dystopia.” The success of  Crazy Rich Asians has been the city-state’s best advertising campaign, such that the Singapore of the global imagination is made of luxury hotels, incredible skyscrapers, and, well, crazy rich Asians. Singapore was the fifth-most-visited city in the world in 2018 (fourth in terms of tourist spending)—no small feat for a country that spans 26 miles across. The purpose of Disneyland, according to Baudrillard, is to “feed reality … to a town whose mystery is precisely that it is nothing more than a network of endless, unreal circulation.” Baudrillard was referring to Los Angeles. Today, Singapore serves as the Disneyland to the  world.\n Singapore lends itself well to fantasy. HBO’s wildly successful sci-fi series  Westworld, about a theme park populated by androids, filmed much of its third season on the tropical island. The abused and exploited robots escape the theme park and emerge into the real world that seems even more frightening and twisted, a world represented by Singapore.  Westworld cocreator Lisa Joy  exalted “the ways in which nature entangle [sic] with modernity” in Singapore. “Looking through the lens of a camera, you’re always able to appreciate the beauty of things even more.”\n  Looking at Singapore is tantamount to looking at it  through a lens. My country is  photogenic—defined by and therefore reduced to façade. But how can we deny the Disneyland reference when Singapore has invited one and all to hop on for a ride? The authoritarian leader Robert Mugabe was a frequent visitor to Singapore for medical treatment and recently died in the country. Singapore was eager to host the 2018 Trump-Kim summit, which a local politician called an “incredible branding opportunity.” But perhaps the writers of  Westworld  do understand the absurdity of the dystopia of their imagination—in other words, the absurdity of Singapore. In one episode, Maeve, one of the android hosts, wakes up in a ludicrously ostentatious bar, glances around with amused contempt, and says, “Another simulation? Well, this one&#39;s a bit over the top.” The antagonist responds unfazed: “No, Maeve. This is Singapore.”\n If we looked to the past for warnings about the future, we would understand the darker overtones of what Joy calls Singapore’s “poetic skyline.” At the brink of climate catastrophe, we must know that unchecked growth will doom us all to destitution. Going green has to be  for real, and we cannot afford to hold onto the hollow dream of capital accumulation for its own sake.\n  WIRED sent Gibson to Singapore to see if the &#34;clean dystopia represents our techno future.&#34; A quarter century later, the answer is a resounding yes. Gibson noted Singapore’s IT vision for itself, to be “a coherent city of information, its architecture planned from the ground up. And they expect that whole highways of data will flow into and through their city.” This sounds chillingly like descriptions of cyberpunk dystopias. But the real tragedy if Singapore proved to be right, Gibson surmised, was that “what will really be proven will be something very sad; and not about Singapore, but about our species. They will have proven it possible to flourish through the active repression of free expression. They will have proven that information does not necessarily want to be free.”\n Many hardworking Singaporeans today resoundingly choose a government that promises economic stability even as censorship laws become more and more stringent and inequality is rife. Gibson chides himself for his pessimism, joking that “perhaps Singapore&#39;s destiny will be to become nothing more than a smug, neo-Swiss enclave of order and prosperity.” Between the Geneva-inspired Freeport Singapore and a private banking system that rivals Switzerland&#39;s, it seems that on many fronts, we have arrived in this future. Not only have we arrived, it has  already come to pass, for the world’s embracing of Singapore as a utopian dystopia is the embracing of late-stage capitalism itself.\n But Gibson is not entirely correct. It is a national joke that Singapore is known to its own people as the Little Red Dot. It is a joke because to its people, Singapore and its possibilities have always exceeded its geographic size. The old Singapore is still there, though it is fading fast. It is there in the cacophony of Thaipusam celebrations along Serangoon Road of Little India, Hindu worshippers dancing with their Kavadis; in the prayers that rise like coils of smoke from mosques and dissipate in the hazy orange humid dusk; in the  buah keluak Peranakan grandmothers prepare for hungry granddaughters.\n Singapore’s self-conception shares the paradox of cyberpunk, embracing both the traditional and postmodern. We supplicate at the feet of our colonial past at the same time we believe ourselves autochthonous, springing out of the ground from dragon’s teeth as in the Greek myth—self-made and therefore without past. This metaphor is literalized in the island’s geology itself: The Dragon’s Teeth Gate was a geological feature of the Singapore harbor that guided ancient mariners. It was destroyed by the British.\n Singapore has always existed as a palimpsest: a collection of gauzy histories layered so heavily that an origin seems beyond reach. The island’s most beloved origin story, after all, is one of myth: An Indonesian prince sets sail and in a blinding storm, sees a  Singa (lion) on an island, and names it  Singapura, Lion City. No lions exist in Southeast Asia. The nation state’s symbol is a merlion, a mythical creature of mixed origin: part lion, part fish—of this world at the same time that its existence exceeds worldly possibilities.\n From Gibson to  Blade Runner to  Akira, set in the future (2019), which is now already the past, the year of Singapore’s “bicentennial,” that odd celebration of 200 years since the British landed on the island, marking our birth as definitively colonial, to highlight “where we are now” (a present unmoored from the past and therefore amnesiac and myopic), it dawns on me that the future has already come to pass. Singapore has always been there for those who remember it, but if a country sets no store by memory, then its very identity is at stake. I find myself sitting in my apartment, quarantined in western Massachusetts, disoriented and lost. Homesick and sick of home.\n  WIRED Opinion  publishes articles by outside contributors representing a wide range of viewpoints. Read more opinions  here. Submit an op-ed at  opinion@wired.com.\n   🎙️ Listen to  Get WIRED, our new podcast about how the future is realized. Catch the  latest episodes and subscribe to the 📩  newsletter to keep up with all our shows\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-08-02 02:32:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "幻想,cyberpunk,新加坡", "title": "新加坡的幻想与赛博朋克未来主义", "title_en": "The Fantasy and the Cyberpunk Futurism of Singapore", "transed": 1, "url": "https://www.wired.com/story/opinion-the-fantasy-and-the-cyberpunk-futurism-of-singapore", "via": "", "real_tags": ["幻想", "cyberpunk", "新加坡"]}, {"category": "", "categoryclass": "", "imagename": "a614fe6b36dca769e520038278fd713d.png", "infoid": 1015639, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年中，几乎所有的IOS内核攻击都遵循相同的高级流程：内存损坏和假的MACH端口被用来访问内核任务端口，这为用户空间提供了理想的内核读/写原语。最近的IOS内核漏洞利用缓解措施(如PAC和zone_Required)似乎倾向于打破一遍又一遍的规范技术来实现此漏洞利用流程。但是，这么多iOS内核漏洞从高层看起来是一样的，这一事实引出了一些问题：以内核任务端口为目标真的是最好的漏洞利用流吗？或者，在这一战略上的趋同是否掩盖了其他可能更有趣的技术？对于其他以前未见过的漏洞攻击流，现有的IOS内核缓解措施是否同样有效？\n在这篇博客文章中，我将描述一种新的IOS内核利用技术，它可以将一个字节控制的堆溢出直接转变为任意物理地址的读/写原语，同时完全避开当前的缓解措施，如KASLR、PAC和Zone_Required。通过读取特殊的硬件寄存器，可以在物理内存中定位内核，并在没有假内核任务端口的情况下构建内核读/写原语。最后，我将讨论各种IOS缓解措施在阻止这项技术方面有多有效，并对IOS内核利用的最新技术进行思考。您可以在这里找到概念验证代码。\n在浏览XNU资源时，我经常留意有趣的对象，以便为将来的攻击进行操纵或破坏。在发现CVE-2020-3837(OOB_TIMESTAMP漏洞)后不久，我偶然发现了vm_map_copy_t的定义：\n该结构一开始就有一个类型字段，因此越界写入可能会将其从一种类型更改为另一种类型，从而导致类型混淆。因为IOS是小端的，所以最低有效字节在内存中排在第一位，这意味着即使是单字节溢出也足以将类型设置为三个值中的任何一个。\n该类型区分任意控制数据(Kdata)和内核指针(hdr和object)之间的联合。因此，破坏类型可以让我们直接伪造指向内核对象的指针，而无需执行任何重新分配。\n我记得在过去的漏洞攻击中(在iOS10之前)读到过关于vm_map_copy_t被用作有趣的原语的报道，尽管我记不清它是在哪里使用的，也不记得它是如何使用的。Ian Beer在拆分XNU中的原子时也使用了vm_map_copy对象。\n因此，VM_MAP_COPY看起来可能是一个有趣的损坏目标；然而，只有当代码以真正有趣的方式使用它时，它才真正有趣。\n深入研究osfmk/vm/vm_map.c，我发现vm_map_copy out_Internal()确实以一种非常有趣的方式使用了复制对象。但首先，让我们更多地谈谈什么是VM_MAP_COPY以及它是如何工作的。\nVM_MAP_COPY表示进程的虚拟地址空间的写入时复制切片，该切片已打包，准备插入到另一个虚拟地址空间中。有三种可能的内部表示：作为VM_MAP_ENTRY对象的列表、作为VM_OBJECT或作为要直接复制到目标的内联字节数组。我们将重点介绍类型1和类型3。\n从根本上说，ENTRY_LIST类型是最强大和通用的表示形式，而KERNEL_BUFFER类型严格意义上是一种优化。VM_MAP_ENTRY列表由几个分配和几个间接层组成：每个VM_MAP_ENTRY描述由特定VM_OBJECT映射的虚拟地址范围[VME_START，VME_END]，该特定VM_OBJECT又包含描述支持VM_OBJECT的物理页的VM_PAGE列表。\n同时，如果要插入的数据不是共享内存，并且大小大约为两页或更少，则只需过度分配VM_MAP_COPY，即可在同一分配中以内联方式保存数据内容，无需间接或进一步分配。\n这种优化的结果是，偏移量0x20处的VM_MAP_COPY对象的8个字节可以是指向VM_MAP_ENTRY列表头部的指针，也可以是完全由攻击者控制的数据，这一切都取决于开头的类型字段。因此，损坏VM_MAP_COPY对象的第一个字节会导致内核将任意控制的数据解释为VM_MAP_ENTRY指针。\n了解了VM_MAP_COPY内部机制之后，让我们回到VM_MAP_COPYOUT_INTERNAL()。此函数负责获取vm_map_copy并将其插入到目标地址空间(由类型vm_map_t表示)。在进程之间共享内存时，可以通过在MACH消息中发送脱机内存描述符来实现：脱机内存作为VM_MAP_COPY存储在内核中，而VM_MAP_COPYOUT_INTERNAL()是将其插入到接收方进程中的函数。\n事实证明，如果VM_MAP_COPYOUT_INTERNAL()处理包含指向假VM_MAP_ENTRY层次结构的指针的损坏的VM_MAP_COPY，事情就会变得相当令人兴奋。具体地说，请考虑如果伪VM_MAP_ENTRY声称已连接会发生什么情况，这会导致函数立即尝试在页面中出错：\n我们处理连接了VM_MAP_ENTRY的情况，因此应该立即出现故障：\n设置后，我们循环访问有线条目中的每个虚拟地址。因为我们控制伪VM_MAP_ENTRY的内容，所以我们可以控制读取的对象指针(VM_OBJECT类型)和偏移值：\n我们查找需要连接的每个物理内存页面的VM_PAGE结构。由于我们控制伪VM_OBJECT和偏移量，因此可以使vm_page_lookup()返回指向我们控制其内容的伪VM_PAGE结构的指针：\n对vm_faultenter()的调用相当复杂，所以我不会把代码放在这里。可以说，通过适当设置伪对象中的字段，可以使用伪VM_PAGE对象导航VM_FAULT_ENTER()，以便使用完全任意的物理页码调用PMAP_ENTER_OPTIONS()：\nPmap_enter_options()负责修改目的地的页表，以插入将建立从虚拟地址到物理地址的映射的转换表项。类似于VM_MAP如何管理地址空间的虚拟映射的状态，PMAP结构管理地址空间的物理映射(即页表)的状态。并且根据osfmk/arm/pmap.c中的源，在添加转换表条目之前，不对所提供的物理页号执行进一步的验证。\n因此，我们损坏的vm_map_copy对象实际上给了我们一个非常强大的原语：将任意物理内存直接映射到用户空间中的进程中！\n我决定在iOS13.3的OOB_TIMESTAMP利用提供的内核读/写原语之上构建vm_map_copy物理内存映射技术的POC。这主要有两个原因。\n首先，我没有一个好的bug来用它来开发一个完整的漏洞。尽管我最初是在试图利用OOB_TIMESTAMP bug时偶然想到这个想法的，但很快就发现这个bug不太适合这项技术。\n其次，我想独立于实现该技术所使用的一个或多个漏洞来评估该技术。看起来这项技术很有可能是确定性的(也就是说，没有失败的情况)；在不可靠的漏洞之上实现它将使单独评估变得困难。\n该技术最自然地适合在任何分配器区域kalloc.80到kalloc.32768(即，65和32768字节之间的通用分配)中受控的单字节线性堆溢出。为便于在本文的其余部分引用，我将简单地将其称为单字节利用技术。\n我们已经介绍了上述技术的要点：创建一个包含指向伪VM_MAP_ENTRY列表的指针的KERNEL_BUFFER类型的VM_MAP_COPY，破坏类型为ENTRY_LIST，使用VM_MAP_COPYOUT_INTERNAL()接收它，并将任意物理内存映射到我们的地址空间。但是，成功利用该漏洞要稍微复杂一些：\n我们需要确保调用VM_MAP_COPYOUT_INTERNAL()的内核线程在映射物理页后不会崩溃、死机或死锁。\n映射一个物理页很好，但可能不足以实现任意内核读/写。这是因为：\n内核缓存在物理内存中的确切加载地址是未知的，因此我们不能在没有首先找到它的情况下直接映射它的任何特定页面。\n可能某些硬件设备公开了一个MMIO接口，该接口本身强大到足以构建某种读/写原语；但是，我不知道有任何这样组件。\n因此，我们将需要映射多个物理地址，并且最有可能需要使用从一个映射中读取的数据来查找要用于另一个映射的物理地址。这意味着我们的映射原语不能是一次性的。\n在for循环之后调用vm_map_copy_insert()尝试将vm_map_copy()转移到vm_map_copy_zone。如果给定最初类型为KERNEL_BUFFER的VM_MAP_COPY，这将导致死机，因为最初使用kalloc()分配KERNEL_BUFFER对象。因此，安全地脱离for循环并恢复正常操作的唯一方法是首先获得内核读/写，然后修补内核中的状态以防止这种死机。\n单字节技术的一个重要前提是在已知地址创建一个假的VM_MAP_ENTRY对象层次结构。因为我们已经在OOB_TIMESTAMP上构建了这个POC，所以我决定利用我在利用该bug时学到的一个巧妙技巧。在现实世界中，除了一个字节溢出之外，可能还需要另一个漏洞来泄漏内核地址。\n在为OOB_TIMESTAMP开发POC时，我了解到AGXAccelerator内核扩展提供了一个非常有趣的原语：IOAccelSharedUserClient2和IOAccelCommandQueue2一起允许创建在用户空间和内核之间共享的大量可分页内存区域。在开发利用漏洞时，访问用户/内核共享内存非常有用，因为您可以在那里放置虚假的内核数据结构，并在内核访问它们时对其进行操作。当然，这个AGXAccelerator原语并不是获取内核/用户共享内存的唯一方法；例如，物理映射还将大部分DRAM映射到虚拟内存，因此它还可以用于将用户空间内存内容反映到内核中。然而，AGXAccelerator原语在实践中通常要方便得多：首先，它在更受限的地址范围内提供了非常大的连续共享内存区；其次，它更容易泄漏相邻对象的地址来定位它。\n现在，在iPhone7之前，iOS设备不支持特权访问(PAN)安全功能。这意味着所有的用户空间实际上都是与内核共享的内存，您只需覆盖内核中的指针就可以指向用户空间中的假数据结构。\n但是，现代IOS设备启用PAN，因此内核直接访问用户空间内存的尝试将失败。这就是AGXAccelerator共享内存原语的存在如此有用的原因：如果您可以建立一个大的共享内存区域并在内核中获知它的地址，那基本上等同于关闭了PAN。\n当然，这句话的一个关键部分是了解它在内核中的地址。这样做通常需要一个漏洞和一些努力。相反，因为我们已经依赖于OOB_TIMESTAMP，所以我们将简单地对共享内存地址进行硬编码，并注意动态查找地址留给读者进行练习。\n有了内核读/写和用户/内核共享内存缓冲区，我们就可以编写POC了。利用漏洞的总体流程基本上就是上面概述的内容。\n我们在共享内存中初始化一个假的VM_MAP_ENTRY列表。条目列表包含3个条目：就绪条目、映射条目和完成条目。这些条目一起表示每个映射操作的当前状态。\n我们在MACH消息中向保持端口发送包含伪VM_MAP_HEADER的脱机内存描述符。脱机内存作为KERNEL_BUFFER(值3)类型的VM_MAP_COPY对象存储在内核中。\n我们模拟一个单字节的线性堆溢出，破坏VM_MAP_COPY的TYPE字段，将其更改为ENTRY_LIST(值1)。\n我们启动一个线程，该线程接收在保持端口上排队的MACH消息。这会在损坏的VM_MAP_COPY上触发对VM_MAP_COPYOUT_INTERNAL()的调用。\n由于VM_MAP_ENTRY列表的初始配置方式，VM_MAP_COPYOUT线程将在&#34；Done&#34；条目上无限循环旋转，以便我们操作它。\n此时，我们有一个正在旋转的内核线程，准备映射我们请求的任何物理页面。\n要映射页面，我们首先将&#34；Ready&34；条目设置为链接到自身，然后将&#34；Done&#34；条目设置为链接到&#34；Ready&#34；条目。这将导致VM_MAP_COPYOUT线程启动&#34；Ready&#34；。\n在旋转&#34；Ready&#34；时，我们将&#34；Mapping&#34；条目标记为连接了单个物理页面，并将其链接到我们链接到其自身的&#34；Done&#34；条目。我们还填充伪VM_OBJECT和VM_PAGE以映射所需的物理页码。\n然后，我们可以通过将&#34；Ready&#34；条目链接到&#34；Mapping&#34；条目来执行映射。VM_MAP_COPYOUT_INTERNAL()将在页面中映射，然后在&#34；Done&#34；条目上旋转，表示完成。\n这为我们提供了一个可重用的原语，它可以将任意物理地址映射到我们的进程中。作为概念的初步验证，我映射了不存在的物理地址0x414140000并尝试从其读取，从而触发了来自EL0的LLC总线错误：\n在这一点上，我们已经证明了映射原语是可靠的，但是我们仍然不知道如何处理它。\n我的第一个想法是，最简单的方法是在内存中查找内核缓存映像。请注意，在现代iPhone上，即使使用直接物理读/写原语，KTRR也会阻止我们修改内核映像的锁定部分，因此我们不能只修补内核的可执行代码。但是，内核缓存映像的某些段在运行时仍然是可写的，包括包含sysctls的__data段部分。由于sysctls以前曾用于构建读/写原语，因此这感觉像是一条稳定的前进道路。\n接下来的挑战是使用映射原语在物理内存中定位kernelcache，这样就可以将sysctl结构映射到用户空间并进行修改。\n但首先，在我们弄清楚如何定位kernelcache之前，先了解一下iPhone11Pro上的物理内存的一些背景知识。\nIPhone11Pro有4 GB的DRAM，物理地址为0x800000000，因此物理DRAM地址跨度为0x800000000到0x900000000。其中，0x801b80000到0x8ec9b4000的范围保留给应用程序处理器(AP)，它是运行XNU内核和应用程序的电话的主处理器。此区域之外的内存保留给协处理器，如Always On Processor(AOP)、Apple NeuroEngine(ANE)、SIO(可能是Apple SmartIO)、AVE、ISP、IOP等。这些区域和其他区域的地址可以通过解析设备树或通过在DRAM开始时转储iBoot切换区域来找到。\n在引导时，kernelcache被连续加载到物理内存中，这意味着找到单个kernelcache页就足以定位整个映像。此外，虽然KASLR可能会在虚拟内存中滑动大量的kernelcache，但物理内存中的加载地址非常有限：在我的测试中，内核头始终加载在0x805000000到0x807000000之间的地址，范围仅为32MB。\n结果是，这个范围小于内核缓存本身的0x23d4000字节，即35.8MB。因此，我们可以在运行时确定地址0x807000000包含一个kernelcache页。\n死机(CPU4调用者0xfffffff0156f0c98)：&#34；PMAP_ENTER_OPTIONS_INTERNAL：页面属于ppl，&#34；&#34；pmap=0xfffff031a581d0，v=0x3bb844000，pn=2103160，PROT=0x3，FAULT_TYPE=0x3，FLAGS=0x0，WIRED=1，OPTIONS=0x1&#34；\n此死机字符串声称来自函数PMAP_ENTER_OPTIONS_INTERNAL()，该函数位于XNU(osfmk/arm/pmap.c)的开源部分，但在源代码中并不存在死机。因此，我在kernelcache中颠倒了PMAP_ENTER_OPTIONS_INTERNAL()的版本，以确定发生了什么。\n我了解到的问题是，我试图映射的特定页面是苹果页面保护层(PPL)的一部分，PPL是XNU内核的一部分，用于管理页表，被认为比内核的其余部分更有特权。PPL的目标是防止攻击者修改受保护的页(特别是共同设计的二进制文件的可执行代码页)，即使在危害内核以获得读/写功能之后也是如此。\n为了强制保护页面不能被修改，PPL必须保护页表和页表元数据。因此，当我试图将受PPL保护的页面映射到用户空间时，引发了恐慌。\nPPL的存在使物理映射原语的使用变得非常复杂，因为尝试映射受PPL保护的页面将会死机。并且kernelcache本身包含许多受PPL保护的页面，将连续的35MB二进制文件分割成不再连接内核缓存的物理幻灯片的更小的无PPL的块。因此，我们不再可以(安全地)映射保证为内核缓存页的单个物理地址。\n美联社DRAM地区的其余部分也是同样危险的雷区。物理页面被抓取以供PPL使用，并根据需要返回给内核，因此在运行时，PPL页面像地雷一样散布在物理内存中。因此，任何地方都没有保证不会爆炸的静态地址。\n然而，这并不完全正确。应用程序处理器的DRAM区域可能是雷区，但它之外的任何东西都不是雷区。这包括协处理器使用的DRAM以及系统的任何其他可寻址组件，例如通常通过内存映射I/O(MMIO)访问的系统组件的硬件寄存器。\n有了这样一个强大的原语，我希望有太多的技术可以用来构建读/写原语。我希望通过利用对特殊硬件寄存器和协处理器的直接访问，可以做很多聪明的事情。不幸的是，这不是我非常熟悉的领域，所以我在这里只描述一次绕过PPL的(失败的)尝试。\n我的想法是控制一些协处理器，同时使用协处理器和AP上的执行来攻击内核。首先，我们使用物理映射原语修改DRAM中存储协处理器数据的部分，以便在该协处理器上执行代码。接下来，回到主处理器上，我们第二次使用映射原语来映射和禁用协处理器的Dev。\n.", "note_en": "For the last several years, nearly all iOS kernel exploits have followed the same high-level flow: memory corruption and fake Mach ports are used to gain access to the kernel task port, which provides an ideal kernel read/write primitive to userspace. Recent iOS kernel exploit mitigations like PAC and zone_require seem geared towards breaking the canonical techniques seen over and over again to achieve this exploit flow. But the fact that so many iOS kernel exploits look identical from a high level begs questions: Is targeting the kernel task port really the best exploit flow? Or has the convergence on this strategy obscured other, perhaps more interesting, techniques? And are existing iOS kernel mitigations equally effective against other, previously unseen exploit flows?\n   In this blog post, I&#39;ll describe a new iOS kernel exploitation technique that turns a one-byte controlled heap overflow directly into a read/write primitive for arbitrary physical addresses, all while completely sidestepping current mitigations such as KASLR, PAC, and zone_require. By reading a special hardware register, it&#39;s possible to locate the kernel in physical memory and build a kernel read/write primitive without a fake kernel task port. I&#39;ll conclude by discussing how effective various iOS mitigations were or could be at blocking this technique and by musing on the state-of-the-art of iOS kernel exploitation. You can find the proof-of-concept code   here .\n   While looking through the XNU sources, I often keep an eye out for interesting objects to manipulate or corrupt for future exploits. Soon after discovering   CVE-2020-3837  (the oob_timestamp vulnerability), I stumbled across the definition of  vm_map_copy_t :\n                     The structure has a type field at the very start, so an out-of-bounds write could change it from one type to another, leading to type confusion. Because iOS is little-endian, the least significant byte comes first in memory, meaning that even a single-byte overflow would be sufficient to set the type to any of the three values.\n The type discriminates a union between arbitrary controlled data ( kdata ) and kernel pointers ( hdr  and  object ). Thus, corrupting the type could let us directly fake pointers to kernel objects without needing to perform any reallocations.\n I remembered reading about  vm_map_copy_t  being used as an interesting primitive in past exploits (before iOS 10), though I couldn&#39;t remember where or how it was used.  vm_map_copy  objects were also used by Ian Beer in   Splitting atoms in XNU .\n   So,  vm_map_copy  looks like a possibly interesting target for corruption; however, it&#39;s only truly interesting if the code uses it in a truly interesting way.\n   Digging through  osfmk/vm/vm_map.c , I found that  vm_map_copyout_internal()  does indeed use the copy object in a very interesting way. But first, let&#39;s talk a little more about what  vm_map_copy  is and how it works.\n   A  vm_map_copy  represents a copy-on-write slice of a process&#39;s virtual address space which has been packaged up, ready to be inserted into another virtual address space. There are three possible internal representations: as a list of  vm_map_entry  objects, as a  vm_object , or as an inline array of bytes to be directly copied into the destination. We&#39;ll focus on types 1 and 3.\n   Fundamentally, the  ENTRY_LIST  type is the most powerful and general representation, while the  KERNEL_BUFFER  type is strictly an optimization. A  vm_map_entry  list consists of several allocations and several layers of indirection: each  vm_map_entry  describes a virtual address range [ vme_start ,  vme_end ) that is being mapped by a specific  vm_object , which in turn contains a list of  vm_page s describing the physical pages backing the  vm_object .\n       Meanwhile, if the data being inserted is not shared memory and if the size is roughly two pages or less, then the  vm_map_copy  is simply over-allocated to hold the data contents inline in the same allocation, no indirection or further allocations required.\n       As a consequence of this optimization, the 8 bytes of the  vm_map_copy  object at offset  0x20  can be either a pointer to the head of a  vm_map_entry  list, or fully attacker-controlled data, all depending on the type field at the start. So corrupting the first byte of a  vm_map_copy  object causes the kernel to interpret arbitrary controlled data as a  vm_map_entry  pointer.\n       With this understanding of  vm_map_copy  internals, let&#39;s turn back to  vm_map_copyout_internal() . This function is responsible for taking a  vm_map_copy  and inserting it into the destination address space (represented by type  vm_map_t ). It is reachable when sharing memory between processes by sending an out-of-line memory descriptor in a Mach message: the out-of-line memory is stored in the kernel as a  vm_map_copy , and  vm_map_copyout_internal()  is the function that inserts it into the receiver&#39;s process.\n   As it turns out, things get rather exciting if  vm_map_copyout_internal()  processes a corrupted  vm_map_copy  containing a pointer to a fake  vm_map_entry  hierarchy. In particular, consider what happens if the fake  vm_map_entry  claims to be wired, which causes the function to try to fault in the page immediately:\n                                                                                                      We handle the case where the  vm_map_entry  is wired and should thus be faulted in immediately:\n      When set, we loop over every virtual address in the wired entry. Since we control the contents of the fake  vm_map_entry , we can control the object pointer (of type  vm_object ) and offset value that are read:\n         We look up the  vm_page  struct for each physical page of memory that needs to be wired in. Since we control the fake  vm_object  and the offset, we can cause  vm_page_lookup()  to return a pointer to a fake  vm_page  struct whose contents we control:\n                      The call to  vm_fault_enter()  is rather complicated, so I won&#39;t put the code here. Suffice to say, by setting fields in our fake objects appropriately, it is possible to navigate  vm_fault_enter()  with a fake  vm_page  object in order to reach a call to  pmap_enter_options()  with a completely arbitrary physical page number:\n                pmap_enter_options()  is responsible for modifying the page tables of the destination to insert the translation table entry that will establish a mapping from a virtual address to a physical address. Analogously to how  vm_map  manages the state for the virtual mappings of an address space, the  pmap  struct manages the state for the physical mappings (i.e. page tables) of an address space. And according to the sources in  osfmk/arm/pmap.c , no further validation is performed on the supplied physical page number before the translation table entry is added.\n   Thus, our corrupted  vm_map_copy  object actually gives us an incredibly powerful primitive: mapping arbitrary physical memory directly into our process in userspace!\n      I decided to build the POC for the  vm_map_copy  physical memory mapping technique on top of the kernel read/write primitive provided by the   oob_timestamp exploit  for iOS 13.3. There were two primary reasons for this.\n   First, I did not have a good bug available to develop a complete exploit with it. Even though I had initially stumbled upon the idea while trying to exploit the oob_timestamp bug, it quickly became apparent that that bug wasn&#39;t a good fit for this technique.\n   Second, I wanted to evaluate the technique independently of the vulnerability or vulnerabilities used to achieve it. It seemed that there was a good chance that the technique could be made deterministic (that is, without a failure case); implementing it on top of an unreliable vulnerability would make it hard to evaluate separately.\n   This technique most naturally fits a controlled one-byte linear heap overflow in any of the allocator zones  kalloc.80  through  kalloc.32768  (i.e., general-purpose allocations of between 65 and 32768 bytes). For ease of reference in the rest of this post, I&#39;ll simply call it the one-byte exploit technique.\n  We&#39;ve already laid out the bones of the technique above: create a  vm_map_copy  of type  KERNEL_BUFFER  containing a pointer to a fake  vm_map_entry  list, corrupt the type to  ENTRY_LIST , receive it with  vm_map_copyout_internal() , and get arbitrary physical memory mapped into our address space. However, successful exploitation is a little bit more complicated:\n   We need to ensure that the kernel thread that calls  vm_map_copyout_internal()  does not crash, panic, or deadlock after mapping the physical page.\n   Mapping one physical page is great, but probably not sufficient by itself to achieve arbitrary kernel read/write. This is because:\n   The kernelcache&#39;s exact load address in physical memory is unknown, so we cannot map any specific page of it directly without locating it first.\n It is possible that some hardware device exposes an MMIO interface that is powerful enough by itself to build some sort of read/write primitive; however, I&#39;m not aware of any such component.\n Thus, we will need to map more than one physical address, and most likely we will need to use data read from one mapping to find the physical address to use for another. This means our mapping primitive can not be one-shot.\n   The call to  vm_map_copy_insert()  after the for loop tries to  zfree()  the  vm_map_copy  to the  vm_map_copy_zone . This will panic given a  vm_map_copy  originally of type  KERNEL_BUFFER , since  KERNEL_BUFFER  objects are initially allocated using  kalloc() .     Thus, the only way to safely break out of the for loop and resume normal operation is to first get kernel read/write and then patch up state in the kernel to prevent this panic.\n     An important prerequisite for the one-byte technique is to create a fake  vm_map_entry  object hierarchy at a known address. Since we are already building this POC on oob_timestamp, I decided to leverage a neat trick I picked up while exploiting that bug. In the real world, another vulnerability in addition to the one-byte overflow might be needed to leak a kernel address.\n   While developing the POC for oob_timestamp, I learned that the AGXAccelerator kernel extension provides a very interesting primitive:  IOAccelSharedUserClient2  and  IOAccelCommandQueue2  together allow the creation of large regions of pageable memory shared between userspace and the kernel. Having access to user/kernel shared memory can be extremely helpful when developing exploits, since you can place fake kernel data structures there and manipulate them while the kernel accesses them. Of course, this AGXAccelerator primitive is not the only way to get kernel/user shared memory; the physmap, for example, also maps most of DRAM into virtual memory, so it can also be used to reflect userspace memory contents into the kernel. However, the AGXAccelerator primitive is often much more convenient in practice: for one, it provides a very large contiguous shared memory region in a much more constrained address range; and for two, it&#39;s easier to leak addresses of adjacent objects to locate it.\n   Now, before the iPhone 7, iOS devices did not support the Privileged Access Never (PAN) security feature. This meant that all of userspace was effectively shared memory with the kernel, and you could just overwrite pointers in the kernel to point to fake data structures in userspace.\n   However, modern iOS devices enable PAN, so attempts by the kernel to directly access userspace memory will fault. This is what makes the existence of the AGXAccelerator shared memory primitive so useful: if you can establish a large shared memory region and learn its address in the kernel, that&#39;s basically equivalent to having PAN turned off.\n   Of course, a key part of that sentence is &#34;and learn its address in the kernel&#34;; doing that usually requires a vulnerability and some effort. Instead, as we already rely on oob_timestamp, we will simply hardcode the shared memory address and note that finding the address dynamically is left as an exercise for the reader.\n  With kernel read/write and a user/kernel shared memory buffer in hand, we are ready to write the POC. The overall flow of the exploit is essentially what was outlined above.\n      We initialize a fake  vm_map_entry  list inside the shared memory. The entry list contains 3 entries: a &#34;ready&#34; entry, a &#34;mapping&#34; entry, and a &#34;done&#34; entry. Together these entries will represent the current state of each mapping operation.\n       We send an out-of-line memory descriptor containing a fake  vm_map_header  in a Mach message to a holding port. The out-of-line memory is stored in the kernel as a  vm_map_copy  object of type  KERNEL_BUFFER  (value  3 ).\n       We simulate a one-byte linear heap overflow that corrupts the  type  field of the  vm_map_copy , changing it to  ENTRY_LIST  (value  1 ).\n       We start a thread that receives the Mach message queued on the holding port. This triggers a call to  vm_map_copyout_internal()  on the corrupted  vm_map_copy .\n   Due to the way the  vm_map_entry  list was initially configured, the  vm_map_copyout  thread will spin in an infinite loop on the &#34;done&#34; entry, ready for us to manipulate it.\n       At this point, we have a kernel thread that is spinning ready to map any physical page we request.\n   To map a page, we first set the &#34;ready&#34; entry to link to itself, and then set the &#34;done&#34; entry to link to the &#34;ready&#34; entry. This will cause the  vm_map_copyout  thread to spin on &#34;ready&#34;.\n       While spinning on &#34;ready&#34;, we mark the &#34;mapping&#34; entry as wired with a single physical page and link it to the &#34;done&#34; entry, which we link to itself. We also populate the fake  vm_object  and  vm_page  to map the desired physical page number.\n       Then, we can perform the mapping by linking the &#34;ready&#34; entry to the &#34;mapping&#34; entry.  vm_map_copyout_internal()  will map in the page and then spin on the &#34;done&#34; entry, signaling completion.\n       This gives us a reusable primitive that maps arbitrary physical addresses into our process. As an initial proof of concept, I mapped the non-existent physical address  0x414140000  and tried to read from it, triggering an LLC bus error from EL0:\n      At this point we have proved that the mapping primitive is sound, but we still don&#39;t know what to do with it.\n   My first thought was that the easiest approach would be to go after the kernelcache image in memory. Note that on modern iPhones, even with a direct physical read/write primitive,   KTRR  prevents us from modifying the locked down portions of the kernel image, so we can&#39;t just patch the kernel&#39;s executable code. However, certain segments of the kernelcache image remain writable at runtime, including the part of the __DATA segment that contains sysctls. Since sysctls have been (ab)used before to build read/write primitives, this felt like a stable path forward.\n   The challenge was then to use the mapping primitive to locate the kernelcache in physical memory, so that the sysctl structs could then be mapped into userspace and modified.\n   But first, before we figure out how to locate the kernelcache, some background on physical memory on the iPhone 11 Pro.\n   The iPhone 11 Pro has 4 GB of DRAM based at physical address  0x800000000 , so physical DRAM addresses span  0x800000000  to  0x900000000 . Of this, the range  0x801b80000  to  0x8ec9b4000  is reserved for the Application Processor (AP), the main processor of the phone which runs the XNU kernel and applications. Memory outside this region is reserved for coprocessors like the Always On Processor (AOP), Apple Neural Engine (ANE), SIO (possibly Apple SmartIO), AVE, ISP, IOP, etc. The addresses of these and other regions can be found by parsing the   devicetree  or by dumping the iboot-handoff region at the start of DRAM.\n       At boot time, the kernelcache is loaded contiguously into physical memory, which means that finding a single kernelcache page is sufficient to locate the whole image. Also, while KASLR may slide the kernelcache by a large amount in virtual memory, the load address in physical memory is quite constrained: in my testing, the kernel header was always loaded at an address between  0x805000000  and  0x807000000 , a range of just 32 MB.\n   As it turns out, this range is smaller than the kernelcache itself at  0x23d4000  bytes, or 35.8 MB. Thus, we can be certain at runtime that address  0x807000000  contains a kernelcache page.\n      panic(cpu 4 caller 0xfffffff0156f0c98): &#34;pmap_enter_options_internal: page belongs to PPL, &#34; &#34;pmap=0xfffffff031a581d0, v=0x3bb844000, pn=2103160, prot=0x3, fault_type=0x3, flags=0x0, wired=1, options=0x1&#34;\n   This panic string purports to come from the function  pmap_enter_options_internal() , which is in the open-source part of XNU ( osfmk/arm/pmap.c ), and yet the panic is not present in the sources. Thus, I reversed the version of  pmap_enter_options_internal()  in the kernelcache to figure out what was happening.\n   The issue, I learned, is that the specific page I was trying to map was part of Apple&#39;s   Page Protection Layer  (PPL), a portion of the XNU kernel that manages page tables and that is considered even more privileged than the rest of the kernel. The goal of PPL is to prevent an attacker from modifying protected pages (in particular, executable code pages for codesigned binaries) even after compromising the kernel to obtain a read/write capability.\n   In order to enforce that protected pages cannot be modified, PPL must protect page tables and page table metadata. Thus, when I tried to map a PPL-protected page into userspace, it triggered a panic.\n             The presence of PPL significantly complicates use of the physical mapping primitive, since trying to map a PPL-protected page will panic. And the kernelcache itself contains many PPL-protected pages, splitting the contiguous 35 MB binary into smaller PPL-free chunks that no longer bridge the physical slide of the kernelcache. Thus, there is no longer a single physical address we can (safely) map that is guaranteed to be a kernelcache page.\n   And the rest of the AP&#39;s DRAM region is an equally treacherous minefield. Physical pages are grabbed for use by PPL and returned to the kernel as-needed, and so at runtime PPL pages are scattered throughout physical memory like mines. Thus, there is no static address anywhere that is guaranteed not to blow up.\n       Yet, that&#39;s not quite true. The Application Processor&#39;s DRAM region might be a minefield, but anything outside of it is not. That includes the DRAM used by coprocessors and also any other addressable components of the system, such as hardware registers for system components that are typically accessed via memory-mapped I/O (  MMIO ).\n   With such a powerful primitive, I expect that there are a plethora of techniques that could be used to build a read/write primitive. And I expect that there are many clever things that could be done by leveraging direct access to special hardware registers and coprocessors. Unfortunately, this is not an area with which I&#39;m very familiar, so I&#39;ll just describe one (failed) attempt to bypass PPL here.\n   The idea I had was to take control of some coprocessor and use execution on both the coprocessor and the AP together to attack the kernel. First, we use the physical mapping primitive to modify the part of DRAM storing data for a coprocessor in order to get code execution on that coprocessor. Next, back on the main processor, we use the mapping primitive a second time to map and disable the coprocessor&#39;s Dev\n......", "posttime": "2020-08-02 02:31:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字节,byte,内核", "title": "一个字节来统治它们", "title_en": "One Byte to rule them all", "transed": 1, "url": "https://googleprojectzero.blogspot.com/2020/07/one-byte-to-rule-them-all.html", "via": "", "real_tags": ["字节", "byte", "内核"]}, {"category": "", "categoryclass": "", "imagename": "1bb89aaa5e15bad0a5970e49cb571d61.png", "infoid": 1015638, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "某些Word功能无法在Google Docs中显示，如果您进行更改，这些功能将被删除", "note_en": "Some Word features can&#39;t be displayed in Google Docs and will be dropped if you make changes", "posttime": "2020-08-02 02:30:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放弃,give,功能", "title": "给自己的提示-永远不要放弃你的梦想", "title_en": "Note to self – never give up on your dreams", "transed": 1, "url": "https://docs.google.com/document/d/1HOol4Jw1uMgIxc8hj23Fx0H_mPAo_a67JcdRt_hJM3M/edit?usp=sharing", "via": "", "real_tags": ["放弃", "give", "功能"]}, {"category": "", "categoryclass": "", "imagename": "cd9d96e851d37f2e1dc2a1472f02d0ce.jpg", "infoid": 1015637, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不确定性是衡量信息和评估预测准确性的关键。它由概率P决定，在P=0.5时最大，在概率较高和较低时减小。使用不同的刺激来表示奖励的概率，我们发现多巴胺神经元的相位激活在整个概率范围内单调变化，支持了过去的说法，即这种反应编码了预测的和实际的奖励之间的差异。相比之下，以前没有观察到的反应与不确定性是一致的，包括活动逐渐增加，直到潜在的奖励时间。不确定性的编码表明多巴胺信号可能在基于注意力的学习和冒险行为中发挥作用。", "note_en": "Uncertainty is critical in the measure of information and in assessing the accuracy of predictions. It is determined by probability P , being maximal at P = 0.5 and decreasing at higher and lower probabilities. Using distinct stimuli to indicate the probability of reward, we found that the phasic activation of dopamine neurons varied monotonically across the full range of probabilities, supporting past claims that this response codes the discrepancy between predicted and actual reward. In contrast, a previously unobserved response covaried with uncertainty and consisted of a gradual increase in activity until the potential time of reward. The coding of uncertainty suggests a possible role for dopamine signals in attention-based learning and risk-taking behavior.", "posttime": "2020-08-02 02:30:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经元,coding,奖励", "title": "多巴胺神经元对奖励概率和不确定性的离散编码(2003)", "title_en": "Discrete Coding of Reward Probability and Uncertainty by Dopamine Neurons (2003)", "transed": 1, "url": "https://science.sciencemag.org/content/299/5614/1898", "via": "", "real_tags": ["神经元", "coding", "奖励"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015636, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“真正的创新来自角色和想法的交叉授粉”-Sunil，[电子邮件受保护]。\n我已经在Buffer远程工作6年了。作为一名软件工程师，我认为我们必须具备的关键技能之一就是能够持续学习。然而，在一个完全分散的团队中工作，跨越10多个时区。我住在亚洲(UTC+8)，而我的大多数队友都住在美国或欧洲。这是长达15小时的时差。我们一年只见一次面。与我身处实体办公室相比，这种远程SETIP会影响我们向我的团队学习的方式。\n在目前的新冠肺炎危机中，当公司突然从家里转到工作时，了解团队中知识共享的动态是多么重要。你不会希望共享的知识被阻止的。我将列出我们一些成功的实验，它们的利弊，以及我认为对我和我们公司有效的方法。\n在偏远的团队中，我们不会像在实体办公室那样有规律的随机机会聚在一起。对话将集中在您当前的团队对话频道中。除了你的核心团队之外，你不能在饮水机/咖啡机上谈论你目前的问题。你会错过与其他团队讨论他们的挑战、展示你的专业知识、向别人学习其他团队的经验/建议的机会。我们停止了尽可能多的学习，因为我们再也见不到对方了。\n作为一家远程公司，您如何克服这一挑战？无论哪个时区，你如何优化知识共享？这就是3年前由Sunil引入的Buffer定期零食聊天的概念诞生的地方。\n零食聊天是每个人都可以在公司里提议的小谈话。它可以是任何主题，从代码、架构、管理、工具提示到辅助项目。什么都行，真的。我们通常在闲置时询问，如果您有足够的兴趣，您就承诺并准备它。下面是一个关于将Datadog日志与APM一起使用的Tgran询问兴趣的示例：\n下面是哈米什在“GitHub行动简介”上闲聊的一个很好的例子：\n把它们录下来，如果人们不能出席，以后就能看到它们\n就像视频通话、摆出一张脸一样，能亲切地接触到一些“技术性”的东西，看到有人笑着、担心地笑着，这是很棒的。\n零食聊天的缺点是需要相当多的精力来准备。询问你可能想要展示的话题是否不会引起同事的足够兴趣，这也可能会让人感到害怕。在偏远的环境中，人们会试图最大限度地利用他们的时间，而我们可能大部分时间都在忙于优先事项。你设定的时间可能不是最适合每个人的。我没能参加大部分的零食聊天，因为我和公司里的大多数人住在完全不同的时区。这里的小贴士是，一定要录下你的点心聊天，并将其转发给不能参加的人。\n我个人喜欢做的另一种形式是通过截屏视频“自发”分享知识。我在基础设施，在那里产品工程师可能不一定需要了解“幕后”发生了什么，但在那里知识可能是有用的或挑起他们的好奇心。\n零食聊天需要准备，我知道我不会擅长“现场”演示。\n我比较内向。询问利益需要相当多的精力，担心人们是否。当我觉得这是一种适合我并且我很满意的方式时，就分享。\n我对创造有教育意义的内容的羡慕并不总是始终如一的。有些日子我会更愿意与人分享，有些日子我不会喜欢。\n我喜欢用织布机。它们使录制您的屏幕和声音变得非常容易。它还可以让你暂停录音，aslso有一个令人印象深刻的在线编辑器来填补你的空白。\n尽量保持视频的动感，切中要害，避免乱七八糟的东西，但要保留笑话\n当我知道一段视频从长远来看会很有价值时，我会尝试做一些谷歌幻灯片来组织这段视频。\n在下面的示例中，我想(不是第一次)展示使用我们的一个内部库来使调试更快、更容易的好处：\n一张图片胜过千言万语，但一张GIF更值钱。它可以为您或您的团队节省大量时间，为您节省一些上下文切换，并节省您的工作效率。当有人有问题，或者你想解释一些复杂的事情时，一个简单的GIF解决方案将远远超过试图打电话并解释它。\n我喜欢使用CloudApp。例如，在将服务从PHP迁移到Golang之后，当我想要共享结果时，我将在这里分享以下内容：\n在Buffer，我们有一个鼓励知识共享的Engineerig框架。要达到“高级工程师2”，其中一个标准是…。“跨域教育”或“联系缓冲区内外的其他团队分享知识”。我的意思不是说钱应该是激励，但是，我个人认为这是进入下一步的条件之一，但后来开始越来越享受它。我现在这样做是因为我现在看到了它的价值，而其他团队成员告诉我，我的视频有多有价值。\n鼓励继续分享的另一个很好的方法是接触那些分享他们的知识很有帮助的人。例如，Jose告诉我，他正在使用我的视频进行将来的MongoDB升级：\n通过松弛或电子邮件分享链接很棒，但这些内容很容易丢失。你不应该假设你的团队看到了你分享过的视频。我建议维护一个目录(在Concept/Paper/Wiki等…中)。。当您在视频中看到已回答的问题时，请再次共享该问题。当你的团队看到越来越多的人分享他们的知识时，自然会产生滚雪球效应。\n问你，你有什么秘诀让你的团队保持在远程设置中？“黑客新闻”评析\n关注@Eric_khun", "note_en": "“True innovation comes an intersection of a cross-pollination of roles and ideas” -  Sunil,  [email protected]\n I’ve been working remotely at  Buffer for 6 years now. As a software engineer, one of the critical skill I believe we  should  must have is being able to learn continuously. However, working in a fully distributed team,  splitted accross 10+ timezones. I live in Asia (UTC +8) while most of my teamates live in US or Europe. That’s up to 15 hours difference. We only meet each other  once a year. This remote setip affects how we learn from my team, compared to if I were in a physical office.\n With the current COVID-19 crisis, when company suddenly switched to a work from home setup, understanding how the dynamic of knowledge sharig in your team is important. You don’t want the knowledge shared being stopped. I’ll lay down some of our successful experiments, their pros and cons, what I think works for me and our company.\n  In a remote team, we don’t have regular random opportunities to come together like we would in a physical office. Conversations will be focused within your current team conversation channel. You won’t be able talk over the watercooler/coffee machine about your current issues with someone else than your core team. You’ll miss opportunities to talk with other teams about their challenges, bring up your expertise, and learn from someone else experiences/advices from an other team. We stop learning as much as we could because we’re not seing each other anymore.\n As a remote company, how can you overcome this challenge? How do you optimize knowledge sharing, no matter which timezone?This is where the concept of regular snackchats at Buffer was born 3 years ago, introduced by  Sunil.\n  Snackchats are small talks that everyone can propose in the company. It can be any topics, from code, architecture, management, tips for a tool to side projects. Anything really. We usually ask on slack, and if you there is enough interest, you commit to it and prepare it.Here an example of  Tigran asking interest on using Datadog Logs with APM together:\n  Here a great example of snackchat by  Hamish on an “Intro to GitHub Actions”:\n     Record them, people will be able to see them later if they can’t attend\n   Like video call, putting a face, it’s great to have a human touch to something “technical” to see someones smilling, worrying.\n  The downside of snackchat is that takes quite a bit of energy to prepare. There can also be intimidating to ask if a topic you might want to present won’t get enough interest from your workmates.In a remote setting, people will try to make the best use of their time, and we might most of the time be busy on prioritties. The time you will set might not be the best fit for everyone. I wasn’t able to participate to most of the snackchats because I live in a total different timezone than most of the people in the company. The tip here is to  make sure to record your snackchat and repost it for people who couldn’t attend them.\n  An other format I personally enjoy doing is the “spontaneous” knowlege sharing with a screencast . I’m in the Infrastructure, where product engineers might not necessarly have the need to understand what happens “behind the scene”, but where the knowledge could be useful or pick their curiosity.\n  Snackchats requires preparations, and I know I will not be great at “live” presentations\n I’m more in the introvert side. It require quite a bit of energy to ask interests, worrying if people. Sharing when I feel like it is a way that fits me and I’m satisfied with.\n My envy to create educative content isn’t always consistent. There is some days where I will be more encline to share it and some where I’ll not feel like it.\n  I like using  Loom. They make recording your screen and voice really easy. It also allows you to pause the recording, and aslso has an impressive online editor to trim your blanks.\n Try to keep the video dynamic, go to the point, and avoid the fluff, but keep the jokes\n  When I know a video will be valuable on the long term, I try to do some Google slide to structure the video\n Here an example where I wanted to show (not the first time) the benefits of using one of our internal librarie to make debuguing faster and easier:\n   1 picture is worth a thousand words, but 1 GIF worth a lot more. It can save you or your teamates a lot of time, save you some context switching, and save your productivity. When someone has a question, or you want to explain something complicated, a simple GIF of the solution will be more than enough than trying to make on a call and explain it.\n I enjoy using  cloudapp. For example here what I’ll share when I wanted to share the results after migrating a service from PHP to Golang:\n   At Buffer, we have an  engineerig framework that encourage kowledge sharing. To reach a “Senior Engineer 2”, One of the criteria would be… “educates across domain” or “Reach out to other teams within and beyond Buffer to share knowledge”. I don’t mean that money should be the incentive, but , I’ve personally because it was one of the condition to reach the next step, but then started to enjoy it more and more. I’m now doing it because I see value in it now whe other teamate tells me how valuable are my videos.\n An other great way to encourange to continue sharing is to reach people who share that their knowledge were helpful. Here for example  Jose telling me he is using my video for a future mongoDB upgrade:\n   Sharing links via Slack or email are great, but those content get easily lost. You shouldn’t make assumptions your teamates saw the video you’ve shared once. I recommend to maintain a directory (in Notion/Paper/Wiki etc…). When you see a question that was answered in one of your video, share it again. A natural snowball effect will happen when your teamates will see more and more people sharing their knowledge.\n  Over to you, what’s your secrets on keeping your team in a remote setup?  Comment on Hacker News\n    Follow @eric_khun", "posttime": "2020-08-02 02:30:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时区,knowledge,团队", "title": "在远程团队中跨时区共享知识", "title_en": "Sharing Knowledge in a Remote team, across Timezones", "transed": 1, "url": "https://erickhun.com/posts/sharing-knowledge-in-a-remote-team/", "via": "", "real_tags": ["时区", "knowledge", "团队"]}, {"category": "", "categoryclass": "", "imagename": "2a0143dbc1436f9735a49214097c80e5.jpg", "infoid": 1015635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着津巴布韦前总统罗伯特·加布里埃尔·穆加贝(Robert Gabriel Mugabe)的逝世，这个南部非洲国家再次成为聚光灯下的焦点。关于穆加贝的遗产有多好(或有多坏)的问题已经被问到了，取决于你问的是谁，津巴布韦是一个伟大的国家还是曾经是一个可怕的国家。同样复杂的情绪也适用，特别是当你向南非人询问罗伯特·穆加贝(Robert Mugabe)的时候。\n因此，我认为最好赶上一个我认为比我更了解津巴布韦的人。我认识伊曼纽尔·班达已经有好几年了，他是我经常光顾的一家我最喜欢的餐厅的服务员。但伊曼纽尔不仅仅是一名服务员，他还负责南非民主变革运动(MDC)的选举和招募工作。\n伊曼纽尔1981年出生在布拉瓦约，他在姆波波马马布特维尼尘土飞扬的街道上长大，当时他也在上学。\n他在布拉瓦约长大，随着津巴布韦生活变得艰难，他注意到了变化，最终逃往南非的故事提供了一个相当微妙的生活视角，从20世纪90年代末到2007年。用他的话说，他见证了一个国家从繁荣到商店货架上没有食物，更重要的是，他悲伤地观察到他的朋友和同事“消失”并被杀害。\n伊曼纽尔还谈到了作为津巴布韦人在南非生活的情况，特别是考虑到2019年9月针对外国国民的仇外心理报道。\n伊曼纽尔1981年出生于津巴布韦布拉瓦约。他在姆波波马Mabutweni尘土飞扬的街道上长大，当时他上学，后来加入了争取民主变革运动。由于几乎不了解他当时给自己带来了什么，随后，他和他的朋友被争取民主变革运动(MDC)招募，以推动不对他们赢得的执政党(ZANU PF)公投投反对票。\n伊曼纽尔后来在19岁时成为MDC的持卡会员，并继续担任13区分部的青年副主席，当时的分部名为Maitiro。该分支后来在2002年协助罢免了曾经被授予勋章的ZANU PF议员Skhanyiso Ndlovu博士，并在该选区铲除了迄今为止可怕的ZANU PF。\n也是在2002年，伊曼纽尔后来被流放到南非，因为他的一些朋友和亲近的人开始失踪。伊曼纽尔目前是争取民主变革运动在南非的选举主任。\n通过以下方式共享此信息：", "note_en": "With the  passing of Zimbabwe&#39;s former President, Robert Gabriel Mugabe, the southern African country once again came under the spotlight. Questions about how good (or how bad) Mugabe&#39;s legacy was have been asked, and depending on who you ask,  Zimbabwe is or was a great country or a horrible country. The same mixed sentiment applies especially if you ask South Africans about Robert Mugabe.\n As such, I thought it best to catch up and talk to someone who I think has a better experience and understanding of Zimbabwe than myself. I&#39;ve known Emmanuel Banda for several years as a waiter at one of my favorite restaurants that I frequent. But more than being a waiter, Emmanuel is also the director responsible for elections and recruiting for MDC ( Movement For Democratic Change) in South Africa.\n Emmanuel was born in Bulawayo in 1981 and he grew up in the dusty streets of Mabutweni in Mpopoma, was he also went to school.\n His story of growing up in Bulawayo and noticing the changes as life got harder in Zimbabwe and eventually fleeing to South Africa provides a rather nuanced perspective of life during the late 1990s up until 2007. In his words, he has witnessed a country go from prosperity to no food on store shelves, more importantly, he has sadly observed as his friends and colleagues “disappeared” and were killed.\n Emmanuel also touches on how it is to live in South Africa as a Zimbabwean especially considering reports of xenophobia against foreign nationals during September 2019.\n   Emmanuel was born in Bulawayo, Zimbabwe during 1981. He grew up in the dusty streets of Mabutweni in Mpopoma were he attended school and later joined MDC . With little understanding of what he had put myself in at the time, subsequently, him and his friends were recruited by the Movement for Democratic Change (MDC) to push for NO vote against the ruling party&#39;s (ZANU PF) referendum which they won.\n Emmanuel later became a card carrying member of MDC at 19 years old and would go on to become the youth vice chairman of the ward 13 branch which was then called Maitiro. This branch later facilitated the removal of the ever decorated ZANU PF Member of Parliament in 2002, Dr. Skhanyiso Ndlovu, and uprooted the fearsome ZANU PF in that constituency to date.\n It was also during 2002 that Emmanuel was later was exiled to South Africa as some of his friends and people close to him started disappearing. Emmanuel is currently the the Director of Elections for MDC in South Africa.\n        Share this via:", "posttime": "2020-08-02 02:30:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗伯特,deteriorated,南非", "title": "津巴布韦在罗伯特·穆加贝(Robert Mugabe)的领导下恶化", "title_en": "Zimbabwe deteriorated under Robert Mugabe", "transed": 1, "url": "https://www.iafrikan.com/2019/10/15/emmanuel-banda-discusses-how-zimbabwe-deteriorated-under-robert-mugabe/", "via": "", "real_tags": ["罗伯特", "南非"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015634, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ink 3现已面市。Ink允许您使用Reaction构建命令行应用程序，并在此过程中获得乐趣。\n墨水对我来说是一个特殊的项目，因为看到一个小小的实验如何成长为一个功能齐全的命令行UI工具包，被盖茨比、Parcel、Yarn、Terraform、Tap、Prisma、Shopify、纽约时报和其他许多公司使用，这让我感到超现实。当我只是在玩Reaction，试图让它将东西渲染成字符串并输出到终端时，我从来没有想到它会有这么大的未来。\n我很高兴能与大家分享所有的最新消息，所以让我们一起来看看Ink3能提供什么。\n虽然它不是一个很好的功能，但我认为它值得关注。人们喜欢使用Reaction为他们的命令行应用程序声明性地构建UI，但有时它最终会损害他们的最终性能。例如，Gatsby注意到他们的构建过程变慢了，这显然不是我希望Ink；的用户接受的权衡。\n墨水3消除了相当多的渲染错误，在某些情况下，我观察到当重新渲染的频率很高时，性能提高了2倍。文本渲染和对Flexbox的整个支持都被从头开始重新思考和重写。它也比以前简单得多，这使得问题更容易调试、再现和解决。\n以前版本的Ink针对各种布局问题有多个棘手的解决方法，因此它并不总是呈现您预期的效果。Ink 3应该是该领域的重大改进。\n以前，您必须使用单独的&lt；Color&gt；组件将颜色应用于文本。这可能会很快变得嘈杂：\n如果您的终端支持扩展的颜色范围，您甚至可以使用十六进制或RGB颜色。\n通过设置background Color属性，文本还可以具有彩色背景，该属性接受与颜色相同的值。\n方框现在可以有时尚的边框了！有趣的是，这项功能出人意料地发现了Ink中的一系列布局问题。我注意到方框周围的边框是如何错误呈现的，并揭示了Ink和Yoga中方框尺寸的不同，这引发了整个呈现流程的重写。\n哦，总共有7种边框样式，所以你可以选择你最喜欢的一种。\n我想特别提到useInput，因为它在Ink 2之后有了重大改进。现在它可以更可靠地解析用户输入，并且可以正确检测用户何时按下组合键，例如Shift+Tab。如果以前它不能为您正常工作，我鼓励您再试一次。\n如果需要呈现不可预测且可能大量的项目，请使用&lt；static&gt；Component.Think of&lt；static&gt；作为虚拟列表技术的特定于终端的实现，其中只呈现必要的项目。&lt；Static&gt；会将所有新项目永久呈现在UI的其余部分之上，这意味着一旦显示它们，您就无法对其进行更新。这使得&lt；Static&gt；非常适合Jest之类的工具，在Jest等工具中可能需要记录数百个已完成的测试。\n在Ink3中，&lt；static&gt；的性能几乎是以前的两倍，API也得到了简化，以匹配诸如Reaction-Tiny-Virtual-List之类的库。\n这里是一个类似于Jest的UI示例，其中使用&lt；static&gt；呈现完成的测试。\n是的，您没看错。您可以使用Reaction DevTools来检查Ink应用程序的输出。神奇的一点是，您可以实际更改任何组件的道具，并且无需重新启动即可看到CLI的即时更新。\n您无需进行任何更改即可支持它，只需设置DEV=TRUE环境变量并打开DevTools：\n当您的一个组件抛出错误时，Reaction会向控制台显示一条相当详细的错误消息和一个很长的堆栈跟踪。堆栈跟踪通常不是特别有用，因为它指向Reaction内部。\nInk3通过定义全局Reaction错误边界并呈现错误的漂亮概述，为此问题提供了一个更简单、更干净的解决方案。\n为了进一步改进Developer UX，Ink 3拦截对console.log、console.error和其他方法的调用，以确保日志正确显示在您的应用程序的UI之上，并且不会相互干扰。这是必要的，因为Ink会一直重新呈现您的UI，这可能会覆盖console.log的输出。\n如果您的应用程序同时显示多个用户输入，则要检测哪些输入具有焦点并应接收数据可能会变得很棘手。为了简化此操作，Ink提供了两个新的反应挂钩：\n当组件调用useFocus钩子时，它通知Ink UI中有一个新的可聚焦组件。每次用户按Tab时，Ink都会将焦点传递到队列中的下一个可聚焦组件。\n在上面的示例中，当用户按Tab时，焦点将在第一个和第二个组件之间来回传递。\n当您的应用程序需要手动管理焦点时，无需等待用户输入，您可以使用useFocusManager钩子。它允许您将焦点切换到下一个或上一个组件，或者完全打开/关闭它。\n&lt；Spacer&&gt;组件是一个方便的框，它会自动扩展以填充所有可用空间。它与SwiftUI中内置的类似。在下面的示例中，&#34；左&34；和&#34；右&34；标签将被推到两侧，因为&lt；空格&&gt;会填充它们之间的空间。\n&lt；newline&gt；组件基本上是手动插入一个或多个\\n字符的替代。请注意，它只能在&lt；文本&gt；组件中使用。\n如果需要插入多个换行符，请添加Count属性：\n许多伟大的公司和开发人员已经在使用Ink来构建他们的CLI，我迫不及待地想看看您会拿出什么下一代Ink！对于那些有兴趣从Ink2迁移的人，有一个迁移指南可供选择。\n我想对为Ink3做出贡献并通过测试预发布版本以确保最终版本尽可能没有错误的每一个人说声谢谢，❤️", "note_en": "Ink 3 is available today.Ink lets you build command-line apps using React and have fun while doing so too.\n Ink is a special project to me, because it&#39;s been surreal to watch how a tiny experiment grew into a full-featured command-line UI toolkit that&#39;s used by  Gatsby,  Parcel,  Yarn,  Terraform,  tap,  Prisma,  Shopify,  New York Times and  many others.I had no idea it had such a great future when I was just playing with React trying to make it render things to a string and output it in the terminal.\n I&#39;m excited to share all the updates with you, so let&#39;s dive right in to see what Ink 3 has to offer.\n  While it&#39;s not so much of a feature, I think it deserves a top spot.People loved using React to declaratively build UIs for their command-line apps, but sometimes it ended up hurting their end performance.For example,  Gatsby noticed their build process slowed down, which is obviously not the tradeoff I want Ink&#39;s users to accept.\n Ink 3 got rid of quite a few rendering bugs and in some cases I observed a 2x performance improvement when there&#39;s a high frequency of re-renders.Text rendering and the whole support for Flexbox was rethinked from the ground up and rewritten.It&#39;s also much simpler than it was before, which makes issues easier to debug, reproduce and solve.\n Previous version of Ink had multiple hacky workarounds for various layout issues, so it didn&#39;t always render what you would expect.Ink 3 should be a significant improvement in that area.\n  Previously you had to use a separate  &lt;Color&gt; component for applying color to text.This could quickly get noisy:\n    If your terminal supports extended range of colors, you can even use HEX or RGB colors.\n   Text can also have a colorful background by setting the  backgroundColor property, which accepts the same values as  color.\n    Boxes can have stylish borders now!Fun fact, this feature unexpectedly uncovered a range of layout issues in Ink.I noticed how borders were rendered incorrectly around boxes and uncovered how box dimensions differ in Ink and Yoga, which sparked a rewrite of the entire rendering flow.\n   Oh, and there are 7 border styles in total, so you can pick the one you like the most.\n      I want to mention   useInput in particular, because it has seen significant improvements since Ink 2.Now it parses user input more reliably and can properly detect when user presses combinations of keys, like Shift + Tab for example.If it wasn&#39;t working properly for you before, I encourage you to give it a try again.\n   If you need to render unpredictable and possibly large number of items, use  &lt;Static&gt; component.Think of  &lt;Static&gt; as a terminal-specific implementation for a  virtual list technique, where only necessary items are rendered. &lt;Static&gt; renders all new items above the rest of your UI permanently, which means you can&#39;t update them once they are displayed.This makes  &lt;Static&gt; a perfect candidate for tools like Jest, where hundreds of completed tests could need to be logged.\n  In Ink 3,  &lt;Static&gt; is almost twice as performant as it was before and API has been simplified to match libraries like  react-tiny-virtual-list.\n Here&#39;s an example of a UI similar to Jest, where completed tests are rendered using  &lt;Static&gt;.\n    Yes, you read that right.You can use React Devtools to inspect the output of your Ink app.The magical bit is that you can actually change the props of any component and see your CLI update on the fly without having to restart it.\n  You don&#39;t need to make any changes to support it, just set  DEV=true environment variable and open Devtools:\n   When one of your components throws an error, React displays a quite verbose error message to the console and a long stack trace.Most often that stack trace isn&#39;t super useful, because it points to React internals.\n Ink 3 offers a simpler and cleaner solution to this problem by defining a global React  error boundary and rendering a beautiful overview of the error.\n  To improve developer UX further, Ink 3 intercepts calls to  console.log,  console.error and other methods to ensure logs are displayed correctly above your app&#39;s UI and not interfere with each other.This is necessary, because Ink re-renders your UI all the time, which can overwrite the output from  console.log.\n  If your app has more than one user input displayed at once, it can become tricky to detect which input has the focus and should receive data.To make this easier, Ink offers two new React hooks:\n  When component calls  useFocus hook, it notifies Ink that there&#39;s a new focusable component in the UI.Each time user presses Tab, Ink is going to pass focus to the next focusable component in the queue.\n  In the example above, as user presses Tab, focus will be passed back and forth between  First and  Second components.\n When your app needs to manage focus manually, without waiting on user input, you can use  useFocusManager hook.It lets you switch focus to the next or previous component or turn it on/off completely.\n   &lt;Spacer&gt; component is a handy box, which automatically expands to fill all the available space.It&#39;s quite similar to the one built into SwiftUI.In the following example, &#34;Left&#34; and &#34;Right&#34; labels will be pushed to the sides, because  &lt;Spacer&gt; fills the space between them.\n     &lt;Newline&gt; component is basically a replacement for manually inserting one or many  \\n characters.Note that it can be used only inside  &lt;Text&gt; components.\n  If you need more than one newline character to be inserted, add a  count property:\n   Lots of  great companies and developers already use Ink to build their CLIs and I can&#39;t wait to see what you come up with this next generation of Ink!For those who are interested in migrating from Ink 2, there&#39;s a  migration guide available.\n I want to say thank you to everyone who has contributed to Ink 3 and helped by testing the pre-release version to make sure final release is as bug free as possible ❤️", "posttime": "2020-08-02 02:29:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,build,ink", "title": "墨迹3-使用Reaction构建CLI应用程序", "title_en": "Ink 3 – Build CLI apps with React", "transed": 1, "url": "https://vadimdemedes.com/posts/ink-3", "via": "", "real_tags": ["程序", "build", "ink"]}, {"category": "", "categoryclass": "", "imagename": "c910f81ed11329685df145ad5869be40.jpg", "infoid": 1015633, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一支由现代自动和无人驾驶系统组成的舰队访问了皇家海军最新的航空母舰“威尔士亲王号”的飞行甲板。\n威尔士亲王号本周为未来海上航空部队加速器日提供了一个令人印象深刻的背景，来自海军、国防部和行业的专家齐聚一堂，开会讨论无人机行动的愿景。\n与此同时，海军正寻求开发和投资最新技术，更快地将新的、世界一流的装备带到前线。\n皇家海军首席技术官丹·切斯曼准将(Brigadier Dan Cheesman)与海军航空副局长尼克·沃克准将(Commodore Nick Walker)共同主持了这次活动，呼吁与会者考虑技术和创新如何改变海军现在和未来在空中的运作方式。\nBrig Cheesman说，未来的海上航空部队也是为了看看皇家海军如何在商业领域已经开始的技术发展步伐的基础上再接再厉，并获得优势。\n他说：“我们的目标是从我们现在拥有的迅速过渡到未来我们想要的任何东西。\n他说：“我们生活在一个技术变革呈指数级的世界，如果我们能够集成最新的技术并将其投入运营，它将带来制胜优势。具体地说，将这项技术带到像威尔士亲王号这样的船只上将是游戏规则的改变者。\n我们正在与像今天在这里这样的公司合作，了解他们如何帮助我们更快地行动。“\n布瑞格·齐斯曼补充说，皇家海军的目标应该是在几周和几个月内交付这些新能力，而不是目前接受的几年甚至几十年。\n皇家海军纳尔逊数字加速实验室的工作支持了这一想法。他们继续开发“即插即用”Maple系统，当集成到皇家海军舰艇上时，将简化获取和使用自主和无人驾驶技术的过程。\n今年早些时候在挪威进行的试验中，该系统分别用于Albion号航空母舰和去年Argyll号航空母舰。展望未来，所有皇家海军舰艇都将拥有开放式结构、全网络、有机的无人驾驶航空系统，威尔士亲王将走在一系列试验的前沿。\n正如第一海洋勋爵海军上将托尼·拉达金之前宣布的那样，这艘航空母舰将被用作无人驾驶飞行器的试验台。\n海军航空部副主任尼克·沃克准将支持引入新技术的速度的重要性。他在英国皇家海军威尔士亲王号(HMS Of Wales Prince)上发表讲话时表示：“当我们的无人机和其他设备例行登上船只时，我们才真正开始了解它们的能力，并对我们能实现的目标有所了解。”\n“我们必须以安全、正确和连贯的方式进行，但我希望在一年内看到今天在前线行动中展示的装备类型。”\n如果您希望在我们的新闻文章中报告语法或事实错误，您可以使用在线反馈表格让我们知道。", "note_en": "A fleet of modern autonomous and unmanned systems visited the flight deck os the Royal Navy’s newest aircraft carrier, the HMS Princes of Wales.\n HMS Princes of Wales provided an impressive setting for the Future Maritime Aviation Force Accelerator Day this week, bringing together experts from the navy, MOD and industry to meet and discuss the vision for drone operations.\n It comes as the navy seeks to develop and invest in the latest technology, bringing new, world-beating equipment to the frontline quicker.\n  Brigadier Dan Cheesman, Chief Technology Officer for the Royal Navy, co-hosted the event with Commodore Nick Walker, Deputy Director Naval Aviation, calling on attendees to consider how technology and innovation could transform the way the navy operates in the skies now and into the future.\n The Future Maritime Aviation Force, Brig Cheesman said, was also about seeing how the Royal Navy could build-on and gain advantage from the pace of technological development already underway in the commercial sector.\n “The aim is to transition rapidly from what we have now to whatever we want in the future.\n “We live in an exponential world of technological change and if we can integrate the latest and get it on operations, it will deliver battle-winning advantage. Specifically, getting that technology onto ships like HMS Prince of Wales would be a game-changer.\n “We are working in collaboration with companies like the ones here today to understand how they can help us move faster.”\n Brig Cheesman added it should be the Royal Navy’s goal that these new capabilities should be delivered in weeks and months, not years and decades as is currently accepted.\n The work of the Royal Navy’s NELSON digital acceleration lab supports this idea. They have continued the development the “plug in and play” MAPLE system that, when integrated onto Royal Navy ships, will simplify the process of accessing and using autonomous and un-crewed technology.\n Trials earlier this year in Norway saw this system used on HMS Albion and last year on HMS Argyll. Going forward, all Royal Navy ships will possess open architecture, fully-networked, organic crewless aviation systems with Prince of Wales being at the forefront of a series of trials.\n As previously announced by First Sea Lord Admiral Tony Radakin, this will see the aircraft carrier being used as a testbed for un-crewed aerial vehicles.\n Commodore Nick Walker, Deputy Director of Navy Aviation, supported the importance of the speed of introducing new technology. Speaking onboard HMS Prince of Wales, he said: “When we have drones and other equipment routinely embarked on ships, that’s when we really start to understand what they can do and get an idea of what we can achieve.\n “We have to do it safely, in the right way and coherently, but I want to see the type of kit on display today on frontline operations within the year.”\n If you wish to report grammatical or factual errors within our news articles, you can let us know by using the  online feedback form.", "posttime": "2020-08-02 02:29:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞行,modern,技术", "title": "一支现代无人机编队访问了英国新航空母舰的飞行甲板", "title_en": "A fleet of modern drones visited flight deck of new British aircraft carrier", "transed": 1, "url": "https://defence-blog.com/news/a-fleet-of-modern-drones-visited-flight-deck-of-new-british-aircraft-carrier.html", "via": "", "real_tags": ["飞行", "modern", "技术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015631, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1968年12月9日，在旧金山的一个大厅里，投射到屏幕上的新技术的展示震撼了当时小小的计算机工程世界的核心。\n这一历史性活动的与会者看到了视频会议的演示，第一次公开使用计算机鼠标，点击文档中的一个单词就会将用户带到一个全新的文档的超链接-等等。\n在大厅里看到的动手表演的明星是道格拉斯·恩格尔巴特(Douglas Engelbart)，他在加利福尼亚州门洛帕克的SRI研究中心的团队多年来一直在开发它们。\n威廉·K·英格利希(William K.English)于周日去世，享年91岁。他设计了现在被称为“所有演示之母”的东西，并在幕后工作，以确保它们都能正常工作。\n比尔·英格利希在恩格尔巴特的演示中扮演了不可或缺的角色。事件发生几年后，他应聘加入施乐公司新成立的帕洛阿尔托研究中心--传奇的施乐研究中心，在那里他帮助助产士帕洛阿尔托发明了个人电脑和其他创新。\n他的妻子罗伯塔(Roberta)说，他是一位才华横溢的动手工程师，在管理人员方面很灵巧，他的整个目标就是让事情运转起来。\n英格利希在施乐工作了足够长的时间来开发Star，这是该公司试图将Parc的技术商业化的失败尝试，在1981年推出的Star日语版中，英格利希与人共同设计了一款显示监视器。随后，他离开施乐，加入了太阳微系统公司(Sun Microsystems)，后来又加入了开拓性的电子游戏主机制造商3DO。\n在此过程中，他曾在日本和加利福尼亚州的惠内姆港担任海军军官，并参与了一项研究LSD和裸盖菇素对心理影响的研究项目。但他在计算机技术方面留下了最大的印记，尽管公众对此一无所知。\n英格利希1929年出生于肯塔基州列克星敦，并在肯塔基大学获得学士学位。随后，他获得了新墨西哥大学的电气工程硕士学位，在阿尔伯克基的桑迪亚国家实验室致力于开发军用飞机的炸弹瞄准镜，并在芝加哥大学、加州大学伯克利分校和斯坦福大学进行研究。\n20世纪60年代初，他加入SRI从事磁逻辑技术的工作，然后在1964年成为第一个加入恩格尔巴特SRI实验室的成员。恩格尔巴特是一位富有魅力的远见卓识者，他的增强研究中心致力于他的信念，即计算机技术不仅可以帮助人类思维过程，而且可以增强它-计算机存储、分类和检索信息的能力有朝一日将改变人们的思维、写作和计算方式。\n在英格利希担任总工程师的情况下，恩格尔巴特开发了交互式软件和硬件，允许用户管理和操作文本和视频图像，以便彼此交流。1965年，该实验室获得美国宇航局的资助，发明了一种移动光标和在显示屏上选择项目的技术；恩格尔巴特提出了这个概念，但第一个原型鼠标是由英国人设计的。\n大约在同一时间，英格利希和恩格尔巴特被邀请参加位于门洛帕克附近的私人资助的国际高级研究基金会(International Foundation For Advanced Study)的一个研究项目。\n该研究所的目标是测试迷幻药物对包括工程学在内的各行各业的创造性个人工作的影响。至少有40名受试者被招募，要求他们填写问卷，询问他们认为药物对他们的心理过程是帮助还是损害，让他们更好地理解美和艺术，产生宗教体验等。\n根据罗伯特和英格利希的小儿子约翰的说法，英格利希从来没有过多地谈论过他在这个项目中的经历，尽管恩格尔巴特长期以来一直是该项目的倡导者。无论如何，当联邦政府在1968年宣布LSD为非法时，它被突然关闭。\n恩格尔巴特的工作只为一小群追随者所知，直到1968年，当他被邀请在1968年12月两个领先的工程学会的秋季联合计算机会议上发表演讲时，他描述了他的工作。英格利希自告奋勇地为旧金山一家名为演员工作室的舞台团担任灯光和音响技术顾问，他建议恩格尔巴特，仅仅是演讲是不可能成功的，他必须表演一场。\n所有德莫斯之母就这样诞生了。英语基本上编排了恩格尔巴特的陈述。同样重要的是，他确保没有技术故障。这是一个挑战，因为恩格尔巴特将在旧金山展示一个正在30英里外的门洛帕克运行的系统，这两个地点通过微波中继相连。这次活动几乎一帆风顺，一个新的世界诞生了。\n道格没有这样做，罗伯塔回忆道，她曾担任恩格尔巴特的秘书。全是比尔。恩格尔巴特于2013年去世。\n尽管演示取得了成功，但他的实验室成员对恩格尔巴特的失望情绪正在上升。问题是，恩格尔巴特一直在无休止地寻找知识，对将实验室的创新商业化完全不感兴趣。\n1970年，帕洛阿尔托研究开发中心邀请了罗伯特·W·泰勒(Robert W.Taylor)，他当时正在组建一个由年轻工程师和科学家组成的团队，以规划一个新的数字世界。作为五角大楼高级研究计划局的一名官员，泰勒资助了恩格尔巴特的一些工作，他开始突袭他的实验室，寻找帕洛阿尔托研究所(PARC)。\n第一个跳跃的成员是比尔·英格利希，他被领导自己的实验室并推动商业化的前景所吸引。碰巧的是，帕洛阿尔托研究中心的大部分工作将偏离从斯里兰卡引进的英语概念。他的系统使用起来很复杂，而且需要密集的培训；帕洛阿尔托研究中心正在向简单直观的软件和硬件发展。\n然而，英语成了帕克实验室年轻成员的导师，特别是傲慢的年轻艾伦·凯(Alan Kay)，他的个性将恩格尔巴特(Engelbart)式的人类成长愿景与近乎纯真的企业文化结合在一起。\n凯的职业生涯是在这样的学术环境中度过的，在这种环境中，他几乎习惯于随心所欲地获得研究资助。\n他对帕洛阿尔托研究中心的资金限制感到困惑，尽管该研究中心本应是才华横溢的年轻思想家可以跟随自己的直觉创造新事物的地方，但钱包里的绳子仍然由官僚掌握，他们认为凯关于个人电脑的想法足够简单，即使是有创造力的孩子也可以使用，这太模糊了，太浪漫化了。\n英格利希在研究预算和循序渐进的计划概念上自食其力。我恐怕我确实问过比尔，什么是预算？凯后来回忆道。英格利希促使凯起草了一份详细的计划，设计一种可以在显示屏上产生文本和图形的设备，这项计划从帕洛阿尔托大学吝啬的财务主管那里获得了23万美元的预算。随着时间的推移，在帕洛阿尔托实验室一些高级电气工程师的帮助下，这个概念演变成了帕洛阿尔托实验室的Alto，这是世界上第一台个人电脑。\n约翰·英格利希回忆说，在1968年演示40周年的庆祝活动上，凯不仅向恩格尔巴特致敬，也向他的总工程师致敬。他回忆说，无论创作者的愿景是什么，凯都是在观察。你需要有人来实现这一切。那是比尔·英格利希。", "note_en": "On Dec. 9, 1968, the then-small world of computer engineering was shaken to its core by a presentation of new technologies projected onto a screen in a San Francisco hall.\n The attendees at the historic event saw demonstrations of video conferencing, the first public use of a computer mouse, hyperlinking in which clicking a word in a document transported the user to an entirely new document — and more.\n The man who was the star of the hands-on show seen in the hall was Douglas Engelbart, whose team at the research center SRI in Menlo Park, Calif., had been developing them for years.\n      But the man who had designed what is known now as  &#34;The Mother of All Demos&#34; and was working behind the scenes to make sure they all worked was William K. English, who died Sunday at the age of 91.\n Bill English played an indispensable role in more than Engelbart&#39;s demo. A few years after that event he was recruited to join Xerox Corp.&#39;s newly established Palo Alto Research Center,  the legendary Xerox PARC, where he helped midwife PARC&#39;s invention of the personal computer and other innovations.\n A brilliant hands-on engineer with a deft touch at managing people, &#34;his whole goal was to make things work,&#34; says his wife, Roberta.\n English stayed at Xerox long enough to work on the Star, the company&#39;s ill-fated attempt to commercialize PARC&#39;s technologies, co-designing a display monitor for the Star&#39;s Japanese version, introduced in 1981. He subsequently left Xerox to join Sun Microsystems and later the pioneering electronic game console maker 3DO.\n Along the way he served as a Navy officer in Japan and at California&#39;s Port Hueneme and as a subject in a research project into the psychological effects of LSD and psilocybin. But it is on computer technology where, though unknown to the general public, he left his greatest mark.\n English was born in 1929 in Lexington, Ky., and received his bachelor&#39;s degree from the University of Kentucky. He subsequently received a master&#39;s in electrical engineering from the University of New Mexico, worked on developing a bomb scope for military aircraft at Sandia National Laboratory in Albuquerque, and conducted research at the University of Chicago, UC Berkeley and Stanford.\n In the early 1960s  he joined SRI to work on magnetic logic technology, then in 1964 became the first member to join Engelbart&#39;s SRI lab. Engelbart was a charismatic visionary whose Augmentation Research Center was devoted to his conviction that computer technology could not only assist the human thought process, but enhance it — that the computer&#39;s ability to store, classify and retrieve information would someday change the way people thought, wrote and calculated.\n With English as his chief engineer, Engelbart developed interactive software and hardware allowing users to manage and manipulate text and video images to communicate with one another. In 1965 the lab receive a NASA grant to invent a technology for moving a cursor and selecting an item on a display screen; Engelbart developed the concept, but it was English who designed the first prototype — the mouse.\n Around the same time, English and Engelbart were invited to participate in a research project at the privately funded International Foundation for Advanced Study, which was located nearby in Menlo Park.\n The institute&#39;s goal was to test the effect of psychedelic drugs on the work of creative individuals drawn from all walks of life, including engineering. At least 40 subjects were recruited and asked to  fill out questionnaires about whether they thought the drugs had helped or harmed their mental processes, given them better understanding of beauty and art, produced a religious experience and so on.\n English never talked much about his experience in the project, according to Robert and to English&#39;s younger son, John, though Engelbart long remained an advocate of the project. In any event, it was abruptly shut down when the  federal government outlawed LSD in 1968.\n Engelbart&#39;s work was known to only a small circle of acolytes until 1968, when he was invited to give a talk describing his work at the Fall Joint Computer Conference of two leading engineering societies in December 1968. English, who had volunteered as a lighting and sound technical advisor for a San Francisco stage troupe known as the Actor&#39;s Workshop, advised Engelbart that a mere speech would fall flat; he had to give a performance.\n Thus was the Mother of All Demos born. English essentially choreographed Engelbart&#39;s presentation. Just as important, he made sure there were no technical glitches. That was a challenge, since Engelbart would be in San Francisco demonstrating a system that was being operated 30 miles away in Menlo Park, the two sites connected via a microwave relay. The event went off virtually without a hitch, and a new world was born.\n &#34;Doug wasn&#39;t doing it,&#34; recalls Roberta, who had worked as Engelbart&#39;s secretary. &#34;It was all Bill.&#34; Engelbart died in 2013\n Despite the success of the demo, frustration with Engelbart was rising among his lab members. The problem was that Engelbart was engaged in a never-ending search for knowledge and utterly uninterested in commercializing the lab&#39;s innovations.\n In 1970, PARC came calling in the persona of  Robert W. Taylor, who was assembling a team of young engineers and scientists to map out a new digital world. As an officer of the Pentagon&#39;s Advanced Research Projects Agency, Taylor had funded some of Engelbart&#39;s work, and he set about raiding his lab for PARC.\n The first member to jump was Bill English, who was enticed by the prospect of heading his own lab and driving toward commercialization. As it happened, much of PARC&#39;s work would depart from the concepts English imported from SRI. His system was complicated to use and required intensive training; PARC was trending toward software and hardware that were simple and intuitive to use.\n Nevertheless, English became something of a mentor for young members of the PARC labs, especially the brash young Alan Kay, whose personality combined an Engelbart-like vision of human augmentation with a nearly pure innocence of corporate culture.\n Kay had spent his career in an academic environment in which he was accustomed to obtaining research grants almost for the asking.\n He was confounded by the funding limitations at PARC; for all that the research center was supposed to be a place where brilliant young thinkers could follow their instincts to create new things, the purse strings were still held by bureaucrats who thought Kay&#39;s ideas for a personal computer simple enough to be wielded even by creative children were too hazy and romanticized.\n English took it upon himself to school Kay in the concepts of research budgets and step-by-step planning. &#34;I&#39;m afraid I really did ask Bill, &#39;What&#39;s a budget?&#39;&#34; Kay recalled later. English prompted Kay to draft a detailed plan for a device that would produce text and graphics on a display screen, which sprung a budget of $230,000 from PARC&#39;s tight-fisted bursars. In time and with the help of some of PARC&#39;s master electrical engineers, the concept morphed into PARC&#39;s Alto, the world&#39;s first personal computer.\n At a 40th anniversary celebration of the 1968 demo, Kay paid homage not only to Engelbart but to his chief engineer, John English recalls. Whatever the creator&#39;s vision, he recalls Kay observing. &#34;You need someone to make it all happen. That was Bill English.&#34;", "posttime": "2020-08-02 00:45:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "逝世,english,研究", "title": "“所有演示之母”的工程师威廉·英格利希逝世，享年91岁", "title_en": "William English, Engineer Behind 'The Mother of All Demos', Dies at 91", "transed": 1, "url": "https://www.msn.com/en-us/news/technology/column-bill-english-wizard-behind-the-scenes-of-seminal-computer-technologies-dies-at-91/ar-BB17qF8z", "via": "", "real_tags": ["逝世", "english", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015630, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "命令行界面在其短暂的历史中有所不同，但在很大程度上汇聚成了一些共同的、完善的约定。内核起源于Unix，Linux生态系统对其进行了扩展，特别是通过GNU项目。不幸的是，有些工具一开始似乎遵循惯例，但却巧妙地犯了错，通常没有实际好处。我相信在很多情况下，作者并不了解更多，所以我想回顾一下这些约定。\n最简单的情况是做空期权标志。选项是一个连字符(具体地说是连字符减去U+002D)，后跟一个字母数字字符。可以使用大写字母。这些信件本身具有传统意义，如果可能的话，值得遵循。\n可以将标志一起分组到一个程序参数中。这既方便又明确。当程序使用手工编码的参数解析器时，这也是经常遗漏的细节之一，缺乏对它的支持使我感到不安。\n空格是可选的，因此选项和参数可以打包到一个程序参数中。因为参数是必需的，所以这仍然是模棱两可的。这是手工编码解析器中另一个经常遗漏的特性。\n此技术用于创建另一个类别，可选选项参数。选项的参数可以是可选的，但仍然是明确的，只要参数存在时始终省略空格。\nProgram-c#省略Program-cBlue#ProvidedProgram-c Blue#省略(Blue是新参数)Program-c-x#两个单独的标志Program-c-x#-c带有参数&#34；-x&#34；\n可选选项参数应该明智地使用，因为它们可能会让人感到不安，但它们也有其用处。\n选项通常可以以任何顺序出现-解析器通常通过排列来实现-但非选项通常跟随在选项之后。\nGNU风格的程序通常允许选项和非选项混合在一起，尽管我不认为这是必要的。\n如果非选项看起来像选项，因为它以连字符开头，请使用--来区分选项和非选项。\n要求非期权紧跟在期权之后的一个好处是，第一个非期权区分了两组，因此--需要的次数较少。\n#注：无参数置换程序-a-b foo-x bar#2个选项，3个非选项。\n由于短选项可能是隐晦的，而且数量有限，因此更复杂的程序支持长选项。长选项以两个连字符开头，后跟一个或多个字母数字小写单词。用连字符分隔单词。使用两个连字符可防止将长选项与分组的短选项混淆。\n有时，标志与以--no-开头的互斥反向标志配对。这避免了将来的标志日，在版本中更改了默认设置，同时添加了实现原始行为的标志。\n可以选择使用等号=将它们连接到参数，这与省略短选项参数的空格非常相似。\n与以前一样，这为可选选项参数打开了大门。由于需要，这一点仍然是明确的。\n有些程序(如Git)有子命令，每个子命令都有自己的选项。主程序本身可能仍然具有有别于子命令选项的自己的选项。程序的选项在子命令之前，子命令选项在子命令之后。子命令周围的选项从未改变过。\n上面的-a、-b和-c选项用于程序，其他选项用于子命令。所以，实际上，子命令是它自己的另一个命令行。\n假设你对遵循这些约定感兴趣，那么就没有理由不正确地遵循这些约定。只需大约60行C代码就可以正确解析短选项。多头期权只是稍微复杂一点。\nGNU的getopt_long()支持长选项缩写-无法禁用(！)-但这应该避免。\nGO的FLAG包故意与约定背道而驰，它只支持长选项语义(通过单个连字符)。这使得即使所有选项都只有一个电子邮件，也不可能支持分组。此外，将选项和参数组合为单命令行参数的唯一方法是使用=。它听起来不错，但每次我用围棋编写程序时，我都会错过这两个功能。这就是为什么我写了我自己的论证解析器。它不仅有更好的功能集，我也更喜欢它的API。\nPython的主要选项解析库是argparse，我简直无法忍受。尽管表面上看起来很循规蹈矩，但实际上它打破了惯例，其行为也是不健全的。例如，以下程序有两个选项--foo和--bar。Foo选项接受可选参数，而--bar选项是一个简单的标志。\n$python parse.pyNamespace(bar=false，foo=&#39；X&#39；)$python parse.py--fooNamespace(bar=false，foo=None)$python parse.py--foo=argNamespace(bar=false，foo=#39；arg&#39；)$python parse.py--bar--bar--fooNamespace(bar=True，foo=None)$。\n除了最后一件，其他的看起来都很好。如果--foo参数是可选的，那么它为什么要消耗arg呢？如果我跟在后面加--bar会怎么样？它会把它当作论据吗？\n不要啊！与arg不同的是，它没有使用--bar，因此它没有遵循明确的约定，而是具有自己的模糊语义，并试图用一个“智能”启发式来解决这些问题：“如果一个可选参数看起来像一个选项，那么它一定是一个选项！”非选项参数永远不能跟在带有可选参数的选项后面，这使得该功能非常无用。因为argparse不能正确支持--，所以这没有什么帮助。\n$python parse.py--foo--arguse：parse.py[-h][--foo[foo]][--bar]parse.py：错误：无法识别的参数：--arg。\n对这篇文章有什么评论吗？通过发送电子邮件至~Skeeto/public-inbox@lists.sr.ht[邮件列表礼仪]开始我的公共收件箱中的讨论，或查看现有讨论。", "note_en": "Command line interfaces have varied throughout their brief history buthave largely converged to some common, sound conventions. The core originates from unix, and the Linux ecosystem extended it,particularly via the GNU project. Unfortunately some tools initially appear to follow the conventions, but subtly get them wrong, usuallyfor no practical benefit. I believe in many cases the authors simplydidn’t know any better, so I’d like to review the conventions.\n  The simplest case is the  short option flag. An option is a hyphen —specifically HYPHEN-MINUS U+002D — followed by one alphanumericcharacter. Capital letters are acceptable. The letters themselves  haveconventional meanings and are worth following if possible.\n  Flags can be grouped together into one program argument. This is bothconvenient and unambiguous. It’s also one of those often missed detailswhen programs use hand-coded argument parsers, and the lack of supportirritates me.\n    The space is optional, so the option and argument can be packed togetherinto one program argument. Since the argument is required, this is stillunambiguous. This is another often-missed feature in hand-coded parsers.\n    This technique is used to create another category,  optional optionarguments. The option’s argument can be optional but still unambiguousso long as the space is always omitted when the argument is present.\n program -c # omittedprogram -cblue # providedprogram -c blue # omitted (blue is a new argument)program -c -x # two separate flagsprogram -c-x # -c with argument &#34;-x&#34;\n Optional option arguments should be used judiciously since they can besurprising, but they have their uses.\n Options can typically appear in any order — something parsers oftenachieve via  permutation — but non-options typically follow options.\n  GNU-style programs usually allow options and non-options to be mixed,though I don’t consider this to be essential.\n  If a non-option looks like an option because it starts with a hyphen,use  -- to demarcate options from non-options.\n  An advantage of requiring that non-options follow options is that thefirst non-option demarcates the two groups, so  -- is less oftenneeded.\n # note: without argument permutationprogram -a -b foo -x bar # 2 options, 3 non-options\n  Since short options can be cryptic, and there are such a limited numberof them, more complex programs support long options. A long optionstarts with two hyphens followed by one or more alphanumeric, lowercasewords. Hyphens separate words. Using two hyphens prevents long optionsfrom being confused for grouped short options.\n  Occasionally flags are paired with a mutually exclusive inverse flagthat begins with  --no-. This avoids a future  flag day where thedefault is changed in the release that also adds the flag implementingthe original behavior.\n    These may optionally be connected to the argument with an equals sign =, much like omitting the space for a short option argument.\n  Like before, this opens up the doors for optional option arguments. Dueto the required  = this is still unambiguous.\n     Some programs, such as Git, have subcommands each with their ownoptions. The main program itself may still have its own options distinctfrom subcommand options. The program’s options come before thesubcommand and subcommand options follow the subcommand. Options arenever permuted around the subcommand.\n  Above, the  -a,  -b, and  -c options are for  program, and theothers are for  subcommand. So, really, the subcommand is anothercommand line of its own.\n  There’s little excuse for not getting these conventions right assumingyou’re interested in following the conventions. Short options can beparsed correctly in  just ~60 lines of C code. Long options are just slightly more complex.\n GNU’s  getopt_long() supports long option abbreviation — with no way todisable it (!) — but  this should be avoided.\n Go’s  flag package intentionally deviates from the conventions.It only supports long option semantics, via a single hyphen. This makesit impossible to support grouping even if all options are only oneletter. Also, the only way to combine option and argument into a singlecommand line argument is with  =. It’s sound, but I miss both featuresevery time I write programs in Go. That’s why I  wrote my own argumentparser. Not only does it have a nicer feature set, I like the API alot more, too.\n Python’s primary option parsing library is  argparse, and I just can’tstand it. Despite appearing to follow convention, it actually breaksconvention  and its behavior is unsound. For instance, the followingprogram has two options,  --foo and  --bar. The  --foo option acceptsan optional argument, and the  --bar option is a simple flag.\n   $ python parse.pyNamespace(bar=False, foo=&#39;X&#39;)$ python parse.py --fooNamespace(bar=False, foo=None)$ python parse.py --foo=argNamespace(bar=False, foo=&#39;arg&#39;)$ python parse.py --bar --fooNamespace(bar=True, foo=None)$ python parse.py --foo argNamespace(bar=False, foo=&#39;arg&#39;)\n Everything looks good except the last. If the  --foo argument isoptional then why did it consume  arg? What happens if I follow it with --bar? Will it consume it as the argument?\n  Nope! Unlike  arg, it left  --bar alone, so instead of following theunambiguous conventions, it has its own ambiguous semantics and attemptsto remedy them with a “smart” heuristic: “If an optional argument  lookslike an option, then it must be an option!” Non-option arguments cannever follow an option with an optional argument, which makes thatfeature pretty useless. Since  argparse does not properly support  --,that does not help.\n $ python parse.py --foo -- argusage: parse.py [-h] [--foo [FOO]] [--bar]parse.py: error: unrecognized arguments: -- arg\n       Have a comment on this article? Start a discussion in my  public inbox by sending an email to   ~skeeto/public-inbox@lists.sr.ht    [ mailing list etiquette] , or see  existing discussions.", "posttime": "2020-08-02 00:44:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "选项,command,参数", "title": "命令行选项的约定", "title_en": "Conventions for Command Line Options", "transed": 1, "url": "https://nullprogram.com/blog/2020/08/01/", "via": "", "real_tags": ["选项", "command", "参数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015629, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一整类美国成年人被剥夺了几乎所有的基本法律权利：工作、选择住所、确定医疗保健、签订合同，甚至决定如何处理自己的身体。这些人是处于法定监护之下的成年人-这是一个法院施加的程序，在俄亥俄州和其他地方一样，“通过这个程序，一个人被剥夺了做出个人生活决定的权利，另一个人被指定代表这个人做出这些决定。”(更多信息)。\n声称一些人不能被信任来管理自己的生活，法律法官赋予其他人巨大的权力来为他们管理自己的生活：\n在美国，100万零1一半的成年人由监护人照顾，这些监护人要么是家庭成员，要么是专业人士，他们控制着大约2730亿美元的资产，…说。各州没有保存监护案件的完整数字-法规差异很大-在大多数司法管辖区，法院记录都是密封的。…。\n在内华达州，就像在许多州一样，任何人都可以通过参加课程成为监护人，只要他或她没有被判重罪或最近宣布破产。…。法院对监护人的费用没有限制，只要看起来“合理”即可。…。纽约四分之一的监护请愿书是由疗养院和医院提出的，有时是作为收取逾期账单的一种手段。…。大约10%的65岁以上的人被认为是“虐待老人”…的受害者。\n当一位朋友试图带他去购物时，[他的监护人]帕克斯阻止了这次短途旅行，因为她不认识这位朋友。[他的妻子]Rennie[North]也曾试图弄到更多的衣服。帕克斯写道：“我提醒沃德，她的衣柜里有很多衣服。”“我让她知道他们的预算很紧张。”诺斯夫妇的遗产被收取了180美元的对话费。(更多信息)。\n美国有42.8万名儿童在寄养。美国每年有13.5万名儿童被收养。(更多信息)。\n如果你担心规范普通人所能做的事情的政府官员的问责和智慧，你应该更担心法定监护人和挑选他们的人这样的事情。\n法院将在监护人提交的年度账户中审查支付给监护人的赔偿金额。…。监护人的报酬一般不超过受监护人年收入的5%。(更多信息)\n某些与病房有联系的人，被法院认为是可能的监护人。这些人包括受监护人指定的人，在丧失工作能力期间发生…之前。在选择监护人时，法院会考虑未来监护人的性格、历史、身体能力和其他相关属性。潜在监护人有限的教育或财政资源本身并不是取消资格的条件。…。\n在没有疏忽或利益冲突的情况下，监护人一般不对代表被监护人采取的任何行动承担个人责任。此外，如果监护人在处理另一人的财产时是谨慎的，则该监护人没有责任管理受监护人的遗产。但是，如果监护人的粗心行为或监护人本人的过错导致受监护人的财产受损，监护人可能会对自己的行为承担责任，但如果监护人的行为是粗心大意造成的，或者监护人本人有过错，则监护人可能要对其行为承担责任。…。\n在某些情况下，法院将要求监护人提供保证金，以在经济上保护病房。保证金由受监护人的财产支付，在监护人的错误导致财产损失的情况下，它可以保护受监护人。保证金的数额一般固定为监护人无人监督控制的房地产的总价值加上一年的估计收入。…。\n守护者不需要有任何特殊技能。…。监护人不需要代表受保护的人花费他/她自己的资金。然而，如果监护人没有采取合理步骤确保受保护人得到适当的照顾和服务，或者监护人对受保护人的财产或财务管理不当，则可能要追究监护人的责任。(更多信息)。\n是的，由看似非常关心被监护人的人(也就是被看守的人)来填补监护人的角色是有意义的，比如父母。但如果找不到这样的人，上述程序和预防措施在我看来是相当薄弱的。我们应该考虑给予监护人更强的激励，让他们做好病房工作。\n我突然想到，我最近一直在考虑的担保和其他激励因素的变化可能会有很大帮助。首先，让我们考虑一下这里的重要结果是什么：\n当精神病学家试图让病人非自愿地等待治疗时，法官会问五个问题：(1)你能给自己提供食物吗？(这个人只需要回答他们知道如何倾倒垃圾，并且他们知道当地的施舍厨房在哪里。)(2)你有避难所或者住的地方吗？(这里“我有下雨时用的防水布和立交桥下的毯子”就足够了。)你有衣服吗？(如果个人穿着得体，这在很大程度上就得到了回答。如果他们知道在寒冷的天气里到哪里去找外套，他们就会得到加分。)(4)你现在有自杀的冲动吗？有没有这样做的计划？(无处不在的抑郁、慢性自杀念头或以前的自杀企图都等同于‘不’的回答。)(5)你有没有攻击或杀死某个特定人的冲动和这样做的手段？(有暴力史，没有重点的杀人念头，比如“有时我想杀人”，或者高度警惕的攻击行为，“谁弄乱我的防水布或毯子，我就砸谁”，这些都等同于“不”的回答。)。(更多信息)。\n授权医疗、外科、牙科、精神和心理护理(尽管一些医疗治疗，如实验治疗，需要法院批准)。\n确保受保护的人受到适当的培训和教育，并确保该人有机会学习某一行业、职业或专业。\n依法保护、保全、管理和处置遗产，维护被保护人的最大利益。\n将受保护人的遗产用于受保护人和受保护人负有法律扶养义务的任何人的适当照顾、赡养、教育和扶养。(更多信息)。\n我将总结为：我们希望激励监护人为他们的病房实现这五个结果：\n在这些结果中，最容易激励的是资产保护。只需要求受保人的流动资产在交易中拍卖，以换取指数基金和非常低风险的资产(如国债)的某种组合。不要容忍监护人使用病房资产进行投资押注。特别是频繁更换赌注，这会增加很多交易费。如果能找到简单、廉价、客观的方式来选择，或许可以调整资产组合以获得税收优惠。\n关于谋生，创建一张工作券是很简单的，它支付被警卫的工资，必须支付他们的培训和工作通勤费用，谁可以选择被警卫的学校和工作。你可以通过拍卖的方式选择这张工作券，因为谁愿意支付最高的费用来承担这个角色。也许代金券对学校、工作的选择会受到工作时间限制等的限制。\n另一个似乎相当可行的激励结果是健康。使用我建议的医疗券(也称为。“生命维持组织”)，对于任何给定的预算，你都可以举行一次拍卖，看看谁愿意使用最高的健康价值作为该病房的代金券。您只需要指定几个关键参数，例如相对于疼痛和残疾的死亡值。一张同时充当工作券的医疗券将把危及健康的工作危险内在化。\n避免犯罪和其他法律责任可以通过我提议的法律凭证来激励。拍卖可以找到愿意以最低价格担保病房的代金券。要做到这一点，我们只需要设置几个参数，关于被拘留者对不同形式的惩罚的相对厌恶，以及隐私和自由的相对价值。\n满足病房欲望和异想天开的最简单方法是给他们每月或每天的预算，让他们随心所欲地消费，包括升级他们的娱乐、衣服和住房。另一种方法是让被守卫的人定期(每月？)。将满意度设置在[0，1]范围内，并向监护人支付某个设定金额的一小部分。这给了监护人一种激励，促使他们的监护人对他们的病房给予很高的满意度。然而，如果卫报立即看到这个数字，我担心他们可能会利用报复的威胁来诱导高收视率。所以也许可以让监护人在很多年内不会听到关于病房评级的消息。\n与其使用拍卖来分别为每个角色选择凭证，不如使用拍卖来选择一个体现所有这些角色的监护人，这可能更有意义。所需要的只是法律上允许这些角色中的每一个，并设定一些关键参数，以防止风险规避，以及与惩罚、隐私、自由、突发奇想、休闲、生活、残疾和痛苦的收入相关的价值观。看似合理的是，系统可以让病房在允许的范围内挑选这些参数的值。我们也可以让被监护人选择监护人合同的期限，同样在允许的范围内。\n是的，如果可以的话，我们可能希望监护人是父母或其他真正关心病房的人。是的，这当然不会产生一个完美的代理人，他会像他们的病房一样关心每一个问题。但与我们目前的制度相比，有激励的监护人可能是一个很大的进步。", "note_en": "There is an entire category of American adults being denied almost all of their basic legal rights: to hold a job, choose a residence, determine their health care, enter into contracts and even decide what to do with their own body. These are adults under legal guardianship — a court-imposed process, in Ohio as elsewhere, “by which a person is relieved of the right to make personal life decisions and another is appointed to make those decisions on that person’s behalf.” ( more)\n Claiming that some people can’t be trusted to run their own lives, legal judges give other people great power to run their lives for them:\n In the United States, a million and a half adults are under the care of guardians, either family members or professionals, who control some two hundred and seventy-three billion dollars in assets, … states do not keep complete figures on guardianship cases—statutes vary widely—and, in most jurisdictions, the court records are sealed. …\n In Nevada, as in many states, anyone can become a guardian by taking a course, as long as he or she has not been convicted of a felony or recently declared bankruptcy. … court placed no limits on guardians’ fees, as long as they appeared “reasonable.” … a quarter of guardianship petitions in New York were brought by nursing homes and hospitals, sometimes as a means of collecting on overdue bills. … Approximately ten per cent of people older than sixty-five are thought to be victims of “elder abuse” …\n When a friend tried to take him shopping, [his guardian] Parks prevented the excursion because she didn’t know the friend. [His wife] Rennie [North] had also tried to get more clothes. “I reminded ward that she has plenty of clothing in her closet,” Parks wrote. “I let her know that they are on a tight budget.” The Norths’ estate was charged $180 for the conversation. ( more)\n 428,000 children are in foster care in the United States. 135,000 children are adopted in the United States each year. ( more)\n If you worry about the accountability and wisdom of government officials who regulate what ordinary folks can do, you should worry more about such things regarding legal guardians, and those who pick them.\n The court will review the compensation paid to the guardian in the annual account filed by the guardian. … A guardian is generally paid an amount which is not more than 5% of the ward’s yearly income. ( more)\n Certain people, with ties to the ward, are preferred by courts as possible guardians. These include the person designated by the ward, before the period of incapacity occurred … In selecting the guardian, the court considers the prospective guardian’s character, history, physical capacity, and other relevant attributes. A potential guardian’s limited education or financial resources are not disqualifying conditions in and of themselves. …\n Absent negligence or conflict of interest, the guardian is generally not personally liable for any of the actions taken on behalf of the ward. In addition, the guardian is not liable for managing the ward’s estate if the guardian has acted as a prudent person would in dealing with the property of another. However, the guardian may be held liable for his/her actions where the ward’s property is damaged due to the careless acts of the guardian or if the guardian is personally at fault. …\n In some cases, the court will require a bond from the guardian to protect the ward financially. The bond is paid for by the ward’s estate and it protects the ward in the event the guardian’s mistake causes the estate to lose money. The amount of the bond is generally fixed at the total value of the estate property over which the guardian has unsupervised control, plus one year’s estimated income. …\n Guardian is not required to have any special skills. … A guardian is not required to expend his/her own funds on behalf of a protected person. However, a guardian may be held liable if they have failed in taking reasonable steps to assure that the protected person receives proper care and services, or the guardian has improperly managed the protected person’s property or finances. ( more)\n Yes, it can make sense to fill the guardian role with someone, like a parent, who seems to care greatly about the ward (i.e., person guarded). But if such a person is not available, the above procedures and precautions seem to me rather weak. We should consider giving guardians stronger incentives to do well for wards.\n It occurs to me that variations on vouching and other incentivized agent that I’ve been  considering lately might go a long way. First, lets consider what are the important outcomes here:\n There are five questions a judge will ask when a psychiatrist tries to put a patient on an involuntary hold for treatment: (1) Are you able to provide yourself with food? (The individual only need answer that they know how to dumpster dive and they know where the local soup kitchen is.) (2) Do you have shelter or a place to live? (“I have a tarp for when it rains and a blanket under an overpass for when it’s cold” is sufficient here.) (3) Do you have clothing? (If the individual is dressed, this is largely answered. If they know indicate they know where to find a coat in cold weather, the they get bonus points.) (4) Do you have the current urge to kill yourself and a plan to carry that out? (Pervasive depression, chronic suicidal thoughts, or previous suicide attempts are the same as a ‘no’ answer.) (5) Do you have the urge to attack or kill any specific person and the means to do so? (History of violence, unfocused homicidal thoughts such as ‘sometimes I feel like killing people’ or hyper-vigilant aggression ‘I’ll smash anyone who messes with my tarp or blanket’ are the same as a ‘no’ answer.) ( more)\n  Authorize medical, surgical, dental, psychiatric, and psychological care (although some medical treatments, such as experimental treatments, require court approval).\n Making sure the protected person is properly trained and educated, and that the person has the opportunity to learn a trade, occupation, or profession.\n  Protect, preserve, manage, and dispose of the estate according to law and for the best interest of the protected person.\n Use the protected person’s estate for the proper care, maintenance, education, and support of the protected person and anyone to whom the protected person owes a legal duty of support ( more)\n I’ll summarize this as: we want to incentivize guardians to achieve these five outcomes for their wards:\n  The easiest of these outcomes to incentivize is asset preservation. Just require the ward’s liquid assets to be sold at auction in trade for some mix of index funds and very low risk assets like Treasury bonds. Don’t tolerate guardians making investment bets using ward assets. Especially frequent changing bets that run up lots of transaction fees. Perhaps adjust asset mix for tax advantage  if simple cheap objective ways can be found to choose that well.\n Regarding earning a living, it would be straightforward to create a job voucher who is paid the guarded’s wages, must pay for their training and job commute, and who gets to choose the guarded’s schools and jobs. You could select this job voucher via auction as whomever is willing to pay the most to take on the role. Perhaps the voucher’s choices of schools, jobs would be constrained via limited work hours, etc.\n Another outcome that seems quite feasible to incentivize is health. Using my  proposed health vouchers (a.k.a. “life maintenance organizations”), for any given budget you could hold an auction to see who is willing to be that ward’s voucher using the highest health value. You’d just need to specify a few key parameters, such as values of death relative to pain and disability. A health voucher who also served as a job voucher would internalize the health-risking job dangers.\n Avoiding crime and other legal liabilities can be incentivized via my  proposed law vouchers. An auction could find the voucher willing to vouch for a ward for the lowest price. For this we’d just need to set a few parameters regarding the ward’s relative aversion to different forms of punishment, and relative values of privacies and freedoms.\n The simplest way to indulge the ward’s desires and whims is to give them a monthly or daily budget to spend as they like, including upgrading their entertainment, clothes and housing. Another approach would be for the guarded to regularly (monthly?) set a satisfaction rating in the [0,1] range, and pay the guardian that fraction of some set amount. This gives the guardian an incentive to induce high satisfaction ratings from their ward. However if the guardian gets to see that number immediately, I fear they may use the threat of retaliation to induce high ratings. So maybe make it so guardians don’t hear about ward ratings for many years.\n Instead of using auctions to select vouchers for each of these roles separately, it might make more sense to use an auction to select a single guardian who embodies all of these roles. All that is needed is for each of these roles to be legally allowed, and to set a few key parameters re ward risk-aversion, and values relative to income of punishments, privacy, freedoms, whims, leisure, life, disability, and pain. Plausibly, the system could let the ward pick values for these parameters within allowed ranges. We might also let the ward choose the duration of guardian contracts, again within an allowed range.\n Yes, if available we might prefer the guardian be a parent or other person who really cares about the ward. And yes of course this won’t create a perfect agent, who cares exactly about each issue in the same way that their ward does. But compared to our current system, incentivized guardians could be a big improvement.", "posttime": "2020-08-02 00:44:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "激励性,incentivized,监护人", "title": "激励性监护", "title_en": "Incentivized Guardianship", "transed": 1, "url": "https://www.overcomingbias.com/2020/07/incentivized-guardians.html", "via": "", "real_tags": ["激励性", "监护人"]}, {"category": "", "categoryclass": "", "imagename": "93de74f2f70c76789b7e22e6f3e77e76.jpeg", "infoid": 1015628, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在战胜癌症的长期努力中，医学研究人员有了一个惊人的发现：很多时候，他们不知道他们的抗癌药物是如何起作用的。而且，虽然听起来可能很奇怪，但这实际上对未来的医疗疗法来说是个好消息。\n“我们并不是说这些药物不好，”斯坦福大学的遗传学家Ann Lin解释说。她发现，它们确实能杀死癌细胞，而且常常相当不错；它们只是没有按照开发者认为的方式完成工作。她的工作突显了抗癌药物的发现在很大程度上仍然是基于反复试验的搜索。这就好像你的汽车修理工学会了通过踢挡泥板和敲打引擎盖直到它启动来修理你的车。这项技术可能会完成工作，但没有办法改进它，或者找出如果下一次失败了，哪里出了问题。林指出，同样，肿瘤学家经常被迫依赖药物，而不清楚它们的作用机制；本质上，他们是在分子水平上踢打肿瘤。\n了解他们不知道的那些药物是向前迈出的至关重要的一步。这使得林和她的同事们可以专注于真正杀死癌细胞的实际、特定的分子机制。既然这些机制已经确定，药物开发者将能够以同样的方式对其他治疗癌症的方法进行有针对性的搜索。\n更好的是，这还只是故事的一半。当林在识别可能导致新的抗癌药物的分子机制时，托德·戈卢布(Todd Golub)正在从另一端研究问题-识别可能导致新机制发现的抗癌药物。\nGolub是麻省理工学院和哈佛大学博德研究所和癌症项目的首席科学官和主任，他意识到，试错搜索实际上可能非常有用，如果有办法让它们变得快速有效的话。打个比方：如果你能迅速尝试一百万种不同的组合来敲打引擎盖和踢挡泥板，那么你无疑会发现令人惊讶的新方法来修理你的汽车。Golub实验室还开发了一种类似于癌症治疗的技术：开发了一种名为PRISM(同时在混合物中描绘相对抑制)的高速药物筛选过程，这一过程已经被证明是非常成功的。\nGolub认为林的目标研究和他自己的、基础广泛的药物搜索一起出现在一个名为癌症依赖性地图的抗癌工具的开源数据库中。他和他的同事将这张地图描述为“癌症精确医学的临床前基础”-在未来，研究人员不仅确切地知道他们的药物是如何起作用的，而且还知道如何最好地根据每个患者的需求量身定做。\n这些进展出现在一个关键时刻。美国国立卫生研究院(National Institutes Of Health)预计，今年美国将有60多万人死于癌症，占死亡人数的近四分之一。癌症治疗进展缓慢：“预计97%的抗癌药物不能通过临床试验，比其他任何领域都要多，”林说。与此同时，新冠肺炎大流行转移了短期研究对癌症的注意力，尽管冠状病毒对免疫系统受损的患者构成了更高的风险。\n当林书豪开始工作时，她完全没有想到自己会面临如此巨大的挑战。2017年，当她在冷泉港实验室杰森·谢尔策(Jason Sheltzer)的实验室担任研究人员时，她正在对癌细胞使用一种名为Melk的酶的方式进行一项看似常规的分析。许多研究已经确定癌细胞没有这种酶是不能生存的，所以它似乎是一个很有希望的脆弱点。几种阻止熔融的化合物已经作为潜在的抗癌药物进行了临床试验。\n林只是想更多地了解为什么梅尔克如此重要。她说：“这就是我们大吃一惊的时候。”\n利用一组名为CRISPR/CAS 9的基因编辑分子，林和她的合作者设计了一批不能产生任何Melk的癌细胞。然而，这些细胞并没有死亡，反而运行得很好。迷惑不解的她再次进行了实验；细胞又活了下来。该研究小组随后在其他五个假定的癌症靶点上进行了类似的实验，所有这些目标都在临床试验中至少有一种相关的抗癌药物。在每种情况下，癌细胞都不关心据称是药物靶点的特定基因。然而，不知何故，这些药物无论如何都在杀死癌细胞。\nCRISPR使林和她的团队能够详细检查其中一种抗梅尔克药物，从而帮助解开这个谜团。他们确定，这种药物攻击癌细胞的机制与其开发者认为的完全不同：它关闭了一种名为细胞周期蛋白依赖性激酶11(Cyclin-Dependent Kinase 11，简称CDK11)的酶，该酶调节癌症生长。研究人员之前曾试图开发阻断CDK11的药物，但没有成功-至少他们是这样认为的。事实证明，他们甚至在不知情的情况下击中了目标。\n有了这个更深层次的洞察力，肿瘤学家就可以开始开发更准确的抗癌治疗方法。即便如此，将这些药物推向市场仍将是一个复杂而耗时的过程。这就是戈卢布的用武之地。\n戈卢布的团队没有寻找杀死癌症的药物，研究它们的工作原理，最后测试它们是否安全，而是从已经清理出来供人类使用的医用化合物池开始。他们前往布罗德研究所的药物再利用中心进行勘探，这是一个巨大的未使用药物的集合，这些药物通过了安全测试，但在后期临床试验中表现不佳。大多数药物都是针对其他疾病开发的，但戈卢布怀疑其中一些偶然被证明对癌症有效。\n为了找出答案，他将4518种不同的药物与来自24种不同类型肿瘤的578种癌细胞株进行了对比。这听起来像是一个疯狂的反复试验的过程，而就在几年前，它还会是这样的。PRISM技术是它的实用性所在：通过在每个细胞系上附加一个遗传“条形码”，研究人员能够同时测试多个细胞系，并使整个数据密集型过程自动化。\n最终，Golub团队惊讶地发现，近50种被丢弃的药物具有抗癌活性。由于它们已经通过了安全测试，这些化合物现在可以更快地通过测试过程。更令人兴奋的是，在这项实验中标记的一些药物似乎以实验室以前没有见过的方式攻击癌症。这些新的抗癌药物是林进行的那种CRISPR分析的主要候选者，潜在地揭示了尚未发现的抗癌分子技术。\n沙特阿拉伯阿卜杜拉国王科技大学(King Abdullah University Of Science And Technology)已经开始将反复发现和有针对性的分析结合起来。该大学的生物信息学专家萨拉·阿尔萨拜蒂(Sara Althubaiti)已经创建了人工智能软件，该软件在描述癌症遗传学的大型数据库中进行筛选。人工智能搜索出以前未发现的DNA突变和癌症行为之间的关系。它已经确定了数十个潜在的抗癌靶基因-这类信息需要填写戈卢布的癌症依赖图。\n林很高兴看到她早期的，看似拙劣的实验为这次癌症的新攻击做出了贡献。她说，随着CRISPR的精确度和棱镜的广度一起工作，“我们也许能够创建一个更严格的临床前渠道。”不需要踢挡泥板。", "note_en": "In their long-running effort to defeat cancer, medical researchers have made a startling discovery: A lot of the time, they have no idea how their anti-cancer drugs work. And, strange as it may sound, that is actually great news for future therapies.\n  “We’re not saying these drugs aren’t good,” explains Ann Lin, a geneticist at Stanford University. They really do kill cancerous cells, often quite well; they just don’t do the job the way that their developers believed, she finds. Her work highlights how much of anticancer drug discovery is still based on trial-and-error searches. It’s as if your auto mechanic learned to fix your car by kicking the fenders and smacking the hood until it started. That technique might get the job done, but there would be no way to improve it or to figure out what went wrong if it failed the next time. Similarly, oncologists have often been forced to rely on drugs without a clear understanding of their mechanism of action, Lin notes; in essence, they were kicking and smacking the tumors at a molecular level.\n  Learning what they  don’t know about those drugs is a critically important step forward. It is allowing Lin and her colleagues to zero in on the actual, specific molecular mechanisms that really do kill cancerous cells. Now that those mechanisms are being identified, drug developers will be able to carry out targeted searches for other treatments that attack cancer the same way.\n  Better yet, that’s still only half of the story. While Lin is identifying molecular mechanisms that could lead to new anticancer drugs, Todd Golub is working the problem from the other end—identifying anticancer drugs that could lead to the discovery of new mechanisms.\n    Golub, the chief scientific officer and director of the Cancer Program at the Broad Institute of MIT and Harvard, realized that trial-and-error searches could actually be extremely useful if there were a way to make them fast and efficient. Extending the metaphor: If you could rapidly try a million different combinations of hood-smacking and fender-kicking, you would undoubtedly uncover surprising new ways to fix your car. The Golub Lab has developed a technique just like that for cancer treatments: a high-speed drug-screening process called  PRISM (profiling relative inhibition simultaneously in mixtures), which has already proven spectacularly successful.\n  Golub sees Lin’s targeted studies and his own, broad-based drug searches coming together in an open-source database of cancer-fighting tools called the  Cancer Dependency Map. He and his colleagues describe that map as “the preclinical foundation for cancer precision medicine”—a future in which researchers not only know exactly how their drugs work, but also how to tailor them best to the needs of each individual patient.\n  These advances come at a critical time. The National Institutes of Health projects that more than 600,000 people will die of cancer this year in the United States, accounting for nearly one out of every four deaths. Progress in cancer treatment has been slow: “Ninety-seven percent of cancer drugs are predicted to fail clinical trials, more than in any other field,” Lin says. Meanwhile, the COVID-19 pandemic has diverted short-term research away from cancer, even as the coronavirus poses a heightened risk to patients with compromised immune systems.\n  When Lin started out, she had no inkling she would be taking on such huge challenges. In 2017, while she was a researcher in the lab of  Jason Sheltzer at Cold Spring Harbor Laboratory, she was conducting a seemingly routine analysis of the way that cancer cells use an enzyme called MELK. Numerous studies had determined the cancer cells can’t live without that enzyme, so it seemed like a promising point of vulnerability. Several MELK-blocking compounds were already undergoing clinical trials as potential anti-cancer drugs.\n  Lin was merely trying to learn a little more about why MELK was so essential. “That&#39;s when we got the big surprise,” she says.\n  Using a set of gene-editing molecules known as CRISPR/Cas 9, Lin and her collaborators engineered a batch of cancer cells that couldn’t produce any MELK. Instead of dying, though, the cells carried on just fine. Puzzled, she ran the experiment a second time; again, the cells lived. The team then conducted similar experiments on five other supposed cancer targets, all of which also had at least one associated anti-cancer drug in clinical trials. In each case, the cancer cells didn’t care about the specific genes allegedly being targeted by the drugs. Yet, somehow, those drugs were killing cancer cells anyway.\n  CRISPR enabled Lin and her team to examine one of the anti-MELK drugs in detail, and thereby to  solve the mystery. They determined that the drug attacks cancer cells through a completely different mechanism than the one its developers thought they were going after: It shuts down an enzyme called cyclin-dependent kinase 11, or CDK11, which regulates cancer growth. Researchers had previously attempted to develop drugs that blocked CDK11, but without success—or so they thought. It turns out they had hit their target without even knowing it.\n  Armed with this deeper insight, oncologists can begin developing more accurate anti-cancer treatments. Even so, bringing those drugs to market will remain a complicated and time-consuming process. That’s where Golub comes in.\n  Instead of looking for drugs that kill cancer, studying how they work, and finally testing if they’re safe, Golub’s group started with a pool of medical compounds that had already been cleared for human use. They went prospecting in the Broad Institute&#39;s Drug Repurposing Hub, an enormous collection of unused pharmaceuticals that passed safety tests but didn’t perform well in late-stage clinical trials. Most of the drugs were developed for other diseases, but Golub suspected that some of them serendipitously would prove effective against cancer.\n  To find out, he pitted 4,518 different drugs against 578 cancer cell lines taken from 24 different types of tumors. It sounds like an insane process of trial-and-error, and just a few years ago it would have been. The PRISM technique is what makes it practical: By attaching a genetic “barcode” to each cell line, the researchers were able to test multiple lines at the same time and to automate the whole, data-intensive process.\n  In the end, Golub team was amazed to  discover that nearly 50 of the discarded drugs had anti-cancer activities. Since they had already passed safety trials, these compounds could now speed through the testing process. Even more exciting, some of the drugs flagged in this experiment seem to attack cancers in ways not seen in the lab before. These novel cancer-fighters are prime candidates for the kind of CRISPR analysis that Lin performs, potentially revealing undiscovered molecular techniques for fighting cancer.\n    That merger of trial-and-error discovery and targeted analysis is already beginning at King Abdullah University of Science and Technology in Saudi Arabia. Sara Althubaiti, a bioinformatics expert at the university, has created artificial-intelligence software that sifts through huge databases describing the genetics of cancer. The AI ferrets out previously undiscovered relationships between DNA mutations and cancer behavior. It has already identified dozens of potential anti-cancer target genes—the kind of information needed to fill in Golub’s Cancer Dependency Map.\n  Lin is heartened to see her early, seemingly botched experiments contributing to this new assault on cancer. With CRISPR precision and PRISM breadth working together, she says, “we might be able to create a more rigorous preclinical pipeline.” No fender-kicking required.", "posttime": "2020-08-02 00:43:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "癌症,fighting,药物", "title": "我们在抗击癌症方面比我们意识到的要好得多", "title_en": "We’re a Lot Better at Fighting Cancer Than We Realized", "transed": 1, "url": "http://cshl.nautil.us/article/593/why-were-a-lot-better-at-fighting-cancer-than-we-realized", "via": "", "real_tags": ["癌症", "fighting", "药物"]}, {"category": "", "categoryclass": "", "imagename": "c12cb8d754ebb15f9053a4e28a6f6188.jpg", "infoid": 1015627, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "活着的世界通过把小单元变成大结构，把混乱变成了秩序。一群鸟或一群鱼的高度协调-从单个个体的抽搐和颠簸反复建立起来-将本能行为变成了巨大而优雅的东西。这不仅仅是为了作秀。一只孤独的瞪羚无法躲避快速移动的狮子，也无法躲避滑溜溜、起伏不定的羊群。\n考虑到这一点，看看这段视频，视频中一辆卡车在5月份穿过明尼阿波利斯的抗议者。密密麻麻的抗议者从卡车的路径上盘旋而出，当卡车停下来时，他们又聚集在卡车周围。有一段时间，抗议者的动作看起来非常像是八哥对来袭的猎鹰的低语，或者可能是小鱼对鲨鱼的回应-就像船前的水一样分开，在入侵者周围漩涡，在它后面重新聚集。抗议者集体回应。\n这是投机性的，但请稍加理解：个人以不可预测的方式移动，但人-群体-的行为与任何其他生物集体非常相似。这些群体的运动从围绕和穿过障碍物的流体漩涡转变为拥堵的颗粒运动，以自发的自组织队形完成迁移等任务-或者对车辆等类似捕食者的行为做出反应，是的，执法行动也是如此。想一想“开壶”--一排排装甲兵包围抗议者--或者骑着自行车或骑马的军队横穿示威者的队伍。而且，就像所有的生物一样，这些群体也会适应。抗议者适应了警方的策略，警方也会做出回应，通常会使用更大的武力。但或许理解这种分散的、集体的行为可以提供一些选择，而不仅仅是对和平抗议的暴力回应。\n生物群体通常采用三种基本结构之一：局部化的蚂蚁群(想想正在捕猎的蜜蜂或蝙蝠)，一种围绕中心核心的碾磨或轨道运动(一群凤尾鱼)，或者是朝某个方向流动的流体(比如这群火蚁如此之大，以至于在天气雷达上都能看到)。\n现在想象一个公共空间，比如一个满是抗议者的公园，或者沿着林荫大道游行。一群人也可以采取这些形式中的任何一种，从碾压弥撒到游行。但是，就像物理物质的相--气体、液体和固体--这些结构可以从一种过渡到另一种。这些变化并不完全像经典的相变，比如冰融化成水，然后蒸发成水蒸气，因为这些变化涉及数十亿或万亿个单独的原子或分子。但在只有几十个生物的群体中，类似的变化确实会发生。小的和局部的互动在整个群体中以惊人的速度传播，使作品变得粘性，或者使整个集体的行动更加顺畅。\n德国康斯坦茨大学马克斯·普朗克行为研究所所长伊恩·库津(Iain Couzin)说：“当你在一个系统中有能量时-就像人推和拉一样-就会有各种各样的相变行为。”在局部相互作用中，随着密度的变化渗出，个体运动的速度也会改变。\n在动物群体中，行为变化的传播浪潮-就像一群改变方向的羊群-没有鸟、虫子或其他什么东西想太多就移动了。事实上，Couzin的团队认为，集体比其任何成员都更聪明，就像大脑比单个神经元更善于思考一样。非人类动物使这些相变对它们有利。“如果鸟儿听到鹰或瞪羚的尖叫声或闻到狮子的气味，它们就会戏剧性地改变结构，以便更有效地在整个群体中传播信息，”库津说。“互动网络会为你做计算。”从字面上看，网络空间配置的改变使其变得更具防御性，以确保所有成员的安全。\n人类在进化过程中没有做过任何这样的事情。“我们没有那种能力，”库津说。“我们与大量其他人互动的能力有限。”高压力、高强度的情况不会把一大群人转变成紧急的、有计算能力的网络。他们并不总是知道如何处理周围快速变化的信息。这可以包括非语言暗示，比如别人凝视的方向，或者看到其他人跑在一起或挤在一起。或者，它可以是像喊叫这样的语言交流信号，或者在更广泛的空间和时间尺度上，可以是短信或电话。但人类并不总是以积极的方式使用这些信号。如果误解，它们可能会导致混乱和灾难-就像2015年麦加麦加朝圣期间发生的拥挤事件一样，当两大群人试图通过同一个瓶颈路口时，可能导致多达2400名朝圣者死亡。\n时空尺度是区别的关键。线索移动得很快，可以对改变行为产生深远的影响。这让我们回到了抗议的背景下。库津说：“在任何一种处于相变边缘的拥挤情况下，在这种危急的状态下，少数几个人都可能产生巨大的影响。”“人群气氛紧张，然后有人尖叫‘炸弹！’造成巨大的恐慌，因为人群有足够的密度。“。(当然，快速传播的线索不必在人群中制造混乱-在香港，抗议者去年使用简单的手势发出关于组织和部署医务人员等专门示威者团队的复杂沟通信号)。\n重要的是，哪一方先被吓到并不重要。执法部门的突然或意想不到的举动可能会让示威者感到恐慌，反之亦然。但执法部门显然广泛使用暴力，或使用烟雾和催泪瓦斯等化学武器，可能会引发恐慌。库津说：“这就是为什么当你有这种类型的事件时，它是如此危险。”“他们两个都已经准备好要爆炸了。你不需要太多就能触发它。“。\n像开水壶这样的执法策略似乎更有可能导致糟糕的结果。一点点暴力或明显的暴力-来自一群和平抗议者中的极端分子，或者来自一堵身着防暴装备的身份不明的准军事部队-不仅中心不能站稳脚跟，边缘也不能站稳脚跟。在灾难中，人群有时会惊慌失措，猛烈撞击寻找出口的墙壁。现代警察的战术，即用盾牌形成一条小冲突线，向抗议者内部移动，可能-强调力量；这是假设-可能是相反的，一堵墙向他们移动。有时甚至不是故意的。2010年，德国爱情游行电子舞蹈节发生拥挤事件，造成21人死亡，部分原因是警方形成了路障，希望引导人们走向出口。\n但是，如果抗议者知道，他们在行使宪法赋予的示威权利时，几乎会不由自主地采取集体行动-如果执法人员也知道他们会这样做-如果双方都知道对方知道的话，那可能会打开一条渠道，让暴力策略降温。犯罪学家、亚利桑那州立大学暴力预防和社区安全中心副主任爱德华·马奎尔(Edward Maguire)表示：“我认为，警方对这类事件的战略反应将考虑如何中断那些来回针锋相对的交流，其中一些本质上是报复性的，”犯罪学家、亚利桑那州立大学暴力预防和社区安全中心副主任爱德华·马奎尔(Edward Maguire)说。“不考虑那些事情的警察部门可能会被无意识地卷入其中，我们需要的是让警察成为房间里的成年人。”\n马奎尔正在培训警察，以便更早、更密切地与抗议者和组织者接触，他担心，如果不这样做，情况只会变得更糟-人们会死亡，执法部门会继续加大赌注，抗议者也会做出同样的回应。水壶、化学武器和橡皮子弹还会源源不断。他说：“只要警察的行为被认为是非法的，或者在这种情况下是公然违宪的，温和派抗议者就很难说服他们中那些喜欢更极端策略的人。”“越是极端的抗议者认为他们的所作所为在道义上是正当的。温和派抗议者所占的比例要大得多，他们可能不会与他们意见相左。“。这是它自己的一种相变-类似于变化-从示威到起义。\n🎙️收听“连线”，这是我们关于未来如何实现的新播客。收看最新剧集，订阅📩时事通讯，跟上我们所有节目的最新动态。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "The living world turns chaos into order by making large structures out of small units. The sublime coordination of a flock of birds or a school of fish—built iteratively from the twitches and bumps of single individuals—turns instinctive behaviors into something vast and graceful. It’s not just for show. A lone gazelle can’t evade a fast-moving lion anywhere near as well as a slippery, undulating herd.\n With that in mind, take a look at  this video of a truck barreling through protesters in Minneapolis in May. The densely packed protesters swirl out of the truck’s path, then close ranks back around it when the truck stops. For a few moments, the movements of the protesters look very much like a murmuration of  starlings  responding to an attacking falcon, or maybe  little fish to a shark—parting like water in front of a boat, swirling in eddies around the invader, regrouping behind it. The protesters respond as a collective.\n This is speculative, but roll with me a little: Individual persons move in unpredictable ways, but people—crowds—behave very much like any other collective group of living creatures. The motion of those groups switches from fluidic swirls around and through barriers to jammed-up particulate movement, in spontaneously self-organized formations that accomplish tasks like migration—or respond to predator-like behavior from things like vehicles and, yes, law enforcement moves. Think of “kettling”—walls of armored men encircling protesters—or troops mounted on bikes or horses cutting across lines of demonstrators. And, like all living things, these groups adapt. Protesters adapt to police tactics, and the police respond, often with greater force. But maybe understanding this kind of distributed, collective behavior can provide some options beyond a violent response to peaceful protest.\n  Collectives of living things generally take one of three fundamental structures: a localized swarm (think bees or bats on the hunt), a sort of milling or orbiting around a central core (a school of anchovies), or a fluid-like flow in a direction (like  this swarm of fire ants so big it showed up on weather radar).\n Now imagine a public space like a park full of protesters or a march down a boulevard. A crowd of people can take on any of those forms as well, from milling mass to parade. But like the phases of physical matter—gas, liquid, and solid—those structures can transition from one to the other. The changes aren’t exactly like classical phase transitions, like ice melting to water and then evaporating to steam, because those involve billions or trillions of individual atoms or molecules. But in groups of just a few dozen living things, similar changes do happen. Small and local interactions propagate with startling speed through the group, gumming up the works or making the whole collective move more smoothly.\n  “When you have energy in a system—like people pushing and pulling—there’s all sorts of phase transition-like behavior,” says Iain Couzin, director of the Max Planck Institute of Behavior at the University of Konstanz in Germany. “At the local interactions, as the change in density percolates out, the speed of individual movement changes.”\n  In animal groups, that propagating wave of change in behavior—like a flock changing direction—moves without the birds, bugs, or whatever thinking much about it. In fact, Couzin’s team has  argued that a collective is smarter than any of its members, like a brain being better at thinking than a single neuron. Nonhuman animals make these phase changes work to their advantage. “If birds hear the screech of an eagle or gazelle smell a lion, they&#39;ll dramatically change configuration to more effectively propagate information across the collective,” Couzin says. “The network of interactions does the computation for you.” The change in the network’s spatial configuration literally allows it to become more defensive, to keep all the members safer.\n  Humans didn’t evolve to do any of that. “We don’t have that capability,” Couzin says. “We’re limited in our ability to interact with large numbers of others.” High-stress, high-intensity situations don’t convert big groups of people into emergent, calculating networks. They don’t always know what to do with the fast-moving information around them. That can include nonverbal cues like the direction of someone else’s gaze, or the sight of other people running or crowding together. Or it can be verbal communication signals like shouts or, on a wider spatial and temporal scale, text messages or phone calls. But humans don’t always use those signals in positive ways. Misunderstood, they can lead to chaos and disaster—“crowd panics” like the  crush during the Hajj in 2015 in Mecca that killed perhaps as many as  2,400 pilgrims, caused when two massive groups of people tried to pass the same bottlenecked intersection.\n Spatiotemporal scale is the key difference. Cues move fast and can have a profound effect on changing behavior. Which brings us back to the context of a protest. “In any kind of crowded situation that’s at the edge of a phase transition, in this critical-like state, a few individuals can have a huge impact,” Couzin says. “There’s tension in the crowd, and then someone screaming ‘Bomb!’ creates a huge wave of panic, because the crowd has sufficient density.” (Fast-propagating cues don’t have to sow chaos among people, of course—in  Hong Kong, protesters last year used simple hand signs to send complex communication signals about organization and the deployment of specialized teams of demonstrators like medics).\n Importantly, it doesn’t matter which side freaks out first. A sudden or unexpected move from law enforcement can panic demonstrators, and vice versa. But the apparent widespread use of violence by law enforcement, or of chemical weapons like smoke and tear gas, can be a panic starter. “That’s why it’s so damn dangerous when you have these types of events,” Couzin says. “Both of them are ready to blow up. You don’t need much to trigger it.”\n Law enforcement tactics like kettling seem like they might make bad outcomes more likely. One bit of violence or apparent violence—from an extremist in a crowd of peaceful protesters, or from a wall of unidentified paramilitary troops in riot gear—and not only does the center not hold, the edges don’t either. In a disaster, crowds sometimes panic and bash themselves against walls looking for exits. The modern police tactic of forming a skirmish line with shields and moving inward toward protesters might—emphasizing the  might; this is hypothetical—be the inverse, a wall moving toward them. Sometimes it’s not even intentional. In 2010, 21 people died in a crush incident at the  Love Parade electronic dance festival in Germany, in part because police formed barricade lines hoping to guide people toward the exits.\n But if protesters know that they’re going to almost involuntarily act as a collective while engaging in their constitutional right to demonstrate—and if law enforcement personnel know they will too—and if both sides know the  other side knows—that could open up a channel to cool off  violent tactics. “I think strategic police responses to these types of events are going to take into account how to interrupt those back-and-forth, tit-for-tat types of exchanges, some of which are sort of retaliatory in nature,” says Edward Maguire, a criminologist and the associate director of Arizona State University’s Center for Violence Prevention and Community Safety. “Police departments that are not thinking about those things can be mindlessly caught up in it, and what we need is for the police to be the adult in the room.”\n  Maguire, who’s working on training police to engage earlier and more closely with protesters and organizers, worries that things will only get worse if they don’t—people will die, law enforcement will keep upping the ante, and protesters will respond in kind. The kettling, chemical weapons, and rubber bullets will keep coming. “As long as the police behave in a manner perceived as illegitimate, or in this case blatantly unconstitutional, it’s a really difficult sell for moderate protesters to talk down those among them who prefer more extreme tactics,” he says. “The more extreme protesters feel morally justified in what they&#39;re doing. You have a much greater share of moderate protesters who may not disagree with them.” That’s its own kind of phase transition-like change—from demonstration to uprising.\n   🎙️ Listen to  Get WIRED, our new podcast about how the future is realized. Catch the  latest episodes and subscribe to the 📩  newsletter to keep up with all our shows\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-08-02 00:43:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "是否,crowds,抗议者", "title": "抗议期间的人群是否类似于动物蜂拥而至的行为？", "title_en": "Do Human crowds during protests resemble animal swarming behavior?", "transed": 1, "url": "https://www.wired.com/story/what-the-science-of-animal-networks-reveals-about-protests/", "via": "", "real_tags": ["是否", "crowds", "抗议者"]}, {"category": "", "categoryclass": "", "imagename": "eaedfc8bd841d75e1ebb647a52b3f218.jpg", "infoid": 1015625, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Instagram正在转型--这个曾经分享美食和社交出游照片的地方正迅速成为信息和倡导的中心。\n重要原因：随着大流行和种族正义运动给数百万用户带来了目标和关注，Instagram上的文本、信息图表和热门插图正在爆炸式增长，增强了接受教育和分享有用信息的紧迫性。\n大局：2020年是这一变化的完美风暴：大流行结束了用户通常发布的所有乐趣，同时也创造了对可靠健康信息的迫切需求。\nTwitter和Facebook上的信息生态系统根深蒂固，让许多人-特别是倾向于年轻的Instagram人群-寻找新的运营场所。在乔治·弗洛伊德(George Floyd)和布雷娜·泰勒(Breonna Taylor)被杀之后，它不仅为信息做好了准备，也为激进主义做好了准备。\n数字顾问、前电视新闻制片人莫希·奥伊努努努(Mosheh Oinounou)在接受Axios采访时表示，Instagram感觉像是一个干净、重新开始的地方。\n在过去的几个月里，Oinounou创建了一个信息性的Instagram，收集了关于这场流行病的所有最新头条、数字和事实核查。\n他说，2020年夏天，Instagram上的故事看起来尤其像是人们越来越多地转向图表、信息图、语录和头条新闻的时候，因为他们觉得新闻让他们不知所措。\n从数字上看：倾向于这一趋势的账户已经看到了它们的快速增长。\n账号@soyouwanttotalkabout专门发布进步话题的信息传送带，其追随者已经从6月中旬的12.5万增长到现在的近100万追随者。\n自6月份推出以来，@教育者争取正义的粉丝已经增长到16万，而@多元化你的叙事在一个月内从0增长到了5万。\n像@jenerous和@the lacktivists这样的账号的追随者几乎翻了一番，这得益于病毒式的帖子，比如如何与家人谈论种族主义，以及为什么人们说要撤资警察？\n较大的出版商也从这一趋势中受益。根据CrowdTangle的数据，@ProPublica已经在发布以文本为中心的信息，在过去的6个月里有70%的追随者增长，几乎所有的追随者都来自3月中旬大流行爆发以来。\n这一趋势也在改变出版商的战略：根据Axios的一项分析，Refinery29(240万粉丝)从1月份基于文本的信息帖子的41%上升到7月份的72%，而Business Insider(230万)从5%上升到48%。\n字里行间：2018年年中，Instagram传播信息的方式发生了关键转变，当时这款应用允许用户分享从订阅源到他们的故事的帖子，开启了一对多的分享机制，允许帖子获得大量受众。\nInstagram没有像其他主要社交网络那样的传统分享按钮来推动病毒式传播。\nJen Winston经营着一家以信息为中心的进步网站@jenerous，她说，这一功能对于这些信息的传播方式是不可或缺的。\n看点：随着信息和观点在Instagram体验中占据更大比重，虚假信息可能会遇到困扰其他主要社交网络的同样问题-包括拥有Instagram的Facebook。", "note_en": "Instagram is in the midst of a transformation — what was once the place to share photos of food and social outings is quickly becoming a hub for information and advocacy.\n Why it matters: Text, infographics and topical illustrations are exploding on Instagram as the pandemic and racial justice movement brought purpose and focus to its millions of users, supercharging the urgency to get educated and share useful information.\n The big picture: 2020 has been a perfect storm for this change: The pandemic put an end to all the fun that users typically posted, while also creating a pressing need for reliable health information.\n The information ecosystems on Twitter and Facebook are well entrenched, leaving many people — particularly the younger-skewing Instagram crowd — to seek a new place to operate. And then in the wake of George Floyd and Breonna Taylor&#39;s killings, it was primed not just for information, but activism.\n &#34;Instagram felt like a place for a clean, fresh start,&#34; Mosheh Oinounou, a digital consultant and former TV news producer, tells Axios.\n Oinounou over the past few months has  created an informational Instagram, pulling in all of the latest headlines, numbers and fact checks about the pandemic.\n &#34;The summer of 2020 has been a time where Instagram Stories especially seem like a place where people are increasingly turning to charts, infographics, quotes and headlines because they feel overwhelmed by the news,&#34; he said.\n By the numbers: Accounts that have leaned into this trend have seen their growth skyrocket.\n The account  @soyouwanttotalkabout, which exclusively posts info-carousels on progressive topics, has seen its following grow from 125k in mid-June to nearly a million followers now.\n @educatorsforjustice has grown to 160k followers since launching in June, while  @diversifyournarrative has gone from 0 to 50k in a month.\n Accounts like  @jenerous and  @theslacktivists have nearly doubled their followings, helped by viral posts like &#34; How to talk to your family about racism&#34; and &#34; Why do people say defund the police?&#34;\n Larger publishers are also benefitting  from the trend.  @ProPublica, which had already been posting text-centric information, saw 70% follower growth in the last 6 months, almost all coming since the onset of the pandemic in mid-March, according to CrowdTangle data.\n This trend is altering publisher strategy as well: Refinery29 (2.4m followers) went from 41% text-based info posts in January to 72% in July, according to an Axios analysis, while Business Insider (2.3m) went from 5% to 48%.\n Between the lines: A key shift in how information on Instagram spreads came in mid-2018, when the app allowed users to share posts from the feed to their Stories, unlocking a 1-to-many share mechanism that allowed posts to get massive audiences.\n Instagrams doesn&#39;t have a traditional share button to drive virality like other major social networks.\n &#34;That feature has been integral to the way that this information is able to travel,&#34; says Jen Winston who runs the progressive, info-centric  @jenerous.\n What to watch: As information and opinion become a bigger part of the Instagram experience, it could run into the same problems with disinformation that have plagued other major social networks — including Facebook, which owns Instagram.", "posttime": "2020-08-02 00:17:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "信息,morphs", "title": "Instagram变身为信息发电站", "title_en": "Instagram Morphs into an Information Powerhouse", "transed": 1, "url": "https://www.axios.com/instagram-information-coronavirus-george-floyd-706d1ad3-9d6d-48d4-b085-3469a0d93b56.html", "via": "", "real_tags": ["信息", "morphs"]}, {"category": "", "categoryclass": "", "imagename": "9348283e87734ea788a86b7131bfb663.png", "infoid": 1015624, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Semver技巧指的是将破坏性更改发布到Rust库，而不需要跨其下游依赖图进行协调升级。诀窍在于让您的库的一个版本声明对同一个库的较新版本的依赖。\n铁锈图书馆生态系统曾经历过创伤性的图书馆升级。Libc从0.1升级到0.2被称为libc启示录。另一个常见的罪魁祸首是1.0版之前的Serde，从0.7到0.8再到0.9到1.0的升级需要整个生态系统的努力。\n困难的原因是大量的板条箱在它们的公共API中使用这些库中的类型。\n例如，假设libc机箱的简化版本只公开两个内容：c_void类型和来自NetBSD的EVFILT_AIO常量。\n//libc 0.2.0 pub type c_void=/*复杂*/；pub const EVFILT_AIO：int32_t=2；\n随着数百个库希望公开与C&#39；的void*类型兼容的函数，c_void类型得到了广泛使用。同时，EVFILT_AIO常量较少使用，并且从未在下游板条箱的公共API中使用。\nExtern{//Usable From C As：/void qsort(void*base，//size_t items，//size_t size，//int(*compar)(const void*，const void*))；/`c_void`类型现在是该机箱的公共接口的一部分。Pub FN qort(base：*mut c_void，items：usize，size：usize，compar：option&lt；unsafe extern fn(*const c_void，*const c_void)-&gt；c_int&gt；)；}。\n一段时间后，发现EVFILT_AIO应该定义为uint32_t，而不是int32_t，以匹配NetBSD头文件(rust-lang/libc#506)中其他地方使用它的方式。\n此修复将是对libc机箱的突破性更改。将libc：：EVFILT_AIO传递给接受int32_tw型参数的函数的现有代码将被破坏，这需要反映在libc机箱的半个版本中。\n//libc 0.3.0 pub type c_void=/*复杂*/；pub const EVFILT_AIO：uint32_t=2；\n尽管c_void的定义没有改变，但从技术上讲，libc 0.2中的c_void和libc 0.3中的c_void是不同的类型。在Rust中(就这一点而言，在C中一样)，两个结构不能互换，因为它们看起来相同。\n也就是说，如果板条箱A依赖于依赖于libc的板条箱B，而B在A调用的某个函数的公共API中使用c_void，那么在B升级到libc 0.3之前，A不能升级到libc 0.3。如果A在B之前升级，则A将尝试将libc0.3的c_void传递给B的函数，该函数仍然需要libc0.2的c_void，并且不会编译。\n需要做的是，首先B升级到libc 0.3，将其作为B的主版本bump发布(因为它的公共API发生了突破性的变化)，然后A可能会升级到B的新版本。\n对于较长的依赖链来说，这是一个巨大的考验，需要数十个开发人员的协作防御。在最近的图书馆启示录期间，Servofound自己在三个月的时间里协调了52个图书馆的升级(伺服/伺服#8608)。\n问题的核心是一个被广泛使用的API陷入了一个不那么广泛使用的API的崩溃之中。铁锈和货物能够更好地解决这一困境。\n在做出重大更改并将其发布为libc 0.3.0之后，我们将发布0.2系列的一个最终次要版本，并从0.3重新导出未更改的API。\n//libc 0.2.1外部板条箱libc；//根据Cargo.toml pub use libc：：c_void；pub const EVFILT_AIO：int32_t=2拉入0.3；\n这样，我们就避免了具有两个看起来相同但不可互换的c_void类型的问题。这里，来自libc 0.2.1的c_void和来自libc 0.3.0的c_voidfrom是完全相同的类型。\n因为libc的用户可以随意地、以任何顺序从0.2升级到0.3，而不需要升级他们自己的主版本，所以避免了libcpoalyning的情况。\n只要稍加小心和创新，上述技术就可以推广到多种不同的突变情况。本回购中包含的半技巧示例板条箱演示了一些可以适应的更改类型。\n从根本上说，当机箱需要打破常用的API而保持广泛使用的API不变时，或者当机箱想要在其模块层次结构中调整类型时，Semver技巧是有益的。\n大多数其他类型的破损都无助于此，包括下面的具体例子：\n使用相同的技巧撞击不是其本身的公共依赖的主要版本，\n在半小时技巧不适用的情况下，可以通过其他方式减轻破坏更改的影响。\nSerde遗留填补展示了一种允许下行库跨库的多个不兼容版本同时提供特征隐含的技术。\nRust API指南的“未来校对”一章给出了一些设计API的建议，这些API从一开始就不需要破坏性更改。\n就其构成可受版权保护的作品而言，依赖于同一库的未来版本的想法是根据CC01.0通用许可证(License-CC0)许可的，并且可以在没有归属的情况下使用。本文档和附带的半技巧示例机箱根据您的选择使用Apache License、版本2.0(License-Apache)或MIT License(License-MIT)进行许可。除非您另有明确说明，否则您故意提交以包含在此代码库中的任何贡献(如Apache-2.0许可证中所定义)应如上所述进行双重许可，不受任何附加条款或条件的限制。", "note_en": "The semver trick refers to publishing a breaking change to a Rust librarywithout requiring a coordinated upgrade across its downstream dependencygraph. The trick is built around having one version of your library declare adependency on a newer version of the same library.\n   The Rust library ecosystem has a history of traumatic library upgrades. Theupgrade of   libc from 0.1 to 0.2 is known as the &#34;libcpocalypse&#34;. Anotherfrequent culprit was pre-1.0  Serde, with the upgrades from 0.7 to 0.8 to 0.9to 1.0 requiring ecosystem-wide effort.\n The cause of the difficulty was the large number of crates using types fromthese libraries in their public API.\n By way of example, consider a simplified version of the  libc crate thatexposes only two things: the  c_void type and the  EVFILT_AIO constant fromNetBSD.\n // libc 0.2.0 pub  type  c_void =  /* it&#39;s complicated */; pub  const EVFILT_AIO: int32_t  =  2;\n The  c_void type becomes widely used as hundreds of libraries want to exposefunctions that are ABI-compatible with C&#39;s  void * type. Meanwhile the EVFILT_AIO constant is less commonly used and never in the public API ofdownstream crates.\n extern {  // Usable from C as:  //  // void qsort(void *base,  // size_t nitems,  // size_t size,  // int (*compar)(const void *, const void*));  //  // The `c_void` type is now part of the public API of this crate.  pub  fn  qsort(base:  * mut c_void, nitems:  usize, size:  usize, compar:  Option&lt;unsafe extern fn( *const c_void,  *const c_void) -&gt; c_int&gt;);}\n After some time, it is discovered that  EVFILT_AIO should have been defined as uint32_t rather than  int32_t to match how it is used elsewhere in NetBSDheader files ( rust-lang/libc#506).\n This fix would be a breaking change to the  libc crate. Existing code thatpasses  libc::EVFILT_AIO to a function accepting an argument of type  int32_twould be broken, and this needs to be reflected in the semver version of the libc crate.\n     // libc 0.3.0 pub  type  c_void =  /* it&#39;s complicated */; pub  const EVFILT_AIO: uint32_t  =  2;\n Despite the fact that the definition of  c_void has not changed, technicallythe  c_void from libc 0.2 and the  c_void from libc 0.3 are different types.In Rust (as in C, for that matter), two structs are not interchangeable justbecause they look the same.\n That means if crate A depends on crate B which depends on  libc, and B uses c_void in the public API of some function called by A, then A cannot upgradeto libc 0.3 until B has upgraded to libc 0.3. If A upgrades before B, then A isgoing to try to pass libc 0.3&#39;s  c_void to B&#39;s function that still expects libc0.2&#39;s  c_void and will not compile.\n What needs to happen is first B upgrades to libc 0.3, releases this as a majorversion bump of B (because its public API has changed in a breaking way), andthen A may upgrade to the new version of B.\n For longer dependency chains this is a huge ordeal and requires coordinatedeffort across dozens of developers. During the most recent libcpocalypse, Servofound themselves coordinating an upgrade of 52 libraries over a period of threemonths ( servo/servo#8608).\n   At the heart of the problem is having a widely used API caught up in thebreakage of a much less widely used API. Rust and Cargo are capable of handlingthis predicament in a better way.\n  After making the breaking change and publishing it as libc 0.3.0, we release onefinal minor version of the 0.2 series and re-export the unchanged API(s) from0.3.\n    // libc 0.2.1 extern  crate libc;  // this pulls in 0.3 as per Cargo.toml pub  use libc ::c_void; pub  const EVFILT_AIO: int32_t  =  2;\n This way we avoid the problem of having two  c_void types that look the samebut are not interchangeable. Here the  c_void from libc 0.2.1 and the  c_voidfrom libc 0.3.0 are precisely the same type.\n The libcpocalypse scenario is averted because users of  libc can upgrade from0.2 to 0.3 at their leisure, in any order, without needing to bump their ownsemver major version.\n   With some care and creativity, the technique above can be generalized to lots ofdifferent breaking change situations. The  semver-trick example crate includedin this repo demonstrates some types of changes that can be accomodated.\n     Fundamentally the semver trick is beneficial when a crate needs to break ararely used API while leaving widely used APIs unchanged, or when a crate wantsto shuffle types around in its module hierarchy.\n Most other types of breakage are not helped by this trick, including thefollowing concrete examples:\n Bumping a major version of a public dependency that is not itself using thesemver trick,\n   Where the semver trick is not applicable, it can be possible to mitigate theimpact of breaking changes in other ways.\n The  Serde legacy shims demonstrate a technique for allowing downstreamlibraries to provide trait impls simultaneously across multiple incompatibleversions of a library.\n The  Future Proofing chapter of the Rust API guidelines gives somesuggestions for designing APIs that do not require breaking changes in thefirst place.\n   To the extent that it constitutes copyrightable work, the idea of depending on afuture version of the same library is licensed under theCC0 1.0 Universal license ( LICENSE-CC0)and may be used without attribution. This document and the accompanying semver-trick example crate are licensed under either ofApache License, Version 2.0 ( LICENSE-APACHE)orMIT license ( LICENSE-MIT)at your option.  Unless you explicitly state otherwise, any contribution intentionally submittedfor inclusion in this codebase by you, as defined in the Apache-2.0 license,shall be dual licensed as above, without any additional terms or conditions.", "posttime": "2020-08-01 23:53:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "塞缪尔,semver,void", "title": "塞缪尔把戏", "title_en": "The Semver Trick", "transed": 1, "url": "https://github.com/dtolnay/semver-trick/", "via": "", "real_tags": ["塞缪尔", "semver", "void"]}]