[{"category": "", "categoryclass": "", "imagename": "311ebf61da3005fd5526666c356bc384.png", "infoid": 1068168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于新加坡的创业公司宣布，它已经筹集了700万美元的LocalGlobe领导的种子资金，并参与了社会杠杆，Y组合者，Picus首都和猛禽集团。这回合还包括天使投资者，如马特罗宾逊，Gocardless的联合创始人; Carlos Gonzalez-Cadenas，Skyscanner前首席产品官员;弗兰克施特劳斯，德意志银行全球数字业务的前负责人;和乔尔yarbrough，亚太地区的raphyd。\n 罗拉德是在2019年由大卫·格兰特，诺曼韦诺·诺戈和罗哈特穆拉尼成立的。它的应用程序在三个月前推出，目前只邀请。塔罗德索赔注册已经增长了20％的周，现在拥有超过10万用户遍布全球。大约65％的塔罗德的用户之前有股票，而其余的是首次投资者。\n  该公司首席执行官Mulani告诉TechCrunch，当他对美国股票感兴趣时，种植了Gotrade的想法，但发现了许多交易障碍。\n “当我18岁时，我实际上看着在新加坡获得访问，银行每笔交易每次收取30美元。有效地，市场教会了我无法进入市场。快进十年，我决定再次调查它，银行仍在收取25美元的贸易，“他说。 “最重要的是，他们的用户界面是我不想看的东西。因此，我们决定建立一个常务能够获得访问的经纪平台。“\n “分数交易实际上有点稍后，”他补充道。 “这对我们来说是真正的MVP，因为小数真的让任何人都能在全球范围内投资，因为你所需要的只是一美元。”\n 罗宾情绪，SOFI和Stash所有特征分数交易，但Mulani表示，这些应用程序主要用于美国居民。另一方面，由于财务法规，美国居民无法使用塔罗德，因此其主要竞争对手是互动经纪人，萨克索银行和etoro。\n GoTrade不收取佣金，监管，不活动或股息费用。相反，它通过收取从存款的货币兑换的少量费用，并从经纪账户中取得的现金产生的兴趣。该应用程序可以自由使用，但计划添加用户可以链接到其帐户的高级支付订阅计划和虚拟借记卡。 \n塔罗拉德的用户是投资于当地股市的人，但不能以前贸易美国股票。它们在年龄差异很大，但25至34岁的是应用最大的细分市场，平均账户规模约为500美元。\n GoTrade作为Alpaca Securities LLC的推出经纪人，由金融行业监管机构（FINRA）监管，并作为中介。 Alpaca证券将其库存库存分成分数，塔雷德用户可以决定他们想要购买多少分数。该应用程序还允许他们设置预算，并自动计算通过名义价值交易所提供的分数股份的数量。\n 通过证券投资者保护公司（SIPC）保护用户账户高达500,000美元，并通过新加坡等的交易对手，如Rapyd和美国，包括羊魄和第一个共和国银行。为了保护用户，ToTrade仅使用完全资助的现金账户，没有任何保证金设施。 MULANI解释说，保证金账户有效意味着人们借钱投资，而完全资助的账户意味着用户只能投入他们已经存入其帐户的资金。芬兰和证券交易委员会规定还意味着25,000美元的账目只有日常贸易，或在同一天购买和销售安全，每五个交易日最多三次。\n 与何种投资应用程序一样，罗拉德包括教育内容，如具有投资条款定义的窗口，以及关于公开交易公司的新闻艺术品。其新资金将用于招聘和产品开发，强烈关注添加更多应用内容。\n 在一份声明中，LocalGlobe合作伙伴Remus Brett表示，“在过去的100年里，美国股票已经提供了10％的平均年度返回。随着复合，1,000美元的投资将于今天的价值1300万美元。这些回报在美国和其他发达市场中促进了财富创造，但世界上的大部分都错过了。我们认为塔罗德有可能帮助世界99％的收益获得同样的福利，即1％的人。在这段旅程中，我们非常兴奋地加入Rohit，David和Norman。“ ", "note_en": "The Singapore-based startup announced it has raised $7 million in seed funding led by LocalGlobe, with participation from Social Leverage, Y Combinator, Picus Capital and Raptor Group. The round also included angel investors like Matt Robinson, co-founder of GoCardless; Carlos Gonzalez-Cadenas, former chief product officer of Skyscanner; Frank Strauss, former head of Deutsche Bank’s global digital business; and Joel Yarbrough, Asia-Pacific head at Rapyd.\n GoTrade was founded in 2019 by David Grant, Norman Wanto and Rohit Mulani. Its app launched three months ago and is currently invite-only. Gotrade claims sign-ups have grown 20% week-on-week, and it now has more than 100,000 users spread across the world. About 65% of Gotrade’s users have traded stocks before, while the rest are first-time investors.\n  Mulani, the company’s chief executive officer, told TechCrunch that the idea for Gotrade was planted when he became interested in American stocks, but discovered many barriers to trading.\n “When I was 18, I actually looked to get access in Singapore, and banks were charging $30 per trade. Effectively, the market taught me that I could not get into the market. Fast forward ten years, I decided to look into it again, and the banks were still charging $25 a trade,” he said. “On top of that, their user interfaces were something I didn’t want to look at. So we decided to build a brokerage platform where anyone can get access.”\n “Fractional trading actually came a bit later,” he added. “That was the real MVP for us because fractional really makes investing accessible to anyone globally since all you need is one dollar.”\n Robinhood,  SoFi and  Stash all feature fractional trading, but Mulani said those apps are primarily used by U.S. residents. On the other hand, Gotrade is not available to U.S. residents because of financial regulations, so its main competitors are interactive brokers, Saxo Bank and  eToro.\n Gotrade does not charge commission, custody, inactivity or dividend fees. Instead, it monetizes by collecting a small fee on the currency exchange from deposits, and interest generated from uninvested cash in brokerage accounts. The app is free to use, but plans to add a premium paid subscription program and virtual debit card that users can link to their accounts.\n  Many of Gotrade’s users are people who have invested in their local stock markets, but weren’t able to trade U.S. stocks before. They vary widely in age, but 25 to 34-year-olds are the app’s biggest segment, and the average account size is about $500.\n Gotrade acts as an introducing broker to Alpaca Securities LLC, a U.S. stock brokerage that is regulated by the Financial Industry Regulatory Authority (FINRA) and serves as an intermediary. Alpaca Securities splits its stock inventory into fractions, and Gotrade users can decide how many fractions they want to buy. The app also allows them to set a budget, and automatically calculates the amount of fractional shares they can afford through notional value trading.\n User accounts are protected up to $500,000 by the Securities Investor Protection Corporation (SIPC), and money goes through counterparties regulated in Singapore, like Rapyd, and the United States, including Alpaca and First Republic Bank. To protect users, Gotrade works only with fully-funded cash accounts without any margin facility. Mulani explained that a margin account effectively means people are borrowing money to invest, while a fully-funded account means that a user can only invest the money they have already deposited in their account. FINRA and Securities Exchange Commission regulations also mean accounts under $25,000 can only day trade, or buy and sell a security on the same day, up to three times every five trading days.\n Like many investment apps aimed at first-time or relatively new traders, Gotrade includes educational content, like pop-ups with definitions for investment terms, and news articles about publicly-traded companies. Its new funding will be used for hiring and product development, with a strong focus on adding more in-app content.\n In a statement, LocalGlobe partner Remus Brett said, “Over the past 100 years, U.S. stocks have delivered average annual returns of 10%. With compounding, an investment of $1,000 back then would be worth $13 million today. These returns have fueled wealth creation in the U.S. and other developed markets but most of the world has missed out. We believe Gotrade has the potential to help the world’s 99% gain access the same benefits that the 1% have. We are incredibly excited to be joining Rohit, David and Norman on this journey.”", "posttime": "2021-06-25 10:40:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,美国,localglobe", "title": "Gotrade通过LocalGlobe获得7米，让世界各地的投资者购买美国股票的分数份额 ", "title_en": "\n\t\t\t\tGotrade gets $7M led by LocalGlobe to let investors around the world buy fractional shares of U.S. stocks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/gotrade-gets-7m-led-by-localglobe-to-let-investors-around-the-world-buy-fractional-shares-of-u-s-stocks/", "via": "", "real_tags": ["股票", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068167, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微小化石的发现表明恐龙在冰冻地区举起年轻 - 可能是温血\n    它长长的冬天黑暗，冰冷的温度，往往稀缺资源，但一系列微小的化石表明恐龙不仅漫游北极，而且孵化并在那里举起他们的年轻人。\n 虽然恐龙化石以前在北极发现，但目前尚不清楚他们是否渴望过那里或季节性游客。\n  现在专家们说，从阿拉斯加北部恢复的非常年轻恐龙的数百个化石表明该地区复制的生物，这表明它是他们的永久家庭。\n 佛罗里达州立大学的古生物GREGORY ERICKSON教授和该研究的共同作者表示，发现是一种史前孕妇病房，添加了很少有遗骸，因为它们是如此小而细腻的。\n “当我们发现微小的化石时，我们被惊呆了，”他说。 “我们怀疑他们在北极筑巢，但预计没有恢复这种行为的证据。”\n  在杂志上写作埃克森及其同事们报告了他们如何分析从跨越十年的一系列探险中从上白垩纪王子克里克群中恢复的化石，并涉及使用细网眼筛网到筛选沉积物。 \n虽然以前在地层中发现了来自恐龙的遗留情况，但没有表现出复制证据。\n 但新的研究揭示了小恐龙的小牙齿和骨骼的发现，包括那些即将孵化或最近这样做的人。\n 在700米年前约会的化石来自大型和小型恐龙，覆盖至少七种不同类型的恐龙 - 包括鸭嘴和有角恐龙。埃里克森说，牙齿也发现了牙齿，可能只有六个月大。\n “我们已经建立了一个没有只是其中一个恐龙在那里筑巢的证据，但看起来几乎所有人，如果不是所有的话，”他说。\n 虽然调查结果排除了恐龙在繁殖后北部北方北部移动的想法，但埃里克森补充说，在北极孵化的年轻人将太小而无法在冬天旅行。\n “鉴于长孵化期，小孵化尺寸和短暂的北极夏季，恐龙很不可能迁移，”他说。\n 该团队表示，结论是，恐龙可能在北极全年期间被其他证据支持，包括在较低纬度的类似年龄的岩石中发现了许多物种。 \n当时恐龙漫游北极地区，该地区缺乏大地冰帽，并有针叶树林，但研究人员表示，该生物仍然面临严酷的条件，冬季持续长达120天的持续黑暗和平均年度气温在6C以上。\n 该团队写道，“恐龙，如果冬季居民，终于忍受了冬季条件，偶尔会降雪”。\n Erickson表示，该研究提出了恐龙如何在冬季应对的问题，这些团队提出较小的恐龙可能已经冬眠，可能在洞穴中，而较大的食草恐龙可能已经禁食 - 虽然吠陀，蕨类植物和苔藓等植物可能已经提供了一些食物。\n 该团队表示，羽毛可能已经提供了绝缘，而北极恐龙的发现 - 但不是两栖动物或乌龟等冷血生物 - 为至少一些恐龙的想法增添了支持。\n 爱丁堡大学的古生学家斯蒂芬布鲁斯博士表示，该研究表明是突破性的，并补充说，虽然化石是微小的，但他们的重要性是巨大的。\n “这些化石中的一些是尖头或头皮屑剥落的大小，并且他们在渗透的严格中幸存下来的事实是显着的，”他说。\n Brusatte添加了该研究表明，在这种恶劣的环境中，恐龙如何生存。 \n“对我来说是最令人惊叹的，”他说。 “这些恐龙 - 大型恐龙，小型，肉类食物，植物饮食者 - 必须形成整个社区，适应忍受极端冬季生存的挑战。” ", "note_en": "Discovery of tiny fossils indicates dinosaurs raised young in freezing region – and may have been warm-blooded\n    It had long stretches of winter darkness, freezing temperatures and often scarce resources, but an array of tiny fossils suggests dinosaurs not only roamed the  Arctic, but hatched and raised their young there too.\n While dinosaur fossils have previously been found in the Arctic, it was unclear whether they lived there year-round or were seasonal visitors.\n  Now experts say hundreds of fossils from very young dinosaurs recovered from northern Alaska indicates the creatures reproduced in the region, suggesting it was their permanent home.\n Prof Gregory Erickson, a palaeobiologist at Florida State University and a co-author of the research, said the discovery was akin to a prehistoric maternity ward, adding it was very rare to find remains of such young dinosaurs because they are so small and delicate.\n “We were stunned when we discovered the tiny fossils,” he said. “We suspected they were nesting in the Arctic, but didn’t anticipate recovering evidence of this behaviour.”\n  Writing in the journal Current Biology, Erickson and colleagues reported how they analysed fossils recovered from the Upper Cretaceous Prince Creek Formation in a series of expeditions spanning a decade and involved the use of fine mesh screens to sift sediments.\n Though remains from dinosaurs have previously been found in the formation, none showed evidence of reproduction.\n But the new research has revealed the discovery of tiny teeth and bones from young dinosaurs, including those who were just about to hatch or had recently done so.\n The fossils, dating to around 70m years ago, came from large and small-bodied dinosaurs covering at least seven different types – including duck-billed and horned dinosaurs. Teeth were also found from a young tyrannosaur, said Erickson, possibly just six months old.\n “We have built up a body of evidence that showed not just one of the dinosaurs was nesting up there, but it looks like almost all of them, if not all of them,” he said.\n While the findings rule out the idea that dinosaurs only moved north after reproduction, Erickson added that young hatched in the Arctic would have been too small to travel south for the winter.\n “Given long incubation periods, small hatching sizes, and the short Arctic summer, it is very unlikely the dinosaurs were migrating,” he said.\n The team said the conclusion that the dinosaurs likely lived in the Arctic year-round is backed up by other evidence, including that many of the species have not been found in rocks of a similar age at lower latitudes.\n  At the time that dinosaurs roamed the Arctic, the region would have lacked big polar ice caps and had conifer forests, but the researchers say the creatures still faced harsh conditions, with up to 120 days of continuous darkness in the winter and an average annual temperature of just above 6C.\n The team wrote that “the dinosaurs, if winter residents, endured freezing winter conditions with occasional snowfall”.\n Erickson said the study raised questions of how the dinosaurs coped in the winter, with the team suggesting smaller dinosaurs may have hibernated, potentially in burrows, while larger herbivorous dinosaurs may have fasted – although plants such as bark, ferns and moss may have provided some food.\n The team said feathers may have provided insulation, while the discovery of dinosaurs in the Arctic – but not cold-blooded creatures such as amphibians or turtles – adds support to the idea that at least some dinosaurs were warm-blooded .\n Dr Stephen Brusatte, a palaeontologist at the University of Edinburgh who was not involved in the study, said the research was groundbreaking, adding that while the fossils are tiny, their importance is huge.\n “Some of these fossils are the size of pinheads or dandruff flakes, and the fact that they survived the rigours of fossilisation at all is remarkable,” he said.\n Brusatte added the research showed how adaptable dinosaurs were to survive in such a harsh environment.\n “That to me is what is most stunning,” he said. “These dinosaurs – big ones, small ones, meat-eaters, plant-eaters – must have formed entire communities that adapted to endure the challenges of extreme winter survival.”", "posttime": "2021-06-25 10:33:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表明,lived,恐龙", "title": "研究表明，恐龙在北极居住 ", "title_en": "Dinosaurs Lived In the Arctic, Research Suggests", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/24/dinosaur-fossils-eggs-arctic-research", "via": "", "real_tags": ["表明", "lived", "恐龙"]}, {"category": "", "categoryclass": "", "imagename": "782111975764a57924727793a8603363.jpg", "infoid": 1068166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿州，6月24日（路透社） - 技术评论家和联邦贸易委员会的新主席Lina Khan指定了三位顶级员工，以至于该代理机构如何变得更加积极地在其执行反垄断法和抗欺骗广告的法律方面。\n 汗，曾在6月15日宣誓，名叫霍莉·韦多瓦成为竞争局的代理主管，成为消费者保护局的代理负责人，伊利梅尔是代理商＆＃39;首席技术师一名FTC发言人周四说。\n 根据他们在LinkedIn的概况的说法，这三个目前在FTC担任民主委员会rohitChopra的顾问。 Chopra是一项被提名掌握消费者金融保护局的进步，正在等待确认。\n  观察员广泛期望FTC在Khan下变得更加激进，虽然在原子能机构无法达成协议的情况下，其律师必须在法官之前争论其案件。\n 去年与司法部合作的FTC与司法部一起执行反托拉斯法，为违反反托拉斯法律而起诉Facebook（FB.O），并向Amazon.com（Amzn.o）开放调查。 ", "note_en": "WASHINGTON, June 24 (Reuters) - Tech critic and the new chair of the Federal Trade Commission, Lina Khan, has named three top staffers in a signal that the agency could become more aggressive in how it enforces antitrust law and laws against deceptive advertising.\n Khan, who was sworn in on June 15, named Holly Vedova to be the acting head of the Bureau of Competition, Sam Levine to be the acting head of the Bureau of Consumer Protection and Erie Meyer to be the agency&#39;s chief technologist, an FTC spokesman said on Thursday.\n The three currently work at the FTC as advisors to Democratic Commissioner Rohit Chopra, according to their profiles on Linkedin. Chopra is a progressive who has been nominated to head the Consumer Financial Protection Bureau and is awaiting confirmation.\n  Observers broadly expect the FTC to become more aggressive under Khan although in the instances that the agency cannot reach an agreement on matters their lawyers must argue their cases before a judge.\n The FTC, which works with the Justice Department to enforce antitrust law, sued Facebook  (FB.O) last year for violating antitrust law and has an investigation open into Amazon.com  (AMZN.O).", "posttime": "2021-06-25 10:32:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "担任,bureau,ftc", "title": "FTC的Khan任命Erie Meyer担任首席技术人员，霍莉Vedova是竞争局主席，山姆莱文担任消费者保护局负责人 ", "title_en": "FTC's Khan appoints Erie Meyer as chief technologist, Holly Vedova as acting head of Bureau of Competition, Sam Levine as head of Bureau of Consumer Protection", "transed": 1, "url": "https://www.reuters.com/technology/new-ftc-chief-khan-names-some-top-staffers-including-competition-chief-2021-06-24/", "via": "", "real_tags": ["担任", "bureau", "ftc"]}, {"category": "", "categoryclass": "", "imagename": "d23e0cf1f08e5e7d856d17c5554d829e.jpeg", "infoid": 1068165, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编程注意：正如我注意到几周后，平台师在下周休假。 您的支持让我每年花一点时间放松，想想大想，并思考在这里，我可能能够为您做些什么，我不能感谢你。 7月6日星期二见到您的收件箱。 ", "note_en": "Programming note:  As I noted a couple weeks back,  Platformer is  on vacation next week. Your support allows me to take a little time off each year to relax, think big thoughts, and ponder what else I might be able to do for you around here, and I can’t thank you enough for it. See you back in your inbox on Tuesday, July 6.", "posttime": "2021-06-25 10:32:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,platformer,放松", "title": "平台师 ", "title_en": "Platformer", "transed": 1, "url": "https://www.platformer.news/p/microsoft-comes-for-the-creators", "via": "", "real_tags": ["平台", "放松"]}, {"category": "", "categoryclass": "", "imagename": "82a035d7b67e02d40b730207bea418a4.jpg", "infoid": 1068164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4月初的某个时候，生活对居住在Richardson Bay周围的船只居民的Jaunty社区有很大压力。那是当保罗史密斯进入“战斗模式”时。\n 53岁的史密斯的朋友说，他在3月17日返回萨斯加里托海滨时，他已经离开了大约一个星期，发现了理查森湾港口和他的团队正在删除和准备摧毁术士 - 帆船史密斯过去几个月叫回家。\n “我知道保罗，”史密斯的朋友和许多自我识别的“锚出”之一，蒂姆·洛根说，直到最近在贝尔维德，丁苏顿，萨乌顿（Sausalito）之间的这种水体上的一个合法灰色地区，和Marin County的磨坊。据洛根和认识他的其他人说，史密斯是一位退伍军人。\n “他有一种善良的精神，只是试图保持自己，”洛根说。 “但是是的，他绝对有接触者。”\n 史密斯不是第一个失去漂浮的房屋，失去漂浮的房地产权（RBRA），政策制定者和执法人员在金门桥东边的政策制定者和执法部门。然而，他是第一个据称呼吁枪支响应这种驱逐的枪支。\n  洛根告诉它的方式，史密斯在空中发射了他的火炬枪，有同样的原因，任何水手都会。这是一个难忘的呼唤，意味着发出史密斯 - 谁不拥有手机 - 需要的帮助。然而，据官方警察报告称，史密斯瞄准了Harbormaster Curtis Havel的耀斑，他们正在拖着术士到索萨利托的工程师码头的附近军团的过程中，在那里将被粉碎。史密斯跟着他的小船上的港口，到达军队要求术士回来无济于​​事。\n 整个星期的紧张局势升级，因为众议员不断试图与史密斯接触，他藏在他的朋友Michael Ortega的船上，弹丸。 \n据澳门县警长的报告称，史密斯击败了射弹的舱口，在其腔室上安装了爆炸性煮沸的陷阱，并用他的斗牛犬小狗堆积在锚定的船的小屋中挖掘起来。 4月2日，警长的代表试图告知史密斯，他们有一个逮捕令，但他拒绝投降并提醒他穿着防弹背心的军官。\n 警长的特殊反应团队包围史密斯，在船上圈出了一些锚地被描述为“浮动坦克的军队”。警方报告国代表部署了在去年夏天乔治弗洛伊德抗议活动中遇到的许多相同武器示威者。他们烧掉了催泪气体，闪光手榴弹和胡椒喷洒到船上，并在史密斯射出五轮豆子 - 用三个击球。\n 目击者说，史密斯撤退了甲板下方，执法人员登上了船，使用锯条进入机舱。\n  警方报告说明史密斯通过试图用一个贴有两个金属尖刺的工具来刺伤他的立场。最终，射弹被拖到了剪刀游艇港，史密斯用令人惊叹的枪撒上了一个令人震惊的枪，并从船上拆除，从船上迅速着火并沉没。\n   该事件激怒和创伤了许多Richardson Bay Anchor-Outs  - 谁坚持他们在一个地区在国家的一些最高住房成本中尽最大努力刮掉，其中一些错过的薪水可能是持有的区别一个廉价的公寓和生活粗糙。\n Peter Romanowsky，一位72岁的锚地上目睹了史密斯捕获，记得燃烧船弹射弹，喷洒他在燃烧船上被描述为“Dinky Garden软管”的东西。执法弗洛特拉的并置和灭火后期爆炸的软弱试图使罗马斯基怀疑当局的优先事项。\n 自史密斯戏剧性捕获以来已经过了一个月，他仍然在监狱里，无法支付305,000美元的保释或保证债券。他指责四次指控 - 虐待动物，阻碍军官，以致命的武器攻击官员，并用枪支攻击。由于已从公开访问的官方报告中删除了一些上述细节，并且在过去几周内已增加5个针对史密斯的收费。 \n回到2019年，本地NPR会员克Q深深地深入了解了Richardson Bay的历史，揭示了该地区的牲畜文化追溯到1880年，当时旧金山贵族首次在贝尔维德和泰国岸边种植船屋。最初用作周末撤退，许多蓝色血腥旧福建人在1906年的地震和火灾之后发现自己在这些浮动遗产上全日制。\n 在20世纪上半叶的过程中，丰富的重建和重新押出的旧金山，以及萨乌托多海滨附近的前火车院子被转换为船舶建设工厂。船舶船舶，正如前工厂现在所知，搅拌了近100个船只，以便在美国海军中服务，并在第二次世界大战期间援助盟友。在盟军声称胜利之后，一个名叫唐阿库斯的前余地乘坐大部分余地占有土地，并开始向返回士兵和不需要住房的艺术家提供剩余的废料。\n  在几十年来之下，Richardson Bay将进入一个麦加的创意表达，拉扯饥饿的作家，艺术家，摇滚乐和嬉皮士的垃圾。艾伦吉斯伯格，艾伦吉斯伯格和感恩的成员沿着这个海岸线生活 - 穿过金门桥的旧金山的激进想法，并为花电和荒漠化的泥浆奠定了基础，最终绘制了赫尔当地执法。\n Richardson Bay在马林的四个城市旁边休息，并包含一个整个生态系统。立法和警务该地区仅为这个原因很复杂。作为港口的事实，水域也落在联邦管辖范围内，事物变得更加复杂。多层联邦，州，县和城市权力往往导致谁可以居住在理查森湾 - 以及多长时间。这种历史上的困惑是执法部门的头疼，这是一个植物在过去的100年里居住在安克雷奇的人。\n  这并不是说警方一直害怕过去弯曲他们的肌肉。 1971年，当玛林县警长的代表在一个不会放弃船的居民上吸引枪时，就在Richardson Bay上的事情特别紧张。这标志着所谓的“船屋战争”的开始，这脉冲了10年，直到各个有关方缔约方达成了一个解决方案，允许建立五个永久玛林斯来永久和安全地浮动。\n 虽然很多人很乐意遵守这些新的规则，但该协议还创造了一类和爱心的歹徒 - 锚 - 散货 - 船锚 - 谁无法或不愿意满足码头对船只维护的严格要求，并支付搭乘船用滑动，在哪里他们可以法律地将船只绑在码头上。\n  许多人带到了露天水，而不是默许的，在那里有一个杂志的法律和拉链执法在海上隔绝了他们的生活方式。 \n自70年代以来，南马林县的人口统计数据以及Richardson Bay周围的社区已经转变。曾经是一个古老的背向登陆者的避风港，寻求忙碌的城市生活中的受障人员已经成为一个白色领子工人的飞地，寻求一个安静的社区，方便客人前往旧金山的设施和高薪。曾经曾担任过周末居住的船屋和富裕的城市居民的紧急避难所，现在指挥百万美元的价格标签，并再次超出工作舱的范围。\n 根据Zillow家庭价值指数，在过去的10年里，Marin县的房屋价值从平均增加了一倍，平均增加了70万至近140万美元。 2017年，全国低收入住房联盟确定，居住在马林的租户需要赚61美元，以实惠租用每月约3000美元的两居室房屋。假设租金只有在多年来才能攀爬 - 特别是在Covid-19大流行之后，这为逃离旧金山的技术工人来说，逃离旧金山的附近的社区，在那里他们可以伸展双腿并在远程办理时呼吸新鲜空气。\n “我曾经能够在萨乌托托这里租用，”贝壳斯奈德说。 “我们有房子，公寓遍布。太好了。现在你不能。这是一个3,000美元到4,000美元，就像一室一室小屋一样。那么他们期待什么？我应该只是离开沙漠，因为我不能在这里闲逛？“斯奈德也选择了斯诺德的斯诺德，而不是解体，以保持自己的规则。几十年来，她居住在理查森湾锚地。\n “人们认为这是物质使用的障碍或心理健康，当时的人们陷入无家可归者是失业的，”北湾市中心街道队的高级总监Karen Strolia表示，基于硅谷的无家可归者外展组织。根据Strolia的说法，她的外展团队预计无与伦比的个人在大流行之后增加的人数 - 这正是他们所看到的，尽管许多锚地将在“无家可归者”一词中刺耳。\n  “我不是不是无家可归的 - 我住在我的船上，”亚瑟布鲁斯（亚瑟尔布鲁斯）曾倾向于跨越Marin县的豪华庄园。 “在Covid命中后，我在土地上失去了公寓。我买不起日托和汽车维修和租金，所以我全职在我的船上。“\n  湾区的几乎每个港口都有搭配母线板的容量 - 而且有些人曾多年待命球员 - 生活在理查森湾的便宜船上是低收入人民留在马林的唯一选择之一。但经过几十年的无规水生活，镇上的新罕由之限在镇上，锚地出局正在争取彻底改变的速度。\n 柯蒂斯·哈维尔 - 南加州出生的冲浪者和水手 - 在2019年7月宣誓就宣誓就哈比斯特的位置。他有一个良好意义的灵魂，那种吃奎奴亚藜和无肉香肠的人，因为他告诉我他做了在我们第一次采访前的一天晚上。 \n“我想消除这种概念，即[rbra]是一些巨大的代理商。不是。 It’s pretty much as mom-and-pop as you can get,” he says, clarifying that the RBRA comprises himself, the harbormaster, his assistant, and four elected officials. “我被雇用了临时六个月的基础，这就是如何开始的。”\n 在Richardson Bay携带秩序的当局将表示，安全是在目前对史密斯锚出的锚定的核心。一艘未经理性的船 - 未连接到码头上的码头，这本身就是靠岸地板 - 以及对其居民和其他船只的危险。即使这样的船很好锚定，强烈的风暴也可以将其撞击海岸线或使其引起倾覆。维修不良的船可能会将油，燃料或废物泄漏到水中。\n 由于这个原因，根据Richardson的湾区机构1987年的法律，船只仅允许丢弃72小时的锚72小时。之后，他们应该在返回船只再次返回之前至少一周离开。\n 问题是，该法律在本世纪中的四分之一的法律上并没有真正强制执行前港口票价巡逻理查森湾。\n 在2019年7月退休后，瑞国人聘请了Havel终于实施了安克雷奇的72小时的时间限制，并确保港口的每艘船都是海运 - 海员之间的争议术语，特别是那些生活，工作或在Richardson Bay上的生活或重建。\n  完整的船体，码码布线，安全储存的燃料容器以及正确处理废水的能力都列在RBRA的确定船舶的可耕种的准则中。不符合这些要求的船 - 以及其他 - 可以从锚地内提取并根据规则销毁。\n 一般而言，这些指导方针旨在确定船舶是否是“生命，肢体或财产的风险”和/或造成环境危害。虽然这些规则方面是保护人类，野生动物和更广泛的生态系统的，但Richardson Bay的锚地说，RICRA是不公平地瞄准船上的人，同时忽视其他被遗弃的，遗弃和漂流船只。这次指责召回了其他所谓的“贫困税”的批评 - 可能对带有手段的人带来不便的法规，但威胁到穷人的生计。 \n“我不会从这个角度来看这一点，”哦，你的游艇不是缩减。“我看着一些这些船只，我真的担心我打算叫一个，'嘿，嘿，这艘船下来了，我们找不到所以的“，”哈维尔说，在沉思的是rbra的可耕地标准时说。\n 当船只被视为不可思议时，Harbormaster将物理标记并将通知邮寄给船只的注册地址。 10天后，如果标记的船只尚未被移动，并且其所有者没有说出，则RBRA通常将乘船拖入美国陆军队的工程师队的Sausalito港口，在那里他们处理有害物质，再循环金属在船上，用挖掘机粉碎它的壳。无人认领的个人物品被抛出。\n “我现在感到胸痛，只是在考虑他们被摧毁的所有事情，”爱丽丝·涅文（Alice Nevin）说，衣服戴着三角帽子，涂上水的景观。 “他们摧毁了这艘船的古董港口窗户，对我来说是极端的亵渎，因为所有的木头和绳索和索具都可以被回收。”\n 哈维尔说，他在近两年内从锚地上删除了大约100艘船，因为留言运动员仍然存在93艘船。他担心这些持久船只对他们的居住者和周围的生物的威胁担心，并注意到现在是如何的，他们的船只是死亡陷阱。“\n “当你在海洋环境和母亲自然时开始将它脱落，她不在乎你的发动机是否不起作用，”他说。哈维尔希望有一天过渡到陆地上的锚地，鉴于每个冬季船只漂流，无论是撞到贝尔维地雷的家园还是撞到萨乌拉托的玛林纳斯。\n Harbormaster关闭我们的第一次采访警告我拿走了锚出来的所有故事，用一粒盐告诉他。\n “锚地上有一所虚假的叙事，我偷了船，我是一个海盗，我是一个小偷，我是一个强奸者，我是凶手。” \n在4月8日召唤他之前，我唯一知道Romanowsky的是他是理查森湾锚地，他可能愿意和我谈谈。我准备自己听到关于哈维尔的各种邪恶的事情，因为我在这个号码里打了一拳。\n  “他们在等我死了，”罗曼斯基曾在1964年逃离家里的船只逃离家里的船上，“罗马森斯基说。”我死的那一刻在几天内，他们会在几天内尝试抓住我的船。他们刚刚这样做，我们的一位老年人刚刚去世，并在48小时内，她的船屋被认为被摧毁。“\n 在阻止他的中间句子之前，我紧张地听到他的悲惨联系，要求他的坐标，并跑去亲自见到他。这显然不是一个故事我能够完全掌握而不用自己的眼睛看到它。\n 我的路线让我在塞萨利托江边的污垢清理，叫做Sanctuary City，这是一个安全的避风港，用于前锚 - 在海上失去家园 - 天气或rbra干预。联邦法官阻止了Sausalito迫使营地居民在大流行期间搬迁，这刺激了许多其他人，仍有船只或两艘船只，在陆地上花一些夜晚。\n 大麻的麝香通过篝火染色的蓝天徘徊。五颜六色的帽子的老家伙欢迎我，戴着温暖的握手和益生菌冰沙，可能捐赠了。有些婴儿跑来跑去，狗，尖叫者 - 因为有些人会称之为偶尔尖叫的人 - 以及我见过的最聪明的笑容的几个八大体。我们在一个大容易的圈子里坐在一个圆圈;这就像燃烧的人，只有大海。\n 我举行的麦克风就像是海鸥的大会的面包：圣所城市的居民饿了很饿，一个声音在下一个声音喊道。\n “我必须帮助一个怀孕九个月的朋友去商店，但在她说的过程中，”我想我正在进入劳动力。“她仍然想把杂货带到她的船上......她没有想离开她的船，“Paul Smith的朋友蒂姆洛根说。 \n另一个名叫Robert Powelson的另一个船居民，也是一个无与伦比的倡导者，通过电子邮件向我发出新闻稿。部分阅读，部分“社区是由于失去了一个心爱的长期住宿水母的悲伤。”船只进口商布鲁斯亚当斯（他的兄弟Mark的船）被罗布拉采取，并将他的船只绑在一起，以“捍卫他们被抓住并被Harbormaster Havel摧毁”。 Powelson说布鲁斯在两个侧面捆绑的船之间落下并于4月15日淹死。\n  就其部分而言，RBRA承认它正在将船只从水中拉出速度。该机构的2020年过渡计划积极扩大了港口运输的责任，以执行72小时的锚地时间限制，消除来自Richardson Bay的所有不可难以置信的船只。此外，Havel说他致力于确保只有未占用的船只被摧毁。\n “我没有把他们从家里扯下来，让他们从他们的主要船上物理地流离失所，把它们甩在街上，让他们看着他们在那里粉碎它，”他说，添加“这不是我们的驱动器无家可归。”\n 哈维尔认为一个船只被占用，如果它是“某人的睡眠的主要场所”，并说他通过自己的观察决定了这一点。他在黎明和黄昏时围绕着港口，如果他一直通告在那些小时内无人看管船，他将标记它即将删除的警告。另一方面，锚地说他们渴望失去家园的永恒恐惧。\n “有时候我甚至不想来散步我的狗岸边，因为如果他看到一个人没有那里的船，他会拿走它。它让我如此多的胁迫下，“Alice Nevin说。\n 生活在Richardson Bay的许多锚地说他们是他们船的合法主人。因此，他们争辩，RBRA的行为归咎于盗窃。其他人像哈维尔一样，可能会抵消那么大量的锚地，经常从船上跳到船上，收集废弃的血管并搅拌水。\n 由爱因斯坦去的一位老人水手并没有完全否认这笔费用。 “我改变了船，就像我改变内衣一样，”他笑了。 \n虽然Eisenstein笑着他在Richardson Bay留下的策略，一个在萨乌拉尼托租用的一名年轻女性，并且不想被识别，但她并没有被锚地社区逗乐。  “我一直被生活在营地处的无家可归者的一个无家可归者的口头上性骚扰，”她说，在她理解锚出社区的需要是真实的时，她认为他们正在给予太多的尊重， 虽然工作舱的其他人尽力通过规则发挥作用。  “我支持劳动人民的经济适用房，”这位妇女说。 “劳动的人甚至不能住在Sausalito中，因为它是如此昂贵。 第一步是为劳动的人提供价格合理的住房。“  SeaTrek Kayak＆amp;  ...... ", "note_en": "Sometime in early April, life got a lot more stressful for the jaunty community of boat dwellers living on and around Richardson Bay. That’s when Paul Smith went into “combat mode.”\n Friends of the 53-year-old Smith say he’d been away for about a week when he returned to the Sausalito Waterfront on March 17 to discover the Richardson Bay Harbormaster and his team were removing and preparing to destroy Warlock — the sailboat Smith had called home for the past several months.\n “I know Paul,” says Tim Logan, a friend of Smith’s and one of many self-identified “anchor-outs” who until recently were floating through life in a legal gray area on this body of water between Belvedere, Tiburon, Sausalito, and Mill Valley in Marin County. According to Logan and others who know him, Smith is a veteran.\n “He has a kind spirit and just tries to keep to himself,”  Logan says. “But yeah, he most definitely has PTSD.”\n Smith was not the first anchor-out to lose his floating home to the Richardson’s Bay Regional Agency (RBRA), the body of policymakers and law enforcement governing this seaside north east of the Golden Gate Bridge. However he was the first to allegedly discharge a firearm in response to such an eviction.\n  The way Logan tells it, Smith fired his flare gun in the air for the same reason any sailor would. It was a distress call, meant to signal that Smith — who does not own a cell phone — needed help. According to the official police report, however, Smith aimed the flare at Harbormaster Curtis Havel, who was in the process of towing Warlock to the nearby Army Corps of Engineers’ dock in Sausalito, where it was to be crushed. Smith followed the harbormaster on his small skiff, arriving at the Army Corps to demand Warlock back to no avail.\n Tensions escalated throughout the week, as deputies continuously tried to make contact with Smith, who had gone into hiding on his friend Michael Ortega’s boat, Projectile.\n According to a Marin County Sheriff’s report, Smith battened down the hatches of Projectile, installed explosive booby traps on its chamber doors, and holed up in the cabin of the anchored-out boat with his pit bull puppy, Runt Girl. On April 2, sheriff’s deputies tried to inform Smith they had a warrant for his arrest, but he refused to surrender and alerted the officers he was wearing a bulletproof vest.\n The Sheriff’s Special Response Team surrounded Smith, circling round the boat in what some anchor-outs described as an army of “floating tanks.” The police report states deputies deployed many of the same weapons demonstrators encountered at last summer’s George Floyd protests. They fired tear gas, flash grenades, and pepper spray onto the boat, and shot five bean bag rounds at Smith — hitting him with three of them.\n Witnesses say Smith retreated below deck, and law enforcement officers boarded the boat, using chainsaws to gain access to the cabin.\n  The police report states Smith defended his position by attempting to stab deputies with a tool that had two metal spikes affixed to a pole. Ultimately, Projectile was towed to Clipper Yacht Harbor, where Smith was subdued with a stun gun and removed from the boat, which quickly caught on fire and sank.\n   The incident infuriated and traumatized many of the Richardson Bay anchor-outs — who insist they are doing their best to scrape by in a region with some of the highest housing costs in the nation, where a few missed paychecks can be the difference between holding onto a cheap apartment and living rough.\n Peter Romanowsky, a 72-year-old anchor-out who witnessed Smith’s capture, remembers a fireboat circling Projectile, spraying what he described as a “dinky garden hose” at the burning vessel. The juxtaposition of the law enforcement flotilla and the feeble attempt at extinguishing the subsequent blaze makes Romanowsky suspicious of the authorities’ priorities.\n It’s been over a month since Smith’s dramatic capture and he remains in jail, unable to pay $305,000 in bail or secure a bond. He stands accused of four charges — cruelty to an animal, obstructing officers, assault with a deadly weapon on officers, and assault with a firearm. Some of the aforementioned details have since been removed from publicly accessible official reports and five more charges against Smith have been added to the sheriff’s report in the past few weeks.\n  Back in 2019, local NPR affiliate KQED took a  deep dive into the history of Richardson Bay, revealing that the region’s liveaboard culture dates back to 1880, when San Francisco aristocrats first planted houseboats on the shores of Belvedere and Tiburon. Initially used as weekend retreats, many blue blooded San Franciscans found themselves living full-time on these floating estates in the aftermath of the earthquake and fire of 1906.\n Over the course of the first half of the 20th century, the rich rebuilt and repopulated San Francisco, and a former train yard near the Sausalito waterfront was converted into a ship-building factory. Marinship, as the former factory is now known, churned out nearly 100 vessels to serve in the U.S. Navy and aid the allies during World War II. After the Allies claimed victory, a former Marinship worker named Don Arques took possession of most of the Marinship land and began offering leftover scrap materials to returning soldiers and untethered artists in need of housing.\n  In the decades to follow, Richardson Bay would evolve into a mecca of creative expression, pulling in a litter of starving writers, artists, rockstars, and hippies. Shel Silverstein, Allen Ginsberg, and members of the Grateful Dead lived along this shoreline — shuttling their radical ideas to and from San Francisco across the Golden Gate Bridge, and laying the foundation for a mushpot of flower power and debauchery, which eventually drew the ire of local law enforcement.\n Richardson Bay rests next to four cities in Marin and contains an entire ecosystem in itself. Legislating and policing the area is complicated for this reason alone. Throw in the fact that as a harbor, the waters also fall under federal jurisdiction and things get even more convoluted. The multiple layers of federal, state, county, and city authority have often led to confusion as to who may live on Richardson Bay — and for how long. That confusion, which has historically been a headache for law enforcement, has been a boon for those living in anchorage here for the past 100 years.\n  That’s not to say police have been afraid of flexing their muscles in the past. In 1971, matters on Richardson Bay got particularly tense when Marin County Sheriff’s deputies drew a gun on a resident who wouldn’t give up his boat. This marked the start of the so-called “Houseboat Wars,” which pulsed for 10 years until the various concerned parties reached a settlement allowing for the establishment of five permanent marinas for floating homes to permanently and safely dock.\n While plenty were happy to abide by these new rules, the agreement also created a class of peace-loving outlaws — the anchor-outs — who were unable or unwilling to meet the marina’s strict requirements for boat maintenance and pay for a liveaboard slip, where they could legally tie their boat to a dock.\n  Rather than acquiesce, many took to the open water, where a murkier set of laws and lax enforcement insulated their lifestyle at sea.\n  Since the ’70s, the demographics of southern Marin County, and the communities surrounding Richardson Bay, have shifted. What was once a haven for granola-munching back-to-the-landers seeking a reprieve from hectic city life has become an enclave of white collar workers seeking a quiet community with easy access to the amenities and high salaries of San Francisco. And the houseboats that once served as weekend getaways and emergency shelters for wealthy city dwellers now command million-dollar price tags and are once again beyond the reach of the working class.\n Over the past 10 years, the value of homes in Marin County has doubled, from an average of $700,000 to almost $1.4 million, according to the Zillow Home Value Index. In 2017, the National Low Income Housing Coalition determined that tenants living in Marin would need to make $61 an hour to affordably rent a two-bedroom home at around $3,000 per month. It’s safe to assume rents have only climbed in the years since — especially in the wake of the COVID-19 pandemic, which saw tech workers fleeing San Francisco for nearby communities where they could stretch their legs and breathe fresh air while telecommuting.\n “I used to be able to rent here, in Sausalito,” says Shell Snyder. “We had houses, apartments all over. It was great. And now you can’t. It’s $3,000 to $4,000 just for, like, a one-room shack. And so what do they expect? I’m supposed to just leave to the desert because I can’t afford to live up here?” Rather than decamp to Joshua Tree, Snyder chose to stay put and make her own rules. She has lived as a Richardson Bay anchor-out for decades.\n “People assume it’s substance-use disorder or mental health, when the No. 1 cause of people falling into homelessness is job loss,” says Karen Strolia, senior director of the North Bay’s Downtown Streets Team, a Silicon Valley-based homelessness outreach organization. According to Strolia, her outreach team expected the number of unhoused individuals to increase in the wake of the pandemic — and that’s exactly what they saw, though many anchor-outs would bristle at the term “homeless.”\n  “I wasn’t and still am not homeless — I live on my boat,” says Arthur Bruce, a landscaper who tends to lavish estates across Marin County. “I lost my apartment on land just after COVID hit. I couldn’t afford daycare and car maintenance and rent, so I went full time on my boat.”\n  With nearly every harbor in the Bay Area at capacity for liveaboard slips — and some with years-long waitlists — living on a cheap boat in Richardson Bay has been one of the only options for low-income folks to remain in Marin. But after decades of unregulated on-the-water living, a new harbormaster is in town and the anchor-outs are fighting a riptide of sweeping changes.\n Curtis Havel — a Southern California-born surfer and sailor — was sworn into the position of harbormaster in July 2019. He has a well-meaning aura, the type of guy who eats quinoa and meatless sausage for dinner, as he tells me he did the night before our first interview.\n “I want to dispel this notion that the [RBRA] is some huge agency. It’s not. It’s pretty much as mom-and-pop as you can get,” he says, clarifying that the RBRA comprises himself, the harbormaster, his assistant, and four elected officials. “I was hired on for a temporary six-month basis and that’s how it all started.”\n The authorities charged with keeping order in Richardson Bay will say that safety is at the heart of their current campaign against anchor-outs like Smith. An unmoored boat — unattached to a dock that is itself secured to the bay floor — is a danger to its inhabitants and other vessels, as well. Even if such a boat is well anchored, a strong storm could dash it against the shoreline or cause it to capsize. Boats in poor repair may leak oil, fuel, or waste products into the water.\n For this reason, vessels are only allowed to drop anchor for 72 hours, according to a law codified in 1987 by the Richardson’s Bay Regional Agency. After that, they are supposed to leave for at least a week before returning to drop anchor again.\n Problem is, that law wasn’t really enforced in the quarter of a century that former Harbormaster Bill Price patrolled Richardson Bay.\n After Price retired in July 2019, the RBRA hired Havel to finally implement the anchorage’s 72-hour time limit and to ensure that every vessel in the harbor is  seaworthy — a contentious term among seamen, especially those living, working, or recreating on Richardson Bay.\n  An intact hull, up-to-code wiring, safely stored fuel containers, and the ability to properly dispose of wastewater are all listed in the RBRA’s  guidelines for determining a vessle’s seaworthiness. Boats that do not meet these requirements — and others — may be extracted from the anchorage and destroyed according to the rules.\n Generally speaking, these guidelines are meant to determine whether a vessel is “a risk to life, limb, or property” and/or poses “an environmental hazard.” While these rules are ostensibly in place to protect humans, wildlife, and the broader ecosystem, the anchor-outs of Richardson Bay say the RBRA is unfairly targeting those living on their boats while ignoring other abandoned, derelict, and drifting vessels. This accusation recalls critiques of other so-called “poverty taxes” — regulations that may pose something of an inconvenience to individuals with means but threaten the very livelihoods of the poor.\n  “I’m not coming at this from the perspective of, ‘Oh, your yacht is not up to scale.’ I look at some of these boats and I genuinely worry that I’m going to get a call that, ‘Hey, this boat went down and we can’t find so-and-so’,” Havel says in contemplation of the RBRA’s seaworthiness criteria.\n When a vessel is deemed unseaworthy, the harbormaster will physically tag it and mail a notice to the vessel’s registration address. After 10 days, if the tagged vessel hasn’t been moved and its owner hasn’t spoken up, the RBRA will typically tow the boat into the U.S. Army Corps of Engineers’ Sausalito harbor, where they dispose of hazardous materials, recycle the metals on the boat, and crush its shell using an excavator. Unclaimed personal items are thrown out.\n “I’m feeling chest pains right now just thinking about all of the things that they’ve destroyed,” says Alice Nevin, an anchor-out who wears a tricorn hat and paints landscapes of Richardson Bay from the water. “They busted out the antique port windows of this one boat, which to me was extreme sacrilege because all of the pieces of wood and ropes and rigging could have been recycled.”\n Havel says he has removed roughly 100 vessels from the anchorage in his nearly two years as harbormaster, while 93 boats remain. He worries about the threat these lasting vessels pose to their occupants and the living things around them, noting how “right now, their vessels are death traps.”\n “When you’re in the marine environment and mother nature starts dishing it out, she doesn’t care if your engine doesn’t work,” he says. Havel hopes to one day transition the anchor-outs onto land, given that every winter vessels go adrift and either crash into homes in Belvedere or crash into marinas in Sausalito.\n The harbormaster closed our first interview warning me to take all stories the anchor-outs tell about him with a grain of salt.\n “There’s a host of false narratives on the anchorage that I steal boats, that I’m a pirate, that I’m a thief, that I’m a rapist, that I’m a murderer.”\n   The only thing I knew about Romanowsky before calling him on April 8 was that he was a Richardson Bay anchor-out and that he might be willing to talk to me. I prepared myself to hear all sorts of vile things about Havel as I punched in the number.\n  “They’re waiting for me to die,” said Romanowsky, who has been living on a boat in Richardson Bay since running away from home as a teenager in 1964. “And the minute I die, within days, they’re gonna try to grab my boat. They just did that, one of our senior citizens just died, and within 48 hours, her houseboat was taken to be destroyed.”\n I strained to hear him over the choppy connection for 45 minutes before stopping him mid-sentence, asking for his coordinates, and racing out to meet him in person. This was clearly not a story I’d be able to fully grasp without seeing it with my own eyes.\n My directions brought me to a dirt clearing on the Sausalito waterfront called Sanctuary City, a safe haven for former anchor-outs who lost their homes at sea — either to rough weather or RBRA intervention. A federal judge has blocked Sausalito from forcing relocation of the camp residents during the pandemic, which has spurred many others, who still have a boat or two, to pitch tents and spend some nights on land.\n The musk of marijuana wafted through a bonfire-stained blue sky. Old guys in colorful hats welcomed me to Sanctuary City with warm handshakes and probiotic smoothies, probably donated. There were babies running around, dogs, screamers — as some would call the folks who’d scream sporadically — and a few octogenarians with the brightest smiles I had ever seen. We sat in a circle under a big easy-up; it was like Burning Man, only by the sea.\n The microphone I held was like bread for an assembly of seagulls: The residents of Sanctuary City were hungry to be heard, and one voice shouted over the next.\n “I had to help a friend who was nine months pregnant get to the store, but in the process she said, ‘I think I’m going into labor.’ She still wanted to take the groceries to her boat… she didn’t wanna leave her boat,” said Tim Logan, friend of Paul Smith.\n Another boat-dweller named Robert Powelson, who is also an advocate for the unhoused, emailed me a press release. It read, in part, “The community is grief stricken by the loss of a beloved and long-time live-aboard mariner.” Vessel importer Bruce Adams, whose brother Mark’s boat was taken by the RBRA, took to side-tying his boats to “defend against them being taken and destroyed by Harbormaster Havel.” Powelson says Bruce fell between two of the side-tied boats and drowned on April 15.\n  For its part, the RBRA acknowledges that it is pulling boats out of the water at a rapid clip. The agency’s  2020 Transition Plan aggressively amplified the responsibilities of the harbormaster to enforce the 72-hour anchorage time limit and eliminate all unseaworthy vessels from Richardson Bay. Still, Havel says he is committed to ensuring that only unoccupied vessels are destroyed.\n “I have not ripped somebody from their home and made them homeless, physically displaced them from their primary vessel, dumped them on the street and made them watch as I crushed it there,” he says, adding “It’s not our drive to make someone homeless.”\n Havel considers a vessel to be occupied if it’s “someone’s primary place to sleep,” and says he determines this through his own observation. He travels around the harbor at dawn and dusk, and if he consistently notices a boat is unattended in those hours, he will tag it with a warning of its imminent removal. The anchor-outs, on the other hand, say they live in perpetual fear of losing their homes.\n “There was times I didn’t even want to come and walk my dog on shore because if he sees a boat with a person not there, he’ll take it. It’s put me under so much duress,” anchor-out Alice Nevin says.\n Many of the anchor-outs living in Richardson Bay say they are the rightful owners of their boats. As such, they argue, RBRA’s actions amount to theft. Others, like Havel, might counter that plenty of the anchor-outs regularly bounce from boat to boat, collecting abandoned vessels and cluttering the water.\n One elderly sailor who goes by Einstein doesn’t exactly deny this charge. “I change boats like I change my underwear,” he laughs.\n While Eisenstein jokes about his strategies for remaining in Richardson Bay, one young woman who is legally renting a slip in Sausalito and did not want to be identified, says she isn’t amused by the anchor-out community.\n “I have been verbally sexually harassed consistently by one of the homeless individuals living at the encampment,” she said, adding that while she understands the needs of the anchor-out community are real, she feels that they are being given too much deference, while others in the working class do their best to play by the rules.\n “I support affordable housing for working people,” the woman said. “Working people can’t even afford to live in Sausalito because it’s so expensive. The first step is to provide affordable housing to working people.”\n  Seatrek Kayak &amp; \n......", "posttime": "2021-06-25 10:31:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bay,wars,史密斯", "title": "Richardson Bay的船屋战争 ", "title_en": "The Houseboat Wars of Richardson Bay", "transed": 1, "url": "https://www.sfweekly.com/news/pirates-bay-richardson-sausalito/", "via": "", "real_tags": ["bay", "wars", "史密斯"]}, {"category": "", "categoryclass": "", "imagename": "cac752605fa29633404bb6e65aaa9ad0.jpg", "infoid": 1068163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个工作日晚上，我们的编辑指导您通过当天最大的故事，帮助您发现新的想法，并让您惊喜。订阅将此交付给您的收件箱。\n  世界以奇怪的方式工作，并且在我们忽略的日常物体中通常可以找到有趣的设计选择。这里有两个夏天思考。\n 番茄酱瓶。如果你已经足够老了记住玻璃Heinz番茄酱瓶，你也可能会记住他们使用的令人沮丧。你会击中底部，最终，一个巨大的blob会挥动，毁了你的盘子。\n Heinz的目前的瓶子是可挤压的，它将分配器恢复到底部，但其阀门如此紧张，每次挤压仍然会出现一堆番茄酱。\n 我将Heinz挤压瓶与圆柱形的细小尖端的排序进行了比较，可装饰许多餐馆和野餐桌。我可以让这款通用瓶输出每次挤压的调味品30倍，而不是宽阔的娃娃。今天的瓶子可能有利于炸薯条，但它释放了太多的番茄酱，穿着汉堡或热狗。\n 较早，更便宜的包装技术似乎优越。那么为什么Heinz会部署更糟糕的或至少减少灵活的设计？\n 罗切斯特理工学院包装科学主席Daniel Johnson，向我保证了Kraft Heinz等大公司在他们的包装后面放了大量的R＆amp; D.番茄酱瓶将受到对焦组的使用偏好，举起瓶颈习惯等。一位海因斯发言人告诉我，“我们发现我们的消费者更喜欢玩得沸的汉堡或浸泡。” \n这将解释为什么瓶子的工作方式，但它不能阻止我哀叹这么票据使用我们国家最喜欢的调味品。投资廉价，野餐型瓶子，并从品牌名称瓶中分配进入其中，以更加多功能挤压。\n 无籽西瓜。国家西瓜促销委员会高级总监Stephanie Barlow告诉我，今天在美国消费的90％以上的西瓜是无籽。这种变化发生了缓慢，然后快速发生：第一个无籽杂交瓜出现在20世纪中期，但工业农民并没有弄清楚如何在2000年代中期以规模有效地授予它们。\n 这改变了西瓜如何被吃掉。种子甜瓜最好用作楔形，用手，卫生巾或 - 传统方法咳痰除去种子。但是Sans Seeds，西瓜来享受更多样化的用途：在水果沙拉，叶茂盛沙拉，甚至在比萨饼上。\n 后者的食谱是西瓜委员会在促销活动中建议宣传迪士尼皮克尔新的动画电影卢卡的宣传活动，该电影卢卡在亨里亚的北部意大利设有。西瓜在电影中似乎很短暂，当阳台上的两个女孩可以在宽阔的楔子中搭配地完成。由皮克斯（Pixar）创造的促销形象，而不是西瓜板，甚至展示了薄膜的海怪物，享受黑色种子果实的笑容。\n 巴洛告诉我，西瓜板在其通信中只使用无籽 - 西瓜图像强调。 “但是，种子西瓜切片的视觉占上风，”她承认。\n 这可能是因为水果与夏季怀旧的象征关系。卢卡的意大利里维埃拉回忆与我自己的夏令营有一块。当涉及西瓜时，我们吃水果，但我们也消耗了图像。\n 做任何普通的东西让你想知道，为什么这样？将它们发送至hello@theatlantic.com。 \n（1）一个人死了，在迈阿密附近迈阿密附近倒塌后，几十个未占据。 （2）昨天在Court在法庭上的流行明星残酷的辩护之后，呼吁“免费布兰妮”继续。 （3）“基础设施周”终于结束：乔·拜登总统宣布了两党妥协。\n 一个问题，回答：如果我旅行，我的戴头皮不会戴面具，我该怎么办？我们的副管理编辑Rachel Gutman有一些建议：\n 如果您完全接种疫苗，而不是免疫抑制或免疫抑制，您不应该与塞蜂制出来的任何显着危险。在任何长途旅行中，您的乘客都需要吃喝，并且在购买机票之前应该为此做好准备。\n  如果您特别担心面罩合规性，您可能希望乘火车或飞机选择旅行，导体和空乘人员更有可能在行驶中巡逻。但这并不会消除在董事会前的车站或机场的自由的可能性。\n 在Rachel的新文章中找到更多疫苗夏季旅行的安全规则。如果你想要一个有趣的假期，不仅仅是一个安全的问题，我们的幸福专栏作家亚瑟C. Brooks，你已经覆盖。\n   倾听实验播客的最新发作，其中性治疗师和大屠杀幸存者博士露丝与我们的员工作家Emma绿色的咨询与如何在生命变化后发现乐趣和目的。\n  科学家拥有一种精美的直接技术，可用于检测其他恒星周围的行星。我们的空间记者滨海湾问：外星人天文学家可以使用它来找到我们吗？ \n每个工作日晚上，我们的编辑指导您通过当天最大的故事，帮助您发现新的想法，并让您惊喜。 订阅将此交付给您的收件箱。 ", "note_en": "Every weekday evening, our editors guide you through the biggest stories of the day, help you discover new ideas, and surprise you with moments of delight.   Subscribe to get this delivered to your inbox.\n  The world works in strange ways, and interesting design choices can often be found in the everyday objects we overlook. Here are two to think about just in time for summer.\n Ketchup bottles. If you’re old enough to remember glass Heinz ketchup bottles, you might also recall how frustrating they were to use. You’d strike the bottom until, eventually, a huge blob would splurt out, ruining your plate.\n Heinz’s current bottle is squeezable and it relocates the dispenser to the bottom, but its valve is so tight that a heap of ketchup still comes out with each squeeze.\n I compared the Heinz squeezable bottle with the cylindrical, fine-tipped sort that adorn many a diner and picnic table. I could get that generic bottle to output 30 times less condiment per squeeze, and in a fine line instead of a wide dollop. Today’s bottle might be good for a fry-dipping excursion, but it releases too much ketchup to dress a burger or hot dog.\n The earlier, cheaper packaging technology seems superior. So why would Heinz deploy a worse—or at least less flexible—design?\n Daniel Johnson, the chair of packaging science at Rochester Institute of Technology, assured me that big companies such as Kraft Heinz put lots of R&amp;D behind their packaging. The ketchup bottle would have been subject to focus-group studies of usage preferences, bottle-holding habits, and more. A Heinz spokesperson told me, “We’ve found that our consumers prefer a dollop to top a burger or for dipping.”\n That would explain why the bottle works the way it does, but it can’t stop me from lamenting such a one-note use of our nation’s favorite condiment. Invest in a cheap, picnic-type bottle and dispense from the brand-name bottle into it for a more versatile squeeze.\n Seedless watermelon. Stephanie Barlow, a senior director at the National Watermelon Promotion Board, told me that more than 90 percent of watermelons consumed in the United States today are seedless. The change happened slowly and then quickly: The first seedless hybrid melons appeared in the mid-20th century, but industrial farmers didn’t figure out how to pollinate them effectively at scale until the mid-2000s.\n That’s changed how watermelon gets eaten. Seeded melons were best consumed as wedges, with the seeds removed by hand, napkin, or—the traditional method—expectoration. But sans seeds, the watermelon came to enjoy more diverse uses: in fruit salads, in leafy salads, and even on pizza.\n The latter recipe is one that the watermelon board suggests in a promotional campaign tied to the release of Disney Pixar’s new animated film  Luca, which is set in  anguria-loving, mid-century Italy. Watermelon appears fleetingly in the film, when two girls on a balcony can be seen eating it in wide wedges—complete with seeds. A promotional image created by Pixar, not the watermelon board, even shows the film’s sea monsters enjoying big smiles of black-seeded fruit.\n Barlow told me that the watermelon board has stressed using only seedless-watermelon imagery in its communications. “But the visual of the seeded watermelon slice prevails,” she admitted.\n That’s probably because of the fruit’s symbolic relationship with summertime nostalgia. Luca’s Italian Riviera memories are of a piece with my own from American summer camps. When it comes to watermelons, we eat the fruit, but we also consume the image.\n Do any ordinary things make you wonder, Why is it like that?  Send them to  hello@theatlantic.com.\n   (1) One person is dead  and dozens are unaccounted for, after a building collapsed near Miami, police say. (2) Calls to “Free Britney”  continue, following the pop star’s brutal plea in court yesterday. (3) “ Infrastructure Week” may finally be over: President Joe Biden has  announced a bipartisan compromise.\n One question, answered: What do I do if I’m traveling and my seatmate won’t wear a mask? Our deputy managing editor Rachel Gutman has some advice:\n If you’re fully vaccinated and not  immunosuppressed or immunocompromised, you shouldn’t be in any significant danger from a seatmate with their nose out. On any long trip, your fellow passengers are going to need to eat and drink, and you should be prepared for that eventuality before buying a ticket.\n  If you’re particularly worried about mask compliance, you might want to opt for travel by train or plane, where conductors and flight attendants are more likely to be patrolling the rows. But that doesn’t eliminate the possibility of a free-for-all at the station or airport before you board.\n Find more safety rules for vaccinated summer travels in Rachel’s new article. And if you want tips for a fun vacation, not just a safe one, our happiness columnist, Arthur C. Brooks,  has you covered.\n   Listen to the newest episode of  The Experiment podcast, in which the sex therapist and Holocaust survivor Dr. Ruth shares advice with our staff writer Emma Green on  how to find pleasure and purpose after life-changing loss.\n  Scientists have a beautifully straightforward technique for detecting planets around other stars. Our space reporter Marina Koren asks:  Could alien astronomers use it to find us?\n  Every weekday evening, our editors guide you through the biggest stories of the day, help you discover new ideas, and surprise you with moments of delight.   Subscribe to get this delivered to your inbox.", "posttime": "2021-06-25 10:31:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "番茄酱,bottles,西瓜", "title": "为什么番茄酱瓶很难使用？ ", "title_en": "Why Are Ketchup Bottles So Hard to Use?", "transed": 1, "url": "https://www.theatlantic.com/newsletters/archive/2021/06/why-are-ketchup-bottles-so-hard-to-use/619292/", "via": "", "real_tags": ["番茄酱", "bottles", "西瓜"]}, {"category": "", "categoryclass": "", "imagename": "628cb0b19334d3a66918aad422b4de8d.jpg", "infoid": 1068161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的Windows 11消息全部是关于微软看到未来几年的计算的地方，但它与十年前的85亿美元的收购自25亿美元以来，Skype在Skype蓬勃发展的故事中。五年前，Skype是互联网呼叫和视频中的大名称，Microsoft为Windows 10制作了一个包含在安装中的“收件箱应用程序”，默认情况下在启动时启动。\n 现在，经过大流行的一年，在使用他们的PC的大流行年度比以往任何时候都有更多的人，Skype无处可见在Windows 11演示文稿或材料中。相反，Microsoft团队在新中心对齐任务栏中获得了一个突出显示的位置，并将深度集成到Windows中。\n   “Skype不再是运行Windows 11的新设备的收件箱应用程序。”\n Microsoft到处都是Skype的未来愿景变成了现实 - 但现实情况使竞争对手缩放和关注家庭名称。回到6月份，当微软制作个人账户的团队时，公司仍然支付给Skype的唇部服务，说：“对于只想要一个非常目的地的应用程序的人，Skype是一个很好的解决方案，我们支持它并鼓励它。“\n  但现在，如果你想使用Skype，你将不得不在Microsoft商店里找到它，就像任何其他应用程序一样。一家公司发言人讲述了边缘：“Skype不再是运行Windows 11的新设备的收件箱应用程序。Skype应用程序可免费下载Microsoft Store。”\n   当您考虑其中的其他应用程序11将包括开箱即用时，您可以看到过去一年的Skype如何倒下;即使是Windows终端也将是一个包装。 Skype加入OneNote，Paint 3D和3D查看器作为操作系统不再附带的应用程序。\n 甚至添加一键单击“同时满足”功能无法帮助Skype在大流行早期竞争。突然推动遥远的遥远的人常规用户选择强大的企业级聊天应用程序，巨头像微软一样，谷歌打开他们的门鼓励趋势。现在，就像谷歌一样，Microsoft有一个复杂的一系列会议工具来解决，而Windows 11的发射推出表明它会迅速削减脂肪而不是稍后。 ", "note_en": "Today’s  Windows 11 news is all about where Microsoft sees computing going over the next few years, but it’s just as much the story of how Skype has flourished and ebbed since  its $8.5 billion acquisition a decade ago. Five years ago, Skype was the big name in internet calling and video, and Microsoft made it an “inbox app” for Windows 10 that was included at installation and launched at startup by default.\n Now, after a pandemic year that has had more people using their PCs for voice and video than ever before, Skype was nowhere to be seen in the Windows 11 presentation or materials. Instead,  Microsoft Teams gets a highlight spot in the new center-aligned taskbar and deep integration into Windows.\n   “Skype is no longer an inbox app for new devices that run Windows 11.”\n The future vision that Microsoft had for  Skype everywhere has turned into a reality — but that reality made competitors Zoom and FaceTime into household names instead. Back in June, when Microsoft  made Teams available for personal accounts, the company still paid lip service to Skype, saying, “For folks that just want a very purpose-built app, Skype is a great solution, and we support it and encourage it.”\n  But now, if you want to use Skype, you’re going to have to go find it in the Microsoft Store like any other app. A company spokesperson tells  The Verge: “Skype is no longer an inbox app for new devices that run Windows 11. The Skype app is available to download through the Microsoft Store for free.”\n   You can see just how precipitously Skype has fallen over the last year when you consider which other apps Windows 11 will include out of the box; even Windows Terminal will be a pack-in. Skype joins OneNote, Paint 3D, and 3D Viewer as the apps that will no longer come with the OS.\n Even adding one-click “Meet Now” features  couldn’t help Skype compete early in the pandemic. The sudden push to go remote saw regular users choose powerful enterprise-grade chat apps, with giants like Microsoft and Google opening their doors to encourage the trend. Now,  just like Google, Microsoft has a complicated array of conferencing tools to sort out, and Windows 11’s launch suggests it’ll cut the fat sooner rather than later.", "posttime": "2021-06-25 09:49:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,程序,默认,skype", "title": "Windows 11将Skype作为默认应用程序删除 ", "title_en": "Windows 11 Drops Skype As a Default App", "transed": 1, "url": "https://www.theverge.com/2021/6/24/22549191/skype-windows-11-microsoft-teams", "via": "", "real_tags": ["windows", "程序", "默认", "skype"]}, {"category": "", "categoryclass": "", "imagename": "d20026c26cb585f8ea4fb40841e94a22.jpeg", "infoid": 1068160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一个wd mybook直播，连接到我的家兰，多年来锻炼身体。 我刚刚发现，在某种程度上，今天的所有数据都消失了，而目录似乎在那里但是空的。 以前，2T卷几乎是满满的，但现在它显示了全部容量。 即使是奇怪的事情就是当我尝试登录控制UI进行诊断时，我只能通过用于“所有者密码”的输入框进入此登录页面。 我已经尝试了默认的密码“admin”，也可以为其设置有什么机智... ", "note_en": "I have a WD mybook live connected to my home LAN and worked fine for years. I have just found that somehow all the data on it is gone today, while the directories seems there but empty. Previously the 2T volume was almost full but now it shows full capacity.  The even strange thing is when I try to log into the control UI for diagnosis I was-only able to get to this landing page with an input box for “owner password”. I have tried the default password “admin” and also what I could set for it wit...", "posttime": "2021-06-25 09:48:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,wd,登录", "title": "帮助WD MyBook中的所有数据Live Gay和所有者密码未知 ", "title_en": "Help All data in WD mybook live gone and owner password unknown", "transed": 1, "url": "https://community.wd.com/t/help-all-data-in-mybook-live-gone-and-owner-password-unknown/268111", "via": "", "real_tags": ["密码", "wd", "登录"]}, {"category": "", "categoryclass": "", "imagename": "f22887312a9f17db31857107e96ff348.jpg", "infoid": 1068159, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Western Digital我的书NAS所有者全球发现他们的设备已被神秘的出厂重置和所有文件删除。\n WD我的书是一个网络连接的存储设备，看起来像一本可以站在桌面上的小垂直书。 WD我的预订Live应用程序允许所有者访问他们的文件并远程管理其设备，即使NAS位于防火墙或路由器后面也是如此。\n 今天，WD我的书业主突然发现，他们的所有文件都是神秘的删除，他们无法再通过浏览器或应用程序登录设备。\n 当他们试图通过Web仪表板登录时，该设备指出它们具有AN＆＃34;无效的密码。＆＃34;\n ＆＃34;我有一个我的书，我的书与我的家里有关，多年来工作罚款。我刚刚发现，在某种程度上，今天的所有数据都消失了，而目录似乎在那里但是空的。以前，2T的卷几乎是满满的，但现在它显示了全部容量，＆＃34;一个WD我的书店在西方数字社区论坛上报告。\n ＆＃34;即使是奇怪的事情是当我尝试登录控制UI进行诊断时，我只是能够使用输入框的“所有者密码”的输入框进入此着陆页。我已经尝试了默认的密码“admin”，也是我可以为它设置的东西没有运气。＆＃34;\n   在进一步所有者确认其设备遭遇同样的问题后，业主报告说，MyBook日志显示，该设备已收到远程命令，以便在昨天和夜晚开始于下午3点开始的工厂重置。 \n＆＃34;我在User.log的这个驱动器中找到了这个驱动器今天：6月23日15:14:05我的书柜FactoryRestore.sh：开始脚本：6月23日15:14:05我的书橱关闭[24582]：关闭系统重新启动6月23日16:02:26我的书柜s15mountdatavolume.sh：begin脚本：启动6月23日16:02:29我的书柜_：pkg：wd-nas 6月23日16:02:30我的书柜_：pkg：网络 - 综合将军23 16:02:30我的书柜_：PKG：Apache-Php-webdav Jun 23 16:02:31我的书橱_：PKG：Date-Time Jun 23 16:02:31我的书柜_：PKG：警报Jun 23 16:02:31我的书柜logger：hostname =我的booklive 6月23日16:02:32我的书柜_：pkg：admin-rest-api我相信这是为什么这发生的罪魁祸首......没有人甚至是家用此时这个时间...＆＃34;\n 与QNAP设备不同，该设备通常连接到因特网并暴露于诸如Q锁定器勒索软件之类的攻击，Western Digital My Book设备存储在防火墙后面并通过我的书籍实时云服务器进行通信以提供远程访问。\n 一些用户表示担心西部数字和＃39; S服务器被黑客攻击以允许威胁演员将远程出厂重置命令推出连接到服务的所有设备。\n 如果威胁演员擦拭设备，那么奇怪的是没有人报告赎金笔记或其他威胁，这意味着攻击只是意味着破坏性。\n 如果您拥有一个西部数字我的书NAS设备，强烈建议您将其与网络断开连接，直到我们了解有关正在发生的事情的更多信息。\n 更新5:45 PM EST：Western Digital告诉BleepingComputer，他们正在积极调查攻击，但不相信这是他们服务器的妥协。\n 他们认为，在一些我的账户遭到损害后，攻击是在经过账户的损害之后进行的。 \n＆＃34;西部数字已确定我的一些书籍现场设备是由恶意软件损害的。 在某些情况下，这种妥协导致出厂重置，似乎擦除了设备上的所有数据。 我的预订现场设备于2015年收到了最终的固件更新。我们了解客户的数据非常重要。 此时，我们建议您将我的书与互联网的Live断开连接，以保护您的数据在设备上。 我们正在积极调查，我们将在可用时为此线程提供更新。＆＃34; - 西部数据  但是，他们的陈述并没有解释在大约同时遭遇许多账户的突破。 ", "note_en": "Western Digital My Book NAS owners worldwide found that their devices have been mysteriously factory reset and all of their files deleted.\n WD My Book is a network-attached storage device that looks like a small vertical book that you can stand on your desk. The WD My Book Live app allows owners to access their files and manage their devices remotely, even if the NAS is behind a firewall or router.\n Today, WD My Book owners worldwide suddenly found that all of their files were mysteriously deleted, and they could no longer log into the device via a browser or an app.\n When they attempted to log in via the Web dashboard, the device stated that they had an &#34;Invalid password.&#34;\n &#34;I have a WD My Book live connected to my home LAN and worked fine for years. I have just found that somehow all the data on it is gone today, while the directories seems there but empty. Previously the 2T volume was almost full but now it shows full capacity,&#34; a WD My Book owner reported on the Western Digital Community Forums.\n &#34;The even strange thing is when I try to log into the control UI for diagnosis I was-only able to get to this landing page with an input box for “owner password”. I have tried the default password “admin” and also what I could set for it with no luck.&#34;\n   After further owners  confirmed that their devices suffered the same issue, owners reported that the MyBook logs showed that the devices received a remote command to perform a factory reset starting at around 3 PM yesterday and through the night.\n &#34;I have found this in user.log of this drive today: Jun 23 15:14:05 My BookLive factoryRestore.sh: begin script: Jun 23 15:14:05 My BookLive shutdown[24582]: shutting down for system reboot Jun 23 16:02:26 My BookLive S15mountDataVolume.sh: begin script: start Jun 23 16:02:29 My BookLive _: pkg: wd-nas Jun 23 16:02:30 My BookLive _: pkg: networking-general Jun 23 16:02:30 My BookLive _: pkg: apache-php-webdav Jun 23 16:02:31 My BookLive _: pkg: date-time Jun 23 16:02:31 My BookLive _: pkg: alerts Jun 23 16:02:31 My BookLive logger: hostname=My BookLive Jun 23 16:02:32 My BookLive _: pkg: admin-rest-api I believe this is the culprit of why this happens…No one was even home to use this drive at this time…&#34;\n Unlike QNAP devices, which are commonly connected to the Internet and exposed to attacks such as the  QLocker Ransomware, the Western Digital My Book devices are stored behind a firewall and communicate through the My Book Live cloud servers to provide remote access.\n Some users have expressed concerns that Western Digital&#39;s servers were hacked to allow a threat actor to push out a remote factory reset command to all devices connected to the service.\n If a threat actor wiped devices, it is strange as no one has reported ransom notes or other threats, meaning the attack was simply meant to be destructive.\n If you own a Western Digital My Book NAS device, it is strongly advised that you disconnect it from the network until we learn more about what is happening.\n Update 5:45 PM EST: Western Digital told BleepingComputer that they are actively investigating the attacks but do not believe it was a compromise of their servers.\n They believe that attacks were conducted after some of the My Book owners had their accounts compromised.\n &#34;Western Digital has determined that some My Book Live devices are being compromised by malicious software. In some cases, this compromise has led to a factory reset that appears to erase all data on the device. The My Book Live device received its final firmware update in 2015. We understand that our customers’ data is very important. At this time, we recommend you disconnect your My Book Live from the Internet to protect your data on the device. We are actively investigating and we will provide updates to this thread when they are available.&#34; - Western Digital\n However, their statement doesnt explain how so many account were breached at approximately the same time.", "posttime": "2021-06-25 09:04:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,软件,书籍,digital,weren", "title": "Western Digital表示，一些我的书籍现场设备正在受到恶意软件的损害，导致出厂重置删除所有数据，相信其服务器并未被黑客攻击 ", "title_en": "Western Digital says some My Book Live devices are being compromised by malware leading to a factory reset erasing all data, believes its servers weren't hacked", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/wd-my-book-nas-devices-are-being-remotely-wiped-clean-worldwide/", "via": "", "real_tags": ["黑客", "软件", "书籍", "digital", "weren"]}, {"category": "", "categoryclass": "", "imagename": "10bf05b4c56b06de8afec36d587c78d2.jpg", "infoid": 1068158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows 11，今年年晚些时候，充满了新的功能，包括一项新的开始菜单，已被移动到中心和Microsoft商店以及Android a ... ", "note_en": "Windows 11, due out later this year, is full of new features, including a new Start menu that's been moved to the center and a Microsoft Store with Android a...", "posttime": "2021-06-25 09:04:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,wsj,中心", "title": "WSJ / YOUTUBE. ", "title_en": "WSJ/YouTube", "transed": 1, "url": "https://www.youtube.com/watch?v=Ocj0sVB9ykY&t=365s", "via": "", "real_tags": ["youtube", "wsj", "中心"]}, {"category": "", "categoryclass": "", "imagename": "ac6e9c5b53d13171db099bfe7f9e581b.png", "infoid": 1068157, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Cupcake是一种高效的Rust图书馆（添加版本）Fan-Vercauteren同性恋加密方案，提供了脚趾缩写的能力，添加/减去两个加密的向量，并重新打开了一个密文。  我们包括具有均匀操作和底层算术运算的基准测试和测试。 它们可以使用货舱和货物测试运行。  目前，我们只提供一组安全参数，即fv ::＆lt; scalar＆gt; :: default_2048（）; 该参数集根据同性恋加密安全标准链路的估计安全级别为约128比位。 使用您自己的风险使用其他参数！ 使用默认参数集，明文类型为U8的矢量，具有固定长度2048。 ", "note_en": "Cupcake is an efficient Rust library for the (additive version of) Fan-Vercauteren homomorphic encryption scheme, offering capabilities toencrypt vectors, add/subtract two encrypted vectors, and rerandomize a ciphertext.\n              We have included benchmarks and tests for both homomorphic operations and underlying arithmetic operations. They can be run using  cargo bench and  cargo test.\n  Currently, we provide only one set of secure parameter, namely  FV::&lt;Scalar&gt;::default_2048();. This parameter set has an estimated security level of about 128 bits accordingto the homomorphic encryption security standards  link. Use other parameters at your own risk! With the default parameter set, the plaintext type is vector of  u8 with a fixed length 2048.", "posttime": "2021-06-25 09:03:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,蛋糕,添加", "title": "蛋糕 - 晶格基添加剂均匀加密的锈图书库 ", "title_en": "Cupcake - A Rust library for lattice-based additive homomorphic encryption", "transed": 1, "url": "https://github.com/facebookresearch/Cupcake", "via": "", "real_tags": ["rust", "蛋糕", "添加"]}, {"category": "", "categoryclass": "", "imagename": "ff6afaa2e40521cf75dbbc29b7f8388a.png", "infoid": 1068156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它是由Alex Biryukov，Daniel Dinu和Dmitry Khovratovich设计的，来自卢森堡大学。\n argon2有3个变种：argon2d，argon2i和argon2id。 Argon2i针对密码散列进行了优化。 argon2有6个输入参数：密码，盐，记忆成本（算法的内存使用量），时间成本（算法的执行时间和迭代的数量），并行系数（并行线程数），散列长度。\n 学到更多 ”\n 密码散列是通过使用加密哈希函数创建一个称为哈希的定位字符串来保护纯文本密码的单向过程。加密散列函数旨在成为单向功能，即函数不可行的函数。\n 密码散列竞争由加密和安全专家组织，是一个开放的竞争，以提高对需要强密码散列算法的认识，并识别可以被识别为推荐标准的散列函数。 Argon2被选为2015年7月20日的最终PHC获奖者。\n   注＃2：始终选择强密码，包含特殊字符，小写和大写字母和数字。 ", "note_en": "It is designed by Alex Biryukov, Daniel Dinu, and Dmitry Khovratovich from University of Luxembourg.\n Argon2 has 3 variants:   Argon2d,  Argon2i and  Argon2id. Argon2i is optimized for password hashing. Argon2 has 6 input parameters: password, salt, memory cost (the memory usage of the algorithm), time cost (the execution time of the algorithm and the number of iterations), parallelism factor (the number of parallel threads), hash length.\n Learn more »\n Password hashing is a one-way process of securing plain text password by creating a bit string of a fixed size called hash using cryptographic hash function. Cryptographic hash functions designed to be a one-way function, that is, a function which is infeasible to invert.\n Password Hashing Competition, organized by cryptography and security experts, is an open competition to raise awareness of the need of strong password hashing algorithms and to identify hash functions that can be recognized as a recommended standard. Argon2 was selected as the final PHC winner on 20 July 2015.\n   Note #2: Always choose a strong password, containing special characters, lowercase and uppercase letters and numbers.", "posttime": "2021-06-25 09:03:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,密码,password,散列", "title": "密码与argon2算法，密码散列竞争的获奖者 ", "title_en": "Password with Argon2 Algorithm, the Winner of the Password Hashing Competition", "transed": 1, "url": "https://argon2.online/", "via": "", "real_tags": ["算法", "密码", "password", "散列"]}, {"category": "", "categoryclass": "", "imagename": "a0b92e6f7a9af2afe13a1032fdbe3662.png", "infoid": 1068155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "评析是一个开源网站，用于组织和参与挑战，以推动AI任务的艺术状态。 ", "note_en": "EvalAI is an open-source web platform for organizing and participating in challenges to push the state of the art on AI tasks.", "posttime": "2021-06-25 09:03:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,滑动,open,网站", "title": "评价：滑动的开源替代品 ", "title_en": "EvalAI: An Open-Source Alternative to Kaggle", "transed": 1, "url": "https://eval.ai/", "via": "", "real_tags": ["开源", "滑动", "open", "网站"]}, {"category": "", "categoryclass": "", "imagename": "89b972fb18d5186bf0af65e5db4d0b7c.png", "infoid": 1068154, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时，人们采取旨在解决狭隘问题的技术，并开始广泛应用。问题可能看起来类似，但利用独特的技术来解决一般问题可能会产生意外的后果。使用隐喻，如果你是锤子，一切都看起来像钉子。 JWT是一种这样的技术。\n     像OKTA这样的公司中小企业有许多深入的文章和视频谈论使用JWT令牌的潜在危险和效率低下[1]。然而，这些警告被营销人员，YouTubers，博主，课程创作者和其他人故意或不知不觉推广它的人黯然失色。\n 如果您查看许多这些视频和文章，他们只是谈论JWT的感知益处，忽略了缺陷。更具体地说，他们只是展示了如何使用它，但不要谈论JWT在实际生产环境中增加的撤销和额外的复杂性。他们也从未将其与现有的战斗方法进行比较，足以真正权衡利弊。\n 或者也许这是一个完美的，无法友好的名称，这导致其受欢迎程度。 “JSON”（通常很好），“Web”（对于Web）和“令牌”（意味着无状态）让人们认为它是完美的网络身份验证作业。\n 所以我认为这是营销击败工程师和安全专家的情况。但是，这并不糟糕，因为在黑客新闻上有常规长期和热情的辩论（见这里，她和这里），所以有希望。\n 如果您考虑过它，这些不断的辩论本身应该是一个红旗，因为你永远不应该看到这种辩论，特别是在安全领域。安全性应该是二进制的。无论是安全还是它都不是安全的。\n 无论如何，在这个博客文章中，我想专注于使用JWT的潜在危险，并谈论一段十年来的战斗测试解决方案。 \n为了进一步理解，当我谈论JWT时，我的意思是“无国运JWT”，这是JWTS普及的主要原因，最重要的是使用JWT的最大原因。此外，我已经列出了下面的资源部分中的所有其他文章，进入JWT的Nitty-Gritty。\n 在我们理解为什么它是危险之前，让我们首先通过采取示例用例来了解它的工作原理。\n  想象一下你正在使用推特。您登录，写一个推文，如推文，然后转发别人的推文。所以你做了四个动作。对于每个操作，您需要在执行该特定操作之前进行身份验证和授权。\n   您使用用户名和密码登录：服务器然后创建一个会话令牌，将该令牌存储在某些数据库中的用户的信息。 （注意：会话令牌是一个长期不明的字符串-AKA OPAQUE字符串 - 看起来像这样：FSAF12312DFSDF364351312SRW12312312DASD1ET3423R）\n 然后服务器将您的会话令牌发送到前端移动或Web应用程序。然后将该令牌存储在Cookie中或应用程序的本地存储中。\n 接下来，假设您写信并提交了推文。然后随着您的推文，您的应用程序还将发送会话令牌（通过cookie或标题），以便服务器可以识别您是谁。但是令牌只是一个随机的字符串，所以服务器如何知道你是谁从会话令牌？\n 当服务器收到会话令牌时，它将不会知道用户是谁，因此它将其发送到数据库以从该令牌中检索（4a）实际用户的信息（如UserID）。 \n如果用户存在并允许执行该操作（即发送推文），则服务器允许它们执行操作。\n   问题是，第四步是慢性的，需要为用户所做的每一个动作重复。因此，每一个API呼叫都会导致至少两个缓慢的DB呼叫，可以减慢整体响应时间。\n  使额外的数据库查找更快，以便额外的跳跃无关紧要。\n   您可以将状态存储在服务器内存中。但是，由于此状态仅在特定服务器上可用，因此这会导致问题。\n 使用“粘性会话”。在这里，您可以告诉负载均衡器始终在缩放后始终将流量指向特定服务器。这一次会导致不同的缩放问题，如果服务器衰减（缩小），则会丢失所有状态。\n   JWT，特别是当用作会话时，尝试通过完全消除数据库查找来解决问题。\n 主要思想是将用户的信息存储在会话令牌中！因此，而不是一些长时间随机字符串，将实际的用户信息存储在会话令牌中。为了保护它，使用唯一只读服务器的秘密签名的令牌的一部分。 \n因此，即使客户端和服务器可以看到令牌的用户信息部分，第二部分，签名部分只能由服务器验证。\n 在下面的图片中，令牌的粉红色部分具有有效载荷（用户的信息），可以通过客户端或服务器看到。\n 但是使用秘密字符串，标题和有效载荷本身签名蓝色部分。因此，如果客户端篡改具有有效载荷（例如冒充不同的用户），则签名将是不同的并且不会被认证。\n   您使用您的用户名和密码登录：服务器使用用户的信息和秘密创建JWT会话令牌（涉及DB）\n 然后服务器将JWT令牌发送到前端应用程序。对于未来的活动，用户可以只发送JWT令牌来识别用户而不是每次登录。\n 接下来，假设您写信并提交了推文。当您发送它，以及您的Tweet的文本时，您的应用程序还将发送JWT令牌（通过cookie或标题），以便服务器可以识别您是谁。但是服务器如何知道你是谁，你是谁来自JWT令牌？嗯，部分令牌已经拥有用户信息。\n 因此，当服务器收到JWT令牌时，它使用秘密来验证签名部分并从有效载荷部分获取用户信息。从而消除了DB呼叫。 \n前进为每个用户操作，服务器只需验证签名部分，获取用户信息，并允许用户执行该操作。因此完全跳过DB呼叫。\n   但是关于JWT令牌，还有一个额外的和重要的事情。也就是说，它使用了到期时间来实现自己。它通常设置为5分钟到30分钟。而且因为它是自包含的，你不能轻易撤消/无效/更新它。这真的是问题的症结所在的地方。\n  JWT的最大问题是令牌撤消问题。由于它继续工作，直到它到期，因此服务器没有简单的方法来撤销它。\n   想象一下，您在推特后从Twitter退出。您认为您已被退出使用，但不是这种情况。因为JWT是独立的，并将继续工作，直到它到期。这可能是5分钟或30分钟或任何作为令牌一部分设置的持续时间。因此，如果有人在此期间访问该令牌，他们可以继续访问它，直到它到期。\n  想象一下，您是Twitter的主持人或某些在线实时游戏，实际用户正在使用该系统。作为主持人，您希望快速阻止某人滥用系统。你不能再出现同样的原因。即使在阻止之后，在令牌到期之前，用户将继续访问服务器。\n  想象一下，用户是一个管理员，并通过更少的权限将降级为常规用户。再次，这不会立即生效，并且在令牌到期之前，用户将继续成为管理员。\n JWT通常不会加密，因此任何能够执行中间攻击和嗅探JWT的人现在都有您的身份验证凭据。这是更容易的，因为只需在服务器和客户端之间的连接上完成MITM攻击。 \n有人发现，多年来，许多实现JWT的图书馆已经有许多安全问题，甚至规范本身都有安全问题。甚至Auth0本身，促使JWT受到了问题。\n  在许多复杂的真实应用程序中，您可能需要存储一大吨不同的信息。并将其存储在JWT令牌中可能超过允许的URL长度或饼干长度导致问题。此外，您现在潜在地在每个请求上发送大量数据。\n  在许多真实世界的应用中，服务器必须维护用户的IP和轨道API以获得速率限制和IP-WhiteListing。因此，您需要使用炽热的快速数据库。要以某种方式思考你的应用程序与JWT无非是现实的。\n  一个流行的解决方案是在数据库中存储“撤销令牌”列表，并为每个呼叫检查它。如果令牌是撤销列表的一部分，则阻止用户采取下一个操作。但是现在，您正在额外调用DB来检查令牌是否被撤销，因此欺骗了JWT的目的。\n  虽然JWT确实消除了数据库查找，但它会在这样做时引入安全问题和其他复杂性。安全性是二进制 - 无论是安全的还是不是。因此，为用户会话使用JWT危险。\n  有方案在后端服务器到服务器 - 服务器（或微服务到微服务）通信，一个服务可以生成JWT令牌，以将其发送到不同的服务以进行授权目的，以及其他窄位置，例如重置密码，您可以在其中发送JWT令牌作为一次性短期令牌以验证用户的电子邮件。\n  解决方案是根本不使用JWT进行会话目的。而是，做传统，但更有效地进行战斗的方式。 \nIE。使数据库查找如此炽热（子毫秒），即额外的电话无关紧要。\n 选项2：让速度快速升起，这无关紧要（一个经过战斗测试的解决方案）\n 有没有任何数据库，如此快速燃烧它可以在亚毫秒的船舶上提供数百万个请求？\n 当然，有。它被称为redis！成千上万的公司为每日使用数十亿用户使用Redis只是为了这一确切的目的！\n 和Redis Enterprise是Redis OSS的增强版本，提供99.999％的可用性，并可以为万亿个请求提供服务。它可以用作私有云上的自由软件，也可以在前3个云中的任何一个云中使用。\n 更重要的是？ Redis Enterprise现在已从仅仅是一个缓存或会话商店演变为完全成熟的多模型数据库，其模块生态系统与核心REDIS一起运行。例如，您可以使用RediSJSON（10x更快的VS.市场领导者），并且基本上有一个实时MongoDB样数据库，或者使用REDISEX模块（4-100x更快），并实行实时全文搜索，如Algolia 。\n 如果您只需使用REDIS作为会话存储以及一些其他数据库作为主数据库，这就是您的体系结构的样子。有一点要注意的是，Redis Enterprise提供了四种类型的缓存：缓存（懒惰加载），写后面（回写），写字和读副本，与redis OSS仅提供一个（缓存-在旁边）。 \n请注意，闪电Emoji表示炽热速度。 并且蜗牛emoji表示速度慢。  如前所述，您还可以使用REDIS作为整个数据层的主数据库。 在这种情况下，您的架构变得更加简单，基本上，一切都变得愉快。  当然，公司不仅用作独立数据库，而且是作为一个地理上分布式数据库的集群。 ", "note_en": "Sometimes, people take technologies that are intended to solve a narrow problem and start applying them broadly. The problem may appear similar, but utilizing unique technologies to solve general issues could create unanticipated consequences. To use a metaphor, if you are a hammer, everything looks like a nail. JWT is one such technology.\n     There are many in-depth articles and videos from SMEs of companies like Okta talking about the potential dangers and inefficiencies of using JWT tokens [1]. Yet, these warnings are overshadowed by marketers, YouTubers, bloggers, course creators, and others who knowingly or unknowingly promote it.\n If you look at many of these videos and articles, they all just talk about the perceived benefits of JWT and ignore the deficiency. More specifically, they just show how to use it but don’t talk about revocations and additional complexities that JWT adds in a real production environment. They also never compare it with the existing battle-tested approaches deep enough to really weigh the pros and cons.\n Or maybe it’s the perfect, buzzworthy, and friendly name that’s leading to its popularity. “JSON” (generally well-liked), “Web”(for web), and “Token”(implies stateless) make people think that it’s perfect for their web authentication job.\n So I think this is a case where the marketing has beaten engineers and security experts. But, it’s not all bad because there are regular long and passionate debates about JWT on Hacker News (see  here,  her e and,  here), so there is hope.\n If you think about it, these constant debates themselves should be a red flag because you should never see such debates, especially in the security realm. Security should be binary. Either technology is secure or it’s not.\n In any case, in this blog post, I’d like to focus on the potential dangers of using JWT and also talk about a battle-tested solution that’s been around for a decade.\n For further understanding, when I talk about JWT, I mean “stateless JWT,” which is the primary reason for the popularity of JWTs and the biggest reason to use a JWT in the first place. Also, I’ve listed all the other articles in the resources section down below that go into the nitty-gritty of JWT.\n Before we understand why it’s dangerous, let’s first understand how it works by taking an example use case.\n  Imagine you are using Twitter. You log in, write a tweet, like a tweet, then retweet someone else’s tweet. So you did four actions. For each action, you need to be authenticated and authorized before you can perform that specific action.\n   You log in with your username and password:  The server then creates a session token, stores that token along with the user’s info in some database. (Note: A session token is a long unidentifiable string—aka opaque string—that looks like this: fsaf12312dfsdf364351312srw12312312dasd1et3423r)\n The server then sends you a session token to the front-end mobile or web application.  This token is then stored in the cookie or in the local storage of the app.\n Next, say you wrote and submitted a tweet. Then along with your tweet, your app will also send the session token (through a cookie or a header) so that the server can identify who you are. But the token is just a random string, so how can the server know who you are just from the session token?\n When the server receives the session token, it won’t know who the user is, so it sends that to the database to retrieve (4a) the actual user’s info (like userId) from that token.\n If the user exists and is allowed to do that action (i.e send a tweet), the server allows them to do the action.\n   The problem is that step four is slow and needs to be repeated for every single action the user does. So every single API call leads to at least two slow DB calls which can slow down the overall response time.\n  Make the extra database lookup much faster so that the additional hop won’t matter.\n   You can store the state in the server’s memory. But this causes issues when you scale since this state is only available on a specific server.\n Use “sticky sessions”. Here you tell the load balancer to always direct the traffic to a specific server even after you scale up. Again this causes different scaling issues and if the server goes down (scale down), you’ll lose all the state.\n   JWT, especially when used as a session, attempts to solve the problem by completely eliminating the database lookup.\n The main idea is to store the user’s info in the session token itself! So instead of some long random string, store the actual user info in the session token itself. And to secure it, have part of the token signed using a secret that’s only known to the server.\n So even though the client and the server can see the user info part of the token, the second part, the signed part, can only be verified by the server.\n In the picture below, the pink section of the token has the payload (user’s info) and can be seen by both the client or the server.\n But the blue part is signed using a secret string, the header, and the payload itself. And so if the client tampers with the payload (say impersonates a different user), the signature will be different and won’t be authenticated.\n   You log in with your username and password:  The server then creates a JWT session token using the user’s info and the secret (no DB is involved)\n The server then sends you a JWT token to the front-end application. For future activities, the user can just send the JWT token to identify the user instead of logging in every time.\n Next, say you wrote and submitted a tweet. When you send it, along with your Tweet’s text, your app will also send the JWT token (through a cookie or a header) so that the server can identify who you are. But how can the server know who you are just from the JWT token? Well, part of the token already has the user information.\n So when the server receives the JWT token, It uses the secret to validate the signed part and gets the user info from the payload part. Thus eliminating the DB call.\n Going forward for every user action, the server simply verifies the signed part, gets the user info, and lets the user do that action. Thus completely skipping the DB call.\n   But there is one additional and important thing to know about the JWT tokens. And that is that it uses an expiration time to expire itself. It’s typically set to 5 minutes to 30 minutes. And because it’s self-contained, you can’t easily revoke/invalidate/update it. This is really where the crux of the problem lies.\n  The biggest problem with JWT is the token revoke problem. Since it continues to work until it expires, the server has no easy way to revoke it.\n   Imagine you logged out from Twitter after tweeting. You’d think that you are logged out of the server, but that’s not the case. Because JWT is self-contained and will continue to work until it expires. This could be 5 minutes or 30 minutes or whatever the duration that’s set as part of the token. So if someone gets access to that token during that time, they can continue to access it until it expires.\n  Imagine you are a moderator of Twitter or some online real-time game where real users are using the system. And as a moderator, you want to quickly block someone from abusing the system. You can’t, again for the same reason. Even after you block, the user will continue to have access to the server until the token expires.\n  Imagine the user is an admin and got demoted to a regular user with fewer permissions. Again this won’t take effect immediately and the user will continue to be an admin until the token expires.\n JWT’s are often not encrypted so anyone able to perform a man-in-the-middle attack and sniff the JWT now has your authentication credentials. This is made easier because the MITM attack only needs to be completed on the connection between the server and the client.\n   It’s been found that many libraries that implement JWT have had many security issues over the years and even the spec itself had security issues. Even Auth0 itself, who promotes JWT  got hit with an issue.\n  In many complex real-world apps, you may need to store a ton of different information. And storing it in the JWT tokens could exceed the allowed URL length or cookie lengths causing problems. Also, you are now potentially sending a large volume of data on every request.\n  In many real-world apps, servers have to maintain the user’s IP and track APIs for rate-limiting and IP-whitelisting. So you’ll need to use a blazing fast database anyway. To think somehow your app becomes stateless with JWT is just not realistic.\n  One popular solution is to store a list of “revoked tokens” in a database and check it for every call. And if the token is part of that revoked list, then block the user from taking the next action. But then now you are making that extra call to the DB to check if the token is revoked and so deceives the purpose of JWT altogether.\n  Although JWT does eliminate the database lookup, it introduces security issues and other complexities while doing so. Security is binary—either it’s secure or it’s not. Thus making it dangerous to use JWT for user sessions.\n  There are scenarios where you are doing server-to-server (or microservice-to-microservice) communication in the backend and one service could generate a JWT token to send it to a different service for authorization purposes And other narrow places, such as reset password, where you can send a JWT token as a one-time short-lived token to verify the user’s email.\n  The solution is to not use JWT at all for session purposes. But instead, do the traditional, but battle-tested way more efficiently.\n I.e. make the database lookup so blazing fast (sub-millisecond) that the additional call won’t matter.\n Option 2: Make the look up blazing fast that it won’t matter (a battle-tested solution)\n Is there any database out there so blazing fast that it can serve millions of requests in sub-milliseconds?\n Of course, there is.  It’s called Redis!  Thousands of companies that serve billions of users daily use Redis just for this exact purpose!\n And Redis Enterprise is an enhanced version of the Redis OSS that provides 99.999% availability and can serve trillions of requests. It can be used as free software on private clouds or in the cloud on any of the top-3 clouds.\n What’s more? Redis Enterprise has now evolved from just being a cache or session store, to a fully-fledged multi-model database with its  module ecosystem that runs natively with core Redis.  For example, you can use  RedisJSON ( 10x faster vs. the market leader) and essentially have a real-time MongoDB-like database, or use the  RediSearch module ( 4–100x faster) and implement real-time full-text search like Algolia.\n If you simply use Redis as a session store and some other Database as a primary database, this is how your architecture would look.  One thing to note is that Redis Enterprise provides  four types of caching: Cache-aside (Lazy-loading), Write-Behind (Write-Back), Write-Through, and Read-replica, unlike Redis OSS which only provides one (Cache-aside).\n Note that the lightning emoji indicates a blazing fast speed. And the snail emoji indicates slow speed.\n  As mentioned earlier, you can also use Redis as a primary database for your entire data layer. In this scenario, your architecture becomes much simpler and basically, everything becomes blazing fast.\n   Of course, companies use Redis not just as a standalone database but as a cluster of geographically distributed databases.", "posttime": "2021-06-25 09:03:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jwt,tokens", "title": "jwt代币不安全 ", "title_en": "JWT Tokens are NOT safe", "transed": 1, "url": "https://redislabs.com/blog/json-web-tokens-jwt-are-dangerous-for-user-sessions/", "via": "", "real_tags": ["jwt", "tokens"]}, {"category": "", "categoryclass": "", "imagename": "79c1f0ab49c38f880504350ab1f51202.jpg", "infoid": 1068153, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "诈骗者正在通过滥用YouTube推广您在加密电脑之前和期间出现的广告的一部分，通过流行的分散金融协议，Unispap，Unispap，Unispe，诈骗用户毫无戒心的用户窃取近100万美元的USD。\n    5月初，诈骗者损害了Twitter和YouTube账户，以推动Tesla和Spacex创始人Elon Musk在星期六晚上的外观之前推广了一系列加密货币诈骗，窃取了比特币，Ethereum和Doge代币的比特币超过1000万美元。通过YouTube进行的诈骗最为成功，导致盗窃超过900万美元。\n  请注意，“令牌”和“硬币”都可互换地使用，以描述比特币，以外的，DogeCoin等加密货币和许多其他。\n  自5月底以来，通过在YouTube加密货目上购买广告空间，诈骗者在毫无戒心的用户中窃取了超过43万美元的加密货币，以推广声称由Musk创建的假Spacex硬币（或$ Spacex令牌）。在发布此博客职位时，诈骗者有一个正在进行的活动，一旦完成，将可能会将被盗加密货币的总量增加到近100万美元。\n    早在5月22日，Youtube广告旨在欺骗用户的加密货币，之前或期间关于空间中受欢迎的创造者的加密货币中的视频。该广告特色了各种无关的麝香视频，他在最近几个月就像比特币和DogeCoin一样的加密货币的支持很多。\n      广告长度三到五分钟，并包含一个模板，其中包括顶部来自埃隆麝香的伪造推文，声称他正在推出自己的加密货币，称为$ spacex。\n    在相同的模板中，是一个描述部分，具有带有Tesla徽标的标题。该描述称“Elon Musk正在推出自己的加密货币，$ SpaceX。”硬币，诈骗广告声明的目的是“将每个人带到火星并使人类生活成为可能。”最后，他们补充说，对于涉及$ SpaceX硬币的每笔交易，将捐赠“走太空研究公司”，以“帮助艾隆的使命”。 \n上面的广告中的嵌入式视频是来自2013年的计算机历史博物馆和KQED的“革命者”的elon访谈的剪辑。诈骗者在这些YouTube广告中不分青红皂白地使用各种麝香。\n            浏览用户的个人资料时，我们会看到这位用户于2011年8月加入了YouTube。我遇到的许多帐户是在10  -  12年前创建的。在这种情况下，除了在诈骗广告中使用的账户之外没有与帐户相关联的其他视频，但这可能会有所不同。很可能这些是休眠的YouTube账户，诈骗者能够妥协，以促进他们的狡猾广告。\n  在出版之前，我们致电YouTube分享我们的研究结果，但我们没有收到回复。\n    这些广告利用了同样的模板，我看到在5月份的SNL主题麝香诈骗中使用，包括Tesla标识。\n    在有关假设的SPACK X硬币公告的YouTube广告中，您认为诈骗者可能已在Spacex徽标中交换，而不是保持TESLA标识，但它似乎只是彻底复制了模板。\n    YouTube ADS本身不包含与网站的直接链接。相反，它们在模板的另一部分宣传网站。在我的分析中，我发现至少通过这些假的YouTube广告推广了12个不同的网站，包括：\n    请注意，这可能不是这些广告系列中使用的所有域的详尽列表。 \n在此广告系列中使用的网站使用电报的匿名博客平台来设计Telegra.ph。\n    为了让用户购买欺诈性$ SPACEX硬币，诈骗者包括如何在计算机上安装MetAmask的逐步演练，是MetAmask，这是数百万用户使用的计算机。我验证了诈骗者是否链接到Google Chrome的合法元质量扩展，而不是假的扩展。\n    从那里，该网站指示用户点击一个自定义的链接到unis的概念，这是一个受分散金融（Defi）协议的世界的流行分散交换（Dex）。作为DEFI协议，UNISAP允许加密电机支架在没有所涉及的集中实体的情况下在平台上交换（或交换）令牌，因此分散性的性质。与此同时，缺乏中央权威是这些骗局能够成功运营的原因之一。\n  UnisAP允许个人在平台上创建自己的令牌。在这种情况下，诈骗者将用户链接到UnisAP以导入他们创建的欺诈性$ SPACEX令牌合同。\n    在尝试导入$ SPACEX令牌时，UNISWAP的界面提供了警告，即它“未出现在活动令牌列表中”，但仅注意用户确保“这是您要交易的令牌”。\n  演练包括多个屏幕截图，用户如何交换他们的形象令牌以换取所谓的$ spacex硬币。它还包括如何确保在Metamask钱包内可见硬币的指导。\n      在我遇到的十二个网站上，我观察了$ SPACEX硬币的三个不同的合同。在这项研究期间，七个指向相同的$ spacex令牌合同，我将参考alpha，而两个站点，spxlaunch.com和salespacex.com，指出了两个单独的$ spacex令牌合同，我将参考其中β和伽玛。但是，由于alpha广告系列于6月13日结束，其余地点现在指向伽玛运动。 \n传统的加密货币诈骗要求用户向特定地址发送加密电力，以便“双重”他们的金钱，这永远不会发生。然而，这个骗局实际上是非常令人邪恶的。它通过使用像UniSAP，实际的令牌智能合同等值得注意的DEX平台来创造合法性感，以及用户的MetAmask钱包内出现的令牌的视觉确认。那么用户如何通过假令牌欺骗？这是一个被称为地毯拉扯的概念。\n  为了列出并促进欺诈性$ SPACEX硬币的交易在UNISAP上，诈骗者必须提供一些流动性。\n    在我遇到的三个令牌合同中，诈骗者在资金时，在综合价值为146,300.44美元，提供了60个Etereum硬币（每份合同的20个）的总流动性。\n  随着用户在UNISAP上购买硬币，它们增加了$ SPACEX合同的流动性。在某些时候，此操作背后的诈骗者将从合同中删除流动性，从而在拥有$ Spacex硬币的人身上“拉动地毯”，使它们毫无价值。\n      最近，购买与Alpha合同相关的$ SPACEX硬币的用户发布在UNISAM Pupreddit上表示，他们无法将他们的硬币换回到以外。这是另一个称为密​​码发电空间中蜜罐的概念。它与传统使用的网络安全空间中的术语不同，这集中在捕获坏演员。在这种情况下意味着什么，即毫无戒心的用户被吸引到这个假的$ Spacex硬币中投资，但诈骗者创建的合同旨在防止用户能够将他们的硬币换回到以外。能够从合同中迁出资金的唯一一个地址是创造者。因此，即使诈骗者立即拉出栅格，目前的$ SPACEX硬币持有人无论如何都无法获得资金。\n    当创造这些假冒$ SPACEX合同时，诈骗者在每份合同中铸造了10亿美元（1,000,000,000,000,000），并将流动性添加到合同中，持续200万（20万千万）硬币。诈骗者还通过将硬币送到VB，Binance和Huobi等流行交流的钱包来烧毁每份合同的8亿（800,000,000）美元的空间X硬币。\n    由于这些欺诈性$ SPACEX硬币未列出任何这些交换，因此送到这些钱包的硬币不能返回并永远丢失，有效地从供应中燃烧它们。我的理解是，通过燃烧这些硬币，诈骗者正在减少可用硬币的供应，从而提高$ Spacex硬币的感知价格。 \nEtherscan是Etereum网络最受欢迎的区块ClockChine探险家之一，通常是加密电脑爱好者来获取信息，例如与各种基于国内的项目相关的活动。在欺诈性$ SPACEX合同的情况下，诈骗者已经将这些页面的评论部分与虚假的社会证明播种。\n    通过假社会证据淹没这些页面背后的意图是确保任何呼唤$ SPACEX硬币的欺诈性质的任何评论都丢失了噪音。\n  假货$ Spacex Coin Rug Pulls赢得了430,000美元以上的诈骗者，潜力赚取近100万美元\n  在我遇到的三个假货合约中，两个已经完成了他们的地毯。下图显示了诈骗者提供的流动性的分解，从合同中取消的流动性和他们由骗局所做的差异（利润）。\n    在发布这个博客帖子时，Alpha和Beta广告系列已结束，伽玛运动仍然活跃。这些数字反映了2021年6月21日至6月21日收集的数据，但不包括送到alpha和β合约后清算后的任何额外资金。\n  Alpha Campaign于5月22日开始并于6月13日结束，并纳入诈骗者的利润超过403,000美元。通过从5月9日至6月9日期间经营的Beta竞选活动，诈骗者利用毫无戒心的用户利用近28,000美元的曲调。伽玛运动开始于6月9日开始运营并在发布这篇博客职位时正在进行，已经已经看到了大量的活动，估计申请额度为543,000美元。这意味着将诈骗者设置为在将地毯拉动的情况下，从这个广告系列中达到另外六个数字的总和，使他们被盗的总加密电流达到近100万美元。\n  一个警告：诈骗者可能向这些合同发送额外资金，以使他们出现更合理，所以列出的数字可以由诈骗人自己的资金部分地夸大。 \n虽然Ethereum上的DECI协议（如unisap和sushiswap）或指数智能链（BSC）（如煎饼猫）（如煎饼猫），促进了对区块链的新的投资时代，这些平台的权力下放意味着诈骗者有自由统治。具有传统的金融形式，如银行，这些金融部门被集中，被盗资金可能会被重新夺回并归还给受害者。然而，在区块链上，被盗的资金丢失，几乎没有追索恢复，并且在DECII的世界中，这是一个不幸在议定书中存在的权衡。结果，像“地毯拉动”和“蜜罐”这样的术语已成为污染内对话的一部分。\n  这个特殊的活动脱颖而出的原因是，它没有通过电报渠道或社交媒体依赖促销，但它骑了通过YouTube找到的成功诈骗者浪潮。它通过利用YouTube广告的现有基础设施来确定他们的加密充足性爱好者的目标人口统计，并在成千上万的观众面前获得广告。许多新的加密货币投资者都会向YouTube频道寻找新闻和指导，因此它是推广假币的理想渠道。\n      记得染色师：加密货爱好者可能熟悉首字母缩略词，它代表自己的研究。它是社区内的常见避免，有充分的理由。在投资任何资产之前，潜在投资者在投资之前对自己的研究是至关重要的，特别是在加密货币空间。\n  在使用DEX时寻找警示迹象：虽然unisap和sushiswap等德克斯自主运作，但他们在与服务交互时为用户施加了一些障碍。\n  正如我之前讨论的那样，UNIS时期显示有关不显示在活动令牌列表中的骗局令牌的有限警告。它还在显示合同的地址时添加了“未知来源”的横幅。用户应该将此视为导入令牌合同之前的红旗，并将其交换为其加密电机。虽然没有每个unis的硬币将出现在一个活跃的令牌列表中，但当他们看到这项警告时，投资者应该是令牌的警惕。\n  对于真正的项目来说是警惕的假币：虽然没有$ SPACEX硬币，但潜在的投资者也应该对真正的项目的假币威华。进入的障碍低屏障使用与实际项目的相同名称在Ethereum网络上创建令牌合同。\n  我们今天已经了解了Unisap上的假货$ Aurora令牌合同交易。请注意，与此项目相关的任何ERC-20令牌，您肯定会通过购买这些冒充诈骗来丢失资金。警告他人。 \n-  Arto Bendiken（@Bendiken）5月21日，2021年5月21日  寻找这些项目创作者的官方公告。 它们通常将分享有关令牌合同发布的详细信息以及验证的合同地址在部署之前。  如有疑问，请坐下：有一个满意的需求，试图利用加密货币空间中的新和新兴硬币的收益。 但是，如果您对硬币或项目的合法性甚至有丝毫有疑问，即使在您的染色之后，也可能最好坐下来。 源于投资假币和项目的潜在损失可能是显着的，因此最好错过潜在的机会，而不是发现自己在钱包里持有毫无价值的令牌。 ", "note_en": "Scammers are on pace to steal nearly $1 million USD from unsuspecting users through a popular decentralized finance protocol, Uniswap, by abusing YouTube to promote a fake SpaceX coin as part of ads appearing before and during cryptocurrency videos.\n    In early May,  scammers compromised Twitter and YouTube accounts to promote a series of cryptocurrency scams ahead of Tesla and SpaceX founder Elon Musk’s appearance on Saturday Night Live, stealing over $10 million dollars in Bitcoin, Ethereum and Doge tokens. The scams conducted via YouTube were the most successful, resulting in a theft of over $9 million dollars.\n  Please note that both “tokens” and “coins” are used interchangeably to describe cryptocurrency like Bitcoin, Ethereum, Dogecoin, and many others.\n  Since the end of May, scammers have stolen over $430,000 in cryptocurrency from unsuspecting users by purchasing advertising space on YouTube cryptocurrency videos to promote a fake SpaceX coin (or $SpaceX token) claiming to be created by Musk. At the time this blog post was published, the scammers had one ongoing campaign that, once complete, would potentially increase the total amount of stolen cryptocurrency to nearly $1 million.\n    As early as May 22, YouTube advertisements designed to scam users out of their cryptocurrency appeared before or during videos about cryptocurrency from popular  creators in the space. The advertisements featured a variety of unrelated videos of Musk, who’s garnered much attention for his support of cryptocurrencies like Bitcoin and Dogecoin in recent months.\n      The advertisements are three to five minutes long and feature a template that includes a falsified tweet at the top from Elon Musk that claims he’s launching his own cryptocurrency called $SpaceX.\n    Within the same template is a description section, featuring a header with the Tesla logo. The description says “Elon Musk is launching his own cryptocurrency, $SpaceX.” The purpose of the coin, the scam advertisement claims, is to “take everyone to mars and make human life possible there.” Finally, they add that for each transaction involving the $SpaceX coin, a donation will be made “towards space research companies” in order to “help Elon’s mission.”\n    The embedded video in the advertisement above is a clip from  Elon’s interview for the Computer History Museum and KQED’s “Revolutionaries” from 2013. The scammers use various videos of Musk indiscriminately in these YouTube ads.\n            When browsing the user’s profile, we see that this user joined YouTube in August, 2011. Many of the accounts I encountered were created between 10-12 years ago. In this instance, there are no other videos associated with the account, except for the one used in the scam advertisement, but that may vary. It is likely these are dormant YouTube accounts, which scammers were able to compromise to promote their dodgy advertisements.\n  We reached out to YouTube to share our findings prior to publication, but we did not receive a response.\n    These advertisements leverage the same template I saw being used in the  SNL-themed Musk scams from earlier in May, including the Tesla logo.\n    In the YouTube ads regarding the supposed SpaceX coin announcement, you would think the scammers might have swapped in the SpaceX logo instead of keeping the Tesla logo, but it appears they just copied the template outright.\n    The YouTube ads themselves do not contain a direct link to a website. Instead, they advertise the website in another section of the template. During my analysis, I found at least twelve different websites being promoted through these fake YouTube advertisements, which include:\n    Please note this may not be an exhaustive list of all domains used in these campaigns.\n    The websites used in this campaign were designed using  Telegram’s anonymous blogging platform, Telegra.ph.\n    To get users to purchase the fraudulent $SpaceX coins, the scammers include a step-by-step walkthrough on how to install  MetaMask, a popular browser-based wallet used by millions of users, on their computers. I verified that the scammers are  linking to the legitimate MetaMask extension for Google Chrome instead of a fake extension.\n    From there, the website instructs users to click on a customized link to  Uniswap, a popular  decentralized exchange (DEX) in the world of  decentralized finance (DeFi) protocols. As a DeFi protocol, Uniswap allows cryptocurrency holders to exchange (or swap) tokens on the platform without a centralized entity being involved, hence the decentralized nature. At the same time, the lack of a central authority is one of the reasons why these scams are able to operate successfully.\n  Uniswap allows individuals to  create their own tokens to be tradeable on the platform. In this instance, the scammers are linking users to Uniswap to import a fraudulent $SpaceX token contract that they created.\n    When attempting to import the $SpaceX token, Uniswap’s interface provides a warning that it “doesn’t appear on the active token list(s)” but only cautions the user to ensure “this is the token that you want to trade.”\n  The walkthrough includes several screenshots on how users can swap their Ethereum tokens in exchange for the alleged $SpaceX coin. It also includes guidance on how to ensure the coins are visible within the MetaMask wallet.\n      Across the twelve websites I encountered, I observed three different contracts for $SpaceX coins. During this research, seven were pointing to the same $SpaceX token contract, which I will refer to as Alpha, while two sites, spxlaunch.com and salespacex.com, pointed to two separate $SpaceX token contracts, which I will refer to as Beta and Gamma. However, since the Alpha campaign ended on June 13, the remaining sites are now pointing to the Gamma campaign.\n    Conventional cryptocurrency scams ask users to send cryptocurrency to a specific address in order to “double” their money, which never happens. However, this scam is actually quite nefarious. It creates a sense of legitimacy through the use of a notable DEX platform like Uniswap, an  actual token smart contract, and the visual confirmation of tokens appearing within a user’s MetaMask wallet. So how do users get scammed through fake tokens? It’s a concept known as a rug pull.\n  In order to list and facilitate the trading of the fraudulent $SpaceX coin on Uniswap, the scammers have to  provide some liquidity.\n    Across the three token contracts I encountered, scammers provided a total liquidity of 60 Ethereum coins (20 for each contract) at a combined value of $146,300.44 at the time of funding.\n  As users purchase the coins on Uniswap, they add to the liquidity of the $SpaceX contract. At some point, the scammers behind this operation will remove the liquidity from the contract, thus “pulling the rug” on those who own the $SpaceX coins, making them worthless.\n      Recently, a user that purchased $SpaceX coins associated with the Alpha contract,  posted on the Uniswap subreddit saying they weren’t able to swap their coins back to Ethereum. This is another concept known as honeypotting in the cryptocurrency space. It is different from the traditional use of the term in the cybersecurity space, which is focused on trapping bad actors. What it means in this context is that unsuspecting users are drawn into investing in this fake $SpaceX coin, but the contract created by the scammers was designed to prevent users from being able to swap their coins back to Ethereum. The only address capable of moving funds out of the contract is the creator. So even if the scammers don’t pull the rug right away, current $SpaceX coin holders are unable to get their funds back anyway.\n    When these fake $SpaceX contracts were created, the scammers minted 1 billion coins (1,000,000,000) in each contract and added liquidity to the contract for 200 million (200,000,000) coins. The scammers also  burned 800 million (800,000,000) $SpaceX coins for each contract by sending the coins to wallets for popular exchanges like  Vb,  Binance and  Huobi.\n    Since these fraudulent $SpaceX coins aren’t listed on any of these exchanges, the coins sent to these wallets cannot be returned and are lost forever, effectively burning them from the supply. My understanding is that through burning these coins, the scammers are reducing the supply of available coins, thus driving up the perceived price of the $SpaceX coin.\n    Etherscan, one of the most popular blockchain explorers for the Ethereum network, is often where cryptocurrency enthusiasts go to obtain information, such as activity related to various Ethereum-based projects. In the case of the fraudulent $SpaceX contracts, scammers have seeded the comments section of these pages with fake social proof.\n    The intention behind flooding these pages with fake social proof is to ensure that any comments calling out the fraudulent nature of the $SpaceX coins get lost in the noise.\n  Fake $SpaceX coin rug pulls have earned the scammers over   $430,000   thus far  , with potential to earn nearly $1 million\n  Across three of the fake $SpaceX contracts I encountered, two have already completed their rug pulls. The following graph shows a breakdown of the liquidity provided by the scammers, the amount of liquidity removed from the contracts and the difference (profit) they made from their scams.\n    At the time this blog post was published, the Alpha and Beta campaigns had ended and the Gamma campaign was still active. These figures reflect data collected up until June 21, 2021, but do not include any additional funds sent to the Alpha and Beta contract post liquidation.\n  The Alpha campaign began on May 22 and concluded on June 13 and netted the scammers a profit of over $403,000. Through the Beta campaign, which operated from May 29 through June 9, the scammers profited off unsuspecting users to the tune of nearly $28,000. The Gamma campaign, which began operating on June 9 and was ongoing at the time this blog post was published, has seen a high volume of activity already, earning the scammers an estimated $543,000. This means the scammers are set to make another six figure sum from this campaign once they pull the rug, bringing the total cryptocurrency they’ve stolen to nearly $1 million.\n  One caveat: the scammers likely send additional funds to these contracts to make them appear more legitimate so the figures listed could be partially inflated by the scammers’ own funds.\n    While DeFi protocols on Ethereum (such as Uniswap and SushiSwap) or those on the Binance Smart Chain (BSC) (like Pancakeswap) facilitate a new era of investments on the blockchain, the decentralization of these platforms means that scammers have free reign. With traditional forms of finance like banks, which are centralized, stolen funds can potentially be recaptured and returned to victims. However, on the blockchain, stolen funds are lost with little to no recourse on recovery, and in the world of DeFi, it is an unfortunate tradeoff that exists within the protocol. As a result, terms like “rug pulls” and “honeypots” have become part of the dialogue within DeFi.\n  The reason this particular campaign stands out is that it didn’t rely on promotion through Telegram channels or social media, but it rode the wave of success scammers have found through YouTube. It did so by leveraging the existing infrastructure of YouTube Ads to identify their target demographic of cryptocurrency enthusiasts and get their ads in front of thousands of viewers. Many new cryptocurrency investors look to YouTube channels for news and guidance, so it’s an ideal channel for promoting a fake coin.\n      Remember to DYOR: Cryptocurrency enthusiasts may be familiar with the acronym  DYOR, which stands for Do Your Own Research. It is a common refrain within the community for good reason. It is vital for potential investors to do their own research before investing in any asset, especially in the cryptocurrency space.\n  Look for cautionary signs when using a DEX: While DEXes like Uniswap and SushiSwap operate autonomously, they have put up some roadblocks for users when interacting with their services.\n  As I discussed earlier, Uniswap displays a limited warning about the scam token not appearing on active token lists. It also adds a banner of “Unknown Source” when displaying the address for the contract. Users should see this as a red flag before importing the token contract and swapping it for their cryptocurrency. While not every coin on Uniswap will appear on an active token list, investors should be wary of a token when they see this warning.\n  Be wary of fake coins for real projects: While there is no such thing as a $SpaceX coin, potential investors should also be wary of fake coins for real projects. There is a low barrier to entry to create a token contract on the Ethereum network using the same name as a real project.\n  We’ve today been made aware of fake  $AURORA token contracts trading on Uniswap. Please be advised that there isn&#39;t any ERC-20 token associated with this project and that you will certainly lose your funds by buying into these impersonation scams. Warn others.\n\r— Arto Bendiken (@bendiken)  May 21, 2021\n    Look for official announcements from the creators of these projects. They will typically share details about the release of a token contract as well as what the verified contract address is prior to deployment.\n  When in doubt, sit this one out: There’s a pent up demand to try to capitalize gains on new and emerging coins in the cryptocurrency space. However, if you have even the slightest bit of doubt about the legitimacy of a coin or project, even after you DYOR, it’s probably best to sit this one out. The potential losses that stem from investing in fake coins and projects can be significant, so it’s better to miss out on a potential opportunity than to find yourself holding onto worthless tokens in your wallet.", "posttime": "2021-06-25 09:02:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,youtube,elon,硬币", "title": "诈骗者通过YouTube广告距离假雄麝香Spacex硬币近100万美元 ", "title_en": "Scammers Earn Nearly $1M from Fake Elon Musk SpaceX Coin via YouTube Ads", "transed": 1, "url": "https://www.tenable.com/blog/elon-musk-youtube-advertising-scams-fake-spacex-coin-promoted-during-cryptocurrency-videos", "via": "", "real_tags": ["广告", "youtube", "elon", "硬币"]}]