[{"category": "", "categoryclass": "", "imagename": "c340c631693bfbc7ad6c240db9cc68b5.png", "infoid": 1071410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 IMDb 推出免费的、受广告支持的流媒体服务两年半后，现在可以在移动设备上使用。 IMDb TV 应用程序于周二在美国面向 Apple 的 iOS（iPhone 和 iPad）和 Android 移动设备推出 两大移动平台的加入是在今年在 Roku、Xbox One、Xbox Series X|S 上推出 IMDb TV 应用程序之后推出的。 Android TV 设备，包括配备 Google TV 的 Chromecast、LG 智能电视（2018-2021 型号）和 Sony PlayStation 4 游戏机。此外，IMDb TV 可作为亚马逊 Fire TV 上的应用程序使用，也可作为 Prime Video 应用程序内的免费频道在数百种设备上使用。亚马逊旗下的 IMDb 最初于 2019 年 1 月以 Freedive 的形式推出了免费服务，然后将其重新命名为 IMDb TV。该流媒体服务具有不断更新的电影和电视节目库，包括“芝加哥火灾”、“全家福”、“广告狂人”、“中间的马尔科姆”、“华尔街之狼”等热门影片。 “如何训练你的龙。”据公司称，IMDb TV 的广告数量是传统线性电视的一半。 IMDb TV 还播放来自亚马逊工作室的原创作品，包括即将于 8 月 6 日首播的纪录片系列“卢克·布莱恩：我的土路日记”和最近推出的抢劫剧“杠杆：救赎”。其他 IMDb 电视原创作品包括“Alex Rider”、“Moment of Truth”和“Top Class: The Life and Times of the Sierra Canyon Trailblazers”。上个月，Prime Video 和 IMDb TV 宣布与 Universal Filmed Entertainment Group 达成一项独家多年许可协议。根据该协议，IMDb TV 将获得环球电影的电视转播权，使其成为首个能够抢先观看大型电影制片厂电影的 AVOD 服务。", "note_en": "More than two and a half years after IMDb launched its free, ad-supported streaming service,   is now available on   and   mobile devices.\n The IMDb TV app launched Tuesday for Apple’s iOS (iPhone and iPad) and Android mobile devices in the U.S. The addition of the two major mobile platforms comes after the IMDb TV app launched this year on Roku, Xbox One, Xbox Series X|S, Android TV devices including Chromecast with Google TV, LG Smart TVs (2018-2021 models) and Sony PlayStation 4 consoles.\n In addition, IMDb TV is available as an app on Amazon’s Fire TV and as a free channel within the Prime Video app across hundreds of devices.\n Amazon-owned IMDb originally launched the free service as Freedive in January 2019, before redubbing it IMDb TV. The streaming service features a continually updating library of movies and TV shows, including popular titles like “Chicago Fire,” “All in the Family,” “Mad Men,” “Malcolm in the Middle,” “The Wolf of Wall Street” and “How to Train Your Dragon.” According to the company IMDb TV has half the ads of traditional linear TV.\n  IMDb TV also features originals from Amazon Studios, including the upcoming Aug. 6 premiere of docu-series “Luke Bryan: My Dirt Road Diary” and the recently launched heist drama “Leverage: Redemption.” Other IMDb TV originals include “Alex Rider,” “Moment of Truth” and “Top Class: The Life and Times of the Sierra Canyon Trailblazers.”\n Last month,  Prime Video and IMDb TV announced an exclusive, multiyear licensing deal with Universal Filmed Entertainment Group. Under the pact, IMDb TV will get TV-window rights to Universal movies, making it the first AVOD service to have that kind of early access to a major studio’s films.", "posttime": "2021-08-05 21:20:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,android,免费,ios,广告", "title": "亚马逊的免费、有广告支持的流媒体服务 IMDb TV 在推出两年多后登陆 iOS 和 Android", "title_en": "Amazon's free, ad-supported streaming service IMDb TV arrives on iOS and Android, more than two years after launching", "transed": 1, "url": "https://variety.com/2021/digital/news/imdb-tv-free-streaming-ios-android-1235034760/", "via": "", "real_tags": ["amazon", "android", "免费", "ios", "广告"]}, {"category": "", "categoryclass": "", "imagename": "2df82289a3b0ed9d74b7d2614c68eabb.jpg", "infoid": 1071409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三 Etsy 股价在盘后交易中下滑，此前该公司发布了第三季度业绩指引，暗示销售放缓。 Etsy 和其他数字零售商从大流行的电子商务冲击中受益匪浅，随着接种疫苗的消费者返回商店并在旅行和服务上花费更多，电子商务正在放缓。 Etsy 在周三收盘后公布了好于预期的第二季度业绩，但它为当前季度提供了指导，表明由大流行推动的电子商务繁荣可能正在停滞。本季度收入增长同比放缓至 23.4%。这与最近几个季度相比明显放缓，当时过去四个季度的销售额增长均超过 100%。结果凸显了人们的担忧，即随着接种疫苗的消费者减少在线支出，而更多地花在旅行和其他服务上，电子商务活动的大流行正在消退。上周，Etsy、eBay 和 Wayfair 的股价在亚马逊报告销售并给出低于预期的预测后均受到拖累。 Etsy 经营着一个以手工制品和个性化商品而闻名的在线市场，它一直是大流行的最大受益者之一，购物者转向该网站购买口罩和家居用品等物品。 Etsy 首席执行官乔什·西尔弗曼 (Josh Silverman) 在一份声明中表示：“从去年同期世界发生的巨大变化来看，Etsy 2021 年第二季度的表现非常出色。” “令我和我们整个团队深感欣慰的是，我们能够报告强劲的同比增长，GMS 和收入分别增长了约 13% 和 23%。事实上，不包括口罩，这是一个重要的驱动力去年同期，Etsy 市场的第二季度 GMS 增长了 31%。”\nEtsy 表示，本季度的收入预计将在 5 亿美元至 5.25 亿美元之间，这意味着中点的同比增长率为 13.5%。 StreetAccount 调查的分析师预计第三季度销售额为 5.275 亿美元。", "note_en": "Shares of Etsy slid in extended trading Wednesday after the company gave third-quarter guidance that suggested a sales slowdown.\n Etsy and other digital retailers have benefited greatly from the pandemic e-commerce bump, which is slowing as vaccinated consumers return to stores and spend more on travel and services.\n Etsy  reported better-than-expected second-quarter results after the bell Wednesday, but it gave guidance for the current quarter that suggests the pandemic-fueled e-commerce boom may be stalling.\n     Revenue growth slowed to 23.4% year over year during the quarter. That&#39;s a marked deceleration from recent quarters, when sales growth topped 100% for each of the past four quarters.\n  The results underscore concerns that the pandemic bump in e-commerce activity is fading as vaccinated consumers spend less online and more on travel and other services. Last week, shares of Etsy,  eBay and  Wayfair  were all dragged down after  Amazon reported sales and gave a forecast that  fell short of expectations.\n Etsy, which operates an online marketplace known for handmade and personalized goods, has been one of the biggest beneficiaries of the pandemic, with shoppers turning to the site for things such as face masks and home goods.\n &#34;Etsy&#39;s second quarter 2021 performance is quite remarkable when viewed in context of how dramatically the world changed during the year-ago period,&#34; Etsy CEO Josh Silverman said in a statement. &#34;It is deeply gratifying to me and our entire team that we are able to report strong year-over-year growth, with GMS and revenue up approximately 13% and 23% respectively. In fact, excluding facemasks, which were an important driver of the prior year period, second quarter GMS for the Etsy marketplace increased 31%.&#34;\n For the current quarter, Etsy said it expects revenue to come in between $500 million and $525 million, implying a growth rate of 13.5% year over year at the midpoint. Analysts surveyed by StreetAccount were looking for third-quarter sales of $527.5 million.", "posttime": "2021-08-05 21:20:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "同比,expected,etsy", "title": "Etsy 在报告好于预期的第二季度业绩后下跌 10% 以上，收入同比增长 23.4% 至 5.289 亿美元，但第三季度的指导表明大流行的销售增长已经结束", "title_en": "Etsy drops by 10%+ after reporting better-than-expected Q2 results, with revenue up 23.4% YoY to $528.9M, but Q3 guidance suggests pandemic sales boost is over", "transed": 1, "url": "https://www.cnbc.com/2021/08/04/etsy-earnings-q2-21-stock-plunges-on-weak-guidance.html", "via": "", "real_tags": ["同比", "expected", "etsy"]}, {"category": "", "categoryclass": "", "imagename": "973da4f878c987a4b832ef88574ff5d3.jpg", "infoid": 1071408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司高级工程项目经理 Ashley Gjøvik 在她发布了关于办公室性别歧视的推文后无限期行政休假。该公司目前正在调查 Gjøvik 就恶劣工作环境提出的指控。 Gjøvik 在接受 The Verge 采访时说：“几个月来，我一直对 Apple 员工关系表示担忧，因为他们多年来一直在性别歧视、敌对的工作环境、性骚扰、不安全的工作条件和报复方面的经历。” “我要求他们在调查时减轻敌对的工作环境，他们最初为我提供了 EAP 治疗和病假。我告诉他们这毫无意义，并说他们应该和我的领导谈谈并建立监督和界限。我补充说，如果没有其他选择，他们可以给我带薪行政假。他们显然没有努力设定界限，而是说他们让我休行政假，并暗示他们不希望我使用 Slack，因为我一直在那里表达我对公司某些政策的担忧。他们还暗示，他们不希望我与公司的其他女性就她们对 Apple 政策的担忧进行一对一的会面，而我一直在这样做。”今天下午，Gjøvik 设置了不在办公室的消息，通知同事员工关系团队已让她无限期带薪休假。因此，在向#Apple 提出关于#sexism、#hostileworkenvironment 和#unsafeworkconditions 的担忧之后，我现在正在根据#Apple 员工关系进行无限期带薪行政假，而他们正在调查我的担忧。这似乎包括我没有使用 Apple 的内部 Slack。 — Ashley M. Gjøvik (@ashleygjovik) 2021 年 8 月 4 日 这是 Apple 第二次调查 Gjøvik 关于公司性别歧视的说法。员工关系团队结束了早些时候的调查，据称发现没有任何问题，这促使 Gjøvik 在推特上发布了截图，她所说的只是她经历的一小部分： 想分享：#Apple 员工关系证实了这一点 #tonepolicing 完全没问题我从#bigtech #male 领导者而不是#sexist 那里得到的反馈。随着这项调查的进行，我决定开始在推特上发布他们认为“可以”的内容。我的意思是，他们确实说可以吗？ pic.twitter.com/EImLTjRTBl\n— Ashley M. Gjøvik (@ashleygjovik) 2021 年 8 月 3 日在今天的 #Apple 员工关系中表示其良好更新，这是我在 2018 年卡瓦诺听证会期间发送给我的 #bigtech 男性领导层的衷心电子邮件。我要求支持女性并谴责#sexism 和#sexualassault。回复：一条短信说“FWIW，RBG认为他没事。” pic.twitter.com/0GTthZNEgH — Ashley M. Gjøvik (@ashleygjovik) 2021 年 8 月 4 日这件事也发生在我身上：#Apple 也发生在我身上：在我谈到 #sexism、#discrimination 和敌意后，他们提供了 EAP 并建议请病假工作环境。在我提出对不安全的#workconditions 的担忧后，他们还建议要求#ADA #disability 住宿。 https://t.co/LW0Ueq1Leb — Ashley M. Gjøvik (@ashleygjovik) 2021 年 7 月 30 日 Apple 目前正在应对一波员工激进主义浪潮，其中包括多名女性在推特上表达对公司文化的不满。 5 月，员工写了一封信，要求对安东尼奥·加西亚·马丁内斯的聘用进行调查，安东尼奥·加西亚·马丁内斯写了一本关于硅谷的书，其中描述了许多人认为令人反感的女性。数小时后，加西亚·马丁内斯被解雇。", "note_en": "Apple has placed senior engineering program manager Ashley Gjøvik on indefinite administrative leave after she tweeted about sexism in the office. The company is currently investigating claims Gjøvik made about a hostile work environment.\n “For months, I have been raising concerns with Apple employee relations about years of experiences with sexism, a hostile work environment, sexual harassment, unsafe working conditions, and retaliation,” Gjøvik says in an interview with  The Verge. “I asked them to mitigate the hostile work environment while they investigate, and they initially offered me EAP therapy and medical leave. I told them that made no sense, and said they should talk to my leadership and set up oversight and boundaries. I added that if there was no other option they could give me paid administrative leave. They apparently made no effort to set boundaries and instead said they were placing me on administrative leave and implied they did not want me on Slack where I had been vocal about my concerns with certain policies at the company. They also implied they didn’t want me to meet one-on-one with other women at the company about their concerns with Apple policies, which I had been doing.”\n This afternoon, Gjøvik set an out of office message informing colleagues that the employee relations team had placed her on indefinite paid leave.\n So, following raising concerns to  #Apple about  #sexism,  #hostileworkenvironment, &amp;  #unsafeworkconditions, I&#39;m now on indefinite paid administrative leave per  #Apple employee relations, while they investigate my concerns. This seems to include me not using Apple&#39;s internal Slack.\n— Ashley M. Gjøvik (@ashleygjovik)  August 4, 2021\n This is the second time Apple has investigated Gjøvik’s claims about sex discrimination at the company. The employee relations team closed an earlier investigation, allegedly finding that nothing was wrong, prompting Gjøvik to tweet screenshots with what she says is just a small portion of what she experienced:\n Wanted to share:  #Apple employee relations confirmed this  #tonepolicing is totally ok feedback for me to get from my  #bigtech  #male leaders &amp; not  #sexist.   As this investigation rolls on, I&#39;ve decided to start Tweeting the stuff they say is &#34;ok.&#34; I mean, they did say it was ok?  pic.twitter.com/EImLTjRTBl\n— Ashley M. Gjøvik (@ashleygjovik)  August 3, 2021\n In today&#39;s  #Apple employee relations said its fine update, here&#39;s the heartfelt email I sent my  #bigtech male leadership in 2018 during the Kavanaugh hearings. I asked for support of women &amp; to condemn  #sexism &amp;  #sexualassault. The reply: a text saying &#34;FWIW, RBG thinks he&#39;s ok.&#34;  pic.twitter.com/0GTthZNEgH\n— Ashley M. Gjøvik (@ashleygjovik)  August 4, 2021\n This happened to me at  #Apple too: they offered EAP and suggested medical leave after I spoke up about  #sexism,  #discrimination, and a hostile work environment. They also suggested requesting  #ADA  #disability accommodations after I raised concerns about unsafe  #workconditions.  https://t.co/LW0Ueq1Leb\n— Ashley M. Gjøvik (@ashleygjovik)  July 30, 2021\n Apple is currently contending with  a wave of employee activism, including multiple women tweeting about their dissatisfaction with the company culture. In May, employees wrote a letter demanding an  investigation into the hiring of Antonio García Martínez, who’d written a book about Silicon Valley with descriptions of women many people found offensive. Hours later,  García Martínez was fired.", "posttime": "2021-08-05 21:20:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,苹果,apple,行政,sexism", "title": "苹果公司让女性工程项目经理在她发布关于办公室性别歧视的推文后休行政假", "title_en": "Apple places female engineering program manager on administrative leave after she tweeted about sexism in the office", "transed": 1, "url": "https://www.theverge.com/2021/8/4/22610112/apple-female-engineering-manager-leave-sexism-work-environment?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["发布", "苹果", "apple", "行政", "sexism"]}, {"category": "", "categoryclass": "", "imagename": "a5e166fbaa419c41fb6a7b349e2f9788.png", "infoid": 1071407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所谓的销售准备技术提供商 MindTickle Inc. 在获得 1 亿美元的 E 轮融资后，今天与独角兽公司合作。该轮融资由软银领投，Chimera Capital 和现有投资者 Norwest Venture Partners、Canaan、NewView Capital 和 Qualcomm Ventures 跟投。继去年 11 月由软银牵头的 1 亿美元融资之后，该公司的总融资额达到 2.81 亿美元，估值为 12 亿美元。 MindTickle 的使命是通过培训员工使其更擅长销售来帮助大型和小型企业改善其销售运营。通过其平台，公司可以培训和提升数百名销售人员的技能。该平台的关键方面之一是它使用角色扮演方法来帮助销售人员练习他们的销售宣传并获得处理客户查询的经验。销售人员可以通过 MindTickle 平台的收入指标来衡量他们的改进。此外，它还提供有关他们处理的呼叫的反馈。该公司表示，机器学习也是一个关键因素，有助于提供个人建议和补救措施。 MindTickle 首席执行官 Krishna Depura 在接受采访时告诉 SiliconANGLE，销售团队需要改进，因为销售突然变得更加困难。他得出了一些强调这一点的数据点，称销售代表的平均上岗时间从 6 个月增加到 9 个月，他们的平均配额完成率从 63% 下降到 43%，而团队的 75%成员表示，他们现有的培训和知识计划并不能提高绩效。 “从根本上说，当今大多数销售组织都存在准备危机，”德普拉说。他解释说，这种销售业绩的下降传统上归因于卖家必须应对的世界上迅速增加的复杂性和竞争。他说，COVID-19 大流行只会让事情变得更加困难。\n“首先，现场销售会议减少了。其次，随着越来越多的销售发生在远程，并且组织试图简化他们的流程，这导致内部和现场销售组织的转型，”德普拉说。 “总而言之，这些趋势暴露了当今大多数公司存在的传统销售支持计划的缺陷。” Mindtickle 的目标是创造 Depura 所说的“销售准备”，他将其定义为组织之间的持续卓越状态，以帮助他们增加收入并适应变化。他说，当今销售支持计划的使命必须是使用一套全面且个性化的策略与学习者互动。 “那些仍在努力通过 20 世纪销售支持计划应对 21 世纪准备情况的公司还没有‘准备好’，”德普拉说。 “他们的销售准备方法行不通，因为他们的传统支持计划是记忆练习，而不是技能培养策略。” MindTickle 声称，许多领先的财富 500 强和福布斯全球 2000 强公司已经看到了这一点，其中瞻博网络公司、惠普企业公司、默克公司和雪花公司等都被提及为客户它的网站。 MindTickle 的目标是在对下一代销售支持技术可能不断增长的需求中占据更大的份额。该公司表示，到 2027 年，该细分市场的销售额将增长至 42.3 亿美元，而对话智能市场预计到 2025 年将达到 130 亿美元。展望未来，Depura 表示，公司将投资其研发工作，专注于利用人工智能、机器学习和大数据智能为客户释放更大的价值。 “我们看到跨行业和跨地域对我们的技术的巨大需求，因此我们计划投资以提高我们的进入市场能力，以便能够满足这种增加的需求，”他说。加入我们的 Cube 俱乐部和 Cube 活动专家社区，表达您对我们使命的支持。加入社区，其中包括 Amazon Web Services，即将成为 Amazon.com 首席执行官 Andy Jassy、戴尔科技公司创始人兼首席执行官迈克尔戴尔、英特尔首席执行官 Pat Gelsinger 以及更多名人和专家。\n我们将于 6 月 16 日举行第二次云创业展示会。单击此处加入免费且开放的 Startup Showcase 活动。", "note_en": "So-called sales readiness technology provider  MindTickle Inc. is running with the unicorns today after landing a $100 million Series E round of funding.\n The round was led by SoftBank with participation from Chimera Capital and existing investors Norwest Venture Partners, Canaan, NewView Capital, and Qualcomm Ventures. It follows a previous $100 million raise led by SoftBank last November, and brings the company’s total amount raised to $281 million, with a valuation of $1.2 billion.\n MindTickle is on a mission to help large and small businesses improve their sales operations by training staff to be better at it. Through its platform, companies can train and upskill potentially hundreds of sales personnel. One of the key aspects of the platform is it  uses role playing methods to help sales staff practice their sales pitches and gain experience on handle customer queries.\n Salespeople can measure their improvement through the MindTickle platform via revenue metrics. Further, it provides feedback on the calls they have handled. Machine learning is a key ingredient too, helping to serve up personal recommendations and remediations, the company says.\n MindTickle Chief Executive Krishna Depura told SiliconANGLE in an interview that sales teams need to improve because sales has suddenly become much harder. He reeled off a number of data points that underline this, saying the average ramp time of sales reps has increased from 6 months to 9 months, that their average quota attainment has come down from 63% to 43%, and that 75% of team members say that their existing training and knowledge programs don’t enhance performance.\n “Fundamentally, there’s a crisis of readiness with most sales organizations of this day,” Depura said.\n He explained this decline in sales performance was traditionally attributed to the rapidly increasing complexity and competition in the world that sellers have to navigate. The COVID-19 pandemic has only made things harder, he said.\n “First, there are fewer on-site sales meetings. Second, as more selling happens remotely and organizations try to simplify their processes, it’s leading to a transformation of inside and field sales organizations,” Depura said. “Altogether, these trends have laid bare the deficiencies in traditional sales enablement programs that exist at most companies today.”\n Mindtickle’s goal is to create what Depura calls “sales readiness”, which he defines as a continuous state of excellence among organizations to help them grow revenue and adapt to change. He said the mission of sales enablement programs today must be to engage with learners using a comprehensive and individualized set of strategies.\n “Those companies that are still trying to tackle 21st-century readiness with 20th-century sales enablement programs are not “ready,” Depura said. “Their approach to sales readiness isn’t working because their traditional enablement programs are memorization exercises, not skill-building strategies.”\n MindTickle claims a number of leading Fortune 500 and Forbes Global 2000 firms have already seen this, with the likes of Juniper Networks Inc., Hewlett-Packard Enterprise Co., Merck &amp; Co., Inc. and Snowflake Inc. all mentioned as customers on its website.\n MindTickle is aiming for a bigger share of what will likely be growing demand for next-generation sales enablement technologies. Sales in that niche are set to grow to $4.23 billion by 2027, while the conversation intelligence market is forecast to hit $13 billion by 2025, the company said.\n Looking ahead, Depura said the company will invest in its research and development efforts, focused on leveraging artificial intelligence, machine learning and big data intelligence to unlock greater value for customers. “We are seeing massive demand for our technology from across sectors and geographies, so we plan to invest in ramping up our go-to market capabilities to be able to address this increased demand,” he said.\n  Show your support for our mission by joining our Cube Club and Cube Event Community of experts. Join the community that includes Amazon Web Services and soon to be Amazon.com CEO Andy Jassy, Dell Technologies founder and CEO Michael Dell, Intel CEO Pat Gelsinger and many more luminaries and experts.\n We are holding our second cloud startup showcase on June 16.  Click here to join the free and open Startup Showcase event.", "posttime": "2021-08-05 21:19:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,led,销售", "title": "印度初创公司 MindTickle 提供改善销售人员的工具，以 1.2B 美元的估值筹集了 1 亿美元的 E 系列，由软银领投，总融资额达到 2.81 亿美元", "title_en": "Indian startup MindTickle, which offers tools to improve sales staff, raises $100M Series E led by SoftBank at a $1.2B valuation, bringing total raised to $281M", "transed": 1, "url": "https://siliconangle.com/2021/08/03/mindtickle-bags-100m-funding-role-playing-driven-sales-readiness-platform/", "via": "", "real_tags": ["初创", "led", "销售"]}, {"category": "", "categoryclass": "", "imagename": "29b4d2cf0496067c582e107c347e5473.jpeg", "infoid": 1071406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步的顶线和底线超出预期，并在第二季度实现了意外的一次性盈利。优步报告该季度的净收入为 11 亿美元。这主要是由于滴滴未实现的收益为 14 亿美元，极光为 4.71 亿美元。滴滴的股价在上个月下跌了约 37%，然而，上周优步在该公司的股份减少了 20 亿美元。优步的运营亏损仍为 11.9 亿美元。其调整后 EBITDA 亏损为 5.09 亿美元，比上一季度减少 1.5 亿美元，但比去年增加 3.28 亿美元。 EBITDA 是指利息、税项、折旧和摊销前的收益。优步重申其预计将在今年年底前以调整后的 EBITDA 为基础实现盈利。首席财务官尼尔森柴在给投资者的一封信中表示：“随着我们朝着这一重要里程碑取得进展，除了创纪录的 22 至 240 亿美元的总预订额外，我们预计第三季度的调整后 EBITDA 亏损将减少至不到 1 亿美元。”到目前为止，优步的 Eats 部门已经支持该公司抵御许多 Covid 逆风。当人们停止旅行时，他们转向食品和货物运送。优步表示，即使在全球范围内放宽了Covid限制，其交付业务仍保持强劲。交付收入继续超过其核心乘车业务，达到 19.6 亿美元，而之前为 16.2 亿美元。在给股东的最新消息中，该公司表示，本季度其送货商户数量增长至超过 750,000 家。\n由于大流行，该公司一直在努力应对供需失衡，导致定价飙升和等待时间增加。首席执行官 Dara Khosrowshahi 在公司与投资者的电话会议上表示，价格和等待时间没有达到公司的目标。 Khosrowshahi 在一份声明中说：“在第二季度，我们通过投资司机来投资复苏，我们取得了很大进展，从 2 月到 7 月，美国每月活跃的司机和快递员增加了近 420,000 人。”该公司没有提供确切的司机人数，但 Khosrowshahi 表示，在公司为让人们回来进行大量投资后，他对增长率持乐观态度。从 6 月到 7 月，该公司在美国增加了 30% 的司机。 Khosrowshahi 说：“好消息是我们现在处于一个能够收回这些投资的好地方。” “投资很大，但投资是值得的。”优步在该平台上报告了 15.1 亿次出行，比第一季度增长 4%，比去年同期增长 105%。优步表示，其司机和快递员在本季度的总收入为 79 亿美元。优步最大的美国竞争对手 Lyft 本周也公布了财务业绩。该公司公布了第一个季度调整后 EBITDA 利润，达到 2380 万美元，比预期提前一个季度。它还在顶线和底线上击败了华尔街的指导。", "note_en": "Uber beat estimates on the top and bottom line and turned an unexpected one-time profit during the second quarter.\n     Uber reported a net income of $1.1 billion for the quarter. That was largely due to unrealized gains of $1.4 billion in  Didi and  $471 million in Aurora. Shares of Didi have dropped about 37% over the last month, however, shrinking  Uber&#39;s stake in the company by $2 billion last week. Uber&#39;s operating loss was still $1.19 billion.\n Its adjusted EBITDA loss was $509 million, down $150 million from the prior quarter but an improvement of $328 million from last year. EBITDA refers to earnings before interest, taxes, depreciation and amortization.\n Uber reaffirmed its expectation that it will reach profitability on an adjusted EBITDA basis by the end of this year.\n &#34;As we make progress towards that important milestone, we expect our Adjusted EBITDA loss in Q3 to improve to less than $100 million in addition to record Gross Bookings between $22 and $24 billion,&#34; CFO Nelson Chai said in a letter to investors.\n  So far, Uber&#39;s Eats segment has bolstered the company to withstand many of the Covid headwinds. When people stopped traveling, they turned to food and goods deliveries. Uber said its delivery business stayed strong even as Covid restrictions eased around the world.\n   Delivery revenue has continued to outperform its core ride-hailing business at $1.96 billion, compared with $1.62 billion. In an update to shareholders, the company said that its number of delivery merchants grew to more than 750,000 in the quarter.\n The company has struggled with supply and demand imbalances because of the pandemic, leading to surge pricing and increased wait times. CEO Dara Khosrowshahi said on the company&#39;s call with investors that prices and wait times aren&#39;t meeting company targets.\n &#34;In Q2 we invested in recovery by investing in drivers and we made strong progress, with monthly active drivers and couriers in the US increasing by nearly 420,000 from February to July,&#34; Khosrowshahi said in a statement.\n The company did not provide an exact number of drivers, but Khosrowshahi said he was optimistic about growth rates after the company made heavy investments in bringing people back. The company added 30% more drivers in the U.S. from June to July.\n &#34;The good news is we&#39;re now in a good place where we&#39;re able to pull those investments back,&#34; Khosrowshahi said. &#34;The investments were big, but the investments were worth it.&#34;\n Uber reported 1.51 billion trips on the platform, up 4% from the first quarter and 105% from the year-ago quarter. Uber said its drivers and couriers earned an aggregate $7.9 billion during the quarter.\n Uber&#39;s largest American competitor,  Lyft, also reported  financial results this week. The company reported its first quarterly adjusted EBITDA profit, posting $23.8 million, a quarter earlier than expected. It also beat Wall Street guidance on both the top and bottom lines.", "posttime": "2021-08-05 21:19:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "超出,ebitda", "title": "优步超出预期，创纪录的总预订量为 21.9B 美元，同比增长 114%，调整后 EBITDA 亏损为 5.09 亿美元，比 8.37 亿美元有所改善；库存下降约 5%", "title_en": "Uber beats estimates with record gross bookings of $21.9B, up 114% YoY, adjusted EBITDA loss of $509M, an improvement from $837M YoY; stock down ~5%", "transed": 1, "url": "https://www.cnbc.com/2021/08/04/uber-earnings-q2-2021.html", "via": "", "real_tags": ["超出", "ebitda"]}]