[{"category": "", "categoryclass": "", "imagename": "77a729e8f0c189fc29b3f597aa9e59c7.png", "infoid": 1031388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每当我与某人谈论Git和版本控制时，总会出现一个问题：\n这个问题没有一个答案。虽然我们已经将公司中的每个人都转移到了一个工程系统中，并在Visual Studio Team Services中托管的Git上实现了标准化，但我们还没有做到的是将每个人都转移到相同的分支和开发模型中。\n有些团队 - ，比如Windows - ，保留了一个分支策略，这与他们多年来一直使用的策略类似。这种方法是无可争辩的，他们有很多工具来支持它，而且开发人员对如何在分支机构之间移动有一定的机构知识。把这么大的一个团队搬到吉特是很有挑战性的， - 你只能同时煮这么多大洋。\n但是这导致了我们谈论使用Git的方式上的一些混乱：例如，Raymond Chen最近写了一系列有趣的博客文章，解释你不应该在Git中挑剔承诺。虽然这对他的团队的工作流来说是非常合理的建议，但它与我们用来构建Visual Studio Team Services本身的工作流以及VSTS团队的日常工作方式相违背。\n那么， - ，我们如何在VSTS团队中进行分支？首先，我们遵循基于主干的开发方法。但与一些基于干线的模型(如GitHub Flow)不同，我们不会持续地将Master部署到生产中。取而代之的是，我们通过为每个版本创建一个分支，在每个Sprint中发布我们的主分支。当我们需要将修补程序投入生产时，我们会从主版本中挑选那些更改到发布分支中。这是一种我们称之为“释放流”的策略。\n我们是VSTS团队中基于干线的开发的忠实粉丝。我们喜欢简单的分支结构，其中只有一个主分支，每个人都在其中工作。这比许多年前我们的旧分支结构要简单得多，当时我们的团队与Visual Studio IDE在同一个TFVC存储库中。我们曾经有过这种多层次的分支策略，即 - to be礼貌 - “Complex”。\n我与开发人员交谈的越多，我就越能观察到不进行基于主干的开发的团队往往会发生的事情。无论他们认为自己有多有组织，实际上，他们往往会以同样的方式组织自己的分支机构。这是康威定律的一个推论：\n我们也不例外：您基本上可以看到您的代码在组织结构图中流动。当您签入您的分支时，您的代码最终将被“向前集成”到离主干更近的下一个分支中，最终落地到主干中。一旦发生这种情况，您会希望将主干“反向集成”回所有功能分支，这样您就可以拥有其他所有人的代码。\n这是Merge地狱 - ，是的，这实际上就是我们所说的 - ，我们有一个人全职处理合并，解决冲突，并确保所有这些整合继续建立。不管我们付他多少钱，可能都不够。\n当您放弃功能分支，开始考虑基于主干的分支策略时，经常会出现的是GitHub流。(请注意，这是GitHub流，而不是Git流，Git流有两个“干线”，因此根本不是基于干线的。)。\n在GitHub工作期间，我对GitHub Flow非常熟悉。总体而言，我真的很喜欢这个系统；它是轻量级的，拥有良好的工具和自动化，您可以非常高效。这个系统在GitHub上运行得很好，但不幸的是，它不能扩展到VSTS团队的需求。这是因为GitHub流有一个经常被忽视的微妙之处。您实际上是在合并拉式请求之前将更改部署到生产中：\n一旦您的拉入请求被检查并且分支通过了您的测试，您就可以部署您的更改以在Production…中验证它们。既然您的更改已经在生产中得到验证，现在就可以将您的代码合并到主分支中了。- 了解GitHub流。\n这个系统非常聪明：当您准备好签入时，您会立即得到关于拉入请求在生产中的行为的反馈，该反馈会在您完成拉入请求之前发生。因此，如果您的代码更改有问题，您可以简单地放弃部署，并且您的坏代码永远不会合并到master中。这使您可以后退一步，查看监视数据以了解更改存在问题的原因，然后迭代拉取请求并重试。\n此开发策略的问题在于，它对大型团队的伸缩性极差，因为当您尝试将其部署到生产环境时会出现争用：\n在工作高峰期，多个开发人员经常试图将他们的更改部署到生产环境中。为了避免混淆并给每个人一个公平的机会，我们可以要求Hubot将我们添加到部署队列中。- 将分支机构部署到gihub.com。\n(如果您不熟悉Hubot，那么它是GitHub聊天基础设施的核心。GitHub使用Hubot从Slake内部执行其部署。)\n当您有几个开发人员时，您将需要一个部署队列来确保一次只能部署一个拉请求。这很好，但是随着您开始发展并雇佣更多的开发人员，排队的人也会更多。随着代码库的增长，构建开始需要更长的时间。随着您变得越来越受欢迎，您的基础设施也会随之增长，部署所需的时间也会随之增加。\nVisual Studio team Services有数百名开发人员在从事这项工作。平均而言，我们每天构建、审查和合并200多个拉入请求到我们的主分支。如果我们想在合并它们之前部署它们，那会大大降低我们的速度。\n我们试图取得平衡，既要快速编码，又要快速将更改带入Master，即使它们需要更长的时间才能投入生产。因此，我们不是将每个拉请求部署到生产中，而是每三周在每个Sprint - 结束时将MASTER部署到生产中。这意味着一项新功能可能需要这么长时间才能投入生产。(当然，该新特性可能只在测试中启用，而不是对所有用户启用，因为我们在生产中使用特性标志。)。\n在冲刺结束时，当我们准备发布时，我们从master创建一个新分支。这将是Sprint剩余部分的发布分支。当新特性的工作和开发在大师手中进行时，生产与该工作保持良好的隔离状态。同样，这使我们的开发速度保持快速；我们不必担心需要多长时间才能将这些更改部署到我们分布在多个Azure区域的由数百台服务器组成的云中。我们只需打开一个Pull请求，进行代码审查，然后将其合并到Master中。\n我们根据它们所对应的SPRINT来命名这些分支。在Sprint 129的末尾，我们从master创建一个名为Release/M129的分支并部署它。一旦我们在Sprint 130中完成了开发，我们就可以将这些更改部署到生产环境中了；在这一点上，我们忘记了旧的Release/M129分支。相反，我们从MASTER创建一个名为Release/M130的新分支并部署它。一旦Release/M130部署完成 - ，这将需要一段时间，因为我们使用环形部署策略 - ，所以我们不再关心旧的Release/M129分支。一旦所有服务器都运行Release/M130，并且生产中没有M129，该分支就只有历史意义了。我们甚至可以删除它。\n当然，我们不希望生产存在于真空中。如果存在高优先级的bug或可用性问题，我们需要能够快速修复问题并立即部署。这就是挑樱桃的用武之地。\n当我们需要对生产进行更改时，我们首先针对主分支进行更改。我们让它像通常的 - 一样进行代码审查，尽管优先级比普通的 - 高一点，并将其合并到MASTER中。然后，我们将该拉请求挑选到当前生产版本分支中，并开始部署它。\n我们发现此工作流非常有用，您可以直接从VSTS挑选拉取请求：\n这实际上挑选了整个Pull请求，将组成PR的每个提交从一个分支带到另一个分支。\n我们总是以这种方式进行生产更改，从MASTER开始；这是因为代码进入生产的方式与最终进入生产的代码一样重要。如果我们直接热修复生产，我们可能会意外地忘记为下一个版本将更改带回MASTER。但是通过先把变化带入师父，我们确保我们的生产永远不会倒退。\n这一点非常重要，我们询问您是否已在我们发布分支的拉式请求模板中这样做：\n当然，唯一的例外是，将更改引入Master是没有意义的。也许已经进行了一些重构，这意味着MASTER中不再存在此错误。这是拉取请求可以直接进入发布分支的唯一一次，而不需要先通过MASTER。\n尽管这个“大师优先”的政策需要额外的几分钟，但它总是值得的。当您感到解决生产事件的时间压力时，当您可能想偷工减料时，情况尤其如此。它确保我们只修复这些错误一次，并且不会因为相同的问题而出现重复的可用性事件。\n我希望这能为我们在VSTS团队中使用的分支策略提供一些背景信息，以及为什么它对我们有效。当然，对于您的分支策略，您需要选择一种适合您的团队和您正在构建的产品的方法。随着这些变化，您应该愿意重新评估：当我们从构建每隔几年发货一次的内部部署产品过渡到始终部署云服务时，我们必须改变分支战略以适应需求。我们需要一个能够应对我们今天面临的挑战的结构，而不是过去的战斗。你也是。\n如果您有任何问题，请随时发表评论--或者如果您要来参加5月7日的Build 2018大会，那么我很乐意亲自与您交谈。你可以顺道去一下世博会楼层的版本控制区，我会在那里闲逛。", "note_en": "Whenever I talk to somebody about Git and version control, one question  always comes up:\n  And there’s no  one answer to this question. Although we’ve been moving everybody in the company into one engineering system, standardizing on  Git hosted in  Visual Studio Team Services, what we haven’t done is move everybody into the same branching and development model.\n Some teams — like Windows — have kept a branching strategy that is similar to the one that they’ve been using for many years. It’s hard to argue with this approach, they’ve got a lot of tooling to support it, and the developers have institutional knowledge about how things move between branches. Moving a team that big to Git was  challenging enough — you can only boil so many oceans at the same time.\n But this has led to some confusion in the way we talk about using Git: for example, Raymond Chen recently  wrote an interesting series of blog posts explaining how you shouldn’t cherry-pick commits in Git. And while this is perfectly reasonable advice for  his team’s workflows, it goes against the workflows that we use to build Visual Studio Team Services itself, and how the VSTS team works on a daily basis.\n So, then — how do  we do branching on the VSTS Team? First, we follow a trunk-based development approach. But unlike some trunk-based models, like GitHub Flow, we do not continuously deploy master to production. Instead, we release our master branch every sprint by creating a branch for each release. When we need to bring hotfixes into production, we cherry-pick those changes from master into the release branch. It’s a strategy that we call “ Release Flow“.\n   We’re big fans of  trunk-based development on the VSTS team. We like a simple branching structure where there’s a single master branch that everybody works in. This is much simpler than our old branching structure back in the dark days, many years ago, when our team was in the same TFVC repository as the Visual Studio IDE. We used to have this multi-level branching strategy that was — to be polite — ”complex”.\n  The more I talk to developers, the more I’ve observed something that tends to happen to teams that  don’t do trunk-based development. No matter how organized they  think they are, in fact, they tend to structure their branches in the same way. It’s a bit of a corollary to  Conway’s Law:\n  We were no exception: you could basically watch your code flowing through the org chart. When you checked in to your branch, your code would eventually be “forward integrated” into the next branch closer to trunk, eventually landing in trunk. Once that would happen, you’d want to “reverse integrate” trunk back up to all the feature branches so that you’d have everybody else’s code.\n This is merge hell — yes, that’s actually what we called it — and we had a person employed full-time to deal with merging, conflict resolution and making sure all this integration continued to build. Whatever we paid him, it probably wasn’t enough.\n  When you back away from feature branches and start thinking about trunk-based branching strategies, the one that often comes up is GitHub Flow. (Note, that’s  GitHub Flow, not  Git Flow, which has two “trunks” and is therefore is not really trunk-based at all.)\n I’m very familiar with GitHub Flow from my time working at GitHub. Overall, I really like this system; it’s lightweight and with good tooling and automation, you can be very productive. This system works pretty well for GitHub, but unfortunately, it doesn’t scale to the VSTS team’s needs. That’s because there’s a subtlety to GitHub Flow that often goes overlooked. You actually deploy your changes to production  before merging the pull request:\n Once your pull request has been reviewed and the branch passes your tests, you can deploy your changes to verify them in production… Now that your changes have been verified in production, it is time to merge your code into the master branch. —  Understanding GitHub Flow\n This system is extremely clever: when you’re ready to check-in, you get immediate feedback on how a pull request will behave in production, and that feedback happens  before you complete the pull request. So if there’s a problem with your code changes, you can simply abandon the deployment, and your bad code never got merged into master. This lets you take a step back and look at the monitoring data to understand why your changes were problematic, then iterate on the pull request and try again.\n The problem with this development strategy is that it scales  extremely poorly to larger teams, because there’s contention when you’re trying to deploy to production:\n During peak work hours, multiple developers are often trying to deploy their changes to production. To avoid confusion and give everyone a fair chance, we can ask Hubot to add us to the deployment queue. —  Deploying Branches to GitHub.com\n (If you’re not familiar with  Hubot, it’s the core of GitHub’s chatops infrastructure. GitHub uses Hubot to perform their deployments from within Slack.)\n When you have a few developers, you’re going to need a deployment queue to ensure that only one pull request can be deployed at once. This is great, but as you start to grow and hire more developers, there are more people in the queue. As your codebase grows, builds start to take longer. And as you get more popular, your infrastructure grows and with it, the time it takes to deploy.\n Visual Studio Team Services has hundreds of developers working on it. On average, we build, review and merge over 200 pull requests a day into our master branch. If we wanted to deploy each of those before we merged them it, it would  decimate our velocity.\n We try to strike a balance where we want to code fast and get changes into master quickly, even if it takes them a little while longer to get into production. So instead of deploying every pull request to production, we deploy master to production at the end of each sprint —  every three weeks. This means that a new feature could take that long to get into production. (And, of course, that new feature might only be enabled in testing, and not for all users, since we use  feature flags in production.)\n  At the end of a sprint, when we’re ready to do a release, we create a new branch from master. This will be  the release branch for the remainder of the sprint. While new feature work and development goes on in master, production stays nicely isolated from that work. Again, this keeps our development velocity moving quickly; we don’t have to worry about how long it takes to deploy these changes to our cloud of hundreds of servers spread across multiple Azure regions. We just open a pull request, get a code review and merge it into master.\n  We name these branches after the sprint that they correspond with. At the end of sprint 129, we create a branch named  releases/M129 from master and deploy that. Once we finish development in sprint 130, we’re ready to deploy those changes to production; at that point, we forget about the old  releases/M129 branch. Instead, we create a new branch named  releases/M130 from master and deploy it. Once the  releases/M130 deployment finishes — which would take a while, since we use a  ringed deployment strategy — we don’t care about the old  releases/M129 branch anymore. Once all the servers are running  releases/M130 and there’s nothing with M129 in production, that branch is only of historical interest. We could even delete it.\n   Of course, we don’t want production to exist in a vacuum. If there’s a high-priority bug or an availability issue, we need to be able to fix the problem quickly and deploy it immediately. That’s where cherry-picking comes in.\n When we need to bring a change to production, we first make the change against the master branch. We get it code reviewed as usual — though at a bit higher priority than normal — and merge it into master. Then we cherry-pick that pull request into the current production release branch and start deploying it.\n  We find this workflow so useful that you can cherry-pick a pull request right from VSTS:\n  This actually cherry-picks the whole pull request, bringing each commit that made up the PR from one branch to another.\n We  always make production changes this way, starting in master; that’s because  how the code gets into production is as important as the code that ultimately gets there. If we were to hotfix production directly, we might accidentally forget to bring a change back to master for the next release. But by bringing changes into master first, we ensure that we never have regressions in production.\n This is so important that we ask if you’ve done it in the pull request template for our release branches:\n  The only exception, of course, is when the change doesn’t make sense to bring into master. Perhaps there’s been some refactoring that means that this bug doesn’t exist in master anymore. That’s the only time pull requests can go directly into a release branch without going through master first.\n Even though this “master first” policy takes a few extra minutes, it’s always worth it. That’s especially true when you feel the time pressure to resolve a production incident, when you might be tempted to cut corners. It ensures that we only fix these bugs once and that we won’t have a repeat availability incident due to the same problem.\n I hope that this gives some context behind the branching strategy we use on the VSTS team and why it works for us. Of course, for  your branching strategy, you need to pick an approach that works for your team you have and the product that you’re building. And you should be willing to re-evaluate as those things change: as we transitioned from building an on-premises product shipping every few years to a cloud service deploying all the time, we had to change our branching strategy to fit. We needed a structure that would meet the challenges that we face today instead of fighting battles of the past. You do, too.\n If you have any questions, please feel free to leave a comment — or if you’re coming to the  Build 2018 conference on May 7th, then I’d love to chat in person. You can drop by the version control area on the expo floor, where I’ll be hanging out.", "posttime": "2020-10-27 10:26:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,流程,flow,分支", "title": "发布流程：我们如何在VSTS团队中进行分支(2018)", "title_en": "Release Flow: How We Do Branching on the VSTS Team (2018)", "transed": 1, "url": "https://blogs.msdn.microsoft.com/devops/2018/04/19/release-flow-how-we-do-branching-on-the-vsts-team", "via": "", "real_tags": ["发布", "流程", "flow", "分支"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031387, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与人类不同的是，关于“如果人们想要长生不老，应该长生不老吗？”这个问题的争论。似乎永远不会死。\n这是令人惊讶的，因为答案显然是“是的”。事实上，“不”的论点是如此平淡无奇，我将它们归类到附录中。\n但是，如果你和我一样，对不可避免的下一个问题感到好奇：“我应该研究人类的长寿吗？如果应该，如何研究？”\n这归根结底是个个人问题，下面的问题不能回答你(或者坦率地说，对我来说)。但回答这个问题也需要了解大量的战略和经济考虑。我找不到一个全面的指南，所以这里就从一个开始。\n“我们现在对生物学有了理解，可以致力于直接解决衰老根源的疗法。”\n这是真的吗？如果是这样的话，最好的办法是什么呢？(至少)有三大考虑因素。\n以下是专家们认为是什么导致哺乳动物衰老，以及他们是如何解决这些问题的。\n1956年提出的衰老自由基理论。20世纪90年代的有力证据表明，DNA损伤会导致衰老。DNA修复是否能延长寿命仍未得到证实。\n干细胞在1963年被发现。干细胞耗竭和衰老之间的因果关系在2012年首次得到证实。\n海弗里克在1965年描述了复制性衰老。癌基因诱导的衰老描述始于20世纪80年代。据描述，压力诱导的衰老始于20世纪90年代。肿瘤抑制因子缺失诱导衰老的描述始于21世纪头10年。2011年具有治疗潜力的有力证据。\n线粒体自由基理论于1972年提出，现在还不太清楚它是否正确。2005年提出的非活性氧损伤假说，证据仍在不断积累。\n20世纪80年代端粒结构的发现和与复制衰老关系的推测。1991年提出的衰老端粒丢失假说。1998年的实验证据证实了两者之间的联系。\n到1983年，证据开始积累起来。2008年小鼠伴侣系统因果作用的演示。2013年小鼠自噬因果作用的演示。\n1997年提出的异染色质老化损失模型。在2010年代，所有水平的染色质结构破坏的证据越来越多。\n如果你不熟悉，NINTIL的长寿常见问题解答是一个很好的起点，可以帮助你理解这些提出的大多数原因背后的生物学原理。\n让我们首先承认，像上表那样将衰老分解成不连续的原因是值得怀疑的。这张图更详细地展示了我们目前对衰老相关过程的理解。根据这张图(说真的，点击链接，这是值得的)，理解衰老的因果关系可能不是发现新的原因，而是更多地解开我们已经半了解的东西，如果这是可能的话。\n然而，从外部来看，上面的表格并不能真正表明我们已经发现了衰老的根本原因。模式-如果小N历史可以有模式的话-似乎是每十年就有几个生物过程与衰老有关，然后如果有的话，十多年后，因果关系就会建立起来。表格只包括已经进入大型综合评论的衰老原因，所以我们不会期望也不会看到任何最初发现日期超过2000年的生物过程，这些过程可能有一天会进入这个表格，包括微生物群变化和RNAi失调。\n从内部来看，你可能会用增加对老龄化研究的投资来解释这一点。如果投资增加了，但发现的速度没有改变，那可能意味着我们几乎完成了发现。本着同样的精神，你可以将生物技术工具的改进与看似恒定的发现速度进行对比。\n不过，尽管我们对衰老的了解显然比以往任何时候都多，但我还是不敢相信任何因果理解的说法。\n制造一种新疗法(一种药物或医疗的统称)的标准策略被称为基于目标的方法，如下所示：\n确定导致您想要治疗的疾病的特定生物过程(例如，斑块堆积、单个基因的表达、病毒功能的关键蛋白质)。\n找到一种在体外或动物模型中干扰它的方法(例如，合成分子、工程抗体、外科干预)。\n当我们很好地处理一种疾病的原因或少数原因时，基于目标的方法效果最好。细菌感染和单基因疾病就是很好的例子。但正如上面讨论的那样，衰老似乎是多种原因造成的，更不用说我们可能还没有发现所有的颗粒性原因。\n建立一个实验，你可以廉价地尝试无数的治疗方法，并找到一种影响你所关心的表型(例如，活着的表型)的疗法。\n事实上，所有的治疗发展都是在靶向和表型之间进行的，对因果关系的理解是限制表型筛选的治疗空间的必要条件，许多表型的原因都是通过筛查的方法发现的，但今天的治疗发展普遍倾向于靶向。\n尽管事实上更多一流的小分子药物是用表型方法开发的，而且尽管许多有效的长寿疗法(在老鼠身上)在被发现时没有机械性假设，包括我们仍然不了解的异生(和潜在的中性血液交换)，以及热量限制。\n表型方法似乎也更适合于寻找有效的治疗组合，因为生物系统是如此相互关联，以至于要找到有效的组合疗法，我们只需要尝试很多组合。这对长寿很重要，因为还不清楚我们解决了任何单一的衰老原因得到了多少部分信任。可能每个治愈的方法都能为我们赢得更多的寿命，最终我们会达到长寿的逃逸速度。但既然死亡只需要一个死因，在看到益处之前，我们可能需要同时解决所有或大多数导致衰老的原因的疗法-即使是我们还不知道的原因。表型方法可能更适合于针对衰老等多原因生物现象的想法并不新鲜。致力于研究这些现象的公司(不是专门研究长寿的)包括Recursion，Janssen和Insitro。\n当然，表型筛选有很多挑战。一个是巨大的因素：你需要尝试许多不同的治疗方法，而可能的治疗空间是天文数字。另一个是，没有表型你就不能进行表型筛选，等待动物死亡是相当低效的。开发可测量的衰老表型，比如表观遗传时钟，对于实现更好的表型筛选至关重要。Gordian、Nemalife、Magitment、InVivo、Vium和Spring都在致力于解决这些问题的公司之列。\n人类可以在任意幻想的技术的限制下永生，这似乎是毋庸置疑的，尽管有些人不同意这一点。但死亡是否不仅最终可以战胜，而且是否可以用短期的工具和理解来征服，还不清楚。套用林肯的话说：我们不知道我们是否已经磨得足够锋利，可以砍下死亡之树。\n这是长寿战略的一个关键问题。我们越有信心现有的治疗技术可以延缓衰老，我们就越应该投资于使用它们。我们越不自信，我们就越需要制造新的工具。\n一个相关的数据点是什么模态(也称为。目前致力于长寿的公司正在使用)。据我们所知，大约51%的小分子药物，16%的生物制剂，18%的细胞疗法和15%的基因疗法。这比行业平均水平更倾向于非小分子疗法，这是我们可以预期的，因为上面表格中的大多数导致衰老的原因没有明显的小分子抑制作用。这也是一个边缘迹象，表明需要新的工具，因为非小分子疗法比小分子药物更新，开发起来也不那么直接(就像那些从一开始就直接开发一样)。\n另一个数据点是我们到目前为止在小鼠身上所取得的成就。这是一个表格，主要来源于劳拉·戴明的表格，显示了通过不同的治疗方法在小鼠身上实现的最大的中位寿命延长。\n请注意，中位寿命并不是最长寿命，而且通常只有一种性别的老鼠的寿命会增加。\n老鼠身上最大的两种方式，自发突变和GGT，不能(合法地)用于人类。我认为出于实际原因，饮食不在考虑之列；我们谈论的是极端饮食。其余的方式在人类身上以某种形式使用。我没有讨论手术，因为它是一个太宽泛的类别，但与人类相关的给出了&lt；还要注意的是，仅仅因为实验室选择用一种方式治疗老鼠，并不意味着另一种方式就不能达到同样的效果。开发小分子药物来靶向由GGT在小鼠身上发现的基因编码的蛋白质是标准做法。\n你可以将这张表格解读为人类顺从的方式没有它们应有的效力，或者你可以把它解读为学者们认为在实验室里最容易做的事情的选择效应。前者是一个很大的论断，我需要更多的证据才能相信。后者对任何人来说都不是什么新闻。合成候选药物分子的速度很慢。免疫疗法的生产既慢又难。基因疗法还有很长的路要走。\n总而言之，似乎很明显，我们的医疗设备无论是在效力上还是在易用性上都是缺乏的。\n将一种治疗药物推向市场是非常缓慢和昂贵的，大约需要10年和10亿美元，其中一个很大的原因是非癌症药物一旦进入临床试验就有20%的成功率，更不用说一开始进入临床试验的成功率肯定不到100%。\n这是这篇论文中的一个数字，分析了传统的靶向药物发现活动的成本、时间表和成功率。\n论文说明：数字以百万美元为单位，基于礼来公司的数据。p(TS)是从一个阶段成功过渡到下一个阶段的概率。WIP是在制品，即正在研究的候选药物的数量。浅阴影框显示基于假设投入的计算值。成本不包括探索性发现研究的投资、上市后的费用(如市场营销)或非研发管理费用(如非科学家的工资)。\n图中值得注意的是，大部分费用都在临床试验中(蓝色部分)，成功率最低的步骤是第二阶段临床试验(通常是第一次在人体上测试该疗法的疗效)。\n这对长寿意味着什么？除非尝试监管套利或医疗旅游，否则任何长寿疗法都必须通过这个过程，才能达到你或我的效果。3因此，追求长寿的最好方式很可能是改进药物开发过程，这取决于各种改进有多容易处理和被忽视。\n诊断药物开发过程中的问题很像研究衰老：你看到的一切都是坏的，但我们不知道根本原因或最好的干预方式。\n疾病的动物模型充满了困难。那些关于衰老的动物模型尤其具有挑战性。挑战有多大？挑战如此之大，以至于生物学上已知的最长寿的小鼠品系曾被用作快速衰老的模型，因为小鼠被错误地处理，而且死得很早。\n过去20年来，实验室运作的一个巨大变化是生物技术的“虚拟化”，这是外包的一个花哨的词。曾经在内部完成的工作，如合成分子或进行毒性测试，现在通常由合同研究机构(CRO)完成。外包具有生物技术在其他领域的所有优势：专业化程度提高，价格更低，等等。但外包充其量也是效率低下的，而且通常涉及很多棘手的问题。当所有人都在同一栋楼里时，药物开发仍然容易得多。我问过的每一位前制药科学家都是这么说的，但在其他行业情况并非如此。\n这些问题的解决方案可以以自动化的形式出现-Emerald Cloud Lab和Transcriptic是致力于此的两家公司-或者更好的外包服务。这个领域有一件事可能很不错，那就是电子实验室笔记本；不过，还是要谢谢你。\n长寿研究和整个医学在整合知识和从失败中吸取教训方面做得不好。即使在完成几年后，25%到50%的临床试验结果仍然没有发表。这并不令人惊讶：当你没有任何收获，甚至未来改变资产用途的机会微乎其微的时候，为什么还要公布你的临床数据呢？但这意味着将长寿努力从研究转移到商业治疗开发的潜在不利之处是，该领域整体上学到的东西会更少。\n一个相关的问题是，因为流动性事件可能会在令人信服的临床数据之前很久发生，生物技术公司会受到激励，把他们的高风险研究推迟到尽可能晚的时候(理想情况下是在员工拿到钱之后)，并美化它们，让它们看起来比实际情况更好。一种快速失败、诚实发表的心态当然会对整体寿命更有利。\n话又说回来，并不是说学术研究就一定更好。医学研究结果通常在50%的情况下显然是不可复制的。另外，私营生物技术有时可以做学术界做不到的事情。\n在战胜死亡之前，长寿疗法必须先征服美国FDA的临床试验过程，FDA并不认为衰老是一种医学适应症(又名。这意味着长寿公司必须选择现有的与年龄相关的适应症(例如阿尔茨海默氏症)来证明他们的治疗效果。如何做好这一点是任何长寿生物技术的关键考虑因素。\n更为乐观的是，监管改革，如双轨临床试验或完全取消3期试验，可能会导致长寿治疗开发的大幅加速。外包或分散临床试验也是一个令人兴奋的选择。科学37是一家致力于此的公司。\n药物开发的高成本和失败率使它成为创业破坏的艰难空间。(这里的第一章是说明性的。)。\n这在一定程度上是因为高风险使行为改变变得困难。改变剧本的任何部分都有天然的抵抗力。正如一位药物化学家对我说的那样，“如果你把一项服务提高两倍，没有人会在意。如果你把它提高10倍，或者告诉他们尝试一种新的方法，他们就不会相信你。”用他们现有的工艺提高4倍或5倍是最好的。“不完全是颠覆性创新的文化。遗传测序已经设法跨越了这一差距；我想更好地了解这需要多大程度的价格下降和可靠性。\n这也是因为生物技术的回报需要很长时间才能到来，在所有研究完成之后。这意味着药物开发的平台和服务不是生物技术公司用股权交换的，而是他们希望生产的未来药物的股权。这反过来又使得与其他行业相比，开始为生物技术公司提供平台和服务的公司更加复杂和昂贵。\n似乎以上所有这些还不够好，尽管技术有了很大进步，但制造一种药物所需的时间和成本都在随着时间的推移而增加。它甚至有一个可爱的名字：eRoom定律。没有人知道为什么会发生这种情况，但如果Eroom定律的原因是外生的，我们应该在相对便宜的时候尽早推出更多的长寿疗法。\n那么，改进药物发现系统和用现有系统追求长寿，哪个更有边际效益呢？显然我不知道，但问题是不明显是后者，我们也应该认识到有多少重要的问题需要在实验室之外用非生物技能来解决。\n追求长寿不是在真空中发生的，“我们是否应该追求人类长寿”的完整答案需要考虑到所有的外在因素。\n一个很大的外部性是长寿作为生物技术的一个品牌/模因的期望价值。有些人可能会说，社会已经在用它开发的每一种新药来研究长寿。如果我们继续治愈那些杀死我们的东西，最终我们就不会死亡，对吗？谁需要新的品牌呢？嗯，很多长寿投资不是来自传统的生物技术/制药投资者，而是来自硅谷。这可能要归因于期望价值。即使渴望长寿的呼唤只会鼓励有才华的人从事生物技术工作，那可能也是非常值得的。\n另一种可能性是，延缓死亡的承诺可能会刺激药物发现的资金增加或监管改革。这大概就是像Rerenate、Clevity和GenFlow这样的努力背后的想法，这些努力旨在实现像家养宠物这样具有魅力的物种的长寿。如果每个人的狗都突然活到30岁，人们可能会开始嫉妒。\n另一方面，如果一个领域承诺过多而没有兑现，它可以度过一个冬天。这对人工智能领域来说不是什么好事，如果长寿可以避免这一点就好了。还有品牌风险。1999年一名青少年的死亡导致基因治疗被推迟了很长时间。如果长寿疗法能提高品牌认知度-我在看着你，感光者-而且有重大的不良事件，最好保持低调。\n话又说回来，同样的对死亡的恐惧使长寿倾向于伪科学，可能会起到抵消冬天的作用。人们并不真正关心人工智能研究。他们确实在乎活下去。\n我们为什么要关心长寿呢？因为死亡是件坏事。4它有四个问题：\n但长寿并不是解决这些问题的唯一办法。这些问题并不是我们可能关心的世界上造成痛苦的唯一原因。这意味着我们要进行两个机会成本计算。\n人类用镇痛剂在问题1和问题2上取得了巨大的进步。镇痛剂在技术历史上受到冷落，但它们是有史以来战胜死亡的最大胜利之一，更不用说分娩了。它们还有很大的改进空间，尽管如果止痛剂的发展历史有任何指示的话，这种改进可能很难实现。再一次，很难想象它会比长寿治疗开发更难。\n当然，在问题1和问题2中，身体痛苦并不是唯一的一种痛苦。衰老和死亡，以及亲眼目睹它们，都会带来巨大的生存痛苦和痛苦。(因为这一事实，引用可能没有必要。)如果心理学家是可信的，我们也可能接近治疗这些痛苦的方法：到目前为止，临床结果是有希望的。但很难想象迷幻药让我们对死亡完全不感兴趣。要做到这一点，很可能需要在止痛、改变情绪的药物以及对药物和死亡的文化态度方面做出重大改变。\n一些读者可能会觉得控制痛苦或情绪是不真实的反抗死亡的方式，我会温和地提醒这样的读者，我们是在比较这些策略和让人类长生不老，所以你可能想在门口检查一下你的自然主义谬论。\n问题3和4遇到了毛骨悚然的哲学问题。\n.", "note_en": "Unlike human beings, the debate over the question “should people live forever, if they want?” never seems to die.\n This is surprising given that the answer is obviously “yes.”In fact the arguments for “no” are so unimpressive I’m relegating them to an  Appendix.\n But what if you, like me, are curious about the inevitable next question:  “should I work on human longevity, and if so, how?&#34;  1\n This is ultimately a personal question, and what follows won’t answer it for you (or for me, frankly).But answering it also requires understanding a shedload of strategic and economic considerations.I couldn’t find a comprehensive guide to them, so here’s a start at one.\n     “We now have the understanding of biology to work on therapies that directly address the root causes of aging.”\n Is this true? And if so what’s the best way to go about it? There are (at least) three big considerations.\n   Here’s a summary of what experts think causes aging in mammals and how they figured them out.\n Free radical theory of aging proposed in 1956. Strong evidence in 1990s that DNA damage leads to aging. Still not confirmed that DNA repair leads to longevity.\n  Stem cells discovered 1963. Causal connection between stem cell exhaustion and aging first demonstrated in 2012.\n  Replicative senescence described by Hayflick in 1965. Oncogene-induced senescence described starting in 1980s. Stress-induced senescence described starting in 1990s. Tumor suppressor loss-induced senescence described starting in 2000s. Strong evidence of therapeutic potential in 2011.\n  Mitochondrial free radical theory proposed in 1972, now much less clear that it&#39;s correct. Non-ROS damage hypothesis made in 2005, evidence still accumulating.\n    Discovery of telomere structure and speculation about connections to replicative senescence in 1980s. Telomere loss hypothesis for aging proposed in 1991. Experimental evidence confirming connection in 1998.\n  Evidence starting to accumulate by 1983. Demonstration of causal role of chaperone system in mice in 2008. Demonstration of causal role for autophagy in mice in 2013.\n      Heterochromatin loss model of aging proposed in 1997. Evidence accumulates for chromatin structure disruption at all levels in 2010s.\n  Nintil’s  Longevity FAQ is a great starting point to understand the biology behind most of these proposed causes if you’re unfamiliar.\n Let’s first admit that it’s dubious to break down aging into discrete causes like in the table above. Here’s a diagram giving a much more detailed view of our current understanding of aging-related processes.Based that diagram (seriously, click the link, it’s worth it), understanding the causality of aging may be less about discovering new causes and more about disentangling what we already semi-understand, if  that’s even possible.\n Nevertheless, from the outside view the above table doesn’t really suggest that we’ve finished discovering fundamental causes of aging.The pattern — if small-N history can have patterns — seems to be that every decade a couple biological processes are associated with aging and then 1+ decades later, if ever, a causal connection is established.The table only includes causes of aging that have made their way into big general reviews, so we wouldn’t expect to, and don’t, see any with initial discovery dates past 2000.Biological processes whose heydays came after 2000 that might someday make it into this table include  microbiome changes and  RNAi dysregulation.\n From the inside view you might contradict this by accounting for increasing  investment into aging research.If investment has increased but the rate of discoveries hasn’t changed, that might mean we’re nearly done discovering things.In the same spirit you could contrast the improvement in biotech tools to the seemingly-constant rate of discoveries.\n Still, while we clearly know more about aging than we ever have, I’m hesitant to believe any claims of causal understanding.\n  The  standard playbook for making a new therapeutic (the catch-all name for a drug or medical treatment) is called a  target-based approach, and goes like this:\n Identify a specific biological process that’s causing the disease you want to treat (e.g. plaque buildup, the expression of a single gene, a protein key to a virus’s function)\n Find a way to interfere with it (e.g. a synthetic molecule, an engineered antibody, a surgical intervention)  in vitro or in an animal model\n  Target-based approaches work best when we have a good handle on the cause, or small number of causes, of a disease.Bacterial infections and  single-gene disorders are good examples.But as discussed above aging seems to be massively multi-causal, not to mention that we probably haven’t found all the granular causes.\n  Set up an experiment where you can cheaply try a gajillion treatments and find one that affects the phenotype you care about (e.g. the phenotype of not being dead)\n In reality all therapeutic development takes place on a spectrum between target-based and phenotypic.Some understanding of causality is necessary for restricting the space of treatments screened in phenotypic approaches.And many causes of phenotypes are discovered via screening approaches.But therapeutic development today generally  leans toward target-based.\n This is despite the fact that more first-in-class small molecule drugs are  developed with phenotypic approaches.And despite the fact that many effective longevity therapies (in mice) had no mechanistic hypothesis when they were discovered, including parabiosis (and potentially  neutral blood exchange), which we still don’t understand, and caloric restriction.\n Phenotypic approaches also seem better suited to finding effective combinations of therapies, for the inelegant reason that biological systems are so interconnected that to find an effective combination therapy we’ll just have to try a lot of combinations.This is important for longevity, since it’s not clear how much partial credit we get for solving any single cause of aging.It may be that each one cured buys us more lifespan and eventually we reach  longevity escape velocity.But since dying only requires one cause of death, we may need therapies that simultaneously address all or most causes of aging — even ones we don’t know of yet — before seeing benefits.The idea that phenotypic approaches might be better for targeting multi-causal biological phenomena like aging is  not new.Companies working on them (not specifically on longevity) include  Recursion,  Janssen, and  Insitro.\n Phenotypic screening has plenty of challenges, of course.One is the gajillion factor: you need a way to try lots of different treatments, and the space of possible treatments is astronomical.Another is that you can’t do a phenotypic screen without a phenotype, and waiting for animals to die is pretty inefficient.Developing measurable phenotypes for aging, like  epigenetic clocks, is critical to enable better phenotypic screens. Gordian,  Nemalife,  Magnitude,  InVivo,  Vium, and  Spring are among the companies working on these problems.\n  It seems inarguable that humans can live forever in the limit of arbitrarily fancy technology, though  some disagree.  2But whether death is conquerable not just eventually, but  with near-term tools and understanding, is not clear.To paraphrase  Lincoln: we don’t know whether we’ve sharpened the biotechnological axe enough to cut down the death tree.\n This is a key question for longevity strategy.The more confident we are that existing therapeutic technologies can make a dent in aging, the more we should invest in using them.The less confident we are, the more we need to make new tools.\n One relevant datapoint is what modalities (a.k.a. types of therapeutics) are being used by companies currently working on longevity. As far as we know, it’s about 51% small molecule drugs, 16% biologics, 18% cell therapies, and 15% gene therapies.This skews more toward non-small-molecule therapeutics than the  industry average, which is what we might expect given that most of the causes of aging in the table above don’t have obvious targets for small molecule inhibition.It’s also a marginal indication that new tools are needed, since non-small-molecule therapeutics are newer and less straightforward to develop than small-molecule drugs (as if those were straightforward to develop in the first place).\n Another datapoint is what we’ve managed to accomplish so far in mice.Here’s a table mostly derived from a table of  Laura Deming’s showing the greatest median lifespan increase that’s been achieved in mice by different therapeutic modalities.\n   Note that median lifespan is not maximum lifespan, and lifespan often increased for only one sex of mouse.\n The top two modalities in mice, spontaneous mutation and GGT, can’t be used (legally) in humans.And I’d argue diet is off the table for practical reasons; we’re talking extreme diets.The remaining modalities are used in some form in humans.I left surgeries off the table since it’s too broad a category, but the ones relevant to humans give &lt;= 10% median lifespan increase.Also note that just because a lab chose to treat a mouse with one modality doesn’t mean another modality can’t accomplish the same effect.Developing small molecule drugs to target proteins encoded by genes discovered by GGT in mice is standard practice.\n You can read this table as showing that human-amenable modalities are less potent than they could be, or you can read it as a selection effect of what academics find easiest to do in the lab.The former is a big claim, and I’d need more evidence to believe it.The latter isn’t news to anyone.Synthesizing candidate drug molecules is  slow.Producing immunotherapeutics is  slow and  hard.Gene therapy has a  ways to go.\n Altogether it seems clear that our therapeutic armamentarium is lacking, whether in potency or ease of use.\n  Bringing a medical treatment to market is extremely slow and expensive.It  takes around a decade and $1 billion.A big reason for this is the  20% success rate for non-cancer drugs once they enter clinical trials, not to mention the definitely-less-than-100% success rate for making it to clinical trials in the first place.\n Here’s a figure from  this paper breaking down the costs, timelines, and success rates in a traditional target-based drug discovery campaign.\n  Paraphrased caption from the paper:Numbers are in millions of USD and based on data from Eli Lilly and Company.p(TS) is the probability of successful transition from one stage to the next.WIP is work in process, the number of candidate drugs being worked on.Lighter-shaded boxes show calculated values based on assumed inputs.Costs do not include investments for exploratory discovery research, post-launch expenses like marketing, or non-R&amp;D overheads like non-scientist salaries.\n Worth noting in the figure is that most of the cost is in the clinical trials (the blue parts), and that the step with the lowest success rate is Phase 2 clinical trials (the first time the therapy’s efficacy is tested in humans, usually).\n What does this mean for longevity?Barring an adventure in regulatory arbitrage or  medical tourism, any longevity treatments will have to get through this process before they can get to you or me.  3So it may well be that the best way to pursue longevity is to improve the drug development process, depending on how tractable and neglected various improvements are.\n Diagnosing the problems in the drug development process is a lot like studying aging: everything you look at is broken, but we have no idea about the root causes or where best to intervene.\n  Animal models for disease are  fraught with  difficulty.Those for aging are  particularly  challenging.How challenging?So challenging that the longest-lived strain of mouse known to biology  used to be used as a model for  rapid aging, because the mice were being handled wrong and dying young.\n A big change in lab operations over the last two decades has been the “virtualization” of biotech, which is a fancy word for outsourcing.Work once done in-house, like synthesizing molecules or running toxicity assays, is now often done by Contract Research Organizations (CROs).Outsourcing carries all the advantages in biotech that it does in other domains: increased specialization, lower prices, etc.But outsourcing is inefficient at best, and usually involves many headaches.It’s still a lot easier to do drug development when everyone’s in the same building, or so says every ex-pharma scientist I’ve asked about it.This is not the case in other industries.\n Solutions to these problems could come in the form of automation —  Emerald Cloud Lab and  Transcriptic are two companies working on that — or better outsourcing offerings. One thing the field probably is good on is electronic lab notebooks; thanks though.\n  Longevity research, and medicine in general, is bad at integrating its knowledge and learning from failures.Between 25% and 50% of clinical trial results  remain unpublished even several years after completion.This isn’t surprising: why publish your clinical data when there’s zero gain to you and even a slim chance you can repurpose the asset in the future?But this means a potential downside of moving longevity efforts from research to commercial therapeutic development is that the field will learn less overall.\n A related problem is that because liquidity events can happen far before convincing clinical data, biotechs are incentivized to push their risky studies until as late as possible (ideally after the employees get their money) and to gussy them up to look better than they really are.A fail-fast-and-publish-honestly mentality would of course be better for longevity overall.\n Then again, it’s not like academic research is  necessarily better.Medical research results in general are  apparently  unreproducible up to 50% of the time.Plus private biotech can sometimes afford to do things that academia can’t.\n  Before it can conquer death, a longevity treatment will have to conquer the U.S. FDA’s clinical trial process.The FDA doesn’t consider aging to be a medical indication (a.k.a. a valid reason for treatment).This means longevity companies have to choose an existing age-related indication (e.g. Alzheimer’s) to demonstrate efficacy of their treatment on.How to do this well is a key consideration for any longevity biotech.\n More optimistically, regulatory changes like  dual-track clinical trials or  eliminating phase 3 trials altogether might entail a massive acceleration in longevity therapeutic development.Outsourcing or decentralizing clinical trials is also an exciting option. Science 37 is one company working on this.\n  The high costs and failure rates of drug development make it a tough space for entrepreneurial disruption.(The first chapters  here are illustrative.)\n This is partly because high risk makes behavior change hard.There’s natural resistance to changing any part of the playbook.As one medicinal chemist put it to me “if you make a service 2x better, nobody cares.If you make it 10x better, or tell them to try a new approach, they won’t believe you. 4x or 5x better with their existing process is optimal.”Not exactly culture of disruptive innovation.Genetic sequencing has managed to jump this gap; I’d like to better understand what degree of price decrease and reliability was required for that.\n It’s also because the payoffs in biotech take so long to arrive, way after all the research is done.This means platforms and services for drug development aren’t bought and sold by biotechs as much as bartered for with equity in whatever future drugs they hopefully produce.This in turn makes it more complicated and expensive to start companies offering platforms and services to biotechs compared to other industries.\n As if all the above wasn’t good enough, the time and cost required to make a drug are increasing over time, despite lots of technological advancement.There’s even a cute name for it:  Eroom’s law.Nobody knows why it’s happening, but if the causes of Eroom’s law are exogenous, we should advance more longevity therapeutics sooner while it’s relatively cheap.\n So, which has more marginal benefit, improving the drug discovery system or going after longevity with the existing system?Obviously I have no idea, but the point is that it’s  not obviously the latter.We should also appreciate how many important problems there are to be solved outside the lab and with non-biology skills.\n   The pursuit of longevity doesn’t happen in a vacuum.A full answer to “should we pursue human longevity” needs to take all externalities into account.\n A big externality is the aspirational value of longevity as a brand/meme for biotech in general.Some might argue that society is already working on longevity with every new medicine it develops.If we keep curing things that kill us, eventually we stop dying, right?Who needs the new branding?Well, a lot of longevity investment is not coming from traditional biotech/pharma investors, but from Silicon Valley.That may be attributable to the aspiration value.And even if the aspirational call of longevity does nothing more than encourage talented people to work on biotech, that may be well worth it.\n Another possibility is that the promise of death-postponement could spur funding increases or regulatory reforms for drug discovery.This is presumably the thinking behind efforts like  Rejuvenate,  Celevity, and  GenFlow to achieve longevity in charismatic species like household pets.If everyone’s dogs were suddenly living to age 30, people would hopefully start getting jealous.\n On the other hand, if a field over-promises and under-delivers it can go through a winter.This wasn’t great for the field of  AI, and it would be nice if longevity can avoid this.There’s also brand risk.Gene therapy was delayed a lot by the  death of a teenager in 1999.If longevity therapies develop brand recognition — I’m looking at you,  senolytics — and there’s a major adverse incident, it would have been better to keep a low profile.\n Then again, the same fears of death that make longevity prone to pseudoscience might act as a countervailing force to a winter. People don’t really care about AI research. They do care about staying alive.\n   Why do we care about longevity? Because death is bad.  4 There are four problems with it:\n  But longevity isn’t the only solution to these problems. And these problems aren’t the only causes of suffering in the world that we might care about. This means we have two opportunity cost calculations to make.\n  Humanity has made a massive dent in problems 1 and 2 with analgesics.Analgesics get short shrift in the history of technology, but they’re one of the largest victories ever won against death, not to mention childbirth.They also have lots of room for improvement, though that improvement may be hard to attain if the history of analgesic development is  any  indication.Then again it’s hard to imagine it being any harder than longevity therapeutic development.\n Physical pain is hardly the only kind of suffering implicated in problems 1 and 2, of course.Aging and death, and witnessing them, entail  significant existential suffering and anguish.(Citation probably unnecessary for that fact.)If the psychonauts are to be believed, we may be close to treatments for those, too: clinical results so far are  promising.But it’s hard to imagine psychedelics making us fully disinterested in death.Doing so would likely require significant changes in analgesia, mood-altering drugs, and cultural attitudes toward medication and death.\n Some readers may feel that pain- or mood-manipulation are inauthentic ways to defy death.I’d gently remind such readers that we’re comparing these strategies against  making humans immortal, so you may want to check your naturalistic fallacy at the door.\n Problems 3 and 4 run up against hairy philosophical issue\n......", "posttime": "2020-10-27 10:25:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "追求,human,长寿", "title": "我们应该如何追求人类的长寿呢？", "title_en": "How should we pursue human longevity?", "transed": 1, "url": "https://milan.cvitkovic.net/writing/longevity/", "via": "", "real_tags": ["追求", "human", "长寿"]}, {"category": "", "categoryclass": "", "imagename": "8e095aa1770cbcc8451466976c94b5e2.png", "infoid": 1031385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这意味着你可以自由复制和分享这些漫画(但不能出售它们)。更多细节。", "note_en": "This means you&#39;re free to copy and share these comics (but not to sell them).  More details.", "posttime": "2020-10-27 10:24:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xkcd,分享", "title": "Xkcd电话12", "title_en": "Xkcd Phone 12", "transed": 1, "url": "https://xkcd.com/2377/", "via": "", "real_tags": ["xkcd", "分享"]}, {"category": "", "categoryclass": "", "imagename": "bcc679f5b983fe55d0a99d9f625737ce.jpeg", "infoid": 1031382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "向VR粉丝询问他们的抱怨，他们很可能会提到“屏蔽门”效果，或者当你看着离眼睛这么近的显示器时，你会注意到像素之间的差距。如果三星和斯坦福大学能如愿以偿，这种烦恼可能会完全消失。他们已经开发出(通过IEEE Spectrum)OLED技术，支持高达每英寸10,000像素的分辨率-远远高于你在几乎任何现有显示器上看到的分辨率，更不用说你在Oculus Quest 2这样的现代VR耳机中可以看到的分辨率了。\n这项新的OLED技术使用薄膜在反射层之间发射白光，一个是银色的，另一个是由带有纳米波纹的反射金属制成的。这种“光学变形表面”改变了反射属性，并允许特定的颜色通过像素产生共振。该设计允许的像素密度比你在手机上看到的RGB OLED要高得多，但对亮度的影响不会达到你在一些电视上看到的白色OLED的程度。\n这将是VR和AR的理想选择，可以创建一个几乎“无懈可击”的图像，你看不到屏蔽门的效果，甚至看不到单独的像素。这可能需要数年时间才能实现，届时需要更多的计算能力，但OLED技术将不再是障碍。\n它也比你想象的更实用。三星已经在研究使用10000PPI技术的“全尺寸”显示屏，波纹的设计使大规模生产成为可能。这可能只是你何时何地看到这款OLED的问题，而不是“如果”的问题。", "note_en": "Ask VR fans about their gripes and they’ll likely mention the “screen door” effect, or the gaps between pixels that you notice when looking at a display so close to your eyes. That annoyance might disappear entirely if Samsung and Stanford University have their way. They’ve  developed (via   IEEE Spectrum) OLED technology that supports resolutions up to 10,000 pixels per inch — well above what you see in virtually any existing display, let alone what you’d find in a modern VR headset like the  Oculus Quest 2.\n The newOLED tech uses films to emit white light between reflective layers, one silver and another made of reflective metal with nano-sized corrugations. This “optical metasurface” changes the reflective properties and allows specific colors to resonate through pixels. The design allows for much higher pixel densities than you see in the RGB OLEDs on phones, but doesn’t hurt brightness to the degree you see with white OLEDs in some TVs.\n  This would be ideal for VR and AR, creating a virtually ‘flawless’ image where you can’t see the screen door effect or even individual pixels. This might take years to arrive when it would require much more computing power, but OLED tech would no longer be an obstacle.\n It’s also more practical than you might think. Samsung is already working on a “full-size” display using the 10,000PPI tech, and the design of the corrugations makes large-scale manufacturing viable. It may just be a question of when and where you see this OLED rather than “if.”", "posttime": "2020-10-27 10:06:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "斯坦福,display,oled", "title": "三星，斯坦福制造10000 ppi的显示器，可能会带来“无懈可击”的虚拟现实", "title_en": "Samsung, Stanford Make a 10,000 PPI Display That Could Lead To 'Flawless' VR", "transed": 1, "url": "https://www.engadget.com/samsung-stanford-10000-ppi-oled-display-200949600.html", "via": "", "real_tags": ["斯坦福", "display", "oled"]}, {"category": "", "categoryclass": "", "imagename": "c662d6aeba7734c0ae5bf394f9c49cab.jpg", "infoid": 1031381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "福尔曼与石井浩教授一起在有形媒体研究小组工作，他于10月20日在计算机械协会用户界面软件与技术研讨会上介绍并展示了DefeXiles的研究。福尔曼表示，这种材料可能会立即被证明对时装设计中的原型和定制有用，但未来的应用还可能包括具有可调机械性能的3D打印外科网格等。\n福尔曼说：“总的来说，这项工作最让我兴奋的是它对许多制作人的立竿见影的作用。”“与以前的工作不同的是，不需要定制的软件或硬件--只需要一台相对便宜的250美元的打印机，这是最常见的打印机类型--这真的让数百万人可以使用这项技术。”\n“我们设想未来的材料将是动态的和可计算的，”石井说。“我们称之为‘基团原子’。”DefeXiles是自由基原子的一个很好的例子，它是一种可编程的物质，它模仿现有材料的属性，并超越了现有材料的属性。我们可以触摸、感觉、佩戴和打印它们。“。\n与Forman和Ishii一起参与该项目的还有计算机科学和人工智能实验室、电气工程系和计算机科学研究生Mustafa Doga Dogan，以及麻省理工学院建筑系本科生汉密尔顿·福赛斯(Hamilton Forsythe)。\n在麻省理工学院比特与原子中心主任尼尔·格申菲尔德教授的带领下，福尔曼在媒体艺术与科学课程MAS.863/4.140/6.943(如何制作(几乎)任何东西)上进行了3D打印实验。福尔曼的实验灵感来自他在卡内基梅隆大学读本科时的一位朋友的工作，他用未挤出的细丝制作花瓶。当他第一次尝试挤压不足时，我非常恼火，因为产生的瑕疵是完美的和周期性的，“他说，”但后来当我开始玩它，弯曲它，甚至拉伸它时，我就像是，‘哇，等等，这是一种纺织品。它看起来像它，感觉像它，弯曲像它，而且它打印得真的很快。“。\n福尔曼补充道：“我带了一个小样本到我的班上做展示和讲解，没有多想，Gershenfeld教授看到了它，他对此很兴奋。”\n当3D打印机未挤出材料时，它会在沉积的材料中产生周期性间隙。使用廉价的熔融沉积建模3D打印机，福尔曼开发了一种名为“球状拉伸”的欠挤出工艺，在这种工艺中，热塑性聚合物的球状颗粒通过细丝连接在一起。该工艺生产出一种柔软、有弹性的纺织品，具有明显的经纬度，就像机织织物一样。福尔曼说，它摸起来有点像网眼针织面料。\n“这些纺织品不仅比其他方法更薄，印刷速度更快，而且演示表格的复杂性也得到了改善。福尔曼说：“使用这种方法，我们可以用普通的3D打印机打印3D壳体表格，而不需要特殊的切片机软件。“这很令人兴奋，因为3D打印面料有很多机会，但它真的很难传播，因为很多面料使用昂贵的机械和特殊软件或特殊命令，而这些通常是打印机特有的。”\n这种新纺织品可以像熨烫的补丁一样缝制、去褶皱和热粘合。福尔曼和他的同事们使用许多常见的3D打印材料打印了这些纺织品，包括一种导电丝，他们用这种材料生产了一种灯，可以通过触摸灯罩上的褶皱来点亮和调暗。研究人员建议，其他基材或添加剂可以生产具有磁性或光学性能的纺织品，或者通过使用藻类、咖啡渣或木材生产更易生物降解的纺织品。\n卡内基梅隆大学(Carnegie Mellon University)人机交互研究所(Human-Computer Interaction Institute)教授斯科特·哈德森(Scott Hudson)表示，福尔曼的工作代表着不断扩大的3D打印技术体系中一个非常有趣的补充。\n“这项工作特别重要，因为它和更传统的技术一样，在相同的印刷过程中发挥作用，”哈德逊指出，他并没有参与这项研究。这项技术将使我们能够将定制的3D打印纺织品组件-可以是灵活和柔软的组件-与更传统的硬部件一起集成到物体中。\n当麻省理工学院在新冠肺炎疫情爆发之初关闭时，福尔曼正在为美国医学会研讨会的提交做准备。他将自己设立的完整实验室搬到了纽约普莱西德湖附近父母小屋的地下室。\n“这不是很多大型设备，但有很多小工具，钳子，细丝，”他解释说。“我不得不安装两台3D打印机，一个焊接站，一个照片背景--仅仅是因为这项工作涉及多个学科。”\n福尔曼说，在机舱里，“当我周围的世界都在燃烧时，我能够专注于科学研究，这实际上是一种很好的分散注意力的方式。”“从事一个如此专注于科技的项目，然后向窗外看去，看到自然和树木-两者之间的紧张关系相当鼓舞人心，这也是一件有趣的事情。”\n他回忆说，这对他的父母来说也是一次经历，他们看到了他“在我最紧张、最专注、最努力的时候”。“我会在早上5点上楼。我爸爸下来吃早饭的时候吃了点零食。\n“我的父母成为创作活动的一部分，我会打印一些东西，然后去，‘看看这个，’”他说。“我不知道还会不会再有机会让我的父母如此近距离地触摸我每天做的事情。”\n这个项目最不寻常的方面之一就是所谓的材料。福尔曼和他的同事们之所以使用“准纺织品”这个术语，是因为DefeXiles不具备通常纺织品的所有相同的物理特性，如两个方向的偏向和柔软度。但福尔曼说，一些怀疑者在感受到这些材料时已经皈依了。\n这一经历让他想起了著名的勒内·马格里特(RenéMagritte)油画《物件的背叛(这不是烟斗)》，在油画中，烟斗的插图引发了一场关于一件作品是否能完全包含一个物件的所有意义的讨论。福尔曼解释说：“我感兴趣的是数字比特和材料体验之间的耦合，通过计算制造具有可控形式和机械性能的高保真材料。”\n他补充说：“这让我想到，什么时候事物的指代成为人们所接受的事物。”“我感兴趣的不是人们的决定，而是它背后的道理，找出是什么导致他们接受或拒绝它作为纺织材料。”", "note_en": "Forman, who works in the Tangible Media research group with Professor Hiroshi Ishii, presented and demonstrated the DefeXtiles research on Oct. 20 at the Association for Computing Machinery Symposium on User Interface Software and Technology. The material may prove immediately useful for prototyping and customizing in fashion design, Forman says, but future applications also could include 3D-printed surgical mesh with tunable mechanical properties, among other items.\n “In general, what excites me most about this work is how immediately useful it can be to many makers,” Forman says. “Unlike previous work, the fact that no custom software or hardware is needed — just a relatively cheap $250 printer, the most common type of printer used — really makes this technique accessible to millions of people.”\n “We envision that the materials of the future will be dynamic and computational,” says Ishii. “We call it ‘Radical Atoms.’ DefeXtiles is an excellent example of Radical Atoms, a programmable matter that emulates the properties of existing materials and goes beyond. We can touch, feel, wear, and print them.”\n Joining Forman and Ishii on the project are Computer Science and Artificial Intelligence Laboratory and Department of Electrical Engineering and Computer Science graduate student Mustafa Doga Dogan, and Hamilton Forsythe, an MIT Department of Architecture undergraduate researcher.\n  Forman had been experimenting with 3D printing during the media arts and sciences class MAS.863 / 4.140 / 6.943 (How to Make (Almost) Anything), led by Professor Neil Gershenfeld, director of the MIT Center for Bits and Atoms. Forman&#39;s experiments were inspired by the work of a friend from his undergraduate days at Carnegie Mellon University, who used under-extruded filament to produce vases. With his first attempts at under-extruding, &#34;I was annoyed because the defects produced were perfect and periodic,” he says, “but then when I started playing with it, bending it and even stretching it, I was like, ‘whoa, wait, this is a textile. It looks like it, feels likes it, bends like it, and it prints really quickly.”\n “I brought a small sample to my class for show and tell, not really thinking much of it, and Professor Gershenfeld saw it and he was excited about it,” Forman adds.\n When a 3D printer under-extrudes material, it produces periodic gaps in the deposited material. Using an inexpensive fused deposition modeling 3D printer, Forman developed an under-extruding process called “glob-stretch,” where globs of thermoplastic polymer are connected by fine strands. The process produces a flexible, stretchy textile with an apparent warp and weft like a woven fabric. Forman says it feels something like a mesh jersey fabric.\n “Not only are these textiles thinner and faster to print than other approaches, but the complexity of demonstrated forms is also improved. With this approach we can print 3D dimensional shell forms with a normal 3D printer and no special slicer software,” says Forman. “This is exciting because there’s a lot of opportunities with 3D printing fabric, but it’s really hard for it to be easily disseminated, since a lot of it uses expensive machinery and special software or special commands that are generally specific to a printer.”\n The new textile can be sewn, de-pleated, and heat-bonded like an iron-on patch. Forman and his colleagues have printed the textiles using many common 3D printing materials, including a conductive filament that they used to produce a lamp that can be lit and dimmed by touching pleats in the lampshade. The researchers suggest that other base materials or additives could produce textiles with magnetic or optical properties, or textiles that are more biodegradable by using algae, coffee grounds, or wood.\n According to Scott Hudson, a professor at Carnegie Mellon University&#39;s Human-Computer Interaction Institute, Forman&#39;s work represents a very interesting addition to the expanding set of 3D-printing techniques.\n “This work is particularly important because it functions within the same print process as more conventional techniques,” notes Hudson, who was not part of the study. “This will allow us to integrate custom 3D-printed textile components — components that can be flexible and soft — into objects, along with more conventional hard parts.”\n  When MIT closed down at the start of the Covid-19 pandemic, Forman was in the midst of preparing for the ACM symposium submission. He relocated his full lab set up to the basement of his parents’ cabin near Lake Placid, New York.\n “It’s not a lot of large equipment, but it’s lots of little tools, pliers, filaments,” he explains. “I had to set up two 3D printers, a soldering station, a photo backdrop — just because the work is so multidisciplinary.”\n At the cabin, “I was able to hone in and focus on the research while the world around me was on fire, and it was actually a really good distraction,” Forman says. “It was also interesting to be working on a project that was so tech-focused, and then look out the window and see nature and trees — the tension between the two was quite inspiring.”\n It was an experience for his parents as well, who got to see him “at my most intense and focused, and the hardest I’ve worked,” he recalls. “I’d be going upstairs at 5 a.m. for a snack when my dad was coming down for breakfast.&#34;\n “My parents became part of the act of creation, where I’d print something and go, ‘look at this,’” he says. “I don’t know if I’ll ever have the opportunity again to have my parents so closely touch what I do every day.”\n One of the more unusual aspects of the project has been what to call the material. Forman and his colleagues use the term “quasi-textile” because DefeXtiles doesn’t have all the same physical qualities of a usual textile, such as a bias in both directions and degree of softness. But some skeptics have been converted when they feel the material, Forman says.\n The experience reminds him of the famous René Magritte painting “The Treachery of Objects (This Is Not a Pipe),” where the illustration of a pipe prompts a discussion about whether a representation can fully encompass all of an object’s meanings. “I’m interested in the coupling between digital bits and the materials experience by computationally fabricating high-fidelity materials with controllable forms and mechanical properties,” Forman explains.\n “It makes me think about when the reference of the thing becomes accepted as the thing,” he adds. “It’s not the decision people make, but the reasoning behind it that interests me, and finding what causes them to accept it or reject it as a textile material.”", "posttime": "2020-10-27 09:37:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,缺陷,defect,材料", "title": "利用3D打印机的“缺陷”来创造一种新的准纺织品", "title_en": "Leveraging a 3D printer “defect” to create a new quasi-textile", "transed": 1, "url": "https://news.mit.edu/2020/defextiles-leveraging-3d-printer-defect-to-create-quasi-textiles-1020", "via": "", "real_tags": ["打印", "缺陷", "defect", "材料"]}, {"category": "", "categoryclass": "", "imagename": "6c6d256443aa3a1b13c33041567e61c1.jpeg", "infoid": 1031380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊斯兰堡(路透社)-巴基斯坦总理伊姆兰·汗(Imran Khan)呼吁Facebook FB.O在其平台上禁止仇视伊斯兰的内容，警告穆斯林中的激进化情绪激增。几个小时前，他抨击法国总统攻击伊斯兰教。\n巴基斯坦周一召见了法国驻伊斯兰堡大使，因总统伊曼纽尔·马克龙对上周一名伊斯兰主义者杀害一名法语教师的反应引发的愤怒情绪蔓延。\n可汗在周日发布在Twitter上的一封公开信中表示，“日益增长的伊斯兰恐惧症”正在鼓励全世界的极端主义和暴力，特别是通过Facebook等社交媒体平台。\n汗说：“我会要求你们在Facebook上对伊斯兰恐惧症和仇恨伊斯兰教实施类似的禁令，就像你们为大屠杀实施的禁令一样。”\n本月，Facebook表示正在更新其仇恨言论政策，以禁止否认或歪曲大屠杀的内容。\n汗说：“人们不能发出这样的信息，即虽然针对一些人的仇恨信息是不可接受的，但这些信息对另一些人是可以接受的。”他补充说，这样的立场“反映了偏见和偏见，这将鼓励进一步的激进化”。\n作为回应，Facebook的一位女发言人告诉路透社，该公司反对一切形式的仇恨，不允许基于种族、民族、国籍或宗教的攻击。\n这位女发言人在一份声明中说：“一旦我们意识到这一点，我们将立即删除这种仇恨言论。”她补充说，Facebook有“更多的工作要做”。\nFacebook上一份截至2019年12月的六个月透明度报告显示，巴基斯坦是限制内容请求数量第二高的国家，仅次于俄罗斯。\nFacebook一位直接了解这一问题的消息人士告诉路透社，要求删除与伊斯兰教有关的内容的最多请求来自巴基斯坦，超过了其他穆斯林占多数的国家。\n消息人士称，Facebook传统上遵守了这一规定，因为不这样做将违反巴基斯坦的法律，并补充说，当局经常会一次发送数十个链接，并要求删除这些链接。\n在信中，汗还提到了法国的情况，他说，在法国，伊斯兰教与恐怖主义联系在一起。\n汗说，马克龙通过鼓励展示描绘先知穆罕默德的漫画来“攻击伊斯兰教”。\n汗发表评论之前，马克龙向一名被一名伊斯兰激进分子斩首的法国历史教师致敬，这名教师想要报复在一堂关于言论自由的课上使用描绘先知穆罕默德的漫画。\n巴基斯坦外长沙阿·马哈茂德·库雷希表示，法国驻伊斯兰堡大使已被召见，对马克龙的“不负责任的言论”提出外交抗议。\n土耳其总统塔伊普·埃尔多安(Tayyip Erdogan)也批评了马尔孔，称上周法国总统在对待穆斯林的态度上需要心理帮助。法国随后召回了驻土耳其大使。\n巴基斯坦和土耳其有着牢固的关系，而汗和埃尔多安则发展了密切的关系-特别是在伊斯兰恐惧症的话题上。\n汗写给脸书的信和对马克龙的评论出现在他面临新成立的反对党联盟试图推翻他的压力之际。\n丹麦报纸Jylland-Posten于2005年首次出版了先知穆罕默德的漫画，长期以来，这些漫画在穆斯林中一直是一个敏感话题，在巴基斯坦和其他地方引发了抗议活动。\n上个月，当法国讽刺周刊查理周刊转载这些漫画时，数万人在巴基斯坦举行了抗议活动。\n汗政府已经对一些社交媒体应用程序进行了严格的审查，并禁止了一些被当局视为淫秽或不道德的内容。", "note_en": "ISLAMABAD (Reuters) - Pakistan Prime Minister Imran Khan called on Facebook   FB.O  to ban Islamophobic content on its platform, warning of a spike in radicalisation amongst Muslims, hours after he hit out at the French president for &#34;attacking Islam&#34;.\n  Pakistan summoned the French ambassador in Islamabad as anger spread on Monday over President Emmanuel Macron’s reaction to the murder last week of a French teacher by an Islamist.\n Khan, in an open letter posted on Twitter on Sunday, said “growing Islamophobia” was encouraging extremism and violence worldwide, especially through social media platforms such as Facebook.\n “I would ask you to place a similar ban on Islamophobia and hate against Islam for Facebook that you have put in place for the Holocaust,” Khan said.\n  This month, Facebook said it was updating its hate speech policy to ban content that denied or distorted the Holocaust.\n “One cannot send a message that while hate messages against some are unacceptable, these are acceptable against others,” Khan said, adding such a stance was “reflective of prejudice and bias that will encourage further radicalisation”.\n In response, a Facebook spokeswoman told Reuters the company opposed all forms of hate and did not allow attacks based on race, ethnicity, national origin or religion.\n  “We’ll remove this hate speech as soon as we become aware of it,” the spokeswoman said in a statement, adding that Facebook had “more work to do”.\n Facebook’s last transparency report for the six months to December 2019, showed that Pakistan was the source of the second highest number of requests to curb content after Russia.\n A source with direct knowledge of the issue at Facebook told Reuters that the most requests for the removal of content relating to Islam came from Pakistan, exceeding other Muslim-majority countries.\n  Facebook traditionally complies, as not doing so would be to break Pakistan’s laws, the source said, adding that authorities would often send dozens of links at a time and demand they be taken down.\n  In his letter, Khan also referred to the situation in France, where, he said, Islam was being associated with terrorism.\n  Khan said Macron had “attacked Islam” by encouraging the display of cartoons depicting the Prophet Mohammad.\n Khan’s comments came after Macron paid tribute to a French history teacher beheaded by an Islamist radical who wanted to avenge the use of cartoons depicting the Prophet Mohammad in a class on freedom of expression.\n Pakistani Foreign Minister Shah Mehmood Qureshi said the French ambassador in Islamabad had been summoned to be given a diplomatic protest against Macron’s “irresponsible remarks”.\n  Turkish President Tayyip Erdogan also criticised Marcon, saying last week the French president needed mental help over his attitude towards Muslims. France then recalled its ambassador to Turkey.\n Pakistan and Turkey share strong ties, while Khan and Erdogan have developed a close relationship - particularly on the topic of Islamophobia.\n Khan’s letter to Facebook and comments on Macron come as he faces pressure from a newly formed coalition of opposition parties seeking to oust him.\n  The cartoons of the Prophet Mohammad, first published in 2005 by Danish newspaper Jyllands-Posten, have long been a sensitive topic among Muslims, stirring protests in Pakistan and elsewhere.\n Tens of thousands of people protested in Pakistan last month when the cartoons were republished by the French satirical weekly Charlie Hebdo.\n Khan’s government has subjected a number of social media apps to intense scrutiny and banned some for content authorities deemed obscene or immoral.", "posttime": "2020-10-27 09:12:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,总理,pm,巴基斯坦", "title": "巴基斯坦总理要求Facebook禁止仇视伊斯兰的内容", "title_en": "Pakistan's PM Asks Facebook To Ban Islamophobic Content", "transed": 1, "url": "https://www.reuters.com/article/us-pakistan-facebook/pakistani-pm-writes-to-facebook-ceo-seeking-ban-on-islamophobic-content-idUSKBN27A0UK", "via": "", "real_tags": ["facebook", "总理", "pm", "巴基斯坦"]}, {"category": "", "categoryclass": "", "imagename": "292e77722d527a24f7bdc4bd0000b052.jpg", "infoid": 1031379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据Android Central报道，Chrome OS可能终于进入了黑暗模式，但到目前为止，它只在其实验性的金丝雀频道中被发现。\n在你尝试使用Canary之前，请注意：Canary是谷歌的Chrome OS路径的“尖端”，它在经过广泛测试之前每天都会收到功能的更新。它只能从切换到特殊开发者模式的Chromebook访问(不要与Chrome OS开发者频道混淆)。谷歌警告说，金丝雀可能会“不稳定”。\n但目前，要激活Chromebook上的暗模式，你需要安装金丝雀通道。一旦你这样做了，Android Central会说你只需打开Chrome，然后在地址栏中输入Chrome：//flag/#enable-force-Dark和chrome：//flag/#enable-webui-Dark-mode即可。我应该指出的是，我在我的旧Chromebook上尝试了这一点，但无法让它正常工作。但这是安卓警察捕捉到的景象：\nAndroid Central表示，暗模式有一些缺陷，但他指出，它似乎适用于整个UI，而不仅仅是更暗的背景。\n在过去的几个月里，谷歌已经为其Gmail、Google Calendar、Google Fit和其移动应用程序推出了黑暗模式版本。IOS和Android去年都开始在系统层面支持暗模式。\n我们联系了谷歌，看看是否有计划在Chrome OS中向所有用户推出黑暗模式，如果得到回复，我们会更新的。", "note_en": "Chrome OS may finally be getting a dark mode, but so far it’s only been  spotted in its experimental Canary channel,   Android Central reported.\n Before you go tinkering with Canary just be advised: Canary is Google’s “bleeding edge” Chrome OS path, which receives daily updates of features before they’ve been widely tested. It can only be accessed from Chromebooks switched into a special developer mode (not to be confused with the Chrome OS Developer channel). Google warns that Canary can be “unstable.”\n  But at the moment, to activate dark mode on your Chromebook, you need to have the  Canary channel installed. Once you’ve done that,  Android Central says you just open Chrome and type in  chrome://flags/#enable-force-dark and  chrome://flags/#enable-webui-dark-mode into the URL bar. I should note I tried this on my older Chromebook and wasn’t able to get it to work. But here’s the view   Android Police captured:\n   Android Central says the dark mode has some bugs, but notes it seems to apply across the UI, not just as darker backgrounds.\n Google has rolled out dark mode versions for its  Gmail,  Google Calendar,  Google Fit, and its  mobile app over the last several months. Both iOS and Android both began supporting dark mode at the system level last year.\n We reached out to Google to see if there are plans to roll out dark mode in Chrome OS to all users, and will update if we hear back.", "posttime": "2020-10-27 09:11:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,os", "title": "Chrome OS可能最终将进入黑暗模式", "title_en": "Chrome OS May Finally Be Getting a Dark Mode", "transed": 1, "url": "https://www.theverge.com/2020/10/25/21532869/chrome-os-dark-mode-chromebooks-google", "via": "", "real_tags": ["chrome", "os"]}, {"category": "", "categoryclass": "", "imagename": "1e5065b35c107459aed0770b6330b3a9.jpg", "infoid": 1031377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电子竞技娱乐集团(ESports Entertainment Group)以4300万美元收购了Helix eSports和GGCircuit，以求成为体育和博彩巨头。\n这家上市公司正在积累一些与体育相关的资产，但它通过将游戏、锦标赛和博彩结合在一起，以一种独特的方式做到了这一点。首席执行官格兰特·约翰逊(Grant Johnson)在接受GamesBeat采访时表示，Vindex和GG Group等其他公司也在对ESPORTS进行大笔投资，但没有一家公司像电子竞技娱乐集团(ESports Entertainment Group)那样积累了如此庞大的资产集合。最重要的是，博彩公司可能会产生收入，以维持公司的运营，同时等待体育运动的增长带来的长期利润。\n最终，电子竞技娱乐集团(ESports Entertainment Group)预计，竞技游戏将变得与传统体育项目一样大。这就是为什么格兰特·约翰逊认为，像罗伯特·克拉夫特、马克·库班、杰里·琼斯和哈里斯·布利策体育娱乐公司这样的运动队老板都进行了体育投资。机构投资者看涨，这就是投资者每年向该行业投入10亿美元的原因。\n“大型、聪明的体育帝国正在向体育领域投资数亿美元。电子竞技已经成为主流，“约翰逊说。“两年前，如果有人说体育锦标赛要在电视上转播，你肯定会翻白眼。但这就是COVID带来的。“。\n他声称，新的收购将使该公司成为最多元化的体育娱乐公司。通过这些交易，该公司将一个企业软件业务、一个分析平台和一个基于玩家对玩家技能的赌博平台整合在一起。这些业务将与电子竞技娱乐集团(ESports Entertainment Group)的海外博彩业务相结合，用于在竞技游戏上下注。\n随着对Helix eSports的收购，eSports Entertainment也在收购Helix的Genji Analytics，该公司生产ESPORTS数据。\n约翰逊说：“我们正在收购三个运营实体--GGCircuit、Helix eSports和Genji Analytics。“这对我们来说将是变革性的。这将给我们带来多种不同的收入来源。我们是唯一一家在纳斯达克获得许可的体育博彩公司。“。\n公开上市的eSports娱乐集团总部设在马耳他。该公司表示，将把截至2022年6月30日的2022财年业绩指引从2500万美元上调至4200万美元。\n电子竞技娱乐集团专注于18岁以上的体育和游戏玩家。该集团拥有通过英国、爱尔兰、马耳他和库拉索岛的许可证在全球范围内进行在线博彩的许可证。它在Vie.gg网站上提供关于体育运动的幻想和赌注。该公司在银行的存款约为900万美元，市值约为5700万美元。\n约翰逊说：“这些收购为我们提供了技术平台，这些平台可能会对我们正在做的事情产生协同效应。”“我们肯定为每个人准备了一些东西，让他们保持参与度，让他们回来。”\n由Zack Johnson创立的GGCircuit是一家企业对企业软件公司，为游戏中心提供基于云的管理、锦标赛平台，并为企业客户提供集成钱包/销售点解决方案。它帮助公司运营他们的体育运动场。\n目前，这不是一项很好的业务，因为这个国家的大部分地区都关闭了。但GGCircuit和电子竞技娱乐集团(ESports Entertainment Group)正在展望更美好的时代。GGCircuit拥有1000多个互联地点，并与GameStop、戴尔、百思买和联想等企业以及俄亥俄州立大学、锡拉丘兹大学和北卡罗来纳大学等大学进行了合作。\nGGLeap产品在世界各地中心内的数万个公共游戏屏幕上的200多万独立游戏玩家的使用时间超过6000万小时。\nHelix eSports由墨菲·范德韦尔德(Murphy Vandervelde)创立，拥有五个ESPORTS娱乐中心。其中两家是美国五大此类设施之一。Helix提供各种体验，包括休闲游戏、竞技锦标赛、STEM编程、高中联赛、大型团体和ESPORTS训练营。\nHelix基于Unity的LANDuel将提供安全和规范的玩家对玩家下注机会。Helix的中心被设想为社交和竞技游戏玩家的目的地，同样拥有每月的锦标赛和可以为玩家创造公平竞争环境的技术。\nHelix还拥有Genji Analytics，这是一家面向游戏发行商和其他公司的面向esports的分析提供商。源氏使用计算机视觉、自然语言处理和机器学习工具，为广播和侦察目的提供数据。\n由威廉·科利斯(William Collis)创立的源氏与国际足联(FIFA)和NBA 2K联赛等领先的体育出版商和体育联盟合作，为联合、选秀和数据驱动的商业决策等活动提供动力。Genji还在Helix电子竞技中心推出了产品，利用闲置的计算能力和独特的专有数据源，创建定制的锦标赛体验。\nGenji的收入来源包括面向出版商和联盟的平台销售，并计划扩大到所有希望通过分析、公平竞争和花名册优化来增强游戏性的竞争对手。\nLANDuel目前正与新泽西州博彩执法部合作进行一项试点计划。如果这种型号在Helix电子竞技场所获得批准，LANduel可以通过GGCircuit网络扩展到美国各地的其他中心，并最终通过GGCircuit的专有家用产品套装进入游戏玩家的家中。\n电子竞技娱乐集团最近与AEG签署了一项协议，成为NHL的洛杉矶国王队和MLS的洛杉矶银河队的官方体育锦标赛提供商。\n约翰逊说：“我们认为我们将实现体育和传统体育的融合，我认为我们在这方面处于非常有利的地位。”\n电子竞技娱乐集团的电子竞技游戏联盟平台拥有35万注册用户。在交易之前，电子竞技娱乐集团(ESports Entertainment Group)有60多名员工，预计到年底还会增加60名员工。\n约翰逊相信，随着时间的推移，体育博彩业务将成为最大的业务，因为北美的市场还处于萌芽阶段。\n“这在很大程度上还处于早期阶段，”他说。我们认为这笔交易将帮助我们在ESPORTS娱乐中心推出基于玩家与玩家技能的博彩。“", "note_en": "Esports Entertainment Group has acquired  Helix eSports and  GGCircuit for $43 million in its quest to become an  esports and betting powerhouse.\n The publicly traded company is amassing a number of properties related to esports, but it is doing so with a unique approach by combining games, tournaments, and gambling. Other companies such as  Vindex and  GG Group are making big investments in esports as well, but none have amassed as large a collection of assets as Esports Entertainment Group, said CEO Grant Johnson in an interview with GamesBeat. On top of that, the betting side will likely generate revenue to keep the company going while it waits for long-term profits coming in from the growth of esports.\n  Ultimately, Esports Entertainment Group expects competitive gaming to become as big as traditional sports. That’s why Grant Johnson believes that sports team owners such as Robert Kraft, Mark Cuban, Jerry Jones, and Harris Blitzer Sports Entertainment have all made esports investments. Institutional investors are bullish, and that’s why investors are pouring a  billion dollars a year into the industry.\n “The large, smart sporting empires are investing hundreds of millions of dollars into esports. Esports has gone mainstream,” Johnson said. “Two years ago, if somebody said that esports tournaments are going to be broadcast on TV, you would have gotten a lot of eye-rolling. But that is what COVID has brought.”\n He claims the new acquisitions will make the company into the most diversified esports entertainment company. With the deals, the company is bringing together an enterprise software business, an analytics platform, and a player-vs.-player skill-based wagering platform. Those businesses will be coupled with Esports Entertainment Group’s overseas gambling business for betting on competitive gaming.\n With the acquisition of Helix eSports, Esports Entertainment is also picking up Helix’s Genji Analytics, which produces esports data.\n “We’re acquiring three operating entities — GGCircuits, Helix eSports, and Genji Analytics,” said Johnson. “It’s going to be transformative for us. This will give us multiple different revenue streams. We’re the only esports gambling company licensed on NASDAQ.”\n  Publicly traded Esports Entertainment Group is based in Malta. The company said it is raising its guidance for the fiscal year 2022 ending June 30, 2022, from $25 million in revenues to $42 million.\n Esports Entertainment Group is focusing on esports and gamers who are over 18. It has a license to conduct online gambling globally via licenses in the United Kingdom, Ireland, Malta, and Curacao. It offers fantasy and pools betting on esports at the site Vie.gg. The company has about $9 million in the bank, and it has a market value of about $57 million.\n “The acquisitions give us technology platforms that are potentially synergistic to what we’re doing,” Johnson said. “We have definitely got something for everyone, to keep them engaged and keep them coming back.”\n   GGCircuit, founded by Zack Johnson, is a business-to-business software company that provides cloud-based management for gaming centers, a tournament platform, and integrated wallet/point-of-sale solutions for enterprise customers. It helps companies run their physical esports locations.\n That’s not such a great business to be in at the moment, with much of the country shut down. But GGCircuit and Esports Entertainment Group are looking ahead to better times. GGCircuit has more than 1,000 connected locations and has worked with enterprises such as GameStop, Dell, Best Buy, and Lenovo as well as universities such as Ohio State, Syracuse University and, the University of North Carolina.\n The GGLeap product has over 60 million hours of usage by over 2 million unique gamers on tens of thousands of public gaming screens inside centers worldwide.\n   Helix eSports, founded by Murphy Vandervelde, owns five esports entertainment centers. Two of those are among the five largest such facilities in the U.S. Helix offers a variety of experiences including casual play, competitive tournaments, STEM programming, high school leagues, large groups, and esports bootcamps.\n And Helix’s Unity-based LANduel will enable safe and regulated player-vs.-player wagering opportunities. Helix’s centers are envisioned as destinations for social and competitive gamers alike with monthly tournaments and tech that can level the playing field for players.\n Helix also owns Genji Analytics, an esports-oriented analytics provider for game publishers and others. Genji uses computer vision, natural language processing, and machine learning tools, to provide data for broadcast and scouting purposes.\n Genji, founded by William Collis, works with leading esports publishers and sports leagues, such as FIFA and the NBA 2K League, to power activities like combines, drafts and data-driven business decisions. Genji has also launched products into Helix eSports Centers that create customized tournament experiences, leveraging both idle computing capacity and unique proprietary data sources.\n Genji’s revenue streams include platform sales to publishers and leagues with plans to expand to all competitive players looking to enhance their gameplay through analysis, fair competition, and roster optimization.\n  LANduel is currently with the New Jersey Department of Gaming Enforcement on a pilot program. If the model is approved at the Helix eSports locations, LANduel could be scaled to other centers throughout the U.S. across the GGCircuit network, and eventually into the homes of gamers through GGCircuit’s proprietary at-home product suite.\n Esports Entertainment Group recently signed a deal with AEG to become the official esports tournament provider to the NHL’s Los Angeles Kings and the MLS’ Los Angeles Galaxy.\n “We think we are going to have this convergence of esports and traditional sports, and I think we’re pretty well positioned there,” said Johnson.\n The Esports Entertainment Group’s Esports Gaming League platform has 350,000 registered users. Esports Entertainment Group had more than 60 employees before the deals, and it expects to add another 60 by year end.\n Over time, Johnson believes the esports gambling side of the business will become the largest, as the market is nascent in North America.\n “It’s very much in its early days,” he said. “We think this deal will help us launch player-vs.-player skill-based betting in the esports entertainment centers.”\n Skill-based betting is legal in 41 U.S. states, as it isn’t considered illegal gambling.\n  As for the effect on physical esports, Johnson said, “Things will eventually get back to normal. Whatever the new normal will be, we’re not sure. But right now, the vast majority of our activity is related to online esports. Even Helix’s physical esports operations are operating close to break-even.”\n You can&#39;t solo security\r\rCOVID-19 game security report: Learn the latest attack trends in gaming.  Access here", "posttime": "2020-10-27 09:05:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sports,esports,体育", "title": "ESports Entertainment Group斥资4300万美元收购了GGCircuit、Helix eSports和Helix的esports数据实体Genji Analytics，以扩大其esports产品组合", "title_en": "Esports Entertainment Group has acquired GGCircuit, Helix eSports, and Helix's esports data entity Genji Analytics, for $43M to expand its esports portfolio", "transed": 1, "url": "https://venturebeat.com/2020/10/26/esports-entertainment-group-acquires-helix-esports-and-ggcircuit-for-43-million/", "via": "", "real_tags": ["sports", "esports", "体育"]}, {"category": "", "categoryclass": "", "imagename": "331314f78f199ea09403613c1837bb6b.jpg", "infoid": 1031376, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2020财富传媒IP有限公司。版权所有。使用本网站即表示接受我们的使用条款和隐私政策|CA收集和隐私声明|请勿出售我的个人信息|Ad Choices Fortune是Fortune Media IP Limited的商标，在美国和其他国家/地区注册。“财富”杂志可能会因本网站上的一些产品和服务链接而获得补偿。报盘如有更改，恕不另行通知。引文至少延迟了15分钟。由Interactive Data提供的市场数据。晨星公司提供的ETF和共同基金数据。道琼斯条款和条件：http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html.。标准普尔指数数据是芝加哥商品交易所公司的财产。以及它的授权者。版权所有。条款和条件。由交互式数据托管解决方案提供支持和实施。", "note_en": "© 2020 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our  Terms of Use and  Privacy Policy |  CA Notice at Collection and Privacy Notice |  Do Not Sell My Personal Information |  Ad Choices  FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by  Interactive Data. ETF and Mutual Fund data provided by  Morningstar, Inc. Dow Jones Terms &amp; Conditions:  http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html. S&amp;P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved.  Terms &amp; Conditions. Powered and implemented by  Interactive Data Managed Solutions.", "posttime": "2020-10-27 09:04:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "增加,adds,提供", "title": "Zoom增加了对端到端加密的支持，但当它启用时，云录音、电话拨入和1：1私人聊天等几个功能将不起作用", "title_en": "Zoom adds support for end-to-end encryption, but when it's enabled several features like cloud recording, telephone dial-in, and 1:1 private chat will not work", "transed": 1, "url": "https://fortune.com/2020/10/26/zoom-encryption-end-to-end-how-to-turn-on-privacy/", "via": "", "real_tags": ["增加", "adds", "提供"]}, {"category": "", "categoryclass": "", "imagename": "3cd10a406af0c7e9885036eb42a6d0b2.jpg", "infoid": 1031374, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司今天宣布，未来几天将上调巴西、哥伦比亚、印度、印度尼西亚、俄罗斯和南非的App Store价格。价格变化会影响可用的应用程序和应用内购买，但苹果没有说明Apple Music和iCloud Subscription等服务是否也会调整价格。\n该公司简要解释说，由于当地货币的汇率，以及税收的增加，这些国家的价格已经进行了调整。苹果在其开发者网站上警告开发者即将到来的App Store定价变化：\n当税收或汇率发生变化时，我们有时需要在App Store上更新价格。在接下来的几天里，在巴西、哥伦比亚、印度、印度尼西亚、俄罗斯和南非，应用程序和应用程序内购买(不包括自动续订订阅)的价格将会上涨。\n具体地说，在印度，苹果表示，重新调整包括在现有18%的商品和服务税基础上再征收2%的均衡税。在印尼，对外国开发商征收10%的新税。冰岛和阿尔巴尼亚的价格也将调整，以与其他市场使用的价格保持一致，以美元和增值税销售。\n如果你是一名开发者，你现在可以在苹果开发者网站上访问这些国家的新价目表，以了解你的应用程序将受到怎样的影响。该公司没有具体说明新价格何时适用于用户。\n你现在就可以下载最新的价格层级图表。一旦这些更改生效，我的移动应用程序的定价和可用性部分将会更新，您的收益将进行相应的调整，并根据免税价格进行计算。您可以在App Store和Connect中随时更改您的应用和应用内购买(包括自动续订订阅)的价格。如果您提供订阅，则可以选择保留现有订阅者的价格。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Apple announced today that the App Store prices in Brazil, Colombia, India, Indonesia, Russia, and South Africa will be increased in the next days. Price changes affect the apps and in-app purchases available, but Apple doesn’t say if services like Apple Music and iCloud subscription will also have the price readjusted.\n  The company briefly explains that prices have been readjusted in these countries due to the exchange rate of local currencies, as well as an increase in taxes. Apple warned developers of the incoming App Store pricing changes on  its developer website:\n When taxes or foreign exchange rates change, we sometimes need to update prices on the App Store. In the next few days, prices of apps and in-app purchases (excluding auto-renewable subscriptions) on the App Store will increase in Brazil, Colombia, India, Indonesia, Russia, and South Africa.\n In India, specifically, Apple says the readjustment includes an equalization levy of 2% in addition to the existing goods and services tax of 18%. In Indonesia, there’s a new 10% tax for foreign developers. Prices will also be adjusted in Iceland and Albania to align with pricing used in other markets selling in US dollars with value-added tax.\n If you’re a developer, you can now access the  new price list for these countries on the Apple Developer website to find out how your apps will be affected. The company didn’t specify when the new prices will be applied for users.\n You can download the updated price tier charts now. Once these changes go into effect, the Pricing and Availability section of My Apps will be updated, and your proceeds will be adjusted accordingly and calculated based on the tax-exclusive price. You can change the price of your apps and in-app purchases (including auto-renewable subscriptions) at any time in App Store Connect. If you offer subscriptions, you can choose to preserve prices for existing subscribers.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-10-27 09:04:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,程序,俄罗斯,哥伦比亚", "title": "苹果称未来几天巴西、哥伦比亚、印度、印尼、俄罗斯和南非的应用程序和IAP的App Store价格将上调", "title_en": "Apple says App Store prices for apps and IAPs in Brazil, Colombia, India, Indonesia, Russia, and South Africa will increase in the next few days", "transed": 1, "url": "https://9to5mac.com/2020/10/26/apple-will-raise-app-store-prices-in-brazil-colombia-india-indonesia-russia-and-south-africa/", "via": "", "real_tags": ["apple", "苹果", "程序", "俄罗斯", "哥伦比亚"]}, {"category": "", "categoryclass": "", "imagename": "914c52dc57d098373e7096d974dd5569.png", "infoid": 1031373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "组织模式用于记笔记、维护待办事项列表、计划项目、创作文档、计算笔记本、识字编程等等-在一个快速有效的纯文本系统中。\n由Carsten Dominik于2003年创建，由Bastien Guerry维护，并由许多其他人开发。", "note_en": "Org mode is for keeping notes, maintaining to-do lists, planning projects, authoring documents, computational notebooks, literate programming and more — in a fast and effective plain text system.\n  Created by  Carsten Dominik in  2003, maintained by  Bastien Guerry and developed by  many others.", "posttime": "2020-10-27 08:54:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模式,mode,文本", "title": "组织模式的新站点", "title_en": "Org Mode's New Site", "transed": 1, "url": "https://orgmode.org", "via": "", "real_tags": ["模式", "mode", "文本"]}, {"category": "", "categoryclass": "", "imagename": "21500ffbecd61a3f73038f340e0ad208.png", "infoid": 1031372, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎!。我们很高兴您能考虑为2021年的MozFest举办一次会议！在下面你会找到所有你需要的信息来提议一次会议。\n我们欢迎就与值得信赖的人工智能和互联网健康运动相关的广泛主题举行会议，但所有会议都必须是参与性、可访问性和包容性的。欢迎您提交多个期次提案。\n这是你第一次向MozFest提交建议书吗？在我们的MozFest 101了解更多信息。\n参与式会议从一开始就吸引和激活了观众，让他们开始行动起来。\n在这本全面的主持人指南中，了解更多关于MozFest、会话策划过程以及如何设计参与式会话的信息。\n任何人都可以提交2021年MozFest的会议提案。只要你有一个很棒的项目、想法或主题，你就不需要任何特定水平的专业知识来促成一次会议。但是，如果您未满16岁，您的父母或监护人必须为您填写表格。\n是的，对于任何想要使用音频或视频记录提交的人，请发送电子邮件给我们，电子邮件地址是Festival@mozilla.org，我们将给您发送完整的问题列表来回答。\n我们创建了3种会话格式，以便我们能够了解您将提供哪种类型的会话，并了解您如何看待参与者与您的会话的互动。\n包括艺术展览、电影和视频或播客。可用于异步自导航体验。所有参与者可以随时探索这些体验。没有时间限制。\n会议的重点是以社交的形式将Mozfest社区聚集在一起。这可能包括健身或瑜伽课程，烘焙课程或游戏之夜。没有时间限制。\n同步现场会议为建立共同的理解、比较不同的经验和不同的观点、分享知识或提出集体愿景提供了空间。时间限制：60分钟。\n学员可以按照自己的日程安排体验学习课程，授课人员可以在一段设定的时间内开放办公时间或提出问题，还可以查看离线文档。时间限制：15分钟。\n举行同步的现场会议，允许团队协作处理一个项目，一起学习新技能，或者共同开发想法，共同解决问题。时间限制：60分钟。\n对于艺术、电影、播客和社交课程，您将看到建议书表格上列出了0分钟-如果您的课程被接受，我们将与您联系以确认时间。\nMozFest的参与者具有广泛的背景、年龄、能力、学科和专业水平。莫扎节观众的多样性是这个音乐节的独特之处。您可能有3到30名参与者预先注册您的课程。任何人，任何能力水平的人，都欢迎在活动期间参加会议。\n对于这个音乐节来说，2021年的MozFest将是非常不同的一年。今年提出的会议将作为我们虚拟节日的一部分，并将使用在线平台提供。\n为您的会话选择合适的空间。MozFest周末体验被组织成称为“空间”的主题部分。每个空间是一个会议、艺术装置和研讨会的集合，探索与互联网健康运动相关的问题和当前主题。您的课程提案应与您选择的空间相关并做出回应。\n您必须在活动前参加其中一个辅导员培训课程。这是为每个人提供便利的，无论是全新的音乐节还是以前在电影节上主持过一次会议的人。\n艺术节团队已经列出了5个小贴士，用来设计吸引人和包容的会议，这将给你和你的工作带来成功。\n提交您的提案后，您的姓名、组织和会议数据将使用PreTalx(我们的开源策展平台)作为策展过程的一部分公开展示。您提交的任何敏感信息(如您的电子邮件地址和可访问性要求)都将从公众视线中编辑，并且只能由我们的计划团队查看。\n为了帮助潜在的主持人提交他们尽可能好的会议提案，我们支持为每个提交提案的人提供机会。", "note_en": "Welcome! We are so excited you’re considering proposing a session for MozFest 2021! Below you’ll find all the info you need to propose a session.\n        We welcome sessions on a wide range of topics relevant to trustworthy AI and the internet health movement, but all sessions must be participatory, accessible, and inclusive. You are welcome to submit more than one session proposal.\n  Is this your first time submitting a proposal to MozFest? Learn more in our  MozFest 101\n  Participatory sessions engage and activate audience members from the start and gets them making and doing.\n  Learn more about MozFest, the session curation process, and how to design a participatory session in this comprehensive  Facilitator Guide.\n  Anyone may submit a session proposal for MozFest 2021. You don’t need any particular level of expertise to facilitate a session, as long as you have a great project, idea, or topic.  However, if you are under the age of 16 your parent or guardian must complete the form for you.\n   Yes, for anyone who would like to submit using an audio or video recording, please email us at festival@mozilla.org and we will send you the full list of questions to answer.\n   We have created 3 session formats so that we can understand what type of session you will deliver and understand how you see the participants interacting with your session.\n  Includes art exhibits, film &amp; video, or podcasts. Available for asynchronous self-navigating experiences.  Participants can explore these at any time. No time limit.\n  Sessions focused on bringing the MozFest community together in a social format. This could include a fitness or yoga session, baking classes or a games evening. No time limit.\n  Synchronous live sessions provides space for building shared understanding, comparing diverse experiences and divergent perspectives, sharing knowledge or surfacing collective vision. Time limit: 60 mins\n  Learning sessions participants can experience on their own schedule with the facilitator being accessible for open office hours or questions for a set period of time, as well as offline documentation. Time limit: 15 mins\n  Synchronous live sessions held that allow for the group to collaboratively work on a project, learn a new skill together or co-develop ideas, collectively problem solve. Time limit: 60 mins\n For the Arts, Films and Podcasts and Social sessions you will see 0 minutes listed on the proposal form - if your session is accepted we will be in contact to confirm the timing.\n   Participants at MozFest come with a wide range of backgrounds, ages, abilities, disciplines, and levels of expertise. The diversity of the MozFest audience is what makes the festival unique. You may have anywhere from 3 to 30 participants pre-register for your session. Anyone, of any ability level, is welcome to join the session during the event.\n   MozFest 2021 will be a very different year for the festival. Sessions proposed this year will take place as part of our virtual festival and will be delivered using an online platform.\n   Pick the right Space for your session. The MozFest Weekend experience is organized into thematic sections called “Spaces”. Each Space is a collection of sessions, art installations, and workshops exploring issues and current topics relevant to the internet health movement. Your session proposal should relate and respond to the Space you select.\n You must attend one of the facilitator training sessions before the event. This is for everyone facilitating, whether brand new to the festival or someone who has previously led a session at the festival.\n  The festival team have put together a list of  5 tips for designing engaging and inclusive session that will bring you and your work success.\n  After submitting your proposal, your name, organisation, and session data will be displayed publicly using  PreTalx (our open-source curation platform) as part of the curation process. Any sensitive information that you submit (such as your email address and accessibility requirements) are redacted from public view, and can only be seen by our programme team.\n  To help potential facilitators submit their best possible session proposals we  support opportunities for everyone submitting a proposal.", "posttime": "2020-10-27 08:48:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,人工智能,值得,proposals,会议", "title": "Mozilla MozFest 2021呼吁就值得信赖的人工智能和互联网健康提出建议", "title_en": "Mozilla MozFest 2021 call for proposals on trustworthy AI and internet health", "transed": 1, "url": "https://www.mozillafestival.org/en/get-involved/proposals/", "via": "", "real_tags": ["rust", "人工智能", "值得", "proposals", "会议"]}, {"category": "", "categoryclass": "", "imagename": "1d91fc1d1020119f160f2a2fa55ee82f.jpg", "infoid": 1031371, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你对仅仅为了使用虚拟现实耳机而不得不创建Facebook账户还不够不安，你应该知道，在某些情况下，删除一个链接的Facebook账户会让你无法访问你已经进行的任何Oculus购买。\n根据上传VR报告，目前，旧Oculus耳机的所有者-目前Oculus账户还不错-在新规则生效之前可以在2023年之前。这将要求该公司的所有VR硬件都必须拥有Facebook账户，而不仅仅是未来的头戴式耳机。当该规则发生更改时，任何选择将其Oculus帐户链接到其Facebook帐户，然后尝试删除后者的Oculus长期用户都将收到此警告：\n这包括您购买的应用程序和取得的成绩。你将无法再退还任何应用程序，并且将失去任何现有的商店积分。\n那太糟糕了！现在，将这些知识与Facebook增强和虚拟现实副总裁Andrew‘Boz’Bosworth上周说的话结合起来，“我认为人们应该继续确保他们的Facebook账户在购买耳机之前信誉良好。他们可以先解决这些问题，然后再去做。“。\nFacebook账号他妈的与任何人在电子游戏中使用虚拟现实耳机有什么他妈的关系？为什么我买来玩的视频游戏要与社交媒体账户捆绑在一起，以至于删除前者-对这个星球上的每个人来说越来越是一个好的、安全的想法-也会删除后者呢？\n我的意思是，我知道答案--Facebook最初收购Oculus的唯一原因是将其与该平台对数据和广告的痴迷联系在一起--但它仍然让人难以置信，这些习惯于在其他科技领域大肆挥霍的大型公司，怎么会一直把视频游戏搞得如此错误。\n这种内容丢失将适用于那些将自己的Oculus和Facebook账户链接起来，然后专门转移到Facebook账户的用户。至于那些目前只有Oculus账户，2023年不想要Facebook账户的用户，该公司告诉Upload VR，“随着我们接近于2023年结束对Oculus账户的支持，我们将更新那些选择不使用Facebook账户登录的现有用户。”\n卢克·普朗基特(Luke Plunkett)是澳大利亚堪培拉的一名高级编辑。他写了一本关于cosplay的书，设计了一款关于飞机的游戏，还经营着cosplay.kotaku.com。\n如果你对虚拟现实稍感兴趣，那就买个Windows混合现实耳机吧。他们到了第二代，现在比以前好多了。", "note_en": "In case you weren’t uneasy enough about   having to create Facebook accounts just to use a virtual reality headset, you should know that in some circumstances deleting a linked Facebook account will then remove your access to any Oculus purchases you have made.\n    As  Upload VR report, for now, owners of older Oculus headsets—currently existing just fine with Oculus account—have until 2023 before new rules kick. These will mandate a Facebook account for  all of the company’s VR hardware, not just future headsets. When that rule change takes place, any older, long-time Oculus users who have chosen to link their Oculus account to their Facebook account, then try to delete the latter, will be met with this warning:\n This includes your app purchases and achievements. You will no longer be able to return any apps and will lose any existing store credits.\n  That sucks! Now combine this knowledge with the words spoken by Andrew ‘Boz’ Bosworth, Vice President of Augmented and Virtual Reality at Facebook last week,   when he said, “I think people should continue to make sure their Facebook accounts are in good standing before they buy the headset. They can work through those problems before they do it.”\n What the fuck should a Facebook account’s standing have to do with anyone’s use of a virtual reality headset in video games? And why should video games I buy to play be tied to a social media account, to the point where deleting the former—  increasingly a good and safe idea for everyone on the planet—also removes the latter?\n  I mean, I know the answer—the only reason Facebook bought Oculus in the first place was to tie it into the platform’s obsession with data and advertising—but it still boggles the mind how these enormous companies, used to throwing their weight around in other tech spaces,   keep getting video games  so wrong.\n  This loss of content would apply to users who have linked their Oculus and Facebook accounts, and then moved exclusively over to a Facebook account. As for those who currently only have an Oculus account, and in 2023 don’t want a Facebook account, the company   told    Upload VR , “We’ll update existing users who choose not to log in with a Facebook account as we get closer to ending support for Oculus accounts in 2023.”\n Luke Plunkett is a Senior Editor based in Canberra, Australia.  He has written a book on cosplay, designed  a game about airplanes, and also runs  cosplay.kotaku.com.\n       Buy a Windows Mixed Reality headset if you’re even remotely interested in VR. They reached their second generation and are much better now than before.", "posttime": "2020-10-27 08:48:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,继续,continues", "title": "Facebook继续对Oculus账户胡说八道", "title_en": "Facebook Continues Its Bullshit with Oculus Accounts", "transed": 1, "url": "https://kotaku.com/facebook-continues-its-bullshit-with-oculus-accounts-1845478595", "via": "", "real_tags": ["facebook", "继续", "continues"]}, {"category": "", "categoryclass": "", "imagename": "29b91900e2d0df2c2865b1bacf4a9437.png", "infoid": 1031370, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "北极海冰融化季节通常从3月持续到9月。在9月份达到最小程度后，海冰在10月份开始回升。但今年的增长比去年慢了很多，有些地方几乎没有增长。这种不寻常的情况是如何发生的，它对2020/2021年冬季的天气有什么意义吗？\n北极海冰季节循环可以在下面的北极-Roos系统的图像中看到。它显示了北极海冰面积在一年内的变化。融化季节通常从3月份开始，在冰面达到顶峰后，一直持续到9月份。图表显示了过去几年的数据，其中我们可以看到，2020年北极冰层面积是第二低的，仅次于2012年，后者仍然保持着自有测量以来最低冰层面积的记录。\n但是对比2012年和2020年，我们可以看到，今年我们也在创造新的记录，因为北冰洋的海冰并没有像预期的那样恢复。海冰正在重新冻结，但速度比正常慢得多，这意味着一些地区严重落后。\n如果我们比较一下自1979年开始活跃的卫星观测以来的所有年份，这一点就更加明显。今年，我们观测到了有记录以来第二低的北冰洋海冰面积。但由于10月份的冰层增长异常低，目前的冰层面积现在是过去41年来任何一个10月的最低水平。\n比较过去17年的最小范围日期也显示，2020年的最低限度是第二低的，仅次于2012年的最低限度。图片由Zachary Labe提供。\n与当前日期相比，我们是一年中这个时候的最低水平。与长期平均值相比，第二张图像显示了海冰异常，这也证明了这一点。结果表明，2020年(红区)冰面异常继续增加，而前几年(白线)异常已经开始减少。\n下面由国家冰雪数据中心(NSIDC)提供的分析图像显示了当前冰层浓度和橙色线的平均/正常长期范围。这些橙色的线条显示了海冰在这个时间点应该到达多远，揭示了巨大的冰赤字。\n增长显然是从9月中旬开始的，但增长速度相当疲软，而且没有随着时间的推移而增加，这从下图最近的每日增长速度中可见一斑。在这一点上，每天的增长应该会随着时间的推移而缓慢增加，但我们可以看到每天的增长面积并没有增加，而是随着时间的推移几乎在减少。第二张图片显示了与前几年相比，10月份的增长，2020年严重落后于前几年\n下图显示了当前的海冰范围和厚度。我们可以看到，厚度比浓度显示出更大的面积。这是因为浓度只显示了浓度超过15%的海冰。低于这一点的任何东西都意味着冰层太碎裂，不够紧密。\n因此，海冰厚度图像显示，边缘周围有较薄的松散冰，低于15%的浓度阈值。这通常是正常的，因为新的海冰刚刚开始在边缘形成，需要时间才能变得更加紧密。但今年冰层不会压缩得那么快，我们现在就来看看这一不寻常事件背后的原因。\n北极地区实际上完全是一片海洋，没有大规模的陆地。它是世界五大洋中最小、最浅的，也是最冷的。它也是唯一一个比世界上面积最大的国家俄罗斯更小的海洋。\n下面的图片显示了北冰洋，就像它没有水一样，揭示了一个非常复杂的水下地形。要了解当前异常的海冰异常，我们需要了解所有冰都漂浮在哪里的海洋。更具体地说，我们需要了解其东部地区的海洋状况，即喀拉海、西伯利亚海和拉普特夫海。下图显示了北冰洋的这些区域，它们位于格陵兰岛的对面。这张图来自最近的一项北冰洋研究。\n下图可能是迄今为止最重要的一张，因为它显示了海洋表面温度异常。它显示，目前整个北极冰盖周围的海洋温度远远高于正常水平。在我们上面提到的所有三个关键海洋区域都可以发现超过2-3摄氏度的异常。\n与去年同期相比，今年大西洋一侧实际上更冷，而北冰洋东部则明显比去年同期暖和得多。\n再看看原始温度，我们可以看到，北冰洋东部的表面温度实际上是正的，这意味着在这一点上结冰的可能性很低，甚至为零。在正常情况下，到10月底，几乎整个北冰洋都应该达到或低于冰点-0°C(黑色)。\n当将目前的冰层浓度和厚度与9月中旬的最低冰层范围进行比较时，我们可以看到边缘的增长。但在西伯利亚，我们实际上可以看到浓度降低，厚度降低(红色)。目前，海洋和气温还不适合让西伯利亚迅速重新结冰。\n但温度并不是这里的唯一因素。海洋盐度在冰的产生中也起着很大的作用。水越咸，冰形成所需的温度就越低。想象一下在道路上使用盐来防止结冰。\n下图显示了北冰洋的盐度，在那里我们可以看到蓝色的淡水和棕色的咸水。从北大西洋向北冰洋，特别是向东部输送更咸的水是显而易见的。有趣的是，我们可以看到沿海地区周围的深色，这是非常淡水。这是西伯利亚河流的淡水排放。\n我们制作了一个简短但非常酷的高分辨率视频动画，展示了过去5个月北冰洋的盐度。你可以看到海洋环流，洋流，以及从北大西洋运来的咸水。还要注意从西伯利亚一侧进入北极的淡水，因为河流流入海洋，并注意到夏季淡水的增加，因为融化的冰使地表水域更加新鲜。\n自9月中旬的最低点以来，许多地区已经重新结冰。但正如我们上面所展示的，北冰洋东部异常温暖，阻止了海冰的快速膨胀。\n下图显示了北极不同地区的海冰范围。虽然一些地区通常会在较晚的日期开始冻结，但有3个地区比较突出，因为它们应该比目前高得多。西伯利亚海地区、喀拉海和拉普特夫海。这些是我们在文章中较高位置强调的区域，它们也面临着最大的温度异常。\n看看西伯利亚北极地区，它正在努力增加冰层的面积。对于一年中的这个时候来说，海冰面积真的非常低，只有这个日期预计正常海冰面积的几%。\n当然，拉普特夫海已经处于历史最低水平很长一段时间了。在过去的十年里，拉普特夫海在一年中的这个时候已经完全结冰，而今年它根本无法升空。\n但是，是什么导致了北冰洋东部的这种不寻常的情况呢？我们已经看到了海洋温度异常和海洋盐度。但是是什么让北冰洋变成这样的呢？部分答案在于大气层，这是我们下一步要去的地方。\n在大气层中，我们通常总是从温度开始。看一到九月份，我们可以看到，西伯利亚和北冰洋东部已经形成了一个热点。我们可以看到大片地区的气温比长期平均水平高出4-5摄氏度。我们写了关于这些北极热浪的报道，这些热浪自春季以来一直在进行。\n仔细观察8月至9月期间，就会发现一个更强大的热点，现在已经进一步扩展到北冰洋，因为海冰融化，更多的开阔水域暴露在温暖的天气中。\n这种异常现象背后的原因是一种非常特殊的压力模式。到目前为止，10月份的分析显示，高压区主导着北极地区，而我们可以看到西伯利亚一侧的低压系统。\n这种模式在北冰洋东部形成了一种非常独特的跨极气流。下图显示的是10月到目前为止的平均低层风量。我们可以看到穿越北极的空气运输，因为温暖的空气从一边进入北极，而更冷的空气从另一边离开。\n到目前为止，看看10月份的温度异常，我们实际上可以看到西伯利亚北极地区的大规模温暖异常。这就是暖空气进入该地区的地方，取代了进入西伯利亚西部的冷空气。\n具体地说，在过去的10天里，西伯利亚北冰洋出现了超过15摄氏度的异常。这一点，加上变暖的海水，在10月份到目前为止一直是冰生长的一个很大的抑制因素。\n天气预报看起来也好不到哪里去。压力模式现在实际上已经逆转，北极上空的压力较低。但这会改变气流的方向，只会从另一个来源地区带来更温暖的空气。第一张图片显示的是下周末的气压异常。第二张图片显示了风向和温度异常，揭示了进入西伯利亚北极的大范围变暖的空气输送。\n但当然，这并不意味着10月份将在整个北极地区测量+20摄氏度的温度。例如，西伯利亚地区的正常温度应该在-15°C左右，如果这一波的温度将在0-2°C左右，那仍然比长期平均温度高出13-15°C。\n这就是我们在上面最后一张温度图像上看到的。但尽管如此，这样的异常意味着北极在这个时间点上并不像它应该的那样冷，这为冰的增长创造了抑制条件。\n下图显示了预测的9天海冰范围和厚度变化。我们可以看到海冰正在向西伯利亚扩张，但西伯利亚北极和拉普特夫海仍然非常不结冰。\n预测2020年11月的CFSv2模型显示，海冰缓慢扩张，冰层浓度异常低(红色)向西伯利亚一侧延伸至11月。", "note_en": "Arctic sea ice melt season usually lasts from March till September. After reaching the minimum extent in September, sea ice starts to grow back in October. But this year, the growth is much slower than last year, with almost no growth in some places. How did this unusual situation happen and can it mean something for the weather towards Winter 2020/2021?\n  The Arctic sea ice seasonal cycle can be seen in the image below from the Arctic-ROOS system. It shows the Arctic sea ice extent change over a year. The melt season usually starts in March, after the peak ice extent is reached, lasting all the way to September. The graph shows the last few years of data, where we can see the 2020 Arctic ice extent was second-lowest, only behind 2012, which still holds the record for the lowest ice extent since measurements began.\n  But comparing 2012 and 2020, we can see that this year we are also setting a new record, as the Arctic sea ice is not recovering as expected. The sea ice is refreezing back, but at a much slower rate than normal, meaning that some areas are severely falling behind.\n  That is even more evident when we look at the comparison of all the years since the active satellite observations began in 1979. This year we observed the second-lowest Arctic sea ice extent on record. But because of the unusually low ice growth in October, the current ice extent is now the lowest for any October in the past 41 years.\n  Comparing the minimum extent dates for the past 17 years also shows the 2020 minimum to be second lowest, trailing only the grand minimum of 2012. Graphic provided by  Zachary Labe.\n  Comparing the years by the current date, we are well the lowest for this time of year. That is also evident by the second image, which shows the sea ice anomaly, compared to the long-term average. It shows the 2020 (red area) ice extent anomaly to continue to increase, while in the previous years (white lines), the anomaly already started to decrease by this point.\n   The analysis image by the National Snow and Ice Data Center (NSIDC) below, shows the current ice concentration and the average/normal long term extent in orange lines. Those orange lines show how far the sea ice should be reaching at this point in time, revealing a huge ice deficit.\n  Growth has obviously begun since mid-September, but the rate was rather weak and is not increasing with time, evident by the recent daily increase rate on the image below. At this point, the daily growth should slowly increase over time, but we can see the daily growth area is not increasing and has rather been almost decreasing over time. The second image shows the October growth compared to previous years, where 2020 is severely trailing behind\n   Images below show the current sea ice extent and thickness. We can see that the thickness shows a larger area than the concentration. That is because the concentration shows only the sea ice above 15% concentration. Anything below that means the ice is just too fractured and not compact enough.\n So the sea ice thickness image reveals that there is thinner uncompacted ice around the edges, which falls below the 15% concentration threshold. This is usually normal because new sea ice is just starting to form on the edges and takes time to get more compact. But this year the ice is not compacting so fast, and we are now going to look at what is behind this unusual event.\n    The Arctic region is in fact entirely an ocean and has no large-scale landmass. It is the smallest and shallowest of the world’s five major oceans, and also the coldest. It is also the only ocean smaller than the largest country in the world by area, Russia.\n The image below shows the Arctic ocean, as it would look without water, revealing a very complex underwater terrain. To understand the current unusual sea ice anomalies, we need to understand the ocean where all the ice floats on. More specifically, we need to understand the state of the ocean in its eastern region, in the Kara Sea, Siberian Sea, and the Laptev Sea. The image below shows these regions in the Arctic Ocean, found on the side opposite to Greenland. The graphic is from one of the more recent Arctic Ocean  studies.\n  The image below is probably the most important one so far, as it shows the ocean surface temperature anomaly. It shows the ocean temperatures are currently well above normal around the entire Arctic ice sheet. Anomalies of over 2-3 degrees Celsius can be found across all the 3 critical ocean regions we mentioned above.\n  Compared to this time last year, the Atlantic side is actually colder this year, while the eastern Arctic Ocean is obviously much warmer than it was this time last year.\n  Also looking at the raw temperatures, we can see the eastern Arctic ocean is actually in positive surface temperatures, which means a low to zero chance of freezing over at this point. In normal conditions, almost the entire Arctic ocean should be at or below the freezing point – 0°C (black color) by the end of October.\n  When comparing the current ice concentration and thickness with the lowest ice extent in mid-September, we can see the growth on the edges. But towards Siberia, we can actually see a reduced concentration and reduced thickness (red colors). Ocean and air temperatures were not yet right to allow rapid refreeze towards Siberia at present time.\n   But temperature is not the only factor here.   Ocean salinity also plays a big role in the production of ice. The saltier the water, the colder it needs to get for ice to form. Think of salt being used on the roads to prevent ice buildup.\n The image below shows the Arctic ocean salinity, where we can see the fresher water in blue colors, and saltier waters in brownish hues. Transport of saltier water is obvious from the North Atlantic into the Arctic Ocean, specifically towards the eastern parts. Interestingly, we can see the dark colors around the coastal areas, which is very fresh water. That is the freshwater discharge from the Siberian rivers.\n  We produced a short but very cool high-resolution video animation, which shows the Arctic ocean salinity in the past 5 months. You can see the   ocean circulation,   ocean currents, and the   saltier water transport from the North Atlantic. Also note the freshwater entering the Arctic from the Siberian side, as the rivers discharge into the ocean, and note the freshwater increase during Summer, as melting ice makes the surface waters fresher.\n    Many regions have regained ice since the lowest point in mid-September. But as we have shown above, the east Arctic Ocean is unusually warm and prevents fast sea-ice expansion.\n The image below shows the sea ice extent by various regions across the Arctic. While some regions normally start the freezing at a later date, there are 3 regions that stand out, as they should be much higher than they currently are. The   Siberian Sea region, the   Kara Sea, and the   Laptev Sea. These are the regions that we have highlighted higher up in the article, which also face the biggest temperature anomalies.\n  Looking at the Siberian Arctic region, it is struggling to increase the ice extent. It is running really unusually low for this time of year, having just a few % of the normal sea ice extent expected for this date.\n  And of course, the Laptev Sea, which has been at record low levels for quite some time now. In the previous decade, the Laptev Sea has been entirely frozen over by this time of year, while this year it simply cannot lift off the ground.\n  But what is causing this unusual situation in the eastern Arctic Ocean? We have seen the ocean temperature anomalies and ocean salinity. But what has brought the Arctic Ocean into this state? Part of the answer lies in the Atmosphere, which is where we are heading next.\n  In the atmosphere, we usually always start with the temperatures. Looking at the January-September period, we can see that a hotspot has developed right over Siberia and the eastern Arctic Ocean. We can see a large area of temperatures 4-5°C above the long term average. We wrote about these  Arctic heatwaves, which were ongoing since Spring.\n  A closer look at the August-September period reveals an even stronger hotspot, now expanded further into the Arctic Ocean, as the sea ice melted and more open water was exposed to the warmer weather.\n  The reason behind this anomaly was a very specific pressure pattern. The October analysis so far, shows the high-pressure area dominating the Arctic region, while we can see a low-pressure system over the Siberian side.\n  Such a pattern creates a very unique transpolar airflow over the eastern Arctic Ocean. The image below shows the average low-level wind flow in October so far. We can see the air transport across the Arctic, as warmer air enters the Arctic from one side, and cooler air leaving out on the other side.\n  Looking at temperature anomalies in October so far, we can actually see a massive warm anomaly across the Siberian Arctic. That is where the warmer air was entering the region, replacing the colder air moving out into western Siberia.\n  The past 10 days specifically, have seen anomalies in excess of 15°C across the Siberian Arctic ocean. This, together with the warmer ocean waters, has been a large ice growth inhibitor so far in October.\n  The forecast is not looking any better. The pressure pattern has now actually reversed, with lower pressure over the Arctic. But this will change the airflow direction, just bringing warmer air from another source region. The first image shows the pressure anomalies next weekend. The second image shows the wind direction and temperature anomalies, revealing a large scale warmer air transport into the Siberian Arctic.\n   But of course, this does not mean that +20°C temperatures will be measured across the Arctic in October. The normal temperatures for the Siberian region for example should be around -15°C. If the temperatures in this wave will be around 0 to -2°C, that is still 13-15°C above the long-term average.\n This is what we are seeing on the last temperature image above. But still, such anomalies mean that the Arctic is not as cold as it is supposed to be at this point in time, creating inhibiting conditions for ice growth.\n The images below show the forecast 9-day sea ice extent and thickness change. We can see the expansion of sea ice towards Siberia, but the Siberian Arctic and the Laptev sea are still running very ice-free.\n   The CFSv2 model forecast for November 2020 shows the slow expansion of sea ice, with unusually low ice concentration (red colors) towards the Siberian side, extending into November.", "posttime": "2020-10-27 08:48:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sea,显示", "title": "北极海冰在10月份没有结冰-这是自开始测量以来的第一次", "title_en": "Arctic Sea Ice not freezing In October – first time since measurements began", "transed": 1, "url": "https://www.severe-weather.eu/news/arctic-ocean-sea-ice-2020-jet-stream-effect-winter-fa/", "via": "", "real_tags": ["sea", "显示"]}, {"category": "", "categoryclass": "", "imagename": "380b9ae565ff33e093e2794c7ce0e0f5.jpg", "infoid": 1031368, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如承诺的那样，微软宣布已经为iPadOS版本的Microsoft360添加了全面的触控板和鼠标支持。这包括Word、Excel和PowerPoint，这标志着苹果长期以来努力模糊平板电脑和台式机之间的界限，让iPad变得更加全面的生产力机器，迈出了重要的一步。\n苹果在3月份发布了iPadOS 13.4，奠定了基础。与最新的iPad Pro一起发布的这项技术引入了将触摸板或鼠标与平板电脑配对的能力，并带来了屏幕上的光标。罗曼在这里更详细地分析了它。随着新的平板电脑和操作系统的升级，出现了一款内置触摸板的(昂贵的)新键盘。\n微软今天的升级建立在此基础上，当在最新的iPad、iPad Pro和iPad Air上使用其生产力工具时，提供了更像桌面的体验。它可以用于标准的Office功能，如突出显示文本、在Excel中选择区域单元格和调整图形大小。以前可以做的事情，但对于习惯于在笔记本电脑/台式机上做这些事情的人来说，一种更熟悉的方法肯定会让他们受益。\n此次更新带来了一些其他功能，包括更清晰的界面和新组织的菜单。根据微软的说法，所有这些都应该在“几周内”向用户推出。", "note_en": "As promised,  Microsoft   announced that it has added full trackpad and mouse support for the iPadOS version of Microsoft 360. That includes Word, Excel and PowerPoint, marking another important step in Apple’s longstanding push to blur the line between tablet and desktop, making iPads more well-rounded productivity machines.\n Apple   laid the foundation back in March, with the release of iPadOS 13.4. Announced alongside the latest iPad Pro, the technology introduced the ability to pair a trackpad or mouse with the tablet, bringing an on-screen cursor.  Romain breaks it down more fully here. Along with the new tablet and operating system upgrade came a new (pricey) keyboard sporting a built-in trackpad.\n   Today’s  upgrade from Microsoft builds on that, offering a more desktop-like experience when using its productivity tools on the latest iPad, iPad Pro and iPad Air. It can be used for standard Office things, like highlighting text, selecting range cells in Excel and resizing graphics. Stuff that was possible before, but will definitely benefit from an approach more familiar to anyone who’s used to doing these things on a laptop/desktop.\n The update brings a handful of other additions, including a clearer interface and newly organized menus. All should be rolling out to users “within a couple of weeks,” per Microsoft.", "posttime": "2020-10-27 06:35:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,office,ipad", "title": "\nMicrosoft Office为iPad提供鼠标和触摸板支持", "title_en": "\n\t\t\t\tMicrosoft Office gets mouse and trackpad support for the iPad\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/microsoft-office-gets-mouse-and-trackpad-support-for-the-ipad/", "via": "", "real_tags": ["microsoft", "office", "ipad"]}]