[{"category": "", "categoryclass": "", "imagename": "de9f4d3f976117ca7f671bcf5ee5914b.jpg", "infoid": 1032491, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比特币白皮书到底做对了什么，错了什么，我们还不知道什么。\n约瑟夫·博诺(Joseph Bonneau)是纽约大学(New York University)助理教授，也是广受欢迎的教科书《比特币和加密货币技术》的合著者。\n这篇独家评论文章是CoinDesk《比特币在10：智史白皮书》系列的一部分。\n比特币白皮书理所当然地被认为是历史上最具原创性和影响力的计算机科学论文之一。\n但是，值得对这篇论文(以及论文中省略的最初比特币设计的元素)进行批判性的审视，问一问这篇论文到底做对了什么？它出了什么问题？还有哪些问题我们还不知道答案呢？\n一个真正成功的想法的一个标志是，我们忘记了在这个想法出现之前，人们是如何看待这个世界的。比特币的许多最基本的贡献似乎只有在事后才显而易见。\n人们很容易忘记，加密货币在本世纪头十年的大部分时间里都是一片研究死水。在20世纪90年代建立工作系统的多次尝试失败后(主要使用了David Chaum在20世纪80年代概述的想法)，该地区几乎没有发表论文。许多人只是简单地认为非国家货币没有可行的市场。\n在比特币出现之前，去中心化系统是本世纪头十年的一个活跃研究领域(通常被描述为点对点网络)，匿名研究开始发挥作用(随着Tor和其他系统的发展)。\n但这些并不被视为支付系统的必要功能。比特币贡献了什么？\n对矿工的激励措施。比特币的核心贡献之一是通过通胀和收费为矿工提供激励。这种模式总体上是成功的，公平地说，很少有人预见到它的到来。在比特币时代之前，许多提供开放参与(任何人都可以运行一个节点)的P2P系统都受到Sybil攻击和其他问题的困扰。人们曾多次尝试激励诚实参与，但在比特币之前，没有一个系统能让它真正发挥作用。\n轻客户端。事实证明，比特币对全节点和轻(或SPV)节点的支持都相当强大，嵌入到比特币中的区块结构使实现轻客户端不仅成为可能，而且很自然。\n编写脚本。虽然有限，但比特币的脚本支持(白皮书中根本没有讨论)已经实现了几个有用的功能，比如多签名账户和支付网络。设想一个不仅仅支持简单支付的系统是明智的。\n认识到长期激励措施。智史没有预料到工业规模的采矿或矿池，至少白皮书中没有提到。但这篇论文确实包含了一句关于中央集权风险的非常有先见之明的话：“(攻击者)应该发现遵守规则比破坏系统和自己财富的有效性更有利可图，这些规则有利于他拥有比其他任何人加起来都多的新硬币。”尽管自那以后，人们写下了大量矿工的理论攻击，但没有一次认真地尝试实践。Satoshi认识到了一个强有力的原则-矿工们有长期的动机不去攻击，因为他们投资于生态系统的健康。\n我们将忽略比特币代码早期版本中一些奇特的回顾功能，如付费IP地址和内置电子商务系统，这些功能从未面世。\n但比特币的几个特征似乎是“错误的”，因为今天建立的任何系统都不应该重复这些特征。\nECDSA。虽然这种签名算法比RSA要好得多，但它在所有方面都不如EC-Schnorr。很可能中本聪只是不知道这个选项(施诺尔留下的软件专利遗产)。今天，考虑到Schnorr对门限签名的支持(如果不是更高级的签名方案，如BLS)，使用Schnorr显然是有利的。\n事务延展性。这个无意的问题导致了支付网络等协议令人头疼，并以启用对mt的攻击而闻名。戈克斯。今天，谨慎的设计应该使用隔离见证(SegWit)之类的东西来确保事务散列是不可延展的。\n之后添加的功能。很明显，不包括诸如Pay-to-Script-Hash(P2SH)和Check-locktime-Verify这样的流行特性是错误的，这些特性后来都是由软叉添加的。\n硬币的有限分割性。比特币的限制是2100万个比特币，但更重要的是，它的原子单位限制在2^52个左右。如果比特币真的成为地球上唯一的支付系统，这将为每个人提供不到100万个单位的支付。这远远不足以涵盖日常交易(甚至四舍五入到相当于十分之一美元)和大额持有量。用几十个额外的比特来扩展这一点将是相当便宜的，这样可分性就永远不会成为问题。\n简单链中的块。鉴于“区块链”已经成为了一个流行词，值得注意的是，将块放在线性链中是一项疏忽，这使得超轻量级客户端验证旧块是否包括在当前链中的成本很高。比特币正确地将交易放入了一棵树中，那么为什么不是区块本身呢？跳过列表将是另一个重大改进。有趣的是，证书透明项目(同时代独立于比特币设计)做到了这一点，并将每次更新都放入一棵树中，而比特币的后继者几乎没有偏离线性链设计。\n没有州政府的承诺。比特币矿工都将系统状态作为一组未花费的交易输出(UTXO)进行跟踪。但这并不是针对每个区块的，必须从历史中归因于此。这使得轻型客户端很难确认当前状态以及事务是否已花费。将UTXO承诺添加到每个块相当容易，许多后续系统(如Etherum)都会执行此操作的一个版本。\n攻击分析过于简单化。比特币白皮书用了相对较大的篇幅(约占正文的四分之一)来分析一名采矿力不足51%的矿工靠运气成功推出叉子的几率。随后的分析已经确定了许多其他攻击载体(例如自私挖掘)，而这种分析现在看起来已经过时了。\n一个CPU一票。Satoshi将比特币描述为一个系统，在这个系统中，大多数参与者将是使用CPU的矿工。多年来，情况并非如此，因为采矿由专用硬件主导。虽然ASIC挖掘是一个好的发展还是坏的发展还存在争议，但它肯定不是原始白皮书中所强调的。\nSHA-256个拼图。比特币使用基于散列的计算难题(“工作证明”)一直是最活跃的争论话题之一。它会消耗太多的能量吗？ASIC是否鼓励集中化？为基于GPU的挖掘或存储受限的挖掘设计的谜题会以更低的成本产生更好的激励措施吗？利害关系证明最终会胜出吗？\n块大小和其他参数限制。至少可以说，1MB的块限制一直是争论的来源，块之间的10分钟间隔(在较小程度上)也是如此。许多后续系统随着更大或更频繁的阻塞而蓬勃发展。从长远来看，比特币的保守设计会被证明是明智的吗？\n匿名。由于交易图分析的发展，白皮书中概述的关于比特币提供匿名性的论点现在已知是不完整的，因为只发布了公钥。保密交易(Confidential Transaction)、Monero或ZCash等系统提供了更强的加密隐私。另一方面，已经提出了许多向后兼容的方案，通过混合来混淆比特币区块链上的活动。匿名性是需要比特币忽视的内置支持的关键功能吗？\n通货膨胀。比特币的设计旨在避免通货膨胀，但许多经济学家指出，比特币实际上是通缩的，因为最终只有在钥匙丢失(或者硬币被故意通过“烧焦证明”交易而无法消费)的情况下，硬币才能退出流通。零通胀实际上需要少量的新货币发行，才能跟上货币损失的步伐。如果这是比特币的一个错误，随着通胀慢慢消退，我们可能很多年都不会意识到这一点。\n改用交易手续费。比特币硬编码了一个缓慢的过渡，从主要通过通胀来奖励矿工，到主要通过交易费来奖励他们。没有人知道这将如何发展，但一些研究表明，这可能会在后通胀世界造成严重的不稳定。\n可编程性有限。比特币对其可编程性施加了严格的限制，以保持交易容易(且成本可预测)进行验证。Etherum项目已经显示出对更丰富的编程模型的巨大需求，尽管它的模型引入了额外的可伸缩性问题。从长远来看，比特币会不会因为其较弱的编程模式而受到阻碍？\nCoinDesk是区块链新闻的领先者，是一家努力追求最高新闻标准并遵守一套严格的编辑政策的媒体渠道。CoinDesk是数字货币集团(Digital Currency Group)的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "What Bitcoin’s White Paper Got Right, Wrong and What We Still Don’t Know\n Joseph Bonneau is an assistant professor at New York University and co-author of “Bitcoin and Cryptocurrency Technologies,” a popular textbook.\n This exclusive opinion piece is part of CoinDesk’s “  Bitcoin at 10: The Satoshi White Paper” series.\n  The Bitcoin white paper has been, rightfully, recognized as one of the most original and influential computer science papers in history.\n  But it’s worth turning a critical eye on the paper (and elements of the original Bitcoin design omitted from the paper) to ask what did the paper get right? What did it get wrong? And what questions do we still not know the answer to?\n   One mark of a truly successful idea is that we forget how people thought about the world before that idea came around. Many of the most fundamental contributions of Bitcoin seem obvious only in hindsight.\n It’s easy to forget that cryptocurrency was a research backwater for most of the 2000s. After the failure of many attempts in the 1990s to build a working system (largely using the ideas outlined by David Chaum in the 1980s), few papers were published in the area. Many simply believed there was no viable market for a non-state currency.\n Prior to Bitcoin, decentralized systems were an active research area in the 2000s (often described as peer-to-peer networks) and anonymity research was coming into its own (with the development of Tor and other systems).\n But these were not seen as necessary features for a payment system. What did Bitcoin contribute?\n Incentives for miners. One of Bitcoin’s core contributions is providing incentives for miners via inflation and fees. This model has generally been successful and it’s fair to say few saw it coming. Many P2P systems in the pre-Bitcoin era that offered open participation (anybody can run a node) were plagued by Sybil attacks and other problems. There were many attempts to incentivize honest participation, but prior to Bitcoin no system quite got it to work.\n Light clients. Bitcoin’s support for both full nodes and light (or SPV) nodes has proven quite powerful, and the block structure embedded into Bitcoin has made it not just possible but natural to implement a light client.\n Scripting. While limited, Bitcoin’s scripting support (not discussed at all in the white paper) has enabled several useful features like multi-signature accounts and payment networks. It was wise to envision a system supporting more than simple payments.\n Recognizing long-term incentives. Satoshi didn’t anticipate industrial-scale mining or mining pools, at least not  in the white paper. But the paper does include a very prescient line about the risks of centralization: “[an attacker] ought to find it more profitable to play by the rules, such rules that favour him with more new coins than everyone else combined, than to undermine the system and the validity of his own wealth.” Despite a large number of theoretical attacks by miners being written about since, none have been seriously attempted in practice. Satoshi recognized a powerful principle – that miners have long-term incentives not to attack since they are invested in health of the ecosystem.\n  We’ll ignore some quaint-in-retrospect features in early versions of the bitcoin code, such as pay-to-IP-address and a built-in e-commerce system, that never saw the light of day.\n But there are several features of Bitcoin that appear “wrong” in that no system built today should repeat them.\n ECDSA. While this signature algorithm was a far better choice than, say, RSA, it is inferior to EC-Schnorr in all aspects. Most likely Satoshi simply didn’t know about this option (a legacy of software patents around Schnorr). Today, it would be clearly advantageous to use Schnorr instead given its support for threshold signing, if not a more advanced signature scheme such as BLS.\n Transaction malleability. This unintentional issue has led to headaches for protocols such as payment networks as well as famously enabling the attack on Mt. Gox. Today a prudent design would use something along the lines of segregated witness (SegWit) to ensure transaction hashes are non-malleable.\n Features since added. Quite obviously, it was a mistake not to include popular features such as pay-to-script-hash (P2SH) and check-locktime-verify, which have been added since by soft forks.\n Limited divisibility of coins. Bitcoin has a limit of 21 million bitcoins, but more importantly, it has a limit of about 2^52 satoshis as the atomic unit. If Bitcoin were to really become Earth’s only payment system, this would provide fewer than a million units per human being. This isn’t nearly enough to capture both day-to-day transactions (even rounded to the equivalent of tenths of a dollar) and also large holdings. It would have been quite cheap to expand this with a few dozen extra bits such that divisibility would never be an issue.\n Blocks in a simple chain. Given how much of a buzzword “blockchain” has become it’s worth noting that putting blocks in a linear chain is an oversight that makes it costly for an ultra-lightweight client to verify that an old block is included in the current chain. Bitcoin correctly puts transactions into a tree, so why not the blocks themselves? A skip list would be another major improvement. Interestingly, the Certificate Transparency project (designed independently of Bitcoin in the same era) gets it right and puts each update into a tree, while few successors to Bitcoin have strayed from the linear chain design.\n No state commitments. Bitcoin miners all track the system state as the set of unspent transaction outputs (UTXOs). But this is not committed to each block and must be imputed from history. This makes it hard for light clients to confirm what the current state is and if the transaction has been spent. It would be quite easy to add a UTXO commitment to each block and many subsequent systems (such as Ethereum) do a version of this.\n Simplistic attack analysis. The Bitcoin white paper devotes a relatively large amount of space (about a quarter of the text) to analyzing the chances of a miner with less than 51% mining power successfully launching a fork by getting lucky. Subsequent analysis has identified many other attack vectors (such as selfish mining) and this analysis now looks dated.\n One-CPU-one-vote. Satoshi described Bitcoin as a system where most participants would be miners using their CPUs. This has not been the case for many years now as mining is dominated by dedicated hardware. While it’s debatable if ASIC mining is a good or bad development-it’s certainly not what was pitched in the original white paper.\n  SHA-256 puzzles. Bitcoin’s use of hash-based computational puzzles (“proof-of-work”) has been one of the most active topics of debate. Does it consume too much energy? Do ASICs encourage centralization? Would puzzles designed for GPU-based mining or storage-bounded mining produce better incentives at lower cost? Will proof-of-stake eventually win out?\n The block size and other parameter limits. To say the least, the 1 MB block limit has been a source of debate, as has been (to a lesser extent) the 10-minute interval between blocks. Many follow-up systems have thrived with larger or more frequent blocks. Is Bitcoin’s conservative design going to prove wise in the long run?\n Anonymity. The arguments sketched in the white paper about Bitcoin providing anonymity as only public keys are posted are now known to be incomplete due to the development of transaction-graph analysis. Systems such as Confidential Transactions, Monero or Zcash offer stronger cryptographic privacy. On the other hand, many backwards-compatible schemes have been proposed to obfuscate activity on the Bitcoin blockchain by mixing. Is anonymity a critical feature requiring built-in support that Bitcoin overlooked?\n Inflation. Bitcoin’s design seeks to avoid inflation, but many economists have pointed out it is actually deflationary, as eventually coins can only exit circulation when keys are lost (or coins are intentionally made unspendable via “proof-of-burn” transactions). Zero inflation actually requires a small amount of new currency issuance just to keep pace with lost currency. If this was a mistake in Bitcoin, we may not realize it for many years as inflation is slowly wound down.\n The switch to transaction fees. Bitcoin hardcoded a slow transition from rewarding miners primarily by inflation to rewarding them primarily via transaction fees. Nobody knows how this will play out but some research suggests that this may cause significant instability in the post-inflation world.\n Limited programmability. Bitcoin imposed severe limits on its programmability to keep transactions easy (and predictable in cost) to verify. The Ethereum project has demonstrated significant demand for a richer programming model, though its model introduces additional scaling concerns. Will Bitcoin be handicapped in the long run by its weaker programming model?\n   Disclosure The leader in blockchain news, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2020-10-31 22:51:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,白皮书,white,系统", "title": "比特币白皮书到底做对了什么，错了什么，我们还不知道什么(2018)", "title_en": "What Bitcoin’s White Paper Got Right, Wrong and What We Still Don’t Know (2018)", "transed": 1, "url": "https://www.coindesk.com/what-bitcoins-white-paper-got-right-wrong-and-what-we-still-dont-know", "via": "", "real_tags": ["比特币", "白皮书", "white", "系统"]}, {"category": "", "categoryclass": "", "imagename": "37e67fd6762cc7ddda413e0380d43838.jpg", "infoid": 1032490, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位苏格兰演员最出名的是他对詹姆斯·邦德的刻画，他是第一个将这个角色搬上大银幕的人，并在七部间谍惊悚片中亮相。\n肖恩爵士的儿子说，肖恩爵士在睡梦中平静地去世，而在巴哈马群岛，他身体不适已有一段时间了。\n他的演艺生涯跨越了50年，1988年，他因在“贱民”中的角色而获得奥斯卡奖。\n肖恩爵士的其他电影包括“红色十月的追捕”、“海兰德”、“印第安纳·琼斯”和“最后的十字军东征与岩石”。\n杰森·康纳利说，当他在拿骚过夜去世时，他的父亲身边有很多本可以在巴哈马的家人。\n他说：我们都在努力理解这一重大事件，因为它是最近才发生的，尽管我父亲身体不适已经有一段时间了。\n对于所有认识和爱我父亲的人来说，这是悲伤的一天，对于全世界所有享受他作为演员所拥有的美妙天赋的人来说，这也是一个悲伤的损失。\n肖恩爵士来自爱丁堡的方丹桥，他于1962年首次在“诺博士”中饰演詹姆斯·邦德，随后又出演了另外五部官方电影--1983年，这位非官方人士再也不会说永远不会再出演了。\n他在很大程度上被认为是在这部长期运营的系列中扮演007的最佳演员，经常在民意调查中被提名为007。\n2000年，女王在霍利鲁德宫授予他爵士称号。今年8月，他庆祝了自己的90岁生日。\n债券制作人迈克尔·G·威尔逊(Michael G Wilson)和芭芭拉·布罗科利(Barbara Broccoli)表示，这个消息让他们悲痛欲绝。\n他们说：他曾经是，也将永远作为最初的詹姆斯·邦德而被人们铭记，当他宣布了那些令人难忘的词--邦德的名字时，他就开始了对电影史的不可磨灭的进入。詹姆斯·邦德(James Bond)。\n他以其对性感而富有魅力的特工坚韧不拔而机智的刻画彻底改变了世界。毫无疑问，他对这个系列电影的成功负有很大责任，我们将永远感谢他。\n肖恩爵士是苏格兰独立的长期支持者，他在2014年公投前夕接受采访时表示，如果巴哈马投票决定脱离英国其他地区，他可能会从巴哈马的家中返回苏格兰生活。\n苏格兰首席大臣尼古拉·斯特金说：今天早上得知肖恩·康纳利爵士逝世的消息，我感到心碎。今天，我们的国家哀悼她最爱的儿子之一。\n肖恩出生在爱丁堡的一个工人阶级家庭，通过才华和刻苦努力，他成为了国际电影偶像和世界上最有成就的演员之一。肖恩最让人难忘的将是007经典角色詹姆斯·邦德(James Bond)，但他扮演的角色多种多样。\n他是全球传奇人物，但最重要的是，他是一个爱国和自豪的苏格兰人-他在1999年苏格兰议会开幕式上的高耸身影表明了他对自己出生的国家的热爱。肖恩是苏格兰独立的终生倡导者，我们这些有同样信念的人都欠他很大的感激之情。\n你认识肖恩·康纳利爵士或与之共事吗？你对他有什么记忆？通过电子邮件haveyou say@bbc.co.uk分享您的经验。\n如果您愿意与BBC记者交谈，请提供联系电话。您也可以通过以下方式联系：\n如果您正在阅读本页，但看不到表格，您将需要访问BBC网站的移动版本来提交您的问题或评论，或者您可以通过电子邮件向我们发送电子邮件至HaveYourSay@bbc.co.uk。请在投稿时注明您的姓名、年龄和所在地。", "note_en": "The Scottish actor was best known for his portrayal of James Bond, being the first to bring the role to the big screen and appearing in seven of the spy thrillers.\n Sir Sean died peacefully in his sleep, while in the Bahamas, having been &#34;unwell for some time&#34;, his son said.\n His acting career spanned five decades and he won an Oscar in 1988 for his role in The Untouchables.\n Sir Sean&#39;s other films included The Hunt for Red October, Highlander, Indiana Jones and the Last Crusade and The Rock.\n  Jason Connery said his father &#34;had many of his family who could be in the Bahamas around him&#34; when he died overnight in Nassau.\n He said: &#34;We are all working at understanding this huge event as it only happened so recently, even though my dad has been unwell for some time.\n &#34;A sad day for all who knew and loved my dad and a sad loss for all people around the world who enjoyed the wonderful gift he had as an actor.&#34;\n  Sir Sean, from Fountainbridge in Edinburgh, first played James Bond in Dr No in 1962 and went on to appear in five other official films - and the unofficial Never Say Never Again in 1983.\n He was largely regarded as being the best actor to have played 007 in the long-running franchise, often being named as such in polls.\n He was knighted by the Queen at Holyrood Palace in 2000. In August, he celebrated his 90th birthday.\n Bond producers Michael G Wilson and Barbara Broccoli said they were &#34;devastated by the news&#34;.\n  They said: &#34;He was and shall always be remembered as the original James Bond whose indelible entrance into cinema history began when he announced those unforgettable words &#39;the name&#39;s Bond... James Bond&#39;.\n &#34;He revolutionised the world with his gritty and witty portrayal of the sexy and charismatic secret agent. He is undoubtedly largely responsible for the success of the film series and we shall be forever grateful to him.&#34;\n Sir Sean was a long-time supporter of Scottish independence, saying in interviews in the run-up to the 2014 referendum that he might return from his Bahamas home to live in Scotland if it voted to break away from the rest of the UK.\n Scotland&#39;s First Minister Nicola Sturgeon said: &#34;I was heartbroken to learn this morning of the passing of Sir Sean Connery. Our nation today mourns one of her best loved sons.\n &#34;Sean was born into a working class Edinburgh family and through talent and sheer hard work, became an international film icon and one of the world&#39;s most accomplished actors. Sean will be remembered best as James Bond - the classic 007 - but his roles were many and varied.\n &#34;He was a global legend but, first and foremost, a patriotic and proud Scot - his towering presence at the opening of the Scottish Parliament in 1999 showed his love for the country of his birth. Sean was a lifelong advocate of an independent Scotland and those of us who share that belief owe him a great debt of gratitude.&#34;\n  Did you know or work with Sir Sean Connery? What are your memories of him? Share your experiences by emailing  haveyoursay@bbc.co.uk .\n Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:\n   If you are reading this page and can&#39;t see the form you will need to visit the mobile version of the  BBC website to submit your question or comment or you can email us at  HaveYourSay@bbc.co.uk. Please include your name, age and location with any submission.", "posttime": "2020-10-31 22:24:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "康纳利,connery,爵士", "title": "肖恩·康纳利：詹姆斯·邦德演员去世，享年90岁", "title_en": "Sean Connery: James Bond actor dies aged 90", "transed": 1, "url": "https://www.bbc.com/news/entertainment-arts-54761824", "via": "", "real_tags": ["康纳利", "connery", "爵士"]}, {"category": "", "categoryclass": "", "imagename": "adc2a12e4a07c67f547320c809d6e52f.jpg", "infoid": 1032489, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一天从黑客马拉松决赛选手的陈述开始。然后我们将看看以太在世界各地是如何被使用的，企业号的下一步是什么…", "note_en": "The day begins with presentations from the Hackathon finalists. Then we'll we look at how Ethereum is being used around the world, what's next for Enterprise...", "posttime": "2020-10-31 22:23:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,buterin,选手", "title": "Vitalik Buterin就技术和密码采访泰勒·考恩[视频]", "title_en": "Vitalik Buterin interviews Tyler Cowen on tech and crypto [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=n8M_GwbKKWs", "via": "", "real_tags": ["密码", "buterin", "选手"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032488, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&lt；", "note_en": "&lt;\u0000h\u0000t\u0000m\u0000l\u0000 \u0000x\u0000m\u0000l\u0000n\u0000s\u0000:\u0000v\u0000=\u0000&#34;\u0000u\u0000r\u0000n\u0000:\u0000s\u0000c\u0000h\u0000e\u0000m\u0000a\u0000s\u0000-\u0000m\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000-\u0000c\u0000o\u0000m\u0000:\u0000v\u0000m\u0000l\u0000&#34;\u0000 \u0000\u0000x\u0000m\u0000l\u0000n\u0000s\u0000:\u0000o\u0000=\u0000&#34;\u0000u\u0000r\u0000n\u0000:\u0000s\u0000c\u0000h\u0000e\u0000m\u0000a\u0000s\u0000-\u0000m\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000-\u0000c\u0000o\u0000m\u0000:\u0000o\u0000f\u0000f\u0000i\u0000c\u0000e\u0000:\u0000o\u0000f\u0000f\u0000i\u0000c\u0000e\u0000&#34;\u0000 \u0000\u0000x\u0000m\u0000l\u0000n\u0000s\u0000:\u0000w\u0000=\u0000&#34;\u0000u\u0000r\u0000n\u0000:\u0000s\u0000c\u0000h\u0000e\u0000m\u0000a\u0000s\u0000-\u0000m\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000-\u0000c\u0000o\u0000m\u0000:\u0000o\u0000f\u0000f\u0000i\u0000c\u0000e\u0000:\u0000w\u0000o\u0000r\u0000d\u0000&#34;\u0000 \u0000\u0000x\u0000m\u0000l\u0000n\u0000s\u0000:\u0000m\u0000=\u0000&#34;\u0000h\u0000t\u0000t\u0000p\u0000:\u0000/\u0000/\u0000s\u0000c\u0000h\u0000e\u0000m\u0000a\u0000s\u0000.\u0000m\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000.\u0000c\u0000o\u0000m\u0000/\u0000o\u0000f\u0000f\u0000i\u0000c\u0000e\u0000/\u00002\u00000\u00000\u00004\u0000/\u00001\u00002\u0000/\u0000o\u0000m\u0000m\u0000l\u0000&#34;\u0000 \u0000\u0000x\u0000m\u0000l\u0000n\u0000s\u0000=\u0000&#34;\u0000h\u0000t\u0000t\u0000p\u0000:\u0000/\u0000/\u0000w\u0000w\u0000w\u0000.\u0000w\u00003\u0000.\u0000o\u0000r\u0000g\u0000/\u0000T\u0000R\u0000/\u0000R\u0000E\u0000C\u0000-\u0000h\u0000t\u0000m\u0000l\u00004\u00000\u0000&#34;\u0000&gt;\u0000 \u0000\u0000 \u0000\u0000&lt;\u0000h\u0000e\u0000a\u0000d\u0000&gt;\u0000 \u0000\u0000&lt;\u0000m\u0000e\u0000t\u0000a\u0000 \u0000h\u0000t\u0000t\u0000p\u0000-\u0000e\u0000q\u0000u\u0000i\u0000v\u0000=\u0000C\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000-\u0000T\u0000y\u0000p\u0000e\u0000 \u0000c\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000=\u0000&#34;\u0000t\u0000e\u0000x\u0000t\u0000/\u0000h\u0000t\u0000m\u0000l\u0000;\u0000 \u0000c\u0000h\u0000a\u0000r\u0000s\u0000e\u0000t\u0000=\u0000u\u0000n\u0000i\u0000c\u0000o\u0000d\u0000e\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000m\u0000e\u0000t\u0000a\u0000 \u0000n\u0000a\u0000m\u0000e\u0000=\u0000P\u0000r\u0000o\u0000g\u0000I\u0000d\u0000 \u0000c\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000=\u0000W\u0000o\u0000r\u0000d\u0000.\u0000D\u0000o\u0000c\u0000u\u0000m\u0000e\u0000n\u0000t\u0000&gt;\u0000 \u0000\u0000&lt;\u0000m\u0000e\u0000t\u0000a\u0000 \u0000n\u0000a\u0000m\u0000e\u0000=\u0000G\u0000e\u0000n\u0000e\u0000r\u0000a\u0000t\u0000o\u0000r\u0000 \u0000c\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000=\u0000&#34;\u0000M\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000 \u0000W\u0000o\u0000r\u0000d\u0000 \u00001\u00004\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000m\u0000e\u0000t\u0000a\u0000 \u0000n\u0000a\u0000m\u0000e\u0000=\u0000O\u0000r\u0000i\u0000g\u0000i\u0000n\u0000a\u0000t\u0000o\u0000r\u0000 \u0000c\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000=\u0000&#34;\u0000M\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000 \u0000W\u0000o\u0000r\u0000d\u0000 \u00001\u00004\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000l\u0000i\u0000n\u0000k\u0000 \u0000r\u0000e\u0000l\u0000=\u0000F\u0000i\u0000l\u0000e\u0000-\u0000L\u0000i\u0000s\u0000t\u0000 \u0000h\u0000r\u0000e\u0000f\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000f\u0000i\u0000l\u0000e\u0000l\u0000i\u0000s\u0000t\u0000.\u0000x\u0000m\u0000l\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000l\u0000i\u0000n\u0000k\u0000 \u0000r\u0000e\u0000l\u0000=\u0000P\u0000r\u0000e\u0000v\u0000i\u0000e\u0000w\u0000 \u0000h\u0000r\u0000e\u0000f\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000p\u0000r\u0000e\u0000v\u0000i\u0000e\u0000w\u0000.\u0000w\u0000m\u0000f\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000l\u0000i\u0000n\u0000k\u0000 \u0000r\u0000e\u0000l\u0000=\u0000E\u0000d\u0000i\u0000t\u0000-\u0000T\u0000i\u0000m\u0000e\u0000-\u0000D\u0000a\u0000t\u0000a\u0000 \u0000h\u0000r\u0000e\u0000f\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000e\u0000d\u0000i\u0000t\u0000d\u0000a\u0000t\u0000a\u0000.\u0000m\u0000s\u0000o\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000!\u0000-\u0000-\u0000[\u0000i\u0000f\u0000 \u0000!\u0000m\u0000s\u0000o\u0000]\u0000&gt;\u0000 \u0000\u0000&lt;\u0000s\u0000t\u0000y\u0000l\u0000e\u0000&gt;\u0000 \u0000\u0000v\u0000\\\u0000:\u0000*\u0000 \u0000{\u0000b\u0000e\u0000h\u0000a\u0000v\u0000i\u0000o\u0000r\u0000:\u0000u\u0000r\u0000l\u0000(\u0000#\u0000d\u0000e\u0000f\u0000a\u0000u\u0000l\u0000t\u0000#\u0000V\u0000M\u0000L\u0000)\u0000;\u0000}\u0000 \u0000\u0000o\u0000\\\u0000:\u0000*\u0000 \u0000{\u0000b\u0000e\u0000h\u0000a\u0000v\u0000i\u0000o\u0000r\u0000:\u0000u\u0000r\u0000l\u0000(\u0000#\u0000d\u0000e\u0000f\u0000a\u0000u\u0000l\u0000t\u0000#\u0000V\u0000M\u0000L\u0000)\u0000;\u0000}\u0000 \u0000\u0000w\u0000\\\u0000:\u0000*\u0000 \u0000{\u0000b\u0000e\u0000h\u0000a\u0000v\u0000i\u0000o\u0000r\u0000:\u0000u\u0000r\u0000l\u0000(\u0000#\u0000d\u0000e\u0000f\u0000a\u0000u\u0000l\u0000t\u0000#\u0000V\u0000M\u0000L\u0000)\u0000;\u0000}\u0000 \u0000\u0000.\u0000s\u0000h\u0000a\u0000p\u0000e\u0000 \u0000{\u0000b\u0000e\u0000h\u0000a\u0000v\u0000i\u0000o\u0000r\u0000:\u0000u\u0000r\u0000l\u0000(\u0000#\u0000d\u0000e\u0000f\u0000a\u0000u\u0000l\u0000t\u0000#\u0000V\u0000M\u0000L\u0000)\u0000;\u0000}\u0000 \u0000\u0000&lt;\u0000/\u0000s\u0000t\u0000y\u0000l\u0000e\u0000&gt;\u0000 \u0000\u0000&lt;\u0000!\u0000[\u0000e\u0000n\u0000d\u0000i\u0000f\u0000]\u0000-\u0000-\u0000&gt;\u0000 \u0000\u0000&lt;\u0000t\u0000i\u0000t\u0000l\u0000e\u0000&gt;\u0000L\u0000E\u0000W\u0000I\u0000S\u0000I\u0000A\u0000N\u0000A\u0000:\u0000 \u0000G\u0000e\u0000o\u0000r\u0000g\u0000e\u0000 \u0000O\u0000r\u0000w\u0000e\u0000l\u0000l\u0000 \u0000o\u0000n\u0000 \u0000C\u0000.\u0000 \u0000S\u0000.\u0000 \u0000L\u0000e\u0000w\u0000i\u0000s\u0000,\u0000 \u0000T\u0000h\u0000a\u0000t\u0000 \u0000H\u0000i\u0000d\u0000e\u0000o\u0000u\u0000s\u0000 \u0000S\u0000t\u0000r\u0000e\u0000n\u0000g\u0000t\u0000h\u0000&lt;\u0000/\u0000t\u0000i\u0000t\u0000l\u0000e\u0000&gt;\u0000 \u0000\u0000&lt;\u0000!\u0000-\u0000-\u0000[\u0000i\u0000f\u0000 \u0000g\u0000t\u0000e\u0000 \u0000m\u0000s\u0000o\u0000 \u00009\u0000]\u0000&gt;\u0000&lt;\u0000x\u0000m\u0000l\u0000&gt;\u0000 \u0000\u0000 \u0000&lt;\u0000o\u0000:\u0000D\u0000o\u0000c\u0000u\u0000m\u0000e\u0000n\u0000t\u0000P\u0000r\u0000o\u0000p\u0000e\u0000r\u0000t\u0000i\u0000e\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000A\u0000u\u0000t\u0000h\u0000o\u0000r\u0000&gt;\u0000A\u0000r\u0000e\u0000n\u0000d\u0000&lt;\u0000/\u0000o\u0000:\u0000A\u0000u\u0000t\u0000h\u0000o\u0000r\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000T\u0000e\u0000m\u0000p\u0000l\u0000a\u0000t\u0000e\u0000&gt;\u0000N\u0000o\u0000r\u0000m\u0000a\u0000l\u0000&lt;\u0000/\u0000o\u0000:\u0000T\u0000e\u0000m\u0000p\u0000l\u0000a\u0000t\u0000e\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000L\u0000a\u0000s\u0000t\u0000A\u0000u\u0000t\u0000h\u0000o\u0000r\u0000&gt;\u0000C\u0000o\u0000r\u0000r\u0000&lt;\u0000/\u0000o\u0000:\u0000L\u0000a\u0000s\u0000t\u0000A\u0000u\u0000t\u0000h\u0000o\u0000r\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000R\u0000e\u0000v\u0000i\u0000s\u0000i\u0000o\u0000n\u0000&gt;\u00004\u0000&lt;\u0000/\u0000o\u0000:\u0000R\u0000e\u0000v\u0000i\u0000s\u0000i\u0000o\u0000n\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000T\u0000o\u0000t\u0000a\u0000l\u0000T\u0000i\u0000m\u0000e\u0000&gt;\u00001\u00002\u00004\u0000&lt;\u0000/\u0000o\u0000:\u0000T\u0000o\u0000t\u0000a\u0000l\u0000T\u0000i\u0000m\u0000e\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000C\u0000r\u0000e\u0000a\u0000t\u0000e\u0000d\u0000&gt;\u00002\u00000\u00001\u00005\u0000-\u00000\u00008\u0000-\u00001\u00002\u0000T\u00002\u00001\u0000:\u00004\u00000\u0000:\u00000\u00000\u0000Z\u0000&lt;\u0000/\u0000o\u0000:\u0000C\u0000r\u0000e\u0000a\u0000t\u0000e\u0000d\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000L\u0000a\u0000s\u0000t\u0000S\u0000a\u0000v\u0000e\u0000d\u0000&gt;\u00002\u00000\u00001\u00006\u0000-\u00000\u00009\u0000-\u00000\u00008\u0000T\u00000\u00008\u0000:\u00005\u00001\u0000:\u00000\u00000\u0000Z\u0000&lt;\u0000/\u0000o\u0000:\u0000L\u0000a\u0000s\u0000t\u0000S\u0000a\u0000v\u0000e\u0000d\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000P\u0000a\u0000g\u0000e\u0000s\u0000&gt;\u00001\u0000&lt;\u0000/\u0000o\u0000:\u0000P\u0000a\u0000g\u0000e\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000W\u0000o\u0000r\u0000d\u0000s\u0000&gt;\u00007\u00000\u00007\u0000&lt;\u0000/\u0000o\u0000:\u0000W\u0000o\u0000r\u0000d\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000C\u0000h\u0000a\u0000r\u0000a\u0000c\u0000t\u0000e\u0000r\u0000s\u0000&gt;\u00003\u00008\u00009\u00000\u0000&lt;\u0000/\u0000o\u0000:\u0000C\u0000h\u0000a\u0000r\u0000a\u0000c\u0000t\u0000e\u0000r\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000C\u0000o\u0000m\u0000p\u0000a\u0000n\u0000y\u0000&gt;\u0000H\u0000P\u0000&lt;\u0000/\u0000o\u0000:\u0000C\u0000o\u0000m\u0000p\u0000a\u0000n\u0000y\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000L\u0000i\u0000n\u0000e\u0000s\u0000&gt;\u00003\u00002\u0000&lt;\u0000/\u0000o\u0000:\u0000L\u0000i\u0000n\u0000e\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000P\u0000a\u0000r\u0000a\u0000g\u0000r\u0000a\u0000p\u0000h\u0000s\u0000&gt;\u00009\u0000&lt;\u0000/\u0000o\u0000:\u0000P\u0000a\u0000r\u0000a\u0000g\u0000r\u0000a\u0000p\u0000h\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000C\u0000h\u0000a\u0000r\u0000a\u0000c\u0000t\u0000e\u0000r\u0000s\u0000W\u0000i\u0000t\u0000h\u0000S\u0000p\u0000a\u0000c\u0000e\u0000s\u0000&gt;\u00004\u00005\u00008\u00008\u0000&lt;\u0000/\u0000o\u0000:\u0000C\u0000h\u0000a\u0000r\u0000a\u0000c\u0000t\u0000e\u0000r\u0000s\u0000W\u0000i\u0000t\u0000h\u0000S\u0000p\u0000a\u0000c\u0000e\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000o\u0000:\u0000V\u0000e\u0000r\u0000s\u0000i\u0000o\u0000n\u0000&gt;\u00001\u00004\u0000.\u00000\u00000\u0000&lt;\u0000/\u0000o\u0000:\u0000V\u0000e\u0000r\u0000s\u0000i\u0000o\u0000n\u0000&gt;\u0000 \u0000\u0000 \u0000&lt;\u0000/\u0000o\u0000:\u0000D\u0000o\u0000c\u0000u\u0000m\u0000e\u0000n\u0000t\u0000P\u0000r\u0000o\u0000p\u0000e\u0000r\u0000t\u0000i\u0000e\u0000s\u0000&gt;\u0000 \u0000\u0000&lt;\u0000/\u0000x\u0000m\u0000l\u0000&gt;\u0000&lt;\u0000!\u0000[\u0000e\u0000n\u0000d\u0000i\u0000f\u0000]\u0000-\u0000-\u0000&gt;\u0000 \u0000\u0000&lt;\u0000l\u0000i\u0000n\u0000k\u0000 \u0000r\u0000e\u0000l\u0000=\u0000d\u0000a\u0000t\u0000a\u0000S\u0000t\u0000o\u0000r\u0000e\u0000I\u0000t\u0000e\u0000m\u0000 \u0000h\u0000r\u0000e\u0000f\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000i\u0000t\u0000e\u0000m\u00000\u00000\u00000\u00006\u0000.\u0000x\u0000m\u0000l\u0000&#34;\u0000 \u0000\u0000t\u0000a\u0000r\u0000g\u0000e\u0000t\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000p\u0000r\u0000o\u0000p\u0000s\u00000\u00000\u00007\u0000.\u0000x\u0000m\u0000l\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000l\u0000i\u0000n\u0000k\u0000 \u0000r\u0000e\u0000l\u0000=\u0000t\u0000h\u0000e\u0000m\u0000e\u0000D\u0000a\u0000t\u0000a\u0000 \u0000h\u0000r\u0000e\u0000f\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000t\u0000h\u0000e\u0000m\u0000e\u0000d\u0000a\u0000t\u0000a\u0000.\u0000t\u0000h\u0000m\u0000x\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000l\u0000i\u0000n\u0000k\u0000 \u0000r\u0000e\u0000l\u0000=\u0000c\u0000o\u0000l\u0000o\u0000r\u0000S\u0000c\u0000h\u0000e\u0000m\u0000e\u0000M\u0000a\u0000p\u0000p\u0000i\u0000n\u0000g\u0000 \u0000h\u0000r\u0000e\u0000f\u0000=\u0000&#34;\u0000i\u0000n\u0000d\u0000e\u0000x\u0000_\u0000b\u0000e\u0000s\u0000t\u0000a\u0000n\u0000d\u0000e\u0000n\u0000/\u0000c\u0000o\u0000l\u0000o\u0000r\u0000s\u0000c\u0000h\u0000e\u0000m\u0000e\u0000m\u0000a\u0000p\u0000p\u0000i\u0000n\u0000g\u0000.\u0000x\u0000m\u0000l\u0000&#34;\u0000&gt;\u0000 \u0000\u0000&lt;\u0000!\u0000-\u0000-\u0000[\u0000i\u0000f\u0000 \u0000g\u0000t\u0000e\u0000 \u0000m\u0000s\u0000o\u0000 \u00009\u0000]\u0000&gt;\u0000&lt;\u0000x\u0000m\u0000l\u0000&gt;\u0000 \u0000\u0000 \u0000&lt;\u0000w\u0000:\u0000W\u0000o\u0000r\u0000d\u0000D\u0000o\u0000c\u0000u\u0000m\u0000e\u0000n\u0000t\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000Z\u0000o\u0000o\u0000m\u0000&gt;\u00001\u00000\u00008\u0000&lt;\u0000/\u0000w\u0000:\u0000Z\u0000o\u0000o\u0000m\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000S\u0000p\u0000e\u0000l\u0000l\u0000i\u0000n\u0000g\u0000S\u0000t\u0000a\u0000t\u0000e\u0000&gt;\u0000C\u0000l\u0000e\u0000a\u0000n\u0000&lt;\u0000/\u0000w\u0000:\u0000S\u0000p\u0000e\u0000l\u0000l\u0000i\u0000n\u0000g\u0000S\u0000t\u0000a\u0000t\u0000e\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000T\u0000r\u0000a\u0000c\u0000k\u0000M\u0000o\u0000v\u0000e\u0000s\u0000&gt;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&lt;\u0000/\u0000w\u0000:\u0000T\u0000r\u0000a\u0000c\u0000k\u0000M\u0000o\u0000v\u0000e\u0000s\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000T\u0000r\u0000a\u0000c\u0000k\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000t\u0000i\u0000n\u0000g\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000H\u0000y\u0000p\u0000h\u0000e\u0000n\u0000a\u0000t\u0000i\u0000o\u0000n\u0000Z\u0000o\u0000n\u0000e\u0000&gt;\u00002\u00001\u0000&lt;\u0000/\u0000w\u0000:\u0000H\u0000y\u0000p\u0000h\u0000e\u0000n\u0000a\u0000t\u0000i\u0000o\u0000n\u0000Z\u0000o\u0000n\u0000e\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000P\u0000u\u0000n\u0000c\u0000t\u0000u\u0000a\u0000t\u0000i\u0000o\u0000n\u0000K\u0000e\u0000r\u0000n\u0000i\u0000n\u0000g\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000V\u0000a\u0000l\u0000i\u0000d\u0000a\u0000t\u0000e\u0000A\u0000g\u0000a\u0000i\u0000n\u0000s\u0000t\u0000S\u0000c\u0000h\u0000e\u0000m\u0000a\u0000s\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000S\u0000a\u0000v\u0000e\u0000I\u0000f\u0000X\u0000M\u0000L\u0000I\u0000n\u0000v\u0000a\u0000l\u0000i\u0000d\u0000&gt;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&lt;\u0000/\u0000w\u0000:\u0000S\u0000a\u0000v\u0000e\u0000I\u0000f\u0000X\u0000M\u0000L\u0000I\u0000n\u0000v\u0000a\u0000l\u0000i\u0000d\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000I\u0000g\u0000n\u0000o\u0000r\u0000e\u0000M\u0000i\u0000x\u0000e\u0000d\u0000C\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000&gt;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&lt;\u0000/\u0000w\u0000:\u0000I\u0000g\u0000n\u0000o\u0000r\u0000e\u0000M\u0000i\u0000x\u0000e\u0000d\u0000C\u0000o\u0000n\u0000t\u0000e\u0000n\u0000t\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000A\u0000l\u0000w\u0000a\u0000y\u0000s\u0000S\u0000h\u0000o\u0000w\u0000P\u0000l\u0000a\u0000c\u0000e\u0000h\u0000o\u0000l\u0000d\u0000e\u0000r\u0000T\u0000e\u0000x\u0000t\u0000&gt;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&lt;\u0000/\u0000w\u0000:\u0000A\u0000l\u0000w\u0000a\u0000y\u0000s\u0000S\u0000h\u0000o\u0000w\u0000P\u0000l\u0000a\u0000c\u0000e\u0000h\u0000o\u0000l\u0000d\u0000e\u0000r\u0000T\u0000e\u0000x\u0000t\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000D\u0000o\u0000N\u0000o\u0000t\u0000P\u0000r\u0000o\u0000m\u0000o\u0000t\u0000e\u0000Q\u0000F\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000i\u0000d\u0000T\u0000h\u0000e\u0000m\u0000e\u0000O\u0000t\u0000h\u0000e\u0000r\u0000&gt;\u0000N\u0000L\u0000&lt;\u0000/\u0000w\u0000:\u0000L\u0000i\u0000d\u0000T\u0000h\u0000e\u0000m\u0000e\u0000O\u0000t\u0000h\u0000e\u0000r\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000i\u0000d\u0000T\u0000h\u0000e\u0000m\u0000e\u0000A\u0000s\u0000i\u0000a\u0000n\u0000&gt;\u0000X\u0000-\u0000N\u0000O\u0000N\u0000E\u0000&lt;\u0000/\u0000w\u0000:\u0000L\u0000i\u0000d\u0000T\u0000h\u0000e\u0000m\u0000e\u0000A\u0000s\u0000i\u0000a\u0000n\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000i\u0000d\u0000T\u0000h\u0000e\u0000m\u0000e\u0000C\u0000o\u0000m\u0000p\u0000l\u0000e\u0000x\u0000S\u0000c\u0000r\u0000i\u0000p\u0000t\u0000&gt;\u0000X\u0000-\u0000N\u0000O\u0000N\u0000E\u0000&lt;\u0000/\u0000w\u0000:\u0000L\u0000i\u0000d\u0000T\u0000h\u0000e\u0000m\u0000e\u0000C\u0000o\u0000m\u0000p\u0000l\u0000e\u0000x\u0000S\u0000c\u0000r\u0000i\u0000p\u0000t\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000C\u0000o\u0000m\u0000p\u0000a\u0000t\u0000i\u0000b\u0000i\u0000l\u0000i\u0000t\u0000y\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000B\u0000r\u0000e\u0000a\u0000k\u0000W\u0000r\u0000a\u0000p\u0000p\u0000e\u0000d\u0000T\u0000a\u0000b\u0000l\u0000e\u0000s\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000S\u0000n\u0000a\u0000p\u0000T\u0000o\u0000G\u0000r\u0000i\u0000d\u0000I\u0000n\u0000C\u0000e\u0000l\u0000l\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000W\u0000r\u0000a\u0000p\u0000T\u0000e\u0000x\u0000t\u0000W\u0000i\u0000t\u0000h\u0000P\u0000u\u0000n\u0000c\u0000t\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000U\u0000s\u0000e\u0000A\u0000s\u0000i\u0000a\u0000n\u0000B\u0000r\u0000e\u0000a\u0000k\u0000R\u0000u\u0000l\u0000e\u0000s\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000D\u0000o\u0000n\u0000t\u0000G\u0000r\u0000o\u0000w\u0000A\u0000u\u0000t\u0000o\u0000f\u0000i\u0000t\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000S\u0000p\u0000l\u0000i\u0000t\u0000P\u0000g\u0000B\u0000r\u0000e\u0000a\u0000k\u0000A\u0000n\u0000d\u0000P\u0000a\u0000r\u0000a\u0000M\u0000a\u0000r\u0000k\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000D\u0000o\u0000n\u0000t\u0000V\u0000e\u0000r\u0000t\u0000A\u0000l\u0000i\u0000g\u0000n\u0000C\u0000e\u0000l\u0000l\u0000W\u0000i\u0000t\u0000h\u0000S\u0000p\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000D\u0000o\u0000n\u0000t\u0000B\u0000r\u0000e\u0000a\u0000k\u0000C\u0000o\u0000n\u0000s\u0000t\u0000r\u0000a\u0000i\u0000n\u0000e\u0000d\u0000F\u0000o\u0000r\u0000c\u0000e\u0000d\u0000T\u0000a\u0000b\u0000l\u0000e\u0000s\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000D\u0000o\u0000n\u0000t\u0000V\u0000e\u0000r\u0000t\u0000A\u0000l\u0000i\u0000g\u0000n\u0000I\u0000n\u0000T\u0000x\u0000b\u0000x\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000W\u0000o\u0000r\u0000d\u00001\u00001\u0000K\u0000e\u0000r\u0000n\u0000i\u0000n\u0000g\u0000P\u0000a\u0000i\u0000r\u0000s\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000C\u0000a\u0000c\u0000h\u0000e\u0000d\u0000C\u0000o\u0000l\u0000B\u0000a\u0000l\u0000a\u0000n\u0000c\u0000e\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000/\u0000w\u0000:\u0000C\u0000o\u0000m\u0000p\u0000a\u0000t\u0000i\u0000b\u0000i\u0000l\u0000i\u0000t\u0000y\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000B\u0000r\u0000o\u0000w\u0000s\u0000e\u0000r\u0000L\u0000e\u0000v\u0000e\u0000l\u0000&gt;\u0000M\u0000i\u0000c\u0000r\u0000o\u0000s\u0000o\u0000f\u0000t\u0000I\u0000n\u0000t\u0000e\u0000r\u0000n\u0000e\u0000t\u0000E\u0000x\u0000p\u0000l\u0000o\u0000r\u0000e\u0000r\u00004\u0000&lt;\u0000/\u0000w\u0000:\u0000B\u0000r\u0000o\u0000w\u0000s\u0000e\u0000r\u0000L\u0000e\u0000v\u0000e\u0000l\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000m\u0000a\u0000t\u0000h\u0000P\u0000r\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000m\u0000a\u0000t\u0000h\u0000F\u0000o\u0000n\u0000t\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000C\u0000a\u0000m\u0000b\u0000r\u0000i\u0000a\u0000 \u0000M\u0000a\u0000t\u0000h\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000b\u0000r\u0000k\u0000B\u0000i\u0000n\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000b\u0000e\u0000f\u0000o\u0000r\u0000e\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000b\u0000r\u0000k\u0000B\u0000i\u0000n\u0000S\u0000u\u0000b\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000&amp;\u0000#\u00004\u00005\u0000;\u0000-\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000s\u0000m\u0000a\u0000l\u0000l\u0000F\u0000r\u0000a\u0000c\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000o\u0000f\u0000f\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000d\u0000i\u0000s\u0000p\u0000D\u0000e\u0000f\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000l\u0000M\u0000a\u0000r\u0000g\u0000i\u0000n\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u00000\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000r\u0000M\u0000a\u0000r\u0000g\u0000i\u0000n\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u00000\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000d\u0000e\u0000f\u0000J\u0000c\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000c\u0000e\u0000n\u0000t\u0000e\u0000r\u0000G\u0000r\u0000o\u0000u\u0000p\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000w\u0000r\u0000a\u0000p\u0000I\u0000n\u0000d\u0000e\u0000n\u0000t\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u00001\u00004\u00004\u00000\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000i\u0000n\u0000t\u0000L\u0000i\u0000m\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000s\u0000u\u0000b\u0000S\u0000u\u0000p\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000 \u0000&lt;\u0000m\u0000:\u0000n\u0000a\u0000r\u0000y\u0000L\u0000i\u0000m\u0000 \u0000m\u0000:\u0000v\u0000a\u0000l\u0000=\u0000&#34;\u0000u\u0000n\u0000d\u0000O\u0000v\u0000r\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000/\u0000m\u0000:\u0000m\u0000a\u0000t\u0000h\u0000P\u0000r\u0000&gt;\u0000&lt;\u0000/\u0000w\u0000:\u0000W\u0000o\u0000r\u0000d\u0000D\u0000o\u0000c\u0000u\u0000m\u0000e\u0000n\u0000t\u0000&gt;\u0000 \u0000\u0000&lt;\u0000/\u0000x\u0000m\u0000l\u0000&gt;\u0000&lt;\u0000!\u0000[\u0000e\u0000n\u0000d\u0000i\u0000f\u0000]\u0000-\u0000-\u0000&gt;\u0000&lt;\u0000!\u0000-\u0000-\u0000[\u0000i\u0000f\u0000 \u0000g\u0000t\u0000e\u0000 \u0000m\u0000s\u0000o\u0000 \u00009\u0000]\u0000&gt;\u0000&lt;\u0000x\u0000m\u0000l\u0000&gt;\u0000 \u0000\u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000a\u0000t\u0000e\u0000n\u0000t\u0000S\u0000t\u0000y\u0000l\u0000e\u0000s\u0000 \u0000D\u0000e\u0000f\u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000S\u0000t\u0000a\u0000t\u0000e\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000D\u0000e\u0000f\u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000D\u0000e\u0000f\u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000D\u0000e\u0000f\u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000D\u0000e\u0000f\u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u00009\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000L\u0000a\u0000t\u0000e\u0000n\u0000t\u0000S\u0000t\u0000y\u0000l\u0000e\u0000C\u0000o\u0000u\u0000n\u0000t\u0000=\u0000&#34;\u00002\u00006\u00007\u0000&#34;\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00000\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000N\u0000o\u0000r\u0000m\u0000a\u0000l\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00002\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00003\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00004\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00005\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00006\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00007\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00008\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00009\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000h\u0000e\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00009\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00002\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00003\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00004\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00005\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00006\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00007\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00008\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00009\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000t\u0000o\u0000c\u0000 \u00009\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00005\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000c\u0000a\u0000p\u0000t\u0000i\u0000o\u0000n\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00001\u00000\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000T\u0000i\u0000t\u0000l\u0000e\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00001\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000D\u0000e\u0000f\u0000a\u0000u\u0000l\u0000t\u0000 \u0000P\u0000a\u0000r\u0000a\u0000g\u0000r\u0000a\u0000p\u0000h\u0000 \u0000F\u0000o\u0000n\u0000t\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00001\u00001\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000S\u0000u\u0000b\u0000t\u0000i\u0000t\u0000l\u0000e\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00002\u00002\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000S\u0000t\u0000r\u0000o\u0000n\u0000g\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00002\u00000\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000E\u0000m\u0000p\u0000h\u0000a\u0000s\u0000i\u0000s\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00005\u00009\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000T\u0000a\u0000b\u0000l\u0000e\u0000 \u0000G\u0000r\u0000i\u0000d\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000P\u0000l\u0000a\u0000c\u0000e\u0000h\u0000o\u0000l\u0000d\u0000e\u0000r\u0000 \u0000T\u0000e\u0000x\u0000t\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00001\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000N\u0000o\u0000 \u0000S\u0000p\u0000a\u0000c\u0000i\u0000n\u0000g\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00000\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000g\u0000h\u0000t\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00001\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000g\u0000h\u0000t\u0000 \u0000L\u0000i\u0000s\u0000t\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00002\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000g\u0000h\u0000t\u0000 \u0000G\u0000r\u0000i\u0000d\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00003\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00004\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00002\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00005\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000L\u0000i\u0000s\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00006\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000L\u0000i\u0000s\u0000t\u0000 \u00002\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00007\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000G\u0000r\u0000i\u0000d\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00008\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000G\u0000r\u0000i\u0000d\u0000 \u00002\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00009\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000G\u0000r\u0000i\u0000d\u0000 \u00003\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00007\u00000\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000D\u0000a\u0000r\u0000k\u0000 \u0000L\u0000i\u0000s\u0000t\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00007\u00001\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000C\u0000o\u0000l\u0000o\u0000r\u0000f\u0000u\u0000l\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00007\u00002\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000C\u0000o\u0000l\u0000o\u0000r\u0000f\u0000u\u0000l\u0000 \u0000L\u0000i\u0000s\u0000t\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00007\u00003\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000C\u0000o\u0000l\u0000o\u0000r\u0000f\u0000u\u0000l\u0000 \u0000G\u0000r\u0000i\u0000d\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00000\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000g\u0000h\u0000t\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u0000A\u0000c\u0000c\u0000e\u0000n\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00001\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000g\u0000h\u0000t\u0000 \u0000L\u0000i\u0000s\u0000t\u0000 \u0000A\u0000c\u0000c\u0000e\u0000n\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00002\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000g\u0000h\u0000t\u0000 \u0000G\u0000r\u0000i\u0000d\u0000 \u0000A\u0000c\u0000c\u0000e\u0000n\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00003\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00001\u0000 \u0000A\u0000c\u0000c\u0000e\u0000n\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00004\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000S\u0000h\u0000a\u0000d\u0000i\u0000n\u0000g\u0000 \u00002\u0000 \u0000A\u0000c\u0000c\u0000e\u0000n\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00006\u00005\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000M\u0000e\u0000d\u0000i\u0000u\u0000m\u0000 \u0000L\u0000i\u0000s\u0000t\u0000 \u00001\u0000 \u0000A\u0000c\u0000c\u0000e\u0000n\u0000t\u0000 \u00001\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000R\u0000e\u0000v\u0000i\u0000s\u0000i\u0000o\u0000n\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00003\u00004\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000s\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000Q\u0000F\u0000o\u0000r\u0000m\u0000a\u0000t\u0000=\u0000&#34;\u0000t\u0000r\u0000u\u0000e\u0000&#34;\u0000 \u0000N\u0000a\u0000m\u0000e\u0000=\u0000&#34;\u0000L\u0000i\u0000s\u0000t\u0000 \u0000P\u0000a\u0000r\u0000a\u0000g\u0000r\u0000a\u0000p\u0000h\u0000&#34;\u0000/\u0000&gt;\u0000 \u0000\u0000 \u0000 \u0000&lt;\u0000w\u0000:\u0000L\u0000s\u0000d\u0000E\u0000x\u0000c\u0000e\u0000p\u0000t\u0000i\u0000o\u0000n\u0000 \u0000L\u0000o\u0000c\u0000k\u0000e\u0000d\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000P\u0000r\u0000i\u0000o\u0000r\u0000i\u0000t\u0000y\u0000=\u0000&#34;\u00002\u00009\u0000&#34;\u0000 \u0000S\u0000e\u0000m\u0000i\u0000H\u0000i\u0000d\u0000d\u0000e\u0000n\u0000=\u0000&#34;\u0000f\u0000a\u0000l\u0000s\u0000e\u0000&#34;\u0000 \u0000\u0000 \u0000 \u0000 \u0000U\u0000n\u0000h\u0000i\u0000d\u0000e\u0000W\u0000h\u0000e\u0000n\u0000U\u0000\n......", "posttime": "2020-10-31 21:59:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,接手,george,lt", "title": "科学家接手：乔治·奥威尔评论“那可怕的力量”(1945)", "title_en": "The Scientists Take Over: George Orwell Reviews “That Hideous Strength” (1945)", "transed": 1, "url": "http://lewisiana.nl/orwell/index.htm", "via": "", "real_tags": ["科学家", "接手", "george", "lt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032487, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在拖延了很长时间之后，终于有了另一份关于FreeCAD的BIM工具的开发报告。非常抱歉最近几个月的停电，发生了很多事情(所有3D&amp；BIM都是用FreeCAD和Blender完成的)，当然大流行也没有缓解事情。无论如何，这并不意味着FreeCAD方面什么都没有发生，相反，错误仍然得到解决，事情得到改善，想法得到讨论，FreeCAD每天都变得更好。\n上个月我们的营业额也很高，因为欧特克更改了免费版Fusion360的条款。有一大堆新的限制限制了个人/爱好用户的使用。例如，您从Fusion360导出到CNC机床(从一块材料中切割对象)的g代码现在正在使机器运行速度变慢(因此提高了生产成本)，除了喋喋不休地让用户购买订阅之外，没有其他明显的原因。因此，我们看到大量用户迁移到FreeCAD，看到人们发现FreeCAD并学习和喜欢它，这真的很令人兴奋。\n再次感谢每一位为我的Patreon或Liberapay活动捐款的人，我真的很感谢你们没有在我三个月没有写信的时候把我扔下。\n另外，对于那些没有注意到的人，FreeCAD现在有了一个适当的Liberapay Teams帐户，所有收到的钱都在那里注册的FreeCAD开发人员(目前是7人)之间平分。在过去的几周里，这个账户已经收到了巨大的捐款(目前它每月收到大约1000美元)，这要归功于新的前Fusion360用户的流动，以及Kunda1在FreeCAD官方Twitter账户上所做的令人印象深刻的工作(如果你是Twitter用户，这个账户过去只是FreeCAD Facebook页面的镜子，但现在维护得非常好)，以及其他人的参与(特别要感谢我的女朋友，世界上最棒的人)。\n材质现在具有新的横断面颜色特性，该特性允许在查看材质和剪切材质时提供不同的颜色。例如，您现在可以让墙壁在查看时显示为白色，但在TechDraw页面上剪切和查看时显示为黑色。\n到目前为止，这是一个很小的改进，但它为结构奠定了基础，使其具有更高级的功能，例如支持填充图案。主要问题是，尽管SVG格式对填充图案有很好的支持(任何东西都可以变成填充图案，甚至位图图像)，但是SVG格式的Qt实现缺乏对它的支持(它有自己的系统，但是要使其与SVG兼容并不是很实际)。因此，目前我们还不清楚如何走得更远。\nTechDraw对填充图案的实现在内部重新创建了OpenCasCade几何体，它工作得很好，但对于大型BIM模型来说可能会很重。无论如何，这也是我正在探索的一条赛道。\n另一个非常小的修复，但是使用门窗工具创建的默认门窗现在定义了铰链边，因此它们的洞口属性现在可以开箱即用。不过，它可能不会朝您想要的方向打开，因此您可能仍需要调整此设置。但我清单上的下一项是添加几个控件来轻松切换打开方向。\n拔模图案系统现在再次工作(填充图案可以添加到所有闭合的拔模对象，如矩形、多段线、圆等)。我还在Edit-&gt；Preferences-&gt；Draft-&gt；Visual Settings下添加了一个首选项选项，以设置默认的填充图案比例，这在您总是处理类似大小范围的对象(例如建筑平面图)时非常有用。我还需要尝试一下(0.0025似乎是一个非常好的BIM默认设置)，但是一旦我找到几个好的设置，我会把它添加到BIM设置屏幕中。\n剖切平面现在具有显示标签特性，当启用该特性时，将在三维视图中的平面上显示剖切平面标签。当您的文档中有多个剖面时，这对于轻松识别这些剖面很有用。文本大小目前取决于箭头大小，但稍后我将使这一切更易于自定义。\n我们还为剖面平面制定了进一步的计划，例如，可以双击或以某种方式将其激活，并发现您在一个单独的二维视图中剪切或关闭了所有需要的几何图形，在该视图中，您仍然可以在二维环境中处理模型。这有点像是完整3D模型和TechDraw视图之间的中间步骤。您可以在BIM工作台的实验工具选项板上看到由Carlo Pavan编码的初稿。\n在BIM工作台上的注释工具中，您现在可以找到两个TechDraw工具，即create page和create view。第一个与Create page from template TechDraw工具相同，不同之处在于它会记住您上次使用的模板，并在您再次使用该工具时将您带到那里，因此它提供了更快的工作流程。第二个工具目前与TechDraw Archview工具相同，但我计划在将来使其更灵活一些，这样它将成为TechDraw的Archview和DraftView工具的混合，具体取决于所选的对象。\n计划工具现已扩展为允许将结果导出为.tsv(制表符分隔值)格式，该格式与.csv(逗号分隔值)格式基本相同，但使用制表符而不是逗号来分隔列。当然，CSV的大问题是在文本栏中是否有逗号。通常，电子表格应用程序对.csv文件相当宽容，它们通常会询问您在导入时应将哪个字符视为列分隔符，但其他应用程序(例如GitHub)如果不使用逗号作为分隔符，则无法正确显示它们。所以从现在开始，有一个正确的方式来取悦每个人。\nFreeCAD Exporter for Blender已经看到了几个小修复，如果您没有自己添加.FCStd扩展名，它现在会自动将扩展名.FCStd添加到生成的文件中，它现在可以正确处理对象旋转和缩放，并且它会在导出之前应用修改器。它现在还支持无面对象(线框对象)。\n再加上BlenderBIM的改进，现在在Blender中处理BIM模型或BIM模型的部分变得越来越容易，并且在需要时，可以在FreeCAD中无缝集成所有内容。还有更多的FreeCAD/Blender联合开发正在进行中，例如在内部使用FreeCAD的新Sverchok节点，字面上为FreeCAD和Blender创建了一种新的接口。\nBIM工作台现在将在安装屏幕上检测您的FreeCAD版本，如果您没有使用开发版本，则建议您安装一个开发版本。这将帮助人们意识到开发版本的存在，并变得更习惯于它们，以及如何安装和管理它们。\n现在可以直接从工作平面任务面板设置栅格的总体大小。\n开始页现在可以显示多个自定义文件夹。要实现这一点，请转到菜单编辑-&&gt;首选项-&&gt;开始下的开始页首选项，手动键入多个文件夹路径，以；分隔，而不是选择一个自定义文件夹。\n现在，拔模缩放工具支持使用图像工作台创建的图像平面。因此，现在可以轻松导入参考图像(如扫描的平面图)，将其定位在公共参考点上，并将其缩放到所需的大小。\n现在可以在编辑-&gt；首选项-&gt；草稿-&gt；尺寸和文本下为这两个设置设置缺省值，这将影响所有新创建的尺寸。\n最后但并非最不重要的一点是，我开始将手册升级到FreeCAD 0.19，这一次我打算用它制作一本印刷书籍。未完待续!。\n我想这就是这个月的内容了，我保证我会尽我所能恢复每月一次的发帖！", "note_en": "After a very, very long delay, here comes finally another development report about the  BIM tools for  FreeCAD. Awfully sorry about the black-out during these last months, lots of things  happened (all the 3D&amp;BIM done with FreeCAD and Blender) and of course the pandemic didn&#39;t ease things either. Anyway, that doesn&#39;t mean nothing happened on the FreeCAD front, on the contrary, bugs still get addressed, things get fin-tuned, ideas get discussed, and FreeCAD gets everyday better.\n This last month we also had a hectic turnover, because Autodesk changed the terms of the free version of their  Fusion360. There is a full load of new limitations that restrain much the use for personal/hobby users. For example, the g-code you export from Fusion360 to CNC machines (that cut objects out of a block of material), is now making the machine running slower (and therefore raising the production costs), for no apparent reason other than nagging the users into buying a subscription. As a result, we saw a massive migration of users to FreeCAD, and it&#39;s really thrilling to see people discovering FreeCAD and learning it and liking it.\n Thanks once more to everybody who contributes to my  Patreon or  Liberapay campaigns, I&#39;m really grateful you guys didn&#39;t just drop me away when I fail to write for 3 months.\n Also, for who didn&#39;t notice, FreeCAD now has a proper  Liberapay teams account where all money received is divided equally between the FreeCAD developers registered there (currently 7). This account has seen a huge raise of donations these last weeks (it receives around 1000 USD/month at the moment), thanks to the flow of new ex-Fusion360 users, and the impressive job Kunda1 is doing on  the official FreeCAD twitter account (subscribe to it if you are a twitter user, that account used to be just a mirror of the FreeCAD Facebook page, but is now very, very well maintained) and the campaigning of other people (special thanks to my  girlfriend, the most awesome person in the world).\n    Materials now have a new  Section Color property, which allows to give a different color when the material is viewed and when it is cut through. So for example you can now have your walls appear white when viewed, but black when cut and seen on a TechDraw page.\n This is a small improvement so far, but it laid the structure to have more advanced things, such as supporting hatch patterns. The main problem for this, is that, although the SVG format has an excellent support for hatch patterns (anything can become a hatch pattern, even bitmap images), the Qt implementation of the SVG format lacks support for it (it has its own  system but it&#39;s not very practical to make that compatible with SVG). Therefore at the moment we have no clear idea of how to go further.\n TechDraw&#39;s implementation of hatch patterns internally recreates OpenCasCade geometry, which works very well but might be heavy for large BIM models. In any case, that&#39;s a track I&#39;m  exploring too.\n   Another very small fix, but the default door and windows created with the  Door and windows tools now have a hinge edge defined, so their  Opening property now works out-of-the-box. It might not open in the direction you want, though, so you might still need to tweak this. But next items on my list are adding a couple of controls to easily switch opening directions.\n   The Draft patterns system is now working again (hatch patterns can be added to all closed Draft objects such as rectangles, polylines, circles, etc). I also added a preferences option under  Edit -&gt; Preferences -&gt; Draft -&gt; Visual settings to set a default hatch pattern scale, which is useful when you always work with objects of a similar size range, for example building plans. I still have to experiment a bit (0.0025 seems like a very good default setting for BIM), but will add that to the BIM setup screen once I found a couple of good settings.\n   Section planes now have a  Show Label property, which, when turned on, show the section plane label on the plane in the 3D view. This is useful to easily identify these section planes when there are many in your document. The text size currently depends on the arrow size, but I&#39;ll make all this better customizable later on.\n We have further plans too for the section planes, such as be able to double-click or activate them somehow, and find yourself in a separate 2D view with all needed geometry cut or turned off, where you can still work on the model in a 2D environment. This would be a bit like an intermediary step between the full 3D model and a TechDraw view. You can see a first draft of that coded by Carlo Pavan on the experimental tools palette in the BIM workbench.\n   Among the annotation tools on the BIM workbench, you&#39;ll now find two TechDraw tools,  Create page and  Create view. The first one is the same of the  Create page from template TechDraw tool, except that it remembers the last template you used and gets you right there when you use the tool again, so it gives a little bit faster workflow. The second tool is currently the same as the  TechDraw ArchView tool but I plan to make it a bit more flexible in the future so it would become a mix of TechDraw&#39;s ArchView and DraftView tools, depending on the selected objects.\n  The  Schedule tool has been extended to now allow to export results to the .tsv (Tab-Separated Values) format, which is basically the same as the .csv (Comma-Separated Values) format, but using tab characters to separate columns, instead of commas. The big problem of csv, of course, is if there are commas in the columns texts. Usually spreadsheet apps are pretty tolerant with .csv files, they will usually ask you what character to consider as column separator on import, but others (for example GitHub) doesn&#39;t display them correctly if they don&#39;t use a comma as separator. So from now on there is a correct way to please everybody\n   The  FreeCAD exporter for Blender has seen several small fixes, it now automatically adds the .FCStd extension to the generated file if you haven&#39;t added it yourself, it now correctly handles object rotation and scaling, and it applies modifiers before exporting. It now also supports faceless objects (wireframe objects).\n This coupled with the  BlenderBIM improvements, it now becomes increasingly easy to work on BIM models in Blender, or parts of BIM models, and when needed, integrate everything seamlessly in FreeCAD. There are many more joint FreeCAD/Blender developments going on, such as the new  Sverchok nodes that use FreeCAD internally, literally creating a kind of new interface for FreeCAD withing Blender.\n  The BIM workbench will now detect your FreeCAD version on the setup screen, and suggest you to install a development version if you are not using one. This will help people to be aware of the existence of development versions, and become more used to them and how to install and mange them.\n  The overall size of the grid is now settable directly from the  Working Plane task panel.\n   The  start page can now show multiple custom folders. To achieve that, go to the start page preferences under menu  Edit -&gt; Preferences -&gt; Start and instead of choosing one custom folder, type manually several folder paths, separated by ;;\n    The  Draft Scale tool now support image planes created with the  Image workbench. So it is now easy to import reference images such as scanned floor plans, position them on a common reference point, and scale them to the desired size.\n  You can now set default value for these two settings under  Edit -&gt; Preferences -&gt; Draft -&gt; Dimensions and Texts, that will affect all newly created dimensions.\n  And last but not least, I started upgrading the  manual to FreeCAD 0.19, and this time I intend well to produce a printed book with it. To be continued!\n That&#39;s it for this month I guess, I promise to do everything I can to resume posting once per month!", "posttime": "2020-10-31 21:58:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,开发,bim,freecad", "title": "FreeCAD BIM开发新闻-2020年7月/8月/9月", "title_en": "FreeCAD BIM development news – July/August/September 2020", "transed": 1, "url": "https://yorik.uncreated.net/blog/2020-011-freecad-september", "via": "", "real_tags": ["2020", "开发", "bim", "freecad"]}, {"category": "", "categoryclass": "", "imagename": "043839e7ba2139b1181a3f0063639699.png", "infoid": 1032485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈佛大学健康建筑项目主任约瑟夫·G·艾伦(Joseph G.Allen)表示，关于口罩的公共卫生辩论已经尘埃落定。他说，当你戴上口罩时，“你保护了你自己，你保护了别人，你阻止了你自己触摸你的脸。”你发出信号说戴面具是正确的做法。\n在冠状病毒病例仍在上升的情况下，戴上口罩比以往任何时候都更重要。在这部动画中，你将看到一条布料在抗击大流行方面是多么有效。\n面具有多种样式和材质，但它们的工作方式通常是相同的。纤维层捕捉大的呼吸液滴和被称为气溶胶的较小的空气悬浮颗粒，它们可以携带冠状病毒。\n这个过程被称为过滤，而材料捕获颗粒的能力称为过滤效率。\n紧密编织的棉布比大多数普通面料的性能都要好。像N95口罩这样的无纺布材料是最有效的。\n让我们仔细看看过滤是如何在微观层面上起作用的。\n下面是棉质口罩的纤维与不同大小的气溶胶颗粒的比较。冠状病毒的大小和最小的颗粒差不多，但它通常在较大的颗粒内传播。\n这些纤维呈现出一片茂密的森林，当粒子随着气流移动时，它们必须导航。物理定律影响粒子如何与纤维相互作用，以及面具捕捉纤维的效果如何。\n较大的颗粒更容易被捕获。当气流将它们带到可接触的距离内，或者当它们的动量导致它们偏离航线时，它们会直接撞到纤维上，并被卡住。\n最小的颗粒物被空气分子以随机的之字形模式反弹，增加了它们在纤维森林中停留的时间和被捕获的机会。\n中等大小的颗粒是最难过滤的。它们避开了捕获，因为它们跟随气流，扭曲并绕过纤维。\n这是N95口罩的纤维。它们是由合成材料制成的，大小不一，排列随意。\n它们还有一个额外的特点：可以吸引和捕获各种大小的粒子的静电电荷。\n在大多数面罩不足的地方，N95出类拔萃。他们的材料可以过滤至少95%难以捉摸的中等粒子，甚至更多的大小粒子。\n纤维并不是过滤的唯一因素。各种口罩的过滤效率因其形状和适合性而不同。\n一个好的口罩应该有很大的表面积，边缘紧贴，形状要在鼻孔和嘴巴周围留出空间。\n这创造了一个更大的呼吸区来捕捉颗粒，并增加了它们遇到纤维的机会。\n一些口罩有阀门，可以让你更容易呼气，但如果没有过滤器，这些阀门就不会捕获你呼出的气溶胶，所以它们对其他人几乎没有保护作用。\n一辆合身的N95是黄金标准，但如果你拿不到也不用担心。当每个人都戴上口罩时，综合过滤效率就会提高。\n比方说，你戴的口罩过滤掉了你呼出的颗粒物的一半。\n最终到达别人口罩的颗粒会被再次过滤，从而减少通过的数量。\n弗吉尼亚理工大学的气溶胶专家林赛·马尔(Linsey Marr)说：“很明显，尽管布质口罩没有N95那么有效，但在减少传播方面仍然有效。”“即使你没有实现95%的减排目标，有总比没有强。”\n良好的通风和社会距离进一步降低了传播的风险。如果每个人都戴上面具，保持距离，集体利益就会上升。\n增强现实体验让你站在N95呼吸器的放大纤维内，看看它是如何过滤气溶胶的。发射不同大小的气溶胶，看看它们是如何被呼吸器的纤维捕获的。要在您的共享空间中体验这一功能，您需要Instagram应用程序。\n若要在Instagram上查看，请打开设备上的相机并指向下面的二维码。\n资料来源：Audrey Dang和Brent Williams，华盛顿大学能源、环境与化学工程系和气溶胶科学与工程中心；Linsey Marr，弗吉尼亚理工大学土木与环境工程系；Joseph G.Allen，哈佛大学T.H.Chan公共卫生学院；Chris Zangmeister，国家标准与技术研究所材料测量实验室；Edward Vicenzi，史密森学会博物馆保护研究所；Christian J.Kähler，慕尼黑德意志大学流体力学与空气动力学研究所；Jesse V.Jokerst，加州大学圣地亚哥分校纳米工程系；弗兰克·德鲁尼克(Frank Drewnick)，马克斯·普朗克化学研究所粒子化学系；理查德·斯图特(Richard Stutt)，剑桥大学流行病学和模型组。\nInstagram Effect作者：Nick Bartzokas，Lian Chang，Lydia Jessup，Noah Pisner，Caroline Cox-Orrell和Paula Ceballos。Destinée-Charisse Royal补充报道", "note_en": "The public health debate on masks is settled, said Joseph G. Allen, director of the Healthy Buildings program at Harvard. When you wear a mask, “You protect yourself, you protect others, you prevent yourself from touching your face,” he said. And you signal that wearing a mask is the right thing to do.\n With coronavirus cases still rising, wearing a mask is more important than ever. In this animation, you will see just how effective a swath of fabric can be at fighting the pandemic.\n  Masks come in many styles and materials, but they generally work in the same way. Layers of fibers capture large respiratory droplets and smaller airborne particles known as aerosols that can carry the coronavirus.\n  This process is known as filtration, and a material’s ability to trap particles is called filtration efficiency.\n  Tightly woven cotton outperforms most common fabrics. A nonwoven material like that of an N95 respirator is most effective.\n  Let’s take a closer look at how filtration works at the microscopic level.\n  Here is how the fibers of a cotton mask compare with aerosol particles of different sizes. The coronavirus is about the size of the smallest particles, but it usually travels inside the larger ones.\n  The fibers present a dense forest that the particles must navigate as they move with the air stream. The laws of physics influence how the particles interact with the fibers and how well the mask can capture them.\n  Larger particles are easier to trap. They slam straight into the fibers and get stuck when the air stream brings them within touching distance, or when their momentum causes them to veer off course.\n  The smallest particles are bounced around by air molecules in a random zig-zag pattern, increasing the time they spend in the fiber forest and their chances of getting captured.\n  Medium-size particles are the hardest to filter. They evade capture because they follow the air flow, twisting and turning around the fibers.\n  Here are the fibers of an N95 respirator. They are made of synthetic material, vary in size and are arranged randomly.\n  And they have an extra feature: an electrostatic charge that attracts and captures particles of all sizes.\n  Where most masks fall short, N95s excel. Their material can filter at least 95 percent of the elusive medium particles and even more of the large and small ones.\n  Fibers are not the only factor in filtration. Masks of all kinds vary in filtration efficiency based on their shape and fit.\n    A good mask will have a large surface area, a tight fit around the edges, and a shape that leaves space around your nostrils and mouth.\n  This creates a larger breathing zone to catch the particles and increases the chance they will encounter a fiber.\n  Some masks have valves that make it easier to exhale, but without filters, these valves do not trap the aerosols you breathe out, so they do little to protect others.\n  A well-fitting N95 is the gold standard, but don’t worry if you can’t get your hands on one. When everyone wears a mask, the combined filtration efficiency increases.\n  Let’s say the mask you’re wearing filters half of the particles you exhale.\n    The particles that eventually reach someone else’s mask get filtered again, reducing the number that get through.\n  “It’s become clear that cloth masks, even though they’re not as effective as the N95s, are still effective at reducing transmission,” said Linsey Marr, an aerosol expert at Virginia Tech. “Even if you’re not achieving that 95 percent reduction, something is better than nothing.”\n  Good ventilation and social distancing further reduce the risk of transmission. And if everyone wears a mask and keeps their distance, the collective benefit goes up.\n The augmented-reality experience lets you stand inside the magnified fibers of an N95 respirator to see how it filters aerosols. Launch aerosols of different sizes and see how they are captured by the fibers of the respirator. To experience this in your space, you will need the Instagram app.\n  To view on Instagram, open the camera on your device and point to the QR tag below.\n Sources: Audrey Dang and Brent Williams, Department of Energy, Environmental &amp; Chemical Engineering and the Center for Aerosol Science and Engineering, Washington University in St. Louis; Linsey Marr, Department of Civil and Environmental Engineering, Virginia Tech; Joseph G. Allen, T.H. Chan School of Public Health, Harvard University; Chris Zangmeister, Material Measurement Laboratory, National Institute of Standards and Technology; Edward Vicenzi, Smithsonian Institution’s Museum Conservation Institute; Christian J. Kähler, Institute of Fluid Mechanics and Aerodynamics, Bundeswehr University Munich; Jesse V. Jokerst, Department of Nanoengineering, University of California, San Diego; Frank Drewnick, Particle Chemistry Department, Max Planck Institute for Chemistry; Richard Stutt, Epidemiology and Modelling Group, University of Cambridge\n Instagram effect by Nick Bartzokas, Lian Chang, Lydia Jessup, Noah Pisner, Caroline Cox-Orrell and Paula Ceballos. Additional work by Destinée-Charisse Royal.", "posttime": "2020-10-31 21:29:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "告诉,masks,口罩", "title": "口罩起作用了。真的。我们会告诉你怎么做", "title_en": "Masks Work. Really. We’ll Show You How", "transed": 1, "url": "https://www.nytimes.com/interactive/2020/10/30/science/wear-mask-covid-particles-ul.html", "via": "", "real_tags": ["告诉", "masks", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "75b53871ff499c299eb125097555eb27.jpg", "infoid": 1032483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊(Amazon.com)表示，在第三季度雇佣了25万名员工后，该公司目前拥有约100万名员工，这是冠状病毒大流行期间电商销售蓬勃发展推动的增长的一部分，也是这家由杰夫·贝佐斯(Jeff Bezos)于1995年创立的在线书商公司的一个里程碑。\n自那以后，亚马逊几乎扩展到了零售业的每一个角落，从自己的服装系列到杂货店。尽管亚马逊迅速崛起，但它的员工人数仍然少于美国最大的私营雇主沃尔玛(Walmart)，后者在全球拥有220万名员工。\n即便如此，亚马逊的爆炸性增长突显了金融实力从通用汽车(General Motors)、美国钢铁(U.S.Steel)和通用电气(General Electric)等制造商的历史性转变。在20世纪50年代，这三家公司是美国最大的雇主，当时员工总数超过100万。今天，这三家公司雇佣了大约40万名工人，因为美国经济已经削减了工厂工作岗位，转而支持服务型工作。\n这场大流行也将劳动力市场推向新的方向。今年春天，随着美国人呆在家里，杂货店等出售杂货或清洁用品等家庭必需品的企业的需求激增。但迎合游客的行业，如酒店业和旅游业，随着消费者在大流行期间削减旅行计划，受到了影响。\nGlobalData董事总经理尼尔·桑德斯(Neil Saunders)在电子邮件中表示，毫无疑问，亚马逊的最新业绩表明，它仍然是疫情造成的干扰的赢家。亚马逊在拓展物流和送货等部分业务方面处于非常有利的地位。\n在周四的一次电话会议上，亚马逊首席财务官布莱恩·奥尔萨夫斯基表示，公司雇佣了更多的人来支持强劲的客户需求。\n他说，在截至9月份的季度雇佣了25万名全职和兼职员工后，亚马逊在10月份又招聘了10万名员工。他补充说，这些工作的最低工资为每小时15美元，包括医疗保险、退休福利和育儿假等福利。\n与此同时，其他大雇主也在大规模裁员，包括迪士尼(Disney)，该公司上月表示，由于主题公园难以站稳脚跟，将裁员2.8万人。申领失业救济金人数仍处于历史高位，超过2200万美国人正在领取失业救济金。\n即使在疫情爆发期间大举招聘期间，亚马逊的雇佣行为也面临着强烈反对，一些仓库工人抗议公司的政策，一些人声称公司在保护员工免受新冠肺炎伤害方面行动迟缓。\n今年6月，一些仓库工人起诉该零售商，称其未能提供防范冠状病毒的保护措施，例如为工作场所提供足够的卫生用品。一名工人声称，她在仓库感染了新冠肺炎，随后感染了她的堂兄，后者在出现新冠肺炎样症状后死亡。\n这些争议并没有削弱亚马逊的增长。周四，亚马逊公布了第三季度创纪录的利润和收入。该公司公布，在截至9月30日的三个月中实现利润63亿美元，几乎是去年同期收益的三倍。\n随着假日购物季的到来，这家在线购物巨头也预计今年会有一个很大的年底。亚马逊表示，预计第四季销售额将较上年同期增长多达38%，至1,120亿美元至1,210亿美元之间。", "note_en": "Amazon.com said it now has about 1 million employees after hiring 250,000 workers in the third quarter, part of a growth spurt driven by booming ecommerce sales during the   coronavirus pandemic and a milestone for a company founded in 1995 by Jeff Bezos as an online bookseller.\n   Amazon.com has since expanded into almost every corner of the retail sector, ranging from its own line of clothing to grocery stores. Despite its rapid ascent, Amazon still has fewer workers than the nation&#39;s biggest private employer, Walmart, which has 2.2 million global workers.\n Even so, Amazon&#39;s explosive growth underscores the historic shift in financial might from manufacturers such as General Motors, U.S. Steel and General Electric. In the 1950s, these three corporations were the country&#39;s biggest employers, with a  combined workforce of more than 1 million employees at the time. Today, the three employ about 400,000 workers as the U.S. economy has shed factory jobs in favor of service-oriented work.\n  The pandemic is also pushing the labor market in new directions. Businesses such as grocery stores that sell household basics like groceries or cleaning supplies have seen a surge in demand as Americans hunkered down at home this spring. But industries that cater to tourists, such as hospitality and travel, have suffered as consumers cut back travel plans amid the pandemic.\n &#34;There is no doubt that Amazon&#39;s latest results show it continues to be a winner from disruption caused by the pandemic,&#34; said Neil Saunders, managing director of GlobalData, by email. &#34;Amazon is in a very strong position to expand parts of its operation like logistics and delivery.&#34;\n  In a conference call on Thursday, Amazon Chief Financial Officer Brian Olsavsky said the company hired &#34;a lot more people to support the strong customer demand.&#34;\n  After hiring 250,000 full-time and part-time workers in the quarter ended in September, Amazon has hired another 100,000 workers in October, he said. The jobs pay a minimum of $15 an hour and include benefits such as health insurance, retirement benefits and parental leave, he added.\n At the same time, other big employers are having mass layoffs, including Disney, which last month said it would   cut 28,000 workers as its theme parks struggle to regain their footing. Claims for unemployment benefits remain historically high, and more than 22 million Americans   are receiving jobless benefits.\n  Even amid its hiring spree during the pandemic, Amazon faced a backlash over its employment practices, with some warehouse workers protesting the company&#39;s policies and what some claimed to be foot-dragging by the company on protecting employees from COVID-19.\n In June, some warehouse workers   sued the retailer for allegedly failing to provide protections against the coronavirus, such as adequate supplies to sanitize workspaces. One worker claimed she contracted COVID-19 at the warehouse and subsequently infected her cousin, who died after experiencing COVID-19-like symptoms.\n   Such controversies haven&#39;t dented Amazon&#39;s growth. On Thursday, Amazon   reported record profit and revenue during the third quarter. The company reported a $6.3 billion profit in the three months ending September 30, nearly triple its earnings in the year-ago period.\n The online shopping giant is also expecting a big end to the year as the holiday shopping season picks up. Amazon said it expects fourth-quarter sales to rise as much as 38% from a year ago to between $112 billion and $121 billion.", "posttime": "2020-10-31 21:09:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,现在,million", "title": "亚马逊现在有100多万名员工", "title_en": "Amazon Now Has More Than 1 Million Employees", "transed": 1, "url": "https://www.cbsnews.com/news/amazon-1-million-employees/", "via": "", "real_tags": ["amazon", "亚马逊", "现在", "million"]}, {"category": "", "categoryclass": "", "imagename": "443fb78166cd1e98f75aed69f8d85206.jpeg", "infoid": 1032482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Java Thread对象允许我们在单独的线程中运行代码。当应用程序启动时，JVM创建名为main的初始线程。Main方法在主线程上运行。在应用程序内部，我们可以创建新线程，以便与主线程并行执行其他任务。\nJava使用本机操作系统线程。因此，一个操作系统线程映射一个Java线程。\nThread类的构造函数接受一个Runnable对象。Runnable接口有一个抽象的run方法，该方法由Thread#start()方法调用。IT对象可以由lambda、匿名类或实现Runnable方法的类实例化。\n只要线程的Run钩子方法没有返回，线程就会存活。调度程序可以挂起并多次运行线程。为了让线程永远执行，它需要一个无限循环来防止它返回。\nJoin方法允许一个线程等待另一个线程的完成。这是屏障同步的一种简单形式。\n当JVM启动时，它包含名为主线程的单个用户线程。用户线程和守护进程线程之间的主要区别在于它们退出时会发生什么。\n线程类包含布尔型守护程序字段，用于指定线程是否为守护程序。它可以在创建时由构造函数或setter方法设置。\n默认情况下，守护程序字段为false，因此我们生成的大多数线程都是用户线程。如果未指定，线程将复制父威胁的isDaemon状态。Java在某些地方使用守护程序线程，比如ForkJoinPool和Timer。为了说明这一点，我们可以使用以下示例：\nPublic class main{public static void main(String[]args)Thws InterruptedException，ExecutionException{//runDeamonThread()；runUserThread()；System.out.println(getCurrentThreadName()+&#34；exits&#34；)；}私有静态void runDeamonThread()抛出ExecutionException，InterruptedException{ExecutorService ExecutorService=Executors.newWorkStealingPool(10)；ecutorService.Execue.Exception()；}Private static void runrunRserThread()；{Thread=new Thread(getthread.start()；}private static runnable Runnable()；{return()&gT；T；{for(int i=0；i&lt；=200；i++){System.out.print(&#34；.&#34；)；Thread.Year()；}System.out.println(getCurrentThreadName()+&#34；退出。IsDeamon：&#34；+isDaemon())；}；}私有静态布尔isDaemon(){return Thread.currentThread().isDaemon()；}私有静态字符串getCurrentThreadName(){return Thread.currentThread().getName()；}}。\n第二种情况是调用runDeamonThread，它使用ForkJoinPool作为守护程序线程的示例。我可以简单地使用setDaemon(True)方法，但是我想给出一个用法示例。产出：\n因此，当main方法退出时，所有用户线程都将终止，JVM将退出并终止所有守护进程线程，因此我们甚至没有机会看到守护进程线程的输出。\n与创建相比，停止线程是一件相当困难的事情。一旦线程开始运行，它就脱离了调用方，它就有了自己的生命周期。它可以完成任务并退出，或者如果它执行长时间运行的操作，它可以永远工作。Java没有为我们提供自愿停止线程的方法(非弃用的)。\n易失性布尔isStoped=false；public void test(){new Thread(()-&gt；{while(！isStoped){System.out.print(&#34；.&#34；)；}System.out.println(&#34；子出口&#34；)；}).start()；try{Thread.sleep(100)；}catch(InterruptedException E){e.printStackTrace()；}isStoped=true；System.out.println(&#34；main exits&#34；)；\n请注意，该标志是易失性的，以便使其最新值对两个线程都可见。但是，如果线程正在执行休眠、等待、联接或阻塞I/O操作等阻塞操作，则此方法会失败。\n2.另一种停止踏步的方法是使用线程的interrupt()方法。\n对线程的中断请求是它应该停止正在做的事情并做其他事情的指示。线程如何响应中断是由程序员来决定的，但是线程终止是很常见的。\n要使中断机制正常工作，被中断的线程必须支持其自己的中断机制。我们可以检查两种情况是否中断：\n在这种情况下，调用thread.interrupt()方法将设置该线程的中断标志，但如果任务本身不检查中断标志的状态，则不会产生任何影响。例如：\nPublic void test()抛出InterruptedException{ThreadThread=new Thread(()-&gt；{System.out.println(&#34；Child Start&#34；)；While(True){System.out.print(&#34；.&#34；)；}})；thread.start()；thread.interrupt()；thread.join()；System.out.println(&#34；main exits&#34；)；}。\n为了让线程捕获中断，它应该反复检查中断标志的状态，以便了解是否有任何挂起的中断请求，并相应地处理该请求。\n因此，我们可以检查WHILE循环中的标志，如果为真，我们可以返回或中断循环。在lambda表达式中，不可能抛出异常，但是在适当的位置，我们也可以抛出InterruptedException。\nPublic void test()抛出InterruptedException{ThreadThread=new Thread(()-&gt；{System.out.println(&#34；Child Start&#34；)；While(True){if(Thread.interrupted(){Break；}System.out.print(&#34；.&#34；)；}System.out.println(&#34；Child Exits&#34；)；})；thread.start()；thread.interrupt()；thread.join()；System.out.println(&#34；主要出口)；}。\n注Thread.interrupted()方法返回标志的值，如果为真，则将其清除。因此，如果我们希望在堆栈的上层保持Thread的状态为中断，可以使用Thread.currentThread().interrupt()将其设置回去；\n如果线程频繁调用所有都以中断方式运行的阻塞方法(如等待、联接、睡眠、阻塞I/O)，则这些方法会在内部检查它们是否已被中断，如果已中断，它们将自动抛出InterruptedException。应该在适当的上下文中捕获和处理此异常。以下示例在阻塞休眠操作中使用中断来中断循环：\nPublic void test()抛出中断异常{ThreadThreadThread=new Thread(()-&gt；{System.out.println(&#34；Child Start&#34；)；try{While(True){线程睡眠(10000)；}}catch(InterruptedException E){System.out.println(&#34；线程中断：&#34；+e.getMessage())；}System.out.println(&#34；Child Exits&#34；)；})；thread.start()；thread.interrupt()；Thread.join()；System.out.println(&#34；Main Exits&#34；)；}。\n一种方法是将异常传播给调用方，因此将由较高层负责。\n如果不能重新抛出，我们可以使用Thread.currentThread().interrupt()再次将中断状态设置为true，以便在较高层希望检查证据时保留证据。\n因此，总而言之，如果我们想要实现可取消的任务，我们需要定期检查中断状态的状态，并以线程将退出的方式处理中断。\n为了简化线程管理，可以使用对相关线程进行分组的java.lang.ThreadGroup对象来组织多个线程。每个线程组都需要有一个父组。在层次结构中，有一个主组，它是我们在程序中创建的其他组或线程的父组。我们可以通过使用父组和/或名称调用ThreadGroup的构造函数来创建ThreadGroup。要将Thread添加到组中，我们需要在Thread的构造函数中指定该组。\nPublic void test(){ThreadGroup TG1=new ThreadGroup(&#34；Thread-group-1&#34；)；ThreadGroup TG2=new ThreadGroup(TG1，&#34；Thread-group-2&#34；)；Thread thread1=new Thread(TG1，&#34；Thread-1&#34；)；Thread Thread2=new Thread(TG2，&#34；Thread-2&#34；)；Thread Thread3=new Thread(TG2，&#34；Thread-3&#34；)；thread1.start()；thread2.start()；Thread3.start()；Thread[]Thread=new Thread[tg2.activeCount()]；tg2.枚举(线程)；Arrays.asList(线程).forEach(t-&gt；System.out.println(t.getName()；tg1.list()；}。\n我们可以通过调用枚举方法迭代线程，该方法用组的线程引用填充给定数组。\nPublic class ThreadPool{//创建线程组字段Private Final ThreadGroup group=new ThreadGroup(&#34；ThreadPoolGroup&#34；)；//创建包含可运行私有最终列表&lt；Runnable&gt；Tasks=new LinkedList&lt；&gt；()；public ThreadPool(Int PoolSize){//为(int i=0；i&lt；poolSize；i++){var worker=new worker(group，&#34；worker-#34；+i)；worker.start()；在线程组中创建多个工作线程。}}Private Runnable Take()抛出InterruptedException{Synchronized(Tasks){//如果LinkedList为空，我们等待(tasks.isEmpty())tasks.wait()；//从LinkedList中移除第一个作业并返回任务。remove(0)；}}public void mit(Runnable Job){//将作业添加到LinkedList并通知所有同步(Tasks){tasks.add(Job)；tasks.notfyAll()；}}public int getRunQueueLength(){//返回LinkedList的长度//记得也要同步！Synchronized(Tasks){return tasks.size()；}}public void shutdown(){//这将停止组中的所有线程。interrupt()；}私有类worker扩展Thread{public worker(ThreadGroup group，String name){Super(group，name)；}public void run(){//我们在无限循环中运行：while(True){//使用take()从链表中删除下一个作业//然后对作业try{take().run()；调用run()方法；}catch(InterruptedException E){e.printStackTrace()；Break；}\nJava ThreadLocal类可用于创建其值只能由同一线程访问的变量。因此，即使两个线程正在执行相同的代码，并且代码引用了相同的ThreadLocal变量，这两个线程也无法看到对方的ThreadLocal变量。\n公共类Main{public static class ThreadLocalStorage{private static inal ThreadLocal&lt；String&gt；threadLocal=new ThreadLocal&lt；&gt；()；public static void setName(String Name){threadLocal.set(Name)；}public static string getName(){return threadLocal.get()；}}public static void main(String[]args){ThreadLocalStorage.setName(&#34；main thread&#34；)；runnable runnable=()-&gt；{ThreadLocalStorage.setName(getCurrentThreadName())；try{Thread.Slear(1000)；}catch(InterruptedException E){e.printStackTrace()；}System.out.println(&#34；Thread：[&#34；+getCurrentThreadName()+&#34；]&#34；+&#34；-value：[&#34；+ThreadLocalStorage.getName()+&#34；]&#34；)；}；Thread thread1=new Thread(Runnable)；Thread thread2=new Thread(Runnable)；thread1.start()；thread2.start()；Systemout.println(&#34；main exits&#34；)；}；Thread thread1=new Thread(Runnable)；Thread thread2=new Thread(Runnable)；thread1.start()；thread2.start()；Systemout.println(&#34；main exits&#34；)。)；}私有静态字符串getCurrentThreadName(){return Thread.currentThread().getName()；}}。\n如果我们运行代码，我们可以看到每个线程都有自己的ThreadLocal对象副本。\nInheritableThreadLocal不是每个线程在ThreadLocal内都有自己的值，而是将值的访问权限授予一个线程和该线程创建的所有子线程。", "note_en": "Java  Thread objects allow us to run our code in separate threads. When an application starts JVM creates the initial thread named  main. The main method is run on the main thread. Inside the application we can create new threads to execute other tasks in parallel with the main thread.\n Java uses native operating system threads. So one java thread is mapped by one OS thread.\n  The constructor of the  Thread class takes a  Runnable object. Runnable interface has an abstract  run method which is called by  Thread#start() method. It object can be instantiated by a lambda, anonymous class or a class which implements Runnable method.\n    Thread lives as long as the its run hook method has not returned. The scheduler can suspend and run the Thread many times. For a thread to execute forever, it needs an infinite loop that prevents it from returning.\n Join method allows one thread to wait for the completion of another. This is a simple form of barrier synchronisation.\n   When JVM start it contains a single User thread, named Main thread. The main difference between User and Daemon threads are what happens when they exit.\n  Thread class contains boolean  daemon field to specify whether the thread is daemon. It can be set at the time of creation by the constructor or by setter method.\n  By default daemon field is false, so most of the Threads that we generate is a User Thread. Threads copy the  isDaemon status of the parent threat if it is not specified. Java uses Daemon thread in some places such as  ForkJoinPool and  Timer. To illustrate we can use the following example:\n public class Main { public static void main(String[] args) throws InterruptedException, ExecutionException {// runDeamonThread(); runUserThread(); System.out.println(getCurrentThreadName() + &#34; exits&#34;); } private static void runDeamonThread() throws ExecutionException, InterruptedException { ExecutorService executorService = Executors.newWorkStealingPool(10); executorService.execute(getRunnable()); } private static void runUserThread() { Thread thread = new Thread(getRunnable()); thread.start(); } private static Runnable getRunnable() { return () -&gt; { for (int i = 0; i &lt;= 200; i++) { System.out.print(&#34;.&#34;); Thread.yield(); } System.out.println(getCurrentThreadName() + &#34; exits. isDeamon: &#34; + isDaemon()); }; } private static boolean isDaemon() { return Thread.currentThread().isDaemon(); } private static String getCurrentThreadName() { return Thread.currentThread().getName(); }}\n   The second case is invoking the  runDeamonThread which uses  ForkJoinPool as an example of Daemon Threads. I could simply use  setDaemon(true) method, but wanted to give an example usage. Output:\n  So when the main method exits, all the user threads are terminated and JVM exits and kills all daemon threads, so that we did not even have a chance to see output from daemon threads.\n  Compared to creating, stopping a thread is quite hard thing. Once thread starts running it diverges from the caller and it has it is own lifecycle anymore. It can either complete the task and exits or if it does a long running operation it can work forever. Java does not provides us a method (non-deprecated) to stop the thread voluntarily.\n  volatile boolean isStopped = false;public void test() { new Thread(() -&gt; { while (!isStopped) { System.out.print(&#34;.&#34;); } System.out.println(&#34;Child Exits&#34;); }).start(); try { Thread.sleep(100); } catch (InterruptedException e) { e.printStackTrace(); } isStopped = true; System.out.println(&#34;Main exits&#34;);}\n Note that the flag is  volatile in order to make its up-to-date value visible for both threads. However this approach fails if the thread is doing blocking operations such as  sleep,  wait,  join or blocking I/O operations.\n 2. Another way to stop the tread is to use  interrupt() method of the thread.\n An interrupt request to a thread is an indication that it should stop what it is doing and do something else. It is up to the programmer to decide exactly how a thread responds to an interrupt but it is very common for the tread to terminate.\n For the interrupt mechanism to work correctly, the interrupted thread must support its own interruption mechanism. There are 2 cases we can examine for interruption:\n  In this case calling the  thread.interrupt() method will set the interrupt flag of the that thread but if the task itself does not check the status of the interrupted flag it will not have any impact. For example:\n public void test() throws InterruptedException { Thread thread = new Thread(() -&gt; { System.out.println(&#34;Child Starts&#34;); while (true) { System.out.print(&#34;.&#34;); } }); thread.start(); thread.interrupt(); thread.join(); System.out.println(&#34;Main exits&#34;);}\n In order for the thread to catch the interrupt, it should iteratively check the status of the interrupt flag so that it can understand if there are any pending interruption request and handle the request accordingly.\n So we can check the flag in our while loop in if it is true we can return or break the loop. In the lambda expression it is not possible to throw an exception but in appropriate places we can throw  InterruptedException as well.\n public void test() throws InterruptedException { Thread thread = new Thread(() -&gt; { System.out.println(&#34;Child Starts&#34;); while (true) { if (Thread.interrupted()) { break; } System.out.print(&#34;.&#34;); } System.out.println(&#34;Child exits&#34;); }); thread.start(); thread.interrupt(); thread.join(); System.out.println(&#34;Main exits&#34;);}\n Note the  Thread.interrupted() method returns the value of the flag and clears it if it has been true. So if we want to keep the state of the Thread as interrupted for the upper level of stack, we can set it back with  Thread.currentThread().interrupt();\n  If a thread frequently calls the blocking methods such as  wait,  join,  sleep,  blocking I/O which are all run interruptively, these methods internally check if they have been interrupted and if so they automatically throw  InterruptedException. This exception should be caught and handled in the appropriate context. The following example uses the interruption to break the loop in a blocking  sleep operation:\n public void test() throws InterruptedException { Thread thread = new Thread(() -&gt; { System.out.println(&#34;Child Starts&#34;); try { while (true) { Thread.sleep(10000); } } catch (InterruptedException e) { System.out.println(&#34;Thread interrupted: &#34; + e.getMessage()); } System.out.println(&#34;Child Exits&#34;); }); thread.start(); thread.interrupt(); thread.join(); System.out.println(&#34;Main exits&#34;);}\n  One approach is propagating the exception to the callers, so higher layer would be responsible.\n  If it is not possible to re-throw, we can set the interrupted status to true again with  Thread.currentThread().interrupt() to preserve the evidence if the higher layers want to check it.\n So as a conclusion if we want to implement cancellable tasks we need to periodically check the status of the interrupt status and handle the interruption in a way that thread will exit.\n  In order to simplify thread management, multiple threads  can be organised with  java.lang.ThreadGroup objects that group related threads. Each Thread Group needs to have a parent group. In the hierarchy, there is the  Main group which is the parent of the other groups or threads we create in the program. We can create  ThreadGroup by calling its constructor with a parent group and/or name. To add the Threads in a group we need to specify the group in the Thread&#39;s constructor.\n public void test() { ThreadGroup tg1 = new ThreadGroup(&#34;Thread-group-1&#34;); ThreadGroup tg2 = new ThreadGroup(tg1, &#34;Thread-group-2&#34;); Thread thread1 = new Thread(tg1,&#34;thread-1&#34;); Thread thread2 = new Thread(tg2,&#34;thread-2&#34;); Thread thread3 = new Thread(tg2,&#34;thread-3&#34;); thread1.start(); thread2.start(); thread3.start(); Thread[] threads = new Thread[tg2.activeCount()]; tg2.enumerate(threads); Arrays.asList(threads).forEach(t -&gt; System.out.println(t.getName())); tg1.list();}\n We can iterate over the threads by calling the  enumerate method, which fills the given array with the thread references of the group.\n  public class ThreadPool { // Create a thread group field private final ThreadGroup group = new ThreadGroup(&#34;ThreadPoolGroup&#34;); // Create a LinkedList field containing Runnable private final List&lt;Runnable&gt; tasks = new LinkedList&lt;&gt;(); public ThreadPool(int poolSize) { // create several Worker threads in the thread group for (int i = 0; i &lt; poolSize; i++) { var worker = new Worker(group, &#34;worker-&#34; + i); worker.start(); } } private Runnable take() throws InterruptedException { synchronized (tasks) { // if the LinkedList is empty, we wait while (tasks.isEmpty()) tasks.wait(); // remove the first job from the LinkedList and return it return tasks.remove(0); } } public void submit(Runnable job) { // Add the job to the LinkedList and notifyAll synchronized (tasks) { tasks.add(job); tasks.notifyAll(); } } public int getRunQueueLength() { // return the length of the LinkedList // remember to also synchronize! synchronized (tasks) { return tasks.size(); } } public void shutdown() { // this should stop all threads in the group group.interrupt(); } private class Worker extends Thread { public Worker(ThreadGroup group, String name) { super(group, name); } public void run() { // we run in an infinite loop: while(true) { // remove the next job from the linked list using take() // we then call the run() method on the job try { take().run(); } catch (InterruptedException e) { e.printStackTrace(); break; } } } }}\n  Java  ThreadLocal class can be used to create variables whose value can be accessible by only the same thread. So, even if two threads are executing the same code, and the code has a reference to the same  ThreadLocal variable, the two threads cannot see each other&#39;s  ThreadLocal variables.\n public class Main { public static class ThreadLocalStorage { private static final ThreadLocal&lt;String&gt; threadLocal = new ThreadLocal&lt;&gt;(); public static void setName(String name) { threadLocal.set(name); } public static String getName() { return threadLocal.get(); } } public static void main(String[] args) { ThreadLocalStorage.setName(&#34;Main thread&#34;); Runnable runnable = () -&gt; { ThreadLocalStorage.setName(getCurrentThreadName()); try { Thread.sleep(1000); } catch (InterruptedException e) { e.printStackTrace(); } System.out.println(&#34;Thread: [&#34; + getCurrentThreadName() + &#34;] &#34; + &#34;- value: [&#34; + ThreadLocalStorage.getName() + &#34;]&#34;); }; Thread thread1 = new Thread(runnable); Thread thread2 = new Thread(runnable); thread1.start(); thread2.start(); System.out.println(&#34;Main exits&#34;); } private static String getCurrentThreadName() { return Thread.currentThread().getName(); }}\n If we run the code we can see that each thread has its own copy of the ThreadLocal object.\n  Instead of each thread having its own value inside a  ThreadLocal, the  InheritableThreadLocal grants access to values to a thread and all child threads created by that thread.", "posttime": "2020-10-31 21:01:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,线程,并发,concurrency", "title": "Java并发性-了解线程的基础知识", "title_en": "Java Concurrency – Understanding the Basics of Threads", "transed": 1, "url": "https://turkogluc.com/java-concurrency-basics-of-threads/", "via": "", "real_tags": ["java", "线程", "并发"]}, {"category": "", "categoryclass": "", "imagename": "7d46a037214b3a9790f8a30ae9ac5fe1.png", "infoid": 1032481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位苏格兰演员最出名的是他对詹姆斯·邦德的刻画，他是第一个将这个角色搬上大银幕的人，并在七部间谍惊悚片中亮相。\n肖恩爵士在巴哈马群岛时，在睡梦中连夜去世。据悉，他身体不适已有一段时间了。\n他的演艺生涯跨越了几十年，他的许多奖项包括一项奥斯卡奖，两项英国自贸奖和三项金球奖。\n肖恩爵士的其他电影包括“红色十月的追捕”、“印第安纳·琼斯”和“最后的十字军东征与岩石”。\n他在很大程度上被认为是在这部长期运营的系列中扮演007的最佳演员，经常在民意调查中被提名为007。\n他的奥斯卡奖是在1988年获得的，当时他因在“贱民”中饰演一名爱尔兰警察而获得最佳男配角奖。\n你认识肖恩·康纳利爵士或与之共事吗？你对他有什么记忆？通过电子邮件haveyou say@bbc.co.uk分享您的经验。\n如果您愿意与BBC记者交谈，请提供联系电话。您也可以通过以下方式联系：\n如果您正在阅读本页，但看不到表格，您将需要访问BBC网站的移动版本来提交您的问题或评论，或者您可以通过电子邮件向我们发送电子邮件至HaveYourSay@bbc.co.uk。请在投稿时注明您的姓名、年龄和所在地。", "note_en": "The Scottish actor was best known for his portrayal of James Bond, being the first to bring the role to the big screen and appearing in seven of the spy thrillers.\n Sir Sean died overnight in his sleep, while in the Bahamas. It is understood he had been unwell for some time.\n His acting career spanned decades and his many awards included an Oscar, two Bafta awards and three Golden Globes.\n Sir Sean&#39;s other films included The Hunt for Red October, Indiana Jones and the Last Crusade and The Rock.\n  He was largely regarded as being the best actor to have played 007 in the long-running franchise, often being named as such in polls.\n His Oscar came in 1988, when he was named best supporting actor for his role as an Irish cop in The Untouchables.\n    Did you know or work with Sir Sean Connery? What are your memories of him? Share your experiences by emailing  haveyoursay@bbc.co.uk .\n Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:\n   If you are reading this page and can&#39;t see the form you will need to visit the mobile version of the  BBC website to submit your question or comment or you can email us at  HaveYourSay@bbc.co.uk. Please include your name, age and location with any submission.", "posttime": "2020-10-31 21:01:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "康纳利,sean,bbc", "title": "肖恩·康纳利爵士逝世，享年90岁", "title_en": "Sir Sean Connery dies aged 90", "transed": 1, "url": "https://www.bbc.co.uk/news/entertainment-arts-54761824", "via": "", "real_tags": ["康纳利", "sean", "bbc"]}, {"category": "", "categoryclass": "", "imagename": "ab219408dd6ba28f1f255fd4c90b76f1.jpeg", "infoid": 1032480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个项目验证了“纽约邮报”那篇报道中那封确凿无疑的电子邮件实际上是6年前发出的一封有效电子邮件。我们之所以知道这一点，是因为GMail用DKIM&34；对其进行了加密签名。\n此存储库包含原始电子邮件，外加发送电子邮件时谷歌的DKIM密钥。Gmail的DNS服务器不再提供此密钥，因此您必须自己破解服务器，例如使用BIND9作为响应策略区域(RPZ)的解析器。\n请记住，虽然这封电子邮件是有效的，但上下文并不是。这可能反映了与副总统拜登密谋的秘密会面。或者，这名男子也有可能参加了华盛顿特区众多社交活动中的一场，人们在那里与政客握手，互相寒暄。据说黎塞留曾说过，最诚实的人给我六个字，我就会找些东西吊死他。给我一封最诚实的人的电子邮件，我就会断章取义，把他们吊死在社交媒体的法庭上。\n正如你所料，很多人试图挑战这一点。他们中的许多人反映了误解，或者人们在没有阅读或理解文章的情况下发送了声称DKIM中断的文章的链接。然而，有三个挑战。它们是：\n(Q)但我们无法从Google获得验证密钥。(A)它已在网上到处存档，因此是值得信赖的。\n(Q)Gmail验证来自该帐户的帐户，但不会验证控制该帐户的人(B)我们在其他地方看到Pozharskyi使用此帐户。\n(Q)Date：字段实际上并不为消息加时间戳。(A)签名密钥的有效期为2012年1月至2015年10月，在必须发送时给出时间戳窗口。\n它是从这个特定的账户v.pozharski.ukraine@gmail.com发送的，已知曾被Burisma董事会成员Vadym Pozharskyi使用\n预定收件人的账户是hbiden@rosemontseneca.com，已知该账户曾被亨特·拜登(Hunter Biden)使用。\n如果您运行自己的解析器，它们都能够覆盖某些记录，因此您可以插入这一条记录(对于20120113._domainkey.gmail.com TXT)，以便任何工具都可以工作，例如用于Thunderbird的DKIM Verizer插件。Google&#34；用于BIND9&#34；的响应策略区域。那是我第一次做的事。\n一旦您复制了电子邮件的验证，请尝试更改它们，看看它们是否仍在验证。然后更改并更改签名。砍掉吧。找出一些方法来验证伪造/篡改的电子邮件的真实性。\n许多都无法验证。它们来自不使用DKIM签署传出电子邮件的域。其他人在发送时使用DKIM，但我们再也找不到验证他们身份的公钥了(这已经是多年前的事了)。\n他们使用公钥密码的数学技巧，生成一对匹配的密钥。用其中一个(私钥)签名的东西只能用另一个(公钥)进行验证。\n公钥签名是比特币的基础。如果你能找到伪造这些签名的方法，你可以立即赚到数十亿美元。\n诀窍是您必须将私钥保密。当人们闯入一台电脑并窃取钱包的私钥时，比特币有时确实会被盗。如果有人侵入Gmail，他们也可以伪造签名。\n所以很多人都会问这个问题。他们知道基本的校验和，并且知道如果您更改了内容，只需更改校验和即可匹配。他们不理解的步骤是涉及公钥，即在不知道匹配的私钥的情况下，无法调整签名以匹配内容。\n好的，您已经验证元数据，但是不能更改电子邮件正文的内容吗？&#34；\n签名涵盖元数据和正文。任何一项稍有改动都会使签名无效。\n好的，您已经验证了电子邮件内容，难道元数据不能被欺骗吗，比如上个月发送的真实电子邮件？\n签名涵盖元数据和正文。是的，一些电子邮件元数据不在签名范围内，像X-Received：Header这样的深奥内容。但是签名确实涵盖了我们关心的内容：date：、from：、to：和Subject：。\n有几个人引用了维基百科的这篇文章，说DKIM签名不包括邮件信封。这是正确的，但它的意思并不是你可能认为的那样。\n这就好比有人给你发了一份这封电子邮件的打印件。外面的地址与内容无关--这并不意味着内容不能被认证。\n无论如何，谷歌强迫这两者是一样的。如果电子邮件显示发件人：aGMail帐户，并且它是由Gmail的DKIM密钥验证的，那么它来自该帐户的Froman验证用户。\n标题/元数据中的Date：字段包含在签名中。DKIM验证该字段的内容(某人在签名后未更改)，但不验证其日期是否正确。任何欺诈性信息都可以放在这里。\n但欺诈必须在电子邮件发送时发生。而这一时间应该在2016年10月之前，当时Gmail更改了他们的DKIM签名密钥。\n换句话说，我们知道它来自Vadym Pozharskyi，但他不能比认证电子邮件标题声称的发送时间晚一年左右，比如2016年4月，而不是2015年4月。\n电子邮件头/元数据中还有其他时间戳，但它们未经DKIM验证，因此可能是伪造的。\n这就像是一个有点怀孕的人。如果您更改了最小的东西，那么整个重签名就会失败--并且验证也会失败。不管它有多小都无关紧要。\n嗯，除了空格。DKIM使用宽松的验证方案，允许在某些情况下添加空格。\n但即便如此，这在这里也不是问题。这条消息使用了带引号的可打印编码，这意味着几乎没有地方可以添加空格。\n但在这种情况下，由于Gmail如此流行，旧密钥的来源数以千计，包括旧网站的档案、来自服务器的日志文件等等。\n因此，理论上，该系统仅在有问题的域当前提供公钥来验证签名时才起作用，实际上我们可以知道Gmail出售的密钥，即使他们不直接提供它。\n正确的密钥是这个项目中的一个文件，但当然，我可能是在撒谎。您可以通过谷歌搜索密钥、搜索Archive.org等档案或通过保留旧密钥副本的专业日志记录站点来验证这一点。\n是的，那是个问题。其他DKIM验证工具和库可以从文件中获取密钥，因此您可以尝试这样做(如此)。\n我所做的是将BIND9设置为我的DNS解析器，然后配置响应策略区域(RPZ)，更改了这一条记录。这意味着它将为任何其他名称提供实时解析，但会用我从互联网网站检索到的旧密钥覆盖正确的响应(找不到)。\n以这种方式覆盖解析器中的某些记录是相当常见的做法。如果您已经管理了自己的DNS服务器，您可以很容易地更新它以提供正确的公钥。\n我有很多自信的推特专家宣称DKIM是可以伪造的，他们只是在重复谣言，而不知道是怎么回事。他们也不会复制这一核实，也不会证明这封电子邮件是如何特别伪造的。\n他们引用的最常见来源是以下网页，声称DKIM不起作用：\n因此，这封电子邮件是真实的，但该账户可能是假的，发信人自称是波扎尔斯基(Pozharskyi)。\n是的，那是可能的。我们只证明了一位Vadym Pozharskyi发送了这封电子邮件，而不是Vadym Pozharskyi发送的。这个人在2014年声称自己是来自乌克兰的V.Pozharskyi。\nDKIM只证明该帐户确实是v.pozharski.ukraine@gmail.com。您可以创建一个帐户rob.graham.usa@gmail.com，Gmail会很高兴地验证这些发送的消息，而无需验证发送它们的人实际上是罗伯特·格雷厄姆(Robert Graham)。在任何情况下，即使它可以验证一个人的真实姓名，它也不能验证它和我一样是罗伯特·格雷厄姆(Robert Graham)。\n因此，我们知道这些电子邮件(基于DKIM)来自某个自称是Vadym Pozharskyi的人，但没有办法证明这是我们的Vadym。\n但是，还有其他消息来源证实他使用了这个地址。例如，有一份来自参议院调查的文件显示，他去年使用了那个Gmail地址。\nDKIM会验证日期(日期：)。如果有人声称自己见到了亨特的父亲，那么这就是2014年的阴谋，而不是2020年的阴谋。这意味着有人知道亨特·拜登的私密信息，向他发送虚假信息，希望在未来的选举中，他们能够侵入亨特的电子邮件账户，揭露他们的身份。\n就像他们侵入Gmail以获取私钥的理论一样，如果阴谋如此复杂，他们可以制作更好的电子邮件。这个太差劲了。\n在某些情况下，文件中的元数据(如照片)需要特殊工具。但电子邮件只是文本，甚至是元数据。可以在任何文本编辑器中打开。只需单击此链接即可亲自查看。\n当Gmail第一次开始DKIM签名时，他们使用的是1024位RSA密钥。这些都是一个民族国家(如俄罗斯)可以破解它们的缩写。\n但自2012年以来，他们一直在使用2048位RSA密钥，即使是所有合作的国家都无法破解。\n注意：该链接也是验证此密钥是否正确的另一个来源。\n首先，无论来源如何，电子邮件的验证都是可靠的。我们知道这是一封由Gmail在大约那个时候由那个指定的账户发送的电子邮件。它从哪里来并不重要，我们可以知道这些事实。\n第二点是，即使我有一份笔记本电脑硬盘的副本，它在送到我手中的过程中也经过了这么多人的手，以至于它是不值得信任的。我的意思是，如果你一开始就怀疑笔记本电脑的故事，我不认为我有一份拷贝就能证明他们的故事是真的。\n我个人对这封电子邮件的来源以及他们试图推动的整体叙事有很多疑问。无论如何，我可以验证关于这封电子邮件的基本事实。", "note_en": "This project validates that the &#34;smoking gun&#34; email from that NYPost storyactually was a valid email sent 6 years ago. We know this because GMailcryptographically signed it with &#34;DKIM&#34;.\n This repository contains the original email, plus Google&#39;s DKIM key at thetime the email was sent. This key is no longer provided by GMail&#39;s DNSservers, so you have to hack up a server yourself, such as using BIND9as a resolver with a Response Policy Zone (RPZ).\n Remember that while the email is validated, the context isn&#39;t. It&#39;s possible thisreflects a secret meeting to conspire with Vice President Biden. Or, it&#39;s possible theguy attended one of the many Washington D.C. social functions whereby peopleshake hands with politicians and exchange pleasantries. As Richelieu is claimed to havesaid  &#34;Give me six words by the most honest of men and I&#39;ll find something to hang him by&#34;.Give me an email dump from the most honest of persons, and I&#39;ll pull one out of contextto hang them in the court of social media.\n As you would expect, many people try to challenge this. Many of them reflect misunderstandings,or people sending links to articles claiming &#34;DKIM breaks&#34; without having read or understoodthe article. There are three challenges, however. These are:\n (Q) but we can&#39;t get the validation key from Google. (A) it&#39;s been archived all over the web, and thus is trustworthy\n (Q) GMail verifies it&#39;s from that account, but not who controled that account (B) we see this account used by Pozharskyi elsewhere\n (Q) The  Date: field doesn&#39;t actually timestamp the message. (A) The signing key was valid from Jan-2012 to Oct-2015, giving a timestamp window when it must&#39;ve been sent\n     it was sent from this specific account,  v.pozharskyi.ukraine@gmail.com,known to have been used by Vadym Pozharskyi, a Burisma board member\n the intended recipient was to the account  hbiden@rosemontseneca.com,known to have been used by Hunter Biden\n   If you run your own resolver, they all have ability to override certain records,so you can insert this one record (for  20120113._domainkey.gmail.com TXT)so that any tool will work, such as the DKIM Verifier add-on for Thunderbird.Google &#34;Response Policy Zones for BIND9&#34;. That&#39;s what I first did.\n Once you&#39;ve replicated that the emails verify, try to change them and see ifthey still verify. Change then and change the signature. Hack away. Findsome way that verification can happen with forged/altered emails.\n   Many can&#39;t be validated. They are sent from domains that don&#39;t use DKIMto sign outgoing emails. Others used DKIM when sent, but we can no longerfind the public-keys that would authenticate them (it&#39;s been years).\n   They use a mathematical trick of  public-key crypto where a pair of matching keysare generated. Something signed with one, a  private-key, can only be verified with theother, the  public-key.\n Public-key signatures it what underlies Bitcoin. If you could find a way to forge thesesignatures, you could instantly make billions of dollars.\n The trick is you have to keep the private-key private. Bitcoin do sometimes get stolenwhen people break into a computer and steal the wallet&#39;s private-key. If somebody brokeinto GMail, they&#39;d be able to forge signatures as well.\n So many people ask this question. They know basic &#39;checksums&#39;, and know that if you changethe contents you can just change the checksum to match. The step they don&#39;t undestandis that public-keys are involved, that without knowing the matching private-key, there&#39;sno way to adjust the signature to match the contents.\n &#34;Okay, you&#39;ve verified the metadata, but couldn&#39;t the contents of the body of the email be changed?&#34;\n The signature covers both the metadata and the body. The slightest change to eitherinvalidates the signature.\n &#34;Okay, you&#39;ve verified the email contents, couldn&#39;t the metadata be spoofed, such as the real email being sent last month?&#34;\n The signature covers both the metadata and the body. Yes, some email metadata isn&#39;t covered bythe signature, esoteric things like  X-Received: headers. But the signature does cover theones we care about:  Date:,  From:,  To:, and  Subject:.\n  Several people have cited this Wikipedia article that says that DKIM signatures do not encompass the message envelope.This is correct, but it doesn&#39;t mean what you might think it means.\n It&#39;s like if somebody sent you a printed copy of this email. The addresson the outside is unrelated to the contents -- it doesn&#39;t mean the contentsaren&#39;t authenticate.\n In any case, Google forces the two to be the same. If the email says  From: aGMail account, and it was authenticated by GMail&#39;s DKIM key, then it came froman authenticated user of that account.\n  The  Date: field in the headers/metadata is included in the signature.DKIM verifies the contents of that field (that somebody didn&#39;t alter after signing),but not that it&#39;s the correct date. Any fraudulent information can be put here.\n But the fraud would have to occur at the time the email was sent. And that timewould have be before October 2016, when GMail changed their DKIM signing keys.\n  In other words, we know it came from Vadym Pozharskyi, but he couldn&#39;t sent itaround a year later than the authenticated email headers claimed he sent it, like April 2016instead of April 2015.\n There are other timestamps in the email headers/metadata, but they aren&#39;tvalidated by DKIM, and hence, could be forged.\n  It&#39;s like being a &#34;little bit pregnant&#34;. If you changed the smallest thing, then the entiresignatures fails -- and verification fails. It doesn&#39;t matter how small.\n Well, except spaces. DKIM uses a &#34;relaxed&#34; verification scheme which allows, in certaincircumstances, spaces to be added.\n But even that isn&#39;t an issue here. This message used the &#34;quoted printable&#34; encoding,which means there&#39;s almost no place to add a space.\n   But in this case, because GMail is so popular, there are thousands of sourcesof the old key, including archives of old sites, log files from servers, and soon.\n Thus, in theory the system only works when the domain in question is currentlyproviding the public-key to validate signatures, in practice we can know GMail&#39;sold key even if they don&#39;t provide it directly.\n The proper key is one of the files in this project, but of course, I couldbe lying. You can verify this by googling the key, searching archiveslike Archive.org, or by specialty logging sites that have retainedcopies of the old key.\n  Yes, that&#39;s a problem. Other DKIM verification tools and libraries can grabthe key from a file, so you could try that ( like this one).\n What I did instead was set up BIND9 as my DNS resolver, then configureda &#34;Response Policy Zone&#34; (RPZ) with this one record changed. This meansthat it&#39;ll provide live resolution for any other names, but overwritethe correct response (of &#34;not found&#34;) with the old key that I retrievefrom Internet websites.\n Overriding certain records in a resolver this way is pretty common practice.If you manage your own DNS server already, you can easily update it toprovide the correct public-key.\n  I lot of confident Twitter &#34;experts&#34; proclaim tha DKIM can be faked.They are just repeating rumors without understanding how. They alsoaren&#39;t reproducing this verification or demonstrating how this emailspecifically could&#39;ve been faked.\n The most common source they cite is the following web page to claim DKIM doesn&#39;t work:\n       &#34;So the Email is real, but the account could be fake, by someone  claiming to be Pozharskyi.&#34;\n Yup, that&#39;s possible. We&#39;ve only proven  a Vadym Pozharskyi sent the email,not that  the Vadym Pozharskyi sent it. It&#39;s somebody who, in 2014, claimedto have been a &#34;V. Pozharskyi from Ukraine&#34;.\n DKIM proves only thatthe account indeed was  v.pozharskyi.ukraine@gmail.com.You can create an account  rob.graham.usa@gmail.com,and GMail will happily verify those outgoing messages without verifyingthe person sending them is actually named Robert Graham. In any event,even if it could verify a person&#39;s real name, it couldn&#39;t verify it&#39;s the sameRobert Graham as myself.\n Thus, we know the emails (based on DKIM) come from somebody claiming tobe a Vadym Pozharskyi, but there&#39;s no way to prove it&#39;s our Vadym.\n But, there are  other sources that validate that he used this address.For example, there&#39;s  this documentfrom a Senate investigation showing him using that GMail address last year.\n DKIM does verify the date ( Date:). If it&#39;s somebody claiming to have been Pozharskyiclaiming to have met Hunter&#39;s dad, then it&#39;s a conspiracy from 2014 not aconspiracy from 2020. It would mean somebody who knew intimate details aboutHunter Biden sending him fake messages on the off chance that in a future electionthey would be able to hack into Hunter&#39;s email account to expose them.\n Like the theory of them hacking into GMail to obtain the private-key, if theconspiracy was this sophisticated, they could do better emails. This one is lame.\n  In some cases, metadata in files like photographs require special tools. But emailsare just text, even the metadata. You can open in any text editor. Just clickon this  linkand see for yourself.\n  When GMail first started DKIM signing, they used 1024 bit RSA keys. These are shortenough that a nation state (like Russia) can crack them.\n But since 2012, they&#39;ve been using 2048 bit RSA keys,which even all the nation states working together cannot crack.\n Note: that link is also yet another source verifying this key is the correct one.\n   The first is that validation of the email is solid  regardless of source. We know it wasan email sent by GMail from around that time by that named account. Doesn&#39;t matter where itcame, we can know these facts.\n The second is that even if I had a copy of the laptop drive, it&#39;s passedthrough so many hands on the way to me that it&#39;s untrustworthy. I mean,if you doubt the &#34;laptop&#34; story to begin, I don&#39;t think me having a copycould validate that their story is true.\n I personally have many doubts about where this email came from, and theoverall &#34;narrative&#34; they are trying to push. Regardless, I can validate thebasic facts about this email.", "posttime": "2020-10-31 20:37:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dkim,message,验证", "title": "使用DKIM向亨特·拜登验证消息", "title_en": "Authenticating a message to Hunter Biden using DKIM", "transed": 1, "url": "https://github.com/robertdavidgraham/hunter-dkim//", "via": "", "real_tags": ["dkim", "message", "验证"]}, {"category": "", "categoryclass": "", "imagename": "2bd30da67f144ebbbf5f4012142e59ee.jpg", "infoid": 1032479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将黏糊糊的、思考的大脑与冰冷、零点的计算机连接起来，最困难的部分是通过你的厚厚的头盖骨--或者我的，或者任何人的头盖骨--获取信息。毕竟，头盖骨的全部意义在于让大脑安全地与(在任何事情上挥手)分开。\n因此，如果那个大脑不是你的，唯一能知道它里面发生了什么的方法就是推断。人们根据大脑告诉身体做什么来做出非常有根据的猜测-比如，如果身体发出一些你可以理解的声音(那就是语音)，或者以一种可识别的方式四处走动。对于试图了解大脑如何工作的人来说，这是一个问题，对于那些由于受伤或疾病而无法移动或说话的人来说，这是一个更大的问题。先进的成像技术，如功能磁共振，可以给你一些线索。不过，如果能有更直接的东西就太好了。几十年来，技术专家们一直在努力让大脑与电脑键盘或机器人手臂接口，让肉与硅进行交流。\n周三，一个由科学家和工程师组成的团队展示了一种前景看好的新方法的结果。它包括将电极安装在一种名为支架的可扩展、有弹性的管子上，并将其穿过通向大脑的血管。在对两个人进行的测试中，研究人员从字面上攻击了颈静脉，将一根支架顶端的金属丝穿过喉咙中的静脉，然后进入大脑初级运动皮质附近的血管，在那里他们弹开了弹簧。电极依偎在血管壁中，当人们的大脑发出移动意图的信号时，电极开始感知-并通过外科手术插入受试者胸部的红外发射器将这些信号无线发送到计算机。在“神经介入外科杂志”上发表的一篇文章中，澳大利亚和美国的研究人员描述了两名因肌萎缩侧索硬化症(更广为人知的名字是卢·格里克病)而瘫痪的人是如何使用这样的设备发送短信和仅通过大脑控制在网上闲逛的。\n自我膨胀支架技术已经在心脏和神经治疗其它疾病的应用中得到了很好的证明。我们只是利用这一功能，在支架上放置电极，“希望将该技术商业化的Synchron公司的介入神经学家兼首席执行官托马斯·奥克斯利(Thomas Oxley)说。“这是完全可植入的。病人几天后就可以回家了。而且它是即插即用的。“。\n受试者一回到家就开始训练。充斥电极的支架可以接收来自大脑的信号，但机器学习算法必须找出这些信号-即使在理想条件下也不完美地反映了工作中的大脑-实际上代表了什么。但经过几周的工作，两名患者都可以使用眼球跟踪器移动光标，然后使用植入物，有想法地点击。这听起来不是很多，但这足以让他们两人都发送短信，在网上购物，或者以其他方式进行数字日常生活活动。\n美国食品和药物管理局(Food And Drug Administration)还没有批准奥克斯利所说的“stolode”广泛使用，该公司仍在寻求更多测试的资金，但这些初步结果表明，它是一个正常工作的脑机接口。它接收到的信号并没有装满信息。就目前而言，stenede获得的只是一点信息--要么是心灵感应的鼠标点击，要么就是没有这种点击。但对于某些应用程序来说，这可能就足够了。“有很多关于数据和渠道的讨论，真正重要的是，你给患者提供了改变生活的产品了吗？”奥克斯利说。“只要把他们控制的几个输出恢复给病人，我们就能让他们控制Windows10。”\n最近，更多雄心勃勃的脑机接口和神经假体出现在新闻中。上个月，埃隆·马斯克(Elon Musk)的公司Neuralink展示了一种无线脑机接口(BCI)，它有一千多个灵活的电极，可以由专门的机器人外科医生直接插入大脑。(到目前为止，该公司只显示出在猪身上的短期使用。)。插入电极是一件棘手的事；虽然脑外科手术确实不是一门严格意义上的火箭科学，但无论外科医生是不是机器人，它都有风险。即使像Neuralink展示的那些柔软、薄的电极也具有足够的侵入性，以至于大脑试图防御它们，给它们覆盖上胶质细胞，降低它们传导正在寻找的电脉冲的能力。虽然像更常用的“犹他州阵列”那样的植入电极可以从单个神经元获得清晰的信号，但理解这些信号的含义仍是一门科学。此外，大脑就像甜甜圈里的果冻一样晃动；固定在适当位置的电极可能会损坏它。但是如果做对了，他们可以做的不仅仅是大脑研究。“锁定”的肌萎缩侧索硬化症患者已经将它们用作成功的脑机接口，尽管它们需要培训、维护、手术等。\n最近的一项创新，皮质电成像，将一网电极直接放置在大脑表面。与这些电极接收到的信号的智能频谱处理相结合，皮层脑电图足以将控制嘴唇、下巴和舌头的运动皮质部分的动作转换为文本甚至语音。还有其他方法。Ctrl-Labs在2019年被Facebook以可能高达10亿美元的价格收购，它试图从手腕上的神经元获得运动信号。Kernel在头部使用功能性近红外光谱来感知大脑活动。\n奥克斯利和他的同事们的stenede如果继续显示出良好的结果，将适合于植入电极和脑电图之间的某个频谱。它的发明者希望第一件事比第二件事更接近第一件事。但现在还为时尚早。加州大学圣地亚哥分校(UC San Diego)翻译神经工程实验室的负责人维卡什·吉尔贾(Vikash Gilja)表示：“核心技术和核心想法非常酷，但考虑到他们从哪里获取信号，我的预期是，与其他脑机接口策略相比，这是一个相对低保真的信号。”维卡什·吉尔贾(Vikash Gilja)是加州大学圣地亚哥分校(UC San Diego)翻译神经工程实验室的负责人。“我们至少知道，从大脑表面进行的高密度皮层脑电图记录可以传达本文所展示的以外的信息。”\n一个可能的问题是：组织传导电脉冲，但支架中的电极通过血管细胞接收来自大脑的信号。这降低了信号内容。吉尔贾说：“如果我们将这些皮层表面记录与犹他州的阵列实验进行比较--植入电极的大部分临床经验--我会说ECoG的记录风格是一种速率限制器。”(为了透明，我应该指出，吉尔贾曾与包括Neuralink在内的BCI公司进行过付费工作，理论上Synchron有朝一日可能会与之竞争。)。\n因此，对于神经科学来说，它可能还不够好，但对于一个瘫痪的人来说，它可能会很有用，因为他想要一个低维护的BCI，而不需要在头骨上钻孔。加拿大西部大学的神经学家安德鲁·普鲁辛斯基(Andrew Pruszynski)说：“在你想要有多大的侵入性和你收集信息的水平之间存在权衡。”“这是为了达到中间立场，在靠近神经活动的地方插入一根导管。它显然是有侵入性的，但肯定不像把电极放入大脑那样有侵入性。“。\n还有更多的工作要做。奥克斯利的团队希望将他们的研究扩展到更多的人类对象。他们将寻找可能的副作用，比如支架可能导致中风的可能性(尽管这似乎不太可能，因为它嵌入了血管壁，这一过程被称为内皮化)。奥克斯利说，他们可能会为支架找到更好的位置，在与其他感兴趣的大脑区域相邻的血管中；距离足够大的血管2毫米以内的任何地方都是公平的竞争对手。在弄清楚大脑发出电铃和哨声时大脑的实际含义方面，该软件可能会有一些改进，他们的一些测试表明，该系统可以获得更多信息细节-比如用户试图收缩的具体肌肉。这可能会带来更有用的假肢或对Windows10之后的设备的控制。奥克斯利说：“现在，运动系统将为瘫痪的人提供治疗。”“但当我们开始接触大脑的其他区域时，你就会开始看到这项技术将如何打开大脑的处理能力。”很难预测当科学家真正弄清楚如何进入某人的大脑时会发生什么。", "note_en": "The hard part of connecting a gooey, thinking brain to a cold, one-ing and zero-ing computer is getting information through your thick skull—or mine, or anyone’s. The whole point of a skull, after all, is keeping a brain safely separate from [waves hands at everything].\n So if that brain isn’t yours, the only way to tell what’s going on inside it is inference. People make very educated guesses based on what that brain tells a body to do—like, if the body makes some noises that you can understand (that’s speech) or moves around in a recognizable way. That’s a problem for people trying to understand how the brain works, and an even bigger problem for people who because of injury or illness can’t move or speak. Sophisticated imaging technologies like functional magnetic resonance can give you some clues. But it’d be great to have something more direct. For decades, technologists have been trying to get brains to interface with computer keyboards or robot arms, to get meat to commune with silicon.\n On Wednesday, a team of scientists and engineers showed results from a promising new approach. It involves  mounting electrodes on an expandable, springy tube called a stent and threading it through a blood vessel that leads to the brain. In tests on two people, the researchers literally went for the jugular, running a stent-tipped wire up that vein in the throat and then into a vessel near the brain’s primary motor cortex, where they popped the spring. The electrodes snuggled into the vessel wall and started sensing when the people’s brains signaled their intention to move—and sent those signals wirelessly to a computer, via an infrared transmitter surgically inserted in the subjects’ chests. In an  article published in the  Journal of NeuroInterventional Surgery, the Australian and US researchers describe how two people with paralysis due to amyotrophic lateral sclerosis (better known as Lou Gehrig’s disease) used such a device to send texts and fool around online by brain-control alone.\n “Self-expanding stent technology has been well demonstrated in both cardiac and neurological applications to treat other diseases. We just use that feature and put electrodes on top of the stent,” says Thomas Oxley, an interventional neurologist and CEO of Synchron, the company hoping to commercialize the technology. “It’s fully implantable. Patients go home in a couple of days. And it’s plug-and-play.”\n It took training once the subjects got home. The electrode-studded stent could pick up signals from the brain, but machine-learning algorithms have to figure out what those signals—imperfect reflections of a mind at work even under ideal conditions—actually represent. But after a few weeks of work, both patients could use an eye tracker to move a cursor and then click with a thought, using the implant. It doesn’t sound like much, but that was enough for both of them to send text messages, shop online, and otherwise perform activities of digital daily life.\n The Food and Drug Administration hasn’t approved what Oxley calls a “stentrode” for widespread use yet, and the company is still chasing funding for more tests, but these preliminary results suggest that it’s a functioning brain-computer interface. The signal it receives isn’t packed full of information. For now, all the stentrode is picking up is one bit of information—either a telepathic mouse-click or the absence of that click. But for some applications, maybe that’s enough. “There’s been a lot of talk about data and channels, and really what should matter is, have you delivered a life-changing product to the patient?” Oxley says. “Just with a handful of outputs restored to the patient that they’re in control of, we’ve got them controlling Windows 10.”\n Much more ambitious brain-computer interfaces and neural prosthetics have been in the news lately. Last month, Elon Musk’s company Neuralink  demonstrated a wireless BCI with more than a thousand flexible electrodes, designed to be inserted directly into a brain by a specialized robot surgeon. (The company has so far only shown short-term use in pigs.) Inserting electrodes is tricky; while it’s true that brain surgery isn’t exactly rocket science, it has risks whether the surgeon is a robot or not. Even flexible, thin electrodes like those that Neuralink demonstrated are invasive enough that the brain tries to defend against them, coating them with glial cells that reduce their ability to conduct the electrical impulses they’re looking for. And while implanted electrodes like those of the more commonly used “Utah array” can get clear signals from individual neurons, understanding what those signals mean is still science in progress. Plus, the brain sloshes around like jelly in a donut; fixed-in-place electrodes can damage it. But get it right and they can do more than brain research. “Locked-in” patients with ALS have used them as  successful brain-computer interfaces, though they require training, maintenance, surgery, and so on.\n  Meanwhile, electrodes placed directly onto the scalp can pick up brain waves—electroencephalograms, or EEGs—but those lack the spatial detail of implanted electrodes. Neuroscientists know, very roughly, which part of the brain does what, but the more you know about which neurons are firing, the better you can tell what they’re firing about.\n A more recent innovation, electrocorticography, places a mesh of electrodes directly onto the surface of the brain. In combination with smart spectral processing of the signals those electrodes pick up, ECoG is good enough to translate action in the part of the motor cortex that controls the lips, jaw, and tongue into  text or even speech. And there are other approaches.  CTRL-labs, which Facebook  bought for perhaps as much as $1 billion in 2019, tries to get motor signals from neurons in the wrist.  Kernel uses functional near-infrared spectroscopy on the head to sense brain activity.\n Oxley and his colleagues’ stentrode, if it keeps showing good results, will fit somewhere along the spectrum between implanted electrodes and EEG. Closer to the first thing than the second, its inventors hope. But it’s still early days. “The core technology and the core idea is super cool, but given where they’re accessing the signals from, my expectation would be that this is a relatively low-fidelity signal relative to other brain-machine interface strategies,” says Vikash Gilja, who runs the Translational Neural Engineering Lab at UC San Diego. “We at least know that high-density ECoG recording from the surface of the brain can convey information beyond what is being shown in this paper.”\n A possible problem: Tissue conducts electrical impulses, but the electrodes in the stent are picking up signals from the brain through the cells of the blood vessel. That lowers signal content. “If we were to take those cortical surface recordings and compare them to Utah array experiments—the bulk of clinical experience with implanted electrodes—I would say the style of recording in ECoG is a rate limiter,” Gilja says. (Just for transparency, I should point out that Gilja has done for-pay work with BCI companies including Neuralink, with whom Synchron could theoretically compete someday.)\n So it might not be good enough for neuroscience, but it could be plenty useful for a person with paralysis who wants a low-maintenance BCI that doesn’t require drilling through the skull. “There’s a trade-off between how invasive you want to be and at what level you collect information,” says Andrew Pruszynski, a neuroscientist at Western University in Canada. “This is trying to get to the middle ground, to insert a catheter close to the neural activity. It’s obviously invasive, but certainly not as invasive as putting electrodes into the brain.”\n And there’s more work to come. Oxley’s team hopes to expand their study to more human subjects. They’ll be looking for possible side effects, like the chance that the stent could contribute to strokes (though this seems less likely as it embeds in the vessel walls, a process called endothelialization). They might find better locations for the stent, in blood vessels adjacent to other brain areas of interest; anywhere within 2 millimeters of a vessel big enough to accommodate the stentrode is fair game, Oxley says. The software could stand some improving, in terms of figuring out what the brain actually means when it emits its electrical bells and whistles, and some of their tests suggest the system could pick up more informational detail—like which specific muscle the users were trying to contract. That could lead to more useful prosthetics or control of devices beyond Windows 10. “The motor system, right now, is what’s going to deliver therapy for people who are paralyzed,” Oxley says. “But when we start to engage with other areas of the brain, you begin to see how the technology is going to open up brain processing power.” It’s hard to predict what might happen when scientists actually figure out how to get inside someone’s head.", "posttime": "2020-10-31 20:23:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "插入,human,大脑", "title": "一种将人脑插入计算机的新方法：通过静脉", "title_en": "A new way to plug a human brain into a computer: Via veins", "transed": 1, "url": "https://arstechnica.com/science/2020/10/a-new-way-to-plug-a-human-brain-into-a-computer-via-veins/", "via": "", "real_tags": ["插入", "human", "大脑"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直想做自己的编译器。编译器是我日常工作中不可或缺的一部分，我经常使用它们的成果。不久前，当我浏览TempleOS源代码时，在：：/Demos/Lessons文件夹中发现了MiniCompiler.HC，我有点吃惊。它实现了一个从简单的数学表达式到AMD64字节码的两阶段编译器(完成后将其比特转换为代码稍后跳转到的数组)，并且有很多关于编译器如何工作的内容要教授。对于那些手头没有TempleOS虚拟机的人，这里有一段MiniCompiler.HC运行的视频：\n您输入一个数学表达式，编译器构建它，然后输出一堆程序集并运行它以返回结果。在本系列中，我们将创建该编译器的一个面向WebAssembly的实现。该编译器将用Rust编写，除了最后的字节码编译和执行阶段外，将只使用标准库。这里发生了很多事情，所以我希望这至少是一个三集的系列。源代码在xe/mini编译器中，如果您想详细了解的话。跟着走，让我们在路上学到一些生锈的东西！\n像C这样的语言的编译器是建立在这里的基础之上的，但是它们要复杂得多。\n理想情况下，我们应该能够将括号嵌套到我们想要的深度，而不会出现任何问题。\n查看这些值，我们可以注意到一些模式，它们将使解析变得容易得多：\n这将创建一个名为minicompiler的文件夹和一个名为src/main.rs的文件。在编辑器中打开该文件，并将以下内容复制到其中：\n//src/main.rs/编译器可以执行的数学运算。#[Derate(Debug，Eq，PartialEq)]枚举Op{Mul，Div，Add，Sub，}/编译器的所有可能令牌，这将编译器限制为/简单的数学表达式。#[Derate(Debug，Eq，PartialEq)]枚举Token{EOF，Number(I32)，Operation(Op)，LeftParen，RightParen，}。\n在编译器中，标记指的是您正在使用的语言的各个部分。在这种情况下，每个令牌代表程序的每个可能部分。\n然后，让我们启动一个函数，该函数可以将程序字符串转换为一串令牌：\n等等，你怎么处理不好的输入，比如不是数学表达式的东西？这个函数不应该失败吗？\n你说得对！让我们做一个代表错误输入的小错误类型。看在创造力的份上，让我们称它为BadInput：\n//src/main.rsuse std：：Error：：Error；Use std：：fmt；/输入错误时返回的错误。这只会告诉用户它是错误的，因为调试信息不在这里的范围内。抱歉。#[Deriate(Debug，Eq，PartialEq)]struct BadInput；//需要显示错误。Iml fmt：：Display for BadInput{fn fmt(&amp；self，f：&amp；mut fmt：：Formatter)-&gt；fmt：：result{write！(F，&#34；Something is Bad，Good&34；)}}//默认错误实现将在此执行。BadInput{}。\n现在我们有了我们想要的函数类型，让我们通过设置结果并对输入字符串中的字符进行循环来开始实现lex()：\n//src/main.rsfn lex(input：&amp；str)-&gt；result&lt；vec&lt；Token&gt；，BadInput&gt；{let mut result：vec&lt；Token&gt；=vec：：new()；对于input.chars(){TODO！(&#34；Implementate this&#34；)；}OK(Result)}。\n看一下前面的示例，我们可以开始编写一些样板来将字符转换为标记：\n//src/main.rs//...对于input.chars(){匹配字符{//跳过空白&#39；&#39；=&&gt;；继续，//结束字符&#39；；&#39；\\n&#39；=&gt；{result t.ush(Token：：EOF)；Break；}//数学运算&#39；*&#39；=&gt；result t.ush(Token：：operation(opp：：mul))，&#39；/&#39；=&gt；Result.Push(Token：：Operation(Op：div))，&#39；+&#39；=&gt；Result.Push(Token：：Operation(Op：：Add))，&#39；-&#39；=&gt；Result.Push(Token：：Operation(Op：：Sub))，//括号&#39；(&#39；=&gt；result t.ush(Token：：LeftParen)，&#39；)=&gt；Result t.ush(Token：：RightParen)，//Numbers&#39；0&#39；|&#39；1&#39；|&#39；2&#39；|&#39；3&#39；|&#39；4&#39；|&#39；5&#39；|&#39；6&#39；|&#39；7&#39；|&#39；8&#39；|&#39；9&#39；=&gt；{TODO！(&#34；实现数字解析&#34；)}//其他一切都是错误的input_=&gt；return err(BadInput)，}}//...\n//src/main.rs//...Use Op：：*；Use Token：：*；Match Character{//...//数学运算&#39；*&#39；=&gt；result t.ush(Operation(Mul))，&#39；/&#39；=&gt；result t.ush(Operation(Div))，&#39；+&#39；=&gt；result t.ush(Operation(Add))，&#39；-&#39；=&gt；Result t.ush(Operation(Sub))，//括号&#39；(&#39；=&gt；result t.ush(LeftParen)，&#39；=&gt；result t.ush(RightParen)，//...}//...。\n您几乎可以在程序中的任何位置使用USE语句。但是，为了保持更好的流畅性，Use语句就在这些示例中需要它的位置旁边。\n现在我们可以开始享受解析数字的乐趣了。在编写MiniCompiler时，Terry Davis使用了类似以下内容的方法(为可读性添加了空格)：\n案例&#39；0&#39；...&#39；9&#39；：i=0；do{i=i*10+*src-&#39；0&#39；；src++；}While(&#39；0&#39；&lt；=*src&lt；=&#39；9&#39；)；*num=i；\n这会将中间变量i设置为0，然后消耗输入字符串中的字符，只要它们介于&#39；0&#39；和&#39；9&#39；之间。作为以10为基数输入的数字的一个巧妙副作用，您可以将40概念化为(4*10)+2。因此，它将旧数字乘以10，然后将新数字与结果数字相加。我们的设置不会让我们那么容易实现，但是我们可以根据以下规则通过一些堆栈操作来模拟它：\n如果最后一个是一个数字，则将该数字乘以10，然后将当前数字加到该数字上。\n否则，将节点推回RESULT，并将当前数字也推入RESULT。\n//src/main.rs//...//Numbers&#39；0&#39；|&#39；1&#39；|&#39；2&#39；|&#39；3&#39；|&#39；4&#39；|&#39；5&#39；|&#39；6&#39；|&#39；7&#39；|&#39；8&#39；|&#39；9&#39；=&gt；{let num：I32=(Character as U8-&#39；0&#39；as U8)as I32；if result t.len()==0{result t.ush(number(Num))；Continue；}let last=result t.op().unrapp()；Match last{number(I)=&gt；{result t.ush(number((i*10)+num))；}_=&gt；{result t.ush(Last)；result t.ush(number(Num))；}}//...\n这不是世界上最健壮的数字解析代码，但是目前它已经足够了。如果你能辨认出边缘的话就加分！\n这应该包括该语言的标记。让我们写一些测试，以确保一切都像我们想象的那样工作！\nRUST在标准库中内置了一个健壮的测试框架。我们可以在这里使用它来确保我们生成的令牌是正确的。让我们将以下内容添加到main.rs的底部：\n#[cfg(Test)]//告诉编译器仅在运行测试时编译此代码{use Super：：{Op：：*，Token：：*，*}；//将以下函数注册为测试函数#[test]FN BASIC_Lexing(){assert！(lex(&#34；420+69&#34；).is_ok())；assert！(lex(&#34；Tacos Are Tavy&#34；).is_err()；assert_eq！(lex(&#34；420+69&#34；).is_err()；assert_eq！(lex(&#34；420+69&#34；).is_err()；assert_eq！(lex(&#34；420+69&#34；)，确定(vec！[number(420)，Operation(Add)，number(69)])；assert_eq！(lex(&#34；(30+560)/4&#34；)，OK(vec！[LeftParen，number(30)，Operation(Add)，number(560)，right Paren，Operation(Div)，number(4)])；}}。\n这个测试可以而且可能应该扩展，但是当我们运行货物测试时：\n$Cargo测试编译迷你编译器v0.1.0(/HOME/cadey/code/xe/minicompiler)在0.22s内完成测试[未优化+调试信息]目标运行target/debug/deps/minicompiler-03cad314858b0419running 1测试测试：BASIC_LEXING...。OK测试结果：OK。1通过；0失败；0忽略；0测量；0过滤掉。\n嘿，马上！我们验证了所有解析都工作正常。最小的用例应该足以涵盖该语言的所有功能。\n第一部分就到这里。我们今天讲了很多。下次我们要在程序上运行avalidation pass时，将中缀表达式转换为反向Polishnotation，然后也开始将其编译为WebAssembly。到目前为止，这一直很有趣，我希望你能从中学到东西。\n这篇文章发表在2020年M10 29上。自发表以来，事实和情况可能发生了变化。如果有什么不对劲或不清楚的地方，请在匆忙下结论之前与我联系。", "note_en": "I&#39;ve always wanted to make my own compiler. Compilers are an integral part ofmy day to day job and I use the fruits of them constantly. A while ago while Iwas browsing through the TempleOS source code I found MiniCompiler.HC in the  ::/Demos/Lectures folder and I was abit blown away. It implements a two phase compiler from simple math expressionsto AMD64 bytecode (complete with bit-banging it to an array that the code laterjumps to) and has a lot to teach about how compilers work. For those of you thatdon&#39;t have a TempleOS VM handy, here is a video of MiniCompiler.HC in action:\n  You put in a math expression, the compiler builds it and then spits out a bunchof assembly and runs it to return the result. In this series we are going to becreating an implementation of this compiler that targets  WebAssembly.This compiler will be written in Rust and will use only the standard library foreverything but the final bytecode compilation and execution phase. There is alot going on here, so I expect this to be at least a three part series. Thesource code will be in  Xe/minicompiler in case you want to readit in detail. Follow along and let&#39;s learn some Rust on the way!\n Compilers for languages like C are built on top of the fundamentals here, butthey are  much more complicated.\n    Ideally we should be able to nest the parentheses as deep as we want without anyissues.\n Looking at these values we can notice a few patterns that will make parsing thisa lot easier:\n      This will create a folder called  minicompiler and a file called  src/main.rs.Open that file in your editor and copy the following into it:\n // src/main.rs/// Mathematical operations that our compiler can do.#[derive(Debug, Eq, PartialEq)]enum Op { Mul, Div, Add, Sub,}/// All of the possible tokens for the compiler, this limits the compiler/// to simple math expressions.#[derive(Debug, Eq, PartialEq)]enum Token { EOF, Number(i32), Operation(Op), LeftParen, RightParen,}\n In compilers, &#34;tokens&#34; refer to the individual parts of the language you areworking with. In this case every token represents every possible part of aprogram.\n And then let&#39;s start a function that can turn a program string into a bunch oftokens:\n  Wait, what do you do about bad input such as things that are not math expressions?Shouldn&#39;t this function be able to fail?\n You&#39;re right! Let&#39;s make a little error type that represents bad input. Forcreativity&#39;s sake let&#39;s call it  BadInput:\n // src/main.rsuse std::error::Error;use std::fmt;/// The error that gets returned on bad input. This only tells the user that it&#39;s/// wrong because debug information is out of scope here. Sorry.#[derive(Debug, Eq, PartialEq)]struct BadInput;// Errors need to be displayable.impl fmt::Display for BadInput { fn fmt(&amp;self, f: &amp;mut fmt::Formatter) -&gt; fmt::Result { write!(f, &#34;something in your input is bad, good luck&#34;) }}// The default Error implementation will do here.impl Error for BadInput {}\n   So now that we have the function type we want, let&#39;s start implementing  lex()by setting up the result and a loop over the characters in the input string:\n // src/main.rsfn lex(input: &amp;str) -&gt; Result&lt;Vec&lt;Token&gt;, BadInput&gt; { let mut result: Vec&lt;Token&gt; = Vec::new(); for character in input.chars() { todo!(&#34;implement this&#34;); } Ok(result)}\n Looking at the examples from earlier we can start writing some boilerplate toturn characters into tokens:\n // src/main.rs// ...for character in input.chars() { match character { // Skip whitespace &#39; &#39; =&gt; continue, // Ending characters &#39;;&#39; | &#39;\\n&#39; =&gt; { result.push(Token::EOF); break; } // Math operations &#39;*&#39; =&gt; result.push(Token::Operation(Op::Mul)), &#39;/&#39; =&gt; result.push(Token::Operation(Op::Div)), &#39;+&#39; =&gt; result.push(Token::Operation(Op::Add)), &#39;-&#39; =&gt; result.push(Token::Operation(Op::Sub)), // Parentheses &#39;(&#39; =&gt; result.push(Token::LeftParen), &#39;)&#39; =&gt; result.push(Token::RightParen), // Numbers &#39;0&#39; | &#39;1&#39; | &#39;2&#39; | &#39;3&#39; | &#39;4&#39; | &#39;5&#39; | &#39;6&#39; | &#39;7&#39; | &#39;8&#39; | &#39;9&#39; =&gt; { todo!(&#34;implement number parsing&#34;) } // Everything else is bad input _ =&gt; return Err(BadInput), }}// ...\n   // src/main.rs// ...use Op::*;use Token::*;match character { // ... // Math operations &#39;*&#39; =&gt; result.push(Operation(Mul)), &#39;/&#39; =&gt; result.push(Operation(Div)), &#39;+&#39; =&gt; result.push(Operation(Add)), &#39;-&#39; =&gt; result.push(Operation(Sub)), // Parentheses &#39;(&#39; =&gt; result.push(LeftParen), &#39;)&#39; =&gt; result.push(RightParen), // ...} // ...\n  You can use the  use statement just about anywhere in your program. However tokeep things flowing nicer, the  use statement is right next to where it isneeded in these examples.\n Now we can get into the fun that is parsing numbers. When he wrote MiniCompiler,Terry Davis used an approach that is something like this (spacing added for readability):\n case &#39;0&#39;...&#39;9&#39;: i = 0; do { i = i * 10 + *src - &#39;0&#39;; src++; } while (&#39;0&#39; &lt;= *src &lt;= &#39;9&#39;); *num=i;\n This sets an intermediate variable  i to 0 and then consumes characters fromthe input string as long as they are between  &#39;0&#39; and  &#39;9&#39;. As a neat sideeffect of the numbers being input in base 10, you can conceptualize  40 as  (4 * 10) + 2. So it multiplies the old digit by 10 and then adds the new digit tothe resulting number. Our setup doesn&#39;t let us get that fancy as easily, howeverwe can emulate it with a bit of stack manipulation according to these rules:\n If  last is a number, multiply that number by 10 and add the current numberto it\n Otherwise push the node back into  result and push the current number to result as well\n  // src/main.rs// ...// Numbers&#39;0&#39; | &#39;1&#39; | &#39;2&#39; | &#39;3&#39; | &#39;4&#39; | &#39;5&#39; | &#39;6&#39; | &#39;7&#39; | &#39;8&#39; | &#39;9&#39; =&gt; { let num: i32 = (character as u8 - &#39;0&#39; as u8) as i32; if result.len() == 0 { result.push(Number(num)); continue; } let last = result.pop().unwrap(); match last { Number(i) =&gt; { result.push(Number((i * 10) + num)); } _ =&gt; { result.push(last); result.push(Number(num)); } }} // ...\n This is not the most robust number parsing code in the world, however it willsuffice for now. Extra credit if you can identify the edgecases!\n This should cover the tokens for the language. Let&#39;s write some tests to be sureeverything is working the way we think it is!\n  Rust has a  robust testingframework built into thestandard library. We can use it here to make sure we are generating tokenscorrectly. Let&#39;s add the following to the bottom of  main.rs:\n #[cfg(test)] // tells the compiler to only build this code when tests are being runmod tests { use super::{Op::*, Token::*, *}; // registers the following function as a test function #[test] fn basic_lexing() { assert!(lex(&#34;420 + 69&#34;).is_ok()); assert!(lex(&#34;tacos are tasty&#34;).is_err()); assert_eq!( lex(&#34;420 + 69&#34;), Ok(vec![Number(420), Operation(Add), Number(69)]) ); assert_eq!( lex(&#34;(30 + 560) / 4&#34;), Ok(vec![ LeftParen, Number(30), Operation(Add), Number(560), RightParen, Operation(Div), Number(4) ]) ); }}\n This test can and probably should be expanded on, but when we run  cargo test:\n $ cargo test Compiling minicompiler v0.1.0 (/home/cadey/code/Xe/minicompiler) Finished test [unoptimized + debuginfo] target(s) in 0.22s Running target/debug/deps/minicompiler-03cad314858b0419running 1 testtest tests::basic_lexing ... oktest result: ok. 1 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out\n And hey presto! We verified that all of the parsing is working correctly. Thosetest cases should be sufficient to cover all of the functionality of thelanguage.\n  This is it for part 1. We covered a lot today. Next time we are going to run avalidation pass on the program, convert the infix expressions to reverse polishnotation and then also get started on compiling that to WebAssembly. This hasbeen fun so far and I hope you were able to learn from it.\n     This article was posted on M10 29 2020. Facts and circumstances may have changed since publication. Please  contact me before jumping to conclusions if something seems wrong or unclear.", "posttime": "2020-10-31 19:54:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,编译器,minicompiler", "title": "迷你编译器：lexing", "title_en": "Minicompiler: Lexing", "transed": 1, "url": "https://christine.website/blog/minicompiler-lexing-2020-10-29", "via": "", "real_tags": ["编译", "编译器"]}, {"category": "", "categoryclass": "", "imagename": "42124915eec89cfb4b60c72af80919e4.jpg", "infoid": 1032474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "序列11221包含使用数字1和2的所有2位组合。这样的序列被称为de Bruijn序列。我向你展示三种方法..。", "note_en": "The sequence 11221 contains all 2-digit combinations using the numbers 1 and 2.A sequence such as that is called a De Bruijn sequence. I show you three methods ...", "posttime": "2020-10-31 19:14:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,bruijn,combination", "title": "你能解开密码锁吗？是的-de Bruijn序列", "title_en": "Can you crack the combination lock? Yeah – De Bruijn Sequences", "transed": 1, "url": "https://www.youtube.com/watch?v=iPLQgXUiU14&vl=en-GB", "via": "", "real_tags": ["密码", "bruijn"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章解释了为什么我坚持使用函数式编程，使用一个非函数式程序员可以理解的原理。\n原因实际上非常简单：函数式编程习惯用法比其他编程范例(如过程性编程或面向对象编程)的习惯用法更持久、更可移植。要解释原因，我需要首先定义我理解的“函数式编程”的含义(无可否认，这是一个不精确且含糊的术语)。\n我个人使用术语“函数式编程”来表示一种编程风格，即您尽可能地将自己限制在以下语言功能上：\n这并不是说这些特性在我对函数式编程的定义中是被禁止的。可以将其定义为更多的“技术雷达”，其中前一组功能属于“采用”类别，而后一组功能属于“保留”类别。\n那么，前者的“认可”特性与后者的“不鼓励”特性有何不同呢？批准的语言功能是“永恒的”。您总是需要数字、列表、字符串、函数、记录等。它们甚至不是特定于编程的：它们早于编程，并且源自优秀的老式数学。如果您的语言不支持这些特性中的一个或多个，您将在建模某些问题领域时遇到困难。\n然而，一旦您使用函数式编程习惯用法来描述自己，您就会意识到，除了这些特性之外，您实际上不需要太多其他东西：\n当您从这个角度看待事物时，您开始将其他编程习惯用法视为来来去去的装点门面；而不是软件工程学科的基础。\n此外，使用“永恒的”原语可以培养一种比大多数编程风格更可移植的编程风格。大多数函数式编程习惯用法都可以移植到任何语言，除了递归和通用标记联合(并非所有语言都支持)。然而，函数式程序员学习如何将递归和标记的联合转换为其他语言中的等效习惯用法(例如，分别是循环和访问者模式)。但是，如果您试图将面向对象的习惯用法移植到非面向对象的语言，您将会遇到困难-同样，将命令式习惯用法移植到函数式编程语言也是如此。\n这就是为什么我的技术雷达将函数式编程标记为“采用”，并将其他编程范例标记为“保留”。", "note_en": "This post explains why I stick with functional programming, using a rationale that a non-functional programmer can relate to.\n The reason is actually pretty simple: functional programming idioms are more enduring and portable than idioms from other programming paradigms (such as procedural or object-oriented programming). To explain why, I need to first define what I understand “functional programming” to mean (which is admittedly an imprecise and vague term).\n I personally use the term “functional programming” to denote a style of programming where you restrict yourself as much as possible to the following language features:\n    That’s not to say that those features are  banned from my definition of functional programming. Think of the definition as more of a “tech radar” where the former set of features fall in the “Adopt” category and the latter set of features fall in the “Hold” category.\n So what distinguishes the former “approved” features from the latter “discouraged” features? The approved language features are “timeless”. You’re always going to need numbers, lists, strings, functions, records, etc. They aren’t even specific to programming: they predate programming and originate from good old-fashioned math. If your language doesn’t support one or more of those features you will run into difficulties modeling some problem domains.\n However, once you verse yourself in functional programming idioms you realize that you don’t actually need much else beyond those features:\n  When you view things in that light you begin to view other programming idioms as window dressing that comes and goes; not fundamental to the discipline of software engineering.\n Moreover, using “timeless” primitives fosters a programming style that is more portable than most. Most functional programming idioms can be ported to any language, with the notable exception of recursion and generalized tagged unions (which not all languages support). However, functional programmers learn how to translate recursion and tagged unions to equivalent idioms in other languages (e.g. loops and the visitor pattern, respectively). However, if you try to port object-oriented idioms to a non-object-oriented language you’re going to have a bad time — likewise for porting imperative idioms to a functional programming language.\n This is why my tech radar marks functional programming as “Adopt” and marks other programming paradigms as “Hold”.", "posttime": "2020-10-31 18:53:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,喜欢,functional", "title": "为什么我更喜欢函数式编程", "title_en": "Why I Prefer Functional Programming", "transed": 1, "url": "http://www.haskellforall.com/2020/10/why-i-prefer-functional-programming.html", "via": "", "real_tags": ["编程", "喜欢"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LIL(代表小解释语言)\r是一种小型的高度动态的脚本语言，灵感来自Tcl和\rUNIX外壳。LIL有两个实现，一个是用C语言编写的，\r它由一对.c和.h文件组成\r一个在自由帕斯卡，\r它由单个PAS文件(一个单元)组成。也是一个\r拉撒路套餐\r提供了后者。\nLIL目前作为两者的源代码快照提供\rC和Free Pascal版本合并到一个ZIP文件中。\r这些快照使用其发布日期进行版本控制。请注意\r解释器反射版本命令将报告0.1\r与日期版本无关。这两种情况都会在某些时候发生变化\r以提供正确的版本化版本。\nLIL的最新版本是lil20190821.zip\r(159KB)。这是我的私人化石储存库的摘录\r(这些文件与较旧的归档文件基本相同，但此\r还包括从存储库返回的完整更改日志\r到2010，并将LIL徽标作为XCF图像，可使用\r跛子)。\n请注意，20190821包含略有更改的\r列表分析过程中的换行符行为，该行为可能\r影响某些脚本，特别是在列表中包含代码的情况下\r方括号，但是前面的行为完全是\r损坏(例如，列表中的方括号内有多个命令\r会将所有命令合并为一个命令，如果分号\r用于多个命令，则整个命令不会\r被正确解析)。正因为如此，我希望任何依赖\r之前的行为是偶然的(实际上我不是这样认为的\r真的希望任何这样的脚本都会存在)。也是在同一个\r版本引入了Bash脚本来检查\r通过在和下运行相同的脚本来实现不同的可执行文件\r比较结果表明，FPLIL存在一些不相容的地方\r和C Lil在一起。目前，FPLIL没有实施这些变化。\r到目前为止都提到过-所有这些不兼容和更改都将\r将在以后的版本中修复。\n一些较旧的版本也可供您在需要时使用。\rLIL应该基本上是向后兼容的(见下文)，但这是对的\r现在还不能保证严格的API或ABI兼容性。\n如果您使用的是Windows，还可以下载WinLIL，\r一个小型的基于Windows的环境，具有编辑器、控制台和额外的\r可用于试验LIL的图形函数。它\r自包含在单个可执行文件中，包括LIL文档。\n最新版本是WinLIL 1.4\r(204KB)，基于C LIL 20190821。这里\r是它在行动中的截图。还有一个小涂鸦程序\r可在此处下载，并提供屏幕截图\r在这里看到的。此档案\r(45KB)包含源代码，但请注意，它使用原始\rBorland C++Builder，并使用较新的版本(如\r作为免费的社区版)您将需要重新创建该项目\r文件，并对代码进行一些修改。\n旧版本的WinLIL可在以下文件中找到：winlil13.zip\r(1.3二进制)，winlil20190524200539.zip\r(1.3来源)，winlil20170424.zip\r(二进制)，winlilsrc20161220.7z\r(来源)。\nLILGUI是GUI的试验性API规范\r通过LIL提供脚本功能的应用程序\r公开一个简单的GUI API。它主要用于创建\r可嵌入的GUI(例如，侧边栏中的面板)，尽管它还可以\r用于弹出窗口和对话框。目前唯一的实现是\r用于LILGUI的是LazLILGUI，它是用于Lazarus的组件\r它使用LCL提供实际的GUI功能。\n最新版本的LILGUI文件(包括API规范，\rLazLILGUI和几个示例)可以下载\r这里(85KB)。用于LazLILGUI记事本的64位Windows二进制文件，\r提供侧栏以试用LILGUI代码的文本编辑器，\r可在此处下载(1.3MB)。\r您还可以看到Windows、Linux下正在运行的程序的屏幕截图\r和Mac OS X，以及Windows下的自定义控件示例。\n一般说来，C和Free Pascal实现都\rAPI在很大程度上是稳定的。C API是\r当lil_command_t时仅在2010年中中断一次\r已重命名为lil_func_t，\r从2010年末开始，Windows DLL也开始向后兼容。\rFree Pascal实现的API不太稳定，但是\r因为Free Pascal本身不支持ABI稳定性，所以这是\r就没那么让人担心了。\n在可预见的将来，CAPI应该是稳定的，但我认为\r建议不要构建系统范围的共享版本\r在进行适当的版本发布之前，对库进行更新。一次\r发布版本后，API和ABI都将保留\r只要技术上可行，就能保持稳定。\n即使是新命令，脚本代码也应该向后兼容\r因为脚本和主机应用程序将重新定义\r不管怎么说，没有任何相互冲突的功能。唯一一次脚本代码是\rBREAKED是在2012年引入多行注释的时候\r因此，任何使用类似#的注释行的脚本\r已经坏了。这是在2014年的一个修复中解决的，该修复添加了一个特殊的\r检查是否存在此类情况，以便多行注释只能开始\r并以两个#结尾，但不是三个或更多(While\r这可能会破坏使用三个或更多#的任何脚本\r要开始和结束多行注释，这样的脚本的机会\r都非常纤细)。\n与C API一样，脚本目前向后兼容\r基本上是稳定的，但有很小的变化(如多行注释\r上面提到的更改)可能会在版本化版本发布之前进行\r对脚本行为进行了修改或修复，使其更接近于\r或者简单地修复损坏的行为。\r在这一点上，不会进行任何可能会影响倒退的更改\r兼容性。\nLILGUI和LazLILGUI更具实验性，可能会向后看\r未来不兼容的变化。\n目前唯一的文档是(冗长的)readme.txt\r您可以在此处阅读或作为一部分阅读的文件\r包含源代码的档案的。在某个时候，我会\r编写格式更好的文档。免费的帕斯卡有它自己的\r可在此处阅读的API文档和\r也可以作为包含源代码的归档的一部分。\n可以在此处找到LILGUI API，并且\r可以找到LazLILGUI的文档\r这里。两者也都是LILGUI存档的一部分。\n也是一个\r旧的LIL演示文稿可以在SlideShare上找到。请注意\r演示文稿中的URL不再有效。\nLIL几乎是功能齐全的，而我做的很少\r信息技术的发展。我不打算让它变得又大又臃肿\r试图提供所有内容的库-如果有什么不同的话，在\r将来我可能会添加一些条件句来删除库中的部分内容\r对于例如不需要字符串或列表功能的用户。\n进一步的工作主要是围绕LIL展开，而不是在\r语言本身：改进文档，编写测试套件\r(目前有几个例子，我在制作完之后运行\r几乎一半的更改来自于错误修复，但我希望\r自动化程度更高)，修复了免费Pascal的一些问题\r实现，在C API上添加了更多函数来访问LIL&#39；\r国家等。\nC和Free Pascal实现以及WinLIL\r在以下zlib许可证下获得许可：\nLIL-小解释型语言\r版权所有(C)2010-2019 Kostas Michalopoulos\r\r本软件按原样提供，没有任何明示或暗示\r保修。在任何情况下，作者都不承担任何损害赔偿的责任。\r因使用此软件而产生的错误。\r\r任何人都可以出于任何目的使用本软件，\r包括商业应用程序，并对其进行更改和重新分发\r自由，但受以下限制：\r\r1.不得歪曲本软件的出处；您不得\r声称原来的软件是你写的。如果您使用此软件\r在产品中，产品文档中的确认将是\r非常感谢，但不是必需的。\r2.修改后的源版本必须清楚地标明，不得标明\r被误传为原始软件。\r3.本通知不得从任何来源分发中删除或更改。", "note_en": "LIL (stands for  Little  Interpreted  Language)\ris a small highly dynamic scripting language inspired by Tcl and\runix shells. LIL has two implementations, one written in  C,\rwhich consists of a pair of  .c and  .h files\rand one in   Free Pascal,\rwhich consists of a single  pas file (a unit). Also a\r Lazarus package for the\rlatter is provided.\n          LIL is currently available as source code snapshots of both\rthe C and the Free Pascal version combined in a single ZIP file.\rThese snapshots are versioned using their release date. Note that\rthe interpreter&#39;s reflect version command will report  0.1\rregardless of date versioning. Both of these will change at some\rpoint in the future to provide proper versioned releases.\n    The latest version of LIL is  lil20190821.zip\r(159KB). This is an extract from my private Fossil repository\r(the files are mostly the same as the older archives, but this\ralso includes a full changelog from the repository going back\rto 2010 and the LIL logo as an XCF image which can be opened with\rGIMP).\n  Please note that  20190821 contains slightly altered\rbehavior for line breaking during list parsing that  could\raffect some scripts, especially with lists that contain code inside\rsquare brackets, however the previous behavior was completely\rbroken (e.g. having multiple commands inside brackets in a list\rwould merge all commands into a single one and if a semicolon\rwas used for the multiple commands, the entire command wouldn&#39;t\rbe parsed properly). Because of that i expect any reliance on\rthe previous behavior to be accidental (and in practice i do not\rreally expect any such script to even exist). Also in the same\rversion a Bash script is introduced to check the differences between\rdifferent executables by running the same scripts under both and\rcomparing the results, which show that FPLIL contains a few incompatibilities\rwith C LIL. At this moment FPLIL doesn&#39;t implement the changes\rmentioned so far - all these incompatibilities and changes will\rbe fixed in a later release.\n    Some older versions are also available in case you need them.\rLIL should be mostly backwards compatible (see below), but right\rnow there is no promise for strict API or ABI compatibility.\n      If you are using Windows you can also download  WinLIL,\ra small Windows-based environment with editor, console and extra\rgraphics functions that can be used to experiment with LIL. It\ris self-contained in a single executable, including the LIL documentation.\n  The latest version is  WinLIL 1.4\r(204KB) based on  C LIL 20190821.  Here\ris a screenshot of it in action. Also a small doodle program\rcan be  downloaded here and a  screenshot\rseen here.  This archive\r(45KB) contains the source code, but note that it uses the original\rBorland C++ Builder and to compile with a newer version (such\ras the free Community Edition) you&#39;ll need to recreate the project\rfile and make a few modifications to the code.\n  Older versions of WinLIL can be found in these files:  winlil13.zip\r(1.3 binary),  winlil20190524200539.zip\r(1.3 source),  winlil20170424.zip\r(binary),  winlilsrc20161220.7z\r(source).\n    LILGUI is an experimental API specification for GUI\rapplications that provide scripting functionality through LIL\rto expose a simple GUI API. It is mainly intended for creating\rembeddable GUIs (e.g. a panel in a sidebar) although it can also\rbe used for popup windows and dialogs. Currently the only implementation\rfor LILGUI is  LazLILGUI, which is a component for Lazarus\rthat uses LCL to provide the actual GUI functionality.\n  The latest version of LILGUI files (which include the API spec,\rLazLILGUI and a couple of examples) can be  downloaded\rhere (85KB). A 64bit windows binary for  LazLILGUI Notepad,\ra text editor that provides a sidebar to try out LILGUI code,\rcan be  downloaded here (1.3MB).\rAlso you can see the screenshots of program in action under  Windows,  Linux\rand  Mac OS X and also the  Custom Control Example under Windows.\n    Generally speaking, both the C and Free Pascal implementation\rAPIs are stable  for the most part. The  C API was\rbroken only once in middle 2010 when  lil_command_t\rwas renamed to  lil_func_t and the  C ABI for\rthe Windows DLL is also backwards compatible since late 2010.\rThe  Free Pascal implementation has a less stable API but\ras Free Pascal itself does not support ABI stability, this is\rless of a concern.\n  In the foreseeable future the C API should be stable, but i&#39;d\rrecommend  against building a system-wide shared version\rof the library before a proper versioned release is made. Once\ra versioned release is made, both the API and ABI will remain\rstable for as long as it is technically possible.\n  Script code should be backwards compatible even as new commands\rare introduced since scripts and host applications will redefine\rany conflicting functions anyway. The only time script code was\rbroken was in 2012 when the multiline comments were introduced\rso any script that used a comment line like  #####\rwas broken. This was addressed in a fix in 2014 that added a special\rcheck for such cases so that multiline comments can only start\rand end with two  #s but not three or more (while\rthis could have broken any script that used three or more  #s\rto start and end multiline comments, the chances for such a script\rare very slim).\n  Like with the C API, the script backwards compatibility currently\ris mostly stable, but minor changes (like the multiline comment\rchanges mentioned above) might be made until a versioned release\ris made or fixes to the script behavior to be closer to what is\rdescribed in the documentation or simply fix broken behavior.\rAt that point no changes will be made that may affect backwards\rcompatibility.\n  LILGUI and LazLILGUI are more experimental and may see backwards\rincompatible changes in the future.\n    Currently the only documentation is the (lengthy)  readme.txt\rfile that  you can read here or as part\rof the archive containing the source code. At some point i&#39;ll\rwrite better formatted documentation. Free Pascal has its own\rAPI documentation  readable here and\ralso as a part of the archive containing the source code.\n  The LILGUI API can be  found here and\rthe documentation for LazLILGUI can be  found\rhere. Both are also part of the LILGUI archive.\n  Also  an\rold LIL presentation can be found on SlideShare. Please note\rthat the URLs in the presentation are not valid anymore.\n    LIL is practically  feature-complete and i do very little\rdevelopment of it. I do not plan on making it a big and bloated\rlibrary that tries to provide everything - if anything, in the\rfuture i might add some conditionals to remove bits of the library\rfor users who do not need, e.g, the string or list functions.\n  Further work is mostly &#34;around&#34; LIL and not on the\rlanguage itself: improving the documentation, writing a test suite\r(currently there are several examples which i run after making\rchanges and almost half of them come from bug fixes, but i&#39;d like\rsomethnig more automated), fixing some issues with the Free Pascal\rimplementation, adding more functions on the C API to access LIL&#39;s\rstate, etc.\n    Both the C and Free Pascal implementations as well as WinLIL\rare licensed under the zlib license below:\n  LIL - Little Interpreted Language\rCopyright (C) 2010-2019 Kostas Michalopoulos\r\rThis software is provided &#39;as-is&#39;, without any express or implied\rwarranty. In no event will the authors be held liable for any damages\rarising from the use of this software.\r\rPermission is granted to anyone to use this software for any purpose,\rincluding commercial applications, and to alter it and redistribute it\rfreely, subject to the following restrictions:\r\r1. The origin of this software must not be misrepresented; you must not\r claim that you wrote the original software. If you use this software\r in a product, an acknowledgment in the product documentation would be\r appreciated but is not required.\r2. Altered source versions must be plainly marked as such, and must not be\r misrepresented as being the original software.\r3. This notice may not be removed or altered from any source distribution.", "posttime": "2020-10-31 17:35:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lil,interpreted", "title": "LIL：解释很少的语言", "title_en": "LIL: Little Interpreted Language", "transed": 1, "url": "http://runtimeterror.com/tech/lil/", "via": "", "real_tags": ["lil"]}]