[{"category": "", "categoryclass": "", "imagename": "11c246f46cd3c3f0d0b5807e5581c410.jpg", "infoid": 1069747, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我创建了一个 repo 来抓取和分析在 leetcode 的补偿页面上发布的帖子。报告是根据截至 7 月 22 日收集的 1940 条记录生成的（来自薪酬页面上的 272 页）。", "note_en": "I created a repo to scrape and analyse the posts made on the compensations page of leetcode.\n Reports are generated from 1940 records collected till Jul 22 (from the 272 pages available on the compensations page).", "posttime": "2021-07-26 08:20:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "薪酬,compensation,抓取", "title": "Leetcode 薪酬报告（印度）2019 年 1 月 – 2021 年 7 月", "title_en": "Leetcode Compensation report (India) Jan 2019 – Jul 2021", "transed": 1, "url": "https://www.reddit.com/r/developersIndia/comments/ors1zd/leetcode_compensation_report_india_jan_2019_jul/", "via": "", "real_tags": ["薪酬", "抓取"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试完全数字访问，看看为什么有超过 100 万读者订阅了 FT 选择 购买 1 美元的试用订阅 4 周 试用期结束后，您将每月支付 91 美元 4 周内获得对 FT 值得信赖的奖励的无限制高级数字访问- 获奖商业新闻礼品文章 – 每月最多与家人、朋友和同事分享 10 篇文章", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-07-26 08:19:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宽带,broadband,订阅", "title": "光纤宽带“淘金热”：英国的替代网络能否成功？", "title_en": "Fibre broadband ‘gold rush’: can the UK’s alt-nets pull it off?", "transed": 1, "url": "https://www.ft.com/content/0af3b0ea-a803-4b23-be18-a47717c095eb", "via": "", "real_tags": ["宽带", "broadband", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "55b07d20cf1174d0261ff81787f094a1.jpg", "infoid": 1069745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每 5 分钟，AEMO 将在全国电力市场 (NEM) 内调度发电机以满足需求。为了实现这一点，AEMO 需要预测未来 5 分钟内的需求情况。目前，AEMO 使用恰好一周前的 6 个调度间隔中的需求变化，以及当前调度间隔之前的 5 个调度间隔。这些计算的结果是 9 个值，代表了需求随时间的变化。然后将这 9 个值输入到称为神经网络的机器学习算法中。我已经在下面绘制了这个网络的结构，但您真正需要担心的是输入层（采用上面讨论的 9 个值）和预测需求变化的输出层。如果您对这个神经网络究竟如何接受这些输入并能够输出预测感兴趣，我已经在这里用 Python 从头开始​​实现了它。最后，我认为这份探索替代预测建模技术的报告非常值得一读。", "note_en": "Every 5 minutes, AEMO will dispatch generators across the National Electricity Market (NEM) in order to meet demand. To achieve this, AEMO needs to predict what demand will look like 5 minutes in the future.\n   Currently, AEMO uses the change in demand in the 6 dispatch intervals exactly a week before, and the 5 dispatch intervals immediately preceding the current dispatch interval. The outcome of these calculations is 9 values representing the change in demand over time.\n  These 9 values are then fed into a machine learning algorithm called a neural network. I’ve drawn the structure of this network below, but all you really need to worry about is the input layer (that takes the 9 values discussed above) and the output layer that predicts the change in demand.\n  If you’re interested in exactly how this neural network takes these inputs and is able to output a prediction, I’ve  implemented it here from scratch in Python.\n Finally, I think this  report exploring alternative predictive modelling techniques is well worth a read.", "posttime": "2021-07-26 08:19:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "预测,predict", "title": "AEMO 如何预测全国电力市场的需求？", "title_en": "How does AEMO predict demand in the National Electricity Market?", "transed": 1, "url": "https://jacksimpson.co/how-does-aemo-predict-demand-in-the-national-electricity-market/", "via": "", "real_tags": ["预测", "predict"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的论文是 Facebook 的 Tectonic Filesystem: Efficiency from Exascale from FaST &#39;21。这篇论文涵盖了 Facebook 的 Tectonic 文件系统、它的实现以及他们做出的各种设计决策。我将总结这篇论文，并深入探讨其中的一些亮点。虽然文件系统论文和系统有着丰富的历史，但阅读这篇 Tectonic 论文还是很不错的，因为许多经常被引用的论文已经有点长了。谷歌文件系统 (2003) 论文已有近 20 年的历史，但在野外被引用的次数超过了 Bill Murray。 1 还有一些更现代的论文，主要来自 Microsoft，如 Windows Azure Storage (2011) 和 Azure Data Lake Store (2017)，但很高兴看到来自不同公司的一些东西。 Tectonic 使用胖客户端架构，支持直接从磁盘到客户端的数据流，并使用分片元数据服务为文件系统提供服务。 Tectonic 将元数据层分成三个部分：(1) 名称层，(2) 文件层，和 (3) 块层。每个层负责一部分元数据，并且所有层都作为无状态微服务实现在 ZippyDB 之上，ZippyDB 是一个水平可扩展的键值存储。由于元数据层是完全独立的，每个层都可以独立缩放以处理其负载。 Name 层提供目录树抽象，将目录映射到它们包含的文件和目录。文件层从文件映射到它们的组成块。块是对连续字节串的抽象，隐藏了它们的存储或编码方式。文件只是块的有序列表。在 Tectonic 中，块使用复制编码，其中 \\(N\\) 个相同的块每个存储块的完整副本，或者使用 Reed-Solomon 编码，其中块被编码为 \\(X\\) 数据块和 \\(Y\\ ) 代码/奇偶校验块。块层包含从块到其编码及其组块集的映射。 Tectonic 的最后一部分是 Chunk Store，它是它自己的分布式数据存储，其中节点存储原始字节块和一些最小元数据，以从块 id 映射到存储在本地、修改过的 XFS 文件系统上的字节。 Name 层、File 层和 Block 层的模式在论文中的这张表中：\nName 层维护从目录到子目录和其中包含的文件的映射，并由目录的 dir_id 分片。 File 层从文件映射到其逻辑块列表，并由 file_id 分片。 Block 层从块映射到存储它的块/磁盘列表，并由 blk_id 分片。块层还维护从每个磁盘到存储在其上的块列表的映射。这种反向映射对于维护很有用，例如，当磁盘丢失时，这种映射允许后台维护任务准确枚举哪些块需要向上复制或以其他方式重建。 ZippyDB 将键组合成分片，并保证具有相同分片 id 的所有键值对都放置在同一个分片中。这意味着由 dir_id 分片的 Tectonic 的 Name 层可以从单个分片快速提供一个目录中所有子目录和文件的强一致性列表，而它的 File 层，由 file_id 分片，可以为所有的列表做同样的事情。文件块。但是，不能保证子目录与父目录位于同一分片上，并且 ZippyDB 不提供任何跨分片事务，因此不支持大多数递归文件系统操作。 Tectonic 的 ZippyDB 模式还将列表存储为（键，值）对的完全“扩展”组合。也就是说，对于包含子目录 bar 和 quux 的目录 foo，Tectonic 存储两个单独的键 (foo, bar) 和 (foo, quux)，并使用前缀键扫描 foo, 处理目录 foo 的列表请求。这种扩展的列表格式用于降低向已经拥有数百万个文件的大型目录添加或删除单个条目的成本，因为 Tectonic 不必反序列化、编辑、序列化和写回一百万个条目列表。 Tectonic 具有单写入器、仅追加语义——这意味着 Tectonic 禁止多个并发写入器写入一个文件，并且文件只能追加到。为确保单写入器语义，每当客户端打开文件时，它都会获得一个写入令牌，该令牌与文件一起存储在元数据层中。每当客户端希望写入文件时，它必须包含写入令牌，并且只有最新的写入令牌才被允许改变文件元数据并写入其块。当控制路径通过元数据层和 ZippyDB 时，数据路径直接从客户端到块存储节点。这减少了整个系统所需的网络带宽，以及在网络上移动字节所需的计算。 Tectonic 的胖客户端对其读取和写入具有非常细粒度的控制，因为它直接进入块存储节点来读取和写入单个块。这允许客户端针对不同的工作负载进行调整，例如，是否优化写入的持久性或延迟。与可能在整个文件系统中强制执行单个配置的其他系统相反，Tectonic 客户端还可以针对每个文件甚至每个块调整这些参数。 Tectonic 使用常见的仲裁提交或仲裁写入技术来优化客户端执行全块写入 - 只需要客户端持久地写入块的所有块副本中的大多数以提交块。举例来说，对于具有 3 个副本的 \\(R(3.2)\\) 复制文件 2 Tectonic 只需要客户端在考虑提交的块之前完成对其中 2 个副本块的写入——这有助于尾延迟 3。如果最后的第三个副本块写入失败，Tectonic 的后台维护服务将通过修复第 3 个块副本来修复块。\n除了这种常见的优化之外，Tectonic 还使用了一种称为 Reservation Requests 的巧妙技术来优化全块写入，这类似于 The Tail At Scale 中讨论的对冲请求。为了激发预留请求，我们将首先绕道而行，看看对冲请求、它们的优点和缺点，以及为什么预留请求可能更适合 Tectonic 的用例。对冲请求是一种延迟优化，您可以将请求发送到可能的多台服务器，并接受来自最快服务器的第一个响应，而不是为一项工作发送单个请求。不只是重复大量工作的关键是，不是立即将请求发送到多个服务器，而是等待一点，其中“一点”意味着您期望正常请求需要多长时间。如果回复仍未到达，那么您“对冲”您的赌注，即该服务器将在合理的时间范围内响应并将相同的请求发送到另一个副本。对冲请求有助于改善长尾延迟，因为您可以避免客户端在取得任何进展之前必须等待可能不健康的节点响应其请求的情况。然而，对冲请求的一个问题是，它们可能会导致接收服务器完成的工作量激增，以及额外请求和响应所需的额外带宽——这是存储系统所关心的像构造。此外，Tectonic 客户端不能真的只是选择另一个随机存储节点来写入他们的数据，他们必须与元数据层协调，以便元数据准确反映哪些节点存储哪些块。相反，Tectonic 使用保留请求，这些请求很小，类似于 ping 请求，客户端发送到多个块存储节点来决定将其数据实际写入哪些节点。 Tectonic 选择最先响应的块存储节点作为进行实际写入的节点，假设可以快速响应的节点当前没有过载。预留请求不携带任何用于实际写入的数据，因此它们使用的带宽非常少，并且处理成本非常低。例如，如果客户端正在写入 \\(R(3.2)\\) 复制文件，则客户端将首先向 5 个块存储节点发送预留请求。客户端选择最先响应的 3 个存储节点来实际发送 3 个写入请求。通过这种方式，数据仍然只广播到 3 个节点，但是首先通过预留请求进行的快速健康检查减少了客户端等待不健康或卡住的节点的可能性，从而减少了尾部延迟。预留请求不使用任何额外的带宽或处理，但与对冲请求相比确实有缺点。由于全块写入必须首先执行这些预留请求，因此它们会为每个写入增加一点延迟。这就是为什么预留请求仅用于全块写入，在这种情况下，写入的数据量足够大，这种延迟开销是可以接受的更好的尾部延迟的折衷。我假设预留请求在实践中运行良好，但我感兴趣的是预留请求提供的健康检查和负载平衡信号必须是多近的，以避免最糟糕的尾部延迟。我可以想象一个使用较少检查频率的系统可能仍然能够提供预订请求的大部分好处，同时还减少了完成的工作量。\nTectonic 还通过仲裁追加来优化小于块大小的追加，类似于完整块写入。优化有助于减少尾部延迟，但对于部分块追加而不是完整块写入，仲裁提交要正确实现有点棘手。如果您正在编写一个完整的块，那么您不必担心并发写入器争相写入同一个块，但是对于较小的写入，这可能是一个问题。为了说明可能发生的可能错误，请考虑一个 \\(R(3.2)\\) 文件，该文件的块大小为 8MB，多个客户端附加到单个块。客户端A追加512字节，成功提交追加到第一个和第二个块，但写入第三个块副本失败。然后客户端 B 控制文件并附加另外 512 个字节，但第二个块副本失败，第一个和第三个成功。最后，客户端 C 控制了文件并附加了另外 512 个字节，但是第一个块写入失败，而第二个和第三个成功。剩下的第一个块副本长度为 1024 字节（第一和第二次追加），第二个副本长度为 1024 字节（第一和第三次追加），第三个副本长度为 1024 字节（第二和第三次追加）。读者会看到文件元数据报告的块长度为 1536 字节，但实际数据块都不是那个长度！并且没有一个块包含相同的数据！并且不清楚在完成这些写入时读者可能会阅读什么！或者，如果所有的块都以相同的数据结束！或者，如果这篇博文中的其余句子将以感叹号结尾！ 4 Tectonic 处理这些潜在问题的方式是强制执行两条规则：(1) 只允许创建块的客户端附加到它，以及 (2) 客户端向元数据层提交新的块长度和校验和之前确认仲裁附加到应用程序。虽然论文没有明确说明这一点，但我认为单个客户端会将其追加序列化到给定的块存储节点——也就是说，如果它执行第一次追加和第二次追加，它将等待第一次追加到在将第二个 append 写入存储节点之前成功。通过客户端完成这种序列化，并强制只有一个客户端可以写入块，我们上面的竞争不会发生，因为客户端将在写入第二个追加之前等待第一个追加发生在块存储节点上。这可以确保多个作者不会互相踩踏。在每个仲裁追加之后提交块长度和校验和，但在向应用程序确认之前向读者保证他们可以读取的内容。这意味着应用程序应该具有写后读一致性，因为 Tectonic 向应用程序确认的任何数据都已持久提交到两个块存储节点，并将新长度提交到元数据层。一般来说，这意味着如果 Tectonic 报告的块长度为 \\(B\\) 字节，那么至少 \\(B\\) 字节已经被提交到两个块存储节点，并且任何客户端都可以读取到 \\(B\\)字节，并保证它们是正确的。许多工作负载是“一次写入，很少读取”，这意味着数据应该进行 Reed-Solomon 编码而不是复制以减少存储开销。但是，数据通常以交互方式写入，并且写入延迟对客户端很重要，因此使用复制编码来减少尾部延迟 5 是有意义的。利用复制写入改进的延迟，同时还具有提高了 Reed-Solomon 编码的字节效率。\n通过让客户端以复制编码写入块，Tectonic 可以吃蛋糕，也可以吃它，但是一旦块已满并密封，客户端将在后台将块重新编码为 Reed-Solomon。通过我们讨论的所有优化，应用程序通过这种方式获得了复制写入的改进延迟，但 Reed-Solomon 存储的空间效率。从论文中不清楚如果客户端应用程序崩溃会发生什么，但我假设有一个后台服务可以将完全写入的块重新编码为 Reed-Solomon。 Tectonic 使用副本集复制来最大程度地减少在遇到协调磁盘故障时数据丢失的可能性。 Copyset 复制真的很聪明，但我们将不得不稍微备份一下，以讨论在尝试将数据放置到磁盘上时存在的困难问题和权衡。在选择将数据写入哪些磁盘时，在磁盘可能出现故障的情况下，需要在数据丢失的可能性与每个数据丢失事件丢失的数据量之间进行权衡。例如，如果对于所有 \\(R(3.2)\\) 复制文件，您将每个块副本写入随机选择的磁盘，则任何 3 个磁盘故障将导致某些复制文件的数据丢失事件的可能性越来越大。这是因为对于每个块，我们随机选择一组 3 个磁盘来存储其块，并且随着我们向系统添加更多块，最终每组 3 个磁盘将存储某个块的所有块副本。这意味着对于随机磁盘选择，当我们由于数据中心故障而丢失磁盘时，发生数据丢失事件的概率最高。然而，每个数据丢失事件丢失的数据量非常低，因为一个块的块副本恰好位于一组失败的磁盘上的可能性很小，因为它们是随机选择的。一种思考方式是，如果 3 个磁盘发生故障，则丢失块的预期值较低，但至少丢失一个块的概率很高。但是，您可以想象另一种方法，将所有节点分成 3 个节点的集合，称为副本集。当我们想将一个块的块分配给存储节点时，我们首先为该块选择一个副本集，然后将块副本分配给该副本集的 3 个节点。在具有 9 个节点的数据中心中，节点 \\([1,2,3]\\) 可能是一个副本集，\\([4,5,6]\\) 将是另一个副本集，而 \\([7,8,9]\\ ) 将是最后一个。在该方案中，只有3个三节点故障会导致数据丢失，即只有一个副本集的所有节点丢失才会导致一个块的数据丢失。这是一个非常低概率的事件，因为在可能的 \\({9 \\choose 3} = 84\\) 个三节点集合中只有 3 个集合会导致数据丢失。相比之下，随机节点复制最终会使所有 84 个三节点集成为某个块的副本集，因此副本集复制比随机复制提高了 28 倍，以降低数据丢失的概率。但请记住，对于副本集复制，每个数据丢失事件丢失的数据量会非常高——分配给副本集的所有块都将丢失。虽然丢失所有数据可能不是正确的权衡，但我们可能会在每个事件丢失更多数据的情况下进行权衡，以减少任何数据丢失事件的可能性。这是因为任何数量的数据丢失都会导致大量固定的数据恢复工作开销，作为运营商，我们真的希望尽可能避免它。这是我们寻找更好的方式将块分配到磁盘的动机。\n除了影响数据丢失的概率之外，我们如何将块分配给节点也会影响我们假设的解决方案必须处理的系统的其他属性。在我们的 naive 3 copyset 设置中，如果节点 1 发生故障，我们只能从节点 2 和 3 恢复该数据，这可能会将这些节点上的负载增加 50%。对于随机磁盘选择设置，如果一个节点出现故障，我们可以从所有剩余节点恢复数据，因为数据已均匀分布在所有 84 个副本集上。因此，随机磁盘选择在提供潜在恢复工作的良好负载平衡方面具有优势。然而，如果我们打破严格的副本集设置，并允许一个节点上的数据潜在地复制到更多的其他节点，那么我们可以更快地从单个节点故障中恢复，并且不会在所有节点上施加太多负载。剩余节点。让我们将存储单个节点数据副本的节点数称为散点宽度。在上面 9 个节点和 3 个副本集的示例中，我们的分散宽度为 2，因为只有 2 个其他节点拥有任何其他节点数据的副本——节点 1 的数据也在节点 2 和节点 3 上。但是，如果我们引入了 3 \\([1,4,7]\\)、\\([2,5,8]\\) 和 \\([3,6,9]\\) 的更多副本集然后现在节点 1 上的数据可以在任一节点 2、3、4 或 7，因此分散宽度现在为 4——允许我们更快地从节点故障中恢复。总而言之，我们希望拥有较高的分散宽度以确保我们可以从大量节点恢复数据，但我们也希望将副本集的数量保持在较低水平以降低发生数据丢失事件的可能性。想出一个方案来做这两件事是一个不平凡的问题。 Copysets 论文为这个问题提供了一个近乎最优的解决方案，称为复制集复制，旨在创建给定散布宽度的少数副本集。换句话说，副本集复制降低了数据丢失事件的可能性，同时仍然允许节点之间的良好负载平衡。这篇论文解释了他们的算法如何是最优的，但核心思想是你创建系统中所有节点的排列，然后通过将排列组合成连续节点的运行来从排列中形成副本集。您可以通过创建更多排列来增加分散宽度，但这将创建更多副本集，因为额外的排列将具有不同的节点改组，从而导致不同和更多的副本集。但关键是副本集数量的这种增加将尽可能小，从而使数据丢失事件的概率尽可能低。当客户端需要写入块时，首先随机选择一个节点作为主节点，这将副本集集限制为每个排列一个。您可以选择一个随机排列及其副本集，或者在 Tectonic 的情况下，块层从对应于该块 ID 的排列中选择副本集，以排列数为模，以使其具有确定性。\n虽然相对于副本集方案初始放置是最佳的，但磁盘仍然会出现故障或被取出进行维护，因此后台重新平衡器服务也尝试将块的块保留在其原始副本集中。 Copyset 复制和 Tectonic&#39; ......", "note_en": "Today’s paper is  Facebook’s Tectonic Filesystem: Efficiency from Exascale from  FaST ‘21. The paper covers the Tectonic Filesystem at Facebook, its implementation, and various design decisions they made. I’ll summarize the paper and do a deeper dive on some of its highlights.\n While there is a rich history of filesystem papers and systems, it’s nice to read this Tectonic paper, since many of the oft-quoted papers are getting a bit long in the tooth.  The Google File System (2003) paper is almost two decades old but is cited more than  Bill Murray in the wild.  1 There are some more modern papers, mostly from Microsoft like  Windows Azure Storage (2011) and  Azure Data Lake Store (2017), but it’s nice to see something from a different company.\n  Tectonic uses a thick-client architecture, to enable streaming of data directly from disks to the client, and a sharded metadata service to serve the filesystem. Tectonic shards out the metadata layer into three components: (1) Name layer, (2) File layer, and (3) Block layer. Each of the layers are responsible for a part of the metadata, and all of them are implemented as stateless microservices on top of  ZippyDB, a horizontally scalable key-value store. Since the metadata layers are completely separate, each layer can be independently scaled to handle its load.\n  The Name layer provides the directory tree abstraction, mapping directories to the files and directories they contain. The File layer maps from files to their constituent  blocks. Blocks are an abstraction for a contiguous string of bytes that hide how they are stored or encoded. A file is just an ordered list of blocks.\n In Tectonic, blocks use either replicated encoding, where \\(N\\) identical chunks each store a complete copy of the block, or use  Reed-Solomon encoding where the block is encoded into \\(X\\) data chunks and \\(Y\\) code/parity chunks. The Block layer contains the mapping from a block to its encoding and its set of chunks.\n The final piece of Tectonic is the  Chunk Store which is its own distributed data-store where nodes store the raw byte chunks and some minimal metadata to map from chunk id to the bytes stored on a local, modified  XFS filesystem.\n  The schemas of the Name layer, File layer, and Block layer are in this table from the paper:\n    The Name layer maintains the mapping from directory to the subdirectories and files contained within it, and is sharded by the directory’s  dir_id. The File layer maps from files to its list of logical blocks and is sharded by the  file_id. The Block layer maps from blocks to the list of chunks/disks that store it and is sharded by the  blk_id. The Block layer also maintains a mapping from every disk to the list of blocks that are stored on it. This reverse mapping is useful for maintenance, e.g., when a disk is lost this mapping allows background maintenance tasks to enumerate exactly which blocks need to be up-replicated or otherwise reconstructed.\n ZippyDB groups keys together into shards, and guarantees that all key, value pairs with the same sharding id, are placed into the same shard. This means that Tectonic’s Name layer, which shards by  dir_id, can quickly serve from a single shard a strongly consistent list of all subdirectories and files in a directory, and its File layer, sharded by  file_id, can do the same for the list of all blocks for a file. However there’s no guarantee that subdirectories are placed on the same shard as the parent directory, and ZippyDB does not provide any cross-shard transactions, so most recursive filesystem operations are not supported.\n Tectonic’s ZippyDB schema also stores lists as fully “expanded” combinations of (key,value) pairs. That is, for a directory  foo containing subdirectories  bar and  quux, Tectonic stores two separate keys  (foo, bar) and  (foo, quux), and handles list requests for directory  foo with a prefix-key scan of  foo,. This expanded list format is used to reduce the cost of adding or removing single entries to large directories that already have many millions of files, since Tectonic does not have to deserialize, edit, serialize, and write back a million entry list.\n  Tectonic has single-writer, append-only semantics – meaning Tectonic prohibits multiple concurrent writers to a file, and files can only be appended to. To ensure single-writer semantics, whenever a client opens a file it is given a write token that is stored with the file in the metadata layer. Any time a client wishes to write to the file, it must include the write token, and only the most up-to-date write token is allowed to mutate the file metadata and write to its chunks.\n  While the control path goes through the metadata layer and ZippyDB, the data path is direct from the client to the chunk storage nodes. This reduces the networking bandwidth required for the system as a whole, as well as the compute required to move the bytes over the network.\n Tectonic’s thick-client has very fine-grained control over its reads and writes, since it goes directly to the chunk storage nodes to read and write individual chunks. This allows the client to be tuned for different workloads, e.g., whether to optimize for durability or latency of writes. The Tectonic client can also tune these parameters per file, and even per block, as opposed to other systems that may enforce a single configuration across the entire filesystem.\n  Tectonic uses the common  quorum commit, or quorum write technique, to optimize clients doing full-block writes – only requiring a client to durably write to a majority of all chunk replicas of a block in order to commit the block. To illustrate, for a \\(R(3.2)\\) replicated file with 3 replicas  2 Tectonic will only require the client to finish writing to 2 of the replica chunks before considering the block committed – which helps tail latency  3. If the final 3rd replica chunk write fails, Tectonic’s background maintenance services will fix up the block by repairing the 3rd chunk replica.\n  In addition to this common optimization, Tectonic uses a neat technique called  Reservation Requests to optimize full-block writes, that are similar to hedged requests discussed in  The Tail At Scale. To motivate reservation requests, we’ll first take a little detour and look at hedged requests, their benefits and drawbacks, and why reservation requests might be more suitable for Tectonic’s use case.\n Hedged requests are a latency optimization where instead of sending a single request for a piece of work, you send the request to potentially multiple servers, and accept the first response from the fastest server. The key to not just duplicating a lot of work though is that instead of immediately sending the request to multiple servers, you wait for a bit, where “a bit” means how long you’d expect a normal request to take. If the reply still hasn’t arrived, then you “hedge” your bet that this server will respond in a reasonable timeframe and send the same request to another replica.\n    Hedged requests help improve long-tail latency, since you avoid the situation where the client has to wait for a possibly unhealthy node to respond to its request before making any progress. However, a problem with hedged requests is that they can create a blow-up in the amount of work done by the receiving servers, as well as the additional bandwidth you need for the extra requests and responses – which is of concern for a storage system like Tectonic. In addition, Tectonic clients can’t really just choose another random storage node to write their data to, they have to coordinate with the metadata layer so that the metadata accurately reflects which nodes store which chunks.\n Tectonic instead uses  reservation requests, which are small, ping-like, requests that a client sends to multiple chunk storage nodes to decide which nodes to actually write its data to. Tectonic chooses the chunk storage nodes that respond first as the nodes to do the actual writes to, with the hypothesis that nodes that can respond quickly are not currently overloaded. The reservation requests don’t carry any of the data for actual writing, so they use very little bandwidth, and the processing can be super cheap.\n For example, if a client was writing to a \\(R(3.2)\\) replicated file, the client would first send reservation requests to 5 chunk storage nodes.\n  The 3 storage nodes that respond first are chosen by the client to actually send the 3 write requests to. In this way, the data is still only broadcast to 3 nodes, but the quick health-checking done first via the reservation requests reduces the likelihood that the client will wait on an unhealthy or stuck node, thereby reducing tail latency.\n  Reservation requests don’t use any extra bandwidth or processing, but do have drawbacks compared to hedged requests. Since full-block writes have to first perform these reservation requests, they add a little bit of latency to each of the writes. This is why reservation requests are only used for full-block writes, where the amount of data being written is large enough that this latency overhead is an acceptable tradeoff for better tail latency. I would assume reservation requests work well in practice, but I’d be interested how recent the health-checking and load-balancing signal provided by reservation requests has to be to avoid the worst of the tail latency. I could imagine a system using less frequent checks might still be able to provide the majority of the benefit of reservation requests, while also reducing the amount of work done.\n  Tectonic also optimizes smaller than block-size appends via quorum append, similar to full block writes. The optimization helps reduce tail latency, but for partial block appends instead of full block writes, quorum commit is a wee bit trickier to implement correctly. If you’re writing a whole block, then you don’t have to worry about concurrent writers racing to write to the same block, but with smaller writes this can be a problem.\n To illustrate the possible bugs that can happen, consider a \\(R(3.2)\\) file with a 8MB block size and multiple clients appending to a single block. Client A appends 512 bytes, and successfully commits the append to the first and second chunks, but the write to the third chunk replica fails. Then Client B takes control of the file and appends another 512 bytes, but the 2nd chunk replica fails, and the 1st and 3rd succeed. Finally, client C takes control of the file and appends another 512 bytes, but the 1st chunk write fails, while the 2nd and 3rd succeed. You’re left with the 1st chunk replica at length 1024 bytes (1st &amp; 2nd appends), the 2nd replica at 1024 bytes (1st and 3rd appends), and the 3rd replica at 1024 bytes (2nd &amp; 3rd appends).\n  Readers would see file metadata reporting a block length of 1536 bytes, but none of the actual data chunks are that length! And none of the chunks contain the same data!  And it’s unclear exactly what readers might read while these writes are being done! Or if all the chunks will end up with the same data! Or if the rest of the sentences in this blog post will end in exclamation points!   4\n The way Tectonic deals with these potential problems is to enforce two rules: (1) Only allow the client that created a block to append to it, and (2) The client commits to the metadata layer the new block-length and checksum before acknowledging the quorum append to the application.\n Although the paper doesn’t spell this out explicitly, I presume that a single client will serialize its appends to a given chunk storage node – that is, if it’s performing a first append and a second append, it will wait for the first append to succeed before writing the second append to the storage node. With this serialization done by a client, and enforcing only a single client can write to a block, our race above cannot happen as the client will wait for the 1st append to happen to a chunk storage node, before writing the 2nd append. This makes sure that multiple writers won’t stomp over each other.\n  Committing the block-length and checksum after each quorum append, but before acknowledging to the application gives readers guarantees about what they can read. It means the application should have read-after-write consistency, since any data that’s been acknowledged by Tectonic to the application, has been durably committed to two chunk storage nodes and the new length committed to the metadata layer. In general, this means that if Tectonic reports a block length of \\(B\\) bytes, then at least \\(B\\) bytes have been comitted to two chunk storage nodes, and any client can read up to \\(B\\) bytes and be guaranteed they’re correct.\n  Many workloads are “write once, read rarely” which would imply that the data should be Reed-Solomon encoded rather than replicated to reduce the storage overhead. However, the data is often written interactively, and the write latency is important to the client so it makes sense to use replicated encoding to reduce tail latency  5. It would be nice to take advantage of the improved latency of replicated writes while also having the improved byte efficiency of Reed-Solomon encoding.\n Tectonic is able to have its cake and eat it too by having the client write the block in a replicated encoding, but then once the block is full and sealed, the client will re-encode the block to Reed-Solomon in the background. This way the application gets the improved latency of replicated writes, with all the optimizations we discussed, but the space-efficiency of Reed-Solomon storage. It’s unclear from the paper what happens if the client application crashes, but I assume there is a background service that can re-encode fully written blocks to Reed-Solomon.\n  Tectonic uses   copyset replication to minimize its probability of data loss in the face of coordinated disk failures. Copyset replication is really smart, but we’ll have to back up a bit to discuss the difficult problems and tradeoffs that exist when trying to place data onto disks.\n When choosing which disks to write data to, in a world where disks can fail, there is a tradeoff between the likelihood of data loss and how much data is lost per data loss event. For example, if for all \\(R(3.2)\\) replicated files, you write each chunk replica to a randomly selected disk, it becomes increasingly likely that any 3 disk failures will result in a data loss event for some replicated file. This is because for every block, we choose a random set of 3 disks to store its chunks on, and as we add more blocks to the system, eventually every set of 3 disks will store all the chunk replicas for  some block.\n This means that for random disk selection, when we lose disks due to failures in the datacenter, we have the highest probability of a data loss event. However, the  amount of data lost per data loss event is very low, because of the low probability that a block will have its chunk replicas on exactly the set of disks that fail since they were chosen randomly. One way to think about this is that if 3 disks fail then the  expected value of blocks lost is low, but the probability that at least one block will be lost is high.\n However you could imagine another approach where all the nodes are separated into sets of 3 nodes, called a  copyset. When we want to assign chunks of a block to storage nodes, we first choose a copyset for the block, and then the chunk replicas are assigned to the 3 nodes of the copyset. In a datacenter with 9 nodes, nodes \\([1,2,3]\\) might be one copyset, \\([4,5,6]\\) would be another, and \\([7,8,9]\\) would be the last.\n  In this scheme, there are only 3 three-node failures that would cause data loss, i.e., only a loss of all the nodes of a copyset would cause data loss for a block. This is a very low probability event given that only 3 sets out of a possible \\({9 \\choose 3} = 84\\) three-node sets cause data loss. In comparison, random node replication will eventually make all 84 three-node sets a copyset for  some block, so copyset replication is a 28x improvement over random replication for reducing the probability of data loss. Remember though, that for copyset replication the amount of data lost per data loss event would be quite high –  all of the blocks assigned to the copyset would be lost.\n  While losing all of the data is probably not the right trade off, we’d probably trade off a little bit more data lost per event in order to reduce the likelihood of any data loss event. This is because any amount of data loss incurs such a large fixed overhead of work to recover data that as operators we’d really prefer to avoid it as much as possible. This is our motivation for finding a better way of allocating chunks to disks.\n Besides affecting the probability of data loss, how we assign chunks to nodes also affect other properties of the system that our hypothetical solution will have to deal with. In our naive 3 copyset setup, if node 1 failed, we could only recover that data from node 2 and 3, which could potentially increase the load on those nodes by 50%. For the random disk selection setup, if a node fails we can recover the data from all of the remaining nodes, since the data has been spread uniformly across all 84 copysets. So the random disk selection has the edge here in providing good load-balancing of potential recovery work.\n  However if we broke with our strict copyset setup, and allowed the data on a node to potentially be replicated to a larger number of other nodes, then we could recover from a single node failure faster, and not put as much load on all of the remaining nodes.\n Let’s call the number of nodes that store copies for a single node’s data our  scatter width. In our example above of 9 nodes, and 3 copysets, our scatter width is 2, as only 2 other nodes have copies of any other node’s data – node 1 has its data also on node 2 and node 3. However, if we introduced 3 more copysets of \\([1,4,7]\\), \\([2,5,8]\\), and \\([3,6,9]\\) then now the data on node 1 could be on either node 2, 3, 4, or 7, so the scatter width would be 4 now – allowing us to recover from node failures faster.\n  So to summarize, we’d like to have a high scatter width to ensure we can recover data from lots of nodes, but we also want to keep the number of copysets low in order to reduce the probability of a data loss event. Coming up with a scheme to do both of these things is a non-trivial problem.\n The  Copysets paper presents a near optimal solution to this problem called  copyset replication, that aims to create the fewset number of copysets given a scatter width. To put it another way, copyset replication reduces the probability of a data loss event while still allowing good load-balancing between nodes.\n The paper explains how their algorithm is optimal, but the core idea is that you create permutations of all nodes in the system, then form copysets from a permutation by chunking up the permutation into runs of consecutive nodes. You can increase scatter width by creating more permutations, but this will create more copysets since an additional permutation will have a different shuffling of nodes which results in different and more copysets. But the key is that this increase in the number of copysets will be as minimal as possible, keeping the probability of a data loss event as low as possible.\n  When a client needs to write a block, first a node is chosen randomly as the  primary, which constrains the set of copysets down to one per permutation. You could choose a random permutation and its copyset, or in Tectonic’s case the Block layer chooses the copyset from the permutation corresponding to that block ID modulo the number of permutations so that it’s deterministic.\n  While the initial placement is optimal with respect to the copyset scheme, disks will still fail or be taken out for maintenance, so the background rebalancer service also tries to keep a block’s chunks in its original copyset.\n Copyset replication, and Tectonic’\n......", "posttime": "2021-07-26 08:18:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,构造,tectonic,节点", "title": "Facebook 的构造文件系统：Exascale 的效率", "title_en": "Facebook's Tectonic Filesystem:Efficiency from Exascale", "transed": 1, "url": "https://paulcavallaro.com/blog/facebook-tectonic-filesystem/", "via": "", "real_tags": ["facebook", "构造", "tectonic", "节点"]}, {"category": "", "categoryclass": "", "imagename": "128366848b2d1f4a1cb3f28584ca70ab.png", "infoid": 1069742, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Wasp（Web 应用程序规范语言）是一种声明式 DSL（域特定语言），用于以更少的代码开发、构建和部署现代全栈 Web 应用程序。应用程序、页面、用户、登录、前端、生产等概念都融入到语言中，带来了新的表达水平，让您可以用更少的代码行完成更多的工作。在使用 Wasp 描述高级功能的同时，您仍然使用自己喜欢的技术（目前是 React、NodeJS、Prisma）编写其余逻辑。注意：Wasp 处于 alpha 阶段，因此可能会发生很大变化，存在错误并错过重要功能。 // file: main.wasp app TodoApp { title: &quot;Todo App&quot; } route &quot;/&quot; -&gt; page Main page Main { component: import Main from &quot;@ext/pages/Main.js&quot; // 导入 React 组件。 } query getTasks { fn: import { getTasks } from &quot;@ext/queries.js&quot; , // 导入 NodeJS 代码。实体：[任务]}实体任务{=psl id Int@id@default(autoincrement())描述字符串isDone布尔@default(false)psl=}源文件(.wasp,.js(x),.css,. ..) 由 waspc（Wasp 编译器）编译成您选择的 Web 技术堆栈（目前为 React + NodeJS/ExpressJS + Prisma）。快速入门：由于它的表现力，您可以使用很少的几行简洁、一致、声明性的代码从头开始创建和部署可用于生产的 Web 应用程序。\n灵活：当您需要比 Wasp 提供的更多控制时，您可以使用现有技术（例如 js/html/css/...）编写代码，并将其与 Wasp 代码结合使用！无锁定：如果 Wasp 对您来说限制太多，只需弹出并继续生成人类可读的源代码即可。在 OSX/Linux 上安装 Wasp。从那里，只需按照说明在不到一分钟的时间内运行您的第一个应用程序！这是 Wasp Universe 的主要存储库，包含核心代码（主要是 waspc - Wasp 编译器）和支持材料。目前，Wasp 处于 alpha 阶段并具有足够的功能，因此您可以在其中开发基本的 Web 应用程序！您可能会发现它在某些地方缺少灵活性或缺少一些更大的功能，但基础已经存在，我们现在正在添加在它们之上。万一你卡住了，你可以获取生成的代码并继续它。随着 Wasp 的进一步发展，它应该允许开发越来越复杂的 Web 应用程序，而无需弹出！虽然我们的想法是在未来支持多个 Web 技术堆栈，但现在我们专注于特定堆栈：React + react-query、NodeJS + ExpressJS、Prisma。随着时间的推移，考虑到趋势，我们可能会改变这一点，但就目前而言，这对于开发编译器和语言的目的来说非常有用。最好的起点是查看 waspc/，在那里你可以找到第一次贡献者的详细步骤 + 有关 Wasp 编译器的技术细节。\n即使您不打算提交任何代码，只要加入有关 discord 的讨论并提供您的反馈就已经很棒并且有很大帮助（激励我们并帮助我们弄清楚如何塑造 Wasp）！", "note_en": "Wasp ( Web  Application  Specification Language) is a declarative DSL (domain-specific language) for developing, building and deploying modern full-stack web apps with less code.\n Concepts such as  app,  page,  user,  login,  frontend,  production, etc. are baked into the language, bringing a new level of expressiveness and allowing you to get more work done with fewer lines of code.\n While describing high-level features with Wasp, you still write the rest of your logic in your favorite technologies (currently React, NodeJS, Prisma).\n NOTE: Wasp is in alpha and is therefore likely to change a lot, have bugs and miss important features.\n // file: main.wasp app  TodoApp  {  title:  &#34;Todo App&#34; } route   &#34;/&#34;  - &gt;  page  Main page  Main  { component:  import  Main  from  &#34;@ext/pages/Main.js&#34;  // Importing React component. } query  getTasks  { fn:  import  {  getTasks  }  from  &#34;@ext/queries.js&#34; ,  // Importing NodeJS code. entities:  [ Task ] } entity  Task  { = psl  id  Int @ id @ default ( autoincrement ( ) )  description   String  isDone  Boolean @ default ( false ) psl = }\n Source files ( .wasp,  .js(x),  .css, ...) are compiled by  waspc (Wasp compiler) into the web technology stack of your choice (currently React + NodeJS/ExpressJS + Prisma).\n   Quick start: Due to its expressiveness, you can create and deploy a production-ready web app from scratch with very few lines of concise, consistent, declarative code.\n Flexible: When you need more control than Wasp offers, you can write code in existing technologies such as js/html/css/... and combine it with Wasp code!\n No lock-in: If Wasp becomes too limiting for you, simply eject and continue with the generated source code, which is human-readable.\n     to install Wasp on OSX/Linux. From there, just follow the instructions to run your first app in less then a minute!\n   This is the main repo of the Wasp universe, containing core code (mostly  waspc - Wasp compiler) and the supporting materials.\n  Currently, Wasp is in alpha and has enough features so that you can develop a basic web app in it!You might find that it misses flexibility in some places or that some bigger features are missing, but the basics are there and we are now adding on top of them.In the case you get stuck, you can take the generated code and continue with it.As Wasp grows further, it should allow the development of web apps of increasing complexity, without the need to eject!\n While the idea is to support multiple web tech stacks in the future, right now we are focusing on the specific stack: React + react-query, NodeJS + ExpressJS, Prisma. We might yet change that as time goes, taking trends into account, but for now, this is serving us well for the purpose of developing compiler and language.\n   The best place to start is to check out  waspc/, where you can find detailed steps for the first time contributors + technical details about the Wasp compiler.\n Even if you don&#39;t plan to submit any code, just joining the discussion on discord    and giving your feedback is already great and helps a lot (motivates us and helps us figure out how to shape Wasp)!", "posttime": "2021-07-26 08:18:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,编程,programming,web,wasp", "title": "Wasp – 一种了解 Web 应用程序是什么的编程语言", "title_en": "Wasp – A programming language that understands what a web app is", "transed": 1, "url": "https://github.com/wasp-lang/wasp", "via": "", "real_tags": ["程序", "编程", "web", "wasp"]}]