[{"category": "", "categoryclass": "", "imagename": "8f347b7bf2a320804fbec8c5625b16e5.jpg", "infoid": 1031473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从洛杉矶开始-在昨天洛杉矶公羊(Los Angeles Rams)试运行弹出式商店的基础上，Postmate用户将能够在PostMates应用程序中购买该公司新零售标签中列出的当地商家，并适当地将其命名为“shop”。\n这是由耐克资深高管迈克·巴克利(Mike Buckley)发起的一项新计划的首次公开启动。巴克利是一名资深耐克高管，Postmate在8月份挖走了他，成为该公司负责业务的高级副总裁。在耐克，巴克利担任数字商务运营和新商业模式副总裁。\n虽然Postmate在零售递送(主要是电子产品)方面迈出了一些小步，但巴克利表示，这项新服务极大地扩大了这一足迹。愿意在洛杉矶购物的顾客可以买到各式各样的商品，从家居用品、化妆品、衣服到黑胶唱片，应有尽有。\n巴克利说，公司决定在洛杉矶开始努力，因为这是一个PostMate有很好的送货工人渗透率和巨大市场的市场。巴克利说：“我们希望创造一种体验，作为一名消费者，如果你去那里，你会感觉到有很好的覆盖面。”“洛杉矶大都市区的大部分地区都将可以访问该选项卡。我们在阿博特金尼…的威尼斯海滩开始了测试。那是你可以找到最好的报道的地方..。我们在洛杉矶更广泛的城市地区都有合理的覆盖范围。“。\n发布时，网站上将有近50家零售商，包括巴克·梅森(Buck Mason)、Le Labo、降落伞之家、威尼斯海滩精品店、库图拉第12部落(Coutula第12 Tribe)、廷巴克2(Timbuk2)、扎迪格&伏尔泰(Zadig&amp；Voltaire)、超级乙烯和Urbanic等商店。\n巴克利表示，零售商可以决定通过这款应用销售多少产品，主要目标是看看什么样的产品能引起消费者的共鸣送货。\n对于那些因应新冠肺炎疫情而实施的禁售令受到沉重打击的当地商家来说，PostMate的按需送货选择可能会为警惕的潜在购物者创造一条新的路线，他们仍然不愿冒险在一家小精品店排队结账。\n随着美国案件数量的激增，对一些地区来说，恢复封锁的前景迫在眉睫。这可能会对已经预计会惨淡的零售额产生影响。\n事实上，在线分析服务eMarketer预计今年美国零售总额将下降10.5%，实体销售…将下降14.0%。甚至在本月早些时候第二波大流行在美国开始激增之前。\n新的按需选项还可以为零售商提供另一种吸引顾客的途径，通过定时闪电销售、向PostMate用户独家“降价”，以及巴克利在耐克的股票和交易中使用的其他零售技巧来吸引顾客。\n巴克利说：“这绝对是我们认为我们可以推动与这些商家接触的方式之一，并与这些商家一起发出行动呼吁。”\n在某些方面，进军消费者零售购物让Postmate回到了最初的日子，当时这项服务允许用户要求送货几乎任何东西。“我认为这个持续的…。该公司对Anytime Anywhere…的最初设想。他们渴望提供各种不同的产品，而食物成为了杀手级应用，因为频率很高。“巴克利说。\n“商店”按钮将对洛杉矶居民上线，在2021年第一季度更广泛地推出之前，整个第四季度将仅限于洛杉矶使用。巴克利预计，这项新服务将首先在西南部的其他大城市地区逐步推出，然后再进入东海岸的市场。\n在PostMate的“商店”标签中，商店将能够出售他们的库存，并展示包括高分辨率图像在内的可配置目录的产品。商店还可以为顾客提供按需送货、店内提货或非接触式路边提货的选择。\n据该公司称，送货和服务费将适用于购物体验，但Postmate的无限订户将获得免费送货服务。\n使用这项新服务的零售商之一Anastasia Beverly Hills的销售总监希瑟·德莱昂(Heather DeLeon)在一份声明中说，“今年，COVID确实改变了我们购买必需品、娱乐消遣的方式，甚至改变了我们对待自己的方式。”“商店是一个非常有趣的机会，因为它让人们以一种全新的、令人兴奋的方式接触到我们的产品。”", "note_en": "Starting in Los Angeles —  and building on yesterday’s test run pop-up shop with the Los Angeles Rams — Postmates users will be able to shop local merchants listed in the company’s new retail tab in the  Postmates   app called, appropriately, “shop”.\n  It’s the first public launch of a new initiative headed up by Mike Buckley, a veteran  Nike   exec who Postmates poached in August to become the company’s senior vice president of business. At Nike, Buckley served as the vice president of digital commerce operations and new business models.\n While Postmates has made some small steps in retail delivery (primarily electronics), Buckley said the new service greatly expands that footprint. Shops available to willing Los Angeles customers to cover everything from home goods, cosmetics, and clothes to even vinyl records.\n Buckley said the company decided to launch its efforts in Los Angeles, because it was a market where Postmates had a good penetration of delivery workers and big market. “We wanted to create an experience where, as a consumer, if you went there you would feel there’s good coverage,” Buckley said. “ Most of the LA metro area will have access to the tab. We started the test in Venice Beach in Abbott Kinney… that’s where you’d find the best coverage.. We have reasonable coverage throughout broader urban LA.”\n  At launch, there will be nearly fifty retailers on the site including shops like Buck Mason, Le Labo, Parachute Home, the Venice Beach boutique, Coutula 12th Tribe, Timbuk2, Zadig &amp; Voltaire, Supervinyl and Urbanic.\n Retailers can decide how many products they want to sell through the app, and the main goal, according to Buckley is to see what kind of products resonate with consumers for delivery.\n For local merchants who have been hit hard by the lockdown orders put in place as a response to the COVID-19 pandemic, on-demand delivery options from Postmates could create a new line to wary would-be shoppers that still don’t feel like braving the checkout line at a small boutique.\n As case counts spike in the U.S. the prospect of a return to lockdown looms large for some regions. That could have an impact on retail sales that were already projected to be dismal.\n In fact,  the online analytics service eMarketer projected a 10.5% decline in total US retail sales this year, and a 14.0% drop in brick-and-mortar sales… even before the second wave of the pandemic began surging in the U.S. earlier this month.\n The new on-demand option could also provide retailers with another avenue to lure customer through timed flash sales, exclusive “drops” to Postmates users, and other retailing tricks that were Buckley’s stock and trade at Nike.\n “That’s absolutely one of the ways we think we can drive engagement to these merchants and create calls to action with these merchants,” Buckley said.\n In some ways, the move into consumer retail shopping takes Postmates back to its earliest days, when the service allowed users to demand delivery of almost anything. “ I think about this continuing… the company’s original vision of anything anytime anywhere… They had an aspiration to deliver all kinds of different products and food became the killer app given the frequency,” Buckley said.\n The ‘Shop’ button is going live for Los Angeles residents and will be restricted to Los Angeles throughout the fourth quarter before a wider rollout in the first quarter of 2021. Buckley expects the new service to be phased in at other big metro areas across the Southwest first before hitting markets on the East Coast.\n Within the Postmates ‘Shop’ tab shops will be able to sell their inventory and showcase products with configurable catalogues including high resolution images. Shops can also offer customers a choice between on-demand delivery, in-store pickup, or non-contact curbside pickup.\n Delivery and service fees will apply to the shopping experience, but Postmates unlimited subscribers will get free delivery, according to the company.\n “This year, COVID really changed the landscape of how we purchase essentials, spend time recreationally, and even how we treat ourselves,” said Heather DeLeon, Director of Sales, Anastasia Beverly Hills, one of the retailers using the new service, in a statement. “Shop is such an interesting opportunity because it lets people get their hands on our products in a completely new and exciting way.”", "posttime": "2020-10-27 21:20:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "送货,stores,洛杉矶", "title": "\nPostMate推出了一项新的零售送货功能，因为实体店的销售额下降了14%", "title_en": "\n\t\t\t\tPostmates is launching a new retail delivery feature as brick and mortar stores face 14% drop in sales\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/postmates-is-launching-a-new-retail-delivery-feature-as-brick-and-mortar-stores-face-14-drop-in-sales/", "via": "", "real_tags": ["送货", "stores", "洛杉矶"]}, {"category": "", "categoryclass": "", "imagename": "a8888577667c15cd88749121649608aa.jpg", "infoid": 1031472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司上周表示，正在准备这项功能。几个月前，该公司因拒绝对免费用户进行端到端加密通话而招致批评，这实际上为那些通话不能被Zoom访问的付费用户和那些拥有免费账户、通话不是那么私密的用户划清了界限。\nZoom表示，从Zoom 5.4.0开始，新的端到端加密功能将作为桌面和移动应用程序的技术预览推出，这使得视频通话以外的任何人-包括Zoom-进入对话都变得更加困难。\nZoom在5月份收购了Keybase，部分原因是为了将其加密技术引入Zoom Calls。\n由于必须为每个加入呼叫的用户启用端到端加密，因此某些其他功能将不可用。加密通话的用户将无法使用Zoom的云录音、实时转录和会议反应功能，参与者将无法通过电话加入通话或使用一对一私人聊天。而且，所有参与者都必须使用支持端到端加密的Zoom应用程序，因为浏览器版本将不起作用。\n任何想要使用端到端加密的免费账户都必须验证电话号码并添加账单信息-Zoom表示，这是防止滥用所必需的。\nZOOM的首席信息安全官Jason Lee说，端到端加密是“我们客户高度要求的一项功能，我们很高兴能让这成为现实。”迟到总比不到好。", "note_en": "The company  said last week that it was readying the feature, months  after it drew criticism for denying end-to-end encrypted calls to free users, effectively drawing a line between paid users whose conversations could not be accessed by Zoom and those with free accounts whose conversations weren’t as private.\n Zoom said the new end-to-end encryption feature, which makes it much harder for anyone outside of the video call — including Zoom — access to the conversation, will roll out as a technical preview starting in Zoom 5.4.0 for desktop and mobile apps.\n Zoom acquired  Keybase in May in part to bring its encryption technology to Zoom calls.\n  Because end-to-end encryption has to be enabled for every user joining the call, some other features will not be available. Users on an encrypted call won’t be able to use Zoom’s cloud recording, live transcription, and meeting reactions features, and participants won’t be able to join the call by phone or use one-to-one private chat. And, all participants have to use a Zoom app that supports end-to-end encryption, as the browser version will not work.\n Any free account wanting to use end-to-end encryption will have to verify a phone number and add billing information — which Zoom says is necessary to prevent abuse.\n Zoom’s chief information security officer Jason Lee said end-to-end encryption was a “highly requested feature from our customers, and we’re excited to make this a reality.” It’s better late than never.", "posttime": "2020-10-27 21:20:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,launches,zoom", "title": "\nZoom为免费会议推出端到端加密-具有吸引力", "title_en": "\n\t\t\t\tZoom launches end-to-end encryption for free meetings — with a catch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/zoom-launches-end-to-end-encryption-for-free-meetings-with-a-catch/", "via": "", "real_tags": ["免费", "launches", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "1ce88273ac74045bd0ac65b30d8c06fe.jpg", "infoid": 1031471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一次正式将宇航员运送到国际空间站进行标准机组轮换的任务现在暂定在11月14日。美国国家航空航天局(NASA)本周提供了任务的最新日期，此前该任务原计划在10月份进行。这是SpaceX的载人太空舱“乘员龙”(Crew Dragon)将首次飞抵国际空间站执行可操作的“换班”任务。今年早些时候，其历史性的Demo-2任务正式结束了测试阶段，并获得了NASA的使用认证。\n这次发射将搭载三名NASA宇航员，包括香农·沃克、维克多·格洛弗和迈克·霍普金斯，以及来自日本宇宙航空研究机构的日本宇宙航空研究机构宇航员野口宗一。在那里，他们将加入机组人员，进行定期的空间站操作，包括维护和升级，以及与地球上的研究人员合作进行实验。\n他们将加入国际空间站现有的机组人员，包括俄罗斯宇航员谢尔盖·雷日科夫和谢尔盖·库德-斯韦尔奇科夫，以及美国宇航局宇航员凯特·鲁宾斯。一旦他们到达，全体宇航员人数将从通常的6人增加到7人，但这将有助于确保将更多的时间花在研究和实验上，而不是机组人员为了确保空间站继续顺利运行而承担的常规任务。\nCrew-1将乘坐猎鹰9号火箭从卡纳维拉尔角发射，目标是美国东部时间晚上7点49分发射升空。当然，这可能会有变化，但就目前而言，请在您的日历上做好标记。", "note_en": "The first mission to officially carry astronauts to the International Space Station for a standard crew rotation is now tentatively set for November 14. NASA provided an updated date for the mission this week, after it shifted from an original planned timeframe of sometime in October. This is the first time that Crew Dragon,  SpaceX’s   human-rated capsule, will be flown in for an operational ‘shift-change’ mission at the ISS, after its historic Demo-2 mission earlier this year officially concluded its testing phase and certified it for NASA use.\n This launch will carry three NASA astronauts, including Shannon Walker, Victor Glover and  Mike Hopkins,   as well as JAXA astronaut Soichi Noguchi of Japan to the ISS, where they’ll join the crew and carry out regular station operations, including upkeep and upgrades, as well as conducting experiments in partnership with researchers on Earth.\n They’ll join the existing ISS crew, including Russian cosmonauts Sergey Ryzhikov and Sergey Kud-Sverchkov and NASA astronaut Kate Rubins. Once they arrive, the full crew size will be seven astronauts, which is up from the usual six, but this will help ensure that more time is spent on research and experimentation vs. the regular duties that the crew takes on just to ensure continued smooth operation of the station.\n  Crew-1 is set to launch aboard a  Falcon   9 rocket from Cape Canaveral, and is targeting a 7:49 PM EST liftoff. That’s subject to change, of course, but for now, mark your calendars.", "posttime": "2020-10-27 21:19:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国,spacex,宇航员", "title": "\n美国国家航空航天局(NASA)和SpaceX将11月14日定为首次发射机组人员龙的目标日期", "title_en": "\n\t\t\t\tNASA and SpaceX set November 14 target date for first operational Crew Dragon launch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/nasa-and-spacex-set-november-14-target-date-for-first-operational-crew-dragon-launch/", "via": "", "real_tags": ["nasa", "美国", "spacex", "宇航员"]}, {"category": "", "categoryclass": "", "imagename": "c8d29745ead8d992ac7f87cbc827ca4d.jpg", "infoid": 1031470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，100多个智能灌溉系统在没有密码的情况下暴露在网上，任何人都可以访问和篡改作物、树木种植园、城市和建筑群的灌溉计划。\n暴露的灌溉系统是由以色列的一家小型精品安全公司Security Joes发现的。\n所有人都在运行ICC PRO，这是摩托罗拉设计的顶层智能灌溉系统，用于农业、草坪和景观管理。\nSecurity Joes的联合创始人Ido Naor上个月告诉ZDNet，公司和市政府官员已经安装了ICC PRO系统，而没有改变默认的出厂设置，因为出厂设置中没有默认账户的密码。\nNaor说，在Shodan等物联网搜索引擎的帮助下，这些系统可以很容易地在线识别。\n一旦攻击者找到了可以上网的ICC PRO系统，Naor说他们所要做的就是键入默认的管理员用户名，然后按Enter键访问智能灌溉控制面板。\n在这里，Naor说攻击者可以暂停或停止浇水事件，改变设置，控制输送到水泵的水量和压力，或者通过删除用户来锁定灌溉系统。\n上个月，当NAOR第一次发现这个问题时，100多个ICC PRO灌溉系统在没有密码的情况下暴露在网上。\n这位安全研究人员表示，超过一半的暴露系统位于以色列各地，其余的分布在整个全球。\nNAOR上个月通知了CERT以色列，后者随后联系了受影响的公司、供应商摩托罗拉(Motorola)，并与其他国家的CERT团队分享了调查结果。\n上周曝光率开始好转。在摩托罗拉向客户发出一封关于将灌溉系统暴露在网上的危险的信后，Naor将这一进展归功于摩托罗拉。\n由于这些通知，上周可以上网的icc pro实例的数量开始下降到94个，今天下降到78个，因为公司开始将他们的灌溉系统安装在防火墙后面或私人网络上。\n然而，虽然情况有所改善，但今天仍然在网上暴露的很大一部分系统仍然没有为默认帐户设置密码。\nNaor的调查结果是在今年早些时候以色列政府表示伊朗黑客入侵以色列各地的水管理系统并试图改变水位之后得出的。幸运的是，被破坏的系统只管理农业水泵，很可能与灌溉系统有关。\n在这些入侵之后，以色列网络安全机构INCD在全国范围内发出警报，要求供水和水处理设施更改其基于网络的管理系统的密码。\n纳尔说，他上个月发现的灌溉系统与今年4月的事件无关。\nNaor告诉ZDNet，这些系统是根据我们搜索以色列公开管理小组的监测规则发现的。\n安全部门的工作人员一直在留意新出现的威胁，试图抢先攻击者一步。我们的任务之一是在野外搜索管理界面，以确保它们对驾车经过的攻击者的恢复能力。我们敦促组织和安全公司也这么做，他补充道。\n2018年的一篇研究论文由以色列研究团队撰写的一篇2018年的研究论文认为，灌溉系统可以成为类似僵尸网络的有组织攻击的目标，通过清空储水量，在特定地区造成水资源短缺。", "note_en": "More than 100 smart irrigation systems were left exposed online without a password last month, allowing anyone to access and tamper with water irrigation programs for crops, tree plantations, cities, and building complexes.\n The exposed irrigation systems were discovered by  Security Joes, a small boutique security firm based in Israel.\n All were running  ICC PRO, a top-shelf smart irrigation system designed by Motorola for use with agricultural, turf, and landscape management.\n Security Joes co-founder Ido Naor told ZDNet last month that companies and city officials had installed ICC PRO systems without changing default factory settings, which don&#39;t include a password for the default account.\n Naor says the systems could be easily identified online with the help of IoT search engines like Shodan.\n Once attackers locate an internet-accessible ICC PRO system, Naor says all they have to do is type in the default admin username and press Enter to access a smart irrigation control panel.\n Here, Naor says attackers can pause or stop watering events, change settings, control the water quantity and pressure delivered to pumps, or lock irrigation systems by deleting users.\n      More than 100 ICC PRO irrigation systems were left exposed online without a password last month when Naor first spotted this issue.\n The security researcher said that more than half of the exposed systems were located across Israel, with the rest being spread across the entire globe.\n Naor notified CERT Israel last month, which then contacted the affected companies, the vendor (Motorola), and also shared the findings with other CERT teams in other countries.\n The exposure started getting better last week. Naor credited Motorola with this development after the company sent a letter to customers about the dangers of leaving irrigation systems exposed online.\n As a result of these notifications, the number of internet-accessible ICC PRO instances started going down to 94 last week and to 78 today, as companies started putting their irrigation systems behind firewalls or on private networks.\n However, while the situation improved, a large chunk of the systems that are still exposed online today still don&#39;t have a password set up for the default account.\n  Naor&#39;s findings come after earlier this year the Israeli government said that Iranian hackers breached water management systems across Israel and tried to alter water levels. Luckily,  the breached systems managed only agricultural pumps, most likely linked to irrigation systems.\n Following these intrusions, the Israeli cyber-security agency INCD sent out a nationwide alert  asking water supply and water treatment facilities to change passwords for their web-based management systems.\n Naor said the irrigation systems he discovered last month were not linked to this April&#39;s incidents.\n &#34;These systems were found by our monitoring rules that search for open administrative panels in Israel,&#34; Naor told ZDNet.\n &#34;Security Joes are constantly on the lookout for emerging threats, trying to be one step ahead of the attackers. One of our missions is to search for administrative interfaces in-the-wild to ensure their resilience to drive-by attackers. We urge organizations and security firms to do the same,&#34; he added.\n A 2018 research paperA 2018 research paper, authored by an Israeli research team, argued that water irrigation systems could be targeted with botnet-like coordinated attacks to create water shortages in a certain area by emptying water reserves.", "posttime": "2020-10-27 21:19:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,systems,灌溉系统", "title": "100多个灌溉系统在没有密码的情况下在线暴露", "title_en": "Over 100 Irrigation Systems Left Exposed Online Without a Password", "transed": 1, "url": "https://www.zdnet.com/article/over-100-irrigation-systems-left-exposed-online-without-a-password/", "via": "", "real_tags": ["密码", "systems", "灌溉系统"]}, {"category": "", "categoryclass": "", "imagename": "5971b5525735228976f2fdf3ef87b1d6.jpg", "infoid": 1031469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据西班牙通讯社EFE报道，考古学家在秘鲁利马东南约250英里的山坡上发现了一幅2000年前的猫蚀刻作品。这种猫科动物长约120英尺，有一双球状的大眼睛，似乎在晒太阳。\n杰森·戈罗姆在“国家地理”杂志上写道，新发现的肖像是纳斯卡线，这是秘鲁沙漠中数百幅古代绘画中的一幅，通过去除岩石和土壤，在沙子上产生“负面”图像。其他纳斯卡线条描绘了包括虎鲸、猴子、蜂鸟和蜘蛛在内的动物，以及几何形状和人形。\n该地形图的年代为公元前200年至100年，被认为比该地区以前发现的任何其他地形图都要古老。据蒂芙尼·梅为“纽约时报”报道，工人们在重建纳斯卡线联合国教科文组织世界遗产的一部分时确认了蚀刻。\n秘鲁文化部在一份声明中说：“这一发现再次显示了这个遗址丰富多彩的文化遗产。”\n根据声明，在清洁和保护之前，懒洋洋的猫的形象“几乎看不见”。正如“泰晤士报”所指出的，研究人员只是在米拉多自然瞭望点附近发现了“一些有趣的东西”的迹象后才发现了它。\n“(它)即将消失，因为它位于一个相当陡峭的斜坡上，容易受到自然侵蚀的影响，”该部解释说。\n纳斯卡线以其令人印象深刻的规模和复杂性而闻名，自从20世纪现代重新发现以来，一直吸引着研究人员。但专家们对为什么公元前200年至公元600年在秘鲁南部蓬勃发展的纳斯卡文明花了如此多的时间和精力来创作这些巨大的雕像仍然存在分歧。\n秘鲁考古学家Toribio Mejia Xesspe是第一个系统研究这些线条的人，他于1926年从地面上对它们进行了检查。在接下来的十年里，商业飞行员提供了更全面的字形鸟瞰；20世纪40年代至70年代，纳斯卡专家保罗·科索克(Paul Kosok)和玛丽亚·赖切(Maria Reiche)辩称，根据国家地理的说法，这些线条满足了“天文和日历上的目的”。\n最近的研究已经偏离了Kosok和Reiche的理论，而是假设这些线条与旨在鼓励降雨和生育的宗教仪式有关。斯蒂芬·S·霍尔(Stephen S.Hall)在2010年为“国家地理”(National Geological)撰文称，越来越多的研究人员开始同意，“嘿不是在一个时间、一个地方、一个目的下做出的。”\n去年，日本山形大学(Yamagata University)的考古学家利用卫星图像、田野调查和人工智能分析确定了143条新的纳斯卡线。根据一份声明，研究结果表明，较大的字形充当仪式场所，而较小的字形充当旅行者的位置标记。\n秘鲁纳斯卡线的首席考古学家约翰尼·艾拉(Johny Isla)告诉EFE：“我们仍在发现新的数字，这相当令人震惊，但我们也知道还有更多的东西有待发现。”\n秘鲁沙漠的干旱气候数千年来一直保存着纳斯卡线。但侵蚀和人类活动对字形的生存构成了重大威胁。一个单一的脚印或轮胎痕迹就可能永久性地破坏这些古老线条的表面-近年来，这种破坏已经变得越来越常见。2014年，绿色和平活动人士在呼吁对气候变化采取行动的示威活动中涂抹了纳斯卡线的表面，2018年，一名卡车司机故意驾驶拖拉机越过秃鹰形状的字形后被捕。", "note_en": "Archaeologists have discovered a 2,000-year-old etching of a cat carved into a hillside some 250 miles southeast of Lima, Peru, reports Spanish news agency  EFE. The feline, which measures about 120 feet long, has wide, orb-like eyes and appears to be sunning itself.\n    The newly identified likeness is a  Nazca Line—one of hundreds of ancient drawings created in the Peruvian desert by removing rock and soil to produce a “negative” image in the sand, writes Jason Golomb for   National Geographic. Other Nazca Lines depict animals including orcas, monkeys, hummingbirds and spiders, as well as geometric shapes and humanoid figures.\n  Dated to between 200 and 100 B.C., the geoglyph is thought to be older than any others previously discovered in the region. Workers identified the etching while remodeling a portion of the Nazca Lines  Unesco World Heritage Site, reports Tiffany May for the   New York Times.\n  “The discovery shows, once again, the rich and varied cultural legacy of this site,” says Peru’s Ministry of Culture in a  statement.\n  Per the statement, the image of the lounging cat was “barely visible” prior to cleaning and conservation. As the  Times notes, researchers only found it after spotting signs of “something intriguing” near the Mirador Natural lookout point.\n  “[It] was about to disappear because it’s situated on quite a steep slope that’s prone to the effects of natural erosion,” the ministry explains.\n    Famed for their impressive scale and complexity, the Nazca Lines have fascinated researchers since their modern rediscovery in the 20th century. But experts remain divided over why the  Nazca civilization, which flourished in southern Peru between 200 B.C. and 600 A.D., dedicated so much time and energy to creating the massive figures.\n  Peruvian archaeologist Toribio Mejia Xesspe was the first to systematically study the lines, examining them from the ground in 1926. The following decade, commercial pilots provided a fuller aerial view of the glyphs; between the 1940s and ’70s, Nazca experts Paul Kosok and Maria Reiche argued that the lines fulfilled “astronomical and calendrical purposes,” per  National Geographic.\n  More recent investigations have shifted away from Kosok and Reiche’s theories, instead positing that the lines relate to  religious rituals designed to encourage rainfall and fertility. Increasingly, wrote Stephen S. Hall for   National Geographic in 2010, researchers are starting to agree that “[t]hey were not made at one time, in one place, for one purpose.”\n  Last year, archaeologists from Japan’s Yamagata University drew on satellite imagery, fieldwork and artificial intelligence analysis to identify  143 new Nazca Lines. According to a  statement, the findings suggested that larger glyphs served as ritual sites, while smaller ones acted as location markers for travelers.\n  “It’s quite striking that we’re still finding new figures, but we also know that there are more to be found,” Johny Isla, Peru’s chief archaeologist for the Nazca Lines, tells EFE.\n  The Peruvian desert’s arid climate has preserved the Nazca Lines for millennia. But erosion and human activity pose significant threats to the glyphs’ survival. A single footprint or tire mark could permanently destroy the surface of these ancient lines—and, in recent years, such damage has become increasingly common. In 2014, Greenpeace activists  smudged the surface of a Nazca Line during a demonstration calling for action on climate change, and in 2018, a truck driver was arrested after he intentionally drove a tractor across a  condor-shaped glyph.", "posttime": "2020-10-27 21:13:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "秘鲁,nazca,线条", "title": "秘鲁发现有2000年历史的纳斯卡系列，以躺猫为特色", "title_en": "2,000-Year-Old Nazca Line Featuring Lounging Cat Found in Peru", "transed": 1, "url": "https://www.smithsonianmag.com/smart-news/2000-year-old-cat-etching-found-peru-180976085/", "via": "", "real_tags": ["秘鲁", "nazca", "线条"]}, {"category": "", "categoryclass": "", "imagename": "d31768f043a397f45761ccf56624d357.png", "infoid": 1031468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月前，在读到Cloudflare实习生班级人数翻了一番的消息后，我很快重拾简历，申请了一份实习工作。长话短说：现在，几个月后，我发现自己开始研究Linux内核代码，并在Linux容器运行时gVisor中添加了一个相当酷的特性。\n我的实习是在新兴技术和孵化小组的一个涉及gVisor的项目上进行的。一位同事联系了我的团队，说他无法读取沙箱中堆栈跟踪的调试符号。例如，当隔离进程崩溃时，我们在日志中看到：\n*检查故障堆栈轨迹：*@0x7ff5f69e50bd(未知)@0x7ff5f69e9c9c(未知)@0x7ff5f69e4dbd(未知)@0x7ff5f69e55a9(未知)@0x5564b27912da(未知)@0x7ff5f650ecca(未知)@0x5564b27910fa(未知)。\n显然，这并不是很有用。我迫不及待地自愿修复这个堆栈展开代码-这能有多难呢？\n经过一些调试之后，我们发现项目中使用的日志库打开了/proc/self/mem，以便在每个内存映射区域的开头查找ELF标头。这是计算偏移量以找到调试符号的正确地址所必需的。\n事实证明，这种机制相当常见。堆栈展开代码通常在奇怪的上下文中运行-如SIGSEGV处理程序-因此不适合来回挖掘实际内存地址来读取ELF。这可能会引发另一个SIGSEGV。SIGSEGV处理程序内的SIGSEGV意味着要么通过SEGFAULT的默认处理程序终止，要么反复递归到同一处理程序(如果设置了SA_NODEFER)，从而导致堆栈溢出。\n然而，在gVisor内部，每次调用/proc/self/mem上的open()都会导致ENOENT，因为整个/proc/self/mem文件都丢失了。为了提供健壮的沙箱，gVisor必须小心地重新实现Linux内核接口。这个特定的/proc文件根本没有在gVisor的沙箱组件之一Sentry的虚拟文件系统中实现。Marek在项目聊天中询问了开发人员，并得到了确认-他们会很高兴接受实现此文件的补丁。\n最简单的解决办法是对展开的行为做一个小的本地补丁，然而我发现自己潜入Linux内核，试图弄清楚mem文件是如何工作的，试图在Sentry的VFS中实现它。\n该文件本身非常强大，因为它允许对进程的虚拟地址空间进行原始访问。根据手册页，有文档记录的文件操作是open()、read()和lSeek()。典型的用例是调试任务或转储进程内存。\n当进程想要打开文件时，内核执行文件权限检查，查找与mem相关的操作，并调用名为proc_mem_open的方法。它检索关联的任务并调用名为mm_access的方法。\n/**获取对任务mm的引用(如果它还没有离开)，并使用传递给它的模式参数ptrace_May_access*成功。*/。\n看起来比较直截了当，对吧？Mm_access的特殊之处在于，它验证当前任务对内存所属任务的权限。如果当前任务和目标任务不共享同一内存管理器，内核将调用名为__ptrace_May_access的方法。\n/**我们可以检查给定的任务吗？*此检查既用于附加ptrace*，也用于允许访问/proc中的敏感信息。**ptrace_Attach拒绝/proc允许的几种情况*因为无法设置必要的父/子关系*或停止指定的任务。**/。\n根据手册页，希望从不相关的/proc/[PID]/mem文件读取的进程应该具有访问模式ptrace_mode_ATTACH_FSCREDS。此检查不会验证进程是否通过ptrace_ATTACH附加，而是验证它是否具有使用指定凭据模式附加的权限。\n浏览完函数后，您将看到，如果当前任务与目标任务属于同一线程组，则允许进程访问；如果不满足以下条件，则允许进程访问(取决于是否设置了ptrace_mode_FSCREDS或ptrace_mode_REALCREDS，我们将使用文件系统UID/GID，通常与有效的UID/GID相同)，或者使用真实的UID/GID；如果当前任务与目标任务属于同一线程组，则允许进程访问；如果不满足以下条件，则拒绝访问(取决于是否设置了ptrace_mode_FSCREDS或ptrace_mode_REALCREDS，我们将使用文件系统UID/GID，通常与有效UID/GID相同)：\n当前任务的凭据(UID，GID)与目标进程的凭据(真实、有效和保存的Set-UID/GID)匹配\n在下一次检查中，如果当前任务在目标任务的用户命名空间内既没有CAP_SYS_PTRACE，也没有将目标的Dumpable属性设置为SUID_DUMP_USER，则拒绝访问。通常需要Dumpable属性来允许生成核心转储。\n在完成这三项检查之后，我们还将通过通用的Linux安全模块(和其他LSM)来验证我们的访问模式是否正常。您可能知道LSM是SELinux和AppArmor。COMMONCAP LSM根据有效或允许的进程能力(取决于模式为FSCREDS或REALCREDS)执行检查，允许在以下情况下进行访问。\n当前任务的功能是目标任务功能的超集，或者。\n当前任务和目标任务的凭据在给定凭据模式下匹配，目标任务是可转储的，它们在相同的用户命名空间中运行，并且目标任务的能力是当前任务能力的子集。\n我强烈建议您阅读ptrace手册页，更深入地挖掘不同的模式、选项和检查。\n由于所有访问检查都在打开文件时进行，因此读取文件非常简单。当对mem文件调用read()时，它会调用mem_rw(它实际上既可以进行读操作，也可以进行写操作)。\n为了避免使用大量内存，mem_rw在循环中执行复制，并在中间页中缓冲数据。Memrw具有隐藏的超能力，即，它使用FOLL_FORCE来避免对用户拥有的页面进行权限检查(处理标记为不可读/不可写、可读和可写的页面)。\n如果目标任务在打开文件描述符后退出，则执行read()将始终成功，并读取0字节\n如果从目标任务的内存到中间页的初始拷贝失败，它并不总是返回错误，但只有在没有读取数据的情况下才会返回错误。\n幸运的是，gVisor已经将ptrace_May_access实现为kernel.task.CanTrace，因此可以避免重新实现所有的ptrace访问逻辑。但是，由于缺乏对ptrace_mode_FSCREDS的支持(这仍然是一个悬而未决的问题)，gVisor中的实现不那么复杂。\n当新的文件描述符打开()时，会调用虚拟inode的GetFile方法，因此这是访问检查自然发生的地方。访问检查成功后，该方法返回fs.File。Fs.File实现了您预期的所有文件操作，比如read()和write()。例如，gVisor还提供了大量用于快速构建工作文件结构的原语，这样就不必重新实现泛型lSeek()。\n如果任务调用对fs.File的read()调用，则read方法将检索该文件的Task的内存管理器。使用类似于io.Writer和io.Reader的接口，使用舒适的Copin和CopyOut方法访问任务的内存管理器非常容易。\n*检查故障堆栈跟踪：*@0x7f190c9e70bd Google：：LogMessage：：Fail()@0x7f190c9ebc9c Google：：LogMessage：：SendToLog()@0x7f190c9e6dbd Google：：LogMessage：：Flush()@0x7f190c9e75a9 Google：：LogMessageFtal：：~LogMessageFtal()@0x55d6f718c2da main@0x7f190c510cca_libc_start_main@0x55d6f718c0c0start_main@0x7f190c510cca_libc_start_main@0x55d6f718c0c0start。\n全面胜利！/proc/&lt；pid&gt；/mem文件是深入了解进程内存内容的重要机制。在出现复杂和不可预见的故障时，堆叠开卷机进行工作是必不可少的。由于进程内存包含高度敏感的信息，因此对文件的数据访问由一组文档不完善的复杂规则决定。稍加努力，您就可以在gVisor的沙箱中模拟/proc/[pid]/mem，其中该进程只能访问gVisor作者已经实现的procf子集，因此，您可以在发生崩溃时访问易于读取的堆栈跟踪。\n深潜编程Linux", "note_en": "A few months ago, after reading about  Cloudflare doubling its intern class size, I quickly dusted off my CV and applied for an internship. Long story short: now, a couple of months later, I found myself staring into Linux kernel code and adding a pretty cool feature  to gVisor, a Linux container runtime.\n My internship was under the Emerging Technologies and Incubation group on a project involving gVisor. A co-worker contacted my team about not being able to read the debug symbols of stack traces inside the sandbox. For example, when the isolated process crashed, this is what we saw in the logs:\n *** Check failure stack trace: *** @ 0x7ff5f69e50bd (unknown) @ 0x7ff5f69e9c9c (unknown) @ 0x7ff5f69e4dbd (unknown) @ 0x7ff5f69e55a9 (unknown) @ 0x5564b27912da (unknown) @ 0x7ff5f650ecca (unknown) @ 0x5564b27910fa (unknown)\n Obviously, this wasn&#39;t very useful. I eagerly volunteered to fix this stack unwinding code - how hard could it be?\n After some debugging, we found that the logging library used in the project opened  /proc/self/mem to look for ELF headers at the start of each memory-mapped region. This was necessary to calculate an offset to find the correct addresses for debug symbols.\n It turns out this mechanism is rather common. The stack unwinding code is often run in weird contexts - like a SIGSEGV handler - so it would not be appropriate to dig over real memory addresses back and forth to read the ELF. This could trigger another SIGSEGV. And SIGSEGV inside a SIGSEGV handler means either termination via the default handler for a segfault or recursing into the same handler again and again (if one sets  SA_NODEFER) leading to a stack overflow.\n However, inside gVisor, each call of  open() on  /proc/self/mem resulted in  ENOENT, because the entire  /proc/self/mem file was missing. In order to provide a robust sandbox, gVisor has to carefully reimplement the Linux kernel interfaces. This particular  /proc file was simply unimplemented in the virtual file system of Sentry, one of gVisor&#39;s sandboxing components.  Marek asked the devs on the project chat and got confirmation - they would be happy to accept a patch implementing this file.\n The easy way out would have been to make a small, local patch to the unwinder behavior, yet I found myself diving into the Linux kernel trying to figure how the  mem file worked in an attempt to implement it in Sentry&#39;s VFS.\n  The file itself is quite powerful, because it allows raw access to the virtual address space of a process.  According to manpages, the documented file operations are  open(),  read() and  lseek(). Typical use cases are debugging tasks or dumping process memory.\n  When a process wants to open the file, the kernel does the file permissions check, looks up the associated operations for  mem and invokes a method called  proc_mem_open. It retrieves the associated task and  calls a method named  mm_access.\n /* * Grab a reference to a task&#39;s mm, if it is not already going away * and ptrace_may_access with the mode parameter passed to it * succeeds. */\n Seems relatively straightforward, right? The special thing about  mm_access is that it verifies the permissions the current task has regarding the task to which the memory belongs. If the current task and target task do not share the same memory manager, the kernel  invokes a method named  __ptrace_may_access.\n /* * May we inspect the given task? * This check is used both for attaching with ptrace * and for allowing access to sensitive information in /proc. * * ptrace_attach denies several cases that /proc allows * because setting up the necessary parent/child relationship * or halting the specified task is impossible. * */\n According to the manpages, a process which would like to read from an unrelated  /proc/[pid]/mem file should have access mode   PTRACE_MODE_ATTACH_FSCREDS. This check does not verify that a process is attached via  PTRACE_ATTACH, but rather if it has the permission to attach with the specified credentials mode.\n  After skimming through the function, you will see that a process is allowed access if the current task belongs to the same thread group as the target task, or denied access (depending on whether  PTRACE_MODE_FSCREDS or  PTRACE_MODE_REALCREDS is set, we will use either the file-system UID / GID, which is typically the same as the effective UID/GID, or the real UID / GID) if none of the following conditions are met:\n the current task&#39;s credentials (UID, GID) match up with the credentials (real, effective and saved set-UID/GID) of the target process\n In the next check, access is denied if the current task has neither  CAP_SYS_PTRACE inside the user namespace of the target task, nor the target&#39;s dumpable attribute is set to  SUID_DUMP_USER.  The dumpable attribute is typically required to allow producing core dumps.\n After these three checks, we also go through the commoncap Linux Security Module (and other LSMs) to verify our access mode is fine. LSMs you may know are SELinux and AppArmor. The commoncap LSM performs the checks on the basis of effective or permitted process capabilities (depending on the mode being  FSCREDS or  REALCREDS), allowing access if\n the capabilities of the current task are a superset of the capabilities of the target task, or\n  the credentials of the current and target task match up in the given credentials mode, the target task is dumpable, they run in the same user namespace and the target task&#39;s capabilities are a subset of the current task&#39;s capabilities\n I highly recommend reading through the  ptrace manpages to dig deeper into the different modes, options and checks.\n  Since all the access checks occur when opening the file, reading from it is quite straightforward. When one invokes  read() on a  mem file,  it calls up  mem_rw (which actually can do both reading and writing).\n To avoid using lots of memory,  mem_rw performs the copy in a loop and buffers the data in an intermediate page.  mem_rw has a hidden superpower, that is, it uses  FOLL_FORCE to avoid permission checks on user-owned pages (handling pages marked as non-readable/non-writable readable and writable).\n  if the target task has exited after opening the file descriptor, performing  read() will always succeed with reading 0 bytes\n if the initial copy from the target task&#39;s memory to the intermediate page fails, it does not always return an error but only if no data has been read\n   Luckily, gVisor already implemented  ptrace_may_access as  kernel.task.CanTrace, so one can avoid reimplementing all the ptrace access logic. However,  the implementation in gVisor is less complicated due to the lack of support for  PTRACE_MODE_FSCREDS (which is  still an open issue).\n When a new file descriptor is  open()ed, the  GetFile method of the virtual Inode is invoked, therefore this is where the access check naturally happens. After a successful access check, the  method returns a  fs.File. The  fs.File implements all the file operations you would expect such as  Read() and  Write(). gVisor also provides tons of primitives for quickly building a working file structure so that one does not have to reimplement a generic  lseek() for example.\n In case a task invokes a  Read() call onto the  fs.File, the  Read method retrieves the memory manager of the file’s Task.  Accessing the task&#39;s memory manager is a breeze with comfortable  CopyIn and  CopyOut methods, with interfaces similar to  io.Writer and  io.Reader.\n  *** Check failure stack trace: *** @ 0x7f190c9e70bd google::LogMessage::Fail() @ 0x7f190c9ebc9c google::LogMessage::SendToLog() @ 0x7f190c9e6dbd google::LogMessage::Flush() @ 0x7f190c9e75a9 google::LogMessageFatal::~LogMessageFatal() @ 0x55d6f718c2da main @ 0x7f190c510cca __libc_start_main @ 0x55d6f718c0fa _start\n  A comprehensive victory! The  /proc/&lt;pid&gt;/mem file is an important mechanism that gives insight into contents of process memory. It is essential to stack unwinders to do their work in case of complicated and unforeseeable failures. Because the process memory contains highly-sensitive information, data access to the file is determined by a complex set of poorly documented rules. With a bit of effort, you can emulate  /proc/[PID]/mem inside gVisor’s sandbox, where the process only has access to the subset of procfs that has been implemented by the gVisor authors and, as a result, you can have access to an easily readable stack trace in case of a crash.\n  Deep Dive  Programming  Linux", "posttime": "2020-10-27 21:07:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "proc,文件", "title": "潜入/proc/pid/mem", "title_en": "Diving into /proc/pid/mem", "transed": 1, "url": "https://blog.cloudflare.com/diving-into-proc-pid-mem/", "via": "", "real_tags": ["proc", "文件"]}, {"category": "", "categoryclass": "", "imagename": "a65acb4571a2368e6028e0301a455ef9.jpg", "infoid": 1031467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这轮融资由ion Crossover Partners和Viola Growth共同牵头，使这家初创公司迄今筹集的资金总额翻了一番，达到2.4亿美元。SimilarWeb的创始人兼首席执行官奥尔·奥尔(Or Offer)在接受采访时表示，这一次它没有披露估值，只是说他的公司现在“在大池子里玩”。它占据了财富100强企业的一半以上，其中包括沃尔玛(Walmart)、宝洁(P&amp；G)、阿迪达斯(Adidas)和谷歌(Google)。\n在某种背景下，在2017年的上一轮股权融资中，它的估值达到了8亿美元。\nSimilarWeb的技术与其他分析和市场情报提供商竞争，从尼尔森(Nielsen)和ComScore到世界上的Apptopias，在最基本的层面上，它为用户提供了一个仪表盘，让用户深入了解人们在台式机和移动设备上的去向。Offer说，它的不同之处在于它如何获取信息，以及在这个过程中它还做了什么。\n首先，它不仅关注有多少人在参观，还关注活动背后的触发因素-可以说是“为什么”。Offer表示，利用机器学习算法和深度学习等大量人工智能技术-就像以色列的许多技术一样，它是由这一领域拥有深厚专业知识的人建造的-SimilarWeb正在处理来自多个不同来源的数据，以推断其洞察力。\n他拒绝透露这些消息来源的更多细节，但他告诉我，他为隐私门和cookie列表的到来而欢呼，因为它们帮助我们查出、揭露、有时甚至根除了一些更邪恶的“分析”服务，并表示SimilarWeb完全没有受到这种转向更多数据保护的影响，因为严格来说，它不是一种分析服务，也不会以同样的方式嗅探景点的数据。他补充说，它还在探索扩大其数据池：\n他说：“我们一直在考虑可以使用哪些新信号。”“也许他们会包括CDN。但这就像谷歌在搜索中的排名。试图获得世界上最高的精确度是一个永无止境的故事。“。\n今年，全球健康大流行推动了网络上的大量活动，人们转向网站和应用程序不仅是为了休闲-呆在室内时可以做的事情，以抵消所有通常被取消的活动-也是为了商业，无论是使用电子商务服务购物的消费者，还是将一切都带到网上和云上继续运营的员工。\n这也促进了包括SimilarWeb在内的所有帮助这台机器运转的公司的业务。\n“消费者行为正在发生戏剧性的变化，所有的公司都需要更好的知名度，”Offer说。“最开始是卫生纸和洗手液，然后转移到办公桌和办公椅，但现在不只是电商，而是一切。想想大银行，他们70%的业务是线下的，现在是70%-80%的在线业务。公司正在进行数字化转型。“。\n他说，这反过来又促使更多的人了解他们的网络形象运作得有多好，基本的大问题是：“我的市场份额是多少，与我的竞争对手相比如何？”一切都与数字可见性有关，尤其是在变革时代。“。\nOffer表示，与许多其他公司一样，SimilarWeb最初的业务确实出现了下滑，为此，该公司已经承担了一些债务，作为以色列Paycheck保护计划的一部分，以帮助保护一些需要休假的工作岗位。但他补充说，在大流行开始之前，它的大多数客户现在都回来了，还有来自以前不太活跃的新类别的客户，比如汽车门户网站。\n客户构成的变化也为公司打开了一些机会之门。Offer指出，近几个月来，许多大型企业-例如，以前可能通过咨询公司间接使用SimilarWeb的技术-已经直接来到该公司。\n“我们已经启动了一项新的咨询服务，我们自己的专家与一个大客户合作，该客户可能对我们正在观察的行为有更深入、更复杂的问题。”这是所有大企业现在都有的问题。“。这项服务听起来像是一项部分是教育的努力，教那些不一定是数字的公司-首先要更加积极主动，部分是咨询。\n投资者表示，新的客户群和商界新的优先事项是推动这轮融资的两件事。\nION Crossover Partners的吉利·约汉(Gili Iohan)在一份声明中表示：“对于任何数字专业人士来说，SimilarWeb一直都是一个令人难以置信的工具。”但在过去的几个月里，很明显，交通智能--SimilarWeb提供的无与伦比的数据和数字洞察力--对任何想要在数字世界中取胜的公司来说都是绝对必要的。“。\n至于收购，SimilarWeb历来都是为了加快技术进军而进行的。例如，2015年，它收购了Quettra，以更深入地进入移动分析领域，并收购了Swayy，以进入内容发现洞察力(电子商务情报的关键)。Offer不会太详细地说明它确定的进一步目标是什么，但考虑到目前有相当多的公司在这一领域构建技术，可能有理由围绕更大的平台进行一些整合，以结合一些特性和功能。Offer表示，它正在寻找“拥有强大数据和数字智能的公司，拥有良好的产品。现在摆在桌面上的机会很多。“\n该公司还将进行一些招聘，计划到明年1月在全球再增加200人(目前约有600名员工)。\nViola Growth创始人兼普通合伙人Harel Beit-on在一份声明中表示：“自从我们三年前加入公司以来，SimilarWeb实施了从通用测量平台到基于垂直的解决方案的战略转型，这极大地扩大了其市场机会，创造了巨大的客户价值，”Viola Growth创始人兼普通合伙人Harel Beit-on在一份声明中表示。凭借一支由才华横溢的高管组成的优秀管理团队，我们相信，这一轮将公司定位为拥有数字智能类别，并利用数字时代的加速。“", "note_en": "Co-led by ION Crossover Partners and Viola Growth, the round doubles the total amount that the startup has raised to date to $240 million. Or Offer,  SimilarWeb’s   founder and CEO, said in an interview that it was not disclosing its valuation this time around except to say that his company is now “playing in the big pool.” It counts more than half of the Fortune 100 as customers, with Walmart, P&amp;G, Adidas and Google, among them.\n For some context, it hit an  $800 million valuation in its last equity round, in 2017.\n  SimilarWeb’s technology competes with other analytics and market intelligence providers ranging from the likes of Nielsen and ComScore through to the Apptopias of the world in that, at its most basic level, it provides a dashboard to users that provides insights into where people are going on desktop and mobile. Where it differs, Offer said, is in how it gets to its information, and what else it’s doing in the process.\n For starters, it focuses not just how many people are visiting, but also a look into what is triggering the activity — the “why”, as it were — behind the activity. Using a host of AI tech such as machine learning algorithms and deep learning — like a lot of tech out of Israel, it’s being built by people with deep expertise in this area — Offer says that SimilarWeb is crunching data from a number of different sources to extrapolate its insights.\n He declined to give much detail on those sources but told me that he cheered the arrival of privacy gates and cookie lists for helping ferret out, expose and sometimes eradicate some of the more nefarious “analytics” services out there, and said that SimilarWeb has not been affected at all by that swing to more data protection, since it’s not an analytics service, strictly speaking, and doesn’t sniff data on sights in the same way. It’s also exploring widening its data pool, he added:\n “We are always thinking about what new signals we could use,” he said. “Maybe they will include CDNs. But it’s like Google with its rankings in search. It’s a never ending story to try to get the highest accuracy in the world.”\n The global health pandemic has driven a huge amount of activity on the web this year, with people turning to sites and apps not just for leisure — something to do while staying indoors, to offset all the usual activities that have been cancelled — but for business, whether it be consumers using e-commerce services for shopping, or workers taking everything online and to the cloud to continue operating.\n That has also seen a boost of business for all the various companies that help the wheels turn on that machine, SimilarWeb included.\n “Consumer behavior is changing dramatically, and all companies need better visibility,” said Offer. “It started with toilet paper and hand sanitizer, then moved to desks and office chairs, but now it’s not just e-commerce but everything. Think about big banks, whose business was 70% offline and is now 70-80% online. Companies are building and undergoing a digital transformation.”\n That in turn is driving more people to understand how well their web presence is working, he said, with the basic big question being: “What is my marketshare, and how does that compare to my competition? Everything is about digital visibility, especially in times of change.”\n Like many other companies, SimilarWeb did see an initial dip in business, Offer said, and to that end the company has taken on some debt as part of Israel’s Paycheck Protection Program, to help safeguard some jobs that needed to be furloughed. But he added that most of its customers prior to the pandemic kicking off are now back, along with customers from new categories that hadn’t been active much before, like automotive portals.\n That change in customer composition is also opening some doors of opportunity for the company. Offer noted that in recent months, a lot of large enterprises — which might have previously used SimilarWeb’s technology indirectly, via a consultancy, for example — have been coming to the company direct.\n “We’ve started a new advisory service [where] our own expert works with a big customer that might have more deep and complex questions about the behaviour we are observing. They are questions all big businesses have right now.” The service sounds like a partly-educational effort, teaching companies that are not necessarily digital-first be more proactive, and partly consulting.\n New customer segments, and new priorities in the world of business, are two of the things that drove this round, say investors.\n “SimilarWeb was always an incredible tool for any digital professional,” said Gili Iohan of ION Crossover Partners, in a statement. “But over the last few months it has become apparent that traffic intelligence — the unparalleled data and digital insight that SimilarWeb offers — is an absolute essential for any company that wants to win in the digital world.”\n As for acquisitions, SimilarWeb has historically made these to accelerate its technical march. For example, in 2015 it  acquired Quettra to move deeper into mobile analytics and it  acquired Swayy to move into content discovery insights (key for e-commerce intelligence). Offer would not go into too much detail about what it has identified as a further target but given that there are quite a lot of companies building tech in this area currently, that there might be a case for some consolidation around bigger platforms to combine some of the features and functionality. Offer said that it was looking at “companies with great data and digital intelligence, with a good product. There are a lot of opportunities right now on the table.”\n The company will also be doing some hiring, with the plan to be to add 200 more people globally by January (it has around 600 employees today).\n “Since we joined the company three years ago, SimilarWeb has executed a strategic transformation from a general-purpose measurement platform to vertical-based solutions, which has significantly expanded its market opportunity and generated immense customer value,” said Harel Beit-On, Founder and General Partner at Viola Growth, in a statement. “With a stellar management team of accomplished executives, we believe this round positions the company to own the digital intelligence category, and capitalize on the acceleration of the digital era.”", "posttime": "2020-10-27 20:42:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,平台,based", "title": "\nSimilarWeb为其基于人工智能的网站和应用市场情报平台筹集1.2亿美元", "title_en": "\n\t\t\t\tSimilarWeb raises $120M for its AI-based market intelligence platform for sites and apps\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/similarweb-raises-120m-for-its-ai-based-market-intelligence-platform-for-sites-and-apps/", "via": "", "real_tags": ["人工智能", "平台", "based"]}, {"category": "", "categoryclass": "", "imagename": "194015af871dc0eae66ec9140ee18b52.jpg", "infoid": 1031464, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "实时分析初创公司Rockset今天宣布了一轮4000万美元的融资。该公司表示，这笔资金将用于增加员工队伍，加快产品开发和研究，同时支持其上市努力。\nDomo 2018年的一份报告估计，人类每天创造2.5万亿字节(或2.5艾字节)的数据，这个数字从那以后只会增加。也许并不令人惊讶的是，一些公司比其他公司更有效地利用数据泛滥。普华永道(Pricewaterhouse Coopers)最近对1800多名商界领袖进行的一项调查发现，43%的人从他们的信息中几乎没有获得实实在在的好处。超过20%的人报告说没有获得任何好处。\nRockset的解决方案是一套产品，可自动索引结构化、半结构化、地理和时间序列数据，以便进行实时搜索和分析。使用其工具，客户可以创建个性化体验，构建决策系统，并通过支持快速查询的索引数据库为物联网应用程序提供服务。\nRockset由开源RocksDB库的创建者构建，提供了从MongoDB、DynamoDB、Kafka、Kinesis、Amazon Web Services、Google Cloud Platform等接收数据的连接器。所有字段都输入到聚合索引中，该索引包括倒排索引、列索引和行索引(包括深度嵌套的字段)。此聚合索引编译信息列表，并允许对数据集进行分析查询以加快返回速度。开发人员可以直接在半结构化数据上运行SQL查询，包括筛选器、排序、聚合以及内部和外部联接。\nRockset最近推出了Query lambdas，它使客户能够通过API构建使用数据的应用程序。该公司还启动了对虚拟私有云中自动驾驶部署的支持。该平台允许客户独立选择计算和存储。它还利用可自动扩展和处理群集配置和索引管理的云本地架构，以优化成本。Rockset表示，所有数据都是在静态和传输过程中加密的，它为开发人员提供了在摄取时使用字段映射屏蔽敏感数据的选项。\n丹麦金融服务公司Matter使用Rockset对Amazon S3和DynamoDB中的半结构化数据运行分析查询，作为其自然语言处理架构的一部分。Rockset表示，Matter可以通过其定制标签应用程序利用新的人工智能模型和数据字段，而不必重建周围的基础设施和纠正糟糕的预测。\nRockset还声称，随着大流行刺激了对数字服务的投资，它看到了大幅增长。该公司表示，上一季度营收增长290%，而在该平台上执行的查询总数增加了313%。Rockset还表示，它增加了数百名新用户。该公司为100多个应用程序提供支持，标准认知(Standard Cognition)、博世(Bosch)、红杉(Sequoia)和其他公司的300多名开发人员使用该公司的云服务。\nRockset联合创始人兼首席执行官Venkat Venkataramani通过电子邮件对VentureBeat表示：“今天，每家公司都是一家构建现代数据应用的数据公司。”实时数据革命已经在进行中，我们很高兴能站在这一革命的前沿，让云计算规模的实时分析变得又快又容易。“\n红杉资本(Sequoia Capital)在格雷洛克合伙公司(Greylock Partners)的参与下，领导了超额认购的B轮融资。这两家公司都为公司的种子和首轮融资做出了贡献。Rockset于2018年11月以2150万美元的投资从秘密行动中脱颖而出。该公司总部设在加利福尼亚州圣马特奥，拥有32名员工。", "note_en": "Real-time analytics startup  Rockset today announced a $40 million round. The company says the funds will be used to grow its workforce and accelerate product development and research while bolstering its go-to-market efforts.\n A 2018 report from  Domo estimated that humans were creating 2.5 quintillion bytes (or 2.5 exabytes) of data per day, a number that has only increased since. Perhaps unsurprisingly, some companies are tapping the data deluge more effectively — and efficiently — than others. A recent Pricewaterhousecoopers  survey of over 1,800 business leaders found that 43% obtained little tangible benefit from their information. And over 20% reported deriving no benefit whatsoever.\n  Rockset’s solution is a product suite that automatically indexes structured, semi-structured, geo, and time series data for real-time search and analytics. Using its tools, customers can create personalized experiences, build decision systems, and serve internet of things applications with an indexing database that powers fast queries.\n Built by the creators of the open source  RocksDB library, Rockset offers connectors that ingest data from MongoDB, DynamoDB, Kafka, Kinesis, Amazon Web Services, Google Cloud Platform, and more. All fields are entered into a converged index that includes an inverted index, a columnar index, and a row index, including deeply nested fields. This converged index compiles lists of information and allows analytical queries on datasets to expedite returns. Developers can run SQL queries — including filters, sorts, aggregations, and inner and outer joins — directly on semi-structured data.\n Rockset recently launched Query Lambdas, which enables customers to build apps that consume data via an API. The company also kicked off support for self-driving deployments in virtual private clouds. The platform allows customers to select compute and storage independently. It also taps a cloud-native architecture that auto-scales and handles cluster provisioning and index management to optimize for cost. Rockset says all data is encrypted at rest and in transit, and it offers developers the option of masking sensitive data using field mappings at the time of ingest.\n Danish financial services company Matter uses Rockset to run analytical queries on semi-structured data in Amazon S3 and DynamoDB as part of its natural language processing architecture. Rockset says Matter can tap new AI models and data fields via its custom tagging app without having to rebuild the surrounding infrastructure and correct bad predictions.\n Rockset also claims it is seeing substantial growth as the pandemic spurs investment in digital services. The company says revenue grew 290% in the last quarter, while the aggregate number of queries executed on the platform increased by 313%. Rockset also says it added hundreds of new users. The company powers over 100 apps, with more than 300 developers at Standard Cognition, Bosch, Sequoia, and others using the company’s cloud services.\n “Today, every company is a data company building modern data applications,” Rockset cofounder and CEO Venkat Venkataramani told VentureBeat via email. “The real-time data revolution is already underway, and we are thrilled to be at the forefront of it by making real-time analytics at cloud-scale fast and easy.”\n Sequoia Capital led the oversubscribed series B round, with participation from Greylock Partners. Both firms contributed to the company’s seed and series A funding. Rockset emerged from stealth in November 2018 with a $21.5 million investment. The company is based in San Mateo, California and has 32 employees.", "posttime": "2020-10-27 20:40:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "服务器,led,数据", "title": "无服务器搜索和分析初创公司Rockset在红杉资本(Sequoia Capital)牵头的B系列融资4000万美元", "title_en": "Serverless search and analytics startup Rockset raises $40M Series B led by Sequoia Capital", "transed": 1, "url": "https://venturebeat.com/2020/10/27/rockset-raises-40-million-to-index-and-analyze-data-at-scale/", "via": "", "real_tags": ["服务器", "led", "数据"]}, {"category": "", "categoryclass": "", "imagename": "b46cccc2eb962ad7538d7703973e2629.jpg", "infoid": 1031463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从2021年12月起，英国的移动网络将被禁止销售锁定在其服务上的手机。\n监管机构英国通信办公室(Ofcom)表示，解锁手机往往可能是一个复杂的过程，这阻碍了用户在合同结束时更换供应商。\n[它]将节省人们的时间、金钱和精力-并帮助他们达成更好的交易，Ofcom的连接总监塞琳娜·查达(Selina Chadha)说。\n沃达丰已经回应说：当这些变化生效时，我们随时准备实施。\n要解锁一部智能手机，让它在任何网络上运行，通常需要花费大约10 GB。\n然而，根据英国通信办公室(Ofcom)的一项研究，所有试图这样做的人中，约有一半遇到了困难。\n这些可能包括等待很长时间才能收到触发流程所需的代码，然后发现代码无法工作。\n监管机构补充说，一些车主一开始就没有意识到他们的设备被锁住了，导致他们在试图切换时遭受服务损失。\n这项禁令意味着英国仍然遵守更广泛的欧洲规则，但英国通信办公室指出，在欧盟2018年出台这些规定之前，它就已经在调查这个问题了。\n英国政府表示，尽管计划在今年完成英国退欧过渡期，但仍将遵守欧洲电子通信代码(European Electronic Communications Code)。\n锁定手机禁令是电信提供商必须遵循的几项新措施之一。\n有义务在接到请求时以无障碍格式(如盲文)提供通信。这也必须在2021年12月之前完成。\n如果在签署之前没有告知客户的交易发生了变化，那么客户就有更强的离开权利。这项规定将于2022年6月生效。\n要求在加入前向客户展示合同关键部分的清晰摘要。这必须在2022年6月之前完成。\n此外，监管机构计划在2022年12月之前让更换宽带提供商变得更容易。\n目前，如果客户从一家依赖英国电信OpenReach网络的供应商切换到另一家，例如从Sky转向TalkTalk，他们所需要做的就是联系新的供应商，由其安排所有安排。\n但如果他们想要转移到另一个宽带网络--例如从英国电信(BT)到维珍媒体(Virgin Media)或城市光纤(CityFibre)--他们必须自己管理。\nOfcom曾要求该行业拿出一个流程来结束这种差异。\n但在未能做到这一点后，官员们现在正在制定自己的解决方案，尽管他们表示，他们将首先咨询公众和相关公司。", "note_en": "The UK&#39;s mobile networks are to be forbidden from selling phones locked to their services from December 2021.\n Regulator Ofcom said unlocking handsets could often be a complicated process, and this was discouraging owners from switching providers at the end of their contracts.\n      &#34;[It] will save people time, money and effort - and help them unlock better deals,&#34; said Ofcom&#39;s connectivity director Selina Chadha.\n Vodafone has already responded: &#34;We stand ready to implement these changes when they come into force.&#34;\n   It typically costs about £10 to get a smartphone unlocked to let it work on any network.\n However, according to a study by Ofcom, about half of all those who try to do so experience difficulties.\n These can include facing a long wait to receive the code needed to trigger the process, as well as then finding that the code does not work.\n  The regulator added that some owners do not realise their devices are locked in the first place, causing them to suffer a loss of service when they try to switch.\n The ban means the UK remains compliant with wider European rules, but Ofcom noted that it was already looking into the problem before the EU introduced the regulations in 2018.\n The UK government has said it will adhere to the European Electronic Communications Code, despite planning to complete the Brexit transition period this year.\n  The locked handsets ban is one of several new measures that telecoms providers will have to follow.\n  an obligation to provide communications in accessible formats - such as braille - when requested. This must also be done by December 2021\n giving customers a stronger right to leave if changes are made to deals that they were not told about before signing. This will come into force in June 2022\n a requirement that customers be shown a clear summary of a contract&#39;s key parts before joining. This must happen by June 2022\n In addition, the regulator plans to make it easier to switch broadband providers by December 2022.\n  At present, if customers switch from one provider reliant on BT&#39;s Openreach network to another - for instance from Sky to TalkTalk - all they need to do is contact the new supplier, which makes all the arrangements.\n But if they want to move to another broadband network - for example from BT to Virgin Media or CityFibre - they have to manage it themselves.\n Ofcom had asked the industry to come up with a process to end this discrepancy.\n But after it failed to do so, officials are now working on their own solution, although they say they will consult the public and the companies involved first.", "posttime": "2020-10-27 20:40:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,监管,regulator,英国", "title": "英国监管机构从2021年12月起禁止移动网络销售锁定的手机", "title_en": "UK regulator bans mobile networks from selling locked phones from December 2021", "transed": 1, "url": "https://www.bbc.com/news/technology-54692179", "via": "", "real_tags": ["手机", "监管", "regulator", "英国"]}, {"category": "", "categoryclass": "", "imagename": "3fc7f9c30dfdb8de31d78dddb9939322.png", "infoid": 1031462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "绑定连接以真正聚合多达8个互联网连接(光纤、ADSL、VDSL、4G等)的带宽提供具有任意FAI的混合互联网。\n支持TCP和UDP的V2Ray(可以在向导中在shadowsock和v2ray之间选择代理)。\n感谢所有帮助支付硬件、服务器、用于测试的电话费和CDN的捐款。\n默认安装LCD4Linux和FBTFT(配置文件和插件将在下一版本中发布)。\n添加Python JSON TLS管理服务器以获取/设置MPTCP、Shadowsock、Shorewall和glorytun设置。\n添加一个选项，使主多路径接口动态化，RTT最佳的接口用于从问题#199创建初始子流", "note_en": "Bonding connections to really aggregate bandwidth from up to 8 internet connections (Fiber, ADSL, VDSL, 4G,...)\t\t\t\t\t\t   Provide hybrid Internet with any FAI\n        V2Ray support for TCP and UDP (proxy can be selected in wizard between shadowsocks and v2ray)\n                Thank you for all donations that help pay for hardware, servers, phone bills used for testing, and the CDN.\n                                LCD4Linux and FBTFT are installed by default (a config file and plugin will be released in a next release)\n                    Add a python JSON TLS admin server to get/set MPTCP, Shadowsocks, Shorewall and glorytun settings\n        Add an option to make master multipath interface dynamic, interface with best RTT is used to create initial subflow from issue  #199", "posttime": "2020-10-27 20:35:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,免费,路由器,solution,用于", "title": "OpenMPTCP路由器v0.56发布，提供聚合互联网连接的免费解决方案", "title_en": "OpenMPTCProuter v0.56 is out, free solution to aggregate internet connections", "transed": 1, "url": "https://www.openmptcprouter.com", "via": "", "real_tags": ["发布", "免费", "路由器", "solution", "用于"]}, {"category": "", "categoryclass": "", "imagename": "50ae328d9f27a5c2c738534813bc6f79.jpg", "infoid": 1031461, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌Chrome的新选项卡页面在电脑上干净而简单，但似乎这种情况可能很快就会改变。在更新版本的Chrome上进行的一项实验表明，谷歌正在为新的选项卡页面开发一个小部件，它可能会显示本质上是购物广告的内容。\n最先被TechDows的人们发现并启用的是，Chrome Canary中出现了一面新的旗帜。“NTP购物任务”是本页的首批“模块”之一。这个新模块显示了各种类型产品的广告，但它们并不完全是随机的。\n在“新建选项卡页”上显示购物任务模块。-Mac、Windows、Linux、Chrome OS。\n完全启用此功能后，它会在您的站点快捷方式下添加一个相当大的小部件。这个小部件从您的Google搜索历史记录中提取，建议您“继续搜索”您最近一直在研究的产品。谷歌的内置例子突出了办公椅，但从技术上讲，这应该适用于任何产品。谷歌简要解释道：\n您现在看到的这个项目是基于您之前使用Google服务的活动。您可以在myactivity.google.com上查看、删除和更改您的设置。\n使用“x”按钮可以很容易地删除此小部件，但不清楚这是否是永久删除。目前，此功能仅使用标志-chrome：//flag/#ntp-module和chrome：//flag/#ntp-shop-task-module启用，而不是Canary中的默认设置。\n更新：谷歌澄清这些不是“广告”。该公司指出，他们只为这个小工具寻找免费的购物清单，内容不是赞助商。\n你正在阅读朝九晚五的谷歌新闻，这些专家日复一日地发布关于谷歌及其周边生态系统的新闻。请务必查看我们的主页以获取所有最新新闻，并关注Twitter、Facebook和LinkedIn上的朝九晚五谷歌，随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Google Chrome’s new tab page is clean and simple on computers, but it seems that may soon change. An experiment in newer versions of Chrome shows that Google is working on a widget for the new tab page that would show, possibly among other things, what are essentially shopping ads.\n  First spotted and enabled by the folks over at   TechDows, a new flag has shown up in Chrome Canary. “NTP Shopping Tasks” is one of the first “modules” being worked on for this page. This new module shows ads for various types of products, but they’re not entirely random.\n Shows the shopping tasks module on the New Tab Page. – Mac, Windows, Linux, Chrome OS\n When this feature is fully enabled, it adds a fairly sizeable widget underneath your site shortcuts. This widget pulls from your Google Search history to recommend that you “continue searching” for products that you’ve recently been researching. Google’s built-in example highlights office chairs, but technically this should work for any product. Google briefly explains:\n You’re seeing this item based on your previous activity using Google services. You can see your data, delete it, and change your settings at  myactivity.google.com.\n  This widget can be easily removed using the “x” button, but it’s unclear if that’s a permanent removal. Currently, this feature is only enabled with a flag —  chrome://flags/#ntp-modules and  chrome://flags/#ntp-shopping-tasks-module — and is not the default in Canary.\n  Update: Google clarified these are not “ads.” The company points out that they only source free shopping listings for this widget and that the content is not sponsored.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-10-27 20:31:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,google,广告", "title": "Google Chrome正在准备一个在新的选项卡页面上带有购物广告的小部件", "title_en": "Google Chrome is preparing a widget with shopping ads on the new tab page", "transed": 1, "url": "https://9to5google.com/2020/10/23/google-chrome-shopping-new-tab-page/", "via": "", "real_tags": ["chrome", "google", "广告"]}, {"category": "", "categoryclass": "", "imagename": "c0d99e0681d31b83ef3de5f4189d2789.jpeg", "infoid": 1031460, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛罗里达州卡纳维拉尔角。(美联社)--科学家周五称，美国国家航空航天局(NASA)的一艘宇宙飞船上塞满了本周抓取的小行星碎石，以至于它被卡住了，珍贵的粒子在太空中漂移。\n科学家宣布这一消息的三天前，名为奥西里斯-雷克斯(Osiris-Rex)的航天器短暂接触了小行星本努(Bennu)，这是NASA首次尝试这样的任务。\n该任务的首席科学家、亚利桑那大学的但丁·劳雷塔(Dante Lauretta)表示，周二的行动在2亿英里外收集到的物质远远超过返回地球的预期-数百克。机器人手臂末端的样品容器深入到小行星内部，然而，力量如此之大，以至于岩石被吸入，并楔入盖子的边缘。\n科学家估计，采样器在崎岖、易碎的黑色地形中挤压了多达19英寸(48厘米)。\n劳蕾塔在匆忙安排的新闻发布会上说：“我们几乎成了自己成功的牺牲品。”\nLauretta说，飞行管制员除了尽快将样本送回他们的返回舱外，在清除障碍物和防止更多Bennu碎片逃逸方面无能为力。\n因此，飞行团队正在争先恐后地将样本容器最早在周二放入太空舱-比最初计划的要早得多-以便进行长途回家之旅。\n“时间至关重要，”美国国家航空航天局(NASA)科学任务负责人托马斯·祖尔布钦(Thomas Zurbuchen)说。\n这是美国国家航空航天局的第一次小行星样品回收任务。之所以选择本努，是因为它的富含碳的材料被认为保存着我们太阳系保存下来的积木。从这个宇宙时间胶囊中获取碎片可以帮助科学家更好地了解数十亿年前行星是如何形成的，以及地球上的生命是如何起源的。\n周四，当科学家们看到来自奥西里斯-雷克斯的照片时，他们感到震惊-然后又感到沮丧-两天前，奥西里斯-雷克斯在本努进行了一次极其成功的碰触和出发。\n当飞船背离本努时，可以看到一团小行星粒子在飞船周围盘旋。根据Lauretta的说法，一旦机械臂被锁定在适当的位置，情况似乎就稳定了。但不可能确切知道已经损失了多少。\n这项耗资8亿多美元的任务要求带回至少2盎司(60克)。\n不管船上有什么，奥西里斯-雷克斯仍然会在3月份离开小行星附近-考虑到地球和本努的相对位置，这是可能最早的离开。这些样本要到2023年才能返回，也就是宇宙飞船从卡纳维拉尔角发射离开七年后。\n奥西里斯-雷克斯将继续漂离本努，不会再绕其轨道运行，因为它正在等待预定的起飞。\n由于事件的突如其来的转折，科学家们在样品舱返回地球之前不知道它能容纳多少容量。他们最初计划旋转宇宙飞船以测量内容物，但由于可能会泄漏更多碎片，这一操作被取消。\n劳蕾塔告诉记者：“我想我们得等到回家后才能确切知道我们有多少钱。”“正如你可以想象的那样，这很难。..。但好消息是我们看到了很多材料。“\n与此同时，日本正在等待从另一颗小行星上提取的第二批样本，该样本将于12月公布。\n美联社卫生与科学部得到霍华德·休斯医学院科学教育部的支持。美联社单独负责所有内容。", "note_en": "CAPE CANAVERAL, Fla. (AP) — A NASA spacecraft is stuffed with so much asteroid rubble from this week’s grab that it’s jammed open and precious particles are drifting away in space, scientists said Friday.\n Scientists announced the news three days after the spacecraft named Osiris-Rex briefly touched asteroid Bennu, NASA’s first attempt at such a mission.\n The mission’s lead scientist, Dante Lauretta of the University of Arizona, said Tuesday’s operation 200 million miles away collected far more material than expected for return to Earth — in the hundreds of grams. The sample container on the end of the robot arm penetrated so deeply into the asteroid and with such force, however, that rocks got sucked in and became wedged around the rim of the lid.\n  Scientists estimate the sampler pressed as much as 19 inches (48 centimeters) into the rough, crumbly, black terrain.\n “We’re almost a victim of our own success here,” Lauretta said at a hastily arranged news conference.\n Lauretta said there is nothing flight controllers can do to clear the obstructions and prevent more bits of Bennu from escaping, other than to get the samples into their return capsule as soon as possible.\n So, the flight team was scrambling to put the sample container into the capsule as early as Tuesday — much sooner than originally planned — for the long trip home.\n  “Time is of the essence,” said Thomas Zurbuchen, chief of NASA’s science missions.\n This is NASA’s first asteroid sample-return mission. Bennu was chosen because its carbon-rich material is believed to hold the preserved building blocks of our solar system. Getting pieces from this cosmic time capsule could help scientists better understand how the planets formed billions of years ago and how life originated on Earth.\n Scientists were stunned — and then dismayed — on Thursday when they saw the pictures coming from Osiris-Rex following its wildly successful touch-and-go at Bennu two days earlier.\n A cloud of asteroid particles could be seen swirling around the spacecraft as it backed away from Bennu. The situation appeared to stabilize, according to Lauretta, once the robot arm was locked into place. But it was impossible to know exactly how much had already been lost.\n The requirement for the $800 million-plus mission was to bring back a minimum 2 ounces (60 grams).\n Regardless of what’s on board, Osiris-Rex will still leave the vicinity of the asteroid in March — that’s the earliest possible departure given the relative locations of Earth and Bennu. The samples won’t make it back until 2023, seven years after the spacecraft rocketed away from Cape Canaveral.\n  Osiris-Rex will keep drifting away from Bennu and will not orbit it again, as it waits for its scheduled departure.\n Because of the sudden turn of events, scientists won’t know how much the sample capsule holds until it’s back on Earth. They initially planned to spin the spacecraft to measure the contents, but that maneuver was canceled since it could spill even more debris.\n “I think we’re going to have to wait until we get home to know precisely how much we have,” Lauretta told reporters. “As you can imagine, that’s hard. ... But the good news is we see a lot of material.”\n Japan, meanwhile, is awaiting its second batch of samples taken from a different asteroid, due back in December.\n  The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "posttime": "2020-10-27 20:30:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,samples,科学家", "title": "从被堵塞的NASA航天器中逃脱的小行星样本", "title_en": "Asteroid samples escaping from jammed NASA spacecraft", "transed": 1, "url": "https://apnews.com/article/us-news-asteroids-ea18a03d0b19227403a5b1677021d3fa", "via": "", "real_tags": ["nasa", "samples", "科学家"]}, {"category": "", "categoryclass": "", "imagename": "aa8e079473d7041dbd120dc8aa9a2912.jpg", "infoid": 1031459, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最好的YC初创公司找到初创公司的工作，并在初创公司Y Combinator的工作中与创始人联系。", "note_en": "Find startup jobs at the best YC startups and connect with founders on Y Combinator's Work at a Startup.", "posttime": "2020-10-27 20:30:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "运营,yc,初创", "title": "YC运营workatastartup.com，帮助您在500多家YC初创公司找到下一份工作", "title_en": "YC runs workatastartup.com to help you find you next job at over 500 YC startups", "transed": 1, "url": "https://www.workatastartup.com", "via": "", "real_tags": ["运营", "yc", "初创"]}, {"category": "", "categoryclass": "", "imagename": "cdc925ee9459cfcf24ddf30a5e57d943.jpg", "infoid": 1031456, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Astro&#39；的游戏室，每个PlayStation5都包括在内，显然是为该系统设计的一个展示窗口。这款游戏带玩家进行一场梦幻般的平台冒险，通过想象中的系统内部版本，以及通过25年以上的PlayStation历史本身。\n更重要的是，这款游戏是PlayStation5新的DualSense控制器的完美展示，以及它相对于之前的DualShock控制器拥有的专有特权。但是，尽管索尼近几个月来大肆宣扬DualSense的微调触觉反馈和自适应触发器，但该公司对该控制器最具微妙影响力的功能之一--内置扬声器--基本上保持沉默。\n当我们收到PlayStation5硬件时，索尼显然想让我们注意到这个扬声器；我们在电子邮件和视频会议上都被告知，在第一次测试Astro&#39；的Playroom时，不要戴耳机。这在一开始是令人困惑的，因为游戏的教程甚至没有提到内置扬声器，而通过控制器的许多功能运行。但这并不需要很长时间就能听到它的作用，而且根据最近的游戏机历史，它比你可能预期的要好得多。\n任天堂在2006年率先在Wii遥控器上试验了基于控制器的扬声器。在不厌其烦地使用它的游戏中，遥控器的低保真度低保真扬声器发出的啁啾和尖叫声听起来既嘎嘎又令人厌恶。PlayStation4在2013年使用了类似的基于控制器的扬声器，但除了几次值得注意(如果是噱头)的尝试外，开发人员同样忽略了那个质量较低的扬声器。\n今天，索尼显然已经投资了一款高保真扬声器和一种无线连接，可以处理从控制台发送的高质量样本。但这只是故事的一半。Astro&#39；的游戏室不会使用扬声器向玩家大声喊叫，以引起玩家的注意或播放音频记录。取而代之的是，它的噪音与屏幕上的动作和控制器传达的隆隆感觉完美地同步。\n例如，当Astro在沙子上奔跑时，每个足迹都会像声音和振动一样轻轻地拖着脚步穿过控制器。走在玻璃上，脚步声轻拍-轻敲-轻敲，控制器的轻微震动和手中叮当作响的声音效果都在你手中。当Astro被风吹袭时，全控制器的隆隆声就会被微风吹来。虽然几分钟后Astro滑过冰面时控制器的隆隆声非常相似，但溜冰鞋横穿溜冰场的声音却创造了完全不同的感觉。\n在游戏稍后的冷却泉区，当你穿上机器人蛙衣时，你必须用扳机(在这一部分提供强大的弹性阻力)来压缩泳衣的弹簧腿，同时通过倾斜控制器来调整你的跳跃目标。在这里，控制器旋转和弹簧挤压的每一度都有咔哒的音效，与你手中的咔嗒的振动完美匹配。\n就纯粹的隆隆声精度而言，DualSense的触觉反馈让我们想起了任天堂Switch Joy-Cons大力推广的HD Rumble功能。这并不令人惊讶，因为这两款控制器都使用了Immersion公司提供的技术。DualSense增加的表面积可能会在隆隆声强度和表观位置的轻微梯度上提供更高的精确度，但这是一个细微的差异。\n正是DualSense扬声器的微妙音效设计，让索尼在纯粹的操控器因素上超越了任天堂。将不同级别的控制器振动与微妙的音效相匹配，可以有效地使您从控制器获得的各种有效感觉倍增。一旦你感觉到并听到了它的实际作用，你就会奇怪为什么在1997年推出任天堂的Rumble Pak之后，游戏机制造商花了这么长时间才发展到这种有效的通感水平。\n当然，问题在于，索尼已经通过其Tempest引擎(我们目前还没有对其进行测试)将这一功能放到了一个强调3D音频设计的平台上。DualSense的扬声器会符合这一愿景吗？或者玩家必须在两者之间做出选择？\n其他开发人员会为协调控制器效果和屏幕操作所需的仔细的声音设计而烦恼吗？很容易想象第一方索尼的票价会从双重听觉-隆隆潜力中获利(我们只能想象这将对Gran Turismo等游戏产生多大影响)，而第三方基本上忽略了跨平台游戏的这一功能。\n不过，就目前而言，Astro的游戏室给人的第一印象是地狱般的，这款控制器充满了令人愉悦的惊喜，超出了我们对现在标准的双杆设计的期望。在这里，我们希望有更多类似的游戏能最大限度地利用控制器的许多独特功能。", "note_en": "Astro&#39;s Playroom, included with every PlayStation 5, is clearly designed as a showcase of sorts for the system. The game takes players on a fantastical platforming adventure through an imagined version of the system&#39;s innards, and through 25+ years of PlayStation history itself.\n More than that, though, the game is the perfect showcase for the PlayStation 5&#39;s new DualSense controller, and the proprietary perks it has over previous DualShock controllers. But while Sony has  hyped up the DualSense&#39;s fine-tuned haptic feedback and adaptive force triggers in recent months, the company has been largely silent on one of the controller&#39;s most subtly impactful features: the built-in speaker.\n  Sony clearly wanted us to notice this speaker when we received our PlayStation 5 hardware; we were told, both in email and over a video-call briefing, not to wear headphones when testing  Astro&#39;s Playroom for the first time. This was confusing at first, since the game&#39;s tutorial doesn&#39;t even mention the built-in speaker while running through the controller&#39;s many features. But it doesn&#39;t take long to hear the thing in action, and it&#39;s much better than you might expect based on recent console history.\n Nintendo was the first to experiment with controller-based speakers in 2006 with the Wii Remote. In games that bothered using it, the resulting chirps and squawks sounded crackly and obnoxious on the Remote&#39;s podunk, low-fidelity speakers. The PlayStation 4 utilized a similar controller-based speaker in 2013, but that low-quality speaker was similarly ignored by developers, save for  a few notable (if gimmicky) attempts.\n Today, Sony has clearly invested in a higher-fidelity speaker and in a wireless connection that can handle the high-quality samples sent from the console. But that&#39;s only half of the story.  Astro&#39;s Playroom doesn&#39;t use the speaker to squawk at players for attention or play audio logs. Instead, its noises sync up perfectly with the action on-screen and the rumbling sensations the controller is conveying.\n When Astro runs over sand, for instance, each footstep softly shuffles through the controller as both sound and vibration. Walk on glass, and the footsteps tap-tap-tap with both light shakes of the controller and tinkling sound effect in your hands. When Astro gets blasted with wind, the full-controller rumble is met by the sound of a breeze. And though the controller rumbling is very similar when Astro slides across the ice a few minutes later, the &#34;skkkkt&#34; sound of skates cutting across the rink creates a completely different sensation.\n    Later in the game&#39;s Cooling Springs area, when you put on a robotic frog suit, you have to compress the suit&#39;s spring-loaded legs with the triggers (which offer a strong, springy resistance in this section) while adjusting your jumping aim by tilting the controller. Here, each degree of controller rotation and spring squeezing is met by a clicky sound effect, perfectly matching the clicky vibration in your hands.\n  In terms of sheer rumbling precision, the DualSense&#39;s haptic feedback reminds us of  the heavily promoted &#34;HD Rumble&#34; feature on the Nintendo Switch Joy-Cons. That&#39;s not that surprising, since  both  controllers make use of tech provided by Immersion Corp. The DualSense&#39;s increased surface area perhaps provides for a little more precision in the slight gradations of rumble strength and apparent location, but it&#39;s a subtle difference.\n It&#39;s the subtle sound design of the DualSense&#39;s speaker that lets Sony blast past Nintendo in terms of sheer controller &#34;wow&#34; factor. Matching different levels of controller vibration with subtle sound effects effectively multiplies the kinds of effective sensations you get from the controller. Once you feel and hear it in action, you&#39;ll wonder why it has taken so long for console-makers to advance to this effective level of synesthesia, over 20 years after  the 1997 launch of Nintendo&#39;s Rumble Pak.\n The catch, of course, is that Sony has put this feature into a platform with  an emphasis on 3D audio design via its Tempest Engine (which we aren&#39;t testing just yet). Will DualSense&#39;s speaker fit into this vision? Or will players have to pick between one or the other?\n And will other developers bother with the careful sound design needed to coordinate controller effects with on-screen action? It&#39;s easy to imagine first-party Sony fare cashing in on the dual aural-rumble potential (we can only imagine the impact this would have on the likes of  Gran Turismo) while third parties largely ignore the feature for cross-platform titles.\n For now, though,  Astro&#39;s Playroom makes a hell of a first impression for a controller that&#39;s full of pleasant surprises above and beyond what we&#39;ve come to expect from the now-standard dual-stick design. Here&#39;s hoping more games similarly make the most of the controller&#39;s many unique features.", "posttime": "2020-10-27 20:08:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "体验,ps5,控制器", "title": "亲身体验PS5的通感双感控制器", "title_en": "Hands-on with the PS5’s synesthetic DualSense controller", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/hands-on-with-the-ps5s-synesthetic-dualsense-controller/", "via": "", "real_tags": ["体验", "ps5", "控制器"]}, {"category": "", "categoryclass": "", "imagename": "25667f828bc699a524918dc0ffda02b2.jpg", "infoid": 1031455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能已经听说了，在11月12日正式发布之前，我们已经在Ars轨道总部收到了PlayStation5。在发布日期变得更近之前，我们对该系统本身所能提供的信息仍然有限。不过，有一件事我们可以谈论，那就是游戏机的设计--也就是容纳所有这些电子产品的物理外壳。\nPS5最引人注目的地方(尤其是我们收到的光驱运动版)仍然是它有多大。当然，我们早就知道PS5将成为几十年来最大的游戏机。但在智力上了解这一点是一回事。在你家里看到它是另一回事，几乎让你曾经拥有过的任何其他消费电子产品都相形见绌(正如你在一些照片中看到的那样)。\n不过，当你拿起PS5时，考虑到它的物理尺寸，它感觉比你想象的要轻一点。例如，它重9.92磅，比(更小的)发射时代的PlayStation3稍微轻一些。虽然PS5比7.3磅的PS4 Pro更重，但抬起时感觉比之前的系统密度要小得多。\n这可能是因为PS5的外观尺寸有很大一部分被空白处占据了。PS5起伏的白色外板之间有很大的空间，只有空气占据了这些空间，特别是在核心黑色外壳的圆角周围(我们已经看到，当系统被索尼的工程师拆卸时，这个空间是如何发挥的)。光滑的白色镶板和闪亮的黑色内壳之间的鲜明对比也可以欺骗眼睛，使系统看起来比类似尺寸的简单硬角盒子更时髦一些。\n在视觉上，这让PS5切割了一个引人注目的数字，根据视觉接近的角度变化很大。系统通常是对称的，但不是沿着系统水平坐着时所期望的左右轴。这是一种打破常规的方式，作为房间的焦点，它为系统增加了视觉冲击力和趣味性。\n对于它的价值，你可以平衡PS5垂直的侧面刚刚好，而不是安装包括塑料支架。由于光盘驱动器靠近地面，在这种配置下，系统甚至可以进行一点推挤而不会倾倒。\n尽管如此，展台在不增加太多系统物理足迹的情况下增加了很好的稳定性。垂直支架也相对容易，只需一颗螺丝就可以在几秒钟内安装好--即使你找不到螺丝刀，用指甲或硬币也能将其固定到位。\n然而，当水平放置时，PS5波浪形的白色外壳意味着系统懒洋洋地向一边倾斜，没有稳定的支架。要解决这个问题，您可以将相同的垂直支架挂钩到底部外面板边缘的预先标记位置上，为系统提供一个良好的平坦底座以供其保持平衡(同时让一侧戏谑地漂浮在地面上，就像系统正在对抗重力一样)。\n这个效果很好，但与垂直方向相比感觉有点脆弱。支架与外壳挂钩，抓地力较弱，缺乏你可能会期待的如此重要的附件所需的牢靠的卡扣。如果没有螺钉将其牢牢固定到位，在移动或旋转系统时支架可能相对容易松动。\n如果你像大多数人一样，倾向于把PS5放在你的娱乐中心，然后把它放在同一个地方好几年，那么这可能不是问题。但是，如果你计划移动系统或大量改变它的方向，展台可能很快就会成为一个烦人的地方。(Ars Tech Culture编辑Sam Machkovech痛苦地认识到了这一点，因为他已经弄丢了螺丝钉，这颗螺丝钉在他拖着螺丝钉为这篇文章拍照时，不经意间从展台的储物槽里弹了出来。希望索尼能为可怜的山姆制定一个替代计划。)。\n我们将单独讨论使用PS5的DualSense控制器的感觉。然而，从视觉的角度来看，控制器与PlayStation过去纯灰和黑色的配色方案有戏剧性的不同。双色调设计与系统本身非常匹配，尽管控制器比以前的PlayStation控制器稍大，但它的外形看起来很苗条。\n脸部按钮增强了视觉效果，现在透明外壳下贴上了暗灰色的标签，缺少索尼自1994年以来一直用于PlayStation按钮的四色编码。这一改变可以让控制器的脸从正面形成更平滑的印象，尽管这也可能会让新手在没有颜色帮助的情况下更难记住按钮的位置。(这是一种改变，可以让控制器的脸从正面形成更平滑的印象，尽管这也可能会让新手在没有颜色的帮助下更难记住按钮的位置)。\nPS5高清摄像头、Pulse 3D音频耳机和控制器充电站都在很大程度上偏向于曲线起伏的黑白塑料的相同美学。总而言之，它形成了PS5强大的视觉品牌，与之前的截然不同。这是一种未来主义的外观，可能会与本世纪20年代联系在一起，就像木质镶板电子产品已经成为20世纪70年代的定义一样。\n在未来的日子里，我们将更多地谈论PlayStation5如何作为一种游戏设备。不过，就目前而言，该系统是一款引人注目的视觉设计，在任何可以容纳它的娱乐中心都能脱颖而出。", "note_en": "As  you may have heard by now, we have received the PlayStation 5 at Ars&#39; orbiting headquarters, ahead of  its official launch on Nov. 12. We&#39;re still limited in just what we can tell you about the system itself until that launch gets a little closer. One thing we can talk about, though, is the console&#39;s design—that is, the physical shell that houses all those electronics.\n  The most striking thing about the PS5 case (especially the disc-drive-sporting version we received) remains just how big it is.  We&#39;ve known for a while that the PS5 was set to be the biggest console in decades, of course. But it&#39;s one thing to know that intellectually. It&#39;s another to see it in your home, dwarfing most any other piece of consumer electronics you&#39;ve ever owned (as you can see in some of these photos).\n    When you lift the PS5, though, it feels a little lighter than you might expect, given its physical size. At 9.92 pounds, it&#39;s slightly less heavy than the (smaller) launch-era PlayStation 3, for instance. And while the PS5 is heavier than the 7.3 pound PS4 Pro comes, it feels much less dense than that earlier system when lifted.\n That might be because a lot of the PS5&#39;s apparent size is taken up by empty space. There&#39;s a lot of room in between the PS5&#39;s undulating white exterior panels that&#39;s taken up by nothing but air, especially around the rounded corners of the core black casing (and we&#39;ve seen just how that space plays out  when the system is taken apart by Sony engineers). The stark contrast between the smooth white paneling and the shiny black interior casing can trick the eye, too, making the system seem a bit sleeker than a simple hard-cornered box with similar dimensions.\n Visually, this lets the PS5 cut a striking figure that changes heavily depending on the angle of visual approach. The system is generally symmetrical, but not along the left-right axis that you&#39;d expect when the system is sitting horizontally. It&#39;s the kind of norm-breaking that adds visual impact and interest to the system as a focal point of the room.\n     For what it&#39;s worth, you can balance the PS5 vertically on its side just fine without installing the included plastic stand. With the disc drive near the floor, the system can even take a bit of jostling without tipping over in this configuration.\n Still, the stand adds a good deal of stability without adding too much to the system&#39;s physical footprint. The vertical stand is also relatively easy to install in a few seconds with a single screw—a fingernail or a coin will do to secure this in place even if you can&#39;t find a screwdriver.\n When sat horizontally, though, the PS5&#39;s wavy white shell means the system leans lazily to the side without a stabilizing stand. To fix this, you hook the same vertical stand into place onto a pre-marked location on the edge of the bottom outer panel, providing a nice, flat base for the system to balance on (while letting one side float teasingly above the ground, like the system is defying gravity).\n This works well enough, but it feels a little flimsy compared to the vertical orientation. The stand hooks to the outer shell with something of a weak grip, lacking the secure &#34;snap&#34; you might expect for such an important attachment. Without a screw to hold it securely in place, the stand can come loose relatively easily while shifting or rotating the system.\n This probably won&#39;t be an issue if, like most people, you tend to put the PS5 down in your entertainment center and leave it in the same place for years at a time. But if you plan on moving the system around or changing its orientation a lot, the stand could quickly become an annoyance. (Ars Tech Culture Editor Sam Machkovech learned this the hard way, as he has already lost the screw that inadvertently popped out of its storage slot in the stand while he shuffled it around to take photos for this very article. Hopefully Sony has a replacement plan for poor Sam.)\n     We talk about the feeling of using the PS5&#39;s DualSense controller in a separate piece. From a visual standpoint, though, the controller is a dramatic departure from the solid grey and black color schemes of PlayStation&#39;s past. The two-tone design matches well with the system itself, cutting a striking figure that seems slim, even though the controller is a tad bigger than previous PlayStation controllers.\n The visual effect is heightened by the face buttons, now labeled with a dull grey under transparent casing, lacking the four-color coding Sony has used for PlayStation buttons since 1994. It&#39;s a change that lets the controller&#39;s face form a smoother impression from the front, though it&#39;s also a change that may make it harder for newcomers to learn the positions of the buttons without the aid of color.\n    The PS5 HD camera, Pulse 3D Audio headset, and controller charging station all lean heavily into that same aesthetic of black and white plastic with undulating curves. Together, it forms a strong visual branding for the PS5 as a stark departure from what&#39;s come before. It&#39;s a futuristic look that could come to be associated with the 2020s the same way wood-paneled electronics have come to define the 1970s.\n We&#39;ll have more to say about how the PlayStation 5 as a game-playing device in the days to come. For now, though, the system serves as a striking piece of visual design that stands out in any entertainment center that it can fit in.", "posttime": "2020-10-27 20:07:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "拆箱,unboxing,系统", "title": "PS5拆箱：索尼的大个子，曲线优美的男孩在任何房间里都很突出", "title_en": "PS5 unboxing: Sony’s big, curvy boy stands out in any room", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/ps5-unboxing-sonys-big-curvy-boy-stands-out-in-any-room/", "via": "", "real_tags": ["拆箱", "unboxing", "系统"]}]