[{"category": "", "categoryclass": "", "imagename": "e387c96e81e9e126ae109f53999169ba.jpg", "infoid": 1001566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在19世纪50年代，墓地里挤满的人并不都死了。在炎热的夏天，纽约人成群结队地来到布鲁克林庞大的绿林公墓，以便呼吸和活动。这座城市的人口在五十年内增长了五倍，人们需要一个地方来逃离他们的小房子。\n尽管受到驱散的警告，人们仍继续在陵墓之间野餐。但市政府官员没有惩罚去墓地的人，而是采取了不同的方式。为了满足需求，他们在几个街区外建了一个公园。这将成为该市历史上最有效的公共卫生措施之一。\n在过去的150年里，展望公园在布鲁克林的中心占据了500多英亩的土地。就在周边延伸着一条宽阔的道路，禁止车辆通行，将自行车和行人一分为二。方圆三英里多。在美国最大、最密集的城市中心，你可以在树木的包围下，想跑多远就跑多远，而不需要穿过一条街道，也不会看到一辆车。\n这个循环我已经运行了至少一千次了。我在一天中的任何时间和一年中的任何时间都在运行它。我在冻雨和酷热中跑步。总会有人的。它总是感觉像是一种逃避。但现在，有史以来第一次，这种感觉消失了。\n不同的是警察。他们每几百码就在车里闲逛，以强制社交距离，并有权对与他人距离太近的跑步者处以罚款和逮捕。逮捕大多发生在其他更贫穷的公园和社区-一些已经变得暴力。本周，一名警察在布鲁克林门廊上驱散一群人时，一拳打在一名男子的脸上。在附近，警方强行逮捕了三名黑人男子，据称其中一人昏迷。周五，纽约市市长白思豪(Bill De Blasio)没有改变路线，而是宣布他将部署警察，进一步限制通往户外的通道-包括哈德逊河(Hudson River)两旁的公共空间狭长地带。理由是我们没有足够的空间让每个人外出或逗留很长时间。\n但我们确实有地方。横跨整个曼哈顿的宽阔大道在寂静中回荡。纽约市有6000多英里的街道。在一个典型的夏季周末，当许多人出行时，其中大部分几乎不会被汽车使用。今年夏天，街道肯定只会更加荒芜。而且有可能将它们关闭，不让汽车进入，给人们步行、跑步和骑自行车的空间。特别是在大流行期间，仅仅是保护公共空间就是一项对身心健康的高收益投资。\n像纽约市的许多人一样，我住在一套大约250平方英尺的公寓里。对于我来说，要遵守和郊区麦克豪宅里的人一样的命令要困难得多。我们唯一的避难所是公共空间，在温暖的日子里，这些公共空间通常会挤满人，超出了任何社交距离的能力。当人们被困在家里，那么多其他机构都关闭了-我们的图书馆、博物馆、健身房、游泳池、餐馆-公园已经比往常更拥挤了。甚至绿林公墓也威胁要关闭，因为寻找步行空间的人过于拥挤。这种情况将创造一个病毒式的火药桶，将在炎热的夏季点燃纽约。提出解决方案是限制这些本已珍贵的公共空间的使用，这与解决方案相反。\n需要四处走动是一种基本的生理需求。当我们与世隔绝并被限制在狭小的空间时，我们的健康就像大多数动物一样恶化。即使是那些自认为内向的人，也有一些需要出现在人们面前，即使是安静的。在冠状病毒大流行期间，我们必须以尽可能安全的方式做这些事情。我们可以预期，户外通常会更安全，因为空气可以分散我们适当距离的呼吸。随着健身房关闭，基本的日常体育活动陷入停顿，有意识地进行锻炼比以往任何时候都更加重要-对身体和精神都是如此。\n当然，心脏病、糖尿病和抑郁症并没有不复存在。如果说有什么不同的话，那就是他们应该随着久坐隔离和监禁而恶化-更不用说经济衰退和我们周围失去生命和社区的现实了。\n本月早些时候，该市气喘吁吁地宣布，在周末期间，6000英里的城市街道中只有7条将关闭交通。它的目标是到夏天达到100英里-仅占可用面积的1%。白思豪辩称，该市没有足够的“人员”来开放更多的人行横道，因为每个新的步行十字路口都需要警察的监督。但显然有足够的人员来维持公园的治安。\n取缔公园而不是提供更多空间的决定具有巨大的后果-而且不仅仅是对纽约人来说。这是美国政府默认惩罚性司法而非恢复性司法的一个缩影。我们把人往最坏的方面想。当我们看到人们挤在公园里的照片时，我们会认为他们只是危险、鲁莽的人。我们呼吁惩罚他们。\n在大流行期间，人们不会厚颜无耻地寻找拥挤的公园。就像没有人想睡在地铁车厢里或住在桥下一样，人们都到外面去，因为他们没有其他地方可去。如果可以选择，人们就不会挤在一起了--而这个选择是存在的。\n打开街道。至少打开一半。如果我们没有足够的警力来实施临时交通封锁，那就用混凝土栅栏半永久地打开它们。永久开放其他街道。炸掉沥青，给土地铺上草皮，种树种花，不要回头。\n病毒将伴随我们很长一段时间，而且会有更多的病毒出现。我们需要做好准备。打开街道。机不可失，时不再来。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n医学博士，是“大西洋月刊”的特约撰稿人。他也是耶鲁大学公共卫生学院的讲师，也是即将出版的“清洁”一书的作者。", "note_en": "In the 1850s, the people filling the cemetery were not all dead. Throughout the hot days of summer, New Yorkers flocked to Brooklyn’s sprawling  Green-Wood Cemetery in order to breathe and move. The city’s population had increased  fivefold in five decades, and people needed a place to escape from their tiny homes.\n   Despite warnings to disperse, people continued picnicking among the mausoleums. But instead of punishing the cemetery-goers, city officials took a different approach. To accommodate the demand, they  built a park a few blocks away. It would come to be one of the most effective  public-health measures in the city’s history.\n For the past  150 years, Prospect Park has occupied more than 500 acres in the heart of Brooklyn. Just within the perimeter stretches a wide road that’s closed to traffic, divided in half for bikes and pedestrians. It’s more than three miles around. In the center of America’s largest and densest city, you can run as far as you like, surrounded by trees, without crossing a single street or seeing a single car.\n I’ve run the loop at least a thousand times. I’ve run it at all hours of the day and times of the year. I’ve run in freezing rain and torrid heat. There are always people. It’s always felt like an escape. But now, for the first time ever, that feeling is gone.\n    The difference is the police. They idle in cars every few hundred yards to enforce social distancing, empowered to fine and arrest runners for getting too close to others. The arrests happen mostly in other, poorer parks and neighborhoods—and some have gotten violent. This week, while breaking up a group on a stoop in Brooklyn, a police officer  punched a man in the face. Nearby, police forcibly arrested three black men in an encounter that allegedly left one  unconscious. Instead of changing course, on Friday New York City Mayor Bill de Blasio  announced that he would deploy police to further limit access to the outdoors—including the strips of public space that line the Hudson River. The justification is that we don’t have enough space for everyone to be out, or to linger long.\n  But we do have the space. The vast avenues that span the length of Manhattan are echoing in silence. New York City is home to more than  6,000 miles of streets. Much of that is barely used by cars on a typical summer weekend, when many people travel. The streets will surely be only more barren this summer. And  it is possible to close them to cars and give people room to walk, run, and bike. Especially during a pandemic, simply preserving public space is a profoundly high-yield investment in physical and mental health.\n   Like many others in New York City, I live in an apartment that’s about 250 square feet. It’s a lot harder for me to abide by the same orders as people in sprawling suburban McMansions. Our sole escape is the public spaces that typically fill beyond any ability to socially distance on warm days. When people are stuck at home, and so many other establishments are closed—our libraries, museums, gyms, pools, restaurants—the parks are already more crowded than usual. Even the Green-Wood Cemetery has  threatened to close because of overcrowding by people in search of spaces to walk. The situation stands to create a viral tinderbox that will ignite New York in the heat of the summer. To propose that the solution is to limit the use of these already precious public spaces is the inverse of a solution.\n The need to move around is a basic physiologic imperative. Our health  deteriorates just like that of most animals when isolated and confined to tiny spaces. Even those who identify as introverts have  some need to be in the presence of people, if quietly. During the coronavirus pandemic, we must do these things in the safest possible ways. We can expect to be generally safer outdoors, where air disperses our properly distanced breath. With gyms closed and basic daily physical activity ground to a halt, deliberately undertaking exercise is more important than ever—for the body and mind.\n  Of course, heart disease, diabetes, and depression have not ceased to exist. If anything, they should be expected to worsen with sedentary isolation and confinement—not to mention economic depression and the realities of the loss of life and community all around us.\n    Earlier this month, the  city breathlessly announced that during the weekend it will close to traffic just seven of the 6,000 miles of city streets. It aims to get up to 100 miles by summer—barely 1 percent of the area available. De Blasio has argued that the city doesn’t have enough “ personnel”to open more, as each newly pedestrian intersection would require police supervision. But apparently there is enough personnel to police the parks.\n The decision to crack down on parks rather than make more space available is of tremendous consequence—and not just to New Yorkers. It is a microcosm of America’s  default to punitive rather than restorative justice. We assume the worst in people. When we see photos of people crowded into a park, we assume they are simply dangerous, reckless people. We call to punish them.\n  People are not brazenly seeking out crowded parks during a pandemic. Just as no one wants to sleep in a subway car or live under a bridge, people are going outside because they have no other place to go. If given the option, people would not be crowded together—and that option exists.\n Open the streets. Open at least half of them. If we do not have enough police to enforce temporary closure to traffic, then open them semipermanently with concrete barriers. Open other streets  permanently. Dynamite the asphalt, sod the land, plant trees and flowers, and do not look back.\n The virus is going to be with us for a long time, and more viruses will come. We need to be prepared. Open the streets. Do it now.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n            , M.D., is a staff writer at  The Atlantic. He is also a lecturer at Yale School of Public Health and author of the forthcoming book   Clean.", "posttime": "2020-05-11 03:36:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "关闭,close", "title": "别关闭公园。打通街道", "title_en": "Don’t Close Parks. Open Up Streets", "transed": 1, "url": "https://www.theatlantic.com/health/archive/2020/05/open-the-streets/611470/", "via": "", "real_tags": ["关闭", "close"]}, {"category": "", "categoryclass": "", "imagename": "39ddde4c274d251badf844f3a2b613c2.png", "infoid": 1001565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有压倒性的考古学和遗传学证据表明，现代语音设备是在60万年前被人类获得的1。另一方面，象征现代想象力的人工制品，如(1)组合比喻艺术，(2)带眼的骨针，(3)住宅的建造，以及(4)精心制作的墓葬，都出现在不早于7万年前。(1)为什么现代语音设备的获得与现代想象力的获得有很大差距，(2)是什么触发了现代想象力的获得，7万年前就出现了。(2)是什么触发了现代想象力的获得，7万年前就出现了。(2)是什么触发了现代想象力的获得，7万年前就出现了。(2)是什么触发了现代想象力的获得。我们对现代想象力进化起源的研究一直受到对想象力某一特定组成部分发展的时间限制的观察的推动。现代儿童在童年早期没有接触过递归语言，永远不会获得被称为前额叶合成(PFS)的积极的建设性想象力。与词汇和语法习得不同的是，词汇和语法习得可以在人的一生中学习，而PFS的发展有一个很强的关键期，没有在童年早期接触过递归语言的人在成年后永远不会获得PFS。他们的语言总是缺乏对空间介词和递归的理解，而空间介词和递归依赖于PFS能力。以类似的方式，早期的原始人成年后不能学习递归语言，因此也不能教给他们的孩子递归语言。因此，PFS习得的强关键期的存在为行为现代性创造了进化障碍。一个进化的数学模型表明，三个事件的协同作用(1)基因突变通过同时减缓两个或更多儿童的前额叶皮质发育来延长临界期，(2)这些儿童发明了递归语言元素，如空间介词，以及(3)他们使用这些递归元素进行对话交流，导致他们父母的非递归交流系统同时转换为递归语言，并在大约7万年前获得了PFS。(2)这些儿童发明了递归语言元素，如空间介词，以及(3)他们使用这些递归元素进行对话交流，导致他们父母的非递归交流系统同时转换为递归语言，并获得了大约7万年前的PFS。\n韦尼克区和布罗卡区与语言的联系是众所周知的。不太常见的是，人们意识到理解完整的递归语言依赖于外侧前额叶皮质(LPFC)。Wernicke区主要连接单词和宾语3，Broca区解释语法并将句子中的单词分配到一个语法组，如名词、动词或介词3，但只有LPFC才能根据句子的描述4、5将记忆中的对象组合成一个新的心理意象。后者的功能通常被称为想象。然而，术语“想象力”是模棱两可的，因为它经常被用来描述任何内部产生的经验。例如，做梦通常被描述为一种想象的体验。然而，做梦有一个完全不同的神经机制，因为做梦不受LPFC 6-8的控制。LPFC在睡眠6、8期间是不活跃的，LPFC受损的患者不会注意到梦中的变化7。为了区分做梦时的想象和有意识的、有目的的、主动的、由LPFC驱动的新奇心理意象的合成，我们将后者定义为前额叶合成(PFS)。PFS完全依赖于完整的LPFC 11-16，LPFC受损的患者通常会失去PFS功能，证实了这两种类型的想象体验之间的神经分离。2.PFS完全依赖于完整的LPFC 11-16，LPFC受损的患者经常失去PFS功能，证实了这两种类型的想象经验之间的神经分离。\nLPFC和Broca‘s区受损的患者经常出现特殊的PFS缺陷，这会影响他们的语言和想象力。华金·福斯特(Joaquin Fuster)称他们在语言上的改变是“前额失语症”15，并解释说，“虽然单词和句子的发音保持不变，但语言是贫乏的，‘命题’能力明显减弱。”减少了句子的长度和复杂度。缺乏独立从句，更广泛地说，没有充分利用乔姆斯基所描述的语言递归的潜力15。亚历山大·卢里亚称这种情况为“额前动态性失语症”17，并报告说，只要对话不涉及宾语组合，这些患者就看起来不起眼。他们不会丢失他们的词汇量，并且可以让对话继续下去：“…。这类病变的患者发音没有困难。他们还能够保持听到和理解大多数口语的能力。他们使用数字符号和许多不同类型的抽象概念的能力也保持不变…。这些患者很容易理解“因果关系”、“发展”或“合作”等复杂概念的含义。他们还能够进行抽象的对话。…。他们可以重复和理解简单的句子\n在成年学习一门新语言的过程中，PFS和MERGE之间的区别也可以突出出来：当一个人学习德语、西班牙语或意大利语时，他会学习新的单词(韦尼克区)和新的语法规则(布罗卡区)，然而，PFS没有丝毫变化。同样的PFS能力也可以用来理解德语、西班牙语或意大利语句子。换句话说，尽管词汇和语法规则不同，PFS在所有现代人类语言中都是通用的。\n所有人类语言都允许使用有限数量的词(在这里和以后，词被理解为意义单位，被语言学家称为义位)来高保真地传输无限数量的新奇图像。使用有限数量的单词来传达无限数量的图像的魔力完全取决于对话者进行PFS的能力。当我们描述小说形象时(“我的房子在左边第二个，就在教堂对面”)，我们依赖对话者使用PFS来可视化小说形象。当我们讲故事时，我们经常描述对话者从未见过的东西(“那个生物有三个头，两个尾巴，绿色的大眼睛，跑得比猎豹还快”)，我们依靠对话者想象他们脑海中的故事。正如史蒂芬·平克所说，“说话者有一个想法，发出一个声音，依靠听众听到声音并恢复那个想法”22。当一个人试图理解描述对象组合的句子时，PFS能力的重要性得到了最好的认识。想想这两句话：“一只狗咬了我的朋友”和“我的朋友咬了一只狗。”单用单词或语法是不可能区分意义上的差异的，因为这两个句子中的单词和语法结构都是相同的。理解意义上的差异，领会第一句话的不幸和第二句话的幽默，取决于对话者的PFS能力。只有当LPFC在脑海中形成这两个不同的形象之后，我们才能理解这两句话的不同之处。类似地，带有嵌套解释的递归语句(“山后的大树左边的巨石上的一条蛇”)迫使对话者使用PFS将对象(蛇、巨石、树和小山)组合成一个新的场景。出于这个原因，语言学家将现代完整的人类语言称为递归语言。\n递归语言使用有限数量的单词来传达无限数量的新奇图像的能力取决于对话者的PFS能力，空间介词、动词时态、嵌套和其他常见的语法元素也促进了这种能力。例如，考虑空间介词的指数能力来增加可以高保真传送的不同图像的最大数量(图2)。在一种没有空间介词或其他递归成分的语言中，1000个名词可以向听者传达1000个图像。只添加一个空间介词就可以形成三个单词的短语(例如：“杯子后面的碗”或“碗后面的杯子”)，并将可以传达的不同图像的数量从1000增加到100万(图2,1000×1×1000)。添加第二个空间介词并允许形式为宾语-介词-宾语-介词-宾语的五个单词的句子(例如：“碗后的盘子上的杯子”)将可传递的不同图像的数量增加到40亿(1000×2×1000×2×1000)。添加第三个空间介词会将不同图像的数量增加到27万亿(1000×3×1000×3×1000×3×1000)，依此类推。一种有1000个名词和100个空间介词的典型语言理论上可以传达1000^101x100^100个不同的图像。这个数字明显大于宇宙中的原子总数。实际上，一种只需1000个单词和几个介词的递归语言就可以传递无限多不同的图像。\n使用有限数量的单词来传递无限数量的图像的魔力完全取决于PFS能力。缺乏这种能力的人不能根据空间介词所强加的规则构建新颖的心理意象，因此不能理解空间介词的意义。在一种有1000个名词和100个空间介词的语言的理论例子中，PFS残疾人对这1000个名词的理解将受到限制。推广到语言的其他元素，我们得出结论，PFS残疾患者预计会缺乏对任何语言递归元素的理解-Fuster和Luria报告的额前性失语患者15、18的症状。(由于“失语症”在希腊语中的意思是“无言”，而这些患者在语言方面没有问题，我们更愿意将\n..", "note_en": "There is an overwhelming archeological and genetic evidence that modern speech apparatus was acquired by hominins by 600,000 years ago  1. On the other hand, artifacts signifying modern imagination, such as (1) composite figurative arts, (2) bone needles with an eye, (3) construction of dwellings, and (4) elaborate burials arose not earlier than 70,000 years ago  2. It remains unclear (1) why there was a long gap between acquisition of modern speech apparatus and modern imagination, (2) what triggered the acquisition of modern imagination 70,000 years ago, and (3) what role language might have played in this process. Our research into evolutionary origin of modern imagination has been driven by the observation of a temporal limit for the development of a particular component of imagination. Modern children not exposed to recursive language in early childhood never acquire the type of active constructive imagination called Prefrontal Synthesis (PFS). Unlike vocabulary and grammar acquisition, which can be learned throughout one’s lifetime, there is a strong critical period for the development of PFS and individuals not exposed to recursive language in early childhood can never acquire PFS as adults. Their language will always lack understanding of spatial prepositions and recursion that depend on the PFS ability. In a similar manner, early hominins would not have been able to learn recursive language as adults and, therefore, would not be able to teach recursive language to their children. Thus, the existence of a strong critical period for PFS acquisition creates an evolutionary barrier for behavioral modernity. An evolutionary mathematical model suggests that a synergistic confluence of three events (1) a genetic mutation that extended the critical period by slowing down the prefrontal cortex development simultaneously in two or more children, (2) invention of recursive elements of language, such as spatial prepositions, by these children and (3) their dialogic communications using these recursive elements, resulted in concurrent conversion of a non-recursive communication system of their parents to recursive language and acquisition of PFS around 70,000 years ago.\n Association of Wernicke’s and Broca’s areas with language is well-known. Less common is realization that understanding of full recursive language depends on the lateral prefrontal cortex (LPFC). Wernicke’s area primarily links words with objects  3, Broca’s area interprets the grammar and assigns words in a sentence to a grammatical group such as noun, verb, or preposition  3, but only the LPFC can combine objects from memory into a novel mental image according to a sentence’s description  4, 5. The latter function is commonly called imagination. The term “imagination,” however, is ambiguous as it is regularly used to describe any experience that was generated internally. For example, dreaming is often described as an imaginary experience. However, dreaming has a completely different neurological mechanism, as dreaming is not controlled by the LPFC  6– 8. LPFC is inactive during sleep  6, 8 and patients whose LPFC is damaged do not notice change in their dreams  7. In order to distinguish the imagination during dreaming from the conscious purposeful active LPFC-driven synthesis of  novel mental images, we define the latter process as  Prefrontal Synthesis (PFS, a.k.a. mental synthesis)  9, 10. PFS is completely dependent on an intact LPFC  11– 16 and patients with damage to LPFC often lose their PFS function confirming neurological dissociation between the two types of imaginary experience  2.\n Patients with damage to the LPFC and spared Broca’s area often present with a specific PFS deficit, that affects both their language and imagination. Joaquin Fuster calls their alteration in language “prefrontal aphasia”  15 and explains that “although the pronunciation of words and sentences remains intact, language is impoverished and shows an apparent diminution of the capacity to ‘propositionize.’ The length and complexity of sentences are reduced. There is a dearth of dependent clauses and, more generally, an underutilization of what Chomsky characterizes as the potential for recursiveness of language”  15. Alexander Luria calls this condition “frontal dynamic aphasia”  17 and reports that as long as a conversation does not involve combination of objects, these patients look unremarkable. They do not lose their vocabulary and can keep a conversation going: “…patients with this type of lesion have no difficulty articulating words. They are also able to retain their ability to hear and understand most spoken language. Their ability to use numerical symbols and many different kinds of abstract concepts also remains undamaged… these patients had no difficulty grasping the meaning of complex ideas such as ‘causation,’ ‘development,’ or ‘cooperation.’ They were also able to hold abstract conversations. … They can repeat and understand sentences that simply communicate events by creating a sequence of verbal images”  18. Luria further explains that their disability shows only when patients have to imagine several objects or persons in a  novel combination (revealing the problem of PFS): “But difficulties developed when they were presented with complex grammatical constructions which coded logical relations. … Such patients find it almost impossible to understand phrases and words which denote relative position and cannot carry out a simple instruction like ‘draw a triangle above a circle.’ This difficulty goes beyond parts of speech that code spatial relations. Phrases like ‘Sonya is lighter than Natasha’ also prove troublesome for these patients, as do temporal relations like ‘spring is before summer’ [AV: space is commonly used to represent time and therefore PFS disability usually results in inability to understand temporal relationship as well]. …Their particular kind of aphasia becomes apparent only when they have to operate with groups or arrangements of elements. If these patients are asked, ‘Point to the pencil with the key drawn on it’ or ‘Where is my sister’s friend?’ they do not understand what is being said. As one patient put it, ‘I know where there is a sister and a friend, but I don’t know who belongs to whom’”  18. In our research, we have found that simplest relational inquiries can often quickly elucidate PFS disability. Questions, such as “If a cat ate a dog, who is alive?” and “Imagine the  blue cup inside the  yellow cup, which cup is on top? can be consistently answered by four-year-old children but commonly failed by individuals with PFS disability  19.\n Crucially, PFS disability is not just a receptive language disorder, but a deficit in imagination that can be confirmed by nonverbal IQ tests. Individuals with PFS disability may have normal full-scale IQ, but commonly exhibit a selective and catastrophic deficit in tasks relying on PFS, e.g., matrix reasoning tasks requiring integration of multiple objects  12, such as those shown in  Figure 1. Persons with PFS disability invariably fail these integration tasks and, therefore, typically perform below the score of 86 in non-verbal IQ tests  20.\n  A deficit in imagination in otherwise unremarkable individuals is extremely counterintuitive for several reasons. First, most scientists have never met anyone with PFS disability as these individuals do not frequent university campuses and other privileged institutions. Second reason is that PFS was traditionally grouped with the other components of imagination, such as dreaming, spontaneous insight, and integration of modifiers, making it difficult to discuss the exact nature of a patient’s deficit, whose dreaming, spontaneous insight, and integration of modifiers remain normal. Finally, even when we see individuals with PFS disability, we tend to anthropomorphize, assume their normal PFS, and brush off their shortfall as a linguistic problem, memory deficit, or inattentiveness. However, when considered together with nonverbal IQ test, specifically those items that require integration of objects, there can be no mistake: as many as 18% of modern individuals exhibit PFS disability  5. These individuals include some patients with damage to their PFC, low-functioning individuals with congenital neurological problems, as well as individuals with no congenital abnormality, who were not exposed to recursive language in early childhood (see below).\n  PFS is defined neurobiologically as the conscious, purposeful process of synthesizing  novel mental images from two or more objects stored in memory. There is no linguistically defined process that is neurobiologically equivalent to this distinct mechanism of imagination. The closest in spirit is Chomskyan Merge, defined as a process of combining any two syntactic objects to create a new one  21. PFS, however, is different both in scope and underlying neurobiology. An individual does not need to know the names of objects in order to combine them mentally into a novel hybrid object or scene. One can mentally combine objects of strange geometrical shape that do not have names in any language. Merging of objects in mental space does not directly depend on knowledge of any language.\n Even when language is used to direct PFS in the mind of interlocutor, PFS definition is different from Merge. For example, combination of an adjective and a noun is a Merge operation, but does not fall under PFS that must always involve combination of two or more independent objects. Furthermore, PFS, but not Merge, requires creating a  novel mental hybrid object or scene. For example, a sentence ‘ship sinks’ can be understood by  remembering a previously seen picture of a sinking ship and thus, completely avoiding the PFS process. Under Chomskyan theory, ‘ship sinks’, however, is considered a Merge operation since the sentence merges a determiner phrase ‘ship’ and a verb ‘sinks’ to create a sentence ‘ship sinks.’\n In neurobiological terms, Merge operation is defined in such a way that it utilizes all three brain language regions: Wernicke’s area that primarily links words with objects; Broca’s area that interprets the grammar and assigns words in a sentence to a grammatical group such as noun, verb, or preposition  3; and the LPFC that synthesizes the objects from memory into a novel mental image according to sentence’s description  4, 5. Crucially, PFS definition leaves out interpretation of grammar in the Broca’s area and leaves out linking words with objects in the Wernicke’s area. PFS definition limits it to the function of the LPFC. Thus, PFS is defined significantly more narrowly than the Merge operation in both neurological and linguistic terms.\n The difference between PFS and Merge can be also highlighted by the process of learning a new language in adulthood: when one studies German, Spanish or Italian, one learns new words (Wernicke’s area) and new grammar rules (Broca’s area), PFS, however, does not change a bit. The same PFS abilities can be used to understand German, Spanish, or Italian sentences. PFS, in other words, is universal across all modern human languages, despite different words and grammar rules.\n All human languages  allow high fidelity transmission of infinite number of novel images with the use of a  finite number of words (here and later, words are understood as units of meaning, called sememes by linguists). The magic of using a finite number of words to communicate an infinite number of images completely depends on interlocutor’s ability to conduct PFS. When we describe a novel image (“My house is the second one on the left, just across the road from the church”), we rely on the interlocutor to use PFS in order to visualize the novel image. When we tell stories, we are often describing things that the interlocutor has never seen before (“That creature has three heads, two tails, large green eyes, and can run faster than a cheetah”) and we rely on the interlocutor to imagine the story in their mind’s eye. As Steven Pinker put it, “the speaker has a thought, makes a sound, and counts on the listener to hear the sound and to recover that thought”  22. The importance of the PFS ability is best realized when one is attempting to understand sentences describing combination of objects. Consider the two sentences: “A dog bit my friend” and “My friend bit a dog.” It is impossible to distinguish the difference in meaning using words or grammar alone, since both words and grammatical structure are identical in these two sentences. Understanding the difference in meaning and appreciating the misfortune of the 1 st sentence and the humor of the 2 nd sentence depends on interlocutor’s PFS ability. Only after the LPFC forms these two different images in front of the mind’s eye, are we able to understand the difference between these two sentences. Similarly, recursive statements with nested explanations (“a snake on the boulder to the left of the tall tree that is behind the hill”) force interlocutor to use PFS to combine objects (a snake, the boulder, the tree, and the hill) into a novel scene. For this reason, linguists refer to modern full human languages as recursive languages.\n This ability of recursive language to communicate an infinite number of novel images with the use of a finite number of words depends on interlocutor’s PFS capacity and also is facilitated by spatial prepositions, verb tenses, nesting, and other common elements of grammar. Consider, for example, the exponential ability of spatial prepositions to increase the maximum number of distinct images that can be communicated with high fidelity ( Figure 2). In a language with no spatial prepositions or other recursive elements, 1000 nouns can communicate 1000 images to a listener. Adding just one spatial preposition allows for the formation of three-word phrases (such as: ‘a bowl behind a cup’ or ‘a cup behind a bowl’) and increases the number of distinct images that can be communicated from 1000 to one million (1000×1×1000,  Figure 2). Adding a second spatial preposition and allowing for five-word sentences of the form object-preposition-object-preposition-object (such as: ‘a cup on a plate behind a bowl’) increases the number of distinct images that can be communicated to four billion (1000×2×1000×2×1000). The addition of a third spatial preposition increases the number of distinct images to 27 trillion (1000×3×1000×3×1000×3×1000), and so on. A typical language with 1000 nouns and 100 spatial prepositions can theoretically communicate 1000^101 x 100^100 distinct images. This number is significantly greater than the total number of atoms in the universe. For all practical purposes, an infinite number of distinct images can be communicated by a recursive language with just 1000 words and a few prepositions.\n  The magic of using a finite number of words to communicate an infinite number of images completely depends on the PFS ability. A person lacking this ability is unable to construct novel mental images according to the rules imposed by spatial prepositions and, therefore, will not understand the meaning of spatial prepositions. In the theoretical example of a language with 1000 nouns and 100 spatial prepositions, the person with PFS disability will be limited in his/her comprehension to the 1000 nouns. Generalizing to other elements of language, we conclude that patients with PFS disability are expected to lack understanding of any recursive elements of language – the symptom reported by Fuster and Luria in  prefrontal aphasia patients  15, 18. (Since “aphasia” is translated from Greek as “speechless” and these patients have no problem with speech, we prefer to call their condition a “PFS disability.”)\n Extending this argument from a single individual to a community of individuals with PFS disability, we note that the communication system in that community must be non-recursive. Similarly, if we could envision a community of individuals who have not yet acquired the PFS ability phylogenetically, we could confidently say that they could not have understood recursive language and therefore could not have used spatial prepositions. They still could communicate, but their communication system must have been non-recursive, void of spatial prepositions and other sentences describing object combinations. Linguistics does not have an established name for such a communication system with thousands of words and no recursion. We cannot refer to it as ‘language’ in order to avoid confusion with recursive language. Accordingly, we will simply refer to it as rich-vocabulary non-recursive communication system.\n PFS disability is not limited to individuals with LPFC damage. Individuals without any brain injury exhibit PFS disability if they were not exposed to recursive language in early childhood  23– 26. In our metaanalysis of published research, ten out of ten individuals linguistically deprived until puberty suffered lifelong PFS disability despite learning significant vocabulary through intensive post-pubertal language therapy  4. E.g., Genie, who was linguistically isolated until the age of 13 years 7 months, expanded her vocabulary to several hundred words following multi-year rehabilitation, but never completely acquired ability to understand spatial prepositions, verb tense, or recursion  27, 28. Furthermore, like other individuals with PFS disability, she invariably failed in nonverbal mental integration tasks that require PFS, such as those shown in  Figure 1  4. As a child Genie was not exposed to any dialogic communications; the next group of individuals grew up exposed to conversations, but not with a recursive language.\n About 90% of all congenitally deaf children are born to hearing parents  29. In the US, these children typically receive special services, are introduced to a formal sign language and are encouraged to use this recursive language for communication. In less developed countries, however, deaf children may never be exposed to a formal sign language. To communicate, such families usually spontaneously invent homesign (a.k.a. kitchensign), a system of iconic gestures that consists of simple signs. The homesign system though is lacking spatial prepositions, verb tenses and other recursive elements of a formal sign language. In other words, deaf linguistic isolates grow up exposed to a non-recursive communication system with large number of sign-words. Our analysis shows that these individuals deprived of recursive conversations until puberty performed poorly in all PFS tests, both verbal and nonverbal (such as those shown in  Figure 1) despite focused multi-year post-pubertal rehabilitation efforts  4. The consistent observation of PFS disability in these individuals stands in stark contrast to their performance on memory as well as semantic tests: they could easily remember hundreds of newly learned words and recall previously seen objects from memory but had real difficulty in any tasks requiring them to mentally combine these objects into novel configurations. Consider E.M., a deaf individual who was not introduced to a formal sign language until the age of 15  30. E.M. tested at age 19, four years after his acquisition of hearing aids and intensive language therapy, could not follow a direction to “put the green box in the blue box”  30; he would pick up the appropriate two boxes and “move them through a variety of spatial arrangements, watching the examiner for clues as to which was correct.”  30 For successful completion of this task without relying on trial and error, one needs to use PFS to generate the novel mental image of the green box inside the blue box. In other words, the correct arrangement of physical objects is possible only after completing its mental simulation.\n Isolated deaf children who grow up using homesign for communication must be distinguished from deaf children developing in a community of other deaf childr\n......", "posttime": "2020-05-11 03:21:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "递归,递归语言,language,pfs", "title": "7万年前的递归语言革命--罗穆卢斯和雷穆斯假说", "title_en": "Recursive Language Revolution 70k Years Ago the Romulus and Remus Hypotheses", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/166520v9.full", "via": "", "real_tags": ["递归", "递归语言", "language", "pfs"]}, {"category": "", "categoryclass": "", "imagename": "a8b72a0e51d66213d40e859e3b11ddd4.jpeg", "infoid": 1001564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PermalLink GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\n可能你们中的许多人都遇到过错误，虽然它们很容易修复(例如，复制粘贴错误)，但在修复它们之前，它们在代码中隐藏了几个月或几年。在许多情况下，这些问题的解决方案是静态和动态代码分析器和程序，以便通过函数检查内存泄漏或CPU时间使用情况，从而帮助更好地优化代码和搜索瓶颈。\n我将要展示的所有工具对于开源项目都是免费的(PVS-Studio是一个小例外，但稍后会这样)，其中许多工具可以很容易地与CI(在我的例子中是GitLab CI)集成，以进行自动代码和回归检查。\n我已经与Sonarcloud、Cppcheck和Coverity Scan集成了很多项目，它们的代码和实现细节可以在这里找到--https://gitlab.com/dashboard/projects.。\nSonarcloud扫描的结果可以在这里找到-https://sonarcloud.io/organizations/qarmin-1/projects和cppcheck在GitLab上的给定项目中的管道中，例如https://qarmin.gitlab.io/-/godot/-/jobs/526221853/artifacts/report/index.html。\n这可能是C/C++源文件中最基本、最容易使用的错误搜索程序，它不需要编译检查过的程序即可工作。\n我们所要做的就是进入项目目录并在那里运行Cppcheck，或者使用图形版本并单击它。\n它有很多种结果表示，但对我来说，最方便的方法是导出为html(如下面的示例所示)。\n控制台-在项目文件夹内执行这些命令，报表文件夹内将生成一个包含代码和错误的HTML文件。\nSonarcloud允许您通过网站查看和分类潜在错误。它可以免费用于开源项目。它发现与Cppcheck类似的bug，而不是需要耗时的编译。\n静态分析器在操作上类似于Sonarcloud(您也可以在线查看结果，对于开源解决方案是免费的)，但它不允许将结果公开，因此每个人都必须请求访问它们。根据我的经验，它比以前的工具发现更多真正的错误。\n-$Coverity_SCAN_TOKEN、$GITLAB_USER_EMAIL、$Coverity_SCAN_PROJECT_NAME等名称应使用您的令牌、名称等更改，g++rr.cpp-o rr.out应更改为正确的指令。\ncurl-o/tmp/cov-Analysis-linux64.tgz https://scan.coverity.com/download/linux64--表单项目=$COVERITY_SCAN_PROJECT_NAME--表单TOKEN=$COVERITY_SCAN_TOKENTAR xfz/tmp/cov-analysis-linux64.tgzcov-analysis-linux64-*/bin/cov-build--目录COV-INT g++rr.cpp-o r.outtar CFZ cov-int.tar.gz cov--INTURL https://scan.coverity.com/builds?project=$COVERITY_SCAN_PROJECT_NAME--表单TOKEN=$COVERITY_SCAN_TOKEN。--表单电子邮件=$GitLab_USER_EMAIL--表单文件=@cov-int.tar.gz。\nPVS-Studio是一个商业静态代码分析器，用于检测打字错误、错误和安全漏洞。分析器可以离线检查源代码，即完全与互联网隔离。这对于有特殊安全和代码泄漏保护要求的项目非常有用。\nPVS-Studio可在Windows、Linux、MacOS环境下运行。它支持与Azure DevOps、Travis CI、CircleCI、GitLab CI/CD、PlatformIO、Jenkins、SonarQube、Visual Studio等系统集成。已经为快速引入分析器开发了一个场景，甚至在一个大型的老项目中也是如此，例如，本文描述了这一场景。\n您可以通过以下链接下载分析仪并申请为期一周的试用许可证：https://www.viva64.com/en/pvs-studio-download/。\n虽然分析器定位为B2B解决方案，但许多开发人员可以在开源项目中甚至在封闭源代码项目中免费使用它。\n开源项目。参与GitHub、GitLab或Bitbucket上的项目开发的开发人员可以免费使用PVS-Studio。免费许可不会扩展到镜像项目。可以获得为期1年的免费许可：\n许可证到期后，您可以通过相同方式获取新的许可证密钥。\n针对开放源码项目开发人员的免费PVS-Studio一文中描述了这种类型的免费许可的更多细节。\n封闭源代码和学术项目。对于这类项目，基于将特殊类型的注释附加到分析的源代码上，另一种免费许可的选择是合适的。虽然这样的评论在大型企业项目中可能是不可接受的，但个别开发人员很可能会将它们添加到他们自己的项目中。这种类型的免费许可在文章“如何使用PVS-Studio for Free”中有更详细的描述。\n葡萄酒检查的样本报告，以及错误的解释可以在这里找到-https://www.viva64.com/en/b/0352/。\n安装strace软件包-sudo apt install straceLicense activate-pvs-studio-Analyzer Credentials usermail@gmail.com RRRR-WWWW-RRRR0-TTTD。\n这是一个检查程序在处理器上花费时间的好工具。显示程序在不同线程和可用处理器之间使用的时间。还允许您检查每个函数使用的处理器节拍数。\n动态和开放的代码分析器。它具有搜索内存泄漏、错误读取或应用程序剖析的能力。它在一个线程中运行代码，因此它的性能在较大的项目中不是很令人满意，但在较小的程序中工作得很好。\n==50713==内存错误检测器memcheck==50713==版权所有(C)2002年至2017年，和GNU GPL&#39；d，由Julian Seward等人撰写。=50713=使用Valgrind-3.15.0和LibVEX；使用-h重新运行版权信息==50713==命令：./rr.out==50713=50713=50713==堆摘要：==50713==退出时使用：2,400字节，2个块==50713==总堆使用量：3个分配，1个释放，分配的75,104字节==50713=50713==1块中的800字节在丢失记录中肯定丢失1/2==50713==在0x483C583：运算符NEW[](UNSIGNED LONG)(在/usr/lib/x86_64-linux-gnu/valgrind/vgpreload_memcheck-amd64-linux.so)==50713==中为0x10919E：Main(In/HOME/rafal/rr.out)==50713=50713==1,600字节在丢失记录中确定丢失2/2=50713==在0x483C583：运算符NEW[。memcheck-amd64-linux.so)==50713==BY 0x1091AC：Main(In/HOME/rafal/rr.out)==50713=50713==泄漏摘要：==50713==绝对丢失：2个数据块中的2,400字节==50713==间接丢失：0数据块中的0字节==50713==可能丢失的：0数据块中的0字节==50713=仍可访问：0数据块中的0字节==50713==被禁止的：0数据块中的0字节。使用以下条件重新运行：-s==50713==错误摘要：2个上下文中的2个错误(取消显示：0，来自0)。\n以图形形式显示每个时间单位的分配数量、内存泄漏和内存消耗。在检测内存泄漏方面，它比Valgrind快得多，但我猜没有以文本形式显示它们的选项。\ng++rr.cpp-o rr.outheaptrace./rr.outheaptrace_gui/home/rafal/heaptrack.rr.out.50388.gz#文件名应出现在上一条命令之后。\nGCC和朗都有分析器，可以在运行过程中检查程序是否有故障。与Valgrind不同的是，它们允许程序在多个线程上运行，这使得它们通常运行得更快(甚至是几倍)。在它们的帮助下编译的程序的运行速度甚至要慢几倍，占用的RAM也要多几倍。\n泄漏消毒器-负责检测内存泄漏。它显示分配了多少内存以及在哪里分配了内存。此工具的开销最小。\n从malloc中的#0 0x7fe4aeb98ae8(/lib/x86_64-linux-gnu/libasan.so.5+0x10dae8)分配的51个对象中的3672字节直接泄漏内存中的#1 0xd2d3c25：：alloc_static(unsign long，bool)core/os/memory y.cpp：82#2 0xd2d3b24 in Operator new(unsign long，()FileAccess：：Create(FileAccess：：AccessType)core/os/file_access.cpp：49#5 0xd20d707 in FileAccess：：create_for_path(string const&amp；)core/os/file_access.cpp：83#6 0xd20d9c7 in FileAccess：：create/file_access.h：77#4 0xd20d2d0 in FileAccess：：Create(FileAccess：：AccessType)core/os/file_access.cpp：83#6 0xd20d9c7 in FileAccess：：open(string const&amp；)\n地址消毒器-负责检测值在内存中不正确位置的写入/读出，例如刚刚释放的值。\n在TabContainer：：_gui_input(Ref&lt；InputEvent&gt；常量中的0x61a001447e90线程T0#0 0x9f01bf7处读取大小为8的内容/gui/tab_tainer.cpp：89#1 0x2358959 in MethodBind1&lt；Ref&lt；InputEvent&gt；Const&amp；&gt；：：Call(Object*，Variant Const**，int，Variant：：CallError&amp；)。cpp：7630x61a001447e90位于线程T0释放的1256字节区域[0x61a001447e80，0x61a001448368]内16字节：#0 0x7f5d74ba804f in__interceptor_free(/lib/x86_64-linux-gnu/libasan.so.5+0x10c.。(object*)core/os/memory y.h：118之前由线程T0在此处分配：#0 0x7f5d74ba8448 in malloc(/lib/x86_64-linux-gnu/libasan.so.5+0x10c448)#1 0xeb7a32a in memory：：alloc_static(unsign long，bool)core/os/memory y.cpp：85#2 0xeb7a226 in Operator new(。\n未定义的消毒器-负责检测描述C/C++语言标准的文档中未定义的情况，例如位移位大于变量长度的值(int a=25 552)、除以零或向变量写入超出其范围的值。\nServers/visual_server.cpp：513：17：运行时错误：-2.42852超出了类型为无符号字符的可表示值的范围。摘要：UnfinedBehaviorSaniizer：orrr.cpp：10：5中的未定义行为Servers/visual_server.cpp：513：17：运行时错误：将非零偏移量4应用于空指针。\n内存消毒器-仅在Clang中可用，负责检测未初始化变量的使用(从我的测试来看，它并不总是正常工作)。\n==44112==警告：Memory Saniizer：Main(/HOME/rafal/rr2.out+0x4974b8)#1 0x7f86d21ec0b2 in_libc_start_main/build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16#2 0x41c26d in_start(/HOME/raal/r2.out+0x41c26d)摘要：使用未初始化的值#0x4974b8。\n==44112==警告：Memory Saniizer：Main(/HOME/rafal/rr2.out+0x4974b8)#1 0x7f86d21ec0b2 in_libc_start_main/build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16#2 0x41c26d in_start(/HOME/raal/r2.out+0x41c26d)摘要：使用未初始化的值#0x4974b8。\nClang和GCC从版本10开始也有静态分析器，可以在编译期间检测潜在的错误，这不幸地延长了执行所需的时间。\nrr.cpp：7：10：警告：初始化期间存储到&#39；r&#39；的值从不读取int*r=new int[200]；^~rr.cpp：12：5：警告：赋值为垃圾或未定义的int qq=rr；^~", "note_en": "Permalink     GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n       Probably many of you have encountered errors which, although they were easy to fix (e.g. copy-paste bugs), were hidden in the code for months or years before they were fixed. The solution to these problems in many cases are static and dynamic code analyzers and programs to check for memory leaks or CPU time usage by functions that help to better optimize the code and search for bottlenecks.\n All tools I&#39;m going to present are free for open-source projects (with a small exception of PVS-Studio, but about that later), many of which can be easily integrated with CI (in my case Gitlab CI) for autimatical code and regression checking.\n I have integrated many projects with Sonarcloud, Cppcheck and Coverity Scan, whose codes and implementation details can be found here -  https://gitlab.com/dashboard/projects.\n The results of Sonarcloud scans can be found here -  https://sonarcloud.io/organizations/qarmin-1/projects and Cppcheck in pipelins in a given project on Gitlab e.g.  https://qarmin.gitlab.io/-/godot/-/jobs/526221853/artifacts/report/index.html\n  This is probably the most basic and easiest to use error search program in C/C++ source files, which does not require compilation of the checked program to work.\n All we have to do is enter the project directory and run Cppcheck there, or use the graphical version and click it.\n It has many kinds of results presentation, but for me the most convenient method is to export to html (shown in the example at the bottom)\n        Console - execute these commands inside the project folder, and an HTML file with code and errors will be generated inside the  report folder\n   Sonarcloud allows you to view and sort potential errors through the website. It is free to use for open source projects. It finds similar bugs as Cppcheck as opposed to it requires time-consuming compilation.\n       A static analyzer similar in operation to Sonarcloud (you can also view the results online and it is free for open source solutions), but it does not allow to make the results publicly available, so each individual must ask for access to them. According to my experience it finds more real errors than previous tools.\n      Names like - $COVERITY_SCAN_TOKEN, $GITLAB_USER_EMAIL, $COVERITY_SCAN_PROJECT_NAME should be changed with yours tokens, names etc. and also  g++ rr.cpp -o rr.out should be changed to proper comilation instructions\n curl -o /tmp/cov-analysis-linux64.tgz https://scan.coverity.com/download/linux64 --form project=$COVERITY_SCAN_PROJECT_NAME --form token=$COVERITY_SCAN_TOKENtar xfz /tmp/cov-analysis-linux64.tgzcov-analysis-linux64-*/bin/cov-build --dir cov-int g++ rr.cpp -o rr.outtar cfz cov-int.tar.gz cov-intcurl https://scan.coverity.com/builds?project=$COVERITY_SCAN_PROJECT_NAME --form token=$COVERITY_SCAN_TOKEN --form email=$GITLAB_USER_EMAIL --form file=@cov-int.tar.gz\n  PVS-Studio is a commercial static code analyzer for detecting typos, errors, and security weaknesses. The analyzer can check the source code offline, i.e. completely isolated from the internet. This is useful for projects with special security and code leakage protection requirements.\n PVS-Studio runs on Windows, Linux, macOS environments. It supports integration with such systems as Azure DevOps, Travis CI, CircleCI, GitLab CI/CD, PlatformIO, Jenkins, SonarQube, Visual Studio and others. A scenario has been developed for the rapid analyzer introduction even in a large old project, which is described, for example, in this  article.\n You can download the analyzer and request a one-week trial license by following the link:  https://www.viva64.com/en/pvs-studio-download/\n Although the analyzer is positioned as a B2B solution, many developers can use it for free both in open source and even in closed source projects.\n Open source projects. PVS-Studio can be used free of charge by developers involved in the development of projects hosted on GitHub, GitLab, or Bitbucket. A free license doesn&#39;t extend to projects&#39; mirrors. It is possible to get a free license for a period of 1 year:\n Upon expiration of the license, you can get a new license key in the same way.\n Additional details of this type of free licensing are described in the article  &#34;Free PVS-Studio for those who develops open source projects&#34;.\n Closed source and academic projects. For such projects, an alternative option for free licensing is suitable, based on appending comments of a special kind to the analyzed source code. Although such comments may be unacceptable in large enterprise projects, individual developers may well add them to their own projects. This type of free licensing is described in more detail in the article  &#34;How to use PVS-Studio for Free&#34;.\n  Sample Report from the Wine check, together with an explanation of the errors can be found here -  https://www.viva64.com/en/b/0352/\n   Installation of the strace package -  sudo apt install straceLicense activation -  pvs-studio-analyzer credentials usermail@gmail.com RRRR-WWWW-RRRR0-TTTD.\n     A great tool to check the time the program spends on the processor.Displays the time used by the program between different threads and available processors.Also allows you to check the number of processor ticks used by each function.\n        Dynamic and open code analyzer.It has the ability to search for memory leaks, incorrect readings or application profiling.It runs the code in one thread, so its performance is not very satisfactory for larger projects, but it works perfectly in smaller programs.\n  ==50713== Memcheck, a memory error detector==50713== Copyright (C) 2002-2017, and GNU GPL&#39;d, by Julian Seward et al.==50713== Using Valgrind-3.15.0 and LibVEX; rerun with -h for copyright info==50713== Command: ./rr.out==50713== ==50713== ==50713== HEAP SUMMARY:==50713== in use at exit: 2,400 bytes in 2 blocks==50713== total heap usage: 3 allocs, 1 frees, 75,104 bytes allocated==50713== ==50713== 800 bytes in 1 blocks are definitely lost in loss record 1 of 2==50713== at 0x483C583: operator new[](unsigned long) (in /usr/lib/x86_64-linux-gnu/valgrind/vgpreload_memcheck-amd64-linux.so)==50713== by 0x10919E: main (in /home/rafal/rr.out)==50713== ==50713== 1,600 bytes in 1 blocks are definitely lost in loss record 2 of 2==50713== at 0x483C583: operator new[](unsigned long) (in /usr/lib/x86_64-linux-gnu/valgrind/vgpreload_memcheck-amd64-linux.so)==50713== by 0x1091AC: main (in /home/rafal/rr.out)==50713== ==50713== LEAK SUMMARY:==50713== definitely lost: 2,400 bytes in 2 blocks==50713== indirectly lost: 0 bytes in 0 blocks==50713== possibly lost: 0 bytes in 0 blocks==50713== still reachable: 0 bytes in 0 blocks==50713== suppressed: 0 bytes in 0 blocks==50713== ==50713== For lists of detected and suppressed errors, rerun with: -s==50713== ERROR SUMMARY: 2 errors from 2 contexts (suppressed: 0 from 0)\n      Displays in graphic form the number of allocations, memory leaks, memory consumption per time unit. It is much faster than Valgrind in detecting memory leaks, but I guess there is no option to display them in text form.\n      g++ rr.cpp -o rr.outheaptrack ./rr.outheaptrack_gui /home/rafal/heaptrack.rr.out.50388.gz # File name should appear after the previous command\n  Both GCC and Clang contain analyzers that check the program for malfunctions during operation. Unlike Valgrind, they allow the program to run on many threads, which makes them usually faster (even several times).A program compiled with their help works even several times slower and takes up several times more RAM.\n  Leak Sanitizer - responsible for detecting memory leaks. It shows how much and where memory has been allocated. This tool has minimal overhead.\n Direct leak of 3672 byte(s) in 51 object(s) allocated from: #0 0x7fe4aeb98ae8 in malloc (/lib/x86_64-linux-gnu/libasan.so.5+0x10dae8) #1 0xd2d3c25 in Memory::alloc_static(unsigned long, bool) core/os/memory.cpp:82 #2 0xd2d3b24 in operator new(unsigned long, char const*) core/os/memory.cpp:42 #3 0x49c53ae in FileAccess* FileAccess::_create_builtin&lt;FileAccessUnix&gt;() core/os/file_access.h:77 #4 0xd20d2d0 in FileAccess::create(FileAccess::AccessType) core/os/file_access.cpp:49 #5 0xd20d707 in FileAccess::create_for_path(String const&amp;) core/os/file_access.cpp:83 #6 0xd20d9c7 in FileAccess::open(String const&amp;, int, Error*) core/os/file_access.cpp:108 #7 0xd64d3f4 in PCKPacker::pck_start(String const&amp;, int) core/io/pck_packer.cpp:66\n Address Sanitizer - Responsible for detecting writing/reading of values to incorrect places in the memory, e.g. just released.\n READ of size 8 at 0x61a001447e90 thread T0 #0 0x9f01bf7 in TabContainer::_gui_input(Ref&lt;InputEvent&gt; const&amp;) scene/gui/tab_container.cpp:89 #1 0x2358959 in MethodBind1&lt;Ref&lt;InputEvent&gt; const&amp;&gt;::call(Object*, Variant const**, int, Variant::CallError&amp;) core/method_bind.gen.inc:775 #2 0xe5d9137 in Object::call_multilevel(StringName const&amp;, Variant const**, int) core/object.cpp:7630x61a001447e90 is located 16 bytes inside of 1256-byte region [0x61a001447e80,0x61a001448368)freed by thread T0 here: #0 0x7f5d74ba804f in __interceptor_free (/lib/x86_64-linux-gnu/libasan.so.5+0x10c04f) #1 0xeb7b37f in Memory::free_static(void*, bool) core/os/memory.cpp:181 #2 0x158da38 in void memdelete&lt;Object&gt;(Object*) core/os/memory.h:118previously allocated by thread T0 here: #0 0x7f5d74ba8448 in malloc (/lib/x86_64-linux-gnu/libasan.so.5+0x10c448) #1 0xeb7a32a in Memory::alloc_static(unsigned long, bool) core/os/memory.cpp:85 #2 0xeb7a226 in operator new(unsigned long, char const*) core/os/memory.cpp:42 #3 0x92d0b6b in Object* ClassDB::creator&lt;PopupMenu&gt;() (/usr/bin/godots+0x92d0b6b)\n Undefined Sanitizer - Responsible for detecting situations not defined in the documents describing the C/C++ language standard, e.g. a bit shift by a value greater than the length of a variable (int a = 25 552), dividing by zero or writing to a variable a value outside its range\n servers/visual_server.cpp:513:17: runtime error: -2.42852 is outside the range of representable values of type &#39;unsigned char&#39;SUMMARY: UndefinedBehaviorSanitizer: undefined-behavior servers/visual_server.cpp:513:17 in orrr.cpp:10:5: runtime error: applying non-zero offset 4 to null pointer\n Memory Sanitizer - available only in Clang, responsible for detecting the use of non-initialised variables (from my tests it does not always work as it should)\n ==44112==WARNING: MemorySanitizer: use-of-uninitialized-value #0 0x4974b8 in main (/home/rafal/rr2.out+0x4974b8) #1 0x7f86d21ec0b2 in __libc_start_main /build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16 #2 0x41c26d in _start (/home/rafal/rr2.out+0x41c26d)SUMMARY: MemorySanitizer: use-of-uninitialized-value (/home/rafal/rr2.out+0x4974b8) in main\n  ==44112==WARNING: MemorySanitizer: use-of-uninitialized-value #0 0x4974b8 in main (/home/rafal/rr2.out+0x4974b8) #1 0x7f86d21ec0b2 in __libc_start_main /build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16 #2 0x41c26d in _start (/home/rafal/rr2.out+0x41c26d)SUMMARY: MemorySanitizer: use-of-uninitialized-value (/home/rafal/rr2.out+0x4974b8) in main\n                Clang and GCC from version 10 onwards also have static analyzers that can detect potential errors during compilation, which unfortunately extends the time needed for its execution.\n  rr.cpp:7:10: warning: Value stored to &#39;r&#39; during its initialization is never read int* r = new int[200]; ^ ~~~~~~~~~~~~rr.cpp:12:5: warning: Assigned value is garbage or undefined int qq = rr; ^~~~~~ ~~", "posttime": "2020-05-11 03:20:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,代码,修复,checking,项目", "title": "检查和修复C/C++代码(以及其他语言)的有用工具", "title_en": "Useful tools for checking and fixing C/C++ code (and others languages too)", "transed": 1, "url": "https://github.com/qarmin/Instrukcje-i-Tutoriale/blob/master/AnalizatoryCC%2B%2BENG.md", "via": "", "real_tags": ["c++", "代码", "修复", "checking", "项目"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1001563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，美国电信业开始通过其惯常的盟友推动一种胡说八道的说法。简而言之，这一说法围绕的论点是，美国互联网在大流行期间仍然有效的唯一原因是特朗普FCC无视公众，无视最客观的专家，并在电信业游说者的要求下摧毁了自己。这一争论首先出现在AEI，然后是特朗普的FCC，然后是华尔街日报的页面，此后在全国范围内的许多专栏文章中都可以看到。我打赌这不是巧合，我还打赌我们会看到更多这样的照片。\n所有这些文章都试图辩称，美国互联网在大流行期间能够正常运作的唯一原因是，作为恢复互联网自由的一部分，FCC摧毁了其在电信领域的权威，废除了网络中立。故事说，这一废除推动了对美国宽带网络的大量投资(根本不是真的)，导致了电信乌托邦(也不是真的)。该论点还认为，在欧洲，监管者通常在监管行业整合和电信垄断等方面扮演着更积极的角色，互联网几乎分崩离析(你猜怎么着：事实并非如此)。\n通常，就像这篇专栏文章一样，很多人坚称，美国的宽带行业在很大程度上是美好的，而欧盟已经下了地狱：\n与这里不同的是，欧洲的电视网受到更严格的监管。多年来，这导致消费者的投资减少，表现更差。美国消费者总体上受到私营部门的良好服务。\n任何花了五分钟与康卡斯特客户支持交谈的人，或者试图让像Frontier Communications这样丑闻缠身的ISP升级劣质DSL线路的人，都知道这是胡说八道。尽管如此，我们还是写了一篇长长的帖子，探究这一论点到底有多狗屎，以及这些说法是如何完全没有证据支持的。整个纸牌屋都是建立在无稽之谈之上的，利用一场灾难来帮助证明监管捕获和市场失灵是正当的，这在伦理上是荒谬的。\n尽管美国互联网在大流行期间总体上表现相对较好是事实，但对于所谓的“最后一英里”(即从你的ISP网络到你家的链接)就不能这么说了。是的，核心互联网和大多数主要的交通路线，旨在处理超级碗等活动期间的巨大运力峰值，已经相对较好地处理了负载。正如萨沙·迈因拉特(Sascha Meinrath)在这里正确指出的那样，问题在于消费者和商业领域的速度缓慢，对许多人来说，这些行业已经多年没有升级过了：\n现在，一个由网络科学家组成的国际联盟每天从互联网服务提供商(ISP)的客户那里收集75万个美国宽带速度测试，我们一直在跟踪人们家庭连接速度的惊人损失。根据大多数ISP的说法，核心网络正在处理额外的负载。但我们的数据显示，最后一英里的网络基础设施似乎正在倒塌。\n再说一次，你的5 Mbps DSL线路在正常情况下可能还可以，但在大流行期间，当你的整个家庭都在播放4K视频、玩游戏和缩放时，它就不会很好地为你服务了。而且你的DSL线路没有升级，因为(1)几乎没有竞争迫使你的ISP这么做，(2)美国政府充斥着马屁精，他们把竞选捐款和ISP收入置于市场健康和消费者福利之上。虽然有一群与行业有关联的人非常努力地假装不是这样，但这是一种政策失败，与盲目放松监管、缺乏竞争，以及更重要的是腐败直接相关。简而言之，这与该行业的最新论调截然相反。\n多年来，我们一直注意到美国电信公司拒绝维修或升级老化的DSL线路，因为这条线路利润不够高，速度不足以让华尔街满意。在没有竞争和监管的情况下，美国宽带巨头没有任何动力去努力尝试。同样，因为我们的立法者和监管者在很大程度上是被俘虏的旋转门式的，他们橡皮图章地批准糟糕的合并，对非常明显的行业问题视而不见，例行公事地将数十亿纳税人的钱投入垄断企业，以换取通常只有部分部署的光纤网络--如果它们真的重新部署的话。\n与此同时，几乎放弃升级老化的DSL线路的美国电信公司，帮助康卡斯特在美国大片地区巩固了更大的垄断地位。这是一个电信业、特朗普联邦通信委员会和各种行业辩护者都会忽视的问题，几乎可以说是滑稽可笑的效果。同样被忽视的事实是，这导致美国宽带用户为宽带支付的价格在发达国家中名列前茅：\n许多研究，包括FCC自己进行的研究表明，宽带价格是宽带采用的第二大障碍(可用性是第一)。很明显，如果人们对一项服务收费很高，他们购买它的可能性就会降低。独立研究人员已经证明，贫困地区通常比富裕社区支付更高的连接费用。少数民族和农村地区的红线现象似乎很普遍，我们需要来自联邦通信委员会的准确定价数据，才能有意义地解决这些差异。\n试着找出阿吉特·派(Ajit Pai)，或这群电信垄断辩护者中的任何人，是否真的承认美国宽带市场竞争不激烈，因此对企业和消费者来说都非常昂贵。你根本找不到它。你会发现很多借口和稻草人的论点，比如最近的一个，旨在分散媒体、公众和政策制定者对非常明显的市场失灵的注意力。市场失灵在正常时期是一个主要问题，在宽带是必不可少的生命线的大流行期间更是如此。", "note_en": "A few weeks ago, the US telecom industry began pushing a  bullshit narrative through its usual allies. In short, the claim revolves around the argument that the only reason the US internet still works during a pandemic was because the Trump FCC ignored the public, ignored most objective experts, and  gutted itself at the behest of telecom industry lobbyists. The argument first popped up  over at AEI, then  the Trump FCC, then the  pages of the Wall Street Journal, and has since been seen in  numerous op-eds nationwide. I&#39;d wager that&#39;s not a coincidence, and I&#39;d also wager we&#39;ll be seeing a lot more of them.\n All of the pieces try to argue that the only reason the US internet works during a pandemic is because the FCC  gutted its authority over telecom as part of its &#34;restoring internet freedom&#34; net neutrality repeal. This repeal, the story goes, drove significant investment in US broadband networks ( not remotely true), resulting in telecom Utopia (also  not true). The argument also posits that in Europe, where regulators have generally taken a more active role in policing things like industry consolidation and telecom monopolies, the internet all but fell apart (guess what:  not true).\n Usually, like in  this op-ed, there&#39;s ample insistence that the US broadband sector is largely wonderful while the EU has gone to hell:\n &#34;Unlike here, European networks are more heavily regulated. This has led to less investment and worse performance for consumers for years. American consumers are being generally well served by the private sector.&#34;\n Anybody who has spent five minutes talking to Comcast customer support -- or tried to get scandal-plagued ISP like Frontier Communications to upgrade  rotten DSL lines -- knows this is bullshit. Still, we penned a  lengthy post exploring just how full of shit this argument is, and how there&#39;s absolutely  zero supporting evidence for the claims. The entire house of cards is built on fluff and nonsense, and it&#39;s just ethically grotesque to use a disaster to help justify regulatory capture and market failure.\n While it&#39;s true that the US internet,  in general, has held up relatively well during a pandemic, the same can&#39;t be said of the so called &#34;last mile,&#34; or the link from your ISP&#39;s network to your home. Yes, the core internet and most primary transit routes, designed to handle massive capacity spikes during events like the Superbowl, has handled the load relatively well. The problem, as Sascha Meinrath  correctly notes here, is sluggish speeds on consumer and business lines that, for many, haven&#39;t been upgraded in years:\n &#34;Right now, an international consortium of network scientists is collecting 750,000 U.S. broadband speed tests from internet service provider (ISP) customers each day, and we’ve been tracking a stunning loss of connectivity speeds to people’s homes. According to most ISPs, the core network is handling the extra load. But our data show that the last-mile network infrastructure appears to be falling down on the job.&#34;\n Again, your 5 Mbps DSL line might be ok during normal times, but it&#39;s not going to serve you well during a pandemic when your entire family is streaming 4K videos, gaming, and Zooming. And your DSL line isn&#39;t upgraded because there&#39;s (1) very little competition forcing your ISP to do so, and (2) the US government is filled to the brim with sycophants who prioritize campaign contributions and ISP revenues over the health of the market and consumer welfare. And while there&#39;s a contingency of industry-linked folks who try very hard to pretend otherwise, this is a policy failure that&#39;s directly tied to mindless deregulation, a lack of competition, and, more importantly, corruption. In short, the complete opposite of the industry&#39;s latest talking point.\n For years we&#39;ve been noting how US telcos have refused to  repair or upgrade aging DSL lines because it&#39;s not profitable enough, quickly enough for Wall Street&#39;s liking. Facing no competition and no regulatory oversight, there&#39;s zero incentive for a giant US broadband provider to try very hard. Similarly, because our lawmakers and regulators are largely of the captured, revolving door variety, they rubber stamp  shitty mergers, turn a blind eye to  very obvious industry problems, routinely throwing billions in taxpayer money at monopolies in exchange for fiber networks that are usually only  partially deployed -- if they&#39;re  deployed at all.\n Meanwhile, US telcos that have all but given up on upgrading aging DSL lines have helped cement an even  bigger Comcast monopoly across vast swaths of America. It&#39;s a problem that the telecom sector, Trump FCC, and various industry apologists will ignore to almost comical effect. Also ignored is the fact that this results in US broadband subscribers paying some of the highest prices for broadband in the developed world:\n &#34;Numerous studies, including those conducted by the FCC itself, show that broadband pricing is the second-largest barrier to broadband adoption (availability is the first). It’s obvious that if people are being charged a lot for a service, they’re less likely to purchase it. And independent researchers have already documented that poor areas often pay more than rich communities for connectivity. Redlining of minority and rural areas appears to be widespread, and we need accurate pricing data from the FCC to meaningfully address these disparities.&#34;\n Try to find any instance where Ajit Pai, or anybody in this chorus of telecom monopoly apologists, actually admits that the US broadband market isn&#39;t competitive and, as a result, is hugely expensive for businesses and consumers alike. You simply won&#39;t find it. What you will find are a lot of excuses and straw men arguments like this latest one, designed to distract the press, public, and policymakers from very obvious market failure. Market failure that was a major problem in normal times, and exponentially more so during a pandemic where broadband is an essential lifeline.", "posttime": "2020-05-11 03:20:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,市场,failure,美国", "title": "冠状病毒暴露出一种有害的宽带市场失灵否认主义", "title_en": "Covid-19 Is Exposing a Virulent Strain of Broadband Market Failure Denialism", "transed": 1, "url": "https://www.techdirt.com/articles/20200506/10391544448/covid-19-is-exposing-virulent-strain-broadband-market-failure-denialism.shtml", "via": "", "real_tags": ["冠状病毒", "病毒", "市场", "failure", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考虑一下在iOS应用商店中找到您的应用的人。他们决定想要你的应用程序：点击“获取”或“购买”按钮。\n应用程序下载-希望是快速的；希望你已经把它缩小了，因为你已经描绘了这个时刻，你甚至关心用户体验的这一方面-然后用户点击打开按钮。\n他们已经等着看这款应用了。他们很兴奋地想看看它是什么样子，并开始使用它！\n而且，现在它在这里，你可以在他们的道路上设置一系列障碍-这会导致你失去一些人-或者你可以通过让他们进入应用程序来立即满足他们的兴趣和好奇心。\n我是这样的：当我下载一个带有第一次运行教程的应用程序时，我会试图找到一种方法来缩短它的路径，然后进入实际的应用程序。如果我做不到，我就会飞快地看一遍，因为我知道无论如何我都不会记得任何事情。\n同样，如果应用程序需要进行第一次运行设置，我会尽量避免。如果它有第一次运行的设置和教程，除非我绝对确定我想要这个应用程序，否则我会放弃。\n在App Store推出之初，有没有一些关于应用程序的引用，甚至可能是史蒂夫·乔布斯(Steve Jobs)的话，是这样的呢？“iPhone应用程序应该非常容易使用，不需要帮助。”\n从那以后，我一直在想，如果我看了第一期教程，他们就搞砸了。应用程序的设计应该让你能够快速了解基本情况，然后通过逐步披露，找到更高级的功能。\n在我看来，最好的第一次运行体验是让人们尽快进入应用程序，因为那是他们想要的地方。\n他们已经等待了足够长的时间-找到应用程序，下载它-现在你想把快乐推迟得更久，从而玷污甚至冒险吗？别这么做！\n记住，人们很忙，经常心不在焉，还有无数的其他应用程序。你的应用程序不是全世界的。这个人就是整个世界。\n请记住，应用程序中的每一件事都会发送一条消息。第一次运行的教程会传递这样的信息，即您的应用程序有一个陡峭的学习曲线。这绝对是一件令人反感的事。\n它立即在用户中引发了焦虑，有两个相关的方面：1)“我能学会这个显然很难使用的应用程序吗？”和2)“我还会记得这篇教程中的任何一篇吗？我需要拿出纸笔做笔记吗？“", "note_en": "Consider the person who finds your app on the iOS App Store. They decide they want your app: they tap the get or purchase button.\n The app downloads — hopefully quickly; hopefully you‘ve made it small, because you’ve pictured this moment and you care about even this aspect of the user experience — and then the user taps the Open button.\n They’ve already waited to see the app. They’re excited to see what it’s like and get started using it!\n And, now that it’s here, you can put a bunch of obstacles in their way — which will cause you to lose some of these people — or you can satisfy their interest and curiosity right away by getting them into the app.\n  Here’s me: when I download an app with a first-run tutorial, I try to find a way to short-circuit it and get to the actual app. If I can’t, I just race through it, knowing I wouldn’t have remembered any of it anyway.\n  Similarly, if an app has first-run setup to do, I try to avoid it. If it has first-run setup  and a tutorial, I’ll just give up unless I know for absolute sure that I want this app.\n  Isn’t there some quote, maybe even from Steve Jobs, about apps early in the day of the App Store, that went something like this? “iPhone apps should be so easy to use that they don’t need Help.”\n I’ve always thought to myself, since then, that if I see a first-run tutorial, they blew it. Apps should be designed so that you can figure out the basics quickly, and then find, through progressive disclosure, more advanced features.\n It seems to me that the best first-run experience is to get people into the app as quickly as possible, because that’s where they want to be.\n They’ve already waited long enough — finding the app, downloading it — and now you want to delay the joy even longer, and thereby tarnish or even risk it? Don’t do it!\n Remember that people are busy, often distracted, and there are zillions of other apps. Your app is not the world. The person is the world.\n   Remember that every single thing in your app sends a message. A first-run tutorial sends the message that your app has a steep learning curve. Definitely a turn-off.\n It provokes anxiety in the user immediately, in two related ways: 1) “Will I ever be able to learn this apparently hard-to-use app?” and 2) “Will I remember any of this tutorial at all? Do I need to get out pen and paper and take notes?”", "posttime": "2020-05-11 03:06:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,iphone,应用程序", "title": "理想的iPhone App首次运行体验根本不是", "title_en": "The Ideal iPhone App First-Run Experience Is None at All", "transed": 1, "url": "https://inessential.com/2020/05/09/the_ideal_iphone_app_first_run_experienc", "via": "", "real_tags": ["app", "iphone", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "e9d7b2191c2c05e40ec310512d77a634.jpg", "infoid": 1001561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Clearview AI是一家面部识别软件公司，帮助执法部门追踪疑似罪犯。现在，这家科技公司正在与联邦和州当局谈判，以帮助追踪冠状病毒的传播。NBC新闻的雅各布·沃德报道了这项有争议的技术。2020年4月28日", "note_en": "Clearview AI is a facial recognition software company that helps law enforcement track down suspected criminals. Now the tech company is in talks with federal and state authorities to help trace the spread of the coronavirus. NBC News’ Jacob Ward reports on the controversial technology. April 28, 2020", "posttime": "2020-05-11 03:04:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,跟踪,pitches", "title": "ClearviewAI推出面部识别跟踪冠状病毒患者", "title_en": "ClearviewAI pitches facial recognition to track Covid-19 patients", "transed": 1, "url": "https://www.nbcnews.com/now/video/controversial-tech-company-pitches-facial-recognition-to-track-covid-19-82638917537", "via": "", "real_tags": ["冠状病毒", "病毒", "跟踪", "pitches"]}, {"category": "", "categoryclass": "", "imagename": "a5b573fafea45340726cf4ff53cee9d3.jpeg", "infoid": 1001560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "理解继政府债券之后的投资，公司债券市场是全球债券宇宙中最大的部分。由于有大量的到期日、收益率和信用质量可用，投资公司债券有可能为投资者提供比政府债券更高的收益率和多样化的好处。\n当公司想要扩大业务或为新的商业冒险提供资金时，他们通常会转向公司债券市场借钱。一家公司确定它想借多少钱，然后发行这个数额的债券；购买债券的投资者实际上是根据债券发行或招股说明书中确立的条款借钱给公司。\n与股票不同，公司债券的所有权并不意味着对发行债券的公司拥有所有权权益。取而代之的是，公司在一段时间内向投资者支付利息，并在债券发行时确定的到期日偿还本金。\n虽然一些公司债券具有可能影响到期日的赎回或赎回功能，但大多数债券大致分为以下期限范围：\n除了到期日，公司债券还根据信用质量进行分类。穆迪投资者服务公司(Moody‘s Investors Service)和标准普尔(Standard&amp；Poor’s)等信用评级机构对公司债券发行人进行独立分析，根据每个发行人的信誉对其进行评级。信用评级较低的公司债券发行人倾向于为其公司债券支付更高的利率。\n公司债券分为两大类：投资级和投机级(或高收益)债券。投机级债券是由信用质量被认为比评级较高的投资级公司低的公司发行的。投资级类别有四个评级等级，而投机级类别由六个评级等级组成。\n从历史上看，投机级债券是由较新的公司发行的，这些公司位于竞争特别激烈或波动特别大的行业，或者基本面令人不安。今天，也有许多公司的业务被设计成以传统上与投机级公司相关的杠杆程度运营。虽然投机级信用评级表明违约概率更高，但这些债券通常通过支付更高的利率或收益率来补偿投资者的更高风险。如果发行人的信用质量恶化，可以下调信用评级；如果基本面好转，可以上调信用评级。\n“堕落天使”是一个术语，描述的是一家投资级公司陷入困境，随后其债务评级被下调至投机级。“冉冉升起的新星”是指因发行人信用质量改善而被信用评级机构上调债券评级的公司.。由于信用评级机构的评级是主观的，所以有时他们也不同意评级-这种情况被称为“分裂评级”。堕落天使、冉冉升起的新星和分裂的评级都可能为投资者提供机会，因为他们的评级可能会波动，从而承担更大的风险，从而增加额外的收益。\n公司债券的价格受多个因素影响，包括债券的到期日、发行公司的信贷评级和一般利率水平。公司债券的收益率会随利率变动而波动，以反映债券价格因利率变动而出现的变化，以及市场对发行人信用质量的看法。大多数公司债券的信用风险和收益率通常比类似期限的政府债券高。这种分歧造成了公司和政府债券之间的信用利差，因此公司债券投资者通过承担更大的风险来赚取额外的收益。信用利差影响债券的价格，可以用图形绘制和衡量，即公司债券和政府债券在每个到期点的收益率之差。\n多元化：公司提供投资于各种经济部门的机会。在广泛的企业范围内，风险和收益存在着很大的差异。公司债券可以增加股票投资组合的多样化，也可以使政府债券或其他固定收益证券的固定收益投资组合多样化。\n收入：公司有潜力提供诱人的收入。大多数公司债券每半年支付一次。一个例外是零息债券，这种债券不支付利息，但以很大的折扣出售，然后在到期时以全额面值赎回。另一个例外是浮动利率债券，这些债券的利率波动与货币市场参考利率挂钩，如伦敦银行间同业拆借利率(LIBOR)或联邦基金利率。这些证券的收益率往往低于可比期限的固定利率证券，但本金波动也较小。\n流动性：公司债券可以在到期前的任何时间在一个庞大而活跃的二级交易市场上出售。\n与公债类似，公司债也面临利率风险。此外，公司债券还存在信用或违约风险-借款人无法偿还贷款并违约的风险。违约风险水平根据发行人的基础信用质量而有所不同。\n特定证券或证券组的信用质量不能保证整个投资组合的稳定性或安全性。提供个别发行/发行人的质量评级是为了表明此类发行/发行人的信用评级，一般范围分别为AAA、AAA或AAA(最高)至D、C或D(最低)，标准普尔、穆迪和惠誉的评级范围分别为：A AA、AAA或AAA(最高)至D、C或D(最低)。\n关于风险：投资债券市场是有风险的，包括市场风险、利率风险、发行人风险、信用风险、通胀风险和流动性风险。大多数债券和债券策略的价值都受到利率变化的影响。与存续期较短的债券和债券策略相比，存续期较长的债券和债券策略往往更为敏感和波动；债券价格一般会随着利率上升而下跌，目前的低利率环境增加了这种风险。目前债券交易对手能力的减少可能会导致市场流动性下降和价格波动增加。债券投资在赎回时的价值可能高于或低于原始成本。公司债务证券面临发行人无法支付债务本金和利息的风险，也可能由于利率敏感性、市场对发行人资信的看法和一般市场流动性等因素而受到价格波动的影响。某些美国政府证券得到了政府完全信任的支持。美国政府机构和当局的义务得到了不同程度的支持，但通常没有得到美国政府完全信任的支持。投资于这类证券的投资组合不受担保，价值将会波动。浮动利率贷款不在交易所交易，受到重大信贷、估值和流动性风险的影响。由于实际和感知的一般市场、经济和行业状况，股票的价值可能会下降。分散投资并不能保证不受损失。\n不能保证这些投资策略在所有市场条件下都会奏效，或者适用于所有投资者，每个投资者都应该评估自己的长期投资能力，特别是在市场低迷时期。\n本材料仅供参考，不应被视为对任何特定证券、策略或投资产品的投资建议或推荐。投资者在作出投资决定前，应咨询他们的投资专业人士。本文中包含的信息是从被认为可靠但不能保证的来源获得的。\nPIMCO只向合格机构和投资者提供服务。这不是向非法或未经授权的任何司法管辖区的任何人提供的。|太平洋投资管理公司地址：加利福尼亚州纽波特海滩650Newport Center Drive650号，邮编：92660，受美国证券交易委员会监管。|PIMCO Investments LLC，美国分销商，地址：1633Broadway，New York，NY，10019是太平洋投资管理公司的一家公司。|太平洋投资管理公司欧洲有限公司(公司编号2604517)、太平洋投资管理公司欧洲有限公司阿姆斯特丹分公司(公司编号24319743)和太平洋投资管理欧洲有限公司意大利分公司(公司编号07533910969)由英国金融市场行为监管局(25 The North Colonnade，Canary Wharf，London E14 5HS)授权和监管。根据意大利综合金融法第27条，阿姆斯特丹和意大利分行分别受澳大利亚金融管理局和意大利金融服务委员会的额外监管。PIMCO欧洲有限公司的服务和产品仅向金融市场行为监管局手册中定义的专业客户提供，不向个人投资者提供，他们不应依赖这种沟通。|PIMCO Deutschland GmbH(公司编号：192083，Seidlstr.。24-24A，80335慕尼黑，德国)由德国联邦金融监管局(居里夫人)授权和监管。24-28日，60439法兰克福(美因河畔法兰克福)根据德国银行法第32条的规定。PIMCO Deutschland GmbH提供的服务和产品仅提供给第31a节定义的专业客户。2德国证券交易法(WpHG)。个人投资者不能使用它们，他们不应该依赖这种沟通。|PIMCO(Schweiz)GmbH(注册于瑞士，公司编号。瑞士苏黎世Brandschenkestrasse 41,8002，电话：+41 44 512 49 10。PIMCO Swiss GmbH提供的服务和产品不向个人投资者提供，他们不应依赖此通信，而应联系他们的财务顾问。|PIMCO Asia Pte Ltd(501Orchard Road#09-03，Singapore 238880，Wheelock Place，Singapore 238880，注册号199804652K)受新加坡金融管理局监管，是资本市场服务牌照的持有者和豁免的财务顾问。未经授权提供资产管理服务及投资产品的人士不得使用该等服务及投资产品。|PIMCO Asia Limited(香港中环金融街8号国际金融中心二期22楼2201室)获证券及期货事务监察委员会发牌，从事证券及期货条例下的第1、4及9类受规管活动。未经授权提供资产管理服务及投资产品的人士不得使用该等服务及投资产品。|PIMCO Australia Pty Ltd ABN 54084280508，AFSL 246862(PIMCO Australia)按照2001年公司法的规定向批发和零售客户提供产品和服务(仅限于零售客户的一般金融产品建议)。此信息仅供一般信息使用，不考虑任何特定投资者的目标、财务状况或需求。|PIMCO日本有限公司(日本东京市南区Toronomon Towers Office 18F，4-1-28，Toronomon，Minato-ku，105-0001)金融工具商业注册号为关东地方财政局(金融工具行)第382号。太平洋投资管理公司日本有限公司是日本投资顾问协会和日本投资信托协会的成员。PIMCO日本有限公司提供的投资管理产品和服务仅向其各自管辖范围内的人员提供，在未经授权的情况下不向提供此类产品或服务的人员提供。资产估值将根据证券价格和投资组合中衍生品交易的价值、市场状况、利率和信用风险等因素而波动。外币计价资产的投资将受到汇率的影响。不能保证投资的本金会被保留，也不能保证会实现一定的回报；投资可能会蒙受损失。所有的利润和损失都由投资者承担。每种费用和费用及其总额的数额、最高限额和计算方法将根据投资策略、投资业绩状况、管理期限和未偿还资产余额而有所不同，因此这些费用和费用", "note_en": "Understanding Investing    After government bonds, the corporate bond market is the largest section of the global bond universe. With a vast array of maturities, yields and credit quality available, investing in corporate bonds has the potential to provide higher yields than government bonds and diversification benefits for investors.\n  When companies want to expand operations or fund new business ventures, they often turn to the corporate bond market to borrow money. A company determines how much it would like to borrow and then issues a bond offering in that amount; investors that buy a bond are effectively lending money to the company according to the terms established in the bond offering or prospectus.\n Unlike equities, ownership of corporate bonds does not signify an ownership interest in the company that has issued the bond. Instead, the company pays the investor a rate of interest over a period of time and repays the principal at the maturity date established at the time of the bond’s issue.\n While some corporate bonds have redemption or call features that can affect the maturity date, most are loosely categorized into the following maturity ranges:\n  In addition to maturity, corporate bonds are also categorized by credit quality. Credit rating agencies such as Moody’s Investors Service and Standard &amp; Poor’s provide independent analysis of corporate bond issuers, grading each issuer according to its creditworthiness. Corporate bond issuers with lower credit ratings tend to pay higher interest rates on their corporate bonds.\n   Corporate bonds fall into two broad credit classifications: investment-grade and speculative-grade (or high yield) bonds. Speculative-grade bonds are issued by companies perceived to have a lower level of credit quality compared to more highly rated, investment-grade, companies. The investment-grade category has four rating grades while the speculative-grade category is comprised of six rating grades.\n  Historically, speculative-grade bonds were issued by companies that were newer, were in a particularly competitive or volatile sector or had troubling fundamentals. Today, there are also many companies whose businesses are designed to operate with the degree of leverage traditionally associated with speculative-grade companies. While a speculative-grade credit rating indicates a higher default probability, these bonds typically compensate investors for the higher risk by paying higher interest rates, or yields. Credit ratings can be downgraded if the credit quality of the issuer deteriorates or upgraded if fundamentals improve.\n  “Fallen angel” is a term that describes an investment-grade company that has fallen on hard times and has subsequently had its debt downgraded to speculative grade. “Rising star” refers to a company whose bond rating has been increased by a credit rating agency due to an improvement in the credit quality of the issuer. Since the credit rating agencies’ ratings are subjective, there are also times when they do not concur on the rating – an occurrence known as a “split rating.” Fallen angels, rising stars and split ratings may all present opportunities for investors to add additional yield by assuming greater risk due to the potential volatility of their ratings.\n  The price of a corporate bond is influenced by several factors, including the maturity, the credit rating of the company issuing the bond and the general level of interest rates.The yield of a corporate bond fluctuates to reflect changes in the price of the bond caused by shifts in interest rates and the markets’ perception of the issuer’s credit quality.Most corporates typically have more credit risk and higher yields than government bonds of similar maturities. This divergence creates a credit spread between corporates andgovernment bonds, so that the corporate bond investor earns extra yield by taking on greater risk. The credit spread affects the price of the bond and can be graphically plotted and measured as the difference between the yield of a corporate and government bond at each point of maturity.\n    Diversification: Corporates offer the opportunity to invest in a variety of economic sectors. Within the broad spectrum of corporates there is a wide divergence of risk and yield. Corporate bonds can add diversification to an equity portfolio as well as diversify a fixed income portfolio of government bonds or other fixed income securities.\n  Income: Corporates have the potential to provide attractive income. Most corporate bonds pay on a fixed semiannual schedule. One exception is zero-coupon bonds, which do not pay interest but are sold at a deep discount and then redeemed for full face value at maturity. Another exception is floating-rate bonds that have fluctuating interest rates tied to a money market reference rate such as the London Interbank Offered Rate (LIBOR) or federal funds rate. These tend to have lower yields than fixed-rate securities of comparable maturities but also less fluctuation in principal value.\n    Liquidity: Corporate bonds can be sold at any time prior to maturity in a large and active secondary trading market.\n  Similar to government bonds, corporate bonds are exposed to interest rate risk. In addition, corporate bonds also have credit or default risk - the risk that the borrower fails torepay the loan and defaults on its obligation. The level of default risk varies based on the underlying credit quality of the issuer.\n  The credit quality of a particular security or group of securities does not ensure the stability or safety of an overall portfolio. The quality ratings of individual issues/issuers are provided to indicate the credit-worthiness of such issues/issuer and generally range from AAA, Aaa, or AAA (highest) to D, C, or D (lowest) for S&amp;P, Moody’s, and Fitch respectively.\n A word about risk: Investing in the  bond market is subject to risks, including market, interest rate, issuer, credit, inflation risk, and liquidity risk. The value of most bonds and bond strategies are impacted by changes in interest rates. Bonds and bond strategies with longer durations tend to be more sensitive and volatile than those with shorter durations; bond prices generally fall as interest rates rise, and the current low interest rate environment increases this risk. Current reductions in bond counterparty capacity may contribute to decreased market liquidity and increased price volatility. Bond investments may be worth more or less than the original cost when redeemed.  Corporate debt securities are subject to the risk of the issuer’s inability to meet principal and interest payments on the obligation and may also be subject to price volatility due to factors such as interest rate sensitivity, market perception of the creditworthiness of the issuer and general market liquidity. Certain  U.S. government securities are backed by the full faith of the government. Obligations of U.S. government agencies and authorities are supported by varying degrees but are generally not backed by the full faith of the U.S. government. Portfolios that invest in such securities are not guaranteed and will fluctuate in value.  Floating rate loans are not traded on an exchange and are subject to significant credit, valuation and liquidity risk.  Equities may decline in value due to both real and perceived general market, economic and industry conditions.  Diversification does not ensure against loss.\n There is no guarantee that these investment strategies will work under all market conditions or are suitable for all investors and each investor should evaluate their ability to invest long-term, especially during periods of downturn in the market.\n  This material has been distributed for informational purposes only and should not be considered as investment advice or a recommendation of any particular security, strategy or investment product. Investors should consult their investment professional prior to making an investment decision. Information contained herein has been obtained from sources believed to be reliable, but not guaranteed.\n PIMCO provides services only to qualified institutions and investors. This is not an offer to any person in any jurisdiction where unlawful or unauthorized. |  Pacific Investment Management Company LLC, 650 Newport Center Drive, Newport Beach, CA 92660 is regulated by the United States Securities and Exchange Commission. |  PIMCO Investments LLC, U.S. distributor, 1633 Broadway, New York, NY, 10019 is a company of PIMCO. |  PIMCO Europe Ltd (Company No. 2604517), PIMCO Europe, Ltd Amsterdam Branch (Company No. 24319743), and PIMCO Europe Ltd - Italy (Company No. 07533910969) are authorised and regulated by the Financial Conduct Authority (25 The North Colonnade, Canary Wharf, London E14 5HS) in the U.K. The Amsterdam and Italy branches are additionally regulated by the AFM and CONSOB in accordance with Article 27 of the Italian Consolidated Financial Act, respectively. PIMCO Europe Ltd services and products are available only to professional clients as defined in the Financial Conduct Authority’s Handbook and are not available to individual investors, who should not rely on this communication. |  PIMCO Deutschland GmbH (Company No. 192083, Seidlstr. 24-24a, 80335 Munich, Germany) is authorised and regulated by the German Federal Financial Supervisory Authority (BaFin) (Marie-Curie-Str. 24-28, 60439 Frankfurt am Main) in Germany in accordance with Section 32 of the German Banking Act (KWG). The services and products provided by PIMCO Deutschland GmbH are available only to professional clients as defined in Section 31a para. 2 German Securities Trading Act (WpHG). They are not available to individual investors, who should not rely on this communication. |  PIMCO (Schweiz) GmbH (registered in Switzerland, Company No. CH-020.4.038.582-2), Brandschenkestrasse 41, 8002 Zurich, Switzerland, Tel: + 41 44 512 49 10. The services and products provided by PIMCO Switzerland GmbH are not available to individual investors, who should not rely on this communication but contact their financial adviser. |  PIMCO Asia Pte Ltd (501 Orchard Road #09-03, Wheelock Place, Singapore 238880, Registration No. 199804652K) is regulated by the Monetary Authority of Singapore as a holder of a capital markets services licence and an exempt financial adviser. The asset management services and investment products are not available to persons where provision of such services and products is unauthorised. |  PIMCO Asia Limited (Suite 2201, 22nd Floor, Two International Finance Centre, No. 8 Finance Street, Central, Hong Kong) is licensed by the Securities and Futures Commission for Types 1, 4 and 9 regulated activities under the Securities and Futures Ordinance. The asset management services and investment products are not available to persons where provision of such services and products is unauthorised. |  PIMCO Australia Pty Ltd ABN 54 084 280 508, AFSL 246862 (PIMCO Australia) offers products and services to both wholesale and retail clients as defined in the Corporations Act 2001 (limited to general financial product advice in the case of retail clients). This communication is provided for general information only without taking into account the objectives, financial situation or needs of any particular investors. |  PIMCO Japan Ltd (Toranomon Towers Office 18F, 4-1-28, Toranomon, Minato-ku, Tokyo, Japan 105-0001) Financial Instruments Business Registration Number is Director of Kanto Local Finance Bureau (Financial Instruments Firm) No. 382. PIMCO Japan Ltd is a member of Japan Investment Advisers Association and The Investment Trusts Association, Japan. Investment management products and services offered by PIMCO Japan Ltd are offered only to persons within its respective jurisdiction, and are not available to persons where provision of such products or services is unauthorized. Valuations of assets will fluctuate based upon prices of securities and values of derivative transactions in the portfolio, market conditions, interest rates and credit risk, among others. Investments in foreign currency denominated assets will be affected by foreign exchange rates. There is no guarantee that the principal amount of the investment will be preserved, or that a certain return will be realized; the investment could suffer a loss. All profits and losses incur to the investor. The amounts, maximum amounts and calculation methodologies of each type of fee and expense and their total amounts will vary depending on the investment strategy, the status of investment performance, period of management and outstanding balance of assets and thus such fees and expenses cannot be set forth herein. |  PIMCO Canada Corp. (199 Bay Street, Suite 2050, Commerce Court Station, P.O. Box 363, Toronto, ON, M5L 1G2) services and products may only be available in certain provinces or territories of Canada and only through dealers authorized for that purpose. |  PIMCO Latin America Edifício Internacional Rio Praia do Flamengo, 154 1o andar, Rio de Janeiro – RJ Brasil | No part of this publication may be reproduced in any form, or referred to in any other publication, without express written permission. PIMCO is a trademark of Allianz Asset Management of America L.P. in the United States and throughout the world. ©2016, PIMCO", "posttime": "2020-05-11 02:50:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "理解,corporate", "title": "理解公司债券", "title_en": "Understanding Corporate Bonds", "transed": 1, "url": "https://nl.pimco.com/en-nl/resources/education/understanding-corporate-bonds", "via": "", "real_tags": ["理解", "corporate"]}, {"category": "", "categoryclass": "", "imagename": "fdf104b1288db0076ff40f0a9dab91e1.jpeg", "infoid": 1001559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-特斯拉公司(TSLA.O)周六起诉加州地方当局，这家电动汽车制造商推动重新开放那里的工厂，首席执行官埃隆·马斯克(Elon Musk)威胁要将特斯拉的总部和未来的项目从该州搬到德克萨斯州或内华达州。\n马斯克一直在推动重新开放特斯拉位于加利福尼亚州弗里蒙特的工厂，此前阿拉米达县卫生部门表示，该汽车制造商不得重新开放，因为当地遏制冠状病毒传播的封锁措施仍然有效。\n在周六的一篇博客文章中，特斯拉表示，该县的立场让它别无选择，只能采取法律行动，以确保特斯拉及其员工能够重返工作岗位。\n该公司表示，它已经制定了一项彻底的重返工作计划，其中包括对人员进行在线视频培训，工作区隔断区域，温度筛查，穿戴防护设备的要求，以及严格的清洁和消毒协议。\n该公司表示，已将重启计划通知了弗里蒙特工厂所在的阿拉米达县的卫生当局，但声称代理官员没有回复电话或电子邮件。\n阿拉米达县公共卫生部周六早些时候表示，它一直在“直接沟通，并与特斯拉团队密切合作”，但没有立即回复记者的置评请求。\n特斯拉周六在旧金山联邦法院对该县提起诉讼，称持续的限制措施是该县的一种“夺权行为”，因为加州州长周四曾表示，该州的制造商将被允许重新开张。\n诉讼称，该公司表示，阿拉米达违反了联邦和加州宪法，并藐视州长的命令。\n阿拉米达县计划一直关闭到5月底，只允许必要的企业重新开放。该县表示，它不认为特斯拉是一项必要的业务。县官员没有立即回复对这起诉讼的置评请求。\n周六，直言不讳的马斯克也在Twitter上抱怨，并威胁要离开该州。\n他在推特上写道：“如果我们甚至保留弗里蒙特的制造活动，这将取决于特斯拉未来受到的待遇。”他指的是旧金山湾区的设施，这是特斯拉在美国唯一的汽车工厂。\n阿拉米达县周六表示，它一直在与特斯拉合作制定一项安全计划，该计划“允许重新开工，同时保护在该工厂工作的数千名员工的健康和福祉”，并表示期待很快就安全计划达成协议。\n弗里蒙特市长莉莉·梅(莉莉·梅)对继续实施原地避难所订单而没有为特斯拉等制造商恢复提供资金的潜在经济影响表示担忧。周六，梅敦促该县与企业合作，制定“可接受的重新开业指导方针”。\n马斯克周四告诉员工，弗里蒙特的有限生产将于周五下午重新开始。\n特斯拉去年在弗里蒙特工厂生产了近50万辆汽车，搬迁整个生产设施将是一项艰巨的任务。\n韦德布什分析师丹·艾夫斯(Dan Ives)周六估计，该公司可能需要12至18个月的时间来搬迁生产。\n特斯拉发出搬迁工厂的威胁之际，正值特斯拉计划提高弗里蒙特Y型运动型多功能车(SUV)的产量，预计这将产生创纪录的需求和利润率。\n马斯克曾在3月份与加州官员就特斯拉是否必须停止在弗里蒙特生产一事发生争执，他批评了封锁和留在家中的命令，称它们是对美国企业的“严重风险”，是“违宪的”。\n自3月18日以来，特斯拉股价已上涨127%，为近期收盘低点，其中包括最近一个交易周的涨幅16.8%，周五收于819.42美元。", "note_en": "(Reuters) - Tesla Inc (  TSLA.O) sued local authorities in California on Saturday as the electric carmaker pushed to re-open its factory there and Chief Executive Elon Musk threatened to move Tesla’s headquarters and future programs from the state to Texas or Nevada.\n Musk has been pushing to re-open Tesla’s Fremont, California, factory after Alameda County’s health department said the carmaker must not reopen because local lockdown measures to curb the spread of the coronavirus remain in effect.\n In a blog post on Saturday, Tesla said the county’s position left it no choice but to take legal action to ensure Tesla and its employees can go back to work.\n The company said it had worked out a thorough return-to-work plan that includes online video training for personnel, work zone partition areas, temperature screening, requirements to wear protective equipment and rigorous cleaning and disinfecting protocols.\n The company said it had informed health authorities in Alameda County, where the Fremont factory is located, about its restart plans, but claimed the acting official did not return calls or emails.\n Alameda County’s Public Health Department, which earlier on Saturday said it had been “communicating directly and working closely with the Tesla team,” did not immediately respond to a request for comment.\n Tesla filed a lawsuit against the county in San Francisco federal court on Saturday, calling the continued restrictions a “power-grab” by the county since California’s governor had said on Thursday that manufacturers in the state would be allowed to reopen.\n The company said Alameda was going against the federal and California constitutions, as well as defying the governor’s order, the lawsuit said.\n  Alameda County is scheduled to remain shut until the end of May, with only essential businesses allowed to reopen. The county said it does not consider Tesla an essential business. County officials did not immediately respond to a request for comment on the lawsuit.\n The outspoken Musk also took to Twitter on Saturday to complain and threatened to leave the state.\n “If we even retain Fremont manufacturing activity at all, it will be dependen (sp) on how Tesla is treated in the future,” he tweeted, referring to the San Francisco Bay area facility that is Tesla’s only U.S. vehicle factory.\n Alameda County said on Saturday that it has been working with Tesla to develop a safety plan that “allows for reopening while protecting the health and well-being of the thousands of employees” that work at the factory and that it looks forward to coming to an agreement on a safety plan very soon.\n Fremont Mayor Lily Mei expressed concern about the potential economic implications of continuing the shelter-in-place order without provisions for manufacturers such as Tesla to resume. Mei on Saturday urged the county to work with businesses on “acceptable guidelines for re-opening.”\n Musk had told employees on Thursday that limited production would restart at Fremont on Friday afternoon.\n Tesla last year built nearly half a million vehicles at the Fremont plant and moving the entire production facility would be a massive undertaking.\n Dan Ives, a Wedbush analyst, on Saturday estimated it could take the company 12 to 18 months to relocate production.\n  The threat to relocate the facility comes as Tesla aims to ramp up production at Fremont of its Model Y sport utility vehicle, which it expects to generate record demand and profit margins.\n Musk, who sparred with California officials in March over whether Tesla had to halt production at Fremont, had criticized the lockdown and stay-at-home orders, calling them a “serious risk” to U.S. business and “unconstitutional.”\n Tesla shares have risen 127% since March 18, their recent closing low, including a 16.8% gain in the last trading week to close at $819.42 on Friday.", "posttime": "2020-05-11 02:36:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,诉讼,files,计划", "title": "特斯拉提起诉讼，要求重新开放工厂，马斯克面临批评", "title_en": "Tesla Files Lawsuit Demanding Reopening of Plant As Musk Faces Criticism", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-tesla/tesla-sues-california-county-in-virus-factory-closure-fight-threatens-to-leave-idUSKBN22L0S5", "via": "", "real_tags": ["特斯拉", "诉讼", "files", "计划"]}, {"category": "", "categoryclass": "", "imagename": "570c10d39146de61ff18967ddd14cf3a.jpg", "infoid": 1001558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是伊布卢斯描述的神奇的多腿动物，它被附加在法国版的利奥·非洲人身上，很可能是由Thevet复制的，毫无疑问是由Paré复制的。\n它甚至被被切断的四肢包围--但是别担心，它会修复它们的！\n有人请我(我雇来的人要求)确切地解释一下，像“利维坦”这样的词条是如何最终被误读并腐化成“kuyūtha”甚至“rakaboúna”的。我相信一定会有一些人(想必一只手少了几个手指)对词源、语言以及怪物是如何在这些基础上进化的感兴趣的。\n阿拉伯语很难读懂。为什么？嗯，首先，有不同的书写方式，不同的类型、文本、字体大小(可以这么说)。例如，看看这个。\n漂亮易读的文字，现代的阿尔瓦迪印刷术。简单的农民。然后你会得到更老的版本，比如这个版本的al-Qazwini。\n可读性稍差一些，但仍可读。但是当你看到这个版本的al-Damiri时，你需要看到整个页面才能获得全面的影响。\n你的眼睛没有欺骗你。方框里的文字是al-Damiri。页边空白处的文字是al-Qazwini创作的奇迹。没错，两本书只卖一本，都是用可爱的小螃蟹笔迹写的！\n当然，还有那些漂亮的手稿，上面有华丽的文字，我几乎看不懂。\n下一个问题是语言本身。阿拉伯语的元音字母很少。大多数元音都用变音符号表示。\n你猜怎么着？大多数时候他们甚至不写变音符号！基于此，Kuyutha，Kiyutha，Kayutha，Kuyuthan，Kayuthan，Kiyuthan根据分配的元音都是同等有效的。结尾的“an”可以是字母，也可以是变音符号--如果是字母，它肯定在那里，如果它是变音符号，那么它就在那里，这是有争议的。\n不仅如此，根据写作质量，K和L可以看起来相同，Y和B可以看起来相同(因此Kuyuban)，T和TH和N可以看起来相同…。所以把它和平均元音移动(山楂)结合起来，你就可以拼凑出利维坦是如何被乱码变成kuyūtha的。\n“但是Rakaboúna呢？”我听到你说。“你甚至在参赛作品中用”搞笑但可以理解“来形容它！”\n嗯，是的。是的。这种误读是佩伦独有的，他把他的翻译归功于al-Damiri，你可能记得这是一篇微不足道的文字。我承认我无法理解他是如何从“KuyūTha”中找到“Rakaboúna”的，直到我从上下文中看出来，这一切都是有意义的。以下是实际部分：\n我已经强调了“公牛的名字是kuyūtha”。看到课文有多挤了吗？原来Perron把“Bull”(Thawr)的最后一个字母“Bull”(即R)粘在了公牛的名字上。然后他继续把Y读成B，把TH读成N，给出了“Rakaboúna”。以下是魔术是如何发生的：\n现在你就知道了。这头可怜的宇宙公牛被赋予了越来越离奇的绰号，而实际上，它应该只是被称为庞然大物，可怜的牛。\n我们的想象力一直是我们最大的盟友，也是我们最大的敌人。面对未知，我们用各种形状和大小的生物填充了它，从微小的灵魂到巨大的宇宙怪物。自从我们赢得了好奇的能力以来，这些实体就已经分享了我们的世界。\n官方生物参赛作品上的所有艺术品和文字均为©生物之书。版权所有。\n不是我的图像和文本(通常在旁白中)在适用的情况下或在公共领域中被视为其各自的所有者，并在任何可能的情况下记入贷方。不属于我的图片的使用属于“合理使用”(如果有任何问题，请告诉我！)。\n输入您的电子邮件地址以跟踪此博客，并通过电子邮件接收新帖子的通知。", "note_en": "Here it is, the miraculous multi-legged animal described by Iambulus, appended to a French version of Leo Africanus, and copied probably by Thevet and unquestionably by Paré.\n  It’s even surrounded by severed limbs – but don’t worry, it’ll fix ‘em!\n      I have been requested (by someone who I hire to request) to explain how, exactly, something like “Leviathan” could end up misread and corrupted into “Kuyūtha” or even “Rakaboûna”. And I’m sure there are some people out there (presumably countable on one hand missing several fingers) who are interested in etymology, language, and how monsters evolve based on those.\n  Arabic is tricky to read. Why? Well, for a start there’s different ways of writing it, different types, texts, font sizes (as it were). Look at this, for instance.\n  Nice and legible text, modern printing of al-Wardi. Easy peasy. Then you get older copies like this version of al-Qazwini.\n  Slightly less legible, but still readable. But then you get to this version of al-Damiri, and, well, you need to see the whole page to get the full impact.\n  Your eyes aren’t deceiving you. The text in the box is al-Damiri. The text in the margins is the  Wonders of Creation by al-Qazwini. That’s right, two books for the price of one, all in lovely tiny crabbed handwriting!\n And then of course there’s the lovely manuscripts with the flowery text which I can barely decipher.\n   The next issue is the language itself. There are few vowel letters in Arabic. Most vowel sounds are represented with diacritics.\n And guess what? Most times they don’t even write the diacritics! So just based on that, Kuyutha, Kiyutha, Kayutha, Kuyuthan, Kayuthan, Kiyuthan are all equally valid based on the vowels assigned. The “an” at the end can be either a letter or a diacritic – if it’s a letter it’s definitely there, if it’s a diacritic it’s debatably there.\n Not only that, but based on the quality of the writing, K and L can look identical, Y and B can look identical (hence Kuyuban), T and TH and N can look identical… So combine that with the average vowel movements (haw haw) and you can piece together how Leviathan could get garbled into Kuyūtha.\n  “But what about Rakaboûna?” I hear you say. “You even describe it as “hilarious but understandable” in your entry!”\n Well, yes. Yes it is. This misreading is unique to Perron, and he attributes his translation to al-Damiri, which you may remember as being teeny-tiny-textual. I’ll admit I couldn’t figure out how he got “Rakaboûna” out of “Kuyūtha”, until I saw it in context and it all made sense. Here’s the actual part:\n  I’ve highlighted “and the name of the bull [is] Kuyūtha”. See how cramped the text is? Turns out Perron glued the last letter of “bull” ( thawr), which is an R, to the name of the bull. Then he proceeded to read the Y as B and the TH as N, giving “Rakaboûna”. Here’s how the magic happened:\n  And there you have it. The poor cosmic bull got saddled with increasingly bizarre monikers, when in reality it should have just been called Behemoth, poor bovine.\n  Our imagination has always been our greatest ally, and our worst enemy. In the face of the unknown, we populated it with creatures of all shapes and sizes, from minuscule spirits to gigantic cosmic monsters. These entities have shared our world ever since we earned the capacity to wonder.\n    All artwork and text on the official creature entries are © A Book of Creatures. All rights reserved.\n Images and text not by me (typically in the asides) are © their respective owners where applicable or in the public domain, and are credited whenever possible. The usage of images that are not mine goes under “Fair Use” (if there are any issues let me know!)\n     Enter your email address to follow this blog and receive notifications of new posts by email.", "posttime": "2020-05-11 02:35:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "book,文字", "title": "“生物之书”(The Book Of Creatures)", "title_en": "A Book of Creatures", "transed": 1, "url": "https://abookofcreatures.com/", "via": "", "real_tags": ["book", "文字"]}, {"category": "", "categoryclass": "", "imagename": "5c1b51bd4cef10099b7cf35b0dd67325.png", "infoid": 1001557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "@Dyras也许应该有关于风险的警告？大多数Signal用户基于对同行评审和使用Signal的开放密语系统的信任。据我所知，OWS的理念是没有强大的用户，让私人交流变得流行的唯一方法是假设大多数用户不了解这些东西是如何工作的。我会假设(我的用户不是开发人员)，既然您把它放在那里，就意味着可以安全地使用它。也许你不知何故把它改成了无名氏之类的。没人料到会有这样的陷阱。至少应该有个警告。", "note_en": "@Dyras maybe there should be a warning about the risk? Most of Signal users base on a trust to peer review and Open Whisper Systems using Signal. As i understood, OWS&#39;s philosophy is that there are no powerusers and the only way to make private communication popular is to assume, that most of users don&#39;t understand how these things work. I&#39;d assume (i&#39;m user not dev), that since you&#39;ve put it there it means that it&#39;s safe to use it. Maybe you somehow anonimized it or whatever. Nobody expect such a trap. There should be at least a warning.", "posttime": "2020-05-11 02:19:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拼写,spellcheck,假设", "title": "启用拼写检查是隐私风险(2016)", "title_en": "Leaving Spellcheck Enabled Is a Privacy Risk (2016)", "transed": 1, "url": "https://github.com/signalapp/Signal-Desktop/issues/824", "via": "", "real_tags": ["拼写", "假设"]}, {"category": "", "categoryclass": "", "imagename": "342a95b3397cd1f6910fff42ab7c3fc5.png", "infoid": 1001556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当今计算机体系结构的广泛多样性需要一种新的软件开发方法。OpenMM是一个分子力学模拟框架，允许单个程序在各种硬件平台上高效运行。\n当今的计算机体系结构正处于快速发展和多样化的时期。十年前，大多数程序都运行在传统的单核处理器上，能够一次执行一个线程。在过去的十年里，那些简单的CPU已经被一系列多核CPU、1专用加速器(如Cell Broadband Engine)、2和所谓的图形处理单元(Graphics Processing Unit)所取代，这些处理器实际上能够进行强大的通用计算。3未来这一趋势可能会持续下去。很难预测短短五年后会有哪些架构可用，也很难预测哪些编程模型最适合利用它们。\n这给所有程序员带来了两难境地，尤其是对那些科学和工程领域的程序员来说。一方面，他们的计算需求往往是极端的，涉及只能在巨大的超级计算集群上运行的模拟或其他类型的计算。另一方面，他们用于开发软件的资源通常相当有限。为单一架构编写和优化所有必需的软件是一项挑战。为几个差异很大的体系结构重复该任务是完全不可能的。\n在某些方面，这种情况类似于计算机工业的早期，当时程序是用每台计算机的母语编写的。不同的处理器有不同的指令集，因此将程序移植到新的计算机上需要完全重写它。编译器通过在程序员和硬件之间引入抽象层解决了这个问题：程序可以用高级指令编写，这些指令可以自动转换成任何需要的处理器的机器语言。\n只要所涉及的处理器在功能和操作模式上都是基本相似的，这个方案就能很好地工作。当处理器差异太大时，它就会停止工作。例如，期望针对单核CPU和大规模并行GPU高效编译单个源代码是不合理的。这些体系结构需要完全不同的算法才能有效地执行相同的计算，这超出了任何现有编译器的范围。\n真正需要的是另一个抽象层，将程序员与其代码在其上运行的硬件隔离；不仅是它的指令集，而且是它的基本功能。人们应该能够使用适用于手头问题的高级概念来表达要解决的问题，而不需要指定使用什么特定的算法。然后，抽象层应该自动选择最适合当前可用硬件的那些概念的实现。这种方法已经在许多情况下成功使用，其中两个最突出的例子是用于线性代数的LAPACK4和用于3D图形的OpenGL 5。\n为了在特定的分子模拟领域实现这一目标，我们开发了OpenMM，这是一个在高性能计算体系结构上执行分子力学的库。它允许程序员使用高级的、独立于硬件的API编写他们的程序。然后，这些程序无需修改即可在任何支持API的硬件上运行。原则上，这可以是任何东西，从低端的单个CPU核心，到每个节点上都有多个CPU核心和GPU的大型超级计算集群。\n让我们详细考虑这些需求，看看它们是如何在OpenMM中实现的。\n在任何接口中，选择正确的抽象级别都是至关重要的。目标是确定问题的哪些方面应该由用户确定，哪些应该留给库来确定。太高的抽象级别会使库变得毫无用处：问题描述的某些方面是用户真正关心的，如果接口不允许他们准确地描述这些方面，他们就不能使用它。另一方面，太低的抽象级别限制了库在各种硬件上高效实现问题的能力。如果要求用户指定实际上对他们并不重要的实现细节，例如用于执行计算的特定算法，则不再有自动选择更适合可用硬件的不同算法的选项。\n在分子力学中，用户通常想要用势函数、约束、时间积分、温度耦合方法等来描述要解决的问题。他们应该能够指定这些，而不必描述，例如，使用什么方法来评估势函数。换一种略微不同的方式来表达，用户关心的是方程式，而不是算法。理想的界面应该允许用户指定他们想要建模的数学系统，同时让库以适当的方式自由地对该系统进行数值评估。\n即使接口没有显式定义如何实现计算，它也可以很容易地限制实际实现的范围。需要非常小心地确保API的任何功能都不会不必要地限制可以在其上使用的硬件平台。\nOpenMM中的一个示例是用于访问状态信息的机制。分子力学模拟涉及关于被模拟系统当前状态的各种数据：原子的位置和速度、作用在它们上的力等。传统上，模拟代码将这些值表示为内存中的数组。例如，当程序需要检查原子的位置时，它只需查看适当的数组元素。对于习惯使用这种代码的开发人员来说，访问原子位置的自然而明显的API将是一个获取原子索引并返回“该原子的当前位置”的例程。\n不幸的是，该API不可能在许多架构上有效实现。例如，当在GPU上进行计算时，原子位置存储在设备内存中，将它们传输到主机内存是一项相对昂贵的操作。对于原子位置分布在网络上的许多不同计算机的集群来说，问题甚至更严重。任何假定可以随时快速、随机地访问原子位置的程序，在这些系统上的运行速度都会非常慢。\nOpenMM通过显式地不直接访问状态数据来解决这个问题。相反，用户调用一个例程来创建State对象，预先指定应该存储在该对象中的所有信息。这有两个好处。首先，因为OpenMM事先知道用户将要请求的全套信息，所以它可以通过几个批量操作高效地收集这些信息。其次，用户意识到他们正在执行昂贵的操作，因此将仔细考虑他们何时以及如何访问状态数据。他们不会被看似微不足道的API调用(例如“获得ATOM 5的位置”)所误导，而这些API调用实际上很昂贵。\n如果这类库要想成功，它必须将接口和实现之间的划分作为其设计的一个基本方面。程序的作者应该不需要指定要使用什么实现。当程序运行时，它应该自动选择最适合可用硬件的任何实现。同时，它还应该允许程序查询可用的实现并手动选择要使用的实现。例如，程序的用户有时可能希望在主CPU上执行计算，其他时间则在GPU上执行计算。\n同样重要的是可扩展性。随着新硬件的出现，新的实施将是必要的。不可能枚举所有可能的实现，并且接口不能尝试这样做。它必须是可扩展的，这样就可以独立于主库编写新的实现，并且现有程序无需修改就可以使用它们。\nOpenMM通过插件架构实现了这一点。每个实现(或“平台”)都是作为动态库分发的，只需将其放在特定目录中即可安装。在运行时，将加载该目录中的所有库，并使其可供程序使用。\n它还提供了一种不同类型的可扩展性：插件不仅可以实现新平台，还可以向现有平台添加新功能。重要的是要理解，OpenMM不仅仅是一个用于执行某些计算的库；它还是一个旨在统一整个问题域的体系结构框架。虽然该库内置了特定的功能(例如，特定的潜在功能和集成方法)，但它也允许通过插件添加其他功能。我们的目标是提供一个框架，在这个框架内几乎可以实现任何分子力学计算。\n我们现在考虑如何创建满足这些目标的体系结构。OpenMM基于分层的体系结构，如图1所示。最高级别是公共API，开发人员在自己的应用程序中使用OpenMM时使用该API进行编程。在任何这样的库中，公共API必须以与问题领域(例如分子力学)相关的术语来表达概念，而不涉及这些概念是如何实现的。在OpenMM中，这些概念是粒子、力、时间积分方法等。例如，Force对象指定粒子之间交互的数学形式，但不规定用于计算它的特定算法。\n公共API通过调用较低级别的API来实现，该较低级别的API充当独立于平台的问题描述和依赖于平台的计算内核之间的接口。OpenMM将这个低级API表示为一组抽象的C++类，每个类定义一个要完成的特定计算。请注意这两个接口所扮演的非常不同的角色：公共API由核心OpenMM库实现，由用户调用；低级API由插件实现，由核心OpenMM库调用。\n在体系结构的最低层是计算内核的实际实现。这些代码可以用任何语言编写，并使用适用于它们在其上执行的硬件的任何技术。例如，它们可能使用诸如CUDA或OpenCL之类的技术来实现GPU计算，使用Pthread或OpenMP来实现并行CPU计算，使用MPI来跨集群中的节点分配工作，等等。\n这就留下了选择和调用低级API实现的关键任务。对于OpenMM，这意味着实例化定义每个内核的抽象类的具体子类。此任务由平台对象协调，该对象充当计算内核的工厂。公共API的每个类查询平台以获得它所需的每个内核的具体实例，然后使用该实例执行其计算。因此，选择使用哪种实现完全包括选择使用哪种平台。程序也可以选择不指定平台，在这种情况下，根据可用的硬件自动选择一个平台。\n实际上，安排要稍微复杂一些。平台不直接创建内核，而是将任务委托给一个或多个KernelFactory对象。这就是插件向现有平台添加新功能的方式：它定义一个计算内核，创建一个可以创建内核实例的KernelFactory，并将工厂添加到平台。当平台稍后被要求创建该内核的实例时，它使用新的KernelFactory来执行此操作。\n我们现在考虑一个具体的例子，说明这个体系是如何在实践中工作的：分子系统中原子之间非键相互作用的计算。在大多数模拟中，这占了大部分处理时间，因此对其进行很好的优化是非常重要的。\n在设计用来在CPU上运行的传统代码中，有一些成熟的技术可以有效地做到这一点。7首先建立一个邻居列表，该列表显式地枚举每一对足够接近相互作用的原子。通过使用基于体素的方法，这可以在O(N)时间内完成。然后循环邻居列表中的所有原子对，并计算它们之间的相互作用。OpenMM的参考平台(编写为在单个CPU线程上运行)就是以这种方式工作的。\n不幸的是，由于需要间接内存访问，GPU上的邻居列表效率非常低。对于每个邻居列表条目，必须加载有关所涉及的两个原子的信息(位置、电荷等)。由连续线程处理的原子的索引不需要遵循任何模式，因此不能合并存储器访问。\n因此，我们开发了一种更适合在GPU上运行的替代方法。我们把全套原子分成32个一组的块。然后，如图2所示，这组N2相互作用被分成(N/32)2个平铺，每个平铺都涉及两个原子块之间的相互作用。为了处理瓦片，我们将所涉及的64个原子的数据加载到共享内存中，计算它们之间的所有1024个相互作用，最后将产生的力和能量写出到全局内存。代替传统的邻居列表，我们使用了包含交互的瓦片列表：有效地，指定了32个原子的哪些块交互的邻居列表。其他研究人员也开发了在GPU上计算非绑定交互的算法。-11。\n我们的方法是为在NVIDIA GPU上使用而设计的，每个块(32个原子)的大小被选择为与这些处理器的SIMD宽度相匹配。使其适应其他类型的处理器，甚至其他GPU，都需要对算法进行修改。例如，某些AMD GPU的SIMD宽度为64，因此必须以不同的方式在平铺之间分配线程才能获得最高效率。\n因此，我们需要几种完全不同的算法来在不同的硬件上高效地实现相同的计算。然而，值得注意的是，算法的选择仅取决于硬件，而不取决于所计算的力的精确形式。在分子模拟中，有许多不同的数学形式用于表示非键相互作用，不同的数学形式包括范德华相互作用的建模方式、截止点的平滑、溶剂筛选效应等。这些都是科学家在运行模拟时真正关心的重要区别。理想情况下，程序员应该能够选择交互的函数形式，并且仍然使用可用硬件的最有效算法来计算它们。用户应指定要使用的方程式，库应确定如何最好地评估这些方程式。\nOpenMM通过其CustomNonbondedForce类实现此目标。此类允许用户为原子之间的成对能量指定任意数学函数。该函数可能取决于任意一组原子参数和列表函数，以及各种标准数学函数。例如，以下代码行创建CustomNonbondedForce来计算Lennard-Jones 12-6交互作用：\n第一行指定作为距离r的函数的相互作用的能量：\n其中，使用Lorentz-Bertelot组合规则合并来自两个相互作用原子的参数：σ的算术平均值和ε的几何平均值。接下来的两行指定参数“sigma”和“epsilon”应该与每个原子相关联。\nOpenMM现在的任务是在各种硬件平台上高效地实现这一点。它首先解析用户指定的表达式，然后解析微分能量以确定力的表达式。然后将每个表达式转换为指令序列。为了计算表达式，引用和CUDA实现循环遍历指令并执行每个指令，从而有效地充当内部语言的解释器。\n对于基于OpenCL的实现，更好的解决方案是可能的。因为OpenCL允许在运行时从源代码编译程序，12所以可以使用插入到适当的硬件特定算法中的用户定义的数学表达式来合成内核。然后，内核被编译成设备的机器码，消除了解释表达式的成本，并产生了几乎与整个内核都是手工编写的一样快的性能。\n我们强调，这种方法在我们的代码中允许极大的灵活性，允许快速开发的强大组合(即，可以很容易地更改粒子之间交互的关键底层方程)，同时仍然保持快速执行(因为底层优化，特别是使用OpenCL，允许最小的开销)。这为我们的代码打开了新用途的大门，特别是在模拟粒子相互作用的新方法的快速发展方面，例如用于分子模拟的新的隐式溶剂模型。\n我们实现了与分子模拟中所有最广泛使用的能量项相对应的力类：各种键合力，用于非键相互作用的Lennard-Jones和Coulomb力，用于长程库仑力的Ewald求和和粒子网格Ewald，以及广义Born隐式溶剂模型。OpenMM还包括几种时间整合方法和实施距离约束的能力。这些功能在三个不同的平台上实现：用C++编写的参考平台，用于NVIDIA GPU的基于CUDA的平台，以及用于各种GPU和CPU的基于OpenCL的平台。\n我们之前已经发布了在模拟各种蛋白质时CUDA实现的基准。在显性溶剂(共73,886个原子)中模拟318个残基蛋白质时的速度为5 ns/d，在隐式溶剂中模拟33个残基蛋白质(共544个原子)时的速度为576 ns/d。我们还将其与几个广泛使用的分子动力学软件包在模拟显式溶剂中的80个残基蛋白质时的单CPU核心性能进行了比较。结果发现，它比Gromacs快6.4倍，比NAMD快28倍，比Amber快59倍。(GPU计算在NVIDIA GTX280上运行，CPU计算在3.0 GHz Intel Core 2 Duo上运行。)。\nOpenMM的最新功能是自定义力，它允许用户指定力的形式的任意代数表达式。除了上述CustomNonbondedForce之外，还有一个用于键合相互作用的CustomBondForce，用于独立施加到每个原子的力的CustomExternalForce，以及支持多种隐式溶剂模型的CustomGBForce。这些在OpenCL平台上最有用，因为它允许在性能损失很小的情况下使用它们。在初步测试中，我们发现使用CustomNonbondedForce实现的Coulomb和Lennard-Jones力仅比标准的手工编码实现慢约4%。这意味着，没有GPU编程经验的科学家仍然可以为他们的非绑定交互实现任意函数形式，并获得几乎与手动调整的GPU代码一样好的性能。\n计算机架构的快速、持续变化。\n..", "note_en": "The wide diversity of computer architectures today requires a new approach to software development. OpenMM is a framework for molecular mechanics simulations, allowing a single program to run efficiently on a variety of hardware platforms.\n Computer architectures today are in a period of rapid advancement and diversification. A decade ago, most programs were run on conventional, single core processors capable of executing one thread at a time. In the last ten years, those simple CPUs have been replaced by an array of multi-core CPUs,  1 dedicated accelerators such as the Cell Broadband Engine,  2 and so-called Graphics Processing Units that are actually capable of powerful, general purpose computation.  3 This trend is likely to continue in the future. It is difficult to predict what architectures will be available as little as five years from now, or what programming models will be best suited to exploiting them.\n This creates a dilemma for all programmers, but especially for those in science and engineering. On the one hand, their computing needs are often extreme, involving simulations or other types of calculations that can only be run on enormous supercomputing clusters. On the other hand, their resources for developing software are usually quite limited. Writing and optimizing all the necessary software for a single architecture is a challenge. Repeating the task for several widely differing architectures is completely out of the question.\n In some ways, this situation is analogous to the early days of the computer industry when programs were written in each computer’s native machine language. Different processors had different instruction sets, so porting a program to a new computer required completely rewriting it. Compilers solved this problem by introducing an abstraction layer between the programmer and the hardware: programs could be written in terms of higher level instructions, and those could automatically be transformed into the machine language of any processor desired.\n This scheme works well as long as the processors involved are all fundamentally similar in their capabilities and operating models. When the processors differ too much, it ceases to work. For example, it is unreasonable to expect a single piece of source code to be compiled efficiently for both a single core CPU and a massively parallel GPU. These architectures require fundamentally different algorithms to perform the same calculation efficiently, and that is beyond the scope of any existing compiler.\n What is really required is another abstraction layer to isolate the programmer from the hardware their code is running on; not just its instruction set, but its fundamental capabilities. One should be able to express the problem to solve using high level concepts appropriate to the problem at hand without needing to specify what particular algorithms to use. The abstraction layer should then automatically select an implementation of those concepts most appropriate to the currently available hardware. This approach has been used successfully in a number of cases, two of the most prominent examples being LAPACK  4 for linear algebra and OpenGL  5 for 3D graphics.\n To address this goal within the specific domain of molecular simulation, we have developed OpenMM, a library for performing molecular mechanics on high performance computing architectures.   It allows programmers to write their programs using a high level, hardware independent API. Those programs can then run without modification on any hardware that supports the API. In principle, that could be anything from a single CPU core at the low end, up to a large supercomputing cluster with multiple CPU cores and GPUs on each node.\n    Let us consider each of these requirements in detail, and see how they are implemented in OpenMM.\n In any interface, it is critical to choose the right level of abstraction. The goal is to identify which aspects of the problem should be determined by the user, and which should be left to the library to determine. Too high a level of abstraction will make the library useless: there are certain aspects of the problem description that the user genuinely cares about, and if the interface does not allow them to precisely describe those aspects, they cannot use it. On the other hand, too low a level of abstraction restricts the library’s ability to implement the problem efficiently on a variety of hardware. If the user is required to specify implementation details that are not actually important to them, such as specific algorithms for performing calculations, there is no longer an option to automatically pick a different algorithm better suited to the available hardware.\n In molecular mechanics, the user typically wants to describe the problem to solve in terms of potential functions, constraints, time integrations, temperature coupling methods, etc. They should be able to specify those without having to describe, for example, what method to use for evaluating the potential function. To express it in a slightly different way, the user cares about  equations, not  algorithms. An ideal interface should allow the user to specify the mathematical system they want to model, while leaving the library free to numerically evaluate that system in an appropriate way.\n Even if the interface does not explicitly define how the calculations are to be implemented, it can easily restrict the range of implementations that are practical. Great care is needed to ensure that no feature of the API will unnecessarily restrict the hardware platforms it can be used on.\n An example of this from OpenMM is in the mechanism for accessing state information. A molecular mechanics simulation involves various data about the current state of the system being simulated: the positions and velocities of atoms, the forces acting on them, etc. Traditionally, simulation codes have represented these values as arrays in memory. When a program needs to examine the position of an atom, for example, it simply looks at the appropriate array element. To a developer accustomed to using such a code, a natural and obvious API for accessing atom positions would be a routine that takes an atom index and returns “the current position of that atom”.\n Unfortunately, that API would be impossible to implement efficiently on many architectures. When doing calculations on a GPU, for example, the atom positions are stored in device memory, and transferring them to host memory is a relatively expensive operation. The problem is even worse for a cluster, where atom positions are distributed between many different computers across a network. Any program that assumes it has fast, random access to atom positions at all times is guaranteed to run very slowly on these systems.\n OpenMM addresses this by explicitly  not giving direct access to state data. Instead, the user invokes a routine to create a State object, specifying in advance all information that should be stored in that object. This has two advantages. First, because OpenMM knows in advance the full set of information the user is going to request, it can efficiently collect that information with a few bulk operations. Second, the user is aware they are performing an expensive operation, and therefore will give careful thought to when and how they access state data. They are not misled by seemingly trivial API calls (e.g. “get the position of atom 5”) that actually are expensive.\n If a library of this sort is to be successful, it must incorporate the division between interface and implementation as a fundamental aspect of its design. The author of a program should not need to specify what implementation to use. When the program is run, it should automatically select whatever implementation is most appropriate to the available hardware. At the same time, it should also allow the program to query the available implementations and manually select which one to use. For example, the user of a program might sometimes want to perform calculations on the main CPU and other times on a GPU.\n Equally important is extensibility. As new hardware becomes available, new implementations will be necessary. It is impossible to enumerate all possible implementations, and the interface must not attempt to do so. It must be designed to be extensible, so new implementations can be written independently of the main library and existing programs can use them without modification.\n OpenMM accomplishes this by means of a plugin architecture. Each implementation (or “Platform”) is distributed as a dynamic library and installed simply by placing it in a particular directory. At runtime, all libraries in that directory are loaded and made available to the program.\n It also provides extensibility of a different sort: plugins are able not only to implement new Platforms, but also to add new features to existing Platforms. It is important to understand that OpenMM is not merely a library for performing certain calculations; it is an architectural framework designed to unify an entire problem domain. While the library comes with particular features built in (e.g. particular potential functions and integration methods), it also permits other features to be added by plugins. The goal is to provide a framework within which nearly any molecular mechanics calculation can be implemented.\n We now consider how to create an architecture that meets these goals. OpenMM is based on a layered architecture, as shown in   Figure 1. At the highest level is the public API, which developers program against when using OpenMM in their own applications. In any such library, the public API must express concepts in terms relevant to the problem domain (e.g. molecular mechanics) without reference to how those concepts are implemented. In the case of OpenMM, those concepts are particles, forces, time integration methods, etc. For example, a Force object specifies the mathematical form of an interaction between particles, but does not dictate a particular algorithm for computing it.\n  The public API is implemented through calls to a lower level API that serves as an interface between the platform-independent problem description and platform-dependent computational kernels. OpenMM represents this low level API as a set of abstract C++ classes, each defining a particular computation to be done. Note the very different roles played by these two interfaces: the public API is implemented by the core OpenMM library and is invoked by users; the low level API is implemented by plugins and is invoked by the core OpenMM library.\n At the lowest level of the architecture are the actual implementations of the computational kernels. These may be written in any language and use any technology appropriate for the hardware they execute on. For example, they might use a technology such as CUDA or OpenCL to implement GPU calculations, Pthreads or OpenMP to implement parallel CPU calculations, MPI to distribute work across nodes in a cluster, etc.\n This leaves the critical task of selecting and invoking an implementation of the low level API. In the case of OpenMM, this means instantiating a concrete subclass of the abstract class defining each kernel. This task is coordinated by a Platform object, which acts as a factory for computational kernels. Each class of the public API queries the Platform to get a concrete instance of each kernel it requires, then uses that instance to perform its calculations. The choice of what implementation to use thus consists entirely of choosing which Platform to use. A program may also elect not to specify a Platform, in which case one is chosen automatically based on the available hardware.\n Actually, the arrangement is slightly more complicated. A Platform does not create kernels directly, but instead delegates the task to one or more KernelFactory objects. That is how a plugin can add new features to an existing Platform: it defines a computational kernel, creates a KernelFactory that can create instances of the kernel, and adds the factory to the Platform. When the Platform is later asked to create an instance of that kernel, it uses the new KernelFactory to do so.\n We now consider a concrete example of how this architecture works in practice: the computation of nonbonded interactions between atoms in a molecular system. This accounts for the bulk of the processing time in most simulations, so it is very important that it be well optimized.\n In conventional codes designed to run on CPUs, there are well established techniques for doing this efficiently.  7 One begins by building a neighbor list that explicitly enumerates every pair of atoms that are close enough to interact with each other. By using voxel based methods, this can be done in O(N) time. One then loops over all atom pairs in the neighbor list and computes the interaction between them. OpenMM’s reference Platform, which is written to run on a single CPU thread, works in exactly this way.\n Unfortunately, neighbor lists are very inefficient on a GPU due to the need for indirect memory access. For each neighbor list entry, one must load information about the two atoms involved (position, charge, etc.). The indices of the atoms processed by successive threads need not follow any pattern, so the memory access cannot be coalesced.\n We therefore have developed an alternate method better suited to running on a GPU.   We divide the full set of atoms into blocks of 32. The set of N 2 interactions then divides into (N/32) 2 tiles as shown in   Figure 2, each involving the interactions between two blocks of atoms. To process a tile, we load the data for the 64 atoms involved into shared memory, compute all 1024 interactions between them, and finally write out the resulting forces and energies to global memory. In place of a conventional neighbor list, we use a list of which tiles contain interactions: effectively, a neighbor list specifying which blocks of 32 atoms interact. Other researchers have also developed algorithms for computing nonbonded interactions on GPUs.  – 11\n  Our method was designed for use on Nvidia GPUs, and the size of each block (32 atoms) was chosen to match the SIMD width of those processors. Adapting it to other types of processors, even other GPUs, requires modifications to the algorithm. For example, some AMD GPUs have a SIMD width of 64, so threads must be distributed between tiles in a different way to obtain maximum efficiency.\n We therefore need several fundamentally different algorithms to efficiently implement the same calculation on different hardware. Significantly, however, the choice of algorithm depends only on the hardware, not on the precise form of the force being calculated. Many different mathematical forms are used to represent nonbonded interactions in molecular simulations, differing in how they model van der Waals interactions, smoothing of cutoffs, solvent screening effects, etc. These are important differences that scientists genuinely care about when running simulations. Ideally, programmers should be able to choose the functional forms of the interactions and still have them calculated using the most efficient algorithm for the available hardware. The user should specify the equations to use, and the library should determine how best to evaluate those equations.\n OpenMM accomplishes this goal through its CustomNonbondedForce class. This class allows the user to specify an arbitrary mathematical function for the pairwise energy between atoms. That function may depend on an arbitrary set of atomic parameters and tabulated functions, as well as a variety of standard mathematical functions. For example, the following lines of code create a CustomNonbondedForce to calculate a Lennard-Jones 12-6 interaction:\n   The first line specifies the energy of the interaction as a function of the distance  r:\n  where the parameters from two interacting atoms are merged using Lorentz-Bertelot combining rules: the arithmetic mean of the sigmas and the geometric mean of the epsilons. The next two lines specify that the parameters “sigma” and “epsilon” should be associated with each atom.\n OpenMM now has the task of implementing this efficiently on a variety of hardware platforms. It begins by parsing the user-specified expressions and analytically differentiating the energy to determine an expression for the force. Each expression is then converted to a sequence of instructions. To evaluate an expression, the reference and CUDA implementations loop over the instructions and perform each one, effectively acting as an interpreter for an internal language.\n For the OpenCL based implementation, a better solution is possible. Because OpenCL allows programs to be compiled from source code at run time,  12 it is possible to synthesize a kernel with the user-defined mathematical expression inserted into the appropriate hardware-specific algorithm. That kernel is then compiled down to the device’s machine code, eliminating the cost of interpreting the expression and yielding nearly as fast performance as if the entire kernel had been written by hand.\n We stress that this approach allows for a great deal of flexibility in our code, permitting the powerful combination of rapid development (i.e. one can change the key underlying equations for interactions between particles easily) and yet still retaining rapid execution (since the underlying optimizations, especially with OpenCL, allows for minimal overhead). This opens the door to new uses of our code, especially in terms of the rapid development of novel methods for simulating particle interactions, such as novel implicit solvent models for molecular simulation.\n We have implemented Force classes corresponding to all the most widely used energy terms in molecular simulations: a variety of bonded forces, Lennard-Jones and Coulomb forces for nonbonded interactions, Ewald summation and Particle Mesh Ewald for long range Coulomb forces, and a Generalized Born implicit solvent model. OpenMM also includes several methods of time integration and the ability to enforce distance constraints. These features are implemented in three different Platforms: a reference Platform written in C++, a CUDA based Platform for Nvidia GPUs, and an OpenCL based Platform for a variety of GPUs and CPUs.\n We have previously published benchmarks for the CUDA implementation when simulating a variety of proteins.  ,   Speeds range from 5 ns/day when simulating a 318 residue protein in explicit solvent (73,886 atoms total) up to 576 ns/day when simulating a 33 residue protein in implicit solvent (544 atoms total). We also compared it to the single CPU core performance of several widely used molecular dynamics packages when simulating an 80 residue protein in explicit solvent. It was found to be 6.4 times faster than Gromacs, 28 times faster than NAMD, and 59 times faster than AMBER. (GPU calculations were run on an Nvidia GTX280, and CPU calculations were run on a 3.0 GHz Intel Core 2 Duo.)\n The newest feature of OpenMM is custom forces that let the user specify an arbitrary algebraic expression for the form of their force. In addition to the CustomNonbondedForce described above, there is also a CustomBondForce for bonded interactions, CustomExternalForce for forces applied independently to each atom, and CustomGBForce which supports a wide range of implicit solvent models. These are most useful with the OpenCL platform, since it allows them to be used with very little performance penalty. In preliminary testing, we have found that Coulomb and Lennard-Jones forces implemented with CustomNonbondedForce are only about 4% slower than the standard, hand coded implementations. This means that a scientist with no GPU programming experience can still implement arbitrary functional forms for their nonbonded interactions, and get nearly as good performance as hand tuned GPU code.\n Rapid, ongoing changes to computer archi\n......", "posttime": "2020-05-11 02:19:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬件,无关,hardware,实现", "title": "OpenMM：一种与硬件无关的分子模拟框架", "title_en": "OpenMM: A Hardware Independent Framework for Molecular Simulations", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4486654/", "via": "", "real_tags": ["硬件", "无关", "hardware", "实现"]}, {"category": "", "categoryclass": "", "imagename": "af2ec602b1efab8453e67ef50f61e4a5.jpg", "infoid": 1001555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最喜欢的是小型的亲密聚会，我们围坐在研讨会桌旁面对面，谈话很容易进行。中等规模的班级聚集在一个正方形的房间里，一边是窗户。一年中的这个时候，随着春天的阳光倾泻而来，下午变得酷热难耐。我的学生们懒洋洋地坐在那些不舒服的椅子上，椅子上摆放着杂乱无章的书桌，而我则在房间前面踱来踱去，试图唤起他们对一些神秘的人类学学科的兴趣。有时候我很成功。导论课在一个很大的报告厅里进行，从我在教室底部的有利位置，我看到一排排的学生整齐地散布在我的面前。我最近开始戴处方眼镜，这样我就能分辨出他们的脸，由于中年的侵蚀，他们的脸开始变得模糊起来。\n每种类型的教室都带来了不同的挑战和乐趣，但它们都有一个共同点。在这些教室里，学生们表面上是平等的。他们坐在同一把椅子上。\n在我执教了14年的皇后区法拉盛皇后学院校区的大楼入口处，文化评论家钟钩给我一句名言：“学院不是天堂。但是学习是可以创造天堂的地方。“。在这本书中，她继续说：“课堂，尽管有它的局限性，仍然是一个可能的地方。”\n当纽约市立大学关闭校区时，我匆忙开始将我130名学生的文化人类学导论课程的剩余讲座制作成视频。由于日程被彻底打乱，电脑访问受限，Wi-Fi参差不齐，以及其他障碍，这种规模的同步虚拟课堂是不可能的。学生们现在可以在手机上看我的课了。\n在我的小型研讨会课程中，我们使用Zoom尽可能地重现课堂体验。当我们讨论我们的读物时，我观察了装饰我的学生墙壁的海报、照片和挂毯。我看着他们的伴侣和宠物在背景中像影子一样移动。我看到工作区从狭小而笨拙的空间中即兴发挥出来。当学生取消麦克风静音讲话时，我听到令人分心的背景噪音。\n这些Zoom式的亲密关系通常很讨人喜欢，有时我会欢迎这种奇怪的、意想不到的方式，这段时期的强制隔离带来了与他人的新类型的亲密。我喜欢知道这个学生用一个大陶杯喝茶，而那个学生似乎很喜欢用室内植物。但我也意识到，对我学生家中的这些一瞥违反了课堂的隐含契约，在课堂上，学生们可以在一定程度上控制他们校外生活的哪些部分进入视线。\n这并不是说教室曾经与外部世界隔离过--也不应该是这样。当学生将他们不同的生活经历运用到我们的讨论中时，他们建立了有洞察力的联系，并将抽象的想法生动具体地呈现出来。我最喜欢的教学部分之一是看到学生将我教授的概念与他们的生活联系起来。我经常觉得我的主要角色是给他们一个词汇表，让他们思考--并把他们已经知道的东西用语言表达出来。\n有时，他们的个人生活会以不太受欢迎的方式泄露到教室里。一名学生为在课堂上打瞌睡道歉；由于他的父亲被解雇，他增加了作为优步司机的夜间工作时间。另一个人逃课了，后来解释说，他必须在母亲预约医生的时候为她翻译。一名学生抱歉地请求允许她在上课时把手机放在桌子上，这样她就可以看着她生病在家的儿子发来的短信。另一个人哭着来到我的办公室，担心我的课程不及格。自从她的家人被赶出公寓以来，她一直无法学习。\n当你在皇后学院这样的公立通勤学校任教时，这些都是很平常的事情。现在大流行来了，它既揭示了我们城市和国家的不平等，也加剧了我们的不平等，使得低收入有色人种-大多数纽约州立大学的学生-在健康和生计方面更容易受到伤害。我在我的收件箱里清楚地看到了这一点，收件箱里充斥着来自生病或照顾生病的家庭成员的学生的电子邮件。一名学生错过了一次测验，因为他必须赶着把他的祖母送到医院；几天后，他写信告诉我她去世了。一些学生作为“必需品”工作时间更长，而另一些学生则失去了工作。我最担心的是那些我根本没有消息的人。\n课堂上的平等是虚构的，否则的说法将是荒谬的。令人痛苦的是，很明显，我的学生中只有一些人从强大的高中教育中受益。另一些人在大学开始时没有做好基础阅读和写作技能的准备。许多人是移民，他们在学术英语上苦苦挣扎，错过了让我们的阅读更容易理解的文化参考。种族、性别、阶级、性取向、公民身份和其他因素塑造了一个人在课堂上感到自信和害怕说错话的人。\n当我们假装这种不平等不存在时，我们就允许它们不受挑战地存在。但与其他乌托邦梦想一样，平等的虚构-由那些坐着统一椅子的普通房间培养出来的-也有其价值。\n与寄宿大学的许多中上阶层同龄人不同，我的大多数学生都住在家里。校园的关闭和突然转向在线学习对他们来说可能不那么令人震惊，因为大学从来都不是一种远离家庭生活复杂需求和餐桌上食物压力的与世隔绝的经历。\n但这正是教室如此重要的原因。这并不是一个与我们生活的受损和不公平的世界分开的空间，而是一个学生首先作为伙伴学习者彼此相遇的地方。作为一名教师，我不能让一个非常不平等的竞争环境变得公平。但是在教室里，我和我的学生可以尝试建立一个社区，在那里我们相互尊重地倾听，每个人都有权发言，学生们分享他们的经历是因为我们共同建立的信任，而不是因为他们的私生活通过Zoom展示。\n纽约州立大学的学生和教职员工都很有弹性；我们知道如何用比我们应得的更有限的资源过活。目前，我和我的学生们只能勉强在拥挤、有时甚至是混乱的家里授课和学习，这是我们必须做的。但一旦有可能，我们想再次坐在那些不舒服的椅子上，伸手去我们的学习天堂。\n凯伦·斯特拉斯勒(Karen Strassler)是纽约城市大学皇后学院(Queens College)和研究生中心(Graduate Center)的人类学副教授，著有“苛刻的形象：印尼的民主、调解和形象事件”(Required Images：Democratic，Mediation，and the Image-Event in印度尼西亚)一书。", "note_en": "My favorites are the small intimate ones where we face each other around a seminar table and conversation flows easily. Midsize classes meet in a square room with windows along one side. Around this time of year it becomes unbearably hot in the afternoon, as the spring sunshine streams in. My students slouch drowsily in those uncomfortable chairs with built-in desks, arranged in haphazard rows, while I pace at the front of the room, trying to arouse their interest in some arcane anthropological subject. Sometimes I’m successful. Introductory classes are held in a large lecture hall, and from my vantage point at the bottom of the room, I see rows of students fanned out neatly before me. I recently started wearing prescription glasses so I could distinguish their faces, which were beginning to smudge together as a result of encroaching middle age.\n Each type of classroom presents distinct challenges and pleasures, but they all have one thing in common. In these classrooms, students meet one another as apparent equals. They sit in the same chairs.\n At the entrance to the building on the Queens College campus in Flushing, Queens, where I have taught for 14 years, I am greeted with a quote by the cultural critic bell hooks: “The academy is not paradise. But learning is a place where paradise can be created.” In the book from which these words are taken she continues: “The classroom, with all its limitations, remains a location of possibility.”\n When City University of New York campuses shut down, I hastily began turning the remaining lectures for my 130-student Introduction to Cultural Anthropology course into videos. With schedules radically disrupted, limited computer access, spotty Wi-Fi and other obstacles, synchronous virtual classes of this size are impossible. Students can now watch my lectures on their phones.\n In my small seminar course, we use Zoom to recreate the classroom experience as best we can. As we discuss our readings, I observe the posters, photos and tapestries that decorate my students’ walls. I watch their partners and pets moving like shadows in the background. I see work areas improvised out of cramped and awkward spaces. I hear distracting background noises when a student unmutes her microphone to speak.\n  These Zoom intimacies are often endearing, and at times I welcome the strange, unexpected ways this period of enforced isolation brings about new kinds of closeness with others. I like knowing that this student drinks tea from a big ceramic mug, while that one seems to be good with houseplants. But I’m also aware that these glimpses into my students’ homes violate the implicit contract of the classroom, where students have some measure of control over what parts of their lives outside of school come into view.\n It’s not that the classroom is ever sealed off from the outside world — nor should it be. When students bring their divergent life experiences to bear on our discussions, they make insightful connections and render abstract ideas vividly concrete. One of my favorite parts of teaching is seeing students link the concepts I teach to the lives they lead. I often feel that my primary role is to give them a vocabulary to think about — and put into words — what they already know.\n Sometimes their personal lives leak into the classroom in less welcome ways. A student apologizes for falling asleep in class; he has increased his hours working at night as an Uber driver because his father was laid off from his job. Another misses class, explaining later that he had to translate for his mother at her doctor’s appointment. One student apologetically asks permission to keep her phone on her desk during class so she can watch for texts from her son, who is sick at home. Another comes to my office in tears, worried she will fail my course. She has been unable to study since her family was evicted from their apartment.\n These are ordinary occurrences when one teaches at a public, commuter school like Queens College. And now comes the pandemic, which both reveals and worsens the inequities in our city and country, rendering lower-income people of color — the majority of CUNY students — more vulnerable in terms of health and livelihood. I see this clearly in my inbox, which has been flooded with emails from students who are ill or tending to stricken family members. A student misses a quiz because he has to rush his grandmother to the hospital; a few days later he writes to tell me she has died. Some students are working longer hours as “essential workers,” while others have lost their jobs. I worry most about the ones I haven’t heard from at all.\n Equality in the classroom is a fiction — it would be absurd to suggest otherwise. It’s painfully obvious that only some of my students benefited from strong high school educations. Others start college inadequately prepared in foundational reading and writing skills. Many are immigrants who struggle with academic English and miss the cultural references that would make our readings more readily accessible. Race, gender, class, sexuality, citizenship status and other factors shape who feels confident speaking up in class and who feels afraid of saying the wrong thing.\n When we pretend such inequities don’t exist, we allow them to persist unchallenged. But like other utopian dreams, the fiction of equality — cultivated by those generic rooms with their uniform chairs — also has its value.\n Unlike many of their middle and upper-class counterparts at residential colleges, most of my students live at home. The closure of campuses and the sudden shift to online learning is perhaps less of a shock to them, because college has never been a cloistered experience away from the complicated demands of family life and the pressures of putting food on the table.\n But that’s exactly why the classroom is so crucial. It is not a space apart from the damaged and unfair world in which we live, but it is a place where students meet each other, first and foremost, as fellow learners. As a teacher, I cannot level a deeply unequal playing field. But within the classroom, my students and I can try to forge a community where we listen to one another with respect, where everyone has a right to the floor, and where students share their experiences because of the trust we’ve built together, not because their private lives are on display via Zoom.\n CUNY students and faculty are resilient; we know how to get by with more limited resources than we deserve. For now, my students and I make do, as we must, teaching and learning from our crowded and sometimes chaotic homes. But as soon as it becomes possible, we want to be sitting in those uncomfortable chairs again, reaching for our paradise of learning.\n  Karen Strassler, an associate professor of anthropology at Queens College and the Graduate Center, City University of New York, is the author of “ Demanding Images: Democracy, Mediation, and the Image-Event in Indonesia.”", "posttime": "2020-05-11 02:19:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变焦,classroom,学生", "title": "当我们从教室走到变焦时，我们失去了什么", "title_en": "What We Lose When We Go from the Classroom to Zoom", "transed": 1, "url": "https://www.nytimes.com/2020/05/04/sunday-review/zoom-college-classroom.html", "via": "", "real_tags": ["变焦", "classroom", "学生"]}, {"category": "", "categoryclass": "", "imagename": "83e6d1b179612e11eb631e23d2dbe856.jpg", "infoid": 1001554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一年半里，我一直使用Ubuntu作为我的主要家用桌面操作系统，所以我想现在是写下我的经历的好时机。希望目前正在使用Mac或Windows的其他Web开发人员会对此感兴趣，他们可能对Linux很感兴趣。\n注：在这篇文章中，我将主要讨论Ubuntu。我也尝试过其他Linux发行版，但我坚持使用Ubuntu，因为如果我有问题，我可以在谷歌上搜索它，99.9%的时间都能找到答案。\n我第一次改用Linux是在2007年，当时我还在上大学。当时我觉得它比Windows Vista有了很大的进步(速度快多了！)。对程序员来说也更好！)，但它也伴随着很多令人头疼的问题：\nWiFi不能开箱即用。我不得不使用ndiswrapper来包装Windows驱动程序。\n多显示器和演示都很糟糕。每次我使用xrandr，我都知道我会很痛苦。\n对许多消费者应用程序的支持很差。我记得在Wine中的Firefox上运行Netflix是因为这是让它工作的唯一方法。\n大约在2012年，我转而使用Mac--主要是因为我注意到，每一个在会议上演讲的网络开发人员都在使用Mac。然后我在2016年加入微软时成为Windows/Mac双用户，直到2018年离开微软后才再次考虑Linux。\n我很高兴地说，到2020年，我的旧Linux难题将不复存在。在我的Dell XPS 13(预装Ubuntu)上，WiFi和多显示器开箱即用。如今，似乎所有东西都是电子应用程序或网站，所以很少能找到不支持Linux的消费者应用程序。(至少，我关心的那些；我相信您可以找到反例！)。我现在最大的抱怨是字体，这与摆弄WiFi驱动程序大相径庭。\n好了，历史够多了，让我们从Web开发人员的角度来谈谈2020年Linux的好与坏。\n我倾向于在命令行上生活和呼吸，对我来说，Linux上的命令行是首屈一指的。\n主要原因应该很清楚：如果您编写的代码将在某个服务器上运行，则该服务器可能会运行Linux。即使您没有做太多的sysadmin工作，您也可能使用Linux来运行您的测试和CI基础设施。因此，最终您的代码将不得不在Linux上运行。\n使用Linux作为您的台式机只会让事情变得简单得多。我所有的服务器都运行Ubuntu，我的Travis CI测试也是如此，我的桌面也是如此。我知道我的shell脚本将在所有这些环境中完全相同地运行。如果您曾经因为mac和linux shell之间的细微差别而感到头疼(例如，grep、tar和sed的版本与标志略有不同，所以您必须BREW安装coreutil并使用ggrep和gtar…)。那你就知道我在说什么了。\n如果你是Mac用户，切换到Linux终端最困难的部分可能就是你记住的用来打开选项卡和窗格的iTerm键盘快捷键。我发现最简单的解决方案是使用tmux。额外的好处是，tmux也可以在Mac上运行，所以如果你只学了一次键盘快捷键，你就可以在任何地方使用它们。我将终端设置为在启动时自动打开tmux。\n由于命令行是Linux(IMO)的主要卖点，因此将Windows与Linux的Windows子系统一起使用是很有诱惑力的。这绝对是一个可行的选择，而且完全合理，特别是如果有一个你真正需要的Windows程序(或者你是一个PC游戏玩家)。不过，对我来说，我不太玩PC游戏，我使用WSL的经验是，虽然兼容性很好，但性能很差。与同等的Mac或Linux机器相比，在WSL上安装NPM所需的时间要多出几个数量级。(请记住，我早在2016-2018年就在使用WSL，有人告诉我，从那以后它得到了改进。)。\n不过，对我来说，我就是找不到合我口味的Windows。对我来说，UI总是感觉缓慢而笨重，这可能只是我的看法，尽管当我读到布鲁斯·道森(Bruce Dawson)这样的博客帖子时，我觉得有点被证明是正确的。(右键单击任务栏图标速度很慢！为什么？)。无论如何，Ubuntu启动速度很快，系统更新迅速且不引人注目，而且它不会遗漏任何对我来说必不可少的应用程序。所以我运行100%的Ubuntu，甚至没有双引导。\n对于普通的web开发人员来说，您需要的大多数东西在Linux上都能很好地工作。你可以运行Chrome和VS Code(或者WebStorm，我更喜欢)，所有的命令行实用程序，比如node和npm，都会一样工作。您可以使用NVM管理节点版本。到现在为止还好。\n作为一名Web开发人员，我遇到的最大问题是无法快速测试所有三大浏览器引擎--Blink(Chrome)、Gecko(Firefox)和WebKit(Safari)。特别是现在Edge已经没有Chromium了，而且Trident/EdgeHTML的血统正在慢慢消亡，有了Mac，你可以测试所有三个主要的浏览器引擎，而不必切换到另一台机器或使用BrowserStack这样的工具，这真的很吸引人。\n当然，在Linux上我们有Chrome和Firefox，它们和Mac上运行的基本相同，所以它们非常符合要求。对于WebKit，我们甚至有GNOME Web(又名Epiphany浏览器)，但我认为它作为Safari的替身“还可以”。它不支持一些Safari特有的API(如背景滤镜、Apple Pay等)，而且速度非常慢，但这对快速检查一些代码是否能在Safari上很好地运行是有好处的。\n不幸的是，对我来说，我不认为这是“足够好的”，特别是因为绝大多数Safari用户都在iOS上，所以这才是你真正想要测试的平台。从Web开发人员的角度来看，这就是Linux遇到的最大缺点：调试iOS Safari。\n如果你想在Android上调试Chrome或Firefox-没问题。ADB在Linux上运行得很好，你可以在Chrome上运行Chrome：Inspect，或者在Firefox上进行远程调试，它们都运行得很好。不过，对于iOS Safari，您拥有的最佳选择是remotedebug-ios-webkit-Adapter，它在幕后使用iOS-webkit-debug-proxy。\n本质上，这是一套精心设计的工具，可以让iOS Safari看起来有点像Chrome，这样你就可以使用Chrome DevTools来调试它了。最令人惊叹的是…。它真的起作用了！只要您可以正确运行奇怪的依赖项，您就可以将熟悉的Chrome DevTools连接到iOS设备上。\n如果你有一部闲置的iPhone或iPod Touch，这是一个不错的选择。但它仍然与Mac上的简化体验相去甚远，在Mac上，你可以在选择的任何iOS版本上快速运行iOS模拟器，而且Safari调试可以开箱即用。\n对于可访问性测试，情况类似。当然，Firefox和Chrome都有辅助工具，但它们不能替代Mac上的VoiceOver或Windows上的NVDA。Linux确实有Orca屏幕阅读器，但我认为测试它没有多大意义，因为它不能代表实际的屏幕阅读器使用情况。特别是考虑到屏幕阅读器可能会有错误或怪癖，我更喜欢测试真实的内容。因此，我随身带了一台Mac Mini和廉价的Windows台式机，就是出于这个原因。\n因此，简而言之，如果您是一名Web开发人员，使用Linux作为您的桌面环境是非常棒的。你可能不会错过太多，只要你重新连接你的大脑来正确使用键盘快捷键。\n我发现这些天我最怀念的是一些苹果最好的内置应用，比如Preview或Garage Band。我喜欢Preview，因为它可以快速截屏并在上面画箭头和方框(这是我经常做的事情)，而且我还没有在Linux上找到任何好的替代品。(我用的是Pinta，没问题。)。像ImageOptim这样的其他应用程序也没有Linux版本。\n因此，如果你依赖于一些仅在Mac上运行的应用程序，或者如果你需要一流的Safari和iOS调试，那么我不建议使用Linux而不是Mac。如果您的主要关注点是可访问性，那么它可能也不足以满足您的需求(尽管像Assistiv Labs这样的东西可能会改变这一点)。但就其他方面而言，这是一款非常适合网络开发的桌面操作系统。\n感谢Ben Frain询问我的Linux体验并启发了这篇博客文章。", "note_en": "I’ve been using Ubuntu as my primary home desktop OS for the past year and a half, so I thought it would be a good time to write up my experiences. Hopefully this will be interesting to other web developers who are currently using Mac or Windows and may be Linux-curious.\n  Note: in this post, I’m mostly going to be talking about Ubuntu. I’ve played with other Linux distros, but I stick with Ubuntu because if I have a problem, I can Google it and find an answer 99.9% of the time.\n  I first switched to Linux in 2007, when I was at university. At the time I perceived it to be a huge step-up over Windows Vista (so much faster! and better for programmers!), but it also came with plenty of headaches:\n WiFi didn’t work out of the box. I had to use  ndiswrapper to wrap Windows drivers.\n Multi-monitor and presentations were terrible. Every time I used  xrandr I knew I would suffer.\n Poor support for a lot of consumer applications. I recall running Netflix on Firefox in Wine because this was the only way to get it to work.\n Around 2012 I switched to Mac – mostly because I noticed that every web developer giving a conference talk was using one. Then I became a dual Windows/Mac user when I joined Microsoft in 2016, and I didn’t consider Linux again until after I left Microsoft in 2018.\n I’m happy to say that none of my old Linux headaches exist anymore in 2020. On my Dell XPS 13 (which comes with  Ubuntu preinstalled), WiFi and multi-monitor work out-of-the-box. And since it seems everything is either an Electron app or a website these days, it’s rare to find a consumer app that doesn’t support Linux. (At least, the ones I care about; I’m sure you can find a counter-example!) The biggest gripe I have nowadays is with  fonts, which is a far cry from fiddling with WiFi drivers.\n OK so enough history, let’s talk about the good and the bad about Linux in 2020, from a web developer’s perspective.\n  I tend to live and breathe on the command line, and for me the command line on Linux is second-to-none.\n The main reason should be clear: if you’re writing code that’s going to run on a server somewhere, that server is probably going to run Linux. Even if you’re not doing much sysadmin stuff, you’re probably using Linux to run your test and CI infrastructure. So eventually your code is going to have to run on Linux.\n Using Linux as your desktop machine just makes things that much simpler. All my servers run Ubuntu, as do my Travis CI tests, as does my desktop. I know that my shell scripts will run exactly the same on all these environments. If you’ve ever run into headaches with subtle differences between the Mac and Linux shell (e.g. incompatible versions of  grep,  tar, and  sed with slightly different flags, so you have to   brew install coreutils and use  ggrep and  gtar… ugh), then you know what I’m talking about.\n If you’re a Mac user, the hardest part about switching to the Linux terminal is probably just going to be the iTerm keyboard shortcuts you’ve memorized to open tabs and panes. I found the simplest solution was to use  tmux instead. As an added bonus, tmux also runs on Mac, so if you learn the keyboard shortcuts once, you can use them everywhere. I set my terminal to automatically open tmux on startup.\n  Since the command line is the main selling point of Linux (IMO), it’s tempting to just use Windows with the  Windows Subsystem for Linux instead. This is definitely a viable option, and totally reasonable, especially if there’s that one Windows program you really need (or you’re a PC gamer). For me, though, I don’t do much PC gaming, and my experience with WSL is that although compatibility was excellent, the performance was poor.  npm install would take orders of magnitude more time on WSL compared to the equivalent Mac or Linux machine. (Keep in mind I was using WSL back in 2016-2018 though, and I’m told  it’s improved since then.)\n Still, for me, I just don’t find Windows to my taste. The UI has always  felt slow and clunky to me, which may just be my perception, although when I read blog posts like  this one from Bruce Dawson I feel a bit vindicated. (Right-clicking taskbar icons  is slow! Why?) In any case, Ubuntu starts up fast, the system updates are quick and unobtrusive, and it’s not missing any must-have apps for me. So I run 100% Ubuntu, no dual-boot even.\n  For the average web developer, most of the stuff you need is going to work just fine on Linux. You can run Chrome and VS Code (or WebStorm, my preference), and all your command-line utilities like  node and  npm will work the same. You can use   nvm to manage Node versions. So far, so good.\n As a web developer, the biggest issue I’ve run into is not having a quick way to test all three major browser engines – Blink (Chrome), Gecko (Firefox), and WebKit (Safari). Especially now that Edge has gone Chromium and the Trident/EdgeHTML lineage is slowly dying out, it’s really attractive that, with a Mac, you can test all three major browser engines without having to switch to another machine or use a tool like  BrowserStack.\n On Linux of course we have Chrome and Firefox, and those run mostly the same as they do on a Mac, so they fit the bill just fine. For WebKit we even have  GNOME Web (aka Epiphany Browser), but I only consider it “okay” as a stand-in for Safari. It doesn’t support some of the Safari-specific APIs (e.g.  backdrop filter, Apple Pay, etc.), and it’s terribly slow, but it’s good for a quick gut-check to see if some bit of code will run well on Safari or not.\n  Unfortunately for me, I don’t consider that “good enough,” especially since the vast majority of Safari users are on iOS, so that’s the platform you really want to test. And here is where Linux runs into its biggest drawback from a web developer’s perspective: debugging iOS Safari.\n If you want to debug Chrome or Firefox on Android – no problem.  adb runs just fine on Linux, you can run  chrome:inspect on Chrome or Remote Debugging on Firefox, and it all works great. For iOS Safari, though, the best option you have is  remotedebug-ios-webkit-adapter, which uses  ios-webkit-debug-proxy under the hood.\n Essentially this is an elaborate suite of tools that makes iOS Safari kinda-sorta look like Chrome, so that you can use the Chrome DevTools to debug it. The most amazing thing about it is… it actually works! As long as you can get  the odd dependencies running correctly, you’ll have your familiar Chrome DevTools attached to an iOS device.\n  If you have a spare iPhone or iPod Touch laying around, this is not a bad option. But it’s still a far cry from the streamlined experience on a Mac, where you can quickly run an iOS Simulator with any iOS version of your choice, and where Safari debugging works out-of-the-box.\n For accessibility testing, it’s a similar story. Of course Firefox and Chrome have accessibility tools, but they’re no substitute for VoiceOver on Mac or NVDA on Windows. Linux does have the  Orca screen reader, but I don’t see much point in testing it, since it’s not representative of  actual screen reader usage. Especially given that screen readers may have bugs or quirks, I prefer testing the real deal. So I keep a Mac Mini and cheap Windows desktop around for this reason.\n  So in short, using Linux as your desktop environment if you’re a web developer is pretty great. You probably won’t miss much, as soon as you rewire your brain to get the keyboard shortcuts right.\n I find that the main things I miss these days are some of Apple’s best built-in apps, such as Preview or Garage Band. I love Preview for taking a quick screenshot and drawing arrows and boxes on it (something I do surprisingly often), and I haven’t found any good substitutes on Linux. (I use  Pinta, which is okay.) Other apps like  ImageOptim also have no Linux version.\n So if you depend on some Mac-only apps, or if you need best-in-class Safari and iOS debugging, then I wouldn’t recommend Linux over Mac. If your main focus is accessibility, it also might not be sufficient for you (although something like  Assistiv Labs may change this calculus). But for everything else, it’s a great desktop OS for web development.\n Thanks to Ben Frain for asking about my Linux experiences and inspiring this blog post.", "posttime": "2020-05-11 01:57:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,开发,开发人员,desktop", "title": "作为Web开发人员的桌面上的Linux", "title_en": "Linux on the Desktop as a Web Developer", "transed": 1, "url": "https://nolanlawson.com/2020/05/10/linux-on-the-desktop-as-a-web-developer/", "via": "", "real_tags": ["linux", "开发", "开发人员", "desktop"]}, {"category": "", "categoryclass": "", "imagename": "6200a4254cf7f41550ddb0760f041129.jpg", "infoid": 1001553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如你可能已经注意到的那样，我已经更新了网站(从opensourceWeekly.org更新到fealtropy.com)，因为维护2个网站对我来说是一个太大的负担。如果您使用的是rss阅读器，请将您的提要更新为：https://fatalentropy.com/feed.xml，否则“开放源码周刊”将照旧继续，如果没有更好的质量：)。\n什么是FEDISTIZE？FEDISTY(“联邦”和“宇宙”的合成词)是一个以发布和内容共享为主要目的的平台网络。\n想象一下，在你的Twitter应用程序中直接关注你最喜欢的YouTube和播客。这是FEDISTIC允许的众多事情之一。\n它主要围绕ActivityPub展开，该协议使许多不同的社交网络能够进行通信。\n根据这一点，FeDISTIC是分散的，而Twitter是集中式的，SSB是分布式的。\n但是为什么呢？这个想法是把对社交数据的控制权还给人们。当你在推特或Instagram上发帖时，内容就会被囚禁在他们的平台上，那就是著名的“有围墙的花园”。然后，您的内容只能根据看门人的善意才能访问。它尊重他们的政策吗？这对他们的广告商有好处吗？例如，Instagram最近推动了一项改变，禁止没有账户的人查看这些帖子(我们的照片！)。谁知道当这个把戏不足以增加他们的“用户参与度”指标时，未来会发生什么呢？\n我真正欣赏的是这里的平静。这个界面不是为上瘾而设计的，订阅源不是按算法分类的，人们不会哭喊着要人关注。这就是我在与人类互动时所期望的。\nPixelFed(AGPL 3.0)是一个由ActivityPub联合会支持的免费且符合道德的照片分享平台。想想2月多元化的Instagram吧。\nFunkwhale(AGPL 3.0)Funkwhale是一个社区驱动的项目，它允许您在一个分散的、开放的网络中收听和共享音乐和音频。想一想二月份的SoundCloud吧。\nWriteFreely(AGPL 3.0)WriteFreely是一款免费的开源软件，用于在网络上构建写作空间--无论是出版物、内部博客，还是多元化的写作社区。在纷繁多样的世界里想一想媒介。\nFedilab(GPL 3.0)Fedilab允许您从一个应用程序与多个不同平台进行交互。想象一下，您来自所有不同社交网络的所有订阅源加在一起。\nWordPress-activitypub(MIT)为您的博客实现ActivityPub协议的插件。您的读者将能够在Mastodon和其他支持ActivityPub的联合平台上关注您的博客帖子。一个插件就足够了，为什么还要从头开始重建一切呢？\nMastoHost(免责声明：我不是为了写这篇文章而付费的，我只是一个非常高兴的客户)。\n例如，您是否希望拥有自己的乳齿象，例如使用自己的虚荣域并在网络上显示为john@smith.com，或者为您的公司拥有自己的内部和私人社交网络？我不能推荐足够多的masto.host，这是一家Mastodon托管服务公司，由一个非常有能力的人运营。客户支持太棒了！\nMakAir(公共领域)可批量生产的开源冠状病毒ARDS呼吸机。旨在帮助医院应对疫情爆发期间可能出现的专业呼吸机短缺问题。这是一项由法国企业家、医生、大学、工程师和公司发起的倡议。他们的目标是制造一种开源的、可重复使用的、符合监管规定的呼吸机，生产成本低于500欧元。\n联邦谬误根据数据，只有3个实例涵盖了50.8%的用户。所以在现实中，分散的系统是集中的。\n我认为作者没有抓住要点：权力下放是关于选择的。选择托管您自己的数据或委托给受信任的一方，而不必遵循单一公司、单一文化和单一管辖范围内的规则(拜物教)。\nActivityPub，联邦快递的秘密武器，协议如何实现平台间的合作并赋予用户权力的方式多种多样。\nPleroma Plemora中的SSH支持是另一个著名的多样化服务器。他们不满足于提供Web接口，还提供SSH接口。这是云流时代的CLI。\n联邦社交网络简介在线社交网络变得更安全、更灵活和更具创新性的最佳方式是将能力和权威分配给世界各地的用户和开发人员，他们的各种需求和想象力所能做的远远超过任何一家公司所能做到的。\nPARTY网站以一种非常用户友好的方式重新组合关于FEDISTIC的数据和信息。\n乳齿象和联邦系统中滥用的挑战去中心化系统的目标之一是防止审查制度。这也是一个陷阱。\n生态系统正在感动另一位联合模型的批评者，这位令人敬畏的信号应用程序的创建者。TL；DR：由于其固有的分布式特性，联邦网络的发展速度太慢，无法适应快速发展的趋势。", "note_en": "As you may have noticed I have updated the website (from  opensourceweekly.org to  fatalentropy.com) because it was too much of a burden for me to maintain 2 websites.  If you use an RSS reader, please update your feed to:  https://fatalentropy.com/feed.xml  Otherwise Open Source Weekly will continue as before, if not with better quality :)\n   What is the Fediverse?  The Fediverse (a portmanteau of “federation” and “universe”) is a network of platforms whose principal purpose is publishing and content sharing.\n Imagine following your favorite youtubers and podcasters directly within your Twitter app. This is one of the many things permitted by the fediverse.\n It mainly revolves around  ActivityPub, the protocol that enables the many different social networks to communicate.\n  According to this, the Fediverse is decentralized, while Twitter is centralized and  SSB is distributed\n But why?  The idea is to give back to people the control of their social data. When you post on Twitter or Instagram, the content is imprisoned on their platform, the famous “walled gardens”. Your content then becomes accessible only depending on the goodwill of the gatekeepers. Does it respect their policies? Is it good for their advertisers? For example, Instagram recently pushed a change that forbade people without an account to see the posts ( our photos!). Who knows what the future holds when this trick won’t be enough to increase their “user engagement” metrics?\n What I really appreciate on the Fediverse is the calm. The interface is not designed for addiction,the feed is not algorithmically sorted, the people are not crying for attention. This is what I expect wheninteracting with humans.\n     Pixelfed (AGPL 3.0)  A free and ethical photo sharing platform, powered by ActivityPub federation.  Think instagram in the Fediverse.\n Funkwhale (AGPL 3.0)  Funkwhale is a community-driven project that lets you listen and share music and audio within a decentralized, open network.  Think SoundCloud in the Fediverse.\n  WriteFreely (AGPL 3.0)  WriteFreely is free and open source software for building a writing space on the web — whether a publication, internal blog, or writing community in the fediverse.  Think Medium in the fediverse.\n Fedilab (GPL 3.0) Fedilab allows you to interact with multiple Fediverse platform from only one app. Imagine all your feeds from all your different social networks combined.\n Wordpress-activitypub (MIT)  A plugin which implements the ActivityPub protocol for your blog. Your readers will be able to follow your blogposts on Mastodon and other federated platforms that support ActivityPub.  Why rebuilding everything from scratch when just a plugin suffices?\n      MastoHost  (disclaimer: I’m not paid to write this, I was just an extremely happy customer)\n Do you want to have your own mastodon instance, for example to use your own vanity domain and appear as  john@smith.com on the network, or to have your own internal and private social network for your company?  I can’t recommend enough  masto.host, a Mastodon hosting service, run by a single, very competent, person. The customer support is awesome!\n   MakAir (Public domain)  Mass-producible open-source Covid-19 ARDS ventilator. Aims at helping hospitals cope with a possible shortage of professional ventilators during the outbreak.  An initiative by french entrepreneurs, doctors, universities, engineers and companies. Their goal is to make an open source, reproductible, regulatory compliant ventilator costing less than 500€ to produce.\n    The Federation Fallacy According to the data, only 3 instances encompass 50.8% of users. So in reality, decentralized systems are centralized.\n I think the author misses the point: decentralization is about choice. Choice to host your own data or delegate to a trusted party, not to have to follow the rules of a single company, with a single culture and within a single jurisdiction (feodalism).\n ActivityPub, the secret weapon of the Fediverse How a protocol enables cooperation between platforms and empowers users.\n SSH Support in Pleroma Plemora is another famous Fediverse server. Not satisfied with providing a web interface, they also provide an SSH interface. This is CLI in the cloud streaming era.\n An Introduction to the Federated Social Network  The best way for online social networking to become safer, more flexible, and more innovative is to distribute the ability and authority to the world’s users and developers, whose various needs and imaginations can do far more than what any single company could achieve.\n Fediverse.party A website regrouping data and information about the Fediverse in a very user friendly way.\n Mastodon and the challenges of abuse in a federated system One of the goals of decentralized systems is to prevent censorship. It’s also a pitfall.\n The ecosystem is moving Another critic of the federated model by the creator of the awesome  Signal app.  TL;DR: due to their intrinsic distributed nature, federated networks are too slow to evolve and adapt to the fast moving trends.", "posttime": "2020-05-11 01:57:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社交,social,网络", "title": "OpenSourceWeekly#10：联合社交网络(The FeDISTICATION)", "title_en": "OpenSourceWeekly #10: Federated social networks (The Fediverse)", "transed": 1, "url": "https://fatalentropy.com/open-source-weekly/10", "via": "", "real_tags": ["社交", "social", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着Ubuntu Studio20.04LTS的发布，我们透露这将是我们使用Xfce桌面的最后一个版本，我们将从20.10开始迁移到KDE等离子桌面。有趣的是，这条消息花了近两周才引起人们的注意。当它发生的时候，它受到了巨大的打击。\n在发布公告中，我们谈到了做出决定的原因。其中之一是资源使用具有可比性。在使用Xfce重新启动20.04LTS Live Image时，Ubuntu Studio使用了大约620MB的RAM。在使用KDE等离子体重新启动20.10Daily Live Image时，Ubuntu Studio使用了大约670MB的RAM。这个~50MB的差异是极其微不足道的，特别是当您运行的计算机具有更高的RAM可用性时更是如此。作为参考，Ubuntu Studio是为功能更强大的计算机创建的，不是为了在低功耗或更老的硬件上运行，也不是为了给旧计算机带来新的生命。因此，从我们的角度来看，两个桌面之间的RAM使用率几乎相同。\n目前，过渡已接近完成，主题选择方面的一些小事仍在进行中。我们停留在相同的主题(Materia，这一个是KDE端口)和相同的图标(Papirus)。\n要做到这一点，还有一些事情需要改进，其中包括安装程序。Qt版本的Ubuntu ubiquity安装程序(安装操作系统的安装程序，不要与Ubuntu Studio安装程序混淆)目前是硬编码的，以显示Kubuntu品牌。要么此问题将被修复，要么我们将移至新的安装程序。正如发布声明中所说，我们将在这次过渡中与Kubuntu团队进行协调，因为这样的情况是可以预料到的。\n我们真的希望这个“新的”Ubuntu Studio会是一次愉快的体验。", "note_en": "With our release announcement for  Ubuntu Studio 20.04 LTS, we revealed that it would be our last version with the Xfce desktop, and that we would be moving to the KDE Plasma desktop starting with 20.10. Interestingly enough, that news took nearly two weeks to get noticed. When it did, it hit big.\n  In the release announcement, we talked about the reason for our decision. One of those was resource usage being comparable. On a fresh boot of the 20.04 LTS Live Image with Xfce, Ubuntu Studio was using approximately 620MB of RAM. On a fresh boot of the 20.10 Daily Live Image with KDE Plasma, Ubuntu Studio was using approximately 670MB of RAM. That ~50MB difference is extremely negligible, especially if you are running a machine with higher RAM availability. For reference, Ubuntu Studio is created for more powerful computers, is not meant to run on low-powered or older hardware, and is not meant to give an old computer new life. For that reason, from our perspective, the RAM usage between the two desktops is nearly the same.\n Right now, the transition is nearly complete, with a few minor things regarding theme selection still in progress. We are staying with the same theme (Materia, this one being the KDE port), and the same icons (Papirus).\n    Among some of the things still needed to be worked-on to get this right include the installer. The Qt version of the Ubuntu Ubiquity installer (the one that installs the operating system, not to be confused with  Ubuntu Studio Installer) is currently hard-coded to show Kubuntu branding. Either this will be fixed or we will be moving to a new installer. As said in the release announcement, we will be coordinating with the Kubuntu team on this transition as situations like this were anticipated.\n We do hope that this “new” Ubuntu Studio will be an enjoyable experience.", "posttime": "2020-05-11 01:56:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,studio", "title": "Ubuntu Studio：切换到KDE血浆的进展", "title_en": "Ubuntu Studio: Progress on Switch to KDE Plasma", "transed": 1, "url": "https://ubuntustudio.org/2020/05/progress-on-plasma/", "via": "", "real_tags": ["ubuntu", "studio"]}]