[{"category": "", "categoryclass": "", "imagename": "7d683bd7fc17ea4d5791bffb5841bde4.jpg", "infoid": 1015416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丹是True Search的合伙人，在那里他领导着该公司的投资专业实践，曾与许多顶级风投和私募股权公司在高级招聘工作中合作过。\n不管关注的是风险资本、私募股权还是任何其他投资资产类别，这些公司都是白人男性。尽管最近在推动多样性方面做出了一些温和的努力，特别是在风险投资领域，但这些努力充其量只产生了个位数的百分比变化-最坏的情况是什么也没有。如今，风投公司的投资决策者中只有9%是女性，只有2%是黑人。\n一些公司怀着良好的意愿在这个问题上取得了合理的进展。根据我招聘投资专业人士的搜索经验，我猜这些搜索中至少有一半是针对强烈倾向于聘用“多样化”候选人的客户。“黑人生命也是命”(Black Lives Matter)运动最近进一步推动了对话，并比以往任何时候都更多地揭示了风险投资中代表性不足的问题。“我们如何增加不同候选人的渠道？”这是我在2020年前经常听到的一个问题，但在过去的几周里，这个问题已经变成了大合唱。不幸的是，如果解决这个问题就像告诉招聘人员你想要更多的多样性一样简单，那么这个问题很可能很久以前就已经解决了。\n下面是我们在搜索风投公司时看到的一些常见陷阱，以及关于公司如何改进招聘流程的一些想法，以便在投资团队中拥有更多样化的代表。\n我认为，招聘流程导致候选人主要是白人男性的最常见原因是，我的客户认为所需的标准几乎完全排除了候选人名单多样化的可能性。\n考虑到女性和少数族裔男性在风投公司高层的代表性并不高，任何要求候选人在该行业拥有7至10年经验、或拥有大量董事会席位或领导的投资的职位规格，都将意味着“合格”的候选人将主要由白人男性组成。这在历史上一直被称为“管道问题”，这是一个研究越来越深入的概念，学术文献开始指出，这是一种偏见，将雇佣少数族裔的责任从招聘经理推向了应聘者人才库。即使对于那些仍然致力于在不调整标准的情况下雇佣代表性不足的集团的公司来说，结果也是一场零和游戏，成熟的少数投资者从一家公司轮流到另一家公司，这一结果并没有增加整个行业的多样性。\n寻求改善其多样性的风险投资公司必须认识到，伟大的东西有很多种形式。通过制定更广泛的规格，并真正考虑他们投资角色的资格，一个全新的人才库就会打开。然而，要想看到新的人才库，公司必须首先确定哪些特征与这一角色相关，并避免将任期(或其他任期替身)作为主要标准。风险投资既是一门科学，也是一门艺术；公司应该决定是什么个人特质让一个人在他们的组织中变得强大，以及为什么。不同的观点对采购或尽职调查的讨论有何补充作用？\n然后，公司需要致力于面试这些特质和观点，并按照同样的思路评估候选人。与我共事的一家风投公司面试了数十名候选人，后来他们意识到，他们的面试过程过于注重财务敏锐性，而对他们认为可以让某人成为强大的风险资本家的其他因素关注不够，最终产生了一批安全的、“合格的”候选人，而且大多是非少数族裔的候选人。\n我们修改了我们和他们的流程，按照不同的标准进行面试。我们询问了克服困难和承担的风险，我们了解了这个人在任何组织中产生了什么样的影响，而不仅仅是询问交易和交易。尽管面试官和角色相同，但拥有非投资背景的候选人现在在面试过程中的表现要好得多，他们为组织增加的价值也更加明显，这一点也不应令人惊讶。\n宽泛的规格和致力于雇佣不同人才的团队，以及适当的面试，都是很好的起点。但接下来还有更多的事情要做。亲和力偏差是一个众所周知的现象，许多投资者可能都知道，但它在招聘环境中是有害的，可能是一个需要克服的严重挑战。招聘中的亲和力偏差是指一个人或一群人更喜欢长相、谈吐、行为或背景与他们相似的候选人。\n在招聘背景各异的应聘者的情况下，亲和力偏见可能是最高的障碍。在风险投资中，这份工作在很多方面都是为了与你交谈的人寻求共同点。优秀的风投是关系的缔造者--与他们想要招募到投资组合公司的企业家、其他风投和实力雄厚的高管建立关系。但大多数投资者都是来自富裕社区的白人，他们曾就读于精英大学，曾在顶级银行或咨询公司工作过。在某些情况下，可能曾在另一家顶级机构工作过，无论是一家科技公司还是另一家投资公司。\n白人男性更有可能拥有这些背景。在招聘过程中，白人男性风投自然会想方设法与背景相似的候选人(即其他白人男性)建立联系，而不是那些没有相同经验的候选人，即使其他背景的候选人同样有资格担任这一职位。\n亲和力偏差可能非常微妙。人类的本性是觉得与一个在很多方面都过着和你一样的生活的人交谈更容易。甚至感觉有些合乎逻辑：对非白人或非男性候选人的批评从来没有像“他们没有上过斯坦福大学”或“他们不属于我的乡村俱乐部”那么明显。相反，它经常被表达为更柔和和主观的东西-一种很少表达的文化适合性标准。“我们的文化与他们工作的地方不同”是最常见的。“我不确定他们有没有硬盘”是另一种说法，或者“他们没有X因子。”现在，这些批评可以说是完全合法的。\n应聘者可能确实不适合公司的文化，因为例如，他们之前的雇主是一台依赖外部流程的巨型企业机器，他们正在面试一家小型创业组织的一个职位。但有时，特别是在面试来自不同背景的候选人时，文化契合度是亲和力偏见的面具，风险投资家(和所有面试官一样)需要意识到这一趋势。\n投资公司几乎总是在进行全面搜索之前，甚至在网上发布空缺职位之前，都会试图通过自己的网络进行招聘。这已经成为一种根深蒂固的行为，经常被讨论为最佳实践。不幸的是，“通过我们的网络招聘”几乎肯定意味着公司一开始考虑的候选人名单将非常不多样化。除非一家公司(或者扩大这一指导方针，一个组织)已经在多个载体上多样化，那么通过拉拢公司自己的网络开始寻找的可能性极小，不太可能产生一个“多样化”的候选人。这看起来无伤大雅，但实际上可能会降低公司从代表性不足的群体中聘用候选人的几率。为什么？还有另一种偏见在起作用，即现状偏见。\n研究表明，人们倾向于做出有利于现状的选择。创造一个平衡的选择名单对于避免无意中不利于少数族裔候选人至关重要。一项研究表明，在决赛名单上有多名女性或黑人候选人会使入围的人成为少数族裔的几率增加70-100倍。但是，如果一群面试官在认识其他任何人之前，通过他们的关系网认识了五名白人男性，那么要克服这一群体倾向于聘用他们在求职之初遇到的白人男性的“现状”，将需要不成比例的未被充分代表的少数族裔候选人。\n在True search，我们最近审计了我们自己的一个搜索，以寻找候选人选择的身份标记。我们将我们的候选者池与2018年NVCA的多样性数据进行了比较。与行业平均水平相比，我们的候选人池中的白人是整个行业的一半，女性是整个行业的两倍。我不会把这些数据作为True Search的广告来分享，事实上，我们努力做得更多，正在致力于多个项目，以增加我们与不同候选者人才库的网络。关键是，当一家风险投资公司利用猎头公司或任何外部顾问进行搜索时，与风险投资公司简单地打电话给他们网络中的人相比，候选人池将更加多样化，而这些人可能并不都是那么多样化。\n承诺雇佣更多背景不足的人才是很棒的；实际上这样做更好。许多研究表明，多样性提高了团队的绩效，但组织有责任培养一个欣赏这些观点的环境。在我与少数族裔风投的讨论中，他们指出，一旦他们进入公司的大门，他们仍然面临着白人男性同事不会面临的挑战。\n他们不太可能有与他们背景相同的导师，而且投资在很大程度上是一种学徒业务。如果他们不是来自斯坦福或哈佛，他们就不太可能看到公司可能习惯于看到的那种通过个人网络进行的交易。如果他们来自非投资背景，在向职业投资者团队展示投资想法时，他们可能不会被那么认真地对待。一家公司一旦进入公司，就必须支持思想的多样性，否则这些团队成员的贡献可能会得不到赏识。\n一旦进入组织，公司可以做很多事情来培养来自不同背景的优秀人才。在我思考这篇文章的时候，少数投资者和我分享了一些很棒的想法，所以这些建议不仅仅是我自己的。历史上，代表不足的集团(在投资界拥有任何重要代表性的此类集团的短暂历史)形成了超越特定公司墙壁的导师网络，如Latinx VC、BLCK VC和All Raise。\n风投公司应该尽可能多地与这类网络建立联系。这不仅会增加公司从代表不足的群体中看到更多候选人的可能性，还意味着公司可以在整个职业生涯中为他们多样化的才华寻找强大的导师。这些网络可以通过一些小的个人行动来建立，比如参加和赞助活动，或者与这些网络分享公司和投资组合中的招聘信息。\n风投公司还可以在风险投资中帮助启动雇员的人脉网络。想象一下这样一个场景，一家公司聘请了一位拥有独特但令人惊叹的背景的非投资者担任投资角色。他们的同龄人都曾就读于斯坦福大学或在Facebook工作，并通过这些个人网络寻找交易机会。风投公司可以利用他们的资源来帮助缩小这一网络差距，例如通过留出少量资金池作为种子基金，由具有不同背景的新投资者部署，从而促进他们在早期的网络建设。我见过一些公司将这一策略作为一种方式，用来密切关注高潜力运营商，或他们希望在承诺聘用全职员工之前更多了解的合作伙伴级别的候选人。\n公司可以通过开设实习生或分析师项目，并强调聘用代表性不足的群体担任这些职位，来帮助培训初级人才，并为他们未来在风险投资中的全职角色做好更好的准备。即使是风投的兼职工作也会让应聘者在未来的面试过程中占据优势，即使这个人去了另一家公司担任全职工作，回到这个人身上的人脉也会继续存在，作为公司未来招聘的多样化人才的来源(或导师)，这可能会很有帮助。", "note_en": "Dan is a Partner at  True Search where he leads the firm&#39;s Investment Professional practice, having worked with many top VC &amp; PE firms in their senior hiring efforts.\n  Regardless of whether the focus is venture capital, private equity or any other investment asset class, the firms are replete with white men. Though there have been some modest efforts of late to push for diversity, particularly in VC, these have yielded single digit percentage changes at best — and nothing at worst. Only 9% of investment decision makers in VC today are women; just 2% are Black.\n Some firms have made reasonable inroads on this problem with good intentions. Based on my search experience recruiting investment professionals, I would guess that at least half of those searches were for clients with a strong preference to hire a “diverse” candidate. The Black Lives Matter movement has recently advanced the dialogue even further and has shined a light on underrepresentation in VC more than ever. “How do we increase our pipeline of diverse candidates?” is a question I heard frequently before 2020, but in past weeks this has become a chorus. Unfortunately, if solving this problem were as easy as telling a recruiter you want more diversity, it might have been solved long ago.\n  Below are a few common pitfalls we see in our searches with VC firms in particular, as well as some thoughts on how firms can improve their hiring processes, in order to work toward having more diverse representation within their investing teams.\n  The most common reason I see for hiring processes leading to a slate with primarily white male candidates is because  the criteria my client views as required almost completely precludes the possibility that the candidate slate will be diverse.\n Taken as a given that women and minority men are not well-represented at senior levels in VC, any job spec that asks for a candidate to have seven to 10 years of experience in the industry, or a large number of board seats or investments led, will mean that the pool of “qualified” candidates will consist of mostly white men. This has historically been referred to as the “pipeline problem” and it’s an increasingly well-studied concept that academic literature is beginning to point to as a bias that pushes the onus of hiring minorities away from the hiring manager and on to the candidate pool. Even for firms that remain committed to hiring underrepresented groups without making adjustments to their criteria, the result is a zero-sum game where proven minority investors rotate from firm to firm, and an outcome that does not increase diversity in the industry as a whole.\n VC firms seeking to improve their diversity have to recognize that great comes in many forms. By crafting broader specs and really thinking about the qualifications for their investing roles, a whole new talent pool opens up. To see that new pool of talent though, firms must first determine what characteristics are relevant to the role, and avoid tenure (or other tenure stand-ins) as the main criteria. VC investing is as much an art as a science; firms should decide what personal traits make somebody strong in their organization and why. How would a different viewpoint be additive to sourcing or diligence discussions?\n Firms then need to commit to interviewing for those traits and perspectives, and assessing candidates along those same lines. One VC firm I worked with interviewed dozens of candidates before they realized that their process focused too much on financial acumen and not enough on the other factors they felt would make somebody a strong venture capitalist, resulting in a final slate of safe, “qualified,” and mostly nonminority candidates.\n We reworked our process, and theirs, to interview for different criteria moving forward. We asked about overcoming hardships and about risks taken, and we got a sense for what type of impact that person made in whatever organization they came from rather than just asking about deals and transactions. It should be no surprise that the candidates with noninvesting backgrounds are performing much better in the process now, and the value they’d add to the organization more clear, even though the interviewers and the roles are the same.\n  A broad spec and a team committed to hiring diverse talent, and interviewing appropriately, are great starting points. But then there is much more to do. Affinity bias is a well-known phenomenon that many investors are likely aware of, but it is pernicious in hiring settings and can be a serious challenge to overcome. Affinity bias in hiring is when a person or group of people prefer a candidate who looks, talks, acts or has a similar background to them.\n In the case of hiring candidates with diverse backgrounds, affinity bias may be the tallest hurdle. In VC, the job is in many ways to seek common ground with the people you talk to. Good VCs are relationship builders — with entrepreneurs, other VCs and strong executives they want to recruit into their portfolio companies. But most investors are white people from affluent communities who attended elite universities and have worked at top-tier banks or consulting firms. In some cases there may have been a stint at another top-tier institution, be it a technology company or another investment firm.\n White men are more likely to have these backgrounds. In a hiring process, white male VCs will naturally find ways to connect with candidates with similar backgrounds ( i.e., other white men), in contrast to candidates with none of those same experiences, even when the candidates with other backgrounds are equally qualified for the role.\n Affinity bias can be very subtle. It is human nature to feel the conversation was easier with somebody who in many ways has led the same life you did. It can feel somewhat logical even: The critique of the nonwhite or nonmale candidate is never as obvious as “They didn’t go to Stanford” or “They don’t belong to my country club.” Rather, it is often expressed as something softer and subjective — a seldom-articulated criteria of cultural fit. “Our culture is different from the place they work” is the most common. “I’m not sure they have the drive” is another, or “They don’t have an X-factor.” Now, these critiques  can be completely legitimate.\n A candidate may indeed be a bad fit for the culture of the firm because, for example, their prior employer was a gigantic corporate machine reliant on extraneous processes and they are interviewing for a role at a small entrepreneurial organization. But sometimes, particularly when interviewing candidates from different backgrounds, culture fit is a mask for affinity bias, and VCs (like all interviewers) need to be conscious of this tendency.\n  Investment firms almost always try to make a hire through their own network before leading a full search, and even before posting a job as being open anywhere online. This has become such an ingrained behavior that it is often discussed as a best practice.  Unfortunately, “hiring through our network” almost certainly means the slate of candidates that a firm considers at the outset is going to be heavily nondiverse. Unless a firm (or to broaden this guidance, an organization) is already diverse across multiple vectors, then beginning a search by canvasing the firm’s own network is highly unlikely to yield a “diverse” candidate. This seems innocuous but it can actually be harmful to the odds that the firm ever hires a candidate from an underrepresented group. Why? There is another bias at work, the status quo bias.\n Studies have shown that people tend to make choices that favor the status quo. Creating a balanced slate of choices is critical to avoid disfavoring minority candidates inadvertently. One study showed that having multiple women or Black candidates on a finalist slate increased the odds that the selected would be a minority by 70x-100x. But if a group of interviewers meets five white men through their networks before they meet anybody else, it is going to take an disproportionate number of underrepresented minority candidates to overcome the group’s bias toward hiring the “status quo” of the white men they met at the outset of the search.\n At True Search, we recently audited one of our own searches to look for candidate-selected markers of their identity. We compared our pool of candidates to the NVCA diversity data from 2018. Compared to the industry averages, our pool of candidates was half as white and twice as female as the industry at large. I am not sharing that data as an advertisement for True Search, and in fact we strive to do more and are working on multiple programs to increase our networks with diverse candidate pools. The point is, when a VC firm uses a search firm or any outside consultant for a search, the pool of candidates is going to be much more diverse than if that VC firm simply calls up the people in their network, who probably are not all that diverse.\n  A commitment to hiring more talent with underrepresented backgrounds is great; actually doing it is even better. Many studies have shown that diversity improves the performance of a team, but the onus is on the organization to foster an environment where those viewpoints are appreciated.  In my discussions with VCs who are minorities, they point out that once they are in the door of the firm they still face challenges that white male colleagues don’t.\n They are less likely to have mentors who share their backgrounds, and investing is largely an apprenticeship business. If they did not come from Stanford or Harvard, they are less likely to see deals that come through the sorts of personal networks that the firm is likely accustomed to seeing. If they came from a noninvesting background, they may be taken less seriously when presenting investment ideas to the team of career investors. A firm has to support diversity of thought once it is in the door, or the contributions of those team members may be unappreciated.\n Firms can do many things to foster strong talent from diverse backgrounds once they are in the organization. Minority investors have shared some great ideas with me as I was thinking through this article, so these suggestions aren’t just my own. Underrepresented groups have historically (in the short history of such groups having any significant representation in the investing world) formed mentorship networks that transcend the walls of a given firm, such as Latinx VC, BLCK VC and All Raise.\n VC firms should build as much connectivity with those sort of networks as possible. This will not only increase the odds that a firm will see more candidates from underrepresented groups, but it will also mean that the firm can play a role in finding strong mentors for their diverse talent throughout their career. Those networks can be built through small individual actions like attending and sponsoring events, or sharing job postings in the firm and portfolio with those networks.\n VC firms can also help to jump-start a hire’s network in venture. Imagine a scenario where a firm hires a noninvestor with a unique yet amazing background into an investing role. Their peers all went to Stanford or worked at Facebook and are sourcing their deals through those personal networks. VC firms can use their resources to help close that network gap, such as by setting aside small pools of capital for a seed fund to be deployed by new investors with diverse backgrounds, thereby giving them a boost in early network building. I’ve seen firms deploy this strategy as a way to keep tabs on high potential operators, or on partner-level candidates they want to get to know more before they commit to hiring full-time.\n Firms can help train junior talent and better prepare them for future full-time roles in venture by running intern or analyst programs and emphasizing the hiring of underrepresented groups into those roles. Even a part-time gig in VC will give a candidate a leg up in future interview processes, and even if that person goes off to another firm for a full-time role, the network back to that person will remain and could be helpful as a source of (or mentor to) the diverse talent the firm hires in the future.", "posttime": "2020-07-31 22:01:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,多元化,diversity", "title": "\n风险投资中的多元化招聘", "title_en": "\n\t\t\t\tRecruiting for diversity in VC\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/recruiting-for-diversity-in-vc/", "via": "", "real_tags": ["风险投资", "多元化", "diversity"]}, {"category": "", "categoryclass": "", "imagename": "c019025dca191ee28e06620f3fec69d9.png", "infoid": 1015415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "线索就在名字里-荷兰医疗专业人员协作平台Siilo的使命是打破医疗保健领域的竖井。\n在Covid之前，很明显，临床医生之间的沟通留下了一些令人期待的东西-对于患者和医疗专业人员-但现在，在Covid时代，这种变化变得更加重要。\n“当Covid袭击我们时，我们根本不知道它到底是什么。Siilo联合创始人兼首席执行官Joost Bruggeman表示：“因此，以前从不交流的人，永远不会说话的孤岛--全科医生、重症监护病房的工作人员和政府的医疗顾问--突然之间站在了同一条战线上，”Siilo联合创始人兼首席执行官朱斯特·布鲁格曼说。“这是网络医学的完美例子。”\n今天，Siilo宣布了一项1050万美元的首轮融资计划，由总部位于柏林的数字健康风险投资公司Heal Capital牵头，飞利浦健康技术风险基金(Philips Health Technology Venture Fund)和EQT风险投资公司(EQT Ventures)参与其中。它计划将其协作工具提升到一个新的水平，并在现有的五个市场(荷兰、比利时、德国、英国和爱尔兰)上加倍努力。\n它还声称现在是欧洲最大的医疗网络，有超过25万名医疗专业人员使用其平台，每月交换超过2000万条消息。\n输入您的电子邮件即表示您同意SIFT的使用条款|过去的时事通讯。\n当健康危机来袭时，医务人员蜂拥至Siilo。这款免费应用程序是WhatsApp与LinkedIn的一种，3月和4月的注册量增长了300%以上(与前两个月相比)，而发送的消息数量也增长了200%以上。\n医护人员可以使用该应用程序的安全消息功能来共享患者扫描或相互更新患者的病情；这是对寻呼机或WhatsApp的一大改进。他们还可以建立和加入小组或“空间”，其功能有点像一个松弛频道；例如，专家们可以在这里相互分享相关信息，或者医院团队可以相互提供最新情况。\n在危机开始时，这些小组也成为讨论大流行的有用工具。布鲁格曼在接受SIFT采访时表示：“突然之间，平台上出现了新冠肺炎和冠状病毒相关群组的热潮。”随着情况的发展，医疗保健专业人员想找个地方分享学习和新闻。\n许多机构还对该公司面向医疗机构的付费订阅服务Siilo Connect表现出兴趣，并以不同寻常的速度开始利用该平台帮助他们的团队进行协作。\n“说服中层管理人员通常需要12-18个月的时间，”Bruggeman在3月份告诉SIFT。“现在他们说，‘把钱给我们，我们以后再谈合同’。”\n医院已经使用Siilo Connect向他们的团队广播有关防护服的最新信息，或者让他们知道他们的代码已经改变-还让他们知道稍微更有趣的事情，比如当地餐厅提供的免费食物。\n“很多医院都说‘对不起，没有，我们目前没有考虑采用新的工具’。”\n但并不是每个医疗机构都如此热衷于开始使用新软件。“他们中的一些人飞向了另一个方向，”布鲁格曼说。“很多医院完全缩减了正常医疗规模，所以那边的收入下降了，他们开始要求折扣。或者他们说，‘对不起，没有，我们目前没有考虑采用新工具’。“。\n现在，他说，与机构的销售对话或多或少恢复了正常-除此之外，Siilo现在不需要解释为什么它的服务是一个好主意。\nSiilo与荷兰伊拉斯谟大学医疗中心、德国夏利特和英国东兰开夏医院NHS信托等机构合作，30%的用户是付费客户。\n请对您的评论保持尊重。通过评论，您同意遵守我们的社区指南以及这些条款和条件。\n请对您的评论保持尊重。通过评论，您同意遵守我们的社区指南以及这些条款和条件。", "note_en": "The clue is in the name — Siilo, the Dutch collaboration platform for medical professionals, is on a mission to break down the silos in healthcare.\n  It was clear enough pre-Covid that communications between clinicians left something to be desired — for patients, and medical professionals — but now, in the Covid era, it’s become even more important that that changes.\n  “When Covid hit us, we had no idea what it really was. So people who would previously never communicate, silos that would never talk — GPs and ICU staff and government medical advisors — were suddenly on the same page,” says Joost Bruggeman, Siilo cofounder and CEO. “It was the perfect example of network medicine.”\n    Today, Siilo is announcing a $10.5m Series A, led by Berlin-based digital health VC Heal Capital, with participation from Philips Health Technology Venture Fund and EQT Ventures. It plans to take its collaboration tools to the next level and double down on its five existing markets (the Netherlands, Belgium, Germany, the UK and Ireland).\n  It also claims to now be Europe’s largest medical network, with more than 250,000 healthcare professionals using its platform and exchanging more than 20m messages per month.\n  By entering your email you agree to Sifted’s  Terms of Use  |    Past Newsletters\n  When the health crisis hit, medics flocked to Siilo. Registrations for the free app, which is a kind of WhatsApp meets LinkedIn, increased by over 300% in March and April (in comparison to the previous two months), while the number of messages sent increased by over 200%.\n  Medics can use the app’s secure messaging features to share patient scans or update one another on a patient’s condition; a big improvement on the pager, or WhatsApp. They can also set up and join groups, or ‘spaces’, which function a bit like a Slack channel; places for specialists to share relevant information with one another, for example, or for hospital teams to give one another updates.\n   At the start of the crisis, these groups also became useful for discussing the pandemic. “All of a sudden there was a boom of Covid-19 and coronavirus-related groups on the platform,” Bruggeman told Sifted. Healthcare professionals wanted somewhere to share learnings and news as the situation unfolded.\n  Many institutions also showed interest in Siilo Connect, the company’s paid-for subscription service for healthcare organisations — and moved with uncharacteristic speed to start using the platform to help their teams collaborate.\n  “It usually takes 12–18 months to convince middle management,”   Bruggeman told Sifted  in March. “Right now they’re saying, ‘Give it to us, we’ll figure out the contracts later’.”\n  Hospitals have used Siilo Connect to broadcast updates about protective clothing to their teams or to let them know that their code has changed — and also to let them know about slightly more fun things, like free food offers from local restaurants.\n  “A lot of hospitals said ‘Sorry no, we’re not contemplating adopting new tools at the moment’.”\n But not every healthcare organisation was so keen to start using new software. “Some of them flew the other way,” says Bruggeman. “A lot of hospitals completely downscaled normal care, so revenue from that side dropped and they began asking for discounts. Or they said, ‘Sorry no, we’re not contemplating adopting new tools at the moment’.”\n  Now, he says, sales conversations with institutions are more or less back to normal — apart from that now, Siilo doesn’t need to explain why its service is a good idea anymore.\n  Siilo works with institutions including Erasmus University Medical Centre in the Netherlands, Charité in Germany and East Lancashire Hospitals NHS Trust in the UK, amongst others, and 30% of its users are paying customers.\n   “Our previous focus was around secure communication,” says Bruggeman. (For more on that,  read Sifted’s first profile of Siilo.) “Now we’re going to expand our collaboration features.”\n  It’s all part of a plan to become more embedded in the day-to-day routines of medical professionals. If Siilo can crack collaboration tools it could, for example, help make handovers between staff easier. “Teams have patient handover meetings, sometimes three times per day, as you hand over one shift to the next,” says Bruggeman. “A lot of information is written on pieces of paper or quickly scribbled onto a Word document or some shitty tool that’s not meant for doing that.”\n  In the longer term, Siilo’s “hairy audacious goal” is to create a kind of app store for doctors. ‘Nursepreneurs’ and ‘doctorpreneurs’ have thought up and built plenty of smart tools to help with very specific parts of their jobs, but “there is no perfect distribution channel for these valuable tools and services,” says Bruggeman.\n  Siilo’s fundraise wasn’t a totally smooth ride, despite the booming interest in healthtech expressed by investors.\n  It came “very close” to a deal with a London-based VC at the start of the pandemic, which didn’t pan out once it became clear that the investor needed to focus more on helping out existing portfolio companies than finding new ones, says Bruggeman. But it wasn’t hard to get other offers, he says.\n  This is the first investment from Heal Capital, an €80m fund which was launched in 2019 by the Association of German Private Health Insurance.\n  Heal grew out of Heartbeat Labs and Flying Health, two Berlin-based healthtech accelerators which also manage the Heal fund.\n  By entering your email you agree to Sifted’s  Terms of Use  |    Past Newsletters\n        Please keep comments respectful. By commenting, you agree to abide by our  community guidelines and these  terms and conditions.\n  Please keep comments respectful. By commenting, you agree to abide by our  community guidelines and these  terms and conditions.", "posttime": "2020-07-31 21:59:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,位于,based,siilo", "title": "总部位于荷兰的“医生松弛”APP募集了1050万美元的首轮融资，由Heal Capital牵头，飞利浦健康技术风险基金和EQT风险投资公司参与其中", "title_en": "Netherlands-based “Slack for doctors” app raises $10.5M Series A led by Heal Capital, with Philips Health Technology Venture Fund and EQT Ventures participating", "transed": 1, "url": "https://sifted.eu/articles/siilo-series-a-10-5m/", "via": "", "real_tags": ["风险投资", "位于", "based", "siilo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "之前发表在HACKERNOON上。最初由SFU数字媒体大师学生丹尼尔·科林·詹姆斯撰写。经作者许可重新出版。\n谷歌几乎所有的钱都来自广告。这是一项蓬勃发展的业务--直到它不是。以下是科技行业有史以来最壮观的崩盘之前的情况。\n搜索是谷歌唯一毫不含糊的胜利，也是其最主要的营收来源，因此当亚马逊迅速超越谷歌，成为产品搜索的首选目的地时，谷歌的根基开始动摇，但正如许多人当时指出的那样，在线广告业在2010年代中期经历了从搜索到发现的重大转变。\n虽然谷歌保护了其在垂死的搜索广告市场的垄断地位，但Facebook--谷歌在在线广告领域的最大竞争对手--却站在了趋势的右边，并以其馈送原生展示广告主导了在线广告。\n2015年末，苹果-谷歌在移动领域的主要竞争对手-在他们的手机和平板电脑上添加了一项功能，允许用户屏蔽广告。\n据估计，运行iOS的设备贡献了谷歌75%的移动搜索广告收入，因此通过此举，苹果同时果断地介入了2010年代的广告屏蔽大辩论，并对在线广告的未来造成了实质性打击。\n在手机上拦截广告的用户数量不断增加，丝毫没有放缓的迹象。\n一年后，随着互联网的移动化，广告拦截也是如此。从2015年到2016年，在移动设备上屏蔽广告的人数增长了102%；到2016年底，全球估计有16%的智能手机用户在移动设备上浏览互联网时正在屏蔽广告。在占谷歌营收约47%的美国，台式机和笔记本电脑用户的这一数字高达25%。\n最有可能屏蔽广告的人也是最有价值的人群：千禧一代和高收入者。\n年轻用户是技术未来的一个很好的指标，他们是广告拦截软件的重度用户。\n2017年初，谷歌宣布计划在其广受欢迎的谷歌Chrome浏览器中内置广告拦截程序。谷歌的广告拦截软件只会屏蔽被美国更好广告联盟认为不可接受的广告，这实际上允许该公司利用其占主导地位的网络浏览器来加强其本已占主导地位的广告业务。\n即使在做出这一绝望和法律上有疑问的举动后，谷歌很快就会明白，即使广告正在变得更好，广告拦截数量也不会继续上升。谷歌甚至让更多的人略微体验了一下没有广告的互联网体验是什么样子。但该公司发现，人们不喜欢的不仅仅是恼人的广告，而是总体上的广告。\n谷歌提供广告的一个关键平台是YouTube，它在2006年收购了YouTube，并迅速成为其最大的实体之一。但是，即使世界上六分之一的人每月都会访问这个视频分享巨头，YouTube也从未盈利。为了对抗广告拦截器的影响，YouTube在2015年末推出了无广告订阅模式，但订阅数量仍然平淡无奇。\nYouTube本已无法克服的问题在2017年初成倍增加，因为广告商开始在广告投放争议中撤出，巨大的营收来源也开始离开该网站。即使那些没有屏蔽广告的人也训练自己完全忽略它们。研究人员将这种现象称为“旗帜盲”。横幅广告的平均点击率为令人沮丧的0.06%，而在这些点击中，大约有50%是偶然的。\n研究显示，约54%的用户报告缺乏信任是他们不点击横幅广告的原因，33%的用户认为他们完全无法忍受。这些数字为在线广告的可持续性描绘了一幅相当严峻的图景，但尤其是谷歌在该行业的地位。\n如果失去一大部分用户并惹恼其余用户还不够糟糕的话，谷歌也没能赶在科技史上最大的转变之一之前。他们认识到人工智能的重要性，但他们的方法没有切中要害。由于谷歌的搜索支柱已经变得不稳定，很多事情都寄托在该公司的人工智能战略上。\n谷歌能够承认即将到来的趋势，但仍未能在其面前落地，这让许多观察家想起了它在蓬勃发展的社交媒体和即时通讯行业的灾难性失败。\n与此同时，亚马逊在2014年发布了一款名为Amazon Echo的产品，这是一款小型扬声器，可以坐在你家里为你回答问题、执行任务和在线购物。Echo取得了巨大的成功。谷歌在两年后发布了其山寨产品Google Home，但已经为时已晚，无法迎头赶上，而且没有明确的营收战略。\n另一方面，住在Echo内部的助手Alexa很快就被整合到了几种产品和服务中，它的盈利模式清晰、可行，最重要的是对未来友好。Echo使得通过亚马逊订购产品变得容易，每次有人使用Echo购买东西，亚马逊都会赚钱。\n谷歌通过将虚拟助手内置到安卓系统中来扩展其覆盖范围，但这样做仍然没有为这项技术如何产生足够的收入来维持谷歌不断扩大的昂贵创新剧目提供答案。\n谷歌的广告依赖于屏幕，而语音交互完全颠覆了屏幕。谷歌曾短暂尝试过使用Google Home播放音频广告，但消费者并不太容易接受。投资者从2017年开始表达他们的担忧，但桑达尔·皮查伊告诉他们不用担心，让他们假设谷歌将使用他们古老的策略，分析用户的语音搜索，以便在有屏幕的设备上向用户显示更合适的广告。\n2017年初的头条新闻宣称“Alexa刚刚征服了CES。世界是下一个。“。亚马逊随后向第三方制造商开放了他们的技术，从而拉近了两家公司之间的距离。亚马逊之前已经击败过谷歌一次，在2016年占据了54%的云计算市场份额(而谷歌只有3%)，而且他们才刚刚起步。到2017年初，亚马逊已经开始接近整个全球零售业。\n在其鼎盛时期，谷歌在数量惊人的产品上拥有庞大而忠诚的用户基础，但广告收入是将一切联系在一起的粘合剂。随着数字的减少，谷歌的核心开始在其庞大帝国的重压下崩溃。\n自1998年颠覆性进入以来，谷歌一直是科技行业的推动力。但在一个人们鄙视广告的世界里，谷歌的商业模式对创新并不友好，他们错过了几次转向的机会，最终使他们众多宏伟而雄心勃勃的项目变得不可持续。创新是要花钱的，谷歌的主要收入来源已经开始枯竭。\n在短短几年内，谷歌已经从一个有趣、平凡的动词变成了一个提醒人们一个巨人可以多快倒下的标志。\n丹尼尔是一名数字媒体硕士学生，目前在温哥华一家名为Covalal的区块链初创公司完成了产品经理的实习工作。Daniel喜欢编写代码和文字，他不确定下一步是什么，但他对此感到兴奋。你可以通过查看他的LinkedIn页面来了解他现在在做什么。\n点击此处查看丹尼尔的文章是如何让他获得谷歌设计副总裁的推荐的", "note_en": "Previously published in  HACKERNOON. Originally written by SFU Masters of Digital Media student Daniel Colin James. Re-published with permission of the writer.\n   Google made almost all its money from ads. It was a booming business — until it wasn’t. Here’s how things looked right before the most spectacular crash the technology industry had ever seen.\n Search was Google’s only unambiguous win, as well as its  primary source of revenue, so when Amazon  rapidly surpassed Google as the top product search destination, Google’s foundations began to falter. As  many noted at the time, the online advertising industry experienced a major shift from search to discovery in the mid-2010s.\n While Google protected its monopoly on the dying search advertising market, Facebook — Google’s biggest competitor in the online advertising space — got on the  right side of the trend and dominated online advertising with its in-feed native display advertising.\n   In late 2015, Apple — Google’s main competitor in the mobile space — added a feature to their phones and tablets that allowed users to block ads.\n Devices running iOS were responsible for an  estimated 75% of Google’s revenue from mobile search ads, so by making this move, Apple was simultaneously weighing in decisively on the great ad blocking debate of the 2010s and dealing a substantial blow to the  future of online advertising.\n  The rising number of users blocking ads on mobile showed no signs of slowing down\n A year later, as the internet went mobile, so too did ad blocking. The number of people blocking ads on a mobile device grew  102% from 2015 to 2016; by the end of 2016, an estimated 16% of smartphone users globally were  blocking ads when browsing the internet on a mobile device. The number was  as high as 25% for desktop and laptop users in the United States, a country that accounted for  47% of Google’s revenue.\n The people most likely to block ads were also the most valuable demographic:   millennials and high earners .\n Young users are a good indicator for the future of technology, and  they were heavy users of ad blocking software\n  In early 2017, Google announced its plans to build an ad blocker into its popular Google Chrome browser. Google’s ad blocker would only block ads that were deemed unacceptable by the  Coalition For Better Ads, effectively allowing the company to use its dominant web browser to strengthen its already dominant advertising business.\n Even after making this desperate and  legally questionable move, it would quickly become clear to Google that even though ads were getting better, ad blocking numbers would  continue to rise. Google had given even more people a small taste of what an ad-free internet experience could look like.  The company discovered that it wasn’t just annoying ads that people didn’t like; it was ads in general.\n A key platform where Google served ads was YouTube, which it bought in 2006 and quickly turned into one of its biggest entities. But even with a  sixth of the world visiting this video-sharing behemoth every month, YouTube  never became profitable. In an attempt to combat the effect of ad blockers, YouTube launched an ad-free subscription model in late 2015, but the subscription numbers were  underwhelming.\n YouTube’s already insurmountable problems multiplied in early 2017 as advertisers  began to pull out amid ad placement controversies, and huge revenue generators began to  leave the site. Even those who weren’t blocking ads had trained themselves to ignore them entirely. Researchers dubbed this phenomenon “ banner blindness”. The average banner ad was clicked on by a dismal  0.06% of viewers, and of those clicks, roughly  50% were accidental.\n Research showed that  54% of users reported a lack of trust as their reason for not clicking banner ads and 33% found them completely  intolerable. These figures painted a pretty grim picture for the sustainability of online advertising, but especially for Google’s position within the industry.\n   If losing a major portion of their audience and annoying the rest wasn’t bad enough, Google also failed to get ahead of one of the biggest shifts in technology’s history. They recognized the importance of artificial intelligence but their approach missed the mark. Since Google’s search pillar had become unstable, a lot was riding on the company’s strategy for artificial intelligence.\n   Google’s ability to acknowledge the coming trend and still fail to land in front of it reminded many observers of its catastrophic failures in the booming industries of social media and instant messaging.\n    Meanwhile, in 2014, Amazon released a product called Amazon Echo, a small speaker that could sit in your home and answer questions, perform tasks, and buy things online for you. The Echo was a  smash success. Google released its copycat product, Google Home, two years later, but it was already  too late to catch up, and had no clear revenue strategy.\n Alexa — the assistant that lived inside the Echo — on the other hand, was quickly integrated into several products and services, and its monetization model was clear, viable, and most importantly future-friendly. The Echo made it easy to order products through Amazon, and every time someone used an Echo to purchase something, Amazon made money.\n Google extended the reach of their virtual assistant by building it into Android, but doing so still didn’t provide an answer for how the technology would generate enough revenue to sustain Google’s expanding repertoire of expensive innovations.\n Google’s ads relied on screens, yet voice interaction subverted screens entirely. Google briefly tried playing audio ads with the Google Home, but consumers were  far from receptive. Investors  started to voice their concerns in 2017, but Sundar Pichai told them not to worry, leaving them to assume that Google would use their age-old strategy and analyze users’ voice searches so that users could be shown more suitable ads on devices with screens.\n   Headlines in early 2017  proclaimed that “Alexa Just Conquered CES. The World is Next.” Amazon then made their technology  available to third party manufacturers, putting even more distance between the two companies. Amazon  had already beaten Google once before, holding 54% of the cloud computing market (compared to Google’s 3%) in 2016, and they were just getting started. By early 2017, Amazon  had begun closing in on  the entire  retail industry.\n  At its peak, Google had a massive and loyal user-base across a staggering number of products, but advertising revenue was the glue that held everything together. As the numbers waned, Google’s core began to buckle under the weight of its vast empire.\n Google was a driving force in the technology industry ever since its disruptive entry in 1998. But in a world where people despised ads, Google’s business model was not innovation-friendly, and they missed several opportunities to pivot, ultimately rendering their numerous grand and ambitious projects unsustainable. Innovation costs money, and Google’s main stream of revenue had started to dry up.\n In a few short years, Google had gone from a fun, commonplace verb to a reminder of how quickly a giant can fall.\n  Daniel is a Master of Digital Media student, currently completing his internship as a product manager at a Vancouver-based blockchain startup called Covalent. Daniel likes writing code and writing words, and he’s not sure what’s next, but he’s excited about it. You can find out what he’s up to now by checking out   his LinkedIn page .\n   Check out how Daniel&#39;s article led him to get recommended by Google&#39;s VP of Design  here", "posttime": "2020-07-31 21:58:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,广告", "title": "这就是谷歌将如何崩溃", "title_en": "This is how Google will collapse", "transed": 1, "url": "http://www.sfu.ca/olc/blog/engage/how-google-will-collapse", "via": "", "real_tags": ["google", "谷歌", "广告"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们通过在隐藏网站的网络上提供谷歌文本广告来赚钱。我们用这笔钱自动购买谷歌股票。我们通过自己的广告购买谷歌！谷歌吃掉了自己--但最终我们拥有了它！\n通过建立这个自相残杀的模型，我们解构了新的全球广告机制，将它们呈现为一个超现实的基于点击的经济模型。\n在这一过程之后，我们将我们谷歌股票的共同所有权移交给GTTP有限公司。[Google to the People Public Company]将它们分发回用户(点击器)/公众。", "note_en": "We generate money by serving Google text advertisments on a network of hidden Websites. With this money we automatically buy Google shares. We buy Google via their own advertisment! Google eats itself - but in the end &#34;we&#34; own it!\n  By establishing this autocannibalistic model we deconstruct the new global advertisment mechanisms by rendering them into a surreal click-based economic model.\n  After this process we hand over the common ownership of &#34;our&#34; Google Shares to the GTTP Ltd. [Google To The People Public Company] which distributes them back to the users (clickers) / public.", "posttime": "2020-07-31 21:57:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌", "title": "谷歌将自食其果(2005)", "title_en": "Google Will Eat Itself (2005)", "transed": 1, "url": "https://www.gwei.org/index.php", "via": "", "real_tags": ["google", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook创始人兼首席执行官马克·扎克伯格(Mark Zuckerberg)在周四的财报电话会议上为他的公司在缓和仇恨言论和错误信息方面的政策进行了辩护，他说：“我们不会从错误信息或仇恨中获利。\n“我们不想让这些内容出现在我们的平台上，”他继续说。“正如我昨天告诉国会的那样，我为我们建立的服务感到自豪。”\n在周三的众议院司法反垄断听证会上，扎克伯格受到议员们的抨击，原因是在Facebook将他们拿下之前，围绕冠状病毒大流行的错误信息和阴谋论在该平台上是多么广泛和病毒式的。在一场激烈的交锋中，众议员大卫·西西林(D-RI)指责扎克伯格从这种“致命的内容”中获利。\n扎克伯格在周四的财报电话会议上谈到了对Facebook温和政策的攻击，并表示90%的有害和令人憎恨的内容在有人报告之前就被Facebook的人工智能删除了。然而，扎克伯格没有提到错误信息会对他的平台产生多大影响。就在本周，一段冠状病毒阴谋视频错误地吹捧羟基氯喹是治疗冠状病毒的有效药物，口罩无法阻止新冠肺炎的传播，在被删除之前获得了2000多万的点击量。他还表示，Facebook还在对其温和的仇恨言论进行独立审计，看看其团队和操作系统在删除这些言论时的表现如何。\n扎克伯格和首席运营官谢丽尔·桑德伯格(Sheryl Sandberg)在电话会议中都谈到了公众对Facebook的广告抵制。\n桑德伯格说：“Facebook坚决反对仇恨。”“我们并没有从中受益，而且我们从来没有受益过。我们的用户不想看到它，我们的广告商也不想与它联系在一起。\n“很明显，我们还有很多事情要做，”桑德伯格继续说。“不是因为来自广告商的压力，而是因为这是正确的做法。”\n在周四与扎克伯格通电话之前，Facebook发布了收益报告，500多家公司决定从7月份的平台上撤出资金，这份报告基本上没有公布。\n扎克伯格补充说，Facebook将继续努力实现在今年秋天总统选举之前注册400万用户投票的目标，并将努力阻止选举干预。他还预计，在可预见的未来，他的员工将保持偏远，并指责特朗普政府平淡无奇的政策通过不听取卫生官员的意见来拖延疫情的致命性。\n“我预计今年将继续变幻莫测，”他说。“目前还不清楚经济前景如何[…]。但控制住病毒将意味着经济复苏。“", "note_en": "Facebook founder and CEO Mark Zuckerberg defended his company’s policies when it comes to moderating hate speech and misinformation in an earnings call Thursday, saying, “We do not profit from misinformation or hate.\n “We do not want this content on our platforms,” he continued. “As I told Congress yesterday, I am proud of the services we build.”\n In Wednesday’s  House Judiciary antitrust hearing, Zuckerberg came under fire from lawmakers for how widespread and viral misinformation and conspiracy theories surrounding the coronavirus pandemic on the platform before Facebook takes them down. In a fiery exchange, Rep. David Cicilline (D-RI)  accused Zuckerberg of profiting off this type of “deadly content.”\n  Zuckerberg addressed the attacks on Facebook’s moderation policies in Thursday’s earnings call and said 90% of harmful and hateful content is taken down by Facebook’s artificial intelligence before someone reports it. However, Zuckerberg failed to mention just how much impact misinformation can have on his platform. Just this week, a coronavirus conspiracy video falsely touting hydroxychloroquine as an effective cure for the coronavirus and that face masks do not stop the spread of COVID-19 garnered over 20 million views before being taken down. He also said that Facebook is also undergoing an independent audit of its moderation of hate speech to see how effectively its teams and operating systems perform when removing it.\n Both Zuckerberg and Chief Operating Officer Sheryl Sandberg addressed the public advertising boycott against Facebook in the call.\n “Facebook stands firmly against hate,” Sandberg said. “We don’t benefit from it and we never have. Our users don’t want to see it and our advertisers don’t want to be associated with it.\n “It is clear we have a lot more to do,” Sandberg continued. “Not because of pressure from advertisers but because it is the right thing to do.”\n Before the Thursday call with Zuckerberg,  Facebook released its earnings report, which remained largely undented by the 500-plus companies that decided to pull their money from the platform for the month of July.\n Zuckerberg added that Facebook will continue to work on achieving its goal of registering 4 million users to vote before the presidential election this fall and will work to stop election interference. He also anticipates his workforce to remain remote for the foreseeable future and blamed the Trump administration’s lackluster policies for dragging out the pandemic’s deadliness by not listening to health officials.\n “I expect this year to continue to be unpredictable,” he said. “It is unclear what the economic outlook will be […] but getting the virus under control will mean economic recovery.”", "posttime": "2020-07-31 21:32:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,财报,defends", "title": "扎克伯格在财报电话会议上为Facebook的错误信息和仇恨政策辩护", "title_en": "Zuckerberg defends Facebook’s misinformation and hate policies in earnings call", "transed": 1, "url": "https://finance.yahoo.com/news/zuckerberg-defends-facebook-misinformation-hate-231857683.html", "via": "", "real_tags": ["facebook", "财报", "defends"]}, {"category": "", "categoryclass": "", "imagename": "8c0ab84a978dcc4cc7e3f0a143ec4aa5.jpg", "infoid": 1015409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity(现已上Twitter！)，我们在这里解开头条背后的数字。\n本周我们有完整的团队：我、丹尼和娜塔莎在麦克风上，克里斯一如既往地担任队长。\n可悲的是，这周我们不得不以修正开始，因为我是1。哑巴，并且，2。见第一点。但在我们通过了SPAC的细微差别(大喊大卫·埃斯里奇)之后，我们有了一个全面的好东西展示，包括：\nY Combinator Demo Day将像以前一样虚拟起来，它即将到来的迭代也将是现场直播的。Equity团队都同意这是正确的做法，而且可能会更有趣。现在，创始人们也可以在现场活动中挥汗如雨了！太好了。\n说到现场活动数字化，“颠覆”即将到来。而且会很棒的。请在这里阅读更多内容。\n斯坦福大学商学院的一群学生正在组建一种投资工具，将资金投资到自己身上，这是一个好主意，也是非常可笑的事情。幸运的是，丹尼和娜塔莎对这一努力有好评。\nRo筹集了2亿美元，任何不恰当的笑话都是丹尼的错。该公司2亿美元的估值使得其竞争对手Hims可能通过SPAC上市的消息更加令人兴奋。\n我花了一大笔钱：2000万美元收购了Instrumental，这是一家让我大肆炒作的超级整洁初创公司。\nFacebook仍在寻找更好地了解成长型初创公司的方法-这一次是通过投资风险投资基金。\n最后，你可能听说过，本周有一些听证会。我们正在做一些你会喜欢的关于这个话题的整洁的东西，所以敬请关注。\n这就是本周的“公平”节目。我们周一早上很早就回来了，所以一定要密切关注我们的社交活动。拥抱，一会儿再聊！\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast ( now on Twitter!), where we unpack the numbers behind the headlines.\n We had the full team this week:  Myself,  Danny, and  Natasha on the mics, with  Chris running skipper as always.\n Sadly this week we had to kick off with a correction as I am 1. Dumb, and, 2. See point one. But after we got past SPAC nuances ( shoutout David Ethridge), we had a full show of good stuff, including:\n Y Combinator Demo Day is going virtual, as before, and its coming iteration will also be live. The Equity crew all agree that this is the right thing to do, and probably more fun to boot. And now the founders can sweat a live event, too! What fun.\n Speaking of live events going digital, Disrupt is coming up. And it is going to be great.  Read more here.\n A group of Stanford business school students are  putting together and investment vehicle to invest money into themselves, which is a good idea and something that is highly risible. Luckily, Danny and Natasha had good things to say about the effort.\n Ro raised $200 million, and any jokes that were inappropriate are Danny’s fault. The company’s $200 million valuation makes the news that its competitor Hims  could go public via a SPAC all the more exciting.\n I covered a neat round:  $20 million for Instrumental, a super neat startup that has me hype.\n Facebook is still hunting up ways to get a better look into growing startups — this time  via investments in venture capital funds.\n And, finally, there were  some hearings this week, you might have heard. We’re working on something neat that you are going to love on just that topic, so stay tuned.\n And that’s  Equity   for this week. We are back Monday morning early, so make sure you are keeping tabs on our socials. Hugs, talk soon!\n Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-07-31 21:31:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "薪酬,rule,可能", "title": "\n创始人薪酬的铁律已不复存在", "title_en": "\n\t\t\t\tThe iron rule of founder compensation is dead\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/the-iron-rule-of-founder-compensation-is-dead/", "via": "", "real_tags": ["薪酬", "rule", "可能"]}, {"category": "", "categoryclass": "", "imagename": "ccd483c55f3a41d5e9e7d2289e1769a2.jpg", "infoid": 1015408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自5月中旬以来，科技业的招聘信息一直低于整体招聘信息，几周来一直比去年的趋势低约36%。\n损害是普遍的，截至7月24日，在一半的科技中心和89%的非科技中心，科技招聘的表现逊于整体招聘。\n对科技工作岗位的竞争正在加剧，这可能在一定程度上是因为科技公司的在家工作选项。\n美国继续努力遏制冠状病毒及其对经济的影响。最近经济有所改善，但在病毒在南部和西部各州死灰复燃的情况下，新一轮封锁的可能性隐约可见。\n在危机之初，科技职位发布最初的表现好于整体发布。这可能是因为许多技术工作不需要太多面对面的互动。更重要的是，一些科技公司已经制定了远程工作政策，这使得扩大在家工作变得很容易。\n然而，随着疫情的发展，科技职位的表现现在比整体就业市场更差。科技帖子在5月中旬开始落后，从那以后，差距一直在稳步扩大。7月24日，整体职位发布趋势比2019年的水平低21%。但科技行业的就业岗位受到的打击更大，数周来稳定在低于去年水平36%的水平，而且没有任何反弹的迹象。\n科技公司未能复苏，可能是因为招聘和解雇成本过高。虽然餐厅可能会根据过去两周的需求招聘员工，但科技等行业的规划视野要长得多。由于有如此多的不确定性，正如国会预算办公室最新的经济展望所强调的那样，现在引进新员工可能是一个较低的优先事项。\n然而，并不是所有的科技工作都受到了同样严重的打击。截至7月24日，IT运营和服务台工作岗位比去年的趋势下降了32%，系统工程工作岗位减少了31%，总体上好于技术岗位。远程工作的广泛采用可能解释了为什么这些类型的技术工作做得更好。\n与此同时，软件开发工作与整体技术职位发布同步，比2019年的趋势低35%。但数据科学家和IT管理人员的职位发布趋势大幅下降，分别比一年前下降了43%和45%。人工智能和机器学习是软件开发的一个子组，在2019年的趋势下，这一比例为29%，这表明冠状病毒甚至打击了直到最近还是尖端科技工作的典范。\n截至7月24日，Indeed确定的所有八个科技中心的整体招聘趋势都下降了21%以上，而全国的整体降幅为21%。此外，在一半的枢纽中，科技帖子的恢复速度慢于整体帖子。这一差距在北卡罗来纳州罗利市最大，那里的整体招聘趋势比一年前下降了26%，而科技行业的招聘下降了45%。\n在科技中心之外，科技职位招聘表现不佳的情况更加明显。例如，在科技中心，截至7月24日，数据科学职位发布的趋势比一年前下降了37%，而在非中心，数据科学发布的职位减少了51%。与去年相比，数据科学家进出科技中心的职位大幅减少，这是一个相当大的转变，当时这一职业的候选人需求旺盛。雇主可能会将数据科学分析视为一项投资，而这项投资对企业来说并不是立竿见影的关键。\n这种在主要科技中心以外的科技帖子更大幅度下降的模式不仅在数据科学领域很明显，而且在所有科技子类别中都很明显。这可能是因为更老牌的科技公司往往位于科技中心，更有可能拥有安然度过危机的财力。\n非科技中心表现较差扭转了之前的趋势，即规模较小的科技中心一直在超越这八个中心。在冠状病毒存在巨大不确定性的情况下，科技公司可能会推动主要枢纽的集中化，而不是分散。\n随着科技职位的减少，求职者对该行业的相对兴趣有所上升。2月份，科技招聘信息的点击量占平均点击量的68%。截至7月24日，科技帖子吸引了95%的普通工作点击量。每条帖子的点击量更多意味着，相对于就业机会，比起COVID之前的时代，更多的人对这些工作感兴趣。这种更激烈的竞争可能意味着科技工人议价能力的丧失。如果更多的人想要这些工作，科技公司可能会缩减福利，比如无限制的个人休假。\n这种兴趣上升的部分原因可能是科技迅速而广泛地采用了在家工作。Facebook和Twitter等科技巨头发布的关于永久远程选项的公告无疑吸引了求职者的注意。\n在宣布这些消息的日子里，Twitter和Facebook每百万次搜索量的份额猛增。虽然“在线”和“在家工作”一直是冠状病毒期间快速增长的搜索词，但人们感兴趣的部分原因可能也是因为新员工不再需要住在物价超高的旧金山湾区。一个恰当的例子是：旧金山湾区的租金正在下降，可能是因为科技工人正在离开，而涌入的新科技工人已经萎缩。\n对于科技行业来说，这看起来还有很长的路要走。冠状病毒造成的经济损失是巨大的。而且，尽管整体就业市场有所复苏，但科技行业的招聘趋势尚未反弹。在广泛的科技领域，存在着各种不同的情况。IT帮助和系统工程工作的情况相对较好，而数据科学和IT管理的情况则较差。主要科技中心以外的科技工作尤其受到伤害，这些地区可能会失去在冠状病毒之前获得的相对于这些科技中心的阵地。这主要反映了冠状病毒产生的不确定性，这给业务预测蒙上了一层阴影，并使长期预算难以进行。\n随着科技行业招聘信息的减少和求职者兴趣的增加，该领域对行业工作的竞争正在升温。企业又回到了主动权，这可能会降低科技工作者的议价能力。此外，像无限制的休息时间和库存充足的小吃店这样的福利可能会被砍掉。不过，与此同时，如果该行业广泛采用永久远程工作，科技劳动力的地理位置可能会大幅多样化。除非发生这种情况，否则就业机会可能会继续集中在主要的科技中心，收紧硅谷等地对这一经济战略部分的控制。\n科技职位是通过精心挑选的564个与科技相关的职位名单来确定的。被分析的大都市的最低人口为25万。这六个突出的科技类别占所有科技工作岗位的93%。\n为了衡量职位发布的趋势，我们计算了美国职位发布数量的7天移动平均数。我们将每一天的7天移动平均数索引到当年年初(2020年2月1日=100，对于2020年数据，依此类推)或另一个日期(如果在图表中指定了的话)。\n我们报道今年的职位发布趋势与去年的趋势有何不同，以关注最近因新冠肺炎而发生的劳动力市场状况的变化。例如，如果一个国家的招聘信息从2019年2月1日到2019年5月22日增加了30%，但从2020年2月1日到2020年5月22日只增加了20%，那么2019年该指数将从100上升到130,2020年将从100上升到120。因此，与2019年相比，2020年5月22日的年初至今职位发布趋势将下降7.7%(120个比130低7.7%)。\n安妮·伊丽莎白·康克尔(AnnElizabeth Konkel)是“确实招聘实验室”(Indeed Recruiting Lab)的经济学家，专注于美国劳动力市场。她之前在国际开发公司DAI工作。安妮·伊丽莎白在美国大学国际服务学院获得国际经济学硕士学位，并在芒特霍利奥克学院获得历史学学士学位。", "note_en": "Since mid-May, tech job postings have trended below overall job postings and for weeks have remained approximately 36% below last year’s trend.\n The damage is widespread, with tech postings doing worse than job postings overall in half of tech hubs and 89% of non-tech hubs as of July 24.\n Competition for tech jobs is rising, which may be due in part to tech’s work-from-home options.\n The US continues to struggle to contain coronavirus and its economic fallout. The economy has  improved recently, but the possibility of another round of lockdowns looms amid a resurgence of the virus in southern and western states.\n At the beginning of the crisis, tech job postings initially fared better than overall postings. That may be because lots of tech work doesn’t require much face-to-face interaction. What’s more, some tech companies already had remote work policies in place, making it easy to scale up work from home.\n   However, as the pandemic progresses, tech postings now are performing worse than the overall job market.  Tech postings started to fall behind in mid-May and, since then, the gap has grown steadily. On July 24, the overall job postings trend was 21% below its 2019 level. But tech jobs were hit harder, settling at 36% below last year’s level for weeks and showing no signs of bouncing back.\n Tech’s failure to recover is probably due to the high cost of hiring and firing. While a restaurant may take on workers based on demand experienced over the past two weeks, sectors like tech have much longer planning horizons. And with so much uncertainty, as highlighted in the Congressional Budget’s Office latest  economic outlook, bringing on new employees may be a low priority now.\n However, not all tech jobs have been hit equally hard. Through July 24, IT operations and help desk jobs were down 32% and system engineering jobs 31% from last year’s trend, better than tech jobs overall. Wide adoption of remote work probably explains why these types of tech jobs are doing better.\n Meanwhile, software development jobs are in sync with overall tech postings at 35% below the 2019 trend. But data scientist and IT management posting trends are down sharply, at 43% and 45% below a year ago respectively. Artificial intelligence and machine learning, a subgroup of software development, is 29% under the 2019 trend, showing that coronavirus has pummelled even what until recently was the poster child for cutting-edge tech jobs.\n   Through July 24, the overall job postings trend in all of the  eight tech hubs identified by Indeed, was down more than the 21% decline in overall postings nationally. In addition, in half the hubs, tech postings are recovering slower than overall postings. The gap is widest in Raleigh, NC, where the overall postings trend was down 26% from a year ago, while tech job postings were off 45%.\n Outside tech hubs, the underperformance of tech job postings is even more pronounced. For example, in tech hubs, data science job postings were trending 37% below a year ago as of July 24, while in non-hubs, data science postings were off 51%. The plunge in postings for data scientists both in and out of tech hubs is quite a turnaround from last year, when candidates for this occupation were in  hot demand. Employers may be viewing data science analysis as an investment that isn’t immediately critical for business.\n This pattern of a greater decline in tech postings outside major tech hubs is evident not only in data science, but in all tech subcategories. This may be because more-established tech companies, which often are sited in tech hubs, are more likely to have the financial resources to ride out a crisis.\n  The poorer performance of non-tech hubs reverses the previous tendency, in which smaller tech centers had been  gaining on the eight hubs. Amid great uncertainty about coronavirus, tech companies may be pushing for centralization in major hubs rather than dispersion.\n   As tech postings have declined, relative job seeker interest in the sector has risen. In February, tech job postings received 68% of the clicks of the average posting. By July 24, tech postings were attracting 95% of the clicks of the average job. More clicks per posting means that, relative to employment opportunities, more people are interested in these jobs than in the pre-COVID era. This greater competition could spell a loss of bargaining power for tech workers. If more people want these jobs, tech companies may scale back  benefits like unlimited personal time off.\n Some of this rising interest is probably driven by tech’s quick and widespread adoption of work from home. Announcements about permanent remote options from tech giants like Facebook and Twitter undoubtedly grabbed job seekers’ attention.\n  On the days of these announcements, the share of searches per million for Twitter and Facebook skyrocketed. And while ‘online’ and ‘wfh’ (work from home) have been  fast-growing search terms during coronavirus, some of the interest may also be because it is no longer necessary for new hires to live in the hyper-expensive San Francisco Bay Area. Case in point: rent in the Bay area  is falling, probably because tech workers are leaving and the influx of new tech workers has shriveled.\n  It looks to be a long road ahead for the tech sector. The economic damage caused by coronavirus has been vast. And, even though the overall job market has recovered a bit, the tech job postings trend has yet to bounce back. Within the broad tech sector, there are variations. IT help and system engineering jobs are faring relatively better, while data science and IT management are doing worse. Tech jobs outside the major tech hubs are especially hurting, and these areas could lose the ground they had gained on those tech centers before coronavirus. This mainly reflects the uncertainty generated by coronavirus, which is clouding business forecasts and making it tough to carry out long-term budgeting.\n With fewer tech job postings and increased job seeker interest,in the field, competition for sector jobs is heating up. Companies are back in the driver’s seat, which could reduce tech worker bargaining power. In addition, benefits like unlimited time off and well-stocked snack bars could go on the chopping block. At the same time though, substantial geographic diversification of the tech workforce could occur if the sector widely adopts permanent remote work. Unless that happens, jobs may continue to concentrate in the major tech hubs, tightening the hold of places like Silicon Valley on this strategic part of the economy.\n  Tech jobs were identified using a curated list of 564 tech-related job titles. Metros analyzed had a minimum population of 250,000. The six highlighted tech categories make up 93% of all tech jobs.\n To measure job posting trends, we calculated the seven-day moving average of the number of US job postings on Indeed. We indexed each day’s seven-day moving average to the start of that year (Feb 1, 2020 = 100 for 2020 data, and so on) or another date if specified in the chart.\n We report how the trend in job postings this year differs from last year’s trend in order to focus on recent changes in labor market conditions due to COVID-19. For example, if job postings for a country increased 30% from February 1, 2019, to May 22, 2019, but only 20% from February 1, 2020, to May 22, 2020, then the index would have risen from 100 to 130 in 2019 and 100 to 120 in 2020. The year-to-date job posting trend would therefore be down 7.7% on May 22 (120 is 7.7% below 130) in 2020 relative to 2019.\n AnnElizabeth Konkel is an Economist on the Indeed Hiring Lab who focuses on the US labor market. She previously worked at DAI, an international development company. AnnElizabeth holds an M.A. in International Economics at American University’s School of International Service and holds a B.A. in history from Mount Holyoke College.", "posttime": "2020-07-31 21:29:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "感受,sector,科技", "title": "科技界感受新冠肺炎的经济阵痛", "title_en": "Tech Sector Feeling Covid-19’s Economic Pain", "transed": 1, "url": "https://www.hiringlab.org/2020/07/30/tech-sector-covid19-impact/", "via": "", "real_tags": ["感受", "sector", "科技"]}, {"category": "", "categoryclass": "", "imagename": "edd93fbea0894d153e943bf0e2ba2325.jpg", "infoid": 1015407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如他们所说，空间很大。道格拉斯·亚当斯(Douglas Adams)在1979年出版的“银河系漫游指南”(The Pitchhiker‘s Guide to the Galaxy)一书中详细阐述道：“你可能认为通往化学家的路还很长，但那只是小菜一碟。”当我们大多数人甚至难以想象地球的大小，更不用说星系或广袤的星际空间时，很难用日常语言来表达宇宙的浩瀚。我们经常谈论光年--光在一年中可以行进的距离--好像光速在某种程度上比写在数万亿公里上的数字更直观。我们用同样的术语给出基准(光在地球和月球之间旅行需要1.3秒)，但是，在我们的日常经验中，光是瞬间的。我们不妨从原子堆积的角度来讨论建筑物的高度。\n也许，如果我们感觉更有冒险精神，我们会根据个人经验进行类比。到月球的距离是3200万辆校车！如果你能以每小时60英里的速度开着一辆校车去那里，你需要166天！我不确定这有什么帮助。\n我希望我能说天文学家对这一切有更好的直觉把握。我们没有。大脑不是真的那样工作的。所以我们用数字作弊。我们用更长的尺度来谈论更大的空间：公里、光年、分秒、千帕秒、兆秒、千兆秒。我们习惯于指数(1000等于103；1万亿等于1012)，并在对数区间内思考，其中每一连续的步长都是10的新幂。在某种程度上，距离完全不再是一个简单的概念。在太阳系这里，空间和时间或多或少都表现良好，但当你不得不将宇宙作为一个整体来处理时，你必须考虑到它拒绝静静地坐着适应它的事实。在太阳系里，空间和时间或多或少都表现得很好，但当你不得不处理整个宇宙时，你必须考虑到它拒绝静止不动的事实。\n空间正在扩张。这是从宇宙大爆炸开始的，而且不会很快停止。如果你看一个很远很远的星系，你不仅要考虑到你正在看的图像是旧的，你还必须考虑到它已经不再是你看到它时的位置了。比方说，你看到一颗超新星在10亿光年以外的星系爆发。超新星是刚刚爆炸，还是在10亿年前就爆炸了？你可以说后者，因为光已经向我们传播了十亿年，但既然当时没有办法观察它，那么说它在过去熄灭了到底是什么意思呢？还有那个10亿光年远的星系--它到底有多远？也许10亿年前它距离我们10亿光年，但是宇宙一直在膨胀，所以现在它一定要远得多。我们使用的距离是多少？\n即使是时间也会因为空间的伸展而被扭曲。我们可以看到那颗正在爆炸的恒星在冲击波撕裂的过程中变亮和变暗，据说它花了大约100天才消失。但如果我们将它与附近的超新星进行比较，平均而言，我们会发现距离较远的超新星所需的时间要长几天。从我们的角度来看，它是以慢动作爆炸的。\n即使有定义的限制，我们也会尽最大努力测量我们的空间，并量化其最远的范围。我们已经对无数星系进行了分类，其中一些星系非常遥远，它们的光几乎花了整个宇宙的一生才能到达我们这里。我们已经搜索了我们的宇宙地图，寻找一些边缘或中心的迹象，但没有找到。我们没有理由相信宇宙不会在内容或结构没有任何重大变化的情况下，在各个方向上永无止境。我们的银河系是广袤无垠的沙漠中的一粒沙子；放大到足够远，一切看起来大同小异。\n不过，这是有限制的。无论我们的望远镜多么强大，无论我们凝视多久，我们都看不到比我们称之为“可观察的宇宙”的宇宙气泡边缘更远的东西。这是一个虚构的球体，以我们为中心，由光速和宇宙年龄来定义。这个气泡的半径是一束光在整个宇宙中传播时所能覆盖的距离。\n如果我们每次向外看宇宙的时候，我们都在看过去，那么顺理成章地说，看得足够远就意味着要把时间看得那么远，这就是宇宙最初形成的时刻。这就是定义我们宇宙地平线的东西。换句话说，任何超出我们宇宙视界的东西都是如此遥远，以至于即使在138亿年前宇宙开始的那一刻就有光束离开了它，距离也是如此之远，以至于光束还没有来得及到达我们这里。时间还不够。\n我们有很好的理由相信，在这个看似无边无际的宇宙中，地平线之外有星系，就像当你站在海洋岸边，除了水什么也看不见一样，你有理由相信最终会有陆地在那里，超出你所能看到的范围。如果你跳上一艘船离开，你的地平线会随你一起移动，你最终会看到那片陆地。类似地，如果你可以乘坐星际火箭飞船前往宇宙的另一部分，无论你在哪里，你的地平线仍然会以你为中心。不幸的是，尽管我们受到物理定律和出行方式的限制，但要离家足够远来显著改变我们的视野是不切实际的。但是我们仍然可以推断出在它之后可能会有什么。尽管宇宙地平线和地球上的地平线一样是主观的边界，但它有一个非常重要的区别。\n当我们看向可观察宇宙的边缘时，我们看到的是真正令人震惊的东西。最远的光也是最古老的，它是来自大爆炸本身的光。早期的宇宙，就在创世的第一个时刻之后，又热又密，到处都是振动的等离子体嗡嗡作响；就在我们的视觉边缘，我们正在回顾过去，到目前为止，我们真的看到了发光的等离子体。这场大火持续了大约38万年，直到空间膨胀和冷却到足以让光和粒子自由通过它。当我们看着可观察到的宇宙边缘时，我们看到的是那个炽热致密相的最后几个阴燃的余烬。我们看到的是一个仍在燃烧的宇宙。\n到我们宇宙地平线的距离并不像你想象的那样，138亿光年。正如我们上面所讨论的，在不断膨胀的宇宙中，距离是很奇怪的。当它的光开始向我们行进时，距离我们138亿光年的东西现在更远了。如果你把所有这些因素都考虑进去，我们在可观测宇宙边缘看到的发光等离子体现在实际上是在大约450亿光年之外的某个地方。\n仅仅因为我们看不到火热的地平线以外的东西，并不意味着那里什么都没有。我们所拥有的证据，研究了我们绘制的宇宙中每个部分的星系的同一性，都指向这样一个概念，即空间在各个方向上都远远超出了我们的视界；我们视野的限制是间接的。如果我们碰巧生活在我们目前地平线之外的一个星系中，我们对宇宙的所有了解都表明，我们从那里看到的景象与我们从这里看到的景象非常相似。当然，原则上，非常遥远的宇宙可能是完全不同的--如果不能看到它们，我们就不能确定。事实上，在我们的地平线之外足够远的区域甚至可以被认为是独立的、孤立的宇宙，因为它们不能与我们的宇宙相互作用。\n但是，如果宇宙不仅比我们所感知的要大，而且甚至比我们所能感知的还要大，那该怎么办呢？如果它向每个方向延伸，然后再向更多方向延伸呢？\n我们的日常经验告诉我们，空间是有三个维度的。前/后，左/右，上/下。在物理学中，我们将时间描述为第四维，并将其整个包装为时空--一种可弯曲的四维宇宙网格。时空的可延展性是阿尔伯特·爱因斯坦相对论的一个基本原则，它允许网格随着其中万物的运动和质量而扭曲和伸展。这就是为什么空间可以膨胀和扭曲时间的流逝，也是为什么当你乘坐快速火箭或在黑洞附近闲逛时，时间移动得更慢的原因。\n然而，物理学家们多年来一直在想，我们所经历的三维空间是否只是画面的一部分。如果有更多的空间维度，向我们无法感知的新方向延伸，这可能有助于解释理论物理和重力行为的一些令人费解的方面。给宇宙增加一个额外的空间维度，你会发现引力可以“泄漏”到宇宙中，使作用力看起来比实际情况更弱，并潜在地解释了为什么与支配粒子物理的力相比，它的强度是如此微不足道。\n更高维度的空间也是弦理论的要求，该理论假设我们所看到的基本粒子实际上是在比我们所能看到的更多维度上振动的能量弦。在这些理论中，额外的维度是“紧凑的”--自我卷曲--因此，如果你真的设法找到了一个新的方向，开始了一段旅程，在你回到起点之前，你不会走得很远。\n21世纪初提出的一种关于我们宇宙结构的假说认为，我们可能生活在一个四维空间(加上时间)的更大空间边缘的三维“膜”(想一想：膜)中。在这个更高维度的“块状”中，可能会有另一个3D膜，包含另一个宇宙，它可能会不时地撞上我们自己的宇宙。这一理论的创始人将其称为宇宙的“热能”模型，这源于希腊语中火灾的一个术语-这是对这样一个事实的认可，即每次宇宙碰撞都会导致大爆炸的炽热条件，并可以解释我们宇宙的起源和最终命运。在这个模型中，膜交替地朝向彼此，碰撞，然后再次分开，在一个无穷无尽的循环中，从大爆炸到膨胀，再到大破裂，再回到大爆炸。在这个模型中，我们今天在宇宙中看到的结构模式(星系和星系团的分布)是由爆炸前缓慢塌缩阶段的两个膜之间的相互作用播种的。\n乍一看，仅仅为了解释大爆炸而假设更高的维度和新的宇宙可能看起来有些奢侈，但物理学家认真对待这些想法是有充分理由的。早期宇宙的标准图景可能比你想象的要复杂得多。当你想到大爆炸时，你首先想到的可能是一个奇点-一个无限密度的无穷小点，包含了所有的空间和时间，突然爆炸创造了整个宇宙。这个想法之所以流行起来，是因为爱因斯坦的引力方程可以描述这样开始的宇宙(也许最后会用一个大压缩奇点来包裹自己)，但它与我们在观察中看到的情况并不相符。我们在宇宙地平线上看到的背景光，大爆炸的余辉，告诉我们从奇点到我们现在享受的大而美丽的宇宙的简单进化是没有意义的。\n问题是大爆炸的余辉，也就是我们所说的宇宙微波背景，太完美了。其精确度高得离谱(十万分之一)，在每个方向上看起来都是一样的。相同的颜色(或者，更确切地说，频率，因为它是微波光)，相同的光谱，相同的强度。这是个问题的原因是因为没有理由天空相对的两个区域应该以这种方式匹配。即使一切都是一起开始的，包裹在一个奇点中，它向外扩展的方式应该会在早期宇宙的不同部分带来极端的差异。在宇宙演化的火球扩张阶段，现在彼此相距甚远的地区从未有机会就温度是多少达成一致。宇宙微波背景在天空的一侧应该与在另一侧截然不同。\n物理学家在20世纪80年代确定的解释为我们的宇宙故事增添了新的篇章。他们说，如果在非常早期的宇宙中，在炽热的火球阶段之前，有一段极其迅速的膨胀时期，会发生什么呢？也许就在奇点之后(假设有一个奇点)，早期的宇宙真的是一片混乱--有些地方热得多，有些地方冷得多。但后来宇宙膨胀得如此之快，以至于一小块太小而没有太大变化的小块延伸到足以组成我们整个可观测的宇宙。然后，物理学家们假设，无论宇宙中有什么奇怪的新成分导致了超伸展(我们称之为“宇宙膨胀”)突然在各处衰变成辐射，并点燃了我们今天探测到的背景光中可见的膨胀的火球宇宙。\n从我们到目前为止所看到的情况来看，通货膨胀似乎与我们目前的模式运作得很好，甚至很好地解释了在宇宙微波背景光中观察到的每10万人中就有一次微小的波动。但我们没有任何人所说的确凿证据证明它发生了，我们也不能说它是如何或为什么开始的，也不能说是什么驱使它发生的。\n顺便说一句，即使在通货膨胀的模式下，被另一个宇宙击中的可能性也不是完全不可能的。\n如果膨胀真的发生了，那么创造我们可观察到的宇宙的一系列事件可能会在一个更大的空间的不同部分反复发生，这个过程被称为“永恒的膨胀”。我们的想法是，更大的背景空间总是在膨胀，但偶尔，在其中的一小部分，膨胀会停止；宇宙的那一部分升温，正常的宇宙膨胀占据主导地位。这将创造一种多元宇宙，因为由那些独立的后通胀区域定义的小泡沫宇宙不断从膨胀的背景中消失。每个气泡宇宙都会被不断膨胀的空间隔开，不能相互作用。大部分。\n每周一次\n天文学家已经寻找过这些瘀伤。到目前为止还没有人出现，但我们会继续搜索。与此同时，我们中的一些人将继续对通胀图景持怀疑态度，因为它的引擎未知，具有无限的多样性，并试图找到一些更令人满意的替代方案。\n至于放热模型，多年来它经历了多次修订，目前的版本根本不涉及更高维度或宇宙碰撞。在某些方面，它看起来更像是膨胀：不是由薄膜的运动驱动的，而是由标量场的演化驱动的，标量场是一种充满空间的能量场，类似于大多数物理学家认为助长了宇宙膨胀的东西。(一些新的通胀模型也涉及薄膜世界，只是为了让事情变得有趣。)。尽管不再需要巨大的宇宙碰撞，热释模型仍然包含了宇宙塌陷和大爆炸之间的过渡。然而，在新的版本中，崩塌可能是相对温和的，导致在引发新周期的大火之前产生一点压缩。如果它以这种方式永远循环下去，而不是无穷无尽的袖珍宇宙，我们更大的空间将是一个巨大的、不断增长的宇宙：不断扩张，呼吸，然后再扩张，一遍又一遍。\n定义我们可观测的宇宙的宇宙地平线是一个硬限制。我们看不到它以外的东西，除非我们对现实结构的理解发生巨大变化，否则我们可以确信我们永远也看不到。宇宙的膨胀正在加速；现在任何超出我们视界的东西都会越来越快地从我们身边消失，它的光线将永远赶不上我们。虽然我们可能永远不能肯定地说出边界之外的是什么，但所有理论的共同点是，我们的可观测宇宙是一个大得多的空间的一部分。\n这个空间是否包含气泡的多元宇宙，每个气泡都有不同的物理定律；是否它是一个不断增长的宇宙的一部分，我们在一个周期中只是其中的一部分；或者空间是否以我们无法想象的方向向外延伸，我们目前只是不知道。但我们在寻找线索。\n宇宙微波背景光的模式，星系的分布，甚至测试重力和粒子物理行为的实验，都让我们洞察到宇宙的基本结构，以及它在最早时刻的演化。我们离能够讲述我们整个宇宙的故事越来越近了。我们已经可以直接看到我们的宇宙在火焰中锻造，就在它开始之后的那一刻。有了我们现在正在收集的线索，有一天我们可能会一直追踪到故事的结尾。\n本文基于Katie Mack即将出版的新书“万物的终结(从天体物理学的角度讲)”，该书由斯克里布纳于2020年8月4日出版。\n这篇文章是在约翰·邓普顿基金会对永旺的资助下完成的。本出版物中表达的观点是作者的观点，不一定反映基金会的观点。永旺杂志的资助者不参与编辑决策。", "note_en": "Space, as they say, is big. In  The  Hitchhiker’s Guide to the Galaxy (1979), Douglas Adams elaborates: ‘You may think it’s a long way down the road to the chemist, but that’s just peanuts to space.’ It’s hard to convey in everyday terms the enormity of the cosmos when most of us have trouble even visualising the size of the Earth, much less the galaxy, or the vast expanses of intergalactic space. We often talk in terms of light-years – the distance light can travel in a year – as though the speed of light is somehow more intuitive than a number written in the trillions of kilometres. We give benchmarks in the same terms (it takes light 1.3 seconds to travel between the Earth and the Moon) but, in our everyday experience, light is instantaneous. We might as well talk about the height of a building in terms of stacking up atoms.\n Maybe, if we’re feeling more adventurous, we use analogies based on personal experience. The distance to the Moon is 32 million school buses! If you could drive there in one of those school buses, going at 60 miles per hour, it would take you 166 days! I’m not sure that helps.\n I wish I could say that astronomers have a better intuitive grasp of all this. We don’t. Brains don’t really work that way. So we cheat with numbers. We use longer yardsticks to talk about bigger spaces: kilometres, light-years, parsecs, kiloparsecs, megaparsecs, gigaparsecs. We get comfortable with exponents (1,000 is 10 3; 1 trillion is 10 12) and think in logarithmic intervals, where each successive step is a new power of 10. At some point, distance stops being a straightforward concept entirely. Here in the Solar System, space and time are both more or less well-behaved, but when you have to deal with the cosmos as a whole, you have to factor in the fact that it refuses to sit still for its fitting.\n Space is expanding. It has been since the Big Bang, and it’s not stopping any time soon. If you look at a galaxy far, far away, not only do you have to factor in that the image you’re looking at is old, you have to account for the fact that it’s no longer where it was when you saw it. Let’s say you see a supernova go off, in a galaxy a billion light-years away. Did the supernova just go off, or did it go off a billion years ago? You can say the latter, because the light has been travelling to us for a billion years, but since there was no way to observe it back then, what does saying that it went off in the past even mean? And that billion-light-year-distant galaxy – how far away is it, really? Maybe a billion years ago it was a billion light-years away, but the Universe has been expanding all that time, so now it must be much farther. Which distance do we use?\n Even time is distorted by the stretching of space. We can watch the brightening and dimming of that exploding star, as the shockwave tears through it, and say it took about 100 days to fade away. But if we compare it with a  supernova nearby, on average, we’ll see that the distant one takes a few days longer. From our perspective, it’s exploding in slow motion.\n Even with the limitations of definition, we do our best to measure our space and quantify its farthest reaches. We have catalogued countless galaxies, some so distant that their light has taken almost the entire lifetime of the cosmos to reach us. We have  searched our maps of the cosmos for some indication of an edge, or a centre, and found none. We have no reason to believe the cosmos doesn’t just go on forever, in every direction, without any significant change in content or structure. Our galaxy is a single grain of sand in a vast unbroken desert; zoom out far enough, and everything  looks more or less the same.\n There is a limit, though. However powerful our telescopes, and however long we stare, we will never see anything farther away than the  edge of the cosmic bubble we call our ‘observable universe’. This is an imaginary sphere, centred on us, and defined by the speed of light and the age of the cosmos. The radius of this bubble is the distance that a beam of light could cover if it travelled for the  entire age of the Universe.\n If every time we look out into the cosmos, we’re looking into the past, it stands to reason that looking far enough away could mean looking at the time so far into the past, it’s the moment when the Universe first formed. That’s what defines our  cosmic horizon. Put another way, anything beyond our cosmic horizon is so far away that even if a light beam left it at the very moment the Universe started, 13.8 billion years ago, the distance is so vast that the light beam hasn’t had time to reach us yet. There hasn’t  been enough time.\n  We have good reason to believe that in this apparently boundless universe, there are galaxies beyond the horizon, just as, when you stand on the ocean shore and see nothing but water, you have reason to believe there’s land out there eventually, beyond what you can see. If you jumped in a ship and sailed away, your horizon would move with you, and you would eventually see that land. Similarly, if you could take off in an interstellar rocket ship to another part of the cosmos, your horizon would still be centred on you, wherever you were. Unfortunately, limited as we are by the laws of physics and the constraints of our modes of travel, getting far enough from home to significantly change our field of view isn’t practical. But we can still make inferences about what might lie beyond it. And despite the cosmic horizon being as subjective a boundary as a horizon is on Earth, it has one very important difference.\n When we look out to the edge of the observable universe, what we see is something truly astounding. The most distant light is also the oldest; it’s the light from the Big Bang itself. The early universe, right after the first moments of creation, was hot and dense, everywhere, humming with vibrating plasma; right at the edge of our vision, we’re looking into the past so far that we literally see that glowing plasma. The inferno persisted for around 380,000 years before space expanded and cooled enough that light and particles could travel freely through it. When we look at the edge of the observable universe, we see the last smouldering embers of that hot dense phase. We see a cosmos that is still on fire.\n  The distance to our cosmic horizon is not, as you might expect, 13.8 billion light-years. As we discussed above, distances are weird in an expanding universe. Something that was 13.8 billion light-years away when its light started the journey toward us is much farther away now. If you factor all that in, that glowing plasma we see at the very edge of the observable universe is actually somewhere around 45 billion light-years away now.\n Just because we can’t see things beyond our fiery horizon, it doesn’t mean that there’s nothing there. The evidence we have, studying the same-ness of galaxies in every part of the cosmos we’ve mapped,  points to the notion that space continues far beyond our horizon, in every direction; the limits to our vision are circumstantial. If we happened to live in a galaxy that lies just outside our current horizon, everything we know of the cosmos suggests that our view from there would look pretty similar to the view we have from here. Very distant reaches of the cosmos could, in principle, be totally different, of course – we can’t know for sure without being able to see them. In fact, regions far enough beyond our horizon can even be considered to be separate, isolated universes of their own, for all practical purposes, since they can’t interact with ours.\n But what if the universe isn’t just bigger than we perceive, circumstantially, but bigger than we even  can perceive? What if it extends in every direction, and then some?\n Our everyday experience tells us that space has three dimensions. Front/back, left/right, up/down. In physics, we describe time as a fourth dimension, and wrap the whole thing up as spacetime – a kind of bendy 4D cosmic grid. The malleability of spacetime, a basic tenet of Albert Einstein’s relativity, allows that grid to warp and stretch in response to the motion and mass of everything in it. It’s why space can expand and distort the passage of time, and why time moves more slowly if you’re in a fast rocket or hanging out near a black hole.\n However, physicists have been wondering for years whether the three dimensions of space we experience might be only part of the picture. If there are more spatial  dimensions, extending out in new directions we can’t perceive, that could help to explain some puzzling aspects of theoretical physics and the behaviour of gravity. Add an extra dimension of space to the Universe, and you find that gravity can ‘leak’ out into it, making the force seem weaker than it really is, and potentially explaining why its strength is so minuscule compared with the forces governing particle physics.\n  Higher dimensions of space are also a requirement for string theory, which postulates that what we see as elementary particles are actually strings of energy vibrating in several more dimensions than we can see. In those theories, the extra dimensions are ‘compactified’ – curled up on themselves – so that if you  did manage to find one of those new directions and set out on a journey, you wouldn’t be able to go very far before you ended up right back where you started.\n  One hypothesis for the structure of our cosmos, developed in the early 2000s, suggests that we might live in a three-dimensional ‘brane’ (think: membrane) on the edge of a larger space with four spatial dimensions (plus time). Inside that higher-dimensional ‘bulk’ there could be another 3D brane, containing another universe, that might, from time to time, come crashing into our own. This theory’s originators  called it the ‘ekpyrotic’ model of the cosmos, after a Greek term for conflagration – a nod to the fact that each cosmic collision would result in the fiery conditions of the Big Bang, and could explain the origin and eventual fate of our universe. In this model, the branes alternately move toward each other, collide and then move apart again, in an endless cycle, going from Big Bang, to expansion, to Big Crunch, and back to Big Bang. The patterns of structure we see in the cosmos today (distributions of galaxies and clusters) are, in this model, seeded by the interaction between the two branes in the slow collapse phase before the Bang.\n While it might seem extravagant at first glance to postulate higher dimensions and new universes just to explain the Big Bang, there are good reasons why physicists take these ideas seriously. The standard picture of the early universe is probably more complicated than you’ve been led to believe. When you think of the Big Bang, the first thing to come to mind is likely to be a singularity – an infinitesimal point of infinite density containing all of space and time that suddenly explodes out to create the entire cosmos. That idea became popular because Einstein’s equations of gravity can describe a cosmos that begins that way (and perhaps wraps itself up with a Big Crunch singularity at the end), but it doesn’t work with what we see in our observations. That background light we see right at the cosmic horizon, that afterglow of the Big Bang, tells us that a simple evolution from a singularity to the big beautiful universe we enjoy now just doesn’t make sense.\n The problem is that the Big Bang’s afterglow, what we refer to as the cosmic microwave background, is too perfect. To an absurd degree of precision (one part in 100,000), it looks the same, in every direction. Same colour (or, rather, frequency, since it’s microwave light), same spectrum, same intensity. The reason that’s a problem is because there’s no reason why two regions on opposite sides of the sky should match in that way. Even if everything started together, wrapped up in a singularity, the way it expanded outward should have introduced extreme differences in different parts of the early cosmos. Regions that are now far apart from each other in the expanding fireball stage of cosmic evolution never had a chance to come to an agreement on what temperature to be. The cosmic microwave background should be drastically different on one side of the sky than it is on the other.\n The explanation that physicists settled on in the 1980s inserted a new chapter into our cosmic story. What if, they said, in the very early cosmos, before the hot fireball stage, there was a period of extremely rapid expansion? Maybe right after the singularity (assuming there was one), the early cosmos really was a patchy mess – much hotter in some places, and cooler in others. But then the cosmos expanded so rapidly that one tiny patch, too small to have much variation, stretched out until it was large enough to make up our entire observable universe. Then, the physicists hypothesised, whatever weird new component of the Universe caused that super-stretching (we call it ‘cosmic inflation’) suddenly decayed everywhere into radiation and ignited the expanding-fireball-cosmos visible in the background light we detect today.\n From what we’ve seen so far, inflation seems to work well with our current paradigm, and even nicely explains the little one-part-in-100,000 fluctuations observed in the cosmic microwave background light. But we don’t have what anyone would call solid proof that it happened, nor can we say how or why it started, or what drove it.\n And, by the way, even in the paradigm of inflation, the possibility of getting smacked by another universe is not entirely out of the question.\n  If inflation did happen, the sequence of events that created our observable universe could have occurred time and time again in different parts of a much larger space, in a process  called ‘eternal inflation’. The idea is that the larger background space is  always inflating but, once in a while, in a small part of it, inflation stops; that bit of universe heats up, and normal cosmic expansion takes over. This would create a kind of multiverse, as little bubble universes, defined by those separate post-inflation regions, continually drop out of the inflating background. Each bubble universe would be separated from the others by that constantly expanding space, and would be incapable of interacting with each other. For the most part.\n Once in a while, two bubble universes might appear close together. If they do, and if each continues to expand, they might at some point collide, leaving bubble-shaped imprints like bruises on each other’s background light.\n Astronomers have looked for those bruises. None have appeared so far, but we’ll keep searching. And meanwhile, some of us will continue to look askance at the inflation picture, with its unknown engine and its infinite multiverses, and try to find some more palatable alternative.\n As for the ekpyrotic model, it’s undergone a number of revisions over the years, and the current  version doesn’t involve higher dimensions or cosmic collisions at all. In some ways, it looks more like inflation: driven not by the motion of branes but by the evolution of a scalar field, a species of space-filling energy field similar to what most physicists think fuelled cosmic inflation. (And some new models of inflation  involve brane worlds too, just to keep things interesting.) Despite no longer requiring grand cosmic collisions, the ekpyrotic model still includes a transition between a collapsing universe and a Big Bang. In the new version, though, the collapse might be a relatively modest one, resulting in a little bit of compression before the sparking of the conflagration that starts the new cycle. If it cycles on and on forever that way, rather than endless pocket universes, our larger space would be one giant, ever-growing cosmos: expanding, taking a breath, and expanding again, over and over.\n The cosmic horizon defining our observable universe is a hard limit. We can’t see beyond it, and unless our understanding of the structure of reality changes drastically, we can be confident we never will. The expansion of the cosmos is speeding up; anything beyond our horizon now will be carried away from us faster and faster, and its light will never be able to catch up. While we might never be able to say with certainty what lies beyond that border, what all the theories have in common is that our observable universe is part of a much, much larger space.\n Whether that space contains a multiverse of bubbles, each with different physical laws; whether it’s part of an ever-growing cosmos of which we are only one part, in one cycle; or whether space extends outward in directions we can’t conceive, we currently just don’t know. But we’re  seeking clues.\n The patterns in the cosmic microwave background light, the distribution of galaxies, and even experiments testing gravity and the behaviour of particle physics are giving us insight into the fundamental structure of the Universe, and into its evolution in its earliest moments. We are getting closer and closer to being able to tell our whole cosmic story. We can already see, directly, the fire in which our universe was forged, the moments just after its beginning. With the clues we are gathering now, we might, someday, follow the story all the way to its end.\n This Essay is based on Katie Mack’s forthcoming book,   The End of Everything (Astrophysically Speaking) , publishing on 4 August 2020 by Scribner.\n This Essay was made possible through the support of a grant to Aeon from the John Templeton Foundation. The opinions expressed in this publication are those of the author and do not necessarily reflect the views of the Foundation. Funders to Aeon Magazine are not involved in editorial decision-making.", "posttime": "2020-07-31 21:29:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宇宙,space", "title": "大空间：我们的宇宙地平线既遥不可及，又比以往任何时候都更近", "title_en": "Big Space: Our cosmic horizon is both unreachable and closer than ever", "transed": 1, "url": "https://aeon.co/essays/our-cosmic-horizon-is-both-unreachable-and-closer-than-ever", "via": "", "real_tags": ["宇宙", "space"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然新的北欧联合协议的谈判正在如火如荼地进行，但谷歌已经选择以尽可能强大的方式利用他们在市场上的绝对主导地位。7月30日星期四晚，谷歌宣布他们将很快删除YouTube上所有的丹麦音乐内容。\n在北欧收藏协会联盟北极星(Polaris)的主持下，关于在YouTube上使用音乐的北欧联合协议的谈判目前正在如火如荼地进行。该协议将取代挪威、芬兰和丹麦作曲家和词曲作者协会的地方协议，将它们合并为与谷歌的单一联合协议。在科达的案例中，丹麦的国家协议于4月份到期，之后暂时延长-这是该行业在谈判新协议时的标准做法。\n然而，现在谷歌提出了一个新的要求：如果协议要暂时延长，科达必须同意将提供给作曲家和词曲作者的YouTube使用音乐的费用减少近70%-尽管自从Koda与谷歌达成上次协议以来，YouTube对音乐的使用已经大幅增加。\n当然，科达不能接受这些条款，谷歌现在单方面决定，在新协议到位之前，科达会员的内容不能在YouTube上展示，他们在YouTube上的粉丝和用户将无法收听科达会员的音乐。\n虽然参与新联合协议谈判的各方还绝不是在协和，但最近几周取得了进展，科达对谷歌这次在谈判中采取的极其咄咄逼人的做法感到困惑。\n谷歌一直采取“我们的方式，否则就是高速公路”的方式，但即使对谷歌来说，这也是一个低谷。当然，谷歌知道，他们拒绝我们的成员访问YouTube-以及许多每天使用YouTube的丹麦人-可能会在他们中造成巨大的挫败感。我们只能假设，通过这样做，YouTube希望能够推动达成一项协议，在这种协议中，所有条款都是由他们自己决定的。\n自2013年签署第一份协议以来，YouTube收到的付款水平明显低于订阅服务同意的付款水平。\n“我们的会员多年来一直对YouTube上使用他们的音乐的付费水平非常不满，这已经不是什么秘密了。”而且，我们科达公司积极倡导结束科技巨头搭便车的做法，并根据欧盟新的版权指令对艺术内容支付过低的费用，这已经不是什么秘密了。谷歌现在要求他们在临时延长合同的情况下将应支付的款项减少近70%，这一事实看起来相当奇怪。", "note_en": "While the negotiations on a new joint Nordic agreement are in full swing, Google have chosen to leverage their total dominance in the market in the strongest way possible. On the evening of Thursday 30 July, Google announced that they will soon remove all Danish music content on YouTube.\n  Under the auspices of the Nordic alliance of collecting societies, Polaris, negotiations on a joint Nordic agreement on the use of music on YouTube are currently in full swing. The agreement will replace the local agreements of the Norwegian, Finnish and Danish composers and songwriters’ societies, combining them in a single, joint agreement with Google. In the case of Koda, the national agreement for Denmark expired in April, after which it was temporarily extended – as is standard practice in the industry while negotiating a new agreement.\n Now, however, Google have issued a new demand: if the agreement is to be temporarily extended, Koda must agree to reduce the payment provided to composers and songwriters for YouTube’s use of music by almost 70% – despite the fact that YouTube’s use of music has increased significantly since Koda entered into its last agreement with Google.\n Of course, Koda cannot accept these terms, and Google have now unilaterally decided that Koda’s members cannot have their content shown on YouTube and that their fans and users on YouTube will be unable to listen to Koda members’ music until a new agreement is in place.\n Although the parties involved in the negotiations on the new joint agreement are by no means in concord yet, progress has been made in recent weeks, and Koda is puzzled by the extremely aggressive approach taken by Google in the negotiations this time.\n  ‘Google have always taken an “our way or the highway” approach, but even for Google, this is a low point. Of course, Google know that they can create enormous frustration among our members by denying them access to YouTube – and among the many Danes who use YouTube every day. We can only suppose that by doing so, YouTube hope to be able to push through an agreement, one where they alone dictate all terms’.\n Ever since the first agreement was signed in 2013, the level of payments received from YouTube has been significantly lower than the level of payment agreed to by subscription-based services.\n  ‘It is no secret that our members have been very dissatisfied with the level of payment received for the use of their music on YouTube for many years now. And it’s no secret that we at Koda have actively advocated putting an end to the tech giants’ free-ride approach and underpayment for artistic content in connection with the EU’s new Copyright Directive. The fact that Google now demands that the payments due from them should be reduced by almost 70% in connection with a temporary contract extension seems quite bizarre’.", "posttime": "2020-07-31 21:06:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,youtube", "title": "经过3个月的谈判失败后，在丹麦收集机构Koda不愿接受谷歌将版税降低70%的要求后，谷歌决定将所有丹麦音乐从YouTube上删除。", "title_en": "After 3 months of failed negotiations, Google has decided to remove all Danish music from YouTube after the danish collecting agency Koda was unwilling to accept Google's demand of a 70% decrease in royalty fees.", "transed": 1, "url": "https://www.koda.dk/about-us/press-release-google-removes-all-danish-music-from-youtube", "via": "", "real_tags": ["google", "谷歌", "youtube"]}, {"category": "", "categoryclass": "", "imagename": "8c0cc5dd273f3fe22b10476843edcf1a.gif", "infoid": 1015405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Disrupt 2020将于9月14日至18日举行。它充满了不间断的节目，给了您整整五天的时间去探索-扩展您的知识、您的网络、您的机会和您的业务。\n我们今年新增了一项活动：摊位甲板拆卸。专家风投和企业家将评估注册的Disrupt与会者提交的推介会，注意危险信号，并就如何改进这一重要的创业工具提供建设性的建议。在中断的过程中，我们将举办多个会议，因此，如果您是已注册的中断参与者，请提交您的推荐卡以供考虑。\n这只是参加Disrupt可以帮助你的早期创业公司生存和蓬勃发展的众多令人兴奋的方式之一。探索在Digital Startup Alley展出的数百家早期初创公司是一个很好的起点。与世界各地的创始人联系，提高您的品牌认知度，发现可以增强您业务的人员和技术。\nCPRWrap发明家兼创始人费利西亚·杰克逊说：“颠覆变革最大的三个好处是：将我的产品介绍给那些原本看不到它的人；与投资者、导师、顾问和潜在客户建立联系；最后，与其他企业家和创始人交谈，了解如何让他们的公司起步。”--费利西亚·杰克逊是CPRWrap的发明人和创始人。\n记住，你有五天的时间体验颠覆，所以不要错过令人印象深刻的演讲者阵容，他们横跨整个创业世界。您将听到顶级科技、投资和商业偶像、领导者、传播者、震撼者和制造者的最新想法。我们也在这里宣布了议程，我们每周都会增加更多的球员。\n好，我们来复习一下。现在几点？现在是注册Disrupt2020的时间了，最高可节省300美元，并尽其所能推动您的业务向前发展。在晚上11点59分早起的鸟交易到期之前购买通行证。(PT)今晚！\n贵公司是否有兴趣赞助或参展Disrupt2020？ContTime要在Disrupt2020通行证上节省高达300美元的费用已经所剩无几了。现在就拿你的吧！填写这张表格，扮演我们的赞助商销售团队。", "note_en": "Disrupt 2020 takes place September 14-18. It’s packed with non-stop programming and gives you five full days to explore — expand your knowledge, your network, your opportunities and your business.\n We’ve added a new event this year:  The Pitch Deck Teardown. Expert VCs and entrepreneurs will assess pitch decks submitted by registered Disrupt attendees, note red flags and offer constructive advice on how to improve this essential startup tool. We’ll hold multiple sessions over the course of Disrupt, so if you’re a registered Disrupt attendee,  submit your pitch deck for consideration.\n  That’s just one of many exciting ways attending Disrupt can help your early-stage startup survive and thrive. Exploring the hundreds of early-stage startups exhibiting in  Digital Startup Alley is a great place to start. Connect with founders around the world, increase your brand recognition, discover people and technologies that can augment your business.\n “The top three benefits of going to Disrupt were introducing my product to people who would not have seen it otherwise; networking with investors, mentors, advisors and potential customers and, finally, talking to other entrepreneurs and founders and learning what it took to get their companies off the ground.” — Felicia Jackson, inventor and founder of CPRWrap.\n Remember, you have five days to experience Disrupt, so don’t miss the impressive lineup of  speakers who span the startup universe. You’ll hear the latest thinking from top tech, investment and business icons, leaders, movers, shakers and makers. We’ve also announced the agenda here and we’re adding more to the roster every week.\n Okay, let’s review. What time is it? It’s NOW o’clock — time to  register for Disrupt 2020, save up to $300 and do whatever it takes to drive your business forward.  Buy your pass before the early bird deal expires at 11:59 p.m. (PT) tonight!\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? ContTime is running out to save up to $300 on Disrupt 2020 passes. Get yours now!act our sponsorship sales team by   filling out this form .", "posttime": "2020-07-31 21:05:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,鸟类,early,创始人", "title": "\n扰乱2020年早起鸟类储蓄的最后一天", "title_en": "\n\t\t\t\tLast day for early bird savings to Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/last-day-for-early-bird-savings-to-disrupt-2020/", "via": "", "real_tags": ["2020", "鸟类", "early", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "dffe119536e8296bf3177bfa73599397.jpg", "infoid": 1015404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着旧金山的科技工作者逃离这座城市，寻找更多的空间和更健康的生活方式，太浩湖的房地产正以创纪录的速度被抢购一空。\n从纽约到芝加哥，从洛杉矶到旧金山，新一轮的城市外逃正在重塑房地产市场。作为这一转变的一部分，太浩湖正在经历前所未有的竞标战、购买活动和价格上涨。经纪人说，待售房屋的库存已经缩减到通常水平的五分之一到十分之一左右。\nRe/Max的太浩湖经纪人萨布丽娜·贝莱奇(Sabrina Belleci)说，人们正在为看不见的房子写全现金报价。他们只想离开这座城市。\n对于加州人来说，太浩湖长期以来一直是一个田园般的避难所，他们在内华达州一边寻找避难所，并希望获得更低的税收。但经纪商表示，最近的买入热潮比市场上见过的任何一次都要大。他们说，旧金山湾区的科技工作者和投资者，以及来自洛杉矶的媒体类型，正在来到塔霍区，寻找带家庭办公室的更大的房子，更多的孩子玩耍的土地，以及参加游泳和骑自行车等户外活动的机会。\n本周，在谷歌宣布将把员工留在家里直到2021年7月之后，从这座城市起飞的航班又得到了推动。旧金山湾区的私立学校最近也宣布，他们可能会在秋季转向所有在线课程，这给了家庭另一个留在旧金山以外的理由。\n买家们都在说，我没有理由留在这座城市，塞拉·苏富比国际房地产公司(Sierra Sotheby‘s International Realty)的经纪人布雷克·托尔(Breck Total)说。\nTotal说，从历史上看，Tahoe地区的房产需要三到四个月的时间才能售出。现在，更像是四天了。他说，房产在上市后通常会有6到12个报价，并补充说，许多房产的售价远远高于要价。\n最近有一套房产上市，定价为165万美元。它位于加利福尼亚州的Truckee市中心，位于Truckee河上，不到24小时后就签订了合同，并以200万美元的价格结束了合同。\n总体来说，Tahoe Donner的度假社区通常有80到120套住房在市场上。现在只有十几个了。\n几乎所有的交易都是全现金交易，几乎没有或有意外情况。Total表示，如果买家需要融资，他们获得住房的机会很小，因为卖家更喜欢快速、全现金的交易。\n而且这些数字没有显示出放缓的迹象。塞拉利昂苏富比拍卖行(Sierra Sotheby‘s)的凯利·桑切斯(Kaili Sanchez)说，该公司6月份在塔霍区待售的总销售额为1.91亿美元，高于去年的7200万美元。\n7月份的销售情况甚至会更好，7月1日至7月15日期间，待售的销售额为1.29亿美元-是去年总额的三倍多。她说，虽然长期以来家庭一直将Tahoe视为度假屋市场，但现在许多家庭正计划在这里停留更长时间。\n她说，他们现在正在为他们的主要住所买房。也许是一年，也可能更长。但是他们想要到户外去。\n由于待售房屋如此之少，许多购房者已经开始购买空地并建造房屋。当地建筑商和建筑师表示，等待他们服务的名单越来越长。经纪人也开始挨家挨户敲门，希望说服业主列出他们的房子。\n贝莱奇说，那些可能在一个典型的季节卖出了房子的人都保留了自己的房子，因为他们想要一个住宿的地方。库存已经到了我们要卖的房子都快用完的地步了。它非常有限。", "note_en": "Lake Tahoe real estate is getting snapped up at a record pace, as San Francisco tech workers flee the city in search of more space and a healthier lifestyle.\n A new wave of urban flight is reshaping real estate markets from New York to Chicago and Los Angeles to San Francisco. As part of this shift, Lake Tahoe is seeing unprecedented bidding wars, buying activity and price increases. Brokers say the inventory of homes for sale has shrunk to about one-fifth to one-tenth of the usual levels.\n  &#34;People are writing all-cash offers for houses, sight unseen,&#34; said Sabrina Belleci, a Lake Tahoe broker with Re/Max. &#34;They just want to get out of the city.&#34;\n Lake Tahoe has long been a bucolic escape for Californians looking for a getaway and, on the Nevada side, lower taxes. But the latest buying surge is larger than any the market has seen, brokers say. They say tech workers and investors in the Bay Area, as well as media types from Los Angeles, are coming to the Tahoe area in search of larger homes with home offices, more land for the kids to play, and access to outdoor activities such as swimming and bike riding.\n  The flight from the city got another push this week after  Google announced it&#39;s  keeping workers at home until July 2021. Private schools in the Bay Area also recently announced they will likely shift to all online classes in the fall, which gave families another reason to remain outside of San Francisco.\n &#34;Buyers are saying &#39;there is no reason for me to be in the city,&#39;&#34; said Breck Overall, an agent with Sierra Sotheby&#39;s International Realty.\n Historically, properties in the Tahoe area took three to four months to sell, Overall said. Now, it&#39;s more like four days. Properties often have between six and 12 offers after coming onto the market, he said, adding many are selling for far above the asking price.\n  One property recently came on the market priced at $1.65 million. Located in downtown Truckee, California, on the Truckee River, it went into contract less than 24 hours later and closed for $2 million.\n  The resort community of Tahoe Donner typically has between 80 and 120 homes on the market, Overall said. Now there are only about a dozen.\n Almost all the deals are all-cash, with few or no contingencies. Overall said that if buyers need financing, they have little chance of getting a home, since sellers prefer quick, all-cash deals.\n  And the numbers show no signs of slowing. Kaili Sanchez, with Sierra Sotheby&#39;s, said the company&#39;s pending sales in June for the Tahoe area totaled $191 million, up from $72 million last year.\n July is shaping up to be even better, with $129 million in pending sales between July 1 and July 15 — more than three times last year&#39;s total. She said that while families have long seen Tahoe as a vacation-home market, now many families are planning to stay longer.\n &#34;They&#39;re buying for their primary residence now,&#34; she said. &#34;Maybe it&#39;s for a year, maybe longer. But they want to be outdoors.&#34;\n With so few homes for sale, many buyers have taken to buying up empty land and building a home. Local builders and architects say the waiting lists are getting longer for their services. Brokers have also started knocking on doors in hopes of persuading owners to list their homes.\n &#34;People who might have sold in a typical season are keeping their homes because they want a place to stay,&#34; Belleci said. &#34;The inventory is getting to the point where we are running out of homes for sale. It&#39;s very limited.&#34;", "posttime": "2020-07-31 21:04:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旧金山,湾区,旧金山湾,bay,房子", "title": "当技术工人逃离旧金山湾区时，太浩湖经纪人说，我们的待售房屋快用完了", "title_en": "'We're Running Out of Homes For Sale,' Lake Tahoe Brokers Say As Tech Workers Flee Bay Area", "transed": 1, "url": "https://www.cnbc.com/2020/07/29/were-running-out-of-homes-for-sale-lake-tahoe-brokers-say.html", "via": "", "real_tags": ["旧金山", "湾区", "旧金山湾", "bay", "房子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些是我对潜在的计算机爱好者个人计算机体系结构的注意事项。有人称它为主板Minix。\n这大致描述了一种现成的微控制器组件的体系结构，可用于创建一台基本的独立PC，性能接近于旧的286/386DOS风格的PC。\n如果我建造这个，几乎肯定会在铁锈完成。我确实希望能很好地指定协议/操作语义，这样您就可以创建一个用Micro/Circuit Python、C/C++、Ada编写的组件，甚至可以创建成嵌入式Linux PC。\n我目前正在做其他项目，但我觉得这将是一个有趣的项目，甚至可以写一本关于学习嵌入式系统的书，或者用嵌入式系统学习Rust？\n如果您有兴趣参加这样的系统构建/使用课程，或者有兴趣看到这种情况发生，请给我发个消息。\n该项目的目标是设计一种类似于PC的体系结构，使学习嵌入式系统的人们可以轻松地构建单个组件。这包括：\n这个想法是让系统的每个部分(或组件)都成为独立的微控制器系统。老实说，这就是今天大多数计算机的工作方式，但我们的想法是能够使用几乎任何微控制器，从8051到ARM Cortex-M，再到RISC-V部件，用于PC的任何一部分。在某种程度上，我甚至可以看到人们甚至用FPGA制造PC的部件。\n系统应该使用几乎每台设备都支持并且可以原谅的协议。因此，我计划使用SPI进行系统通信。\n因此，SPI是一种简单、快速和可靠的协议，但诀窍在于编写SPI控制器要比编写SPI外围设备容易得多。因为我想让编写组件的人的事情变得最简单，所以他们应该是SPI控制器。但这给我们留下了一个问题，如何使带有N个SPI控制器的PC与单个SPI外设一起工作？这就是事情变得奇怪的地方。\n每个组件都是一个SPI控制器，SCK、COPI和CIPO引脚连接到一个中央仲裁器。\n每个组件也有两个GIO：输出是一个请求行。这向仲裁器发出该组件想要对话的信号。\n一个输入，它是一个前进的&34；行。这向组件发出信号以开始与仲裁器对话。\n在这个系统中，仲裁器将支持作为许多线路的SPI外设，或者将根据需要处理多路复用SCK/COPI/CIPO引脚。仲裁器将决定它想要与哪个组件交谈，以及交谈多长时间。当组件将其请求线拉低时，仲裁器最终将通过拉组件来确认这一点&#39；组件可以以它认为的任何速度开始计时SPI数据，直到仲裁器支持的最大速度。当组件完成发送/接收数据时，它检查允许行是否仍然较低。如果是，则该消息被仲裁员接受。如果在组件释放请求行之前，允许行被释放得很高，这意味着仲裁器已经挂起了组件，这意味着。\n如上所述仲裁总线协议，服务和发现已连接的组件。\n我已经描述了上面协议的最低级别-我们将使用一个笨拙的SPI通信。然而，我还没有描述更高的协议层是如何工作的。\n所有设备都将通过邮箱系统进行通信。仲裁器将从组件中获取数据，并将其放入内存对象存储中。每个创建的项目都将被分配一个UUID，该UUID将在创建时返回给组件。然后，该UUID可以放在邮箱中给另一个组件，将对数据的访问权限发送给该组件。每个项目都是只读的。\n//从组件向仲裁器发送二进制RPC消息//格式可能是二进制，但可能使用替代命令//使用以下REPL格式？/引导时还会为组件分配UUID。该组件的自有地址为//9ea8b6a7-2967-4db8-98b8-d4577548ed04。//数据可以存储到仲裁器存储空间。然后，可以使用UUID作为引用来//引用数据作为设备间存储。数据//以FIFO为基础进行分配，其中//最旧的存储项变为//丢弃。/仲裁器可以根据配置选择限制创建存储项的速率、最大大小或其他//参数。CREATE(//要写入的字节数，对于动态//长度，可以使用COBS之类的东西或当请求//行被取消断言时设置为零13，//数据的有效负载&#34；Hello，world！&#34；，//No UUID(//无UUID)//当请求//行被取消断言13时，//数据的有效负载&#34；Hello，world！&#34；，//No UUID。如果提供，这会将//创建的uuid放入另一个组件的邮箱中无，)//成功时会将以下uuid返回给该组件-&gt；Result&lt；3b2fd5d1-ae16-46af-afc1-f60241d0a5b6，创建错误//您可以通过引用您知道的另一个组件的邮箱来发送数据。(#//=。邮箱是作为组件地址提供的。邮箱//是可由组件SEND_MAILBOX(//发送3b2fd5d1-ae16-46af-afc1-f60241d0a5b6的数据引用，//目的地址56c3dbda-c762-4107-be58-855dc8e5aa92，)加载的UUID的FIFO队列)//其他设备可以基于FIFO接收消息，并可以查看。大于usize值的消息将//返回错误Some(32)，)-&gt；result&lt；(13，&#34；Hello，world！&#34；)，GetError&gt；//其他设备可以基于FIFO接收消息，并可以查看//和删除堆栈顶部的项目。如果控制器//在接收到所有字节之前结束消息，则仍会//从FIFO中删除该项。这可以用来简单地将项目放到//FIFO.POP_Mailbox的顶部(//您可以提供一些(Usize)作为最大邮件大小，或者//任何邮件大小都不提供)。大于usize值的邮件将//返回错误某些(32)，)-&gt；result&lt；(13，&#34；Hello，world！&#34；)，GetError&gt；//TODO：如何克隆和修改//由于重新分配而无法硬执行的操作？除非我使用某种//绳索结构，否则插入会很糟糕，这可能太复杂了，无法实现。\n//使用枚举类型ID注册我们自己/TODO：多次调用此ID时怎么办？REGISTER_TYPE(IO_CONTROLLER，)-&gt；Result&lt；9ea8b6a7-2967-4db8-98b8-d4577548ed04，获取错误&gt；//获取我们自己的ID。匹配注册时给定的ID GET_OWN_ID()-&gt；SPIGetError&gt；//获取仲裁器接口的限制GET_仲裁器_LIMITS()-&gt；{Result&lt；9ea8b6a7-2967-4db8-98b8-d4577548ed04，_SPEED_Hz：125000，//最低SPI时钟速率是多少？MAX_SPEED_Hz：8_000_000，//最大SPI时钟速率是多少？Exp_polls_per_sec：100，//预计轮询频率是多少？REQUEST_LINE_SHARED：FALSE，//请求线是否开放排出？TOTAL_MEMORY：524288，//512KiB max_files：512，//一次最大有效记录数}//获取消息创建限制GET_CREATE_LIMITS()-&gt；{max_bytes：512，//最大消息可以是512字节max_bytes_per_sec：4096，//运行资源限制Messages_per_Second：10，//运行资源限制}。\nTODO：如何注册多个地址/逻辑寻址？例如，对于有鼠标和触摸板的键盘？可以在每条消息中添加发件人字段，但是我要添加路由层吗？\n编写一个简单的引导加载器，可以在总线上枚举、获取映像并重新启动？PXII开机风格？需要枚举类型，甚至序列号等，才能将正确的固件加载到正确的位置。\n我可以为这些组件创建一个模拟环境，使用no_std库并使用TCP over localhost来模拟SPI目标环境，基本上提供一个I/O库或一个硬件来模拟系统内的每个组件。也许甚至可以将RTIC移植到模拟环境中，或者仅仅使用QEMU，使用Semihost来模拟SPI/GPIO？\n只需做一点工作，我还可能让一个仲裁器，甚至只是一个简单的SPI控制器位于PC之外，将一个或多个模拟组件桥接到具有物理组件的共享网络。\n这将允许我快速启动多个设备，无论是从组件软件的角度还是从CPU对Anachro-PC架构的支持来看都是如此。\n因为nRF52已经有一个内部引脚多路复用器，所以我可以使用nRF52840(大约有36-48个GPIO)来充当物理仲裁器。假设您需要每个组件的以下端号：\n这意味着我们可能可以支持5-8台设备？如果请求行是共享的，可能会更多？如果我需要外部QSPI存储器作为存储，可能会更少？然后，您可以将开发板手工连接在一起，这将是乏味的，但不需要我购买新的硬件也是可能的。\n缺点是，作为SPI外设，nRF52840仅支持最高速度为8 Mbps。\n我可以把nrf52840之类的东西放在PCB上，然后把所有的管脚都拆成8个管脚。这将允许您轻松地为每个外部组件连接线束，甚至可以做一些愚蠢的事情，如在RJ45或其他设备上运行线缆。\n我还可以为常见的足迹制作简单的适配器，比如PJRC的Teensy、Adafruit的Feather或Arduino Uno R3格式。这些将是无元件PCB，带有通孔可焊接头，您可以使用杜邦接头，或某种标准的2x4带状电缆。\n首先，我可能会从nRF52开始制作所有东西，因为我手头有很多nRF52。将来，我可能会开始添加。\n一旦我有了一个可以工作的设计，我就可以用完整的主板组件制作一个巨型PCB。这真的很酷，但也可能真的很贵或很耗时。", "note_en": "TL;DR - These are my notes for a potential computer hobbyist personal computer architecture. Someone called it &#34;Minix for motherboards&#34;.\n This roughly describes an architecture of off the shelf microcontroller components that can be used to create a basic standalone PC, somewhere in the neighborhood of performance of an old 286/386 DOS style PC.\n If I build this, it will almost certainly be done in Rust. I do hope to specify the protocol/operational semantics well enough that you could create a component that was written in Micro/Circuit Python, C/C++, Ada, or maybe even as an embedded linux PC.\n I currently am working on other projects, but I feel like this would be a fun project to stream, or maybe even write a book about learning embedded systems, or learning Rust with embedded systems?\n If you&#39;d be interested in taking a class building/using a system like this, or would be interested in seeing this happen,  send me a message.\n   The goal of this project is to design a PC-ish architecture that makes it easy for people learning embedded systems to build a single component. This includes:\n       The idea is to have every part (or  Component) of the system be its own standalone microcontroller system. Honestly, this is how most computers work today anyway, but the idea is to be able to use almost any microcontroller, from 8051, to Arm Cortex-M, to RISC-V parts, for any piece of the PC. At some point, I can see people even making parts of the PC out of FPGAs as well.\n   The system should use a protocol that almost every device has support for, and is forgiving. For that reason, I plan to use SPI for system communication.\n  So, SPI is a simple, fast, and reliable protocol, but the trick is that it is WAY easier to write a SPI Controller, rather than a SPI peripheral. Since I want things to be simplest for the people writing the Components, they should be the SPI Controllers. But this leaves us with a problem, how do we make a PC with N SPI Controllers work with a single SPI peripheral? Here is where it gets weird.\n Every Component is a SPI Controller, with SCK, COPI, and CIPO pins wired to a central  Arbitrator.\n Every Component also has two GPIOs: An output that is a &#34;Request&#34; line. This signals to the Arbitrator that the Component would like to talk\n An input that is a &#34;Go-Ahead&#34; line. This signals to the Component to begin talking to the Arbitrator\n In this system, the Arbitrator will either support being a SPI Peripheral for a lot of lines, or will handle MUXing the SCK/COPI/CIPO pins as necessary.The Arbitrator will decide which component it wants to talk to, and for how long.When a Component pulls its Request line low, the arbitrator will eventually acknowledge this by pulling the Component&#39;s Go-Ahead line low.The Component can begin clocking SPI data at whatever speed it feels like, up to the maximum speed supported by the Arbitrator.When the Component is done sending/receiving data, it checks whether the Go-Ahead line is still low.If so, then the message was &#34;accepted&#34; by the arbitrator.If the Go-Ahead line is released high before the Component releases the Request line, this means that the arbitrator has &#34;hung up&#34; on the Component, meaning either an error or timeout has occurred.\n   Arbitrating the Bus Protocol as described above, servicing and discovering components that have been connected\n I&#39;ve already described the lowest level of the protocol above - we&#39;ll use an awkward SPI communication. However I haven&#39;t described how the higher protocol layers work.\n All devices will communicate through a mailbox system.The arbitrator will take data from the Components, and place them in an in-memory object store.Each created item will be assigned a UUID, which will be returned to the Component on creation.This UUID can then be placed in a mailbox to another component, sending access to the data to that component.Each item is read-only.\n  // A binary RPC messages are sent from Component to the Arbitrator// The format will probably be binary, but maybe with an alternative// command to use the following REPL format?//// Components are also assigned a UUID on boot. This Component has// the own-address of 9ea8b6a7-2967-4db8-98b8-d4577548ed04.// Data can be stored to the Arbitrator memory space. Data can then be// referenced as inter-device storage using UUIDs as a reference. Data// is allocated on a FIFO basis, with oldest memory items becoming// dropped.//// The arbitrator may choose to limit the rate, maximum size or other// parameters of creating memory items based on configuration.CREATE( // number of bytes to write, can be set to zero for dynamic // length using something like COBS or when the Request // line is de-asserted 13, // The payload of the data &#34;Hello, world!&#34;, // No UUID provided to send to another component, just return // the newly created UUID. If provided, this would place // the created UUID into the mailbox of another component None,)// The following UUID is returned to the Component on success-&gt; Result&lt;3b2fd5d1-ae16-46af-afc1-f60241d0a5b6, CreateError&gt;// You can send data by reference to another component you know&#39;s// mailbox. Mailboxes are provided as a Component&#39;s address. Mailboxes// are a FIFO queue of UUIDs that can be loaded by that ComponentSEND_MAILBOX( // The data reference to send 3b2fd5d1-ae16-46af-afc1-f60241d0a5b6, // The destination address 56c3dbda-c762-4107-be58-855dc8e5aa92,)// The other device can receive messages on a FIFO basis, and can view// the item at the top of the stack without removing itPEEK_MAILBOX( // You can provide Some(usize) as a max message size, or None for // anymessage size. Messages larger than the usize value will // instead return an Error Some(32),)-&gt; Result&lt;(13, &#34;Hello, world!&#34;), GetError&gt;// The other device can receive messages on a FIFO basis, and can view// and remove the item at the top of the stack. If the Controller// ends the message before all bytes are received, the item is still// removed from the FIFO. Thiscan be used to simply drop the item on// the top of the FIFO.POP_MAILBOX( // You can provide Some(usize) as a max message size, or None for // any message size. Messages larger than the usize value will // instead return an Error Some(32),)-&gt; Result&lt;(13, &#34;Hello, world!&#34;), GetError&gt;// TODO: How to have a &#34;clone and modify&#34; operation that isn&#39;t hard// because of re-allocs? Insertions would suck unless I used some kind// of rope structure, which might be too complex to implement\n  // Register ourself using an enumerated type ID//// TODO: What to do when calling this more than once?REGISTER_TYPE( IO_CONTROLLER,) -&gt; Result&lt;9ea8b6a7-2967-4db8-98b8-d4577548ed04, GetError&gt;// Get the ID of ourself. Matches ID given on registrationGET_OWN_ID()-&gt; Result&lt;9ea8b6a7-2967-4db8-98b8-d4577548ed04, GetError&gt;// Get limits of the arbitrator interfaceGET_ARBITRATOR_LIMITS()-&gt; { min_speed_hz: 125_000, // What is the minimum SPI clock rate? max_speed_hz: 8_000_000, // What is the maximum SPI clock rate? exp_polls_per_sec: 100, // What is the expected poll frequency? request_line_shared: false,// Is the request line open drain? total_memory: 524288, // 512KiB max_files: 512, // Max number of records alive at once}// Get limits for message creationGET_CREATE_LIMITS()-&gt; { max_bytes: 512, // Largest message can be 512 bytes max_bytes_per_second: 4096, // Running resource limits messages_per_second: 10, // Running resource limits}\n TODO: How to register multiple addresses/logical addressing? e.g. for keyboard that has a mouse and touchpad?Could add a &#34;from&#34; field to every message, but then I&#39;m adding a routing layer?\n  Write a simple bootloader that can enumerate on the bus, take an image, and reboot? PXII boot style? Would need to enumerate typeand maybe even serial number or something to load the right firmware to the right place.\n    I could create a simulated environment for these components, using no_std libraries and using TCP over localhost to emulate the SPI target environment, basically providing an I/O library or a &#34;HAL&#34; for simulating each component inside of a system. Maybe even port RTIC to the simulated environment, or even just use QEMU, using Semihosting for simulated SPI/GPIOs?\n With a little work, I could also probably have an arbitrator or even just a simple SPI controller sit outside of the PC, bridging one or more simulated components to a shared network with physical components.\n This would allow me to bring up multiple devices quickly, both from a Component software perspective as well as a CPU support for the Anachro-PC architecture.\n  Since the nRF52 already has an internal pin mux, I could use an nRF52840, which has like 36-48 GPIOs, to act as a physical arbitrator. Assuming you need the following pins for each component:\n  That means we could probably support 5-8 devices? Maybe more if the request lines are shared? Maybe less if I want external QSPI memory for storage? Then you could just hand-wire the dev boards together, which would be tedious, but possible without me buying new hardware.\n Downside is that the nrf52840 only supports a max speed of 8mbps as a SPI peripheral.\n  I could put an nrf52840 or something on a PCB, then break out all the pins to ~8 pin headers. That would allow you to easily wire a harness for each external component, or even do something silly like run the lines over an RJ45 or something.\n I could also make simple adapters for common footprints, like PJRC&#39;s Teensy, Adafruit&#39;s Feather, or the Arduino Uno R3 format. These would be no-component PCBs, with thru-hole solderable headers that you could use dupont headers, or some kind of standard 2x4 ribbon cable.\n  To start, I&#39;ll probably make everything with nRF52s to start, because I have a lot of them at hand. In the future, I&#39;ll probably start adding\n  Once I have a design that works, I could make a jumbo sized PCB with full motherboard-ish components. This would be REALLY cool, but also probably REALLY expensive or time consuming to do in tiny quantities", "posttime": "2020-07-31 21:03:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pc,组件", "title": "Anachro-PC--不合时宜的个人计算机", "title_en": "Anachro-PC – The Anachronistic Personal Computer", "transed": 1, "url": "https://jamesmunns.com/blog/anachro-pc-001/", "via": "", "real_tags": ["pc", "组件"]}, {"category": "", "categoryclass": "", "imagename": "b448d67d9b075bc12b2fc432a21dfaa4.jpeg", "infoid": 1015402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter周四永久暂停了三K党(Ku Klux Klan)前领导人大卫·杜克(David Duke)的Twitter账户。\n根据Wayback Machine上的存档版本，杜克的账户自2009年以来一直活跃，拥有超过5.3万名粉丝。\n推特的一位发言人向“商业内幕”证实了这一消息，称由于多次违反推特关于仇恨行为的规定，该账号已被永久停用。这一执法行动与我们最近更新的有害链接指南是一致的。\nTwitter的有害链接政策意味着，它可以暂停发布有害内容链接的推文账户。以前，这意味着可能会用恶意软件或与恐怖组织相关的网站感染用户的链接。7月28日星期二，它更新了有害链接政策，将仇恨行为和暴力行为纳入其中。\n杜克大学的YouTube频道也在6月下旬因违反该平台关于仇恨言论的政策而被暂停。\n本月早些时候，当被问及杜克大学当时的活跃账户时，Twitter的一位发言人告诉Gizmodo，杜克目前不是KKK的成员，他已经公开与该组织保持距离。\n根据南方贫困法律中心(SPLC)的说法，杜克在20世纪70年代末开始与KKK保持距离，并于1981年成立了全国白人促进会。SPLC将杜克描述为新纳粹分子和否认大屠杀的国际代言人。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Twitter on Thursday permanently suspended the Twitter account of David Duke, the former leader of the Ku Klux Klan.\n Duke&#39;s account has been active since 2009, according to an archived version on the Wayback Machine, and had more than 53,000 followers.\n   A Twitter spokesperson confirmed the suspension to Business Insider, saying the account has been &#34;permanently suspended for repeated violations of the Twitter Rules on hateful conduct. This enforcement action is in line with our recently-updated guidance on harmful links.&#34;\n   Twitter&#39;s &#34;harmful links&#34; policy means it can suspend accounts which tweet links to harmful content. Previously, this meant links that might infect a user with malware, or websites associated with terrorist groups. On Tuesday, July 28, it updated its harmful links policy to inlcude &#34;hateful conduct and violence.&#34;\n   Duke&#39;s  YouTube channel was also suspended in late June for violating the platform&#39;s policies on hate speech.\n When asked about Duke&#39;s then-active account earlier this month,  a Twitter spokesperson told Gizmodo that Duke was not currently a member of the KKK and &#34;has distanced himself from the organization publicly.&#34;\n According to the Southern Poverty Law Center (SPLC) Duke began to distance himself from the KKK in the late 1970s, and in 1981 founded the &#34;National Association for the Advancement of White People.&#34; The SPLC characterizes Duke as a &#34;neo-Nazi&#34; and an &#34;international spokesman for Holocaust denial.&#34;\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-07-31 19:55:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,关闭,shut,杜克", "title": "推特关闭了前三K党领袖大卫·杜克的账户", "title_en": "Twitter has shut down former KKK leader David Duke's account", "transed": 1, "url": "https://www.businessinsider.com/twitter-suspends-former-kkk-leader-david-duke-2020-7", "via": "", "real_tags": ["推特", "关闭", "shut", "杜克"]}, {"category": "", "categoryclass": "", "imagename": "72afb0440904e732a32a1be4680c0e50.jpg", "infoid": 1015400, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "除了关键的监管批准，亚马逊还宣布将向Kuiper投入超过100亿美元，该公司表示，这笔资金将为美国创造就业机会，不仅涉及为星座建造和测试卫星，还将建设关键的地面网络基础设施，这是真正向消费者提供连接所必需的。\n亚马逊的Kuiper计划除了直接提供消费者服务外，还将向运营商提供回程服务。从本质上说，这意味着它将为运营商提供一种方式，为目前没有地面站基础设施的更多地区的客户提供高速LTE和5G无线连接。亚马逊表示，这项服务将在“美国和世界各地”推出，因此听起来计划首先针对美国市场，然后从那里将Kuiper网络扩展到全球。\n亚马逊在部署方面落后于SpaceX，因为SpaceX实际上正在为其Starlink网络发射卫星，而且看起来准备在今年夏天进入这项服务的Beta测试计划。然而，杰夫·贝佐斯(Jeff Bezos)领导的电商巨头在华盛顿州雷德蒙德开设了一家全新的研发机构，完全致力于柯伊伯的开发。贝佐斯的太空发射公司合作伙伴蓝色起源(Blue Origin)一直在获得重要的行业合作伙伴关系，可能很快就会准备好为柯伊伯卫星提供发射服务。\n这个新兴的低地球轨道卫星市场也不太可能只有一个赢家；如果这些网络在延迟、速度和质量连接方面能够真正履行承诺，那么很可能会有多家供应商在全球范围内竞争的空间。亚马逊100亿美元的投资也是押注它能够实现这一目标的另一个很好的理由-很少有其他公司有像亚马逊这样可靠的资金渠道，来支付发射大型卫星星座所带来的巨额前期基础设施成本。", "note_en": "Alongside the key regulatory approval, Amazon also announced that it would be committing over $10 billion in Kuiper, money that it says will generate U.S. jobs and involve not only building and testing satellites for the constellation, but also building out key ground network infrastructure that’s required in order to actually make the connectivity available to consumers.\n Amazon’s Kuiper includes plans to provide backhaul service to carriers in addition to direct consumer service. Essentially, that means it’ll offer a way for carriers to offer high-speed LTE and 5G wireless connections to their customers in more areas where they don’t currently have the ground station infrastructure to do so. Amazon says this will be on offer “in the United States and around the world,” so it sounds like the plan is to first address the U.S. market and then expand the Kuiper network globally from there.\n  Amazon lags behind  SpaceX   in terms of deployment, since the latter company is actually launching satellites for its Starlink network, and looks ready to enter a beta testing program for the service this summer. The  Jeff Bezos  -led e-commerce giant has opened a brand new R&amp;D facility in Redmond, Washington dedicated entirely to Kuiper development, however, and partner  Blue Origin,   Bezos’ space launch company, has been securing significant industry partnerships and could be ready to provide launch services for Kuiper satellites relatively soon.\n It’s also unlikely that this emerging market for low Earth orbit satellites will have only one winner; provided these networks can actually live up to their promises in terms of latency, speed and quality connection, there will likely be room for multiple providers to compete on a global scale. Amazon’s $10 billion investment is also another good reason to bet it’ll be able to make this a reality – few others out there have as reliable a funding pipeline for the massive upfront infrastructure costs that come with launching a large satellite constellation.", "posttime": "2020-07-31 19:54:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,联邦,constellation,网络", "title": "\n亚马逊获得联邦通信委员会对柯伊伯互联网卫星星座的批准，并承诺为该项目提供100亿美元", "title_en": "\n\t\t\t\tAmazon gains FCC approval for Kuiper internet satellite constellation and commits $10 billion to the project\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/31/amazon-gains-fcc-approval-for-kuiper-internet-satellite-constellation-and-commits-10-billion-to-the-project/", "via": "", "real_tags": ["亚马逊", "amazon", "联邦", "网络"]}, {"category": "", "categoryclass": "", "imagename": "f1fc32416356cf9a3a717ed8651e99b8.jpg", "infoid": 1015399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想想那些用来形容它的无用习语。像“原谅和忘记”、“睁一只眼闭一只眼”之类的东西，过去的就让它过去吧。带着这种俗气的建议，难怪这么多人拖着满满的怨恨走过一生。\n20多年来一直是宽恕作家和和平教育家的安娜·霍卢布(Ana Holub)表示，让这个问题变得更加复杂的是，我们第一次了解这一概念的时间和地点。她说，对于我们中的大多数人来说，当我们在操场上四五岁时，我们会重新教会我们称之为传统宽恕的东西。有人对我们做了什么；那个人被告知要道歉，我们被指示说，没关系。\n霍卢布说，越来越多真正令人痛苦的事情发生了--那可能就不太好了。所以我们有时生活在恐惧、复仇和愤怒中。然后，我们可以在我们的余生中一直持有它，除非我们找到一种方法来解开它，让它过去。&#34；\n与流行的观点相反，宽恕的做法不是为了宽恕或为不公平待遇和其他伤害行为找借口。这不是为了让冒犯的一方道歉或表现出悔意。尽管电影、小说、诗歌和情歌中描绘了什么，但它不一定是关于和解的。诚然，与所爱的人重新联系可能是宽恕的美妙副产品，但在某些情况下，这不是一个要求，甚至也不是一个目标--特别是如果这样做会让你受到更多伤害的话。\n霍卢布说，我喜欢传授的宽恕的扩展版本是一种深刻的、灵魂层面的释放，释放我们的痛苦、悲伤和苦难。我们这么做是因为我们想要自由。我们这样做是因为我们想要健康，我们想要心灵的安宁。\n她说，这些情绪会变成疾病。我们只是把它塞进去，它就会变成有毒的.。它会变得功能失调。\n肯尼迪在阅读了已故的科林·蒂普斯(Colin Tiping)所著的《激进的宽恕》后，于2008年成为一名获得认证的宽恕教练。他的方法只是练习宽恕的一种方式(顺便说一句，这已经被证明可以改善心理健康)。这些外卖的灵感来自于小费的工作：\n仔细分析冒犯的行为及其对你的影响。把一切都吐出来--愤怒、伤害、苦涩--所有你心中一直带着的丑陋、血淋淋的感觉。\n虽然传统的宽恕要求你假装你没有被别人的行为激怒或伤害，但实际的宽恕恳请我们尊重所有这些赤裸裸的情感。\n一个简单的注意事项：在做这项工作时，只能以适合你的速度移动，如果你需要的话，请寻求专业的帮助。\n霍卢布写了一本名为“宽恕与自由”的书，教授了多种宽恕方法，他提出了为这一步做好准备的方法：关掉手机，排除干扰，创造一个隐私空间。\n她说，理想情况下，选择一个人来充当证人-一个可以带着同情和不加评判地倾听的人。否则，你可以大声说出你的故事，或者把它全部写下来，这样你就可以自己做了。\n霍卢布称愤怒是次要的情绪，它守护着我们更脆弱的情感，如悲伤、恐惧、被遗弃和失望。\n所以，一定要给自己足够的许可和时间去真正深入挖掘，挖掘出你的愤怒隐藏在什么地方。\n闭上眼睛，唤起正在给你带来痛苦的事件。让它在没有智能化的情况下冒泡起来。肯尼迪说，关掉你思考的大脑。\n她说，如果这是愤怒，那就大声哭出来或尖叫出来。拿一个枕头，用它敲打沙发。只要把你身体细胞里的能量释放出来就行了。\nHolub说，如果这项运动唤起了你对生活中其他时候的记忆，当你也感觉到被遗弃、背叛或类似的伤害时，不要感到惊讶。宽恕工作通常会揭示出我们在自己身上看不到的行为模式--特别是当我们将自己的痛苦归咎于他人的时候。\n通过暴露我们自己对他人反应的明显和不明显的根源，我们可以开始看到一种不同的回应方式。\n重新审视你对生活事件的看法，这些事件让你陷入受害者的角色。\n肯尼迪说，孩提时代你可能误解的情况可能会玷污你重要的成人关系。\n将成人的视角放在以儿童为中心的伤害上，可以为伤害事件提供更清晰的视角-这让我们可以自由地抛弃旧故事，取而代之的是一个不那么武断，或许更准确的故事。\n这可能会导致与被遗弃的亲人重新建立联系。但是，霍卢布说，当心你的自我可能会努力维持那些在我们生活中造成分离的破坏性故事，比如我的关系永远不会有结果。或者，我不能相信任何人！\n霍卢布说，当我们宽恕的时候，我们正在做的就是释放自我的巨大压力，让我们保持独立。\n与其把冒犯的行为看作是对你做了什么，不如想象有更大的东西在起作用：它的真正目的是反映出你内心的某种东西，而这些东西已经成熟，可以治愈了。\n肯尼迪说，想象一下，看着镜子，看到你脸上的污点。要清除污渍，你不需要开始擦拭镜子，而是要擦洗你的脸。同样，在生活中，你在别人身上看到的--消极的和积极的--往往都是你们共有的。\n肯尼迪说，只要承认你身上有某种东西在这个人的镜子里展现出来就行了。\n即使你确定冒犯你的人的行为与你没有任何关系，也要暂缓你的怀疑，和睦相处。\n记住，原谅别人不是关于他们和他们的行为，而是关于你和你的幸福。\n肯尼迪说：我是为我自己做的。我这样做是为了舒缓我的情绪。我不想心烦意乱。我不想生气地四处走动。我只是不想...。所以，我这样做是为了把那股能量从我的身体里排出。\n清除怨恨、怨恨和所有其他负面的魔术是值得拥抱和庆祝的。\n肯尼迪说，每当她完成一轮宽恕工作时，她都会用快步走或深呼吸练习来封住新获得的平静。\n霍卢布说，她对自己所学到的一切充满了感激之情，填满了她心中新开辟的空间。\n她说：我们来这里是为了吸取教训，即使是从曾经发生过的最可怕的事情中，也有宝藏，我们可以找到它们，我们可以从中吸取教训。我们可以说，是的，我想继续上课。我想放下痛苦。通过这种宽恕练习，这是可能的。\n我们很高兴收到你的来信。请给我们留言，电话是202-216-9823，或者给我们发电子邮件，地址是LifeKit@npr.org。", "note_en": "Think about all those useless idioms used to describe it. Stuff like &#34;forgive and forget,&#34; &#34;turn a blind eye,&#34; &#34;let bygones be bygones.&#34; With that kind of cheesy advice, no wonder so many people travel through life dragging a steamer trunk full of resentments.\n  Further complicating the issue is when and where we first learn about the concept, says  Ana Holub, a forgiveness author and peace educator for more than two decades. For most of us, she says, we&#39;re taught what we&#39;ll call &#34;traditional&#34; forgiveness when we&#39;re 4 or 5 years old on the playground. Someone does something to us; the person is told to apologize, and we&#39;re instructed to say, &#34;That&#39;s OK.&#34;\n    &#34;And more and more things that are really traumatic happen — then maybe it&#39;s not OK,&#34; Holub says. &#34;So we live with these feelings of fear and revenge sometimes, and anger. And then we can hold that for the rest of our lives unless we find a way to unwind it and let it go.&#34;\n    Contrary to popular opinion, the practice of forgiveness is  not about condoning or making excuses for unfair treatment and other hurtful behaviors. It&#39;s  not about getting an apology or a show of remorse from the offending party. And despite what&#39;s portrayed in films, novels, poems and love songs, it&#39;s not  necessarily about reconciliation. Granted, reconnecting with loved ones can be a wonderful byproduct of forgiveness, but it&#39;s not a requirement or even a goal in some cases — especially if doing so would subject you to more harm.\n     &#34;The expanded version of forgiveness that I love to teach is a deep, soul-level letting-go of our pain, our sorrow, our suffering,&#34; Holub says. &#34;And we do that because we want to be free. We do that because we want to be healthy and we want to have peace of mind.&#34;\n    &#34;Those emotions turn into disease,&#34; she says. &#34;We just stuff it, and that becomes toxic ... it turns dysfunctional.&#34;\n  Kennedy became a certified forgiveness coach in 2008 after reading   Radical Forgiveness, by the late Colin Tipping. His method is just one way to practice forgiveness (which, by the way, has been  shown to improve mental health). These takeaways are inspired by Tipping&#39;s work:\n    Dissect the offending behavior and how it affects you. Spew it all out — the anger, the hurt, the bitterness — all the ugly, gory feelings you&#39;ve been carrying inside you.\n    While &#34;traditional&#34; forgiveness wants you to pretend you&#39;re not angry or hurt by someone&#39;s behavior, actual forgiveness begs that we honor all of these raw emotions.\n  One quick note of caution: When doing this work, move only at a comfortable pace for you, and seek professional help if you need it.\n  Holub, who wrote the book   Forgive and Be Free and teaches a blend of forgiveness approaches, suggests ways to prepare for this step: Turn off your phone, get rid of distractions and create a space of privacy.\n  Ideally, she says, choose someone to play witness — someone who can listen  with compassion and  without judgment. Otherwise you can do it on your own by speaking your story out loud or writing it all down.\n      Holub calls anger a &#34;secondary emotion,&#34; one that guards our more vulnerable feelings, such as grief, fear, abandonment and disappointment.\n  So, make sure to give yourself permission and time to really dig deep to unearth whatever your anger is hiding.\n    Close your eyes and evoke the event that&#39;s causing you pain. Let it bubble up without intellectualizing. Turn off your thinking brain, Kennedy says.\n  &#34;Cry it out or scream it out if it&#39;s anger,&#34; she says. &#34;Get a pillow and beat the sofa with it. Just get that energy out of the cells of your body.&#34;\n  Don&#39;t be surprised if the exercise triggers memories of other times in life when you also felt abandoned, betrayed or similarly hurt, Holub says. Forgiveness work often uncovers behavior patterns that we don&#39;t see in ourselves — especially when we&#39;re blaming others for our pain.\n  By exposing the obvious — and less obvious — roots of our own reactions to others, we can begin to see a different way to respond.\n    Reexamine your perceptions of life events that have trapped you in the role of victim.\n  A situation you may have misinterpreted as a child can taint your important adult relationships, Kennedy says.\n     Putting an adult lens to child-centered woundedness can provide a clearer perspective of hurtful events — one that frees us to discard the old story and replace it with a less judgmental and, perhaps, more accurate one.\n  That can lead to reconnections with forsaken loved ones. But, Holub says, beware that your ego may fight to maintain the destructive stories that create separation in our lives, like &#34;My relationships never work out.&#34; Or, &#34;I can&#39;t trust anybody!&#34;\n  &#34;When we do forgiveness, what we&#39;re doing is we&#39;re unwinding that intense pressure of the ego to stay separate,&#34; Holub says.\n    Instead of viewing the offending behavior as something done  to you, imagine there&#39;s something bigger at play: that its true purpose is to reflect something inside you that&#39;s ripe for healing.\n  Kennedy says imagine looking into a mirror and seeing a smudge on your face. To clean off the smudge, you don&#39;t start wiping the mirror; rather, you clean your face. Likewise in life, often what you spot in others — negative and positive traits — are those you share.\n     &#34;Just acknowledge that there is something in you that is being shown in the mirror of this person,&#34; Kennedy says.\n  Even if you&#39;re certain the offending person&#39;s behavior has zero to do with you, suspend your disbelief and play along.\n    And remember, forgiving someone is not about them and their behavior — it&#39;s about  you and your well-being.\n  &#34;I do it for me,&#34; Kennedy says. &#34;I do it to ease my sensibilities. I don&#39;t want to be upset. I don&#39;t want to be walking around pissed off. I just don&#39;t. ... So, I do it to get that energy out of my system.&#34;\n    Purging resentment, grudges and all that other negative juju is something to embrace and celebrate.\n  Kennedy says whenever she finishes a round of forgiveness work, she seals her newfound peace with a brisk walk or deep-breathing exercises.\n  Holub says she fills the newly opened space in her heart with gratitude for all she has learned.\n  &#34;We&#39;re here to learn lessons, and even from the most horrible things that have ever happened, there are treasures, and we can find them, we can learn from them,&#34; she says. &#34;We can say, yes, I want to keep the lesson. I want to let go of the pain. And that is possible through this forgiveness practice.&#34;\n        We&#39;d love to hear from you. Leave us a voicemail at 202-216-9823, or email us at   LifeKit@npr.org .", "posttime": "2020-07-31 19:53:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原谅,forgiving,宽恕", "title": "为什么原谅别人是关于你的", "title_en": "Why Forgiving Someone Else Is About You", "transed": 1, "url": "https://www.npr.org/2020/07/28/896245305/why-forgiving-someone-else-is-really-about-you", "via": "", "real_tags": ["原谅", "forgiving", "宽恕"]}]