[{"category": "", "categoryclass": "", "imagename": "33ca5b5adfbe9c6ed72267fcfcc22863.png", "infoid": 1005902, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们首次展示了推测性执行使攻击者能够跨多个Intel CPU的核心泄漏敏感信息，绕过针对先前的推测性(或瞬时)执行攻击(如Spectre、Meltdown等)的所有现有核心内缓解措施。到目前为止，所有攻击都假设攻击者和受害者共享同一核心，因此将相互不信任的代码放置在不同核心上可以阻止此类攻击。相反，我们提出了一个新的瞬时执行漏洞，Intel将其称为“特殊寄存器缓冲区数据采样”或SRBDS(CVE-2020-0543)，可使在一个CPU内核上执行的攻击者控制的代码泄漏在另一个内核上执行的受害者软件的敏感数据。\n为了发现新的漏洞，我们构建了串扰，这是一个分析器，用于检查复杂(“微编码”)x86指令在CPU内核边界之外的行为。通过串扰，我们发现各种指令执行核外请求，以便从所有CPU核心之间共享的分段缓冲区读取数据。我们观察到分段缓冲区包含敏感数据，包括硬件数字随机数生成器(DRNG)的输出，并且此类数据可以使用RIDL(又名MDS)攻击跨内核泄漏。我们展示了在实践中可以针对在英特尔软件保护扩展(SGX)安全飞地中运行的受害应用程序利用此漏洞进行攻击。具体地说，我们的端到端攻击可能会在仅执行一次数字签名操作之后泄露在单独CPU核心上运行的安全飞地的整个私钥。\n我们的相声论文(PDF)被接受在2021年IEEE安全与隐私研讨会上发表。\n在过去的几年中，Meltdown、Spectre、Prehadow和RIDL等攻击表明，信息泄漏可能跨越许多现代CPU支持的所有安全域。这是由于现代CPU管道执行的推测性/无序执行，允许攻击者观察内部CPU核心组件上瞬时执行的代码的副作用，如图2所示，例如行填充缓冲区、加载端口、存储缓冲区等。这些微体系结构组件都在同一CPU核心上运行的硬件线程(或超线程)之间共享。如下所示，串扰强制将来自其他内核的信息传输到核上资源，如行填充缓冲区(LFBs)，然后使用RIDL检查LFBs的内容。\n因此，现有攻击要求攻击者和受害者共享相同的CPU核心，以便利用核上共享的内部资源，并能够在相同或不同的每核硬件线程内泄露受害者的秘密数据。这一限制巩固了这样一种信念，即将不同的安全域(在空间或时间上)隔离在各自的核心上可以防止所有这些攻击。现有的各种减刑措施都明确地建立在这一假设的基础上。\n例如，为了应对最近的RIDL攻击，一种选择是禁用同步多线程(SMT)-每个CPU核心只允许一个硬件线程-并刷新同一硬件线程内安全域交换机的微体系结构缓冲区。禁用SMT的另一种成本较低的替代方案是部署安全调度策略，该策略仅允许每个CPU核心有一个安全域。不幸的是，尽管代价已经很高，但这些缓解措施并不能阻止跨核心的瞬时执行攻击。在串扰的情况下，我们证明了这样的攻击是可能的，因此攻击面比先前假设的要大。\n跨核瞬时执行攻击由执行对共享缓冲区的核外访问的指令启用。特别地，如图1所示，我们发现了各种复杂的微编码指令，它们执行对跨所有CPU核心共享的微体系结构缓冲区(我们称为分段缓冲区)的核外访问。有趣的是，分段缓冲区保留所有CPU核心之前执行的核外指令的结果。例如，它包含核心外硬件DRNG(图3)返回的随机数、BootGuard状态散列和其他敏感数据。通过串扰，我们发现在瞬时执行期间从该分段缓冲区读取数据可能会泄漏以前执行的受害者指令访问的敏感数据。\n为了研究这种行为，我们构建了串扰，这是一个分析器，用于检查CPU内核边界之外的所有x86指令的行为。串扰(图4)描述了发出核外存储器请求的所有x86指令-生成具有不同上下文(例如，提供不同操作数)的指令。我们使用指令生成阶段的输出结合现有的RIDL攻击来理解核上行填充缓冲区(LFBs)与全局分段缓冲区之间的交互。基本上，我们使用RIDL检查LFBs中的内容\n由于不同的指令写入分段缓冲区中的不同偏移量，因此攻击者可以手工创建指令，从而泄露他们想要的所有信息。特别地，串扰的指令剖析阶段使用指令写入分级缓冲器内的不同偏移量的事实来自动发现指令之间的信息如何泄漏。作为输出，它会产生大量指令，这些指令可能会泄漏整个分段缓冲区，包括从系统中不同内核上执行的其他指令请求的任何核外信息。\n串扰指令剖析级的设计(图5)如下所示。首先，在一个CPU核心上，我们运行可能与分段缓冲区交互的目标指令。然后，在另一个CPU核上，我们尝试观察分段缓冲区的内容是否因目标指令的执行而改变。为了确保我们观察到分段缓冲区的内容，我们需要确保连续地从分段缓冲区拉取数据。为此，我们使用所谓的分段缓冲区泄漏原语(例如，CPUID 0x80000002)。\n为了剖析目标指令(图6)，串扰控制的CPU核心首先通过执行泄漏原语来启动分级缓冲器，泄漏原语将控制的数据写入缓冲器内的已知偏移量。并行地，在另一个核上，我们执行目标指令。最后，我们通过与控制数据进行比较来观察任何被覆盖的字节。\n我们的分析器帮助我们找到了许多易受攻击指令的分段缓冲区泄漏(表1)。其中，RDRAND和RDSEED特别(安全)重要，因为它们的输出包括由内核外硬件DRNG返回的随机数。\n英特尔软件保护扩展(SGX)是2015年随英特尔Skylake微体系结构推出的硬件扩展。SGX提供了一组指令，允许非特权用户程序创建和管理称为安全飞地的加密内存区域，从而保护敏感数据(如加密密钥)不受潜在危害的操作系统和虚拟机管理程序的影响。\n为了演示我们发现的漏洞的安全影响，我们实现了第一个跨CPU核心的瞬时执行攻击。我们的攻击可能会泄漏分段缓冲区中的RDRAND和RDSEED指令的输出，这些指令加在一起是CPU为任何英特尔SGX安全飞地提供的唯一可用随机性来源。事实上，我们展示的是，使用此功能，攻击者只需执行一次签名操作即可泄露在单独CPU内核上运行的Intel SGX Enclave的整个ECDSA私钥。\n英特尔已在2020年6月9日星期二或更早分发给软件供应商的微码更新中实施了对SRBDS漏洞的缓解。缓解在更新分段缓冲器之前锁定整个存储器总线，并且仅在清除其内容之后才解锁。此策略可确保信息不会暴露给从其他CPU核心发出的核外请求。由于锁定整个系统的内存总线会带来相当大的性能开销，英特尔仅应用了缓解措施来强化少量安全关键指令，特别是RDRAND、RDSEED和EGETKEY(ENCLU指令的叶子)。这意味着发出核外请求的任何其他指令(例如，RDMSR)的输出仍可能跨CPU核心泄漏。\n我们在2018年9月披露了显示Staging Buffer内容泄漏的初始PoC(概念验证)，随后在2019年7月披露了实施跨核RDRAND/RDSEED泄漏的PoC。在我们的报告之后，英特尔承认了这些漏洞，用英特尔Bug Bounty(侧通道)计划奖励了串扰，并将泄露归因于我们的团队，没有其他独立的搜索者。英特尔还请求禁运至2020年5月(后来延长)，原因是难以对本文中确定的跨核心漏洞实施修复。英特尔将我们的攻击描述为“特殊寄存器缓冲区数据采样”或SRBDS(CVE-2020-0543)，并将其归类为绕过域的瞬时执行攻击。\n我是否可能受到该漏洞的影响？如果您使用的是Intel CPU，则很可能会出现这种情况。英特尔的高端服务器CPU似乎不容易受到攻击，一些最新的英特尔CPU也不容易受到MDS/TAA的攻击。您可以在上面的表2中找到我们测试的英特尔CPU列表。\n我如何减轻该漏洞？我们建议安装英特尔的最新微码，其中包括针对RNG输出和SGX密钥的SRBDS缓解功能。这通常是通过标准软件更新机制分发的。\n这真的是一个“新”漏洞吗？严格地说，用CVE的话说，是的。同时，潜在问题源于最初的RIDL(又名MDS)类漏洞，但泄漏来源现在是以前未记录的(暂存)缓冲区。由于缓冲区是跨CPU核心共享的，因此该漏洞首次启用跨核瞬时执行攻击。\n如果禁用SMT(超线程)，我是否会受到影响？是。我们的跨核心攻击不依赖于SMT。事实上，正如您在表2中看到的，我们的攻击是在完全不支持SMT的Intel Xeon E3-1220V6(Kaby Lake)CPU上运行的。\n如果我不在英特尔SGX中运行应用程序，是否会受到影响？从理论上讲，是的。该潜在漏洞会导致任意应用程序之间的某些数据(如RNG输出)跨核心泄漏。但是，Intel SGX Enclaves更容易受到实际攻击，因为攻击者可以很容易地减慢受害者的执行速度并控制泄漏。我们预计，在英特尔SGX领域之外的实际利用会更加困难，但并非不可能。\n我可以用这个徽标吗？该徽标是免费使用的，通过…放弃权利。。啊，不，等等，我们没有标识，但是如果你真的坚持要在这里买的话。\n长达21个月的禁运是怎么回事？我们不会对长时间的禁运掉以轻心，因为我们认为短的漏洞披露期(理想情况下是90天)是给供应商足够的时间来缓解漏洞和及早通知公众之间的一个很好的平衡。我们最初的报告(2018年9月)仅描述了同核(CPUID)泄漏，直到2019年7月，我们才与英特尔进一步讨论此PoC，当时我们报告称，我们为包括RDRAND在内的多个指令复制了跨核泄漏。到那时为止，我们还没有彻底调查这次攻击的影响(显然，英特尔也没有)。我们认识到修复这样的漏洞的复杂性，但正如我们过去明确表示的那样，英特尔应该从一开始就正确修复MDS漏洞-并处理我们报告的POC-而不是玩弄其症状。", "note_en": "For the first time, we show that speculative execution enables attackers to leak sensitive information also  across cores on many Intel CPUs, bypassing all the existing intra-core mitigations against prior  speculative (or  transient) execution attacks such Spectre, Meltdown, etc. Until now, all the attacks assumed that attacker and victim were sharing the same core, so that placing mutually untrusting code on different cores would thwart such attacks. Instead, we present a new transient execution vulnerability, which Intel refers to as “ Special Register Buffer Data Sampling” or SRBDS ( CVE-2020-0543), enabling attacker-controlled code executing on one CPU core to leak sensitive data from victim software executing on a different core.\n  To uncover the new vulnerability, we built CrossTalk, a profiler to inspect the behavior of complex (“microcoded”) x86 instructions beyond the CPU core boundaries. With CrossTalk, we discovered that various instructions perform offcore requests to read data from a  staging buffer shared between all the CPU cores. We observed that the staging buffer contains sensitive data, including the output of the hardware digital random number generator (DRNG), and that such data can be leaked across cores using  RIDL (aka MDS) attacks. We show this vulnerability can be exploited in practice against victim applications running in Intel Software Guard Extension (SGX) secure enclaves. In particular, our end-to-end exploit can leak the entire private key of a secure enclave running on a separate CPU core after only a single digital signature operation.\n Our  CrossTalk paper (PDF) is accepted for publication at the IEEE Symposium on Security &amp; Privacy 2021.\n   In the past few years attacks like  Meltdown,  Spectre,  Foreshadow, and  RIDL demonstrated that information leakage is possible across all security domains supported by many modern CPUs. This is due to the speculative/out-of-order execution performed by modern CPU pipelines, which allows an attacker to observe side-effects of transiently executed code over  internal CPU core components, as shown in Figure 2 for instance Line Fill Buffer, Load Port, Store Buffer, etc.. These microarchitectural components are all shared among the hardware threads (or hyperthreads) running on the same CPU core. As we will show below, CrossTalk forces information from other cores to be transferred to on-core resources such as the Line Fill Buffers (LFBs) and then uses  RIDL to inspect the content of the LFBs.\n   As such, existing attacks require the attacker and the victim to share the same CPU core in order to exploit the on-core shared internal resources and be able to leak the victim’s secret data within the same or different per-core hardware threads. This constraint has consolidated the belief that isolating (spatially or temporally) different security domains on their own cores would prevent all these attacks. A variety of existing mitigations explicitly build on this assumption.\n For instance, to counter the recent  RIDL attacks, an option is to disable Simultaneous MultiThreading (SMT)—allowing only a single hardware thread per CPU core—and flush microarchitectural buffer at security domain switch within the same hardware thread. A less expensive alternative to disabling SMT is to deploy  secure scheduling policies which only allow a single security domain per CPU CORE. Unfortunately, albeit already costly, these mitigations cannot stop cross-core transient execution attacks. With CrossTalk, we show that such attacks are possible and that the attack surface is thus larger than previously assumed.\n  Cross-core transient execution attacks are enabled by instructions that perform offcore accesses to shared buffers. In particular, as shown in Figure 1, we found a variety of complex microcoded instructions that perform offcore accesses to a microarchitectural buffer shared across all the CPU cores, which we refer to as the  staging buffer. Interestingly, the staging buffer retains the results of previously executed offcore-instructions across all CPU cores. For instance, it contains the random numbers returned by the offcore hardware DRNG (Figure 3), bootguard status hashes, and other sensitive data. With CrossTalk, we show reading from this staging buffer during transient execution may leak sensitive data accessed by previously executed victim instructions.\n   In order to investigate this behavior, we built CrossTalk, a profiler for examining the behavior of all x86 instructions beyond the CPU core boundary. CrossTalk (Figure 4) profiles all the x86 instructions that make offcore memory requests―generating the instructions with different contexts (e.g., providing different operands). We use the output of the instruction generation stage in combination with the existing RIDL attack to understand the interaction between on-core Line Fill Buffers (LFBs) with the global staging buffer. Essentially, we use RIDL to inspect what is in the LFBs after we execute one of these instructions.\n  Since different instructions write to different offsets in the staging buffer, attackers can craft instructions so as to leak all the information they want. In particular, CrossTalk’s instruction profiling stage uses the fact that the instructions write to different offsets within the staging buffer to automatically discover how information leaks between instructions. As output, it produces a number of instructions, capable of leaking the entire staging buffer including any offcore information requested from other instructions that are executed on different cores in the system.\n  The design of CrossTalk’s instruction-profiling stage (Figure 5) is as follows. First, on one CPU core, we run the target instructions that potentially interact with the staging buffer. Then, on another CPU core, we try to observe whether the contents of the staging buffer change due to the execution of the target instructions. To make sure that we observe the contents of the staging buffer, we need to ensure that we continuously pull data from the staging buffer. We use what we call  staging buffer leaking primitives (e.g. CPUID 0x80000002) for this purpose.\n  To profile a target instruction (Figure 6), the CrossTalk-controlled CPU core first primes the staging buffer by executing leak primitives which write controlled data to known offsets within the buffer. In parallel, on another core, we execute the target instruction. Finally, we observe any overwritten bytes by comparing against the controlled data.\n   Our profiler helped us find staging buffer leaks for a number of vulnerable instructions (Table 1). Among others, RDRAND and RDSEED are of particular (security) interest, since their output includes random numbers returned by the offcore hardware DRNG.\n    Intel Software Guard Extensions (SGX) is a hardware extension introduced in 2015 with the Intel Skylake microarchitecture. SGX provides a set of instructions to allow unprivileged user programs to create and manage encrypted memory regions called  secure enclaves, allowing sensitive data (such as encryption keys) to be protected from potentially compromised operating systems and hypervisors.\n To demonstrate the security impact of the vulnerability we discovered, we implemented the first transient execution attack across CPU cores. Our attack can leak the output of the RDRAND and RDSEED instructions from the staging buffer, which together represent the only available source of randomness provided by the CPU for any Intel SGX secure enclave. In fact, we show that, with this capability, an attacker can leak the entire ECDSA private key of an Intel SGX enclave running on a separate CPU core after only one single signature operation.\n     Intel has implemented its  mitigation for the SRBDS vulnerability in a microcode update distributed to software vendors on Tuesday June 9, 2020 or earlier. The mitigation locks the entire memory bus before updating the staging buffer and only unlocks it after clearing its content. This strategy ensures no information is exposed to offcore requests issued from other CPU cores. Due to the considerable performance overhead of locking the entire system’s memory bus, Intel only applied the mitigation to harden a small number of security-critical instructions, specifically RDRAND, RDSEED, and EGETKEY (a leaf of the ENCLU instruction). This means that output from any other instruction (e.g., RDMSR) that issues offcore requests can be still leaked across CPU cores.\n  We disclosed an initial PoC (Proof-Of-Concept) showing the leakage of staging buffer content in September 2018, followed by a PoC implementing cross-core RDRAND/RDSEED leakage in July 2019. Following our reports, Intel acknowledged the vulnerabilities, rewarded CrossTalk with the Intel Bug Bounty (Side Channel) Program, and attributed the disclosure to our team with no other independent finders. Intel also requested an embargo until May 2020 (later extended), due to the difficulty of implementing a fix for the cross-core vulnerabilities identified in this paper. Intel describes our attack as “ Special Register Buffer Data Sampling” or SRBDS ( CVE-2020-0543), classifying it as a domain-bypass transient execution attack.\n     Am I potentially affected by the vulnerability?  If you’re using an Intel CPU, it’s quite likely. Intel’s higher-end server CPUs don’t appear to be vulnerable, and some of the very latest Intel CPUs aren’t vulnerable to MDS/TAA. You can find a list of the Intel CPUs we tested in Table 2 above.\n  How do I mitigate the vulnerability?  We recommend installing Intel’s latest microcode, which includes the mitigation against SRBDS for RNG output and SGX keys. This is usually distributed through the standard software update mechanism.\n  Is this really a “new” vulnerability?  Strictly speaking, in CVE parlance, yes. At the same time, the underlying issue stems from the original RIDL (aka MDS) class of vulnerabilities, except the source of leakage is now a previously undocumented (staging) buffer. Since the buffer is shared across CPU cores, the vulnerability enables cross-core transient execution attacks for the first time.\n  Am I affected if SMT (hyperthreading) is disabled?  Yes. Our cross-core attack does not rely on SMT. In fact, as you can see in Table 2, our attack works on an Intel Xeon E3-1220V6 (Kaby Lake) CPU which does not support SMT at all.\n  Am I affected if I am not running applications in Intel SGX?  In theory, yes. The underlying vulnerability enables cross-core leaks of some data – like RNG output – between arbitrary applications. However, Intel SGX enclaves are more amenable to practical exploitation, since attackers can easily slow down the execution of the victim and control the leakage. We expect practical exploitation beyond Intel SGX enclaves to be more difficult but not impossible.\n  Can I use the logo?  The logo is free to use, rights waived via …. ah, no, wait, we don’t have a logo, but if you really insist you can grab one  here.\n  What’s with the lengthy 21-months embargo?  We do not take long embargoes lightly, as we believe a short (ideally 90-day) vulnerability disclosure period is a good balance between giving vendors sufficient time to mitigate a vulnerability and informing the public early. Our original report (Sep 2018) only described same-core (CPUID) leaks and we did not discuss this PoC further with Intel until July 2019, when we reported that we had reproduced cross-core leaks for a number of instructions including RDRAND. Up to that point, we had not investigated thoroughly the implications of the attack (and, apparently, neither had Intel). We recognize the complexity of fixing bugs like this one, but as we made  clear in the past, Intel should have fixed the MDS vulnerability – and dealt with our reported PoCs – properly from the outset, rather than play whac-a-mole with its symptoms.", "posttime": "2020-06-10 04:59:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "srbds,指令", "title": "串扰/SRBDS显示跨CPU核心泄漏信息的可能性", "title_en": "CrossTalk/SRBDS shows possibility of leaking information across CPU cores", "transed": 1, "url": "https://www.vusec.net/projects/crosstalk/", "via": "", "real_tags": ["srbds", "指令"]}, {"category": "", "categoryclass": "", "imagename": "b4deff0a8ef0447d1811c85332d3aa45.jpg", "infoid": 1005900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年5月29日，格拉斯哥蔚蓝用户小组庆祝了它运行的第三个年头。我不得不说，当我第一次有建立一个用户组的想法时，我从来没有想过它会把我带上个人和职业之旅。我不能充分感谢某些人和组织支持我的想法，并以这种方式发展社区。\n当我创建这个群的时候，英国只有一个专注于Azure的用户群，现在我知道英国大约有12到13个群，这真是太好了。英国和整个欧洲的很多人都要求我帮助他们建立一个用户群，并分享我的学习和见解。为了纪念三周年纪念日，我想分享一些我的想法。因此，对于任何想要创建一个社区的人，不管是否专注于Azure，这里是我对创建和运营一个成功的用户组需要做些什么的想法。\n当我有了用户组的想法，并与一些人交谈，确认这是一个好主意和一些东西时，我认为这是一个好主意。我开始想出一个名字，我选择了格拉斯哥Azure用户组，它给了我们一个有趣的首字母缩写，GAG，但我注意到很多其他用户组都遵循了这个命名惯例。😉。\n接下来是注册域名和设计徽标。我试了试徽标设计，把一些东西放在一起，我们后来改变了徽标设计，但关键是要有一些可以围绕着你打造集团品牌的东西，也要有一些在贴纸、横幅或T恤上效果很好的东西。我并不是建议你从这一切开始，但从长远来看，这肯定是需要考虑的事情，要牢记你希望团队走向何方，希望团队实现什么目标，成为什么样的人。\n我还为电子邮件和文件存储设置了一个Microsoft 365租户，将用户组通信和文件与我自己或我的工作分开。这是与此相关的成本，而且这是用户组在一开始就有资格通过微软赞助计划获得的东西。\n这可能是运行用户组花费的时间最多、需要的工作最多的部分。传播关于这个团体、事件和互动的信息需要时间和精力。这绝对不会在一夜之间发生，所以如果你没有立即看到任何牵引力，也不要灰心丧气。\n我使用了很多平台来帮助传播关于这个团体和我们举办的活动的信息。\nTwitter是我获得大量参与的地方，所以我强烈建议你建立一个Twitter，在你的社区中找到标签和有影响力的人，并利用这些标签来传播信息。对社交媒体平台的真正投资可以看到巨大的增长，我一直对我们的互动保持宽松的注意。截至2017年底，我们有139名推特粉丝，截至2018年底，我们有329名粉丝，截至2019年底，我们有500多名粉丝。\n虽然我们没有看到推特追随者名单中的每个人都参加我们的小组，但我们有一个很棒的社区，他们分享和喜欢我们的帖子，这有助于提高小组的意识。我们还利用我们的演讲者个人资料和联系，我们在关于他们即将举行的会议的帖子中标记他们，这再次提高了团队对新人的认识。\n该组织还有一个Facebook，这再次帮助我们传播信息。然而，我们在这里取得的成功有限。但它仍然是我保持活力并发布事件等信息的平台。它有助于提高搜索引擎的影响力，也意味着我们的团队在整体上获得了更高的知名度。\n利用(LinkedIn)是我试图做的事情，但结果好坏参半。我们有一个小组和一个公司页面。我们确实通过这些方法获得了一些新成员，但都没有获得太多互动。再说一次，我让他们去那里是为了提高搜索引擎的影响力，也是为了确保我们在所有平台上都能访问一致的社交媒体标签。\n当我刚开始的时候，为这个小组建立一个网站是轻而易举的。我们的网站不是最有魅力的，是一个基本的网站，但它提供了一个平台，在那里我们可以分享该组织的使命、行为准则、活动日程和赞助商信息。再一次，它有助于润滑搜索引擎果汁，以增加我们的受众，并确保人们知道我们，如果他们正在搜索的用户群。\n正如我所说的，这个网站相当基础，最初的设计是在几个小时内组装起来的，并托管在Azure上，这是一个基本的Azure Web App，以将成本保持在最低水平。\n我去年确实重新设计了这个网站，并努力使SEO变得更好，这样当人们搜索Azure用户组时，我们就会再次被注意到。\n当我开始创建用户组时，我还通过Mailchinp创建了一份时事通讯。我在这里老实说，我不清楚我为什么想要一份时事通讯，但我认为这将是与社区交谈和沟通的另一种很好的方式。时事通讯增长了，我们在那里有160多个订阅者，我确实看到很多人通过它参与进来。并不是每个人都在社交媒体平台上互动，所以尽管运行时事通讯可能会花费很多时间，但我仍然会这么做。\n寻找扬声器是一件很重要的事情，摸着石头过河是我从来没有遇到过的问题。总有一批伟大的志愿者或我认识的人可以请我介绍。排列演讲者和主题是我从两个角度做的事情，我从社区获得他们想要听到的反馈，我还通过我日常工作中的客户互动来寻找我看到的流行主题。这是一种在会议上获得正确内容的平衡行为，我可能并不总是正确的，但我肯定会尽我最大的努力。我也一直试图鼓励新的演讲者，用户组是非常友好的鼓励社区，我在一个用户组开始了我的公开演讲生涯，并将其推荐给任何人\n我知道有些用户组完全远程操作，不亲自举办活动，我们选择了亲自举办活动。所以我必须找一个场地，我找到了当地一家招聘公司Hays，他们有兴趣支持这个团体，提供场地，以及食物和饮料。\n对于我们来说，拥有一个在工作时间以外很容易进入的场地，以及靠近交通连接的地方，对于帮助与会者到达场地，并在活动结束后快速、安全地回家非常重要。\n在管理用户组时，您需要帮助的是场地成本和餐饮成本。还有其他的事情，如电子邮件，网站托管，贴纸等也可能需要支持，但是，它们是可选的，不是你开始时必须需要的东西。组织不一定会在没有回报的情况下支持你，用户群给组织额外的营销，我们的网站和时事通讯为我们的赞助商做广告。我们在活动前后都会强调它们。我们还鼓励我们的赞助商派代表参加我们的活动，这样他们也可以与与会者进行面对面的互动。所以他们有机会扩大他们的联系网络，但我们总是要求他们不要给我们的与会者发垃圾邮件，我们永远不会把与会者的信息直接提供给我们的赞助商。。\n管理一个用户组是一项繁重的工作，很多人认为这只是你几个小时的时间，但事实并非如此。为了保持用户组的运行并使其成功，幕后投入了大量的精力和时间。这是我告诉每个人的一件事，这是一个巨大的承诺，人们需要意识到这一点。\n计划一个负责人可以大大节省时间，12月份我就开始计划下一年的计划，我会在日记里记下明年开会的日期。这样我们的场馆主人就可以提前计划，我可以知道会议什么时候举行，这样我就可以确保那天晚上我在格拉斯哥。我们的赛程相当一致，每隔两个月的最后一个星期三是我们一直努力争取的日子。我认为12月是我们唯一不同的月份。\n我在日记中抽出时间来做一些管理任务，在我力所能及的地方，我试着把事情自动化。我的很多社交媒体互动都是使用日程安排工具安排的，这意味着我正在尽我最大的能力利用这些平台，而不是试图在最后一刻做事情，错失扩大团队的机会。\n我从来没有足够的时间去做我想做的事情和实现的事情，有一个联合组织者会有所帮助，但每个人都需要被说服去帮助和承诺时间，否则就不会奏效。\n在格拉斯哥，还有很多其他的用户群体在运营，既有技术的，也有非技术的。因此，当我开始创建用户组时，我注意到了这些组，并试图对他们的日程安排和会议节奏进行一些研究。多年来，我们一直与其他以微软为中心的小组合作，如格拉斯哥数据用户小组和苏格兰SharePoint&amp；O365用户小组。我们举办了联合活动，并将社区聚集在一起，这总能看到每个小组都有新的成员加入。\n尽管我投入了大量的时间，有时也是一次压力很大的经历，但我不会改变成立团队并运营它的做法。我有很多很棒的经历，遇到了一些很棒的人，我喜欢这一切。我当然会鼓励人们参与到一个用户群体中来，无论是作为参与者，演讲，帮助组织或组织一场活动，所有这些事情都会给你带来新的技能和体验。", "note_en": "On the 29th May 2020, the  Glasgow Azure User Group celebrated it&#39;s third year of running. I have to say when I first had the idea about setting up a user group, I never thought it would take me on the personal and professional journey that it has. I can&#39;t thank certain people and organisations enough for backing my idea and growing the community the way it has evolved.\n When I started the group, there was only one other Azure focussed user group in the UK and it&#39;s great to see there are now about  12 or 13 groups that I know of now in the UK. A lot of people both in the UK and throughout Europe have asked me to help them start a user group and share my learnings and insights. And to mark the three year anniversary I wanted to share some of my thoughts. So for anyone looking to start a community, Azure focussed or not, here are my thoughts on what it takes to start and run a successful user group.\n  When I had the idea of the user group and had spoke to some people to confirm it was a good idea and something the thought was a good idea. I set about starting to come up with a name, I went with Glasgow Azure User Group, which has given us a funny acronym, GAUG, but I notice a lot of other user groups have followed this naming convention. 😉\n Registering a domain name and coming up with the logo were next. I tried my hand at logo design and pulled something together, we&#39;ve since changed that logo design but it is key to have something you can build the group&#39;s brand around and also something that works well on stickers, or banners or tshirts. I&#39;m not suggesting that you start with all of that but certainly it is something to think about in the long term, being mindful of where you want to the group to go and what you want it to achieve and become.\n I also set up a Microsoft 365 tenant for email and file storage, keeping the user groups communication and files separate from my own or my work. There is a cost associated with this and it was something at the start that the user group was eligible for via a Microsoft sponsorship program at the time.\n  This is probably the part that takes the most time and requires the most work of running a user group. Spreading the word about the group, the events, getting interaction, takes time and effort. It definitely doesn&#39;t happen overnight, so don&#39;t be discouraged if you don&#39;t see any traction immediately.\n I use a bunch of platforms to help spread the word about the group and the events that we run.\n  Twitter is where I get a lot of engagement, so I&#39;d highly recommend that you set one up, find the hashtags and influencers within your community and leverage those to spread the word. True investment in the social media platform can see great growth, I&#39;ve kept a loose note of our interaction. At the end of 2017, we had 139 Twitter followers, by the end of 2018 we had 329 and at the end of 2019 we had over 500.\n Although we don&#39;t see everyone from our Twitter follower list attend our groups, we have a great community that share and like our posts which helps to grow the awareness of the group. We also leverage our speakers profiles and connections, we tag them in posts about their upcoming sessions, which again increases the awareness of the group to new people.\n  The group also has a  Facebook, which again helps us spread the word. However, we&#39;ve had limited success here. But it&#39;s still a platform I keep alive and post on about events etc. It helps with the &#34;search engine juice&#34; and means our group gets more visibility overall.\n  Making use of [LinkedIn] is something that I have tried to do, but get mixed results. We have a  group and also a &#34; company page&#34;. We do get a few new members via these methods, but neither get a lot of interaction. Again I have them there to increase the &#34;search engine juice&#34; and also to ensure we access a consistent social media tag across all the platforms.\n  Setting up a website for the group was a no brainer when I started. Our  website is not the most glamourous and is a basic website, but it serves a platform where we can share the group&#39;s mission,  code of conduct, event schedule and sponsor information. Again it helps to grease the &#34;search engine juices&#34; to increase our audience and make sure people know about us if they are searching for a user group.\n As I said the website is fairly basic, the original design was put together in a matter of hours and is hosted on  Azure a basic  Azure Web App to keep costs at a minimum.\n I did redesign the website last year and worked hard on making the SEO good, so that again we get noticed when people are searching for Azure User Groups.\n  When I started the user group up as well, I also created a newsletter via  Mailchimp. I&#39;ll be honest here, I didn&#39;t have a clear idea of why I wanted to have a newsletter, but I thought it would be another great way of talking and communicating with the community. The newsletter has grown, we&#39;ve got over 160 subscribers there, and I do see a lot of engagement from people via it. Not everyone interacts within social media platforms, so although running the newsletter can take a lot of time, I still do it.\n  Finding speakers, is something,  touch wood is something that I have never really had an issue finding. There has always been a line of great volunteers or people I know I can reach out to ask to present. Lining up speakers and the topics is something I that do from two angles, I take feedback from the community around what they want to hear about, and I also look for topics that I see are popular through the customer interactions I have through my day job. It&#39;s a balancing act getting the right content at the meetups and I probably haven&#39;t always got it right, but I certainly try my best. I&#39;ve always tried to encourage new speakers as well, user groups are great friendly encouraging communities and I started my public speaking career at a user group and would recommend it to anyone\n  I know that some user groups operate completely remotely and don&#39;t host in person events, we went with the option of hosting in person events. So I had to find a venue, I found a local recruitment company  Hays that were interested in supporting the group and providing the venue, as well as food and drink.\n Having a venue that was easy to access out of hours as well as close to transport links has been important to us to help enable attendees reach the venue and also get home quickly and safely after the event.\n  The things that you need help with when running a user group are things like venue cost and food and drink costs. There are other things, such as email, website hosting, stickers, etc that could also need support however, they are optional and are not something you necessary need when you start. Organisations aren&#39;t necessarily going to support you without something back in return, a user group gives organisations additional marketing, our website and newsletters advertise our sponsors. And we highlight them at our events before and after the event. We also encourage our sponsors to send representatives to our events so they can interact with attendees in person as well. So they have opportunity to increase their network of contacts, but we always ask that they don&#39;t spam our attendees and we never give out attendees information directly to our sponsors. .\n  Running a user group is a lot of work, a lot of people assume it&#39;s just a couple hours of your time but it isn&#39;t. A lot of effort and time goes in behind the scenes to keep the user group running and make it successful. It&#39;s the one thing I tell everyone, this is a big commitment and people need to be aware of that.\n Planning a head can be a big time saver, in December I start to plan the year ahead, I get the dates for the next year&#39;s meetups in the diaries. So our venue host can plan ahead and I can know when meetups are happening so I can ensure I am in Glasgow for that evening. We have a fairly consistent schedule, the last Wednesday of every second month is the date we always try to aim for. I think December is the only one we vary that with.\n I put time in my diary to do some of the administrative tasks, and I try to automate things where I can. A lot of my social media interactions are scheduled using a scheduling tool, this means I am leveraging those platforms to the best of my abilities and not trying to do things last minute and miss an opportunity to grow the group.\n There is never enough time for what I would like to do and achieve, having a co-organiser can help but everyone needs to be bought into helping and committing time otherwise it doesn&#39;t work.\n  Within Glasgow there are a lot of other user groups that operate, both technical and non technical. So when I was starting the user group I was mindful of those groups and tried to some research on their schedule and meeting cadence. Over the years we&#39;ve collaborated with the other &#34;Microsoft centric&#34; groups, such as the  Glasgow Data User Group and  Scottish SharePoint &amp; O365 User Group. We&#39;ve ran joint events and brought the communities together, which always sees each group gaining new members.\n  Despite being a large time commitment and at times a stressful experience, I wouldn&#39;t change starting the group and running it. I&#39;ve had a lot of great experiences and met some fantastic people and have loved it all. I&#39;d certainly encourage people to get involved with a user group, either as an attendee, speaking, helping to co organise or organising an event, all of those things will stretch you and give you new skills and experiences.", "posttime": "2020-06-10 04:42:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "运行,running,用户组", "title": "启动和运行用户组", "title_en": "Starting and Running a User Group", "transed": 1, "url": "https://www.techielass.com/starting-and-running-a-user-group", "via": "", "real_tags": ["运行", "running", "用户组"]}, {"category": "", "categoryclass": "", "imagename": "b5f61a229364356c948da139d8f71292.jpeg", "infoid": 1005899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿(路透社)-美国联邦通信委员会(Federal Communications Commission)周二投票通过拍卖程序，向缺乏宽带服务的地区提供高达160亿美元的资金，其中包括近600万。\nFCC投票决定于10月29日开始拍卖。拍卖申请者将被要求在未提供服务的地点提供语音和宽带服务，以换取在10年内每月获得付款。\nFCC的三名共和党委员批准了这项提案，而两名民主党人则部分持不同意见。\nFCC主席、共和党人阿吉特·派(Ajit Pai)表示，无法接入高速互联网的美国人“应该尽快接入。他们等不起了..。在我们努力开发新的、更细粒度的宽带覆盖图的同时“，这将用于随后的40亿美元奖励。\n然而，民主党FCC委员杰西卡·罗森沃塞尔(Jessica Rosenworcel)不同意这一观点，他说，委员会应该确保有更好的地图来详细说明哪里缺乏服务。罗森沃塞尔说：“我们厚颜无耻地无视我们基于准确数据所承担的法律义务，匆忙将数十亿美元赶出去，这意味着当涉及宽带时，我们将留下数百万人。”\n该小组的另一位民主党人杰弗里·斯塔克斯(Geoffrey Starks)表示，他“更愿意从较小的预算或较短的支持期限开始，这样”大部分资金就可以在我们完成地图改革后花掉“。”\nFCC委员、共和党人布伦丹·卡尔(Brendan Carr)表示，“拍卖将允许供应商将数百万美国人带过数字鸿沟。”\n该提案还将允许近地轨道卫星系统参加拍卖。", "note_en": "WASHINGTON (Reuters) - The U.S. Federal Communications Commission voted on Tuesday to adopt auction procedures to provide up to $16 billion to areas that lack broadband service, including nearly 6 million\n  The FCC voted to commence the auction on Oct. 29. Auction applicants will be required to offer voice and broadband services in unserved locations in exchange for receiving monthly payments over 10 years.\n The three FCC Republican commissioners approved the proposal, while the two Democrats dissented in part.\n FCC Chairman Ajit Pai, a Republican, said Americans without access to high-speed internet “deserve access as soon as possible. They cannot afford to wait ... while we work to develop new, more granular broadband coverage maps” that will be used to award a subsequent $4 billion.\n Democratic FCC Commissioner Jessica Rosenworcel disagreed, however, saying the commission should ensure it has better maps detailing where service is lacking. “We are rushing billions out the door with a brazen disregard for our legal obligation to do so based on accurate data and that means when it comes to broadband we are going to leave millions behind,” Rosenworcel said.\n Another Democrat on the panel, Geoffrey Starks, said he would have “preferred to start with a smaller budget or shorter term of support so that the bulk” of funds “could be spent after we complete the mapping overhaul.”\n FCC Commissioner Brendan Carr, a Republican said the “auction will allow providers to bring millions of Americans across the digital divide.”\n The proposal also will allow low earth orbit satellite systems to take part in the auction.", "posttime": "2020-06-10 04:08:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "授予,address,宽带", "title": "FCC授予高达160亿美元的奖金，以解决美国缺乏宽带服务的地区", "title_en": "FCC Awarding Up To $16 Billion To Address US Areas Lacking Broadband Service", "transed": 1, "url": "https://www.reuters.com/article/us-usa-telecom-internet/fcc-awarding-up-to-16-billion-to-address-u-s-areas-lacking-broadband-service-idUSKBN23G29R", "via": "", "real_tags": ["授予", "address", "宽带"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1005898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "再过两周，苹果将举办首届在线全球开发者大会，我们预计它将在会上发布MacOS10.16的第一个开发者测试版。我不能向你保证它将在那里宣布什么，但这里是我个人的想法，关于这一次它必须做好的事情。\nMacOS的上一个主要版本带来了巨大的结构变化，比Mac历史上任何其他系列的操作系统版本都要多：High Sierra带来了一个全新的文件系统；Mojave将其作为所有引导盘的必备文件系统，增加了严格和侵入性的隐私保护，并引入了公证和安全方面的实质性变化；Catalina放弃了对32位代码的所有支持，对引导盘进行了自Mac OS X引入以来最大的改变，强制公证，扩展了网守检查和隐私保护，等等。\n我们现在需要一段时间的整合期，在这段时间内，MacOS提供的工具可以跟上这些变化。\n从基本工具开始，disk Utility和它的命令行对应的diskutil还没有跟上文件系统及其功能的最新变化。Disk Utility仍然缺乏基本功能。例如，它无法压缩稀疏的捆绑包，准备干净重新安装MacOS10.15的磁盘非常复杂，通常会受到一系列错误的阻碍。\n尽管快速目录调整是APFS以前的主要功能之一，但磁盘实用程序或diskutil目前都不支持快速目录调整。该命令工具现在是一个错综复杂的烂摊子，需要从根本上重新设计，要么将其重新设计为两个独立的工具，要么需要将APFS命令正确地集成到一个连贯的动词和选项结构中。尽管MacOS为使用APFS快照提供了基本支持，但第三方工具(如Carbon Copy Cloner)提供的功能要优越得多，而Disk Utility根本无法检查或管理快照。\n一年前，在WWDC 2019上，Session 710花了一些时间深入研究Apple Software Restore中使用APFS的新功能，例如，向开发人员称赞这些功能是从快照恢复卷的一种方式。从那时起，第三方克隆和备份工具的开发者，如Carbon Copy Cloner的Mike Bombich，一直在密切关注ASR，发现它对于生产用途来说太不可靠了。最近，由于MacOS10.15.5中的一个缺陷，他们被迫重新使用ASR来解决这个缺陷。然而，正如Mike Bombich所写的那样，这揭示了ASR中的另一个缺陷，该缺陷使得将Catalina系统文件复制到磁盘镜像文件变得不可靠。\n我想我们所有人，除了苹果的营销人员，都认识到试图从安装了Catalina的内部硬盘启动Mac的问题。然而，苹果目前提供的21.5英寸iMac的三种基本配置中，有两种配备了1TB的内置硬盘。如果苹果打算继续让价格在1200 GB/美元/欧元以上的全新Mac电脑的用户背负APFS及其已知的性能问题的负担，那么他们和其他拥有较早Mac电脑的用户需要工具来维护它们。由于苹果仍然未能提供足够的APFS文档，使第三方开发者能够尝试对APFS卷进行碎片整理，这些用户似乎别无选择，只能支付更多费用，将他们全新的硬盘更换为SSD。\n如果您更广泛地查看，就会发现MacOS10.15.5中不乏重要的错误修复。仍然有很多用户-例如，包括很多拥有MacBook Pro 16英寸2019年的用户-他们昂贵的Mac电脑经常遭受内核恐慌，特别是在试图从睡眠中醒来的时候。执行神秘的检查以查看未签名的shell脚本是否以某种方式(如何？)。在第一次运行时已经过公证，这一功能在WWDC 2019年的任何演示文稿中都没有提到。有一个长期存在的问题，那就是游戏机仍然不能提供对你打开日志之前发生的任何事情的合理访问，而不是创建一个日志存档并打开它-这是苹果四年来故意忽略的一个功能。\n在本月晚些时候任何人发表主题演讲之前，我真正想看到的是对10.16即将到来的所有修复和改进的回顾，这些修复和改进旨在解决工具中的这些缺陷，以及MacOS在过去三年中的基本成熟度。如果没有他们，10.16的基础是薄弱的和有缺陷的，变化越多，失败的风险就越大。", "note_en": "In just over two weeks, Apple will host its first online Worldwide Developers Conference, at which we expect it to release the first developer beta of macOS 10.16. I can’t promise you any sneak preview of what it will announce there, but here are my personal thoughts as to what it must get right this time.\n The last major releases of macOS have brought huge structural change, more than any other series of operating system releases in the history of the Mac: High Sierra brought a brand new file system; Mojave made that obligatory for all boot disks, added stringent and intrusive privacy protection and introduced notarization and substantial changes to security; and Catalina dropped all support for 32-bit code, made the greatest change to boot disks since the introduction of Mac OS X, enforced notarization, extended Gatekeeper checks and privacy protection, and more.\n We now need a period of consolidation, in which the tools provided with macOS catch up with these changes.\n Starting with fundamental tools, both Disk Utility and its command line equivalent  diskutil have yet to catch up with the most recent changes in file systems and their features. Disk Utility still lacks essential features. For example it’s unable to compact sparse bundles, and preparing a disk for a clean re-install of macOS 10.15 is elaborate and usually obstructed by a succession of errors.\n Although one of the former  headline features of APFS, Fast Directory Sizing is currently unsupported by either Disk Utility or  diskutil. That command tool is now a labyrinthine mess, and needs to be fundamentally redesigned, either into two separate tools, or APFS commands need to be properly integrated into a coherent verb and option structure. Although macOS provides rudimentary support for working with APFS snapshots, third-party tools like Carbon Copy Cloner provide far superior features, and Disk Utility is unable to inspect or manage snapshots at all.\n A year ago, at WWDC 2019, session 710 spent some time delving into the new features in Apple Software Restore for working with APFS, extolling these to developers as a means of restoring volumes from snapshots, for instance. Since then, developers of third party cloning and backup tools, such as Mike Bombich of Carbon Copy Cloner, have looked closely at  asr and found it too unreliable for production use. Most recently, because of a bug in macOS 10.15.5, they’ve been forced to return to use  asr to work around that bug. However, as  Mike Bombich writes, that uncovered another bug in  asr which makes replicating Catalina system files to a disk image file unreliable.\n I think we all, with the apparent exception of Apple’s marketing staff, recognise the problems of trying to start a Mac up from an internal hard disk on which Catalina is installed. Yet two of the three base configurations of 21.5 inch iMacs  currently offered by Apple come with 1 TB internal hard disks. If Apple is going to continue to saddle users of brand new Macs costing £/$/€ 1200 and more with APFS and its known performance problems, then they and others with earlier Macs need tools to maintain them. As Apple has still failed to provide sufficient documentation about APFS to enable third-party developers to attempt to defragment APFS volumes, there seems nothing those users can do other than pay out more to have their brand new hard disk replaced with an SSD.\n Once you look more widely, there’s no shortage of essential bug fixes outstanding in macOS 10.15.5. There’s still a great many users – including plenty with the MacBook Pro 16-inch 2019, for example – whose expensive Macs suffer frequent kernel panics, particularly when trying to wake from sleep. There’s the mysterious checks performed to see whether unsigned shell scripts have somehow (how?) been notarized, when they’re first run, a feature which was never mentioned in any of the presentations of WWDC 2019. There’s the longstanding issue that Console still doesn’t provide sensible access to anything in the log which happened the moment before you open it, without creating a logarchive and opening that – a feature which Apple has deliberately omitted for four years now.\n What I’d really like to see before anyone launches into Keynote addresses later this month is a review of all the fixes and improvements which are coming in 10.16 to address these shortcomings in tools and the fundamental maturity of the last three years of macOS. Without them, 10.16 has weak and flawed foundations, and the more it changes, the greater the risk it will fall flat.", "posttime": "2020-06-10 04:07:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工具,tools", "title": "MacOS 10.16完全是关于工具和成熟度的", "title_en": "macOS 10.16 is all about tools and maturity", "transed": 1, "url": "https://eclecticlight.co/2020/06/07/last-week-on-my-mac-10-16-is-all-about-tools-and-maturity/", "via": "", "real_tags": ["工具", "tools"]}, {"category": "", "categoryclass": "", "imagename": "e5746dae3bff2041d21755e08ab5a7ac.jpg", "infoid": 1005897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的两年里，现代CPU-特别是那些由英特尔制造的CPU-一直受到一系列无休止的攻击，这些攻击使得高技能的攻击者有可能从硅片驻留的存储器中窃取密码、加密密钥和其他秘密。周二，两个不同的学术团队披露了两个新的、独特的漏洞，它们穿透了英特尔的软件保护扩展，这是迄今为止该公司处理器中最敏感的区域。\n缩写为SGX的保护旨在提供某种形式的诺克斯堡(Fort Knox)，即使在顶部运行的操作系统或虚拟机受到严重和恶意破坏时，也能保护加密密钥和其他敏感数据。SGX的工作方式是创建受信任的执行环境，以保护敏感代码及其使用的数据不被系统上的任何其他内容监视或篡改。\nSGX安全和真实性保证的关键是它创建了所谓的Enclaves，即安全内存块。Enclave内容在离开处理器之前进行加密，并写入RAM。它们只有在返回后才会被解密。SGX的工作是保护Enclave内存，并阻止CPU可信部分以外的任何人访问其内容。\n周二的攻击并不是第一次击败新交所。2018年，另一组研究人员在一场名为Meltdown的攻击基础上打入了戒备森严的英特尔地区，这场攻击与一场名为Spectre的类似攻击一起，引发了处理器攻击的热潮。今年早些时候，另一组研究人员打破了新交所。\n英特尔通过引入微码更新缓解了早先的SGX漏洞。然而，这些缓解并没有持续多久，因为两次新的攻击促使英特尔再次争先恐后地设计新的防御措施。英特尔周二发布了新的更新，预计将在未来几周向最终用户开放。根据计算机的不同，修复程序可能会自动安装，也可能需要手动干预。用户，特别是那些依赖SGX的用户，应该与他们的机器制造商核实，并确保尽快安装更新。\n新的SGX攻击被称为SGAxe和串扰。这两种攻击都使用单独的旁路攻击进入设防的CPU区域，这是一类黑客攻击，通过测量时序差异、功耗、电磁辐射、声音或来自存储数据的系统的其他信息来推断敏感数据。这两起袭击的假设大致相同。攻击者已经通过破坏系统完整性的软件利用漏洞攻击或恶意虚拟机破坏了目标计算机的安全性。虽然这是一个很高的门槛，但这正是新交所应该防范的情况。\nSGAxe能够窃取攻击者选择的大量受SGX保护的数据。一类敏感数据是属于目标用户的数据-例如，钱包地址或涉及区块链的金融交易中使用的其他秘密。此段落正下方左侧的图片显示了存储在安全飞地中的图像文件。右侧的图像显示了使用SGAxe提取后的相同图像。\n这种攻击同样容易窃取SGX用来“证明”的密钥，也就是向远程服务器证明硬件是真正的英特尔处理器，而不是恶意模拟的过程。远程服务器在执行金融交易、播放受保护的视频或执行其他受限功能之前，可能要求连接设备提供这些证明密钥。在一篇题为“SGAxe：新交所如何在实践中失败”的论文中，来自密歇根大学和澳大利亚阿德莱德大学的研究人员写道：\n由于机器的生产证明密钥被泄露，客户端的不受信任的主机应用程序可以立即读取[该]服务器提供的任何机密，而所有据称由在客户端上运行的飞地生成的输出都无法信任其正确性。这有效地使基于SGX的DRM应用程序变得毫无用处，因为任何提供的秘密都可以很容易地恢复。最后，我们完全通过远程认证的能力也排除了信任任何基于SGX的安全远程计算协议的能力。", "note_en": "For the past two years, modern CPUs—particularly those made by Intel—have been under siege by an unending series of attacks that make it possible for highly skilled attackers to pluck passwords, encryption keys, and other secrets out of silicon-resident memory. On Tuesday, two separate academic teams disclosed two new and distinctive exploits that pierce Intel’s Software Guard eXtension, by far the most sensitive region of the company’s processors.\n Abbreviated as SGX, the protection is designed to provide a Fort Knox of sorts for the safekeeping of encryption keys and other sensitive data even when the operating system or a virtual machine running on top is badly and maliciously compromised. SGX works by creating trusted execution environments that protect sensitive code and the data it works with from monitoring or tampering by anything else on the system.\n Key to the security and authenticity assurances of SGX is its creation of what are called enclaves, or blocks of secure memory. Enclave contents are encrypted before they leave the processor and are written in RAM. They are decrypted only after they return. The job of SGX is to safeguard the enclave memory and block access to its contents by anything other than the trusted part of the CPU.\n  Tuesday’s attacks aren’t the first to defeat SGX. In 2018, a different team of researchers  broke into the fortified Intel region after building on an attack known as Meltdown, which, along with a similar attack known as Spectre,  ushered in the flurry of processor exploits. A different team of researchers  broke SGX earlier this year.\n Intel mitigated the earlier SGX vulnerability by introducing microcode updates. However, these mitigations did not last, as two new attacks have sent Intel scrambling anew to devise new defenses. Intel released the new updates on Tuesday and expects them to be available to end users in the coming weeks. Depending on the computer, the fix will either be installed automatically or will require manual intervention. Users, particularly those who rely on the SGX, should check with the manufacturer of their machine and ensure that the update is installed as soon as practical.\n The new SGX attacks are known as SGAxe and CrossTalk. Both break into the fortified CPU region using separate  side-channel attacks, a class of hack that infers sensitive data by measuring timing differences, power consumption, electromagnetic radiation, sound, or other information from the systems that store it. The assumptions for both attacks are roughly the same. An attacker has already broken the security of the target machine through a software exploit or a malicious virtual machine that compromises the integrity of the system. While that’s a tall bar, it’s precisely the scenario that SGX is supposed to defend against.\n  SGAxe is able to steal large chunks of SGX-protected data of an attacker’s choice. One class of sensitive data is that belonging to the target user—for instance, wallet addresses or other secrets used in financial transactions involving blockchains. The picture on the left immediately below this paragraph shows an image file that was stored in a secure enclave. The one on the right shows the same image after it was extracted using SGAxe.\n  The attack can just as easily steal cryptographic keys that SGX uses for “attestation,” or the process of proving to a remote server that the hardware is a genuine Intel processor and not a malicious simulation of one. A remote server can require connecting devices to provide these attestation keys before it will carry out financial transactions, play protected videos, or perform other restricted functions. In a paper titled  SGAxe: How SGX Fails in Practice, researchers from the University of Michigan and the University of Adelaide in Australia wrote:\n With the machine’s production attestation keys compromised, any secrets provided by [the] server are immediately readable by the client’s untrusted host application while all outputs allegedly produced by enclaves running on the client cannot be trusted for correctness. This effectively renders SGX-based DRM applications useless, as any provisioned secret can be trivially recovered. Finally, our ability to fully pass remote attestation also precludes the ability to trust any SGX-based secure remote computation protocols.", "posttime": "2020-06-10 04:07:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,安全,crypto,攻击", "title": "从超安全SGX掠夺密钥让英特尔再次陷入混乱", "title_en": "Plundering of crypto keys from ultrasecure SGX sends Intel scrambling again", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/06/new-exploits-plunder-crypto-keys-and-more-from-intels-ultrasecure-sgx/", "via": "", "real_tags": ["英特尔", "安全", "crypto", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "d329b6256b0e430e8fa74ba8e33f47c1.jpg", "infoid": 1005896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX的成就包括第一个进入轨道的私人资助的液体推进剂火箭(2008年的猎鹰1号)，第一个成功进入轨道的私人公司…", "note_en": "SpaceX's achievements include the first privately funded liquid-propellant rocket to reach orbit (Falcon 1 in 2008), the first private company to successfull...", "posttime": "2020-06-10 04:06:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,观众,私人", "title": "拥有36K直播观众的假SpaceX YouTube频道诈骗人们的钱", "title_en": "Fake SpaceX YouTube channel with 36k live viewers scams people out of money", "transed": 1, "url": "https://www.youtube.com/watch?v=tYMWg_gQCUQ", "via": "", "real_tags": ["youtube", "观众", "私人"]}, {"category": "", "categoryclass": "", "imagename": "04fbef47f36107bb18cd554f981d81a0.jpg", "infoid": 1005895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据华尔街日报最先报道，3M公司已经对亚马逊第三方卖家KMJ Trading Inc提起诉讼，据称该公司销售了价值超过35万美元的N95口罩。这些产品的标价高达每个面膜23美元-与1.27美元的标价相比，这是一个巨大的加价。\n自从新型冠状病毒爆发以来，亚马逊一直在与假冒口罩的销售作斗争，当时N95口罩成为基本工人的紧急必需品。亚马逊早在2月份就警告Marketplace卖家不要价格欺诈，最终在3月11日限制了面膜和洗手液的销售。KMJ被指控的价格欺诈发生在这些限制生效之前，从2月24日开始。\nKMJ本身使用多个账户进行销售，在三个不同的店面提供45种不同的产品。\n诉讼援引了一些客户对口罩的投诉，这些口罩似乎都贴上了欺骗性的标签，偶尔还存在缺陷。一份起诉书写道：“我认为这些是假的N95面具，卖家的价格是零售价的20倍。”“十包150美元的假N95口罩在这次流感大流行期间是歪歪扭扭的。”\n3M没有提高N95口罩的价格，美国的供应受到联邦紧急事务管理局的严格控制。这种高需求和有限供应的结合为价格欺诈创造了完美的条件，而KMJ远不是唯一家利用这种情况的公司。作为其申请的一部分，3M表示，它还提起了另外11起与假冒产品和大流行期间的价格欺诈有关的诉讼。\n记者联系到亚马逊请其置评，亚马逊对此表示赞赏，并强调其在Marketplace上的打假努力。该公司表示，自疫情爆发以来，已经从市场上撤下了50多万种与大流行相关的产品。\n亚马逊负责客户信任和合作伙伴支持的副总裁达梅什·梅塔(Dharesh Mehta)表示：“我们很自豪能与3M合作，追究这些坏人的责任。”“当我们发现一个坏演员违反了我们的政策时，我们会迅速移除产品，并对这个坏演员采取行动，就像我们在这里所做的那样，我们欢迎像3M这样的品牌的合作。”\n3M公司要求高达200万美元的法定赔偿金，并要求永久禁止被告销售3M公司标识的商品。\n起诉书写道：“被告向客户销售和交付假冒、损坏、缺陷或以其他方式改变的呼吸器，并进行价格欺诈，对3M的声誉造成了不可弥补的损害。”“对于这些伤害，法律上没有足够的补救措施。”", "note_en": "The 3M corporation has  filed suit against a third-party Amazon seller called KMJ Trading Inc, which allegedly sold more than $350,000 worth of N95 respirator masks,  as first reported by  The Wall Street Journal. The products were listed for as much as $23 per mask — a huge markup from the list price of $1.27.\n Amazon has struggled with counterfeit mask sales since the beginning of the novel coronavirus outbreak, when N95 masks became an urgent necessity for essential workers. Amazon warned Marketplace sellers against price gouging  as early as February, ultimately  restricting sales of both face masks and hand sanitizer on March 11th. KMJ’s alleged price-gouging took place before those restrictions went into effect, beginning on February 24th.\n KMJ itself used multiple accounts to make those sales, offering 45 different products across three different storefronts.\n  The lawsuit cites a number of customer complaints about the masks, which appear to have been both deceptively labeled and occasionally defective. “I think these are fake N95 Mask, and seller price gouged me 20 times the retail price,” one complaint reads. “Ten-pack of fake N95 mask for $150 is just crooked during this pandemic.”\n 3M hasn’t raised its price for N95 masks, and the US supply has been tightly controlled by the Federal Emergency Management Agency. That combination of high demand and restricted supply created the perfect conditions for price-gouging, and KMJ is far from the only company to take advantage of the situation. As part of its filing, 3M says it has filed eleven other lawsuits related to counterfeit products and price gouging during the pandemic.\n Reached for comment, Amazon applauded the lawsuit and emphasized its anti-counterfeiting efforts on Marketplace. The company says it has removed more than 500,000 pandemic-related products from the marketplace since the outbreak began.\n “We’re proud to be working with 3M to hold these bad actors accountable,” said Dharmesh Mehta, Amazon’s VP in charge of customer trust and partner support. “When we find a bad actor violating our policies, we work quickly to remove the products and take action on the bad actor, as we’ve done here, and we welcome collaboration from brands like 3M.”\n 3M has asked for statutory damages as high as $2 million dollars and a permanent injunction against the defendants from selling goods identified with 3M.\n “By selling and delivering to customers counterfeit, damaged, deficient, or otherwise altered respirators and engaging in price-gouging, Defendants caused irreparable damage to 3M’s reputation,” the complaint reads. “There is no adequate remedy at law for these injuries.”", "posttime": "2020-06-10 04:06:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,出售,销售", "title": "3M起诉亚马逊店面涉嫌以每只23美元的价格出售假冒N95口罩", "title_en": "3M sues Amazon storefront that allegedly sold fake N95 masks for $23 apiece", "transed": 1, "url": "https://www.theverge.com/2020/6/9/21285364/amazon-marketplace-mask-price-gouging-n95-3m-ppe", "via": "", "real_tags": ["亚马逊", "amazon", "出售", "销售"]}, {"category": "", "categoryclass": "", "imagename": "cc79ee735e55faba4292183889f5f523.jpg", "infoid": 1005894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "明尼阿波利斯议员在承诺解散警察局方面迈出了引人注目的一步。其他城市正在听从减少警力资源的要求。", "note_en": "Minneapolis councilmembers took a remarkable step in pledging to disband its police department. Other cities are heeding demands to reduce police resources.", "posttime": "2020-06-10 03:49:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "取消,calls,承诺", "title": "呼吁取消对警察的资助的城市", "title_en": "The Cities Taking Up Calls to Defund the Police", "transed": 1, "url": "https://www.citylab.com/equity/2020/06/defund-police-city-council-budget-divest-public-resources/612694/", "via": "", "real_tags": ["取消", "calls", "承诺"]}, {"category": "", "categoryclass": "", "imagename": "ffc140560094c980c210c1d8c4090027.jpg", "infoid": 1005893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山-据了解情况的员工透露，特斯拉(Tesla)首席执行官埃隆·马斯克(Elon Musk)违抗地重新开放了该公司位于弗里蒙特的主要生产设施，特斯拉在加州的员工上个月检测出这种新型冠状病毒呈阳性。\n两名员工因担心遭到报复而要求匿名，他们告诉华盛顿邮报，主管与他们的团队举行会议，披露公司报告了几起冠状病毒病例，受影响的员工被告知待在家里。其中一名工人说，一名主管向弗里蒙特座椅组装厂的一个小组确认了两例阳性病例。座椅组装厂位于佩奇大道901号，距离主要生产工厂只有很短的车程。\n特斯拉和阿拉米达县在5月份达成了一项协议，允许该公司在坚持严格的社会距离并采取额外预防措施的情况下恢复生产，以避免让工人接触到这种疾病。例如，这家工厂雇佣了大约1万名工人，他们分散在多个班次中，现在被要求戴口罩，并限制在休息室与其他人接触，同时在与重型机械合作生产电动汽车时，彼此之间保持充足的空间。\n作为允许特斯拉在5月18日重新开业的协议的一部分，特斯拉必须向阿拉米达县公共卫生部报告所有阳性病例。但该县官员称，由于特斯拉在一周前重启生产，可能会有从未上报到该县的案例，因为在协议达成前，特斯拉“没有被要求直接报告已知的案例”。\n县发言人尼图·巴拉姆(Neetu Balram)在一封电子邮件中说，目前还没有已知的与特斯拉有关的县居民与工作场所相关的感染。她补充说，在前一周，“如果一个人检测呈阳性，而且他们不是阿拉米达县的居民，我们可能不会向我们报告这个病例。”\n在重新开放以及随后的冠状病毒病例之前，公共卫生秩序持续了数周的紧张局势。马斯克第一次违抗规定是在3月份，在当地官员宣布特斯拉的汽车生产不是必要的，必须停止之前，他保持了工厂的运营。今年4月，马斯克在Twitter上发帖称“现在就自由美国”，然后在公司的季度财报电话会议上发表了亵渎神明的咆哮，称隔离措施是“法西斯主义”，就在他表达了对停产对公司财务影响的担忧之后。5月初，特斯拉就这一订单起诉了该县，马斯克威胁要接手这家总部位于加利福尼亚州帕洛阿尔托的公司，并将其迁往德克萨斯州或内华达州。随后，他公开违抗命令，开设了工厂，敢于让官员逮捕他，最终赢得了特朗普总统的支持。\n这名工人在与特斯拉主要工厂分开的大楼里说，受影响的人包括一名特斯拉早班员工和另一名晚班员工。这名工人对生产线上明显的不谨慎表示担忧。\n特斯拉没有立即回复记者的置评请求。给特斯拉负责环境、健康和安全的副总裁劳里·谢尔比(Laurie Shelby)的信息没有得到回复。在接受电话采访时，特斯拉公司医生詹姆斯·克雷纳(James Craner)拒绝对这篇报道发表评论。\n一些工人描述了围绕重启生产的不确定和恐惧环境，指出他们生产线上的一些人可能会在没有解释的情况下消失两周-这可能是对任何出现症状的人采取极端预防措施的结果。\n“打卡到/打卡时完全没有社交距离[因为]人是…。急于回家或回到他们的工作岗位，“座椅组装厂的个人在一条短信中说。至于社交距离，这位员工说，管理层“不会对同事说任何话，因为他们也不会这么做。”\n至于这些变化：“除了戴上面具，什么都不像，”这名工人说。\n这名工人说，三名因潜在接触而被隔离的人已经重返工作岗位，但那些检测呈阳性的人还没有回到队伍中。", "note_en": "SAN FRANCISCO — Tesla workers in California tested positive last month for the novel  coronavirus following chief executive Elon Musk’s  defiant reopening of the company’s main production facility in Fremont, according to employees with knowledge of the situation.\n Two workers, who spoke on the condition of anonymity because of fear of retaliation, told The Washington Post that supervisors held meetings with their teams to disclose the company had reported several cases of the coronavirus, and the employees affected were told to stay home. One of the workers said a supervisor confirmed two positive cases to a group at the Fremont-based seat assembly facility, which is at 901 Page Ave., a  short drive from the main production plant.\n Tesla and Alameda County  came to an agreement in May allowing the company to restart production if it adhered to strict social distancing and took extra precautions to avoid exposing workers to the illness. The plant employs about 10,000 workers, who are spread out among multiple shifts and are now required to wear masks and limit contact with others in break rooms, for example, while keeping ample space between one another as they work with heavy machinery to produce electric cars.\n   As part of the agreement struck allowing Tesla to reopen on May 18, Tesla would have to report all positive cases to the Alameda County Public Health Department. But because Tesla restarted production a week earlier, there could have been cases that were never reported to the county because Tesla was “not required to directly report known cases” before the agreement, county officials said.\n There were no known workplace-related infections of county residents associated with Tesla, said county spokeswoman Neetu Balram in an email. During the prior week “if a person tested positive and they were not a resident of Alameda County, it’s possible we would not have that case reported to us,” she added.\n  The reopening, and subsequent coronavirus cases, follow weeks of tension over the public health order. Musk  first defied the rules in March by keeping the plant open before local officials declared Tesla’s vehicle production was not essential and must come to a halt. Musk  tweeted “FREE AMERICA NOW” in April before  launching into a profane rant on the company’s quarterly earnings call, calling quarantine measures “fascist” just after he expressed concern over the production halt’s impact on the company’s finances. In early May, Tesla  sued the county over the order, and Musk threatened to pick up and move the Palo Alto, Calif.-based company to Texas or Nevada. He followed that up by  publicly defying the order and opening the plant, daring officials to arrest him and eventually winning the support of President Trump.\n   The worker, in the separate building from Tesla’s main plant, said those affected included one from Tesla’s morning shift and another from its evening shift. The worker expressed concern over a perceived lack of caution on the production line.\n Tesla did not immediately respond to a request for comment. A message for Laurie Shelby, vice president of environment, health and safety at Tesla, went unreturned. Reached by phone, Tesla corporate physician James Craner declined to comment for this story.\n  Some workers described an environment of uncertainty and fear around the restart of production, noting how some on their production lines might disappear for two weeks without explanation — a likely effect of extreme precautions being taken for anyone who develops symptoms.\n  “No social distancing at all when clocking in/out [because] people are … in a hurry to go home or get back to their work station,” the individual in the seat assembly plant said in a text message. As far as social distancing, the worker said, management “don’t say anything to the associates [because] they’re not doing it either.”\n  As for the changes: “It’s like nothing but with a mask on,” the worker said.\n The worker said three people who had been quarantined because of potential exposure had returned to work, but those who tested positive haven’t returned to the line.", "posttime": "2020-06-10 03:49:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,特斯拉,tesla", "title": "弗里蒙特特斯拉工人在工厂重新开工几天后被检测出冠状病毒呈阳性", "title_en": "Fremont Tesla workers tested positive for coronavirus days after plant reopened", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/06/09/tesla-factory-coronavirus/", "via": "", "real_tags": ["病毒", "冠状病毒", "特斯拉", "tesla"]}, {"category": "", "categoryclass": "", "imagename": "9edb4d6da2d969c6c9549c6b737ac8ff.jpeg", "infoid": 1005892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在家工作会让人觉得经理对员工的直接监督较少。但一款始终在线的视频会议工具改变了这一点，它每隔几分钟就会自动拍摄员工的网络摄像头照片。\n最近几周，世界各地的公司被迫放弃办公室，转而在家工作，以试图减缓冠状病毒的传播。仅在美国，冠状病毒就已导致3.9万多人患病。\n为了在远程工作的同时保持高生产率，一些公司正在转向像Snek这样的工具。这款软件为每个办公室设置了一面标价为34；英镑的面孔墙，整个工作日都在使用，每隔一到五分钟就会更新一次员工通过笔记本相机拍摄的照片。\nSnek的联合创始人德尔·柯里告诉“商业内幕”(Business Insider)，Snek的用户群在最近几周迅速扩大，因为公司都是从家里过渡到工作的，在过去的几周里，注册人数增加了10倍。它拥有超过1万名用户，并号称拥有包括弗雷德·佩里(Fred Perry)和GoFish Digital在内的客户。\n该软件的界面允许人们将他们的网络摄像头设置为每隔一分钟或五分钟自动拍摄一次，这取决于他们希望自己的图像更新的频率(或者他们的老板要求更新的频率)。\n如果同事点击他们的脸，Snek的默认设置会在实时视频通话中立即将两个员工连接起来，即使收件人没有单击“接受”。然而，如果雇主允许，人们也可以将他们的设置配置为只手动接听电话，并且只手动拍摄网络摄像头照片。\n柯里在接受“商业内幕”采访时表示，虽然有些人可能会对该软件的界面感到厌烦，但它意在打造一种互联办公的活力。\nSnek从来没有设计用来监视任何人，考虑到我们给自己的应用程序取名为Snek，柯里说，我们将成为有史以来最糟糕的间谍公司。我们知道很多人会觉得这是对隐私的侵犯，我们百分之百理解这一点，这对那些人来说不是解决办法，但也有很多团队是好朋友，他们希望在一起工作时保持联系。(#34；我们知道这一点我们百分之百理解，但对于那些人来说，这并不是解决问题的办法，但也有很多团队是好朋友，当他们在一起工作时，他们希望保持联系。)\n上周“信息报”的Priya Anand报道了斯奈克的界面后，一些界面被工作场所的监控工具关闭了。开发公司Basecamp的首席技术官兼联合创始人大卫·海内迈尔·汉森(David Heinemeier Hansson)在推特上表示，这个想法让我毛骨悚然。\n柯里承认，在“信息报”的报道发表后，该公司上周确实在Twitter上获得了一些知名度。柯里说，Snek的灵感部分来自于汉森与人合著的一本关于远程工作的书，但现在公司收到了汉森的追随者发来的辱骂我们员工的信息，称我们为标准。\n他说：我们在家工作已经10多年了，开始悄悄出现的最大问题之一就是孤立感，它确实会影响人们的心理健康。仅仅是有这种能力抬头看到你的队友就能让一切变得不同。", "note_en": "Working from home can make it feel like managers have less direct supervision over workers. But an always-on video-conference tool changes that by automatically snapping webcam pictures of employees every few minutes.\n Companies across the world have been forced to abandon offices in favor of working from home in recent weeks to try to slow the spread of coronavirus, which has sickened  more than 39,000 people in the US alone.\n In order to keep productivity high while working remotely, some companies are turning to tools like  Sneek. The software features a &#34;wall of faces&#34; for each office, which stays on throughout the workday and features constantly-updating photos of workers taken through their laptop camera every one to five minutes.\n  Sneek&#39;s user base has rapidly expanded in recent weeks as companies transition en masse to work-from home — signups have increased tenfold in in the past few weeks, cofounder Del Currie told Business Insider. It has over 10,000 users and  boasts clients including Fred Perry and GoFish digital.\n   The software&#39;s interface lets people set their webcam to automatically photograph them every one or five minutes, depending on how frequently they want their image to update (or how frequently their boss requires it).\n If a coworker clicks on their face, Sneek&#39;s default settings will instantly connect the two workers in a live video call, even if the recipient hasn&#39;t clicked &#34;accept.&#34; However, people can also configure their settings to only accept calls manually — and only take webcam photos manually — if their employer allows it.\n Currie told Business Insider that, while some may be put off by the software&#39;s interface, it&#39;s meant to build a connected office dynamic.\n &#34;Sneek was never designed to spy on anyone, we&#39;d be the worst spy company ever considering we named our app &#39;Sneek,&#39;&#34; Currie said. &#34;We know lots of people will find it an invasion of privacy, we 100% get that, and it&#39;s not the solution for those folks, but there&#39;s also lots of teams out there who are good friends and want to stay connected when they&#39;re working together.&#34;\n   After Sneek&#39;s interface was reported by  The Information&#39;s Priya Anand last week, some were turned off by the workplace surveillance tool. David Heinemeier Hansson, CTO and cofounder of the development firm Basecamp,  tweeted that the idea &#34;makes my skin crawl.&#34;\n  Currie acknowledged that the company &#34;did indeed get some Twitter fame last week&#34; after The Information story was published. Sneek was inspired in part by a  book on remote work that Hansson co-authored, Currie said, but now the company has received messages from Hansson&#39;s followers &#34;abusing our staff and calling us pieces of s—.&#34;\n  &#34;We&#39;ve worked from home for 10+ years and one of the biggest things that starts to creep in is that sense of isolation, it does really affect people&#39;s mental health,&#34; he said. &#34;Just having that ability to look up and see your teammates there can make all the difference.&#34;", "posttime": "2020-06-10 03:48:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webcams", "title": "公司正在使用网络摄像头来监控在家工作的员工。", "title_en": "Companies are using webcams to monitor employees working from home", "transed": 1, "url": "https://www.businessinsider.com/work-from-home-sneek-webcam-picture-5-minutes-monitor-video-2020-3", "via": "", "real_tags": ["webcams"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对不起，这一次来晚了！最近我经历了一段艰难的时期，我认为这对每个人来说都是很正常的。但我现在好多了，希望.", "note_en": "Sorry this one is late! I've been having a rough time lately, which I think is pretty normal right now for everyone. But I'm doing a bit better now and hope...", "posttime": "2020-06-10 03:13:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,程序员,fault,时期", "title": "缺陷不是程序员的错", "title_en": "Defects are not the fault of programmers", "transed": 1, "url": "https://buttondown.email/hillelwayne/archive/defects-are-not-the-fault-of-programmers/", "via": "", "real_tags": ["程序", "程序员", "fault", "时期"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "iPhone和iPad用户现在可以使用物理设备进行本地身份验证。\niPhone支持物理安全密钥已经有一段时间了，但今天的一次新更新为谷歌自己的iOS应用程序带来了NFC和更新的技术支持。\n据AppleInsider报道，谷歌已经更新了其应用程序和网站，以支持最新的W3C WebAuthn实现的双因素身份验证。\n谷歌已经更新了其应用程序和网站，以支持最新的W3C WebAuthn实现的双因素身份验证，自去年12月以来，iOS一直在原生支持这种身份验证。更新后，用户可以使用物理密钥和最新的技术来验证登录到他们的谷歌账户。\n用户现在可以使用物理设备在iPhone和iPad上使用谷歌应用程序和服务进行本地身份验证。以前，用户需要在设备上安装谷歌智能锁应用程序后才能使用谷歌的Titan Key。\n随着谷歌的更新，你现在可以利用这些设备中的任何一种，包括为Lightning端口设计的设备，对你的iPhone或iPad的登录进行本机认证。像Lightning to USB Camera Adapter这样的适配器允许密钥在没有正确端口的设备上工作。此前，谷歌的服务只能使用它自己的基于蓝牙的泰坦钥匙，该钥匙只与安装了谷歌智能锁应用程序的设备兼容。\n苹果从去年12月开始在iOS上支持最新的用于双因素身份验证的W3C WebAuthn实现。\n乔·维托切克(Joe Wituschek)已经在科技行业工作了十多年。乔以前是苹果公司的记者，现在作为iMore的新闻撰稿人报道该公司。通过Twitter@joewituschek与乔联系。", "note_en": "iPhone and iPad users will now be able to use physical devices to natively authenticate.\n The iPhone has supported physical security keys for a while now, but a new update today brings NFC and newer technology support to Google&#39;s own apps on iOS.\n Reported by  AppleInsider, Google has updated its apps and websites to work with the latest W3C WebAuthn implementation for two-factor authentication.\n &#34;Google has updated its apps and sites to support the latest W3C WebAuthn implementation for two-factor authentication, which has been supported natively by iOS since December. Following the update, users can utilize physical keys with the latest technologies to authenticate logins to their Google account.&#34;\n Users will now be able to use physical devices to natively authenticate with Google apps and services on the iPhone and iPad. Before, users were required to use Google&#39;s Titan key with the Google Smart Lock app installed on their device.\n &#34;With Google&#39;s update, you can now utilize any of those devices, including ones made for Lightning ports, to natively authenticate logins on your iPhone or iPad. Adapters like the Lightning to USB Camera Adapter allow keys to work on devices without the proper ports as well. Previously, Google&#39;s services only worked with its own Bluetooth-based Titan key, which was only compatible with devices that had the Google Smart Lock app installed.&#34;\n Apple has supported the newest W3C WebAuthn implementation for two-factor authentication on iOS since December of last year.\n   Joe Wituschek has been in the technology industry for over a decade. Formerly Apple, Joe now covers the company as a news writer for iMore. Connect with Joe on Twitter @joewituschek.", "posttime": "2020-06-10 03:13:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,iphone,google,升级,upgrades", "title": "谷歌升级iPhone和iPad物理认证技术", "title_en": "Google upgrades physical authentication technology for iPhone and iPad", "transed": 1, "url": "https://www.imore.com/google-upgrades-physical-authentication-technology-iphone-and-ipad", "via": "", "real_tags": ["谷歌", "iphone", "google", "升级", "upgrades"]}, {"category": "", "categoryclass": "", "imagename": "a5b29c0dbb1f422f64bf6b92fb7a884e.jpeg", "infoid": 1005887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿(路透社)-美国联邦通信委员会(FCC)周二一致投票，提议对德克萨斯州的医疗保险电话推销员处以创纪录的2.25亿美元罚款，原因是他们涉嫌打了大约10亿个非法欺骗的机器人电话。\n该命令用商业名称命名了两个人，包括瑞星之鹰和Jsquared Telecom。FCC表示，机器人电话谎称提供安泰(Aetna)、蓝十字蓝盾(Blue Cross Blue Shield)、信诺(Cigna)和联合健康集团(UnitedHealth Group)等主要医疗保险公司的医疗保险计划。\nFCC专员杰西卡·罗森沃塞尔(Jessica Rosenworcel)周二晚些时候表示，一群州总检察长将向美国地区法院提起诉讼。记者无法立即联系到这些公司置评。", "note_en": "WASHINGTON (Reuters) - The Federal Communications Commission (FCC) on Tuesday voted unanimously to propose a record-setting $225 million fine against Texas-based health insurance telemarketers for allegedly making approximately 1 billion illegally spoofed robocalls.\n The order names two individuals using business names including Rising Eagle and JSquared Telecom. The FCC said robocalls falsely claimed to offer health insurance plans from major health insurance companies such as Aetna, Blue Cross Blue Shield, Cigna, and UnitedHealth Group.\n FCC Commissioner Jessica Rosenworcel said later on Tuesday a group of state attorneys general is going to file action against the companies in U.S. District Court. The companies could not immediately be reached for comment.", "posttime": "2020-06-10 02:57:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "提出,proposes,医疗保险", "title": "FCC提出创纪录的2.25亿美元罚款用于大规模的Robocall活动", "title_en": "FCC Proposes Record $225 Million Fine For Massive Robocall Campaign", "transed": 1, "url": "https://www.reuters.com/article/us-usa-robocalls/fcc-proposes-record-225-million-fine-for-massive-robocall-campaign-idUSKBN23G2HF", "via": "", "real_tags": ["提出", "proposes", "医疗保险"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：转译器，也称为源代码到源代码翻译器，是一种将源代码从高级编程语言(如C++或Python)转换为另一种语言的系统。转译器主要用于互操作性，并将用过时或不推荐使用的语言(例如COBOL、Python2)编写的代码库移植到现代语言。它们通常依赖于应用于源代码抽象语法树的手工编写的重写规则。不幸的是，由此产生的翻译往往缺乏可读性，不尊重目标语言的创新，需要人工修改才能正常工作。整个翻译过程是耗时的，需要源语言和目标语言的专业知识，这使得代码翻译项目成本高昂，尽管神经模型在自然语言翻译中的表现明显优于基于规则的模型，但由于该领域并行数据的稀缺，它们在转译方面的应用受到了限制。在这篇文章中，我们建议利用无监督机器翻译的最新方法来训练一个完全无监督的神经转译器。我们在开源GitHub项目的源代码上测试了我们的模型，结果表明该模型可以高精度地在C++、Java和Python之间转换函数，该方法完全依赖于单语言源代码，不需要源语言和目标语言的专业知识，并且可以很容易地推广到其他编程语言。我们还构建并发布了由852个并行函数组成的测试集，以及用于检查翻译正确性的单元测试。我们表明，我们的模型比基于规则的商业基线有很大的优势。", "note_en": "Download PDF  Abstract: A transcompiler, also known as source-to-source translator, is a system thatconverts source code from a high-level programming language (such as C++ orPython) to another. Transcompilers are primarily used for interoperability, andto port codebases written in an obsolete or deprecated language (e.g. COBOL,Python 2) to a modern one. They typically rely on handcrafted rewrite rules,applied to the source code abstract syntax tree. Unfortunately, the resultingtranslations often lack readability, fail to respect the target languageconventions, and require manual modifications in order to work properly. Theoverall translation process is timeconsuming and requires expertise in both thesource and target languages, making code-translation projects expensive.Although neural models significantly outperform their rule-based counterpartsin the context of natural language translation, their applications totranscompilation have been limited due to the scarcity of parallel data in thisdomain. In this paper, we propose to leverage recent approaches in unsupervisedmachine translation to train a fully unsupervised neural transcompiler. Wetrain our model on source code from open source GitHub projects, and show thatit can translate functions between C++, Java, and Python with high accuracy.Our method relies exclusively on monolingual source code, requires no expertisein the source or target languages, and can easily be generalized to otherprogramming languages. We also build and release a test set composed of 852parallel functions, along with unit tests to check the correctness oftranslations. We show that our model outperforms rule-based commercialbaselines by a significant margin.", "posttime": "2020-06-10 02:55:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,翻译,translation", "title": "编程语言的无监督翻译[pdf]", "title_en": "Unsupervised Translation of Programming Languages [pdf]", "transed": 1, "url": "https://arxiv.org/abs/2006.03511", "via": "", "real_tags": ["编程", "翻译"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州弗里蒙特。(克朗)-据华盛顿邮报报道，在冠状病毒大流行中，特斯拉的弗里蒙特工厂重新开工几天后，几名员工的病毒检测呈阳性。\n其中两名检测呈阳性的人在工厂的组装工厂工作，该工厂位于弗里蒙特工厂附近。\n5月18日，特斯拉首席执行官埃隆·马斯克(Elon Musk)公开无视阿拉米达县的健康命令，告诉他的工人们回去工作，尽管该县至少在6月第一周之前都不允许这样做，工厂随后重新开工。\n虽然特斯拉工厂重新开业，但并不是每个人都很高兴，因为一些员工表示，他们担心自己的安全。\n加利福尼亚州州长加文·纽瑟姆(Gavin Newsom)声称，特斯拉没有得到特殊待遇，他说，正是阿拉米达县政府和特斯拉之间的“妥协精神”使得重新开放成为可能。\n版权所有2020 Nexstar广播公司。版权所有。这些材料不得出版、广播、重写或重新分发。", "note_en": "FREMONT, Calif. (KRON) – Days after Tesla’s Fremont factory reopened amid the  coronavirus pandemic, several employees tested positive for the virus, the Washington Post  reports.\n Two of those who tested positive worked in the plant’s assembly facility, which is located near the Fremont factory.\n  The  factory reopened May 18 after Tesla CEO Elon Musk openly defied Alameda County’s health orders by telling his workers to get  back to work, despite not being allowed by the county do that at least until the first week of June.\n  While  Tesla is back open, not everyone is happy, as some employees say they’re scared for their safety.\n California Governor Gavin Newsom claims Tesla did not get special treatment, saying it was a “spirit of compromise” between  Alameda County and Tesla that made the reopening possible.\n  Copyright 2020 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "posttime": "2020-06-10 02:38:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,特斯拉,tesla", "title": "弗里蒙特特斯拉工人在工厂重新开工几天后被检测出冠状病毒呈阳性", "title_en": "Fremont Tesla workers tested positive for coronavirus days after plant reopened", "transed": 1, "url": "https://www.kron4.com/news/bay-area/fremont-tesla-workers-tested-positive-for-coronavirus-days-after-plant-reopened-report/", "via": "", "real_tags": ["病毒", "冠状病毒", "特斯拉", "tesla"]}]