[{"category": "", "categoryclass": "", "imagename": "6dfeeeb7ac5df91139be2bd12cd71e2b.jpg", "infoid": 1008583, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在是晚上11点37分，图案没有变化的迹象。凌晨1点12分，差不多了。拇指向下，拇指向上。推特，Instagram，如果你觉得特别紧张/受虐狂，还有Facebook。自从3月初新冠肺炎疫情让很多人被锁在家里以来，晚间的仪式一直在编纂：每天晚上都会像白天开始的那样结束，没完没了地滚动社交媒体，不顾一切地寻找真相。\n对于那些已经成为这种反常运动的提供者，比如《纽约时报》(New York Times)的凯文·鲁斯(Kevin Roose)来说，这种习惯被称为末日冲浪，也就是“掉进充满冠状病毒内容的深而病态的兔子洞里，让自己激动到身体不适的地步，抹去了睡个好觉的任何希望。”对于那些希望绝望随身携带的人来说，这个词正在走向厄运，随着乔治·弗洛伊德去世后针对种族不公正和警察暴行的抗议活动加入到新冠肺炎危机的新闻周期中，它只会变得更加激烈。源源不断的新闻和社交媒体永远不会结束。\n当然，深夜卷轴并不是什么新鲜事-这是治疗师经常听到的一对夫妇说其中一方没有提供足够关注的事情。但过去，周日晚上人们都在床上翻推特(Twitter)，看“权力的游戏”(Game Of Thrones)的热门剧集，或者是扶手椅上的四分卫来支持当天的游戏。现在，唯一值得关注的是世界陷入危机。冠状病毒死亡(全球47.3万人，而且还在增加)，失业率(美国约13%)，任何一天都有抗议者走上街头为种族正义游行(无数数千人)-数据的水龙头不停地流着。有无限的季节，一些答案的承诺，甚至可能是一些好消息，总是让人感觉只需点击一下即可。\n但事实并非如此。现在，人们生活在一个没有简单解决方案的时代，在一个瞬息万变的环境中，存在着许多相互冲突的“事实”。据在密歇根大学信息学院研究传播和社交媒体的妮可·埃里森(Nicole Ellison)称，这意味着“要理解这一点，需要大量的认知处理。”没有什么重要的叙述能帮助我们。“。她补充说，这只会加剧他们已经感受到的压力和焦虑。\n多年来，人们一直质疑Twitter和Facebook等平台的净效益，虽然一些研究发现，当负责任地使用社交媒体时，可以对心理健康产生积极影响，但它也可能导致焦虑和抑郁。或者，至少是“信息自由法”(FOMO)。这只是看了太多早午餐照片或名人八卦链接的结果。再加上全球大流行和国内动乱-社交媒体网络有可能受到激励，将热门话题推入你的信息源-问题就会加剧。“在这种情况下，我们会采取这些更狭隘、更直接的以生存为导向的行为。埃里森说：“我们正处于”要么战斗，要么逃跑“的模式中。“再加上这样一个事实，即在社交方面，我们中的许多人并没有去工作，而是站在咖啡机旁进行集体意义的创造，结果是我们没有很多这样的社会资源可供我们以同样的方式获得。”\n嘿，你在看末日卷轴吗？今天几乎是星期一。这个周末发生了很多大事，有好的也有坏的。别忘了照顾好你自己和你的心理健康。休息仍然很重要。睡好。\n-Karen K.Ho(@karenkho)2020年6月15日。\n每段婚姻都有一个人在咖啡前大声滚动和朗读标题，另一个人恳求他们停止。\n-安娜亲吻爱丽丝(@Ally_Anna)2020年6月16日。\n然而，厄运和悲观并不全是媒体的错。哈佛大学公共卫生学院李锦祥健康与幸福中心的研究科学家Mesfin Bekalu指出，虽然很多消息都是坏消息，但“作为人类，我们有一种‘自然’的倾向，会更多地关注负面消息。”这一点，加上社交媒体算法，使得末日滚动及其影响几乎不可避免。贝卡鲁说：“自20世纪70年代以来，由于长期接触电视上与暴力有关的内容，我们就知道了‘卑鄙的世界综合症’-认为世界比实际情况更危险。”“因此，除非我们采取针对用户行为的干预措施，并以改善心理健康和福祉的方式指导社交媒体平台的设计，否则末日滚动可能会对心理健康产生同样的长期影响。”\n末日滚动的效果也会因操作人员的不同而有所不同。南加州大学安纳伯格传播与新闻学院(Annenberg School Of Communication And Journism)教授艾丽莎·理查森(Allissa Richardson)指出，当她为自己的新书“见证黑人：非裔美国人、智能手机和新的抗议#新闻主义”进行研究时，她与许多没有参与末日滚动的活动人士交谈，原因很简单，他们说，“我不能想象自己在手机上的这个小广场上被一次又一次地杀害。”她指出，能够参与并选择退出过度使用社交媒体是一种特权，这就是为什么当谈到社交媒体时，许多黑人用户会在Instagram Live和其他形式的黑人快乐上转向Verzuz的战斗，作为一种抵制行为。理查森说：“为黑人进行末日滚动的做法与之相反，我们实际上是在努力寻找一些不同的东西，而不是不好的东西。”“对于许多非黑人美国人来说，这是一个令人难以置信的丰富时期，对他们来说，末日滚动是对那些他们可能一开始没有受过良好教育，或者可能确实略知一二但被忽视了的事情的深入研究。”\n为此，不断点击也有一些好处。社交媒体正在帮助人们在封锁期间保持联系，随着话题从新冠肺炎转向种族正义和黑人生命也是运动，它已经成为一种积极参与的工具-传播关于抗议、保释资金和社区资源的新闻-而不仅仅是一个被动消费疫情最新消息的论坛。然而，深夜的挖掘，对坏消息的无休止的阅读，让人精疲力竭。(理查森指出，这也可能危及抗议者，他们的身份在其他人的推送中四处传播。)。这是一种近几个月来愈演愈烈的强迫症，也表明当许多机制被剥离时，人类仍在寻找应对机制。\n因此，末日滚动仍在继续。这个词的实际来源有点含糊，尽管许多人指出这条2018年10月的推文可能是它的祖先。最近，“末日滚动”被指定为“韦氏词典”我们正在观看的词汇之一，而Dictionary.com则将其命名为“因为冠状病毒而创造的新词”之一。\n不过，词源里还有别的东西。尤其是末日这个词。最初，这个词有与审判日和世界末日相关的含义，但现在它同样可能与毁灭或毁灭联系在一起。那么，末日滚动的行为就是走向毁灭。或者，借用琼·迪迪恩(Joan Didion)的一句话(写于美国最后一个创伤性的、定义了一代人的年份，1968年)，这是一种无精打采的行为。从圣经的角度来看，它有一种启示性的基调。每一次扫过时间线都标志着一天计算的结束-对整个世界的状态，以及对每个附件上进行滚动的人的计算。同时，每个人都看着如此之多的死亡，同时也在慢慢地摧毁自己。(这种仓促的判断也可以解释为什么现在有这么多公众人物面临取消。)。狄迪翁从W.B.叶芝的诗“第二次降临”中摘录了“无精打采地走向伯利恒”，这首诗本身反映了1918年流感大流行期间第一次世界大战造成的破坏。世界的滚动反映了那些作家虚构的启示录，这是很自然的。\n同时，它也不必如此。末日滚动实际上永远不会阻止厄运本身。有见识的感觉可能是一种慰藉，但被悲剧压倒是没有意义的。如果不是马拉松，今年什么都不是；试图冲刺到食物的尽头只会导致精疲力竭，并导致最需要冷静的人的心理健康状况下降。这就是说你，亲爱的读者。在过去的六个月里，在所有的痛苦、孤立和破坏中，每晚过度使用两个小时的Twitter来增加压力是不值得的。也许现在只是需要结束Ti", "note_en": "It&#39;s 11:37pm and the pattern shows no signs of shifting. At 1:12am, it’s more of the same. Thumb down, thumb up.  Twitter,  Instagram, and—if you’re feeling particularly wrought/masochistic— Facebook. Ever since the  COVID-19 pandemic left a great many people locked down in their homes in early March, the evening ritual has been codifying: Each night ends the way the day began, with an endless scroll through social media in a desperate search for clarity.\n To those who have become purveyors of the perverse exercise, like  The New York Times’ Kevin Roose, this habit has become known as  doomsurfing, or “falling into deep, morbid rabbit holes filled with coronavirus content, agitating myself to the point of physical discomfort, erasing any hope of a good night’s sleep.” For those who prefer their despair be portable, the term is  doomscrolling, and as  protests over racial injustice and police brutality following the death of George Floyd have joined the COVID-19 crisis in the news cycle, it’s only gotten more intense. The constant stream of news and social media never ends.\n Of course, a late-night scroll is nothing new—it’s the kind of thing therapists often hear about when couples say one or the other isn’t providing enough attention. But it used to be that Sunday nights in bed were spent digging through Twitter for  Game of Thrones hot takes, or armchair quarterbacking the day’s game. Now, the only thing to binge-watch is the world&#39;s collapse into crisis. Coronavirus deaths (473,000 worldwide and counting), unemployment rates (around 13 percent in the US), protesters in the street on any given day marching for racial justice (countless thousands)—the faucet of data runs nonstop. There are unlimited seasons, and the promise of some answer, or perhaps even some good news, always feels one click away.\n But it’s not. Right now, people are living at a time with no easy solutions, a moment with a lot of conflicting “facts” in a rapidly changing landscape. According to Nicole Ellison, who studies communication and social media at the University of Michigan’s School of Information, that means there&#39;s a “lot of demand on cognitive processing to make sense of this. There’s no overarching narrative that helps us.” That, she adds, only compounds the stress and anxiety they&#39;re already feeling.\n For years, people have questioned the net benefits of platforms like Twitter and Facebook, and while some studies have  found social media, when used responsibly, can have positive effects on mental health, it can also lead to  anxiety and  depression. Or, at the bare minimum, FOMO. And that’s just the result of looking at too many brunch photos or links to celebrity gossip. Add in a global pandemic and civil unrest—and the possibility that social media networks are incentivized to push trending topics into your feeds—and the problem intensifies. “In a situation like that, we engage in these more narrow, immediate survival-oriented behaviors. We’re in fight-or-flight mode,” Ellison says. “Combine that with the fact that, socially, many of us are not going into work and standing around the coffee maker engaging in collective sense-making, and the result is we don’t have a lot of those social resources available to us in the same way.”\n hey, are you doomscrolling?  It&#39;s almost Monday. Lots of big things happened this weekend, good and bad. Don&#39;t forget to take care of yourself and your mental health. Rest is still important. Sleep well.\n— Karen K. Ho (@karenkho)  June 15, 2020\n Every marriage has one person who doom scrolls and reads headlines out loud pre-coffee, and another person who is begging them to stop\n— Anna Kissed Alice (@Almost_Anna)  June 16, 2020\n The doom and gloom isn’t all the media’s fault, though. Mesfin Bekalu, a research scientist at the Lee Kum Sheung Center for Health and Happiness at Harvard’s T.H. Chan School of Public Health, notes that while a lot of the news is bad, “as humans we have a ‘natural’ tendency to pay more attention to negative news.” This, along with social media algorithms, makes doomscrolling—and its impacts—almost inevitable. “Since the 1970s, we know of the ‘mean world syndrome’—the belief that the world is a more dangerous place to live in than it actually is—as a result of long-term exposure to violence-related content on television,” Bekalu says. “So, doomscrolling can lead to the same long-term effects on mental health unless we mount interventions that address users’ behaviors and guide the design of social media platforms in ways that improve mental health and well-being.”\n The effects of doomscrolling also vary depending on who’s doing it. Allissa Richardson, a professor at USC’s Annenberg School of Communication and Journalism, notes that when she was researching her  new book  Bearing Witness While Black: African Americans, Smartphones, and the New Protest #Journalism, she spoke to many activists who didn’t participate in doomscrolling simply because, they said, “I can’t see myself being killed over and over again in this tiny square on my phone.” Being able to participate in, and then opt out of, excessive social media use is, she notes, a privilege, which is why, when it comes to social media, many Black users turn to   Verzuz battles on Instagram Live and other forms of Black joy as an act of resistance. “Doomscrolling for  Black people works in the inverse, we’re actually trying to look for something separate and apart from bad things,” Richardson says. “For many nonblack Americans, this has been an incredibly enriching time, and doomscrolling for them is a deep dive into the things maybe they weren’t educated well about in the first place or maybe did have an inkling about but were ignoring.”\n To that end, there have been some upsides to the constant clicking. Social media is helping people stay connected during lockdown, and as the conversation shifted away from COVID-19 and toward racial justice and the Black Lives Matter movement, it&#39;s become a tool for active engagement—spreading news about protests, bail funds, community resources—rather than just a forum for the passive consumption of pandemic updates. Yet the late-night digging, the endless reading of bad news, is draining. (It can also, Richardson notes,  endanger protesters whose identities get spread around in other people’s feeds.) It’s a compulsion that’s only gotten worse in recent months, and one that points to humanity’s quest to find coping mechanisms when many of them have been stripped away.\n So, the doomscrolling continues. The actual origins of the term are a bit murky, though many point to  this tweet from October 2018 as a possible forebear. More recently, doomscrolling was  designated one of Merriam-Webster’s Words We’re Watching, and Dictionary.com  named it one of its &#34;New Words We Created Because of Coronavirus.&#34;\n There’s something else in the etymology, though. Particularly in the word  doom. Originally, the word had connotations that related it to judgement day and the end of the world, but now it&#39;s just as likely to be associated with destruction or ruin. The act of doomscrolling, then, is to roll toward annihilation. Or, to borrow a phrase from Joan Didion ( writing during America’s last traumatic, generation-defining year,  1968), it is an act of slouching toward quietus. Taken biblically, it has a Revelation tone. Each swipe through the timeline marks the end of a day of reckoning—for the state of the world at large and for the person attached to each appendage doing the scrolling. Simultaneously, each person watches the demise of so much, while also slowly destroying themselves. (This rush to judgement could also explain why  so many public figures are now facing  cancellation.) Didion lifted “slouching towards Bethlehem” from W.B. Yeats’ poem “The Second Coming,” itself a reflection on the destruction caused by World War I written amidst the 1918 flu pandemic. It’s only natural that the world’s scrolling reflects those writers’ apocryphal Apocalypse visions.\n At the same time, it doesn’t have to. Doomscrolling will never actually stop the doom itself. Feeling informed can be a salve, but being overwhelmed by tragedy serves no purpose. The current year is nothing if not a marathon; trying to sprint to the end of one’s feed will only cause burnout and a decline in mental health among the people whose level-headedness is needed most. That means you, dear reader. Amidst all of the pain, isolation, and destruction of the past six months, it’s not worth it to add on to the strain with two hours of excess Twitter every night. Perhaps now just needs to be the End Times for your timeline.", "posttime": "2020-06-27 19:07:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "滚动,slowly,可能", "title": "末日滚动正在慢慢侵蚀你的心理健康", "title_en": "Doomscrolling is slowly eroding your mental health", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/doomscrolling-is-slowly-eroding-your-mental-health/", "via": "", "real_tags": ["滚动", "slowly", "可能"]}, {"category": "", "categoryclass": "", "imagename": "55d2fd18f8091974b8a3da68aaf9e700.jpg", "infoid": 1008581, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然我们可能会出于好意转向植物性饮食，但素食快餐看不见的风险可能在几年内都不会显现。\n没有格雷格斯面包店，英国的火车站或商业街就不完整。大批量生产糕点的商人就像他们来的那样是典型的。去年，他们因转变为素食者而赢得喝彩。在取得成功后，其他快餐品牌很快也纷纷效仿。\n事实上，格雷格斯的素食香肠卷非常成功，该公司宣布2019年的销售额“惊人的一年”，部分原因是他们的新产品，他们将在员工之间平分700万英镑(917万美元)的奖金。\n和香肠卷一样，英国快餐的另一主食鱼和薯条也进行了素食改造。用植物性豆腐代替鳕鱼或黑线鳕(有时还用一层脆的海藻来创造鱼皮的效果)，素食者现在可以用他们的薯条享用“豆鱼”了。\n它们可能听起来像是一个没有负罪感的替代品，或者是对素食好奇的人的一个入口，但素食快餐替代品往往比同等的肉类食品对你的健康更糟糕。\n伦敦大学国王学院(King‘s College London)营养学家、“健康饮食”(Eat Yourself Healthy)一书的作者梅根·罗西(Megan Rossi)说：“显然，(纯素食主义)让人们开始考虑植物性食物，但缺点是，它让我们认为，当食物同样不健康或更不健康时，它对你是有好处的，”梅根·罗西(Megan Rossi)是“健康饮食”一书的作者。\n“豆腐含有omega 3，但它是一种不像动物来源那样活跃的类型，”Rossi说。植物性来源含有一种叫做α-亚麻酸(ALA)的omega3。为了让我们的身体能够利用丙氨酸做任何特别有用的事情，我们需要将其转化为二十碳五烯酸(EPA)或二十二碳六烯酸(DHA)。然而，人类并不是特别有能力做到这一点。\n正是DHA导致了omega3著名的大脑增强特性，而EPA被认为与减轻抑郁症状有关。这两种物质都在高脂肪的鱼油中含量很高。有一些非动物来源的有用的EPA和DHA，如藻油，可以作为补充剂使用。\n在素食期间，似乎每个菜单上都有一个替代方案，那就是菠萝蜜。成熟的水果有甜味，这暗示着它与无花果有密切的关系，但未成熟的水果是美味的，有肉质的质地。这种肉质使其成为替代拉猪肉、咖喱和汉堡的令人信服的选择。\n问题是，如果菠萝蜜是你想要的蛋白质，那么它就没有营养价值了。它主要由碳水化合物组成，几乎不含蛋白质。作为肉类的替代品，它不是最好的选择。\n营养学家雷切尔·克拉克森(Rachel Clarkson)说，即使是其他以植物为基础的蛋白质来源，质量也不如动物蛋白来源。“蛋白质是由氨基酸组成的，氨基酸是我们身体中每一个细胞和荷尔蒙的基石。然而，大多数植物并不含有大量的所有必需氨基酸。“。\n以植物为基础的蛋白质来源通常至少缺乏九种必需氨基酸中的一种-人体需要的氨基酸，但无法合成，因此必须从我们的饮食中获取。这意味着纯素食者要么需要仔细平衡他们的蛋白质，使他们相互补充，要么从其他地方补充他们的饮食。然而，肉、蛋和乳制品被认为是“完整的”，因为它们含有全部九种必需氨基酸。\n克拉克森说：“如果你的蛋白质饮食是由扁豆和豆子组成的，你会得到一些，但不是全部。”“素食汉堡通常是由豆子制成的，但这并不是一个完整的来源。大豆是一种很棒的产品，因为它含有高质量的蛋白质。那将是我的首选蛋白质。“。\n动物性食品和植物性食品的另一个质量差异在于它们的铁含量。虽然许多植物，如全谷物、豆类和菠菜都富含铁，但同样，它并不总是最好的类型。动物来源含有血红素铁，而植物含有非血红素铁。非血红素不能很好地被身体吸收。缺铁是一个问题，特别是对于月经对铁的需求较高的女性。\n在对素食者、纯素食者和杂食者缺铁研究的荟萃分析中，纯素食者(尤其是女性)被认为是最高风险群体。一项研究发现，25%的素食者血铁水平非常低，相比之下，素食者和杂食者的这一比例分别为3%和0%。甚至中度缺铁对素食者的影响更大(30%，相比之下，素食者为21%，杂食者为0%)。\n罗西说：“如果你长期吃素，食物搭配就会很重要。”有些食物含有化学物质，它们的特性可以提高其他食物对化学物质的吸收率。例如，在食用非血红素铁源的同时添加维生素C可以提高我们吸收它的能力。罗西举了一个例子，当用扁豆做饭时，使用富含维生素C的西红柿基质。\n人们还需要考虑在素食快餐中添加了什么，才能使其与肉类等价物一样有价值和满足感。例如，英国肯德基的素食汉堡含有2.91g盐，相比之下，他们的菲力汉堡含有2.02g盐，姜味汉堡含有1.97g盐。素食汉堡中的糖和碳水化合物也更多，蛋白质更少。\n克拉克森说，盐有时被添加到食品中作为防腐剂，但咸味食品也有一些根本上的好处。在素食快餐中加入盐，可以给人带来同样多肉的、令人满意的感觉，否则就会失去这种感觉。然而，当你考虑到一些人由于他们的基因而比其他人处理盐的能力更差时，问题就出现了。\n一种名为ACE的基因变异使我们中10个人中约有7个人在盐摄入量高时容易患上血压升高。营养基因组测试专家克拉克森说，这些人需要将他们每天的盐摄入量限制在4g(而英国NHS建议的6g)，以帮助降低他们患高血压的风险。一个格雷格斯素食香肠卷含有1.9克盐。\n没有一片素食奶酪，素食汉堡就不完整。但是如果我们吃真正的东西会不会更好呢？\n“在你的饮食中加入少量的奶酪[可能]对你的身体有好处，”罗西说。他说：“芝士是由细菌发酵而成，这些细菌会产生对我们身体有益的肽。她说，大多数素食奶酪没有发酵，但“它们有热量，但有[降解]的营养”。\n汉堡奶酪，即使在最好的时候，也可能是软软的，苍白的，无味的-一些人可能会慷慨地将其描述为“美国风格”。素食奶酪的化学成分使其成为复制这种质地的理想选择。但这也是素食奶酪可能出人意料地不健康的原因之一。\n椰子油通常是素食奶酪替代品中的脂肪选择。主要原因是奶酪需要在室温下是固体的，而其他植物性脂肪是液体的(棕榈油是另一个在室温下是固体的替代品)。这是因为椰子油的饱和脂肪含量很高。事实上，它的含量比动物脂肪高。\n克拉克森说：“这是令人担忧的，因为饱和脂肪会增加LDL(低密度脂蛋白)胆固醇，而LDL[低密度脂蛋白]胆固醇是动脉中脂肪斑块积聚的原因。”“有一天，你的动脉一侧的斑块可能会被拔掉，那就是你心脏病发作或中风的地方。”\n另一方面，橄榄油富含高密度脂蛋白(HDL)。这种类型的胆固醇降低了脂肪斑块堆积的风险，有助于将低密度脂蛋白输送到肝脏，在那里它们可以被清除。\n一般来说，乳制品也是B12的良好来源，但植物来源的B12不太容易被人体吸收。克拉克森说：“有些人的基因变异使他们在细胞间对B12的吸收和转运能力很差。”“我完全是以植物为基础的。我的基因测试显示我患B12缺乏症的风险增加了。我以为我很好，因为我有低脂奶酪和强化坚果奶。当我验血的时候，我的B12含量很低，我是一名营养专业人士。你可能认为你在做正确的事情，但你的血液说明了另一件事。“。\n能够很容易地在肉类和植物性快餐之间进行替代，可能会使向素食饮食的过渡变得更容易。当然，它可以成为许多人尝试新的素食替代品的途径。因此，如果食客继续学习植物性食物，并为他们剩下的饮食寻找其他替代品，那么在酒吧、餐馆和快餐店随时可以买到素食可能是一件好事。\n伦敦大学学院(University College London)专门研究健康心理学的行为科学家斯蒂芬妮·斯坦顿-费伊(Stephanie Stanton-Fay)表示：“为了让行为改变取得成功，你应该从小处着手，在现有行为的基础上再接再厉。”“任何能减少努力的事情都会鼓舞士气，所以把它融入到你已经有的日常生活中。”\n“我们谈论的一个概念是溢出：如果某人改变了行为，这种改变很可能会蔓延到其他有共同联系的行为上。”例如，如果你改用素食香肠。好的，还有什么相似的吗？也许他们会尝试其他肉类产品，或者类似类别的东西，比如奶酪。“。\n但是，如果有人出于健康原因决定尝试纯素食替代品，却发现他们的饮食不起作用怎么办？Stanton-Fay说，其他饮食，比如不吃糖或计算卡路里，可以相当明确地减少-例如，有一个简单的计算方法来确定你应该摄入多少卡路里。\n斯坦顿-费伊说：“像糖这样的东西在最近几个月和几年里特别被妖魔化；有明确的证据基础来减少或减少它。”然而，与肉制品相关的健康风险却不太清楚。\n“什么是含糖的也相当清楚--很容易辨别。”素食包括可持续饮食和购买符合环境问题的食品。它更复杂，因为最初可能是健康驱动的东西变成了与所有这些其他因素混合在一起的东西，“Stanton-Fay说。\n还有人担心，与这些营养缺乏相关的健康风险可能不会立即显现。Rossi说，可能需要数年时间才能将雾蒙蒙的想法和疲劳与低B12水平联系起来，将不孕不育与低铁联系起来，而大多数人由于缺钙导致的骨质疏松症直到40多岁和50多岁才会出现。\n“人们现在考虑的是自己的健康，而不是未来的健康，”她说。“有了omega 3和抑郁症之间的联系，可能会有轻微的风险，但有些人能应付得更少，有些人需要更多。一些人感觉很棒，另一些人则需要更高的集中度。“。\n因此，虽然你可能出于好意去吃植物性汉堡，但记住它到底是什么-快餐-并准备好接受这样一个事实，即它可能比它的肉质表亲更糟糕。\n通过在Facebook上为我们点赞加入100万未来粉丝，或者在Twitter或Instagram上关注我们。\n如果你喜欢这个故事，可以注册bbc.com每周专题时事通讯，名为“基本清单”(The Essential List)。精选BBC《未来》、《文化》、《职场生活》和《旅行》中的故事，每周五发送到您的收件箱。", "note_en": "While we might switch to a plant-based diet with the best intentions, the unseen risks of vegan fast foods might not show up for years.\n No British train station or high street would be complete without a Greggs bakery. The merchants of mass-produced pastries are as quintessential as they come. And last year they  won plaudits for turning vegan.  On the back of their success, other fast food brands shortly followed suit.\n In fact, Greggs’s vegan sausage rolls have been so successful,  the  company announced a “phenomenal year” for sales in 2019 driven in part by their new product and that they would share a £7m ($9.17m) bonus equally between staff.\n Like the sausage roll, another staple of British fast food, fish and chips, has had a vegan make-over. Replacing cod or haddock with the plant-based tofu (sometimes also with a layer of crispy nori seaweed to create the effect of fish skin), vegans can now enjoy “tofish” with their chips.\n   They might sound like  a guilt-free alternative or a gateway for the vegan-curious, but vegan fast food alternatives are often worse for your health than the meat equivalent.\n “Obviously the pros are that [veganism] is getting people to think about plant-based foods, but the con is that it makes us think that it is good for you when it can be equally or more unhealthy,” says Megan Rossi, a dietician at King’s College London and author of Eat Yourself Healthy.\n “Tofu contains omega 3 but it is a type that is not as active as animal sources,” says Rossi. Plant-based sources contain a type of omega 3 called alpha-linolenic acid (ALA). For our bodies to be able to do anything particularly useful with ALA,  we need to convert it into eicosapentaenoic acid (EPA) or docosahexaenoic acid (DHA). However, humans are not particularly well equipped to do this.\n  It is  DHA that is responsible for the much-celebrated brain boosting properties of omega 3, while  EPA has been linked to reduced symptoms of depression. Both are found in high quantities in fatty fish oils. There are some non-animal sources of useful EPA and DHA, like algae oil, that are available as supplements.\n  One alternative that seems to be on every menu during Veganury is jackfruit. The ripe fruit has a sweet taste, which hints at its close relation to the fig, but the unripe fruit is savoury and has a fleshy texture. This fleshiness makes it a convincing choice for pulled pork alternatives, curries and burgers.\n The issue is jackfruit is quite nutritionally valueless if it&#39;s protein you&#39;re wanting. It is mostly made up of carbohydrates and contains almost no protein. As a replacement for meat, it is not the best choice.\n Even other plant-based protein sources are of a lesser quality than animal protein sources, says dietician Rachel Clarkson. “Proteins are made up of amino acids which are the building blocks of every cell and hormone in our body. However, most plants do not contain good amounts of all essential amino acids.”\n  Plant-based protein sources usually lack at least one of the nine essential amino acids – the amino acids that the human body needs, but is unable to synthesise and so has to source from our diet. This means that vegans either need to carefully balance their proteins so that they complement each other, or supplement their diet from elsewhere. However, meat, egg and dairy products are considered “complete” because they contain all nine essential amino acids.\n “If your protein diet is made up of lentils and beans, you would be getting some but not all of them,” says Clarkson. “Vegan burgers are often made up of beans, but this is not a complete source. One great product is soy because it is high in quality protein. That would be my go-to protein.”\n Another discrepancy between the quality of animal- and plant-based foods is in their iron content. While plenty of plants, like whole grains, legumes and spinach are high in iron, once again, it is not always the best type. Animal sources contain haem iron, whereas plants contain non-haem iron.  Non-haem is not as well absorbed by the body. Being iron deficient is a problem,  particularly for women whose iron requirement for menstruation is higher.\n In a meta-analysis of research of iron deficiency in vegetarians, vegans and omnivores,  vegans (and in particular women) come out as the highest risk group. One study found that  25% of vegans had very low blood iron levels, compared to 3% of vegetarians and 0% of omnivores. Even more moderate iron deficiencies affect vegans more (30%, compared to 21% of vegetarians and 0% of omnivores).\n  “If you go long-term as a vegan, food pairing is going to be important,” says Rossi. Some foods contain chemicals whose properties improve absorption rates of chemicals in other foods. Adding vitamin C, for example, while eating a non-haem iron source improves our ability to absorb it. Rossi gives the example of using a tomato base, rich in vitamin C, when cooking with lentils.\n One also needs to consider what is added to vegan fast food to make it as rewarding and fulfilling as meat equivalents.  A vegan burger from KFC in the UK, for example, contains 2.91g of salt compared to 2.02g for their fillet burger or 1.97g for the Zinger burger. There is also more sugar and carbohydrates, and less protein in the vegan burger.\n Salt is sometimes added to foods as a preservative, but there is also something fundamentally rewarding about salty food, says Clarkson. Salt is added to vegan fast foods to give the same meaty, rewarding sensation that would otherwise be missing. Issues arise, though, when you consider that some people are less able than others to process salt due to their genetics.\n Genetic variations in a gene called ACE predispose around  seven in 10 of us to increased blood pressure when salt intake is high. These people need to limit their daily salt intake to 4g ( compared to the 6g recommended by the NHS in the UK) to help reduce their risk of high blood pressure, says Clarkson who is a specialist in nutrigenomic testing. A  Greggs vegan sausage roll contains 1.9g of salt.\n  No vegan burger would be complete without a slice of vegan cheese. But would we be better off eating the real thing?\n ““Having small amounts of cheeses in your diet [can be] good for your body&#34;,” says Rossi. “Cheese is fermented by bacteria that produce peptides which are beneficial in our bodies. She says most vegan cheeses are not fermented but “they are calorific but have [degraded] nutrients”.\n  Burger cheese, even at the best of times, can be limp, pale and flavourless – what some might generously describe as “American style”. The chemistry of vegan cheese makes it ideal for replicating this texture. But it is also one reason that vegan cheese can be surprisingly unhealthy.\n Coconut oil is frequently the fat of choice in vegan cheese alternatives. The main reason for this is that cheese needs to be solid at room temperature and other plant-based fats are liquid (palm oil is another alternative that is solid at room temperature). This is because coconut oil is very high in saturated fats. In fact, it has higher levels than animal fats.\n “This is worrying because what sat fat does is increase LDL [low-density lipoprotein] cholesterol which is responsible for fatty plaque build-up in arteries,” says Clarkson. “One day that plaque may be pulled off the side of your artery and that is where you get a heart attack or stroke.”\n  Olive oil, on the other hand, is high in high-density lipoproteins (HDL). This type of cholesterol lowers risk of fatty plaque buildups helping to transport LDLs to the liver where they can be removed.\n Generally dairy products are also a good source of B12, but plant sources of B12 are less easily taken up by the body. “Some people have a genetic variation that makes them poor absorbers and transporters of B12 from cell to cell,” says Clarkson. “I am quite plant-based. My genetic test showed me that I have an increased risk of B12 deficiency. I thought I was fine because I have low-fat cheese, fortified nut milk. When I took my blood test I was low in B12 and I am a nutrition professional. You might think you are doing the right thing but your blood says something else.”\n  Being able to make an easy substitution between a meat and plant-based fast food might make transitioning to a vegan diet easier. Certainly it could be a gateway for many people to try new vegan alternatives. So the ready availability of vegan foods in pubs, restaurants and fast food outlets could be a good thing if diners then continue to learn about plant-based foods and look for other alternatives for the rest of their diet.\n “In order for a behaviour change to be successful you should start small and build on an existing behaviour,” says Stephanie Stanton-Fay, a behavioural scientist from University College London  who specialises in health psychology. “Anything that makes it less effort is morale-boosting, so integrate it into a routine that you already have.\n  “One concept we talk about is spillover: If someone makes a behavior change there is the likelihood that that change will spill over into other behaviours where there is a common link. If you switch to vegan sausages, for example. Okay, what else is similar? Maybe they will try other meat products, or things in a similar category, like cheese.”\n But what if someone decides to try vegan alternatives for health reasons, only to find that their diet is not working? Other diets, like cutting out sugars or calorie counting, can be reasonably clear cut, says Stanton-Fay – there are simple calculations to determine how many calories you should be consuming, for example.\n “Something like sugar is particularly demonised in recent months and years; there is a clear evidence base to reduce or cut it out,” says Stanton-Fay.  Whereas the health risks associated with meat products are much less clear.\n  “It is also reasonably clear cut on what contains sugar – it is easy to tell. With vegan food there is the component of eating sustainably and purchasing foods that are compatible with environmental issues. It is more complex because what might start as a health drive becomes mixed up with all of these other factors,” says Stanton-Fay.\n There’s also the concern that the health risks associated with these kinds of nutrient deficiencies might not show up immediately. It could take years to associate foggy thoughts and tiredness with low B12 levels, infertility with low iron, and osteoporosis brought on by calcium deficiency does not show up until late 40s and 50s in most people, says Rossi.\n “People will think about their health now and not their future health,” she says. “With the link between omega 3 and depression, there might be a slight risk but some people can handle less and some people need more. Some people feel great and other people require higher concentrations.”\n So, while you might reach for that plant-based burger with the best of intentions, remember exactly what it is – fast food – and be prepared for the fact that it might even be worse for you than its meaty cousin.\n  Join one million Future fans by liking us on    Facebook , or follow us on    Twitter  or     Instagram .\n If you liked this story,    sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from BBC Future, Culture, Worklife, and Travel, delivered to your inbox every Friday.", "posttime": "2020-06-27 19:05:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "垃圾,junk,素食", "title": "为什么纯素食垃圾食品可能对你的健康更不利", "title_en": "Why vegan junk food may be even worse for your health", "transed": 1, "url": "https://www.bbc.com/future/article/20200129-why-vegan-junk-food-may-be-even-worse-for-your-health", "via": "", "real_tags": ["垃圾", "junk", "素食"]}, {"category": "", "categoryclass": "", "imagename": "f391e1a2a131171137b982df3ec75d79.jpg", "infoid": 1008580, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JWT(JSON Web Token)是一个开放标准(RFC7519)，它定义了一种在双方之间的JSON对象内提供信息的方法。本标准旨在帮助安全地传输信息，但任何标准或技术在使用不当时都不会保护您。\n为了确定在Node.js中使用JWT时可能出错的地方，我对使用最流行的JWT库的NPM模块进行了安全检查。使用静态分析工具，我检查了2000个NPM模块的安全弱点和漏洞。这篇文章总结了我在研究过程中发现的一些常见错误，包括：\n除了描述这些问题以便您可以避免它们之外，这篇文章还包括开放源码规则，使您可以更容易地手动审核代码库以检测它们，或者将这些漏洞包含在CI中，这样这些漏洞从一开始就不会合并到您的代码中。\n最基本的错误是将硬编码的秘密用于JWT生成/验证。这使得攻击者能够在源代码(以及其中的JWT秘密)公开暴露或泄露的情况下伪造令牌。\n这不仅引入了漏洞，还被认为是软件反模式。您应该将JWT机密与代码分开，例如，在单独的配置文件或环境变量中。\nconst jwt=REQUIRED(&#34；jsonwebToken&#34；)；const Secure=&#34；硬编码-SECRET-HERE&#34；；//😈类{静态签名(Obj){返回jwt.。sign(obj，ret，{})；}}。\n值得一提的是，使用JWT的一种流行方式是在其他库中使用，例如通过Passport，这是一种流行的Node.js身份验证中间件。\nvar JwtStrategy=Required(&#39；Passport-Jwt&39；).Strategy，ExtractJwt=Required(&#39；Passport-Jwt&39；).ExtractJwt；var opts={SecretOrKey：&#39；Hard code-Secure-Here；//😈}Passport。use(new(opts，function(JWT_PARYLOAD，DONE){//code}))；\n尽管这是一个已知且相当明显的问题，但在开发时使用硬编码的秘密，然后意外地将其留在代码库中的情况仍然很常见。幸运的是，使用SAST工具查找硬编码密码也非常容易，特别是使用Semgrep，它可以帮助查找规则非常简单的复杂代码模式。用于检测硬编码密码的规则：\n几年前，允许令牌具有无算法是一个严重的漏洞。现在，大多数流行的JWT库在没有显式启用None算法的情况下都不允许使用None算法解码或验证令牌。与硬编码的秘密一样，在测试或调试后很容易在代码库中留下‘&#39；NONE&#39；`。\n让JWT=REQUIRED(&#34；jsonwebToken&#34；)；let Secure=&#34；Some-Secret&#34；；JWT。验证(&#34；Token-here&#34；，Secret，{算法：[&#34；RS256&#34；，&#34；None&#34；]})；//😈&#39；None&#39；Allowed。\n无论如何，如果您在处理代码后忘记删除它，使用Semgrep.Rules检测代码中允许的“None”算法也很容易捕捉到它：\n有时开发人员依赖自己的令牌验证方法，而不是使用内置的API，或者完全省略验证，难怪这通常会给攻击者带来伪造令牌内信息的机会。\nconst JWT=Required(&#34；jsonwebToken&#34；)；const checkToken=(Token，fresh hToken，Key)=&gt；{if(JWT.。Verify(Refresh Token，Key)){//😈只有`renhToken`验证返回jwt。DECODE(TOKEN).param=JWT。decode(Fresh HToken).param；}返回FALSE；}；\n注意：在上面的示例中只验证了fresh hToken，这给攻击者提供了操纵函数结果的机会。通过更改存储在令牌中的参数属性值，攻击者可以强制checkToken函数的结果为TRUE并通过验证。\n最重要的是，在验证令牌(发布日期、ID等)之前，从令牌获取某些数据是非常典型的。然后将其用作验证上下文。通常情况下，它是无害的，但前提是这些数据不会进一步深入。如果未经验证的令牌中的信息被传递到代码的其他部分，则可能会引入漏洞。\n//令牌验证逻辑const jwt=request(&#34；jsonwebToken&#34；)；函数checkToken(Token){const颁发者=jwt。DECODE(TOKEN).Issuer；IF(findIssuer(Issuer)&amp；&amp；JWT.。验证(标记，密钥){//此处的代码}否则{抛出新的(&#34；不是有效的标记&#34；)；}}//来自不同模块函数findIssuer(ISS)的数据库实用程序{//.。数据库。查找(ISS)；}。\n(在上面的示例中，未经验证的颁发者值在验证令牌(https://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A1-Injection).)之前传递给另一个函数。如果不小心使用，它可能会导致不同类型的注入漏洞，特别是当它位于代码库的不同部分时。)。\n另外，不要忘记，即使令牌经过正确验证，其中存储的数据也应该被视为用户输入，并根据上下文进行验证和清理。\n在将对象转换为JWT令牌时，如果没有显式地将其拆分成几个部分，很容易失去对对象内部内容的控制，从而泄露一些敏感信息。\n在使用Mongoose、Sequelize等ORM库时，这是一个非常普遍的错误。ORM模型在创建时不包含任何敏感数据，但是当情况发生变化时，很容易忘记ORM对象也会传递给JWT令牌。\n//Mongoose model const mongoose=Required(&#39；mongoose&#39；)，Schema=mongoose.Schema；const schema=new({name：string，password：string，admin：boolean})；const user=mongoose。model(&#39；LocalUser&#39；，schema)；//Express控制器路由器。POST(&#39；/登录&#39；，(请求，资源)=&gt；{用户。findOne({name：req.body.name}，function(err，user){var Token=JWT.。Sign(User，Key，{expiresIn：60*60*10})；//😈将User对象直接传递给JWT res。json({SUCCESS：TRUE，Message：&#39；享受您的Token！&#39；，Token：Token})；})；}。\n这些是开发人员在Node.js项目中使用JWT时最常犯的错误。确保安全，不要忘记在代码库中自动执行安全扫描。", "note_en": "JWT (JSON Web Token) is an open standard ( RFC 7519) that defines a way to provide information within a JSON object between two parties. This standard is intended to help transmit information securely, but no standard or technology will protect you when used improperly.\n To identify what can go wrong when using JWT in Node.js, I performed a security review on  npm modules that use the most popular JWT libraries. Using static analysis tooling, I examined 2,000 npm modules for security weaknesses and vulnerabilities. This post summarizes some common mistakes that were found during my research, including:\n  In addition to describing these issues so you can avoid them, this post includes open source rules that make it easier to either manually audit your code bases to detect them, or include in CI so these vulnerabilities never get merged into your code in the first place.\n  The most basic mistake is using hardcoded secrets for JWT generation/verification. This allows an attacker to forge the token if the source code (and JWT secret in it) is publicly exposed or leaked.\n Not only does this introduce a vulnerability, it’s also considered a software anti-pattern. You should keep your JWT secrets apart from your code, for example, in separate configuration files or environment variables.\n const jwt  =  require ( &#34;jsonwebtoken&#34; ) ; const secret  =  &#34;hardcoded-secret-here&#34; ;  // 😈😈😈 class    {  static  sign ( obj )  {  return jwt . sign (obj , secret ,  { } ) ;  } }\n It’s worth mentioning that a popular way to use JWTs is within other libraries, e.g., through  Passport, a popular authentication middleware for Node.js.\n var JwtStrategy  =  require ( &#39;passport-jwt&#39; ) .Strategy , ExtractJwt  =  require ( &#39;passport-jwt&#39; ) .ExtractJwt ; var opts  =  { secretOrKey : &#39;hardcoded-secret-here&#39; ;  // 😈😈😈 }passport . use ( new   (opts ,  function ( jwt_payload , done )  {  // code } ) ) ;\n Even though this is a known and quite obvious issue, it’s still common to use hardcoded secrets while developing and then accidentally leave it in your codebase. Fortunately, it’s also very easy to find hardcoded secrets with SAST tools, especially with  Semgrep, which helps to find complex code patterns with rules that are very simple to write.Rules for detecting hardcoded secrets:\n     Allowing tokens to have the &#39;none&#39; algorithm was  a critical vulnerability some years ago. Nowadays, most popular JWT libraries do not allow decoding or verifying tokens with the None algorithm without explicitly enabling it. The same as with hardcoded secrets, it’s easy to leave ‘&#39;none&#39;` in your codebase after testing or debugging.\n let jwt  =  require ( &#34;jsonwebtoken&#34; ) ; let secret  =  &#34;some-secret&#34; ;jwt . verify ( &#34;token-here&#34; , secret ,  { algorithms :  [ &#34;RS256&#34; ,  &#34;none&#34; ]  } ) ;  // 😈 &#39;none&#39; allowed\n Anyway, if you forget to remove it after messing with code, it’s also very easy to catch it with Semgrep.Rules for detecting ‘none’ algorithm allowed in your code:\n    Sometimes developers rely on their methods of token verification instead of using built-in API, or omit verification completely.Small wonder that usually it introduces the opportunity for attackers to forge information inside the token.\n const jwt  =  require ( &#34;jsonwebtoken&#34; ) ; const  checkToken  =  ( token , refreshToken , key )  =&gt;  {  if  (jwt . verify (refreshToken , key ) )  {  // 😈 only `refreshToken` verified  return jwt . decode (token ) .param  === jwt . decode (refreshToken ) .param ;  }  return  false ; } ;\n Note: only  refreshToken is verified in the example above, which gives an opportunity to attacker to manipulate function results. By changing value of  param property stored inside  token an attacker can force the result of  checkToken function to be  true and pass the verification.\n On top of that, it’s very typical to get certain data from tokens before verifying it (issue date, id, etc.) and then use it as a verification context. Usually it’s harmless, but only if this data does not go any further. If the information from an unverified token is passed to other parts of the code it may introduce a vulnerability.\n // token verification logic const jwt  =  require ( &#34;jsonwebtoken&#34; ) ; function  checkToken ( token )  {  const issuer  = jwt . decode (token ) .issuer ;  if  ( findIssuer (issuer )  &amp;&amp; jwt . verify (token , key ) )  {  // code here  }  else  {  throw  new   ( &#34;not valid token&#34; ) ;  } } // database utility from different module function  findIssuer ( iss )  {  // ... database . find (iss ) ; }\n (In the example above, the unverified  issuer value is passed to another function before validating the token ( https://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/Top_10-2017_A1-Injection). If not used carefully it may end up in different kinds of injection vulnerabilities, especially if located in separate parts of the codebase.)\n Also do not forget that even if a token is verified properly, the data stored in it should be treated as user input and be validated and sanitized according to the context.\n    When an object is converted to a JWT token without explicitly breaking it down into parts, it’s very easy to lose control of what is inside the object and disclose some sensitive information.\n This is a very widespread mistake while using ORM libraries like Mongoose, Sequelize, etc. ORM models do not include any sensitive data at the moment of creation, but when the situation changes it is very easy to forget that the ORM object is also passed to JWT token.\n // Mongoose model const mongoose  =  require ( &#39;mongoose&#39; ) ,Schema  = mongoose .Schema ; const schema  =  new   ( { name : String , password : String , admin : Boolean } ) ; const User  = mongoose . model ( &#39;LocalUser&#39; , schema ) ; // Express controllerrouter . post ( &#39;/signin&#39; ,  ( req ,res )  =&gt;  {User . findOne ( {name : req .body .name } ,  function ( err , user ) {  var token  = jwt . sign (user , key ,  {expiresIn :  60 * 60 * 10 } ) ;  // 😈 passing User object directly to JWT res . json ( { success :  true , message :  &#39;Enjoy your token!&#39; , token : token  } ) ; } ) ; }\n      These are the most common mistakes developers make when using JWT in their Node.js projects. Stay secure and don’t forget to automate security scans in your codebase.", "posttime": "2020-06-27 18:36:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,编码,secrets,jwt", "title": "硬编码密码、未经验证的令牌和其他常见的JWT错误", "title_en": "Hardcoded secrets, unverified tokens, and other common JWT mistakes", "transed": 1, "url": "https://r2c.dev/blog/2020/hardcoded-secrets-unverified-tokens-and-other-common-jwt-mistakes/", "via": "", "real_tags": ["密码", "编码", "secrets", "jwt"]}, {"category": "", "categoryclass": "", "imagename": "873268e0402f6f14c4a0467f2a8001b2.jpeg", "infoid": 1008579, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛罗里达州卫生部有一个惊人的数据集：该州新冠肺炎病例的完整列表数据，包括所有10万+病例的年龄信息！我的脚本处理该数据：\n这将创建一个热图(heatmap.png)，表示一段时间内按年龄段划分的病例数：\n默认情况下，每个像素或存储桶的大小是10年年龄段和7个日间周期。这可以通过编辑变量Buckets_Aages和Buckets_Days进行更改。\n$./process.py佛罗里达州每7天时间段内按年龄段划分的新冠肺炎病例数随时间变化：时间段，00-09，10-19，20-29，30-39，40-49，50-59，60-69，70-79，80-89，90-199，中位数2020-02-29，0，0，2，0，0，2，3，2，0，0，63.02020-03-07，0，0，4，2，5，8，18，11，2。2、18、76、62、80、83、105、63、26、8、53.02020-03-21、13、63、370、441、442、515、399、350、155、33、51.02020-03-28、49、126、948、1146、1228、1330、1109、774、358、80、50.02020-04-04、53、148、881、1179、1265、1418、1214、747、438、138、51.02020-04。50.02020-04-18、85、200、706、904、860、1039、804、553、441、229、51.02020-04-25、65、175、596、703、682、804、632、458、388、179、51.02020-05-02、70、175、624、661、665、676、541、437、399、180、50.02020-05-09、86、183、653、728、710、7。46.02020-05-23、159、344、849、968、886、773、533、311、253、98、42.02020-05-30、318、589、1180、1292、1127、989、718、405、253、133、41.02020-06-06、449、804、2436、2025、1570、1451、933、525、366、174、38.02020-06-13。6294、4283、3114、2634、1499、858、437、173、34.0(上期&#39；%s数据不完整。114018例中有139例年龄不详)。\n在所有年龄段中，病例数量都在增加。然而，病例的中位年龄正在下降，因为年轻人似乎推动了更多的传播，特别是20-24岁的年龄段。\npy是一个从CSV文件中剥离ObjectID列并对行进行排序的工具。这对比较在2个不同日期发布的2个CSV文件很有帮助，因为每个文件的ObjectID值和行顺序都不稳定。", "note_en": "The Florida Department of Health has an  amazing dataset here:  complete linelist data of the state&#39;s COVID-19 cases, including age informationfor all 100k+ cases! My script processes that data:\n  This creates a heatmap ( heatmap.png) representing the number of cases by age bracket over time:\n  By default the size of each pixel, or  bucket, is 10-year age brackets and 7-daytime periods. This can be changed by editing the variables  buckets_ages and  buckets_days.\n  $ ./process.pyNumber of COVID-19 cases per 7-day time period in Florida by age bracket over time:period, 00-09, 10-19, 20-29, 30-39, 40-49, 50-59, 60-69, 70-79, 80-89, 90-199, median_age2020-02-29, 0, 0, 2, 0, 0, 2, 3, 2, 0, 0, 63.02020-03-07, 0, 0, 4, 2, 5, 8, 18, 11, 2, 0, 65.02020-03-14, 2, 18, 76, 62, 80, 83, 105, 63, 26, 8, 53.02020-03-21, 13, 63, 370, 441, 442, 515, 399, 350, 155, 33, 51.02020-03-28, 49, 126, 948, 1146, 1228, 1330, 1109, 774, 358, 80, 50.02020-04-04, 53, 148, 881, 1179, 1265, 1418, 1214, 747, 438, 138, 51.02020-04-11, 76, 186, 834, 982, 1169, 1268, 970, 647, 402, 168, 50.02020-04-18, 85, 200, 706, 904, 860, 1039, 804, 553, 441, 229, 51.02020-04-25, 65, 175, 596, 703, 682, 804, 632, 458, 388, 179, 51.02020-05-02, 70, 175, 624, 661, 665, 676, 541, 437, 399, 180, 50.02020-05-09, 86, 183, 653, 728, 710, 753, 580, 428, 388, 149, 49.02020-05-16, 202, 301, 796, 958, 891, 867, 628, 448, 361, 171, 46.02020-05-23, 159, 344, 849, 968, 886, 773, 533, 311, 253, 98, 42.02020-05-30, 318, 589, 1180, 1292, 1127, 989, 718, 405, 253, 133, 41.02020-06-06, 449, 804, 2436, 2025, 1570, 1451, 933, 525, 366, 174, 38.02020-06-13, 692, 1502, 5225, 3735, 2812, 2384, 1450, 840, 446, 164, 35.02020-06-20, 730, 1790, 6294, 4283, 3114, 2634, 1499, 858, 437, 173, 34.0(Last period&#39;s data is incomplete. Age unknown for 139 out of 114018 cases)\n  The number of cases is increasing among  all age brackets. However the median age ofcases is declining because younger people appear to be driving increased transmission,especially the 20-24 age bracket.\n  sort.py is a tool that strips the  ObjectId column from the CSV file and sorts therows. This is helpful to compare 2 CSV files published on 2 different days, becausethe  ObjectId value and the order of rows are not stable from one file to another.", "posttime": "2020-06-27 18:04:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "年龄段,florida,年龄", "title": "佛罗里达州按年龄段划分的新冠肺炎病例随时间变化的热图", "title_en": "Heatmap of Covid-19 cases in Florida by age bracket over time", "transed": 1, "url": "https://github.com/mbevand/florida-covid19-line-list-data", "via": "", "real_tags": ["年龄段", "florida", "年龄"]}, {"category": "", "categoryclass": "", "imagename": "c9c9ad8d8134ff5d16f472f9df190a8f.jpg", "infoid": 1008578, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到2023年，每一位美国土地测量员最终都将处于平等的地位。有一种脚，具体地说是：“国际脚”。长期以来，这些工程师一直使用两个版本的单元来测量土地，这取决于他们所在的州以及他们为谁工作。为了消除由此产生的混乱，测量员将很快停止使用所谓的“美国调查英尺”，而只使用国际版本。\n两者几乎相同-除以另一个得出的比率为0.999998。但是在很长的距离上，如此微小的差异累积起来可能会造成大问题。美国的每座建筑都位于特定的GPS坐标上，这些坐标通常以米为单位进行渲染和记录。绘制特性或建筑平面图时，测量员会将这些米转换为英尺。如果他们使用意想不到的步法，参考这些地图的未来工程师可能会在错误的位置安装或查找基础设施。\n国家大地测量局项目经理迈克尔·丹尼斯(Michael Dennis)负责监督过渡，他说：“这有点乱七八糟。”自1959年以来，美国的大多数工程项目都使用国际脚，但土地勘测-绘制边界和基础设施位置-使用任何组织或州想要的脚。(国际英尺正好是0.3048米，而美国调查英尺，1,200/3,937米，有一个无穷无尽的小数点。)。这意味着，任何在美国多个地点或不同机构工作的人都必须仔细跟踪哪只脚在使用中。最近对国家大地测量网络研讨会的530名参与者进行的一项民意调查发现，62%的人将工作中的问题归咎于两只脚之间的混乱。这些人大多是测量员。\n亚利桑那州注册土地测量师布莱恩·费舍尔(Brian Fisher)表示，在试图解释其他测量值时，数学运算拙劣是很常见的。“在我的职业生涯中，这种情况我已经看过几十次或数百次了。”幸运的是，他补充说，“在你建造它之前，它不是一个错误。”但丹尼斯指出，这种情况确实会发生，他引用了一位工程师对一座建筑的描述，这座建筑建在跑道附近，为了避免模糊飞机的滑行路径，不得不在最后一刻失去顶层，这是用不同类型的脚计算出来的。\n即将到来的变化的官方宣布定于6月底，公众已经有机会就这一授权发表意见。一些人表达了支持；另一些人警告说，这可能会造成更多的混乱，一些人建议美国测量员只是接受公制。丹尼斯说：“我们真的希望人们采用公制，但这是一场不同的战斗。”\n编者按(5/26/20)：本文中的图表已被修改，更正了指示哪些州使用“国际英尺”或“美国调查英尺”的关键字。", "note_en": "In 2023 every U.S. land surveyor will finally be on equal footing. One kind of foot, specifically: the “international foot.” These engineers have long measured land with two versions of the unit, depending on which state they are in and whom they work for. To eliminate the resulting confusion, surveyors will soon stop using what is called the “U.S. survey foot” and use only the international version.\n  The two are nearly identical—dividing one by the other provides a ratio of 0.999998. But over long distances, such minuscule differences add up and can cause big problems. Every building in the U.S. sits on specific GPS coordinates, which are typically rendered and documented in meters. When mapping property or construction plans, surveyors convert those meters to feet. If they use an unexpected type of foot, future engineers referencing those maps might install or look for infrastructure in the wrong place.\n    “It&#39;s kind of a mess,” says Michael Dennis, the National Geodetic Survey project manager overseeing the transition. Most engineering projects in the U.S. have used the international foot since 1959, but land surveys—which map boundaries and infrastructure locations—use whichever foot an organization or state wants. (The international foot is exactly 0.3048 of a meter, whereas the U.S. survey foot, 1200/3937 of a meter, has an unending decimal.) This means that anyone working in multiple U.S. locations or with different agencies must keep careful track of which foot is in use. A recent poll of 530 attendees of a National Geodetic Survey Webinar, who were mostly surveyors, found that 62 percent blamed confusion between the two feet for problems in their work.\n  Bungled math is common in trying to interpret others&#39; measurements, says Brian Fisher, a registered land surveyor in Arizona: “I&#39;ve seen it dozens or hundreds of times in my career.” Fortunately, he adds, “it&#39;s not an error until you build it.” But Dennis notes that this does happen, citing an engineer&#39;s account of a building that was constructed near a landing strip—and had to lose its top floor at the last minute to avoid obscuring the planes&#39; glide path, which had been calculated with a differing type of foot.\n  The official announcement of the impending change is slated for the end of June, and the public has been given a chance to weigh in on the mandate. Some people have expressed support; others warn it may cause even more confusion, and a few suggest U.S. surveyors just embrace the metric system. “We really wanted people to go metric,” Dennis says, “but that&#39;s a different kind of battle.”\n  Editor’s Note (5/26/20): The graphic in this story was amended to correct the key indicating which states use the “international foot” or “U.S. survey foot.”", "posttime": "2020-06-27 17:45:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "存在,disagreement,土地", "title": "多个州在脚到脚的长度上存在分歧", "title_en": "Multistate Disagreement over the Length of the Foot to End", "transed": 1, "url": "https://www.scientificamerican.com/article/multistate-disagreement-over-the-length-of-the-foot-to-end/", "via": "", "real_tags": ["存在", "土地"]}, {"category": "", "categoryclass": "", "imagename": "47635d9f35a3204d526bd5ed6e971405.jpg", "infoid": 1008576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两名熟悉讨论情况的消息人士周五表示，司法部检察官预计未来几个月将对谷歌提起反垄断诉讼，重点是该公司在网络广告和搜索领域的主导地位。\n据知情人士透露，美国司法部律师和州反垄断官员周五在网上会面，讨论了预期的申诉内容。由于调查仍在进行，这些知情人士未获授权公开发言。知情人士此前曾表示，诉讼是有可能的。\n预计这起诉讼将涉及对这家搜索巨头垄断广告技术市场的指控。预计它还将包括指控称，谷歌已采取措施扩大其在搜索领域的垄断地位，比如通过与苹果(Apple)和使用Android操作系统的手机制造商签订合同，这些合同要求谷歌成为默认的搜索引擎。\n知情人士告诫称，没有出席会议的司法部长威廉·巴尔(William Barr)尚未就是否起诉做出最终决定，这是他可能在未来几周做出的判断。该部门还需要决定它将寻求什么补救措施，比如试图拆分公司或限制其行为。州总检察长是否也会在司法部的起诉书上签字还没有确定。\n知情人士说，检察官仍在讨论是否将谷歌搜索相关行为的其他方面包括在内。\n谷歌发言人朱莉·塔拉洛·麦阿里斯特(Julie Tarallo McAlister)表示：“在我们继续进行调查的同时，我们的重点是创造免费产品，为小企业降低成本，每天帮助美国人。”\n近几个月来，美国商务部已显示出认真推进基于一年前发起的反垄断调查的诉讼的迹象。据三名知情人士透露，美国司法部和各州最近分别聘请了经济专家帮助可能的诉讼，并在必要时在庭审中作证。他们说，美国司法部也一直在寻找一名诉讼律师来帮助该案。\n这起诉讼将标志着该机构几十年来针对美国大公司的第一起重大垄断案件。在20世纪90年代末，美国司法部起诉微软，称该公司试图利用其Windows操作系统来扼杀Netscape互联网浏览器。司法部和各州在审判中获胜，这一决定在很大程度上得到了上诉的支持，但微软后来与政府达成了和解。\n欧洲主要竞争管理机构已经对谷歌提起了三起诉讼，并对这家搜索巨头的行为处以总计约90亿美元的罚款。谷歌已经就这三起案件提出上诉。美国联邦贸易委员会(Federal Trade Commission)此前曾调查谷歌，指控其偏向搜索结果，偏袒自己的产品。在谷歌同意自愿承诺改变一些做法后，该机构在2013年结束了调查，但没有采取行动。", "note_en": "Justice Department prosecutors expect to file an antitrust lawsuit against Google in the coming months focused on the company’s dominance in online advertising and search, two individuals familiar with the discussions said Friday.\n DOJ lawyers and state antitrust officials met online Friday and discussed contours of the expected complaint, according to the people, who weren’t authorized to speak on the record because the investigation is ongoing. People knowledgeable about the case had  previously described litigation as likely.\n  The suit is expected to involve allegations that the search giant has monopolized the advertising technology market. It is also expected to include allegations that Google has taken steps to  extend its monopoly over search, such as through contracts with Apple and cellphone makers who use the Android operating system that require it be the default search engine.\n The people cautioned that Attorney General William Barr, who did not attend the meeting, has yet to make a final decision on whether to sue, a judgment he could make in the coming weeks. The department would also need to decide what remedy it would seek, such as trying to break up the company or placing limits on its behavior. Whether the state attorneys general would also sign on to the DOJ complaint isn&#39;t yet determined.\n Prosecutors are still discussing whether to include other aspects of Google’s conduct related to search, the people said.\n  &#34;While we continue to engage with ongoing investigations, our focus is on creating free products that lower costs for small businesses and help Americans every day,” Google spokesperson Julie Tarallo McAlister said.\n The department has shown signs in recent months of seriously pushing forward with litigation based on the antitrust probe it launched a year ago. DOJ and the states have separately recently retained economic experts to help with a potential suit and testify at trial if needed, according to three individuals familiar with the probes. DOJ has also been seeking a litigator to help with its case, they said.\n The suit would mark the agency’s first significant monopolization case against a major U.S. company in decades. In the late 1990s, DOJ sued Microsoft over what it called the company’s  efforts to use its Windows operating system to stifle the Netscape internet browser. DOJ and states won at trial, a decision that was largely upheld on appeal, but Microsoft later reached a settlement with the government.\n Europe’s primary competition authority has brought three cases against Google and imposed fines totaling about $9 billion over the search giant’s conduct. Google has filed appeals in all three cases. The U.S. Federal Trade Commission previously investigated Google over allegations that it biases search results to favor its own products. The agency closed the probe in 2013 without taking action after Google agreed to &#34;voluntary commitments&#34; to alter some of its practices.", "posttime": "2020-06-27 16:54:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,rust,谷歌,预计,department", "title": "司法部预计将对谷歌提起反垄断诉讼", "title_en": "Justice Department expected to file antitrust suit against Google", "transed": 1, "url": "https://www.politico.com/news/2020/06/26/google-anti-trust-suit-341912", "via": "", "real_tags": ["google", "rust", "谷歌", "预计"]}, {"category": "", "categoryclass": "", "imagename": "0f5bca0eed65b05433089dc58ddf3561.jpg", "infoid": 1008575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可口可乐(Coca-Cola)周五宣布，将暂停全球所有社交媒体平台上的广告。\n该公司澄清说，它不会加入官方的抵制行动，但表示我们将暂停广告。\nDockers和Levi‘s周五晚些时候也宣布，他们将暂停Facebook和Instagram上的广告，而好时(Hershey)表示，将在今年剩余时间内将Facebook和Instagram的支出削减三分之一。\n可口可乐(Coca-Cola)周五宣布，将暂停全球所有社交媒体平台上的付费广告至少30天。\n该公司澄清说，它不会加入官方的抵制行动，但表示我们将暂停广告。\n睡眠巨人(Sleep Giants)发布的一份名单显示，自一批组织呼吁Facebook广告商在7月份暂停广告支出以来的一周里，包括威瑞森(Verizon)、巴塔哥尼亚(Patagonia)、REI、Lending Club和North Face在内的90多家营销机构宣布有意加入。该组织包括反诽谤联盟、全国有色人种协进会、睡眠巨人组织、改变颜色组织、新闻自由组织和常识组织。可口可乐首席执行官兼董事长詹姆斯·昆西(James Quincey)在一份声明中表示，世界上没有种族主义的位置，社交媒体上也没有种族主义的位置。可口可乐公司将暂停全球所有社交媒体平台上的付费广告至少30天。我们将利用这段时间重新评估我们的广告政策，以确定是否需要修改。我们还期待我们的社交媒体合作伙伴提供更大的责任感和透明度。\n这家饮料巨头一直在其Twitter账户上发布关于多样性和结束系统性种族主义的言论，包括对纳斯卡唯一的黑人司机布巴·华莱士(Bubba Wallace)的支持。\n可口可乐宣布这一消息之前，联合利华(Unilever)周五表示，将至少在12月31日之前停止在美国Facebook、Instagram和Twitter上投放广告。联合利华的品牌包括多芬(Dove)、本·杰瑞(Ben&Jerry)和赫尔曼(Hellmann)。\n联合利华(Unilever)加入了埃迪·鲍尔(Eddie Bauer)、The North Face和巴塔哥尼亚(Patagonia)等品牌的行列，作为一项运动的一部分，这场运动迫使这家社交媒体网络公司通过采取一系列行动，对仇恨言论和虚假信息进行更严格的监管，包括为那些表示自己因种族或宗教原因而成为目标的用户创建了单独的审核渠道，或者让广告商看到他们的广告出现在与后来因错误信息或仇恨而被删除的内容附近的频率，并允许他们退款。\n在可口可乐宣布这一消息后，李维斯和Dockers表示，他们将暂停Facebook和Instagram上的所有广告，至少持续到7月：Facebook必须采取行动，阻止其平台上的错误信息和仇恨言论。这是对我们价值观的不可接受的冒犯。我们和码头工人正在加入#StophateFor利润活动，并暂停Facebook上的所有广告。\n好时周五晚些时候还宣布，将在今年剩余时间内将Facebook和Instagram的支出削减三分之一，并加入#stophatefor利润抵制活动。\n我们不认为Facebook有效地管理了他们平台上的暴力和分裂言论。该公司在一份声明中表示，尽管Facebook一再声称要采取行动，但我们没有看到有意义的变化。本月早些时候，我们向Facebook表示，我们对他们在仇恨言论上的立场感到不满。在今年剩下的时间里，我们已经将Facebook及其平台(包括Instagram)的支出削减了三分之一。我们希望Facebook将采取行动，使其成为我们消费者交流和聚集的安全空间。作为一家公司，我们代表团结和包容的价值观，我们坚定地承诺做出改变，成为积极变革的一部分。\nFacebook的另一个主要消费者宝洁公司(Procter&amp；Gamble)本周早些时候表示，它正在审查其在其上做广告的所有媒体渠道、网络、平台和节目，以确保内容和评论准确且尊重所有人，并且我们没有在我们认为令人憎恨、歧视、诽谤或贬损的内容上或附近做广告。\n宝洁首席品牌官马克·普里查德(Marc Pritchard)表示：作为其中的一部分，我们正在与媒体公司和平台合作，在需要的时候采取适当的系统性行动。记者联系到该公司请其置评，但该公司拒绝对Facebook发表具体评论。\n在脸书上的直播中，首席执行官马克·扎克伯格表示，他打算讨论新的政策，将人们与有关投票的权威信息联系起来，打击选民压制，打击仇恨言论。他没有直接回应广告商的抵制。\n在CNBC最近获得的一份致广告商的备忘录中，Facebook全球营销解决方案副总裁卡罗琳·埃弗森(Carolyn Everson)表示，抵制总体上不是我们共同进步的方式。\n她在备忘录中表示：我也真心希望你们现在知道，我们不会因营收压力而做出政策调整。我们制定政策是基于原则而不是商业利益。", "note_en": "Coca-Cola on Friday announced it will be pausing advertising on all social media platforms globally.\n The company clarified it was not joining the official boycott, but said &#34;we are pausing&#34; advertising.\n Dockers and Levi&#39;s also announced late Friday they will be pausing ads on Facebook and Instagram, while Hershey&#39;s said it will be cutting spending on Facebook and Instagram by a third for the rest of the year.\n Coca-Cola on Friday announced it will be pausing paid advertising on all social media platforms globally for at least 30 days.\n The company clarified it was not joining the official boycott, but said &#34;we are pausing&#34; advertising.\n  In the week since a  group of organizations have called on Facebook advertisers to pause their ad spending during the month of July, more than 90 marketers including  Verizon, Patagonia, REI, Lending Club and The North Face have announced their intention to join, according to a  running list from Sleeping Giants. The group of organizations includes the Anti-Defamation League, the NAACP, Sleeping Giants, Color of Change, Free Press and Common Sense.  &#34;There is no place for racism in the world and there is no place for racism on social media,&#34; Coca-Cola CEO and Chairman, James Quincey, said in a statement. &#34;The Coca-Cola Company will pause paid advertising on all social media platforms globally for at least 30 days. We will take this time to reassess our advertising policies to determine whether revisions are needed. We also expect greater accountability and transparency from our social media partners.&#34;\n The beverage giant has been posting quotes about diversity and ending systemic racism on its Twitter account, including support for NASCAR&#39;s only Black driver, Bubba Wallace.\n  Coca-Cola&#39;s announcement comes after  Unilever, whose brands include Dove, Ben &amp; Jerry&#39;s and Hellmann&#39;s, said Friday it will halt advertising on  Facebook, Instagram and  Twitter in the U.S. at least through Dec. 31.\n Unilever joined brands like Eddie Bauer, The North Face and Patagonia as part of a campaign forcing the social media network to more stringently police hate speech and disinformation by  taking a number of actions, including creating a &#34;separate moderation pipeline&#34; for users who say they&#39;ve been targeted because of their race or religion, or to let advertisers see how frequently their ads appeared near to content that was later removed for misinformation or hate, and allow them refunds for those advertisements.\n Following Coca-Cola&#39;s announcement,  Levi&#39;s and Dockers said they will be pausing all advertising on Facebook and Instagram through &#34;at least&#34; July: &#34;Facebook must take actions to stop misinformation and hate speech on its platforms. It is an unacceptable affront to our values. We and Dockers are joining the #stophateforprofit campaign and pausing all ads on Facebook.&#34;\n  Hershey&#39;s also announced late Friday it will be cutting spending on Facebook and Instagram by a third for the rest of the year and joining the #stophateforprofit boycott.\n &#34;We do not believe that Facebook is effectively managing violent and divisive speech on their platform. Despite repeated assertions by Facebook to take action, we have not seen meaningful change,&#34; the company said in a statement. &#34;Earlier this month we communicated to Facebook that we were unhappy with their stance on hate speech. We have now cut our spending on Facebook and their platforms, including Instagram, by a third for the remainder of the year. We are hopeful that Facebook will take action and make it a safe space for our consumers to communicate and gather. As a company, we stand for the values of togetherness and inclusion and we are resolute in our commitment to make a difference and be part of positive change.&#34;\n Procter &amp; Gamble, another major Facebook spender, said earlier this week it is reviewing all media channels, networks, platforms and programs it advertises on &#34;to ensure that the content and commentary accurately and respectfully all people, and that we are not advertising on or near content we determine to be hateful, discriminatory, denigrating or derogatory.&#34;\n &#34;As part of that, we&#39;re working with media companies and platforms to take appropriate systemic action where needed,&#34; P&amp;G chief brand officer Marc Pritchard said. The company, reached for comment, declined to specifically comment on Facebook.\n During a livestream on Facebook, CEO Mark Zuckerberg  said he intends to discuss &#34;new policies to connect people with authoritative information about voting, crack down on voter suppression, and fight hate speech.&#34; He did not directly address the advertiser boycotts.\n In a recent memo to advertisers obtained by CNBC, Facebook&#39;s VP of global marketing solutions, Carolyn Everson, said &#34;boycotting in general is not the way for us to make progress together.&#34;\n &#34;I also really hope by now you know that we do not make policy changes tied to revenue pressure,&#34; she said in the memo. &#34;We set our policies based on principles rather than business interests.&#34;", "posttime": "2020-06-27 16:53:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,媒体,cola,表示", "title": "可口可乐暂停全球所有社交媒体平台的广告", "title_en": "Coca-Cola pauses advertising on all social media platforms globally", "transed": 1, "url": "https://www.cnbc.com/2020/06/26/coca-cola-pauses-advertising-on-all-social-media-platforms-globally.html", "via": "", "real_tags": ["广告", "媒体", "cola", "表示"]}, {"category": "", "categoryclass": "", "imagename": "fc80536ae67615466e276913a1ff1384.jpg", "infoid": 1008574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本周的“蜂巢内幕”节目中，尼克·比尔顿回来谈论新冠肺炎和“黑人生命也是命”运动期间的社交媒体，马克·扎克伯格将如何被载入史册，以及为什么我们不应该相信最新的民意调查。另外，比尔顿还展示了他的牵线搭桥能力。\niTunes用户？只需点击此处，即可在您方便的时候收听“蜂巢内幕”节目。别忘了订阅。\n-美国分离的公主伊万卡·特朗普(Ivanka Trump)的平行宇宙-“不，我不好”：一名黑人记者向他的白人朋友们发表讲话-为什么破产的赫兹是大流行的僵尸-明尼阿波利斯抗议活动中愤怒和哀悼的场景-民权倡导者布兰迪·柯林斯-德克斯特(Brandi Collins-Dexter)谈为什么Facebook选择特朗普而不是民主-民主党人的蓝色德克萨斯州发烧梦想可能最终成为现实-来自档案：盘点毫无准备的梅拉尼娅·特朗普(Melania Trump)-。\n还想要更多吗？注册我们的每日蜂巢时事通讯，决不会错过任何故事。", "note_en": "On this week’s episode of  Inside the Hive,  Nick Bilton comes back to talk about social media during COVID-19 and the Black Lives Matter movement; how  Mark Zuckerberg will be remembered in history books; and why we shouldn’t trust the newest polls. Plus, Bilton reveals his matchmaking abilities.\n  iTunes user? Just tap  here to listen to Inside the Hive  at your convenience. And don’t forget to subscribe.\n   — The Parallel Universe of Ivanka Trump, America’s  Dissociated Princess —  “No, I Am Not Okay”: A Black Journalist Addresses His White Friends — Why Bankrupt Hertz Is a  Pandemic Zombie — Scenes of  Fury and Mourning at the Minneapolis Protests —  Civil Rights Advocate Brandi Collins-Dexter on Why Facebook Chooses Trump Over Democracy — Democrats’ Blue-Texas  Fever Dream May Finally Become a Reality — From the Archive: Taking Stock of Melania Trump, the  Unprepared—And Lonely—FLOTUS\n  Looking for more?  Sign up for our daily Hive newsletter and never miss a story.", "posttime": "2020-06-27 16:53:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,福克斯,fox,蜂巢", "title": "Facebook是福克斯新闻吗？", "title_en": "Is Facebook the New Fox News?", "transed": 1, "url": "https://www.vanityfair.com/news/2020/06/is-facebook-the-new-fox-news", "via": "", "real_tags": ["facebook", "福克斯", "fox", "蜂巢"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个节目中，Zig社区的成员分享代码和想法。", "note_en": "The show where members of the Zig community share code and ideas.", "posttime": "2020-06-27 16:51:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zig,社区", "title": "Zig Showtime", "title_en": "Zig Showtime", "transed": 1, "url": "https://zig.show/", "via": "", "real_tags": ["zig", "社区"]}, {"category": "", "categoryclass": "", "imagename": "9fcaba7ad711eb399454a307680606ac.jpeg", "infoid": 1008572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇报道在Business Insider Prime上独家提供。加入BI Prime，现在就开始阅读吧。\n据三名知情人士透露，以及Business Insider看到的内部文件，特斯拉在2012年6月知道其Model S汽车配备了一个有缺陷的电池冷却系统，因为这些汽车开始交付给客户。但不管怎样，公司还是把车卖了。\n设计上的缺陷使冷却系统容易漏水。行业专家告诉Business Insider，一旦冷却剂泄漏到电池组中，就会使电池短路或引发火灾。\n根据Business Insider查看的内部电子邮件和文件，这个设计缺陷在2012年春季成为公司内部一个紧迫的话题。事实上，2012年，随着汽车从生产线上下来并交付给客户，电子邮件显示，特斯拉的员工仍对生产线上发现的泄漏部件感到担忧。\n首先，根据第三方公司IMR Test Lab在2012年夏天所做的测试，特斯拉选择用于冷却线圈端部配件的铝制特斯拉容易出现裂缝和针孔。Business Insider审查了这些测试结果。\n其次，根据Business Insider看到的电子邮件，冷却系统的端接件的设计不完善，以至于即使在部件钎焊在一起后，冷却线圈及其连接到汽车的端接件之间也存在间隙。“商业内幕”(Business Insider)和一名前特斯拉员工看到的特斯拉内部文件显示，有时，员工不得不用锤子把碎片拼在一起，以缩小差距。\n这两个设计缺陷都有可能导致冷却系统泄漏，这意味着电池冷却液可能会溢出到汽车的电池组中。“商业内幕”(Business Insider)查看的特斯拉内部文件显示，截至2012年底，特斯拉继续在其生产线上发现泄漏的冷却部件--称为带子或冷却线圈。目前尚不清楚特斯拉是何时改变设计以防止泄漏的。\n美国国家公路运输局(National Highway Transportation Agency)正在调查2012至2019年期间生产的特斯拉Model S和Model X汽车是否存在电池缺陷，这可能会导致非撞车火灾。此前，许多特斯拉客户提交了一份请愿书，抱怨特斯拉软件更新限制了他们的汽车一次充电的行驶里程。特斯拉是在2019年发生一系列火灾后做出这一更新的。\n消费者律师爱德华·陈(Edward Chen)在去年向美国国家公路交通安全管理局(National Highway Traffic Safety Administration)提交的请愿书中称，特斯拉正在使用空中软件更新来掩盖和掩盖其车辆电池存在的一个潜在的广泛而危险的问题。\n多年来，特斯拉一直在处理有关其电池安全性的问题。这在一定程度上是因为这项技术是新的，电动汽车起火不同于传统内燃机的起火。因为大火是由化学反应引发的，所以有时需要几天时间才能扑灭，在紧急救援人员离开现场几个小时后又会重新点燃。一旦电池烧毁，几乎不可能找到起火点。火灾也可以自发开始。2019年，旧金山、香港和上海的车库里停放的特斯拉随机起火。\n里卡多战略咨询公司(Ricardo Strategic Consulting)副总裁杰森·舒格(Jason Schug)在接受“商业内幕”(Business Insider)采访时表示，他已经拆卸了特斯拉的Model S和Model X，以及它的Model 3。他告诉“商业内幕”，如果冷却液泄漏到电池模块中，可能会导致电池无法使用。舒格曾在通用汽车和福特汽车公司度过了部分工程生涯。\n舒格说，当我们拆卸特斯拉Model X时，一名技术人员不小心将冷却液洒在电池组中，电池组在那里停留了很长时间。没有直接的危险，但当我们拆下电池模块时，很长一段时间后，我们发现电池有很大的腐蚀，有些电池泄漏电解液，这已经够糟糕的了。如果这件事发生在野外而没有引起注意，可能会导致电池爆裂。\n特斯拉没有回应Business Insider关于其冷却系统、电池或任何泄漏液体的可能性或影响的问题。\n舒格还说，虽然电池冷却剂本身不可燃，但一旦蒸发后留下的残留物可能是可燃的。这不仅适用于特斯拉，也适用于全电动汽车。2017年，宝马因火灾风险召回100万辆汽车。\n舒格说，与另一家制造商发生了一起事故，一辆正在进行碰撞测试的车辆在几周后自燃。在坠机过程中，冷却剂溢出到电池中，当它蒸发时，留下的残留物将电流传导到短路，从而使电池过热并引发火灾。\n所有这些都是说，电池的设计必须尽一切可能确保冷却剂不会泄漏到电池组中-至少不是在没有通知的情况下。如果是这样的话，后果可能是煽动性的。特斯拉没有回应“商业内幕”关于如何防止泄漏的问题。\n特斯拉的承诺不仅是让电动汽车变得性感，而且要以硅谷的方式做到这一点-比其他任何人都更快、更便宜。\n因此，当特斯拉为Model S设计电池时，它看起来使用了已经存在的部件，这样就可以让事情变得简单。它选择了18-650电池-一个可以从货架上买到的电池，因为它已经在笔记本电脑等日常使用的东西上生产了。\n为了制造电池组，数千个这样的电池被分成十几个模块--数量取决于电池的续航能力。\n但电池中有这么多电池有一个问题：如果一个电池过热，可能会引发一种称为热失控的化学反应，其他电池也会过热并起火，引发交感爆炸。这就是为什么-就像2019年特斯拉S型车停在上海的一个车库里起火的情况一样-只需要一个过热的电池或模块就能启动连锁反应，导致电池失火。这就是为什么-就像2019年特斯拉S型车停在上海的一个车库里时一样-只需要一个过热的电池或模块就能启动连锁反应，导致。\n自动救援和火灾救援专家布罗克·阿切尔(Brock Archer)去年告诉“商业内幕”(Business Insider)，锂离子电池着火的原因真的只有几个。他说，这些原因是液体的，死气沉沉的，或者说，每10亿个电池中就有一个是自燃的。\n特斯拉敏锐地意识到了电池化学方面的这些问题，在2009年提交的一项电池专利中详细解释了其设计正在采取的措施，以减轻这一风险。据“商业内幕”(Business Insider)一位参与电池设计的前高级员工表示，这就是为什么电池化学和电池结构是该公司的主要设计顾虑(撇开成本不谈)。由于担心遭到报复，此人要求匿名。\n电池的电池化学成分必须精确，才能使汽车达到远距离和高速度。而且汽车本身的设计必须不惜一切代价在发生撞车时保护电池。这是因为即使是电池的少量损坏也有可能引发这种连锁反应，也就是所谓的细胞繁殖，当其中一个电池的温度升高引起连锁反应时。\n一名于2018年离开公司的前员工表示，由于特斯拉正在进行制造过程的速度，它有时会要求第三方供应商为公司做研发。三名前特斯拉员工和两家供应商告诉“商业内幕”，这一安排并非没有摩擦。根据他们的说法，特斯拉有时对第三方的建议不屑一顾，要求的工作比支付的更多，并推动供应商以惊人的速度提高产量。这些人的身份得到了Business Insider的验证，由于担心报复，他们要求匿名。\n随着特斯拉对电池模块的需求增长，它对冷却线圈的需求也在增长。在最初的S型电池设计中，铝冷却线圈缠绕在电池模块上，并使用末端配件连接到汽车上。\n2014年离职的一名前员工表示：当你要发布一个新的组件时，在第一次发布的过程中，上线总是会遇到困难和问题，特别是当你重新启动特斯拉，而你又要求你的供应商进行有限的研发时。我们确实遇到过漏水的问题。\n当特斯拉开始解决S型车的冷却线圈问题时，这款车的发布已经落后于计划。在“埃隆·马斯克：特斯拉、SpaceX和追求美好未来”一书中，阿什利·万斯说，为了让汽车尽快出厂，马斯克从企业的各个部门--从招聘到设计工作室--召集员工，以尽可能快的速度卖出更多的汽车。(注：特斯拉、SpaceX和“追求美好未来”)阿什利·万斯在书中说，为了让汽车尽快出厂，马斯克从企业的各个部门--从招聘到设计工作室--召集了员工，以尽可能快的速度销售汽车。\n根据Business Insider查看的文件，2012年7月，一些冷却线圈被送往纽约州北部一家名为IMR测试实验室的实验室。\n根据商业内幕(Business Insider)审阅的IMR报告，冷却线圈上的末端配件不符合法规强度铝合金的化学要求。一位知情人士说，结果与特斯拉分享，但Model S汽车不断出厂。根据特斯拉2012年第三季度收益报告，该公司交付了250多辆Model S轿车。\n2012年8月，该部件再次进行了测试。特斯拉将部件寄给了工程和科学咨询公司Exponent。根据Business Insider查看的内部电子邮件，特斯拉感到担忧，因为冷却线圈上的末端配件没有固定在一起，因此是泄漏的来源。“商业内幕”(Business Insider)查看的一封内部电子邮件显示，2012年8月，一名特斯拉员工形容他们悬于一线。\n在Exponent处理这件事的工程师是一位名叫斯科特·利伯曼(Scott Lieberman)的人。他现在LPI Inc.工作。利伯曼拒绝接受“商业内幕”(Business Insider)的采访。然而，在“商业内幕”(Business Insider)看到的他与特斯拉之间的内部电子邮件中，他对这个角色的看法是明确的。他在有限的测试后发现了测试材料上的缺陷-特别是导致泄漏的微小针孔。\n根据Business Insider查阅的文件，直到2012年底，特斯拉在生产的各个阶段继续发现泄漏的线圈。“商业内幕”(Business Insider)看到的2012年10月发送的内部电子邮件显示，其中一些在生产线上被发现得很晚，被描述为严重的质量问题，或者被发现电池组泄漏了液体。“商业内幕”(Business Insider)查看了这些电子邮件。文件显示，在这一点上，问题已经被标记给高级管理层。\n在2012年9月发送的另一封电子邮件中，员工们提到，生产线上的工人有时不得不用锤子将末端配件固定在一起。\n2014年离开特斯拉的这名员工表示，按照特斯拉的标准，这些问题被认为是正常的。与传统汽车制造商不同，特斯拉没有等待新车型重新设计零部件。这位员工说，取而代之的是，零部件不断地重新设计，并部署到车辆上。另一方面，这位前雇员还表示，公司已经进行了大量的调查和对策，试图减少泄密。\n特斯拉没有回应Business Insider关于其设计过程或用于减少这一部分泄密的对策的问题。\n这位于2014年离开公司的前员工表示，铝材的弯曲使其更加脆弱，而且在匆忙制定生产目标时，端部配件有时仍被强行拼装在一起，导致泄漏。“。\n我们确实发现了几辆车，这位前雇员在谈到有泄漏的汽车时说。我不知道确切的数量，但对于一家决定推出有限研发的公司来说，我同样认为这是正常的，希望：我们将以这种方式推出，我们将进行检查，确保在工厂发现这种情况。\n密歇根大学(University Of Michigan)工业与运营工程教授杰弗里·利克(Jeffrey Liker)表示，这根本不是像丰田这样的传统汽车制造商如何处理设计缺陷的。他是“丰田之道：来自世界上最大的制造商的14条管理原则”一书的作者。\nLiker说，像丰田这样的汽车制造商提前加载了他们的制造过程。他们投入了大量资源进行准备，为新部件创建和压力测试原型，然后有一个试生产阶段，在认真开始制造过程之前捕捉任何缺陷。当然，大多数丰田汽车80%的零部件都来自以前的设计。另一方面，特斯拉正在设计一款全新的汽车--这一过程在制造业被称为“无纸设计”。\n利克说，当你从零开始，你就有了更多的空间来展示特斯拉带来的创新，但也有更高的设计缺陷或生产问题的风险。\n利克说，这款车的每一个部件都是突破性的创新，所以几乎可以肯定会出现严重的生产问题。这是一种权衡，马斯克本可以更保守一些，但他的竞争优势会是什么呢？\n为了试图了解自2012年以来该公司的生产流程发生了怎样的变化，Business Insider联系了三名曾在特斯拉工作过不同时间的员工。\n虽然他们都不能确认冷却线圈问题的程度，但他们都表示，特斯拉仍然是一个节奏快得令人难以置信的工作场所，设计也在不断变化。\n特斯拉总是由生产驱动的，所以有时如果问题不是出现在客户面前，他们就会继续推出汽车。事情就是这么简单，一位2018年离开公司的工程师告诉“商业内幕”(Business Insider)，他指的是他在公司的一般经历。\n另一名为NUMMI(特斯拉收购的丰田和通用汽车(General Motors)共同拥有的工厂)工作了十多年并为特斯拉工作了四年的员工告诉“商业内幕”(Business Insider)，他在特斯拉的经历与他在NUMMI的经历非常不同。\n这位2017年离职的员工表示，丰田没有像特斯拉那样仓促行事。这名员工还表示，尽管零部件经过了严格的测试，但测试这些零部件的工人没有接受到他们将在NUMMI接受的广泛培训。这位前员工说，当时根本没有时间，特斯拉的硅谷工程师也不想听太多关于NUMMI是如何做事情的。\n当我被录用时，他们说他们不想听有关NUMMI或丰田的事。“我们是一家高科技公司，不是汽车公司，”他们告诉我，这位前雇员说。\n这位前雇员说，设计上的频繁变化造成了特斯拉供应链的中断-让供应商感到不安-并浪费了资金和材料。\n他们说，工程师们会做一些修改或改变，然后他们就会切换到这一点上来。那样的话，特斯拉就会有一卡车老式的产品，他们会浪费掉……。这就是他们的运作方式。\n这三名前员工都表示，供应链的中断对公司来说是浪费。一位在Model S发布期间曾在特斯拉工作的员工表示，特斯拉内部的一个笑话是，如果你排好前一万辆S型货车，每一辆都会不同。\n这位前雇员说：我认为，每一家汽车公司发布的车辆都存在设计缺陷，这是很常见的。这叫做运行设计更改。&#34；\n这位前雇员说，正是这些设计缺陷为特斯拉以惊人的速度不断创新腾出了空间。此外，这位知情人士说，特斯拉的早期用户并不是真的买车。\n我的理解是，2012年的每一位顾客都在购买特斯拉的信任。这位前雇员说，他们并不期待一辆完美的车。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "This story is available exclusively on Business Insider Prime.  Join BI Prime and start reading now.\n  Tesla knew its Model S cars were equipped with a battery-cooling system that had a flawed design in June 2012, as those cars started being delivered to customers, according to three people familiar with the matter and internal documents viewed by Business Insider. But the company sold the cars anyway.\n The flaw in the design made the cooling system susceptible to leakage. Once coolant leaks into a battery pack, it can short a battery or cause a fire, industry experts told Business Insider.\n This design flaw became a topic of urgent concern within the company in spring 2012, according to internal emails and documents viewed by Business Insider. And indeed, as cars were rolling off the production line and being delivered to customers in 2012, emails showed that Tesla employees were still concerned about the parts found leaking on the production line.\n  First, the aluminum Tesla chose to use for the end fitting of the cooling coil was susceptible to cracks and pinholes, according to tests done by the third-party firm IMR Test Lab in summer 2012. Business Insider reviewed these test results.\n Second, the design of the end-fitting piece in the cooling system was imperfect, such that even after the part was brazed together, there were gaps between the cooling coil and its end-fitting piece that connected it to the car, according to emails viewed by Business Insider. Sometimes, employees would have to force pieces together with a hammer to close gaps, according to internal Tesla documents viewed by Business Insider and a former Tesla employee.\n   Both of these design flaws had the potential to cause leaks in the cooling system, meaning that the battery coolant could spill into a car&#39;s battery pack. Tesla continued to find leaking cooling parts — referred to as bandoliers or cooling coils — on its production line through the end of 2012, according to internal Tesla documents viewed by Business Insider. It is unclear when Tesla changed the design to prevent leakage.\n The National Highway Transportation Agency is investigating whether Tesla Model S and Model X vehicles made between 2012 and 2019 had battery defects that could cause &#34;non-crash fires.&#34; This came after a number of Tesla customers filed a petition complaining about a Tesla software update that limited the range their cars could drive on a single charge. Tesla made the update after a series of fires in 2019.\n   &#34;Tesla is using over-the-air software updates to mask and cover-up a potentially widespread and dangerous issue with the batteries in their vehicles,&#34;  consumer attorney Edward Chen alleged in a petition he filed to the National Highway Traffic Safety Administration last year.\n Tesla has been dealing with  questions about the safety of its batteries for years. This is partly because the technology is new, and electric-vehicle fires are different from fires in traditional combustion engines. Because they&#39;re sparked by a chemical reaction, the fires can sometimes take  days to put out, re-sparking hours after emergency responders have left a scene. It&#39;s almost impossible to find the source of a fire once the battery has been destroyed. The fires can also start spontaneously. In 2019, fires randomly started in parked Teslas in garages in  San Francisco,  Hong Kong, and  Shanghai.\n Jason Schug, a vice president at Ricardo Strategic Consulting who spent part of his engineering career at GM and Ford, told Business Insider he&#39;s done teardowns of Tesla&#39;s Model S and Model X vehicles, which share the same battery, as well as its Model 3. He told Business Insider that if coolant leaked into a battery module, it could render the battery useless.\n &#34;When we disassembled the Tesla Model X, a technician accidentally spilled coolant in the battery pack, and it sat there for a long time,&#34; Schug said. &#34;There was no immediate danger, but when we removed the battery modules, quite a while later we found a lot of corrosion on the battery cells, and it was bad enough that some of the cells were leaking electrolyte. If this were to happen in the field and go unnoticed, it could result in bricking the battery.&#34;\n  Tesla did not respond to Business Insider&#39;s questions about its cooling system, batteries, or any possibility or impact of leaking fluid.\n Schug also said that while the battery coolant itself is not flammable, the residue it leaves behind once it evaporates can be. This doesn&#39;t go for just Tesla but for all-electric vehicles. In 2017,  BMW recalled 1 million vehicles for fire risk.\n &#34;There was an incident with another manufacturer that a vehicle that had been in a crash test spontaneously combusted weeks later,&#34; Schug said. &#34;Coolant had spilled in the battery during the crash, and when it evaporated, it left a residue which conducted electricity into a short circuit, which overheated the battery and triggered a fire.&#34;\n   All of this is to say that an electric battery&#39;s design must do everything possible to ensure coolant doesn&#39;t leak into the battery pack — at least not without notice. If it does, consequences can be incendiary. Tesla did not respond to Business Insider&#39;s questions about how it prevents leakage.\n  The promise of Tesla has been not only to make electric vehicles sexy but also to do so the Silicon Valley way — faster and cheaper than everyone else.\n So when it came time for Tesla to design the battery for the Model S, it looked to use parts that already existed so it could keep things simple. It settled on the 18-650 battery cell — a cell that it could buy off the shelf because it was already being manufactured for everyday use in things like laptops.\n To make a battery pack, thousands of these cells are grouped into over a dozen modules — the number depends on the battery&#39;s range.\n But there is an issue with having so many cells in the battery: If a single cell overheats, it can set off a chemical reaction called &#34;thermal runaway,&#34; in which other cells also then overheat and catch fire in an act of &#34;sympathetic detonation.&#34; This is why — as with the  case of the Tesla Model S that caught  fire while it was parked in a garage in Shanghai in 2019 — it takes only one overheated cell or module to start the chain reaction that leads to a fire.\n &#34;There are really only a few reasons why a lithium-ion battery catches on fire,&#34; Brock Archer, an auto-extrication and fire-rescue expert,  told Business Insider last year. Those reasons are &#34;liquid, dead short,&#34; or, for every one battery cell in 1 billion, &#34;spontaneous combustion,&#34; he said.\n Tesla was keenly aware of these issues with electric-battery chemistry, explaining in detail the steps its design was taking to mitigate this risk in a  battery patent filed in 2009. That is why — according to one former senior employee involved with the battery&#39;s design who spoke with Business Insider on the condition of anonymity for fear of retaliation — cell chemistry and battery structure were the company&#39;s main design concerns, cost aside.\n  The cell chemistry of the battery had to be precise to enable the car to reach long range and high speeds. And the car itself had to be designed to protect the battery at all costs in the event of a crash. This is because even a small amount of damage to a battery cell has the potential to set off this chain reaction, also known as &#34;cellular propagation,&#34; when a temperature surge in one causes a chain reaction.\n   Because of the speed with which Tesla was going through the manufacturing process, it sometimes asked third-party suppliers to do research and development for the company, a former employee who left the company in 2018 said. Three former Tesla employees and two suppliers told Business Insider that this arrangement was not without friction. According to them, Tesla was sometimes dismissive of third-party suggestions, asked for more work than it paid for, and pushed suppliers to ramp up production volume at breakneck speed. These people, whose identities Business Insider verified, spoke on the condition of anonymity for fear of retaliation.\n As Tesla&#39;s need for battery modules grew, so did its need for cooling coils. In the initial Model S battery design, the aluminum cooling coils wound around the battery modules and connected to the car using end fittings.\n &#34;When you&#39;re launching a new component, there&#39;s always going to be difficulties and issues on line during first launch and especially when you&#39;re Tesla and you&#39;re asking your vendors to launch with a limited R&amp;D,&#34; a former employee who left in 2014 said. &#34;We did have problems with it leaking.&#34;\n  By the time Tesla started workshopping issues with the Model S&#39;s cooling coils, the car&#39;s launch was already behind schedule. In his book &#34; Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future,&#34; Ashlee Vance said that in an effort to get cars out of the factory as quickly as possible, Musk pulled employees from all parts of the business — from recruiting to the design studio — to sell as many cars as possible as fast as possible.\n  According to documents viewed by Business Insider, a few cooling coils were sent to a lab called IMR Test Labs in upstate New York in July 2012.\n  According to the IMR report, which was reviewed by Business Insider, the end fittings on the cooling coils did not meet chemical requirements for a regulation-strength aluminum alloy. A source close to the matter said the results were shared with Tesla, but the Model S cars kept rolling out of the factory. According to  Tesla&#39;s 2012 third-quarter earnings report, the company delivered more than 250 Model S sedans.\n   In August 2012, the part was tested again. Tesla sent the part to Exponent, an engineering and scientific consulting firm. According to internal emails reviewed by Business Insider,  Tesla was concerned because the end fittings on the cooling coils were just not staying together and as such were a source of leakage. One Tesla employee described them as &#34;hanging by a thread&#34; in August 2012, according to internal emails viewed by Business Insider.\n The engineer who handled this at Exponent was a man named Scott Lieberman. He is now at LPI Inc. Lieberman declined to speak with Business Insider about this story. In internal emails between him and Tesla viewed by Business Insider, however, his opinion of the part was clear. He found defects — specifically, tiny pinholes that caused the leaks — on the tested materials after limited testing.\n Tesla continued to find leaking coils in various stages of production through the end of 2012, according to documents reviewed by Business Insider. Some were found late enough on the production line to be described as a &#34;critical quality issue,&#34; or were found to have leaked liquid into the battery pack, according to internal emails sent in October 2012, which were viewed by Business Insider. At this point, the problem had been flagged for senior management, documents indicate.\n In another email sent in September 2012, employees mentioned that workers on the production line sometimes had to use a hammer to get the end fittings to stay together.\n  The employee who left Tesla in 2014 said these issues were considered normal by Tesla standards. Unlike traditional automakers, Tesla didn&#39;t wait for new models to redesign parts. Instead, parts were constantly redesigned and deployed into vehicles, the employee said. On the other hand, the former employee also said the company had &#34;plenty of investigations and countermeasures&#34; to try to reduce leaks.\n Tesla did not respond to Business Insider&#39;s questions about its design process or the countermeasures it used to reduce leaks in this part.\n The former employee who left the company in 2014 said the bends in the aluminum &#34;made it more fragile&#34; and that the end fittings were still sometimes forced together as they rushed to make production goals, causing leaks.\n   &#34;We did find a few vehicles,&#34; the former employee said of cars that had leaks. &#34;I don&#39;t know exactly how many, but again that is what I would consider normal for a company that decides to launch with a limited amount of R&amp;D in the hopes of: &#39;We will launch with this, and we will put inspections in place that we catch it at the plant.&#39;&#34;\n  It is not at all how a design flaw would be dealt with at a traditional automaker, like Toyota, according to Jeffrey Liker, a professor of industrial and operations engineering at the University of Michigan. He&#39;s the author of &#34; The Toyota Way: 14 Management Principles from the World&#39;s Greatest Manufacturer.&#34;\n Liker said automakers like Toyota front-load their manufacturing process. They put a lot of resources in preparation by creating and stress testing prototypes for new parts and then having a pilot production period to catch any flaws before the manufacturing process begins in earnest. Of course, 80% of the parts in most Toyota vehicles are from previous designs. Tesla, on the other hand, was designing an entirely new car — a process referred to in the manufacturing world as &#34;clean-sheet design.&#34;\n And when you start with a clean sheet, you have a lot more room for the innovation Tesla has brought to the table, but also a much higher risk of design flaws or production problems, Liker said.\n &#34;Every part of the vehicle was breakthrough innovation, so it was almost guaranteed there would be serious production problems,&#34; Liker said. &#34;It&#39;s a trade-off, Musk could&#39;ve been more conservative, but then what would be his competitive advantage?&#34;\n  To try and understand how the company&#39;s production processes had changed since 2012, Business Insider reached out to three former Tesla employees who worked at the automaker at different times.\n While none of them were able to confirm the extent of issues with the cooling coil, they all said Tesla was still an incredibly fast-paced place to work and that designs were in constant flux.\n   &#34;Tesla is always driven by production, so sometimes if the issue isn&#39;t appearing for a customer, they&#39;ll just continue rolling out cars. It&#39;s as simple as that,&#34; an engineer who left the company in 2018 told Business Insider, referring to his general experience with the company.\n Another employee who spent over a decade working for NUMMI (the Fremont, California, factory jointly owned by Toyota and General Motors that Tesla purchased) and four years working for Tesla told Business Insider that his experience at Tesla was very different from his time at NUMMI.\n &#34;Toyota did not rush through things like Tesla did,&#34; the employee who left in 2017 said. The same employee also said that though parts were tested rigorously, the workers testing them did not receive the same extensive training they would receive at NUMMI. There simply wasn&#39;t time, and Tesla&#39;s Silicon Valley engineers didn&#39;t want to hear much about how things were done at NUMMI, the former employee said.\n &#34;When I was hired they said they didn&#39;t want to hear about NUMMI or Toyota. &#39;We&#39;re a high-tech company, not an auto company,&#39; they told me,&#34; the former employee said.\n The former employee said the frequent changes in design created disruptions in Tesla&#39;s supply chain — upsetting suppliers — and wasted money and materials.\n &#34;Engineers would make a modification or change or something, and they would switch over to that,&#34; they said. &#34;Then Tesla would have a truckload of products from the old style that they would waste ... that&#39;s how they run.&#34;\n All three former employees said disruptions in the supply chain were wasteful for the company. One employee who worked at Tesla during the Model S launch said the joke inside Tesla was &#34;that if you lined up the first maybe 10,000 Models S VINs, every single one would be different.&#34;\n    &#34;I think it&#39;s common in every auto company that vehicles are released with design flaws,&#34; the former employee said. &#34;It&#39;s called running design changes.&#34;\n Those design flaws, the former employee said, were what made room for Tesla&#39;s constant innovation at breakneck speed. Besides, the person said, Tesla&#39;s early adopters weren&#39;t really buying a car.\n &#34;It&#39;s my understanding that every customer back in 2012 was buying faith in Tesla. They weren&#39;t expecting a perfect car,&#34; the former employee said.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-06-27 16:44:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,设计,model,knew,电池", "title": "特斯拉知道其Model S电池存在可能导致火灾的设计缺陷", "title_en": "Tesla knew its Model S battery had a design flaw that could lead to fires", "transed": 1, "url": "https://www.businessinsider.com/tesla-faulty-battery-cooling-systems-design-model-s-2012-2019-6", "via": "", "real_tags": ["特斯拉", "设计", "model", "knew", "电池"]}, {"category": "", "categoryclass": "", "imagename": "c179a58af21f5c2eee9f7a133e01a061.jpg", "infoid": 1008571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "汽水巨头可口可乐公司(Coca-Cola Company)周五晚间宣布，从7月1日开始，该公司将暂停全球社交媒体平台上的所有数字广告至少30天。\n此举是反诽谤联盟、全国有色人种协进会(NAACP)和其他组织组织的对Facebook和Instagram的更广泛抵制活动的一部分，该活动被称为“为利润而停止仇恨”运动。可口可乐(Coca-Cola)比其中一些公司走得更远，在全球范围内禁止社交媒体平台上的所有广告，而不仅仅是Facebook和Instagram。这表明抵制活动也将冲击Twitter、YouTube和其他平台。\n“我们将让他们知道，我们希望他们有更大的责任感、行动和透明度。”\n“从7月1日开始，可口可乐公司将暂停全球所有社交媒体平台上的付费广告至少30天，”可口可乐公司首席执行官詹姆斯·昆西在该品牌网站上发布的一份声明中写道。“我们将利用这段时间重新评估我们的广告标准和政策，以确定是否需要在内部修改，以及我们应该对我们的社交媒体合作伙伴有什么更多的期望，以消除平台上的仇恨、暴力和不恰当的内容。我们将让他们知道，我们希望他们有更大的责任感、行动和透明度。“。\n今天早些时候，联合利华加入了Verizon的行列，成为参与抵制活动的两家最大的公司，在可口可乐介入之前，Facebook首席执行官马克·扎克伯格也宣布了一系列政策变化，虽然没有明确回应抵制活动，但似乎是为了试图解决该公司最近面临的许多批评，这些批评包括缺乏节制的暴力威胁、仇恨言论，以及唐纳德·特朗普总统发布的错误信息和其他有争议的账户和页面。\n“这延续了包括联合利华(Unilever)和威瑞森(Verizon)在内的大品牌承诺至少在7月份暂停Facebook广告的显著趋势，”抵制活动的组织者之一、进步非营利性组织“改变的颜色”(Color Of Change)在一份声明中写道。自从Color of Change及其合作伙伴，包括ADL和NAACP于6月17日发起这项活动以来，已有100多个品牌签署了这项活动。“。Change of Change总裁拉沙德·罗宾逊(Rashad Robinson)周五表示，巧克力品牌好时(Hershey‘s)也将加入抵制行动。\n还有一条--@Hersheys加入了#StopHateForProfit的行列。@Facebook可以实施民权基础设施，也可以牺牲他们的底线。https://t.co/KmUAKstnSl。\n-Rashad Robinson(@rashadrobinson)2020年6月26日\n然而，尽管抵制活动可能会给Facebook和Instagram带来一波负面新闻，但即使是主要广告商暂停广告支出一个月也不太可能对Facebook的利润产生实质性影响，因为该公司的大部分广告收入来自中小企业的直接回应广告。\n“我们每年投入数十亿美元来维护我们社区的安全，并不断与外部专家合作，审查和更新我们的政策，”Facebook的一位发言人今天早些时候在回应联合利华的声明时告诉NBC新闻。“我们知道我们还有更多的工作要做，我们将继续与民权组织、GARM和其他专家合作，开发更多的工具、技术和政策来继续这场斗争。”\nFacebook没有立即回复就可口可乐决定置评的请求。\n上周发起的停止仇恨牟利活动，从北脸(North Face)和巴塔哥尼亚(Patagonia)等流行的运动和户外生活方式品牌开始。在获得冰淇淋品牌本&杰瑞和电影发行商木兰花影业的支持后，它在美国主流企业中获得了推动力。在昨天发布的一封公开信中，ADL提供了更具体的细节，说明抵制活动试图改变Facebook的政策，以及它对温和的态度。\n“今天，我们要求所有企业与我们最根深蒂固的自由、平等和正义的美国价值观站在一起，不要在7月份在Facebook的服务上做广告，”本周早些时候在“洛杉矶时报”(Los Angeles Times)刊登的一则停止仇恨牟利运动的广告中写道。“让我们向Facebook发出一个强有力的信息：你的利润永远不值得宣扬仇恨、偏执、种族主义、反犹太主义和暴力。”", "note_en": "The Coca-Cola Company is pausing all digital advertising on social media platforms globally for at least 30 days starting July 1st, the soda giant announced on Friday evening.\n The move is part of a broader boycott of Facebook and Instagram organized by the Anti-Defamation League, the NAACP, and other organizations called the  “Stop Hate For Profit” campaign. Coca-Cola is going one step further than some of those companies and banning all ads globally on social media platforms, not just Facebook and Instagram. That would suggest the boycott will hit Twitter, YouTube, and other platforms as well.\n “We will let them know we expect greater accountability, action and transparency from them.”\n “Starting on July 1, The Coca-Cola Company will pause paid advertising on all social media platforms globally for at least 30 days,” reads a  statement from Coca-Cola Company CEO James Quincey posted to the brand’s website. “We will take this time to reassess our advertising standards and policies to determine whether revisions are needed internally, and what more we should expect of our social media partners to rid the platforms of hate, violence and inappropriate content. We will let them know we expect greater accountability, action and transparency from them.”\n Earlier today,  Unilever joined Verizon as the  two largest companies participating in the boycott prior to Coca-Cola’s involvement Facebook CEO Mark Zuckerberg also announced a series of policy changes that, while not explicitly in response to the boycott,  appear designed to try and address many of the criticisms the company has faced of late regarding its lack of moderation of violent threats, hate speech, and misinformation posted by President Donald Trump and other controversial accounts and pages.\n “This continues a significant trend of major brands — including Unilever and Verizon — committing to pause Facebook ads for at least the month of July,” reads a statement from progressive nonprofit Color of Change, one of the organizers of the boycott. “Since Color Of Change and its partners, including the ADL and NAACP, launched the campaign on June 17, over 100 brands have signed on.” Color of Change President Rashad Robinson said on Friday that chocolate brand Hershey’s is also joining the boycott.\n And another one -  @Hersheys is joining the push to  #StopHateForProfit.  @Facebook can either implement a civil rights infrastructure or sacrifice their bottom line.  https://t.co/KmUAKstnSl\n— Rashad Robinson (@rashadrobinson)  June 26, 2020\n Yet while the boycott may be creating a wave of bad press for Facebook and Instagram, it’s unlikely even major advertisers pausing ad spending for one month will have a substantial effect on Facebook’s bottom line, as a majority of the company’s ad revenue comes from direct-response ads from small and medium-sized businesses.\n “We invest billions of dollars each year to keep our community safe and continuously work with outside experts to review and update our policies,” a Facebook spokesperson told NBC News earlier today in response to Unilever’s announcement. “We know we have more work to do, and we’ll continue to work with civil rights groups, GARM, and other experts to develop even more tools, technology and policies to continue this fight.”\n  Facebook did not immediately respond to a request for comment regarding Coca-Cola’s decision.\n The Stop Hate For Profit campaign launched last week, starting with popular sports and outdoor lifestyle brands like The North Face and Patagonia. It has since gained steam with mainstream corporate America after picking up support from ice cream brand Ben &amp; Jerry’s and film distributor Magnolia Pictures. In an  open letter posted yesterday, the ADL provides more concrete details regarding the changes the boycott seeks to produce in Facebook’s policies and its approach to moderation.\n “Today, we are asking all businesses to stand in solidarity with our most deeply held American values of freedom, equality and justice and not advertise on Facebook’s services in July,” read an ad the Stop Hate For Profit campaign ran in the  Los Angeles Times earlier this week. “Let’s send Facebook a powerful message: Your profits will never be worth promoting hate, bigotry, racism, antisemitism and violence.”", "posttime": "2020-06-27 16:44:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络平台,cola,facebook", "title": "可口可乐刚刚威胁网络平台要“除掉……。不恰当的内容“", "title_en": "Coca-Cola just threatened online platforms to “rid ... inappropriate content”", "transed": 1, "url": "https://www.theverge.com/2020/6/26/21305065/coca-cola-pause-ads-facebook-social-platforms-july-boycott", "via": "", "real_tags": ["网络平台", "cola", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "739de31e2a020d0f2e88e26e19d71346.jpg", "infoid": 1008570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英格兰、苏格兰和波兰的科学家说，DNA和RNA是支撑所有地球生物的两种主要现代遗传密码形式，在这里出现生命之前，它们可能在我们的星球上以严格的配对共存。研究人员利用一种基于氰化氢的化学系统来模拟地球早期历史的条件，制造了四个碱基，即遗传字母表的分子“字母”。这些碱基串在一起，形成基因序列，细胞可以将其翻译成蛋白质。但令人惊讶的是，研究小组发现，在他们的实验一贯制造的四个碱基中，有两个是在DNA中发现的形式，而另外两个是在RNA中发现的那种形式。\n这项研究发表在“自然”杂志上，由英国剑桥医学研究理事会分子生物学实验室的约翰·萨瑟兰(John Sutherland)和他的同事进行，进一步削弱了所谓的RNA世界假说。这一观点长期以来一直是生命起源研究中最突出的观点之一，它认为早在DNA和其他对生命重要的分子出现之前，RNA就已经形成了地球生物圈的基础。然而，到目前为止，几乎没有证据表明该想法的僵化版本所采用的RNA排斥系统或可能导致DNA的化学途径。“人们倾向于认为RNA是DNA的母体，”萨瑟兰说。“这(论文)表明他们是分子兄弟姐妹。”\n然而，其他没有参与这项研究的科学家质疑这条以氰化氢为基础的路线使用的条件是否可信。法国国家科学研究中心位于奥尔良的分子生物物理中心的外部生物学小组主任弗朗西丝·韦斯特尔(Frances Westall)指出，形成这些基地需要非常特殊的条件。混合物需要干燥并暴露在紫外线下-这两个障碍在陆地上最容易克服，在40亿多年前我们星球被海洋覆盖的早期，陆地上的陆地供不应求。“这些条件在早期的地球上肯定存在，”韦斯特尔说。“它们不会那么常见，因为没有那么多裸露的陆地。”尽管她补充说，这项研究“很聪明”，“并不是完全不可能的”，但她总结说，“关于生命和益生菌分子出现的地点，还有其他更好的假设。”\n自20世纪50年代初美国研究人员斯坦利·米勒(Stanley Miller)和哈罗德·尤里(Harold Urey)进行了一项里程碑式的实验以来，关于合理性的争论一直困扰着这项以化学为基础的探索，以了解地球上生命的起源。这两个人通过在装有氢、水、氨和甲烷的烧瓶中触发放电，模拟了早期地球大气和海洋中闪电的影响。尽管他们的实验产生了对生物化学至关重要的相当大的有机分子，但几十年来，其他研究人员一直在争论其条件的似是而非。然而，米勒和尤里的工作表明，制造重要物质相对简单，比如连接在一起形成蛋白质的氨基酸，这些蛋白质在活细胞内执行多种功能。与生命起源研究特别相关的是，蛋白质可以充当催化剂，增强和加速其他化学反应，否则这些化学反应可能会太慢或太低而不可能发生。但蛋白质并不是地球上生命兴起背后唯一可能的催化剂。\n在最终获得1989年诺贝尔化学奖的工作中，分子生物学家西德尼·奥尔特曼(Sidney Altman)和生物化学家托马斯·切赫(Thomas Cech)发现，RNA-长期以来一直被认为只是遗传信息的中间载体，仅次于DNA-也可以起到催化剂的作用。RNA世界假说表明，这些分子可以自我复制，使DNA和蛋白质出现之前的早期进化成为可能。然而，萨瑟兰说，这个想法“是对一项辉煌发现的过度热情、过度热情的回应”。\n这种反应可能部分是因为，对于一个天真的化学家来说，从RNA跳到DNA看起来很容易。为了创造我们经常看到的缠绕成DNA标志性双螺旋的长链，碱基首先连接到糖分子的“主干”上。这些组合组成了核苷：DNA中的脱氧核糖核苷酸和RNA中的核糖核苷-与它的DNA表亲不同，RNA形成一个单一的螺旋。核苷不使用食糖或蔗糖，而是RNA中的核糖和DNA中的脱氧核糖(不同的糖赋予每种物质第一个字母)。这两种糖之间的区别很小：只有一个氧原子和一个氢原子。然而，这种差异足以让DNA和RNA具有不同的生物学作用。生物化学去除原子远比简单地擦除笔记本上代表它们的字母要难得多。\nRNA世界想法的另一个缺陷是，在可能存在于地球早期的条件下制造核糖，然后将其连接到碱基上是困难的。因此萨瑟兰和他的同事们寻求\n萨瑟兰说，这种安排“表明制造RNA和DNA的化学成分并不像人们想象的那样不同”。“人们倾向于认为RNA出现在DNA之前，然后以某种方式被接管。对我来说，这表明你有可能拥有RNA-DNA杂交体，然后可能产生两个不同的分子。“。然而，萨瑟兰的团队尚未将单个核苷和核糖核苷组装成更长的链。这样做很重要，因为证明杂交链可以真正形成并结合到伙伴链上，这对于推动这个想法超越猜测是至关重要的。\n对于没有参与这项研究的佐治亚理工学院生命起源研究员尼古拉斯·胡德(Nicholas Hud)来说，这是一个关键问题。他称这是一本关于水基核苷合成的“极好的有机化学研究汇编”。但胡德并不相信这篇论文解决了这些核苷是否真的出现在生物之前。他自己的研究表明，在RNA之前，氨基酸可能已经连接起来携带信息并充当催化剂。HUD认为，进化将在很长一段地质时间内逐渐产生目前的遗传系统。他说：“如果一个分子从化学的角度看起来很难制造，但它在生物学中的功能却很精致，那么它很可能是随着时间的推移而进化出来的。”出于同样的原因，他也对RNA世界假说持怀疑态度。\n此外，胡德认为这项新研究依赖于严格的增量步骤，每个步骤都是在严格的顺序和严格控制的条件下进行的，这是一个重大的弱点。胡德说，如果步骤的顺序改变了，或者某些产品没有被分离出来，萨瑟兰和他的同事们就会少制造他们感兴趣的物质。这一警告降低了在早期地球混乱的环境中发生这种情况的可能性。\n萨瑟兰承认，如果没有时光机让我们回到地球上生命的真正起源，在这个稀有的研究领域，“似是而非就是一切”。即便如此，他还是坚定地支持他的团队在建立通往生命基石的化学路线方面所做的工作。萨瑟兰断言：“有很多很多的手指指向氰化氢。”“这能证明这一切都是氰化氢造成的吗？这并不能证明这一点。但对我来说已经足够好了。“", "note_en": "DNA and RNA, the two major modern forms of genetic code underpinning all of earthly biology, could have coexisted in strict pairings on our planet before life arose here, scientists in England, Scotland and Poland say. Using a hydrogen cyanide–based chemical system intended to mimic conditions in Earth’s early history, the researchers made four bases, the molecular “letters” of the genetic alphabet. Strung together, these bases form gene sequences that cells translate into proteins. But surprisingly, the team found that of the four bases their experiments consistently made, two were in a form found in DNA, whereas the other two were of a kind seen in RNA.\n  The study, published in  Nature and  conducted by John Sutherland of the Medical Research Council Laboratory of Molecular Biology in Cambridge, England, and his colleagues, further undermines the so-called RNA world hypothesis. This idea, long one of the most prominent in origins-of-life research, posits that RNA formed the basis of Earth’s biosphere long before DNA and other molecules important to life  emerged. Yet to date, scant evidence has been found of chemical pathways to make the RNA-exclusive system that rigid versions of the idea adopt or that could lead to DNA. “People have tended to think of RNA as the parent of DNA,” Sutherland says. “This [paper] suggests that they are molecular siblings.”\n  Other scientists who were not involved with the study question the plausibility of the conditions used in this hydrogen cyanide-based route, however. Frances Westall, director of the exobiology group at the French National Center for Scientific Research’s Center for Molecular Biophysics in Orléans,  notes that forming the bases requires very specific conditions. Mixtures would need to dry out and be exposed to ultraviolet light—two hurdles most easily surmounted on dry land, which was in short supply during our planet’s ocean-covered early days more than four billion years ago. “These conditions certainly existed on the early Earth,” Westall says. “They would not have been that common because there was not that much exposed landmass.” Although she adds that the study is “clever” and “not completely impossible,” she concludes that “there are other, better hypotheses as to locations for the emergence of life and prebiotic molecules.”\n  Arguments about plausibility have plagued the chemistry-based quest to understand life’s beginnings on Earth since the early 1950s, when American researchers Stanley Miller and Harold Urey performed a landmark experiment. The pair simulated the effects of lightning in the early Earth’s atmosphere and ocean by triggering electrical discharges in flasks containing hydrogen, water, ammonia and methane. Although their experiment famously produced sizable organic molecules vital for biochemistry, for decades other researchers have debated the plausibility of its conditions. Nevertheless, Miller and Urey’s work showed that it was relatively simple to make important substances, such as the amino acids that link up to form proteins that perform myriad functions within living cells. Of particular relevance to origins-of-life studies, proteins can act as catalysts, enhancing and speeding up other chemical reactions that would otherwise be too slow or inefficient to plausibly occur. But proteins are not the only possible catalysts behind the rise of life on Earth.\n  In work that would ultimately net the 1989 Nobel Prize in Chemistry, molecular biologist Sidney Altman and biochemist Thomas Cech found that RNA—long considered merely an intermediate carrier of genetic information that is subservient to DNA—can also behave as a catalyst. The RNA world hypothesis suggests that such molecules could self-replicate, enabling early evolution before the existence of DNA and proteins. The idea, however, “was an overzealous, overenthusiastic response to a brilliant discovery,” Sutherland says.\n  That response might have come partly because, to a naive chemist, it looks easy to leap from RNA to DNA. To create the long chains we often see coiled up into the DNA’s iconic double helix, the bases are first connected to a “backbone” of sugar molecules. These combinations make up nucleosides: deoxyribonucleotides in DNA and ribonucleosides in RNA—which, unlike its DNA cousin, forms a single helix. The nucleosides do not use table sugar, or sucrose, but rather ribose in RNA and deoxyribose in DNA (the different sugars give each material its first initial). The distinction between the two sugar types is tiny: just one oxygen and one hydrogen atom. Yet that difference is enough for DNA and RNA to have distinct biological roles. And biochemically removing the atoms is far harder than simply erasing the letters representing them  in a notebook.\n  Another flaw in the RNA world idea has been the difficulty of making ribose in the conditions that probably existed on the early Earth—and to then connect it to a base. Sutherland and his colleagues therefore sought more likely ways to make ribose sugars and ribonucleosides. One of their most promising approaches relied on two gases thought to have been relatively abundant in the planet’s early atmosphere: hydrogen sulfide and hydrogen cyanide. When dissolved in water, bathed in ultraviolet light and subjected to cycles of drying, these simple compounds have produced many more complex molecules. They include amino acids and glycerol, the backbones of fatty molecules that can form cells’ outer wall.\n  Sutherland took this approach a step further last year. Working with Ramanarayanan Krishnamurthy’s team at the Scripps Research Institute in La Jolla, Calif., he and his colleagues showed that the ribonucleosides cytidine and uridine could be transformed into deoxyribose and the nucleoside and deoxyadenosine. Now—primarily via the efforts of team members Jianfeng Xu and Václav Chmela, both then at the  Laboratory of Molecular Biology—the researchers have made even more progress. They mixed some of the intermediate molecules from the team’s previous studies with salts such as sodium nitrite and magnesium chloride that could have been prevalent on the primordial Earth, then subjected them to acidic conditions and heat, respectively. Through these steps, the scientists found two possible routes to add a fourth base, the less common nucleoside inosine, to their preexisting collection. The addition was enough to make a four-letter genetic alphabet  in which each base in a strand would exclusively pair with one of the other three letters in a second strand  That base-pairing complementarity is how modern RNA and DNA works. But in the experiment, two letters came from RNA, and two came from DNA.\n  The arrangement “suggests that the chemistry to make RNA and DNA isn’t as different as people have thought,” Sutherland says. “People have tended to think of RNA coming before DNA and somehow then being taken over. This, to me, is suggesting that it’s possible that you could have had an RNA-DNA hybrid, which could then give rise to the two separate molecules.” Sutherland’s team has not yet assembled the individual nucleosides and ribonucleosides into longer chains, however. Doing so is important, because showing that hybrid strands can really form and bind to a partner strand is crucial for moving the idea beyond speculation.\n  This is a key issue for Nicholas Hud, an origins-of-life researcher at the Georgia Institute of Technology, who was not involved in the study. He calls it an “excellent compilation of organic chemistry research” on water-based nucleoside synthesis. But Hud is not convinced that the paper resolves whether these nucleosides actually arose before living creatures. His own research suggests amino acids could have linked up to carry information and act as a catalyst before RNA. Hud thinks evolution would then have gradually produced the current genetic system over long stretches of geologic time. “If a molecule looks very difficult, from a chemical perspective, to make, yet it functions exquisitely in biology, then it’s probably the case that it has been evolved over time,” he says. For the same reasons, he is also skeptical about the RNA world hypothesis.\n  Furthermore, Hud sees the new study’s reliance on rigid incremental steps, each performed in strict order and under carefully controlled conditions, as a significant weakness. If the order of the steps changed or certain products were not isolated, Sutherland and his colleagues would have made much less of the substances they are interested in, Hud says. That caveat reduces the chances of the scenario unfolding in the chaotic environs of the early Earth.\n  Sutherland admits that, absent a time machine to travel back to life’s true origins on our planet, “plausibility is everything” in this rarefied field of research. Even so, he firmly backs his team’s work on establishing chemical routes to life’s building blocks. “There are many, many fingers pointing at hydrogen cyanide,” Sutherland asserts. “Does it prove that it all happened from hydrogen cyanide? It doesn’t prove it. But it’s good enough for me.”", "posttime": "2020-06-27 16:23:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可能,earth,dna", "title": "地球上的第一个基因可能是杂交种", "title_en": "The First Gene on Earth May Have Been a Hybrid", "transed": 1, "url": "https://www.scientificamerican.com/article/the-first-gene-on-earth-may-have-been-a-hybrid/", "via": "", "real_tags": ["可能", "earth", "dna"]}, {"category": "", "categoryclass": "", "imagename": "a0b6066d06e281252766d0e769c77f30.jpg", "infoid": 1008569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，美国在全国范围内记录了近40,000例新的新冠肺炎病例-这是流感大流行期间最高的单日总数-许多州继续看到疾病传播的惊人上升。\n据“纽约时报”的新冠肺炎追踪报道，30个州的病例一直在增加。据华盛顿邮报报道，周五，11个州创下了过去七天内报告的平均新病例数量的自己的纪录。\n尽管病例数量的上升有时会反映出总体检测的上升，但许多州也看到阳性检测的比例很高，而且还在不断增加-即检测结果呈阳性的比例，这被认为是评估疾病传播是否真的在增加的一个更有用的衡量标准。如果各州增加检测，而新冠肺炎的传播保持不变或下降，检测结果呈阳性的比例将逐渐下降。\n在周五的新闻发布会上，副总统迈克·彭斯(Mike Pence)指出，现在有16个州的新病例每天都在增加，阳性检测率也在增加。\n目前，21个州和波多黎各的7天平均阳性率超过5%-世界卫生组织建议这个门槛来确定何时开始重新开放是安全的。受影响最严重的州包括亚利桑那州，阳性率为23%，德克萨斯州和佛罗里达州，阳性率约为13%。\n周五，佛罗里达州报告了创纪录的近9000例病例，而德克萨斯州周四报告了近6000例。这两个州都重新实施了封锁措施，包括限制酒吧和餐馆。随着住院率飙升，德克萨斯州的一些地区正在努力照顾新冠肺炎患者。\n尽管有严峻的数字和趋势，彭斯在周五的新闻发布会上采取了乐观的语气。作为一个国家，副总统说，“我们减缓了扩散，我们拉平了曲线，我们拯救了生命。”\n虽然他承认一些州正在与飙升的病例作斗争，但他强调了在检测能力、治疗和医护人员防护装备供应方面的改进。\n彭斯说：“当我们看到新的病例在上升，我们正在非常仔细地跟踪它们时，美国人民可能会有一种倾向，认为我们回到了两个月前的那个地方，我们正处于美国人民遭受巨大损失和巨大困难的时期。”“现实情况是，我们的处境要好得多。”\n彭斯还指出，虽然病例在增加，但死亡人数在减少。他指出，对重病患者的治疗和护理已经有所改善，许多新病例出现在35岁以下的人身上-他们患严重疾病和死亡的风险较低。\n但传染病专家表示，现在庆祝还为时过早，许多人预计未来几周死亡人数将会攀升。其中包括传染病专家安东尼·福奇博士，他是联邦冠状病毒工作组的成员。\n在周二的国会证词中，福奇回答了一个问题，即死亡人数的下降是否可以归因于这种疾病现在主要在更年轻、更健康的人中传播。\n他回答说：“我认为现在就把它联系起来还为时过早。”“死亡总是远远落后于病例。”他补充说，即使病例发生在可能没有感染这种疾病的年轻人身上，它们也可能会继续感染更多的脆弱人群，这些人可能会继续死于感染。\n到目前为止，美国已有240多万例新冠肺炎病例，近125,000人死亡。", "note_en": "The US logged nearly 40,000 new cases of COVID-19 nationwide Thursday—the highest daily total yet in the course of the pandemic—and many states continue to see an alarming rise in the spread of disease.\n Cases have been increasing in 30 states, according to the New York Times’ COVID-19 tracking effort. On Friday,  11 states set their own records for the average number of new cases reported in the past seven days, according to the Washington Post.\n Though the rising case counts can sometimes reflect a rise in overall testing, many states are also seeing high and increasing percentages of positive tests—that is, the fraction of test results that come back positive, which is considered a more useful metric for assessing if disease spread is actually increasing. If states increase testing while the spread of COVID-19 stays the same or declines, the fraction of tests coming back positive would gradually decline.\n In a press briefing Friday, Vice President Mike Pence noted that there are now 16 states that are seeing both a rising number of new cases each day and increasing rates of positive tests.\n Currently 21 states and Puerto Rico have a 7-day average  positive rate above 5 percent—a threshold that the World Health Organization has recommended to determine when it’s safe to begin reopening. The hardest hit states include Arizona, which has a 23 percent positive rate, and Texas and Florida, which have about a 13 percent positive rate.\n Florida reported a record of nearly 9,000 cases Friday while Texas reported nearly 6,000 on Thursday. Both states have reinstituted lockdown measures, including restrictions on bars and restaurants.  Some areas of Texas are struggling to care for COVID-19 patients as hospitalization rates surge.\n  Despite the grim figures and trends, Pence took an upbeat tone in the press conference Friday. As a country, the vice president said, “We slowed the spread, we flattened the curve, we saved lives.”\n Though he acknowledged that some states were struggling with skyrocketing cases, he highlighted improvements in testing capacity, treatments, and supplies of protective gear for healthcare workers.\n “As we see the new cases rising—and we’re tracking them very carefully—there may be a tendency among the American people to think that we are back to that place that we were two months ago, that we’re in a time of great losses and great hardship on the American people,” Pence said. “The reality is we’re in a much better place.”\n Pence also noted that though cases are increasing, deaths are decreasing. He noted that treatment and care have improved for severely ill patients and many new cases are seen in people under 35—who are at less risk of developing severe disease and dying.\n But infectious disease experts say it’s too early to celebrate and many expect the deaths will climb in the weeks to come. That includes infectious disease expert, Dr. Anthony Fauci, who is a member of the federal coronavirus task force.\n In Congressional testimony Tuesday, Fauci fielded a question about whether the decline in deaths could be attributed to the disease mainly spreading in younger, healthier people now.\n “ I think it’s too early to make that kind of link,” he replied. “Deaths always lag considerably behind cases.” He added that even if the cases are in younger people who may not suffer with the disease, they may go on to infect more vulnerable people, who may go on to die from the infection.\n So far, there have been  more than 2.4 million cases of COVID-19 in the US and nearly 125,000 deaths.", "posttime": "2020-06-27 16:22:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,肺炎,rise,病例", "title": "美国日志一天内记录4万例新冠肺炎病例，专家准备迎接死亡人数上升", "title_en": "US logs record 40K COVID-19 cases in a day as experts brace for rise in deaths", "transed": 1, "url": "https://arstechnica.com/science/2020/06/us-logs-record-40k-covid-19-cases-in-a-day-as-experts-brace-for-rise-in-deaths/", "via": "", "real_tags": ["美国", "肺炎", "rise", "病例"]}, {"category": "", "categoryclass": "", "imagename": "8a7316ea3ea72bc0c234e87de47be8ca.jpg", "infoid": 1008566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中一家-一家成立两年、有13人的洛杉矶初创公司，名为Airvet-不出所料地认为自己是其中最好的，而且它已经说服了投资者同样多的东西。今天，该公司将宣布1400万美元的首轮融资，由Canvas Ventures牵头，E.Ventures、Burst Capital、Starting Line、TrueSight Ventures、Hawke Ventures和Branket Capital以及个人投资者参与。\n普通合伙人丽贝卡·林恩(Rebecca Lynn)表示，大流行对Canvas的决定起到了一定作用，一个聪明的模式也是如此。她说，在过去11年里，她研究过许多远程医疗初创公司，在为生活在自己小农场的动物使用这项服务后，她爱上了AirVet。另外，“COVID已经成为采用的巨大推动剂。”\n我们要求Airvet的创始人兼首席执行官布兰登·沃伯(Brandon Werber)单独向我们阐述公司的情况。\nBW：我爸爸是美国最知名的兽医之一--杰夫·沃伯博士。我们看到了远程医疗对人类世界的影响，并希望为我们的宠物带来同样的机会和水平的护理。自从我在宠物领域长大以来，我非常了解这一点，并认识到在提供护理方面存在许多效率低下的问题，以及兽医如何无法满足宠物主人不断变化的期望。\nBW：我们有两个应用程序。一种是供宠物主人下载以与兽医交谈，另一种是供兽医下载以组织工作流程和与客户交谈。我们不篡改任何现有的兽医关系。取而代之的是，我们与兽医诊所合作，使他们能够进行远程医疗访问，同时使宠物主人能够全天候接触兽医，即使他们不住在兽医医院附近。\n在美国，很大一部分宠物主人甚至没有初级兽医。对于像手术这样严重的健康问题，动物仍然需要亲自去，网络兽医甚至可以推荐它们。我们还看到Airvet被用作路边签到，宠物主人可以在那里通过停车场的直播视频聊天，并跟踪他们宠物的面对面兽医预约。\nTC：我知道每次参观最低收费是30美元。你如何让这种模式在经济上为退伍军人服务？\nBW：兽医们认为我们是他们基本收入之外的额外创收工具。我们不雇兽医。我们的2600多名退伍军人网络在很大程度上是在他们自己的医院内使用Airvet的退伍军人。他们可以像优步司机一样随意决定在线刷卡，成为点播网络的一部分，并接听全国任何地方宠物父母的电话，以创造额外的收入。\nBW：在我们之前出现的所有初创公司都不是消费者至上的，只专注于为兽医开发工具，所以他们的平台并不是每个宠物主人都能使用的。取而代之的是，它们只能由自己的兽医使用该特定平台的宠物主人使用，而这只是兽医的一小部分，因此也是宠物父母的一小部分。\nTC：你们有附属业务吗？除了这些兽医拜访之外，你们还卖别的什么吗？\nBW：目前，根据兽医和专业的不同，只有兽医就诊，最低30美元，最高30美元。随着时间的推移，我们已经有了扩展到其他宠物健康垂直市场的计划和合作伙伴关系。\n预计到2020年，仅在美国，就将在宠物身上花费990亿美元，而对我们来说，远程医疗只是个开始。\nBW：没有。我们提供了工作流层，使兽医能够安排虚拟预约，很快就可以与他们现有的系统和工作流完全集成。\nBW：没有时间限制，病例通常会开放整整三天，所以宠物父母可以继续通过聊天联系兽医，询问任何后续问题或担忧。\nBW：我们的目标是与医院并肩工作，而不是与它们竞争或取代它们。你不能虚拟采血，感觉不到肿瘤，也不能做牙科检查。人们总是需要去看兽医。\n我们想要做的是帮助(宠物主人)了解什么时候(进来)。宠物父母平均每年只去看兽医1.5次。在AirVET上，有很大一部分用户已经与兽医建立了6倍以上的联系，这样做可以节省时间和压力。\n这不是为了我们而竞争，而是在办公室访问期间(并帮助)使用过我们服务的宠物父母最终避免不必要的紧急访问。", "note_en": "One of these — a two-year-old, 13-person, LA-based startup called  Airvet — unsurprisingly thinks it is the best among the bunch, and it has persuaded investors of as much. Today, the company is announcing $14 million in Series A funding led by Canvas Ventures, with participation by e.ventures, Burst Capital, Starting Line, TrueSight Ventures, Hawke Ventures and Bracket Capital, as well as individual investors.\n The pandemic played a role in Canvas’s decision, as did a smart model, suggests general partner Rebecca Lynn, who says she has looked at many telemedicine startups over the last 11 years and that she fell for Airvet after using the service for the animals that live on her own small farm. Plus, “COVID has been a massive accelerant to adoption.”\n  We asked Airvet’s founder and CEO, Brandon Werber, to make the company’s case to us separately.\n  BW: My dad is one of the most well-known vets in the U.S. — celebrity vet Dr. Jeff Werber. We saw the impact that telehealth was making in the human world and wanted to bring the same access and level of care we get for ourselves to our pets. Since I grew up in the pet space, I know it intimately and recognized a lot of inefficiencies in the delivery of care and how vets have been unable to meet the evolving expectations of pet owners.\n  BW: We have two apps. One is for pet-owners to download to talk with a vet, and one is for vets to download to organize workflows and talk to their clients. We do not usurp any existing vet relationships. Instead, we partner with vet clinics and enable them to conduct telehealth visits and simultaneously enable pet-owners to have access to vets 24/7, even if they don’t live nearby a vet hospital.\n A huge portion of pet owners in the U.S. don’t even have a primary vet. For serious health issues like surgery, animals still need to go in-person, and network vets can even refer them. We’ve also seen Airvet used as curbside check-in, where pet-owners can chat and follow their pet’s in-person vet appointment via live video from the parking lot.\n TC: I see there is a minimum charge of $30 per visit. How do you make this model work financially for vets?\n BW: Vets view us as an additional revenue-generating tool on top of their base income. We don’t hire vets. Our network of 2,600+ vets are largely the same vets who use Airvet within their own hospital. They can decide at will, like an Uber driver, to swipe online to be part of the on-demand network and take calls from pet parents anywhere in the country to generate additional income.\n  BW: All the startups that came before us are not consumer-first and are just focused on building tools for vets, so their platforms cannot be used by every pet owner. Instead, they can only be used by pet owners whose own vets use that specific platform, which is a tiny fraction of vets and therefore a tiny fraction of pet parents.\n TC: Do you have ancillary businesses? Beyond these vet visits, are you selling anything else?\n BW: For now, just the vet visits, which range from a $30 minimum to higher, based on the vet and specialty. Over time, we have plans and partnerships lined up to expand into other pet health verticals.\n A projected $99 billion will be spent on pets in the U.S. alone in 2020, and for us, telemedicine is only the beginning.\n  BW: No. We provide the workflow layer enabling vets to schedule virtual appointments, which will soon be able to be fully integrated with their existing systems and workflows.\n  BW: There is no time limit and cases will usually stay open for three full days, so pet parents can continue to access the vet via chat for any follow-up questions or concerns.\n  BW: Our goal is to work alongside the hospitals, not to compete with them or replace them. You can’t take blood virtually or feel a tumor or do a dental. People always will need to go to the vet.\n What we want to do is help [pet owners] understand when [to come in]. The average pet parent only goes to the vet 1.5 times a year. A huge segment of users on Airvet have already connected with a vet six times more than that and save time and stress in doing so.\n It’s not about competing for us, it’s about being the provider of care in between office visits [and helping] pet parents who have used our service ultimately avoid an unnecessary emergency visit.", "posttime": "2020-06-27 16:21:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "医疗,telehealth,兽医", "title": "\n远程医疗兽医平台AirVET刚刚争取到了1400万美元的首轮融资", "title_en": "\n\t\t\t\tAirvet, a telehealth veterinary platform, just clawed its way to a $14 million Series A round\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/airvet-a-telehealth-veterinary-platform-just-clawed-its-way-to-a-14-million-series-a-round/", "via": "", "real_tags": ["医疗", "兽医"]}, {"category": "", "categoryclass": "", "imagename": "9a5d31d2a3b85fb1e30ad92a50f28932.jpg", "infoid": 1008565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨日，Agora将1750万股票定价为每股20美元，高于每股16至18美元的目标区间。该公司在上市首日筹集了350美元，约为2020年第一季度营收的10倍，目前资本充足，鉴于其适度的现金消耗是一个持续的问题，该公司实际上已经永远走上了跑道。\n但是，尽管首次亮相取得了成功，但看到Agora的股价上涨得如此之快，并不是所有人都喜欢。比尔·格利(Bill Gurley)是一名风险资本家，经常批评传统的IPO过程，因此与这一特定策略有利害关系的人也加入了进来：\n非常令人惊讶的是，这个星球上有一个涉及数亿美元的财务演习，甚至可以不达到实际最终结果的50%。在这一点上，这一过程是如此受到操纵/破坏。他们错过的比最初的猜测还多。#market定价pic.twitter.com/MqmmYRum3ZM。\n让我来翻译一下。Gurley感到恼火--至少在某种程度上是正确的--因为Agora以每股45美元的价格开盘，该公司的首次公开募股(IPO)定价太高了。我们的意思是，该公司不应该以20美元的价格出售其IPO股票，而应该是以45美元的价格出售，这是市场迅速重新定价的价值。\n由于45美元是20美元的两倍多，它的银行家们“错过的比他们最初的猜测还要多。”考虑到该公司出售的股票数量，错误定价可能价值高达4.375亿美元！\n这一论点有其可取之处，但它并不像看起来那样完美无缺。与上市公司的首席执行官们聊天，他们会告诉你拥有稳定、稳定、长期的股权股东是多么重要。比方说，你可能会在路演中遇到这些人，然后投资于你的首次公开募股(IPO)股票。\n这些群体-科技人士声称非常喜欢的长期投资者-可能比交易员急于在最近的首次公开募股中找到上行空间的势头更有价格意识。也就是说，人们更有可能持有股票的时间更短。\n因此，如果你想要长期股东，你可能不得不将IPO的价格定在交易开始后市场最初可能承受的价格之下。\n尽管如此，见鬼的每股20美元还没有接近45美元。格利说得有道理。\n变革可能即将到来。Agora新闻又回到了纽约证券交易所(一家美国交易所)正在做的事情上。即试图想出一种让公司直接上市的方法(只需开始交易，不定价或筹集新资本)，并筹集资金。这消除了Gurley上面强调的问题。至少在理论上是这样。\n显然，如果这种模式成为可能，而且长期投资者愿意以略有不同的方式购买股票，那么对于伟大的公司来说，新方法将远远优于旧方法。什么样的公司在上市第一天就被烧毁的最多？我认为它是最有吸引力的，或者说被炒作的公司。\n那些将进行最具吸引力的IPO的公司将使用新的方法，留下-什么？让碎屑走老式的路吗？信号问题比比皆是！", "note_en": "Yesterday  Agora priced 17.5 million shares at $20 apiece, up from its target range of $16 to $18 per share. The firm raised $350 in its debut, or around 10 times its Q1 2020 revenue and is now amply capitalized and has runway for effectively forever, given its modest cash consumption as an ongoing concern.\n But while the debut was a success, seeing Agora’s share price rise as quickly as it did was not universally popular. Regular critic of the traditional IPO process  Bill Gurley — a venture capitalist, so someone with a stake in this particular gambit — weighed in:\n  Pretty amazing that there is a financial exercise on this planet involving hundreds of millions of dollars where its OK to not even get to 50% of the actual end result. The process is so rigged/broken at this point. They missed by more than the original guess.  #marketpricing  pic.twitter.com/MqmmYRw3ZM\n Let me translate. Gurley is irked — rightly, to at least some degree — that as Agora opened at $45 per share, the company’s IPO was awfully priced. By that we mean that the company  should have sold its IPO shares not at $20, but at $45, the value at which the market quickly repriced them.\n As $45 is more than twice $20, its bankers “missed by more than [their] original guess.” Given the number of shares the company sold, the mis-pricing could be worth up to $437.5 million!\n There’s merit to this argument, but it’s not as complete a slam dunk as it might appear. Chat with CEOs of public companies and they will tell you about how important it is to have steady, stable, long-term shareholders of their equity. Those you might, say, meet on a roadshow and get to invest in your IPO shares.\n Those groups — the long-term investors that tech folks claim to love so dearly — are likely a bit more price conscious than the momentum traders eager to find upside in recent debuts. That is, folks more likely to hold onto shares for a shorter period of time.\n So, if you want long-term shareholders, you may have to price you IPO under the price the market may initially bear once trading begins.\n   Still, holy  shit $20 per share is not close to $45. Gurley has a point.\n  Change may be coming. The Agora news rotates back to what the NYSE, an American exchange,  is doing. Namely trying to come up with a way to let companies direct list (to just start trading, sans pricing or raising new capital), and raise capital. This gets rid of the issues that Gurley highlighted above. At least in theory.\n Obviously, if that model becomes possible and long-term investors are willing to pay for shares in a slightly different manner, the new method will be far superior than the old  for companies that are great. What sort of companies get burned from first-day pops the most? I reckon it’s the most attractive, or hyped companies.\n The companies that would make the most attractive IPOs would use the new method, leaving — what? The detritus to go out the old-fashioned way? Signaling issues abound!", "posttime": "2020-06-27 16:20:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "agora,starts,可能", "title": "\nAgora上市之初股价上涨了一倍多，达到每股50美元。", "title_en": "\n\t\t\t\tAgora starts life as a public company by more than doubling to $50 a share\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/agora-starts-life-as-a-public-company-by-more-than-doubling-to-50-a-share/", "via": "", "real_tags": ["agora", "starts", "可能"]}]