[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用两种方法查找每个CVE的PoC：检查是否有任何一种方法指向使用ffuf和关键字列表的PoC\n如上所述，该存储库中的几乎所有内容都是自动生成的。我们仔细设计了工作流程（并继续开发），以确保结果尽可能准确。\n观察存储库，以便在新POC上市后立即收到通知。\n搜索特定产品（可能还有版本）以查找与之相关的所有公开漏洞。\n欢迎所有的贡献/想法/建议！通过GitHub issues或在us@trick3st上推特创建一张新票。\n我们相信修补的价值；千篇一律的解决方案很少能解决这个问题。在trickest上注册演示。com来根据您的用例自定义此工作流，访问更多工作流，或者从头开始构建自己的工作流！", "note_en": "Find PoCs for each CVE using 2 techniques: Check if any of them points to a PoC using  ffuf and a list of keywords\n As described, almost everything in this repository is generated automatically. We carefully designed the workflow (and continue to develop it) to ensure the results are as accurate as possible.\n  Watch the repository to receive notifications about new PoCs as soon as they go public.\n Search for a specific product(s) (and possibly version) to find all public exploits related to it.\n  All contribtutions/ideas/suggestions are welcome! Create a new ticket via  GitHub issues or tweet at us  @trick3st.\n  We believe in the value of tinkering; cookie-cutter solutions rarely cut it. Sign up for a demo on  trickest.com to customize this workflow to your use case, get access to many more workflows, or build your own from scratch!", "posttime": "2022-02-17 12:20:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cve", "title": "几乎所有公开的CVE PoC", "title_en": "Almost every publicly available CVE PoC", "transed": 1, "url": "https://github.com/trickest/cve", "via": "", "real_tags": ["cve"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如我之前所说，PyFL是我们其他人的函数式编程。（可在pyflang.com上找到。）\nPyFL现在有类型检查功能——没有类型声明。相反，类型是通过在类型域上评估程序而生成的。\n在PyFL中，所有普通人觉得困难或完全奇怪的事情都消失了：单子、强制咖喱、后置或前缀符号、模式匹配等，而不是函数应用的中缀符号和f（x，y，z）语法。这种奇怪的东西有它的支持者，但PyFL证明它并不是函数式编程的固有组成部分。\n尤其是繁琐、冗长的类型声明。在Haskell的大多数编程示例中，都是从这些声明开始的。在PyFL中，你跳过了这个阶段。\n这并不意味着你可以在没有听说的情况下对字符串进行乘法。PyFL是动态类型的，并在运行时检查计算是否合理。\n然而，运行时计算意味着您必须实际运行程序才能找到这些类型的错误——并且幸运地遇到它们。他们不一定每次都会暴露自己。\n正如一位退休的专业人士所指出的，你可能会发布该软件，然后会有成千上万的用户与动态类型检查器发生冲突。\n因此，仍然需要进行静态分析以避免运行时错误。需要编译时类型检查。\n但是如何在没有类型声明的语言中进行类型检查呢？我真的不想再加上它们——那将是对“为我们其余人”原则的一次大倒退。\n幸运的是，有一个解决方案——类型推断。这意味着在不打扰程序员的情况下，分析程序并推断出至少一些类型。\na+f（b），其中a=4；b=a+9；f（n）=如果n&lt；2然后1其他3*f（n-1）+1 fi；终止\n很明显，a是一个整数，因此b也是。这些事实源于两个整数之和是整数的基本类型规则。不需要声明b:int。\nf（b）似乎也是一个整数，尽管在这个阶段还不清楚你将如何正式证明它。这就是我们要解决的问题。\n推断类型与计算类似，只是放弃了实际数据，而是合并了类型。使用这样的规则\nint+int=intnum+int=numint*int=intint/int=numnum&lt；num=boolif bool然后int else int fi=int\n当然你会失去信息；特别是，您不知道将选择条件的哪一个分支。这意味着计算递归程序是有问题的，因为它们使用条件来触发终止。\n请注意，此类型方案同时包含int（整数）和num（数字）。注意int也是数字，例如。。g、 num+int=num。这里int是num的子类型。还有两个其他子类型：intlist是numlist的子类型，而numlist又是list的子类型。intlist的头是int，numlist的尾是numlist，依此类推。\n实现这种偏序需要大量的编码，我没有使用单独的stringlist和wordlist类型，更不用说listlist了。我写了一个函数sb（p，q）来测试p是否是q的一个子类型，以及一个函数lub（p，q）来给出p和q的最小上界。\n显然，我的领域远远没有达到模仿Haskell类型声明的细微差别所必需的水平。例如，在Haskell中，可以将变量声明为整数列表。我需要一个无限偏序。但它适用于范围广泛的程序，并捕捉到范围广泛的错误。\n因此，我提出的计划是使用PyFL计算器并对其进行修改，这样它就不会产生程序输出的实际数据，而是输出通过在抽象类型域上“运行”程序而产生的类型。这是抽象解释的基本思想，对我来说很难有独创性。\n该方案的优点之一是，它不仅避免了程序员类型声明，还避免了函数类型。这是上面给出的程序的高阶变体\na+f（b），其中db（g）=λ（x）g（g（x））结束；inc（u）=u+2；f=db（公司）；a=4；b=5；终止\n它的计算结果为int，尽管涉及二阶函数db。\n递归的问题在于，计算不会终止。这让我有一段时间感到困惑。\n当使用通常的计算器运行时，它会迅速给出正确的答案5040。当if-then-else fi最终选择第一个备选方案时，递归终止。但是当使用类型计算器运行时，if条件仅仅是bool，必须探索这两种选择。这导致无限递归，python运行时堆栈溢出，出现分段错误，python崩溃。不用说，没有生成类型信息\n与此同时，我向evaluator添加了度量，以查看生成了多少计算。其中一个指标是调用评估函数的次数。这些添加内容被转移到仅适用于替代类型的评估器中。\n最后，我意识到，我可以通过在这个指标上设置一个上限来强制终止——比如30。我可以看到结果是什么，然后增加上限，看看新的结果，再次增加上限，直到一切都安定下来。\n这比我预想的还要好。我在pylucid中计算维度的类似方案上进行了尝试，结果发现即使是cap的小值也给出了正确的答案。\n这里的难题是，这个方案似乎显而易见，但我从未在印刷品中见过。或者任何关于如何在替代域上求值时避免非终止的讨论。然而，在另一个领域进行评估是抽象解释的基本思想。如果有人有任何见解，请与我分享。\n所以我把evaluate函数的调用次数设为30次。结果证明30是一个很大的数字，我本来可以用一个小得多的帽子逃脱，但那又怎样？\n现在，当我运行类型计算器时，它会快速停止并生成…int，正确。它成功地推断出整数的阶乘是整数。没有程序员的输入。\n问题是，当一个评估被限制时，它会返回什么？我猜它应该返回类型域的底部元素。由于还没有一个底层元素，我添加了一个：类型none。类型none不是任何数据对象的类型。如果将一个类型视为一个集合（该类型的所有对象的集合），则“无”是空集。\n我必须制定出无条件计算的规则。由于none是num的子类型，它可以作为num，所以我们有规则none+num=num（以及none+none=none）\n同样，如果我们计算f（x，y）并且f计算为无，结果应该是无。我承认这是猜测，但它给出了正确的答案。\n这需要重写sb和lub，这变得相当复杂。如果我想扩展我的领域，我必须想出更系统的方法。\n阶乘程序之所以有效，是因为PyFL（和Haskell）内置了递归，计算器在定义fac的相同环境中评估fac的定义。但如果递归不是内置的呢？我们还能定义阶乘吗？这就是lambda演算（没有内置递归）开发人员面临的问题。\n起初，这似乎不太可能。但后来库里发明了Y组合器。给你\n它只是一个小的表达式，具有神奇的性质，Yf减少到f（Yf）。它在PyFL符号中有一个很好的定义，即\n在这种形式下，很容易看出它是有效的。我们用g代替方程中的x，得到g（g）=f（g（g））。\n式中Y（f）=g（g），其中g（x）=f（x（x））结束；a（f）=λ（n）如果n&lt；2然后1否则n*f（n-1）fi结束；fac=Y（a）；终止\n请注意，这个程序是非递归的：没有直接或间接地定义变量本身。\n这个程序不能用Haskell编写。它使用无法键入的自我应用程序。显然，我们可以用Haskell编写阶乘，但不是这样。我们必须求助于Haskell的内置递归，比如定义Y（f）=f（Y（f））。\n然后问题出现了，PyFL的类型检查呢？当我们评估这个项目的类型时会发生什么？\n说实话，我不确定这是否管用。但是现在回想起来，如果PyFL可以处理Y在整数上的定义，为什么不能在类型上呢？", "note_en": "As I’ve said before, PyFL is functional programming for the rest of us. (It’s available at  pyflang.com.)\n PyFL now has type checking – without type declarations. Instead the type is produced by evaluating the program over the domain of types.\n   In PyFL gone are all the things that ordinary people find difficult or downright weird: monads, mandatory currying, post- or prefix notation, pattern matching, etc. Instead infix notation and  f(x,y,z) syntax for function application. The weird stuff has it’s proponents but PyFL proves it’s not inherently part of functional programming.\n Gone in particular are cumbersome, verbose type declarations. In most examples of programming in Haskell it all begins with these declarations. In PyFL you skip this stage.\n That doesn’t mean you can e.g. multiply strings without hearing about it. PyFL is dynamically typed and checks at runtime if calculations make sense.\n However runtime calculations mean you have to actually run the program to find these type errors – and be lucky enough to encounter them. They won’t necessarily reveal themselves every time out.\n As one retired professional pointed out, you may release the software and then have tens of thousands of users running afoul of the dynamic type checker.\n So there’s still a need for static analysis to avoid runtime errors. A need for compile time type checking.\n But how do you type check a language with no type declarations? I really don’t want to add them – that would be a big retreat from the “for the rest of us” principle.\n Fortunately there’s a solution – type inference. That means analyzing the program and deducing at least some of the types, without bothering the programmer.\n  a + f(b) where a = 4; b = a+9; f(n) = if n&lt;2 then 1 else 3*f(n-1)+1 fi; end\n it’s obvious that  a is an integer, and from that that  b is as well. These facts follow from the basic type rule that the sum of two integers is an integer. There is no need for a declaration  b:int.\n It also appears that  f(b) is an integer although at this stage it’s not clear how you would formally justify it. That’s the problem we’ll solve.\n Inferring a type is like calculation except you discard the actual data and combine types instead. Using rules like\n int + int = intnum + int = numint * int = intint / int = numnum &lt; num = boolif bool then int else int fi = int\n Of course you lose information; in particular, you don’t know which arm of a conditional will be selected. This means evaluating recursive programs is problematic because they use conditionals to trigger termination.\n  Notice that this type scheme has both  int (integer) and  num (numeric). And notice that  int is also numeric, e..g.  num+int=num. Here  int is a subtype of  num. There are two other subtypes:  intlist is a subtype of  numlist which in turn is a subtype of  list. The head of an  intlist is an  int, the tail of a  numlist is a  numlist, and so on.\n Implementing this partial order required a lot of coding and I skipped having separate  stringlist and  wordlist types, not to mention  listlist. I wrote a function  sb(p,q) which tests if  p is a subtype of  q, and a function  lub(p,q) which gives the least upper bound of  p and  q.\n Clearly my domain falls far short of that necessary to imitate the fine distinctions of Haskell type declarations. For example, in Haskell you can declare a variable to be a list of lists of integers. I’d need an infinite partial order. But it works on a broad range of programs and catches a broad range of errors.\n  So the plan I came up with is to take the PyFL evaluator and modify it so that instead of producing the actual data output by a program, it outputs the types produced by ‘running’ the program over the abstract domain of types. This is the basic idea of abstract interpretation and is hardly original with me.\n One of the advantages of this scheme is that not only does it avoid programmer type declarations, it avoids function types. Here is a higher order variant of the program given above\n a + f(b)where db(g) = lambda (x) g(g(x)) end; inc(u) = u+2; f = db(inc); a = 4; b = 5;end\n It evaluates to  int, in spite of the involvement of the second order function  db.\n  The problem with recursion is that the evaluation doesn’t terminate. This stumped me for a while.\n   When run with the usual evaluator, it quickly gives the correct answer, 5040. The recursion terminated when the  if-then-else-fi finally selected the first alternative. But when running with the type evaluator, the  if condition was merely  bool and both alternatives had to be explored. This resulted in an infinite recursion, the python runtime stack overflowed, there was a segmentation fault and python crashed. Needless to say, no type information was produced\n In the meantime I’d added metrics to the evaluator, to see how much computation was generated. One of these metrics was the number of calls to the evaluation function. These additions were carried over to the alternate types-only evaluator.\n Finally it dawned on me that I could force termination by putting a cap on this metric – say, 30. I could see what the result was, then increase the cap, look at the new result, increase the cap again, until everything settled down.\n This worked even better than I expected. I tried it on a similar scheme for  computing dimensionalities in pylucid and it turned out even small values of the cap gave correct answers.\n The puzzle here is that this scheme seems obvious yet I’ve never seen it in print. Or any discussion of how you avoid nontermination while evaluating over an alternate domain. Yet evaluating over an alternate domain is the basic idea of abstract interpretation. If anyone has any insight, please share with me.\n So what I did was set a cap of 30 on the number of calls to the evaluate function. It turned out that 30 is a lot and I could have gotten away with a much smaller cap, but so what?\n Now, when I run the type evaluator, it quickly halts and produces …  int, correct. It has succeeded in deducing that the factorial of an integer is an integer. Without programmer input.\n  The question arose, what does an evaluation return when it’s throttled? I guessed that it should return the bottom element of the type domain. Since there wasn’t a bottom element (yet) I added one: the type  none. The type  none is not the type of any data object. If you think of a type as a set (the set of all objects of that type), then  none is the empty set.\n I had to work out the rules for calculating with  none. Since  none is a subtype of, say,  num, it can function as a  num, so we have the rule  none+num=num. (And  none+none=none.)\n Also if we are evaluating  f(x,y) and  f evaluates to  none, the result should be  none. I admit this was guesswork but it gives the right answers.\n This required rewriting  sb and  lub, which got fairly complex. If I want to expand my domain I’ll have to come up with something more systematic.\n  The factorial program works because recursion is built in to PyFL (and Haskell), the evaluator evaluates the definition of  fac in the same environment that it’s defined. But what if recursion wasn’t built in?Could we still define factorial? This was the problem facing the developers of the lambda calculus (which doesn’t have built-in recursion).\n At first it seemed unlikely. But then Curry invented the Y combinator. Here it is\n  It’s just a small \\-expression with the magic property that Yf reduces to f(Yf). It has a rather nice definition in PyFL notation, namely\n  In this form it’s easy to see that it works. We substitute g for x in the equation and get g(g) = f(g(g)).\n  fac(7) where Y(f) = g(g) where g(x) = f(x(x)) end; a(f) = lambda (n) if n&lt;2 then 1 else n*f(n-1) fi end; fac = Y(a); end\n  Note that this program is nonrecursive: no variable is defined directly or indirectly in terms of itself.\n This program cannot be written in Haskell. It uses self application which can’t be typed. Obviously we can write factorial in Haskell, but not this way. We have to resort to Haskell’s built-in recursion, say with the definition  Y(f) = f(Y(f)).\n Then the question arises, what about PyFL’s type checking? What happens when we evaluate the type of this program?\n  To be honest, I wasn’t sure this would work. But in retrospect, if PyFL can handle the definition of Y over the integers, why not over types?", "posttime": "2022-02-17 12:12:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "类型,checking", "title": "作为计算的类型检查", "title_en": "Type Checking as Calculation", "transed": 1, "url": "https://billwadge.com/2022/02/16/type-checking-as-calculation/", "via": "", "real_tags": ["类型", "checking"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "介绍", "note_en": "Introduction", "posttime": "2022-02-17 12:12:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,security,介绍", "title": "增强了Microsoft Edge的安全性", "title_en": "Enhanced Security for Microsoft Edge", "transed": 1, "url": "https://microsoftedge.github.io/edgevr/posts/Introducing-Enhanced-Security-for-Microsoft-Edge/", "via": "", "real_tags": ["microsoft", "security", "介绍"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数实时人体姿势估计方法都基于检测关节位置。使用检测到的关节位置，可以计算肢体的偏航和俯仰。然而，由于无法观察到旋转轴，因此无法计算沿肢体的滚动，这对于运动分析和计算机动画等应用至关重要。因此，在本文中，我们引入了方向关键点，这是一种仅使用单帧RGB图像估计骨骼关节完整位置和旋转的新方法。受运动捕捉系统如何使用一组点标记来估计整个骨骼旋转的启发，我们的方法使用虚拟标记生成足够的信息，通过简单的后处理精确推断旋转。旋转预测将关节角度的最佳报告平均误差提高48%，并在15次骨骼旋转中达到93%的准确性。该方法还将MPJPE在principle数据集上测量的关节位置的最新结果提高了14%，并在野外数据集中很好地推广到了。\n@文章{Fisch2021OKPS，作者{Martin Fisch and Ronald Clark}，期刊{IEEE模式分析与机器智能交易}，标题{6D人体姿势估计的方向关键点}，年份{2021}，月份{12月}", "note_en": "Most realtime human pose estimation approaches are based on detecting joint positions. Using the detected joint positions, the yaw and pitch of the limbs can be computed. However, the roll along the limb, which is critical for application such as sports analysis and computer animation, cannot be computed as this axis of rotation remains unobserved. In this paper we therefore introduce orientation keypoints, a novel approach for estimating the full position and rotation of skeletal joints, using only single-frame RGB images. Inspired by how motion-capture systems use a set of point markers to estimate full bone rotations, our method uses virtual markers to generate sufficient information to accurately infer rotations with simple post processing. The rotation predictions improve upon the best reported mean error for joint angles by 48% and achieves 93% accuracy across 15 bone rotations. The method also improves the current state-of-the-art results for joint positions by 14% as measured by MPJPE on the principle dataset, and generalizes well to in-the-wild datasets.\n    @article{Fisch2021OKPS, author = {Martin Fisch and Ronald Clark}, journal = {IEEE Transactions on Pattern Analysis &amp; Machine Intelligence}, title = {Orientation Keypoints for 6D Human Pose Estimation}, year = {2021}, month = {dec}}", "posttime": "2022-02-17 12:11:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "姿势,pose,估计", "title": "用于6D人体姿势估计的方向关键点", "title_en": "Orientation Keypoints for 6D Human Pose Estimation", "transed": 1, "url": "https://r0nn13.github.io/okps-project/", "via": "", "real_tags": ["姿势", "pose", "估计"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你需要一个工具来跟踪自己网站的搜索引擎优化过程，SeoCheklist是为你准备的。只需创建检查表并按照任务进行操作。你没有&#39；我不需要成为这方面的专家。SeoChecklist会告诉你该做什么以及如何做。\n让你的客户轻松遵循SEO流程！向你的客户提供实时报告，看着他们对你的工作感到满意！这将增加他们对你的信任，让你以闪电般的速度经营业务。\n与您的团队轻松管理SEO流程！确保你的客户对你的作品印象深刻！每个人都会谈论你是什么样的团队！", "note_en": "If you need a tool to track the SEO process of your own site, SeoCheklist is for you. Just create the checklist and follow the tasks. You don&#39;t need to be an expert for this. SeoChecklist will tell you what to do and how.\n Let your customers follow the SEO process easily! Provide real-time reports to your clients and watch them be satisfied with your work! This will increase their trust in you and enable you to run your business at lightning speed.\n Easily manage SEO processes with your team! And make sure your customers are impressed with the work you have created! Everyone will be talking about what kind of team you are!", "posttime": "2022-02-17 12:10:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "优化,seo", "title": "搜索引擎优化清单——300个预先添加的详细搜索引擎优化任务", "title_en": "SEO Checklist – 300 Pre-added detailed SEO tasks", "transed": 1, "url": "https://seochecklist.dev/", "via": "", "real_tags": ["优化", "seo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家为Netflix、Snap和Hashicorp等公司提供应用程序状态管理系统的初创公司已经筹集了1.03亿美元的B系列资金，以帮助该公司扩张。\n该公司声称，对其帮助大规模管理应用程序工作流的平台的需求强劲。\n最近一轮融资由Index Ventures牵头，其他投资者也参与了种子基金和A系列基金，分别由Amplify Partners和红杉资本牵头。这带来了暂时的&#39；自2019年成立以来，该公司的资金总额已达到1.28亿美元，并将该公司的后期估值定为15亿美元。\n时间和#39；s技术被描述为微服务编排平台，使开发人员能够在不牺牲生产力或可靠性的情况下构建可扩展的应用程序。它已经被用于解决Netflix、Snap、Box、Hashicorp、Coinbase等公司的状态管理难题。Netflix显然选择了Temporal作为其下一代持续集成和持续交付（CI/CD）开发者服务的基础平台。\n自A系列融资以来，Temporal也从开发开放源代码平台转向添加基于Temporal Cloud的商业模型，这是一种开放源代码Temporal服务器的完全管理云产品。\n据Temporal首席产品官Charles Zedlewski称，开发该平台的目的是解决开发人员在构建可伸缩的云本地应用程序时面临的挑战。\n&#34;人们发现&#39；这是为这种应用程序付出的代价；泽德莱夫斯基告诉记者。\n&#34;要付出的代价是复杂的组合，因为我有更多的移动部分要考虑和因素当我和39；我在写我的申请，而且不可靠。因为我有更多的活动部件，任何一件事情可能出错或行为不一致的可能性都会不断增加。所以每个人都想要所有这些好处，但如果他们能帮助的话，他们宁愿不支付这些费用，&#34；他说。\n根据Temporal，其系统的一个方面是抽象了分布式系统的复杂性。这些通常是无状态服务、数据库、cron作业和队列的混合体，随着它们的扩展，响应多个异步事件和跟踪所有事物的状态变得越来越困难。Temporal有效地将所有这些都作为平台的一部分，并自行处理。\nZedlewski声称，通过在时态中开发应用程序并使用时态运行，开发人员最终得到了一个云架构的应用程序，但它比以前可靠得多。\n在时态中，应用程序由一组时态工作流执行组成。每个工作流执行对其本地状态具有独占访问权限，并与所有其他工作流执行并发执行，通过消息传递与它们和外部世界环境通信。该公司表示，这些工作流执行旨在实现轻量级，消耗很少的资源，因此一个临时应用程序可能包含数百万或数十亿个工作流执行。\n该公司表示，开发人员使用临时SDK以他们选择的编程语言编写应用程序代码，而临时平台处理应用程序的持久性、可用性和可伸缩性。当前的SDK用于TypeScript、Go、Java和PHP。\nTemporal由Maxim Fateev和Samar Abbas创立，他们在AWS领导简单工作流的设计和开发，并设计了其他关键业务项目。\n&#34;萨马尔和我15年前在亚马逊看到的挑战与今天几乎所有公司面临的挑战是一样的；法蒂耶夫在一份声明中说&#34;现在，普通的业务应用程序跨越数十个有状态的服务器和服务，这对于灵活性和可扩展性非常好，但它&#39；s还使应用程序变得越来越脆弱，难以进行故障排除或增强&#34;\n泽德莱夫斯基声称，泰晤士报已经看到&#34；指数增长#34；到目前为止，该平台采用了开源版本&#34;我们&#39；在公司的整个生命周期中，我们的平均月复合增长率约为25%。这将持续到今年，&#34；他说。®", "note_en": "A startup that provides application state management systems for Netflix, Snap, and Hashicorp, among others, has raised $103m in Series B funding to help the company expand.\n The firm claims to be seeing strong demand for its platform that helps to manage application workflows at scale.\n The latest bout of funding has been led by Index Ventures, joined by other investors that took part in the seed funding and Series A funding, which were led by Amplify Partners and Sequoia Capital respectively. This brings Temporal&#39;s total funding since incorporation in 2019 to $128m and puts the firm on a post-money valuation of $1.5bn.\n   Temporal&#39;s technology is described as microservice orchestration platform that enables developers to build scalable applications without sacrificing productivity or reliability. It is already in use to solve state management challenges at companies such as Netflix, Snap, Box, Hashicorp, Coinbase, and others. Netflix has apparently chosen Temporal as the platform upon which to base its next-generation continuous integration and continuous delivery (CI/CD) developer service.\n     Since the Series A funding, Temporal has also moved from developing an open-source platform to adding a commercial model based on Temporal Cloud, a fully managed cloud offering of the open-source Temporal Server.\n According to Temporal chief product officer Charles Zedlewski, the challenges that the platform was developed to solve are the same developers face when building scalable, cloud-native applications.\n   &#34;What people find is that there&#39;s a price to pay for that kind of application,&#34; Zedlewski told  The Register.\n &#34;The price to pay is a combination of complexity, as I have many more moving parts to consider and factor in when I&#39;m writing my application, and unreliability. Because I have many more moving parts, the chances that any one thing could be going wrong or behaving inconsistently keep going up and up and up and up. So everybody wants all these benefits, but would rather not pay that cost if they can help it,&#34; he said.\n According to Temporal, one of the aspects of its system is that it abstracts the complexity of a distributed system. These are often a mixture of stateless services, databases, cron jobs, and queues, and as they scale, responding to multiple asynchronous events and tracking the state of everything becomes more and more challenging. Temporal effectively makes all these part of the platform and takes care of them itself.\n   By developing an application in Temporal and running it with Temporal, developers end up with a cloud-architected application, but one that is much more reliable than before, Zedlewski claimed.\n  In Temporal, an application is comprised of a set of Temporal Workflow Executions. Each Workflow Execution has exclusive access to its local state and executes concurrently to all other Workflow Executions, communicating with them and the external world environment via message passing. These Workflow Executions are intended to be lightweight, consuming few resources, and so a Temporal Application may consist of millions or billions of Workflow Executions, the firm said.\n Developers use a Temporal SDK to write application code in their chosen programming language, while the Temporal Platform handles the durability, availability, and scalability of the application, the firm said. Current SDKs are for TypeScript, Go, Java, and PHP.\n Temporal was founded by Maxim Fateev and Samar Abbas, who led the design and development of Simple Workflow at AWS and have since architected other business-critical projects.\n &#34;The challenges Samar and I saw at Amazon 15 years ago are the same challenges in front of almost every company today,&#34; Fateev said in a statement. &#34;The average business application now lives across dozens of stateful servers and services, which has been great for flexibility and scale, but it&#39;s also made applications increasingly brittle and difficult to troubleshoot or enhance.&#34;\n Zedlewski claimed that Temporal has seen &#34;exponential growth&#34; so far in the adoption of the open-source version of the platform. &#34;We&#39;ve averaged about 25 per cent month-on-month compounded growth, through the life of the company. And that continues into this year,&#34; he said. ®", "posttime": "2022-02-17 12:04:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "temporal,应用程序", "title": "Temporal在B系列融资中筹集1.03亿美元", "title_en": "Temporal raises $103M in Series B funding", "transed": 1, "url": "https://www.theregister.com/2022/02/16/temporal_103m_funding/", "via": "", "real_tags": ["temporal", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "表观遗传钟已被视为评估衰老的有力工具。然而，它们应用中的一个主要缺点是我们缺乏对机械原理的理解。我们假设，由于表观遗传时钟是多因素的复合物，因此很难揭示潜在的生物学特性：它们由不同的部分组成，每个部分都有自己的因果机制和功能后果。因此，只有通过解构表观遗传时钟信号，才有可能收集生物学见解。在这里，我们使用多组织和体外数据集将5717个时钟CpG聚集成12个不同的模块。我们表明，表观遗传时钟由不同比例的模块组成，这可能解释了在给定研究中同时应用时它们的不一致性。我们还观察到，表观遗传重编程不会重置整个时钟，相反，观察到的再生是由一部分模块驱动的。总的来说，两个模块以其独特的功能而脱颖而出。第一种是对表观遗传重编程最敏感的基因之一；是全因死亡率的最强预测因子；随着离体传代时间的延长，衰老负担开始显现。第二光模块对重新编程有适度的响应；与正常组织相比，在肿瘤中速度非常快；即使在种群倍增速度减慢的情况下，也会在体外进行传代。总的来说，我们表明时钟解构可以识别独特的DNAm改变，并促进我们对表观遗传时钟的机械理解。", "note_en": "Epigenetic clocks have come to be regarded as powerful tools for estimating aging. However, a major drawback in their application is our lack of mechanistic understanding. We hypothesize that uncovering the underlying biology is difficult due to the fact that epigenetic clocks are multifactorial composites: They are comprised of disparate parts, each with their own causal mechanism and functional consequences. Thus, only by deconstructing epigenetic clock signals will it be possible to glean biological insight. Here we clustered 5,717 clock CpGs into twelve distinct modules using multi-tissue and in-vitro datasets. We show that epigenetic clocks are comprised of different proportions of modules, which may explain their discordance when simultaneously applied in a given study. We also observe that epigenetic reprogramming does not reset the entire clock and instead the observed rejuvenation is driven by a subset of modules. Overall, two modules stand-out in terms of their unique features. The first is one of the most responsive to epigenetic reprogramming; is the strongest predictor of all-cause mortality; and shows increases with in vitro passaging up until senescence burden begins to emerge. The light-second module is moderately responsive to reprogramming; is very accelerated in tumor vs. normal tissues; and tracks with passaging in vitro even as population doublings decelerate. Overall, we show that clock deconstruction can identify unique DNAm alterations and facilitate our mechanistic understanding of epigenetic clocks.", "posttime": "2022-02-17 11:41:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,遗传,epigenetic,时钟", "title": "解构衰老、疾病和重编程中的表观遗传时钟信号", "title_en": "Deconstructing the Epigenetic Clock Signals in Aging, Disease, and Reprogramming", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/2022.02.13.480245v1", "via": "", "real_tags": ["编程", "遗传", "时钟"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一年左右，我&#39；我一直在考虑在Bash中编写一个Minecraft服务器作为一种思维练习。我曾经用经典的协议（2009年的协议）尝试过，但我很快意识到没有&#39；这并不是在bash中正确解析二进制数据的一种方法。以下面的代码示例为例：\n函数a（）{read-n2 uwu echo&#34；$uwu&#34；|xxd}这将把两个字节读入一个变量，然后将它们传递给`xxd'，后者将显示数据的十六进制转储。\n一切&#39；很好，直到我们传递一个空字节（0x00）。Bash不仅忽略字符串中的空字节，还不忽略&#39；不提供任何方法来检测是否发生了空字节。考虑到第一号议定书&#39；我试图实现的是严格的二进制，这可能会严重损坏数据。\n一月底的一个雨夜，我&#39；我有一个启示。如果我颠倒了函数的顺序呢？如果二进制数据从未到达一个变量（或者更准确地说，是一个替换），只是停留在管道中，它能传递空字节吗？\n答案是肯定的！经过一些迭代之后，我决定使用'dd'传递给'xxd'，而不仅仅是'xxd'，因为这样我可以微调要读取的字节数。\n#$len变量在前面被赋值，基于一个类似的read function a=$（dd count=$len bs=1 status=none | xxd-p）这给了我一个十六进制字符串，我可以在这个字符串上进行模式匹配、模式替换、数据提取。。。还有更多。发送回复可以类似地进行，使用xxd和#39；s倒车开关。\n`ncat`用于收听Minecraft&#39；默认的TCP端口。它在收到传入连接后启动主shell脚本（`mc.sh`）。\n注意：以下部分主要是我在Bash中实现数字转换例程的漫谈；如果你对此不感兴趣，可以跳过它。\nMinecraft服务器要运行，首先应该实现的是服务器列表Ping数据包，而不是因为它&#39；这是必需的（见鬼，你的服务器无法正确回复，你仍然可以加入游戏），但因为它&#39；这是最容易解决的第一个问题。它有助于您熟悉核心协议概念，例如数据类型：\n大多数数据类型的实现都很简单，但有些数据类型比其他数据类型更让我头疼——尤其是IEEE754浮点数（稍后会有更多介绍），以及所谓的VarInt/VarLong数。那些人可能熟悉MQTT协议，因为他们&#39；我们只是LEB128编码的一个修改版本。\nLEB128是一种整数压缩方案。通过将一个字节拆分为1个信号位和7个数据位，该方案存储数字长度。如果第一位为0，则该字节为最后一位；除此之外，还有&#39；在这个字节之后是另一个字节。如果你的大多数数字在0到127之间或256到16383之间，那么这是一个很好的方案，否则就是&#39；“买一个字节，得到一个自由”的情况，因为本来可以放在一个字节中的数字会被一位推到下一个字节。\n#从src/int.sh#int2varint（int）函数int2varint（）{local a local b local c local out=$（printf&#39；%02x&#39；&#34；$1&#34；）如果[$1-lt 128]]；然后：以利夫[$1-lt 16384]；然后a=$（$1%128））b=$（$1/128））out=$（printf&#34；%02x&#34；$（a+128））$（printf&#34；%02x&#34；$b）elif[$1-lt$（128*128*128））；然后a=$（$1%128））c=$（$1/128）%128））b=$（$1/16384））out=$（printf&#34；%02x&#34；$（a+128））$（printf&#34；%02x&#34；$（c+128））$（printf&#34；%02x&#34；$b）fi echo-n&#34$出去&#34；}我&#39；我在将参考实现转换为Bash时遇到了问题，所以我使用了足够多的协议，从头开始编写自己的协议。我发现它基本上是一个挖沟机中的模和除法，我在上面的代码片段中利用了这一点。\n我对解码器采取了一种更现代的方法，使用AND，然后将结果相乘——类似于引用的方法。\nLEB128肯定不是&#39；它不是最难实现或最烦人的（这一个是IEEE754浮点）；我仍然不知道&#39；I don’我不喜欢它被散布在协议内部的随机位置，与常规整数（和长整数）交织，在某些情况下甚至是有符号的短整数。\n我&#39；我不是数学爱好者。当我看到Python发出的指数符号时，我尖叫着跑开了。这可能是我讨厌实现这些浮点转换器的主要原因。我赢了&#39；不要深入探讨这种格式的具体工作原理——相反，我建议你查看这个维基百科页面。\n基本实现需要一个循环，其中有&#39；对结果施加负幂；Bash没有&#39；我天生就不支持消极力量，这让我不得不去寻找一个能做到这一点的工具。\n我在DukDukEk中发现的一个建议是使用Perl，但我认为这是作弊。或者，尝试使用“bc”，但似乎要么没有&#39；根本不支持电源，或者busybox版本不支持。真倒霉\n当我准备放弃的时候，我被提醒凯特曾经在awk做过一个情节规划。当然，awk有能力吗~~甚至可能是超级牛的力量事实证明确实如此！\n$echo和#39&#39; | awk和#39；{print（2**-1）}&#39；0.5有了这些知识，我草草画出了一个工作实现，并将其附加到从播放器移动数据包解码的数据中。在一次试运行中，客户机发送了大约50-100个这样的数据包，每个数据包有三个双倍（X、Y、Z）。结果是转换功能太慢了，服务器没有&#39；在几分钟后，我无法完成这项工作——这对于实时游戏来说是相当不可接受的。\n降低响应时间的最简单解决方案是减少对外部二进制文件（如awk）的调用量。由于我的大部分工作负载已经在bash`for`循环中，所以我将循环移到了`awk`中，这样就节省了对awk的数十次调用。\n# (...)asdf=$（cut-c 13-&lt；&lt；&lt；$val | sed-E&#39；s/，&amp；/g；s/，//&#tr-d&#39；n&#awk-F，&#39+{power u count 1x=0；对于（i=1；i&lt；=NF i）{x=（x+（$i*（2**power u count u））power打印（x+1）&#39；#(...) 转换仍然很慢（在我的Xeon E5-2680v2上需要约10毫秒），但这在bash脚本中是意料之中的。相比之下，旧版本大约需要350毫秒，但我没有&#39；我没有可靠的测量数据来证明这一点~~还是快了35倍，哇~~\n最后，莫强自己编的东西！Position是一个64位长的值，其中三个坐标并排存储：X获得26个最高有效位，Z获得26个中间位，Y获得12个最低有效位。我&#39；我不太喜欢这种奇怪的数据类型，但在Bash中实现起来非常简单，因为它有所有需要的位移位运算符。\n这种数据类型最糟糕的地方在于它没有&#39；我其实没怎么习惯。大约一半的数据包将X、Y和Z坐标存储为单独的双变量。这意味着：\n如果假设我们&#39；We’我们只需要不超过3000000的数字（默认情况下，世界边界在哪里）\n我有点明白为什么会这样&#39；是这样的，但我还是不&#39；我不喜欢现在的状态。不管怎么说，正常的服务器通信都使用zlib，而您实际上赢了&#39；I don’描述一个块中的一个位置永远不需要超过两位（最多三位）的十进制精度。\n最后是&#39；这是NBT格式，也是Mojang Hatsune Miku自己制作的内部产品。NBT类似于JSON，但用于二进制数据。与JSON不同，它被滥用来存储超出规范的任意数据——例如，Mojang将可变长度的比特流存储为一个长数组；如果这样的数组不是&#39；t long-aligned，甚至字节对齐，最后一个long用零填充。\n有一次我&#39；我几乎完全实现了一个NBT解析器实现，但我觉得不值得费心去完成它。由于我广泛使用tmpfs作为项目目录，以及系统崩溃，代码目前已丢失。\n所有的数学问题都解决了，接下来就是“真正有趣”的部分。我在Twitter上记录了我的一些冒险经历，但那条线索只是对实际开发过程的一个粗略了解。还有，让&#39；假设我们已经有了服务器Ping数据包，它&#39；这是一个让游戏可以加入的问题。\n为了让客户端加入您的服务器，它必须完成握手过程并发送一些额外的数据包（区块、玩家位置、库存、加入游戏）。这一过程中最大的两个障碍是Join Game数据包和Chunk数据包中的数据结构。\njoin游戏会发送一些初始元数据：player&#39；s实体ID、游戏模式、一些关于世界的信息，以及自~1.16以来的a&#34；Dimension编解码器&#34；。这是一种NBT化合物，包含以下字段：\nDimension编解码器部分是实现的一大难题。出于我的目的，我决定从一个普通服务器检索NBT字段。它&#39；它是这个实现中唯一的二进制blob，虽然它可以重新实现，但我不&#39；我看不出有任何理由重新实施我不知道的事情&#39；不一定需要（或想要）定制。\n乍一看，这个包裹看起来又大又吓人！如果上面链接中的表与本文并排打开，我请您想象一下，这些巨大的位集字段中的每一个实际上都是“0x00”，而您没有&#39；根本不需要发送块实体字段。这就给我们留下了X、Y、高度图（它们是“b000000010”的奇特编码重复，几乎可以是任何东西），以及不祥的数据字段。没那么可怕吧？\n数据字段实际上是块段的数组。一个块段是16×16×16块，多个块段可以堆叠在一起创建一个块。出于我们的目的，这个数组只有一个元素，只是为了简化代码。\n块段包含块计数、块状态容器和biome容器。这两个容器都使用调色板结构对可能的块值进行编码——这意味着在生成真正的块数据之前，服务器必须从&#34；本地和#34；区块ID，至&#34；全球和#34；阻止ID。其目的是在一个小空间内挤压尽可能多的数据——一个块定义可以小到4位。\n在我看来，维基页面没有&#39；我解释得不够好，不能很快理解；这是另一幅画：\n对我来说，我发现发送这些字段数据管理的最简单方法是使用8位（而不是最小的4位）块定义长度。这将给我一个惊人的256个可能的调色板条目，从所有可用的块中选择。然后，编写实际的区块数据就像发送引用这些调色板条目的十六进制数一样简单。4位调色板也同样简单（一个十六进制字符串表示的字节是两个字符，每个字符表示4位，所以“0x01”将表示两个块——一个id为0，另一个id为1），但它会将我限制为每个块16个块。\n该标准实际上允许从每个块4位到9bpb的任何内容，否则它假设一个15bpb的直接调色板映射——我也不知道为什么它不是&#39；t字节对齐。\n在我的实现中，biome调色板的工作方式有点不同——它只发送一个空调色板，然后将biome ID 0x01（minecraft:plains）直接映射到区块内的所有区域。这是基于我对香草如何工作的逆向工程——我怀疑包中这部分的现有文档是不正确的，因为我&#39；我要么得到太多数据，要么每次都丢失几个字节。\n到目前为止，我们只有一块普通的，没有任何特别的东西。我当然想做一些演示，展示服务器可以做的*更多*而不仅仅是加载和显示块，但我没有&#39；我不想为我的每个演示创建一个单独的源代码树。我的解决方案是一系列我称之为“hooks”的可重写函数，以及服务器加载自己代码的选项。这允许任何事情，从改变世界的外观，到连接pkt_效果，让玩家在移动鼠标时发出滴答声。下面我附上一个简单的（未优化的）&#34；插件&#34；这会从默认调色板中生成一个包含随机块的块，这会产生一个奇怪的结果&#39；这在视觉上有点有趣。\n#!/usr/bin/env bash#地图。sh-简单地图修改展示函数hook_chunks（）{chunk_headerfor（（i=0；i&lt；4096；i++）；dochunk+=&#34；$（printf&#39；%02x&#39；$（随机%30）))&#34;donechunk#u footeecho和#34$块和#34&gt$TEMP/world/0000000000000000 pkt_chunk FFFFFFFFFFFFFF00pkt_chunk FFFFFFFF00000000pkt_chunk 00000000 FFFFFF00pkt_chunk 00000000 pkt_chunk 00000000000000000000 pkt_chunk 00000000000000 pkt_chunk 00000001 FFFFFF00pkt_chunk 00000001 00000000 pkt_chunk 00000001它&#39；这是一个简单的高分游戏，它把你扔到一块随机放置的石头和矿石上。挖出最有价值的矿石，直到计时器耗尽！\n众所周知，Bash不擅长处理十进制数。它&#39；对于整数，s*ok*（只要你不&#39；对它们做太多高等数学运算），但处理十进制数的唯一方法是在输入时将其相乘，然后在正确的输出位置放置一个点。正因为如此，大多数（如果不是全部的话？）巫术处理的数字是整数。\n多人游戏没有&#39；真的不行吗？我的意思是，有点像，但我从来没有真正花时间来完成它和擦亮它。\n... 这意味着它必须使用可怕的黑客在线程之间进行通信。目前，大多数全局数据存储在“/dev/shm/witchcraft”下，内部称为“$TEMP”。\n巫术很慢，尤其是在多线程之间的数据交换方面。唐&#39；I don’我不希望能够发送大量数据，生成和发送16个实体块可能需要一秒钟的时间。\n巫术目前只有在安装了最新的BusyBox（1.35.0）的情况下才能运行。我没有&#39；我没有用GNU coreutils测试它，但我预计它会赢&#39；不行。\n答：巫术内部ID在src/palette中定义。sh，可以在&#34中重新定义；插件&#34；。可以从服务器获取内部ID映射到的外部ID。查看有关数据生成器的参考页。\n答：selfisekai提出了这个名字，可能是因为我&#39；我是个女巫，我觉得很棒*\n大家在2022年2月15日16:40:40乐于助人在2022年2月15日16:59:22这个项目非常酷，但你的字体选择让它非常难以阅读。这个黑底灰的评论框简直是疯了！：D\n萨菲尔2022年2月15日17:10:48哦，天哪，这是诅咒。比我在bash中看到的HTTP（s）服务器更重要。。。我喜欢~！。。。等等，这是minecraft字体。与之前的评论一致，灰色上的黑色很难理解\n《新读者》于2022年2月15日17:48:56作为一个对bash知之甚少的人，这本书读起来非常有趣。我也喜欢这个网站！：）\n2022年2月15日17:49:01 josé2022年2月15日18:06:37 I&#39；我几个月前就有了这个想法，但我没有&#39；我不认为这是可能的。这太棒了！干得好。\n2022年2月15日阿图尔，2022年2月15日18:15:27莉莉，2022年2月15日18:17:05预取，2022年2月15日18:22:08拉斐尔，2022年2月15日18:49:27丹尼尔，2022年2月15日18:49:40凯尔杜，2022年2月15日19:20:46那&#39；这太疯狂了。我在C++中编写了一个小型MC网络实现，在我开始看到它们如何随机地改变不同版本的数据包后，放弃了。我没有&#39；我不想跟上。但在bash for MC中这样做太疯狂了。我回去为MC编写了一个小型反向代理服务器。\n西奥：2022年2月15日19:36:33你的网站很棒。你的帖子很棒。你的一切都很好。继续工作，它&#39；这绝对值得。。。\n比金2022年2月15日19:39:06我喜欢这个。如果我能做点有价值的事，我会告诉你的。感谢这个有趣的非传统项目。\n2022年2月15日，20:03:07米凯尔的节目很酷！请问花了多少时间？我不&#39；我真的不知道协议有多复杂，或者每个测试需要多长时间，比如你是否需要重启客户端等等。\n2022年2月15日的anon，2022年2月15日的20:53:12，2022年2月21日的21:16:27这是一篇关于这一过程的精彩文章。学习编码的最佳方法之一是做或看&#34；如果我做了这件愚蠢无意义的事&#34；然后看到所有的陷阱\n2022年2月15日的eggmtf，2022年2月15日21:19:43的hyperupcall，2022年2月15日21:25:36我做了很多Bash和lemmie告诉你，这真是太糟糕了！有人会说&#39；它被诅咒了，但我觉得它很酷——谢谢分享^w^\n2022年2月15日，22:03:16，为&#34的黑客们欢呼；在Bash&#34；，漂亮的字体让我想起一些VGA的东西。\n2022年2月15日，22:17:18，2022年2月16日，01:34:09，a nat you don&#39；我不知道2022年2月16日02:19:17 chip at 16.02.2022，2022年2月16日02:49:23 ayo，2022年2月16日06:12:39 trekkie1701c，2022年2月16日06:16:55，你可以通过BCMath将方程传输到bash脚本中，在其中巧妙地处理浮点数。如果我&#39；我不得不这么做，它&#39；s相当于：var=$（echo&#34；scale=9；$num1/$num2&#34；|bc），其中9是小数位数和/是操作数，可以用任何数字替换。这可能效率很低，但它确实有效。\n2022年2月16日08:19:20安诺2022年2月16日11:11:57米2022年2月16日11:21:37这正是我喜欢读的那种疯狂的东西！期待更多这样的事情！：3.\nCharles Duffy于2022年2月16日13:13:19在bash中完全可以读写包含NUL的流——诀窍是将它们存储为数组（终端元素包含最后一个NUL之后的所有内容），而不是字符串。而且，echo总体上是一个令人憎恶的东西，甚至描述它的POSIX规范也说应该使用printf——寻找Stéphane Chazelas对&#34；为什么printf比echo更好&#34; 在unix上。斯塔克交换。通用域名格式\n2022年2月16日的RJM、2022年2月16日的19:12:40 RSEA、2022年2月16日的20:00:24 Leiger Gaming、2022年2月16日的22:23:12 Wensz、2022年2月16日的22:42:09通过评论，您同意将会话cookie存储在您的设备上；P", "note_en": "For the past year or so, I&#39;ve been thinking about writing a Minecraft server in Bash as a thought excercise. I once tried that before with the Classic protocol (the one from 2009), but I quickly realized there wasn&#39;t really a way to properly parse binary data in bash. Take the following code sample:\n function a() {\tread -n 2 uwu\techo &#34;$uwu&#34; | xxd} This would read two bytes into a variable, and then pass them to `xxd`, which should show the hexdump of the data.\n   Everything&#39;s great, until we pass a nullbyte (0x00). Not only does Bash ignore nullbytes in strings, it also doesn&#39;t present any way to detect that a nullbyte has occured. Considering that the protocol I&#39;m trying to implement is strictly binary, this can severely mangle the data.\n    One rainy evening in late January, I&#39;ve had a revelation. What if I reversed the order of that function? If the binary data never reaches a variable (or, more precisely, a substitution), and just stays inside a pipe, can it pass nullbytes around?\n   The answer is yes! After some iterations, I decided to use `dd` passed to `xxd` instead of just `xxd`, because this way I can finetune how many bytes to read.\n # the $len variable is assigned earlier, basing on a similar read functiona=$(dd count=$len bs=1 status=none | xxd -p) This gave me a hex string, on which I could do pattern matching, pattern replace, data extraction... and more. Sending out responses could be done analogically, using xxd&#39;s Reverse switch.\n `ncat` is used for listening on Minecraft&#39;s default TCP port. It launches the main shell script (`mc.sh`) after it receives an incoming connection.\n  Note: the following section contains mostly my ramblings about implementing number conversion routines in Bash; If this does not interest you, feel free to  skip it.\n The first thing one should implement for a Minecraft server to function would be the  Server List Ping packet - not because it&#39;s required (heck, your server can just not reply to it properly, and you&#39;d still be able to join the game), but because it&#39;s the easiest to tackle first. It helps to familiarize yourself with core protocol concepts, such as  data types types:\n  Most data types were trivial to implement, but some gave me more of a fight than others - notably the IEEE754 floating point numbers (more on them later), and so-called VarInt/VarLong numbers. Those may be familar to those acquainted with the MQTT protocol, as they&#39;re just a modified version of the  LEB128 encoding.\n LEB128 is a compression scheme for integers. By splitting a byte into 1 signalling bit and 7 data bits, the scheme stores the number length. If the 1st bit is 0, then this byte is the last one; else, then there&#39;s another byte after this one. Great scheme if most of your numbers are either between 0 and 127 or 256 and 16383, otherwise it&#39;s `buy one byte, get one free` situation, because numbers that would otherwise fit in a byte get pushed out to the next one by a single bit.\n   # from  src/int.sh# int2varint(int)function int2varint() {\tlocal a\tlocal b\tlocal c\tlocal out\tout=$(printf &#39;%02x&#39; &#34;$1&#34;)\tif [[ $1 -lt 128 ]]; then\t\t:\telif [[ $1 -lt 16384 ]]; then\t\ta=$(($1%128))\t\tb=$(($1/128))\t\tout=$(printf &#34;%02x&#34; $((a+128)))$(printf &#34;%02x&#34; $b)\telif [[ $1 -lt $((128*128*128)) ]]; then\t\ta=$(($1%128))\t\tc=$((($1/128)%128))\t\tb=$(($1/16384))\t\tout=$(printf &#34;%02x&#34; $((a+128)))$(printf &#34;%02x&#34; $((c+128)))$(printf &#34;%02x&#34; $b)\tfi\techo -n &#34;$out&#34;} I&#39;ve had problems translating the reference implementation to Bash, so instead I played with the protocol enough to write my own from scratch. I figured out that it was basically a modulo and a division in a trenchcoat, which I used to my advantage in the code snippet above.\n I took a more contemporary approach on  the decoder, using an AND, and then multiplying the result - similarly to how the reference did it.\n LEB128 definitely wasn&#39;t the hardest or the most annoying to implement (that one goes to IEEE754 floating point); I still don&#39;t like how it is sprinkled in random places inside the protocol, interleaved with regular ints (and longs), and in some cases even signed shorts.\n  I&#39;m not a math person. When I see the exponential notation spewed out by Python, I scream and run. This may be the main cause of why I hated implementing these floating point converters. I won&#39;t be going too deep into specifics of how this format works - instead, I recommend you check out  this wikipedia page.\n The basic implementation requires a loop, inside of which there&#39;s a negative power applied to the result; Bash doesn&#39;t natively support negative powers, which sent me on a trip to find a utility that does.\n A suggestion I found while duckduckgoing was to use perl, but I consider that cheating. Alternatively, tried using `bc`, but it seems that either it doesn&#39;t support powers at all, or the busybox version does not. Bummer.\n When I was about to give up, I got reminded that  Kate once made a  plot program in awk. Surely, awk has powers? ~~Maybe even super cow powers?~~ It turns out that it does!\n $ echo &#39;&#39; | awk &#39;{print (2**-1)}&#39;0.5 With this knowledge, I scribbled a working implementation and attached it to data decoded from the Player Move packet. In a trial run, the client sent around 50-100 packets like that, each one with three doubles (X, Y, Z). It turned out that the conversion function was so slow, that the server wasn&#39;t done with that workload after multiple minutes - something rather unacceptable for a real-time game.\n The easiest solution to lowering the response time would be lowering the amount of calls to external binaries, such as awk. As most of my workload was already inside a bash `for` loop, I just  moved the loop inside `awk`, which has saved me literally tens of calls to awk.\n # (...)asdf=$(cut -c 13- &lt;&lt;&lt; $val | sed -E &#39;s/./,&amp;/g;s/,//&#39; | tr -d &#39;n&#39; | awk -F , &#39;{power_count=-1x=0;for(i=1; i&lt;=NF; i++) {x=(x + ($i * (2 ** power_count)))power_count=power_count-1;}print(x+1)}&#39;)# (...) The conversion is still quite slow (it takes ~10ms on my Xeon E5-2680v2), but this is to be expected with bash scripts. For a cheap comparsion, the old version took around 350ms, but I don&#39;t have solid measurements to prove that. ~~still, 35x faster, woo!~~\n  Finally, something made up by Mojang themselves!  Position is a 64-bit Long value, where three coordinates are stored alongside each other: X gets 26 most significant bits, Z gets 26 middle bits, Y gets 12 least significant bits. I&#39;m not the biggest fan of weird data types like this one, but it was  crazy easy to implement in Bash, because it has all the needed bitshift operators.\n The worst part about this data type is that it doesn&#39;t actually get used much. Around half of the packets store X, Y and Z coordinates as separate Double vaules. This means that:\n we get 9 digits of floating point accuracy, if we assume that we&#39;re only ever going to need numbers up to 30 000 000 (where the world border is at by default)\n I kinda see the reasoning as to why it&#39;s like that, but I still don&#39;t like the current state. Normal server communication uses zlib anyways, and you realistically won&#39;t ever need more than two (or maybe three max) digits of decimal precision to describe a position within a block.\n  Lastly, there&#39;s the  NBT format, also an internal thing made by  Mojang  Hatsune Miku herself. NBT is like JSON, but for binary data. Not unlike JSON, it gets abused to store arbitrary data beyond spec - for example, Mojang stores bitstreams of variable length as an array of Longs; if such array isn&#39;t long-aligned, or even byte-aligned, the last Long is padded with zeroes.\n At one point I&#39;ve had a NBT parser implementation implemented almost fully, but I decided it was not worth the hassle to finish it. The code is currently lost, due to my extensive use of tmpfs as a project directory, and a system crash.\n  With all the math out of the way, here comes the *actually fun* part. I documented some of my adventures  on Twitter, but that thread was merely a glimpse on the actual development process. Also, let&#39;s assume that we already have the Server Ping packet out of our way, and it&#39;s a matter of actually making the game joinable now.\n To allow a client to join your server, it has to complete the handshake process and send a few extra packets (chunks, player position, inventory, join game). Two biggest obstacles on that course were the Join Game packet, and the data structure within the Chunk packets.\n  The join game sends some initial metadata: player&#39;s entity ID, gamemode, some information about the world and, since ~1.16, a &#34;Dimension codec&#34;. This is a NBT Compound, containing the following fields:\n   The Dimension codec part was a major pain to implement. For my purposes, I decided to retrieve that NBT field from a vanilla server. It&#39;s the only binary blob in this implementation, and while it could be reimplemented, I don&#39;t see any reason to reimplement something that I don&#39;t necessarily need (or want) to customize.\n  At first glance, this packet looks huge and scary! If you have the table from the link above open side by side with this article, I invite you to imagine that every one of those huge BitSet fields is actually just `0x00`, and that you don&#39;t need to send the Block Entity field at all. This leaves us with X, Y, heightmaps (which are fancily encoded repetitions of `b000000010`, and could be virtually anything), and the ominous Data field. Less scary, right?\n  The Data field is actually an array of Chunk Section. A Chunk Section is 16 by 16 by 16 blocks, and multiple sections can be stacked together to create a Chunk. For our purposes, this array only has a single element, just to simplify the code a bit.\n A Chunk Section contains a block count, a block states container, and a biome container. Both of these containers use palette structure to encode possible block values - this means that before the real block data, server has to define a mapping from the &#34;local&#34; block IDs, to &#34;global&#34; block IDs. This aims to squish as much data as possible inside a small space - a block definition can be as small as 4 bits.\n As in my opinion the wiki page doesn&#39;t explain it well enough to quickly comprehend, here&#39;s another drawing:\n   For me, the easiest way I found to send those fields data management-wise was to use an 8 bit (instead of a minimal 4 bit) block definition length. This would give me a whopping 256 possible palette entries, out of all available blocks to choose from. Then, writing actual chunk data would be as easy as sending hex numbers referencing those palette entries. A 4-bit palette would be equally easy (a byte represented as a hex string is two characters, representing 4 bits each, so `0x01` would represent two blocks - one with id 0, and another with id 1), but it would limit me to 16 blocks per chunk.\n The standard actually allows for anything from 4 bits per block to 9bpb, otherwise it assumes a direct palette mapping with 15bpb - I too have no idea why it isn&#39;t byte-aligned.\n The biome palette works a bit differently in my implementation - it just sends an empty palette, and then maps biome ID 0x01 (minecraft:plains) directly to all regions inside the chunk. This was based on my reverse engineering of how vanilla works - I suspect that the existing documentation of this part of the packet is incorrect, as I&#39;m either getting too much data, or missing a few bytes every time.\n    By now, we only have a plain chunk, not anything special by any means. I definitely wanted to make a few demos to show that the server can do *more* than just load and show a chunk, but I didn&#39;t want to create a separate source tree for every demo I spewed out. My solution is a series of overridable functions I called `hooks`, and an option for the server to load your own code. This allows for anything from changing how the world looks, to hooking up a pkt_effect so your player makes ticking noises while you move the mouse. Below I attach a simple (unoptimized) &#34;plugin&#34; that generates a chunk with random blocks from the default palette, which makes for an oddity that&#39;s kinda interesting visually.\n #!/usr/bin/env bash# map.sh - simple map modification showcasefunction hook_chunks() {chunk_headerfor (( i=0; i&lt;4096; i++ )); dochunk+=&#34;$(printf &#39;%02x&#39; $((RANDOM%30)))&#34;donechunk_footerecho &#34;$chunk&#34; &gt; $TEMP/world/0000000000000000pkt_chunk FFFFFFFF FFFFFFFF 00pkt_chunk FFFFFFFF 00000000 00pkt_chunk FFFFFFFF 00000001 00pkt_chunk 00000000 FFFFFFFF 00pkt_chunk 00000000 00000000pkt_chunk 00000000 00000001 00pkt_chunk 00000001 FFFFFFFF 00pkt_chunk 00000001 00000000 00pkt_chunk 00000001 00000001 00}   Another demo worth taking a look at is digmeout - it&#39;s a simple highscore based game, which throws you onto a chunk with randomly placed stone and ores. Dig out the most valuable ores until the timer runs out!\n     Bash is notoriously bad at handling decimal numbers. It&#39;s *ok* with Integers (as long as you don&#39;t do too advanced maths on them), but the only way to handle a decimal number is by multiplying it on input, and somehow placing a dot in the correct place for output. Because of this, most (if not all?) numbers handled by Witchcraft are ints.\n The multiplayer doesn&#39;t really work? I mean, it kinda does, but I never really took time to finish it and polish it up.\n  ... which means that it has to use terrible hacks to communicate between threads. Currently, most global data is stored under `/dev/shm/witchcraft`, internally referenced to as `$TEMP`.\n Witchcraft is slow, especially in terms of data exchange between multiple threads. Don&#39;t expect to be able to send massive amounts of data, generating and sending 16 solid chunks can take as long as a second.\n Witchcraft currently runs *only* if you have the latest BusyBox (1.35.0) installed. I haven&#39;t tested it with GNU coreutils, but I expect it won&#39;t work.\n      A: Witchcraft-internal IDs are defined in  src/palette.sh, and can be redefined in &#34;plugins&#34;. The external IDs to which the internal ones are mapped can be acquired from the vanilla server. Check out this reference page on  Data Generators.\n   A: selfisekai came up with that name, possibly because I&#39;m a (bash) witch, and I thought it was *great*\n Everyone at 15.02.2022, 16:40:40  helpful person at 15.02.2022, 16:59:22 This project is wicked cool but your font choices make it super hard to read. And this black-on-dark-gray comment box is insane! :D\n  Saphire at 15.02.2022, 17:10:48 Oh dear, that is cursed. Much more so than the HTTP(s) server in bash that I have seen around... I love it~!...wait is the font for this the minecraft font. And agree with previous comment, the black-on-gray is hard to read q-q\n new reader at 15.02.2022, 17:48:56 as someone that knows very little bash, this was extremely fun to read. love the website too! :)\n awesome stuff at 15.02.2022, 17:49:01  josé at 15.02.2022, 18:06:37 I&#39;ve had this idea a few months ago and I didn&#39;t think it was possible. This is awesome! good work.\n  Artur at 15.02.2022, 18:15:27   lily at 15.02.2022, 18:17:05   prefetcher at 15.02.2022, 18:22:08  Rafael at 15.02.2022, 18:49:27   Daniel at 15.02.2022, 18:49:40  keldu at 15.02.2022, 19:20:46 That&#39;s crazy. I wrote a small MC network implementation in C++ and gave up after I started to see how they randomly change packets in different versions.I didn&#39;t want to keep up with that. But do this in bash for MC is crazy.I went back and wrote a small reverse proxy server for MC though.\n  Theo at 15.02.2022, 19:36:33 Your website is great. Your posts are great. Your everything is great. Keep up the work, It&#39;s definitely worth it...\n bigking at 15.02.2022, 19:39:06 ilove this. gonna play with it, if i manage to make something worthwhile i let you know. thanks for this interesting unconventional project.\n Mikael at 15.02.2022, 20:03:07 Cool project! May I ask how much time went into it? I don&#39;t really know how complex the protocol is or how long time each test takes, like if you need to restart the client and stuff.\n anon at 15.02.2022, 20:53:12  Triggernometry at 15.02.2022, 21:16:27 this is a glorious write-up of the process tho.one of the best ways to learn coding is to do or see &#34;what if i did this stupid pointless thing&#34; then seeing aaaaaall the pitfalls\n eggmtf at 15.02.2022, 21:19:43   hyperupcall at 15.02.2022, 21:25:36 I do a lot of Bash and lemmie tell you, this is pretty badass! Some people would say it&#39;s cursed, but I think its just cool - Thanks for sharing ^w^\n egg at 15.02.2022, 22:03:16 Wow for the hackery of the &#34;in Bash&#34;, and nice font reminds me of some VGA stuff.\n anon at 15.02.2022, 22:17:18   j3s at 16.02.2022, 01:34:09  a nat you don&#39;t know at 16.02.2022, 02:19:17   chip at 16.02.2022, 02:49:23  ayo at 16.02.2022, 06:12:39  trekkie1701c at 16.02.2022, 06:16:55 You can hackily handle floating point numbers in a bash script by piping the equation through BCMath.In the case that I&#39;ve had to do it, it&#39;s pretty much:var=$(echo &#34;scale=9;$num1/$num2&#34; | bc)Where the 9 is the number of decimal places and / is the operand and can be replaced by whatever.This is probably highly inefficient but hey it works.\n punk xfce at 16.02.2022, 08:19:20  annow at 16.02.2022, 11:11:57  M at 16.02.2022, 11:21:37 This is exactly the kind of insane (in a good way) stuff I love to read about! Looking forward to more of this! :3\n Charles Duffy at 16.02.2022, 13:13:19 You can absolutely read and write streams containing NULs in bash -- the trick is to store them as arrays (with the terminal element containing everything after the last NUL) instead of as strings. Also, echo is an abomination in general, and even the POSIX spec describing it says that printf should be used instead -- search for the excellent answer by Stéphane Chazelas to &#34;Why is printf better than echo?&#34; on unix.stackexchange.com\n RJM at 16.02.2022, 19:12:40  RSEA at 16.02.2022, 20:00:24   LeigerGaming at 16.02.2022, 22:23:12  Wensz at 16.02.2022, 22:42:09    By commenting, you agree for the session cookie to be stored on your device ;p", "posttime": "2022-02-17 11:30:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务器,writing,数据", "title": "关于在Bash中从头开始编写Minecraft服务器的思考", "title_en": "My thoughts on writing a Minecraft server from scratch in Bash", "transed": 1, "url": "https://sdomi.pl/weblog/15-witchcraft-minecraft-server-in-bash/", "via": "", "real_tags": ["服务器", "writing", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "薛定谔单元测试：一种通过但未能测试我们想要测试的东西的单元测试。\n本文重点介绍我们对666个Python代码库的代码扫描，以检测这样一个薛定谔单元测试。具体来说，这个问题（我们在20个代码库中找到了它，后来推出了一个自动生成的修复程序）：\n你看到错误了吗？对于开发者来说，这是一个相对常见的错误。assertEqual和assertTrue被搞糊涂了。事实上，在我们检查的666个代码基中，我们发现有3%的代码基将两者混淆了。这是一个真正的问题，它会影响真正的代码库，甚至是具有巨大社区和强大测试和代码审查实践的活跃大型代码库：\n请参阅本要点中的完整列表。这个问题如此普遍的事实表明，这个错误的一个关键原因是，在代码审查期间很容易漏掉它。快速浏览代码不会引起任何危险。它“看起来不错！”。\n在19世纪末，马克·吐温显然说过，不是你所知道的让你着迷。在19世纪末的文献中是正确的，在21世纪初的Python单元测试中也是正确的：没有真正测试我们想要测试的东西的测试比根本没有测试更糟糕，因为薛定谔的测试会让人毫无根据地相信该特性是安全的。\n在代码评审期间，该变更已被同行评审并接受。（“LGTM！”）\n然后将更改部署到prod…但在第一次遇到用户时，它就失败了\n在重新审视单元测试时，我们注意到，在软件开发生命周期中给予如此大信心的单元测试实际上根本没有测试功能。如果您遇到了这个问题，那么您就遇到了这类单元测试，这些单元测试是针对这个特定的测试用例的。assertTrue是其中之一。\n虽然pytest非常流行，但28%的代码库仍然使用内置的unittest包。使用内置unittest包的代码库存在assertTrue gotcha的风险：\nassertTrue的文档声明测试expr为真，但这是一个不完整的解释。实际上，它测试expr是否真实，这意味着如果将以下任何值用作第一个参数，测试将通过：\nassertTrue还接受第二个参数，这是显示第一个参数是否为truthy的自定义错误消息。这个调用签名允许犯错误，测试通过，因此可能会无声地失败。\n例如，在制作20个PRs修复问题时，我们发现，一旦测试不再是薛定谔单元测试，其中一个测试由于应用程序逻辑错误而开始失败：\n我们还发现，至少有两个测试失败，因为测试中的逻辑是错误的。如果我们把单元测试看作是描述产品如何工作的一种文档形式，这也是不好的。从开发人员的角度来看，单元测试可以被认为比注释和文档字符串更可信，因为注释和文档字符串是编写的声明（可能很久以前，也可能现在已经过时或不完整），而通过的单元测试表明逻辑契约得到了维护……只要测试不是薛定谔测试！\n也许需要更多的数据，但这可能意味着薛定谔的单元测试中有15%（20分之3）隐藏了损坏的功能。\n当代码审查时。doctor github bot在github pull请求中检测到此错误，建议使用以下解决方案：", "note_en": "Schrödinger’s unit-test : a unit test that passes but fails to test the thing we want to test.\n  This article focuses on our code scanning of 666 Python codebases to detect one such Schrödinger’s unit tests. Specifically, this gotcha (which we found in 20 codebases and later pushed an auto-generated fix for):\n Do you see the mistake? It’s a relatively common mistake for a developer to make.  assertEqual and  assertTrue were muddled up. In fact of the 666 codebases we checked, we found 3% of them mixed the two up. This is a real problem that affects real codebases, even active large ones with a huge community and strong testing and code review practices:\n  See the full lists in  this gist. The fact the problem is so widespread suggests a key cause of this mistake is because it’s so easy to miss during code review. A quick glance at the code does not raise any red flags. It “Looks Good To Me!”.\n  In the late 19th century Mark Twain apparently said  It’s not what you know that gets you. it’s what you think you know but ain’t. What was true in late 19th century literature is also true in early 21st Python unit testing: tests that don’t really test the thing we want to test is worse than no tests at all because a Schrödinger’s test gives unwarranted confidence that the feature is safe.\n  The change was peer reviewed and accepted during code review. (“LGTM!”)\n The change was then deployed to prod… only for it to fail upon first encounter with the user\n Upon revisiting the unit test it’s then noted that the unit test that gave such great confidence during the software development life cycle was in fact not testing the feature at all. If you encountered this problem then you encountered this class of unit tests which this specific TestCase.assertTrue is one of.\n  While pytest is very popular, 28% of codebases  still use the built-in unittest package. The codebases that do use the built-in unittest package are at risk of the assertTrue gotcha:\n  The docs for  assertTrue state that  test that expr is True, but this is an incomplete explanation. Really it tests that the expr is  truthy, meaning if any of the following values are used in as the first argument the test will pass:\n    assertTrue also accepts a second argument, which is the custom error message to show if the first argument is not truthy. This call signature allows the mistake to be made and the test to pass and therefore possibly fail silently.\n For example when making 20 PRs fixing the problems we found one of the tests started to fail due to faulty application logic once the test was no longer a Schrödinger’s unit test:\n  We also found that at least two of the tests failed because the logic in the test was wrong. This is also bad if we consider unit tests to be a form of documentation describing how the product works. From a developer’s point of view, unit tests can be considered more trustworthy that comments and doc strings because comments and doc strings are  claims written (perhaps long ago and perhaps now obsolete or incomplete), while a passing unit test shows a logic  contract is being upheld…as long as the test is not a Schrödinger’s test!\n Perhaps more data is needed, but this could mean 15% (3 in 20) of Schrödinger’s unit tests are hiding broken functionality.\n  When the  CodeReview.doctor github bot detects this mistake in a GitHub pull request the following solution is suggested:", "posttime": "2022-02-17 11:27:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,代码", "title": "我们检查的Python代码库中有3%的单元测试失败", "title_en": "3 percent of Python codebases we checked had silently failing unit tests", "transed": 1, "url": "https://richardtier.com/2022/02/16/3-of-666-python-codebases-we-checked-had-silently-failing-unit-tests-and-we-fixed-them-all%ef%bf%bc/", "via": "", "real_tags": ["python", "代码"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "调谐乐器的当前参考频率为440 Hz。一些理论家和音乐家声称432赫兹的调谐对人体有更好的效果，但没有科学研究支持这一假设。\n在不同频率（440 Hz和432 Hz）下听音乐后，确定生命参数和感知的差异。\n在不同的日子听两次音乐。两次会议使用相同的音乐（电影配乐），但一天调到440赫兹，另一天调到432赫兹。每节课包括20分钟和39分钟；听。\n重要参数（血压、心率、呼吸频率、血氧饱和度）、感知（身体和情绪感受，例如疲劳和压力）、听力过程中的注意力水平以及对体验的总体满意度。\n与440 Hz相比，432 Hz调谐音乐与平均（收缩压和舒张压）血压值轻微下降（虽然不显著）、平均心率显著下降（-4.79 bpm，p=0.05）和平均呼吸频率值轻微下降（1 r.a.，p=0.06）有关。受试者更专注于听音乐，在听了432赫兹的调谐音乐后，总体上更满意。\n数据表明，432赫兹调谐音乐比440赫兹调谐音乐能降低心率。研究结果建议用更大的样本库重复该实验，并引入涵盖更多临床参数的随机对照试验。\n生物学报。2020年11月30日；91（12-S）：e2020008。内政部：10.23750/abm。v91i12-S.10755。生物学报。2020.PMID:33263352免费PMC文章。临床试验。\n科克伦数据库系统修订版。2014;2014（12）：CD006902。内政部：10.1002/14651858。CD006902。pub3。Epub 2014年12月9日。科克伦数据库系统修订版。2014.PMID:25490233免费PMC文章。回顾\n科克伦数据库系统修订版。2010年12月8日；（12） ：CD006902。内政部：10.1002/14651858。CD006902。pub2。科克伦数据库系统修订版。2010年，PMID:21154376更新。回顾\n科克伦数据库系统修订版。2016年8月15日；（8） ：CD006911。内政部：10.1002/14651858。CD006911。pub3。科克伦数据库系统修订版。2016年PMID:27524661更新。回顾\n动物（巴塞尔）。2021 12月16日；11(12):3572. 内政部：10.3390/ani11123572。动物（巴塞尔）。2021。PMID：34944347免费PMC文章。回顾\n生物学报。2020年11月30日；91（12-S）：e2020008。内政部：10.23750/abm。v91i12-S.10755。生物学报。2020.PMID:33263352免费PMC文章。临床试验。\n应用口腔科学杂志。2020;28:e20190601。内政部：10.1590/1678-7757-2019-0601。Epub 2020年5月11日。应用口腔科学杂志。2020.PMID:32401941免费PMC文章。临床试验。", "note_en": "The current reference frequency for tuning musical instruments is 440 Hz. Some theorists and musicians claim that the 432 Hz tuning has better effects on the human body, but there are no scientific studies that support this hypothesis.\n  To identify differences in vital parameters and perceptions after listening to music at different frequencies, 440 Hz versus 432 Hz.\n        Two sessions of music listening on different days. Both sessions used the same music (movie soundtracks) but tuned to 440 Hz on one day and 432 Hz on the other. Each session consisted of 20 min&#39; listening.\n  Vital parameters (blood pressure, heart rate, respiratory rate, oxygen saturation), perceptions (physical and emotional sensations, for example fatigue and stress), levels of concentration during the listening session, and general satisfaction with the experience.\n  432 Hz tuned music was associated with a slight decrease of mean (systolic and diastolic) blood pressure values (although not significant), a marked decrease in the mean of heart rate (-4.79 bpm, p = 0.05) and a slight decrease of the mean respiratory rate values (1 r.a., p = 0.06), compared to 440 Hz. The subjects were more focused about listening to music and more generally satisfied after the sessions in which they listened to 432 Hz tuned music.\n  The data suggests that 432 Hz tuned music can decrease heart rate more than 440 Hz tuned music. The study results suggest repeating the experiment with a larger sample pool and introducing randomized controlled trials covering more clinical parameters.\n    Acta Biomed. 2020 Nov 30;91(12-S):e2020008. doi: 10.23750/abm.v91i12-S.10755.  Acta Biomed. 2020.  PMID:  33263352  Free PMC article.  Clinical Trial.\n  Cochrane Database Syst Rev. 2014;2014(12):CD006902. doi: 10.1002/14651858.CD006902.pub3. Epub 2014 Dec 9.  Cochrane Database Syst Rev. 2014.  PMID:  25490233  Free PMC article.  Review.\n    Cochrane Database Syst Rev. 2010 Dec 8;(12):CD006902. doi: 10.1002/14651858.CD006902.pub2.  Cochrane Database Syst Rev. 2010.  PMID:  21154376  Updated.  Review.\n  Cochrane Database Syst Rev. 2016 Aug 15;(8):CD006911. doi: 10.1002/14651858.CD006911.pub3.  Cochrane Database Syst Rev. 2016.  PMID:  27524661  Updated.  Review.\n  Animals (Basel). 2021 Dec 16;11(12):3572. doi: 10.3390/ani11123572.  Animals (Basel). 2021.  PMID:  34944347  Free PMC article.  Review.\n  Acta Biomed. 2020 Nov 30;91(12-S):e2020008. doi: 10.23750/abm.v91i12-S.10755.  Acta Biomed. 2020.  PMID:  33263352  Free PMC article.  Clinical Trial.\n  J Appl Oral Sci. 2020;28:e20190601. doi: 10.1590/1678-7757-2019-0601. Epub 2020 May 11.  J Appl Oral Sci. 2020.  PMID:  32401941  Free PMC article.  Clinical Trial.", "posttime": "2022-02-17 11:25:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赫兹,health,参数", "title": "调到440赫兹与432赫兹的音乐对健康的影响（2019年）", "title_en": "Music Tuned to 440 Hz versus 432 Hz and Health Effects (2019)", "transed": 1, "url": "https://pubmed.ncbi.nlm.nih.gov/31031095/", "via": "", "real_tags": ["赫兹", "health", "参数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每分钟数十亿次，大型强子对撞机（LHC）将质子粉碎在一起，释放出能量的漩涡，结晶成更多的质子、中子和不太熟悉的核粒子表亲。一些粒子在逃离场景时会相遇。接下来会发生什么——无论是给定的一对拉在一起还是推开——物理学家通常无法确定。\n理论家们在50多年前就研究出了质子和中子内部的粒子是如何活动的。但这些被称为夸克的粒子从来不会单独出现，而来之不易的夸克力理论——强大的力——无法预测夸克群的行为，夸克群实际上是构成我们身体的物体，出现在粒子对撞机中。\n慕尼黑工业大学的物理学家Laura Fabbietti说：“这是，如果你想要的话，核物理学的前沿，”从第一原理理解[这些]相互作用。\n经过几十年的工作，监视“强子”——由多个夸克组成的粒子——的强大方法终于成熟了。超级计算机现在可以计算某些数字强子之间的作用力。大型强子对撞机的研究人员正在开创一种新方法，称为飞秒镜，可以直接探测强子引起的短暂强子之间的震动。这项研究揭示了大自然最不可思议的力量的新方面。\nfemtoscopy的开发者之一法比埃蒂说，“突然之间，我们可以第一次测试任何强子对之间的强相互作用”。\n自20世纪30年代以来，原子核一直在挑战物理学家，当时该领域的领导者包括恩里科·费米和维尔纳·海森堡（Werner Heisenberg）都在努力调和一些奇怪的观察结果。一个是原子核甚至存在的事实。以氦原子核为例，两个质子相互依偎在一起，相距仅为几毫微米（十亿分之一米的百万分之一）。在这个距离上，两个正电荷会以20磅的力将原子核击碎。然而，稳定的氦原子比比皆是。电磁控制着原子，但原子核似乎遵循着不同的规则。\n1935年，一位相对默默无闻的日本物理学家Yukeki Yukawa偶然发现了核谜题的一个主要部分。\n如果某种强大的力量把原子核连在一起，那就是一种奇怪的力量。无质量光子将电磁力带到很远很远的地方，但质子和中子需要紧密接触才能粘住。Yukawa的主要观点是，这种短程效应是由于新力粒子的质量限制了其流动性；他计算出它的重量应该是电子的200倍。1947年，物理学家在宇宙线中发现了π介子或“π介子”，其质量仅比Yukawa预测的大三分之一。两年后，他获得了诺贝尔奖。\n他“是第一个预测新粒子存在的人，”日本理研研究所的核物理学家和项目主任河田哲夫说。“那就是粒子物理学的诞生。”\nπ介子被证明是大量新粒子中的第一个。这种不断增长的群体中的模式使理论家们得出结论，夸克有六种类型，它们紧密结合在一起，总是成群结队地存在。今天，物理学家知道了300多个独特的强子。\n20世纪70年代，理论家们研究出了强力是如何控制夸克的——这一理论被称为量子色动力学（quantum chromodynamics，简称QCD）。但令人沮丧的是，它并没有提供所有的答案。\nQCD将夸克描述为携带“胶子”的力的交换流，其强度随着距离的增加而增加，就像弹性带中的张力一样。当粒子碰撞在一起时，就像在粒子对撞机中那样，夸克靠得很近，以至于弹性松弛。在这些情况下，QCD工作得很好。但在一般情况下，弹性会伸展并接合，QCD的数学模型就会崩溃。这种限制使得强子的真实行为成为一个谜。\n“这是基本粒子物理标准模型中唯一（无法计算的）部分，”东京都会大学的物理学家Tetsuo Hyodo说。\n即使没有可解的理论，两种技术也越来越多地帮助物理学家破解粒子的神秘行为。\n首先是将问题外包给超级计算机。研究人员按照如下方式建立了一个数字实验室：他们将空间划分为网格，将时间划分为一系列离散的时刻。它们把夸克粘在网格线相交的地方，把胶子粘在它们之间的链环上。然后他们一帧一帧地计算发生了什么，这对于平滑的空间和时间来说是不可能的。\n2007年，Hatsuda的研究小组使用这种“晶格QCD”方法，将质子或中子对模拟为更真实的夸克和胶子云，而不是Yukawa式的点。他们证实，当质子或中子相距约一个质子宽度时，它们确实会吸引，就像交换π介子一样。“从某种意义上说，Yukawa是在QCD的基础上得到确认的，”Hatsuda说。该小组还超越了Yukawa的理论，证明了当粒子变得更近时，吸引力会变成排斥力。\n最近，该团队一直在进行质子或中子（包含较轻的“上”和“下”夸克）与由三个较重的“奇怪”夸克构成的“欧米茄”强子之间的虚拟相遇。他们在2019年发现，这对强子可以近距离地相互拉扯。在2020年，这项合作计算出一对“lambda”（一个上夸克、一个下夸克和一个重夸克）的引力较弱。这些结果代表了重强子（往往在瞬间衰变）如何相互影响的一些初步线索。\n与此同时，大型强子对撞机研究人员已经开始利用爱丽丝实验来追踪真正的强子。质子碰撞产生强子爆发，许多强子会衰变为其他粒子。ALICE研究人员在残骸中寻找想要强子配对的迹象。他们比较了沿着相似路径运动的强子对和沿着不同方向运动的强子对。其目的是揭示附近强子相互吸引或排斥的迹象。这项技术可以检测到一个毫微秒大小的强子抽搐。\n“美妙之处在于，你可以将这项技术应用到非常罕见且不稳定的强子上，”法比埃蒂说，他是爱丽丝合作组织内飞秒镜小组的负责人。“通常情况下，没有其他机会让两个粒子相互交谈，看看它们说了什么。”\n这项合作于2020年在《自然》杂志上详细介绍了他们的飞秒显微镜检查方法。去年10月，他们公布了一个基本未知的相互作用的测量结果，一个质子和一个phi介子（由一个奇怪的夸克和它的反夸克组成）之间的相互作用。实验主义者通常依靠晶格QCD的理论数据来解释他们的数据，但对phi介子的研究太少，以至于他们不得不回到Yukawa 1935年的理论。\n领导数据分析的研究生艾玛·奇扎利（Emma Chizzali）说：“对于质子物理物理来说，什么都没有。”。\nALICE的合作从大约10万对配对中得出结论，彼此接近的质子和phi介子似乎相互吸引。然而，这种引力只有质子和中子之间引力的十分之一。\nHatsuda说，这个实验“非常令人兴奋”。他的团队目前正在用莱迪思QCD检查结果。\n虽然含有奇异夸克的强子在LHC中迅速衰变，但它们可能作为中子星的长期居民而存在，在那里巨大的压力可以稳定被称为“超子”的奇异质子变体这些超子将交换phi介子而不是π介子，一些理论家认为π介子可能会使死星变硬。但ALICE的结果表明，奇怪的相互作用太弱而无关紧要。\n法比埃蒂说：“如果中子星内部有超子，它们之间的相互作用可以完全忽略。”\n现代希望，对哪两个和三个夸克粒子粘在一起的全面了解可以解释另一个谜团——为什么四个或五个夸克的组合如此罕见。物理学家们已经编目了数百个夸克二重子和三重子，但只有少数四夸克和五夸克。\n为此，爱丽丝一直在筛选2016年至2018年间发生的大约10亿次碰撞。然而，从今年春天开始，LHC的升级将使他们获取数据的速度提高100倍。在接下来的十年里，法比埃蒂预计将测量包含更重夸克的稀有强子的混合。\n“我们正在制作这个谜题，”她说，“试图测量所有这些。”", "note_en": "Billions of times each minute, the Large Hadron Collider (LHC) smashes protons together, unleashing a maelstrom of energy that crystallizes into more protons, neutrons, and less familiar cousins of the nuclear particles. Some particles encounter each other as they flee the scene. What happens next — whether a given pair pulls together or pushes apart — physicists generally can’t say.\n Theorists worked out how the particles inside protons and neutrons act more than 50 years ago. But these particles, known as quarks, never appear alone, and the hard-won theory of their force — the strong force — fails to predict the behavior of groups of quarks, the objects that actually make up our bodies and appear in particle colliders.\n “This is, if you want, the frontier of nuclear physics,” said  Laura Fabbietti, a physicist at the Technical University of Munich, “understanding [these] interactions from first principles.”\n After decades of work, powerful ways of spying on “hadrons” —  particles made of multiple quarks — are finally reaching maturity. Supercomputers can now calculate the force between certain digital hadrons. And researchers at the LHC are pioneering a new method, known as femtoscopy, that can directly detect tremors between fleeting hadrons induced by the strong force. The research is revealing novel aspects of nature’s most inscrutable force.\n “All of a sudden, we can test for the first time the strong interaction” between any pair of hadrons, said Fabbietti, one of femtoscopy’s developers.\n  The core of the atom has challenged physicists since the 1930s, when leaders in the field including Enrico Fermi and Werner Heisenberg struggled to reconcile several bizarre observations. One was the fact that the nucleus even existed. Take the helium nucleus, where two protons nestle together just a couple of femtometers (millionths of a billionth of a meter) apart. At that distance, the two positive charges should blow the nucleus apart with  20 pounds of force. Yet stable helium atoms abound. Electromagnetism controls the atom, but the nucleus seems to play by different rules.\n  A relatively  unknown Japanese physicist, Hideki Yukawa, hit on a major piece of the nuclear puzzle in 1935.\n If some mighty force was holding the nucleus together, it was a weird one. The massless photon carries the electromagnetic force far and wide, but protons and neutrons need close contact to stick. Yukawa’s main insight was that this short range results from the new force’s particle having a mass that limits its mobility;  he calculated that it should have 200 times the heft of the electron. Physicists discovered the pi meson or “pion” in cosmic rays in 1947, with a mass just one-third larger than Yukawa had predicted. His Nobel Prize came two years later.\n He “was the first person who predicted the existence of some new particle,” said  Tetsuo Hatsuda, a nuclear physicist and program director of the RIKEN institute in Japan. “That was the birth of particle physics.”\n The pion proved the first of a deluge of new particles. Patterns in this growing menagerie led theorists to conclude that quarks come in six varieties and bind so tightly that they always exist in groups. Today, physicists know of more than 300 unique hadrons.\n Theorists worked out how the strong force governs quarks — a theory known as quantum chromodynamics, or QCD — in the 1970s. But frustratingly, it just doesn’t provide all the answers.\n QCD depicts quarks as swapping flurries of force-carrying “gluons” with an intensity that grows with distance, like the tension in an elastic band. When particles slam together, as they do in a particle collider, quarks get so close together that the elastic goes slack. In these situations, QCD works well. But under ordinary circumstances, the elastic stretches out and engages, and  the mathematics of QCD break down. This limitation makes the real-world behavior of hadrons a mystery.\n “This is the only [incalculable] piece in the Standard Model of elementary particle physics,” said  Tetsuo Hyodo, a physicist at Tokyo Metropolitan University.\n  Even without a solvable theory, two techniques are increasingly helping physicists crack the particles’ cryptic conduct.\n The first is to outsource the problem to supercomputers. Researchers set up a digital laboratory as follows: They divide space into a grid, and time into a series of discrete moments. They stick quarks where the grid lines intersect, and gluons on the links between them. They then calculate what happens frame by frame in a way that would be impossible for smooth space and time.\n  In 2007, Hatsuda’s research group used this “lattice QCD” approach to simulate pairs of  protons or neutrons as more realistic clouds of quarks and gluons, rather than Yukawa-esque points. They confirmed that when the protons or neutrons are about one proton width apart, they really do attract as if by exchanging pions. “In some sense, Yukawa is confirmed on the basis of QCD,” said Hatsuda. The group also went beyond Yukawa’s theory and proved that attraction turns into repulsion when the particles get even closer.\n Recently, the team has been whipping up virtual encounters between a proton or neutron (containing lighter “up” and “down” quarks) and an “omega” hadron made from three heavier “strange” quarks. They  found in 2019 that the pair of hadrons tug on each other near and far. And  in 2020, the collaboration calculated that a pair of “lambdas” (an up quark, a down quark and a heavier quark) attract weakly. These results represent some of the first hints at how heavier hadrons, which tend to decay in a flash, affect each other.\n In parallel, LHC researchers have started harnessing the ALICE experiment to track real hadrons. Proton collisions produce a burst of hadrons, many of which decay into other particles. ALICE researchers pick through this wreckage to find signs of desired hadron pairings. They compare hadron couples that moved together along similar paths with those that went in different directions. The goal is to uncover signs of how nearby hadrons might attract or repel each other. The technique can detect hadronic twitches as small as a single femtometer.\n “The beauty is that you can apply this technique to hadrons which are very rare and unstable,” said Fabbietti, who leads the femtoscopy group within the ALICE collaboration. “Normally there aren’t other chances to let two particles talk to each other and see what they say.”\n The collaboration detailed their femtoscopy method  in  Nature in 2020. Last October, they unveiled a  measurement of a largely unknown interaction, one between a proton and a phi meson (which consists of a strange quark and its antiquark). Experimentalists normally lean on theoretical data from lattice QCD to interpret their data, but so little work has been done on phi mesons that they had to go back to Yukawa’s 1935 theory.\n “For proton-phi there was nothing,” said Emma Chizzali, the graduate student who led the data analysis.\n Protons and phi mesons that came close to each other appeared to attract, the ALICE collaboration concluded from roughly 100,000 pairings. Yet the attraction was only one-tenth as strong as that between protons and neutrons.\n The experiment is “very exciting,” said Hatsuda. His team is currently checking the result with lattice QCD.\n  While hadrons containing strange quarks decay quickly at the LHC, they may exist as long-term residents of neutron stars, where immense pressures could stabilize strange proton variants known as “hyperons.” These hyperons would swap phi mesons instead of pions, which some theorists have proposed could stiffen the dead stars. But ALICE’s result suggests that the strange interactions are too feeble to matter.\n  “If there are hyperons inside the neutron stars,” Fabbietti said, “their interactions can be completely neglected.”\n Hyodo hopes that comprehensive knowledge of which two- and three-quark particles stick together could explain another mystery — why groupings of four or five quarks are so rare. Physicists have cataloged hundreds of quark duos and trios, but just a handful of  tetraquarks and pentaquarks.\n To that end, ALICE has been sifting through a billion or so collisions that took place between 2016 and 2018. Starting this spring, however, an upgrade to the LHC will let them take data 100 times faster. Over the next decade, Fabbietti expects to measure the mingling of rarer hadrons containing even heavier quarks.\n “We are building this puzzle,” she said, “trying to measure all of them.”", "posttime": "2022-02-17 11:17:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "力量,forces,强子", "title": "原子核内部的神秘力量变得不那么奇怪了", "title_en": "The Mysterious Forces Inside the Nucleus Grow a Little Less Strange", "transed": 1, "url": "https://www.quantamagazine.org/colliders-and-supercomputers-force-fresh-hints-in-quark-mystery-20220214/", "via": "", "real_tags": ["力量", "forces", "强子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该交易创造了一个全球多样化的端到端代工厂，以帮助满足不断增长的半导体需求，并在近1000亿美元的可寻址代工市场为客户带来更多价值。\n此次收购加速了英特尔成为全球铸造服务和产能主要提供商的道路，现在它提供了业界最广泛的差异化技术组合之一。\n高度互补的交易将Intel的前沿节点和规模化制造与Tower Semiconductor的专业技术和客户至上的方法结合在一起，为全球客户提供领先的技术和制造能力以及增强的价值。\n英特尔和Tower Semiconductor management将于今天太平洋标准时间上午5:30（以色列标准时间下午3:30）为投资者、媒体和行业分析师举行电话会议，提供交易的进一步细节。\n加州圣克拉拉；MIGDAL HAEMEK，以色列--（商业通讯）--英特尔公司（Nasdaq:INTC）和Tower Semiconductor（Nasdaq:TSEM）今天宣布了一项最终协议，根据该协议，英特尔将以每股53美元的现金收购Tower，企业总价值约为54亿美元。此次收购大大推进了英特尔的IDM 2.0战略，该公司进一步扩大了其制造能力、全球足迹和技术组合，以满足前所未有的行业需求。\n2022年2月15日，英特尔与Tower Semiconductor宣布了一项最终协议，根据该协议，英特尔将以每股53美元的现金收购Tower，企业总价值约为54亿美元。（来源：英特尔公司和塔半导体）\n英特尔首席执行官帕特·盖尔辛格（Pat Gelsinger）表示：“Tower的专业技术组合、地理覆盖范围、深厚的客户关系和服务至上的运营将有助于扩大英特尔代工服务的规模，推进我们成为全球代工产能主要提供商的目标。”。“这笔交易将使英特尔能够在成熟节点上提供令人信服的前沿节点和差异化专业技术，在半导体需求前所未有的时代为现有和未来的客户打开新的机遇。”\n作为其IDM 2战略的一个重要组成部分，英特尔于2021年3月成立了英特尔铸造服务（IFS），以帮助满足日益增长的全球半导体制造能力需求，并成为美国和欧洲铸造能力的主要供应商，为全球客户提供服务。IFS目前提供领先的工艺和包装技术，未来在美国和欧洲及其他地区的承诺能力，以及广泛的知识产权（IP）组合。\nTower在射频（RF）、电源、硅锗（SiGe）和工业传感器等专业技术方面的专业知识、广泛的IP和电子设计自动化（EDA）合作伙伴关系，以及已建立的铸造厂足迹，将为Intel和Tower的全球客户提供广泛的覆盖范围。Tower服务于移动、汽车和电力等高增长市场。Tower在美国和亚洲设有工厂，为无晶圆厂公司和IDM提供服务，在地理位置上具有互补性，每年的产能超过200万片，包括德克萨斯州、以色列、意大利和日本的增长机会。Tower还推出了foundry first customer方法，提供业界领先的客户支持门户和IP店面，以及设计服务和功能。\nTower首席执行官罗素·埃尔旺格（Russell Ellwanger）表示：“凭借丰富的历史，Tower基于深厚的客户合作关系，建立了一系列具有全球制造能力的专业模拟铸造解决方案。我对该公司以及我们富有才华和敬业精神的员工感到无比自豪。”。“我们将与英特尔一起，通过全套技术解决方案和节点，以及大幅扩大的全球制造规模，推动新的、有意义的增长机会，为客户提供更大的价值。我们期待着成为英特尔代工产品的一个组成部分。”\n英特尔代工服务总裁Randhir Thakur博士，说：“我们非常高兴地欢迎Tower团队来到英特尔。他们数十年的代工经验、深厚的客户关系和技术产品将加速英特尔代工服务的发展。我们正在建设英特尔代工服务，使其成为客户至上的技术创新者，拥有最广泛的IP、服务和容量。Tower和IFS together将在全球范围内提供广泛的铸造解决方案组合，以满足客户的需求。\"\n英特尔是美国唯一一家同时从事研发和制造的领先企业，包括最近宣布的亚利桑那州和新墨西哥州产能扩张，以及在俄亥俄州新建大型工厂的计划。Tower的技术和制造足迹与Intel&#39；s IFS在前沿流程中的能力，使合并后的公司能够大规模地向客户提供更广泛的产品。随着Tower的加入，英特尔将在近1000亿美元的可寻址代工市场为客户带来更多价值。\n这笔交易预计将立即增加英特尔的非公认会计原则每股收益。英特尔打算用资产负债表中的现金为此次收购提供资金。\n交易预计将在大约12个月后完成。该协议已获得英特尔和塔楼董事会的一致批准，并须遵守某些监管批准和惯例交割条件，包括塔楼股东的批准。\nIFS和Tower Semiconductor将独立运营，直至交易结束；国际单项体育联合会将继续由塔库尔领导，而塔台将继续由埃尔旺格领导。交易结束后，英特尔的意图是让这两家公司成为一家完全整合的代工企业。届时，该公司将分享更多关于整合计划的细节。\n高盛集团；Co.LLC曾担任英特尔的财务顾问；以及斯加登、Arps、Slate、米格尔和；Flom LLP和Yigal Arnon&amp；担任法律顾问。摩根大通证券有限责任公司（J.P.Morgan Securities LLC）担任Tower的财务顾问；以及莱瑟姆＆；Watkins、LLP和FISCHER（FBC&Co.）担任法律顾问。\n英特尔和Tower management将于太平洋标准时间今天上午5:30（IST下午3:30）为投资者、媒体和行业分析师召开电话会议，讨论这笔交易和英特尔的代工战略。请访问http://www.directeventreg.com/registration/event/4070988注册参加电话会议。美国境内的电话会议号码为1-888-869-1189，美国境外的电话会议号码为1-706-643-5902。重播将在英特尔的投资者关系网站INTC上发布。通用域名格式。\n铁塔将于2022年2月17日发布其第四季度和2021财年金融业务。鉴于已宣布的交易，Tower不会为2022年第一季度提供指导，也不会召开收益电话会议。\n英特尔（Nasdaq:INTC）是一家行业领导者，创造了改变世界的技术，推动全球进步，丰富生活。受摩尔定律的启发，我们不断努力推进半导体的设计和制造，以帮助解决客户面临的最大挑战。通过在云、网络、edge和各种计算设备中嵌入智能，我们释放了数据的潜力，使商业和社会变得更好。要了解更多有关英特尔创新的信息，请访问新闻编辑室。英特尔。com和英特尔。通用域名格式。\nTower Semiconductor Ltd.（NASDAQ:TSEM，TASE:TSEM）是高价值模拟半导体解决方案的领先制造商，为消费、工业、汽车、移动、基础设施、医疗、航空航天和国防等不断增长的市场提供集成电路（IC）的技术和制造平台。Tower Semiconductor致力于通过长期合作伙伴关系及其先进创新的模拟技术产品对世界产生积极和可持续的影响，该产品包括一系列可定制的工艺平台，如SiGe、BiCMOS、混合信号/CMOS、RF CMOS、CMOS图像传感器、非成像传感器、，集成电源管理（BCD和700V）和MEMS。Tower Semiconductor还为IDMs和无晶圆厂公司提供世界一流的设计支持，以实现快速准确的设计周期，以及包括开发、转移和优化在内的流程转移服务。为了为客户提供多工厂采购和扩大产能，Tower Semiconductor在以色列拥有两个制造厂（150毫米和200毫米），在美国拥有两个制造厂（200毫米），通过持有TPSCo 51%的股份，该公司在日本拥有三座工厂（两座200毫米和一座300毫米），并与ST Microelectronics共同在意大利建立了一座300毫米的制造工厂。有关信息，请访问：www.towersemi。通用域名格式。\n本文件包含《1995年美国私人证券诉讼改革法案》的“安全港”条款、经修订的《1933年证券法》第27A节和经修订的《1934年证券交易法》第21E节所指的某些前瞻性声明，与Intel和Tower Semiconductor之间的拟议交易有关，包括关于交易利益和时间的声明，以及关于公司产品和市场的声明。诸如“预期”、“相信”、“可能”、“估计”、“预期”、“预测”、“打算”、“可能”、“可能”、“计划”、“潜在”、“项目”、“预测”、“寻求”、“应该”、“目标”、“将会”和“意愿”等词语以及这些词语和类似表达的变体旨在识别此类前瞻性陈述。此类声明基于管理层在首次作出之日的预期，涉及可能导致我们的实际结果与前瞻性声明中明示或暗示的结果存在重大差异的风险和不确定性。此类风险和不确定性包括交易可能无法及时完成或根本无法完成的风险，这可能会对公司的业务及其证券价格产生不利影响；交易完成时间的不确定性，以及未能满足交易完成条件的可能性，包括收到某些政府和监管部门的批准；监管机构为获得拟议交易的批准而要求资产剥离、行为补救或其他让步的可能性；发生任何可能导致合并协议终止的事件、变更或其他情况；交易的宣布或未决对英特尔的业务关系、经营业绩和总体业务的影响；塔半导体技术与现有或新产品集成的延迟、中断或成本增加；塔半导体股东可能不批准该交易的可能性；交易的预期收益（包括财务收益）可能无法实现；收购交割后的整合可能不会按预期进行，合并公司实现交易预期的增长前景和协同效应的能力，以及与合并公司现有业务整合相关的延迟、挑战和费用可能会产生；与交易或其他相关的诉讼；可能产生意外重组成本或承担未披露负债；留住关键人员和客户的尝试可能不会成功；转移管理层对英特尔正在进行的业务运营的注意力的相关风险；面临通货膨胀、汇率和利率波动的风险，以及与在当地和国际上开展业务有关的风险，以及英特尔和塔尔半导体交易证券的市场价格波动；2019冠状病毒疾病对英特尔和塔里塔半导体业务和一般经济状况的影响；塔式半导体的客户终端市场需求，以及塔式半导体的铸造服务和/或超过塔式半导体产能的产品需求；Tower Semiconductor和#39的行为附带的正在进行或潜在的诉讼或纠纷；与客户、供应商、房东或其他第三方的持续业务；企业合并或被合并公司的产品可能没有第三方的支持；竞争对手的行为可能会对结果产生负面影响；因宣布或完成交易而导致的潜在不良反应或业务关系变化；英特尔和塔半导体运营所在地区或行业的总体经济状况可能出现负面变化；可能未能满足以色列投资中心颁发的批准证书中规定的条件，在过去几年中，Tower Semiconductor根据该批准证书获得了大量拨款；通货膨胀风险、汇率（主要是以色列谢克尔和日元）；以及英特尔和塔式半导体向美国证券交易委员会（“SEC”）提交的文件中详述的其他风险，包括英特尔最新的10-K表格年度报告、10-Q表格和8-K表格后续定期报告以及塔式半导体最新的20-F表格年度报告和表格6-K中的任何后续报告，每份报告均已存档或提交给SEC，并可在SEC网站www.SEC上查阅。英特尔的政府SEC文件也可在英特尔投资者关系网站www.intc上查阅。Tower Semiconductor网站ir的投资者关系部分提供了Tower Semiconductor的com和SEC文件。托尔塞米。通用域名格式。提醒读者不要过度依赖这些前瞻性声明，因为这些声明仅在日期时有效。除非适用法律另有要求，英特尔和塔式半导体不承担任何义务，也不打算更新这些前瞻性声明，无论是由于新信息、未来事件还是其他原因。\n本次沟通是就拟议交易进行的。Tower Semiconductor打算向SEC提交并邮寄或以其他方式向其股东提供与英特尔拟议交易有关的代理声明（“代理声明”），各方将向SEC提交或提供与拟议交易有关的其他文件。委托书将发送或提供给Tower Semiconductor的股东，并将包含有关拟议交易和相关事项的重要信息。本函件不能替代托尔半导体向SEC提交或提供的委托书或任何其他文件。敦促投资者和证券持有人在就拟议交易做出任何投票或投资决定之前，阅读完整的委托书，以及就拟议交易向美国证券交易委员会提交或提供的其他相关文件，或通过引用将其纳入其中因为它们将包含有关拟议交易和拟议交易各方的重要信息。\n您可以在SEC的网站（www.SEC.gov）上免费获取向SEC提交或提供的与本次交易有关的所有文件的副本。此外，投资者和股东还可以通过英特尔投资者关系网站（www.intc.com）或致函英特尔，投资者关系部（Mission College Blvd，2200）获得英特尔向SEC提交或提供的委托书和其他文件的免费副本。，加利福尼亚州圣克拉拉市95054号（英特尔向SEC提交的文件），或由塔式半导体公司在塔式半导体公司的投资者关系网站（ir.towersemi.com）上提交，或致函塔式半导体公司，公司秘书，地址：拉马特加夫里尔工业园Shaul Amor街20号，邮政信箱619，Migdal Haemek 2310502，以色列（对于Tower Semiconductor向SEC提交或提交的文件）。\n©英特尔公司。英特尔、英特尔徽标和其他英特尔标志是英特尔公司或其子公司的商标。其他名称和品牌可能被称为他人的财产。", "note_en": "Transaction creates a globally diverse end-to-end foundry to help meet growing semiconductor demand and brings more value to customers across the nearly $100 billion addressable foundry market.\n Acquisition accelerates Intel’s path to becoming a major provider of foundry services and capacity globally, now offering one of the industry’s broadest portfolios of differentiated technology.\n Highly complementary transaction brings together Intel’s leading-edge nodes and scale manufacturing with Tower Semiconductor’s specialty technologies and customer-first approach to deliver leading technology and manufacturing capabilities and enhanced value to customers globally.\n  Intel and Tower Semiconductor management will host a conference call for investors, media and industry analysts today at 5:30 a.m. PST (3:30 p.m. Israel Standard Time) to provide further details on the transaction.\n SANTA CLARA, Calif. &amp; MIGDAL HAEMEK, Israel--(BUSINESS WIRE)--Intel Corporation (Nasdaq: INTC) and Tower Semiconductor (Nasdaq: TSEM), a leading foundry for analog semiconductor solutions, today announced a definitive agreement under which Intel will acquire Tower for $53 per share in cash, representing a total enterprise value of approximately $5.4 billion. The acquisition significantly advances Intel’s IDM 2.0 strategy as the company further expands its manufacturing capacity, global footprint and technology portfolio to address unprecedented industry demand.\n  Intel and Tower Semiconductor on Feb. 15, 2022, announced a definitive agreement under which Intel will acquire Tower for $53 per share in cash, representing a total enterprise value of approximately $5.4 billion. (Credit: Intel Corporation and Tower Semiconductor)\n “Tower’s specialty technology portfolio, geographic reach, deep customer relationships and services-first operations will help scale Intel’s foundry services and advance our goal of becoming a major provider of foundry capacity globally,” said Pat Gelsinger, Intel CEO. “This deal will enable Intel to offer a compelling breadth of leading-edge nodes and differentiated specialty technologies on mature nodes – unlocking new opportunities for existing and future customers in an era of unprecedented demand for semiconductors.”\n As a key part of its IDM 2.0 strategy, Intel established  Intel Foundry Services (IFS) in March 2021 to help meet the growing global demand for semiconductor manufacturing capacity and to become a major provider of U.S.- and Europe-based foundry capacity to serve customers globally. IFS currently offers leading-edge process and packaging technology, committed capacity in the U.S. and Europe and other geographies in the future, and a broad intellectual property (IP) portfolio.\n Tower’s expertise in specialty technologies, such as radio frequency (RF), power, silicon-germanium (SiGe) and industrial sensors, extensive IP and electronic design automation (EDA) partnerships, and established foundry footprint will provide broad coverage to both Intel and Tower’s customers globally. Tower serves high-growth markets such as mobile, automotive and power. Tower operates a geographically complementary foundry presence  with facilities in the U.S. and Asia serving fabless companies as well as IDMs and offers more than 2 million wafer starts per year of capacity – including growth opportunities in Texas, Israel, Italy and Japan. Tower also brings a foundry-first customer approach with an industry-leading customer support portal and IP storefront, as well as design services and capabilities.\n “With a rich history, Tower has built an incredible range of specialty analog foundry solutions based upon deep customer partnerships, with worldwide manufacturing capabilities. I could not be prouder of the company and of our talented and dedicated employees,” said Russell Ellwanger, Tower CEO. “Together with Intel, we will drive new and meaningful growth opportunities and offer even greater value to our customers through a full suite of technology solutions and nodes and a greatly expanded global manufacturing footprint. We look forward to being an integral part of Intel’s foundry offering.”\n Dr. Randhir Thakur, president of Intel Foundry Services, said: “We are thrilled to welcome the Tower team to Intel. Their decades of foundry experience, deep customer relationships and technology offerings will accelerate the growth of Intel Foundry Services. We are building Intel Foundry Services to be a customer-first technology innovator with the broadest range of IP, services and capacity. Tower and IFS together will provide a broad portfolio of foundry solutions at global scale to enable our customers’ ambitions.”\n Intel is the only leading-edge player with both research and development and manufacturing in the U.S., including recently announced capacity expansions in Arizona and New Mexico, as well as plans to build a new mega-site in Ohio. Tower’s technology and manufacturing footprint is highly complementary to Intel&#39;s IFS capabilities in leading-edge processes, allowing the combined company to provide broader offerings to customers at scale. With the addition of Tower, Intel is strongly positioned to bring more value to customers across the nearly $100 billion addressable foundry market.\n  The transaction is expected to be immediately accretive to Intel’s non-GAAP EPS. Intel intends to fund the acquisition with cash from the balance sheet.\n The transaction is expected to close in approximately 12 months. It has been unanimously approved by Intel’s and Tower’s boards of directors and is subject to certain regulatory approvals and customary closing conditions, including the approval of Tower’s stockholders.\n IFS and Tower Semiconductor will run independently until deal closure; IFS will continue to be led by Thakur, and Tower will continue to be led by Ellwanger during this time. Upon the close of the transaction, Intel’s intent is for the two organizations to become a fully integrated foundry business. The company will share more details on integration plans at that time.\n Goldman Sachs &amp; Co. LLC served as financial advisor to Intel; and Skadden, Arps, Slate, Meagher &amp; Flom LLP and Yigal Arnon &amp; Co. served as legal advisors. J.P. Morgan Securities LLC served as financial advisor to Tower; and Latham &amp; Watkins, LLP and FISCHER (FBC &amp; Co.) served as legal advisors.\n  Intel and Tower management will host a conference call for investors, media and industry analysts at 5:30 a.m. PST (3:30 p.m. IST) today to discuss the transaction and Intel’s foundry strategy. Please visit  http://www.directeventreg.com/registration/event/4070988 to register for the conference call. The conference call can also be accessed in the United States at 1-888-869-1189 and outside the United States at 1-706-643-5902. A replay will be available on Intel’s Investor Relations website,  INTC.com.\n  Tower will issue its fourth-quarter and fiscal year 2021 financials on Feb. 17, 2022. In light of the announced transaction, Tower will not provide guidance for the first-quarter 2022 and will not host an earnings conference call.\n  Intel (Nasdaq: INTC) is an industry leader, creating world-changing technology that enables global progress and enriches lives. Inspired by Moore’s Law, we continuously work to advance the design and manufacturing of semiconductors to help address our customers’ greatest challenges. By embedding intelligence in the cloud, network, edge and every kind of computing device, we unleash the potential of data to transform business and society for the better. To learn more about Intel’s innovations, go to  newsroom.intel.com and  intel.com.\n  Tower Semiconductor Ltd. (NASDAQ: TSEM, TASE: TSEM), the leading foundry of high-value analog semiconductor solutions, provides technology and manufacturing platforms for integrated circuits (ICs) in growing markets such as consumer, industrial, automotive, mobile, infrastructure, medical, and aerospace and defense. Tower Semiconductor focuses on creating positive and sustainable impact on the world through long-term partnerships and its advanced and innovative analog technology offering, comprised of a broad range of customizable process platforms such as SiGe, BiCMOS, mixed-signal/CMOS, RF CMOS, CMOS image sensor, non-imaging sensors, integrated power management (BCD and 700V), and MEMS. Tower Semiconductor also provides world-class design enablement for a quick and accurate design cycle as well as process transfer services including development, transfer, and optimization, to IDMs and fabless companies. To provide multi-fab sourcing and extended capacity for its customers, Tower Semiconductor owns two manufacturing facilities in Israel (150mm and 200mm), two in the U.S. (200mm), three facilities in Japan (two 200mm and one 300mm) which it owns through its 51% holdings in TPSCo and is sharing a 300mm manufacturing facility being established in Italy with ST Microelectronics. For information, please visit:  www.towersemi.com.\n  This document contains certain forward-looking statements within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, related to the proposed transaction between Intel and Tower Semiconductor, including statements regarding the benefits and the timing of the transaction as well as statements regarding the companies’ products and markets. Words such as “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “intend,” “likely,” “may,” “plan,” “potential,” “project,” “predict,” “seek,” “should,” “target,” “would” and “will” and variations of such words and similar expressions are intended to identify such forward-looking statements. Such statements are based on management’s expectations as of the date they were first made and involve risks and uncertainties that could cause our actual results to differ materially from those expressed or implied in our forward-looking statements. Such risks and uncertainties include, among others, the risk that the transaction may not be completed in a timely manner or at all, which may adversely affect the companies’ businesses and the price of their securities; uncertainties as to the timing of the consummation of the transaction and the potential failure to satisfy the conditions to the consummation of the transaction, including the receipt of certain governmental and regulatory approvals; the potential for regulatory authorities to require divestitures, behavioral remedies or other concessions in order to obtain their approval of the proposed transaction; the occurrence of any event, change or other circumstance that could give rise to the termination of the merger agreement; the effect of the announcement or pendency of the transaction on Intel’s business relationships, operating results, and business generally; delays, disruptions or increased costs in the integration of Tower Semiconductor’s technology into existing or new products; the potential that Tower Semiconductor shareholders may not approve the transaction; expected benefits, including financial benefits, of the transaction may not be realized; integration of the acquisition post-closing may not occur as anticipated, and the combined companies’ ability to achieve the growth prospects and synergies expected from the transaction, as well as delays, challenges and expenses associated with integrating the combined companies’ existing businesses may incur; litigation related to the transaction or otherwise; unanticipated restructuring costs may be incurred or undisclosed liabilities assumed; attempts to retain key personnel and customers may not succeed; risks related to diverting management’s attention from Intel’s ongoing business operations; exposure to inflation, currency rate and interest rate fluctuations and risks associated with doing business locally and internationally, as well as fluctuations in the market price of Intel and Tower Semiconductor’s traded securities; the impact of the COVID-19 pandemic on Intel and Tower Semiconductor’s business and general economic conditions; demands in Tower Semiconductor’s customer end markets and for Tower Semiconductor’s foundry services and/or products that exceed Tower Semiconductor’s capacity; ongoing or potential litigations or disputes, incidental to the conduct of Tower Semiconductor&#39;s ongoing business, with customers, suppliers, landlords, or other third parties; the business combination or the combined company’s products may not be supported by third parties; actions by competitors may negatively impact results; potential adverse reactions or changes to business relationships resulting from the announcement or completion of the transaction; potential negative changes in general economic conditions in the regions or the industries in which Intel and Tower Semiconductor operate; potential failure to meet the conditions set in the approval certificates received from the Israeli Investment Center under which Tower Semiconductor received a significant amount of grants in past years; exposure to inflation, currency rates (mainly the Israeli Shekel and Japanese Yen); and other risks detailed in Intel’s and Tower Semiconductor’s filings with the Securities and Exchange Commission (the “SEC”) including those discussed in Intel’s most recent Annual Report on Form 10-K and in any subsequent periodic reports on Form 10-Q and Form 8-K and Tower Semiconductor’s most recent Annual Report on Form 20-F and in any subsequent reports on Form 6-K, each of which is on file with or furnished to the SEC and available at the SEC’s website at  www.sec.gov. SEC filings for Intel are also available on Intel’s Investor Relations website at  www.intc.com, and SEC filings for Tower Semiconductor are available in the Investor Relations section of Tower Semiconductor’s website at ir.towersemi.com. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates. Unless otherwise required by applicable law, Intel and Tower Semiconductor undertake no obligation and do not intend to update these forward-looking statements, whether as a result of new information, future events or otherwise.\n  This communication is being made in respect of the proposed transaction. Tower Semiconductor intends to furnish to the SEC and mail or otherwise provide to its shareholders a proxy statement in connection with the proposed transaction with Intel (the “proxy statement”), and each party will file or furnish other documents regarding the proposed transaction with the SEC. The proxy statement will be sent or given to the shareholders of Tower Semiconductor and will contain important information about the proposed transaction and related matters. This communication is not a substitute for the proxy statement or any other document that may be filed or furnished by Tower Semiconductor with the SEC. Investors and security holders are urged to read the proxy statement in its entirety and other relevant documents filed with or furnished to the SEC in connection with the proposed transaction or incorporated by reference therein when they become available before making any voting or investment decision with respect to the proposed transaction because they will contain important information about the proposed transaction and the parties to the proposed transaction.\n You may obtain copies of all documents filed with or furnished to the SEC regarding this transaction, free of charge, at the SEC’s website ( www.sec.gov). In addition, investors and shareholders will be able to obtain free copies of the proxy statement and other documents filed with or furnished to the SEC by Intel on Intel’s Investor Relations website ( www.intc.com) or by writing to Intel, Investor Relations, 2200 Mission College Blvd., Santa Clara, CA 95054 (for documents filed with the SEC by Intel), or by Tower Semiconductor on Tower Semiconductor’s Investor Relations website (ir.towersemi.com) or by writing to Tower Semiconductor, Corporate Secretary, 20 Shaul Amor Street, Ramat Gavriel Industrial Park, P.O. Box 619, Migdal Haemek 2310502, Israel (for documents filed with or furnished to the SEC by Tower Semiconductor).\n © Intel Corporation. Intel, the Intel logo and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.", "posttime": "2022-02-17 11:12:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,tower,acquire", "title": "英特尔将斥资54亿美元收购Tower Semiconductor", "title_en": "Intel to Acquire Tower Semiconductor for $5.4B", "transed": 1, "url": "https://www.intc.com/news-events/press-releases/detail/1527/intel-to-acquire-tower-semiconductor-for-5-4-billion", "via": "", "real_tags": ["英特尔", "tower", "acquire"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是违反直觉的，但我们模仿别人越多，我们发现自己独特风格的速度就越快。在娱乐界，有很多喜剧演员试图互相模仿，但都失败了，而且自己也变得很棒：约翰尼·卡森试图模仿杰克·本尼，但失败了，并获得了六项艾美奖。后来，大卫·莱特曼试图模仿约翰尼·卡森，但失败了，成为美国最伟大的电视主持人之一。\n在反思自己的影响时，柯南·奥布莱恩说：“正是我们未能成为我们心目中的理想，最终定义了我们，使我们独一无二。”\n然而，现代的创作者却恰恰相反。他们拒绝模仿他人，固执地坚持独创性，这是他们的最高美德——即使是以牺牲质量为代价。当你和他们交谈时，他们可能会否认自己对创意的渴望，但他们会在行动中表现出来。总的来说，创作者花在模仿英雄身上的时间要比尝试创造新事物的时间少得多。我称之为创意疾病——一种普遍存在的瘟疫，让创作者害怕模仿别人的风格。\n这一问题在作家中可能最为严重，他们谈论自己的艺术时往往带有神秘感，而这些神秘感通常是留给年轻人的。不过，作家从其他领域学习是明智的。\n好莱坞电影导演之所以出现在人们的脑海中，是因为他们被视为创造性职业精神的精髓。当人们看到昆汀·塔伦蒂诺时，他们会看到一个疯狂的创意者，他有着制作原创电影的独特天赋。但塔伦蒂诺的创意始于模仿。他以复制和借鉴其他电影中的场景而闻名，他曾说：“我从每一部电影中都偷东西。”\n看着塔伦蒂诺的作品，我陶醉于这样一个悖论：模仿和创新不是对立的，而是相互关联的。\n我不知道你怎么样，但我是那种“坐下来，吃点爆米花，享受电影”的人。电影对我来说是纯粹的娱乐。一个逃离责任世界、进入迷人故事恍惚状态的机会。我以为每个人都是这样的，直到我和一个完全相反的导演一起看了一部电影。他注意到了所有的细节，从乐谱增强电影情感旅程的方式，到光线穿过演员脸的方式，到摄像机的移动预示着即将到来的情节发展的方式。\n听他对这部电影的反思，我不得不问：“我们看的是同一部电影吗？”当他生活在四维空间中时，我感觉自己被困在了平地上。1.\n1一位导演朋友告诉我，在《小丑》中，乐谱帮助我们同情最终成为小丑的阿瑟·弗莱克。作曲家Hildur Guðnadóttir在开场场景中使用大提琴来与主人公产生共鸣。但是，随着小丑黑暗的一面和内心的混乱被揭露出来，管弦乐队的声音越来越大。他越生气，管弦乐队的规模就越大。通过这一切，音乐创造了观众对他的看法：简单、天真、不酷。\n从他那里，我了解到创作者对艺术的消费与消费者不同。他们在消费方面更加有意识。对他们来说，消费艺术是富有成效的工作。导演们看电影不仅是为了娱乐，也是为了看看电影是如何制作的。不管有没有意识，他们都在发展自己的思想体系，以便在自己的工作中借鉴和借鉴。\n我想到乔治·卢卡斯。为了创作《星球大战》，他回到约瑟夫·坎贝尔（Joseph Cambell）的教诲中，坎贝尔的职业生涯是研究神话和宗教。通过他的作品，他提出了一种原型英雄理论，这种理论出现在历史上的各种故事中。今天，它被称为“英雄之旅”很可能，你对它很熟悉。在写《星球大战》时，卢卡斯从坎贝尔最著名的书《千面英雄》中获得了灵感。卢卡斯觉得神话、民间传说和童话的三位一体已经在西方消失了，他希望他的新电影能重振它。为了使这个故事与许多人类文化中回响的经典主题保持一致，卢卡斯重新撰写了他的《星球大战》草稿，以便与坎贝尔的作品保持一致。\n卢卡斯对坎贝尔作品的模仿和他发现的反复出现的主题增强了他的艺术独创性。如果卢卡斯患有困扰着许多当代作家的原创性疾病，《星球大战》就不会是今天这样了。\n第一点很清楚：误解和灵感。一些最有趣的灵感来自欣赏（甚至可能是逆向工程）他人的工作。但许多人认为灵感需要像闪电一样从稀薄的空气中迸发出来。他们担心，如果他们的头脑被之前所做的事情所污染，新奇的缪斯女神将不会造访他们。在盲目追求独创性的过程中，他们避免研究任何摆在他们面前的东西，因为他们害怕用影响力的污点玷污自己的思想。他们不是站在前面的人的肩膀上，而是从内心寻找突破性的想法。\n第二个更微妙：崇拜原创。我认为这部分疾病来自学术界，在学术界，人们确实研究那些在他们之前出现的人，但只是为了让他们能做些不同的事情。由于学术期刊坚持原创，学者们被激励去研究其他人都没有研究过的东西。然而，挑战在于独创性和实用性不是一回事。我担心，学者们过于专注于检查“以前没有人写过这个”框，以至于他们有时会忘记对人类知识做出有用的贡献。\n第三是纯粹的猜测：自我困扰。也许我们的原创性疾病源于弗洛伊德的工作，这仍然是我们人类心理学模型的基础。在某种程度上，像自我和潜意识这样的想法似乎微不足道，这只是因为它们的影响力太大了。弗洛伊德的思想基本上被传播开来，并且像他们那样，传播到了领导欧洲超现实主义绘画运动的萨尔瓦多·达利那里。超现实主义者没有像现实主义者那样捕捉现实，也没有像印象主义者那样解读现实，而是深入内心，描绘自己意识的风景。他们拒绝了逻辑和理性，而支持以梦为灵感的愿景。\n那么，20世纪60年代的迷幻运动可能会让我们在内心世界中更加根深蒂固。随着自爱和自由表达这两大运动的发展，人们拒绝接受基督教的权威宣言，并在可怕的第二次世界大战后拒绝接受任何闻起来像正统的东西。人们没有向外寻找答案，而是向内看。这一趋势只是随着治疗和冥想领域的兴起而加速，在这些领域中，许多倡导者坚持认为自我最了解，答案就在我们内心。我们认为自己是一个小岛。这是一种独特的当代心态。正如当地教堂的牧师最近对我说的那样，早期的基督徒相信我们的生活是多孔的。他们并没有把自己从外部的影响中解放出来，而是在生活中欢迎神，让它像春天盛开的花朵一样在自己体内生长。\n据说艺术反映了时代精神。也许我们世俗时代的思想也渗透到了我们的创造性思维中。在艺术世界中，我们的绘画越来越抽象，以反映艺术家的主观体验。通常，他们的目标是用震撼价值而不是质量的创意来吸引注意力。这种自恋的自我崇拜让人们拒绝接受正典。当我们向内心寻求灵感时，我们把独创性变成了我们的基本美德。\n另一种选择是追求真理。C.S.刘易斯以其在《纳尼亚纪事》等小说中展现的生动想象力而闻名，他说：“任何一个关心独创性的人都不会是独创的。只有那些只想着做好工作或说实话的人，才会变得真正独创，却没有注意到这一点。”\n刘易斯的话符合罗杰·斯克鲁顿的优秀纪录片《为什么美丽重要》的前提。2.他在开篇的前提是，在20世纪之前，如果你问任何人创作艺术的目的，他们都会说：“创造美好的事物。”但从1917年杜尚的小便器时代开始，艺术的主要目的转向用创意而不是美来震撼观众。为了吸引观众的注意力，艺术家们扰乱了观众，违反了禁忌。我们没有追求客观美的崇高目标，而是转向内心，结果非常丑陋。Scruton坚持认为，我们的语言、音乐和礼仪也变得越来越无礼，越来越以自我为中心。他将美的衰落归咎于现代性的自我中心和对传统的荒谬突破。\n英国广播公司把它撤了下来，因为它不符合他们的价值观，所以唯一可用的版本是盗版的，有葡萄牙语字幕。当然，这就是为什么你知道这是一部很棒的纪录片。\n但别以为我是在提倡停滞期。我喜欢观看人类的创新，过于重视传统会限制进步。在这里，人们想起了古埃及的艺术家。他们接受过刻板的书写训练，因此，他们的学徒生涯只有在能够按照既定规则在石头上清晰地切割图像和符号后才能结束。正如恩斯特·贡布里奇（Ernst Gombrich）在《艺术的故事》（Story of Art）中所写：“没有人想要任何不同的东西，没有人要求他‘独创’。相反，他可能被认为是最优秀的艺术家，可以让他的雕像最像过去受人敬仰的纪念碑。”在没有创新的模仿哲学的推动下，埃及艺术没有发生多大变化。一千年后，与祖传作品极为相似的新作品受到了同等的赞扬。几乎没有变化，几乎没有进步，几乎没有发展。它停滞不前——没有创新的模仿。\n做与埃及人相反的事也不管用。没有模仿的创新是傻瓜的策略。看看历史上的例子。爱因斯坦改变范式的广义相对论发明是由几十年来研究经典物理学家的努力促成的，他后来把这些物理学家的想法建立在这些物理学家的基础之上。许多最具独创性的音乐家花了数小时练习音阶，以汲取他们欣赏的人的创造力。在写作领域，亨特·S·汤普森曾经亲手写下《了不起的盖茨比》的每一个字，这样他就能感受到写一部伟大小说的感觉。罗伯特·路易斯·史蒂文森一丝不苟地抄写他喜欢的段落，一旦熟悉了，他就把书扔到房间的另一边，强迫自己根据记忆重写段落。\n如今，作家们对推广这些模仿策略犹豫不决。也许他们的厌恶来自于学校对“剽窃”这个可怕的词的狂热。在学校里，对剽窃的恐惧被灌输给我们，我们被教导要害怕任何闻起来像模仿的东西。剽窃受到了如此严厉的惩罚，以至于我想象它就像电锯一样承诺立即被开除。\n当然，剽窃是错误的。问题是，我们对剽窃的极度恐惧已经紧紧抓住了那些真正对你有益的东西。出于过度的恐惧，我们已经失去了一个微妙但重要的区别，即窃取他人的作品而不给予赞扬（这显然是一件坏事）和反映你欣赏的作家的风格或价值观（这应该得到赞扬和提升）。\n“模仿”这个词的词源是我最喜欢的词源之一。在莎士比亚时代，“猿”一词的意思是“灵长类”和“模仿”也许词源表明，模仿知识是我们的核心。3.\n这就是世界上最大的宗教基督教告诉我们模仿另一个人的原因之一：耶稣基督。\n纵观人类历史，大多数模仿学习都是通过学徒制进行的。我想起了莱昂纳多·达芬奇。他几乎没有接受过正规教育，但在14岁时获得了第一次学徒资格。在硕士工作室的时间让他学习数学、解剖学、绘画技巧和几何之美。在真正的“模仿，然后创新”时尚中，达芬奇作为学徒观察到的东西和他后来自己创作的东西之间有着明显的相似之处。事实上，他主人最著名的雕塑之一是年轻的战士大卫战胜歌利亚的胜利。（事实上，一些学者认为他们的师徒关系如此密切，以至于达芬奇为维罗基奥的《大卫》摆姿势。）。有鉴于此，我们不应该感到惊讶，因为它与达芬奇在其职业生涯后期绘制的那幅画相似，可能是他对米开朗基罗的大卫雕像着迷的原因。\n今天，情况发生了变化。我们以提高效率的名义放弃了学徒制。想要成为达芬奇的人不是学徒，而是在专业艺术学校接受培训。随着学徒制的衰落，模仿学习也随之衰落。印刷术和后来的大众教育的双重崛起，使我们对可以编入教科书的知识产生了不成比例的重视。人类为了追求效率而放弃了学徒制。人类在衡量事实传播的能力方面所获得的东西，在过度关注可能在教科书中传播的思想时失去了。技术和隐性知识的传递在翻译中丢失了。\n要明白我的意思，看看写作教育。英语课教你如何成为一名好的编辑，因为这是在教科书中最容易系统化和交流的事情。这就是我们学习语法和句法的原因。虽然它们很有用，但对于写作的深层次但无法描述的方面，它们没有太多的话要说：创意的产生，如何识别有趣论点的形状，磨练你的风格，克服对批评的恐惧，以及与作家的阻碍作斗争。像“摆脱被动语态”这样的常见建议与实际情况相比是肤浅的、低杠杆的教学点，但很难描述创造自己的词汇或成为一个更善于观察的人的好处——这两者都可以通过模仿更好地学习。\n核心知识越难用语言表达，就越需要通过模仿学习来培养技能。通常情况下，这些技能都有一些微妙之处，最好是通过与大师对话，或通过观看他们完成工作来学习。烹饪就是最好的例子。虽然我从我最喜欢的牛排馆买了几本烹饪书，但我的里贝耶牛排外面的烤肉从来没有那么完美，肉也从来没有那么多汁。遵循食谱可以让你成为一名出色的晚餐主人，但它不会让你变成戈登·拉姆齐。尽管每位厨师都应该了解食物准备的基础科学——比如好的烹饪的四个要素（盐、脂肪、酸、热）和五种味蕾（甜、酸、咸、苦和鲜味）——但烹饪的最高水平是由灵活的经验法则驱动的，这些经验法则最好是通过每一个高端厨师都需要的学徒模式获得的厨师通过了。了解烹饪的科学知识可以让厨师达到他们手艺的前10%，但了解烹饪的艺术知识可以让他们达到前1%。这是因为僵硬的框架对于厨房中现实的轮廓性质来说过于严格。\n创意工作也是如此。不过，不同之处在于，你可以模仿创造性工作的最终成果，而这是烹饪所无法做到的。这就是为什么阅读大量优秀作品是成为优秀作家的最佳途径之一。即使有效写作的原则很难沟通，大量阅读也会磨练你的直觉，让你了解高质量写作的感觉。\n为了知道什么时候应该接受模仿学习，我将向大家介绍另外一个原则：你越是被吸引到YouTube上学习这项技能，它就越能从模仿学习中受益。“YouTube技能”往往是身体技能而非智力技能。它们很难用语言描述。没有人通过阅读课本来学习舞蹈。相反，他们观看可以复制的视频，模仿他们在屏幕上看到的移动的人，如果他们是认真的，与能够提供即时反馈的教练合作。同样，人们经常说关于写作的书绝对是糟糕的——他们是对的。这并不是因为作者不好，而是因为当你试图将写作的最深层部分提炼成文本时，这些想法变得如此简单，以至于它们不再有用。\n改善创新教育首先要恢复学徒制的好处。当你模仿别人的作品时，你不得不思考他们为什么做出决定。通过消费和创造，你把别人的作品编织成自己的织锦。\n他们说，社交场合会揭示你是谁，因为个性是相对的，当你独自一人时，你没有任何人可以与你相比。我喜欢诗人约翰·奥多诺霍（John O’Donohue）在他写道：“在他人面前，你开始看到自己是谁，他们如何将你反射回自己。”\n模仿有助于我们发现自己的创造性个性，因为它揭示了我们的品味，以及创作过程中最自然的部分。这就是作家们说他们试图找到自己的“声音”的意思\n通过模仿，你可以创造自己的学徒生涯。我认识一位绘画教练，她告诉她的学生在模仿过程中倾听阻力。她说，你真实的艺术声音在你自己的风格和你想模仿的画家的风格之间的三角洲闪耀。\n参观艺术博物馆时，我最喜欢的一件事就是在美术馆的房间里观看崭露头角的艺术家们的素描。我总是试着和他们中的一些人交谈，因为模仿的行为让他们对眼前的艺术思考得如此深刻。通过对话，我可以收集他们的观察结果，并将其整合到我的知识记忆库中。在大英博物馆的一次旅行中，我遇到了一位有抱负的画家，名叫芬利。他正在画一些古希腊雕像的草图，旨在放大其中的运动感。每个黑线和阴影的每个污点，他被迫考虑为什么雕塑家的大理石形状，他做的方式。尽管这些雕像已有数百年的历史，芬利却与这位逝去工匠的鬼魂进行了一次意气风发的对话。\n许多专业作家都受过绘画训练，这并非巧合。学会以画家的身份看待问题是你成为一个更善于表达的作家所能做的最好的事情之一。这两种技能都需要敏锐的观察力。画家的目标是用色彩和阴影来照亮世界，而作家的目标是用文字和隐喻来照亮世界。这两种行为都是合成行为，有时是选择性地隐瞒信息。书写和绘画有着相似的本质属性，它们以截然不同的方式表现出来——比如电磁频谱的不同部分。同样，可见光、X射线、紫外线和红外光只是捕捉同一现实的不同方式。\n素描最令人惊讶的部分是看到场景中的所有小细节，这些细节只有在你观察了几个小时后才会出现。写作和绘画就是学习如何看。也许这就是为什么训练有素的画家、可以说是美国最伟大的传记作家戴维·麦卡洛（David McCullough）曾说：“洞察力往往来自于在所有人面前看到一直摆在桌面上的东西，而不是发现新的东西……这是狄更斯对所有作家的伟大忠告，‘让我明白’。”\n如果画家能从imi身上得到这么多\n......", "note_en": "It’s counterintuitive, but the more we imitate others, the faster we can discover our unique style. In the entertainment world, there’s a long lineage of comedians who tried to copy each other, failed, and became great themselves: Johnny Carson tried to copy Jack Benny, but failed and won six Emmy awards. Then, David Letterman tried to copy Johnny Carson, but failed and became one of America’s great television hosts.\n Reflecting on his own influences, Conan O’Brien said: “It is our failure to become our perceived ideal that ultimately defines us and makes us unique.”\n Modern creators do the opposite though. They refuse to imitate others and stubbornly insist on originality, which they hold as their highest virtue — even when it comes at the expense of quality. They might deny their ambition toward originality when you talk to them, but they reveal it in their actions. In general, creators spend much less time imitating their heroes than they do trying to make something new. I call it the Originality Disease — a pervasive plague that makes creators feel scared to imitate other people’s styles.\n The problem may be worst among writers, who speak about their craft with levels of mystery that are usually reserved for the numinous. Writers would be smart to learn from other fields, though.\n   Hollywood film directors come to mind because they’re seen as the essence of what creative professionalism looks like. When people look at Quentin Tarantino, they see a mad creative with a singular talent for making original movies. But Tarantino’s originality begins with imitation. He’s famous for replicating and building upon scenes from other movies, and he once said: “I steal from every single movie ever made.”\n Looking at Tarantino’s work, I revel in the paradox that imitation and innovation are not opposed, but operate in tandem.\n I don’t know about you, but I’m a “sit back, grab some popcorn, and enjoy the movie” kinda guy. Movies are pure entertainment for me. A chance to escape the world of responsibilities and enter the trance of a captivating story. I thought everybody was like this until I watched a film with a director who was the total opposite. He was attentive to all the tiny details, from the way the musical score enhanced the film’s emotional journey, to the way light moved across the actors faces, to the way camera movements foreshadowed upcoming plot developments.\n Listening to him reflect on the film, I had to ask: “Did we even watch the same movie?” I felt like I was stuck in flatland, while he lived in four-dimensional space. 1\n 1 A director friend tells me that in  Joker, the musical score helps us empathize with the Arthur Fleck who would eventually become the Joker. The composer Hildur Guðnadóttir used the cello in the opening scenes to create empathy with the protagonist. But then, as the Joker’s dark side and inner turmoil was revealed, the orchestra got louder and louder. The angrier he was, the bigger the orchestra became. Through it all, the music created the audience’s perception of him: simple, naive, and uncool.\n From him, I learned that creators consume art differently than consumers. They’re far more intentional in what they consume. Consuming art is productive work for them. Directors watch movies not just to be entertained, but also to see how they’re made. Consciously or not, they’re developing their own mental Pinterest board of ideas to borrow and build upon in their own work.\n George Lucas comes to mind here. To create Star Wars, he went back to the teachings of Joseph Cambell, who spent his career studying mythology and religion. Through his writings, he laid out a theory of the archetypal hero which shows up in all kinds of stories throughout history. Today, it’s known as “The Hero’s Journey.” Chances are, you’re familiar with it. While writing Star Wars, Lucas drew inspiration from Campbell’s most famous book:  The Hero with a Thousand Faces. Lucas felt the triad of mythology, folklore, and fairy tales had disappeared in the West—and he wanted his new film to revive it. In order to align the story with the classical motifs that’d reverberated through so many human cultures, Lucas re-wrote his draft of  Star Wars in order to align it with Cambell’s work.\n Lucas’ artistic originality was enhanced by an imitative respect of Campbell’s work and the recurring themes he discovered. Had Lucas suffered from the Originality Disease that plagues so many contemporary writers, Star Wars wouldn’t be what it is today.\n     The first is pretty clear: misunderstanding inspiration. Some of the juiciest inspiration comes from admiring (and maybe even  reverse-engineering) other people’s work. But many people think inspiration needs to strike out of thin air, like a bolt of lightning. They fear that the Muses of novelty won’t visit them if their mind is contaminated with what’s been done before. In blind pursuit of originality, they avoid studying anything that’s come before them out of a fear of tainting their minds with the stain of influence. Rather than standing on the shoulders of people who’ve come before them, they look within themselves for a breakthrough idea.\n The second is more subtle: fetishizing originality. I think this part of the disease comes from academia, where people do study those who’ve come before them—but only so they can do something different. Since scholarly journals insist on original contributions, academics are incentivized to study things nobody else is studying. The challenge, though, is that originality and usefulness are not the same thing. I worry that  academics are so focused on checking the “nobody’s ever written about this before” box that they sometimes forget to make useful contributions to human knowledge.\n The third is pure conjecture: self-obsession. Perhaps our Originality Disease has its roots in Freud’s work, which still underpins our model of human psychology. To the extent that ideas like the ego and the subconscious seem trivial, it’s only because they’ve been so influential. Freud’s ideas basically went viral, and as they did, made their way to Salvador Dalí who led Europe’s surrealist painting movement. Instead of trying to capture reality like the Realists or interpret it like the Impressionists, the Surrealists went inwards and painted the landscape of their own consciousness. They rejected logic and reason in favor of dream-inspired visions.\n Then, the psychedelic movement of the 1960s may have entrenched us even deeper inside the internal world. As the twin movements of self-love and free expression grew, people rejected the authoritative declarations of Christianity and, in the terrifying wake of World War II, anything that smelled like orthodoxy. Instead of looking outward for answers, people turned inwards. This trend has only accelerated with the rise of therapy and meditation—fields in which many advocates insist that the self knows best and the answers are within us. We think of ourselves as tiny little islands. This is a uniquely contemporary mindset. As the pastor at a local church said to me recently, the early  Christians believed that our lives were porous. Rather than buffering themselves from exterior influences, they welcomed the divine in their lives and let it grow in them like a lush springtime flower.\n It is said that art reflects the  spirit of the times. Perhaps the thinking of our secular age has infiltrated our creative mindset too. In the world of art, our paintings are increasingly  abstract in order to reflect the subjective experience of the artists who made them. So often, they aim to capture attention with the originality of shock value instead of quality. This narcissistic self-worship has people rejecting the canon. As we’ve turned inwards for inspiration, we’ve turned originality into our cardinal virtue.\n The alternative is a pursuit towards truth. In the words of C.S. Lewis, who is famous for the vivid imagination he presented in stories like the  Chronicles of Narnia: “No man who cares about originality will ever be original. It’s the man who’s only thinking about doing a good job or telling the truth who becomes really original—and doesn’t notice it.”\n Lewis’ words align with the premise of Roger Scruton’s excellent documentary   Why Beauty Matters . 2  He opens it with the premise that before the 20th century, if you asked anybody about the purpose of creating art, they would have said: “To make something beautiful.” But beginning around the time of Duchamp’s urinal in 1917, the primary purpose of art shifted to shocking its viewer with originality instead of beauty. To capture their viewers’ attention, artists disturbed their viewers and violated taboos. Rather than pursuing the lofty goal of objective beauty, we’ve turned inward and the results have been terribly ugly. Scruton insists that our language, music, and manners have become increasingly offensive and self-centered too. He blames the decline in beauty on the self-centeredness of modernity and a nonsensical break from tradition.\n 2 BBC took it down because it didn’t stand with their values, so the only available version is pirated and has Portuguese subtitles. Of course, this is how you know it’s a great documentary.\n  Don’t think I’m advocating for stasis though. I like watching humanity innovate, and valuing tradition too much can limit progress. Here, the artists of ancient Egypt come to mind. They trained to write in a rigid script, so their apprenticeships were only complete once they could cut images and symbols clearly in stone, according to the established rules. As Ernst Gombrich wrote in  The Story of Art: “No one wanted anything different, no one asked him to be ‘original’. On the contrary, he was probably considered the best artist who could make his statues most like the admired monuments of the past.” Driven by a philosophy of imitation without innovation, Egyptian art didn’t change much. A thousand years later, new works that closely resembled the ancestral ones were praised equally. There was little change, little progress, and little development. It was stagnant — imitation without innovation.\n Doing the opposite of the Egyptians doesn’t work either. Innovation without imitation is a fool’s strategy. Just look at the historical examples. Einstein’s paradigm-shifting invention of general relativity was enabled by decades of studying classical physicists, whose ideas he later built upon. Many of the most original musicians have spent hours practicing scales in order to pick up on the creative powers of those they admire. In the world of writing, Hunter S. Thompson once hand-wrote every word of  The Great Gatsby so he could feel what it’s like to write a great novel. Robert Louis Stevenson meticulously copied paragraphs he enjoyed, and once he got familiar with them, he threw the books to the other side of the room to force himself to rewrite paragraphs from memory.\n These days, writers are hesitant to promote these imitative strategies. Perhaps their aversion comes from how gung-ho schools are about the dreaded P-Word: plagiarism. The fear of plagiarism is injected into us in school, where we’re taught to fear anything that smells like imitation. Plagiarism was so heavily punished that I imagined it like the electric chainsaw that promised instant expulsion.\n Of course, plagiarism is wrong. The problem is that our tormented fear of plagiarism has clenched its claws around the things that are actually good for you. Out of excessive trepidation, we’ve lost touch with the subtle, but important distinction between stealing other people’s work without giving them credit (which is obviously a bad thing) and mirroring the style or values of a writer you admire (which should be praised and promoted).\n   The etymology of the word “imitate” is one of my favorites. During the time of Shakespeare, the word “ape” meant both “primate” and “imitate.” Perhaps the etymology indicates that knowledge of imitation is core to who we are. 3\n 3 That’s one reason why Christianity, the world’s largest religion, tells us to imitate another human being: Jesus Christ.\n Throughout human history, most imitative  learning happened through apprenticeships. Leonardo da Vinci comes to mind. He had almost no formal schooling, but secured his first apprenticeship at the age of 14. Time in his master’s studio led him to study math, anatomy, drawing techniques, and the beauty of geometry. In true “Imitate, then Innovate” fashion, there were obvious similarities between what da Vinci observed as an apprentice and what he’d later produce on his own. In fact, one of his master’s most famous sculptures was of the young warrior David standing in triumph over Goliath. (In fact, some scholars think their master-apprentice relationship was so close that da Vinci posed for Verrocchio’s  David). Given that, we shouldn’t be surprised that it resembled the one da Vinci painted later in his career and likely contributed to his fascination with Michelangelo’s statue of  David.\n  Today, things have changed. We’ve dropped apprenticeships in the name of  efficiency. Instead of doing an apprenticeship, wannabe Da Vincis are training at professional art schools. With the decline of apprenticeships came the decline of imitative learning. The twin rise of the printing press and, later, mass schooling, led us to disproportionately value knowledge that could be codified in textbooks. Humanity dropped apprenticeships in pursuit of efficiency. What humanity gained in its ability to scale the transmission of facts it lost in its disproportionate focus on ideas that could travel in textbooks. The transmission of technique and tacit knowledge was lost in translation.\n To see what I mean, look at writing education. English class teaches you how to be a good editor because it’s the easiest thing to systematize and communicate in textbooks. That’s why we learn grammar and syntax. Though they’re useful, they don’t have much to say about the deeper but indescribable aspects of writing: idea generation, how to recognize the shape of an interesting argument, honing your style, overcoming the fear of criticism, and fighting  writer’s block. Common pieces of advice like “get rid of the passive voice” are shallow, low-leverage points of instruction compared to the real, but hard-to-describe benefits of creating your own vocabulary or becoming a more observant person — both of which are better learned through imitation.\n  The harder it is to put the core knowledge into words, the more a skill should be developed through imitative learning. Often, these skills have a bunch of subtleties that are best learned in conversation with a master, or by watching them do their work. Cooking is the ultimate example. Though I’ve bought a few cookbooks from my favorite steakhouses, the charr on the outside of my Ribeyes are never quite as perfect and the meat is never quite as juicy. Following a recipe can make you a great dinner host, but it won’t turn you into Gordon Ramsay. Though every chef should know the basic science of food preparation — such as the four elements of good cooking (salt, fat, acid, heat) and the five taste buds (sweet, sour, salty, bitter, and umami) — the highest levels of cooking are driven by supple rules of thumb that are best acquired through the apprenticeship model that every high-end chef goes through. Knowing the science of cooking can take chefs to the top 10% of their craft, but knowing the art takes them to the top 1%. This is because rigid frameworks are too strict for the contoured nature of reality in the kitchen.\n Creative work is similar. The difference though is that you can imitate the end product of creative work in a way you can’t do with cooking. This is why reading a lot of good writing is among the best ways to become a good writer. Even if the principles of effective writing are hard to communicate, reading a lot hones your intuition for what quality writing feels like.\n For knowing when to embrace imitative learning, I’ll throw one more principle into the pot: the more you’re drawn to learning the skill on YouTube, the more it’ll benefit from imitative learning. “YouTube skills” tend to be more bodily than intellectual. They’re hard to describe in words. Nobody learns to dance by reading a textbook. Instead they watch videos they can copy, emulate the people they see moving on their screen, and if they’re serious, work with a coach who can provide instant feedback. Likewise, people often say that books about writing are categorically bad — and they’re right. It’s not because the writers are bad, but because when you try to distill the deepest parts of writing into text, the ideas become so reductive that they stop being useful.\n Improving creative  education begins with retrieving the benefits of apprenticeships. When you imitate somebody’s work, you’re forced to think about why they made the decisions they made. Through consumption and creation, you weave the threads of other people’s work into a tapestry of your own.\n   They say that social situations will reveal who you are because personality is relative and you don’t have anybody to compare yourself to when you’re alone. I like how the poet John O’Donohue put it when he wrote: “In the presence of the other, you begin to see who you are in how they reflect you back to yourself.”\n Imitation helps us discover our creative personalities because it reveals our taste and which parts of the creative process come most naturally to us. This is what writers mean when they say they’re trying to find their “voice.”\n Through imitation, you can create your own apprenticeship. I know a painting coach who tells her students to listen for resistance in the imitation process. She says that your authentic artistic voice shines in the delta between your own style and the style of the painter you want to emulate.\n One of my favorite parts of visiting art museums is watching up-and-coming artists sketch in the gallery rooms. I always try to talk to a few of them because the act of imitation makes them think so deeply about the art before their eyes. Through conversation, I can pick up their observations and integrate it into my memory bank of knowledge. During a trip to the British Museum, I once met an aspiring painter named Finley. He was sketching some ancient Greek statues, and aimed to magnify the sense of movement in them. With each black line and each smudge of shadow, he was forced to consider why the sculptor shaped the marble in the way he did. Though these statues were centuries old, Finley was engaged in a spirited conversation with the ghost of this bygone craftsman.\n  It’s no coincidence that many professional writers are trained in painting. Learning to see as a painter is among the best things you can do to become a more articulate writer. Both skills require a keen sense of observation. Where painters aim to illuminate the world with color and shadow, writers aim to illuminate it with words and metaphors. Both activities are acts of composition and sometimes, the selective withholding of information. Writing and painting have similar essential properties that manifest themselves in wildly different ways — like different parts of the electromagnetic spectrum. Likewise, visible light, X-rays, ultraviolet, and infrared light waves are simply different ways of capturing the same reality.\n The most surprising part of sketching is seeing all the little details in a scene that only occur to you after you’ve been observing it for a few hours. To write and to paint is to learn how to see. Maybe that’s why David McCullough, a trained painter and arguably America’s greatest biographer once said: “Insight comes, more often than not, from looking at what’s been on the table all along, in front of everybody, rather than discovering something new… That’s Dickens’ great admonition to all writers, ‘Make me see.’”\n If painters get so much out of imi\n......", "posttime": "2022-02-17 11:04:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模仿,imitate", "title": "模仿，然后创新", "title_en": "Imitate, Then Innovate", "transed": 1, "url": "https://perell.com/essay/imitate-then-innovate/", "via": "", "real_tags": ["模仿", "imitate"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我知道，凶手、反英雄拉斯科尔尼科夫被一名侦探折磨着。波菲里·彼得罗维奇似乎从一开始就知道拉斯科尔尼科夫有罪，并不断出现，希望招供。理查德·莱文森和威廉·林克是两位美国编剧，他们在大学里研究过费奥多·陀思妥耶夫斯基的伟大小说，并在创作自己的调查者时借鉴了波菲里的形象。\n科伦布这个角色以及这部同名电视剧的持久成功在很大程度上要归功于彼得·福尔克（如图），他是主角。虽然其他人曾短暂地轮流扮演这个角色，但福尔克穿着破旧的雨衣，抽着雪茄，在他的刻画下成为了一个伟大的人物。（由于他的努力，他赢得了四项艾美奖和一项金球奖。）该剧也吸引了其他后起之秀。早期的一集由一位有前途的年轻导演史蒂文·斯皮尔伯格执导，剧本由史蒂文·博奇科执导，他后来创作了《希尔街布鲁斯》、《法律》和《蓝色》。\n尽管《哥伦布》的形式不同寻常，但它还是很受欢迎：在几乎所有的剧集中，凶手的身份从一开始就为人所知。观众看到一个明显完美的犯罪正在发生。哥伦布在15或20分钟后出现，此后的谜团在于他将如何抓住凶手。侦探一开始似乎心不在焉或笨手笨脚，这显然是一种无罪的行为，导致恶棍低估了他。但没过多久，他发现了一个小小的矛盾，然后是一个又一个。他对犯罪行为忧心忡忡，就像一只猎犬在摇晃老鼠一样。\n该剧以洛杉矶为背景，凶手通常是某种名人。哥伦布利用坏人的名声来破坏他们的防御，有时还声称他的妻子是他们最大的粉丝之一。但是，当科伦布反复出现询问“还有一件事”时，嫌疑人很快就被侦探的坚持激怒了。\n罪犯可能会试图通过采取进一步的行动来掩盖最初的罪行，例如杀害证人或试图使其他人入罪，来逃避哥伦布的怀疑。第二次进攻通常证明了他们的失败。结局经常涉及科伦布对杀人犯耍把戏，迫使他们认罪或揭露罪行。有时，观众可能会想，科伦博的策略和一些重要证据是否真的能在法庭上站得住脚。但这样的担忧很快就被遗忘了：这是一种安慰食品的故事讲述，而不是坚韧不拔的现实主义。\n20世纪70年代上映的这几集是迄今为止最好的一集，讲述了迪克·范·戴克、伦纳德·尼莫伊、珍妮特·利和约翰尼·卡什等各种客串杀人犯的故事。1989年，当该剧重新上映时，情节更长、更曲折，并在很大程度上依赖福尔克的魅力。如今，原版节目为资深观众提供了一种受欢迎的熟悉感，并让观众放心，比如P.G.沃德豪斯的喜剧或阿加莎·克里斯蒂的神秘故事。它坚持认为，无论这些恶棍多么聪明或强大，像哥伦布这样邋遢的小家伙总会在那里捉住他们。■\n这篇文章出现在印刷版的文化部分，标题为#34；穿着雨衣的复仇者&#34；", "note_en": "I  Raskolnikov, the murderer and anti-hero, is tormented by a detective. Porfiry Petrovich seems to know Raskolnikov is guilty from the start and keeps reappearing in the hope of provoking a confession. Richard Levinson and William Link, two American screenwriters, had studied Fyodor Dostoyevsky’s great novel at university and drew on the figure of Porfiry when creating an investigator of their own.\n  The lasting success of the character of Columbo and the television series of that name owed much to Peter Falk (pictured), the actor who played the main part. Although others had taken brief turns in the role, Falk, with his shabby raincoat and cigar, became a   great with his portrayal. (He won four Emmys and a Golden Globe for his efforts.) The show attracted other rising stars, too. An early episode was directed by a promising young auteur named Steven Spielberg, with a script by Steven Bochco—who later developed “Hill Street Blues”, “   Law” and “   Blue”.\n “Columbo” was a hit in spite of its unusual format: in nearly all the episodes, the identity of the murderer is known from the start. The viewer sees an apparently perfect crime being committed. Columbo appears after 15 or 20 minutes, and thereafter the mystery lies in how he will catch the killer. The detective initially seems absent-minded or bumbling—an apparent guilelessness that leads the villain to under estimate him. But before long he spots a small inconsistency, then another and another. He worries away at the crime like a terrier shaking a rat.\n  The series is set around Los Angeles and the murderer is often a celebrity of some kind. Columbo exploits the baddies’ fame to undermine their defences, sometimes by claiming his wife is one of their biggest fans. But the suspects quickly become exasperated by the detective’s persistence, as Columbo repeatedly turns up to inquire about “just one more thing”.\n The culprit may attempt to evade Columbo’s suspicions by taking further action to cover up the original crime, such as killing a witness or trying to incriminate someone else. This second offence usually proves their downfall. The finale frequently involves Columbo playing a trick on the murderer that forces them to confess or reveal their guilt. Sometimes the viewer may wonder whether Columbo’s tactics—and some of the vital evidence—would actually stand up in court. But such concerns are quickly forgotten: this is comfort-food storytelling rather than gritty realism.\n The episodes released in the 1970s are by far the best and feature a variety of guest murderers including Dick Van Dyke, Leonard Nimoy, Janet Leigh and Johnny Cash. When the series was revived in 1989, the episodes were longer, more meandering and relied heavily on Falk’s charm. Today the original show offers a welcome dose of familiarity to veteran viewers and reassurance all round, like the comedies of P.G. Wodehouse or the mysteries of Agatha Christie. No matter how ingenious or powerful the villains might be, it insists, a little scruffy guy like Columbo will always be there to catch them out.  ■\n This article appeared in the Culture section of the print edition under the headline &#34;Avenger in a raincoat&#34;", "posttime": "2022-02-17 11:03:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "展示,shows,观众", "title": "《哥伦布》展示了多问一件事的好处", "title_en": "‘Columbo’ shows the benefits of asking just one more thing", "transed": 1, "url": "https://www.economist.com/culture/2022/02/12/columbo-shows-the-benefits-of-asking-just-one-more-thing", "via": "", "real_tags": ["展示", "shows", "观众"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PC YouTube团队游戏玩家Nexus在未打开主板的情况下购买并返还了一块主板。Newegg随后声称游戏玩家Nexus损坏了主板，并拒绝退款。\n直到上市后，游戏玩家Nexus才收到退款和&#34；破碎&#34；主板。在收到回执后，纽蛋似乎从一开始就把它卖掉了。\n个人电脑零售商纽蛋（Newegg）发现自己卷入了一场广泛的争议，这可能会让你在向公司汇款前三思。\n受欢迎的科技公司游戏玩家Nexus最近报道了与Newegg的一起事件，Newegg长期以来一直是个人电脑制造商的主打产品。游戏玩家Nexus团队从Newegg购买了一块主板，后来意识到不再需要它，决定退货。Newegg随后声称游戏玩家Nexus损坏了主板，然后拒绝退款。在与Newegg争吵了几个月后，该公司似乎试图自行修复主板，同时也拒绝退款。考虑到游戏玩家Nexus甚至从未打开或使用过主板，这自然引起了怀疑。\n在用尽了所有的客户服务选项后，游戏玩家Nexus在其规模庞大的YouTube频道上公开了。正如你所料，这导致Newegg立即退款，并归还了有问题的主板。这就是乐趣真正开始的地方。\n主板的损坏与运输过程中可能发生的损坏类型不一致，主要是针脚弯曲。主板上还有一个RMA标签，这似乎表明Newegg在销售as&#34之前曾试图（但未能）与制造商一起对其进行维修；打开盒子&#34; 尽管未能修复主板，但纽蛋公司的一名员工还是批准转售。整个事件似乎表明，Newegg一直在故意运输破损的产品，这是#34；打开盒子&#34；转售计划，然后在客户发现他们的产品已经损坏后拒绝退款。\n这种噱头在欧盟可能很难实现，因为欧盟成员国享有非常严格的消费者保护法。纽蛋似乎可能在美国退货和退款法律中发现了某种漏洞，并试图利用它。然而，这也可能是一次罕见的事故造成的，即一件物品被一名过度工作的技术人员错误地清仓出售。这个想法的问题是，reddit和游戏玩家Nexus的许多用户&#39；社区声称与Newegg有过类似的问题，声称产品受损是拒绝退款的一种方式。自首次出版以来，我们&#39；Newegg的更多客户也报告了类似的问题。\n我们&#39；We’我们将联系Newegg，为他们提供一个机会，对这些说法做出回应，但从表面上看，这似乎相当糟糕。如果我不得不猜测，我怀疑这是纽蛋恶意政策行为的结果。正如你从上面看到的，他们一定知道他们&#39；我最终会被抓住。我觉得是&#39；更可能的原因是，系统不完善，无法捕捉此类错误，人员紧张，以及自上而下的优先级设置不当。它&#39；此外，Newegg在上市后才提供真正的支持，这也绝对不好——老客户会有什么样的求助渠道？不管怎样，Newegg都需要做得更好。你可能想重新考虑一下你在哪里购买电脑外壳等等。\n基于这些优先事项和客户沟通，我们已经意识到，极少数退货可能在被安排退货、清算或电子垃圾回收之前未经彻底检查，并意外转售为&#34；打开盒子&#34；商品我们真诚地向受到负面影响的客户道歉。\n这些都是无意的过程错误和孤立事件。因此，我们已经改变了内部程序，以改进我们管理产品退货的方式。我们也在接触可能受到这些错误影响的少数客户。\n我们非常感谢从客户那里得到的反馈和建议，包括关于我们错误的警告，我们一直在寻求更好的方式为他们服务。每个客户都很重要，每个客户#39；顾客的满意是我们的首要任务。我们仍然致力于提供最佳客户体验，并将继续评估和改进我们的业务，以实现这一承诺。\n此外，我们还制定了新政策，确保在&#34；打开盒子&#34；主板和CPU上的商品退货。\n更新2：Newegg提供了附录和附加信息。Newegg的一位发言人补充说，他们&#39；我们制定了新政策以确保&#34；无忧无虑&#34；返回所有&#34的体验；打开盒子&#34；主板和CPU的退货。我问到这些政策到底需要什么，纽蛋证实他们打算接受&#34；打开盒子&#34；a&#34上的产品；没有问题&#34；这对公司的客户来说是一个巨大的胜利。\n在《迷失方舟》中建立一个良好的建筑是提高战斗效率的最好方法之一。这里&#39；这是游戏中每个顶级PvE和PvP构建的分解。\n我们的第一集《检查站》现在直播！如果你&#39；we#39；我替你保驾护航。\n在漫长的两周之后，微软重新推出了一款新的Windows 11预览版，供开发者频道的内部人士开始测试。今天&#39；正如我们&#39；我有两个可以玩！\n网状路由器可以覆盖大范围的快速Wi-Fi连接。以下是适合您所有需求的最佳选择。", "note_en": "PC YouTube team Gamers Nexus purchased and returned a motherboard without opening it. Newegg then claimed Gamers Nexus had broken the motherboard, and refused a refund.\n It was only after going public that Gamers Nexus received a refund and the &#34;broken&#34; motherboard. After receiving it back, it appeared that Newegg had sold it broken from the outset.\n PC retailer Newegg has found itself embroiled in a broad controversy, which could make you think twice before sending money to the company.\n Popular tech outlet Gamers Nexus recently  reported an incident with Newegg, which has long been a staple for PC builders. The Gamers Nexus team purchased a  motherboard from Newegg, and later decided to return it having realized that it was no longer required. Newegg then claimed that Gamers Nexus had damaged the motherboard, and then declined to offer a refund. After several months wrangling with Newegg, it seems the company had attempted to get the motherboard repaired themselves, while also denying the refund. Considering that Gamers Nexus had never even  opened or  used the motherboard, naturally this raised suspicions.\n  After exhausting all customer service options,  Gamers Nexus went public on his sizeable YouTube channel. As you might expect, this led to an immediate refund from Newegg, and a return of the motherboard in question. And this is where the fun really begins.\n The damage to the motherboard was not consistent with the type of damage that would occur in transit, featuring bent pins. The motherboard also had an RMA sticker on it, which would appear to indicate that Newegg had attempted (and failed) to repair it with the manufacturer prior to selling it on as &#34;open box.&#34; Despite failing to get the motherboard repaired, someone at Newegg approved it for resale regardless. The whole affair seemed to suggest that Newegg has been knowingly shipping broken products as part of that &#34;open box&#34; reselling program, then declining refunds after the customers discovered their products were already broken.\n  This kind of stunt would be potentially difficult to pull off in the EU, where member states enjoy very strict consumer protection laws. Newegg, it may appear, could have found some kind of loophole in U.S. return and refunds laws, and thus, attempted to exploit it. However, it  may also be the result of a rare accident, where an item was cleared for sale erroneously by an overworked technician. The problem with that idea is, many users across  reddit and Gamers Nexus&#39; community claim to have experienced similar issues with Newegg, claiming damage to products as a way of refusing refunds. Since the initial publication, we&#39;ve been contacted by more customers of Newegg reporting similar problems too.\n We&#39;re going to reach out to Newegg to offer them a chance to respond to these claims, but on the face of it, it appears pretty damning. If I had to speculate, I doubt this was the result of malevolent policy behavior by Newegg. As you can see from the above, they had to have known they&#39;d eventually get caught. I think it&#39;s far more likely the result of poor systems in place to catch these kinds of errors, stretched staff, and poor priorities being set from the top down. It&#39;s also absolutely  not okay that Newegg only offered real support after he went public — what kind of recourse would regular customers have? Either way,  Newegg needs to do better. You may want to reconsider where you buy  PC cases and so on in the near term.\n  Based on these priorities and customer communication, we have become aware that a very small number of returns may not have been thoroughly inspected before being routed for returns, liquidations, or e-waste recycling and were accidentally resold as &#34;open box&#34; merchandise. We sincerely apologize to our customers who were negatively impacted.\n These were unintentional process errors and isolated incidents. As a result, we have already changed internal procedures to improve how we manage product returns. We are also reaching out to this small number of customers who may have been affected by these errors.\n We deeply appreciate the feedback and advice we receive from our customers, including alerts about our errors, and we always pursue better ways to serve them. Every customer is important, and each customer&#39;s satisfaction is our utmost priority. We remain committed to providing the best customer experience and will continue to evaluate and improve our business to deliver on that commitment.\n Further, we have put in place new policies to ensure a hassle-free return experience on &#34;open box&#34; merchandise returns on motherboards and CPUs.\n Update 2: Newegg offered an addendum and additional information. A Newegg spokesperson added that they&#39;ve created new policies to ensure a &#34;hassle-free&#34; return experience on all &#34;open box&#34; merchandise returns for motherboards and CPUs. I asked exactly what those policies entail, and Newegg confirmed that they intend to accept all returns on &#34;open box&#34; products on a &#34;no questions asked&#34; basis, in what could be considered a huge win for customers with the firm.\n  Putting together a good build in Lost Ark is one of the best ways to improve how effective you are in combat. Here&#39;s a breakdown of each of the top PvE and PvP builds in the game.\n Our very first episode of Checkpoint is now live! If you&#39;re looking to get caught up on all the biggest gaming news so far this week, we&#39;ve got you covered.\n After two long weeks away, Microsoft is back with a new Windows 11 preview build for Insiders in the Dev Channel to start testing. Today&#39;s build is a doozy, as we&#39;ve got two to play with!\n Mesh routers can cover fast Wi-Fi connections over a wide area. Here are the best ones to suit all of your needs.", "posttime": "2022-02-17 10:57:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手头,bit,newegg", "title": "Newegg手头有点丑闻", "title_en": "Newegg has a bit of a scandal on its hands", "transed": 1, "url": "https://www.windowscentral.com/pc-parts-vendor-newegg-has-bit-scandal-its-hands", "via": "", "real_tags": ["手头", "bit", "newegg"]}]