[{"category": "", "categoryclass": "", "imagename": "334bc482fdbfff236756e7c4c8913e10.jpg", "infoid": 1068147, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌正在测试一个新功能，以便在搜索可能具有不可靠的结果的主题时通知人员。这一举措是世界上最受欢迎的搜索引擎的一个值得注意的步骤，让人们为打破在线的违法的信息的更多背景 - 就像怀疑的UFO瞄准或发展新闻报道 - 那是积极发展的。\n 新提示警告用户看到的结果，他们看到的结果正在快速变化，并读取，部分“如果这个主题是新的，它有时可能需要时间以通过可靠的来源添加结果。”谷歌确认重新编码它开始测试了一周前的特征。目前，该公司表示，通知仅以少量的搜索显示，这往往是关于发展趋势主题。\n 像谷歌，推特和Facebook这样的公司经常挣扎，以处理在互联网上运行猖獗的大量错误信息，阴谋理论和未验证的新闻故事。在过去，他们在很大程度上被远离了所有但最极端的案例的内容，引起了对自由语词价值的承诺。在Covid-19大流行期间和2020年美国选举中，一些公司采取了前所未有的行动，使流行账户延续误导。但是谷歌的那种标签正在推出 - 这只是警告用户而不阻止内容 - 反映了更长期的增量方法，以教育用户有关可疑或不完整的信息。\n “当任何人在谷歌搜索时，我们正试图向您展示我们最相关，可靠的信息，”谷歌搜索的公共联络员表示，“Danny Sullivan说。 “但我们得到了很多完全新的事情，”\n    Sullivan表示，通知并不是说你在搜索结果中看到的是对的 - 但这是一个不断变化的情况，更多的信息可能会出现。\n 作为一个例子，沙利文引用了关于英国涉嫌不明飞行物瞄准的报告。\n “有人在威尔士释放出来的警察报告视频，它有一点点的新闻报道。但它仍然没有很多关于它的事情，“沙利文说。 “但是人们可能正在寻找它，他们可能会在社交媒体上进行解决 - 所以我们可以告诉它开始趋势。我们也可以告诉那里的东西并没有很多必然的东西。我们也认为可能是新的东西会出现，“ \n当前可能提示通知的趋势搜索查询的其他例子是“为什么是锂上的布兰妮”和“黑色三角形UFO海洋”\n 该功能建立在Google最近的努力，帮助用户有“搜索识字，”或更好地了解他们抬头的内容。 2020年4月，该公司发布了一个特色，当他们的搜索不够好的比赛时，它在2021年2月在2021年2月，它在大多数搜索结果旁边添加了一个“关于”按钮，显示人们的简短维基百科的网站描述再见，在可用时。\n 谷歌告诉Recode IT ran用户研究表明展示人们发现它有用的通知。\n 新的提示也是主要技术公司的一个更大趋势的一部分，使人们提供更多可能结果的新信息的背景。例如，推特，例如，在2020年美国选举之前发布了一系列特征，提醒用户，如果他们看到的信息尚未验证。\n 一些社交媒体研究人员欢迎各种添加的背景，如今天推出的谷歌，包括瑞士德雷斯塔在斯坦福互联网天文台上发布了这个功能。他们是一个受欢迎的替代方案，对周围的辩论是否禁止某个账户或职位。\n “在在线演讲的哈佛研究员埃文·杜克斯说，这是让人们暂停的好方法，”哈佛大学讲话。 “它并不涉及任何判断任何故事的真理或虚假的判断，而只是让读者更多的背景。 ......在几乎所有突发的新闻背景下，第一个故事不是完整的故事，所以提醒人们很好。“\n 但是，仍有一些关于这一切都能工作的问题。例如，目前尚不清楚Google在给定的搜索结果上找到可靠的消息来源，以及在可疑的趋势新闻主题失去标签之前需要重量的可靠源。由于该功能更广泛地推出，我们可能希望看到更多地讨论如何实现它是如何实现的。 \n数百万人转向Vox，了解新闻中发生的事情。 我们的使命从未比这一刻更重要：通过了解来赋予。 我们读者的财务贡献是支持我们资源密集型工作的关键部分，并帮助我们为所有人提供新闻。 请考虑今天为vox提供贡献，从3美元的价格下降。 ", "note_en": "Google is testing a new feature to notify people when they search for a topic that may have unreliable results. The move is a notable step by the world’s most popular search engine to give people more context about breaking information that’s popular online — like suspected UFO sightings or developing news stories — that are actively evolving.\n The new prompt warns users that the results they are seeing are changing quickly, and reads, in part, “If this topic is new, it can sometimes take time for results to be added by reliable sources.” Google confirmed to Recode that it started testing the feature about a week ago. Currently, the company says the notice is only showing up in a small percentage of searches, which tend to be about developing trending topics.\n Companies like  Google,  Twitter, and  Facebook have often  struggled to handle the  high volume of misinformation, conspiracy theories, and unverified news stories that run rampant on the internet. In the past, they have largely stayed away from taking content down in all but the most extreme cases, citing a commitment to free speech values. During the Covid-19 pandemic and the 2020 US elections, some companies took the unprecedented action of taking down  popular accounts perpetuating misinformation. But the kind of label Google is rolling out — which simply warns users without blocking content — reflects a more long-term incremental approach to educating users about questionable or incomplete information.\n “When anybody does a search on Google, we’re trying to show you the most relevant, reliable information we can,” said Danny Sullivan, a public liaison for Google Search. “But we get a lot of things that are entirely new,”\n    Sullivan said the notice isn’t saying that what you’re seeing in search results is right or wrong — but that it’s a changing situation, and more information may come out later.\n As an example, Sullivan cited a report about a suspected UFO sighting in the UK.\n “Someone had gotten this police report video released out in Wales, and it’s had a little bit bit of press coverage. But there’s still not a lot about it,” said Sullivan. “But people are probably searching for it, they may be going around on social media — so we can tell it’s starting to trend. And we can also tell that there’s not a lot of necessarily great stuff that’s out there. And we also think that maybe new stuff will come along,”\n Other examples of trending search queries that could currently prompt the notice are “why is britney on lithium” and “black triangle ufo ocean”\n The feature builds on Google’s recent efforts to help users with “search literacy,” or to better understand context about what they’re looking up. In April 2020, the company  released a feature telling people when there aren’t enough good matches for their search, and in February 2021, it  added an “about” button next to most search results showing people a brief Wikipedia description of the site they’re seeing, when available.\n Google told Recode it ran user research on the notice that showed people found it helpful.\n The new prompt is also part of a larger trend by major tech companies to give people more context about new information that could turn out to be be wrong. Twitter, for example,  released a slew of features ahead of the 2020 US elections cautioning users if information they were seeing was not yet verified.\n Some social media researchers welcome the types of added context like the one Google rolled out today, including Renee DiResta at the Stanford Internet Observatory who  tweeted about the feature. It’s a welcome alternative, they say, to the debates around whether or not to ban a certain account or post.\n “It’s a great way of making people pause before they act on or spread information further,” said Evelyn Douek, a researcher at Harvard who studies online speech. “It doesn’t involve anyone making judgments about the truth or falsity of any story but just gives the readers more context. … In almost all breaking news contexts, the first stories are not the complete ones, and so it’s good to remind people of that.”\n There are still some questions about how this all will work, though. For example, it’s not clear exactly what sources Google finds to be reliable on a given search result, and how many reliable sources need to weigh in before a questionable trending news topic loses the label. As the feature rolls out more broadly, we can likely expect to see more discussion about how it’s implemented.\n  Millions turn to Vox to understand what’s happening in the news. Our mission has never been more vital than it is in this moment: to empower through understanding. Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.  Please consider making a contribution to Vox today from as little as $3.", "posttime": "2021-06-25 08:17:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,现在,warns,可能", "title": "谷歌现在警告人们有关不可靠或快速更改的搜索结果 ", "title_en": "Google now warns people about unreliable or quickly changing search results", "transed": 1, "url": "https://www.vox.com/recode/2021/6/24/22549157/google-unreliable-search-results-changing-quickly-misinformation-conspiracy-theories", "via": "", "real_tags": ["google", "谷歌", "现在", "warns", "可能"]}, {"category": "", "categoryclass": "", "imagename": "aa33a3d34b9919d5a24d9d85a563957c.png", "infoid": 1068146, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“明天我们应该在哪里吃？”当我们星期五晚上坐在我们的甲板上时，我的妻子兴奋地问道。\n 她在星期六晚上锁定了一个保姆，我们都渴望在几个月内独自一人的晚餐日期。\n  布雷德斯面团酒吧位于明尼阿波利斯西南部，是当地的宝石。它拥有一个伟大的户外庭院和双城的意大利美食。自流行开始以来，我们没有在那里吃掉。\n 我的妻子点点头并开始在手机上预订。然后她的下巴下降了。\n    在其网站上，Broders对客户通知他们向他们提供的新增15％的“福利和公平”的通知。他们证明了收费，首先通过解释“许多国家允许以提示信贷的形式减少服务人员的最低工资。” （更多在一分钟内。）\n 在我最喜欢的餐厅预订 - 在城市 - 抚养博客上预订＆＃39;  - 被告知所有客户被收取15％＆＃34;股权＆＃34;收费。迦的森决定向客户告知客户，他们太过种族/性别歧视才能正确地向客户提供。 pic.twitter.com/leic2rcpem.\n -  Jon Miltimore（@ Miltimore79）2021年6月22日 \n根据未发现的研究，餐厅的第二个理由是许多拖鞋是种族主义和性别歧视。\n “研究也表明，消费者给出了尖端的方式存在不公平和内置偏见，”该声明读。 “一般来说，黑色或棕色服务器会收到比白种人服务器更少的提示。也有性别偏见。“\n 该声明的最后一部分表示，新政策源于更广泛的种族不公正，并不代替追踪。\n “在种族不公正抗议和由于Covid造成的封闭之后，现在是养育器的时间才能重新想象经济学，并提供整个公司的公平支付，”该声明读。 “我们的福利＆amp;股权收费完全适用于员工赔偿。这种补充有助于我们为客户面对员工设定16美元的最低每小时工资，为厨房员工18美元的最低每小时工资......完全允许我们公司中的每个人获得真正的生活工资。 15％的福利＆amp;股权费用不是一个比例。“\n  Broders'当然是免费添加此额外收费，但很少应该注意的事情。\n 首先，很多州都允许削弱员工少于最低工资。然而，明尼苏达州不是那些国家之一。拥有超过500,000美元的企业，法律要求支付员工 - 包括尖端的工人 - 每小时至少10.08美元。 （对于毛额收入不到500,000美元的企业，最低工资为8.21美元。）\n 对于要包括这句话的勇敢者 - “许多国家已经允许减少最低工资” - 对于其股权政策的理由，同时充分了解这一政策在明尼苏达州没有任何欺骗性。 \n其次，我不是罗伯特·欧文，但告诉你的客户你将开始收取更多费用，因为他们太大了，以便公平地提示可能不是一个获胜的餐厅策略。只是在说'。作为前餐厅的工作人员，我为自己的慷慨和公平的泼妇而自豪，并且我不能信任这种责任的含义并不适合我。\n 最后，如果勇敢者没有觉得背部的餐馆工作者赚取足够的钱，那么有一个解决方案：支付更多的问题。这一行动不需要对系统压迫的任何附加费或公共讲座。它只需要餐厅运行一个有效和有利可图的业务，使他们能够支付他们认为公平和“居住的工人的工资。\n   出于好奇，我环顾四周，看看其他餐厅是否正在增加类似的费用。我很快就找到了一个。北卡罗来纳州餐厅Pizzeria Toro最近宣布推出了20％的生活工资费。\n Pizzeria的老板灰色布鲁克斯表示，这是“公平”的事情。 “为了让底部上升，顶部必须稍微下降一点，”布鲁克斯说。\n 当然，这是固定饼图的完美典范。对于那些不熟悉的人来说，谬误假设经济是固定的，而对于穷人做得更好，更好的休息必须简单地牺牲更多。\n “如果假设财富是一个固定的馅饼，那么富人的切片就越多，穷人剩下的遗漏，”切尔西福德解释说。 “换句话说，人们只能以牺牲他人为代价更好。在固定馅饼的世界里，如果我们观察富裕的变得更丰富，那么它必须是因为其他人变得较贫穷。幸运的是，在现实世界中，馅饼不是固定的。“\n 固定派来是谬误很清楚。无法创建新事物，但新值可以是。每次双方制作自愿交换时都会创建价值。市场经济是巨大的万亿亿万亿亿万的价值交流。 \n市场经济的“馅饼”的价值与每一个“双赢”交换增长。因此，没有必要“胜利”转移从拥有莫勒斯有权。\n 从历史上看，穷人通过从财富转移（无论是慈善或税收的形式）的自由和机会还有更多的帮助。而最贫困的用途使用私人财富的方式并未放弃，但在资本货物中投资它，这提高了劳动生产率，从而提升了实际工资。从18世纪以来，看看人均收入的崛起，这展示了市场的“不断增长的馅饼”受益于每个人。\n 这些机构的所有者可以自由地在他们喜欢的情况下运行他们的业务（就像我自由地带走我的业务）一样。但是，如果他们真的关心令他们振作的工人，他们应该担心公司的美德信令，更多关于实际改善他们的业务。如果他们仍然有带宽在那之后做一些良好的事情，他们可能会对反对所有无数方式 - 最低工资，职业许可等 - 政府妨碍参与和受益于“种植馅饼”。 “\n “大多数经济贫困都源于假设存在固定派的趋势，这一方只能以牺牲另一方获得，”米尔顿弗里德曼曾经观察过。\n  毫无疑问，固定派谬误仍然存在的原因之一，是这种股权的过分症。有些人可能会看待股票附加费，只为餐厅的精明卫生，以获得更多的工人，但这并不意味着他们是良性的。\n 关注股权倾向于将劳动力和业务处于赔率下，暗示工人正在被剥削和剥夺其公平份额。这个想法 - 雇主 - 雇员关系本质上是剥削 - 在马克思主义的基础上，经济学家有效地驳斥。这种心态敲打了怨恨和阶级的斗争，社会主义的两个支柱，教导人们通过压迫和冲突的镜头看到世界。\n 为了确定，在新的扭曲中，餐厅似乎试图通过这一涉嫌开发到客户，也许是为了安抚不满的工人或也许可以挖掘社会正义的电流。但这并没有让想法较少有害。 \n无论如何，我怀疑使客户支付“股票”的充电器将成为反馈。  喜欢有选择的客户。 这是市场的众多美丽之一。 消费者可以选择如何回应事物。 如果您不喜欢Twitter的演讲的侵略性政策，请罚款; 你可以去其他地方。 如果您不关心Chick Fil A的慈善捐款，您可以在Popeye进食。 如果汽车经销商对您差不多，您可以在其他地方带您的业务。  如果您不喜欢您最喜爱的餐厅的新股票额外收费政策，您只需锻炼退出的力量 - 我打算。  对我的选择很简单：我最喜欢的餐厅增加了股票附加费。 我应该怎么办？  我不会 在 Broders 吃 了 ， 我很伤心 地说 。 至少在我被股权费用被拍打时。 ", "note_en": "“Where should we eat tomorrow?” my wife asked me excitedly as we sat on our deck Friday evening.\n She had locked down a babysitter for Saturday night, and we were both eager for our first dinner date alone together in months.\n  Located in southwest Minneapolis, Broders Pasta Bar is a local gem. It has a great outdoor patio and the best Italian cuisine in the Twin Cities. We had not eaten there since the pandemic began.\n My wife nodded and started to make a reservation on her phone. Then her jaw dropped.\n    On its website, Broders’ has  a notice to customers notifying them of a new 15 percent “benefits and equity” charge they’ve instituted. They justify the charge, first, by explaining that “many states have allowed reduced minimum wages for service staff in the form of a tip credit.” (More on this in a minute.)\n Went to book a reservation at my favorite restaurant in the Cities—Broders&#39;—and was informed all customers were being charged a 15% &#34;equity&#34; charge.  Instead of just paying their employees more, Broders has decided to inform customers they are too racist/sexist to tip properly.  pic.twitter.com/LeiC2RcPEm\n— Jon Miltimore (@miltimore79)  June 22, 2021\n The restaurant’s second justification is that many tippers are racist and sexist, according to uncited research.\n “Studies have also shown that there is inequity and built-in bias in the way consumers give tips,” the statement reads. “In general, Black or Brown servers receive less tips than Caucasian servers. There is gender bias as well.”\n The final part of the statement says the new policy stems from wider racial injustice and is not a substitute for gratuity.\n “In the wake of racial injustice protests and the closures due to Covid, now is the time for Broders’ to reimagine its economics and provide fair pay across the company,” the statement reads. “Our Benefits &amp; Equity Charge is applied entirely to employee compensation. This supplement helps us to set a $16 minimum hourly wage for customer facing employees, $18 minimum hourly wage for kitchen employees… Altogether this allows everyone in our company to earn a real living wage. The 15% Benefits &amp; Equity Charge is not a gratuity.”\n  Broders’ is of course free to add this additional charge, but there are few things that should be noted.\n First, it’s true that many states allow tipped employees to make less than the minimum wage. However, Minnesota is   not  one of those states. Businesses with gross revenue over $500,000 are legally required to pay employees—including tipped workers—at least $10.08 an hour. (For businesses with gross revenue less than $500,000, the minimum wage is $8.21.)\n For Broders’ to include this sentence—”many states have allowed reduced minimum wages”—for a justification of its equity policy while fully knowing this policy is not in use in Minnesota is nothing short of deceptive.\n Second, I’m no  Robert Irvine, but telling your customers you are going to begin charging them more because they are too bigoted to tip fairly might not be a winning restaurant strategy. Just sayin’. As a former restaurant worker, I pride myself on being a generous and fair tipper, and the implication that I can’t be trusted with this responsibility doesn’t sit well with me.\n Finally, if Broders’ doesn’t feel restaurant workers in the back are earning enough money, there is a solution to that:  pay them more. This action doesn’t require any surcharges or public lectures on systemic oppression. It only requires the restaurant to run an efficient and profitable business that allows them to pay workers a wage they believe is fair and “livable.”\n   Out of curiosity, I looked around to see if other restaurants are adding similar charges. I quickly found one. Pizzeria Toro, a North Carolina restaurant,  recently announced that it is introducing a 20 percent Living Wage Fee.\n The pizzeria’s owner, Gray Brooks, said this is the “equitable” thing to do. “In order for the bottom to rise up, the top has to come down a little bit,” said Brooks.\n This is, of course, a perfect example of the fixed pie fallacy. For those unfamiliar, the fallacy assumes that the economy is fixed, and for the poor to do better, the better off must simply sacrifice more.\n “If we assume that wealth is a fixed pie, then the more slices the rich get, the fewer are left over for the poor,” Chelsea Follett  explained. “In other words, people can only better themselves at the expense of others. In the world of the fixed pie, if we observe the rich becoming richer, then it must be because other people are becoming poorer. Fortunately, in the real world, the pie is not fixed.”\n That the fixed pie is a fallacy is clear. New matter cannot be created, but new  value can be. Value is created every time two parties make a voluntary exchange. And the market economy is a vast network of trillions upon trillions of value-creating exchanges.\n The market economy’s “pie” of value grows with every “win-win” exchange. So, there’s no need for “win-lose” transfers from have-mores to have-lesses.\n Historically, the poor have been helped much more by the freedom and opportunity to participate in the market than from wealth transfers (whether in the form of charity or taxation). And the most poverty-alleviating way to use private wealth has not been to give it away, but to invest it in capital goods, which boosts labor productivity and thus lifts up real wages. Just look at  the rise of per capita income since the 18th century, which shows “the growing pie” of the market benefited everyone.\n The owners of these establishments are free to run their businesses as they like (just as I’m free to take my business elsewhere). But, if they really care about uplifting their workers, they should worry less about corporate virtue-signaling and more about actually improving their business. And if they still have bandwidth to do some good after that, they might work on opposing all the myriad ways—the minimum wage, occupational licensing, etc—that government gets in the way of workers participating in and benefiting from “growing the pie.”\n “Most economic fallacies derive from the tendency to assume that there is a fixed pie, that one party can gain only at the expense of another,” Milton Friedman once observed.\n  One of the reasons the fixed pie fallacy persists, no doubt, is this hyperfocus on equity. Some might look at equity surcharges as just a shrewd ploy for restaurants to get more for their workers, but that doesn’t mean they are benign.\n Focusing on equity tends to place labor and business at odds, implying that workers are being exploited and deprived of their fair share. This idea—that the employer-employee relationship is inherently exploitative—is grounded in Marxism, and has  been effectively refuted by economists. This mindset taps into resentment and class struggle, two pillars of socialism, and teaches people to see the world through the lens of oppression and conflict.\n To be sure, in a new twist, restaurants appear to be trying to pass this alleged exploitation onto customers, perhaps to placate disgruntled workers or maybe to tap into social justice currents. But this doesn’t make the ideas less harmful.\n Whatever the case, I suspect attempts to make customers pay “equity” chargers will backfire.\n Customers  like having choices. That’s one of the many beauties of markets. Consumers can choose how we respond to things. If you don’t like Twitter’s aggressive policies on speech, fine; you can go somewhere else. If you don’t care for Chick fil A’s charitable donations, you can eat at Popeye’s. If a car dealership treats you poorly, you can take your business elsewhere.\n And if you don’t like your favorite restaurant’s new equity surcharge policy, you can simply exercise  the power of exit—and I intend to.\n The choice for me was simple:  My favorite restaurant added an equity surcharge. What should I do?\n I will not be eating at Broders’ again, I’m sad to say. At least not while I’m being slapped with equity charges.", "posttime": "2021-06-25 08:16:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股票,adding,餐厅", "title": "餐馆正在向客户提供股票费用检查以对抗压迫 ", "title_en": "Restaurants Are Adding Equity Charges to Customers Checks to Fight Oppression", "transed": 1, "url": "https://fee.org/articles/restaurants-are-now-adding-equity-charges-to-customers-checks-to-fight-oppression/", "via": "", "real_tags": ["股票", "adding", "餐厅"]}, {"category": "", "categoryclass": "", "imagename": "a5776cb4a2606b8cc3b74ae46628da69.jpg", "infoid": 1068145, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "争夺令人讨厌的RoboCalls的斗争中的一个艰难截止日期是6月30日。截至该日期，美国的每个主要语音提供商，包括＆amp; T，Verizon和T-Mobile和有线提供商康卡斯特的电话公司实施一种称为搅拌/摇动的技术。\n 那个＆＃39;对于涉及健康相关的骗局的电话jangling的每个人都是jangus的好消息，到了汽车保证和假银行为信用卡提供不存在的利率折扣。多年来，非法Robocalls的祸害困扰着公众。它＆＃39;第1名消费者投诉以及联邦通信委员会的首要任务。\n 根据Youmail的一年的前五个月，美国消费者在今年前五个月内收到了220亿卢比的RoboCalls，该公司是一家专门拦截Robocalls的公司的520亿robocalls。\n                                             RoboCalls使用自动拨号器和录制的消息。公平，并非所有Robocalls都不糟糕或烦人。一些企业和公共实体使用RoboCalls传达重要信息。例如，您的药房可以使用自动录音来告诉您您的处方已准备好被拾取，或您的孩子＆＃39;学校可能会提醒你雪天。这些是合法的Robocalls，他们要求消费者注册接收它们。\n 然后有非法RoboCallers。因为Robocalls是便宜的，他们被世界各地的诈骗者开采，他们每年都用它们欺骗来自美国人的数十亿美元。这个问题已经变得如此糟糕的是，我们中的许多人在戒指时答案，特别是如果它在呼叫者ID上的一个不熟悉的号码，特别是如果它在响起的话。欺诈者常常伪装他们的电话号码，以欺骗人们回答。\n 由于搅拌/震动的实施，这将在地平线上结束这些恼人和昂贵的呼叫，这将需要语音提供商来验证呼叫来自哪里。那个＆＃39;在哪里FCC＆＃39; 6月30日的截止日期。为了帮助您掌握这一点和其他努力戳出ROBOCALL，CNET已经放在一起这个常见问题解答。\n  ＆＃34;搅拌＆＃34;代表＆＃34;安全电话身份重新审视，＆＃34;和＆＃34; Shaken＆＃34;对于＆＃34;基于签名的使用令牌处理所谓的信息。＆＃34;搅拌是技术方案，Shaken是可以在新的RoboCall缓解数据库中跟踪调用的框架。 \n它的工作方式是，搅拌/摇动技术确保通过电话网络旅行的呼叫具有他们的来电者ID＆＃34;签名＆＃34;由于始发运营商和其他运营商验证，在呼叫到达您之前合法。简而言之，该技术验证电话呼叫＆＃39; s原点，并确定有关呼叫者ID匹配的某些信息。\n 在CNET＆＃39;移动专家发现智能手机和运营商的最新消息和最佳评论。\n  欺骗是当呼叫者通过故意伪造传输到呼叫者ID显示的信息来伪装其身份。诈骗者这样做是为了使呼叫更轻松可追溯。此外，通过使用所谓的邻居欺骗，这使得它看起来好像数字是你可能已经知道或信任的本地人，诈骗者试图欺骗你拿起电话。\n  在呼叫者ID法案中的真相下，FCC＆＃39; S规则禁止任何人或实体通过意图欺诈，造成伤害或错误地获取价值的任何人或不准确的来电显示误导性或不准确的来电者ID信息。欺骗ISN＆＃39; T非法如果没有意图造成伤害。\n  在某些情况下，可以允许隐藏身份的欺骗＆＃39;例如，致力于案件的执法机构，家庭暴力的受害者，或希望讨论私人医疗事事的医生可能都免除这些规则。\n  追查（电话Robocall滥用刑事执法和威慑）法案，于2019年12月签署了法律，由唐纳德特朗普总统签署了法律。它基本上符合所有语音服务提供商强制性的搅拌/摇动技术。\n 法律指示FCC提出规则，要求语音提供商在18个月内实现该技术。 \nFCC为6月30日的截止日期，为提供电话服务的公司来实现炒作/摇动，呼叫验证系统，即＆＃39; LL让诈骗者难以隐藏他们的数字。电话公司还必须在公共数据库中发布RoboCall预防策略。\n 该计划是由追查法案于2019年底创建的。 FCC于2020年3月发布了该标准，并设定了服务提供商在2021年6月底遵守的服务提供商截止日期。\n 主要的电话公司，如AT＆amp; T，Verizon和T-Mobile以及有线提供商康卡斯特，并曾表示他们＆＃39;重新实施搅拌/摇晃。多个运营商要求延期，但FCC在3月份否认了这些请愿。\n  这是希望。但可悲的是，它可能会赢得＆＃39; t是现实。一方面，一些运营商已经已经实施搅拌/摇动。所以截止日期赢得了＆＃39; T必须为大多数手机公司标志着硬盘。它＆＃39;是一个技术和框架，他们一直在实施和部署一段时间。\n 第二个原因是诈骗者总是以新的方式来制作非法Robocalls。悲伤的事实是，使这些电话很便宜，诈骗人们是有利可图的。\n ＆＃34;它最终是一场Whack-a-moly，＆＃34; FCC委员Brendan Carr在5月份接受CNET采访时表示。 ＆＃34;所以长期解决方案仍然很困难。我们＆＃39; ll看到我们可以做出多少进展。＆＃34;\n  此前，FCC已给予小型提供商，那些具有少于100,000名订户的人，直到2023年6月30日，以实施搅拌/摇摇欲坠。扩展将允许较小的提供商评估实施成本和计划部署。但FCC于4月份表示，有证据表明大量的非法RoboCalls来自较小的提供商的子集，因此该机构已经提出了全年向这些运营商的截止日期达到截止日期。 \n司法部，联邦贸易委员会和FCC共同努力打击Robocalls。 2020年3月，DOJ对两个互联网电话提供商赢得了禁令，据称向消费者传播了数亿次呼叫。\n  原子能机构加强了执法，向促进诈骗电话和对非法RoboCallers实施罚款的运营商发送停止和停止信件。在一个案例中，FCC罚款德州电话推销员2.25亿美元用于欺骗大约10亿Robocalls。\n 虽然6月30日日期是运营商实施搅拌/摇动的截止日期，但许多运营商已经开始使用该技术。由于这些运营商已经搅拌/摇摇欲坠，因此FCC更容易追踪非法传输呼叫的运营商。由于所有运营商符合实施截止日期，它可能会更容易。\n ＆＃34;我们需要使用我们必须使用的每个工具，从我们的网络上获取这些垃圾呼叫，＆＃34;代理FCC椅Jessica Rosenworcel在5月份发表声明。 ＆＃34;从这些新的停机和停止字母搅拌/摇动到大型罚款和我们的Robocall缓解数据库，我们将尽一切努力保护消费者免受这些滋扰，＆＃34;罗森瓦尔说。 ＆＃34;我们＆＃39;在我们得到Robocallers，解释器和诈骗者的情况下，重新停止。＆＃34;\n Carr在接受CNET接受采访中，可能会有没有用于停止这些呼叫的银弹。他说，需要多种技术和政策来解决这个问题。\n ＆＃34;我认为结合那个＆＃39; s＆＃39; s将打破这些robocallers的背部，＆＃34;卡尔说。 ＆＃34;如果它没有，那么我们＆＃39; ve Get继续创新并找到更多的技术，这些技术将停止这一点，因为当然是那些出现的坏行动者有一个有利润的动机来找到一个围绕这些系统的方式。＆＃34;\n  本月早些时候，来自纽约的民主党人参议院多数领导者查克·舒默和参议员·吉拉德（Kirsten Gillibrand）推出了阻止令人讨厌，邪恶和令人发指的电话（不要）呼吁增加对个人，并通过未经请求的人故意捕获消费者的公司的惩罚和非法Robocalls。 \n允许最多一年的监狱，故意和故意违反TCPA。  TCPA下的最大处罚是伪造呼叫者ID，从10,000美元到20,000美元。  ＆＃34;美国人绝望地＆＃39;挂断电话＆＃39; 而且不要呼唤法案是我们需要在＆＃39上切割绳索的解毒剂;欺骗＆＃39; 诈骗尤其是老年人纽约人，＆＃34; 舒默在一份声明中说。  吉祥地补充道，＆＃34;这个重要立法将为FCC提供打击诈骗者违反电话消费者保护法案的诈骗者所需的工具，并且常常，目标和欺诈高级美国人。＆＃34; ", "note_en": "A big deadline in the fight to beat back those annoying robocalls is coming June 30. As of that date, every major voice provider in the US, including phone companies AT&amp;T, Verizon and T-Mobile and cable provider Comcast, will have to implement a technology called Stir/Shaken.\n That&#39;s good news for everyone whose phone has been jangling with bogus phone calls involving health-related scams, expiring car warranties and fake banks offering nonexistent interest-rate discounts for credit cards. For years, the scourge of illegal robocalls has plagued the public. It&#39;s the No. 1 consumer complaint and a  top priority at the Federal Communications Commission.\n US consumers have received just under 22 billion robocalls in the first five months of the year, on pace to hit over 52 billion robocalls for the year, according to YouMail, a company specializing in blocking robocalls.\n                                             Robocalls use automated dialers and recorded messages. To be fair, not all robocalls are bad or annoying. Some businesses and public entities use robocalls to communicate important information. For example, your pharmacy may use an automated recording to tell you your prescription is ready to be picked up, or your kids&#39; school may be alerting you to a snow day. These are legitimate robocalls, and they require that consumers sign up to receive them.\n Then there are the illegal robocallers. Because robocalls are cheap to make, they&#39;ve been exploited by scammers all over the world, who use them to defraud billions of dollars from Americans every year. The problem has gotten so bad that many of us don&#39;t answer the phone when it rings, especially if it&#39;s an unfamiliar number on the caller ID. All too often, scammers disguise their phone numbers to trick people into answering.\n An end to these annoying and costly calls could be on the horizon thanks to the implementation of Stir/Shaken, which will require voice providers to verify where calls are coming from. That&#39;s where the FCC&#39;s June 30 deadline comes in. To help you get a handle on that and other efforts to stamp out robocalls, CNET has put together this FAQ.\n  &#34;Stir&#34; stands for &#34;secure telephone identity revisited,&#34; and &#34;Shaken&#34; for &#34;signature-based handling of asserted information using tokens.&#34; Stir is the technical protocol, and Shaken is the framework by which calls can be tracked in the new robocall mitigation database.\n The way it works is that Stir/Shaken technology ensures that calls traveling through phone networks have their caller ID &#34;signed&#34; as legitimate by originating carriers and validated by other carriers before the calls reach you. In short, the technology authenticates a phone call&#39;s origin and makes certain the information on the Caller ID matches.\n Discover the latest news and best reviews in smartphones and carriers from CNET&#39;s mobile experts.\n  Spoofing is when callers disguise their identity by deliberately falsifying the information transmitted to your caller ID display. Scammers do this to make calls less easily traceable. Also, by using so-called neighbor spoofing, which makes it appear as though the number is a local one you may already know or trust, scammers try to trick you into picking up a call.\n  Under the Truth in Caller ID Act, the FCC&#39;s rules prohibit any person or entity from transmitting misleading or inaccurate caller ID information with the intent to defraud, cause harm, or wrongly obtain anything of value. Spoofing isn&#39;t illegal if there&#39;s no intent to cause harm.\n  Spoofing that&#39;s intended to hide identity can be permitted under certain circumstances. For example, law enforcement agencies working on cases, victims of domestic violence, or doctors wishing to discuss private medical matters may all be exempt from these rules.\n  The Traced (Telephone Robocall Abuse Criminal Enforcement and Deterrence) Act, was signed into law in December 2019 by President Donald Trump. It basically   makes compliance with the Stir/Shaken technology mandatory for all voice service providers.\n The law directed the FCC to come up with rules to require voice providers to implement the technology within 18 months.\n  The FCC has set a deadline of June 30 for companies that provide phone service to implement Stir/Shaken, the  call verification system that&#39;ll make it harder for scammers to hide their numbers. Phone companies will also have to  publish robocall prevention strategies in a public database.\n The program was created in late 2019 by the  Traced Act. The FCC released the standards in March 2020, and it set a deadline for service providers to comply by the end of June 2021.\n Major phone companies, such as  AT&amp;T,   Verizon and  T-Mobile, as well as cable provider  Comcast, have said they&#39;re implementing Stir/Shaken. Multiple carriers asked for an extension, but the FCC  denied those petitions in March.\n  That&#39;s the hope. But sadly, it probably won&#39;t be the reality. For one thing, some carriers have already been implementing Stir/Shaken. So the deadline won&#39;t necessarily mark a hard switchover for most phone companies. It&#39;s a technology and framework they&#39;ve been implementing and deploying for a while.\n The second reason is that scammers are always coming up with new ways to make illegal robocalls. The sad truth is that making these calls is cheap and scamming people is lucrative.\n &#34;It ends up being a game of whack-a-mole,&#34; FCC Commissioner Brendan Carr said in an interview with CNET in May. &#34;So the long-term solution is still difficult. We&#39;ll see how much progress we can make.&#34;\n  Previously, the FCC had given small providers, those with fewer than 100,000 subscribers, until June 30, 2023, to implement Stir/Shaken. The extension would allow smaller providers to evaluate the implementation costs and plan deployment. But the FCC said in April that there&#39;s evidence a large volume of illegal robocalls are coming from a subset of smaller providers, so the agency has proposed bumping up the deadline for these carriers by a full year.\n  The Department of Justice, the Federal Trade Commission and the FCC have worked together to combat robocalls. In March 2020, the DOJ  won an injunction against two internet telephone providers that allegedly transmitted hundreds of millions of calls to consumers.\n  The agency has stepped up its enforcement, sending cease-and-desist letters to carriers that facilitate scam calls and imposing fines on illegal robocallers. In one case, the FCC fined Texas telemarketers $225 million for spoofing roughly 1 billion robocalls.\n Though the June 30 date is the deadline for carriers to implement Stir/Shaken, many carriers have already started using the technology. As these carriers have gotten Stir/Shaken working, it&#39;s gotten easier for the FCC to track down carriers that illegally transmit calls. And it could potentially get even easier as all carriers meet the deadline for implementation.\n &#34;We need to use every tool we have to get these junk calls off of our networks,&#34; acting FCC Chair Jessica Rosenworcel said in a  statement in May. &#34;From these new cease-and-desist letters to STIR/SHAKEN implementation to large fines and our robocall mitigation database, we are going to do everything we can to protect consumers from these nuisance calls,&#34; Rosenworcel said. &#34;We&#39;re not going to stop until we get robocallers, spoofers, and scammers off the line.&#34;\n Carr noted in an interview with CNET in May that there isn&#39;t a  silver bullet for stopping these calls. Multiple technologies and policies are needed to address this issue, he said.\n &#34;I think combined that&#39;s what&#39;s going to break the back of these robocallers,&#34; Carr said. &#34;If it doesn&#39;t, then we&#39;ve got to continue to innovate and find more technologies that are going to stop this, because certainly the bad actors that are out there have a profit motive to find a way around these systems.&#34;\n  Earlier this month, Senate Majority Leader Chuck Schumer and Sen. Kirsten Gillibrand, both Democrats from New York, introduced the Deter Obnoxious, Nefarious, and Outrageous Telephone (Do Not) Call Act to increase penalties for individuals and companies intentionally preying on consumers through unsolicited and illegal robocalls.\n  Allow prison terms of up to one year for willfully and knowingly violating the TCPA.\n  Double the maximum penalties under the TCPA for falsifying caller ID, from $10,000 to $20,000.\n &#34;Americans are desperate to &#39;hang up the phone&#39; and the DO NOT Call Act is the antidote we need to cut the cord on &#39;spoofing&#39; scams that target especially elderly New Yorkers,&#34; Schumer said in a statement.\n Gillibrand added, &#34;This vital piece of legislation will give the FCC the tools needed to combat scammers who grossly violate the Telephone Consumer Protection Act and, all too often, target and defraud senior Americans.&#34;", "posttime": "2021-06-25 07:40:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,喜欢,love,电话", "title": "讨厌Robocalls？ 你会喜欢截至6月30日的内容 - 美国的语音提供商只有几天的时间来实现旨在遏制令人讨厌和昂贵的Robocalls的搅拌/摇动科技。 ", "title_en": "Hate robocalls? You'll love what's coming as of June 30 - US voice providers have just days to implement the Stir/Shaken tech designed to curb annoying and costly robocalls.", "transed": 1, "url": "https://www.cnet.com/news/hate-robocalls-youll-love-whats-coming-as-of-june-30/", "via": "", "real_tags": ["美国", "喜欢", "love", "电话"]}, {"category": "", "categoryclass": "", "imagename": "4eb782fa34e7a3d418bd1a062275191a.png", "infoid": 1068144, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "WISK在其4月诉讼中声称其设计与Archer几乎相同，而且相似之处是前WISK员工（谁曾被弓箭手雇用）窃取专有工作文件的结果。在这份新的申请中，Archer据称，它分享了一个12转子倾斜设计与Wisk的高级工程师Geoff Long的计划，弓箭手正在考虑招聘。 Archer声称，在WISK提交专利申请前几周，长期共享弓箭手的计划。\n 还在关注吗？ Archer还表示，它聘请了第三方进行了法医分析，该分析没有发现任何关于Archer系统或属于前WISK-Now-Archer员工的设备的据称被盗的文件。\n  申请是回应5月份提交的禁令的申请，要求法院立即禁止其竞争对手，从使用其声称的52个商业秘密。这是一个可能对弓箭手有可能具有灾难性影响的要求，因为公司本身在申请中承认。弓箭手争辩说，批准禁令将“无限期的离线”，并对射手及其合作伙伴和供应商的网络构成“严重危险”。\n “WISK的法律和媒体Blitz威胁要透露弓箭手的预期合并及其业务合作伙伴关系，并迫使弓箭手重新瞄准捍卫这一诉讼的重要资源，”Archer在申请中说。本公司进一步要求，如果应授予禁令，它也应该需要11亿美元的债券 - 如果法院最终与弓箭手联系起来，那么WISK必须支付。\n Wisk是为了回答申请，向TechCrunch发送了以下陈述：“Archer的最新申请充满了不准确性，并试图分散来自严重和广泛的挪用索赔的索赔。归档没有变化。我们期待在法庭上继续我们的案例，以证明Archer对Wisk知识产权的不当使用。“\n 案件没有，该诉讼已在美国地区法院申请加州北区。 5：21-CV-2450。 ", "note_en": "Wisk claimed  in its April lawsuit that its design is nearly identical to Archer’s, and that the similarities are the result of a former Wisk employee (who was later hired by Archer) stealing proprietary work files. In this new filing, Archer alleged that it shared its plans for a 12-rotor tilting design with Geoff Long, a senior engineer at Wisk, whom Archer was considering recruiting. Archer alleges that Long shared Archer’s plans with Wisk executives weeks before Wisk filed its patent application.\n Still following? Archer also says that it hired a third party to conduct a forensic analysis, which found no evidence of any of the allegedly stolen documents on Archer’s systems or the devices belonging to the former Wisk-now-Archer employee.\n  The filing was made in response to  an injunction Wisk filed in May, requesting that the court immediately prohibit its rival from using any of the 52 trade secrets it alleges were stolen. It’s a request that could have potentially catastrophic effects on Archer, as the company itself admits in the filing. Archer argues that approving the injunction would take it “offline indefinitely” and pose a “grave danger” to Archer and its network of partners and suppliers.\n “Wisk’s legal and media blitz is threatening to derail Archer’s anticipated merger and its business partnerships and compelling Archer to redirect significant resources to defend this lawsuit,” Archer says in the filing. The company further requested that if an injunction should be granted, it should also require a $1.1 billion bond – which Wisk would have to pay should the court ultimately side with Archer.\n Wisk, in response to the filing, sent the following statement to TechCrunch: “Archer’s latest filing is full of inaccuracies and attempts to distract from the serious and broad scope of misappropriation claims it faces. The filing changes nothing. We look forward to continuing our case in court to demonstrate Archer’s improper use of Wisk’s intellectual property.”\n The suit was filed in the U.S. District Court for the Northern District of California under case no. 5:21-cv-2450.", "posttime": "2021-06-25 07:39:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,aviation,secret,弓箭手", "title": "Archer Aviation击败竞争对手Wisk Aero在商业秘密诉讼中的禁令请求 ", "title_en": "\n\t\t\t\tArcher Aviation hits back against rival Wisk Aero’s request for injunction in trade secret suit\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/archer-aviation-hits-back-against-rival-wisk-aeros-request-for-injunction-in-trade-secret-suit/", "via": "", "real_tags": ["商业", "aviation", "secret", "弓箭手"]}, {"category": "", "categoryclass": "", "imagename": "4ed5a60dafb181e17a8c1d6005a5f6de.jpg", "infoid": 1068143, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您的企业在哪里采用AI采用曲线？采取我们的AI调查来了解。\n BlockChain.com将让人们在区块链交易中使用人类可读的用户名，因此由于与不可阻挡的域名合作。\n 基于旧的Francisco的BlockChain.com现在支持不可迁移的域，这是BlockChains的域名提供程序，这些提供程序是加密货币后面的安全透明数字解剖员。这是一个很大的交易，因为BlockChain.com是世界上最大的加密钱包提供商，人们已经绊倒了不可能记住的编码名称。\n  当人们为钱包或与他们一起使用的密码丢失这些名称时，他们往往无法恢复他们的名字。这种特殊的交易不会帮助您使用密码，但它确实有助于用户名。这有助于人们更轻松地汇集彼此，错误的错误。\n   BlockChain.com拥有200个国家的3200万次验证的用户，他们现在可以将Crypto发送到简单，人类可读的用户名，而不是全长钱包地址。\n 通过这种集成，不可阻止的域和BlockChain.com通过在发送资金时，通过删除人为错误的风险，使BlockChain.com用户和50多个钱包和由不可阻挡的域支持的交换机之间的交易大大简化了众多人为错误的Crypto，可以更好地访问。\n 传统上，发送比特币，形象，国会大战和其他加密货币需要进入收件人的25到42位数的字母数字钱包地址，表示不可阻挡的域名的首席执行官Matthew Gould表示，在一个与Venturebeat进行了面试中表示。 \n如果一个人缺口或错误的钱包地址，那些资金可以永远丧失。这是可怕的，我回想一下，它阻止了我以这种方式向某人发送付款。\n “如果你在区块链交易上有拼写错误，那么金钱就会消失，”古尔德说。 “这是情绪恐惧，这不好，因为你的第一次消费者经验是恐惧你第一次发送加密货币。而且我不知道你是否曾经在比特币或其他东西上发出过付款，但你对它感到紧张。这是一个糟糕的情感体验。“\n  “如果你在一个房间里得到10个加密人群，你问他们采用的障碍，更好的加密货币UX将成为他们提到的三件事之一，”他说。\n 这里的简单类比是您的Internet协议（IP）地址。对于常规互联网，更容易记住Google.com比记住他们的IP地址更容易。更容易记住你的名字比你的密码收金机的六角地址更容易。\n “有趣的是，这是一个历史历史重复的案例，因为我们在90年代中的计算机网络做了完全相同的事情，那里在那里看到网站的第一种方法实际上是使用IP地址，”Gould说。 “你实际上不得不记得长长的数字，以便在互联网上找到第一个内容。然后他们为那些来发明了一个命名服务，以便您可以使用.com名称。这是一个非常相似的东西。“\n   不可阻挡的域通过引入人类可读的.crypto用户名来解决这一点，兼容50多个钱包和交换，包括BlockChain.com。现在，而不是“156i6hjfmwb1h2beskpfvz2tqugqo4vs2w”，用户可以简单地键入“[yourname] .crypto”将钱送到其他人或将其转移到帐户之间。\n Gould表示，该解决方案类似于Venmo这样的支付系统，这使得将钱汇给朋友，因为您可以简单地打开一个应用程序，然后点击该人的脸部以将其送货。 \n通过减少向未知地址发送资金的情绪恐惧和摩擦，不可阻挡的域可以使密码更能访问主流用户。它为您提供向您愿意汇款的自由。\n Gould表示很难相信它需要一段时间来解决问题。\n “对我来说很疯狂，”他说。 “你有一个万亿美元的资产课程。人们正在向这些真正的长银行账号发送它。在视觉上，人们正在做的是荒谬的。我认为这只是显示我们的早期。这真的很大，但科技仍然很生气。这些事情很重要。我们需要使正常人更容易，我们需要做到这一点，以便在没有这种恐惧的情况下，您可以感到舒适地发送这些交易，或者采用将会缓慢。“\n BlockChain.com的产品经理Amadeo Pellicce表示，该公司努力使加密更容易使用，因此它可以为互联网建立新的金融系统。这里的第一步是使用更多熟悉的用户名来易于向朋友和家人发送加密。这大大减少了错误的可能性，而不会影响用户安全性。 Pellicce说，使加密付款尽可能简单地发送电子邮件，帮助铺平了更广泛采用的加密。\n  不可阻挡的域名已经注册了超过一百万的域名，每个铸造铸造在Ethereum BlockChain上的非繁琐令牌（NFT）。随着发送和接收资金，这些NFT域用于创建分散的网站来发布内容和访问Web3。 BlockChain域已经成为Crypto钱包的标准，并且互操作性是不可阻挡的域名使命的最前沿。\n BlockChain.com最近筹集了3亿美元，由DST Global，Lightspeed Ventfure Partners和Vy Capital的合作伙伴领导，贷款估值。自2012年以来，7600万钱包使用BlockChain.com进行了800亿美元的交易。迄今为止，BlockChain.com已达到4.9亿美元到日期。\n 在2018年推出，不可阻挡的域名是一个区块链域名提供商和分散网络的网关。不可阻挡的域允许任何人购买分散的域名，该域名被铸造为Ethereum BlockChain上的NFT，使所有者提供全部所有权和控制。域名可用于超过50个钱包和交换的付款。该公司由Draper Associates和Boost VC支持，并由Ethereum基金会和Zilliqa Foundation的赠款支持。 \n还有以下问题来解决，例如确保区块链上的交易可以保持私密。现在的方式，很多人都可以看到区块链上的交易，但经常交易的细节尚不清楚。随着时间的推移，当人们弄清楚如何正确配置支付时，这将得到解决，所以请说。\n “隐私技术是落后于街区其余部分的几年，”古尔德说。 “我们实际上与几个团队合作，展示将CryptoCurry发送到区块链域名并私下进行。所以它在技术上是可行的。我觉得它是。但这当时，这不是我们的核心产品。“\n VidtureBeat＆＃39; S使命是成为技术决策者的数字城市广场，以获得有关转型技术和Transact的知识。您网站提供有关数据技术和策略的基本信息，以指导您的领导您的组织。我们邀请您成为社区的成员，访问：门控思想领导者内容和对我们奖化事件的折扣访问，如转换2021：了解更多\n 成为会员 ", "note_en": "Where does your enterprise stand on the AI adoption curve? Take our  AI survey to find out.\n Blockchain.com will let people use human-readable usernames in  blockchain transactions thanks to a partnership with  Unstoppable Domains.\n San Francisco-based Blockchain.com now supports Unstoppable Domains, a domain name provider for blockchains, which are the secure and transparent digital ledgers behind cryptocurrencies. That’s a big deal because Blockchain.com is the world’s largest crypto wallet provider, and people have been stumbling around with encoded names that are impossible to remember.\n  And when people lose these names for their wallets or the passwords that go with them, they are often unable to recover their names. This particular deal won’t help you with your passwords, but it does help with usernames. And that helps people send money to each other more easily, with fewer mistakes.\n   Blockchain.com has 32 million verified users across 200 countries, and they can now send crypto to simple, human-readable usernames instead of full-length wallet addresses.\n Through this integration, Unstoppable Domains and Blockchain.com are making crypto more accessible for all by removing the risk of human error when sending funds, drastically simplifying transactions between Blockchain.com users and 50-plus other wallets and exchanges supported by Unstoppable Domains.\n Traditionally, sending Bitcoin, Ethereum, Doge, and other cryptocurrencies requires entering the recipient’s 25- to 42-digit alphanumeric wallet address, said Matthew Gould, CEO of Unstoppable Domains, said in an interview with VentureBeat.\n  If a person mistypes or miscopies a wallet address, those funds can be lost forever. That’s terrifying, and I recall it stopped me from sending a payment to someone in that way.\n “If you have a typo on a blockchain transaction, the money’s gone forever,” said Gould. “It’s emotionally terrifying, which is not good because  your first consumer experience is fear the first time you ever send cryptocurrency. And I don’t know if you’ve ever sent a payment in Bitcoin or something else, but you’re going to be nervous about it. This is a bad emotional experience.”\n  “If you get a group of 10 crypto people in a room and you ask them about the barriers to adoption, better cryptocurrency UX is going to be one of the top three things that they mention,” he said.\n The simple analogy here is your internet protocol (IP) addresses. For the regular internet, it’s a lot easier to remember google.com than it is to remember their IP address. It’s a lot easier to remember your name than your hex address for your cryptocurrency.\n “What is funny is this is a case of history repeating itself because we did the exact same thing with computer networks in the 90s, where the very first way to look up websites was actually using IP addresses,” Gould said. “You actually had to remember long strings of numbers in order to find the very first content on the internet. And then they invented a naming service for those so that you could use .com names. It’s a very similar thing.”\n   Unstoppable Domains solves this by introducing human-readable .crypto usernames compatible with 50+ wallets and exchanges, including Blockchain.com. Now, instead of “156i6HJfMWb1h2BEsKpfvZ2tQugqo4vs2w,” users can simply type “[YourName].crypto” to send money to others or transfer it between accounts.\n Gould said that the solution is similar to payment systems like Venmo, which make it easier to send money to a friend because you can simply open an app and tap on the person’s face to send them money.\n And by reducing the emotional fear and friction around sending money to an unknown address, Unstoppable Domains can make crypto more accessible to mainstream users. It gives you the freedom to send money to whoever you wish.\n Gould said it’s hard to believe it is taking a while to solve the problem.\n “It’s crazy to me,” he said. “You have a trillion-dollar asset class. And people are sending it around to these really long bank account numbers. And visually, it is kind of ridiculous that people are doing it. And I think that just shows how early we are.  It’s really big, but the tech is still very raw. And these things are important. We need to make this easier for normal people and we need to make it so that you can feel comfortable sending these transactions without that fear or else adoption is going to be slow.”\n Amadeo Pellicce, product manager at Blockchain.com, said that the company has worked hard to make crypto easier to use so it can build a new financial system for the internet. The first step here is making it easy to send crypto to friends and family using more familiar-looking usernames. This drastically reduces the potential for errors without compromising on user security. Making crypto payments as easy as sending an email helps pave the way for wider adoption of crypto, Pellicce said.\n  Unstoppable Domains has registered more than a million domain names, with each minted as an nonfungible token (NFT) on the Ethereum blockchain. Along with sending and receiving funds, these NFT domains are used to create decentralized websites to publish content and access Web3. Blockchain domains have already become the standard for crypto wallets, and interoperability is at the forefront of Unstoppable Domains’ mission.\n Blockchain.com recently raised $300 million at a $5.2 billion, post-money valuation, led by partners of DST Global, Lightspeed Venture Partners, and VY Capital. Since 2012, 76 million wallets have conducted $800 billion in transactions using Blockchain.com. To date, Blockchain.com has raised $490 million to date.\n Launched in 2018, Unstoppable Domains is a blockchain domain name provider and gateway to the decentralized web. Unstoppable Domains allows anyone to purchase a decentralized domain name that is minted as an NFT on the Ethereum blockchain, giving the owner full ownership and control. Domain names can be used for payments across more than 50 wallets and exchanges. The company is backed by Draper Associates and Boost VC, and supported by grants from the Ethereum Foundation and Zilliqa Foundation.\n  There are future problems to tackle, like ensuring that transactions on the blockchain can stay private. The way it is now, many people can see the transactions on the blockchain, though often the details of the transaction aren’t clear. Over time, this will get solved as people figure out how to properly configure payments, Gould said.\n “Privacy technology is a few years behind the rest of the blockchain technology,” Gould said. “We’ve actually worked with a couple of teams to demonstrate sending cryptocurrency to a blockchain domain name and doing it privately. So it is technically feasible. And I think it is. But it’s not a core product for us at this moment in time.”\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-06-25 07:33:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "区块链,交易,区块,blockchain,域名", "title": "blockchain.com将让人们在区块链交易中使用人类可读的用户名 ", "title_en": "Blockchain.com Will Let People Use Human-Readable Usernames In Blockchain Transactions", "transed": 1, "url": "https://venturebeat.com/2021/06/24/blockchain-com-will-let-people-use-human-readable-usernames-in-blockchain-transactions/", "via": "", "real_tags": ["区块链", "交易", "区块", "域名"]}]