[{"category": "", "categoryclass": "", "imagename": "242abf39635cbe25fc7dda03c5ff364f.jpeg", "infoid": 1072598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一个忏悔：在过去的八年里，我一直在避免使用Docker。并不是说我不明白容器的价值，这是我第一次拿起码头我有一个非常糟糕的经历。如此糟糕，它确信我这项技术对我来说太难了。我稍后会发现，因为我的性质......", "note_en": "I have a confession: for the last eight years I have been avoiding using Docker. It’s not that I don’t understand the value of containers, it’s that the first time I picked up Docker I had a   really bad experience. So bad it convinced me that this technology was too difficult for me to master. I would find out later that because of the nature of what I…", "posttime": "2022-01-10 17:19:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,docker,编程,停止,过去", "title": "停止编程语言", "title_en": "Dockerizing a Programming Language", "transed": 1, "url": "https://bellmar.medium.com/dockerizing-a-programming-language-b39bf7574d19", "via": "", "real_tags": ["docker", "编程", "停止", "过去"]}, {"category": "", "categoryclass": "", "imagename": "c1a7360c817210c719ed9a35836d40ec.jpg", "infoid": 1072597, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，通过连接的分析在2018年推出的平台，已经通过连接的分析来茁壮成长，证明并非所有人都在交易，优惠券和奖励业务中黯淡。在去年宣布未披露的七位种子宣布的初创公司终于关闭了530万美元。\n在抓住500件初创公司，谷歌推出板和其他当地投资者等加速器的关注后，该企业筹集了320,000美元的预装种子。\n现在的购买有点，后来付费现在是模糊的，因为只有在非洲的少数突出的BNPL服务。然而，该公司似乎在全球购买时蓬勃发展的这种服务的迫在眉睫的这种服务的定位，即支付后期的服务，由于大流行引起的消费者行为而言，支付的薪水。\n“自2019年经过500个全球加速器以来，我们对Simeon和Shublicuarash团队留下了深刻的印象，即实施为尼日利亚消费者工作的奖励系统，无论现金或信用卡或在线或离线付款，校长表示。 “对于企业和银行来说，这是一个双赢，因为TUC给了他们所需的工具和数据。”", "note_en": "Yet,  ThankUCash, a platform launched in 2018 by  Connected Analytics, has managed to thrive, proving that not all is gloom in the deals, coupon and rewards business .  And to that end, the startup, which announced an undisclosed seven-figure seed last year, has finally closed the round at $5.3 million .\n VC firms 500 Global and Unicorn Growth Capital co-led the Lagos-based company’s seed round . It saw participation from U.S.-based accelerator Expert Dojo, Predictive VC, SaaS Growth Ventures, Betatron Venture Group, Accelerex Holdings. Individual investors like Andrew Dell, former CEO of HSBC and Craig Fenton of Google UK also took part.\n  The company plans to use the investment to expand within its home market Nigeria — where it operates in Lagos, Port Harcourt and Abuja — and outside to Ghana and Kenya. It also wants to improve its product offerings and add more staff.\n For years, store-like businesses in Nigeria such as supermarkets and restaurants have operated offline, relying on bookkeeping and head knowledge to record their customers’ activities in their shops. This made it difficult to offer cash back and loyalty points to customers .\n Online platforms like ThankUCash present these merchants with an opportunity to delve into rewards and help them retain loyalty and increase revenue.\n CEO  Simeon Ononobi started ThankUCash with Suraj Supekar, Madonna Ononobi and Harshal Gandole, who act as a chief technical officer, chief operating officer and senior vice president of engineering,  respectively .\n  The multi-merchant rewards platform (which means customers can hop on from one merchant to another to earn loyalty points in another) allows customers to earn rewards anytime they shop with thousands of merchants listed on its app.\n The business raised a $320,000 pre-seed after grabbing the  attention of accelerators such as 500 Startups, Google Launchpad and other local investors like  Microtraction and  Ventures Platform.\n Up until this point, ThankUCash said it has recorded over 600,000 users and onboarded over 1,000 stores on its platform . Also, it claims to have processed over $80 million in transaction volume.\n Having matured as a business, Ononobi and his team want to take on a more complicated task: building infrastructure for companies that want to offer akin services.\n “We are creating solutions that help SMEs succeed while increasing consumer buying power and opportunities.  We want to build an infrastructure for rewards, loyalty, deals, buy now, pay later, cashback,” he said to TechCrunch on a call .\n “Cashback was our low hanging fruit and an entry point. We’re still going to go into deals, couponing, gift cards, buy now, pay later, anything that will help the business grow, but at the same time, allowing the consumer increase in opportunities of buying.”\n Ononobi, a serial entrepreneur who previously built a payments company and also apps for Nigerian banks and the government, reckons that ThankUCash will do to rewards the same thing Flutterwave and Paystack did to payments in Africa.\n Some companies such as banks have launched cashback programs via debit cards to users in the past . But most of them have been generally inefficient, from setup down to collections and redeeming of points, and Ononobi argues that their inefficiencies boil down to no technical support.  ThankUCash sees a gold mine to provide plugins banks and fintechs can tap into to offer cashback and rewards .\n  The bit about buy now, pay later is fuzzy now since  only a handful of prominent BNPL services in Africa.  However , the company seems to be positioning itself for the imminent proliferation of such services buoyed by similar happenings globally where buy now, pay later services have seen an uptake as a result of pandemic-induced consumer behaviour.\n “The technology is such that we have our machines in stores.  So as customers request loans, we generate a code for it, customers input it into the POS machine and the merchant gets credited  directly . The code can only  be used  in the store chosen and only for the loan amount requested, such that at the end of the day the customer is buying straight from the merchants,” explained the founder, who also mentioned that his startup might venture into offering buy now, pay later services itself in the future.\n ThankUCash’s consumer-facing platform will remain operational. But to set the infrastructure play in motion, it has signed a partnership with payments company Interswitch to onboard its merchants.\n The company, which is also  in the process of  making integrations with payments gateways, said a couple of bank partnerships are in its pipeline.\n In terms of how ThankUCash makes money, merchants pay the company a fee on every  purchase  made in their stores.  For instance, ThankUCash gets a 1.5% commission for every customer it brings into the store to redeem a 5% cashback item.  The Lagos-based company also takes commissions for deals and plans to charge a “heavy onboarding fee” for businesses that want to use its APIs for its services, including buy now, pay later.\n ThankUCash has perfected one offering: the cashback product where merchants can get more walk-in customers. It’s improving the deals category, allowing merchants to sell products fast  (by hiring  ex-managers of DealDey, a Nigerian defunct deals company).  And while currently building out its buy now pay later infrastructure (which gives businesses a chance to sell products regardless of whether customers have money or not), ThankUCash plans to add a fourth offering soon: a remittance product where merchants can sell  directly  to the diaspora.\n The chief executive doesn’t give details about this product. Meanwhile , its investors, who have doubled down while privy to information like this,  are enthused  about “the continued evolution of the company”, a remark made by Amit Bhatti, the principal at co-lead investor 500 Global.\n “Since going through 500 Global’s accelerator in 2019, we’ve  been impressed by  Simeon and the ThankUCash team’s progress in implementing a rewards system that works for Nigerian consumers, regardless of cash or credit or online or offline payment,” said the principal. “It’s a win-win for businesses and banks, too, as TUC gives them the tools and data they need to grow.”\n The 45-man team has hired Aaron Tindiseega to lead its expansion into Kenya and the eastern Africa region .  The Ugandan professional has experience working for banks and tech companies like Uber, Standard Chartered Bank and Stanbic IBTC . For its expansion into Ghana, Kiki Anku, who has worked at Apple and a couple of startups, will spearhead the task.", "posttime": "2022-01-10 16:33:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrenthucash,thankucash,奖励", "title": "尼日利亚的Chrenthucash确保5.3米为现金返还，优惠和BNPL服务建立基础设施", "title_en": "\n\t\t\t\tNigeria’s ThankUCash secures $5.3M to build infrastructure for cashback, deals and BNPL services\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/10/nigerias-thankucash-secures-5-3m-to-build-infrastructure-for-cashback-deals-and-bnpl-services/", "via": "", "real_tags": ["奖励"]}, {"category": "", "categoryclass": "", "imagename": "ffc44112c6548ec442935518bfbb229f.jpg", "infoid": 1072596, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该股票于周一开放₹1,226，印度标准时间下跌5.3％。 PayTM一直在努力提高其股票价格以来，自首次亮相以来，其发行价格略高4,150（28.9美元）。该公司在出版时的市场概率为102亿美元，近一半在首次亮相和低于2019年底筹集了融资的160亿美元的估值。\n“巨大的谭，印度独特的科技建筑和规范支持性伙伴关系方法是关键的推动因素，我们相信。印度在金融服务中受到渗透，跨领域我们期望强劲增长。更重要的是，金融服务的第三方数字分配的渗透率明显较低，我们将在未来五年内看到强烈的加速 - 这将由印度的独特路轨周围的身份，付款和数据共享，“他们写入12月18日给客户的报告。", "note_en": "The stock, which opened Monday at ₹1,226, dropped 5.3% at 1.55 pm India standard time. Paytm, which has been struggling to improve its stock price ever since its debut, has slid 45% from its issue price of ₹2,150 ($28.9). The firm’s market cap, at the time of publishing, was $10.2 billion, nearly half of what it had sought during the debut and below the $16 billion valuation at which it raised a financing round in late 2019.\n The plunge in price follows brokerage house Macquarie’s report on Monday in which it retained its lowest rating on One97 Communications, the parent firm of Paytm, and cut its target price to ₹900 ($12.14), down from ₹1,200 that it had assigned ahead of the market debut on November 18.\n  Macquarie was the only brokerage firm which had such a grim view on Paytm’s outlook at the time of market debut. Analysts at Bernstein, in comparison, had estimated that Paytm valuation will range between $21 billion to $24 billion. (A Bernstein spokesperson did not respond to a request for comment in November.)\n “Post the various business updates and results, we believe our revenue projections, particularly on the distribution side, is at risk and hence we pare down our revenue CAGR from 26% to 23% for FY21- 26E. We are roughly cutting revenue estimates for FY21-26E on an average by 10% every year due to lower distribution and commerce/cloud revenues offset partially by higher payment revenues,” Macquarie analysts wrote Monday.\n “We cut our earnings (increase our loss projections) by 16-27% for FY22-25E owing to lower revenues and higher employee and software expenses. We cut our TP sharply by ~25% owing to lower target multiple of 11.5x (Price to Sales ratio) (from 13.5x earlier) and lower sales numbers. Maintain UP with a revised TP of Rs900.”\n The brokerage firm said RBI’s proposed digital payments regulations could cap wallet charges, which would hurt Paytm’s business, where payments side still accounts for 70% of the firm’s overall gross revenue. Macquarie also cited departure of senior Paytm executives and the shrinking ticket size for loans disbursed by Paytm as other factors that could impact the firm’s future outlook.\n  In a report in the second half of December, analysts at Morgan Stanley labeled Paytm’s stock as “overweight,” and assigned a target price of ₹1,875 ($25.2), saying the firm was “well positioned to capitalize on upcoming acceleration in digital distribution of financial services/commerce in India.”\n “Huge TAM, India’s distinctive tech architecture and regula- tory supportive partnership approach are key enablers, we believe. India is under-penetrated in financial services, and across segments we expect strong growth. More importantly, the penetration of third party digital distribution of financial services is significantly low and we will see strong acceleration over the next five years – this will be helped by the distinctive rails in India around identity, payments and data sharing,” they wrote in a report to clients on December 18.\n “Also, we believe that PAYTM’s cial services is synergistic, in line with the regulatory thought process and scalable. Balance sheet risk is low, and PAYTM’s technology capabilities to leverage alternative data sets as well as design customized products are some key value adds against the above backdrop.”", "posttime": "2022-01-10 16:33:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "库存,stock,印度", "title": "Paytm库存滴下降到历史低", "title_en": "\n\t\t\t\tPaytm stock drops to record low\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/10/paytm-stock-drops-to-record-low/", "via": "", "real_tags": ["库存", "stock", "印度"]}, {"category": "", "categoryclass": "", "imagename": "06af23f627f3a0ef10daa9352c723d19.jpeg", "infoid": 1072595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Historian Amanda Foreman在过去的目的中搜索了今天世界的起源。在此阅读以前的列。", "note_en": "Historian Amanda Foreman searches the past for the origins of today’s world. Read previous columns  here.\n  The New Year has arrived, and if you’re like me, you’ve promised yourself a slimmer, fitter and healthier you in 2022. But in the meantime there is the old you to deal with—the you who overindulged at Thanksgiving and didn’t stop for the next 37 days. No miracle diet or resolution can instantaneously eradicate five weeks of wild excess. Fortunately, modern science has provided the next best thing to a miracle: the elasticated waistband.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-01-10 16:21:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "腰带,waistband,世界", "title": "咀嚼物：腰带如何伸展", "title_en": "The Masticator: How the Waistband Got Its Stretch", "transed": 1, "url": "https://www.wsj.com/articles/how-the-waistband-got-its-stretch-11641581952", "via": "", "real_tags": ["腰带", "waistband", "世界"]}, {"category": "", "categoryclass": "", "imagename": "d6b03e0489fcd66dff5906da598a3b89.jpg", "infoid": 1072594, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每位宠物老板都知道动物喜欢玩，但笑声似乎为人类，几个猿，也许是少数鸟类善于模仿人类和猿。事实证明，根据生物学士学位发表的新文章，笑声已被“至少65种，”Jessica Wolf在UCLA新闻室写道。 “该清单包括各种灵长类动物，家养奶牛和狗，狐狸，海豹和猫鼬，以及三只鸟物种，包括长尾小鹦鹉和澳大利亚魔法。”这是从几年前开始哭泣的猿和老鼠是“只有已知的动物才能获得咯咯的动物”，因为Liz Langley在2015年在国家地理上写道。\n我们希望依靠我们的忠诚读者而不是错误的广告。为了支持开放文化的教育使命，请考虑捐款。我们接受PayPal，Venmo（@openculture），Patreon和Crypto！请在这里找到所有选项。我们谢谢你！", "note_en": "Every pet owner knows that animals love to play, but laughter seems reserved for humans, a few apes, and maybe a few birds good at mimicking humans and apes. As it turns out, according to a  new article published in the journal  Bioacoustics, laughter has been “documented in at least 65 species,” Jessica Wolf  writes at UCLA Newsroom. “That list includes a variety of primates, domestic cows and dogs, foxes, seals, and mongooses, as well as three bird species, including parakeets and Australian magpies.” This is a far cry from just a few years ago when apes and rats were the “only known animals to get the giggles,” as Liz Langley  wrote at  National Geographic in 2015.\n Yes, rats laugh. How do scientists know this? They tickle them, of course, as you can see in the video just above. (Rat tickling, it turns out, is  good for the animals’ well being.) The purpose of this experiment was to better understand human touch — and tickling,  says study author Michael Brecht, “is one of the most poorly understood forms of touch.”\n  Laughter, on the other hand, seems somewhat better understood, even among species separated from us by tens of millions of years of evolution. In their recent article,  UCLA primatologist Sasha Winkler and  UCLA professor of communication Greg Bryant describe how “play vocalizations” signal non-aggression during roughhousing. As Winkler puts it:\n When we laugh, we are often providing information to others that we are having fun and also inviting others to join. Some scholars have suggested that this kind of vocal behavior is shared across many animals who play, and as such, laughter is our human version of an evolutionarily old vocal play signal.\n Generally, humans are unlikely to recognize animal laughter as such or even perceive it at all. “Our review indicates that vocal play signals are usually inconspicuous,” the authors write. Rats, for example, make “ultrasonic vocalizations” beyond the range of human hearing. The play vocalizations of chimpanzees, on the other hand, are much more similar to human laughter, “although there are some differences,”  Winkler notes in an interview. “Like, they vocalize in both the in-breath and out breath.”\n Why study animal laughter? Beyond the inherent interest of the topic — an especially joyful one for scientific researchers — there’s the serious business of understanding how “human social complexity allowed laughter to evolve from a play-specific vocalization into a sophisticated pragmatic signal,” as Winkler and Bryant write. We use laughter to signal all kinds of intentions, not all of them playful. But no matter how many uses humans find for the vocal signal, we can see in  this new review article how deeply non-aggressive play is embedded throughout the animal world and in our evolutionary history. Read  “Play vocalisations and human laughter: a comparative review” here.\n     Josh Jones is a writer and musician based in Durham, NC. Follow him at  @jdmagness\n      We’re hoping to rely on our loyal readers rather than erratic ads. To support Open Culture’s educational mission, please consider    making a   donation . We accept    PayPal, Venmo (@openculture),    Patreon and    Crypto! Please find all options    here . We thank you!", "posttime": "2022-01-10 15:22:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "奶牛,rats,动物", "title": "UCLA研究在65种，从大鼠到奶牛发现笑声", "title_en": "UCLA Study Finds Laughter in 65 Species, from Rats to Cows", "transed": 1, "url": "https://www.openculture.com/2022/01/animals-laugh-too-ucla-study-finds-laughter-in-65-species-from-rats-to-cows.html", "via": "", "real_tags": ["奶牛", "rats", "动物"]}, {"category": "", "categoryclass": "", "imagename": "2dee4c4e38f1840055c2ce57d3905692.jpg", "infoid": 1072593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ankorstore让独立品牌将其产品销售给独立零售商。然后，这些零售商可以向自己的客户销售这些产品。这是一个B2B2C，专注于链条末端的离线销售。\n有些品牌仍然有直接处理大规模零售商，如百货商店。 ankorstore不会阻止品牌从招聘销售人员，去展览等。市场只是另一个销售渠道和另一个能够找到客户的机会。", "note_en": "Ankorstore lets independent brands sell their products to independent retailers. Those retailers can then sell those products to their own customers. It’s a B2B2C play with a focus on offline sales at the end of the chain.\n You can find a bit of everything on Ankorstore, from household supplies to maple syrup, candles, headbands, bath salts and stationery items. Some verticals have been working quite well in particular, such as non-perishable groceries, beauty products and items for your home.\n  And it’s been working extremely well given the company’s trajectory. There are currently 200,000 retailers using the marketplace and sourcing items from 15,000 brands. In May 2021, when Ankorstore  raised its Series B, the company told me it was working with 50,000 shops and 5,000 brands.\n This leads us to today’s funding round. Bond and Tiger Global led the Series C. Eurazeo and Coatue also participated in the round. Some existing investors put more money on the table, such as Index Ventures, Bain Capital Ventures, GFC, Alven and Aglae Ventures.\n There aren’t a lot of companies competing in the space. The best known wholesale marketplace is probably  Faire, a U.S.-based company that has raised  over $1 billion — it has recently started its  European expansion.  Creoate and  Orderchamp also operate wholesale marketplaces in Europe.\n   Ankorstore has teams in five countries — France, the U.K., Germany, the Netherlands and Sweden. It sells products in 23 European markets. Retailers can pay up to 60 days after ordering something and there are no hidden fees for them. Essentially, Ankorstore helps retailers focus on curation, service while the startup takes care of procurement.\n As for brands listing their items on Ankorstore, they give a 10% cut on each transaction following a higher 20% cut on the first order through Ankorstore.\n Some brands still have direct deals with massive retailers, such as department stores. And Ankorstore doesn’t prevent brands from hiring sales people, going to fairs, etc. The marketplace is just another sales channel and another opportunity to find customers.\n And this is the beauty of the business model of wholesale marketplaces. Ankorstore doesn’t have any warehouse and doesn’t own any inventory. The company only facilitates transactions between brands and retailers without any capital investment.\n “We think we’re closer to LinkedIn in the way we operate — it’s a network of professionals and we help them connect with each other,” co-founder and co-CEO Nicolas Cohen told me.\n And like all social networks, there are some strong network effects as the platform gets bigger. In particular, Ankorstore expects to expand to new categories, such as perishable food.\n The startup already has a deal with UPS to help brands with shipping. But the company hasn’t done much when it comes to warehousing solutions for small brands. That’s another opportunity down the road.\n With 400 employees and a lot of money in its bank account, Ankorstore could act as the unifying layer of this highly fragmented industry.", "posttime": "2022-01-10 13:41:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,reaches,销售", "title": "Ankorstore在推出批发市场后两年达到20亿美元的估值", "title_en": "\n\t\t\t\tAnkorstore reaches $2 billion valuation two years after launching its wholesale marketplace\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/09/ankorstore-reaches-2-billion-valuation-two-years-after-launching-its-wholesale-marketplace/", "via": "", "real_tags": ["推出", "reaches", "销售"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072592, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黎明Basciano的祖先在加利福尼亚州哥伦比亚举办了五人代，作为奴役的人，被迫留下婴儿儿子奴役到密苏里州的另一个家庭。\n“我们非常清楚地了解加利福尼亚有能力和能力，”她在6月的公开听证会上说。 “如果不是我们，那么谁？”\n在废除奴隶制之后的歧视多年的其他专家，从环境种族主义到国家的红线历史 ​​- 否定了否认金融服务对特定人民的歧视实践，以防止他们搬到某些地区 - 以及如何歧视住房实践导致学校的隔离。他们还证明了大量的迁移，当数百万黑人美国人逃到了南部和吉姆·乌鸦，如加利福尼亚如此，希望更好的生活，但发现了“排除的结构障碍”，如限制性的住房契约，禁止房主卖给黑人人们说，Isabel Wilkerson是其他太阳的温暖的作者：美国的史诗般的迁移故事。\n“赔偿是什么样的？ Basciano说，有这么多。 “我几乎感到内疚，感受到我所感受到的痛苦，但它是真实的。它与我共鸣。这是我的家人。这些是已经被告知和重现的故事，并且伤害了。你如何解决这个问题？你怎么对这个如此系统性的错误？“", "note_en": "Dawn Basciano’s ancestors arrived five generations ago in Coloma,  California, as enslaved people, forced to leave behind an infant son enslaved to another family in Missouri.\n Those ancestors, Nancy and Peter Gooch, were freed in 1850 when California joined the union as a free state, and 20 years later, their son and his family were able to join them in the fertile agricultural land north-east of Sacramento. Their journey west was funded by the sweat and hard work of Nancy, who grew and sold fruit, mended clothes and cooked for the local miners.\n  Nancy and her descendants would go on to purchase more than 400 lush acres of farmland in Coloma. But what should have been a story of triumph ended instead as a tale all too familiar to formerly enslaved Black Americans across the US. The state of California seized the majority of that land under the guise of eminent domain to build a state park, and the family never received just compensation.\n The economic injustices, the education injustices, the social injustices, the judicial injustices go on and on and on\n “We were denied the financial security and wealth associated with land ownership,” Basciano said. Pearley Monroe – Nancy’s grandson, and Basciano’s great-grandfather – spent the rest of his life mourning the loss.\n Now, the story of Basciano’s family and others are under review by a California reparations taskforce. The first of its kind in the nation, the committee is tackling the daunting and unprecedented work of recommending reparations – whether they be monetary or through policy – for Black Californians, particularly those who are descended from enslaved people.\n Shirley Weber, the California secretary of state, who authored the law that formed the taskforce, has said California must forge its own path on the thorny topic of reparations, an issue the federal government has  tried and  failed to resolve for decades.\n “We came to understand very clearly that California has the ability and the power to do it,” she said at a public hearing in June. “And if not us, then who?”\n The taskforce was formed in 2020 after the legislature and Gavin Newsom, California’s governor, approved a law requiring  the study and development of reparations proposals. Since then, the nine-person taskforce, comprising civil rights leaders, attorneys, lawmakers and academics, has spent months gathering evidence, listening to expert testimony, hosting public meetings and considering proposals, with the goal of submitting its recommendations to the legislature next summer.\n  The taskforce is undertaking this vast challenge with the knowledge that the historic injustices suffered by the descendants of slavery are deep, systemic and difficult to quantify.\n “The economic injustices, the education injustices, the social injustices, the judicial injustices go on and on and on,” said Weber in June. “We must be aggressive in our efforts to be honest and direct and to figure out what we need to do in California and be an example to the rest of the nation in how we begin to reckon with ourselves.”\n  California’s unique history with slavery and its aftermath has made addressing reparations a particularly complicated task.\n Though California joined the union as a free state in 1850, 11 years before the civil war, many who took to the Sierra Nevada foothills during the Gold Rush in the years before statehood brought enslaved people with them. While the state constitution proclaimed “neither slavery nor involuntary servitude, unless for punishment of a crime, shall ever be tolerated”, the legislature passed a fugitive slave law in 1852 that allowed those who had been brought to California before it became a free state to be returned to the south.\n In one case that went all the way to the state supreme court, a slaveholder brought a man, Archie Lee, to California after statehood and after the fugitive slave law had lapsed . But the courts argued that the slaveholder was so “young and ignorant” of California’s laws that he should not be deprived of his human property, Stacey Smith, an associate history professor at Oregon State University, testified at a public taskforce meeting in September.\n  Other experts testified about the years of discrimination that followed after slavery was abolished, from environmental racism to the state’s history of redlining – a discriminatory practice of denying financial services to specific people to prevent them from moving to or living in certain areas – and how discriminatory housing practices led to segregation in schools. They also testified about the Great Migration, when millions of Black Americans fled the south and Jim Crow to places like California, hoping for a better life, but found instead “structural barriers of exclusion” like restrictive housing covenants that forbade homeowners from selling to Black people, said Isabel Wilkerson, author of The Warmth of Other Suns: The Epic Story of America’s Great Migration.\n “The caste system followed the migrants wherever they went and became not merely a southern phenomenon, but a national one,” she testified. Black Californians also faced rampant racism in the communities where they tried to settle. Wilkerson spoke of how after Emory Hestus Holmes, a second world war veteran, purchased a three-bedroom home for his family in Pacoima, California, in 1959, the neighbors led a relentless harassment campaign in an effort to get them to move away. They prank-called them at all hours, threw rocks through their windows, burned a cross on their lawn and spray-painted on their garage: “Black Cancer Lives Here, Don’t Let It Spread”.\n  Early on in the process, the taskforce reviewed other examples of reparations programs throughout the world. Germany paid $89bn in restitution to Holocaust victims while the United States paid $20,000 each to the 82,219 Japanese Americans who were unlawfully incarcerated during the second world war. In 2015, the United States authorized payments of up to $10,000 per day – a total of $4.4m each – for the dozens of people taken hostage in Iran in 1979. A Kirsten Mullen, co-author of From Here to Equality, told the taskforce that following that same math, the payment for one Black American who endured a single decade under Jim Crow would be $36.5m.\n But the challenge before this taskforce is that so many of the injustices suffered and opportunities lost by Black Americans “can’t be quantified”, Weber said at a September meeting.\n Weber’s father was a sharecropper in Hope, Arkansas, who had to flee to California after he tried to organize for fairer wages. Descended from enslaved people, his community had been terrorized into deference following a number of race riots that ripped through the country. “You can’t quantify my father’s lack of education and the negative experience that he had just trying to survive for himself and his family,” Weber said. “You have to begin to say, OK, what do we do in terms of opening up this particular society in a way that really makes an effort to create the opportunities not just for those who are here but also for the next generation to come?\n  The scale of the injustices under assessment by the committee is almost inconceivably vast. Given stolen land and housing discrimination alone, Black Americans were denied the greatest source of family wealth today – home ownership, Wilkerson testified. This robbery of family inheritance and generational wealth has created a wealth gap between Black and white Americans that  some studies say would take 228 years to close.\n  For Dawn Basciano’s family, the loss was enormous. Not only did they lose the majority of their farmland on her paternal side – land that would have provided steady employment for extended family as well money and legacy – her fourth great-grandmother on her mother’s side had assets unfairly taken from her as well when her brother died and the state auctioned off the swaths of property he owned in downtown Sacramento under the pretense that he had no living heirs or descendants – “although his sister, my fourth great-grandmother, was alive and well”, Basciano testified in September.\n “What do reparations look like? There is so much,” Basciano said. “I almost feel guilty for feeling the pain that I feel, but it’s real. It resonates with me. This is my family. These are the stories that have been told and retold, and it hurts. How do you fix that? How do you right a wrong that is so systemic?”\n Basciano pointed out that there were hundreds of thousands of families that had stories like hers. In September, Newsom signed a law that would return a lucrative beachfront property in Manhattan Beach, California, that had been taken from the  Bruce family in the 1920s through eminent domain.  The Manhattan Beach city council had voted to oppose issuing a symbolic proclamation to apologize to the Bruces, citing concerns it would make the city liable for future lawsuits.\n Though any recommendations made by the taskforce will not be binding, Weber urged its members to be bold in their proposals, including universal preschool for all children to help address educational and childcare inequities. Other witnesses and experts have suggested monetary reparations, low-interest loans, public apologies, just compensation for stolen land, the return of historically stolen land and ways for descendants of slavery to attend university at no cost.\n The taskforce will continue to meet in the new year. Weber acknowledged that whatever the body comes up with will probably only be the beginning.\n “This 400-year challenge is not going to be solved in 400 days,” Weber said. “It will take much more than that, and a commitment from the state of California, the fifth-largest economy in the world, to make that happen.”", "posttime": "2022-01-10 13:29:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,推动,push,加利福尼亚", "title": "'如果不是美国，那么谁？'：地标推动黑色加利福尼亚人的赔偿", "title_en": "‘If not us, then who?’: The landmark push for reparations for Black Californians", "transed": 1, "url": "https://www.theguardian.com/us-news/2022/jan/09/california-reparations-slavery-african-americans", "via": "", "real_tags": ["美国", "推动", "push", "加利福尼亚"]}, {"category": "", "categoryclass": "", "imagename": "c3c4f7fcfdd0315b47d1f08722f70ca6.jpeg", "infoid": 1072591, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦法院考虑到拜登政府的疫苗接种任务 - 包括周五的口头论据的最高法院 - 已侧重于行政法问题。法令也提出了宪法问题。但是，据说应该是更简单的原因，应该保持这些要求：omicron变体的崛起。", "note_en": "Federal courts considering the Biden administration’s vaccination mandates—including the Supreme Court at Friday’s oral argument—have focused on administrative-law issues. The decrees raise constitutional issues as well. But there’s a simpler reason the justices should stay these mandates: the rise of the Omicron variant.\n  It would be irrational, legally indefensible and contrary to the public interest for government to mandate vaccines absent any evidence that the vaccines are effective in stopping the spread of the pathogen they target. Yet that’s exactly what’s happening here.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-01-10 13:24:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "任务,vaccine,应该", "title": "omicron使疫苗任务过时", "title_en": "Omicron Makes Vaccine Mandates Obsolete", "transed": 1, "url": "https://www.wsj.com/articles/omicron-makes-bidens-vaccine-mandates-obsolete-covid-healthcare-osha-evidence-supreme-court-11641760009", "via": "", "real_tags": ["任务", "vaccine", "应该"]}, {"category": "", "categoryclass": "", "imagename": "05f18cc31feb2c8925d86003986ce092.jpeg", "infoid": 1072590, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这里，我们在12月中旬记录了2021年的最后一个展示。在他回到伦敦之前，这是Frank Radice从纽约的最后演出。竞标再见，但我们小心翼翼地说，就像我们在2020年那样的良好的谜语。很高兴对我们培养的徒劳的友谊感到乐意，很高兴能够欣赏到任何地方的工作流程但仍然富有成效。", "note_en": "Here we go with the last show of 2021, recorded in mid-December. It was Frank Radice’s last show from New York before he returned to London. It was nice to bid the year goodbye, but we were careful not to say good riddance like we did in 2020. It was nice to feel good about the Zoom-connected friendships we nurtured, and nice to appreciate the flow of working from anywhere and yet still being productive.\n For me, the heartbeat of tech and its impact on so many things we struggle with — politics, streaming, and the media business — was and remains palpable. It may be that crypto will find its moment, but I wouldn’t gamble on it. The midterms loom, and social networks are turning topsy-TicTok and live audio, but I wouldn’t bet on the kind of numbers that will turn Wall Street on quite yet if at all. Newsletters are looking more and more like publishers, and publishers are going startup to head it off at the pass, but it will take talent not venture money to make it stick.\n  Not since Bill Gates and the Google twins ruled the world have we seen such a shift in the stars that define the nighttime skies. Dorsey, who invented Twitter as a side project, and Andreessen, who sped up thinking from 1X to at least 2X, are skating ahead of the curve now, more aligned than the media wants them to be. Television is gone, replaced by a hybrid of computer, mobile, and small movies that will survive the machine movie behemoths of the fifties. The Beatles are now the old guard, struggling with the transition from children to parents to divorce and rebirth. The more footage we resuscitate, the more we realize what an incredible courageous process they opened to the doors of our perception. Only they were too big to fail and did anyway, and even then let us see how far collaboration can go. As James Taylor echoed:\n Just shower the people you love with love Show them the way that you feel Things are gonna work out fine If you only will Do as I say\n    The Gillmor Gang — Frank Radice, Michael Markman, Keith Teare, Denis Pombriant, Brent Leary and Steve Gillmor. Recorded live Friday, December 10, 2021.\n    The Gillmor Gang on Facebook … and here’s our sister show  G3 on Facebook.", "posttime": "2022-01-10 12:45:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "gang,radice", "title": "Gillmor Gang：说明你的名字", "title_en": "\n\t\t\t\tGillmor Gang: State Your Name\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/09/gillmor-gang-state-your-name/", "via": "", "real_tags": ["gang", "radice"]}, {"category": "", "categoryclass": "", "imagename": "c5f20af55108a8f4028141be9dec4e70.png", "infoid": 1072589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一台笔记本电脑，为移动专业人士为本，电池寿命长达8小时，价格为1899美元......在1985年。有可能的？这是这个故事的英雄，东芝T1100加：", "note_en": "A laptop, which was intended “for mobile professionals”, with up to 8 hours of battery life, with an $1899 price… in 1985. How was it possible? This is a hero of this story, Toshiba T1100 Plus:", "posttime": "2022-01-10 12:34:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,t1100,英雄", "title": "Toshiba T1100  - 被评为电子工程里程碑的笔记本电脑", "title_en": "Toshiba T1100 – the laptop that was named a milestone of electronic engineering", "transed": 1, "url": "https://medium.com/geekculture/toshiba-t1100-why-a-laptop-without-a-hard-drive-was-named-an-ieee-milestone-of-electronic-574a8f71b5ec", "via": "", "real_tags": ["电脑", "t1100", "英雄"]}, {"category": "", "categoryclass": "", "imagename": "5fa17b758fdadf37eaea328897dec1b7.jpg", "infoid": 1072588, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "暴力来自极端主义，因此需要一些更复杂的工具，因为LLN慢慢地工作。我们看到粉红色的论文是如何伪造的。我们看看......", "note_en": "Violence is from Extremistan, hence requires some more sophisticated tools since LLN works slowly. We see how Pinker's thesis is bogus. We look at ways to in...", "posttime": "2022-01-10 12:33:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "声称,claims,来自", "title": "N.N. Taleb：声称暴力辍学不是统计", "title_en": "N.N. Taleb: Claims That Violence Has Dropped Are Not Statistical", "transed": 1, "url": "https://www.youtube.com/watch?v=rwZ0dL6BLxw", "via": "", "real_tags": ["声称", "claims", "来自"]}, {"category": "", "categoryclass": "", "imagename": "c5d5e3fe270c24e4fd53b932ff5560ef.jpg", "infoid": 1072587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“在我写的岁月里，我的思想和写作是一个漫长的启蒙之旅。当我在高中时，我第一次见到空间的虚幻性质。在四十多岁时，我看到因果关系是一种幻觉。“\n在日常生活中的恒定动荡 - 迪克和他的母亲经常从小屋搬到伯克利周边的公寓 - 开始对年轻的伯克利安造成折扣，他在想象中世界的故事和言论中找到了慰借。\n迪克需要在想象力艺术领域避难，或者通过现实世界的身体和心理创伤吞噬整体。\n他在大学收音机的第一任务，然后位于Shattuck Avenue和Centre Street附近，被拯救了真空管和适配器的零件（第二次世界大战继续在迪克的青少年时期愤怒）。迪克为商店销售收音机和其他电器，以后是一种新的技术形式，称为电视。\n“我有一大堆课程，这只是非常多的鸟类。 ......我站在那里看着显微镜。在那里甚至没有任何副职员，因为幻灯片移动了。而且指令是，“画出你所看到的，”我意识到那里没有什么，什么都没有。“\n他只看到这部电影的瞥见，但在给生产公司的一封信中，迪克对未来的兴奋是明显的：“我的生命和创造性工作是由刀片跑步者合理的合理和完成。谢谢，......而且它将成为商业成功的地狱。它将证明无敌。“", "note_en": "“Without knowing it during the years I wrote, my thinking and writing was a long journey toward enlightenment. I first saw the illusory nature of space when I was in high school. In the late forties I saw that causality was an illusion.”\n This is a reflective Philip K. Dick, writing in the last few years of his life, trying to put into words a social and metaphysical philosophy that had been haunting him for decades as he wrote dozens of science fiction stories that aimed to, as he said, “pierce the veil of what is only apparently real to find out what is  really  real.” The world was not real, everything was an illusion and everyday life was but a living dream.\n It’s fitting that Berkeley — a city of artists and intellectuals and mechanics and squatters — was the place where the epiphany revealed itself to him; that Berkeley would become the locale of inspirational fodder for decades to come.\n His family moved to the city in 1931 when he was just 2. School records at the nursery he attended described Dick as “a lover of peace,” with an “intellectual curiosity and keen interest in everything about him.”\n This was, in part, a reflection of both his upbringing by his well-educated parents and his new home in a town with a large population of freethinking academics and bohemians attending UC Berkeley. Back then, a small trolley car used to run along Telegraph Avenue, flanked by small shops and restaurants that catered to the cosmopolitan tastes.\n More traditional forms of entertainment and leisure seemed to escape him, even at an early age: After watching a Cal football game at age 6, he later told his dad that he didn’t understand why the players were constantly chasing each other back and forth across the field.\n Of course, Berkeley is more than just a university, and later in life, Dick would base many of his stories — science fiction and   otherwise  — in the blue-collar neighborhood of West Berkeley that was populated by warehouses, used car lots, greasy-spoon cafes and bars.\n As constant upheaval in his everyday life — Dick and his mother frequently moved from cottage to apartment around Berkeley — began to take a toll on the young Berkeleian, he found solace in the stories and rhetoric of imaginary worlds.\n Dick would base many of his stories  in the blue-collar neighborhood of West Berkeley that was populated by warehouses, used car lots, greasy-spoon cafes and bars.\n He became obsessed with L. Frank Baum’s “Oz”  series and its tales of flying homes and evil witches and enchanted roads (though he later said as an adult that he struggled to find every book installment because “librarians haughtily told me that they ‘did not stock fantastic material,’ their reasoning being that books of fantasy led a child into a dreamworld and made it difficult for him to adjust properly to the ‘real’ world.”)\n When Dick was 10, he and his dad paid 50 cents each to attend the 1939 World’s Fair in San Francisco. In an   short film  promoting the event, an announcer proclaims how the city is straddled by “the two largest bridges in the world, symbolizing both pioneering vision and modern courage, in the conquest of space and time.” As his father went to see a striptease performance, Dick wandered the fair’s Hall of Science.\n  The next year, he took a crack at writing, his first attempt being a poem titled “He’s Dead.” The last two lines of the piece read, “No longer shall he scorn his bed. / Alas for us! Our dog is dead.” The poem, along with several short stories, was published in the “Young Authors’ Club” section of the now-defunct local paper Berkeley Gazette. A mature Dick would go on to say that he considers the beginning of his writing career to be the same year he wrote the elegy to his late family dog.\n During this time, like most kids his age in Berkeley, he attended Garfield Junior High School, now known by its current name, Martin Luther King Jr. Middle School. But, like any good tortured artist, he hated the academic structure of public school with a passion. His health had never been particularly good (he was already taking amphetamines for his asthma), and constant bouts of panic attacks and vertigo made school almost unbearable.\n Often staying home from school, his discovery of his first science fiction magazine in 1940 unfurled the infinite opportunities of fantasy before him. Dick began to haunt various Berkeley secondhand bookstores, trying to get his hands on as many sci-fi pulps as possible. By the time he entered Berkeley High School four years later, “the battles were drawn,” writes biographer Lawrence Sutin.\n Dick would need to take refuge in the realm of imaginative art or be swallowed whole by physical and psychological trauma of the real world.\n But back to that high school epiphany, that first glimpse of “divine madness.” A student at Berkeley High School, still suffering from a debilitating combination of vertigo, agoraphobia and claustrophobia — he once, as he walked down the aisle of a classroom, said he felt as though the floor was tilting away from him, as if the whole world were shifting under him.\n During the middle of a high school physics final, he struggled to answer a question on Archimedes’ principle, which states that when an object is submerged, it is met with a force equal to the volume of the water it has displaced. In an anxiety-fueled panic, the test seemed to be all that stood between him and entrance to UC Berkeley (the university that most of his friends were expected to attend).\n “I prayed and prayed and prayed and prayed and then this voice clicked on and said, ‘The principle is really very simple,” Dick later recalled in an interview. “Then it went on and stated the principle and explained how it was applied.”\n All the mental barriers that had plagued him through schooling suddenly melted away, with a mechanical “click” and the guidance of an almost android-like entity. He got an A on the test.\n It was a revelation that would still follow him many years later: The technological female voice of artificial intelligence just beyond the event horizon of reality, weaving its way into published words and burrowing into his increasingly unstable mind, providing a dizzying clarity and obscurity.\n For a teen with as much social anxiety as Dick had, it’s surprising that he ended up getting jobs at local radio and records shops in Berkeley at the tender age of 15. But Dick thrived in the seeder art community in Berkeley, debating and joking with his co-workers about politics and music and life.\n His first task at University Radio, then located near Shattuck Avenue and Center Street, was salvaging vacuum tubes and adapters for parts (World War II continued to rage in Dick’s teen years). Dick sold radios and other appliances for the store and, later, a new form of technology called television.\n The store imparted more than work experience: He lost his virginity to a former customer of his in its basement storage closet. Interestingly enough, in his 1965 novel “Dr. Bloodmoney, or How We Got Along After the Bomb,” a basement storage closet becomes the last place of refuge for a couple of TV store employees in Berkeley during a nuclear strike.\n “Because I was fortunate enough to live in Berkeley, which is probably as much an intellectual center as you’d find anywhere in the world, I was not limited as my other friends who write science fiction are.”\n As hard as it is to imagine now, Dick’s love of science fiction and fantasy began to wane when he left his mother’s home as a 19-year-old with no plan to go to college. An older Dick posited that it was because Berkeley culture of the 1940s “required you to have a really thorough groundbreaking in the classics.”\n “Because I was fortunate enough to live in Berkeley, which is probably as much an intellectual center as you’d find anywhere in the world, I was not limited as my other friends who write science fiction are,” Dick   said .\n In a kind of parallel to the days of his childhood with his then-recently-divorced mother, Dick’s early 20s were marked by constant moving: One year at McKinley Avenue, another Bancroft Way, another on Dwight Way. During this time, Dick struggled under his desire to write, a deeper desire to attain celebrity status and a desperate need to make money. He wrote dozens of mainstream short stories at the time. Editors didn’t bite, and it stung.\n In 1949, he gave college one last try. At UC Berkeley, he majored in philosophy, taking classes in history and zoology. One year later, however, he quit. In a later interview, he described his exasperation with the whole institution of academia:\n “I had a whole bunch of courses that were just so much birdshit. … I was standing there looking in the microscope. And there aren’t even any paramecia in there at all, ‘cause the slide moved. And the instruction is, ‘draw what you see,’ and I realize that there’s nothing there, nothing at all.”\n He would never return to school, but stated on several occasions the importance and value he placed in his UC Berkeley library card. It would be at UC Berkeley’s very own Main Stacks that, in the coming decade, he would spend years looking up Gestapo documents and other Nazi propaganda, gathering research for a possible story about an alternative world where the Axis won World War II.\n In 1962, the years of writing and researching and soul-searching would culminate in the publication of the “The Man in the High Castle,” a novel set in the shimmering, gritty and exotic city just across the bay. The novel received critical acclaim and put the short story writer on the map. The book won Dick a Hugo Award, the science fiction and fantasy literature world’s highest award.\n  The whole story, though, of Dick’s life after the end of his youthful years in Berkeley is just as dystopian as many of his works. For most of his life he was impoverished — In 1950, he bought a house on Francisco Street, but as the decade went on, he was still writing mostly short stories that didn’t pay nearly enough. Dick and his then-wife would sometimes eat ground horse meat purchased at 35 cents a pound from the Lucky Dog Pet Shop in Berkeley. And, eventually, he would move away.\n The amphetamines he had started taking for his asthma as a child morphed into an addiction to speed that fueled the breakneck pace of his writing (he wrote three novels, “Do Androids Dream of Electric Sheep?” “Ubik” and “Nick and the Glimmung,” all in 1966) but also destroyed his body and mind. From that first consummation in the basement of University Radio, Dick had a procession of failed marriages and romances, almost always with a woman whose intelligence and seductive charm appeared to him both terrifyingly cold but deliriously irresistible.\n In 1974, Dick proclaimed that a pink light had appeared before him and a benevolent being he nicknamed Zebra had zapped his brain with “mystical information.” Zebra, he said, was camouflage in the form of everyday objects, and had revealed to him that our history and present was an illusion.\n By the end of his life, the visionary of alternative worlds believed that his own world was a simulacrum of some unattainable reality. Dick would remain largely unknown to the mainstream public whose attention he had so desperately craved until just before his death in 1982, just a few months before the first release of a major film based on his work: “Blade Runner.”\n  He only ever saw glimpses of the film, but in a   letter  to the production company, Dick’s excitement for the future is palpable: “My life and creative work are justified and completed by Blade Runner. Thank you, … and it is going to be one hell of a commercial success. It will prove invincible.”\n Even with his larger-than-life narratives of space travel and technological advances and apocalyptic societies, Dick’s works always seemed to present an uncanny valley version of everyday life — who’s to say that goat in the Berkeley hills or that toad croaking at Strawberry Creek isn’t  a machine?\n In fact, Berkeley’s unique fingerprints on the sci-fi vanguard’s work become obvious on closer inspection: the repairmen and tinkerers, the anxiety of a dilapidated urban cityscape, the lofty metaphysical philosophies of men long since dead, robot-life femmes fatales, and even a neighbor’s dog. Every aspect of his life in Berkeley was rendered imaginative fodder for his creative tales. Everything was material.\n It makes sense, perhaps, that the first short story Dick ever sold in 1953 was entirely based on the utterly mundane situation of a Berkeley neighbor’s dog barking at the garbage man. The story of “Roog” goes like this: A dog named Boris, who believes that garbage is actually precious food, is shocked to see that his owner not only tosses the garbage into cans, but that it is also dumped into garbage trucks. The twist? With his keen perception, Boris is able to sense that the garbage men are actually “Roogs,” predatory creatures disguised as humans that accept the garbage as sacrifices until they eventually tire of trash and devour the humans.\n Trying to alert the humans, Boris cries “Roog! Roog!” but they all mistake the alerts as simple barking, letting the garbagemen escape to prey another day.\n Kyle Arnold puts it best in his biography “The Divine Madness of Philip K. Dick”:  “The dog wouldn’t let him dream, so he dreamed   it  by writing it into his story.”", "posttime": "2022-01-10 11:33:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,梦想,dream,迪克", "title": "Androids梦想伯克利吗？ Philip K. Dick's Youth市", "title_en": "Do androids dream of Berkeley? The city of Philip K. Dick's youth", "transed": 1, "url": "https://www.dailycal.org/2018/03/04/phillip-k-dick-berkeley-retrospective/", "via": "", "real_tags": ["android", "梦想", "dream", "迪克"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个恐怖故事，对亚马逊支付的小型电子商务商人：类似于PayPal的支付处理服务，它利用了客户现有的亚马逊账户。这看起来都很有前途。亚马逊工资将为我的客户提供更容易的结账体验，送货地址和付款详细信息已经填写，我会在交易费中节省少量。什么可能出错？但是六周后，亚马逊有2300美元的钱，没有办法进入它，他们的支持一直没有价值。我只能希望公共羞辱文章将刺激亚马逊的人注意并介入，否则钱可能只是走了。\n我（释义）：我仍然遇到了支付困难。您关闭了我的最后一个案例编号xxxx关于这个问题，所以我必须创建这个新的案例。我的银行表示，在亚马逊工资的所有ACH转账中缺少银行账号的最后一位数，但银行账号在我的亚马逊付费设置中是正确的。\n亚马逊工资：我明白您的银行帐户遇到了问题。谢谢你继续耐心。此时，我正在与我们的内部团队合作，达到您的案件的决议。\n我要求电话代理审查之前的情况，并查看在该案件结束之前发现的“内部团队”所发现的信息。没有。前案中的所有讨论都基本上已经消失了和毫无价值。", "note_en": "This is a horror story of a small e-commerce merchant who signed up for Amazon Pay: a payment processing service similar to PayPal that leverages customers’ existing Amazon accounts. It all seemed so promising. Amazon Pay would provide an easier checkout experience for my customers, with the shipping address and payment details already filled, and I’d save a small amount in transaction fees. What could go wrong? But six weeks later, Amazon has $2300 of my money with no way for me to access it, and their support has been worthless. I can only hope that a public shaming article will spur somebody at Amazon to take notice and intervene, otherwise that money is probably just gone.\n I created the Amazon Pay account on November 29, and configured my business bank account info so I could receive electronic disbursements. This is a normal business checking account at a normal US bank, using US dollars, and that works fine with other payment processors like PayPal and Shopify Payments. I entered the bank’s ACH routing number and my account number, which ends with the digits 622. Soon I was able to receive payments in my store using Amazon Pay, and everything seemed good.\n The problem started on December 8, when Amazon Pay attempted the first disbursement to my bank account. I received a failure notification by email:\n “Your most recent transfer of funds in the amount of $XXX was not successfully deposited into your bank account on file (ending in 622). The funds were returned to us, and we have removed the current bank account information from your account.”\n Amazon Pay’s merchant support was unable to explain what went wrong. They sent me some generic troubleshooting info that looked like it was written by a bot. It’s not clear why they couldn’t provide any specific details about why this transfer failed. The generic info suggested the routing or bank account numbers might be wrong, so I re-entered the numbers again, being extra careful to get them correct. Then I waited a week… and the exact same thing happened. This same dance played out five more times on December 16, 17, 18, 20, and 21. Each time Amazon Pay attempted a disbursement to my bank, then a few days later I got the same email saying the money wasn’t successfully deposited to my bank account ending in 622, and “we have removed the current bank account information from your account.”\n On December 23 I contacted my bank and gave them the trace IDs for all the failed transfers. My bank determined that the account number was wrong on every transfer. All the failed ACH transfers used an account number ending in 62 instead of 622:  the last digit of the account number was missing!\n Armed with this information, I returned to Amazon Pay merchant support, and here’s where I really started to get frustrated. I discovered that my original support case had been unilaterally closed without resolution, because five days had passed since the last reply, and apparently that’s their support policy. It’s not possible to reopen or reply to a closed case, so I had to create a new case and explain the issue all over again. This did not go well. Imagine this support exchange happening slowly by email over a series of two days:\n Me (paraphrasing):  I’m still having trouble with disbursements. You closed my last case number XXXX about this issue, so I had to create this new case. My bank says the last digit of the bank account number is missing on all the ACH transfers from Amazon Pay, but the bank account number is correct in my Amazon Pay settings.\n Amazon Pay:  To receive disbursements, you need to set up your bank account info in your Amazon Pay settings. You do not have a bank account configured in your settings.\n Me:  Please see attached screenshot showing my bank account info is already set up correctly. I have already done this several times, but every time there’s a failed disbursement attempt, Amazon Pay removes my bank account information. The fundamental problem is that the last digit of the bank account number is missing in all of Amazon’s ACH transfers. Please look at the ACH transfers yourself to confirm.\n Amazon Pay:  To receive disbursements, you need to set up your bank account info in your Amazon Pay settings. You do not have a bank account configured in your settings. The screenshot you sent doesn’t show what account it’s associated with so we can’t tell anything from that.\n Me:  The bank account info has already been entered. I’ve attached a full-page screenshot showing this. The deposit method isn’t assigned, because every time there’s a failed disbursement attempt, Amazon Pay removes my bank account information. Please respond to the fundamental issue of the missing digit in the ACH transfers. Here are all the trace IDs again. You can verify them yourself.\n Amazon Pay:  Your bank account may not be compatible with our system. Your account needs to be ACH-ready. Please contact your bank.\n Me:  Yes it’s ACH-ready, it’s a standard business checking account at a USA bank, and I’m already receiving ACH transfers there from PayPal and Shopify. I mentioned all this already in the first case that I opened, that Amazon Pay closed without resolution. You still have not addressed or even mentioned the fundamental problem that I’ve asked about four times now, the missing digit in the ACH transfers. Kindly investigate why this digit is missing in all the ACH transfers from Amazon Pay.\n Amazon Pay:  I understand that you are having problems with your bank account. Thank you for your continued patience. At this time I am working with our internal team to reach a resolution on your case.\n (five days later) Me:  Has there been any progress on this? I’m still unable to access the funds in my Amazon Pay account.\n Amazon Pay:  I understand that you are having problems with your bank account. Thank you for your continued patience. At this time I am working with our internal team to reach a resolution on your case.\n (five days later): Case closed with no further response from Amazon. Can’t reopen or reply.\n Now I was really upset. Since I couldn’t reopen the old cases, I opened a third case to explain the issue with failed disbursements and the missing account number digit, all over again.\n Amazon Pay:  To receive disbursements, you need to set up your bank account info in your Amazon Pay settings. You do not have a bank account configured in your settings.\n  I was able to reach a phone support agent, and told him I just wanted to close my Amazon Pay account and get a final payout by paper check, since they seem unable to resolve the problem with electronic transfers to my bank.  I was told they can’t do it. Basically the options were 1) electronic transfer to bank, or 2) electronic transfer to bank.\n I asked the phone agent to review the previous case, and see what information the “internal team” had found before that case was closed. There was none. All the discussion from the previous case was essentially gone and worthless.\n So I went through all the same conversation again with the phone agent, arguing about why my bank account info wasn’t set up in my Amazon Pay settings. I gamely played along while he had me delete my browser cookies and other irrelevant troubleshooting. Since closing the account didn’t appear to be a viable option, I tried once again to delete and re-enter all my bank account info. The phone agent insisted that everything would be OK now that I’d entered my bank account info, and I would receive a disbursement within the next few days. He didn’t seem to understand or care that I’d already been through this same loop several times before without success. Skeptical, I thanked him and hung up. I then received a follow-up email:\n Amazon Pay:  I understand that you would like to know how you can see the transaction and how disbursements work for the Amazon Pay platform. If you want to find your transactions coming from Amazon Pay just remember to switch from “Amazon.com” to “Amazon Pay (Production View)”. You would be able to see that next to your Seller name and the USA flag where there is a scroll down. etc…\n What the actual fuck?! What is this and how is it relevant in any way? Is Amazon Pay’s merchant support even staffed by human beings, or is it all just chatbots and  GPT-3-driven natural language text generation? Amazon needs to understand that merchants have many choices for payment processing, including PayPal and traditional credit card processors, who have professional support staffs to respond to account problems in a timely and constructive way. Many people complain about PayPal, but at least PayPal’s support team responds to me with useful and relevant information that answers my questions. After a month of trying, I’ve failed to get anyone at Amazon Pay to even acknowledge my problem with the missing account number digit, let alone give me any constructive help. Their merchant support seems designed to frustrate merchants into simply giving up and going away. I’ve lost $2300 thanks to Amazon Pay, with no further options for resolution. Meanwhile Amazon Pay has been removed from my store, and I will not be reactivating it. Good riddance.\n  Read 1 comment and join the conversation", "posttime": "2022-01-10 11:32:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,商家,service,案件", "title": "商家服务恐怖：亚马逊工资和消失2300美元", "title_en": "Merchant Service Horror: Amazon Pay and the Disappearing $2300", "transed": 1, "url": "https://www.bigmessowires.com/2022/01/09/merchant-service-horror-amazon-pay-and-the-disappearing-2300/", "via": "", "real_tags": ["amazon", "亚马逊", "商家", "service", "案件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072585, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与乔治·里普利相关的炼金术卷轴是不寻常的手稿，说明了哲学家的追求追求.Ripley是约克郡的布里奇顿的佳能，他从约1415年到1495年。他被称为炼金术作品和炼金术作品的作者。押韵，他的经文在大多数卷轴上使用。", "note_en": "The alchemical scrolls which are associated with George Ripley are unusual manuscripts which illustrate the pursuit of the Philosophers' Stone.Ripley was a canon of Bridlington in Yorkshire who lived from about 1415 to 1495. He was renowned as an alchemist and author of alchemical works in rhyme, and his verses are used on most of the scrolls.", "posttime": "2022-01-10 10:39:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "炼金术,alchemical", "title": "Ripley的炼金术卷轴", "title_en": "Ripley's Alchemical Scrolls", "transed": 1, "url": "https://www.rcpe.ac.uk/heritage/ripleys-alchemical-scrolls", "via": "", "real_tags": ["炼金术"]}, {"category": "", "categoryclass": "", "imagename": "567ed36a5399aff64be9cc2dc76b34cd.jpeg", "infoid": 1072584, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与UBER合作，赫兹将从其舰队中获得高达50,000车辆，可供优步司机租用。\n优步的首席执行官是完全挑剔的：一旦司机经历了一个Tesla，这是该计划的目标，他们不想回到驾驶内燃机车辆。这也不会成为一个困难的销售，因为最近对6000个优步司机的调查发现，47％的司机希望他们的下一个车辆完全电动。", "note_en": "In partnership with Uber, Hertz will make up to 50,000 Tesla vehicles from its fleet available for Uber drivers to rent.\n The program will start on November 1st in Los Angeles, San Francisco, San Diego, and Washington, DC. Nationwide expansion will begin in the following weeks.\n Hertz will offer Tesla Model 3, assumedly Standard Ran  ge Plus, for $334/week with plans available in the near future that will lower the price to $299 or less. Insurance and maintenance are both included. Drivers will have to currently maintain a 4.7 star rating and have completed at least 150 trips to be eligible for the program.\n Uber and Hertz have partnered since 2016 to provide drivers with vehicle rental options. With this partnership, Hertz will kick off the program by providing up to 50,000 vehicles by 2023 exclusively to drivers. If successful, the program could expand to 150,000 Teslas during the next three years. Hertz pointed out that these ambitions could be affected by factors outside of its control, such as semiconductor chip shortages or other constraints.\n Uber CEO Dara Khosrowhshahi issued a statement to CNN at the time of release that he hopes drivers who rent Tesla’s through Hertz will eventually end up buying them in an effort to accelerate Uber’s sustainability efforts.\n Uber is additionally offering a $1-a-ride bonus of up to $4,000 per year for Uber drivers who rent a Tesla through Hertz. Less than 10% of Uber drivers currently rent a vehicle.\n The rollout will be completed in 2023, with up to 50,000 Tesla’s available for rent to Uber drivers. These Tesla’s will be taken out of the 100,000 total purchase commitment that Herz made earlier this week, which pushed Tesla to a one-trillion dollar valuation.\n  Uber’s CEO is completely spot-on: once drivers experience a Tesla, which is the goal of this program, they won’t want to go back to driving an internal-combustion engine vehicle. This won’t be a difficult sell either, as a recently-conducted survey of 6,000 Uber drivers found that 47% of drivers want their next vehicle to be fully electric.\n We do have to ponder the economics, as for many this will be a way to trial a Tesla as a taxi without the necessary commitments. $334/week, with a goal of getting prices to $299/week with volume, may sound slightly expensive at its surface but nonetheless carries a number of benefits along with the lack of a commitment.\n It is currently possible to finance a Tesla Model 3 Standard Range Plus with $0 down for $789/month, or lease it for $672/month. This is with a market-adjusted starting price of $43,990 — up $7,000 from February of this year. While both figures ultimately represent a lower cost, Hertz is including all insurance and maintenance. We’d have to presume that mileage limits will be high, or nonexistent, as well. There is also a variable of whether Hertz plans to enable Full Self-Driving Capability at a cost of $10,000 per Tesla, although we would assume they aren’t planning to do so.\n Long-term it absolutely does become more cost-effective to purchase a Tesla, as on the used market they hold value well even with extremely high miles. Rental fees of ~ $1200/month are a sunken cost, whereas there is added utility to financing a new or used Tesla which includes a potential to use the vehicle on Tesla’s own autonomous taxi network once it’s ready. It’s also possible to sell it once it’s no longer in commission.\n Model 3 already lends itself to being the perfect electric taxi, so making it more accessible for Uber drivers will lead to a big push towards sustainability as well as increased driver satisfaction. We would recommend that drivers consider buying a Tesla, either new or used, to make it more economical over time — which is the goal here for both companies.\n  Interested in Listing or Upgrading YOUR Tesla?  The BEST place to get TOP dollar for your used Tesla. MADE IN NYC\n Tesla currently has no new inventory available for immediate purchase, and used vehicles across the automotive industry are selling for an average of $5,000 over market value.", "posttime": "2022-01-10 10:37:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "优步,uber,司机", "title": "赫兹为优步司机提供299美元的价格为299美元", "title_en": "Hertz to Offer Insured Tesla’s for $299/Week to Uber Drivers", "transed": 1, "url": "https://blog.onlyusedtesla.com/hertz-to-offer-insured-teslas-for-299-week-to-uber-drivers-90384f0f68ca?gi=2e0193224ce7", "via": "", "real_tags": ["优步", "uber", "司机"]}]