[{"category": "", "categoryclass": "", "imagename": "bb85a4a4e761188f145fd654073233a6.jpeg", "infoid": 1071000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 Python 中的 yfinance 包从 Yahoo Finance 获取股票数据的快速指南 这是 Python 用户加载股票数据的教程。如果您是R用户，可以参考之前使用Rselenium从雅虎财经中提取自定义数据字段的抓取教程，或者另一个演示quatmod包的getSymbols的教程，这是加载财务数据的更直接选项。", "note_en": "A quick guide to get stock data from Yahoo finance using yfinance package in python\n This is a tutorial for python users to load stock data. If you are a R user, you can refer to  previous scraping tutorial using Rselenium to extract customized data field from Yahoo Finance, or  another tutorial demonstrating getSymbols of quatmod package, which is a more direct option to load finance data.", "posttime": "2021-08-01 22:09:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,下载,yfinance,download,教程", "title": "使用 Yfinance 下载财务数据 (Python)", "title_en": "Using Yfinance to Download Financial Data (Python)", "transed": 1, "url": "https://medium.com/@carrie_cyda/using-yfinance-to-download-financial-data-python-57f2f31e0f9e", "via": "", "real_tags": ["python", "下载", "yfinance", "download", "教程"]}, {"category": "", "categoryclass": "", "imagename": "b269d957c5f23e6265fecc327920800e.png", "infoid": 1070998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国各地，苹果、谷歌和 Facebook 等大型科技公司的领导人正在与数千名员工进行一场微妙的共舞雇主。 COVID-19 大流行迫使这些公司连续数月与主要是远程员工一起运营。由于他们中的许多人都位于疫苗接种率相对较高的地区，因此整个夏天开始响起返回实体办公室的呼声。但这些公司的数千名高薪工人并没有享受到这种待遇。他们中的许多人不想全职回到办公室，即使他们愿意每周有几天这样做。工人们甚至指出他们在完全远程时的效率如何，并以此来质疑为什么他们必须继续住在这些办公室所在的昂贵城市。一些技术领导者（如 Twitter 的 Jack Dorsey）同意，或者至少他们看到了墙上的文字。他们对公司的政策进行了永久性或半永久性的更改，以使部分甚至全职远程工作成为常态。其他人（如苹果公司的蒂姆库克）正在努力寻找一种方法，尽管存在有组织的阻力，但在可行的情况下尽快让每个人回到指定的座位上。无论是哪种情况，从 iPhone 到 Google 搜索的所有科技公司的工作文化都面临着巨大的变革浪潮。硅谷和其他科技创业中心的敬业干部长期以来一直在宣扬远程工作未来的福音。有影响力的人、作家和商业咨询大师多年来一直说，由于今天的技术，在办公室工作注定要成为过去。支持者认为，除了一种管理控制异常的不安全感之外，没有明显的理由来抵制远程工作。为了支持他们的观点，他们指出研究表明，当可以选择远程工作时，某些从事某些类型工作的员工会更快乐、更有效率。研究还驳斥了当远程工作成为常态时生产力总是较低的假设。这一运动在 2000 年代后期达到了某种程度的狂热，当时科技独角兽的乐观情绪席卷了商业世界，而新一波初创企业中的一些知名高管似乎对这个想法很满意。但是远程工作继续面临巨大的挫折。值得注意的是，当时被称为最适合远程办公的大型科技公司之一的雅虎在 2010 年代初在当时的首席执行官玛丽莎梅耶尔的领导下改变了方向，她要求大量远程工作者必须搬迁并出现在他们指定的办公桌上。自从那次事件和其他类似事件发生以来，远程工作运动变得更加安静。\n远程工作倡导者和商业机构似乎达成了妥协。谷歌或推特等公司会根据需要让员工定期在家工作（例如，照顾生病的孩子，甚至偶尔的心理健康日）。但在大多数情况下，文化要求工人不要经常打这张牌。远程工作是一种特权，而不是权利，员工通常无法从这些公司所在的城市搬离日常通勤范围。随着旧金山、西雅图、洛杉矶和奥斯汀等城市的房价飞涨和交通状况恶化——以及这些地方的经济不平等因此加剧——著名评论员仍然偶尔撰写专栏文章，基本上说，“哎呀，也许有些如果商界领袖对远程工作更加开放，这些问题就会减少。”但是，远程工作运动最激进的愿景似乎已经荡然无存。那些领导者长期声称远程工作永远无法运作的公司别无选择。在传统企业中，数字化转型运动急剧加速以满足需求。在一些科技初创公司中，过渡是如此无缝，以至于许多员工（甚至经理）发现自己想知道为什么以前没有尝试过所有这些。当然，某些类型的科技公司也有例外。例如，大型游戏开发工作室努力在新的远程工作方式中保持先前的生产力水平，导致某些版本的发布延迟或质量下降。但通常情况下，为应对大流行而做出的改变让人们相信，这种遥远的事情毕竟可能会奏效。在拥挤的城市未来大流行的威胁和科技中心疯狂的房价之间，许多工人最近开始制定计划从湾区等地撤离，寻找更便宜、更绿色的牧场——但希望他们能保持高- 高薪工作。根据 Glassdoor 的数据，加利福尼亚州圣何塞的科技热点地区软件工程师的平均工资为 137,907 美元。令人震惊的是，这还不足以为湾区的整个美国梦提供资金。但是，如果那个假设的工程师以这个薪水搬到圣路易斯或图森，他们就可以像皇室一样生活。很少有科技公司像苹果一样在这个问题上经历过如此广为人知的戏剧性事件。尽管库比蒂诺总部和其他地方的许多员工在 2020 年的大部分时间里大部分时间都在家工作，但首席执行官蒂姆库克在 2021 年 6 月上旬通过电子邮件向员工发送了一封电子邮件，称政策即将发生变化。从 9 月开始，员工必须每周至少返回办公室三天。如果他们获得管理层的批准，他们还可以每年进行长达两周的完全远程工作。\n据 The Verge 的 Zoe Schiffer 报道，员工随后在自己之间分发了一项调查，发现库克的任务与他们想要或期望的不符。调查的 1,749 名受访者中有 90% 表示他们“非常同意”“地点灵活的工作选择对我来说是一个非常重要的问题”。工人们给库克写了一封信，要求他重新考虑新政策。 68% 的人同意“缺乏位置灵活性可能会导致他们离开 Apple。”这些威胁可能是合法的，因为其他一些科技公司（如 Twitter）采取了更为宽容的方法。这些公司可能会让不满意的苹果员工去其他地方。苹果高管并没有放弃他们的计划。整个夏天，即将到来的变化导致了这家行业巨头的动荡，长期员工承诺辞职，要求返回办公室。一些员工向媒体表示，苹果管理层已经开始比平常更多地拒绝远程工作请求。一些苹果员工写了另一封信，主张妥协：更宽松的远程工作政策，以换取一种制度，在这种制度下，生活成本较低的城市的员工将接受按比例降低的工资。然而，这一提议仍然激怒了其他员工，他们认为，无论他们选择在大流行中期或大流行后搬到哪里，Apple 都可以支付给他们有竞争力的薪水。但是现在，像苹果这样的公司围绕远程工作文化的斗争似乎将继续扩大。今年夏天，业界最初对世界富裕地区即将恢复正常的乐观情绪已经减弱。归功于 delta COVID-19 变体的快速传播和美国未接种疫苗的病例不断增加。加利福尼亚州重新引入了室内口罩规定，即使对接种疫苗的人也是如此，因为研究表明，即使是看起来相对健康的接种疫苗的人也可以将致命的 delta 变异体传播给未接种疫苗的脆弱人群。加利福尼亚州的授权直接影响了其中的许多公司，而且可能很快会有更多州效仿。在内部动荡和日益严重的健康问题中，苹果公司推动了其重返办公室的计划。据报道，时间框架已从 9 月移至 10 月，并且很有可能会进一步推迟。本周，Twitter 宣布将关闭最近部分重新开放的美国办事处。谷歌将目前的在家工作政策延长至 10 月中旬，Lyft 将今年 9 月搬回办公室的计划一直推迟到明年 2 月。\n包括 Lyft、谷歌和 Facebook 在内的几家大型科技公司都要求部分或全部员工接种疫苗才能返回办公室。即使在尚未宣布任何疫苗接种要求的公司（如 Apple）中，员工也被要求填写调查表，披露他们的疫苗接种情况。尽管有新的发展，但像微软这样的其他公司仍在努力让员工回到办公桌前，尽管他们可能会在不久的将来再次改变方向。尽管微软计划推进办公室重新开放，但在为长期混合工作支持奠定基础方面，微软通常比苹果更积极主动。不要指望这些讨论会很快解决。一些高管仍在努力让员工回到办公桌前，一些员工仍在说“没那么快”或“根本没有”，而 COVID-19 仍在席卷全球。每个工作场所都以不同的方式处理事情，无论完全远程的梦想是否真的在其中一些公司成为现实，长期的远程工作预言对一件事是正确的：旧的方式不再会削减它，技术永远不会再一样了。", "note_en": "All across the United States, the leaders at large tech companies like Apple, Google, and Facebook are engaged in a delicate dance with thousands of employees who have recently become convinced that physically commuting to an office every day is an empty and unacceptable demand from their employers.\n  The COVID-19 pandemic forced these companies to operate with mostly remote workforces for months straight. And since many of them are based in areas with relatively high vaccination rates, the calls to return to the physical office began to sound over the summer. But thousands of high-paid workers at these companies aren&#39;t having it. Many of them don&#39;t want to go back to the office full-time, even if they&#39;re willing to do so a few days a week. Workers are even pointing to how effective they were when fully remote and using that to question why they have to keep living in the expensive cities where these offices are located.\n Some tech leaders (like Twitter&#39;s Jack Dorsey) agreed, or at least they saw the writing on the wall. They  enacted permanent or semipermanent changes to their companies&#39; policies to make partial or even full-time remote work the norm. Others (like Apple&#39;s Tim Cook) are working hard to find a way to get everyone back in their assigned seats as soon as is practical, despite organized resistance.\n In either case, the work cultures at tech companies that make everything from the iPhone to Google search are facing a major wave of transformation.\n  The gospel of a remote-work future has long been preached by a dedicated cadre in Silicon Valley and other tech startup hubs. Influencers, writers, and business consulting gurus have for years been saying that, thanks to today&#39;s technology, working in an office is destined to be a thing of the past.\n  There is no apparent justification for resisting remote work besides a sort of management control-freak insecurity, proponents argue. And to support their case, they point to  studies that suggest that some employees in certain kinds of jobs are happier and more productive when remote work is an option. Studies also debunk the assumption that productivity is always lower when remote work is the norm. The movement reached something of a fever pitch in the late 2000s, when tech-unicorn optimism was sweeping the business world and some prominent executives in the new wave of startups seemed cozy with the idea. But remote work went on to face dramatic setbacks. Notably, Yahoo!—then known as one of the most remote-friendly large tech companies—changed course in the early 2010s under the leadership of then-CEO Marissa Mayer, who mandated that a vast fleet of remote workers had to relocate and show up at their assigned desks.\n    Since that and other similar incidents around that time, the remote-work movement has been quieter.\n Remote-work advocates and the business establishment seemed to settle into a compromise. Companies like Google or Twitter would let employees work from home periodically as the need arose (for example, to take care of a sick child or even for the occasional mental health day). But in most cases, the culture dictated that workers not play this card too often. Remote work was a privilege, not a right, and employees usually could not relocate out of daily commuting range from the cities where these companies were based.\n As housing prices skyrocketed and traffic worsened in cities like San Francisco, Seattle, Los Angeles, and Austin—and as economic inequalities worsened in those places as a result—prominent commentators still occasionally penned op-eds that essentially said, &#34;Gee, maybe some of these problems would be lessened if business leaders were more open to remote work.&#34; But the most radical vision of the remote-work movement nonetheless seemed dead in the water.\n   Companies whose leaders long claimed remote work would never function were left with no other options. In traditional businesses, the digital-transformation movement accelerated dramatically to meet the need. And in some tech startups, the transition was so seamless that many employees (and even managers) found themselves wondering why all this hadn&#39;t been tried before.\n  There are exceptions in some kinds of tech companies, of course. For example, large game development studios struggled to maintain prior levels of productivity in the new remote way of working, leading to delays or a reduction in quality for some releases. But more often than not, the changes made in response to the pandemic led people to believe that this remote thing might actually work out after all. Between the threat of future pandemics in crowded cities and insane housing prices in tech hubs, a lot of workers recently began to make plans to evacuate from places like the Bay Area for cheaper, greener pastures—but with the hope that they could keep their high-paying jobs.\n According to  Glassdoor&#39;s data, the average software engineer salary in pricy tech hotspot San Jose, California, is $137,907. Shockingly, that&#39;s not enough to bankroll the whole American dream in the Bay Area. But if that hypothetical engineer relocates to St. Louis or Tucson on that salary, they can live like royalty.\n  Few tech companies have experienced as much widely publicized drama over this issue as Apple. Though many employees in the Cupertino headquarters and elsewhere mostly worked from home through much of 2020, CEO Tim Cook  emailed staff in early June 2021 that a policy change was imminent.\n Employees would be required to return to the office for at least three days of every week beginning in September. They would also be able to go fully remote for up to two weeks per year, provided they secure management approval.\n    Employees then  circulated a survey amongst themselves to reveal that Cook&#39;s mandate was out of step with what they wanted or expected, according to reporting by The Verge&#39;s Zoe Schiffer. Ninety percent of the survey&#39;s 1,749 respondents said they &#34;strongly agree&#34; that &#34;location-flexible working options are a very important issue for me.&#34; Workers wrote a letter to Cook asking him to rethink the new policy. Sixty-eight percent agreed &#34;that the lack of location flexibility would likely cause them to leave Apple.&#34;\n The threats may be legitimate because some other tech companies (like Twitter) have taken a much more permissive approach. These companies may give dissatisfied Apple employees somewhere else to go.\n Apple executives did not back down from their plan. Over the summer, the upcoming change has led to turmoil in the industry giant, with longtime employees pledging to quit over a required return to the office. Some workers went to the press with claims that Apple management has begun  rejecting remote-work requests more than normal in response.\n A few Apple employees wrote another letter arguing for  a compromise: more lenient remote-work policies in exchange for a system wherein employees in cities with lower costs of living would accept proportionally lower salaries. However, this proposal angered other employees still, who argue that Apple can afford to pay them a competitive salary regardless of where they choose to relocate to mid- or post-pandemic.\n  But now the battle over remote-work culture at companies like Apple looks like it is going to be extended. This summer&#39;s initial optimism about an imminent return to normal in the wealthy parts of the world has waned across the industry. Credit the rapid spread of the delta COVID-19 variant and rising cases among the unvaccinated in the US.\n  The state of California reintroduced an indoor mask mandate, even for people who are vaccinated, because studies  have shown that even relatively healthy-seeming vaccinated individuals can spread the deadly delta variant to the vulnerable unvaccinated. California&#39;s mandate directly affects many of these companies, and more states are likely to soon follow. Apple has nudged its return-to-office plan amidst the internal turmoil and growing health concerns. The timeframe  has reportedly moved from September to October, and there&#39;s a strong possibility it will be pushed back even further.\n This week, Twitter announced that it is closing the US offices it had recently partially reopened. Google extended its current work-from-home policy through mid-October, and Lyft postponed a plan to move back into its office this coming September all the way back to February of next year.\n Several big tech firms are  requiring some or all employees to get vaccinated to return to the office, including Lyft, Google, and Facebook. And even in companies that haven&#39;t yet announced any vaccination requirement, like Apple, employees are being asked to  fill out surveys disclosing their vaccination status.\n Others like Microsoft are still pushing to get workers back at their desks, despite the new developments, though they might change course again in the near future. Microsoft has generally been  more proactive than Apple in laying the groundwork for long-term hybrid work support, though, despite its plans to press forward with reopening offices.\n Don&#39;t expect these discussions to resolve soon. Some executives are still trying to get employees back at their desks, some employees are still saying &#34;not so fast&#34; or &#34;not at all,&#34; and COVID-19 is still sweeping the planet.\n Every workplace is handling things differently, and whether the fully remote dream actually becomes a reality at some of these companies or not, long-time remote-work prophesiers are right about one thing: the old ways aren&#39;t going to cut it anymore, and tech is never going to be the same again.", "posttime": "2021-08-01 21:24:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程工作,tech", "title": "大型科技公司因远程工作与员工发生战争", "title_en": "Big tech companies are at war with employees over remote work", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/08/vaccines-reopenings-and-worker-revolts-big-techs-contentious-return-to-the-office/", "via": "", "real_tags": ["远程工作", "tech"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从旧金山和纽约等城市搬到更便宜的地方的员工可能会被扣工资。 NurPhoto 来自 Getty Images 该公司周四表示，LinkedIn 的 16,000 名员工中的大多数将被允许远程全职工作，这与之前的政策相反。然而，该公司告诉路透社，从旧金山和纽约等城市搬迁到更便宜的地方的工人可能会根据当地市场价格停工。微软旗下的 LinkedIn 去年 10 月曾表示，在取消冠状病毒限制后，预计员工至少有 50% 的时间在办公室工作。 LinkedIn 的首席人事官 Teuila Hanson 说：“我们预计，我们肯定会看到比大流行之前更多的远程员工。”消息传出之际，科技公司及其员工就远程工作规则争论不休。苹果公司告诉员工，他们最终将被要求每周至少亲自工作三天，尽管由于当前冠状病毒病例激增，他们已将重返办公室的最后期限推迟到至少 10 月。\n此举遭到了一些苹果员工的抵制，他们散发了一封信，威胁说如果需要上班就辞职。大多数向 LinkedIn 首席执行官瑞安·罗斯兰斯基 (Ryan Roslansky) 汇报的员工将被允许远程工作。包括 Twitter 和 Facebook 在内的其他科技公司表示，欢迎许多员工永远远程工作——尽管 Facebook 和 LinkedIn 一样，计划为离开硅谷前往更便宜地区的员工削减工资。 Facebook 和谷歌昨天还告诉员工，他们返回办公室时将被要求接种疫苗。相比之下，LinkedIn 目前不要求想要返回办公室的员工接种疫苗。", "note_en": "Enlarge Image    Employees who relocate from cities like San Francisco and New York to cheaper locales may have their pay docked.  NurPhoto via Getty Images\n  The majority of LinkedIn’s 16,000 employees will be allowed to work remotely full-time, the company said Thursday, in a reversal of its previous policy.\n However, workers who relocate from cities like San Francisco and New York to cheaper locales may have their pay docked based on local market rates, the company told Reuters.\n LinkedIn — which is owned by Microsoft — had previously said last October that employees would be expected to work from the office at least 50 percent of the time after coronavirus restrictions are lifted.\n “We anticipate that we’ll definitely see more remote employees than what we saw prior to the pandemic,” said LinkedIn’s chief people officer, Teuila Hanson.\n The news comes as tech companies and their employees squabble over remote work rules.\n Apple has told employees they will eventually be required to work in person at least three days per week, although they have  pushed the return-to-office deadline back until at least October amid the current surge in coronavirus cases.\n That move has been met with resistance by some Apple employees, who  circulated a letter threatening to quit if required to report to work.\n Most employees who report to LinkedIn CEO Ryan Roslansky will be allowed to work remotely.\n Other tech companies including  Twitter and Facebook have said many employees are welcome to work remotely forever — although Facebook, like LinkedIn,  plans to slash pay for employees who leave Silicon Valley for cheaper areas.\n Facebook and Google also  told employees yesterday they would be required to be vaccinated when returning to the office.\n LinkedIn, by contrast, is not currently requiring employees who want to return to the office to be vaccinated.", "posttime": "2021-08-01 21:24:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linkedin,employees,员工", "title": "LinkedIn 表示大多数员工可以永远在家工作", "title_en": "LinkedIn says most employees can work from home forever", "transed": 1, "url": "https://nypost.com/2021/07/29/linkedin-says-most-employees-can-work-from-home-forever/", "via": "", "real_tags": ["linkedin", "employees", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 在计算中，摇树是一种死代码消除技术，在优化以 ECMAScript 方言（如 JavaScript 或 TypeScript）编写的代码到由 Web 浏览器加载的单个包中时应用。通常与 minifier 常见的传统单库死代码消除技术形成对比，树摇动通过从入口点开始并仅包括可能执行的函数来消除包中未使用的函数。 [1] [2] 它被简洁地描述为“实时代码包含”。动态语言中的死代码消除比静态语言中的问题要困难得多。 “摇树器”的想法起源于 1990 年代的 LISP [3]。其思想是，一个程序所有可能的执行流程都可以表示为一个函数调用树，这样就可以消除从未被调用的函数。该算法在 Google Closure Tools 中应用于 JavaScript，然后在同样由 Google 编写的 dart2js 编译器中应用于 Dart，由 Bob Nystrom 在 2012 年提出 [4] [2] 并在作者 Chris Buckett 的“Dart in Action”一书中进行了描述2013 年：当代码从 Dart 转换为 JavaScript 时，编译器会进行“摇树”。在 JavaScript 中，即使你只需要一个函数，你也必须添加一个完整的库，但是由于树摇动，Dart 派生的 JavaScript 只包含你需要的库中的单个函数 这个术语的下一波流行归因于到 2015 年开发的 Rich Harris 的 Rollup 项目 [5]。 JavaScript 中摇树的流行是基于这样一个事实，即与 CommonJS 模块不同，ECMAScript 6 模块加载是静态的，因此可以通过静态解析整个依赖树来推导出语法树。因此，摇树成为一个简单的问题。然而，摇树不仅适用于导入/导出级别：它还可以在语句级别工作，具体取决于实现。 [需要引用]", "note_en": "Jump to navigation  Jump to search  In  computing,  tree shaking is a  dead code elimination technique that is applied when optimizing code written in  ECMAScript dialects like  JavaScript or  TypeScript into a single bundle that is loaded by a  web browser. Often contrasted with traditional single-library dead code elimination techniques common to minifiers, tree shaking eliminates unused functions from across the bundle by starting at the entry point and only including functions that may be executed.  [1]  [2] It is succinctly described as &#34;live code inclusion&#34;.\n  Dead code elimination in dynamic languages is a much harder problem than in static languages. The idea of a &#34;treeshaker&#34; originated in  LISP  [3] in the 1990s. The idea is that all possible execution flows of a program can be represented as a tree of function calls, so that functions that are never called can be eliminated.\n The algorithm was applied to  JavaScript in  Google Closure Tools and then to  Dart in the dart2js compiler also written by  Google, presented by Bob Nystrom in 2012  [4]  [2] and described by the book &#34;Dart in Action&#34; by author Chris Buckett in 2013:\n When code is converted from Dart to JavaScript the compiler does &#39;tree shaking&#39;. In JavaScript you have to add an entire library even if you only need it for one function, but thanks to tree shaking the Dart-derived JavaScript only includes the individual functions that you need from a library\n The next wave of popularity of the term is attributed to Rich Harris&#39;s Rollup project  [5] developed in 2015.\n  The popularity of tree shaking in JavaScript is based on the fact that in distinction from CommonJS modules, ECMAScript 6 module loading is static and thus the whole dependency tree can be deduced by statically parsing the syntax tree. Thus tree shaking becomes an easy problem. However, tree shaking does not only apply at the import/export level: it can also work at the statement level, depending on the implementation. [   citation needed]", "posttime": "2021-08-01 21:08:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摇树,tree,dart", "title": "摇树", "title_en": "Tree Shaking", "transed": 1, "url": "https://en.wikipedia.org/wiki/Tree_shaking", "via": "", "real_tags": ["摇树", "tree", "dart"]}, {"category": "", "categoryclass": "", "imagename": "802b4b37a543a1120fc2507cee47562c.png", "infoid": 1070995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Org-Roam-UI 是 org-roam-server 的后继者，它通过与 Emacs 并行运行的 Web 应用程序扩展了 org-roam 的功能。如果您的 Emacs 缺少任何依赖项，请手动安装它们！org-roam-ui 需要 org-roam、websocket、simple-httpd、f 和 Emacs &gt;27 以进行快速 JSON 解析。 (use-package! websocket :after org-roam)(use-package! org-roam-ui :after org-roam ;; 或 :after org :hook (org-roam . org-roam-ui-mode) :config ) 我们建议只在加载 org(-roam) 之后加载 org-roam-ui，因为启动服务器和发出数据库请求会极大地影响启动时间。 ( use-package org-roam-ui :straight ( :host github :repo &quot;org-roam/org-roam-ui &quot; :branch &quot;main &quot; :files ( &quot;*.el &quot; &quot;out &quot;)) :after org- roam :hook (org-roam . org-roam-ui-mode)) 使用 Mx org-roam-ui-mode RET 启用全局模式。它将在 http://127.0.0.1:35901/ 上启动一个 web 服务器并通过 WebSocket 连接到它以进行实时更新。 ORUI 提供了一些无需离开 Emacs 即可与图形交互的命令。注意：目前这很笨拙，将来会改变。把这更像是一个预告片。\n以毫秒为单位的缩放速度（可以在 UI 中设置）。这些选项目前可能不起作用，请暂时在 UI 中配置它们。 Org-Roam-UI 公开了一些变量，但大部分定制是在 Web 应用程序中完成的。我们计划使图的更新顺利进行，目前只有在更新发生时才能重新加载整个图（但保留本地模式）。这是默认启用的，禁用 Org-Roam-UI 可以同步您的 Emacs 主题！这是默认行为，禁用它如果您不喜欢同步也不喜欢默认主题，您也可以提供自己的主题。为此，请将 org-roam-ui-custom-theme 设置为（相当具体的）变量列表，例如 ( setq org-roam-ui-custom-theme ( list (bg . &#39;#1E2029&#39;) (bg- alt . &#39;#282a36&#39;) (fg . &#39;#f8f8f2&#39;) (fg-alt . &#39;#6272a4&#39;) (red . &#39;#ff5555&#39;) (orange . &#39;#f1fa8c&#39;) (yellow .&#39;#ffb86c&#39;) (绿色。&#39;#50fa7b&#39;) (青色。&#39;#8be9fd&#39;) (蓝色。&#39;#ff79c6&#39;) (紫色。&#39;#8be9fd&#39;) (品红色。&#39;#bd93f9&#39;)))\n您可以选择在最后一个之后提供 (base1 . &#39;#XXXXXX&#39;) 参数来设置背景阴影，否则 ORUI 将根据提供的 bg 和 fg 进行猜测。顾名思义，Org-Roam-UI 仅适用于 org-roam！如果您以其他形式组织笔记 org-roam-ui 无法工作，因为它使用 org-roam 来获取所有连接。与 org-roam-server 的功能对等不是目标。虽然我们的目标是制作一个类似的产品，它具有可视化图表来帮助您探索和导航您的 org-roam 节点，但我们不打算复制所有这些，也不限于复制 org-roam-server 的功能。这是 alpha 软件：请尝试使用它，但期待错误和故障排除！该项目是由几个修补匠创建的，目的是为了解决他们自己的问题。我们不会得到任何物质方面的回报，发展可能会在任何一天停止（因为生活）。让项目保持活力的最好方法是探索代码并做出贡献！虽然我们尝试优化图形的显示，但我们能做的只有这么多。对于大型网络（&gt; 2k 节点），大量拖动图形可能会导致一些性能问题，但您可以采取一些措施来加快速度。尽管让我们感到难过，但 Firefox 的渲染引擎比它的 Chromium 表亲要慢得多。比较两者的性能，看看这是否是主要问题。\n我知道，看到那些小家伙在你的笔记上下移动非常酷，但速度很慢，尤其是在 3D 模式下。可能是渲染第二慢的东西，几乎不可能加快它的速度。考虑仅在突出显示时打开标签或调高“标签外观比例”。不错，就是贵！如果你想让图形更分散，关闭碰撞对结果布局的影响很小，但会大大提高性能。根据我们的经验，一旦图形真正稳定下来并且不需要再次渲染，环顾四周应该不会有什么问题。目前没有办法“保存”图形配置，但我们正在探索这种可能性。然而，图形布局算法是确定性的，因此除非对数据进行任何更改，否则每次都应该产生相同的结果。目前我们还没有显示使用 org-roam-bibtex 制作的引文链接，但我们很快就会！希望，是的！但是时间是有限的，所以我们可以在它自己内爆之前塞进这些东西的功能数量是有限的，所以我们正在逐步添加东西以确保它们工作。也就是说，我们很乐意听取您的意见！请在此讨论中发布功能请求或为已经发布的功能点赞，这样我们就可以稍微调整我们的优先级！ Org-Roam-UI 的主要功能是能够生成您的 org-roam 笔记的图形可视化。\n（双击）点击一个节点会在 Emacs 中打开相应的笔记，非常酷。你不需要 org-protocol，它开箱即用！当你在 Emacs 中打开一个笔记时，org-roam-ui 会移动到图上对应的节点。", "note_en": "Org-Roam-UI is meant a successor of  org-roam-server that extends functionality of org-roam with a Web app that runs side-by-side with Emacs.\n   Should your Emacs miss any of the dependencies, please install them manually!org-roam-ui requires  org-roam,  websocket,  simple-httpd,  f and Emacs &gt;27 for fast JSON parsing.\n            (use-package! websocket  :after org-roam)(use-package! org-roam-ui  :after org-roam   ;; or :after org  :hook (org-roam  . org-roam-ui-mode)  :config)\n We recommend only loading org-roam-ui after loading org(-roam) as starting the server and making database requests can impact startup times quite a lot.\n  ( use-package org-roam-ui  :straight ( :host github  :repo   &#34;org-roam/org-roam-ui &#34;  :branch   &#34;main &#34;  :files (  &#34;*.el &#34;   &#34;out &#34;))  :after org-roam  :hook (org-roam  . org-roam-ui-mode))\n   Use  M-x org-roam-ui-mode RET to enable the global mode.It will start a web server on  http://127.0.0.1:35901/ and connect to it via a WebSocket for real-time updates.\n  ORUI provides a few commands for interacting with the graph without ever having to leave Emacs.NOTE: This is quite janky at the moment and will change in the future. Consider this more of a teaser.\n       The speed at which you want to zoom (can be set in the UI) in ms.\n These options might not work at the moment, please configure them in the UI for the time being.\n  Org-Roam-UI exposes a few variables, but most of the customization is done in the web app.\n      We plan to make updates to the graph happen smoothly, at the moment it is only possible to reload the entire graph when an update happens (but local mode is preserved). This is enabled by default, to disable\n   Org-Roam-UI can sync your Emacs theme! This is the default behavior, to disable it do\n   You can also provide your own theme if you do not like syncing nor like the default one. To do so, set  org-roam-ui-custom-theme to an alist of (rather specific) variables, like so\n ( setq org-roam-ui-custom-theme ( list (bg  . &#39;#1E2029&#39;) (bg-alt  . &#39;#282a36&#39;) (fg  . &#39;#f8f8f2&#39;) (fg-alt  . &#39;#6272a4&#39;) (red  . &#39;#ff5555&#39;) (orange  . &#39;#f1fa8c&#39;) (yellow .&#39;#ffb86c&#39;) (green  . &#39;#50fa7b&#39;) (cyan  . &#39;#8be9fd&#39;) (blue  . &#39;#ff79c6&#39;) (violet  . &#39;#8be9fd&#39;) (magenta  . &#39;#bd93f9&#39;)))\n You can optionally provide  (base1 . &#39;#XXXXXX&#39;) arguments after the last one to also set the background shades, otherwise ORUI will guess based on the provides bg and fg.\n  As the name suggests, Org-Roam-UI only works with org-roam! If you organize your notes in some other form org-roam-ui cannot work, as it uses org-roam to fetch all the connections.\n Feature-parity with org-roam-server is not the goal. Although we aim to make a similar product which is having a visual graph to help you explore and navigate your org-roam nodes, we do not intend to replicate all of the, nor be limited to replicating the features of org-roam-server.\n This is alpha software: please do give it a try and use it, but expect bugs and troubleshooting!\n The project was created by a couple of tinkerers to scratch their own itch. We don&#39;t get rewarded in any material way and development may stop any day (because life). The best way to keep the project alive is to  explore the code and contribute!\n   While we try to optimize the display of the graph, there is only so much we can do. For largish networks (&gt;2k nodes) dragging the graph around a lot can cause some performance issues, but there are a few things you can do to speed it up.\n  As much as it saddens us to say, Firefox&#39;s rendering engine is quite a bit slower than its Chromium cousins. Compare the performance of the two and see if that&#39;s the main issue first.\n  I know, very cool to see those little guys travel up and down your notes, but very slow, especially in 3D mode.\n  Probably the second slowest thing to render, with little possibility of speeding it up. Consider only turning on labels on highlight or cranking up the &#34;Label appearance scale&#34;.\n    Nice, but costly! If you like to have the graph more spread out, turning off collision will change little in the resulting layout, but will help performance quite a bit.\n      In our experience, once the graph has actually settled and nothing needs to be rendered again, looking around should pose little trouble. At the moment there is no way of &#34;saving&#34; the graph configuration, but we are exploring the possibility. The graph layout algorithm is deterministic however, so barring any changes to the data it should produce the same results each time.\n  At the moment we aren&#39;t showing citation links made with  org-roam-bibtex yet, but we will soon!\n  Hopefully, yeah! But time is limited, and so is the amount of features we can cram into this things before it implodes in itself, so we are adding things incrementally to make sure they work. That said, we&#39;d love to hear from you! Please post feature requests in  this discussion or upvote those already posted, this way we can adjust our priorities somewhat!\n    Org-Roam-UI&#39;s main feature is the ability to generate a graph visualization of your org-roam notes.\n            (Double) clicking a node will open the corresponding note in Emacs, very cool.You  don&#39;t need org-protocol for this, it works out of the box!\n       When you open a note in Emacs, org-roam-ui will move to the corresponding node on the graph.", "posttime": "2021-08-01 21:04:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "roam,org", "title": "Org-roam-UI – 用于探索您的 org-roam Zettelkasten 的图形前端", "title_en": "Org-roam-UI – graphical front end for exploring your org-roam Zettelkasten", "transed": 1, "url": "https://github.com/org-roam/org-roam-ui", "via": "", "real_tags": ["roam", "org"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1070994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 NSO 首席执行官 Shalev Hulio 的声明，两名 Facebook 代表于 2017 年 10 月与 NSO 接洽，要求购买 Pegasus 某些功能的使用权。当时，Facebook 正处于部署名为 Onavo Protect 的 VPN 产品的早期阶段，在某些用户不知情的情况下，该产品会分析下载该产品的用户的网络流量，以了解他们正在使用哪些其他应用程序。根据法庭文件，Facebook 的代表似乎对购买 Pegasus 的一部分作为远程入侵手机的黑客工具不感兴趣，而是作为一种更有效地监控已经安装了 Onavo 的用户的手机的一种方式。 “Facebook 代表表示，Facebook 担心其通过 Onavo Protect 收集用户数据的方法在 Apple 设备上不如在 Android 设备上有效，”法庭文件中写道。 “Facebook 代表还表示，Facebook 希望在 Apple 设备上使用 Pegasus 的所谓功能来监视用户，并愿意为监视 Onavo Protect 用户的能力付费。”这只是两年多前的事。根据 NSO 的说法，Facebook 试图授权的 NSO 软件旨在供合法的反间谍和执法机构用于追捕罪犯和国家敌人。关于 NSO Group 及其服务，肯定会有争论，但 Facebook 对这款软件的声明意图是将其用于对其诚实用户的大规模监视。那真是一团糟——反社会。", "note_en": "According to  a declaration from NSO CEO Shalev Hulio, twoFacebook representatives approached NSO in October 2017 and askedto purchase the right to use certain capabilities of Pegasus.\n At the time, Facebook was in the early stages of deploying a VPNproduct called Onavo Protect, which, unbeknownst to some users, analyzed the web traffic of users who downloaded it to seewhat other apps they were using. According to the court documents,it seems the Facebook representatives were not interested inbuying parts of Pegasus as a hacking tool to remotely break intophones, but more as a way to more effectively monitor phones ofusers who had already installed Onavo.\n “The Facebook representatives stated that Facebook was concernedthat its method for gathering user data through Onavo Protect wasless effective on Apple devices than on Android devices,” thecourt filing reads. “The Facebook representatives also stated thatFacebook wanted to use purported capabilities of Pegasus tomonitor users on Apple devices and were willing to pay for theability to monitor Onavo Protect users.”\n This was just a little over two years ago. The NSO software that Facebook was attempting to license is — according to NSO — intended for legitimate counterintelligence and law enforcement agencies to use in the pursuit of criminals and enemies of the state. There’s certainly a debate to be had regarding the NSO Group and its services, but Facebook’s stated intention for this software was to use it for mass surveillance of its own honest users. That is profoundly fucked up — sociopathic.", "posttime": "2021-08-01 21:03:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,2020,监视,wanted", "title": "Facebook 想使用 NSO 的 Pegasus 来监视其用户（2020 年）", "title_en": "Facebook wanted to use NSO‘s Pegasus to spy on its users (2020)", "transed": 1, "url": "https://daringfireball.net/linked/2020/04/04/facebook-nso-group", "via": "", "real_tags": ["facebook", "2020", "监视", "wanted"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在 2013 年，我就开始了 mammoth.js，这是一个将 Word 文档转换为 HTML 的库。它不是一个大项目 - 大约 3,000 行 - 也不是特别令人兴奋。不过，我强烈怀疑，这个微小的副项目比我作为软件开发人员工作的整个十年产生的积极影响更大。我在工作的一个星期五下午写了原始版本，当时我意识到我的一些同事每周都要花费数小时和数小时煞费苦心地将 Word 文档中的文本复制到我们的 CMS 中并对其进行格式化。我编写了一个工具来自动化该过程，利用我们一致的内部样式将 Word 样式映射到正确的 CSS 类，而不是生成 Word 会生成的 HTML 汤。它并不完美 - 我的同事通常仍然需要调整一些东西 - 但我猜它为他们节省了 90% 以上的时间，他们以前花在一项琐碎和重复的任务上。由于这似乎是其他人遇到的问题，我自己做了一个开源实现，首先是 JavaScript，后来移植到 Python 和 Java。从那时起，我收到了人们的消息，告诉我如何为他们节省了很多时间：也许最暖心的是有人告诉我，他们每周节省​​的时间都花在了儿子身上。我不知道节省的总时间是多少，但我几乎可以肯定，它至少比我花在该工具上的时间多数百倍。诚然，近年来我并没有真正对项目进行那么多的开发。 docx 格式的稳定性意味着核心功能无需更改即可继续工作，并且大多数人使用相同的小功能子集，因此添加对更多案例和更多功能的支持正在迅速减少回报。项目的性质意味着我实际上并不需要支持那么多 docx：因为它试图通过将 Word 样式转换为 CSS 类来保留语义信息，而不是像 Word 一样在 HTML 中生成高保真副本，它可以愉快地忽略 Word 格式的大部分实际细节。相比之下，作为一名软件开发人员工作了十多年，我实际获得报酬的工作的影响似乎平淡无奇。\n我试图选择在看起来有用的领域工作的公司：开发人员生产力，治疗疾病，教育。虽然我在这些工作中的成功是可变的 - 在某些情况下，我为自己的成就感到自豪，在其他情况下我是很确定我的净影响充其量是零 - 我很难说累积影响大于我的小副项目。有时我想知道是否有可能靠猛犸象谋生。虽然可以选择捐赠 - 我目前每周从常规捐赠中获得总计 1.15 英镑 - 这不是我非常努力的事情。有特定用途我在业余时间可能永远无法支持的更复杂的案例 - 例如，支持方程 - 所以可能有钱可以在那里赚钱。不过，我不确定这会让我更快乐。如果我是一名独立开发者，我可能会想念与其他人一起工作，而且我不确定我是否真的有气质去做这项工作以获得足够的销售额过日子。然而，不知何故，这感觉像是一个错失的机会。开发可以立即看到好处的工具是非常令人满意的，而且可能有很多领域软件仍然可以提供帮助，而无需机器学习或由风险投资支持的高增长初创公司。我只是不确定像我这样的人真正这样做的最佳方式是什么。", "note_en": "Way back in 2013, I started  mammoth.js,a library that converts Word documents into HTML.It&#39;s not a large project - roughly 3,000 lines -nor is it particularly exciting.\n I have a strong suspicion, though, that that tiny side project has had more of a positive impact thanthe entirety of the decade I&#39;ve spent working as a software developer.\n I wrote the original version on a Friday afternoon at work,when I realised some of my colleagues were spending hours and hours each weekpainstakingly copying text from a Word document into our CMS and formatting it.I wrote a tool to automate the process,taking advantage of our consistent in-house styling to map Word styles to the right CSS classesrather than producing the soup of HTML that Word would produce.It wasn&#39;t perfect - my colleagues would normally still have to tweak a few things -but I&#39;d guess it saved them over 90% of the time they were spending before on a menial and repetitive task.\n Since it seemed like this was likely a problem that other people had,I made an open source implementation on my own time,first in JavaScript, later with ports to Python and Java.Since then, I&#39;ve had messages from people telling me how much time it&#39;s saved them:perhaps the most heartwarming being from someone telling me that the hours they saved each week were being spent with their son instead.\n I don&#39;t know what the total amount of time saved is,but I&#39;m almost certain that it&#39;s at least hundreds of times more than the time I&#39;ve spent working on the tool.\n Admittedly, I&#39;ve not really done all that much development on the project in recent years.The stability of the docx format means that the core functionality continues to work without changes,and most people use the same, small subset of features,so adding support for more cases and more features has rapidly diminishing returns.The nature of the project means that I don&#39;t actually need to support all that much of docx:since it tries to preserve semantic information by converting Word styles to CSS classes,rather than producing a high fidelity copy in HTML as Word does,it can happily ignore most of the actual details of Word formatting.\n By comparison, having worked as a software developer for over a decade,the impact of the stuff I actually got paid to do seems underwhelming.\n I&#39;ve tried to pick companies working on domains that seem useful:developer productivity, treating diseases, education.While my success in those jobs has been variable -in some cases, I&#39;m proud of what I accomplished, in others I&#39;m pretty sure my net effect was, at best, zero -I&#39;d have a tough time saying that the cumulative impact was greater than my little side project.\n Sometimes I wonder whether it&#39;d be possible to earn a living off mammoth.Although there&#39;s an option to donate -I currently get a grand total of £1.15 a week from regular donations -it&#39;s not something I push very hard.There are specific use cases that are more involved that I&#39;ll probably never be able to support in my spare time -for instance, support for equations -so potentially there&#39;s money to be made there.\n I&#39;m not sure it would make me any happier though.If I were a solo developer,I&#39;d probably miss working with other people,and I&#39;m not sure I really have the temperament to do the work to get enough sales to live off.\n Somehow, though, it feels like a missed opportunity.Working on tools where the benefit is immediately visible is extremely satisfying,and there&#39;s probably plenty of domains where software could still helpwithout requiring machine learning or a high-growth startup backed by venture capital.I&#39;m just not sure what the best way is for someone like me to actually do so.", "posttime": "2021-08-01 20:59:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,项目,side,支持", "title": "我的小项目比我在软件行业的十年产生的影响更大", "title_en": "My tiny side project has had more impact than my decade in the software industry", "transed": 1, "url": "https://mike.zwobble.org/2021/08/side-projects-vs-industry/", "via": "", "real_tags": ["软件", "项目", "side", "支持"]}, {"category": "", "categoryclass": "", "imagename": "f0017f4ecc23673adc02389d7e0bf939.png", "infoid": 1070992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "[德语]仍在使用该软件包的Microsoft Office 2010 所有者应该意识到该产品不仅已退出Microsoft 支持，而且在全新安装的情况下也无法再重新激活。微软现在似乎拒绝在重新安装后激活产品，正如我现在在两个特定案例中了解到的那样。为了能够在全新安装后使用 Microsoft Office 2010，它必须由 Microsoft 激活。对于拥有钥匙的普通买家来说应该没问题。不幸的是，一些购买了 Microsoft Office 2010 的用户，没有计算过没有 Microsoft。该公司只是关闭了 Office 2010 激活所需的激活服务器。德国博客读者 Tobias 现在有一个不愉快的经历，即这种需要的激活不再有效——无论是在线激活还是电话激活，正如他在 Twitter 上分享的那样。上面的德语推文说，他无法激活 Microsoft Office Professional Plus 2010，无论是在线激活还是通过电话激活。德国博客读者卡尔在以下回复推文中说：不再有效。只剩下 MAK 和 KMS。欢迎来到支持结束。 Tobias 回答说，他的 Microsoft Office 2010 使用带有多次激活密钥 (MAK) 的批量许可证。因此，Microsoft 似乎也拒绝了激活。注意：针对密钥管理服务器激活 KMS 密钥可能仍然有效，正如我对上面推文的解释。它也可以是基于 Linux 的 KMS 服务器，正如我在 Facebook 上看到的对我这篇文章的德语副本的反馈。一位 Facebook 用户写道，使用 C2R 激活仍然有效——但我不确定密钥是否可用于通过即点即用 (C2R) 安装 MSI。此外，并不是每个人都希望在他们的机器上使用这种 C2R 技术（请参阅 Office：由于 C2R 和 MSI 并行安装导致的不稳定性/崩溃？）。我在 2017 年的德语博客中已经解决了 Microsoft Office 2010 激活问题。人们不得不进行电话激活，因为在线激活不再有效。 2021 年 7 月中旬，德国博客读者 Steffen 在德国博客文章 Office 2010: Telefonaktivierung eingestellt? – Merkwürdigkeit II（我已经翻译了德语文本）：在与 [MS] 员工进行 10 分钟电话讨论后，[它] 向我明确表示在任何情况下都无法再激活。原因是支持的结束，支持也意味着激活。\n我现在持有一些无法再使用的 Prof 和 Business 许可证，但这些许可证是几年前为公司正式购买的。这再次展现了微软Office丑陋的一面：如果微软认为支持已经过期，他们可以拒绝重新激活——因此该产品无法再使用。不管对 Office 2010 的支持是否已过期，我想知道上述示例是否是孤立的情况，或者激活基础结构是否已经/正在关闭，以及它是否影响零售或批量许可证。上面引用的电话激活示例可能是一个零售包，上面引用的 Twitter 示例与 MAK 密钥相关。问题：是否有类似的受影响方——哪些类型的许可证（零售或批量）无法再激活？可能只有 MAK 密钥受到影响，而 Office 2010 仍然可以针对密钥管理服务器激活（需要 KMS 密钥）。而且 Click-2-Run (C2R) 包也应该在激活方面仍然有效。作为后续问题：有可能备份激活文件并在新的 Office 安装后将其保存。有什么经验，这工作可靠吗？", "note_en": "[ German]Owners of Microsoft Office 2010 who are still using this package should realize that this product has not only fallen out of Microsoft support, but can also no longer be re-activated in case of a fresh install. Microsoft seems to refuses now to activate the product after a re-install, as I have now learned in two specific cases.\n    To be able to use Microsoft Office 2010 after a new installation, it must be activated by Microsoft. Should be no problem for a regular buyer who owns a key. Unfortunately, some users who bought Microsoft Office 2010, haven’t calced without Microsoft. The company has simply switched off the activation servers that are required for Office 2010 activation.\n  German blog reader Tobias has now had the unpleasant experience that this required activation no longer works – neither the online activation, nor a telephone activation, as he shares on  Twitter. The German tweet above says, he could not activate Microsoft Office Professional Plus 2010, either online nor via telephone activation. German blog reader Karl says in the following reply tweet:  No longer works. Only MAK and KMS left. Welcome to the end of support.\n  Tobias answered that he uses a volume license with a multi-activation key (MAK) for his Microsoft Office 2010. So there, too, activation seems to be denied by Microsoft.\n  Notes: Activating a KMS key against a Key Management Server probably still works, as I interpret above tweet right. It could also be a Linux-based KMS server, as I read on Facebook at a feedback to my German copy of this article. And a Facebook user wrote that an activation with C2R still works – but I’m not sure if a key can be used for an MSI installation with Click-to-Run (C2R). Besides, not everyone wants this  C2R technology on their machine (see  Office: Instabilities/crashes due to C2R and MSI parallel installation?).\n  I had already addressed the issue of Microsoft Office 2010 activation within my German blog blog in 2017. People had to do a phone activation because the online activation didn’t work anymore. In mid-July 2021, German blog reader Steffen left  this comment on the German blog post  Office 2010: Telefonaktivierung eingestellt? – Merkwürdigkeit II (I’ve translated the German text):\n After 10 minutes of discussion on the phone with an [MS] employee [it] was made clear to me that an activation is no longer possible under any circumstances. The reason was the end of support and support also means activation.\n I am now sitting on several Prof and Business licenses that I can no longer use, but were officially purchased years ago for the company.\n This again shows the ugly side of Microsoft Office: If Microsoft thinks that the support has expired, they are able to refuse the re-activation – so the product can no longer be used.\n  Regardless of whether support for Office 2010 has expired, I’m wondering if the above examples are isolated cases, or if the activation infrastructure has been/is being shut down, and whether it affects retail or volume licenses. The phone activation example cited above was likely a retail package, the Twitter example referenced above was related to a MAK key.\n Question: are there similar affected parties – and what type of license (retail or volume) could no longer be activated? It may be that only MAK keys are affected, while Office 2010 can still be activated against a Key Management Server (KMS key required). And the Click-2-Run (C2R) packages are also supposed to still work regarding activation.\n And as a follow-up question: There is the possibility to  backup an activation file and save it back after a new Office installation. What is the experience, does this work reliably?", "posttime": "2021-08-01 20:58:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft", "title": "Microsoft Office 2010：无法再激活？", "title_en": "Microsoft Office 2010: Can’t be activated anymore?", "transed": 1, "url": "https://borncity.com/win/2021/07/29/microsoft-office-2010-keine-aktivierung-mehr/", "via": "", "real_tags": ["microsoft"]}, {"category": "", "categoryclass": "", "imagename": "e13a53ff828b4cb0427891696efba396.jpg", "infoid": 1070990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021 年，跑车界将迎来真正的嗡嗡声。经过多年运行不兼容的技术规则，美国、法国和世界其他地区负责耐力赛的三个组织终于找到了共同点。很快，一辆能够在勒芒赢得总冠军的汽车也将有资格在赛百灵或代托纳取得同样的成绩，反之亦然。这种融合旨在激发兴趣并吸引新的参赛者，它正在这样做：讴歌、奥迪、宝马、法拉利、格里肯豪斯、标致和丰田都已确认计划。预计也有来自凯迪拉克、现代和兰博基尼的参赛作品。自 C 组的辉煌时代以来，制造商的参与程度从未见过，而且可以说不断增加的竞争对手领域让球迷对这一前景感到兴奋。但是，跑车比赛——通常涉及多种级别的赛车同时比赛——如果不是过于复杂的话，也没什么。好消息，但请耐心等待我们解释正在发生的事情。首先，监管和决策涉及三个不同的组织。在美国，国际汽车运动协会 (IMSA) 负责整体跑车比赛和 Weathertech 跑车锦标赛，其中包括特定赛事，例如代托纳的劳力士 24、赛百灵 12 小时耐力赛和小勒芒，其中。在欧洲，西部汽车俱乐部 (ACO) 是勒芒 24 小时耐力赛的组织者。然后是国际汽车联合会（FIA），它负责全球赛车运动和世界耐力锦标赛等世界锦标赛。在 2000 年代，IMSA 和 ACO 使用了非常相似的技术规则。但在 2014 年，IMSA 与另一个美国系列合并，而新的合作必须提出一个原始规则手册，以适应新的汽车组合。不幸的是，他们的决定没有为最快的勒芒原型车（称为 LMP1）留下空间。强大的 LMP1 继续在勒芒和 WEC 比赛，最终演变成一些有史以来技术最先进的汽车。 LMP1 很快变成了 LMP1h——“h”代表混合动力。一套复杂的规则被称为性能等效性，理论上允许不同的技术方法在公平的竞争环境中竞争。在随后的比赛中，我们看到了动力飞轮和超级电容器以及锂离子电池、汽油和柴油发动机以及后轮或全轮驱动动力系统。\n在短短的几年里，车迷们享受了奥迪、丰田和保时捷之间的史诗般的比赛。但是这两家德国原始设备制造商的一级方程式预算变得不可持续，尤其是在柴油门之后。到 2018 年，只有丰田留下来，与非混合动力私人 LMP1 汽车竞争。 ACO 试图通过不断增加的障碍为资金少得多的私掠船提供公平的待遇，但此类规定并不总是成功。同时回到美国：2017 年，IMSA 推出了新的 DPi（代托纳原型国际）类别。这以 ACO 的第二快类别（称为 LMP2）为起点，但 LMP2 面向私人车队和业余车手，而 DPi 则面向 OEM 和工厂车队。因此，IMSA 允许 DPi 参赛者自由选择自己的引擎和开发自己的电子设备（两者都是 LMP2 中的规范项目）。新的 DPi 指南还为原始设备制造商提供了更多的造型自由，使赛车原型看起来更像真正的公路车。当然，技术法规不会永远持续下去。 IMSA、ACO 和 FIA 都知道，要吸引更多 OEM 厂商加入顶级跑车，最终需要做一些事情。首先，考虑到几乎每家公司都采取了使乘用车车队电气化的举措，规则必须允许某种形式的混合动力。其次，汽车应该与公路汽车更相似。最后，成本需要变得合理。进入超级跑车。 ACO 首先开始行动，宣布它希望吸引像阿斯顿马丁瓦尔基里这样的公路合法超级跑车的赛车版本。取下汽车的车牌、放入防滚架和参加比赛的想法有些浪漫（即使这种东西真正实用已经过去了大约 50 年）。因此，ACO 创建了勒芒超级跑车 (LMH) 类别来实现这一目标。 LMH 允许参赛者有相当多的技术自由（虽然少于 LMP1h）；与 LMP1 相比，这款车更重且动力更弱，下压力与阻力比为 4:1。今年第一辆 LMH 汽车上赛道，包括两辆丰田 GR010 混合动力车、两辆 Glickenhaus 007 超级跑车，以及一辆已经过时的 Alpine LMP1 汽车。正如我们最近报道的那样，标致将于明年回归其 9X8 混合动力车，法拉利已确认将在 2023 年推出混合动力汽车进入 LMH。尽管如此，IMSA 有一些自己的要求，这意味着它不能仅仅采用 LMH 作为其顶级产品。但事实证明，DPi 非常成功，因此在 2023 年，IMSA 正在将该类别发展为一个名为 LMDh 的新类别。与 DPi 一样，它从原始设备制造商选择四个批准的“脊椎”之一开始——由 Dallara、Ligier、Multimatic 和 Oreca 制造的碳纤维底盘。与 DPi 一样，每个 OEM 都可以自由选择自己的发动机和电子设备，并且比 DPi 有更多的造型自由度，尽管与 LMH 具有相同的 4:1 下压力阻力比。为了降低成本，每辆车中有大量相同的特定（指定）组件。其中包括混合动力系统，该系统结合了博世电动机和 Xtrac 顺序变速箱，以及来自 Williams Advanced Engineering 的锂离子牵引电池。发送到后轮的总功率输出上限为 670 马力（500 千瓦）——电动机可以以高达 268 马力（200 千瓦）的功率再生，但只能部署 67 马力（50 千瓦）。\n无拘无束的技术开发的粉丝可能会对规范组件的使用嗤之以鼻，这肯定会使原始设备制造商可能想要讲述的关于从赛道到公路车的技术转移的任何故事变得复杂。但好处是价格标签——完整的混合动力系统将花费约 355,000 美元（300,000 欧元），底盘约为 408,000 美元（345,000 欧元）。加上内燃机和其他一些零件的成本，一辆完整的 LMDh 汽车的成本仍应低于 150 万美元。对于像奥迪这样的原始设备制造商来说，这绝对是有吸引力的。 “新的超级跑车与我们在赛车运动中的新设置和我们的电气化路线图完美契合，”奥迪运动发言人通过电子邮件告诉 Ars。 “特别是 LMDh 汽车的规定使我们能够在全球著名的比赛中使用引人入胜的赛车，同时调整规定以实现最大的成本效率。” （奥迪和保时捷正在合作开发 LMDh 计划，使用相同的发动机和相同的 Multimatic 底盘，但造型不同，这也可能导致 2024 年推出兰博基尼版本。）美国锦标赛允许 LMDh 的事实也考虑到了这一点一些 OEM 的决定。 “我们知道我们要安装什么引擎，我们知道我们要使用的构造器，然后该计划首先以 IMSA 锦标赛为中心，因为我们希望为我们最大的市场，也就是美国，”宝马赛车运动的老板迈克·瓦拉克说。 （据信宝马已选择 Dallara 作为其底盘制造商。）当被问及时，Wrack 认为使用规格组件并没有太大问题。 “你在电动方程式中也看到了：有很多规范，但也有一些开放的领域。我们在那里学到了很多东西，”他说。 “所以是的，有很多规格，但我认为规格是控制成本的唯一方法。对于超级跑车 [LMH]，有额外成本的因素，在当前时代，这真的很难“通过[董事会]。所以，对我们来说，LMDh 是一个首选方向，不仅因为成本效益，还因为美国市场。”", "note_en": "In 2021, there is a real buzz building in the world of sports car racing. After many years of running incompatible technical regulations, the three organizations that are in charge of endurance racing in the US, France, and the rest of the world have managed to find common ground. Soon, a car that&#39;s able to compete for the overall win at Le Mans will also be eligible to do the same at Sebring or Daytona, and vice-versa.\n This convergence was meant to stimulate interest and draw in new entries, and it&#39;s doing just that: Acura, Audi, BMW, Ferrari, Glickenhaus, Peugeot, and Toyota have all confirmed programs. Entries are also expected from Cadillac, Hyundai, and Lamborghini. That level of manufacturer involvement hasn&#39;t been seen since the glory days of Group C, and it&#39;s fair to say the increasing field of competitors has fans excited at the prospect.\n But sports car racing—which often involves multiple classes of cars racing at the same time—is nothing if not overly complicated. The news  is good, but bear with us as we explain what&#39;s going on.\n  To start with, there are three different organizations involved in the regulations and decision-making. Here in the US, the International Motor Sports Association (IMSA) is in charge of overall sports car racing and the Weathertech SportsCar Championship, which includes specific events like the Rolex 24 at Daytona, the 12 Hours of Sebring, and the Petit Le Mans, among others.\n Over in Europe, the Automobile Club de l&#39;Ouest (ACO) is the organizer of the 24 Hours of Le Mans. And then there&#39;s the Fédération Internationale de l&#39;Automobile (FIA), which is in charge of global motorsport and world championships like the World Endurance Championship.\n In the 2000s, IMSA and the ACO used very similar technical regulations. But in 2014, IMSA merged with another US series, and that new collaboration had to come up with an original rulebook to accommodate a new mix of cars. Unfortunately, what they settled on left no room for the very fastest Le Mans prototypes (called LMP1s).\n     The mighty LMP1s continued to race at Le Mans and in the WEC, eventually evolving into some of the  most technologically advanced cars ever seen. LMP1 soon turned into LMP1h—&#34;h&#34; for hybrid. A complicated set of rules called the  Equivalence of Performance was put in place to theoretically allow different technical approaches to compete on a level playing field. In the resulting races, we saw kinetic flywheels and supercapacitors as well as lithium-ion batteries, both gasoline and diesel engines, and rear- or all-wheel drive powertrains.\n For a few short years, fans were treated to some epic racing between Audi, Toyota, and Porsche. But the two German OEMs had Formula 1-sized budgets that became unsustainable,  particularly in the aftermath of dieselgate. By 2018, only Toyota remained, competing against non-hybrid privateer LMP1 cars. The ACO tried to make things fair for the much less well-funded privateers through an ever-increasing handicap, but such regulations didn&#39;t always succeed.\n Meanwhile back in the States: in 2017,  IMSA introduced its new DPi ( Daytona Prototype International) category. This took the ACO&#39;s second-fastest category (called LMP2) as its starting point, but where LMP2 was aimed at privateer teams and amateur drivers, DPi was for OEMs and factory teams. So, IMSA allowed DPi entrants the freedom to choose their own engine and develop their own electronics (both of which were spec items in LMP2). The new DPi guidelines also gave the OEMs more styling freedom so that the racing prototypes looked a little bit more like actual road cars.\n Technical regulations don&#39;t last forever, of course. IMSA, the ACO, and the FIA all knew attracting more OEMs to the top class of sports cars would ultimately require a few things. First, the rules had to allow for some form of hybridization, given almost every company&#39;s move to electrify passenger car fleets. Next, the cars should bear more resemblance to road-going cars. And finally, costs needed to become sensible.\n  Enter the hypercar. The ACO got the ball rolling first, announcing that it wanted to attract racing versions of road-legal hypercars like the Aston Martin Valkyrie. There&#39;s something romantic about the idea of taking off a car&#39;s number plates, putting in a rollcage, and going racing (even if it&#39;s been about 50 years since such a thing was really practical).\n So the ACO created a Le Mans Hypercar (LMH) category to make that happen. LMH allows entrants quite a lot of technical freedom (though less than LMP1h); the cars are heavier and less powerful than LMP1, with a lower downforce-to-drag ratio of 4:1. The first LMH cars took to the track this year, including  a pair of Toyota GR010 hybrids, a pair of Glickenhaus 007 hypercars, and an Alpine LMP1 car that has been grandfathered in. As we reported recently,  Peugeot is set to return next year with its 9X8 hybrid, and  Ferrari has confirmed it will enter LMH in 2023 with a hybrid car.\n Still, IMSA had some of its own requirements that meant it couldn&#39;t just adopt LMH for its top class. But DPi proved pretty successful, and so in 2023 IMSA is evolving that category into a new one called LMDh. Like DPi, it starts off with an OEM choosing one of four approved &#34;spines&#34;—the carbon fiber chassis manufactured by Dallara, Ligier, Multimatic, and Oreca. As with DPi, each OEM is free to choose its own engine and electronics, and there is even more styling freedom than DPi, albeit with the same 4:1 downforce-drag ratio as LMH.\n There are plenty of spec(ified) components that will be identical in each car to keep costs down. That includes the hybrid system, which combines a Bosch electric motor and Xtrac sequential gearbox, as well as a lithium-ion traction battery from Williams Advanced Engineering. Total power output will be capped at 670 hp (500 kW) sent to the rear wheels—the electric motor is allowed to regenerate at up to 268 hp (200 kW) but can only deploy 67 hp (50 kW).\n Fans of uninhibited technology development may turn their noses up at the use of spec components, and it certainly complicates any stories an OEM might want to tell about technology transfer from the race track to road cars. But the upside is the price tag—the complete hybrid system will cost around $355,000 (€300,000) and the chassis about $408,000 (€345,000). Add in the cost of the internal combustion engine and some other bits, and a complete LMDh car should still cost less than $1.5 million.\n That&#39;s definitely attractive for an OEM like Audi. &#34;The new hypercars fit perfectly with our new set-up in motorsport and our roadmap of electrification,&#34; an Audi Sport spokesperson told Ars by email. &#34;The regulations for LMDh cars in particular allow us to field fascinating race cars in prestigious races worldwide while regulations are trimmed for maximum cost efficiency.&#34; (Audi and  Porsche are working together on an LMDh program using the same engine and the same  Multimatic chassis but with different styling, which may also result in a Lamborghini version in 2024.)\n The fact that the LMDh is allowed in US championships also factored in to some OEM decisions. &#34;We know what engine we&#39;re going to put [in], we know what constructor we&#39;re going to work with, and then the program is in the first place centered around the IMSA championship because we want to have this for our biggest market, which is the US,&#34; said BMW Motorsport boss Mike Wrack. (BMW is believed to have selected Dallara as its chassis-maker.)\n When asked, Wrack didn&#39;t see much wrong with the use of spec components. &#34;You see it also in Formula E: there is a lot of spec, but there are also some open areas. And we learned a lot there,&#34; he said. &#34;So yes, there is a lot of spec, but I think the spec is the only way to keep costs under control. And with hypercar [LMH], there is an element of additional cost, which in current times, it&#39;s really difficult to get through [the board of directors]. So, for us, the LMDh was a preferred direction, not only because of cost efficiency, but also because of the US market.&#34;", "posttime": "2021-08-01 20:18:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sports,比赛,excited,汽车", "title": "什么是 LMDh，为什么我们对 2023 年的跑车比赛如此兴奋？", "title_en": "What is LMDh and why are we so excited about sports car racing in 2023?", "transed": 1, "url": "https://arstechnica.com/cars/2021/08/what-is-lmdh-and-why-are-we-so-excited-about-sportscar-racing-in-2023/", "via": "", "real_tags": ["sports", "比赛", "excited", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "竞争监管机构发现公司的“过高和不公平”的价格在 10 年内使 NHS 额外花费了近 3000 万英镑 英国竞争监管机构对制药公司 Advanz 及其前私募股权所有者处以超过 1 亿英镑的罚款，因为它被发现夸大了其甲状腺片的价格高达 6,000%。竞争与市场管理局 (CMA) 的一项调查发现，这家私募股权支持的制药公司对用于治疗甲状腺激素缺乏症的碘塞罗宁片剂收取“过高和不公平的价格”。调查显示，Advanz 从 2007 年开始利用市场有限的竞争优势，使抑郁症和疲劳患者经常使用的药物价格持续上涨超过 6,000%。 CMA 表示，2007 年至 2017 年间，NHS 为碘塞罗宁片支付的价格从 4.46 英镑上涨至 258.19 英镑，涨幅近 6,000%，而生产成本基本保持稳定。反复提价导致 NHS 在平板电脑上的支出从 2006 年实施提价策略之前的 60 万英镑飙升至 2009 年的 230 万英镑，到 2016 年高达 3000 万英镑。 drop list”于 2015 年 7 月，这意味着全科医生无法再开处方，导致许多依赖该药物的人面临停止治疗或不得不自费购买药物的前景。患者告诉《卫报》，他们别无选择，只能向私人医生支付处方费用，并被迫通过互联网寻找更便宜的平板电脑，从在线药店和外国供应商处购买药物，却不知道所出售的平板电脑是否为正品。\nCMA 表示，这“特别令人担忧”，因为许多患者对甲状腺功能减退症的主要治疗方法——左旋甲状腺素片——反应不佳，依靠碘塞罗宁来治疗极度疲劳和抑郁。 Advanz 将被罚款近 4100 万英镑，其两个前私募股权所有者——Hg Capital 和 Cinven——将分别支付 860 万英镑和 5190 万英镑的罚款。 CMA 首席执行官 Andrea Coscelli 博士说：“Advanz 决定提高碘塞罗宁片的价格并在八年多的时间里征收过高和不公平的价格，这给 NHS 带来了巨大的成本，最终给英国纳税人带来了巨大损失。 “但这还不是全部。这也意味着那些因甲状腺疾病而患有抑郁症和极度疲劳的人被告知，由于价格上涨，他们无法继续接受最有效的治疗。”他表示，CMA 的 1 亿英镑罚款和制药行业的其他工作将发出“一个明确的信息，即违法将产生严重后果”。两周前，CMA 对制药公司处以超过 2.6 亿英镑的罚款，这些公司近十年来一直向 NHS 多收了氢化可的松片，成千上万的人依靠这种药来治疗肾上腺功能不全。其对 Advanz 的最新干预是在一项始于 2016 年 10 月且涉及多家公司的为期五年的调查之后进行的。\n总部位于伦敦的私募股权集团 Hg Capital 于 2009 年以 1.79 亿英镑的价格收购了 Mercury，并于 2012 年以 4.65 亿英镑的价格将其出售给了同类收购公司 Cinven。 同年，Cinven 以 3.67 亿英镑的价格收购了家族拥有的利基制药企业 Amdipharm，随后合并这两项业务。 2015 年，Cinven 以 23 亿英镑的价格将合并后的实体出售给了在多伦多证券交易所上市的加拿大公司 Concordia Healthcare。 2018 年，在 CMA 首次指控该公司滥用职权一年后，Concordia 更名为 Advanz Pharma。后来它从证券交易所退市，进行了财务重组，并于 2021 年被总部位于哥本哈根的 Nordic Capital 以 6.05 亿英镑的价格收购。本文于 2021 年 7 月 30 日修订。早期版本将 Amdipharm 错误拼写为“Adipharm”，并省略了 Rob Davies 的署名。", "note_en": "Competition watchdog found company’s ‘excessive and unfair’ prices cost NHS almost £30m extra over 10 years\n    The UK’s competition watchdog has imposed fines of more than £100m on the pharmaceutical company Advanz and its former private equity owners after it was found to have inflated the price of its thyroid tablets  by up to 6,000%.\n An investigation by the  Competition and Markets Authority (CMA) found that the private-equity backed pharmaceutical company charged “excessive and unfair prices” for liothyronine tablets, which are used to treat thyroid hormone deficiency.\n  Advanz took advantage of limited competition in the market from 2007 to bring in sustained price hikes for the drug, often used by patients with depression and fatigue, of more than 6,000% in the space of 10 years, according to the investigation.\n The CMA said that between 2007 and 2017, the price paid by the  NHS for liothyronine tablets rose from £4.46 to £258.19, a rise of almost 6,000%, while production costs remained broadly stable.\n Repeated price increases led NHS spending on the tablets to soar from £600,000 in 2006, before the price increase strategy was implemented, to more than £2.3m by 2009 and as much as £30m by 2016. The tablets were placed on the NHS “drop list” in July 2015, which meant GPs could no longer prescribe them, causing many people who relied on the drug to face the prospect of having their treatment stopped or having to purchase it at their own expense.\n Patients told the Guardian they were left with no option but to pay private doctors for prescriptions, and forced to hunt for cheaper tablets over the internet, buying the medication from online pharmacies and foreign suppliers without knowing whether the tablets being sold were genuine.\n The CMA said this was “particularly concerning” because many patients do not respond well to the main treatment for hypothyroidism – levothyroxine tablets – and rely on liothyronine to treat their extreme fatigue and depression.\n Advanz will be fined almost £41m, and two of its former private equity owners – Hg Capital and Cinven – will pay penalties of £8.6m and £51.9m respectively.\n Dr Andrea Coscelli, the CMA’s chief executive, said: “Advanz’s decision to ratchet up the price of liothyronine tablets and impose excessive and unfair prices for over eight years came at a huge cost to the NHS, and ultimately to UK taxpayers.\n “But that wasn’t all. It also meant that people dealing with depression and extreme fatigue, as a result of their thyroid conditions, were told they could not continue to receive the most effective treatment for them due its increased price.”\n He said the CMA’s £100m fine and other work in the pharmaceutical sector would send “a clear message that breaking the law has serious consequences”.\n The CMA  imposed fines of more than £260m two weeks ago on pharmaceutical companies that had overcharged the NHS for almost a decade for hydrocortisone tablets, which tens of thousands of people rely on to treat adrenal insufficiency.\n Its latest intervention against Advanz follows a five-year investigation that began in October 2016 and involved multiple companies.\n   London-based private equity group Hg Capital bought Mercury for £179m in 2009 and sold it to fellow buyout house Cinven for £465m in 2012. Cinven had bought family-owned niche pharmaceuticals business Amdipharm that same year, for £367m, and subsequently merged the two businesses.\n In 2015, Cinven sold the combined entity to Concordia Healthcare, a Canadian company listed on the Toronto stock exchange, in a £2.3bn deal. In 2018, a year after the CMA first  accused the company of abusing its position, Concordia changed its name to Advanz Pharma.\n It later de-listed from the stock exchange, underwent a financial restructuring, and was bought in 2021 by Copenhagen-based Nordic Capital for £605m.\n  This article was amended on 30 July 2021. An earlier version misspelled Amdipharm as “Adipharm” and omitted the byline of Rob Davies.", "posttime": "2021-08-01 20:07:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "制药,pharmaceutical", "title": "英国制药公司因抬高药品价格 6,000% 被罚款", "title_en": "UK Pharmaceutical Firm Fined For Hiking Drug Price 6,000%", "transed": 1, "url": "https://www.theguardian.com/business/2021/jul/29/pharma-firm-advanz-fined-after-thyroid-tablets-price-inflation-of-6000", "via": "", "real_tags": ["制药"]}, {"category": "", "categoryclass": "", "imagename": "0a31464b63e4a43f7aefa00d6e285fc6.jpg", "infoid": 1070988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我终于完成了200W的激光枪！！ &#39;这台巨大的激光器是由废金属和一堆破碎的“混合”DLP投影仪制成的，运行在一堆...", "note_en": "I finally finished the 200W laser gun!! 'This monster laser was built from scrap metal and a pile of broken \"hybrid\" DLP projectors, and runs on a stack of l...", "posttime": "2021-08-01 20:02:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自制,homebuilt,混合", "title": "我的自制 200W 激光器 (2016) [视频]", "title_en": "My Homebuilt 200W Laser (2016) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=IzUoe-9bKa0&t=81s", "via": "", "real_tags": ["自制", "homebuilt", "混合"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GoAccess 旨在成为一个快速的、基于终端的日志分析器。它的核心思想是无需使用浏览器即可实时快速分析和查看 Web 服务器统计信息（如果您想通过 SSH 对访问日志进行快速分析，或者您只是喜欢在终端中工作，那就太好了）。虽然终端输出是默认输出，但它能够生成完整的、自包含的实时 HTML 报告（非常适合分析、监控和数据可视化）以及 JSON 和 CSV 报告。几乎所有网络日志格式（Apache、Nginx、Amazon S3、Elastic Load Balancing、CloudFront、Caddy 等）", "note_en": "GoAccess was designed to be a fast, terminal-based log analyzer. Its core idea is\t\t\t\t\tto quickly analyze and view web server statistics in  real\t\t\t\t\ttime without needing to use your browser\t\t\t\t\t( great if you want to do a quick analysis of your access log via SSH, or if you simply love working in the terminal).\n  While the terminal output is the default output, it has the capability to generate a complete, self-contained  real-time   HTML report ( great for analytics, monitoring and data visualization), as well as a   JSON, and   CSV report.\n  Nearly all web log  formats (Apache, Nginx, Amazon S3, Elastic Load Balancing, CloudFront, Caddy, etc)", "posttime": "2021-08-01 19:58:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,visual,日志", "title": "GoAccess – 可视化网络日志分析器", "title_en": "GoAccess – Visual Web Log Analyzer", "transed": 1, "url": "https://goaccess.io/", "via": "", "real_tags": ["可视化", "visual", "日志"]}, {"category": "", "categoryclass": "", "imagename": "082d9e4199def7e9d1b42805557b9984.jpeg", "infoid": 1070986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "意大利初创公司 Energy Dome 表示，其仅使用现成设备的新型长效“CO 2 电池”系统将在未来几年内实现 50-60 美元/MWh 的平准化存储成本 (LCOS) .根据 Lazard 的说法，这将是锂离子电池 LCOS 的两倍多——132-245 美元/MWh——几乎是目前长期存储市场领导者 Highview Power 的 CRYObattery 的两倍（100 美元/MWh，根据2019 年对 Recharge 的采访）。首席执行官克劳迪奥·斯帕达奇尼 (Claudio Spadacini) 告诉 Recharge，Energy Dome 的热力学液态二氧化碳系统的往返效率为 75-80%，高于目前市场上的任何其他长持续时间储能技术，包括液态空气、压缩空气和基于重力的解决方案。 Spadacini 说：“我们计算出的 LCOS 已经低于 100 美元/MWh，我们将要建造的第一个商业工厂是 25MW/200MWh——我们的标准模块。” “但我们有一个预测，即我们可以相当快地降低该技术的成本。因此，我们的目标是在几年内远低于 60 美元/兆瓦时，接近 50 美元/兆瓦时。”但在竞争日益激烈、发展​​迅速的行业中，Energy Dome 的技术一旦商业化，可能就不是市场上最便宜的储能技术。 Highview 的目标是到 2030 年达到 50 美元/MWh，而总部位于美国的 Echogen 承诺从其基于超临界 CO 2 的系统中实现 50-60 美元/MWh 的 LCOS。\n就在上周，美国初创公司 Form Energy 声称其 100 小时铁空气电池的 LCOS 成本不到锂离子电池的十分之一——但它没有说何时，其技术还没有在实验室外进行验证。 CO 2 电池利用热能储存方面，将电能储存为热量，以及压缩空气和液态空气系统，减少空气体积（通过压缩/冷凝），然后通过使其快速膨胀来发电到它的自然状态，膨胀产生的嗖嗖声驱动着一个发电涡轮机。在 Energy Dome 的系统中，二氧化碳在 60 巴的压力下被压缩，将气体加热到 300°C 的液体。然后将热量提取并储存在由钢丸和石英岩制成的“砖块”中以备后用，将 CO 2 冷却到环境温度。然后将气体冷凝成液体形式并储存在碳钢罐中。当需要电力时，液态 CO 2 会通过蒸发器将其变回加压气体，然后将其加热回 290-300°C，从而产生储存热量。然后将气体引入膨胀涡轮机，在那里它在大气压力下迅速膨胀以驱动发电转子，然后将未压缩的 CO 2 储存在一个灵活的圆顶中 - 因此公司名称 - 在环境温度和压力下供以后重新使用-采用。 Spadacini 解释说，Energy Dome 使用 CO 2 是因为它可以在 30°C 的压力下转化为液体，而空气则为负 150°C。该公司表示，因此 Highview Power 的液态空气电池必须使用低温技术来液化空气，但 Energy Dome 系统需要的功率要少得多，从而降低了成本并提高了往返效率。 “这个想法……是全新的、完全创新的，但实际上是基于现成的组件，”Spadacini 说。 “所以我们只是把现有的组件放在一起，这是进入市场的关键。”这确实意味着不需要使用周围的空气，而是需要一个大型充气气柜（即圆顶）来将 CO 2 储存在封闭系统中。但这是一种低成本组件，只需要一种坚固但柔韧的 PVC 涂层纺织品，这种纺织品已经制造用于沼气厂。\n他解释说需要一个充气圆顶，而不是一个实心钢罐，因为 CO 2 必须处于恒定压力下。 “如果你有一个密封的罐子，然后从里面取出气体，就可以降低压力。在圆顶中，几何形状适应我们内部的气体量并且压力保持恒定。这是该系统的一个关键特性。” Spadacini 补充道：“系统是完全封闭的。我们不消耗任何 CO 2，它只是来回流动的工作流体……在系统的使用寿命中，超过 25 年。所以我们在大气中没有排放。”意大利人解释说，CO 2 电池系统将是模块化的，并且可以扩展到所需的任何尺寸，因为可以添加任意数量的单个组件。 “我们希望建造多种标准尺寸——可以是 50MWh、100MWh、200MWh，”他说。 “所以我们为液态 CO 2 容器制定了标准设计，您可以只使用其中的 10、20 或 50 个，但生产是模块化的。另一方面，我们有 10MW 或 25MW 的压缩机，我们有 10MW 到 25MW 或 50MW 的膨胀涡轮机，“这意味着业主可以根据他们的应用使用最合适的充放电速率来优化设计。至于穹顶，根据 MWh 的存储容量，穹顶会更大或更小，或者可以建造多个穹顶，容量超过 200MWh。”\nSpadacini 将公司的“最佳点”描述为八到十个小时的存储时间，因为这是风能和太阳能发电厂的“最佳匹配”，以使它们能够每天 24 小时提供可调度的输出。该系统还可以更集中地用于电力网络，以存储可再生能源并为电网提供辅助服务，”他补充道。迄今为止，这家成立 18 个月的公司只为该系统的热能存储部分建造了一个小型试验工厂，但它今年正在意大利撒丁岛建设一座 2.5MW/4MWh 的商业示范设施，该项目将将于 2022 年 1 月或 2 月投入运营。“我们没有能力像市场要求的那样快速增长，”他说。 “因此，我们的模式是将技术许可给 EPC 公司或 IPP、公用事业公司、最终用户，因为这是我们在地域和部门进行扩张的最佳方式。 Energy Dome 已经与意大利以天然气为重点的发电设备供应商 Ansaldo Energia 签署了商业协议，将 CO2 电池以及姊妹系统 CO 2 ETCC（见下图）推向市场。 “我们还在与石油和天然气行业、钢铁行业、绿色化学行业以及采矿行业的其他大型原始设备制造商讨论其他商业协议和许可。所以我们很感兴趣。 Energy Dome 目前正试图在 A 轮投资中筹集 1000 万欧元，为此它已经与机构投资者和风险投资公司进行了谈判。 Spadacini 解释说，这笔钱将用于完成商业示范工厂并支付公司支出。\n“我们认为公司的潜在增长非常高，有两个原因——因为我们的业绩和成本非常有竞争力，”他说。 Energy Dome 设计了一个独立但类似的系统，称为 CO2 能源转换联合循环 (ETCC)，该系统将燃气发电与大规模长期储能相结合。 “[这个]独特的系统......达到了前所未有的天然气发电效率，同时以非常灵活的方式运行，能够在几秒钟内从吸收和存储来自电网的能量切换到全功率生产，”说能量圆顶。该公司解释说，ETCC 系统将有效地将联合循环燃气轮机发电厂的效率从 55% 提高到 85%，并将每存储 kWh 能量的燃料成本降低 35-40%。分享: 电子邮件 意大利初创公司 Energy Dome 表示，其新的长期“二氧化碳电池”系统仅使用现成的设备，将在未来几年内实现 50-60 美元/MWh 的平准化存储成本 (LCOS)年。这将是锂离子电池 LCOS 的两倍多——132-245 美元/MWh，... https://www.rechargenews.com/energy-transition/new-co2-battery-will-make-风能和太阳能可调度的空前低价/2-1-1044755", "note_en": "Italian start-up Energy Dome says that its new long-duration “CO 2 battery” system, which only uses off-the-shelf equipment will achieve a levelised cost of storage (LCOS) of $50-60/MWh in the next few years.\n  That would be more than twice as low as the LCOS of lithium-ion batteries — $132-245/MWh, according to Lazard — and almost twice as cheap as current long-duration storage market leader Highview Power’s CRYObattery ($100/MWh,  according to a 2019 interview with  Recharge).\n        Chief executive Claudio Spadacini tells  Recharge that Energy Dome&#39;s thermodynamic liquid-CO2 system has a round-trip efficiency of 75-80% — higher than any other long-duration energy storage technology currently on the market, including liquid-air, compressed-air and gravity-based solutions.\n  “We have calculated an LCOS which is already below $100/MWh with the first commercial plant we are going to build, which is 25MW/200MWh — our standard module,” says Spadacini.\n  “But we have a projection that we can reduce the cost of the technology quite fast. So we are aiming to be far below $60/MWh in a few years, close to $50/MWh.”\n  But in an increasingly competitive, fast-moving sector, Energy Dome&#39;s technology might not be the cheapest energy storage on the market once it is commercialised.\n  Highview aims to hit $50/MWh by 2030, while US-based  Echogen is promising an LCOS of $50-60/MWh from its supercritical CO 2-based system.\n    And only last week, US start-up  Form Energy claimed that its 100-hour iron-air battery would achieve an LCOS of less than one-tenth the cost of lithium-ion — but it has not said when, and its technology is yet to be proven outside of a laboratory.\n    The CO 2 battery utilises aspects of thermal energy storage, which stores electricity as heat, and compressed-air and liquid-air systems, which reduces the volume of air (by compressing/condensing it) and then generates electricity by allowing it to rapidly expand to its natural state, with the whoosh from that expansion driving a power-generating turbine.\n  In Energy Dome’s system, carbon dioxide is compressed at a pressure of 60 bar which heats the gas to 300°C liquid. The heat is then extracted and stored in “bricks” made of steel shot and quartzite for later use, cooling down the CO 2 to an ambient temperature. The gas is then condensed into liquid form and stored in carbon-steel tanks.\n        When electricity is required, the liquid CO 2 is run through an evaporator to turn it back to a pressurised gas, which is then warmed up back to 290-300°C causing the stored heat. The gas is then introduced into an expansion turbine, where it rapidly expands at atmospheric pressure to drive a power-generating rotor, with the uncompressed CO 2 then stored in a flexible dome — hence the company name — at ambient temperature and pressure for later re-use.\n  Spadacini explains that Energy Dome uses CO 2 because it can be converted into liquid under pressure at 30°C, compared to minus 150°C for air. Highview Power’s liquid-air battery therefore has to use cryogenic technology to liquefy air, but the Energy Dome system requires far less power, resulting in cheaper costs and a higher round-trip efficiency, the company says.\n  “This idea… is fully new and fully innovative, but really based on off-the-shelf components,” says Spadacini. “So we just put together existing components and this is key in order to go to the market.”\n  It does mean that rather than using the surrounding air, a large inflatable gas holder — ie, the dome — is needed to store the CO 2 in a closed system. But this is a low-cost component, requiring little more than a strong but flexible PVC-coated textile, which is already manufactured for use in biogas plants.\n  He explains that an inflatable dome is required, rather than a solid steel tank, because the CO 2 has to be at a constant pressure.\n  “If you have a sealed tank and you take gas out of that, you reduce the pressure. In the dome, the geometry adapts to the amount of gas we have inside and the pressure remains constant. This is a key feature of the system.”\n  Spadacini adds: “The system is totally closed. We don’t consume any CO 2, it’s just the working fluid that goes back and forth… for the life of the system, over 25 years. So we have no emissions in the atmosphere.”\n    The Italian explains that the CO 2 battery system will be modular and scalable to any size required, as any number of individual components can be added.\n        “We are looking to build multiples of standard sizes — that can be 50MWh, 100MWh, 200MWh,” he says.\n  “So we have a standard design for the liquid CO 2 vessel, and you can just use 10, 20 or 50 of those, but production is modularised. And on the other side, that we have 10MW or 25MW compressors, and we have 10MW to 25MW or a 50MW expansion turbine\n  “This means that owners can optimize the design by using the most appropriate charge or discharge rate, depending on their application. As to the dome, depending on the MWh storage capacity, the dome will be larger or smaller, or multiple domes can be built for capacities in excess of 200MWh.”\n  Spadacini describes the company’s “sweet spot” as eight to ten hours of storage, as that is the “best match” for wind and solar farms, in order to enable them to have dispatchable output 24 hours a day.\n  The system could also be used more centrally on the electricity network to store renewable energy and provide ancillary services to the grid,” he adds.\n  To date, the 18-month-old company has only built a small pilot plant for the thermal energy storage part of the system, but it is constructing a 2.5MW/4MWh commercial demonstration facility on the Italian island of Sardinia this year, which will be put into operation in January or February 2022.\n      “We don’t have the capability to grow as fast as the market requires,” he says. “So our model is to license the technology to EPC companies or IPPs, utilities, the final user, because that is the best way for us to expand geographically and by sector.\n       Energy Dome has already signed a commercial agreement with Italian gas-focused power-generation equipment supplier Ansaldo Energia to bring to market the CO2 battery — as well as a sister system, the CO 2 ETCC ( see panel below).\n  “We are also discussing other commercial agreements and licensing with other large OEMs in the oil &amp; gas sector, in the steel sector, in the green chemistry sector, and also in the mining sector. So we are getting a lot of interest.\n      Energy Dome is currently attempting to raise €10m in a Series A investment round, for which it is already in talks with institutional investors and venture capital firms. The money would be used to which would be used to complete the commercial demonstration plant and cover company outgoings, Spadacini explains.\n  “We believe that the potential growth of the company is really high, for two reasons — because we have very competitive performances and costs,” he says.\n  Energy Dome has devised a separate, but similar system that it calls the CO2 Energy Transition Combined Cycle (ETCC), which combines gas-fired power production with large-scale long-duration energy storage.\n &#34;[This] unique system... reaches unprecedented gas to power efficiency and at the same time operating in a very flexible way being able to switch from absorbing and storing energy from the grid to full power production in a matter of seconds,&#34; says Energy Dome.\n The company explains that the ETCC system would, effectively, increase the efficiency of combined-cycle gas turbine plants from 55% to 85%, and reduce fuel costs on each stored kWh of energy by 35-40%.\n    Share:     Email   Italian start-up Energy Dome says that its new long-duration “CO2 battery”system, which only uses off-the-shelf equipment will achieve a levelised cost ofstorage (LCOS) of $50-60/MWh in the next few years. That would be more than twice as low as the LCOS of lithium-ion batteries —$132-245/MWh,...\n   https://www.rechargenews.com/energy-transition/new-co2-battery-will-make-wind-and-solar-dispatchable-at-an-unprecedented-low-price/2-1-1044755", "posttime": "2021-08-01 19:57:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电池,battery", "title": "二氧化碳电池将使风能和太阳能以前所未有的低价进行调度", "title_en": "CO2 battery will make wind and solar dispatchable at an unprecedented low price", "transed": 1, "url": "https://www.rechargenews.com/energy-transition/new-co2-battery-will-make-wind-and-solar-dispatchable-at-an-unprecedented-low-price/2-1-1044755", "via": "", "real_tags": ["电池", "battery"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070985, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1a 1b 1c 1d 1e 1f 1g 1h 1i 1j 1k 1l 1m 1n 2o 2p 3q 4r 6s 8t 11u 15v 22w 31x 44y 63z 创建的域是为了达到最大数量的（指数）（允许）（指数）字符（指数）字母表的长度。使用的公式是“1 + 62 * (10/7)^(x-26)”。为了帮助说明这条曲线，请参考此电子表格上的分布。它是多彩的，因为我喜欢颜色并且想在 CSS3 中做一个渐进的“彩虹”动画。 seq 26 | awk &#39;BEGIN { printf &quot;&lt;h1&gt;&quot; }; { printf &quot;&lt;i&gt;&quot;; n = int(1 + 62 * (10/7)^($1-26)); c = sprintf(&quot;%c&quot;,0x61 + $1-1); printf nc; printf &quot;&lt;/i&gt; &quot;; }; END { printf &quot;&lt;/h1&gt;&quot;; }&#39; seq 26 | awk &#39;BEGIN { printf &quot;http://&quot; }; { n = int(1 + 62 * (10/7)^($1-26)); c = sprintf(&quot;%c&quot;,0x61 + $1-1); for(i=1;i&lt;=n;i++) printf c; printf &quot;.&quot;; }; END { printf &quot;我\\n&quot;; }&#39;", "note_en": "1a  1b  1c  1d  1e  1f  1g  1h  1i  1j  1k  1l  1m  1n  2o  2p  3q  4r  6s  8t  11u  15v  22w  31x  44y  63z\n     The domain is created to reach the maximum number of allowed characters (255 (really  253)) with an exponential curve in the length of the letters as you proceed through the alphabet. The formula used is &#34;1 + 62 * (10/7)^(x-26)&#34;. To help illustrate this curve, reference the distribution on this  spreadsheet. It&#39;s colorful because I like colors and wanted to do a progressive &#34;rainbow&#34; animation in CSS3.\n        seq 26 | awk &#39;BEGIN { printf &#34;&lt;h1&gt;&#34; }; { printf &#34;&lt;i&gt;&#34;; n = int(1 + 62 * (10/7)^($1-26)); c = sprintf(&#34;%c&#34;,0x61 + $1-1); printf n c; printf &#34;&lt;/i&gt; &#34;; }; END { printf &#34;&lt;/h1&gt;&#34;; }&#39;    seq 26 | awk &#39;BEGIN { printf &#34;http://&#34; }; { n = int(1 + 62 * (10/7)^($1-26)); c = sprintf(&#34;%c&#34;,0x61 + $1-1); for(i=1;i&lt;=n;i++) printf c; printf &#34;.&#34;; }; END { printf &#34;me\\n&#34;; }&#39;", "posttime": "2021-08-01 19:57:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,可能,longest,指数", "title": "最长可能的域名", "title_en": "Longest Possible Domain Name", "transed": 1, "url": "http://a.b.c.d.e.f.g.h.i.j.k.l.m.n.oo.pp.qqq.rrrr.ssssss.tttttttt.uuuuuuuuuuu.vvvvvvvvvvvvvvv.wwwwwwwwwwwwwwwwwwwwww.xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx.yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy.zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz.me", "via": "", "real_tags": ["域名", "可能", "longest", "指数"]}, {"category": "", "categoryclass": "", "imagename": "bcac8b8fea4c6fb4ea0d071948b3cf31.png", "infoid": 1070984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“当我看到一扇带有推动标志的门时，我会先拉动以避免冲突” - 匿名对于那些使用 git 一段时间的人来说，你很少会发现关于它的新事物。也就是说，如果您排除我们大多数人可能不知道的管道命令，并且很可能会更好。令我惊讶的是，我最近在高级命令列表中发现了大约 2 个新增内容： 要了解它们为什么会出现，让我们首先访问我们的老朋友 git checkout。 git checkout 是新手觉得 git 令人困惑的众多原因之一。那是因为它的效果是依赖于上下文的。大多数人使用它的方式是切换本地仓库中的活动分支。更确切地说，切换 HEAD 指向的分支。例如，如果你在主分支上，你可以切换到开发分支：你也可以让你的 HEAD 指针引用一个特定的提交而不是一个分支（达到所谓的分离的 HEAD 状态）：事情变得棘手的地方在于如果您提供一个文件作为参数而不是分支或提交，它将放弃您对该文件的本地更改并将其恢复到分支状态。例如，如果您签出开发分支并对 test.txt 文件进行了一些更改，那么您可以将文件恢复为分支的最新提交：如果您首先查看这两种行为，您可能会认为它没有任何意义，为什么一个命令执行 2 个不同的操作？嗯，事情比这要微妙一些。如果我们查看 git 文档，我们可以看到该命令有一个通常被省略的额外参数：\n什么是 &lt;tree-ish&gt; ？它可以表示很多不同的东西，但最常见的是表示提交哈希或分支名称。默认情况下，它被视为当前分支，但它可以是任何其他分支或提交。因此，例如，如果我们在开发分支中并且想要将您的 test.txt 文件更改为来自主分支的版本，您可以这样做：考虑到这一点，也许事情开始变得有意义了。当您只提供一个分支或提交作为 git checkout 的参数时，它会将您的所有文件更改为相应修订版中的版本，但是如果您还指定了文件名，它只会更改该文件的状态以匹配指定的修订版。因此，即使在阅读前几段之后事情可能开始变得有意义，我们必须承认它仍然令人困惑，尤其是对于新手而言。这就是为什么在 git 2.23 版本中，引入了两个新命令来替换旧的 git checkout（git checkout 仍然可用，但 git 新手最好从这些命令开始）。如您所料，它们基本上都实现了前面描述的两种行为之一，将 git checkout 一分为二。这个实现了 git checkout 仅针对分支名称运行时的行为。因此，您可以使用它在分支或提交之间切换。虽然使用 git checkout 您可以切换到提交并转换为分离的 HEAD 状态，但默认情况下 git switch 不允许这样做。您需要提供 -d 标志：另一个区别是，使用 git checkout，您可以使用 -b 标志在一个命令中创建并切换到新分支： git checkout -b new_branch 您可以对新分支执行相同操作，但是标志是 -c: git switch -c new_branch\n这个实现了 git 在针对文件运行时的行为。顾名思义，您可以将文件的状态恢复到指定的 git 修订版（默认情况下为当前分支）这些方法仍标记为实验性的，但出于所有意图和目的，它们将保留，因此我无论如何都鼓励每个人都开始使用它们，因为它们可能会在您的脑海中变得更有意义，并且它也会让 git 对新用户来说不那么令人困惑。", "note_en": "&#34;When I see a door with a push sign, I pull first to avoid conflicts&#34; - anonymous\n For those that work with git for some time, it is not often that you get to discover new things about it. That is if you exclude the plumbing commands which probably most of us don&#39;t know by heart and most likely that&#39;s for the better. To my surprise, I recently found out about 2 new additions to the list of high-level commands:\n  To understand why they came to be, let&#39;s first visit our old friend  git checkout.\n   git checkout is one of the many reasons why newcomers find git confusing. And that is because its effect is context-dependent. The way most people use it is to switch the active branch in their local repo. More exactly, to switch the branch to which HEAD points. For example, you can switch to the  develop branch if you are on the  main branch:\n  You can also make your HEAD pointer reference a specific commit instead of a branch(reaching the so-called detached HEAD state):\n  Where things get tricky is that if you provide a file as an argument instead of a branch or commit, it will discard your local changes to that file and restore it to the branch state. For example, if you checked out the develop branch and you made some changes to the test.txt file, then you can restore the file as it is in the latest commit of your branch with:\n   If you first look at these two behaviors you might think that it doesn&#39;t make any sense, why have one command do 2 different actions? Well, things are a little more subtle than that. If we look at the  git documentation, we can see that the command has an extra argument that is usually omitted:\n  What is  &lt;tree-ish&gt; ? It can mean a lot of different things, but most commonly it means a commit hash or a branch name. By default that is taken to be the current branch, but it can be any other branch or commit. So for example if we are in the  develop branch and want to change your test.txt file to be the version from the main branch you can do it like this:\n  With this in mind, maybe things start to make sense. When you provide just a branch or commit as an argument for  git checkout, then it will change all your files to their version in the corresponding revision, but if you also specify a filename, it will only change the state of that file to match the specified revision.\n   So even if things may start to make sense after reading the previous paragraphs, we must admit that it is still confusing especially for newcomers. That&#39;s why in version  2.23 of git, two new commands have been introduced to replace the old git checkout( git checkout is still available, but people new to git should start with these ones preferably). As you would expect, they basically each implement one of the two behaviors described previously, splitting  git checkout in two.\n  This one implements the behavior of git checkout when running it only against a branch name. So you can use it to switch between branches or commits.\n  While with  git checkout you can switch to a commit and transition into a detached HEAD state, by default git switch does not allow that. You need to provide the -d flag:\n  Another difference is that with git checkout you can create and switch to the new branch in one command using the -b flag:  git checkout -b new_branch\n You can do the same with the new one, but the flag is -c:  git switch -c new_branch\n  This one implements the behavior of git when running it against a file. You can restore, as the name suggests, the state of a file to a specified git revision(the current branch by default)\n   These methods are still marked experimental, but for all intents and purposes they are here to stay so by all means I encourage everyone to start using them since they will probably make a lot more sense in your head and also it will make git just a little bit less confusing to new users.", "posttime": "2021-08-01 18:55:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "切换,switch,分支", "title": "Git 新功能：切换和恢复", "title_en": "New in Git: Switch and Restore", "transed": 1, "url": "https://www.banterly.net/2021/07/31/new-in-git-switch-and-restore/", "via": "", "real_tags": ["切换", "switch", "分支"]}]