[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项对数万篇文章的分析显示，与付费文章相比，来自低收入地区的开放获取论文的主要作者要少得多。研究结果表明，期刊公开发表文章所收取的费用对中低收入国家的作者构成了障碍——科学家此前曾怀疑这一点，但发现很难证明这一点。\n越来越多的学术期刊——包括《自然》杂志——一直在开放获取它们的文章，部分原因是资助者的要求（《自然》的新闻团队在编辑上独立于其出版商Springer Nature）。尽管这一转变使学术文献更容易获取，但许多研究人员指出，发表研究开放获取通常需要的文章处理费（APC）可能会阻止作者使用这一选项。\n埃米利奥·布鲁纳说：“开放获取的一大讽刺是，你让世界各地的作者最终能够阅读对他们完全封闭的科学文献，但最终却将他们排除在同一期刊上发表。”，盖恩斯维尔佛罗里达大学的拉丁美洲研究生态学家和学者。\n布鲁纳说，尽管科学界的许多人认识到这一点，但从经验上证明这一点是一个挑战。一个问题是，很难直接比较开放存取期刊和非开放存取期刊，因为即使来自同一出版商的期刊也可能在声誉和接受标准等因素上存在差异。\n荷兰出版商爱思唯尔（Elsevier）的“镜像期刊”（mirror journals）试点项目从2018年持续到2020年，为布鲁纳的团队提供了一个机会。根据这一计划，现有的混合期刊被称为镜像期刊，这些期刊既包含付费文章，也包含可自由访问的文章、共享标题以及编辑和同行评审过程，具有完全开放的访问版本。布鲁纳说：“这是你能做的最接近自然实验的地方。”。\n他的团队研究了38对《镜报》和《家长》期刊上发表的37000多篇文章，这些期刊大多发表付费内容。研究人员确定了每篇论文的第一作者的地理位置，然后查阅了该国的世界银行收入类别，以及该作者是否有资格根据爱思唯尔针对特定国家作者的Research 4Life计划获得全部或部分APC豁免。镜像日志的APC成本中位数为2600美元；大多数混合期刊的APC与镜像期刊的APC相同。\n总的来说，《镜报》的主要作者来自北美、东亚和太平洋地区的文章比其相应母版的付费文章多。来自低收入地区，尤其是拉丁美洲和加勒比、中东和北非以及撒哈拉以南非洲等全球南方地区的主要作者较少。《镜报》杂志上大约80%的文章的第一作者来自高收入国家，没有一篇文章的第一作者来自低收入国家。\n“当我们看到这样的结果时，它就清楚地表明，当期刊收取APCs时，出版业有非常强大的资金障碍，”巴西拉夫拉斯联邦大学的生态学家Rafael Zenni说。“这是我们每天都要面对的事情。在我们的研究资助中，几乎没有任何资源来支付出版费。”\n该团队还发现，来自符合豁免计划的国家的作者几乎从未发表过开放获取文章。布鲁纳对弃权书的无效性感到惊讶。当使用豁免时，即使大幅度的折扣也不能充分降低来自低收入地区的作者的成本，他们通常从自己的口袋里支付APC。\n“众所周知，APC会毫无手段地阻止作者，但这种量化这些作者的经济障碍的特殊方法是新的，我认为它应该是有说服力的，”马萨诸塞州剑桥哈佛大学学术交流办公室主任彼得·苏伯说。“APC扭曲了研究，他们排斥作者，我们都应该设法克服这些障碍，”苏伯说。", "note_en": "Open-access papers have drastically fewer lead authors from low-income regions than do paywalled articles, an analysis of tens of thousands of articles shows. The findings suggest that the fees that journals charge to publish articles open access pose a barrier for authors in low- and middle-income countries — something that scientists had previously suspected but found difficult to demonstrate.\n Increasing numbers of scholarly journals — including  Nature — have been making their articles open access, driven in part by requirements from funders ( Nature’s news team is editorially independent of its publisher Springer Nature). Although this shift has been making the scholarly literature more widely accessible, many researchers have noted that the article-processing charges (APCs) typically required to publish research open access can deter authors from using this option.\n “One of the great ironies of open access is that you grant authors around the world the ability to finally read the scientific literature that was completely closed off to them, but it ends up excluding them from publishing in the same journals,” says Emilio Bruna, an ecologist and scholar of Latin American studies at the University of Florida in Gainesville.\n Although many in the scientific community recognize this, it’s been a challenge to demonstrate it empirically, says Bruna. One problem is the difficulty of directly comparing open-access and non-open-access journals, because even those from the same publisher might differ in factors such as reputation and standards of acceptance.\n The Dutch publisher Elsevier’s ‘mirror journals’ pilot project, which ran from 2018 to 2020, offered Bruna’s team an opportunity. Under this programme, existing hybrid journals, which contain both paywalled and freely accessible articles, shared titles and editorial and peer-review processes with fully open-access versions, termed mirror journals. “It’s as close as you can get to a natural experiment,” Bruna says.\n His group examined more than 37,000 articles published in 38 pairs of mirror and ‘parent’ journals, which mostly published paywalled content. The researchers identified the geographical location of each paper’s first author, then looked up the country’s World Bank income category and whether the author qualified for a full or partial APC waiver under Elsevier’s Research4Life programme for authors from certain countries. The APCs for the mirror journals cost a median of US$2,600; most of the hybrid journals had APCs identical to those of their mirror journals.\n  Overall, mirror journals had more articles with lead authors from North America, East Asia and the Pacific region than did paywalled articles in their corresponding parent versions. They had fewer lead authors from lower-income areas, in particular those in the global south, such as Latin America and the Caribbean, the Middle East and North Africa, and sub-Saharan Africa. Around 80% of articles in mirror journals had first authors from high-income countries, and none had first authors from low-income countries.\n “When we see results like this, it just makes it crystal clear that there is a very strong financial barrier for publishing when journals charge APCs,” says Rafael Zenni, an ecologist at the Federal University of Lavras in Brazil. “It’s something that we face every day. In our research grants, there are rarely any resources for publishing fees.”\n The team also found that authors based in countries eligible for the waiver programme almost never published open-access articles. Bruna was surprised by how ineffective waivers seemed to be. And when waivers are used, even large discounts don’t reduce the cost enough for authors from lower-income regions, who often pay APCs out of their own pockets.\n “It’s widely known that APCs deter authors without means, but this particular method of quantifying the economic barrier to these authors is new and I think it should be persuasive,” says Peter Suber, director of the Harvard Office for Scholarly Communication in Cambridge, Massachusetts. “APCs distort research they exclude authors, and we should all be trying to find ways to overcome those barriers,” says Suber.", "posttime": "2022-02-22 00:54:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,access,作者", "title": "开放获取出版费用让全球南方的研究人员望而却步", "title_en": "Open-access publishing fees deter researchers in the global south", "transed": 1, "url": "https://www.nature.com/articles/d41586-022-00342-w", "via": "", "real_tags": ["人员", "access", "作者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对图像进行处理和增强似乎是当前数字时代所特有的。Kattendijke编年史是15世纪晚期来自低地国家的手稿，包含了模拟图像编辑的迷人例子。\n乍一看，船上一群人的形象可能是一幅直接的木刻画，被粘贴到手稿中（图1）。自15世纪下半叶以来，单叶版画——木刻和版画——在手写书籍中的使用频率更高（见Rudy 2019），这个例子似乎并不特别。然而，仔细观察就会发现，有几个迹象表明，这张照片的内容远远超出了人们的想象。画面中有些倾斜的线条，以及船与陆地之间的水在表现方式上的不一致，都指向了对图像的模拟操作。在进一步检查这些编辑并研究它们对中世纪晚期图像设计的相关性和意义之前，先对手稿进行简要介绍。\n所谓的《卡滕迪基纪事》的名字来源于17世纪的所有者、卡滕迪基的约翰·惠森（1566-1634）。在20世纪90年代，他的后代将手稿提供给了一个小型研究团队，该团队在2005年推出了一个版本，其中有一个深入的介绍，侧重于文本、纹章和密码学方面，并探索了编年史作者的概况（Janse等人，2005年）。后者在荷兰工作（可能是哈勒姆？）1491年或之后不久完成了这本书。Van Anrooij、Biemans和Janse将他视为整个手稿背后的策划人，并将他描述为一个非专业人士（即，不是专业知识分子）和一个有才华的收受赌注者。如今，该手稿保存在海牙皇家图书馆，并以高质量的数字格式在线提供（https://www.kb.nl/kattendijkekroniek).\n该文本汇编了至少六份15世纪的资料，主要是以手稿和印刷品形式流传的编年史。其中包括1480年由简·维登纳在乌得勒支印刷的《时间分册》的荷兰语译本、1478年由杰拉德·列夫出版的所谓的《古兹·克朗涅耶》或《小古达纪事》（Historie van Hollant、van Zeelat ende Vriesland ende van den sticht van Utrecht）和拉乌尔·勒斐夫的两部历史小说，雅各布·贝拉特在哈勒姆出版（1484-1485）。大部分编年史都是安森·詹斯所描述的复杂文本编纂方法的结果。有时，作者同时使用多个来源，并将它们交织成一个“新”文本，在其他情况下，他从现有文本中提取大量段落，并将其用作构建新叙事的基石。在文本附带的图像中可以观察到类似的编译模式。\n最初，该法典包含不少于144幅图像。尽管其中许多已经不复存在——虔诚的路易的图像是说明性的（图2）——但这些图像仍然完好无损，有助于揭示编辑过程。所有图像都可以被视为“混合媒体图像”：它们由木刻和/或雕刻组成，通过绘画元素和色彩增强。直到现在，人们才注意到《卡滕迪克纪事》中使用的版画。我希望在即将发表的一篇文章中讨论手稿中采用的各种编辑策略，这篇文章基于我去年10月在“1400-1700年早期现代欧洲定制书籍”（亚特兰大埃默里大学）会议上发表的一篇论文。在这里，我将探索一个简单的例子，它完美地展示了一个新的构图是如何从各种来源的木刻元素中创造出来的。\n这张照片描绘了一艘船在海上与流亡的阿尔比娜女王和她的姐妹们在一起。据传说，她们最终将在阿尔比昂（现在的英国）落脚。这张照片是由四种不同的木刻版画编辑而成。该船和该公司的一个主要部分来自一幅基督布道木刻画，背景是撒种人的寓言，最初是为1487年版的《基督的生活》（Boeck vanden leven Ihesu Christi）设计和切割的，由杰拉德·利乌（Gerard Leeu）在安特卫普印刷（Kok 2013，第85.27号；Janse等人，2005年）。基督和他的使徒们不得不为最初占据海岸的人群让位（图3）。\n为了让船更拥挤（毕竟阿尔比娜有三十个姐妹），从《玛丽和约瑟夫的婚姻》的木刻版画上取下了两个女性头像，这是杰拉德·利厄在他的许多宗教版本中使用的一个重要木刻系列（Kok 2013，第74.7号；Dlabacova 2017）（图4）。\n还有一个妹妹的空间，她被从一幅木刻画中抬了出来，木刻画描绘了“圣婴在庙里的展示”（图5），最初是为1488年的代尔夫特版《博克·范登·列文·伊赫苏·克里斯蒂》（Boeck vanden leven Ihesu Christi，Kok 2013，no.37.9）创作的。\n“新”海岸是从一幅木刻画上升起的，该木刻画用荷兰语描绘了第一次十字军东征的领袖布伊隆的戈弗雷（Godfrey of Bouillon）的故事（Kok 2013，no.187.10）。最后，木刻之间的附加波浪被手工绘制，新图像被着色（图6）。\n我为Leiden Medievalist博客写的第一篇博文（https://www.leidenmedievalistsblog.nl/articles/whos-that-guy-identity-crisis-in-a-fifteenth-century-woodcut)聚焦于“基督布道和人群中一名女性提高声音”的木刻图像（Kok 2013，第85.37号）。这张照片一直让我着迷，尤其是因为在房间右下角，有一个人似乎与基督的目光相遇。他就是那个在版画和木刻画中广泛出现的耶稣降生场景中代表约瑟夫的人物（图7）。了解了《卡滕迪克纪事》中使用的技术，我现在可以想象这位木刻设计师在他的一堆图像中有雕刻，并在寻找填充基督周围房间的人物。一旦了解了编辑技巧，你也开始注意到木刻图像中的其他人物有一个奇怪的位置，或者看起来有些飘浮。在这幅木刻画中，基督右边的人物，例如，盘旋在约瑟夫身上，似乎是一位来自崇拜场景的“重新语境化”牧羊人，尽管我无法识别他。\n通过对《卡滕迪克纪事》中混合媒体形象的研究，可以更好地了解木刻设计师所采用的策略。对这一高度物理过程的了解可以促进一种新的观看和欣赏木刻图像的方式。它让我们能够注意到木刻画的不同方面，比如在各种荷兰木刻系列中反复出现的人物。我们常常倾向于把剪贴图片作为孩子们的游戏。我们在阿尔比娜和她的姐妹们的形象中遇到的“图像编辑”或“图像合成”技术，一定是中世纪晚期书籍设计的重要组成部分，主要是在为特定文本设计图像时。Kattendijke编年史是独一无二的，因为它几乎可以让我们看到模拟图像编辑的过程，以及一部新作品的编辑过程发生在我们眼前。它展示了图像如何传播并最终以新的构图结束，以及约瑟夫如何从耶稣降生的场景转移到聆听他成年的儿子布道。\nA.Dlabačová，《宗教实践和实验性书籍制作》。文本和图像的另一种外行形式&#39；s&34；小时书&#34；在《印刷与手稿》中，《荷兰艺术史学家杂志》第9期（2）（2017年夏季）DOI:10.5092/jhna。2017.9.2.2\nB.埃伯斯·霍温，《卡滕代克》，伊恩·戈德·维尔帕克特惊喜》，摘自：荷兰格斯基耶德尼的《梅德德林根森林公园》，122（2007）1-14页。\nA.Janse、W.van Anrooij、J.A.A.M.Biemans、I.Biesheuvel、C.M.Riderikhoff和K.Tilmans、约翰·霍森·范·卡滕迪克·克罗涅克。《克洛尼克·范·霍兰特的历史》，范·泽兰特·范·弗里斯兰特·范·登·斯蒂切特·范·乌得勒支（den Haag:Instituteut voor Nederlandse Geschiedenis，2005）。\nI.科克，印在低地国家的Incunabula木刻版画，4卷。（Houten:HES&De Graaf，2013年）。\nK.M.鲁迪，图像，刀和胶锅。手稿和印刷品的早期组合（牛津：开放图书出版社，2019年）。\n©Anna Dlabačováand Leiden Medievalists博客，2022年。未经本网站作者和/或所有者的明确书面许可，严禁擅自使用和/或复制本材料。可以使用摘录和链接，前提是安娜·德拉巴乔娃（Anna Dlabačová）和莱登医学专家（Leiden Medievalists）的博客对原始内容有适当和具体的指导。", "note_en": "Manipulating and enhancing images may seem something that is particular to the current digital age. The Kattendijke Chronicle, a late fifteenth-century manuscript from the Low Countries, contains fascinating examples of analogue image editing.\n  At first sight, the image of a group of people in a boat might appear to be a straightforward woodcut that was pasted into a manuscript (fig. 1). Since single leaf prints – woodcuts and engravings – were used more often in handwritten books from the second half of the fifteenth century (see e.g., Rudy 2019), this example might not seem particularly special. A closer look, however, reveals several indications that there is much more to this image than meets the eye. The somewhat slant lines that frame the image and the inconsistency in the way the water between the ship and the strip of land is represented, point to analogue manipulation of the image. Before examining these edits further and looking into their relevance and meaning for the design of late medieval images, a brief introduction of the manuscript is in place.\n  The so-called  Kattendijke Chronicle derives its name from its seventeenth-century owner, Johan Huyssen of Kattendijke (1566-1634). In the 1990s his descendants made the manuscript available to a small team of researchers, which in 2005 resulted in an edition with an in-depth introduction that focused on textual, heraldic and codicological aspects, and explored the profile of the author of the  Chronicle (Janse et al. 2005). The latter worked in Holland (possibly Haarlem?) and completed the book in or shortly after 1491. Van Anrooij, Biemans, and Janse regard him as the mastermind behind the whole manuscript and characterize him as a lay man (i.e., not a professional intellectual) and a talented bookmaker. Nowadays the manuscript is kept at the Royal Library in The Hague and is available online in a high-quality digital format ( https://www.kb.nl/kattendijkekroniek).\n The text is a compilation of at least six fifteenth-century sources, mainly chronicles that circulated in both manuscript and print. They include the Dutch translation of the  Fasciculus temporum printed in 1480 by Jan Veldener at Utrecht, the so-called ‘Gouds kroniekje’ or ‘Little Gouda chronicle’ ( Chronike of Historie van Hollant, van Zeelant ende Vriesland ende van den sticht van Utrecht), published by Gerard Leeu in 1478, and two historical novels by Raoul Lefèvre, published by Jacob Bellaert at Haarlem (1484-1485). Most of the  Chronicleis the result of intricate methods of textual compilation that have been described by Antheun Janse. At times the author uses multiple sources simultaneously and interweaves them into a ‘new’ text, in other instances he takes substantial passages from existing texts which he uses as building blocks to create a new narrative. Similar patterns of compilation can be observed in the images that accompany the text.\n      Originally, the codex contained no less than 144 images. Even though many of them are no longer in place – the image of Louis the Pious is illustrative (fig. 2) – the images are still intact can help reveal the editing process. All images can be considered ‘mixed media images’: they are made up of woodcuts and/or engravings, enhanced through painted elements and coloring. The use of engravings in the  Kattendijke Chronicle has gone unnoticed until now. I hope to discuss the various editing strategies employed in the manuscript in an upcoming article based on a paper I presented last October during a conference on ‘Customized Books in Early Modern Europe, 1400-1700’ (Atlanta, Emory University). Here, I will explore a single example that beautifully shows how a new composition was creation out of elements of woodcuts from a variety of sources.\n  The image that portrays a ship at sea with the exiled Queen Albina and her sisters, who, according to legend would eventually end up in Albion (now Britain), is compiled out of prints from four different woodcuts. The ship and a major part of the company come from a woodcut of Christ preaching with the parable of the sower in the background, originally designed and cut for the 1487 edition of the  Book on the Life of Christ ( Boeck vanden leven Ihesu Christi), printed by Gerard Leeu at Antwerp (Kok 2013, no. 85.27; Janse et al. 2005). Christ and his apostles had to make place for the crowd that originally occupied the shore (fig. 3).\n    To make the ship more crowded (Albina, after all, had thirty sisters), two female heads were lifted from a woodcut of the ‘Marriage of Mary and Joseph’ that belonged to an important woodcut-series that Gerard Leeu used in many of his devotional editions (Kok 2013, no. 74.7; Dlabacova 2017) (fig. 4).\n    There was space for one more sister, and she was lifted from a woodcut portraying the ‘Presentation of the Christ Child at the Temple’ (fig. 5), originally created for the 1488 Delft edition of the  Boeck vanden leven Ihesu Christi (Kok 2013, no. 37.9).\n    The ‘new’ shore was lifted form a woodcut made to illustrate the story of Godfrey of Bouillon, leader of the First Crusade, in Dutch (Kok 2013, no. 187.10). Finally, the additional waves between the woodcuts were drawn in by hand and the new image was colored (fig. 6).\n     The very first blogpost I wrote for the Leiden Medievalist Blog ( https://www.leidenmedievalistsblog.nl/articles/whos-that-guy-identity-crisis-in-a-fifteenth-century-woodcut) focused on a woodcut image of ‘Christ preaching and a woman in the crowd raising her voice’ (Kok 2013, no. 85.37). This image has always fascinated me, particularly because of the figure that seems to meet Christ’s gaze, in the bottom right corner of the room. He is the same figure that represents Joseph in a Nativity scene that was widespread in engravings and woodcuts (fig. 7). Knowing the techniques used in the  Kattendijke Chronicle I can now imagine the woodcut designer had the engraving in his stack of images and was looking for figures to fill the room around Christ. Once aware of the compilation techniques, you also start to notice that other figures in woodcut images have an odd position or seem to be somewhat floating. In the case of this woodcut, the figure to the right of Christ, for example, hovering over Joseph, seems to be a ‘re-contextualized’ shepherd from an Adoration scene, although I have not been able to identify him.\n    A study of the mixed media images in the  Kattendijke Chronicle leads to a better awareness of the strategies employed by woodcut designers. Knowledge of this highly  physical process can facilitate a new way of looking at and appreciating woodcut images. It allows us to notice different aspects of woodcuts, like reoccurring figures which can be encountered in various Netherlandish woodcut series. All too often we tend to set aside cutting out and pasting images as child’s play. The ‘image editing’ or ‘image compositing’ technique that we are confronted with in the image of Albina and her sisters, must have been quite an essential part of late medieval book design, principally when designing images for a particular text. The  Kattendijke Chronicle is unique because it almost allows us to see the process of analogue image editing and the compilation of a new composition take place before our eyes. It shows how images could travel and end up in a new composition, and how Joseph might have moved from the Nativity scene to listening to his grown son preach.\n  A. Dlabačová, ‘Religious Practice and Experimental Book Production. Text and Image in an Alternative Layman&#39;s &#34;Book of Hours&#34; in Print and Manuscript’,  Journal of Historians of Netherlandish Art 9(2) (Summer 2017) DOI: 10.5092/jhna.2017.9.2.2\n B. Ebels-Hoving, ‘‘Kattendyke’, een goed verpakte surprise’, in:  Bijdragen en Mededelingen betreffende de Geschiedenis der Nederlanden, 122 (2007) 1-14.\n A. Janse, W. van Anrooij, J.A.A.M. Biemans, I. Biesheuvel, C.M. Ridderikhoff and K. Tilmans,  Johan Huyssen van Kattendijke-kroniek. Die historie of die cronicke van Hollant, van Zeelant ende van Vrieslant ende van den Stichte van Utrecht (Den Haag: Instituut voor Nederlandse Geschiedenis, 2005).\n I. Kok,  Woodcuts in Incunabula printed in the Low Countries, 4 vols. (Houten: HES &amp; De Graaf, 2013).\n K.M. Rudy,  Image, Knife, and Gluepot. Early Assemblage in Manuscript and Print (Oxford: Open Book Publishers, 2019).\n © Anna Dlabačová and Leiden Medievalists Blog, 2022. Unauthorised use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Anna Dlabačová and Leiden Medievalists Blog with appropriate and specific direction to the original content.", "posttime": "2022-02-22 00:50:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "photoshop,中世纪,medieval,图像", "title": "中世纪的Photoshop", "title_en": "Medieval Photoshop", "transed": 1, "url": "https://leidenmedievalistsblog.nl/articles/medieval-photoshop", "via": "", "real_tags": ["photoshop", "中世纪", "medieval", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌已经向我们确认，Pixel 3系列已经收到最新更新，标志着三年承诺的结束。但重温2018年的旗舰产品，我仍然忍不住对谷歌没有更努力地让其支持更长时间感到失望。谷歌可能已经满足了其营销要求，但正如我之前所说，一家致力于可持续发展和客户安全的公司如此迅速地抛弃旧智能手机是虚伪的。回顾过去几天，Pixel 3仍然是一款非常好的手机，它的使用寿命可能还剩下几年。据大家说，我&#39；我说过，没有&#39；没有什么好的技术原因使它落后。谷歌只是没有&#39；我不在乎。\nPixel 3和3 XL可能不是谷歌最畅销的机型，购买一款也有一些缺点，比如3 XL的巨大浴缸凹槽和当时Android旗舰的有限内存。当时谷歌的质量保证（QA）比现在更糟糕，我实际上不得不更换购买的Pixel 3和Pixel 3 XL，以获得没有问题的设备——我的第一个Pixel 3显示屏下有一块奇怪的玻璃，我的第一个3 XL摄像头坏了。\n坦率地说，在2018年末和2019年初，Pixel 3并不是我手机的首选。我买它是为了工作，因为我知道它对于开发者预览、Beta和早期访问Android更新都很方便。但谷歌正处于OnePlus设备的黄金时代，比如OnePlus 6T和OnePlus 7 Pro，所以我口袋里通常不是一个像素——如果是的话，它可能不是唯一的。\n有趣的是，我不喜欢Pixel 3的屏幕，这是一款LG制造的OLED，对黑色的冲击非常严重，在室外时没有其他手机那么亮，在低亮度水平下不稳定，在不太黑的主题中可以看到令人讨厌的渐变。电池寿命从一开始对我来说也很糟糕，而且随着时间的推移，情况越来越糟。最重要的是，有限的4GB内存可能意味着应用程序被挤出内存的速度比预期的要快。\n不过也不全是坏事。Pixel 3有一个很棒的摄像头，一个快速的芯片组，我喜欢这个软件，谷歌的辅助功能，比如呼叫屏幕，值得在任何其他手机上每月订阅一次。但是，客观地说，Pixel 3的800美元的发布价格让它成为了一笔糟糕的交易。\n这一切现在和2018年一样真实，但这并不意味着手机可以回收利用。\n我很高兴看到玩老式手机取得了多大的进步——我们曾经在安卓警察局有一个专门的系列，在那里我承诺使用没有任何备份的古董，并为此承担后果。它为你提供了更好地衡量随时间变化的视角，以及深入挖掘的动机，因为你必须依赖它，即使从那时起用例、需求，甚至生活的简单方面都可能发生了变化。但回到像素3，我最震惊的是它的现代感。\n我刚才提到的所有这些问题仍然存在，电池寿命是一个特别令人沮丧的问题，但客户处理的问题比使用廉价手机要糟糕得多，像素3还有其他一些好处。首先，Snapdragon 845仍然是一款速度非常快的芯片组——在重启应用程序的频率比在其他设备上要高的情况下，这款手机永远不会感到速度慢。相机仍然很好，硬件几乎与像素5a中使用的主要射手相同。\n我确实需要离充电器更近一些，但我也被最近高端手机电池寿命的延长所宠坏了。它可能缺少5G支持，也没有超宽摄像头或高刷新率显示屏，但Pixel 3感觉不像是古董。即使是在今天，它也很时髦。\n通常，我们认为停止更新的手机太旧了，你也可以升级，但像素3不是这样的。它在发布时可能是一个糟糕的交易，但它并不是一款糟糕的手机，现在也不是。我可以很容易地看到，有人对它感到满意，并将其挂在像素3上再过一两年，但这并不是很明智。\n我们对Android提供的新功能感到兴奋，但大多数Android更新实际上是为了保护您的安全。每月的补丁通常不会带来大的新变化（比如谷歌的功能删除更新），但它们会修复从主要到次要的漏洞。事实上，Android每月发布的补丁只有一个漏洞：Stagefright。\n手机不再只是打电话了。我们把它们用于银行业、投资，甚至可以用它们来纳税。它们和我们家里的个人电脑一样都是通用电脑。你可能认为手机的安全性无关紧要，但你是否安装了银行应用程序？如果你无法访问谷歌、贝宝或Facebook账户，你的生活会有多糟？这是你的手机提供的访问权限，也是你开始使用未更新的手机时面临的风险。（实际上，我有几个单独的不安全测试帐户，专门用于使用旧手机。）\n对于仍在使用Pixel 3的客户——我应该强调的是，他们为自己的手机支付了800美元或更多——手机目前仍然和其他像素一样安全。诚然，最新的更新是针对比当前支持的其他像素更早的补丁级别，但我们仍然处在一个足够近的窗口中。但随着每个月的到来，它将进一步落后。当手机变得“不安全”时，并没有硬性规定，但随着软件的落后，这是一个逐步累积的过程。\n谷歌一度认为季度更新足以满足企业使用，尽管有些公司甚至懒得可靠地完成季度更新。然而，随着时间的流逝，问题只在于发现了哪些漏洞以及它们提供的漏洞有多强。\nPixels和其他最新的安卓设备确实有一个优势，它们提供主线和APEX模块，以独立于操作系统本身更新安卓系统的核心部分；谷歌可以通过这种方法以及Play服务推出很多补丁和安全补丁。我们已经联系了谷歌，确认Pixel 3用户在这方面的期望，如果我们得到回复，我们一定会更新。但2022年“落后”的手机比2017年停止更新的手机处于更好的位置。\n最终，过时的像素可能比大多数其他安卓手机更安全，但时钟仍在滴答作响。如果没有系统级补丁支持，一些漏洞就无法修复，导致客户越来越不安全。\n上周，我再次使用Pixel 3和3 XL，与现代旗舰相比，我更喜欢较小的3，我对“旧”手机的速度感到震惊。是的，它们问世时是一笔糟糕的交易，我们都应该非常感谢谷歌最终用新的Pixel 6了解到了一美元的价值。但Pixel 3比今天仍在发布的许多中端手机都要快。\n2018年是iPhone XS问世的一年，这款手机的价格比基本型号Pixel 3高200美元，比Pixel 3 XL高100美元，目前仍在更新中。事实上，上一次iOS更新包括2015年的iPhone 6s。我知道谷歌在发布时只承诺了三年的更新，但没有什么能阻止该公司自愿超过这个数字。\n高通公司已向我确认，它仍然能够为Snapdragon 845提供高通公司特定的软件更新，虽然从安卓13开始的芯片组的内核级支持将是一个问题，但安卓12下目前的情况还不错。在安卓13登陆之前，谷歌绝对可以为Pixel 3系列提供安全补丁。\n此外，埃斯珀。io的米沙尔·拉赫曼（Mishaal Rahman）最近指出，谷歌一直在为包括Pixel 5在内的一些设备上的最新安卓版本提供安卓更新，但没有正式更新BSP（读：固件级软件），所有这些都没有得到高通公司的帮助。这意味着，如果谷歌愿意，它可能会找到一种方法，将更新推到Android 12之后（除非存在任何真正重大的技术障碍或要求以及内核情况），但在今年秋天之前更新Pixel 3系列至少是轻而易举的事。\n有了这些更新选项，我们只能得出一个结论：谷歌只是不想继续更新Pixel 3。这三年的承诺已经实现了，而且&#39；It’Pixel 3的客户赚不到更多钱。为什么要超越？\n我要强调的是Snapdragon 845&#39；Pixel 3和3 XL中的s在很长一段时间内几乎肯定会得到社区的支持。愿意解锁引导程序并安装ROM的客户可能会持续很长一段时间，尽管这种情况下的安全性不是&#39；不一样，它&#39；这是一种至少需要维护和关注客户的情况#39；是的。\n我花了很多时间思考软件更新的影响，部分是因为这是很多人不注意的事情。一旦手机停止接收它们，技术恐惧症患者可能会高兴地发现事情停止了移动和变化，但更重要的是，时钟开始滴答作响。随着安全漏洞的缓慢积累，那部废弃手机何时才能停止安全使用？随着谷歌现在放弃Pixel 3系列，并兑现了三年的更新承诺，随着时间的推移，数百万款功能完美的手机将变得不安全。\n像Project Mainline这样的努力意味着，2022年的情况比五年前要好，但安全问题仍将缓慢蔓延，系统级更新提供的隐含安全保障现在已经消失。充其量，当顾客更换它们时，它们会被回收或扔进抽屉；最糟糕的情况是，他们最终会被填埋——这是假设使用他们的人关心他们的安全，并随着时间的推移意识到风险。出于所有这些原因，谷歌可以也应该超越其最低承诺。\n当谷歌仅仅在Pixel 6承诺的基础上额外增加了一年的安全补丁时，我感到失望——三星已经超越了这一小步。我以前说过，我要再说一遍：谷歌，树立一个更好的榜样。", "note_en": "Google has confirmed to us that the Pixel 3 series has received its last update, marking the end of a three-year promise. But revisiting the 2018-era flagship, I still can’t help but be disappointed that Google didn’t try harder to keep it supported longer. Google may have met its marketing requirements, but  as I’ve said before, it’s hypocritical for a company committed to sustainability and customer security to leave old smartphones behind so quickly. Revisiting it for the last few days, the Pixel 3 is still a perfectly good phone that could have years of life left in it. And, according to everyone I&#39;ve spoken to, there aren&#39;t any good technical reasons for it being left behind. Google just doesn&#39;t care.\n    The Pixel 3 and 3 XL probably weren’t Google’s best-selling models, and there were a few drawbacks to buying one, like the 3 XL’s monstrous bathtub notch and limited RAM for an Android flagship of the period. Google’s quality assurance (QA) back then was worse than it is now, and I actually had to exchange  both the Pixel 3 and Pixel 3 XL that I purchased for coverage to get units that didn’t have issues — my first Pixel 3 had a strange blob of glass under the display, and my first 3 XL had a busted camera.\n    Frankly, in late 2018 and early 2019, the Pixel 3 wasn’t my first choice for a phone. I bought it for work, knowing that it would be handy for developer previews, betas, and early access to Android updates in general. But Google was up against the golden age of OnePlus devices like the  OnePlus 6T and  OnePlus 7 Pro, so it usually wasn’t a Pixel that was in my pocket — and if it was, it probably wasn’t alone.\n    Anecdotally, I didn’t like the screen in the Pixel 3, which was an LG-made OLED that crushed blacks pretty badly, didn’t get as bright as some other phones when outside, and was inconsistent at low brightness levels, with an annoying gradient visible in not-quite-black dark themes. Battery life was also poor for me from the start, and that only got worse with time. On top of that, the limited 4GB of RAM could mean apps got pushed out of memory faster than expected.\n It wasn’t all bad, though. The Pixel 3 had a great camera, a fast chipset, I loved the software, and Google’s Assistant features like Call Screen would be worth a monthly subscription on any other phone. But, objectively speaking, the Pixel 3’s $800 launch price made it a bad deal for what you got.\n  All this is as true now as it was in 2018, but that doesn’t mean the phone is ready to be recycled.\n    I get a kick out of seeing how far things have come by playing with older phones — we used to have a  whole  dedicated  series for it here at Android Police, where I’d commit to using an antique without any backup and suffer the consequences for it. It gives you the perspective to better measure change over time and the motivation to dig deep since you’ll have to rely on it even as use cases, requirements, and even simple aspects of life might have changed since then. But coming back to the Pixel 3, I’m most stunned by how modern it feels.\n All those issues I just mentioned are still around, and battery life was a particular point of frustration, but customers deal with much worse than that using budget phones, and the Pixel 3 has some other perks. For one, the Snapdragon 845 is still a very fast chipset — the phone never feels slow outside having to restart apps more frequently than you might experience on other devices. The camera is still very good, too, with hardware that’s nearly identical to the primary shooter still being used in the  Pixel 5a.\n     I did have to stick closer to a charger than I’d like, but I’ve also been spoiled by the increase in battery life on more recent high-end phones. It might be missing 5G support, and there’s no ultra-wide camera or high refresh rate display, but the Pixel 3 doesn’t feel like an antique. It’s legitimately snappy, even today.\n Usually, we think of phones that stop getting updates as being so old that you may as well just upgrade anyway, but the Pixel 3 isn’t like that. It may have been a bad deal at launch, but it wasn’t a bad phone, and it still isn’t today. I could easily see someone pleased with it hanging onto a Pixel 3 for another year or two very easily, but that wouldn’t be very wise.\n    We get excited about updates for the new features they deliver, but the majority of Android updates are actually to protect your safety and security. Monthly patches usually aren’t delivering big new changes (outside things like Google’s Feature Drop updates), but they do fix vulnerabilities ranging from major to minor. In fact, Android’s monthly patches only originated because of one such vulnerability:  Stagefright.\n   Phones don’t just make calls anymore. We use them for banking, investing, and we can even pay our taxes from them. They are as much general-purpose computers as our PCs at home. You might think your phone’s security doesn’t matter, but do you have a banking app installed? How much would it mess your life up if you lost access to your Google, PayPal, or Facebook account? That’s the access your phone provides, and that’s the risk you open when you start using a phone that isn’t updated. (I actually have a handful of separate insecure testing accounts specifically for using old phones.)\n For customers still using a Pixel 3 — who, I should stress, paid $800 or more for their phone — the handset is still about as secure as other Pixels right now. Admittedly, the most recent update was for an earlier patch level than other currently supported Pixels have, but we’re still in a close-enough window. But with each new month, it will fall further behind. There’s no hard and fast rule for when a phone becomes “insecure,” but it’s a sliding scale that builds up as its software is left behind.\n    At one point, Google considered quarterly updates good enough for enterprise use, though some companies are too lazy to meet  even quarterly updates reliably. As the days tick by, though, it’s just a matter of which vulnerabilities are discovered and how strong of an exploit they provide.\n Pixels and other recent Android devices do have one advantage in that they offer  Mainline and  APEX modules to update core parts of the Android system separately from the OS itself; Google can roll out a lot of fixes and security patches via that method as well as Play Services. We’ve reached out to Google to confirm what Pixel 3 owners can expect in that regard, and we’ll be sure to update if we hear back. But a phone that’s “left behind” in 2022 is in a better position than one that stopped getting updates in 2017.\n   Ultimately, an out-of-date Pixel is probably more secure than most other Android phones, but the clock is still ticking. Without system-level patch support, some vulnerabilities can’t be fixed, leaving customers increasingly less secure.\n   Using the Pixel 3 and 3 XL again over the last week — preferring the smaller 3 for its size compared to modern flagships — I was stunned at how fast the “old” phones were. Yes, they were a bad deal when they came out, and we should all be very thankful Google finally learned the value of a dollar with the new Pixel 6. But the Pixel 3 is faster than plenty of mid-range phones still being released today.\n  2018 was the year of the iPhone XS, a phone that cost $200 more than the base model Pixel 3 and $100 more than the Pixel 3 XL, and it’s still getting updates. In fact, the last iOS update included the iPhone 6s, a phone from 2015. I know that Google only committed to three years of updates at launch, but there’s nothing to keep the company from voluntarily pushing past that number.\n   Qualcomm has confirmed to me that it is still able to deliver Qualcomm-specific software updates for the Snapdragon 845, and while kernel-level support will be an issue for the chipset beginning with Android 13, things right now under Android 12 are just fine. Google  absolutely could deliver security patches for the Pixel 3 series until Android 13 lands.\n  Furthermore, Esper.io’s Mishaal Rahman recently pointed out that Google has been providing Android updates without officially updated BSPs (read: firmware-level software) for recent Android versions on some devices,  including the Pixel 5, all  without Qualcomm’s help. That means, if Google wanted to, it could probably find a way to push updates out past Android 12 (barring any really big technical hurdles or requirements and the kernel situation), but updating the Pixel 3 series until this fall is at least within easy reach.\n    With these options for updates available, there’s only one conclusion to draw: Google just doesn’t  want to keep updating the Pixel 3. That three-year promise has been satisfied, and it&#39;s not making more money from Pixel 3 customers. Why go above and beyond?\n I should stress that the Snapdragon 845 that&#39;s in the Pixel 3 and 3 XL will almost assuredly get community support for a long time. Customers willing to unlock their bootloader and install a ROM can probably carry on for quite a while, though the security in a situation like that isn&#39;t the same, and it&#39;s a situation that would require at least maintenance and attention on a customer&#39;s part.\n I spend a lot of time thinking about the impact of software updates, in part because it’s something a lot of people don’t pay attention to. Once a phone stops getting them, technophobes might be happy that things stop moving and changing, but far more importantly, the clock starts ticking. With the slow buildup of security vulnerabilities, when will that abandoned phone stop being safe to use? With Google now giving up on the Pixel 3 series with its three-year update promise fulfilled, millions of perfectly capable phones are going to become unsafe over time.\n    Efforts like Project Mainline mean this is a better situation now in 2022 than it would have been half a decade ago, but security issues are still going to creep slowly in, and the implicit guarantee of security provided by system-level updates is now gone. At best, they’ll get recycled or tossed in a drawer as customers replace them; at worst, they’ll end up in a landfill — and that’s assuming the people using them care about their security and are aware of the risks over time. For all these reasons, Google can and should push beyond its minimum commitment.\n I was underwhelmed when  Google merely added an extra year of security patches with its Pixel 6 commitment — a tiny step that has  already been eclipsed by Samsung. I’ve said it before, and I’ll say it again: Set a better example, Google.", "posttime": "2022-02-22 00:45:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,google,谷歌,本来,updated", "title": "谷歌本来可以将Pixel 3升级到Android 13，但它只是不想这么做", "title_en": "Google could have updated the Pixel 3 until Android 13, it just didn't want to", "transed": 1, "url": "https://www.androidpolice.com/the-pixel-3-deserves-longer-updates/", "via": "", "real_tags": ["android", "google", "谷歌", "本来", "updated"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位伟大的美国大师在加利福尼亚州的豪华别墅是众所周知的。更鲜为人知的是赖特为实现这些目标而发明和发展的建筑技术。\n这篇文章最初发表在1992年4月的Domus 737上。“混凝土砌块？最便宜（也最丑）建筑界的事。它主要生活在建筑排水沟中，模仿“岩石表面”的石头。为什么不看看能用那只水沟鼠做些什么呢？与之结合的钢铸在接缝内，而砌块本身也被纳入了某种广泛、实用的一般处理方案中，那么为什么它不适合现代建筑的某一阶段呢？它可能是永恒的，高贵的，美丽的。那会很便宜。\n使这种方案可行所需的全部想象力是一种塑料介质，在这种介质中，钢将以抗拉强度的形式进入惰性质量。混凝土是惰性物质，需要压缩。混凝土是一种塑料材料，容易受到想象力的影响。\n我们将把建筑业中被鄙视的弃儿——混凝土砌块——从脚下或排水沟中挖出来——在其中找到一个迄今未被怀疑的灵魂——让它像树一样美丽地生活。是的，这座建筑将由“积木”构成，作为一种树，它本身就站在自己家乡的其他树木中间。”。\n弗兰克·劳埃德·赖特（Frank Lloyd Wright）在他的自传中描述了他在加利福尼亚州帕萨迪纳（Pasadena，California，1923年）为爱丽丝·米勒德（Alice Millard）建造的房子。他很高兴第二次为米勒德太太工作。当客户来找他重复表演时，他总是很高兴（在他的职业生涯中，有很多人都是这样做的）。\n“Millards一家住在我15年前在芝加哥附近的高地公园为他们建造的一栋住宅里。我很自豪有一位客户在第一栋房子中幸存下来，并要求我建造第二栋。\n我感激地决定她应该是我作品中最好的。这意味着，首先，某种东西属于它所在的土地。从日本回家后，我逐渐展开了我脑海中逐渐形成的纺织砖房方案。她并不害怕这个想法”。\n米勒德夫人满怀热情地赞同建筑方法方面的一个全新想法，并支持建筑师对混凝土砌块的这种创新方法，因此她在帕萨迪纳寻找了一处房产。\n“我们看到一个迷人的小峡谷，底部有水。两边各有两块可供出售，而且这条峡谷似乎没有什么特别的用途。因此，我们没有在两边购买昂贵的地块，而是买下了这条峡谷，他们很高兴把它处理掉。他们没想到有人会在上面修建，但我们做到了。”。\n他心目中的体系，以及他命名为“La Minitatura”的这座房子的第一朵鲜花，就是他称之为“纺织混凝土砌块建筑”的体系。\n赖特没有使用粗糙难看的标准煤渣砖，而是设计了一种可以在现场模制成不同图案的砖，其中一些是实心的，一些是用于玻璃插入的穿孔砖，一些是用于透明开口的穿孔砖。砌块本身的尺寸和重量可以由一个人轻松搬运，可以一个接一个地提起和放置，然后将混凝土灌浆倒进凹槽边缘内，将整面墙粘合在一起，而无需传统的混凝土石匠砂浆层。这种施工方法使得熟练的泥瓦匠不再需要使用；相对不熟练的工人可以很容易地竖起墙壁。\n从第一个例子开始，赖特在后来为约翰·斯托尔（John Storer）、塞缪尔·弗里曼（Samuel Freeman）和查尔斯·恩尼斯（Charles Ennis）建造的三栋房屋中，发展了一个连续加固系统。\n随着墙的上升，细长的钢筋被一层一层地插入，包括水平和垂直。然后将混凝土灌浆倒入凹槽中，使砌块和钢材牢固地结合在一起，形成一个完全加固的结构。整个过程产生了“织物块”的说法，直接指的是在钢筋经纬上编织混凝土块的想法。\n我们将把建筑业中被鄙视的弃儿——混凝土砌块——从脚下或排水沟中带出来——在其中找到一个迄今未被怀疑的灵魂。\n在地震多发地区，这似乎是最明智的预防方法。赖特在日本帝国酒店成功地测试了这个概念。该酒店在1923年关东地震中幸存下来，主要是基于钢结构加固的原则——赖特经常称之为“推拉建筑物的能力”，一旦任何不利压力消失，它就会恢复正常。\n因此，这四栋房屋将钢筋混凝土砌块的建造原理作为建筑内外的形式和结构语言；赖特第一次用它来反映这个地区的特点。他正在与西班牙传教风格的流行趋势作斗争，这些风格有各种各样的分支、改编和变化，它们曾如此阴险地侵入南加州地区。在他看来，一个拥有机器时代和机器时代技术所有好处的二十世纪文明应该继续模仿十六世纪的风格，这似乎是愚蠢的。此外，这种轻率的模仿与一个民主国家的建筑或一个适合其所在土地的建筑几乎没有关系。\n弗兰克·劳埃德·赖特（Frank Lloyd Wright）在洛杉矶建造四栋楼的经历，其脚注来自他30年后对这件事的回忆，说到“La Miniatura”的建造：“我没有建筑许可证，在我们走到一半的时候，他们来了，拦住了我们。我必须去见建筑检查员。我把他弄上车，开车送他到那个地方，让他看看我们在做什么。”“嗯，”他说，“弗兰克·赖特，这是洛杉矶有史以来最好的事情。”。这真的很好，它的抗震，防虫，防火和廉价，采取了混凝土块，使它的东西，不仅有趣，但美丽”。\n我想，“好吧，现在没事了，我想我已经到了，我们要拿到许可证了。”。然后我说：“好吧，那我们就拿到建造房子的许可证吧？”；“哦，好吧，现在，”他说，“那是另外一回事。我不能给你一个许可证，没有什么可以涵盖的。如果你去议会申请，你就得不到它。”。我说：“好吧，为什么不呢？你说这是该地区最好的东西——为什么我不能建造它呢？”。“你不明白吗，在洛杉矶，我们有我们所说的贸易平衡。有砖块人；他们卖砖头来建造；有木材人；他们卖木材。你所做的就是给混凝土以优先于所有其他人的权利。为什么，他们不在市场上，你什么也卖不出去如果我给你一个许可证去做这件事。你看到建筑业的情况了吗？\".\n我说，“天哪，我该怎么办？”。他嚼了嚼一片草，把它拔出来，环顾四周，然后说：“去把它造出来吧！”。因此，我在没有总部任何干涉的情况下建造了四座市政厅。都是非法的。我在山上建了一座仓库，它是一座小宫殿。它看起来像一座威尼斯的小宫殿。然后我建造了弗里曼之家，最后是埃尼斯之家，这是一座混凝土砌块大小的房子。我觉得这太过分了。这就是你要做的，你知道，在你出发后，你要走得太远以至于你出界了。我认为埃尼斯的房子不适合建造混凝土砖房”。\n尽管赖特回顾了他对这些房屋的观察，包括他对斯托尔和埃尼斯的评论，但它们仍然是他住宅建筑作品中最美丽、最有趣的设计之一。去拜访他们，了解他们，就是被他们默默但毫无疑问地传递的那种难以形容的浪漫和魔力所迷住。\n布鲁斯·布鲁克斯·普费弗1930年出生于马萨诸塞州南纳蒂克，1949年开始在弗兰克·劳埃德·赖特手下当学徒学习。20世纪50年代，他在巴黎的一所艺术学校就读，然后回到赖特&#39；s折叠。他于1959成为莱特基金会的档案主管，后来担任该集团的副总裁和受托人。\n开场图片：仓库正在进行中的工作。Domus n.737档案馆，1992年4月", "note_en": "The splendid Californian villas of the great American master are well known. Much less known is the construction technique that Wright invented and developed to achieve them.\n  This article originally appeared in Domus 737, April 1992.    “The concrete block? The cheapest (and ugliest) thing in the building world. It lived mostly in the architectural gutter as an imitation of ‘rock face’ stone. Why not see what could be done with that gutter-rat? Steel wedded to it cast inside the joints and the block itself brought into some broad, practical scheme of general treatment then why would it not be fit for a phase of modern architecture? It might be permanent, noble, beautiful. It would be cheap.\n All that imagination needed to make such a scheme feasible was a plastic medium where steel would enter inert mass as a tensile strength. Concrete was the inert mass and would take compression. Concrete is a plastic material – susceptible to the impress of imagination.\n We would take that despised outcast of the building industry – the concrete block – out from underfoot or from the gutter – find a hitherto unsuspected soul in it – make it live as a thing of beauty – textured like the trees. Yes, the building would be made of the ‘blocks’ as a kind of tree itself standing at home among the other trees in its own native land”.\n   This was what  Frank Lloyd Wright wrote in his autobiography when he described the house he built for Alice Millard in Pasadena, California (1923). He was delighted to go to work for Mrs. Millard, the second time. It always pleased him when a client came to him for a repeat performance (there were many who did throughout his career).\n “The Millards had lived in a dwelling I had built for them fifteen years ago at Highland Park near Chicago. I was proud to have a client survive the first house and ask me to build a second.\n  Gratefully I determined she should have the best in my portfolio. That meant, to begin with, something that belonged to the ground on which it stood. Gradually I unfolded the scheme of the textile block-slab house gradually forming in my mind since I got home from Japan. She wasn’t frightened by the idea”.\n With her enthusiasm to subscribe to a totally new idea in building methods, and to support her architect in this innovative approach to the concrete block, Mrs. Millard sought a piece of property in Pasadena.\n   “We saw a charming little ravine, with water in the bottom of it. On each side were two lots for sale, and the ravine didn’t seem to have any particular use. So instead of buying an expensive lot on either side, we bought the ravine, which they were glad to get rid of. They didn’t imagine anybody was going to build on it, but we did”.\n The system he had in mind, and that would first flower in this house he named “La Miniatura”, was one that he called “textile concrete block construction”.\n Rather than using the standard cinder block, rough and unsightly, Wright designed a block that could be molded on site into different patterns, some of them solid, some perforated for glass inserts, some perforated for clear openings. The blocks themselves were made of a size and weight that could be easily handled by one person, able to lift and place them one upon the other, and then pour concrete grout down inside the grooved edges, bonding the whole wall together without the customary concrete mason’s mortar course. This method of construction rendered the use of skilled masons unnecessary; relatively unskilled labor could easily erect the walls.\n   From this first example came Wright’s development, in the subsequent three houses he built – for John Storer, Samuel Freeman and Charles Ennis – of a continuous reinforcing system.\n Slender steel rods were inserted course by course, both horizontally and vertically, as the wall rose. Concrete grout was then poured into the grooves, resulting in a strong bond of blocks and steel into a totally reinforced structure. The whole process gave rise to the expression “textile block”, a direct reference to this idea of weaving the concrete blocks on a warp and woof of reinforcing steel.\n We would take that despised outcast of the building industry – the concrete block – out from underfoot or from the gutter – find a hitherto unsuspected soul in it.\n In an earthquake-prone region this seemed the most sensible method of prevention. Wright has tested this concept successfully in the  Imperial Hotel in Japan. The hotel survived the 1923 Kanto earthquake primarily on the principle of steel structural reinforcing – what Wright often called “the ability to push and pull on a building” and let it return to normal once any adverse pressure subsided.\n   These four houses, therefore, presented the construction principle of reinforced concrete block as the language of form and structure, inside and out of the building; and Wright employed it for the first time to reflect the character of this particular region. He was fighting the prevailing trend of Spanish Mission styles, in all their various ramifications, adaptations and variations, that had so insidiously invaded the southern California area. It seemed foolish to him that a twentieth century civilization, with all the benefits of the machine age and machine age technology, should continue to imitate the styles of the sixteenth century. Furthermore, such thoughtless imitation showed but little relationship to an architecture for a democracy or an architecture that befitted the land upon which it was built.\n A footnote to this experience of Frank Lloyd Wright’s building the four block, houses in Los Angeles is drawn from his own recollections of the affair thirty years later, speaking of the construction of “La Miniatura”: “I didn’t have a building permit, and they came along after we’d got about half way up and stopped us. I had to go and see the building inspector. I got him in the car, drove him out to the place and showed him what we were doing. “Well”, he said, “Frank Wright, this is the best thing that ever came to Los Angeles. This is really fine, it’s earthquake proof, vermin proof, fireproof and cheap, taken the concrete block and made it something, not only interesting, but beautiful”.\n   And I thought, “Well, this is fine now, I guess I’ve arrived, and we’re going to get a permit”. Then I said, “All right, we get a permit, then, to build the house?”; “Oh well, now”, he said, “that’s something else. I can’t give you a permit, there’s nothing to cover this. And if you were to go to the council for it, you wouldn’t get it”. I said “Well, why not? You said it was the best thing that has come into the region – why can’t I build it?”.  “Don’t you see, here we have what we call the balance of trade in Los Angeles. There are the brick people; they’re selling bricks to build; here are the lumber people; they’re selling lumber. What you’ve done is to give concrete the right of way over all those other fellows. Why, they wouldn’t be in the market, you couldn’t sell anything after a while if I gave you a permit to go with this thing. You see what the situation is in the building industry?”.\n  I said, “Well, my God, what am I going to do?”. He chewed on a piece of grass, pulled it out, looked around, then said, “Go ahead and build it!”. So I built them – four of them – without any interference from headquarters – the City Hall. All illegal. I built the Storer house up on a hill – it’s a little palace. It looked like a little Venetian Palazzo. Then I built the Freeman house, and finally there was the Ennis house, which was way out of concrete block size. I think that was carrying it too far. That’s what you do, you know, after you get going, and get going so far that you get out of bounds. And I think the Ennis house was out of bounds for a concrete block house”.\n   Regardless of Wright’s observations in retrospect about these houses, including his remarks pursuant to Storer and Ennis, they remain among the most beautiful and intriguing designs of his work in residential architecture. To visit them, to know them, is to become enchanted by the indescribable sense of romance and magic that they quietly, but unquestionably, impart.\n Bruce Brooks Pfeiffer was born in 1930 in South Natick, Massachusetts, and began studying as an apprentice under Frank Lloyd Wright in 1949. In the 1950s he attended an art school in Paris, then returned to Wright&#39;s fold. He became director of the Wright Foundation’s archives in 1959 and later served as vice president and trustee of the group.\n  Opening image: Work in progress at the Storer house. Domus n. 737 archive, April 1992", "posttime": "2022-02-22 00:41:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建筑,劳埃德,lloyd", "title": "弗兰克·劳埃德·赖特与“纺织区块”建筑体系（1992）", "title_en": "Frank Lloyd Wright and the “textile block” construction system (1992)", "transed": 1, "url": "https://www.domusweb.it/en/from-the-archive/2022/02/08/frank-lloyd-wright-and-the-textile-block-construction-system.html", "via": "", "real_tags": ["建筑", "劳埃德", "lloyd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在确认我们生活在一个旋转的球形地球上，其周长、直径和半径分别约为25000英里、8000英里和4000英里（40000公里、13000公里和6500公里），现在是时候询问天空中最明显的物体的性质了：太阳和月亮。它们有多大，有多远？\n从历史上看，许多人认为他们很亲近。在我们的全球社会中，很明显两者都不可能，因为它们在世界各地随处可见。即使是最高的云层，高达10英里，也只能被几百英里以内的云层看到。如果月球离我们很近，我们中只有一小部分人能在任何时候看到它，如右图所示。但事实上，几乎每个人在地球一半的夜间都能同时看到满月，所以它一定比地球直径的两倍还要远。而且，由于月球会通过阻挡太阳的光线周期性地遮住太阳，所以太阳必须比月球更远。\n古希腊人是专业的几何学家，他们用月食和日食来计算月球的大小和距离。（要做到这一点，他们还需要知道地球的大小，埃拉托什尼认为地球的大小在几%以内。）他们通过仔细研究直角三角形和圆的几何结构，并使用三角学（或其前身）实现了这一点，甚至更多\n我们在这里使用的方法是类似的，但要简单得多，不需要三角学，几乎不需要任何几何。我们将使用月食，即月亮在遥远的恒星或行星前面，这也被称为“掩星”。我不知道希腊人使用这种方法的证据，尽管我不知道他们为什么不这么做。也许读者有一些见解？这可能是因为他们所属的帝国不够广泛，不足以进行良好的测量。\n假设你把一个球体放在一堵墙的前面，用一个小灯泡照亮球体，灯泡位于垂直于墙的线上，穿过球体的中心，如下图所示。球体在墙上投射的阴影通常比球体本身大。但是，将灯泡移动得越远，球体的阴影将与球体的大小相同！你可以用手和手机上的小灯来验证这一点。\n当然，阴影是指灯泡发出的光无法到达墙壁的地方，因为它被球体阻挡。这意味着墙上的蚂蚁只有站在阴影之外才能看到灯泡；如果它站在阴影中，那么这个球体已经遮住了灯泡的视线。这一点在这里很重要，因为环境光可能会使阴影看不见，但蚂蚁仍然可以相对容易地判断灯泡是否被遮挡。\n所以如果球茎离我们很远，我们有一群蚂蚁在墙上徘徊，我们问他们，“你能看到球茎吗？”，然后我们在所有回答“不”的蚂蚁周围画了一个圆圈，然后我们在墙上画的圆圈将与球体大小相同。\n太棒了我们的方法基本上就是这样。灯泡的作用将由遥远的恒星或行星扮演。球体的作用将由月球扮演。长城的作用将由地球扮演。蚂蚁的角色将由你、我和所有有眼睛和双筒望远镜的朋友扮演。\n补充说明：正如一位读者所指出的，不知何故，我忘了在下一节中明确指出，我假设被掩星和行星距离地球的距离至少是月球的10倍，因此它们投射的阴影直径不超过月球直径的1/10（即10%）。这确保了该方法的准确度优于10%。当然，这一假设必须经过检验，才能完全信任该方法；如果它是假的，那么这个方法会让我们高估月球的直径。然而，正如我们将看到的，本文中描述的第二种方法，使用日食，给出了与第一种相同的答案。因此，这两种方法一致的事实证明了行星和恒星离地球很远的假设。真的，我应该重写这篇文章，让这个逻辑不那么复杂。\n现在这个方法有一些可疑之处，所以让我们马上处理它们。\n我从一个小灯泡开始，但是一个遥远的恒星或行星是巨大的！幸运的是，这没关系，因为实际上灯泡必须离得太远，以至于看起来很小——它比月球占据的天空要少得多。一颗巨大而遥远的恒星，与太阳不同，它似乎是一个光点，可以很好地发挥作用。正如你在双筒望远镜中很容易看到的那样，行星看起来比恒星大，但它们仍然是比月球圆盘小得多的点。太阳不足以达到这个目的，因为它看起来和月亮一样大；如果你对如何使用太阳感兴趣，我在这篇文章的末尾有一个旁白。\n同时，屏幕是平的，但地球是弯曲的。没关系，只要我们使用地球上离月球最近的部分。这是因为一个巨大球体的任何一小部分都非常接近平面，而离月球最近的部分就像一个近乎平面的屏幕。（这只是因为月球比地球小得多，所以我们只需要看到地球一小部分的阴影就行了。）地球的曲率会使阴影比平墙上的阴影大一点。如果阴影太靠近边缘（比如说，北极或南极），它将被极大地扭曲，我所概述的方法将不起作用。但是如果我们能找到月球的影子，当它或多或少地以地球为中心时，那么地球的弯曲表面就足够接近我们所需要的平壁。幸运的是，事实证明这很容易。\n另一个问题是，一颗恒星甚至一颗行星太暗，无法在地球上投射出明显的阴影。这主要是因为，除了新月，月球自身的光（即它反射的阳光）比恒星或行星发出的光要亮得多，所以它会冲走自己的阴影。这就是为什么我们将使用“询问蚂蚁”的方法。由于缺乏更好的术语，我仍然将被遮挡的区域称为“阴影”，但请记住，它实际上是因为月亮挡住了视线而看不到恒星或行星的区域。\n那么我们所有的蚂蚁呢？我们应该做些什么来实现这个方法？\n一种选择是等待下一次行星或明亮恒星被月球掩星。在这项活动之前，我们可以组织一个大型的国际明星派对，在我们都在观看的地方，在特定的时刻，我们都会报告我们是否能看到明星。这不仅是一个好主意，天文学家（专业和业余）也一直这么做。我们不需要等待太久，因为肉眼可见的恒星掩星一个月会发生好几次。行星掩星不太常见，但也不罕见；我自己也见过五次，但没怎么努力。\n2022年，这里有一长串掩星。特别要注意的是金星和火星今年都被掩星了；其余的都是星星。对于列表中的每个条目，单击“名称”下的链接，可以看到一张地图，显示它将在哪里可见，将在哪里不可见。\n如果你不信任这些地图，你可以收听下一个明星派对，亲自去看看；这里有一个很好的介绍（pdf格式）给那些对观看掩星感兴趣的人。但是如果你对此太不耐烦了，如果你真的相信这些地图（它们经常被使用，没有人抱怨），那么我们就可以从中读出月球的大小。\n你可以在右边的预测中看到这一点；其中有三个，一个是几年前，一个是本周，一个是今年晚些时候。每个预测都不是一个圆，而是一条带。这是因为月球在移动，地球在旋转，所以被阻挡的蚂蚁圈的位置会随着时间的推移而移动。在某一时刻，这个圆圈可能在非洲上空，几个小时后，它可能在亚洲上空。所以，即使在任何时刻它都是一个圆，随着时间的推移，它会形成一条带——其宽度是圆的直径！\n我应该指出，我已经选择了月球阴影穿过赤道的例子，或者几乎如此。正如我之前提到的，从月球上看，当阴影位于地球边缘附近时，就会发生扭曲；在那里，地球的曲率会产生更大的影响。最重要的是，这些预测显示了一个平面地图来代表地球，而且由于没有平面地图能够精确地代表一个球体，因此产生的扭曲会使阴影变得非常不稳定，比你看地球时实际会发生的情况要多得多。因此，在赤道附近可以看到的掩星——大约一半——是测量月球大小的最佳方法。\n事实上，在图中的三个例子中，可以看到掩星的条纹大小总是一样的。朋友们，这就是月亮的大小。如果我们测量预测的（或测量的）条带的宽度，在某个时间，掩星将是（或是）可见的，并且我们在赤道附近这样做，甚至更好，在条带的中间，在靠近月球的地球上，我们估计月球的直径。\n你已经可以从地图上看出，月球的直径必须小于地球的一半，但显然大于十分之一。让我们看看粗略的测量结果。\n下面是去年4月17日月球掩星火星的（成功）预测。阴影在地球表面的运动从北转向南，我在那一点放置了一个暗圆盘，显示了当时的阴影。这是一个特别容易解释地图的位置。你可以看到阴影的北边在阿富汗的中间，南边正好在赤道以北。\n右边是使用谷歌地图计算地球上这两点之间的距离。我只是盯着它看了一下，记住地球的曲率会稍微延长一点，所以我真的没有权利期望它比5%更准确。（如果你愿意，我们会邀请你更仔细地做。）最后我跑了大约2200英里（3600公里）\n根据现代科学的精密度研究，月球的平均直径为2159.1英里（3474.8公里）。因此，我确实在5%以内。\n现在你可能会抱怨，我使用了某人的预测来得出这个估计，而不是实际的测量。但请记住，这是对过去发生的事情的预测；掩星被广泛观察到，所以如果预测是错误的，你肯定会听到它。你总是可以选择等待未来类似的事件，在给定的时刻，天文学家会报告他们是否看到恒星或行星消失在月球后面。如果在离赤道不远的掩星观测中，你将最北端的观测者与最南端的观测者在特定时刻进行比较，你会发现它们之间的距离非常接近月球的直径。\n没有三角形，没有三角学。仅仅是一些观星者在正确的夜晚发布的时间和位置报告；这就是我们所需要的。\n还有另一种更复杂的方法，当月亮挡住太阳的视线时，利用日食来做同样的事情。这是相似的，但有趣的是不同的，因为不同于遥远的恒星，从我们的角度看，它看起来像一个点，太阳占据的天空和月亮一样多。当然，太阳必须离得更远，否则日食不会发生，所以它的真实大小必须比月球大。（它是否比地球大，我们将在稍后讨论。）\n当你观察一个大光源投射的物体的阴影时——例如，一个标准大小的灯泡投射的网球的阴影——如果你把球移得足够近，你会发现它可能有两个分量。有一个中心阴影，即“本影”，它是黑色的。在那里，灯泡的光线完全被球挡住了。外面是一个有微弱阴影的区域，即“半影”；在那里，球只挡住了灯泡的一部分光线。试试看。\n月食的诀窍如下。由于月球和太阳在天空中的大小相似，月球阴影的本影是一个非常狭窄的区域，通常只有几百英里（公里）宽。在那里，太阳被完全遮挡，日食是全食：天空变得相当黑暗，可以看到太阳巨大的外层大气（“日冕”）。半影是偏食，它要大得多，宽数千英里（公里）。在那里，月亮完全挡住了太阳，所以天空变得有点暗，但世界仍然是白天。\n现在有一个显著的事实：月球的直径大约是半影直径和本影直径之差的一半。由于本影比半影小得多，月球的直径大约是半影直径的一半。\n上图显示了实现这一点的几何图形（这不是按比例绘制的；绘制它是为了使概念概念易于理解。）虽然遥远恒星的光线到达地球时基本上是平行的，但太阳光线可以从太阳的不同部分从不同方向到达地球。只有在本影中——非常小，因为太阳和月亮在天空中的大小几乎相同——太阳的光线才能到达地球；那里是日全食。这是由蓝线表示的，蓝线表示既看不到太阳的顶部，也看不到太阳的底部（如图所示）。就在半影边缘，如红线所示，太阳和月亮在天空中似乎几乎没有接触。在半影区内，部分但不是全部的太阳光线被月亮挡住，天空依然明亮；在那里，日食是偏食，随着接近本影，新月形的太阳变得更窄。\n下图左边是1991年著名日食的轨迹；我记得那是我在加州读研究生时的一次日偏食，但仍然很遗憾，我没有找到一条路去下加利福尼亚州，将其视为日全食。本影横穿世界的路径用深蓝色标出，半影的边缘用最外面的浅蓝色线条标出。中心的红点标志着月食中期，发生在地球表面离月球最近的时候；方便的是，到赤道的距离也不大。这意味着地球表面沿着1900UT线（一条固定时间的线）是相对平坦的，从中点到边缘的长度估计值是使用右侧图片中的谷歌地图获得的。\n这个方法给出的答案与上一个非常相似，并且再次精确到5%以上，这是我相信我的相当随意的方法。一个专注的观察者可以做得更好。但粗略估计，这已经相当不错了！", "note_en": "Having confirmed we live on a  spherical,  spinning Earth whose circumference, diameter and radius are roughly 25000, 8000, and 4000 miles (40000, 13000, and 6500 km) respectively, it’s time to ask about the properties of the objects that are most obvious in the sky: the Sun and Moon. How big are they, and how far away?\n  Historically, many peoples thought they were quite close. With our global society, it’s clear that neither can be, because they can be seen everywhere around the world. Even the highest clouds, up to 10 miles high, can only be seen by those within a couple of hundred miles or so. If the Moon were close, only a small fraction of us could see it at any one time, as shown in the figure at right. But in fact, almost everyone in the nighttime half of the Earth can see the full Moon at the same time, so it must be much further away than a couple of Earth diameters. And since the Moon eclipses the Sun periodically by blocking its light, the Sun must be further than the Moon.\n The classical Greeks were expert geometers, and used eclipses, both lunar and solar, to figure out how big the Moon is and how far away. (To do this they needed to know the size of the Earth too, which Eratosthenes figured out to within a few percent.) They achieved this and much more by working carefully with the geometry of right-angle triangles and circles, and using trigonometry (or its precursors.)\n The method we’ll use here is similar, but much easier, requiring no trigonometry and barely any geometry. We’ll use eclipses in which the Moon goes in front of a distant star or planet, which are also called “occultations”. I’m not aware of evidence that the Greeks used this method, though I don’t know why they wouldn’t have done so. Perhaps a reader has some insight? It may be that the empires they were a part of weren’t quite extensive enough for a good measurement.\n    Suppose you place a sphere in front of a wall, and you illuminate the sphere with a tiny light bulb that sits on the line that is perpendicular to the wall and passes through the center of the sphere, as in the picture below. The shadow cast by the sphere on the wall will generally be larger than the sphere itself. But the further away you move the bulb, the more the sphere’s shadow will be the same size as the sphere! You can verify this yourself with your hand and the small light on your cell phone.\n  A shadow, of course, is a place where light from the bulb cannot reach the wall because it is blocked by the sphere. What that means is that an ant on the wall can see the bulb only if it stands outside the shadow; if it stands within the shadow, the sphere has eclipsed — blocked the view of — the bulb. That’s important here, because it could happen that ambient light makes the shadow impossible to see, yet it could remain relatively easy for an ant to tell if the bulb is blocked or not.\n So if the bulb were quite far away, and we had a bunch of ants wandering around on the wall, and we asked them, “Can you see the bulb?”, and then we drew a circle around all the ants who replied, “No”, then the circle we drew on the wall would be the same size as the sphere.\n Great! Our method is essentially this. The role of the bulb will be played by a distant star or planet. The role of the sphere will be played by the Moon. The role of the wall will be played by the Earth. And the role of the ants will be played by you, me, and all our friends with eyes and binoculars.\n Note added: as a reader pointed out, somehow I forgot to state explicitly that in the next section I am assuming that the occulted stars and planets are at least 10 times farther away from the Earth than the Moon is, so that the shadow they cast is no more than 1/10 (i.e. 10%) larger in diameter than the Moon. That assures that the method is accurate to better than 10%. This assumption, of course, has to be tested before the method can be fully trusted; were it false, then the method would give us an over-estimate of the Moon’s diameter. However, as we will see, the  second method described in this post, using solar eclipses, gives the same answer as the first. The fact that the two methods agree thus proves the assumption that the planets and stars are far away. Really I should rewrite the post to make this logic less convoluted.\n  Now there are a few suspicious things about this method, so let’s deal with them right away.\n I started with a tiny bulb, but a distant star or planet is huge! Fortunately, that’s okay, because actually the bulb just has to be so far away that it  looks tiny — that it occupies much less sky than the Moon does. A huge but distant star which, unlike the Sun, appears to be a point of light, will do just fine. The planets appear larger than the stars, as you can easily see in binoculars, but they’re still much smaller dots than the Moon’s disk. The Sun will not suffice for this purpose, since it looks as big as the Moon; if you’re interested in how to use the Sun, I have an aside about that at the end of this post.\n Meanwhile, the screen is flat, but the Earth is curved. That’s ok, as long as we use the part of the Earth closest to the Moon. That’s because  any small part of a huge sphere is pretty close to flat, and the part closest to the Moon acts like a nearly-flat screen. (This only works because the Moon’s much smaller than the Earth, so we only need to see the shadow on a small part of the Earth.) The Earth’s curvature will make the shadow a bit larger than it would be on a flat wall. And if the shadow gets too close to the edges (say, to the north or south pole) it will be greatly distorted and the method I’m outlining won’t work. But if we can find the Moon’s shadow when it’s more or less centered on the Earth behind it, then the curved surface of the Earth is close enough to a flat wall for our purposes. Fortunately, this turns out to be easy.\n Another issue is that a star or even a planet is far too dim to cast an obvious shadow on the Earth. This is mainly because, except at new Moon, the Moon’s own light (i.e., the sunlight that it reflects) is much brighter than the light from the star or planet, so it washes out its own shadow. That’s why we’ll instead use the “ask the ants” method. I’ll still refer to the blocked region as “the shadow”, for lack of better terminology, but remember it’s really the region where the star or planet cannot be seen because the Moon is in the way.\n And what about all of us ants? What are we supposed to do to carry out this method?\n One option is to wait for the next occultation of a planet or bright star by the Moon. In advance of this event, we can organize a big international star party where we’re all watching, and at a particular chosen moment, we all report whether we can or cannot see the star. Not only is that a good idea, astronomers (professional and amateur) do this all the time. And we won’t have to wait long, because occultations of naked-eye stars happen several times a month. Occultations of planets are less common, but not rare either; I’ve seen five myself, without trying very hard.\n For 2022,  here’s a long list of occultations. Note particularly that Venus and Mars are both occulted this year; all the rest are stars. For each entry on the list, click on the link under “NAME” to see a map that shows where it will and won’t be visible.\n If you don’t trust the maps, you can tune in to the next star party and participate to see for yourself; here’s a  nice introduction (pdf format) for those interested in watching occultations. But if you’re too impatient for that, and if you do trust the maps  (which are used constantly without anyone complaining)  then we can read off the Moon’s size just from them.\n You can see this in the predictions posted to the right; there are three of them, one some years ago, one this week, and one later this year. Each prediction is not a circle, but is instead a strip. That’s because the Moon is moving and the Earth is spinning, so the location of the circle of obstructed ants moves around over time. At one moment the circle might be over Africa, and a few hours later it might be over Asia. So even though at any one moment it’s a circle, over time it forms a strip — whose width is the diameter of the circle!\n  I should point out that  I’ve selected examples where the Moon’s shadow crosses the equator, or nearly so. As I mentioned earlier, the shadow gets distorted when it lies near the edges of the Earth as seen from the Moon; there the Earth’s curvature becomes a bigger effect. On top of that, these predictions show a flat map to represent the Earth, and since no flat map can ever represent a sphere accurately, the resulting distortion makes the shadow all wonky, much more than it actually would if you were looking at a globe. So the occultations that can be seen from near the equator — about half of them — are the best ones for measuring the Moon’s size.\n In fact, in the figure’s three examples, the strip where the occultation can be seen is always about the same size. And that, my friends, is the size of the Moon. If we measure the width of the predicted (or measured) strip where at some time the occultation will be (or was) visible, and we do so near to the equator — and even better, in the middle of the strip, which will be on the part of the Earth closest to the Moon — then we are estimating the diameter of the Moon.\n  Already you can tell from the maps that the Moon’s diameter must be less than half that of the Earth, but clearly more than one tenth. Let’s see what we get using a rough measurement.\n Below is a (successful) prediction for the occultation of the planet Mars by the Moon on April 17th of last year. The shadow’s motion across the Earth’s surface switched from northward to southward, and I’ve put a dark disk at that point, showing the shadow as it would have been at that moment. This is a particularly easy location in which to interpret the map. You can see the shadow’s northward edge is halfway across Afghanistan, and its southward edge is just north of the equator.\n At right is a calculation, using Google Maps, of the distance between these two points on the Earth. I just eyeballed it, and remember the Earth’s curvature will extend it just a bit, so I really don’t have a right to expect it to be more accurate than 5%. (You’re invited to do it more carefully if you like.) I ended up with about 2200 miles (3600 km.)\n  According to precision studies using modern science, the Moon’s average diameter is 2,159.1 mi (3,474.8 km). So I did indeed come within 5%.\n Now you may complain that I used someone’s predictions to come to this estimate, rather than an actual measurement. But remember, this is a prediction for something that happened in the past; the occultation was widely observed, so if the prediction had been wrong, you would certainly have heard about it. And you always have the option of waiting for future similar events, when at a given moment, astronomers will report whether they have seen the star or planet disappear behind the Moon. If, for an occultation not far from the equator, you compare the northernmost observer to the southernmost observer at that particular moment, you will find the distance between them is quite close to the Moon’s diameter.\n No triangles, no trigonometry. Just timing and location reports from some star-gazers on the right night; that’s all we need.\n  There’s another slightly more complicated way to do this same thing using a solar eclipse, when the Moon blocks the view of the Sun. It’s similar, but interestingly different, because unlike a distant star, which looks like a point from our perspective, the Sun occupies the same amount of sky as does the Moon. Of course the Sun has to be further away, or the eclipse couldn’t occur, so its true size has to be bigger than the Moon. (Whether it’s bigger than the Earth is something we’ll address later.)\n When you look at the shadow of an object cast by a large source of light — for instance, the shadow of a tennis ball cast by a standard-sized light bulb — you’ll see it can have two components if you move the ball close enough. There’s a central shadow, the “umbra”, which is dark. There, the bulb’s light is completely blocked by the ball. Outside that is a region where there’s a faint shadow, the “penumbra”; there the ball only blocks part of the bulb’s light. Try it.\n The trick for an eclipse is the following. Because the Moon and Sun appear similar in size in the sky, the umbra of the Moon’s shadow is a very narrow region, usually only a couple of hundred miles (km) wide. There the Sun is completely blocked and the eclipse is  total: the sky goes pretty dark and the Sun’s enormous outer atmosphere (“corona”) can be seen. The penumbra, where the eclipse is  partial, is much larger, thousands of miles (km) wide. There the Moon incompletely blocks the Sun, and so the sky gets a bit dimmer but the world remains in daylight.\n Now here’s a remarkable fact: the diameter of the Moon is approximately one half of the difference between the diameter of the penumbra and the diameter of the umbra. Since the umbra is much smaller than the penumbra,  the diameter of the Moon is approximately one-half of the diameter of the penumbra.\n  The geometry that makes this true is shown in the figure above  (which is not to scale; it is drawn to make the conceptual ideas easy to understand.) While a distant star’s light rays are essentially parallel by the time they reach Earth, the Sun’s rays can arrive at the Earth from various directions from different parts of the Sun. Only in the umbra — very small because the Sun and Moon appear almost the same size in the sky — can no rays from the Sun reach the Earth; there the eclipse is total. This is indicated by the blue lines, which show that neither the top nor the bottom (as the picture shows them) of the Sun can be seen. Right at the edge of the penumbra, as shown by the red lines, the Sun and Moon would seem barely to touch in the sky. Inside the penumbra, some but not all of the Sun’s rays are blocked by the Moon, and the sky remains bright; there the eclipse is partial, with a crescent Sun that becomes narrower as one approaches the umbra.\n Shown below at left is the path of a famous solar eclipse from 1991; I remember it as a partial eclipse from my graduate years in California, and still regret that I did not find a way down to Baja California to see it as a total eclipse. The umbra’s path across the world is marked in dark blue, the edge of the penumbra by the outermost light blue lines. The red dot at center marks mid-eclipse, which occurs when the Earth’s surface is closest to the Moon; conveniently, the distance from the equator is not large either. This means the Earth’s surface is relatively flat along the 1900UT line (a line of fixed time), and an estimate of its length from midpoint to edge is obtained using Google Maps in the picture at right.\n  This method gives an answer very similar to the last one, and again accurate to better than 5%, which is as much as I’d trust my rather haphazard approach. A dedicated observer could do considerably better. But for a rough estimate, it’s already pretty good!", "posttime": "2022-02-22 00:35:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算,size,月球", "title": "如何自己计算月球的大小", "title_en": "How to figure out the size of the moon yourself", "transed": 1, "url": "https://profmattstrassler.com/2022/02/17/how-to-figure-out-the-size-of-the-moon-yourself/", "via": "", "real_tags": ["计算", "size", "月球"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "辛几何是一种偶数维几何。在最简单的情况下，它是平面R^2的几何，为处理平面向量提供了一个最小的装置。标准内积和正交（tilde）算子是辛内积。这两种产品都可以分配一个平行四边形区域。所以辛几何是一种纯面积几何。它基本上是无坐标和三角的。。。[更多]\n查看项目", "note_en": "Symplectic geometry is an even dimensional geometry. In its simplest possible case it is the geometry of the plane R^2 and offers a minimal apparatus for treating planar vectors. The standard inner   product together with an orthogonal (tilde) operator is the symplectic inner product. Both products can be assigned a parallelogram area. So symplectic geometry is a pure areal type of geometry. It is basically coordinate- and trigonometry-free.  ... [more]\n View project", "posttime": "2022-02-22 00:21:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "辛几何,lines,内积", "title": "二维辛几何——点、线、圆", "title_en": "Symplectic Geometry in 2D – Points, Lines, Circles", "transed": 1, "url": "https://www.researchgate.net/publication/358747081_Symplectic_Geometry_in_2D_-_Points_Lines_Circles", "via": "", "real_tags": ["辛几何", "lines", "内积"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "未读，2022年2月21日，下午9:48:49（3小时前）2月21日 此群的电子邮件地址是匿名的，或者您需要“查看成员电子邮件地址”权限才能查看原始邮件\n安东尼奥·科伦坡转发此文本：", "note_en": "unread, Feb 21, 2022, 9:48:49 PM (3 hours ago)  Feb 21    Either email addresses are anonymous for this group or you need the view member email addresses permission to view the original message\n Forwarding this text from Antonio Colombo:\r   ==================\r   Our friend Sven Guckes died in Berlin on February 20, 2022.\r He was diagnosed with a brain tumor in December 2021.\r He went to a hospital, but surgeons could not do much for him.\r At the end of January he was moved to a Hospice.\r A group of friends has been with him as much as possible during all his\r sickness.\r He died while Pugs, one of his friends, was with him.\r They had just finished a chat, and Sven was smiling, but then he quieted\r down and in a few moments he did not breathe any more.\r   Sven (when he was still a student at the Free University of Berlin) was very\r active in the Vim development team in the Nineties. He was the one who set\r up the  vim.org domain. Later on he had the idea of &#34;What is Vim?&#34;, an\r explanation of Vim in six kilobytes, and helped with some versions of\r Vimtutor.\r   Sven worked (and gave talks) also on a lot of other free software projects,\r let us remember here just &#34;plain&#34; vi and mutt, but there are several\r others. He had friends all over the world, and helped them, for software\r problems and for real life problems in any way he could.\r   Let us recall here just one of his &#34;pet projects&#34;, the mythical\r &#34;alternate.fan.warlord&#34; FAQ, in which appears one of his signatures,\r in newsgroup alt.fan.warlord.\r   Vale, Sven!\r   ==================\r     I met Sven only a couple of times. What I remember most is his never\r ending enthusiasm. He was a good person.\r   I would like to dedicate the upcoming Vim 9.0 release to Sven in his\r memory.\r   Article in German:  https://linuxnews.de/2022/02/sven-guckes-verstorben/  Hacker news:  https://news.ycombinator.com/item?id=30410077    -- \r hundred-and-one symptoms of being an internet addict:\r 91. It&#39;s Saturday afternoon in the middle of May and you\r  are on computer.\r    /// Bram Moolenaar -- Br...@Moolenaar.net --  http://www.Moolenaar.net \\\\\\\r /// \\\\\\\r \\\\\\ sponsor Vim, vote for features --  http://www.Vim.org/sponsor/ ///\r  \\\\\\ help me help AIDS victims --  http://ICCF-Holland.org ///", "posttime": "2022-02-22 00:20:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "献给,dedicated,查看", "title": "Vim 9将献给斯文·古克斯", "title_en": "Vim 9 will be dedicated to Sven Guckes", "transed": 1, "url": "https://groups.google.com/g/vim_announce/c/MJBKVd-xrEE/m/joVNaDgAAgAJ", "via": "", "real_tags": ["献给", "dedicated", "查看"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2022-02-22 00:20:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "慰藉,solace,请求", "title": "量子慰藉与幽灵", "title_en": "The Quantum Solace and Spectre", "transed": 1, "url": "https://blog.cloudflare.com/quantum-solace-and-spectre/", "via": "", "real_tags": ["慰藉", "solace", "请求"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074506, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我之所以创建这个指南，是因为我从来都不太了解Makefiles。他们似乎充斥着隐藏的规则和深奥的符号，问简单的问题并不能得到简单的答案。为了解决这个问题，我花了几个周末坐下来，读了所有关于Makefiles的书。我&#39；我把最重要的知识浓缩到这本指南中。每个主题都有一个简短的描述和一个独立的示例，您可以自己运行。\n如果您主要理解Apple，请考虑查看MaxFoeCooBook，它有一个中等大小的项目的模板，对MaX文件的每个部分做了充分的注释。\n祝你好运，我希望你能够杀掉这个令人困惑的Makefiles世界！\nMakefiles用于帮助决定需要重新编译大型程序的哪些部分。在绝大多数情况下，C或C++文件被编译。其他语言通常有自己的工具，其用途与Make类似。它也可以在程序之外使用，当你需要一系列的指令来运行时，这取决于文件发生了什么变化。本教程将重点介绍C/C++编译用例。\n这里&#39；这是一个可以用Make构建的依赖关系图示例。如果有任何文件&#39；s依赖项更改，则文件将重新编译：\n流行的C/C++替代构建系统有SCons、CMake、Bazel和Ninja。一些代码编辑器，如Microsoft Visual Studio，有自己的内置生成工具。对于Java，有&#39；s Ant，Maven和Gradle。Go和Rust等其他语言都有自己的构建工具。\nPython、Ruby和Javascript等解释语言；不需要模拟来生成文件。Makefiles的目标是根据更改的文件来编译任何需要编译的文件。但是，当解释语言中的文件发生更改时，不需要重新编译任何内容。程序运行时，将使用文件的最新版本。\nMake有多种实现方式，但本指南的大部分内容都适用于任何版本&#39；重复使用。然而，它&#39；它是专门为GNU Make编写的，GNU Make是Linux和MacOS上的标准实现。所有的例子都适用于Make版本3和版本4，除了一些深奥的差异之外，它们几乎是等价的。\n要运行这些示例，您&#39；我需要一个终端和&#34；制作&#34；安装。对于每个示例，将内容放在一个名为Makefile的文件中，并在该目录中运行make命令。让&#39；让我们从最简单的makefile开始：\n那&#39；就这样！如果你&#39；你有点困惑，在这里&#39；这是一个视频，介绍了这些步骤，以及Makefiles的基本结构。\n目标是文件名，用空格分隔。通常，每条规则只有一条。\n这些命令是一系列通常用于生成目标的步骤。它们需要以制表符开始，而不是空格。\n先决条件也是文件名，用空格分隔。在运行目标命令之前，这些文件必须存在。这些也被称为依赖项\n下面的Makefile有三个单独的规则。在终端中运行make blah时，它将通过一系列步骤构建一个名为blah的程序：\n然后运行cc-c命令，因为所有这些都是废话。o依赖项已完成\n等等。抄送废话。o-o废话#跑第三废话。o:废话。等等。等等。o#是第二个废话。c:echo&#34；int main（）{return 0；}&#34; &gt；废话。c#先跑\n这个makefile只有一个目标，叫做some_file。默认目标是第一个目标，因此在本例中，将运行一些_文件。\n这个文件第一次会生成一些_文件，第二次会注意到它&#39；s已经制造，导致制造：&#39；一些文件&#39；是最新的。\n在这里，目标是一些#文件#34；取决于&#34；在另一个文件上。当我们运行make时，将调用默认目标（一些#u文件，因为它是第一个文件）。它将首先查看其依赖项列表，如果其中任何依赖项比较旧，它将首先运行这些依赖项的目标，然后自行运行。第二次运行时，两个目标都不会运行，因为两个目标都存在。\n一些_文件：其他_文件回声#34；这将以秒为单位运行，因为它取决于其他#文件#34；触摸其他文件：echo&#34；这将首先运行&#34；触摸其他文件\n这将始终运行两个目标，因为某些_文件依赖于另一个_文件，而另一个永远不会创建。\nclean通常用作删除其他目标的输出的目标，但它在make中不是一个特殊的词。\n变量只能是字符串。你&#39；我通常希望使用：=，但=也可以。参见变量第2部分。\n文件：=file1 file2一些文件：$（文件）echo&#34；看看这个变量：&#34$（文件）触摸一些文件文件1：触摸文件1文件2：触摸文件2清洁：rm-f文件1文件2一些文件\n制定多个目标，你想让所有目标都运行吗？制定一个全面的目标。\n全部：一二三一：触摸一二：触摸二三：触摸三清洁：rm-f一二三\n当规则有多个目标时，将为每个目标运行命令。$@是一个包含目标名称的自动变量。\n*和%在Make中都被称为通配符，但它们的含义完全不同。*在文件系统中搜索匹配的文件名。我建议您总是将其包装在通配符函数中，否则您可能会陷入下面描述的常见陷阱。\n危险：当*不匹配任何文件时，它保持原样（除非在通配符函数中运行）\n有问题：=*。o#Don和#39；别这样&#39;*&#39; 无法展开正确的内容：=$（通配符*.o）全部：一二三四失败，因为$（出错）是字符串&#34；*。o&#34；第一：$（有错）#保持为*。o如果没有与此模式匹配的文件：（两个：:.o#按照您的预期工作！在本例中，它什么也不做。三：$（正确的东西）#与规则三四相同：$（通配符*.o）\n%是非常有用的，但由于它可以用于多种情况，因此有点令人困惑。\n在&#34中使用时；匹配&#34；模式，它匹配字符串中的一个或多个字符。这场比赛被称为干。\n在&#34中使用时；更换&#34；模式下，它将匹配的词干替换为字符串中的词干。\n嘿：一两个输出&#34；嘿&#34；，因为这是第一个目标echo$@#输出比目标echo$更新的所有先决条件？#输出所有先决条件$^touch hey one:touch one two:touch two clean:rm-f hey one two\n用c语言编译。每一次它表达爱的时候，事情都会变得扑朔迷离。也许Make中最令人困惑的部分是所制定的魔法/自动规则。打这些电话&#34；隐式&#34；规则。我不&#39；我个人不同意这个设计决定，我也不&#39；我不建议使用它们，但它们&#39；我们经常使用，因此了解它们很有用。这里&#39；这是一个隐式规则列表：\n编译C程序：n.o由n.C自动生成，命令格式为$（CC）-C$（CPPFLAGS）$（CFLAGS）\n编译C++程序：N.O由N.CC或N.CPP自动生成，并带有表单$（CXX）-C$（CPPPFLAGS）$（CXFLAGS）的命令。\n链接单个对象文件：n通过运行命令$（CC）$（LDFLAGS）n.o$（LOADLIBES）$（LDLIBS）从n.o自动生成\nLDFLAGS：当编译器应该调用链接器时，给它们的额外标志\n让&#39；让我们看看现在如何构建一个C程序，而不必明确告诉Make如何编译：\nCC=gcc#隐式规则的标志scflags=-g#隐式规则的标志。打开调试信息#隐式规则#1:blah是通过C链接器隐式规则#隐式规则#2:blah构建的。o是通过C编译隐式规则构建的，因为诸如此类。存在等等。哦，废话。c:echo&#34；int main（）{return 0；}&#34; &gt；废话。c清洁：rm-f等等*\n静态模式规则是在Makefile中写得更少的另一种方式，但我&#39；d说它们更有用，但有点少#34；魔法&#34；。这里&#39；这是他们的语法：\n本质上，给定的目标与目标模式匹配（通过%通配符）。匹配的东西叫做茎。然后将stem替换为prereq模式，以生成目标&#39；这是先决条件。\n典型的用例是编译。c文件进入。o文件。这里&#39；这是手动方式：\nobjects=foo。哦，酒吧。哦，好的。o所有：$（对象）#这些文件通过隐式规则foo编译。o:福。c酒吧。o:酒吧。c全部。o:好的。c全部。c:echo&#34；int main（）{return 0；}&#34; &gt；全部的c%。c:touch$@clean:rm-f*。c*。哦，所有\nobjects=foo。哦，酒吧。哦，好的。o所有：$（对象）#这些文件通过隐式规则编译#语法-目标…：目标模式：预请求模式…#对于第一个目标，foo。o、 目标模式与foo匹配。o并设置&#34；茎和#34；34岁；foo&#34；#然后它将替换&#39；%&#39; 在带有干$（对象）的prereq模式中：%。o:%。c全部。c:echo&#34；int main（）{return 0；}&#34; &gt；全部的c%。c:touch$@clean:rm-f*。c*。哦，所有\n在我稍后介绍函数时，我&#39；I’我将为你能用它们做些什么做铺垫。可以在静态模式规则中使用filter函数来匹配正确的文件。在这个例子中，我编写了。生的和生的。结果扩展。\nobj_files=foo。结果栏。哦，输了。osrc_files=foo。生酒吧。c输了。c全部：$（obj_文件）$（过滤器%.o，$（obj_文件））：%。o:%。c echo和#34；目标：$@prereq:$&lt&#34; $（筛选器%.result，$（obj_文件））：%。结果：%。原始回声&#34；目标：$@prereq:$&lt&#34; %.c%。原始：touch$@clean:rm-f$（src_文件）\n模式规则经常被使用，但相当混乱。你可以从两个方面来看待它们：\n#定义一个模式规则，该规则编译每个。c文件转换成一个。o文件%。o:%。c$（CC）-c$（CFLAGS）$（CPPFLAGS）$&lt-o$@\n模式规则包含一个&#39；%&#39; 在目标中。这个&#39；%&#39; 匹配任何非空字符串，其他字符匹配它们自己。“%”在模式的先决条件中，规则代表与目标中“%”匹配的同一个干。\n#定义一个先决条件中没有模式的模式规则。#这只会产生空的。需要时使用c文件。%。c:触摸$@\n很少使用双冒号规则，但允许为同一目标定义多个规则。如果这些是单冒号，则会打印一条警告，并且只会运行第二组命令。\n在命令前添加一个@以阻止打印。您还可以使用-s运行make以在每行之前添加一个@\n每个命令都在一个新的shell中运行（或者至少效果是这样的）\n全部：cd。。#上面的cd不影响此行，因为每个命令都在一个新的shell echo`pwd`中有效地运行#此cd命令影响下一个命令，因为它们在同一行cd上。。；echo`pwd`#与上述cd相同\\echo`pwd`\n运行make时添加-k，即使遇到错误也可以继续运行。如果您想同时查看Make的所有错误，这将非常有用。在命令之前添加一个-Add-i以抑制错误，并为每个命令添加-i以使其发生这种情况。\n第一：#此错误将被打印但忽略，make将继续运行-错误触摸一\n只需注意：如果按住ctrl+c组合键，它将删除刚刚创建的较新目标。\n要递归调用makefile，请使用特殊的$（MAKE）而不是MAKE，因为它将为您传递MAKE标志，并赢得&#39；它本身不会受到它们的影响。\n新内容=&#34；您好：\\n\\t点击内部文件&#34；全部：mkdir-p subdir printf$（新内容）|sed-e&#39；s/^/&#39&gt；subdir/makefile cd subdir&amp&amp$（使）清洁：rm-rf细分\nexport指令接受一个变量，并使子make命令可以访问该变量。在本例中，将导出cooly，以便subdir中的makefile可以使用它。\n注意：export的语法与sh相同，但它们不是&#39；t相关（尽管功能相似）\n新内容=&#34；你好：\\n\\\\techo\\$$（酷）和#34；全部：mkdir-p subdir echo$（新内容）|sed-e&#39；s/^/&#39&gt；subdir/makefile@echo&#34---MAKEFILE内容--&#34；@cd-R&amp&amp；cat makefile@echo&#34---结束MAKEFILE内容--&#34；cd&amp&amp$（MAKE）#注意变量和导出。它们在全球范围内受到影响。cooly=&#34；子目录可以看到我&#34; export cooly#这将使上面的行无效：unexport cooly clean:rm-rf subdir\none=这只在本地工作export two=我们可以使用以下所有命令运行子命令：@echo$（一）@echo$$one@echo$（二）@echo$$two\n.EXPORT_ALL_变量：new_contents=&#34；你好：\\n\\techo\\$$（酷）和#34；cooly=&#34；子目录可以看到我&#34; # 这将使上面的行无效：unexport cooly all:mkdir-p subdir echo$（新内容）|sed-e&#39；s/^/&#39&gt；subdir/makefile@echo&#34---MAKEFILE内容--&#34；@cd-R&amp&amp；cat makefile@echo&#34---结束MAKEFILE内容--&#34；cd&amp&amp$（使）清洁：rm-rf细分\n那里&#39；这是一个很好的选项列表，可以从make运行。检查——试运行，——触摸，——旧文件。\n你可以设定多个目标，例如，让清洁运行测试运行清洁目标，然后运行，然后测试。\n递归（use=）-仅在使用命令时查找变量，而不是在&#39；这是定义。\n简单扩展（使用：=）——就像普通的命令式编程一样——只有到目前为止定义的程序才能被扩展\n#递归变量。这将打印&#34；后来&#34；belowone=one${later_variable}#简单扩展变量。这不会打印&#34；后来&#34；belowtwo:=two${later_variable}later_variable=later all:echo$（一）echo$（二）\n简单扩展（使用：=）允许您附加到变量。递归定义将产生无限循环错误。\none=hello#one被定义为一个简单的扩展变量（：=），因此可以处理appendingone:=${one}那里all:echo$（one）\n一个=你好吗？=不会是第二集吗？=将全部设置为：echo$（一个）echo$（两个）\n线条末端的空间不会被剥离，但开头的空间会被剥离。要使用单个空格生成变量，请使用$（nullstring）\nwith_spaces=hello#with_spaces在&#34之后有许多空格；你好&#34；after=$（带_空格）therenullstring=space=$（nullstring）#用一个空格生成一个变量。全部：echo&#34$（之后）和#34；回声启动&#34$（空间）和#34；终止\n字符串替换也是修改变量的一种非常常见和有用的方法。还可以查看文本函数和文件名函数。\n可以通过使用override覆盖来自命令行的变量。这里我们运行了make with make option_one=hi\n#Overrides命令行参数override option_one=did#override#not override命令行参数option_two=not_override all:echo$（option_one）echo$（option_two）\n&#34;定义&#34；实际上只是一个命令列表。它与函数无关。注意这里是&#39；这与在命令之间使用分号有点不同，因为正如预期的那样，每个命令都在单独的shell中运行。\n一个=出口废话=&#34；我被安排好了&#34;; echo$$blah define two export blah=setecho$$blah endef#一和二是不同的。全部：@echo&#34；这张照片&#39；我被设定为&#39&#34;@echo&#34；这不打印&#39；我被设定为&#39；因为每个命令都在一个单独的shell中运行#34；@$（两个）\nnullstring=foo=$（nullstring）#行尾；这里有一个空间：ifeq（$（strip$（foo）），）echo&#34；脱光衣服后，foo是空的&#34；endif ifeq（$（空字符串），）echo&#34；空字符串不&#39；甚至没有空间&#34；恩迪夫\nifdef不展开变量引用；它只是看看是否有什么定义\nbar=foo=$（bar）all:ifdef foo echo&#34；foo的定义是&#34；endif ifdef bar echo&#34；但酒吧不是&#34；恩迪夫\n此示例演示如何使用findstring和MAKEFLAGS测试make标志。用make-i运行这个例子，看它打印出echo语句。\nbar=foo=$（bar）all:#搜索&#34-我&#34；旗帜MAKEFLAGS只是单个字符的列表，每个标记一个字符。因此，寻找&#34；我&#34；在这种情况下。ifneq（，$（findstring i，$（MAKEFLAGS）））echo和#34；我被传给MAKEFLAGS&#34；恩迪夫\n函数主要用于文本处理。使用$（fn，参数）或${fn，参数}调用函数。您可以使用call builtin功能自行创建。Make有相当多的内置功能。\n逗号：=，空：=空格：=$（空）$（空）foo:=abcbar:=$（subst$（空格），$（逗号），$（foo））全部：@echo$（条）\n在第一个参数之后的参数中不要包含空格。这将被视为字符串的一部分。\n逗号：=，空：=空格：=$（空）$（空）foo:=abcbar:=$（subst$（空格），$（逗号），$（foo））全部：#输出为&#34；，a，b，c&#34；。注意@echo$（条形）中引入的空格\n&#34;在匹配模式的文本中查找空格分隔的单词，并将其替换为替换。在这里，模式可能包含一个“%”作为通配符，匹配一个单词中任意数量的字符。如果替换还包含“%”，则“%”将被模式中与“%”匹配的文本替换。只有模式和替换中的第一个“%”被这样处理；任何后续“%”都将保持不变&#34; （GNU文档）\n那里&#39；这是另一个只替换后缀的缩写：$（text:suffix=replacement）。此处未使用%通配符。\n注：唐和#39；不要为这个速记增加额外的空格。它将被视为搜索或替换术语。\nfoo:=a.o b.o l.a c.oone:=$（patsubst%.o，%.c，$（foo））#这是上述两种语言的简写形式：=$（foo:%.o=%.c）#这是唯一的后缀简写形式，也相当于上述两种语言。三：=$（foo:.o=.c）全部：echo$（一）echo$（二）echo$（三）\nforeach函数如下所示：$（foreach变量、列表、文本）。它将一个单词列表（用空格分隔）转换为另一个。var被设置为列表中的每个单词，文本被展开为每个单词。这会在每个单词后附加一个感叹号：\nfoo:=你是谁#每个#34；单词&#34；在foo中，在后面加一个感叹号：=$（foreach wrd，$（foo），$（wrd）！）全部：#输出为&#34；谁是你&#34;@echo$（巴）\nif检查第一个参数是否为非空。如果是，则运行第二个参数，否则运行第三个参数。\nMake支持创建基本函数。你&#34；定义&#34；该函数只需创建一个变量，但使用参数$（0），$（1）等。然后使用特殊调用函数调用该函数。语法是$（call variable，param，param）$（0）是变量，而$（1），$（2）等是参数。\nsweet_new_fn=变量名：$（0）第一个：$（1）第二个：$（2）空变量：$（3）所有：#输出和#34；变量名：sweet_new_fn First:go Second:tigers空变量：&#34；@echo$（呼叫sweet_new_fn，加油，老虎队）\ninclude指令告诉make读取一个或多个其他makefile。它&#39；makefile makefile中的一行如下所示：\n当使用编译器标志（如-M）基于源代码创建makefile时，这一点尤其有用。例如，如果一些c文件包含一个头文件，该头文件将被添加到一个生成文件中，该文件为&#39；这是gcc写的。我在Makefile烹饪书中详细讨论了这一点\n使用vpath指定某些先决条件集存在的位置。格式为vpath&lt；模式&gt&书信电报；目录，空格/冒号分隔&gt&书信电报；模式&gt；可以有一个%匹配任何零个或多个字符。您还可以使用变量VPATH全局执行此操作\nvpath%。h/标题/其他目录一些二进制文件：/标题之类的。触摸一些二进制文件/标题：mkdir/标题之类的。h:触摸/标题/诸如此类。h清洁：rm-rf/头文件rm-f一些二进制文件\n反斜杠（&#34；\\&#34；）字符使我们能够在命令过长时使用多行\nsome_file:echo这行太长，所以被分成多行\n添加。假冒目标将防止make将假冒目标与文件名混淆。在本例中，如果文件clean是c\n......", "note_en": "I built this guide because I could never quite wrap my head around Makefiles. They seemed awash with hidden rules and esoteric symbols, and asking simple questions didn’t yield simple answers. To solve this, I sat down for several weekends and read everything I could about Makefiles. I&#39;ve condensed the most critical knowledge into this guide. Each topic has a brief description and a self contained example that you can run yourself.\n If you mostly understand Make, consider checking out the Makefile Cookbook, which has a template for medium sized projects with ample comments about what each part of the Makefile is doing.\n Good luck, and I hope you are able to slay the confusing world of Makefiles!\n   Makefiles are used to help decide which parts of a large program need to be recompiled. In the vast majority of cases, C or C++ files are compiled. Other languages typically have their own tools that serve a similar purpose as Make. It can be used beyond programs too, when you need a series of instructions to run depending on what files have changed. This tutorial will focus on the C/C++ compilation use case.\n Here&#39;s an example dependency graph that you might build with Make. If any file&#39;s dependencies changes, then the file will get recompiled:\n   Popular C/C++ alternative build systems are  SCons,  CMake,  Bazel, and  Ninja. Some code editors like  Microsoft Visual Studio have their own built in build tools. For Java, there&#39;s  Ant,  Maven, and  Gradle. Other languages like Go and Rust have their own build tools.\n Interpreted languages like Python, Ruby, and Javascript don&#39;t require an analogue to Makefiles. The goal of Makefiles is to compile whatever files need to be compiled, based on what files have changed. But when files in interpreted languages change, nothing needs to get recompiled. When the program runs, the most recent version of the file is used.\n  There are a variety of implementations of Make, but most of this guide will work on whatever version you&#39;re using. However, it&#39;s specifically written for GNU Make, which is the standard implementation on Linux and MacOS. All the examples work for Make versions 3 and 4, which are nearly equivalent other than some esoteric differences.\n  To run these examples, you&#39;ll need a terminal and &#34;make&#34; installed. For each example, put the contents in a file called  Makefile, and in that directory run the command  make. Let&#39;s start with the simplest of Makefiles:\n    That&#39;s it! If you&#39;re a bit confused, here&#39;s a video that goes through these steps, along with describing the basic structure of Makefiles.\n     The  targets are file names, separated by spaces. Typically, there is only one per rule.\n The  commands are a series of steps typically used to make the target(s). These  need to start with a tab character, not spaces.\n The  prerequisites are also file names, separated by spaces. These files need to exist before the commands for the target are run. These are also called  dependencies\n  The following Makefile has three separate  rules. When you run  make blah in the terminal, it will build a program called  blah in a series of steps:\n The  cc -c command is then run, because all of the  blah.o dependencies are finished\n blah: blah.o\tcc blah.o -o blah  # Runs third blah.o: blah.c\tcc -c blah.c -o blah.o  # Runs second blah.c:\techo  &#34;int main() { return 0; }&#34; &gt; blah.c  # Runs first\n This makefile has a single target, called  some_file. The default target is the first target, so in this case  some_file will run.\n  This file will make  some_file the first time, and the second time notice it&#39;s already made, resulting in  make: &#39;some_file&#39; is up to date.\n  Here, the target  some_file &#34;depends&#34; on  other_file. When we run  make, the default target ( some_file, since it&#39;s first) will get called. It will first look at its list of  dependencies, and if any of them are older, it will first run the targets for those dependencies, and then run itself. The second time this is run, neither target will run because both targets exist.\n some_file: other_file\techo  &#34;This will run second, because it depends on other_file&#34;\ttouch some_file other_file:\techo  &#34;This will run first&#34;\ttouch other_file\n This will always run both targets, because  some_file depends on other_file, which is never created.\n  clean is often used as a target that removes the output of other targets, but it is not a special word in  make.\n   Variables can only be strings. You&#39;ll typically want to use  :=, but  = also works. See  Variables Pt 2.\n  files := file1 file2 some_file:  $(files)\techo  &#34;Look at this variable: &#34;  $(files)\ttouch some_file file1:\ttouch file1 file2:\ttouch file2 clean:\trm -f file1 file2 some_file\n     Making multiple targets and you want all of them to run? Make an  all target.\n all: one two three one:\ttouch one two:\ttouch two three:\ttouch three clean:\trm -f one two three\n  When there are multiple targets for a rule, the commands will be run for each target  $@ is an  automatic variable that contains the target name.\n    Both  * and  % are called wildcards in Make, but they mean entirely different things.  * searches your filesystem for matching filenames. I suggest that you always wrap it in the  wildcard function, because otherwise you may fall into a common pitfall described below.\n    Danger: When  * matches no files, it is left as it is (unless run in the  wildcard function)\n thing_wrong := *.o  # Don&#39;t do this! &#39;*&#39; will not get expandedthing_right :=  $( wildcard *.o) all: one two three four # Fails, because $(thing_wrong) is the string &#34;*.o&#34; one:  $(thing_wrong) # Stays as *.o if there are no files that match this pattern :( two: *.o  # Works as you would expect! In this case, it does nothing. three:  $(thing_right) # Same as rule three four: $(wildcard *.o)\n  % is really useful, but is somewhat confusing because of the variety of situations it can be used in.\n When used in &#34;matching&#34; mode, it matches one or more characters in a string. This match is called the stem.\n When used in &#34;replacing&#34; mode, it takes the stem that was matched and replaces that in a string.\n     hey: one two\t # Outputs &#34;hey&#34;, since this is the first target\techo  $@\t # Outputs all prerequisites newer than the target\techo  $?\t # Outputs all prerequisites\techo  $^\ttouch hey one:\ttouch one two:\ttouch two clean:\trm -f hey one two\n   Make loves c compilation. And every time it expresses its love, things get confusing. Perhaps the most confusing part of Make is the magic/automatic rules that are made. Make calls these &#34;implicit&#34; rules. I don&#39;t personally agree with this design decision, and I don&#39;t recommend using them, but they&#39;re often used and are thus useful to know. Here&#39;s a list of implicit rules:\n Compiling a C program:  n.o is made automatically from  n.c with a command of the form  $(CC) -c $(CPPFLAGS) $(CFLAGS)\n Compiling a C++ program:  n.o is made automatically from  n.cc or  n.cpp with a command of the form  $(CXX) -c $(CPPFLAGS) $(CXXFLAGS)\n Linking a single object file:  n is made automatically from  n.o by running the command  $(CC) $(LDFLAGS) n.o $(LOADLIBES) $(LDLIBS)\n  LDFLAGS: Extra flags to give to compilers when they are supposed to invoke the linker\n Let&#39;s see how we can now build a C program without ever explicitly telling Make how to do the compililation:\n CC = gcc  # Flag for implicit rulesCFLAGS = -g  # Flag for implicit rules. Turn on debug info # Implicit rule #1: blah is built via the C linker implicit rule # Implicit rule #2: blah.o is built via the C compilation implicit rule, because blah.c exists blah: blah.o blah.c:\techo  &#34;int main() { return 0; }&#34; &gt; blah.c clean:\trm -f blah*\n  Static pattern rules are another way to write less in a Makefile, but I&#39;d say are more useful and a bit less &#34;magic&#34;. Here&#39;s their syntax:\n  The essence is that the given  target is matched by the  target-pattern (via a  % wildcard). Whatever was matched is called the  stem. The stem is then substituted into the  prereq-pattern, to generate the target&#39;s prereqs.\n A typical use case is to compile  .c files into  .o files. Here&#39;s the  manual way:\n objects = foo.o bar.o all.o all:  $(objects) # These files compile via implicit rules foo.o: foo.c bar.o: bar.c all.o: all.c all.c:\techo  &#34;int main() { return 0; }&#34; &gt; all.c %.c:\ttouch  $@ clean:\trm -f *.c *.o all\n  objects = foo.o bar.o all.o all:  $(objects) # These files compile via implicit rules # Syntax - targets ...: target-pattern: prereq-patterns ... # In the case of the first target, foo.o, the target-pattern matches foo.o and sets the &#34;stem&#34; to be &#34;foo&#34;. # It then replaces the &#39;%&#39; in prereq-patterns with that stem $(objects): %.o: %.c all.c:\techo  &#34;int main() { return 0; }&#34; &gt; all.c %.c:\ttouch  $@ clean:\trm -f *.c *.o all\n  While I introduce functions later on, I&#39;ll foreshadow what you can do with them. The  filter function can be used in Static pattern rules to match the correct files. In this example, I made up the  .raw and  .result extensions.\n obj_files = foo.result bar.o lose.osrc_files = foo.raw bar.c lose.c  all:  $(obj_files) $( filter %.o, $(obj_files)): %.o: %.c\techo  &#34;target:  $@ prereq:  $&lt;&#34; $( filter %.result, $(obj_files)): %.result: %.raw\techo  &#34;target:  $@ prereq:  $&lt;&#34; %.c %.raw:\ttouch  $@ clean:\trm -f  $(src_files)\n  Pattern rules are often used but quite confusing. You can look at them as two ways:\n   # Define a pattern rule that compiles every .c file into a .o file%.o : %.c\t\t $(CC) -c  $(CFLAGS)  $(CPPFLAGS)  $&lt; -o  $@\n Pattern rules contain a &#39;%&#39; in the target. This &#39;%&#39; matches any nonempty string, and the other characters match themselves. ‘%’ in a prerequisite of a pattern rule stands for the same stem that was matched by the ‘%’ in the target.\n  # Define a pattern rule that has no pattern in the prerequisites. # This just creates empty .c files when needed. %.c: touch  $@\n  Double-Colon Rules are rarely used, but allow multiple rules to be defined for the same target. If these were single colons, a warning would be printed and only the second set of commands would run.\n    Add an  @ before a command to stop it from being printed You can also run make with  -s to add an  @ before each line\n   Each command is run in a new shell (or at least the effect is as such)\n all: \tcd ..\t # The cd above does not affect this line, because each command is effectively run in a new shell\techo `pwd`\t # This cd command affects the next because they are on the same line\tcd ..;echo `pwd`\t # Same as above\tcd ..; \\\techo `pwd`\n     Add  -k when running make to continue running even in the face of errors. Helpful if you want to see all the errors of Make at once. Add a  - before a command to suppress the error Add  -i to make to have this happen for every command.\n one:\t # This error will be printed but ignored, and make will continue to run\t-false\ttouch one\n  Note only: If you  ctrl+c make, it will delete the newer targets it just made.\n  To recursively call a makefile, use the special  $(MAKE) instead of  make because it will pass the make flags for you and won&#39;t itself be affected by them.\n new_contents =  &#34;hello:\\n\\ttouch inside_file&#34; all:\tmkdir -p subdir\tprintf  $(new_contents) | sed -e &#39;s/^ //&#39; &gt; subdir/makefile\tcd subdir &amp;&amp;  $(MAKE) clean:\trm -rf subdir\n  The export directive takes a variable and makes it accessible to sub-make commands. In this example,  cooly is exported such that the makefile in subdir can use it.\n Note: export has the same syntax as sh, but they aren&#39;t related (although similar in function)\n new_contents =  &#34;hello:\\n\\\\techo \\$ $(cooly)&#34; all:\tmkdir -p subdir\techo  $(new_contents) | sed -e &#39;s/^ //&#39; &gt; subdir/makefile\t@echo  &#34;---MAKEFILE CONTENTS---&#34;\t@cd subdir &amp;&amp; cat makefile\t@echo  &#34;---END MAKEFILE CONTENTS---&#34;\tcd subdir &amp;&amp;  $(MAKE) # Note that variables and exports. They are set/affected globally.cooly =  &#34;The subdirectory can see me!&#34; export cooly # This would nullify the line above: unexport cooly clean:\trm -rf subdir\n  one=this will only work locally export two=we can run subcommands with this all: \t@echo  $(one)\t@echo $$one\t@echo  $(two)\t@echo $$two\n  .EXPORT_ALL_VARIABLES:new_contents =  &#34;hello:\\n\\techo \\$ $(cooly)&#34;cooly =  &#34;The subdirectory can see me!&#34; # This would nullify the line above: unexport cooly all:\tmkdir -p subdir\techo  $(new_contents) | sed -e &#39;s/^ //&#39; &gt; subdir/makefile\t@echo  &#34;---MAKEFILE CONTENTS---&#34;\t@cd subdir &amp;&amp; cat makefile\t@echo  &#34;---END MAKEFILE CONTENTS---&#34;\tcd subdir &amp;&amp;  $(MAKE) clean:\trm -rf subdir\n  There&#39;s a nice  list of options that can be run from make. Check out  --dry-run,  --touch,  --old-file.\n You can have multiple targets to make, i.e.  make clean run test runs the  clean goal, then  run, and then  test.\n    recursive (use  =) - only looks for the variables when the command is  used, not when it&#39;s  defined.\n simply expanded (use  :=) - like normal imperative programming -- only those defined so far get expanded\n # Recursive variable. This will print &#34;later&#34; belowone = one ${later_variable} # Simply expanded variable. This will not print &#34;later&#34; belowtwo := two ${later_variable}later_variable = later all: \techo  $(one)\techo  $(two)\n Simply expanded (using  :=) allows you to append to a variable. Recursive definitions will give an infinite loop error.\n one = hello # one gets defined as a simply expanded variable (:=) and thus can handle appendingone := ${one} there all: \techo  $(one)\n  one = helloone ?= will not be settwo ?= will be set all: \techo  $(one)\techo  $(two)\n Spaces at the end of a line are not stripped, but those at the start are. To make a variable with a single space, use  $(nullstring)\n with_spaces = hello  # with_spaces has many spaces after &#34;hello&#34;after =  $(with_spaces)therenullstring =space =  $(nullstring)  # Make a variable with a single space. all: \techo  &#34; $(after)&#34;\techo start &#34; $(space)&#34;end\n     String Substitution is also a really common and useful way to modify variables. Also check out  Text Functions and  Filename Functions.\n  You can override variables that come from the command line by using  override.Here we ran make with  make option_one=hi\n # Overrides command line arguments override option_one = did_override # Does not override command line argumentsoption_two = not_override all: \techo  $(option_one)\techo  $(option_two)\n  &#34;define&#34; is actually just a list of commands. It has nothing to do with being a function.Note here that it&#39;s a bit different than having a semi-colon between commands, because each is runin a separate shell, as expected.\n one =  export blah= &#34;I was set!&#34;; echo $$blah define two export blah=setecho $$blah endef # One and two are different. all: \t@echo  &#34;This prints &#39;I was set&#39;&#34;\t@ $(one)\t@echo  &#34;This does not print &#39;I was set&#39; because each command runs in a separate shell&#34;\t@ $(two)\n           nullstring =foo =  $(nullstring)  # end of line; there is a space here all: ifeq ( $( strip  $(foo)),)\techo  &#34;foo is empty after being stripped&#34; endif ifeq ( $(nullstring),)\techo  &#34;nullstring doesn&#39;t even have spaces&#34; endif\n  ifdef does not expand variable references; it just sees if something is defined at all\n bar =foo =  $(bar) all: ifdef foo\techo  &#34;foo is defined&#34; endif ifdef bar\techo  &#34;but bar is not&#34; endif\n  This example shows you how to test make flags with  findstring and  MAKEFLAGS. Run this example with  make -i to see it print out the echo statement.\n bar =foo =  $(bar) all: # Search for the &#34;-i&#34; flag. MAKEFLAGS is just a list of single characters, one per flag. So look for &#34;i&#34; in this case. ifneq (, $( findstring i,  $(MAKEFLAGS)))\techo  &#34;i was passed to MAKEFLAGS&#34; endif\n   Functions are mainly just for text processing. Call functions with  $(fn, arguments) or  ${fn, arguments}. You can make your own using the  call builtin function. Make has a decent amount of  builtin functions.\n   comma := ,empty:=space :=  $(empty)  $(empty)foo := a b cbar :=  $( subst  $(space), $(comma), $(foo)) all: \t@echo  $(bar)\n Do NOT include spaces in the arguments after the first. That will be seen as part of the string.\n comma := ,empty:=space :=  $(empty)  $(empty)foo := a b cbar :=  $( subst  $(space),  $(comma) ,  $(foo)) all: \t # Output is &#34;, a , b , c&#34;. Notice the spaces introduced\t@echo  $(bar)\n   &#34;Finds whitespace-separated words in text that match pattern and replaces them with replacement. Here pattern may contain a ‘%’ which acts as a wildcard, matching any number of any characters within a word. If replacement also contains a ‘%’, the ‘%’ is replaced by the text that matched the ‘%’ in pattern. Only the first ‘%’ in the pattern and replacement is treated this way; any subsequent ‘%’ is unchanged.&#34; ( GNU docs)\n  There&#39;s another shorthand that that replaces only suffixes:  $(text:suffix=replacement). No  % wildcard is used here.\n Note: don&#39;t add extra spaces for this shorthand. It will be seen as a search or replacement term.\n foo := a.o b.o l.a c.oone :=  $( patsubst %.o,%.c, $(foo)) # This is a shorthand for the abovetwo := $(foo:%.o=%.c) # This is the suffix-only shorthand, and is also equivalent to the above.three := $(foo:.o=.c) all:\techo  $(one)\techo  $(two)\techo  $(three)\n  The foreach function looks like this:  $(foreach var,list,text). It converts one list of words (separated by spaces) to another.  var is set to each word in list, and  text is expanded for each word. This appends an exclamation after each word:\n foo := who are you # For each &#34;word&#34; in foo, output that same word with an exclamation afterbar :=  $( foreach wrd, $(foo), $(wrd)!) all:\t # Output is &#34;who! are! you!&#34;\t@echo  $(bar)\n  if checks if the first argument is nonempty. If so runs the second argument, otherwise runs the third.\n   Make supports creating basic functions. You &#34;define&#34; the function just by creating a variable, but use the parameters  $(0),  $(1), etc. You then call the function with the special  call function. The syntax is  $(call variable,param,param).  $(0) is the variable, while  $(1),  $(2), etc. are the params.\n sweet_new_fn = Variable Name: $(0) First: $(1) Second: $(2) Empty Variable: $(3) all:\t # Outputs &#34;Variable Name: sweet_new_fn First: go Second: tigers Empty Variable:&#34;\t@echo  $( call sweet_new_fn, go, tigers)\n      The include directive tells make to read one or more other makefiles. It&#39;s a line in the makefile makefile that looks like this:\n  This is particularly useful when you use compiler flags like  -M that create Makefiles based on the source. For example, if some c files includes a header, that header will be added to a Makefile that&#39;s written by gcc. I talk about this more in the  Makefile Cookbook\n  Use vpath to specify where some set of prerequisites exist. The format is  vpath &lt;pattern&gt; &lt;directories, space/colon separated&gt;  &lt;pattern&gt; can have a  %, which matches any zero or more characters. You can also do this globallyish with the variable VPATH\n vpath %.h ../headers ../other-directory some_binary: ../headers blah.h\ttouch some_binary ../headers:\tmkdir ../headers blah.h:\ttouch ../headers/blah.h clean:\trm -rf ../headers\trm -f some_binary\n  The backslash (&#34;\\&#34;) character gives us the ability to use multiple lines when the commands are too long\n some_file: \techo This line is too long, so \\\t\tit is broken up into multiple lines\n  Adding  .PHONY to a target will prevent make from confusing the phony target with a file name. In this example, if the file  clean is c\n......", "posttime": "2022-02-22 00:00:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "例子,makefiles,文件", "title": "用最美味的例子学习Makefiles", "title_en": "Learn Makefiles with the Tastiest Examples", "transed": 1, "url": "https://makefiletutorial.com/", "via": "", "real_tags": ["例子", "makefiles", "文件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074505, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去十年中，加利福尼亚州的人口增长速度是房屋数量的三倍，使该州深陷住房危机。2019年，当时的奥克兰市议会主席丽贝卡·卡普兰（Rebecca Kaplan）提出了一项解决这一问题的计划：用游轮收容该市4000名缺乏住房的人中的1000人。卡普兰的计划听起来很不寻常，但在湾区却很常见。2017，一位旧金山技术企业家对无家可归的人提出了贬低性的评论，他建议改用游轮来容纳500人。2016，也在旧金山，前市长Art Agnos提出了类似的计划，但与航空母舰。卡普兰的想法和其他人一样，从未走出干船坞：该市的港口表示，这个想法是站不住脚的。\n然而，随着疫情的持续，邮轮行业急剧崩溃——短短几年内就有数十艘邮轮驶向垃圾场——重新引发了关于如何处理失业邮轮的讨论。\n尽管港口认为该计划不现实，但专家们表示，将游轮改造成经济适用房的想法很有趣。有很多很好的理由，我们可能要考虑它，即使所有的细节还没有整理出来。\n总部位于华盛顿特区的建筑公司CallisonRTKL调查了将旧船改造成包括经济适用房在内的住房的想法，甚至对佛罗里达州362名不同社会经济背景的成年人进行了调查。他们发现，44%的受访者表示他们有兴趣住在改装过的游轮上，另有44%的人表示可能。一般来说，41岁至51岁的单身人士的支持率最高，他们的年收入至少为10万美元。\n这一想法的另一位倡导者、加利福尼亚州的建筑师克里斯·克雷克（Chris Craiker）表示，他受到该州住房危机的刺激，开始探索如何改造游轮，并就此撰写了一篇文章，阐述了自己的愿景。\n克雷克说，最适合翻修的是5到10年的船只。但即使是这些相对现代的船只也需要一些工作，才能把狭窄的邮轮舱变成你想称之为家的东西。\n克雷克说：“我的意见是，这些设施主要用于为工薪家庭提供住房。”。但他指出，寻求海边适航生活的退休人员也可能是候选人。“你可能最终会把两三套公寓组合在一起，使它们成为带有睡眠设施和厨房的公寓，当然还有浴室等。”\n克雷克说，一旦内部进行了大修，这艘船也将需要公用设施。大多数已经有了互联网，在业内，将游轮连接到城市电网（如世界上最大的房车）的做法越来越普遍。克雷克说，邮轮可以加装太阳能电池板。但他补充说，污水和供水将需要清理。\n很难说用这种方式翻新一艘游轮需要多少钱，因为从来没有人这么做过。然而，在2019年的一次特别大而彻底的翻修中，皇家加勒比支付了1.15亿美元，对拥有4000间客房的海上航行器进行了大修。相比之下，在内陆的艾伯塔省同时建造一栋240单元的新高层建筑的成本略高于4000万美元。根据Craiker的说法，翻新一艘船可能比建造一座新公寓更便宜，但有很多因素需要考虑。\n德国自然与生物多样性保护联盟（Nature and Biological Conservation Union）的运输政策官员克里斯蒂安·科普（Christian Kopp）表示，这种做法背后也有一个环境理由。在全球范围内，海运占所有碳排放量的2.5%。科普说，邮轮只产生这些排放的一小部分，但“特别是与经济上更重要的集装箱船相比”，它们的必要性值得怀疑。\n世界上的游轮舰队似乎不太可能被改造成住宅，但如果为这些船只提供替代用途，有助于引导一些人提前退休，这可能会带来一系列环境效益。科普指出，游轮也带来了一系列其他问题。大多数使用重质燃料，其含硫量可达汽车柴油的3500倍。它们还会产生大量噪音污染，给海洋野生动物带来压力。如果将这些问题定位为公寓楼，许多问题都可以得到解决。\nElizabeth English是安大略滑铁卢大学的建筑师，也是浮力基金项目的创始人，他研究两栖住宅作为应对海平面上升的方法，他说这一想法还有其他潜在的好处。她说，当洪水或飓风袭击沿海城市时，可以部署一艘改装的邮轮作为临时应急住房。English指出，作为船只的游轮能够抵御一些沿海城市正在努力应对的洪水。\n她说：“它们自然适应海平面上升。这对它们来说不是问题。”。“也许他们可以对付那些因海平面上升而流离失所的人。”\n港口城市是否会走上这条道路仍有待观察。克雷克至少有些乐观。“这可能非常、非常可行，”他说。“找到船和港口：这是一个挑战。”\n引用这篇文章：", "note_en": "Over the past decade, the number of people in California has grown  three times faster than the number of homes, throwing the state deep into a housing crisis. In 2019, Rebecca Kaplan, Oakland’s city council president at the time, floated a plan to address the issue: using a  cruise ship to shelter 1,000 of the city’s 4,000 people who lacked housing. Unusual as it sounds, Kaplan’s scheme was a familiar one in the Bay Area. In 2017, a San Francisco tech entrepreneur who has made disparaging comments about houseless people proposed converting a cruise ship to lodge 500 people. In 2016, also in San Francisco, former mayor Art Agnos put forth a similar scheme but with  an aircraft carrier. Kaplan’s idea—like the others—never got out of dry dock: the city’s port said the idea was untenable.\n Yet the sharp collapse of the cruise industry with the ongoing pandemic— which has seen dozens of ships head for the scrapyard in just a few years—has revitalized the discussion of what to do with out-of-work cruise ships.\n However unrealistic the port thought the scheme, experts say the  idea of converting cruise ships into affordable housing is an interesting one. There are a lot of good reasons why we might want to consider it—even if all the details haven’t been sorted out just yet.\n Washington, DC–based architecture company CallisonRTKL has investigated the idea of turning old ships into housing—including affordable housing—and even  surveyed 362 adults of different socioeconomic backgrounds in Florida about it. They found that 44 percent of respondents said they would be interested in living on a converted cruise ship, while an additional 44 percent said maybe. Generally, support was highest in single people between the ages of 41 and 51 who make at least US $100,000 per year.\n Another advocate for the idea, California-based architect Chris Craiker, says he was spurred by the state’s housing crisis to explore what it would take to retrofit a cruise ship, and  penned an article about it laying out his vision.\n The best candidates for renovation, Craiker says, are ships between five and 10 years old. But even these relatively modern ships would require some work to turn cramped cruise cabins into something you’d want to call home.\n “My opinion is these would mostly be used for housing working families,” Craiker says. But retirees looking for seaside—seaworthy—living are also likely candidates, he notes. “You’d probably end up combining two or three units together to make them into apartments with sleeping facilities and kitchens, and of course bathrooms and such.”\n Once the inside is overhauled, Craiker says, the ship will also need utilities. Most already have internet, and it’s becoming increasingly common within the industry to  connect a cruise ship to a city’s power grid like the world’s largest RV. Cruise ships could be retrofitted with solar panels, Craiker says. But sewage and water supply would need to be sorted out, he adds.\n It’s hard to say how much renovating a cruise ship in this way would cost, simply because no one has ever done it. In one particularly large and thorough renovation in 2019, however,  Royal Caribbean paid $115-million to overhaul the 4,000-room  Navigator of the Seas. For comparison, building a new 240-unit high-rise in landlocked Alberta at the same time cost a little over  $40-million. According to Craiker, it’s possible that renovating a ship could be cheaper per unit than building a new apartment complex, but there are a lot of factors to consider.\n According to Christian Kopp, a transport policy officer with the Nature and Biodiversity Conservation Union, a German environmental organization that regularly studies the cruise industry, there is also an environmental rationale behind the approach. Globally, shipping accounts for 2.5 percent of all carbon emissions. Cruise ships only produce a small part of those emissions, says Kopp, but “especially compared to the more economically important container ships,” their necessity is questionable.\n It seems unlikely that the world’s cruise ship fleet will be converted into homes, but if providing an alternate use for these ships helps usher a few into early retirement, it could have a range of environmental benefits. Kopp notes that cruise ships bring a slew of other issues as well. Most use heavy fuel, which can contain up to  3,500 times more sulfur than automobile diesel. They also produce substantial noise pollution that can stress marine wildlife. Many of these issues could be resolved if they were anchored as apartment buildings.\n Elizabeth English, an architect at the University of Waterloo in Ontario and founder of the Buoyant Foundation Project, who studies amphibious homes as a way to deal with sea level rise, says the idea has some other potential benefits as well. When a flood or hurricane hits a coastal city, she says, a converted cruise liner could be deployed as temporary emergency housing. English notes that cruise ships, being boats, are resistant to the flooding that some coastal cities are grappling with.\n “They accommodate sea level rise by nature. That’s not an issue for them,” she says. “Maybe they could take on the people who are displaced by sea level rise.”\n Whether port cities will embark down this path remains to be seen. Craiker, for one, is at least somewhat optimistic. “It could be very, very doable,” he says. “Finding the ship and finding the port: that’s the challenge.”\n  Cite this Article: \r Doug Johnson “Would You Live on a Cruise Ship?,”  Hakai Magazine, Feb 16, 2022, accessed February 18th, 2022,  https://hakaimagazine.com/news/would-you-live-on-a-cruise-ship/.", "posttime": "2022-02-21 23:57:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游轮,cruise", "title": "你会住在游轮上吗？", "title_en": "Would You Live on a Cruise Ship?", "transed": 1, "url": "https://hakaimagazine.com/news/would-you-live-on-a-cruise-ship/", "via": "", "real_tags": ["游轮", "cruise"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（CNN）由前总统唐纳德·特朗普支持的另一个社交媒体平台于周一上线，可在Apple&#39上下载；s应用商店——但目前对该服务的访问似乎有限。\n这项服务是一款类似Twitter（TWTR）的应用程序，名为Truth Social，由特朗普媒体和技术集团（Trump Media and Technology Group）所有，该集团是特朗普离开白宫后创办的媒体公司。\n周一早上下载该应用程序的用户收到一条信息，邀请他们注册该服务，但注册过程以等待名单结束，以访问该平台，该平台已经增长到超过15万。\n应用程序&#39；特朗普在应用商店的首次亮相表明，特朗普在1月6日国会大厦暴乱后被多个主流平台（包括Facebook、Twitter和YouTube）停职一年后，正试图强行重返社交媒体。\n上周，特朗普&#39；奥巴马的儿子小唐纳德在推特上发了一条似乎是前总统的消息&#39；这是第一篇关于社会真相的帖子。\n&#34;准备好！你最喜欢的总统很快就会见到你&#34; 读一下老特朗普&#39；这是我的信息。平台上的帖子被称为&#34；真相&#34；而帖子的放大称为&#34；雷特鲁斯&#34;\n前共和党众议员德文·努内斯辞去特朗普的首席执行官职务&#39；上周，Truth Social表示，该公司预计将达到&#34；全面运行&#34；三月底，当&#34；在美国，任何人都可以随时登上这个平台&#34;\n特朗普&#39；s app加入了一个不断增长的数字产品生态系统，以迎合保守派或受保守派欢迎。隆布尔、帕勒、盖特和其他服务已经成为主流社交网络的替代品。但也有一些人遇到了成长的烦恼：例如，帕勒去年从苹果和谷歌（Google）离职&#39；在1月6日暴徒利用该平台煽动暴力的指控中，微软的应用商店出现了问题。", "note_en": "(CNN)An alternative social media platform backed by former President Donald Trump went live on Monday, becoming available for download on Apple&#39;s App Store — but access to the service appears limited for now.\n The service, a  Twitter  (  TWTR)-like application known as Truth Social, is  owned by  Trump Media and Technology Group, the media company Trump started after leaving the White House.\n  Users who downloaded the app Monday morning were greeted by a message inviting them to register for the service — but the signup process ended in a waitlist to access the platform that had already grown to more than 150,000.\n     The app&#39;s debut in the app store shows how Trump is seeking to muscle his way back onto social media a year after being suspended by multiple mainstream platforms, including  Facebook  (  FB), Twitter and YouTube, following the Jan. 6 Capitol riot.\n   Last week, Trump&#39;s son, Donald Jr., tweeted what appeared to be the former president&#39;s first post on Truth Social.\n  &#34;Get Ready! Your favorite President will see you soon!&#34; read the elder Trump&#39;s message. Posts on the platform are referred to as &#34;truths,&#34; while amplifications of a post are known as &#34;retruths.&#34;\n   Devin Nunes, the former Republican congressman who quit to become the CEO of Trump&#39;s media company, said last week Truth Social expects to be  &#34;fully operational&#34; by the end of March, when &#34;anyone can get on the platform within the United States at any time.&#34;\n Trump&#39;s app joins a growing ecosystem of digital products catering to, or popular with, conservatives. Rumble, Parler, Gettr and other services have cropped up as alternatives to mainstream social networks. But some have encountered growing pains: Parler, for example, was  removed last year from Apple and Google&#39;s app stores amid allegations that Jan. 6 rioters used the platform to incite violence.", "posttime": "2022-02-21 23:56:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,应用,app,特朗普", "title": "特朗普的社交媒体应用在苹果应用商店上线", "title_en": "Trump's social media app goes live in Apple's App Store", "transed": 1, "url": "https://www.cnn.com/2022/02/21/tech/trump-truth-social-app-store/index.html", "via": "", "real_tags": ["苹果", "apple", "应用", "app", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "土壤不仅提供了人类消耗的98.7%的热量，还提供了许多其他功能，这些功能与行星的生存能力密切相关。然而，我们不断增加。。。", "note_en": "Not only do soils provide 98.7% of the calories consumed by humans, they also provide numerous other functions upon which planetary survivability closely depends. However, our continuously increasi...", "posttime": "2022-02-21 23:55:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地球,planetary,提供", "title": "确保地球生存：平衡土壤的多功能性质", "title_en": "Ensuring planetary survival: balancing the multifunctional nature of soils", "transed": 1, "url": "https://www.tandfonline.com/doi/full/10.1080/10643389.2021.2024484", "via": "", "real_tags": ["地球", "planetary", "提供"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074501, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "小唐纳德·特朗普本周在Twitter上发布了一张照片，声称这是前总统特朗普39岁时在真相社交网站上发布的第一张照片；这是即将推出的Twitter克隆。你忘了真相吗？我也是。但新的极右翼社交媒体服务的推出可能会影响我个人最喜欢的社交媒体服务Mastodon。\n我&#39；我已经在乳齿象和其他不同的地方待了很长一段时间，我&#39；与其他社交媒体平台相比，我开始欣赏它悠闲的感觉。它&#39；s发展了自己的社区和价值观，以各种方式表达，从模因到为屏幕阅读器使用图像描述。虽然乳齿象与社会真相有着技术上的联系，但它是自己的东西，只有在对特朗普的关注下才会变得更强大；这是我们的项目。\n为什么一个社交网络会影响另一个？社会真相（显然，至少现在）是建立在乳齿象的基础上的；s代码。起初，真相社会背后的人对其起源持谨慎态度，导致乳齿象威胁提起诉讼。Truth Social背后的团队随后悄悄承认，它确实在使用Mastodon代码，该网站目前有一个开源软件页面，将其产品称为&#34；社会真理（乳齿象）&#34;\n乳齿象不是&#39；这不是一座岛。首先，它是&#39；它建立在任何人都可以使用的开源代码之上，这就是为什么Truth Social首先要使用它。另一方面，乳齿象不是&#39；它不是像Twitter这样的单一实体。相反，它&#39；s由运行Mastodon和#39的独立操作服务器组成；s代码。每个服务器都可以（但并不总是）相互通信。这些服务还可以与一个更大的服务社区中的其他服务进行通信，该社区称为FEDiversity。用我在信息安全上的账户。exchange服务器，我可以在mastodon上查看用户并与用户通信。社交，甚至是社交照片共享服务Pixelfed的用户。\n随着Truth Social的推出，实例之间的这种交流让一些Mastodon用户感到担忧。一些人讨论了保护他们的实例，不允许他们将构成社会真相的相互交流过程联合起来。阻止不需要的实例不是&#39；这对乳齿象管理者来说并不罕见；甚至用户也可以屏蔽个人或其他域。\n当然，它&#39；现在还不清楚Truth Social是否会与其他不同的服务进行沟通，这可能会使这一点变得毫无意义。我没有考虑过的一个更有趣的结果可能是对乳齿象的额外关注&#39；s代码作为社会真理的结果#39；让我们开始吧。\n一位名叫吉布森的乳齿象用户说&#34；问题是，虽然我认为[乳齿象]相对安全，特朗普将其作为新企业的基础，但它将吸引大量黑客行动主义者的关注&#34;\n&#34;注意，因为它&#39；这将是一个补丁的季节，&#34；据_Gibson称，他们并没有对发现这些漏洞的黑客活动主义者进行评判，只是认为这可能会产生比社区迄今为止经历的多得多的影响。\n全面披露：我关注Mastodon上的_Gibson，并在他们的Mastodon服务器上维护一个帐户。我&#39；我也是乳齿象的Patreon支持者，每月1美元。\n发现漏洞总是一件好事，过去Mastodon已经发布了补丁来处理安全漏洞。乳齿象将面临的一个挑战是，其分散的性质可能会对服务产生不利影响。每个Mastodon服务器都是独立托管和管理的，它&#39；这在很大程度上取决于这些实例的所有者应用补丁程序并执行基本维护。Twitter和其他集中式服务只需在自己的软件上应用补丁即可解决漏洞。\n类似的问题以前也曾出现过，但情况正好相反。极右翼社交媒体网站Gab也使用乳齿象代码，去年被黑客入侵，攻击者报告了70GB的用户数据。Mastodon发表声明称，违反#34；可能是因为Gab自己对代码进行了修改，以及未能合并来自上游Mastodon代码库的重要安全修复&#34;\n过去的表现不是未来业绩的指标，但极右翼的社交媒体网站不&#39；我在安全方面没有很好的记录。在上述Gab黑客攻击之后，Gab的账户&#39；谷歌的创始人很快就妥协了。盖特去年夏天也遭到黑客攻击和污损。\n甚至在推出之前，Truth Social的表现也没有好多少。该服务发布后不久，一些有进取心的个人意识到，他们可以访问该服务的预发布版本，并迅速开始用假账户和其他恶作剧填充该服务。\n不管特朗普发生了什么&#39；它的虚假推特将会发生。见鬼，这甚至可能不是小特朗普发布的真实图像，真相社交可能永远不会发布（最新的谣言指向周一，也就是总统日）。不管怎样，Mastodon都会很好，也许这一额外的关注将鼓励更多的人自己调查这个问题，或者为它的开源代码做出贡献。\n注册《安全观察》时事通讯，了解我们的顶级隐私和安全故事，并直接发送到您的收件箱。\n本通讯可能包含广告、交易或附属链接。订阅时事通讯表明您同意我们的使用条款和隐私政策。您可以随时取消订阅新闻通讯。", "note_en": "Donald Trump Jr. this week  posted a picture on Twitter which claimed to be the first post from the de-platformed former president on Truth Social, the older Trump&#39;s forthcoming Twitter clone. Did you forget about Truth Social? Me too. But the launch of a new far-right social media service might affect my personal favorite social media service,  Mastodon.\n I&#39;ve been on Mastodon and other Fediverse sites for a long while now, and I&#39;ve come to appreciate its laid-back feel compared to other social media platforms. It&#39;s developed its own communities and values, expressed in all kinds of ways, from its memes to embracing the use of image descriptions for screen readers. While it shares a technical link to Truth Social, Mastodon is its own thing and will only be made stronger from the attention given to Trump&#39;s project.\n   Why would one social network affect another? Truth Social is (apparently, and at least for now) built on Mastodon&#39;s code. Initially, the people behind Truth Social were cagey about its origins leading  Mastodon to threaten a lawsuit. The team behind Truth Social then  quietly admitted that it was indeed using Mastodon code, and the site currently has an  open-source software page that refers to its product as &#34;Truth Social (Mastodon).&#34;\n Mastodon isn&#39;t an island. For one thing, it&#39;s built on open-source code that anyone can use, which is why Truth Social is using it in the first place. For another, Mastodon isn&#39;t a monolithic entity like Twitter. Instead, it&#39;s made up of independently operated servers running Mastodon&#39;s code. Each of these servers can (but don&#39;t always) communicate with each other. These can also communicate with other services in a larger community of services called the Fediverse. With my account on the infosec.exchange server, I can see and communicate with users on mastodon.social, and even users of the social photo-sharing service Pixelfed.\n This communication between instances has concerned some Mastodon users as Truth Social lurches toward launch. Some have discussed protecting their instances by not allowing them to federate—the process of intercommunication that makes up the Fediverse—with Truth Social. Blocking unwanted instances isn&#39;t unusual for Mastodon administrators; even users can block individuals or other domains.\n Of course, it&#39;s unclear now if Truth Social will communicate with other Fediverse services, which may render that point moot. A more interesting consequence that I had not considered may be extra attention paid to Mastodon&#39;s code as a result of Truth Social&#39;s launch.\n One Mastodon user who goes by The_Gibson  says &#34;the problem is that [while] I believe [Mastodon] to be relatively secure, with Trump using it as a basis for his new venture, it will attract significant hacktivist attention.&#34;\n &#34;Pay attention, because it&#39;s about to be a season of patches,&#34; according to The_Gibson, who adds that they are  not judging hacktivists who uncover these vulnerabilities, only that it might generate far more than the community has experienced thus far.\n Full disclosure: I follow The_Gibson on Mastodon and maintain an account on their Mastodon server. I&#39;m also a Patreon supporter of Mastodon at the $1-per-month level.\n   Finding vulnerabilities is always a good thing, and Mastodon has issued patches to deal with security flaws in the past. One challenge that Mastodon will face is that its decentralized nature could work against the service. Each Mastodon server is hosted and managed independently, and it&#39;s largely up to the owners of those instances to apply patches and perform basic maintenance. Twitter and other centralized services have only to apply patches to their own software to address vulnerabilities.\n  A similar issue has cropped up before, but in reverse. Far-right social media site Gab also uses Mastodon code and was  hacked last year with the attacker making off with a reported 70GB of user data. Mastodon  issued a statement saying the breach &#34;likely resulted from Gab’s own modifications to the code and a failure to merge important security fixes from the upstream Mastodon code base.&#34;\n   Past performance is not an indicator of future results, but far-right social media sites don&#39;t have a great track record for security. After the aforementioned Gab hack, the account of Gab&#39;s founder was  swiftly compromised. Gettr was also  hacked and defaced last summer.\n Even before it launched, Truth Social has  not fared much better. Shortly after it was announced, some enterprising individuals realized they could access a pre-release version of the service and quickly went to work filling it with fake accounts and other mischief.\n Whatever happens with Trump&#39;s fake Twitter will happen. Heck, it might not have even been a real image that Trump Jr. posted and Truth Social may never launch (the latest rumors point to Monday, which is Presidents&#39; Day). Regardless, Mastodon will be fine, and perhaps this added attention will encourage more people to investigate the Fediverse for themselves or make contributions to its open-source code.\n Sign up for  Security Watch newsletter for our top privacy and security stories delivered right to your inbox.\n  This newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our  Terms of Use and  Privacy Policy. You may unsubscribe from the newsletters at any time.", "posttime": "2022-02-21 23:38:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乳齿,truth,服务", "title": "特朗普的真相只能让乳齿象变得更强大", "title_en": "Trump's Truth Social Can Only Make Mastodon Stronger", "transed": 1, "url": "https://www.pcmag.com/opinions/trumps-truth-social-can-only-make-mastodon-stronger", "via": "", "real_tags": ["乳齿", "truth", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074498, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你是一家无晶圆厂的公司，依赖台积电（TSMC）等公司的外部芯片制造，你就不得不为有限的晶圆厂开始竞争，尤其是在前沿节点。使用较小的节点会极大地改变芯片的基本性能，甚至根本的生存能力。那&#39；这就是为什么苹果、高通、AMD和英伟达等行业巨头都花费数十亿美元来确保供应。如果他们不付钱，那就有&#39；It’没有（或更少）薯片给你！\n据《硬件时报》报道，英伟达将支付近100亿美元的高额费用，以确保其在台积电5nm容量中的份额。英伟达正准备在台积电上生产下一代Ada Lovelace GPU&#39；s N5节点。当然，下一代GPU系列可能被称为RTX 40系列。除了两家公司的管理层之外，没有人确切知道这些费用是如何分解的或时间框架的，但正如《硬件时报》所指出的，英伟达仅在第三季度就在库存和未来产品的预付款上花费了90亿美元。这表明英伟达已经提前支付了大笔费用。\n确保5nm的生产对于RTX 40系列的成功至关重要。节点收缩可以提供更高的时钟和更好的电源效率，这可以决定正面战斗的胜负。虽然过于简单化了，但可能是Nvidia使用三星8nm是其产品无法从AMD获得高达7nm的时钟的一个原因，尽管它使用了更大的功率。\n使用较小节点的另一个优点是产量更好。如果芯片本身较小，300毫米的晶圆可以在其上安装更多芯片。每片芯片越多，利润就越高。\n如何购买图形卡：2022年贫瘠的硅环境下购买图形卡的小贴士\n2021的GPU短缺可能引起玩家焦虑，但它肯定不会对NVIDIA造成任何伤害，该公司在一月季度报告游戏收入为34亿2000万美元，比上年同期增长37%。\n最大的希望是，随着加密技术价格的下跌和PoW GPU采矿不再受欢迎，采矿需求开始下降，留下更多的图形卡进入游戏玩家手中，而不是矿工手中。\n作为游戏玩家，我们所要做的就是在我们需要的时候提供价格合理的选项。我们希望有足够的5nm容量来满足玩家的需求。与英特尔的Arc卡一起，下一场重量级战斗将于2022年晚些时候开始：AMD RDNA 3与Nvidia RTX 40。都在同一进程节点上。一磅一磅，一拳一拳。打仗", "note_en": "If you’re a fabless company that relies on external chip manufacturing from companies like TSMC, you’re forced to compete for limited wafer starts, particularly on the bleeding edge nodes. The use of a smaller node dramatically alters the fundamental performance capabilities and even the essential viability of your chip. That&#39;s why industry giants like Apple, Qualcomm, AMD and Nvidia all spend billions to secure their supply. If they don’t pay up, then there&#39;s no (or fewer) chips for you!\n  According to  Hardware Times, Nvidia is set to pay the exorbitant amount of nearly $10 billion to secure its share of TSMC 5nm capacity. Nvidia is geared up to produce its next generation Ada Lovelace GPU on TSMC&#39;s N5 node. Of course this next gen GPU family is likely to be referred to as the RTX 40 series. No one outside of the management of both companies knows extactly how the fees break down or the timeframe, but as noted by Hardware Times, Nvidia spent $9 billion in just the third quarter on inventory and prepayment for future products. This would indicate that Nvidia is already paying through the nose well in advance.\n  Securing 5nm production is critical to the success of the RTX 40 series. A node shrink can deliver a combination of higher clocks and better power efficiency, and this can make the difference between winning or losing a head to head battle. Though oversimplifying things, It may be that Nvidia’s use of Samsung 8nm is a reason that its products cannot clock as high as 7nm products from AMD, despite using more power.\n   The other advantage the use of a smaller node offers is better yield. A 300mm wafer can fit more chips on it if the chips themselves are smaller. More chips per wafer equals more profit.\n  How to buy a graphics card: tips on buying a graphics card in the barren silicon landscape that is 2022\n The GPU shortage of 2021 may have caused gamer anxiety, but it sure didn’t do Nvidia any harm, with the company reporting gaming revenue in the January quarter of  $3.42 billion, up 37% from the same period a year prior.\n  The great hope is that mining demand is beginning to drop off, as crypto prices fall and PoW GPU mining falls out of favour, leaving more graphics cards to make their way into the hands of gamers, and not those of miners.\n As gamers, all we want to do is have reasonably priced options available to us when we want them. Let’s hope that there’s enough 5nm capacity to go around to at least satisfy gamer demand. Along with  Arc cards from Intel, The next heavyweight battle begins later in 2022:  AMD RDNA 3 vs  Nvidia RTX 40. Both on the same process node. Pound for pound, punch for punch. Fight!", "posttime": "2022-02-21 22:58:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,nvidia,set,amd", "title": "英伟达将花费至少100亿美元，以确保其在有限的5nm芯片供应中的份额", "title_en": "Nvidia is set to spend at least $10B to secure its share of limited 5nm chip supply", "transed": 1, "url": "https://www.pcgamer.com/nvidia-is-set-to-spend-at-least-dollar10b-to-secure-its-share-of-limited-5nm-chip-supply/", "via": "", "real_tags": ["芯片", "nvidia", "set", "amd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无代码平台允许用户利用不需要编程知识的工具创建应用程序，随着其价值变得显而易见，无代码平台在企业中越来越受欢迎。根据一项2021的技术调查，47%的员工表示，他们目前使用的是低代码——一个没有代码的版本，涉及最少的编程，没有组织中的代码解决方案，20%的人表示他们打算在未来12个月采用技术。Markets and Markets预测，到2030年，全球低代码和无代码开发平台市场的收入将达到1870亿美元。Gartner预计，到2024年，它将占应用程序开发活动的65%以上。\n无代码的承诺之一是改进自动化。具体而言，支持者指出它有可能支持“超自动化”，这是Gartner创造的一个术语，用来描述公司用来识别、审查和自动化业务流程的概念。软件自动化供应商Automation Anywhere估计，70%到80%的典型基于规则的流程可以通过无代码或低代码平台实现自动化。\n一家相对较新的公司Skael提供了一个专注于这种自动化的无代码平台。在2076推出后，总部位于加利福尼亚旧金山的Skael'的客户群扩展到包括谷歌、Asurion和圣地亚哥住房委员会在内的品牌团队。Skael今天宣布，它在RTP Global牵头的a轮融资中筹集了3800万美元，由Bonfire Ventures和戴尔科技资本（Dell Technologies Capital）参与，这反映了增长和投资者的普遍热情，使该公司的总融资额达到4200万美元。\nSkael是Baba Nadimpalli的创意，他之前创立了金融软件开发商MAK software Solutions和网络技术咨询公司CommCube。其目标是创建一个平台，使用跨越自然语言处理、自然语言理解和机器学习的技术来自动化任务，动态地解释数据，而不需要深入的人类参与。\nNadimpalli通过电子邮件告诉VentureBeat，“自动化是增长最快的企业技术领域，它的需求只会随着宏观经济因素的组合而增长。”。“多年来衡量投资回报是很典型的，需要非常具体的技术资源——包括软件和人员——来设计、开发、部署、管理和培训端到端自动化战略……[但]实施良好，自动化服务于企业业务持续性[和解锁增长]的目的。”\n在实践中，Skael提供自动化工具，用于处理特定任务，例如通过客户关系管理软件刷新和移动交易。例如，Skael的一个工具通过更新流行的人力资源应用程序，实现人力资源入职、离职和员工评估的自动化。另一个学习现有的IT服务票和知识库，帮助用户订购设备和访问新软件。\n除此之外，Skael声称其平台可以处理PDF和基于文本的文档，如合同、培训材料和人力资源政策，通过“认知搜索”搜索“开放领域”问题的答案认知搜索（Cognitive search）是近年来受到越来越多关注的一项技术，促使微软（Microsoft）、亚马逊（Amazon）和谷歌（Google）等科技巨头对其开发进行投资。认知搜索使用人工智能一次从多个数据源摄取、理解、组织和查询数字内容。\nNadimpalli通过电子邮件告诉VentureBeat，“世界上绝大多数人的现代工作都是工业革命的复制和粘贴，让员工在几乎不需要人类智慧、创造力或创造力的工作中精疲力竭。”。“与其把人围绕着流程，然后围绕着技术，不如反过来，让技术围绕着人，[并且]以流程为中间层……Skael的平台[推动]向非技术用户设计、开发和部署数字员工，[结果]在更积极的员工和客户中，他们的时间现在花在更有目的性和参与性的工作上。\"\n考虑到人们对自动化解决方案日益增长的需求，像75名员工Skael’s这样的超自动化平台的未来看起来是光明的。自动化供应商和automation Anywhere的竞争对手UiPath委托开展的一项2022年调查显示，78%的公司表示他们可能会投资或增加对自动化的投资。2020年Zappier的一项民意调查显示，约40%的员工认为自动化可以节省企业资金。\n但希望实现无代码自动化的公司在部署过程中面临挑战。2019年的一项Appian调查发现，不到一半的组织部署了智能自动化——尽管看到了它的价值。他们列举的主要原因是难以适应这项技术，未能理解人工智能将如何改变任何东西，难以将自动化与现有IT部署集成，以及需要改变IT文化和应用程序开发实践。\n麦肯锡分析师在2018年的一份报告中写道：“每个地区和行业的组织都在实现至少一些业务流程的自动化，但只有极少数成功实现了目标。”。“[特定]实践最能支持成功的自动化工作：将自动化作为战略重点，系统地部署技术，分散治理，确保IT职能部门的参与，将自动化的成本和收益内部化，并优先考虑员工管理。”\n不过，Nadimpalli坚称，Skael的平台可以影响变革，即使是在没有进行任何数字转型工作的遗留组织中。尽管有来自工作流自动化平台Conexiom、企业流程自动化公司Redwood Software和IT服务台自动化初创公司Swish等初创公司的竞争。到目前为止，人工智能总共筹集了数亿风险资本。\nNadimpalli说：“我们在2021财年有700万美元的年度经常性收入，计划在2022年增长240%以上。”“这场大流行引发了人类历史上前所未有的自省，在全球范围内引发了所谓的‘大辞职’。突然间，提高员工满意度和参与度的投资产生了直接可测量的投资回报，尤其是如果它们可以在数周内部署，而不是数月内部署的话——[比如Skael.]\nVentureBeat&#39；公司的使命是成为一个数字城市广场，让技术决策者了解变革性企业技术和交易。了解更多", "note_en": "No-code platforms, which let users create apps leveraging tools that don’t require programming knowledge, are gaining popularity in the enterprise as their value becomes apparent. According to a 2021 TechRepublic  survey, 47% of employees said that they currently use low-code — a version of no-code that involves minimal programming — and no-code solutions in their organizations, with 20% saying that they intend to adopt technology in the next 12 months. Markets and Markets  predicts that by 2030, the global low-code and no-code development platform market will hit $187 billion in revenue. And by 2024, it’ll account for more than 65% of application development activity, Gartner  anticipates.\n One of the promises of no-code is improved automation. Specifically, proponents point to its potential to support “hyperautomation,” a term coined by Gartner to describe the concept that companies use to identify, vet, and automate business processes. Automation Anywhere, a software automation vendor,  estimates that 70% to 80% of a typical rules-based process could automated by a no-code or low-code platform.\n  A relatively new company,  Skael, offers a no-code platform focused on this type of automation. After launching in 2076, San Francisco, California-based Skael’s customer base expanded to teams at brands including Google, Asurion, and the San Diego Housing commission. Reflecting the growth — and investors’ general enthusiasm — Skael today announced that it raised $38 million in a series A financing round led by RTP Global with participation from Bonfire Ventures and Dell Technologies Capital, bringing the company’s total to $42 million.\n  Skael is the brainchild of Baba Nadimpalli, who previously founded financial software developer MAK Software Solutions and network tech consultancy CommCube. The goal was to create a platform that uses technologies spanning natural language processing, natural language understanding, and machine learning to automate tasks, dynamically interpreting data without deep human involvement.\n “Automation is the fastest-growing enterprise technology segment, and its demand is only increasing due to a combination of macroeconomic factors,” Nadimpalli told VentureBeat via email. “It’s typical to measure return on investment in years, requiring very specific technical resources — both software and people — to design, develop, deploy, manage, and train end-to-end automation strategies … [But] implemented well, automation serves the enterprise purpose of business continuance [and unlocking growth.]”\n In practice, Skael offers automation tools designed to tackle particular tasks, like refreshing and moving deals through customer relationship management software. One of Skael’s tools, for example, automates HR onboarding, offboarding, and employee assessments by updating popular HR applications. Another learns from existing IT service tickets and knowledge bases to help users order equipment and access new software.\n  Beyond this, Skael claims its platform can process PDFs and text-based documents such as contracts, training materials, and HR policies to search for answers to “open domain” questions through “cognitive search.” Cognitive search — a technology that’s gained increased attention in recent years, prompting tech giants  including Microsoft, Amazon, and Google to invest in its development — uses AI to ingest, understand, organize, and query digital content from multiple data sources at once.\n “Modern-day work for the vast majority of the world is a copy-and-paste of the industrial revolution, burning employees out in jobs that have very little need for human intelligence, ingenuity, or creativity,” Nadimpalli told VentureBeat via email. “Instead of wrapping people around process and then around technology, it should be the other way around, with technology wrapped around people — [and] with process as the middle layer … Skael’s platform [pushes] out the design, development and deployment of digital employees to non-technical users, [resulting] in more engaged human employees and customers [whose] time is now spent on more purposeful and engaging work.”\n  The future of hyperautomation platforms like 75-employee Skael’s looks bright when considering the growing appetite for automation solutions. According to a 2022  survey commissioned by UiPath, an automation vendor and Automation Anywhere rival, 78% of companies say that they’re likely to invest or increase their investments in automation. A 2020 Zappier  poll shows that about 40% of employees believe automation saves their business money.\n But companies looking to embrace no-code automation face challenges on the road to deployment. A 2019 Appian  survey found less than half of organizations have deployed intelligent automation — despite seeing the value in it. The top reasons they cited were struggling to adapt with the technology, failing to understand how AI would change anything, difficulty integrating automation with existing IT deployments, and the need to change IT culture and app development practices.\n “Organizations in every region and industry are automating at least some business processes, yet only a slight majority have succeeded at meeting their targets,” McKinsey analysts wrote in a 2018 report. “[Specific] practices best support a successful automation effort: making automation a strategic priority, deploying technologies systematically, decentralizing governance, ensuring the IT function’s involvement, internalizing automation’s costs and benefits, and prioritizing workforce management.”\n Still, Nadimpalli asserts that Skael’s platform can affect change even in legacy organizations that haven’t undertaken any  digital transformation efforts. That’s despite competition from startups like workflow automation platform  Conexiom, enterprise process automation company  Redwood Software, and IT service desk automation startup  Swish.ai, which collectively have raised hundreds of millions in venture capital to date.\n “[We had] $7 million in annual recurring revenue in fiscal year 2021 and plan to grow over 240% in 2022,” Nadimpalli said. “The pandemic has driven unprecedented levels of introspection in human history, causing the so-called ‘great resignation’ on a global level. Suddenly, investments that raise employee satisfaction and engagement have a directly measurable return on investment, especially if they can be deployed in weeks versus months — [like Skael.]”\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative enterprise technology and transact.  Learn More", "posttime": "2022-02-21 22:44:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,资金,code,自动化", "title": "Skael不为企业提供代码自动化工具，它筹集了由RTP Global牵头的3800万美元的a系列资金，使其总资金达到4200万美元", "title_en": "Skael, which provides no-code automation tools for enterprises, raises a $38M Series A led by RTP Global, bringing its total funding to $42M", "transed": 1, "url": "https://venturebeat.com/2022/02/21/no-code-automation-platform-skael-raises-38m-to-streamline-enterprise-processes/", "via": "", "real_tags": ["代码", "资金", "code", "自动化"]}]