[{"category": "", "categoryclass": "", "imagename": "fd427be98c2cef9f4aaf1c55cfed3aca.png", "infoid": 1028846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前几天我在看维基百科(和你一样)，发现了状态转换表。\n基本上，状态转换表显示了状态机如何在不同的状态之间转换，它是绘制状态图的另一种选择，可以帮助您找到逻辑中的漏洞。\n维基百科显示了一些非常抽象的表格，所以我将以自动售货机为模型。为了简化起见，我们将在一个季度内提供一种饮料。与这台机器(快乐之路)互动的理想化版本是：\n要实现这一点，我们必须管理两个独立的状态：您是否已将钱放入自动售货机，以及是否有至少一种饮料可供自动售卖。\n让我们用一维状态转换表对上面的交互进行建模。只使用一个维度可以使建模尽可能简单，同时仍能捕捉到足够多的有用细节：我们有一列，分别用于输入、当前状态、下一个状态和副作用。要了解事件发生后会发生什么，您只需找到您关心的输入和当前状态行，然后查看匹配的下一个状态和副作用。对于我们的自动售货机，可能如下所示：\n但是，当然，我们必须模拟当我们做一些不愉快的事情时会发生什么。不幸的是，表格的一维版本并没有给我们提供一个很好的视图！\n为了找出我们哪里有洞，我们需要添加更多的维度。让我们沿着垂直轴重新组织我们的状态，并沿着水平轴重新组织输入，以得到一个二维状态转换表。\n要读取此表，请将沿垂直轴的当前状态与沿水平方向的输入进行匹配。我们的下一个状态和副作用位于交叉点(我已用/分隔它们)：\n我们看到，呃...。问题。当我们这样看待事物时，很明显，我们只定义了8种可能结果中的两种！有序地写下事情表明，我们没有详细说明我们的建模所隐含的所有可能性。\n让我们把剩下的填了吧。为了让事情变得容易些，当国家保持不变或者没有副作用时，我标出了--。\n但当我们填写表格时，我们会发现我们遇到了一个潜在的奇怪情况：如果我们不知何故有一些钱，但没有饮料怎么办？状态机应该会阻止这种情况，因为没有新的州字段可以造成这种情况。但是，通过编程(例如，通过将州建模为两个独立的字段)或硬件问题(例如，有人撬开机器离开宿舍，这是一种非典型的破坏行为)是可行的。\n在我们进入应用程序的代码部分之前，我们的建模已经揭示了这种未定义的行为，而最困难的部分是制作一个表并寻找空单元格。现在，我可以将相同的表带给利益相关者或领域专家，并就他们认为应该发生的事情进行富有成效的对话。\n(哦，还有一个好处：如果您正在使用ELM，这里的一维表单可能非常熟悉。&#34；Input、Current State、Next State、Output和UPDATE的作用相同：msg-&gt；model-&gt；(model，cmd msg)！)", "note_en": "I was reading Wikipedia the other day (as you do) and found out about  state-transition tables.\n Basically, state transition tables show how a state machine transitions between different states.It&#39;s an alternative to drawing a  state diagram that helps you find holes in your logic.\n Wikipedia shows some pretty abstract tables, so I&#39;m going to model a vending machine instead.To simplify things, we&#39;ll serve a single drink for a single quarter.The idealized version of the interaction with this machine (the &#34;happy path&#34;) is:\n  To implement this, we have to manage two independent pieces of state: whether you&#39;ve put money in the machine and whether it has at least one drink left to vend.\n Let&#39;s model the interaction above with a one-dimensional state-transition table.Using only one dimension keeps the modeling as simple as possible while still capturing enough detail to be useful: we have a column each for  input,  current state,  next state, and  side effects.To find out what happens after an event you just find the  input and  current state rows you care about and look at the matching  next state and  side effect.For our vending machine, it might look like this:\n  But, of course, we have to model what happens when we do things that are not on the happy path.Unfortunately, the one-dimensional version of the table doesn&#39;t give us a great view of that!\n To figure out where we have holes, we need to add more dimensions.Let&#39;s reorganize our states along the vertical axis and inputs along the horizontal axis to get a two-dimentional state-transition table.\n To read this table, match the  current state along the vertical axis with the  input along the horizontal.Our  next state and  side effects live in the intersections (I&#39;ve separated them with a  /):\n  And we see, uh... problems.When we look at things this way, it&#39;s clear that we&#39;ve only defined two of the possible 8 outcomes!Writing things down in an orderly way revealed that we haven&#39;t specified all of the possibilities implied by our modeling.\n Let&#39;s fill the rest out.To make things easier, when the state stays the same or there&#39;s no side effect I&#39;ve marked  -:\n  But when we fill things out, we can see that we have a potentially weird situation: what if we somehow have some money, but no drinks?The state machine should prevent that, since there&#39;s no new state field that could create this situation.But it&#39;s feasible to get there either via programming (for example, by modeling the state as two independent fields) or hardware issues (for example, someone prying open the machine to leave quarters in an atypical act of vandalism.)\n Our modeling has revealed this undefined behavior way before we got to the code parts of our application, and the hardest part was making a table and looking for empty cells.Now I can take this same table to a stakeholder or domain expert and have a productive conversation about what they think should happen.\n  (oh, and bonus: if you&#39;re using Elm, the one-dimensional form here is probably pretty familiar.&#34;Input, Current State, Next State, Output&#34; does the same job as  update : msg -&gt; model -&gt; ( model, Cmd msg )!)", "posttime": "2020-10-15 01:56:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "转换,transition,状态", "title": "状态转换表", "title_en": "State-Transition Tables", "transed": 1, "url": "https://bytes.zone/posts/state-transition-tables", "via": "", "real_tags": ["转换", "状态"]}, {"category": "", "categoryclass": "", "imagename": "c13c45788f2bf05efd0df9c30a325d32.jpg", "infoid": 1028845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人类的大脑是一个了不起的东西；我们最复杂的机器甚至还没有接近于与我们的更高意识和创造力的能力竞争。然而，这800亿左右的神经元也非常脆弱。\n如果一个特定的连接出现最微小的问题--可能是什么东西失灵了，或者某个神经通路被阻塞了--事情可能很快就会瓦解。\n而且，奇怪的是，即使没有任何损伤或结构故障，人类的大脑也会自己变得奇怪-事实证明，欺骗它看到和听到实际上并不在那里的东西是出人意料的容易。\n我们并不是在谈论服用一大堆药物来让自己产生幻觉。因为大脑可以独立完成所有的事情--你只需要知道如何操纵它就可以了。\n正如YouTube上这段2016年的骗局国家视频中的那些家伙所展示的那样，如果你用一些常见的家用物品创造了一种强烈的感觉剥夺的情况，你可以诱导一些非常强烈的幻觉，扰乱你的视觉和听觉。\nYouTube上的旧电视白噪音或静电视频，连续运行至少30分钟。\n观看视频，找出他们是如何使用这些东西来基本上剥夺自己的任何感官输入的。通常大约10到30分钟后，效果就开始显现了。\n20分钟后，诈骗国家的家伙们报告说，他们看到了颜色鲜艳的花朵-就像你揉眼皮时看到的那样-很快就会形成恐龙剪影、水母和索隆之眼等形状。\n听起来像是胡说八道吗？嗯，当然，我们不得不相信YouTube上两个家伙在这个特定场景中的话，但他们正在做的事情实际上遵循了一种名为甘兹菲尔德效应的科学现象的原理。\n甘兹菲尔德效应描述了当你暴露在一个无结构的、均匀的刺激场中时--比如看到黑暗、听到持续不断的电视静电--你的大脑是如何通过放大神经噪音来寻找缺失的视觉信号来做出反应的。\n这可能会导致视觉和听觉的幻觉，就像视频中的人所描述的那样。\n当来自Veritasium的德里克·穆勒(Derek Muller)尝试自己版本的感觉剥夺时-将自己锁在漆黑、超安静的消声室里45分钟-他揭穿了缺乏刺激会让你发疯的神话，但他确实报告了一些奇怪的感觉。\n我只是觉得它在猛烈地抽动，我能感觉到，几乎就像血液从我身上往上推一样。这不是我听到的，而是我感觉到的。我感觉，在某种程度上，我的心在颤抖我的身体。那是件奇怪的事。&#34；\n在这种情况下，德里克并没有确切地经历过幻觉，但他用心脏描述的东西确实表明他的大脑在没有任何刺激的情况下放大了东西。\n有趣的是，研究人员在2015年的一项实验中展示了类似的效果，他们让志愿者们互相凝视对方的眼睛长达10分钟。\n克里斯蒂安·贾勒特(Christian Jarrett)当时为英国心理学会的研究文摘(Research Digest)报道称，凝视组的参与者表示，他们有过一次前所未有的令人信服的体验。\n可以肯定的是，这是一门不精确的科学，因为每个人的大脑对我们扔给它的奇怪东西的反应是不同的(比喻)，但你可以尝试一下骗局国家的方法，看看你会发生什么。只是，如果来自时代强盗的至高无上的存在给你带来了困难，不要责怪我们，好吗？", "note_en": "The human brain is a remarkable thing;  our most complex machines are not even close to competing with our powers of higher consciousness and ingenuity. And yet, those 80 billion or so neurons are also incredibly fragile.\n   If the tiniest thing goes wrong with a particular connection - maybe something misfires, or a certain neural pathway is blocked - things can fall apart very quickly.\n And, oddly enough, even without any injuries or structural malfunctions, the human brain can get weird all by itself - turns out,  it&#39;s surprisingly easy to trick it into seeing and hearing things that aren&#39;t actually there.\n We&#39;re not talking about  taking a bunch of drugs to make yourself hallucinate.  The brain can do all that on its own - you just have to know how to manipulate it.\n  As demonstrated by the guys  in this 2016 Scam Nation video on YouTube, if you create a situation of intense sensory deprivation using some common household objects, you can induce some really strong hallucinations that mess with both your sense of sight and sound.\n  A YouTube video of old television white noise or static that runs uninterrupted for at least 30 minutes\n   Watch the video to find out how they use each of these things to basically deprive themselves of any sensory input. The effects usually start to show after about 10 to 30 minutes.\n After 20 minutes, the Scam Nation guys reported seeing &#34;blooms of colour&#34; - like those you see when you rub your eyelids - that would soon form shapes, such as  dinosaur silhouettes, jellyfish, and the Eye of Sauron.\n  Sounds like nonsense? Well, sure, we have to take the word of two dudes on YouTube for this particular scenario, but what they&#39;re doing actually follows the principles of a scientific phenomenon known as the  Ganzfeld effect.\n The Ganzfeld effect describes how when you&#39;re exposed to  &#34;an unstructured, uniform stimulation field&#34; - such as seeing blackness and hearing constant television static - your brain responds by amplifying neural noise in an effort to find missing visual signals.\n This can result in both visual and aural hallucinations like the guys in the video describe.\n    When Derek Muller from Veritasium tried his own version of sensory deprivation - locking himself in a pitch-black, ultra-quiet  anechoic chamber for 45 minutes - he debunked the myth that the lack of stimulation would send you mad, but did report a few odd sensations.\n  &#34;I just felt like it was pumping really hard, and I could feel, almost like the blood pushing up through me. It wasn&#39;t like I was hearing it, it was like I was  feeling it. And I was feeling as though, in a way, my heart was shaking my body. That was something weird.&#34;\n  In this situation, Derek didn&#39;t exactly experience hallucinations, but what he describes with his heart does suggest his brain was amplifying things in the absence of any stimuli.\n Interestingly, researchers demonstrated a similar effect  in an experiment in 2015, where they asked volunteers to stare into each other&#39;s eyes for 10 minutes straight.\n &#34;The participants in the eye-staring group said they&#39;d had a compelling experience unlike anything they&#39;d felt before,&#34;  Christian Jarrett reported for the   British Psychological Society&#39;s Research Digest at the time .\n It&#39;s an imprecise science, to be sure, because every person&#39;s brain responds differently to the weird things we throw at it (figuratively), but you could give the Scam Nation method a try and see what happens to you. Just, if the  Supreme Being from  Time Bandits gives you a hard time, don&#39;t blame us, okay?", "posttime": "2020-10-15 01:55:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "药物,hallucinations", "title": "在没有任何药物的情况下制造幻觉出奇地容易", "title_en": "Creating Hallucinations Without Any Drugs Is Surprisingly Easy", "transed": 1, "url": "https://www.sciencealert.com/why-creating-hallucinations-without-any-drugs-is-surprisingly-easy", "via": "", "real_tags": ["药物"]}, {"category": "", "categoryclass": "", "imagename": "c1ac1b2ed37005fa8005819bf2383830.jpg", "infoid": 1028844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公司&#39；S CDP旨在提供帮助组织整合客户数据跨越接触点-来自从商业和市场营销到销售和服务--到改善体验。..。\n最新发布的GitHub移动版增加了一系列工具来改进、检查和合并智能手机上的代码。\n有了Segment，Twilio现在可以连接到客户与他们的最终用户的每一个接触点。\n团队规划和任务管理应用程序中的任务可供Microsoft 365客户全面使用。\n免费和便宜的个人和小型企业云存储服务无处不在。但是哪一个是最好的呢？给你的吗？让&#39；A：让我们看看上面云存储选项。..。\n华尔街可能会继续其疯狂的向上攀升，但Tidelift发现就越明智，财政拮据的企业主街正在转弯比以往任何时候都多", "note_en": "The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompany&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCDP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taims\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thelp\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\torganizations\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmeld\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcustomer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tacross\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttouchpoints\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t--\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcommerce\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmarketing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsales\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t--\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\timprove\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texperiences.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The latest release of GitHub for mobile adds a bevy of tools to improve, review and merge code on your smartphone.\n  With Segment, Twilio can now be connected to every touch point customers have with their end users.\n  The Tasks in Teams planning and task management app reaches general availability for Microsoft 365 customers.\n  Free\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcheap\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpersonal\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmall\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusiness\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcloud\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstorage\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservices\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teverywhere.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhich\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tone\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLet&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlook\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcloud\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstorage\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toptions.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Wall\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStreet\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmay\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontinue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinsane\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupward\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trise,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTidelift\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfinding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsensible,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfinancially\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstrapped\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusinesses\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStreet\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tturning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tever\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\topen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsource.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n    Microsoft&#39;s 10 principles stress it won&#39;t treat a developer the way Apple does, but they won&#39;t apply to its Xbox platform.", "posttime": "2020-10-15 01:55:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,linux,客户", "title": "Linux5.9：不是游戏规则的改变者，而是一个好的、可靠的Linux内核", "title_en": "Linux 5.9: Not a game-changer, but a good, solid Linux kernel", "transed": 1, "url": "https://www.zdnet.com/article/linux-5-9-not-a-game-changer-but-a-good-solid-linux-kernel/", "via": "", "real_tags": ["游戏", "linux", "客户"]}, {"category": "", "categoryclass": "", "imagename": "785ba040e8863fa046a906c094fc5842.jpg", "infoid": 1028843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索菲·奥尔科恩是硅谷阿尔科恩移民法的创始人，也是2019年全球法律专家奖的创始人，她的获奖作品是“加州年度企业家移民服务律师事务所”。她将人们与拓展他们生活的业务和机会联系起来。\n硅谷移民律师索菲·奥尔科恩说：“你的问题对知识的传播至关重要，让世界各地的人们超越国界，追逐自己的梦想。”“无论你是在人事部、创始人还是在硅谷找工作，我都很乐意在我的下一篇专栏中回答你的问题。”\n额外的Crunch会员可以获得每周“亲爱的索菲”专栏的访问权限；使用促销码ALCON以50%的折扣购买一年或两年的订阅。\n我目前持商务旅行签证在美国。我于3月初来到这里，就在新冠肺炎疫情开始之前，我在美国市场进行了摸索，以扩大我几年前在玻利维亚与人共同创立的初创公司的规模。\n我本来只打算待几个月，但是被困住了。现在我的公司有了一些真正的扩张机会。我怎样才能留下来开始工作呢？\n感谢你将在美国创造的就业机会，因为你希望留在美国并扩大你的创业。美国经济极大地受益于像你们这样来这里创新的企业家。由于您已经在美国，您可以选择在不离开的情况下更改您的身份。\n如果你在最近一次持B-1旅游签证入境时获准逗留6个月，你可以申请再延长6个月的身份。我们还可以探索允许您进行工作授权的其他替代方案。关于我将在这里讨论的一些选项的更多细节，以及为初创公司创始人提供的额外签证和绿卡选项，请查看我关于“什么是美国初创公司创始人移民？”的播客。为初学者准备的分步指南。“。\n因为大多数绿卡(移民签证)比非移民(临时)签证需要更长的时间，所以一个保守的策略是寻找另一个临时的非移民身份(通常被戏称为“签证”)-而不是需要更长时间的绿卡-这样你就可以在美国创建和发展你的初创企业，而不必回到玻利维亚。", "note_en": "Sophie Alcorn is the founder of  Alcorn Immigration Law in Silicon Valley and 2019 Global Law Experts Awards’ “Law Firm of the Year in California for Entrepreneur Immigration Services.” She connects people with the businesses and opportunities that expand their lives.\n  “Your questions are vital to the spread of knowledge that allows people all over the world to rise above borders and pursue their dreams,” says  Sophie Alcorn, a Silicon Valley immigration attorney. “Whether you’re in people ops, a founder or seeking a job in Silicon Valley, I would love to  answer your questions in my next column.”\n Extra Crunch members receive access to weekly “Dear Sophie” columns;  use promo code ALCORN to purchase a one- or two-year subscription for 50% off.\n   I’m currently in the U.S. on a business visitor visa. I arrived here in early March just before the COVID-19 pandemic began here to scope out the U.S. market for expanding the startup I co-founded in Bolivia a few years ago.\n I had only planned to stay a couple months, but got stuck. Now my company has some real opportunities to expand. How can I stay and start working?\n   Appreciative for the jobs you’ll be creating in the U.S. since you desire to remain in the U.S. and expand your startup. The U.S. economy greatly benefits from entrepreneurs like you who come here to innovate. Since you’re already in the U.S., you may have options to change your status without departing.\n If you were granted a stay of six months when you were admitted most recently with your B-1 visitor visa, you can seek an extension of status for another six months. There are additional alternatives we can explore that would allow you work authorization. For more details on some of the options I’ll discuss here and for additional visa and green card options for startup founders, check out my  podcast on “What is U.S. Startup Founder Immigration? A Step-By-Step Guide for Beginners.”\n Because most green cards (immigrant visas) take longer than nonimmigrant (temporary) visas, a conservative strategy to pursue would be to find another temporary nonimmigrant status (what is often nicknamed a “visa”) — rather than a green card, which takes longer — that will allow you to create and grow your startup in the U.S. without having to return to Bolivia.", "posttime": "2020-10-15 01:14:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新冠,sophie,美国", "title": "\n亲爱的苏菲：我是持B-1签证来的，然后新冠肺炎就来了。我怎么能留下来呢？", "title_en": "\n\t\t\t\tDear Sophie: I came on a B-1 visa, then COVID-19 happened. How can I stay?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/dear-sophie-i-came-on-a-b-1-visa-then-covid-19-happened-how-can-i-stay/", "via": "", "real_tags": ["新冠", "sophie", "美国"]}, {"category": "", "categoryclass": "", "imagename": "b9b07819ce9cf8bff1f468717d4f3164.jpg", "infoid": 1028842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我曾在2019年在封闭的赛道上骑过它，但这还不足以吸收105马力机器的更好品质。在LiveWire上行驶了将近一个月和一千英里后，我敢说这可能是哈雷戴维森生产过的最具创新性的摩托车。\n这并不意味着完美(特别是在定价方面)。但随着销量的下降和婴儿潮一代的老龄化-哈雷的主要铬和钢制气器市场-该公司需要进行新的转变。\n哈雷·戴维森(Harley Davidson)的LiveWire做到了这一点，LiveWire最初是一个概念，后来发展成为制造商的第一款量产电动汽车，于2019年末发布。电压驱动的两轮车是为了补充，而不是取代HD的优质内燃机巡洋舰。\n哈雷-戴维森于1903年在密尔沃基成立，2018年在硅谷开设了一个办事处，计划增加未来的电动汽车系列-从摩托车到自行车再到滑板车。29,799美元的LiveWire是第一个，尽管收入下降和新冠肺炎引发的经济衰退让HD的电力计划受到质疑。\n在关键规格上，Livewire将在3秒内完成0-60英里/小时，达到110英里/小时，使用直流快速充电器在40分钟内充电到80%。摩托车的15.5千瓦时电池和磁铁马达产生86英尺磅的扭矩。\n这辆548磅的Livewire标榜的城市续航里程为146英里(城市/高速公路联合行驶95英里)。电动哈雷也是一款兼容物联网和APP的车辆，具有预设的驾驶模式-提供不同的动力、扭矩和再生制动组合-以及创建自定义模式的能力。\n哈雷·戴维森为LiveWire增加了一些高级功能，如钥匙卡操作、防盗控制系统和摩托车上类似心跳的振动。\n这对于提醒车手LiveWire(在停车时保持静音)仍然处于运行模式非常有用。在运动中，自行车基本上是安静的，尽管哈雷-戴维森-以其内燃机隆隆声而闻名-创造了车辆机械运动产生的标志性电子声音。这是一种几乎听不见的嗡嗡声，让摩托车发出了像电动哈雷一样清晰的声音。\n作为一款电动摩托车，LiveWire对于一辆两轮车来说非常平衡，因为它的质量集中在一个地方：电池。\n超过500磅的重量，以哈雷巡洋舰的标准来看并不算重，但LiveWire对于一辆裸体运动自行车来说是很重的。你肯定会感觉到推动电动汽车在车库里转来走去的重量，但幸运的是-通过一些巧妙的框架设计-一旦LiveWire开始滚动，重量就会消失。\n当我在2019年的赛道上测试LiveWire时，我注意到它带来了成为电动摩托车体验的一切：巨大的扭矩和闪电般的加速，除了你周围流动的风之外，几乎没有噪音。\n使用LiveWire的时间和骑行条件更多，带来了更强的鉴赏力。我开着它沿着哈德逊河谷进入曼哈顿，在95号州际公路上行驶到三位数，在格林威治郊外曲折的偏僻小路上行驶。LiveWire的外观和性能相当于一辆高性能的电动摩托车，在许多方面，它提供了比任何活塞驱动的更令人兴奋的乘坐体验。\n与ICE同行相比，LiveWire最大的冲刺是扭矩和加速度。与汽油自行车相比，机械运动部件更少，而且没有离合器或换档，因此动力传递比内燃机更强劲、更稳定。你只需转身就走了。\n与其他高性能电动摩托车一样，LiveWire的再生制动-即电机为电池充电并减缓后轮脱离油门的程度-也提高了性能。再生制动可以手动调整，也可以通过电动硬盘上的骑行模式进行调整。\n这需要一些技能，但最终的结果是能够以比汽油摩托车更顺畅的方式飞行通过弯道-几乎没有机械制动-只需简单地启动油门滚动即可。这与摩托车的横向操纵性是相辅相成的。反过来，LiveWire的线条和TRON光圈一样精确(至少在概念上是这样)。\n这一切都转化为一种不间断向前移动的骑行体验，没有任何拍子和嘎嘎作响。这款摩托车看起来也很棒-线条和款式都达到了电动汽车和哈雷的要求-更是增加了一些。\n随着LiveWire的首次亮相，哈雷戴维森成为第一家在美国提供街头合法电动摩托车的大型天然气制造商。\n这一举措对该公司来说是必要的，与美国大多数摩托车行业一样，该公司多年来一直在流失收入和年轻买家。\n虽然HD超越了本田(Honda)和川崎(Kawasaki)等传统摩托车制造商，但它绝对不是唯一家在两轮电动领域。\n哈雷-戴维森(Harley-Davidson)进入电动汽车领域时，面临着来自几家电动摩托车初创公司的竞争，这些初创公司正试图将汽油车手转变为电动车手，并吸引年轻一代骑摩托车。\n领头羊之一是加州初创公司Zero摩托车，在全球拥有200家经销商。意大利Energica公司正在扩大其高性能电动摩托车在美国的分销。\n加拿大初创公司Damon Motors今年首次推出了时速200英里、售价2.4万美元的Hypersport，它提供了专有的安全和人体工程学技术，可以调整骑行位置和盲点检测。\n当然，特别是考虑到新冠肺炎引发的全球经济衰退，并不明显市场上有足够的需求来购买所有这些新车型。\n关于LiveWire的市场成功(或失败)，很难评估，因为HD的报告不包括LiveWire特定的销售数据。我(和其他人)一直批评的一件事是这款摩托车2.9万美元的价格。它只比一辆特斯拉Model3便宜几千美元，太高了--即使对于一辆高档摩托车来说也是如此。但撇开价格不谈，这是一个很大的问题，我仍然认为该公司凭借LiveWire在几个重要方面取得了成功。哈雷-戴维森(Harley-Davidson)创造了一款令人兴奋的光环摩托车，确立了它作为合法电动摩托车制造商的地位-以明显的哈雷-戴维森(Harley-Davidson)方式-同时为其电动汽车计划吸引了公众的兴趣。\n对于一家公司来说，要想从成功的光环发射中获益，它需要创造一个更容易接近的续集。今年7月，哈雷-戴维森(Harley-Davidson)新任命的首席执行官约亨·泽茨(Jochen Zeitz)宣布了一项名为Rewire的五年计划，以适应销售额的下降，并带领公司迈向未来。该战略包括大规模重组，并保留(甚至取消)之前宣布的一些项目，如哈雷的燃气动力布朗克斯车型。\n关于LiveWire-以及生产新的电动汽车-是否仍然是哈雷戴维森的未来，蔡茨在最近的声明或投资者电话中没有具体证实这一点。\n在了解了HD的首款电动摩托车，并对市场进行了评估之后，我投票支持这家标志性的美国公司继续其电动汽车计划，并为我们提供更多。提供后续产品，使光环Livewire的冲刺、刺激和按需功能可供MASS使用。\n我可以设想该公司的下一款电动汽车产品发布，包括一款滑板车产品-在城市移动领域注册哈雷-以及一款更实惠、具有广泛市场吸引力的电动摩托车。\n那会是什么样子呢？价格在1万美元左右的东西，比549磅的LiveWire更轻，更容易让初学者骑行，云和应用程序连接在一起，续航里程至少100英里，充电时间为30到40分钟。一辆跟踪器风格的电动汽车引导哈雷的平道赛车手-具有一些越野能力-也可以帮助HD达到目标。\n在新冠肺炎的经济环境下，在规格、款式和价位上做好一切对HD来说将更加关键，在可预见的未来，人们对摩托车的消费偏好将更加保守。\n但继续生产电动汽车的承诺仍然是哈雷-戴维森打赌进入更年轻的市场，并在21世纪的移动世界中保持相关性。HD的改版绝对应该包括更多的LiveWire。", "note_en": "I’d ridden it on a closed course in 2019, but that wasn’t enough absorb the finer qualities of the 105 horsepower machine. After nearly a month and a thousand miles on the LiveWire, I’d venture to say it could be the most innovative motorcycle Harley Davidson has ever produced.\n That doesn’t mean perfect (particularly on the pricing). But with declining sales and the aging of the baby boomers — Harley’s primary market for chrome and steel gassers — the company needed to take a fresh turn.\n   Harley Davidson did that with the LiveWire, which began as a concept and developed into the manufacturer’s first production EV, released in late 2019. The voltage powered two-wheeler is meant to complement, not replace, HD’s premium internal-combustion cruisers.\n Founded in Milwaukee in 1903, Harley-Davidson  opened a Silicon Valley office in 2018 with plans to add a future line-up of electric vehicles — from motorcycles to bicycles to scooters. The $29,799 LiveWire was first, though waning earnings and the Covid-19 induced recession have put HD’s electric plans in question.\n On key specs, the Livewire will do 0-60 mph in 3 seconds, reach 110 mph and charge to 80% in 40 minutes on a  DC Fast Charger. The motorcycle’s 15.5 kWh battery and magnet motor produce 86 ft-lbs of torque.\n  The 548 pound Livewire has an advertised city range of 146 miles (and 95 for combined city/highway riding).The electric Harley is also an IoT and app compatible vehicle, with preset riding modes — that offer different combos of power, torque and regen braking — and the ability to create custom modes.\n Harley Davidson added some premium features to the LiveWire, such as key fob operation, an anti-theft control system and a heartbeat-like vibration on the motorcycle.\n That’s useful to remind the rider that the LiveWire — which goes silent at a stop — is still in run mode. In motion, the bike is basically quiet, though Harley-Davidson — famous for its internal combustion rumble — created a signature electric sound generated from the vehicle’s mechanical movements. It’s a barely audible buzz that gives the motorcycle a distinct voice as an electric Harley.\n  As an e-motorcycle, the LiveWire is remarkably balanced for a two-wheeler that has so much mass concentrated in one place: the battery.\n At over 500 pounds, it isn’t exactly heavy by Harley cruiser standards, but the LiveWire is hefty for a naked sport bike. You definitely feel that weight pushing the EV around the garage, but fortunately — with some clever frame engineering — it fades away once the LiveWire gets rolling.\n When I tested the  LiveWire on a track in 2019, I noted that it brought everything that was becoming the e-motorcycle experience: huge torque and lightning-like acceleration with little noise beyond the wind moving around you.\n More time and riding conditions with the LiveWire led to a stronger appreciation. I took it down the Hudson River Valley into Manhattan, up to three digits on I-95, and on the twisty backroads outside of Greenwich. The LiveWire looks and performs the part of a high-performance e-motorcycle, and in many ways, offers a more exciting ride than anything piston powered.\n  The biggest rush on a LiveWire, compared to ICE peers, is the torque and acceleration. With fewer mechanical moving parts than gas bikes — and no clutch or shifting — the power delivery is stronger and more constant than internal combustion machines. You simply twist and go.\n Like other high performance e-motorcycles, the LiveWire’s regenerative braking — or the extent to which the motor recharges the battery and slows the rear wheel coming off throttle — also enhances performance. Regen braking can be adjusted manually or by riding mode on the electric HD.\n It takes some skill, but the end result is the ability to fly through corners in a smoother manner than a gas motorcycle — with little to no mechanical braking — by simply rolling off and on the throttle. This is complemented by the motorcycle’s lateral handling. In turns, the LiveWire holds a line as precisely as a Tron light-cycle (at least that’s how it felt conceptually).\n This all translates into a riding experience of uninterrupted forward movement, without any racket and rattling. That the motorcycle also looks great— with lines and styling that hit the marks for an EV and a Harley — adds even more.\n  With the LiveWire debut, Harley-Davidson became the first of the big gas manufacturers to offer a street-legal e-motorcycle for sale in the U.S.\n The move is something of a necessity for the company, which, like most of the motorcycle industry in the U.S., has been bleeding revenue and younger buyers for years.\n While HD got the jump on traditional motorcycle manufacturers, such as Honda and Kawasaki, it’s definitely not alone in the two-wheeled electric space.\n Harley-Davidson entered the EV arena with competition from several e-moto startups that are attempting to convert gas riders to electric and attract a younger generation to motorcycling.\n One of the leaders is California startup Zero Motorcycles, with 200 dealers worldwide.  Italy’s Energica is expanding distribution of its high-performance e-motos in the U.S.\n  And Canadian startup  Damon Motors debuted its 200 mph, $24,000 Hypersport this year, which offers proprietary safety and ergonomics tech for adjustable riding positions and blind-spot detection.\n Of course, it’s not evident there’s enough demand out there to buy up all these new models, particularly given the COVID-19-induced global recession.\n On the LiveWire’s market success (or failure), its tough to assess since  HD’s reporting doesn’t include LiveWire-specific sales data.  One thing I ( and others) have been critical of is the motorcycle’s $29,000 price. At just several thousand dollars less than an  Tesla Model 3, it’s just too high — even for a premium motorcycle. But price aside, and that’s a big aside, I’d still argue the company succeeded with the LiveWire in a couple big ways. Harley-Davidson created an exciting  halo motorcycle that established it as a legitimate e-motorcycle manufacturer — in a distinctly Harley-Davidson fashion — while capturing public interest for its EV program.\n  For a company to reap the benefits a of successful halo launch, it needs to create a more accessible sequel. In July, Harley-Davidson’s newly appointed CEO,  Jochen Zeitz, announced a five year plan — dubbed The Rewire — to adjust to declining sales and lead the company into the future. The strategy includes a massive  restructuring and holding on (or even cancelling) some previously announced programs, such Harley’s gas powered Bronx model.\n On whether the LiveWire — and producing new EVs — remain in Harley-Davidson’s future, Zeitz hasn’t been specific in confirming that in recent  statements or  investor calls.\n  After some intimate time getting to know HD’s debut electric motorcycle, and assessing the market, my vote is for the iconic American company to continue its EV program and give us more. Offer a follow on that makes the rush, excitement and on demand capabilities of the halo Livewire available to the mases.\n I could envision the company’s next EV product release including a scooter offering — registering Harley in the urban mobility space — and a more affordable e-motorcycle with broad market appeal.\n What could that look like? Something priced around $10,000, lighter and more accessible to beginner riders than the 549-pound LiveWire, cloud and app connected with at least 100 miles of range and a charge time of 30 to 40 minutes. A tracker-styled EV channeling Harley’s  flat-track racers — with some off-road capability — could also help HD hit the mark.\n  Getting it all right on specs, style and price-point will be even more critical for HD in a COVID-19 economic environment, where spending appetites for motorcycles will be more conservative for the foreseeable future.\n But continuing the commitment to production EV’s is still Harley-Davidson’s bet to reach a younger market and remain relevant in the 21st century mobility world. HD’s Rewire should definitely include more LiveWire.", "posttime": "2020-10-15 01:14:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "戴维森,davidson,livewire", "title": "\n哈雷戴维森应该继续生产电动摩托车", "title_en": "\n\t\t\t\tHarley-Davidson should keep making e-motorcycles\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/harley-davidson-should-keep-making-e-motorcycles/", "via": "", "real_tags": ["戴维森", "davidson", "livewire"]}, {"category": "", "categoryclass": "", "imagename": "d86e8e80aa98eef71024f22b4e5cc78f.jpg", "infoid": 1028841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Accurics是一家为云环境提供“自我修复”基础设施的公司，已经筹集了2000万美元。一位发言人说，这笔资金将用于支持Accurics的35人员工队伍，以寻求获得客户的机会。\n根据思科最近的一项调查，到2021年，云数据中心将处理94%的工作负载。但LogicMonitor报告称，尽管如此，超过三分之二的组织仍然将安全视为最大的采用挑战。据估计，24%的组织在其公共云中的主机缺少高严重性补丁，49%的数据库默认情况下没有加密。\nAccurics声称通过Terrascan等工具来应对这一挑战，Terrascan在调配云基础设施之前，使用算法来减少错误配置、违反策略等跨代码库的情况。Accurics扫描“基础设施即代码”平台，包括Terraform、Kubernetes YAML和OpenFaaS YAML，以检测和补救违反策略的行为和潜在的违规路径。在运行时，该平台可以跨Amazon Web Services、Azure和Google Cloud Platform环境识别对部署的云应用程序的更改，并评估风险。\n根据Accurics的说法，Terrascan提供了500多个开箱即用的策略，这样客户就可以利用支持自定义策略的引擎和查询语言来检查策略标准。Terrascan可以通过命令行界面集成到管道中，以画布GitHub、Slake、Jira、Bitbucket和GitLab中的代码库。它还可以在持续集成和持续交付阶段充当屏障，通过识别实现攻击的潜在路径来检测违规并阻止风险构建。\n更广泛的Accurics平台会生成代码来解决问题，并将它们作为拉请求签入存储库。客户只需审核请求即可接受更改；Accurics会自动向相应的开发人员发出通知。此外，Accurics可以将云环境回滚到最后已知的安全基线，以应对风险，并通过检测资源、配置和它们之间的依赖关系，跨基础设施生成拓扑来对威胁进行建模。\nAccurics首席执行官萨钦·阿加瓦尔(Sachin Aggarwal)声称，随着越来越多的企业拥抱云计算，网络弹性将变得越来越重要。他说，云原生基础设施的核心安全问题是，它是以编程方式构建和配置的，使用基础设施作为代码，这使得使用手动方法很难跟上高速变化的步伐。\n“云为创新、速度和工作效率提供了无尽的潜力--但只有在安全能够扩展以跟上的情况下才能实现。Aggarwal在2019年初与赛门铁克(Symantec)和帕洛阿尔托网络(Palo Alto Networks)的前高管一起创立了Accurics，他通过电子邮件告诉VentureBeat。“我们的方法是不同的：我们认为，云中有效的网络弹性只能通过自愈云本地基础设施和将整个开发生命周期的安全性编入法典来实现。”\n显然，客户同意Aggarwal对云相关风险的评估。Accurics的客户群包括NBA、LendingClub、Automation Anywhere和ServiceMax。\n2000万美元的资金来自500万美元的种子轮和过去六个月结束的首轮A轮。这两家公司都得到了ClearSky和英特尔资本(Intel Capital)的参与；Accurics之前的投资者包括WestWave Capital、Firebolt Ventures和Secure Octane。", "note_en": "Accurics, a company providing what it describes as “self-healing” infrastructure for  cloud environments, has raised $20 million. A spokesperson says the funding will be used to bolster Accurics’ 35-person workforce as it pursues customer acquisition opportunities.\n Cloud datacenters will process 94% of workloads in 2021, according to a recent  survey from Cisco. But be that as it may, over two-thirds of organizations continue to see security as the biggest adoption challenge, LogicMonitor  reports. An  estimated 24% of organizations have hosts in their public clouds that are missing high-severity patches, and 49% of databases aren’t encrypted by default.\n  Accurics purports to address this challenge with tools like Terrascan, which employs algorithms to mitigate misconfigurations, policy violations, and more across codebases prior to provisioning cloud infrastructure. Accurics scans “infrastructure as code” platforms including Terraform, Kubernetes YAML, and OpenFaaS YAML to detect and remediate policy violations and potential breach paths. In runtime, the platform can identify changes to deployed cloud applications across Amazon Web Services, Azure, and Google Cloud Platform environments and assess for risk.\n According to Accurics, Terrascan provides over 500 out-of-the-box policies so that customers can check against policy standards, leveraging an engine that supports custom policies with a query language. Terrascan can be integrated into pipelines to canvas code repositories in GitHub, Slack, Jira, Bitbucket, and GitLab via a command-line interface. It can also act as a guardrail during the continuous integration and continuous delivery phase to detect violations and block risky builds by identifying potential paths to achieving attacks.\n The broader Accurics platform generates code to resolve issues and checks them into repositories as pull requests. Customers need only review requests to accept the changes; Accurics alerts the appropriate developer automatically with notifications. Moreover, Accurics can roll back cloud environments to the last known secure baseline to address risks, generating a topology across infrastructure to model threats by detecting resources, configurations, and dependencies among them.\n Accurics CEO Sachin Aggarwal makes the claim that cyber resilience will become increasingly important as more businesses embrace the cloud. The core security issue with cloud-native infrastructure is that it’s programmatically built and provisioned using infrastructure as code, he says, making it difficult to keep pace with the high velocity of change using manual approaches.\n “The cloud offers endless potential for innovation, speed, and productivity — but only when security can scale to keep up. So far, that has not been the case,” Aggarwal, who cofounded Accurics in early 2019 along with former executives from Symantec and Palo Alto Networks, told VentureBeat via email. “Our approach is different: We believe that effective cyber resilience in the cloud can only be achieved through self-healing cloud-native infrastructure and codifying security throughout the development lifecycle.”\n Evidently, customers are in agreement with Aggarwal’s assessment of risks associated with the cloud. Accurics counts the NBA, LendingClub, Automation Anywhere, and ServiceMax among its client base.\n The $20 million in funding came from a $5 million seed round and a series A round closed in the past six months. Both had participation from ClearSky and Intel Capital; previous Accurics investors include WestWave Capital, Firebolt Ventures, and Secure Octane.", "posttime": "2020-10-15 01:13:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "环境,series,accurics", "title": "Accurics为云环境提供“自我修复”的基础设施，从ClearSky、Intel Capital和其他公司筹集了2000万美元的种子和首轮融资", "title_en": "Accurics, which offers “self-healing” infrastructure for cloud environments, raises $20M seed and Series A from ClearSky, Intel Capital, and others", "transed": 1, "url": "https://venturebeat.com/2020/10/13/accurics-raises-20-million-for-self-healing-cloud-monitoring-tools/", "via": "", "real_tags": ["环境", "series", "accurics"]}, {"category": "", "categoryclass": "", "imagename": "9df79c5a555b03aa2e4acc6161ccf78c.png", "infoid": 1028839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很高兴地宣布，从下周开始，Zoom的端到端加密(E2EE)服务将以技术预览的形式提供，这意味着我们将在前30天主动征求用户的反馈。全球免费和付费的Zoom用户可以在Zoom上接待多达200名参与者参加E2EE会议，为您的Zoom会话提供更高的隐私和安全性。\n我们在5月份宣布，我们计划在Zoom已经很强大的加密和高级安全功能的基础上，在我们的平台上构建一个端到端加密的会议选项。我们很高兴推出我们的E2EE产品的4个阶段中的1个阶段，该阶段提供强大的保护，以帮助防止可用于监控会议内容的解密密钥被拦截。\n需要说明的是，Zoom的E2EE使用与Zoom会议相同的强大GCM加密。唯一的区别是这些加密密钥存储在哪里。\n在典型的会议中，Zoom的云会生成加密密钥，并在与会者加入时使用Zoom应用程序将其分发给与会者。通过Zoom的E2EE，会议主持人生成加密密钥，并使用公钥密码术将这些密钥分发给其他会议参与者。ZOOM的服务器变成了不经意的中继，永远看不到解密会议内容所需的加密密钥。\nZoom首席执行官埃里克·S·袁说：“端到端加密是向使Zoom成为世界上最安全的通信平台迈出的又一大步。”我们E2EE产品的这一阶段提供与现有的端对端加密信息传送平台相同的安全性，但具有使Zoom成为数亿人和世界上最大企业首选的通信解决方案的视频质量和规模。“。\n下周，Zoom的E2EE将作为技术预览版面市。要使用它，客户必须在帐户级别启用E2EE会议，并在每次会议的基础上选择加入E2EE。\nZoom的E2EE产品使用公钥加密技术。简而言之，每个Zoom会议的密钥都是由参与者的机器生成的，而不是由Zoom的服务器生成的。由于Zoom的服务器没有必要的解密密钥，因此Zoom无法破译通过Zoom的服务器中继的加密数据。此密钥管理策略类似于目前大多数端到端加密消息传递平台使用的策略。\n主机可以在帐户、组和用户级别启用E2EE设置，并且可以在帐户或组级别锁定。所有参与者都必须启用该设置才能加入E2EE会议。在阶段1中，所有会议参与者必须从Zoom桌面客户端、移动应用程序或Zoom Room加入。\n当您希望增强会议的隐私和数据保护时，E2EE是最佳选择，它是降低风险和保护敏感会议内容的额外一层。虽然E2EE提供了更高的安全性，但在这个第一个E2EE版本中，某些缩放功能是有限的(下面将详细介绍)。在会议中启用此版本的E2EE之前，个别Zoom用户应确定是否需要这些功能。\n现在不行。在您的会议中启用此版本的Zoom的E2EE会禁用某些功能，包括在主持之前加入、云录制、流、实时转录、分组会议室、轮询、1：1私人聊天和会议反应。\n是。从Zoom的桌面客户端或移动应用程序或Zoom Room加入的免费和付费Zoom账户可以主持或加入E2EE会议。\n默认情况下，缩放会议和网络研讨会对缩放应用程序、客户端和连接器之间传输的音频、视频和应用程序共享(即屏幕共享、白板)使用AES 256位GCM加密。在未启用E2EE的会议中，在用户的Zoom应用程序之间流动的音频和视频内容在到达收件人的设备之前不会解密。但是，每次会议的加密密钥都是由Zoom的服务器生成和管理的。在启用了E2EE的会议中，除了每个参与者-即使是Zoom的服务器-没有人可以访问用于加密会议的加密密钥。\n与会者可以在其会议屏幕的左上角看到一个绿色盾牌徽标，中间有一个挂锁，表示他们的会议正在使用E2EE。它看起来类似于我们的GCM加密符号，但复选标记被替换为锁。\n与会者还将看到他们可以用来验证安全连接的会议负责人的安全代码。主办方可以大声读出此代码，所有参与者都可以检查其客户端是否显示相同的代码。\nZOOM的首要任务是用户的信任和安全，我们实施E2EE将使我们能够继续增强我们平台上的安全性。寻求访问E2EE的免费/基本用户将参与一次性验证过程，该过程将提示用户提供其他信息，例如通过文本消息验证电话号码。许多领先的公司都会采取类似的步骤来减少大量创建滥用账户的情况。我们相信，通过实施基于风险的身份验证，结合我们目前的工具组合-包括我们与人权和儿童安全组织的合作，以及我们的用户锁定会议、报告滥用情况的能力，以及作为我们安全图标的一部分提供的无数其他功能-我们可以继续增强用户的安全。\n我们计划推出更好的身份管理和E2EE单点登录集成，作为第二阶段的一部分，该阶段暂定为2021年的路线图。\n要了解有关对Zoom会议使用端到端加密和其他安全功能的更多信息，请访问Zoom的安全网页。", "note_en": "We’re excited to announce that starting next week, Zoom’s end-to-end encryption (E2EE) offering will be available as a technical preview, which means we’re proactively soliciting feedback from users for the first 30 days. Zoom users – free and paid – around the world can host up to 200 participants in an E2EE meeting on Zoom, providing increased privacy and security for your Zoom sessions.\n We  announced in May our plans to build an end-to-end-encrypted meeting option into our platform, on top of Zoom’s already strong encryption and advanced security features. We’re pleased to roll out Phase 1 of 4 of our E2EE offering, which provides robust protections to help prevent the interception of decryption keys that could be used to monitor meeting content.\n  To be clear, Zoom’s E2EE uses the same powerful GCM encryption you get now in a Zoom meeting. The only difference is where those encryption keys live.\n In typical meetings, Zoom’s cloud generates encryption keys and distributes them to meeting participants using Zoom apps as they join. With Zoom’s E2EE, the meeting’s host generates encryption keys and uses public key cryptography to distribute these keys to the other meeting participants. Zoom’s servers become oblivious relays and never see the encryption keys required to decrypt the meeting contents.\n “End-to-end encryption is another stride toward making Zoom the most secure communications platform in the world,” said Zoom CEO Eric S. Yuan. “This phase of our E2EE offering provides the same security as existing end-to-end-encrypted messaging platforms, but with the video quality and scale that has made Zoom the communications solution of choice for hundreds of millions of people and the world’s largest enterprises.”\n Zoom’s E2EE will be available as a technical preview next week. To use it, customers must enable E2EE meetings at the account level and opt-in to E2EE on a per-meeting basis.\n    Zoom’s E2EE offering uses public key cryptography. In short, the keys for each Zoom meeting are generated by participants’ machines, not by Zoom’s servers. Encrypted data relayed through Zoom’s servers is indecipherable by Zoom, since Zoom’s servers do not have the necessary decryption key. This key management strategy is similar to that used by most end-to-end encrypted messaging platforms today.\n  Hosts can enable the setting for E2EE at the account, group, and user level and can be locked at the account or group level. All participants must have the setting enabled to join an E2EE meeting. In Phase 1, all meeting participants must join from the Zoom desktop client, mobile app, or Zoom Rooms.\n  E2EE is best for when you want enhanced privacy and data protection for your meetings, and is an extra layer to mitigate risk and protect sensitive meeting content. While E2EE provides added security, some Zoom functionality is limited in this first E2EE version (more on that below). Individual Zoom users should determine whether they need these features before enabling this version of E2EE in their meetings.\n  Not right now. Enabling this version of Zoom’s E2EE in your meetings disables certain features, including join before host, cloud recording, streaming, live transcription, Breakout Rooms, polling, 1:1 private chat, and meeting reactions.\n  Yes. Free and paid Zoom accounts joining from Zoom’s desktop client or mobile app, or from a Zoom Room, can host or join an E2EE meeting.\n  Zoom meetings and webinars by default use AES 256-bit GCM encryption for audio, video, and application sharing (i.e., screen sharing, whiteboarding) in transit between Zoom applications, clients, and connectors. In a meeting without E2EE enabled, audio and video content flowing between users’ Zoom apps is not decrypted until it reaches the recipients’ devices. However, the encryption keys for each meeting are generated and managed by Zoom’s servers. In a meeting with E2EE enabled, nobody except each participant – not even Zoom’s servers – has access to the encryption keys being used to encrypt the meeting.\n  Participants can look for a green shield logo in the upper left corner of their meeting screen with a padlock in the middle to indicate their meeting is using E2EE. It looks similar to our GCM encryption symbol, but the checkmark is replaced with a lock.\n  Participants will also see the meeting leader’s security code that they can use to verify the secure connection. The host can read this code out loud, and all participants can check that their clients display the same code.\n   Zoom’s top priority is the trust and safety of our users, and our implementation of E2EE will allow us to continue to enhance safety on our platform. Free/Basic users seeking access to E2EE will participate in a one-time verification process that will prompt the user for additional pieces of information, such as verifying a phone number via text message. Many leading companies perform similar steps to reduce the mass creation of abusive accounts. We are confident that by implementing risk-based authentication, in combination with our current mix of tools — including our work with human rights and children’s safety organizations and our users’ ability to lock down a meeting, report abuse, and a myriad of other features made available as part of our security icon — we can continue to enhance the safety of our users.\n  We plan to roll out better identity management and E2EE SSO integration as part of Phase 2, which is tentatively roadmapped for 2021.\n To learn more about using end-to-end encryption and other security features for your Zoom meetings, visit  Zoom’s security webpage.", "posttime": "2020-10-15 01:08:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扩展,rolling,zoom", "title": "缩放扩展端到端加密产品", "title_en": "Zoom Rolling Out End-to-End Encryption Offering", "transed": 1, "url": "https://blog.zoom.us/zoom-rolling-out-end-to-end-encryption-offering/", "via": "", "real_tags": ["扩展", "rolling", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "906bbe0b220ca6954a84eead318eea91.png", "infoid": 1028838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "边界是一种开源解决方案，可自动实现基于身份的用户跨环境对主机和服务的安全访问。", "note_en": "Boundary is an open source solution that automates a secure identity-based user access to hosts and services across environments.", "posttime": "2020-10-15 01:08:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,来自,security,安全", "title": "边界：来自HashiCorp的新安全开源工具", "title_en": "Boundary: New security open source tool from HashiCorp", "transed": 1, "url": "https://www.boundaryproject.io/", "via": "", "real_tags": ["开源", "来自", "security", "安全"]}, {"category": "", "categoryclass": "", "imagename": "5b3344ade9d51d5e3289b3e310e8ed29.jpg", "infoid": 1028837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉正在紧锣密鼓地建设其位于柏林郊外的新工厂。留给德国汽车制造商的只有观察和学习。", "note_en": "Tesla is racing ahead with construction of its new factory just outside of Berlin. All that's left for German carmakers is to watch and learn.", "posttime": "2020-10-15 01:08:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,马斯克,musk,紧锣密鼓", "title": "埃隆·马斯克向德国人展示如何快速行动", "title_en": "Elon Musk Shows the Germans How to Move Quickly", "transed": 1, "url": "https://www.spiegel.de/international/business/the-tesla-factory-near-berlin-elon-musk-shows-the-germans-how-to-move-quickly-a-a14a3415-a4ed-4d85-80c1-ec53b66ac0cb", "via": "", "real_tags": ["埃隆·马斯克", "马斯克", "musk", "紧锣密鼓"]}, {"category": "", "categoryclass": "", "imagename": "b267d3b928bfd5440046f1849a6c5fab.png", "infoid": 1028836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在上个月，当我们第一次接触到马里奥卡丁车直播：家庭巡回赛的概念时，它似乎是我们听说过的最聪明的增强现实实现之一。一辆带摄像头的遥控马里奥卡丁车，可以让你在交换机上把你的房子当成一个虚拟的赛道来看？会出什么差错？\n在我家和马里奥赛车直播(Mario Kart Live)待了大约一周后(还有一位热切的6岁合作测试员)，我在这个现实世界的新奇事物中发现了很多想象中的乐趣。然而，一旦新鲜感消退，这种特殊的现实世界实施的现实和烦恼让我想知道，这个想法有多大的长期吸引力。", "note_en": "When we were first introduced to the concept of  Mario Kart Live: Home Circuit  just last month, it seemed like one of the most clever implementations of &#34;augmented reality&#34; we&#39;d ever heard of. A remote-controlled Mario Kart with a camera that lets you view your house as a virtual race course on your Switch? What could go wrong?\n After spending about a week with  Mario Kart Live in my house (complete with an eager six-year-old co-tester), I found a lot of imaginative fun in the novelty of this &#34;real world&#34; Mario Kart. Once the novelty wore off, though, the realities and annoyances of this particular &#34;real-world&#34; implementation left me wondering how much long-term appeal there is to the idea.", "posttime": "2020-10-15 00:55:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "kart,现实", "title": "Mario Kart Live是一个有趣的借口，尽管有缺陷，但它可以让你在房子里跑来跑去", "title_en": "Mario Kart Live is a fun, if flawed, excuse to race around the house", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/mario-kart-live-is-a-fun-if-flawed-excuse-to-race-around-the-house/", "via": "", "real_tags": ["kart", "现实"]}, {"category": "", "categoryclass": "", "imagename": "17bfe9d0bf95190f7b910aab1f82d8e3.jpg", "infoid": 1028835, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX是有资格在联邦拍卖中竞标农村宽带资金的386家实体之一。\n迄今为止，SpaceX克服了联邦通信委员会(Federal Communications Commission)的疑虑，即其低地球轨道(LEO)卫星服务Starlink能否提供低于100ms的延迟，从而有资格参加拍卖的低延迟级别。由于FCC的农村数字机会基金(RDOF)将向ISP发放高达160亿美元的资金，FCC最初将SpaceX列入不完整的申请名单，其中包括那些没有证明他们有资格竞标所需性能和延迟级别的ISP。FCC还表示，LEO提供商在低延迟级别的竞标将面临巨大挑战，因为他们必须向欧盟委员会的工作人员证明，他们的网络可以向低于欧盟委员会100ms低延迟门槛的消费者提供真实的性能。\n这种情况昨天发生了变化，FCC公布了有资格参加定于10月29日开始的拍卖的竞标者名单。除了SpaceX，合格的竞标者还包括Altice USA、CenturyLink、Charge、辛辛那提贝尔(Cincinnati Bell)、考克斯(Cox)、Frontier、休斯(Hughes)、US Ccell、Verizon、Viasat、Windstream以及许多较小的公司。有119名申请者没有进入最终名单。\nSpaceX似乎是获批申请者名单中唯一的LEO卫星提供商，但有一个部分例外：传统卫星提供商休斯(Hughes)是OneWeb的投资者，并表示将利用OneWeb的LEO能力作为竞标的一部分，以获得RDOF资金。处于破产状态的OneWeb不会在拍卖本身进行竞标。ViaSat正在考虑进入LEO卫星，但与休斯一样，Viasat目前使用的地球同步卫星延迟很差，约为600ms。\nSpaceX的Starlink服务还处于有限的测试阶段，似乎提供的延迟远远低于100ms的门槛。SpaceX仍然不能保证获得FCC的资金。拍卖结束后，中标者将不得不提交冗长的申请书，详细说明他们将如何满足部署要求，以便获得资金的最终批准。\n拍卖中可用的160亿美元将在10年内分配给ISP，向所有中标者支付每年高达16亿美元的费用，用于在特定地区部署宽带。从理论上讲，SpaceX卫星服务可以在任何地方提供，而且不需要为每个家庭布线，所以这笔资金不一定会扩大Starlink的可用范围。但卫星运营商可以利用FCC资金作为补贴，允许他们在缺乏现代宽带接入的地区收取更低的价格。\nSpaceX公司首席执行官埃隆·马斯克表示，该公司已经发射了足够多的卫星进行相当广泛的公开测试，美国北部和加拿大南部有望有更多客户使用。这并不意味着SpaceX将仅限于在美国北部竞标，因为该公司将能够扩大供应，因为它将发射更多授权部署的近1.2万颗卫星。\n160亿美元的资金将流向人口普查区，那里没有提供商报告提供至少25 Mbps的下行和3 Mbps的上行家庭互联网速度。批准的人口普查区块名单中包含530万户无服务的家庭和企业。\nFCC民主党人批评主席阿吉特·派(Ajit Pai)在没有首先完成更准确的宽带可用性数据收集的情况下就继续拍卖。PAI正在推进拍卖，但他也为RDOF的第二阶段奠定了基础，该阶段最终应该会在数据收集后发现没有服务的地区分配至少44亿美元。联邦通信委员会的当前数据将一个人口普查区视为已提供服务的，即使该社区中只有一个家庭提供服务-互联网服务提供商必须提交的新数据将包括地理空间地图，以识别更多未提供服务的家庭和企业。\nRDOF和FCC的其他普遍服务项目一样，是由美国人通过电话费支付的。", "note_en": "SpaceX is one of 386 entities that have qualified to bid in a federal auction for rural-broadband funding.\n SpaceX has so far overcome the Federal Communications Commission&#39;s doubts about whether Starlink, its low Earth orbit (LEO) satellite service, can provide latency of less than 100ms and thus qualify for the auction&#39;s low-latency tier. With the FCC&#39;s Rural Digital Opportunity Fund (RDOF) set to distribute up to $16 billion to ISPs, the FCC  initially placed SpaceX on the &#34;incomplete application&#34; list, which includes ISPs that had not shown they were qualified to bid in their desired performance and latency tiers. The FCC also  said that LEO providers &#34; will face a substantial challenge&#34; obtaining approval to bid in the low-latency tier because they must &#34;demonstrat[e] to Commission staff that their networks can deliver real-world performance to consumers below the Commission&#39;s 100ms low-latency threshold.&#34;\n  That changed yesterday, when the FCC  announced the list of bidders that qualified for the auction that is scheduled to begin on October 29. Besides SpaceX,  qualified bidders include Altice USA, CenturyLink, Charter, Cincinnati Bell, Cox, Frontier, Hughes, US Cellular, Verizon, Viasat, Windstream, and many smaller companies. There were 119 applicants that did not make the final list.\n SpaceX appears to be the only LEO satellite provider in the approved list of applicants, with a partial exception: Hughes, a traditional satellite provider, is  an investor in OneWeb and  has said it will use OneWeb&#39;s LEO capacity as part of its bid to get RDOF money. OneWeb, which is in bankruptcy, is not bidding in the auction itself. Viasat is  considering a move into LEO satellites but, like Hughes, Viasat today uses geostationary satellites with poor latencies of  around 600ms.\n SpaceX&#39;s Starlink service is in a limited beta and  appears to be providing latencies well under the 100ms threshold. SpaceX still isn&#39;t guaranteed to get FCC funding. After the auction, winning bidders will  have to submit &#34;long-form&#34; applications with more detail on how they will meet deployment requirements in order to get the final approval for funding.\n  The $16 billion available in the auction will be distributed to ISPs over ten years, paying all winning bidders combined up to $1.6 billion a year to deploy broadband in specified areas. SpaceX satellite service could theoretically be made available anywhere and doesn&#39;t require wiring up individual homes, so this funding won&#39;t necessarily expand the areas of availability for Starlink. But satellite operators can use FCC funding as subsidies allowing them to  charge lower prices in areas that lack modern broadband access.\n SpaceX  CEO Elon Musk says the company has launched enough satellites for a &#34;fairly wide public beta&#34; that will be available to more customers in the northern US and &#34;hopefully&#34; in southern Canada. That doesn&#39;t mean SpaceX will be limited to bidding in the northern US, as the company will be able to expand availability as it launches more of the  nearly 12,000 satellites it is authorized to deploy.\n The $16 billion in funding will be directed to census blocks where no provider reports offering home-Internet speeds of at least 25Mbps downstream and 3Mbps upstream. The  list of approved census blocks contains 5.3 million unserved homes and businesses.\n FCC Democrats have criticized Chairman Ajit Pai for proceeding with the auction without first completing the  pending collection of more accurate broadband-availability data. Pai is pressing forward with the auction, but he also laid the groundwork for a second phase of the RDOF that should eventually distribute  at least $4.4 billion in areas that are found to be unserved after the data collection. The FCC&#39;s current data counts a census block as served even if only one home in the block has service—the new data that ISPs must submit will include geospatial maps to identify more unserved homes and businesses.\n The RDOF, like the FCC&#39;s other universal service programs, is paid for by Americans through fees on their phone bills.", "posttime": "2020-10-15 00:54:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宽带,fcc,spacex", "title": "SpaceX获得FCC批准参加160亿美元的农村宽带拍卖", "title_en": "SpaceX gets FCC approval to bid in $16 billion rural-broadband auction", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/spacex-gets-fcc-approval-to-bid-in-16-billion-rural-broadband-auction/", "via": "", "real_tags": ["宽带", "fcc", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "bfd59223aeac464dfde258d5171bf73c.jpg", "infoid": 1028834, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是True的大量承诺资本，True是由乔恩·卡拉汉(Jon Callaghan)和菲尔·布莱克(Phil Black)创立并继续领导的。它也是一家比以前更大的公司，整个公司有35人，其中包括投资方面的其他10人，以及公司财务、运营和平台团队的其他同事。\n特别容易理解True为什么要募集另一只规模略大的机会基金(其上一只基金在2018年以2.85亿美元收盘，上一只早期基金同期以3.5亿美元收盘)。通过其中一个工具，True能够对消费者健身公司peloton进行如此多的投资，包括其F系列融资，以至于当peloton去年秋天上市时，True是第二大外部股东。\n佩洛顿在首次公开募股(IPO)时的定价为72亿美元，现在估值超过380亿美元-True仍在参与其中。\n本周早些时候，我们与卡拉汉和布莱克讨论了True如何以及何时平仓一家上市投资组合公司的问题。我们还谈到了该公司继续强调为其创始人和他们的团队创建支持网络，他们是否担心创业投资的中心正从旧金山湾区转移出去，等等。下面的大部分聊天内容都经过了长度方面的编辑。\nPB：数字更大，但这是很多人的作用，他们希望成为我们正在做的事情的一部分。我们还有一个更大的团队。\nJC：超过90%的有限合伙人重新融资；我们的需求远远超过了供应，包括因为我们认为每次筹集基金时都要从新的关系中引入新的资金，通常是来自我们认识很长时间的人。我们正在积极地与我们的LP基础进行接触，这为我们提供了新的思维。\nTC：这些风投公司有很多吗？似乎越来越多的人都是其他人基金的投资者。\nPB：我们有基金的基金，比如GreenSpring Associates和Foundry Group Next(作为投资者)。我确实认为，当涉及到规模较小、价值低于5000万美元的基金时，你会看到(风险基金投资于风险基金)，但这不适用于我们。\nTC：随着时间的推移，你已经为一家公司20%的股份开了相当小的早期支票。在这个市场上还能做到吗？\nJC：我们的核心业务保持不变。我们从第一天开始就给创始人或小团队写了100万到300万美元。我们在看待事物的方式上进行了某种程度上的磨练。。我们已经在我们的平台上投资了1500万美元，大约10年了(以扩大我们团队和更广泛的网络)。如果我在你的董事会里，而且我是你唯一的联络点，那么我就是薄弱环节。\nTC：你们有创业者训练营、True University和许多文化倡议。就多元化而言，您如何评价这家公司？\nJC：我们正在努力做得更好，但我们作为一个行业还不够好，我们是这个行业的一部分。我们资助了非常有权势的女性企业家和一些有色人种，但这还不够，我们现在正在寻找长期的解决方案。我们还非常关注奖学金[True通过奖学金招募大学生-165人，而且还在不断增加-在True支持的初创公司工作，其中一半人后来在这些公司找到了全职工作]。\n我们一直关注性别平等，在过去的两个班级中，我们更倾向于女性，但我们也关注不同的候选人和不同的背景。我们需要提供更多进入科技和初创企业的途径，通过奖学金，我们可以在学生考虑职业发展之前接触到他们。\nTC：你投资的一家公司，Peloton，今年表现特别好。你的那个职位卖完了吗？你对公司上市后返还有限责任公司的资金有何看法？\nJC：我们仍然持有该公司的股票，我也仍然持有该公司的股票。\nPB：我们是出售股票还是分发股票，真的要看具体情况。这需要时间，因为我们通常是大股东，我们收回资本的能力受到公开市场和(我们拥有的)[数量]的限制。至于我们是派现金还是派股票，通常有限合伙人都喜欢股票。许多家族理财室和基金的基金会更喜欢这些股票，因为他们会将它们转介给他们的公共股票组。其他一些人，特别是欧洲投资者，出于税收或其他原因更喜欢现金。但我们更愿意把股票交给他们，让他们做出卖出的决定。\nTC：我们开始看到更多的SPAC，或特殊目的收购公司，由风险基金发起。你觉得这些是什么？\nPB：乔恩和我在这里呆了很长时间，还记得SPAC还只是个四个字母的词的时候。我认为他们今天是比20年前更好的乐器。我们的一些公司正在考虑这些问题；人们对募集SPAC或通过SPAC上市意味着什么充满了好奇心。人们正处于寻找信息的模式。作为一家公司，我们没有想过我们应该自己建立SPAC。\nJC：我认为围绕获得资本的创新真的很有趣。我认为现在就断言创始人和公司会有什么结果还为时过早。这是相当复杂的。我们正在密切关注这件事。\nTC：我确实认为True经常走在曲线的前面。你投资了像Fitbit和peloton这样的硬件公司，领先于其他很多多面手公司。数字健康和生物学也是如此。你现在感兴趣的是什么？\nJC：我们的工作是倾听我们的创始人给我们发来了什么，我们正在考虑的一个领域是工作的未来-不是一年而是五年后会发生什么。第二个是我们称之为咆哮的20多岁的主题，我的意思是我们正在研究第一次世界大战和第二次世界大战后消费者行为的变化，以及这场大流行之后在有疫苗的情况下可能会发生什么。\nJC：我们在考虑艺术、音乐、餐饮、旅游、娱乐，当百老汇开放时会发生什么？你可以想象混合体验。关于未来的工作，我不确定我们最初(一旦世界重新开放)是否会在Zoom上花费大量时间，但(我们会考虑)虚拟访问一切，以便远程员工有更多的[指尖]，以及郊区和城市会发生什么，我们已经通过(过去和现在的投资组合公司)Blue Bottle[Coffee]以及Sweetgreen和Madison Reed对此有了一些洞察。\nTC：很多公司都把远程工作变成永久性的。你认为这是不是像现在看起来的那样是一种全面的趋势，如果是这样的话，这会如何改变旧金山湾区？\nJC：我们最近有一个虚拟的场外活动，在最后30秒，每个人都在谈论我们是否可以访问COVID测试，这样我们就可以把每个人都聚集在一起。\n人们靠人际交往茁壮成长，我认为他们需要在一起。我的观点是，旧金山湾区是文艺复兴时期的佛罗伦萨窗台，它会很好的。这将需要一段时间，但由于各种原因，这仍然是许多人才想要去的地方。\nPB：我们确实认为远程会更容易，我们会看到更大的机会民主化。这段时间向我们所有人表明，您可以远程工作，因此公司可能更愿意将远程员工纳入其扩展计划。但我也不担心旧金山湾区。", "note_en": "It’s a lot of committed capital for True, which was founded and continues to be led by Jon Callaghan and Phil Black. It’s also a bigger firm than it once was, with 35 people across the firm, including 10 others on the investing side, as well as other colleagues across the firm’s finance, operations, and platform teams.\n It’s especially easy to understand why True would raise another, slightly larger opportunity fund (its last closed with $285 million in 2018, and its last early-stage fund closed with $350 million at the same time). Through one of these vehicles, True was able to invest so much in the consumer fitness company Peloton, including its Series F round, that it was the  second-largest outside shareholder when Peloton went public last fall.\n  Priced at the time of that IPO at  $7.2 billion, Peloton is now valued at more than $38 billion — and True is still involved with it.\n We talked with Callaghan and Black earlier this week about how and when True unwinds a position like that in a publicly traded portfolio company. We also talked about the firm’s continued emphasis on creating a support network for its founders and their teams, whether they worry the center of startup investing is shifting out of the Bay Area, and more. Much of chat, below, has been edited for length.\n  PB: The numbers are bigger but a function of a lot of people who would like to be a part of what we are doing. We also have a much larger team.\n JC: More than 90 percent of our LPs re-upped; we had way more demand than we had supply for, including because we think it’s important to bring in new capital from new relationships every time we raise a fund, usually from people who we’ve know for a long time. We’re actively engaged with our LP base, and it provides us with new thinking.\n TC: Are many, or any, of these VC firms? It seems increasingly that everyone is an investor in everyone else’s fund.\n PB: We have funds of funds, like Greenspring Associates and Foundry Group Next [as investors]. I do think you see [venture funds investing in venture funds] when it comes to smaller, sub $50 million funds, but it’s not applicable for us.\n TC: Over time, you’ve written fairly small early checks for 20 percent of a company. Is that still possible to do in this market?\n JC: Our core business remains exactly the same. We’re writing $1 million to $3 million from day one to a founder or small team. We’ve kind of honed it in terms of how we look at things . . .we’ve invested $15 million into our platform dating 10 years or so [to bring to bear the breadth of our team and broader network]. If I’m on your board, and I’m your only point of contact, then I’m the weak link.\n TC: You have Founder Camp, True University, and numerous culture initiatives. How would you rate the firm in terms of diversity?\n JC: We’re working hard to do better but we’re not good enough as an industry and we’re part of that industry. We’ve funded incredibly powerful women entrepreneurs and some people of color, but not enough and we’re looking at long-term solutions right now. We’re also very focused on fellowships [through which True recruits college students — 165 and counting —  to work at True-backed startups, half of whom have landed full-time employment with the companies afterward].\n We’ve always focused on gender equality and skewed more heavily toward women in last two classes, but we’re also focused on diverse candidates and on diverse backgrounds. We need to provide more pathways into tech and startups, and through fellowships, we can access students before they’re thinking about career tracts.\n TC: One of your portfolio companies, Peloton, is having an especially good year. Have you sold out of that position? How do you think about returning money to LPs after a company goes public?\n JC: We are still holders of the company’s stock and I’m still on board.\n PB: It’s really case by case whether we sell the shares or distribute them. It takes time because we’re such large shareholders typically, that our ability to get capital back is gated by public markets and [the] volume [of what we own]. As for whether we distribute cash or shares, usually LPs like the shares. A lot of family offices and fund of funds would prefer the shares because they refer them over to their public share group. Certain others, especially European investors, prefer cash for tax or other reasons. But we prefer to hand them stock and let them make the sell decision.\n TC: We’re starting to see more SPACs, or special purpose acquisition companies, launched by venture funds. What do you make of these?\n PB: Jon and I have been around long enough to remember when SPACs were a four-letter word. I think they’re a better instrument today than 20 years ago. Some of our companies are thinking about them; there’s a lot of curiosity around what it means to raise a SPAC or go public via a SPAC. People are in information-finding mode. We as a firm have not thought we should raise a SPAC ourselves.\n JC: I think the innovation around access to capital is really interesting. I think it’s too soon to tell how it will work out for the founders and the companies. It is pretty complicated. We’re watching it closely.\n TC: I do think of True as often being ahead of the curve. You were investing in hardware companies like Fitbit and Peloton ahead of a lot of other generalist firms. The same was true of digital health and biology. What’s interesting to you right now?\n JC: Our job is to listen to what our founders are sending to us, and one space we’re thinking about is the future of work — what happens not in one year but five years. The second is a theme that we’re calling the roaring 20s, and by that I mean we’re studying post-World War I and World War II and how consumer behavior changed and what might happen after this pandemic when there is a vaccine.\n  JC: We’re thinking about art, music, dining, travel, entertainment What happens when Broadway opens up? You can imagine hybrid experiences. Regarding the future of work, I’m not sure we’ll spend a lot of time on Zoom initially [once the world has re-opened], but [we think about] virtual access to everything so employees who are remote have more [at their fingertips] and what happens to suburbs versus cities, which we already have some insight into through [past and current portfolio companies] Blue Bottle [Coffee] and Sweetgreen and Madison Reed.\n TC: A lot of companies are making remote work permanent. Do you think this is as sweeping a trend as it seem right now, and how does that change the Bay Area if so?\n JC: We had a virtual offsite recently and in the last 30 seconds, everyone was talking about whether we could get access to COVID tests so we could get everyone together.\n People thrive on human contact; I think they need to be together. And my point of view is that the Bay Area is sill Florence in the Renaissance and that it will be just fine. It’s going to take a while, but this is still where a lot of talent wants to be for all kinds of reasons.\n PB: We do think remote will easier and that we’ll see a greater democratization of opportunity. This [period] has shown all of us that you can work remotely, therefore companies will probably be more willing to incorporate remote workforces into their scaling plans. But I’m also not worried about the Bay Area.", "posttime": "2020-10-15 00:50:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,invest", "title": "\nTrue Ventures还有8.4亿美元可以投资于新兴和突破性的初创企业", "title_en": "\n\t\t\t\tTrue Ventures has $840 million more to invest in nascent and breakout startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/true-ventures-has-840-million-more-to-invest-in-nascent-and-breakout-startups/", "via": "", "real_tags": ["初创", "invest"]}, {"category": "", "categoryclass": "", "imagename": "1db2e4ab16a409566e87f1d1a42a77fe.jpg", "infoid": 1028833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是周二发布的iPhone发布会最奇怪的方面之一：苹果对iPhone12和iPhone12 mini的真实价格一直没有直言不讳。\n在发布会上，苹果称这些产品的起价分别为699美元(IPhone12 Mini)和799美元(IPhone12)，但除非你在上面打一个大星号，否则这些价格实际上并不准确。(正如苹果在其营销页面上所做的那样，因为它必须这样做。)。\n事实是这样的，至少在美国是这样：苹果与美国电话电报公司(AT&amp；T)和威瑞森公司(Verizon)达成协议，向这些运营商的现有客户提供30美元的购买折扣。这两款手机的实际价格分别为729美元和829美元，如果你是Sprint、T-Mobile或任何规模较小的现收现付运营商的美国订户，或者如果你想购买完全没有运营商连接的SIM卡机型，那么你就需要支付这两款手机的价格。(12 Pro和12 Pro Max在所有运营商上的价格都是相同的。)。\n令人尴尬的是，苹果隐瞒了iPhone 12的真实价格。更令人不安的是，苹果现在乐于与其运营商合作伙伴一起玩营销游戏--不仅是iPhone 12和12 mini的价格，还包括苹果周二给Verizon首席执行官令人尴尬的屏幕时间，以便他可以推销自己公司的5G网络。\n如果您喜欢这样的文章，请支持我们成为六色订户。订阅者可以访问独家播客、仅限会员观看的故事和一个特殊的社区。", "note_en": "Here’s one of the weirdest aspects of  Tuesday’s iPhone launch event: Apple has been less than forthright about the real prices of the iPhone 12 and iPhone 12 mini.\n At the event, Apple referred to these products as starting at $699 (iPhone 12 mini) and $799 (iPhone 12), but those prices are not actually accurate unless you slap a big asterisk on there. (As Apple does on its marketing pages, because it must.)\n Here’s what’s actually happening, at least in the U.S.: Apple has cut deals with AT&amp;T and Verizon that give existing customers of those carriers $30 off their purchases. The  actual prices of the two models are $729 and $829, and that’s what you’ll pay if you’re a U.S. subscriber to Sprint, T-Mobile, any smaller pay-as-you-go carriers, or if you want to buy a SIM-free model with no carrier connection at all. (The 12 Pro and 12 Pro Max are the same price on all carriers.)\n It’s embarrassing that Apple is hiding the real price of the iPhone 12. More troubling is the suggestion that Apple is now happy to join forces with its carrier partners to play marketing games—not just with the price of the iPhone 12 and 12 mini, but with the embarrassing amount of screen time Apple gave to Verizon’s CEO on Tuesday so he could flog his company’s 5G network.\n  If you appreciate articles like this one, support us by  becoming a Six Colors subscriber. Subscribers get access to an exclusive podcast, members-only stories, and a special community.", "posttime": "2020-10-15 00:50:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,iphone,iphone12,fibs", "title": "苹果在iPhone12定价上撒谎以推广无线运营商", "title_en": "Apple Fibs About iPhone 12 Pricing To Promote Wireless Carriers", "transed": 1, "url": "https://sixcolors.com/post/2020/10/apple-fibs-about-iphone-12-pricing-to-promote-wireless-carriers/", "via": "", "real_tags": ["apple", "苹果", "iphone", "iphone12", "fibs"]}, {"category": "", "categoryclass": "", "imagename": "3021307bacb5c0087ebdd66fdd336622.png", "infoid": 1028831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很高兴宣布HashiCorp边界，这是一个新的开源项目，使从业者和运营商能够安全地访问具有细粒度授权的动态主机和服务，而不需要直接访问网络。\n边界旨在使用最低权限原则授予对关键系统的访问权限，从而解决组织在用户需要安全访问应用程序和计算机时遇到的挑战。授予系统访问权限的传统产品很麻烦，维护起来很痛苦，或者是缺乏可扩展API的黑匣子。边界允许经过身份验证和授权的用户访问专用网络中的安全系统，而无需授予访问这些系统所在的较大网络的权限。\n为了更好地了解边界是如何工作的，以及我们为什么要构建它，我们想提供几个例子，以突出用户和运营商在安全连接到应用程序和关键系统时所面临的挑战。\n下图说明了一个典型的连接工作流程，以及当用户需要远程访问位于专用网络中的生产系统时会遇到的挑战。通常，网关通过VPN或SSH堡垒主机桥接访问这些专用网络。这两种解决方案都提供了不同程度的安全性，可以为用户提供对专用网络的直接访问，而不仅仅是对预期系统的访问。\n这种传统的访问模式假设资源大多是静态的，它不太适合具有高度瞬息万变和动态环境的云。随着员工和基础设施的增长而扩展解决方案会给管理员带来额外的管理痛点和复杂性。\n一旦用户进入这些专用网络，他们就可以访问任何系统，而不仅仅是预期的目标。如果用于访问VPN或SSH主机的凭据丢失或被盗，则对手可能会访问整个网络。为防范该风险，传统工作流程通常会在这些专用网络内放置防火墙，以限制用户有权访问的内容，以防范该风险。\n但是，当授予访问权限的系统从一开始就应该遵循最小特权原则时，管理内部防火墙既耗时又浪费。边界在设计时考虑到了这些核心问题：以最低权限授予对关键系统的访问权限。\n边界的目标是简化安全访问主机和服务的工作流程，同时降低与传统解决方案相关的风险和攻击面。使用边界，访问基于用户的可信身份，而不是他们的网络位置。用户连接到边界并进行身份验证，然后根据其分配的角色可以连接到可用的主机、服务或云资源。\n受信任的身份和角色是边界中的核心原则；它们定义了允许哪些用户与一组特定资源连接。例如，使用边界，您可以只授予开发人员连接到数据库的访问权限。此模型允许边界定义系统和应用程序的逻辑集，并消除了与静态IP地址相关的脆弱性。\n边界对每个请求进行身份验证和授权，将用户映射到应用层的服务或主机。无需管理VPN凭据或SSH堡垒主机密钥，这简化了自注册并降低了凭据泄露的风险。\n边界提供了一种易于使用、平台无关的方式，可以通过基于可信身份的单一工作流跨云、Kubernetes群集和内部数据中心访问您的所有主机和服务。它允许您删除硬编码凭据和防火墙规则，并使访问控制更具动态性。\n边界0.1支持与具有基于角色的访问控制(RBAC)的应用程序进行身份验证和授权的TCP会话。用户可以使用边界Terraform提供程序、API或SDK自动管理对动态目标的访问。边界还支持会话元数据的监控和日志记录。\n我们将边界的体系结构设计为易于理解、高度可扩展和容错。用户可以通过CLI、API或Web界面与边界交互。它可以在本地、云中或安全环境中运行，并且不需要您在目标主机上安装代理。\n为了更好地解释边界是如何工作的，让我们来看看端到端连接是如何建立的。当用户向边界进行身份验证时，他们可以根据其角色从选择的主机或应用程序中进行选择，然后通过边界连接以访问这些主机或应用程序。\n当用户通过边界建立TCP会话时，边界工作节点将无缝代理该连接。这使得边界比VPN或SSH堡垒主机等传统访问系统更安全，因为边界为用户建立连接并限制用户的访问。由于边界控制最终用户对目标系统的直接访问，因此它从不允许用户访问专用网络，从而使您组织的网络更加安全。\n边界0.1现在是一个开放源码项目。请注意，该项目正在积极开发中，我们正在努力添加OIDC身份验证、HashiCorp Vault集成，以及从HashiCorp Consul、AWS、Azure和GCP获取的动态目标目录。\n要了解边界的更多信息，请访问该项目的网站，网址是：bilaryproject.io，github.com/hashicorp/birm.获取源代码，HashiCorp了解如何查找我们的分步教程，以开始使用边界。\n如果您遇到任何问题，请在边界GitHub问题跟踪器上报告或发布到边界讨论论坛。我们希望您喜欢“边界0.1”。", "note_en": "We are pleased to announce HashiCorp  Boundary, a new open source project that enables practitioners and operators to securely access dynamic hosts and services with fine-grained authorization without requiring direct network access.\n Boundary is designed to grant access to critical systems using the principle of least privilege, solving challenges organizations encounter when users need to securely access applications and machines. Traditional products that grant access to systems are cumbersome, painful to maintain, or are black boxes lacking extensible APIs. Boundary allows authenticated and authorized users to access secure systems in private networks without granting access to the larger network where those systems reside.\n  To better understand how Boundary works, and why we are building it, we want to provide a few examples that highlight the challenges users and operators face when securely connecting to applications and critical systems.\n The diagram below illustrates a typical connection workflow and the challenges that occur when a user requires remote access to a production system located in a private network. Usually a gateway bridges access into these private networks through a VPN or SSH bastion host. Both solutions offer varying degrees of security which could provide a user with direct access on the private network and not just access to the intended systems.\n  This traditional access model assumes resources are mostly static, and it is not well suited for the cloud with highly ephemeral and dynamic environments. Scaling the solutions as workforces and infrastructure grow creates additional pain points and complexity for administrators to manage.\n Once users are on these private networks, they can access any system and not just the intended target. If the credentials used to access the VPN or SSH host are lost or stolen, an adversary could access the entire network. To safeguard against that risk, a traditional workflow will typically place a firewall inside these private networks that restricts what users have access to in order to safeguard against this risk.\n However, managing internal firewalls is time consuming and wasteful when the system granting access should have followed the principle of least privilege from the outset. Boundary was designed with these core problems in mind: grant access to critical systems with least privilege.\n  The goal of Boundary is to simplify the workflow for securely accessing hosts and services while also reducing risk and attack surface associated with traditional solutions. With Boundary, access is based on the trusted identity of the user, rather than their network location. The user connects and authenticates to Boundary, then based on their assigned roles they can connect to available hosts, services, or cloud resources.\n  Trusted identities and roles are a core principle in Boundary; they define which users are allowed to connect with a specific set of resources. For example, with Boundary, you could grant only developers access to connect to databases. This model allows Boundary to define logical sets of systems and applications and removes the brittleness associated with static IP addresses.\n  Boundary authenticates and authorizes each request, mapping users to services or hosts at the application layer. There are no VPN credentials or SSH bastion host keys to manage, which simplifies onboarding and reduces risk of a credential compromise.\n  Boundary provides an easy-to-use, platform-agnostic way to access all of your hosts and services across clouds, Kubernetes clusters, and on-premises datacenters through a single workflow based on trusted identity. It lets you remove hard-coded credentials and firewall rules, and makes access control more dynamic.\n  Boundary 0.1 enables authenticated and authorized TCP sessions to applications with role-based access controls (RBAC). Users can automate access management to dynamic targets with the  Boundary Terraform provider, the API, or SDK. Boundary also supports monitoring and logging of session metadata.\n We designed the architecture of Boundary to be easy to understand, highly scalable, and fault tolerant. Users can interact with Boundary through the CLI, API, or a web interface. It can run on-premises, in the cloud, or in secure enclaves, and it does not require you to install an agent on target hosts.\n  To better explain how Boundary works, let&#39;s walk through how an end-to-end connection is established. When a user authenticates to Boundary, they can choose from a selection of hosts or applications based on their roles, and then connect through Boundary to access those hosts or applications.\n When a user establishes a TCP session through Boundary, a Boundary worker node seamlessly proxies the connection. This makes Boundary more secure than traditional access systems such as a VPN or SSH bastion hosts because Boundary makes the connection for the user and limits the user’s access. Since Boundary controls access directly for end users, all the way to the intended target system, it makes your organization’s network more secure by never allowing users access to the private network.\n  Boundary 0.1 is available today as an open source project. Note that the project is under active development and we are working on adding OIDC authentication, a HashiCorp Vault integration, and dynamic target catalogs pulled from HashiCorp Consul, AWS, Azure, and GCP.\n To learn more about Boundary, please visit the project website at  boundaryproject.io,  github.com/hashicorp/boundary for the source code, and  HashiCorp Learn to find our step-by-step tutorials to get started with Boundary.\n If you experience any issues, please report them on the  Boundary GitHub issue tracker or post to the  Boundary discuss forum. We hope you enjoy Boundary 0.1.", "posttime": "2020-10-15 00:46:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hashicorp,边界", "title": "HashiCorp边界", "title_en": "HashiCorp Boundary", "transed": 1, "url": "https://www.hashicorp.com/blog/hashicorp-boundary", "via": "", "real_tags": ["hashicorp", "边界"]}, {"category": "", "categoryclass": "", "imagename": "e8a7fca2d771caf26299d96eef5685ff.jpg", "infoid": 1028829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所以你想雇一个开发商？或者，也许你只是想知道像我这样的雇主在想什么。不管是哪种方式，让我们直奔我认为的雇佣程序员的最佳实践吧。我发现我的观点颇具争议性，但我确实在我自己的职业生涯和Qvault将其付诸实践。当你不可避免地不同意我的一些观点时，尽管说“我”。\n下面的流程假设基本上没有人力资源来帮助(我认为这可能是一件好事)，而且肯定没有招聘人员。我只有直接招聘小公司的经验。\n就像真的一样。当我发布一份工作时，我会收到很多应聘者。我需要一种快速过滤掉一些坏苹果的方法。我没时间读你高中时的救生员工作。\n理想情况下，所有简历都应该只有1页。如果你有成百上千的申请者，也许可以试着过滤到只有一个寻呼机。\nInb4说，“但是我有这么多相关的经验，一页都写不下。”是的。没有人会在意你10年前和6家公司之前参与的项目。把它归结为你最感兴趣的项目和最相关的经历。它可以放在一页纸上。\n作为一名应聘者，没有什么比坐在3个不同的2个小时的面试中却发现他们没有得到这份工作更糟糕的了。相反，作为一个雇主，坐在几个长时间的面试中，让应聘者再抓住一次机会，这也是很糟糕的。\n~20分钟可缩放手机屏幕。这不是采访。只是回答有关公司的问题，了解应聘者的情况。如果没有危险信号，请转到步骤3。\n约90分钟(最好是面对面)面试。就是这个。在不到90分钟的时间里学到你需要知道的一切。如果你不能做到这一点，你就是一个糟糕的面试官，需要更多的练习。\n如果你像我一样是一名经理，那么你大约80%的时间用来“编码”(做技术工作)，20%的时间用来“管理”(不管那是什么该死的意思)。在算法上，我们都知道要在列表中找到最大的数字，我们需要检查所有的数字。这是O(N)。\n实际上，我没有时间去“检查”(面试)所有的候选人来找出最好的。在提供工作机会之前，我通常会试着至少面试3到4名应聘者，如果我不能很快找到人，有时会面试更多的应聘者。\n我发现，在最初几次不错的面试之后，你花在寻找候选人上的时间的回报在递减。\n在谈到面试时，白板不知何故成了一个淘气的词。我听到一些愚蠢的说法，比如，“如果我会编程，谁会在乎我会不会用白板呢？”\n没人在乎。白板只是一种便捷的方式，可以忽略我们都可以用谷歌(Google)搜索的愚蠢的东西(比如语法)，而专注于重要的垃圾(算法、数据结构、架构能力、对框架/概念的理解等)。\n我不要求Reaction开发人员构建二叉树。我不会要求数据团队的候选人谈论Redux与Reaction上下文。保持问题的适用性，不要害怕使用该死的白板。\n把编写作业看作是申请审查的对立面。申请审查会淘汰不好的应聘者。编写作业代码通常会淘汰好的作业。\n看看你的候选人的Github，GitLab，随便什么。让他们发送他们参与过的项目的链接。查看他们的提交历史记录。他们可能已经编写了数千行您可以访问的代码。\n作业对于实际上没有经验的应聘者(非常初级的开发人员)来说是有意义的，原因有几个：\n他们不介意做一些额外的工作来找到一份工作，所以你不会淘汰好的。\n初级开发人员学得很快。3个月前的项目可能不能准确反映他们现在的位置。\n如果应聘者期望80K，则提供85K。如果他们期望11万，那就出价12万。为什么？让候选人加入你的团队会更好。如果你进入核心谈判，他们就会开始视你为敌人。如果你们从第一天起就在同一个团队里，一切都会变得更顺利，你们的关系也会更有效。", "note_en": "So you want to hire a developer? Or maybe you just want to know what is going through the heads of employers like myself. Either way, let’s dive right into what  I think are best practices for hiring programmers. I’ve found my opinions to be quite controversial, but I do put them into practice in my own career and at  Qvault. When you inevitably disagree with some of my points, feel free to  @ me.\n The following process assumes essentially no HR to help (which I think is probably a good thing), and definitely no recruiters. I only have experience hiring direct to small(ish) companies.\n  Like really. When I post a job I get  so many candidates. I need a way to quickly filter out some bad apples. I don’t have time to read about your high-school lifeguarding job.\n Ideally, all resumes would be exactly  1 page. If you have hundreds of applicants perhaps try filtering down to the single pagers.\n Inb4, “but I have so much relevant experience, it doesn’t fit on one page”. Yes it does. No one gives a flying fart about the project you worked on 10 years ago and 6 companies ago. Boil it down to your MOST INTERESTING projects and MOST RELEVANT experience. It can fit on one page.\n  There is nothing worse as a candidate than sitting through 3 different 2 hour-long interviews only to find they didn’t get the job. Conversely, it also sucks as an employer to sit through several long interviews and have the candidate take another opportunity.\n  ~20-minute zoom phone screen. This is not an interview. Just answering questions about the company and learning about the candidate’s situation. If there are no red flags, go to step 3.\n ~90-minute (preferably in-person) interview. This is it. Learn everything you need to know in less than 90 minutes. If you can’t do that, you are a bad interviewer and need more practice.\n  If you are a manager like me, then you spend ~80% of your time “coding” (doing technical work) and ~20% of your time “managing” (whatever the hell that means). Algorithmically, we all know that to find the greatest number in a list we need to check  all the numbers. That’s O(n).\n In reality, I don’t have time to “check” (interview) all the candidates to find the best one. I usually try to at least interview 3 or 4 candidates before making an offer, and sometimes many more if I don’t find anyone quickly.\n I’ve found there are diminishing returns on your time spent trying to find a candidate after the first few good interviews.\n     Somehow whiteboarding has become a naughty word when talking about interviewing. I hear dumb-ass statements like, “who cares if I can whiteboard if I know how to code?”\n No one cares. White-boarding is just a convenient way to ignore dumb things that we can all google (like syntax) and focus on shit that matters (algorithms, data structures, architectural prowess, understanding of frameworks/concepts etc)\n I don’t ask React developers to build binary trees. I don’t ask candidates for the data team to talk about Redux vs React Context. Keep the questions  applicable, and don’t be afraid to use a goddamn whiteboard.\n    Think of coding homework as the opposite of application review. Application review weeds out bad candidates. Coding homework will often weed out the  good ones.\n Look at your candidate’s Github, Gitlab, whatever. Have them send links to projects they’ve worked on. Look at their commit histories. They’ve likely written thousands of lines of code you can get access to.\n  Homework can make sense for candidates that have effectively no experience (very junior developers) for several reasons:\n They don’t mind doing some extra work to land a job, so you won’t weed out the good ones.\n  Junior devs learn FAST. A project from 3 months ago likely won’t accurately reflect where they are at today.\n  If the candidate expects 80k, offer 85k. If they expect 110k, offer 120k. Why? It’s better to have the candidate  on your team. If you get into hardcore negotiations then they start to see you as the enemy. Everything will go smoother and you will have a more effective relationship if you are on the same team from day 1.", "posttime": "2020-10-15 00:44:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,雇佣,devs", "title": "如何雇佣开发人员-一种固执己见的咆哮", "title_en": "How to Hire Devs – An Opinionated Rant", "transed": 1, "url": "https://qvault.io/2020/10/13/how-to-hire-developers-6-tips-from-someone-you-probably-shouldnt-listen-to/", "via": "", "real_tags": ["开发", "雇佣", "devs"]}]