[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1009504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于Fios家用路由器来说，将WiFi的名称/SSID设置为表情符号相当简单。只需登录路由器，然后转到设置SSID的页面。\n在那里之后，使用Ctrl+Shift+I或通过右键单击并单击沿着检查元素或检查行标记的选项来打开开发人员控制台。之后，只需将以下代码粘贴到控制台即可。\n这将覆盖当前的validSSID函数，该函数用于确保您的SSID由Fios所需的1-32个字母数字ASCII字符组成。这不是针对SSID的实际技术要求，2012年标准802.11(第6.3.11.2.2节)规定SSID必须为最大32字节。运行此脚本后，您应该能够键入任何小于32字节的内容。这通常是最多32个字符，但根据使用的Unicode字符的大小，可以少得多。例如，根据🔥-8的工作方式，火灾表情符号实际上是4个字节。这意味着只能使用8个火表情符号。要获取字符串的大小，只需使用站点https://mothereff.in/byte-counter.", "note_en": "Setting the name/SSID of your WiFi to an emoji is fairly simple for the Fios Home Router. Simply log into the router, and go the page for setting the SSID.\n  Once you are there open the developer console using  Ctrl+Shift+I or by right clicking and clicking the option labeled along the lines of  Inspect Element or  Inspect. After this simply paste the following code into the console.\n    This overrides the current validSSID function which is used to make sure that your SSID is made of the Fios required 1-32 alphanumerical ascii characters. This is not an actual technical requirements for SSIDs with the 2012 standard of 802.11 (Section 6.3.11.2.2) stating SSIDs simply have to be a max of 32 bytes. Once this script is ran you should be able to type anything less than 32 bytes. This tends to be at most 32 characters, but depending on the size of the Unicode characters used it can be much less. For instance the fire emoji,  🔥, is actually 4 bytes because of how UTF-8 works. This means that only 8 fire emojis could be used. To get the size of a string simply use the site  https://mothereff.in/byte-counter.", "posttime": "2020-07-03 00:10:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,home,ssid", "title": "将Fios Home路由器的SSID设置为Emoji", "title_en": "Setting the SSID of a Fios Home Router to an Emoji", "transed": 1, "url": "https://hamptonmoore.com/posts/fios-home-router-emoji/", "via": "", "real_tags": ["ios", "home", "ssid"]}, {"category": "", "categoryclass": "", "imagename": "b7e1575b5d16504eb8eec246336ddfb4.jpg", "infoid": 1009503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TLS书评|塞巴斯蒂安·里乌克斯(Sébastien Rioux)著的“廉价食品的社会成本”(The Social Cost Of Cheap Food)；蒂姆·朗(Tim Lang)著的“喂养英国”(Feating British)", "note_en": "The TLS - Book review | The Social Cost of Cheap Food by Sébastien Rioux; Feeding Britain by Tim Lang; Hunger by Martín Caparrós, reviewed by Bee Wilson", "posttime": "2020-07-02 23:51:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "农产品,cheap", "title": "但这是食物吗？：廉价农产品的世界及其后果", "title_en": "But is it food?: The world of cheap produce and its consequences", "transed": 1, "url": "https://www.the-tls.co.uk/articles/cheap-food-consequences-bee-wilson-book-review/", "via": "", "real_tags": ["农产品", "cheap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由p410n3制作的技术博客，又名pone。主要涵盖编程和信息安全主题。想法是我自己的。", "note_en": "Technical blog made by p410n3 aka palone. Covering mostly programming and infosec topics. Thoughts are my own.", "posttime": "2020-07-02 23:51:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,可能,secure,信息安全", "title": "Android可能是您拥有的最安全的设备", "title_en": "Android might be the most secure device you own", "transed": 1, "url": "https://palone.blog/#post-your-android-might-be-the-most-secure-device-you-own-4", "via": "", "real_tags": ["android", "可能", "secure", "信息安全"]}, {"category": "", "categoryclass": "", "imagename": "cbadb5c1a1a463e241ea192e45db3389.jpg", "infoid": 1009501, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的18个月里，英特尔一直在媒体和公众面前炫耀其新的“Lakefield”处理器设计，称其为新处理器创新的典范。在内部，英特尔将其一个快速峰值性能内核与四个能效较低的内核配对，并使用新技术来在尽可能小的占地面积内构建处理器。新的Lakefield设计标志着英特尔正在研究新的处理器范式，例如具有不同类型内核的混合处理器，但也有不同的堆栈和封装技术，以帮助推动下一波计算浪潮。通过这篇文章，我们将告诉您关于莱克菲尔德需要知道的一切。\n在设计处理器时，有一千多个设计选择可供选择。处理器可以设计成可以处理任何事情，也可以针对某个利基市场。对于高性能计算，可能需要不考虑散热的高功率、高性能设计-将其与针对便携式设备的处理器进行比较，它需要高能效，并在固定电池大小的情况下提供相当长的电池寿命。此外，还有设计产品的成本，投入多少研发资金，预计销售多少台，因此应该生产多少台，产品的大小应该是多少。目标市场的价格范围可能是一个巨大的因素，甚至在动笔之前就是如此。\n这就是为什么我们在服务器中使用具有大量计算加速的大型多核处理器，在注重单核性能和用户体验的家用计算机中拥有更适中的功率和内核数量，以及为什么智能手机处理器必须在物理上适合小型设计并提供卓越的电池续航时间。\n笔记本电脑处理器在某种程度上一直适合个人电脑和智能手机市场的中间市场。笔记本电脑用户，特别是专业人士和游戏玩家，需要台式机平台所能提供的高性能，但经常出差的人需要耗电效率极高的设备，特别是在空闲时，才能提供全天的电池续航时间，就像他们使用的是一部好的智能手机一样。不仅如此，处理器及其功能的能效越高、占用空间越小，笔记本电脑就可以越薄越轻，从而提供优质的设计体验。\n自上而下，我们有AMD和英特尔，它们在越来越小的电源封套中使用笔记本电脑处理器设计，提供具有卓越性能的轻薄设备，同时保持电池寿命所需的能效。对于最优质的设计，我们认为笔记本电脑的电池续航时间为12-15小时以上，而且游戏功能非常强大。\n从底部来看，我们拥有高通，将其高性能智能手机处理器系列构建成更大的电源封套，以提供台式机级别的性能和智能手机级别的连接和电池续航时间。使用高通处理器的设计，用户可以很容易地获得24小时以上的电池续航时间，而在日常办公使用中，每隔几天只给系统充电一次。高通在软件方面仍有一个额外的障碍，该公司正在努力实现这一目标。\n这两个方向都集中在中间的东西上-可以提供台式机级别的性能、24小时以上的电池续航时间、能够玩游戏的东西，而且还拥有全面的软件支持。英特尔决定将其传统的处理器模式颠倒过来，为这个市场打造一款智能手机级的处理器，在自下而上的方法上与高通相媲美，同时也为了做到这一点，研究新的制造技术，而不是继续试图将其处理器降低到它所要求的水平。\n在过去的二十年里，英特尔有两种不同类型的x86 CPU设计。\n英特尔称其高功率/高性能x86设计为“核心”系列。这使得区分处理器核心和基于“核心”的处理器核心的一般概念非常混乱。\n多年来，基于内核的处理器内核一直被设计用于从低功耗笔记本电脑一直到最强大的服务器的电源封套。处理器核心系列实现了更复杂的逻辑，以牺牲物理尺寸和功率为代价提供额外的加速。\n英特尔的第二种x86设计是其更节能的实现，称为“Atom”。有了Atom内核，英特尔简化了设计，以最大限度地提高给定功率或给定性能的效率。这使得设计更小，制造成本更低，但峰值性能低于核心设计。我们通常会在性能不重要的电力受限场景中看到Atom设计，例如物联网或低成本笔记本电脑设计。\n通常，我们根据这种能力和性能来描述处理器核心设计。由于设计的不同，我们可以看到对于给定的功率或给定的性能，某些设计在不同的点上工作得最好。在英特尔最新一代酷睿和凌动硬件的情况下，如果我们将一个线程与一个线程进行比较，它看起来如下所示：\n从这张衡量底轴上的性能和侧轴上的功率的图表中，有一个交叉点，在这个交叉点上，每种设计都是最有意义的。当性能需求低于58%时，Atom设计的能效最高，但高于58%时，则首选酷睿设计。\n现在，在现代处理器中，特别是在笔记本电脑、台式机和服务器中，我们只体验到一种核心设计。我们要么拥有All Core，要么拥有Atom，性能设计为在这些同构设计中进行扩展。它变成了一条易于导航的简单曲线，当需要更高的并行性能时，就会启动更多这些类型的内核来满足最终用户的需求。在过去的30-50年里，这些市场一直是这样的情况。\n在过去的十年里，智能手机领域一直在采取不同的方式。在智能手机领域，核心设计被列为“大”，核心设计被列为“小”，就像英特尔的酷睿和凌动设计一样。\n这些智能手机处理器将多个大核和多个小核结合在一起，因此在效率很重要的小核上运行后台任务以及在延迟和性能重要的大核上运行与用户体验相关的元素具有内在的好处。\n这种异类智能手机设计的复杂性有很多层面。默认情况下，大多数项目将在较小的内核上启动，这取决于处理器或操作系统来确定何时需要在用户体验期间使用更高性能的模式。这可能很难识别。\n然后，当工作负载必须从一种类型的内核实际移动到另一种类型的内核时，通常是为了响应对特定性能级别的请求-如果内核的设计明显不同，那么对内存的需求可能会增加，这取决于操作系统来确保一切按其应有的方式工作。还有一个额外的安全元素，这是一个超出本文范围的更大主题。\n最终，构建既有大核又有小核的设计在很大程度上取决于我们所说的调度器。这是操作系统内部的一个程序，用于管理不同的后台进程、用户体验事件或视频编辑和游戏等内容的安排位置。正如前面提到的，十多年来，智能手机市场一直在研究不同类型的日程安排程序，并对设计进行优化。对于Intel和AMD的领地来说，推动异构调度器的过程相比之下是一个缓慢的过程，这在很大程度上变成了一个鸡和蛋的问题-如果市场上从来没有异构处理器，就不需要优化的异构调度器。\n在其营销中，英特尔将其称为“混合”CPU，我们将开始看到标识为“混合”CPU的标识。在其设计的核心，Lakefield将其中一个大的Core设计与四个较小的Atom设计结合在一起，所有这些设计都是在一片硅片上进行的。在正常的x86处理器谈话中，这本质上是一个“五核”设计，通常被称为1+4实现(对于一个大核和四个小核)。\n英特尔与Lakefield的目标是将高能效的Atom内核的优点与耗电量更大但峰值性能更好的Big Core提供的更好的用户体验元素结合起来。因此，它位于只包含一种x86设计类型的英特尔传统同质设计的中间-高于“All Atom”0+4设计，低于“All Core”4+0设计(实际上，它更接近0+4)。\n根据我们与英特尔的谈话，以及我们到目前为止看到的小型演示，考虑新的Lakefield处理器的最佳方式是将其视为类似于较旧的四核Atom处理器之一，并具有大内核的单核性能优势。由四个较小的Atom CPU组成的集群将负责繁重的提升和并行性能请求，因为它们有四个，而大的核心将在用户加载应用程序、触摸屏幕或滚动Web浏览器时做出响应。\n作为x86混合CPU的一种新形式，Lakefield带来的并不是唯一的东西。\n现在，为了某种形式的澄清，我们已经有了在Windows等操作系统上进行这种混合CPU设计的一些经验。高通在骁龙笔记本电脑上的Windows，如联想瑜伽，使用的是4+4设计的骁龙智能手机芯片，高通不得不与微软广泛合作，开发一种合适的调度程序，可以在不同的CPU设计之间管理工作负载。\n高通和英特尔对莱克菲尔德所做的主要区别在于软件支持--高通处理器运行“ARM”指令，而英特尔处理器运行“x86”指令。大多数Windows软件都是为x86指令构建的，这限制了高通在渗透传统笔记本电脑市场方面的有效性。高通的设计实际上允许“x86转换”，但是它的范围是有限的，而且会影响性能，但这是一项正在进行的工作。问题是，虽然我们以前没有在x86系统上为Windows提供混合CPU调度器，但到目前为止，微软在与高通合作时已经投入了大量工作。\n以下是英特尔(Intel)和高通(Qualcomm)的一些移动处理器的例子，内核为绿色。左边是英特尔自己的冰湖处理器，有四个大内核。中间是英特尔的Lakefield，它有两个堆叠的硅晶片，但它是最上面的一个有一个大核心和四个小核心。右边是高通(Qualcomm)的Snapdraon8cx，目前在骁龙设备的Windows上使用，它使用四个性能内核和四个能效内核，但还集成了一个智能手机调制解调器。\n在这篇文章中，在接下来的几页里，我们将详细介绍英特尔的新Lakefield处理器，包括新的多核设计，讨论芯片和英特尔新的芯片到芯片粘合技术Foveros，这种设计对笔记本电脑尺寸的影响(以及查看公开上市的Lakefield笔记本电脑)、骰子拍摄、假定的性能数字、热创新，以及Lakefield的未来。本文的数据来自我们的研究，以及对英特尔技术人员的采访，以及英特尔在HotChips、Architecture Day、CES、NIEDM和ISSCC等活动上关于Lakefield的演示。维基解密的David Schor提供了一些有用的意见，对一些信息进行了剖析。“我们还介绍了英特尔在其他半导体公司范围内的一些创新，其中一些可能是竞争对手。\n发表评论不仅没有AVX-512，它似乎根本没有AVX。对于2020年的高端产品来说，这是令人尴尬的。回覆。\n嘿，我同意，但它将用于起价1000美元的设备。它显然被定位为优质芯片，尽管有各种迹象表明它实际上并不是很好。回覆。\n阳光湾有AVX-512，但特雷蒙特内核没有任何AVX。所以英特尔也禁用了Sunny Cove内核上的AVX，因为如果他们让它启用，热量将是一个问题。回覆。\n我们读的是同一篇文章吗？由于Windows 10兼容性问题，AVX-512已从Sunny Cove Dives中完全移除(即，物理上)。Windows从来不是为x86异构处理而构建的，现在到2020年仍然无法实现任何功能(也许这将是一项比2008年全力以赴进行接触更明智的投资！)。英特尔和微软(Intel&amp；Microsoft)在2010年代末仍然受困于他们的低功耗/移动优先/瘦客户机转型，原因是基于ARM的智能手机和架构取得了压倒性的成功，抹去了人们对低功耗x86的所有兴趣。英特尔几乎停止了Atom的所有开发，这是有原因的：没人在乎奔腾银赛扬处理器。回覆。\n底部芯片包含与性能无关的“外围”组件，如安全控制器、USB端口和PCIe通道。这是建立在英特尔更便宜的22纳米制造节点上的。他们肯定不会回到22纳米吗？包装工程很有趣，但似乎没有根本的架构改进。我看到禅宗-xx把它直接砸出了大门。绝对不适合台式机使用。回覆\n&gt；我看到禅宗-xx把这件事直接压出了大门。绝对不适合台式机使用。这是个7W的处理器，笨蛋。回覆", "note_en": "For the past eighteen months, Intel has paraded its new ‘Lakefield’ processor design around the press and the public as a paragon of new processor innovation. Inside, Intel pairs one of its fast peak performance cores with four of its lower power efficient cores, and uses novel technology in order to build the processor in the smallest footprint it can. The new Lakefield design is a sign that Intel is looking into new processor paradigms, such as hybrid processors with different types of cores, but also different stacking and packaging technologies to help drive the next wave of computing. With this article, we will tell you all you need to know about Lakefield.\n  When designing a processor, there are over a thousand design choices to be made. The processor can be built to tackle everything, or it can be aimed at a niche. For high performance computing, there might be a need for a high power, high performance design where cooling is of no consideration – compare that to a processor aimed at a portable device, and it needs to be energy efficient and offer considerable battery life for a fixed battery size. There is also the cost of designing the product, how much to invest into research and development, how many units are expected to sell, and thus how many should be produced and what size the product should be. What the price range of the target market is can be a huge factor, even before putting pen to paper.\n  This is all why we have big multi-core processors with lots of compute acceleration in servers, more moderate power and core counts in home machines that focus on single core performance and user experience, and why smartphone processors have to physically fit into a small design and offer exceptional battery life.\n Laptop processors have always sort of fit into the middle of the PC and smartphone markets. Laptop users, especially professionals and gamers, need the high performance that a desktop platform can provide, but road warriors need something that is superbly efficient in power consumption, especially at idle, to provide all-day battery life as if they were on a good smartphone. Not only this, but the more energy efficient and the smaller the footprint of the processor and its features, the thinner and lighter the laptop can be, offering a premium design experience.\n  From the top, we have AMD and Intel, using their laptop processor designs in smaller and smaller power envelopes to offer thin and light devices with exceptional performance and yet retain the energy efficiency required for battery life. For the most premium designs, we see 12-15+ hours of laptop battery life, as well as very capable gaming.\n From the bottom, we have Qualcomm, building out its high-performance smartphone processor line into larger power envelopes, in order to offer desktop-class performance with smartphone-class connectivity and battery life. With the designs using Qualcomm’s processors, a user can very easily expect 24+ hours of battery life, and with regular office use, only charge the system once every couple of days. Qualcomm still has an additional barrier in software, which it is working towards.\n Both of these directions converge on something in the middle – something that can offer desktop-class performance, 24hr+ battery life, capable gaming, but also has a full range of software support. Rather continue with trying to bring its processors down to the level it requires, Intel has decided to flip its traditional processor paradigm upside down, and build a smartphone-class processor for this market, matching Qualcomm in its bottom up approach while also looking into novel manufacturing techniques in order to do so.\n   For the past two decades, Intel has had two different types of x86 CPU design.\n  Intel calls its high power/high performance x86 design the ‘Core’ family. This can make it very confusing, to differentiate between the general concept of a processor core and a ‘Core’-based processor core.\n Over the years, Core-based processor cores have been designed for power envelopes from low-power laptops all the way up to the beefiest of servers. The Core line of processor cores implement more complex logic in order to provide additional acceleration, at the expense of physical size and power.\n  The second type of x86 design from Intel is its more energy efficient implementation, called ‘Atom’. With the Atom cores, Intel simplifies the design in order to maximise efficiency for a given power or a given performance. This makes the design smaller, cheaper to manufacturer, but has a lower peak performance than the Core design. We typically see Atom designs in power restricted scenarios where performance is not critical, such as IoT, or low cost laptop designs.\n  Normally we characterise a processor core design in terms of this power and performance. Due to the variation in the design, we see where some designs work best, at various points for a given power or for a given performance. In the case of Intel’s latest generation of Core and Atom hardware, it looks something like this, if we compare one thread against one thread:\n  From this graph, which measures Performance on the bottom axis and power on the side axis, there is a crossover point where each design makes the best sense. When the demand for performance is below 58%, the Atom design is the most power efficient, but above 58% then a Core design is preferred.\n  Now in modern processors, especially in laptops, desktops, and servers, we only experience one type of core design. We either have all Core or all Atom, and the performance is designed to scale within those homogeneous designs. It becomes a simple curve to navigate, and when more parallel performance is required, more of those types of cores are fired up to serve the needs of the end user. This has been the case for these markets for the last 30-50 years.\n The smartphone space, for the last decade, has been taking a different approach. Within the smartphone world, there are core designs listed as ‘big’ and core designs listed as ‘little’, in the same way that Intel has Core and Atom designs.\n These smartphone processors combine numbers of big cores with numbers of small cores, such that there is an intrinsic benefit to running background tasks on the little cores, where efficiency is important, and user experience related elements on the big cores, where latency and performance is important.\n The complexity of such a heterogeneous smartphone-like design has many layers. By default most items will start on the little cores, and it is up to either the processor or the operating system to identify when the higher performance mode during a user experience moment is needed. This can be tricky to identify.\n Then also comes the matter when a workload has to actually move from one type of core to the other, typically in response to a request for a specific level of performance – if the cores are designed significantly different, then the demands on the memory can likely increase and it is up to the operating system to ensure everything works as it should. There is also an additional element of security, which is a larger topic outside of the scope of this article.\n Ultimately building a design with both big cores and little cores comes down a lot to what we call the scheduler. This is a program inside the operating system that manages where different background processes, user experience events, or things like video editing and games, get arranged. The smartphone market has been working on different types of schedulers, and optimizing the designs, for over a decade as mentioned. For the land of Intel and AMD, the push for heterogeneous schedulers has been a slow process by comparison, and it becomes very much a chicken and egg problem – there is no need for an optimized heterogeneous scheduler if there is never a heterogeneous processor in the market.\n   In its marketing, Intel calls this a ‘hybrid’ CPU, and we will start to see logos identifying this as such. At the heart of its design, Lakefield combines one of the big Core designs with a cluster of four smaller Atom designs, all into one single piece of silicon. In normal x86 processor talk, this is essentially a ‘penta-core’ design, which will commonly be referred to as a 1+4 implementation (for one big core and four small cores).\n Intel’s goal with Lakefield is to combine the benefits of the power efficient Atom core with the better user-experience elements provided by the more power hungry but better peak performing big Core. As a result, it sits in the middle of Intel’s traditional homogeneous designs which only contain one type of x86 design – somewhere above the ‘all Atom’ 0+4 design and somewhere below the ‘all Core’ 4+0 design (in actual fact, it’s closer to 0+4).\n Based on our conversations with Intel, and the small demonstrations we have seen so far, the best way to consider the new Lakefield processor is to consider it similar to one of the older quad-core Atom processors, with the benefits of the single core performance of a big Core. The cluster of four smaller Atom CPUs will take care of the heavy lifting and parallel performance requests, because there are four of them, while the big Core will respond when the user loads an application, or touches the screen, or scrolls a web browser.\n Being a new form of x86 hybrid CPU is not the only thing that Lakefield brings to the table.\n  Now, just for some form of clarification, we have already had some experience with these sorts of hybrid CPU designs on operating systems like Windows. Qualcomm’s Windows on Snapdragon laptops, like the Lenovo Yoga, use a 4+4 design with the Snapdragon smartphone chips, and Qualcomm has had to work extensively with Microsoft to develop an appropriate scheduler that can manage workloads between the different CPU designs.\n The main difference to what Qualcomm has done and what Intel is doing with Lakefield is in software support – Qualcomm processors run ‘Arm’ instructions, while Intel processors run ‘x86’ instructions. Most Windows software is built for x86 instructions, which has limited Qualcomm’s effectiveness in penetrating the traditional laptop market. Qualcomm&#39;s design actually allows for ‘x86 translation’, however its scope is limited and there is a performance penalty, but is a work in progress. The point being is that while we have not had a hybrid CPU scheduler for Windows on an x86 system previously, there has been a lot of work put in by Microsoft to date while working with Qualcomm.\n   Here are some examples of mobile processors, from Intel and Qualcomm, with the cores in green. On the left is Intel&#39;s own Ice Lake processor, with four big cores. In the middle is Intel&#39;s Lakefield, which has two stacked silicon dies, but it&#39;s the top one that has one big core and four small ones. On the right is Qualcomm&#39;s Snapdragon 8cx, currently used in Windows on Snapdragon devices, which uses four performance cores and four efficiency cores, but also integrates a smartphone modem onboard.\n In this article, over the following pages, we&#39;ll be looking at Intel&#39;s new Lakefield processor in detail, covering the new multi-core design, discussing chiplets and Intel&#39;s new die-to-die bonding technology called Foveros, the implications of such a design on laptop size (as well as looking at the publicly disclosed Lakefield laptops coming to market), die shots, supposed performance numbers, thermal innovations, and the future for Lakefield. Data for this article has come from our research as well as interviews with Intel&#39;s technical personnel and Intel&#39;s own presentations on Lakefield at events such as  HotChips,  Architecture Day,  CES,  IEDM, and  ISSCC. Some information is dissected with helpful input from  David Schor of Wikichip. We also cover some of Intel’s innovations with the scope of other semiconductor companies, some of which may be competitors.\n  POST A COMMENT      Not only does it not have AVX-512, it appears to have no AVX at all. For a premium product in 2020, that&#39;s embarrassing.  Reply\n    Hey, I agree, but it&#39;s going into devices that start at US$1k. It&#39;s clearly being positioned as a premium chip, despite showing every sign of not actually being very good.  Reply\n    The Sunny Cove has AVX-512 but Tremont cores don,t have any AVX. So Intel disabled AVX on the Sunny Cove core too, as heat was gonna be a problem if they let it enabled.  Reply\n  Did we read the same article? AVX-512 was completely removed (i.e., physically) from the Sunny Cove dies because of Windows 10 compatibility problems.  Windows was never built for x86 heterogeneous processing and still cannot do anything close now in 2020 (perhaps that would&#39;ve been a smarter investment than going all-in on touch in 2008!).  Intel &amp; Microsoft remain stuck in late 2010s for their low-power / mobile-first / thin-client transition caused by the dominating success of smartphones &amp; ARM-based architectures wiping out anything of interest in low-power x86.  There&#39;s a reason Intel just nearly stopped all development on Atom: nobody give a crap about the Pentium Silver &amp; Celeron CPUs.  Reply\n      &#34;The bottom chiplet contains the ‘peripheral’ components that are not as performance related, such as security controller, USB ports, and PCIe lanes. This is built on Intel’s cheaper 22nm manufacturing node.&#34;  Surely they are not going to go back to 22nm? The packaging engineering is interesting enough, but there seems to be no fundamental architecture improvements. I see Zen-xx crushing this straight out the gate. Definitely not adaptable for desktop use.  Reply\n  &gt;I see Zen-xx crushing this straight out the gate. Definitely not adaptable for desktop use.  This is a 7W processor, dumbass.  Reply", "posttime": "2020-07-02 23:50:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,湖田,lakefield,处理器", "title": "英特尔湖田深度潜水：关于第一款x86混合CPU的一切信息", "title_en": "The Intel Lakefield Deep Dive: Everything to Know About the First x86 Hybrid CPU", "transed": 1, "url": "https://www.anandtech.com/show/15877/intel-hybrid-cpu-lakefield-all-you-need-to-know", "via": "", "real_tags": ["英特尔", "湖田", "lakefield", "处理器"]}, {"category": "", "categoryclass": "", "imagename": "f057d335e11fc2a0bd2c09b880196a3d.png", "infoid": 1009500, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时人们潜入Signal的代码中寻找域名，然后他们给我们发来截图，询问他们是否应该担心：我们回复时会给出一个简短的解释，说明为什么没有问题，但我们理解其中的混乱。没有人会为在家庭作业中得到这样的分数而感到兴奋--而且你必须在下课后留下来问老师，在你关于暑假的报告中，“T”到底是什么意思(“T”对学校来说很酷吗？)。让我们更深入地看看到底是怎么回事。这个屏幕截图(和其他类似的截图)来自SSL实验室服务器测试等SSL扫描实用程序。SSL测试是快速检查服务器配置的有用资源。然而，他们有一个很大的盲点，因为他们中的大多数倾向于关注Web浏览器的兼容性和Web浏览器的性能。在应用程序开始接管之前，这曾经是一个更可靠的假设，但当你现在把一个新的服务器放到互联网上时，很有可能网络浏览器不会在连接的另一边。这一区别很重要。Web浏览器可以与之通信的端点数量基本上是无限的。人们可以输入随机的URL，并点击链接到已经在互联网上的数百万个网站中的任何一个。新网站一直都在上线(如果你打开你一直在考虑的博客，这个数字会增加1)，所以在大多数情况下，我们无法提前知道连接的另一端会出现什么公钥。取而代之的是，浏览器附带了来自“证书颁发机构”的预定义信任根证书列表，并有效地将验证外包给这些第三方提供商。这些清单会变得很大。例如，Mozilla Firefox包括175多个受信任的根证书。这是很大的信任！让事情变得更复杂的是，浏览器供应商和操作系统通常维护自己的独特列表，而且每当添加或删除任何内容时，都会涉及到大量的策略和宫廷阴谋。有时，宫廷阴谋甚至涉及领导人住在真正宫殿的国家。现在您正在尝试建立到新博客的安全连接(恭喜BTW)，但是有大量不同的根证书可以为您的域生成证书。任何行为不端、恶意或受损的证书颁发机构都可能通过单方面颁发默认接受的“有效”证书来启用静默的中间人攻击，因为该证书是由受信任实体颁发的。像证书透明化这样的努力旨在通过揭示一个完全不透明的过程来帮助减轻这种威胁，但它们不能检测到每一个不良行为的实例。这有点像在一本儿童书中寻找隐藏的物体，然后得知有超过175个不同的插图画家，他们可能会画出你试图寻找的真实沃尔多/沃利的相同版本。在这一片混乱之中，仍然有可能在每个SSL扫描仪中轻松获得“A”。只需从俱乐部中的某个证书颁发机构获得证书，将正确的魔术行粘贴到配置文件中，您就可以开始工作了。它不需要这么乱，也不需要这么冒险。与Web浏览器不同，应用程序需要与之通信的端点数量通常可以用一只手来计算-更重要的是，应用程序开发人员控制着连接的两端！这改变了一切。不再需要生活在攻击者可以发出假消息的世界中(但是要工作！)。通过危害任何根证书获得SSL证书。取而代之的是，开发人员可以将他们选择的证书颁发机构直接“固定”到应用程序中，并告诉应用程序拒绝任何不匹配的证书。这看起来好多了。如果开发人员选择了主要浏览器信任的证书颁发机构，“A”级仍然只需扫一扫即可。不过，还有改进的空间。通过生成您自己唯一的脱机信任根并将签名证书固定到应用程序中，可以进一步缩小潜在危害的范围。这种方法从证书签名等式中完全消除了第三方信任，这正是Signal所做的。使用我们自己的信任根是处理SSL/TLS连接的一种更安全的方式。以浏览器为中心的证书扫描工具总是认为有问题，但一切都是“F”。浏览器信任无关紧要，因为Signal不是Web浏览器。有时我们白日做梦，想着解决这个扫描仪难题的可能方法。如果有一种方法可以指示扫描器何时域是应用程序端点(而不是浏览器端点)，或者何时域正在使用嵌入到应用程序中的自定义信任根以提高安全性，那就太好了。至少现在我们会有一个更详细的解释准备好下次我们的屏幕截图", "note_en": "Sometimes people dive into Signal’s code looking for domain names, and then they send us screenshots asking if they should be concerned: We reply with a short explanation that lays out why there’s nothing wrong, but we understand the confusion. Nobody would be excited about getting a grade like this on a homework assignment – and you’d have to stay after class and ask the teacher what the hell a “T” even means on your report about summer vacation (“T”oo cool for school?). Let’s take a deeper look at what’s going on. This screenshot (and others like it) come from SSL scanning utilities like the  SSL Labs Server Test. SSL tests can be a helpful resource for quickly checking server configuration. However, they have a big blind spot because most of them tend to focus on web browser compatibility and web browser performance. This used to be a much more reliable assumption before apps started taking over, but when you put a new server on the internet these days, there’s a good chance that a web browser isn’t going to be on the other side of the connection.  This distinction matters. The number of endpoints that a web browser can communicate with is essentially infinite. People can enter random URLs and follow links to any of the millions of websites that are already on the internet. New sites are launched all of the time (and the count will go up by one if you start that blog you’ve been thinking about) so in most cases there’s no way to know in advance what public key to expect on the other side of a connection. Instead, browsers ship with a predefined list of trusted root certificates from “certificate authorities” and effectively outsource verification to these third-party providers. These lists get pretty big. For example, Mozilla Firefox includes more than 175 trusted root certificates. That’s a lot of trust! To make matters even more complicated, browser vendors and operating systems usually maintain their own unique lists, and there’s a lot of maneuvering and palace intrigue involved whenever anything is added or removed. Sometimes that palace intrigue even  involves countries whose leaders live in actual palaces. So here you are, trying to establish a secure connection to your new blog (congrats BTW), but there are tons of different root certificates out there that can generate a certificate for your domain. Any misbehaving, malicious, or compromised certificate authority can potentially enable silent man-in-the-middle attacks by unilaterally issuing a “valid” certificate that will be accepted by default because it was issued by a trusted entity. Efforts like  certificate transparency are designed to help mitigate this threat by shedding light on what is otherwise a completely opaque process, but they can’t detect every instance of bad behavior. It’s a bit like looking for a  hidden object in a children’s book and learning that there are more than 175 different illustrators who could potentially draw an identical version of the real  Waldo/Wally that you’re trying to find. In the midst of this total chaos, it’s still possible to easily get an “A” in every SSL scanner. Just obtain a certificate from one of the certificate authorities that’s in the club, paste  the right magic lines into a config file, and you’re good to go.  It doesn’t need to be this messy or this risky. Unlike a web browser, the number of endpoints that an app needs to communicate with can typically be counted on one hand – and more importantly, the app developer controls both sides of the connection! This changes everything. It’s no longer necessary to live in a world where attackers can issue a phony (but working!) SSL certificate by compromising any root certificate. Instead, developers can “pin” their chosen certificate authority directly into the app and tell the app to reject any certificate that doesn’t match. This is looking quite a bit better. An “A” grade is still just a scan away if the developer chooses a certificate authority that is trusted by the major browsers.  There’s still room for improvement though. It’s possible to further reduce the scope of potential compromise by generating your own unique offline trust root and pinning  that signing certificate into the app. This approach completely eliminates third-party trust from the certificate signature equation, and it’s exactly what Signal does. Using our own trust root is a more secure way of handling SSL/TLS connections. The browser-centric certificate scanning tools always think that something is wrong, but everything is “F”ine. Browser trust doesn’t matter because Signal isn’t a web browser.  Sometimes we daydream about possible ways to solve this scanner conundrum. It would be great if there was a way to indicate to scanners when a domain is an application endpoint (instead of a browser endpoint) or when a domain is using a custom trust root embedded in the app for improved security. At least now we’ll have a more detailed explanation ready next time a screenshot of a big red letter arrives in our inboxes. We’ll keep working hard every day to get a good grade from you. That’s the only one that really matters. Thanks for using Signal!", "posttime": "2020-07-02 23:49:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "证明,certifiably,证书", "title": "可证明的“F”Ine", "title_en": "Certifiably “F”Ine", "transed": 1, "url": "https://signal.org/blog/certifiably-fine/", "via": "", "real_tags": ["证明", "证书"]}, {"category": "", "categoryclass": "", "imagename": "86b82f588163907e07ae1955d578d89d.jpg", "infoid": 1009499, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(CNN商业报道)埃隆·马斯克(Elon Musk)的电动汽车业务超过了几乎所有标准普尔500指数成份股公司的价值，包括一些标志性的美国公司。\n周三午盘，特斯拉(Tesla)股价上涨4%，创下每股1,120美元以上的历史新高。按照这个价格，特斯拉的市值接近2100亿美元。\n这使得特斯拉超越丰田(Toyota)，成为全球市值最高的汽车公司。特斯拉还超过了道指成分股可口可乐(Coca-Cola)、迪士尼(Disney)、思科(Cisco)、默克(Merck)和埃克森美孚(Exxon Mobil)的市值。\n现在标准普尔500指数中只有19家公司的市值超过特斯拉。其中之一就是CNN的所有者美国电话电报公司(AT&amp；T)。特斯拉的市值也超过了贝宝(PayPal)，后者是由马斯克共同创立的另一家支付公司合并而成的。\n特斯拉的利润一直不足以跻身标准普尔500指数(S&P；500)。但它可能正在接近这一里程碑。\n电动卡车制造商尼古拉(Nikola)的股价自该公司6月份通过与一家现有的上市空白支票公司合并上市以来，股价飙升。尼古拉现在的身价接近250亿美元，超过了福特(Ford)。\n而持有私人初创公司Lordstown Motors股份的电池制造商WorkHorse(WKHS)的股价仅在过去一周就翻了一番以上。", "note_en": "New York (CNN Business) Elon Musk&#39;s electric car business exceeds the value of almost every company in the S&amp;P 500, including some iconic American companies.\n Shares of  Tesla  (  TSLA) were up 4% in midday trading Wednesday to a new record high of above $1,120 a share. At that price, Tesla&#39;s market cap is nearly $210 billion .\n  That makes Tesla the most  valuable auto company on the planet, ahead of  Toyota  (  TM). Tesla has also passed the market caps of  Dow components  Coca-Cola  (  KO),  Disney  (  DIS),  Cisco  (  CSCO),  Merck  (  MRK) and  Exxon Mobil  (  XOM).\n   Now there are only 19 companies in the  S&amp;P 500 worth more than Tesla. One of them is CNN owner  AT&amp;T  (  T). Tesla is also worth more than  PayPal  (  PYPL) -- a company that was formed from the merger of another payments company co-founded by Musk.\n Tesla isn&#39;t  consistently profitable enough to  join the S&amp;P 500. But it may be closing in on that milestone.\n  Shares of  electric truck maker Nikola have soared since the company went public in June through a merger with an existing publicly traded blank check company.  Nikola is now worth nearly $25 billion, more than  Ford  (  F).\n And the stock of electric battery maker  Workhorse  (  WKHS), which has a stake in  private startup Lordstown Motors, has more doubled in just the past week.", "posttime": "2020-07-02 23:32:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,价值,worth", "title": "特斯拉现在的价值超过了丰田、迪士尼和可口可乐", "title_en": "Tesla is now worth more than Toyota, Disney and Coke", "transed": 1, "url": "https://edition.cnn.com/2020/07/01/investing/tesla-market-value/index.html", "via": "", "real_tags": ["特斯拉", "价值", "worth"]}, {"category": "", "categoryclass": "", "imagename": "ca5e5778aa4974566ee99710a7326ca2.png", "infoid": 1009498, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在TechCrunch Early Stage，我们为期两天的虚拟活动专注于为创业者提供建立令人难以置信的、高增长的早期公司所需的所有资源，我们有大量的内容专门介绍竞技场。\n从洛托尼领导的如何像风投推介成功的总理那样思考的会议，到杰克·萨珀领导的如何把握筹款冲刺时间的会议，再到杰夫·克拉维尔的融资秘诀和诀窍的播种，每个人都能找到适合自己的东西。即使你没有产品，查尔斯·哈德森也会教你如何向投资者推销你的想法。\nAccel的Amy Saper和Bessemer的Talia Goldberg将领导Pitchdeck拆卸，仔细查看各个投球台提供的外观、手感和信息，分享他们想要什么、不想看到什么，以及当你向VC发送你的投球台时如何获得最佳结果。\n最酷的是球场平台不是理论上的。早期参赛者可以提前提交他们的投球甲板，以便有机会看到这些甲板在舞台上进行现场批评。\n有兴趣成为其中的一部分吗？请在此处提交您的投球台。但请记住，您必须注册为早期参与者才能入选。\nTC早期阶段有很多可以提供的东西。这次展会将汇集50多名来自创业公司核心能力的专家，如筹资、运营和营销。青班尼斯特将解释如何让投资者同意你的创业。阿瑟·艾布拉姆森将分享如何为付费频道创造成长性资产，律师詹姆斯·阿隆索(James Alonso)和亚当·扎加里斯(Adam Zagaris)将分享如何起草第一份合同，普里蒂·乔克西(Priti Choksi)将主持一个关于如何收购而不是出售公司的会议。\n为期两天的展览有50多个环节，但别担心；参会者将获得所有环节的成绩单。更重要的是，大多数演讲者碰巧是投资者，他们都参加了TechCrunch的CrunchMatch，这是我们的平台，基于共同的兴趣将创始人与投资者联系起来。\n这是小字。在50多个分组会议中，每个分组会议的出席人数限制在100人左右。当然，我们预计会有更多的参会者，所以每个课程的注册都是以先到先得的方式进行的。\n今天买票，你就可以报名参加我们今天宣布的突破，以及那些已经发布的突破。通行证持有者也将在我们宣布下一批之前收到24小时的提前通知。(是的，如果存在日程冲突，您可以“放弃”分组会议，转而选择新的分组会议。)。\n今天就拿到你的TTC早期通行证，跳到我们迄今宣布的会议以及未来几周将发表的会议的内部轨道上。", "note_en": "At TechCrunch Early Stage, our two-day virtual event focused on giving entrepreneurs all the resources they need to build incredible, high-growth early stage companies, we have plenty of content dedicated to the pitchdeck.\n From a session on how to  think like a PM for VC pitch success led by Lo Toney, to a session on  how to time your fundraising sprint led by Jake Saper, to  seed funding tips and tricks from Jeff Clavier, there’s something for everyone. Even if you don’t have a product, Charles Hudson will teach you  how to sell your idea to investors.\n   Accel’s   Amy Saper and Bessemer’s  Talia Goldberg   will lead the Pitchdeck Teardown, going over the look, feel and information provided within individual pitchdecks to share what they look for, what they don’t want to see, and how to get the best outcome when you send a VC your deck.\n The coolest part is that the pitchdecks aren’t theoretical. Early Stage attendees can submit their pitchdecks ahead of time for a chance to see those decks critiqued live on stage.\n Interested in being a part of it?   Submit your pitchdeck here. But remember, you must be  registered as an attendee of Early Stage to be selected.\n TC Early Stage has so much to offer. The show will bring together   50+ experts across startup core competencies , such as fundraising, operations, and marketing. Cyan Bannister is set to explain how to get an investor to say yes to your startup. Asher Abramson will be sharing how to create growth assets for paid channels, lawyers James Alonso and Adam Zagaris will share how to draw up your first contracts, and Priti Choksi is hosting a session on how to get a company acquired rather than selling.\n The two-day show features more than 50 sessions, but don’t worry; attendees will get transcripts for all of them. What’s more, most of the speakers, who happen to be investors, are participating in TechCrunch’s CrunchMatch, our platform that connects founders to investors based on shared interests.\n Here’s the fine print. Each of the 50+ breakout sessions is limited to around 100 attendees. We expect a lot more attendees, of course, so signups for each session are on a first-come, first-serve basis.\n Buy your ticket today , and you can sign up for the breakouts we are announcing today, as well as those already published. Pass holders will also receive 24-hour advance notice before we announce the next batch. (And yes, you can “drop” a breakout session in favor of a new one, in the event there is a schedule conflict.)\n Get your   TC Early Stage pass today  and jump into the inside track on the sessions we announced so far, as well as the ones to be published in the coming weeks.", "posttime": "2020-07-02 23:31:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "得到,critiqued,早期", "title": "\n让你的投球台在早期得到Accel的Amy Saper和Bessemer的Talia Goldberg的批评", "title_en": "\n\t\t\t\tGet your pitchdeck critiqued by Accel’s Amy Saper and Bessemer’s Talia Goldberg at Early Stage\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/02/get-your-pitchdeck-critiqued-by-accels-amy-saper-and-bessemers-talia-goldberg-at-early-stage/", "via": "", "real_tags": ["得到", "critiqued", "早期"]}, {"category": "", "categoryclass": "", "imagename": "76fe1148f0fa610a9519f9fbcdf13285.jpg", "infoid": 1009497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你以前听过这个：Facebook将用户数据提供给第三方开发者，即使在明确告诉用户它不会这么做之后，也别告诉我。\n在周三的一篇博客文章中，Facebook宣布(哎呀！)。数以千计的开发人员继续收到用户的非公开信息更新，远远超过了他们应该收到的信息。具体地说，Facebook表示，对于数量不详的用户，它未能切断数据龙头-就像它承诺的那样，它将回到2018年-在一个人最后一次使用应用程序90天后。\n我们联系了Facebook，试图确定到底有多少用户的数据被不当发送到第三方应用程序，但没有收到立即回复。\n然而，Facebook的博客文章确实为隐私问题提供了一些-尽管有限-的洞察力。该公司写道，有问题的用户信息可能涉及电子邮件地址、生日、语言和性别，并在超过90天的门槛后被发送到大约5000个应用程序。\n[最近]我们发现，在某些情况下，应用程序会继续接收用户之前授权的数据，即使他们似乎在过去90天内没有使用过这款应用程序，Facebook负责平台合作的副总裁康斯坦丁诺斯·帕帕米尔蒂亚迪斯(Konstantinos Papamiltiadis)在这篇博客文章中写道。例如，如果有人使用健身应用程序邀请他们家乡的朋友来锻炼，但我们没有意识到他们的一些朋友已经好几个月不活动了，就可能会发生这种情况。\n我们还询问了Facebook最近是如何发现这个错误的，但没有立即得到回应。\n值得注意的是，这并不是第三方开发者第一次被授予对Facebook用户数据的不当访问权限。2019年末，帕帕米尔蒂亚迪斯又写了一篇博客文章，阐述了这种令人震惊的熟悉情况。\nPapamiltiadis当时写道，[我们]最近发现，一些应用程序从群组API访问群组成员信息的时间比我们预期的要长，比如与群组活动相关的姓名和个人资料照片。我们知道，在过去的60天内，至少有11个合作伙伴访问了群成员的信息。\n哦，是的，2018年，帕帕米尔蒂亚迪斯被迫尴尬地解释了为什么某些第三方公司获得了令人不安的Facebook用户数据访问权限。他当时向每个人保证，就像他今天向每个人保证的那样，公司正在努力解决这个问题。\n他写道：我们今年已经采取了一系列措施来限制开发者访问人们的Facebook信息，作为正在进行的努力的一部分，我们正在审查我们所有的API以及可以访问它们的合作伙伴。", "note_en": "Stop me if you&#39;ve heard this one before:  Facebook gave user data to third-party developers, even after specifically telling users it wouldn&#39;t.\n In a Wednesday  blog post, Facebook announced that (oops!) thousands of developers continued to receive updates to users&#39; non-public information well past the point when they should have. Specifically, Facebook said that, for an unspecified number of users, it failed to cut off the data spigot — like  it promised it would back in 2018 — 90 days after a person had last used an app.\n We reached out to Facebook in an attempt to determine just how many users had their data improperly sent to third-party apps, but received no immediate response.\n Facebook&#39;s blog post does provide some — albeit limited — insight into the privacy mishap, however. The company writes that the user info in question possibly involved email addresses, birthdays, language, and gender, and was sent to around 5,000 apps past the 90-day threshold.\n &#34;[Recently], we discovered that in some instances apps continued to receive the data that people had previously authorized, even if it appeared they hadn’t used the app in the last 90 days,&#34; writes Konstantinos Papamiltiadis, Facebook&#39;s vice president of platform partnerships, in the blog post. &#34;For example, this could happen if someone used a fitness app to invite their friends from their  hometown to a workout, but we didn’t recognize that some of their friends had been inactive for many months.&#34;\n We also asked Facebook how &#34;recently&#34; it discovered the error, but received no immediate response.\n Notably, this is not the first time third-party developers have been given improper access to Facebook users&#39; data. In late 2019, Papamiltiadis wrote yet another  blog post laying out the  shockingly familiar situation.\n &#34;[We] recently found that some apps retained access to group member information, like names and profile pictures in connection with group activity, from the Groups API, for longer than we intended,&#34; wrote Papamiltiadis at the time. &#34;We know at least 11 partners accessed group members&#39; information in the last 60 days.&#34;\n Oh yeah, and in 2018 Papamiltiadis was forced to  awkwardly explain why certain third-party companies were given troubling amounts of access to Facebook users&#39; data. He assured everyone then, as he assured everyone today, that the company was working on it.\n  &#34;We’ve taken a number of steps this year to limit developers&#39; access to people&#39;s Facebook information, and as part of that ongoing effort, we&#39;re in the midst of reviewing all our APIs and the partners who can access them,&#34;  he wrote.", "posttime": "2020-07-02 23:11:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,开发,admits", "title": "Facebook再次承认向第三方开发者不当提供用户数据", "title_en": "Facebook admits to improperly giving user data to third-party developers, again", "transed": 1, "url": "https://mashable.com/article/facebook-gave-users-data-5000-third-party-developers/", "via": "", "real_tags": ["facebook", "开发", "admits"]}, {"category": "", "categoryclass": "", "imagename": "fe78fecdcaa09c8441c1d1bd67ba955a.jpg", "infoid": 1009496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大卫·坎塞(David Cancel)曾五次创业，著有“对话式营销”(Conversational Marketing)一书，他是漂移公司(Drift)的首席执行官和创始人。\n这场大流行让我质疑并重新评估了我自己的许多假设。这不仅导致我远程雇佣我们的CRO，而且这也是我最终决定允许员工在家工作到2021年的原因。\n虽然这很容易被称为支点，但那些与我共事过的人可能会更准确地将其描述为人字拖。我曾经相信，你可以建立面对面的文化或远程工作文化，但这两者的混合注定会失败。\n新冠肺炎的现实不仅改变了我的观点，也改变了我对应该如何完成工作的思考方式-以及领导者需要如何为他们的团队露面，即使他们不能在任何物理意义上“露面”。\n在大流行之前，关于远程工作的辩论围绕着人们认为远程工作对生产力、协作、员工参与度和文化的影响。", "note_en": "David Cancel, a five-time entrepreneur and author of the book &#34;Conversational Marketing,&#34; is CEO and founder of  Drift.\n  The pandemic has caused me to question and reevaluate many of my own assumptions. This not only led me to hire our CRO remotely, but it is ultimately why I also decided to allow employees to work from home until 2021.\n While it’s tempting to call this a pivot, those who have worked with me would probably describe it more accurately as a flip-flop. I used to believe that you could build an in-person culture or a remote work culture, but that a hybrid of the two was destined to fail.\n The realities of COVID-19 have not just changed my outlook, but transformed the way I think about how work should get done —and how leaders need to show up for their team, even if they can’t “show up” in any physical sense.\n  Before the pandemic, the debate over remote work revolved around its perceived impact on productivity, collaboration, employee engagement and culture.", "posttime": "2020-07-02 23:10:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程工作,flopped", "title": "\n为什么我在反对远程工作的问题上反复无常", "title_en": "\n\t\t\t\tWhy I flip-flopped on opposing remote work\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/02/why-i-flip-flopped-on-opposing-remote-work/", "via": "", "real_tags": ["远程工作", "flopped"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009495, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：合成数据是一种越来越受欢迎的工具，用于训练深度学习模型，特别是在计算机视觉方面，但也在其他领域。在这项工作中，我们试图对合成数据的发展和应用的各个方向进行全面的综述。首先，我们讨论了基本计算机视觉问题的合成数据集，包括低级(例如光流估计)和高层(例如语义分割)，室外和城市场景的合成环境和数据集(自动驾驶)，室内场景(室内导航)，空中导航，机器人的仿真环境，计算机视觉之外的合成数据的应用(在神经编程，生物信息学，自然语言处理等方面)；我们还综述了改进合成数据开发的工作和产生合成数据的替代方法，如GANS。其次，我们详细讨论了合成数据应用中不可避免的领域自适应问题，包括基于GaN模型的合成到真实的精化和没有显式数据转换的特征/模型级的领域自适应。第三，我们转向与竞争相关的合成数据应用，并回顾了生成具有不同隐私保障的合成数据集的工作。最后，我们强调了在合成数据研究中进一步工作的最有前途的方向。", "note_en": "Download PDF  Abstract: Synthetic data is an increasingly popular tool for training deep learningmodels, especially in computer vision but also in other areas. In this work, weattempt to provide a comprehensive survey of the various directions in thedevelopment and application of synthetic data. First, we discuss syntheticdatasets for basic computer vision problems, both low-level (e.g., optical flowestimation) and high-level (e.g., semantic segmentation), syntheticenvironments and datasets for outdoor and urban scenes (autonomous driving),indoor scenes (indoor navigation), aerial navigation, simulation environmentsfor robotics, applications of synthetic data outside computer vision (in neuralprogramming, bioinformatics, NLP, and more); we also survey the work onimproving synthetic data development and alternative ways to produce it such asGANs. Second, we discuss in detail the synthetic-to-real domain adaptationproblem that inevitably arises in applications of synthetic data, includingsynthetic-to-real refinement with GAN-based models and domain adaptation at thefeature/model level without explicit data transformations. Third, we turn toprivacy-related applications of synthetic data and review the work ongenerating synthetic datasets with differential privacy guarantees. We concludeby highlighting the most promising directions for further work in syntheticdata studies.", "posttime": "2020-07-02 23:08:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,深度,data,合成", "title": "用于深度学习的合成数据", "title_en": "Synthetic Data for Deep Learning", "transed": 1, "url": "https://arxiv.org/abs/1909.11512", "via": "", "real_tags": ["深度学习", "深度", "data", "合成"]}, {"category": "", "categoryclass": "", "imagename": "ee4318471d2dc54aac2f7596d33ff114.jpg", "infoid": 1009494, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了保持透明，出于对我们教师社区的尊重，我想通知您DataCamp和我们的竞争对手RStudio之间的一个悬而未决的法律问题。\n在过去的几个月里，RStudio继续散布关于DataCamp从2017年10月开始处理内部HR事件以及我们对此做出后续回应的错误信息，引用被证明不准确的文章，并故意忽略独立第三方审查的结果，尽管RStudio一再被告知这一点。*此外，RStudio和DataCamp领导层之间的私下交流清楚地表明，RStudio不是出于企业责任，而是因为它通过贬低DataCamp并切断与我们的联系而获得的经济利益推动了RStudio的发展。*此外，RStudio与DataCamp领导层之间的私下交流清楚地表明，RStudio不是由企业责任驱动的，而是由它从贬低DataCamp并切断与我们的联系中获得的经济利益驱动的。\n这场诽谤运动导致我们的员工在私下和公开场合受到不公平对待，教师因为担心招致反弹而对推广学习材料感到不舒服，学习者在社交媒体上受到欺凌。\n由于RStudio没有表现出阻止这种恶劣行为的意图，我们今年早些时候决定聘请美国最负盛名的诽谤律师事务所之一克莱尔·洛克律师事务所(Clare Locke LLP)来探索我们针对RStudio的法律选择。从那时起，已经采取了初步的法律步骤。\n在您的帮助下，我们构建了创新且经济实惠的学习体验，改善了600万学员的数据科学教育(！)。全世界。我们一起重新杀害了数百万人，帮助学习者在数据科学领域追求有前途的职业，帮助数千家公司成为数据驱动型公司，并通过我们的免费课堂计划为数十万数据科学学生的免费教育做出了贡献。因此，看到学习者在获得改变生活的技能后自豪地分享他们的成就，并庆祝为数据科学教育做出贡献的教师，我们都应该感到兴奋。\n采取法律行动是最后的手段，但当竞争对手在知情的情况下公开传播虚假信息长达数月时，我们被迫做出反应。虽然我预计会在社交媒体上收到一些热议，但我不能再袖手旁观，眼睁睁地看着RStudio的这种行为对关心DataCamp并从中受益的人产生负面影响。\n与此同时，DataCamp将继续其使数据科学教育民主化的使命。一次一个学习者。\n*他们错误信息运动的一个关键部分是分发并支持分发BuzzFeed在2019年5月发布的一篇文章，该文章歪曲了一起事件，以及DataCamp从2017年10月开始对该事件的后续回应。每个人都可以通过阅读我们在2019年10月委托进行的独立的第三方审查(之前分发给教师)来验证这篇文章对事件的不准确描述。令人失望的是，RStudio相信BuzzFeed新闻业(谁在乎这是不是真的)，而不是奥巴马政府的前司法部官员阿努里玛·巴尔加瓦(Anurima Bhargava)和工作理想(Working Idea)的帕梅拉·库科斯(Pamela Coukos)的职业声誉。", "note_en": "In an effort to be transparent and out of respect for our instructor community, I would like to inform you about a pending legal matter between DataCamp and our competitor, RStudio.\n Over the past several months, RStudio has continued to spread misinformation about DataCamp’s handling of an internal HR incident from October 2017 and our follow-up response to it, quoting articles that were proven to be inaccurate and intentionally ignoring the results of an independent third-party review, despite being repeatedly made aware of it.* Additionally, private exchanges between RStudio and DataCamp’s leadership clearly indicate that RStudio is not driven by corporate responsibility, but by the financial benefit it gains from disparaging DataCamp and severing its ties with us.\n This smear campaign has led to our employees being treated unfairly privately and publicly, instructors feeling uncomfortable promoting learning materials for fear of backlash, and learners being bullied on social media.\n  As RStudio shows no intent of stopping this egregious conduct, we decided earlier this year to hire Clare Locke LLP, one of the USA’s most reputable defamation law firms, to explore our legal options against RStudio. Since then, initial legal steps have been taken.\n With your help, we have built an innovative and affordable learning experience that improved data science education for 6 million learners (!) worldwide. Together we have reskilled millions of individuals and helped learners pursue promising careers in data science, helped a few thousand companies to become data driven, and contributed to the free education of hundreds of thousands of data science students via our free classroom program. We should therefore all be excited to see learners proudly share their achievements after gaining life-changing skills and celebrate instructors who are contributing to data science education.\n Taking legal action is a last resort, but when a competitor knowingly spreads false information publicly for months we are forced to react. While I am expecting to receive some social media heat over this, I can no longer stand by and watch this type of behavior by RStudio negatively affect the people that care about, and benefit from, what DataCamp does.\n In the meantime, DataCamp will continue its mission of democratizing data science education. One learner at a time.\n  * A key part of their misinformation campaign is the distribution, and supporting the distribution, of an article published by BuzzFeed in May of 2019 that misrepresented an incident and DataCamp’s follow-up response to it from October 2017. Everyone can verify the article’s inaccurate portrayal of events by reading the  independent, third-party review we commissioned in October 2019 (previously circulated to instructors). It is disappointing to see that RStudio believes BuzzFeed journalism ( who cares if it’s true) over the professional reputation of Anurima Bhargava, a former Department of Justice official in the Obama administration, and Pamela Coukos from Working IDEAL.", "posttime": "2020-07-02 23:08:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "suing,rstudio", "title": "Datacamp正在起诉RStudio诽谤", "title_en": "Datacamp is suing RStudio for defamation", "transed": 1, "url": "https://www.datacamp.com/community/blog/rstudio-pending-legal-matter", "via": "", "real_tags": ["suing", "rstudio"]}, {"category": "", "categoryclass": "", "imagename": "d3cb2f5efce39f7e0b23780074a1ed89.jpeg", "infoid": 1009492, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近的一项研究显示，随着雇主裁员以应对冠状病毒大流行带来的经济余震，全球近一半的科技工作者担心今年会失去工作。\n在5月份接受在线科技招聘公司Employee Inc.调查的2,300名科技专业人士中，约有42%的人参与了调查。说他们有在未来六个月内被解雇的风险。\n受访者对找到新工作的可能性也存在分歧，39%的受访者表示不敢离开目前的职位。\n“不管有些人怎么想，IT专业人士也不能幸免于经济驱动的焦虑，”雇用的首席执行官梅胡尔·帕特尔(Mehul Patel)说。\n研究称，近几个月来，几家知名科技公司的一轮裁员和休假也没有起到帮助作用。\n优步技术(Uber Technologies)在5月份表示，由于销售下滑，计划裁员6700人。大约一周前，Airbnb Inc.。表示将裁员25%，约合1900人。今年4月，Lyft解雇了900多名员工，并解雇了288名员工。\n规模较小的科技公司也在减少员工人数。根据数据追踪机构Layoffs.fyi的数据，自3月11日冠状病毒爆发正式宣布为大流行以来，截至5月底，已有360多家风险投资支持的科技初创企业解雇了约5.6万名员工。\n根据IT行业组织CompTIA的数据，美国科技公司4月份裁员11.2万人，创下历史新高。该组织说，5月份科技行业以外IT招聘的增加将美国公司科技工人的失业率从4月份的4.3%降至3.7%。预计下周将公布6月份的数据。\n可用工人的涌入标志着科技劳动力市场的突然转变，直到最近，该市场一直面临着人才严重短缺的问题。\nCompTIA负责研究和市场情报的执行副总裁蒂姆·赫伯特(Tim Herbert)表示，随着公司大幅削减IT预算和搁置长期技术项目，危机正在推动失业。\n毕马威会计师事务所(KPMG LLP)5月份发布的另一份报告说，在接受调查的200多名科技行业员工中，67%的人也担心被自动化取代，包括雇主在疫情爆发期间用于业务连续性努力的工具。报告称，相比之下，科技行业以外的公司员工的这一比例为44%。\n尽管受雇公司没有过去的就业数据可供比较，但帕特尔说，科技专业人士的焦虑程度“异常高”，这是对这种突如其来的经济冲击的一种可以理解的反应。\n但是，他补充说，并不是所有的行业都受到同样严重的打击：“电子商务和网络安全正在经历需求的大幅增长，并正在大幅加大招聘力度，”帕特尔说。\n急于为投资组合公司抢购软件开发人员和工程师的风险投资公司已经开始组织虚拟职业活动，提供免费的简历审查服务。\n科技招聘公司Heller search Associates的首席执行长海勒(Martha Heller)说，许多公司都在依靠数字能力进行远程工作和其他业务连续性工具。她说，这应该会为熟练掌握云技术或数据和分析等领域的技术工人提供一定程度的工作保障。\n“Covid向所有行业的首席执行官们展示了数据和数字技术是他们最具战略意义的投资领域，”海勒说。她说：“与其他职能部门相比，IT招聘应该在整个大流行期间保持强劲。”", "note_en": "Nearly half of the technology workers at companies world-wide are worried about losing their jobs this year as employers downsize to cope with the economic aftershocks of the coronavirus pandemic, according to a recent study.\n  Roughly 42% of 2,300 tech professionals surveyed in May by online tech-recruiting firm Hired Inc. said they were at risk of being laid off within the next six months.\n  Respondents were also split on the likelihood of finding a new job, with 39% saying they are afraid to leave their current position.\n  “Despite what some may think, IT professionals are not immune to economically-driven anxiety,” said Mehul Patel, Hired’s chief executive.\n    A round of layoffs and furloughs at several high-profile tech firms in recent months hasn’t helped, the study said.\n  Uber Technologies  in May said it planned to cut 6,700 positions, amid slumping sales. About a week earlier, Airbnb Inc. said it would cut 25% of its workforce, or roughly 1,900 jobs. In April,  Lyft  fired more than 900 workers and furloughed 288.\n    Smaller tech firms are also reducing head counts. According to data tracker Layoffs.fyi, by the end of May some 56,000 employees had been let go by more than 360 venture-backed tech startups since March 11, when the coronavirus outbreak was officially declared a pandemic.\n  U.S. technology companies shed a record 112,000 jobs in April, according to IT trade group CompTIA. An uptick in IT hiring outside the tech sector in May lowered the unemployment rate for tech workers at U.S. companies to 3.7%, from 4.3% in April, the group said. It is expected to report June numbers next week.\n  The influx of available workers marks an abrupt shift for the tech labor market, which until recently had been facing a severe shortage of talent.\n  Tim Herbert, CompTIA’s executive vice president for research and market intelligence, said job losses are being driven by the crisis, as companies slash IT budgets and put long-term technology projects on hold.\n  A separate report in May, conducted by KPMG LLP, said 67% of more than 200 technology-sector workers surveyed are also  worried about being replaced by automation, including tools used by employers for business-continuity efforts during the pandemic. That compares with 44% among workers at companies outside the tech sector, the report said.\n  Though Hired has no past job data for comparisons, Mr. Patel said the level of anxiety among tech professionals is “unusually high” and an understandable reaction to such a sudden economic shock.\n  But, he adds, not all industries are being hit equally hard: “E-commerce and cybersecurity are experiencing a massive increase in demand and are ramping up hiring efforts substantially,” Mr. Patel said.\n  Venture firms eager to snap up software developers and engineers for portfolio companies have  started organizing virtual career events that offer free resume-review services.\n  Martha Heller, chief executive of tech-recruiting firm Heller Search Associates, said many companies are leaning on digital capabilities for remote work and other business-continuity tools. That should provide some measure of job security for tech workers skilled in cloud technologies or data and analytics, among other areas, she said.\n  “Covid has shown CEOs, across all industries, that data and digital technologies are their most strategic investment areas,” Ms. Heller said. “IT hiring should stay strong throughout the pandemic, compared to other functional roles,” she said.", "posttime": "2020-07-02 22:48:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科技,anxiety", "title": "就业焦虑蔓延至科技行业", "title_en": "Job Anxiety Spills into Tech Sector", "transed": 1, "url": "https://www.wsj.com/articles/job-anxiety-spills-into-tech-sector-11593038017", "via": "", "real_tags": ["科技", "anxiety"]}, {"category": "", "categoryclass": "", "imagename": "f9a86bac1e4a2faaa437f1c15cb1af58.jpg", "infoid": 1009491, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "量子效应通常被认为是小而脆弱的。通常情况下，只有当物体很小并且保持在绝对零度附近时，我们才能检测到它们，而它们被那些条件之外的非量子效应淹没了。基本上都是。在周三出版的“自然”杂志上，研究人员报告说，可以在一些非常大的物体中探测到量子效应：激光干涉仪引力波天文台(LIGO)的40公斤重的反射镜。\n这篇论文详细介绍了研究人员是如何探测到LIGO反射镜中的噪音的，这些噪音是由反射到LIGO反射镜上的光的量子波动引起的。通过添加一些特别准备的光，研究人员限制了这种噪音，从而提高了对引力波的探测灵敏度。\nLIGO硬件中有很多噪声源。关键的硬件位于真空室内，但是我们不能真正消除所有的杂散分子撞到它上面。镜子是常温保存的，所以有一些热噪音总是干扰我们的测量。然后是量子噪音。LIGO是基于相隔几公里的镜子，来回反射激光束多次。这些激光束是由遵守量子力学规则的光子组成的。\n在这种情况下，问题是对光的测量，如果激光被经过的引力波改变，就会形成一种干涉图案，这种干涉图案会微妙地移动。但同样的光也会受到空间本身量子涨落的影响。这些波动产生的噪声源限制了仪器测量的精度，从而限制了我们探测引力波事件的能力。\n限制这种噪音的关键是海森堡测不准原理，该原理规定我们了解量子物体的性质是有限度的。因此，我们不能说出这些光子的位置超过一定的极限，因为它们一直在一定的数值范围内波动。\n但有一条路可以绕过海森堡。某些量子属性可以相互关联，在这种情况下，不确定性限制了这些属性的组合值。如果您在其中一个属性中接受大量噪波，则可以在测量另一个属性时获得更高的精度。著名的是，这适用于位置和动量：如果你想更准确地知道粒子在哪里，你可以通过牺牲其动量的精度来做到这一点。\n但是，位置和动量并不是唯一可以关联的属性。在这种情况下，研究人员依赖于光波振幅和相位之间的相关性。通过操纵其中一个，他们可能会增加另一个的不确定性。\n这些关联自然发生在LIGO仪器内部的光线中。当它在两面镜子之间来回反弹时，它会在镜子上施加一种名为辐射压力的力。这个过程在仪器内部的光子的振幅和相位之间产生了关联。反过来，相位对于创建记录引力波通过的干涉图案至关重要。\n为了利用这种相关性来压缩量子噪音，研究人员使用所谓的压缩真空来操纵光的振幅。在这种状态下，光的平均振幅为零，但是仍然可以操纵相位和振幅，从而允许这些属性之一被压缩。被压缩的真空被引导到仪器中，在那里它与一个临界镜相互作用，而临界镜也与仪器本身发出的压缩光子相互作用。\n作为对照，研究人员在没有挤压真空的情况下运行该装置，该装置提供了来自所有来源的噪音的基线读数。然后，他们将压缩后的真空注入仪器，尝试对其振幅和相位进行不同程度的压缩。这导致了较低的总噪声，并且他们的测量表明噪声对压缩特性很敏感。通过改变这些属性，他们能够将最小噪声频率转移到不同的频率，从而提高了LIGO对特定事件类别的敏感度。\n这一结果在许多方面都意义重大。首先，噪音的差异取决于光与室温下一面40公斤重的镜子之间的相互作用。这并不意味着镜子表现得像一个量子物体，或者与光纠缠在一起。但这确实意味着我们可以测量量子相互作用对坐在室温下的大型物体的物理运动的影响。\n这有几个有趣的后果。首先，这是研究人员第一次设法在这样的设置中逃脱量子不确定性对系统施加的限制。这也意味着研究人员在没有破坏光包含的信息的情况下改变了光的量子属性。\n虽然从理解量子力学的角度来看，这两项成就都很重要，但降低噪音对操作设备也是至关重要的。作者写道，在LIGO/Virgo的第三次观测过程中，LIGO中的挤压角被设置为优化探测器对来自双星中子星合并的引力波的灵敏度。这是允许高级LIGO从在观测运行1和2中每月检测大约一个天体物理事件到在LIGO/处女座的第三个观测运行中每周检测大约一个天体物理触发事件的因素之一。&#34；", "note_en": "Quantum effects are generally thought of as small and fragile. Typically, we&#39;re only able to detect them when things are tiny and kept near absolute zero, and they&#39;re swamped by non-quantum effects outside of those conditions. Mostly. In Wednesday&#39;s issue of Nature, researchers are reporting that quantum effects can be detected in some very large objects: the 40kg mirrors of the Laser Interferometer Gravitational-Wave Observatory, or LIGO.\n The paper details how researchers were able to detect noise in the mirrors of LIGO caused by quantum fluctuations in the light reflecting off them. And by adding some specially prepared light, the researchers limited that noise, allowing increased sensitivity in the detection of gravitational waves.\n  There are plenty of sources of noise in the LIGO hardware. Key hardware sits inside a vacuum chamber, but we can&#39;t really eliminate all stray molecules from bumping into it. The mirrors are kept at room temperature, so there&#39;s some thermal noise that&#39;s always interfering with our measurements. And then there&#39;s quantum noise. LIGO is based on mirrors separated by kilometers reflecting laser beams back and forth multiple times. And those laser beams are composed of photons that obey the rules of quantum mechanics.\n In this case, the issue is the measurement of the light, which forms an interference pattern that will shift subtly if the lasers have been altered by a passing gravitational wave. But that same light is also influenced by quantum fluctuations in space itself. These fluctuations create a source of noise that limits the precision of the instrument&#39;s measurements and thus limits our ability to detect gravitational wave events.\n The key to limiting this noise is the Heisenberg Uncertainty Principle, which dictates that there are limits to how well we can know the properties of quantum objects. Thus, we can&#39;t tell the position of these photons beyond a certain limit, because they&#39;re constantly fluctuating around a range of values.\n But there is a way around Heisenberg. Certain quantum properties can be correlated, in which case the uncertainty limits the combined values of these properties. If you accept a lot of noise in one of the properties, you can get a lot more precision in your measurements of the other. Famously, this applies to location and momentum: if you want to know more precisely where a particle is, you can do so by sacrificing precision about its momentum.\n But location and momentum aren&#39;t the only properties that can be correlated. In this case, the researchers relied on correlations between the amplitude of the light waves and their phase. By manipulating one, they could increase the uncertainty in the other.\n  Those correlations occur naturally in the light within the LIGO instrument. As it bounces back and forth between the two mirrors, it exerts a force called radiation pressure on the mirrors. This process induces a correlation between the amplitude and phase of the photons that have been inside the instrument. The phase, in turn, is critical for creating the interference pattern that registers the passing of gravitational waves.\n To use this correlation to squeeze down the quantum noise, the researchers manipulated the amplitude of light by using what&#39;s called a squeezed vacuum. In this state, the average amplitude of the light is zero, but the phase and amplitude can still be manipulated, allowing one of these properties to be squeezed. The squeezed vacuum was directed into the instrument, where it interacted with a critical mirror—one that was also interacting with the squeezed photons coming out of the instrument itself.\n As a control, the researchers ran the setup without the squeezed vacuum, which provided a baseline reading of the noise from all sources. They then injected the squeezed vacuum into the instrument, trying varying degrees of squeezing of its amplitude and phase. This resulted in a lower total noise, and their measurements showed that the noise was sensitive to the properties of the squeezing. By altering these properties, they were able to shift the minimum to different frequencies of noise, increasing LIGO&#39;s sensitivity to specific classes of events.\n This result is significant in a number of ways. For one, the differences in noise were dependent upon the interactions between light and a 40 kilogram mirror residing at room temperature. This doesn&#39;t mean that the mirror was behaving as a quantum object or had been entangled with the light. But it does mean that we can measure the effect that quantum interactions have on the physical motion of a large object sitting at room temperature.\n This has a couple of interesting consequences. For one, this is the first time that researchers have managed to escape the limit placed on a system by quantum uncertainty in a setup like this. It also means that the researchers have altered the quantum properties of light without destroying the information it contains.\n While both of those accomplishments are significant from the perspective of understanding quantum mechanics, the reduction in noise is also critical to operating the equipment. &#34;During the third observing run of LIGO/Virgo, the squeezing angle in LIGO is set to optimize the sensitivity of the detectors to gravitational waves from binary neutron star mergers,&#34; the authors write. &#34;This is one of the factors that has allowed Advanced LIGO to go from detecting roughly one astrophysical event per month in observing runs 1 and 2 to about one astrophysical trigger per week in the third observing run of LIGO/Virgo.&#34;", "posttime": "2020-07-02 22:30:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "量子,sensitive", "title": "LIGO是如此敏感，以至与光的量子噪声一起颤抖", "title_en": "LIGO is so sensitive it shudders with the quantum noise of light", "transed": 1, "url": "https://arstechnica.com/science/2020/07/ligo-is-so-sensitive-it-shudders-with-the-quantum-noise-of-light/", "via": "", "real_tags": ["量子", "sensitive"]}, {"category": "", "categoryclass": "", "imagename": "736ee9987456232d6fbe8cd23a89568f.jpg", "infoid": 1009490, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一集风险投资在SeedCamp、7%Ventures、YCombinator、Kima Ventures和几个未透露姓名的天使投资者的帮助下领导了这轮融资。\n该数据库最初构思于2013年，当时现任CTO Vlad Ilyushchenko正在为一家金融服务公司构建交易系统，他对当时可用的数据库的性能限制感到沮丧，因此开始构建一个可以处理大量数据并以极快速度处理的数据库。\n多年来，QuestDB一直是一个副业，是伊柳琴科热爱的劳动，直到他遇到了其他联合创始人尼古拉斯·霍尔卡德(Nicolas Hourcard)和坦克雷德·科拉德(Tancrede Collard)，后者成为首席执行官和首席运营官，三人去年决定在开源项目的基础上建立一家初创公司。\n我们正在为时间序列数据建立一个开源数据库，时间序列数据库是一个数十亿美元的市场，因为它们是金融服务、物联网和其他企业应用程序的核心。我们基本上可以轻松处理爆炸性的数据量，并大幅降低基础设施成本，“Hourcard告诉TechCrunch。\n他补充说，这也与高性能有关。他说：“我们最近发布了一个演示，你可以从我们的网站上访问，它可以让你查询一个超大的数据集-16亿行，大部分是亚秒级的查询，这正好说明了这款软件的性能有多好。”\n他认为开源是一种在组织内部自下而上建立采用率的方式，首先赢得开发人员的心，然后在他们最终构建产品的托管云版本时深入公司。目前，开源还有助于他们作为一个小团队拥有一个贡献者社区来帮助构建数据库并增加其功能集。\n“我们有这个免费使用的开源产品，拥有这样的分发模式对我们来说相当重要，因为我们基本上可以授权开发者解决他们的问题，我们可以要求各个社区的贡献。[…]。这确实是一种促进领养的方式，“Hourcard说。\n他说，与YC的合作让他们能够与生态系统中建立了类似开源初创公司的其他公司交谈，这很有帮助，但也帮助他们学会了设定和实现目标，并有机会接触到硅谷的一些大人物，包括马克·安德森(Marc Andreessen)，他在我们交谈的同一天向这群人发表了演讲。\n今天，该公司拥有7名员工，其中包括三名创始人，分布在美国、欧盟和南美。他认为，当谈到未来建立一个多元化的团队时，这种地理多样性是有帮助的。“我们当然希望拥有更多不同的背景，以确保我们继续拥有一个多元化的团队，我们对此做出了非常坚定的承诺。”\n短期内，该公司希望继续建立自己的社区，致力于继续改进开源产品，同时致力于托管云产品。", "note_en": "Episode1 Ventures led the round with assistance from Seedcamp, 7percent Ventures, YCombinator, Kima Ventures and several unnamed angel investors.\n The database was originally conceived in 2013 when current CTO Vlad Ilyushchenko was building trading systems for a financial services company and he was frustrated by the performance limitations of the databases available at the time, so he began building a database that could handle large amounts of data and process it extremely fast.\n  For a number of years,  QuestDB   was a side project, a labor of love for Ilyushchenko until he met his other co-founders Nicolas Hourcard, who became CEO and Tancrede Collard, who became CPO, and the three decided to build a startup on top of the open source project last year.\n “We’re building an open source database for time series data, and time series databases are a multi-billion dollar market because they’re central for financial services, IoT and other enterprise applications. And we basically make it easy to handle explosive amounts of data, and to reduce infrastructure costs massively,” Hourcard told TechCrunch.\n He adds that it’s also about high performance. “We recently released a demo that you can access from our website that enables you to query a super large datasets — 1.6 billion rows with sub-second queries, mostly, and that just illustrates how performant the software is,” he said.\n He sees open source as a way to build adoption from the bottom up inside organizations, winning the hearts and minds of developers first, then moving deeper in the company when they eventually build a managed cloud version of the product. For now, being open source also helps them as a small team to have a community of contributors help build the database and add to its feature set.\n “We’ve got this open source product that is free to use, and it’s pretty important for us to have such a distribution model because we can basically empower developers to solve their problems, and we can ask for contributions from various communities. […] And this is really a way to spur adoption,” Hourcard said.\n He says that working with YC has allowed them to talk to other companies in the ecosystem who have built similar open source-based startups and that’s been helpful, but it has also helped them learn to set and meet goals and have access to some of the biggest names in Silicon Valley, including Marc Andreessen, who delivered a talk to the cohort the same day we spoke.\n Today the company has 7 employees including the three founders, spread out across the US, EU and South America. He sees this geographic diversity helping when it comes to building a diverse team in the future. “We definitely want to have more diverse backgrounds to make sure that we keep having a diverse team and we’re very strongly committed to that.”\n For the short term, the company wants to continue building its community, working on continuing to improve the open source product, while working on the managed cloud product.", "posttime": "2020-07-02 22:29:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,数据库,开源,用于,build", "title": "\nQuestDB nabs$230万种子用于构建开源时间序列数据库", "title_en": "\n\t\t\t\tQuestDB nabs $2.3M seed to build open source time series database\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/02/questdb-nabs-2-3m-seed-to-build-open-source-time-series-database/", "via": "", "real_tags": ["database", "数据库", "开源", "用于", "build"]}, {"category": "", "categoryclass": "", "imagename": "26acb96fffb33283e638bd66aae6ab5b.jpeg", "infoid": 1009489, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在7月4日的周末之前，沃尔玛宣布与翠贝卡企业(Tribeca Enterprise)(最著名的是同名电影节的承办方)建立合作伙伴关系，将把160家门店改造成临时的免下车电影院。\n这一举措是现有翠贝卡(Tribeca)主导的免下车项目的延伸，该项目已经在IMAX和AT&AMT的帮助下宣布了几个城市的活动，包括洛杉矶、纽约、阿灵顿、德克萨斯州、迈阿密和西雅图。好莱坞报道。细节仍然很薄，但这样一家无处不在的零售商的参与可能有助于将该计划扩展到上述城市中心以外的社区。\n从8月份开始，我们将在沃尔玛精选的门店与@Tribeca合作，铺开汽车影院首映式的红地毯，并提供车载🍿和🥤服务。更多详情敬请关注。电影院见！https://t.co/JfUPB6QK8C pic.twitter.com/t4Enk8aYzL。\n在沃尔玛免下车之前，随着新冠肺炎在全国范围内继续飙升，消费者对重返室内影院体验持谨慎态度，可以理解的是，一些规模较小的举措帮助这一基本上已经消亡的类别看到了复苏。大多数影院都依赖于老电影-事实上，在新趋势的推动下，《侏罗纪公园》在上映近30年后最近登上了美国票房榜首。\n沃尔玛的放映时间定在8月至10月，翠贝卡将负责电影选片。目前还没有关于日程安排的消息，但翠贝卡之前宣布的人选包括赛琳娜、保镖、直奔康普顿、克里德、杰里·马奎尔、太空果酱、爱情与篮球、比尔和泰德的绝佳冒险、回到未来、卑鄙女孩、超级坏蛋、女孩之旅、伴娘、塔拉迪加之夜、速度与激情、金手指、皇家赌场、Inside Out、乐高电影和间谍儿童。", "note_en": "Just ahead of the Fourth of July weekend, Walmart announced a partnership with Tribeca Enterprises (most notably the purveyors of the film festival of the same name) that’s set to convert 160 store locations into makeshift drive-in movie theaters.\n The move is an extension of the existing  Tribeca-led Drive-In program that has already announced events for a handful of cities, including Los Angeles, New York, Arlington, TX, Miami and Seattle, with help from IMAX and AT&amp;T.   The Hollywood Reporter has a bit more detail about the new initiative. Details are still pretty thin, but the involvement of such a ubiquitous retailer could help extend the program to communities outside of the aforementioned urban centers.\n Starting in August at select  Walmart   stores, we’re partnering with  @Tribeca and rolling out the red carpet for drive-in movie premieres, complete with car-side 🍿and 🥤service. Stay tuned for more details. See you at the movies!  https://t.co/JfUPB6QK8C  pic.twitter.com/t4Enk8aYzL\n Walmart Drive-In follows a number of smaller scale initiatives that have helped the largely extinguished category see a resurgence as consumers are understandably wary of returning to an indoor theater experience as COVID-19 continues to spike across the country. Most theaters have relied on older films — in fact, Jurassic Park recently hit number one at the U.S. box office nearly 30 years after its release on the strength of the new trend.\n  The Walmart screenings are set for August through October, with Tribeca at the helm of the film selection. No word yet on the schedule, but Tribeca’s previously announced selection includes Selena, The Bodyguard, Straight Outta Compton, Creed, Jerry Maguire, Space Jam, Love &amp; Basketball, Bill &amp; Ted’s Excellent Adventure, Back to the Future, Mean Girls, Superbad, Girls Trip, Bridesmaids, Talladega Nights, The Fast and The Furious, Goldfinger, Casino Royale,  Inside Out, The Lego Movie and Spy Kids.", "posttime": "2020-07-02 22:29:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "翠贝卡,tribeca,沃尔玛", "title": "\n沃尔玛与翠贝卡合作将160个商店停车场改造为免下车影院", "title_en": "\n\t\t\t\tWalmart partners with Tribeca to turn 160 store parking lots into drive-in theaters\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/02/walmart-partners-with-tribeca-to-turn-160-store-parking-lots-into-drive-in-theaters/", "via": "", "real_tags": ["翠贝卡", "tribeca", "沃尔玛"]}]