[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1015047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已在GRUB2引导加载程序中发现了几个漏洞；这些漏洞可绕过UEFI安全引导机制并持续安装恶意软件。不幸的是，解决这个问题不只是获得一个新的GRUB2安装。重要的是要注意，更新可利用的二进制文件实际上并不能减轻CVE，因为攻击者可以将旧的、可利用的、签名的GRUB二进制文件副本带到具有他们想要加载的任何内核的系统上。为了进行缓解，必须在系统上更新UEFI吊销列表(Dbx)。一旦在系统上更新了UEFIRevocation列表，它将不再是早于这些修复的引导二进制文件。这包括旧的安装介质。[此消息在发布后略微扩展到2020-07-20的发行版列表。]大家好，GRUB2和Linux内核(详细信息如下)中都有几个CVE危及UEFI安全引导和内核锁定。*这些错误允许在配置为防止这种情况的硬件上引导和运行未签名的代码。*受影响的供应商将发布已修复、重新签名的填充程序、GRUB和内核，以允许系统在缓解后继续引导。具体发布内容的详细信息将因供应商而异。*实际的缓解措施是UEFI吊销列表更新，可防止加载可利用漏洞的二进制文件。此列表将很快从以下网址获得：https://uefi.org/revocationlistfile。供应商也可以将其包含在dbxtool包的更新版本中。*除了Microsoft Key Encryption Key(KEK)签名的UEFI撤销列表更新外，硬件供应商还可以发布他们自己的用自己的KEK签名的更新。同样，这将因供应商而异，利用这些缺陷需要很高级别的系统访问权限。例如，这些缺陷将允许恶意内核隐藏rootkit或类似程序，加载到启用了UEFI SecureBoot的系统上。重要的是要注意，更新可利用的二进制文件实际上并不能减轻CVE，因为攻击者可以将旧的、可利用的、签名的GRUB二进制文件副本带到他们想要加载的任何内核的系统上。为了进行缓解，必须在系统上更新UEFI吊销列表(Dbx)。一旦在系统上更新了UEFIRevocation列表，它将不再是早于这些修复的引导二进制文件。这包括旧的安装介质。要完全减轻系统对这些缺陷的影响，应该清楚地了解旧的内核和旧的安装介质将无法在安全引导系统上启动。CVE详细信息：有两个内核CVE已经公开：CVE-2019-20908和CVE-2020-15780。此外，还有以下GRUB2CVE：CVE-2020年-10713 8.2/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H这是原来的缺陷发现的Eclypimum，也被称为&#34；BootHole&#34；并在Eclypimum&#39；位于https://www.eclypsium.com/2020/07/29/theres-a-hole-in-the...CVE-2020-14308 6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H GRUB2：GRUB_MALLOC的论文未验证分配大小，从而导致算术溢出和后续基于堆的缓冲区溢出。CVE-2020-14309 5.7/cvss：3.1/AV：l/AC：H/PR：H/UI：H/S：U/C：N/I：H/A：H GRUB2：GRUB_CUASH_READ_SYMBLINK中的整数溢出可能会导致基于堆的溢出。CVE-2020-14310 5.7/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:H GRUB2：整数溢出READ_SECTION_FROM_STRING可能会导致基于堆的溢出。CVE-2020-14311 5.7/cvss：3。.1/AV：l/AC：H/PR：H/UI：N/S：U/C：N/I：H/A：H GRUB2：GRUB_EXT2_READ_LINK中的整数溢出导致基于堆的缓冲区溢出。CVE-2020-15705 GRUB：避免在没有填充6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:HCVE-2020-15706脚本的安全引导下直接启动GRUB时加载未签名的内核：在执行期间重新定义函数时，避免在释放后使用6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:HCVE-2020-15707 GRUB2：initrd大小处理中的整数溢出。5.7/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:Hjch。\n(登录以发表评论)", "note_en": "Several vulnerabilities have been disclosed in the GRUB2 bootloader; theyenable the circumvention of the UEFI secure boot mechanism and thepersistent installation of hostile software. Fixing the problem is not justa matter of getting a new GRUB2 installation, unfortunately.&#34; It is important to note that updating the exploitablebinaries does not in fact mitigate the CVE, since an attacker couldbring an old, exploitable, signed copy of a grub binary onto a systemwith whatever kernel they wished to load. In order to mitigate, theUEFI Revocation List (dbx) must be updated on a system. Once the UEFIRevocation List is updated on a system, it will no longer bootbinaries that pre-date these fixes. This includes old install media.&#34; [This message expands slightly on the post to the distros list on 2020-07-20.]Hello All,There are several CVEs both in GRUB2 and the Linux kernel (detailsbelow) that compromise UEFI Secure boot and kernel lockdown. * These bugs allow unsigned code to be booted and run on hardware configured to prevent that. * Affected vendors will be publishing fixed, re-signed shim, grub and kernels to allow systems to continue to boot post-mitigation. Details of exactly what is published will vary from vendor to vendor. * The actual mitigation is a UEFI Revocation List update that prevents exploitable binaries from loading. This list will be available from:  https://uefi.org/revocationlistfile soon. Vendors may also include this in an updated release of a dbxtool package. * In addition to the Microsoft Key Encryption Key (KEK)-signed UEFI Revocation List updates, hardware vendors may also issue their own updates signed with their own KEKs. Again, this will vary from vendor to vendor.Exploiting these flaws require a significant level of access to asystem. The flaws would allow, for example, a nefarious kernel to hidea rootkit or similar to be loaded onto a system that has UEFI SecureBoot enabled. It is important to note that updating the exploitablebinaries does not in fact mitigate the CVE, since an attacker couldbring an old, exploitable, signed copy of a grub binary onto a systemwith whatever kernel they wished to load. In order to mitigate, theUEFI Revocation List (dbx) must be updated on a system. Once the UEFIRevocation List is updated on a system, it will no longer bootbinaries that pre-date these fixes. This includes old install media.Fully mitigating a system against these flaws should be done with theclear understanding that old kernels and old install media will notboot on a secure-boot system.CVE details:There are two kernel CVEs that are already public: CVE-2019-20908 andCVE-2020-15780. In addition there are the following GRUB2 CVEs:CVE-2020-10713 8.2/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H This is the original flaw discovered by Eclypsium, also known as &#34;BootHole&#34; and is describe in Eclypsium&#39;s paper at  https://www.eclypsium.com/2020/07/29/theres-a-hole-in-the...CVE-2020-14308 6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H grub2: grub_malloc does not validate allocation size allowing for arithmetic overflow and subsequent heap-based buffer overflow.CVE-2020-14309 5.7/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:H grub2: Integer overflow in grub_squash_read_symlink may lead to heap based overflow.CVE-2020-14310 5.7/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:H grub2: Integer overflow read_section_from_string may lead to heap based overflow.CVE-2020-14311 5.7/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:H grub2: Integer overflow in grub_ext2_read_link leads to heap based buffer overflow.CVE-2020-15705 grub: avoid loading unsigned kernels when grub is booted directly under secureboot without shim 6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:HCVE-2020-15706 script: Avoid a use-after-free when redefining a function during execution 6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:HCVE-2020-15707 grub2: Integer overflow in initrd size handling. 5.7/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:Hjch\n   ( Log in to post comments)", "posttime": "2020-07-30 05:44:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,grub2,list,内核", "title": "一长串GRUB2安全引导漏洞", "title_en": "A long list of GRUB2 secure-boot holes", "transed": 1, "url": "https://lwn.net/Articles/827403/", "via": "", "real_tags": ["漏洞", "grub2", "list", "内核"]}, {"category": "", "categoryclass": "", "imagename": "b40f7153dd2470e535c6d4b5a1ac16c9.jpeg", "infoid": 1015046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊、苹果、Facebook和谷歌的首席执行官今天在美国国会就各自的市场主导地位举行听证会时作证。\n有一种跨党派的担忧是，这些公司在各自的市场上行使了太多的权力。\n长达一年的两党调查导致了今天的听证会，科技巨头的首席执行官将通过视频会议回答问题。\n由于它特别涉及谷歌，国会希望得到关于其在搜索、数字广告方面的主导地位的答案，并据称在这两个领域都有利于自己领先于竞争对手。\n在提交给美国众议院反垄断、商业和行政法小组委员会的一份声明中，谷歌首席执行官桑达尔·皮查伊(Sundar Pichai)对他的公司描绘了一幅积极的图景。\n“…。来自使用G教育套件在大流行期间保持联系的1.4亿学生和教师…。500万美国人通过使用谷歌…实现增长而获得数字技能。致所有向谷歌寻求帮助的人，从寻找回家最快的路线到在YouTube上学习如何烹调一道新菜。“。\n皮查伊的声明还包括谷歌作为就业创造者和研发投资者的影响。\n谷歌最受欢迎的产品和服务也是免费的，这一事实也被提到：\n“我们做出贡献的一种方式是开发有用的产品。研究发现，搜索、Gmail、地图和照片等免费服务每年为普通美国人带来数千美元的价值。\n皮查伊当然没有忘记提到Android智能手机的可负担性，这在苹果首席执行官蒂姆·库克参加的听证会上是恰如其分的。\n“像安卓这样的开放平台也支持别人的创新。使用Android，数以千计的移动运营商制造和销售他们自己的设备，而不向我们支付任何许可费。这让数十亿消费者买得起尖端的智能手机，有些手机的价格还不到50美元。“。\n在针对反垄断指控为自己的公司辩护时，你不会指望一位首席执行官会说出这句话。\n然而，在皮查伊的声明接近尾声时，发表了一句更出人意料的话。\n皮查伊在结束发言时谈到了谷歌的市场主导地位，以及谷歌未来是否会继续占据主导地位。\n“就像美国的技术领导地位不是不可避免的一样，谷歌的持续成功也不能保证。每天都有新的竞争对手出现，今天的用户获得信息的机会比以往任何时候都多。竞争驱使我们创新，也为每个人带来更好的产品、更低的价格和更多的选择。“。\n听到一家统治了十多年的公司的首席执行官听起来对自己的未来如此不确定，这让人感到惊讶。\n当然，没有迹象表明谷歌在可预见的未来仍将占据主导地位。\n皮查伊可能只是试图缓解人们对谷歌市场主导地位的担忧，他说，即使是他的公司也不是不受竞争对手的影响。\n尽管国会辩称，谷歌甚至在竞争对手有机会获得动力之前就创造了一个扼杀他们的环境。\n听证会的结果将表明皮查伊是否成功说服了他们。\n美国司法部向国会施压，要求其废除对谷歌、Facebook和亚马逊等在线平台的长期法律保护。\n这些公司目前对人们在其平台上发布的内容没有任何法律责任，美国司法部希望这种情况有所改变。\n归根结底，美国司法部希望这些公司被拆分，这样它们就不会那么强大了。但这不太可能发生。\n更有可能发生的是对现有的竞争政策和已有百年历史的反垄断法进行修改。\n国会听证会仍在进行中，这篇报道将在获得更多信息后进行更新。", "note_en": "CEOs of Amazon, Apple, Facebook, and Google testified before US Congress today during a hearing on the market dominance of each company.\n There is a concern across party lines that these companies wield too much power in their respective markets.\n A year-long bipartisan investigation has lead to today’s hearing, where the tech giants’ CEOs will answer questions via video conference.\n As it relates to Google specifically, Congress wants answers regarding its dominance in search, digital advertising, and allegedly favoring itself ahead of competitors in both areas.\n In a statement to the U.S. House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law – Google CEO Sundar Pichai paints a positive picture of his company.\n  “… from the 140 million students and teachers using G Suite for Education to stay connected during the pandemic… to the 5 million Americans gaining digital skills through Grow with Google… to all the people who turn to Google for help, from finding the fastest route home to learning how to cook a new dish on YouTube.”\n  Pichai‘s statement also includes points about Google’s impact as job creator and an investor in research &amp; development.\n The fact that Google’s most popular products and services are free is also mentioned:\n “One way we contribute is by building helpful products. Research found that free services like Search, Gmail, Maps, and Photos provide thousands of dollars a year in value to the average American.”\n Pichai certainly didn’t forget to bring up the affordability of Android smartphones, which is apropos in a hearing involving Apple CEO Tim Cook.\n “Open platforms like Android also support the innovation of others. Using Android, thousands of mobile operators build and sell their own devices, without paying any licensing fees to us. This has enabled billions of consumers to afford cutting-edge smartphones, some for less than $50.”\n That’s nothing you wouldn’t expect a CEO to say when defending their company against antitrust claims.\n However, a more unexpected remark was made toward the end of Pichai’s statement.\n   Pichai concludes his statement by addressing Google’s market dominance, and whether it will continue to remain dominant in the future,\n “Just as America’s technology leadership is not inevitable, Google’s continued success is not guaranteed. New competitors emerge every day, and today users have more access to information than ever before. Competition drives us to innovate, and it also leads to better products, lower prices and more choices for everyone.”\n It comes as a surprise to hear the CEO of a company that’s been dominant for over decade sound so uncertain about its future.\n There are certainly no indications that Google will remain anything but dominant for the foreseeable future.\n Pichai may have only been trying to ease concerns about Google’s market dominance in saying even his company is not impervious to competitors.\n Though Congress argues Google created an environment that stifles competitors before they even have a chance to gain momentum.\n  The outcome of the hearing will be an indication of whether Pichai managed to convince them otherwise.\n  Congress is being pressured by the US Department of Justice to repeal long-standing legal protections for online platforms like Google, Facebook, and Amazon.\n These companies are currently absolved of any legal responsibility for what people post on their platforms, and the DOJ wants that to change.\n Ultimately, what the DOJ wants is for these companies to be broken up so they’re not as powerful. But that’s not likely to happen.\n What’s more likely to happen is getting changes made to existing competition policies and century-old antitrust laws.\n The congressional hearing is still ongoing and this story will be updated with more information as it becomes available.", "posttime": "2020-07-30 05:43:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,竞争对手,pichai", "title": "谷歌的皮查伊：“每天都有新的竞争对手出现”", "title_en": "Google's Pichai: “New competitors emerge every day”", "transed": 1, "url": "https://www.searchenginejournal.com/google-ceo-testimony/376060/", "via": "", "real_tags": ["google", "谷歌", "竞争对手", "pichai"]}, {"category": "", "categoryclass": "", "imagename": "8e0d9d4875ac50ab7706eddff6d0a429.jpg", "infoid": 1015045, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "非营利组织和当地政客正在排队支持一项宪章通信请愿书，该请愿书将允许ISP对宽带用户设定数据上限，并向大型在线视频提供商寻求互联费用。\n查特上个月向联邦通信委员会(Federal Communications Commission)提交了请愿书，要求FCC提前两年取消适用于2016年收购时代华纳有线电视(Time Warner Cable)的合并条件。如果Charge的申请获得批准，该公司将能够在2021年5月18日之后(而不是按计划在2023年5月)对其频谱宽带服务设定数据上限，并向视频提供商收取网络互联费。\n随着FCC征求公众意见，议事日程上挤满了消费者，敦促欧盟委员会反对Charge要求允许限制消费者使用数据并收取数据超额费的请求。在这个互联网交流的时代，数据上限是一种肆无忌惮的从客户那里骗取钱财的方式，他们中的许多人都没有其他的互联网来源。这是不可接受的，一个人写道，在过去的几周里，数百名其他互联网用户给FCC写信，他们的情绪也得到了呼应。\n但在Spectrum互联网服务的愤怒用户中，有一些政客和慈善机构敦促FCC批准这份请愿书。查特向这些非营利组织和政客捐款，显然它做出了巨大的宣传努力，以获得他们对请愿书的公众支持。写给FCC的许多信都呼应了查特的观点，即它不应与其他不面临此类条件的互联网提供商区别对待--尽管查特愿意同意这些条件，以确保合并获得批准，使其成为仅次于康卡斯特(Comcast)的美国第二大互联网服务提供商。非营利组织和政界人士的信件忽略了数据上限将对宽带客户产生的负面影响。\n这些信件延续了一种长达一年的趋势，即互联网服务提供商一直在向慈善机构捐款，并在游说活动中得到他们的支持，以完成合并并取消消费者保护法规。\n查特上个月告诉ARS，它目前不打算设置数据上限或改变其互联互通政策。相反，它只是寻求一个公平的竞争环境，以便我们能够继续增长，并为全国各地的客户提供优质服务。但如果Charge无意设置数据上限或改变其互联互通政策，就没有理由带头开展涉及慈善机构和政界人士的大规模游说活动。\n查特的请愿书很可能在共和党占多数的联邦通信委员会(FCC)有很好的机会。FCC主席阿吉特·派(Ajit Pai)在2016年奥巴马提名的时任FCC主席汤姆·惠勒(Tom Wheeler)的领导下对这些条件投了反对票。联邦通信委员会的条款旨在防止查特阻碍在线视频提供商与该公司的有线电视服务竞争。任何提前两年取消合并条件的联邦通信委员会命令，都可能会援引支持查特案的各种文件中的论据。根据合并批准的原始条款，2021年5月18日是取消合并条件的最早日期。\n慈善机构和社区团体提交给FCC的文件讨论了Charge向他们提供的捐款。哈莱姆区的男孩女孩俱乐部告诉FCC，它今年收到了Charge的3.5万美元赠款，用于建立一个学习实验室，我们很高兴支持Charge，因为他们正在寻求两个合并条件-一个是关于数据上限和基于使用的定价，另一个是关于互联。\n位于加利福尼亚州卡诺加公园的西谷男孩女孩俱乐部告诉FCC，查特向俱乐部赠送了10台三星Galaxy平板电脑，只有这样才能为查特创造公平的竞争环境，这样他们才能有与类似公司一样的发展机会。在获得捐款后，支持查特的其他男孩女孩俱乐部分会包括科罗拉多州弗里蒙特县的分会、纽约州斯克内克塔迪分会--获得了7.5万美元的捐款；以及尼亚加尼亚的分会。\n美国退伍军人军团(US Veterans Corps)提交的一份支持查特请愿书的文件指出，ISP是我们“回家行动”(Operation Coming Home)计划的主要支持者，该计划为在战斗行动中受伤或阵亡的士兵家属提供新家。这个退伍军人组织表示，他们很高兴支持他们在联邦通信委员会(FCC)取消合并中的两项条件的努力。\n威斯康星州的马什菲尔德诊所健康系统告诉联邦通信委员会，宪章参与了筹款工作，并向诊所提供互联网服务。\n我们的大部分设施都依赖于单一的提供商来满足互联网和电信需求：Charge Communications。这就是为什么我今天写信来支持Charge最近的请愿书，要求其合并条件日落，卫生系统的首席对外事务官Ryan Natzke写道。纳茨克后来在同一封信中写道：我认为查特应该得到与其他提供商相同的待遇，我支持他们在市场上有一个公平的基础。\n纽约州锡拉丘兹和奥农达加县的基督教青年会告诉联邦通信委员会，他们从查特那里获得了2万美元，用于帮助我们的计算机实验室和暑期项目，我们支持他们向联邦通信委员会提出的取消合并条件的请求。\n查特的请愿书得到了全国有色人种协进会纽约奥尔巴尼分会的支持，该分会告诉FCC，它从查特那里获得了1万美元的赠款，以支持一个青年指导计划。该组织指出，新冠肺炎的大流行对那些没有家庭互联网接入的儿童来说尤其困难，并补充说，取消合并条件将允许[宪章]继续并加强他们在少数族裔和低收入社区弥合数字鸿沟的努力。\n其他在接受ISP捐款后支持查特请愿的社区团体包括怀俄明州纳特罗纳县儿童发展中心、加州拉丁裔领导力学院、纽约罗切斯特扫盲中心和圣路易斯拱门。\n现在让我们来看看支持查特的州议员。德克萨斯州共和党参议员布莱恩·休斯(Bryan Hughes)告诉联邦通信委员会(FCC)，查特是一个好的企业公民，需要与其他供应商处于公平的竞争环境中，才能继续在我们的社区投资。根据竞选资金追踪机构Vote Smart的数据，查特是休斯最大的捐赠者之一，在当前的选举周期中捐赠了12,500美元。\n纽约州共和党参议员理查德·芬克(Richard Funke)从查特那里获得了1.1万美元，他告诉联邦通信委员会(FCC)，查特没有试图扼杀在线视频发行商，我相信联邦通信委员会之前设定的条件可以在2021年5月正式取消。\n内布拉斯加州民主党参议员丹·奎克(Dan Quick)从查特公司获得了3500美元，他告诉联邦通信委员会，他完全支持查特公司有一个公平的竞争环境，这样它就可以像所有其他供应商一样运营，并继续为美国企业和家庭提供关键服务。\n怀俄明州共和党众议员丹·兹旺尼策敦促联邦通信委员会取消合并条件，这样像查特这样的优秀企业公民就可以继续在我这样的社区投资。兹旺尼策从查特那里获得了300美元。\n代表700多名议员的州议员全国黑人核心小组(National Black Caucus Of State Legators)表示，它很高兴支持剩下的两个合并条件的落日。写给联邦通信委员会的信中说，宪章通过多样化的招聘和规划支持了黑人社区，并投资了1000万美元，以支持服务不足社区的黑人和其他少数族裔拥有的小企业。这封信是由南卡罗来纳州民主党州众议员、核心小组主席吉尔达·科布-亨特(Gilda Cobb-Hunter)写的。该集团执行委员会的全部8名成员都是民主党人。\n其他接受查特捐款并支持请愿的州议员包括从查特那里获得200美元的怀俄明州共和党参议员阿菲·埃利斯(Affie Ellis)；从查特那里获得500美元的堪萨斯州共和党众议员威廉·萨顿(William Sutton)；以及从查特那里获得170美元的蒙大拿州共和党参议员迪·布朗(Dee Brown)。布朗告诉FCC，合并条件不再是必要的，因为有线电视和在线视频提供商之间有足够的竞争。\n包机客户并不是唯一反对取消合并条件的请愿书的人。这份请愿书遭到了美国西部作家协会(Writers Guild of America，West)的反对，该协会表示，查特在合并条件上有不诚实行为的历史，并指出查特没有遵守纽约州规定的宽带部署要求。在这种情况下，查特同意支付1200万美元用于新的宽带部署，这笔交易给了ISP额外一年的时间来遵守最初的要求。\n马萨诸塞州总检察长莫拉·希利(Maura Healey)告诉联邦通信委员会(FCC)，批准查特的请求将违背公众利益，因为大流行、宽带使用量的增加，以及查特作为几乎所有马萨诸塞州领土上唯一固定宽带提供商的地位。\n希利写道，如果不到一年后-马萨诸塞州居民很可能仍然依赖宽带来维持他们生活的方方面面-宪章对强制客户实施数据上限或定价模式，这将大幅提高普通家庭的宽带价格，这将有点不合常理。\n倡导团体“公众知识”(Public Knowledge)和体育迷联盟(Sports Fans Coalition)也反对查特的请愿。两家组织表示，联邦通信委员会在2016年的合并审查中发现，查特有动机和能力限制其客户访问竞争对手的视频服务，而查特没有提供任何证据表明这一点已经改变。查特有动机和能力限制客户访问他们选择的在线视频服务，如果他们通过歧视性地应用数据上限来这样做，并通过导致OVD[在线视频发行商]通过向他们收取访问费来提高他们的费率，&#就会向他们收取更高的费用。\n对宪章请愿书的第一轮公众意见已于7月22日截止，回复意见截止日期为8月6日。您可以点击“新归档”或“快递”将意见归档到议事日程上。\n披露：拥有Charge 13%股份的Advance/Newhouse伙伴关系是Advance Publications的一部分。Advance Publications拥有康泰纳仕(CondéNast)，康泰纳仕拥有Ars Technica。", "note_en": "Nonprofits and local politicians are lining up to support a Charter Communications petition that would let the ISP impose data caps on broadband users and seek interconnection payments from large online-video providers.\n Charter  filed the petition with the Federal Communications Commission last month, asking the FCC to eliminate merger conditions applied to its 2016 purchase of Time Warner Cable two years early. If Charter&#39;s petition is granted, the company would be able to impose data caps on its Spectrum broadband service and charge network-interconnection fees to video providers after May 18, 2021, instead of in May 2023 as scheduled.\n With the FCC seeking public comment, the  docket is overwhelmingly filled with consumers urging the commission to oppose Charter&#39;s request for permission to limit consumers&#39; data usage and charge data-overage fees. &#34;In this age of Internet communication, data caps are an unscrupulous way to gouge money from clients, many of whom do not have alternative Internet sources. This is unacceptable,&#34; one person wrote in a sentiment echoed by hundreds of other Internet users who wrote to the FCC in the past few weeks.\n But among the angry users of Spectrum Internet service are a number of politicians and charities urging the FCC to grant the petition. Charter has donated to these nonprofits and politicians, and it has apparently made a big outreach effort to get their public support for the petition. Many of the letters to the FCC echo Charter&#39;s argument that it shouldn&#39;t be treated differently from other Internet providers that don&#39;t face such conditions—even though Charter willingly agreed to them in order to secure approval for a merger that made it the second-largest ISP in the United States after Comcast. The letters from nonprofits and politicians ignore the negative impact data caps would have on broadband customers.\n The letters continue a years-long trend in which ISPs have been  donating to charities and receiving their support in lobbying campaigns to complete mergers and  eliminate consumer-protection regulations.\n Charter told Ars last month that it doesn&#39;t &#34;currently&#34; plan to impose data caps or change its interconnection policy. Instead, it merely seeks &#34;a level playing field so that we can continue to grow and provide superior service to our customers across the country.&#34; But if Charter had zero intention of imposing data caps or changing its interconnection policies, there would be no reason to spearhead a big lobbying effort involving charities and politicians.\n Charter&#39;s petition likely has a good chance at the Republican-majority FCC. FCC Chairman Ajit Pai voted against the conditions when they were  imposed in 2016 under then-FCC Chairman Tom Wheeler, an Obama nominee. The FCC conditions were designed to prevent Charter from hindering online video providers that compete against the company&#39;s cable TV service. Any FCC order that lifts the merger conditions two years early would likely cite arguments from the various filings supporting Charter&#39;s case. May 18, 2021, is the earliest date on which the conditions can be eliminated under the original terms of the merger approval.\n  FCC filings submitted by charities and community groups discuss the donations Charter gave them. The Boys &amp; Girls Club of Harlem  told the FCC it received a $35,000 grant from Charter this year for a learning lab and that &#34;we are happy to support Charter as they seek to sunset two merger conditions—one on data caps and usage-based pricing and the other on interconnection.&#34;\n The Boys &amp; Girls Club of the West Valley in Canoga Park, California,  told the FCC that Charter gave 10 Samsung Galaxy tablets to the club and that &#34;it only seems fair to level the playing field for Charter so they can have the same opportunities to grow as companies similar to them.&#34; Other Boys &amp; Girls Club chapters supporting Charter after getting donations include ones in  Fremont County, Colorado;  Schenectady, New York—which received a $75,000 donation; and  Niagara Falls in New York.\n A US Veterans Corps  filing in support of Charter&#39;s petition notes that the ISP &#34;is a major supporter of our Operation Coming Home initiative, which provides new homes to troops who have been injured or families of fallen in combat operations.&#34; The veterans group said it is &#34;happy to endorse their effort at the Federal Communications Commission (FCC) to remove two conditions from the merger.&#34;\n The Marshfield Clinic Health System in Wisconsin  told the FCC of Charter&#39;s involvement in fundraising efforts and its provision of Internet service to clinics.\n &#34;Most of our facilities rely on a single provider for Internet and telecommunications needs: Charter Communications. That is why I am writing today to support Charter&#39;s recent petition to have its merger conditions sunset,&#34; the health system&#39;s Chief External Affairs Officer Ryan Natzke wrote. &#34;I believe Charter should receive the same treatment as other providers, and I support a fair foundation for them in the marketplace,&#34; Natzke wrote later in the same letter.\n  The YWCA of Syracuse and Onondaga County in New York  told the FCC that it got $20,000 from Charter &#34;to help with our computer lab and summer program&#34; and that &#34;we support their request to the FCC to sunset their merger conditions.&#34;\n Charter&#39;s petition got support from the Albany, New York, branch of the NAACP, which  told the FCC that it received a $10,000 grant from Charter to support a youth mentoring program. The group noted that the COVID-19 pandemic has been especially difficult on children who lack home-Internet access, adding that eliminating the merger conditions &#34;will allow [Charter] to continue and enhance their efforts to bridge the digital divide in minority and low-income communities.&#34;\n Other community groups that supported Charter&#39;s petition after receiving donations from the ISP include the  Child Development Center of Natrona County in Wyoming; the  California Latino Leadership Institute;  Literacy Rochester in New York; and  St. Louis Arc.\n   Now let&#39;s take a look at state lawmakers who support Charter. Bryan Hughes, a Republican state senator in Texas,  told the FCC that &#34;Charter is a good corporate citizen&#34; and &#34;need[s] to be on a level playing field with their fellow providers&#34; in order to continue &#34;invest[ing] in our communities.&#34; Charter is one of Hughes&#39; top donors, having given $12,500 in the current election cycle,  according to campaign-finance tracker Vote Smart.\n State Sen. Richard Funke, a Republican in New York who  received $11,000 from Charter,  told the FCC that there has been &#34;no effort by Charter to stifle online video distributors&#34; and that &#34;I am confident that the previous conditions laid out by the FCC can officially be rolled back in May of 2021.&#34;\n State Sen. Dan Quick, a Nebraska Democrat who  got $3,500 from Charter, told the FCC that he &#34; fully support[s] a level playing field for Charter so it can operate the same as all other providers and continue to deliver critical services to American businesses and families.&#34;\n State Rep. Dan Zwonitzer, a Republican in Wyoming,  urged the FCC to eliminate the merger conditions &#34;so good corporate citizens like Charter can continue investing in communities like mine.&#34; Zwonitzer  received $300 from Charter.\n The National Black Caucus of State Legislators, which represents more than 700 legislators,  said it &#34;is pleased to support the sunset of the two remaining merger conditions.&#34; Charter has supported Black communities with diverse hiring and programming as well as &#34;a $10 million investment to support Black and other minority-owned small businesses in underserved communities,&#34; the letter to the FCC said. The letter was written by Caucus President Gilda Cobb-Hunter, a Democratic state representative in South Carolina. All eight members of the group&#39;s  executive committee are Democrats.\n Other state lawmakers who received donations from Charter and supported the petition include  State Sen. Affie Ellis, a Wyoming Republican who  received $200 from Charter;  State Rep. William Sutton, a Kansas Republican who  received $500 from Charter; and State Sen. Dee Brown, a Republican in Montana who  received $170 from Charter. Brown  told the FCC that the merger conditions &#34;are no longer necessary&#34; because &#34;there is sufficient competition&#34; between cable TV and online video providers.\n  Charter customers are not the only ones opposing the petition to eliminate merger conditions. The petition received opposition from the  Writers Guild of America, West, which said that &#34;Charter has a history of bad-faith behavior regarding merger conditions&#34; and pointed to Charter&#39;s failure to comply with broadband-deployment requirements imposed by New York State. In that case, Charter  agreed to pay $12 million toward new broadband deployments in a deal that gave the ISP an extra year to comply with the original requirements.\n  Massachusetts Attorney General Maura Healey  told the FCC that granting Charter&#39;s request would go against the public interest because of the pandemic, increasing use of broadband, and &#34;Charter&#39;s position as the sole fixed-broadband provider in almost all of its Massachusetts territories.&#34;\n &#34;It would be somewhat perverse if less than a year from now—when Massachusetts residents may very well still be relying on broadband to maintain all aspects of their lives—Charter imposes data caps or pricing models on captive customers that dramatically increase the price of broadband for the average household,&#34; Healey wrote.\n Advocacy groups Public Knowledge and the Sports Fans Coalition  opposed Charter&#39;s petition as well. The FCC found during the 2016 merger review that Charter had &#34;incentive and ability to restrict its customers&#39; ability to access competing video services,&#34; and Charter has provided no evidence that this has changed, the groups said. &#34;Charter has the incentive and ability to restrict its customers from accessing the online video services of their choice, charging them more if they do so through the discriminatory application of data caps, and through causing OVDs [online video distributors] to raise their rates to consumers by charging them access fees,&#34; the groups said.\n The first round of public comments on Charter&#39;s petition expired on July 22, and reply comments are due by August 6. Comments can be filed on the  docket by clicking &#34;New Filing&#34; or &#34;Express.&#34;\n Disclosure: The Advance/Newhouse Partnership, which owns 13 percent of Charter, is part of Advance Publications. Advance Publications owns Condé Nast, which owns Ars Technica.", "posttime": "2020-07-30 05:20:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "立法者,donations,支持", "title": "查特对慈善机构和立法者的捐款可能有助于它设定数据上限", "title_en": "Charter’s donations to charities and lawmakers may help it impose data caps", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/charters-donations-to-charities-and-lawmakers-may-help-it-impose-data-caps/", "via": "", "real_tags": ["立法者", "donations", "支持"]}, {"category": "", "categoryclass": "", "imagename": "8e27017d1e2da8c8a0b996bc0303cebc.jpg", "infoid": 1015044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在收购Instagram的六周前，马克·扎克伯格在2012年的一封电子邮件中写道，他收购Instagram的动机之一是中和潜在的竞争对手。这些电子邮件是在今天众议院反垄断委员会的听证会上披露的，听证会的成员包括四位科技大亨：蒂姆·库克、桑达尔·皮查伊、杰夫·贝佐斯和扎克伯格。这些电子邮件最先由The Verge报道。\nFacebook在2012年是互联网上最大的社交网络之一，但它的主导地位当时并不像今天这样稳固。有很多竞争对手的社交网络，扎克伯格担心他的公司会因为转向智能手机而措手不及。\n2012年2月27日晚，扎克伯格给首席财务官大卫·埃伯斯曼发了一封电子邮件，谈到收购Instagram和Path等移动应用公司的可能性，这些公司正在建设与我们自己竞争的网络。他担心，如果它们大规模增长，可能会给我们带来非常大的颠覆性影响。\n在第二天早上的回复中，埃伯斯曼鼓励扎克伯格确保他有很好的理由进行收购。他提出了三个达成交易的可能原因：1)打倒潜在竞争对手，2)获取人才，3)将他们的产品与我们的产品整合，以改善我们的服务。埃伯斯曼辩称，第一个原因是一个糟糕的原因，因为很快就会涌现出其他人来取代他们。\n扎克伯格在20分钟内做出了回复。它是(1)和(3)的结合体，他写道。然后他说出了他的想法：\n这里有一件事可能使(1)更合理，那就是围绕着社交产品和有限数量的不同社会机制来发明网络效应。一旦有人在某个特定的技工上获胜，其他人就很难在不做一些不同的事情的情况下取代他们。有可能有人击败了Instagram，因为他们开发了一些更好的东西，以至于他们可以进行网络迁移，但只要Instagram继续作为一种产品运行，就很难做到这一点。(3)也是一个因素，但实际上，我们已经了解了这些公司的社会动态，并将在未来12-24个月内整合它们。\n扎克伯格补充说，另一种看待收购战略的方式是，将其视为一种购买时间的方式。他认为，即使一些新的竞争对手如雨后春笋般涌现，现在收购Instagram、Path、Foursquare等公司将给我们一年或更长时间来整合它们的动态，才能让任何人再次达到他们的规模。扎克伯格预测，一旦Facebook复制了它们的社交机制，新产品就不会获得那么大的吸引力。\n显然，扎克伯格很快就意识到，如果这封电子邮件最终公之于众，可能会变得多么糟糕。不到一小时后，他又给埃伯斯曼发了一封电子邮件。\n扎克写道：我并不是说我们会购买它们，以防止它们以任何方式与我们竞争。购买它们会让我们有足够的人才和时间将他们的创新融入到我们的核心产品中，这就是我们进行整合的方式，而不是实际结合产品的方式。最让我兴奋的是，如果我们努力将这些公司发明的东西打造成更多人的体验，它们能一起做些什么。\n在4月份的一封电子邮件中，扎克伯格写道，Instagram可以在不成为大企业的情况下对我们造成有意义的伤害。\n几天后，Facebook以10亿美元的交易收购了Instagram。在收购当天的一封电子邮件中，扎克伯格和Facebook的一名工程师讨论了Instagram和Google+(谷歌的社交网络)的相对重要性。\n扎克伯格写道，我记得你的内部帖子说Instagram是我们的威胁，而不是Google+。你基本上是对的。不过，初创企业的一件事是，你经常可以收购它们。\n这笔交易顺利通过了联邦贸易委员会(Federal Trade Commission)的审查。Instagram是一家只有13名员工的小公司；监管机构可能并不清楚它是否会成长为互联网最大的社交网络之一。\n现在，这笔交易正受到更多的审查。众议院民主党人在周三的听证会上强调了这些电子邮件，因为他们就这笔交易盘问了扎克伯格。\n扎克伯格在听证会上说，我已经很清楚，Instagram是移动照片分享领域的竞争对手。当时还有很多其他人。他们与VSCO Cam和PicPlz等应用程序以及Path等公司展开竞争。它是我们存在的整个连接空间的一个子集。", "note_en": "In a 2012 email six weeks before acquiring Instagram, Mark Zuckerberg wrote that one of his motivations for the acquisition was to &#34;neutralize a potential competitor.&#34; The emails were revealed during today&#39;s hearing before the House antitrust committee featuring four technology moguls: Tim Cook, Sundar Pichai, Jeff Bezos, and Zuckerberg. The emails were first  reported by the Verge.\n Facebook was one of the Internet&#39;s biggest social networks in 2012, but its dominant position was not as secure then as it is today. There were a lot of rival social networks, and Zuckerberg worried his company would get caught flat-footed by the shift to smartphones.\n  On the evening of February 27, 2012, Zuckerberg emailed chief financial officer David Ebersman about the possibility of acquiring &#34;mobile app companies like Instagram and Path that are building networks that are competitive with our own.&#34; He worried that &#34;if they grow to a large scale they could be very disruptive to us.&#34;\n  In a reply the next morning, Ebersman encouraged Zuckerberg to make sure he had a good reason for making an acquisition. He suggested three possible reasons to do a deal: &#34;1) neutralize a potential competitor,&#34; &#34;2) acquire talent,&#34; and &#34;3) integrate their products with ours in order to improve our service.&#34; Ebersman argued that the first reason was a &#34;bad reason&#34; because &#34;someone else will spring up immediately in their place.&#34;\n Zuckerberg replied within 20 minutes. &#34;It&#39;s a combination of (1) and (3),&#34; he wrote. Then he spelled out his thinking:\n One thing that may make (1) more reasonable here is that there are network effects around social products and a finite number of different social mechanics to invent. Once someone wins at a specific mechanic, it&#39;s difficult for others to supplant them without doing something different. It&#39;s possible someone beats Instagram by building something that is better to the point that they get network migration, but this is harder as long as Instagram keeps running as a product. (3) is also a factor but in reality we already know these companies&#39; social dynamics and will integrate them over the next 12-24 months anyway.\n Zuckerberg added that another way to look at the acquisition strategy is as a way of &#34;buying time.&#34; &#34;Even if some new competitors springs up, buying Instagram, Path, Foursquare, etc. now will give us a year or more to integrate their dynamics before anyone can get to their scale again,&#34; he argued. New products &#34;won&#39;t get as much traction&#34; once Facebook has replicated their social mechanics, Zuckerberg predicted.\n Evidently, Zuckerberg soon realized how bad this email could look if it eventually became public. Less than an hour later, he sent Ebersman another email.\n &#34;I didn&#39;t mean to imply that we&#39;d be buying them to prevent them from competing with us in any way,&#34; Zuck wrote. &#34;Buying them would give us the people and time to incorporate their innovations into our core products, which is how we&#39;d do the integration rather than actually combining the products. I&#39;m mostly excited about what the companies could do together if we worked to build what they&#39;ve invented into more people&#39;s experiences.&#34;\n  In an April email, Zuckerberg wrote that &#34;Instagram can hurt us meaningfully without becoming a huge business.&#34;\n Days later,  Facebook bought Instagram in a deal worth $1 billion. In an email exchange the day of the acquisition, Zuckerberg and a Facebook engineer discussed the relative importance of Instagram and Google+, Google&#39;s social network.\n &#34;I remember your internal post about how Instagram was our threat and not Google+,&#34; Zuckerberg wrote. &#34;You were basically right. One thing about startups though is you can often acquire them.&#34;\n The deal sailed through a review from the Federal Trade Commission. Instagram was a small company with just 13 employees; it probably wasn&#39;t obvious to regulators that it would grow to become one of the Internet&#39;s largest social networks.\n Now the deal is getting more scrutiny. House Democrats highlighted the emails during Wednesday&#39;s hearing as they grilled Zuckerberg about the transaction.\n &#34;I&#39;ve been clear that Instagram was a competitor in the space of mobile photo sharing,&#34; Zuckerberg said during the hearing. &#34;There were a lot of others at the time. They competed with apps like VSCO Cam and PicPlz and companies like Path. It was a subset of the overall space of connecting that we exist in.&#34;", "posttime": "2020-07-30 05:20:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,instagram,email", "title": "扎克电子邮件：Instagram交易可能会“抵消潜在竞争对手”", "title_en": "Zuck email: Instagram deal could “neutralize a potential competitor”", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/zuck-email-instagram-deal-could-neutralize-a-potential-competitor/", "via": "", "real_tags": ["交易", "instagram", "email"]}, {"category": "", "categoryclass": "", "imagename": "23e136cc4f412a01200b34f2627a6351.jpeg", "infoid": 1015043, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "贾亚帕尔的审讯是听证会上为数不多的实质性交流之一，听证会上充斥着令人厌倦的哗众取宠和不知情或不相干的问题。\n多年来，亚马逊一直受到有理有据的指控，称其利用其在在线零售领域的鸟瞰地位(其中大部分通过其平台)来发现新产品和类别，并利用这些内幕信息进入这些产品和类别-往往会承担巨额损失，以削弱市场上现有的参与者。\n贾亚帕尔代表公司总部所在的地区，曾多次与公司正面交锋。他一开始就直截了当地问亚马逊是否这样做(为清晰起见，问答的措辞只做了轻微的编辑)：\nJayapal：亚马逊在做出商业决策时是否有权访问和使用第三方卖家数据？\n贝佐斯：我不能回答这个问题是或不是。我可以告诉你，我们有一项政策，禁止使用特定于卖家的数据来帮助我们的自有品牌业务，但我不能向你保证，这项政策从未被违反过。\n作为回应，贾亚帕尔引用了《华尔街日报》最近的一篇报道，列举了亚马逊这样做的多个例子：\n贾亚帕尔：你可能知道，《华尔街日报》(The Wall Street Journal)2020年4月的一篇报道显示，贵公司确实会通过审查受欢迎的单个产品和卖家的数据，以及创建允许贵公司明确获取所谓聚合类别中详细卖家信息的小类别，来获取第三方卖家的数据。你否认这份报告吗？\n贝佐斯：我对你说的“华尔街日报”那篇文章很熟悉。我们继续非常仔细地调查这件事，我还不满意我们已经弄清了真相。做这件事并不像你想象的那么容易，因为文章中的一些消息来源是匿名的。\n她的下一步行动是一名前雇员的一句咒骂，贝佐斯似乎无从反驳。\nJayapal：一名前亚马逊员工和第三方销售人员告诉这个委员会，引用他的话说，“有一条规则，但没有人强制执行或抽查。他们只是说不要随便拿数据。这是一家糖果店，每个人都可以买到他们想要的任何东西。“。类别经理是否有权访问有关第三方产品和业务的非公开数据？\n贝佐斯：嗯，我能告诉你的是。我们确实有一定的保障措施。我们培训人们了解这项政策，我们希望人们像对待其他任何人一样遵守这项政策。这是一项自愿政策[因为拥有这样一项政策是自愿的，并不是说遵守这项政策是自愿的，他澄清道]。如果我们发现有人违反了它，我们会对他们采取行动。\n贾亚帕尔：嗯，有很多报告，委员会已经对前雇员进行了采访，证实确实有员工可以接触到这些数据，并正在使用这些数据。如果你认为你实际上是在执行这些规则，你认为这会奏效吗？有可靠的报告记录了你实施的违反这些规定的行为，该委员会采访了员工，他们表示这些违规行为通常会发生。\n在确认了根据亚马逊的政策，“聚合”数据可能只存在于单个卖家身上之后，她开始长篇大论地阐述为什么这显然是一个严重的竞争问题：\n贾亚帕尔：对前员工的采访清楚地表明，聚合数据基本上允许访问这些产品类别的高度详细的数据-以Fortem为例，这是一家没有直接竞争对手的小企业，除了亚马逊仓库交易(Amazon Warehouse Deals)之外，它是一个转售清仓账户，只售出了17台。亚马逊的一名员工查阅了Fortem产品的详细销售报告，其中包括该公司每台广告花费了多少钱，以及每个后备箱的运输成本。然后亚马逊在2019年10月推出了自己的竞争产品。这是一个很大的漏洞。我要非常清楚地回顾一下总法律顾问对委员会的声明，即亚马逊不能访问这些数据，也不会将这些数据用于自己的利益。我现在听到你说，你不太确定这是怎么回事。\n…。您可以访问卖家的全部定价和库存信息，包括过去、现在和将来，并且您可以在您的平台上指定第三方卖家的参与。因此，你可以为你的竞争对手制定游戏规则，而不是自己实际遵守这些规则。你认为这对试图在你的平台上销售的夫妻店第三方巴士公平吗？\n贝佐斯：我很欣赏这个问题，我非常喜欢这个问题，因为我真的很想有机会回答这个问题。我为我们在…这个平台上为第三方卖家所做的一切感到非常自豪\n贾亚帕尔感觉到贝佐斯在喋喋不休和/或在拖延时间，于是打断了他，表达了她的最后一点：\nJayapal：所以你可能会允许第三方卖家进入你的平台，但如果你一直在监控数据，以确保他们永远不会变得足够大，以至于他们无法与你竞争，这实际上是委员会所担心的。这个委员会的整个工作目标是确保有更多的亚马逊、更多的苹果、更多的创新公司和蓬勃发展的小企业。这就是我们需要监管这些市场的原因，这样就没有一家公司的平台如此主导，以至于它本质上是一种垄断。\n众议员贾亚帕尔的问题似乎揭开了贝佐斯赛季的序幕。众议员玛丽·斯坎隆(D-PA)很快强调，亚马逊愿意损失数亿美元来击败竞争对手Dipers.com：\nScanlon：针对Dipers.com的价格战奏效了，几个月内它就陷入了困境，所以亚马逊买下了它。在收购了你在这里的主要竞争对手后，亚马逊削减了亚马逊(Amazon.Mom)等促销活动，以及它用来吸引顾客离开Dipers.com的大幅折扣，然后提高了新妈妈和新爸爸的尿布价格。贝佐斯先生，在亚马逊淘汰竞争对手之后，你是否亲自签署了提价计划？\n贝佐斯：我一点都不记得了。我记得的是我们与竞争对手的价格相当，我相信我们关注的是dipers.com。这是11年前的事了，所以你对我的记忆要求很高。\n然后，主席，众议员大卫·西西林(D-RI)抓住机会，就众议员贾亚帕尔的一系列问题得到了一些更直接的回答。\nCicilline：亚马逊在其平台上生产和销售与第三方卖家直接竞争的产品，特别是当你亚马逊制定游戏规则的时候，这不是一种固有的利益冲突吗？\n贝佐斯：谢谢你，…。不，我不相信是这样的。我们有…。消费者最终决定购买什么，以什么价格购买，从谁那里购买。\n西西琳：这不是问题所在，贝佐斯先生。问题是，是否存在固有的利益冲突。…。你说你不能保证不与亚马逊自己的产品线共享第三方卖家数据的政策没有被违反，你不能确定。你能给我解释一下吗？你能列举违反该政策的例子吗？难道第三方不应该肯定地知道数据没有与您自己的竞争对手共享吗？\n贝佐斯：我们认为需要了解的是，我们有一项政策，禁止使用个人卖家数据与我们的自有品牌产品竞争。\n西西琳：你不能向贾亚帕尔女士保证这项政策不会经常被违反！\n贝佐斯：嗯，我是说，我们正在调查这件事。我不想超越我现在所知道的，但我们是华尔街日报那篇文章的结果，我们正在非常仔细地研究这一点。\n委员会对谷歌(Google)的桑达尔·皮查伊(Sundar Pichai)、Facebook的马克·扎克伯格(Mark Zuckerberg)和苹果(Apple)的蒂姆·库克(Tim Cook)的质询远未达到这个水平，但亚马逊的部分是有效的-即使只是看到世界上最富有、最有权势的人之一对他的话支支吾吾，无法或不愿回答基本问题。贝佐斯在这些听证会上几乎没有经验，这表明-毫无疑问，这对他来说就像对国会一样有信息量。", "note_en": "Jayapal’s interrogation was one of precious few substantive exchanges in a hearing dominated by tiresome grandstanding and uninformed or irrelevant lines of questions.\n Amazon has been dogged for years with well-substantiated allegations that it uses its bird’s-eye position in online retail, much of which passes through its platform, to spot new products and categories and enter them using that inside information — often taking huge losses to undercut the existing players in the market.\n Jayapal — who represents the district in which the company is headquartered and has gone head to head with the company numerous times — began by asking straight out whether Amazon does this (Wording of questions and answers has only been slightly edited for clarity.):\n Jayapal: Does Amazon have access and use third party seller data when making business decisions?\n Bezos: I can’t answer that question yes or no. I can tell you we have a policy against using seller-specific data to aid our private label business but I can’t guarantee you that that policy has never been violated.\n In response, Jayapal cited a  recent WSJ report citing multiple instances where Amazon had done just that:\n Jayapal: You’re probably aware that an April 2020 report in the Wall Street Journal revealed that your company does access data on third party sellers both by reviewing data on popular individual products and sellers and making tiny categories that allowed your company to categorically access detailed seller information in a supposedly aggregate category do you deny that report?\n Bezos: I’m familiar with the Wall Street Journal article you’re talking about. We continue to look into that very carefully, I’m not yet satisfied we’ve gotten to the bottom of it. It’s not as easy to do it as you think because some of the sources in the article are anonymous.\n Her next move was a damning quote from a former employee that Bezos seemed at a loss to counter.\n Jayapal: A former Amazon employee and third party sales an recruitment told this committee, quote, “there’s a rule but there’s nobody enforcing or spot checking. They just say don’t help yourself to the data. It’s a candy shop, everyone can have access to anything they want.” Do category managers have access to non public data about third party products and businesses?\n Bezos: Uh, here’s what I can tell you. We do have certain safeguards in place. we train people on the policy, we expect people to follow that policy the same we would with any others. It’s a voluntary policy [in that having such a policy is voluntary, not that it is voluntary to follow that policy, he clarified]. If we found that someone violated it, we would take action against them.\n Jayapal: Well, there’s numerous reports and the committee has conducted interviews with former employees that confirm that there are employees that do have access to that data and are using it. If you thought you were actually enforcing these rules, do you think that that’s working? There’s credible reporting that has documented breaches of these rules you’ve put into place, and this committee has interviewed employees that say that these breaches typically occur.\n  After confirming that “aggregate” data could be on as little as a single seller under Amazon’s policy, she then began a lengthy presentation of why this was obviously a serious concern for competition:\n Jayapal: Interviews with former employees have made it clear that that aggregate data essentially allows access to highly detailed data in those product categories – there’s the example of Fortem, a small business that had no direct competitors, except for Amazon Warehouse Deals, a resale clearance account that only sold 17 units. An Amazon employee accessed a detailed sales report on Fortem’s product with information on how much the company spent on advertising per unit and the cost to ship each trunk. And then Amazon launched its own competing products in October 2019. That’s a major loophole. And I go back to the general counsel’s statement to this committee very clearly that there was no access to this data, that Amazon does not use that data for its own benefit. And I’m now hearing you say, well you’re not so sure that’s going on.\n …You have access to the entirety of sellers pricing and inventory information, past, present and future, and you dictate the participation of third party sellers on your platform. So you can set the rules of the game for your competitors but not actually follow those rules yourself. Do you think that’s fair to the mom and pop third party bus that are trying to sell on your platform?\n Bezos: I appreciate that question and I like it a lot, because I really wanted a chance to address that. I’m very proud of what we’ve done for third party sellers on this platform…\n Sensing Bezos was bloviating and/or playing for time, Jayapal cut him off to make her final point:\n Jayapal: So you might allow third party sellers onto your platform, but if you’re continuously monitoring the data to make sure that they’re never gonna get big enough that they can compete with you, that is actually the concern that the committee has. The whole goal of this committee’s work is to make sure there are more Amazons, more Apples, more companies that get to innovate and small businesses that get to thrive. That is why we need to regulate these marketplaces, so that no company has a platform so dominant that it is essentially a monopoly.\n Rep. Jayapal’s questions seemed to open the season on Bezos. Representative Mary Scanlon (D-PA) soon highlighted Amazon’s willingness to lose hundreds of millions of dollars to kneecap the competing Diapers.com:\n Scanlon: The price war against Diapers.com worked, and within a few months it was struggling, and so Amazon bought it. After buying your leading competitor here, Amazon cut promotions like Amazon.mom and the steep discounts it used to lure customers away from Diapers.com, and then increase the prices of diapers for new moms and dads. Mr. Bezos, did you personally sign off on the plan to raise prices after Amazon eliminated its competition?\n Bezos: I don’t remember that at all.  What I remember is that we matched competitors’ prices and I believe we followed diapers.com. This was 11 years ago so you’re asking a lot of my memory.\n Then the Chairman, Rep. David Ciccilline (D-RI), took the opportunity to get some more direct answers on Rep. Jayapal’s line of questions.\n  Cicilline: Isn’t it an inherent conflict of interest for Amazon to produce and sell products on its platform that compete directly with third party sellers, particularly when you, Amazon, set the rules of the game?\n Bezos: Thank you… no, I don’t believe it is. We have… the consumer is ultimately the one making the decisions about what to buy, what price to buy it at, who to buy it from.\n Cicilline: That’s not the question, Mr. Bezos. The question is is there an inherent conflict of interest. …You said you can’t guarantee that the policy of not sharing third party sellers data with Amazon’s own line hasn’t been violated, you can’t be certain. Can you please explain that to me? Can you list examples of when that policy has been violated? Shouldn’t third parties know for sure that data isn’t being shared with your own line of competitors?\n Bezos: What think is important to understand is we have a policy against using the individual seller data to compete with our private label products.\n Cicilline: You couldn’t assure Ms. Jayapal that that policy isn’t violated routinely!\n Bezos: Well, I mean, we are investigating that. I do not want to go beyond what I know right now, but we are as a result of that Wall Street Journal article, we are looking at that very carefully.\n The Committee’s questioning of Google’s Sundar Pichai, Facebook’s Mark Zuckerberg, and Apple’s Tim Cook was nowhere near this level, but the Amazon portions were effective — if only to see one of the world’s richest and most powerful people stumbling over his words, unable or unwilling to answer basic questions. Bezos has little experience with these hearings and it showed — no doubt this has been as informative for him as it has been for Congress.", "posttime": "2020-07-30 05:19:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "贝佐斯,不能,guarantee,数据", "title": "\n贝佐斯不能保证不会有反竞争活动，因为国会抓住了他的措手不及", "title_en": "\n\t\t\t\tBezos ‘can’t guarantee’ no anti-competitive activity as Congress catches him flat-footed\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/29/bezos-cant-guarantee-no-anti-competitive-activity-as-congress-catches-him-flat-footed/", "via": "", "real_tags": ["贝佐斯", "不能", "guarantee", "数据"]}, {"category": "", "categoryclass": "", "imagename": "b81ebe8d3aa8a9b7e3fd28683ec8e175.png", "infoid": 1015041, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "68k纳米硬件简单明了。它可以构建在板外(尽管在更高的时钟速度下可能会有稳定性问题)。\n由于最小的地址解码电路，访问某些存储器区域将导致选择多个设备。这是应该避免的。\n$000000-0xFFFF只读存储器(重复16次)$100000-1FFFFF X禁止(多个设备选择)$200000-2FFFFF只读存储器($000000-0FFFFF的镜像)$300000-$7FFFF X禁止(多个设备选择)$800000-8FFFF开放式总线(可扩展)$900000-9xxxF紧凑型闪存卡$A00000-AxxxxF UART$B00000-BFFFFF。\n16550的调制解调器控制线用作位Bang-banged SPI接口。为SparkFun；S&34；DeadOn&34；DS3234实时时钟板提供了7针插头。因此，通过16550的调制解调器控制寄存器和线路状态寄存器可以实现对串行总线的访问。\n为存储设备提供了一个间距为2 mm的44针IDE连接器。这适用于CompactFlash卡适配器(在16位True IDE模式下运行)，但也可用于并行ATA硬盘。(未测试)。\n所有中断源都通过16550路由。所有16550个中断都调用1级自动矢量(矢量偏移量$064)，并由软件确定中断源。\nBom.txt包含一个物料清单。在撰写本文时(2020年7月)，所有组件均可从Mouserand Jameco等主要分销商处获得。如果从eBay购买6800，请注意老式IC是盗版的常见目标。为了这个项目，我使用了Jameco的东芝TMP68HC000P-12芯片，它们工作得很好。\n所有部件都是通孔，给人一种额外的复古感觉。请注意，一些去耦电容器(C4、C5、C6、C8和C10)位于IC下方，因此需要开放框架IC插座。大型IC插座也可能很贵(尤其是DIP-64插座！)。因此，更便宜的替代方案是使用分离式SIP0.1&34；机器插头。\n由于芯片的间距，Textool ZIF插座不适合。对于ROMsU5和U7，白羊座28-526-10低调ZIF插座将适合，但勉强适合。释放闩锁可能会擦伤其北部的RAM IC，但我发现这并不是什么大不了的事。\nX1可以使用全罐或半罐振荡器。请注意，如果使用频率不是12 MHz的振荡器，则必须更新Makefile中的F_CPU值。(见下文)还请注意，如果使用68HC000，最低时钟频率为4 MHz。\n44针IDE接口接受像这样的CompactFlash适配器板，可从Amazon和其他供应商处购买。\n本项目使用VASM汇编器和标准Makefile。Python 3和PySerial也需要通过串口将程序上传到计算机。Makefile还包含使用Minipro将ROM映像刻录到AT28C256 EEPROM的规则(如果您有TL866II+程序员)。(如果你没有芯片编程器，你应该买一台TL866II+，它们价格合理，可以从许多供应商那里买到。)。\n运行make rom将构建ROM映像，并将其分成奇数和偶数两部分，即rom-l.bin和rom-u.bin。每个文件应该正好是32,768字节。运行make burnrom会使用Minipro将这些文件写入一对AT28C256 EEPROM。\n注意：如果使用频率不是12 MHz的振荡器，请在生成文件中适当更改F_CPU的值。\nMakefile中的波特率变量设置串行接口的波特率。使用包含的脚本baudrate.py确定在给定振荡器频率下可用的波特率。\nROM相当小--它更接近于引导加载程序，而不是操作系统。它支持从FAT16格式的CompactFlash卡的根目录加载程序，并支持一些基本的调试功能。它还为I/O提供了一组较小的系统调用，以简化应用程序。\n测试RAM。如果发生RAM故障，故障地址将写入串口，状态LED快速闪烁。(当以较高的时钟速度在面板上运行时，这很容易失败。)。\n检查实时时钟模块。如果找到，将当前日期和时间打印到串口。\n检查CompactFlash卡，如果是FAT16格式，则尝试挂载第一个分区。\n如果没有按住&#34；Enter&#34；按钮：如果插入了有效的卡，请检查根目录中名为STARTUP.BIN的文件。如果找到，则将其加载到RAM中并执行。\n如果按下了&#34；Enter&#34；按钮，则输入交互式命令shell并跳过执行STARTUP.BIN。\n68K Nano-ROM Version 00009900(20200708)(C)2020 Matt Sarnoff(MSARNOFF.ORG)测试内存...密码：1,048,576 BYTESROM：65,536 BYTESCPU：12,000,000 HZTIME IS 2020-07-07 19：14：36检测到的CARD：250,608KB&#39；没有名称#39；无法加载STARTUP.BIN-FILE NOT FOUNDTYPE？[回车]寻求帮助。&gt；\n如果未加载STARTUP.BIN，则可通过串行端口使用交互式命令shell。(57600波特、8个数据位、无奇偶校验、1个停止位)。类型？然后按Enter键可查看支持的命令列表。此处对它们进行了简要总结。请注意，命令和文件名不区分大小写。\n.L-列出CompactFlash卡根目录中的文件。不显示长文件名和隐藏文件。\n.p文件-将CompactFlash卡根目录中名为file的文件的内容打印为ASCII文本。\n.h文件-将CompactFlash卡根目录中名为file的文件的内容打印为十六进制转储。\n.t-打印实时时钟模块报告的当前日期和时间。\n.T YYYYMMDDWWhhmmss-设置当前日期和时间。新日期/时间应表示为不带分隔符的16位十进制数字字符串。WW应该是介于01和07(包括01和07)之间的两位数工作日。您可以使用Unix命令date&#34；+%Y%m%d0%u%H%M%S&#34；以此格式获取当前日期/时间。\n文件-任何其他命令都被解释为要从CompactFlash卡的Root目录加载并执行的文件名。与MS-DOS不同，文件扩展名是必需的。例如，要执行名为foo.bin的文件，请输入FOO.BIN。(foo将尝试加载名为foo且没有扩展名的文件)。\n串行输入线上的中断条件进入串行加载器，允许将程序从主机上传到RAM。Python脚本serload.py和Makefile规则make load和make run负责这一点。\n硬件异常会导致传输到基本调试器。状态LED快速闪烁，并将寄存器转储打印到串行端口：\n*非法INSTRUCTIOND0=00000064 D1=0000000A D2=00000038 D3=00000009D4=00000000 D5=00000000 D6=00000000 D7=00000000A0=00E0003C A1=00001D40 A2=00000000 A3=00F00000A4=00000000 A5=00000000 A6=000001E2 A7=00EFFFFASR=-S0--Z--PC=0000\n有关ROMAPI提供的系统调用和应用程序指南的详细说明，请参阅API.md。\nROM始终位于地址空间的底部，因此应用程序代码无法覆盖异常向量。\n这是一个小规模的项目。我正在考虑将来设计一个更大的68000冲浪板，所以我可能不会再继续做这件事了。这里有一些我没有时间去处理的项目想法，但欢迎您来：\n使用DS3234实时时钟的SQW输出生成周期性中断。(uClinux可能需要)", "note_en": "The 68k nano hardware is simple and straightforward. It can be built on abreadboard (though there may be stability issues at higher clock speeds).\n  Due to the minimal address decoding circuitry, accessing certain memory regionswill cause multiple devices to be selected. This should be avoided.\n $000000-0xFFFF ROM (repeats 16 times)$100000-1FFFFF X Forbidden (multiple devices selected)$200000-2FFFFF ROM (mirror of $000000-0FFFFF)$300000-$7FFFF X Forbidden (multiple devices selected)$800000-8FFFFF Open bus (available for expansion)$900000-9xxxxF CompactFlash card$A00000-AxxxxF UART$B00000-BFFFFF X Forbidden (multiple devices selected)$C00000-CFFFFF RAM$D00000-DFFFFF X Forbidden (multiple devices selected)$E00000-EFFFFF RAM (mirror of $C00000-CFFFFF)$F00000-FFFFFF X Forbidden (multiple devices selected)\n    The 16550&#39;s modem control lines are used as a bit-banged SPI interface. A 7-pinheader is provided for  SparkFun&#39;s &#34;DeadOn&#34; DS3234 real-time clock board.Access to SPI is therefore achieved via the 16550&#39;s Modem Control Register and LineStatus Register.\n A 2mm pitch 44-pin IDE connector is provided for storage devices. This isintended for CompactFlash card adapters (operating in 16-bit True IDE mode) butmay also work with parallel ATA hard disks. (not tested)\n  All interrupt sources are routed through the 16550. All 16550 interrupts invokethe level 1 autovector (vector offset  $064) and it is up to the software todetermine the source of the interrupt.\n  bom.txt contains a bill of materials. As of this writing (July 2020), allcomponents are available from major distributors like  Mouserand  Jameco. If purchasing 68000s from eBay, note that  vintageICs are a common target of counterfeiters.For this project I used  Toshiba TMP68HC000P-12 chips from Jameco andthey work just fine.\n All parts are through-hole for that extra vintage feel. Note that some of thedecoupling capacitors (C4, C5, C6, C8, and C10) are underneath ICs, so open-frameIC sockets are required. Large IC sockets can also be expensive ( especiallyDIP-64 sockets!) so a cheaper alternative is to use  breakaway SIP 0.1&#34; machine-pinheaders.\n Due to the spacing of the chips, Textool ZIF sockets won&#39;t fit. For the ROMsU5 and U7,  Aries 28-526-10 low-profile ZIF sockets will fit,but  barely. The release latch may scrape against the RAM IC to its north,but I&#39;ve found that it&#39;s not a huge deal.\n You can use either a full-can or half-can oscillator for X1. Note that if usingan oscillator with a frequency other than 12 MHz, you&#39;ll have to update the  F_CPUvalue in the Makefile. (see below) Also note that, if using a 68HC000, the minimumclock frequency is 4 MHz.\n The 44-pin IDE header accepts a CompactFlash adapter board such as  this one, available from Amazon and other vendors.\n  This project uses the  vasm assembler and astandard Makefile. Python 3 and  PySerialare also required to upload programs to the computer via the serial port. TheMakefile also contains rules for burning ROM images to AT28C256 EEPROMs using minipro if you have a  TL866II+programmer. (If you don&#39;t have a chip programmer, you should get a TL866II+, theyare reasonably priced and available from a number of vendors.)\n  Running  make rom will build the ROM image and split it into &#34;odd&#34; and &#34;even&#34;halves,  rom-l.bin and  rom-u.bin. Each file should be 32,768 bytes exactly.Running  make burnrom will write these files to a pair of AT28C256 EEPROMsusing minipro.\n Note: if using an oscillator with a frequency other than 12 MHz, change thevalue of  F_CPU appropriately in the Makefile.\n The  BAUD variable in the Makefile sets the baud rate of the serial interface.Use the included script  baudrate.py to determine which baud rates are usablewith a given oscillator frequency.\n  The ROM is fairly minimal--it&#39;s closer to a bootloader than an operating system.It supports loading programs from the root directory of a FAT16-formattedCompactFlash card and some basic debugging functionality. It also provides asmall set of system calls for I/O to simplify application programs.\n  Test RAM. If a RAM failure occurs, the failed address is written to the serialport and the Status LED flashes rapidly. (This is prone to failure when runningon a breadboard at higher clock speeds.)\n Check for the real-time clock module. If found, print the current date andtime to the serial port.\n Check for a CompactFlash card, and attempt to mount the first partition if itis FAT16-formatted.\n If the &#34;ENTER&#34; pushbutton is NOT held down: If a valid card is inserted, check for a file in the root directory named STARTUP.BIN. If found, load it into RAM and execute it.\n If the &#34;ENTER&#34; pushbutton is held down, enter the interactive command shelland bypass execution of  STARTUP.BIN.\n  68K NANO - ROM VERSION 00009900 (20200708)(C) 2020 MATT SARNOFF (MSARNOFF.ORG)TESTING RAM...PASSEDRAM: 1,048,576 BYTESROM: 65,536 BYTESCPU: 12,000,000 HZTIME IS 2020-07-07 19:14:36CARD DETECTED: 250,608 KB &#39;NO NAME &#39;CANNOT LOAD STARTUP.BIN - FILE NOT FOUNDTYPE ? [ENTER] FOR HELP.&gt;\n  If  STARTUP.BIN was not loaded, an interactive command shell is available viathe serial port. (57600 baud, 8 data bits, no parity, 1 stop bit). Type  ? andpress Enter for a list of supported commands. They are summarized briefly here.Note that commands and filenames are  case-insensitive.\n .L - list files in the root directory of the CompactFlash card. Long filenamesand hidden files are not displayed.\n  .P file - print the contents of the file named  file in the root directoryof the CompactFlash card as ASCII text.\n .H file - print the contenxt of the file named  file in the root directoryof the CompactFlash card as a hexdump.\n .T - print the current date and time as reported by the real-time clock module.\n .T YYYYMMDDWWhhmmss - set the current date and time. The new date/time shouldbe expressed as a string of 16 decimal digits with no separators.  WW shouldbe a 2-digit weekday between  01 and  07 inclusive. You can obtain thecurrent date/time in this format with the Unix command  date &#34;+%Y%m%d0%u%H%M%S&#34;.\n  file - any other command is interpreted as a filename to be loaded from theroot directory of the CompactFlash card and executed. Unlike MS-DOS, the fileextension  is required. e.g. to execute the file named  foo.bin, enter  FOO.BIN.( FOO will attempt to load a file named  foo with no extension).\n  A break condition on the serial input line enters the serial loader, allowingprograms to be uploaded to RAM from a host computer. The Python script  serload.pyand the Makefile rules  make load and  make run take care of this.\n  A hardware exception causes a transfer into a basic debugger. The Status LEDflashes rapidly and a register dump is printed to the serial port:\n *ILLEGAL INSTRUCTIOND0=00000064 D1=0000000A D2=00000038 D3=00000009D4=00000000 D5=00000000 D6=00000000 D7=00000000A0=00E0003C A1=00001D40 A2=00000000 A3=00F00000A4=00000000 A5=00000000 A6=000001E2 A7=00EFFFFASR=-S0--Z-- PC=00001D3A USP=7F7EFFDF[A]BORT/[C]ONTINUE/[S]TEP?\n     See  API.md for a detailed description of the system calls provided by the ROMAPI and guidelines for application programs.\n  ROM is always present at the bottom of the address space, so the exceptionvectors cannot be overridden by application code.\n  This is a small-scale project. I&#39;m thinking about desiging a larger 68000 boardin the future, so I probably won&#39;t continue working on this one. Here are someproject ideas that I won&#39;t have time to tackle, but you&#39;re welcome to:\n Using the DS3234 real-time clock&#39;s SQW output to generate a periodic interrupt.(likely necessary for uClinux)", "posttime": "2020-07-30 05:16:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "单板机,single", "title": "基于摩托罗拉68000的最小单板机", "title_en": "Minimal single-board computer based on Motorola 68000", "transed": 1, "url": "https://github.com/74hc595/68k-nano", "via": "", "real_tags": ["单板机", "single"]}, {"category": "", "categoryclass": "", "imagename": "3308fbef1cd858ada72a40127845d127.jpeg", "infoid": 1015040, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们发现，在新冠肺炎疫情期间，因不得不帮助孩子进行远程学习而感到压力的父母每月比没有报告感受到远程学习压力的父母多喝7杯酒。根据我们的结果，这些有压力的父母报告说，前一个月至少有一次酗酒的可能性是没有压力的父母的两倍。狂饮，因性别而异，是指女性在几个小时内至少喝了四杯，或者男性在几个小时内至少喝了五杯酒精饮料(包括啤酒、葡萄酒或烈性酒)。\n我们是从我们的在线调查中了解到这一点的，361名目前有18岁以下孩子的父母于2020年5月完成了调查。在2020年春季，78%的父母有孩子进行远程教育。在这些人中，66%的人报告说，这一经历给他们带来了压力，因为他们不确定如何帮助他们。\n我们通过社交媒体网站和列表服务向美国各地的人发出了这项调查。然而，这并不是一个具有全国代表性的样本。与此类调查一样，大多数回答的父母都是中等收入或更高收入的人。这项研究的结果尚未公布。\n虽然许多人开玩笑说，酒是如何让他们度过新冠肺炎大流行的，但饮酒可能是有害的。每年死于饮酒的人比死于车祸、枪支或非法药物的人多。饮酒增加还与许多公共卫生问题有关，如暴力、犯罪、贫困和性传播疾病。\n新冠肺炎期间饮酒尤其危险，因为饮酒会削弱你的免疫系统。饮酒会增加患新冠肺炎的可能性，如果你真的得了，还会有更糟糕的结果。\n人们在经历了海啸和飓风等紧张时期后，会增加饮酒量。研究表明，在疾病爆发期间，包括2003年的SARS，以及9/11恐怖袭击之后，这种模式以前也曾出现过。\n新冠肺炎是另一个压力很大的情况。波兰的一项有1000多名参与者参与的研究发现，人们目前比大流行前喝了更多的葡萄酒、啤酒和烈性酒。\n鉴于远程教育将在不久的将来继续下去，我们认为有必要减少导致父母饮酒的压力因素。\n在新冠肺炎大流行期间，父母比没有孩子的人喝得更多。我们的调查是第一次观察在新冠肺炎大流行期间饮酒与远程教育造成的压力之间的关系。\n美国各地的学校系统目前都在为即将到来的一年做计划。在许多情况下，这将需要更多的远程学习。要想让孩子和家长成功地进行远程学习，需要更多地了解是什么让远程学习带来压力。\n[获取有关冠状病毒和最新研究的事实。注册该对话的时事通讯。]。\n我们目前正在进行的另一项研究表明，家长感到压力的一个原因是他们没有从老师或学校得到足够的指导。对于低收入家庭来说，这是一个特别令人担忧的问题，因为一般来说，他们的孩子在学校的表现已经比更富裕的孩子差了。\n重要的是要认识到，教师和其他学校工作人员也在承受压力，在如何进行远程学习方面得不到足够的指导。\n我们的结果是在2020年5月收集的。随着远程教育成为新的常态，至少就目前而言，看看学校提供远程教育的质量有什么变化，以及它对家长的影响是什么，这一点很重要。", "note_en": "We found that parents who are stressed by having to help their children with distance learning during the COVID-19 pandemic drink seven more drinks per month than parents who do not report feeling stressed by distance learning. These stressed parents are also twice as likely to report binge drinking at least once over the prior month than parents who are not stressed, according to our results.  Binge drinking, which varies by gender, is when women consume at least four, or men have at least five alcoholic beverages (which includes beer, wine, or liquor) within a couple hours of each other.\n We learned this from our online survey, which 361 parents with children under 18 years old currently living with them completed in May 2020. Seventy-eight percent of the parents had children who did distance learning in the Spring of 2020. Of those, 66% reported that the experience caused them stress because they were not sure how to help.\n We sent the survey out through social media sites and listservs to people throughout the U.S. However, this is not a nationally representative sample. As is  common with such surveys, most of the parents who responded were middle-income or higher. The results of the study have not yet been published.\n  While many people joke about how booze is  getting them through the COVID-19 pandemic, drinking can be harmful. More people  die each year from drinking alcohol than from motor vehicle crashes, guns or illegal drugs. Increased drinking is also related to many public health problems, such as  violence,  crime,  poverty and  sexually transmitted diseases.\n Drinking alcohol is  especially dangerous during COVID-19 because alcohol use weakens your immune system. Drinking increases your likelihood of getting COVID-19 and, if you do get it, of having  worse outcomes.\n People increase their alcohol consumption after stressful times, such as  tsunamis and  hurricanes. Research has shown that this pattern has held before during disease outbreaks, including  SARS in 2003, and following the  9/11 terrorist attacks.\n COVID-19 is another stressful situation. One study in Poland with over 1,000 participants found that people are currently  drinking more wine, beer and liquor than before the pandemic.\n Given that distance learning  is going to continue for the near future, we believe it is warranted to decrease stressors that lead to parents’ drinking.\n  Parents are drinking more during the COVID-19 pandemic than people without children. Our survey is the first one to look at the relationship between alcohol use and the stress caused by distance learning during the COVID-19 pandemic.\n  School systems throughout the U.S. currently are planning for the upcoming year. In many cases, that will  require more distance learning. For distance learning to be successful for children and parents, more needs to be known about what makes it stressful.\n [ Get facts about coronavirus and the latest research.  Sign up for The Conversation’s newsletter.]\n Another study of ours, currently underway, suggests that one reason that parents are stressed is that they are not getting enough guidance from teachers or schools. This is a particular concern for  low-income families whose children, in general, already  fare worse in school than more affluent children.\n It is important to realize that  teachers and other school staff are also experiencing stress and not getting enough guidance on how to do distance learning.\n Our results were collected in May 2020. As distance learning becomes the new normal, at least for now, it is important to see what, if anything, changes in how well schools provide distance learning and how it affects parents.", "posttime": "2020-07-30 05:15:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上学,children,饮酒", "title": "孩子们被迫在家上学的父母们喝得更多了", "title_en": "Parents with children forced to do school at home are drinking more", "transed": 1, "url": "https://theconversation.com/parents-with-children-forced-to-do-school-at-home-are-drinking-more-143164", "via": "", "real_tags": ["上学", "children", "饮酒"]}, {"category": "", "categoryclass": "", "imagename": "9bff7970aa02811b511729d0855b96ab.jpg", "infoid": 1015039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "柯达的股价在两天内飙升了1900%，此前这家相机公司获得了一笔7.65亿美元的政府贷款，用于生产药物成分...", "note_en": "  Kodak shares surged as much as 1,900% in two days after the camera company was awarded a $765 million government loan to make drug ingredients i...", "posttime": "2020-07-30 05:15:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制造,kodak,贷款", "title": "柯达在获得7.65亿美元贷款制造药品后，两天内飙升1900%", "title_en": "Kodak surges 1,900% in 2 days after securing a $765M loan to make drugs", "transed": 1, "url": "https://markets.businessinsider.com/news/stocks/kodak-stock-price-surges-765-million-government-drug-loan-2020-7-1029444079", "via": "", "real_tags": ["制造", "kodak", "贷款"]}, {"category": "", "categoryclass": "", "imagename": "e185db9ad0d0684c6fa4574a990601c4.jpeg", "infoid": 1015038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于老式计算机的爱好者来说，围绕经典微处理器建造一台计算机是一种必经之路。但对于那些从未建造过自己的计算机的人来说，这项任务可能看起来非常艰巨。使用现有设计可以很好地开始您自己的构建。\n马特·萨诺夫(Matt Sarnoff)最近完成了一款他称之为68k Nano的极简主义单板电脑。这是一种简单易懂的设计，可以用可用的设计文件构建在PCB上，甚至可以构建在面包板上。\n在摩托罗拉68000微处理器的基础上，68k Nano使用了几个通孔组件，这将让反向计算纯粹主义者感到高兴，同时还偷偷地引入了一些更现代的便利设施，比如CompactFlash卡读卡器。68000的运行频率为12 MHz，提供1MB的内存和64KB的只读存储器。\n只需要两块7400系列胶水逻辑芯片，使设计尽可能精简。这种简单性确实有一些缺点，特别是在考虑地址解码时。几个地址块不可访问，以避免总线争用问题。\n与计算机的通信通过16550串行口芯片完成。可以使用PySerial库通过Python3访问此接口以上传程序。Sarnoff还提供了一个ROM映像，它支持从CompactFlash卡加载程序，还提供了一些基本的调试功能，可以通过一组简单的命令访问这些功能。\nSarnoff目前没有进一步开发68k Nano的计划，但其他人有很多机会增加额外的功能。它提供了一个极好的、易于理解的平台来启动新复古风格计算机的开发。\n尼克·比尔德(Nick Bild)的特长是研发、创意和打造你从未想过要的下一件大事。", "note_en": "Building a computer around a classic microprocessor is something of a rite of passage for aficionados of vintage computers. But for those that have never built their own computer, the task can seem very daunting. Using an existing design can be a great way to get started with your own build.\n Matt Sarnoff has recently completed a minimalistic single-board computer he calls the  68k nano . It is a simple, easy to understand design that can be built on a PCB with the available design files, or even on a breadboard.\n Based on the Motorola 68000 microprocessor, the 68k nano uses a handful of through-hole components that will keep the retrocomputing purists happy, while also sneaking in some more modern conveniences like a CompactFlash card reader. The 68000 runs at 12MHz and offers 1MB of RAM and 64KB of ROM storage.\n Only two 7400-series glue logic chips are required, keeping the design as minimal as reasonably possible. This simplicity does have some drawbacks, especially when considering address decoding. Several  address blocks are inaccessible  to avoid bus contention issues.\n Communication with the computer is accomplished via a 16550 UART chip. This interface can be accessed via Python 3 with the  PySerial  library to upload programs. Sarnoff has also provided a ROM image that supports loading programs from a CompactFlash card, and also offers some basic debugging functionality that can be accessed with a set of simple commands.\n Sarnoff has no plans to further develop the 68k nano at this time, but there is plenty of opportunity for others to add additional functionality. It provides an excellent, easy to understand platform to jumpstart the development of a new retro-style computer.\n  Nick Bild   R&amp;D, creativity, and building the next big thing you never knew you wanted are my specialties.", "posttime": "2020-07-30 05:15:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diy,计算机", "title": "最小的DIY计算机68k Nano是最容易理解的", "title_en": "Minimal DIY Computer 68k Nano Is Maximally Understandable", "transed": 1, "url": "https://www.hackster.io/news/this-minimal-computer-is-maximally-understandable-39fe09c76d8c", "via": "", "real_tags": ["diy", "计算机"]}, {"category": "", "categoryclass": "", "imagename": "f507435b0d4f3e6d39f93926b248290b.jpg", "infoid": 1015037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你需要不惜一切代价避免冠状病毒感染的另一个理由，这里有一个。对这种疾病持怀疑态度的人，以及关闭经济以阻止其传播的必要性，都集中在大多数冠状病毒病例都是轻微甚至没有症状的事实上，错误地将新冠肺炎比作“只是流感”。但最近一项对百名康复冠状病毒患者的研究显示，尽管绝大多数患者最初患有轻微的新冠肺炎，但其中78人现在仍有持久的心血管损害。这项研究于周一发表在“美国医学会心脏病杂志”上，详细介绍了100名康复冠状病毒患者的心脏核磁共振检查结果。其中28人在对抗病毒时需要氧气补充，只有2人需要呼吸机。但研究显示，其中78人在康复后仍有心血管异常，其中60人表现为“持续的心肌炎”。这些情况似乎与病例严重程度和先前存在的情况无关，尽管JAMA的研究人员指出，这些发现需要更大规模的研究。特朗普总统和他的政府试图说，美国的低冠状病毒死亡率证明这个国家正在战胜这种病毒。但新冠肺炎的死亡率不仅没有特朗普声称的那么低，这项研究还证明，感染冠状病毒的后果远远不止死于冠状病毒。凯瑟琳·克劳奇克", "note_en": " If you needed another reason to avoid coronavirus at all costs, here's one.Skeptics of the disease and the necessity of shutting down the economy to stop its spread have focused on the fact that most coronavirus cases have been mild or even asymptomatic, mistakenly comparing COVID-19 to \"just the flu.\" But a recent study of 100 recovered coronavirus patients reveals 78 of them now have lasting cardiovascular damage even though a vast majority of them had mild cases of COVID-19 in the first place.The study published Monday in JAMA Cardiology details the results of cardiac MRI exams of 100 recovered coronavirus patients. Twenty-eight of them required oxygen supplementation while fighting the virus, while just two were on ventilators. But 78 of them still had cardiovascular abnormalities after recovery, with 60 of them showing \"ongoing myocardial inflammation,\" the study shows. These conditions appeared to be independent of case severity and pre-existing conditions, though JAMA researchers note these findings need a larger study.President Trump and his administration have tried to say America's low coronavirus mortality rate proves the country is beating the virus. But not only is COVID-19's mortality rate not as low as Trump has claimed; this study proves there are far more consequences of catching coronavirus than just dying of it. Kathryn Krawczyk", "posttime": "2020-07-30 05:14:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,病毒,病例", "title": "研究显示，即使是轻微的冠状病毒病例也会导致持久的心血管损害", "title_en": "Even mild coronavirus cases can cause lasting cardiovascular damage, study shows", "transed": 1, "url": "https://theweek.com/speedreads/927908/even-mild-coronavirus-cases-cause-lasting-cardiovascular-damage-study-shows", "via": "", "real_tags": ["冠状病毒", "病毒", "病例"]}, {"category": "", "categoryclass": "", "imagename": "e467bc3d86bde4335ccbda2cbeb3cac7.jpg", "infoid": 1015036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的八年里，环保人士一直在精心修复比利时圣巴沃大教堂(St Bavo‘s Cathedral)内著名的根特祭坛。在几种先进的成像技术的帮助下，他们已经能够识别出早期修复作品中的哪些地方覆盖了原始作品。安特卫普大学(University Of Antwerp)和华盛顿特区国家美术馆(National Gallery Of Art)的研究人员在一篇新论文中发表了一篇新的论文，这篇论文发表在《科学进展》(Science Advance)杂志上，展示了不同技术的结合如何极大地改善了他们的分析，揭示了对内部中央面板中上帝羔羊形象的以前未知的修订。\n根特祭坛作品-也就是神秘羔羊的崇拜-是一幅15世纪的多版画，归因于休伯特和简·范艾克兄弟。最初由12块镶板组成，这件祭坛作品有两个翅膀，每个翅膀有四个镶板，两侧都涂上了油漆。这些侧翼在教堂节日期间打开，这样会众就可以看到内部的四个中央嵌板。内部上部登记簿以国王基督、圣母玛利亚和施洗约翰为特色，两侧是描绘天使和亚当和夏娃形象的外部嵌板。内部较低的登记册描绘了施洗者约翰和福音传道者圣约翰。羊羔崇拜由中心板组成，特色是上帝的羔羊站在被天使包围的草地上的祭坛上，成群结队的烈士、圣徒和先知聚集在祭坛周围。\n第一次重大的修复是在1550年进行的，目的是修复早先清理造成的损坏。1662年，佛兰芒画家安东·范登豪威尔(Antoon Van Den Heuvel)再次清理了它。这件祭坛在二战期间存放在奥地利的矿井中时遭到损坏，之后在20世纪50年代进行了另一次修复，利用X射线照相术(XRR)来帮助这些努力。具体来说，研究人员从祭坛的横截面上拍摄了微小的油漆样本，得出了关于早期修复期间被覆盖的区域的有用信息，掩盖了最初的艾克作品-包括兰姆的头部。\n这一时期的艺术家会用一层粉笔和一种粘合剂(如胶水)制作一块橡木面板。然后，艺术家在用半透明底漆(通常是用铅白、粉笔、碳黑或泥土颜料烘干的油彩)密封表面之前，用黑色在那一层上绘制他们希望绘制的图像。然后，艺术家会涂上一层不同颜色的颜料来定义底图。最后，艺术家会画出更精细的细节，并添加最丰富的颜色。大约一年后，一旦油漆完全干燥，艺术家就会涂上最后一层清漆。\n根据“科学进展”新论文的作者的说法，由于频繁使用铅白色油漆，当时可用的技术不足以精确定位所有的覆盖画。它只是不可能达到必要的化学对比水平。他们写道，在这种情况下，文物保护者和策展人会犯下谨慎的错误，选择在进一步的研究提供确凿证据证明其来源之前，将可能的涂装区域留在原地。因此，1950年的修复只去掉了羊头周围的覆盖物。这揭示了原始埃基安羔羊原来的镀金射线和耳朵，同时保留了覆盖在上面的耳朵。\n最近，根特美术馆(Museum Of Fine Arts)于2012年10月开始修复这件祭坛作品，让公众可以从玻璃屏后面观看修复过程，因为皇家文化遗产研究所(Royal Institute For Culture Heritage)的文物保护人员正在对单个镶板进行修复。八个外层镶板的修复工作于2016年完成，下面的五个镶板在接下来的三年里得到修复。\n最近的修复还使用不同的成像技术生成了各种面板的一系列高分辨率图像。正如我们去年报道的那样，这些图像反过来构成了杜克大学(Duke University)、国家美术馆(National Gallery)和伦敦大学学院(University College London)的研究人员对祭坛图像进行人工智能分析的调查基础。该团队在2019年发表了一篇论文，展示了他们的技术可以让对祭坛作品的双面彩绘面板进行成像变得更容易。\n机翼面板的两侧都涂有油漆，这一事实对传统的X射线分析提出了独特的挑战。作者写道，X射线穿透得如此之深，以至于很难确定哪些内容适用于面板的哪一边，因为所有的图像都明显地重叠或混合在一起。他们开发了一种深度神经网络算法来研究混合X射线图像，该图像包含了这幅画双面嵌板正面和背面的特征。他们成功地将他们的技术应用于亚当和夏娃翼板的X射线图像，将数据解构成两幅清晰的图像-显著改善了ACHI的性能\n与此同时，安特卫普大学的Geert Van der Sickt及其同事正在使用宏观X射线荧光(MA-XRF)成像技术，结合其他传统方法(包括XRR和红外反射反射术，IRR)对四块内中心板进行测量，以确定16世纪中叶修复期间完成的全部覆盖范围。\n这种结合的方法非常成功，以至于安特卫普的研究人员决定与华盛顿特区的国家艺术馆合作，将MA-XRF与红外反射成像光谱(RIS)结合起来进行第二阶段的修复，其中包括完全修复上帝的羔羊。作者写道，在另一种方法不能提供的情况下，每种方法都能提供一定程度的化学对比。具体地说，每种技术都可以揭示对方不敏感的材料，例如，覆盖强烈衰减X射线的层可以证明对红外辐射是透明的，反之亦然。\n例如，MA-XRF成像绘制了朱红色颜料中的水银，揭示了原始艾基羊的鼻孔。同时，RIS揭示了有蹄类动物面部吸收红外线的原始层。最后，分析发现了这只小羊的三个不同版本：第一个版本是范艾克兄弟画的；第二个版本--要么是范艾克兄弟画的，要么是他们同时代的人画的--后腿更大，呈方形；第三个版本来自16世纪的修复，显著改变了小羊的头部。\n这项新的分析有助于指导自然资源保护者移除这幅16世纪的覆盖画，揭示出与研究人员的预测非常吻合的面部特征。具体地说，这只羔羊的脸在表现力上相当像人类，有独特的皱唇，较小的V形鼻孔，清晰的下巴轮廓，以及眼睛向前看，相当令人不安，直接注视着观众。\n这双眼睛在艺术历史学家中仍然是一个相当有争议的问题。一些人提出，这样做是为了让羔羊看起来更有人情味，作为耶稣化身的象征。作者们写道，一个更简单的解释可能是，眼睛朝前的动物绘画是一种典型的古老风格，这种风格在15世纪仍然存在，但当艺术家掌握了对动物的更自然的描绘后，这种风格就消失了。在根特祭坛本身，有一些动物的例子，既有前瞻性的，也有更自然的向外看的眼睛。因此，范艾克兄弟画这只小羊的眼睛朝前，直接吸引了观众的注意力也就不足为奇了，作者总结道。", "note_en": "Over the last eight years, conservationists have been meticulously restoring the famed Ghent altarpiece housed in Belgium&#39;s St Bavo&#39;s Cathedral. With the help of several advanced imaging techniques, they&#39;ve been able to identify where overpainting from earlier restorations obscured the original work. Researchers at the University of Antwerp and the National Gallery of Art in Washington, DC, have published  a new paper in the journal Science Advances demonstrating how combining different techniques greatly improved their analysis, revealing previously unknown revisions to the Lamb of God figure in the inner central panel.\n The   Ghent Altarpiece—aka the   Adoration of the Mystic Lamb—is a 15th-century polyptych attributed to brothers Hubert and Jan van Eyck. Originally consisting of 12 panels, the altarpiece features two &#34;wings&#34; of four panels each, painted on both sides. Those wings were opened on church feast days so congregants could view the interior four central panels. The inner upper register features Christ the King, the Virgin Mary, and John the Baptist, flanked by the outer panels depicting angels and the figures of Adam and Eve. The inner lower register depicts John the Baptist and St. John the Evangelist. The  Adoration of the Lamb comprises the center panel, featuring the Lamb of God standing on an altar in a meadow surrounded by angels, with groups of martyrs, saints, and prophets congregating around the altar.\n The first significant restoration was done in 1550 to repair damage from an earlier cleaning. It was cleaned again in 1662 by the Flemish painter  Antoon van den Heuvel. After the altarpiece was damaged while being stored in Austrian mines during World War II, another restoration was done in the 1950s, making use of X-ray radiography (XRR) to aid in those efforts. Specifically, the researchers imaged tiny paint samples from the cross section of the altarpiece, yielding useful information about areas that had been over-painted during the earlier restoration, obscuring the original Eyckian work—including the Lamb&#39;s head.\n Artists of this period would prepare an oak panel with a layer of chalk mixed with a binding agent like glue. The artist would then sketch the image they wished to paint on that layer in black before sealing the surface with a translucent primer (typically drying oil tinged with lead white, chalk, carbon black, or earth pigments). Then the artist would apply a layer of variously colored paints to define the underdrawing. Finally, the artist would paint the finer details and add the richest colors. A year or so later, once the paint had fully dried, the artist would apply a final varnish layer.\n According to the authors of the new paper in Science Advances, the techniques available at the time were not sufficient to precisely localize all of the overpainting because of the frequent use of lead white paint. It just wasn&#39;t possible to achieve the necessary level of chemical contrast. In such cases, &#34;conservators and curators err on the side of caution, choosing to leave areas of possible overpaint in place until further research provides definitive evidence of their origin,&#34; they wrote. So the 1950 restoration only removed the overpainting from the area surrounding the lamb&#39;s head. This revealed the original gilded rays and ears of the original Eyckian lamb, while keeping the overpainted ears.\n  Most recently, the Museum of Fine Arts in Ghent began restoring the altarpiece in October 2012, allowing the public to view the process from behind a glass screen as conservators from the Royal Institute for Cultural Heritage worked on individual panels. Restoration of the eight outer panels was completed in 2016, and the five lower panels were restored over the next three years.\n This most recent restoration also produced a series of high-resolution images of the various panels using different imaging techniques. As  we reported last year, those images in turn formed the basis for an investigation into applying AI analysis to the altarpiece images by researchers at Duke University, the National Gallery, and University College London. That team  published a paper in 2019 demonstrating that its techniques could make imaging the altarpiece&#39;s two-sided painted panel easier.\n The fact that the wing panels are painted on both sides posed a unique challenge for conventional X-ray analysis. X-rays penetrate so deeply that it can be difficult to determine which content applies to which side of the panel, since &#34;all of the images are visibly overlaid or &#39;blended&#39; together,&#34; the authors wrote. They developed a deep neural-network algorithm to study mixed X-ray images containing features from the front and back of the painting&#39;s double-sided panels. They successfully applied their technique to X-ray images of the Adam and Eve wing panels to deconstruct that data into two clear images—significantly improving on the performance achieved by prior methods.\n    Meanwhile, Geert Van der Snickt and colleagues at the University of Antwerp were using macroscopic X-ray fluorescence (MA-XRF) imaging, combined with other traditional methods (including XRR and infrared reflectance reflectography, or IRR) on the four inner central panels to determine the full extent of the overpainting done during the mid-16th-century restoration.\n The combination approach was so successful that the Antwerp researchers decided to collaborate with the National Gallery of Art in Washington, DC, combining MA-XRF with infrared reflectance imaging spectroscopy (RIS) for the second phase of the restoration, which included fully restoring the Lamb of God. &#34;Each method provides some level of chemical contrast in cases where the other does not,&#34; the authors wrote. &#34;In particular, each technique can reveal materials to which the counterpart is insensitive, for example, overlaying layers that strongly attenuate x-rays can prove transparent for infrared radiation, and vice versa.&#34;\n For instance, the MA-XRF imaging mapped the mercury in the vermillion paint, revealing the nostrils of the original Eyckian lamb. Meanwhile, the RIS revealed the original layer of the ungulate&#39;s face, which absorbs infrared light. In the end, the analysis uncovered three different versions of the lamb: the original one painted by the Van Eyck brothers; a second version—either by the brothers or one of their contemporaries—which featured larger, squared-off hindquarters; and a third version from the 16th-century restoration that significantly altered the lamb&#39;s head.\n The new analysis helped guide the conservationists as they removed the 16th-century overpainting, revealing facial features that closely matched the researchers&#39; predictions. Specifically, the lamb&#39;s face is quite human in its expressiveness, with distinctive pursed lips, smaller V-shaped nostrils, and a well-defined jawline, as well as eyes that face forward in a rather unsettling, direct gaze at the viewer.\n Those eyes remain a matter of considerable debate among art historians. Some propose that it was done to make the lamb appear more human, as a symbol of the embodiment of Jesus. &#34;A simpler explanation may be that the painting of animals with forward-facing eyes is typical of an older style that was still present in the 15th century but disappeared when artists mastered a more naturalistic depiction of animals,&#34; the authors wrote. Within the Ghent altarpiece itself, there are examples of animals depicted with both forward-looking and more naturalistic outward-looking eyes. &#34;Thus, it is not unexpected that the Van Eyck brothers would have painted the Lamb with forward-facing eyes that directly engage the viewer,&#34; the authors concluded.", "posttime": "2020-07-30 04:51:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "看到,face,射线", "title": "经过最新的修复，我们可以看到梵艾克上帝羔羊的真面目", "title_en": "We can see the true face of Van Eyck Lamb of God after latest restoration", "transed": 1, "url": "https://arstechnica.com/science/2020/07/new-restoration-reveals-painted-over-original-version-of-van-eyck-lamb-of-god/", "via": "", "real_tags": ["看到", "face", "射线"]}, {"category": "", "categoryclass": "", "imagename": "27413c654651c16d5307e414bb1f76a1.jpg", "infoid": 1015035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过将互联网用户的浏览数据(通过DoubleClick cookie收集)与谷歌账户联系起来，谷歌能够将用户身份、(Gmail)电子邮件数据、搜索历史、位置数据等(谷歌已经关闭了独立产品的隐私政策，将所有这些活动结合在一起)与用户更广泛的互联网浏览活动联系在一起，极大地扩大了其通过行为广告分析和定向用户的能力。\n众议员瓦尔·戴明斯(Val Demings)辩称，通过将DoubleClick cookie数据和谷歌账户数据结合起来，谷歌实质上已经破坏了互联网上的用户隐私。而且-重要的是，考虑到该公司现在面临的国内反垄断审查-这是唯一可能的，因为谷歌已经积累了市场力量。\n戴明斯表示：“当谷歌提出合并提议时，人们对谷歌将拥有的数据访问权限敲响了警钟-特别是将用户的个人身份与他们的浏览活动联系起来的能力。”然后，戴明斯放大镜头，抨击另一家科技巨头违背了数据隐私承诺的皮查伊。\n“谷歌…。向国会和反垄断执法者承诺，这笔交易不会降低用户隐私。谷歌首席法律顾问在参议院反垄断小组委员会作证说，谷歌无法合并这些数据。即使它想要，考虑到合同的限制。但在2016年6月，谷歌继续合并了这些数据-有效地摧毁了互联网上的匿名性，“她解释说。\n戴明斯随后向皮查伊施压，询问他是否亲自签署了这一侵犯隐私的举动，因为他在2015年成为谷歌的首席执行官。\n@RepValDemings通过探索2016年的cookie/数据合并，粉碎了我对谷歌最紧迫的问题。这是新闻报道。这也被德克萨斯股份公司@KenPaxtonTX称为问题#106。共和党人认为这些担忧是党派之争。Https://t.co/WV8qj2Iepk pic.twitter.com/jgSYgojtEX。\n皮查伊在试图做出温和的回应之前犹豫了一下--结果被戴明斯再次追问：“你到底有没有在这个决定上签字？”\n“我-我在很高的水平上审查了我们做出的所有重要决定，”他在短暂停顿后说。\n然后，他开始寻找更舒适的领域，开始了谷歌惯常的营销说辞--关于谷歌如何“深切关注我们用户的隐私和安全”。\n戴明斯对此一无所知。她说，这一180度大转弯使谷歌能够将用户的搜索和浏览历史、位置数据以及存储在Gmail中的电子邮件信息结合起来，抨击它“绝对令人震惊”。\n然后，她引用了DoubleClick一位高管的一封电子邮件，这位高管告诉委员会，这“正是用户创始人此前担心会导致反弹的那种用户隐私降低”。\n“由于哲学上的原因，他们在这项政策上坚定不移。这就是拉里(佩奇)和谢尔盖(布林)从根本上不希望用户与跨站点cookie相关联。他们还担心隐私风暴，以及对谷歌品牌的损害‘，她说，直接引用了这位未透露姓名的DoubleClick高管的电子邮件。\n戴明斯继续说：“所以在2007年，谷歌的创始人害怕做出这一改变，因为他们知道这会让他们的用户感到不安--但在2016年，谷歌似乎并不在意。”然后，戴明斯向皮查伊表示，2007年至2016年间发生的变化是，谷歌获得了“巨大的市场力量”。\n“所以，虽然谷歌在2007年必须关心用户隐私，但到了2016年，它就不必再关心用户隐私了-你会同意谷歌获得了巨大的市场影响力，这一点改变了吗？”她问。\n这位Alphabet和谷歌首席执行官回应说，他要求有机会“解释”，然后匆匆列出了谷歌提供给用户的一系列控件，这样他们就可以尝试缩小追踪他们的方式，并进一步声称，这使得人们“非常容易”控制谷歌对他们的信息做了什么。(不过，一些欧盟数据监管机构对谷歌的“透明度”持截然不同的看法。)。\n皮查伊声称：“我们今天让用户很容易控制他们的数据。”“我们简化了他们的设置，他们可以打开或关闭广告个性化--我们将大部分活动设置合并为三个分组。我们提醒用户去做隐私检查。已经有10亿用户这样做了。“\n戴明斯听起来不为所动，再次打断了他的话--他说：“我担心谷歌的诱饵和与DoubleClick的转换是一个更广泛模式的一部分，即谷歌收购公司的目的是监视美国人，由于谷歌的主导地位，用户别无选择，只能投降。”\n她继续争辩说，对谷歌来说，“更多的用户数据意味着更多的钱”。\n皮查伊曾试图否认这一点--在戴明斯重申这一论点之前，他的回答是“大体上不是这样”：“所以你的意思是，更多的用户数据并不意味着谷歌可以收集更多的钱？”\n这对皮查伊来说更容易回避。“我们收集的大部分数据都是为了帮助用户，并提供个性化的体验”，他反驳道，他巧妙地避开了一个关键点，即谷歌通过将人们的网络浏览与谷歌ID和产品活动交叉链接，让这家科技巨头能够通过向他们投放令人毛骨悚然的广告来产生巨额利润，而这反过来又构成了Alphabet的绝大部分利润。\n但说到这里，戴明斯的五分钟时间到了-尽管听证会仍在继续。你可以在这里收听。", "note_en": "By linking Internet users’ browsing data, as harvested via the DoubleClick cookie, to Google accounts it was able to join the dots of user identities, (Gmail) email data, search history, location data and so on (Google already having collapsed the privacy policies of separate products, to join up all that activity) with its users’ wider Internet browsing activity — vastly expanding its ability to profile and target people with behavioral ads.\n   Rep. Val Demings contended that by combining DoubleClick cookie data and Google account data Google had essentially destroyed user privacy on the Internet. And — importantly, given the domestic antitrust scrutiny the company now faces — that that had only been possible because of the market power Google had amassed.\n “When Google proposed the merger alarm bells were raised about the access to data Google would have — specifically the ability to connect a user’s personal identity with their browsing activity,” said Demings, before zooming in to hammer Pichai on another tech giant broken data privacy promise.\n “Google… committed to Congress and to the antitrust enforcers that the deal would not reduce user privacy. Google chief’s legal advisor testified before the Senate Antitrust Subcommittee that Google wouldn’t be able to merge this data. Even if it wanted to, given contractual restrictions. But in June of 2016 Google went ahead and merged this data anyway — effectively destroying anonymity on the Internet,” she explained.\n Demings then pressed Pichai on whether he personally signed off on the privacy-hostile move, given he became CEO of Google in 2015.\n and  @RepValDemings crushes it on what was my burning question for Google by probing 2016 cookie/data merge. Here is the press report. It&#39;s also known as question #106 by Texas AG  @KenPaxtonTX. Republican for those who think these concerns are partisan.  https://t.co/WV8qj2Iepk  pic.twitter.com/JgSYgojtEX\n  Pichai hesitated before attempting a bland response — only to be interrupted by Demings pressing him again: “Did you sign off on the decision or not?”\n “I — I reviewed at a high level all the important decisions we make,” he said, after a micro pause.\n He then segwayed in search of more comfortable territory, starting into Google’s usual marketing spiel — about how it “deeply cares about the privacy and security of our users”.\n Demings was having none of it. The U-turn had enabled Google to combine a user’s search and browsing history, location data and information from emails stored in Gmail, she said, blasting it “absolutely staggering”.\n She then referenced an email from a DoubleClick exec who had told the committee it was “exactly the kind of user reduction in privacy that users’ founders had previously worried would lead to a backlash”.\n “‘They were unwavering on the policy due to philosophical reasons. Which is Larry [Page] and Sergey [Brin] fundamentally not wanting users associated with a cross-site cookie. They were also worried about a privacy storm, as well as damage to Google’s brand’,” she said, quoting directly from the email from the unnamed DoubleClick exec.\n “So in 2007 Google’s founders feared making this change because they knew it would upset their users — but in 2016 Google didn’t seem to care,” Demings went on, before putting it to Pichai that what had changed between 2007 and 2016 is that Google gained “enormous market power”.\n “So while Google had to care about user privacy in 2007 it no longer had to in 2016 — would you agree that what changed was Google gained enormous market power?” she asked.\n The  Alphabet   and Google CEO responded by asking for a chance “to explain” — and then rattling off a list of controls Google offers users so they can try and shrink how it tracks them, further claiming it makes it “very easy” for people to control what it does with their information. (Some EU data regulators have  taken a very different view of Google’s ‘transparency’, however.)\n “We today make it very easy for users to be in control of their data,” claimed Pichai. “We have simplified their settings, they can turn ads personalization on or off — we have combined most of activity settings into three groupings. We remind users to go do a privacy check up. One billion users have done so.”\n Demings, sounding unimpressed, cut him off again — saying: “I am concerned that Google’s bait and switch with DoubleClick is part of a broader pattern where Google buys up companies for the purposes of surveilling Americans and because of Google’s dominance users have no choice but to surrender.”\n She went on to contend that “more user data means more money” for Google.\n Pichai had a go at denying that — starting an answer with the claim that “in general that’s not true” before Demings repeated the contention: “So you’re saying that more user data does not mean the more money that Google can collect?”\n That was easier for Pichai to sidestep. “Most of the data we collect is to help users and provide personalized experiences back”, he shot back, neatly avoiding the key point that the access Google has given itself to people’s data by cross linking their web browsing with Google IDs and product activity enables the tech giant to generate massive profits via targeting them with creepy ads, which in turn makes up the vast majority of Alphabet’s profit.\n But with that Demings’ five minutes were up — although the hearing continues. You can tune in  here.", "posttime": "2020-07-30 04:50:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,sundar", "title": "\n谷歌的桑达尔·皮查伊(Sundar Pichai)就“破坏互联网上的匿名性”进行了盘问", "title_en": "\n\t\t\t\tGoogle’s Sundar Pichai grilled over “destroying anonymity on the Internet”\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/29/googles-sundar-pichai-grilled-over-destroying-anonymity-on-the-internet/", "via": "", "real_tags": ["google", "谷歌", "sundar"]}, {"category": "", "categoryclass": "", "imagename": "8b160400110d8244f550e8fb231efb5e.jpg", "infoid": 1015034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Joymode的创始人乔·费尔南德斯将继续担任Joymode的顾问，因为该公司正在将业务重心转向零售合作伙伴关系。\n与XRC Labs的Pano Anthos的关系始于2019年末Joymode和沃尔玛之间的小型试点整合。费尔南德斯说：“很明显，我们应该全力以赴建立零售合作伙伴关系。”费尔南德斯说，当公司四处寻找合作伙伴推行这一战略时，安东斯和他的公司XRC不断被提及。\n费尔南德斯表示，与XRC Labs交易的确切条款未披露，但Joymode将成为XRC的全资业务，并可能重返市场，从更多投资者那里筹集更多资金。\n费尔南德斯在谈到该公司最初的业务时表示：“我们永远不可能以我们需要的规模实现增长。”“从第一天起，我就相信Joymode要么会变得巨大，要么就会消亡。我们增长了，但考虑到我们业务的成本结构，这给业务带来了很大的压力，要求它以指数级的速度增长。每个人都喜欢这个想法，但实际增长速度比我们需要的要慢。“。\n尽管Joymode并不成功，但费尔南德斯表示，他不能责怪他的投资者或他的团队。“我们必须反复考虑我们所有可能的想法。实际上，我们的每一个想法都被耗尽了，…。我们失败了，这是一件令人沮丧的事情，但我们有一个公平的机会，“他说。\n该公司剩下的是后端的库存管理系统和一项服务，这项服务将允许任何零售商参与未来的租赁业务。\n费尔南德斯说：“论文的一部分是，通过提供出租服务，人们会想要做更多的事情。”但事实是，消费者需要更多的理由才能使用公司的服务，而没有足够的活动来推动需求。\n他表示：“我相信，我们开发的库存管理系统令人难以置信，它将成为未来零售商进行租赁业务的标准。”\n随着该公司转向零售商，租赁选项成为通过额外产品创造收入的一种方式。费尔南德斯说：“所有的配件都让这次活动变得更好。”“附加服务，在你购买之前先试一试，体验式的东西在零售环境中会更完整。”\n在Joymode，问题是公司拥有库存，这造成了很高的固定成本。费尔南德斯说：“我们从来没有对洛杉矶的增长感到有信心，无法证明在另一个城市开业的费用是合理的。”“如果我们在洛杉矶破解了用户获取问题，我们就会在很多地方推出它。”\n最终，Joymode会员通过使用Joymode租用产品而不是购买产品，节省了5000万美元。该公司总共收购了2000种独特的产品-从海滩和露营设备到视频游戏，从虚拟现实耳机到烹饪用具。在一个给定的周末，大约有3万件产品将从该公司的仓库运往南加州的各个地点。\n在XRC Labs，一家成立于2015年的支持消费品和品牌空间的公司，Joymode将补充一个加速器，每两年筹集600万至900万美元，并管理一个可能达到5000万美元管理资产的增长基金。\n对于安东斯来说，Joymode业务的最佳推论可能是家得宝(Home Depot)的租赁业务。安东斯说：“家得宝的租赁业务每年超过10亿美元。”“我们的社会将会有这样一个巨大的组成部分，对他们来说，租房不仅是一个更可持续的选择，而且是一个合理的选择。”他们会想要租房，因为他们不想拥有它。“", "note_en": "Joymode’s   founder  Joe Fernandez   will continue on as an advisor to Joymode as the company moves to pivot its business to focus on retail partnerships.\n The relationship with  XRC Labs’   Pano Anthos began after a small pilot integration between  Joymode and Walmart launched in late 2019. “[It] became obvious that we should go all in on retail partnerships,” according to Fernandez. And as the company cast about for partners to pursue the strategy, Anthos and his firm, XRC, kept being mentioned, Fernandez said.\n  The precise terms of the deal with XRC Labs were undisclosed, but Joymode will become a wholly owned business of XRC and could potentially return to market to raise additional funds from additional investors, according to Fernandez.\n “We could never crack growth at the scale we needed,” said Fernandez of the company’s initial business. “From day one, my belief was Joymode was going to be huge or dead. We grew, but given the cost structure of our business it put a lot of pressure on the business to grow exponentially fast. Everyone loved the idea but the actual growth was slower than we needed it to be.”\n Though Joymode wasn’t a success, Fernandez said he can’t fault his investors or his team. “We got to iterate through every possible idea we had. Literally every idea we had was exhausted… We failed and that’s a bummer, but we got a fair shot,” he said.\n What remains of the company is an inventory management system on the back end and a service that will allow any retailer to get involved in the rental business going forward.\n “Part of the thesis was that by making things available for rental, people would want to do more stuff,” said Fernandez, but what happened was that consumers needed additional reasons to use the company’s service, and there weren’t enough events to drive demand.\n “I believe that the inventory management system we made was incredible and it will be a standard for retailers doing rentals going forward,” he said.\n As the company turned to retailers, the rental option became a way to generate revenue through additional products. “All the accessories that made the event even better,” said Fernandez. “Add-ons, try before you buy, experiential things that are just much more complete in a retail environment.”\n At Joymode, the problem was that the company was owning the inventory, which created a high fixed cost. “We never felt confident with the growth in LA to justify the expense of opening in another city,” Fernandez said. “ If we had cracked user acquisition in LA we would have rolled it out in a bunch of places.”\n Ultimately, Joymode members saved $50 million by using Joymode to rent products rather than buying them. In all, the company acquired 2,000 unique products — from beach and camping equipment to video games, virtual reality headsets to cooking appliances. On a given weekend, roughly 30,000 products would ship from the company’s warehouse to locations across Southern California.\n At XRC Labs, a firm launched in 2015 to support the consumer goods and brand space, Joymode will complement an accelerator that raises between $6 million and $9 million every two years and manages a growth fund that could reach $50 million in assets under management.\n For Anthos, the best corollary to Joymode’s business could be the rental business at Home Depot. “Home Depot’s rental business is over $1 billion per year,” Anthos said. “There’s going to be this enormous component of our society and for them renting will be not just a more sustainable but reasonable option. They’re going to want to rent because they don’t want to own it.”", "posttime": "2020-07-30 04:50:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "消费品,consumer", "title": "\n洛杉矶的消费品租赁服务Joymode出售给纽约市零售投资公司XRC Labs", "title_en": "\n\t\t\t\tLA’s consumer goods rental service, Joymode, sells to the NYC retail investment firm, XRC Labs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/29/las-consumer-goods-rental-service-joymode-sells-to-the-nyc-retail-investment-firm-xrc-labs/", "via": "", "real_tags": ["消费品", "consumer"]}, {"category": "", "categoryclass": "", "imagename": "08023797fa8762e6d9a69feab121ac08.jpg", "infoid": 1015033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了提高其大型商店的运营效率，中西部杂货商伍德曼市场(Woodman‘s Markets)今年计划在全链条范围内推出獾技术(Badger Technologies)的过道扫描机器人。\n肯塔基州尼古拉斯维尔的獾周二表示，这些自动推进的机器人将跟踪货架上的产品供应情况，核实价格，并为每个伐木人的地点提供超过10万件物品的精确位置数据，其中大多数物品的面积超过20万平方英尺。\n伍德曼(Woodman)门店的自动机器人部署工作正在进行中，预计到2020年底，这家总部位于威斯康星州简斯维尔和伊利诺伊州的零售商在威斯康星州和伊利诺伊州的18家门店都将投入运营。\n这些自行式机器人将跟踪产品的现货供应，核实价格，并在每个伐木工的位置提供超过10万件物品的精确位置数据。(图片由獾科技提供)。\n配备獾的零售洞察解决方案的漫游机器人将自动进行全店货架扫描，以检查缺货和价格合规性，从而消除了在伍德曼杂货店的巨大建筑面积上手动执行这些职责的任务。獾指出，机器人收集的数据还将使Woodman更深入地了解采购趋势，使其能够更好地预测和管理库存问题频繁的商品和供应商。\n伍德曼市场总裁克林特·伍德曼(Clint Woodman)在一份声明中表示：“伍德曼百货致力于以最优惠的价格提供种类最多的食品，而不像其他超市那样，销售从自行车到香蕉的各种商品，”伍德曼市场总裁克林特·伍德曼(Clint Woodman)在一份声明中表示。獾的机器人正在帮助我们完成这一使命，提供实时库存可见性，产生分析和可操作的数据洞察力，为我们的商业决策提供信息。“。\n獾零售洞察还监控产品位置，允许Woodman‘s将每日更新整合到其移动购物应用程序中，以帮助客户、在线订单拣选者和商店员工快速找到商品。Badger说，反过来，自动化的过程有助于与定价部门的合作，改善补货清单的优先顺序，并评估飞机平面图的合规性。\n捷普(Jabil)旗下獾技术公司(Badger Technologies)的首席执行官蒂姆·罗兰(Tim Rowland)表示：“大多数伍德曼门店的面积超过24万平方英尺，几乎是杂货业平均水平的6倍。”“我们的机器人不仅可以在几小时而不是几天内执行货架扫描，而且它们还可以收集关键数据，并与伐木工的移动购物应用程序连接起来，将客户体验提升到一个新的水平。”\n巴杰说，成像工具和神经网络使其自主机器人能够以超过95%的准确率检测脱销商品，并以超过90%的准确率识别不正确和错误定价的产品。该公司表示，这些机器人还能识别出一段4英尺长的过道内的当前产品位置，这段过道的长度通常超过100英尺。\n其他已经部署獾机器人的美国杂货零售商包括Ahold Delhaize USA‘s Giant/Martin’s和Stop&amp；Shop超市连锁店，它们使用这项技术来协助商店维护和安全，比如通过标记过道上的危险，比如溢出。", "note_en": "To drive operational efficiency at its large-format stores, Midwestern grocer Woodman’s Markets this year plans a chainwide rollout of aisle-scanning robots from Badger Technologies.\n  The self-propelled robots will track on-shelf availability of products, verify prices and deliver exacting location data for more than 100,000 items at each Woodman’s location, most of which occupy over 200,000 square feet, Nicholasville, Ky.-based Badger said Tuesday.\n   Deployments of the autonomous robots at Woodman’s stores are under way, and the units are expected to be in operation at all of the Janesville, Wis.-based retailer’s 18 locations in Wisconsin and Illinois by the end of 2020.\n     The self-propelled robots will track on-shelf availability of products, verify prices and deliver exacting location data for more than 100,000 items at each Woodman’s location. (Photo courtesy of Badger Technologies)\n    Equipped with Badger’s Retail InSight solution, the roving robots will automate storewide shelf scans for out-of-stocks and price compliance, eliminating the task of manually performing these duties across the huge floor space at Woodman’s grocery superstores. Badger noted that the data collected by the robots also will give Woodman’s a deeper view of purchasing trends, allowing it to better forecast and manage commodities and vendors with frequent stock issues.\n  “Woodman’s is committed to having the widest variety of groceries at the best prices, unlike other superstores that sell everything from bikes to bananas,” Clint Woodman, president of Woodman’s Markets, said in a statement. “Badger’s robots are helping us fulfill this mission with real-time inventory visibility that yields analytics and actionable data insights to inform our business decisions.”\n  Badger Retail InSight also monitors product locations, allowing Woodman’s to integrate daily updates into its mobile shopping app to help customers, online order pickers and store associates find items quickly. In turn, the automated process aids collaboration with pricing departments, improving the prioritization of replenishment lists and evaluating planogram compliance, Badger said.\n  “Most Woodman’s stores are over 240,000 square feet, nearly six times larger than the grocery industry average,” according to Tim Rowland, CEO of Badger Technologies, a division of Jabil. “Not only can our robots perform shelf scans in hours instead of days, but they collect and connect critical data with the Woodman’s mobile shopping app to take customer experiences to the next level.”\n  Badger said imaging tools and neural networks enable its autonomous robots to detect out-of-stock items with more than 95% accuracy and to identify incorrect and mispriced products with over 90% accuracy. The robots, too, discern current product locations within a four-foot section of aisles that typically extend more than 100 feet, the company said.\n  Other U.S. grocery retailers that  have deployed Badger’s robots include Ahold Delhaize USA’s Giant/Martin’s and Stop &amp; Shop supermarket chains, which use the technology to assist in store maintenance and safety, such as by flagging aisle hazards like spills.", "posttime": "2020-07-30 04:49:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,部署,markets", "title": "伍德曼市场将部署走廊漫游机器人", "title_en": "Woodman’s Markets to deploy aisle-roving robots", "transed": 1, "url": "https://www.supermarketnews.com/retail-financial/woodman-s-markets-deploy-aisle-roving-robots", "via": "", "real_tags": ["机器人", "部署", "markets"]}, {"category": "", "categoryclass": "", "imagename": "2eb175755fc05a830a377f62bf5dd6a2.jpg", "infoid": 1015031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从Konami启动了Metal Gear Solid的核裁军元游戏以来，已经过去了近五年，任务是让游戏社区清除玩家在游戏服务器上制造的每一枚核武器。本周，PS3版MGSV的玩家似乎达到了这个期待已久的目标，解锁了一个剪辑场景，祝贺他们在这一天，角色米勒大师说他认为…。永远不会来。\n现在，解除武装背后兴奋的玩家们正在等待科纳米是否会正式承认他们的成就，或许还会为这项已有五年历史的游戏解锁一些长期暗示的新内容。\nMGSV有组织的核裁军努力多年来一直断断续续，首先是通过现已停业的金属齿轮慈善子编辑网站，最近是通过金属齿轮反核子编辑网站。在那里，玩家们将一起讨论突袭MGSV在线服务器上拥有核武器的对手的前沿作战基地，以便窃取这些武器，然后解除这些武器的武装，以降低全球总数。\n但裁军者的兴趣一直是零星的，这一努力遭到了自私自利的参与者的持续反对，他们被鼓励创造核武器，作为游戏中的一种保护和威慑形式。无论是Konami&39；的官方统计(该公司多年前就停止公开更新)，还是通过GitHub服务器刮除器进行的非官方统计，都显示出历史上令人警醒的进步，要么是长期停滞的，要么是随着时间的推移正在积极倒退的，具体取决于平台和服务器(截至撰写本文时，PS4和Steam版本的游戏仍远未完全解除武装)。\n玩家兼独立虚拟现实游戏开发人员斯蒂夫·斯特弗普在接受Ars采访时表示，我认为大多数人在经历了这么长一段时间后都有点放弃了，乐趣已经被吸走了。我认为整件事都错过了一个很大的机会，人们在2015年真的很喜欢这个小游戏，但随着时间的推移，Konami对它的兴趣逐渐减弱，最终非常不愿意谈论它。\nPS3全面解除武装的最新冲刺始于3月份，当时Reddit的用户TheHong Horse以冠状病毒隔离为借口，启动了一个不和谐的服务器，在专注的玩家中组织了一场严肃的推动活动。一开始，什么也没做，因为我们根本没有数字。但慢慢地，我们的人数增长到60，70人...。为了这个目标，每个人都走到了一起，这是一件温暖的事情。我和其他几个成员实际上买了一份PS3[金属齿轮实心V]，只是为了帮忙。&#34；\n最终，大约20名核心裁军者建立了一个团体直接消息链，以协调他们的努力和日程安排。红马说：在过去的一个月里，我们所有人都同时解除了武装，这样我们就不必担心人们会让人数恢复到过去的水平。\nStefferp告诉Ars，这一次就像是一种正确的想法，让我们以一种心态把这件事做完，也许是因为这项运动即将迎来五周年纪念日。我想，团队合作又带回了那种乐趣。\n多亏了该组织的协调，最初的进展很快，根据GitHub Scrper的数据，PS3核武器数量在不到一周的时间里从7月10日的800多枚下降到100枚以下。然而，在这一点上，该组织遇到了红马公司怀疑的黑客，他们决心将核武器数量保持在较高水平。\n他说：有时候我们会把这个数字调到40个，只是为了让它立刻回到60个。因此，总而言之，这是非常有耐心的，也是不断尝试和犯错的。考虑到我们无法接触到那些用来对付我们的工具，我们能把它降到零真是个奇迹。\n撇开黑客不谈，正常的玩家也给解除武装的人带来了令人头疼的问题。我是……。Stefferp说，对PS3玩家的基础仍然如此活跃感到惊讶。我们认为拿走核武器很容易，但人们总是会报复(反击偷了他们核武器的玩家)。这是一台旧游戏机，但仍有相当多的人在使用。我觉得那很酷……。2006年的硬件，但仍然不是无关紧要的。&#34；\n解除武装的小组还面临着一组无敌的核武器，显然是由于游戏的服务器代码错误造成的。这些武器在服务器上显示为没有前方作战基地的玩家所有-这在逻辑上是不可能的，也可以防止其他人窃取和解除幻影武器的武装。\n我个人的理论是，这些人拥有核武器，然后重新设置他们的储蓄数据，这会将你的FOB重置为零，斯特弗普告诉Ars(斯特弗普怀疑，这就是为什么GitHub核武器计数器一直没有显示完整的降至零的时刻)。\n无论是否拥有幽灵核武器，这个裁军组织都惊讶地发现，本周他们的努力得到了回报，启动了一个宣布全面裁军的镜头。红马说：事情发生的那一天，我们知道我们已经很接近了，但我们并不认为我们真的会这么做。\n就Konami而言，它还没有完全确认社区的胜利。日本金属齿轮官方账号今天上午早些时候在推特上表示，日本时间7月28日起，PS3版本的MGSV：TPP发生了废核事件，但我们目前正在调查此事。\n在玩家庆祝过度之前，这项调查可能是有必要的。这是因为之前激活的全面解除武装切换场景模式在过去被判断为错误警报；2018年初针对PC玩家的激活一次，2018年末针对PS4玩家的激活一次。\n我们……。Konami说，可以确认这一事件是在2018年虚假的个人电脑裁军几天后，核武器数量没有达到零的情况下触发的。我们对给您带来的不便深表歉意，并向您保证，我们将调查此事，并采取必要措施避免今后发生这种情况。\nKonami的确认可能比简单的拍拍后背更重要。这是因为许多玩家确信，在游戏中解除武装是一种煽动事件，将导致新内容在游戏中被解锁。\n这一理论的证据是间接的，但很难忽视。例如，早在2016年，科纳米社区经理罗伯特·皮勒(Robert Peeler)就明确表示，他宁愿不规定核裁军会发生什么。皮勒现在不再为科纳米工作，他最近在推特上表示，他不确定科纳米是否会庆祝，也不确定如何庆祝，但如果是真的，那就太好了。就在那个5周年纪念日！&#34；\n虽然MGSV只有两章，但数据挖掘人员也发现了隐藏在游戏文件中的“第三章：和平”的标题卡。一些人将这与2016年Metal Gear Solid的创作者小岛秀夫(Hideo Kojima)发布的一系列三条神秘的三个主题的推文联系在一起。虽然没有发现隐藏在游戏光盘上的第三章和第三章的实际内容，但一些人怀疑Konami可能会使用确认的解除武装作为触发来修补内容。\n这样一种迟钝而漫长的解锁DLC的方法对于金属齿轮实体的创建者小岛秀夫来说并不是不合适的，他在某种程度上以古怪的游戏实验而闻名。Stefferp说：我认为裁军肯定是有原因的，否则科纳米不会在每次引发裁军时都进行调查。\n对于红马来说，他认为实际的触发因素可能包括解除武装，然后在8分钟的剪辑场景中保持服务器解除武装。然后，红马怀疑，可能会有一个秘密的动画片在播放，而不是奥克洛特告诉你，有人又在制造核武器了。\n就我个人而言，我只想要这些问题的答案。我希望关于MGSV的删减内容的古老的争论一劳永逸地结束，红马继续。就目前而言，我们的下一个目标是让核武器再次归零，但需要很长一段时间，以便进行一些试验。不过，目前我们都在休息。这是我们应得的。\n此外，他补充说，自从和平日以来，还有其他粉丝从我们停止的地方重新开始。很高兴看到这个游戏再次变得相关。", "note_en": "Nearly five years have passed since Konami  started  Metal Gear Solid V&#39;s nuclear-disarmament metagame, tasking the game&#39;s community with removing every single nuclear weapon created by players on the game&#39;s servers. This week, players on the PS3 version of  MGSV  seemed to reach that long-sought goal, unlocking a cut scene congratulating them on a day that character Master Miller says he &#34;thought... would never come.&#34;\n Now, the excited players behind the disarmament are waiting to see if Konami will officially acknowledge their achievement and perhaps unlock some long-hinted-at new content for the five-year-old game.\n  Organized  MGSV nuclear-disarmament efforts have been going in fits and starts for years, first via the now-defunct  Metal Gear Philanthropy subreddit and, more recently, in the  MetalGearAntiNuclear subreddit. There, players would join together to discuss raiding the Forward Operating Bases of nuclear-armed opponents on  MGSV&#39;s online servers in order to steal and then disarm those weapons to lower the total worldwide count.\n But interest from disarmers has been sporadic, and the effort has faced sustained opposition from self-interested players who are encouraged to create nuclear weapons as a form of in-game protection and deterrence. Both  Konami&#39;s  official counts (which the company stopped publicly updating years ago) and  unofficial counts via a GitHub server scraper show historical disarming progress either long-stalled or actively going backwards over time, depending on the platform and server (the PS4 and Steam versions of the game are still far from full disarmament as of this writing).\n  &#34;I think most people just kind of gave up and the fun had been sucked out of it after such a long time,&#34; player and indie VR game dev Stefferp told Ars over Discord. &#34;I think the whole thing is a big missed opportunity, people were really into this nuke &#39;minigame&#39; in 2015, but Konami&#39;s interest in it dwindled over time and were very reluctant to talk about it eventually.&#34;\n  The latest sprint down to full disarmament on the PS3 started back in March, when Reddit user TheHungHorse used the coronavirus quarantine as an excuse to  start a Discord server organizing a serious push among dedicated players. &#34;At first, nothing got done because we simply didn&#39;t have the numbers. But slowly, our numbers grew to 60, 70... It was heartwarming to have everyone come together for this goal. Me and a few other members actually bought a PS3 copy [of  Metal Gear Solid V] just to help out.&#34;\n Eventually, 20 or so hardcore disarmers started a group direct-message chain to coordinate their efforts and schedules. &#34;We all disarmed at the same time during this past month so we wouldn&#39;t have to worry about people bringing the numbers back up to what they used to be,&#34; TheHungHorse said.\n &#34;This time it was like a &#39;Right, let&#39;s just get this done&#39; mentality, maybe because the game is nearing its fifth anniversary,&#34; Stefferp told Ars. &#34;Teaming up brought that fun back, I suppose.&#34;\n Thanks to the group&#39;s coordination, initial progress was quick, with PS3 nuke counts dropping from over 800 on July 10 to below 100 in under a week, according to the GitHub scraper. At that point, though, the group ran into what TheHungHorse suspects were hackers determined to keep the nuke count high.\n &#34;Sometimes we&#39;d get the number to 40 just for it to immediately go back to 60,&#34; he said. &#34;So all in all it was a lot of patience and trial and error. Considering we don&#39;t have access to those tools used against us, it&#39;s really a miracle that we made it down to zero.&#34;\n  Hackers aside, normal players also caused headaches for the disarmers. &#34;I was... surprised by how active the PS3 player base still is,&#34; Stefferp said. &#34;We figured taking the nukes would be easy but people would retaliate all the time [striking back against the player who had stolen their nuclear weapon]. It&#39;s an old console but it&#39;s still in use by quite a few people. I think that&#39;s pretty cool... 2006 hardware but still not irrelevant.&#34;\n The disarming group was also faced with a set of &#34;invincible nukes&#34; apparently caused by an error in the game&#39;s server code. These weapons show up on the server as owned by players who don&#39;t have a Forward Operating Base—a logical impossibility that also prevents others from stealing and disarming the phantom weapons.\n &#34;My personal theory is those people had nukes, and then reset their save data, which resets your FOB back to zero,&#34; Stefferp tells Ars (this, Stefferp suspects, is why the GitHub nuke counter has still never shown a full &#34;drop to zero&#34; moment).\n  Phantom nukes or not, the disarmament group was surprised to find its efforts rewarded this week with the activation of  a cut scene announcing full disarmament. &#34;We knew we had gotten close on the day it happened, but we didn&#39;t think we&#39;d actually do it,&#34; TheHungHorse said.\n Konami, for its part, hasn&#39;t quite confirmed the community&#39;s victory just yet. &#34;A nuclear abolition event has occurred in PS3 version of  MGSV:TPP from July 28, Japan time, but we are currently investigating this matter,&#34; the official Japanese Metal Gear account  tweeted earlier this morning.\n That investigation may be warranted before players celebrate too much. That&#39;s because previous activations of the &#34;full disarmament&#34; cut scene in the past were later judged to be false alarms; once  for PC players in early 2018 and  again for PS4 players in late 2018.\n &#34;We... can confirm that the event was triggered while the nuke count hadn&#39;t reached zero,&#34; Konami said days after the false PC disarmament in 2018. &#34;We would like to apologize for the inconvenience and reassure you that we will investigate the matter as well as take the necessary action to avoid this in the future.&#34;\n  Konami&#39;s confirmation could be more important than a simple pat on the back, too. That&#39;s because many players are convinced that in-game disarmament is the inciting event that will lead to new content being unlocked in the game.\n The evidence for this theory is circumstantial but hard to ignore. Back in 2016, for instance, Konami Community Manager Robert Peeler  pointedly said he&#39;d &#34;rather not stipulate on what, if anything, happens with nuclear disarmament.&#34; Peeler, who no longer works for Konami,  recently tweeted that he&#39;s &#34;Not sure if/how Konami will celebrate, but if legit, that&#39;s great. Coming up on that 5th anniversary!&#34;\n Though  MGSV only has two chapters, data miners have also found a title card for &#34;Chapter 3: Peace&#34; hidden in the game&#39;s files. Some have linked that to  a series of three cryptic, three-themed tweets made by  Metal Gear Solid creator Hideo Kojima back in 2016. While no actual &#34;Chapter 3&#34; content has been found hiding on the game disc, some suspect Konami may use a confirmed disarmament as the trigger to patch the content in.\n  Such an obtuse, drawn-out method for unlocking DLC wouldn&#39;t be out of character for  Metal Gear Solid creator Hideo Kojima, who is  somewhat known for quirky gameplay experiments. &#34;I think there is definitely something to the disarmament thing, otherwise Konami wouldn&#39;t have to &#39;investigate&#39; it every time it triggered,&#34; Stefferp said.\n TheHungHorse, for his part, thinks the actual trigger might involve disarming and then keeping the server disarmed for the length of the eight-minute cut scene that runs. Then, TheHungHorse suspects, there might be &#34;a secret cutscene that plays instead of Ocelot telling you &#39;Welp, someone&#39;s making nukes again.&#39;&#34;\n &#34;For me personally, I just want answers to these questions. I want the age-old debate regarding  MGSV&#39;s cut content to end once and for all,&#34; TheHungHorse continued. &#34;For now our next goal is to get the nukes to zero again but for a prolonged period of time in order to test a few things out... For now though we&#39;re all taking a break. We deserve it.\n &#34;Plus there have been other fans picking up where we left off since &#39;Peace Day,&#39;&#34; he added. &#34;Glad to see this game being relevant again.&#34;", "posttime": "2020-07-30 04:26:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "mgsv,peaceniks,核武器", "title": "在幕后与解除MGSV核武器武装的和平主义者", "title_en": "Behind the scenes with the peaceniks who disarmed MGSV’s nukes", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/behind-the-scenes-with-the-peaceniks-who-disarmed-mgsvs-nukes/", "via": "", "real_tags": ["mgsv", "peaceniks", "核武器"]}]