[{"category": "", "categoryclass": "", "imagename": "f2dffa4f281f9a5779ba140e5f8690eb.png", "infoid": 1067755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Deno Deploy是一个在全球25个数据中心运行的多租户JavaScript引擎。该服务与V8虚拟机深入覆盖云基础架构，允许用户Toquickly脚本分布式HTTPS服务器。这部小说和＃34;无刀和＃34;系统从地上获得了现代JavaScript编程。\n 今天，我们正在发布部署测试版1.这是一系列甜菜糖中的第一个，将在未来几个月内进行。每个版本都将加可加质并完善编程模型。释放将在吉尔卡尔可用性公告中达到高潮，以便我们估计将在Q4 2021发生。\n 在过去的八个月里，我们一直在悄悄地设计这个托管的ServiceTo补充工作流程，其中丹诺Cli.doploy没有在AWS Lambda上运行，也没有使用CloudFlare工人;这是一个具有独特设计的重新系统。我们鼓励人们浏览rocinitial UI并探索这个新的JavaScript运行时。\n   可以在可能的丹麦提供浏览器 - 互相javascript API。 DerwareHello World示例将看起来不是不熟悉的浏览器程序员：\n  只需点击几下，部署将提供$ name.deno.dev子域并全球主持此服务器。客户将通过IPv4或IPv6通过Anycast释放到您最近的数据中心。\n   虽然可以通过Web UI完成一次性代码更新，但是我们希望通过部署Github应用程序附加GitHub存储库和更新代码。\n 每次推送到存储库都将部署到瞬间提供的计算机。在大多数情况下，部署在不到一秒钟内发生。在顶部，我们已经从头开始设计了系统，以尽量减少冷启动时间。 \n我们认为部署是最快的无服务系统。我们希望在未来版本中展示与业绩基准的这种大胆索赔。\n   部署支持打字，JSX，ES模块和远程HTTPS从“禁止箱”中导入。没有配置且没有构建步骤。部署本身理解JavaScript的Excomon扩展，就像丹诺CLI一样。\n 从＆＃34导入{h}; https：//x.lcas.dev/ [电子邮件受保护] /mod.js& n34 ;;import {rendertostring} from＆＃34; https：//x.lcas.dev/ [电子邮件保护] /ssr.js& l#4 ;;;函数app（）{return（＆lt; html＆gt;＆lt; h1＆gt; hell; h11＆gt;＆lt; / h10＆gt;＆lt; / html;）;} addeventlistener（＆＃34; fetch＆＃34;（事件）=＆gt; {const html = rendertostring（＆lt; app /＆gt;）; event.respondwith（新响应（html，{{＆＃34; content-类型＆＃34 ;:＆＃34; text / html; charset = utf-8＆＃34;}，}）;}）;\n  广播沟道APIIS用于标签之间的实时通信的浏览器API。此API还为服务器端JavaScript表示令人惊讶的非常适合：\n  在丹诺部署中，广播通道是一种在不同数据中心区域中的边缘工作者之间进行通信的方式。它与Zeromq，RabbitMQ和Redis等软件的解决方案空间重叠。\n BroadcastChannel在聊天和游戏等实时应用中很有用。在此示例中，广播客户机被视为构建一个简单的聊天系统。您可以在https://chat.denoland.org上尝试。\n   只部署只处理加密流量。默认情况下，所有部署都会给出deno.dev子域。其中还可以在丹诺部署和＃39; sanycast IP地址点指向其他域名;部署将自动配置TLS证书Let＆＃39; s加密。对于可能想要使用通配符的更高级用户，部署允许自定义证书： \n新鲜是一个实验网络框架，可让您快速构建Don＆＃39; t需要构建步骤的高度动力项目。 新鲜拥抱从未像以前一样拥抱了异教徒。 编写JSX组件，使其在EdgeJust-the-time上呈现，然后使用客户端侧JS增强它，以获得很大的交互性。  Fresh没有构建步骤 - 您编写代码，将其部署到拒绝部署，从那时起，一切都由框架处理。  丹诺部署在测试期间的所有用户都可以免费到所有用户。如果你试用，请告诉我们您通过在反馈存储库上开发问题的想法。  我们计划在即将到来的时间内将一系列测试版置于丹诺部署我们添加功能。 我们希望丹诺部署进入一般可用性内含物2021。 ", "note_en": "Deno Deploy is a multi-tenant JavaScript engine running in 25 data centers across the world. The service deeplyintegrates cloud infrastructure with the V8 virtual machine, allowing users toquickly script distributed HTTPS servers. This novel &#34;serverless&#34; system isdesigned from the ground up for modern JavaScript programming.\n Today we are releasing Deploy Beta 1. This is the first in a series of betareleases that will be made over the coming months. Each release will addfeatures and refine the programming model. The releases will culminate in aGeneral Availability announcement that we estimate will happen in Q4 2021.\n Over the past eight months, we have been quietly designing this hosted serviceto supplement workflows with  the open source Deno CLI.Deploy does not run on AWS Lambda nor does it use Cloudflare Workers; this is anew system with a unique design. We encourage people to look past the roughinitial UI and explore this new JavaScript runtime.\n   Where possible Deno provides browser-compatibile JavaScript APIs. The followinghello world example will look not unfamilar to browser programmers:\n  With  a few clicks, Deploy will provision a $NAME.deno.dev subdomain and host this server world-wide. Clients will berouted to our nearest data center via Anycast over IPv4 or IPv6.\n   Although one-off code updates can be done through the web UI, we expect mostusers to attach a Github repository and update code through the Deploy Github App.\n Every push to a repository is deployed to an instantaneously provisionedsubdomain. In most cases, deployments happen in less than a second. On top ofthat, we have designed the system from the ground up to minimize cold-starttime.\n We believe Deploy is the fastest serverless system available. We hope to naildown this bold claim with performance benchmarks in future releases.\n   Deploy supports TypeScript, JSX, ES Modules, and remote HTTPS imports out of thebox. There is no configuration and no build step. Deploy understands thesecommon extensions of JavaScript natively, just like the Deno CLI.\n import { h } from &#34;https://x.lcas.dev/ [email protected]/mod.js&#34;;import { renderToString } from &#34;https://x.lcas.dev/ [email protected]/ssr.js&#34;;function App() { return ( &lt;html&gt; &lt;body&gt; &lt;h1&gt;Hello world&lt;/h1&gt; &lt;/body&gt; &lt;/html&gt; );}addEventListener(&#34;fetch&#34;, (event) =&gt; { const html = renderToString(&lt;App /&gt;); event.respondWith( new Response(html, { headers: { &#34;content-type&#34;: &#34;text/html; charset=utf-8&#34; }, }), );});\n  The BroadcastChannel APIis a browser API for real-time communication between tabs. This API also turnsout to be surprisingly well-suited for server-side JavaScript:\n  In Deno Deploy, a BroadcastChannel is a way of communicating between edgeworkers in different data center regions. It overlaps the solution space ofsoftware like ZeroMQ, RabbitMQ, and Redis.\n BroadcastChannel is useful in real-time applications like chats and games. In this example, BroadcastChannel isused to build a simple chat system. You can try it out at https://chat.denoland.org.\n   Deploy only handles encrypted traffic. By default all deployments are given a deno.dev subdomain. One may also point other domain names at Deno Deploy&#39;sanycast IP addresses; Deploy will automatically provision a TLS certificateusing Let&#39;s Encrypt. For more advanced users who might want to use a wildcardcertificate, Deploy allows custom certificates:\n   Fresh is an experimental web framework that lets you quickly build highlydynamic projects that don&#39;t require a build step. Fresh embraces isomorphicJavaScript like never before. Write a JSX component, have it render on the edgejust-in-time, and then enhance it with client side JS for great interactivity.\n Fresh does not have a build step - you write your code, deploy it to DenoDeploy, and from there everything is handled by the framework.\n    Deno Deploy is free to all users during Beta 1. If you tryit out, please tell us what you think by opening an issue on our feedback repository.\n We plan to make a series of beta releases to Deno Deploy over the coming monthsas we add features. We expect Deno Deploy to enter General Availability inlate 2021.", "posttime": "2021-06-24 00:45:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ye,deploy,部署", "title": "在p ye 1 ", "title_en": "Deno Deploy Beta 1", "transed": 1, "url": "https://deno.com/blog/deploy-beta1", "via": "", "real_tags": ["ye", "deploy", "部署"]}, {"category": "", "categoryclass": "", "imagename": "091fd877fdc457028eb422ac27abd1f0.png", "infoid": 1067754, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们很乐意宣布我们的C系列资金。这是我们公司，客户和社区在我们的使命中建立更快的网站的主要里程碑。\n   上周，我们与谷歌Chrome团队合作，我们托管了我们的第二个Next.js社区活动。我们有超过65,000多个开发人员，设计师，产品经理，技术领导者加入我们谈论网络的未来。\n 在过去的六个月中，我们在Vercel Edge网络上的网站和应用程序中的流量增加了一倍，并且在Vercel Edge网络和每周部署中的数据。我们在NPM下下载下一个50％的下载，从4.1米到6.2米，alexa前10,000名中下一页的主页数量增长了50％。与此同时，我们的企业客户群推出了两倍。\n  所有尺寸和垂直的公司，从既定的行业领导者到开创性的初创公司，正在选择Vercel来构建和托管他们的网站。\n 像Hashicorp这样的公司，现代云天然工具的发明者，选择Vercel。像GitHub一样的公司，领先的源代码托管解决方案，选择Vercel。全球2000家企业，如IBM，麦当劳＆＃39;以及Facebook，选择Vercel。超缩放的独角兽像Patreon，Scale，以及其他所有选择Vercel。\n 这些公司了解，建筑伟大的网站是一个团队运动，不仅需要最好的托管，最好的开发者工具以及最好的开发人员体验，而且很多，赋予了跨越企业的利益攸关方的能力参与建立最佳的人可能的最终用户体验。\n 构建网站的方式正在发生变化。 Vercel，其客户及其社区正在领先地位。 \n我们的使命是使团队衷心发展，合作，瞬间发货。 我们很感激沿途的支持。 感谢您的客户，社区，合作伙伴和员工，以使我们的成长和势头成为可能。  Vercel增加了额外的1.02亿美元的投资，估值超过1亿美元。 该系列C轮是预先提出的6100万美元。 该轮由现有的投资者基岩资本领导，参与其他现有投资者Accel，CRV，Geodesic Capital，Greenoaks Capital和GV。 新投资者包括8VC，Flex Capital，GGV，Latacora，Salesforce Ventures和Tiger Global。 ", "note_en": "Today, we’re happy to announce our Series C funding. This is a major milestone for our company, customers, and community in our mission to build a faster web, together.\n   Last week, we hosted our second Next.js community event in partnership with the Google Chrome team. We had over 65,000 developers, designers, product managers, and technology leaders join us to talk about the future of the web.\n In the past six months, we&#39;ve doubled traffic to the sites and apps on the Vercel edge network and quadrupled weekly deployments. We saw a 50% increase in Next.js downloads on npm, from 4.1M to 6.2M, and the number of homepages using Next.js in the Alexa top 10,000 has grown 50%. At the same time, we&#39;ve tripled our enterprise customer base.\n  Companies of all sizes and verticals, from established industry leaders to pioneering startups, are choosing Vercel to build and host their websites.\n Firms like Hashicorp, the inventors of modern cloud-native tooling, choose Vercel. Firms like GitHub, the leading source code hosting solution, choose Vercel. Global 2000 Enterprises like IBM, McDonald&#39;s, and Facebook, choose Vercel. Hyper-scaling unicorns like Patreon, Scale, and others all choose Vercel.\n These companies understand that building great websites is a team sport that requires not only the best hosting, the best developer tools, and the best developer experience, but also, crucially, the ability to empower stakeholders from across the business to participate in building the best possible end-user experience.\n The way websites are built is changing. Vercel, its customers, and its community are leading the way.\n Our mission is to empower teams to fearlessly develop, collaborate, and instantly ship delightful web experiences. We are grateful for the support along the way. Thank you to our customers, community, partners, and employees for making our growth and momentum possible.\n   Vercel has added an additional $102 million of investment at a valuation greater than $1BN. This Series C round is in addition to the $61 million previously raised. The round is led by existing investor   Bedrock Capital  with participation from other existing investors   Accel ,   CRV ,   Geodesic Capital ,   Greenoaks Capital , and   GV . New investors include   8VC ,   Flex Capital ,   GGV ,   Latacora ,   Salesforce Ventures , and   Tiger Global .", "posttime": "2021-06-24 00:45:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "继续,building", "title": "Vercel  - 每次继续构建下一个网络的10200万美元 ", "title_en": "Vercel – $102M to Continue Building the Next Web, Together", "transed": 1, "url": "https://vercel.com/blog/series-c-102m-continue-building-the-next-web", "via": "", "real_tags": ["继续", "building"]}, {"category": "", "categoryclass": "", "imagename": "7e8b651199871a223f7435eed52f9be1.jpg", "infoid": 1067753, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warren Buffett周三表示，他将捐赠41亿美元的伯克希尔Hathaway股票到五个基金会，并且他将作为票据＆amp的受托人辞职; Melinda Gates基金会。\n 今年的捐款标志着这位90岁的亿万富翁投资者的中途，于2006年，他承诺通过向比尔＆amp的年度礼物赠送他的所有伯克希尔股; Melinda Gates基金会，苏珊汤普森巴菲特基金会，谢尔伍德基金会，Howard G. Buffett基金会和诺沃基金会。后来，巴菲特拥有474,998伯克郡的A股。今天，他表示，他拥有238,624股，价值约1000亿美元。\n   “今天是我的里程碑，”巴菲特在一份声明中说。 “在2006年，我承诺分发所有伯克希尔海瑟薇股票 - 超过99％的净值 - 慈善事业。随着今天的41亿美元分配，我在那里。“\n  随着慈善组织面临其两位创始人离婚的骚动时间，巴菲特辞职。\n “多年来，我一直是受托人 - 一个非活动受助者 - 只有一个我的资金收件人，票据和梅林达盖茨基金会（BMG）。我现在正在辞职，就像我在伯克希尔以外的所有公司委员会所做的那样，“巴菲特说。 “BMG的首席执行官是Mark Suzman，这是一个最近的近期选择，谁得到了我的全力支持。我的目标是与基础同步100％，我的身体参与绝不需要实现这些目标。“\n 比尔盖茨，联合创始人和前任首席执行官和他的妻子Melinda French Gates，宣布了5月的离婚。这对夫妇和巴菲特一起是给予承诺的创作者，这是一个需要参与者赠送超过一半财富的计划。\n   巴菲特表示，在多年来，他的16个年度贡献超过了五年的年度在支付时价值410亿美元。巴菲特是伯克希尔最大的股东，根据事实，拥有约39％的班级股份。 \n伯克希尔一股股票反弹超过20％的人在2021年击中了历史新高，因为许多企业集团的企业恢复了比大流行击中的预期更好。  “我很乐观。 虽然反对者比比皆是 - 因为他们在整个生活中，美国最肯定的日子肯定是未来的，“巴菲特说。 “慈善事业将继续将人才与财政资源配对。 所以，也将是商业和政府。 每个力都具有特殊的优点和缺点。 结合，他们将使世界变得更好 - 一个更好的地方 - 对于后代。“ ", "note_en": "Warren Buffett said Wednesday he will donate $4.1 billion worth of Berkshire Hathaway shares to five foundations, and that he will resign as the trustee at the Bill &amp; Melinda Gates Foundation.\n This year’s donation marked the halfway point for the 90-year-old billionaire investor, who in 2006 pledged to give away all of his Berkshire shares through annual gifts to Bill &amp; Melinda Gates Foundation, Susan Thompson Buffett Foundation, Sherwood Foundation, Howard G. Buffett Foundation and NoVo Foundation. Back then, Buffett owned 474,998 Berkshire A shares. Today, he said he owns 238,624 shares, worth about $100 billion.\n   “Today is a milestone for me,” Buffett said in a statement. “In 2006, I pledged to distribute all of my Berkshire Hathaway shares — more than 99 percent of my net worth — to philanthropy. With today’s $4.1 billion distribution, I’m halfway there.”\n  Buffett’s resignation as Gates Foundation trustee comes as the charitable organization faces a tumultuous time with the divorce of its two founders.\n “For years I have been a trustee — an inactive trustee at that — of only one recipient of my funds, the Bill and Melinda Gates Foundation (BMG). I am now resigning from that post, just as I have done at all corporate boards other than Berkshire’s,” Buffett said. “The CEO of BMG is Mark Suzman, an outstanding recent selection who has my full support. My goals are 100 percent in sync with those of the foundation, and my physical participation is in no way needed to achieve these goals.”\n Bill Gates, co-founder and former CEO of Microsoft, and his wife, Melinda French Gates, announced their divorce in May. The couple, along with Buffett, were creators of the Giving Pledge, a program that requires participants to give away more than half of their wealth.\n   Buffett said his 16 annual contributions to the five foundations over the years were worth $41 billion when disbursed. Buffett is Berkshire’s largest shareholder, owning about 39 percent of the Class A shares, according to FactSet.\n  Berkshire A shares have rebounded more than 20 percent to hit a record high in 2021 as many of the conglomerate’s business recovered better than expected from the pandemic hit.\n “I’m optimistic. Though naysayers abound — as they have throughout my life — America’s best days most certainly lie ahead,” Buffett said. “Philanthropy will continue to pair human talent with financial resources. So, too, will business and government. Each force has its particular strengths and weaknesses. Combined, they will make the world a better place — a much better place — for future generations.”", "posttime": "2021-06-24 00:45:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "buffett,gates,基金会", "title": "Warren Buffett赠送另外4.1亿美元，辞职 ", "title_en": "Warren Buffett gives away another $4.1B, resigns at Gates Foundation", "transed": 1, "url": "https://www.nbcnews.com/business/business-news/warren-buffett-gives-away-another-4-1-billion-resigns-trustee-n1272094", "via": "", "real_tags": ["buffett", "gates", "基金会"]}, {"category": "", "categoryclass": "", "imagename": "f7a3c345752d9ea2b116ea5a81192d75.jpg", "infoid": 1067752, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你知道你有多少钱_actly _得到？ 了解如何监控该源的开源“互联网PI”项目，我在GitHub上进行了！B ... ", "note_en": "Do you know how much bandwidth you're _actually_ getting? Find out how to monitor that and more with the open source 'Internet Pi' project I have on GitHub!B...", "posttime": "2021-06-24 00:45:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lying,actly", "title": "您的ISP正在躺着：用PI监控您的互联网 ", "title_en": "Your ISP is lying:  Monitor your Internet with a Pi", "transed": 1, "url": "https://www.youtube.com/watch?v=rIUc4C4TXog", "via": "", "real_tags": ["lying", "actly"]}, {"category": "", "categoryclass": "", "imagename": "4540a8fb88fd32a8e402ed47396759fc.jpg", "infoid": 1067751, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HMD＆＃39;最新的诺基亚手机击中美国是诺基亚G20。这可能听起来像是世界智能手机领导人的国际会议，但它＆＃39;这是7月1日抵达美国的实际设备，只需199美元。对于这个低价点，手机没有看起来很糟糕。\n 规格包括6.5英寸，1600×720液晶; Mediatek G35 SoC; 4GB的RAM; 64GB的储存;和5050 mah电池。 HMD表示全部充电将提供＆＃34;为期三天的电池寿命。＆＃34;有10 W收费的SA USB-C端口，一个3.5毫米耳机插孔，侧指纹读卡器，MicroSD插槽，NFC，Wi-Fi，最高可达802.11n，以及通常的硬件助手按钮和硬件电源和音量按钮。\n    当没有Qualcomm处理器的Android手机在美国推出时，它非常值得注意。 G20获取MEDIATEK G35 SOC，一个12 nm芯片，带有八个ARM皮质A53核心-4，在2.3 GHz和1.8 GHz下。等效的高通Soc将是Snapdragon 439的东西。\n 嵌入手机＆＃39; s塑料背部是一个薄的相机凹凸，包含四个摄像头：48 mp主摄像头，5 mp广角，一个2 mp＆＃34;深度＆＃34;相机，以及2 MP＆＃34;宏＆＃34;相机。这似乎是一个200美元的电话太多的相机（你考虑过一个好的相机吗？），这2个MP射击者通常只是为了看起来和营销目的。\n 该手机配有Android 11，HMD承诺两年的主要操作系统更新以及三年的每月安全更新。我们可以＆＃39; t承诺更新将快速到达，但在200美元，这仍然是您可以获得的最佳更新策略。诺基亚＆＃39;最接近的美国竞争是略昂贵的oneplus nord nord nord nord nord nord nord nord nord nord nord。 240美元，您可以获得一个良好的升级到90 Hz屏幕，但您还获得了一个主要的OS更新的缺陷更新计划，以及三年的非月度半定期安全更新。处理定价图表，您的下一个主要标志性标志将是349美元的老化像素4a。 ", "note_en": "HMD&#39;s latest Nokia phone to hit the US is the Nokia G20. That might sound like an  international meeting of world smartphone leaders, but it&#39;s an actual device arriving in the US on July 1 for just $199. For this low price point, the phone doesn&#39;t look bad.\n The specs include a 6.5-inch, 1600×720 LCD; a Mediatek G35 SoC; 4GB of RAM; 64GB of storage; and a 5050 mAh battery. HMD says a full charge will provide &#34;three-day battery life.&#34; There&#39;s a USB-C port for 10 W charging, a 3.5 mm headphone jack, a side fingerprint reader, a microSD slot, NFC, Wi-Fi up to 802.11n, and a hardware Google Assistant button, along with the usual power and volume buttons.\n    It&#39;s notable when an Android phone launches in the US without a Qualcomm processor. The G20 gets the Mediatek G35 SoC, a 12 nm chip with eight ARM Cortex A53 cores—four at 2.3 GHz and four at 1.8 GHz. An equivalent Qualcomm SoC would be something like the  Snapdragon 439.\n Embedded in the phone&#39;s plastic back is a thin camera bump containing four cameras: a 48 MP main camera, a 5 MP wide-angle, a 2 MP &#34;depth&#34; camera, and a 2 MP &#34;macro&#34; camera. That seems like way too many cameras for a $200 phone (have you considered  one good camera instead?), and these 2 MP shooters are usually just for looks and marketing purposes.\n The phone comes with Android 11, and HMD promises two years of major OS updates and three years of monthly security updates. We can&#39;t promise the updates  will arrive quickly, but at $200, this is still the best update policy you can get. Nokia&#39;s closest US competition is the slightly more expensive  OnePlus Nord N200. For $240, you get a nice upgrade to a 90 Hz screen, but you also get a deficient update plan of one major OS update and three years of non-monthly, semi-regular security updates. Working up the pricing charts, your next major landmark would be  the aging  Pixel 4a at $349.", "posttime": "2021-06-24 00:05:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,day", "title": "诺基亚G20为199美元来到美国，包装“3天”电池寿命 ", "title_en": "The Nokia G20 comes to the US for $199, packs a “3-day” battery life", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/the-nokia-g20-launches-in-the-us-for-199-packs-a-mediatek-soc/", "via": "", "real_tags": ["美国", "day"]}, {"category": "", "categoryclass": "", "imagename": "a23d1edb8326e532f4f1e324c10b8191.jpeg", "infoid": 1067750, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过联邦法官的抗议活动和被称为“应受谴责”之后，休斯顿的医院系统的153名工人周二拒绝接种疫苗接种疫苗 -  19。\n  休斯顿卫理公会医院系统于6月7日举办了178名员工，未经达到医院系统，未达到医院系统，疫苗接种任务将于4月1日举行。未付的为期两周的暂停基本上是员工＆＃39;在面对终止之前，最后机会接种疫苗。在此期间，一些工人“符合政策”，一家医院发言人周二告诉休斯顿纪事。但是153岁没有，在他们的暂停期间没有退出或在周二被解雇。休斯顿卫理公会首席执行官Marc Boom先前已注意到员工中的一封信，其中178名暂停工人中的27份已收到一剂的Covid-19疫苗进入暂停。\n 由反对任务的一小组工人的公开抗议的辞职和征兵是公开抗议的，这些工人在很大程度上是成功的。根据繁荣发布的数字，大约97％的医院近26,000名员工完全接种疫苗，而约有2.4％的百分之大约有效豁免或被授予怀孕或其他原因延期。\n  尽管如此，少数群体遭到终身反对的任务。他们在医院设施外面的抗议活动，117名工人在联邦法院提出了诉讼。员工声称，任务是非法的，并迫使他们成为“未经批准的药物”的临床试验中的“人类受试者”。在他们更加令人意义的索赔中，他们据称，该任务违反了纽伦堡·守则，这是一套10项伦理原则，用于对纳粹暴行进行的人类试验进行。在提出索赔时，医院工作人员将疫苗要求与第二次世界大战期间在集中营中进行的恐怖医学实验中的疫苗要求。\n    美国地区法官林恩休斯称争论“责任”并圆周拒绝医院劳工的其他索赔。在6月12日发布的五页裁决中，休斯法官驳回了此案，写作工人包括虚假索赔，“歪曲事实，”误解法，否则为案件提供无效的论据。他拒绝了医院工作人员在审判中的人类受试者的建议，并表示医院系统的领导者只是“试图做出他们的生命，而不会给他们Covid-19病毒。”他还指出，5月28日，联邦平均就业机会委员会确定雇主可以在合理的住宿提供合理的住宿时授权Covid-19疫苗接种。\n 由护士詹妮弗桥领导的117名员工已经上诉第五届美国巡回院的上诉法院解雇。\n 桥梁是一位在医院工作超过六年的护士，并在大流行期间在冠状病毒单位工作，旧的联邦新闻界，她星期二和一些志同道合的同事一起被解雇。 \n“我们都知道我们今天被解雇了，”桥梁告诉了AP。 “除非我们拍摄了那次回来，否则我们知道，我们今天被解雇了。 没有IFS，ANDS或但BUTS。“  她还告诉过公众，星期二是她的第一天，这是一家公司的新工作，该公司将把她和其他未被移民的护士送到人民家庭提供护理的人。 ", "note_en": "After staging weeks of protest and being called “ reprehensible” by a federal judge, 153 workers of a Houston-based hospital system lost their jobs Tuesday for refusing to get vaccinated against COVID-19.\n  Houston Methodist hospital system had placed  178 employees on a two-week, unpaid suspension on June 7 for failing to meet the hospital system&#39;s vaccination mandate, which it had set on April 1. The unpaid two-week suspension was essentially the employees&#39; last chance to get vaccinated before facing termination. During that time, some of the workers “became compliant with the policy,” a hospital spokesperson  told the Houston Chronicle Tuesday. But 153 did not and either quit during their suspension or were fired on Tuesday. Houston Methodist CEO Marc Boom had previously noted in a letter to employees that 27 of the 178 suspended workers had received one dose of a COVID-19 vaccine going into the suspension.\n The resignations and firings end weeks of public protest by the small group of workers who objected to the mandate, which was otherwise largely successful. According to numbers released by Boom, about 97 percent of the hospital’s nearly 26,000 employees are fully vaccinated, while about 2.4 percent received a valid exemption or were granted a deferral for pregnancy or other reasons.\n  Still, the minority fought back vigorously against the mandate. They staged protests outside hospital facilities, and 117 of the workers filed a lawsuit in federal court. The employees claimed that the mandate is unlawful and forced them to be “human subjects” in a clinical trial of an “unapproved drug.” Among their more startling claims, they alleged that the mandate violates the Nuremberg Code, a set of 10 ethics principles for conducting human trials written in response to Nazi atrocities. In making the claim, the hospital staff likened the vaccine requirement to horrifying medical experiments carried out in concentration camps during World War II.\n    US District Judge Lynn Hughes called the argument “reprehensible” and roundly rejected the hospital worker’s other claims. In  a searing five-page ruling issued on June 12, Judge Hughes dismissed the case, writing that the workers included false claims, “misrepresented facts,” misconstrued laws, and otherwise provided invalid arguments in the case. He rejected the suggestion that hospital staff were human subjects in a trial and said that the hospital system’s leaders were merely “trying to do their business of saving lives without giving them the COVID-19 virus.”  He also noted that on May 28, the federal Equal Employment Opportunity Commission determined that employers can mandate COVID-19 vaccination if they give reasonable accommodations.\n The 117 employees, led by nurse Jennifer Bridges, have already appealed the dismissal to the 5th US Circuit Court of Appeals.\n Bridges, a nurse who had worked at the hospital for over six years and had worked in the coronavirus unit during the pandemic, t old the Associated Press that she was fired Tuesday along with some of her like-minded colleagues.\n “We all knew we were getting fired today,” Bridges told the AP. “We knew unless we took that shot to come back, we were getting fired today. There was no ifs, ands, or buts.”\n She also told the AP that Tuesday was her first day at a new job with a company that will send her and other unvaccinated nurses into people’s homes to provide care.", "posttime": "2021-06-24 00:05:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "医院,workers", "title": "拒绝Covid-19疫苗后，153名医院工人退出或被解雇 ", "title_en": "153 hospital workers quit or were fired after refusing COVID-19 vaccine", "transed": 1, "url": "https://arstechnica.com/science/2021/06/153-hospital-workers-quit-or-were-fired-after-refusing-covid-19-vaccine/", "via": "", "real_tags": ["医院", "workers"]}, {"category": "", "categoryclass": "", "imagename": "b0bf50c87337f2d7825cb86a3e48a9f9.jpg", "infoid": 1067748, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "acryl数据被称为公司，今天推出了900万美元的8 vc，其中LinkedIn和Insight也参与，帮助其他公司使用该工具进行自己的大数据需求。\n Acryl数据的推动来自大数据，并且专门能够组织，理解，使得大多数分散的大数据拖网（有来自和生活在多个地方的信息，而是雪花，或者Wooker或其他一些完全的）是一个挑战，影响任何在其运营中具有大型数字组件的组织。传统上，大型科技公司一直在解决该问题的一些更具创新性，其中一些也开放了他们的技术，以使其别人可用。\n  Acryl创始人的突破 - 在他们开始公司之前发现，当他们仍然在各自的大科技公司工作时 - 是实现元数据持有组织那大数据信息的关键。\n “关于元数据的有趣部分实际上是它已成为一个大数据问题，”Chirshanka Das说，City and Ceo和CTO的Airbnb Alum的Airbnb Alum）联合起来。 “所以所有的数据基础设施DNA都在建立大规模的数据收集，流传输，索引，搜索方面，这些都需要可以实际扩大现代企业的需求的元数据管理解决方案。即，我认为，真的是我们的秘密酱，我们已经能够建立一个元数据平台，它采用了右派的所有最佳实践，并将其应用于实现元数据基础架构。“\n 作为一个开源项目，DataHub已经提出了一些重要的牵引力。除了LinkedIn本身，Expedia，Saxo Bank，Klarna和许多其他人都使用该框架 - 基本上是一个广义的元数据搜索和发现工具 - 建立自己的元数据图，以将它们的各种数据实体连接在一起。该项目总共超过了3,200个GitHub星级，拥有超过100个贡献者。\n 与其他开源商业化工作相同的acryl数据正在建立一个工具集，这将使该框架更容易扩展并在更多用例中应用，特别是在这些公司以其自身构建这些实现的那些公司。它说，首先，将是一个基于Airbnb DataPortal的设计学习的数据目录。 LinkedIn将与Acryl数据一起合作，以及未来产品的更广泛的开源社区。\n “LinkedIn的全球经济的独特观点为我们提供了通过数据驱动的洞察和AI动力产品来改善全球数亿人的经济成果。为了发现合适的数据，导航我们的研究人员和工程师每天使用的成千上万的派生数据集，我们依赖于DataHub，“Linkedin的Igor Perisic表示，在一份声明中。 “我们很高兴与Acryl数据合作，继续向他们推进DataHub。” \n这个机会是一个很大的机会。 去年同一空间中的竞争对手的竞争对手筹集了23亿美元的估值。 另一个劝告本月早些时候的价值为12亿美元。 但是对于创新的很多空间剩下，看到那些在空间中建造了一些最基本的工具作为企业家本身来满足挑战的人们很有意思。  “现代数据堆栈需要在Metadata如何管理的基本重新思考，”Insight Partners Md George Mathew，乔治Mathew，在一个语句中。 “我们相信需要下一代实时的元数据平台，并且Acryl数据是基于与DataHub的突破性工作领导此转换的最佳团队。” ", "note_en": "Acryl Data, as the company is called, is launching today with $9 million led by 8VC, with LinkedIn and Insight also participating, to help other companies use the tools for their own big data needs.\n The impetus for Acryl Data comes from the salient fact that big data, and specifically being able to organize, understand, make the most of fragmented big data troves (with information coming from and living in multiple places, be it Snowflake, or Databricks, or Looker, or something else altogether), is a challenge that impacts any organization that has a large digital component in its operations. Traditionally, big tech companies have been some of the more innovative in addressing that issue, with a number of them also open sourcing their technology to make it usable by others.\n  The breakthrough for the founders of Acryl — discovered before they started the company, when they were still working at their respective big tech companies — was the realization that metadata held the key to organizing that big data information.\n “The interesting part about metadata is actually that it has become a big data problem,” said Shirshanka Das, the LinkedIn alum who is CEO and co-founded the company with Swaroop Jagadish (the Airbnb alum who is CTO). “And so all of the data infrastructure DNA that we have, in terms of building large-scale data collections, streaming, indexing, searching — those all need metadata management solutions that can actually scale to the demands of the modern enterprise. That, I think, is really our secret sauce, that we’ve been able to build a metadata platform that takes in all the best practices of doing data infrastructure right, and applied it to doing metadata infrastructure.”\n As an open source project, DataHub has picked up some significant traction. In addition to LinkedIn itself, Expedia, Saxo Bank, Klarna and many others are using the framework — essentially a generalized metadata search and discovery tool — to build their own metadata graph to connect their various data entities together. Altogether the project has racked up  over 3,200 GitHub stars and has more than a 100 contributors.\n Acryl Data, like other open source commercialization efforts, is setting out to build a toolset that will make that framework easier to scale and apply in more use cases, particularly at those companies that might lack the resources to build these implementations on their own. The first of these, it says, will be a data catalogue that is based on design learnings from Airbnb’s Dataportal. LinkedIn will be collaborating with Acryl Data, along with the wider open source community, on future products.\n “LinkedIn’s unique view of the global economy provides us with the opportunity to improve economic outcomes for hundreds of millions of people around the world through data-driven insights and AI-powered products. To discover the right data, navigate the tens of thousands of derived datasets that our researchers and engineers use every day and manage them well, we rely on DataHub,” said Igor Perisic, Chief Data Officer at LinkedIn, in a statement. “We are excited to partner with Acryl Data to continue to advance DataHub with them.”\n The opportunity is a big one.  Collibra, a competitor in the same space, last year raised a round at a $2.3 billion valuation. Another, Alation, was  valued at $1.2 billion earlier this month. But with a lot of space for innovation left, it’s interesting to see the people who built some of the most foundational tools in the space getting stuck in as entrepreneurs themselves to meet the challenge.\n “The modern data stack needs a fundamental rethink in how metadata is managed,” said Insight Partners MD George Mathew, in a statement. “We believe a next-generation, real-time metadata platform is needed, and Acryl Data is the best team to lead this transformation based on their groundbreaking work with DataHub.”", "posttime": "2021-06-24 00:04:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,linkedin,数据", "title": "Acryl数据，商业化LinkedIn的元数据工具DataHub，从8VC，LinkedIn和Insight 900万美元出现了Htealth ", "title_en": "\n\t\t\t\tAcryl Data, commercializing LinkedIn’s metadata tool DataHub, emerges from stealth with $9M from 8VC, LinkedIn and Insight\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/acryl-data-commercializing-linkedins-metadata-tool-datahub-emerges-from-stealth-with-9m-from-8vc-linkedin-and-insight/", "via": "", "real_tags": ["商业", "linkedin", "数据"]}, {"category": "", "categoryclass": "", "imagename": "3f8b764dbb0d98caf6e52f769d91c3f3.jpg", "infoid": 1067747, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "交易所探索初创公司，市场和金钱。每天早上都在额外的紧缩或每周六获得交换时事通讯。\n  Sentinelone的首次公开募股预计将于6月29日价格和6月30日贸易，是一个迷人的首次亮相。为什么？因为公司体育的结合快速增长和扩大损失，使其成为IPO市场的良好热量检查。其首次亮相将使我们回答公众投资者是否仍然在其他方面重视增长。本周，该公司向我们提供了一个早期的数据集，以其IPO价格范围的形式。这意味着我们可以做一些解开和思考。\n 关于为什么我们住在Unicorns的出口市场的原因此外，损失的公共市场热情水平，以增长增长的公司的公司将确定许多风险资本家，创始人和早期员工的回报规模。\n 所以，让我们谈谈Sentinelone的网络安全IPO价格范围; Sprinklr的社交媒体软件首次亮相将播放箔。\n  为了快速增长的公司股票，它可以良好的感觉。这就是为什么您可以听到初创档次在一个非常高的收入倍数上筹集初期的原因。\n 为什么将5000万美元的价格标签上刚刚越过100万美元的年度重复收入（ARR）门槛？如果它迅速增长，数学可以铅笔出来。如果这一初创公司每年增长300％，所以，在圆形的收入倍数为5000万美元的收入将在明年将大幅下降，那么其他投资者可能会争先恐后地进入公司以更高的价格。\n 答对了！您刚刚对您的初始投资进行了标记，公司发现其他人以更高的价格领导他们的下一轮，使其更加资本以保持其增长游戏，并使您的早期投资出现出现。看？风险投资很容易。 1 \n同样的一般想法适用于公开的公司。 增长事项和公司越快增加收入，资金越多，投资者可以预测其未来规模（以其在原因内）。 一些运动快速增长的公司可以有其他影响其价值的其他问题。 例如，增长不均匀或恶化经济学的历史可能会发挥广泛的债务。 或简单地损失很高。 ", "note_en": "The Exchange explores startups, markets and money.   Read it  every morning on Extra Crunch or get  The Exchange newsletter every Saturday.\n  SentinelOne’s IPO, expected to price on June 29 and trade June 30, is a fascinating debut. Why? Because the company sports a combination of rapid growth and expanding losses that make it a good heat-check for the IPO market. Its debut will allow us to answer whether public investors still value growth above all else. And this week, the company gave us an early dataset regarding its market value in the form of an IPO price range. This means we can do some unpacking and thinking.\n A reminder regarding why we dwell on the exit market for unicorns: We care because the value of late-stage startups when they reach a liquidity point helps set valuation comps for myriad smaller startups. Furthermore, the level of public-market enthusiasm for loss-making, growth-focused companies will determine the scale of returns for many a venture capitalist, founder, and early employee.\n So, let’s talk about SentinelOne’s cybersecurity IPO price range; Sprinklr’s social-media software debut will play foil.\n  It can make good sense to pay up for a quickly growing company’s shares. This is why you may hear of a startup raising an early-stage round at a very high revenue multiple.\n Why put a $50 million price tag on a startup that just crossed the $1 million annual recurring revenue (ARR) threshold? If it’s growing sufficiently quickly, the math can pencil out. If that startup was growing at 300% per year, say, the revenue multiple that you paid in the round valuing the startup at $50 million would fall sharply over the next year, at which point other investors would probably scramble to put more capital into the firm at a higher price.\n Bingo! You just got a markup on your initial investment, and the company has found someone else to lead their next round at a higher price, giving it even more capital to keep its growth game going and make your early investment appear prescient. See? Venture capital is easy. 1\n The same general idea applies to companies going public. Growth matters, and the more rapidly a company is adding revenue, the more money it will be worth because investors can anticipate its future scale (within reason). Some companies that sport quick growth can have other issues that impact their value. Extensive debt, for example, a history of uneven growth, or deteriorating economics could come into play. Or simply very high losses.", "posttime": "2021-06-24 00:03:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "增长,thirst", "title": "投资者对增长的渴望可以为Sentinelone的IPO提供良好 ", "title_en": "\n\t\t\t\tInvestors’ thirst for growth could bode well for SentinelOne’s IPO\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/investors-thirst-for-growth-could-bode-well-for-sentinelones-ipo/", "via": "", "real_tags": ["增长", "thirst"]}, {"category": "", "categoryclass": "", "imagename": "9f44d0860ae87c6d76a8db4bf0cfd2f7.jpg", "infoid": 1067746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Leta Capital在任何地方基于俄语企业家投资。它现在推出了第三次和最大的基金，并表示将在未来三年内投资英国，欧洲和美国增长阶段的技术公司1亿美元。它的焦点将是种子/圆形A /圆形的投资。它打算投资2.5亿美元的范围，将专注于软件，IT和互联网技术\n 新基金将在东欧和俄语企业家磨练。特别是那些从伦敦和纽约等国际中心经营的人。\n  Leta的创始人和前科技企业家亚历山大Chachava表示，俄罗斯州的出国初创公司往往 - 这些日子 - 西方VCS和投资者的过度关注和估值，我敢说他是对的。偏见不仅仅是关于肤色，因为我们都知道。\n Chachava表示，自2012年以来，他的基金已投入超过4500万美元的价格，进入30家技术公司，包括综合AI，Unigine，Indriver，NovakID（我去年覆盖的）和365ores。\n 退出包括2017年在苏黎世保险集团出售明亮的箱子香港，而Wework的收购销售和营销平台unyy。\n Chachava说：“虽然我们大大扩大了我们的地理焦点，我们的主要全球中心，我们的战略有效地保持不变：确定令人兴奋，高潜力的技术初创企业家，并支持他们实现国际野心。”\n Chachava表示，他自己的研究表明，在英国，欧洲和美国有超过17,000个俄罗斯和东欧技术企业家和初创企业。 \n“我们的分析表明，尽管经常在谈判到ARR时经常产生大幅现金，但他们继续被低估并被忽视。这些企业家是世界上最具活力和技术技术的一些，而投资者，他们代表着巨大的未开发机会。“\n 他有一个点。电报，罗福特，Tradingview，Pandadoc和预先乘坐的重要企业都是由俄语发言者开始的，他们来自各自的俄罗斯受影响的国家。\n Leta表示，它的第一个“常绿”基金在2020年初完全部署了1500万美元，为投资者提供了每年27％的毛额。该公司表示，其第二百万美元的基金已于2018年9月首次结束，并致力于其首都的大约60％。\n Leta将在开曼群岛投资一个实体，但现在没有计划有办公室，也没有必要投资。\n 当Chachava通过缩放电话告诉我：“过去两年，我们没有太多旅行，我们的工作已被降级为缩放电话。但在此之前，我们在美国花了几个月，在西欧几个月。我是伦敦的常见访客，但我认为我们不再需要在现代世界中的空间。“ ", "note_en": "Leta Capital makes a play of investing in Russian-speaking entrepreneurs based just about anywhere. It’s now launching its third and largest fund to date and says it will invest over $100 million in UK, European, and US-based growth-stage tech companies over the next three years. Its focus will be Seed/ Round A / Round B investments. It intends to invest in the range of $2-5 million and will be focused on software, IT, and internet technologies\n The new fund will to hone in on East European and Russian-speaking entrepreneurs. Particularly those operating out of international hubs such as London and New York.\n  Leta’s founder and former tech entrepreneur Alexander Chachava says Russian-speaking startups based abroad are often – these days – over-looked and under-valued by Western VCs and investors, and I dare say he’s right. Prejudice isn’t just about skin color, as we all know.\n Chachava says his fund has invested over $45 million to date since 2012, going into 30 technology companies including Synthesis AI, Unigine, InDriver, NovaKid (which I  covered last year) and 365Scores.\n Exits include the sale of Bright Box HK to Zurich Insurance Group in 2017, and WeWork’s acquisition of sales and marketing platform Unomy.\n Chachava said: “While we are significantly broadening our geographic focus towards key global hubs, our strategy effectively remains the same: to identify exciting, high-potential technology start-ups and entrepreneurs, and support them in realizing their international ambitions.”\n Chachava says his own research suggests there are in excess of 17,000 Russian-speaking and East European tech entrepreneurs and start-ups active in the UK, Europe, and US.\n “Our analysis shows they continue to be undervalued and overlooked for funding, despite often generating significant cash when it comes to ARR. These entrepreneurs are some of the most dynamic and technically skilled in the world, and for investors, they represent a massive untapped opportunity.”\n He has a point. Significant businesses such as Telegram, Revolut, TradingView, PandaDoc, and Preply were all started by Russian speakers who are emigres from their respective Russian-influenced countries.\n Leta says its first “evergreen” fund of $15 million was fully deployed in early 2020, delivering a gross IRR of 27% per annum to investors. Its second $50 million fund had its first closing in September 2018 and has committed about 60% of its capital, says the company.\n Leta will invest out of an entity in the Cayman Islands, but doesn’t plan to have an office right now, and nor will it need it to invest.\n As Chachava told me over a Zoom call: “The last two years, we have not been not traveling too much, our work has been downgraded to Zoom calls. But before that, we spent a couple of months in the US, a couple of months in Western Europe. I was a frequent visitor to London but I don’t think we need space anymore in our modern world.”", "posttime": "2021-06-24 00:03:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,capital,企业家", "title": "1亿美元...... Leta Capital希望成为俄罗斯讲话者的朋友到处都是 ", "title_en": "\n\t\t\t\t$100 million… Leta Capital wants to be a friend to Russia-speaking founders everywhere\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/100-million-leta-capital-wants-to-be-a-friend-to-russia-speaking-founders-everywhere/", "via": "", "real_tags": ["俄罗斯", "capital", "企业家"]}, {"category": "", "categoryclass": "", "imagename": "2ad2b79f931f2b2aa2caad20df679c6c.jpg", "infoid": 1067745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2020财富媒体IP Limited。 版权所有。 使用本网站构成接受我们的使用条款和隐私政策| CA通知收集和隐私声明| 不要出售我的个人信息| Ad Coolices财富是Fortune Media IP Limited的商标，在美国和其他国家/地区注册。 财富可能会收到本网站上的产品和服务的某些链接赔偿。 优惠可能如有更改，恕不另行通知。 引用延迟至少15分钟。 互动数据提供的市场数据。 ETF和Morningstar，Inc。提供的互联网数据Dow Jones术语＆amp; 条件：http：//www.djindexes.com/mdsidx/html/tandc/indexestandcs.html。 S＆amp; P索引数据是Chicago Mercantile Exchange Inc.及其许可方的财产。 版权所有。 条款＆amp; 使适应。 由交互式数据托管解决方案提供支持和实现。 ", "note_en": "© 2020 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our  Terms of Use and  Privacy Policy |  CA Notice at Collection and Privacy Notice |  Do Not Sell My Personal Information |  Ad Choices  FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by  Interactive Data. ETF and Mutual Fund data provided by  Morningstar, Inc. Dow Jones Terms &amp; Conditions:  http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html. S&amp;P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved.  Terms &amp; Conditions. Powered and implemented by  Interactive Data Managed Solutions.", "posttime": "2021-06-23 23:53:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "优化,led,数据", "title": "旨在优化企业数据仓储项目的序曲，由Prysm Capital推出120米的系列D，将其总资金达到195亿美元 ", "title_en": "Incorta, which aims to optimize data warehousing projects for enterprises, raises $120M Series D led by Prysm Capital, bringing its total funding to $195M", "transed": 1, "url": "https://fortune.com/2021/06/23/google-microsoft-incorta-data-crunching-venture-capital/", "via": "", "real_tags": ["优化", "led", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "万维网的创造者表示数字资产是“完全与网络的价值观保持”\n    Tim Berners-Lee为拍卖了代表网络的源代码的NFT（非娱乐令牌）的决定，将销售与亲笔签名书或口语之旅的拍卖。\n 万维网的创造者宣布他上周通过Sotheby的拍卖行创建和销售数字资产。在拍卖中，在周三开始并将运行一周，收藏家将有机会在一捆物品上出价，包括10,000行到原始Web浏览器的源代码，由Berners-Lee创建的数字海报代表代码，来自他的一封信以及显示正在输入的代码的动画视频。\n  “这与网络的价值完全对齐，”伯恩李告诉守护者。 “我所说的问题，他们说：'哦，这听起来不像自由和开放的网络。'好吧，等待一分钟，网络就像自由，就像它永远一样开放。 Web上的核心代码和协议是免版税，就像他们总是一样。我不是卖网 - 你不必开始支付钱来遵循链接。\n  “我甚至甚至没有卖出源代码。我卖我所做的一张照片，用我写的Python程序，如果它被困在墙上并由我签名，那么源代码看起来像什么。\n “如果他们觉得我卖一张海边的海报是不合适的，那么我又卖了一本书怎么样？我做那样的事情，涉及金钱，但自由和开放的网站仍然是免费和开放的。我们仍然这样做，现在一次，必须努力保持自由和开放，争取净中立等等。“\n 苏富比尚未为NFT制作销售估计，争论令牌是一个独特的对象，与之前的任何销售。竞选房价将以1,000美元（£711）开放1,000美元（716英镑），拍卖宾馆的伯尔斯 - 李和他的妻子，罗斯玛丽·利斯（Rosemary Leith）所说，虽然网络创建者不会在那些人的具体细节上绘制举措。 \n“我一直对数字世界感兴趣，无论我们是否可以使用NFT来获得资金回归创造性的人像音乐家和艺术家，”他说。 “从销售艺术品的角度来看，艺术家需要......它在数字世界中有用相当于制作项目。”\n  虽然这一销售是伯尔斯李首次公开接受了加密货币社区，但潜在技术对此有很大的吸引力，他说。伯尔斯 - 李已经在他自己的项目中定居了类似的解决方案，旨在将网络分散。 “BlockChain世界与网络相当分开，除非他们在不同的地方连接。但是Web设计的问题之一是它使用它使用域名，该名称是核心集中系统。\n “坚实和区块链都吸引了想要主权身份的人，主权作为一个人。当你得到一个坚实的豆荚，你可以与世界上的任何人分享，而不询问任何其他人，而不经历任何中央权威。在一个区间的情况下，如果你在区块链上得到你的名字，你可以用它作为一个主权身份。“对2019年的监护人说话，伯恩李称网络依赖域名制度，如果他能及时回去，他会修复的错误之一。 ", "note_en": "Creator of the world wide web says digital asset is ‘totally aligned with the values of the web’\n    Tim Berners-Lee has defended his decision to auction  an NFT (non-fungible token) representing the source code to the web, comparing the sale to an autographed book or a speaking tour.\n The creator of the world wide web announced his decision to create and sell the digital asset through Sotheby’s auction house last week. In the auction, which begins on Wednesday and will run for one week, collectors will have the chance to bid on a bundle of items, including the 10,000 lines of the source code to the original web browser, a digital poster created by Berners-Lee representing the code, a letter from him, and an animated video showing the code being entered.\n  “This is totally aligned with the values of the web,” Berners-Lee told the Guardian. “The questions I’ve got, they said: ‘Oh, that doesn’t sound like the free and open web.’ Well, wait a minute, the web is just as free and just as open as it always was. The core codes and protocols on the web are royalty free, just as they always have been. I’m not selling the web – you won’t have to start paying money to follow links.\n  “I’m not even selling the source code. I’m selling a picture that I made, with a Python programme that I wrote myself, of what the source code would look like if it was stuck on the wall and signed by me.\n “If they felt that me selling an NFT of a poster is inappropriate, then what about me selling a book? I do things like that, which involve money, but the free and open web is still free and open. And we do still, every now and again, have to fight to keep it free and open, fight for  net neutrality and so on.”\n Sotheby’s has not produced a sales estimate for the NFT, arguing that the token is a unique object unlike anything sold before. Bidding will open at $1,000 (£716), and the proceeds of the sale will benefit initiatives that Berners-Lee and his wife, Rosemary Leith, support, the auction house said, although the web creator would not be drawn on the specifics of those initiatives.\n “I’ve always been interested in the digital world of whether we can use NFTs to get funding back to creative people like musicians and artists,” he said. “From the point of view of selling an artwork, artists need … it’s useful in the digital world to have the equivalent of making an item.”\n  Although this sale is the first time Berners-Lee has openly embraced the cryptocurrency community, the underlying technology has much that appeals about it, he said. Berners-Lee has settled on similar solutions in his own project,  Solid, which aims to decentralise the web. “The blockchain world is pretty separate from the web, except where they connect in different places. But one of the problems with the web’s design is that it uses it uses domain names, which are at core a centralised system.\n “Solid and the blockchain both attract people who want sovereign identity, sovereign power as a person. When you get a Solid pod, you can share it with anybody else in the world without asking anybody else, without going through any central authority. And on a blockchain, if you get your name on a blockchain, you can use that as a sovereign identity.” Speaking to the Guardian in 2019, Berners-Lee  called the web’s reliance on the domain name system one of the mistakes he would have fixed if he could go back in time.", "posttime": "2021-06-23 23:52:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,书籍,口语,berners,网络", "title": "Tim Berners-Lee捍卫他的决定拍卖代表Web的源代码的NFT，将其与销售进行签名的书籍或口语之旅 ", "title_en": "Tim Berners-Lee defends his decision to auction an NFT representing the web's source code, comparing it to the sale of an autographed book or a speaking tour", "transed": 1, "url": "https://www.theguardian.com/technology/2021/jun/23/tim-berners-lee-defends-auction-nft-web-source-code", "via": "", "real_tags": ["代码", "书籍", "口语", "berners", "网络"]}, {"category": "", "categoryclass": "", "imagename": "d06b121b052c15c048f28f928ad60695.png", "infoid": 1067742, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当ARM宣布今年早些时候宣布ARMv9架构时，他们透露了一个新的机密计算架构将被介绍。今天ARM正在推出新的架构。 ARM机密计算架构（CCA）是一种孤立技术，可根据ARM现有的TrustZone技术作为其基础。在新的CCA架构中，应用程序数据旨在在使用时受到保护。这包括预防私有数据的访问，即使是特权软件，如虚拟机管理程序或操作系统。今天介绍的是什么ARM是符合符合架构实现的行为架构规范的第一个发布。今天规范介绍旨在为软件社区进行种子和KickStart软件启用。武装预计大约2  -  3年，直到事情达到生产准备，我们可以期待在硅中看到它发货。\n  请注意，机密计算架构是新ARMv9架构的一部分。具体而言，它将是ARMv9.2的可选特征，最终可能成为未来规范中所需的扩展。软件开发人员将能够通过检查CPU上是否存在域管理扩展名（RME）功能来检查CCA支持（稍后更多）。\n     此前，硅供应商和OEM只能通过诸如TrustZones等事物访问的高信任环境。通过新的ARM CCA，高信任环境正在扩展到所有开发人员，希望它将被主流工作负载使用。虽然最初由OS相关的软件实现，但ARM希望领域将找到进入Masstphone的软件（如智能手机应用）（在本文后面的内容）。为此，新的机密计算架构旨在将云到移动，汽车和IOT的所有市场。\n 在机密计算架构的核心是“领域”。领域是有效的小，个人高信任环境或飞地。机密计算架构旨在防止从芯片右侧的整个堆栈中的私有数据访问。为此，CCA提供了对相互信任工作负载的强制保护，强制防止受损的丰富的操作系统（例如，Linux，Windows），强烈保护免受受损的虚拟机管理程序，以及在安全世界内运行的应用程序的新保护。换句话说，境界不需要信任任何人。 CCA还支持证明，以便域可以验证在设备或平台中的信任，然后向依赖方提供证明报告，然后可以独立验证信任。\n  下面的幻灯片中的图表显示了ARM的CCA如何设计的高级概述。您会注意到，现在通常的“正常”和“安全”状态之外的两个新州。它们被称为“王国”和“根”。新各国促进了新的领域功能。我们将更详细地稍后触摸这一点。领域显示在黄色框中。当它们是创建的 - 通过管理程序的帮助 - 它们将迁移到境界状态。虚拟机管理程序或任何TrustZone应用程序（以绿色）甚至其他领域中的任何一个都无法访问新的Realm Facdaves。\n 可以在按需创建和销毁领域。在对比对比的对比中，还可以根据需要调整到诸如存储器之类的领域的资源（即，内存大小可以根据需要增加或减少）。这里的想法是，通过将大型软件工作负载移动到自己的私人领域，应用程序可以更大的信心，以便在同一硬件上运行的其他软件和服务不能使用它们处理的数据和算法。 CCA的一大部分是保护潜在的管理程序的境界。因此，虽然它仍然负责分配资源并对诸如调度等事物负责，但它不再能够访问领域内的数据。值得注意的是，基于CCA硬件的保护几乎包括图中的一切，唯一的例外是非常最低的固件（图中标记的显示器）。\n   尽可能得到多少境界;系统能够支持任意数量的REATMS  - 仅限于可用的系统资源（即，内存，计算电源）。例如，小型物联网设备可能只是少数职业，而大型服务器SOC可能正在运行100S的领域。创建和销毁领域的意味着可以根据需要使用任何应用程序使用的操作。 \n今天发布的架构规范包括硬件要求和启用固件和软件。正如我们之前提到的那样，ARM CCA功能正在作为ARMv9.2 ISA的可选功能引入。支持机密计算架构的硬件将具有可用的域管理扩展（RME）。在其核心，实现领域管理扩展的处理器具有两个新的硬件功能：创建领域和动态内存分配。\n 第一种新功能是创建和销毁称为领域的硬件强制围场的新功能。正如我们之前所描述的那样，RISEMS提供来自任何其他执行环境的数据和/或代码保护。这包括管理程序，内核，其他领域，甚至是TrustZone应用程序。\n 在具有TrustZone支持的典型ARM处理器时，系统将分为两个地区：一个是一个安全的世界，另一个是非安全的世界（或普通世界）。记忆映射将安全的世界划分为非安全的世界。从历史上看，可能影响柬ryZone的使用的限制之一是必须通过监视器在启动时分配给安全的世界。这通常是有限的粒度完成的。这对可以分配给安全世界的资源的种类/大小来施加了各种人为限制。通过新的境界管理扩展，页面现在可以从非安全世界转换到安全的世界并再次回来。这允许RentrZone用于更多内存密集型应用程序。作为侧面，当RME专门用于使用动态内存能力的柬ryzone（即，没有领域）的增强时，此特定功能现在被称为“ARM Dynamic TrustZone技术”。\n  在当前的架构（ARMv8.4-Secel2）下，有两个世界：安全和不安全（正常）。每个世界都与自己的安全状态（安全/非安全）和物理地址空间相关联。安全的世界受到正常世界的影响，在2级及以上。任何从普通世界访问安全内存地址空间的尝试将生成硬件异常，停止执行。安全世界内运行的软件能够访问安全和普通的世界内存。\n    在新的RME下，已添加两个新的安全状态：root和Realm。此外，还添加了两个新的物理地址空间（也称为root和Realm）。硬件堆栈的最低级别 - 监视器 - 现在获取其自己的私有地址空间和称为“root”的状态。即使是安全的世界，新的根地址空间受到所有其他地址空间的保护。\n 新的RealM管理扩展提供了能够在这些物理地址空间之间动态转换内存页面。胳膊叫这些页面颗粒。为了使处理器支持各种地址空间之间的内存页面的新动态转换，ARM添加了一个名为颗粒保护表或GPT的新表。 GPT是由EL3中的监视器控制的MMU页面表的扩展。新的GPT将每个表格映射到内存中的一个世界之一。在每个内存访问尝试中，允许仅允许允许的访问时进行新的颗粒保护检查。无效访问触发页面错误。请注意，任何分配给正常，安全，根和域球世界的内存都是由写入DRAM之前的硬件加密。\n   作为ARM CCA的一部分，还定义了一种新的固件/软件架构。定义了一个新的Realm Management Monitor（RMM），它为管理程序提供服务以及对域本身的服务。这是通过新的域管理界面（RMI）完成的。虚拟机管理程序的服务包括创建和销毁领域以及添加和删除内存。此外，领域还可以通过RMI请求证明报告，该RMI可以是平台或可以呈现给请求方的领域。 ", "note_en": "When Arm  announced the Armv9 architecture earlier this year, they revealed a new architecture for confidential compute that would be introduced. Today Arm is introducing the new architecture. The Arm Confidential Compute Architecture (CCA) is an isolation technology that builds on Arm’s existing TrustZone technology as its foundation. Within the new CCA architecture, application data is designed to be protected while in use. This includes the prevention of access to private data even from privileged software such as the hypervisor or the operating system. What Arm is introducing today is the first release of the behavior architecture specification for a compliant implementation of the architecture. Today spec introduction is designed to seed the software community and kickstart software enablement. Arm expects around 2-3 years until things reach production readiness and we can expect to see it shipping in silicon.\n  Note that the Confidential Compute Architecture is part of the new Armv9 architecture. Specifically, it will be an optional feature of the Armv9.2 and will likely eventually become a required extension in a future specification. Software developers will be able to check for CCA support by checking if the Realm Management Extension (RME) feature is present on the CPU (more on this later).\n     Previously, a high-trust environment was only accessible to silicon vendors and OEMs through things such as TrustZones. With the new Arm CCA, high-trust environments is being extended to all developers with the hope that it will be used by mainstream workloads. While initially this be implemented by OS-related software, Arm hopes that Realms will find their way into mainstream software such as smartphone apps (more on this later in this article). To that end, the new confidential compute architecture is designed to suit all markets from cloud to mobile, automotive, and to IoT.\n At the heart of the Confidential Compute Architecture are “Realms”. Realms are effectively small, individual high-trust environments or enclaves. The Confidential Compute Architecture is designed to prevent private data access across the entire stack right from the silicon. To that end, the CCA provides support for strong protection between mutually distrusting workloads, strong protection against compromised rich operating systems (e.g., Linux, Windows), strong protection against compromised hypervisors, and new protection from applications running within the secure world. In other words, a Realm need not trust anyone. The CCA also supports attestation so that a Realm can verify trust in the device or platform and then present an attestation report to a relying party that can then independently verify trust.\n  The diagram in the slide below shows a high-level overview of how Arm’s CCA is designed to work. You will notice that there are now two new states beyond the usual ‘Normal’ and ‘Secure’ states. They are called ‘Realm’ and ‘Root’. The new states facilitate the new realm features. We will touch on this later in more detail. Realms are shown in the yellow boxes. When they are created – through the help of the hypervisor – they will migrate to the Realm state. The new realm enclaves cannot be accessed by the hypervisor or any of the TrustZone applications (in green) or even other realms.\n Realms can be created and destroyed dynamically on-demand. In striking contrast to TrustZone, resources dedicated to realms such as memory can also be adjusted on-demand (i.e., memory size can be increased or decreased as needed on-demand). The idea here is that by moving large software workloads into their own private realms, applications can have much greater confidence that the data they process and algorithms used cannot be used by other software and services running on the same hardware. A big part of the CCA is protecting realms from the underlying hypervisor. So while it is still responsible for allocating resources and is responsible for things such as scheduling, it is no longer able to access the data within a realm. It’s worth noting that the CCA hardware-based protection includes virtually everything on the diagram shown with the only exception being the very lowest level of firmware (marked Monitor in the diagram).\n   As far as how many realms can be supported; a system is capable of supporting any number of realms – limited by just the available system resources (i.e., memory, compute power). For example, small IoT devices might have just a handful of realms while a large server SoC might be running 100s of realms. Creating and destroying realms is meant to be light enough operation to be used by any application as desired.\n   The architecture specification being released today includes both the hardware requirements and the enabling firmware and software. As we mentioned earlier, the Arm CCA feature is being introduced as an optional feature of the Armv9.2 ISA. Hardware that supports the confidential compute architecture will have the Realm Management Extension (RME) available. At its core, processors that implement the Realm Management Extension have two new hardware capabilities: the creation of realms and dynamic memory assignment.\n The first new capability is the new ability to create and destroy hardware-enforced enclaves called realms. As we described them earlier, realms provide data and/or code protection from any other execution environment. This includes the hypervisor, kernel, other realms, and even TrustZone applications.\n When looking at a typical Arm processor with TrustZone support, the system is partitioned into two regions: one is a secure world and the other is a non-secure world (or normal world). Memory mapping divides the secure world from the non-secure world. Historically, one of the limitations that can impact the use of TrustZone is that memory has to be allocated to the secure world by the Monitor at boot time. And this is often done with limited granularity. This imposes various artificial constraints on the kind/size of resources that may be allocated to the secure world. With the new Realm Management Extension, pages can now transition from the non-secure world to the secure world and back again. This allows TrustZone to be utilized for much more memory-intensive applications. As a side note, when RME is being used exclusively for the enhancement of TrustZone (i.e., no Realms) with dynamic memory capabilities, this specific feature is now being called “Arm Dynamic TrustZone Technology.”\n  Under the current architecture (Armv8.4-SecEL2), there are two worlds: Secure and Non-Secure (Normal). Each world is associated with its own security state (secure/non-secure) and a physical address space. The secure world is protected from the normal world at exception level 2 and above. Any attempt to access secure memory address space from the normal world will generate a hardware exception, halting execution. Software running within the secure world is able to access both secure and normal world memory.\n    Under the new RME, two new security states have been added: Root and Realm. Additionally, two new physical address spaces (also called Root and Realm) have been added. The lowest level of the hardware stack – the Monitor – now gets its own private address space and state called ‘Root’. The new Root address space is protected from all other address spaces even the secure world.\n The new Realm Management Extension provides the ability to dynamically transition pages of memory between these physical address spaces. Arm calls those pages Granules. In order for the processor to support the new dynamic transitioning of memory pages between the various address spaces, Arm added a new table called the Granule Protection Table or GPT. The GPT is an extension of the MMU page tables that are controlled by the Monitor in EL3. The new GPT maps each table in memory to one of the four worlds. On each memory access attempt, a new Granule Protection Check takes place ensuring only permitted accesses are allowed. Invalid accesses trigger page faults. Note that any memory assigned to the Normal, Secure, Root, and Realm world is encrypted by the hardware prior to written to DRAM.\n   As part of the Arm CCA, a new firmware/software architecture is also defined. A new Realm Management Monitor (RMM) is defined which provides services for the hypervisor as well as to the realms themselves. This is done via a new Realm Management Interface (RMI). Services for the hypervisor include the creation and destruction of realms as well as adding and removing memory. Additionally, realms can also request attestation reports via the RMI which can be for the platform or the realm which can be presented to a requesting party.", "posttime": "2021-06-23 23:51:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "介绍,introduces,领域", "title": "ARM介绍其机密计算架构 ", "title_en": "Arm Introduces Its Confidential Compute Architecture", "transed": 1, "url": "https://fuse.wikichip.org/news/5699/arm-introduces-its-confidential-compute-architecture/", "via": "", "real_tags": ["介绍", "领域"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067741, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "排序算法在一次oranother中大量用于软件开发。根据语言，您可能在您的处置方便的某些排序功能，但根据用例，知道在引擎盖下正在应用哪种排序算法可以是测量工作软件对变化的影响的关键。\n 在本文中，我想探索一些排序的实现，但我想通过单位测试驱动。我在网上没有看到过多的探索这种方法，所以我希望这引起你的兴趣。\n  大多数排序算法定义我将从维基百科提取，所以这里是一个摘要我们的摘要：\n 排序算法是一种算法，将列表中列表的元素放在特定顺序中。\n    这里的想法是实现一个或两个分类算法，但是这样做的是驾驶的测试。基本上，我们将首先编写一个测试，具有简单的场景输入和预期输出。这将失败，因为尚未存在任何码。然后我们将写入最低必要的代码来满足最低的并重复该过程。此技术的名称是测试驱动驱动（TDD）。如果您对此过程感到好奇，或者如果它没有声音，请访问这篇文章。\n 我将使用的语言将是通过测试和实现为简单的单个文件。\n 如果您不熟悉Go语言，请不要担心。我将发布差异的代码，以说明我们在一致上下滚动的每一步。这里的想法是探索该技术，而不是语法或特点。 \n您可能会注意到，我将使用该术语数组，尽管在其中阵列和计算机之间的区别，技术上，我将在代码期间usingslics。\n 我也会尝试描述每一步，所以假装我们正在做一些队伍\n  好的。正如我如下所述，我想从一个简单的测试开始，将我加入最少量的代码只是为了让事情工作，然后我们加拿到它。就哪种算法我打算选择，我会和泡泡排序一起。然后，我们评估ifthis对我们来说足够好，如果没有，我们重构我们的代码可以选择offereMplementation。这里重要的是：最后，无论我们选择的脚本算法如何，测试需要通过，因为我们仍然想要对我们进行排序。\n 此外，为简单起见，我们的排序算法只会将要处理数字（整数以更精确）。\n 让我们从最简单的输入开始，这将是一个空数组。为什么？因为如果我们想要排序空阵列，结果应该是一个空数组！我想遵循的方法是让事情变得最小的动作，因为我们需要持续反馈。我们可以从一个元素开始，写一个元素并编写一个测试，它会指出该阵列进行排序，但这会要求我们花费更多时间写入代码，更少时间写入测试。我可以获得一些平衡，并确保我们不会留下任何边缘案例。\n 包排序_test导入（＆＃34;测试＆＃34;＆＃34; github.com/matryer/is&#34;）func testsort（t * testing .t）{t。 run（＆＃34;当数组为空＆＃34时应返回相同的值;，func（t * testing .t）{是：=是。新（t）元素：= [0] int {}预期：= [0 ] int {}是。相等（排序（元素），预期）}）}\n  去测试./2021/06/08 14:06:17退出状态2＃alabeduarte.com_test [alabeduarte.com.test] ./ sorting_test.go：15：12：未定义：sortfail alabeduarte.com [build失败] failfail （0.22秒） \n这是因为没有在任何地方定义排序方法。让我们做出一定的努力来获得这个传球，而不是通过定义方法并使iTRETURN成为一个空数组，因此我们的测试将通过！\n     现在让我们添加另一个测试场景，在那里它将强迫我们写的东西，而不是硬涂覆的响应：\n //测试文件func testsort（t * testing .t）{//先前的测试场景在这里省略... t.t。运行（＆＃34;当阵列只有一个元素＆＃34时，应该返回相同的值;，func（t * testing .t）{是：=是。新（t）元素：= [] int {1}预期：= [] int {1}是。相等（排序（元素），预期）}）}\n 去测试./2021/06/08 14:04:49退出状态1 sorting_test.go：29：29：[]！= [1] ---失败：testsort（0.00s）---失败：testsort / contrenturn_same_value_when_array_has_only_one_element（ 0.00s）failfail alabeduarte.com 0.101sfailfail（0.31秒）\n 这是预期的，因为我们的实现代码始终返回EntervartAray。让我们改变它并进行测试通行证，但以一种方式要求最小的努力实现这一点：\n    现在我们的两种情况正在通过，我们到目前为止评估我们的代码......\n 好的，看着代码，我无法想到改善，除了我们的测试目前有点冗长。我们在我们的测试中，我们正在定义variables元素和期望，然后我们正在执行以下传票： \n考虑到现在的测试是多么简单，我觉得我们可以做点什么，所以让我们重构它：\n //测试文件func testsort（t * testing .t）{t。运行（＆＃34;当数组为空＆＃34时应返回相同的值;，func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {}），[ ] int {}）}）t。运行（＆＃34;当阵列只有一个元素＆＃34时，应返回相同的值;，func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {1} ），[] int {1}）}）}}\n 现在，运行测试，他们仍然应该通过，因为我们没有新的东西：\n  好的。现在一切都是“绿色”（A.K.A通过），让我们添加一个新的场景，实际上需要我们应用任何类型的算法。但是，让我们添加真正简单的东西，如2号：\n //测试文件func testsort（t * testing .t）{// ... t。运行（＆＃34;应该返回最低元素，后跟最大的元素＆＃34; func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {2， 1}），[] int {1,2}）}）}\n  去测试./2021/06/08 14:21:11退出状态1 sorting_test.go：31：[2 1]！= [1 2] ---失败：testsort（0.00s）---失败：testsort / contance_return_the_lowest_element_followed_by_the_largest_element（0.00s）failfail alabeduarte.com 0.098sfailfail（0.34秒）\n  //实现文件func排序（元素[] int）[] int {如果len（元素）＆lt; = 1 {return元素} return [] int {元素[1]，元素[0]}} \n那太棒了！测试都是通过的。你可能想知道...... Outimplementation听起来很可靠吗？一些事情可以疯了......也是如此，感觉就像我们欺骗一样，因为我们总是抓住流动和第二个元素并将它们恢复到相反的顺序中，有诺斯特继续下去，诚实。让我们打破代码并进一步讨论我们下一步可以做的事情：\n //实现文件Func排序（元素[] int）[] int {//在此检查长度是否小于或等于1 //，这意味着如果数组为空，则会返回元素//本身（一个空数组），如果数组只有一个元素，它将//也会返回。如果LEN（元素）＆lt; = 1 {return元素} //在这种情况下，我们＆＃39;重新抓住第二个elewht和第一个元素和//交换两个return [] int {元素[1]的顺序，元素[0]}}\n 基本上，如果数组有超过2个元素，则我们的代码只能以相反的顺序返回第二次返回。所以这里有一些可能出现问题的几件算法：\n 当元素的长度大于2时，我们的排序算法将归于休息，返回具有更少元素的数组\n 当元素已经排序时，我们的排序算法将通过启动前两个元素\n  很明显，我们的代码正在做错事。但是因为它是Itmight Sound，如果我们有一个测试索引，我们只能将新代码添加到我们的实施中，这将证明其存在证明！\n  //测试文件func testsort（t * testing .t）{// ... t。运行（＆＃34;应该返回一个与作为输入＆＃34提供相同长度相同的数组; func（t * testing .t）{是：=是。新（t）sortedelements：= sort（[] INT {2,1,4,3}）ACTUALL长度：= LEN（SortEdElements）是。相等（Actuallength，4）}）} \n去测试./2021/06/08 14:40:57退出状态1 sorting_test.go：44：2！= 4 ---失败：testsort（0.00s）---失败：testsort / consucturn_an_array_with_the_same_length_as_the_one_provide_as_an_input（0.00s） failfail alabeduarte.com 0.101sfailfail（0.34秒）\n  //实现文件func排序（元素[] int）[] int {如果len（元素）＆lt; = 1 {return元素} //从索引2上取向rest：=元素[2：] //附加休息到原始数组我们有返回附加（[] int {元素[1]，元素[0]}，休息......）}\n   由于我们确保阵列长度始终相同，而是我们符合其他测试场景的符号。但是，现在的实现有点笨拙，这是一个标志，是时候实际实现了脚的时间！\n 让我们添加一个简单的场景，以说明我们可以在没有笨重的实现的情况下对云兰2个元素进行排序。所以让我们使用3个ElementSthis时间：\n //测试文件func testsort（t * testing .t）{// ... t。运行（＆＃34;应该将所有元素从最低到最大的元素排序，Func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {2 ，3,1}），[] int {1,2,3}）}）}）\n  去测试./2021/06/08 14:56:24退出状态1 sorting_test.go：51：[3 2 1]！= [1 2 3] ---失败：testsort（0.00s）---失败：testsort / consuct_all_all_the_elements_from_the_lowest_to_the_larget（0.00s）FailFail Alabeduarte.com 0.099SFailfail（0.40秒）\n 现在让我们在这里实现一些排序算法。目前，让我们使用称为泡沫排序的算法。 \n如上所述，泡沫排序是最简单的排序算法之一Toundstand和实施，但其效率在较大的赌注上显着降低。这里有更多细节。\n 如果您想了解更多关于此算法的实现，Ialso建议此材料：https://tutorialedde.net/courses/go-algorithms-course/21-bubble-sort-in-go/\n //实现文件Func排序（元素[] int）[] int {n：= len（元素）如果n＆lt; = 1 {return元素}交换：= true for swappped {swappped = false i：= 0;我＆lt; n  -  1; i ++ {如果元素[i]＆gt;元素[i + 1] {元素[i]，元素[i + 1] =元素[i + 1]，元素[i]交换= true}}} return元素}\n    我们的算法（泡沫排序）不是那里最有效的。算法的复杂性是O（n²），其中n是被排序的元素数量。这意味着随着元素的数量增长，其效率降低。在这里，我们可以在此处使用的其他选项，例如被视为Myeffirity的Insertionsort或Selectionsor。\n 不一定改变任何内容，让我们使用GO测试基准测试我们的CurrentalGorithm进行基准测试。\n 首先，让我们创建一个小功能（在我们的测试文件中），以生成带有给定长度的随机元素：\n //测试文件func生成dayerandeLement（n int）[] int {// inseardise and slice，其长度和容量的＆＃34; n＆＃34;元素：= make（[] int，n，n）//填充与i的随机元素的切片，_：=范围元素{元素[i] = rand。 int（）}返回元素} \n现在让我们创建一个函数，它将迭代我们的方法排序，将tests.b作为参数：\n //测试文件Func BenchmarkBubblesort（n int，b * testing .b）{为i：= 0;我＆lt; b .n; i ++ {元素：=生成地段（n）//排序元素排序（元素）}\n  //测试文件func benchcharkbubblesort3（b * testing .b）{benchmarkbbblesort（3，b）} func benchmarkbbollesort10（b * testing .b）{benchmarkbubblesort（10，b）} func benchmarkbbollesort20（b * testing .b）{benchmarkbbblesort（ 20，b）} Func BenchmarkBblesort50（B *测试.b）{BenchmarkBubblesort（50，B）} Func BenchmarkBbollesort100（b * testing .b）{benchmarkbubblesort（100，b）} func benchmarkbbollesort1000（b * testing .b）{benchmarkbbblesort （1_000，b）} Func BenchmarkBubblesort100000（b *测试.b）{benchmarkbbblesort（100_000，b）}\n    Go test -bench = .goos：达尔文司机：amd64pkg：alabeduarte.comcpu：英特尔（r）核心（tm）i7-9750h cpu @ 2.60ghzbenchmarkbubbollesort3-12 17688249 67.22 ns / opbenchmarkbubbollesort10-12 4173184 303.4 ns / opbenchmarkbubbollesort20-12 1228124 1031 ns / OpbenchMarkBubblesort50-12 240789 4240 NS / OPBenchmarkBubblesort100-12 90360 13976 NS / OpbenchmarkBubbollsort1000-12 1626 733388 NS / OpbenchmarkBubblesorT100000-12 1 14456783580 NS / OP\n 正如您所看到的，当阵列中有100,000个元素时，我的机器占据了14456783580纳秒，以执行排序，相当于约14秒。\n 让我们尝试使用Go的StanderalLibrary实现来对我们的元素进行排序.Let的创建一个小功能，将生成随机元素并从包中调用TheThod Ints：\n Func BenchmarkGosort（n int，b * testing .b）{为i：= 0;我＆lt; b .n; i ++ {元素：=生成式andomeLements（n）//排序元素排序。 INTS（元素）}} \n现在让我们创建类似的基准函数，这些功能将与Sort.ints函数进行比较：\n Func BenchmarkGoosort3（B *测试.b）{BenchmarkGoSort（3，B）} Func BenchmarkGosort10（B *测试.b）{BenchmarkGoSort（10，B）} Func BenchmarkGoSort20（B *测试.b）{benchmarkgosort（20，b） Func BenchmarkGosort50（B *测试.b）{BenchmarkGosort（50，B）} Func BenchmarkGoSort100（B *测试.b）{BenchmarkGoSort（100，B）} Func BenchmarkGosort1000（B * Testing .b）{benchmarkgosort（1_000，b ）} Func BenchmarkGosort100000（b *测试.b）{benchmarkgosort（100_000，b）}\n  Go test -bench = .goos：DarwingoArch：Amd64PKG：alabeduarte.comcpu：英特尔（r）核心（tm）i7-9750h cpu @ 2.60ghzbenchmarkbubblesort3-12 18284776 67.53 ns / opbenchmarkbubblesort10-12 4207515 295.9 ns / opbenchmarkbubbollesort20-12 1201567 1006 ns / opBenchmarkBubbleSort50-12 276207 4262纳秒/ opBenchmarkBubbleSort100-12 89107 13813纳秒/ opBenchmarkBubbleSort1000-12 1620 755969纳秒/ opBenchmarkBubbleSort100000-12 1 14532398965纳秒/ opBenchmarkGoSort3-12 9781417 124.5纳秒/ opBenchmarkGoSort10-12 2595421 439.4纳秒/ opBenchmarkGoSort20-12百万1108纳秒/ OpbenchmarkGosort50-12 357010 3252 NS / OPBenchmarkGosort100-12 160202 7618 NS / OpbenchmarkGosort1000-12 10000 100856 NS / OpbenchmarkGosort100000-12 75 16205598 NS / Op\n 正如我们所看到的，我们的算法使用泡沫排序似乎稍微好一点，直到2017010比赛，其中Go标准库开始闪耀比我们的方式更快。\n 由于Go标准库更有效，让我们更改我们的实现，而是重新运行测试：\n   去测试-v === RUN TestSort === RUN TestSort / should_return_same_value_when_array_is_empty === RUN TestSort / should_return_same_value_when_array_has_only_one_element === RUN TestSort / should_return_the_lowest_element_followed_by_the_largest_element === RUN TestSort / should_return_an_array_with_the_same_length_as_the_one_provided_as_an_input === RUN TestSort / should_sort_all_the_elements_from_the_lowest_to_the_largest --- PASS：TestSort （0.00S）--- PASS：TestSort / should_return_same_value_when_array_is_empty（0.00S）--- PASS：TestSort / should_return_same_value_when_array_has_only_one_element（0.00S）--- PASS：TestSort / should_return_the_lowest_element_followed_by_the_largest_element（0.00S）--- PASS：TestSort / should_return_an_array_with_the_same_length_as_the_one_provided_as_an_input（0.00 s）---通过：testsort / consut_all_all_the_elements_from_the_lowest_to_the_larget（0.00s）passok alabeduarte.com 0.920s\n 如果您有兴趣查看我们构建的整个代码，请在下面的CONSLAPSE THECTION： \n包裹排序_test导入（＆＃34; math / rand＆＃34;＆＃34; sort＆＃34;＆＃34;测试＆＃34;＆＃34; github.com/matryer/is&#34;）//实现：/ //排序将接收切片作为输入，它将返回另一个切片但是//排序。 Func排序（元素[] int）[] int {n：= len（元素）如果n＆lt; = 1 {return元素}交换：= true for swappped {swapppy = false for i：= 0;我＆lt; n  -  1; i ++ {如果元素[i]＆gt;元素[i + 1] {元素[i]，元素[i + 1] =元素[i + 1]，元素[i]交换= true}}返回元素} //单元测试：func testsort（t *测试.t）{t。运行（＆＃34;当数组为空＆＃34时应返回相同的值;，func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {}），[ ] int {}）}）t。运行（＆＃34;当阵列只有一个元素＆＃34时，应返回相同的值;，func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {1} ），[] int {1}）}）t。运行（＆＃34;应该返回最低元素，后跟最大的元素＆＃34; func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {2， 1}），[] int {1,2}）}）t。运行（＆＃34;应该返回一个与作为输入＆＃34提供相同长度相同的数组; func（t * testing .t）{是：=是。新（t）sortedelements：= sort（[] INT {2,1,4,3}）ACTUALL长度：= LEN（SortEdElements）是。等于（Actuall长度，4）}）t。运行（＆＃34;应该将所有元素从最低到最大的元素排序，Func（t * testing .t）{是：=是。新（t）是。相等（sort（[] int {2 ，3，1}），[] int {1,2,3}）}）} //基准：Func生成DaySandeMelements（n int）[] int {//初始化具有＆＃34的长度和容量的切片; n＆ ＃34;元素：= make（[] int，n，n）//填充与i的随机元素的切片，_：=范围元素{元素[i] = rand。 int（）}返回元素} Func BenchmarkBubbleort（n int，b * testing .b）{为i：= 0;我＆lt; b .n; i ++ {元素：=生成式aragemelements（n）//排序元素排序（元素）}} func benchmarkgosort（n int，b * testing .b）{为i：= 0;我＆lt; b .n; i ++ {元素：=生成式andomeLements（n）//排序元素排序。 ints（元素）}} func benchmarkbbollesort3（b * testing .b）{benchmarkbbblesort（3，b）} func benchmarkbbolsort10（b * testing .b）{benchmarkbubblesort（10，b）} func benchmarkbbollesort20（b * testing .b）{ BenchmarkBublesort（20，B）} Func BenchmarkBubblesort50（B *测试.b）{BenchmarkBubblesort（50，B）} Func BenchmarkBbollesort100（b * Testing .b）{BenchmarkBubblesort（100，B）} Func BenchmarkBubblesort1000（B *测试.b） {BenchmarkBblesort（1_000，B）} Func BenchmarkBubblesorT100000（B *测试.b）{BenchmarkBubblesort（100_000，B）} Func BenchmarkGoSort3（B * Testing.B）{BenchmarkGoSort（3，B）} Func BenchmarkGosort10（B *测试.b ）{BenchmarkGosort（10，B）} Func BenchmarkGoSort20（B *测试.b）{BenchmarkGosort（20，B）} Func BenchmarkGosort50（B *测试.b）{BenchmarkGosort（50，B）} Func BenchmarkGosort100（B *测试。 b）{benchmarkgosort（100，b） Func BenchmarkGoosort1000（b *测试.b）{benchmarkgosort（1_000，b）} Func BenchmarkGosort100000（b *测试.b）{benchmarkgosort（100_000，b）}\n  如果你阅读这篇文章并走了这篇文章，非常感谢你。我希望我可以说明如何开发一个排序算法驱动的字母。\n 你可能已经注意到我对拿起最富有的算法实施没有太担心，开始，但相反，我感兴趣\n...... ", "note_en": "Sorting algorithms are heavily used in Software Development in one way oranother. Depending on the language, you might have in handy some sortingfunctions at your disposal but depending on the use case, knowing which sortingalgorithm is being applied under the hood can be key to measure the impacts ofthe change on the working Software.\n In this article, I’d like to explore a couple of implementations of sortingalgorithms but I’d like to do so driven by unit tests. I haven’t seen muchcontent online that explore this approach so I hope this sparks your interest.\n  Most of the sorting algorithms definitions I’ll be using were extracted from the Wikipedia so here’s a summaryto kick us off:\n A sorting algorithm is an algorithm that puts elements of a list in a certainorder.\n    The idea here is to implement one or two sorting algorithms but doing so drivenby tests. Basically, we’ll write a single test first, with a simple scenariowith input and expected output. This will fail because there won’t be anycode just yet. Then we will write the minimum necessary code to satisfy thetest and repeat the process. The name of this technique is Test-DrivenDevelopment (TDD). If you’re curious about this process or if it doesn’t soundfamiliar to you, please visit  this post.\n The language I’ll use will be  Go and using a single filewith  both test and implementation for simplicity.\n If you are not familiar with the Go language, don’t worry. I will post differentsnippets of code to illustrate every step as we were scrolling up and down in afile. The idea here is to explore the technique, not the syntax or peculiaritiesof Go.\n You might notice that I’ll be using the term Array although in Go thereis a difference between  Arrays andSlices and, technically, I’ll be usingSlices during the code.\n I’ll also try to describe each step, so pretend we’re doing some  PairProgramming\n  All right. As I mentioned below, I’d like to start with a simple test that wouldforce me to add the least amount of code just to get things working, then we canadd more to it. In terms of which algorithm I intend to chose, I’ll go with Bubble sort. Then we evaluate ifthis is good enough for us, if not, we refactor our code to choose a differentimplementation. The important thing here is: at the end, regardless of thealgorithm we choose, the tests need to pass as we’ll still want to sort ourelements.\n Also, for simplicity, our sorting algorithm will only be going to handle numbers(integers to be more precise).\n Let’s start with the simplest input possible, which would be an empty array. Why?Because if we want to sort an empty array, the result should be an empty array!The approach I’d like to follow is to get things going with  minimal moves aspossible because we need constant feedback. We could start with an array with4 elements and write a test which would expect this array to be sorted, but thiswould require us spending more time writing code, less time writing test. I’dlike to get some balance and make sure we don’t leave any edge case behind.\n package sorting_test import  (\t &#34;testing&#34;\t &#34;github.com/matryer/is&#34; ) func  TestSort (t  *testing .T )  {\tt . Run ( &#34;should return same value when array is empty&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\telements  :=  [ 0 ] int { }\t\texpected  :=  [ 0 ] int { }\t\tis . Equal ( Sort (elements ) , expected )\t } ) }\n  go test ./.2021/06/08 14:06:17 exit status 2# alabeduarte.com_test [alabeduarte.com.test]./sorting_test.go:15:12: undefined: SortFAIL alabeduarte.com [build failed]FAILFAIL (0.22 seconds)\n This is because  Sort method is not defined anywhere. Let’s make theminimal effort to get this passing than by defining the method and make itreturn an empty array so our test will pass!\n     Now let’s add another test scenario where it will force us to write somethingother than hardcoded response:\n // Test file func  TestSort (t  *testing .T )  {  // previous test scenario is omitted here ... t . Run ( &#34;should return same value when array has only one element&#34; ,  func (t  *testing .T )  { is  := is . New (t ) elements  :=  [ ] int { 1 } expected  :=  [ ] int { 1 } is . Equal ( Sort (elements ) , expected )  } ) }\n go test ./.2021/06/08 14:04:49 exit status 1 sorting_test.go:29: [] != [1]--- FAIL: TestSort (0.00s) --- FAIL: TestSort/should_return_same_value_when_array_has_only_one_element (0.00s)FAILFAIL alabeduarte.com 0.101sFAILFAIL (0.31 seconds)\n This is expected since our implementation code is always returning an emptyarray. Let’s change that and make the test pass, but in a way that would requirethe minimal effort possible to achieve that:\n    Now that our two scenarios are passing, let’s evaluate our code so far…\n Ok, looking at the code, there’s no much I can think of to improve, except forthe fact that our tests are a bit verbose at the moment. We’re definingvariables  elements and  expected in our tests, then we’re doing the followingevaluation:\n  Considering how simple our test is at the moment, I feel we could do thingsinline, so let’s refactor it:\n // Test file func  TestSort (t  *testing .T )  {\tt . Run ( &#34;should return same value when array is empty&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { } ) ,  [ ] int { } )\t } )\tt . Run ( &#34;should return same value when array has only one element&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { 1 } ) ,  [ ] int { 1 } )\t } ) }\n Now, running the tests, they still should be passing, since we didn’t addanything new:\n  Good. Now everything is “green” (a.k.a passing), let’s add a new scenario thatwould actually require us to apply any sort of algorithm. However, let’s addsomething really simple, like 2 numbers:\n // Test file func  TestSort (t  *testing .T )  {  // ...\tt . Run ( &#34;should return the lowest element followed by the largest element&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { 2 ,  1 } ) ,  [ ] int { 1 ,  2 } )\t } ) }\n  go test ./.2021/06/08 14:21:11 exit status 1 sorting_test.go:31: [2 1] != [1 2]--- FAIL: TestSort (0.00s) --- FAIL: TestSort/should_return_the_lowest_element_followed_by_the_largest_element (0.00s)FAILFAIL alabeduarte.com 0.098sFAILFAIL (0.34 seconds)\n  // Implementation file func  Sort (elements  [ ] int )  [ ] int  {\t if  len (elements )  &lt;=  1  {\t\t return elements\t }\t return  [ ] int {elements [ 1 ] , elements [ 0 ] } }\n  That’s great! The tests are all passing. You might be wondering… ourimplementation doesn’t sound very reliable isn’t it? A few things can go wrongthere… also, it feels like we’re cheating because we’re always grabbing thefirst and second element and returning them into the reverse order, there’s nosorting going on, to be honest. Let’s break the code down and discuss it furtherwhat we can do next:\n // Implementation file func  Sort (elements  [ ] int )  [ ] int  {  // here we are checking if the length is less or equal to 1  // which means that if the array is empty we will return the elements  // themselves (an empty array) and if the array has only one element, it will  // also return itself.\t if  len (elements )  &lt;=  1  {\t\t return elements\t }  // On this case, we&#39;re grabbing the second elemnt and the first element and  // swapping the order of the two\t return  [ ] int {elements [ 1 ] , elements [ 0 ] } }\n Basically, if the array has more than 2 elements, our code will only return thefirst two with reverse order. So here are a few things that can go wrong withthis algorithm:\n When the elements’ length is greater than 2, our sorting algorithm will ignorethe rest, returning an array with fewer elements\n When the elements are already sorted, our sorting algorithm will mess it up byswapping the first two elements\n  It is pretty clear that our code is doing the wrong thing. But as tempting as itmight sound, let’s only add a new code into our implementation if we have a testscenario that would  justify its existence!\n  // Test file func  TestSort (t  *testing .T )  {  // ...\tt . Run ( &#34;should return an array with the same length as the one provided as an input&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tsortedElements  :=  Sort ( [ ] int { 2 ,  1 ,  4 ,  3 } )\t\tactualLength  :=  len (sortedElements )\t\tis . Equal (actualLength ,  4 )\t } ) }\n  go test ./.2021/06/08 14:40:57 exit status 1 sorting_test.go:44: 2 != 4--- FAIL: TestSort (0.00s) --- FAIL: TestSort/should_return_an_array_with_the_same_length_as_the_one_provided_as_an_input (0.00s)FAILFAIL alabeduarte.com 0.101sFAILFAIL (0.34 seconds)\n  // Implementation file func  Sort (elements  [ ] int )  [ ] int  {\t if  len (elements )  &lt;=  1  {\t\t return elements\t }  // take the elements from index 2 onward\trest  := elements [ 2 : ]  // append the rest to the original array we had\t return  append ( [ ] int {elements [ 1 ] , elements [ 0 ] } , rest ... ) }\n   Since we are making sure the array length will always be the same but we’restill compliant with the other test scenarios. However, the implementation nowis a bit clunky and this is a sign that it is time to actually implement thealgorithm!\n Let’s add a scenario that is simple enough to illustrate that we can sort morethan 2 elements without having a clunky implementation. So let’s use 3 elementsthis time:\n // Test file func  TestSort (t  *testing .T )  {  // ...\tt . Run ( &#34;should sort all the elements from the lowest to the largest&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { 2 ,  3 ,  1 } ) ,  [ ] int { 1 ,  2 ,  3 } )\t } ) }\n  go test ./.2021/06/08 14:56:24 exit status 1 sorting_test.go:51: [3 2 1] != [1 2 3]--- FAIL: TestSort (0.00s) --- FAIL: TestSort/should_sort_all_the_elements_from_the_lowest_to_the_largest (0.00s)FAILFAIL alabeduarte.com 0.099sFAILFAIL (0.40 seconds)\n Now let’s implement some sorting algorithm here. For now, let’s use thethe algorithm called  Bubble Sort.\n As stated on Wikipedia, bubble sort is one of the simplest sorting algorithms tounderstand and implement, but its efficiency decreases dramatically on largerlists. More details  here.\n If you want to know more about the implementation of this algorithm in Go, Ialso suggest this material: https://tutorialedge.net/courses/go-algorithms-course/21-bubble-sort-in-go/\n // Implementation file func  Sort (elements  [ ] int )  [ ] int  {\tn  :=  len (elements )\t if n  &lt;=  1  {\t\t return elements\t }\tswapped  :=  true\t for swapped  {\t\tswapped  =  false\t\t for i  :=  0 ; i  &lt; n - 1 ; i ++  {\t\t\t if elements [i ]  &gt; elements [i + 1 ]  {\t\t\t\telements [i ] , elements [i + 1 ]  = elements [i + 1 ] , elements [i ]\t\t\t\tswapped  =  true\t\t\t }\t\t }\t }\t return elements }\n    Our algorithm (bubble sort) is not the most efficient out there. The complexityof the algorithm is  O(n²), where  n is the number of elements being sorted.This means that its efficiency decreases as the number of elements grow. Thereare other options we can use here such as  insertionsort or  selectionsort that are considered myefficient.\n Without necessarily changing anything, let’s do a benchmark with our currentalgorithm using  Go testing benchmarks.\n First, let’s create a small function (within our test file) to generate randomelements with a given length:\n // Test file func  generateRandomElements (n  int )  [ ] int  {\t // initialise a slice with length and capacity of &#34;n&#34;\telements  :=  make ( [ ] int , n , n )\t // populate the slice with random elements\t for i ,  _  :=  range elements  {\t\telements [i ]  = rand . Int ( )\t }\t return elements }\n Now let’s create a function that will iterate over our method Sort taking the testing.B as a parameter:\n // Test file func  benchmarkBubbleSort (n  int , b  *testing .B )  { for i  :=  0 ; i  &lt; b .N ; i ++  { elements  :=  generateRandomElements (n )  // sort elements  Sort (elements ) }\n  // Test file func  BenchmarkBubbleSort3 (b  *testing .B )  {  benchmarkBubbleSort ( 3 , b )  } func  BenchmarkBubbleSort10 (b  *testing .B )  {  benchmarkBubbleSort ( 10 , b )  } func  BenchmarkBubbleSort20 (b  *testing .B )  {  benchmarkBubbleSort ( 20 , b )  } func  BenchmarkBubbleSort50 (b  *testing .B )  {  benchmarkBubbleSort ( 50 , b )  } func  BenchmarkBubbleSort100 (b  *testing .B )  {  benchmarkBubbleSort ( 100 , b )  } func  BenchmarkBubbleSort1000 (b  *testing .B )  {  benchmarkBubbleSort ( 1_000 , b )  } func  BenchmarkBubbleSort100000 (b  *testing .B )  {  benchmarkBubbleSort ( 100_000 , b )  }\n    go test -bench=.goos: darwingoarch: amd64pkg: alabeduarte.comcpu: Intel(R) Core(TM) i7-9750H CPU @ 2.60GHzBenchmarkBubbleSort3-12 17688249 67.22 ns/opBenchmarkBubbleSort10-12 4173184 303.4 ns/opBenchmarkBubbleSort20-12 1228124 1031 ns/opBenchmarkBubbleSort50-12 240789 4240 ns/opBenchmarkBubbleSort100-12 90360 13976 ns/opBenchmarkBubbleSort1000-12 1626 733388 ns/opBenchmarkBubbleSort100000-12 1 14456783580 ns/op\n As you can see, when having 100,000 elements in the array, my machine took 14456783580 nanoseconds to perform the sorting, which was equivalent to about14 seconds.\n Let’s try the same using the  Go’s standardlibrary implementation to sort our elements.Let’s create a small function that will generate random elements and call themethod  Ints from the package sort:\n func  benchmarkGoSort (n  int , b  *testing .B )  {\t for i  :=  0 ; i  &lt; b .N ; i ++  {\t\telements  :=  generateRandomElements (n )\t\t // sort elements\t\tsort . Ints (elements )\t } }\n Now let’s create similar benchmark functions that will compare our  Sortfunctin against  sort.Ints function:\n func  BenchmarkGoSort3 (b  *testing .B )  {  benchmarkGoSort ( 3 , b )  } func  BenchmarkGoSort10 (b  *testing .B )  {  benchmarkGoSort ( 10 , b )  } func  BenchmarkGoSort20 (b  *testing .B )  {  benchmarkGoSort ( 20 , b )  } func  BenchmarkGoSort50 (b  *testing .B )  {  benchmarkGoSort ( 50 , b )  } func  BenchmarkGoSort100 (b  *testing .B )  {  benchmarkGoSort ( 100 , b )  } func  BenchmarkGoSort1000 (b  *testing .B )  {  benchmarkGoSort ( 1_000 , b )  } func  BenchmarkGoSort100000 (b  *testing .B )  {  benchmarkGoSort ( 100_000 , b )  }\n  go test -bench=.goos: darwingoarch: amd64pkg: alabeduarte.comcpu: Intel(R) Core(TM) i7-9750H CPU @ 2.60GHzBenchmarkBubbleSort3-12 18284776 67.53 ns/opBenchmarkBubbleSort10-12 4207515 295.9 ns/opBenchmarkBubbleSort20-12 1201567 1006 ns/opBenchmarkBubbleSort50-12 276207 4262 ns/opBenchmarkBubbleSort100-12 89107 13813 ns/opBenchmarkBubbleSort1000-12 1620 755969 ns/opBenchmarkBubbleSort100000-12 1 14532398965 ns/opBenchmarkGoSort3-12 9781417 124.5 ns/opBenchmarkGoSort10-12 2595421 439.4 ns/opBenchmarkGoSort20-12 1000000 1108 ns/opBenchmarkGoSort50-12 357010 3252 ns/opBenchmarkGoSort100-12 160202 7618 ns/opBenchmarkGoSort1000-12 10000 100856 ns/opBenchmarkGoSort100000-12 75 16205598 ns/op\n As we can see, our algorithm using bubble sort seems a little better until 20elements, where go standard library start to shine being way faster than ours.\n Since the go standard library is more efficient, let’s change our implementationto use that instead and re-run the tests:\n   go test -v=== RUN TestSort=== RUN TestSort/should_return_same_value_when_array_is_empty=== RUN TestSort/should_return_same_value_when_array_has_only_one_element=== RUN TestSort/should_return_the_lowest_element_followed_by_the_largest_element=== RUN TestSort/should_return_an_array_with_the_same_length_as_the_one_provided_as_an_input=== RUN TestSort/should_sort_all_the_elements_from_the_lowest_to_the_largest--- PASS: TestSort (0.00s) --- PASS: TestSort/should_return_same_value_when_array_is_empty (0.00s) --- PASS: TestSort/should_return_same_value_when_array_has_only_one_element (0.00s) --- PASS: TestSort/should_return_the_lowest_element_followed_by_the_largest_element (0.00s) --- PASS: TestSort/should_return_an_array_with_the_same_length_as_the_one_provided_as_an_input (0.00s) --- PASS: TestSort/should_sort_all_the_elements_from_the_lowest_to_the_largest (0.00s)PASSok alabeduarte.com 0.920s\n If you are interested to see the entire code we’ve built, please uncollapse thesection below:\n   package sorting_test import  (\t &#34;math/rand&#34;\t &#34;sort&#34;\t &#34;testing&#34;\t &#34;github.com/matryer/is&#34; ) // Implementation: // // Sort will receive a slice as an input and it will return another slice but // sorted. func  Sort (elements  [ ] int )  [ ] int  {\tn  :=  len (elements )\t if n  &lt;=  1  {\t\t return elements\t }\tswapped  :=  true\t for swapped  {\t\tswapped  =  false\t\t for i  :=  0 ; i  &lt; n - 1 ; i ++  {\t\t\t if elements [i ]  &gt; elements [i + 1 ]  {\t\t\t\telements [i ] , elements [i + 1 ]  = elements [i + 1 ] , elements [i ]\t\t\t\tswapped  =  true\t\t\t }\t\t }\t }\t return elements } // Unit tests: func  TestSort (t  *testing .T )  {\tt . Run ( &#34;should return same value when array is empty&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { } ) ,  [ ] int { } )\t } )\tt . Run ( &#34;should return same value when array has only one element&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { 1 } ) ,  [ ] int { 1 } )\t } )\tt . Run ( &#34;should return the lowest element followed by the largest element&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { 2 ,  1 } ) ,  [ ] int { 1 ,  2 } )\t } )\tt . Run ( &#34;should return an array with the same length as the one provided as an input&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tsortedElements  :=  Sort ( [ ] int { 2 ,  1 ,  4 ,  3 } )\t\tactualLength  :=  len (sortedElements )\t\tis . Equal (actualLength ,  4 )\t } )\tt . Run ( &#34;should sort all the elements from the lowest to the largest&#34; ,  func (t  *testing .T )  {\t\tis  := is . New (t )\t\tis . Equal ( Sort ( [ ] int { 2 ,  3 ,  1 } ) ,  [ ] int { 1 ,  2 ,  3 } )\t } ) } // Benchmarks: func  generateRandomElements (n  int )  [ ] int  {\t // initialise a slice with length and capacity of &#34;n&#34;\telements  :=  make ( [ ] int , n , n )\t // populate the slice with random elements\t for i ,  _  :=  range elements  {\t\telements [i ]  = rand . Int ( )\t }\t return elements } func  benchmarkBubbleSort (n  int , b  *testing .B )  {\t for i  :=  0 ; i  &lt; b .N ; i ++  {\t\telements  :=  generateRandomElements (n )\t\t // sort elements\t\t Sort (elements )\t } } func  benchmarkGoSort (n  int , b  *testing .B )  {\t for i  :=  0 ; i  &lt; b .N ; i ++  {\t\telements  :=  generateRandomElements (n )\t\t // sort elements\t\tsort . Ints (elements )\t } } func  BenchmarkBubbleSort3 (b  *testing .B )  {  benchmarkBubbleSort ( 3 , b )  } func  BenchmarkBubbleSort10 (b  *testing .B )  {  benchmarkBubbleSort ( 10 , b )  } func  BenchmarkBubbleSort20 (b  *testing .B )  {  benchmarkBubbleSort ( 20 , b )  } func  BenchmarkBubbleSort50 (b  *testing .B )  {  benchmarkBubbleSort ( 50 , b )  } func  BenchmarkBubbleSort100 (b  *testing .B )  {  benchmarkBubbleSort ( 100 , b )  } func  BenchmarkBubbleSort1000 (b  *testing .B )  {  benchmarkBubbleSort ( 1_000 , b )  } func  BenchmarkBubbleSort100000 (b  *testing .B )  {  benchmarkBubbleSort ( 100_000 , b )  } func  BenchmarkGoSort3 (b  *testing .B )  {  benchmarkGoSort ( 3 , b )  } func  BenchmarkGoSort10 (b  *testing .B )  {  benchmarkGoSort ( 10 , b )  } func  BenchmarkGoSort20 (b  *testing .B )  {  benchmarkGoSort ( 20 , b )  } func  BenchmarkGoSort50 (b  *testing .B )  {  benchmarkGoSort ( 50 , b )  } func  BenchmarkGoSort100 (b  *testing .B )  {  benchmarkGoSort ( 100 , b )  } func  BenchmarkGoSort1000 (b  *testing .B )  {  benchmarkGoSort ( 1_000 , b )  } func  BenchmarkGoSort100000 (b  *testing .B )  {  benchmarkGoSort ( 100_000 , b )  }\n  If you read the article and came this far, thank you very much. I hope I wasable illustrate how would be like to develop a sorting algorithm driven bytests.\n You might have noticed that I wasn’t too concerned about picking up the mostperforming algorithm implementation, to begin with, but rather, I was interestedto\n......", "posttime": "2021-06-23 23:50:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithms,排序,drive,测试", "title": "让我们测试一些排序算法 ", "title_en": "Let's test-drive some sorting algorithms", "transed": 1, "url": "https://alabeduarte.com/test-driven-algorithms/sorting/", "via": "", "real_tags": ["算法", "排序", "drive", "测试"]}, {"category": "", "categoryclass": "", "imagename": "af7a637d99185879ec11c14772d6b17f.png", "infoid": 1067740, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "punycode。）但请注意，Hostname组件（当AhostName而不是IP地址时）没有要求是完全限定的域名（FQDN）;也可能是一个部分合格的域名，因为决议遵循通常的本地存根resolver＆＃39;斜语和可能涉及/etc/nsswitch.conf，/ etc / hosts和/etc/resolv.conf。\n 这实际上非常有用，几种群体使用这是一个整洁的小技巧，以提供acompany-internall-shortener / bookmarkingredirector，如golinks，没有为浏览器插件或类似于这样的东西：\n   现在，这里唯一有点令人困惑的部分是无论你运行自己的CA，你可以＆＃39; t获得＆＃34的actericate; Go＆＃34 ;,,,,,,,,,,,,,,,,,,,,,,,,,,,,但是，无论哪种方式，你都会看到＆＃34; hostname＆＃34; URL需要的组件是完全合格的。\n  ＆＃34;权威＆＃34;组分可以进一步容纳＆＃34;端口＆＃34;子组件。当服务器使用非默认端口时，我肯定有效地＆＃39; ve seenthat在行动中，所以＆＃39;它真的很多。令人惊讶的是。砍掉港口只是意味着你＆＃ 39; LL使用与该方案相关联的Thedefault端口。\n 这里的一个边缘条件是您可以将波斯特空白留下，但仍然包括＆＃34; ：＆＃34 ;:\n  另一个边缘条件是RFC3986DOES未在端口号上指定最大值（每个RFC1340 / RFC6335IS在0  -  65535的范围内）或者如何处理零填充，因为当然取决于客户端处理URL的客户端。这使得这是一个可怕的URL：\n   现在为＆＃34; Pathname＆＃34;这个＆＃39; s fun.it看起来像......好吧，一个路径名。就像在你的系统上。将服务器删除，PrerogativeTo以其喜欢的方式解释它，这意味着，文件系统路径的所有边缘条件也在此处使用。 \nA＆＃34; Pathname＆＃34;有一个来自＆＃34的不同乌卢其字符; hostname＆＃34;组件，因为它不受主机名ordns限制的绑定。这也意味着在URL中，我们＆＃39;现在切换某些字符的含义，例如＆＃34; 。＆＃34 ;.几乎是一个＆＃34中唯一不允许的角色; pathname＆＃34;组件是nul和/;允许所有其他类别明确地单纯属于百分比的数据，然后在解析本地路径之前，服务器可以在该数据中进行解码。\n 这包括空格，以及以下两个URLSLEAD到位于目录中的同一文件; SNAMED＆＃34; ＆＃34 ;:\n   $ pwd / htdocs / www.netmeister.org $ ls -la＆＃34;博客/ urls /＆＃34;总计12drwxr-xr-x 2 jschauma滚轮512 19月19日14:58 .drwxr-xr-x 6 jschauma滚轮1024 6月20日16:26 ..- rw-r  -  r-- 1 jschauma轮子85 Jun 19 14:59 f $ curl -i＆＃34; https：//www.netmeister.org/blog/urls/ / f＆＃34; http / 2 200日期：星期一，21日2021 15:45:31 gmtserver：apache / 2.4。 43（UNIX）openssl / 1.1.1klast-modified：SAT，19六月2021 18:59:53 GMTContent-Length：85这个文件位于名为＆＃34的目录中; ＆＃34; .see https://www.netmeister.org/blog/urls.html$$\n 是的，当然，您可以给出路径名组件任何有效名称，例如＆＃34;💩＆＃34 ;:\n  路径名可能是空的，或者完全由emptemy子组件组成，使所有这些都转到同一个地方：\n  但是＆＃34; Pathname＆＃34; URL发送HTTP请求的组件一旦您已将AC连接到服务器，也可能是完整的URLittitelf，而不仅仅是＆＃34; Pathname＆＃34;成分。 RFC7230IN事实在与代理交谈时授权此项：\n $ openssl s_client -connect www.netmeister.org:443 -quiet -crlf 2＆gt; / dev / null head https://www.netmeister.org/blog/urls.html http / 1.0http / 1.1 200 Okdate：Mon，21 2021年6月2021年6月18日GMTserver：Apache / 2.4.43（UNIX）openssl / 1.1.1klast-Modified：Mon，21 Jun 2021 18:24:38 GMTContent-Length：29963Content型：Text / HTML; charset = UTF-8 \n如果你＆＃39;重新与代理商交谈，你可以刚刚出现任何方案：//进入＆＃34的权限; Request-Uri＆＃34;，这是现在现在已成为此上下文的情况，Andat最少Apache忽略了路径名中的所有内容：\n $ openssl s_client -connect www.netmeister.org:443 -quiet -crlf 2＆gt; / dev / null get gopher：//facebook.com/blog/urls.html http / 1.0http / 1.1 200 okdate：mon，21 2021 18:43:28 GMTserver：Apache / 2.4.43（UNIX）openssl / 1.1.1kContent型：Text / HTML; Charset = UTF-8Content语言：en [...]\n  点很有趣。如果您的Web服务器在类似AUNIX的系统上运行，则为路径名，单个DOTMeans＆＃34;此目录＆＃34;和两个点意味着＆＃34;我的parentdirectory＆＃34;这就是为什么你看到请求的原因例如，＆＃34; /../../../../../../../../../../../../../1.. / ...... inyour web服务器和＃39; s日志，试图突破您的我们的服务器文档根目录。\n   现在，一个体面的Web服务器不允许请求在其文档根目录外的请求，但是这里＆＃39;这里更有意思的是，此分辨率发生在每个RFC3986的LocalFileSystem路径分辨率之前（嗯，应该发生）意味着你可以假装 - ＆＃34; ../&#34;周末存在的目录：\n $ pwd / htdocs / www.netmeister.org $ ls -ld tdne ls：d：没有这样的文件或directoryls：e：没有这样的文件或directoryls：n：没有这样的文件或directoryls：t：没有这样的文件或目录$ ls -ld t / h / e / s / e / d d / I / R / E / C / T / O / R / I / E / S /。 。/../../../../../../../../../../不要/.. /../../e/x/i/s/t/../../../../../.. / blog / urls.htmlls：t / h / e / s / e / / ...../../../../d/i / r/e/c/t/o/r/i/e/s/d/../../../ ... ../../../../../../d/../../n/o/t/../../../t/../../'o/x/i/s. /t/../../../../../../.. /bog/urls.html：没有这样的文件或目录$ curl -i https://www.netmeister.org/t/h/e/s /e/../../../../../../../../1../i/r/e/c/t/or/r/i/e/s/../../ ... ./../../../../../../d/o/../../n/t/t/../../../t/ X / I / S / T / d / ...博客/ urls.htmlhttp / 2 200日期：Mon，21 Jun 2021 16:07:35 GmTserver：Apache / 2.4.43 （UNIX）openssl / 1.1.1klast-modified：mon，21日2021年6月21日16:03:41 GMTContent-Length：24107Content型：Text / HTML; Charset = UTF-8 Content语言：EN $\n 但当然你可以拥有文件或目录名和＃34; ...＆＃34;或＆＃34; ....＆＃34;等等，所以关注会给你一个实际文件：\n     嗯，但这个莫尔斯代码Pathname组件很长。我们可以制作多久？ IFIT＆＃39; s路径名称，那么它应该受到特工系统的限制，并熟悉，我可以＆＃39; tCreate一个名录＆＃39; s长于ffs_maxnamlen = 255个字符。但我可以创建嵌套的子模型，最终构建击中操作系统的完整路径＆＃39; s path_max = 1024： \n$ PWD / htdocs中/ www.netmeister.org $ CD博客/ URL $ LS -ld ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddrwx-XR-X 19年6月3日17:40 ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd jschau到车轮512 / $ CD CD DD DD * $ * $ * $ CD CD DD DD * KSH：CD：dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd：坏目录$ PWD / htdocs中/ www.netmeister.org /博客/ URL / ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd / ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd / $ ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd\n     ＆＃34; 〜＃34;是特殊的，除了它＆＃39; s note。 INTHIS，IT＆＃39;很多像你谢尔的TINDE扩张一样 - 它只是如果它＆＃39;＆＃34之后的第一特征才会发生; /＆＃34;这是＆＃34; Pathname＆＃34;。如果这个第一个段开始＆＃34; /〜用户名/，然后是许多Web ServersDefault（或可以配置）以解决和＃34的Theremaine; Pathname＆＃34;从本发明＆＃39; s＆＃34; web空间＆＃34;常常〜用户名/ public_html。\n   但它值得注意的是，对Auser的扩张＆＃39;只有常规的个人网空间是公约：rfcsdon＆＃39; tipps讨论了这一点，尽管支持A＆＃34; Userdir＆＃34;似乎是头灯回来作为cernhttpd和ncsa_httpd.但是，关于＆＃34的速度没有什么特别的特别之处; 〜＃34;字符根本。当然，您可以使用名为＆＃34的目录或文件; 〜＆＃34;：\n  到目前为止，一切都很好。但是如果捐赠者有一个名为＆＃34的用户会发生什么;用户名＆＃34;或者你这样做，并且有一个文件名和＃34; 〜用户名＆＃34;在你的我们的根目录中＆＃39;让＆＃39; s试一试：\n $ pwd / htdocs / www.netmeister.org $ id nobody uid = 32767（nobody）go = 39（nobody）组= 39（nobody）$ ls -ld〜nobody / public_html \\〜nobodyls：/ nonexistent // public_html：否这样的文件或目录-RW-R  -  R-- 1 Jschauma滚轮4月20日15:22〜Nobody $ Cat \\〜nobodythis是一个名为＆＃34;〜nobody＆＃34;符合＆＃34;〜notauser＆＃34;指向它.see https://www.netmeister.org/blog/urls.html$$卷曲-i https：//www.netmeister.org/~nobodyhttp/2 404日期：星期一，21日2021 20:12： 21 GmTserver：Apache / 2.4.43（UNIX）openssl / 1.1.1kcontent yext：text / html; Charset = ISO-8859-1 $ ID NotaUserID：NOTAUSER：没有这样的用户$ ls -ld〜notaUser / public_html \\〜notauser ls：〜notauser / public_html：注意一个directorylwx ------ 1 jschauma滚轮7月20日：23〜NOTAUSER  - ＆gt; 〜没有人$ cat \\〜notauserthis是一个名为＆＃34;〜没有人和＃34;符合＆＃34;〜notauser＆＃34;指向它.see https://www.netmeister.org/blog/urls.html$$卷曲-i https：//www.netmeister.org/2notauserhttp/2 200日期：周一，21日2021 20:17： 09 GmTserver：Apache / 2.4.43（UNIX）openssl / 1.1.1kcontent-length：124content-language：en $\n 也就是说，如果您的Web服务器支持（和哈希为）用户目录，并且您提交请求＆＃34; 〜用户名＆＃34;：\n 如果＆＃34;用户名＆＃34;是一个有效的用户，＆＃34的serverlooks; 〜用户名/ public_html＆＃34; open open该目录不存在，但文件〜用户名确实存在 \n如果＆＃34;用户名＆＃34;不是一个有效的人，然后发生正常的路径名决议，意味着文件＆＃34; 〜用户名＆＃34;存在于WEB服务器和＃39; S文档根目录中，它是服务的\n   A＆＃34;查询＆＃34; URL中的组件遵循A＆＃34; ？＆＃34;字符和......基本上没有完全融合。你可以把任何东西放入查询中，包括否则无法实现的人物，如＆＃34; /＆＃34;和＃34; ？＆＃34 ;:\n  现在按照惯例，查询往往使用A＆＃34; key1 = value1＆amp; key2 = value2＆＃34;语法，虽然当然没有什么需要你这样做，但是oreven要使用＆＃34; ＆amp;＆＃34;作为分隔符; SomeSystems也（用于）使用＆＃34; ;＆＃34;\n 但是，它真的都有查询。它＆＃39; HTTP请求的SPART和服务器可以将ITINTO放置为＆＃34; query_string＆＃34;\n  URL的最后一个组成部分是＆＃34;碎片identifier＆＃34;这个＆＃39;很奇怪，虽然＆＃39;显然是一个URL，它旨在完全向客户端Bescoped，而不是服务器。实际上，常见的HTTP客户端确认将片段归功于服务器，该事实是由eg，https://privatebin.info/，decryption键放入URL的Fragment Component中的系统，然后确保服务器不知道键。\n 您的常见Web浏览器甚至例如，Curl（1）将在提前调整HTTP请求之前绑住片段，但当然您从发送Get RequestWith包含一个片段的请求时，您当然可以创建包含A的文件名，并且可以创建一个包含A的文件名。 ＃34; ＃＆＃34;\n 现在Apache httpd处理A＆＃34; ＃＆＃34;在那里，您可以在其中作为400个不良请求，但RFC2616DOES不授权这一点。例如，Bozohttpd不治疗＆＃34; ＃＆＃34;在那里，uriest-uri，所以您可以例如makethis请求： \n$ echo -ne＆＃34; get /blog/urls/urls.html#fragment http / 1.0 \\ r \\ n \\ r \\ n＆＃34; | \\ nc www.netmeister.org 8080http / 1.0 200 okdate：tue，22 jun 2021 00:12:22 GmTserver：Bozohttpd / 20170201Accept-ranges：Byteslast-Modified：Byteslast-Modified：Byteslast-Modified：Sat，19 Jun 2021 12:58:28 GMTContent型：文本/ plaincontent-length：113刚刚恰好包含一个＆＃39的普通文件;＃＆＃39;在它的姓名.see https://www.netmeister.org/blog/urls.html\n  现在与所有这一长的讨论，让＆＃39; s从上面回到那个愚蠢的网址：\n  现在这看起来像是水豚鼠等同于URL。 Let＆＃39; s Untangle豪了扬声器成为一个有效的链接。\n 第一个＆＃34; https：//＃34;没有违约，只是你平常的计划和奉承\n   现在我们开始发挥愚蠢的技巧：＆＃34; / www wetmeister.org＆＃34;使用小部分册字符作为密码的一部分。编码，这看起来如此：％E2％81％84％E2％81％84www％2enetmeister％2eorg\n  下一个＆＃34; https＆＃34;现在是权限的主机名组件：依赖于/ etc / hosts的部分限定主机名，其中包含一个指向https到正确的IP地址的条目。\n 下一个＆＃34; ：＆＃34;现在是主机名和端口组件的分隔符。在这里，它后跟一个空端口，使Wedefault到特定于方案的端口，443在该配置。 \n下一个＆＃34; //＃34;然后仅仅是权威的结束，后跟一个空的路径组成。\n 下一个＆＃34; www.netmeister.org＆＃34;现在通过该名称提供目录，其次是标准的分隔符，＆＃34; /\n 在此之后，我们找到文件名和＃34; https：//www.netmeister.org//＆＃34;再次使用分数斜杠字符。\n  查询允许任何字符，所以在这里我们得到一个名为＆＃34; https：//www.netmeister.org&#34;与一个＆＃34; =＆＃34;分配值＆＃34; https：//www.netmeister.org&#34;\n  最后，我们有一个碎片，可能会包含任何角色，所以我们填充了另一个角色和＃34; https：//www.netmeister.org&#34;在那里。\n    好的，所以什么＆＃39;这是什么大问题？为什么我在上面的情况下打扰了上面的情况，当我甚至是屁股？\n 我称之为＆＃34;脑袋模糊＆＃34;或＆＃34; logicalfuzzing＆＃34 ;:我试图了解每一天使用的东西，它是什么＆＃39; scapting todo，它如何定义，然后有时我去＆＃34;呵呵，我会发生什么我把x放在旁边。＆＃34; \n我也发现它有趣的是网址如何超越正常浏览器上下文，以及我们如何依赖于客户端和服务器，即使这不清楚。 ", "note_en": "Punycode.)        But note that there is no requirement for the hostname component (when it  is ahostname and not an IP address) to be a fully-qualified domain name ( FQDN);a partially qualified domain name is also possible,as resolution follows the usual local stub resolver&#39;slogic and likely  involving /etc/nsswitch.conf,  /etc/hosts,and  /etc/resolv.conf.\n This is actually quite useful, and severalcompanies use this as a neat little trick to provide acompany-internal link-shortener / bookmarkingredirector like  golinks without theneed for a browser plugin or anything like that:\n   Now the only slightly confusing part here is thatunless you run your own CA, you can&#39;t get acertificate for &#34; go&#34;, so the short links mustbe accessed using plain http. But either way, you seethat the &#34; hostname&#34; component in a URL neednot be fully qualified.\n  The &#34; authority&#34; component may further containa &#34; port&#34; subcomponent. I&#39;m sure you&#39;ve seenthat in action when a server uses a non-default port,so there isn&#39;t really much that&#39;s surprising here.Leaving out the port simply means that you&#39;ll use thedefault port associated with the scheme.\n One edge condition here is that you can leave theport blank, but still include the &#34; :&#34;:\n  The other edge condition is that  RFC3986does not specify a maximum value on the port number(which per  RFC1340/  RFC6335is in the range of  0 - 65535) or how e.g.,zero-padding is handled, as that of course depends onthe client processing the URL. Which makes this avalid URL:\n   Now for the &#34; pathname&#34;. This one&#39;s fun.It looks like... well, a pathname. Just like on yourfile system. Putting aside the server&#39;s prerogativeto interpret it any way it likes, this means that allthe various edge conditions for file system path namesapply here, too.\n A &#34; pathname&#34; has a different set ofallowed characters from the &#34; hostname&#34;component, since it is not bound by the hostname orDNS limitations. That also means that within a URL,we&#39;re now switching the meaning of certain characters,such as &#34; .&#34;. Pretty much the only character not allowed in a &#34; pathname&#34;component are  NUL and  /; all othercharacters are allowed either explicitly orimplicitly as  percentencoded data, which the server may then decodeagain before resolving the local path.\n This includes spaces, and the following two URLslead to the same file located in a directory that&#39;snamed &#34; &#34;:\n   $ pwd/htdocs/www.netmeister.org$ ls -la &#34;blog/urls/ &#34; total 12drwxr-xr-x 2 jschauma wheel 512 Jun 19 14:58 .drwxr-xr-x 6 jschauma wheel 1024 Jun 20 16:26 ..-rw-r--r-- 1 jschauma wheel 85 Jun 19 14:59 f$ curl -i &#34;https://www.netmeister.org/blog/urls/ /f&#34;HTTP/2 200 date: Mon, 21 Jun 2021 15:45:31 GMTserver: Apache/2.4.43 (Unix) OpenSSL/1.1.1klast-modified: Sat, 19 Jun 2021 18:59:53 GMTcontent-length: 85This file is in a directory named &#34; &#34;.See https://www.netmeister.org/blog/urls.html$\n And yes, of course you can give the path name component any valid name, such as &#34;💩&#34;:\n  The pathname may be empty, or consist entirely ofempty subcomponents, making all of these go to the same place:\n  But the &#34; pathname&#34; component of a URL sentin the HTTP request once you&#39;ve already made aconnection to the server may also be the full URLitself, not just the &#34; pathname&#34; component. RFC7230in fact mandates this when talking to a proxy:\n $ openssl s_client -connect www.netmeister.org:443 -quiet -crlf 2&gt;/dev/null HEAD https://www.netmeister.org/blog/urls.html HTTP/1.0HTTP/1.1 200 OKDate: Mon, 21 Jun 2021 18:36:39 GMTServer: Apache/2.4.43 (Unix) OpenSSL/1.1.1kLast-Modified: Mon, 21 Jun 2021 18:24:38 GMTContent-Length: 29963Content-Type: text/html; charset=utf-8\n And if you&#39;re not talking to a proxy, you can justput  any  scheme://authority into the&#34; Request-URI&#34;,which is what this now has become in this context, andat least Apache ignores everything up to the pathnamecomponent:\n $ openssl s_client -connect www.netmeister.org:443 -quiet -crlf 2&gt;/dev/null GET gopher://facebook.com/blog/urls.html HTTP/1.0HTTP/1.1 200 OKDate: Mon, 21 Jun 2021 18:43:28 GMTServer: Apache/2.4.43 (Unix) OpenSSL/1.1.1kContent-Type: text/html; charset=utf-8Content-Language: en[...]\n  Dots are funny. If your web server runs on aUnix-like system, then for a pathname, a single dotmeans &#34;this directory&#34;, and two dots means &#34;my parentdirectory&#34;, which is why you see requests for e.g.,&#34; /../../../../../../../../../etc/passwd&#34; inyour web server&#39;s logs, trying to break out of yourweb servers document root.\n   Now a decent web server does not allow a request tobe made outside of its document root, but what&#39;sperhaps more interesting here is that this resolutionof  dot-segments happens (well, should happen)  prior to localfilesystem path resolution per  RFC3986,which means that you can pretend-&#34; ../&#34; aroundnon-existent directories:\n $ pwd/htdocs/www.netmeister.org$ ls -ld t d n e ls: d: No such file or directoryls: e: No such file or directoryls: n: No such file or directoryls: t: No such file or directory$ ls -ld t/h/e/s/e/../../../../../d/i/r/e/c/t/o/r/i/e/s/../../../../../../../../../../../d/o/../../n/o/t/../../../e/x/i/s/t/../../../../../blog/urls.htmlls: t/h/e/s/e/../../../../../d/i/r/e/c/t/o/r/i/e/s/../../../../../../../../../../../d/o/../../n/o/t/../../../e/x/i/s/t/../../../../../blog/urls.html: No such file or directory$ curl -I https://www.netmeister.org/t/h/e/s/e/../../../../../d/i/r/e/c/t/o/r/i/e/s/../../../../../../../../../../../d/o/../../n/o/t/../../../e/x/i/s/t/../../../../../blog/urls.htmlHTTP/2 200 date: Mon, 21 Jun 2021 16:07:35 GMTserver: Apache/2.4.43 (Unix) OpenSSL/1.1.1klast-modified: Mon, 21 Jun 2021 16:03:41 GMTcontent-length: 24107content-type: text/html; charset=utf-8content-language: en$\n But of course you can have files or directoriesnamed &#34; ...&#34; or &#34; ....&#34; etc., so thefollowing will get you an actual file:\n     Hmm, but this morse code pathname component isgetting pretty long. How long can we make those? Ifit&#39;s a path name, then it should be subject to theoperating systems limits, and sure enough, I can&#39;tcreate a directory that&#39;s longer than FFS_MAXNAMLEN = 255 characters. But I can create nested subdirs to ultimately builda full path that hits the operating system&#39;s PATH_MAX = 1024:\n $ pwd/htdocs/www.netmeister.org$ cd blog/urls $ ls -ld ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddrwxr-xr-x 3 jschauma wheel 512 Jun 19 17:40 ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd/$ cd dd*$ cd dd*$ cd dd*$ cd dd*ksh: cd: dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd: bad directory$ pwd/htdocs/www.netmeister.org/blog/urls/ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd/ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd/ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd$\n     &#34; ~&#34; is special, except when it&#39;s not. Inthis regard, it&#39;s a lot like tilde expansion in yourshell -- it only takes place if it&#39;s the firstcharacter after the &#34; /&#34; that begins the&#34; pathname&#34;. If this first segment beginswith &#34; /~username/, then many web serversdefault (or can be configured) to resolving theremainder of the &#34; pathname&#34; from under thatuser&#39;s &#34;web space&#34;, often times ~username/public_html.\n   But it&#39;s worth noting that the expansion to auser&#39;s personal web space is convention only: the RFCsdon&#39;t appear to discuss this, although support for a&#34; UserDir&#34; appears to go as far back as  CERNhttpd and  ncsa_httpd.But there is really nothing special about the&#34; ~&#34; character at all. You can, of course,have a directory or file named &#34; ~&#34;:\n  So far, so good. But what happens if you either donot have a user named &#34; username&#34; or you do,and there is a file name &#34; ~username&#34; in yourweb server&#39;s root? Let&#39;s give it a try:\n $ pwd/htdocs/www.netmeister.org$ id nobody uid=32767(nobody) gid=39(nobody) groups=39(nobody)$ ls -ld ~nobody/public_html \\~nobodyls: /nonexistent//public_html: No such file or directory-rw-r--r-- 1 jschauma wheel 4 Jun 20 15:22 ~nobody$ cat \\~nobodyThis is a file named &#34;~nobody&#34; with a symlink of &#34;~notauser&#34; pointing to it.See https://www.netmeister.org/blog/urls.html$ curl -I https://www.netmeister.org/~nobodyHTTP/2 404 date: Mon, 21 Jun 2021 20:12:21 GMTserver: Apache/2.4.43 (Unix) OpenSSL/1.1.1kcontent-type: text/html; charset=iso-8859-1$ id notauserid: notauser: No such user$ ls -ld ~notauser/public_html \\~notauser ls: ~notauser/public_html: Not a directorylrwx------ 1 jschauma wheel 7 Jun 20 15:23 ~notauser -&gt; ~nobody$ cat \\~notauserThis is a file named &#34;~nobody&#34; with a symlink of &#34;~notauser&#34; pointing to it.See https://www.netmeister.org/blog/urls.html$ curl -I https://www.netmeister.org/~notauserHTTP/2 200 date: Mon, 21 Jun 2021 20:17:09 GMTserver: Apache/2.4.43 (Unix) OpenSSL/1.1.1kcontent-length: 124content-language: en$\n That is, if your web server supports (and hasenabled) user directories, and you submit a requestfor &#34; ~username&#34;:\n if &#34; username&#34; is a valid user, the serverlooks for &#34; ~username/public_html&#34;, evenif that directory does  not exist, but the file ~username  does exist\n if &#34; username&#34; is  not a validuser, then normal pathname resolution takes place,meaning if the file &#34; ~username&#34; exists in theweb server&#39;s document root, it is served\n   A &#34; query&#34; component in a URL follows a&#34; ?&#34; characters and... is basically not welldefined at all. You could put just about anything into the query, including charactersthat would otherwise not be possible, such as&#34; /&#34; and &#34; ?&#34;:\n  Now by convention, queries tend to use a&#34; key1=value1&amp;key2=value2&#34; syntax,although of course nothing requires you to do that, oreven to use the &#34; &amp;&#34; as a separator; somesystems also (used to) use &#34; ;&#34;.\n But that&#39;s really all there is to the query. It&#39;spart of the HTTP request and the server may put itinto the environment as &#34; QUERY_STRING&#34;.\n  The last component of the URL is the &#34; fragmentidentifier&#34;. This one&#39;s weird in that, whileit&#39;s obviously part of the URL, it is intended to bescoped entirely to the  client, not the server. In fact, common HTTP clients do notsend the fragment to the server, a fact that is thenused by systems like e.g.,  https://privatebin.info/,whereby the decryption key is placed into the fragmentcomponent of the URL, ensuring that the server doesnot see the key.\n Your common web browsers and even e.g., curl(1) will strip the fragment prior tosending the HTTP request, but of course nothingprevents you from sending a  GET requestwith a  Request-URI containing a fragment, andyou can of course create a file name containinga &#34; #&#34;.\n Now Apache httpd treats a &#34; #&#34; in theRequest-URI as a  400 Bad Request, but  RFC2616does not mandate this.  bozohttpd,for example, does not treat &#34; #&#34; in theRequest-URI as special, so you can, for example, makethis request:\n $ echo -ne &#34;GET /blog/urls/urls.html#fragment HTTP/1.0\\r\\n\\r\\n&#34; | \\ nc www.netmeister.org 8080HTTP/1.0 200 OKDate: Tue, 22 Jun 2021 00:12:22 GMTServer: bozohttpd/20170201Accept-Ranges: bytesLast-Modified: Sat, 19 Jun 2021 12:58:28 GMTContent-Type: text/plainContent-Length: 113Just a normal file that just happens to contain a &#39;#&#39; in its name.See https://www.netmeister.org/blog/urls.html\n  Now with all of this long discussion, let&#39;s go backto that silly URL from above:\n  Now this really looks like the  Buffalobuffalo equivalent of a URL. Let&#39;s untangle howthis becomes a valid link.\n The first &#34; https://&#34; is nothing out of theordinary, just your usual scheme and start ofauthority\n   Now we start to play silly tricks:&#34; ⁄ ⁄www.netmeister.org&#34; uses the fractionslash characters as part of the  password.Percent-encoded, this would look like so: %E2%81%84%E2%81%84www%2Enetmeister%2Eorg\n  The next &#34; https&#34; now is the hostname component of the  authority: a  partially qualified hostname, that relies on  /etc/hosts containing an entry pointing  https to the right IP address.\n The next &#34; :&#34; now is the separator of the hostname and the  port components.Only here, it is followed by an empty port, so wedefault to the scheme-specific port, 443 in thiscase.\n The next &#34; //&#34; then is merely the end ofthe  authority followed by an empty pathcomponent.\n The next &#34; www.netmeister.org&#34; now issimply a directory by that name, followed by a normaldirectory separator,&#34; /\n Following that, we find a file name &#34; https:⁄⁄www.netmeister.org⁄⁄&#34; again using the fraction slash character.\n  Queries allow just about any characters, so here we get a key named &#34; https://www.netmeister.org&#34; with a &#34; =&#34; assigned value of &#34; https://www.netmeister.org&#34;.\n  And finally, we have a fragment, which may containjust about any character as well, so we stuff another&#34; https://www.netmeister.org&#34; in there aswell.\n    Ok, so what&#39;s the big deal? Why did I bother withall of the above, when I didn&#39;t even breakanything?\n I call it &#34; brain fuzzing&#34; or &#34; logicalfuzzing&#34;: I try to understand what something thatI use every single day does, what it&#39;s supposed todo, how it&#39;s defined, and then sometimes I go &#34;Huh, Iwonder what happens if I put  X in hereinstead.&#34;\n I also find it interesting how URLs haveimplications beyond just the normal browser context,and how we depend on both clients and servers tobehave a certain way, even if that is not clearlyspecified.", "posttime": "2021-06-23 23:49:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "url,urls,服务器", "title": "URL：这很复杂 ", "title_en": "URLs: It's Complicated", "transed": 1, "url": "https://www.netmeister.org/blog/urls.html", "via": "", "real_tags": ["url", "urls", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "c8ec90b937dd8029717d91bc9125f6bc.png", "infoid": 1067739, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开源JavaScript和Android / IOS SDK用于构建Web和移动应用程序 ", "note_en": "Open-source JavaScript and Android / iOS SDKs for building web and mobile apps", "posttime": "2021-06-23 23:49:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地图,open,javascript", "title": "Maplibre.org打开地图SDKs for Web和Mobile：社区驱动的地图箱GL FORK ", "title_en": "Maplibre.org Open Maps SDKs for web and mobile: community driven Mapbox GL fork", "transed": 1, "url": "https://maplibre.org/", "via": "", "real_tags": ["地图", "open"]}]