[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1075153, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "烫手山芋：Coinbase、Binance和Kraken这三家世界上最大的加密货币交易所正与其他交易所一起拒绝乌克兰冻结所有俄罗斯用户的请求；账户虽然这些公司已经冻结了制裁对象的账户，但它们不会对俄罗斯账户实施全面封锁。\n周日，乌克兰&#39；俄罗斯副总理米哈伊洛·费德罗夫（Mykhailo Federov）在推特上呼吁所有主要加密交换都屏蔽俄罗斯用户的地址。他写道：“不仅冻结与俄罗斯和白俄罗斯政客有关的地址，而且冻结破坏普通用户的地址，这一点至关重要。”。\n我&#39；我要求所有主要的加密交易所屏蔽俄罗斯用户的地址。它&#39；这不仅对冻结与俄罗斯和白俄罗斯政客有关的地址至关重要，而且对破坏普通用户也至关重要。\n-米哈伊洛·费多罗夫（@FedorovMykhailo）2022年2月27日\n费多罗夫还对俄罗斯和白俄罗斯政界人士持有的数字钱包信息给予“慷慨奖励”。\n乌克兰加密社区准备为任何有关俄罗斯和白俄罗斯政客及其周围环境的加密钱包的信息提供慷慨的奖励。战争罪行必须追究和惩罚！如需分享信息，请致电：https://t.co/XHidwUQ8bE.\n-米哈伊洛·费多罗夫（@FedorovMykhailo）2022年2月26日\nBinance的发言人告诉CNBC，“我们不会单方面冻结数百万无辜用户的账户。”\n“加密旨在为全球各地的人们提供更大的财务自由。单方面决定禁止人们使用他们的加密将与加密存在的原因背道而驰。”\nBinance还表示，它将向乌克兰的人道主义工作捐赠1000万美元，并将启动一个“加密优先”众筹网站，进一步筹集2000万美元。\n美国、英国、欧洲和加拿大都对入侵乌克兰做出了回应，对俄罗斯银行、寡头、政客等实施了一系列制裁。虽然大型加密交易所冻结了受制裁用户的账户，但这些公司拒绝对所有俄罗斯人采取同样的行动。\n科恩贝斯告诉主板：“单方面全面禁令将惩罚普通俄罗斯公民，因为他们的政府对一个民主邻国的侵略，他们正在承受历史性的货币动荡。”。\n另一家大型交易所Kraken表示，如果没有法律要求，它不能冻结其俄罗斯用户的账户。Kraken exchange首席执行官杰西·鲍威尔（Jesse Powell）表示，此举将违反该公司的法律；“自由主义价值观”\nKuCoin首席执行官约翰尼·吕（Johnny Lyu）也持类似观点：“作为一个中立的平台，我们不会在没有法律要求的情况下冻结来自任何国家的任何用户的帐户。在这个困难时期，不应该鼓励加剧紧张局势、影响无辜人民权利的行为。”\n本周，比特币的价格已飙升至4.3万美元以上，此前，比特币在金融危机后贬值近1万美元。", "note_en": "A hot potato: Coinbase, Binance, and Kraken, three of the world’s largest cryptocurrency exchanges, are joining others in refusing requests by Ukraine to freeze all Russian users&#39; accounts. While the companies have frozen the accounts of those targeted by sanctions, they will not implement a universal block on Russian accounts.\n  On Sunday, Ukraine&#39;s Vice Prime Minister Mykhailo Federov tweeted a plea for all major crypto exchanges to block addresses of Russian users. “It&#39;s crucial to freeze not only the addresses linked to Russian and Belarusian politicians, but also to sabotage ordinary users,” he wrote.\n I&#39;m asking all major crypto exchanges to block addresses of Russian users.  It&#39;s crucial to freeze not only the addresses linked to Russian and Belarusian politicians, but also to sabotage ordinary users.\n— Mykhailo Fedorov (@FedorovMykhailo)  February 27, 2022\n Fedorov is also offering a “generous reward” for information on digital wallets held by Russian and Belarusian politicians.\n Ukrainian crypto community is ready to provide a generous reward for any information about crypto-wallets of Russian and Belarusian politicians and their surroundings. War crimes must be pursued and punished! To share info please contact in Telegram:  https://t.co/XHidwUQ8bE.\n— Mykhailo Fedorov (@FedorovMykhailo)  February 26, 2022\n A spokesperson for Binance told  CNBC, “We are not going to unilaterally freeze millions of innocent users’ accounts.”\n  “Crypto is meant to provide greater financial freedom for people across the globe. To unilaterally decide to ban people’s access to their crypto would fly in the face of the reason why crypto exists.”\n Binance also says it will  donate $10 million towards humanitarian efforts in Ukraine and is launching a “crypto-first” crowdfunding site to raise a further $20 million.\n The US, UK, Europe, and Canada have all responded to the invasion of Ukraine with a slew of sanctions against Russian banks, oligarchs, politicians, and more. While the big crypto exchanges have frozen the accounts of sanctioned users, the firms are refusing to take the same action against all Russians.\n “A unilateral and total ban would punish ordinary Russian citizens who are enduring historic currency destabilization as a result of their government’s aggression against a democratic neighbor,” Coinbase told Motherboard.\n Another large exchange, Kraken, said that it could not freeze the accounts of its Russian users without a legal requirement to do so. Kraken exchange CEO Jesse Powell said such a move would violate the company&#39;s “libertarian values.”\n Johnny Lyu, CEO of KuCoin, has a similar view: “As a neutral platform, we will not freeze the accounts of any users from any country without a legal requirement. And at this difficult time, actions that increase the tension to impact the rights of innocent people should not be encouraged.”\n Bitcoin’s price has surged back up to above $43,000 this week after losing almost $10,000 of its value in the wake of the crisis.", "posttime": "2022-03-01 22:17:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,交易,crypto,加密", "title": "主要加密交易所拒绝冻结所有俄罗斯用户帐户", "title_en": "Major crypto exchanges refuse to freeze all Russian user accounts", "transed": 1, "url": "https://www.techspot.com/news/93592-major-crypto-exchanges-refuse-freeze-all-russian-user.html", "via": "", "real_tags": ["俄罗斯", "交易", "crypto", "加密"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075152, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "弗拉基米尔·普京（Vladimir Putin）对乌克兰的袭击在该国城镇遭到了激烈抵抗。随着俄罗斯军队向基辅靠拢，律师、学生和演员拿起武器保卫国家免受入侵。他们并不是唯一的人：志愿者们也蜂拥加入一支乌克兰志愿者“IT军”，他们正在网上进行反击。\n当地时间2月26日晚上9点左右，乌克兰副总理兼数字转型部长米哈伊洛·费多罗夫宣布成立志愿网络军。“我们在数字领域有很多有才华的乌克兰人：开发者、网络专家、设计师、文案撰写人、营销人员，”他在自己的官方电报频道上的一篇帖子中说。“我们继续在网络战线上作战。”\n乌克兰在战争之前和战争初期也曾看到其他志愿者组织的网络防御和攻击行动。另外，黑客行动主义者，包括黑客组织匿名组织，声称对俄罗斯目标进行DDoS攻击，并从白俄罗斯武器制造商Tetraedr获取数据。但IT部队的发展，是一个政府主导的志愿部队，其目的是在一个快速移动的战区中间运作，这是没有先例的。\n费多罗夫在声明中说，IT军的任务通过单独的电报渠道分配给志愿者。到目前为止，已经有超过17.5万人订阅了公共频道，并且已经发布了多项任务。例如，该频道的管理员要求订阅者对25多个俄罗斯网站发起分布式拒绝服务攻击。其中包括能源巨头俄罗斯天然气工业股份公司（Gazprom）、俄罗斯银行和官方政府网站等俄罗斯基础设施企业。俄罗斯国防部、克里姆林宫和通信监管机构Roskomnadzor的网站也被列为潜在目标。俄罗斯新闻网站紧随其后。\n从那时起，IT陆军频道扩大了其范围。2月27日，它要求志愿者瞄准在白俄罗斯注册的网站，白俄罗斯是俄罗斯的主要盟友之一。该频道还要求用户报道YouTube频道，这些频道据称“公开对乌克兰战争撒谎”\n一位了解IT军组织的前乌克兰官员表示，组建IT军是为了让乌克兰反击俄罗斯的网络攻击。俄罗斯拥有强大的黑客攻击能力：雨刷攻击袭击了一家乌克兰银行，导致入侵加剧，政府网站被迫离线。这位乌克兰前官员说：“我国没有任何力量或意图袭击任何人。因此，我们打了一个电话。”。这位前官员说：“我们已经知道他们非常擅长网络攻击。但现在我们将了解他们在网络防御方面有多出色。”。\n“对于乌克兰这样一个面临生存威胁的国家来说，这类呼吁会发出，一些公民会做出回应，这真的不足为奇，”行业组织网络威胁联盟（Cyber threat Alliance）负责人、前白宫奥巴马总统网络协调员J.Michael Daniel说。“其中一部分也是一次信号演习。这表明乌克兰全国都有决心抵制俄罗斯的所作所为。”\n到目前为止，很难衡量IT军队的影响。虽然数千名成员加入了电报频道，但没有迹象表明他们是谁，也没有迹象表明他们参与了任何回应。该频道分享了一些据称被离线的俄罗斯网站的截图，但尚不清楚这些努力取得了多大的成功，也不清楚它们来自何处。\n虽然世界上许多国家都有攻击性黑客攻击能力，但这些攻击大多笼罩在秘密之中，由情报机构或军事单位管理。IT军可能会转而承担防御任务，以释放乌克兰政府的黑客。丹尼尔说：“的确，即使在这个自动化和其他事物的时代，额外的机构也会带来很大的不同。”。\n现在的挑战将是有效地圈养这些新发现的资源。这位前乌克兰官员说，信息技术部队正在通过电报渠道进行协调，因为这是一种同时向数千人广播信息的简单方式。他们说，那些在幕后从事IT工作的人正在使用更安全的消息服务，尽管他们拒绝透露是哪种服务。他们说：“我们正试图利用一切帮助来保护我们的国家和人民。”。\n“管理组织和后勤本身就是一个挑战，”独立网络安全研究员和顾问卢卡斯·奥列伊尼克说，他曾在红十字国际委员会担任网络战顾问。他说，在如何审查志愿者、分配目标和避免渗透方面存在一些问题。\n乌克兰新兵究竟是谁，对乌克兰军队承担的任务影响最大。但它很可能包含迄今为止所呼吁的DDoS攻击，并可能有助于保护关键基础设施。“你会抓住这群乌合之众的想法，即使他们有广泛的笔试背景，他们会以某种方式侵入克里姆林宫的网络，获得有价值的情报，这将改变进程，这是幻想，”事故响应者、前NSA黑客杰克·威廉姆斯说。“DDoS和防御对乌克兰来说现在可能比进攻更重要。”\n对于该团队来说，避免任何失火也很重要。发动更复杂的网络攻击，比如蠕虫，它可以从一个系统自我传播到下一个系统，也会有溢出事件的风险，网络攻击的影响远远超出其预期目标。“你可以毫无意义地从紧急服务、医疗保健系统或其他东西中拿走任何东西。这两者都有直接的影响，你可能会伤害俄罗斯境内的平民，如果俄罗斯人认为这是乌克兰政府的直接命令，乌克兰政府的直接意图，而且他们不同意，这也可能在不经意间使事情升级。”以同样的方式表达和回应，“丹尼尔说。这种谨慎也适用于，也许更适用于像匿名组织这样的独立黑客行动主义组织，该组织已经公开加入了这场斗争。总部位于俄罗斯的勒索软件组织康蒂（Conti）表示，如果西方试图以俄语或“世界上任何讲俄语的地区”的关键基础设施为目标，它将使用其“全部能力”进行报复世界。\"\n政府支持它的军队建立在乌克兰其他黑客活动的基础上。2月25日，在乌克兰成立了多家网络安全公司的耶戈尔·奥舍夫首次呼吁志愿者。“是时候最大限度地保护我们国家的网络了，”Aushev在Facebook上的一篇帖子中写道，这篇帖子首先由路透社报道。那些想要提供技能的人可以使用谷歌表格注册，他们可以参与防御或攻击。志愿者被问及他们在12个特定领域有多少年的经验，从开源情报收集和社会工程到恶意软件开发和DDoS操作。注册者还被要求提供一位可以证明其可信度的可信推荐人的姓名。\n伦敦国王学院（King’s College London）全球安全高级讲师蒂姆·史蒂文斯（Tim Stevens）表示，俄罗斯和乌克兰都“不再戴手套”。他警告说，当涉及网络攻击时，有很多未知和假设的情况，但也警告说有升级的可能性。“我担心的是，是否有非乌克兰人和俄罗斯人参与其中，因为这实际上是这场冲突网络方面的国际化，任何一方都可能将其视为乌克兰境外冲突的事实升级。”\n但对于参与IT军工作的乌克兰人来说，这是全国范围内采取一切措施抵御生存威胁的更广泛努力的一部分。威廉姆斯说：“如果乌克兰倒下，而他们没有尽一切可能阻止它，你为什么要把任何东西留在桌子上？”\n💻 使用Gear团队最喜爱的笔记本电脑、键盘、打字替代品和降噪耳机升级您的工作游戏", "note_en": "Vladimir Putin’s attack  on Ukraine has been met with fierce resistance throughout the country’s towns and cities. As  Russian forces have moved closer to Kyiv, lawyers, students, and actors have  taken up arms to defend their country from invasion. They are not the only ones: Volunteers have also flocked to join a Ukrainian volunteer “IT Army” that’s fighting back online.\n At around 9 pm local time on February 26, Ukraine’s deputy prime minister and minister for digital transformation, Mykhailo Fedorov, announced the creation of the volunteer cyber army. “We have a lot of talented Ukrainians in the digital sphere: developers, cyber specialists, designers, copywriters, marketers,” he said in a post on his official Telegram channel. “We continue to fight on the cyber front.”\n Ukraine has seen other volunteer-organized cyberdefense and attack efforts leading up to and early in the war effort. Separately hacktivists, including the hacking group Anonymous, have claimed  DDoS attacks against Russian targets and taken data from Belarusian weapons manufacturer Tetraedr. But the development of the IT Army, a government-led volunteer unit that’s designed to operate in the middle of a fast-moving war zone, is without precedent.\n  The IT Army’s tasks are being assigned to volunteers through a separate Telegram channel, Fedorov said in his announcement. So far more than 175,000 people have subscribed—tapping Join on the public channel is all it takes—and multiple tasks have been dished out. The channel’s administrators, for instance, asked subscribers to launch distributed denial of service attacks against more than 25 Russian websites. These included Russian infrastructure businesses, such as energy giant Gazprom, the country’s banks, and official government websites. Websites belonging to the Russian Ministry of Defense, the Kremlin, and communications regulator Roskomnadzor were also listed as potential targets. Russian news websites followed.\n Since then the IT Army channel has expanded its scope. On February 27, it asked volunteers to target websites registered in Belarus, one of Russia’s key allies. The channel has also told subscribers to report YouTube channels that allegedly “openly lie about the war in Ukraine.”\n  One former Ukrainian official who has knowledge of the IT Army’s organization says it was formed as a way for Ukraine to hit back against Russian cyberattacks.  Russia has significant hacking capabilities: Wiper attacks hit a Ukrainian bank in the  buildup to the invasion, and government websites were knocked offline. “Our country didn’t have any forces or intentions to attack anyone. Therefore, we made a call,” the former Ukrainian official says. “We already know that they are quite good at cyberattacks. But now we will find out how good they are in cyberdefense,” the former official says.\n  “For a country that’s facing an existential threat, like Ukraine, it’s really not surprising that this sort of call would go out and that some citizens would respond,” says J. Michael Daniel, the head of the industry group Cyber Threat Alliance and former White House cyber coordinator for President Obama. “Part of it is also a signaling exercise. It’s signaling a level of commitment across the country of Ukraine to resisting what the Russians are doing.”\n  The impact of the IT Army is hard to gauge thus far. While thousands of members have joined the Telegram channel, there is no indication of who they are or their involvement in any response. The channel has shared screenshots of some Russian websites allegedly being taken offline, but it’s unclear how successful these efforts have been or where they originated from.\n  While many nations around the world have offensive hacking capabilities, these are mostly shrouded in secrecy and run by intelligence agencies or military units. The IT Army will likely instead take on defensive tasks to free up Ukraine’s government hackers. “It really is true that even in this age of automation and other things, additional bodies will make a big difference,” says Daniel.\n  The challenge now will be to effectively corral those newfound resources. The former Ukrainian official says the IT Army is being coordinated through a Telegram channel as it is an easy way to broadcast messages to thousands of people at once. They say those working on the IT Army behind the scenes are doing so in more-secure messaging services, although they decline to say which ones. “We are trying to use any help to protect our country and people,” they say.\n “Managing the organization and logistics is a challenge in itself,” says Lukasz Olejnik, an independent cybersecurity researcher and consultant who previously acted as a cyberwarfare adviser at the International Committee of the Red Cross. He says there are questions around how to vet volunteers, distribute targets, and avoid infiltration.\n Who exactly Ukraine recruits will have the most bearing on what tasks the IT Army takes on. But it’s likely to encompass the DDoS attacks that have been called for thus far, and potentially helping protect critical infrastructure. “The idea that you’re going to grab this ragtag group of folk, even if they have an extensive pen testing background, that they’re going to somehow hack into the Kremlin’s networks and get valuable intelligence that’s going to change the course, that’s fantasy, ” says Jake Williams, an incident responder and former NSA hacker. “DDoS and defensive is probably more important for Ukraine right now than offensive.”\n It will also be important for the group to avoid any misfires. Launching more sophisticated cyberattacks—such as a  worm, which can self-propagate from one system to the next—would also risk  spillover incidents, where the impact of a cyberattack goes  well beyond its intended target. “You could take anything from emergency services, health care systems, or other things offline without meaning to. Which both has an immediate impact—you could hurt civilians inside Russia—and it could also inadvertently escalate things if the Russians perceive that as a direct order, the direct intent of the Ukrainian government, and they escalate and respond in kind,” Daniel says. That caution applies as well, and perhaps even more so, to independent hacktivist groups like Anonymous, which has vocally joined the fray. Russia-based ransomware group  Conti has said it would use its “full capacity” to retaliate if the West attempted to target critical infrastructure in Russian or “any Russian-speaking region of the world.”\n The government-backed IT Army builds on other Ukrainian hacking efforts. On February 25, Yegor Aushev, who has founded multiple cybersecurity companies in Ukraine, made the  first call for volunteers. “The time has come to maximize the cyber protection of our country,” Aushev wrote in a post on Facebook, which was first reported on by  Reuters. Those wanting to offer their skills could sign up using a Google Form—they could be involved in defense or attack. Volunteers were asked how many years’ experience they have in 12 specific areas, ranging from open source intelligence gathering and social engineering to malware development and DDoS operations. Those signing up were also asked to provide the name of a trusted reference who could vouch for their credibility.\n  Tim Stevens, a senior lecturer in global security at King’s College London, says “the gloves are off” for both Russia and Ukraine. He warns that when it comes to cyberattacks there are a lot of unknown and hypothetical scenarios, but warns about the potential of escalation. “What concerns me is if there are non-Ukranians and Russians involved in this, because that is effectively an internationalization of the cyber aspect of this conflict and could be treated by either combatant as a de facto escalation of the conflict beyond Ukraine&#39;s borders.”\n  But for the Ukrainians involved in the IT Army’s efforts, it’s all part of a broader push across the country to do whatever it takes to fend off an existential threat. “If Ukraine falls, and they didn’t do everything possible to stop that,” says Williams, “why would you leave anything on the table?”\n   💻 Upgrade your work game with our Gear team’s  favorite laptops,  keyboards,  typing alternatives, and  noise-canceling headphones", "posttime": "2022-03-01 22:13:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,志愿,volunteer,俄罗斯", "title": "乌克兰的志愿“IT军”正在未知领域进行黑客攻击", "title_en": "Ukraine’s Volunteer ‘IT Army’ Is Hacking in Uncharted Territory", "transed": 1, "url": "https://www.wired.com/story/ukraine-it-army-russia-war-cyberattacks-ddos/", "via": "", "real_tags": ["黑客", "志愿", "volunteer", "俄罗斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075151, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不参与Wordle热潮是不对的，还有什么比在C++20中创建一个纯编译时版本的游戏更好的方法呢？我很自豪地向你们展示…Wordlexpr！\nWordlexpr完全是在编译时玩的，因为从来没有生成过任何可执行文件——游戏是通过编译器错误体验的。因此，我们需要解决几个问题来实现一切：\n为了滥用编译器，以我们自己喜欢的任意字符串输出错误，让我们首先尝试找出如何让它打印出一个简单的字符串文字。第一次尝试，静态_断言，似乎很有希望：\n错误：静态断言失败：欢迎使用Wordlexpr！\n然而，我们的喜悦是短暂的，因为static_assert只接受字符串文字——字符的constexpr数组或const char*将不会用作参数：\n那么，将字符串的内容存储为结构类型的一部分，然后生成包含此类类型的错误，怎么样？\n错误：变量&#39；打印&lt&#39;a&#39&#39;b&#39&#39;c&#39&#39;d&#39&gt_&#39;\n美好的我们可以在编译器输出中看到我们的字符，理论上我们可以在编译时根据自己的喜好修改或生成字符序列。然而，使用字符。。。模板参数包非常繁琐，最终输出的可读性不强。\nC++20的P0732R2：“非类型模板参数中的类类型”在这里起到了解救作用！简而言之，我们可以使用任何文本类型作为非类型模板参数。因此，我们可以创建自己的小编译时字符串文本类型：\n结构ct_str\n然后，我们可以接受ct_str作为打印的模板参数，并使用与之前相同的想法：\n错误：变量&#39；打印&lt；ct#u str{&#34；欢迎来到Wordlexpr！&#34；，21}&gt_&#39; 有\n现在我们有了一种方法，可以让编译器发出任何我们想要的错误。事实上，我们可以在编译时对ct_str执行字符串操作：\nconstexpr ct_str test（）\n错误：变量&#39；打印&lt；ct#u str{&#34；欢迎来到wordlexpr.&#34；，20}&gt_&#39; 有\n通过使用append、contains、replace等功能扩展ct_str，我们最终将能够在编译时创建任何类型的字符串，并将其作为错误打印出来。\n如果我们允许用户通过预处理器定义在命令行上提供种子，这真的不是什么大事。伪随机数的生成总是确定性的，最终结果只取决于RNG的状态和最初提供的种子。\n将诸如Mersenne Twister这样的通用RNG引擎移植到C++20 constexpr是相当容易的。就Wordlexpr而言，模运算符（%）足够：\n如果我们允许用户通过预处理器定义给我们一个种子，为什么不允许用户在同一个游戏会话中通过告诉我们他们上次玩的地方来取得进展呢？可以将其视为现代游戏中的任何保存文件系统，但“保存文件”是一个短字符串，将被传递给编译器：\n用户不必自己提出状态字符串——它将由Wordlexpr在每一步生成：\n错误：变量&#39；打印&lt；ct_str{&#34；你猜到了‘crane’。结果是：'x-xx-'。\n剩下要做的就是为状态定义编码和解码函数：\n在Wordlexpr中，我使用了一个简单的Caesar密码将猜测编码到字符串中，而不使其可读。这并不是真的必要，但一般来说，另一种编译时游戏可能希望通过执行某种编码来隐藏当前状态。\n我希望你喜欢这个关于Wordlexpr工作原理的简短解释。请记住，您可以自己播放，并在编译器资源管理器上查看整个源代码。请随意提出任何问题！\n我的书“拥抱现代C++安全”现在在所有主要经销商上都可以使用。请考虑购买它并与你的朋友和同事分享这个消息，这很有帮助！\n欲了解更多信息，请阅读以下采访：“为什么4个彭博工程师写了另一本C++书”\n如果你喜欢快节奏的开源街机游戏，它允许用户创建内容，那就看看open Hexagon吧，这是我在Steam和itch上推出的第一款完全发布的游戏。伊奥。\nOpen Hexagon是Terry Cavanagh备受好评的Super Hexagon的精神继承者。特里完全支持我的项目！谢谢\n我在业余时间提供1-1个C++辅导和咨询课程。如果你对它感兴趣，可以通过mail（在）vittorioromeo（点）com或Twitter联系。", "note_en": "It felt wrong to not participate in the Wordle craze, and what better way of doing so than by creating a purely compile-time version of the game in C++20? I proudly present to you…  Wordlexpr!\n            Wordlexpr is played entirely at compile-time as no executable is ever generated – the game is experienced through compiler errors. Therefore, we need to solve a few problems to make everything happen:\n      In order to abuse the compiler into outputting errors with an arbitrary string of our own liking, let’s start by trying to figure out how to make it print out a simple string literal. The first attempt,  static_assert, seems promising:\n    error: static assertion failed: Welcome to Wordlexpr!\r 1 | static_assert(false, &#34;Welcome to Wordlexpr!&#34;);\r | ^^^^^\n  However, our delight is short-lived, as  static_assert only accepts a string literal – a  constexpr array of characters or  const char* will not work as an argument:\n      So, how about storing the contents of our string as part of the type of a  struct, then produce an error containing such type?\n    error: variable &#39;print&lt;&#39;a&#39;, &#39;b&#39;, &#39;c&#39;, &#39;d&#39;&gt; _&#39;\r has initializer but incomplete type\r 3 | print&lt;&#39;a&#39;, &#39;b&#39;, &#39;c&#39;, &#39;d&#39;&gt; _{};\r |\n  Nice! We are able to see our characters in the compiler output, and we could theoretically mutate or generate the sequence of characters to our liking at compile-time. However, working with a  char... template parameter pack is very cumbersome, and the final output is not very readable.\n  C++20’s  P0732R2:  “Class Types in Non-Type Template Parameters” comes to the rescue here! In short, we can use any  literal type as a non-type template parameter. We can therefore create our own little compile-time string literal type:\n  struct ct_str\r  {\r    char _data[ 512]{};\r    std::size_t _size{ 0};\r  \r    template &lt; std::size_t N&gt;\r    constexpr ct_str( const  char (&amp;str)[N]) : _data{}, _size{N -  1}\r   {\r    for( std::size_t i =  0; i &lt; _size; ++i)\r   _data[i] = str[i];\r   }\r  };\n  We can then accept  ct_str as a template parameter for  print, and use the same idea as before:\n    error: variable &#39;print&lt;ct_str{&#34;Welcome to Wordlexpr!&#34;, 21}&gt; _&#39; has\r initializer but incomplete type\r 22 | print&lt;&#34;Welcome to Wordlexpr!&#34;&gt; _{};\r |\n  Now we have a way of making the compiler emit whatever we’d like as an error. In fact, we can perform string manipulation at compile-time on  ct_str:\n  constexpr ct_str test()\r  {\r   ct_str s{ &#34;Welcome to Wordlexpr!&#34;};\r   s._data[ 0] =  &#39;w&#39;;\r   s._data[ 11] =  &#39;w&#39;;\r   s._data[ 20] =  &#39;.&#39;;\r    return s;\r  }\r  \r  print&lt;test()&gt; _{};\n  error: variable &#39;print&lt;ct_str{&#34;welcome to wordlexpr.&#34;, 20}&gt; _&#39; has\r initializer but incomplete type\r 33 | print&lt;test()&gt; _{};\r | ^\n  By extending  ct_str with functionalities such as  append,  contains,  replace, etc… we will end up being able to create any sort of string at compile-time and print it out as an error.\n      This is really not a big deal, if we allow our users to provide a seed on the command line via preprocessor defines. Pseudo-random number generation is always deterministic, and the final result only depends on the state of the RNG and the initially provided seed.\n    It is fairly easy to port a common RNG engine such as Mersenne Twister to C++20  constexpr. For the purpose of Wordlexpr, the modulo operator ( %) was enough:\n        If we allow the user to give us a seed via preprocessor defines, why not also allow the user to make progress in the same game session by telling us where they left off last time they played? Think of it as any save file system in a modern game – except that the “save file” is a short string which is going to be passed to the compiler:\n    The user doesn’t have to come up with the state string themselves – it will be generated by Wordlexpr on every step:\n  error: variable &#39;print&lt;ct_str{&#34;You guessed `crane`. Outcome: `x-xx-`.\r You guessed `white`. Outcome: `xxox-`.\r You guessed `black`. Outcome: `xoxxx`.\r You guessed `tower`. Outcome: `xxxoo`.\r To continue the game, pass `-DSTATE=EJYHULDOPALISHJRAVDLYWAEIM`\r alongside a new guess.&#34;, 242}&gt; _&#39; has initializer but incomplete\r type\r 2612 | print&lt;make_full_str(SEED, guess, s)&gt; _{};\r | ^\n      All that’s left to do is to define encoding and decoding functions for the state:\n    In Wordlexpr, I used a simple Caesar cipher to encode the guesses into the string without making them human-readable. It is not really necessary, but generally speaking another type of compile-time game might want to hide the current state by performing some sort of encoding.\n      I hope you enjoyed this brief explanation of how Wordlexpr works. Remember that you can play it yourself and see the entire source code  on Compiler Explorer. Feel free to reach out to ask any question!\n    My book   “Embracing Modern C++ Safely” is now available on all major resellers. Please consider purchasing it and share the news with your friends and colleagues – that helps a lot!\n  For more information, read the following interview:  “Why 4 Bloomberg engineers wrote another C++ book”\n  If you are a fan of fast-paced open-source arcade games that allow user-created content, check out   Open Hexagon, my first fully-released game  available on Steam and  on itch.io.\n  Open Hexagon is a spiritual successor to the critically acclaimed Super Hexagon by Terry Cavanagh.  Terry fully supports my project! Thanks!\n  I offer 1-1 C++ mentoring and consulting sessions in my spare time. If it’s something you are interested in, feel free to reach out at  mail (at) vittorioromeo (dot) com or  on Twitter.", "posttime": "2022-03-01 22:07:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,编译,wordlexpr,compile,字符串", "title": "Wordlexpr：C++20中的编译时Wordle", "title_en": "Wordlexpr: Compile-Time Wordle in C++20", "transed": 1, "url": "https://vittorioromeo.info/index/blog/wordlexpr.html", "via": "", "real_tags": ["c++", "编译", "wordlexpr", "compile", "字符串"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075150, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你是一个电脑游戏玩家，那么你可能最需要的就是不断更新你的GPU驱动程序，无论你是AMD还是NVIDIA的GPU。更新图形驱动程序可以带来更好的性能和与新游戏的兼容性，因此没有真正的理由不更新它们。此外，在Windows上更新图形驱动程序非常容易，可以通过设备管理器手动更新，也可以通过GPU供应商提供的程序自动更新。\n另一方面，Android并没有提供一种简单的方式来更新手机或平板电脑的图形驱动程序。事实上，除了获得根访问权限，在大多数设备上几乎不可能自己更新图形驱动程序。在本周的《安卓甜点点评》中，我将深入探讨GPU驱动程序是如何分发的，谷歌和硅厂商是如何试图让它们更容易更新的，以及第三方开发者是如何克服安卓的局限性的。\n感谢您注册安卓Edge通讯。每周，我的安卓甜点点评专栏都会分享有关安卓平台的最新消息，这对系统工程师、应用程序开发人员和超级用户都很重要。\n与AMD和NVIDIA不同，安卓设备中最受欢迎的两款GPU的制造商高通和Arm与消费者没有直接关系。你不能像制造个人电脑那样制造自己的智能手机，所以你永远不会直接给高通公司或花钱购买GPU。相反，高通公司将其GPU作为片上系统（SoC）的一部分出售给智能手机原始设备制造商，而Arm则将其GPU设计许可给联发科等硅供应商，后者反过来使用这些GPU设计SoC。因此，高通公司距离最终掌握在消费者手中的智能手机只有一步之遥，而Arm则只有两步之遥。\n由于与消费者没有直接关系，这些移动GPU制造商几乎没有动力向公众提供更新的图形驱动程序包。相反，GPU驱动程序仅作为主板支持包（BSP）的一部分直接分发给智能手机OEM。正如我之前在关于Google Requirements Freeze程序的文章中所解释的，BSP是一个包含源代码和预构建二进制文件的包，这些代码和二进制文件是在特定芯片组平台上安装和运行Android（或其他操作系统）所需的。BSP包含硬件抽象层（HAL）和驱动程序，Android操作系统需要与设备硬件（包括GPU）通信。此BSP代码包含在设备的只读供应商分区中，并且只能由OEM在SoC供应商的支持下进行更新。\nSoC供应商在芯片组的生命周期内更新BSP，芯片组由SoC供应商设置，但可以通过付费软件支持许可证进行扩展。并非每个BSP更新都会包含更新的GPU驱动程序，但当它们包含更新的GPU驱动程序时，OEM可以从更新的BSP中提取它们，然后通过OTA更新将它们发送到设备上。不过，如果你知道Android更新是如何工作的，那么你可能会在这里发现问题。Android的更新是零碎的，这意味着图形驱动程序也是零碎的。\n首先，图形驱动程序通常不是特定于SoC的。例如，高通公司的图形驱动程序支持多个Adreno GPU。这意味着一个芯片组的BSP中包含的图形驱动程序可能与另一个芯片组中的GPU兼容。然而，一个BSP可能拥有这些图形驱动程序的更新版本，而其他BSP则没有，这可能会让其他芯片组上的设备使用旧版本的驱动程序。例如，Snapdragon 8 Gen 1的图形驱动程序直接支持Snapdragon 845和更高版本的平台，或者更准确地说，支持任何Adreno 6xx或7XX GPU。\n下一个大问题是，原始设备制造商必须将BSP中更新的图形驱动程序合并到他们的项目中，进行测试，然后通过OTA更新将其发送到设备上。你的特定安卓设备是否真的会从原始设备制造商那里得到更新，更不用说包括更新的图形驱动程序的更新了，这还不是一个确定的事实。这意味着，即使是具有相同芯片组的设备也可能具有不同的图形驱动程序。\n最后，由于大多数安卓设备出厂时没有超级用户访问权限，因此无法自行更新GPU驱动程序，这意味着你完全依赖于购买设备的OEM。如果您获得了root访问权限，那么就可以手动更新供应商分区中的图形驱动程序，前提是您能够获得必要的文件。通常，这意味着从另一台设备的固件中提取驱动程序，XDA开发者社区的一些修补者就是这么做的。这就是为什么我能够更新我生命终结的Pixel 3 XL上的图形驱动程序，显著提高了手机的图形性能。\n这些驱动程序来自Snapdragon 8 Gen 1的设备，并通过其Snapdragon 845在my Pixel 3 XL上可闪存，这要归功于开发者细则，开发者细则创建了一个垫片，用于转换较新的Adreno图形驱动程序使用的QtiMapper API和较旧的Adrenos上可用的gralloc API之间的调用。\n如果你的设备没有最新的图形驱动程序，这并不是世界末日，但它肯定会让用户和游戏开发者感到恼火。正如我之前提到的，更新的图形驱动程序可以带来更好的性能，我的Pixel 3 XL上的3DMark分数提升就证明了这一点。更重要的是，较新的图形驱动程序可能会修复一些图形API功能如何实现的错误。对于游戏开发者来说，针对安卓系统已经是一个挑战，因为每个GPU在功能支持方面都有很大的不同。再加上使用相同GPU的设备之间不一致的驱动程序版本，你就会明白为什么Android是一个具有挑战性的平台，从游戏开发的角度来看。开发人员要么需要维护一系列令人眼花缭乱的解决驱动程序错误的方法，要么限制设备兼容性，这两种方法都不是好的选择。谷歌正在制作一个基准配置文件，这样游戏开发者就可以更容易地确定一台设备是否支持一组常见的Vulkan功能，但这仍然不能解决碎片问题。\n然而，减少碎片的方法是使图形驱动程序更容易更新。谷歌在几年前就意识到了这一点，多亏了Treble项目引入的系统供应商分离，他们能够将更新的图形驱动程序作为标准Android应用程序包的一部分发布。高通公司意识到了这一点的潜力，因此该公司开始营销其最新芯片组支持通过应用商店更新GPU驱动程序。然而，这最终无助于改善情况。\n由于Project Treble标准化了HALs和OS框架之间的接口，因此在不破坏与后者兼容性的情况下更新前者变得更加容易。因此，Treble使独立更新图形驱动程序变得更容易，无需将图形驱动程序更新与整体固件更新联系起来。然而，面临的挑战是如何准确地在标准OTA更新之外提供这些图形驱动程序更新。\n答案是Android应用程序包（.APK文件）。APK可以包含共享库（.so文件），它们也是每个Android应用商店（包括Google Play）的首选交付格式。因此，选择APK作为交付更新图形驱动程序的机制并不奇怪，即使是在ProjectMainline引入的APEX文件格式之上。毕竟，如果你有一个APK，你可以在Google Play上为你的可交付图形驱动程序创建一个列表。\n从市场营销的角度来看，这很好。想象一个用户打开Google Play，看到手机GPU驱动程序的更新。他们中的一些人会想，“酷，就像我的电脑！干得好，X！”我相信这是高通和Arm希望看到的反应，这也是为什么小米、OPPO和三星等几家原始设备制造商开始通过应用商店提供GPU驱动程序更新的原因。\n不过，从安全角度来看，这种交付机制提出了一些问题。您如何确保仅向用户交付带有经过验证和测试的图形驱动程序的经批准的APK？如果任何随机的APK可以更新你手机上的图形驱动程序，那么你的手机可能会因为不正确的驱动程序而无法运行，或者面临安全问题的风险。那么，原始设备制造商如何使用应用商店安全地提供图形驱动程序更新呢？\n首先，OEM需要创建并签署一个空的可更新驱动程序APK。如果OEM希望在应用商店中发布应用程序，则此APK应具有自己的唯一软件包名称。此APK应安装在供应商分区下的/vendor/app路径中的设备上，预安装的图形驱动程序位于该分区。\n接下来，OEM需要创建并签署一个非空的可更新驱动程序APK。这个APK实际上应该包含要交付的更新的图形驱动程序，并且它应该与空的可更新驱动程序APK具有相同的包名和签名。由于签名验证，如果没有OEM签名，Android将拒绝任何与驱动程序APK同名的应用程序，从而确保只有OEM可以更新驱动程序APK。\n由于供应商分区是只读的，因此在更新驱动程序APK时不会直接覆盖预安装的图形驱动程序（对于/vendor/app中的空的可更新驱动程序APK也是如此）。覆盖这些文件的唯一方法是更新供应商映像，这意味着要经过标准的OTA更新过程。\n为了解决这个问题，谷歌对Android进行了修改，添加了对从三个不同来源加载图形驱动程序库的支持：APK中包含的可更新生产驱动程序、APK中包含的可更新预发布驱动程序，或者预安装在供应商分区中的系统图形驱动程序。生产驱动程序打算在消费类设备上发货，并包含在APK中，该APK的包名在系统属性ro中定义。gfx。驾驶员0.同时，预发布驱动程序用于在将驱动程序推送到消费者之前对其进行测试，它包含在APK中，该APK具有在prop ro中定义的包名。gfx。驾驶员1.\nAndroid根据白名单系统决定加载哪些驱动程序。驱动程序APK本身可能包含OEM希望自动选择使用驱动程序的软件包白名单，但开发人员也可以转到设置&gt；开发商选项&gt；Graphics Driver Preferences可选择所有应用应使用的图形驱动程序，或根据每个应用选择要使用的图形驱动程序。\n不过，为了尽量减少错误驱动程序更新带来的危害，特权或系统应用程序永远不会加载可更新的驱动程序。出于同样的原因，SoC供应商自己也不会使用此方案向图形驱动程序推送更新。想象一下，如果高通推出的驱动程序更新破坏了OEM产品与一系列游戏的兼容性；可以理解，OEM会对高通公司非常不满，这可能就是为什么该硅供应商只提供预发布驱动程序APK，并要求OEM解包、压力测试、重新打包、签名，然后将驱动程序更新推送到生产部门。\n如果硅供应商选择为其驱动程序APK设置应用商店列表，他们可以自行解决GPU驱动程序碎片问题，因为他们已经在BSP中包含了自己的空签名预发布驱动程序APK。所有原始设备制造商需要做的就是不移除由硅供应商提供的空的签名预发布驱动程序APK。然而，硅供应商希望避免因运送有缺陷的驱动程序更新而承担责任，这是合理的，最终破坏了整个可更新GPU驱动程序计划。唯一改变的是提供GPU驱动程序更新的机制——OEM仍然负责实际推动更新，这意味着更新的驱动程序不会统一推出。大多数原始设备制造商将默认使用固件OTA发布驱动程序更新，因为这样他们只需测试驱动程序和固件的一个组合，而不是多个组合。因此，我们回到了原点。\n由于对Android上GPU驱动程序的不一致性感到不满，天际线（Skyline）的两名开发人员决定自行解决这一问题。天际线是一款面向Android的开放源码任天堂交换机模拟器，正在开发中。虽然任何Android游戏开发人员都很讨厌处理许多不同的GPU及其不同的功能，但对于模拟器开发人员来说，更令人讨厌的是，他们被迫实施大量的黑客解决方案，以解决他们几乎无法控制的游戏的兼容性问题。\n例如，天际线开发人员Mark‘Pixelylon’最近告诉我，该团队正在努力克服一个与驱动程序相关的主要限制。据他说，很多开关游戏使用一种叫做BCn的纹理压缩格式。虽然Adreno GPU显然多年来一直支持BCn纹理，但据报道，高通公司直到Snapdragon 865时代才在其驱动程序中公开对BCn的支持。Mark推测这是由于BCn的专利（现已过期），但无论如何，这对Skyline开发者来说是一个问题，因为使用较旧的Adreno GPU的用户与使用BCn的游戏存在兼容性问题。\n我在本文前面提到的Skyline开发者细则的同事提出了一个解决方案。他开发了一个名为BCeNabler的库，该库修补了Adreno GPU驱动程序，以公开对BCn纹理的支持。虽然这确实有效，但对于Skyline开发者来说，这并不是一个可行的长期解决方案，因为很难修补高通公司专有的Adreno GPU驱动程序，以添加任何超出基本功能的内容。\n在头脑风暴下一步该怎么做的时候，马克开玩笑说要更换Skyline加载的图形驱动程序，而不是修补。加载一个不同的图形驱动程序并不是一个可笑的想法——我花了大量时间讨论了实现这一点的方法。然而，Skyline开发人员希望在没有谷歌、OEM或SoC供应商支持的情况下完成这项工作，并且不需要根用户访问。换句话说，他们希望注入一个与系统提供的驱动程序完全不同的驱动程序，并且他们希望这样做不需要任何特权。\n在一次天才之旅中，开发者细则想出了如何替换应用程序加载的用户空间驱动程序，前提是用户空间驱动程序与内核驱动程序兼容，马克说内核驱动程序“通常相当稳定，不会经常以中断的方式更改”Bylaws扩展了BCeNabler以创建Adreno工具，这是一个无根库，用于应用Adreno GPU驱动程序修改或替换。该库支持加载自定义GPU驱动程序、启用BCn纹理和重定向文件操作，以访问着色器转储并修改驱动程序配置文件。\nAdreno工具的工作方式相当复杂，但基本上，它利用了Android应用程序本身不加载图形驱动程序这一事实。相反，他们使用Android驱动程序（libvulkan.so）加载实际的驱动程序（libvulkan.adreno.so）。Adreno工具通过向系统库中注入钩子，然后交换新的驱动程序来拦截这个过程。\n有了Adreno工具，Skyline应用程序可以加载Turnip，这是Adreno GPU的开源Vulkan驱动程序，而无需root访问。这是Android仿真领域的一个重大突破，因为任何处理Adreno GPU驱动程序问题的项目都可以通过加载Turnip绕过这些问题。Turnip是由一个开发团队在Mesa项目下的Freedreno项目上公开开发的。由于Turnip的开放性，它更容易与开发人员交谈、报告错误或提交补丁，这使得Turnip成为模拟器开发人员面临的所有驱动程序相关问题的一个有吸引力的解决方案。\n例如，Android的PlayStation 2模拟器AetherSX2的开发者塔勒雷思已经在利用Adreno工具。据开发者称，使用Turnip修复了Adreno 660 GPU驱动程序中出现的仿真问题，但与供应商驱动程序相比，使用它确实会降低性能。尽管如此，Tahlreth还是提供了内置Turnip驱动程序的AetherSX2版本，供那些因设备驱动程序而存在仿真问题的用户使用。虽然开发者说这些版本无法上传到Google Play，但Skyline项目的马克告诉我，他们最近收到了谷歌的许可，同意用Turnip发布他们的应用程序。因此，Tahlreth很可能也可以为AetherSX2做同样的事情，这样用户就不必在该项目的网站上寻找特殊版本的模拟器。\n如果你浏览仿真爱好者聚集的社区，你可能以前听过这样一条建议：买一台带有Adreno GPU的设备，因为它们更适合仿真。这个建议源于这样一个信念：Adreno GPU提供更好的性能，更少的驱动程序错误，支持更多的功能。多年来，基于我自己的经验和我从模拟器开发人员那里听到的情况似乎都是这样，但Mark告诉我，Arm的Mali GPU在驱动程序质量方面已经显著缩小了差距。在过去的几年里，只有高通公司的“Vulkan”支持的“Turn2”扩展才真正得到了支持。与此同时，Galaxy S22中三星新Xclipse 920 GPU的驱动程序支持比最新的Mali和Adreno GPU驱动程序更多的扩展，尽管Mark告诉我Skyline项目实际上不需要这些附加功能。\n不过，说到高通GPU，马克告诉我，他们需要的大部分功能都由Adreno GPU硬件支持，所以只需更新驱动程序即可。Adreno工具和Turnip使这成为可能，因此试图在Android上处理驱动程序问题的模拟器开发人员可能想看看规章制度和Mark编造了什么。一旦用于Mali GPU的开源Vulkan驱动程序PanVK的开发取得进展，那么开发人员将看到Adreno工具是否可以扩展以支持Mali设备。希望不会有任何障碍阻止这种情况发生，但不管怎样，这是一个令人兴奋的项目。\n感谢阅读本周的安卓甜点点滴。我要感谢Skyline项目的Mark和bylaws在起草本文时提供的广泛帮助。\n如果你喜欢这篇文章，那么请订阅安卓Edge时事通讯，获取我的安卓甜点点评专栏未来版本的链接。你可以在这个页面上找到以前的版本。", "note_en": "If you’re a PC gamer, then you’re probably on top of keeping your GPU drivers updated, whether you have an AMD or NVIDIA GPU. Updating your graphics drivers can bring better performance and improved compatibility with new games, so there’s no real reason not to update them. Plus, it’s incredibly easy to update graphics drivers on Windows, either manually through Device Manager or automatically through a program offered by your GPU vendor.\n Android, on the other hand, doesn’t offer an easy way to update your phone’s or tablet’s graphics drivers. In fact, short of acquiring root access, updating the graphics drivers on your own is nigh impossible on most devices. In this week’s edition of  Android Dessert Bites, I’ll be diving into how GPU drivers are distributed, how Google and silicon vendors have tried to make them easier to update, and what third-party developers are doing to get around Android’s limitations.\n Thanks for signing up for   The Android Edge newsletter . Every week, my Android Dessert Bites column will share the latest news about the Android platform that matters to system engineers, app developers, and power users.\n  Unlike AMD and NVIDIA, Qualcomm and Arm, the makers of the two most popular lines of GPUs in Android devices, have no direct relationship with consumers. You can’t build your own smartphone like you can a PC, so you’ll never directly give Qualcomm or Arm your money to buy a GPU. Instead, Qualcomm sells its GPUs to smartphone OEMs as part of a system-on-chip (SoC), while Arm licenses its GPU designs to silicon vendors like MediaTek which in turn design SoCs using those GPUs. Qualcomm is thus one step removed from the smartphone that ends up in the hands of consumers, while Arm is two steps removed.\n Having no direct relationship with consumers, these mobile GPU makers have little incentive to provide the public with access to updated graphics drivers packages. Instead, GPU drivers are only directly distributed to smartphone OEMs as part of a Board Support Package (BSP). A BSP, as I  previously explained in my article on the Google Requirements Freeze program, is a package that contains the source code and prebuilt binaries needed to get Android (or other operating systems) up and running on a particular chipset platform. BSPs contain the hardware abstraction layers (HALs) and drivers that the Android OS needs to communicate with your device’s hardware, including the GPU. This BSP code is contained within the read-only vendor partition of the device, and it can only be updated by the OEM with support from the SoC vendor.\n SoC vendors update BSPs for the lifetime of a chipset, which is set by the SoC vendor but  can be extended through paid software support licenses. Not every BSP update will contain updated GPU drivers, but when they do, OEMs can pull them from the updated BSP and then ship them to devices through an OTA update. If you know anything about how Android updates work, though, then you’ll probably spot the problem here. Android updates are fragmented, which means that graphics drivers are, too.\n First of all, graphics drivers usually aren’t SoC specific. Qualcomm’s graphics drivers, for instance, support multiple Adreno GPUs. That means the graphics drivers contained within the BSP for one chipset may be compatible with the GPU in another chipset. However, one BSP may have an updated version of those graphics drivers while others do not, potentially leaving devices on other chipsets with older versions of the drivers. The graphics drivers for the Snapdragon 8 Gen 1, for example, directly support Snapdragon 845 and later platforms, or to be more precise, any Adreno 6xx or 7XX GPU.\n The next big problem is that OEMs have to merge the updated graphics drivers from the BSP into their projects, test them, and then ship them out to devices via an OTA update. It’s not even a given that your particular Android device will actually get updates from the OEM, let alone an update that includes the newer graphics drivers. This means that even devices with the same chipset could have different graphics drivers.\n Finally, because most Android devices ship without superuser access available to the user, there’s no way to update the GPU drivers yourself, meaning you’re totally dependent on the OEM you bought your device from. If you attain root access, then it’s possible to manually update the graphics drivers in the vendor partition, provided you somehow get your hands on the necessary files. Usually, this means pulling drivers from the firmware of another device, which is what  some tinkerers on the  XDA-Developers community do. It’s how I was able to update the graphics drivers  on my end-of-life Pixel 3 XL, significantly boosting the phone’s graphics performance.\n  Those drivers were from a device with the Snapdragon 8 Gen 1 and were made flashable on my Pixel 3 XL with its Snapdragon 845 thanks to developer  bylaws, who created a  shim to  translate the calls between the QtiMapper API used by newer Adreno graphics drivers and the  gralloc API available on older Adrenos.\n It’s not the end of the world if your device doesn’t have the latest graphics drivers, but it can certainly be annoying for users and game developers. As I previously mentioned, updated graphics drivers can bring better performance, as demonstrated by the uplift in 3DMark scores on my Pixel 3 XL. More importantly, newer graphics drivers may fix bugs in how some graphics API features are implemented. It’s already a challenge for game developers to target Android because of  how vastly different each GPU is when it comes to feature support. Couple that with inconsistent driver versions between devices with the same GPU, and you’ll see why Android is a challenging platform to target from a game development perspective. Developers either need to maintain a dizzying array of workarounds for driver bugs or limit device compatibility, neither of which are good options. Google is  making a baseline profile so game developers can more easily determine if a device supports a set of common Vulkan capabilities, but this still doesn’t solve the fragmentation problem.\n What would reduce fragmentation, however, is making graphics drivers easier to update. Google recognized this years ago, and  thanks to the system-vendor separation introduced  with Project Treble, they were able to ship updated graphics drivers  as part of a standard Android application package. Qualcomm recognized the potential of this, so the company started marketing that  its latest chipsets support updating GPU drivers through an app store. However, this ultimately did little to improve the situation.\n  Thanks to Project Treble standardizing the interface between HALs and the OS framework, it became easier to update the former without breaking compatibility with the latter. As a result, Treble made it easier to independently update graphics drivers, removing the need to tie graphics drivers updates to overall firmware updates. The challenge, however, is figuring out exactly  how to deliver those graphics driver updates outside of a standard OTA update.\n The answer is the Android application package (.APK files). APKs can contain shared libraries (.so files), and they’re also the preferred delivery format of every Android app store, including Google Play. So it’s no surprise that the APK was chosen as the mechanism to deliver updated graphics drivers, even over the  APEX file format introduced alongside Project Mainline. After all, if you have an APK, you can create a listing on Google Play for your deliverable graphics drivers.\n From a marketing perspective, this is great. Imagine a user opening up Google Play and seeing an update for their phone’s GPU drivers. Some of them will be thinking, “cool, that’s just like my PC! Great job, X!” I’m sure that’s the reaction that Qualcomm  and Arm are hoping for, and it’s why several OEMs like  Xiaomi,  OPPO, and  Samsung started to deliver GPU driver updates through app stores.\n  From a security perspective, though, this delivery mechanism raises some questions. How do you ensure that only approved APKs carrying validated and tested graphics drivers are delivered to users? If any random APK could update the graphics drivers on your phone, then your phone could become inoperable from improper drivers or put at risk of security issues. So how can OEMs securely deliver graphics driver updates using an app store?\n First, the OEM needs to create and sign an  empty updatable driver APK. This APK should have its own unique package name if the OEM wants to publish the app on an app store. This APK should be installed on the device in the /vendor/app path under the vendor partition, which is where the preinstalled graphics drivers are located.\n Next, the OEM needs to create and sign a  non-empty updatable driver APK. This APK should actually contain the updated graphics drivers that are intended to be delivered, and it should have the same package name and signature as the empty updatable driver APK.  Thanks to signature verification, Android will reject any app with the same package name as the driver APK if it wasn’t signed by the OEM, thus ensuring that only the OEM can update the driver APK.\n Since the vendor partition is read-only, the preinstalled graphics drivers aren’t directly overwritten when the driver APK is updated (and the same is true for the empty updatable driver APK in /vendor/app). The only way to overwrite those files is to update the vendor image, which means going through the standard OTA updating process.\n To get around this, Google modified Android to add support for loading the graphics drivers libraries from three different sources: an updatable  production driver contained within an APK, an updatable  prerelease driver contained within an APK, or the  system graphics driver that’s preinstalled in the vendor partition. The production driver is intended to be shipped on consumer devices and is contained within the APK that has the package name  defined in the system property ro.gfx.driver.0. The prerelease driver, meanwhile, is intended for testing the driver before it’s pushed to consumers, and it is contained within the APK that has the package name defined in the prop ro.gfx.driver.1.\n  Android decides which drivers to load based on a whitelist system. The driver APK itself may contain a whitelist of packages that the OEM wants to automatically opt-in to use the driver, but developers can also go to Settings &gt; Developer options &gt; Graphics Driver Preferences to either choose the graphics driver that  all apps should use or select which graphics driver to use  on a per-app basis.\n  To minimize the harm from a buggy driver update, though, updatable drivers are  never loaded for privileged or system apps. For the same reason, SoC vendors themselves don’t push updates to graphics drivers using this scheme. Imagine if Qualcomm pushed a driver update that broke compatibility with a bunch of games on an OEM’s product; that OEM would understandably be very upset with Qualcomm, which is probably why the silicon vendor  only provides prerelease driver APKs and requires the OEM to unpack, stress test, repack, sign, and then push the driver update to production themselves.\n Silicon vendors could solve the problem of GPU driver fragmentation themselves if they chose to set up app store listings for their driver APKs because they already include their own empty signed prerelease driver APKs in their BSP. All OEMs would have to do is  not remove the empty signed prerelease driver APK provided by the silicon vendor. However, the silicon vendors’ desire to avoid liability over shipping buggy driver updates, which is reasonable to be fair, ends up undermining the entire updatable GPU driver initiative. The only thing that’s changed is the mechanism of delivering GPU driver updates — OEMs are still responsible for actually pushing updates, which means updated drivers won’t be rolled out uniformly. Most OEMs will just default to releasing driver updates with firmware OTAs regardless, because then they only have to test one combination of driver plus firmware rather than multiple combinations. Thus, we’re back to square one.\n  Unsatisfied with the inconsistency of GPU drivers on Android, two of the developers behind  Skyline, an in-development, open source Nintendo Switch emulator for Android, decided to take matters into their own hands. While it’s annoying for any Android game developer to deal with the many different GPUs and their varying capabilities, it’s even more annoying for emulator developers, who are forced to implement a ton of hacky workarounds to fix compatibility issues with games they have very little control over.\n For example, Skyline developer  Mark ‘Pixelylon’ recently told me about one of the major driver-related limitations the team is working to overcome. According to him, a lot of Switch games use a texture compression format called  BCn. While Adreno GPUs have apparently had hardware support for BCn textures for years, Qualcomm reportedly didn’t expose support for BCn in their drivers until the Snapdragon 865 era. Mark speculates that this is due to the (now expired)  patents on BCn, but regardless, this posed a problem for the Skyline developers, as users with older Adreno GPUs would have compatibility issues with games that use BCn.\n Fellow Skyline developer  bylaws, who I mentioned previously in this article, came up with a solution. He developed a library called  BCeNabler, which patches Adreno GPU drivers to expose support for BCn textures. While this did work, it wasn’t a viable long-term solution for the Skyline developers, because it was difficult to patch Qualcomm’s proprietary Adreno GPU drivers to add anything past basic features.\n While brainstorming what to do next, Mark joked about  replacing, instead of patching, the graphics driver that Skyline loaded. Loading a different graphics driver isn’t a ludicrous idea — I spent a good chunk of this article talking about ways to do just that. However, the Skyline developers wanted to do this  without support from Google, the OEM, or the SoC vendor and  without needing root access. In other words, they wanted to inject an entirely different driver than the one(s) provided by the system, and they wanted to do it without needing any special privileges.\n In a stroke of genius, developer bylaws figured out how to replace the userspace driver loaded by an app, provided that userspace driver is compatible with the kernel driver, which Mark says is “generally fairly stable and doesn’t change in a breaking way too often.” Bylaws extended BCeNabler to create  Adreno Tools, a rootless library for applying Adreno GPU driver modifications or replacements. The library supports loading custom GPU drivers, enabling BCn textures, and redirecting file operations to enable accessing shader dumps and  modifying the driver configuration file.\n The way Adreno Tools works is  quite complicated, but basically, it takes advantage of the fact that Android apps don’t load the graphics driver themselves. Instead, they use the Android driver (libvulkan.so) that loads the actual driver (libvulkan.adreno.so). Adreno Tools intercepts this process by  injecting hooks into system libraries and then  swapping in the new driver.\n With Adreno Tools, the Skyline app can load Turnip, an open source Vulkan driver for Adreno GPUs,  without needing root access. This is a major breakthrough for the Android emulation scene because any project dealing with Adreno GPU driver issues can bypass those issues by loading Turnip. Turnip is  developed in the open by a team of developers on the  Freedreno project, which is under the  Mesa project. Because of its open nature, it’s easier to talk to the developers, report bugs, or submit patches, making Turnip an attractive workaround for all the driver-related issues that emulator developers face.\n Tahlreth, the developer of  AetherSX2, a PlayStation 2 emulator for Android, is already taking advantage of Adreno Tools, for example.  According to the developer, using Turnip fixes emulation issues otherwise seen with the Adreno 660 GPU driver, but using it  does degrade performance compared to the vendor driver. Still, Tahlreth  offers builds of AetherSX2 with the Turnip driver built-in for users who have emulation problems stemming from their device’s drivers. Although the developer  says that these builds can’t be uploaded to Google Play, I’m told by Mark from the Skyline project that they recently received a go-ahead from Google to ship their app with Turnip. Thus, it’s likely that Tahlreth can do the same for AetherSX2, so users won’t have to dig for a special version of the emulator on the project’s website.\n If you browse the communities where emulation enthusiasts congregate, then you’ll have probably heard this piece of advice before: get a device with an Adreno GPU because they’re better for emulation. This advice stems from the belief that Adreno GPUs offer better performance, have fewer driver bugs, and support more features. For many years, this seemed to be the case based on my own experience and what I’ve heard from emulator developers, but Mark tells me that Arm’s Mali GPUs have closed the gap significantly when it comes to the quality of their drivers. Qualcomm’s Adreno GPU drivers have also “really picked up” in the last 2 years, only missing support for a handful of Vulkan extensions that are supported by Turnip. Meanwhile, the driver for Samsung’s new Xclipse 920 GPU in the Galaxy S22  supports even more extensions than the latest Mali and Adreno GPU drivers, though Mark tells me the Skyline project doesn’t really need any of those additional features.\n   When it comes to Qualcomm GPUs, though, Mark tells me that most of the features they need are supported by the Adreno GPU hardware, so all that’s needed is a driver update to get them. Adreno Tools and Turnip make that possible, so emulator developers who are trying to deal with driver issues on Android may want to take a look at what bylaws and Mark have cooked up. Once development of PanVK, the open source Vulkan driver for Mali GPUs, picks up steam, then the developers will see if Adreno Tools can be extended to support Mali devices. There hopefully won’t be any blockers preventing that from happening, but regardless, this is an exciting project to watch unfold.\n  Thanks for reading this week’s edition of  Android Dessert Bites. I’d like to thank both Mark and bylaws from the Skyline project for their extensive help in drafting this article.\n If you liked this post, then please  subscribe to  The Android Edge newsletter to get links to future editions of my  Android Dessert Bites column. You can find previous editions on this  page.", "posttime": "2022-02-26 12:21:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,电脑,android,gpu,驱动程序", "title": "你不能像在电脑上那样更新Android的GPU驱动程序", "title_en": "You can't update Android’s GPU drivers like on your PC", "transed": 1, "url": "https://blog.esper.io/android-dessert-bites-14-gpu-driver-updates-3819534/", "via": "", "real_tags": ["程序", "电脑", "android", "gpu", "驱动程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075149, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自由服装：https://offensivefreedom.com/", "note_en": "FREEDOM apparel: https://offensivefreedom.com/", "posttime": "2022-02-26 11:32:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,克格勃,defector,https", "title": "克格勃叛逃者尤里·贝兹梅诺夫对美国的警告（1984年）", "title_en": "KGB defector Yuri Bezmenov's warning to America (1984)", "transed": 1, "url": "https://www.youtube.com/watch?v=IQPsKvG6WMI", "via": "", "real_tags": ["美国", "克格勃", "defector", "https"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075147, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HTML是一种支持web的标记语言。在HTML5中添加和改进了很多东西。但是有些HTML标签很少使用，或者很多人不知道。\n在本文中，我们&#39；我们将看到10个有用的HTML标签，这些标签对很多人来说都是模糊的，但可以方便有效地使用。\n我们可以用一行HTML代码创建一个简单美观的对话框。使用&lt；dialog&gt；标记具有“打开”属性，可以创建一个居中的对话框。\n&lt；dialog&gt；标记支持所有全局和事件属性。我们可以使用对话框通知用户，就像发出警报一样。\nA&lt；进步&gt；标记用于指示任务的进度。这与我们在下载文件时看到的进度条类似。\n&lt；进步&gt；标记有两个属性，value和max。max属性的默认值是1，value属性表示max值的分数，除了进度之外什么都没有。\n在上面的代码片段中，当我们将value of value属性设置为0.45并省略max时，结果保持不变。我们可以使用标签标签来提高可访问性。\n&lt；米&gt；tag与&lt；进步&gt；标记，但仪表标记用于指示测量值或测量单位，使其更具语义。\n&lt；米&gt；标记具有各种属性，如最小、最大、低、高、值等，用于指示进度条。\n&lt；文件集&gt；标签通常用于将相关项组合在一个表单中，并在这些相关项周围绘制一个漂亮的边框。\n&lt；fieldset&gt&书信电报；传奇&gt；用户详细信息&lt/传奇&gt&书信电报；标签为=&#34；姓名&#34&gt；名称&lt/标签&gt&书信电报；输入类型=&#34；正文&#34；id=&#34；姓名&#34；姓名=&#34；姓名&#34&gt&书信电报；br&gt&书信电报；br&gt&书信电报；标签为=&#34；电子邮件&#34&gt；电子邮件&lt/标签&gt&书信电报；输入类型=&#34；电子邮件&#34；id=&#34；电子邮件&#34；姓名=&#34；电子邮件&#34&gt&书信电报；br&gt&lt/fieldset&gt；\n&lt；fieldset&gt；标记具有禁用属性，用于禁用字段集中的输入元素。它还支持所有全局和事件属性。\n&lt；数据列表&gt；标记用于为具有自动完成和下拉功能的输入元素指定预定义选项。\n&lt；数据列表&gt；id属性应等于&lt；的列表属性；输入&gt；元素将它们连接在一起。\n&lt；标签为=&#34；语言&#34&gt；选择您最喜欢的语言&lt/标签&gt&书信电报；输入列表=&#34；语言&#34；姓名=&#34；语言&#34&gt&书信电报；数据列表id=&#34；语言&#34&gt&书信电报；期权价值=&#34；JavaScript&#34&gt&书信电报；期权价值=&#34；蟒蛇&#34&gt&书信电报；期权价值=&#34；爪哇和#34&gt&书信电报；期权价值=&#34；去&#34&gt&书信电报；期权价值=&#34；锈蚀#34&gt&lt/数据列表&gt；\n&lt；细节&gt；标签用于为手风琴等文本提供额外的细节。附加细节可以轻松切换。\n&lt；总结&gt；标记用于显示详细信息的可见文本。默认情况下，它是关闭的，使用“打开”属性，我们可以在第一次加载时将其打开。\n&lt；dl&gt；被称为描述列表标签。它与&lt；dt&gt；和&lt；dd&gt；用于显示描述列表。\n&lt；var&gt；标签用来表示数学表达式中的变量，就像我们在印刷书籍中看到的那样。\n应用于&lt；var&gt；标记是斜体的，它支持所有全局和事件属性。\n&lt；noscript&gt；标记用于向在浏览器中禁用JavaScript的用户或其浏览器不支持JavaScript的用户显示备用内容。\n在这一行上方插入了一个noscript标记，如果禁用JavaScript，您将能够看到这一行。\n还有一些标签，比如，&lt；图片&gt&书信电报；地图&gt&书信电报；产量&gt&书信电报；模板&gt；等等。你可以开始研究它们，并使用适合你工作的任何东西。\n🔭 对于这些HTML标记的实时演示，您可以查看此codepen链接。\n如果你喜欢定期收到与web开发和技术相关的提示和技巧，那么一定要继续@dev_apt", "note_en": "HTML is a markup language that powers the web. In HTML5 so many things were added and improved. But there are certain HTML tags that are rarely used or are not known to many.\n In this article, we&#39;re going to see 10 useful HTML tags that are obscure to many people but could be handy to use effectively.\n   We can create a simple and good-looking dialog box with just one line of HTML code. Using  &lt;dialog&gt; tag with  open attribute, a nice centered dialog box can be created.\n   &lt;dialog&gt; tag supports all global and event attributes. We can use  dialog box to notify users like an alert.\n   A  &lt;progress&gt; tag is used to indicate the progress of a task. This looks similar to the progress bars that we see while downloading files.\n &lt;progress&gt; tag has two attributes,  value and  max. The default value of  max attribute is 1 and  value attribute represents the fraction of the  max value, nothing but progress.\n   In the above code snippet, when we make the value of  value attribute to 0.45 and omit max, the result remains the same. We can use  label tag to improve accessibility.\n    &lt;meter&gt; tag is just similar to  &lt;progress&gt; tag, but the meter tag is used to indicate the measurements or measuring units making it more semantical.\n &lt;meter&gt; tag has various attributes like  min,  max,  low,  high,  value etc for indicating the progress bar.\n     &lt;filedset&gt; tag is generally used to group related items together in a form and it draws a nice border around those related items.\n &lt;fieldset&gt; &lt;legend&gt;User details&lt;/legend&gt; &lt;label for=&#34;name&#34;&gt;Name&lt;/label&gt; &lt;input type=&#34;text&#34; id=&#34;name&#34; name=&#34;name&#34;&gt;&lt;br&gt;&lt;br&gt; &lt;label for=&#34;email&#34;&gt;Email&lt;/label&gt; &lt;input type=&#34;email&#34; id=&#34;email&#34; name=&#34;email&#34;&gt;&lt;br&gt;&lt;/fieldset&gt;\n   &lt;fieldset&gt; tag has a  disabled attribute for disabling the input elements inside the fieldset. It also supports all global and event attributes.\n  &lt;datalist&gt; tag is used to specify predefined options for an  input element with autocomplete and dropdown features.\n &lt;datalist&gt;  id attribute should be equal to the  list attribute of  &lt;input&gt; element to join them together.\n &lt;label for=&#34;language&#34;&gt;Select your favorite language&lt;/label&gt;&lt;input list=&#34;languages&#34; name=&#34;language&#34;&gt;&lt;datalist id=&#34;languages&#34;&gt; &lt;option value=&#34;JavaScript&#34;&gt; &lt;option value=&#34;Python&#34;&gt; &lt;option value=&#34;Java&#34;&gt; &lt;option value=&#34;Go&#34;&gt; &lt;option value=&#34;Rust&#34;&gt;&lt;/datalist&gt;\n    &lt;details&gt; tag is used to provide additional details for a piece of text like an accordion. The additional details can be toggled easily.\n &lt;summary&gt; tag is used to display the visible text for the details. By default, it is closed and using  open attribute we can make it open on the first time load.\n       &lt;dl&gt; is called a description list tag. It is along with  &lt;dt&gt; and  &lt;dd&gt; are used to show a description list.\n      &lt;var&gt; tag is used to represent the variables in a mathematical expression just like how we see in the printed books.\n   The default style applied to  &lt;var&gt; tag is italic and it supports all global and event attributes.\n       &lt;noscript&gt; tag is used to show alternate content to the users who have disabled JavaScript in their browser or if the JavaScript is not supported by their browser.\n  Above this line a  noscript tag is inserted, if you disable the JavaScript you will be able to see that line.\n  There are a few more tags like,  &lt;picture&gt;,  &lt;map&gt;,  &lt;output&gt;,  &lt;template&gt; etc. You can start looking into them and use whatever is apt for your work.\n 🔭 For a live demonstration of these HTML tags, you can check this  codepen link.\n If you like receiving regular tips, tricks related to web development and technology then do follow on    @dev_apt", "posttime": "2022-02-26 09:22:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "html,gt", "title": "隐藏HTML标记", "title_en": "Obscure HTML Tags", "transed": 1, "url": "https://devapt.com/html-tags", "via": "", "real_tags": ["html", "gt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075146, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过阅读这些文章，你将详细了解量子计算和量子力学的所有基本原理，以及两个重要的应用：量子搜索算法和量子隐形传态。\n你需要熟悉并熟悉线性代数和复数的基础知识。我们&#39；剩下的我教你。\n呈现在一种新的记忆媒介中，让你几乎毫不费力地记住你读到的内容\n《量子国度》是一本新的书。它的界面整合了认知科学的强大思想，让记忆成为一种选择。在量子计算这样的主题中，这一点很重要，因为许多学习者都对不熟悉的概念和符号感到不知所措。", "note_en": "By working through these essays, you will understand in detail all the basic principles of quantum computing and quantum mechanics, plus two important applications: the quantum search algorithm and quantum teleportation.\n You’ll need familiarity and comfort with the basics of linear algebra and complex numbers. We&#39;ll teach you the rest.\n Presented in a new mnemonic medium which makes it almost effortless to remember what you read\n Quantum Country is a new kind of book. Its interface integrates powerful ideas from cognitive science to make memory a choice. This is important in a topic like quantum computing, which overwhelms many learners with unfamiliar concepts and notation.", "posttime": "2022-02-26 09:21:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "介绍,introduction,量子", "title": "自由介绍间隔重复量子计算（2019）", "title_en": "A free introduction to quantum computing with spaced repetition (2019)", "transed": 1, "url": "https://quantum.country", "via": "", "real_tags": ["介绍", "量子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075145, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们非常高兴地宣布v4。Actix网站的0！Actix Web是用Rust编写的，是一个强大、高性能的Web框架，用于创建从微型到整体的Web服务。您可以依靠它来构建最关键的系统。\nv4版本是由社区驱动的，57个贡献者提交了600多个承诺！我们&#39；我们走了很长的路。主要变化包括：\n使actix http更加精简。这个板条箱支撑着Actix Web，包含我们的HTTP/1实现和较低级别的HTTP处理。\n迁移指南包含说明和差异，说明如何更新。至少值得一读带有警告表情符号的条目，因为它们显示了行为变化，不会暴露编译器错误。actix http和actix web的变更日志包含完整、详尽的变更列表（约400个条目）。\n在这次发布的过程中，团队学到了很多。预计两次发布之间的测试周期会更短。\nactix网络生态系统中的其他板条箱将在未来几天内稳定下来。\nv4周期的前几次单点发布基本上是计划好的。许多预定包含的项目已经在actix web lab板条箱中提供。", "note_en": "We are very pleased to announce v4.0 of Actix Web! Actix Web, written in Rust, is a powerful, high-performance web framework used to create web services, from micro to monolith. You can rely on it to build your most mission-critical systems.\n  The v4 release have been a community-driven effort, with of over 600 commits by 57 contributors! We&#39;ve come a long way together.Key changes include:\n Make  actix-http more lean. This crate underpins Actix Web, containing our HTTP/1 implementation and lower-level HTTP handling.\n The  migration guide contains explanations and diffs showing how to update. It is worth reading at least the items marked with a warning emoji because these show behavioral changes and will not surface compiler errors. Changelogs for  actix-http and  actix-web contain the complete, exhaustive list (~400 entries) of changes.\n  The team learned a lot while working towards this release. Expect shorter beta periods between releases.\n The other crates in the  actix-web ecosystem will be stabilized in the next few days.\n The first couple of point releases for the v4 cycle are largely planned out. Many of the items slated for inclusion are already available in the   actix-web-lab crate.", "posttime": "2022-02-26 09:19:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "actix,web", "title": "宣布Actix Web v4。0", "title_en": "Announcing Actix Web v4.0", "transed": 1, "url": "https://github.com/actix/actix-web/wiki/v4-Announcement", "via": "", "real_tags": ["actix", "web"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075144, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嵌入（用于wordpress.com托管的博客和archive.org项目&lt；描述&gt；标签）[archiveorg gray-4-universal width=560 height=384 frameborder=0 webkitallowfullscreen=true mozallowfullscreen=true]", "note_en": "EMBED (for wordpress.com hosted blogs and archive.org item &lt;description&gt; tags)  [archiveorg gray-4-universal width=560 height=384 frameborder=0 webkitallowfullscreen=true mozallowfullscreen=true]", "posttime": "2022-02-26 09:18:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旋转门,door,用于", "title": "所有四顶点图的旋转门格雷码[视频]", "title_en": "Revolving-door Gray code for all 4-vertex graphs [video]", "transed": 1, "url": "https://archive.org/details/gray-4-universal", "via": "", "real_tags": ["旋转门", "door", "用于"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075143, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "国际救援委员会（IRC）应对世界上最严重的人道主义危机，帮助人们生存和重建生活。了解如何帮助IRC提供救生护理", "note_en": "The International Rescue Committee (IRC) responds to the world’s worst humanitarian crises and helps people to survive and rebuild their lives. Find out how you can help the IRC offer lifesaving care", "posttime": "2022-02-26 09:18:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "响应,response,帮助", "title": "应急响应：帮助乌克兰家庭", "title_en": "Emergency Response: Help Ukrainian Families", "transed": 1, "url": "https://www.rescue.org/", "via": "", "real_tags": ["响应", "response", "帮助"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075142, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Braintree Payments使用PostgreSQL作为其主要数据存储。我们严重依赖传统关系数据库提供的数据安全性和一致性保证，但这些保证会带来一定的操作困难。为了让事情变得更有趣，我们允许我们的主要支付处理服务实现零计划功能停机。\n几年前，我们发表了一篇博客文章，详细介绍了我们在不中断生产API流量的情况下安全运行DDL操作的一些经验。\n从那时起，PostgreSQL经历了相当多的主要升级周期——其中有几个增加了对并发DDL的改进支持。我们&#39；我们还进一步完善了我们的流程。考虑到变化有多大，我们认为是时候发布一篇博客文章了。\n实时代码和模式与更新后的代码和模式保持前向兼容：这使我们能够在一组应用服务器和数据库集群中逐步展开部署。\n新的代码和模式与实时代码和模式向后兼容：这允许我们在发生意外错误时回滚到以前版本的任何更改。\n在表或索引上获取的任何独占锁最多可保持2秒。\nPostgreSQL支持事务性DDL。在大多数情况下，可以在显式数据库事务中执行多个DDL语句，并使用&#34；要么全无&#34；一系列改变的方法。然而，在一个事务中运行多个DDL语句有一个严重的缺点：如果您更改多个对象，您&#39；我们需要在单个事务中获取所有这些对象的独占锁。由于多个表上的锁会造成死锁，并增加长时间等待的风险，因此我们不会将多个DDL语句组合到一个事务中。PostgreSQL仍将以事务方式执行每个单独的DDL语句；每条语句要么被干净地应用，要么失败，事务被回滚。\n注意：并发索引创建是一种特殊情况。Postgres不允许在显式事务中同时执行创建索引；相反，Postgres自己管理交易。如果由于某种原因，索引生成在完成之前失败，您可能需要在重试之前删除该索引，但如果索引未成功完成生成，则该索引将永远不会用于常规查询。\nPostgreSQL有许多不同级别的锁定。我们&#39；我们主要关注以下表级锁，因为DDL通常在这些级别上运行：\nSHARE ROW EXCLUSIVE：阻止对锁定表中的行进行并发DDL和行修改（允许读取）。\n所有DDL操作通常都需要在被操纵的对象上获取其中一个锁。例如，运行时：\nPostgreSQL试图获取表foos上的访问独占锁。试图获取此锁会导致此表上的所有后续查询排队，直到释放锁为止。在实践中，DDL操作可能会导致其他查询在执行最长运行查询所需的时间内进行备份。由于传入查询的任意长排队与中断是无法区分的，因此我们试图避免在支持支付处理应用程序的数据库中出现任何长时间运行的查询。\n但有时查询所需的时间比您预期的要长。或者你可能有一些你已经知道需要很长时间的特殊情况查询。PostgreSQL提供了一些额外的运行时配置选项，使我们能够保证查询队列背压不会&#39；不会导致停机。\n在执行DDL语句时，我们不依赖Postgres来锁定对象，而是自己显式地获取锁。这使我们能够仔细控制查询排队的时间。此外，当我们无法在几秒钟内获得锁时，我们会在重试之前暂停，以便在不显著增加负载的情况下执行任何排队查询。最后，在尝试锁获取之前，我们检查（此处的查询）是否存在任何当前长时间运行的查询，以避免在锁获取不太可能成功的情况下，不必要地将查询排队几秒钟。\n从Postgres 9.3开始，您可以调整lock_timeout参数，以控制Postgres在返回而不获取锁之前允许获取锁的时间。如果您碰巧使用的是9.2或更早版本（这些版本不受支持，您应该升级！），然后，您可以通过在显式锁周围使用statement_timeout参数来模拟这种行为&lt；表&gt；陈述\n在许多情况下，访问独占锁只需保持很短的时间，即Postgres更新其&#34；目录&#34；（想想元数据）表。下面我们&#39；我们将讨论较低的锁级别足以避免阻塞SELECT/INSERT/UPDATE/DELETE的长锁的情况或替代方法。\n注：有时，在表大小相对较小的情况下，即使对目录更新以外的内容（例如，完整表扫描或甚至重写）持有访问独占锁，在功能上也可以接受。我们建议根据实际的数据大小和硬件测试您的特定用例，以查看特定操作是否为&#34；足够快&#34；。在好的硬件上，表很容易加载到内存中，对数千行（甚至可能是100到数千行）的完整表扫描或重写可能是&#34；足够快&#34；。\n一般来说，添加一个表是我们不做的少数操作之一&#39；I don’我们不必想得太多，因为根据定义，我们&#39；re&#34；修改&#34；可以&#39；目前还不可能投入使用D\n虽然创建表所涉及的大多数属性都不涉及其他数据库对象，但在初始表定义中包含外键将导致Postgres获取对引用表的共享行独占锁，阻止任何并发DDL或行修改。虽然该锁应该是短期的，但它需要与获取此类锁的任何其他操作一样的谨慎。我们更愿意将它们分成两个独立的操作：创建表，然后添加外键。\n删除表需要在该表上使用独占锁。只要桌子不是&#39；t在当前使用中，你可以安全地放下桌子。在允许放下桌子之前。。。为了进入我们的生产环境，我们需要文档来显示表的所有引用何时从代码库中删除。要再次检查这种情况，可以查询PostgreSQL&#39；s table statistics view pg_stat_user_tables确认返回的统计数据不&#39；不要在合理的时间内改变。\n而它&#39；不足为奇的是，表重命名需要获取表上的访问独占锁，即&#39；这远非我们最大的担忧。除非该表没有被读取或写入，否则它&#39；it’应用程序代码不太可能安全地处理在其下重命名的表。\n我们几乎完全避免表重命名。但如果重命名是绝对必要的，那么安全的方法可能如下所示：\n在旧表上使用INSERT和UPDATE触发器来维护新表中的奇偶校验。\n其他涉及视图和/或规则的方法也可能可行，具体取决于所需的性能特征。\n向现有表中添加列通常需要在更新目录表时在表上保持短访问独占锁。但有几个潜在的问题：\n默认值：在添加列的同时引入默认值将导致表被锁定，而表中所有行的默认值都将被分配。相反，你应该：\n注意：在最近发布的PostgreSQL 11中，非易失性默认值不再是这种情况。相反，添加一个带有默认值的新列只需要更新目录表，任何没有新列值的行读取都会神奇地拥有它&#34；填写&#34；在飞行中。\nNot null约束：只有在没有现有行或还提供了默认值的情况下，才能添加带有Not约束的列。如果没有现有行，那么该更改实际上相当于仅目录更改。如果存在现有行，并且您也指定了默认值，那么对于默认值，上述警告同样适用。\n注意：添加列将导致所有SELECT*FROM。。。引用表以开始返回新列的样式查询。确保所有当前运行的代码安全地处理新列是很重要的。为了避免应用程序中出现这种情况，我们要求查询避免*扩展，以支持显式列引用。\n在一般情况下，更改列&#39；s类型要求在使用新类型重写整个表时，在表上保持独占锁。\n注意：尽管9.1中添加了上述异常之一，但更改索引列的类型始终会重写索引，即使避免了表重写。在9.2中，任何避免表重写的列数据类型也可以避免重写相关的索引。如果你&#39；I’我想确认一下，您的零钱赢了&#39；如果不重写表或任何索引，可以查询pg_类并验证relfilenode列不&#39；不要改变。\n如果您需要更改列的类型，且上述异常之一不存在&#39；如果不适用，那么安全的替代方案是：\n重命名&lt；列&gt；致老uu&lt；列&gt；和新的&lt；列&gt；在单个事务和显式锁定中&lt；表&gt；陈述\n不言而喻，删除一篇专栏文章应该非常小心。删除列需要表上的独占锁来更新目录，但不会重写表。只要列不是&#39；t在当前使用中，你可以安全地放下柱子。它&#39；确认列未被任何可能不安全的依赖对象引用也很重要。特别是，任何使用该列的索引都应该单独安全地删除，同时删除索引，否则它们将在访问独占锁下与该列一起自动删除。您可以查询pg_depend中的任何依赖对象。\n在允许更改表格之前。。。删除列。。。为了进入我们的生产环境，我们需要文档来显示何时从代码库中删除了对该列的所有引用。这个过程使我们能够安全地回滚到丢弃列之前的版本。\n注意：删除列需要更新所有依赖该列的视图、触发器、函数等。\n创建索引的标准形式。。。在使用单个表扫描构建索引时，针对正在编制索引的表获取访问独占锁。相比之下，表单会同时创建索引。。。获取共享更新独占锁，但必须完成两次表扫描（因此速度稍慢）。这个较低的锁级别允许在构建索引时继续对表进行读写。\n单个表上的多个并发索引创建不会从两个创建索引中同时返回。。。语句，直到最慢的语句完成。\n同时创建索引。。。可能不会在事务内部执行，但会在内部维护事务。这种保持打开事务的方式意味着，在索引构建开始之后，直到构建完成之前，自动清空（针对系统中的任何表）都无法清理引入的死元组。如果有一个更新量很大的表（如果更新到非常小的表，情况尤其糟糕），这可能会导致非常不理想的查询执行。\n同时创建索引。。。必须等待使用该表的所有事务完成后才能返回。\n下降指数的标准形式。。。在删除索引时获取对具有索引的表的访问独占锁。对于小索引，这可能是一个短期操作。但是，对于大型索引，文件系统断开链接和磁盘刷新可能需要大量时间。相比之下，表单删除索引。。。获取共享更新独占锁以执行这些操作，允许在删除索引时继续对表进行读写。\n同时删除索引。。。不能用于删除任何支持约束（例如主键或唯一）的索引。\n同时删除索引。。。可能不会在事务内部执行，但会在内部维护事务。这种保持打开事务的方式意味着，在索引构建开始之后，直到构建完成之前，自动清空（针对系统中的任何表）都无法清理引入的死元组。如果有一个更新量很大的表（如果更新到非常小的表，情况尤其糟糕），这可能会导致非常不理想的查询执行。\n同时删除索引。。。必须等待使用该表的所有事务完成后才能返回。\n注意：同时删除索引。。。在Postgres 9.2中添加。如果你&#39；如果仍在运行9.1或更早版本，则可以通过将索引标记为无效且未准备好写入、使用pgfincore扩展刷新缓冲区以及删除索引来获得类似的结果。\n改变索引。。。重命名为。。。需要索引上的访问独占锁，阻止对基础表的读取和写入。然而，最近的一项承诺预计将成为Postgres 12的一部分，降低了共享独家更新的要求。\n重新索引索引。。。需要索引上的访问独占锁，阻止对基础表的读取和写入。相反，我们使用以下程序：\n注意：如果需要重建的索引支持一个约束，请记住也要重新添加约束（根据我们记录的所有注意事项）。\n从列中删除现有的NOTNULL约束需要在执行简单目录更新时对表进行独占锁定。\n相反，向现有列添加NOTNULL约束需要表上的独占锁，而完整表扫描验证不存在空值。相反，你应该：\n使用ALTER TABLE添加一个CHECK约束，要求列不为空&lt；表&gt；添加约束&lt；名称&gt；检查（&lt；column&gt；不为空）无效；。无效项告诉Postgres它没有&#39；不需要扫描整个表来验证所有行是否满足条件。\n使用ALTER TABLE验证约束&lt；表&gt；验证约束&lt；name&gt；；。使用此语句，PostgreSQL将阻止获取表的其他独占锁，但不会阻止读取或写入。\n额外好处：目前有一个补丁正在开发中（可能它会进入Postgres 12），如果已经存在检查约束（如我们上面创建的）的话，它将允许您在不进行完整表扫描的情况下创建一个非空约束。\n改变桌子。。。ADD FOREIGN KEY要求在修改的表和引用的表上都有一个共享行独占锁（从9.5开始）。而这场胜利&#39；t阻塞SELECT查询，长时间阻塞行修改操作对于我们的事务处理应用程序来说同样是不可接受的。\n改变桌子。。。添加外键。。。无效：添加外键并开始对所有新的INSERT/UPDATE语句强制执行约束，但不验证所有现有行是否符合新约束。此操作仍然需要共享行独占锁，但这些锁仅短暂保持。\n改变桌子。。。验证约束&lt；约束&gt；：此操作将检查所有现有行，以验证它们是否符合指定的约束。验证需要共享更新独占，因此可以与行读取和修改查询同时运行。\n改变桌子。。。添加约束。。。检查（…）需要访问独占锁。然而，与外键一样，Postgres支持将操作分为两个步骤：\n改变桌子。。。添加约束。。。检查（…）无效：添加检查约束，并开始对所有新的INSERT/UPDATE语句强制执行该约束，但不验证所有现有行是否符合新约束。此操作仍需要访问独占锁。\n改变桌子。。。验证约束&lt；约束&gt；：此操作将检查所有现有行，以验证它们是否符合指定的约束。验证需要对修改后的表进行独占的共享更新，因此可以与行读取和修改查询同时运行。引用表上有一个行共享锁，它将在验证约束时阻止任何需要独占锁的操作。\n改变桌子。。。添加约束。。。独特的（…）需要访问独占锁。然而，Postgres支持将操作分为两个步骤：\n同时创建一个唯一的索引。此步骤将立即强制唯一性，但如果需要声明的约束（或主键），则继续单独添加约束。\n使用已有的带有ALTER TABLE的索引添加约束。。。添加约束。。。唯一使用索引&lt；索引&gt；。添加约束仍然需要访问独占锁，但该锁将仅用于快速目录操作。\n注意：如果指定主键而不是唯一键，则索引中的任何非空列都将变为非空。这需要一个完整的表格扫描，目前可以&#39；这是不可避免的。有关更多详细信息，请参见非空约束。\n改变桌子。。。添加约束。。。排除使用。。。需要访问独占锁。添加排除约束会生成支持索引，不幸的是，目前不支持使用现有索引（可以使用唯一约束）。\n创建类型&lt；名称&gt；作为（…）和下拉式&lt；名称&gt；（在验证数据库中没有现有用法后）这两种方法都可以安全地完成，而不会出现意外锁定。\n改变类型&lt；enum&gt；重命名值&lt；旧的&gt；到&lt；新&gt；在10级后加上。此语句不需要使用枚举类型的锁定表。\n枚举在内部存储为整数，不支持有效范围内的间隙，删除一个值将导致当前值移位，并使用这些值重写所有行。PostgreSQL目前不支持从现有枚举类型中删除值。\n我们&#39；我们也很高兴地宣布，我们已经开放了我们的内部库pg_ha_迁移。这个Ruby gem在使用Ruby on Rails和/或ActiveRecord的项目中加强了DDL安全性，重点是明确选择折衷方案，避免不必要的魔法（以及相应的意外）。你可以在项目#39；这是自述。\n[^locks hold]您可以找到活动的长期运行查询，以及它们通过以下查询锁定的表：https://gist.github.com/30b4779cb101c133859a1a11247233f1\n[^relation Rewrited]通过查看运行语句后relfilenode值是否发生变化，可以查看DDL是否会导致关系被重写：https://gist.github.com/67687738c11f1f5ba8a04a7198d92715\n[^dependent objects]通过运行以下语句，可以找到依赖于特定列的对象（例如索引）：https://gist.github.com/5fac44d798bbce1d5d4f9c0bd57abb21", "note_en": "Braintree Payments uses PostgreSQL as its primary datastore. We rely heavily on the data safety and consistency guarantees a traditional relational database offers us, but these guarantees come with certain operational difficulties. To make things even more interesting, we allow zero scheduled functional downtime for our main payments processing services.\n Several years ago we  published a blog post detailing some of the things we had learned about how to safely run DDL operations without interrupting our production API traffic.\n Since that time PostgreSQL has gone through quite a few major upgrade cycles -- several of which have added improved support for concurrent DDL. We&#39;ve also further refined our processes. Given how much has changed, we figured it was time for a blog post redux.\n     Live code and schemas be forward-compatible with updated code and schemas: this allows us to roll out deploys gradually across a fleet of application servers and database clusters.\n New code and schemas be backward-compatible with live code and schemas: this allows us to roll back any change to the previous version in the event of unexpected errors.\n  Any exclusive locks acquired on tables or indexes be held for at most ~2 seconds.\n  PostgreSQL supports transactional DDL. In most cases, you can execute multiple DDL statements inside an explicit database transaction and take an &#34;all or nothing&#34; approach to a set of changes. However, running multiple DDL statements inside a transaction has one serious downside: if you alter multiple objects, you&#39;ll need to acquire exclusive locks on all of those objects in a single transactions. Because locks on multiple tables creates the possibility of deadlock and increases exposure to long waits, we do not combine multiple DDL statements into a single transaction. PostgreSQL will still execute each separate DDL statement transactionally; each statement will be either cleanly applied or fail and the transaction rolled back.\n Note: Concurrent index creation is a special case. Postgres disallows executing  CREATE INDEX CONCURRENTLY inside an explicit transaction; instead Postgres itself manages the transactions. If for some reason the index build fails before completion, you may need to drop the index before retrying, though the index will still never be used for regular queries if it did not finish building successfully.\n  PostgreSQL has  many different levels of locking. We&#39;re concerned primarily with the following table-level locks since DDL generally operates at these levels:\n SHARE ROW EXCLUSIVE: blocks concurrent DDL against and row modification (allowing reads) in the locked table.\n  All DDL operations generally necessitate acquiring one of these locks on the object being manipulated. For example, when you run:\n  PostgreSQL attempts to acquire an  ACCESS EXCLUSIVE lock on the table  foos. Atempting to acquire this lock  causes all subsequent queries on this table to queue until the lock is released. In practice your DDL operations can cause other queries to back up for as long as your longest running query takes to execute. Because arbitrarily long queueing of incoming queries is indistinguishable from an outage, we try to avoid any long-running queries in databases supporting our payments processing applications.\n But sometimes a query takes longer than you expect. Or maybe you have a few special case queries that you already know will take a long time. PostgreSQL offers some additional runtime configuration options that allow us to guarantee query queueing backpressure doesn&#39;t result in downtime.\n Instead of relying on Postgres to lock an object when executing a DDL statement, we acquire the lock explicitly ourselves. This allows us to carefully control the time the queries may be queued. Additionally when we fail to acquire a lock within several seconds, we pause before trying again so that any queued queries can be executed without significantly increasing load. Finally, before we attempt lock acquisition, we check ( query here) for any currently long running queries to avoid unnecessarily queueing queries for several seconds when it is unlikely that lock acquisition is going to succeed.\n Starting with Postgres 9.3, you adjust the   lock_timeout parameter to control how long Postgres will allow for lock acquisition before returning without acquiring the lock. If you happen to be using 9.2 or earlier (and those are unsupported; you should upgrade!), then you can simulate this behavior by using the   statement_timeout parameter around an explicit  LOCK &lt;table&gt; statement.\n In many cases an  ACCESS EXCLUSIVE lock need only be held for a very short period of time, i.e., the amount of time it takes Postgres to update its &#34;catalog&#34; (think metadata) tables. Below we&#39;ll discuss the cases where a lower lock level is sufficient or alternative approaches for avoiding long-held locks that block  SELECT/INSERT/UPDATE/DELETE.\n Note: Sometimes holding even an  ACCESS EXCLUSIVE lock for something more than a catalog update (e.g., a full table scan or even rewrite) can be functionally acceptable when the table size is relatively small. We recommend testing your specific use case against realistic data sizes and hardware to see if a particular operation will be &#34;fast enough&#34;. On good hardware with a table easily loaded into memory, a full table scan or rewrite for thousands (possibly even 100s of thousands) of rows may be &#34;fast enough&#34;.\n   In general, adding a table is one of the few operations we don&#39;t have to think too hard about since, by definition, the object we&#39;re &#34;modifying&#34; can&#39;t possibly be in use yet. :D\n While most of the attributes involved in creating a table do not involve other database objects, including a foreign key in your initial table definition will cause Postgres to acquire a  SHARE ROW EXCLUSIVE lock against the referenced table blocking any concurrent DDL or row modifications. While this lock should be short-lived, it nonetheless requires the same caution as any other operation acquiring such a lock. We prefer to split these into two separate operations: create the table and then  add the foreign key.\n  Dropping a table requires an exclusive lock on that table. As long as the table isn&#39;t in current use you can safely drop the table. Before allowing a  DROP TABLE ... to make its way into our production environments we require documentation showing when all references to the table were removed from the codebase. To double check that this is the case you can  query PostgreSQL&#39;s table statistics view  pg_stat_user_tables confirming that the returned statistics don&#39;t change over the course of a reasonable length of time.\n  While it&#39;s unsurprising that a table rename requires acquiring an  ACCESS EXCLUSIVE lock on the table, that&#39;s far from our biggest concern. Unless the table is not being read from or written to, it&#39;s very unlikely that your application code could safely handle a table being renamed underneath it.\n We avoid table renames almost entirely. But if a rename is an absolute must, then a safe approach might look something like the following:\n Use INSERT and UPDATE triggers on the old table to maintain parity in the new table.\n Other approaches involving views and/or RULEs may also be viable depending on the performance characteristics required.\n    Adding a column to an existing table generally requires holding a short  ACCESS EXCLUSIVE lock on the table while catalog tables are updated. But there are several potential gotchas:\n Default values: Introducing a default value at the same time of adding the column will cause the table to be locked while the default value in propogated for all rows in the table. Instead, you should:\n  Note: In the recently release PostgreSQL 11, this is no longer the case for non-volatile default values. Instead adding a new column with a default value only requires updating catalog tables, and any reads of rows without a value for the new column will  magically have it &#34;filled in&#34; on the fly.\n Not-null constraints: Adding a column with a not-constraint is only possible if there are no existing rows or a  DEFAULT is also provided. If there are no existing rows, then the change is effectively equivalent to a catalog only change. If there are existing rows and you are also specifying a default value, then the same caveats apply as above with respect to default values.\n Note: Adding a column will cause all  SELECT * FROM ... style queries referencing the table to begin returning the new column. It is important to ensure that all currently running code safely handles new columns. To avoid this gotcha in our applications we require queries to avoid  * expansion in favor of explicit column references.\n  In the general case changing a column&#39;s type requires holding an exclusive lock on a table while the entire table is rewritten with the new type.\n   Note: Even though one of the exceptions above was added in 9.1, changing the type of an indexed column would always rewrite the index even if a table rewrite was avoided. In 9.2 any column data type that avoids a table rewrite also  avoids rewriting the associated indexes. If you&#39;d like to confirm that your change won&#39;t rewrite the table or any indexes, you can  query  pg_class and verify the  relfilenode column doesn&#39;t change.\n If you need to change the type of a column and one of the above exceptions doesn&#39;t apply, then the safe alternative is:\n Rename  &lt;column&gt; to  old_&lt;column&gt; and  new_&lt;column&gt; inside a single transaction and explicit  LOCK &lt;table&gt; statement.\n  It goes without saying that dropping a column is something that should be done with great care. Dropping a column requires an exclusive lock on the table to update the catalog but  does not rewrite the table. As long as the column isn&#39;t in current use you can safely drop the column. It&#39;s also important to confirm that the column is not referenced by any dependent objects that could be unsafe to drop. In particular, any indexes using the column should be dropped separately and safely with   DROP INDEX CONCURRENTLY since otherwise they will be automatically dropped along with the column under an  ACCESS EXCLUSIVE lock. You can  query  pg_depend for any dependent objects.\n Before allowing a  ALTER TABLE ... DROP COLUMN ... to make its way into our production environments we require documentation showing when all references to the column were removed from the codebase. This process allows us to safely roll back to the release prior to the one that dropped the column.\n Note: Dropping a column will require that you update all views, triggers, function, etc. that rely on that column.\n   The standard form of  CREATE INDEX ... acquires an  ACCESS EXCLUSIVE lock against the table being indexed while building the index using a single table scan. In contrast, the form  CREATE INDEX CONCURRENTLY ... acquires an  SHARE UPDATE EXCLUSIVE lock but must complete two table scans (and hence is somewhat slower). This lower lock level allows reads and writes to continue against the table while the index is built.\n  Multiple concurrent index creations on a single table will not return from either  CREATE INDEX CONCURRENTLY ... statement until the slowest one completes.\n CREATE INDEX CONCURRENTLY ... may not be executed inside of a transaction but does maintain transactions internally. This holding open a transaction means that no auto-vacuums (against any table in the system) will be able to cleanup dead tuples introduced after the index build begins until it finishes. If you have a table with a large volume of updates (particularly bad if to a very small table) this could result in extremely unoptimal query execution.\n CREATE INDEX CONCURRENTLY ... must wait for all transactions using the table to complete before returning.\n  The standard form of  DROP INDEX ... acquires an  ACCESS EXCLUSIVE lock against the table with the index while removing the index. For small indexes this may be a short operation. For large indexes, however, file system unlinking and disk flushing can take a significant amount of time. In contrast, the form  DROP INDEX CONCURRENTLY ... acquires a  SHARE UPDATE EXCLUSIVE lock to perform these operations allowing reads and writes to continue against the table while the index is dropped.\n  DROP INDEX CONCURRENTLY ... cannot be used to drop any index that supports a constraint (e.g.,  PRIMARY KEY or  UNIQUE).\n DROP INDEX CONCURRENTLY ... may not be executed inside of a transaction but does maintain transactions internally. This holding open a transaction means that no auto-vacuums (against any table in the system) will be able to cleanup dead tuples introduced after the index build begins until it finishes. If you have a table with a large volume of updates (particularly bad if to a very small table) this could result in extremely unoptimal query execution.\n DROP INDEX CONCURRENTLY ... must wait for all transactions using the table to complete before returning.\n Note:  DROP INDEX CONCURRENTLY ... was  added in Postgres 9.2. If you&#39;re still running 9.1 or prior, you can achieve somewhat similar results by marking the index as invalid and not ready for writes, flushing buffers with the pgfincore extension, and the dropping the index.\n  ALTER INDEX ... RENAME TO ... requires an  ACCESS EXCLUSIVE lock on the index blocking reads from and writes to the underlying table. However a  recent commit expected to be a part of Postgres 12 lowers that requirement to  SHARE UPDATE EXCLUSIVE.\n  REINDEX INDEX ... requires an  ACCESS EXCLUSIVE lock on the index blocking reads from and writes to the underlying table. Instead we use the following procedure:\n  Note: If the index you need to rebuild backs a constraint, remember to re-add the constraint as well (subject to all of the  caveats we&#39;ve documented.\n   Removing an existing not-null constraint from a column requires an exclusive lock on the table while a simple catalog update is performed.\n In constrast, adding a not-null constraint to an existing column requires an exclusive lock on the table while a full table scan verifies that no  null values exist. Instead you should:\n Add a  CHECK constraint requiring the column be not-null with  ALTER TABLE &lt;table&gt; ADD CONSTRAINT &lt;name&gt; CHECK (&lt;column&gt; IS NOT NULL) NOT VALID;. The  NOT VALID tells Postgres that it doesn&#39;t need to scan the entire table to verify that all rows satisfy the condition.\n  Validate the constraint with  ALTER TABLE &lt;table&gt; VALIDATE CONSTRAINT &lt;name&gt;;. With this statement PostgreSQL will block acquisition of other EXCLUSIVE locks for the table, but will not block reads or writes.\n Bonus: There is currently a  patch in the works (and possibly it will make it into Postgres 12) that will allow you to create a  NOT NULL constraint without a full table scan if a CHECK constraint (like we created above) already exists.\n  ALTER TABLE ... ADD FOREIGN KEY requires a  SHARE ROW EXCLUSIVE lock ( as of 9.5)  on both the altered and referenced tables. While this won&#39;t block  SELECT queries, blocking row modification operations for a long period of time is equally unacceptable for our transaction processing applications.\n  ALTER TABLE ... ADD FOREIGN KEY ... NOT VALID: Adds the foreign key and begins enforcing the constraint for all new  INSERT/UPDATE statements but does not validate that all existing rows conform to the new constraint. This operation still requires  SHARE ROW EXCLUSIVE locks, but the locks are only briefly held.\n ALTER TABLE ... VALIDATE CONSTRAINT &lt;constraint&gt;: This operation checks all existing rows to verify they conform to the specified constraint. Validation requires a  SHARE UPDATE EXCLUSIVE so may run concurrently with row reading and modification queries.\n  ALTER TABLE ... ADD CONSTRAINT ... CHECK (...) requires an  ACCESS EXCLUSIVE lock. However, as with foreign keys, Postgres supports breaking the operation into two steps:\n ALTER TABLE ... ADD CONSTRAINT ... CHECK (...) NOT VALID: Adds the check constraint and begins enforcing it for all new  INSERT/UPDATE statements but does not validate that all existing rows conform to the new constraint. This operation still requires an  ACCESS EXCLUSIVE lock.\n ALTER TABLE ... VALIDATE CONSTRAINT &lt;constraint&gt;: This operation checks all existing rows to verify they conform to the specified constraint. Validation requires a  SHARE UPDATE EXCLUSIVE on the altered table so may run concurrently with row reading and modification queries. A  ROW SHARE lock is held on the reference table which will block any operaitons requiring exclusive locks while validating the constraint.\n  ALTER TABLE ... ADD CONSTRAINT ... UNIQUE (...) requires an  ACCESS EXCLUSIVE lock. However, Postgres supports breaking the operation into two steps:\n Create a unique index  concurrently. This step will immediately enforce uniquesness, but if you need a declared constraint (or a primary key), then continue to add the constraint separately.\n Add the constraint using the already existing index with  ALTER TABLE ... ADD CONSTRAINT ... UNIQUE USING INDEX &lt;index&gt;. Adding the constraint still requires an  ACCESS EXCLUSIVE lock, but the lock will only be held for fast catalog operations.\n Note: If you specify  PRIMARY KEY instead of  UNIQUE then any non-null columns in the index will be made  NOT NULL. This requires a full table scan which currently can&#39;t be avoided. See  NOT NULL Constraints for more details.\n  ALTER TABLE ... ADD CONSTRAINT ... EXCLUDE USING ... requires an  ACCESS EXCLUSIVE lock. Adding an exclusion constraint builds the supporting index, and, unfortunately, there is currently no support for using an existing index (as you can do with a  unique constraint).\n   CREATE TYPE &lt;name&gt; AS (...) and  DROP TYPE &lt;name&gt; (after verifying there are no existing usages in the database) can both be done safely without unexpected locking.\n  ALTER TYPE &lt;enum&gt; RENAME VALUE &lt;old&gt; TO &lt;new&gt; was  added in Postgres 10. This statement does not require locking tables which use the enum type.\n  Enums are stored internally as integers and there is no support for gaps in the valid range, removing a value would currently shifting values and rewriting all rows using those values. PostgreSQL does not currently support removing values from an existing enum type.\n  We&#39;re also excited to announce that we have open-sourced our internal library  pg_ha_migrations. This Ruby gem enforces DDL safety in projects using Ruby on Rails and/or ActiveRecord with an emphasis on explicitly choosing tradeoffs and avoiding unnecessary magic (and the corresponding surprises). You can read more in the project&#39;s  README.\n   [^locks-held] You can find active long-running queries and the tables they lock with the following query: https://gist.github.com/30b4779cb101c133859a1a11247233f1\n [^relation-rewritten] You can see if DDL causes a relation to be rewritten by seeing if the  relfilenode value changes after running the statement: https://gist.github.com/67687738c11f1f5ba8a04a7198d92715\n [^dependent-objects] You can find objects (e.g., indexes) that depend on a specific column by running the statement: https://gist.github.com/5fac44d798bbce1d5d4f9c0bd57abb21", "posttime": "2022-02-26 09:05:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,模式,schema,索引", "title": "PostgreSQL模式更改指南", "title_en": "PostgreSQL Schema Change Guide", "transed": 1, "url": "https://gist.github.com/jcoleman/1e6ad1bf8de454c166da94b67537758b", "via": "", "real_tags": ["模式", "schema", "索引"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075141, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "•订阅我们的频道：http://bit.ly/TheChaplinFilms•在iTunes上下载：http://bit.ly/iTunesGreatDictatorSpeech•“我们想得太多，感觉太少。。。。", "note_en": "• Subscribe to our channel: http://bit.ly/TheChaplinFilms• Get it on iTunes: http://bit.ly/iTunesGreatDictatorSpeech• \"We think too much and feel too little....", "posttime": "2022-02-26 09:05:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "查理,chaplin,http", "title": "查理·卓别林：伟大独裁者的最后一次演讲", "title_en": "Charlie Chaplin: The Final Speech from The Great Dictator", "transed": 1, "url": "https://www.youtube.com/watch?v=J7GY1Xg6X20", "via": "", "real_tags": ["查理", "chaplin", "http"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075140, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "晶体管级NES-001模拟。目前只在OSX上构建。没有MMU支持。\n增加了主板的支持芯片。支持复合输出和音频的电压阶梯。需要大量优化。", "note_en": "Transistor level NES-001 simulation. Builds on OSX only for now. No MMU support.\n  Added support chips for main board. Support voltage ladders for composite output and audio. Needs lots of optimization.", "posttime": "2022-02-26 09:04:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "metalnes,transistor,支持", "title": "MetalNES：晶体管级模拟", "title_en": "MetalNES: Transistor Level NES Simulation", "transed": 1, "url": "https://github.com/iaddis/metalnes", "via": "", "real_tags": ["metalnes", "支持"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075139, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "再次感谢开源安全公司和Embecosm对该项目的持续支持。\n2月对GCC来说是一个重要的月份；我们之前的谷歌代码暑期学生阿瑟·科恩（Arthur Cohen）在德国的Embecosm加入我们，全职从事编译器的工作。有了额外的资源，我们可以拆分工作并委派任务，从而允许进行多个复杂的工作流，这将使Philip能够处理类型系统中的切片和bug。\n关于我们的宏扩展里程碑，我们已经准备好了构建块，并且支持大多数声明性宏，尽管仍然有一些怪癖和错误需要解决。这个里程碑的剩余时间将用于设置内置宏和修复bug。\n除了宏之外，2月份的工作重点是代码清理和bug修复，这是富有成效的。\n是我们下一个社区电话的时候了，欢迎加入！🙂\n添加对索引和范围项目的支持，以及用于切片类型检查PR974的锅炉板\n我们已经改进了我们的规范路径跟踪，以便我们可以为遗留的损坏方案建立路径。例如，嵌套在模块下的impl块在其路径中被赋予一个impl前缀。\nstruct Foo（i32）；mod A{impl Foo{fn test（&amp；self）->i32{self.0}}}fn test（）{let A=Foo（123）；let b:i32=A.test（）；}\n如您所见，我们有示例的板条箱名称-&gt；结构A-&gt；impl块例如：：A-&gt；函数名测试。\ni32示例：：A:：&lt；impl示例：：Foo&gt；：：test（const struct example:：Foo&amp；const self）{i32 D.85；D.85=self-&gt；0；返回D.85；}void example:：test（）{const struct example:：Foo a；const i32 b；try{a.0=123；b=example:：a:&lt；impl example:：Foo&gt；：：test（&amp；a）；}最后{a={CLOBBER}；}\n我们在cfg扩展中添加了对any、all和not谓词的支持，因此在本例中，这确保了为all谓词指定A和B。\nstruct Foo；impl Foo{#[cfg（all（A，B））]fn test（&amp；self）{}fn main（）{let A=Foo；A.test（）}\nRust允许我们为配置扩展指定键值对，这主要与主机/os/cpu选项有关，例如os=“linux”，但下面是一个示例，您可以在编译器资源管理器中尝试。\nstruct Foo；impl Foo{#[cfg（A=&#34；B&#34；）]fn test（&amp；self）{}fn main（）{let a=Foo；a.test（）；}\n不带任何选项的Inline类似于C风格的Inline关键字，它向编译器提示此函数是内联的良好候选函数。Inline always可以通过GCC的Inline always属性实现：https://gcc.gnu.org/onlinedocs/gcc/Inline.html.最后，我们永远不能将函数标记为DECL_不可线性。一个区别是，内联优化需要启用优化。因此，当在-O0编译时，不会发生内联，任何级别大于此级别，都将强制执行内联传递。\n方法解析方面的工作一直在稳步进行，我们现在支持deref_mut lang项目，因此对于需要a&amp；我们尝试从任何相关的接收者处获取所需的间接引用。\n外部人员&#34；C&#34；{fn printf（s:*const i8，…）；}#[lang=&#34；deref&#34；]pub trait Deref{type Target；fn Deref（&amp；self）->self:：Target；}#[lang=&#34；deref#mut&#34；]pub trait DerefMut:Deref{fn Deref_mut（&amp；mut self）&gt；&amp；mut self:：Target；}impl&lt；T&gt；德雷夫；T{type Target=T；fn-deref（&amp；self）&gt；&amp；T{*self}impl&lt；T&gt；德雷夫；mut T{type Target=T；fn deref（&amp；self）&gt；&amp；T{*self}发布结构条（i32）；impl Bar{pub fn foobar（&amp；mut self）->i32{self.0}pub struct Foo&lt；T&gt；（T） )；impl&lt；T&gt；为Foo&lt；T&gt；{type Target=T；fn deref（&amp；self）&gt；&amp；self:：Target{&amp；self.0}}impl&lt；T&gt；对Foo&lt；T&gt；{fn deref_mut（&amp；mut self）&gt；&amp；mut self：：Target{safe{let a=&amp#34；mut_deref\\n\\0&#34；；let b=a as*const str；let c=b as*const i8；printf（c）；}&amp；莫特·赛尔夫。0}pub fn main（）-&gt；i32{let bar=bar（123）；let mut foo:foo&lt；bar&gt；=foo（bar）；let foobar=foo.foobar（）；foobar-123}\n我们已经合并了我们的第一个宏观扩张通道。这里采用的方法是，我们重用现有的解析器来调用作为MacroFragmentType枚举的一部分指定的适当函数。如果解析器在解析该项时没有错误，那么它必须是匹配的。然后，一旦我们匹配了一个规则，我们就有了每个片段匹配的令牌开始/结束偏移的映射，然后用它来调整和创建宏规则定义的新令牌流，这样当我们将其提供给解析器时，令牌就已经被替换了。生成的表达式或项随后附加到相应的宏调用，然后解析名称并用于hir降低。\n在这个例子中，宏有两个规则，所以我们证明我们匹配了适当的规则，并分别转录了它。\n宏规则！添加{（$a:expr，$b:expr）=&gt；{$a+$b}；（$a:expr）=&gt；{$a}；}fn main（）-&gt；i32{let mut x=add！（1）；x+=add！（2,3）；x-6}\n宏规则！测试{（$a:ident，$b:ty）=&gt；{struct$a（$b）；}；}测验（富，i32）；fn main（）-&gt；i32{let a=Foo（123）；a.0-123}\n这里我们考虑宏调用的上下文，并将其解析为AST:：Items。如果未能匹配规则，编译器错误如下所示：\n&lt；来源&gt；：11:17：错误：未能匹配宏1 |宏|规则中的任何规则！加{| ~..11 |让mut x=add！（1,2,3）|^\n当转录规则实际上没有完全使用时，添加了更多错误处理，例如：\n在rust中，范围被转换为结构，因此，指定某种约束的语法片段实际上是可以赋值和操作的。这是我们支持切片过程中的一个组成部分。\n#[lang=&#34；RangeFull&#34；]pub struct RangeFull#[lang=&#34；范围&#34；]pub struct Range&lt；Idx&gt；{pub start:Idx，pub end:Idx，}#[lang=&#34；RangeFrom&#34；]pub struct RangeFrom&lt；Idx&gt；{pub start:Idx，}#[lang=&#34；RangeTo&#34；]酒吧结构RangeTo&lt；Idx&gt；{pub end:Idx，}#[lang=&#34；range inclusive&#34；]pub struct range inclusive&lt；Idx&gt；{pub start:Idx，pub end:Idx，}fn test（）{let a=1..2；//range let b=1..；//range from let c=..3；//range to let d=0..=2；//range inclusive}\n支持切片的另一个构建块是支持索引lang item core:：ops:：index的能力，这样一个范围就可以作为参数，core:：slice:：index中的代码实际上可以成为从数组中获取切片的起点。\n#[lang=&#34；索引&#34；]特质指数&lt；Idx&gt；{type Output；fn index（&amp；self，index:Idx）-&gt；&amp；self:：Output；}struct Foo（i32，i32）；impl索引&lt；isize&gt；对于Foo{type Output=i32；fn index（&amp；self，index:isize）->；i32{let a=Foo（1,2）；let b=a[0]；let c=a[1]；c-b-1}\n宏匹配臂可以包含重复运算符，它指示传递单个标记或元变量的多个实例的可能性。\n您可以使用Kleene运算符表示此类重复：有三种变体可用，？，+及*。每一个都对应于与运算符关联的标记数量的不同界限，类似于正则表达式。\n宏规则！kleene{（$a:ident$（，）？）=&gt；{{}；（$（$i:literal tok）+）=&gt；{{ }}; （$（$e:expr）*）=&gt；{{ }};}\n单数标识符，带有零个或一个逗号（模式：&lt；逗号&gt；，kleene运算符：？（0-&gt；1））\n一个或多个文本后跟分隔符tok（模式$i:literal tok，kleene运算符：+（1-&gt；+inf））\n实现宏重复的第一步是匹配给定给用户的实际模式。我们现在能够匹配简单的重复，但仍有一些限制和缺陷。例如，Rust引用指定了在片段说明符之后使用的有效分隔符，我们还没有检查这些分隔符。例如，禁止在$&lt&gt；：expr说明符，因为这可能会导致歧义：表达式后唯一允许的分隔符是=&gt&书信电报；逗号&gt；或\n一旦匹配了这些重复模式，就很容易计算出用户给出了多少重复模式。我们将这些数据与片段的其余部分一起存储，以确保在转录时将所述模式扩展正确的次数。\n我们将匹配重复3次，并将重复量3归因于$e元变量。\n在匹配这些重复之后，我们可以递归地扩展模式中包含的所有标记。\n再次考虑前面的声明和调用，我们可以将以下模式解析为要展开的模式：\n然后，该模式被递归地扩展，就好像它是一个常规的宏调用一样。为了确保每个元变量得到正确的扩展，我们只给新的替代上下文提供匹配片段的子集。\n宏规则！lit_plus_tok{（$（$e:literal tok）*）=&gt；{}lit_plus_tok！（&#34；rustc&#34；tok&#39；v&#39；tok 1.59 tok）；//原始匹配片段：{&#34；lit&#34；：[&#34；rustc&#34；，&#39；v&#39；，1.59]}//然后我们用{&#34；lit&#34；：[&#34；rustc&#34；]曾经与{&#34；lit&#34；：[&#39；v&#39；]}，//最后一次是{&#34；lit&#34；：[1.59]}，\n同样，我们还没有实现某些限制：一些说明符急切地得到扩展，而一些保留在用户输入的表单下。\n同样，并不是所有的重复模式都被恰当地覆盖。为了全面、正确地实施，有些问题仍有待解决。\n为了实现某些特定的行为，rust标准库需要在编译器中内置一些宏。你可以在这里找到完整的清单。\nGCCR的实施应考虑到标准rust库的编译，因为core和std都依赖于它们。\n这些宏在核心库中定义为空，它们的转录器在编译器中作为一个简单函数提供。我们在GCCR中实现这些内置函数，作为返回抽象语法树片段的函数，这些片段在宏扩展阶段插入，然后与用户代码的其余部分一起降低到中间表示形式。\n我们面前有一长串宏，其中一些应该可以轻松实现。如果你有兴趣参与进来，我们已经打开了关于内置宏的3个好的第一个问题，以及如何解决它们的详细指南。\n非常感谢bjorn3对内置宏及其实现细节的帮助。", "note_en": "Thanks again to  Open Source Security, inc and  Embecosm for their ongoing support for this project.\n  February was a big month for GCC Rust; our previous Google Summer of Code student Arthur Cohen joins us in Embecosm, Germany, working on the compiler full time. With the additional resource, we can split up work and delegate tasks allowing multiple streams of complex work to take place, which frees Philip up to work on Slice’s and bugs in the type system.\n Concerning our macro expansion milestone, we have the building blocks in place and support most declarative macros though there are some quirks and bugs to work through still. The remaining time of this milestone will be spent on setting up the builtin macros and fixing bugs.\n Other than macros, there has been a focus on code cleanup and bug fixing in February, which has been fruitful.\n  It’s time for our next community call, feel free to join in! 🙂\n   Add Support for index and Range lang items and boiler plate for Slice typechecking  PR974\n                 We have improved our canonical-path tracking so that we can build up paths for the legacy mangling scheme. So for example impl blocks nested under modules are given a prefix of impl in their path.\n struct Foo(i32);mod A { impl Foo { fn test(&amp;self) -&gt; i32 { self.0 } }}fn test() { let a = Foo(123); let b:i32 = a.test();}\n As you can see we have the crate-name of example -&gt; structure A -&gt; impl block for example::A -&gt; function name test.\n i32 example::A::&lt;impl example::Foo&gt;::test (const struct example::Foo &amp; const self){ i32 D.85; D.85 = self-&gt;0; return D.85;}void example::test (){ const struct example::Foo a; const i32 b; try { a.0 = 123; b = example::A::&lt;impl example::Foo&gt;::test (&amp;a); } finally { a = {CLOBBER}; }}\n   We added support for any, all and not predicates on cfg expansions so in this example this ensures that both A and B are specified for the all predicate.\n struct Foo;impl Foo { #[cfg(all(A, B))] fn test(&amp;self) {}}fn main() { let a = Foo; a.test();}\n   Rust allows us to specify key-value pairs for config expansion this is mostly associated with host/os/cpu options such as os = “linux” for example but here is an example below you can try in compiler explorer.\n struct Foo;impl Foo { #[cfg(A = &#34;B&#34;)] fn test(&amp;self) {}}fn main() { let a = Foo; a.test();}\n     Inline without any option is analogous to C style inline keyword giving a hint to the compiler that this function is a good candidate for inlining. Inline always can be acheived with GCC’s inline always attribute:  https://gcc.gnu.org/onlinedocs/gcc/Inline.html. Finally never we can mark functions as DECL_UNINLINEABLE. The one difference is that inline optimizations require optimizations to be enabled. So when compiling at -O0 no inlining will occur, any level greater than this, the inline pass will be enforced.\n       Work on method resolution has continued steadily and we now support the deref_mut lang item so that for methods that require a &amp;mut self reference we try to lookup any relevant deref_mut lang item to get the indirection required from the receiver.\n extern &#34;C&#34; { fn printf(s: *const i8, ...);} #[lang = &#34;deref&#34;]pub trait Deref { type Target; fn deref(&amp;self) -&gt; &amp;Self::Target;}#[lang = &#34;deref_mut&#34;]pub trait DerefMut: Deref { fn deref_mut(&amp;mut self) -&gt; &amp;mut Self::Target;}impl&lt;T&gt; Deref for &amp;T { type Target = T; fn deref(&amp;self) -&gt; &amp;T { *self }}impl&lt;T&gt; Deref for &amp;mut T { type Target = T; fn deref(&amp;self) -&gt; &amp;T { *self }}pub struct Bar(i32); impl Bar { pub fn foobar(&amp;mut self) -&gt; i32 { self.0 }}pub struct Foo&lt;T&gt;(T);impl&lt;T&gt; Deref for Foo&lt;T&gt; { type Target = T; fn deref(&amp;self) -&gt; &amp;Self::Target { &amp;self.0 }}impl&lt;T&gt; DerefMut for Foo&lt;T&gt; { fn deref_mut(&amp;mut self) -&gt; &amp;mut Self::Target { unsafe { let a = &#34;mut_deref\\n\\0&#34;; let b = a as *const str; let c = b as *const i8; printf(c); } &amp;mut self.0 }}pub fn main() -&gt; i32 { let bar = Bar(123); let mut foo: Foo&lt;Bar&gt; = Foo(bar); let foobar = foo.foobar(); foobar - 123}\n   We have merged our first pass of the macro expansion pass. The approach taken here is that we reuse our existing parser to call the apropriate functions as specified as part of the MacroFragmentType enum if the parser does not have errors parsing that item then it must be a match. Then once we match a rule we have a map of the token begin/end offsets for each fragment match, this is then used to adjust and create a new token stream for the macro rule definition so that when we feed it to the parser the tokens are already substituted. The resulting expression or item is then attached to the respective macro invocation and this is then name resolved and used for hir lowering.\n In this example the macro has two rules so we demonstrate that we match the apropriate rule and transcribe it respectively.\n macro_rules! add { ($a:expr,$b:expr) =&gt; { $a + $b }; ($a:expr) =&gt; { $a };}fn main() -&gt; i32 { let mut x = add!(1); x += add!(2, 3); x - 6}\n  macro_rules! Test { ($a:ident, $b:ty) =&gt; { struct $a($b); };}Test!(Foo, i32);fn main() -&gt; i32 { let a = Foo(123); a.0 - 123}\n Here we take into account the context of the macro invocation and parse it into AST::Items. In the even of failure to match a rule the compiler error looks like the following:\n &lt;source&gt;:11:17: error: Failed to match any rule within macro 1 | macro_rules! add { | ~ ...... 11 | let mut x = add!(1, 2, 3); | ^\n More error handling has been added for when the transcribed rule actually is not fully used so for example:\n    In rust ranges are turned into structs so what seems like piece of syntax to specify some kind of constraint is actually something which can be assigned and manipulated. This is one of the building blocks in our journey to support slices.\n #[lang = &#34;RangeFull&#34;]pub struct RangeFull;#[lang = &#34;Range&#34;]pub struct Range&lt;Idx&gt; { pub start: Idx, pub end: Idx,}#[lang = &#34;RangeFrom&#34;]pub struct RangeFrom&lt;Idx&gt; { pub start: Idx,}#[lang = &#34;RangeTo&#34;]pub struct RangeTo&lt;Idx&gt; { pub end: Idx,}#[lang = &#34;RangeInclusive&#34;]pub struct RangeInclusive&lt;Idx&gt; { pub start: Idx, pub end: Idx,}fn test() { let a = 1..2; // range let b = 1..; // range from let c = ..3; // range to let d = 0..=2; // range inclusive}\n   Another building block to support slices is the ability to suport the index lang item core::ops::index so that a range can be an argument and the code in core::slice::index can actually become the starting point in giving us a slice from an array.\n #[lang = &#34;index&#34;]trait Index&lt;Idx&gt; { type Output; fn index(&amp;self, index: Idx) -&gt; &amp;Self::Output;}struct Foo(i32, i32);impl Index&lt;isize&gt; for Foo { type Output = i32; fn index(&amp;self, index: isize) -&gt; &amp;i32 { if index == 0 { &amp;self.0 } else { &amp;self.1 } }}fn main() -&gt; i32 { let a = Foo(1, 2); let b = a[0]; let c = a[1]; c - b - 1}\n    Macro match arms can contain repetition operators, which indicate the possibilty of passing multiple instances of a single token or metavariable.\n You can denote such repetitions using Kleene operators: Three variants are available,  ?,  + and  *. Each corresponds to varying bounds on the amount of tokens associated with the operator, similarly to regular expressions.\n macro_rules! kleene { ($a:ident $(,)?) =&gt; {{ }}; ($($i:literal tok)+) =&gt; {{ }}; ($($e:expr)*) =&gt; {{ }};}\n  Either a singular identifier, with zero or one commas (pattern:  &lt;comma&gt;, kleene operator:  ? (0 -&gt; 1))\n One or more literal followed by the separator  tok (pattern  $i:literal tok, kleene operator:  + (1 -&gt;  +inf))\n The first of implementing macro repetitions comes in matching the actual patterns given to the users. We are now able to match simple repetitions, with a few limitations and bugs still. For example, the Rust reference specifies valid separators to use after fragment specifiers, which we do not check yet. It is for example forbidden to add an identifier after an  $&lt;&gt;:expr specifier, since that could cause ambiguity: The only allowed separators after an expression are thus  =&gt;,  &lt;comma&gt; or  ;.\n  Once those repetition patterns are matched, it is easy to figure out how many repetitions of said pattern were given by the user. We store this data alongside the rest of the fragment, to make sure that we expand said pattern a correct amount of times when transcribing.\n     we will have matched the repetition 3 times, and attributed a repetition amount of 3 to the  $e meta-variable.\n   Following the matching of these repetitions, we can recursively expand all tokens contained in the pattern.\n Considering once again the previous declaration and invocation, we can parse the following pattern as the one to expand:\n  This pattern is then recursively expanded as if it was a regular macro invocation. In order to make sure that each meta-variable gets expanded correctly, we only give a subset of the matched fragments to the new subsitution context.\n macro_rules! lit_plus_tok { ($($e:literal tok)*) =&gt; {}}lit_plus_tok!(&#34;rustc&#34; tok &#39;v&#39; tok 1.59 tok);// Original matched fragments: { &#34;lit&#34;: [&#34;rustc&#34;, &#39;v&#39;, 1.59] }// We then expand the repetition pattern once with { &#34;lit&#34;: [&#34;rustc&#34;] },// once with { &#34;lit&#34;: [&#39;v&#39;] },// and finally once with { &#34;lit&#34;: [1.59] },\n Once again, certain restrictions apply, which we have yet to implement: Some specifiers get expanded eagerly, while some stay under the form inputted by the user.\n  Likewise, not all repetition patterns are covered properly. Some issues remain to be ironed out for a complete and correct implementation.\n  In order to implement some specific behaviour, the rust standard library requires some macros to be built into the compiler. You can find a full list  here.\n gccrs should implement to allow for the compilation of the standard rust library, as both  core and  std depend on a multitude of them.\n These macros are defined as empty within the core library, and their transcriber is provided in the compiler as a simple function. We implement those builtins in  gccrs as functions returning fragments of abstract syntax trees, which are inserted during the macro-expansion phase and then lowered to an intermediate representation alongside the rest of the user’s code.\n We have a long list of macros ahead of us, some of which we should be able to implement easily. If you are interested in contributing, we have opened 3 good first issues regarding builtin macros with detailed guides on how to solve them.\n Thanks a lot to  bjorn3 for all the help regarding builtin macros and their implementation details.", "posttime": "2022-02-26 08:55:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,gcc,gt", "title": "GCC铁锈月报，2022年2月", "title_en": "GCC Rust Monthly Report, February 2022", "transed": 1, "url": "https://thephilbert.io/2022/02/25/gcc-rust-monthly-report-14-february-2022/", "via": "", "real_tags": ["rust", "gcc", "gt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1075138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《每日电讯报》透露，美国最大的芯片公司正在调查一次潜在的网络攻击，该攻击已使其部分业务离线两天。\n据了解，Nvidia的电子邮件系统和开发工具在被认为是恶意网络入侵后，在过去两天内一直遭受停机。\n这起疑似黑客攻击事件发生之际，俄罗斯正在对乌克兰发动网络战，并且对西方发动袭击以报复俄罗斯制裁克里姆林宫的行为的安全担忧加剧。没有证据表明英伟达与#39；这是冲突的中断。\n英伟达发言人表示：“我们正在调查一起事件。目前我们没有任何其他信息可供分享。”；\n一位内部人士称，此次入侵“完全破坏”了该公司的内部系统，尽管一些电子邮件服务在周五开始工作。目前尚不清楚是否有任何数据从英伟达或其客户处被盗或删除，或者攻击是否只是扰乱了其系统，客户表示他们没有收到任何事件的通知。\n总部位于硅谷的英伟达市值超过6000亿美元，是世界上最有价值的公司之一。\n它最著名的是图形处理单元，为视频游戏和高级计算机模拟提供动力。然而，这些芯片也是人工智能项目和机器人技术的核心，因此它们在国家安全方面的重要性日益增加。\n由于监管机构的审查，包括竞争与市场管理局（Competition and Markets Authority）对该交易的国家安全影响进行的调查，该公司最近放弃了以400亿美元（300亿英镑）收购英国微芯片公司Arm的计划。\n塞瑞大学网络安全专家Alan Woodward表示，如果该公司受到网络攻击的威胁，系统可能会被故意关闭，该网络攻击可能会进一步蔓延，例如将病毒嵌入到分发给消费者和企业的计算机软件中，或者渗透公司其他部门窃取知识产权。\n伍德沃德博士说：“最终的担忧是，可能有人在其中一个软件更新中添加了一些东西。”他指的是破坏性的SolarWinds黑客攻击，该攻击利用美国软件公司访问美国政府的计算机系统。\n“他们将努力确认是否有任何迹象表明他们的软件发生了任何变化，然后将其发送给客户。”\n随着俄罗斯对乌克兰发动一波攻击，各公司被敦促加强网络安全。专家警告称，这些攻击可能蔓延到其他国家。\n美国国土安全部长亚历杭德罗·马约卡斯（Alejandro Mayorkas）本周告诉各公司为潜在的袭击做好准备。他说：“我们没有信息表明美国本土受到了具体的、可信的网络威胁，但我们有责任做好准备。”。\n本周，西方宣布了一系列给克里姆林宫带来经济痛苦的措施，其中包括半导体技术。本月早些时候，白宫威胁说，如果俄罗斯入侵乌克兰，将切断其半导体供应。\n《每日电讯报》重视你的评论，但恳请所有帖子都是关于主题、建设性和尊重性的。请查看我们的评论政策。", "note_en": "America’s biggest microchip company is investigating a potential cyber attack that has taken parts of its business offline for two days, The Telegraph can reveal.\n Nvidia’s email systems and developer tools are understood to have been suffering from outages over the last two days, after what is believed to have been a malicious network intrusion.\n The suspected hack comes amid  Russian cyberwarfare against Ukraine and heightened security concerns about attacks on the West in retaliation for hitting the Kremlin with sanctions. There is no evidence linking Nvidia&#39;s outages to the conflict.\n An Nvidia spokesman said: “We are investigating an incident. We don’t have any additional information to share at this time.&#34;\n The intrusion was described by one insider as having “completely compromised” the company’s internal systems, although some email services were working on Friday. It is unclear if any data has been stolen or deleted from Nvidia or from its customers, or if the attack has merely disrupted its systems, and customers said they had not been informed of any incident.\n  Nvidia, based in Silicon Valley, is worth over $600bn, putting it among the world’s most valuable corporations.\n It is best known for graphics processing units, which power video games and advanced computer simulations. However, the chips are also central to artificial intelligence programs and robotics, making them of growing national security importance.\n The company  recently abandoned a $40bn (£30bn) takeover of British microchip company Arm amid scrutiny from regulators, including an investigation from the Competition and Markets Authority about the deal’s national security implications.\n Alan Woodward, a cyber security expert at the University of Surrey, said systems may have been deliberately shut down if the company had been hit by a cyber attack that risked spreading further, such as by embedding viruses in computer software distributed to consumers and businesses, or infiltrating other parts of the company to steal intellectual property.\n “The ultimate concern is that somebody may have put something in one of the software updates,” Dr Woodward said, pointing to the devastating SolarWinds hack that exploited American software companies to gain access to US government computer systems.\n “They’ll be going through trying to make sure to see if there&#39;s any indication that anything has been changed in their software that they then shipped to their clients.”\n Companies have been urged to boost their cybersecurity as Russia launches a wave of attacks against Ukraine, which experts have warned could spill over into other countries.\n Alejandro Mayorkas, the US secretary of homeland security, told companies this week to prepare for potential attacks. “We have no information to suggest a specific credible cyber threat against the US homeland, but it is our responsibility to be prepared,” he said.\n Semiconductor technology has been included in a package of Western measures to heap economic pain on the Kremlin announced this week. Earlier this month, the White House threatened to cut off Russia’s supply of semiconductors if it invaded Ukraine.\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2022-02-26 08:52:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,报道,reportedly", "title": "据报道，英伟达遭到网络攻击", "title_en": "Nvidia reportedly being hit by cyberattacks", "transed": 1, "url": "https://www.telegraph.co.uk/business/2022/02/25/us-microchip-powerhouse-nvidia-hit-cyber-attack/", "via": "", "real_tags": ["nvidia", "报道"]}]