[{"category": "", "categoryclass": "", "imagename": "1cb8a77171eed0080451a8b152d862a7.jpg", "infoid": 1030080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "截至2020年9月30日，Backblaze在我们的云存储生态系统中拥有153,727个旋转硬盘，分布在四个数据中心。其中，有2,780个引导驱动器和150,947个数据驱动器。此回顾着眼于我们数据中心当前运行的数据驱动器型号的2020年第3季度和整个生命周期的硬盘故障率，并在此过程中提供了一些见解和观察结果。我们一如既往地期待您的意见。\n在2020年第3季度末，Backblaze使用150,974个硬盘存储客户数据。在我们的评估中，我们从考虑范围中剔除了至少没有60个驱动器的驱动器型号(稍后将详细介绍)。因此，我们将审查150,757个硬盘。下表介绍了2020年第3季度发生的情况。\n本季度有几个型号的驱动器故障为零。这很好，但是当我们深入挖掘的时候，我们会得到每个驱动器不同的故事。\n18TB的希捷型号(ST18000NM000J)有300天的行驶天数，它们已经服役了大约12天。没有任何开箱即用的失败，这是一个很好的开始，但这就是你能说的全部。\n16TB的Seagate机型(ST16000NM001G)有5428天的行驶天数，虽然较低，但平均使用时间接近10个月。尽管如此，我还不会试图得出任何结论，但再有一两个季度这样的情况，我们可能会有话要说。\n东芝4TB机型(MD04ABA400V)只有9,108个驱动日，但他们已经连续七个季度设置了零。这肯定是有价值的。\n14TB Seagate型号(ST14000NM001G)有21,120个驱动器日和2,400个驱动器，但它们只运行了不到一个月。下个季度将给我们带来更好的前景。\n4TB HGST(型号：HMS5C4040ALE640)本季度有274,923个驱动器天数，没有任何故障。其他的一切都很棒，但在你跑出去买一件之前，先等一下。为什么？你可能不会买一台新的，如果你买了，它真的至少有三年了，因为HGST/WDC至少有那么长时间没有制造过这些驱动器了。如果HGST/WDC的人能在评论中为我们证实或否认这一点，那就太好了。有故事可以追溯到2016年，当时人们试图订购这个驱动器，结果得到了一个翻新的驱动器。如果你想试一试翻新的硬盘，那很好，但这不是我们的数据基础。\n2020年第三季度年化失败率(AFR)为0.89%，略高于上一季度的0.81%，但明显低于一年前的2.07%。即使驱动器故障率较低，我们的数据中心技术人员也不会感到无聊。在本季度，他们添加了近11,000个新驱动器，总存储容量超过150PB，所有这些都是在严格的新冠肺炎协议下运行的。我们将在未来的帖子中报道他们是如何做到这一点的，但我们只能说他们很忙。\n有190个驱动器(150,947减去150,757)没有包括在上面的2020年第3季度季度图表中，因为我们没有至少60个给定型号的驱动器。以下是一个细目：\n几乎所有这些驱动器都用作更换驱动器。当给定的驱动器型号不再可供购买时，就会发生这种情况，但我们有许多驱动器在运行，我们需要更换。例如，我们仍在使用三个WDC 6TB驱动器；它们安装在三个不同的Storage Pod中，另外还有来自Seagate和HGST的6TB驱动器。这些驱动器中的大多数在安装时都是新的，但有时我们会重复使用已从服务中移除的驱动器(通常是通过迁移)。当然，这些驱动器需要重新格式化、擦除，然后必须通过我们的鉴定过程才能重新安装。\n我们的清单上有两个“新”驱动器。这些驱动器有资格在我们的数据中心使用，但我们尚未批量部署。就10TB HGST驱动器而言，多个12TB型号的可用性和鉴定降低了我们使用更多此驱动器型号的可能性。随着我们为部署下一波大硬盘做好准备，16TB东芝硬盘型号更有可能在未来部署。\n当我们在2013年第一次开始收集硬盘数据时，一个大硬盘是4TB，5TB和6TB的硬盘刚刚上市。今天，我们将大驱动器定义为14 TB、16 TB和18 TB驱动器。下表总结了我们当前对这些驱动器的利用率。\n总数为19878个，占我们运营数据驱动器的13.2%。虽然这些驱动器大多是14TB的东芝硬盘，但上述所有驱动器都已通过在我们的数据中心使用的资格。\n对于除东芝14 TB驱动器之外的所有驱动器型号，驱动器天数仍然太少，无法得出任何结论，尽管到目前为止，Seagate 14 TB型号、东芝16 TB型号和Seagate 18 TB型号都没有出现故障。\n在接下来的几个季度里，我们将继续增加这些大型硬盘，并在此过程中对其进行跟踪。截至2020年第3季度，这组驱动器的寿命AFR为1.04%，正如我们将看到的，这低于运行中的所有驱动器型号的寿命AFR。\n下表显示了截至2020年9月30日我们已投入使用的硬盘型号的使用寿命AFR。在此时间范围内，列出的所有驱动器型号都在运行。截至2020年第三季度的终身AFR为1.58%，是我们自2013年开始跟踪以来的最低水平。这一数字低于一年前的1.73%，也低于上一季度的1.64%。\n我们将平均年龄列添加回“平均年龄”。这是以月为单位，是用于计算表中数据的驱动器的平均使用年限，并基于它们的运行时间。需要记住的一件事是，我们的环境非常动态，经常添加、迁移和离开驱动器，这可能会影响平均使用年限。例如，我们可以淘汰具有大部分较旧驱动器的存储舱，这可以降低该型号剩余驱动器的平均使用年限，而其余驱动器则会变得较旧。\n从平均使用年限来看，6TB的Seagate硬盘是最老的一组，平均每个硬盘的使用年限接近五年半。这些驱动器在过去的几年里实际上已经变得更好了，并且老化得很好，目前的寿命AFR为1.0%。\n如果您想了解更多信息，请与硬盘统计数据的作者Andy Klein一起参加10月20日的网络研讨会问答。\n用于创建本评审中使用的信息的完整数据集可在我们的硬盘测试数据网页上找到。您可以免费下载并使用此数据用于您自己的目的。我们所要求的只有三件事：1)如果您使用数据，则引用Backblaze作为来源；2)您接受您对如何使用数据负全部责任；3)您不会将此数据出售给任何人-它是免费的。\n如果您只想使用汇总数据来创建本文中的表格和图表，您可以下载包含MS Excel电子表格的ZIP文件。", "note_en": "As of September 30, 2020, Backblaze had 153,727 spinning hard drives in our cloud storage ecosystem spread across four data centers. Of that number, there were 2,780 boot drives and 150,947 data drives. This review looks at the Q3 2020 and lifetime hard drive failure rates of the data drive models currently in operation in our data centers and provides a handful of insights and observations along the way. As always, we look forward to your comments.\n  At the end of Q3 2020, Backblaze was using 150,974 hard drives to store customer data. For our evaluation we remove from consideration those drive models for which we did not have at least 60 drives (more on that later). This leaves us with 150,757 hard drives in our review. The table below covers what happened in Q3 2020.\n   There are several models with zero drive failures in the quarter. That’s great, but when we dig in a little we get different stories for each of the drives.\n The 18TB Seagate model (ST18000NM000J) has 300 drive days and they’ve been in service for about 12 days. There were no out of the box failures which is a good start, but that’s all you can say.\n The 16TB Seagate model (ST16000NM001G) has 5,428 drive days which is low, but they’ve been around for nearly 10 months on average. Still, I wouldn’t try to draw any conclusions yet, but a quarter or two more like this and we might have something to say.\n The 4TB Toshiba model (MD04ABA400V) has only 9,108 drive days, but they have been putting up zeros for seven quarters straight. That has to count for something.\n The 14TB Seagate model (ST14000NM001G) has 21,120 drive days with 2,400 drives, but they have only been operational for less than one month. Next quarter will give us a better picture.\n The 4TB HGST (model: HMS5C4040ALE640) has 274,923 drive days with no failures this quarter. Everything else is awesome, but hold on before you run out and buy one. Why? You’re probably not going to get a new one and if you do, it will really be at least three years old, as HGST/WDC hasn’t made these drives in at least that long. If someone from HGST/WDC can confirm or deny that for us in the comments that would be great. There are stories dating back to 2016 where folks tried to order this drive and got a refurbished drive instead. If you want to give a refurbished drive a try, that’s fine, but that’s not what our numbers are based on.\n The Q3 2020 annualized failure rate (AFR) of 0.89% is slightly higher than last quarter at 0.81%, but significantly lower than the 2.07% from a year ago. Even with the lower drive failure rates, our data center techs are not bored. In this quarter they added nearly 11,000 new drives totaling over 150PB of storage, all while operating under strict Covid-19 protocols. We’ll cover how they did that in a future post, but let’s just say they were busy.\n  There were 190 drives (150,947 minus 150,757) that were not included in the Q3 2020 Quarterly Chart above because we did not have at least 60 drives of a given model. Here’s a breakdown:\n  Nearly all of these drives were used as replacement drives. This happens when a given drive model is no longer available for purchase, but we have many in operation and we need a replacement. For example, we still have three WDC 6TB drives in use; they are installed in three different Storage Pods, along with 6TB drives from Seagate and HGST. Most of these drives were new when they were installed, but sometimes we reuse a drive that was removed from service, typically via a migration. Such drives are, of course, reformatted, wiped, and then must pass our qualification process to be reinstalled.\n There are two “new” drives on our list. These are drives that are qualified for use in our data centers, but we haven’t deployed in quantity yet. In the case of the 10TB HGST drive, the availability and qualification of multiple 12TB models has reduced the likelihood that we would use more of this drive model. The 16TB Toshiba drive model is more likely to be deployed going forward as we get ready to deploy the next wave of big drives.\n  When we first started collecting hard drive data back in 2013, a big drive was 4TB, with 5TB and 6TB drives just coming to market. Today, we’ll define big drives as 14TB, 16TB, and 18TB drives. The table below summarizes our current utilization of these drives.\n  The total of 19,878 represents 13.2% of our operational data drives. While most of these are the 14TB Toshiba drives, all of the above have been qualified for use in our data centers.\n For all of the drive models besides the Toshiba 14TB drive, the number of drive days is still too small to conclude anything, although the Seagate 14TB model, the Toshiba 16TB model, and the Seagate 18TB model have experienced no failures to date.\n We will continue to add these large drives over the coming quarters and track them along the way. As of Q3 2020, the lifetime AFR for this group of drives is 1.04%, which as we’ll see, is below the lifetime AFR for all of the drive models in operation.\n  The table below shows the lifetime AFR for the hard drive models we had in service as of September 30, 2020. All of the drive models listed were in operation during this timeframe. The lifetime AFR as of Q3 2020 was 1.58%, the lowest since we started keeping track in 2013. That is down from 1.73% one year ago, and down from 1.64% last quarter.\n  We added back the average age column as “Avg Age.” This is in months and is the average age of the drives used to compute the data in the table and is based on the amount of time they have been in operation. One thing to remember is that our environment is very dynamic with drives being added, being migrated, and leaving on a regular basis and this could impact the average age. For example, we could retire a Storage Pod with mostly older drives and that could lower the average age of the remaining drives of that model while those remaining drives got older.\n Looking at the average age, the 6TB Seagate drives are the oldest cohort, averaging nearly five and a half years of service each. These drives have actually gotten better over the last couple years and are aging well with a current lifetime AFR of 1.0%.\n If you’d like to learn more, join us for a  webinar Q&amp;A with the author of Hard Drive Stats, Andy Klein, on October 20 th.\n  The complete data set used to create the information used in this review is available on our  Hard Drive Test Data webpage. You can download and use this data for free for your own purpose. All we ask are three things: 1) You cite Backblaze as the source if you use the data, 2) You accept that you are solely responsible for how you use the data, and 3) You do not sell this data to anyone—it is free.\n If you just want the summarized data used to create the tables and charts in this blog post, you can  download the ZIP file containing the MS Excel spreadsheet.", "posttime": "2020-10-20 23:17:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬盘,2020,hard,驱动器", "title": "BackBlaze硬盘统计数据2020年第三季度", "title_en": "Backblaze Hard Drive Stats Q3 2020", "transed": 1, "url": "https://www.backblaze.com/blog/backblaze-hard-drive-stats-q3-2020/", "via": "", "real_tags": ["硬盘", "2020", "hard", "驱动器"]}, {"category": "", "categoryclass": "", "imagename": "236840f5f9ad80e7e32c6f67468594d3.jpg", "infoid": 1030078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大流行期间，我们中的许多人比以前更频繁地依赖货物送货上门。\n但幻影汽车(Phantom Auto)联合创始人埃利奥特·卡茨(Elliot Katz)表示，随着新冠肺炎很容易传播，散布在全球供应链上的仓库已经成为潜在的疾病传播中心。\n他建议，解决方案是减少在这些环境中工作的人数。以叉车操作员为例-有了远程控制技术，他们现在可以在异地工作，从远处控制他们的机器。\n卡茨表示：我们今天有一些客户，我们完全可以从偏远地区远程操作这些叉车。近几个月来，卡茨的公司为一系列新客户配备了这些系统。\n他补充称，幻影汽车(Phantom Auto)的技术目前已安装在美国和欧洲的十几个仓库中。\n一些人将远程操作这一概念视为传统驾驶车辆和未来真正自动驾驶车辆之间的垫脚石。但是，在几英里外驾驶一辆大卡车或叉车设备安全吗？这是否比有训练有素的司机或操作员在现场更经济呢？\n当谈到远程控制的车辆时，远程操作通常涉及为汽车或卡车配备摄像头和其他传感器，这些传感器可以将信息反馈给单独建筑中的远程操作员。\n多个监视器提供了广阔的视野，因此操作员可以看到车辆周围的情况。一般来说，驾驶控制是通过操纵杆或方向盘和地板上的踏板来实现的。\n卡茨表示，一些使用幻影汽车(Phantom Auto)技术的仓库将遥控叉车的工作空间用栅栏隔开，叉车还安装了麦克风，这样一旦出现故障，操作员就可以得到警告。\n卡茨表示，如果有人在叉车后面对我说，嘿，你要撞我了，操作员可以听到，就像他坐在叉车上一样。\n在远程操作领域工作的其他公司中，有美国初创公司Teleo。它专门改装建筑设备，这样它就可以远程驾驶。它刚刚开始在一家采石场对一位未透露姓名的客户进行审判。在这种情况下，Teleo改装了一辆大轮子的装载车，这样它就可以从现场的办公室进行控制。\n未来，司机可以坐在办公室里远程控制附近的各种车辆。这可能意味着整体上现场雇佣的人会更少，但Teleo认为，这使得司机的角色更安全。\n此外，Teleo联合创始人兼首席执行官维奈·谢特(Vinay Shet)断言，目前没有足够的重型车辆司机来满足建筑业的需求。\n他解释说：我们相信，通过将这样一份实际上危险的工作转变为办公室工作，我们应该能够吸引更多的人。\n一些人认为，出租车和拼车应该进行远程操作，这样司机就可以在需要的时候激活并远程驾驶车辆给客户，而不是仅仅希望有人会要求搭车，而不必在城市的特定区域开车。\n但是，像这样驾驶车辆的想法对一些人来说是有争议的。例如，恐怖分子总是有可能试图侵入这样的系统，并使用遥控汽车或卡车杀人。\n卡茨和谢特都表示，他们的公司已经考虑过这种情况，并补充说，他们的工程师已经引入了各种措施，使网络攻击变得更加困难。例如，通过对远程操作员和车辆之间的通信进行加密，需要司机的授权，以及在车辆无法获得可靠的通信信号时自动关闭车辆。\n然而，英戈尔施塔特应用科学大学的克里斯蒂安·法奇指出，没有人能保证这样的系统永远不会被黑客入侵。他和他的同事研究了遥控车辆的技术限制和安全风险。\n我们必须降低这种风险，他说，他指的是发生恐怖事件的可能性。他认为，公司应该尽可能地让这种情况发生，并补充说，管理遥控车辆安全的标准可能应该由公共机构制定，而不是由公司自己制定。\n然而，法基博士确实认为远程操纵的车辆可能比自动驾驶的车辆更有立竿见影的用处。\n这也是谢特先生的立场：我们可以今天交付产品，而不是10年或15年后。\n远程操作甚至可以加速全自动驾驶汽车的发展-美国军方也是这样希望的。美国陆军研究实验室的一个项目涉及使用人类遥控操作员训练轮式侦察机器人如何驾车穿越复杂的地形或拥抱建筑物的轮廓，以侦察敌方领土上的危险。\n我们希望能够在士兵…前面几公里处部署一个机器人。研究员玛吉·维格尼斯解释说，为了提供这些信息，我们可以在士兵进入地面之前发回情报。\n培训这些设备的工作人员就像驾驶一辆小型遥控汽车一样驾驶它们。威格尼斯博士说，如果你知道如何使用电子游戏控制器，你就可以拿起它。\n然后，基于这些人工控制实验的数据，人工智能系统逐渐学习如何驱动设备本身。到目前为止，该系统已经在包括北卡罗来纳州勒琼营地模拟城镇训练区在内的美军设施中进行了试验。\n在行人和通信干扰等风险因素可以得到更严格控制的特殊环境中，远程操作的车辆已经开始使用。但在公共道路上，这样的车辆面临着大量的挑战。\n法基博士说，首先，要保证广域内100%可靠的通信信号是相当困难的。如果在司机远程驾驶车辆转过一个繁忙的角落时信号中断，行人即将踏上附近的斑马线，会发生什么？\n法基博士说，在网络覆盖非常差的地区，这可能不是一个好主意。", "note_en": "During the pandemic, many of us have relied on having goods delivered to our homes more frequently than before.\n But as Covid-19 spreads easily, the warehouses dotted along the world&#39;s supply chains have become potential hubs of disease transmission, says Elliot Katz, co-founder of Phantom Auto.\n The solution, he suggests, is to reduce the number of people working in those environments. Take forklift operators, for instance - with remote-control technology they can now work off-site, controlling their machines from afar.\n &#34;We have customers today where we are fully remotely operating those forklifts from remote locations,&#34; says Mr Katz, whose firm has equipped a string of new clients with these systems in recent months.\n Phantom Auto&#39;s technology is now installed in around a dozen warehouses in the US and Europe, he adds.\n Some see this concept, teleoperation, as a stepping stone between traditionally driven vehicles and the truly autonomous ones of the future. But is it safe to drive a large truck or forklift device from miles away? And is it more economical than having a trained driver or operator on site?\n When it comes to remote-controlled vehicles, teleoperation generally involves kitting out a car or truck with cameras and other sensors that feed information to a remote operator in a separate building.\n  Multiple monitors provide a wide field of view so the operator can see what is around the vehicle. Generally, driving control is enabled by a joystick or steering wheel and pedals on the floor.\n Some of the warehouses using Phantom Auto&#39;s technology fence-off the space where the remote-controlled forklifts work, says Mr Katz and the forklifts are also fitted with microphones so the operator can be warned should something be about to go wrong.\n     &#34;If someone is behind that forklift and says, &#39;Hey, you&#39;re about to hit me,&#39; the operator can hear it just like he&#39;s sitting on the forklift,&#34; says Mr Katz.\n Among the other firms working in the teleoperation space is US start-up Teleo. It specialises in retrofitting construction equipment so it can be driven remotely. It has just started a trial at a quarry for an unnamed client. In this case, Teleo has adapted a large-wheeled loading vehicle so it can be controlled from an office on site.\n In the future, a driver could sit in the office and remotely control a variety of vehicles nearby. That might mean fewer people would be employed on-site overall but Teleo argues it makes the role safer for the driver.\n  Besides, there aren&#39;t enough heavy vehicle drivers to meet construction industry demand at the moment, asserts Teleo co-founder and chief executive Vinay Shet.\n &#34;We believe by converting an effectively hazardous job like this into an office job, we should be able to attract a wider pool of people,&#34; he explains.\n Some argue that taxis and rideshare vehicles ought to be teleoperated, that way drivers could activate and remotely steer vehicles to customers when needed, rather than having to drive around a particular area of a city just hoping that someone will request a ride.\n But the idea of vehicles driven like this is controversial for some. There&#39;s always the possibility a terrorist, for example, might try to hack such a system and use a teleoperated car or truck to kill people.\n  Mr Katz and Mr Shet both say their firms have thought about this scenario and add that their engineers have introduced various steps to make a cyber-attack harder. For example, by encrypting communications between teleoperator and vehicle, requiring authorisation of drivers and automatically shutting down vehicles should they lose access to a reliable communications signal.\n No-one can guarantee that such a system will never be hacked, though, points out Christian Facchi at the University of Applied Sciences, Ingolstadt. He and colleagues have studied the technical limitations and security risks of teleoperated vehicles.\n &#34;We have to reduce that risk,&#34; he says, referring to the prospect of a terrorist incident. Companies should make it as difficult as possible for this to happen, he argues, adding that standards governing the security of teleoperated vehicles should probably be set by a public body rather than firms themselves.\n However, Dr Facchi does think that teleoperated vehicles may prove more immediately useful than autonomous ones.\n This is also Mr Shet&#39;s position: &#34;We can deliver a product today, not 10 or 15 years in the future.&#34;\n  And teleoperation could even accelerate the development of fully autonomous vehicles - so hopes the US military. A project at the US Army Research Laboratory involves using human teleoperators to train a wheeled reconnaissance robot how to drive across tricky terrain or hug the outline of a building as it scouts for danger in enemy territory.\n &#34;We&#39;d like to be able to deploy a robot kilometres in front of the soldiers… to sort of provide that information, the intel we could send back before the soldiers have to enter that ground,&#34; explains researcher Maggie Wigness.\n Staff training the devices steer them just like they would a small remote-controlled car. &#34;If you know how to use a video game controller, you can pick it up,&#34; says Dr Wigness.\n An artificial intelligence system then gradually learns how to drive the device itself, based on data from these manually controlled experiments. So far, the system has been trialled at US Army facilities including the mock town training area at Camp Lejeune in North Carolina.\n In specialised environments where risk factors like pedestrians and communications interference can be more tightly controlled, remote-operated vehicles are already coming into use. But on public roads, such vehicles face plenty of challenges.\n For one thing, it&#39;s pretty difficult to guarantee a 100% reliable communications signal across a wide area, says Dr Facchi. What happens if the signal cuts out just as the driver is remotely steering the vehicle around a busy corner, with pedestrians about to step on to a zebra crossing nearby?\n &#34;In an area where you have very bad network coverage,&#34; says Dr Facchi, &#34;it might be a bad idea.&#34;", "posttime": "2020-10-20 23:16:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "办公桌,truck,车辆", "title": "从不离开办公桌的叉车司机", "title_en": "The forklift truck drivers who never leave their desks", "transed": 1, "url": "https://www.bbc.co.uk/news/business-54431056", "via": "", "real_tags": ["办公桌", "truck", "车辆"]}, {"category": "", "categoryclass": "", "imagename": "054bcefa0db861ef301f17a22b0359f4.png", "infoid": 1030077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数百名科学家和工程师在二十年的大部分时间里努力工作，才达到了这一点。现在，他们的客货车大小的宇宙飞船终于为它的重要时刻做好了准备，只要帝国大厦那么高，它就在一颗小行星附近盘旋。\n今天晚些时候，这场太空大戏将在距离地球3.33亿公里的地方上演。美国国家航空航天局(NASA)的OSIRIS-REX宇宙飞船将接近一颗名为本努(Bennu)的小行星，并延伸其取样臂。这条手臂末端的圆形头部实质上将与小行星相撞约5秒。\n在这一关键时刻，航天器将向本努表面喷射氮气，目的是将小行星表面的小颗粒--宽度不超过2厘米--送入一个类似于捕手手套的装置。\n那么，为NASA、大学和该任务的主承包商洛克希德·马丁公司(Lockheed Martin)从事这项任务的科学家和工程师们感觉如何呢？洛克希德·马丁太空公司(Lockheed Martin Space)的OSIRIS-REX任务运营项目经理贝丝·巴克(Beth Buck)说，她很兴奋，可能还有一点焦虑。\n周一，当被问及这次任务的微妙方式与2012年好奇号火星车登陆火星相比如何时，巴克说白色指节可能会更少。她说：我不认为这是七分钟的恐怖。这更像是四个半小时的轻微焦虑。\n2016年，OSIRIS-REX航天器乘坐阿特拉斯V号火箭向近地小行星本努发射。它花了大约两年的时间赶上小行星，然后开始初步调查，然后进入本努周围的稳定轨道。随着飞船越来越近，科学家们惊讶地发现，本努的表面并不像沙滩。", "note_en": "Hundreds of scientists and engineers have labored for the better part of two decades to reach this point. Now, their passenger-van-sized spacecraft is finally ready for its big moment, hovering near an asteroid about as long as the Empire State Building is tall.\n Later today, this space drama will play out 333 million kilometers from Earth. NASA&#39;s OSIRIS-REx spacecraft will approach an asteroid named Bennu and extend its sampling arm. The circular head at the end of this arm will essentially bump into the asteroid for about five seconds.\n During this critical juncture, the spacecraft will expel nitrogen gas onto the surface of Bennu, aiming to drive small particles on the asteroid&#39;s surface—with a width of 2cm or less—into a device akin to a catcher&#39;s mitt.\n So how are the scientists and engineers who worked on this mission for NASA, at universities, and at the mission&#39;s primary contractor, Lockheed Martin, feeling? Excited, and perhaps a little anxious, said Beth Buck, the OSIRIS-REx mission operations program manager for Lockheed Martin Space.\n  Asked on Monday how the mission&#39;s delicate approach compares to the landing of the Curiosity rover on Mars in 2012, Buck said there would probably be fewer white knuckles. &#34;I&#39;m not thinking of this as seven minutes of terror,&#34; she said. &#34;This is much more like four-and-a-half hours of mild anxiousness.&#34;\n The  OSIRIS-REx spacecraft launched toward the near-Earth asteroid Bennu on an Atlas V rocket in 2016. It spent about two years catching up to the asteroid and then began a preliminary survey before getting into a stable orbit around Bennu. As the spacecraft got closer, scientists were surprised to discover Bennu&#39;s surface was not like a sandy beach.", "posttime": "2020-10-20 23:01:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,nasa,美国国家航空航天局,big,小行星", "title": "今天是美国国家航空航天局(NASA)寻求清除小行星尘埃任务的重要日子", "title_en": "Today’s the big day for NASA’s mission that seeks to pluck asteroid dust", "transed": 1, "url": "https://arstechnica.com/science/2020/10/todays-the-big-day-for-nasas-mission-that-seeks-to-pluck-asteroid-dust/", "via": "", "real_tags": ["美国", "nasa", "美国国家航空航天局", "big", "小行星"]}, {"category": "", "categoryclass": "", "imagename": "1551a607c9b410b35f00701dddd1f4f4.jpg", "infoid": 1030076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国司法部今天对谷歌提起了一项具有里程碑意义的反垄断诉讼，指控该公司在搜索业务中存在反竞争和不公平地排挤竞争对手的行为。\n一家公司并不一定要是字面上的垄断，没有任何形式的可用竞争，才会违反反垄断法。相反，这项法律主要关注的是一家公司为获得主导地位所做的事情，以及一旦它登上榜首，它将如何利用这一主导地位。根据美国司法部的指控(PDF)，谷歌确实滥用了其超大的市场力量，使竞争环境向有利于自己的方向倾斜，并将潜在的竞争对手拒之门外。\n副司法部长杰弗里·罗森(Jeffrey Rosen)在与记者通话时表示，谷歌是通往互联网的门户。它通过有害于竞争的排他性做法来维持其权力。\n根据美国司法部的诉讼，谷歌在搜索领域的市场份额全面超过80%，在移动搜索市场的份额甚至更高。诉状称，谷歌在搜索领域的主导地位，以及它利用广告业务、搜索业务、Chrome浏览器和Android操作系统的方式，赋予了该公司看门人的地位，然后它又不公平地利用这种地位将竞争对手拒之门外。这起诉讼还对谷歌搜索预加载到Android手机上的方式提出了异议，所有设备制造商和分销商都是通过据称非法的排他性、连锁合同协议将谷歌搜索预加载到Android手机上的。2018年，欧盟因类似指控对谷歌处以超过50亿美元的罚款。\n美国司法部称，其结果是，谷歌提高了那些希望提供或扩大自己搜索服务的竞争者的进入门槛，从而大大损害了竞争。它的行动也让谷歌的服务雪上加霜：没有竞争就意味着没有巨大的竞争压力来改进自己的搜索或广告产品。", "note_en": "The Department of Justice today filed a landmark antitrust suit against Google, alleging that the company behaved anticompetitively and unfairly pushed out rivals in its search businesses.\n A company does not have to be a literal monopoly, with no available competition of any kind, to be in violation of antitrust law. The law is instead primarily concerned with what a company does to attain dominance and what it does with that dominant position once it&#39;s at the top. And according to the DOJ&#39;s complaint ( PDF), Google did indeed abuse its outsized market power to tilt the playing field in its favor and keep potential rivals out.\n &#34;Google is the gateway to the Internet,&#34; Deputy Attorney General Jeffrey Rosen said in a call with reporters. &#34;It has maintained its power through exclusionary practices that are harmful to competition.&#34;\n Google holds more than 80 percent of the market share in search across the board, with an even higher stake in the mobile search market, according to the DOJ suit. The company&#39;s dominance in search and the way it leverages its advertising business, its search business, the Chrome browser, and the Android operating system give the company gatekeeper status that it then uses unfairly to keep competitors out, the suit says. The suit also takes issue with the way Google Search is pre-loaded onto Android phones, from all device manufacturers and distributors, through an allegedly illegal tangle of exclusionary, interlocking contract agreements. The European Union fined Google  more than $5 billion in 2018 over similar allegations.\n As a result, the DOJ alleges, Google has &#34;substantially&#34; harmed competition by increasing barriers to entry for competitors who wish to offer or scale up their own search services. Its actions also had the effect of making Google&#39;s services worse: no competition means no &#34;significant competitive pressure to improve&#34; its own search or advertising products.", "posttime": "2020-10-20 23:00:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,rust,反垄断,long", "title": "司法部。提交期待已久的针对谷歌的反垄断诉讼", "title_en": "Justice Dept. files long-awaited antitrust suit against Google", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/justice-dept-files-long-awaited-antitrust-suit-against-google/", "via": "", "real_tags": ["谷歌", "google", "rust", "反垄断", "long"]}, {"category": "", "categoryclass": "", "imagename": "f2a1696fa9de57e061f05356a559ab77.jpg", "infoid": 1030075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我花了几个星期的时间在重新制作的北极星弹弓上。该公司刚刚推出了一款新版本，终于可以使用自动变速器。过去的版本仅限于标准变速器，从根本上将三轮车的市场限制在那些会开车的人身上。但现在，有了雪橇盒，弹弓就可以供大众使用了。\n弹弓是一次激动人心的旅行。它像摩托车吗？不太清楚。驾驶和乘坐弹弓类似于卡丁车或并排亚视。声音和感觉都很相似。它猛烈地移动，转到无限大，风总是吹在你的脸上。太棒了。\n让我们把这个去掉：弹弓速度不快。当然，就它的大小来说，它是快的，但它比看起来要慢。\n即使没有极快的速度，也可以有刺激。没有车门和车顶，弹弓提供了几辆车都能提供的驾驶体验。\n一旦热身，弹弓就急切地想取悦你。时速达到10K，红线在8500左右。踩碎踏板会让针头飞涨，后轮发出刺耳的刺耳声。你可以走了。\n弹弓似乎是为了在角落里滑行而设计的。由于动力只有一个后胎，弹弓很容易失去牵引力，允许戏剧性的滑行。\n惊险刺激的骑行弥补了原始速度的不足。通常平凡的驾驶被提升为迷你冒险。那是如果你让弹弓预热一点的话。\n她是一位冷酷的女士，一位叔叔经常宣称他八十年代初开的红色雪佛兰豪华定制皮卡。只要你给卡车一些热身的时间，这辆卡车就能拖走。弹弓也是如此。启动油门踏板后大量使用油门，你就会遇到像土路一样崎岖的轮班。\n我对新弹弓的第一印象不是很好。我把弹弓从半挂车上卸下来，跳进车里，把它踩在地板上。很长一秒后，当传输从第一转到第二时，我发现这不是一个好主意。我立刻想到弹弓的变速箱似乎是被某人用大锤换档控制的。\n在我的第一次驾驶中，我在到达最高档之前就得出结论，新的自动弹弓太糟糕了。我错了。Slingshot一旦温暖，就会有所改进，但仍然缺乏即使是最基本的自动汽车的换档精致。即使是在热身的时候，交通换班也是笨重而艰难的。当司机可以通过每个档位时，在开阔道路上的换挡会更好，但仍然很粗糙。\n变速箱的手感是我对弹弓的主要关注点。增加自动选项为新买家打开了大门，但买家必须明白，弹弓更像是一辆亚视，而不是一辆汽车。\n想要一辆精致的敞篷跑车吗？买一辆马自达MX-5。想要来一次惊险刺激的自由行吗？弹弓是个不错的选择。\n北极星在2014年推出了Slingshot，我很幸运地驾驶了全国首批之一。该版本由通用汽车(General Motors)四缸发动机提供动力，为小车架提供了充足的动力。这一次，北极星使用了自己的四缸，并将其与自动变速箱配对。\n这种新形式的弹弓仍然令人兴奋，但平淡无奇的变速箱抹去了它的一些潜力，并为电动弹弓提供了理由。\n如果汽车是由电动马达驱动的，我对自动弹弓的大部分犹豫就会烟消云散。\n首先，有了电动总成，车辆将抛弃平淡无奇的自动变速器，转而采用直接驱动系统。它仍然可以进入目标市场，但仍能获得更好的驾驶体验。有了电子系统，弹弓将更快地下线和绕过弯道。它将是快速的，同时仍然是令人兴奋的。\n第二，弹弓不会发出令人愉快的声音。肌肉车应该得到一张尾气纸条，以表达发动机的庄严。弹弓不是一款肌肉车，目前的排气笔记只能用类似于令人讨厌的卡丁车来形容。我在弹弓上花了很多时间在密歇根州玉米林立的偏僻小路上巡航。太阳照在我脸上时，我能闻到新鲜玉米的味道。我和任何假人一样喜欢响亮的排气管，但当我开车穿过那些偏僻的小路时，我希望弹弓不会产生这样的噪音。电动总成将改善开顶式机器的体验。\n最后，电动总成将使弹弓的速度达到应有的速度。如上所述，弹弓并没有看起来那么快。快的?。好的。但它并不快，电动总成可以解决这个缺点，在开始时提供更多的扭矩，使其达到弹弓应有的速度。\n当然，北极星可能不会听从我的电气化建议。我怀疑Slingshot能否在保持3万美元价格不变的情况下实现电动。男孩仍然可以做梦。\n弹弓很有趣，而且乐趣是有代价的。最终，破旧的自动变速器限制了弹弓的吸引力。即使在最好的情况下，轮班也是粗暴和令人不快的，对乘用车来说也达不到标准。亚视爱好者可能可以忍受轮班；其他所有人都应该交叉购买弹弓，比如马自达MX-5，甚至是二手宝马Z3。或者，更好的是，学习终身技能，学习驾驶手柄变速箱，然后购买标准变速箱的弹弓。\n在弹弓上增加一个电动总成将大大改善车辆。它可能会更快，更享受驾驶，因为流畅的直接驾驶感觉将取代硬换档。", "note_en": "I spent several weeks in the reworked  Polaris   Slingshot. The company just unveiled a new version that is finally available with an automatic transmission. Past versions were limited to a standard transmission, radically limiting the 3-wheeler’s market to those who can drive a stick. But now, with a slushbox, the Slingshot is ready for the masses.\n    The Slingshot is a thrilling ride. Is it like a motorcycle? Not really. Driving and riding in the Slingshot is akin to a go-kart or side-by-side ATV. The noises and feels are similar. It shifts hard, revs to infinity, and the wind is always in your face. It’s a blast.\n Let’s get this out of the way: The Slingshot is not fast. Sure, it’s quick for its size, but it’s slower than it looks.\n Thrills can be had even without breakneck speed. Without doors or a top, the Slingshot offers a driving experience offered in few vehicles.\n Once warmed up, the Slingshot is eager to please. The tach goes to 10k and redlines around 8,500. Mashing the go-pedal sends the needle soaring and the rear tire screeching. And off you go.\n The Slingshot was seemingly designed to power slide through corners. With the power going only to the single rear tire, the Slingshot easily loses traction, allowing for dramatic slide slides.\n The thrilling ride makes up for the lack of raw speed. What are normally mundane drives are elevated to mini adventures. That is if you let the Slingshot warm up a bit.\n She’s a cold-hearted lady, an uncle used to proclaim about his early eighties red Chevy Custom Deluxe pickup. This truck hauled as long as you gave the truck some time to warm up. The same thing is true with the Slingshot. Mass the gas pedal after just starting it up, and you’ll be greeted with shifts as rough as a dirt road.\n My first impression of the new Slingshot was not a good one. I unloaded the Slingshot from the delivery semi, hopped in, and floored it. A long second later, as the transmission shifted from first to second, I discovered this was a bad idea. I immediately thought the Slingshot’s transmission is seemingly controlled by someone changing gears with a sledgehammer.\n During my first drive, I concluded the new automatic Slingshot to be terrible before reaching the top gear. I was wrong. Once warm, the Slingshot improves but still lacks the shifting refinement of even the most basic automatic car. Even when warmed up, shifts in traffic are clunky and hard. When the driver can power through each gear, shifts on the open road are better but still rough.\n The transmission feel is my main concern with the Slingshot. Adding an automatic option opens the door to new buyers, but buyers must understand that the Slingshot is more ATV than a car.\n Want a refined open-top roadster? Get a Mazda MX-5. Want a thrilling open ride? The Slingshot is a great option.\n Polaris introduced the Slingshot in 2014, and I was lucky enough to drive one of the first in the country. That version was powered by a General Motors four-cylinder engine that provided ample power for the small frame. This time around, Polaris used its own four cylinder and mated it with an automatic gearbox.\n The Slingshot in this new form is still thrilling, but the lackluster gearbox erases some of its potential and makes a case for an electric Slingshot.\n Much of my hesitation about the automatic Slingshot would be erased if an electric motor powered the vehicle.\n One, with an electric powertrain, the vehicle would dump the lackluster automatic transmission in favor of a direct drive system. It would still be accessible to the target market and yet gain a better driving experience. With the electric system, the Slingshot would be quicker off the line and around corners. It would be fast while still thrilling.\n Two, the Slingshot doesn’t make a pleasant noise. Muscle cars deserve an exhaust note that expresses the gravitas of the motor. The Slingshot is not a muscle car, and the current exhaust note can only be described as being similar to an obnoxious go-kart. I spent much of my time in the Slingshot cruising through Michigan’s corn-lined back roads. I could smell the fresh corn while the sun beat down on my face. I love a loud exhaust as much as any dummy, but as I was driving through those backroads, I wished the Slingshot didn’t produce such a racket. An electric powertrain would improve the experience of the open-top machine.\n And finally, an electric powertrain would make the Slingshot as fast as it deserves. As stated above, the Slingshot is not as fast as it looks. Quick? Sure. But it’s not fast, and an electric powertrain would address this shortcoming by offering more torque at the start giving it the speed the Slingshot deserves.\n Of course, Polaris probably will not heed my electrification advice. I doubt it’s possible to make the Slingshot electric and maintain the same $30,000 price. A boy can still dream.\n The Slingshot is a lot of fun, and the fun comes at a cost. In the end, with the crummy automatic transmission limits the appeal of the Slingshot. Even in the best circumstances, shifts are rough and off-putting and not up to par for passenger vehicles. ATV enthusiasts can probably live with the shifts; everyone else should cross-shop the Slingshot with something like a Mazda MX-5, or even a used BMW Z3. Or, better yet, learn a life-long skill and learn to drive a stick shift, and buy the Slingshot with the standard transmission.\n Adding an electric powertrain to the Slingshot would considerably improve the vehicle. It would likely be faster and more enjoyable to drive since a smooth, direct-drive sensation would replace the hard shifts.", "posttime": "2020-10-20 22:56:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,乞求,slingshot,弹弓", "title": "\n北极星弹弓R是一个三轮袖珍火箭，乞求通电", "title_en": "\n\t\t\t\tThe Polaris Slingshot R is a 3-wheel pocket rocket begging for electrification\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/the-polaris-slingshot-is-a-3-wheel-pocket-rocket-begging-for-electrification/", "via": "", "real_tags": ["火箭", "乞求", "slingshot", "弹弓"]}, {"category": "", "categoryclass": "", "imagename": "a32a0d7dc57b293b5e7c3dcb10aa5521.png", "infoid": 1030074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "连接当地年轻妈妈(PumpSpotting，花生)、专业人士(Fish Bowl，午餐俱乐部)、Jetset约会对象(Raya，Bumble)、数字游牧民族(Homeis)、当地人(Nextdoor)和千禧一代(Friends)的应用程序都在拨号上网。\n随着政府关闭他们的“第二张专辑”，英国的千禧一代和Z世代越来越多地转向基于位置的应用程序，试图和对方一起出去玩，并打破了所谓的“六条规则”泡沫，无论政府是否希望他们这样做。\n由于这个原因，泡菜在大约35万千禧一代和Z世代中迅速声名鹊起。在最初是一款面向Z世代的TaskRabit式应用程序之后，它现在将增长视为这一代人在当地寻找同行者的一款应用程序，尽管他们的正常旅行已经被新冠肺炎减少了。\n创始人Daneh Westropp说：“孤独是当今年轻人的头号恐惧--排在失去房子或工作之前。71%的千禧一代报告感到孤独(由信诺进行的调查)，69%的千禧一代在无法参加家人或朋友要参加的活动(由Eventbrite进行研究)时体验到了FOMO。因此，人们真的不喜欢独自做某些活动也就不足为奇了。“。她说，这就是为什么Pickle在应用商店的排名不断攀升的原因。\n韦斯特罗普理解疏远的感觉。1988年伊朗/伊拉克战争期间，她与母亲和妹妹逃离德黑兰，由一位孤独和抑郁的单身母亲抚养长大。15岁辍学后，她继续加入了其他企业家的行列。\n但Pickle应用程序仍然存在一些问题，令人担忧。对于初学者来说，它没有2FA。此外，缺乏监管或内容过滤意味着任何人都无法猜测用户可能安排会见的是谁。对于普通的观察者来说，这些都是很大的危险信号。\n在一场关闭了他们生活的全球大流行期间，Z世代是否在乎，还有待观察。", "note_en": "Apps that connect young mums locally ( Pumpspotting,  Peanut), professionals ( Fishbowl,  Lunchclub), Jetset daters ( Raya, Bumble), digital nomads ( Homeis), locals (Nextdoor ) and millennials ( Friended) are all being dialed-up.\n And with government lockdowns coming back for their “2nd album” the UK’s millennials and Gen-Zs are increasingly turning to location-based apps to try and hang out with each other and burst the so-called ‘rule of six’ bubble, whether the government wants them to or not.\n  Pickle is fast making a name for itself amongst an estimated 350,000 millennials and Gen-Zs for that reason. After starting out as a  taskrabbit-style app for Gen-Z, it is now seeing growth as an app for that generation to find fellow travelers locally, even as their normal travel has been curtailed by COVID-19.\n  Founder  Daneh Westropp says: “Loneliness is the number one fear of young people today – ranking ahead of losing a home or a job. 71% of millennials reported feeling lonely [survey conducted by Cigna] and 69% of millennials experience FOMO when they can’t attend something that their family or friends are going to [study by Eventbrite]. So it comes as no surprise that people genuinely hate doing certain activities alone.” That’s why, she says, Pickle is climbing up app-store rankings.\n Westropp understands the feeling of alienation. She ran away from Tehran during the 1988 Iran/Iraq war with her mother and sister, and was raised by a single mother who suffered from loneliness and depression. After dropping out of school at the age of 15 she went on to join the ranks of other entrepreneurs.\n But a few problems remain with the  Pickle   app that are cause for concern. It has no 2FA for starters. Plus, the lack of regulation or content filtering means it’s anyone’s guess who users might be arranging to meet. Those are big red flags for the average observer.\n Whether Gen-Z cares or not during a global pandemic that has shut down their lives, remains to be seen.", "posttime": "2020-10-20 22:55:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,app,应用程序", "title": "\n随着千禧一代/Z世代使用定位应用来对抗Covid的封锁，Pickle应用程序对用户起到了推波助澜的作用", "title_en": "\n\t\t\t\tPickle app puts on users, as millennials/Gen-Z latch onto location apps to fight Covid lockdowns\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/pickle-app-puts-on-users-as-millennials-gen-z-latch-onto-location-apps-to-fight-covid-lockdowns/", "via": "", "real_tags": ["程序", "app", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "af44126bb89861b43d3580dca015257c.jpg", "infoid": 1030073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不同寻常的风险投资团队拥有横跨消费者和企业领域的投资，包括罗宾汉(Robinhood)、AppDynamics、MuleSoft、Winnie等。这份简短的名单可能会成为一次引人入胜的聊天的基础，但我也想听听他们对风险投资民主化的看法，他们在选举前的胃口，以及远程工作的未来。我的一个大目标是压制我们在科技推特上听到的一些流行语，这样我们就可以诚实地了解一家风险投资公司在混乱的一年里所处的位置。\n正如我们上周所写的那样，对于风投和科技界来说，今年的一切都与往常不同。我们还有一场选举在等着我们！我会请Leary和Vrionis分享他们在总统选举等迫在眉睫的事件中工作的框架，并了解他们对早期阶段如何更广泛地发挥作用的想法。\n感谢所有加入我们正在进行的实时聊天系列节目的各位，这一系列节目带来了悉尼·赛克斯、亚历克西娅·冯·托贝尔、马克·库班等科技界的大牌人物(所有录音仍可供额外的Crunch订户观看和学习)。\n如果你是新来的，欢迎光临！只要您是EC成员，您就可以向我们的专家现场提问(在这里注册额外的嘎吱声)。\n来吧，带点零食，准备一些好问题。我们很乐意邀请你。", "note_en": "The  Unusual Ventures   team has investments spanning the consumer and enterprise space, including Robinhood, AppDynamics, Mulesoft, Winnie and more. That short list could be the basis for a fascinating chat, but I also want to hear their thoughts on the democratization of venture capital, their appetite ahead of the election and the future of remote work. A big goal of mine is to squash some of the buzzwords we hear on tech Twitter so we can get an honest take on where one VC firm is sitting right now in a chaotic year.\n As we wrote last week, this year has been everything but business as usual for the venture and tech community. And we still have an election ahead of us! I’ll ask Leary and Vrionis to share their framework for working through a looming event such as a presidential election and get their ideas on how early-stage is working more broadly.\n Thanks to all of you who have joined us for our ongoing live chat series, which has brought on big names in tech such as  Sydney Sykes,  Alexia von Tobel,  Mark Cuban, and more (all recordings are still accessible for Extra Crunch subscribers to watch and learn from).\n If you’re new, welcome! You’ll be able to ask our experts questions live as long as you’re an EC member ( sign up for Extra Crunch here).\n Come hang, bring snacks and prep some good questions. We’d love to have you.", "posttime": "2020-10-20 22:55:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,风险投资,ventures", "title": "\n不同寻常的风险投资公司的萨拉·利里和约翰·弗里奥尼斯今天下午2点将参加Extra Crunch Live。美国东部时间/上午11点。PT", "title_en": "\n\t\t\t\tUnusual Ventures’ Sarah Leary and John Vrionis join Extra Crunch Live today at 2 p.m. ET/11 a.m. PT\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/unusual-ventures-sarah-leary-and-john-vrionis-join-extra-crunch-live-today-at-2-p-m-et-11-a-m-pt/", "via": "", "real_tags": ["美国", "风险投资", "ventures"]}, {"category": "", "categoryclass": "", "imagename": "1251466d33c0c3d69df61c8683090292.jpg", "infoid": 1030072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数字身份保护初创公司4iQ今天宣布了一轮3000万美元的融资，将用于增加对其上市活动的投资。这笔资金是在4iQ聘请前Waterline数据主管凯拉什·安布瓦尼(Kailash Ambwani)担任首席执行官之际进行的。\n据福布斯报道，2005年至2014年间，发生了300多起涉及10万条或更多记录被盗的数据泄露事件。仅在2019年前六个月，数据泄露就暴露了41亿条记录。截至2019年，世界经济论坛(World Economic Forum)认为网络攻击是全球稳定的最大风险之一。\n总部位于加利福尼亚州洛斯阿尔托斯的4iQ由阿尔贝托·戈麦斯(Alberto Gomez)和胡里奥·卡萨尔(Julio Casal)于2016年创立，寻求通过一个从公共网站、社交媒体和黑暗网络收集身份信息的平台来领导这一反击行动。4iQ声称已经管理和标准化了超过450亿条记录，总共超过1万亿个属性，目标是欺诈、洗钱、反恐融资、内部威胁、网络犯罪、身份盗窃和账户接管。该公司现在已经超过100个客户，拥有超过2500万用户。\n4iQ的IDHunt平台使调查人员能够实时分析绰号或化名以及其他与身份相关的属性。借助4iQ的数据库，IDHunt能够关联和丰富Pastebin文档、历史DomainWhis数据、加密货币地址和集群、社交档案、标准搜索引擎、反向IP查找和其他数据源的搜索结果。IDHunt提供有关威胁参与者的上下文，揭示他们的队列、关联和犯罪团伙。与此同时，该平台的机器学习算法可以计算恶意身份和域分数，并“在几秒钟内”构建关系图。\nIdsteft是对4iQ的IDHunt工具的补充，使客户能够通过API评估风险并监控人们的暴露情况。这些API利用身份数据库，检索暴露的身份和风险分值，为密码管理员、帐户接管预防、业务风险评估和消费者身份保护提供商提供支持。4iQ表示，所有入侵都要经过一个验证过程，在这个过程中，分析师和专家使用研究和调查方法来确保域数据和其他信息是真实和有效的。一旦确认了漏洞，4iQ平台就会根据属性类型、日期和密码强度等变量计算风险分数。\nAmbwani说：“4iQ揭露网络罪犯真实身份的独特方法对于组织了解是否有任何信息被泄露、他们的员工攻击表面等等至关重要。”我们的创新工具允许公司监控身份和信息风险，最终可以帮助更好地保护组织及其人员。我对我们公司的发展方向感到兴奋，并期待在第四季度分享其他重大公告。“。\nForgePoint资本公司领导了今天宣布的C系列活动，Benhamou全球风险投资公司、C5资本公司和阿达拉风险投资公司参与其中。这使得该公司在2018年12月进行了1800万美元的B系列融资后，融资总额超过了6300万美元。\n根据Global Market Insight的数据，全球网络安全市场的竞争比以往任何时候都激烈，这个市场很快就会超过3000亿美元。事实上，Atlas VPN发现，最近成立的网络安全初创公司在2020年筹集了超过3100万美元。竞争对手包括IntSights和TrapX Security，IntSights在2019年11月为其云托管的网络威胁检测和补救解决方案筹集了3000万美元，TrapX Security最近筹集了1800万美元，用诱饵资产挫败了网络攻击。更不用说总部位于旧金山的ZecOps，去年11月，ZecOps凭借其自动检测、分析和响应针对终端和服务器的网络攻击的技术堆栈和Trinity Cyber获得了1020万美元的收入，Trinity Cyber的威胁打击套件将检测与“对手推断”相结合。另一个竞争者Lacework在2019年9月获得了4200万美元，以保护云环境免受数据泄露的影响。", "note_en": "Digital identity protection startup  4iQ today announced a $30 million round it will use to ramp up investments in its go-to-market activities. The funding comes as 4iQ brings former Waterline Data head Kailash Ambwani on as CEO.\n Over 300 data breaches involving the theft of 100,000 or more records occurred between 2005 and 2014, Forbes  reports. Data breaches exposed 4.1 billion records in the first six months of 2019 alone. As of 2019, the World Economic Forum considers cyberattacks among the top risks to global stability.\n  Los Altos, California-based 4iQ, which was founded in 2016 by Alberto Gomez and Julio Casal, seeks to lead the countereffort with a platform that collects identity information from public websites, social media, and the dark web. 4iQ claims to have curated and normalized over 45 billion records with more than a trillion attributes in total, targeting fraud, money laundering, counterterrorist financing, insider threats, cybercrime, identity theft, and account takeover. The company has now surpassed 100 customers with over 25 million users.\n 4iQ’s IDHunt platform enables investigators to analyze monikers or pseudonyms and other identity-related attributes in real time. Drawing on 4iQ’s database, IDHunt is able to correlate and enrich findings with Pastebin documents, historical DomainWhoIs data, cryptocurrency addresses and clusters, social profiles, standard search engines, reverse IP lookups, and other data sources. IDHunt provides context around threat actors, revealing their cohorts, associations, and criminal rings. The platform’s machine learning algorithms, meanwhile, calculate malicious identity and domain scores and build relationship graphs “in seconds.”\n IDTheft complements 4iQ’s IDHunt tool and enables clients to assess risk and monitor people for exposure through APIs. These APIs tap into the identity database, retrieving exposed identity and risk scores that power password managers, account takeover prevention, business risk assessments, and consumer identity protection providers. 4iQ says all breaches undergo a verification process in which analysts and experts use research and investigation methods to ensure the domain data and other information is real and valid. Once a breach is verified, the 4iQ platform calculates a risk score based on variables such as attribute types, dates, and password strength.\n “4iQ’s unique approach to unmasking cybercriminals’ real-world identities is pivotal for organizations to understand if any information is compromised, their employee attack surface, and so much more,” Ambwani said. “Our innovative tools, which allow companies to monitor identity and information risks, can ultimately help to better protect organizations and their people. I’m excited for the direction of our company and look forward to sharing other major announcements in Q4.”\n ForgePoint Capital led the series C announced today, with participation from Benhamou Global Ventures, C5 Capital, and Adara Ventures. This brings the company’s total raised to over $63 million, following an $18 million series B in December 2018.\n Competition is fiercer than ever in a global cybersecurity market that will soon pass $300 billion,  according to Global Market Insights. Indeed, Atlas VPN  found that recently launched cybersecurity startups raised more than $31 million in 2020. Rivals include  IntSights, which in November 2019 raised $30 million for its cloud-hosted cyberthreat detection and remediation solution, and  TrapX Security, which recently raked in $18 million to thwart cyberattacks with decoy assets. That’s not to mention San Francisco-based  ZecOps, which last November nabbed $10.2 million for its tech stack that automates detection, analysis, and response to cyberattacks on endpoints and servers and  Trinity Cyber, whose threat-combating suite combines detection with “adversary inference.” Another contender,  Lacework, nabbed $42 million in September 2019 to protect cloud environments from data breaches.", "posttime": "2020-10-20 22:54:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,交易,总额,led,身份", "title": "4iQ利用人工智能来解决被盗数字身份的交易，在ForgePoint Capital的带领下筹集了3000万美元的C系列资金，使其筹资总额达到6300万美元以上", "title_en": "4iQ, which uses AI to tackle the trade in stolen digital identities, raises $30M Series C led by ForgePoint Capital, bringing its total raised to $63M+", "transed": 1, "url": "https://venturebeat.com/2020/10/20/4iq-raises-30-million-for-ai-that-identifies-compromised-digital-identities/", "via": "", "real_tags": ["人工智能", "交易", "总额", "led", "身份"]}, {"category": "", "categoryclass": "", "imagename": "396ffa611b6b3b16df2ebc6d872d5c6a.jpg", "infoid": 1030071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Adobe每年都会举办一次MAX年会，今年的活动首次对所有人免费，因为它是虚拟举行的，而不是面对面的。在MAX，Adobe正在为Creative Cloud引入新功能，更新可用于Photoshop、Illustrator、Lightroom等。\n由Adobe Sensei提供支持的Photoshop中有一个新的神经过滤器选项。Adobe表示，神经滤镜标志着Photoshop内部滤镜和图像处理的重新想象的开始，Adobe包括许多新的神经滤镜，这些滤镜正在以测试版的容量提供。\n神经过滤器是一种非破坏性过滤器，可以在短短几秒内创造性地转换图像。Adobe表示，神经过滤器可以提取Photoshop擅长的许多功能，并通过机器学习将它们提炼成一次点击或几个滑块。\nAdobe的神经过滤器包括用于照片润饰的皮肤平滑和用于改变人的年龄、表情、头发、姿势等的智能肖像。有一个超级缩放滤镜，可以去除小图像中的JPEG伪像，还有一个工具，可以在点击时给黑白图像上色，还有一个深度感知滤镜，可以模拟背景中的体积雾霾，以便更好地突出显示对象。\nAdobe还推出了Sky Replace，这是一个只需点击几下就能将天空与前景分开的选项，允许Photoshop用户插入替代图像。Adobe将引入25个预设，但自定义天空也是一种选择。\n有新的对象感知、优化边缘和优化头发工具，它们使用人工智能来改进对难以完全捕获的主题的选择。优化头发为人寻找并自动增强头发选择，而对象感知优化模式旨在帮助用户更快地做出更好的选择。有一个新的发现面板，它提供了一些工具和提示，旨在帮助那些刚接触Photoshop的人更快地工作，而对于那些更有经验的人，还有基于你的工作的人工智能建议，可以帮助加快结果。\nAdobe正在添加一个新的图案预览模式，用于预览您在对象上创建的图案，一个用于在实时形状中创建三角形的新工具，一个预设搜索选项，离线云文档访问，以及在属性面板中用于将智能对象重置为其原始状态的选项。\n对于插件，Adobe正在使用新的插件市场通过Creative Cloud桌面应用程序更容易地发现和管理它们。\nAdobe首次将Illustrator带到ipad上，在‌ipad‌上创建的项目可以编辑并传输到mac上，反之亦然。有很多有用的触摸聚焦恐惧，比如径向、网格和镜像重复，还有超过18,000种字体可供使用。\n在桌面上，Illustrator获得了一个新的重新着色插图选项，这意味着用户只需点击一下就可以改变颜色主题。Illustrator已重新设计为处理文字，这将在将文字插入到Work中时带来更高的精确度，并且有一个新的字形对齐功能，可根据文本中的字体特征推荐和对齐到对象。\n新的文本对齐功能允许在框架内垂直对齐文本，并且现在可以直接对齐文本，而不是文本框架。Illustrator文档可以扩展100倍以获得更多工作空间，并且可以选择跨文档和项目复制、合并和保存画板。\nLightroom正在通过对所有Lightroom应用程序的中间调进行颜色控制来获得高级颜色分级，以及在编辑期间保存不同文件版本的选项。对于Lightroom Classic，Adobe增强了性能，因此速度比以前更快。\n摄影师可以在他们的照片上添加图形水印，添加徽标图章，并且有一个新的最佳照片功能，它使用人工智能来建议相册中基于摄影原理的经过精心策划的图像子集。\nAdobe正在将其数字绘图和绘画应用Fresco带到iPhone上，这样它就可以在iPhone和iPad上使用。Fresco for‌Iphone‌具有与‌iPad‌相同的功能和触控体验，并且所有的Fresco项目都可以跨设备同步。还有一套新的涂抹笔刷，用于软化和混合边缘，以及新的丝带笔刷。对于‌ipad‌，有一个选项可以改变苹果铅笔对压力变化的反应方式，可以在Fresco的应用程序设置部分进行设置。\nPremiere Pro-Premiere Pro正在获得性能改进和Sensei支持的语音转文本功能的预览版，该功能可以从视频内容生成字幕、字幕和语音转录。\nAfter Effects-有一个新的Roto 2画笔，它能够通过帧选择和跟踪对象框，使隔离对象变得更容易，另外还有一个新的3D设计空间，使在3D中导航和设计变得更容易。\nXD-XD有一个新的3D转换功能，可以让设计师为用户界面设计带来深度和视角。\nPremiere Rush-Premiere Rush通过与Splice的合作获得了新的图形和音频资产，以及免版税的音频。\nAero-Adobe Aero现在有一个公开测试版，可以让Adobe用户创建增强现实体验。\n创意云-‌iPad‌上的PhotoShop和Illustrator有了新的应用内学习体验，应用内直播正在扩展到‌iPad‌上的PhotoShop和Illustrator，Lightroom的学习和发现功能也得到了增强。\nAdobe为Adobe Max计划了6小时的现场内容，许多名人演讲者，包括Zendaya、Conan O&#39；Brien、Awkwafina、切尔西·汉德勒和Gwyneth Paltrow等，可以在Adobe的网站上获得更多信息。\nAdobe的所有公告今天都可供订阅Creative Cloud的用户使用。\n虽然iPhone12 Pro要到周五才会发布，但我们现在已经有了Twitter账号DuanRui提供的这款设备的早期拆箱视频，让我们更近距离地了解了闪亮的新平边设计和光滑的Graphite颜色选项。\r本·盖斯金将拆箱视频重新上传到YouTube上，我们在下面嵌入了这段视频：\r盖斯金还上传了一段蓝色的iPhone12拆箱视频：\r..。\nTF国际证券(TF International Securities)分析师郭明志(音译)今天上午发布了一份研究报告，详细介绍了他对iPhone12和iPhone12Pro在销售第一个周末的预订量的看法。\r郭台铭此前曾表示，苹果对新款iPhone的预估出货量分配使iPhone12位居榜首，库存分配比例从15%至20%上升至40%至45%。然而.。\n苹果新的MagSafe充电器和保护套已经开始比预期的更早到达一些客户手中，配件的图片已经开始出现在Twitter上。这些照片让我们第一次看到了现实世界中使用的产品。\r在撰写本文时，一些MagSafe手提箱也可以在美国、加拿大和德国等国的精选苹果店提货。\r菲利普。\n虽然在技术规格中没有详细说明，但MacRumors可以证实，苹果新款HomePod mini的特点是一根不可拆卸的电源线，末端是USB-C接口，与包装盒中包含的20W电源适配器一起使用。\r随着切换到USB-C，HomePod mini可能会由更广泛的设备和外围设备供电，从MacBook到USB-C电池组，都有足够的...。\n三星在其社交频道上嘲笑苹果从iPhone 12阵容和其他iPhone机型中移除电源适配器，并指出三星Galaxy智能手机仍在出货时配备电源适配器。\r您的Galaxy随附的&#34；在三星Facebook上的一篇帖子中显示了电源适配器的图片。\r值得注意的是，苹果不再提供电源适配器或..。\n谷歌在其搜索应用程序中增加了一项新功能，可以让你哼唱一首萦绕在你脑海中的歌曲，然后使用该公司的机器学习算法来尝试识别这首歌。\r在谷歌应用程序中或使用谷歌搜索小工具，点击麦克风图标，然后说出这首歌是什么？或单击搜索一首歌按钮。然后开始哼唱10-15秒。当你做完的时候，那...。\n由于体积较小，苹果的迷你iPhone在iPhone 12系列的所有iPhone中电池续航时间最短，但苹果没有提供有关电池容量的公开信息。然而，巴西的一份监管申报文件显示，iPhone12迷你手机的电池容量为2227mAh。\r同样的监管信息显示，iPhone12采用了2815mAh的电池，这是...。\n苹果公司今天通过其网站和苹果商店应用程序开放了6.1英寸型号的iPhone 12和iPhone 12 Pro的预购，预计在美国的部分配置的交货时间已经推迟到11月。\r例如，订购免SIM卡/太平洋蓝/128 GB版本的iPhone12 Pro的客户，已经面临着估计的交货窗口...。\n除了新的iPhone12机型，苹果还推出了MagSafe充电器，它使用嵌入充电器和iPhone中的磁铁连接到iPhone的背面。它允许更快的充电速度，并为未来的无端口iPhone铺平了道路。MagSafe充电器正在发货，现在苹果的一些零售店也有，我们买了一个来看看。\r订阅……。\n苹果公司今天在印度推出了一项新的排灯节促销活动，届时该公司将为客户提供一套AirPods，让他们购买任何iPhone11机型。新的iPhone12机型不是促销活动的一部分。\r苹果提供免费购买的标准AirPods充电盒，但消费者可以选择升级到AirPods无线充电盒或AirPods Pro。", "note_en": "Adobe holds an annual MAX conference each year, and this year&#39;s event is  free for everyone for the first time because it is being held virtually rather than in person. At MAX, Adobe is introducing new features for Creative Cloud, with updates available for Photoshop, Illustrator, Lightroom, and more.\n  There&#39;s a new Neural Filters option in Photoshop, which is powered by Adobe Sensei. Adobe says Neural Filters mark the beginning of a re-imagination of filters and image manipulation inside Photoshop, with Adobe including many new Neural Filters that are being provided in a beta capacity.\n Neural Filters are non-destructive filters that creatively transform images in just a few seconds. Adobe says that Neural Filters take &#34;many things Photoshop does well&#34; and distills them into one click or a couple of sliders through machine learning.\n Adobe&#39;s Neural Filters include Skin Smoothing for photo retouching and Smart Portrait for transforming a person&#39;s age, expression, hair, pose, and more. There&#39;s a Super Zoom filter for removing JPEG artifacts from small images, a tool for colorizing a black and white image in a click, and a Depth-Aware filter for simulating volumetric haze in the background to better highlight a subject.\n Adobe is also introducing Sky Replacement, which is an option that separates the sky from the foreground with just a few clicks, allowing Photoshop users to insert in an alternative image. Adobe is introducing 25 presets, but custom skies are also an option.\n There are new Object Aware Refine Edge and Refine Hair tools that use AI to improve selections for subjects that can be difficult to capture in their entirety. Refine Hair looks for people and automatically enhances hair selection, while Object Aware Refine Mode is meant to help users make better selections more quickly. There&#39;s a new Discover panel that offers up tools and tips that are designed to help those who are new to Photoshop work faster, and for those who are more experienced, there are AI recommendations based on your work that can help speed up results.\n Adobe is adding a new Pattern Preview mode for previewing patterns you&#39;ve created on objects, a new tool for creating triangles in Live Shapes, a preset search option, offline cloud document access, and an option in the Properties Panel for resetting a Smart Object to its original state.\n For plugins, Adobe is making it easier to discover and manage them through the Creative Cloud desktop app using the new plugins marketplace.\n  Adobe is bringing Illustrator to the  iPad for the first time, and projects created on ‌iPad‌ can be edited and transferred to the Mac and vice versa. There are useful touch-focused fearures like radial, grid, and mirror repeat, along with over 18,000 fonts to use.\n On the desktop, Illustrator is gaining a new Recolor Artwork option that&#39;s meant to let users change color themes with just a click. Illustrator has been redesigned to handle type, which will bring more precision when inserting type into work, and there&#39;s a new Glyph Snapping feature that recommends and snaps to objects based on letterform characteristics in text.\n A new Text Align feature allows text to be aligned vertically within a frame, and alignments can now be made directly to text rather than the text frame. Illustrator documents are able to be expanded by 100x for more workspace, and there&#39;s an option to copy, merge, and save artboards across documents and projects.\n  Lightroom is getting Advanced Color Grading with color control for midtones across all Lightroom apps, as well as an option to save different file versions during editing. For Lightroom Classic, Adobe has enhanced performance so it&#39;s quicker than before.\n Photographers can add graphical watermarking to their photos, adding a logo stamp, and there&#39;s a new &#34;Best  Photos&#34; feature that uses AI to suggest a curated subset of images in an album that&#39;s based on photographic principles.\n   Adobe is bringing Fresco, its digital drawing and painting app, to the  iPhone so that it can be used on iPhones as well as iPads. Fresco for ‌iPhone‌ has the same functionality that&#39;s available on ‌iPad‌ with a touch-forward experience, and all Fresco projects are able to sync across devices.   There&#39;s also a new set of Smudge brushes for softening and blending edges, along with new ribbon brushes. For the ‌iPad‌, there&#39;s an option to change how the  Apple Pencil responds to changes in pressure, with the setting available in the App Settings section of Fresco.\n  Premiere Pro - Premiere Pro is getting performance improvements and a preview version of a Sensei-powered Speech to Text feature that can generate captions, subtitles, and speech transcription from video content.\n After Effects - There&#39;s a new Roto 2 brush that&#39;s able to select and track an object frame bu frame to make it easier to isolate the subject, plus there&#39;s a new 3D design space that makes it easier to navigate and design in 3D.\n XD - XD has a new 3D transforms feature that lets designers bring depth and perspective to user interface designs.\n Premiere Rush - Premiere Rush is getting new graphic and audio assets, plus royalty-free audio through a partnership with Splice.\n Aero - There&#39;s a public beta for Adobe Aero that&#39;s available now, which lets Adobe users create augmented reality experiences.\n Creative Cloud - There are new in-app learning experiences for Photoshop and Illustrator on ‌iPad‌, in-app livestreaming is expanding to Photoshop and Illustrator on ‌iPad‌, and Lightroom&#39;s Learn and Discover feature has been enhanced.\n Adobe has six hours of live content planned for Adobe MAX, with many celebrity speakers, including Zendaya, Conan O&#39;Brien, Awkwafina, Chelsea Handler, and Gwyneth Paltrow, among others, with more information  available on Adobe&#39;s website.\n All of Adobe&#39;s announcements are available today for those who have a Creative Cloud subscription.\n  While the iPhone 12 Pro does not launch until Friday, we now have an early unboxing video of the device courtesy of Twitter account DuanRui, providing a closer look at the shiny new flat-edge design and sleek Graphite color option.\rBen Geskin re-uploaded the unboxing video to YouTube, which we&#39;ve embedded below:\rGeskin has also uploaded an unboxing video of the iPhone 12 in Blue:\r...\n TF International Securities analyst Ming-Chi Kuo released a research note this morning detailing what he&#39;s seen with the volume of iPhone 12 and iPhone 12 Pro pre-orders in the first weekend of sales.\rKuo had previously indicated that Apple&#39;s estimated shipment allocations for the new iPhone models placed the iPhone 12 at the top with 40-45% of inventory allocation (up from 15-20%). However, ...\n Apple&#39;s new MagSafe charger and cases have begun arriving to some customers earlier than expected, and images of the accessories have started to surface on Twitter. The photos provide a first look at the products in real-world use.\rAs of writing, some MagSafe cases are also available for pickup at select Apple Stores in countries like the United States, Canada, and Germany.\rFilip...\n While not detailed in the tech specs, MacRumors can confirm that Apple&#39;s new HomePod mini features a non-detachable power cable that ends with a USB-C connector for use with the 20W power adapter included in the box.\rWith the switch to USB-C, the HomePod mini could potentially be powered by a wider range of devices and peripherals, ranging from MacBooks to USB-C battery packs with enough...\n Samsung on its social channels is mocking Apple for removing the power adapter from the iPhone 12 lineup and other iPhone models, pointing out the fact that the Samsung Galaxy smartphones continue to ship with a power adapter.\r&#34;Included with your Galaxy,&#34; reads a Samsung Facebook post that features a picture of a power adapter.\rApple notably is no longer providing power adapters or...\n Google has added a new feature to its Search app that allows you to hum a song that&#39;s stuck in your head, and then use the company&#39;s machine learning algorithm to try and identify it.\rIn the Google app or using the Google Search widget, tap the mic icon and say &#34;what&#39;s this song?&#34; or click the &#34;Search a song&#34; button. Then start humming the tune for 10-15 seconds. When you&#39;re done, the...\n Apple&#39;s iPhone mini has the shortest battery life out of all the iPhones in the iPhone 12 lineup due to its small size, but Apple has not provided public information about the battery&#39;s capacity. A regulatory filing from Brazil, however, suggests the iPhone 12 mini has a battery capacity of 2,227mAh.\rThe same regulatory information says the iPhone 12 features a 2,815mAh battery, which is...\n Apple today opened pre-orders for the 6.1-inch models of the iPhone 12 and iPhone 12 Pro through its website and the Apple Store app, and estimated delivery times are already slipping into November for select configurations in the United States.\rCustomers ordering a SIM-free/Pacific Blue/128GB version of the iPhone 12 Pro, for example, are already facing an estimated delivery window of...\n Alongside the new iPhone 12 models, Apple introduced a MagSafe charger that attaches to the back of the iPhones using magnets embedded both in the charger and in the iPhone. It allows for speedier charging and paves the way for a portless iPhone in the future. MagSafe chargers are shipping out and are in some Apple retail locations now, and we picked one up to check it out.\rSubscribe to the ...\n Apple today launched a new Diwali promotion in India that will see the company providing customers with a set of AirPods with the purchase of any iPhone 11 model. The new iPhone 12 models are not part of the promotion.\rApple is offering the standard AirPods With Charging Case free with purchase, but customers can choose to upgrade to the AirPods with Wireless Charging Case or the AirPods Pro....", "posttime": "2020-10-20 22:54:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "adobe,photoshop,iphone,过滤器,coming", "title": "Adobe首次对Creative Cloud进行了改进，Photoshop中的神经过滤器、iPad上的Illustrator、iPhone上的Adobe Fresco等等", "title_en": "Adobe debuts improvements to Creative Cloud, with Neural Filters in Photoshop, Illustrator coming to iPad, Adobe Fresco coming to iPhone, and more", "transed": 1, "url": "https://www.macrumors.com/2020/10/20/adobe-max-2020-creative-cloud-updates/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["adobe", "photoshop", "iphone", "过滤器", "coming"]}, {"category": "", "categoryclass": "", "imagename": "c40716e51603636341006e1e1df256f7.png", "infoid": 1030070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我在新冠肺炎时代的在线会议--荒岛DevOps夏季送行上的一份松散的讲稿。它有一个非常特别的地方，那就是整个会议都是通过动物穿越视频游戏进行的，设置相当有趣。\n这是本赛季最后一次这样的会议，我被邀请去演讲，几乎没有什么要求。我决定将我考虑了近一年的一场演讲压缩成一个版本，并安排了至少一次面对面的会议，这场会议在4月份被取消/报道，并在工作中完成了长达一小时的内部会议。最后的结果是一个简短的30分钟，涉及到各种话题，其中一些是借用了我之前的演讲和博客帖子。\n如果我真的想这样做，我可能会在每一两张幻灯片中写一篇更短的博客帖子，但我决定追求覆盖面，而不是深度。这里什么都没有。\n因此，今天我想谈谈作为软件开发人员和工程师，我们编写代码和部署东西的趋势，这种趋势最终会给我们带来巨大的痛苦，而这种痛苦是我们没有计划到的。\n在软件中，一个令人愉快的惊喜是不编译一次就写了一个小时，然后它就可以工作了；一个令人讨厌的惊喜是似乎可以工作的软件，6个月后你会发现它毒害了你的生活。\n这场演讲将是一场高水平的活动，我想警告你们，我将首先讨论一些哲学问题，然后再进行人类因素和认知科学方面的研究，并将其与广泛的建议联系起来，我认为这些建议在系统思考和设计东西时可能对每个人都有用。其中很多内容可能感觉有点过时，但我希望到最后它会对您有所帮助。\n这才是我们要开始研究的真正有哲理的东西。伊万·伊里奇是个狂野的哲学家，他讨厌现代医学和义务教育之类的东西。他写了一篇名为“权力与公平”的文章(我是通过读斯蒂芬·克雷尔的一篇演讲而被介绍到这篇文章的)，在这篇文章中，他决定也不喜欢各种机动化交通工具。\n伊万·伊利奇斯引入了压迫性垄断的概念；如果我们看看那些以步行和骑自行车为目的的社会，你通常可以使用任何交通工具，并有效地设法在那里生活和发展。无论你是住在帐篷里还是住在豪宅里，你都可以四处走动。\n他指出，骑自行车天生就是公平的，因为它不需要超过作为操作基线所需的能量：如果你能走路，你就可以骑自行车，而骑自行车的能量与步行相同，效率高得令人难以置信。汽车没有这一点；它们相当昂贵，而且与普通人相比，需要的能源数量不成比例。\n他的建议是，所有非货运交通工具，无论是汽车还是公交车和火车，都应该被限制在比骑自行车的人的平均速度高出固定百分比的水平，这是基于正常人体自身能够产生的能量。他建议我们这样做是为了防止..。\n我们很容易把汽车想象成减轻现有负担的方式：它创造了自由，拓宽了我们接触货物和人员的途径。这是一匹更好的马，也是一辆不那么消耗体力的自行车。因此，社会将发展到在其基础设施中拥抱汽车。\n现在，每个人的工作不再是让商家把商品送到城镇广场，送牛奶的人把牛奶放在门廊上，把市场缩小到离他们方便的地方更近的地方，而是每个人都开着车去买这些东西，而商店则去土地便宜的地方，而不是人多的地方。当社会在考虑到汽车的情况下发展时，你现在需要一辆汽车才能发挥作用。\n简而言之，参与社会的成本上升了，这就是压迫性垄断。\n对我来说，伊里奇所做的关键是将问题扭转为另一种方式：如果大多数人拥有汽车，会对社会产生什么影响，对我们其他人又会产生什么影响？\n我现在想问的问题是，我们在软件世界中是否有类似的东西。有哪些事情我们认为可以提高我们做事的能力，但最终却让我们付出了更多的代价来参与其中呢？我们认为这些事情会提高我们的做事能力，但最终却会让我们付出更多的代价才能参与其中？\n我们可以通过我们使用用户可能拥有的所有带宽的能力来认识到这一点；如今，试图使用旧的拨号连接是完全不可行的。但是我们的认知成本也是一样的吗？工具，文档，程序？\n我对这些都没有明确的答案，但这是我在设计工具和软件时经常问自己的一个问题。\n关键的一点是，我们选择使用的软件和实践不仅仅是我们在真空中做的事情，而是生态系统的一部分；无论我们向其中添加什么，都会以我们无法控制的方式改变和改变预期，并再次影响我们。软件不是被我们困住了，我们是被软件困住了。\n难道我们最终不会因此而使我们的生活变得更糟吗？我想把重点放在这一点上，在这一点上，我们作为开发人员，让自己的生活变得更糟。当我们编写或采用软件来帮助自己，但最终却在这个过程中伤害了自己，因为这说明了我们自己的可持续性。\n在这里，我不只是哲学上的，我想让现实世界中的事情产生实际的效果。因为这是研究人员已经研究过的东西。自动化的讽刺之处是认知研究(Bainbridge，1983)的一部分，该研究调查了人们自动执行任务的情况，发现其效果并不像预期的那么好。\n主要是注意力与实践的冲突。这些年来有很多这样的例子，但让我们来看看现代的自动驾驶汽车。\n自动驾驶汽车是笨拙的自动化的绝佳案例。汽车行业中最老牌的参与者正在做的是车道跟踪、盲点检测和处理平行停车。\n但高科技公司(特斯拉、Waymo、优步)正在努力实现全自动驾驶，特斯拉的自动驾驶仪是向公众发布的最雄心勃勃的一款。但所有这些现在都是按照班布里奇在1983年完全预测的方式运作的：\n司机不再积极参与，而是转变为监视角色\n尽管司机不再驾驶汽车，但他必须充分意识到汽车正在做的每一件事。\n当汽车处于一种奇怪的情况时，预计司机会再次控制。\n因此，汽车可以处理所有简单的情况，但所有困难的情况都留给了司机。\n这样做的部分风险是双重的：人们对他们没有参与的任务的注意力有限--如果你不积极驾驶它，你将很难长时间专心；如果你只在最糟糕的情况下很少开车，你可能会缺乏应对最糟糕情况的练习。\n这样的自动化是在航空公司完成的，否则他们会在模拟器时间内弥补这一点，并且仍然手动处理计划中的困难区域，如起飞和降落。尽管如此，一系列航空公司事件发现，这种交接往往很复杂，进展不顺利。\n显然，当我们忽略人的部分及其在事物中的责任时，我们可能会使软件变得比原来更糟糕。\n一般说来，这些错误大多来自以下观点。这被称为Fitts&34；模型，也称为&#34；Haba-Maba&34；，因为&#34；人更擅长，机器更擅长&#34；(最初的版本称为Maba-Maba，使用的是人而不是人)。这个模型把人类描绘成能够判断的缓慢的、敏锐的生物，而机器是快速的、无法辨别的、永不疲倦的东西。\n即使在今天，我们也经常听到这样的话。礼貌地说，这些都是自动化设计的初学者方法。它基于过时的科学概念，直观但错误的情绪，令人欣慰的是，它让你认为只有预测的结果才会发生，而完全忽略了任何紧急行为。它是根据我们认为我们现在看到的东西运作的，而不是基于更强有力的基本原则，而且当它在实践中应用时，往往有很强的局限性。\n它与人机交互的现实脱节，当选择不是人与机器交互时，它会将选择框定为二元选择，目的通常是在你不应该的时候把人赶出方程式。简而言之，这是自动化具有讽刺意味的背后的一个重要因素。\n这里是一个由认知专家建立的补丁版本。相反，他们将人机关系重新构建为联合认知系统，这意味着，我们不应将人类和机器视为必须在不同环境中用于特定任务的无关事物，而应将人类和计算机视为共同工作的团队伙伴。简而言之，这就将话语从一个人如何局限于一个人如何补充另一个人的角度转移到了另一个人身上。\n团队成员会做一些事情，比如相互预测，分享上下文和语言，能够注意到自己的行为可能会影响他人并做出相应的调整，沟通以建立共同点，并对每个人的个人和共同目标有一个想法，以便能够适当地帮助他人或确定优先顺序。\n当然，我们必须承认，作为当今最先进的队友，我们离计算机还很遥远。由于目前的计算机需要我们一直重新调整它们，我们必须承认，系统不仅仅是代码和计算机，它还包括代码、计算机以及所有与它们和彼此交互的人。如果我们想要我们的软件帮助我们，我们需要能够帮助它，并且帮助它，这意味着软件需要知道它会充满局限性，并让我们努力使其更容易诊断问题，形成和改进心理模型。\n所以问题是：是什么造就了一个好的模式？我们怎样才能帮助人们使用我们创造的东西呢？\n注：这张幻灯片和下一张幻灯片摘自我关于可操作软件的演讲。\n这是一张英国伦敦市的地图。它不是伦敦城，只是它的代表。它非常准确：它有街道的名称、交通方向、建筑物名称、河流、火车站、地铁站、人行桥、码头、公园，给出了关于规模、距离等的详细信息。但它不是伦敦市本身：它不会显示交通或道路施工情况，也不会显示生活在那里的人，也不会告诉你哪里有好的餐厅。这是一个有限的型号，而且可能是过时的。\n但是，即使它真的很有限，它也是非常详细的。细节足够详细，几乎每个人都不能把它全部装进自己的脑子里。大多数人会对它的某些部分有一些详细的了解，比如图像中放大的方块，但几乎没有人会只知道所有维度的全部内容。\n简而言之，您系统中的几乎每个人都只是从部分、不完整、经常不准确和过时的数据开始工作，而这些数据本身只是系统中发生的事情的抽象表示。事实上，我们使用的可能更类似于以下内容：\n这更像是一件事。这仍然不是伦敦市，但这张伦敦旅游地图更接近我们的工作。看看你的架构图(如果你有的话)，它们很可能看起来更像这张地图，而不是非常详细的伦敦地图。这张地图有游客想看的大多数东西：重要的建筑，到达那里的主要动脉，以及一些建议如何导航的路径。这张地图没有清晰的比例尺，我很肯定在伯罗路上的两个巨人不适合大本钟。还有很多未定义的领域，但您可能会用其他资源来补充它们。\n但这没关系，因为心理模型和它们的预测能力一样好；如果它们能让你正确地做出决定或完成一项任务，它们就是有用的。我们的头脑有点聪明，因为他们只会根据需要建立复杂的模型。如果我是一个在主要景点之间寻找路线的游客，这张地图可能比另一张要有用得多。\n关于这一点有一句有趣的话：一些东西只有在它被打破后才会存在。从主观上讲，你可以完全满足于长时间运行一个系统，而不知道它的所有方面。当它们开始崩溃，或者你对系统的预测不再起作用时，你就不得不回去重新调整你的心理模型。由于这些都是非常主观的，所以每个人都有不同的模式。\n对于什么是好的模式，这是一个模糊的答案，后续的问题是我们如何创建和维护它们？\n在所有技术组件之外，一个简单的步骤是挑战和帮助彼此，以同步和建立更好的心理模型。我们不能轻易地将我们自己的模型相互转换，事实上，控制它们几乎是不可能的。我们能做的就是挑战他们，确保他们没有被太多侵蚀，并尝试一些事情来确保他们仍然是准确的，因为事情会随着时间的推移而变化。\n因此，在一家公司中，我们可能做的事情包括培训、文档记录、事件调查，所有这些都有助于向每个人展示我们系统的各个方面和更改。游戏日和混沌工程学也是发现我们的模型在受控环境下可能被破坏的极好方法。\n它们绝对是我们应该做和关心的事情，特别是在组织层面。这就是说，我想更多地关注我们作为个人可以做的技术工作。\n我们不能仅仅打开一块所谓的玻璃窗，就能一下子看到所有的东西。那是太多的噪音，太多的信息，太少的结构。只有知道要过滤和过滤掉什么的人才能看到一切。你不可能一下子就形成一个事事的心理模型。为了辅助模型的形成，我们应该构造可观测性来讲述故事。\n您使用的大多数易于操作的应用程序和组件都不会向您公开它们的内部结构，它们的主要目的是提供对您与它们交互的可见性。用户正在做的事情与它在系统中或对系统产生的影响之间必须存在联系，您将希望建立这种联系。这意味着：\n记录在您想要调试的下面的层，这样可以节省时间以及需要在代码库中插入多少可观察性探测。我们倾向于将一切都停留在应用程序层面，但这是被误导的。\n这意味着给定端点周围的日志必须是关于用户与该端点的交互的，并且不需要了解其实现细节。\n对于开发人员日志，您可以通过将一条日志语句插入框架内端点下方的一层来使其由所有控制器共享，而不必为每个端点插入一条日志语句。\n这些互动将让人们在脑海中描绘出应该发生的事情，并更容易发现期望被打破的地方。通过分层视图，您可以根据预期被打破的层和它们拥有的知识在各层之间跳过。\n在某一层不能轻易观察到的地方，人们必须通过其上下各层的推论来处理。它成了一种障碍。\n通常，我们只能在最高级别(应用程序)或最低级别(操作系统)保持可观察性，两者之间几乎没有什么有用的东西。我们有一个黑盒三明治，我们只能看到某些部分，这可能是我们选择的工具的结果。您将希望实际选择运行时、语言和框架，以及允许您讲述可观察性故事并对其进行适当分层的基础设施。\n帮助模型形成的另一件事是保持人与机器之间的关系顺畅。这是一种信任关系，提供被认为具有误导性或无益的信息会削弱这种信任。有几件事你可以用日志来做，它们可以帮助你不会毁了你与电脑的婚姻。\n主要是记录事实，而不是解释。您通常无法从单个日志行中获得所有上下文，只是其中的一小部分。如果你开始试图提供帮助，并向人们提供建议，你就会把收集事实的探险转变为谋杀-神秘的调查，在这种调查中，系统的一些部分不能被信任，或者你不得不在字里行间胡思乱想。那是没有用的。显示TLS验证错误：SEC_ERROR_UNKNOWN_ISSUER的日志行比显示错误：无论您有多少经验都被黑客攻击的日志行要好得多。\n结构化日志记录对此有帮助，它比常规文本更好。它使人们更容易使用脚本或程序来解析、聚合、路由和转换日志。它使您不需要全文搜索来找出发生了什么。如果您确实想提供人类可读的文本或解释，请将其添加到结构化日志记录中的字段中。\n还有一件事叫做必备变化法则，它说只有复杂性才能控制复杂性。如果一个代理人不能代表它试图控制的事物周围的所有可能的状态和情况，那么它就不能控制所有的事情。想一想一架飞机的飞行稳定器；它们只能进行有限的调整，而且通常比我们人类的调整速度更快。不幸的是，一旦它的行动和所能感知的事物达到一定的极限，它就不能正常工作了。\n这就是控制要么无效，要么转嫁给下一个最好的东西的时候。就我们运行和运营的软件而言，那就是我们，我们是第二好的。在这里，我们陷入了一种古老的想法，即如果你尽可能聪明地写东西，你就有麻烦了，因为你需要加倍聪明才能调试它。\n这是因为要调试一个在自动化下行为不正常的系统，您需要了解系统，然后了解自动化，然后了解自动化对系统的看法，然后采取行动。\n这总是有些问题，但本质上，脆弱的自动化迫使你比没有自动化的情况下知道更多，以便让事情在困难时期工作。然后，情况可能会变得比一开始没有自动化的情况更糟糕。\n当您开始创建解决方案时，要意识到它可能会变得脆弱，需要将控制权交给人。关注自动化出现故障的路径以及交接将如何进行。你将如何传达这一点，以及操作员将不得不采取哪些线索或行动来接管事情？\n当我们接受并假设自动化将达到其极限，而它所做的事情就是向人类寻求帮助时，我们就转向了自动化。让这条可切换的路径更容易工作。让它变得友好，并使人类有可能了解自动化在给定时间点的状态，这样您就可以弄清楚它在做什么，以及如何解决它。使引导自动化做正确的事情成为可能。\n一旦您找到了解决方案的方法，您就可以逐步实现自动化，扩展解决方案，并与这些需求保持一致。它是糟糕经历的后盾，类似于让代码崩溃，所以做好它是关键。\n我认为另一件有趣的事情是路缘切割效应。路缘切割效应是从60年代开始的各种关于无障碍的美国法律中被注意到的。这个想法是为了让坐轮椅的人可以进入人行道和街道，你可以削减。\n.", "note_en": "This is a loose transcript of my talk at  Deserted Island DevOps Summer Send-Off, an online conference in COVID-19 times. One really special thing about it is that the whole conference takes place over the  Animal Crossing video game, with quite  an interesting setup.\n It was the last such session of the season, and I was invited to present with few demands. I decided to make a compressed version of a talk I had been mulling over for close to a year, and had lined up for at least one in-person conference that got cancelled/reported in April and had given in its fill hour-long length internally at work. The final result is a condensed 30 minutes that touches all kinds of topics, some of which have been borrowed from previous talks and blog posts of mine.\n If I really wanted to, I could probably make one shorter blog post out of every one or two slides in there, but I decided to go for coverage rather than depth. Here goes nothing.\n  So today I wanted to give a talk on this tendency we have as software developers and engineers to write code and deploy things that end up being a huge pain to live with, to an extent we hadn&#39;t planned for.\n In software, a pleasant surprise is writing for an hour without compiling once and then it works; a nasty surprise is software that seems to work and after 6 months you find out it poisoned your life.\n This presentation is going to be a high level thing, and I want to warn you that I&#39;m going to go through some philosophical concerns at first, follow that up with research that has taken place in human factors and cognitive science, and tie that up with broad advice that I think could be useful to everyone when it comes to system thinking and designing things. A lot of this may feel a bit out there, but I hope that by the end it&#39;ll feel useful to you\n  This is the really philosophical stuff we&#39;re starting with. Ivan Illich was a wild ass philosopher who hated things like modern medicine and mandatory education. He wrote this essay called &#34;Power and Equity&#34; (to which I was introduced by reading  a Stephen Krell presentation), where he decides to also dislike all sorts of motorized transportation.\n Ivan Illiches introduces the concept of an &#34;oppressive&#34; monopoly; if we look at societies that developed for foot traffic and cycling, you can generally use any means of transportation whatsoever and effectively manage to live and thrive there. Whether you live in a tent or a mansion, you can get around the same.\n He pointed out that cycling was innately fair because it does not require more energy than what is required as a baseline to operate: if you can walk, you can cycle, and cycling, for the same energy as walking, is incredibly more efficient. Cars don&#39;t have that; they are rather expensive, and require disproportionate amounts of energy compared to what a basic person has.\n His suggestion was that all non-freight transport, whether cars or busses and trains, be capped to a fixed percentage above the average speed of a cyclist, which is based on the power a normal human body can produce on its own. He suggested we do this to prevent...\n   We easily conceived cars as ways to make existing burdens easier: it created freedoms, widened our access to goods and people. It was a better horse, and a less exhausting bicycle. And so society would develop to embrace cars in its infrastructure.\n Rather than having a merchant bring goods to the town square, the milkman drop milk on the porch, and markets smaller and distributed closer to where they&#39;d be convenient, it is now everyone&#39;s job to drive for each of these things while stores go to where land is cheap rather than where people are. And when society develops with a car in mind, you now need a car to be functional.\n In short the cost of participating in society has gone up, and that&#39;s what an oppressive monopoly is.\n  To me, the key thing that Illich did was twist the question another way: what effects would cars have on society if a majority of people had them, and what effect would it have on the rest of us?\n The question I now want to ask is whether we have the equivalent in the software world. What are the things we do that we perceive increase our ability to do things, but turn out to actually end up costing us a lot more to just participate?\n We kind of see it with our ability to use all the bandwidth a user may have; trying to use old dial-up connections is flat out unworkable these days. But do we have the same with our cognitive cost? The tooling, the documentation, the procedures?\n  I don&#39;t have a clear answer to any of this, but it&#39;s a question I ask myself a lot when designing tools and software.\n The key point is that the software and practices that we choose to use is not just something we do in a vacuum, but part of an ecosystem; whatever we add to it changes and shifts expectations in ways that are out of our control, and impacts us back again. The software isn&#39;t trapped with us, we&#39;re trapped with the software.\n Are we not ultimately just making our life worse for it? I want to focus on this part where we make our own life, as developers, worse. When we write or adopt software to help ourselves but end up harming ourselves in the process, because that speaks to our own sustainability.\n   Rather than just being philosophical here I want to ground things in the real world with practical effects. Because this is something that researchers have covered. The Ironies of automation are part of cognitive research ( Bainbridge, 1983) that looked into people automating tasks and finding out that the effects weren&#39;t as good as expected.\n Mainly, it&#39;s attention and practice clashing. There are tons of examples over the years, but let&#39;s take a look at a modern one with self-driving cars.\n Self-driving cars are a fantastic case of clumsy automation. What most established players in the car industry are doing is lane tracking, blind spot detection, and handling parallel parking.\n But high tech companies (Tesla, Waymo, Uber) are working towards full self-driving, with Tesla&#39;s autopilot being the most ambitious one being released to the public at large. But all of these right now operate in ways Bainbridge fully predicted in 1983:\n the driver is no longer actively involved and is shifted to the role of monitoring\n the driver, despite no longer driving the car, regardless must be fully aware of everything the car is doing\n when the car gets in a weird situation, it is expected that the driver takes control again\n so the car handles all the easy cases, but all the hard cases are left to the driver\n Part of the risk there is twofold: people have limited attention for tasks they are not involved in—if you&#39;re not actively driving it&#39;s going to be hard to be attentive for extended periods of time—and if you&#39;re only driving rarely with only the worst cases, you risk being out of practice to handle the worst cases.\n Such automation is done in airlines who otherwise make up for it in simulator hours, and still manually handling planned difficult areas like takeoff and landing. Still, a bunch of airline incidents discover that this hand-off is often complex and not going well.\n Clearly, when we ignore the human component and its responsibilities in things, we might make software worse than what it would have been.\n  In general most of these errors come from the following point of view. This is called the &#34;Fitts&#34; model, also &#34;HABA-MABA&#34;, for &#34;Humans are better at, machines are better at&#34; (the original version was referred as MABA-MABA, using &#34;Men&#34; rather than &#34;Humans&#34;). This model frames humans as slow, perceptive beings able of judgement, and machines are fast undiscerning indefatigable things.\n We hear this a whole lot even today. These things are, to be polite, a beginner&#39;s approach to automation design. It&#39;s based on scientifically outdated concepts, intuitive-but-wrong sentiments, and is comforting in letting you think that  only the predicted results will happen and totally ignores any emergent behaviour. It operates on what we think we see now, not on stronger underlying principles, and often has strong limitations when it comes to being applied in practice.\n It is disconnected from the reality of human-machine interactions, and frames choices as binary when they aren&#39;t, usually with the intent of pushing the human out of the equation when you shouldn&#39;t. This is, in short, a significant factor behind the ironies of automation.\n  Here&#39;s a patched version established by cognitive experts. They instead reframe the human-computer relationship as a &#34;joint cognitive system&#34;, meaning that instead of thinking of humans and machines as unrelated things that must be used in distinct contexts for specific tasks, we should frame humans and computers as teammates working together. This, in a nutshell, shifts the discourse from  how one is limited to terms of  how one can complement the other.\n Teammates do things like being predictable to each other, sharing a context and language, being able to notice when their actions may impact others and adjust accordingly, communicate to establish common ground, and have an idea of everyone&#39;s personal and shared objectives to be able to help or prioritize properly.\n Of course we must acknowledge that we&#39;re nowhere close to computers being teammates as the state of the art today. And since currently computers need us to keep realigning them all the time, we have to admit that the system is not just the code and the computers, it&#39;s the code, the computers, and all the people who interact with them and each other. And if we want our software to help us, we need to be able to help it, and to help it that means the software needs to be built knowing it will be full of limitations and having us work to make it easier to diagnose issues and form and improve mental models.\n So the question is: what makes a good model? How can we help people work with what we create?\n  note: this slide and the next one are taken from my  talk on operable software\n This is a map of the city of London, UK. It is not the city of London, just a representation of it. It&#39;s very accurate: it has streets with their names, traffic directions, building names, rivers, train stations, metro stations, footbridges, piers, parks, gives details regarding scale, distance, and so on. But it is not the city of London itself: it does not show traffic nor roadwork, it does not show people living there, and it won&#39;t tell you where the good restaurants are. It is a limited model, and probably an outdated one.\n But even if it&#39;s really limited, it is very detailed. Detailed enough that pretty much anyone out there can&#39;t fit it all in their head. Most people will have some detailed knowledge of some parts of it, like the zoomed-in square in the image, but pretty much nobody will just know the whole of it in all dimensions.\n In short, pretty much everyone in your system only works from partial, incomplete, and often inaccurate and outdated data, which itself is only an abstract representation of what goes on in the system. In fact, what we work with might be more similar to this:\n  That&#39;s more like it. This is still not the city of London, but this tourist map of London is closer to what we work with. Take a look at your architecture diagrams (if you have them), and chances are they look more like this map than the very detailed map of London. This map has most stuff a tourist would want to look at: important buildings, main arteries to get there, and some path that suggests how to navigate them. The map has no well-defined scale, and I&#39;m pretty sure that the two giant people on Borough road won&#39;t fit inside Big Ben. There are also lots of undefined areas, but you will probably supplement them with other sources.\n But that&#39;s alright, because mental models are as good as their predictive power; if they let you make a decision or accomplish a task correctly, they&#39;re useful. And our minds are kind of clever in that they only build models as complex as they need to be. If I&#39;m a tourist looking for my way between main attractions, this map is probably far more useful than the other one.\n There&#39;s a fun saying about this: &#34;Something does not exist until it is broken.&#34; Subjectively, you can be entirely content operating a system for a long time without ever knowing about entire aspects of it. It&#39;s when they start breaking or that your predictions about the system no longer works that you have to go back and re-tune your mental models. And since this is all very subjective, everyone has different models.\n This is a vague answer to what is a good model, and the follow up is how can we create and maintain them?\n  One simple step, outside of all technical components, is to challenge and help each other to sync and build better mental models. We can&#39;t easily transfer our own models to each other, and in fact it&#39;s pretty much impossible to control them. What we can do is challenge them to make sure they haven&#39;t eroded too much, and try things to make sure they&#39;re still accurate, because things change with time.\n So in a corporation, things we might do include training, documentation, incident investigations all help surface aspects and changes to our systems to everyone. Game days and chaos engineering are also excellent ways to discover how our models might be broken in a controlled setting.\n They&#39;re definitely things we should do and care about, particularly at an organisational level. That being said, I want to focus a bit more on the technical stuff we can do as individuals.\n   We can&#39;t just open a so-called glass pane and see everything at once. That&#39;s too much noise, too much information, too little structure. Seeing everything is only useful to the person who knows what to filter in and filter out. You can&#39;t easily form a mental model of everything at once. To aid model formation, we should structure observability to tell a story.\n Most applications and components you use that are easy to operate do not expose their internals to you, they mainly aim to provide visibility into your interactions with them. There has to be a connection between the things that the users are doing and the impact it has in or on the system, and you will want to establish that. This means:\n log at the layer below which you want to debug, which saves time and how many observability probes you need to insert in your code base. We have a tendency to stick everything at the app level, but that&#39;s misguided.\n This means the logs around a given endpoint have to be about the user interactions with that endpoint, and require no knowledge of its implementation details\n For developer logs, you can have one log statement shared by all the controllers by inserting it a layer below endpoints within the framework, rather than having to insert one for each endpoint.\n These interactions will let people make a mental picture of what should be going on and spot where expectations are broken more easily. By layering views, you then make it possible to skip between layers according to which expectations are broken and how much knowledge they have\n Where a layer provides no easy observability, people must cope through inferences in the layers above and below it. It becomes a sort of obstacle.\n Often we are stuck with only observability at the highest level (the app) or the lowest level (the operating system), with nearly nothing useful in-between. We have a blackbox sandwich where we can only look at some parts, and that can be a consequence of the tools we choose. You&#39;ll want to actually pick runtimes and languages and frameworks and infra that let you tell that observability story and properly layer it.\n  Another thing to help with model formation is maintaining that relationship between humans and machines going smoothly. This is a trust relationship, and providing information that is considered misleading or unhelpful erodes that trust. There are a few things you can do with logs that can help not ruin your marriage to the computer.\n The main one is to log facts, not interpretations. You often do not have all the context from within a single log line, just a tiny part of it. If you start trying to be helpful and suggesting things to people, you change what is a fact-gathering expedition into a murder-mystery investigations where bits of the system can&#39;t be trusted or you have to rean between the lines. That&#39;s not helpful. A log line that says  TLS validation error: SEC_ERROR_UNKNOWN_ISSUER is much better than one that says  ERROR: you are being hacked regardless of how much experience you have.\n A thing that helps with that is structured logging, which is better than regular text. It makes it easier for people to use scripts or programs to parse, aggregate, route, and transform logs. It prevents you from needing full-text search to figure out what happened. If you really want to provide human readable text or interpretations,  add it to a field within structured logging.\n   There is another thing called the  Law of Requisite Variety, which says that only complexity can control complexity. If an agent can&#39;t represent all the possible states and circumstances around a thing it tries to control, it won&#39;t be able to control it all. Think of an airplane&#39;s flight stabilizers; they&#39;re able to cope only with a limited amount of adjustment, and usually at a higher rate than we humans could. Unfortunately, once it reaches a certain limit in its actions and things it can perceive, it stops working well.\n That&#39;s when control is either ineffective, or passed on to the next best things. In the case of software we run and operate, that&#39;s us, we&#39;re the next best thing. And here we fall into the old idea that if you are as clever as you can to write something, you&#39;re in trouble because you need to be doubly as clever to debug it.\n That&#39;s because to debug a system that is misbehaving under automation, you need to understand the system, and then understand the automation, then understand what the automation thinks of the system, and then take action.\n That&#39;s always kind of problematic, but essentially, brittle automation forces you to know more than if you had no automation in order to make things work in difficult times. Things can then become worse than if you had no automation in the first place.\n  When you start creating a solution, do it while being aware that it is possibly going to be brittle and will require handing control over to a human being. Focus on the path where the automation fails and how the hand-off will take place. How are you going to communicate that, and which clues or actions will an operator have to take over things?\n When we accept and assume that automation will reach its limits, and the thing that it does is ask a human for help, we shift our approach to automation. Make that hand-off path work easily. Make it friendly, and make it possible for the human to understand what the state of automation was at a given point in time so you can figure out what it was doing and how to work around it. Make it possible to guide the automation into doing the right thing.\n Once you&#39;ve found your way around that, you can then progressively automate things, grow the solution, and stay in line with these requirements. It&#39;s a backstop for bad experiences, similar to &#34;let it crash&#34; for your code, so doing it well is key.\n  Another thing that I think is interesting is the curb cut effect. The curb cut effect was noticed as a result from the various American laws about accessibility that started in the 60s. The idea is that to make sidewalks and streets accessible to people in wheelchairs, you would cut\n......", "posttime": "2020-10-20 22:49:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,编写,reap,可能", "title": "您将收获您所编写的代码", "title_en": "You Reap What You Code", "transed": 1, "url": "https://ferd.ca/you-reap-what-you-code.html", "via": "", "real_tags": ["代码", "编写", "reap", "可能"]}, {"category": "", "categoryclass": "", "imagename": "56a12ba089ef1e1878145214de652498.jpg", "infoid": 1030069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国司法部(Department Of Justice)周二指控谷歌违反联邦反垄断法，经过长达一年的调查后发现，这家科技巨头错误地利用其数字主导地位来增长其搜索和广告业务，损害了企业竞争对手和消费者的利益。\n联邦政府的诉讼可能会在华盛顿和硅谷之间引发一场里程碑式的旷日持久的法律战，这场战争不仅对谷歌，而且对整个科技行业都可能产生巨大的影响。近年来，科技行业因其积累的无与伦比的权力、资金和数据而面临前所未有的新审查。\n联邦反垄断诉讼标志着政府针对谷歌的策略的开始，而不是结束。联邦法院可能需要数年时间才能解决该公司是否违反了美国的竞争法，如果是的话，它可能会面临什么惩罚。\n来自路易斯安那州、佛罗里达州和德克萨斯州等州的11名共和党总检察长已经在司法部的申诉上签名。其他州可能仍会选择加入联邦诉讼，也可能选择自己起诉这家科技巨头，从而扩大谷歌必须覆盖的法律范围，以保护其业务不受严重、潜在影响深远的变化的影响。\n但对谷歌来说，仅此一项申请仍是一个令人震惊的事件转折，距离联邦政府上一次调查该公司潜在的反垄断违规行为已经过去了大约七年-监管机构在没有起诉谷歌或寻求包括拆分在内的重大处罚的情况下结束了这项调查。华盛顿多年来的不作为与谷歌在欧洲面临的严厉反垄断审查形成了鲜明对比。过去十年里，欧洲的竞争监管机构已经对这家总部位于加利福尼亚州山景城的科技巨头处以90亿美元的罚款，并试图确保谷歌提供搜索、广告和智能手机操作系统Android的方式发生重大改变。\n作为去年夏天宣布的对大型科技公司的广泛审查的一部分，司法部开始仔细审查谷歌，当时联邦官员试图回应他们当时所说的“消费者、企业和企业家对搜索、社交媒体和一些在线零售服务表示的广泛担忧”。谷歌当时在一份证券备案文件中承认，同年9月，谷歌开始向司法部移交关键的敏感文件，供其调查。\n最初，美国司法部官员表示有兴趣调查该公司的广告业务，该业务在该公司2019年总收入1620亿美元中贡献了最大份额。然而，调查很快扩大到涉及更广泛的问题，以回应从新闻出版商到旅游评论网站等竞争对手公司的一系列投诉。这些公司表示，谷歌以各种方式利用其强大的搜索引擎来巩固其主导地位。\n有时，联邦调查被证明是尖刻的。美国司法部和谷歌因该公司显然不愿交出联邦调查人员所说的对他们的工作至关重要的文件而争论不休。与此同时，在美国司法部内部，政府律师之间就提起诉讼的时间表发生了争执，特别是在2020年总统选举前的几周。今年夏天，数十名中情局工作人员表示，他们觉得自己还没有准备好起诉谷歌，但司法部长威廉·P·巴尔(William P.Barr)最终否决了这些指控，并让司法部走上了本月提起诉讼的道路。\n联邦调查与几乎每一位民主党和共和党司法部长去年9月开始的州调查同步进行。调查的范围已经扩大到不只是广告--涉及搜索，以及谷歌通过Android智能手机操作系统进一步增强其主导地位的程度。\n据四名知情人士透露，包括科罗拉多州、爱荷华州、内布拉斯加州和纽约州在内的几个州正准备最早于周二发表一份联合公开声明，表明它们仍在仔细审查谷歌的一系列商业行为，可能会选择在晚些时候加入任何联邦案件。由于讨论的是执法问题，这些知情人士要求匿名。邮报上周最先报道了这一消息。\n在一场历史性的反垄断听证会之后，大型科技公司发现自己处于地方和联邦政府官员的战争道路上。\n亚马逊、苹果、Facebook和谷歌背后的领导人在众议院司法小组委员会就反垄断、商业和行政法作证。\n众议员大卫·N·西西林(D-RI.)，众议院反垄断小组委员会的领导人：“互联网坏了。”\n近几个月来，Facebook和Twitter明确表示，他们不会容忍有关冠状病毒大流行的错误信息-即使是来自总统的错误信息。\n显示更多", "note_en": "The Department of Justice on Tuesday charged Google with violating federal antitrust law, finding after a year-long investigation that the tech giant wrongfully wielded its digital dominance to grow its search and advertising businesses to the detriment of corporate rivals and consumers.\n  The federal government’s lawsuit threatens to touch off a landmark and lengthy legal war between Washington and Silicon Valley, one that could have vast implications not only for Google but the entirety of a tech industry that has faced new, unprecedented scrutiny in recent years for the unrivaled power, money and data it has amassed.\n A federal antitrust lawsuit marks the start, not the end, of the government’s gambit against Google. It could take years for a federal court to resolve whether the company violated the country’s competition laws and, if so, what punishments it should may face.\n   Eleven Republican attorneys general -- from states including Louisiana, Florida and Texas -- have signed onto the Justice Department’s complaint. Other states may still choose to join the federal case, or they may opt to bring their own against the tech giant, widening the legal ground Google must cover to defend its business from serious, potentially far-reaching changes.\n But the filing alone still serves as a stunning turn of events for Google, roughly seven years after the federal government last probed the company for potential antitrust violations -- an inquiry that regulators concluded without suing Google or seeking significant penalties, including its breakup. The inaction in Washington for years has stood in stark contrast to the  withering antitrust scrutiny Google has faced in Europe, where competition regulators over the past decade have slapped the Mountain View, California-based tech behemoth with $9 billion in fines and sought to secure major changes to the way it offers search, advertising and Android, its smartphone operating system.\n  The Justice Department began scrutinizing Google as part of a  broad review of big tech announced last summer, as federal officials sought to respond to what they described then as “widespread concerns that consumers, businesses, and entrepreneurs have expressed about search, social media, and some retail services online.&#34; That September, Google started turning over key, sensitive documents to DOJ for its investigation, the company  acknowledged in a securities filing at the time.\n   Initially, DOJ officials signaled an interest in probing the company’s advertising business, which contributed the lion’s share of the company’s  total $162 billion in 2019 revenue. Quickly, though, the probe expanded to touch on a wider array of issues in response to a flurry of complaints from rival companies -- from news publishers to travel review websites -- that say Google wields its powerful search engine in myriad ways to entrench its dominance.\n At times, the federal probe has proven acrimonious. The DOJ and Google have  warred over the company’s apparent unwillingness to turn over documents that federal investigators describe as critical to their work. Within DOJ, meanwhile, government lawyers have sparred among themselves over the timeline for bringing a case particularly in the weeks before the 2020 presidential election. Dozens of agency staff signaled this summer they did not feel they were ready to bring charges against Google, but Attorney General William P. Barr ultimately overruled them -- and  set the Justice Department on a course to file this month.\n The federal investigation has proceeded in parallel with state probes commenced last September by nearly every Democratic and Republican attorney general. The  investigations have broadened to encompass more than advertising -- touching on search and the extent to which Google further enhances its dominance through the Android smartphone operating system.\n   A handful of states including Colorado, Iowa, Nebraska and New York are preparing to issue a joint public statement as soon as Tuesday indicating they are still scrutinizing a wide array of Google’s business practices and may instead opt to join any federal case later, according to four people familiar with their thinking, who spoke on the condition of anonymity to discuss a law-enforcement matter. The Post  first reported the news last week.\n In the wake of a historic antitrust hearing, big tech finds itself in the war path of local and federal government officials.\n The leaders behind   Amazon, Apple, Facebook and Google testified before the House Judiciary subcommittee on antitrust, commercial and administrative law.\n    Rep. David N. Cicilline (D-R.I.), the leader of the House’s antitrust subcommittee: The   “Internet is broken.”\n  Facebook and Twitter have made it clear in recent months that they will not tolerate misinformation on the coronavirus pandemic - even from the president.\n Show More", "posttime": "2020-10-20 22:48:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,谷歌,google,rust,联邦", "title": "美国司法部今日将指控谷歌多项违反联邦反垄断法", "title_en": "DOJ will charge Google with multiple violations of federal antitrust law today", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/10/20/google-antitrust-doj-lawsuit/", "via": "", "real_tags": ["美国", "谷歌", "google", "rust", "联邦"]}, {"category": "", "categoryclass": "", "imagename": "f8f5d529d35334f2fb264d19f656224e.png", "infoid": 1030068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Python3.9.0是Python编程语言的最新主要版本，它包含许多新特性和优化。\n这是第一个在Windows上默认使用64位安装程序的Python版本。安装程序现在还主动禁止在Windows 7上安装。Python 3.9与此不受支持的Windows版本不兼容。\nBpo 1635741，在同一进程中多次初始化python时，不再泄漏内存；\n大量的Python内置(范围、元组、集、冻结集、列表、字典)现在使用PEP590向量调用加速；\n许多Python模块(_abc、audioop、_bz2、_codecs、_contextvars、_crypt、_functools、_json、_locale、Operator、resource、time、_弱引用)现在使用PEP 489定义的多阶段初始化；\n许多标准库模块(Audioop、ast、grp、_hashlib、pwd、_posxsubprocess、Random、select、struct、termios、zlib)现在都在使用PEP384定义的稳定ABI。\n瓦卡普莱特：(约翰·克里斯)欢迎你！一定要坐下来。我的名字叫瓦卡普莱特，艾德里安·瓦卡普莱特。辛普森先生：你是怎么做的？现在，辛普森先生。我知道你想让我们为你们的洗衣粉做广告。S：字符串。W：细绳和洗衣粉，有什么区别吗？我们什么都可以卖。史：很好。嗯，我有这么大量的绳子，确切地说是12.2万英里长，是我继承的，我想如果我把它登广告的话……。W：当然可以！一场全国性的运动。有用的东西，绳子，没什么麻烦。史：啊，但是你看，这有个障碍。由于计划不周，100，2.2万英里的路程只有3英寸长。所以它不是很有用。W：嗯，这就是我们的卖点！辛普森个人鞋！S：什么？W：&#39；Now弦！现成的剪裁，易于操作，辛普森的个人皇帝紧身衣--长度恰到好处！S：用来做什么？W：一百万个家庭用途！S：比如？W：嗯……绑很小的包裹，在鸽子腿上贴纸条，呃，消灭家里的害虫……。学生：消灭家庭害虫？！多么?。W：嗯，如果它们比老鼠大，你可以用它勒死它们，如果它们比老鼠小，你就用它把它们打死！史：嗯，当然可以！....。W：用预先切片的、防锈的、易于操作的、低卡路里的辛普森单品，医院里使用的不含人工色素的Simpson单品，消灭99%的已知家庭害虫！&#39#*", "note_en": "Python 3.9.0 is the newest major release of the Python programming language, and it contains many new features and optimizations.\n  This is the first version of Python to default to the 64-bit installer on Windows. The installer now also actively disallows installation on Windows 7. Python 3.9 is incompatible with this unsupported version of Windows.\n   BPO 1635741, when Python is initialized multiple times in the same process, it does not leak memory anymore;\n A number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using  PEP 590 vectorcall;\n A number of Python modules (_abc, audioop, _bz2, _codecs, _contextvars, _crypt, _functools, _json, _locale, operator, resource, time, _weakref) now use multiphase initialization as defined by  PEP 489;\n A number of standard library modules (audioop, ast, grp, _hashlib, pwd, _posixsubprocess, random, select, struct, termios, zlib) are now using the stable ABI defined by  PEP 384.\n     Wapcaplet: ( John Cleese) Welcome! Do sit down. My name&#39;s Wapcaplet, Adrian Wapcaplet.  Mr. Simpson: how&#39;d&#39;y&#39;do.  Wapcaplet: Now, Mr. Simpson... Now, I understand you want us to advertise your washing powder.  S: String.  W: String, washing powder, what&#39;s the difference. We can sell  anything.  S: Good. Well I have this large quantity of string, a hundred and twenty-two thousand  miles of it to be exact, which I inherited, and I thought if I advertised it...  W: Of course! A national campaign. Useful stuff, string, no trouble there.  S: Ah, but there&#39;s a snag, you see. Due to bad planning, the hundred and twenty-two thousand miles is in three inch lengths. So it&#39;s not very useful.  W: Well, that&#39;s our selling point!  &#39;SIMPSON&#39;S INDIVIDUAL STRINGETTES!&#39;  S: What?  W:  &#39;THE NOW STRING! READY CUT, EASY TO HANDLE, SIMPSON&#39;S INDIVIDUAL EMPEROR STRINGETTES - JUST THE RIGHT LENGTH!&#39;  S: For what?  W:  &#39;A MILLION HOUSEHOLD USES!&#39;  S: Such as?  W: Uhmm...Tying up very small parcels, attatching notes to pigeons&#39; legs, uh, destroying household pests...  S: Destroying household pests?! How?  W: Well, if they&#39;re bigger than a mouse, you can strangle them with it, and if they&#39;re smaller than, you flog them to death with it!  S: Well  surely!....  W:  &#39;DESTROY NINETY-NINE PERCENT OF KNOWN HOUSEHOLD PESTS WITH PRE-SLICED, RUSTPROOF, EASY-TO-HANDLE, LOW CALORIE SIMPSON&#39;S INDIVIDUAL EMPEROR STRINGETTES, FREE FROM ARTIFICIAL COLORING, AS USED IN HOSPITALS!&#39;", "posttime": "2020-10-20 22:48:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python", "title": "Python 3.9", "title_en": "Python 3.9", "transed": 1, "url": "https://www.python.org/downloads/release/python-390/", "via": "", "real_tags": ["python"]}, {"category": "", "categoryclass": "", "imagename": "74982ce45fed8f69e756377c667b2925.jpeg", "infoid": 1030067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "赫尔辛基(路透社)-在地球上的家里，正在努力获得电话信号吗？也许你在月球上会有更好的运气。\n美国国家航空航天局(NASA)周一表示，诺基亚(Nokia)已被美国国家航空航天局(NASA)选中，在月球上建立第一个蜂窝网络，因为美国航天局计划在未来人类返回月球并在月球上定居。\nNASA的目标是在2024年之前让人类重返月球，并根据其Artemis计划在那里挖掘长期存在的机会。\n诺基亚表示，太空中的第一个无线宽带通信系统将于2022年底在月球表面建造，然后人类才能回到月球表面。\n它将与德克萨斯州的一家私人航天器设计公司直觉机器公司合作，用他们的月球着陆器向月球运送设备。诺基亚表示，该网络将自行配置，并在月球上建立4G/LTE通信系统，尽管目标是最终切换到5G。\n该公司表示，该网络将为宇航员提供语音和视频通信能力，并允许遥测和生物识别数据交换，以及月球车和其他机器人设备的部署和远程控制。\n该网络将被设计成能够承受发射和登月的极端条件，并在太空中运行。它必须以极其紧凑的形式送上月球，以满足空间有效载荷的严格尺寸、重量和功率限制。\n诺基亚表示，该网络将使用过去十年在全球范围内使用的4G/LTE，而不是最新的5G技术，因为前者是一个更为人所知的数量，具有经过验证的可靠性。该公司还将“追求LTE后续技术5G的空间应用”。", "note_en": "HELSINKI (Reuters) - Struggling to get a phone signal at home on planet Earth? Perhaps you’ll have better luck on the moon.\n Nokia has been selected by NASA to build the first cellular network on the moon, the Finnish company said on Monday, as the U.S. space agency plans for a future where humans return there and establish lunar settlements.\n NASA aims to return humans to the moon by 2024 and dig in for a long-term presence there under its Artemis programme.\n  Nokia said the first wireless broadband communications system in space would be built on the lunar surface in late 2022, before humans make it back there.\n It will partner with a Texas-based private space craft design company, Intuitive Machines, to deliver the equipment to the moon on their lunar lander. The network will configure itself and establish a 4G/LTE communications system on the moon, Nokia said, though the aim would be to eventually switch to 5G\n The network will give astronauts voice and video communications capabilities, and allow telemetry and biometric data exchange, as well as the deployment and remote control of lunar rovers and other robotic devices, according to the company.\n  The network will be designed to withstand the extreme conditions of the launch and lunar landing, and to operate in space. It will have to be sent to the moon in an extremely compact form to meet the stringent size, weight and power constraints of space payloads.\n Nokia said the network would be using 4G/LTE, in use worldwide for the last decade, instead of the latest 5G technology, because the former was a more known quantity with proven reliability. The company would also “pursue space applications of LTE’s successor technology, 5G”.", "posttime": "2020-10-20 22:48:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "移动,build,月球", "title": "诺基亚将在月球上建设移动网络", "title_en": "Nokia to build mobile network on the moon", "transed": 1, "url": "https://www.reuters.com/article/nokia-nasa-moon-idUSKBN2741JR", "via": "", "real_tags": ["移动", "build", "月球"]}, {"category": "", "categoryclass": "", "imagename": "bf9cce87ed2dd772ac6b90d6b22be7da.jpg", "infoid": 1030066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "瑞典的研究人员设计并演示了迄今为止在自由空间中拾取光信号的最灵敏的接收器。查尔默斯科技大学的Peter Andrekson和他的同事说，他们在接收器中使用了一种新的信号准备方法，并在接收器上进行了几乎无噪音的放大，从而实现了接收器中每比特信息一个光子的“前所未有”灵敏度。他们的技术可能会对未来的太空任务产生重要影响。\n随着空间机构寻求既扩大其探索范围，又改善其卫星的数据输出，现有的基于无线电的通信系统正在努力跟上。为了能够在更高的数据速率下运行，并且能够进行更远距离的传输，由于光信号在传播期间的功率损耗较低，现在越来越多地考虑通过无线电波传输光信号。尽管如此，在遥远的太空中损失可能是巨大的。为了利用尽可能少的光子实现更高的传输速率，具有尽可能高灵敏度的接收器是成功的关键。\n为了实现这一点，安德森的团队引入了一种新的设置，在这种设置中，数据首先被编码到信号光波上，然后与不同频率的连续泵浦光波相结合。当这些波通过非线性光纤时，它们就会产生第三个“闲置”波。之后，所有三个波都被放大到所需的输出功率，并发射到自由空间。在接收端，耗尽的信号被捕获在光纤中，然后由相敏光放大器放大，相敏光放大器是一种独特的几乎不会给信号添加任何噪声的设备。最后，恢复的信号到达常规接收机，在那里可以恢复原始信息。\n目前，即使是最复杂的自由空间光通信系统也只能以低于1 Gb/s的速度运行，并且需要超低温才能运行。相比之下，安德森团队设计的系统在室温下实现了接近每位信息一个光子的接收器灵敏度，使数据传输速率高达10.5 Gb/s，此外，该系统依靠简单的技术进行信号调制、处理和误差计算。这意味着它可以很容易地进行扩展，以适应更高的数据速率。\n通过对他们的技术灵敏度进行进一步的理论计算，Andrekson和他的同事得出结论，这是在广泛的数据速率范围内传输的最佳可能方法。如果未来集成到真实空间任务的通信系统中，他们的方法可能会加速从无线电信号到光学信号的过渡，以便进行长距离传输。这可能会改进今后对太阳系遥远部分的飞行任务；卫星之间的数据传输；以及使用激光雷达光学技术监测地球表面。", "note_en": "The most sensitive receiver to date for picking up optical signals in free space has been designed and demonstrated by researchers in Sweden.  Peter Andrekson and colleagues at Chalmers University of Technology say they achieved this “unprecedented” sensitivity of one photon per bit of information in their receiver using a novel approach to signal preparation, combined with virtually noiseless amplification at the receiver. Their technique could have important implications for future space missions.\n   As space agencies seek to both expand their scope of exploration, and improve the data outputs of their satellites, existing radio-based communications systems are struggling to keep up. To enable operation at higher data rates, and transmissions across larger distances, optical signals are now increasingly being considered over radio waves, owing to their lower power losses during propagation. All the same, losses can be substantial in the vast distances of space. To realize higher transmission rates using as few photons as possible, receivers with the highest possible sensitivities are critical for success.\n To achieve this, Andrekson’s team introduce a new setup in which data are first encoded onto a signal light wave, then combined with a continuous pump light wave at a different frequency. When these waves are passed through a nonlinear optical fibre, they then generate a third “idler” wave. Afterwards, all three waves are amplified to the desired output power, and launched into free space. At the receiving end, the depleted signal is captured in an optical fibre, then amplified by a phase-sensitive optical amplifier – a device unique in adding almost no noise to signals. Finally, the restored signal reaches a conventional receiver, where the original information can be recovered.\n  Currently, even the most sophisticated free-space optical communications systems can only run at speeds of under 1 Gb/s, and require ultracold temperatures to operate. In contrast, the system designed by Andrekson’s team achieved a receiver sensitivity of close to one photon per bit of information at room temperature, enabling a data transmission rate as high as 10.5 Gb/s. In addition, the system relies on straightforward techniques for signal modulation, processing, and error calculation. This means it could easily be scaled up to accommodate higher data rates.\n  Through further theoretical calculations of the sensitivity of their technique, Andrekson and colleagues concluded that it is the best possible approach to transmission across a broad range of data rates. If integrated into the communications systems of real space missions in the future, their approach could hasten the transition from radio to optical signals for transmissions across large distances. This could lead to operational improvements to future missions to distant parts of the solar system; the transfers of data between satellites; and the monitoring of Earth’s surface using the optical technique LIDAR.", "posttime": "2020-10-20 22:48:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空间通信,receiver,信号", "title": "用于空间通信的光接收机具有“前所未有”的灵敏度", "title_en": "Optical receiver for space communications has ‘unprecedented’ sensitivity", "transed": 1, "url": "https://physicsworld.com/a/optical-receiver-for-space-communications-has-unprecedented-sensitivity/", "via": "", "real_tags": ["空间通信", "receiver", "信号"]}, {"category": "", "categoryclass": "", "imagename": "391944c6fc1dec30cf240953a4bb7542.jpg", "infoid": 1030065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何数据库模式都可能有大量的文本字段。在本文中，我将文本字段分为三类：\n小文本：名称、插件、用户名、电子邮件等。这些文本字段通常有一些较低的大小限制，甚至可能使用varchar(N)而不是文本。\n大文本：博客帖子内容、文章、HTML内容等。这些是存储在数据库中的自由、不受限制的大段文本。\n中等文本：描述、评论、产品评论、堆栈跟踪等。这些是介于小文本和大文本之间的任何文本字段。这些类型的文本通常是不受限制的，但自然比大文本小。\n在本文中，我将演示中等大小的文本对PostgreSQL查询性能的惊人影响。", "note_en": "Any database schema is likely to have plenty of text fields. In this article, I divide text fields into three categories:\n Small texts: names, slugs, usernames, emails, etc. These are text fields that usually have some low size limit, maybe even using  varchar(n) and not  text.\n Large texts: blog post content, articles, HTML content etc. These are large pieces of free, unrestricted text that is stored in the database.\n Medium texts: descriptions, comments, product reviews, stack traces etc. These are any text field that is between the small and the large. These type of texts would normally be unrestricted, but naturally smaller than the large texts.\n In this article I demonstrate the surprising impact of medium-size texts on query performance in PostgreSQL.", "posttime": "2020-10-20 22:47:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,性能,impact,文本", "title": "中等大小文本对PostgreSQL性能的惊人影响", "title_en": "The Surprising Impact of Medium-Size Texts on PostgreSQL Performance", "transed": 1, "url": "https://hakibenita.com/sql-medium-text-performance", "via": "", "real_tags": ["性能", "impact", "文本"]}]