[{"category": "", "categoryclass": "", "imagename": "4a4ff7b11915d8932823b744b43dab4e.jpg", "infoid": 1071823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人类的未来 Elon Musk 在很多方面改变了世界。他以担任特斯拉汽车公司、SpaceX 和 SolarCity 的负责人而闻名。他的公司使在不消耗化石燃料、进入太空或利用太阳能的情况下绕地球旅行成为可能。Credit Insane Curiosity", "note_en": "Future  of Mankind  Elon Musk has changed the world in many ways. He is known for being the head of Tesla Motors, SpaceX and SolarCity. His companies have made it possible to travel around Earth without consuming fossil fuels, going into space, or harnessing solar power.Credit Insane Curiosity", "posttime": "2021-08-07 02:18:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "马斯克,musk", "title": "埃隆马斯克和他的公司正在改变人类的未来", "title_en": "Elon Musk and His Companies Are Changing the Future of Mankind", "transed": 1, "url": "https://www.thefuturist.co/how-elon-musk-and-his-companies-are-changing-the-future-of-mankind/", "via": "", "real_tags": ["马斯克", "musk"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "tl;博士 – 我假设票务系统的物理和情感距离会降低工作满意度并提出解决方案。我记得当我还是个孩子的时候，我知道如何编码。我没有得到应有的好成绩，我在其他一些方面也没有出彩，但尽管如此，我知道我可以做一些特别的事情。我可以构建有趣的东西，我可以解决问题。当谈到我的第一份工作时，我也有同样的感觉。当时我会说我仍然有点“边缘粗糙”，但我可以解决问题，有时是棘手的问题，这让我变得有用。使用我知道自己擅长的一种方式被需要感觉很棒。没有什么比有人走到我的办公桌前告诉我一个让他们的生活变得艰难的问题并能够为他们解决的问题。很快，尽管一些更高级的工程师开始发言。 “我们不能有这样的打扰。我们需要更有条理。我们需要跟踪这项工作。我们需要在 JIRA 中提出问题。”我和很多人有同样的反应，那就是“为什么我们需要跟踪这个？我们难道不相信每个人都在尽其所能地工作吗？”。我得到了关于估算、计划等重要性的通常答案，但并不完全理解，但接受了。多年后，我自己年长，我会坚持 - 每次代码更改都必须有相关的票证。这并不是说我是某种敏捷传播者，但我确实发现票务系统是必不可少的，即使对于最小的团队也是如此。一路上的某个地方，我忘记了我曾经有过不同的感觉。下一个角色我成为了一家混乱初创公司的主要 SRE。有些人会讨厌它，但我喜欢它。战争室的嗡嗡声和刺激与事务功能开发无法比拟，最终会导致 A/B 版本，然后可能会导致指标的小百分比改进。我喜欢为我亲自见过的其他工程师解决问题，他们很高兴并印象深刻，我会解决他们的问题并改进整个系统，使将来不可能出现问题。我喜欢的并不是 SRE 本身所固有的。虽然是一个高风险的角色，但它也可以像任何角色一样孤立。它可以是在晚上醒来闹钟自己登录并解决问题，提交票证，并且没有人注意到。\n从另一个角度来看——当我去吃全食品并看着收银员扫描我定价过高的商品时，我想知道他们是怎么想的。虽然与陌生人闲聊对我来说远不是一种力量，但无论如何我都在努力以我能用的任何小方式建立联系。我不认为我可以强行开玩笑并相信时间与可变结帐时间一致。我尽量表现得很好，而不是刻板礼貌。这可能意味着我自己打包杂货，或者避免本能地盯着我的手机。我什至不能肯定收银员注意到或喜欢它。我只是假设如果我处于他们的位置，我就不想感觉自己像一台机器。首先，问题是：我们如何协调我们希望受到个人关注和人性化的需求与标准化的业务需求？我认为这个问题是本文最重要的部分。我会提出一个或两个建议，让球滚动，但这个话题是开放的。如果通过 jira 正常提交票证，但提交者还必须来到操作票证的人的办公桌前面对面解释问题怎么办？如果门票的描述方式强调了该功能用户的情感重要性，该怎么办？如果与用户交流的 PM 获得的最终用户满意度和愿望与工程师分享会怎样？", "note_en": "tl; dr – I hypothesize the physical and emotional distance of ticketing systems reduces job satisfaction and propose solutions.\n   I remember when I was a kid I knew how to code. I didn’t get as good grades as I could have, I didn’t shine in a few other ways, but despite this I knew I could do something special. I could build interesting things and I could fix problems.\n When it came to my first job I felt the same way. At the time I’d say I was still a bit “rough around the edges” but I could fix problems, sometimes hard ones, and that made me useful. It felt great to be needed using the one way I knew I was good at. There was nothing like somebody walking over to my desk to tell me about a problem that was making their lives hard, and to be able to fix it for them.\n Pretty soon though a number of more senior engineers started speaking up. “We can’t have interruptions like this. We need to be more structured. We need to track this work. We need to put to asks in JIRA.” I had the same reaction a lot of people do, which was “Why do we need to track this? Do we not trust everybody is working to the best of their ability?”. I got the usual answers about the importance of estimation, planning, etc, and didn’t entirely understand, but accepted.\n Years later, senior myself, I would insist –  every code change must have an associated ticket. That isn’t to say I’m some kind of agile evangelist, but I certainly found ticketing systems indispensable, even for the smallest of teams. Somewhere along the way I had forgotten that I had ever felt otherwise.\n Next role I became the main SRE for a chaotic startup. Some people would hate it, but I  loved it. The buzz and thrill and of a war-room was incomparable to the transactional feature development that would eventually lead to an A/B release that would then possibly lead to a small % improvement in a metric. I loved fixing things for other engineers who I saw in person, who were happy and impressed that I would fix their issue and improved the whole system to make the issue impossible in the future.\n What I loved wasn’t inherent to being an SRE itself. Though a high-stakes role, it can also be as isolating as any role. It can be waking up to an alarm at night to login in by oneself and fix an issue, file a ticket, and have nobody notice.\n  From another angle – when I go to whole foods and watch the cashier scan my overpriced items, I wonder what they think. Though small talk with strangers is far from a strength for me, I struggle anyways to connect in whatever small way I can. I don’t think I could force a joke and trust the timing to line up with the variable checkout time. I try to be nice without being stiffly polite. It may mean bagging my own groceries, or avoiding the instinct to stare at my phone. I can’t even say for sure that cashiers notice or like it.  I simply presume that if I were in their shoes I wouldn’t want to feel like a machine.\n  Well first, the question: How do we reconcile our desire to feel individually noticed and human with the business needs of standardization? I think this question is the most important piece of this article. I’ll make a proposal or two, to get the ball rolling, but the topic is wide-open.\n What if tickets are filed normally through jira, but then the filer must also come over to the desk of the person operating on the ticket and explain the issue face-to-face?\n What if tickets are described in a way that stresses the emotional importance to the user of the feature?\n What if end-user satisfaction and wishes, as captured by PMs who communicate with users, was shared with engineers?", "posttime": "2021-08-07 02:18:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "票猴,ticket", "title": "票猴", "title_en": "Ticket Monkey", "transed": 1, "url": "https://blog.alexrohde.com/archives/749", "via": "", "real_tags": ["票猴", "ticket"]}, {"category": "", "categoryclass": "", "imagename": "2f91ba467c94856cca169f767b2aa7af.jpg", "infoid": 1071821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Technicolor 胶片不是彩色胶片，它不会产生任何栩栩如生的色彩。但它是如何制作彩色电影的呢？为什么这些颜色会发光？为什么这一切都会导致多萝西得到红宝石拖鞋？任何看过旧 Technicolor 电影的人都知道，它看起来很奇怪。蓝眼睛看起来像是在发光。粉红色的脸看起来像是被涂上了桃子。红色看起来很吓人。这一切看起来都被染色了，没有被记录下来——那是因为它是。当时没有任何彩色胶片让 Technicolor 大放异彩。没有人想出如何制作可以记录颜色的胶片。然而，他们找到了一种制作胶片的方法，可以过滤掉所有不应该通过的颜色。他们有染料。通过将它们放在一起，他们使 Technicolor 变得光彩夺目。 Technicolor 相机没有彩色胶片。相反，他们用不同的滤镜以黑白拍摄。光线进入相机镜头并进入半镀银镜，该镜通过品红色镜头（红色和蓝色一起）和绿色镜头将光束分开。洋红色镜头后面是对蓝光敏感的胶片，对红光敏感的胶片。绿色镜头后面只是普通的感光胶片。制作组最后拍了三组胶卷，一组显示他们正在拍摄的物体发出的蓝光，一组显示红光，另一组显示绿色。所有这些都是黑白胶片。他们只是展示了看起来很奇怪的照片。例如，在“蓝色”卷上，皮肤中几乎没有蓝色调的人的皮肤看起来完全黑，而蓝丝带看起来是纯白色的。每个黑白图像都用其适当的颜色染色。有时，当它们被染色时，这些薄膜会合并并重新过滤，因此只有亮蓝色会从蓝色染色的薄膜中出来。最后，当影片上映时，三片染色的影片将一层一层地叠加在一起，形成“光彩夺目的彩片”。这就是为什么，尤其是在早期的电影中，色彩看起来如此绘画。这也是为什么大多数早期电影几乎都会引起眼睛疲劳的原因——尤其是著名的电影《绿野仙踪》。 Technicolor 过程很昂贵，不仅仅是因为相机和技术人员需要拍摄，还有许多附带的技术问题。有些颜色，如果太微妙，会突然像其他颜色一样弹出。如果过滤掉太多错误的颜色，黄色会随机变成绿色。而且由于进入相机的光束被分到多张胶片上，所以工作室中只有一小部分光线可以投射到任何一张胶片上。这意味着工作室需要格外明亮。绿野仙踪的许多常客抱怨工作室灯光对眼睛造成的伤害，这种情况持续了数年。不过，大多数情况下，这意味着制作团队不想浪费任何颜色的机会。书中多萝西的拖鞋是银色的，据说黄砖路、银色拖鞋、翠绿色的城市代表金本位、银币和纸币。但是银拖鞋在电影中一点都不好玩。他们也可能被拍成黑白片。然而，红色很容易看到，引人注目，并且不会对颜色混合造成严重破坏——著名的黄砖路经常这样做。因此，充分利用了Technicolor的红宝石拖鞋，永远改变了美国的童话故事。", "note_en": "Technicolor film was not color film, and it did not produce anything like lifelike colors. But how did it produce color movies? And why did those colors glow? And why did all of it lead to Dorothy getting ruby slippers?\n  As anyone who has seen an old Technicolor film knows, it looks weird. Blue eyes look like they glow. Pink faces look like they&#39;ve been painted peach. Red looks scary. It all looks dyed, not recorded — and that&#39;s because it was. There wasn&#39;t any color film at the time that Technicolor was making its big splash. No one had figured out how to create a film stock that would record color. They had, however, found a way to make film stock that would filter out all the color that shouldn&#39;t get through. And they had dyes. By putting them together, they made Technicolor glorious.\n  Technicolor cameras didn&#39;t film in color. Instead they filmed in black and white, with different filters. The light entered the camera lens and went to a half-silvered mirror, which split the beam of light through a magenta lens (red and blue together), and a green lens. Behind the magenta lens was film sensitive to blue light, and film sensitive to red light. Behind the green lens was just plain light-sensitive film. The production crew ended up with three sets of film, one showing the blue light that the object they were filming gave off, one showing the red light, and one showing the green. All of these were black and white film strips. They just showed odd-looking pictures. For example, on the &#39;blue&#39; roll, a person with few blue tones in their skin would have skin that looked completely dark, while a blue ribbon would look pure white. Each of the black and white images were dyed with its proper color. Sometimes, when they were dyed, the films would combined and re-filtered, so that only bright blues would make it out of the blue-dyed film.\n    At last, when it was time for the film to be shown, the three dyed films would be layered on top of one another, to make &#39;glorious technicolor.&#39; This is why, especially in the early films, the coloring looks so painterly. It&#39;s also why most early films nearly cause eyestrain — especially the famous film  The Wizard of Oz. The Technicolor process was expensive, not just because of the camera and the technicians needed to film, but the many incidental technical issues. Some colors, if they were too subtle, would suddenly pop out as other colors. Yellows would turn green in random patches, if too much of the wrong color was filtered out. And since the beam of light entering the camera was split between multiple films, only a fraction of the light in the studio made it onto any one film. This meant that the studio needed to be extra bright. Many regulars on  The Wizard of Oz complained of eye damage from the studio lights, that lasted years.\n  Mostly, though, it meant that production teams didn&#39;t want to waste a single opportunity for color. In the books, Dorothy&#39;s slippers were silver, and the yellow brick road, silver slippers, and emerald green city were said to represent the gold standard, silverites, and paper money. But silver slippers were no fun at all on film. They might as well be filmed in black and white. Red, however, was easy to see, eye-catching, and didn&#39;t wreak havoc with the color mixing — the way the famed yellow-brick road often did. Hence the ruby slippers, which made the most of Technicolor, and an American fairy-tale was changed forever.", "posttime": "2021-08-07 02:18:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,created,看起来", "title": "Technicolor 如何在不使用彩色胶片的情况下制作 Ruby 拖鞋", "title_en": "How Technicolor created Ruby slippers without using color film", "transed": 1, "url": "https://gizmodo.com/how-technicolor-created-ruby-slippers-without-using-col-5904930", "via": "", "real_tags": ["ruby", "created", "看起来"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我上一篇关于 Sierra Online 公司历史的文章的结尾，我们看到了肯和罗伯塔威廉姆斯如何在 1993 年 9 月将他们公司的总部从加利福尼亚北部的小镇奥克赫斯特搬到西雅图郊区贝尔维尤，那里是微软等公司的所在地。正如肯承认的那样，他们这样做是出于个人和职业原因的混合。一方面，他们的孩子越来越大，奥克赫斯特的学校远非世界一流。此外，作为奥克赫斯特公司城镇鱼缸中最大的鱼的生活通常并不总是愉快的。例如，Ken 声称他的孩子有时会受到“对 Sierra 怀有怨恨的前 Sierra 员工的孩子”的欺负。其他一些前雇员怀疑搬到贝尔维尤的另一个原因是肯忽略提及的一个原因：华盛顿州没有个人所得税，而加利福尼亚州是全国最高的。尽管如此，没有理由怀疑肯在当天给出的搬回公开理由确实是计算的主要部分：需要招聘那种可以将 Sierra 提升到一个新水平的经验丰富的商业人才。自 1987 年以来，该公司的年收入每年都在增长，而且通常是大幅增长，这当然很棒。但不太妙的是，利润从来没有像这种进展所暗示的那样高。 Sierra 擅长花掉他们赚到的几乎每一分钱。事实上，尽管收入继续稳步攀升，但最近的底线却急剧下降到亏损区域。在股东的压力下，肯威廉姆斯意识到他必须找到一种方法让他的公司开始获得回报。他认为，这样做必须组建一支只有在大城市才能找到的顶级管理团队。长期以来，他一直在奥克赫斯特（Oakhurst）寻找一位摇滚明星的首席财务官，但无济于事。肯·威廉姆斯：我聘请了一家总部位于旧金山的公司 Heidrick &amp; Struggles 来领导搜索，几个月后我一无所获，我沮丧地打电话给我在海德瑞克的联系人。 “你为什么一直给我送B级和C级的候选人？”我问。我厌倦了浪费时间去面试那些不符合我要求的候选人。答案毫不犹豫地回来了：“肯，你没有明白。不，有球员想搬到奥克赫斯特。”搬到贝尔维尤九个月后，肯终于找到了他的摇滚明星，迈克布罗楚是一位金融专家，过去 19 年来一直在伯灵顿资源公司工作。肯仍然形容为“可能是我做过的最好的雇员”的那个人是一个爱唠叨的德克萨斯人，他“激发了周围每个人的信心”。并非巧合的是，Sierra 几乎从他到达的那一刻起就开始对他们的业务表现出一种新的顽固、注重底线的态度。 1994 年 11 月，布罗楚领导了谈判，最终以 4000 万美元现金将 Sierra 富有远见但一直亏损的在线游戏服务 The ImagiNation Network 出售给 AT&amp;T。改变他们的产品开发策略。多年来，公司身份的核心一直是一系列长期运行的冒险游戏系列，其中大部分都在标题中加入了“任务”一词。从写作和设计的角度来看，虽然有时是狡猾的，但他们都表现出足够可爱的品质来钻进粉丝的心。我在之前的文章中描述了 Sierra 粉丝如何感觉像是属于一个大家庭。那么，这些游戏就是你每隔几年就能在家庭聚会上看到的表亲，他们的穿着可能与上次有所不同，但始终是同一个人。他们是令人欣慰的可预测的，这正是球迷喜欢他们的方式。但是，尽管这些摇摇欲坠、充满谜题的冒险游戏擅长巩固已经转变的人的忠诚度，但它们却没有能力释放 Sierra 现在所追求的那种爆炸性增长。正如 Ken Williams 和 Mike Brochu 所公认的那样，这是个人计算机历史上的一个关键时刻。 1994 年，家用电脑的销量将超过电视，因为消费者被 Microsoft Windows 的易用性、多媒体的魔力以及有关万维网的谣言所吸引，以惊人的数量加入了计算潮流。这些人不知道来自创世纪的国王的任务。接触他们需要一种不同的游戏：在马歇尔麦克卢汉的意义上更新鲜、更热，更符合他们在电视和电影中看到的内容。似乎现在或永远不会让 Sierra 引起他们的兴趣，即使这意味着一些老粉丝会感到有点被遗弃。因此，Sierra 的新贝尔维尤管理团队仔细研究了他们现有的系列，以确定哪些是可消耗的，哪些不是。 King&#39;s Quest 是该公司的长期旗舰系列，它已经在传统的电脑游戏贫民窟之外享有一定的知名度，即使它不是罗伯塔威廉姆斯的孩子，它也会成为一个明显的守护者。休闲套装拉里也被证明对非传统人口统计具有吸引力，因此也很容易留下来。 Space Quest 是一个边缘案例，但经理们决定再开一场比赛，哪怕只是为了向老派球迷扔骨头。但是 Police Quest 将从一系列冒险游戏改造成一系列战术 3D 动作游戏，而 Quest for Glory 将完全获得斧头。展望未来，主要重点将放在雇佣人类演员进行更大预算的冒险上，为此 Sierra 现在正在奥克赫斯特以相当大的成本建造自己的声场。他们会减少这种新型冒险的制作，但它们中的每一个都将是华而不实的高保真制作，能够吸引大屏幕电视和 CD 播放器断奶的大众市场。这个想法是让每一次 Sierra 冒险的发布都成为一个真实的事件。\n不幸的是，从一种产品策略到另一种产品策略的转变带来了一个陷阱：实现它需要一些时间，这意味着 1994 年在新游戏方面将是异常平静的一年。而这一现实，再加上新管理团队更加顽固的态度，意味着奥克赫斯特的一些人必须失业。其中包括 Quest for Glory 背后的夫妻团队 Corey 和 Lori Cole，他们的角色被取消以及他们系列的第五场比赛，这是 Sierra 系列系列中最令人印象深刻的设计野心和创新。科里回忆了一个场景，让在场的每个人都清楚地看到塞拉现在是作为一家企业而不是一家人来经营的：“会议上的所有员工都收到了信封；其中大约一半包含“粉红单”，通知他们不再为 Sierra 工作。这些员工被护送回大楼，看着他们从办公桌上取回个人物品。”裁员从来都不是一件容易的事。科里特别记得曾参与过 Sierra 的两款 EcoQuest 游戏和 Pepper&#39;s Adventures in Time 的 Gano Haine 站在停车场哭泣的情景：“Sierra 是她的梦想，她很高兴能在那里得到这份工作。”在这一痛苦的过渡年中，Sierra 仅发布了一款由 Oakhurst 打造的新冒险游戏，这使其成为近十年来在这方面最多产的一年。值得庆幸的是，对于豆计数器，有问题的游戏是 Sierra 最赚钱的冒险系列中的最新一期。 King&#39;s Quest VII: The Princeless Bride 是自 1984 年以来 Sierra 不断发展的技术展示系列中的一个典型条目。但是，这种描述本身至少意味着在技术方面的创新，而这个新条目确实实现了。虽然它没有聘请电影演员，但 King&#39;s Quest VII 以另一种方式表明了 Sierra 的新方向：它的目标不是一部互动电影，而是一部值得与迪士尼等公司进行比较的互动卡通片，这是一种雄心壮志，需要它看起来除了 Sierra 自己的一群才华横溢的内部艺术家之外，它的一些视觉效果。肯·威廉姆斯首先联系了一家名为皮克斯的新兴动画工作室。他甚至亲自与皮克斯董事长兼大股东史蒂夫·乔布斯进行了交谈，但最终该工作室被证明太忙于制作他们的第一部全长故事片《玩具总动员》，也无法承担这项任务。因此，Sierra 最终将序列外包给不少于四家其他外部动画工作室，此外还聘请了自己的艺术家来创作符合当时标准的真正视听盛宴。正如 Charles Ardai 在他为 Computer Gaming World 杂志所做的评论中所描述的那样，King&#39;s Quest VII 充满了迪士尼。我在我妈妈（一个大童话迷）身上试过这个游戏，她问：“这是迪士尼的游戏吗？”当我给出否定的回答时，她说：“但他们正在努力做迪士尼，对吗？”他们确实是。从开场画面，魔法森林中的露珠滴在魔法瓢虫的肚子上，到几秒钟后可爱的罗塞拉公主用优美的赞歌向她即将成为的人唱出她皇室的心声的场景- 失落的青春期，《国王的探索 VII》的每个动画姿势都散发着迪士尼般的品质。每一帧都是美丽的，每一行都整齐而准确，相机飞扬和滑行，乐谱的音符在跳跃的气泡中叮当作响，就像一瓶汽水一样。这就是小美人鱼或美女与野兽或阿拉丁的迪斯尼，如果你扣除那部电影针对成人的讽刺感。这是石中剑和爱丽丝梦游仙境的迪斯尼，像舒芙蕾一样轻盈蓬松。这不是小鹿斑比或白雪公主的迪斯尼；在这里，即使是威胁也是可爱的奇思妙想。如果恶棍吓坏了，那只是很短的时间，然后大家又聚在一起再唱一首歌。游戏来自 Sierra 而不是迪士尼，这根本不重要。这符合迪士尼精神。\n除了令人垂涎的新外观外，该游戏还展示了对 Robera Williams 早期作品的一些受欢迎的设计演变。在 LucasArts 的 The Secret of Monkey Island 指明道路四年之后，King&#39;s Quest VII 终于设法摆脱了无数隐藏的死胡同，这些死胡同总是让玩罗伯塔·威廉姆斯的游戏感觉就像是在和一个虐待狂玩虚构的游戏。另一方面，玩家的死亡人数仍然很多，而且仍然毫无线索，基本上是随机的，但现在至少相对来说没有痛苦。游戏现在不再期望你每五分钟保存一次，而是让你回到你之前的点，在你愚蠢到看错东西或在错误的房间里磨蹭太久之前。事实上，这样的保存文件完全消失了；现在退出游戏会自动为您的进度添加书签。这些变化都是为了让游戏更受新玩家欢迎，希望他们能被说服尝试一下，尽管它的名字后面有不祥的罗马数字。为了进一步强调这是一款更友善、更温和的 King&#39;s Quest，它使用了一个完全简化的界面，该界面围绕一键式鼠标光标构建。更奇怪的是，Sierra 可以随时播放它的任何章节，这意味着你可以从高潮开始，如果你愿意的话，可以倒退到序幕。 （当然，此功能的真正意义在于让您观看每一章的开场电影而不必亲自接触实际游戏，如果您碰巧是通常购买每个新国王的任务的众多人之一他们最新电脑的技术演示。）但唉，在其他方面，这个最新的条目真的只是另一个国王的探索。罗伯塔·威廉姆斯 (Roberta Williams) 和她最新的学徒合作设计师罗蕾莱·香农 (Lorelei Shannon) 的作品通常是童话故事和流行文化蜉蝣的散布混合体，缺乏足够的机智或想象力，即使像模仿一样引人注目，而拼图设计却是只是因为没有死人行走的情况，所以比平时少了一些愤怒。随着游戏的进行，写作和谜题都明显变得更糟，这可能表明首席设计师对她的大系列感到越来越无聊，实际上已经在为她的下一个非常不同的游戏工作。在 King&#39;s Quest VI 之后，所有这一切都令人倍感失望，这款游戏似乎预示着一个系列终于开始更加认真地对待它的工艺。即使是《国王的探索 VII》大肆吹嘘的外观，虽然在其个别部分令人印象深刻，但总体而言却造成了相当不和谐的混乱，这是许多不同动画师团队的作品。尽管如此，King&#39;s Quest VII 于 1994 年 11 月发行时销量非常好，正如该系列中的游戏一样。与此同时，Dynamix 是 Sierra 附属工作室中最稳定的，在非冒险游戏 Aces of the Deep、Front Page Sports：Football &#39;Pro 95 和 Metaltech：EarthSiege 中表现出色。然而，最重要的是，ImagiNation 的意外收获将原本丑陋的一年变成了实际上看起来相当不错的一年：8340 万美元的收入，高于 1993 年的 5950 万美元，伴随而来的是 1200 万美元利润，而上一年则亏损 860 万美元。现在，要让派对在 1995 年继续下去取决于新产品战略。该战略的第一个重大考验是罗伯塔·威廉姆斯 (Roberta Williams) 一直在与 King&#39;s Quest VII 同步开发的游戏。 Phantasmagoria 将充分利用 Sierra 刚刚建造的 Oakhurst 声场。这是一场与任何流行天后相匹配的类型的比赛：罗伯塔，适合家庭的“冒险游戏女王”，变得黑暗而性感。 “凭借《幻境》，”塞拉的营销人员写道，“罗伯塔·威廉姆斯创造了一个写得非常棒的互动故事，充满了恐怖和悬念，并且在任何时候都完全在玩家的掌控之中。” Sierra 新声场的策划者 Bil​​l Crow 相信“Phantasmagoria 将向更广泛的游戏玩家观众开放市场。我们现在开始提供更接近普通消费者的视听体验。”换句话说，在《幻境》中，电脑游戏即将从他们的书呆子的贫民窟中爆发出来，成为有眼光的成年人的复杂娱乐。时代如何变化。今天，《幻境》或多或少是一个笑柄，是冒险游戏全动态视频时代所有错误的整洁缩影。事实上，它的一些不好的说唱有点夸张；它并不比 1990 年代中期的其他几十部类似的作品更糟糕。当然，许多其他游戏也有同样俗气的表演、同样无能的写作和同样琐碎的游戏玩法。 Phantasmagoria 以搞笑无能而闻名的现代声誉在很大程度上源于其鼎盛时期的主流地位。 Sierra 掀起的炒作浪潮，其中大部分是从罗伯塔本人口中发出的，对于像您这样的尖刻评论者来说，这真的是一种猫薄荷，他们情不自禁地把这一切都扔回了她的脸上。 “我想探索具有大量实质内容和深刻情感的游戏，”罗伯塔说。但是《幻境》非常非常不是那种游戏。如果你斜视得恰到好处，你可以看到她试图创造的东西：一个幽闭恐惧症的心理恐怖游戏，一个交互式版本的闪灵。但是，唉，没有人参与其中。 Phantasmagoria 围绕着一对名叫 Adrienne 和 Don 的艺术新婚夫妇展开，他们分别是小说家和摄影师。故事开始时，他们刚刚搬进了新英格兰海岸附近一个人烟稀少的小岛上的一座杂乱无章的老宅。我们很快了解到，他们是近一个世纪以来第一批尝试住在房子里的人。最后一个在他们面前这样做的人是一位名叫卡诺的奇异舞台魔术师，他以惊人的速度经历了年轻漂亮的妻子——他们都突然从岛上消失了，再也没有出现过。最后，卡诺本人消失了，直到我们的英雄出现为止，这就是房子。当这个地方被邪恶的灵魂所困扰时，除了他们之外，绝对没有人感到惊讶。它很快开始占据 Don 的心，让玩家控制的角色 Adrienne 试图在她的丈夫谋杀她之前解开这个谜团，就像 Carno 杀死他所有的妻子一样。\n有点令人惊讶的是，鉴于 Sierra 的大众市场愿望，他们从未尝试像 Origin Systems 当时为 Wing Commander 特许经营所做的那样，为 Phantasmagoria 聘请“知名”演员。 Adrienne 的角色由 Victoria Morsell 担任，Sierra 雄心勃勃地将其描述为“电影、电视和戏剧明星”，显然将部分部分与主演部分混淆了。尽管如此，她在任务的尴尬限制下还是做得不错。另一方面，大卫·霍姆扮演唐的角色很糟糕。在恐怖开始之前，当他试图扮演一个慈爱的丈夫却惨遭失败时，他的木讷表演显得更加令人毛骨悚然，而不是在他的头脑开始隐喻地旋转之后。其余的演员也是一个类似的混合包。 Sierra 聘请了一位名叫 Peter Maris 的导演，在他身后拍摄了大量超低预算的超低成本电影，最终花了整整四个月的时间进行拍摄。即使考虑到他的作品并不完全符合奥斯卡的水准，他对节奏的完全漠视也很奇怪。 Phantasmagoria 的七张 CD——是的，七张——充满了无休止的序列，其中 Adrienne 一块一块地拆卸砖烟囱，或者一块一块地打破木门板，或者一层一层地涂上她的早晨化妆。事实上，Adrienne 坚持在整个游戏过程中在房子里的许多镜子前停下来整理自己，我们不得不在她这样做的时候观察和等待，希望不希望这周围会发生一些有趣的事情。 （尽管罗伯塔威廉姆斯在男性主导的行业中作为女性先驱的所有身份，她的游戏对性别的看法并不总是最先进的。）所有这些，再加上笨拙、过于冗长的剧本，让游戏看起来比实际玩的几个小时要长得多。这里最好有一部（糟糕的）90 分钟的恐怖电影，其中有最好的情节推进镜头； Sierra 可以轻松地丢弃七张 CD 中的三张，而不会损失太多。大肆吹嘘的“成人”内容远没有人们说的那么简单。开幕电影包括媒体史上最不性感的性爱场面。肯·威廉姆斯说，最初是要展示阿德里安娜的裸照，但塞拉最终失去了勇气：“到了发布游戏的时候，我们对其进行了编辑，只显示了一些侧面的胸部。”鉴于它已经是多么奇怪和尴尬，我们只能感谢他们最后一刻的谨慎。游戏也不是很可怕，尽管它不时变得令人毛骨悚然——一种非常不同的品质——。这些场景出现在 Adrienne 看到很久以前发生在房子不同房间的谋杀的幻象时，或者在游戏的后期，由于玩家的失败，她自己遇到了不幸的结局.不论结果好坏， ......", "note_en": "At the conclusion of  my previous article on Sierra Online’s corporate history, we saw how Ken and Roberta Williams moved their company’s headquarters from the tiny Northern California town of Oakhurst to the Seattle suburb of Bellevue, home to Microsoft among others, in September of 1993. They did so for a mixture of personal and professional reasons, as Ken has since acknowledged. Their children were getting older, for one thing, and the schools in Oakhurst were far from world-class. Additionally, life in general as the biggest fish of all in the fishbowl of a company town that Oakhurst had become wasn’t always pleasant; for example, Ken has claimed that his kids were at times bullied by “the children of former Sierra employees who had a grudge against Sierra.” Some other former employees suspect still another reason for the move to Bellevue, one that Ken neglects to mention: the fact that Washington State had no personal income tax, while California’s was the highest in the nation.\n Still, there are no grounds to doubt that the public reason Ken gave for the move back in the day was indeed a major part of the calculation: the need to recruit the sort of seasoned business talent that could take Sierra to the next level. The company’s annual revenues had grown every single year since 1987, more often than not substantially, and this was of course wonderful. But less wonderful was the fact that profits had never been as high as that progression would imply; Sierra had a knack for spending almost every dime they earned. Of late in fact, the bottom line had dipped sharply into loss territory even as revenues continued their steady climb. Under pressure from his shareholders, Ken Williams realized that he had to find a way to make his company start to pay off. He believed that doing so must entail assembling the kind of top-flight management team which could only be found in a big city. He’d been seeking a rock star of a chief financial officer for a long time from Oakhurst to no avail. Ken Williams:\n I had hired a San Francisco-based company, Heidrick &amp; Struggles, to lead the search, and after months of getting nowhere I called my contact at Heidrick in frustration. “Why do you keep sending me B and C level candidates?” I asked. I was tired of having my time wasted interviewing candidates who were not at the level I was seeking. The answer came back without hesitation: “Ken, you’re aren’t getting it. No A player wants to move to Oakhurst.”\n Nine months after the move to Bellevue, Ken finally found his rock star in the form of one Mike Brochu, a financial whizz who had spent the last nineteen years working for Burlington Resources. The man whom Ken still describes as “probably the best hire I ever made” was a garrulous Texan who “inspired confidence in everyone around him.” Not coincidentally, Sierra began to display a newly hard-nosed, bottom-line-focused attitude toward their business from virtually the moment of his arrival. As one of his first projects, Brochu led the negotiations that resulted in the sale of  The ImagiNation Network, Sierra’s visionary but perpetually money-losing online-gaming service, to AT&amp;T for $40 million in cash in November of 1994.\n Meanwhile Sierra implemented a significant shift in their product-development strategy. For many years now, the heart of the company’s identity had been a set of long-running adventure-game series, most of which worked the word “quest” somewhere into their title. Dodgy from the standpoints of both writing and design though they sometimes were, they’d all displayed enough lovable qualities to worm their way into fans’ hearts. I’ve described in earlier articles how Sierra fandom could feel like belonging to a big extended family. These games, then, were the cousins whom you could always expect to see at the family reunion every couple of years, dressed perhaps a bit differently than last time around but always the same person at bottom. They were comfortingly predictable, and that was exactly how the fans liked them.\n But for all that these ramshackle, puzzle-heavy adventure games were good at cementing the loyalty of the already converted, they were less equipped to unleash the sort of explosive growth Sierra was now after. It was a pivotal moment in the history of the personal computer, as Ken Williams and Mike Brochu well recognized. In 1994, more home computers would be sold than televisions, as consumers, tempted by the ease of use of  Microsoft Windows, the magic of multimedia, and rumors of a thing called the World Wide Web, jumped onboard the computing bandwagon in staggering numbers. These people didn’t know a  King’s Quest from an  Ultima. Reaching them would require a different sort of game: fresher,  hotter in the Marshall McLuhan sense, more in tune with what they were seeing on television and at the movies. It seemed like it was now or never for Sierra to capture their interest, even if it meant that some of the old fans were left feeling a bit abandoned.\n So, Sierra’ new Bellevue management team took a hard look at their existing series in order to decide which were expendable and which were not.   King’s Quest, the company’s longstanding flagship series, which already enjoyed a measure of name recognition outside the traditional computer-gaming ghetto, would have been an obvious keeper even if it hadn’t been the baby of Roberta Williams.   Leisure Suit Larry also had proven appeal with non-traditional demographics, and was thus also a no-brainer to keep around.   Space Quest was an edge case, but the managers decided to green-light one more game, if only to throw a bone to the old-school fans. But   Police Quest would get revamped from a line of adventure games into a line of tactical 3D action games, while   Quest for Glory would get the axe entirely. Going forward, the main focus would be on bigger-budget adventures employing filmed human actors, for which Sierra was now building their own sound stage down in Oakhurst at considerable cost. They would make fewer of this new type of adventure, but each of them would be a flashy, high-fidelity production, able to appeal to a mass market weaned on big-screen televisions and CD players. The idea was to make the release of each Sierra adventure from now on a real  event.\n Unfortunately, the transition from one product strategy to another came with a pitfall: it would take some time to bring it off, meaning that 1994 would be an unusually quiet year in terms of new games. And that reality, combined with the new management team’s more hard-nosed attitude, meant that some of the folks in Oakhurst must lose their jobs. Among them were Corey and Lori Cole, the husband-and-wife team behind  Quest for Glory, who saw their roles cancelled along with the fifth game in their series, the most impressive of all the series in the Sierra lineup in terms of design ambition and innovation. Corey recalls a scene which made it all too clear to everyone present that Sierra was now being run as a business, not a family: “All employees in the meeting were handed envelopes; about half of them contained ‘pink slips’ notifying them that they no longer worked for Sierra. Those employees were escorted back into the building and watched as they retrieved personal belongings from their desks.” Layoffs are never easy. Corey especially remembers the sight of Gano Haine, who had worked on Sierra’s  two  EcoQuest games and  Pepper’s Adventures in Time, standing in the parking lot crying: “Sierra had been her dream, and she was so thrilled to have gotten the job there.”\n During this year of wrenching transition, Sierra released just one new Oakhurst-built adventure game, making it their least prolific year in that respect in almost a decade. Thankfully for the bean counters, the game in question was the latest installment in Sierra’s most bankable adventure series of them all.  King’s Quest VII: The Princeless Bride was a typical entry in a series that had been Sierra’s ever-evolving technological showpiece since 1984. But then, that description in itself implies innovation on at least a technical front, and this the new entry certainly delivered.\n  Although it did not employ filmed actors,  King’s Quest VII was indicative in another way of Sierra’s new direction: rather than an interactive movie, it aimed to be an interactive cartoon worthy of comparison to the likes of Disney, an ambition which required it to look beyond Sierra’s own stable of talented in-house artists for some of its visuals. Ken Williams first reached out to an up-and-coming animation studio known as Pixar. He even spoke personally with Steve Jobs, Pixar’s chairman and majority owner, but in the end the studio proved to be simply too busy working on  Toy Story, their first full-length feature film, to take on this task as well. So, Sierra ended up contracting sequences out to no fewer than four other outside animation studios, in addition to employing their own artists to create what truly was an audiovisual extravaganza by the standards of its time.  King’s Quest VII went full Disney, as Charles Ardai described in his review for  Computer Gaming World magazine.\n I tried this game on my mother (a big fairy-tale fan), who asked, “Is that a game from Disney?” When I replied in the negative, she said, “But they’re trying to do Disney, right?”\n They are indeed. From the opening frames, where drops of dew in an enchanted forest drop on the tummy of an enchanted ladybug, to the scene a few seconds later in which lovely Princess Rosella sings her royal heart out in a tuneful paean to her about-to-be-lost adolescence, King’s Quest VII exudes Disney-like quality from each of its cel-animated poses.\n Every frame is beautiful, every line is neat and pert, the camera soars and glides, and the notes of the musical score tinkle out in bounding effervescence like the fizz out of a bottle of soda pop. This is the Disney of The Little Mermaid or Beauty and the Beast, or Aladdin, if you deduct that film’s adult-targeted sense of irony. It’s the Disney of The Sword in the Stone and of Alice in Wonderland, light and fluffy as a soufflé. It’s not the Disney of Bambi or Snow White; here even the menaces are adorable bits of whimsy. If the villains ever frighten, it’s only for a brief time, and then everyone gets together again for one more song.\n It matters not at all that the game is from Sierra rather than Disney. It is true to the Disney spirit.\n Along with the mouth-watering new look, the game showed some welcome design evolution over Robera Williams’s earlier work. Four years after LucasArts’s   The Secret of Monkey Island had pointed the way,  King’s Quest VII finally managed to free itself from the countless hidden dead ends that had always made playing a Roberta Williams game feel like playing make-believe with a sadist. Player deaths, on the other hand, were still copious, and still so unclued as to be essentially random, but were now at least relatively painless. Rather than expecting you to save every five minutes, the game was now kind enough to return you to the point you were at before you were so foolish as to look at the wrong thing or dilly-dally in the wrong room a second too long. In fact, save files as such disappeared altogether; exiting the game now automatically bookmarked your progress.\n  These changes all existed in the name of making the game more welcoming to brand new players, out of the hope that they could be convinced to give it a try despite the ominous Roman numeral after its name. To further emphasize that this was a kinder, gentler  King’s Quest, it used a radically simplified interface built around a one-click-does-it-all mouse cursor. More oddly, Sierra made it possible to play any of its chapters at any time, meaning you could start with the climax and work backward to the prologue if you were so inclined. (The real point of this feature, of course, was to let you watch each chapter’s opening movie without having to get your hands dirty with the actual game, if you happened to be one of the many people who typically bought each new  King’s Quest as a tech demo for their latest computer.)\n But alas, in other ways this latest entry really was just another  King’s Quest. The writing from Roberta Williams and Lorelei Shannon, her latest apprentice co-designer, was the usual scattershot blend of fairy-tale and pop-culture ephmera, lacking sufficient wit or imagination to be all that compelling even as pastiche, while the puzzle design was made less infuriating than usual only by the lack of dead-player-walking situations. Both the writing and the puzzles got noticeably worse as the game wore on, evidence perhaps of a lead designer who was feeling increasingly bored with her big series, and was in fact already working on her next, very different game. All of this was doubly disappointing coming on the heels of  King’s Quest VI, a game which had seemed to herald a series that was at last beginning to take its craft a bit more seriously. Even the much-vaunted look of  King’s Quest VII, although impressive in its individual parts, made for a rather discordant jumble when taken in the aggregate, being the work of so many different teams of animators.\n Nevertheless,  King’s Quest VII sold very well upon its release in November of 1994, as games in the series always did. Meanwhile Dynamix, the most consistent of Sierra’s subsidiary studios, delivered solid performers in the non-adventure games   Aces of the Deep,   Front Page Sports: Football ‘Pro 95, and   Metaltech: EarthSiege. Most of all, though, it was the ImagiNation windfall that turned what would otherwise have been an ugly year into one that actually looked pretty good on the bottom line: $83.4 million in revenues, up from $59.5 million in 1993, with an accompanying $12 million profit, in contrast to an $8.6 million loss the previous year. Now it was up to the new product strategy to keep the party going in 1995.\n The first big test of that strategy was to be the game that Roberta Williams had been working on concurrently with  King’s Quest VII.  Phantasmagoria would take full advantage of the Oakhurst sound stage Sierra had just built. It was to be a play against type worthy of any pop diva: Roberta, the family-friendly “queen of adventure gaming,” was going  dark  and  sexy. “With  Phantasmagoria,” wrote Sierra’s marketers, “Roberta Williams has created a superbly written interactive story, fraught with horror and suspense, and totally in the player’s control at all times.” Bill Crow, the mastermind of Sierra’s new sound stage, believed that “ Phantasmagoria is going to open the market to a much broader audience of game players. We’re now starting to deliver an audiovisual experience that’s much closer to what the average consumer can relate to.” With  Phantasmagoria, in other words, computer games were about to burst out of their nerdy ghetto to become sophisticated entertainments for discerning adults.\n How times do change. Today  Phantasmagoria is more or less a laughingstock, a tidy microcosm of everything that was wrong with the full-motion-video era of adventure games. In truth, some of its bad rap is a bit exaggerated; it’s not really any worse than dozens of other similarly dated productions of the mid-1990s. Certainly plenty of other games had equally cheesy acting, equally clueless writing, and equally trivial gameplay.  Phantasmagoria‘s modern reputation for hilarious ineptitude stems to a large extent from its mainstream prominence in its heyday. The wave of hype that Sierra unleashed, much of it issuing from the mouth of Roberta herself, is catnip for snarky reviewers like yours truly, who can’t help but throw it all back in her face. “I want to explore games with a lot of substance and deep emotions,” Roberta said. But  Phantasmagoria is so very, very much not that kind of game. If you squint just right, you can see what she was trying to create: a game of claustrophobic psychological horror, an interactive version of  The Shining. But alas, nobody involved had the chops to pull it off.\n Phantasmagoria revolves around a couple of artsy newlyweds named Adrienne and Don, a novelist and a photographer respectively. As the story begins, they’ve just moved into a rambling old mansion on a sparsely inhabited island off the coast of New England. They’re the first people to attempt to live in the house, we soon learn, in almost a century. The last person to do so before them was a strange stage magician named Carno the Magnificent, who went through pretty young wives at a prodigious rate — all of them abruptly disappearing from the island, never to be seen again. In the end, Carno himself disappeared, and that was that for the house until our heroes turn up. It comes as a surprise to absolutely no one except them when the place turns out to be haunted by a malevolent spirit. It quickly begins to take over the mind of Don, leaving Adrienne, the character the player controls, to try to sort out the mystery before her husband murders her like Carno killed all of his wives.\n Somewhat surprisingly in light of Sierra’s mass-market aspirations, they never attempted to hire “name” actors for  Phantasmagoria in the way that Origin Systems was  doing at the time for the  Wing Commander franchise. The role of Adrienne went to Victoria Morsell, whom Sierra rather ambitiously described as a “film, TV, and theater star,” having apparently confused bit parts with starring ones. Still, she does a decent job within the awkward constraints of her task. David Homb in the role of Don, on the other hand, is just awful; his wooden performance comes off as more creepy before the horror starts, when he’s trying to play a loving husband and failing at it abjectly, than it does after his head starts metaphorically spinning around. The rest of the cast is a similarly mixed bag.\n Sierra hired a director named Peter Maris, with a long run of schlocky ultra-low-budget films behind him, for a shoot that wound up taking fully four months. Even given that his oeuvre wasn’t exactly of Oscar caliber, his complete disregard for pacing is bizarre.  Phantasmagoria‘s seven CDs — yes,  seven — are filled with interminable sequences where Adrienne disassembles a brick chimney piece by piece, or breaks through a wooden door board by board, or applies her morning makeup layer by agonizing layer. Indeed, Adrienne insists on stopping and preening herself at each of the many mirrors in the house throughout the game, and we’re forced to watch and wait while she does so, hoping against hope that something interesting might happen this around. (For all of Roberta Williams’s status as a female pioneer in a male-dominated industry, her games’ view of gender isn’t always the most progressive.) All of this, combined with the clumsy, overly wordy script, makes the game seem much longer than the few hours it actually takes to play. There’s a (bad) 90-minute horror flick worth of plot-advancing footage here at the best; Sierra could easily have ditched three of the seven CDs without losing much at all.\n The much-vaunted “adult” content is rather less than it’s cracked up to be. The opening movie includes the least sexy sex scene in the history of media. Ken Williams says that it was originally to have shown Adrienne topless, but Sierra lost their nerve in the end: “When it came time to release the game, we edited it to only show some side boob.” Given how weird and awkward it already is, we can only be thankful for their last-minute fit of prudishness.\n Nor is the game remotely scary, although it does get gruesome — a very different quality — from time to time. These sequences come when Adrienne is visited by visions of the murders that took place long ago in the different rooms of the house, or, in the latter stages of the game, when she herself meets an unfortunate end thanks to a failure on the player’s part. For better or for worse, \n......", "posttime": "2021-08-07 02:18:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "支付,sierra", "title": "让塞拉支付", "title_en": "Making Sierra Pay", "transed": 1, "url": "https://www.filfre.net/2021/08/making-sierra-pay/", "via": "", "real_tags": ["支付", "sierra"]}, {"category": "", "categoryclass": "", "imagename": "491de32e8341680a61c0686c7452c067.jpg", "infoid": 1071819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何人在会所上说什么都不重要。会所的整个点是有目共睹的。谁说话或他们说什么都无关紧要。重要的是他们被视为地位高的人。当没有人可以亲眼看到时，会所便声名鹊起。每个人都被困在自己的家中。对某个群体享有很高声誉、信誉或价值的人无法亲自展示自己的地位。他们不能当面吹嘘他们所做的工作，表明他们有多聪明，或者告诉你他们在一些很酷的公司中的角色。俱乐部是一种与其他地位高的人一起被看到的方式，尤其是在科技和加密等领域。现在可以再次亲眼看到地位高的人，他们在会所上花费的时间减少了。地位较低的人只能试图让别人看到他们。如果没有高地位的人，Clubhouse 就没有达到帮助人们被人看到的目的。这是一种货物崇拜：地位低下的人重新创造地位高的人的行为，在他们离开后，认为这会使他们成为高地位的人。状态游戏的遗迹在设计中。甚至在您进入房间之前，Clubhouse 就会向您展示您关注的人。用户可以根据房间的大小、扬声器的状态以及他们关注的任何人的状态来判断房间的状态。地位高的人通常最受关注，因此他们引导发现。如果没有这些人，发现就会被玩弄，变得不那么重要。每个房间都有状态游戏在里面玩。如果您查看其他实时社交应用程序，观众通常会做一些诸如聊天或反应之类的事情。在Clubhouse上，任何不说话的人除了听和看房间里的其他成员外，无事可做。当您查看屏幕时，您会看到每个房间都是一个层次结构。重要的人在上，他们的支持在中，观众在下。重要人物上台。它是被看见的最高形式。在大房间里，如果你在舞台上，即使你不说话，每个人的注意力都在你身上。这些人实际上是在顶部并占据最多的空间，最大的化身只有三排。他们的地位因与地位高的人在一起而增加。这是寻求地位的会所用户的最终目标。层次结构的下一个级别是状态支持组。它是演讲者跟随的人群的指定区域。如果有地位高的人在场，那说明台上的人一定是地位很高的人。它们为舞台上的人提供了额外的可信度，并帮助更多人发现房间。\n例如，一个创业公司创始人在一个房间里讲话，而一位著名的风险投资家在观众席中。如果该 VC 了解这家公司，则不会共享任何新信息，但是这样做是有条件的。在那里有利于演讲者（创始人）和地位支持成员（VC）的地位。风险投资家的权威会影响演讲者，使他们看起来更合法。层次结构中的最低层是观众。这些人的等级很低，他们很少在大房间里看到。任何想被人看到并获得地位的人都应该尝试离开这个区域。人们来到这里是因为他们对对话真正感兴趣，或者试图提升等级以便获得地位。地位低的观众很少有机会进入大房间。他们是上层人士的地位饲料。现在，地位高的人大部分都走了，地位低的人填补了各个层次，并试图重新创造动态。 Clubhouse的设计还是一样的。人们试图在受欢迎的房间里出现在舞台上。主办方尽量优化他们的房间被推荐。用户用他们关心的兴趣和话题来填充他们的生物。所有这一切都被稀释了，因为有地位的人已经不在了。人们想要的地位和认可并不存在。拥有大量观众的“必听”房间较少。房间更小，由兴趣或话题驱动，而不是所涉及的人。由您关注的人驱动的推荐算法不太相关。以下列表中越来越多的人是活跃在 Clubhouse 的低地位人士，而不是来自现实世界的高地位人士。现在任何人都可以加入，包括 Android 用户，作为邀请和 iPhone 启动的排他性正在逐渐消失。会所不再是人们所看到的高地位场所。一个说明这一点的方法是害怕错过俱乐部会所的恐惧下降。很少有人认为他们不在那里就错过了任何东西。与人们购买邀请、将邀请发送给他们最亲密的朋友、在平台上花费数小时以及在社交媒体上谈论它的高峰期相比，Clubhouse 不再像以前那样具有魔力。现在可以在现实生活中的专属场所看到地位高的人在一起。面对面的派对和活动是无法与之竞争的。似乎所有其他大型科技公司都在模仿 Clubhouse，这也无济于事。每个人都想重现会所的魔力。会所能否重现成为显赫地位的魔力？他们可以试试。对于每一类人，不仅在技术和加密领域，他们必须成为与其他高地位人士一起看到的“地方”。地位高的人一定想展示自己的地位，并与平台上的其他人分享。如果发生这种情况，低地位的货物邪教成员将获得他们正在寻找的地位提升。\n另一种选择是拥抱地位较低的人。许多有趣的房间和行为发生在大房间之外。诸如消息传递之类的最新版本暗示他们正在远离仅是一个“可以看到的地方”。该应用程序有潜力成为大众音频社交网络。这很可能是一直以来的计划，他们幸运地打破了“值得一看的地方”的消遣。不管怎样，人们总是想被人看到。会所暂时抓住了这种需求。要想像以前想象的那样成功，他们需要更大规模地再做一次，或者接受地位较低的人的行为。如果没有，Clubhouse 的货物崇拜将继续。感谢来自 Foster 的 Jesse Germinario、Steven Ovadia、Padmini Pyapali、Diana Klatt、Kat Dee、Stacey King Gordon 和 Christine Cauthen 的反馈。", "note_en": "Nothing anyone says on Clubhouse matters. The whole point of Clubhouse is to be seen. It doesn’t matter who speaks or what they say. It matters that they are seen as high status people.\n Clubhouse rose to prominence when no one could be seen in person. Everyone was stuck in their homes. Someone with a high reputation, credibility, or value to a group couldn’t flex their status in person. They couldn’t brag in person about the work they were doing, signal how smart they were, or tell you about their role at some cool company. Clubhouse was a way to be seen with other high status people, especially in circles like tech and crypto.\n Now that high status people can be seen in person again, they are spending less time on Clubhouse. Lower status people are left trying to be seen amongst themselves. Without high status people, Clubhouse is not serving its purpose of helping people be seen. It is a cargo cult: low status people recreating the actions of high status people, after they have left, thinking it will cause them to be high status.\n  The relics of the status games are in the design. Even before you enter a room, Clubhouse shows you the people you follow in it. A user can judge the status of a room based on its size, the status of the speakers, and the status of any people they follow. High status people are often the most followed so they guide the discovery. Without these people, discovery is gamed and less relevant.\n Each room has status games being played within it as well. If you look at other live social apps, audiences generally do something like chat or react. On Clubhouse, anyone not talking has nothing to do except listen and look at other members of the room. When you look at the screen, you’ll see every room is a hierarchy. The important people on top, their support in the middle, and the audience on the bottom.\n The important people are on stage. It is the highest form of being seen. In big rooms, if you are on stage, everyone’s attention is on you, even if you aren’t speaking. These people literally are at the top and take up the most space, having the largest avatars only three to a row. Their status increases by being there with high status people. This is the ultimate goal of a status-seeking Clubhouse user.\n The next level of the hierarchy is the status support group. It is a designated zone for the group of people who the speakers follow. If high status people are here, it means the people on stage must be very high status. They provide extra credibility for those on stage and help the room get discovered by more people.\n For example, a startup founder is speaking in a room and a prominent venture capitalist is in the audience. If that VC knows the company, there isn’t any new information going to be shared, but there is status to doing it. It is beneficial to the status of both the speaker (founder) and the status support member (VC) to be there. The venture capitalist’s authority rubs off on the speakers, making them seem more legitimate.\n  The lowest in the hierarchy is the audience. These people are so far down the hierarchy they are rarely ever seen in large rooms. Anyone who wants to be seen and gain status should try to leave this area. People are here because they are truly interested in the conversation or are trying to move up the hierarchy so they can gain status. Low status audience members rarely get a chance to engage in big rooms. They are status fodder for people up the hierarchy.\n  Now that the high status people are mostly gone, lower status people fill all levels and try to recreate the dynamics. The design of Clubhouse is still the same. People try to be seen on stage in popular rooms. Organizers try to optimize their room to be recommended. Users fill their bio with interests and topics they care about. All of this is diluted because the people with status aren’t there anymore. The status and recognition people want is not there.\n There are fewer “must-listen” rooms with massive audiences. Rooms are smaller and driven by interests or topics, rather than the people involved. The recommendation algorithm, which is driven by people you follow, is less relevant. Following lists are increasingly filled with low status people who are active on Clubhouse rather than high status people from the real world. The exclusivity from launching as invite and iPhone only is wearing off now that anyone can join including Android users. Clubhouse is not the high status place to be seen anymore.\n A way to illustrate this is the decline in fear of missing out on Clubhouse. Few people think they are missing anything by not being there. Compared to its peak when people were buying invites, sending them to their closest friends, spending hours on the platform, and talking about it on social media, Clubhouse doesn’t have the same magic it once did.\n High status people can now be seen together in exclusive places in real life. In person parties and events are impossible to compete with. It also doesn’t help that Clubhouse is being copied by seemingly every other big tech company. Everyone wants to recreate the magic Clubhouse had.\n Can Clubhouse ever recreate the magic of being a high status place to be seen? They can try. For every category of people, not only in tech and crypto, they must become “the place” to be seen with other high status people. High status people must want to flex their status and share it with others on the platform. If this happened, the low status cargo cult members would gain the status boost they’re looking for.\n The other option is to embrace the lower status people. Many interesting rooms and behaviours are happening outside the big ones. Recent releases like  messaging give hints they are moving away from only being a “place to be seen.” The app has the potential to be the mass audio social network. This was likely the plan all along, and they had a lucky break with the “place to be seen” diversion.\n Either way, people always want to be seen. Clubhouse, for a moment, captured that need. To succeed as once thought, they need to do it again at a larger scale or embrace the behaviours of lower status people. If not, the cargo cult of Clubhouse will continue.\n  Thanks to  Jesse Germinario,  Steven Ovadia,  Padmini Pyapali,  Diana Klatt,  Kat Dee, Stacey King Gordon, and Christine Cauthen from  Foster for the feedback.", "posttime": "2021-08-07 02:17:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "货物,cargo,地位", "title": "会所是一种货物崇拜", "title_en": "Clubhouse Is a Cargo Cult", "transed": 1, "url": "https://ianvanagas.com/2021/08/06/clubhouse-is-a-cargo-cult/", "via": "", "real_tags": ["货物", "cargo", "地位"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个人都需要一部电话。不是每个人都想被监视。使用 CalyxOS 收回您的隐私。 CalyxOS 是一种 Android 移动操作系统，可将隐私和安全置于日常用户的手中。此外，主动安全建议和自动更新让您无需再猜测个人数据的隐私性。 ✌️ microG 取代了 Google Play 服务的一些功能，同时保持了更多的匿名性和隐私性。完全可选。我们最近进行了一项日记研究和一组用户访谈，并综合了对我们用户是谁的基本理解。下载研究报告！下载 PDF 八月更新在这里。它与 Special Pixel 4a 版本 (2.7.1) 基本相同，唯一的补充是安全更新。官方 CalyxOS 版本使用我们的私钥签名。无线 (OTA) 更新也使用相同的密钥签名，一旦安装操作系统，只能安装使用相同密钥签名的更新。\n查看更多 CalyxOS 是一个由 Calyx Institute 赞助的协作开源应用研究项目，Calyx Institute 是一家 501(c)(3) 非营利组织，致力于为所有人提供隐私和安全。现在加入", "note_en": "Everyone needs a phone. Not everyone wants to be spied on. Reclaim your privacy with CalyxOS.\n  CalyxOS is an Android mobile operating system that  puts privacy and security into the hands of everyday users. Plus, proactive security recommendations and automatic updates take the guesswork out of keeping your personal data personal.\n  ✌️  microG replaces some functions of Google Play Services while maintaining much more anonymity and privacy. Completely Optional.\n    We recently conducted a diary study and a set of user interviews and synthesized a baseline understanding of who our users are. Download the research report!\n  Download PDF\n  The August update is here. It’s mostly identical to the Special Pixel 4a release (2.7.1), with the only addition being the security updates.\n  The official CalyxOS builds are signed with our private keys.Over-the-air (OTA) updates are also signed with the same keys, and once you install the OS, only updates signed with the same key can be installed.\n    See more\n  CalyxOS is a collaborative open source applied research project sponsored by the Calyx Institute, a 501(c)(3) non-profit dedicated to making privacy and security available for all.\n  Join Now", "posttime": "2021-08-07 02:16:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,谷歌,google,安卓,de", "title": "CalyxOS – 去谷歌的安卓替代品", "title_en": "CalyxOS – De-Googled Android Alternative", "transed": 1, "url": "https://calyxos.org/", "via": "", "real_tags": ["android", "谷歌", "google", "安卓", "de"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 诺维科夫自洽原理，也称为诺维科夫自洽猜想和拉里·尼文历史守恒定律，是俄罗斯物理学家伊戈尔·德米特里耶维奇·诺维科夫在 1980 年代中期提出的一项原理。诺维科夫打算用它来解决时间旅行中的悖论问题，这在理论上在广义相对论的某些解决方案中是允许的，这些解决方案包含所谓的闭合类时曲线。该原则断言，如果存在会导致悖论或对过去的任何“改变”的事件，那么该事件的概率为零。因此，不可能产生时间悖论。物理学家早就知道，广义相对论的一些解包含封闭的类时曲线——例如哥德尔度量。诺维科夫在 1975 年和 1983 年写的书中讨论了闭合类时曲线 (CTC) 的可能性，[1] 提出了只有自洽的时间倒退才会被允许的观点。 [2] 在 1990 年 Novikov 和其他几人的一篇论文“具有闭合类时曲线的时空柯西问题”中，[3] 作者指出：作者认为不可接受的唯一类型的因果关系违反是体现在科学中的——时光倒流，杀死年轻的自己（“改变过去”）的小说概念。几年前，我们中的一个人（Novikov 10）简要考虑了 CTC 可能存在的可能性，并认为它们不能导致这种类型的因果关系违反：Novikov 认为，CTC 上的事件已经保证是自洽的；它们以自我调整、周期性、自洽的方式围绕一条闭合曲线相互影响。其他作者最近也得出了同样的观点。我们将在自洽原则中体现这一观点，该原则指出，在真实宇宙中局部发生的物理定律的唯一解决方案是全局自洽的解决方案。只有当局部解可以扩展到（不一定是唯一的）全局解的一部分时，这个原理才允许建立物理方程的局部解，全局解在时空的整个非奇异区域中都有很好的定义。 1990 年这篇论文的合著者包括 Kip Thorne、Mike Morris 和 Ulvi Yurtsever，他们在 1988 年通过他们的论文“虫洞、时间机器和弱能量”重新激起了对广义相对论中时间旅行主题的兴趣条件”，[4] 表明一个新的广义相对论解决方案被称为可穿越的虫洞可以导致封闭的类时曲线，并且与以前包含 CTC 的解决方案不同，它不需要整个宇宙的不切实际的条件。在与 1990 年论文的另一位合著者约翰弗里德曼讨论后，他们说服自己，时间旅行不一定会导致无法解决的悖论，无论通过虫洞发送的物体是什么。 : 509 作为回应，物理学家约瑟夫·波尔钦斯基给他们写了一封信，认为人们可以通过使用一个潜在的自相矛盾的思想实验来避免自由意志的问题，该实验涉及通过虫洞及时送回台球。在 Polchinski 的场景中，台球以一个角度射入虫洞，如果它继续沿着它的路径前进，它将以正确的角度从过去退出，与之前的自己碰撞，将它撞出轨道并阻止它从一开始就进入虫洞。索恩在 1994 年将这种情况称为“波钦斯基悖论​​”。：510–511 在考虑这种情况后，加州理工学院（索恩任教的地方）的两名学生费尔南多·埃切维里亚 (Fernando Echeverria) 和冈纳·克林克哈默 (Gunnar Klinkhammer) 找到了解决该问题的方法，但设法避免了任何不一致。在修改后的场景中，来自未来的球以与产生悖论的球不同的角度出现，并给年轻的自己一击，而不是将它完全从虫洞中撞开。这一击改变了它的轨迹恰到好处的程度，这意味着它会以所需的角度回到过去，为年轻的自己提供必要的扫视打击。 Echeverria 和 Klinkhammer 实际上发现有不止一种自洽的解决方案，在每种情况下，斜视的角度略有不同。索恩 (Thorne) 和罗伯特·福特 (Robert Forward) 后来的分析表明，对于台球的某些初始轨迹，实际上可能存在无限数量的自洽解。 : 511–513\nEcheverria、Klinkhammer 和 Thorne 在 1991 年发表了一篇讨论这些结果的论文； [7] 此外，他们报告说，他们曾试图查看是否可以找到没有自洽扩展的台球的任何初始条件，但无法这样做。因此，每个可能的初始轨迹都存在自洽的扩展是合理的，尽管这尚未得到证实。 [8] : 184 这仅适用于违反年代学的时空区域之外的初始条件，[8] : 187 以柯西视界为界。 [9] 这可能意味着诺维科夫自洽原则实际上并没有对时空区域之外的系统施加任何限制，在时空区域可以进行时间旅行，而只是在其内部。即使可以在柯西视界之外的任意初始条件下找到自洽扩展，但发现同一初始条件可能存在多个不同的自洽扩展——事实上，Echeverria 等人。为他们分析的每个初始轨迹发现了无限数量的一致扩展[8]：184——可以被视为有问题，因为经典上似乎没有办法决定物理定律将选择哪个扩展。为了解决这个困难，Thorne 和 Klinkhammer 使用量子力学分析了台球场景：514-515 仅使用一致的扩展对历史（路径积分）进行量子力学求和，并发现这导致了一个明确定义的每个一致扩展的概率。具有封闭类时曲线的时空中柯西问题的作者写道： 在量子力学中（在经典时空中）强加自洽原理的最简单方法是通过历史求和公式，其中包括所有那些，而且只有那些，自洽的历史。事实证明，至少在形式上（对和的收敛等问题取模），对于柯西视界之前台球的初始非相对论波函数的每次选择，这样的历史和产生独特的、自洽的概率所有后续测量集的结果。 ...我们更普遍地怀疑，对于经典虫洞时空中的任何量子系统，具有稳定的柯西视界，所有自洽历史的总和将给出所有测量结果集的唯一、自洽概率一个人可能会选择制作。诺维科夫一致性原则假设了关于什么样的时间旅行是可能的某些条件。具体来说，它假设要么只有一个时间线，要么无法访问任何替代时间线（例如量子力学的多世界解释所假设的时间线）。鉴于这些假设，时间旅行不得导致不一致结果的约束可以仅仅被视为一种同义反复，一种不言而喻的真理，不可能是错误的。然而，诺维科夫自洽原则旨在超越历史必须一致的声明，做出额外的非平凡假设，即宇宙在涉及时间旅行的情况下遵循与在空间区域中所做的相同的局部物理定律——缺乏闭合类时曲线的时间。这在上述“具有闭合类时曲线的时空中的柯西问题”中得到了澄清，[3] 作者写道：当考虑以下替代方案时，自洽原则并非完全重言式变得清晰：物理学可能允许 CTC；当 CTC 发生时，它们可能会触发我们以前从未见过的新型局部物理学。 ... 自我一致性原则旨在排除此类行为。它坚持认为局部物理学受与我们在没有 CTC 的情况下处理的相同类型的物理定律所支配：这些定律需要领域的自洽单值。本质上，自洽原理是没有新物理学的原理。如果人们从一开始就倾向于忽视或贬低新物理学的可能性，那么人们就会认为自洽是一项微不足道的原则。自洽原则的假设可以扩展到涉及智能时间旅行者以及台球等非智能物体的假设场景。 “具有封闭类时曲线的时空柯西问题”的作者在论文的结论中评论了这个问题，写道：\n如果允许 CTC，并且如果上述理论物理学与它们相适应的观点被证明或多或少是正确的，那么这对人类和其他智能生物的自由意志的哲学概念意味着什么？这当然意味着智慧生物无法改变过去。这种变化不符合自洽原则。因此，任何穿过虫洞并试图改变过去的生物都会被物理定律阻止进行改变；即，存在的“自由意志”将受到约束。尽管这种约束比遵循标准的、局部的物理定律的自由意志约束具有更全局的特征，但对我们来说，这种约束比标准物理定律强加的更严格对我们来说并不明显。 [3] 根据一致性猜想，任何复杂的人际互动都必须自洽地进行，这样才不会出现悖论。这就是决议。这意味着，如果从字面上理解，如果时间机器存在，就不会有自由意志。如果你回到过去，你不能让自己杀死年轻的自己。你可以共存，出去喝杯啤酒，一起庆祝你的生日，但不知何故，情况会决定你不能以一种导致时间悖论的方式行事。诺维科夫用另一个论点支持这个观点：物理学每天都在限制你的自由意志。您可能希望自己飞行或穿过混凝土墙，但重力和凝聚态物理学规定您不能。诺维科夫问，为什么对时间旅行者施加的一致性限制有什么不同？ [10] 时间循环逻辑，由机器人学家和未来学家汉斯·莫拉维克 (Hans Moravec) 创造，[11] 是一个假设的计算系统，它利用诺维科夫自洽原理，比使用图灵机的计算复杂性标准模型更快地计算答案.在这个系统中，计算机通过时间向后发送计算结果，并依靠自洽原则强制发送的结果是正确的，前提是机器能够可靠地接收来自未来的信息，并提供算法和底层机制形式上是正确的。如果时间旅行机制或算法不能保证准确，仍然可能产生不正确的结果或没有结果。制作一个接受输入的计算框，该输入代表某个问题的近似解，并产生一个改进的近似输出。按照惯例，您会重复应用这样的计算有限次数，然后满足于更好但仍然近似的结果。给定适当的负延迟，其他事情也是可能的：[...] 函数每次迭代的结果都被及时带回以作为“第一”近似值。一旦机器被激活，一个所谓的 F 的“定点”，一个产生相同输出的输入，通常表示一个完美的答案，立即和稳定地出现（非常巧合！）。 [...] 如果迭代不收敛，即如果 F 没有固定点，则计算机输出和输入将关闭或悬停在不太可能的中间状态。物理学家 David Deutsch 在 1991 年表明该计算模型可以在多项式时间内解决 NP 问题，[12] 和 Scott Aaronson 后来扩展了这一结果以表明该模型也可以用于在多项式时间内解决 PSPACE 问题。 [13] [14] Deutsch 表明，具有负延迟的量子计算 - 向后时间旅行 - 仅产生自洽的解决方案，并且违反年表的区域强加了通过经典推理不明显的约束。 [12] 研究人员在 2014 年发表了一项模拟，他们声称已经用光子验证了 Deutsch 的模型。 [15] 然而，在 Tolksdorf 和 Verch 的一篇文章中表明，在根据相对论量子场论描述的任何量子系统中，即使在不允许闭合类时曲线的时空上，多伊奇的自洽条件可以满足任意精度，铸造怀疑多伊奇的模型是否真的是模拟广义相对论意义上的闭合类时曲线的量子过程的特征。 [16] 哈利波特与理性方法。在 Eliezer Yudkowsky 关于理性的论述中，Harry 试图用他的 Time Turner 来影响过去，并得出适用于 Novikov self-consistency 原则的结论。 ^ 请参阅第 10 页的注释 10。弗里德曼等人的 42，“具有闭合类时曲线的时空柯西问题”\n^ 上页。 Novikov 的《宇宙演化》（1983）的第 169 卷，这是他的俄文书籍 Evolyutsiya Vselennoĭ（1979）的译本，译者 MM Basko 将 Novikov 对这个问题的评论翻译为“时间曲线的结束并不一定意味着违反因果关系，因为沿着这样一条封闭线的事件可能都是‘自我调整的’——它们都通过封闭的循环相互影响，并以一种自洽的方式相互影响。” ^ abc 弗里德曼，约翰；迈克尔·莫里斯；伊戈尔·诺维科夫；费尔南多·埃切维里亚；贡纳尔·克林克哈默；基普索恩； Ulvi Yurtsever (1990)。 “具有封闭类时曲线的时空柯西问题”。物理评论 D. 42 (6): 1915. Bibcode: 1990PhRvD..42.1915F。 doi：10.1103/PhysRevD.42.1915。 PMID 10013039。^ 索恩，基普；迈克尔·莫里斯； Ulvi Yurtsever (1988)。 “虫洞、时间机器和弱能量条件”(PDF)。物理评论快报。 61 (13): 1446–1449。书目代码：1988PhRvL..61.1446M。 doi：10.1103/PhysRevLett.61.1446。 PMID 10038800。^ Echeverria，费尔南多；贡纳尔·克林克哈默；基普·索恩 (1991)。 “具有闭合类时曲线的虫洞时空中的台球：经典理论”。物理评论 D. 44 (4): 1077. Bibcode: 1991PhRvD..44.1077E。 doi：10.1103/PhysRevD.44.1077。 ^ abc Earman, 约翰 (1995)。砰砰声、仰卧起坐、呜咽声和尖叫声：相对论时空中的奇点和因果关系。牛津大学出版社。 ISBN 0-19-509591-X。 ^ Nahin, Paul J. (1999)。时间机器：物理学、形而上学和科幻小说中的时间旅行。美国物理学会。页。 508. ISBN 0-387-98571-9。 ^ 惠勒，J. 克雷格 (2007)。宇宙灾难：爆炸的恒星、黑洞和宇宙地图（第 2 版）。剑桥大学出版社。第 294-295 页。 ISBN 978-0521857147。\n^ 莫拉维克，汉斯 (1991)。 “时间旅行和计算”。从 2009-01-29 的原始存档。 ^ ab Deutsch, David (1991)。 “接近闭合类时线的量子力学”。物理评论 D. 44 (10): 3197–3217。 Bibcode: 1991PhRvD..44.3197D。 doi：10.1103/PhysRevD.44.3197。 PMID 10013776。^ Aaronson, Scott（2008 年 3 月）。 “量子计算机的极限”（PDF）。科学美国人：68-69 - 通过 scottaaronson.com。 ^ 亚伦森，斯科特；沃特鲁斯，约翰 (2009)。 “闭合类时曲线使量子计算和经典计算等效”（PDF）。英国皇家学会会刊 A. 465 (2102)：631–647。 arXiv：0808.2669。书目代码：2009RSPSA.465..631A。 doi：10.1098/rspa.2008.0350 – 通过 scottaronson.com。 ^ 林鲍尔，马丁；布鲁姆，马修 A.；迈尔斯，凯西河；怀特，安德鲁 G.；拉尔夫，蒂莫西 C.（2014 年 6 月 19 日）。 “封闭类时曲线的实验模拟”。自然通讯。 5：4145。arXiv：1501.05014。 Bibcode: 2014NatCo...5E4145R。 doi：10.1038/ncomms5145。 PMID 24942489。^ Tolksdorf, Juergen; Verch, Rainer (2018)。 “量子物理学、场和封闭类时曲线：量子场论中的 D-CTC 条件”。数学物理中的通信。 357（1）：319-351。 arXiv：1609.01496。书目代码：2018CMaPh.357..319T。 doi：10.1007/s00220-017-2943-5。", "note_en": "Jump to navigation  Jump to search  The  Novikov self-consistency principle, also known as the  Novikov self-consistency conjecture and  Larry Niven&#39;s  law of conservation of history, is a  principle developed by Russian physicist  Igor Dmitriyevich Novikov in the mid-1980s. Novikov intended it to solve the problem of  paradoxes in  time travel, which is theoretically permitted in certain solutions of  general relativity that contain what are known as  closed timelike curves. The principle asserts that if an event exists that would cause a paradox or any &#34;change&#34; to the past whatsoever, then the  probability of that event is zero. It would thus be impossible to create  time paradoxes.\n   Physicists have long known that some solutions to the theory of general relativity contain  closed timelike curves—for example the  Gödel metric. Novikov discussed the possibility of closed timelike curves (CTCs) in books he wrote in 1975 and 1983,  [1] offering the opinion that only self-consistent trips back in time would be permitted.  [2] In a 1990 paper by Novikov and several others, &#34;Cauchy problem in spacetimes with closed timelike curves&#34;,  [3] the authors state:\n The only type of causality violation that the authors would find unacceptable is that embodied in the science-fiction concept of going backward in time and killing one&#39;s younger self (&#34;changing the past&#34;). Some years ago one of us (Novikov 10) briefly considered the possibility that CTCs might exist and argued that they cannot entail this type of causality violation: events on a CTC are already guaranteed to be self-consistent, Novikov argued; they influence each other around a closed curve in a self-adjusted, cyclical, self-consistent way. The other authors recently have arrived at the same viewpoint.\n We shall embody this viewpoint in a  principle of self-consistency, which states that  the only solutions to the laws of physics that can occur locally in the real Universe are those which are globally self-consistent. This principle allows one to build a local solution to the equations of physics only if that local solution can be extended to a part of a (not necessarily unique) global solution, which is well defined throughout the nonsingular regions of the space-time.\n Among the co-authors of this 1990 paper were  Kip Thorne,  Mike Morris, and Ulvi Yurtsever, who in 1988 had stirred up renewed interest in the subject of time travel in general relativity with their paper &#34;Wormholes, Time Machines, and the Weak Energy Condition&#34;,  [4] which showed that a new general relativity solution known as a  traversable wormhole could lead to closed timelike curves, and unlike previous CTC-containing solutions, it did not require unrealistic conditions for the universe as a whole. After discussions with another co-author of the 1990 paper, John Friedman, they convinced themselves that time travel needn&#39;t lead to unresolvable paradoxes, regardless of the object sent through the wormhole.  : 509\n    By way of response, physicist  Joseph Polchinski wrote them a letter arguing that one could avoid the issue of free will by employing a potentially paradoxical thought experiment involving a  billiard ball sent back in time through a wormhole. In Polchinski&#39;s scenario, the billiard ball is fired into the  wormhole at an angle such that, if it continues along its path, it will exit in the past at just the right angle to collide with its earlier self, knocking it off track and preventing it from entering the wormhole in the first place. Thorne would refer to this scenario as &#34; Polchinski&#39;s paradox&#34; in 1994.  : 510–511\n Upon considering the scenario, Fernando Echeverria and Gunnar Klinkhammer, two students at  Caltech (where Thorne taught), arrived at a solution to the problem that managed to avoid any inconsistencies. In the revised scenario, the ball from the future emerges at a different angle than the one that generates the paradox, and delivers its younger self a glancing blow instead of knocking it completely away from the wormhole. This blow alters its trajectory by just the right degree, meaning it will travel back in time with the angle required to deliver its younger self the necessary glancing blow. Echeverria and Klinkhammer actually found that there was more than one self-consistent solution, with slightly different angles for the glancing blow in each situation. Later analysis by Thorne and  Robert Forward illustrated that for certain initial trajectories of the billiard ball, there could actually be an infinite number of self-consistent solutions.  : 511–513\n Echeverria, Klinkhammer, and Thorne published a paper discussing these results in 1991;  [7] in addition, they reported that they had tried to see if they could find  any initial conditions for the billiard ball for which there were no self-consistent extensions, but were unable to do so. Thus, it is plausible that there exist self-consistent extensions for every possible initial trajectory, although this has not been proven.  [8] : 184 This only applies to initial conditions outside of the chronology-violating region of spacetime,  [8] : 187 which is bounded by a  Cauchy horizon.  [9] This could mean that the Novikov self-consistency principle does not actually place any constraints on systems outside of the region of space-time where time travel is possible, only inside it.\n Even if self-consistent extensions can be found for arbitrary initial conditions outside the Cauchy Horizon, the finding that there can be multiple distinct self-consistent extensions for the same initial condition—indeed, Echeverria et al. found an infinite number of consistent extensions for every initial trajectory they analyzed  [8] : 184—can be seen as problematic, since classically there seems to be no way to decide which extension the laws of physics will choose. To get around this difficulty, Thorne and Klinkhammer analyzed the billiard ball scenario using quantum mechanics,  : 514–515 performing a quantum-mechanical sum over histories ( path integral) using only the consistent extensions, and found that this resulted in a well-defined probability for each consistent extension. The authors of  Cauchy problem in spacetimes with closed timelike curves write:\n  The simplest way to impose the principle of self-consistency in quantum mechanics (in a classical space-time) is by a sum-over-histories formulation in which one includes all those, and only those, histories that are self-consistent. It turns out that, at least formally (modulo such issues as the convergence of the sum), for every choice of the billiard ball&#39;s initial, nonrelativistic  wave function before the  Cauchy horizon, such a sum over histories produces unique, self-consistent probabilities for the outcomes of all sets of subsequent measurements. ... We suspect, more generally, that for any quantum system in a classical wormhole spacetime with a stable Cauchy horizon, the sum over all self-consistent histories will give unique, self-consistent probabilities for the outcomes of all sets of measurements that one might choose to make.\n  The Novikov consistency principle assumes certain conditions about what sort of time travel is possible. Specifically, it assumes either that there is only one  timeline, or that any alternative timelines (such as those postulated by the  many-worlds interpretation of  quantum mechanics) are not accessible.\n Given these assumptions, the constraint that time travel must not lead to inconsistent outcomes could be seen merely as a  tautology, a self-evident truth that can not possibly be false. However, the Novikov self-consistency principle is intended to go beyond just the statement that history must be consistent, making the additional nontrivial assumption that the universe obeys the same local laws of physics in situations involving time travel that it does in regions of space-time that lack closed timelike curves. This is clarified in the above-mentioned &#34;Cauchy problem in spacetimes with closed timelike curves&#34;,  [3] where the authors write:\n  That the principle of self-consistency is not totally tautological becomes clear when one considers the following alternative: The laws of physics might permit CTCs; and when CTCs occur, they might trigger new kinds of local physics which we have not previously met. ... The principle of self-consistency is intended to rule out such behavior. It insists that local physics is governed by the same types of physical laws as we deal with in the absence of CTCs: the laws that entail self-consistent single valuedness for the fields. In essence, the principle of self-consistency is a principle of no new physics. If one is inclined from the outset to ignore or discount the possibility of new physics, then one will regard self-consistency as a trivial principle.\n  The assumptions of the self-consistency principle can be extended to hypothetical scenarios involving intelligent time travelers as well as unintelligent objects such as billiard balls. The authors of &#34;Cauchy problem in spacetimes with  closed timelike curves&#34; commented on the issue in the paper&#39;s conclusion, writing:\n  If CTCs are allowed, and if the above vision of theoretical physics&#39; accommodation with them turns out to be more or less correct, then what will this imply about the philosophical notion of free will for humans and other intelligent beings? It certainly will imply that intelligent beings cannot change the past. Such change is incompatible with the principle of self-consistency. Consequently, any being who went through a wormhole and tried to change the past would be prevented by physical law from making the change; i.e., the &#34;free will&#34; of the being would be constrained. Although this constraint has a more global character than constraints on free will that follow from the standard, local laws of physics, it is not obvious to us that this constraint is more severe than those imposed by standard physical law.  [3]\n   According to the consistency conjecture, any complex interpersonal interactions must work themselves out self-consistently so that there is no paradox. That is the resolution. This means, if taken literally, that if time machines exist, there can be no free will. You cannot will yourself to kill your younger self if you travel back in time. You can coexist, take yourself out for a beer, celebrate your birthday together, but somehow circumstances will dictate that you cannot behave in a way that leads to a paradox in time. Novikov supports this point of view with another argument: physics already restricts your free will every day. You may will yourself to fly or to walk through a concrete wall, but gravity and condensed-matter physics dictate that you cannot. Why, Novikov asks, is the consistency restriction placed on a time traveler any different?  [10]\n   Time-loop logic, coined by  roboticist and futurist  Hans Moravec,  [11] is a hypothetical system of computation that exploits the Novikov self-consistency principle to compute answers much faster than possible with the standard model of  computational complexity using  Turing machines. In this system, a computer sends a result of a computation  backwards through time and relies upon the self-consistency principle to force the sent result to be correct, provided the machine can reliably receive information from the future and provided the algorithm and the underlying mechanism are  formally correct. An incorrect result or no result can still be produced if the time travel mechanism or algorithm are not guaranteed to be accurate.\n   Make a computing box that accepts an input, which represents an approximate solution to some problem, and produces an output that is an improved approximation. Conventionally you would apply such a computation repeatedly a finite number of times, and then settle for the better, but still approximate, result. Given an appropriate negative delay something else is possible: [...] the result of each iteration of the function is brought back in time to serve as the &#34;first&#34; approximation. As soon as the machine is activated, a so-called &#34;fixed-point&#34; of F, an input which produces an identical output, usually signaling a perfect answer, appears (by an extraordinary coincidence!) immediately and steadily. [...] If the iteration does not converge, that is, if F has no fixed point, the computer outputs and inputs will shut down or hover in an unlikely intermediate state.\n  Physicist  David Deutsch showed in 1991 that this model of computation could solve NP problems in  polynomial time,  [12] and  Scott Aaronson later extended this result to show that the model could also be used to solve  PSPACE problems in polynomial time.  [13]  [14] Deutsch shows that quantum computation with a negative delay—backwards time travel—produces only self-consistent solutions, and the chronology-violating region imposes constraints that are not apparent through classical reasoning.  [12] Researchers published in 2014 a simulation in which they claim to have validated Deutsch&#39;s model with photons.  [15] However, it was shown in an article by Tolksdorf and Verch that Deutsch&#39;s self-consistency condition can be fulfilled to arbitrary precision in any quantum system described according to relativistic  quantum field theory even on spacetimes which do not admit closed timelike curves, casting doubts on whether Deutsch&#39;s model is really characteristic of quantum processes simulating closed timelike curves in the sense of  general relativity.  [16]\n  Harry Potter and the Methods of Rationality. In Eliezer Yudkowsky&#39;s exposition on rationality, framed as a piece of Harry Potter fanfiction, Harry attempts to use his Time Turner to influence the past and comes to the conclusion that the Novikov self-consistency principle applies.\n    ^  See note 10 on p. 42 of Friedman et al., &#34;Cauchy problem in space-times with closed timelike curves&#34;\n ^  On p. 169 of Novikov&#39;s  Evolution of the Universe (1983), which was a translation of his Russian book   Evolyutsiya Vselennoĭ (1979), Novikov&#39;s comment on the issue is rendered by translator M.M Basko as &#34;The close of time curves does not necessarily imply a violation of causality, since the events along such a closed line may be all &#39;self-adjusted&#39;—they all affect one another through the closed cycle and follow one another in a self-consistent way.&#34;\n ^     a     b     c   Friedman, John; Michael Morris; Igor Novikov; Fernando Echeverria; Gunnar Klinkhammer; Kip Thorne; Ulvi Yurtsever (1990).  &#34;Cauchy problem in spacetimes with closed timelike curves&#34;.  Physical Review D.  42 (6): 1915.  Bibcode: 1990PhRvD..42.1915F.  doi: 10.1103/PhysRevD.42.1915.  PMID  10013039.\n ^    Thorne, Kip; Michael Morris; Ulvi Yurtsever (1988).  &#34;Wormholes, Time Machines, and the Weak Energy Condition&#34;  (PDF).   Physical Review Letters.  61 (13): 1446–1449.  Bibcode: 1988PhRvL..61.1446M.  doi: 10.1103/PhysRevLett.61.1446.  PMID  10038800.\n   ^    Echeverria, Fernando; Gunnar Klinkhammer; Kip Thorne (1991).  &#34;Billiard balls in wormhole spacetimes with closed timelike curves: Classical theory&#34;.  Physical Review D.  44 (4): 1077.  Bibcode: 1991PhRvD..44.1077E.  doi: 10.1103/PhysRevD.44.1077.\n ^     a     b     c    Earman, John (1995).  Bangs, Crunches, Whimpers, and Shrieks: Singularities and Acausalities in Relativistic Spacetimes. Oxford University Press.  ISBN   0-19-509591-X.\n ^    Nahin, Paul J. (1999).  Time Machines: Time Travel in Physics, Metaphysics, and Science Fiction. American Institute of Physics. p. 508.  ISBN   0-387-98571-9.\n ^    Wheeler, J. Craig (2007).  Cosmic Catastrophes: Exploding Stars, Black Holes, and Mapping the Universe (2nd ed.). Cambridge University Press. pp. 294–295.  ISBN   978-0521857147.\n ^     Moravec, Hans (1991).  &#34;Time Travel and Computing&#34;. Archived from  the original on 2009-01-29 .\n ^     a     b    Deutsch, David (1991).  &#34;Quantum mechanics near closed timelike lines&#34;.  Physical Review D.  44 (10): 3197–3217.  Bibcode: 1991PhRvD..44.3197D.  doi: 10.1103/PhysRevD.44.3197.  PMID  10013776.\n ^    Aaronson, Scott (March 2008).  &#34;The Limits of Quantum Computers&#34;  (PDF).  Scientific American: 68–69 – via scottaaronson.com.\n ^    Aaronson, Scott; Watrous, John (2009).  &#34;Closed Timelike Curves Make Quantum and Classical Computing Equivalent&#34;  (PDF).  Proceedings of the Royal Society A.  465 (2102): 631–647.  arXiv:  0808.2669.  Bibcode: 2009RSPSA.465..631A.  doi: 10.1098/rspa.2008.0350 – via scottaaronson.com.\n ^    Ringbauer, Martin; Broome, Matthew A.; Myers, Casey R.; White, Andrew G.; Ralph, Timothy C. (19 June 2014). &#34;Experimental simulation of closed timelike curves&#34;.  Nature Communications.  5: 4145.  arXiv:  1501.05014.  Bibcode: 2014NatCo...5E4145R.  doi: 10.1038/ncomms5145.  PMID  24942489.\n ^    Tolksdorf, Juergen; Verch, Rainer (2018). &#34;Quantum physics, fields and closed timelike curves: The D-CTC condition in quantum field theory&#34;.  Communications in Mathematical Physics.  357 (1): 319–351.  arXiv:  1609.01496.  Bibcode: 2018CMaPh.357..319T.  doi: 10.1007/s00220-017-2943-5.", "posttime": "2021-08-07 02:15:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维科夫,consistency,自洽", "title": "诺维科夫自洽原则", "title_en": "Novikov Self-Consistency Principle", "transed": 1, "url": "https://en.wikipedia.org/wiki/Novikov_self-consistency_principle", "via": "", "real_tags": ["维科夫", "自洽"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8 月 4 日星期三晚上 6 点 30 分，我和 15 岁的女儿在萨斯喀彻温省里贾纳市 91 岁的妈妈家门前停了一辆捷豹 I-Pace 电动车。我又累又痛，因为我刚刚在两天内完成了 1,725 公里（1,072 英里）的驾驶，这是自 Covid 开始以来第一次见到她。我很高兴看到妈妈，对很长一段时间以来的第一次公路旅行感到高兴，也很高兴检验了 2021 年全电动汽车可以进行长途旅行的假设。这篇文章收集了这次旅行的数据并试图得出结论。还有一个实时的 Twitter 线程，上面有错别字和糟糕的图片。致我的非公制读者：对不起，它以公里为单位。我将转换一些关键数字。体验 · 实际上，这非常美妙。 Jaguar 是一款舒适的现代汽车，拥有舒适的座椅、出色的音响以及您所期望的所有自动化功能。当您遇到棘手的传球情况时，它具有令人敬畏的压倒性加速能力。我的女儿是优秀的公司。沿着一条好路巡航——很多横贯加拿大的高速公路都是这样——成为一种非常愉快的体验。最糟糕的部分是野火烟雾，它挡在我们和世界上一些最奇妙的风景之间。但这是气候危机加剧的一个症状，我们可以做的最好的事情之一就是停止燃烧化石燃料旅行。当然，这次公路旅行不同于以往的任何一次体验，因为充电。在化石汽车中，您不必思考，您只需等待油箱下降一半或四分之三，然后在下一站靠边停车。充电需要规划；幸运的是，这些工具还不错；更多关于下面的内容。充电器 · 我认为这个实验值得一试的一个原因是加拿大石油公司关于他们的电气公路计划的信息，我引用：“我们从哈利法克斯，NS 到维多利亚，BC 每 250 公里或更短的距离就有一个充电器”有一个不远的地方从我住在温哥华的地方开始，我尝试了它，它第一次只用信用卡水龙头就可以工作，不用大惊小怪。\n问题是，这句话有点像谎言。有间隙，那就是所有充电器都在工作的时候，而它们却经常不工作。但我的经验是，Petro-Can 虽然很好，但绝不是您唯一的充电选择。这里需要一些背景。 “大功率”快速直流充电器有多种功率等级：我看到有 50、100、200 和 350kW。差异产生差异。我们的 Jag 只能以 100 kW 的功率真正充电，但我个人的看法是，更高功率的充电器充满电的速度要快 20%。而且感觉很复杂；例如，根据我使用 Co-op Connect 充电器的经验，额定功率“仅”100kW，感觉更快。当你使用这些东西时，它们感觉就像第一代技术，推动了可能（或至少可维护）的边缘。特别是，当您将 350kW 充电器插入电池电量非常低的汽车时，一旦它完成同步并开始输送电子，声音就会像 747 起飞一样变大。并且这些装置包括多个高大的金属盒子（见下图）。此外，巨大的粗连接线摸起来非常热。无论如何，我对 Petro-Can 网络的印象大多是积极的。机器运转良好。令人讨厌的是，有些是 100 千瓦，有些是 200 千瓦，有些是 350 千瓦，原因不明。令人讨厌的是，有时它们会被卡在地段一个奇怪的肮脏的后角，这使得您的汽车很难找到正确的位置，以通过电线到达充电端口。但是，对他们很好。 Electrify Canada 是另一个承诺建立全国快速充电器网络的组织。他们是 Electrify America 的合作伙伴，由大众汽车建造，作为他们在排放测试中作弊的解决方案的一部分。不管怎样，也许有一天他们会很棒。一旦我的行程足够远，可以让 Petro-Can 完全解决问题，我试图找到一个处于工作状态的 Electrify 充电器，但失败了。如果您可以使用 50kW 充电器，那么有很多选择。许多小城镇游客中心和商会都安装了一个，我自己的电力公司 BC Hydro 也是如此。但是，一旦您使用了更高功率的充电器，它们就不是一种令人满意的体验。数字 · 下表中的每一行代表一个行驶段，并包括该段开始时的充电体验（因此在每天的初始段中不存在）。我认为列标题大多很明显，除了：\nkWh/h 是果汁量除以驾驶暂停时间。通常充电器会报告更少的时间，我把这归结为初始化延迟，所以我认为我使用了正确的值。这里的变化有点随机，因为它的速度在很大程度上取决于电池的电量。 km/ch 代表“每充电小时公里数”，估算每小时充电可行驶的里程数。我认为这是一个非常重要的数字。网络; “PC”是加拿大石油公司，“Flo”不是首字母缩写词，“Co-op”是 Co-op Connect。有两个数据来源：行驶时间数据来自捷豹通过其 Incontrol 应用程序的行程记录；因此，不收费的路边停车带来的尴尬。充电时间数据是沿途各个充电会话的输出。我确信两者都不是完美的，但根据我的经验，结果在正确的邻域中似乎很直观。让我们仔细看看我觉得有趣的数字。充电时间 · 17:42 行驶，6:24 充电（包括一天的行驶结束后的一晚充电）。从表面上看并不是那么好。现在，它显然可以更少；由于我对任何给定的充电器都能正常工作的信心一开始很弱，因此我小心翼翼地允许故障并且不会将电池电量耗尽。在旅行的后期，随着我获得信心（特别是在加拿大石油网络中），我愿意承担诸如 Calgary-to-Medicine Hat 腿之类的事情，2:43 和 285.9 公里，将电池从 90% 降低到11%。而且我的女儿毕竟是个十几岁的孩子，也许不像我在咖啡馆和洗手间等地方走来走去那么快。\n还要注意腿有点短；这辆车充一次电可以行驶400公里。但当您在一条几乎没有其他交通的宽阔现代草原高速公路上，以 110 公里/小时（65 英里/小时）或更高的速度连续爆破时，情况就不一样了。我想你会发现每辆电动汽车都是如此。但是，事情是这样的：感觉并不过分。我只记得我们有意识地挂着等待充电一共大概有十五分钟。大多数地方，我们喝了咖啡或午餐，去洗手间，为了我们的膝盖绕着街区走一圈，然后是时候拔掉插头走人了。话虽如此，这是一辆 2019 年的车型，充电技术正在改进。如果我们有一辆保时捷 Taycan 而只有 350kW 的充电器，情况就会大不相同。快充技术能否进入主流车价位面？ 350kW充电器会无处不在吗？我想知道。在这种情况下，还有一个我认为非常有趣的数字：“km/ch”，即充电一小时可以行驶多远。对于使用这种充电器选择的这辆特殊汽车，每小时充电超过 200 公里（124 英里）。我想这就够了？也许在足够低的地区，但在那里。最后，我怀疑每个驾驶安全专业人士都会欣然接受这样一种动力系统，这种动力系统迫使您每行驶几百公里就下车走动。 $$$ · 我们的电费为 120.52 美元。这是很多还是一点？我暂时认为他们收费不足。虽然电力本身相当便宜，但充电基础设施却不是。如果这行得通，充电网络将不得不赚钱，我看不到这些价格。请记住，在家里的车库里有 2 级充电器，充电感觉几乎是免费的。旅行可能不需要像网络目前所做的那样便宜。\n此外，按分钟收费似乎是错误的。我想有一个基于时间的组件可以防止慢速充电器一直吸收，但特别是在超大功率充电器上，保时捷 Taycan 每分钟将获得比5 岁的 Nissan Leaf，那么为什么他们要为相同的续航里程支付更少的费用呢？嗯嗯。 PlugShare · 如果你有一辆特斯拉，那么计划就少了，汽车知道增压器在哪里。如果您还有其他事情，您真的需要 PlugShare。这个领域有一些应用程序，但 PlugShare 最擅长向您展示带有所有充电器的地图，从而帮助您规划路线。它有效的原因是因为它是社交的；每当您到达充电站时，您都可以“办理登机手续”并留下一张便条，说明它是否正在工作以及充电速度有多快。这大大降低了卷到车站并发现它坏了的风险。我绝对认为没有它就不可能完成这次旅程。专业提示：当您计划在 PlugShare 上旅行时，请放入所有可能在旅途中使用的充电器。然后当你开车时，你可以查看你的剩余里程和即将到来的选择，大多数选择变得非常容易。它有一个有限但不错的 Android Auto 应用程序，我经常使用它。 （我也假设 CarPlay？） 未来 · 一个问题：充电器是否足够，还是太多？目前，答案可能是“太多了”。我真正担心的一件事是一瘸一拐地走进某个充电站，发现所有充电器都被占用了，不得不等一个小时才能开始。上图是我唯一一次见到其他人类；一对年轻夫妇带着四天大的 Mustang Mach-E，去坎卢普斯兜风。否则，我们访问的充电器没有生命迹象。有人花了很多钱来建造一种今天基本上没有使用的昂贵资源。话虽如此，任何对我们的未来抱有一丝乐观的人都必须相信，将会有更多的电池电动汽车问世。在加拿大西部边缘的卑诗省，我们拥有北美最高的电动汽车使用量，推动了 10% 的新车销量。当我们在坎卢普斯的大型 Petro-Can 站充电时，从两个位置很好的充电器走到咖啡店，我们经过了加油站，那里很大，至少有十几个泵和汽车排成一排为了所有人。到了某个时候，情况会翻转，偶尔会有供应商仍在销售汽油，但大多只是光滑、快速的充电器。我担心这个过程会有点痛苦，但我相信它会发生。所以我希望有人正在计划过渡。\n从现在开始，每个人都应该停止驾驶化石车辆。因为气候危机就在我们身边。我们现在无法阻止它，但如果我们削减碳排放，我们可以挽救生命并减少破坏。没有理由不这样做。我们拥有一辆 Nissan Leaf 并且很喜欢它；我们只将它用于城镇周围的短途旅行（这是我们开车的大部分时间）。一直困扰着我的一件事是：住在公寓和街边停车位的数百万人如何参与电动汽车革命？这对我来说一切都很好，谁可以在我的车库里过夜充电（尽管最近一些关于房屋被烧毁的故事让我有点担心。）看来这需要大量的基础设施投资才能基本上使充电器几乎像停车场一样米。要么是这样，要么给每周必须去指定充电区 2 或 3 次的人带来很大不便。", "note_en": "At 6:30 PM on Wednesday August 4 th my 15-year-old daughter and I pulled up the Jaguar I-Pace electric car in front of my 91-year-old Mom’s place in Regina, Saskatchewan. I was tired and achey because I’d just finished driving 1,725km (1,072 miles) across two days to see her for the first time since Covid started. I was happy to see Mom, happy about the first road-trip in a long time, and happy to have tested the hypothesis that, in 2021, a fully-electric vehicle can handle long-haul travel.\n   This essay gathers together the data from the trip and tries to draw conclusions. There’s also a  real-time Twitter thread with typos and bad pictures.\n To my non-metric readers: Sorry, it’s in km. I’ll convert a few of the key numbers.\n The experience · It was pretty wonderful, actually. The Jaguar is a comfortable modern car with great seats, good audio, and all the automation you’d expect. It has awesome, overwhelming acceleration power for when you’re in a tricky passing situation. My daughter was excellent company. Cruising along a good road  — and a lot of the Trans-Canada highway is  — becomes a pretty pleasing experience.\n The worst part, by a wide margin, was the wildfire smoke, between us and some of the world’s most fantastic scenery. But that’s a symptom of the onrushing climate crisis, and one of the best things we can do to mitigate the devastation is to stop burning fossil fuels to travel.\n   Of course, this road trip was different from any previous experience, because charging. In a fossil car, you don’t have to think, you just wait for the tank to get a half or three quarters down, then pull over at the next station. Recharging requires planning; fortunately the tools are pretty good; more on that below.\n The chargers · One reason I decided this experiment was worth trying was Petro-Canada’s message about their  Electric Highway program, and I quote: “We have a charger every 250 km or less from Halifax, N.S. to Victoria, B.C.” There’s one not far from where I live in Vancouver, i tried it, and it worked first time with just a credit-card tap, no fuss no muss.\n Trouble is, that quote is kind of a lie. There are gaps, and that’s when all the chargers are working, which fairly regularly they’re not. But my experience is that Petro-Can, while good, is never your only charging option.\n Some background is required here. “High-power” Fast DC chargers come at multiple power levels: I saw 50, 100, 200, and 350kW. The difference makes a difference. Our Jag can only really charge at 100kW, but my personal perception is that the higher-power chargers fill up that last 20% much faster. And it feels complicated; for example, in my experience with a Co-op Connect charger, rated at “only” 100kW, it felt faster.\n When you use these things, they feel like first-generation tech, pushing the edges of what’s possible (or at least maintainable). In particular, when you plug a 350kW charger into a car with a really low battery, once it’s finished syncing and starts pumping electrons, the sound torques up like a 747 taking off. And the installations include multiple big tall metal boxes (see the picture below). Also, the huge big thick connecting wire gets super hot to the touch.\n   Anyhow, my impression of the Petro-Can network remains mostly positive. The machines work well. It’s annoying that some are 100kW, some 200, and some 350, for no obvious reason. It’s annoying that sometimes they’re stuck into a weird grubby back corner of the lot in a way that makes it hard to get your car in the right position to reach the charging port with the wire. But, good on ’em.\n Electrify Canada is another organization that’s promising a national network of fast chargers. They’re a partner of Electrify America, constructed by Volkswagen as part of their settlement over cheating on emissions testing. Anyhow, maybe they’ll be great some day. Once I was far enough into the trip to have Petro-Can fully worked out, I tried to find an Electrify charger in working condition but failed.\n If you’re OK with using 50kW chargers there are loads and loads of options. Many smaller-town Visitor Centres and and Chambers of Commerce put one in, as has my own electrical utility, BC Hydro. Once you’ve worked with a higher-power charger though, they’re just not a satisfying experience.\n The numbers · Each line in the table below represents one driving leg and includes the charging experience at the beginning of that leg (thus absent on each day’s initial leg). I think the column headings are mostly pretty obvious, except perhaps for:\n kWh/h is the amount of juice divided by the driving pause. Often the charger would report less time, which I put down to initialization delay, so I think I’m using the right value. The variation here is a little random, because how fast it goes depends strongly on how empty your battery is.\n km/ch stands for “km per charge-hour”, estimating the amount of road range you get per hour of charging. Which I think is a really important number.\n Network; “PC” is  Petro-Canada, “Flo”  isn’t an acronym, and “Co-op” is  Co-op Connect.\n There are two data sources: The drive-time data is from Jaguar’s trip logging via their  Incontrol app; thus the awkwardness caused by non-charge roadside stops. The charge-time data is the output from the various charging sessions along the way. I’m certain that neither is perfect, but the results seem intuitively in the right neighborhood, based on my experience.\n  Let’s have a closer look at the numbers that seem interesting to me.\n Charge time · 17:42 driving, 6:24 charging (including one evening charge after the day’s drive was finished). Not that great on the face of it. Now, it clearly could have been less; since my confidence that any given charger would Just Work started out weak, I was carefully allowing for failures and not running the battery very low. Later on in the trip as I gained confidence (specifically in the Petro-Canada network) I was willing to take on things like the Calgary-to-Medicine Hat leg, 2:43 and 285.9km, running the battery from 90% down to 11%.\n Also my daughter is after all a teen-ager, and perhaps not quite as quick as I moving through cafes and restrooms and so on.\n Also note that the legs are kind of short; this car can go 400km on a charge. But not when you’re on a big wide modern Prairie highway with almost no other traffic, blasting along at 110km/h (65mph) or more, continuously. I think you’d find this true of pretty well every electric vehicle.\n But, here’s the thing: It didn’t  feel excessive. I can only remember a total of maybe fifteen minutes when we were consciously just hanging waiting for charge. Most places, we got a coffee or lunch, hit the bathroom, took a walk around the block for our knees’ sake, and then it was time to unplug and go.\n Having said that, this is a 2019 model-year car and the charging technology is improving. If we’d had a Porsche Taycan and nothing but 350kW chargers, the story would have been very different. Will the fast-charging technology make the leap into the mainstream-car price plane? Will 350kW chargers become ubiquitious? I’d like to know.\n In this context, there’s another number there that I think is really interesting: The “km/c-h”, how far you can get on an hour’s charge. For this particular car on this selection of chargers, it was over 200km (124 miles) per charge-hour. I think that’s enough? Maybe in the lower regions of enough, but there.\n And finally, I suspect every driving-safety professional would beam in approval of a power system that forces you to get out of the car and move around every couple of hundred km.\n $$$ · It cost us $120.52 in electricity. Is that a lot or a little? I tentatively think they’re undercharging. While the electricity itself is pretty cheap, the charging infrastructure isn’t. If this is going to work, the charging networks are going to have to make money and I don’t see it at these prices.\n Bear in mind that at home with the Level 2 charger in the carport, charging feels close to free. Travel maybe doesn’t need to be as cheap as the networks are currently making it.\n Also, charging by the minute seems wrong. I guess having a time-based component makes sense to keep slow chargers from soaking up all the time, but especially at an extra-high-powered charger, a Porsche Taycan is going to get a whole lot more range out of each minute than a five-year-old Nissan Leaf, so why should they pay less for the same amount of range? Hmmmm.\n PlugShare · If you’ve got a Tesla there’s less planning, the cars know where the Superchargers are. If you have anything else, you really need  PlugShare. There are a few apps in this space, but PlugShare is best at showing you a map with all the chargers on it, and thus helping you route-plan. The reason it works is because it’s social; whenever you hit a charging station you can “Check In” and leave a note saying whether it’s working and how fast it goes. This dramatically reduces the risk of rolling up to a station and finding it broken. I absolutely don’t think this journey would have been possible without it.\n Pro tip: When you’re planning a trip on PlugShare, put in  all the chargers you might be able to use as you go along. Then when you’re driving, you can look at your remaining range and your upcoming options and most choices become pretty easy. It’s got a limited but decent Android Auto app that I used a lot. (I assume CarPlay too?)\n   Futures · A question: Are there enough chargers, or too many? At the moment, the answer is probably “too many”. One of the things I really worried about was limping into some charging station to find all the chargers occupied and having to wait for an hour before I could even start. The picture above shows the only time I saw other humans; a young couple with a four-day-old Mustang Mach-E, off for a joyride to Kamloops. Otherwise, the chargers we visited showed no signs of life. Somebody spent a lot of money to build an expensive resource that is today largely un-used.\n Having said that, anyone with even a shred of optimism about our future has to believe there are going to be a whole lot more battery-electric cars coming. Here in BC at the west edge of Canada we have  North America’s highest EV uptake, pushing 10% of new car sales.\n When we were charging at the big Petro-Can station in Kamloops, walking from the the two well-positioned chargers to the coffee shop, we went by the gas-sales part, which was  massive, at least a dozen pumps and cars lined up for every one.\n At some point that picture will flip, and there’ll be occasional vendors that still sell gas, but mostly just slick, fast, chargers. I worry that the process will be kind of painful, but I’m sure it’ll happen. So I hope someone’s planning the transition.\n  And everyone should stop driving fossil vehicles starting now. Because the climate crisis is upon us. We can’t prevent it now, but we can save lives and reduce destruction if we slash carbon output. There’s no excuse not to.\n      We own a Nissan Leaf and love it; we only use it for short trips around town (which is most of our driving).\n One thing that keeps bugging me is: how do the millions of people who live in apartments and park on the street participate in the electric car revolution? It is all well and good for me, who can charge overnight in my garage (though some recent stories about houses burning down have me a bit worried about that.)\n It seems this would require a huge infrastructure investment to basically make chargers almost like parking meters. Either that, or big inconvenience to people who have to go to designated charging areas 2 or 3 times a week.", "posttime": "2021-08-07 02:15:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "行驶,electric,充电", "title": "电动车2天行驶1725公里", "title_en": "Driving 1725km in an electric car in 2 days", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2021/08/05/Western-Electric", "via": "", "real_tags": ["行驶", "electric", "充电"]}, {"category": "", "categoryclass": "", "imagename": "860cddb8010586800dcb65a5269577ae.jpg", "infoid": 1071811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简介：我们本周的开源软件亮点是 Session。它是另一个日益流行的私人信使信号的分支。 Session 甚至不需要您的电话号码即可操作。关注隐私的人们一直在寻找一种终极服务，让您可以安全地进行通信，同时在多个平台上尊重我们的隐私。最近，我遇到了 Loki Foundation 的一个有趣的开源消息传递应用程序“Session”，它在技术上是另一个开源加密信使 Signal 的分支。在本文中，我将分享我对 Session 应用程序的体验，同时重点介绍它提供的功能。 Session 对这个场景来说是相当新的——我已经在文章底部提到了我遇到的一些错误。我将重点介绍 Session 的主要功能，这些功能将帮助您确定它是否足以让您尝试。对于隐私爱好者来说，使用 Signal 或其他此类应用程序注册电话号码是一种潜在风险。\n但是，使用 Session，您不需要电话号码，只需在台式机或手机上安装后单击“创建帐户”，它就会生成一个随机（唯一）会话 ID。因此，您只需与要添加的联系人共享您的会话 ID。或者，您也可以选择在创建帐户后获取二维码，您可以与朋友分享以重新添加您。对于了解区块链是什么的用户来说，他们一直在等待普通用户可以使用的实际应用程序。 Session 就是这样一个例子，它以区块链为核心，你不需要知道它的存在。如果您对它的工作原理感到好奇，可以查看他们的官方博客文章来解释它。对于严格以隐私为重点的内容，您还希望它可以跨多个平台使用。当然，主要是我会专注于 Linux 和 Android 支持，但它也支持 Windows/Mac/iOS。因此，您可以轻松地跨平台在多个设备之间进行同步。毫无疑问，它提供了一些以隐私为重点的基本功能，有助于使体验更加安全。\n消息 TTL：这使您可以控制在收件人看到消息之前消息存在的时间。阅读回执：让其他人知道您已看到该消息或您的消息是否已被阅读。尽管 Session 不是点对点技术，但它没有用于网络的中央服务器。它采用分散的方法来传输（或路由）消息。如果你不知道我在说什么，你可以关注 Session 的官方博客文章，了解中心化和去中心化之间的区别，并探索它是如何工作的。而且，这种网络方法可以帮助他们保护元数据（与 IP 地址等消息相关的信息）。不仅限于最新/最大的隐私友好功能，它还支持群聊、语音消息，还允许您发送附件。如果您前往官方下载页面，您将能够下载 .应用图像文件。如果你不知道它是如何工作的，你应该看看我们关于如何使用 AppImage 的文章。\n无论哪种情况，您都可以前往他们的 GitHub 发布页面并获取 .deb 文件。我已经设法在多个平台上尝试了它。对于桌面，我使用了 Pop!_OS 19.10 上的 .AppImage 文件来运行 Session。一旦您从设置中备份了您的密码（称为种子），恢复您的帐户也很容易。有时，当您从两个不同的设备（使用相同的 ID）回复时，接收者会收到两个不同的对话。当然，没有什么是完美的。现在，我正在考虑安装它并考虑 Session 的功能，这绝对是一个注重隐私的用户应该尝试的东西。你怎么看待这件事？请随时在下面的评论中告诉我您的想法。", "note_en": "Brief: Our open source software highlight of the week is Session. It is a fork of another increasingly popular private messenger Signal. Session doesn’t even need your phone number to operate.\n   Privacy concerned people are always in the search of an ultimate service that lets you communicate securely while respecting our privacy across multiple platforms.\n Recently, I came across an interesting open-source messaging app “ Session” by  Loki Foundation, which is technically a fork of another  open source encrypted messenger Signal.\n In this article, I’ll be sharing my experience with the Session app while highlighting the features it offers.\n Session is fairly new to the scene – I’ve mentioned some of the bugs that I encountered at the bottom of the article.\n  I’ll highlight the key features of Session that will help you decide if it’s good enough for you to try.\n    For privacy-enthusiasts, registering the phone number with Signal or other such applications is a potential risk.\n But, with Session, you do not need a phone number, simply click on “ Create Account” after you install it on your desktop or phone and it will simply generate a random (unique)  Session ID.\n  So, you just have to share your Session ID with the contact you want to add. Or, you can also opt to get the  QR Code after account creation which you can share with your friends to add you back.\n   For the users who’re aware of what a  blockchain is – they’ve been waiting for real-world applications that an average user can utilize. Session is one such example that utilizes blockchain at its core and you don’t need to know it’s there.\n If you’re curious about how it works, you can take a look at their  official blog post explaining it.\n   For something strictly privacy-focused, you’d also want it to be available across multiple platforms.\n Of course, primarily, I’d focus on the Linux and Android support but it also supports Windows/Mac/iOS. So, you can easily sync between multiple devices cross-platform.\n   Undoubtedly, it offers some essential privacy-focused features that will help make the experience more secure.\n  Message TTL: This lets you control how long the message exists before the recipient sees the message.\n Read Receipts: Let others know that you’ve seen the message or if your message has been read.\n  Even though Session isn’t a peer-to-peer technology, it does not have a central server for the network.\n It takes a decentralized approach to how the messages are transmitted (or routed). If you’ve no idea what I’m talking about, you can follow Session’s official blog post to know the  difference between centralization and decentralization and explore how it potentially works.\n And, this approach of network helps them to protect the metadata (the information associated with a message like IP address).\n  Not just limited to the latest/greatest privacy-friendly features, but it also supports group chats, voice messages, and also allows you to send attachments.\n  If you head to the  official download page, you will be able to download an . AppImage file. In case you have no clue how it works, you should take a look at our article on  how to use AppImage.\n In either case, you can also head to their  GitHub releases page and grab the  .deb file.\n   I’ve managed to try it on multiple platforms. For the desktop, I utilized the .AppImage file on  Pop!_OS 19.10 to run Session.\n  It’s also easy to recover your account once you’ve backed up your secret code (which is known as  seed) from the settings.\n   Sometimes when you reply from two separate devices (using the same ID), the receiver gets two different conversations.\n  Of course, nothing’s ever perfect. For now, I’m thinking of keeping it installed and considering Session’s features, it is definitely something a privacy-focused user should try.\n What do you think about it? Feel free to let me know your thoughts in the comments below.", "posttime": "2021-08-07 02:14:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电话号码,private,session", "title": "会话：不需要电话号码的私人信使", "title_en": "Session: A Private Messenger That Doesn't Need Phone Number", "transed": 1, "url": "https://itsfoss.com/session-messenger/", "via": "", "real_tags": ["电话号码", "private", "session"]}, {"category": "", "categoryclass": "", "imagename": "f2ab56b2eab25ee6759822692924662e.jpg", "infoid": 1071809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者注：这是长期的 Linux 内核网络开发人员和 Cilium 项目的创建者 Thomas Graf 的帖子 Linux 内核社区最近宣布了 bpfilter，它将用高性能网络过滤器取代长期存在的 iptables 内核实现Linux BPF，同时保证 Linux 用户的无中断过渡。从作为 tcpdump 和 Wireshark 等流行工具底层的包过滤功能的卑微根源，BPF 已经发展成为一个丰富的框架，以高度灵活的方式扩展 Linux 的功能，而不会牺牲性能和安全等关键属性。这种强大的组合已经导致像 Google、Facebook 和 Netflix 这样的 Linux 内核技术的前瞻用户选择 BPF 用于从网络安全和负载平衡到性能监控和故障排除的用例。 Netflix 的 Brendan Gregg 首先将 BPF Superpowers 称为 Linux。这篇文章将介绍这些“超能力”如何使像 iptablesredundant 这样的长期存在的内核子系统同时启用新的内核用例，这是以前很少有人想象的。在过去的 15 年里，我在 Linux 内核社区中编写了许多子系统的代码，包括 TCP/IP 堆栈、iptables 等等，这让 meto 能够近距离观察 BPF 的发展。我很快意识到 BPF 不仅仅是另一个特性，而是代表了一种基础技术转变，随着时间的推移，它将改变 Linux 中网络和安全性的几乎所有方面。我开始做出贡献，并与 Alexei Starovoitov 和 Daniel Borkmann 一起成为其最大的支持者之一，他们现在正在维护 BPFupstream。从这个角度来看，从 iptables 到 bpfilter 的转变只是 BPF 为现代领域振兴 Linux 网络堆栈之旅的下一个合乎逻辑的步骤。要了解这种转变为何如此令人兴奋，请允许我带您了解内核中 iptables 的历史。多年来，iptables 一直是在 Linux 上实现防火墙和数据包过滤器的主要工具。 iptables 及其前身 ipchains 从一开始就是我个人 Linux 之旅的一部分。最初作为用户，后来作为内核开发者。多年来，iptables 既是福也是祸：是因为它的灵活性和快速修复。在多个系统组件正在争夺谁可以安装什么 iptables 规则的环境中调试 5K 规则 iptables 设置时的诅咒。 OH：“在任何团队中，您都需要坦克、治疗师、伤害输出者、具有人群控制能力的人以及另一个了解 iptables 的人”——Jérôme Petazzoni (@jpetazzo) 2015 年 6 月 27 日\n当 20 年前 iptables 开始出现以取代其前身 ipchains 时，防火墙功能的编写范围很简单：当时，网络速度很慢。还记得拨号时调制解调器发出的声音吗？那是 iptables 最初开发和设计的时代。实现 iptables 实现的访问控制列表 (ACL) 的标准做法是使用规则的顺序列表，即每个接收或传输的数据包都与规则列表一个接一个地匹配。然而，线性处理有一个明显的巨大缺点，过滤数据包的成本会随着规则数量的增加而线性增加。一段时间过去了，网络速度提高了，iptables 设置从几十条规则增加到了数千条规则。从性能和延迟的角度来看，遍历顺序的 iptables 列表变得难以忍受。社区很快确定了最常见的瓶颈：拒绝或允许单个 IP 地址和端口组合的一长串规则列表。这导致了 ipset 的引入。 ipset 允许将匹配 IP 地址和/或端口组合的规则列表压缩到哈希表中，以减少 iptables 规则的整体数量。从那以后，这一直作为一种解决方法，而没有解决核心问题本身。不幸的是，ipset 并不能解决所有问题。一个突出的例子是 kube-proxy，它是 Kubernetes 的一个组件，它使用 iptables 和 -j DNAT 规则为服务提供负载平衡。它为服务所服务的每个后端安装多个 iptables 规则。 Foreach 服务添加到 Kubernetes，要遍历的 iptables 规则列表呈指数增长。最近的 KubeContalk 检查了 kube-proxy 性能的所有细节。演讲展示了随着服务数量的增长，不可预测的延迟和性能下降的测量结果。它还揭示了 iptables 的另一个主要弱点：缺乏增量更新。每次添加新规则时，都必须替换整个规则列表。这导致安装代表 20K Kubernetes 服务的 160K iptablesrules 的总持续时间为 5 小时。\n使用基于 IP/端口的机制通常有许多其他明显的缺点，特别是在应用程序容器时代。容器经常被部署和拆除。这可能会导致单个 IP 地址的生命周期较短。一个 IP 地址可能会被一个容器使用几秒钟，然后在几秒钟后被另一个容器重新使用。这给依赖使用 IP 地址进行安全过滤目的的系统带来压力，因为集群中的所有节点必须不断了解容器映射的最新 IP。虽然这在集群内几乎不困难，但跨集群变得非常具有挑战性。深入了解细节超出了这篇博文的范围，因此我们将其保存以供以后的博文使用。近年来，BPF 以疯狂的速度发展，解锁了以前不在内核范围内的东西。这是通过 BPF 提供的令人难以置信的强大和高效的可编程性实现的。以前需要自定义内核开发和内核重新编译的任务现在可以在 BPFsandbox 的安全边界内使用高效的 BPF 程序来完成。以下是一个项目列表，展示了 BPF 如何被各种项目和公司利用： Cilium 正在将 BPF 的力量释放到容器世界，并在 L3-L7 提供强大而高效的网络、安全性和负载平衡。阅读 Cilium 简介以开始了解 Cilium。 @ciliumproject 对 eBPF 和 XPD 所做的事情是我见过的最干净的网络插件，疯狂的道具 https://t.co/oOShMvT2iY pic.twitter.com/mPV864Aia1 — jessie frazelle (@jessfraz) 2017 年 8 月 16 日 Facebook 有介绍了基于 BPF/XDP 的负载平衡的令人兴奋的工作，以取代还包括 DDoS 缓解逻辑的 IPVS。虽然与 iptables 相比 IPVS 是一个诱人的下一步，但 Facebook 在看到性能大约提高了 10 倍之后，已经从 IPVS 迁移到 BPF。\neBPF 性能让你大开眼界！我使用 XDP 编写的一个简单的入口防火墙处理 1100 万个数据包/秒。是时候进行更多优化了！ — Diptanu Choudhury (@diptanu) 2017 年 8 月 21 日 Netflix，尤其是 Brendan Gregg，一直在利用 BPF 的功能进行性能分析和跟踪。 bcc 项目让用户可以使用 BPF 的强大功能，例如，生成惊人的火焰图：有关更多详细信息，包括有关如何利用 BPF 进行应用程序跟踪的许多示例，请查看 Brendan Gregg 的博客文章。正如我对许多在系统工程领域求职的人所说的那样：BPF 体验越来越热 https://t.co/bScbqE6m17 — Brendan Gregg (@brendangregg) 2017 年 5 月 20 日 Google 一直在研究 bpfd使用 eBPF 为远程目标启用强大的 Linux 跟踪。基于围绕 BPF 的上游参与，他们似乎也在考虑将各种内部项目迁移到 BPF。\nCloudflare 正在使用 BPF 来缓解 DDoS 攻击，并发布了多篇博文，并就该主题进行了多次公开演讲。 Suricata 是一个 IDS，它开始使用 BPF 和 XDP 来替换 nfqueue，后者是一个基于 iptables 的有线窃听基础设施。更多细节可以在这个内核食谱中找到。有太多的例子不胜枚举一一列举在这篇博客文章。我们aremaintaining的BPF参考指南中的项目usingBPF更完整的列表。 BPF 的最新发展是一个令人兴奋的提议，以对用户完全透明的方式用 BPF 完全替换 iptables 的内核部分，即现有的 iptables 客户端二进制文件和库将继续工作。您可以在内核邮件列表上找到上游讨论。该提案的作者是 Daniel Borkmann（Covalent）、网络维护者 David Miller（Red Hat）和 Alexei Starovoitov（Facebook）。该提案被 LWN 的一篇文章所涵盖，该文章对最初的讨论进行了很好的总结。 Quentin Monnet 在 FRnOG 30 上展示的下图显示了 bpfilter 与 iptables 和 nftables 相比的一些早期测量结果。它显示了纯软件 BPF 实现以及硬件卸载测试：这些早期的性能数字令人难以置信，并且表明了 BPF 的强大功能。需要注意的是，bpfilter和BPF本身并不能解决iptables使用顺序列表带来的性能问题。这样做将需要本地使用 BPF，如 Cilium 项目所做的那样。\n一些 Linux 内核邮件列表以其火焰战争而闻名。 Haveflamewars在这种情况下爆发了？不，事实上，核心 iptables 维护者已经立即提出了所有针对 BPF 方向的建议。 Florian Westphal 提出了一个框架，该框架将在 bpfilter 之上运行，并将 nftables 转换为 BPF。这允许保留特定领域的 nftables 语言，但受益于 BPF 运行时的所有优势，包括其 JIT 编译器、硬件卸载和工具。 Pablo Neira Ayuso 似乎一直在研究类似的提案，并且已经发表了一系列将 nftables 转换为 BPF 的系列。方法上的主要区别似乎是 Pablo 打算在内核中执行翻译。此后，社区一致同意，任何 BPF 程序的注入都必须通过用户空间发生，并通过 BPFverifier 传递，以保证 BPF 的安全行为。我认为 BPF 是多年来最令人兴奋的 Linux 开发。我们几乎没有触及其潜力的表面，它仍在不断发展。用 BPF 替换 iptables 的内核部分是合乎逻辑的第一步。真正的过渡将是 BPF 原生工具，以及摆脱传统的 IP 地址/端口中心结构。", "note_en": "Author Note: this is a post by long-time Linux kernel networking developer andcreator of the Cilium project, Thomas Graf\n The Linux kernel community recently announced  bpfilter, which will replacethe long-standing in-kernel implementation of iptables with high-performancenetwork filtering powered by Linux BPF, all while guaranteeing a non-disruptivetransition for Linux users.\n From humble roots as the packet filtering capability underlying popular toolslike tcpdump and Wireshark, BPF has grown into a rich framework to extend thecapabilities of Linux in a highly flexible manner without sacrificing keyproperties like performance and safety. This powerful combination has ledforward-leaning users of Linux kernel technology like  Google,  Facebook, and Netflix to choose BPF for use cases ranging from network security andload-balancing to performance monitoring and troubleshooting. Brendan Gregg ofNetflix first called BPF  Superpowers for Linux. This post will cover howthese “superpowers” render long-standing kernel sub-systems like iptablesredundant while simultaneous enabling new in-kernel use cases that few wouldhave previously imagined were possible.\n Having spent the past 15 years in the Linux kernel community authoring code tomany subsystems including the TCP/IP stack, iptables, and many more, allowed meto observe BPF developments up close. I soon realized that BPF was not simplyyet another feature but instead represented a foundational technology shiftthat in time would change nearly every aspect of networking and security withinLinux. I started contributing and became one of its biggest supporters alongside with Alexei Starovoitov and Daniel Borkmann which are now maintaining BPFupstream. In this lens, the shift from iptables with bpfilter is just the nextlogical step in a BPF’s journey to revitalize the Linux networking stack forthe modern area. To understand why this shift is so exciting, allow me to takeyou on a bit of a tour through the history of iptables in the kernel.\n  iptables has been the primary tool to implement firewalls and packet filters onLinux for many years. iptables and its predecessor ipchains have been part ofmy personal Linux journey from early on. Initially as a user, later as a kerneldeveloper. Over the years, iptables has been a blessing and a curse: a blessingfor its flexibility and quick fixes. A curse during times debugging a 5K rulesiptables setup in an environment where multiple system components are fightingover who gets to install what iptables rules.\n  OH: &#34;In any team you need a tank, a healer, a damage dealer, someone with crowd control abilities, and another who knows iptables&#34;\n— Jérôme Petazzoni (@jpetazzo)  June 27, 2015\n When iptables started its life 20 years ago to replace its predecessoripchains, firewall functionality was written with a simple scope:\n  Back then, network speeds were slow. Remember the sound a modem made whendialing in? That was the era when iptables was initially developed anddesigned. The standard practice of implementing access control lists (ACLs) asimplemented by iptables was to use sequential list of rules, i.e. every packetreceived or transmitted is matched against a list of rules, one by one.\n However, linear processing has an obvious massive disadvantage, the cost offiltering a packet can increase linearly with the number of rules added.\n  Some time passed, network speeds increased and iptables setups had grown from adozen rules to sets of thousands of rules. Traversing sequential iptables listshad become unbearable from a performance and latency perspective.\n The community quickly identified the most common bottleneck: long lists ofrules either rejecting or allowing individual IP address and port combinations.This lead to the introduction of  ipset. ipset allows to compress list ofrules matching on IP addresses and/or port combinations into a hash table toreduce the number of iptables rules overall. This has since been serving as aworkaround without addressing the core problem itself.\n Unfortunately, ipset is not an answer to all problems. A prominent example is kube-proxy, a component of  Kubernetes that usesiptables and  -j DNAT rules to provide load-balancing for services. Itinstalls multiple iptables rules for each backend a service is serving to. Foreach service added to Kubernetes, the list of iptables rules to be traversedgrows exponentially.\n A recent  KubeContalkexamined kube-proxy performance in all details. The talk presents measurementsshowing unpredictable latency and reduced performance as the number of servicesgrows. It also reveals another major weakness of iptables: lack of incrementalupdates. The entire list of rules has to be replaced each time a new rule isadded. This leads to a total duration of 5 hours to install the 160K iptablesrules representing 20K Kubernetes services.\n Using IP/port based mechanisms has many other obvious disadvantages in general,in particular in the age of application containers. Containers are deployed andtorn down frequently. This can lead to a short lifetime of individual IPaddresses. An IP address may be used by a container for just seconds and thengets reused by another container a couple of seconds later. This puts stress onsystems which rely on using IP addresses for security filtering purposes as allnodes in a cluster must be constantly aware of the latest IP to containermapping. While this is barely difficult within a cluster, it becomes incrediblychallenging across clusters. Diving into the details is outside of the scope ofthis blog post so we will save it for a future post.\n  BPF has been evolving at an insane pace in recent years, unlocking what waspreviously outside the scope of the kernel. This is made possible by theincredible powerful and efficient programmability that BPF provides. Tasks thatpreviously required custom kernel development and kernel recompilations can nowbe achieved with efficient BPF programs within the safe boundaries of the BPFsandbox.\n The following is a list of projects that show how BPF is being leveraged invarious projects and companies:\n Cilium is unleashing the powers of BPF tothe world of containers and provides powerful and efficient networking,security and load-balancing at L3-L7. Read the  introduction toCilium to get started on learningabout Cilium.\n What  @ciliumproject is doing with eBPF and XPD is the cleanest networking plugin I&#39;ve seen, mad props  https://t.co/oOShMvT2iY  pic.twitter.com/mPV864Aia1\n— jessie frazelle (@jessfraz)  August 16, 2017\n Facebook has presented exciting work on  BPF/XDP based load-balancing toreplaceIPVSthat also includes DDoS mitigation logic. While IPVS is a tempting next stepcompared to iptables, Facebook has already migrating away from IPVS to BPFafter seeing roughly a 10x improvement in performance.\n Mind blown by eBPF performance! A simple ingress firewall I wrote using XDP processes 11 million packets/s. Time for more optimizations!\n— Diptanu Choudhury (@diptanu)  August 21, 2017\n Netflix, in particular Brendan Gregg, have been utilizing thepowers of BPF for performance profiling and tracing. The  bcc projectprovides users access to the powers of BPF to, for example, generate amazingflamegraphs:\n  For more details including many examples on how to leverage BPF forapplication tracing, checkout out Brendan Gregg’s  blogposts.\n as I&#39;ve said to a number of people job hunting in systems engineering: BPF experience is hot and getting hotter  https://t.co/bScbqE6m17\n— Brendan Gregg (@brendangregg)  May 20, 2017\n Google has been working on bpfd which enables  Powerful Linux Tracing forRemote targets usingeBPF.Based on upstream engagement around BPF, they also seem to be looking atmigrating various internal projects over to BPF.\n Cloudflare is using BPF to  mitigate DDoS attacksand has put out several blog posts and presented multiple public talks on thetopic.\n Suricata is an IDS that started using BPF andXDP to replace nfqueue which is an iptables based infrastructure to wiretappackets. More details can be found in this  Kernel Recipestalk.\n There are too numerous examples to list them all in this blog post. We aremaintaining a more complete list of  projects usingBPF in the BPF reference guide.\n  The most recent development in the evolution of BPF is an exciting proposal tocompletely replace the kernel part of iptables with BPF in a way that iscompletely transparent to the user, i.e. existing iptables client binaries andlibraries will continue to work.\n You can find the upstream discussion on the  Kernel mailinglists. Theproposal is authored by Daniel Borkmann (Covalent), the networking maintainerDavid Miller (Red Hat), and Alexei Starovoitov (Facebook). The proposal wascovered by an  LWN article that gives agreat summary of the initial discussion.\n The following graph as presented by Quentin Monnet at FRnOG 30 shows some earlymeasurements of bpfilter in comparison with iptables and nftables. It showsboth the software only BPF implementation as well as a hardware offloaded test:\n  These early performance numbers are incredible promising and an indication ofthe power of BPF. It must be noted that bpfilter and BPF itself will not solvethe performance problems caused by iptables&#39;s use of sequential lists. Doing sowill require native use of BPF such as done by the  Ciliumproject.\n  Some of the Linux kernel mailing lists are famous for their flame wars. Haveflamewars burst out in this case? No, in fact, there have been immediateproposals from core iptables maintainers all aiming into the direction of BPF.\n Florian Westphal has  proposed aframework that willoperate on top of bpfilter and will convert nftables to BPF. This allows tokeep the domain specific nftables language but benefits from all theadvantages of the BPF runtime with its JIT compiler, hardware offload, andtooling.\n Pablo Neira Ayuso seems to have been working on a  similarproposaland has published a series which also translates nftables to BPF. The maindifference in approach seemed to be that Pablo intended to perform thetranslation in the kernel. The community has since agreed that any injection ofBPF programs must occur through user space and be passed through the BPFverifier to guarantee the safety behavior of BPF.\n  I consider BPF the most exciting Linux development since many years. We arebarely scratching the surface of its potential and it is still evolving. Themove to replace the kernel part of iptables with BPF is a logical first step.The real transition will be to BPF native tooling as well as move away fromtraditional IP address/port centric constructs.", "posttime": "2021-08-07 02:13:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社区,community,bpf", "title": "为什么内核社区要用 BPF 代替 iptables？ (2018)", "title_en": "Why is the kernel community replacing iptables with BPF? (2018)", "transed": 1, "url": "https://cilium.io/blog/2018/04/17/why-is-the-kernel-community-replacing-iptables", "via": "", "real_tags": ["社区", "community", "bpf"]}, {"category": "", "categoryclass": "", "imagename": "d523e07669fabd8c81878a6abee972f7.jpeg", "infoid": 1071807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到 2022 年底，它将创建一个供人们使用的 OneNote 应用程序。在接下来的 12 个月中，Microsoft 将在 Windows 上为其 OneNote 应用程序推出一系列更新，旨在创造单一的用户体验。目前，人们可以使用两个版本：随 Office 安装的 OneNote 应用和 Microsoft Store 中提供的 OneNote for Windows 10 应用。不过，微软将更新 OneNote 应用程序，使其具有 Windows 10 上预装的同类应用程序所独有的功能，并且还将为该程序带来视觉上的刷新。微软原本打算在适用于 Windows 10 的 OneNote 应用程序可用时杀死 OneNote 应用程序，但它改变了计划并在 2019 年重新启动了该应用程序。它使用一系列新功能升级了笔记程序，并将其与 Office 安装捆绑在一起一年之后。现在，这家科技巨头表示，它将使用视觉元素更新 OneNote，并将与其他 Windows 应用程序共享这些视觉元素，作为微软为 Windows 11 提供更无缝外观的努力的一部分。合并后的 OneNote 应用程序还将获得最新的 Microsoft 笔和墨水功能，以及新的导航 UI 布局选项。那些已经在使用随 Office 安装的应用程序的人无需执行任何操作，只需等待即将推出的更新。对于使用 OneNote for Windows 10 的用户，一旦其他应用程序准备就绪，Microsoft 将向他们发送应用程序内邀请以升级到其他应用程序。该公司表示，预计将在 2022 年下半年开始发送邀请，现在建议组织让员工使用 OneNote 应用程序，这样他们明年就不必迁移了。 Engadget 推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果您通过这些链接之一购买商品，我们可能会赚取会员佣金。由于您的隐私偏好，此内容不可用。在此处更新您的设置，然后重新加载页面以查看它。", "note_en": "By the end of 2022, it will have created a single OneNote app for people to use.\n  Over the next 12 months, Microsoft is  rolling out a series of updates for its OneNote apps on Windows with the intention of creating a single user experience. At the moment, there are two versions people can use: The OneNote app installed with Office and the OneNote for Windows 10 app available in the Microsoft Store. Microsoft will update the OneNote app with features currently exclusive to its counterpart pre-installed on Windows 10, though, and it will also give the program a visual refresh.\n Microsoft originally intended to kill the OneNote app when the one for Windows 10 became available, but it changed its plans and  revived the app in 2019. It upgraded the note-taking program with a bunch of new features and bundled it with Office installs a year later. Now, the tech giant says it will update OneNote with visual elements that it&#39;ll share with other Windows apps as part of Microsoft&#39;s efforts to give Windows 11 a more seamless look. The merged OneNote application will also gain access to the latest Microsoft pen and ink features, as well as a new navigational UI layout option.\n  Those already using the app installed with Office don&#39;t have to do anything but wait for the upcoming updates to roll out. As for those using OneNote for Windows 10, Microsoft will send them an in-app invite to upgrade to the other application once it&#39;s ready. The company says it expects to start sending out invitations in the second half of 2022, and it now advising organizations to make their personnel use the OneNote app, so they don&#39;t have to migrate next year.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-08-07 01:12:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,microsoft,微软,windows,合并", "title": "微软正在合并其 Windows 版 OneNote 应用程序", "title_en": "Microsoft is Merging Its OneNote Apps for Windows", "transed": 1, "url": "https://www.engadget.com/microsoft-onenote-app-windows-102737016.html", "via": "", "real_tags": ["程序", "microsoft", "微软", "windows", "合并"]}, {"category": "", "categoryclass": "", "imagename": "d177e015d32751b08ce8e2dce2add3e5.jpg", "infoid": 1071806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "化工行业将原材料转化为其他所有行业必不可少的基本产品——从化妆品到汽车再到药品——尽管主要是消费者的想法。但对 Ali Amin-Javaheri 来说，这是他的整个职业生涯。 “这是一个非常吸引人的市场，大多数人一生中都不会花一分钟时间去思考，”他告诉福布斯。 “这是生活在阴影中的市场之一，不直接接触我们，但消费者和大多数人没有意识到化学物质被用来制造地球上的每一种物质。”作为杜邦化学家的孩子, Amin-Javaheri 在自己进入市场之前在这个领域长大。尽管市场规模庞大，2019 年的收入估计为 3.9 万亿美元，但买家与它的互动方式自他父亲时代以来并没有发生太大变化。 Amin-Javaheri 旨在解决这个问题。 “它非常分散，目前的购买体验真的和你想象的一样低效，”他说。 Amin-Javaher 知道将传统行业带入数字时代有多么困难——他是 ChemPoint 团队的一员，该团队试图做他现在创建的事情，最终成为一个中间人分销平台。尽管如此，他还是能够在 2017 年再次尝试，并创建了 Knowde，这是一个现代 B2B 市场，用于直接连接化工行业的买家和卖家。自从与他的联合创始人 Wojciech Krupa 一起创立以来，这家初创公司已经与估计 15,000 家潜在供应商中的数千家签约。鉴于全球对该服务的需求不断增长，这家初创公司筹集了新一轮资金以继续前进。这家总部位于旧金山的公司筹集了 7200 万美元的 B 轮融资，由 Coatue 领投，除了红杉等现有投资者之外，还有 Sound Ventures 和 Mantis 等其他新投资者参与。红杉资本的合伙人肖恩·马奎尔 (Shaun Maguire) 于 2020 年 5 月领导了该公司的 A 轮融资，他告诉福布斯，他最初对该公司感到兴奋，因为它正在处理一个因其规模和分散性而非常适合市场模型的行业。他说他回来投资 B 轮是因为他对公司的进步印象深刻。 “阿里对他将如何开始有了非常清晰的愿景，这让我们非常兴奋，”马奎尔说。 “他们基本上已经完成了他们说他们会做的所有事情，公司一直关注的第一件事就是索引并在 Knowde 上吸引尽可能多的用户。” Knowde Amin-Javaheri 说，第一步只是在网上获取有关不同卖家的信息，而这些信息实际上并不存在。他解释说，该行业在很大程度上仍被困在 PDF 中，这意味着买家通常会在几个月内与卖家来回交流，只是为了了解他们拥有的不同东西，更不用说要求样品或进行购买了。 “我们在内部说的是&#39;你如何把它缩短到 12 天？&#39;我们必须将所有产品都放在平台上，并能够应用基本的搜索过滤器，这样 [客户] 才能真正快速地从 100,000 个 [卖家] 找到合适的 7 个。”一旦这一点到位，该公司就会努力添加更多功能，例如供应商的营销工具和在线交易的能力。迄今为止，Knowde 已将大约 20% 的化学品供应商引入该平台，到目前为止，重点主要集中在北美和欧洲。尽管最初认为这将是一个更适合较小买家以了解市场的解决方案，但该平台也受到了联合利华等大型集团的强烈关注。 Amin-Javaheri 表示，他的初创公司将利用新资金扩大其地理范围并继续增加更多供应商。 “创新发生的方式是通过化学，如果你想更快地创新并获得正确的原料，你必须能够找到合适的供应商，”他说。 “从本质上讲，我们已经为化学打造了 Google，我们为此感到非常自豪。”", "note_en": "The chemicals industry converts raw ingredients to the basic products essential to every other industry — from cosmetics to cars to pharmaceuticals — despite remaining mainly out of the minds of consumers. But to Ali Amin-Javaheri, it’s his entire career. “It’s a really fascinating market that most people don’t spend a minute of their lives thinking about,” he tells  Forbes. “It’s one of those markets that lives in the shadows, and doesn’t touch us directly, but consumers and most people don’t realize that chemicals are used to make every physical good on earth.&#39;&#39;As the child of a DuPont chemist, Amin-Javaheri grew up in the space before entering the market himself. Despite the market’s size, an estimated $3.9 trillion of  revenue in 2019, how buyers interact with it hasn’t changed all that much since his dad’s days. Amin-Javaheri aims to fix that. “It’s massively fragmented and the current buying experience is really as inefficient as you can imagine,” he says.\n    Amin-Javaher knows how difficult it is to bring a legacy industry into the digital age— he was part of a team at ChemPoint that tried to do what he’s created now and ended up as more of a middleman distribution platform. Because of this experience though, he was able to give it another go in 2017 and created Knowde, a modern B2B marketplace for directly connecting buyers and sellers in the chemicals industry. Since launching with his cofounder Wojciech Krupa, the startup has signed on thousands of the estimated 15,000 potential suppliers. Given the growing global appetite for the service, the startup raised a new round of capital to keep going.\n  The San Francisco-based company raised a $72 million Series B round led by Coatue, with participation from other new investors including Sound Ventures and Mantis in addition to existing investors like Sequoia. Shaun Maguire, a partner at Sequoia, who led the firm’s Series A in May 2020, tells  Forbes that he was originally excited about the company because it was tackling a sector that was the perfect fit for a marketplace model due to its size and fragmentation. He says he came back to invest in the Series B because he’s been impressed by the company’s progress. “Ali just had this incredibly clear vision of how he was going to get started and that got us very excited,” Maguire says. “They basically have done everything they said they would do and the number one thing the company has been focused on is indexing and getting as many users on Knowde as possible.”\n    The first step for Knowde Amin-Javaheri says was just getting information about the different sellers online, something that hadn’t really existed. The industry is largely still trapped within PDFs which means buyers are typically going back and forth with sellers for months just to get an idea of the different things they had, let alone request a sample or make a purchase, he explains. “What we say internally is ‘how do you get it down to 12 days?’ We have to put every product on the platform, and be able to apply basic search filters, so [customers] can go from 100,000 [sellers] to the right seven really quickly.” Once this was in place the company worked to add more features like marketing tools for the suppliers and the ability to make the transactions online.\n    Knowde has brought approximately 20% of chemical suppliers on to the platform thus far, and so far the focus has mainly been on North America and Europe. Despite originally thinking this would be a solution more designed for smaller buyers to get a feel for the market, the platform has seen strong traction from large groups like Unilever too. Amin-Javaheri says his startup will use the fresh capital to expand its geographic reach and continue adding more suppliers. “The way that innovation happens is through chemistry, if you want to innovate faster and get the right ingredients, you have to be able to find the right suppliers,” he says. “We take a lot of pride in the fact that essentially we’ve built the Google for chemistry.”", "posttime": "2021-08-07 01:11:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "knowde,online", "title": "化工行业在线市场 Knowde 筹集了 7200 万美元的 B 轮融资，由 Coatue 领投，红杉、Sound Ventures 和 Mantis 参与", "title_en": "Knowde, an online marketplace for the chemicals industry, raises a $72M Series B led by Coatue, with Sequoia, Sound Ventures, and Mantis participating", "transed": 1, "url": "https://www.forbes.com/sites/rebeccaszkutak/2021/08/05/knowde-raises-72-million-on-its-journey-to-bring-the-chemicals-market-online/", "via": "", "real_tags": ["knowde", "online"]}, {"category": "", "categoryclass": "", "imagename": "ce1bb4ff2971d89f10a536623322e1b4.jpg", "infoid": 1071805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据最新公开的法庭文件，谷歌考虑收购 Epic Games，因为两家公司就 Epic 的 Fortnite Android 应用程序展开了争论。昨晚，谷歌取消了 Epic 对谷歌的反垄断投诉中的一些删节，Epic 上个月对其进行了修改和重新提交。投诉仍然省略了许多关于谷歌与特定公司交易的细节，但新的细节反映了谷歌内部关于 Android 平台竞争的沟通。 Epic 声称谷歌计划通过通过其他渠道分发 Fortnite 来回避谷歌的官方 Play 商店佣金，并且在一个未编辑的部分中，它引用了一份谷歌内部文件，称 Epic 的计划是威胁谷歌的“传染病”。以下是 Epic 对这种情况的描述：谷歌甚至与业务合作伙伴分享其垄断利润，以确保他们同意排除竞争，开发了一系列内部项目来解决它从 Epic 和其他人为消费者和开发商提供有竞争力的替代品，甚至考虑购买部分或全部 Epic 以消除这种威胁。讨论这种可能性的内部消息仍然保密，投诉并未表明谷歌曾就这些计划与 Epic 接触过。它还没有给出讨论的时间表——尽管它可能发生在 Epic 于 2018 年开始计划在 Android 上推出 Fortnite 之后。 Epic 还声称谷歌向其提供了在 Play 商店推出 Fortnite 的“特别优惠”。在另一个未密封的部分，投诉描述了一位 Google Play 经理就其侧载 Fortnite 的计划与 Epic 联系——并且显然承认侧载在这个过程中是一种“坦率地糟糕”的体验。一位经理联系了 Epic 的副总裁兼联合创始人，以评估 Epic 对一项特殊交易的兴趣，并讨论了通过直接下载“在 Android 上获得 Fortnite 的体验”。经理的通话记录指出，她认为直接下载 Fortnite 是“坦率地说是糟糕透顶的”和“糟糕的体验”，并且 Epic 应该“担心大多数人不会通过 15 个以上的步骤”。另一部分说，“工作人员在内部承认，谷歌对希望直接下载的消费者施加的困难导致了‘[p]糟糕的用户体验’，因为有 15 个以上的步骤来获得应用 [通过侧载] vs Play 或 iOS 上的 2 个步骤。&#39;”\n总体而言，“谷歌明白，它为直接下载设置的无数障碍具有保护其应用分发垄断地位和限制开发人员分发应用的能力的效果，”Epi​​c 在其投诉中称。在一份名为“对 Epic 的回应”的内部文件中，一位谷歌员工解释说，与直接下载相关的“安装摩擦”对用户来说“不仅是一种糟糕的体验”，而且谷歌“从其数据中知道它将极大地限制 [Epic 的] 抵达”。该文件继续解释说，“[f]uture [Fortnite] 更新将受到挑战：定位，通过网络更新体验”；直接下载方法“与恶意应用程序最相关”，这将“与 [Epic 的] 品牌/人口统计数据不兼容”；并且“[t] 他的方法会造成严重的用户混淆，因为 [Google Play] 仍然会吸引 [数十亿] 用户，他们将搜索 Fortnite 并遇到不清楚如何解决的死胡同”。 Epic 的诉讼最近与针对谷歌的更大的州反垄断投诉有关。与 Epic 一样，一组州检察长声称 Android 的开放程度远低于谷歌声称的那样，称其削减故意设置障碍——包括 Android 手机功能和与手机制造商的交易——以限制第三方应用商店并阻止直接下载应用。谷歌还删除了州投诉中的一些删节，主要涉及其对 Android 工作原理的内部描述。例如，在 2017 年关于亚马逊 App Store 的演讲中，谷歌显然指出，“如果我们说实话，我们会承认大多数用户和开发者并没有有意识地‘选择’他们使用默认设置。”在 2019 年，它将 Apple 和 Android 称为“新的封闭互联网生态系统”，“通过应用商店集中分发内容……[和] 通过应用商店服务进行支付”——尽管这些言论的大背景尚不清楚。谷歌强烈否认了这两起诉讼中的指控。 “开放的 Android 生态系统让开发者可以通过多个应用商店分发应用。对于选择使用 Play 商店的游戏开发商，我们有一致的政策，对开发商公平，并确保商店对用户的安全，”它在之前对 Epic 修改后的文件的评论中说。 “虽然 Fortnite 在 Android 上仍然可用，但我们不能再在 Play 上提供它，因为它违反了我们的政策。我们将继续为这些毫无根据的指控辩护。” Epic 去年对苹果和谷歌提起诉讼，因为它推出了新的 Fortnite 支付系统，回避了他们的支付系统和应用内购买佣金，导致两家公司将 Fortnite 踢出他们的移动商店。 （Fortnite 仍可通过侧载在 Android 设备上使用。）Epic 对 Apple 的诉讼于 5 月开始审理，目前正在等待法院的裁决。", "note_en": "Google considered buying Epic Games as the companies sparred over Epic’s  Fortnite Android app, according to  newly unsealed court filings. Last night, Google lifted some of its redactions in Epic’s antitrust complaint against Google, which  Epic amended and refiled last month. The complaint still omits many details about Google’s dealings with specific companies, but the new details reflect internal Google communications about competition on the Android platform.\n Epic claims Google was threatened by its plans to sidestep Google’s official Play Store commission by distributing  Fortnite through other channels, and in an unredacted segment, it quotes an internal Google document calling Epic’s plans a “contagion” threatening Google. Here’s Epic’s description of the situation:\n Google has gone so far as to share its monopoly profits with business partners to secure their agreement to fence out competition, has developed a series of internal projects to address the “contagion” it perceived from efforts by Epic and others to offer consumers and developers competitive alternatives, and has even contemplated buying some or all of Epic to squelch this threat.\n The internal messages discussing that possibility remain secret, and the complaint doesn’t indicate that Google ever reached out to Epic with these plans. It also doesn’t give a timeframe for the discussion — although it presumably happened after Epic started its plans to launch  Fortnite on Android in 2018.\n Epic has also alleged that Google offered it a “special deal” to launch  Fortnite on the Play Store. In another unsealed section, the complaint describes a Google Play manager reaching out to Epic about its plans to sideload  Fortnite — and apparently admitting that sideloading is a “frankly abysmal” experience in the process.\n One manager contacted Epic’s Vice President and Co-Founder to gauge Epic’s interest in a special deal and, among other things, discussed “the experience of getting  Fortnite on Android” via direct downloading. The manager’s call notes state that she viewed direct downloading  Fortnite as “frankly abysmal” and “an awful experience”, and that Epic should “worry that most will not go through the 15+ steps.”\n Another section says that “staff members have acknowledged internally that the difficulty Google imposes on consumers who wish to direct download leads to a ‘[p]oor user experience,’ in that there are ‘15+ steps to get app [via sideloading] vs 2 steps with Play or on iOS.’”\n Overall, “Google understands that the myriad barriers it erects to direct downloading have the effect of protecting its app distribution monopoly and limiting developers’ ability to distribute their apps,” Epic alleges in its complaint.\n In an internal document titled “Response to Epic”, a Google employee explained that the “install friction” associated with direct downloading was “not only a bad experience” for users but that Google knew “from its data that it will drastically limit [Epic’s] reach”. The document goes on to explain that “[f]uture [ Fortnite] updates will be challenged re: targeting, update experience via web”; that the direct downloading approach was “most associated with malicious apps”, which would be “incompatible with [Epic’s] brand/demographics”; and that “[t]he approach will create significant user confusion, since [Google Play] will still attract [billions] of users who will search for  Fortnite and run into deadends that aren’t clear how to resolve”.\n Epic’s lawsuit was recently linked with a much bigger  state antitrust complaint against Google. Like Epic, a group of state attorneys general alleges that Android is much less open than Google claims, saying it cuts create deliberate barriers — including Android phone features and deals with phone makers — to restrict third-party app stores and discourage downloading apps directly.\n  Google also removed some redactions in  the state complaints, mostly relating to its internal descriptions of how Android works. In a 2017 presentation about Amazon’s App Store, for instance, Google apparently noted that “if we were honest we would admit that most users and developers aren’t consciously ‘choosing’ they are going with the default.” And in 2019, it referred to Apple and Android as “new closed internet ecosystems” that “centralized content distribution via app stores… [and] payments via app store services” — although the larger context of those remarks isn’t clear.\n Google has strongly denied the claims in both suits. “The open Android ecosystem lets developers distribute apps through multiple app stores. For game developers who choose to use the Play Store, we have consistent policies that are fair to developers and keep the store safe for users,” it said in a previous comment on Epic’s amended filing. “While  Fortnite remains available on Android, we can no longer make it available on Play because it violates our policies. We will continue to defend ourselves against these meritless claims.”\n Epic filed lawsuits against both Apple and Google last year after it introduced a new  Fortnite payment system that sidestepped their payment systems and in-app purchase commissions, leading both companies to kick  Fortnite off their mobile stores. ( Fortnite is still available on Android devices via sideloading.) Epic’s case against Apple went to trial in May and is currently awaiting a ruling from the court.", "posttime": "2021-08-07 01:11:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,epic", "title": "法庭文件：Epic 称谷歌计划通过侧载威胁性“传染”来分发 Fortnite，并考虑购买部分或全部 Epic", "title_en": "Court filings: Epic says Google called plans to distribute Fortnite via sideloading a threatening “contagion”, and contemplated buying some or all of Epic", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22612921/google-epic-antitrust-case-court-filings-unsealed?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["谷歌", "google", "epic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我家有一个传统，每个人都轮流在一年一度的圣诞布丁中表达一个秘密的愿望。重要的是，愿望对许愿者来说是保密的，否则布丁魔法将不起作用，所以自从搬到美国后，我实施了一种散列我的愿望的新方法，这样它就可以通过短信搅拌，而搅拌器不知道愿望。布丁秘法专家向我保证，布丁魔法可以反转任何散列函数来恢复最初的愿望。去年，我从 OpenSSH 随机艺术中获得灵感，该艺术使人们能够比通过比较简单的十六进制字符串更可靠地查看两个密钥是否相同。 +-----[第一]-----+ +-----[第二]----+| .=o。 . | | ..=o 。 || . *+*。 ○ | | o 0+.. o || =.*..o | | Xo|| o + .. | | . * . . ||所以。 | |所以 。 ||哦。 | |哦。 || . . . | | . ..||哦。| | .o|| E.| | Eo|+-----------------+ +-----------------+ 试图找出十六进制代码的差异是很难，但你的大脑真的很擅长注意到 ASCII 艺术是不同的。我真的很喜欢生成的图像的通风感，所以我想我会深入研究它们是如何制作的。我几乎没有在线研究表明 OpenSSH 使用了一种由 Alexander von Gernler 设计的名为“The Drunken Bishop”的算法。然后，我找到了 Dirk Loss、Tobias Limmer 和 Alexander von Gernler 撰写的出色分析和文章，其中清楚地描述了该过程及其一些更精细的特征。我期待粗糙的密码学，但令我宽慰的是，算法真的很简单，并且巧妙地总结了一个有点奇怪的短篇小说：\n彼得主教发现自己在一个环境中庭的中间。四面都有墙，显然没有出口。地板铺有方砖，严格地黑白交替。他的头很痛——可能是因为他之前喝了太多酒——他开始随意地四处游荡。嗯，准确的说，他只走对角线——就像棋盘上的主教一样。当他撞到一堵墙时，他会移动到一边，这会将他从黑色瓷砖带到白色瓷砖（反之亦然）。每次移动后，他都会在地板上放一枚硬币，以记住他以前去过那里。走了64步，就在没有硬币的时候，彼得突然醒了过来。多么奇怪的梦啊！ Dirk Loss、Tobias Limmer 和 Alexander von Gernler – 醉酒主教：OpenSSH 指纹可视化算法的分析 总结：我们创建了一个棋盘（OpenSSH 为 17 x 9）并将我们的“主教”放在中心，将其标记为开始。然后我们将输入分解为定义 4 种可能移动的位对：{00：左上（↖），01：右上（↗），10：左下（↙），11：右下（↘ )} 对于输入中的每一对位，我们将象棋在棋盘上移动一个空间，并增加一个计数器，记录我们访问每个方块的次数。主教不是在边缘移离板，而是沿着侧面滑动，就好像它们是墙壁一样。例如，如果象在棋盘的右边缘并且下一步是 01，我们只需将象垂直向上滑动一个空格，像往常一样增加新方格上的计数器。以这种方式沿着墙壁滑动可以让象棋棋盘上的方块从黑色变为白色。在执行输入位指定的所有步骤后，我们标记最终位置。最后，通过根据访问次数为板上的每个位置分配一个符号来简单地绘制板。 OpenSSH 使用这些选择来反映“一行越来越粗的 ASCII 字符”的符号：[&#39; &#39;, &#39;.&#39;, &#39;o&#39;, &#39;+&#39;, &#39;=&#39;, &#39;*&#39;, &#39;B&#39;, &#39;0&#39;, &#39; X&#39;, &#39;@&#39;, &#39;%&#39;, &#39;&amp;&#39;, &#39;#&#39;, &#39;/&#39;, &#39;^&#39;]\n描述没有定义如果计数器 &gt;13 应该做什么，所以我选择环绕，这在实践中似乎不太可能发生。这就是 ASCII 的真正含义。但是我无法抗拒将 HTML &lt;canvas&gt; 取出并播放更多...与其将棋盘状态绘制为字符串，我们还可以利用画布的完整矢量图形功能做更多的事情。我首先划分绘图区域，为主教板上的每个方块指定一个不同的位置。当板的宽度大于高度以考虑等宽字体的非方形特性时，ASCII 版本效果最佳。在画布上制作方形网格似乎更自然，但没有要求。更大的网格会导致更长的路径和更斜的格子感觉，因为这个象不太频繁地滑到其他颜色方块上。较小的董事会感觉更忙。 17 x 17 尺寸似乎效果很好。然后我决定非常简单地遵循主教所采取的路径，在每个访问点画一个圆，其半径等于该点被访问的次数。按照创建顺序的路径会导致后面的点出现在前面的点之上。用简单的颜色循环填充圆圈效果很好，我很快就得到了令人满意的结果。我很快发现，直接从输入字符串中拉出位对会导致向上和向右移动，从而导致图像不平衡。这样做的输入消息和输出图像之间有很好的联系，但结果在视觉上并不吸引人。首先使用 SHA-3 对输入进行哈希处理为我们提供了一个固定长度的输入，可以很好地探索整个空间。我留下了散列或不向用户开放的选项。我相信这个简单的想法可以做更多的事情。扩展到三个维度或动画它浮现在脑海中。在明年的布丁愿望需要发送之前，我们将看到会发生什么……", "note_en": "There’s a tradition in my family that everyone takes a turn stirring a secret wish into the yearly  christmas pudding. It’s important that the wishes remain secret to the wisher or the pudding magics wont work so since moving to America I’ve implemented a new way of hashing my wish so it can be stirred in via text message without the stirrer knowing the wish. Experts in pudding arcana assure me that pudding magic can reverse any hash function to recover the original wish.\n Last year I took inspiration from the OpenSSH  random art that allows a human to see if two keys are the same more reliably than by comparing simple hex strings.\n      +-----[first]-----+ +-----[second]----+| .=o. . | | ..=o . || . *+*. o | | o 0+.. o || =.*..o | | X.o. o || o + .. | | . * . . || S o. | | S o . || o . | | o . || . . . | | . ..|| o .| | .o|| E.| | Eo|+-----------------+ +-----------------+\n Trying to spot the difference in the hex codes is tough but your brain is  really good at noticing that the ASCII art are different.\n I really like the airy feeling of the resulting images, so I thought I’d dig into how they are made.\n   I little online research revealed that OpenSSH uses an algorithm called “The Drunken Bishop”  devised by Alexander von Gernler. I then found an excellent  analysis and write up by Dirk Loss, Tobias Limmer, and Alexander von Gernler that clearly describes the process and some of its finer features.\n I expected gnarly cryptography, but to my relief the algorithm is really quite simple and is neatly summarised by a somewhat bizzare short story:\n Bishop Peter finds himself in the middle of an ambient atrium. There are walls on all four sides and apparently there is no exit. The floor is paved with square tiles, strictly alternating between black and white. His head heavily aching—probably from too much wine he had before—he starts wandering around randomly. Well, to be exact, he only makes diagonal steps—just like a bishop on a chess board. When he hits a wall, he moves to the side, which takes him from the black tiles to the white tiles (or vice versa). And after each move, he places a coin on the floor, to remember that he has been there before. After 64 steps, just when no coins are left, Peter suddenly wakes up. What a strange dream!\n  Dirk Loss, Tobias Limmer, and Alexander von Gernler – The drunken bishop: An analysis of the OpenSSHfingerprint visualization algorithm\n To summarise: we create a chess board (17 by 9 for OpenSSH) and place our “Bishop” at the center, marking this as the start. Then we break the input into pairs of bits that define 4 possible moves:\n {00: up-left (↖), 01: up-right (↗), 10: down-left(↙), 11: down-right (↘)}\n For each pair of bits in the input we move the bishop one space on the board and increment a counter recording how many times we visit each square. Instead of moving off the board at the edges, the bishop slides along the sides as if they were walls. For example, if the bishop is on the right edge of the board and the next move is 01 we simply slide the bishop one space vertically up, incrementing the counter on the new square as normal. Sliding along the walls in this way allows the bishop to change from black to white squares on the chess board. After carrying out all the steps dictated by the input bits we mark down the final position.\n Finally, the board is drawn simply by assigning a symbol to each position on the board according to how many times it was visited. OpenSSH uses these symbols chosen to reflect “a line of ASCII characters getting thicker”:\n [&#39; &#39;, &#39;.&#39;, &#39;o&#39;, &#39;+&#39;, &#39;=&#39;, &#39;*&#39;, &#39;B&#39;, &#39;0&#39;, &#39;X&#39;, &#39;@&#39;, &#39;%&#39;, &#39;&amp;&#39;, &#39;#&#39;, &#39;/&#39;, &#39;^&#39;]\n The description doesn’t define what should be done if a counter is &gt;13, so I chose to wrap around, this seems unlikely to occur in practice.\n That’s really it for the ASCII. But I couldn’t resist getting the HTML  &lt;canvas&gt; out and playing a little more…\n   Rather than draw the board state to a string, there’s plenty more we could do with the full vector graphics power of the canvas.\n I started out by dividing the drawing area to give a distinct position for each square on the bishop’s board. The ASCII version works best when the board is wider than it is tall to account for the non-square nature of the monospace font. On the canvas it seems more natural to make a square grid, but there’s no requirement to. A larger grid results in longer paths and a more diagonal lattice feel, as this bishop slides onto the other colour squares less frequently. Smaller boards feel busier. A  17 x 17 size seemed to work well.\n I then decided to quite simply follow the path taken by the bishop drawing a circle at each visited point with a radius equal to the number of times the point was visited. Following the path in the order it was made causes later points to appear on top of earlier points. Filling the circles with a simple colour cycle worked nicely and I was getting a pleasing result in no time.\n I quickly found that simply pulling the bit pairs directly out of an input string biases towards upward and to the right moves leading to lopsided images. There is a nice connection between the input message and the output image doing this, but the results aren’t as visually appealing. Hashing the input with  SHA-3 first gives us a fixed length input that nicely explores the full space. I left the option to hash or not open to the user.\n I’m sure there’s lots more could be done with this simple idea. Extending to three dimensions or animating it come to mind. We’ll see what comes up before next year’s pudding wish needs sending…", "posttime": "2021-08-07 01:10:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,主教,bishop,愿望", "title": "醉酒主教算法", "title_en": "The Drunken Bishop Algorithm", "transed": 1, "url": "https://www.jfurness.uk/the-drunken-bishop-algorithm/", "via": "", "real_tags": ["算法", "主教", "bishop", "愿望"]}, {"category": "", "categoryclass": "", "imagename": "0682becf6217f89473556069726eec16.jpg", "infoid": 1071803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过数月的低迷，世界上最大的 COVID-19 治疗试验之一终于重新启动。 Solidarity 是由世界卫生组织 (WHO) 领导的一项全球研究，将在住院的 COVID-19 患者中测试三种新药：癌症药物伊马替尼，一种名为英夫利昔单抗的抗体，用于治疗自身免疫性疾病，以及青蒿琥酯，一种抗疟药。挪威公共卫生研究所的 John-Arne Røttingen 说，这些药物已经运往芬兰，芬兰是第一个获得所有批准的国家，他是该研究执行小组的主席。 “我预计第一批患者可能随时会被招募到那里，”他说。其他国家很快就会加入 SolidarityPlus，因为新阶段被称为； 40 多个正在获得道德和监管批准。当最初的 Solidarity 试验于 2020 年 3 月开始时，这是第一次：在大流行期间同时在数十个国家测试药物的努力。到年底，它已经对四种治疗方法做出了判决——没有一种显示出益处——但随后陷入了与制药公司的谈判和监管延误的泥潭。 “Solidarity 再次进行随机临床试验真是太好了，因为它们已经在大流行期间为我们的治疗方法做出了重要贡献，”斯克里普斯研究转化研究所所长 Eric Topol 说。 “我们不能因为需要为重症 COVID 患者提供更好的治疗而自满。”尽管 COVID-19 疫苗的开发取得了巨大的成功，但只有两种药物被证明可以降低住院患者的 COVID-19 死亡率。 2020 年 6 月，英国的恢复试验发现，地塞米松是一种廉价的类固醇，可将该组的死亡人数减少多达三分之一。 2 月，Recovery 研究人员宣布托珠单抗（tocilizumab）是一种阻断白细胞介素 6 受体的单克隆抗体，可进一步降低死亡率。这两种药物的作用是抑制重症患者的过度免疫反应。新药还针对免疫系统而不是病毒本身。 Røttingen 解释说，在 Solidarity 中的重症患者中，抗病毒药物可能已经太晚了。 （例如，针对 SARS-CoV-2 的单克隆抗体在严重疾病发展之前给予最有效。）但病情较重的患者可以从其他针对免疫系统的药物中受益，伦敦帝国理工学院的重症监护专家安东尼戈登说.尽管地塞米松广泛地抑制免疫反应并且托珠单抗强有力地关闭了一个特定的途径，“我们仍然可以阻止其他途径，并且可能会有所作为，”戈登说。伊马替尼是一种用于治疗某些白血病和其他类型癌症的口服药物，也可以保护肺泡内的上皮细胞，肺泡上的氧气从肺部进入血液。 6 月发表的一项针对荷兰 400 名住院 COVID-19 患者的安慰剂对照试验显示，服用该药的患者在呼吸机上花费的时间更少，死亡的可能性也更低。戈登说，虽然没有统计学意义，但这些数据足以激发更大规模的研究，他是另一项名为 REMAP-CAP 的国际试验的一部分，该试验也计划测试该药物。英夫利昔单抗是一种单次输液的抗体，可阻断肿瘤坏死因子 α（免疫系统中的关键信号分子），用于治疗自身免疫性疾病，如类风湿性关节炎和炎症性肠病。 Røttingen 说，来自大量患者群体的一些观察数据表明，该药物还可以预防 COVID-19。\n青蒿琥酯是一种注射用的青蒿素衍生物，是疟疾寄生虫的强大杀手，在 SARS-CoV-2 的实验室研究中也显示出一些抗病毒活性。但是 Solidarity 正在测试它的另一个作用：该药物似乎可以减少炎症并抵消将免疫细胞吸引到组织中的信号。这可以阻止在严重的 COVID-19 中损害肺部的免疫反应。团结工会的复兴由来已久。 2020 年 10 月，它发布了来自 400 家医院的 11,000 多名患者的结果，这些结果通过显示四种治疗方法无效：HIV 联合疗法洛匹那韦/利托那韦、疟疾药物羟氯喹、干扰素β和吉利德Sciences 的抗病毒药物瑞德西韦。瑞德西韦的试验组持续了一段时间以收集更多数据——预计未来几周将获得完整的结果——但到 1 月下旬，所有试验组都已停止。不久之后，一个独立专家委员会选出了这三种新药。 Røttingen 说，推迟的部分原因是与制造商进行谈判，以确保如果这些药物有效，它们将在全球范围内以可承受的价格提供，部分原因是参与国的监管和伦理批准需要时间。罗廷根说：“我们确实看到，在流行初期，人们强烈愿意在正常系统之外进行工作，并真正加快进程，而现在情况似乎有所不同。”他补充说，这是可以理解的，“但这也表明这些流程不适合紧急情况。我们需要面向未来的快速通道系统，适用于所有国家。”", "note_en": "After months in the doldrums, one of the world’s largest trials of COVID-19 treatments is finally restarting. Solidarity, a global study led by the World Health Organization (WHO), will test three new drugs in hospitalized COVID-19 patients: the cancer drug imatinib, an antibody named infliximab that is used to treat autoimmune diseases, and artesunate, an antimalarial.\n The medicines have been shipped to Finland, the first country to have all approvals in place, says John-Arne Røttingen of the Norwegian Institute of Public Health, who chairs the study’s executive group. “I expect that the first patients will probably be recruited there any day,” he says. Other countries could soon join SolidarityPlus, as the new phase has been dubbed; more than 40 are in the process of getting ethical and regulatory approvals.\n When the  original Solidarity trial started in March 2020 it was a first: an effort to test drugs in dozens of countries simultaneously in the middle of a pandemic. By late in the year it had  delivered verdicts on four treatments—none showed a benefit—but then became mired in negotiations with pharmaceutical companies and regulatory delays. “It’s great that Solidarity is proceeding with randomized clinical trials again, as they have already made an important contribution to our therapeutic approach during the pandemic,” says Eric Topol, director of the Scripps Research Translational Institute. “We can’t be at all complacent about needing better therapies for patients with severe COVID.”\n    Although COVID-19 vaccine development has been a huge success story, only two drugs have proved to reduce COVID-19 mortality in hospitalized patients. In June 2020, the  United Kingdom’s Recovery trial  found that dexamethasone, a cheap steroid, reduced deaths in that group by up to one-third. In February,  Recovery investigators announced that tocilizumab, a monoclonal antibody that blocks the receptor for interleukin-6, reduced mortality a bit further. Both drugs work by dampening the overshooting immune response in severely sick patients.\n The new drugs also target the immune system rather than the virus itself. In the severely ill patients included in Solidarity, it’s probably too late for an antiviral drug to work, Røttingen explains. (Monoclonal antibodies to SARS-CoV-2, for example, are most effective when given before serious disease develops.) But sicker patients could benefit from additional drugs that target the immune system, says Anthony Gordon, a critical care specialist at Imperial College London. Although dexamethasone broadly dampens the immune response and tocilizumab powerfully shuts off one particular pathway, “There are still other pathways that we can block and maybe make a difference,” Gordon says.\n Imatinib, an oral drug used to treat some leukemias and other types of cancer, can also protect the epithelium lining the alveoli, where oxygen crosses from the lungs into the blood. A placebo-controlled trial in 400 hospitalized COVID-19 patients in the Netherlands,  published in June, showed patients on the drug spent less time on ventilators and were less likely to die. Although not statistically significant, the data were encouraging enough to spur larger studies, says Gordon, who is part of another  international trial called REMAP-CAP that is also planning to test the drug.\n Infliximab is an antibody given as a single infusion that blocks tumor necrosis factor alpha, a pivotal signaling molecule in the immune system, and is used to treat autoimmune diseases such as rheumatoid arthritis and inflammatory bowel disease. Some observational data from large patient populations suggest the drug can also protect against COVID-19, Røttingen says.\n Artesunate, an injected derivative of artemisinin and a powerful killer of malaria parasites, has also shown some antiviral activity in laboratory studies of SARS-CoV-2. But Solidarity is testing it because of another effect: The drug appears to reduce inflammation and counteract signals that attract immune cells into tissues. That could stop the immune reactions that damage the lungs in severe COVID-19.\n Solidarity’s revival was a long time coming. In October 2020, it  published results from more than 11,000 patients in 400 hospitals that deflated hopes—and punctured hype—by showing no benefit for four treatments: the HIV combination therapy lopinavir/ritonavir, the malaria drug hydroxychloroquine, interferon-beta, and Gilead Sciences’s antiviral drug remdesivir. The remdesivir arm was continued for a while to gather more data—full results are expected in the coming weeks—but  by late January all arms had been stopped.\n An independent expert committee picked the three new drugs soon after. The delay is due partly to negotiations with the manufacturers to ensure that the drugs would be available at affordable prices worldwide if they turned out to work, Røttingen says, and partly due to the time needed for regulatory and ethical approvals in participating countries.\n “We have definitely seen that there was a strong willingness to sort of work outside the normal system and really speed up processes in the beginning of the epidemic, and that seems to be less the case now,” Røttingen says. That’s understandable, he adds, “But it also demonstrates that these processes are not fit for emergencies. We need fast-track systems for the future, in all countries.”", "posttime": "2021-08-07 01:10:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "试验,trial,药物", "title": "Covid-19 治疗的大规模试验正在重新开始。这些是药物", "title_en": "Giant trial of Covid-19 treatments is restarting. These are the drugs", "transed": 1, "url": "https://www.sciencemag.org/news/2021/08/giant-trial-covid-19-treatments-restarting-here-are-drugs-it-s-betting", "via": "", "real_tags": ["试验", "trial", "药物"]}]