[{"category": "", "categoryclass": "", "imagename": "4da029059ce4ffb4ed70f624a599d42c.jpeg", "infoid": 1009395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook、Twitter和Instagram等社交媒体平台最初是作为与朋友、家人和感兴趣的人联系的一种方式。但如今社交媒体上的任何人都知道，这是一个日益分裂的局面。\n毫无疑问，你已经听说过黑客甚至外国政府正在利用社交媒体操纵和攻击你的报道。你可能会想，这怎么可能呢？作为一名研究社交媒体和安全的计算机科学教授，我可以解释这一点，并提供一些想法来说明你可以做些什么。\n社交媒体平台不会简单地向你提供你关注的账户中的帖子。他们使用算法在一定程度上根据“喜欢”或“投票”来管理你看到的内容。一篇帖子被显示给一些用户，这些人的反应越多-无论是积极的还是消极的-它就会更多地被突出显示给其他人。可悲的是，谎言和极端内容往往会引起更多的反应，因此传播得又快又广。\n但是谁在做这个“投票”呢？通常情况下，这是一大群账户，称为机器人，与真人并不相符。事实上，它们是由黑客控制的，通常是在世界的另一端。例如，研究人员报告说，在讨论新冠肺炎的推特账户中，超过一半是机器人。\n作为一名社交媒体研究人员，我看到数以千计的账号都有相同的头像“赞”的帖子异口同声。我看到账号每天发布数百次，远远超过一个人的能力。我见过一个账号，自称是一位来自佛罗里达的“全美爱国军嫂”，用英语发帖痴迷于移民，但其账号历史记录显示，该账号过去常常用乌克兰语发帖。\n像这样的假账号被称为“袜子木偶”-暗示着一只隐藏的手通过另一个身份说话。在许多情况下，通过查看帐户历史记录就可以很容易地揭穿这种欺骗行为。但在某些情况下，要让袜子木偶账户看起来像是真实的，需要投入大量资金。\n例如，珍娜·艾布拉姆斯(Jenna Abrams)的账号拥有7万粉丝，她的排外和极右翼观点被《纽约时报》等主流媒体引用，但实际上是由俄罗斯政府资助的巨魔农场互联网研究机构(Internet Research Agency)控制的发明，而不是一个活生生的人。\n巨魔通常不太关心这些问题，他们更关心的是制造分裂和不信任。例如，研究人员在2018年得出结论，在分裂问题的双方中，一些最具影响力的账户，如黑人生命也是如此，蓝色生命也是如此，都是由巨魔农场控制的。\n巨魔们不仅仅是煽动分歧，他们还想鼓励人们相信真相已经不存在了。分而治之。不信任任何可能成为领导者或值得信赖的声音的人。把头砍下来。打击士气。把你弄糊涂了。这些都是毁灭性的攻击策略。\n即使作为一名社交媒体研究人员，我也低估了这些攻击在多大程度上影响了我的观点。我想我足够聪明，可以读我想看的书，扔掉其余的，毫发无损地离开。尽管如此，当我看到一个拥有数百万个赞的帖子时，我还是有一部分认为它肯定反映了公众的意见。我看到的社交媒体订阅会受到它的影响，更重要的是，我会受到我真正朋友的意见的影响，他们也会受到影响。\n整个社会正在被巧妙地操纵，使其相信当存在合法的共同点时，他们在许多问题上站在相反的一边。\n我主要关注的是美国的例子，但同样类型的袭击正在世界各地上演。通过让民主国家的声音相互对立，威权政权可能开始看起来比混乱更可取。\n平台的行动一直很缓慢。可悲的是，错误信息和虚假信息推动了使用，对商业有利。出于对言论自由的担忧，不采取行动往往是正当的。言论自由是否包括创建10万个虚假账户的权利，其明确目的是散布谎言、分裂和混乱？\n那么你能对此做些什么呢？你可能已经知道要检查你阅读和转发的内容的来源和日期，但常识的媒体素养建议是不够的。\n首先，更谨慎地使用社交媒体。选择与特定的人联系，而不是只使用默认提要。你可能会惊讶地发现你错过了什么。通过使用将关键消息固定在提要顶部等功能，帮助您的朋友和家人找到您的帖子。\n其次，向社交媒体平台施压，要求其删除具有明显自动化迹象的账户。要求使用更多控件来管理您看到的内容和放大的帖子。要求在如何推广帖子以及谁在投放广告方面增加透明度。例如，直接抱怨这里的Facebook新闻馈送，或者告诉立法者你的担忧。\n第三，意识到巨魔们最喜欢的问题，并对其持怀疑态度。他们可能最感兴趣的是制造混乱，但他们在一些问题上也表现出明显的偏好。例如，巨魔想要在没有真正管理的情况下迅速重新开放经济，以拉平新冠肺炎曲线。他们显然还支持2016年美国总统候选人中的一位，而不是另一位。值得问问你自己，这些职位如何对俄罗斯巨魔有好处，但对你和你的家人不利。\n也许最重要的是，像使用任何其他令人上瘾的有毒物质一样，谨慎使用社交媒体，并投资于更多现实生活中的社区建设对话。倾听真实的人，真实的故事和真实的意见，并从那里开始建设。\n你很聪明，对世界充满好奇心。对话的作者和编辑也是如此。您可以在每个周末获得我们的亮点。]", "note_en": "Social media platforms like Facebook, Twitter and Instagram started out as a way to connect with friends, family and people of interest. But anyone on social media these days knows it’s increasingly a divisive landscape.\n Undoubtedly you’ve heard reports that hackers and even foreign governments are using social media to manipulate and attack you. You may wonder how that is possible. As a professor of computer science who  researches social media and security, I can explain – and offer some ideas for what you can do about it.\n  Social media platforms don’t simply feed you the posts from the accounts you follow. They use  algorithms to curate what you see based in part on “likes” or “votes.” A post is shown to some users, and the more those people react – positively or negatively – the more it will be highlighted to others. Sadly, lies and extreme content often garner more reactions and so  spread quickly and widely.\n  But who is doing this “voting”? Often it’s an army of accounts, called bots, that do not correspond to real people. In fact, they’re controlled by hackers, often on the other side of the world. For example, researchers have reported that  more than half of the Twitter accounts discussing COVID-19 are bots.\n As a social media researcher, I’ve seen  thousands of accounts with the same profile picture “like” posts in unison. I’ve seen  accounts post hundreds of times per day, far more than a human being could. I’ve seen an account claiming to be an “All-American patriotic army wife” from Florida post obsessively about immigrants in English, but whose account history showed it used to post in Ukranian.\n Fake accounts like this are called “ sock puppets” – suggesting a hidden hand speaking through another identity. In many cases, this deception can easily be revealed with a look at the account history. But in some cases, there is a big investment in making sock puppet accounts seem real.\n  For example,  Jenna Abrams, an account with 70,000 followers, was quoted by mainstream media outlets like  The New York Times for her xenophobic and far-right opinions, but was actually an invention controlled by the  Internet Research Agency, a  Russian government-funded troll farm and not a living, breathing person.\n  Trolls often don’t care about the issues as much as they care about  creating division and distrust. For example, researchers in 2018 concluded that some of the most influential accounts on both sides of divisive issues, like  Black Lives Matter and Blue Lives Matter, were controlled by troll farms.\n More than just fanning disagreement, trolls want to encourage  a belief that truth no longer exists. Divide and conquer. Distrust anyone who might serve as a leader or trusted voice. Cut off the head. Demoralize. Confuse. Each of these is a devastating attack strategy.\n Even as a social media researcher, I underestimate the degree to which my opinion is shaped by these attacks. I think I am smart enough to read what I want, discard the rest and step away unscathed. Still, when I see a post that has millions of likes, part of me thinks it must reflect public opinion. The social media feeds I see are affected by it and, what’s more, I am affected by the opinions of my real friends, who are also influenced.\n The entire society is being  subtly manipulated to believe they are on opposite sides of many issues when  legitimate common ground exists.\n I have focused primarily on U.S.-based examples, but the same types of attacks are playing out around the world. By turning the voices of democracies against each other, authoritarian regimes may begin to look preferable to chaos.\n  Platforms have been slow to act. Sadly, misinformation and disinformation drives usage and is  good for business. Failure to act has often been justified with concerns about  freedom of speech. Does freedom of speech include the right to create 100,000 fake accounts with the express purpose of spreading lies, division and chaos?\n  So what can you do about it? You probably already know to check the sources and dates of what you read and forward, but common-sense media literacy advice is not enough.\n First, use social media more deliberately. Choose to catch up with someone in particular, rather than consuming only the default feed. You might be amazed to see what you’ve been missing. Help your friends and family find your posts by using features like pinning key messages to the top of your feed.\n Second,  pressure social media platforms to remove accounts with clear signs of automation. Ask for more controls to manage what you see and which posts are amplified. Ask for more transparency in how posts are promoted and who is placing ads. For example, complain directly about the Facebook news feed  here or tell  legislators about your concerns.\n Third, be aware of the trolls’ favorite issues and be skeptical of them. They may be most interested in creating chaos, but they also show clear preferences on some issues. For example, trolls want to  reopen economies quickly without real management to flatten the COVID-19 curve. They also clearly supported  one of the 2016 U.S. presidential candidates over the other. It’s worth asking yourself how these positions might be good for Russian trolls, but bad for you and your family.\n Perhaps most importantly, use social media sparingly, like any other addictive, toxic substance, and invest in more real-life community building conversations. Listen to real people, real stories and real opinions, and build from there.\n [ You’re smart and curious about the world. So are The Conversation’s authors and editors.  You can get our highlights each weekend.]", "posttime": "2020-07-02 07:48:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社交,accounts,账号", "title": "虚假账户是如何不断操纵你在社交媒体上看到的东西的", "title_en": "How fake accounts constantly manipulate what you see on social media", "transed": 1, "url": "https://theconversation.com/how-fake-accounts-constantly-manipulate-what-you-see-on-social-media-and-what-you-can-do-about-it-139610", "via": "", "real_tags": ["社交", "accounts", "账号"]}, {"category": "", "categoryclass": "", "imagename": "80fed59ab3968d855512d570f60edb5e.jpeg", "infoid": 1009393, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近几周，随着新冠肺炎案件在全国几个地区迅速上升，苹果已经重新关闭了美国的47家门店。\n周三宣布的关闭包括佛罗里达州最后两家开业的门店，以及洛杉矶地区的一些门店。\n苹果公司表示，周四之前将在美国再关闭30家门店，随着新冠肺炎案件在全国多个地区迅速上升，美国的重新关闭门店总数将达到77家。\n阿拉巴马州、加利福尼亚州、佐治亚州、爱达荷州、路易斯安那州、内华达州和俄克拉何马州的商店将于周四关闭。截至周三，佛罗里达州、密西西比州、德克萨斯州和犹他州的其他门店已经关闭，苹果在美国有271家门店。\n苹果专卖店往往位于人流量很高的商场和购物中心，他们大量重新关门的事实可以被视为一个负面指标，表明在冠状病毒的影响下，美国的零售业务能否顺利重启。\n苹果公司的一位发言人在一份声明中表示：由于我们服务的一些社区目前新冠肺炎的情况，我们暂时关闭了这些地区的门店。我们非常谨慎地采取这一步骤，因为我们密切关注情况，我们期待着我们的团队和客户尽快回来。\n周三宣布的关闭包括佛罗里达州最后两家开业的门店，以及洛杉矶地区的一些门店。\n苹果是首批关闭全球门店以应对新冠肺炎疫情的公司之一。在美国，专注于路边服务的门店开始重新开张，采取了包括口罩和体温检测在内的安全措施，但新冠肺炎的门店费率不断上升，迫使该公司关闭了在受灾严重的州的许多门店。", "note_en": "Apple has already reclosed 47 stores in recent weeks in the United States as Covid-19 cases rapidly rise in several regions around the country.\n The closings announced on Wednesday include the last two remaining stores open in Florida, as well as a number of stores around the Los Angeles area.\n Apple will close 30 additional stores in the United States by Thursday, the company said, bringing the total number of reclosures in the United States to 77 as Covid-19 cases rapidly rise in several regions around the country.\n Stores in Alabama, California, Georgia, Idaho, Louisiana, Nevada and Oklahoma will close Thursday. Other stores in Florida, Mississippi, Texas and Utah are closed as of Wednesday. Apple has 271 stores in the United States.\n   Apple stores tend to be in highly trafficked malls and shopping centers, and the fact that they are reclosing in such large numbers can be seen as a negative indicator of how smoothly retail operations can restart in the United States amid the coronavirus.\n An Apple spokesman said in a statement: &#34;Due to current COVID-19 conditions in some of the communities we serve, we are temporarily closing stores in these areas. We take this step with an abundance of caution as we closely monitor the situation and we look forward to having our teams and customers back as soon as possible.&#34;\n The closings announced on Wednesday include the last two remaining stores open in Florida, as well as a number of stores around the Los Angeles area.\n Apple was one of the first companies to shut its stores around the world in response to the Covid-19 pandemic. Stores started to reopen focusing on curbside service in the U.S. with safety measures including masks and temperature checks, but the rising rates of Covid-19 have forced the company to close many of its locations in hard-hit states.", "posttime": "2020-07-02 07:29:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,美国,新冠,stores", "title": "苹果因新冠肺炎钉子导致其美国零售店损失超过25%.", "title_en": "Apple Recloses More Than 25% of Its US Retail Stores Due To COVID-19 Spikes", "transed": 1, "url": "https://www.cnbc.com/2020/07/01/apple-to-re-close-30-more-retail-stores-as-coronavirus-cases-spike.html", "via": "", "real_tags": ["苹果", "apple", "美国", "新冠", "stores"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "博茨瓦纳北部350多头大象在一场神秘的大规模死亡事件中死亡，科学家称这是一场“保护灾难”。\n5月初，奥卡万戈三角洲首次报道了一系列大象死亡事件，截至本月底，已有169人死亡。据当地不愿透露姓名的消息人士称，到6月中旬，这一数字翻了一番多，70%的死亡病例聚集在水坑周围。\n“这是一次大规模的死亡，达到了很长一段时间都没有见过的水平。除了干旱，我不知道有这么严重的死亡事件，“位于英国的慈善机构国家公园救援的保护主任Niall McCann博士说。\n博茨瓦纳政府还没有对样本进行测试，所以没有关于是什么导致死亡的信息，也没有关于它们是否会对人类健康构成风险的信息。两种主要的可能性是中毒或不明病原体。炭疽病-最初被认为是最有可能的原因-已被排除。\n麦肯说：“当野生动物疾病在每个人的脑海中占据重要位置的时候，人类栖息地附近的大象大量死亡，政府没有把样本送到信誉良好的实验室，这似乎是很不寻常的。”\n当地目击者说，可以看到一些大象绕着圈走，这是神经损伤的迹象。“如果你看一下身体，你会发现他们中的一些人脸部朝下，这表明他们很快就死了。”其他的显然死得更慢，比如四处游荡的那些。所以很难说这种毒素是什么，“麦肯说。\n当地报道发现，所有年龄和性别的大象都在死亡。几头活着的大象看起来很虚弱和消瘦，这表明在接下来的几周里会有更多的大象死亡。环保人士说，真实的死亡人数可能会更高，因为身体很难被发现。\n氰化物中毒-津巴布韦偷猎者经常使用的-仍然是一种可能性，但食腐动物似乎并没有死于身体。当地报道称，秃鹫身体上的数量比预期的要少，但没有一只显示出异常行为的迹象。麦肯说：“这是一种自然现象，这是没有先例的，但如果没有适当的测试，就永远不会知道。”新冠肺炎被认为是可能的原因，但被认为不太可能。\n三角洲地区大约有15000头大象，占全国总数的10%。生态旅游占博茨瓦纳GDP的10-12%，仅次于钻石。“你认为大象是国家的资产。它们是在奥卡万戈三角洲四处游荡的钻石。“麦肯说。“这是一场保护灾难--它说明了一个国家未能保护其最宝贵的资源。”\n死亡大象的象牙还没有被移走，环保人士敦促当局保护大象的身体，这样偷猎者就不会带走它们。\n位于伦敦的环境调查机构(Environmental Investigation Agency)执行主任玛丽·赖斯(Mary Rice)表示：“人们确实担心延迟将样本送到经认可的实验室进行检测，以确定问题--然后采取措施缓解问题，”伦敦环境调查机构(Environmental Investigation Agency)的执行主任玛丽·赖斯(Mary Rice)说。\n“缺乏迫切性是真正令人关注的问题，并不反映负责任的托管人的行动。私人利益相关者一再提供帮助，以促进紧急测试，但似乎对此置若罔闻。…。坦率地说，不断增加的数字令人震惊。“。\n博茨瓦纳野生动物和国家公园部门的代理主任西里尔·陶洛博士告诉“卫报”：“我们知道正在死亡的大象。在350只动物中，我们已经确认了280只。我们仍在确认其余部分。\n他说：“我们已经送去(样本)进行检测，我们期待着在接下来的几周左右的时间里得到结果。”“新冠肺炎的限制无助于该地区和世界各地的样品运输。我们现在开始走出困境，这就是为什么我们现在可以将样本送到其他实验室。“。陶洛拒绝透露他们被送到了哪些实验室。\n在这里找到更多关于物种灭绝的报道，并在Twitter上关注生物多样性记者菲比·韦斯顿和帕特里克·格林菲尔德，以获得所有最新的新闻和专题", "note_en": "More than 350 elephants have died in northern  Botswana in a mysterious mass die-off described by scientists as a “conservation disaster”.\n A cluster of elephant deaths was  first reported in the Okavango Delta in early May, with 169 individuals dead by the end of the month. By mid June, the number had more than doubled, with 70% of the deaths clustered around waterholes, according to local sources who wish to remain anonymous.\n “This is a mass die-off on a level that hasn’t been seen in a very, very long time. Outside of drought, I don’t know of a die-off that has been this significant,” said Dr Niall McCann, the director of conservation at UK-based charity National Park Rescue.\n The Botswana government has not yet tested samples so there is no information on what is causing the deaths or whether they could pose a risk to human health. The two main possibilities are poisoning or an unknown pathogen. Anthrax – initially considered the most likely cause – has been ruled out.\n McCann said: “When we’ve got a mass die-off of elephants near human habitation at a time when wildlife disease is very much at the forefront of everyone’s minds, it seems extraordinary that the government has not sent the samples to a reputable lab.”\n Local witnesses say some elephants were seen walking around in circles, which is an indication of neurological impairment. “If you look at the carcasses, some of them have fallen straight on their face, indicating they died very quickly. Others are obviously dying more slowly, like the ones that are wandering around. So it’s very difficult to say what this toxin is,” said McCann.\n Elephants of all ages and both sexes have been dying, local reports found. Several live elephants appeared weak and emaciated, suggesting more will die in the coming weeks. The true number of deaths is likely to be even higher because carcasses can be difficult to spot, say conservationists.\n Cyanide poisoning – often used by poachers in Zimbabwe – remains a possibility, but scavenging animals do not seem to be dying at the carcasses. Local reports say there were fewer vultures on carcasses than expected, but none showed signs of abnormal behaviour. “There is no precedent for this being a natural phenomenon but without proper testing, it will never be known,” said McCann. Covid-19 has been mentioned as a possible cause but is considered unlikely.\n  There are about 15,000 elephants in the delta, 10% of the country’s total.  Eco-tourism contributes between 10-12% of Botswana’s GDP, second only to diamonds. “You see elephants as assets of the country. They are the diamonds wandering around the Okavango delta,” said McCann. “It’s a conservation disaster – it speaks of a country that is failing to protect its most valuable resource.”\n The tusks of deceased elephants have not been removed and conservationists have urged authorities to guard the carcasses so that poachers do not take them.\n  “There is real concern regarding the delay in getting the samples to an accredited laboratory for testing in order to identify the problem – and then take measures to mitigate it,” said Mary Rice, executive director of the Environmental Investigation Agency in London.\n “The lack of urgency is of real concern and does not reflect the actions of a responsible custodian. There have been repeated offers of help from private stakeholders to facilitate urgent testing which appear to have fallen on deaf ears … and the increasing numbers are, frankly, shocking.”\n  Dr Cyril Taolo, acting director for Botswana’s department of wildlife and national parks, told the Guardian: “We are aware of the elephants that are dying. Out of the 350 animals we have confirmed 280 of those animals. We are still in the process of confirming the rest.\n “We have sent [samples] off for testing and we are expecting the results over the next couple of weeks or so,” he said. “The Covid-19 restrictions have not helped in the transportation of samples in the region and around the world. We’re now beginning to emerge from that and that is why we are now in a position to send the samples to other laboratories.” Taolo declined to say which laboratories they had been sent to.\n Find more  age of extinction coverage here, and follow biodiversity reporters  Phoebe Weston and  Patrick Greenfield on Twitter for all the latest news and features", "posttime": "2020-07-02 07:27:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大象,botswana", "title": "数百头博茨瓦纳大象神秘大规模死亡", "title_en": "Hundreds of Botswana elephants dead in mysterious mass die-off", "transed": 1, "url": "https://www.theguardian.com/environment/2020/jul/01/more-than-350-elephants-dead-in-mysterious-mass-die-off-botswana-aoe", "via": "", "real_tags": ["大象", "botswana"]}, {"category": "", "categoryclass": "", "imagename": "9883b1cbe09cbbb639da896c9d280f14.jpg", "infoid": 1009390, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "财政部星期三宣布，将向一家运输军事装备的卡车运输公司提供7亿美元贷款，以换取美国纳税人获得该公司近30%的股份。\n根据这一不同寻常的安排，财政部将向YRC Worldwide提供紧急贷款，同时持有该公司29.6%的股权。美国政府通常不会持有公司的所有权股份，但国会允许这样做，以确保纳税人的资金不会被不当使用。\n这笔交易是国会3月份批准的170亿美元贷款计划下的第一笔交易，这是更广泛刺激计划的一部分。这笔钱被指定给被认为对美国国家安全“至关重要”的公司。国会授权财政部批准向公司和城市提供超过5000亿美元的紧急贷款，尽管其中大部分资金尚未支付。\n部长史蒂文·姆努钦(Steven Mnuchin)在一份声明中表示：“我们很高兴财政部根据CARE法案提供这笔贷款。”这笔贷款将使国防部的一家关键供应商能够保持大量就业，同时向纳税人提供适当的补偿。“。\nYRC Worldwide是一家上市公司，总部设在堪萨斯州。YRC拥有约7600辆拖拉机和3万辆拖车，是北美最大的“零担”运输公司之一。根据财政部的公告，这家拥有96年历史的公司覆盖了该地区68%的军方服务。\n这笔投资可能会加剧人们对财政部在美国经济关键时刻处理数千亿纳税人援助的质疑。一些批评人士说，财政部的干预相当于对不配的公司进行大规模的企业救助，而另一些人则认为，资金应该在更少的条件下更快地分配，以避免不断上升的失业率。财政部在超过三个月的时间里没有花掉170亿美元中的任何一笔，这引发了人们对该计划有效性的质疑，因为企业正在寻求其他融资手段。\n照顾法要求通过该基金接受帮助的公司向政府提供股权或权证，这是一种金融工具，允许贷款人在晚些时候认购股票。\n美国国防工业协会(National Defense Industrial Association)副会长韦斯·霍尔曼(Wes Hallman)说，他知道大约有20家公司通过该基金申请救济，对于一个庞大、庞大的行业来说，这是一个相对较小的数字。国防高管和游说者告诉华盛顿邮报，大多数国防承包商认为条款过于繁琐。\n担任国防顾问的海军陆战队退役将军阿诺德·普纳罗(Arnold Punaro)说，“有太多的花言巧语走向错误的方向，主要的航空航天公司就是对该基金不感兴趣”。“如果这对我们的航空航天公司来说是一笔划算的交易，他们就会使用它。”\n尽管随着3月底和4月初危机的加深，许多公司陷入了财务困境，但其中许多公司找到了其他选择。许多国防承包商通过其他关怀法案项目找到了解脱。少数国防供应商获得了由小企业管理局(Small Business Administration)支持的Paycheck Protection Program贷款，这些贷款没有股权要求，可以选择被原谅。\n国防部在国防工业基地上花费了6.68亿美元的“国防生产法案”(Defense Production Act)资金。这笔资金是通过现有的、开放的合同发放的，这些合同不需要重新谈判，也不需要任何股权。\n随着资本市场在整个4月和5月都有所改善，一些公司通过私人市场找到了其他选择。\n与几家考虑申请的国防公司合作的说客杰夫·格林(Jeff Green)说，“当《关怀法案》通过时，大多数国防公司将该计划视为一种选择，但大多数公司认为，与贷款计划相关的条件非常严格，使得通过其他方式获得资金成为更好的选择。”\n其中之一是波音(Boeing)，这家遭受重创的航空航天制造商和国防承包商的财务状况因全球商业航空旅行放缓而遭受重创。姆努钦和参与起草《关心法案》的人士表示，这笔170亿美元的资金最初很大程度上是为了帮助支撑波音公司。然而，该公司能够通过私人信贷市场筹集到足够的资金，以维持运营，这得益于美联储(Fed)的非常措施，尽管该公司也解雇了数千名员工。\n财政部的一份声明称，这笔贷款将使YRC保留约30,000个卡车运输工作岗位，并“继续支持基本的军事供应链运营”，北美20多万家公司使用了这笔贷款。国防部还引用了国防部长关于YRC对国家安全的关键价值的证明。该协议包括对高管薪酬和向股东支付股息的限制，但财政部尚未披露这些限制是什么。\n与大多数运输公司一样，YRC也受到各州企业关闭的严重影响，这些关闭导致整个3月和4月的国民经济陷入停滞。该公司在2020年第一季度结束时营收为11.5亿美元，比去年同期略有下降。整个商业货运业务的运量下降已经削减了公司的底线，迫使裁员和其他成本削减措施。但该公司的债务是一个更大的问题；根据YRC最新的财务报表，该公司欠多个债权人8.25亿美元。\n在5月5日与分析师的电话会议上，YRC首席执行官达伦·霍金斯(Darren Hawkins)感谢员工们尽管存在“看不见的敌人”，但仍保持了美国供应链的运转，这呼应了特朗普总统经常使用的一个术语。他拒绝回答分析师的问题，这标志着与惯例的重大决裂。\n霍金斯说：“我不知道还有比卡车运输更爱国的行业了，这种精神在美国的交通网络中站稳了脚跟。”\n在一份新闻稿中，霍金斯感谢国会和财政部为帮助YRC度过危机提供了财政援助。霍金斯说：“这种财政援助将使我们能够弥合这场与流行病相关的危机，并继续为国家的供应链提供基本的航运服务。”\n虽然美国政府收购部分公司股份并不常见，但这样的安排在国际上很常见，有助于各国政府确保纳税人的投资获得回报。如果YRC的股票价格上涨，纳税人也将像传统投资者一样受益。“在这场危机中，政府不应该让企业倒闭，但也不应该救助所有者的财富。提供贷款换取股权正是实现了这一点，“左倾的人民政策项目(People‘s Policy Project)创始人马特·布鲁尼格(Matt Bruenig)说。\n该协议可能会招致批评，称美国纳税人正在向不应该得到帮助的公司提供特别援助。俄亥俄州立大学(Ohio State University)教授达里克·汉密尔顿(Darrick Hamilton)指出，紧急援助出台之际，美国主要城市的抗议者正在呼吁削减警察和武装部队的开支。美国政府每年已经向军方提供超过7000亿美元。\n汉密尔顿说：“政府本应处理社会福利问题，但却把钱花在军事化和治安上。”“这表明了我们把钱花在哪里的一般价值观。", "note_en": "The Treasury Department announced Wednesday that it will loan $700 million to a trucking firm that ships military equipment, in exchange for having U.S. taxpayers acquire an almost 30 percent stake in the company.\n  Under the unusual arrangement, the Treasury Department will provide the emergency loan to YRC Worldwide, while taking a 29.6 percent equity stake in the company. The U.S. government does not typically take ownership stakes in companies but was given permission to do so by Congress as a way to ensure taxpayer funds are not misspent.\n The deal is the first under a $17 billion loan program approved as part of the broader stimulus by Congress in March. That pot of money was earmarked for firms deemed “critical” to U.S. national security. Congress gave Treasury the authority to approve more than $500 billion in emergency loans to companies and cities, although most of that money has not been disbursed.\n   “We are pleased for Treasury to make this loan pursuant to the CARES Act,” Secretary Steven Mnuchin said in a statement. “This loan will enable a critical vendor to the Department of Defense to maintain significant employment while providing appropriate compensation to taxpayers.”\n YRC Worldwide is a publicly traded company headquartered in Kansas. With a fleet of about 7,600 tractors and 30,000 trailers, YRC is one of the largest “less-than-truckload” transportation companies in North America. The 96-year-old company covers 68 percent of the military’s services in that area, according to the Treasury Department’s announcement.\n The investment could intensify questions over Treasury’s handling of hundreds of billions in taxpayer aid at a pivotal moment for the U.S. economy. Some critics have said Treasury’s interventions amount to a large corporate bailout for undeserving firms, while others have argued the money should be more swiftly distributed with fewer conditions to avert rising unemployment. Treasury did not spend any of the $17 billion for more than three months, raising questions about the program’s effectiveness as companies sought other means of funding.\n   The Cares Act requires that companies receiving help through the fund give the government an equity stake or a warrant, a financial instrument that allows the lender to claim stock at a later date.\n Wes Hallman, vice president at the National Defense Industrial Association, said he is aware of approximately 20 companies that applied for relief through the fund, a relatively small number for a massive, sprawling industry. Most defense contractors considered the terms too onerous, defense executives and lobbyists told The Washington Post.\n “There are too many bells and whistles going in the wrong direction, and major aerospace companies just aren’t interested” in the fund, said Arnold Punaro, a retired Marine Corps general who works as a defense consultant. “If this were a good deal for our aerospace companies, they would be using it.”\n  Although many companies were financially desperate as the crisis deepened in late March and early April, many of them found other options. Numerous defense contractors found relief through other Cares Act programs. A handful of defense suppliers received Paycheck Protection Program loans backed by the Small Business Administration, which have no equity requirement and have the option of being forgiven.\n   The Defense Department is spending  $668 million in Defense Production Act funding on the defense industrial base. That funding is being meted out through existing, open contracts that don’t have to be renegotiated and don’t require any equity stake.\n With capital markets improving throughout April and May, some companies found other options through private markets.\n “When the Cares Act passed, most defense companies looked at the program as an option, but most determined that the conditions associated with the loan program were so restrictive it made obtaining capital through other means a better option,” said Jeff Green, a lobbyist who works with several defense firms that considered applying.\n  One of them was Boeing, the battered aerospace manufacturer and defense contractor whose finances have been wrecked by the global slowdown in commercial air travel. Mnuchin and people involved in the drafting of the Cares Act  have said the $17 billion pot of money was initially intended in large part to help shore up Boeing. However, the company was able to raise sufficient funds to stay afloat through the private credit markets, which were aided by the Federal Reserve’s extraordinary measures, although the company  has also laid off thousands of workers.\n  A Treasury statement said the loan will allow YRC to keep about 30,000 trucking jobs and “continue to support essential military supply chain operations” used by more than 200,000 companies in North America. The department also cited a certification from the defense secretary about YRC’s critical value for national security. The agreement includes limits on executive compensation and dividend payments to shareholders, but Treasury has not disclosed what those are.\n Like most transportation companies, YRC was sharply affected by the state-by-state business closures that put the national economy into stasis throughout March and April. The company finished the first quarter of 2020 with $1.15 billion in revenue, down slightly from the same period last year. Lower volume across its commercial freight business has cut into the company’s bottom line, forcing layoffs and other cost-cutting measures. But the company’s debt is a larger concern; YRC owes $825 million to various creditors, according to its most recent financial statement.\n  In a May 5 call with analysts, YRC chief executive Darren Hawkins thanked employees for keeping the U.S. supply chain moving despite “the invisible enemy,” echoing a term commonly used by President Trump. He declined to take questions from analysts, marking a significant break from usual practice.\n  “I don’t know of a more patriotic industry than trucking, and that spirit has stood strong in America’s transportation networks,” Hawkins said.\n In a news release, Hawkins thanked Congress and the Treasury Department for providing financial assistance to see YRC through the crisis. “This financial assistance will enable us to bridge this pandemic-related crisis and continue to provide essential shipping services for the nation’s supply chain,” Hawkins said.\n  While it is unusual for the U.S. government to acquire parts of companies, such arrangements are common internationally and help governments ensure that taxpayers receive a return for their investment. If the price of YRC’s stock goes up, taxpayers will also benefit as a traditional investor would. “During this crisis, the government should not let companies fail, but it also should not bail out the wealth of their owners. Providing loans for equity accomplishes exactly this,” said Matt Bruenig, founder of the left-leaning People’s Policy Project.\n  The agreement will probably lead to criticism that U.S. taxpayers are providing special assistance to firms that should not receive help. Darrick Hamilton, a professor at Ohio State University, noted the emergency help comes as protesters in major U.S. cities are calling for cuts to spending on the police and the armed forces. The U.S. government already provides more than $700 billion annually for the military.\n “The government is supposed to be dealing with social welfare but is spending money on militarization and policing,” Hamilton said. “This is indicative of our general values of where we spend our money.&#34;", "posttime": "2020-07-02 07:27:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "treasury", "title": "财政部将以7亿美元收购公司30%的股份。公司价值1.2亿美元", "title_en": "Treasury to acquire 30% of company for $700M. Company is worth $120M", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/07/01/treasury-loan-yrc-worldwide-cares-act/", "via": "", "real_tags": ["treasury"]}, {"category": "", "categoryclass": "", "imagename": "2ea8d086414368fa4967e43de3e18ae2.jpg", "infoid": 1009389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些个人资料为规模较小的卖家提供了一种做生意的方式，而不必像Facebook页面或谷歌商业列表那样建立更大的网络存在。\n取而代之的是，Venmo的商业概况可能更适合卖家，比如当地的艺术家、手工艺者或农贸市场摊主，或者那些随意使用Venmo来支撑自己的帮手收入的人，比如修剪草坪或做邻里房屋维修工作的收入。\n当Venmo用户向这些小卖家付款时，付款会发布到Venmo社交提要上，朋友甚至公众都可以在这里查看交易，这取决于用户的隐私设置。感兴趣的朋友和邻居然后可以点击Business Profile了解更多关于卖家的信息，因为这些新的Profile页面还提供了撰写业务简介的空间。\n他们还可以看到卖家有多少客户，以及他们的Venmo朋友是否曾与卖家进行过交易。卖家还可以通过电子邮件、打印、短信或AirDrop将Venmo二维码添加到他们的个人资料中，以便客户更容易在应用程序上找到他们的业务。\n此外，新的Venmo搜索体验将允许用户在查找特定Venmo用户名时在“人物”和“业务”选项卡之间切换。\n拥有个人资料页面的企业将能够更容易地跟踪他们的交易，而不必创建单独的账户。取而代之的是，用户将能够从同一登录在他们的个人账户和业务配置文件之间切换。\n文莫说，新功能还将提供交易洞察力和信息，包括客户数量和客户列表。\n该系统将正式确定Venmo平台的顶级用例。它还将为Venmo提供一种扩大收入机会的方式。虽然这项服务在试点期间是免费的，但文莫表示，情况可能并不总是如此。\n在关于这一新功能的在线常见问题中，Venmo指出，未来，企业主每向他们的个人资料支付一笔钱，每笔交易将收取1.9%+0.10美元的手续费。这仍然低于Square收费甚至比Venmo母公司贝宝(PayPal)更低的费用。\n然而，新功能不仅仅是为卖家提供了一种新的交易方式。由于Venmo也是一个社交平台，卖家可以利用其提供的网络效果-类似于Messenger或WhatsApp，这两家公司现在通常都有自己的个人资料。\n这一增加正值冠状病毒爆发刚刚打击了贝宝规模更大的业务，导致其错过了第一季度的收益。然而，Venmo是增长的一个亮点，本季度支付总额达到310亿美元，同比增长48%。贝宝(PayPal)还表示，随着消费者转向在线和非接触式支付，其4月份的净新活跃数量创下纪录-这一趋势可能会在第二季度进一步显现。Venmo是这一增长的重要贡献者，甚至在5月1日看到了有史以来最高的交易量。\nVenmo的商业档案功能今天开始在iOS上进行试点，用户数量有限。它将在接下来的一周内推出Android，并在接下来的几个月里变得更广泛。", "note_en": "The profiles give smaller sellers a way to do business without having to necessarily establish a larger web presence, like a Facebook Page or Google Business listing, for example.\n Instead, Venmo’s Business Profiles may be better suited to sellers such as local artists, crafters, or farmer’s market booth holders, or those who casually use Venmo to support their side hustle income, like that from mowing lawns or doing neighborhood home repair jobs.\n   As Venmo users pay these small sellers, the payment is published to the Venmo social feed where friends or even the public can view the transaction, depending on the user’s privacy settings. Interested friends and neighbors could then click on the Business Profile to learn more about the seller, as these new profile pages also offers a space to write a short introduction to business.\n They’ll also be able to see how many customers the seller has and if any of their Venmo friends have ever transacted with the seller. Sellers can also email, print out, text or AirDrop their Venmo QR code for their profile to make it easier for customers to find their business on the app.\n In addition, a new Venmo Search experience would allow users to switch between a “People” and “Business” tab when looking for a particular Venmo username.\n  Businesses with a profile page will be able to more easily track their transactions without having to create a separate account. Instead, users will be able to switch between their personal account and business profile from the same login.\n Venmo says the new feature will also offer transactional insights and information, including number of customers and a customer list.\n The system would formalize what’s already a top use case for Venmo’s platform. It would also offer Venmo a way to expand its revenue opportunities. Though the service is free during the pilot, Venmo indicates that may not always be the case.\n In  an online FAQ about the new feature, Venmo notes that in the future, business owners would be changed a per-transaction fee of 1.9% + $0.10 on every payment made to their profile. This is still a  lower fee than Square charges or even Venmo parent  PayPal.\n The new feature, however, isn’t just about offering a new way for sellers to transact. Because Venmo is also a social platform, sellers can tap into the network effects its provides — similar to Messenger or WhatsApp, where businesses often now have their own profiles.\n The addition comes at a time when the coronavirus outbreak just took a hit on PayPal’s larger business, leading it to  miss on Q1 earnings. Venmo, however, was a bright spot in terms of growth, with total payment volume in the quarter reaching $31 billion, up 48% year-over-year. PayPal had also said its net new actives hit records in April as consumers shifted to online and contactless payments — a trend that could play out further in Q2. Venmo was a big contributor to this growth and even saw its highest transactions ever on May 1.\n Venmo’s Business Profiles feature is starting to pilot today with a limited number of users on iOS. It will roll out to Android in he week ahead and in the coming months will become more broadly available.", "posttime": "2020-07-02 07:09:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,begins,venmo", "title": "\nVenmo开始为小卖家试行“商业概况”", "title_en": "\n\t\t\t\tVenmo begins piloting ‘Business Profiles’ for small sellers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/01/venmo-begins-piloting-business-profiles-for-small-sellers/", "via": "", "real_tags": ["商业", "begins", "venmo"]}, {"category": "", "categoryclass": "", "imagename": "72840eef4223eb8e762b2596e8068b99.jpg", "infoid": 1009387, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着对Adobe Flash player的支持在今年年底停止，托管Flash游戏的网站正在想方设法改变。在Kongregate的案例中，许多基本功能正在被削减，因为该公司正在为即将到来的事情做准备。\n今天，Kongregate通过论坛帖子宣布，该网站上的许多功能将消失，也许对许多人来说最令人惊讶的消息是，该网站不允许上传新的Flash游戏。以前，任何创建游戏的人都可以上传他们的游戏，供任何人玩，这就是为什么该网站有超过12.8万个游戏。&#34；另一个关键功能是徽章。徽章是难度不同的成就，定期添加到流行的游戏中。球员在获得徽章后就会获得积分。\nKongregate还以其聊天功能而闻名。玩游戏时，用户可以在聊天室里聊天。7月22日，除非游戏论坛外，大多数聊天室都将关闭。\n在其间的几年中，Kongregate作为一家公司随着这些行业范围的变化而成长和调整。今天，我们的业务主要集中在开发游戏上，而Flash，如你所知，正在慢慢消失。这意味着Kongregate.com也需要发展。\n值得注意的是，该公司仍在支持Kartridge，这是一个可以购买游戏的游戏平台-它的运营方式类似于Steam和GOG。Kartridge基本上拥有与Kongregate相同的功能，如聊天室和徽章；只是，这是一个精心策划的平台，提供可下载的游戏，而不是Adobe Flash。根据这篇帖子，Kongregate还将继续专注于开发游戏。这些游戏大部分都是在手机上，但也有一些可以在Kartridge和Steam上找到，比如“王国研磨机”(Realm Grinder)。\n事实上，看到这种情况发生是令人难过的。我知道这听起来有多戏剧性，但如果不是因为Kongregate，我不知道我今天是否会进入游戏新闻行业。我过去常常在自己的小博客上写关于Flash游戏的文章来练习，我想我对这种媒介的热爱就是从那里开始蓬勃发展的。我也有来自聊天室的朋友，我每天都会和他们聊天，无论是几年后还是几年后。他们是我最好的几个朋友。令人有点难过的是，其他人再也不能体验同样的事情了。虽然这个网站并没有消失，但它实际上感觉已经死了。\n你对Kongregate的这些变化有什么看法？在下面的评论中让我们知道！", "note_en": "With support for Adobe Flash Player ceasing by the end of this year, sites that host flash games are finding ways to change. In the case of Kongregate, many essential features are being cut as the company prepares for what is to come.\n Today, Kongregate announced via a  forum post that many features on the site are going away, and perhaps the most surprising news for many will be that the site is not allowing uploads of new flash games. Previously, anyone who created a game was able to upload their title for anyone to play, which is why the website has &#34;over 128,000 titles.&#34; Another key feature hitting the chopping block is badges. Badges were achievements of varying difficulty, which were periodically added into popular games. Players were granted points upon earning a badge.\n  Kongregate is also famous for its chat features. While playing a game, users can talk with each other in a &#34;chat room.&#34; On July 22, most chat rooms are closing down in addition to &#34;non-gaming&#34; forums.\n   During the intervening years, Kongregate as a company has grown and adjusted with those industry-wide changes. Today our business is largely focused on developing games and flash, as you are aware, is slowly going away. That means that Kongregate.com will need to evolve as well.\n It is worth noting that the company is still supporting  Kartridge, a gaming platform where you can purchase titles - it operates like Steam and GOG. Kartridge has essentially the same features as Kongregate, such as chat rooms and badges; only, this is a curated platform that has downloadable games instead of Adobe Flash. Kongregate also continues to &#34;focus on developing games,&#34; according to the post. Most of these titles are on mobile, however, some can be found on Kartridge and Steam, like   Realm Grinder.\n   It&#39;s actually sad to see this happen. I know how dramatic this sounds, but were it not for Kongregate, I don&#39;t know if I&#39;d be into game journalism today. I used to write about flash games on my own little blog for practice, and I think my love for this medium flourished from there. I also have friends from the chat rooms that I talk to every single day, years and years later. They&#39;re some of my best friends. It&#39;s a little sad that other people won&#39;t be able to experience the same thing anymore. Though the site isn&#39;t gone, it feels effectively dead.\n   What do you think about these changes to Kongregate? Let us know in the comments below!", "posttime": "2020-07-02 06:49:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,关闭,longer", "title": "Kongregate不再接受新游戏，关闭论坛和聊天", "title_en": "Kongregate No Longer Accepting New Games, Shutting Down Forums and Chat", "transed": 1, "url": "https://techraptor.net/gaming/news/flash-gaming-site-kongregate-rolling-major-changes", "via": "", "real_tags": ["游戏", "关闭", "longer"]}, {"category": "", "categoryclass": "", "imagename": "a498557a343dfd09fe4bac13a5a04699.png", "infoid": 1009385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "辐射跟踪是一周光线跟踪在NIM编程语言中的实现。\n特别值得一提的是，我确信(显然有偏见)，如果您想从头开始一个渲染项目(光线跟踪或其他)，NIM是最适合使用的语言，特别是如果您专注于：\n渲染是一项非常耗时的任务，NIM很快，非常快，有时甚至比C++还快。\n在英特尔Skylake-X i9-9980XE上，超频为4.1SSE2全核涡轮。以x86-64模式编译(仅限 )；384x216图像；每像素100射线：\n单线程NIM比Cang C++快2.7%. %。多线程NIM通过编织比Cang C++快11.1 %。\n以下是重现结果的步骤。请注意，如果您在不同的硬件上运行测试，结果可能与上面发布的结果略有不同。\ngit clone https://github.com/mratsim/weave CD weaven imble install-y#安装编织依赖项，此处为合成，如果要求则覆盖。nim-v#确保您的NIM 1.2.0或更高版本的#Threads on(默认情况下在此资源库中)nim c-d：danger-o：build/ray_threaded demos/raytracing/simpt.nim#threadoffnim c-d：danger-threads：off-o：build/ray_Single demos/ray tracing/mall pt.nimg++-O3-o build/ray_GCC_Single demos/ray tracacing/RayTracing/Smallpt.nimg++-O3-o build/ray_ray_Single Demos/RayTrac.。-o build/ray_clang_Single demos/ray Tracing/mall pt.cppclang++-O3-fopenmp-o build/ray_clang_omp demos/ray Tracing/mall pt.cpp。\nNIM是少数几种可以正确建模物理单位并在编译时强制正确使用这些单位的语言之一。例如，向量和单位向量具有相同的表示形式，但类型不同。单位向量在传递给函数时可以自动转换为向量：\ntype Vector 3*=object x*，y*，z*：float64 UnitVector*{.borrow：`.`.}=DISTINCT Vec3#`.`注释确保可以将字段访问转换为Vec3*(UV：UnitVector)：Vec3{.inlin.}=##UnitVector可无缝转换为Vec3(但不能反之亦然)Vec3(UV)。\nPoint3使用与Vec3相同的内部表示，并且可以借用(共享)公共运算符的实现(即没有代码大小影响)：\ntype Point3*{.borrow：`.`.}=DISTINCT Vector 3#`.`注释确保可以访问字段func`*=`*(a：var Point3，标量：float64){.born.}func`*`*(a：Point3，标量：float64)：Point3{.boror.}func`*`*(scalar：float64，a：Point3)：Point3{.borrow.}。\n不允许添加2个点，并带有一条漂亮的自定义错误消息，而不是编译器的默认错误。\n函数`-`*(a，b：Point3)：Point3{.inlin.}=##将一个点从另一个点减去，得到一个向量结果。x=a.x-b.x result t.y=a.y-b.y result t.z=a.z-b.zfunc`+`*(p：Point3，v：Vector 3)：Point3{.inlin.}=##将向量加到一个点得到Point3(Vector 3(P)+v)funint3。v：Vector 3)：Point3{.inlin.}=##从一个点减去一个向量得到一个点Point3(ve3(P)-v)函数`+`*(a，b：Point3)：Point3{.error：&#34；添加2个点3没有实际意义。}。\n我还有两种类型的颜色及其衰减(按百分比表示)，因此您不能将颜色相乘：\nTYPE COLOR*{.BORROW：`.`.}=DISTINCT Vec3func`*`*(a，b：color)：COLOR{.error：&#34；将2种颜色相乘没有物理意义&#34；.}类型衰减*{.借入：`.`.}=不同颜色函数`*=`*(a：VAR衰减，b：衰减){.inline}=#将颜色乘以每个通道的衰减因子A.X*=b.x A.Y*=b.y A.Z*=b.zfunc`*`*(a，b：衰减)：衰减{.inlin.}=#将颜色乘以每个通道的衰减因子result。x=a.x*b.x result t.y=a.y*b.y result t.z=a.z*b.zfunc`*=`*(a：可变颜色，b：衰减){.inline}=#将颜色乘以每个通道的衰减因子a.x*=b.x A.Y*=b.y A.Z*=B.Z。\n最后但并非最不重要的一点是，通过自动将弧度转换为浮动(并且度数将保持在较高水平)，确保您不会混合和匹配度数和弧度：\n类型度*=DISTINCT FLOAT64弧度*=DISTINCT FLOAT64模板deToRad*(deg：度)：RADIANS=弧度(decToRad(float64(Deg)模板radToDeg*(rad：弧度)：Degrees=Degrees(radToDeg(float64(Rad)#目前我们不会使用正确的cos/sin/tan弧度强制#和自动转换为浮点转换器创建完整的安全单元库#。\n在使用值类型(堆栈对象、seq和字符串)时，NIM在传递参数或将参数赋值给变量时需要显式变量，因为参数是可变的。\n此外，C和C++开发人员可能会感兴趣地了解，当传递大型对象时(32位平台上超过12字节，64位平台上超过24字节)，NIM做正确的事情™，并且将默认通过引用传递(您可以在每个类型的基础上覆盖它，以始终通过复制传递或始终通过引用传递)。这意味着函数签名是出于易变性考虑，并且不受性能的影响(并且性能很好，正如基准测试所证明的那样)。\n函数强制没有副作用，否则代码将无法编译。一些副作用示例：\n如果你有一个Heisenbug，它很可能不在无副作用的函数中(除非你损坏了内存)。\n这特别适合于物理学和光线追踪计算内核，因为物理方程是无副作用的。\n尽管NIM具有所有功能，但它在C和C++目标下的编译速度都非常快，尤其是模板元编程的编译时间成本非常低。\n这受到快速VM的支持，该VM在编译时为NIM提供Python的速度，并用于：\nNIM可以编译成C和C++，并且可以无缝地调用用这两种语言编写的库，它甚至可以使用CUDA，只需稍加配置就可以调用NVCC。\n虽然NIM提供了许多高级功能，但它不会强迫您先游泳或溺水。实际上，许多人报告说，NIM感觉像是一种经过编译的脚本语言。\n并不是所有的事情都是小马和彩虹。NIM的主要问题是，它是一种非常年轻的语言，只有一个受支持的库的小生态系统。也就是说，您可以重用C和C++生态系统(也可以重用Javascript，因为Nim也可以编译到它)。例如，Trace of Radiance支持通过MP4从v0.2.0开始的视频输出，只需要60行的头C库包装。", "note_en": "Trace of Radiance is an implementationof  Ray Tracing in One Weekendin the Nim programming language.\n    In particular, I am convinced (and obviously biased) that if you want to starta rendering project (ray tracing or otherwise) from scratch, Nim is the bestlanguage to use, especially if you are focused on:\n   Rendering is an extremely time-consuming task.Nim is fast, very fast, even faster than C++ from time to time.\n     On Intel Skylake-X i9-9980XE, overclocked at 4.1 GHz all-core turbo.Compiled in x86-64 mode (SSE2 only); 384x216 image; 100 rays per pixel:\n         Single-threaded Nim is 2.7 % faster than Clang C++. Multithreaded Nim via Weave is 11.1 % faster Clang C++.\n  Here are the steps to reproduce the results.Note that if you run the tests on a different hardware, the results mightslightly vary from the ones posted above.\n git clone https://github.com/mratsim/weave cd weavenimble install -y  # install Weave dependencies, here Synthesis, overwriting if asked.nim -v  # Ensure you have nim 1.2.0 or more recent # Threads on (by default in this repo)nim c -d:danger -o:build/ray_threaded demos/raytracing/smallpt.nim # Threads offnim c -d:danger --threads:off -o:build/ray_single demos/raytracing/smallpt.nimg++ -O3 -o build/ray_gcc_single demos/raytracing/smallpt.cppg++ -O3 -fopenmp -o build/ray_gcc_omp demos/raytracing/smallpt.cppclang++ -O3 -o build/ray_clang_single demos/raytracing/smallpt.cppclang++ -O3 -fopenmp -o build/ray_clang_omp demos/raytracing/smallpt.cpp\n     Nim is one of the few languages that can properly model physical unitsand enforce proper usage of those units at compile-time.For example, a vector and a unit vector have the same representation but aredistinct types.Unit vectors are auto-convertible to vectors when passed to a function:\n type Vec3* = object x*, y*, z*: float64 UnitVector* {.borrow:`.`.} = distinct Vec3 # The `.` annotation ensures that field access is possibleconverter toVec3*(uv: UnitVector): Vec3 {.inline.} = ## UnitVector are seamlessly convertible to Vec3 (but not the other way around) Vec3(uv)\n Point3 uses the same internal representation as  Vec3 and can borrow (share)the implementation of common operators (i.e. no code-size impact):\n type Point3* {.borrow: `.`.} = distinct Vec3 # The `.` annotation ensures that field access is possiblefunc `*=`*(a: var Point3, scalar: float64) {.borrow.}func `*`*(a: Point3, scalar: float64): Point3 {.borrow.}func `*`*(scalar: float64, a: Point3): Point3 {.borrow.}\n  adding 2 points is disallowed, with an nice custom error message instead of the compiler default errors.\n func `-`*(a, b: Point3): Vec3 {.inline.}= ## Subtracting one point from another gives a vector result.x = a.x - b.x result.y = a.y - b.y result.z = a.z - b.zfunc `+`*(p: Point3, v: Vec3): Point3 {.inline.}= ## Adding a vector to a point results in a point Point3(Vec3(p) + v)func `-`*(p: Point3, v: Vec3): Point3 {.inline.}= ## Subtracting a vector from a point results in a point Point3(Vec3(p) - v)func `+`*(a, b: Point3): Point3 {.error: &#34;Adding 2 Point3 doesn&#39;t make physical sense&#34;.}\n I also have two types for colors and their attenuations (as a percentage), so youcannot multiply colors:\n type Color* {.borrow: `.`.} = distinct Vec3func `*`*(a, b: Color): Color {.error: &#34;Multiplying 2 Colors doesn&#39;t make physical sense&#34;.}type Attenuation* {.borrow: `.`.} = distinct Colorfunc `*=`*(a: var Attenuation, b: Attenuation) {.inline.} = # Multiply a color by a per-channel attenuation factor a.x *= b.x a.y *= b.y a.z *= b.zfunc `*`*(a, b: Attenuation): Attenuation {.inline.} = # Multiply a color by a per-channel attenuation factor result.x = a.x * b.x result.y = a.y * b.y result.z = a.z * b.zfunc `*=`*(a: var Color, b: Attenuation) {.inline.} = # Multiply a color by a per-channel attenuation factor a.x *= b.x a.y *= b.y a.z *= b.z\n Last but not least, ensure you don’t mix and match degrees and radians,with auto-conversion of radians to float (and degree would stay at a higher level):\n type Degrees* = distinct float64 Radians* = distinct float64template degToRad*(deg: Degrees): Radians = Radians(degToRad(float64(deg)))template radToDeg*(rad: Radians): Degrees = Degrees(radToDeg(float64(rad)))# For now we don&#39;t create our full safe unit library# with proper cos/sin/tan radians enforcing# and auto-convert to floatconverter toF64*(rad: Radians): float64 {.inline.} = float64(rad)\n  When using value types (stack objects, seq and strings), Nim requires anexplicit  var when passing parameters or assigning to a variable fora parameter to be mutable.\n  Furthermore, C and C++ developers might be interested to know thatwhen passing a large object (over 12 bytes on 32-bit and 24 bytes on 64-bit platforms),Nim does the Right Thing™ and will pass by reference by default(you can override that on a per-type basis to always pass-by-copy or always by reference).This means that function signatures are motivated by mutability concerns anduncluttered from performance (and performance is great, as proven by the benchmarks).\n   A  func enforces the absence of side-effects or the code will not compile.Some examples of side-effects:\n  If you have a Heisenbug, it’s likely not in a side-effect free function(unless you corrupt memory).\n This is particularly suited to physics and ray tracing computational kernelsas physics equations are side-effect free.\n  Despite all its features, Nim compiles extremely fast with both C and C++ targets.In particular template metaprogramming has a very low compilation-time cost.\n  This is supported by a fast VM that gives Nim the speed of Python atcompile-time and is used for:\n   Nim can compile to both C and C++ and seamlessly call libraries written in either language.It can even use CUDA with a bit of configuration to call  nvcc.\n    While Nim offers many advanced features, it does not force you to swim or drownon first approach. Actually many have reported that Nim felt like a compiled scripting language.\n  Not all is ponies and rainbows. Nim’s main issue is that it is a very young languagewith a small ecosystem of supported libraries.That said, you can reuse the C and C++ ecosystem (and Javascript as well, sinceNim can also compile to it).As an example, Trace of Radiance supports video output via MP4 since v0.2.0 via a simple 60-line wrapperof a header-only C library.", "posttime": "2020-07-02 06:29:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "光线,tracing,nim", "title": "NIM中的光线跟踪", "title_en": "Ray Tracing in Nim", "transed": 1, "url": "https://nim-lang.org/blog/2020/06/30/ray-tracing-in-nim.html", "via": "", "real_tags": ["光线", "tracing", "nim"]}, {"category": "", "categoryclass": "", "imagename": "a3aa24356e347e5db9d222a2b07dfaa3.jpg", "infoid": 1009384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2014年6月初，圣路易斯卢米埃广场赌场(Lumiere Place Casino)的会计师注意到，他们的几台老虎机只有几天就出了故障。政府批准的为这类机器提供动力的软件给了赌场一个固定的数学优势，这样赌场就可以确定他们从长期来看能赚多少钱-比如，每玩一美元就能赚7.129美分。但在6月2日和3日，卢米埃的一些机器吐出的钱远远超过了它们的消费，尽管没有颁发任何大奖，这一反常行为在业内被称为负面持有。由于代码不容易突然疯狂，唯一合理的解释是有人作弊。\n赌场保安调出了监控录像，最终发现了肇事者，这是一名30多岁的黑发男子，他穿着Polo拉链，带着一个方形的棕色钱包。与大多数老虎机作弊者不同的是，他似乎没有对他瞄准的任何一台机器进行修修补补，这些机器都是澳大利亚贵族休闲公司(Aristcrat休闲)制造的较旧型号。取而代之的是，他只是玩游戏，在像“星际迷航”或“鹈鹕皮特”这样的游戏中按下按钮，同时偷偷地把他的iPhone放在靠近屏幕的地方。\n他会在几分钟后离开，然后稍晚一点回来给游戏第二次机会。那是他走运的时候。这名男子会将20至60美元的投资转化为高达1300美元的投资，然后套现并转移到另一台机器上，在那里他会重新开始循环。在两天的时间里，他的奖金略高于2.1万美元。他连胜期间唯一奇怪的行为是，他将手指长时间悬停在旋转按钮上，最后匆忙戳了一下；老虎机选手通常不会在这样的旋转之间停顿。\n6月9日，Lumiere Place与密苏里州博彩委员会分享了他们的发现，密苏里州博彩委员会随后发布了全州范围的警报。几家赌场很快发现，他们以同样的方式被欺骗，尽管经常是被不同的人所欺骗，而不是那个骗取卢米埃广场(Lumiere Place)的人。在每一起案件中，肇事者都在好运来临前不久拿着一部手机靠近一台贵族马克六世型号的老虎机。\n通过检查租车记录，密苏里州当局确认卢米埃广场诈骗犯是37岁的俄罗斯国民木拉提·布利耶夫(Alejandro Bliev)。布利耶夫已于6月6日飞回莫斯科，但他工作的那个总部位于圣彼得堡的组织很快将他送回了美国，加入了另一个作弊船员的行列。该组织雇佣了数十名特工，在世界各地操纵老虎机。事实证明，将Bliev重新部署到美国的决定，对于一家通过破解游戏行业一些最宝贵的算法而悄悄赚取数百万美元的企业来说，将是一个罕见的失误。\n自2009年以来，俄罗斯一直是老虎机相关渎职行为的温床，当时该国几乎禁止所有赌博。(据报道，时任总理弗拉基米尔·普京(Vladimir Putin)认为此举将削弱格鲁吉亚有组织犯罪的力量。)。这项禁令迫使数千家赌场以大幅折扣将老虎机出售给他们能找到的任何客户。其中一些降价老虎机最终落入造假者手中，他们急于学习如何将新游戏加载到旧电路板上。其他人显然去找了木拉提·布利耶夫在圣彼得堡的老板，他们热衷于调查机器的源代码是否存在漏洞。\n到2011年初，整个中欧和东欧的赌场都在记录由奥地利公司Novom制造的老虎机支付了令人难以置信的巨额款项的事件。诺华公司的工程师没有发现有问题的机器被篡改的证据，这使得他们推断作弊者已经想出了如何预测老虎机的行为。该公司在2011年2月发给客户的一份通知中承认：“通过有针对性地、长时间地观察单个游戏的序列，以及可能记录单个游戏，据称有可能在游戏结果中识别出一种‘模式’。”\n认识到这些模式需要付出非凡的努力。老虎机的结果由称为伪随机数生成器的程序控制，这些程序通过设计产生令人费解的结果。政府监管机构，如密苏里州博彩委员会，在赌场可以部署每个算法之前，都会对其完整性进行审查。\n但正如名称中的“伪”所暗示的那样，这些数字并不是真正随机的。因为人类使用编码指令来创建它们，所以PRNG不禁有点确定性。(真正的随机数生成器必须植根于非人为现象，例如放射性衰变。)。PRNG获取一个初始数字，称为种子，然后将其与各种隐藏和移动的输入(例如，来自机器内部时钟的时间)混合在一起，以产生似乎无法预测的结果。但是，如果黑客能够识别出数学炖肉中的各种成分，他们就可以潜在地预测PRNG的产量。当然，当黑客可以实际接触到老虎机的内部时，逆向工程的过程就变得容易得多。\n然而，知道老虎机用来产生伪随机结果的秘密算法并不足以帮助黑客。这是因为PRNG的输入根据每台机器的时间状态而不同。种子在不同的时间是不同的，例如，从内部时钟中挑选的数据也是不同的。因此，即使他们了解机器的PRNG是如何工作的，黑客也必须分析机器的游戏性，以辨别其模式。这既需要时间，也需要大量的计算能力，在鹈鹕皮特面前敲打笔记本电脑是吸引赌场安全注意的好方法。\n卢米埃广场骗局展示了木拉提·布里耶夫和他的同伙是如何绕过这一挑战的。在得知密苏里州发生的事情后，时任路易斯安那州查尔斯湖L‘Auberge du Lac赌场度假村监控主管的赌场安全专家达林·霍克(Darrin Hoke)自行调查了黑客行动的范围。通过采访报告可疑老虎机活动的同事，并查看他们的监控照片，他能够识别出25名涉嫌在加州、罗马尼亚和澳门的赌场工作的特工。霍克还利用酒店登记记录发现，Bliev的两名来自圣路易斯的同伙仍留在美国，并向西前往加利福尼亚州特梅库拉的Pechanga Resort&Amp；Casino。2014年7月14日，加州司法部(California Department Of Justice)的特工在佩昌加拘留了其中一名特工，没收了他的四部手机，以及6000美元。(这名男子是俄罗斯国民，没有被起诉；他目前下落不明。)。\n来自佩昌加的手机，结合密苏里州和欧洲调查的情报，揭示了关键细节。据拉斯维加斯赌场安全顾问威利·艾利森(Willy Allison)称，多年来一直在追踪这起俄罗斯骗局的特工们用手机记录下了他们打算作弊的一场比赛的大约24个旋转。他们将视频上传给圣彼得堡的一名技术人员，由他们分析视频，并根据他们对模型伪随机数生成器的了解来计算机器的模式。最后，圣彼得堡团队将计时标记列表传输到操作员手机上的一个自定义应用程序；这些标记会使手机在操作员按下旋转按钮前大约0.25秒振动。\n“人类的正常反应时间大约是四分之一秒，这就是为什么他们会这么做，”艾利森说，他也是一年一度的世界游戏保护大会的创始人。定时旋转并不总是成功的，但它们产生的奖励远远超过机器通常奖励的金额：单个骗子通常每天赢得超过1万美元。(艾利森指出，这些操作员试图将他们在每台机器上赢得的奖金控制在1000美元以下，以避免引起怀疑。)。一个在多个赌场工作的四人团队一周的收入可以超过25万美元。\n由于在他的祖国没有老虎机可以诈骗，木拉提·布里耶夫从圣路易斯回来后并没有在俄罗斯逗留太久。2014年，他又去了两次美国，第二次是从12月3日开始的。他从芝加哥黑尔机场直奔密苏里州圣查尔斯，在那里他遇到了另外三名接受过诈骗贵族Mark VI老虎机训练的人：伊万·古达洛夫、伊戈尔·拉雷诺夫和叶夫根尼·纳扎罗夫。四重奏计划在接下来的几天里袭击密苏里州和伊利诺伊州西部的多家赌场。\n布利夫就不应该回来。12月10日，在安全人员在圣路易斯好莱坞赌场内发现Bliev后不久，这四名骗子被逮捕。由于Bliev和他的同伙们跨越了州界实施了骗局，联邦当局指控他们共谋欺诈。起诉书是圣彼得堡组织遭遇的第一次重大挫折；此前从未有任何一名圣彼得堡组织的特工面临起诉。\n布利耶夫、古达洛夫和拉列诺夫都是俄罗斯公民，他们最终接受了辩诉交易，并分别被判在联邦监狱服刑两年。\n纳扎罗夫提供的任何信息可能都太过时了，没有多大价值。在密苏里州被捕后的两年里，圣彼得堡组织的外勤人员变得更加谨慎。他们的一些新伎俩在去年曝光，当时新加坡当局抓获并起诉了一个团伙：其中一名成员是捷克人拉多斯拉夫·斯库布尼克(Radola V Skubnik)，他泄露了该组织的财务结构(90%的收入归圣彼得堡所有)和运营策略的细节。“他们现在要做的就是把手机放到衬衫的胸前口袋里，放在一小块网眼后面，”艾利森说。“这样他们在录制的时候就不必把它拿在手里了。”安全专家达林·霍克(Darrin Hoke)表示，他收到报告称，诈骗者可能通过Skype将视频流传回俄罗斯，因此他们不再需要离开老虎机就可以上传视频。\n密苏里州和新加坡的案件似乎是唯一被起诉的诈骗者，尽管也有少数案件被个别赌场抓获并取缔。与此同时，圣彼得堡组织已经把他们的特工送到越来越远的地方。例如，近几个月来，秘鲁至少有三家赌场报告称被俄罗斯赌客欺骗，这些赌客玩的是老化的Novom Coolfire老虎机。\n博彩业的经济现实似乎保证了圣彼得堡组织将继续蓬勃发展。这些机器没有容易的技术修理。正如霍克所指出的那样，Aristcrat、Novom和任何其他PRNG被破解的制造商“将不得不停止所有机器的服务，并投入其他设备，他们不会这样做的。”(在Aristcrat对“连线”杂志的声明中，该公司强调，它一直无法“找出目标游戏中的缺陷”，它的机器“是按照严格的监管技术标准制造的，并得到了批准”。)。与此同时，大多数赌场都买不起最新的老虎机，它们的PRNG使用加密来保护数学秘密；只要旧的、受损的老虎机仍然受到顾客的欢迎，赌场的明智财务举措就是继续使用它们，并接受偶尔被骗子蒙受的损失。\n因此，赌场安全人员有责任密切关注骗局的细枝末节。手指在旋转按钮上方停留太久可能是警卫唯一的线索，表明圣彼得堡的黑客即将再次得分。", "note_en": "In early June 2014, accountants at the Lumiere Place Casino in St. Louis noticed that several of their slot machines had—just for a couple of days—gone haywire. The government-approved software that powers such machines gives the house a fixed mathematical edge, so that casinos can be certain of how much they’ll earn over the long haul—say, 7.129 cents for every dollar played. But on June 2 and 3, a number of Lumiere’s machines had spit out far more money than they’d consumed, despite not awarding any major jackpots, an aberration known in industry parlance as a negative hold. Since code isn’t prone to sudden fits of madness, the only plausible explanation was that someone was cheating.\n Casino security pulled up the surveillance tapes and eventually spotted the culprit, a black-haired man in his thirties who wore a Polo zip-up and carried a square brown purse. Unlike most slots cheats, he didn’t appear to tinker with any of the machines he targeted, all of which were older models manufactured by Aristocrat Leisure of Australia. Instead he’d simply play, pushing the buttons on a game like Star Drifter or Pelican Pete while furtively holding his iPhone close to the screen.\n He’d walk away after a few minutes, then return a bit later to give the game a second chance. That&#39;s when he&#39;d get lucky. The man would parlay a $20 to $60 investment into as much as $1,300 before cashing out and moving on to another machine, where he’d start the cycle anew. Over the course of two days, his winnings tallied just over $21,000. The only odd thing about his behavior during his streaks was the way he’d hover his finger above the Spin button for long stretches before finally jabbing it in haste; typical slots players don&#39;t pause between spins like that.\n On June 9, Lumiere Place shared its findings with the Missouri Gaming Commission, which in turn issued a statewide alert. Several casinos soon discovered that they had been cheated the same way, though often by different men than the one who’d bilked Lumiere Place. In each instance, the perpetrator held a cell phone close to an Aristocrat Mark VI model slot machine shortly before a run of good fortune.\n  By examining rental-car records, Missouri authorities identified the Lumiere Place scammer as Murat Bliev, a 37-year-old Russian national. Bliev had flown back to Moscow on June 6, but the St. Petersburg–based organization he worked for, which employs dozens of operatives to manipulate slot machines around the world, quickly sent him back to the United States to join another cheating crew. The decision to redeploy Bliev to the US would prove to be a rare misstep for a venture that’s quietly making millions by cracking some of the gaming industry’s most treasured algorithms.\n  Russia has been a hotbed of slots-related malfeasance since 2009, when the  country outlawed virtually all gambling. (Vladimir Putin, who was prime minister at the time, reportedly believed the move would reduce the power of Georgian organized crime.) The ban forced thousands of casinos to sell their slot machines at steep discounts to whatever customers they could find. Some of those cut-rate slots  wound up in the hands of counterfeiters eager to learn how to load new games onto old circuit boards. Others apparently went to Murat Bliev’s bosses in St. Petersburg, who were keen to probe the machines’ source code for vulnerabilities.\n By early 2011, casinos throughout central and eastern Europe were logging incidents in which slots made by the Austrian company Novomatic paid out improbably large sums. Novomatic’s engineers could find no evidence that the machines in question had been tampered with, leading them to theorize that the cheaters had figured out how to predict the slots’ behavior. “Through targeted and prolonged observation of the individual game sequences as well as possibly recording individual games, it might be possible to allegedly identify a kind of ‘pattern’ in the game results,” the company admitted in a February 2011 notice to its customers.\n   Recognizing those patterns would require remarkable effort. Slot machine outcomes are controlled by programs called pseudorandom number generators that produce baffling results by design. Government regulators, such as the Missouri Gaming Commission, vet the integrity of each algorithm before casinos can deploy it.\n But as the “pseudo” in the name suggests, the numbers aren&#39;t truly random. Because human beings create them using coded instructions, PRNGs can&#39;t help but be a bit deterministic. (A true random number generator must be rooted in a phenomenon that is not manmade, such as  radioactive decay.) PRNGs take an initial number, known as a seed, and then mash it together with various hidden and shifting inputs—the time from a machine’s internal clock, for example—in order to produce a result that appears impossible to forecast. But if hackers can identify the various ingredients in that mathematical stew, they can potentially predict a PRNG’s output. That process of reverse engineering becomes much easier, of course, when a hacker has physical access to a slot machine’s innards.\n Knowing the secret arithmetic that a slot machine uses to create pseudorandom results isn’t enough to help hackers, though. That’s because the inputs for a PRNG vary depending on the temporal state of each machine. The seeds are different at different times, for example, as is the data culled from the internal clocks. So even if they understand how a machine’s PRNG functions, hackers would also have to analyze the machine’s gameplay to discern its pattern. That requires both time and substantial computing power, and pounding away on one’s laptop in front of a Pelican Pete is a good way to attract the attention of casino security.\n  The Lumiere Place scam showed how Murat Bliev and his cohorts got around that challenge. After hearing what had happened in Missouri, a casino security expert named Darrin Hoke, who was then director of surveillance at L’Auberge du Lac Casino Resort in Lake Charles, Louisiana, took it upon himself to investigate the scope of the hacking operation. By interviewing colleagues who had reported suspicious slot machine activity and by examining their surveillance photos, he was able to identify 25 alleged operatives who&#39;d worked in casinos from California to Romania to Macau. Hoke also used hotel registration records to discover that two of Bliev’s accomplices from St. Louis had remained in the US and traveled west to the Pechanga Resort &amp; Casino in Temecula, California. On July 14, 2014, agents from the California Department of Justice detained one of those operatives at Pechanga and confiscated four of his cell phones, as well as $6,000. (The man, a Russian national, was not indicted; his current whereabouts are unknown.)\n The cell phones from Pechanga, combined with intelligence from investigations in Missouri and Europe, revealed key details. According to Willy Allison, a Las Vegas–based casino security consultant who has been tracking the Russian scam for years, the operatives use their phones to record about two dozen spins on a game they aim to cheat. They upload that footage to a technical staff in St. Petersburg, who analyze the video and calculate the machine’s pattern based on what they know about the model’s pseudorandom number generator. Finally, the St. Petersburg team transmits a list of timing markers to a custom app on the operative’s phone; those markers cause the handset to vibrate roughly 0.25 seconds before the operative should press the spin button.\n  “The normal reaction time for a human is about a quarter of a second, which is why they do that,” says Allison, who is also the founder of the annual World Game Protection Conference. The timed spins are not always successful, but they result in far more payouts than a machine normally awards: Individual scammers typically win more than $10,000 per day. (Allison notes that those operatives try to keep their winnings on each machine to less than $1,000, to avoid arousing suspicion.) A four-person team working multiple casinos can earn upwards of $250,000 in a single week.\n   Since there are no slot machines to swindle in his native country, Murat Bliev didn’t linger long in Russia after his return from St. Louis. He made two more trips to the US in 2014, the second of which began on December 3. He went straight from Chicago O&#39;Hare Airport to St. Charles, Missouri, where he met up with three other men who’d been trained to scam Aristocrat’s Mark VI model slot machines: Ivan Gudalov, Igor Larenov, and Yevgeniy Nazarov. The quartet planned to spend the next several days hitting various casinos in Missouri and western Illinois.\n Bliev should never have come back. On December 10, not long after security personnel spotted Bliev inside the Hollywood Casino in St. Louis, the four scammers were arrested. Because Bliev and his cohorts had pulled their scam across state lines, federal authorities charged them with conspiracy to commit fraud. The indictments represented the first significant setbacks for the St. Petersburg organization; never before had any of its operatives faced prosecution.\n Bliev, Gudalov, and Larenov, all of whom are Russian citizens, eventually accepted plea bargains and were each sentenced to two years in federal prison, to be followed by deportation. Nazarov, a Kazakh who was granted religious asylum in the US in 2013 and is a Florida resident, still awaits sentencing, which indicates that he is cooperating with the authorities: In a statement to WIRED, Aristocrat representatives noted that one of the four defendants has yet to be sentenced because he “continues to assist the FBI with their investigations.”\n   Whatever information Nazarov provides may be too outdated to be of much value. In the two years since the Missouri arrests, the St. Petersburg organization’s field operatives have become much cagier. Some of their new tricks were revealed last year, when Singaporean authorities caught and prosecuted a crew: One member, a Czech named Radoslav Skubnik, spilled details about the organization’s financial structure (90 percent of all revenue goes back to St. Petersburg) as well as operational tactics. “What they’ll do now is they’ll put the cell phone in their shirt’s chest pocket, behind a little piece of mesh,” says Allison. “So they don’t have to hold it in their hand while they record.” And Darrin Hoke, the security expert, says he has received reports that scammers may be streaming video back to Russia via Skype, so they no longer need to step away from a slot machine to upload their footage.\n The Missouri and Singapore cases appear to be the only instances in which scammers have been prosecuted, though a few have also been caught and banned by individual casinos. At the same time, the St. Petersburg organization has sent its operatives farther and farther afield. In recent months, for example, at least three casinos in Peru have reported being cheated by Russian gamblers who played aging Novomatic Coolfire slot machines.\n The economic realities of the gaming industry seem to guarantee that the St. Petersburg organization will continue to flourish. The machines have no easy technical fix. As Hoke notes, Aristocrat, Novomatic, and any other manufacturers whose PRNGs have been cracked “would have to pull all the machines out of service and put something else in, and they’re not going to do that.” (In Aristocrat’s statement to WIRED, the company stressed that it has been unable “to identify defects in the targeted games” and that its machines “are built to and approved against rigid regulatory technical standards.”) At the same time, most casinos can’t afford to invest in the newest slot machines, whose PRNGs use encryption to protect mathematical secrets; as long as older, compromised machines are still popular with customers, the smart financial move for casinos is to keep using them and accept the occasional loss to scammers.\n So the onus will be on casino security personnel to keep an eye peeled for the scam’s small tells. A finger that lingers too long above a spin button may be a guard’s only clue that hackers in St. Petersburg are about to make another score.", "posttime": "2020-07-02 06:28:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,俄罗斯,作弊,engineer,老虎机", "title": "俄罗斯人设计了一个绝妙的老虎机作弊-赌场没有修复", "title_en": "Russians Engineer a Brilliant Slot Machine Cheat–and Casinos Have No Fix", "transed": 1, "url": "https://www.wired.com/2017/02/russians-engineer-brilliant-slot-machine-cheat-casinos-no-fix/", "via": "", "real_tags": ["设计", "俄罗斯", "作弊", "engineer", "老虎机"]}, {"category": "", "categoryclass": "", "imagename": "b0ccae4c104a6bfb3d5c6ca2516b617d.jpg", "infoid": 1009383, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲火箭公司阿丽亚娜空间公司在一年的大部分时间里一直试图发射一枚搭载数十颗小卫星的织女星火箭。\n首先，在织女星火箭经历了15次飞行中的首次失败后，发射从2019年年中推迟。(这发生在2019年7月。)。今年早些时候，在火箭的故障被调查和解决后，阿丽亚娜空间公司将织女星的返航任务定在了3月23日。但后来新冠肺炎疫情开始在世界各地蔓延，法属圭亚那的欧洲航天港最终关闭了大约三个月。\n最后，发射日期被重新设定为6月18日。四级火箭及其由53颗独立卫星组成的有效载荷-从1公斤的立方体卫星到500公斤的迷你卫星-已经准备就绪。近两周前，所有人似乎都准备发射这次任务--后来预测变得不太乐观。\n织女星火箭有一条相当狭窄的发射走廊来执行极地任务，6月18日沿着这条路径的高层大气中的风是不利的。在刚刚过去的周末(6月27日和6月28日)，重新安排发射日期的风继续顽固。\n周三，阿丽亚娜空间公司(Arianespace)似乎沮丧地举起了双手。发射公司在一份新闻稿中表示，由于预计短期内天气状况不会改善，阿丽亚娜空间公司决定将VV16航班推迟到2020年8月17日，届时基于风向建模，天气预报预计会更有利。我们理解21位顾客的不耐烦，并与他们分享这一点。\n由于天气原因，七周的延误似乎有点过分，所以我们决定再深入调查一下。\n首先，当谈到高空风时，未来一周或10天的预报确实看起来很粗糙。然而，在接下来的七周里，这种模式并不一定会持续下去。织女星的15次发射中，有4次是在6月、7月和8月发射的，所以火箭肯定可以在夏季从南美发射。\n然而，这枚小型火箭(以及它的一些卫星)上的电池在某个时候必须充电。这一过程似乎涉及客户代表飞往法属圭亚那执行这项任务，在抵达与巴西接壤的法国非欧洲地区后，有14天的强制性检疫。\n最后，阿丽亚娜空间公司还有一项商业卫星发射任务即将在其更大的阿丽亚娜5号火箭上进行，这次VA253飞行定于7月28日进行。因为在法属圭亚那的航天港发射之间至少有两周的周转时间，所以在这次任务之前没有时间重新设置织女星火箭及其有效载荷。\n因此，织女星火箭的第16次发射，这是一次关键的重返任务飞行，也将证明火箭作为小卫星运载火箭的可行性，将至少再推迟7周。卫星逻辑公司(Satellogic)首席执行官埃米利亚诺·卡吉曼(Emily Iano Kargieman)周三在Twitter上表示：火箭上的顾客关心吗？哦，顾客关心。", "note_en": "The European rocket firm Arianespace has been trying to launch a Vega rocket carrying dozens of small satellites for the better part of a year.\n First, the launch was delayed from mid-2019 after the Vega rocket experienced its first failure in 15 flights. (That happened in July 2019.) Early this year, after the rocket&#39;s failure was investigated and addressed, Arianespace set a date for Vega&#39;s return-to-flight mission on March 23. But then the COVID-19 pandemic began spreading around the world, and the European spaceport in French Guiana was ultimately closed for about three months.\n Finally, the launch date was reset for June 18. The four-stage rocket and its payload of 53 separate satellites—ranging from 1kg CubeSats up to 500kg mini-satellites—was readied. All appeared go for launch with this &#34;VV16&#34; mission nearly two weeks ago—then the forecast turned unfavorable.\n  The Vega rocket has a fairly narrow launch corridor for polar missions, and winds in the upper atmosphere along this path were unfavorable on June 18. The winds continued to be obstinate for rescheduled launch dates this past weekend (June 27 and June 28).\n On Wednesday, Arianespace seemed to throw up its hands in frustration. &#34;With no improvement in the weather situation expected during the short term, Arianespace has decided to postpone Flight VV16 until August 17, 2020, when the forecast is expected to be more favorable based on modeling of the winds,&#34; the launch company said  in a news release. &#34;We understand the impatience of our 21 customers, and we share it.&#34;\n A seven-week delay  due to weather seems a little excessive, so we decided to dig a little further.\n  First of all, the forecast for the next week or 10 days does look cruddy when it comes to upper-level winds. However it&#39;s not like this pattern will necessarily persist for the next seven weeks. Of Vega&#39;s 15 launches, four have flown during the months of June, July, and August—so the rocket can definitely launch during the summer from South America.\n However, the batteries aboard the small rocket (and on some of its satellites) must, at some point, be recharged. This process appears to involve customer representatives flying into French Guiana to perform this task, and there is a mandatory 14-day quarantine upon arrival in the non-European part of France which borders Brazil.\n Finally, Arianespace also has a commercial-satellite launch mission upcoming on its larger Ariane 5 rocket, and this VA253 flight has been scheduled for July 28. Because there is a minimum of a two-week turnaround time between launches at the spaceport in French Guiana, there was not time to reset the Vega rocket and its payloads before this mission.\n And so the 16th launch of a Vega rocket, a critical return-to-mission flight that will also demonstrate the rocket&#39;s viability as a small-satellite launch vehicle, will be delayed for at least seven more weeks. And do the customers aboard the rocket care? &#34;Oh, the customers care,&#34; Emiliano Kargieman, chief executive of Satellogic,  said on Twitter Wednesday.", "posttime": "2020-07-02 06:10:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,原因,europe,发射", "title": "由于天气原因，欧洲最小火箭的发射推迟了七周", "title_en": "Launch of Europe’s smallest rocket is delayed seven weeks—for weather", "transed": 1, "url": "https://arstechnica.com/science/2020/07/launch-of-europes-smallest-rocket-is-delayed-seven-weeks-for-weather/", "via": "", "real_tags": ["火箭", "原因", "europe", "发射"]}, {"category": "", "categoryclass": "", "imagename": "f08f8a668959572979705e33e8db1765.jpg", "infoid": 1009382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西雅图-周三早些时候，警察进入并清理了西雅图市中心附近的一个区域，那里的示威者包围了一个警察局，并在针对警察暴行的全国性抗议活动中设立了“无警察”区。\n市政府官员在决定撤离该地区时列举了一系列暴力事件，包括上个月在10天内发生的至少四起枪击事件中，两名青少年死亡。\n西雅图警察局局长卡门·贝斯特(Carmen Best)在声明中说，“黑人的生命很重要，我也想帮助推动这场运动，让我们的社区发生有意义的变化。”“但适可而止。”\n撤离该地区的命令发布之际，围绕如何处理该地区的紧张局势日益加剧，在明尼阿波利斯乔治·弗洛伊德(George Floyd)去世后，抗议者将该地区作为象征性声明封锁了起来。持续不断的问题引起了特朗普总统的注意，他抨击西雅图和华盛顿州的民主党官员未能更早地清理该地区。\n“如果他们不做这项工作，我就做这项工作，”总统上个月说。\n凌晨5点刚过，一群警察挤过了该地区。周三，一些人戴着头盔，手持警棍。官员们表示，这些装备“并不是为了先发制人地展示武力”，但这是必要的，因为聚集在该地区的人众所周知都有武器。\n德雷克·艾伦·琼斯二世(Derrek Allen Jones II)说：“我醒来时，每个人都尖叫着跑着说，‘警察，警察，他们来了。’”他说，他已经在这个区域呆了几个星期。\n当一架直升机在头顶呼啸而过时，警察们在该地区的边缘排成一排。抗议者在十字路口转来转去，一些人向警察大喊大叫。几名警察直接与抗议者对话，其他人则带着一名戴着手铐的男子离开。一名男子表示，当警察将抗议者推回第12街和派克街时，他被胡椒喷雾击中。一名妇女在空中举起拳头，高呼：“这是我们的街道。”\n警方在Twitter上表示，23人因被控未驱散、阻挠、拒捕和袭击而被捕，其中包括一名29岁的男子，他有一根大金属管和一把菜刀。\n上午7点刚过，贝斯特局长在接受记者采访时表示，她支持和平示威，但表示不能容忍最近在自治区发生的暴力事件。\n他说：“我们的工作是保护和服务社会。我们的工作是支持和平示威，“她说。“但过去两周--也就是说，几周--在这些街道上发生的事情是违法的，这是残忍的，而且底线是，这简直是不可接受的。”\n这座城市此前做出了一个不同寻常的决定，放弃了国会山社区的一个警察局，用木板封住窗户，让抗议者在外面自由活动。此前，全国各地都发生了抗议弗洛伊德在警方拘留期间死亡的示威活动。\n抗议者声称占领了几个街区，并在空无一人的警察局前门竖起了横幅，上面写着：“这个地方现在是西雅图人的财产。”\n贝斯特局长说，周三早上警方清理了该地区后，警察检查了东区警察局是否存在“障碍物和其他问题”，但还没有在大楼外行动。\n身穿黄色和橙色背心的城市工人开始拆除喷漆路障和艺术品。写着“黑人生命重要之前，所有生命都无关紧要”和“R.I.P.E.分局”的标语仍然留在第12大道两旁的空帐篷前。\n据侦探马克·贾米森(Mark Jamieson)说，警察到达时，抗议者已被警告驱散。\n有人想被逮捕，“他说。“我们下达了多个驱散的命令，然后要么人们离开，要么他们不离开。”\n市政府官员坚称，警方不会允许该市任何地区陷入无法无天的境地。\n本月早些时候，贝斯特局长说：“西雅图市没有免警区。”“我认为很多地区都描绘了这幅图景，显示这座城市已被围困。事实并非如此。“", "note_en": "SEATTLE — Police officers moved in and cleared an area near downtown Seattle early Wednesday where demonstrators had surrounded a police station and established a “no cop” zone amid national protests over police brutality.\n City officials cited a series of violent episodes in their decision to vacate the region, including the deaths of two teenagers amid at least four shootings  in a matter of 10 days last month.\n “Black Lives Matter, and I too want to help propel this movement toward meaningful change in our community,” Chief Carmen Best of the Seattle Police Department  said in statement. “But enough is enough.”\n The order to vacate the area came amid growing tensions over how to handle an area that was cordoned off as a symbolic statement by protesters after the death of George Floyd in Minneapolis. The continuing problems had drawn the attention of President Trump, who blasted Democratic officials in Seattle and Washington State for failing to clear the area earlier.\n “If they don’t do the job, I’ll do the job,” the president  said last month.\n A crowd of police officers pushed through the area just after 5 a.m. Wednesday,  some wearing helmets and carrying batons. Officials said the equipment was “not meant to be a pre-emptive show of force” but was necessary because people gathered in the area were known to be armed.\n   “I woke up to everybody screaming and running saying, ‘The cops, the cops, they’re here,’” said Derrek Allen Jones II, who said he had been staying at the zone for several weeks.\n Officers lined up on the edge of the area as a helicopter whirred overhead. Protesters milled around the intersection, some shouting at the police. A couple of officers engaged in dialogue directly with protesters as others led a man away in handcuffs. One man said he had been hit with pepper spray as officers pushed protesters back to 12th and Pike Street. A woman raised her fist in the air and chanted, “These are our streets.”\n Twenty-three people were arrested on charges of failure to disperse, obstruction, resisting arrest and assault, the police department  said on Twitter, including a 29-year-old man who had a large metal pipe and a kitchen knife.\n In remarks to reporters just after 7 a.m., Chief Best said she supported peaceful demonstrations, but said the recent violence in the autonomous zone could not be tolerated.\n “Our job is to protect and to serve the community. Our job is to support peaceful demonstrations,” she said. “But what has happened here on these streets over the last two weeks — few weeks, that is — is lawless, and it’s brutal, and bottom line, it is simply unacceptable.”\n  The city had previously made the unusual decision to abandon a police station in the Capitol Hill neighborhood, board up its windows and let protesters have free rein outside in the wake of demonstrations nationwide over Mr. Floyd’s death in police custody.\n  Protesters laid claim to several city blocks and put up a banner on the front entrance of the emptied police station reading, “This space is now property of the Seattle people.”\n After the police cleared the area on Wednesday morning, officers checked the East Precinct station for “obstacles and other concerns,” Chief Best said, but were not yet operating out of the building.\n City workers in yellow and orange vests began removing spray-painted barricades and artwork. Signs reading, “All lives don’t matter until Black lives matter” and “R.I.P. E. Precinct” remained in front of empty tents that lined 12th Avenue.\n Protesters had been issued warnings to disperse when the police arrived, according to Detective Mark Jamieson.\n &#34;There were people that wanted to be arrested,” he said. “We gave multiple orders to disperse and then either people leave or they don’t.”\n  City officials had insisted that the police would not allow any area of the city to fall into lawlessness.\n “There is no cop-free zone in the city of Seattle,” Chief Best said earlier this month. “I think that the picture has been painted in many areas that shows the city is under siege. That is not the case.”", "posttime": "2020-07-02 06:08:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "清除,clear,警察", "title": "警方清除西雅图抗议活动的“自治区”", "title_en": "Police Clear Seattle’s Protest ‘Autonomous Zone’", "transed": 1, "url": "https://www.nytimes.com/2020/07/01/us/seattle-protest-zone-CHOP-CHAZ-unrest.html", "via": "", "real_tags": ["清除", "clear", "警察"]}, {"category": "", "categoryclass": "", "imagename": "c5153c0aaa1988f5ea556dc417bcc550.jpg", "infoid": 1009381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Vizio即将出货其首批OLED电视，此前该公司以生产LED电视的电子产品制造商而闻名，该公司在成本和性能之间提供了特别强的平衡。该公司还刚刚开始推出其年度LED电视系列。\n按照大多数人的标准，OLED机型价格不菲，但略低于索尼或LG的入门级电视机，这两家公司已经成为美国OLED电视机的唯一大型供应商一段时间了。Vizio计划以1300美元和2000美元的价格发货55英寸和65英寸的型号。\nVizio在美国的市场份额比LG或索尼大得多(仅次于三星和TCL，位居第三)，因此，如果这些电视机像其LED产品线一样成功，Vizio可能会成为最受欢迎的OLED电视制造商。大多数评论家一致认为，Vizio的LED电视既不是最便宜的，也不是绝对最高质量的--但它们可能是许多发烧友的最佳中间选择。Vizio的目标似乎是与OLED采取类似的战略。\n这些新的OLED提供了与LG&#39；2020年的OLED类似的纸面规格：HDMI 2.1端口，120 Hz下的4K，eARC，FreeSync，当然还有HDR-大多数你期待在2020年旗舰电视上看到的新福利。Vizio OLED55-H1和OLED65-H1都将于今年秋天在美国上市。\n至于LED产品阵容，现已开始供应FV系列、M系列、P系列和P系列Quantum X系列产品。该公司的4K发光二极管价格从230美元到3000美元不等，尺寸从40英寸到85英寸不等。P系列Quantum X是Vizio提供的顶级LED设备。该系列的设备声称高达800尼特的全屏亮度和792个局部调光区，以及HDMI 2.1端口，可以支持VRR、eARC和4K@120 Hz等功能-其中一些对即将推出的PlayStation5和Xbox Series X游戏机是有利的。这些套装的价格从1500美元的55英寸到3000美元的85英寸不等。\n考虑到价格，P系列是大多数发烧友更有可能感兴趣的。虽然这些电视仍然提供4K和所有最新的HDR功能，但它们的调光区明显减少-高达240个-峰值亮度的一半，所有这些都是更低的价位。沿着这条线再往下走的是M系列，它们的降频能力提供了更少的调光区。\n局部调光区对于LED电视的图像质量至关重要。这是因为它们帮助场景中黑暗的部分保持黑暗，即使在视野中的其他地方有明亮的高光。这并不像OLED电视那样令人担忧，因为OLED电视上的每个像素都可以独立打开或完全关闭-LED则不是这样。\n不同寻常的是，维齐奥将所有这些套装都命名为2021年的阵容，因为全世界都在努力解决新冠肺炎的问题，推迟了它们的上市时间。", "note_en": "Vizio is on the precipice of shipping its first OLED TVs, after having made a name for itself as the gadget-maker that produces LED TVs that offer a particularly strong balance between cost and performance. The company has also just begun rolling out its annual lineup of LED TVs.\n The OLED models will be pricy by most people&#39;s standards but slightly cheaper than entry-level sets from Sony or LG, which have been the only large-scale suppliers of OLED sets in the United States for a while now. Vizio plans to ship 55- and 65-inch models at $1,300 and $2,000.\n Vizio has a much larger market share in the US than LG or Sony (it&#39;s third behind Samsung and TCL), so it could become the most popular OLED TV maker if these sets are as successful as its LED lineup. Most reviewers agree that Vizio&#39;s LED TVs are neither the cheapest nor the absolute highest quality—but they might be an optimal middle ground for many enthusiasts. Vizio looks to be aiming for a similar strategy with OLED.\n These new OLEDs offer similar specs on paper to  LG&#39;s 2020 OLEDs: HDMI 2.1 ports, 4K at 120Hz, eARC, FreeSync, and (of course) HDR—most of the new perks you expect to see in flagship TVs in 2020. The Vizio OLED55-H1 and OLED65-H1 will both be available in the US this Fall.\n As for the LED lineup, availability starts now for the V-Series, M-Series, P-Series, and P-Series Quantum X lines. The company&#39;s 4K LEDs range in price from $230 all the way up to $3,000, with sizes going from 40 to 85 inches. The P-Series Quantum X is the top-of-the-line LED set that Vizio offers. Sets in that series claim up to 800 nits of full-screen brightness and 792 local dimming zones, as well as HDMI 2.1 ports that can support features like VRR, eARC, and 4K@120Hz—some of which are boons for the upcoming PlayStation 5 and Xbox Series X gaming consoles. Those sets range from a 55-inch model at $1,500 to an 85-inch at $3,000.\n The P-Series is what most enthusiasts are more likely to be interested in, given the pricing. While these TVs still offer 4K and all the latest HDR features, they have significantly fewer dimming zones—up to 240—and half the peak brightness, all at lower price points. Further down the line are the M-series sets, which drop 120Hz capability offer even fewer dimming zones.\n Local dimming zones are critically important for picture quality in LED TVs. That&#39;s because they help dark parts of the scene stay dark even as there are bright highlights elsewhere in view. This is not a concern in the same way for OLED TVs, as each pixel on an OLED TV can be turned on or completely off independently—not the case with LED.\n In an unusual move, Vizio has dubbed all of these sets its 2021 lineup due to the fact they were delayed getting to the market as the world grappled with COVID-19.", "posttime": "2020-07-02 05:51:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宣布,announces,led", "title": "Vizio宣布计划在今年秋天推出一款OLED电视，与LG、索尼展开竞争", "title_en": "Vizio announces plans to take on LG, Sony with an OLED TV this fall", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/vizio-announces-plans-to-take-on-lg-sony-with-an-oled-tv-this-fall/", "via": "", "real_tags": ["宣布", "announces", "led"]}, {"category": "", "categoryclass": "", "imagename": "3c1f209bc277601d3323de1656c5d937.jpg", "infoid": 1009380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "切达干酪的批发市场通常是一个温和的市场。但大流行期间反复无常的供需导致奶酪价格大幅波动，本月奶酪价格升至创纪录高位-就在几周前暴跌至近20年来的最低点。\n消费者正在购买更多的奶酪，尽管来自餐馆和学校的通常巨大的需求已经下降。奶农和预制食品公司向奶酪制造商供应配料或购买他们的产品，他们的业务已经中断。这些反补贴力量加在一起，推动了市场的上下交易。\n与石油、白银和生猪的价格一样，奶酪价格在一定程度上是由大宗商品市场的交易员制定的。每个交易日上午11点。芝加哥时间，芝加哥商品交易所(Chicago Mercantile Exchange)运营着一个10分钟的交易时段，买家和卖家-通常是大型乳制品合作社、奶酪生产商或其他活跃在该行业的公司-通过电子交易大约4万磅的一卡车年轻的温和切达干酪。\n6月8日，当芝加哥商品交易所(CME)一块40磅的切达奶酪(Cheddar)触及每磅2.585美元时，奶酪价格飙升至创纪录高位。切达奶酪是奶酪的基准，相当于石油市场上的一桶西德克萨斯中质原油(West Texas Intermediate)。到周二，Block Cheddar的价格跃升得更高，达到每磅2.81美元。\n这比4月中旬有了181%的扭亏为盈，当时同样一块奶酪的价格只有一美元一磅。\n威斯康星州麦迪逊的乳制品咨询公司Blimling and Associates的总裁菲尔·普鲁德(Phil Plourd)表示：“这是我们所见过的奶酪市场最不稳定的一次。”“如果有奶酪波动率指数(VIX)，它就会飙升，”他补充道，他指的是经常被描述为股市“恐惧指标”的波动率指数.。\n从马苏里拉奶酪到帕尔玛干酪，所有商品的大宗价格都比芝加哥商品交易所的布洛克切达干酪价格溢价或折扣。这些批发价渗透到消费者在杂货店和餐馆支付的价格。\n就像备受瞩目的市场一样，奶酪价格受到美国经济面临的不确定性的冲击，并受到政府行动的提振。\n经纪公司INTL FCStone驻芝加哥的乳制品经纪人戴夫·库尔扎夫斯基(Dave Kurzawski)表示：“在餐饮服务和零售需求方面，我们已经开始信任的很多动态都被抛在了窗外。”\n在3月和4月与大流行相关的恐惧高峰期，消费者争先恐后地前往杂货店囤积奶酪，以备即将到来的检疫之用。零售额比去年同期激增了70%以上。\n但这还不足以抵消关闭的餐厅和教育机构的需求下降，据业内估计，这两家机构加起来至少占大宗商品奶酪销量的一半。奶酪需求的下降溢出到了乳制品市场，导致牛奶价格暴跌。\n在餐饮业，“80%的销量消失了，”Sartori Cheese总裁杰夫·施瓦格(Jeff Schwager)说。\nSartori Cheese在威斯康星州经营着两家工厂，那里有600名员工生产和陈化硬奶酪，如帕尔玛干酪、Asiago奶酪和Fontina奶酪。有一段时间，零售需求和预制食品制造商的订单-他们在冷冻披萨、沙拉酱和其他产品中使用Sartori奶酪-帮助抵消了餐厅关闭造成的损失。然后在5月份，肉类加工业爆发冠状病毒，导致许多预制食品停产。\n类似的情况在其他地方也在上演。从3月下旬开始，随着需求的消失，奶酪库存开始增加。存储空间变得稀缺。在接下来的几周里，一些生产商开始以大幅折扣在芝加哥现货市场抛售奶酪。价格暴跌。\n威斯康星州奶酪制造商协会(Wisconsin Cheese Maker Association)的执行董事约翰·乌姆霍费尔(John Umhoefer)说，“我们有一段时间被切达干酪淹没了。”\n供过于求的情况并没有持续很长时间。今年4月，切达奶酪的价格为每磅1美元-上一次出现是在2003年-美国制造的奶酪价格突然远远低于外国竞争对手。据奶酪贸易商称，到当月中旬，出口开始回升，为国内制造商提供了新的需求来源，并有助于稳定价格。\n芝加哥经纪咨询公司莱斯乳业负责商业服务的副总裁布莱恩·弗莱彻(Brian Fletcher)说，“我们的价格是世界上最具竞争力的，每个人都来美国购买。”\n奶酪价格在4月触底后不久，农业部宣布计划花费30亿美元从农民手中购买食品，其中包括每月1亿美元购买各种乳制品。分析师说，这一声明帮助压低了价格。\n本月，随着全国各地的餐厅慢慢重新开张，供应奶酪的公司开始囤积奶酪，以确保充足的供应。如此之多，一些奶酪厂一直难以满足需求，因为在经济低迷最严重时期减产的奶农无法向他们提供足够的牛奶。\n根据芝加哥市场研究公司IRI的数据，购物者继续在商店购买比去年多20%到30%的奶酪。需求的回升再次推高了奶酪价格，比创纪录的水平低了约3%。\n乌姆霍费尔说，“订单在几天内就减少了，又在几天内又回来了。”“一下子就像坐过山车一样。”", "note_en": "The wholesale market for Cheddar is typically a mild one. But the vagaries of supply and demand during the pandemic have caused sharp swings in cheese prices, which rose to record highs this month — just weeks after plummeting to nearly 20-year lows.\n Consumers are buying way more cheese, even as the usually huge demand from restaurants and schools has fallen off. Dairy farmers and prepared-food companies, which supply ingredients to cheese makers or buy their products, have seen disruptions in their businesses. Together, these countervailing forces have fueled the up-and-down trading in the market.\n Like the price of oil, silver and hogs, cheese prices are set, in part, by traders in commodities markets. Each trading day at 11 a.m. Chicago time, the Chicago Mercantile Exchange operates a 10-minute session in which buyers and sellers — typically large dairy food cooperatives, cheese producers or other companies active in the industry — electronically trade roughly 40,000-pound truckloads of young, mild Cheddar.\n Cheese prices soared to a record high on June 8, when a 40-pound block of Cheddar — the benchmark for cheese, akin to a barrel of West Texas Intermediate in oil markets — touched $2.585 a pound on the CME. By Tuesday, the price of block Cheddar jumped even higher, to $2.81 a pound.\n That was a 181 percent turnaround from mid-April, when the same block of cheese would have cost only a dollar a pound.\n “It’s the most volatility that we’ve seen in the cheese market ever,” said Phil Plourd, president of Blimling and Associates, a dairy commodity consulting firm in Madison, Wis. “If there was a cheese VIX index, it would have been spiking,” he added, referring to the volatility index often described as the stock market’s “fear gauge.”\n  Bulk prices for everything from mozzarella to Parmesan are quoted at a premium or a discount to the CME’s block Cheddar price. And these wholesale prices filter through to the price consumers pay at groceries and restaurants.\n And much like higher-profile markets, cheese prices have been whipsawed by the uncertainty facing the American economy and bolstered by government actions.\n “A lot of the dynamics that we’ve come to trust with regard to food service and retail demand have been thrown out the window,” said Dave Kurzawski, a dairy broker in Chicago with brokerage firm INTL FCStone.\n During the peak of pandemic-related fears in March and April, consumers rushed to grocery stores to stockpile cheese for their coming quarantines. Retail sales surged more than 70 percent from a year earlier.\n But that wasn’t enough to offset the drop in demand from shuttered restaurants and educational institutions, which together account for at least half of the sales of bulk commodity cheese, according to industry estimates. The falloff in cheese demand spilled over into the dairy market, contributing to a plunge in milk prices.\n From the restaurant industry, “80 percent of the volume went away,” said Jeff Schwager, president of Sartori Cheese.\n  Sartori Cheese operates two plants in Wisconsin, where 600 employees produce and age hard cheeses such as Parmesan, Asiago and fontina. For a while, retail demand and orders from prepared-food makers — which use Sartori cheese in frozen pizza, salad dressings and other products — helped offset the loss from restaurant closings. Then in May, outbreaks of the coronavirus in the meatpacking industry halted production of many prepared foods.\n Similar situations were playing out elsewhere. Beginning in late March, as demand disappeared, cheese stockpiles began to grow. Storage space became scarce. In the following weeks, some producers began to dump their cheese on the Chicago spot market at steep discounts. Prices plummeted.\n “We got swamped with Cheddar for a time,” said John Umhoefer, the executive director of the Wisconsin Cheese Makers Association.\n The glut didn’t last long. In April, with Cheddar at $1 a pound — a level last seen in 2003 — cheese made in the United States was suddenly priced far below foreign competitors. By the middle of that month, exports began to pick up, according to cheese traders, providing domestic makers with a new source of demand, and helping to stabilize prices.\n “We were the most competitive price in the world, and everyone was coming to the U.S. to buy,” said Brian Fletcher, vice president of commercial services at Rice Dairy, a brokerage consulting firm in Chicago.\n  Not long after the price of cheese bottomed out in April, the Department of Agriculture announced plans to  spend $3 billion to buy food from farmers, including $100 million a month on a variety of dairy products. The announcement helped put a floor under prices, analysts said.\n This month, as restaurants around the country slowly reopened, companies that supply cheese began to stock up to ensure an adequate supply. So much so, some cheese factories have struggled to meet demand, as dairy farmers who cut production during the worst of the downturn were unable to supply them with enough milk.\n Shoppers continue to buy 20 to 30 percent more cheese at stores than they did last year, according to data from IRI, a market research firm in Chicago. The return of demand has again pushed cheese prices higher, where they hover roughly 3 percent below record levels.\n “The orders fell off literally in days, and they came back literally in days,” Mr. Umhoefer said. “It was all at once, very much a roller coaster.”", "posttime": "2020-07-02 05:49:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "价格,price,奶酪", "title": "奶酪的价格是怎么回事？", "title_en": "What’s Gotten into the Price of Cheese?", "transed": 1, "url": "https://www.nytimes.com/2020/06/22/business/cheese-cheddar-prices.html", "via": "", "real_tags": ["价格", "price", "奶酪"]}, {"category": "", "categoryclass": "", "imagename": "692cf55aa992fa500b120fb44bd00c7b.jpg", "infoid": 1009379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迪什网络已经完成了对Boost Mobile的14亿美元收购，Boost Mobile是Sprint的前子公司，转售预付费移动服务。\n在多年购买频谱但从未提供服务之后，Dish终于成为了一家移动服务提供商-尽管作为一家尚未运营自己网络的经销商。迪什能够收购Boost，作为司法部允许T-Mobile收购Sprint的合并协议的一部分。美国司法部要求T-Mobile和Sprint向Dish出售预付费业务以及频谱许可证和T-Mobile/Sprint合并网络的批发接入。预付费销售和批发接入旨在让Dish作为网络经销商运营无线业务，同时建立自己的5G网络，最终可能使其成为第四大无线提供商。\nDish在今天的一份新闻稿中表示，通过此次收购，Dish正式进入无线零售市场，为900多万客户提供服务。从明天开始，Dish表示其Boost子公司将提供$hrink-It！该计划15 GB起价45美元，在三次按时付款后每月降低5美元，在总共六次按时付款后再降低5美元。迪什说，Boost还将提供一项35美元的10 GB套餐，其中包括无限制的通话和短信。\n在T-Mobile和Sprint合并之前，Boost使用Sprint的网络提供无线服务。迪什说，在新的设置下，Boost已经开始并将继续用兼容设备激活客户进入新的T-Mobile网络，客户将在新的T-Mobile网络上收到更强的信号、更快的速度和更大的覆盖范围。Dish表示，这项交易还让Boost客户可以在某些地区漫游，直到Dish的5G网络建成。\n迪什表示，它正在继续选择其计划建设的5G网络的供应商，已经与富士通(Fujitsu)就无线电设备达成协议，与Altiostar和Mavenir就云本地Open Ran软件达成协议。迪什也是一家卫星电视提供商，拥有约900万视频订户，并且是Sling TV在线服务的所有者。\n美国司法部在促进资产剥离方面发挥了积极作用，今天在一份名为“司法部祝贺T-Mobile和Dish完成Boost资产剥离”的不同寻常的新闻稿中，对Dish/Boost交易表示赞赏。尽管T-Mobile和Sprint的合并将美国无线市场从四家主要运营商减少到三家，但司法部反垄断负责人马坎·德拉希姆(Makan Delrahim)表示，此次Boost抛售是实现司法部资产剥离的一个重要里程碑。\n正如我们之前写过的，政府强加的条件要求Dish在2023年6月之前覆盖美国70%的5G人口。这可能会让1亿美国人没有第四家航空公司的选择，如果Dish没有远远超过70%的要求的话。迪什在2012年也获得了联邦通信委员会(Federal Communications Commission)的批准，可以建设4G网络，但它从未这样做过。", "note_en": "Dish Network has completed a $1.4 billion acquisition of Boost Mobile, a former Sprint subsidiary that resells prepaid mobile service.\n After  years of buying up spectrum but never delivering service, Dish is finally a mobile provider—albeit as a reseller that doesn&#39;t yet operate its own network. Dish was able to buy Boost as part of the merger agreement in which the Department of Justice allowed T-Mobile to buy Sprint. The DOJ  required T-Mobile and Sprint to sell Dish the prepaid business as well as spectrum licenses and wholesale access to the combined T-Mobile/Sprint network. The prepaid sale and wholesale access are intended to let Dish operate a wireless business as a network reseller while it builds its own 5G network that could eventually make it the fourth major wireless provider.\n &#34;With this purchase, Dish officially enters the retail wireless market, serving more than nine million customers,&#34; Dish said in a  press release today. Starting tomorrow, Dish said its Boost subsidiary will offer a &#34;$hrink-It! plan, which starts at $45 for 15GB, reduces customers&#39; monthly rates by $5 after three on-time payments, and by an additional $5 after six total on-time payments.&#34; Boost will also &#34;offer a $35 10GB plan that includes unlimited talk and text,&#34; Dish said.\n Before the T-Mobile/Sprint merger, Boost used Sprint&#39;s network to provide wireless service. Under the new setup, &#34;Boost has begun, and will continue, to activate customers with a compatible device onto the new T-Mobile network, where customers will receive a stronger signal, faster speeds and more coverage,&#34; Dish said. T-Mobile  said the deal also gives Boost customers access to &#34;roaming in certain areas until Dish&#39;s 5G network is built out.&#34;\n Dish said it is &#34;continu[ing] vendor selection&#34; for the 5G network it plans to build, having already struck deals with &#34;Fujitsu for radio units and Altiostar and Mavenir for cloud-native, Open RAN software.&#34; Dish is also a satellite-TV provider with  about 9 million video subscribers, and it is the owner of the Sling TV online service.\n The DOJ, which took an active role in facilitating the divestitures, applauded the Dish/Boost deal today in an  unusual press release titled, &#34;Justice Department congratulates T-Mobile and Dish for closing the Boost divestiture.&#34; Although the T-Mobile/Sprint merger reduced the US wireless market from four major carriers to three, DOJ antitrust chief Makan Delrahim said the Boost selloff &#34;is a significant milestone in realizing the Department of Justice&#39;s remedy, which is designed to strengthen competition for high-quality 5G networks and benefit American consumers nationwide.&#34;\n As we&#39;ve  previously written, the government-imposed conditions require Dish to cover 70 percent of the US population with 5G by June 2023. That could leave 100 million Americans without the option of a fourth carrier if Dish doesn&#39;t go far beyond that 70 percent requirement. Dish also got approval from the Federal Communications Commission to  build a 4G network in 2012, but it never did so.", "posttime": "2020-07-02 05:31:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "无线,buys,dish", "title": "迪什从T-Mobile收购提振预付费业务，最终进入无线市场", "title_en": "Dish buys Boost prepaid biz from T-Mobile, finally enters wireless market", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/dish-is-finally-a-mobile-provider-but-doesnt-operate-its-own-network-yet/", "via": "", "real_tags": ["无线", "buys", "dish"]}, {"category": "", "categoryclass": "", "imagename": "f5b021321fe7c07763384f5a5191a185.jpg", "infoid": 1009378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "T-Mobile今天宣布，它已经完成了一项交易，剥离了Sprint的预付费业务，包括Boost和Virgin Mobile。这则新闻发现，由于这笔14亿美元的交易，迪什认真地进入了无线运营商的游戏。\n当然，整件事是T-Mobile竞标与Sprint合并的关键部分。对于那些担心这样的交易会降低市场竞争力的人来说，这是一个相对较小的让步，因为美国主要航空公司的数量从四家减少到了三家。据TechCrunch上个月报道，价值260亿美元的T-Mobile/Sprint交易终于在今年4月完成，已经导致数百人失业。\n这笔交易让Dish在预付费电话游戏中有了一个很好的开端，拥有超过900万客户，并在未来七年内接入T-Mobile的无线网络。它还找到了现任Dish的首席运营官约翰·斯维林加来领导新的子公司。哦，还有一个新的助推器标志，如下所示，\n看见?。它基本上是旧的Boost Mobile徽标，但中间有小的Dish无线符号，以真正向你展示谁是老板。迪什利用这个机会宣布了一项新的计划，以45美元的价格为用户提供15 GB的数据，并已经开始将拥有兼容设备的消费者切换到T-Mobile支持的新网络。", "note_en": "T-Mobile  today announced that it has closed a deal that divests  Sprint’s   pre-paid businesses, including Boost and Virgin Mobile. The news finds Dish  entering the wireless carrier game in earnest, courtesy of the $1.4 billion deal.\n The whole thing was, of course, a key part of T-Mobile’s bid to merge with Sprint. It was a relatively small concession to those worried that such a deal would decrease competitiveness in the market, as the number of major U.S. carriers shrunk from four down to three. The $26 billion  T-Mobile/Sprint   deal was finally completed April of this year, and has already resulted in  hundreds of lost jobs, as reported on last month by TechCrunch.\n  The deal gives Dish a nice head start in the pre-paid phone game, with north of nine million customers and access to T-Mobile’s wireless network for the next seven years. It also finds current Dish’s COO John Swieringa stepping in to lead the new subsidiary. Oh, and there’s a new Boost logo, too, seen below,\n   See? It’s basically the old  Boost Mobile   logo, but with the little Dish wireless symbols in the middle, to really show you who’s boss.  Dish used the opportunity to announce a new plan for Boost users with 15GB of data for $45, and has already begun switching consumers with compatible devices over to the new T-Mobile-backed network.", "posttime": "2020-07-02 05:31:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,结束,mobile", "title": "\nDISH结束提振手机购买，T-Mobile/Sprint合并后", "title_en": "\n\t\t\t\tDish closes Boost Mobile purchase, following T-Mobile/Sprint merger\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/01/dish-closes-boost-mobile-purchase-following-t-mobile-sprint-merger/", "via": "", "real_tags": ["手机", "结束", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "266534afd2860ee4071d5ef1902d9615.png", "infoid": 1009376, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的“PKG和存储协议”和随之而来的主机包集中服务已经合并，并出现在JuliaV1.5.0-RC1中。新的PKG将由特定于用户的UUID和其他信息组成的遥测发送到服务器，在那里它用于统计用户数和其他统计数据。我们的目标是回答“有多少Julia用户？”在筹款方面。当前协议是选择退出，这意味着除非用户更改配置，否则将收集这些统计数据.", "note_en": "New “Pkg & Storage protocols” and an accompanying centralized service to host packages have been merged and are present in Julia v1.5.0-rc1. The new Pkg sends telemetry consisting of a user-specific UUID and other information to the server, where it is used to count the number of users and other stats. The goal is to answer the question “How many Julia users are there?” in fundraising.  The current protocol is opt-out, meaning that these stats are collected unless a user changes a configuration ...", "posttime": "2020-07-02 05:11:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "遥测,telemetry,协议", "title": "Pkg.jl遥测应选择加入", "title_en": "Pkg.jl telemetry should be opt-in", "transed": 1, "url": "https://discourse.julialang.org/t/pkg-jl-telemetry-should-be-opt-in/42209", "via": "", "real_tags": ["遥测", "telemetry", "协议"]}]