[{"category": "", "categoryclass": "", "imagename": "c420e02bdc0d673dea44120e7c047ef2.jpeg", "infoid": 1068980, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近来自苹果供应链的多份报告表明，一款全新的、大幅升级的 iPhone SE 即将上市。据日经新闻报道，新款 iPhone SE 预计将于 2022 年初推出。该设备将采用与现有 iPhone 相同的 iPhone 8 风格设计——包括主页按钮。但新的 SE 将配备最新的 iPhone 片上系统 A15，预计将于今年秋季与苹果的新旗舰手机一同亮相。新款 iPhone SE 还将具有 5G 蜂窝活动功能，这是苹果去年年底首次在其高端 iPhone 中引入的功能。文章指定 iPhone SE 将使用高通的 X60 调制解调器。否则，这款中端手机（也恰好是苹果目前最便宜的）将与当前的 iPhone SE 非常相似，包括 4.7 英寸 LCD 屏幕。这与苹果的旗舰产品形成鲜明对比，后者拥有 OLED 屏幕，在大多数情况下都能提供更好的图像质量。但据报道，iPhone SE 的新生意味着苹果另一款手机型号的死亡：iPhone mini，它于去年作为 iPhone 12 系列的一部分推出。我们已经看到证据表明，与 Apple 的其他产品线相比，iPhone 12 mini 的销量不佳。苹果很有可能会在今年晚些时候销售 iPhone 13 mini，但日经新闻报道称，苹果可能不会在 2022 年的旗舰产品阵容中提供迷你机型。对于仍然愿意为最新最好的屏幕技术和相机付费的小手机爱好者来说，这是个坏消息。取而代之的是，苹果可能会在 2022 年推出超大尺寸 iPhone Pro Max 手机的“相对具有成本效益的版本”。但日经新闻的消息来源指出，2022 年手机的设计“尚未锁定”，因此苹果的计划仍有可能会发展。\n这份日经指数报告遵循了其他供应链来源的先前报道，以及知名苹果分析师郭明錤的预测，后者还声称具有类似 iPhone 8 设计的更快的 iPhone SE 即将推出。", "note_en": "Multiple recent reports from Apple&#39;s supply chain have indicated that a new, greatly upgraded iPhone SE is on the way.\n   According to Nikkei, the new iPhone SE is expected to launch in early 2022. The device will feature the same iPhone 8-style design as the existing iPhone—home button included. But the new SE will have what will be the most recent iPhone system-on-a-chip, the A15, which is expected to debut with Apple&#39;s new flagship phones this fall.\n The new iPhone SE will also feature 5G cellular activity, something Apple first brought to its high-end iPhones late last year. The article specifies that the iPhone SE will use Qualcomm&#39;s X60 modem.\n Otherwise, the midrange phone (which also happens to be Apple&#39;s cheapest at present) will closely resemble the current iPhone SE, including the 4.7-inch LCD screen. This is in contrast to Apple&#39;s flagships, which have OLED screens that offer better picture quality by most measures.\n    But new life for the iPhone SE reportedly means death for another of Apple&#39;s phone models: the iPhone mini, which was introduced as part of the iPhone 12 lineup just last year.\n We&#39;ve already seen evidence that  the iPhone 12 mini did not sell well, compared to the rest of Apple&#39;s lineup. In all likelihood, Apple will sell an iPhone 13 mini later this year, but the Nikkei report says Apple probably won&#39;t offer a mini model in the 2022 flagship lineup. That&#39;s bad news for lovers of small phones who are still willing to pay for the latest and greatest screen technology and cameras.\n Instead, Apple may include a &#34;relatively cost-effective version&#34; of the ultralarge iPhone Pro Max phone in 2022. But Nikkei&#39;s sources note that the designs for 2022&#39;s phones &#34;are not yet locked in,&#34; so Apple&#39;s plans could still evolve.\n This Nikkei report follows previous stories from other supply chain sources, as well as predictions from well-known Apple analyst Ming-Chi Kuo, that also claimed a faster iPhone SE with an iPhone 8-like design is on the way.", "posttime": "2021-07-22 22:48:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,5g,apple,iphone", "title": "报告：苹果将在 2022 年初推出配备 A15、5G 的新 iPhone SE", "title_en": "Report: Apple will introduce a new iPhone SE with A15, 5G in early 2022", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/report-apple-will-introduce-a-new-iphone-se-with-a15-5g-in-early-2022/", "via": "", "real_tags": ["苹果", "5g", "apple", "iphone"]}, {"category": "", "categoryclass": "", "imagename": "cd80f52f340d819d40cf81e64ae369d6.png", "infoid": 1068979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可穿戴电子产品，如手表和健身追踪器，代表了计算的下一个合乎逻辑的步骤。他们激发了人们对柔性电子产品开发的兴趣，这可能会扩大该类别，包括服装和背包等产品。然而，灵活的电子设备遇到了一个问题：我们的处理硬件一点也不灵活。解决这一限制的大多数努力都涉及将处理器拆分为一组较小的单元，用柔性布线将它们连接起来，然后将所有组件嵌入到柔性聚合物中。在某种程度上，这个过程是对早期计算的倒退，当时浮点单元可能驻留在单独的芯片上。但是，半导体公司 Arm 的一个团队现在已经设法使用柔性硅实现了该公司较小的嵌入式设计之一。该设计工作并执行您期望的所有指令，但它也说明了我们必须做出的妥协才能生产出真正灵活的电子产品。柔性电子产品背后的基本思想非常简单：从柔性基板（如塑料或纸）开始，并将其用作制造柔性半导体薄层的基板。各种半导体都符合要求，从原子级薄材料到半导体聚合物。但是，就其在逻辑门制造中的使用而言，大多数选项都不是成熟的技术，因此使用它们涉及两层实验——包括材料本身和它们的灵活性。非晶硅是一种有点熟悉的选择。用于制造现有处理器的硅是晶体，这意味着它是有序的原子阵列形式。非晶硅不是，因此它很灵活。此外，我们知道如何使用非晶硅，因为我们将其用于太阳能电池板和 LCD 等设备。它也很便宜，部分原因是它可以通过比晶体硅更简单的技术加工成晶体管。不利的一面是非晶硅在性能、功率效率和电路密度等几个方面都存在不足。也就是说，柔性电子产品的许多潜在用途对性能的要求并不高。为了与最低性能要求保持一致，Arm 团队与 PragmatIC Semiconductor 合作实施了一个名为“PlasticArm”的 Arm Cortex M0+ 处理器版本。 M0+ 是一个 32 位处理器，可以执行 Arm “thumb”指令的一个简化子集；它针对小尺寸和低功耗进行了优化，通常用作嵌入式处理器。\n即使按照非常简化的处理器的标准，PlasticArm 也有一些使其与众不同的独特功能。一方面，处理器用来存储它们正在处理的数据的一小部分内存（称为“寄存器”）通常位于处理器本身中，因为它会降低性能以进入外部 RAM 以读取该内存。为了简化PlasticArm 的处理器，CPU 的寄存器位于RAM 的保留部分，而系统仅使用128 字节的RAM。在 PlasticArm 上运行的系统和应用程序保存在一个 456 字节的 ROM 芯片中，该芯片也与处理硬件分开。目前，ROM 无法更新（它是只读的），但团队希望在下一次迭代中进行更改。所有的关键部件——处理器、RAM、ROM 和互连——都是使用非晶硅制成的，并在柔性聚合物上制造。该系统还具有用于片外通信的引脚。总的来说，性能并不好。其最大时钟速度为 29 kHz，在该速度下消耗约 20 毫瓦。这听起来可能很小，但在标准硅上实现的 M0+ 只需要 10 多微瓦即可达到兆赫。从积极的方面来说，它有超过 18,000 个单独的门，比之前描述的任何灵活处理器都高出一个数量级。它还成功地执行了其 ROM 中的所有软件，尽管研究人员只是进行了测试，并未费心使用处理器的独特功能——他们从未真正弯曲过它。该团队已经在计划下一步，主要涉及降低功耗。鉴于处理器的性能与标准芯片的性能之间存在差距，这种降低是适当的。研究人员还希望将门数提高到 100,000 多个，尽管他们认为这种方法最终会在低于 100 万个门的地方达到最大值。描述处理器的论文最后通过推测“万物互联”的潜力来结束，在这种情况下，服装和食品包装等事物可以有一个灵活的处理器。该段落对于这种扩展会给我们带来什么含糊不清，只是暗示它将“解开创新”。也就是说，许多研究人员正在致力于将传感器和小型电源嵌入衣服等物品中，以监测从活动到环境暴露的所有内容。其中一些用途将需要一个系统来管理他们的行为和数据，而灵活的处理器将符合要求。", "note_en": "Wearable electronics, like watches and fitness trackers, represent the next logical step in computing. They&#39;ve sparked an interest in the development of flexible electronics, which could expand the category to include products like clothing and backpacks.\n Flexible electronics run into a problem, however: Our processing hardware is anything but flexible. Most efforts to deal with that limitation have involved splitting up processors into a collection of smaller units, linking them with flexible wiring, and then embedding all the components in a flexible polymer. To an extent, the process is a throwback to the early days of computing, when a floating-point unit might reside on a separate chip.\n But a group within the semiconductor company Arm has now managed to implement one of the company&#39;s smaller embedded designs using flexible silicon. The design works and executes all the instructions you&#39;d expect from it, but it also illustrates the compromises we have to make to produce truly flexible electronics.\n  The basic idea behind flexible electronics is remarkably simple: start with a flexible substrate (like plastic or paper) and use it as a substrate for fabricating a thin layer of a flexible semiconductor. A variety of semiconductors fit the bill, ranging from atomically thin materials to semiconducting polymers. But most of the options aren&#39;t mature technologies with respect to their use in the fabrication of logic gates, so working with them involves two layers of experimentation—both with the materials themselves and with their flexibility.\n    Amorphous silicon is a somewhat familiar option. The silicon used in the manufacture of existing processors is crystalline, meaning it&#39;s in the form of an ordered array of atoms. Amorphous silicon isn&#39;t, and it&#39;s flexible as a result. Plus, we know how to work with amorphous silicon, since we use it for things like solar panels and LCDs. It&#39;s also inexpensive, partly because it can be processed into transistors through simpler techniques than needed for crystalline silicon.\n The downside is that amorphous silicon comes up short in several measures, including performance, power efficiency, and circuit density. That said, many of the potential uses for flexible electronics don&#39;t require much in the way of performance.\n  In keeping with the idea of minimal performance requirements, the team at Arm worked with PragmatIC Semiconductor to implement a version of Arm&#39;s Cortex M0+ processor termed &#34;PlasticArm.&#34; The M0+ is a 32-bit processor that can execute a simplified subset of the Arm &#34;thumb&#34; instructions; it&#39;s optimized for small sizes and low power use, and it is generally used as an embedded processor.\n Even by the standards of a very simplified processor, PlasticArm had some distinct features that set it apart. For one thing, the small bits of memory that processors use to store the data they&#39;re working on (called &#34;registers&#34;) are normally located in the processor itself because it kills performance to go to external RAM in order to read this memory. To simplify the PlasticArm&#39;s processor, the CPU&#39;s registers are located in a reserve section of the RAM—and the system was made with only 128 bytes of RAM.\n    The system and applications that run on PlasticArm are held in a 456 byte ROM chip that is also separated from the processing hardware. Right now, the ROM can&#39;t be updated (it&#39;s read-only), but the team hopes to change that in the next iteration.\n All the key pieces—the processor, the RAM, the ROM, and the interconnects—were made using amorphous silicon and fabricated on a flexible polymer. The system also has pins for off-chip communications.\n Overall, the performance isn&#39;t good. Its maximum clock speed is a stately 29 kilohertz, and it consumes about 20 milliwatts at that speed. That may sound like very little, but an M0+ implemented on standard silicon only needs a bit over 10 microwatts to hit a megahertz. On the positive side, it has over 18,000 individual gates, which is over an order of magnitude higher than any previously described flexible processor. It also successfully executed all the software in its ROM, although the researchers only did tests without bothering to use the processor&#39;s distinctive feature—they never actually flexed it.\n  The team is already planning its next steps, which mainly involve reducing power consumption. That reduction is appropriate given the gap between the performance of the processor and that of standard silicon. The researchers also hope to get the gate count up to over 100,000, though they think the approach will end up maxing out somewhere below a million gates.\n The paper describing the processor finishes by speculating about the potential of an &#34;Internet of everything,&#34; where things like clothing and food packaging can have a flexible processor slapped on them. The paragraph is vague about what this expansion will get us, simply suggesting that it would &#34;unravel innovations.&#34;\n That said, plenty of researchers are working on embedding sensors and small power sources into things like clothing to monitor everything from activity to environmental exposures. Some of these uses will need a system to manage their behavior and data, and a flexible processor would fit the bill.", "posttime": "2021-07-22 22:48:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "弯曲,bendable,处理器", "title": "PlasticArm 是一款 32 位可弯曲处理器", "title_en": "PlasticArm is a 32-bit bendable processor", "transed": 1, "url": "https://arstechnica.com/science/2021/07/researchers-build-a-bendable-arm-processor-dont-bother-to-bend-it/", "via": "", "real_tags": ["弯曲", "bendable", "处理器"]}, {"category": "", "categoryclass": "", "imagename": "5fe8d482b2ed4dba79b22db9145f5b6e.jpg", "infoid": 1068978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，谷歌宣布大幅扩展其提前警告用户拥挤的公共交通的能力。该功能最初于 2019 年 6 月推出，覆盖全球大约 200 个城市，使用类似于 Waze 的用户报告数据来发现和预测过度拥挤的火车和公共汽车。根据今天的公告，谷歌正在将最初的 200 个城市扩展到（最终）100 个国家/地区的 10,000 多个公交机构。不出所料，谷歌地图的公共交通预测不仅仅依赖于用户报告的直接数据。他们利用在该数据上训练的 AI 模型。 “我们将世界一流的匿名技术和差异隐私技术应用于位置历史数据，以确保您的数据保持私密和安全，”该公告宣称——尽管我们必须指出，对位置数据进行匿名化的尝试经常失败。谷歌表示，其公共交通人群报告让用户知道他们的公交线路是否可能“有很多空位，满载，或者在任何地方或两者之间”，让用户就是否“跳上车”做出更明智的决定或者等另一趟火车。”在纽约和悉尼，该计划正在试行更深入的信息，提供“直达公交车级别”的实时拥挤信息。今天的公告还指出，在整个美国，早高峰之后和晚高峰之前的公共交通不那么拥挤——信息不太可能让经常使用公共交通的人感到惊讶。地图还升级了其时间轴功能，以包含公共交通出行历史记录，让用户知道他们通过公共交通、步行、驾车等方式花费了多少时间以及旅行的距离。如果您不喜欢该功能——或者不信任 Google 的“世界级匿名技术”——您可以完全禁用 Android 设备的位置记录。 （禁用位置记录将对拼车、天气和地图应用程序等产生重大影响，并且可能导致某些应用程序完全无法使用。）", "note_en": "Today, Google  announced a major expansion of its ability to warn users of crowded mass transit ahead of time. The feature originally launched in June 2019 and covered roughly 200 cities globally, using user-reported data similar to  Waze to discover and predict overcrowded trains and buses. Google is expanding that 200-city initial rollout to (eventually) over 10,000 transit agencies in 100 countries, according to today&#39;s announcement.\n  Unsurprisingly, Google Maps&#39; mass transit predictions don&#39;t just rely on direct user-reported data. They utilize AI models  trained on that data. &#34;We apply world-class anonymization technology and  differential privacy techniques to Location History Data to make sure your data remains private and secure,&#34; the announcement declares—although we must point out that attempts to anonymize location data frequently  fail.\n    Google says its mass transit crowd reporting lets users know whether their transit line is likely to &#34;have lots of open seats, hit full capacity, or be anywhere or in between,&#34; letting users make a more informed decision about whether to &#34;hop on board or wait for another train.&#34; In New York and Sydney, the program is piloting even deeper information, offering live crowdedness information &#34;right down to the transit car level.&#34; Today&#39;s announcement also notes that across the USA, mass transit is less crowded after morning rush hour and prior to evening rush hour—information unlikely to surprise anyone who uses mass transit regularly.\n    Maps is also upgrading its Timeline feature to include mass transit travel history, letting users know how much time they&#39;ve spent and distance they&#39;ve traveled via mass transit, walking, driving, and more. If you don&#39;t like that feature—or don&#39;t trust Google&#39;s &#34;world-class anonymization technology&#34;—you can  disable your Android device&#39;s Location History entirely. (Disabling Location History will have a significant impact on ride-share, weather, and mapping apps, among others—and it may render some entirely unusable.)", "posttime": "2021-07-22 22:48:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,公共交通,maps", "title": "谷歌地图大规模扩展其公共交通人群报告服务", "title_en": "Google Maps massively expands its mass transit crowd-reporting service", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/google-maps-massively-expands-its-mass-transit-crowd-reporting-service/", "via": "", "real_tags": ["google", "谷歌", "公共交通", "maps"]}, {"category": "", "categoryclass": "", "imagename": "ad6fb4907f8d5ae665c035673fcf1294.jpeg", "infoid": 1068977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名前 eBay 安全官员承认他在网络跟踪阴谋中的角色，他要求从宽量刑，同时将他的行为部分归咎于 eBay 的“饮酒文化”导致他酗酒。 “eBay 校园内有一家酒吧，下午 3:00 开始营业，喝酒是文化的一部分，整个办公空间里到处都是酒精，早上与同事一起喝酒是典型的做法，”一份量刑备忘录56岁的被告菲利普库克昨天说。它已提交给美国马萨诸塞州地区法院。库克是 eBay 全球安全团队的安全运营高级经理，在骚扰一对经营新闻网站的夫妇时，他的年薪为 185,000 美元。为了回应 eBay 高管不喜欢的新闻报道，骚扰行为包括向这对夫妇位于马萨诸塞州内蒂克的家中发送威胁信息和运送活蟑螂、葬礼花圈和血腥猪面具。库克被 eBay 提拔为安全运营总监，并于 2020 年 6 月加薪至 205,000 美元，距离网络跟踪活动开始大约 10 个月，就在它公开之前。除了刑事指控外，库克还是今天骚扰受害者提起的诉讼的被告之一。 Natick 的 Ina 和 David Steiner 负责运营新闻网站 EcommerceBytes，他们在同一美国地方法院对 eBay 和涉嫌网络跟踪的肇事者提起诉讼。被告包括 eBay 本身、eBay 前 CEO Devin Wenig；前 eBay 首席通讯官 Steven Wymer；以及 Progressive FORCE Con​​cepts (PFC)，这是一家安全公司，在库克成为 eBay 全职员工之前，他曾聘请库克担任承包商。诉讼称：“eBay ......参与了一项协调行动，以恐吓、威胁杀害、折磨、恐吓、跟踪和压制 Steiners，以扼杀他们在 eBay 上的报道。赋予其他被告全权以任何必要的方式终止对斯坦纳的报告，被告 Wymer 表示“......我想看到骨灰。只要需要。无论需要什么。”被告 Wymer 向被告承诺，如果计划失败，他将“接受管理任何不良后果”，并进一步指示，“我们需要阻止她。”随后发生的所有可怕、恶毒和令人作呕的行为都是 eBay 和 PFC 的员工在其受雇范围内在 eBay 和 PFC 的授权下并为其利益行事时所犯的。去年，其他 eBay 员工被捕并受到指控时，Wenig 和 Wymer 并未受到刑事指控。\n从在线恐吓活动开始，被告使用假冒的 eBay 卖家的 Twitter 句柄嘲弄 Ina Steiner，并直接威胁她停止在 eBay 上的报道。在线攻击继续升级为威胁和令人不安的包裹递送，其中包括活蜘蛛、蟑螂、血腥猪面具、葬礼花圈，以及直接寄给大卫施泰纳的一本名为“悲伤日记：失去配偶的幸存”的书。这些消息和交付通常伴随着不祥的 Twitter 消息，例如“我现在有你的注意力吗，混蛋？”令人震惊的图形和粗俗信息，例如“你是病态的 motha 混蛋……每个人都会知道！你他妈的混蛋婊子！”与以大卫·施泰纳的名义发送到施泰纳邻居家的色情和“骗子：勉强合法”杂志在内的嘲讽电子邮件和递送相结合，以诽谤施泰纳并试图使他们蒙羞并玷污他们在社区中的声誉。一些共谋者从加利福尼亚前往马萨诸塞州，除其他外，“在一辆黑色面包车和其他租赁车辆中威胁地跟踪和尾随施泰纳，反复盘旋街区，跟踪他们的一举一动，并在大卫施泰纳离开住所时跟随. 被告甚至试图闯入施泰纳车库，以便在他们的车辆上安装 GPS 跟踪设备，“诉讼称。 eBay 去年发表声明称，“内部调查发现，虽然 Wenig 先生的通讯不恰当，但没有证据表明他事先知道或授权了后来针对博主及其丈夫的行动。” eBay 今天向 Ars 提供了一份声明，称：“这些前雇员的不当行为是错误的，我们将采取公平和适当的措施来解决 Steiners 所经历的问题。2019 年的事件本不应该发生，而且作为eBay 向 Steiners 表示，我们对他们所承受的一切感到非常抱歉。正如美国检察官办公室在此事首次曝光时所指出的那样，eBay 全力配合政府的调查，并指出“eBay 非常配合调查，帮助州和联邦当局查明发生了什么事并收集犯罪证据。&#39;”库克的量刑备忘录引用他妻子的话说，“eBay 的饮酒文化”加剧了酗酒问题，而在库克从职业生涯中退休后，这一问题变得更糟。圣克拉拉警察局的队长。库克从警察工作退休大约一年后就去 Progressive FORCE Con​​cepts 工作，“虽然这份工作提供了一个去处、一个目标和新同事，但并没有解决他的酗酒问题。” 2019 年 4 月在 eBay 找到一份全职工作后，库克“继续酗酒，尤其是和他的朋友和同事一起喝酒。”那是网络跟踪活动开始前几个月。 “当他以员工身份回到 eBay 时，菲尔的酗酒问题变得更糟，”他的妻子在备忘录中说。 “我记得有一次菲尔直到第二天凌晨 4 点左右才下班回家。当我问他去过哪里时，他说他和他的同事关掉了一家酒吧，在他的车里睡了几个小时，直到他开车回家感觉很安全。我知道菲尔和他的同事在工作时有一个酒柜，但直到后来我才知道他们早上喝了酒。”库克的文件要求法院判处“在法院认为有必要的任何时期内居家监禁、12 个月监督释放、200 美元的特别评估、不归还（因为没有人要求）和罚款”。\n由于这次起诉，库克先生已经受到了广泛的惩罚......他失去了一份他喜欢的工作，对他给家人带来的失望感到沮丧，并在他的社区——一个他光荣而忠实地服务的社区中受到羞辱。作为一名警察] 30 年。他已经为自己的不当行为承担全部责任，对自己的错误选择非常懊悔，并想尽一切努力让自己的生活变得正确。自从承担责任以来，他解决了药物滥用问题，保持清醒，并成功地接受了培训，以便在加利福尼亚的药物滥用计划中为其他药物滥用者及其朋友和家人提供便利。该文件淡化了库克在该阴谋中的作用，称他没有前往马萨诸塞州，并警告同事注意该计划中最糟糕的部分。该文件称：虽然库克先生加​​入了参与“白骑士战略”的计划，以发送骚扰性和匿名的 Twitter 消息来软化受害者以寻求 eBay 安全团队的帮助，并至少查看了一些与该计划有关的消息草稿，他没有亲自参与骚扰同一个受害者的两个或多个单独的“实例”。他的参与被更恰当地描述为单一的“行为过程”或“由 2 个或更多行为组成的行为模式，证明活动的目的模式的连续性。”库克于 2020 年 10 月承认一项串谋进行网络跟踪的罪名和一项串谋篡改证人的罪名。每项指控最高可判处五年监禁、三年监督释放、最高 250,000 美元的罚款和赔偿。另外四名前 eBay 安全员工于 2020 年 10 月认罪。他们是前 eBay 全球安全团队特别运营高级经理 Brian Gilbert； Stephanie Stockwell，前 eBay 全球情报中心经理； Stephanie Popp，eBay 前全球情报高级经理；以及前 eBay 承包商、eBay Global Intelligence 的情报分析师 Veronica Zea。与库克一样，所有四人都承认串谋进行网络跟踪和串谋篡改证人的指控，正在等待宣判。虽然骚扰案只涉及 eBay，但量刑备忘录指出 Facebook 也有类似的饮酒文化。 “我不知道 eBay 和 Facebook 的饮酒文化，”库克的妻子在备忘录中引用的一份声明中说。 “首先，他是 eBay 的一名承包商，该公司在校园里有一家酒吧，他会在那里与同事一起喝酒。他们经常会离开那家酒吧，去当地的酒吧/餐厅继续喝酒，直到深夜。然后他开始了在 Facebook 工作，他们允许白天喝酒，而且通常会提供免费酒水。”", "note_en": "A former eBay security official who pleaded guilty for his role in a cyberstalking conspiracy has asked for leniency in sentencing while blaming his actions in part on a &#34;drinking culture&#34; at eBay that contributed to his alcoholism.\n &#34;eBay had a bar on campus that opened at 3:00 p.m., and drinking was part of the culture, with alcohol present throughout the office space where it was typical to take morning shots of alcohol with co-workers,&#34; a  sentencing memorandum for 56-year-old defendant Philip Cooke said yesterday. It was filed in US District Court for the District of Massachusetts.\n Cooke was senior manager of security operations for eBay&#39;s Global Security Team, making an annual salary of $185,000 when he played a role in the  harassment of a couple that operated a news website. The harassment—in response to news coverage that eBay executives did not like—involved sending threatening messages and deliveries of live cockroaches, a funeral wreath, and a bloody pig mask to the couple&#39;s home in Natick, Massachusetts. Cooke was promoted by eBay to director of security operations and given a raise to $205,000 in June 2020, about 10 months after the cyberstalking campaign began and just before it became public.\n  In addition to criminal charges, Cooke is one of the defendants in a lawsuit filed by the harassment victims today. Ina and David Steiner of Natick, who run news website  EcommerceBytes, filed the  complaint against eBay and the alleged perpetrators of the cyberstalking in the same US District Court. Defendants include eBay itself, former eBay CEO Devin Wenig; former eBay Chief Communications Officer Steven Wymer; and Progressive F.O.R.C.E Concepts (PFC), a security firm that employed Cooke as a contractor before he became a full-time eBay employee.\n &#34;eBay... engaged in a coordinated effort to intimidate, threaten to kill, torture, terrorize, stalk and silence the Steiners, in order to stifle their reporting on eBay,&#34; the lawsuit alleged.\n  provided the other Defendants with carte blanche authority to terminate the reporting of the Steiners by whatever means necessary, with Defendant Wymer expressing &#34;... I want to see ashes. As long as it takes. Whatever it takes.&#34; Defendant Wymer promised the defendants he would &#34;embrace managing any bad fallout&#34; if the plan went south, further directing, &#34;We need to STOP her.&#34; All of the horrific, vicious and sickening conduct that followed was committed by employees of eBay and PFC, while acting in the scope of their employment under the authority of and for the benefit of eBay and PFC.\n Wenig and Wymer were not hit with criminal charges when other eBay employees were arrested and charged last year.\n  Starting with an online intimidation campaign, the defendants taunted Ina Steiner using a phony Twitter handle pretending to be an eBay seller, and directly threatened her to stop reporting on eBay. The online attacks continued to escalate into threatening and disturbing package deliveries, which included live spiders, cockroaches, a bloody pig mask, a funeral wreath, and a book entitled &#34;Grief Diaries: Surviving Loss of a Spouse&#34; sent directly to David Steiner. These messages and deliveries often were accompanied by ominous simultaneous Twitter messages such as &#34;do I have your attention now, cunt?&#34; Shockingly graphic and vulgar messages, such as &#34;U are sick motha fuckers…and every one will kno! U fuckin cunt ass bitch!&#34; paired with taunting emails and deliveries, including pornography and &#34;Hustler: Barely Legal&#34; magazines sent to the Steiner&#39;s neighbors&#39; home in David Steiner&#39;s name, to defame the Steiners and attempt to disgrace them and tarnish their reputation within their community.\n Some of the conspirators traveled from California to Massachusetts and, among other things, &#34;menacingly stalked and tailed the Steiners in a black van and other rental vehicles, repeatedly circling the block, tracking their every move, and following David Steiner when he left the residence. The defendants even went as far as to attempt to break into the Steiner garage in order to install a GPS tracking device on their vehicle,&#34; the lawsuit said.\n eBay issued a  statement last year that said an &#34;internal investigation found that, while Mr. Wenig&#39;s communications were inappropriate, there was no evidence that he knew in advance about or authorized the actions that were later directed toward the blogger and her husband.&#34;\n eBay provided a statement to Ars today, saying, &#34;The misconduct of these former employees was wrong, and we will do what is fair and appropriate to try to address what the Steiners went through. The events from 2019 should never have happened, and as eBay expressed to the Steiners, we are very sorry for what they endured. As noted by the US Attorney&#39;s Office when this matter first came to light, eBay cooperated fully with the government&#39;s investigation, noting that &#39;eBay was extremely cooperative with the investigation in helping state and federal authorities figure out what had happened and collect evidence of the crime.&#39;&#34;\n  Cooke&#39;s sentencing memorandum quotes his wife as saying that a &#34;drinking culture at eBay&#34; exacerbated an alcohol abuse problem that got worse after Cooke retired from a career as a captain in the Santa Clara Police Department. Cooke went to work for Progressive F.O.R.C.E Concepts about a year after retiring from police work, and &#34;while the job provided a place to go, a purpose, and new colleagues, it did not resolve his drinking problem.&#34; After taking a full-time job at eBay in April 2019, Cooke &#34;continued to drink heavily, especially with his friends and colleagues.&#34; That was a few months before the cyberstalking campaign began.\n &#34;When he returned to eBay as an employee, Phil&#39;s drinking problem became even worse,&#34; his wife said in the memorandum. &#34;I remember one time Phil didn&#39;t come home from work until around 4am the following day. When I asked him where he had been, he said he closed down a bar with his coworkers and slept in his car for a few hours until he felt safe to drive home. I knew Phil and his coworkers had a liquor cabinet at work, but what I didn&#39;t know until later was they were taking shots of alcohol in the morning.&#34;\n Cooke&#39;s filing asked the court for a sentence of &#34;home confinement for whatever period the Court believes is necessary, 12 months supervised release, a $200 special assessment, no restitution (as none has been requested), and no fine.&#34;\n  As a result of this prosecution, Mr. Cooke has endured extensive punishment already... He lost a job he enjoyed, was devastated by the disappointment he caused his family, and was humiliated in his community—a community he honorably and faithfully served [as a police officer] for 30 years. He has accepted full responsibility for his misconduct, is very remorseful for his bad choices, and wants to do whatever it takes to put his life right. Since accepting responsibility, he has addressed his substance abuse issue, remained sober, and successfully trained to facilitate meetings in a substance abuse program in California for both other substance abusers and also for their friends and families.\n The document downplays Cooke&#39;s role in the conspiracy, saying that he didn&#39;t travel to Massachusetts and that he warned fellow employees against some of the worst parts of the plan. The filing said:\n While Mr. Cooke joined the plan to engage in a &#34;white knight strategy&#34; to send harassing and anonymous Twitter messages to soften up the victims for eBay&#39;s security team&#39;s assistance, and viewed at least some draft messages in connection with that scheme, he was not personally involved in two or more separate &#34;instances&#34; of harassing the same victim. His involvement is more fairly described as a single &#34;course of conduct&#34; or &#34;a pattern of conduct comprised of 2 or more acts evidencing a continuity of purpose pattern of activity.&#34;\n  Cooke pleaded guilty in October 2020 to one count of conspiracy to commit cyberstalking and one count of conspiracy to commit witness tampering. Each charge carries a maximum sentence of five years in prison, three years of supervised release, a fine of up to $250,000, and restitution.\n Four other former eBay security employees  pleaded guilty in  October 2020. They are Brian Gilbert, former senior manager of special operations for eBay&#39;s Global Security Team; Stephanie Stockwell, former manager of eBay&#39;s Global Intelligence Center; Stephanie Popp, eBay&#39;s former senior manager of Global Intelligence; and Veronica Zea, a former eBay contractor who was an intelligence analyst in eBay Global Intelligence. Like Cooke, all four pleaded guilty to charges of conspiracy to commit cyberstalking and conspiracy to tamper with witnesses and are waiting to be sentenced.\n While the harassment case involves only eBay, the sentencing memorandum noted a similar drinking culture at Facebook.\n &#34;I did not know about the drinking culture at eBay and Facebook,&#34; Cooke&#39;s wife said in a statement quoted in the memorandum. &#34;First, he worked as a contractor for eBay which has a bar on campus where he would drink with his coworkers. They would often leave that bar and go over to a local bar/restaurant and continue drinking until late at night. Then he started working at Facebook where they allowed drinking during the day and would often have free alcohol available.&#34;", "posttime": "2021-07-22 22:48:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "网站,ebay", "title": "诉讼：eBay 试图“恐吓、跟踪和沉默”经营新闻网站的夫妇", "title_en": "Lawsuit: eBay tried to “terrorize, stalk, and silence” couple that ran news site", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/07/lawsuit-ebay-tried-to-terrorize-stalk-and-silence-couple-that-ran-news-site/", "via": "", "real_tags": ["网站", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "af042d71f64bafa8d565e41c77460d57.jpg", "infoid": 1068976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "事件视界望远镜 (EHT) 合作在 2019 年通过捕获星系中心黑洞的第一张直接图像成为头条新闻。现在，EHT 又带来了另一个激动人心的突破：半人马座 A 射电星系的“暗心”图像。根据一项新的研究，这些图像使 EHT 能够精确定位星系中心超大质量黑洞的位置。论文发表在《自然天文学》杂志上。这些图像还捕捉到了从黑洞发出的强大喷流的诞生。喷流的不同寻常的特性可以帮助天文学家回答一些关于这种喷流最初是如何产生的棘手问题。 “这使我们第一次看到和研究了比光在一天中传播的距离还小的尺度的河外射电喷流，”共同作者、波恩和拉德堡德大学马克斯普朗克射电天文学研究所的天文学家迈克尔詹森说。奈梅亨。 “我们亲眼目睹了超大质量黑洞发射的巨大喷流是如何诞生的。”半人马座 A（又名 NGC 5128）是夜空中最大、最亮的天体之一，因此特别受业余天文爱好者的欢迎，尽管它只能在南半球和北纬低纬度地区看到。该星系位于半人马座，由詹姆斯·邓洛普于 1826 年发现。 1847 年，约翰赫歇尔注意到它的奇特形状——从地球上看它看起来是椭圆形的，上面叠加着一条尘埃带。 1949年，天文学家确定半人马座A是银河系外第一个已知的无线电波源。这是因为该星系拥有一个活跃的星系核，它会产生强大的喷流，发射 X 射线和无线电波长的光，其距离远大于星系本身的大小。从那时起，半人马座 A 在无线电、光学、X 射线和伽马射线方面得到了广泛的研究。正如 Ars 的 John Timmer 在 2019 年报道的那样，EHT 不是传统意义上的望远镜。相反，它是一组散布在全球各地的望远镜。 EHT 是通过干涉测量法创建的，它使用在不同位置捕获的光来构建分辨率类似于最远位置大小的望远镜的分辨率的图像。干涉测量法已用于像 ALMA（阿塔卡马大型毫米/亚毫米阵列）这样的设施，其中望远镜可以分布在 16 公里的沙漠中。理论上，阵列的大小没有上限，但要确定哪些光子同时起源于源，您需要每个站点的非常精确的位置和时间信息。而且你仍然需要收集足够的光子才能看到任何东西。因此，许多地点都安装了原子钟，并且随着时间的推移建立了精确的 GPS 测量结果。对于 EHT，ALMA 的大收集面积，结合选择超大质量黑洞非常明亮的波长，确保了足够的光子。最终的结果是一台望远镜可以读取纽约市洛杉矶硬币上的年份——假设硬币在无线电波长下发光。 EHT 公布了 2019 年有史以来第一张在椭圆星系中心拍摄的黑洞直接图像，该黑洞位于约 5500 万光年外的室女座星座：梅西耶 87 (M87)。仅仅在一代人之前，这张图像是不可能的，它是通过技术突破、创新的新算法以及（当然）连接几个世界上最好的无线电天文台而实现的。图像证实M87中心的物体确实是一个黑洞。难怪科学杂志将这张图片命名为年度突破。\n仍然缺乏的是深入了解 M87 产生的强大双喷气机背后的过程。黑洞边缘附近的大多数物质——被黑洞强大的引力吸引——落入其中，但一些粒子可以逃逸，并以接近光速的速度被那些巨大的喷流吹出。但是天文学家对于这些喷流是如何加速到如此高的速度还没有达成共识。也许这个机制是一个吸积盘，它产生一个磁场，将一些物质汇入喷射流中。或者也许是黑洞旋转时的旋转能量是罪魁祸首。或者机制可以是两者的结合。今年早些时候，我们报道了 EHT 合作的另一项突破性成果：M87 的新图像，这一次展示了它在偏振光下的外观。首次测量这种极化的能力——黑洞边缘磁场的特征——产生了对黑洞如何吞噬物质并从它们的核心发射强大射流的新见解。观察结果表明，黑洞边缘的磁场足够强大，可以将热气体推回，并帮助它抵抗引力。所以只有穿过磁场的气体才能向内盘旋到事件视界。不包含强磁化气体这一特征的理论模型与 EHT 的观察结果不符，因此可以排除。半人马座 A 的新图像对各种相互竞争的理论施加了更多限制，进一步缩小了可能性。根据最新的 EHT 数据，无线电发射形成了从半人马座 A 向外发出的巨大波瓣。但只有喷流的外边缘发出辐射，这可能是由于喷流与银河气体碰撞，从而加热了边缘。 “现在我们能够排除无法重现这种边缘增亮的理论喷气模型，”德国维尔茨堡大学的共同作者马蒂亚斯卡德勒说。 “这是一个引人注目的特征，将帮助我们更好地了解黑洞产生的喷流。”新的半人马座 A 观测也很有趣，因为它中心的黑洞是中等大小的：是太阳质量的 5500 万倍。它位于 M87（65 亿太阳质量）和我们银河系中心黑洞质量（约 400 万太阳质量）之间的中间。半人马座 A 的黑洞发出的喷流看起来与 EHT 的 M87 图像几乎相同，只是比例较小。换句话说，半人马座 A 黑洞的行为似乎与其更大或更小的兄弟姐妹没有什么不同，这进一步证实了物理学家的观点，即这些奇异物体可以仅通过它们的质量、电荷和自旋来定义。 “这些数据来自同一观测活动，它提供了 M87 黑洞的著名图像，”拉德堡德大学的合著者海诺法尔克说。 “新的结果表明，EHT 提供了关于黑洞种类丰富的数据宝库，而且还有更多。”有一天，该合作希望使用天基望远镜捕捉半人马座 A 中心黑洞的直接图像，就像他们对 M87 所做的那样。", "note_en": "The  Event Horizon Telescope (EHT) collaboration made headlines in 2019 by capturing the very first direct image of a black hole at the center of a galaxy. Now, the EHT is back with another exciting breakthrough: images of the &#34;dark heart&#34; of a radio galaxy known as  Centaurus A. The images enable the EHT to pinpoint the location of the supermassive black hole at the galaxy&#39;s center, according to  a new paper published in the journal Nature Astronomy. The images also capture the birth of a powerful jet emitting from the black hole. The jet&#39;s unusual characteristics could help astronomers answer a few nagging questions about how such jets are produced in the first place.\n &#34;This allows us for the first time to see and study an extragalactic radio jet on scales smaller than the distance light travels in one day,&#34;  said co-author Michael Janssen, an astronomer at Max Planck Institute for Radio Astronomy in Bonn and Radboud University Nijmegen. &#34;We see up close and personally how a monstrously gigantic jet launched by a supermassive black hole is being born.&#34;\n Centaurus A (aka NGC 5128) is one of the largest and brightest objects in the night sky, making it especially popular with amateur stargazers, although it&#39;s only visible from the Southern Hemisphere and low northern latitudes. Located in the constellation Centaurus, the galaxy was discovered in 1826 by James Dunlop. In 1847, John Herschel noted its peculiar shape—it looks elliptical when viewed from Earth, with a lane of dust superimposed across it.\n  In 1949, astronomers identified Centaurus A as the first known source of radio waves outside the Milky Way galaxy. That&#39;s because the galaxy boasts an  active galactic nucleus, which produces powerful jets that emit light in both X-ray and radio wavelengths that span distances far greater than the size of the galaxy itself. Centaurus A has been studied extensively ever since in the radio, optical, X-ray, and gamma-ray regimes.\n As Ars&#39;  John Timmer reported back in 2019, the EHT isn&#39;t a telescope in the traditional sense. Instead, it&#39;s a collection of telescopes scattered around the globe. The EHT is created by interferometry, which uses light captured at different locations to build an image with a resolution similar to that of a telescope the size of the most distant locations. Interferometry has been used for facilities like ALMA (the Atacama Large Millimeter/submillimeter Array), where telescopes can be spread across 16 km of desert.\n    In theory, there&#39;s no upper limit on the size of the array, but to determine which photons originated simultaneously at the source, you need very precise location and timing information on each of the sites. And you still have to gather sufficient photons to see anything at all. So atomic clocks were installed at many of the locations, and exact GPS measurements were built up over time. For the EHT, the large collecting area of ALMA, combined with choosing a wavelength where supermassive black holes are very bright, ensured sufficient photons. The net result is a telescope that can do the equivalent of reading the year stamped on a coin in Los Angeles from New York City—assuming the coin was glowing at radio wavelengths.\n  The EHT announced the  first direct image ever taken of a black hole at the center of an elliptical galaxy in 2019, located in the constellation of Virgo some 55 million light-years away: Messier 87 (M87). This image would have been impossible a mere generation ago, and it was made possible by technological breakthroughs, innovative new algorithms, and (of course) connecting several of the world&#39;s best radio observatories. The image confirmed that the object at the center of M87 is indeed a black hole. Small wonder that Science magazine named the image its  Breakthrough of the Year.\n  What was still lacking was insight into the process behind the powerful twin jets produced by M87. Most matter near the edge of a black hole—attracted by the black hole&#39;s strong gravitational pull—falls in, but some particles can escape and get blown out via those massive jets at nearly light speed. But astronomers don&#39;t yet agree about how those jets get accelerated to such high speeds. Perhaps the mechanism is an accretion disk that produces a magnetic field, funneling some of that matter into a jet. Or maybe the rotational energy of the black hole as it spins is the culprit. Or the mechanism could be a combination of both.\n  Earlier this year, we reported on  another groundbreaking result from the EHT collaboration: a new image of M87, this time showing how it looks in polarized light. The ability to measure that polarization for the first time—a signature of magnetic fields at the black hole&#39;s edge—yielded fresh insight into how black holes gobble up matter and emit powerful jets from their cores. The observations suggested that the magnetic fields at the black hole&#39;s edge are strong enough to push back on the hot gas and help it resist gravity&#39;s pull. So only the gas that slips through the magnetic field can spiral inward to the event horizon. Theoretical models that don&#39;t incorporate this feature of a strongly magnetized gas don&#39;t match the EHT&#39;s observations and thus can be ruled out.\n    The new images of Centaurus A place even more constraints around the various competing theories, further narrowing the possibilities. According to this latest EHT data, the radio emissions form massive lobes emanating outward from Centaurus A. But only the outer edges of the jets emit radiation, perhaps due to the jets colliding with galactic gas, thus heating the edge. &#34;Now we are able to rule out theoretical jet models that are unable to reproduce this edge-brightening,&#34;  said co-author Matthias Kadler of the University of Würzburg in Germany. &#34;It&#39;s a striking feature that will help us better understand jets produced by black holes.&#34;\n The new Centaurus A observations are also of interest because the black hole at its center is medium-sized: 55 million times the mass of our Sun. That falls smack in the middle between M87 (6.5 billion solar masses) and the mass of the black hole at the center of our own Milky Way galaxy (about 4 million solar masses). The jets emitted by Centaurus A&#39;s black hole look pretty much the same as the EHT&#39;s images of M87, just on a smaller scale. In other words, the Centaurus A black hole doesn&#39;t seem to behave differently from its bigger or smaller siblings, adding further credence to physicists&#39; notion that these exotic objects can be defined just by their mass, charge, and spin.\n &#34;These data are from the same observing campaign that delivered the famous image of the black hole in M87,&#34;  said co-author Heino Falcke of Radboud University. &#34;The new results show that the EHT provides a treasure trove of data on the rich variety of black holes, and there is still more to come.&#34; One day, the collaboration hopes to use space-based telescopes to capture a direct image of the black hole at the center of Centaurus A, just like they did for M87.", "posttime": "2021-07-22 22:48:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "喷流,horizon,黑洞", "title": "事件视界望远镜捕捉到半人马座 A 中黑洞喷流的诞生", "title_en": "Event Horizon Telescope captures birth of black hole jet in Centaurus A", "transed": 1, "url": "https://arstechnica.com/science/2021/07/event-horizon-telescope-captures-birth-of-black-hole-jet-in-centaurus-a/", "via": "", "real_tags": ["喷流", "horizon", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "733499906cc2c48b16842f1cb0fccc0a.jpg", "infoid": 1068973, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，加利福尼亚州的一家机构就游戏发行商动视暴雪 (Activision Blizzard) 的性歧视和性骚扰猖獗的指控提起诉讼。诉讼称，这种骚扰的性质是如此普遍，以至于为游戏制造商工作的女性“几乎普遍证实，为被告工作类似于在兄弟会的房子里工作”——根据这起诉讼，这意味着工作场所到处都是醉酒的男人，他们对女同事进行性骚扰，却没有因此受到惩罚。这份长达 29 页的诉讼声称，在整个公司中，薪酬差异导致女性“在从事基本相似的工作时获得的总薪酬低于男性同行”。它包括多个涉嫌动视暴雪放缓女性晋升的例子，以支持男性同行，即使这些女性在公司任职时间更长，审查记录出色，并补充说有色人种女性“尤其是被告歧视行为的目标。 ”完整的诉讼包括一长串违反性歧视和性骚扰法规的清单，其中包括许多挑出未透露姓名的动视暴雪员工的行为，从露骨到令人反感。该诉讼描述了一个被指控骚扰的特别极端的例子——并称受害者最终自杀了。诉讼中提到了多名公司高管。暴雪娱乐总裁 J. Allard Brack 据称在“2019 年初”收到一名员工的直接报告，称员工因“性骚扰和性别歧视”而离职。该报告直接指向该公司的战网在线服务团队，在那里“不是‘大玩家’或‘核心游戏玩家’，没有进入派对现场的女性被排除在外，并被当作局外人对待。”据称，该公司魔兽世界部门的一名前高级创意总监在一年一度的暴雪嘉年华活动中因殴打女同事而臭名昭著——这种行为如此咄咄逼人，以至于“主管不得不干预，将他从女员工身上拉下来”。布拉克在这些指控中的名字是在每次事件发生后只给导演一个“手腕上的耳光”，据称随后对女性进行了骚扰。据称，一名未透露姓名的动视 CTO 被看到“在公司活动中摸索醉酒的女性员工”，并据称根据她们的外表雇佣女性。该诉讼称，动视暴雪长期以来一直没有回应受影响员工提出的官方投诉。据称这些投诉没有保密，诉讼声称这些投诉人随后会遭到报复，形式包括裁员、不必要的部门调动和新的职业机会被拒绝。\n动视暴雪在诉讼后发表声明，甚至指责加州公平就业和住房部“歪曲了暴雪过去的描述，在许多情况下是虚假的”。在声称 DFEH 在提起诉讼之前没有进行“善意讨论”之后，它随后称该诉讼是“不负责任的州官僚的不负责任行为，[正在]将该州许多最好的企业赶出加利福尼亚州。” DFEH 要求的损害赔偿包括基于女性薪酬差异的损害赔偿，虽然动视暴雪的声明包括声称它“努力为所有员工公平地支付同等或基本相似的工作”，但它不承认任何可能的问题公司过去的薪酬差异，以及公司可能如何纠正先前在此事上违反加利福尼亚州法律的行为。就视频游戏行业的性骚扰指控而言，动视暴雪远非孤军奋战——如育碧、EA 和 Riot Games 最近的例子所示。", "note_en": "On Wednesday, a California State agency  filed a lawsuit against the game publisher Activision Blizzard over allegations of rampant sexual discrimination and sexual harassment. The nature of this harassment is so widespread, the lawsuit claims, that women who have worked for the game maker &#34;almost universally confirmed that working for Defendants was akin to working in a frat house&#34;—which, according to this lawsuit, means a workplace full of inebriated men who sexually harassed their female colleagues without being punished for it.\n The 29-page lawsuit claims that across the entire corporation, pay disparity led to women receiving &#34;less total compensation than their male counterparts while performing substantially similar work.&#34; It includes multiple alleged examples of Activision Blizzard slowing promotions for women in favor of male counterparts, even when those women had longer tenures and a superior review record at the company, and added that women of color were &#34;particularly targets of Defendants&#39; discriminatory practices.&#34;\n  The full lawsuit includes a lengthy list of violations of both sexual discrimination and sexual harassment statutes, including many that single out unnamed Activision Blizzard staffers, and they range from explicit to repugnant. The lawsuit describes one particularly extreme example of alleged harassment—and says the sufferer eventually took her own life.\n Multiple company executives are mentioned by name in the lawsuit. Blizzard Entertainment president J. Allard Brack allegedly received a direct report from an employee in &#34;early 2019&#34; that staffers were quitting the company over &#34;sexual harassment and sexism.&#34; The report pointed directly to the company&#39;s battle.net online service team, where &#34;women who were not &#39;huge gamers&#39; or &#39;core gamers&#39; and not into the party scene were excluded and treated like outsiders.&#34;\n    A former senior creative director at the company&#39;s  World of WarCraft division allegedly had a reputation at its annual BlizzCon event for hitting on female colleagues—one so aggressive that &#34;supervisors had to intervene and pull him off female employees.&#34; Brack is named in these allegations for giving the director nothing more than a &#34;slap on the wrist&#34; after each incident, which was allegedly followed subsequent harassment of women.\n And one Activision CTO, not identified by name, was allegedly seen &#34;groping inebriated female employees at company events&#34; and allegedly hired women based on their looks.\n The lawsuit alleges a long and detailed history of Activision Blizzard not responding to official complaints filed by affected staffers. Those complaints were allegedly not kept confidential, and the lawsuit claims those complainants were subject to subsequent retaliation, which came in the form of layoffs, unwanted department transfers, and having new career opportunities denied.\n  Activision Blizzard issued  a statement following the lawsuit, going so far as to accuse California State&#39;s Department of Fair Employment and Housing of &#34;distorted, and in many cases false, descriptions of Blizzard’s past.&#34; After claiming that the DFEH didn&#39;t engage in &#34;good faith discussions&#34; prior to filing its suit, it then called the suit &#34;irresponsible behavior from unaccountable State bureaucrats that [is] driving many of the State’s best businesses out of California.&#34;\n The damages sought by the DFEH include those based on women&#39;s pay disparity, and while Activision Blizzard&#39;s statement includes claims that it &#34;strive[s] to pay all employees fairly for equal or substantially similar work,&#34; it doesn&#39;t acknowledge any possible issue of pay disparity in the company&#39;s past, nor how the company might have rectified prior violations of California state law on the matter.\n Activision Blizzard is far from alone in terms of sexual harassment allegations in the video games industry—as seen in recent examples at  Ubisoft,  EA, and  Riot Games.", "posttime": "2021-07-22 22:47:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "暴雪,blizzard,女性", "title": "动视暴雪因涉嫌广泛歧视而被国家机构起诉", "title_en": "Activision Blizzard sued by state agency over alleged widespread discrimination", "transed": 1, "url": "https://arstechnica.com/gaming/2021/07/ca-state-agency-sues-activision-blizzard-alleges-discrimination-against-women/", "via": "", "real_tags": ["暴雪", "blizzard", "女性"]}, {"category": "", "categoryclass": "", "imagename": "0f6d2302107ad68c052d7c779d0bf736.jpg", "infoid": 1068972, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德克萨斯州第一发射场——杰夫·贝佐斯从他的航天器中走出来，脸上带着微笑，笑得和他头上的牛仔帽一样宽。周二早上，亚马逊的创始人实现了他个人资助的火箭和太空舱飞入太空的终生梦想。在几分钟的失重过程中，贝佐斯和他的兄弟马克与航空先驱沃利·芬克和一位 18 岁的客户奥利弗·戴门一起漂浮在新谢泼德太空舱周围。他们把Skittles糖果扔进彼此的嘴里，欣赏着风景。 “有史以来最美好的一天，”57 岁的贝索斯在安全降落在三个降落伞下后说。 “我的期望很高，而且大大超出了它们。”并不是每个人都对世界上最富有的人的冒险感到兴奋。在短短 10 分钟的飞行中，贝索斯激起了强烈的分歧。有些人甚至希望 Bezos 已经启动并且永远不会回来。这些批评者对贝索斯破坏工会和不善待亚马逊员工表示失望。环保主义者感到绝望的是，随着世界因气候变化和其他灾难而燃烧殆尽，贝索斯的回应是飞入太空。贝佐斯拥有所有财富，为那些厌恶超级富豪并希望他们缴纳应得税款的人提供了一个诱人的目标。对贝索斯的批评跨越了意识形态鸿沟，从福克斯新闻的塔克卡尔森到自由派国会女议员亚历山大·奥卡西奥-科尔特斯。与此同时，在航天界，人们大多将贝索斯的飞行庆祝为私人航天时代的曙光，这进一步打开了高前沿，蓝色起源和维珍银河都开始定期航天服务。任何一方都不一定是错的。对贝佐斯的巨额财富及其对社会的意义感到不安是合理的，但也承认蓝色起源拥有先进的航天技术。\n真正的问题是，贝佐斯是否会兑现他所说的将他的巨额财富用于造福人类的意图。 Bezos 和 Blue Origin 的众多批评者忽略的是，该公司的目标是最终拯救地球。虽然周二的飞行对贝索斯来说显然是自私的，但蓝色起源正在开展后续项目，以支持将重工业从地球表面转移到太空。为了让人类走上这条环境可持续发展的道路，贝索斯在 Blue Origin 上投入了大量资金，迄今已向这家航天公司投资了约 100 亿美元，而且每年还会增加。然而，贝索斯没有投入 Blue Origin 的是他的个人时间，也不是将亚马逊推向零售业顶端的领导力。所以在他周二从太空飞行回来后，我最想知道的是杰夫贝索斯是否全力投入太空。他有远见。他有钱。但在 57 岁的时候，他是否有足够的年限或意愿来确保蓝色起源的成功？还是他会离开 Blue Origin 陷入困境，而是在亚轨道兜风之后大部分时间退休到他价值 5 亿美元的游艇上？贝索斯对太空有着令人信服的愿景，而且这完全是真实的。早在他的亚马逊时代之前，贝索斯就一直坚信利用太空改善地球生活的力量。他说，我们的星球是一个需要保护的花园。 “这是太阳系中唯一的好行星，”他周二说，重复了他经常使用的一句话。 “我们已经向他们所有人发送了机器人探测器，这是唯一一个好的。我们必须照顾它。当你去太空看到地球是多么脆弱时，你会更加想要照顾它。”为了实现这一目标，贝索斯于 2000 年创立了 Blue Origin，以打造一条“太空之路”。这只是意味着通过反复重复使用火箭来降低发射火箭的成本。通过降低到达太空的成本，贝索斯试图将重工业从地球上转移出去。他说，与其对我们的星球进行露天开采，不如从无生命的小行星上收集这些资源。我们无法满足的能源需求也可以通过太空太阳能发电场来满足。最后，扩展到太空将允许人类作为一个物种成长，最终在地球附近的轨道定居点和其他世界居住。这种无限的扩张机会将使人类免于陷入停滞，免于为地球上日益稀缺的资源而战。\n从理论上讲，贝索斯对所有这些都是正确的。今天，世界上大约有一半的人口无法获得可靠的电力和相当高的生活条件。在不破坏地球的情况下，让这半世界人口达到发达国家所享有的生活水平的唯一长期手段可能是获取丰富的太空资源。然而，建立这样的太空经济和航天文明不会在一夜之间发生，这就是为什么贝索斯将蓝色起源视为多代人的努力。 “大事从小事开始，这就是它的开始方式，”贝索斯周二表示。公司有计划。它从新谢泼德系统开始，并学会了如何重复使用火箭。它目前正在开发更大的 New Glenn 火箭，该火箭基本上将使用 New Shepard 设计作为其第二级。未来有更大的火箭计划，所有这些都是为了以更便宜的方式将更多的质量往返地球。然而，这个计划展开得非常缓慢，贝索斯并没有像他领导亚马逊所表现出的那样坚定地推进。 Blue Origin 离自给自足还很远。贝索斯仍然必须每年向 Blue Origin 注入超过 10 亿美元的资金才能保持正常运转。即使对于世界上最富有的人来说，这种资金支持似乎也不可持续。 2010 年代中期，在近乎沉寂了十多年之后，蓝色起源从隐身模式中脱颖而出，成为一家强大的航天公司。现在看来，科技行业的两位巨头杰夫·贝索斯和埃隆·马斯克很可能会争夺太空领域的霸主地位。 2014 年底，Blue Origin 宣布已达成协议，为当时美国首屈一指的发射公司 United Launch Alliance 制造火箭发动机，震惊了航天业。 United Launch Alliance 选择 Blue 的 BE-4 发动机用于其新型 Vulcan 火箭，而不是 Aerojet Rocketdyne 的产品，后者是美国历史上大多数大型火箭发动机背后的蓝血推进公司。大约一年后，蓝色起源通过安全发射和降落新谢泼德火箭和太空舱执行其上下亚轨道任务，实现了另一项壮举。这标志着历史上第一次有人——国家或公司——将一级火箭垂直发射到太空，然后又降落在地面上。\n接下来的一个月，也就是 2015 年 12 月，SpaceX 首次用其轨道猎鹰 9 号火箭重复了这一发射和着陆的壮举。从技术角度来看，猎鹰 9 号着陆意义重大，因为它需要大约 30 倍的能量将有效载荷送入轨道，并且需要复杂的工程来减缓这种助推器的速度并将其返回着陆点。无论如何：在猎鹰 9 号飞行之后，杰夫·贝佐斯 (Jeff Bezos) 厚颜无耻地在推特上对马斯克和 SpaceX 说“欢迎加入俱乐部”。马斯克显然没有被逗乐，但这种玩笑强调了新兴的竞争——贝佐斯和马斯克，亿万富翁与亿万富翁，寻求制造可重复使用的火箭并重塑航天工业。那时，一切似乎都很清楚：21 世纪的太空竞赛将由 Blue Origin 和 SpaceX 举办，这将是一场值得关注的事情。只是还没有。没有比赛。自 2015 年底以来，Blue Origin 仅再发射了 15 次亚轨道新谢泼德系统，平均每年少于 3 次任务。就在本周，人类才终于登上发射台。至于 BE-4 发动机，在承诺将在 2017 年为航天飞行做好准备后，Blue Origin 四年多后仍未向联合发射联盟交付飞行就绪版本。已经开发了 3 年多的 BE-4 准备在 2017 年飞行！ pic.twitter.com/UppZweI7So SpaceX，相比之下，已经上升。自 2015 年 12 月以来，该公司已成功执行了 100 多次轨道飞行任务。它已经开发并飞行了世界上最强大的火箭猎鹰重型火箭，并且可能很快就会推出其更强大的星际飞船发射系统。借助 Starlink Internet 星座，SpaceX 现在运营的卫星数量超过世界上任何国家或公司。 2020 年，得益于 SpaceX，美国宇航局在载人航天方面打破了对俄罗斯的依赖。 NASA 宇航员现在乘坐时尚的 Crew Dragon 飞船进入太空。 Blue Origin 在涉及价值数十亿美元的大型政府合同时也失败了，这是 Bezos 渴望从他对 Blue Origin 的巨额投资中获得回报的渴望。 2020 年，美国国防部表示将只允许联合发射联盟和 SpaceX 在 2020 年代中期竞标国家安全发射合同。蓝色起源抗议，输了。然后，在 4 月，美国宇航局单独选择了 SpaceX，用于著名的人类着陆系统。这是在贝佐斯在 2019 年华丽地展示了他公司的“蓝月亮”着陆器之后发生的。蓝色起源也对此提出了抗议，预计将在 8 月初做出决定。如果 Blue Origin 成功，那将是一个惊喜。简而言之，曾经有希望的太空竞赛已经变成了一种潮湿的哑炮。 2019 年底，在为我关于 SpaceX 起源的书 Liftoff 做报道时，我问马斯克为什么他认为 Blue Origin 已经落后了。 “坦率地说，贝索斯并不擅长工程，”马斯克回答道。", "note_en": "LAUNCH SITE ONE, Texas—Jeff Bezos burst from his spacecraft with a smile on his face as wide as the brim of the cowboy hat atop his head.\n The founder of Amazon fulfilled a lifelong dream of flying into space Tuesday morning aboard a rocket and capsule he personally funded. During a few minutes of weightlessness, Bezos and his brother Mark had floated around the New Shepard capsule alongside aviation pioneer Wally Funk and an 18-year-old customer, Oliver Daemen. They tossed Skittles candy into one another’s mouths and enjoyed the view.\n  “Best day ever,” said Bezos, 57, after landing safely beneath three parachutes. “My expectations were high, and they were dramatically exceeded.”\n Not everyone was thrilled by the adventures of the richest person in the world. With his brief 10-minute flight, Bezos provoked sharply divided reactions. Some people even wished Bezos had launched and never come back.\n These critics expressed frustration with Bezos for busting unions and not treating Amazon employees well. Environmentalists despaired that as the world burns from climate change and other calamities, Bezos responded by jetting into space. And with all of his wealth, Bezos offered an inviting target for those who loathe ultra-rich billionaires and want them to pay their fair share of taxes. Criticism of Bezos spanned the ideological divide, from Tucker Carlson  on Fox News to liberal Congresswoman  Alexandria Ocasio-Cortez.\n Meanwhile, within the space community, people mostly celebrated Bezos’ flight as the dawn of the private spaceflight era, which further opens the high frontier, with both Blue Origin and Virgin Galactic starting regular spaceflight service.\n    Neither side is necessarily wrong. It is reasonable to both be uncomfortable with Bezos&#39; extreme wealth and what that means for society but also recognize that Blue Origin has advanced spaceflight.\n The real question is whether Bezos will make good on his stated intent to use his immense wealth for the good of humanity. What the legion critics of Bezos and Blue Origin miss is that the company legitimately has the goal of ultimately saving planet Earth. While Tuesday’s flight was clearly self-serving for Bezos, Blue Origin has follow-on projects in the works to support moving heavy industry from the surface of our planet into space.\n To set humanity on this environmentally sustainable path, Bezos has lavished funding on Blue Origin, investing about $10 billion in the spaceflight company so far, with more coming every year. However, what Bezos has not invested into Blue Origin is his personal time, nor the driven leadership that propelled Amazon to the top of the heap of retail.\n    So after he returned from his spaceflight on Tuesday, what I most wanted to know is whether Jeff Bezos is all-in on space. He has the vision. He has the money. But at the age of 57, does he have enough years or willingness to ensure Blue Origin’s success? Or will he leave Blue Origin to flounder and instead mostly retire to his half-billion-dollar yacht after a suborbital joyride?\n   Bezos has a  compelling vision for space, and it is entirely genuine. From way back before his Amazon days, Bezos has been a true believer in the power of using space to improve life on Earth. Our planet, he says, is a garden to be preserved.\n “This is the only good planet in the Solar System,” he said on Tuesday, repeating a line he has often used. “We’ve sent robotic probes to all of them, and this is the only good one. We have to take care of it. And when you go to space and see how fragile Earth is, you’ll want to take care of it even more.”\n To accomplish this, Bezos founded Blue Origin in 2000 to build a “road to space.” This simply means bringing down the cost of launching rockets by reusing them over and over again. By lowering the cost of reaching space, Bezos seeks to move heavy industry off Earth. Instead of strip-mining our planet, he says, we should glean those resources from lifeless asteroids.\n Our insatiable energy needs, too, might be met by space-based solar power farms. And finally, expanding into space will allow humanity to grow as a species, eventually populating orbital settlements near Earth and then other worlds. This unlimited opportunity for expansion would save humans from entering a stasis and from fighting for increasingly scarce resources on Earth.\n Bezos is theoretically right about all of this. Today, roughly half the world’s population lacks access to reliable electricity and reasonably high living conditions. The only long-term means to bring this half of the world’s population up to a standard of living enjoyed by the developed world, without destroying the Earth, is probably accessing the bounty of resources in space.\n  Building such a space economy and a spacefaring civilization will not happen overnight, though, and that&#39;s why Bezos views Blue Origin as a multi-generational effort. “Big things start small, and this is how it starts,” Bezos said Tuesday.\n The company has a plan. It started small with the New Shepard system and learned how to reuse rockets. It is currently developing the much larger New Glenn rocket, which will essentially use the New Shepard design as its second stage. There are plans for even bigger rockets down the line, all to move more mass to and from planet Earth much more cheaply.\n Yet this plan has unfolded very slowly, and Bezos has not pushed forward with the same determination displayed by his leadership of Amazon. Blue Origin remains very far from self-sufficiency. Bezos still must pump more than $1 billion into Blue Origin annually to keep the lights on. Even for the world’s richest person, this kind of financial backing does not seem sustainable.\n      During the middle of the 2010s, after more than a decade of near silence, Blue Origin emerged from stealth mode with all appearances of becoming a formidable space company. It seemed probable that two titans of the tech industry, Jeff Bezos and Elon Musk, would now battle for supremacy in the space arena.\n In late 2014, Blue Origin stunned the space industry by announcing that it had reached a deal to build rocket engines for United Launch Alliance, then the premiere launch company in the United States. United Launch Alliance selected Blue’s BE-4 engine for its new Vulcan rocket over an offering from Aerojet Rocketdyne, the blueblood propulsion company behind the majority of large rocket engines in US history.\n About a year later, Blue Origin pulled off another feat by safely launching and landing the New Shepard rocket and capsule on its up-and-down suborbital mission. This marked the first time in history that anyone—country or company—had vertically launched a first-stage rocket into space and then landed it back on the ground.\n The next month, in December 2015, SpaceX repeated this launch-and-landing feat with its orbital Falcon 9 rocket for the first time. From a technical standpoint, the Falcon 9 landing was much more significant, as it requires about 30 times more energy to boost a payload into orbit and complicated engineering to slow such a booster down and return it to the landing site. No matter: After the Falcon 9 flight, Jeff Bezos  cheekily tweeted, “Welcome to the club” to Musk and SpaceX.\n Musk was decidedly not amused, but this banter underscored the emerging rivalry—Bezos and Musk, billionaire versus billionaire, on a quest to build reusable rockets and remake the space industry. Back then, it all seemed so clear: The 21st-century space race would be run by Blue Origin and SpaceX, and it was going to be a hell of a thing to watch.\n Only it hasn’t been. There has been no race. Since the end of 2015, Blue Origin has launched its suborbital New Shepard system just 15 more times, an average of fewer than three missions per year. Only this week did humans finally get on board for a launch. As for the BE-4 engine, after promising it would be  ready for spaceflight in 2017, Blue Origin has yet to deliver a flight-ready version to United Launch Alliance more than four years later.\n Already more than 3 years into development our BE-4 will be ready for flight in 2017!  pic.twitter.com/UppZweI7So\n SpaceX, by contrast, has ascended. Since December 2015, the company has successfully flown more than 100 orbital missions. It has developed and flown the world’s most powerful rocket, the Falcon Heavy, and may soon debut its still more titanic Starship launch system. With the Starlink Internet constellation, SpaceX now operates more satellites than any nation or company in the world. And in 2020, thanks to SpaceX, NASA broke its dependency on Russia for human spaceflight. NASA astronauts now ride to space in style inside the sleek Crew Dragon spacecraft.\n Blue Origin has also lost out when it comes to large government contracts worth billions of dollars, something Bezos craves as he seeks to find some return on his massive investment in Blue Origin. In 2020, the Department of Defense said it would only allow United Launch Alliance and SpaceX to bid on national security launch contracts in the mid-2020s. Blue Origin protested and lost. Then, in April, NASA chose SpaceX alone for a prestigious Human Landing System. This came after Bezos showily unveiled his company’s “Blue Moon” lander in 2019. Blue Origin protested this, too, and a decision is expected in early August. It would come as a surprise if Blue Origin succeeds.\n In short, a once-promising space race has become something of a damp squib. In late 2019, while reporting for my book on the origins of SpaceX,   Liftoff, I asked Musk why he thought Blue Origin had fallen behind. “Bezos is not great at engineering, to be frank,&#34; Musk replied.", "posttime": "2021-07-22 22:47:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "贝佐斯,jeff,flight,太空", "title": "尽管有周二的航班，但杰夫·贝佐斯 (Jeff Bezos) 没有时间拯救蓝色起源", "title_en": "Despite Tuesday’s flight, Jeff Bezos is running out of time to save Blue Origin", "transed": 1, "url": "https://arstechnica.com/science/2021/07/despite-tuesdays-fight-jeff-bezos-is-running-out-of-time-to-save-blue-origin/", "via": "", "real_tags": ["贝佐斯", "jeff", "flight", "太空"]}, {"category": "", "categoryclass": "", "imagename": "fe848de1df3ba800f4a150f1a4483344.jpg", "infoid": 1068971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周三举行的公开委员会会议上，联邦贸易委员会一致投票通过执行有关维修权的法律，从而确保美国消费者能够维修自己​​的电子和汽车设备。 FTC 对规则的认可并不是一个意外的结果；维修权问题一直是一个明显的两党问题，联邦贸易委员会本身在 5 月份发布了一份冗长的报告，抨击制造商限制维修。但 5 比 0 的投票结果表明，委员会致力于在个人设备维修方面执行联邦反垄断法和一项围绕消费者保修的关键法律——马格努森莫斯保修法。由 FTC 新任主席和知名科技评论家丽娜·汗 (Lina Khan) 领导的投票也是在乔·拜登总统签署旨在促进美国经济竞争的广泛行政命令 12 天后进行的。该命令涉及广泛的行业，从银行到航空公司再到科技公司。但其中一部分鼓励作为独立机构运作的 FTC 制定新规则，以防止公司限制消费者的维修选择。 “当你购买昂贵的产品时，无论是 50 万美元的拖拉机还是千元的手机，你都真正处于制造商的力量之下，”总裁特别助理蒂姆·吴说国家经济委员会内的技术和竞争政策。 “当他们有不合理的维修规范时，你无能为力。”吴补充说，维修权已成为工人、消费者、小企业和大型实体之间巨大失衡的“内在例子”。 FTC 投票是美国维修权运动的又一次胜利，该运动由美国公共利益研究小组等倡导团体以及 iFixit 等私营公司领导，后者是一家总部位于加利福尼亚的公司，销售小工具维修套件并发布DIY 修补匠的维修手册。维修权的支持者长期以来一直认为，消费者应该获得修理他们拥有的产品所需的工具、零件、文档和软件，无论是智能手机还是拖拉机。这些团体也是快速指出大型制造商阻止或限制独立产品维修选项的情况，或强迫消费者直接回到制造商处，然后制造商收取维修费用。 d 这不仅仅是将破碎的玻璃重新装回智能手机，或修理一个不可思议的小智能手表的问题：在 2020 年春季冠状病毒大流行的高峰期，医疗设备工程师开始谈论无法访问的危险在危机时期用于关键设备（例如呼吸机）的维修工具。\n随着越来越多的产品设计有互联网连接——从智能手机到冰箱再到汽车——维修权问题变得越来越复杂。维修倡导者表示，消费者应该可以访问他们个人设备收集的所有数据，独立维修店应该可以使用“授权”商店拥有的相同软件诊断工具。 “我敦促联邦贸易委员会利用其制定规则的权力来加强基本的消费者和私有财产权，并在数字时代对其进行更新，因为制造商试图将数亿技术所有者变成他们自己财产的租户，”保罗说Securepairs.org 的创始人罗伯茨在今天 FTC 会议的公众评论部分。 “数字维修权是延长电子设备使用寿命的重要工具。”但一些大型制造商反对这一观点，认为这会降低产品的安全性，并使消费者面临安全风险。世界领先的拖拉机制造商之一约翰迪尔发表声明称，“由于与设备安全操作、排放合规性和发动机性能相关的风险，它不支持修改嵌入式软件的权利。”在今天 FTC 听证会的评论部分，户外动力设备协会的一位代表声称“维修权立法未能考虑我们行业产品的消费者安全和环境保护……例如，它允许修改并篡改 CPSC 法律要求的动力割草机刀片的安全控制，以及 EPA 法律要求的排放控制。”代表微软和苹果等公司的贸易组织 TechNet 的高级副总裁 Carl Holshouser 在给 WIRED 的电子邮件声明中写道：“FTC 决定颠覆一个有效且安全的系统，供消费者修理他们依赖的产品。他们的健康、安全和福祉，包括电话、计算机、火警、医疗设备和家庭安全系统，将对技术和网络安全产生深远的、永久性的影响。”在今天投票之前，在拉斯维加斯举办年度 CES 技术盛会的消费者技术协会致函 FTC 委员，敦促合作，而不是“广泛的规则制定过程”，称知识产权是一个棘手的问题维修权的核心。然而，值得注意的是，在 5 月份 FTC 的报告中，该报告是该委员会在 2019 年主持“修复修复”小组后收集的数据的高潮，FTC 表示“缺乏证据支持制造商的维修理由限制。”该报告详细说明了制造商可能夸大了热失控（即电池着火）或与设备维修相关的个人数据泄露风险的许多情况。\n目前，联邦贸易委员会的政策声明是对现有法律的巨大强调，而数十个州则在州一级考虑维修权法案。该委员会今天表示，将从潜在违反反垄断法和消费者保护的角度对维修限制进行调查。 FTC 还鼓励公众举报滥用保修的行为——根据 1975 年的《马格努森·莫斯保修法案》(Magnuson Moss Warranty Act) 的定义，该法案禁止制造商告诉消费者，如果产品被原始制造商以外的人更改或篡改，保修将失效. Jessa Jones 是一位维修专家，她在纽约州北部经营一家名为 iPad Rehab 的公司，声称已经修理了 40,000 多部 iPhone，她敦促 FTC 认真对待现有法规的执行。 “尽管《马格努森莫斯保修法》中有反搭售声明，但仍然普遍无视 FTC 规则，”琼斯在会议的公众评论部分表示。 “消费者和制造商仍然认为，只需打开设备即可使保修失效。” 📱 在最新款手机之间纠结？不要害怕——查看我们的 iPhone 购买指南和最喜欢的 Android 手机", "note_en": "During an open commission meeting Wednesday, the Federal Trade Commission voted unanimously to enforce laws around the Right to Repair, thereby ensuring that US consumers will be able to repair their own electronic and automotive devices.\n The  FTC’s endorsement of the rules is not a surprise outcome; the issue of Right to Repair has been a remarkably bipartisan one, and the FTC itself  issued a lengthy report in May that blasted manufacturers for restricting repairs. But the 5 to 0 vote signals the commission’s commitment to enforce both federal antitrust laws and a key law around consumer warranties—the  Magnuson Moss Warranty Act—when it comes to personal device repairs.\n The vote, which was led by new FTC chair and known tech critic Lina Khan, also comes 12 days after President Joe Biden  signed a broad executive order aimed at promoting competition in the US economy. The order addressed a wide range of industries, from banks to airlines to tech companies. But a portion of it encouraged the FTC, which operates as an independent agency, to create new rules that would prevent companies from restricting repair options for consumers.\n  “When you buy an expensive product, whether it&#39;s a half-a-million-dollar tractor or a thousand-dollar phone, you are in a very real sense under the power of the manufacturer,” says Tim Wu, special assistant to the president for technology and competition policy within the National Economic Council. “And when they have repair specifications that are unreasonable, there&#39;s not a lot you can do.&#34;\n Wu added that  Right to Repair has become a &#34;visceral example&#34; of the enormous imbalance between workers, consumers, small businesses, and larger entities.\n  The FTC vote is another win for the Right to Repair movement in the US, which has been led by advocacy groups like the  US Public Interest Research Group, as well as private companies like  iFixit, the California-based company that sells gadget repair kits and publishes repair manuals for DIY tinkerers. Proponents of the Right to Repair have long argued that consumers should have access to the tools, parts, documentation, and software required to fix the products they own, whether it’s a smartphone or a tractor.\n  These groups are also quick to call out instances in which large manufacturers block or limit options for independent product repairs, or force consumers to go directly back to a manufacturer, who then charges a premium for a fix. And it’s not just a matter of fixing a broken glass back on a smartphone, or repairing an impossibly small smartwatch: During the height of the coronavirus pandemic in the spring of 2020, medical device engineers  began speaking out on the dangers of not having access to repair tools for critical devices, such as ventilators, during times of crisis.\n  As more products are designed with internet connectivity—from smartphones to refrigerators to cars—the issue of repair rights has become increasingly complicated. Repair advocates say consumers should have access to all of the data that their personal devices collect, and that independent repair shops should have access to the same software diagnostic tools that “authorized” shops have.\n  “I urge the FTC to use its rulemaking authority to reinforce basic consumer and private property rights, and to update it for the digital age, as manufacturers seek to turn hundreds of millions of owners of technology into tenants of their own property,” said Paul Roberts, the founder of  Securepairs.org, during a public comments section of today’s FTC meeting. “A digital Right to Repair is a vital tool that will extend the life of electronic devices.”\n  But some large manufacturers oppose this notion, arguing that it will make products less secure and could expose consumers to safety risks. John Deere, one of the world’s leading tractor makers, has issued statements saying that it “does not support the right to modify embedded software due to risks associated with the safe operation of the equipment, emissions compliance, and engine performance.”\n During the comments portion of the FTC hearing today, a representative for the Outdoor Power Equipment Institute claimed that “Right to Repair legislation fails to consider consumer safety and environmental protection with respect to our industry’s products … as an example, it would allow for modification of and tampering with safety controls of powered lawn mower blades required under law by the CPSC, as well as emissions controls required under law by the EPA.”\n Carl Holshouser, senior vice president at  TechNet, a trade group that has represented companies like Microsoft and Apple, wrote in an emailed statement to WIRED that “the FTC’s decision to upend an effective and secure system for consumers to repair products that they rely on for their health, safety, and well-being, including phones, computers, fire alarms, medical devices, and home security systems, will have far-reaching, permanent impacts on technology and cybersecurity.”\n And ahead of the vote today, the Consumer Technology Association—which hosts the annual CES tech bonanza in Las Vegas— sent a letter to the FTC commissioners urging collaboration, rather than an “extensive rulemaking process,” citing intellectual property rights as a thorny issue at the heart of Right to Repair.\n It’s worth noting, however, that in the FTC’s report in May, which was the culmination of data gathered after the commission hosted a “Nixing the Fix” panel in 2019, the FTC said there was “scant evidence to support manufacturers’ justifications for repair restrictions.” The report detailed a number of instances in which manufacturers may have overstated the risks of thermal runaway (read: batteries catching fire) or personal data breaches tied to device repairs.\n  For now, the FTC’s policy statement is a giant underscore for existing laws, while dozens of states consider Right to Repair bills at the state level. The commission said today it would investigate repair restrictions both as potential violations of antitrust laws and from a consumer protection angle. The FTC is also encouraging the public to report warranty abuse—as defined by the Magnuson Moss Warranty Act of 1975, which prohibits manufacturers from telling consumers that a warranty is voided if the product has been altered or tampered with by someone other than the original manufacturer.\n Jessa Jones, a repair expert who runs a business in upstate New York called iPad Rehab, and who claims to have fixed over 40,000 iPhones, urged the FTC to take the enforcement of the existing regulations seriously.\n “Despite the anti-tying statement within the Magnuson Moss Warranty Act, there’s still rampant disregard of the FTC rules,” Jones said during the public comments portion of the meeting. “Consumers and manufacturers alike still believe that you can void a warranty simply by opening a device.”\n   📱 Torn between the latest phones? Never fear—check out our  iPhone buying guide and  favorite Android phones", "posttime": "2021-07-22 22:46:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "强制执行,votes,维修", "title": "FTC 一致投票强制执行维修权", "title_en": "The FTC Votes Unanimously to Enforce Right to Repair", "transed": 1, "url": "https://www.wired.com/story/ftc-votes-to-enforce-right-to-repair/", "via": "", "real_tags": ["强制执行", "votes", "维修"]}, {"category": "", "categoryclass": "", "imagename": "08c1ecb794a9200a61ee86f7d3ac0905.jpg", "infoid": 1068970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过一年半的中断，许多办公室将于 9 月重新开放。大多数公司都要求员工以混合方式返回，这意味着他们至少有时会进入办公室。但究竟会是什么样子还不确定。可以肯定的是，在家工作的人将比以往任何时候都多，这种转变有可能颠覆从实体办公空间到人们对工作的看法等方方面面。随着美国公司面临招聘危机，不提供远程工作的公司在招聘新人才时可能会发现自己处于明显劣势。 Recode 与哈佛商学院工商管理教授、《远程工作革命：从任何地方取得成功》的作者 Tsedal Neeley 讨论了随着工作性质的变化而出现的许多问题。成为白领已经有很多好处：你通常赚更多的钱，你在有空调的办公室工作，现在你可以在家工作，这可以让生活变得更加轻松。您认为这会导致蓝领和白领之间的仇恨越来越大吗？人们是否可以使用虚拟性——或者混合工作，或者动态工作，取决于你和谁交谈——很容易成为一个多元化和包容性的问题。首先，我们必须真正了解，在给定的组织中，人们正在做的任何事情是否可以远程完成。我们倾向于从全球的角度看待角色，然后说：“嗯，这些工作不能远程完成，而这些工作可以”，然后迅速开始将人员分配到远程或非远程。当我们开始仔细审查人们所做的任务和他们所做的工作时，许多公司一直在追求的一个选择是，“我们可以集中和轮换吗？”因此，与其让所有这些人在身体上都依附于这些工作领域，我们是否可以做一些我们看待任务的事情，哪些可以虚拟完成，哪些需要实际存在，并且我们所有人都参与其中？第二件事是，如果我们不能因为人们的工作而给他们远程工作的机会，我们就必须给他们远程学习的时间。我们必须为人们提供某种远程体验，让他们可以进行一些自我发展。这就是你可以平等的地方。蓝领工人——我在考虑没有配备技术的仓库或送货人员——我认为这不会有太大变化。但我也不认为它会造成我们预期的那样糟糕的分裂。因为混合，根据定义，意味着你有一些面对面的，你有一些远程的，会有混合。因此，如果人们不经常去办公室——如果我每周只去金融区一两天——这对在沙拉吧、服务柜台工作的人来说意味着什么？用来修指甲？当更多人远程工作时，对他们有什么影响？\n如果你每周在那里两次，另一个公司的另一个人每周来两次，另一个人每周大约一次。我坚信运动的模式可能会有所不同，但人们仍然会在那里。即使公司减少其商业足迹，同一实体中也会有更多较小的组织，而不是在建筑物中有很多楼层的组织。但总的来说，如果之前每个人都去五天，现在每个人都工作两天，那么实际进入的总天数就会减少。所以必须有所减少，对吧？会有某种程度的减少。但我不认为我们会像我们想象的那样拥有这些空荡荡的建筑物。我认为将会重新分配谁在那里以及何时出现，但活动将是相似的。员工现在拥有权力，因此公司必须适应他们的需求让我们谈谈像高盛这样的公司，它们对每个进入办公室的人都非常强硬。他们会在未来失去人才吗？人们是否会说，“如果他们不让我的工作和生活有任何灵活性，我就不会在这家公司或这个行业工作”？我们所处的时代，人们尝到了不同的工作方式，一种与同居者交往的不同方式，减少了通勤带来的压力，节省了更多的钱。因为他们尝过这个，他们要求它，他们想要它。鉴于此，现任者在吸引和留住顶尖人才方面会像往常一样强大吗？随着我们已经开始看到的那种巨大的辞职和离职，如果从长远来看他们不会开始看到人们离开，我会感到惊讶。这是员工的时代。今天的权力掌握在员工手中，因为希望在他们的职业安排中保留某种工作与生活灵活性的人的规模和规模之大。如果他们不能在这里得到它，为什么不在其他地方得到它？真遗憾，如果组织不倾向于虚拟化和远程工作所提供的礼物，以便他们可以......留住她们的女性\n如果大流行已经证明他们不必在办公室，为什么有些公司要求员工一直待在办公室？正是这种信念和偏见使我们能够通过面对面的存在进行联系、交流、协作和学习。正是这种偏见，文化建设和文化维护只能在面对面的环境中发生。但这在经验上是不正确的。他们的工作重点非常注重过程，而不是注重结果。为了让远程混合动力工作，人们必须改变他们的绩效指标，信任员工，放开控制权，让被授权的自主员工实现组织目标。这让我想起了苹果公司，它可能不得不在其在家工作政策上稍作调整，以免人们放弃。我们现在正处于非常紧张的招聘危机中，因此雇主必须提供更多福利，例如在家工作以吸引人才。但是当没有招聘紧缩时会发生什么呢？我们会恢复正常吗？我们可能。这些事情是周期性的，但公司的营业额成本是个人工资的一年半。想想那个和走出门外的机构记忆。我们实际上看到了提前退休，人们说，“我们喜欢待在家里，我们已经度过了这场疯狂的危机，我不想再有那种压力了。”大幅流失的损失，不仅仅是人才流失。你还搞乱了组织的文化。想想一个有外流的地方。这不是一个激励环境。当有人离开时，不仅会带来务实的损失，而且公司还将承受文化、社会、情感和心理上的打击。如果我现在是一家公司，我会努力留住我最好的人。因为我最好的人会确保我做得好。我一直在写关于职业母亲如何真正想在家工作，但她们也很难这样做，报告压力和倦怠率更高。人们期望女性既是理想的工人又是理想的母亲。显然，由于大流行，事情变得更加困难，但对于女性来说，这似乎总是一种不可能的情况。远程工作如何融入其中？情况很糟糕，但情况变得更糟。我被吓到了。美国劳工统计数据显示，[2020 年] 有 300 万女性离开了劳动力市场。搞得我头都炸了。然后另一项查看相同数据的调查能够确定近 600,000 人是母亲和看护人。真遗憾，如果组织不倾向于虚拟化和远程工作提供的礼物，以便他们可以利用弹性工作时间和弹性工作来留住女性。或者还加入某种儿童保育设备以支持母亲。我与之交谈过的一些聪明的公司做了这样的事情，从这个时候到这个时候，我们实际上每天都会有在线程序，这样有 5 到 10 岁孩子的母亲可以获得某种喘息。在全球大流行期间，我们无法向您派遣保姆，但这些公司已经找到了支持妇女和母亲的方法——但这些只是少数。我们谈论多样性、性别和女性，然后我们看到了不起的女性离开。我们必须努力将他们带回并重新融入我们的组织。即使是大流行前处理年轻家庭和专业需求的方式也不是很好。如果我可以在家工作，我的接送会比我在 5 岁到任何时间之间扭断脖子去接孩子要容易得多。所有这些都会消失。\n一直脱离组织主流的人们突然觉得他们不仅在谈判桌旁，而且没有人称他们为错误的名字 在家工作可以使某些群体受益：残疾人，从未接触过的人一开始就擅长在办公室闲聊。一些黑人说他们更喜欢在家工作，因为他们有更好的归属感，并且更少受到微侵犯。这对多元化包容意味着什么？在家工作是在工作中获得更多公平的入场券吗？我认同。在组织中一直处于主流之外的人突然觉得他们不仅在谈判桌旁，而且没有人称他们为错误的名字。他们不必为了代码转换和适应而每天进行心理上的通勤。那些身体残疾，甚至神经多样性挑战和担忧的人，正在找到更多的平静。然而，我们可以吸取的教训是，人们为什么会有这些经历，我们可以做些什么来改变我们的组织，让他们拥有在这个远程环境中体验过的归属感？我做了一些非常糟糕的预测，所以我希望你做一个预测。从现在起，在一两年或五年后会是什么样子？指导方针和政策将得到解决。围绕灵活工作场所的能力将会提高。个别经理将升级以弄清楚如何领导分散的员工队伍。人们将更灵活地使用数字工具，因此技术枯竭之类的情况将消失。在人们体验了混合格式后，他们会适应真正适合他们的节奏。而且我认为我们会看到比亲临现场更遥远的日子。我还预测物理空间——办公空间——看起来会大不相同。遥远的一年完全影响了人们的需求：智能板、可移动家具、户外工作空间。所以我们将看到办公室的物理空间看起来与今天大不相同。数百万人通过 Vox 了解新闻中发生的事情。我们的使命从未像现在这样重要：通过理解赋予权力。读者的财政捐助是支持我们资源密集型工作的关键部分，并帮助我们保持新闻业对所有人免费。请考虑从今天开始向 Vox 捐款低至 3 美元。", "note_en": "After a year-and-a-half hiatus, many offices will open back up in September.  Most companies are asking that employees return on a hybrid basis, meaning they come into the office at least some of the time. But what exactly that will look like is uncertain.\n What is certain is that more people will work from home than ever before, and this shift has the potential to disrupt everything from physical office space to the way people feel about work. And as US companies  face a hiring crisis, companies that don’t offer remote work could find themselves at a significant disadvantage when it comes to recruiting new talent.\n Recode talked with  Tsedal Neeley, a professor of business administration at Harvard Business School and the author of   Remote Work Revolution: Succeeding from Anywhere, about the many issues that are coming up as the nature of work changes.\n    There were already a lot of perks to being a white-collar worker: You generally make more money, you work in an air-conditioned office, and now you get to work from home, which can make life so much easier. Do you think this will lead to growing animosity between blue-collar and white-collar workers?\n  Whether or not people have access to virtuality — or hybrid work, or dynamic work, depending on who you’re talking to — can easily become a diversity and inclusion question. First of all, we have to truly understand, in a given organization, whether or not anything that people are doing can be done remotely. We have a tendency to look at roles from a global standpoint and say, “Well, these jobs can’t be done remotely and these jobs can,” and quickly start assigning people to remote or non-remote. When we start scrutinizing the tasks that people do and the work that they do, one option that many companies have been pursuing is, “Can we pool and rotate?” So instead of all these people being attached physically to these job areas, can we do something where we look at tasks, what can be done virtually, what requires physical presence, and all of us share in that?\n The second thing is, if we can’t give people remote work opportunities because of what they do, we have to give people remote learning days. We have to give people some kind of remote experiences that they can do some self-development around. And this is where you can have parity. Blue-collar workers — I’m thinking in warehouses that are not outfitted with technology, or delivery folks — I don’t think that’s going to change much. But I also don’t think that it’s going to create as bad a division as we expect. Because hybrid, by definition, means you have some in-person, you have some remote, there’s going to be a mix.\n   So if people don’t go into the office as often — if I’m only going into the financial district one or two days a week — what does that mean for the people who work at the salad bars, the service counters, where I used to get my nails done? What are the repercussions for them when more people work remotely?\n   If you are there twice a week, another person for another company is there twice a week, another person is around once a week. I am firmly convinced that the patterns of movement may differ, but people will still be there. Even if companies reduce their commercial footprint, there will be more smaller organizations in the same entity, as opposed to one having a lot of floors in a building.\n  But overall, if everyone went in five days before, now everyone’s working two days, there are fewer total days that people are actually going in. So there has to be some sort of reduction, right?\n  There will be some kind of reduction. But I don’t think we’re going to have these empty buildings as we imagine. I think there’s going to be a redistribution of who’s there and when, but the activities will be similar.\n Workers have the power right now, so companies will have to adapt to their demands\n  Let’s talk about companies like Goldman Sachs, that have been really hardline on everyone coming into the office. Are they going to lose talent going forward? Are people going to be like, “I’m not going to work at this company or in this industry if they’re not going to let me have any flexibility in my work and life”?\n  We’re in an era where people have tasted a different way of working, a different way of connecting with the people they cohabitate with, a reduced level of stress from the reduction of commutes, saving more money. And because they’ve tasted this, they’re demanding it, they want it. Given that, will incumbents remain as powerful as they’ve always been in drawing and retaining top talent? With the kind of great resignation and turnover that we’re already starting to see, I would be surprised that if in the long run they won’t start seeing people leave. This is the era for employees. The power is in employees’ hands today because of the sheer scale and magnitude of the people who want to retain some kind of work-life flexibility in their professional arrangements. And if they can’t get it here, why not get it elsewhere?\n What a shame, if organizations are not leaning into the gift that virtuality and remote work gives, so that they can ... retain their women\n  Why are some companies asking employees to be in the office all the time, if the pandemic has proved they don’t have to be?\n  It’s this belief and this bias that it is through in-person presence that we are able to connect, to communicate, to collaborate, to learn. It’s this bias that culture building and culture maintenance can only happen in in-person settings. But that is not empirically true. The emphasis of their work is very much process-focused, as opposed to outcome-focused. In order for remote-hybrid to work, people have to change their performance metric, and trust employees, and let go of control, and allow empowered autonomous employees to achieve organizational goals.\n  That makes me think of Apple, which might have to backtrack a little bit on  its work-from-home policy so people don’t quit. We’re in a very tight hiring crunch right now, so employers have to offer more perks like  working from home to attract talent. But what happens when there isn’t a hiring crunch? Do we go back to normal?\n  We may. These things are cyclical, but the cost of turnover for companies is a year and a half of that individual’s salary. Think about that and the institutional memory that walks out the door. And we’re actually seeing early retirements, people who are saying, “We like to be home, we’ve been through this crazy crisis, I don’t want that stress anymore.” The losses of drastic turnover, it’s not just that you’re losing talent. You’re also messing with the culture of your organization. Think about a place where there’s an exodus. That’s not a motivating environment. Not only are there pragmatic losses when someone leaves, but there’s also cultural, social, emotional, psychological blows that companies will take. If I was a company right now, I would fight to keep my best people. Because my best people will ensure that I do well.\n   I’ve been  writing about how working mothers really want to work from home, but they’ve also been having a really hard time doing so, reporting higher rates of stress and burnout. There’s an expectation that women have to both be ideal workers and ideal mothers. Obviously things are extra hard due to the pandemic, but it seems like it’s always been sort of an impossible situation for women. How does remote work fit into that?\n  It’s been bad, but it’s gotten worse. I have been alarmed. US labor statistics data showed that  3 million women have left the workforce [in 2020]. It made my head explode. And then  another survey that looked at the same data was able to identify that almost 600,000 are mothers and caretakers. What a shame, if organizations are not leaning into the gift that virtuality and remote work gives, so that they can take advantage of flex time and flex jobs to retain their women. Or to also incorporate some kind of child care apparatus in order to support mothers. Some of the smart companies that I’ve talked to have done things like, from this time to this time every day we’re actually going to have online programs so that mothers with children between the ages of 5 and 10 can get some kind of respite. We can’t send you babysitters in the middle of a global pandemic, but these companies have found ways to support women and mothers — but these are in the minority.\n We talk about diversity, and gender and women, and then we see amazing women leaving. We have to work hard to bring them back and to reintegrate them into our organizations. Even the pre-pandemic ways of handling young families and professional demands were not great. If I can work from home, my pickup would be much easier than me breaking my neck to get to my child between 5 and whatever time. All of that goes away.\n Folks who have always been out of the mainstream in their organizations suddenly feel like they’re not only at the table, but that no one is calling them the wrong name\n  Working from home can benefit certain groups: people with disabilities, people who were never that good at schmoozing in the office in the first place. Some Black people  say they prefer working from home because they feel a better sense of belonging and experience fewer microaggressions. What does this mean for diversity inclusion? Is working from home the ticket to making a little more equity at work?\n  I think so. Folks who have always been out of the mainstream in their organizations suddenly feel like they’re not only at the table, but that no one is calling them the wrong name. They don’t have to take that psychological commute every day in order to code switch and fit in. Those with physical disabilities, or even neurodiversity challenges and concerns, are finding so much more peace. The lessons we can learn, however, is why is it that people have had these experiences, and what can we do to make changes in our organization so that they have the sense of belonging that they’ve experienced through this remote environment?\n   I’ve made some  really bad predictions, so I want you to make a prediction instead. What is this going to look like in a year or two, or five, from now?\n  Guidelines and the policies will settle. Competencies around flexible workplaces will rise. Individual managers will level up to figure out how to lead a distributed workforce. People will be more agile with using digital tools, so things like tech exhaustion will go away. After people experience the hybrid format, they will settle into a rhythm that really works for them. And I think that we’ll see more remote than in-person days. I also predict that physical spaces — office spaces — will look very different. The remote year has totally influenced what people want:  smart boards, movable furniture, outdoor space for work. So we’re going to see physical spaces of offices look very different than they are today.\n  Millions turn to Vox to understand what’s happening in the news. Our mission has never been more vital than it is in this moment: to empower through understanding. Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.  Please consider making a contribution to Vox today from as little as $3.", "posttime": "2021-07-22 22:46:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "回到,people", "title": "让人们回到办公室的公司将失去员工", "title_en": "Companies that make people return to the office will lose employees", "transed": 1, "url": "https://www.vox.com/recode/22583285/companies-remote-work-home-office-tsedal-neeley-harvard", "via": "", "real_tags": ["回到", "people"]}, {"category": "", "categoryclass": "", "imagename": "eac4f5d2ece2f67de60ec7dd547d078c.jpg", "infoid": 1068968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BlackBuck 首席执行官拉杰什·亚巴吉 (Rajesh Yabaji) 表示，Tribe Capital、IFC 新兴亚洲基金和 VEF 在这家成立 6 年的初创公司中领投了 6700 万美元的 E 系列融资，估值为 10.2 亿美元（高于 2019 年 D 轮融资的约 8.5 亿美元） TechCrunch 在本周早些时候的一次采访中。 BlackBuck 是今年第 16 家成为独角兽的印度初创公司。 BlackBuck 将企业与卡车所有者和货运运营商联系起来。这家初创公司为印度的卡车司机开发了一个简化的应用程序，这些司机通常不太识字，以帮助他们接受工作并使用谷歌地图轻松导航到目的地。在客户端，企业可以启动类似的应用程序来下订单。目前，印度约有 700,000 名卡车司机和 120 万辆卡车连接到该平台，每月交易量超过 1500 万笔。 “印度的卡车司机直到 2019 年才真正实现数字化。从那时起，供应活动增加了 20 倍，”Yabaji 说。 “当我们在 2015 年启动 BlackBuck 时，只有 40% 的卡车车主拥有智能手机，而对于卡车司机来说，采用率仅为 7%。到 2019 年，100% 的卡车车主和 70% 的卡车司机都拥有智能手机，”他说，并将这种增长归因于低成本 Android 智能手机的出现以及更实惠的移动数据的访问（感谢 Jio 平台）。 “最重要的是，政府开始推动数字化采用。现在有一个数字收费系统，许多州政府已经强制要求使用 GPS，”他说。在此期间，BlackBuck 也发生了巨大变化。该平台已从依赖呼叫中心预订订单转变为基于应用程序的系统。今天，Yabaji 表示，这家初创公司减少了对经纪人的依赖，经纪人帮助他们与较小地区的卡车司机联系起来，因为越来越多的卡车司机和车队所有者现在拥有智能手机并可以直接预订。 “在供应方面，该平台的构建方式与订购者无关。任何能够在特定位置和特定时间访问容量的人都可以访问负载。原则上，我们从第一天起就接受了，”他解释说。 “正如我们今天所说，95% 的负载接受发生在拥有两到三辆卡车的小型车队所有者身上。”\n对于 BlackBuck 来说，另一个挑战是打入中小型企业。该平台最大的客户群传统上由大型企业组成。 Yabaji 表示，随着 BlackBuck 近年来看到的最大增长来自中小企业，情况发生了巨大变化。这家初创公司总共拥有超过 10,000 名中小企业和企业客户，其中包括印度斯坦联合利华、信实、可口可乐、亚洲涂料、塔塔、韦丹塔、L&amp;T 和 Jindal 等巨头。 BlackBuck 近年来最大的成功之一是其 FASTag 产品的增长。 （FASTag 是印度的一种电子通行费收费系统，可直接从与其关联的预付或储蓄账户或直接向通行费所有者支付通行费。）Yabaji 表示，今天印度 35% 的卡车运输通行费支出是通过 BlackBuck 进行的。他说：“我们是这一类别的领导者，并为印度卡车司机建立了多种独特的解决方案。 “印度的供应链和物流行业正在从纸笔转向数字化，”Tribe Capital 的联合创始人兼合伙人 Arjun Sethi 在一份声明中表示。 “BlackBuck 衡量产出和生产力增长的能力在很短的时间内简化了该行业的物流挑战。其持续的高速增长有望为印度卡车运输生态系统带来更大的转变。” （顺便说一句，据知情人士透露，Tribe Capital 正在与至少另外两家印度初创公司进行谈判。）BlackBuck 将部署新资金以加深其在印度的影响力，并在其市场上推出多项新功能，亚巴吉说。 BlackBuck 在欧洲也有业务。 Yabaji 表示，这家初创公司的国际业务仍处于试点阶段，目前主要关注点仍是印度。 “在 Covid 大流行期间，Blackbuck 迅速扩展了其在线货运市场和车队管理服务。 IFC 新兴亚洲基金的基金负责人 Saadia Khairi 在一份声明中表示，Blackbuck 对提高印度庞大、分散且主要是无组织的长途货运市场的透明度和效率的贡献具有产生重大发展影响的潜力。此次新投资正值印度初创公司筹集创纪录资金、少数成熟公司开始探索公开市场之际。 BlackBuck 是今年第 16 家成为独角兽的印度初创公司，而去年为 11 家，2019 年为 6 家。", "note_en": "Tribe Capital, IFC Emerging Asia Fund and VEF led the $67 million Series E financing round in the six-year-old startup, valuing it at $1.02 billion (up from  about $850 million in 2019 Series D round), BlackBuck chief executive Rajesh Yabaji told TechCrunch in an interview earlier this week. BlackBuck is the 16th Indian startup to become a unicorn this year.\n BlackBuck connects businesses with truck owners and freight operators. The startup has developed a simplified app for truck drivers in India, who are typically not very literate, to help them accept work and easily navigate to their destination using Google Maps. On the client side, businesses can fire up a similar app to place orders.\n  About 700,000 truckers and 1.2 million trucks in India today are connected to the platform, which sees over 15 million transactions each month. “India’s truckers did not go truly digital till 2019. Since then, the supply activity has gone up by 20 times,” said Yabaji.\n “When we started BlackBuck in 2015, only 40% of truck owners had smartphones and for truck drivers, that adoption was just 7%. By 2019, 100% of truck owners and 70% of truck drivers had smartphones,” he said, attributing this growth to advent of low-cost Android smartphones and access to much more affordable mobile data (thanks to Jio Platforms).\n “On top of this, the government started pushing the digital adoption. There’s a digital toll system now, and many state governments have made GPS mandatory,” he said.\n During this period, BlackBuck, too, has transformed considerably. The platform has moved away from relying on call centres for booking orders to an app-based system. Today, Yabaji said the startup has reduced its reliance on brokers, who help connect them to truckers in smaller regions as more truckers and fleet owners now have smartphones and book directly.\n “On the supply side, the platform was built in a way that it was agnostic to who was ordering. Anyone who has access to capacity in a particular location and at a particular time, has access to the load. On principal, we were okay with it from day 1,” he explained. “As we speak today, 95% of the load acceptance happens by small fleet owners who own two to three trucks.”\n For BlackBuck, another challenge has been making inroads with small and medium-sized businesses. The platform’s biggest customerbase has traditionally comprised of large enterprises. Yabaji said things have changed dramatically as the biggest growth that BlackBuck has seen in recent years has come from SMEs. In total, the startup has over 10,000 customers SME and enterprise customers now including giants such as Hindustan Unilever, Reliance, Coca Cola, Asian Paints, Tata, Vedanta, L&amp;T and Jindal.\n One of the biggest successes of BlackBuck in recent years has been the growth of its FASTag offering. (FASTag is an electronic toll collection system in India to make toll payments directly from the prepaid or savings account linked to it or directly to the toll owner.) Yabaji said 35% of India’s trucking toll spend today happens through BlackBuck.\n “We are the leaders in this category and have built several unique solutions for Indian truckers,” he said.\n “India’s supply chain and logistics industry is moving from paper and pencil to digital,” said Arjun Sethi, cofounder and partner at Tribe Capital, in a statement. “BlackBuck’s ability to measure output and productivity growth has streamlined logistical challenges for the industry over a short time frame. Its continued high velocity growth promises to bring even greater transformation to the Indian trucking ecosystem.”  (On a side note, Tribe Capital is in talks to back at least two more Indian startups, according to people with knowledge of the matter.)\n BlackBuck will deploy the fresh funds to deepen its presence across India and launch several new features on its marketplace, said Yabaji. BlackBuck also has presence in Europe. Yabaji said the startup’s international play is still in its pilot stage and the large focus currently remains on India.\n “In the midst of the Covid pandemic Blackbuck has scaled its online freight marketplace and fleet management services rapidly. Blackbuck’s contribution to increased transparency and efficiency in the large, fragmented and predominantly unorganized long-haul freight market in India offers the potential for significant developmental impact,” said Saadia Khairi, fund head at IFC Emerging Asia Fund, in a statement.\n The new investment comes at a time when Indian startups are raising record capital and a handful of mature firms are beginning to explore the public markets. BlackBuck is the 16th Indian startup to become a unicorn this year, compared to 11 last year and six in 2019.", "posttime": "2021-07-22 22:45:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "印度,blackbuck", "title": "印度的 BlackBuck 在 6700 万美元的融资中价值 10 亿美元", "title_en": "\n\t\t\t\tIndia’s BlackBuck valued at $1 billion in $67 million fundraise\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/21/indias-blackbuck-valued-at-1-billion-in-67-million-fundraise/", "via": "", "real_tags": ["印度", "blackbuck"]}, {"category": "", "categoryclass": "", "imagename": "9f829d6f3aaee47d255fc5667b8c9a3a.jpg", "infoid": 1068967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Oktopost 成立于 2013 年，仅注册了 800,000 美元的早期资金，此后一直保持收入和利润。今天，随着来自伦敦成长股权公司 Expedition Growth Capital 的 2000 万美元少数股权投资的增长融资轮改变了这种情况。 Oktopost 的特点是它是一个企业级平台，供 B2B 营销人员策划内容、组织和管理企业社交媒体帐户、员工宣传和社交销售的活动。它还可以处理社交聆听和分析。它还拥有与 Adob​​e 的 Marketo、Salesforce 的 Pardot、Hubspot 的本地集成； CRM 系统，例如 Salesforce 和 Microsoft Dynamics。 Oktopost 的客户包括富士通、三菱电机、施乐、SWIFT、ACI Worldwide、ContentSquare、ChargeBee 和 SUSE。随着社交媒体用户增加他们的在线互动，上述功能变得更加重要，而且公司需要，客气地说，在过去的 16 个月里，社交媒体“吞噬了世界”，他们需要共同行动。 Oktopost 表示，它计划利用这笔资金推进其产品路线图、促进客户成功、加速营销和销售以及探索战略收购；并将其员工人数增加 50%。 Oktopost 的联合创始人兼首席执行官 Daniel Kushner 表示：“我们从一开始的使命就是建立有史以来第一个 B2B 社交媒体营销平台，能够衡量和量化社交媒体在潜在客户生成、管道影响方面的价值、客户获取，以及最终的投资回报率……随着 B2B 公司内部营销和销售之间的孤岛破裂，以及社交销售变得更加普遍，我们相信 Oktopost 非常适合提供所需的功能。” Expedition Growth Capital 的管理合伙人 Oliver Thomas 表示：“有许多社交媒体工具可以满足 B2C 公司的需求，但在 Oktopost 之前，我们还没有看到专门为 B2B 之旅量身定制的平台。管理、跟踪和分析社交活动的能力越来越成为 B2B 销售和营销组织的必备条件。 Daniel 和 Liad 打造了市场上最好的产品来满足这一需求。他们还建立了很棒的文化，我们很高兴能成为这里旅程的一部分。”在与库什纳交谈时，我问他大流行对业务产生了什么影响。 “它已经变成了香蕉，”他说，“我们的重点是 100% 的 B2B 组织。我们的平台分为企业社交媒体，所以 Twitter、LinkedIn 公司页面等。 第二个是我们所说的员工倡导社交，您希望您的员工成为企业品牌的一部分，员工在个人 LinkedIn 上共享，推特账户、社交信息。”他说，这个生态系统——支持企业社会和员工宣传的平台——意味着他们可以证明客户的投资回报：“他们从做所有这些社交活动中得到了什么？该平台旨在提供这些指标，以显示社交对业务的真正影响，以及它对业务的真正影响。而不仅仅是你通常在社交上获得的绒毛指标。”", "note_en": "Founded in 2013, Oktopost has only ever registered an $800,000 early stage funding, and has run on revenues and profit ever since. Today that changes with a growth funding round of a $20 million minority investment from London-based growth equity firm Expedition Growth Capital.\n Oktopost’s schtick is that it is an enterprise-grade platform for B2B marketers to curate content, organize, and manage campaigns for corporate social media accounts, employee advocacy and social selling. It can also handle social listening and analytics. It also boasts native integrations with Adobe’s Marketo, Salesforce’s Pardot, Hubspot; and CRM systems such as Salesforce, and Microsoft Dynamics. Oktopost’s customer include Fujitsu, Mitsubishi Electric, Xerox, SWIFT, ACI Worldwide, ContentSquare, ChargeBee and SUSE.\n  The above functions have hoved into view with far greater importance as social media users upped their interactions online, and companies needed to, to put it mildly, get their act together asocial media ‘ate the world’ in the last 16 months.\n Oktopost says it plans to use the funding to advance its product roadmap, boost customer success, accelerate marketing and sales, and explore strategic acquisitions; and grow its workforce by 50%.   Daniel Kushner, co-founder and CEO of Oktopost, said: “Our mission from day one was to establish the first ever B2B social media marketing platform with the ability to measure and quantify the value of social media in terms of lead generation, pipeline influence, customer acquisition, and ultimately ROI… As siloes breakdown between marketing and sales within B2B companies, and as social selling becomes more widespread, we believe Oktopost is uniquely suited to provide the functionality desired.”   Oliver Thomas, Managing Partner at Expedition Growth Capital said: “There are a number of social media tools out there catering for B2C companies but we haven’t seen a platform that is specifically tailored to the B2B journey until Oktopost. The ability to manage, track and analyse social activities is increasingly a must-have for B2B sales and marketing organisations. Daniel and Liad have built the best product in the market to serve this need. They have also built a terrific culture and we’re excited to be part of the journey from here.”\n Speaking to Kushner I asked him what effect the pandemic had had on the business.\n “It’s gone bananas,” he said “Our focus is 100% on B2B organisations. Our platform is divided into corporate social media, so Twitter, LinkedIn company pages, etc. The second is what we call employee advocacy social, where you want your employees to be a part of the corporate brand, with employees sharing on a personal LinkedIn, Twitter accounts, social messages.”\n He said that this ecosystem – the platform to support both corporate social and employee advocacy – means they can prove return on investment for customers: “What are they getting from doing all this social? The platform is designed to provide those kind of metrics to show the real business impact of social, the real impact that it has on the business. And not just fluff metrics that you normally get on social.”", "posttime": "2021-07-22 22:45:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "expedition,social,社交", "title": "B2B 社交管理平台 Oktopost 通过 Expedition 筹集了 2000 万美元的增长轮", "title_en": "\n\t\t\t\tB2B social management platform Oktopost raises $20M growth round with Expedition\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/b2b-social-management-platform-oktopost-raises-20m-growth-round-with-expedition/", "via": "", "real_tags": ["social", "社交"]}, {"category": "", "categoryclass": "", "imagename": "3442ddd39001bde142f6c370f5e35464.jpg", "infoid": 1068966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，总部位于伦敦的 Untitled Ventures 计划以 1 亿欧元/1.18 亿美元的资金加入他们的竞争，作为其第二只基金，投资于“拥有东欧创始人的雄心勃勃的深度科技初创公司”。 Untitled 表示，它的目标客户是希望搬迁业务或已经在西欧和美国设立总部的企业家。这与所有其他现有的西方风投一起——根据我的经验——随时准备并愿意倾听俄罗斯和东欧创始人的意见，他们通常以其技术实力而闻名。 Untitled 将瞄准 B2B、人工智能、农业科技、医疗科技、机器人和数据管理初创公司，这些初创公司已经从波罗的海、中东欧和独联体中脱颖而出，或者已经在西欧建立的基金有限合伙人包括 Vladimir Vedeenev，全球网络管理创始人&gt;。 Untitled 还声称拥有 Google、Telegram Messenger、Facebook、Twitch、DigitalOcean、IP-Only、CenturyLinks、Vodafone 和 TelecomItaly 作为合作伙伴。 Untitled Ventures 管理合伙人 Oskar Stachowiak 表示：“拥有超过 10 家独角兽公司，仅 2020 年就有 10 亿欧元的风险投资，以及 Veeam、Semrush 和 Wrike 等成功案例，来自快速增长地区的初创公司是关注的最佳选择我们的早期投资。得益于教育系统对 STEM 的高度关注以及大约 100 万名高技能开发人员，我们有充足的机会寻找和支持该地区的后起之秀。” Untitled Ventures 议员 Konstantin Siniushin 说：“我们相信经济效率，同时我们履行了一项社会使命，即从前苏联经济不稳定的国家引进具有大量科学成分的技术项目，例如，首先、白俄罗斯、俄罗斯和乌克兰，但不仅是在将销售推向世界市场方面，而且不仅是帮助他们进入欧洲总部，以便他们获得下一轮投资。”他补充说：“我们在第一只基金的第一个投资组合中积累了丰富的经验，不仅在卢森堡、德国、英国、葡萄牙、塞浦路斯和拉脱维亚等欧洲国家构建业务，而且还在实际搬迁创业团队，因此他们已经被认为已经完全居住在欧洲和全球。”\n公平地说，从东欧创建大型初创公司仍然比需要的更难，主要是因为当地资本通常很少。然而，随着最近 Vitosha Venture Partners 和 Launchub Ventures 等中东欧基金的推出，以及来自罗马尼亚的 UIPath 的突破性打击，情况正在发生变化。 Untitled Ventures 团队： • Konstantin Siniushin，连续技术企业家 • Oskar Stachowiak，经验丰富的基金经理 • Mary Glazkova，公关和通信资深人士 • Anton Antich，早期投资者和 Veeam 的前副总裁，Veeam 是一家被收购的瑞士云数据管理公司Insight Venture Partners 投资 50 亿美元 • Yulia Druzhnikova，在将科技公司国际化方面经验丰富 • Mark Cowley，在中东欧/俄罗斯从事私人和上市投资工作 20 多年 Untitled Ventures 投资组合亮点 – Fund I • Sizolution：人工智能驱动的规模预测引擎，总部设在德国 • Pure app——自发和非个人约会应用程序，总部设在葡萄牙 • Fixar Global——用于商业用例的高效无人机，总部设在拉脱维亚 • E-contenta——总部设在波兰 • SuitApp——基于人工智能的混合——为时尚零售提供匹配建议，总部设在新加坡 • Sarafan.tech，人工智能驱动的识别，总部设在美国 • 你好，宝贝——父母助理，总部设在美国 • Voximplant——语音、视频和消息金云通信平台，总部设在美国（已退出）", "note_en": "Now, London-based  Untitled Ventures plans to join their fray with a €100 million / $118M for its  second fund to invest in “ambitious deep tech startups with eastern European founders.”\n Untitled says it is aiming at entrepreneurs who are looking to relocate their business or have already HQ’ed in Western Europe and the USA. That’s alongside all the other existing Western VCs who are – in my experience – always ready and willing to listen to Russian and Eastern European founders, who are often known for their technical prowess.\n  Untitled is going to be aiming at B2B, AI, agritech, medtech, robotics, and data management startups with proven traction emerging from the Baltics, CEE, and CIS, or those already established in Western Europe\n LPs in the fund include Vladimir Vedeenev, a founder of Global Network Management&gt;. Untitled also claims to have Google, Telegram Messenger, Facebook, Twitch, DigitalOcean, IP-Only, CenturyLinks, Vodafone and TelecomItaly as partners.\n Oskar Stachowiak, Untitled Ventures Managing Partner, said: “With over 10 unicorns, €1Bn venture funding in 2020 alone, and success stories like Veeam, Semrush, and Wrike, startups emerging from the fast-growing regions are the best choice to focus on early-stage investment for us. Thanks to the strong STEM focus in the education system and about one million high-skilled developers, we have an ample opportunity to find and support the rising stars in the region.”\n Konstantin Siniushin, the Untitled Ventures MP said: “We believe in economic efficiency and at the same time we fulfill a social mission of bringing technological projects with a large scientific component from the economically unstable countries of the former USSR, such as, first of all, Belarus, Russia and Ukraine, but not only in terms of bringing sales to the world market and not only helping them to HQ in Europe so they can get next rounds of investments.”\n He added: “We have a great experience accumulated earlier in the first portfolio of the first fund, not just structuring business in such European countries as, for example, Luxembourg, Germany, Great Britain, Portugal, Cyprus and Latvia, but also physically relocating startup teams so that they are perceived already as fully resident in Europe and globally.”\n To be fair, it is still harder than it needs to be to create large startups from Eastern Europe, mainly because there is often very little local capital. However, that is changing, with the launch recently of CEE funds such as  Vitosha Venture Partners and  Launchub Ventures, and the breakout hit from Romania that was UIPath.\n The Untitled Ventures team: • Konstantin Siniushin, a serial tech entrepreneur • Oskar Stachowiak, experienced fund manager • Mary Glazkova, PR &amp; Comms veteran • Anton Antich, early stage investor and an ex VP of Veeam, a Swiss cloud data management company acquired by Insight Venture Partners for $5bln • Yulia Druzhnikova, experienced in taking tech companies international • Mark Cowley, who has worked on private and listed investments within CEE/Russia for over 20 years\n Untitled Ventures portfolio highlights – Fund I •  Sizolution: AI-driven size prediction engine, based in Germany •  Pure app – spontaneous and impersonal dating app, based in Portugal •  Fixar Global –  efficient drones for commercial use-cases, based in Latvia, •  E-contenta – based in Poland •  SuitApp – AI based mix-and-match suggestions for fashion retail, based in Singapore •  Sarafan.tech, AI-driven recognition, based in the USA •  Hello, baby – parental assistant, based in the USA •  Voximplant – voice, video and messaging cloud communication platform, based in the USA (exited)", "posttime": "2021-07-22 22:45:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,加入,ventures,总部", "title": "Untitled Ventures 以 1.18 亿美元的资金加入俄罗斯和东欧初创公司的争夺战", "title_en": "\n\t\t\t\tUntitled Ventures joins the scramble for Russian & Eastern European startups with a $118M warchest\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/untitled-ventures-joins-the-scramble-for-russian-eastern-european-startups-with-a-118m-warchest/", "via": "", "real_tags": ["俄罗斯", "加入", "ventures", "总部"]}, {"category": "", "categoryclass": "", "imagename": "57618879f5d17a38aa9a5336dcaf932b.jpg", "infoid": 1068965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与上一轮融资相比，这个价格是一个非常可观的飞跃，当时消息人士告诉我们这家初创公司的估值约为 5 亿美元。 （由于 Visa 已经拥有该公司的股权，其实际支付的金额将减少该金额。） CurrencyCloud 在 180 个国家/地区拥有约 500 名客户，这些客户使用其 API 为多币种钱包、货币兑换服务和账户管理提供支持，包括一些最大的初创公司，如 Monzo、Moneze、Starling、Revolut 和 Dwolla。这些将继续进行，除此之外，Visa 将利用这家初创公司的技术来加强自己的货币兑换渠道，为自己的客户提供更广泛的服务，包括金融机构、金融科技等，并建立新服务对于消费者也是如此。 “在 Currencycloud，我们一直致力于为所有人创造更美好的明天，从最小的初创公司到全球跨国公司。随着我们加入 Visa，重新想象资金如何围绕全球经济流动变得更加令人兴奋，” Currencycloud 首席执行官 Mike Laven 在一份声明中表示。 “Currencycloud 的金融科技专业知识和 Visa 的网络相结合，将使我们能够为跨境资金转移的企业提供更大的客户价值。”汇款和货币转账将成为金融服务领域的大生意，而且这种机会正在增长。推动这一趋势的两个因素是电子商务已经远远超出了我们的国界，尤其是在过去的 18 个月中，供应链也是如此。 （Visa 指出，2020 年全球约有 43% 的小企业进行了某种形式的国际贸易。）随着基于云的移动服务的兴起以促进交易，消费者的前景也变得更加全球化。与此同时，汇款和货币转账是两个可能被颠覆的领域，现有服务往往成本高昂且效率低下。所有这些都为像 CurrencyCloud 这样的公司奠定了基础，该公司已经构建了一种新的货币转移实现，可以嵌入到其他金融服务中，帮助它们更顺畅地运行。退出也是一个典型的例子，说明较大的、现有的金融巨头通常发现创新和跳入新服务更难，所以他们转而利用规模较小、更灵活的初创公司，这些初创公司在技术上押下大赌注，并取得成功，以帮助推动自己进入下一代金融服务。 Visa 是否能够成功整合和使用 CurrencyCloud 的技术并与其团队合作，这两件事已经过测试：在这笔交易之前，两人是战略合作伙伴。\n“收购 Currencycloud 是 Visa 执行我们的网络战略以促进全球资金流动的另一个例子，”Visa 全球财务主管科琳·奥斯特罗夫斯基 (Colleen Ostrowski) 在一份声明中说。 “消费者和企业在进行或接收国际支付时越来越期望透明度、速度和简单性。通过收购 Currencycloud，我们可以支持我们的客户和合作伙伴进一步减少跨境支付的痛点，并为他们的客户开发出色的用户体验。”", "note_en": "This price is a very decent leap from that last funding round, when sources told us the startup was valued at around $500 million.\n (As Visa already has equity in the company, the amount it will actually pay will be reduced by that amount.)\n  CurrencyCloud has some 500 customers in 180 countries that use its APIs to power multi-currency wallets, currency exchange services, and account management, including some of the biggest startups around such as Monzo, Moneze, Starling, Revolut and Dwolla. These will continue, and on top of that Visa will use the startup’s technology to bolster its own currency exchange rails to provide a wider set of services to its own customers, which include financial institutions, fintechs and more, as well as to build new services for consumers as well.\n “At Currencycloud, we’ve always strived to deliver a better tomorrow for all, from the smallest start-up to the global multi-nationals. Re-imagining how money flows around the global economy just got more exciting as we join Visa,” said Mike Laven, CEO, Currencycloud, in a statement. “The combination of Currencycloud’s fintech expertise and Visa’s network will enable us to deliver greater customer value to the businesses moving money across borders.”\n Remittance and currency transfers to be big business in the world of financial services, and that opportunity is growing. Two of the factors driving this are that e-commerce has extended well outside of our national borders, especially in the past 18 months, and so have supply chains. (Visa notes that some 43% of all small businesses globally carried out some form of international trade in 2020.) And with the rise of cloud-based, mobile services to facilitate transactions, consumers are ever more globalised in their outlooks, too.\n At the same time, remittances and currency transfers are two areas ripe for disruption, with incumbent services often costly and inefficient. All of this sets the stage for a company like CurrencyCloud, which has built a new implementation of currency transfer that can be embedded into other financial services to help them run more smoothly.\n The exit is also a classic example of how larger, incumbent financial powerhouses typically find it harder to innovate and jump into new services, so instead they tap smaller and more agile startups that are taking big bets on technology, and pulling it off, to help propel themselves into the next generation of financial services. Whether Visa will be able to successfully integrate and use CurrencyCloud’s tech and work with its team are two things that were already tested out: the two were strategic partners prior to this deal.\n “The acquisition of Currencycloud is another example of Visa executing on our network of networks strategy to facilitate global money movement,” said  Colleen Ostrowski, Visa’s Global Treasurer, in a statement. “Consumers and businesses increasingly expect transparency, speed and simplicity when making or receiving international payments. With our acquisition of Currencycloud, we can support our clients and partners to further reduce the pain points of cross-border payments and develop great user experiences for their customers.”", "posttime": "2021-07-22 22:45:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,currency", "title": "Visa 以 9.63 亿美元的价格收购了 Currencycloud，后者为汇款和货币转账提供 API", "title_en": "\n\t\t\t\tVisa acquires Currencycloud, which makes APIs for remittances and currency transfers, in a $963M deal\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/visa-acquires-currencycloud-which-makes-apis-for-remittances-and-currency-transfers-in-a-963m-deal/", "via": "", "real_tags": ["收购", "currency"]}, {"category": "", "categoryclass": "", "imagename": "7029f81372b34a2611f5e87e54b78760.jpg", "infoid": 1068964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "输入分配。该公司由 Samir Kaji 和 Hana Yang 于 2021 年 2 月创立，正在开发一种风险投资基金投资方法，为任何规模的投资者提供参与方式。周四，这家总部位于旧金山的公司宣布从 Urban Innovation Fund、Tusk Venture Partners、Basis Set Ventures、Liquid2 Ventures、Fika Ventures、Ulu Ventures 和 Anthemis Group 等支持者那里筹集了 500 万美元的种子资金。两人以考夫曼研究员的身份相识，两人都具有金融服务背景。当他们见面时，杨正在非营利领域工作，并说他们开始谈论非营利领域和风险投资领域之间的摩擦。然后杨加入了第一共和银行的Kaji，一起工作并继续谈话。 Kaji 援引波士顿咨询集团的一份报告估计，全球有 8,000 至 11,000 个家族办公室和近 1,700 万名合格投资者，目前控制着约 42 万亿美元的资产。他们认为这个问题与供需有关：在供应方面，机构投资者数量有限，“他们的舞卡已满，”Kaji 告诉 TechCrunch。基金经理想要获得非传统的捐赠资金，并正在寻找家族办公室，但找到这些人是一个挑战。与此同时，在需求方面，家族办公室难以接触风险投资公司——他们不知道去哪里寻找经理，没有时间培养这些关系，或者无法做出传统的 100 万美元承诺。因此，Kaji 和 Yang 决定启动 Allocate，为任何规模或背景的散户投资者提供一种投资基金和管理人员寻找家族办公室的方式，以此开启风险投资的下一个时代。\nAllocate 平台根据投资目标为财富顾问、家族办公室和合格个人投资者策划风险基金产品，任何投前和投后交易和报告活动均在平台上完成。该公司建立了自己的连接工具来聚合投资者资本，从而降低最低投资额，并且基金经理可以轻松管理资本。然后，它每年都会对所进行的投资收取费用。目前，投资者可以选择他们想要投资的基金，但 Kaji 表示，Allocate 最终也将提供类似于基金基金的产品，其中投资进入一个将由基金经理投资的罐子。该公司没有收入，并表示将利用新资金来构建其产品并在明年招聘一些关键员工，因为它为年底正式的软件产品发布做准备。它已经吸引了数百名基金经理和投资者的候补名单。 “随着市场的发展，到 2025 年，合格投资者的数量预计将增长 50%，”Kaji 说。 “这是打开市场并让人们参与的巨大机会。” Tusk Ventures 的联合创始人兼管理合伙人 Jordan Nof 对此表示赞同。他看到许多经济增长发生在公共市场之外，并且出现了可供人们利用的机会。他告诉 TechCrunch，由于基金经理和潜在投资者之间的准入问题，有数万亿美元处于观望状态。通过 Allocate，Nof 看到了一种方法，可以通过工具将双方联系起来，以便双方做出合理的决策并进一步发展风险投资。\n“我认识 Samir 已经有一段时间了，他和他的团队了解这个问题集，他们对风险投资的未来有一个愿景，”他补充道。 “这是一个家庭手工业，尽管 VC 负责影响最大的科技公司，这些公司已经采取了 VC，但它仍然是一个非常分散的行业，没有透明度。 Allocate 是真正的平台的下一个过渡，它使家族办公室和高净值个人能够访问。”", "note_en": "Enter  Allocate. The company, founded by Samir Kaji and Hana Yang in February 2021, is developing an approach to venture capital fund investing that provides a way for investors of any size to participate.\n On Thursday, the San Francisco-based company announced it raised $5 million in seed funding from a group of backers including Urban Innovation Fund, Tusk Venture Partners, Basis Set Ventures, Liquid2 Ventures, Fika Ventures, Ulu Ventures and Anthemis Group.\n  The pair met as Kauffman Fellows, both with backgrounds in financial services. By the time they met, Yang was working in the nonprofit world, and said they began talking about the friction between the nonprofit and venture capital worlds. Then Yang joined Kaji at First Republic Bank to work together and continue the conversation.\n Kaji,  citing a Boston Consulting Group report, estimated there are between 8,000 and 11,000 global family offices and nearly 17 million accredited investors that currently control some $42 trillion in assets.\n They saw the issue as it related to supply and demand: On the supply side, there are a finite number of institutional investors, “all with their dance cards full,” Kaji told TechCrunch. Fund managers want to get at that nontraditional endowment money and are looking at family offices, but finding those individuals is a challenge.\n Meanwhile, on the demand side, family offices have trouble accessing venture capital firms — they don’t know where to look to find managers, don’t have time to cultivate those relationships or can’t make the traditional $1 million commitments.\n As a result, Kaji and Yang decided to start Allocate as a way to usher in the next era of venture capital by creating a way for retail investors of any size or background to invest in funds and for managers to find family offices.\n Allocate’s platform curates venture fund products for wealth advisors, family offices and qualified individual investors based on their investment objectives, and any pre- and post-investment transactions and reporting activities are completed on the platform.\n The company sets up its own feeder vehicles that aggregate investor capital so that there are lower minimum investments and that capital can easily be managed by fund managers. It then charges a fee, on an annual basis, on investments made.\n Currently, investors can choose the funds they want to invest in, but Kaji said Allocate will eventually also offer products that will be like funds of funds, where investments go into a pot that will be invested by a fund manager.\n The company is pre-revenue and said it will use the new funding to build out its product and make some key hires over the next year as it gears up for a formal software product launch at the end of the year. It is already attracting a waitlist of several hundred fund managers and investors.\n “With the market the way it is, the number of accredited investors is expected to grow by 50% by 2025,” Kaji said. “There is a huge opportunity to unlock the market and have people participate.”\n Jordan Nof, co-founder and managing partner at Tusk Ventures, agrees. He sees a lot of economic growth taking place outside the public market, and opportunities present themselves for someone to capitalize on.\n Due to the access issue between fund managers and potential investors, there are trillions of dollars sitting on the sidelines, he told TechCrunch. With Allocate, Nof saw a way to bridge the two parties with tools for both sides to make sound decisions and further evolve venture capital.\n “I have known Samir for quite some time, and he and his team understand this problem set and they have a vision of what the venture capital future looks like,” he added. “This is a cottage industry even though VC is responsible for impacting the largest of technology companies, which have taken VC, yet it is a still super fragmented industry that has no transparency. Allocate is the next transition of a true platform that enables family offices and high-net worth individuals access.”", "posttime": "2021-07-22 22:45:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,venture,投资者", "title": "向银行拨款 500 万美元以开放风险投资基金准入", "title_en": "\n\t\t\t\tAllocate banks $5M to open up venture capital fund access\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/allocate-banks-5m-to-open-up-venture-capital-fund-access/", "via": "", "real_tags": ["风险投资", "venture", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "76b8851708ecdd9c85eb6059051e0723.jpg", "infoid": 1068963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这里，它意味着参考这家总部位于纽约的公司所认为的与日益拥挤的市场的主要区别。米尔斯将其描述为“娱乐和健身相遇的地方。人才是关键。也不能施展可以提供出色锻炼的人才，但他们也拥有 X Factor。他们有能力穿过屏幕，让你有宾至如归的感觉。”该公司也一直在培养一批有影响力的人，包括 Kelly Ripa、Kate Hudson 和 Tiffany Haddish，后者参与了公司今天宣布的 1500 万美元的 A 轮融资。 “资本实际上是关于几个关键业务发展计划中的团队成长和意识，”Mullett 说。 “在当前的环境下，每个人都在谈论他们的各种家庭锻炼，你肯定需要资源来成长。所以这一轮是让奥贝出现在尽可能多的人面前。”本轮融资由 CAVU Venture Partners 领投，Athleta、Samsung Next、Wheelhouse Entertainment 和 WW International, Inc. 以及之前的投资者 Cassius Ventures、Ludlow Ventures、Harris Blitzer Sports Entertainment 和 BDMI 参投。这是一个非常多样化的政党名单，对该平台的兴趣多种多样——以三星为例，该公司目前在其智能电视上提供 Obé 平台。用户还可以在 iOS 和 Android 设备上访问它，并相应地将其投射到他们的电视机上。 Obé（发音为“Obey”）自称为“优质”服务。 27 美元，肯定是高端产品，与每月 10 美元的 Apple Fitness+ 或 Peleton 的 13 美元月费相比。与附有专有设备的 Peloton 不同，Obe 实际上在发布时完全跳过了这些设备，尽管它已经慢慢扩展其产品范围，以包括自由重量和蹦床等弹跳课程——这些设备在较小的空间中更宽容一些。该公司成立于 2018 年，在大流行期间用户大幅增加。虽然 Obé 没有透露订阅人数，但其创始人告诉我，该平台的用户群去年增长了 4 倍。\n“我们三年半前创办了这家公司，”穆莱特说。 “当 COVID 在 2020 年 3 月袭来时，我们的团队、我们的人才、我们的界面——每个人都准备好迎接新用户的涌入，他们需要通过运动和在困难时期让他们保持灵感、理智和自信的人来满足。时间。”", "note_en": "Here it’s meant to be a reference to what the New York-based company sees as its principle differentiator from an increasingly crowded market. Mills describes it as “where entertainment and fitness meet. Talent is key to that. Not also being able to cast talent that can deliver a great workout, but they also have that X Factor. They have the ability to reach across the screen and make you feel something at home.”\n The company has been building up an audience of influencers as well, including Kelly Ripa, Kate Hudson and Tiffany Haddish, the latter of whom participated in the $15 million Series A the company is announcing today.\n  “The capital is really about team growth and awareness in a couple of key business development initiatives,” says Mullett. “In the current climate, where everyone is talking about their various home workouts, you definitely need resources to grow. So this round is about getting Obé in front of as many people as possible.”\n The round was led by CAVU Venture Partners and features Athleta, Samsung Next, Wheelhouse Entertainment and WW International, Inc., along with previous investors Cassius Ventures, Ludlow Ventures, Harris Blitzer Sports Entertainment and BDMI.\n  It’s a pretty diverse list of parties with a diverse list of interests in the platform — take Samsung, which currently offers the Obé platform on its smart TVs. Users can also access it on iOS and Android devices and cast it accordingly to their TV sets.\n Obé (pronounced “Obey”) bills itself as a “premium” service. At $27, it’s certainly at the higher end, verses offerings like the $10/month Apple Fitness+ or Peleton’s $13 monthly fee. Unlike Peloton, which has proprietary equipment attached, Obé actually skipped the equipment altogether at launch, though it has slowly expanded its offerings to include things like free weights and trampolines for its bounce classes — equipment that’s a bit more forgiving in smaller spaces.\n Founded in 2018, the company saw a large increase in users during the pandemic. While Obé doesn’t disclose subscriber counts, its founders told me the platform’s userbase increased 4x last year.\n “We started this company three and a half years ago,” says Mullett. “When COVID hit in March of 2020, our team, our talent, our interface — everyone was ready to receive the rush of new users who needed to be sated by movement and by someone who could keep them inspired, sane and confident during a difficult time.”", "posttime": "2021-07-22 22:44:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "fitness", "title": "Obé Fitness 为其个性驱动的锻炼平台筹集了 1500 万美元", "title_en": "\n\t\t\t\tObé Fitness raises $15M for its personality-driven exercise platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/obe-fitness-raises-15m-for-its-personality-driven-exercise-platform/", "via": "", "real_tags": ["fitness"]}]