[{"category": "", "categoryclass": "", "imagename": "e07f2b3ac7374203ad841f5dc1454522.jpg", "infoid": 1014348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在谷歌工作了15年后，斯里达尔·拉马斯瓦米(Sridhar Ramaswamy)想要退出广告业务。他认为摆脱广告正是搜索引擎所需要的。\n你可以在谷歌上搜索一下。二十年来，各公司一直在努力打造更好的搜索引擎，现在互联网的墓地里挤满了潜在的竞争对手。即使是轰动一时的大片，市场占有率也只有1%或2%。然而，公司一直在尝试，因为机会是如此之大：eMarketer预测，今年搜索广告市场将达到647.2亿美元，到2023年将达到860.6亿美元。在这个行业中，即使是个位数的市场份额也会造就一家价值10亿美元的公司。\nSridhar Ramaswamy比大多数人更了解这一点。在他15年的谷歌生涯结束时，他负责该公司的整个广告部门。我在他们15人的时候加入了那个团队，他最近在Zoom上告诉我，当我离开的时候，我管理着一个超过1万人的团队。这太疯狂了。考虑到他对广告业务的内幕知识和长期的搜索经验，他将是为自己咬下一大块市场的最佳候选人。\n相反，拉马斯瓦米却在做相反的事情：他正在建立一个完全没有广告的搜索引擎。它被称为Neeva，而且它是一个豪赌，谷歌数十亿用户中的一些人认为搜索足够重要，谷歌的问题也越来越多，他们将每月支付Neeva(未公布)的价格购买搜索引擎。这是一个很大的赌注，因为谷歌数十亿用户中的一些人认为搜索足够重要，而谷歌的问题也越来越多，他们将每月支付Neeva(未公布)的价格购买搜索引擎。更重要的是，重塑搜索与击败PageRank的关系不大，更多的是修复用户体验，首先是将搜索结果放回搜索结果的首位。\nRamaswamy说，搜索太重要了，不能降到充满广告的页面的底部。它是为数不多的天然消费者聚集点之一。这是一种奇特的说法，一个非常庞大的用户群体能够可靠地去的地方并不多。对拉马斯瓦米来说，它感觉就像是一款产品因其商业模式而变得更糟。我们看到了广告给任何企业带来的压力，他说，他指的是自己和联合创始人维韦克·拉古纳坦(Vivek Raghunathan)，后者曾是YouTube的货币化高管。我们也可以预见未来：谷歌搜索通常会有更多的广告，而不是更少。\n他没有错。多年来，谷歌一直在其产品中增加广告时段，同时也在寻找使广告和有机结果看起来更相似的方法。今年早些时候，谷歌做出了一项改变，使两者几乎无法区分，但在从研究人员到国会议员的每个人都指责谷歌误导搜索者后，谷歌取消了这一改变。谷歌总是在试图展示最好的结果和试图让人们点击广告之间左右为难。广告通常会赢。\nNeeva的创始人认为，通过将商业模式从广告转向订阅，他们可以激励自己建立一个优先考虑隐私、用户体验和简单性的搜索引擎，而不是规模、规模和规模。但这并不是说拉马斯瓦米对广告业务改变了主意。只是广告挡住了道路，随着它们的消失，在搜索领域有了各种各样的发挥空间。\n例如，大多数购物都是从搜索开始的，所以Neeva致力于以更有帮助的方式呈现搜索结果，而不是将空间出租给出价最高的人。他们优先选择口碑良好的评论网站，展示大量图片，并让人们设定价格警报。事实上，我们不必展示广告，拉马斯瓦米说，而我们有整个页面作为我们所能想象的画布吗？“。我们对此感到超级兴奋。\nNeeva没有尝试从头开始建立搜索基础设施，而是选择使用必应的搜索API来获得基本结果。他们还与一些与谷歌和必应相同的来源合作，将股票价格、维基百科信息、地图等信息公之于众。因此，从根本上说，尼瓦的搜索结果与竞争对手没有太大不同。\n尼瓦想要做的就是在这些基础上进行创新。他说，当你在一个地区工作很长一段时间后，你得到的是把问题分解成碎片的能力，找出哪些是最有趣的，然后去投资。他正努力专注于Neeva&#28人的团队现在能做些什么，但他确切地知道要驯服无穷无尽的搜索结果领域需要做多少工作。目前，他特别专注于购物，但Neeva也在优化Stack Overflow搜索，为软件工程师创建一种更简单的方式来获取信息，并计划以同样的方式接近其他利基市场。\n这就是尼瓦的计划从对未来的狂热乐观转变为近乎纵容的东西的地方。看，谷歌的商业模式不允许它与Neeva竞争。它无法摆脱广告，因为广告是它的全部业务。谷歌锁定在寻求更大增长的道路上，想方设法让用户点击更多的广告，收集更多的数据。就像嘿处理电子邮件一样，尼瓦并不只是想做科技巨头没有做的事情。它在寻找他们根本不能做的事情。\nNeeva最不同寻常的功能是它还可以搜索用户的个人文件。在一个演示中，Ramaswamy搜索了税务文件和照片，所有这些都出现在他的搜索结果中，或者都可以在Neeva界面的个人标签中找到。随着人们的文档和信息在服务中传播，Neeva并不是唯一一家试图将它们整合在一起的公司，但Neeva的理论再次表明，搜索是解决这一问题的完美场所。它的书签功能还将个人文档和网络文档结合在一起，因此用户可以将所有内容存储在一起。通过将两者结合起来，Neeva希望成为用户在寻找任何东西时去的地方，无论它是什么或在哪里。这就是你如何让你的应用程序成为一种习惯，你实际上如何去打破我们对谷歌的集体肌肉记忆。\nNeeva要导航的一个棘手问题是它如何处理用户数据。虽然它不销售广告或用户数据，但它仍计划存储有关用户的信息，以帮助改进产品。默认情况下，它一次将这些数据保存90天，但拉马斯瓦米表示，他仍在考虑如何准确地处理用户数据和隐私。随之而来的问题还有节制、错误信息，以及任何搜索引擎在用户的互联网体验中扮演的角色。拉马斯瓦米说，他对此也没有一个大的统一理论，但他希望这种商业模式在这里也能得到尼瓦的青睐。我们希望您知道您的数据为您服务，无论是您的行为数据，还是您附加到Neeva上的东西，都要有一定程度的安全性。\n最终，拉马斯瓦米说，他认为身份和信任是整个Neeva体验的一部分。他说，接受新闻推荐。人们在任何登录产品中都会担心的一个问题是，嘿，你是不是要进入一个兔子洞，你会创造一个回音室吗？也许Neeva的用户应该能够分享他们自己的新闻馈送，或者跳到其他人身上，体验其他人对互联网的看法。但是，还有很多东西需要弄清楚。\nNeeva&39；目前处于封闭测试阶段，计划在明年初更广泛地推出。拉马斯瓦米似乎感觉到他做这件事的时机是对的，因为谷歌受到了比以往任何时候都更多的审查。他认为，如果尼瓦能够在接下来的两年里培养出100万付费订户，那么他就走上了正确的道路--100万人非常关心搜索的工作方式以及他们的数据收集和使用的方式。他试图通过不与谷歌竞争来与谷歌竞争。这可能是唯一的办法。", "note_en": "Power   After 15 years at Google, Sridhar Ramaswamy wanted out of the ad business. And he thinks getting out of ads is exactly what search engines need.\n     You can&#39;t out-Google Google. For two decades, companies have tried to build a better search engine, and now the internet graveyard is filled with would-be competitors. Even the smash successes only get to 1% or 2% market share. Yet companies keep trying because the opportunity is so large: eMarketer  predicted the search-ad market will be $64.72 billion this year, and $86.06 billion by 2023. In that business, even single-digit market share mints a billion-dollar company.\n  Sridhar Ramaswamy knows this better than most. At the end of his 15-year run at Google, he was in charge of the company&#39;s entire advertising division. &#34;I joined that team when they were 15 people,&#34; he told me recently over Zoom, &#34;and when I left, I was managing a team of over 10,000 people. It was crazy.&#34; Given his inside knowledge of the ads business and long experience in search, he&#39;d be a prime candidate to go bite off a chunk of the market for himself.\n  Instead, Ramaswamy is doing the opposite: He&#39;s building a search engine with no ads at all. It&#39;s called  Neeva, and it&#39;s a big bet that some subset of Google&#39;s billions of users believe search is important enough, and Google increasingly problematic enough, that they&#39;ll pay Neeva&#39;s (unannounced) monthly price for a search engine. More than that, it&#39;s a big bet that reinventing search has less to do with beating PageRank and more to do with fixing the user experience, starting by putting search results back at the top of search results.\n Search is too important to relegate to the bottom of an ad-filled page, Ramaswamy said. &#34;It&#39;s one of the few natural consumer aggregation points. That&#39;s a fancy way of saying, there are not many places that a very large set of users will reliably go to.&#34; And to Ramaswamy, it felt like a product being made worse by its business model. &#34;We saw the pressure that ads put on any business,&#34; he said, referring to himself and co-founder Vivek Raghunathan, a former YouTube monetization executive. &#34;We could also foresee a future: Usually there are more ads on a Google search, not less.&#34;\n  He&#39;s not wrong. Google has been adding ad slots to its product for years, while also looking for ways to make ads and organic results look more alike. It made one change earlier this year that made the two virtually indistinguishable, but then rolled back the change after everyone from researchers to members of Congress  accused Google of misleading searchers. Google is forever stuck between trying to surface the best results and trying to get people to click on ads. Ads usually win.\n  The Neeva founders figured that by inverting the business model from ads to subscriptions, they could incentivize themselves to build a search engine that prioritized privacy, user experience and simplicity instead of scale, scale and scale. But it&#39;s not that Ramaswamy had a change-of-heart epiphany about the ad business. It&#39;s just that ads get in the way, and with them gone there&#39;s all kinds of room to play in search.\n Search is where most shopping starts, for instance, so Neeva has worked on more-helpful ways to present search results rather than renting space to the highest bidder. They prioritize well-regarded review sites, show lots of pictures and let people set price alerts. &#34;The fact that we don&#39;t have to show ads,&#34; Ramaswamy said, &#34;and we have the entirety of the page as a canvas for what we can imagine? We&#39;re super excited about that.&#34;\n Rather than try to build a search infrastructure from scratch, Neeva instead opted to use Bing&#39;s search API for its basic results. They&#39;re also working with some of the same sources as Google and Bing, to surface things like stock prices, Wikipedia information, maps and the like. So, fundamentally, Neeva&#39;s search results won&#39;t be much different than the competition&#39;s.\n  What Neeva&#39;s trying to do is innovate on top of those basics. &#34;The thing you get when you work in an area for a long time is the ability to slice and dice the problem, figure out which ones are the most interesting, and go invest in them,&#34; he said. He&#39;s trying to stay focused on what Neeva&#39;s 28-person team can do right now, but he knows exactly how much work it will take to tame the endless realm of search results. Right now, he&#39;s focused on shopping in particular, but Neeva&#39;s also optimizing Stack Overflow search to create a simpler way for software engineers to get information and plans to approach other niches the same way.\n This is where Neeva&#39;s plan goes from wild optimism about the future to something almost conniving. See, Google&#39;s business model won&#39;t allow it to compete with Neeva. It can&#39;t get rid of ads because ads are its whole business. Google&#39;s locked into a path of seeking ever more growth, finding ways to get users to click on ever more ads, collecting ever more data. Like  Hey did with email, Neeva isn&#39;t just seeking to do things the tech giants aren&#39;t doing. It&#39;s looking for things they can&#39;t do at all.\n Neeva&#39;s most unusual feature is its ability to also search users&#39; personal files. In a demo, Ramaswamy searched for tax documents and photos, all surfaced within his search results or available in a Personal tab in the Neeva interface. As people&#39;s documents and information get spread around services, Neeva&#39;s  not the only company trying to bring them together, but again, Neeva&#39;s theory is that search is a perfect place to solve this problem. Its bookmarking feature also combines personal and web documents, so users can store everything together. By combining both, Neeva hopes to become the place users go when they&#39;re looking for anything, no matter what or where it is. That&#39;s how you make your app a habit, how you might actually go about breaking our collective Google muscle memory.\n  One tricky thing for Neeva to navigate will be how it handles user data. While it doesn&#39;t sell ads or user data, it still plans to store information about users to help improve the product. By default, it holds that data for 90 days at a time, but Ramaswamy said he&#39;s still thinking through exactly how to handle user data and privacy. With that, too, comes questions about moderation, misinformation, and the role any search engine plays in a user&#39;s experience of the internet. Ramaswamy said he doesn&#39;t have a grand unified theory of this yet either, but he hopes the business model works in Neeva&#39;s favor here, too. &#34;We want there to be a degree of security in you knowing that your data serves you, whether it&#39;s your behavioral data, or the things you attach to Neeva.&#34;\n Ultimately, Ramaswamy said he sees identity and trust as part of the whole Neeva experience. &#34;Take news recommendations,&#34; he said. &#34;One worry people have in any signed-in product is hey, are you going into a rabbit hole, will you create an echo chamber?&#34; Maybe Neeva users should be able to share their own news feeds, or pop into others, to experience how someone else sees the internet. But there, too, there&#39;s still plenty to figure out\n  Neeva&#39;s in closed beta for now, with plans to launch more broadly early next year. Ramaswamy seems to sense that he&#39;s doing this at the right time, as Google comes under more scrutiny than ever before. He figures that he&#39;ll be on the right track if Neeva can carve out, say, a million paid subscribers in the next two years — a million people who care enough about the way search works and the way their data is collected and used. He&#39;s trying to compete with Google by not competing with Google. Which might be the only way to do it.", "posttime": "2020-07-27 09:11:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,计划,plan,搜索", "title": "一家公司计划打造谷歌无与伦比的搜索引擎", "title_en": "One company's plan to build a search engine Google can't beat", "transed": 1, "url": "https://www.protocol.com/neeva-search", "via": "", "real_tags": ["google", "谷歌", "计划", "plan", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "33db43d61428c5b5b56d7a97013ce270.jpeg", "infoid": 1014347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莫斯科(路透社)-俄罗斯总统弗拉基米尔·普京(Vladimir Putin)周日表示，俄罗斯海军将配备高超声速核打击武器和水下核无人机，国防部表示，这些武器已进入最后测试阶段。\n普京说，他不想进行军备竞赛，他经常谈到俄罗斯的新一代核武器，他说这种武器是无与伦比的，可以打击世界上几乎任何地方。一些西方专家质疑他们的先进程度。\n这些武器中有一些尚未部署，包括专为潜艇携带的波塞冬水下核无人机，以及可部署在水面舰艇上的齐尔孔(Zircon)高超声速巡航导弹。\n高超声速导弹的速度、机动性和高度相结合，能够以超过音速五倍的速度飞行，这使得它们很难跟踪和拦截。\n普京在圣彼得堡举行的一年一度的海军阅兵式上表示，海军的能力正在增强，今年将获得40艘新舰艇。阅兵式展示了俄罗斯最好的舰艇、核潜艇和海军航空。\n他没有具体说明何时会收到新的高超声速武器，但暗示这一天越来越近。\n普京说：“广泛部署世界上无与伦比的先进数字技术，包括高超声速打击系统和水下无人机，将给舰队带来独特的优势和增强的作战能力。”\n在通过俄罗斯新闻机构发布的另一份声明中，俄罗斯国防部表示，第一艘能够搭载波塞冬无人机的潜艇贝尔哥罗德号(Belgorod)的测试正在进行中，武器系统的测试接近完成。\n“为海军制造现代武器系统的工作正在顺利完成，”它被援引的话说。\n普京去年威胁称，如果美国采取行动在欧洲部署中程核武器，将在潜伏在美国领海以外的船只和潜艇上部署高超声速导弹。", "note_en": "MOSCOW (Reuters) - Russian President Vladimir Putin said on Sunday the Russian Navy would be armed with hypersonic nuclear strike weapons and underwater nuclear drones, which the defence ministry said were in their final phase of testing.\n Putin, who says he does not want an arms race, has often spoken of a new generation of Russian nuclear weapons that he says are unequalled and can hit almost anywhere in the world. Some Western experts have questioned how advanced they are.\n The weapons, some of which have yet to be deployed, include the Poseidon underwater nuclear drone, designed to be carried by submarines, and the Tsirkon (Zircon) hypersonic cruise missile, which can be deployed on surface ships.\n The combination of speed, manoeuvrability and altitude of hypersonic missiles, capable of travelling at more than five times the speed of sound, makes them difficult to track and intercept.\n Speaking in St Petersburg at an annual naval parade that showcases Russia’s best ships, nuclear submarines and naval aviation, Putin said the navy’s capabilities were growing and it would get 40 new vessels this year.\n He did not specify when it would receive new hypersonic weapons, but suggested that day was drawing closer.\n “The widespread deployment of advanced digital technologies that have no equals in the world, including hypersonic strike systems and underwater drones, will give the fleet unique advantages and increased combat capabilities,” Putin said.\n In a separate statement released via Russian news agencies, the defence ministry said testing of the Belgorod, the first submarine capable of carrying the Poseidon drones, was underway and testing of the weapons systems was nearing completion.\n  “Work is being successfully completed to create modern weapons systems for the Navy,” it was cited as saying.\n Putin last year threatened to deploy hypersonic missiles on ships and submarines that could lurk outside U.S. territorial waters if the United States moved to deploy intermediate-range nuclear weapons in Europe.", "posttime": "2020-07-27 09:11:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,核打击,russian", "title": "普京称俄罗斯海军将获得高超声速核打击武器", "title_en": "Putin says Russian Navy to get hypersonic nuclear strike weapons", "transed": 1, "url": "https://www.reuters.com/article/us-russia-navy-day-parade-putin-idUSKCN24R0CJ", "via": "", "real_tags": ["俄罗斯", "核打击", "russian"]}, {"category": "", "categoryclass": "", "imagename": "0e75749332c818cc6a78e7d6415bcc31.png", "infoid": 1014346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "喵是一项新的操作，扫描互联网上打开的数据库并将其删除。根据Shodan的数据，它已经活跃了几周，已经删除了4000多个数据库。\n最后一个问题是由亚特兰大(JIRA)的一名员工提出的。自7月21日星期二以来，他的ElasticSearch数据库已被反复删除。\n从日志判断，这是一个与Kibana并排的ElasticSearch集群。“喵”字符串表明它对互联网是完全开放的，并被删除了。\n这可能是生产数据库，也可能不是，这可能来自Atlassian，也可能不来自Atlassian。\n索引量将与每小时左右创建一个新索引保持一致，这是日志集群的常见做法。20多个新索引被删除了-今天-所有这些索引都是在昨天数据库被清除一次后创建的，这将是有意义的。\n根据手头的信息，在云中运行的是一个完整的日志记录集群。这看起来很像生产系统。", "note_en": "Meow is a new operation scanning the internet for open databases and deleting them.  It’s been active for a couple of weeks and has deleted more than 4000 databases as measured by Shodan.\n    This last question was raised by an employee from  Atlassian (JIRA). His ElasticSearch database has been deleted repeatedly since Tuesday 21th July.\n Judging by the logs, this is an ElasticSearch cluster alongside a Kibana. The “meow” strings indicate it was wide open to the internet and got deleted.\n This may or may not be a production database and this may or may not be from Atlassian.\n The amount of indexes would be consistent with a new index getting created every hour or so, common practice for a logging cluster. 20ish new indexes got removed -today-, all created since the database was wiped clean once -yesterday-, that would make sense.\n Given the information at hands, a complete logging cluster running in the cloud. This looks a lot like production systems.", "posttime": "2020-07-27 09:07:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,生产,company", "title": "Atlassian，第一家被喵删除其生产数据库的公司？", "title_en": "Atlassian, First Company to Have Their Production Databases Deleted by Meow?", "transed": 1, "url": "https://thehftguy.com/2020/07/26/atlassian-first-company-to-have-their-production-databases-deleted-by-meow/", "via": "", "real_tags": ["数据库", "database", "生产", "company"]}, {"category": "", "categoryclass": "", "imagename": "1d8765c35088bfbadd064e2da88ddd28.jpg", "infoid": 1014345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新加坡：新加坡陆军正在试验一种钛制成的外骨骼，旨在减轻携带重物的士兵的压力。\n7月1日，新加坡武装部队(SAF)日发布了一段视频，标题为外骨骼审判，显示一名士兵在军装上穿着绿色外骨骼。\n国防部在回答中央通讯社的询问时证实，军方正在研究使用智能外骨骼来提高士兵的表现。\n新加坡陆军一直在寻找提高我们士兵表现的方法，外骨骼就是士兵表现卓越中心(CESP)正在研究的一个例子。\nCESP成立于2017年，有助于充分发挥士兵在健康和营养、预适应和康复、心理弹性和士兵系统等领域的潜力。\n根据SAF Day的视频，外骨骼的外观和标志表明它是加拿大科技公司Mawashi的UltraLight被动式Ruggedified集成士兵外骨骼系统。\n该公司表示，该系统最初是为特种部队开发的，由高强度钛制成，包括灵活的脊椎、滑带和全关节腿。\nMawashi网站表示，起义允许将大约50%至80%的负荷转移到地面，并为用户提供高度的移动性。\n一份起义的情况说明书说，它可以提高战斗力，减少疲劳和肌肉骨骼损伤。它没有具体说明该系统的成本。\n一位国防分析师告诉CNA，虽然外骨骼在建筑业和搜救等重型民用行业很常见，但军事应用相对较新。\n为国防工业提供商业信息的Shephard Media的新加坡代表陈传仁表示，美国、法国和澳大利亚军队已对外骨骼表现出兴趣，尽管他指出，实施方面的挑战包括成本和机动性。\n根据一项690万美元(960万新元)的协议，美国陆军纳蒂克士兵研究、开发和工程中心一直在探索如何将商业开发的外骨骼用于军事目的。\n参与该项目的一家防务公司是洛克希德·马丁公司，该公司生产一种玛瑙下肢外骨骼，以增加机动性和减少疲劳。\n在SAF Day视频中可以看到这名士兵在跑步机上行走，这似乎是一次压力测试。他在外骨骼上穿着完整的战斗装备，包括头盔、步枪、野战背包和承重背心。\n陈先生预计起义将在新加坡陆军中分发，而不是作为标准问题物品，而是分发给远距离执行繁重任务的专门化单位，比如一些反坦克步兵和特种部队士兵。\nMawashi在其网站上表示，通过其创新和超轻的设计，这款外骨骼实现了无与伦比的运动自由度。\n它允许战术演习中的所有动作，以及下马士兵和特种作战部队和操作员所需的其他任务。&#34；(它)允许在战术演习中涉及的所有动作，以及下马士兵和特种作战部队和操作员所需的其他任务。\n陈表示，起义适合新加坡陆军，因为由于气候潮湿，在热带活动的部队往往耐力较低。\n他们更容易感到疲倦，所以我认为这种系统对他们非常有用，他说。\n如果你特别注意起伏，负荷实际上是通过腿部支架从脊椎传到地面的……而不是把负荷放在肩膀或背部。\n但陈先生表示，向军队中的每一名士兵发起起义是不切实际的，因为钛制产品非常非常昂贵。\n他补充说，它很可能会被派往特种部队，这些特种部队在敌后行动，通常担负着非常沉重的任务。他们必须进行徒步旅行和长途任务。\n来源：CNA/Hz(NC)", "note_en": "SINGAPORE: The Singapore Army is trialling a titanium-made exoskeleton designed to reduce the stress on soldiers carrying heavy loads.\n A section of the Singapore Armed Forces (SAF) Day video released on Jul 1, captioned &#34;Exoskeleton Trial&#34;, showed a soldier wearing a green exoskeleton on top of his army fatigues.\n     In response to queries from CNA, the Ministry of Defence confirmed that the army is studying the use of an exoskeleton to improve soldier performance.\n &#34;The Singapore Army is constantly looking for ways to enhance the performance of our soldiers, and the exoskeleton is one such example that the Centre of Excellence for Soldier Performance (CESP) is studying,&#34; it said.\n The CESP, set up in 2017, helps to develop the full potential of soldiers in areas like fitness and nutrition, pre-habilitation and rehabilitation, resilience and soldier systems.\n      Based on the SAF Day video, the exoskeleton&#39;s appearance and logo indicates that it is the Canadian science and technology company Mawashi&#39;s Ultralight Passive Ruggedized Integrated Soldier Exoskeleton (UPRISE) system.\n The system, which the company says was initially developed for special forces and is made of high-strength titanium, comprises a flexible spine, sliding belt and fully articulated legs.\n UPRISE allows for a 50 to 80 per cent load transfer to the ground and a &#34;high degree&#34; of mobility for users, the Mawashi website said.\n An UPRISE factsheet said it increases combat effectiveness and reduces fatigue as well as musculoskeletal injuries. It did not specify how much the system costs.\n  A defence analyst told CNA that while exoskeletons are common in heavy-lifting civilian industries like construction as well as search and rescue, military applications are relatively new.\n Mr Chen Chuanren, Singapore representative at Shephard Media - which provides business information for the defence industry - said the US, French and Australian armies have shown interest in exoskeletons, although he pointed out that challenges to implementation include cost and mobility.\n The US Army Natick Soldier Research, Development and Engineering Center has been exploring how to use commercially developed exoskeletons for military purposes under a US$6.9 million (S$9.6 million) agreement.\n One defence firm involved in the project is Lockheed Martin, which produces an ONYX lower-limb exoskeleton to increase mobility and reduce fatigue.\n  The soldier in the SAF Day video is seen walking on a treadmill in what appears to be a stress test. He is wearing full combat gear on top of the exoskeleton, including helmet, rifle, field pack and load-bearing vest.\n Mr Chen expects UPRISE to be distributed in the Singapore Army not as a standard issue item, but to specalised units that do heavy lifting over long distances, like some anti-tank infantry and special forces soldiers.\n &#34;Through its innovative and ultralight design, this exoskeleton achieves an unparalleled level of freedom of movement,&#34; Mawashi said on its website.\n &#34;(It) allows for all the movements involved during tactical maneuvers as well as other tasks required by dismounted soldiers and special operations forces operators.&#34;\n   Mr Chen said UPRISE is suitable for the Singapore Army as troops that operate in the tropics tend to see lower levels of endurance due to the humid climate.\n &#34;There is a higher chance that they get tired a bit more, so I think it would be very useful for them to have this kind of system,&#34; he said.\n &#34;If you look at UPRISE especially, the load actually gets passed down to the ground through the leg brace from the spine ... instead of having the load on your shoulders or back.&#34;\n  But Mr Chen said it is not practical to issue UPRISE to every soldier in the army as the titanium-made product is &#34;very, very expensive&#34;.\n &#34;It&#39;s likely that it will be fielded to the special forces which operate behind enemy lines and usually carry very heavy loads,&#34; he added. &#34;They have to do trekking and long-distance missions.&#34;\n  Source: CNA/hz(nc)", "posttime": "2020-07-27 09:07:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "陆军,army,外骨骼", "title": "新加坡陆军试验旨在减轻士兵负担的钛外骨骼", "title_en": "Singapore Army trials titanium exoskeleton designed to reduce load on soldiers", "transed": 1, "url": "https://www.channelnewsasia.com/news/singapore/saf-army-exoskeleton-mawashi-reduce-load-12960250", "via": "", "real_tags": ["陆军", "army", "外骨骼"]}, {"category": "", "categoryclass": "", "imagename": "05722914f90de48141608d462baabf55.png", "infoid": 1014344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着现代代码库以疯狂的速度增长，我们通常已经接受这样一个事实，即我们喜爱的编程语言中的某些特性以这样或那样的方式决定了最终产品的质量。无论是对无缝模块化编程、静态类型系统的支持，还是对分布式系统中具有健壮状态维护方式的并发性和并行性的支持。\n然而，在某些方面(当然有许多例外)，我们仍然使用与大约20年前相同的编程语言。它们中的大多数都获得了一些新的有趣特性，这些特性通常继承自lambda演算的函数式语言-lambda表达式(所谓的箭头函数)、不变性、参照透明性、列表理解；通常还结合了范畴论的结构-代数数据类型(乘积类型也称为元组和和类型，通常称为区分并)、函数器、应用程序(应用函数器)和一元。另一件不容忽视的事情是标准化语言及其工具的常见尝试-正式规范(甚至PHP也有一个后验规范)、链接器、用于自动格式化代码和构建美观文档的工具。\n然而，我们在这里必须诚实。今天仍在使用的一些语言不知何故睡过了这个加速增长的阶段。当他们醒来时，已经来不及赶上了。让我们来谈谈PHP。\n在当今世界，强静态类型对于创建健壮、高性能和安全的应用程序越来越重要，因此可以很好地说PHP的类型调整可能不是最合适的。考虑到仍然缺乏泛型，最近添加的渐进式类型是不够的。此外，类型系统本身存在许多特性-当谈论泛型时，不用说，无法表示对象装箱和取消装箱有点令人惊讶。现在，让我们回到2000年，当时PHP3还在游戏中，它的继任者PHP4发布了。\n旧的PHP3手册明确提到类型杂耍是一种语言特性。类型杂耍不太好的一点是，当您的脚本走入歧途时，您需要在头脑中进行心理杂耍，而不会抛出任何异常。更有趣的是，它在PHP7.4中仍然存在。这是绕过PHP渐进式类型系统的最简单方法，因为运算符被嵌入到语言中，并且它们的语义不受类型系统本身的影响。现在让我们看看我们是否能重现近20年前的一些例子。\n//1$foo=&#34；0&#34；；//$foo是字符串(ASCII 48)$foo++；//$foo是字符串&#34；1&#34；(ASCII 49)//2$foo+=1；//$foo现在是整数(2)$foo=$foo+1.3；//$foo现在是双精度(3.3)//3$foo=5+&#34；10小猪。；//$foo为整数(15)。\n这在一定程度上是正确的。您仍然可以对字符串使用后增量运算符，但变量将隐式转换为整数。\n现在，将格式错误的整数文字(可以是字符串)与算术运算符一起使用是无效的。\n但所有这些都很容易写，对我们人类来说也很自然。比方说，与OCaml相比，它具有较低的认知负荷，在OCaml中，算术运算符实际上是规则的中缀函数，在其参数上不是多态的。\n(*这些是来自Ocaml REPL会话的代码示例。字符串&#39；utop#&#39；是提示符。*)utop#(+)；；-：int-&gt；int-&gt；int=&lt；Fun&gt；utop#1+1；；-：int=2 utop#1.0+1.0；；错误：此表达式的类型为Float，但表达式的类型应为int utop#(+.)；；-：Float-&gt；Float-&gt；Float=&lt；Fun&gt；utop#1.0+。1.0；；-：浮点=2。\n当然，像加宽或缩小数值这样的类型提升在许多强类型编程语言中很普遍，但不像在PHP中那样容易脱离语言的类型系统。大多数情况下，它们需要显式发送信号-因此，将长整型缩小为短整型需要显式强制转换。即使这样，也不能仅通过使用算术运算符将字符串隐式转换为整数。\n此外，强类型与弱类型和静态类型解析与动态类型解析之间存在非常明显的对比。事实证明，基于可预测的强制，您可以获得非常内聚和合理的强动态类型系统-Ruby就是这种语言的一个很好的例子。\n帕斯卡语系的语系相当大。它的一些后代仍然在积极地维持着。例如，object Pascal最初是由苹果公司创建的实现。存在几种对象PASCAL风格的语言。Delphi就是这样一个例子。它有成熟的开源对应产品--Free Pascal。它是一个非常现代化的实现，支持模块化编程、泛型、委托、函数和运算符重载等等。它有很好的工具支持和包管理器。Free Pascal执行ISO 7185：1990官方Pascal标准。\n从20世纪70年代开始，Pascal就是一种静态的强类型语言。它的作者Niklaus Wirth设计了几种编程语言，但并不是所有语言都是静态类型的(参见Euler)。这与PHP形成鲜明对比，PHP被设计为一种粘合语言，用于使静态网页不那么静态。\n下面是对语言类型系统进行比较的简短、无意义但有趣的尝试，这些语言可能永远不应该以任何方式进行比较。具体地说，我们将看看为什么缺少泛型在PHP中是如此痛苦的原因。\n泛型是一种允许您编写由其他类型参数化的代码的功能。有用的参数化结构最明显的例子是集合。\nPHP有其专用的类似集合的数据类型来存储值-数组。一旦将某些内容放入数组中，就可以通过其索引进行检索。但是，有时您希望使用SPL集合之一，例如SplFixedArray，它可能被证明比普通数组更节省空间。与数组一样，您可以放入任何类型的值。\n我从来没有见过会叫的洗碗机，但我不是这方面的专家。我们希望找到一种以狗感知的方式将元素插入数组集合的方法。一种方法是尝试下面这样的方法。\nPHP致命错误：DogFixedArray：：offsetSet(int$index，Dog$Dog)的声明必须与SplFixedArray：：offsetSet($index，$newval)兼容。\n恐怕行不通。PHP简单地禁止了这一点。如果基类中的参数没有类型化，那么它实际上根本没有类型-在PHP中称为“混合”。您不能在子类中指定它，因为这将意味着更改方法签名，而这是被合理禁止的。这是一个有点令人费解的概念，因为没有“混合”类型的提示，所以有时无法实现明显的方差规则。不过，对于这一点，存在一个RFC。\n可以求助的一件事是在offsetSet中使用instanceof操作符。但是，应该注意，该操作符获取运行时信息，因此毕竟您需要牺牲一件事来换取另一件事-空间效率与运行时开销。\n现在来看看Pascal是如何处理泛型集合的，以及这种处理对语言中的类型安全有什么明显的影响。\n免费的Pascal附带了一个丰富的开源标准库，称为RTL(Runtime Library)，其中包含一个名为FGL？(Free Pascal Generic List)的单元。以下是使用此单位的示例。\n4.“Specialize”关键字用于创建参数化类型的新实例。从那时起，TDogList指的是TDog类型的对象集合。5.方法在类声明之外定义。6.“神奇”变量result的工作原理有点像许多主流语言中的return关键字。7.Create是实际构造函数的名称。9.事实证明，您甚至可以在Free Pascal中使用foreach循环。10.free Pascal没有垃圾收集器，因此对象在使用完后需要释放。\n没有必要释放列表的项目，因为默认情况下，它持有其数据的所有权，并在数据被销毁时将其释放。可以通过将false作为第一个也是唯一一个参数传递给TFPGObjectList构造函数来控制它。\n最后，第八点证明了不可能向TDog列表中添加TDishwaher类的对象。\n在Free Pascal中声明泛型类型的新实例²是强制性的³，与C#相比有点繁琐：\n在C#中，类型实例化是临时的，而在Pascal中，您需要事先在单元文件的“type”部分创建类型同义词。\n在内部，Free Pascal对泛型的理解与C++或Java中的有所不同。编译单元时，会生成PPU文件。它包含有关该单元的元信息。对我们来说，最重要的是，它维护了一个令牌缓冲区，编译器使用该缓冲区根据泛型类型定义创建专门的实现。工作流程如下所示。\n1.对于每个泛型类型：泛型TGeneric&lt；T&gt；=...。使用元信息在PPU文件内创建令牌缓冲区。2.对于每次出现：TSpecialized=Specialize TGeneric&lt；*&gt；，解析专门化并通过用T替换*来创建Conrete类型，其中*是简单类型。\n在概念层面上，它与Java等其他语言没有太大不同，但实现有很大不同。因为专门化发生在编译时，所以Free Pascal的泛型不会像在Java中那样受到类型擦除的影响。\n本文总结了为什么PHP中缺少泛型是令人痛苦的，以及为什么它松散的类型系统有时根本无助于编写好的代码。本文介绍了免费的Pascal对泛型的理解，以及它如何简化了即使在PHP的现代版本中也存在的许多问题。在Ruby等动态语言中，类型杂耍与强制并列。最后，演示了一个完整的Free Pascal工作示例，展示了如何通过使用泛型来缓解常见的类型问题。", "note_en": "With modern codebases growing at an insanely fast pace we have generally come to terms with the fact that certain traits in our beloved programming languages determine the quality of the end product in one way or another. Be it support for seamless modular programming, static type system or concurrency and parallelism with robust ways of maintaining state in distributed systems.\n  Yet in some ways (with numerous exceptions of course) we still use the same programming languages as we did twenty or so years ago. Most of them have acquired some new interesting features usually inherited from functional languages derived from the lambda calculus — lambda expressions (so called arrow functions), immutability, referential transparency, list comprehensions; oftentimes structures from category theory have been incorporated as well — algebraic data types (product types also called tuples and sum types often called discriminated unions), functors, applicatives (applicative functors) and monads to name a few. Another thing that cannot be neglected is a common attempt at standardizing languages and their tooling — formal specifications (even PHP got an  a posteriori one), linters, tools for auto-formatting the code and building pleasant-looking documentation.\n  However, we have to be honest here. There are languages still in use today that somehow overslept this phase of accelerated growth. And when they woke up it was way too late to catch up. Let’s talk PHP.\n In today’s world where strong static typing is becoming more and more crucial to creating robust, performant and secure applications, it’s probably well-grounded to say that PHP’s type-juggling might not be the best fit. Recent addition of gradual typing is not sufficient considering it still lacks generics. Also, there exist many peculiarities within the type system itself — when talking about generics it’s needless to say that the inability to express object boxing and unboxing is a bit surprising. Now, let’s go back in time a bit, to year 2000 when PHP 3 was still in the game and its successor, PHP 4 was released.\n   The old  PHP 3 manual explicitly mentions type juggling as a language feature. The not so good thing about type juggling is the mental juggling you need to perform in your head when your script goes astray without throwing any exceptions. Even more interesting is the fact that it’s still  there in PHP 7.4. This is the easiest way to bypass PHP’s gradual type system since operators are baked into the language and their semantics are exempt from the type system itself. Now let’s see if we can recreate some of the examples from before almost 20 years ago.\n // 1 $foo = &#34;0&#34;; // $foo is string (ASCII 48) $foo++; // $foo is the string &#34;1&#34; (ASCII 49) // 2 $foo += 1; // $foo is now an integer (2) $foo = $foo + 1.3; // $foo is now a double (3.3) // 3 $foo = 5 + &#34;10 Little Piggies&#34;; // $foo is integer (15) $foo = 5 + &#34;10 Small Pigs&#34;; // $foo is integer (15)\n This partially holds true. You can still use the post-increment operator on strings but the variable will be cast into an integer implicitly.\n  Nowadays it’s invalid to use a malformed integer literal (which can be a string) with arithmetic operators.\n But all of this is so easy to write and natural for us humans to understand. It has a low cognitive load compared to, say, OCaml where arithmetic operators are in fact regular infix functions which aren’t polymorphic over their arguments.\n (*  These are code samples from an Ocaml REPL session.  The string &#39;utop #&#39; is the prompt. *) utop # (+);; - : int -&gt; int -&gt; int = &lt;fun&gt; utop # 1 + 1;; - : int = 2 utop # 1.0 + 1.0;; Error: This expression has type float but an expression was expected of type  int utop # (+.);; - : float -&gt; float -&gt; float = &lt;fun&gt; utop # 1.0 +. 1.0;; - : float = 2\n Of course, type promotions like widening or narrowing numeric values are prevalent in many strongly typed programming languages but do not escape the language’s type system as easily as in PHP. Most of the time they need to be signaled explicitly - thus narrowing a long integer to short integer requires an explicit cast. Even then, you cannot just implicitly cast a string to an integer by using an arithmetic operator.\n Also, there is a very clear contrast between strong vs weak typing and static vs dynamic type resolution. It turns out you can get a very cohesive and reasonable strong-dynamic type system based on predictable  coercion — Ruby is a good example of such language.\n    The Pascal family of languages is quite large. Some of its descendants are still actively maintained. Object Pascal for instance was an implementation originally created by Apple. There exists a couple of Object Pascal-flavored languages. One such example is Delphi. It has its mature open-source counterpart — Free Pascal. It’s a very modern implementation supporting modular programming, generics, delegates, function &amp; operator overloading and much more. It has a great  tooling support and a package manager. Free Pascal implements the  ISO 7185:1990 official Pascal standard.\n Pascal has been a statically and strongly typed language from its inception dating back to 1970s. Its author Niklaus Wirth designed a couple of programming languages but not all of them were statically typed ( vide  Euler). This is in contrast to PHP which was designed as a glue language for making static webpages less static.\n What follows is a brief, nonsensical yet entertaining attempt at comparing the type systems of languages that probably should never be compared in any way. In particular, we’re going to take a look why the lack of generics is such a pain in PHP.\n  Generics is a feature that lets you write code that is parametrized by additional types. The most obvious example of a useful parametrized structure is a collection.\n  PHP has its dedicated collection-like datatype for storing values — arrays. Once something is put inside an array it can be retrieved by its index. There are times though when you’d like to use one of the SPL collections such as SplFixedArray which may prove to be more space efficient than an ordinary array. As with arrays you can put there values of any type.\n   I have never seen a barking dishwasher but I am no expert in this. We would like to find a way of inserting elements into an array collection in a dog-aware fashion. One way would be to try something like the following.\n  PHP Fatal error: Declaration of DogFixedArray::offsetSet(int $index, Dog $dog) must be compatible with SplFixedArray::offsetSet($index, $newval)\n It won’t work. PHP simply forbids that. If a parameter in the base class is not typed then it virtually has no type at all — it’s called “mixed” in PHP. You can’t specify it in child classes because this would mean changing the method signature which is justly prohibited. It’s a bit of a baffling concept since there is no “mixed” type hint so sometimes obvious  variance rules can’t be realized. There exists an  RFC for that though.\n One thing that one could resort to would be to use the  instanceof operator inside  offsetSet. It should be noted however that this operator obtains runtime information, so after all you would need to sacrifice one thing for another — space efficiency versus runtime overhead.\n   It’s time to see how Pascal treats generic collections and the obvious implications this treatment has on type safety in the language.\n Free Pascal comes with a rich open-source standard library called RTL (Runtime Library) which contains a unit called FGL¹ (Free Pascal Generic Lists). The following is an example that uses this unit.\n   4. The “specialize” keyword is used to create a new instance of a parametrized type. From then on  TDogList refers to a collection of objects of type  TDog. 5. Methods are defined outside of class declarations. 6. The “magic” variable  Result works a bit like the  return keyword found in many mainstream languages.  7.  Create is the name of an actual constructor. 9. It turns out you can even have a  foreach loop in Free Pascal. 10. Free Pascal doesn’t have a garbage collector so objects need to be freed when done working with.\n It’s not necessary to free the list’s items because by default it holds ownership of its data and frees it when it’s destroyed. It can be controlled by passing  False as the first and only parameter to the  TFPGObjectList constructor.\n Finally, the eighth point proves that it’s impossible to add an object of class  TDishwasher to a list of  TDogs.\n  Declaring new instances² of generic types in Free Pascal is mandatory³ which is a bit verbose compared to, say C#:\n  In C# type instantiation is  ad hoc while in Pascal you need to take care of creating type synonyms beforehand, in the “type” section of a unit file.\n   Internally, Free Pascal’s take at generics is somewhat different to that present in C++or Java. When a unit is compiled a PPU file is generated. It contains meta-information about the unit. Most importantly for us it maintains a token buffer used by the compiler to create specialized implementations based on the generic type definitions. The workflow looks as follows.\n 1. For each generic type: generic TGeneric&lt;T&gt; = ... Create a token buffer inside the PPU file with meta information. 2. For each occurrence of: TSpecialized = specialize TGeneric&lt;*&gt; Parse the specialization and create the conrete type by substituting T for * where * is a simple type\n At the conceptual level it’s not much different from other languages like Java but the implementation differs significantly. And because the specialization happens at compile time, Free Pascal’s generics are not subject to type erasure as it happens to be in  Java.\n  This article sums up why the lack of generics in PHP is painful and why its lax type system sometimes just doesn’t help with writing good code. Free Pascal’s take on generics was presented and how it simplifies many of the problems that exist even in modern versions of PHP. Type juggling was juxtaposed with coercion in dynamic languages like Ruby. Finally, a full working example in Free Pascal was demonstrated to show how common typing issues can be alleviated with the use of generics.", "posttime": "2020-07-27 09:06:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,pascal,类型", "title": "为什么免费的Pascal比PHP更好？", "title_en": "Why Is Free Pascal Better Than PHP?", "transed": 1, "url": "https://medium.com/swlh/why-is-free-pascal-better-than-php-654d6c569e7b", "via": "", "real_tags": ["免费", "pascal", "类型"]}, {"category": "", "categoryclass": "", "imagename": "13c28031f0c1eb27cfb325b3ff54e043.png", "infoid": 1014343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我谨代表我们美丽的巴巴多斯岛国向你们表示热烈的欢迎。虽然COVID19大流行对世界各地的人们来说是一个巨大的挑战，但我们相信它也带来了机遇。\n我们认识到，越来越多的人在远程工作，有时工作压力很大，几乎没有度假的选择。我们新的12个月巴巴多斯欢迎印章，这是一种允许您从世界上最受欢迎的旅游目的地之一搬迁和工作的签证。\n我们相信，在这块我们称之为巴巴多斯的小岩石上，我们可以提供一些非常特别的东西。我们友好的人民、专业的服务、对教育的承诺，以及重要的安全保障，都使巴巴多斯成为单身人士和家庭的理想居住地。\n阳光、安全和国际化的巴巴多斯对任何工作足够灵活、允许他们远程设立办公室的人都很有吸引力。如果您正在考虑离开人口稠密的城市中心，想要逃离严酷的气候，想要体验一种新的文化，或者只是想改变一下家庭办公室的风景，巴巴多斯为您提供了一种允许您在安全的热带岛屿上安全健康地生活在户外的生活方式。\n如果您对在巴巴多斯远程工作感兴趣，您可以通过电子方式申请，方便快捷。巴巴多斯12个月欢迎印花签证一经批准，有效期为一年，您还可以在此期间后重新申请。巴巴多斯提供从经济实惠的工作室到海滨豪华公寓的广泛住宿。\n巴巴多斯拥有真正令人振奋的离家之家的所有要素。这个国家阳光明媚，安全，你将永远靠近美丽的海滩。食物和聚会是巴詹文化的中心。无论是周末的‘酸橙’，海滩野餐，还是与朋友一起烧烤，食物和社交活动都是巴巴多斯生活的一个不可否认的方面。\n巴巴多斯为您提供田园诗般的海滩、热带风光和工作与生活平衡的背景。而且，你仍然可以赚取你的全球工资。巴巴多斯拥有坚实的基础设施，拥有稳定的经济，良好的医疗设施，从托儿所到大学的世界级教育，以及可靠而快速的互联网连接。在您的家庭办公室，巴巴多斯为您提供了一种允许您在安全的热带岛屿上安全健康的户外生活的生活方式。", "note_en": "On behalf of our beautiful island of Barbados, I would like to extend a warm welcome to you.Although the COVID 19 pandemic has been a tremendous challenge to people around the world, we believe it has also opened up opportunities.\n We recognise more people are working remotely, sometimes in very stressful conditions, with little option for vacation. Our new 12 month Barbados Welcome Stamp, a visa that allows you to relocate and work from one of the world’s most beloved tourism destinations.\n We believe we have something very special to offer on this little rock we call Barbados. Our friendly people, professional services, commitment to education and importantly safety and security, all make Barbados an ideal place to live for both singles and families.\n  Sunny, safe and cosmopolitan Barbados is a lure to anyone whose work is flexible enough to allow them to set up office remotely. If you’re thinking about moving away from densely populated urban centres, want to escape an unforgiving climate, are interested in seeing a new culture or just want a change of scenery for your home office, Barbados gives you a lifestyle that allows for safe and healthy outdoor living on a secure tropical island.\n  If you’re interested in working remotely in Barbados, you can apply electronically and be easily facilitated. Once approved, the Barbados 12 Month Welcome Stamp visa is valid for one year, and you can also reapply after this period. Barbados offers a wide range of accommodation from budget-friendly studios to beachfront luxury condos.\n  Barbados has all the ingredients for a truly inspiring home away from home. The country is sunny, safe, and you will always be close to a beautiful beach. Food and partying are at the centre of Bajan culture. Whether a weekend ‘lime’, a beach picnic, or a barbeque with friends, food and socializing are an undeniable aspect of living in Barbados.\n  Barbados offers you the backdrop of idyllic beaches, tropical landscape and work-life balance. And, you’ll still be earning your global salary. Barbados has a solid infrastructure in place, with a stable economy, good healthcare facilities, world class education from nursery to university level, and reliable and fast Internet connectivity.your home office, Barbados gives you a lifestyle that allows for safe and healthy outdoor living on a secure tropical island.", "posttime": "2020-07-27 09:06:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "邮票,stamp", "title": "巴巴多斯欢迎邮票计划", "title_en": "Barbados Welcome Stamp Program", "transed": 1, "url": "https://www.barbadoswelcomestamp.bb/", "via": "", "real_tags": ["邮票", "stamp"]}, {"category": "", "categoryclass": "", "imagename": "d1f584f3ea45a9652604beabe4638f06.jpg", "infoid": 1014342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在德国软件巨头SAP以80亿美元收购体验管理平台Qualtrics首次公开募股(IPO)不到两年后，该公司现在决定通过全新的IPO剥离该公司。\n在周日发布的一份新闻声明中，SAP援引SAP首席执行官克里斯蒂安·克莱因(Christian Klein)的话说，Qualtrics的云增长“超过了40%”。该公司将继续由创始人兼前首席执行官瑞安·史密斯(Ryan Smith)运营，他加入了SAP与高通(Qualtrics)，并在这家德国企业集团内部领导了该组织。\nSAP将保留新剥离的多数股权。有趣的是，声明指出，“Ryan Smith打算成为Qualtrics最大的个人股东。”\nSAP的新闻声明含糊其辞，但言下之意是，此举将为Qualtrics提供更大的灵活性，使其能够与母公司管辖范围以外的客户和合作伙伴进行接触。\n我确信我的股票同事Alex Wilhelm明天将在他的The Exchange专栏中有更多要分析的内容，但SAP在收购方面的迅速转变令人大吃一惊。尽管私募股权公司会将一家公司私有化，有时还会在IPO中迅速扭转局面，但很少会看到像SAP这样的大公司在最后一刻如此戏剧性地出价收购一家公司，但仅仅几个月后就逆转了这一决定。\n然而，考虑到SaaS市场最近的火爆行情，高通重返公开市场的道路似乎是畅通的，特别是如果这家即将独立的公司的指标自我们上次看到其财务业绩以来表现良好的话。正如威廉和他的Crunchbase新闻团队在提交给S-1的文件中回复的那样：\n与今年大多数上市公司不同的是，高通并不是打着增长之名招致亏损的垃圾大火。它表明，你可以成长，而不会同时失去你拥有的每一美元。\n“不是垃圾火”在当时是一个很高的门槛，但Qualtrics确实是同龄人中的佼佼者。假设这些基本面没有改变，这看起来是高通和史密斯的一次真正的胜利，也是SAP从他们决定中途改变的任何战略计划中拯救出来的一次胜利。", "note_en": "Less than two years after German software giant SAP snatched experience management platform Qualtrics for $8 billion days before the startup’s IPO debut, it has now decided to spin out the company in a brand new IPO.\n   In a press statement released Sunday, SAP said that Qualtrics had seen cloud growth “in excess of 40 percent” in a quote attributed to  SAP   CEO Christian Klein. The company will continue to be run by founder and former CEO Ryan Smith, who joined SAP with Qualtrics and led the organization within the German conglomerate.\n SAP will retain majority ownership of the new spin out. Interestingly, the statement noted that “ Ryan Smith   intends to be  Qualtrics’   largest individual shareholder.”\n SAP’s press statement is vague, but the implication is that the move will offer Qualtrics more flexibility to engage with customers and partners outside of its parent company’s dominion.\n I am sure my Equity colleague Alex Wilhelm will have much more to analyze tomorrow with  his The Exchange column, but SAP’s rapid about-face on the acquisition is a major surprise. While private equity firms will take a company private and sometimes quickly turn it around in an IPO, it is rare to see a large company like SAP make such a dramatic last minute bid for a company only to reverse that decision just months later.\n Given the heated market for SaaS markets these days though, the path seems clear for Qualtrics’ return to the public markets, particularly if the soon-to-be independent company’s metrics have held up since we last saw its financials.  As Wilhelm and his Crunchbase news team wrote back during its S-1 filing:\n Qualtrics, unlike most companies going public this year, isn’t a trash fire of losses incurred under the name of growth. It shows that you can grow, and not lose every one of the dollars you have at the same time.\n “Isn’t a trash fire” was a high bar back then, but Qualtrics was indeed an outperformer of its peer group. Assuming those fundamentals haven’t changed, it looks like a real win for Qualtrics and Smith, and a save by SAP from whatever strategic plan they decided to change midstream.", "posttime": "2020-07-27 08:35:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "剥离,spin,sap", "title": "\nSAP将剥离其以80亿美元剥离的Qualtrics收购", "title_en": "\n\t\t\t\tSAP will spin out its $8B spin-in Qualtrics acquisition\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/26/sap-will-spin-out-its-8b-spin-in-qualtrics-acquisition/", "via": "", "real_tags": ["剥离", "spin", "sap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-07-27 08:11:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "半导体,progress,创建", "title": "测量半导体进展的一种更好的方法", "title_en": "A Better Way to Measure Progress in Semiconductors", "transed": 1, "url": "https://spectrum.ieee.org/semiconductors/devices/a-better-way-to-measure-progress-in-semiconductors", "via": "", "real_tags": ["半导体", "progress", "创建"]}, {"category": "", "categoryclass": "", "imagename": "59abe9dd35577c274832a8a9f4824ca2.png", "infoid": 1014339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，直播一直在增长，但这场大流行绝对增加了观看的流媒体和内容的数量。这一次我们不能展示每个平台，但可以肯定地说，每个关键参与者都经历了很大的增长。下面的报告概述了StreamElements的最新叙述，数据来自我们在arcal.gg的朋友提供的数据。\n与第一季度的单层住宅相比，Twitch的第二季度图表条看起来像摩天大楼。\n与今年第一季度相比，Twitch在第二季度的观看小时数增长了56%，超过了50亿大关。一年前，第二季度的观看时间不到30亿小时。为什么增长如此之快？随着人们在原地避难，他们的重点已经转移到在线娱乐上，无论是那些正在寻找可看的东西的人，还是那些提供内容的人。\nTwitch可能有数字，但Facebook Gaming绝对有坚实的势头。他们的第二季度比第一季度多了75%的观看时间。帮助Facebook游戏攀升排行榜的一直是他们对国际市场的关注，他们独立游戏应用的发布，以及大型名人锦标赛。当然，这些数据只涉及他们的游戏直播视频内容，而不是Facebook上的所有直播内容。\n直播多年来一直是一种全球现象，但现在很多国际人才正在崛起。\n不仅外国流媒体接管了排行榜，巴西的Gaules在背靠背的几个月里夺得了桂冠。Twitch并不是唯一一个从美国以外获得大幅提振的平台；Facebook Gaming的前10名都是国际流媒体。\n创作者喜欢和他们的观众聊天。很多。至于游戏，是的，我们仍然在谈论GTA V。\n仅仅是聊天就已经在5月和6月的排行榜上扎根，这表明西方正在追随东方的脚步，在那里，这类非游戏内容已经是一个占主导地位的类别。由于今年出现了如此多的重要话题，如与流行病相关的困难、黑人生命也是(Black Lives Matter)运动，以及游戏行业对#MeToo意识的提高，仅仅是聊天就能让流媒体用户围绕这些主题进行更深入的对话。除了聊天自年初以来稳步攀升外，2019年第一季度(181k)与2020年第二季度(498k)相比，观看时长增长了175%。\n在今年上半年大放异彩的游戏中，侠盗猎车手(Grand Theft Auto)就是其中之一。与其他传统游戏根据更新起伏不同，GTA V自1月份以来一直处于上升轨道，没有一次下降。使命召唤：现代战争的增长百分比可能会让你加倍看重，但那是因为时间包括使命召唤：战区，一个具有跨平台游戏和现代战争进步的免费战斗皇室游戏。战区于3月份推出，并获得了大量采用。\n虽然有许多非游戏类别在大流行期间有所增长，如音乐、只是聊天和艺术，但可能最新颖的是户外旅行。这一类别的人经常在徒步游览他们参观的地方的同时观看他人的移动溪流，但由于现在旅行的次数较少，许多自然溪流正在享受时光。如果你得不到上诉，也许这些浣熊会让你改变主意。", "note_en": "Livestreaming has been on the rise for years, but the pandemic definitely supersized the amount of streamers and content being watched. We weren’t able to showcase every platform this time around, but it is safe to say every key player has experienced a lot of growth. The following report outlines the latest narratives from  StreamElements with data courtesy of our friends at  Arsenal.gg.\n Twitch’s 2nd quarter chart bars look like skyscrapers compared to Q1’s single floor dwellings\n  Twitch grew 56% in hours watched in Q2 compared to Q1 of this year surpassing the 5 billion mark. A year ago, Q2 had less than 3 billion hours watched. Why so much growth? With people sheltering-in-place, their focus has shifted to online entertainment, both by those who are looking for things to watch and those who are providing the content.\n   Twitch might have the numbers, but Facebook Gaming definitely has solid momentum. Their second quarter trounced their first one with 75% more hours watched. Helping Facebook Gaming climb the charts has been their focus on the international market, the release of their standalone gaming app, and big celebrity tournaments. This data, of course, speaks only to their live gaming video content, not all live content on Facebook.\n Livestreaming has been a global phenomenon for years, but now a lot of the international talent is rising to the top\n  Not only are foreign streamers taking over the charts, the Brazilian  Gaules has captured the crown in back-to-back months. Twitch is not the only platform getting a big boost from outside the US; Facebook Gaming’s top 10 are ALL international streamers.\n Creators like to chat with their audiences. A lot. As for games, yes, we are still talking about GTA V\n  Just Chatting has rooted itself at the top of the charts in May and June illustrating how the West is following in the footsteps of the East where this type on non-gaming content is already a dominant category. Because so many important topics surfaced this year, such as pandemic-related hardships, the Black Lives Matter movement, and heightened awareness of #MeToo in the gaming industry, Just Chatting enabled streamers to have deeper conversations surrounding these subjects. In addition to Just Chatting’s steady climb since the beginning of the year, hours watched grew 175% in Q1 of 2019 (181K) compared to Q2 of 2020 (498K).\n Among the games that have shined during this first half of the year is Grand Theft Auto. Unlike other legacy titles that rise and fall based on updates, GTA V has been on an upward trajectory since January without a single dip. Call of Duty: Modern Warfare’s growth percentage might have you doing a double-take, but that’s because the hours include Call of Duty: Warzone, a free-to-play battle royale that has cross-platform play and progression with Modern Warfare. Warzone launched in March with huge adoption.\n   While there are a lot of non-gaming categories that have grown during the pandemic such as Music, Just Chatting, and Art, possibly the most novel is Travel &amp; Outdoors. This category is where people frequently watch others mobile stream while giving walking tours of places they are visiting, but since there is less travel right now, a lot of nature streams are having a moment. If you don’t get the appeal, then maybe  these raccoons will change your mind.", "posttime": "2020-07-27 07:27:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,facebook,游戏,watched", "title": "阿森纳.gg：在第二季度，Facebook游戏季度增长了75%，2020年6月达到3.34亿小时，高于去年同期的1.11亿小时；Twitch在第二季度以50B+小时的观看时长占据主导地位", "title_en": "Arsenal.gg: in Q2 Facebook Gaming grew 75% QoQ and reached 334M hours watched in June 2020, up from 111M YoY; Twitch dominated with 5B+ hours watched in Q2", "transed": 1, "url": "https://blog.streamelements.com/state-of-the-stream-june-q2-2020-livestreaming-is-getting-much-larger-and-more-global-8acfc3fadbba", "via": "", "real_tags": ["2020", "facebook", "游戏", "watched"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在2016年9月从TerASIC购买了一块名为Cyclone V GX Starter Kit的FPGA开发板(参见图1)。它的成本为179万美元，使用一个28 nm的现场可编程门阵列，带有6个来自ALTERA的3.125 Gbps收发通道。该主板提供一个32位宽的LPDDR2 DRAM内存，容量为512 MB。该设备具有非常高的带宽，适用于许多应用。此外，该电路板还有一个HDMI输出、一个音频设备、一个SD卡接口、许多LED和开关，以及一些扩展连接器。\n计划是用这块板实现一个多计算机系统。TRIPUTER这个名称表示将集成多少系统。第一个将是运行NetBSD的PC532。第二个将是使用OBERON的CERES-3。目前，最后一台将是配备32016秒处理器的英国广播公司计算机。\n为此，使用商业板是最好的选择。然而，董事会并不理想。例如，它没有以太网端口和实时时钟。但是它价格便宜，而且用过的FPGA是一种现代化的FPGA，可以使用很多年。缺失的功能可以通过扩展连接器添加。我也会为它开发必要的硬件。\n从软件的角度来看，要集成的三台计算机有很大的不同。让它们在一个系统中可用应该是一种令人兴奋的体验。电路板的FPGA足够大，可以容纳所需的硬件。\n图1.Cyclone V GX Starter Kit的初始配置在屏幕上显示了其自身的照片。\n当然，如此复杂的系统不是一夜之间建成的。但随着时间的推移，现在已经达到了第四个里程碑：-)。\n图2.TRIPUTER V0.2计算了一个Mandelbrot图像。M32632使其比NS32532/NS32381快20倍。\n图3.TRIPUTER V0.3的硬连线VT100端子显示了NetBSD的引导过程。\n里程碑4：由于VT100终端仿真中的一些问题，TRIPUTER V0.3可用=&gt；再次更新到V0.33。\n说明：TRIPUTER 0.33版包含运行NetBSD的PC632M系统和SD卡。尽管如此，该系统仍将USB连接用于RS232接口。SD卡的映像可在Software/NetBSD上获得。V0.33压缩文件包含以下文件：\nPeri板是一块IO板，它为FPGA板带来了一些必要的扩展：一个真正的RS232接口、一个实时时钟(RTC)、两个用于鼠标和键盘的PS2端口、一个第二个SD卡接口和一个100Mbit以太网接口。所有这些东西现在都可以使用了。有一个端口尚未使用：SATA。硬件是存在的，但是这个具有挑战性的接口的verilog代码仍然必须编写。\n图4.序列号为1的Peri板连接到Cyclone V GX Starter套件。以太网接口的3个LED中有2个处于激活状态。\nPERI的目的是将初学者工具包转换为独立计算机。然后，所有计划的系统都可以实现。\n为了测试Peri板的功能，我制作了一个新版本的TRIPUTER：它是V0.9。V0.9压缩文件仅包含三个文件：\n如果闪存配置了POF文件，系统只能测试PERI。然后就有一些软件可用了。我希望V0.9很快就会被支持SATA的版本所取代。\n描述：TRIPUTER V1.0将是第一个使用Peri板所有功能的系统。它将模拟PC532，从SATA设备运行NetBSD，并将有一个以太网接口，便于下载和上传大文件。", "note_en": "I bought in September 2016 an FPGA development board called  Cyclone V GX Starter Kit from Terasic (see Figure 1). It costs 179 US$ and usesa 28-nm FPGA with six 3.125 Gbps transceiver channels from Altera. The board offers a 32-bit wide LPDDR2 DRAM memory with 512 Mbytes capacity. This device has a very high bandwidth for many applications. In addition theboard has a HDMI output, an audio device, an SD card interface, many LEDs and switches and some expansionconnectors.\n The plan is to realize with this board a &#34;multiple computer&#34; system. The name TRIPUTER is an indication of howmany systems will be integrated. The first one will be the PC532 running NetBSD. The second one will be theCeres-3 using Oberon. Currently the last one will be the BBC computer with the 32016 Second Processor.\n Using a commercial board for this purpose is the best choice. Nevertheless the board is not ideal. For example itlacks an Ethernet port and a real time clock. But it is cheap and the used FPGA is a modern one which will be availablefor many years. The missing features can be added through the expansion connectors. I will develop the necessaryhardware for it too.\n The three computers to be integrated are very different from a software point of view. Having them available in onesystem should be an exciting experience. The FPGA of the board is big enough to hold the required hardware.\n  Fig. 1. The initial configuration of the Cyclone V GX Starter Kit is presenting a photo of itself on the screen\n Of course such a complex system is not build over night. But as time goes by the fourth milestone is now achieved:-)\n  Fig. 2. TRIPUTER V0.2 has calculated a Mandelbrot image. M32632 made it 20 times faster than NS32532/NS32381.\n  Fig. 3. The hardwired VT100 terminal of TRIPUTER V0.3 shows the boot process of NetBSD.\n Milestone 4 : TRIPUTER V0.3 is available =&gt; updated to V0.33 again due to some issues in the VT100 terminalemulation.\n Description: version 0.33 of TRIPUTER contains the PC632M system running NetBSD with an SD card. Still thissystem uses the USB connection for the RS232 interface. The image for the SD card is available at Software/NetBSD. The  V0.33 zip archivecontains the following files:\n     The PERI board is an IO board which brings to the FPGA board some necessary extensions: a true RS232 interface,a real time clock (RTC), two PS2 ports for mouse and keyboard, a second SD card connector and a 100 Mbit Ethernetinterface. All of these things are now operational. One port is not yet usable: SATA. The hardware is there, butthe verilog code for this challenging interface must still be written.\n   Fig. 4. The PERI board with the serial number 1 is attached to the Cyclone V GX Starter Kit. 2 of the 3 LEDs ofthe Ethernet interface are active.\n The purpose of PERI is to transform the Starter Kit into a standalone computer. Then all the planned systems canbe implemented.\n To test the functions of the PERI board I have made a new version of TRIPUTER: it is V0.9 . The  V0.9 zip archive contains only three files:\n  The system can only test PERI if the flash is being configured with the pof file. Then some software is available.I hope that V0.9 will be replaced soon with a version which enables SATA...\n  Description: TRIPUTER V1.0 will be the first system that uses all features of the PERI board. It will emulatethe PC532, run NetBSD from a SATA device and will have an Ethernet interface for easy down- and uploading of bigfiles.", "posttime": "2020-07-27 07:23:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "triputer,fpga", "title": "三元机", "title_en": "Triputer", "transed": 1, "url": "http://cpu-ns32k.net/TRIPUTER.html", "via": "", "real_tags": ["triputer", "fpga"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么？指纹识别。与其说这些API被用于它们的本意，不如说它们最终被用于粗俗的广告技术。比如，“嘿，我们不知道你到底是谁，但等等，通过一个脚本，我们可以告诉你，你的手机从早上8点到8点13分不再空闲，而且在蓝牙设备JBL浴室附近，所以很可能是爸爸在拉早上的大便！”让我们尽快给他看一些更好的扬声器和法兰绒衬衫的广告吧。“。\n磁力计API-允许网站访问由设备的初级磁力计传感器检测到的有关用户周围的本地磁场的数据。\nWeb NFC API-允许网站通过设备的NFC读取器与NFC标签通信。\n设备内存API-允许网站接收近似数量的设备内存(以GB为单位)。\n网络信息API-提供有关设备用于与网络通信的连接的信息，并提供在连接类型更改时通知脚本的方法。\n电池状态API-允许网站接收有关托管设备电池状态的信息。\n环境光传感器-让网站通过主机设备的本地传感器获取主机设备周围环境光的当前光级或照度。\nEME的HDCP策略检查扩展-允许网站检查媒体流/播放中使用的HDCP策略。\n接近感应器-允许网站检索由接近感应器测量的有关设备和对象之间距离的数据。\nWebHID-允许网站检索有关本地连接的人机接口设备(HID)设备的信息。\n串行API-允许网站从串行接口写入和读取数据，这些接口由微控制器、3D打印机等设备使用。\n地理位置传感器(背景地理位置)-旧版地理位置API的更现代版本，允许网站访问地理位置数据。\n我的心情很复杂。我确实喜欢这样的想法，即网络是一个有竞争力的平台，可以构建任何类型的应用程序，有时像这样的花哨API会打开这些大门。\n更不用说，其中一些API的设计目的是做一些负责任的事情，比如通过网络信息API了解连接速度，如果可能的话，发送更少的数据，电池状态API也是如此。\n这都是类似于：在CSS中访问的情况。您是否注意到有些CSS声明不能用于访问的链接？JavaScriptAPI甚至会对已访问链接的当前样式撒谎，以使链接始终显示为未访问。因为指纹识别。", "note_en": "Why? Fingerprinting. Rather than these APIs being used for what they are meant for, they end up being used for gross ad tech. As in, “hey, we don’t know exactly who you are, but wait, through a script we can tell your phone stopped being idle from 8:00 am to 8:13 am and were near the Bluetooth device JBL BATHROOM, so it’s probably dad taking his morning poop! Let’s show him some ads for nicer speakers and flannel shirts ASAP.”\n   Magnetometer API – Allows websites to access data about the local magnetic field around a user, as detected by the device’s primary magnetometer sensor.\n Web NFC API – Allows websites to communicate with NFC tags through a device’s NFC reader.\n Device Memory API – Allows websites to receive the approximate amount of device memory in gigabytes.\n Network Information API – Provides information about the connection a device is using to communicate with the network and provides a means for scripts to be notified if the connection type changes\n Battery Status API – Allows websites to receive information about the battery status of the hosting device.\n  Ambient Light Sensor – Lets websites get the current light level or illuminance of the ambient light around the hosting device via the device’s native sensors.\n HDCP Policy Check extension for EME – Allows websites to check for HDCP policies, used in media streaming/playback.\n Proximity Sensor – Allows websites to retrieve data about the distance between a device and an object, as measured by a proximity sensor.\n WebHID – Allows websites to retrieve information about locally connected Human Interface Device (HID) devices.\n Serial API – Allows websites to write and read data from serial interfaces, used by devices such as microcontrollers, 3D printers, and othes.\n  Geolocation Sensor (background geolocation) – A more modern version of the older Geolocation API that lets websites access geolocation data.\n I’m of mixing feelings. I do like the idea of the web being a competitive platform for building any sort of app and sometimes fancy APIs like this open those doors.\n Not to mention that some of these APIs are designed to do responsible things, like knowing connections speeds through the Network Information API and sending less data if you can, and the same for the Battery Status API.\n This is all a similar situation to  :visited in CSS. Have you ever noticed how there are some CSS declarations you can’t use on visited links? JavaScript APIs will  even  literally lie about the current styling of visited links to make links always appear unvisited. Because fingerprinting.", "posttime": "2020-07-27 07:22:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,declined,设备", "title": "出于隐私考虑，苹果拒绝在Safari中实现16个Web API", "title_en": "Apple declined to implement 16 Web APIs in Safari due to privacy concerns", "transed": 1, "url": "https://css-tricks.com/apple-declined-to-implement-16-web-apis-in-safari-due-to-privacy-concerns/", "via": "", "real_tags": ["苹果", "apple", "declined", "设备"]}, {"category": "", "categoryclass": "", "imagename": "1dbe374d3d2860f85610ee891ffe8c4c.jpg", "infoid": 1014336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在SAP突袭并宣布计划以80亿美元收购Qualtrics(Qualtrics)20个月后，这家体验管理软件公司最终可能要上市了。当时，Qualtrics正处于首次公开募股(IPO)的风口浪尖。\n思爱普周日宣布，计划剥离Qualtrics并将其上市。SAP表示，IPO后仍将是Qualtrics的大股东，该公司表示计划在美国进行IPO。\n思爱普在申报文件中写道，鉴于思爱普计划保持多数控制权，预计这笔交易不会对思爱普2020年或“较长期”的财务目标产生影响.。根据这份文件，Qualtrics联合创始人兼首席执行官Ryan Smith预计将成为Qualtrics最大的个人股东。两家公司都没有披露有关计划中的IPO时间的任何指引。\n在提供给福布斯的一份声明中，史密斯表示：自从我们创立Qualtrics以来，我们的目标一直是帮助公司就员工和客户的体验进行大规模对话，并利用我们的系统采取行动。现在是成为高通公司和SAP公司的一部分，这是一个令人兴奋的时刻，我们很高兴能继续建立XM生态系统。“。\n“XM”指的是体验管理，这是Qualtrics软件普及的功劳。Qualtrics由他的父亲和兄弟史密斯于2002年创立，在寻求次年上市之前，Qualtrics在犹他州科技界取得了突破性的成功，并于2017年获得了福布斯(Forbes)的简介。那年11月，在计划进行首次公开募股(IPO)的前四天，总部位于德国的SAP投入80亿美元现金，其中大部分是通过融资获得的，以收购高通(Qualtrics)，交易于2019年1月正式完成。福布斯估计史密斯从那次收购中获得的个人净资产为13亿美元。\n这笔收购的价格约为2018年预期营收约4亿美元的20倍，对SAP来说异常引人注目；这笔交易背后的首席执行官比尔·麦克德莫特(Bill McDermott)几个月后宣布离职，坚称这与维权投资者埃利奥特管理公司(Elliot Management)在此期间持有该公司1%的股份无关。\n最近，高通被一些分析师视为思爱普业务的亮点之一，随着企业努力应对新冠肺炎疫情蔓延的后果，思爱普的业务一直面临逆风。在7月24日的一份报告中，Cowen分析师J.Derrick Wood指出，对60家全球SAP合作伙伴的调查发现，由于买家推迟决策并缩小某些项目的范围，约四分之三的合作伙伴未能实现第二季度的销售目标。这尤其对Concur等业务部门造成了打击，Concur是另一家以前收购的制造旅行和商务费用软件的公司。\n但加拿大皇家银行资本市场(RBC Capital Markets)分析师Alex Zukin在7月初的一份报告中写道，随着企业更多地在网上销售，并需要远程跟踪客户和员工，SAP的电子商务部门和Qualtrics已被证明是亮点。在最近的收益报告中，SAP曾吹捧Qualtrics整合到其他部门，如其人力资源软件部门SuccessFators。\n对于SAP首席执行官克里斯蒂安·克莱因(Christian Klein)来说，剥离其账面上的这一亮点-并寻求间接利用其上行空间-是一个大胆的早期举措。克莱恩在2019年10月与前高管詹妮弗·摩根(Jennifer Morgan)一起担任联席首席执行官后，于今年4月接任唯一的首席执行官一职。在提供给福布斯的声明中，克莱恩表示，高通在2019年的表现超出了我们的预期，并断言，即使剥离，该公司对SAP仍将非常重要。克莱因说：“我们现在和将来都将全力致力于将体验管理和Qualtrics作为我们智能企业战略的一个关键要素。\nQualtrics和SAP将希望IPO能够为两家公司提供两全其美的结果：Qualtrics的软件通过强劲的市场表现支撑SAP业务部门及其财务状况，Qualtrics仍然受益于SAP的客户基础，同时拥有更多的独立性来吸引和补偿人才，进行自己的收购，并在SAP生态系统之外寻找客户和合作伙伴。\n一旦预期中的首次公开募股(IPO)热闹起来，公开市场会在第二轮融资中拥抱高通吗？该公司公布2020年第一季度营收为1.61亿欧元，约合1.88亿美元；当SAP周一公布财报时，分析师和潜在投资者将看到该业务的首个全年季度业绩。该公司上个季度表示，它拥有1.16万客户，GAAP没有盈利。另一家通过在线调查根源追踪客户参与度和体验的公司Medallia公布，上个季度营收为1.127亿美元，增长了20%，市值为42亿美元，较2019年7月的高点下降了30%。\n当然，一个挑战将是执行-不仅是剥离本身，而且是每个政党将如何处理关系。高通首席执行官表示：“解决这些担忧可能是高通公司周日发布的第二份声明的原因：被收购公司的领导班子在收购近两年后仍然完好无损的情况很少见。”它展示了SAP/Qualtrics伙伴关系的力量。“", "note_en": "Twenty months after SAP swooped in and announced its plan to acquire Qualtrics for $8 billion as it was on the cusp of an IPO, the experience management software company may be going public after all.\n  SAP  announced on Sunday that it plans to spin out Qualtrics and take it public. SAP would remain a majority owner of Qualtrics following the IPO, which it said it plans to conduct in the U.S.\n  The transaction is not expected to have an impact on SAP’s 2020 or “longer-term” financial targets given its plan to maintain majority control, SAP wrote in its filing. Qualtrics cofounder and CEO Ryan Smith is expected to be Qualtrics’ largest individual shareholder, per the document. Neither company disclosed any guidance on the timing of the planned IPO.\n     In a statement provided to  Forbes, Smith said: &#34;Ever since we founded Qualtrics, our goal has been to help companies have a conversation at scale about the experiences their employees and customers are having and leverage our system to take action. This is an exciting time to be part of Qualtrics and SAP, and we’re excited to continue building out the XM ecosystem.”\n  That “XM” refers to experience management, a category of software Qualtrics takes credit for popularizing. Founded by Smith, his father and brother in 2002, Qualtrics emerged as a breakout success for Utah’s tech community, subject to a  Forbes profile  in 2017, before looking to go public the following year. Four days before its intended IPO that  November, Germany-based SAP plunked down $8 billion in cash, much of it secured through financing, to buy Qualtrics in a deal that formally closed in January 2019.  Forbes values Smith’s personal net worth from that acquisition at $1.3 billion.\n    At a price of about 20x its expected revenue in 2018 of about $400 million, the acquisition was unusually splashy for SAP; the CEO behind the deal, Bill McDermott announced his departure a few months later, insisting it was unrelated to activist investor Elliot Management taking a 1% stake in the company in the interim.\n  More recently, Qualtrics has been seen by some analysts as one of the bright spots of SAP’s business, which has faced headwinds as companies grapple with the consequences of the spread of the Covid-19 pandemic. In a July 24 report, Cowen analyst J. Derrick Wood noted that a survey of 60 global SAP partner found that about three-quarters had missed their second-quarter sales targets as buyers delayed decisions and reduced the scope of certain projects. That’s especially hit business units like Concur, another former acquisition that makes travel and business expense software.\n  But as businesses sell more online and need to track customers and employees remotely, SAP’s e-commerce units and Qualtrics have proven bright spots, RBC Capital Markets analyst Alex Zukin wrote in a note earlier in July. In recent earnings reports, SAP had touted Qualtrics’ integration into other units such as its human resources software unit, SuccessFactors.\n    To spin out that bright spot in its books — and look to ride its upside indirectly — is a bold early move for SAP chief executive Christian Klein, who took over as sole CEO  in April after serving as co-CEO alongside former executive Jennifer Morgan in October 2019. In statements provided to  Forbes, Klein said “Qualtrics beat our expectations” in 2019 and asserted that the company would remain important to SAP even with the spin-out. &#34;We are and will be fully committed to Experience Management and Qualtrics being a key element of our Intelligent Enterprise Strategy,” Klein said.\n  Qualtrics and SAP will hope that an IPO can offer each company the best of both worlds: Qualtrics’ software bolstering SAP business units and its financials through strong market performance, with Qualtrics still benefitting from SAP’s customer base while having more independence to attract and compensate talent, make its own acquisitions, and pursue customers and partners outside the SAP ecosystem.\n  Once a buzzy expected IPO, will the public market embrace Qualtrics on a second go around? The company reported revenue of 161 million Euros, or about $188 million, for Q1 2020; when SAP reports earnings on Monday, analysts and potential investors will get to see the first full year-to-year quarterly results for the business, which said last quarter it had 11,600 customers and was not GAAP profitable. Medallia, another company that tracks customer engagement and experiences with online survey roots, reported revenue of $112.7 million in its last quarter, growth of 20%, and trades at a market capitalization of $4.2 billion, down 30% from its July 2019 high.\n  One challenge, of course, will be in the execution — not just of a spin-out itself, but in how each party will handle the relationship. Addressing those concerns might be the cause of the second statement Qualtrics issued from Smith on Sunday: &#34;It’s rare to have the leadership team of an acquired company remain intact almost two years post acquisition,” Qualtrics’ CEO said. “It demonstrates the strength of SAP/Qualtrics partnership.”", "posttime": "2020-07-27 06:26:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,用户体验,宣布,announces,qualtrics", "title": "SAP宣布计划剥离其在2018年以80亿美元收购的用户体验管理平台Qualtrics，并在美国进行IPO", "title_en": "SAP announces plans to spin out Qualtrics, a user experience management platform it acquired in 2018 for $8B, with an IPO in the US", "transed": 1, "url": "https://www.forbes.com/sites/alexkonrad/2020/07/26/sap-plans-to-spin-out-qualtrics-for-ipo/", "via": "", "real_tags": ["美国", "用户体验", "宣布", "announces", "qualtrics"]}, {"category": "", "categoryclass": "", "imagename": "9f66792194159da70b6ab8b2397e98bc.png", "infoid": 1014333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2016年，索菲·贾马尔的职业生涯出现了转折。这位骨骼研究人员和医生在加拿大被禁止终身接受联邦资金，此前一个委员会发现她犯有操纵数据、向调查人员提交伪造证据并将伪造数据归咎于一名研究助理的罪行。她还被勒令偿还从加拿大卫生研究所获得的超过25.3万加元的资金。然后，在2018年3月，她被吊销了医生执照。\n两年后，贾马尔又回到了医学界。据多伦多太阳报报道，在她向安大略省医师和外科学院提交证据表明她的不当行为是她长期精神健康问题的直接结果后，她的行医执照被恢复。她现在可以回到内分泌科执业，只要她不进行临床研究，继续治疗她的精神健康问题。\n贾马尔是否适合回去治疗病人，这是加拿大的医疗机构和机构决定的事情。事实是，犯有研究不端行为的科学家通常只需一记耳光就能逃脱惩罚--也就是说，如果他们一开始就被抓住的话。今年早些时候公布的一项针对8所欧洲大学1100多名研究人员的调查发现，大量研究不当行为没有上报，职业生涯早期的研究人员揭发的可能性最小。", "note_en": "I n 2016, Sophie Jamal’s career took a turn for the worse. The bone researcher and physician was  banned from federal funding for life in Canada after a committee found her guilty of manipulating data, presenting fabricated evidence to investigators, and blaming a research assistant for the fudged data. She was also ordered to pay back more than 253,000 Canadian dollars she had received in funding from the Canada Institute of Health Research. Then, in March 2018, she was stripped of her medical license.\n Two years later, Jamal is back on the medical scene. According to The Toronto Sun, her medical license  was reinstated after she presented evidence to the College of Physicians and Surgeons of Ontario showing that her misconduct was a direct result of her long-term mental health problems. She can now return to practicing as an endocrinologist, as long as she doesn’t conduct clinical research and continues therapy for her mental health problems.\n Whether it’s fit for Jamal to return to treating patients is a matter for medical bodies and institutions in Canada to decide. What’s true is that scientists guilty of research misconduct often get away with nothing more than a slap on the wrist — that is, if they’re even caught in the first place.  A survey of more than 1,100 researchers at eight European universities published earlier this year found that a large amount of research misconduct goes unreported, with early-career researchers the least likely to blow the whistle.", "posttime": "2020-07-27 06:25:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "研究,research", "title": "是时候严肃对待研究欺诈了", "title_en": "It's time to get serious about research fraud", "transed": 1, "url": "https://undark.org/2020/07/23/cracking-down-on-research-fraud", "via": "", "real_tags": ["研究", "research"]}, {"category": "", "categoryclass": "", "imagename": "10434929b8abf863a106840437966e35.jpg", "infoid": 1014332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "芝加哥(WLS)--被指控侵入伊利诺伊州选举数据库的12名俄罗斯人可能曾担任情报人员，但i-team已经了解到，他们并没有利用高于平均水平的计算机智能来实施这起抢劫案。根据联邦调查人员的说法，俄罗斯黑客使用了信息窃贼使用的一种常见的计算机技巧。这起电子入侵事件发生在2016年7月的伊利诺伊州选举委员会，是通过一种名为SQL注入的黑客技术进行的。根据上周提交的针对12名俄罗斯特工的联邦起诉书和州选举官员的信息，据信约50万伊利诺伊州选民的姓名、地址、出生日期、驾照号码和部分社保号码被盗。伊利诺伊州选举委员会发言人马特·迪特里希(Matt Dietrich)表示：对于很多选民来说，他们非常担心在我投票后会有俄罗斯黑客入侵并窃取我的选票。伊利诺伊州没有一张选票因为两年前的情况而改变。没有一张选票试图以此为基础进行更改。这不是目标。如果目标仅仅是获取访问、窃取信息和挑拨离间，那么俄罗斯的行动似乎成功了。伊利诺伊州民主党参议员迪克·德宾(Dick Durbin)周二表示，俄罗斯人侵入了选举官员和供应商的计算机网络，以窃取选民数据和其他信息。我们知道俄罗斯干预了2016年大选，我们也知道我们应该为俄罗斯干预2018年中期选举做好准备。SQL是结构化查询语言(Structural Query Language)的首字母缩写，是一种数据库编程语言。SQL注入是一种常见的网络欺骗手段，用于非法访问政府、金融、商业和私人计算机。专家估计，每10个数据泄露中就有8个是由SQL注入造成的。黑客青睐的策略通常以在公共网页表单上键入某些命令开始，以广泛访问网站的服务器结束。在伊利诺伊州的案例中，黑客在选举数据库搜索框中输入了一个特制的代码后，记录被盗，委员会不得不关闭登记10天。当时，联邦调查局向全美各州选举当局发出了特别警告。数字指纹多次引导调查人员远离真正的罪犯。正如i-Team在2016年透露的那样，伊利诺伊州的网络攻击者似乎与土耳其一个政党有关联。然而，两年后的今天，联邦特工表示，他们已经追踪到这次袭击发生在俄罗斯。伊利诺伊州选举官员表示，他们已经采取措施保护选民数据库和网络应用程序的安全。州调查人员确定，处理器使用率已飙升至100%，但没有任何解释。他们说，对服务器日志的分析表明，沉重的负载是在无纸在线选民申请(POVA)网站的申请状态页面上快速重复数据库查询的结果。州政府官员表示，已经制定了新的协议，以防止再次发生此类恶意攻击。我们从对攻击的分析中得出结论，我们可以合理地预计各种IVRS(伊利诺伊州选民登记系统)密码被攻破。这些密码包括选举当局、其工作人员、内部SBE用户、供应商和Web服务的密码。为了确保攻击者不能用被盗的密码访问系统的任何部分。&#34；根据内部报告，当局重置所有IVRS密码，以迫使用户在下次登录时更改其密码；引入增强的密码复杂性要求(长度、特殊字符、数字等)；强制所有IVRS用户进行双因素令牌登录；向IVRS数据库添加密码加密，以便即使是SBE员工也无法再破译存储的密码。迪特里希说：两年前入侵事件发生后，我们安装了新的防火墙硬件和软件，我们专门派人负责网络安全，以支持系统，确保这种情况不会再次发生。SQL注入策略已被世界各地的黑客用来进入公司数据库、银行和政府机构。击键技巧通常利用允许未经授权访问的数据库中常见的漏洞。编者按：这个故事的早期版本对SQL的定义不准确。自那以后，这一点已经得到纠正。", "note_en": "CHICAGO (WLS) -- The twelve Russians charged with hacking into Illinois&#39; election database may have worked as intelligence agents, but the I-Team has learned it didn&#39;t take above-average computer intelligence to pull off the heist.  Russian hackers used a common computer trick employed by info-thieves, according to federal investigators.   The electronic intrusion, which occurred in July of 2016 at the Illinois State Board of Election, was via a hacking technique called &#34;SQL injection.&#34; The names, addresses, dates of birth, driver&#39;s license numbers and partial Social Security numbers of about 500,000 Illinois voters are believed to have been stolen, according to federal indictments handed up last week against a dozen Russian operatives and information from state election officials.  &#34;For a lot of voters there has been a lot of fear that there is going to be Russian hacking and stealing my vote after I cast my vote&#34; said Matt Dietrich, spokesperson for the Illinois State Board of Elections. &#34;Not one vote was changed in Illinois based on what happened 2 years ago. Not one vote was attempted to be changed based on that. That was not the object.&#34;  If the object was to simply gain access, grab information and sow discord, then the Russian operation seems to have succeeded.  &#34;The Russians hacked into the computer networks of election officials and vendors in order to steal voter data and other information&#34; said Sen. Dick Durbin , D-Illinois on Tuesday. &#34;We know that Russia meddled in the 2016 election and we know that we should be gearing up for the Russians to interfere with the 2018 midterm election as well.&#34;  SQL, an acronym for Structured Query Language, is a database programming language. An &#34;SQL injection&#34; is a common piece of cyber-trickery used to illegally gain access to government, financial, business and private computers. Experts estimate that 8 of every 10 data breaches occur as a result of SQL injection.   The favored tactic of hackers usually begins with certain commands typed on a public web form and ends with broad access to the site&#39;s server. In the case of Illinois, after hackers typed a specially-crafted code into the election database search box, records were stolen and the board had to shut down registration for ten days.  At the time the FBI put out a special alert to state election authorities across the U.S. Many times the digital fingerprint leads investigators away from the actual culprits. As the I-Team revealed in 2016, Illinois cyber-attackers appeared to be a connected to a Turkish political party. Now though, two years later, federal agents say they have traced the attack to Russia.  Illinois election officials say they have taken measures to secure voter databases and web applications.  &#34;Processor usage had spiked to 100% with no explanation&#34;  state investigators determined. &#34;Analysis of server logs revealed that the heavy load was a result of rapidly repeated database queries on the application status page of the Paperless Online Voter Application (POVA) web site&#34; they said.  State officials say new protocols are in place to prevent another such malicious attack.   &#34;We concluded from the analysis of the attack that we could reasonably expect that various IVRS (Illinois Voter Registration System) passwords were compromised. These passwords included those of election authorities, their staffs, internal SBE users, vendors, and web services. In order to ensure that attackers could not access any portion of the system with stolen passwords.&#34;  According to internal reports, authorities reset all IVRS passwords in order to force users to change their password at next login; introduced enhanced password complexity requirements (length, special characters, numbers, etc.); mandated two-factor token login for all IVRS users; added password encryption to the IVRS database so that stored passwords could no longer be deciphered, even by SBE employees.  &#34;In the wake of the breach 2 years ago we installed new firewall hardware and software we devoted personnel specifically to cyber security to shore up the system to make sure it wasn&#39;t going to happen again&#34; said Dietrich.  The SQL injection ploy has been used by hackers around the world to gain access to corporate databases, banks and government agencies. The keystroke trick usually exploits vulnerabilities that are commonly present in databases that allow unauthorized access.   EDITOR&#39;S NOTE: An earlier version of this story had an inaccurate definition of SQL. This has since been corrected.", "posttime": "2020-07-27 06:24:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,选举,penetrated,密码", "title": "俄罗斯人是如何渗透伊利诺伊州选举计算机的", "title_en": "How the Russians penetrated Illinois election computers", "transed": 1, "url": "https://abc7chicago.com/russia-russian-hacking-elections-illinois/3778816/", "via": "", "real_tags": ["俄罗斯", "选举", "密码"]}, {"category": "", "categoryclass": "", "imagename": "1fde3d0ed3326ab7923c5bf416b47e5e.jpg", "infoid": 1014331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司因涉嫌拒绝帮助那些遭受iTunes礼品卡诈骗的人而被起诉。该公司已被提起11项集体诉讼。\n苹果称无法追踪或退还…卡的价值，因此被指控撒谎。\n有大量的骗局，涉及预付礼品卡，如商店卡和iTunes礼品卡。以下是联邦贸易委员会对它们的描述。\n许多不同种类的冒名顶替者要求你用礼品卡付款。有人可能会打电话给你，声称自己是美国国税局的人，正在追回税款或罚款。打电话的人可能会说他是技术支持的，想要钱来修理你的电脑。打电话的人甚至可能会说她是有紧急情况的家庭成员，现在需要钱。\n但他们都有一个共同点，那就是迫切需要你立即汇款[…]。一旦你买了卡，呼叫者就会要求你在卡的背面输入礼品卡的卡号和密码。这些数字可以让他们立即拿到你存到卡上的钱。一旦他们这么做了，骗子和你的钱就不见了，通常没有任何踪迹。\n诈骗者通常用商店卡购买笔记本电脑和智能手机等高价值产品，然后再出售。ITunes礼品卡诈骗的工作方式通常略有不同，通常被用来购买骗子拥有的付费应用程序，因此当苹果支付时，他们会获得70%的钱。\n诉讼称，苹果告诉诈骗受害者，一旦钱花完就无能为力了，但辩称这不是真的。事实上，苹果持有100%的资金，期限为4-6周，从购买的应用程序到苹果向开发者支付的费用。在此期间，该公司可以退还卡价值的100%。\n此外，苹果还收取30%的佣金，因此即使在诈骗者拿到钱之后，也总是有能力退还这么多钱。\n绝大多数受害者没有向联邦贸易委员会(“FTC”)报告诈骗。然而，即使是2015-2019年期间向联邦贸易委员会报告的有限的iTunes礼品卡骗局也超过了9350万美元，金额每年都在大幅增加。这些公开报告的美元金额只包括填写详细的在线FTC表格要求提供个人信息的受害者子集的损失。因此，这个9,350万美元的数字似乎只是冰山一角。\n即使只有10%的诈骗受害者向联邦贸易委员会报案(与当地警方、总检察长办公室、苹果公司或任何人相比)，iTunes礼品卡诈骗金额也将接近10亿美元，苹果公司将保留3亿美元的佣金。\n许多诈骗受害者是老年人，因此11项指控中有3项指控苹果违反了旨在保护老年人免受财务滥用的法律。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Apple is being sued for allegedly refusing to help those who have fallen victim to a  iTunes gift card scam. An 11-count class action lawsuit has been filed against the company.\n Apple is accused of lying when it says that there is no way to trace or refund the value of the cards …\n  There are a large number of scams which involve pre-paid gift cards like store cards and  iTunes gift cards. Here’s how the  FTC describes them.\n Many different kinds of imposters ask you to pay with gift cards. Someone might call you and claim to be from the IRS, collecting back taxes or fines. The caller might say he’s from tech support, asking for money to fix your computer. The caller might even say she’s a family member with an emergency and needs money right now.\n But they all have in common an urgent need for you to send money right away […] Once you buy the card, the caller then will demand the gift card number and PIN on the back of the card. Those numbers let them immediately get the money you loaded onto the card. And once they’ve done that, the scammers and your money are gone, usually without a trace.\n With store cards, the scammers usually buy high-value products like laptops and smartphones, which are then sold. iTunes gift card scams usually work in a slightly different way, typically being used to buy paid apps owned by the scammers, so they receive 70% of the money when paid by Apple.\n The  lawsuit says that Apple tells scam victims there is nothing that can be done once the money has been spent, but argues that this isn’t true. In fact, Apple holds 100% of the funds for a period of 4-6 weeks, between the apps being purchased and Apple paying the developer. During this time, the company is in a position to refund 100% of the card value.\n Additionally, Apple takes a 30% commission, so would  always be in a position to refund this much, even after the scammer has been paid.\n  The overwhelming majority of victims do not report the scam to the Federal Trade Commission (“FTC”). Yet even the limited iTunes gift card scams reported to the FTC during 2015-2019 exceed $93.5 million, with the dollar amounts increasing significantly each year. These publicly reported dollar amounts include the losses of only the subset of victims who fill out a detailed online FTC form asking for their personal information. As a result, this $93.5 million figure appears to be only the tip of the iceberg.\n Even if only 10% of scam victims report to the FTC (versus local police, attorney general offices, Apple, or nobody at all), the iTunes gift card scam would approach $1 billion, with Apple retaining $300 million in commissions.\n Many scam victims are elders, so three of the eleven counts accuse Apple of being in violation of laws designed to protect elderly people from financial abuse.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-07-27 05:56:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,拒绝,sued", "title": "苹果因拒绝帮助iTunes礼品卡诈骗受害者而被起诉", "title_en": "Apple Being Sued For Refusing To Help ITunes Gift Card Scam Victims", "transed": 1, "url": "https://9to5mac.com/2020/07/20/itunes-gift-card-scam/", "via": "", "real_tags": ["苹果", "apple", "拒绝", "sued"]}]