[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近在Twitter上看到了一个有趣的帖子，讨论一个假设的场景，即研究论文发表在GitHub上，随后的论文与原始论文不同。信息过载一直是ML的一个真正的问题，因为每个月都会有如此多的新论文面世。如果您可以将一篇论文表示为代码diff，许多论文可以压缩到&lt；50行：)diff也会更直观地阅读和评估标准化。有些想法太不同了，这不适用，但我认为这对大多数人都很管用。https://t.co/JoAcIK9Cm7。\n-丹尼·布里茨(@dennybritz)2020年4月25日。\n这篇文章是一个有趣的实验，展示了Bert论文及其后续版本的提交历史可能是什么样子。", "note_en": "I recently came across an interesting thread on Twitter discussing a hypothetical scenario where research papers are published on GitHub and subsequent papers are diffs over the original paper. Information overload has been a real problem in  ML with so many new papers coming every month.  If you could represent a paper as a code diff, many papers could be compressed down to &lt;50 lines :) The diff would also be more intuitive to read and eval standardized.  Some ideas are so different that this wouldn’t apply, but I think it would work well for the majority.  https://t.co/JoAcIK9Cm7\n— Denny Britz (@dennybritz)  April 25, 2020\n This post is a fun experiment showcasing how the commit history could look like for the  BERT paper and some of its subsequent variants.", "posttime": "2020-05-09 21:25:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,papers", "title": "如果研究论文受版本控制会怎么样？", "title_en": "What If Research Papers Were Version Controlled?", "transed": 1, "url": "https://amitness.com/2020/05/git-log-of-bert/", "via": "", "real_tags": ["论文", "papers"]}, {"category": "", "categoryclass": "", "imagename": "7ac48370c8c16ad1194f8091fe6522e1.png", "infoid": 1001386, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它的目标是为用户提供用户友好且功能强大的界面，以及极高的可伸缩性，以处理包含数百万个文件和数百万个提交的存储库。\nEdenSCM的可伸缩性目标是确保所有源代码管理操作都随着开发人员使用的文件数量而不是存储库本身的大小进行扩展。这样，即使在拥有许多长文件和非常长的注释的大型存储库中，也能实现快速、高效的开发人员体验。\n伊甸园CLI最初是基于Mercurial的，并且共享Mercurial的UI和特性的许多方面。\nEden CLI目前在Linux、Mac和Windows上构建和运行。py脚本是构建CLI的主界面。\n尽管EdenSCM最初是从Mercurial演变而来的，但它并不是一个分布式的源代码控制系统。为了支持海量存储库，签出存储库时并不会将所有存储库数据都下载到客户端系统。理想情况下，客户端只下载最少量的数据必需品，然后在需要时从服务器获取额外的数据。\nMononoke目前只能在Linux上构建和运行，还不能在Facebook内部环境之外构建。用铁锈公司的货物建造系统支持Mononoke的工作仍在进行中。\nEdenFS只在访问时按需填充工作目录文件，从而加快了大型存储库中的操作速度。这使得像签出这样的操作变得更快，但在第一次访问新文件时会对性能造成很小的影响。这在大型存储库中非常有用，在大型存储库中，开发人员一次通常只使用存储库的一小部分。\nEdenFS与使用稀疏结账具有类似的性能优势，但用户体验要好得多。与稀疏签出不同，EdenFS不需要手动管理要签出的文件列表，并且用户可以透明地访问任何文件，而无需更新配置文件。\nEdenFS还可以跟踪哪些文件已被修改，从而实现无需扫描工作目录的非常高效的状态查询。文件系统监视工具Watchman还与EdenFS集成，使其能够更高效地跟踪文件系统的更新。\n构建EdenFS的推荐方式是在存储库的顶层使用build.sh脚本。在构建EdenFS本身之前，此脚本将下载并构建EdenFS的所有必需依赖项。在Windows上，使用build.bat脚本而不是build.sh。\n此构建脚本将在存储库之外创建一个输出目录，它将在其中执行构建。您可以通过向构建脚本传递--sccratch-path参数来控制此输出目录位置。\nEdenSCM是Facebook使用的主要源代码控制系统，用于Facebook的主要monorepo代码库。\n对在Facebook之外使用EdenSCM的支持仍处于高度试验性阶段。虽然如果您遇到问题，我们很有兴趣听到反馈，但支持外部用户目前并不是开发团队的优先事项，因此很遗憾，我们目前不能保证立即提供支持。", "note_en": "It aims to provide both user-friendly and powerful interfaces for users, aswell as extreme scalability to deal with repositories containing many millionsof files and many millions of commits.\n   EdenSCM&#39;s scalability goals are to ensure that all source control operationsscale with the number of files in use by a developer, and not with the size ofthe repository itself. This enables fast, performant developer experienceseven in massive repositories with many long files and very long commithistories.\n  The  eden CLI was originally based on Mercurial, and shares many aspects of the UIand features of Mercurial.\n   The  eden CLI currently builds and runs on Linux, Mac, and Windows. The setup.py script is the main interface for building the CLI.\n   Despite having originally evolved from Mercurial, EdenSCM is not a distributedsource control system. In order to support massive repositories, not allrepository data is downloaded to the client system when checking out arepository. Clients ideally only download the minimal amount of datanecessary, and then fetch additional data from the server as it is needed.\n   Mononoke currently builds and runs only on Linux, and is not yet buildableoutside of Facebook&#39;s internal environment. Work is still in progress tosupport building Mononoke with Rust&#39;s  cargo build system.\n   EdenFS speeds up operations in large repositories by only populating workingdirectory files on demand, as they are accessed. This makes operations like checkout much faster, in exchange for a small performance hit when firstaccessing new files. This is quite beneficial in large repositories wheredevelopers often only work with a small subset of the repository at a time.\n EdenFS has similar performance advantages to using sparse checkouts, but a muchbetter user experience. Unlike with sparse checkouts, EdenFS does not requiremanually curating the list of files to check out, and users can transparentlyaccess any file without needing to update the profile.\n EdenFS also keeps track of which files have been modified, allowing veryefficient  status queries that do not need to scan the working directory.The filesystem monitoring tool  Watchmanalso integrates with EdenFS, allowing it to more efficiently track updates tothe filesystem.\n   The recommended way to build EdenFS is using the  build.sh script in thetop-level of the repository. This script will download and build all of thenecessary dependencies for EdenFS, before building EdenFS itself. On Windowsuse the  build.bat script instead of  build.sh.\n This build script will create an output directory outside of the repositorywhere it will perform the build. You can control this output directorylocation by passing a  --scratch-path argument to the build script.\n  EdenSCM is the primary source control system used at Facebook, and is used forFacebook&#39;s main  monorepo code base.\n Support for using EdenSCM outside of Facebook is still highly experimental.While we would be interested to hear feedback if you run into issues,supporting external users is not currently a high priority for the developmentteam, so we unfortunately cannot guarantee prompt support at this time.", "posttime": "2020-05-09 21:19:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,伊甸园,eden,文件", "title": "Facebook伊甸园单库", "title_en": "Facebook Eden Monorepository", "transed": 1, "url": "https://github.com/facebookexperimental/eden", "via": "", "real_tags": ["facebook", "伊甸园", "eden", "文件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章。\n英国“金融时报”周一至周六送到你家或办公室，包括英国“金融时报”周末报纸和副刊", "note_en": "For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues\n  The FT delivered to your home or office Monday to Saturday, including the FT Weekend paper and supplements", "posttime": "2020-05-09 21:19:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股市,交易,崩盘,crash,金融时报", "title": "闪电崩盘--重创美国股市的交易高手", "title_en": "Flash Crash – the trading savant who crashed the US stock market", "transed": 1, "url": "https://www.ft.com/content/5ca93932-8de7-11ea-a8ec-961a33ba80aa", "via": "", "real_tags": ["股市", "交易", "崩盘", "crash", "金融时报"]}, {"category": "", "categoryclass": "", "imagename": "d585f903c88864acc6835a45cc6bd7a8.jpeg", "infoid": 1001384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由芬兰教授团队开发的疫苗测试可能在6月下旬仲夏前后开始。图片来源：Sami Takkinen/Yle", "note_en": "Testing of the vaccine developed by a team of Finnish professors could start &#34;around midsummer&#34; - in late June. Image: Sami Takkinen / Yle", "posttime": "2020-05-09 21:18:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,开源,开发,病毒", "title": "芬兰开发的开源冠状病毒疫苗即将投入测试", "title_en": "Finnish-developed, open-source coronavirus vaccine nearly ready for testing", "transed": 1, "url": "https://yle.fi/uutiset/osasto/news/finnish-developed_open-source_coronavirus_vaccine_nearly_ready_for_testing/11342151", "via": "", "real_tags": ["冠状病毒", "开源", "开发", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "f5c2e02051b01b1d09b31ee23abcee5e.jpg", "infoid": 1001382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国的一些城镇，校车正沿着街区缓缓行驶，但请不要试图跳上车。\n为了接触到家里没有稳定WiFi的学生，加利福尼亚州、北卡罗来纳州和宾夕法尼亚州的学区正在向贫困和农村社区派遣配备长途路由器的公交车。\n德克萨斯州的一个学区每个工作日从早上8点到下午2点都会把公交车停在公园里。WiFi连接的覆盖范围为200英尺，家里没有稳定互联网接入的家庭会把车停在路边使用。\n皮尤研究中心的数据显示，大约27%的美国人没有家庭宽带接入。但现在，家庭互联网已经成为许多学生和白领的必备条件，地方政府和公司正在拼凑紧急修复措施：\n图书馆和政府办公室已经调整或升级了他们的路由器，以瞄准户外，使停车场成为连接的枢纽。\n非营利信息技术灾难资源中心正在资助农村教堂和其他关键地区的WiFi安装项目。\n在秘鲁，Facebook正在测试一款应用程序，该应用程序可以将网站变成低提升的文本页面，并为人们提供免费的互联网数据供其使用。\n这些都是暂时的救命稻草，它们并没有解决根本问题：农村地区的家庭宽带比城市更贵，但它的表现往往更差。\n一些地方正在提供解决方案，即使在大流行消退后，他们也可以流式播放碧昂斯/梅根·西奥的混音。例如，西科罗拉多州最近完成了DIY宽带网络的收尾工作。\n其他倡导者正在推动更大的东西：现代版本的农村电气化法案，这一次的重点是普遍的互联网连接。\n时机似乎恰到好处。REA是在1936年签署的-不久之后，你知道，另一场大萧条。\n学区正在将WiFi连接带到比以往任何时候都更需要它们的社区。..。\n多读。\n其中一人上传了一张Wink五金件的照片，照片中的Wink五金件“属于它的地方”--在厕所里。..。\n多读。\n由于供应链中断，他们别无选择，只能在视频中展示他们的鲜花和菠萝。..。\n多读。\n温迪的“新鲜，永不冷冻”的承诺使这家连锁店缺乏必要的供应。..。\n多读", "note_en": "School buses are trundling down the block in some US towns — but please don’t try to hop on board.\n To reach students without stable WiFi at home, school districts in California, North Carolina, and Pennsylvania are  sending buses equipped with long-distance routers to poor and rural neighborhoods.\n One Texas school district keeps its buses in park from 8am to 2pm every weekday. The WiFi connection has a 200-ft reach, and families who lack stable internet access at home pull over in their cars to use it.\n  About 27% of Americans don’t have home broadband access,  according to Pew. But now that home internet has become a requirement for many students and white-collar workers, local governments and companies are patching together emergency fixes:\n Libraries and government offices have adjusted or upgraded their routers to target the outdoors, making  parking lots a hub of connectivity.\n   The nonprofit Information Technology Disaster Resource Center is bankrolling WiFi installation projects in  rural churches and other key areas.\n In Peru, Facebook is  testing an app that turns websites into low-lift text pages and offering free internet data for people to use it.\n  These are temporary salves, and they don’t roll back the underlying problem: Home broadband is  more expensive in rural areas than in cities, yet it tends to perform worse.\n Some localities are serving up solutions that will let them stream  that Beyoncé/Megan Thee Stallion remix even after the pandemic subsides. Western Colorado, for instance, recently put the finishing touches on a  DIY broadband network.\n Other advocates are  pushing for something even bigger: A modern version of the Rural Electrification Act, this time focused on universal internet connectivity.\n The timing seems to fit. The REA was signed in 1936 — soon after, you know, that other great depression.\n    School districts are bringing WiFi connections to communities that need them now more than ever. ...\n Read More\n One of them posted a photo of Wink hardware “where it belongs” -- in the toilet. ...\n Read More\n    With supply chains disrupted, they have no choice but to pitch their flowers and pineapples on video. ...\n Read More\n    The Wendy’s “fresh, never frozen” promise left the chain lacking necessary supplies. ...\n Read More", "posttime": "2020-05-09 20:59:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wifi,地区,districts", "title": "学区正在向贫困和农村地区派遣配备WiFi的公交车", "title_en": "School districts are sending WiFi-equipped buses to poor and rural neighborhoods", "transed": 1, "url": "https://thehustle.co/05082020-wifi-school-busses/", "via": "", "real_tags": ["wifi", "地区", "districts"]}, {"category": "", "categoryclass": "", "imagename": "a7cc2c2b4c56f4d0b1a2fd14271141b0.jpg", "infoid": 1001381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约一年前，我写了一篇关于麦肯齐·贝佐斯的故事。这位小说家最近与亚马逊首席执行官杰夫·贝佐斯离婚，并宣布她计划捐赠自己的大部分财富，当时估计价值超过360亿美元。我认为，虽然麦肯齐的这一举措令人钦佩，但依靠富人的慷慨并不能解决社会问题。\n大约在那个时候，信息开始到达：在数百封电子邮件、电话和短信中，人们向我铺天盖地地说些陈词滥调和求婚，分享创业想法，讲述杂乱无章的个人故事。不过，大多数时候，他们都会索要钱。我不明白发生了什么，至少一开始不明白。作为一名记者，我通常不会像一位自称30岁的韩国人那样回复电子邮件，要求我给他们买一辆保时捷。\n我慢慢意识到我没有被垃圾邮件攻击，至少不是传统意义上的垃圾邮件。相反，我被误认为是麦肯齐·贝佐斯本人。为什么成百上千的人最终找到了布鲁克林的一个随机的女人，而不是一个有权势的亿万富翁？答案被证明是一家更强大的科技公司的结果：谷歌。\n当“连线”杂志发表那篇关于麦肯齐的报道时，文章页面嵌入了我的电子邮件地址和一个电话号码。它的目的是让读者分享反馈或发送提示-这在记者和作家中是一种常见的做法。自从麦肯齐的名字出现在文章中，谷歌就开始用我的信息删除段落，就好像它是她的一样。如果你在谷歌上搜索“麦肯齐·贝佐斯的电话号码”、“麦肯齐·贝佐斯的联系人”或类似的东西，我的电子邮件地址和电话号码很可能会出现在搜索结果的顶部，突出地显示在一个被公司称为“特色片段”的独立框中。\n并不是每个联系我的人都完全相信我是麦肯齐--本月早些时候，有人在一条消息中写道：“当然，这是一封欺诈性的电子邮件。”但似乎有足够多的人相信我是麦肯齐。自去年5月以来，我收到了无数条信息，其中一些描述了令人心碎的情况，另一些几乎无法辨认。这些天来，由于大流行，他们采取了半世界末日的转折。一位来自英国的人最近申请资金，为他们的家人和朋友建造一个地下掩体。“我应该告诉你更多关于我自己的事。他们写道：“我没有习惯向别人索要200万GB，但这种病毒教会了我，我需要为大的一场做好准备。”\n从去年11月开始，我三次联系谷歌的新闻电子邮件，试图解决我的问题。2月份，我感到绝望，问“连线”杂志是否可以做些什么来让它停止。我写道：“我又一次遇到了麦肯齐·贝佐斯的问题，在过去的几周里，我收到了大约100封来自谷歌用户的电子邮件，他们认为我是她，或者认为我是她的同事。”“如果”连线“有什么能帮上忙的，请告诉我。”在我说我计划写下我的经历之后，我终于在这周收到了谷歌的回复。\n谷歌发言人劳拉·莱文(Lara Levin)在一封电子邮件中说，“在人们搜索在线上不易找到的电话号码之类的内容时，我们的系统会认为这些页面(包括那些完全相同的关键字加上一个电话号码)是可用的最佳匹配，即使这个电话号码不是该实体的正确号码，”谷歌发言人劳拉·莱文(Lara Levin)在一封电子邮件中说。莱文补充说，该公司计划研究如何改进其系统，以便“更好地识别”电话号码何时不应该作为特色片段重新出现。\n在此之前，唯一的办法就是《连线》重新配置其网站，以防止谷歌窃取我的联系信息。当然，我可以把我的电子邮件地址和电话号码一起记下来，但我想让人们知道如何联系到我，以便做好我的工作。我可以接受陌生人来找我--我只是不想让他们认为我是个亿万富翁慈善家。\n你觉得有什么我们应该知道的吗？你可以通过Louise_Matsakis@wired.com或电话347-966-3806联系到这位不是亿万富翁的作家。\n谷歌宣称的使命一直是“组织世界的信息”。在很长一段时间里，它主要通过对搜索结果进行排名来做到这一点。在谷歌的搜索栏中输入一个问题或关键字，它会返回一个网站列表，它的算法认为最有可能包含你的问题的答案。你需要点击来找到你想要的东西--谷歌是一个门户网站，而不是一个目的地。八年前，该公司推出“知识图谱”(Knowledge Graph)，从根本上改变了这种安排。\n现在，谷歌经常试图直接回答你的问题，方法是将维基百科等网站的信息放入它称之为“特色片段”或“知识面板”的框中，这些框出现在传统搜索结果的上方或旁边。例如，如果你查找一位名人的净资产，谷歌可能会从CelebrityNetWorth.com之类的地方抓取信息。特别是在移动设备上，这些小部件便于用户搜索快速答案，从而避免了挖掘由多个来源发布的信息的需要。\n谷歌的特色代码片段和知识面板是由算法控制的，很大程度上没有经过准确性的预先筛选。这意味着谷歌从互联网其他地方获取的知识并不总是正确的。许多错误，有些比另一些更严重，都是以这种方式进入谷歌的。在一个案例中，一个知识小组错误地陈述了企业家和篮球之父拉瓦尔·鲍尔(LaVar Ball)创立了NBA。在2018年的一个特别尴尬的例子中，谷歌的加州共和党知识小组将“纳粹主义”列为其意识形态之一。该公司将这起不幸事件归因于维基百科遭到破坏，随后被拖入谷歌，但这仍然激怒了已经担心这家科技巨头对保守派有偏见的共和党议员。\n正如我亲身了解到的那样，人们可能会花几个月的时间试图纠正其中包含的错误信息。在“华尔街日报”去年报道的一个例子中，谷歌错误地声称演员保罗·坎贝尔已经去世，这让他的母亲感到恐慌。谷歌发言人莱文(Levin)表示，该公司鼓励人们向其提供反馈，并将“根据我们的政策对这些功能采取行动”。谷歌关于特色片段的政策并没有明确禁止虚假信息，尽管该公司确实表示，“公共利益内容--包括公民、医疗、科学和历史问题--不应与公认的或专家一致支持的内容相抵触。”\n这已经不是谷歌第一次把我的联系方式列为联系其他人的方式了。去年3月，在我发布了TikTok应用程序的简单使用指南后，谷歌开始将我的电话号码和电子邮件地址与TikTok客户支持联系起来。我收到了数十条信息，这些信息来自那些账户被锁在门外或正在为其他问题而苦苦挣扎的人。一群来自挪威的女孩问我，为什么她们的视频没有像美国同龄人那样像病毒一样传播开来。直到我开始给一个青少年发短信，她的TikTok账户被欺凌的人黑了，我才明白发生了什么。一天晚上，她反复打电话给我，后来耐心地解释说，她在谷歌上找到了我的号码。当时，似乎没有通过TikTok网站联系TikTok的直接方式，这可能对我的情况没有帮助。\n作为麦肯齐·贝佐斯的谷歌二重身，我听到人们说他们在尼日利亚、斯里兰卡、埃塞俄比亚、孟加拉国、宾夕法尼亚、印度尼西亚、伊朗、巴基斯坦、英国、纳米比亚、印度、肯尼亚、纽约、加纳、阿拉巴马州和更多的地方。如果不是谷歌，世界上最有影响力的信息来源之一，我不太可能收到他们中的任何一个的消息。\n这家科技巨头的影响力可能是我的联系方式最初与麦肯齐·贝佐斯联系在一起的原因：与许多出版物一样，《连线》的网络流量有很大一部分是通过搜索引擎获得的。为了实现这一点，我们的网站经过优化，在搜索结果中的排名尽可能靠前。事实上，我不是唯一经历过同样问题的记者；谷歌主板记者Lorenzo Franceschi-Bicchierai的电话号码去年与Facebook客户支持联系在一起。我们的这两个混乱是谷歌试图给人们提供他们想要的答案，以及媒体机构努力确保他们的工作被尽可能多的眼球看到的共同结果。\n我几乎每天都会听到人们在寻找麦肯齐·贝佐斯(MacKenzie Bezos)。当我写完这篇故事时，我的电话响了。一个来自孟加拉国的号码打来，我每天都在提醒，在那里的某个地方，我仍然被误认为是亿万富翁。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Almost a year ago, I wrote a  story about MacKenzie Bezos. The novelist had recently  divorced Amazon CEO Jeff Bezos and announced she planned to give away the majority of her fortune, estimated at the time to be worth more than $36 billion. I argued that while it was an admirable move on MacKenzie’s part, relying on the generosity of the rich wouldn’t solve society’s problems.\n Around that time is when the messages started to arrive: In hundreds of emails, calls, and texts, people showered me with flattering platitudes and marriage proposals, shared startup ideas, and told rambling personal stories. Most of the time, though, they asked for money. I didn’t understand what was happening, at least not at first. As a reporter, I don’t usually field emails requesting, as one self-described 30-year-old in Korea did, that I buy them a Porsche.\n I slowly realized that I wasn’t being spammed, at least not in the traditional sense. Instead, I was being mistaken for MacKenzie Bezos herself. How did hundreds of people wind up reaching a random woman in Brooklyn instead of a powerful billionaire? The answer turned out to be the result of an even more powerful tech company: Google.\n  When WIRED published that story about MacKenzie, embedded in the article page was my email address and a phone number. It was intended for readers to share feedback or send tips—a common practice among journalists and writers. Since MacKenzie’s name was in the article, Google began pulling the paragraph with my information as though it was hers. If you searched for “MacKenzie Bezos phone number,” “MacKenzie Bezos contact,” or something similar on Google, my email address and phone number were likely to show up at the top of the results, prominently displayed in a standalone box the company calls a “featured snippet.”\n   Not everyone who contacted me fully believed I was MacKenzie—“Sure this is a scam email,” one person wrote in a message earlier this month—but enough people seemed to. I’ve received countless messages since last May, some describing heartbreaking situations, others nearly indecipherable. These days, they’ve taken a semi-apocalyptic turn as a result of the pandemic. A person from the UK recently requested funds to build an underground bunker for their family and friends. “I should tell you more about myself. I don’t make a habit of asking people for £2 million, but this virus has taught me that I need to be ready for the big one,” they wrote.\n  I reached out to Google’s press email three times to try to get my problem fixed, starting in November of last year. In February, feeling desperate, I asked if there was anything WIRED could do to make it stop. “Once again I’m experiencing this problem with Mackenzie Bezos, I’ve received probably 100 emails in the last few weeks from Google users who think I am her or work with her,” I wrote. “If there’s anything WIRED can do, please let me know.” I finally heard back from Google this week, after I said I planned to write about my experience.\n  “In situations where people are searching for something like a phone number that is not readily available online, our systems are understanding these pages (that include those exact keywords plus a phone number) to be the best matches available, even if the phone number is not the correct number for that entity,” Lara Levin, a spokesperson for Google, said in an email. Levin added that the company plans to look at ways it could improve its system “to better recognize” when a phone number should not be resurfaced as a featured snippet.\n Until that happens, the only recourse is for WIRED to reconfigure its website to prevent Google from scraping my contact information. I could, of course, take down my email address and phone number altogether, but I want people to know how to reach me in order to do my job. I’m fine with strangers reaching out to me—I just don’t want them to think I’m a billionaire philanthropist.\n  Is there something you think we should know? You can reach the writer, who is not a billionaire, at  louise_matsakis@wired.com or by phone at 347-966-3806.\n Google’s stated mission has always been to “organize the world’s information.” For a long time, it mainly did that by ranking search results. Type a question or keyword into Google’s search bar, and it would return a list of websites its algorithms decided had the best chance of containing an answer to your question. You were expected to click through to find what you wanted—Google was a portal, not a destination. Eight years ago, the company  fundamentally changed that arrangement when it introduced its “Knowledge Graph.”\n Now, Google often tries to answer your query directly, by pulling information from sites like Wikipedia into boxes it calls “featured snippets” or “knowledge panels,” which appear above or alongside traditional search results. If you look up a celebrity’s net worth, for example, Google may  scrape the information from somewhere like CelebrityNetWorth.com. Especially on mobile devices, the widgets are convenient for users in search of quick answers, sidestepping the need to dig through information published by multiple sources.\n Google featured snippets and knowledge panels are  controlled by algorithms, and largely not pre-screened for accuracy. That means the knowledge Google scrapes from the rest of the internet is not always correct. Plenty of errors, some more consequential than others, have made it onto Google this way. In one case, a knowledge panel incorrectly stated entrepreneur and basketball dad LaVar Ball  founded the NBA. In a particularly  embarrassing instance from 2018, Google’s knowledge panel for the California Republican Party listed “Nazism” among its ideologies. The company attributed the mishap to Wikipedia vandalism that then got pulled into Google, but it still angered Republican lawmakers already concerned the tech giant was  biased against conservatives.\n As I learned firsthand, people can spend months trying to rectify false information contained in them. In one instance reported by   The Wall Street Journal last year, Google incorrectly stated the actor Paul Campbell had passed away, causing his mother to panic. Levin, the Google spokesperson, says that the company encourages people to provide it with feedback, and will “take action on these features in accordance with our policies.” Google’s  policies on featured snippets don’t ban false information explicitly, although the company does say that “public interest content—including civic, medical, scientific and historical issues—should not contradict well-established or expert consensus support.”\n  This isn’t even the first time my contact information has been listed by Google as a way to reach someone else. In March of last year, Google started associating my number and email address with TikTok customer support, after I published a simple guide to  using the app. I received dozens of messages from people locked out of their accounts or struggling with other issues. A  group of girls from Norway asked me why their videos weren’t going viral like the ones from their American peers. I only understood what was happening after I started texting a teenager whose TikTok account had been hacked by her bully. She called me repeatedly one night, and later patiently explained that she had found my number on Google. At the time, there didn’t appear to be a straightforward way to contact TikTok through its website, which likely didn’t help my case.\n As MacKenzie Bezos’ Google doppelgänger, I’ve heard from people who say they’re in Nigeria, Sri Lanka, Ethiopia, Bangladesh, Pennsylvania, Indonesia, Iran, Pakistan, England, Namibia, India, Kenya, New York, Ghana, Alabama, and many more places. It’s unlikely I would have heard from any of them if not for Google, one of the most influential sources of information across the world.\n  The tech giant’s power might be why my contact information was associated with MacKenzie Bezos in the first place: Like many publications, WIRED gets a significant portion of its web traffic through search engines. To make that happen, our website is optimized to rank as highly in search results as possible. In fact, I’m not the only journalist to experience this same problem; Google  associated Motherboard reporter Lorenzo Franceschi-Bicchierai’s phone number with Facebook customer support last year. Both of our mixups were the combined result of Google trying to give people the answers they want, and media organizations working to ensure their work is seen by as many eyeballs as possible.\n I continue to hear from people in search of MacKenzie Bezos almost every day. While I was finishing up this story, my phone rang. A number from Bangladesh was calling, my daily reminder that somewhere out there, I’m still being mistaken for a billionaire.\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-05-09 20:35:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "贝佐斯,认为,internet,谷歌", "title": "互联网认为我是麦肯齐·贝佐斯的那一年", "title_en": "The Year the Internet Thought I Was MacKenzie Bezos", "transed": 1, "url": "https://www.wired.com/story/internet-thought-i-was-mackenzie-bezos/", "via": "", "real_tags": ["贝佐斯", "认为", "internet", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "eb14d13ed3b7ba63a8f4b2a3aff6df52.jpg", "infoid": 1001380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国交通大臣预计将在周六的新闻发布会上表示，随着封锁的解除，我们需要保护公共交通网络。\nBBC了解到格兰特·沙普斯将鼓励公众在可能的情况下继续在家工作。\n那些需要出行上班的人将被敦促考虑更积极的出行方式，如步行和骑自行车。\n可能会宣布为英国地方当局提供额外资金，以帮助改变公路网，以促进这一点。\n关于骑自行车和步行的事务被下放。例如，威尔士自2013年以来就已经制定了促进这两项活动的立法，而苏格兰则在4月份宣布为活跃的旅行基础设施提供资金。\n据信，沙普斯先生将谈论利用禁闭限制的独特机会来改变我们的工作方式。\n我们将如何出行，同时保持社会距离，这是政府寻求开始解除封锁时面临的最大挑战之一。\n维持两米长的规定将意味着公交车、火车和地铁能够运载的乘客将会少得多。\n封锁期间安排的公交车和火车减少了，因此恢复正常服务需要时间。\n许多通勤者也会担心拥挤的公交车和火车的安全，但如果更多的人试图驾车上班，道路可能会变得拥堵。\n格兰特·夏普斯(Grant Shapps)预计会说，解决方案是让我们所有人都多走路和骑自行车。\nBBC了解到，增加政府所称的积极旅行的提议将为我们所有人提供一个机会，让我们过上更清洁、更绿色、更健康的生活。\n夏普斯可能会宣布为地方当局提供额外资金，用于支付公路网的改造费用，以促进这种转向更积极的出行方式。\n预计他还将宣布计划，赋予地方当局新的权力，以改变路网，并为骑自行车的人和行人指定额外的空间。\n伦敦和曼彻斯特的市长萨迪克·汗(Sadiq Khan)和安迪·伯纳姆(Andy Burnham)上周宣布，他们计划关闭一些道路，禁止汽车行驶，以创建专门的步行和自行车路线。\nBBC交通记者汤姆·伯里奇说，夏普斯先生还将宣布，电动滑板车的试验将被快速追踪到英国任何想尝试电动滑板车的地区。\n交通部长宣布这一消息之际，九个环境和交通压力团体组成的联盟已写信给政府，要求大幅增加步行和骑自行车的支出。\n他们的信呼吁从根本上重新设计交通网络，以改善公众健康，净化空气，保护气候。\n它还指出，封锁导致了英国城镇空气质量的戏剧性改善。\n英国一些最大城市的二氧化氮水平已经下降了60%，二氧化氮是一种与交通相关的有害污染物气体。\n这封信的签字人包括绿色和平、乡村慈善机构CPRE(保护英格兰乡村运动)，以及其他七个环境和交通组织。\n他们认为，永久性地转向更积极的旅行将有助于保护当地环境的这些改善。\n信中说，有毒空气是英国每年数千人过早死亡的原因。\n它写道，在做出了前所未有的努力和牺牲来拯救数千人的生命免受冠状病毒侵袭之后，如果我们允许更多的人因有毒污染的破坏性影响而被切断，那将是完全荒谬的。\n这些组织建议地方当局拓宽人行道，增加自行车道，并优先考虑步行和骑自行车的人。\n他们呼吁将所有建成区的车速限制降至每小时20英里，但设有隔离自行车道的地区除外。他们还要求在未来五年内额外提供60亿英镑的资金，用于投资于新的交通基础设施。", "note_en": "We need to protect the public transport network as lockdown is lifted, the UK&#39;s transport secretary is expected to say at a press conference on Saturday.\n The BBC understands Grant Shapps will encourage the public to continue to work from home if they can.\n Those who need to travel to work will be urged to consider more active ways to travel like walking and cycling.\n Extra funding is likely to be announced for English local authorities to help alter road networks to facilitate this.\n   Matters concerning cycling and walking are devolved. For example, Wales has had legislation in place to boost both activities since 2013, while Scotland announced funding  for &#34;active travel infrastructure&#34; in April.\n It is believed that Mr Shapps will talk about using the unique &#34;opportunity&#34; of the lockdown restrictions to change the way we get to work.\n  How we will travel while maintaining social distancing is one of the biggest challenges the government faces as it seeks to start to lift the lockdown.\n Maintaining the two-metre rule will mean buses, trains and tubes will be able to carry far fewer passengers.\n  There have been fewer buses and trains scheduled during the lockdown, so it will take time to restore normal services.\n Many commuters will also be concerned about the safety of crowded buses and trains but, if more people try to commute into work in their cars, the roads are likely to become choked with traffic.\n  The solution, Grant Shapps is expected to say, is for us all to walk and cycle more.\n The BBC understands that the proposal to increase what the government is calling &#34;active travel&#34; will be presented as an opportunity for us all to live &#34;cleaner, greener, healthier lives&#34;.\n Mr Shapps is likely to announce extra funding for local authorities to pay for alterations to the road network to facilitate this move to more active ways to get around.\n He is also expected to announce plans to give local authorities new powers to change the road network and designate extra space for cyclists and pedestrians.\n The mayors of London and Manchester - Sadiq Khan and Andy Burnham - announced last week that they were planning to close some roads to cars to create dedicated pedestrian and cycle routes.\n BBC transport correspondent Tom Burridge said Mr Shapps was also set to announce that trials of e-scooters will be fast-tracked to any area of Britain that wanted to attempt one.\n  The transport secretary&#39;s announcement comes as a coalition of nine environmental and transport pressure groups have written to the government to demand a big increase in spending on walking and cycling.\n Their letter calls for a fundamental redesign of the transport network to improve public health, clean the air and protect the climate.\n It also points out that the lockdown has led to a dramatic improvement in air quality in Britain&#39;s towns and cities.\n Some of Britain&#39;s largest cities  have seen a 60% reduction in levels of nitrogen dioxide, a harmful pollutant gas associated with traffic.\n The letter&#39;s signatories include Greenpeace, the countryside charity the CPRE (Campaign to Protect Rural England), and seven other environment and transport organisations.\n They argue that making a permanent switch towards more active travel would help protect these improvements in the local environment.\n    Toxic air is responsible for thousands of premature deaths in the UK every year, the letter says.\n &#34;It would be completely absurd if, after the unprecedented efforts and sacrifices made to save thousands of lives from Covid-19, we allowed thousands more to be cut short by the devastating impacts of toxic pollution,&#34; it reads.\n The organisations recommend that local authorities widen pavements and increase cycle lanes, as well as giving priority to people who walk and cycle.\n They call for the speed limit to be cut to 20 mph in all built-up areas except where segregated cycle lanes are in place. They also demand £6bn in additional funding over the next five years to invest in new transport infrastructure.", "posttime": "2020-05-09 20:34:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "敦促,urge,宣布", "title": "政府敦促我们所有人多步行和骑自行车", "title_en": "Government to urge us all to walk and cycle more", "transed": 1, "url": "https://www.bbc.com/news/science-environment-52592421", "via": "", "real_tags": ["敦促", "urge", "宣布"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个世纪以来，西方文化一直被认为人类是自私的生物的观念所渗透。这种愤世嫉俗的人性形象已经在电影和小说、历史书籍和科学研究中得到了宣扬。但在过去的20年里，一些非同寻常的事情发生了。来自世界各地的科学家已经转向对人类更有希望的看法。这一发展还很年轻，不同领域的研究人员往往甚至不知道彼此之间的情况。\n当我开始写一本关于这种更有希望的观点的书时，我知道有一个故事我必须解决。故事发生在太平洋某处的一个荒岛上。一架飞机刚刚坠毁。唯一幸存下来的是一些英国小学生，他们简直不敢相信自己的好运。几英里之内除了海滩、贝壳和水什么都没有。更好的是：没有成年人。\n就在第一天，男孩们建立了某种形式的民主。一个名叫拉尔夫的男孩被选为该组织的领导人。他体格健壮，魅力十足，英俊英俊，他的比赛计划很简单：1)玩得开心。2)生存。3)为过往船舶发出烟雾信号。第一名是成功的。其他人呢？没那么多。比起生火，男孩子们对宴请和嬉戏更感兴趣。不久，他们就开始画自己的脸了。脱掉他们的衣服。它们会产生强烈的冲动--捏、踢、咬。\n当一名英国海军军官上岸时，该岛已是一片阴燃的荒地。有三个孩子死了。“我应该想到，”这位官员说，“一群英国男孩应该能表演出比这更好的表演。”听到这话，拉尔夫失声痛哭。“拉尔夫为天真的终结而哭泣，”我们读到，并为“人类内心的黑暗”而哭泣。\n这个故事从未发生过。1951年，英国校长威廉·戈尔丁(William Golding)编造了这个故事-他的小说《蝇王》卖出了数千万册，被翻译成30多种语言，被誉为20世纪的经典之一。事后看来，这本书成功的秘诀是显而易见的。戈尔丁具有描绘人类最黑暗深处的高超能力。当然，他有20世纪60年代的时代精神站在他这边，当时新一代人正在质疑他们的父母关于第二次世界大战的暴行。他们想知道奥斯威辛集中营是一个异类，还是我们每个人心中都藏着一个纳粹？\n我第一次读“蝇王”是在十几岁的时候。我记得事后感到幻想破灭，但我一刻也没有想过要怀疑戈尔丁的人性观。直到几年后，当我开始钻研作者的生活时，这才发生。我了解到他是一个多么不快乐的人：一个酗酒者，容易抑郁；一个殴打自己孩子的人。“我一直了解纳粹，”戈尔丁承认，“因为我天生就是那种人。”他写“蝇王”，“部分是出于那种可悲的自知之明”。\n我开始怀疑：有没有人研究过，如果真正的孩子发现自己孤身一人在荒岛上，他们会怎么做？我写了一篇关于这个主题的文章，在文章中我将“蝇王”与现代科学的洞察力进行了比较，得出的结论是，孩子们的行为很可能会截然不同。读者们对此表示怀疑。我举的所有例子都与家里、学校或夏令营的孩子有关。就这样，我开始了对现实生活中的蝇王的追求。在网上搜索了一段时间后，我偶然看到一个默默无闻的博客，上面讲述了一个引人入胜的故事：“1977年的一天，六个男孩从汤加出发去钓鱼……。孩子们遇上了一场大风暴，在一个荒岛上遇难了。他们是做什么的，这个小部落？他们约定永远不吵架。“。\n文章没有提供任何消息来源。但有时所需要的只是一种运气。有一天，在翻阅报纸档案时，我打错了一年，发现它就在那里。关于1977年的提法原来是一个打字错误。1966年10月6日出版的澳大利亚“时代报”(The Age)上，一个标题跃入我的眼帘：“汤加遇难者的周日演出”。这个故事涉及三周前在太平洋汤加群岛以南的一个多岩石的小岛上发现的六名男孩。这两名男孩在被困在阿塔岛一年多后，被一名澳大利亚船长救出。根据这篇文章，船长甚至得到了一家电视台来拍摄男孩们冒险的重演。\n我问了一大堆问题。孩子们还活着吗？我能找到电视画面吗？不过，最重要的是，我掌握了一条线索：船长的名字叫彼得·华纳(Peter Warner)。当我寻找他时，我又走运了。在最近一期来自澳大利亚马凯的一份小型地方报纸上，我偶然看到了这样的标题：“伙伴共享50年期债券”。旁边印着一张两个男人的小照片，他们面带微笑，一个手臂搂着另一个人。文章开头写道：“在利斯莫尔附近图莱拉的一个香蕉种植园深处，坐着一对不太可能的伴侣……。老人83岁，父亲是一位富有的实业家。年龄较小的67岁，从字面上看，他是一个天生的孩子。“。他们的名字？彼得·华纳和马诺·托陶。他们在哪里相遇的？在一个荒岛上。\n我和我的妻子Maartje在布里斯班租了一辆车，大约三个小时后到达了我们的目的地，这个偏远的地方让谷歌地图(Google Maps)望而却步。然而，他就在那里，坐在离土路不远的一座低矮的房子前：50年前救出6名迷路男孩的人，彼得·华纳船长。\n彼得是亚瑟·华纳的小儿子，亚瑟·华纳曾是澳大利亚最富有、最有权势的人之一。早在20世纪30年代，亚瑟统治着一个名为电子工业的庞大帝国，该帝国在当时主导着这个国家的无线电市场。彼得被培养成要追随他父亲的脚步。取而代之的是，在17岁时，他离家出海寻找冒险机会，并在接下来的几年里从香港航行到斯德哥尔摩，从上海航行到圣彼得堡。五年后，当他终于回来时，这位浪子自豪地向父亲赠送了一张瑞典队长证书。老华纳不为所动，要求他的儿子学习一门有用的职业。“什么是最简单的？”彼得问道。“会计，”亚瑟撒了个谎。\n彼得去为他父亲的公司工作，然而大海仍然在召唤他，只要有可能，他就去塔斯马尼亚，在那里他有自己的捕鱼船队。正是这一点使他在1966年冬天来到汤加。在回家的路上，他绕了一小段路，这时他看到了：蔚蓝大海中的一个小岛，阿塔。这个岛曾经有人居住过，直到1863年的一个黑暗的日子，一艘奴隶船出现在地平线上，与当地人一起驶离。从那时起，阿塔就被遗弃了--被诅咒和遗忘。\n但是彼得注意到了一些奇怪的事情。他用双筒望远镜凝视，看到绿色悬崖上烧焦的斑块。半个世纪后，他告诉我们：“在热带地区，火灾自发发生是不寻常的。”然后他看到一个男孩。一丝不挂。头发一直垂到肩膀。这只野生动物从悬崖边跳下，跳入水中。突然，更多的男孩紧随其后，大声尖叫。没过多久，第一个男孩就到了船上。“我叫斯蒂芬，”他用纯正的英语喊道。“我们有6个人，我们估计已经在这里待了15个月了。”\n这些男孩一上船，就声称他们是汤加首都努库阿洛法一所寄宿学校的学生。厌倦了学校的饭菜，他们决定有一天乘着渔船出去，不料却遇上了暴风雨。很可能是这样的故事，彼得想。他用他的双向无线电呼叫了努库阿洛法。“我这里有六个孩子，”他告诉接线员。“待命，”对方回答说。二十分钟一分一秒地过去了。(当彼得讲述故事的这一部分时，他有点泪眼模糊。)。最后，收音机里传来一个泪流满面的接线员，他说：“你找到他们了！这些男孩被认为是死路一条。葬礼已经举行。如果是他们，这就是奇迹！“。\n在接下来的几个月里，我试图尽可能精确地重现在阿塔发生的事情。彼得的记忆力原来很好。即使在90岁的时候，他讲述的一切都与我最重要的另一个消息来源马诺(Mano)是一致的。马诺当时15岁，现在已经70岁了，住在离他只有几个小时车程的地方。马诺告诉我们，真正的“蝇王”始于1965年6月。主角是六个男孩-Sione，Stephen，Kolo，David，Luke和Mano-都是努库阿洛法一所严格的天主教寄宿学校的学生。最年长的16岁，最小的13岁，他们有一个主要的共同点：他们无聊而没有智慧。所以他们想出了一个逃跑的计划：去500英里外的斐济，甚至一路逃到新西兰。\n只有一个障碍。他们都没有船，所以他们决定向他们都不喜欢的渔民塔涅拉·乌希拉先生“借”一艘。男孩们几乎没有花时间为航程做准备。两袋香蕉、几个椰子和一个小煤气炉就是他们打包的所有补给。他们谁也没想到要带地图，更不用说指南针了。\n虽然阿塔的男孩们已经默默无闻，但戈尔丁的书仍然广为流传。媒体历史学家甚至认为他是当今电视上最受欢迎的娱乐类型之一：真人秀节目的不知不觉中的创始人。“我一遍又一遍地读”蝇王“，”这位热门电视剧“幸存者”的创作者在接受采访时透露。\n现在是我们讲一个不同类型的故事的时候了。真正的“蝇王”是一个关于友谊和忠诚的故事；它表明，如果我们能够相互依靠，我们会变得多么强大。我妻子拍完彼得的照片后，他转向橱柜，翻了翻，然后拿出一叠厚厚的文件放在我手里。他解释说，他的回忆录是为他的子孙写的。我低头看了看第一页。“生活教会了我很多，”它开始道，“包括你应该永远寻找人们的优点和积极方面的教训。”\n·这是由伊丽莎白·曼顿(Elizabeth Manton)和埃里卡·摩尔(Erica Moore)翻译的、改编自罗杰·布雷格曼(Rutger Bregman)的“人类”(Human。与布雷格曼和欧文·琼斯的现场直播问答将于2020年5月19日晚上7点举行。", "note_en": "For centuries western culture has been permeated by the idea that humans are selfish creatures. That cynical image of humanity has been proclaimed in films and novels, history books and scientific research. But in the last 20 years, something extraordinary has happened. Scientists from all over the world have switched to a more hopeful view of mankind. This development is still so young that researchers in different fields often don’t even know about each other.\n When I started writing a book about this more hopeful view, I knew there was one story I would have to address. It takes place on a deserted island somewhere in the Pacific. A plane has just gone down. The only survivors are some British schoolboys, who can’t believe their good fortune. Nothing but beach, shells and water for miles. And better yet: no grownups.\n On the very first day, the boys institute a democracy of sorts. One boy, Ralph, is elected to be the group’s leader. Athletic, charismatic and handsome, his game plan is simple: 1) Have fun. 2) Survive. 3) Make smoke signals for passing ships. Number one is a success. The others? Not so much. The boys are more interested in feasting and frolicking than in tending the fire. Before long, they have begun painting their faces. Casting off their clothes. And they develop overpowering urges – to pinch, to kick, to bite.\n By the time a British naval officer comes ashore, the island is a smouldering wasteland. Three of the children are dead. “I should have thought,” the officer says, “that a pack of British boys would have been able to put up a better show than that.” At this, Ralph bursts into tears. “Ralph wept for the end of innocence,” we read, and for “the darkness of man’s heart”.\n  This story never happened. An English schoolmaster,  William Golding, made up this story in 1951 – his novel  Lord of the Flies would sell tens of millions of copies, be translated into more than 30 languages and hailed as one of the classics of the 20th century. In hindsight, the secret to the book’s success is clear. Golding had a masterful ability to portray the darkest depths of mankind. Of course, he had the zeitgeist of the 1960s on his side, when a new generation was questioning its parents about the atrocities of the second world war. Had Auschwitz been an anomaly, they wanted to know, or is there a Nazi hiding in each of us?\n I first read  Lord of the Flies as a teenager. I remember feeling disillusioned afterwards, but not for a second did I think to doubt Golding’s view of human nature. That didn’t happen until years later when I began delving into the author’s life. I learned what an unhappy individual he had been: an alcoholic, prone to depression; a man who beat his kids. “I have always understood the Nazis,” Golding confessed, “because I am of that sort by nature.” And it was “partly out of that sad self-knowledge” that he wrote  Lord of the Flies.\n I began to wonder: had anyone ever studied what real children would do if they found themselves alone on a deserted island? I wrote an article on the subject, in which I compared  Lord of the Flies to modern scientific insights and concluded that, in all probability, kids would act very differently. Readers responded sceptically. All my examples concerned kids at home, at school, or at summer camp. Thus began my quest for a real-life  Lord of the Flies. After trawling the web for a while, I came across an obscure blog that told an arresting story: “One day, in 1977, six boys set out from Tonga on a fishing trip ... Caught in a huge storm, the boys were shipwrecked on a deserted island. What do they do, this little tribe? They made a pact never to quarrel.”\n  The article did not provide any sources. But sometimes all it takes is a stroke of luck. Sifting through a newspaper archive one day, I typed a year incorrectly and there it was. The reference to 1977 turned out to have been a typo. In the 6 October 1966 edition of Australian newspaper The Age, a headline jumped out at me: “Sunday showing for Tongan castaways”. The story concerned six boys who had been found three weeks earlier on a rocky islet south of Tonga, an island group in the Pacific Ocean. The boys had been rescued by an Australian sea captain after being marooned on the island of ‘Ata for more than a year. According to the article, the captain had even got a television station to film a re-enactment of the boys’ adventure.\n I was bursting with questions. Were the boys still alive? And could I find the television footage? Most importantly, though, I had a lead: the captain’s name was Peter Warner. When I searched for him, I had another stroke of luck. In a recent issue of a tiny local paper from Mackay, Australia, I came across the headline: “Mates share 50-year bond”. Printed alongside was a small photograph of two men, smiling, one with his arm slung around the other. The article began: “Deep in a banana plantation at Tullera, near Lismore, sit an unlikely pair of mates ... The elder is 83 years old, the son of a wealthy industrialist. The younger, 67, was, literally, a child of nature.” Their names? Peter Warner and Mano Totau. And where had they met? On a deserted island.\n My wife Maartje and I rented a car in Brisbane and some three hours later arrived at our destination, a spot in the middle of nowhere that stumped Google Maps. Yet there he was, sitting out in front of a low-slung house off the dirt road: the man who rescued six lost boys 50 years ago, Captain Peter Warner.\n  Peter was the youngest son of Arthur Warner, once one of the richest and most powerful men in Australia. Back in the 1930s, Arthur ruled over a vast empire called Electronic Industries, which dominated the country’s radio market at the time. Peter was groomed to follow in his father’s footsteps. Instead, at the age of 17, he ran away to sea in search of adventure and spent the next few years sailing from Hong Kong to Stockholm, Shanghai to St Petersburg. When he finally returned five years later, the prodigal son proudly presented his father with a Swedish captain’s certificate. Unimpressed, Warner Sr demanded his son learn a useful profession. “What’s easiest?” Peter asked. “Accountancy,” Arthur lied.\n Peter went to work for his father’s company, yet the sea still beckoned, and whenever he could he went to Tasmania, where he kept his own fishing fleet. It was this that brought him to Tonga in the winter of 1966. On the way home he took a little detour and that’s when he saw it: a minuscule island in the azure sea, ‘Ata. The island had been inhabited once, until one dark day in 1863, when a slave ship appeared on the horizon and sailed off with the natives. Since then, ‘Ata had been deserted – cursed and forgotten.\n  But Peter noticed something odd. Peering through his binoculars, he saw burned patches on the green cliffs. “In the tropics it’s unusual for fires to start spontaneously,” he told us, a half century later. Then he saw a boy. Naked. Hair down to his shoulders. This wild creature leaped from the cliffside and plunged into the water. Suddenly more boys followed, screaming at the top of their lungs. It didn’t take long for the first boy to reach the boat. “My name is Stephen,” he cried in perfect English. “There are six of us and we reckon we’ve been here 15 months.”\n The boys, once aboard, claimed they were students at a boarding school in Nuku‘alofa, the Tongan capital. Sick of school meals, they had decided to take a fishing boat out one day, only to get caught in a storm. Likely story, Peter thought. Using his two-way radio, he called in to Nuku‘alofa. “I’ve got six kids here,” he told the operator. “Stand by,” came the response. Twenty minutes ticked by. (As Peter tells this part of the story, he gets a little misty-eyed.) Finally, a very tearful operator came on the radio, and said: “You found them! These boys have been given up for dead. Funerals have been held. If it’s them, this is a miracle!”\n In the months that followed I tried to reconstruct as precisely as possible what had happened on ‘Ata. Peter’s memory turned out to be excellent. Even at the age of 90, everything he recounted was consistent with my foremost other source, Mano, 15 years old at the time and now pushing 70, who lived just a few hours’ drive from him. The real  Lord of the Flies, Mano told us, began in June 1965. The protagonists were six boys – Sione, Stephen, Kolo, David, Luke and Mano – all pupils at a strict Catholic boarding school in Nuku‘alofa. The oldest was 16, the youngest 13, and they had one main thing in common: they were bored witless. So they came up with a plan to escape: to Fiji, some 500 miles away, or even all the way to New Zealand.\n There was only one obstacle. None of them owned a boat, so they decided to “borrow” one from Mr Taniela Uhila, a fisherman they all disliked. The boys took little time to prepare for the voyage. Two sacks of bananas, a few coconuts and a small gas burner were all the supplies they packed. It didn’t occur to any of them to bring a map, let alone a compass.\n  No one noticed the small craft leaving the harbour that evening. Skies were fair; only a mild breeze ruffled the calm sea. But that night the boys made a grave error. They fell asleep. A few hours later they awoke to water crashing down over their heads. It was dark. They hoisted the sail, which the wind promptly tore to shreds. Next to break was the rudder. “We drifted for eight days,” Mano told me. “Without food. Without water.” The boys tried catching fish. They managed to collect some rainwater in hollowed-out coconut shells and shared it equally between them, each taking a sip in the morning and another in the evening.\n Then, on the eighth day, they spied a miracle on the horizon. A small island, to be precise. Not a tropical paradise with waving palm trees and sandy beaches, but a hulking mass of rock, jutting up more than a thousand feet out of the ocean. These days, ‘Ata is considered uninhabitable. But “by the time we arrived,” Captain Warner wrote in his memoirs, “the boys had set up a small commune with food garden, hollowed-out tree trunks to store rainwater, a gymnasium with curious weights, a badminton court, chicken pens and a permanent fire, all from handiwork, an old knife blade and much determination.” While the boys in  Lord of the Flies come to blows over the fire, those in this real-life version tended their flame so it never went out, for more than a year.\n  The kids agreed to work in teams of two, drawing up a strict roster for garden, kitchen and guard duty. Sometimes they quarrelled, but whenever that happened they solved it by imposing a time-out. Their days began and ended with song and prayer. Kolo fashioned a makeshift guitar from a piece of driftwood, half a coconut shell and six steel wires salvaged from their wrecked boat – an instrument Peter has kept all these years – and played it to help lift their spirits. And their spirits needed lifting. All summer long it hardly rained, driving the boys frantic with thirst. They tried constructing a raft in order to leave the island, but it fell apart in the crashing surf.\n Worst of all, Stephen slipped one day, fell off a cliff and broke his leg. The other boys picked their way down after him and then helped him back up to the top. They set his leg using sticks and leaves. “Don’t worry,” Sione joked. “We’ll do your work, while you lie there like King Taufa‘ahau Tupou himself!”\n They survived initially on fish, coconuts, tame birds (they drank the blood as well as eating the meat); seabird eggs were sucked dry. Later, when they got to the top of the island, they found an ancient volcanic crater, where people had lived a century before. There the boys discovered wild taro, bananas and chickens (which had been reproducing for the 100 years since the last Tongans had left).\n  They were finally rescued on Sunday 11 September 1966. The local physician later expressed astonishment at their muscled physiques and Stephen’s perfectly healed leg. But this wasn’t the end of the boys’ little adventure, because, when they arrived back in Nuku‘alofa police boarded Peter’s boat, arrested the boys and threw them in jail. Mr Taniela Uhila, whose sailing boat the boys had “borrowed” 15 months earlier, was still furious, and he’d decided to press charges.\n Fortunately for the boys, Peter came up with a plan. It occurred to him that the story of their shipwreck was perfect Hollywood material. And being his father’s corporate accountant, Peter managed the company’s film rights and knew people in TV. So from Tonga, he called up the manager of Channel 7 in Sydney. “You can have the Australian rights,” he told them. “Give me the world rights.” Next, Peter paid Mr Uhila £150 for his old boat, and got the boys released on condition that they would cooperate with the movie. A few days later, a team from Channel 7 arrived.\n The mood when the boys returned to their families in Tonga was jubilant. Almost the entire island of Haʻafeva – population 900 – had turned out to welcome them home. Peter was proclaimed a national hero. Soon he received a message from King Taufa‘ahau Tupou IV himself, inviting the captain for an audience. “Thank you for rescuing six of my subjects,” His Royal Highness said. “Now, is there anything I can do for you?” The captain didn’t have to think long. “Yes! I would like to trap lobster in these waters and start a business here.” The king consented. Peter returned to Sydney, resigned from his father’s company and commissioned a new ship. Then he had the six boys brought over and granted them the thing that had started it all: an opportunity to see the world beyond Tonga. He hired them as the crew of his new fishing boat.\n While the boys of ‘Ata have been consigned to obscurity, Golding’s book is still widely read. Media historians even credit him as being the unwitting originator of one of the most popular entertainment genres on television today: reality TV. “I read and reread  Lord of the Flies ,” divulged the creator of hit series  Survivor in an interview.\n It’s time we told a different kind of story. The real  Lord of the Flies is a tale of friendship and loyalty; one that illustrates how much stronger we are if we can lean on each other. After my wife took Peter’s picture, he turned to a cabinet and rummaged around for a bit, then drew out a heavy stack of papers that he laid in my hands. His memoirs, he explained, written for his children and grandchildren. I looked down at the first page. “Life has taught me a great deal,” it began, “including the lesson that you should always look for what is good and positive in people.”\n •  This is an adapted excerpt from Rutger Bregman’s Humankind, translated by Elizabeth Manton and Erica Moore. A  live streamed Q&amp;A with Bregman and Owen Jones takes place at 7pm on 19 May 2020.", "posttime": "2020-05-09 20:34:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苍蝇,flies,男孩", "title": "苍蝇王：当六个男孩在海难中沉没了15个月", "title_en": "The Lord of the Flies: when six boys were shipwrecked for 15 months", "transed": 1, "url": "https://www.theguardian.com/books/2020/may/09/the-real-lord-of-the-flies-what-happened-when-six-boys-were-shipwrecked-for-15-months", "via": "", "real_tags": ["苍蝇", "flies", "男孩"]}, {"category": "", "categoryclass": "", "imagename": "8f95a6959d469bdb682323a080610474.jpeg", "infoid": 1001378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一年前，Bitsy在itch.io上发布了这款不起眼的游戏制作工具，其创建者将其描述为“小游戏或世界的小编辑器”。自从它发布以来，300个不同的作者已经使用这个工具制作了600多个游戏。\n从表面上看，Bitsy是一个谦逊的引擎。它可以让你创建小的像素艺术房间，玩家可以通过与里面的人和物体互动来探索。它的简单隐藏了一个令人惊讶的深度，吸引了一群游戏制作人。“Bitsy来自于我自己试图完成一款游戏的挫败感，”Bitsy的创建者亚当·勒·道克斯(Adam Le Doux)说。“很自然，解决方案就是从头开始构建一个新的游戏引擎！我不想再担心编程细节、屏幕分辨率、平台差异和后处理效果。我希望能够立即致力于我试图创造的核心：一个有故事的世界。“。\n他的灵感来自于他最喜欢的游戏空间-2D RPG中的城镇，如塞尔达(Zelda)、精灵宝可梦(Pokemon)和最终幻想(Fantasy)，以及像Gone Home这样的行走模拟器。“我一直喜欢四处走走，和每个人交谈，了解他们的个人问题或这个小镇的历史。像这样的游戏给了我信心，相信这些元素--一个地方和它的居民--足以做出一些有趣的东西。“。\n他将Bitsy创建为一个简单的引擎，不需要编码知识就可以在其中创建一些东西。这是一个建立在约束之上的引擎，限制你只能使用8×8像素的瓷砖和三色调色板。\n亚当说：“我做了我的第一个游戏，下班后回到公寓，发现我的妻子玛丽-玛格丽特已经在沙发上打盹了，我们的猫在乞讨零食。”它使用的是Bitsy的早期版本，该版本要求将所有内容输入到文本文件中，然后将文本文件加载到引擎中。\n当玛丽-玛格丽特和几个朋友说他们想用它制作自己的游戏时，亚当创建了网络应用版的编辑器。他把它放到网上，发布在Twitter上，并认为这将是它的结束。\n比特走了。游戏制作人发现，编辑的简单性意味着他们可以在几个晚上制作出引人入胜的游戏。较低的赌注意味着它非常适合测试想法，制作简短的情绪片段或表达个人故事。\n克莱尔·莫利就是这些设计师之一。她被Bitsy独特的艺术风格所吸引，这种艺术风格是引擎约束的副产品。\n她说：“我还玩了”Bitsy Moth Jam“中的其他几个游戏。”“我喜欢他们的感觉都很相似，但又截然不同。他们都觉得很神秘，但很私人。他们几乎感觉到他们都来自异国或古老的文化，联系在一起，通过扮演他们，我触及了一些神奇的东西的皮毛。“。\n克莱尔决定制作自己的游戏。她把猫从袋子里弄出来了！在下一个即兴演奏中，我们来看一个关于偷偷在高中里转悠和倾听人们谈话的游戏。自那以后，她制作了几款以火车旅行、雪盲和瓶子里的信息为特色的Bitsy游戏。\n“Bitsy剔除了制作互动故事不完全必要的任何东西。它是一个非常专注和有限的工具，但这些限制意味着你不会有那么多关于使用什么艺术风格或如何设置控件的噪音，“克莱尔说。“虽然这些都很重要，但没有它们意味着更容易触及你试图传达的故事、经历或信息的核心。这就是为什么Bitsy游戏在概念上往往感觉如此强大的原因。\n比特式游戏给人的感觉就像是属于一种独特的游戏制作形式，一种有自己的规则和视觉语言的游戏。在Bitsy中玩游戏感觉就像是决定用Super 8录制一部电影，或者用模拟相机拍摄照片。虽然它对于初学者来说很容易学习，但对于有经验的创作者来说，仍然有很大的实验空间。这让人们和Bitsy一起做了一些连亚当都没有预料到的事情。\n亚当说：“人们不断突破限制，发明使用Bitsy的新方法，这是我从未想过的。”人们已经使用Bitsy制作了短片、程序生成的无线电调谐器和天文模拟器。这种创造性在很大程度上是由围绕该工具形成的社区推动的。\n游戏和工具制造商Mark Wonnacott说：“如果Bitsy本身的发展在今天停滞不前，我认为我们仍然可以花几年的时间寻找有趣的方式来使用它。”他对围绕Bitsy形成的社区充满了热情。\n他们解释说：“人们实际上是在使用它，互相玩游戏。”“有一个很好的社区，人们互相帮助和鼓励。人们将Bitsy和Twin相提并论，但我不确定他们是否像考虑工具周围的场景形状一样多地考虑工具。“。\n克莱尔和马克都是那一幕的中心人物。克莱尔在为社区创造蓬勃发展的空间方面发挥了关键作用。她和洛伦佐·皮利亚(A Maze的项目经理，也是Global Game Jam执行委员会的一员)一起创建了@bitsypcs，这是一个Twitter账户，分享关于Bitsy和引擎制造的游戏的新闻。\n推特账号导致两人建立了不和谐的Bitsy Talk，它已经成为社区的非官方之家。这是一个友好的空间，人们可以去那里“分享想法、游戏和附加工具”。在那里，你可以找到已经做了六个游戏的人，他们给初学者提供了完成游戏的提示。\n马克已经成了某种程度上的Bitsy档案员。他们创建了Bitsy Omnibus，每一款Bitsy游戏的目录。它最初的动机是他们的另一个项目Bitsy Boutique，这是一个Bitsy游戏的硬件播放器，使用安装在珠宝盒中的PocketCHIP制作。\n“我想弄清楚如何将Bitsy游戏从单独的网页游戏提升为可以在某个地方展示的东西，”Mark解释说，“让它出现在那些还没有玩小网络游戏的人面前。”到目前为止，创作者的反应是一致的积极的，人们很高兴看到他们的作品被承认为一个更大的整体的一部分。“。\n它的首次展出刚刚为Rezze的Leftfield藏品宣布。这是Bitsy开始走出在线空间的方式之一。布莱顿和西雅图都有聚会，克莱尔和马克正在合作在布里斯托尔举办一次聚会。克莱尔还主持了一个研讨会，教孩子们如何使用Bitsy制作游戏(她之前也教过她父亲)。\n“在Bitsy的工作中，看到社区的形成是最神奇和最鼓舞人心的事情。”亚当说：“如果没有他们的创造力和辛勤工作，我们现在就不会谈论Bitsy。他们使用发动机的所有方式都带动了我添加的东西，给了我继续致力于这个项目的能量。“。\n这种能量是双向的。这个社区源于亚当愿意倾听想法、问题和反馈。他也是每月游戏堵塞的主持人，这激励了许多人制作他们的第一场游戏。这个社区并不是凭空冒出来的：亚当认识到它的重要性，并愿意培育它，这是它成长的一个原因。\n亚当说：“对于那些可能是第一次制作游戏或将游戏分享给更多观众的人来说，社区是至关重要的。”“它帮助人们看到，它被接受和庆祝，是为了让一些小的、个人的或不完整的东西变得细小。”", "note_en": "A year ago Bitsy  released on itch.io – a humble game making tool described by its creator as a “little editor for little games or worlds”. Since its release, more than 600 games have been made using the tool by 300 different authors.\n On the surface Bitsy is an unassuming engine. It lets you create small pixel-art rooms that players can explore by interacting with the people and objects within them. Its simplicity hides a surprising depth, one that has drawn in a community of game makers.“Bitsy came from my own frustrations with trying to finish a game,” says Adam Le Doux, Bitsy’s creator. “Naturally, the solution was to build a new game engine from scratch! I wanted to stop worrying about programming details, screen resolutions, platform differences, post-processing effects. I wanted to be able to immediately work on the heart of what I was trying to create: a world with a story.”\n He was inspired by his favourite spaces in games – towns in 2D RPGs like Zelda, Pokemon and Final Fantasy, and walking simulators like Gone Home. “I’ve always loved walking around and talking to everyone to learn about their personal problems or the history of the town. Games like that gave me confidence that those ingredients – a place and its inhabitants – were enough to make something interesting.”\n  He created Bitsy as a simple engine that doesn’t require coding knowledge to create something within it. It’s an engine built on constraint, restricting you to 8×8 pixel tiles and a three colour palette.\n “I made my first game about coming home to my apartment after work and finding my wife, Mary-Margaret, already napping on the couch and our cat begging for a snack,” says Adam. It used an early version of Bitsy, which required everything to be typed into a text file that was then loaded into the engine.\n Adam created the web app version of the editor when Mary-Margaret and a few friends said they wanted to make their own games using it. He put it online, posted it on Twitter and figured that would be the end of it.\n  Bitsy took off. Game makers found that the editor’s simplicity meant that they could make compelling games over a couple of evenings. The lowered stakes meant it was perfect for testing out ideas, making short mood pieces or expressing personal stories.\n Claire Morley was one of these designers. She was drawn in by Bitsy’s distinctive art style, created as a byproduct of the engines constraints.\n  “I played a few other games from the  Bitsy Moth Jam,” she says. “I loved how they all felt really similar, yet so distinct from each other. They all felt mysterious, but personal. They almost feel like they’re all from an alien or ancient culture, connected together, and by playing them I was scratching the surface of something magical.”\n Claire decided she wanted to make her own game. She made  Cat’s Out of the Bag! for the next jam, a game about sneaking around a highschool and listening to people’s conversations. She’s since made a handful of Bitsy games featuring  train journeys,  snowblindness and  a message in a bottle.\n “Bitsy strips away anything that’s not completely necessary to making an interactive story. It’s a very focused and limited tool, but those limitations mean you don’t have all this noise about what art style to use or how to set up controls,” says Claire. “While those are important things, the absence of them means that it’s easier to get to the core of the story, experience or message you’re trying to convey. It’s why Bitsy games often feel so conceptually strong.”\n Bitsy games feel like they belong to a distinct form of game making, one with its own rules and visual language. Making a game in Bitsy feels equivalent to deciding to record a film using Super 8 or shooting photos with an analogue camera. While it’s easy to learn for beginners, there’s still lots of space for experienced creators to experiment with. It’s led to people doing things with Bitsy that even Adam hadn’t anticipated.\n “People keep pushing against the constraints to invent new ways to use Bitsy that I never intended,” says Adam. People have made  short films, procedurally generated  radio tuners and  astronomy simulators using Bitsy. Much of this inventiveness has been driven by the community that has formed around the tool.\n  “If development of Bitsy itself froze today, I think we could still spend years finding interesting ways to use it,” says game and tool maker Mark Wonnacott, who is passionate about the community that has formed around the engine.\n “People are actually using it and playing each others games,” they explain. “There’s a good community of people helping and encouraging each other. People have drawn parallels between Bitsy and Twine, but I’m not sure if they’re thinking about the tool as much as the shape of the scene forming round it.”\n Both Claire and Mark are at the heart of that scene. Claire has been pivotal in creating spaces for the community to flourish. Alongside Lorenzo Pilia (programme manager for  A Maze and part of the Global Game Jam executive committee) she set up @bitsypcs, a Twitter account that shares news about Bitsy and games made in the engine.\n The Twitter account led to the pair setting up a Discord, Bitsy Talk, which has become an unofficial home of the community. It’s a welcoming space where people can go and “share ideas, games and add-on tools”. There you can find people who’ve made half a dozen games giving tips to complete beginners.\n  Mark has become something of a Bitsy archivist. They created the  Bitsy Omnibus, a catalogue of every Bitsy game. It was originally motivated by another of their projects, the Bitsy Boutique, a hardware player for Bitsy games made using a PocketCHIP mounted in a jewellery box.\n  “I wanted to work out how to elevate Bitsy games from individual web games into something you could exhibit somewhere,” explains Mark, “To get it in front of people who aren’t playing tiny webgames already. The response from creators has been unanimously positive so far, people are excited to see their works recognised as part of a larger whole.”\n Its first showing has just been announced for Rezzed’s  Leftfield Collection. It’s one of the ways Bitsy is starting to move beyond online spaces. There are meetups in Brighton and Seattle, and Claire and Mark are working together to host one in Bristol. Claire is also hosting a workshop to teach kids to make games using Bitsy (she’s previously taught her  Dad).\n  “Seeing the community take shape has been the most magical and inspiring thing about working on Bitsy.” says Adam, “Without their creativity and hard work, we wouldn’t be talking about Bitsy right now. All the ways they use the engine has driven what I’ve added to it, and given me the energy to keep working on the project.”\n This energy goes both ways. The community sprung from Adam’s willingness to listen to thoughts, questions and feedback. He’s also the host of a monthly game jam that has inspired many to make their first game. The community hasn’t sprung up from nowhere: Adam’s recognition of its importance and his willingness to nurture it is a reason for its growth.\n “The community is crucial for people who are maybe making a game or sharing one to a wider audience for the first time,” says Adam. “It helps people to see that it’s accepted and celebrated to make something small, or personal, or incomplete.”", "posttime": "2020-05-09 20:18:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,制造商,game,bitsy", "title": "小游戏制造商找到了他们与Bitsy的社区", "title_en": "Small game makers found their community with Bitsy", "transed": 1, "url": "https://www.rockpapershotgun.com/2018/02/23/how-small-game-makers-found-their-community-with-bitsy/", "via": "", "real_tags": ["游戏", "制造商", "game", "bitsy"]}, {"category": "", "categoryclass": "", "imagename": "749957dca111c1f4cf8c5c798b2f5fc1.jpg", "infoid": 1001377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“日本研究人员即将了解为什么雷暴会对一些真菌的生长产生积极影响，”“物理世界”上个月报道，这对农业产生了一些有趣的影响。\n这些雷暴不一定要在附近，甚至不需要是自然的：“岩手大学的高木光一和同事们在一系列实验中表明，人工雷击不一定要直接击中香菇栽培床来促进生长。”相反，即使是间接存在的电场，似乎也能诱使蘑菇结出果实。\n正如这篇文章所解释的那样，“长期以来，人们都知道大气中的电可以促进生物的生长，包括植物、昆虫和老鼠。”但是蘑菇似乎甚至对区域性的电现象也有反应--例如，当远处的闪电风暴袭来时。在Takaki之前的研究中，产量的提高是通过直流电通过香菇原木来实现的。但高木仍然想知道--为什么自然电暴会间接影响距离雷击数英里的蘑菇的生长？\n输电线或发电设施，如发电厂，是否也可能影响-甚至催化-蘑菇的生长尚不清楚。\n目前，Takaki希望开发某种电刺激技术来种植蘑菇，着眼于全球食品市场。\n想象一下，有一天，你在美食意大利面中吃的那些蘑菇是在某种野生的尼古拉·特斯拉(Nikola Tesla)式的电子笼子里种植的，一半是X战警，一半是食物-不久的将来-地下闪闪发光的真菌力量圆顶技术，这是相当令人惊讶的。\n与此同时，这篇帖子的开篇图片来自我在2009年与尼古拉·特威利(Nicola Twilley)一起进行的一次超现实的实地考察，参观了位于澳大利亚东南部的一条废弃的铁路隧道--米大港蘑菇隧道，它现在-或者说在2009年-被用作地下蘑菇生长设施。想象一下，这条隧道在黑暗中静静地通电，潮湿，闪电，潮湿的原木长满了定向真菌。\n电子蘑菇控制技术，或者食品生产的未来与惠普·洛夫克拉夫特的世界潜移默化地融合在一起。", "note_en": "“Japanese researchers are closing in on understanding why electrical storms have a positive influence on the growth of some fungi,”   Physics World reported last month, with some interesting implications for agriculture.\n These electrical storms do not have to be nearby, and they do not even need to be natural: “In a series of experiments, Koichi Takaki at Iwate University and colleagues showed that artificial lightning strikes do not have to directly strike shiitake mushroom cultivation beds to promote growth.” Instead, it seems one can coax mushrooms into fruiting using even just the indirect presence of electrical fields.\n As the article explains, “atmospheric electricity has long been known to boost the growth of living things, including plants, insects and rats,” but mushrooms appear to respond even to regional electrical phenomena—for example, when a distant lightning storm rolls by. “In Takaki’s previous studies, yield increases were achieved by running a direct current through a shiitake mushroom log. But Takaki still wondered—why do natural electric storms indirectly influenced [sic] the growth of mushrooms located miles away from the lightning strikes?”\n Whether or not power lines or electricity-generation facilities, such as power plants, might also affect—or even catalyze—mushroom growth is not clear.\n For now, Takaki is hoping to develop some kind of electrical-stimulation technique for mushroom growth, with an eye on the global food market.\n  It is quite astonishing to imagine that, someday, those mushrooms you’re eating in a gourmet pasta dish were grown inside some sort of wild, Nikola Tesla-like electrical cage, half  X-Men, half food-technology of the near-future—underground shining domes of fungal power.\n  The opening image of this post, meanwhile, is from a surreal field trip I took back in 2009 with Nicola Twilley to visit the “ mushroom tunnel of Mittagong,” a disused rail tunnel in southeast Australia that is—or, as of 2009, was—used as a subterranean mushroom-growth facility. Imagine this tunnel quietly pulsing with electricity in the darkness, humid, strobing, its wet logs fruiting with directed fungi.\n Electrical mushroom-control techniques, or where the future of food production merges imperceptibly with the world of H.P. Lovecraft.", "posttime": "2020-05-09 19:42:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "真菌,fungal,蘑菇", "title": "真菌闪电", "title_en": "Fungal Lightning", "transed": 1, "url": "http://www.bldgblog.com/2020/05/fungal-lightning/", "via": "", "real_tags": ["真菌", "fungal", "蘑菇"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001376, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章是我对一本无意的CTO书的忏悔的一部分，这本书目前可以在网上免费阅读。\n我们Web应用程序所有者通常希望接受信用卡付款，无论我们销售什么。由于推出我们自己的符合安全标准的商家解决方案既有风险又耗时，我们通常会将麻烦卸给贝宝(PayPal)或Strip等支付提供商。\n乍一看，这些服务的收费计划似乎足够合理，但遗憾的是，有很多小字，有很多隐藏的陷阱，成本高昂，但很难预先发现。仅举一个例子：早在2015年12月，当我写下这篇文章的初稿时，贝宝(PayPal)的主页上刊登了一则广告，称“在大多数情况下”，他们对自己的服务收取1.9%的交易费。听起来不错，对吧？实际上，那个月我的平均费用高达8.8%--比我预期的高出四倍。那么，所有这些额外的费用是从哪里开始的呢？\n网络的美妙之处之一在于，它将人们联系在一起，尽管有传统的国家边界；没有什么能阻止来自澳大利亚、巴西或卡塔尔的顾客在你的网站上停留并购买东西。当然，尽管网络超越了国界，但它仍然存在于一个有边界的世界。因此，你的国际客户会想要用他们自己的货币购买，这可能会与你们国家的主流货币不同。\nWeb应用程序所有者在这里有两个选择：用客户的货币计费或用他们自己的货币计费。\n为了说明起见，我假设您的业务是用欧元运营的，并且您的客户想用英镑购买。\n客户必须支付货币转换费，这将由他们的信用卡提供商(Visa等)征收。或您整合到网站中的支付提供商(PayPal等人)。虽然在这种情况下您个人可以避免货币转换费，但是对于大多数企业来说，这种方法在商业上是站不住脚的。除了让客户承担额外的隐性费用而损害您的声誉之外，这种方法还有一个更直接的缺点：它吓坏和困惑客户，当他们看到您的网站以欧元而不是他们本国的英镑定价和计费时，现在觉得您的产品不知何故是外来的、不合适的，甚至不如竞争对手以当地货币计费的产品。这反过来又会降低你的转换率。\n这里的结果是，您的支付提供商帐户将积累英镑持有量。但是因为你的企业需要欧元来支付账单，你迟早要把英镑兑换成欧元。这就是支付提供商敲诈你的地方：通常有一条小字规定，如果不先通过他们的平台将钱兑换成你的本国货币(EUR)，你就不能把钱提取到你的银行账户。问题是，他们的货币转换率-你被迫接受的那个-比当时的正常市场汇率高出2.5%到4.5%。支付提供商会告诉您，这项附加费的存在是为了在“市场波动”的情况下支付他们的费用。这是彻头彻尾的垃圾，几乎是对风险大小的刑事歪曲。相比之下，普通银行-如德意志银行-也面临着完全相同的风险，但它们只收取比市场利率高出0.1%的费用。去想想吧。\n在一些支付提供商使用某些狭窄的货币组合进行交易的情况下，可以得到喘息之机，有时您可以在不强制货币兑换的情况下提取资金。例如，在德国，您可以将英镑提取到以英镑计价的德国银行账户，从而避免了在提取到欧元银行账户时需要支付的强制货币转换费。这就是说，即使是条纹也不能为许多其他国家和货币提供同样的可能性。而且，不用说，如果你的总部设在欧元国家，贝宝的好人总是强迫你用欧元取款，这意味着你永远无法逃避他们肮脏的货币转换费。绕过他们系统的唯一方法是在英国开立一个银行账户，然后在那里为你的英镑交易开设一个单独的贝宝账户，最后建立一个软件旋转木马，根据你客户的货币切换贝宝账户。\n总而言之，对于许多小企业来说，绕过支付提供商的货币转换费所涉及的会计和行政麻烦可能并不值得，因此，他们被迫咧嘴笑着承担夸大的费用。\n支付提供商主页上描绘的美好图景还为您报价了国内交易的费率，即与您位于同一国家的客户的费率。考虑到互联网是一个全球性的社区，你90%以上的客户都是国际客户的情况很可能是这样的。如果是这样的话，您将被收取高达3%的额外费用。这还不包括货币转换费，这意味着国际客户的额外费用总额最高可达7.5%。\n一些支付提供商，如贝宝(PayPal)，允许您过去的客户直接与他们提起纠纷。很多时候，这是欺诈的工具。例如，假设一个流氓在你的网站上下了订单，接受了你提供的任何电子服务，然后向支付提供商提出(不诚实的)投诉，声称他们的卡被盗了，或者商品与描述不符。同时，此流氓继续下载您的数字产品或享受您的服务。贝宝(PayPal)声称会考虑案件的双方，但它总是会在没有考虑你拥有的任何证据的情况下，决定任何纠纷对客户有利，这意味着由于容易防止欺诈，你会自动损失一定比例的销售额。实际上，这是他们对你的业务施加的一种阴险的隐性指控，他们用来以牺牲你为代价来提升自己的声誉。", "note_en": "This article is part of my  Confessions of an Unintentional CTO book, which is currently available to read for free online.\n We web application owners often want to accept credit card payments for whatever we sell. Because rolling our own  security-compliant merchant solutions is both risky and time-consuming, we usually offload the hassle to payment providers like PayPal or Stripe.\n At first glance, the fee schedule for these services seems reasonable enough, but sadly, there’s a lot of small print and there are plenty of hidden gotchas that are costly yet difficult to detect up front. To give but one example: When I wrote the first draft of this post way back in December 2015, the homepage of PayPal advertised that “in most cases” they charge a 1.9% transaction fee for their services. Sounds OK-ish, right? In reality, my average fee that month was a whopping 8.8%—four times more than I was led to expect. So where do all these extra charges enter the picture?\n  Part of the beauty of the web is that it connects people, despite traditional national borders; there’s nothing stopping customers from Australia or Brazil or Qatar from stopping by your website and buying something. Of course, even though the web transcends national borders, it nevertheless exists in a bordered world. As such, your international customers will want to buy using their own currency, which will probably differ from the one predominant in your homeland.\n Web application owners have two choices here: bill in the customer’s currency or bill in their own currency.\n For the purposes of illustration, I’ll assume from here that your business operates in EUR and your customer wants to buy with GBP.\n  The customer will have to pay a currency conversion fee, and this will be levied either by their credit card provider (Visa etc.) or the payment provider you integrated into your website (PayPal et al). Although you personally avoid currency conversion fees in this case, this approach is nevertheless commercially untenable for most businesses. Aside from tarnishing your reputation by exposing the customer to extra hidden fees, this approach has an even more immediate downside: it scares and confuses customers who, upon seeing your website pricing and billing in EUR instead of their home GBP, now feel your products are somehow foreign, inappropriate, or even inferior to those sold by competitors billing in their local currency. This in turn chips away at your conversion rates.\n  The consequence here is that your payment provider account will accumulate GBP holdings. But because your business needs EUR to pay its bills, sooner or later you’ll have to convert the GBP into EUR. Here’s where payment providers fleece you: there is often a small print stipulation that you are not allowed to withdraw money to your bank account without first converting money to your home currency (EUR)  through their platform. The catch is that their currency conversion rate—the one you are forced to accept—is between 2.5% and 4.5% higher than the normal market rates available at that time. The payment providers will tell you that this surcharge exists to cover them in case of “market fluctuations”. This is utter rubbish and represents an almost criminal misrepresentation of the magnitude of the risk. By way of comparison, normal banks—such as Deutsche Bank—are subject to this exact same risk, but they charge only 0.1% above the market rate. Go figure.\n In the cases of  some payment providers transacting with certain narrow combinations of currencies, there is respite and you can sometimes withdraw money without forced currency exchanges. For example, with Stripe in Germany, you are allowed to withdraw GBP to a GBP-denominated bank account based in Germany, thereby avoiding the forced currency conversion fee that would otherwise apply when withdrawing to a EUR bank account. That said, even Stripe doesn’t offer the same possibility for many other countries and currencies. And, needless to say, the good people at PayPal  always force you to withdraw in EUR if you are based in a EUR country, meaning you can never avoid their obscene currency conversion fees. The only way around their system is to open up a bank account in the UK, then open up a separate PayPal account there for your GBP transactions, and then finally build a software merry-go-round to switch PayPal accounts depending on your customer’s currency.\n All in all, the accounting and administrative hassle involved with circumnavigating a payment provider’s currency conversion fees may not be worth it for many small businesses, and as such, they are forced to grin and bear the inflated fees.\n  The rosy picture painted on payment providers’ home pages also quotes you a rate for  domestic transactions, that is, for customers based in the same country as you. Given that the internet is a global community, it could well be the case that more than 90% of your customers are international. If so, you’ll be charged up to an additional 3% in fees. This is  in addition to the fees for currency conversion, meaning that the total of extra fees for international customers can amount to up to 7.5%.\n  Some payment providers, like PayPal, allow your past customers to file disputes with them directly. All too often, this is a vehicle for fraud. For example, imagine that a rogue places an order on your website, receives whatever electronic service you provide, then files a (dishonest) complaint with the payment provider, claiming that their card was stolen or that the goods didn’t match the description. Meanwhile, this rogue continues to download your digital products or enjoy your service. PayPal claims to look at both sides of the case yet invariably it decides any dispute in favour of the customer, without considering any evidence you have, meaning you automatically lose a percentage of your sales thanks to easily prevented fraud. This is, in effect, an insidious hidden charge they place on your business, and one they use to bolster their reputation at your expense.", "posttime": "2020-05-09 18:00:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供商,providers,货币", "title": "支付提供商欺负你(2015)", "title_en": "Payments Providers Screw You (2015)", "transed": 1, "url": "https://www.jackkinsella.ie/articles/how-payments-providers-screw-you", "via": "", "real_tags": ["提供商", "providers", "货币"]}, {"category": "", "categoryclass": "", "imagename": "5455dc5fac65f12010e709314226de7c.jpg", "infoid": 1001374, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在视频1701中，我们可以用机器打开国会大厦的磁锁，看看它是如何工作的！获胜者不想支付运往欧洲的船费，所以她.", "note_en": "In video 1701 we get to machine open the Capitol Industries magnetic lock and see how it works! The winner did not want to pay for shipping to Europe so she ...", "posttime": "2020-05-09 17:58:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "露出,lock,不想", "title": "带露出磁钥匙的机械锁", "title_en": "Mechanical lock with magnetic key – exposed", "transed": 1, "url": "https://youtu.be/Yqioc6CIqFE", "via": "", "real_tags": ["露出", "lock", "不想"]}, {"category": "", "categoryclass": "", "imagename": "142d0dcc35202e90e4e0b0719684468a.png", "infoid": 1001373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两周前，我在谷歌进行了一次现场求职面试。我面试的职位是谷歌SRE。SRE代表站点可靠性工程。站点可靠性工程师(SRE)既是软件工程师，又是系统管理员，负责谷歌从端到端的生产服务。\n我采访了八个不同的人。前三个是通过电话，剩下的五个是在现场。第一次面试是与招聘人员进行的，不是很技术性，但其他七次面试都是技术性的。\n不幸的是，我刚刚得知我没有被录用。招聘人员说，早上的面试不是那么棒，我应该在他们的关键任务团队中获得更多的工作经验。\n更新：本文已被翻译成日文。更新：本文已被翻译成德文。\n在我在Google Chrome上发布代码重用的帖子后不久，Google的一位招聘人员联系了我。这封电子邮件写道：\n我在谷歌招聘顶尖的软件工程人才。我最近偶然发现您可能是一名世界级工程师，我很想更多地了解您。我保证也会交换一些关于我们的详细信息。有兴趣听更多吗？想成为谷歌的一名有影响力的玩家吗？那么请给我一份最新的(英文)简历，我很乐意打电话给你讨论。\n起初，我以为我会申请一个软件开发人员的职位，但在我们检查了我的技能后，招聘人员得出结论，我更适合做一名SRE。我同意他的看法。这对我来说似乎是一个完美的职位。我热爱系统管理，就像热爱编程一样。\n第一次面试是在9月10日，招聘者参加了面试。他向我解释了谷歌招聘流程，我们仔细检查了一下我的技能。我必须在C编程(8)、C++编程(7)、Python编程(6)、网络(6)、算法和数据结构(6)、分布式系统(5)、Linux系统管理(9)等一系列领域对自己进行从0到10的排名。\n根据我的回答，我们得出结论，SRE是我的最佳职位。SRE必须了解所有内容：算法、数据结构、编程、网络、分布式系统、可扩展架构、故障排除。这是一个很棒的黑客职位！\n面试的后半部分有一些基本的技术问题，以确保我不是在虚张声势。这些问题涉及Linux系统管理、算法、计算机体系结构和C编程。你可以在这篇文章的底部找到所有面试中的所有问题。\n我犯了几个错误，但他很满意，我们安排了下一次电话采访。他警告我，这将是非常技术性的，我应该做好真正的准备。我请他给我充足的时间准备，我们把下一次面试安排在9月22日。\n他还告诉我，每次电话采访时长为45分钟到1小时。\n我制定了一份日程表，并开始准备。我找到了关于SRE的三个演示文稿：\n因为我不知道在接下来的采访中将使用哪种编程语言，所以我在C++Cookbook、Python Cookbook和Perl Cookbook中查看了几十个食谱。\n第二次电话采访是对谷歌的一名工程师的采访。他在负责运营AdSense、AdWords和其他广告的广告团队工作。\n这次面试非常技术性，一开始就有一个算法问题，这个问题太大了，计算机内存无法容纳。我必须准确地告诉他我将如何解决这个问题，以及我将使用什么数据结构和算法。他还让我大声地想一想。采访继续就数据结构、DNS、TCP协议、与TCP相关的安全漏洞、总体网络以及Google本身等问题进行了讨论。\n面试结束后，工程师必须写反馈给招聘人员。结果是积极的，我可以继续面试了。\n我给了自己更多的时间准备，第三次面试是在10月1日。是和谷歌交通团队的一名工程师。\n在这次采访中，我有一个非常简单的编程问题，我必须通过电话进行编码。我可以自由选择语言，我选择了Perl，因为它是我最喜欢的编程语言。无法通过电话口述我的美元符号元素的Perl语法open paren at data close paren open curly括号.。右花括号&34；所以我通过电子邮件提交了我的Perl程序。\n问题是：编写一个程序来找出设定的差值。给定两个集合A和B，查找A-B中的元素，或者换句话说，查找集合A中不在B中的元素。\n然后，同样的问题被带到了下一个级别，如果我们正在处理的数据是GB大小，TB大小，该怎么办？我的计划/解决方案会有什么变化？\n最后，我又有了一个关于DNS的问题，然后是HTTP协议、路由和TCP数据传输。\n反馈又是正面的，我可以为现场面试做准备了。在与招聘人员的谈话中，我得知将有五次现场面试，每次面试时间正好是45分钟。一个是关于我以前的工作经验，一个是关于算法和数据结构的，一个是关于故障排除和联网的，还有两个是关于软件开发的，重点是C和C++。\n第四次面试最终在山景城的谷歌综合大楼进行。上午10点，我会见了我的招聘人员，我们就面试问题进行了15分钟的讨论。他告诉我，我现在有两次面试，然后谷歌的一名工程师会带我去谷歌的一家餐厅吃午饭，然后我还会有另外三次面试。\n上午10点15分，第一次现场采访开始。是关于我以前的工作经验。我过去有过很多工作经验，我决定讲述几年前我在Linux上用C语言编写的一个物理安全通知系统。系统通过串口接收消息，通过SMTP发送电子邮件，通过GSM调制解调器发送文本消息。\n在采访的最后几分钟，他问了我一些基本的Unix文件系统问题，例如，什么是inode？\n第五次面试于上午11点开始。这是一次编码会议，以刁钻的问题开始，而不是真正的编码问题。刁钻的问题是这样的：当它是3：15？&34；时，时钟指针之间的夹角是多少？然后，我被要求用C语言在任意时间(小时/分钟)实现这个解决方案。解决方案是一个单行返回语句的数学表达式。然后我被要求在白板上写一个二叉树的实现。在编码时，我忘了初始化我编辑了mallow()的数据结构。程序在现实生活中会有段错误，而我会注意到这个错误。我说这里没有错误，但谷歌工程师指出我没有初始化数据。\n这次面试之后，工程师请我吃了午饭，他在第二次电话面试中面试了我。她告诉我，她在谷歌工作了两年，对此非常高兴。我们去了Googleplex的亚洲餐厅。然后她带我参观了Googleplex。\n第六次面试于下午12点45分开始。这是一次故障排除和网络面试。面试官在白板上画了一张网络图，并在上面想象了一个问题。我不得不问了一堆具体的网络问题来定位问题。他很满意，在采访的最后几分钟，他问了我一些具体的网络设备问题，比如路由器和交换机的区别是什么，OSI的型号是什么。\n第七次面试于下午1：30开始。那是一次编码会议。我被要求实现一个简单的字符串操作子例程来查找两个C字符串中的公共字符。我可以使用C或C++。我选择了C。我在那里犯了一个小小的错误。整个采访都集中在这一个问题上。\n最后一次，也就是八点，采访于下午2点15分开始。这是一次算法和数据结构面谈。这里提出的问题与第二次面试中的问题类似。这不仅是一个太大的问题，计算机内存无法容纳，而且它还是分布式的。如何对内存中放不下的数据进行排序，而您有100台计算机来对其进行排序。我不得不使出各种诡计来解决它。这次采访非常自由，我们就这个问题来回讨论。我在面试接近尾声时得出了正确的解决方案，他说没有多少应聘者走得那么远。我还被问到是否知道map-Reduce，当然，我知道map-Reduce，因为我刚刚读了谷歌的那篇论文。这是一个地图缩减问题。\n面试结束后，工程师护送我去了大厅，我打车回了酒店。\n总体而言，谷歌的采访非常有趣。我喜欢这样的琐碎问题。这些问题都是技术性的，但不是很有挑战性或难度。\n假设有100 GB的文件和一台内存为1 GB的计算机，您会如何对其进行排序。", "note_en": "Two weeks ago I had an on-site job interview at Google. The position I was interviewing for was a Google SRE. SRE stands for Site Reliability Engineering. Site reliability engineers (SREs) are both software engineers and systems administrators, responsible for Google&#39;s production services from end-to-end.\n I interviewed with eight separate people. The first three were over the phone and the remaining five were on-site. The first interview was with the recruiter and was not very technical but the other seven were technical.\n Unfortunately, I just learned that I&#39;m not getting hired. The recruiter said that &#34;the morning interviews were not that great&#34; and &#34;I should get more experience to work in their mission critical team.&#34;\n Update: This article has been  translated to Japanese.  Update: This article has been  translated to German.\n  Shortly after I published the  Code Reuse in Google Chrome post, I was contacted by a recruiter at Google. The email said:\n I recruit top notch Software Engineering talent at Google. I recently came across your name as a possible world class Engineer and am intrigued to know more about you. I promise to exchange some detailed info about us as well. Interested to hear more? Want to be an impact player at Google? Then please respond with a current (English) copy of your resume and I&#39;ll be happy to call you and discuss.\n At first I thought I would be applying for a software developer position but after we went through my skillset, the recruiter concluded that I would better fit as an SRE. I agreed with him. This seemed like a perfect position for me. I love system administration as much as I love programming.\n  The first interview was on 10th of September with the recruiter. He explained the Google recruitment process to me and we went through my skill set. I had to rank myself from 0 - 10 in a bunch of areas such as C programming (8), C++ programming (7), Python programming (6), networking (6), algorithms and data structures (6), distributed systems (5), Linux systems administration (9), and others.\n Based on my answers, we concluded that SRE was the best position for me. An SRE has to know everything: algorithms, data structures, programming, networking, distributed systems, scalable architecture, troubleshooting. It&#39;s a great hacker position!\n The second half of the interview had some basic technical questions to make sure I wasn&#39;t bluffing. The questions were about Linux systems administration, algorithms, computer architecture and C programming. You can find all questions from all interviews at the bottom of this post.\n I made a couple of mistakes but he was satisfied and we scheduled the next phone interview. He warned me that it will be very technical and I should do a really good preparation. I asked him to give me a plenty of time for the preparation and we scheduled the next interview on 22nd of September.\n He also told me that each phone interview is going to be 45 minutes to 1 hour long.\n I created a daily schedule and started preparing. I found three presentations on what SRE is all about:\n        As I did not know which programming language I will use in the next interviews, I went through dozens of recipes in  C++ Cookbook,  Python Cookbook, and  Perl Cookbook.\n  The second phone interview was with an engineer from Google. He worked on the Ads team which is responsible for running AdSense, AdWords, and other advertisement stuff.\n The interview was very technical and started with an algorithmic problem which was too large to fit in computer memory. I had to tell him precisely how I would get around this problem and what data structures and algorithms I would use. He also asked me to think out loudly. The interview continued with questions about data structures, DNS, TCP protocol, a security vulnerability associated with TCP, networking in general, and Google itself.\n   After the interview the engineer had to write feedback to the recruiter. It was positive and I could move on with the interview.\n  I gave myself more time to prepare and the third interview was on the 1st of October. It was with an engineer from the Google traffic team.\n In this interview, I had a very simple programming question and I had to do coding over phone. I was free to choose the language and I chose Perl as it is my most favorite programming language. It was impossible to dictate Perl syntax over phone &#34;for my dollar sign element open paren at data close paren open curly brace ... close curly brace&#34; so I submitted my Perl program over the email.\n   The question was: Write a program to find the set difference. Given two sets A and B, find elements in A-B, or in other words, find elements in set A that are not in B.\n Then the same problem was taken to the next level, what if the data we are working on is gigabytes in size, terabytes in size. How would my program/solution change?\n Finally I had a question about DNS again, then HTTP protocol, routing, and TCP data transfer.\n   The feedback was again positive and I could prepare for the on-site interviews. In my conversation with my recruiter I got to know that there will be five on-site interviews, each exactly 45 minutes long. One on my previous work experience, one on algorithms and data structures, one on troubleshooting and networking, and two on software development with the focus on C and C++.\n    The fourth interview was finally at Googleplex in Mountain View. At 10am I met my recruiter and we had a 15 minute discussion about the interviews. He told me I would have two interviews now, then one of Google engineers would take me to lunch in one of Google&#39;s restaurants and then I would have three other interviews.\n At 10:15am the first on-site interview began. It was about my previous job experience. I have had a lot of job experience in the past and I decided to tell about a physical security notification system that I coded in C on Linux a few years ago. The system received messages through the serial port, send out emails through SMTP, and text messages through a GSM modem.\n In the last minutes of the interview he asked me some basic Unix filesystem questions, such as, what is an inode?\n   The fifth interview began at 11am. It was a coding session and began with a trick question and not a real coding problem. The trick question was this: &#34;What&#39;s the angle between clock hands when it&#39;s 3:15?&#34; Then I was asked to implement the solution in C for arbitrary time (hour/minute). The solution was a mathematical expression that was a one-line return statement. Then I was asked to write an implementation of a binary tree on the whiteboard. While coding, I forgot to initialize a data structure that I had mallow()&#39;ed. The program would have segfault&#39;ed in real life and I would have noticed the error. I said there were no errors here but the Google engineer pointed out I hadn&#39;t initialized data.\n After this interview I was taken to lunch by the engineer who interviewed me on the second phone interview. She told me she was working at Google for two years and was very happy about it. We went to Asian food restaurant in Googleplex. Then she showed me around Googleplex.\n  The sixth interview began at 12:45pm. It was a troubleshooting and networking interview. The interviewer drew a network diagram on the whiteboard and had imagined a problem in there. I had to ask a bunch of specific networking questions to locate the problem. He was satisfied and in the last few minutes of the interview he asked me some specific networking device questions, like what&#39;s the difference between a router and a switch, and what&#39;s OSI model.\n  The seventh interview began at 1:30pm. It was a coding session. I was asked to implement a simple string manipulation subroutine that finds common characters in two C strings. I could use either C or C++. I chose C. I made an off-by-one mistake there. The whole interview focused on this one problem.\n  The last, eight, interview began at 2:15pm. It was algorithms and data structures interview. The problem presented here was similar to the problem in the 2nd interview. Not only was it a problem too large to fit in computer memory but it also was distributed. How to sort data that doesn&#39;t fit in memory and you&#39;ve got 100 computers to sort it. I had to do all kinds of trickery to solve it. The interview was very free-style and we talked back and forth about the problem. I arrived at the correct solution near the end of the interview and he said that not many candidates got that far. I was also asked if I knew map-reduce and of course I knew map-reduce as I just had read the Google paper. This was a map-reduce problem.\n After the interview the engineer escorted me out to the lobby and I took a cab back to my hotel.\n  Overall, the Google interview was super fun. I love trivia questions like this. The questions were technical but not very challenging or difficult.\n  Given 100GB file and a computer with 1GB of memory, how would you sort it.", "posttime": "2020-05-09 17:29:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面试,google,谷歌,求职,interview", "title": "我在谷歌的求职面试", "title_en": "My Job Interview at Google", "transed": 1, "url": "https://catonmat.net/my-job-interview-at-google", "via": "", "real_tags": ["面试", "google", "谷歌", "求职", "interview"]}, {"category": "", "categoryclass": "", "imagename": "7290d85698db3f2d47ffe3c8093ab3b3.png", "infoid": 1001372, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与对照组相比，基本收入接受者对生活的满意度更高，精神压力更小。他们对自己的经济福利也有更积极的看法。2018年激活模式的推出，使得对实验就业效应的解读变得复杂起来。\n2017-2018年在芬兰开展了为期两年的基本收入实验。评估研究现已可用。有关就业的登记数据现已涵盖试验的两年，并对调查结果作了更深入的分析。此外，以访谈为基础的基本收入接受者调查补充了整体情况。\n按照评估初步方案，测算了2017年11月至2018年10月期间基本收入试验的就业效果。在此期间，基本收入接受者的就业率比对照组略有改善。在参考期内，基本收入增加就业天数6天，基本收入领取者平均就业天数为78天。\n然而，由于2018年初引入激活模式，对实验效果的解读变得更加复杂，这意味着两组人都不对称地获得了更严格的失业救济金权利标准。\n-VATT经济研究所首席研究员Kari Hämäläinen表示，实验第二年的影响不能与激活模型的影响分开。\n在实验的第一年，在还没有引入激活模型的情况下，基本收入对群体层面的基本收入接受者没有任何就业影响。然而，基本收入似乎对不同的群体产生了略有不同的影响：例如，对于有孩子的家庭来说，在实验的两年里，就业率都有所提高。不同群体的结果仍然不确定，因为观察的数量很少，测试的次数也很多。\n-总括而言，就业影响不大。Hämäläinen说，这表明，对于一些从Kela领取失业救济金的人来说，与找工作有关的问题与官僚作风或财政激励无关。\n基本收入实验对幸福感的影响是通过一项在实验结束前通过电话进行的调查来研究的。\n获得基本收入的调查受访者比控制组的受访者更积极地描述了他们的幸福感。他们对生活更满意，精神压力、抑郁、悲伤和孤独感也更少。他们对自己的认知能力，即记忆、学习和集中注意力的能力也有更积极的看法。\n-此外，获得基本收入的受访者对自己的收入和经济福祉的看法比对照组更积极。Kela(芬兰社会保险机构)研究团队负责人Minna Ylikännö表示，他们更有可能发现自己的财务状况是可控的，他们在财务上得到了保护。\n与对照组相比，基本收入接受者在更大程度上信任他人和社会机构，对自己的未来和影响事物的能力更有信心。这可能是因为基本收入是无条件的，在之前的研究中，这被认为可以增加人们对这一制度的信任。-根据这项研究，不可能肯定地说，试验组更好的福祉具体是由于收到了基本收入。Ylikännö说，同样，其他国家的地区和地方的基本收入实验也显示出类似的改善福祉的结果。\n调查的回复率为23%(基本收入接受者为31%，对照组为20%)，这是典型的调查结果。\n在这项研究中，共有81名基本收入获得者接受了采访。采访突出了实验的不同效果，以及基本收入接受者在起点和生活状况上的差异。\n一些受访者表示，基本收入实验显然对就业产生了影响，而另一些受访者则表示影响很小。实验前受访者起点不同也影响就业。\n对一些人来说，该实验提供了参与社会的新机会，例如通过志愿工作或非正式护理。不少受访者表示，基本收入强化了自主感。尽管对基本收入影响的描述总体上是相当积极的，但对一些人来说，这项实验也造成了找工作的压力和应对能力的困难。\n-在那些之前已经活跃的人中，基本收入似乎增加了不同类型的活动。赫尔辛基大学(University Of Helsinki)教授海伦娜·布隆伯格-克罗尔(Helena Blomberg-Kroll)表示，再一次，对于那些在实验之前生活状况充满挑战的人来说，基本收入似乎并没有解决他们的问题。\n-基本收入试验提供了关于社会保障制度可能性的宝贵信息。社会事务和卫生部长Aino-Kaisa Pekonen说，实验提供的信息也可以用于改革社会保障制度。\n芬兰的基本收入实验是世界上第一个全国性的、法定的、基于随机实地实验的基本收入实验。参与实验不是自愿的，这意味着与其他基于自愿参与的实验相比，可以对实验的效果得出更可靠的结论。\n-实验的实施是成功的，它提供了没有实验就得不到的新信息。芬兰科学院战略研究理事会项目负责人奥利·坎加斯(Olli Kangas)表示，这也表明，从立法角度来看，在芬兰安排广泛的社会实验是可能的。\n在基本收入实验中，2000名失业人员每月获得560欧元的免税基本收入，无论他们可能有任何其他收入，也无论他们是否正在积极寻找工作。基本收入接受者是通过随机抽样从2016年11月从Kela领取失业救济金的人中挑选出来的。控制组由那些在2016年11月从Kela领取失业救济金但没有被选中参加实验的人组成。\n实验于2017年1月1日开始，2018年12月31日结束。进行实验的决定是由当时的总理朱哈·西皮拉(Juha Sipilä)领导的政府做出的。目的是研究如何重塑芬兰社会保障体系，使其更好地应对工作生活变化带来的挑战。该实验由KELA(芬兰社会保险机构)实施。\n基本收入实验结果将在5月6日13：00-15：00(芬兰时间)的在线广播中公布。该出版物是由KELA、社会事务和卫生部和赫尔辛基大学的智囊团合作安排的。你可以在这里观看在线转播和转播的录音。\n与Pekonen部长面谈的请求：Päivi Saarimaa，部长的秘书，电话。029 516 3535，[电子邮件受保护]。\nOlli Kangas，芬兰科学院战略研究理事会项目负责人，电话：045 138 3790，[电子邮件受保护]\nKari Hämäläinen，VATT经济研究所首席研究员，电话：0295 519 416，[电子邮件受保护](注册研究)。\nHelena Blomberg-Kroll，赫尔辛基大学瑞典社会科学学院教授，电话：050 448 4719，[电子邮件受保护](访谈研究)。\n最终报告：Olli Kangas，Signe Jauhiainen，Miska Simanainen ja Minna Ylikännö(Toim.)。索门·普鲁斯图罗科克伦·阿维奥伊伦。Sosiaali-ja terveysparteriön raportteja muistioita 2020：15.骨灰盒：ISBN：978-952-00-9890-2 kela.fi/基本收入实验", "note_en": "The basic income recipients were more satisfied with their lives and experienced less mental strain than the control group. They also had a more positive perception of their economic welfare. The interpretation of the employment effects of the experiment is complicated by the introduction of the activation model in 2018.\n    A two-year basic income experiment was carried out in Finland in 2017-2018. The evaluation study is now available. The register data on employment now cover both years of the experiment and a more thorough analysis has been made of the results of the survey. In addition, the interview-based survey of basic income recipients complements the overall picture.\n  In accordance with the preliminary plan for the evaluation, the employment effects of the basic income experiment were measured for the period from November 2017 to October 2018. The employment rate for basic income recipients improved slightly more during this period than for the control group. During the reference period, the basic income increased the number of days of employment by 6 days and the basic income recipients were employed for 78 days on average.\n  However, the interpretation of the effects of the experiment is made more complicated by the introduction of the activation model at the beginning of 2018, which meant more stringent entitlement criteria for unemployment benefits asymmetrically in both groups.\n  - The effects of the second year of the experiment cannot be separated from the effects of the activation model, says Kari Hämäläinen, Chief Researcher at the VATT Institute for Economic Research.\n  During the first year of the experiment, when the activation model had not yet been introduced, the basic income did not have any employment effects for the basic income recipients at group level. However, the basic income seems to have had slightly different effects on different groups: for instance for families with children who received a basic income, employment rates improved during both years of the experiment. The results for different groups are still uncertain due to the small number of observations and the numerous tests.\n  - All in all, the employment effects were small. This indicates that for some persons who receive unemployment benefits from Kela the problems related to finding employment are not related to bureaucracy or to financial incentives, says Hämäläinen.\n    The effects of the basic income experiment on wellbeing were studied through a survey which was done by phone just before the experiment ended.\n  Survey respondents who received a basic income described their wellbeing more positively than respondents in the control group. They were more satisfied with their lives and experienced less mental strain, depression, sadness and loneliness. They also had a more positive perception of their cognitive abilities, i.e. memory, learning and ability to concentrate.\n  – In addition, the respondents who received a basic income had a more positive perception of their income and economic wellbeing than the control group. They were more likely to find that their financial situation is manageable and that they are protected financially, says Minna Ylikännö, Head of the Research Team at Kela (the Social Insurance Institution of Finland).\n  The basic income recipients trusted other people and the institutions in society to a larger extent and were more confident in their own future and their ability to influence things than the control group. This may be due to the basic income being unconditional, which in previous studies has been seen to increase people’s trust in the system.     – On the basis of the study, it is not possible to say with certainty that the better wellbeing of the test group was due specifically to receipt of a basic income. Then again, regional and local basic income experiments in other countries have also shown similar results of improved wellbeing, says Ylikännö.\n  The response rate for the survey was 23% (31% for the basic income recipients and 20% for the control group), which is typical for surveys.\n    A total of 81 basic income recipients were also interviewed for the study. The interviews highlight the diverse effects of the experiment and the differences in the starting points and life situations of the basic income recipients.\n  Some interviewees said that the basic income experiment clearly had an effect on employment whereas others said that the effects were small. The different starting points of the interviewees before the experiment also affected employment.\n  For some the experiment offered new opportunities of participating in society for instance through voluntary work or informal care. Many interviewees said that the basic income strengthened the feeling of autonomy. Even though the descriptions of the effects of the basic income were on the whole fairly positive, for some the experiment had also created pressure to find a job and difficulties with the ability to cope.\n  - The basic income seems to have increased activity of different kinds among those who were active already earlier. Then again, for those who were in a challenging life situation before the experiment, the basic income does not seem to have solved their problems, says Helena Blomberg-Kroll, professor at the University of Helsinki.\n    - The basic income experiment has provided valuable information about the possibilities of the social security system. The information provided by the experiment can also be used when reforming the social security system, says Aino-Kaisa Pekonen, Minister of Social Affairs and Health.\n  The Finnish basic income experiment was the world’s first basic income experiment that was nationwide, statutory and based on a randomised field experiment. Participation in the experiment was not voluntary, which means that it is possible to draw more reliable conclusions of the effects of the experiment than is the case in other experiments which are based on voluntary participation.\n  - The implementation of the experiment was successful and it provided new information that would not have been available without the experiment. It also showed that in Finland the arranging of extensive social experiments is possible from a legislative viewpoint, says Olli Kangas, Programme Leader at the Strategic Research Council, Academy of Finland.\n  In the basic income experiment, 2,000 unemployed persons were paid a monthly tax-exempt basic income of 560 euros regardless of any other income they may have had or whether they were actively looking for work. The basic income recipients were selected through random sampling among those who in November 2016 received an unemployment benefit from Kela. The control group consisted of those who in November 2016 received an unemployment benefit from Kela but were not selected for the experiment.\n  The experiment was begun on 1 January 2017 and ended on 31 December 2018. The decision to conduct the experiment was made by the Government of the then Prime Minister Juha Sipilä. The aim was to study how it would be possible to reshape the Finnish social security system so that it better meets the challenges posed by changes in working life. The experiment was implemented by Kela (the Social Insurance Institution of Finland).\n    The results of the basic income experiment will be published in an online broadcast on 6 May at 13.00-15.00 (Finnish time). The publication is arranged in cooperation between Kela, the Ministry of Social Affairs and Health and The University of Helsinki&#39;s Think Corner. You can watch the online broadcast and the recording of the broadcast  here.\n    Requests for interviews with Minister Pekonen: Päivi Saarimaa, the Minister&#39;s secretary, Tel. 029 516 3535,  [email protected]\n  Olli Kangas, Programme Leader, Strategic Research Council, Academy of Finland, Tel. 045 138 3790,  [email protected]\n    Kari Hämäläinen, Chief Researcher, VATT Institute for Economic Research, Tel. 0295 519 416,  [email protected] (register study)\n  Helena Blomberg-Kroll, Professor, Swedish School of Social Science, University of Helsinki, Tel. 050 448 4719,  [email protected] (interview study)\n    Final report: Olli Kangas, Signe Jauhiainen, Miska Simanainen ja Minna Ylikännö (toim.) Suomen perustulokokeilun arviointi. Sosiaali- ja terveysministeriön raportteja ja muistioita 2020:15. URN:ISBN:978-952-00-9890-2   kela.fi/basic-income-experiment", "posttime": "2020-05-09 17:28:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基本,findland,实验", "title": "芬德兰的基本收入实验结果", "title_en": "Results of Findland's basic income experiment", "transed": 1, "url": "https://stm.fi/en/article/-/asset_publisher/perustulokokeilun-tulokset-tyollisyysvaikutukset-vahaisia-toimeentulo-ja-psyykkinen-terveys-koettiin-paremmaksi", "via": "", "real_tags": ["基本", "findland", "实验"]}, {"category": "", "categoryclass": "", "imagename": "b089c28e780f136c8729acab47eb2205.jpg", "infoid": 1001371, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人类高效散热的能力使我们能够覆盖每一大洲，但35°C的湿球温度(TW)标志着我们的生理上限，而更低的数值会严重影响健康和生产力。气候模型预测，到21世纪中叶，第一批35°C的TW事件将会发生。然而，对气象站数据的综合评估显示，一些沿海亚热带地区已经报告了35°C的TW，自1979年以来，极端湿热的频率总体上增加了一倍多。最近全球最高海面温度超过35摄氏度，进一步支持了这些危险的高TW值的有效性。我们发现最极端的湿热在空间和时间上都是高度局部化的，相应地，在再分析产品中也被大大低估了。因此，我们的研究结果强调了湿热带来的严峻挑战，湿热比以前报道的更强烈，而且越来越严重。\n人类两足动物的运动、裸露的皮肤和汗腺是复杂冷却系统的组成部分(1)。尽管进行了这些温度调节调整，但极端高温仍然是最危险的自然灾害之一(2)，本世纪以来最致命的事件中有数万人死亡(3，4)。高温和湿度的附加影响超出了直接的健康后果，包括在一系列活动中个人表现的降低，以及大规模的经济影响(5-7)。在军事、运动和职业环境中，热湿效应已经促进了数十年的研究(8，9)。然而，从气候学和气象学的角度考虑湿球温度(TW)的时间较晚(10，11)。\n虽然一些热湿影响可以通过适应和行为适应来避免(12)，但在持续暴露的情况下，生存能力存在上限，即使在完美健康、完全不活动、完全遮荫、不穿衣服和无限制饮水的理想条件下也是如此(9，10)。正常的人体内部温度为36.8°±0.5°C，需要35°C左右的皮肤温度才能保持将热量从核心(10，13)向外引导的梯度。一旦空气(干球)温度(T)超过这一阈值，新陈代谢热量只能通过汗液潜冷释放，当TW超过约35°C时，这种冷却机制将完全失效。由于理想的生理和行为假设几乎从未得到满足，严重的死亡率和发病率影响通常发生在低得多的值上-例如，受2003年欧洲和2010年俄罗斯致命热浪影响的地区经历的TW值不超过28°C(图2)。S1)。到目前为止，文献中还没有TW超过35°C的观测报告，也很少有超过33°C的报告(9、11、14、15)。对生理极限的认识促使建模研究提出了一个问题，即什么时候可能会突破这个极限。结果表明，在一切照常的RCP8.5排放情景下，到21世纪第三季度(14-16年)，南亚和中东部分地区的TW可能经常超过35°C。\n在这里，我们使用来自HadISD(17，18)的有质量保证的台站观测和ERA-TIMAL(19，20)的高分辨率再分析数据，并与无线电探空仪和海洋观测(见补充材料)(21，22)进行核实，以计算TW基线值、地理模式和最近的趋势。在所有考虑的地区，由仪器和程序引起的台站数据的TW不确定度在0.5°C到1.0°C量级，这是正确解释结果的重要考虑因素。我们使用TW和海面温度(SST)观测作为未来TW预测的指导的方法提供了一条不同于以前的研究的证据，这些研究使用耦合或区域模型，而没有明确包括历史台站数据。\n我们对站数据的气候记录的调查显示，许多全球TW超过31°C和33°C，两个站已经报告了超过35°C的多个日最大TW值。这些条件接近或超过了延长的人类生理耐受性，大多只出现了1到2小时的持续时间(图3)。(S2)。它们集中在南亚、中东沿海和北美西南部沿海，非常接近极高的海温和强烈的大陆热，这些共同有利于极端湿热的发生(2，14)。在海岸线上，中午和下午异常的陆上低空风对海洋的影响是明显的，这些风的变化可以导致干旱和半干旱沿海地区露点温度(Td)的迅速上升。中三至中九)。区域上连贯的观测证据支持这些强烈的值：波斯湾海岸线上至少有50%的数据可用性超过1\n虽然我们对气象站的分析表明，TW已被报告为在有限区域内短期内超过35°C，但这还没有出现在再分析数据所代表的区域尺度上，这也是以前研究(14，15)中考虑的未来TW极端的模型预测的大致尺度。为了增加我们的测站结果与这些模型预测的可比性，我们实施了广义极值(GEV)分析，以估计从前工业化时期到TW的全球变暖量，在全球最热的ERA-临时网格单元，目前都位于波斯湾地区(图4)。这个过程的完整细节在材料和方法中。简而言之，我们将一个非平稳的GEV模式拟合到经历最高TW值的网格单元，其中GEV位置参数是年度全球平均气温距平的函数。这使我们能够量化全球变暖需要多少年最高TW≥35°C才能在任何网格单元变成最多30年1次的事件。我们只对网格单元进行这一分析，其中非平稳的GeV模型比平稳的替代模型更适合于年最大时间序列(1979-2017)，这是显着的(P&lt；0.05)。然后，我们将出现温度(TOE)定义为全球变暖所需的量，直到TW≥35°C在ERA临时时空尺度上至多是30年一次的事件，使得任何网格单元的最低脚趾与TW=35°C第一次出现的情况近似，根据生理学研究(6，10，31)，TW=35°C的出现足够广泛和持续，足以造成严重或致命的健康影响(6，10，31)。\n我们的方法在波斯湾水域产生1.3°C的脚趾(90%置信区间，0.81°至1.73°C)，附近陆地网格单元的脚趾为2.3°C(1.4°至3.3°C)(图4)。调整这些数字，以适应ERA-TIMAL的强劲波斯湾差异，极端TW约为−3°C(图2)。S12)支持了来自观测站的结论，即最近的变暖增加了超过TW=35°C的温度，但在整个观测记录中，这个阈值很可能偶尔达到(图2)。海洋对这些数值的强烈影响在图1中也很明显。\n为了进一步评估我们的GEV外推的物理真实性，我们另外检查了观测到的年最大(月平均)海温。与海洋表面完全平衡的大气边界层将处于饱和状态，并具有与下伏SSTs相同的温度，这意味着，原则上，35°C是可以维持上方空气中TW临界35°C值的最低SST。在现实中，如果极端海温以上的气团停留时间太短，就不会实现平衡，如果大气的垂直剖面允许强烈的表面加热引发深层对流，这种情况就更有可能发生(10)。因此，目前的大规模SST及其趋势可能会为我们对极端TW的预测在物理上是否可信提供一些指导。正是在这种背景下，我们注意到波斯湾的月平均海温首次超过35摄氏度的门槛，达到35.2摄氏度(图5)。因此，我们对35°C的大尺度海洋TW≥35°C的GEV预测，在变暖小于1.5°C的情况下，似乎与相同尺度下的海温观测结果在物理上是一致的。通过一个独立的海洋观测数据库(见补充材料)(21)，波斯湾的点尺度、每小时海温和海温对台基≥35°C事件提供了类似的佐证，我们在该数据库中发现，自1979年以来，海温每年都超过35°C，2017年7月至9月的观测值中约33%超过了这一门槛。2017年夏天，波斯湾水上TW≥35°C的报告也达到了峰值，占那里所有TW测量值的6%。\n我们在这里采用的基于站的方法和在以前的研究(14-16)中采用的基于模型的方法代表了不同的方法来获得关于全球TW极端的成因和特征的有价值的观点。测站数据的主要优势是能够精确捕捉当地情况，但即使是最好的测站数据也有局限性、不确定性和潜在的未观测到的湿度偏差(例如，由于观测程序、仪器类型或选址)，以及高度不完整的空间覆盖(见补充材料中的讨论)(32，33)。相比之下，再分析产品和高分辨率区域模式满足了时空连续性和一致性的需要，并允许分析额外的变量，但往往低估了极端情况(34)。\n在这项研究中，我们证明，努力更好地理解极端热带气旋将受益于进一步仔细检查，并改进标准化和集成，以缓解模式的缺陷-特别是在沿海地区\n..", "note_en": "Humans’ ability to efficiently shed heat has enabled us to range over every continent, but a wet-bulb temperature (TW) of 35°C marks our upper physiological limit, and much lower values have serious health and productivity impacts. Climate models project the first 35°C TW occurrences by the mid-21st century. However, a comprehensive evaluation of weather station data shows that some coastal subtropical locations have already reported a TW of 35°C and that extreme humid heat overall has more than doubled in frequency since 1979. Recent exceedances of 35°C in global maximum sea surface temperature provide further support for the validity of these dangerously high TW values. We find the most extreme humid heat is highly localized in both space and time and is correspondingly substantially underestimated in reanalysis products. Our findings thus underscore the serious challenge posed by humid heat that is more intense than previously reported and increasingly severe.\n Humans’ bipedal locomotion, naked skin, and sweat glands are constituents of a sophisticated cooling system (  1). Despite these thermoregulatory adaptations, extreme heat remains one of the most dangerous natural hazards (  2), with tens of thousands of fatalities in the deadliest events so far this century (  3,   4). The additive impacts of heat and humidity extend beyond direct health outcomes to include reduced individual performance across a range of activities, as well as large-scale economic impacts (  5–  7). Heat-humidity effects have prompted decades of study in military, athletic, and occupational contexts (  8,   9). However, consideration of wet-bulb temperature (TW) from the perspectives of climatology and meteorology began more recently (  10,   11).\n While some heat-humidity impacts can be avoided through acclimation and behavioral adaptation (  12), there exists an upper limit for survivability under sustained exposure, even with idealized conditions of perfect health, total inactivity, full shade, absence of clothing, and unlimited drinking water (  9,   10). A normal internal human body temperature of 36.8° ± 0.5°C requires skin temperatures of around 35°C to maintain a gradient directing heat outward from the core (  10,   13). Once the air (dry-bulb) temperature (T) rises above this threshold, metabolic heat can only be shed via sweat-based latent cooling, and at TW exceeding about 35°C, this cooling mechanism loses its effectiveness altogether. Because the ideal physiological and behavioral assumptions are almost never met, severe mortality and morbidity impacts typically occur at much lower values—for example, regions affected by the deadly 2003 European and 2010 Russian heat waves experienced TW values no greater than 28°C (fig. S1). In the literature to date, there have been no observational reports of TW exceeding 35°C and few reports exceeding 33°C (  9,   11,   14,   15). The awareness of a physiological limit has prompted modeling studies to ask how soon it may be crossed. Results suggest that, under the business-as-usual RCP8.5 emissions scenario, TW could regularly exceed 35°C in parts of South Asia and the Middle East by the third quarter of the 21st century (  14–  16).\n Here, we use quality-assured station observations from HadISD (  17,   18) and high-resolution reanalysis data from ERA-Interim (  19,   20), verified against radiosondes and marine observations (see the Supplementary Materials) (  21,   22), to compute TW baseline values, geographic patterns, and recent trends. Uncertainties in TW from station data due to instrumentation and procedures are on the order of 0.5° to 1.0°C in all regions considered, an important consideration for proper interpretation of the results. Our approach of using TW and sea surface temperature (SST) observations as guidance for future TW projections offers a different line of evidence from previous research that used coupled or regional models without explicitly including historical station data.\n Our survey of the climate record from station data reveals many global TW exceedances of 31° and 33°C and two stations that have already reported multiple daily maximum TW values above 35°C. These conditions, nearing or beyond prolonged human physiological tolerance, have mostly occurred only for 1- to 2-hours’ duration (fig. S2). They are concentrated in South Asia, the coastal Middle East, and coastal southwest North America, in close proximity to extraordinarily high SSTs and intense continental heat that together favor the occurrence of extreme humid heat (  2,   14). Along coastlines, the marine influence is manifest via anomalous onshore low-level winds during midday and afternoon hours, and these wind shifts can cause rapid dew point temperature (Td) increases in arid and semiarid coastal areas (figs. S3 to S9). Regionally coherent observational evidence supports these intense values: Of the stations along the Persian Gulf coastline with at least 50% data availability over 1979 to 2017, all have a historical 99.9th percentile of TW (the value exceeded roughly 14 times in 39 years) above 31°C ( Fig. 1; see fig. S1 for the all-time maximum). In the ERA-Interim reanalysis, the highest values are similarly located over the Persian Gulf and immediately adjacent land areas, as well as parts of the Indus River Valley (fig. S10). The spatiotemporal averaging inherent in reanalysis products causes ERA-Interim to be unable to represent the short durations and small areas of critical heat stress, causing its extreme TW values to be substantially lower than those of weather stations across the tropics and subtropics (fig. S11). In the Persian Gulf and adjacent Gulf of Oman, these differences are consistently in the range of −2° to −4°C (fig. S12). Larger bias but similar consistency is present along the eastern shore of the Red Sea, presenting a basis for future studies examining the reasons for this behavior, as well as further comparisons between station and reanalysis data.\n  Other &gt;31°C hotspots in the weather station record emerge through surveying the globally highest 99.9th TW percentiles: eastern coastal India, Pakistan and northwestern India, and the shores of the Red Sea, Gulf of California, and southern Gulf of Mexico ( Fig. 1). All are situated in the subtropics, along coastlines (typically of a semienclosed gulf or bay of shallow depth, limiting ocean circulation and promoting high SSTs), and in proximity to sources of continental heat, which together with the maritime air comprise the necessary combination for the most exceptional TW (  11). That subtropical coastlines are hotspots for heat stress has been noted previously (  23,   24); our analysis makes clear the broad geographic scope but also the large intraregional variations ( Fig. 1). Western South Asia stands as the main exception to this coastline rule, likely due to the efficient inland transport of humid air by the summer monsoon together with large-scale irrigation (  15,   25). Tropical forest and oceanic areas generally experience TW no higher than 31° to 32°C, perhaps a consequence of the high evapotranspiration potential and cloud cover, along with the greater instability of the tropical atmosphere. However, more research is needed on the thermodynamic mechanisms that prevent these areas from attaining higher values.\n Steep and statistically significant upward trends in extreme TW frequency (exceedances of 27°, 29°, 31°, and 33°C) and magnitude are present across weather stations globally ( Fig. 2). Each frequency trend represents more than a doubling of occurrences of the corresponding threshold between 1979 and 2017. Trends in ERA-Interim are strongly correlated with those of HadISD but are smaller for the highest values ( Fig. 2), consistent with ERA-Interim’s underestimation of extreme TW that is largest for the most extreme conditions (fig. S11). We also find a sharp peak in the number of global TW = 27°C and TW = 29°C extremes during the strong El Niño events of 1998 and 2016. Linearly detrending this global-TW-extremes time series reveals that the El Niño–Southern Oscillation (ENSO) correlation is largest for TW values that are high but not unusual (~27° to 28°C) across the tropics and subtropics (fig. S13). Further work is necessary to test to what extent this relationship may be related to the effect of ENSO on hydrological extremes at the global scale, on tropospheric-mean temperatures, or on SSTs in particular basins, and the implications of these effects for TW predictability (  26,   27). Overall, TW extremes in the tropics largely correspond on an interannual basis to mean TW (fig. S14), indicating that climate forcings and modes of internal variability resulting in mean temperature shifts can be expected to modulate tropical TW extremes. This is the case in the subtropics as well, although to a somewhat lesser extent.\n  We also observe modulation on a seasonal scale, by considering as an illustrative example the South Asian monsoon region. There, the timing of peak TW varies with the advance of the summer monsoon (  15). Splitting South Asia into “early monsoon” and “late monsoon” subregions, we find that the number of TW extremes is largest around the time of the local climatological monsoon onset date ( Fig. 3). Although equivalent extreme values of TW are possible before, during, and after the monsoon rains in any given year, they are of a different character; especially in the northern and western parts of the subcontinent, they become continually moister and have lower dry-bulb temperatures as summer progresses. Across the globe, such temperature and humidity variations occur within a well-defined bivariate space (fig. S15). That these variations are systematically associated with the summer monsoon in South Asia emphasizes the important role of moisture, and of weather systems on synoptic to subseasonal time scales, in controlling extreme TW (  15,   28). Our findings underscore the diversity of conditions that can lead to extreme humid heat in the same location at different times, suggesting that impacts adaptation strategies may benefit from taking this recognition into account. Such intraseasonal variability in TW also matters for physiological acclimation, which requires several-day time scales to develop (  29); TW character is especially relevant when considering effects on human systems that vary in their sensitivity to humidity and temperature—for example, thermoregulation and energy demand for artificial cooling are strongly affected by TW, whereas the materials that make up the built environment are principally affected by temperature alone (  13,   30).\n  While our analysis of weather stations indicates that TW has already been reported as having exceeded 35°C in limited areas for short periods, this has not yet occurred at the regional scale represented by reanalysis data, which is also the approximate scale of model projections of future TW extremes considered in previous studies (  14,   15). To increase the comparability of our station findings with these model projections, we implement a generalized extreme value (GEV) analysis to estimate the amount of global warming from the preindustrial period until TW will regularly exceed 35°C at the global hottest ERA-Interim grid cells, currently all located in the Persian Gulf area ( Fig. 4). Complete details of this procedure are in Materials and Methods. In brief, we fit a nonstationary GEV model to the grid cells experiencing the highest TW values, with the GEV location parameter a function of the annual global-mean air-temperature anomaly. This enables us to quantify how much global warming is required for annual maximum TW ≥ 35°C to become at most a 1-in-30-year event at any grid cell. We conduct this analysis solely for grid cells where the nonstationary GEV model is a significantly ( P &lt; 0.05) better fit to the annual maximum time series (1979–2017) than a stationary alternative. We then define the temperature of emergence (ToE) as the amount of global warming required until TW ≥35°C is at most a 1-in-30-year event at the ERA-Interim spatiotemporal scale, such that the lowest ToE at any grid cell approximates the first occurrences of TW = 35°C that are widespread and sustained enough to cause serious or fatal health impacts, as estimated from physiological studies (  6,   10,   31).\n  Our method yields a ToE of 1.3°C over the waters of the Persian Gulf (90% confidence interval, 0.81° to 1.73°C) and of 2.3°C for nearby land grid cells (1.4° to 3.3°C) ( Fig. 4). Adjusting these numbers for ERA-Interim’s robust Persian Gulf differences of approximately −3°C for extreme TW (fig. S12) supports the conclusion from the station observations that recent warming has increased exceedances of TW = 35°C, but that this threshold has most likely been achieved on occasion throughout the observational record ( Fig. 2). The strong marine influence on these values is also apparent in  Fig. 1.\n To further assess the physical realism of our GEV extrapolation, we additionally examine observed annual maximum (monthly mean) SSTs. An atmospheric boundary layer fully equilibrated with the ocean surface would be at saturation and have the same temperature as the underlying SSTs, meaning that, in principle, 35°C is the lowest SST that could sustain the critical 35°C value of TW in the air above. In reality, equilibrium will not be achieved if air-mass residence times over extreme SSTs are too short, which is more likely if the vertical profile of the atmosphere allows strong surface heating to trigger deep convection (  10). Current large-scale SSTs and their trends may therefore provide some guidance as to whether our projections of extreme TW are physically plausible. It is in this context that we note monthly mean SSTs exceeding the 35°C threshold for the first time, reaching 35.2°C in the Persian Gulf in 2017 ( Fig. 5). As a result, our GEV projection of large-scale maritime TW ≥ 35°C, for less than 1.5°C warming, appears physically consistent with SST observations at the same scale. Analogous corroboration of station-based TW ≥ 35°C events is provided by point scale, hourly SST and TW across the Persian Gulf from an independent database of marine observations (see the Supplementary Materials) (  21), in which we find SSTs have exceeded 35°C in every year since 1979, with ~33% of July to September 2017 observations above this threshold. During the summer of 2017, reports of Persian Gulf over-water TW ≥ 35°C also peaked at ~6% of all TW measurements there.\n The station-based approach that we take here and the model-based approach taken in previous studies (  14–  16) represent different methods for obtaining valuable perspective on the genesis and characteristics of global TW extremes. The primary strength of station data is its ability to precisely capture local conditions, but even the best-available station data have limitations, uncertainties, and potential unobserved humidity biases (for example, due to observational procedures, instrumentation type, or siting), as well as highly incomplete spatial coverage (see discussion in the Supplementary Materials) (  32,   33). In contrast, reanalysis products and high-resolution regional models satisfy the need for spatiotemporal continuity and consistency and allow analysis of additional variables, but often underestimate extremes (  34).\n In this study, we demonstrate that efforts to better understand extreme TW would benefit from further close examination, and improved standardization and integration, of station data to alleviate model shortcomings—especially along coasts where TW can vary markedly over small distances and where high-quality humidity data are therefore essential—but that station-based and physical modeling–based approaches are fundamentally complementary. Further research into the origins of extreme-TW biases in gridded products and continued advances in data assimilation would also help enable the development of a more unified approach drawing on all available sources of knowledge. For instance, it is important to understand the treatment of extreme values in reanalyses, and whether false-positive or false-negative rejections might be taking place, particularly as temperature and humidity distributions shift toward ever-higher values. Key multiscale TW processes necessitating closer comparison between observations and models include coastal upwelling, atmospheric convection, land-atmosphere interactions, and atmospheric variability linked to SSTs (  28)—for instance, at the hourly, 1- to 10-km scale. Detailed analyses of individual events could help illuminate the unfolding interactions of processes and provide additional investigative power, such as in tracing and forecasting the rapid increases in humidity, which tend to accompany TW extremes (fig. S5), and in assessing the role of topography and land use/land cover in creating apparent TW hotspots (fig. S4). Studies comparing biases and trends in TW and SSTs among reanalyses, models, and regions would be especially beneficial, as would investigation of the sensitivity of extreme-TW projections to historical variability, changes in forcing patterns, and statistical methodologies.\n Imminent severe humid heat provides incentive for a broad interdisciplinary research initiative to better characterize health impacts. Increased collection of high-resolution health data, international collaborations with public health experts and social scientists, and dedicated modeling projects would aid in answering questions about how vulnerable populations (such as the elderly, outdoor laborers, and those with preexisting health conditions) will be adversely affected as peak TW advances further into the extreme ranges we consider here. Of particular salience is the need to ascertain how acclimation to high-heat-stress conditions is diminished as the physiological survivability limit is approached. Such efforts may also help resolve the reasons for the paucity of reported mortality and morbidity impacts associated with observed near 35°C conditions (  11,   14).\n Our findings indicate that reported occurrences of extreme TW have increased rapidly at weather stations and in reanalysis data over the last four decades and that parts of the subtropics are very close to the 35°C survivability limit, which has likely already been reached over both sea and land. These trends highlight the magnitude of the changes that have taken place as a result of the global warming to date. At the spatial scale of reanalysis, we project that TW will regularly exceed 35°C at land grid points with less than 2.5°C of warming since preindustrial—a level that may be reached in the next several decades (  35). According to our weather station analysis, emphasizing land grid points underplays the true risks of extreme TW along coastlines, which tends to occur when marine air masses are advected even slightly onshore (  14). The southern Persian Gulf shoreline and northern South Asia are home to millions of people, situating them on the front lines of exposure to TW extremes at the edge of and outside the range of natural variability in which our physiology evolved (  36). The deadly heat events already experienced in recent decades are indicative of the continuing trend toward increasingly extreme humid heat, and our findings underline that their diverse, consequential, and growing impacts represent a major societal challenge for the coming decades.\n We use HadISD, version 2.0.1.2017f, which is produced by the Met Office Hadley Centre as a more rigorously quality-controlled version of the National Climatic Data Center Integrated Surface Database (ISD) (  17,   18). HadISD results from the implementation of additional data availability and quality control procedures to ISD, including checks on both temperature and Td, the two variables required for computing TW. Because of a\n......", "posttime": "2020-05-09 16:58:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,heat,tw", "title": "炎热和潮湿的出现使人类无法忍受", "title_en": "The emergence of heat and humidity too severe for human tolerance", "transed": 1, "url": "https://advances.sciencemag.org/content/6/19/eaaw1838", "via": "", "real_tags": ["人类", "heat", "tw"]}]