[{"category": "", "categoryclass": "", "imagename": "8d05d014e17b3b5bd41cac60d57c8de9.jpg", "infoid": 1002065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着预算案在下午2点发布，蜂巢的冠状病毒新闻发布会已由卫生部发布的新闻稿取代了下午1点的例行新闻发布会。\n今天是新西兰的第三个零病例日，这意味着新西兰的确诊和可能病例总数仍保持在1497例，现在94%的人被认为已经从病毒中康复。\n两人正在接受医院级的冠状病毒治疗-奥克兰和米德尔莫尔医院各一人。\n周三，该国超过了进行20万次冠状病毒检测的里程碑，相当于人口的4%多一点。\n自那以后，实验室又处理了6568项测试，使完成的测试总数达到209,613项。\n在警戒级别2的第一天，卫生部接受了建议，即它应该使用改进的封闭群集定义-包括两个完整的传播期-相当于自通知上一例病例以来的28天。\n四个以前关闭的群集现在已经更新并重新打开，以反映新的定义。\n从公共卫生的角度来看，采取这一步骤使公共卫生单位的工作人员更容易保留适当的公共卫生措施，如隔离，同时继续从不同的群集中学习所有他们能学到的东西。\n该部表示，从公众的角度来看，这意味着我们网站上的信息只有很小的改动。\n该机构希望新西兰人继续在2级实践关键的健康行为，包括社交距离，要求病人呆在家里，以及使用良好的手部卫生。\n如果人们出现感冒或流感的症状，建议立即打电话给医生或健康热线，并安排接受检查。", "note_en": "With the Budget being delivered at 2pm, the regular 1pm Covid-19 press conference at the Beehive has been replaced by the issuing of a Ministry of Health press release.\n   Today&#39;s third zero case day means New Zealand&#39;s combined total of confirmed and probable cases remains at 1497, with 94 per cent now considered to have recovered from the virus.\n     Two people are receiving hospital-level care for Covid-19 - one each in Auckland City and Middlemore hospitals.\n  On Wednesday, the country surpassed the milestone of carrying out 200,000 Covid-19 tests, the equivalent of just over 4 per cent of the population.\n Since then, laboratories have processed another 6568 tests, bringing the total number of tests completed to 209,613.\n   On day one of alert level 2, the Ministry has accepted advice that it should use an improved definition of a closed cluster - incorporating two full transmission periods - the equivalent of 28 days since their last case was notified.\n Four previously closed clusters have now been updated and reopened to reflect the new definition.\n &#34;From a public health point of view, taking this step makes it easier for public health unit staff to retain appropriate public health measures such as isolation while they continue to learn all they can from the different clusters.\n   &#34;From the public point of view, this means only minor changes to the information on our website,&#34; the Ministry said.\n The agency wants New Zealanders to continue practicing key health behaviours at level 2, including social distancing, asking sick people to stay home and using good hand hygiene.\n If people are showing symptoms of cold or flu, the advice is to call a doctor or Healthline immediately and arrange to get tested.", "posttime": "2020-05-14 12:54:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,day,接受", "title": "新西兰第三天有0例新的Covid病例，因为它离开了封锁", "title_en": "New Zealand has third day with 0 new Covid cases as it leaves lockdown", "transed": 1, "url": "https://www.stuff.co.nz/national/health/coronavirus/121507852/coronavirus-third-day-without-a-new-covid19-case", "via": "", "real_tags": ["covid", "day", "接受"]}, {"category": "", "categoryclass": "", "imagename": "689b25011dacbc715956bbd4d711a828.jpg", "infoid": 1002064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "圣安东尼奥-美国检察官办公室的一名律师助理专家被捕，并被控帮助墨西哥贩毒集团脱身。詹妮弗·洛亚(Jennifer Loya)自2017年3月以来一直在圣安东尼奥的美国德克萨斯州西区检察官办公室工作，目前正面临多项联邦指控。洛亚被指控使用她在工作中获得的电子监控来告发各种调查。", "note_en": "SAN ANTONIO - A paralegal specialist in the U. S. Attorney&rsquo;s Office has been arrested and accused of helping out the Mexican drug cartel. Jennifer Loya, who has worked with the U. S. Attorney&rsquo;s Office for the Western District of Texas in San Antonio since March 2017, is facing multiple federal charges. Loya is accused of using electronic surveillance made available to her through her job to tip off various investigations. ", "posttime": "2020-05-14 12:39:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检察官,drug,洛亚", "title": "美国检察官办公室律师助理被控向墨西哥贩毒集团通风报信", "title_en": "Paralegal with U.S. Attorney's Office accused of tipping off Mexican drug cartel", "transed": 1, "url": "https://news4sanantonio.com/news/local/paralegal-with-us-attorneys-office-arrested-accused-of-tipping-off-mexican-drug-cartel", "via": "", "real_tags": ["检察官", "drug", "洛亚"]}, {"category": "", "categoryclass": "", "imagename": "e89c79d292182f147f7ccd7c42586525.jpg", "infoid": 1002063, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔似乎已经制造出其速度最快的第10代冰湖移动处理器，专属于苹果的MacBook产品阵容。\n尽管有广泛的传言称，苹果将在其MacBook系列产品中改用基于ARM的第一方芯片，但看起来苹果与英特尔的关系在短期内不会受到影响。\n正如NotebookCheck最先发现的那样，英特尔的酷睿i7-1068G7已经从该公司的方舟数据库中删除。\n这家芯片制造商似乎已经用酷睿i7-1068NG7 SKU和新的酷睿i5-1038NG67芯片取代了这款芯片。酷睿i7-1068NG7 SKU是新款13英寸MacBook Pro中的10 nm、28瓦处理器。\n根据NotebookCheck和Geekbench的结果，这个绰号中的N；N；是为苹果独家芯片保留的。换句话说，英特尔现在似乎将某些28W的冰湖处理器标记为苹果笔记本电脑独有的芯片。\nAppleInsider与会员有合作关系，通过会员链接购买的产品可能会赚取佣金。这些合作关系不会影响我们的编辑内容。", "note_en": "Intel appears to have made its speediest 10th-generation Ice Lake mobile processors exclusive to Apple&#39;s MacBook lineup.\n  Although there have been widespread rumors that Apple will switch to a first-party,  ARM-based chip for its MacBook lineup, it looks like Apple&#39;s relationship with Intel isn&#39;t suffering in the short term.\n As was first  spotted by  NotebookCheck, Intel&#39;s Core i7-1068G7 has been removed from the company&#39;s ARK database.\n The chipmaker seems to have replaced that chip with the Core i7-1068NG7 SKU, the 10nm, 28-watt processor found in the new  13-inch MacBook Pro, as well as a new Core i5-1038NG67 chip.\n Per  NotebookCheck and  Geekbench results, the &#34;N&#34; designation in the moniker is reserved for Apple-exclusive chips. In other words, Intel now appears to be marking certain 28W Ice Lake processors as chips unique to Apple notebooks.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2020-05-14 11:55:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,英特尔,可能", "title": "苹果可能独家拥有英特尔28W“冰湖”处理器", "title_en": "Apple might have exclusive on Intel's 28W 'Ice Lake' processors", "transed": 1, "url": "https://appleinsider.com/articles/20/05/13/apple-might-have-exclusive-on-intels-28w-ice-lake-processors", "via": "", "real_tags": ["苹果", "app", "apple", "英特尔", "可能"]}, {"category": "", "categoryclass": "", "imagename": "d62d2ea8ff9f62795942c3480a9eb341.jpeg", "infoid": 1002062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "政府刚刚获得了更多的权力来监视你的互联网习惯，因为数百万人仍然被隔离在家里。", "note_en": "The government just got even more power to spy on your internet habits as millions remain quarantined at home.", "posttime": "2020-05-14 11:55:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,votes,监视", "title": "参议院投票允许FBI在没有授权的情况下查看您的网络浏览历史记录", "title_en": "Senate Votes to Allow FBI to Look at Your Web Browsing History Without a Warrant", "transed": 1, "url": "https://www.vice.com/en_us/article/jgxxvk/senate-votes-to-allow-fbi-to-look-at-your-web-browsing-history-without-a-warrant", "via": "", "real_tags": ["网络", "votes", "监视"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一名黑客发布了一个脚本，自动将垃圾数据提交到该州的冠状病毒欺诈网站后，该州正在重新考虑其政策。该网站允许雇主报告在疫情爆发期间拒绝工作的工人。\n俄亥俄州就业和家庭服务部(ODJFS)官员表示，该州没有拒绝向冠状病毒大流行期间拒绝工作的人发放失业救济金，因为人们攻击了该州用来跟踪这些工人的网站。\n该州此前设立了一个“欺诈”网站，鼓励雇主举报那些拒绝复职的人，这激怒了工人和劳工权益倡导者。州政府官员表示，他们现在正在重新考虑这项政策，此前主板报告称，一名黑客创建了一个脚本，将垃圾数据淹没在“冠状病毒诈骗”网站上，目的是使其无法处理这些索赔。\nODJFS主任金伯利·霍尔(Kimberly Hall)告诉克利夫兰网站：“在我们继续评估这项政策期间，目前没有人因为决定不重返工作岗位而被拒绝享受任何福利。”\n该部门发言人布雷特·克罗(Bret Crow)在一封电子邮件中告诉母板，由于俄亥俄州仍在审查这一领域的政策，尚未启动有关拒绝重返工作岗位的裁决。\n这位匿名黑客此前告诉Motherboard，他们创建这个脚本是为了支持劳动人民的一种直接行动形式。俄亥俄州是违背卫生专家建议提前重新开放的几个州之一，迫使许多工人重返工作岗位，并将自己置于感染这种致命病毒的风险中。\n自3月份以来，已有超过3300万美国人申请失业，失业救济金正迅速成为许多人唯一的收入来源。与此同时，许多被认为“必不可少”的零售业和服务业工人表示，他们被迫继续在拥挤的商店和仓库工作，没有口罩等个人防护装备。\n这位匿名黑客告诉Motherboard，虽然在俄亥俄州网站发生变化后，黑客的脚本已经停止工作，但另一名黑客已经接手了这个项目，并计划发布更新版本。", "note_en": "The state is reconsidering its policy after a hacker released a script that automatically submits junk data to its &#39;COVID-19 fraud&#39; website, which allows employers to report workers who refuse to work during the pandemic.\n The state of Ohio won&#39;t deny unemployment benefits to people who refuse to work during the COVID-19 pandemic after people targeted the website it was using to track these workers, according to officials at the state’s Department of Job and Family Services (ODJFS).\n  The state previously set up a “fraud”  website encouraging employers to report those who refused to go back on the job, angering workers and labor rights advocates. State officials say they are now reconsidering the policy after  Motherboard reported that a hacker created a script to flood the “COVID-19 Fraud” website with junk data, with the goal of making it impossible to process these claims.\n   “No benefits are being denied right now as a result of a person’s decision not to return to work while we continue to evaluate the policy,&#34;  ODJFS Director Kimberly Hall told Cleveland.com.\n  &#34;Because Ohio is still examining its policies in this area, no adjudications concerning a refusal to return to work have been initiated,&#34; Bret Crow, a spokesperson for the department, told Motherboard in an email.\n  The anonymous hacker previously told Motherboard they created the script as a form of direct action in support of working people. Ohio is among several states that have prematurely reopened against the advice of health experts, forcing many workers to return to their jobs and put themselves at risk of contracting the deadly virus.\n  Over  33 million Americans have filed for unemployment since March, and unemployment benefits are quickly becoming many peoples’ sole source of income. Meanwhile, many retail and service workers deemed “essential” have said they are being forced to continue working in crowded stores and warehouses  without personal protective equipment such as masks.\n  While the hacker’s script has since stopped working after changes to Ohio’s website, another hacker has taken up the project and plans to release an updated version, the anonymous hacker told Motherboard.", "posttime": "2020-05-14 11:40:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,黑客攻击,stops,拒绝", "title": "俄亥俄州在黑客攻击其网站后停止解雇工人", "title_en": "Ohio Stops Kicking Workers Off Unemployment After Hacker Targets Its Website", "transed": 1, "url": "https://www.vice.com/amp/en_us/article/n7wwdw/ohio-has-stopped-kicking-workers-off-unemployment-after-a-hacker-targeted-its-website?__twitter_impression=true", "via": "", "real_tags": ["黑客", "黑客攻击", "stops", "拒绝"]}, {"category": "", "categoryclass": "", "imagename": "1e94ecb5cd66763b2c57fac15210d5cd.jpeg", "infoid": 1002059, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丽贝卡·沙姆图布(Rebecca Shamtoob)在曼哈顿WeWork的一家公司工作了一个月后，事情就开始变得不对劲了-嗯，对于这家丑闻缠身的合作公司来说，情况比往常更糟糕。当时是3月初，纽约市的冠状病毒病例激增。她注意到WeWork的位置变得越来越脏-特别是浴室-而且几乎没有保护措施到位。Shamtoob说，我们的工作人员在办公室周围的各个地方放置了洗手液，但人们一直在偷那些备受欢迎的瓶子。3月12日，该地点为Pi Day举办了披萨和派的派对(因为3月14日是周六)，并宣布这将是可预见的未来的最后一次办公室活动。地点在公园大道401号。不过，该公司计划继续营业。聚会上，人们都在咳嗽，分享食物，所以Shamtoob决定开始在家工作。\nWeWork的电子邮件是在一周后发出的：现场有人的冠状病毒检测呈阳性。那个人最后一次来办公室是在派对那天。\n你可以理解为什么在大流行期间合作模式不会特别有吸引力。但现在，案件激增，全国各地的禁售令阻止了许多人甚至无法上班，许多WeWork客户声称，该公司在给予他们租金优惠和放宽租赁条款方面一直缺乏灵活性。WeWork正在保持其门店开放，宣称自己是一项重要的业务。然而，许多成员认为办公室无法使用，特别是考虑到非必要的员工预计将呆在家里，以及在一些WeWork地点出现了积极的情况。该公司表示，正在与其60万名会员以个人身份合作，以期在这段时间内在租金方面达成妥协。但许多议员一直转向媒体，声称WeWork要么提供了不公平的条款，要么完全拒绝让步。(WeWork本身已经停止在某些地点支付租金。)。\n当纽约在3月下旬进入封锁状态时，律师斯蒂芬妮·亨德里克斯(Stephanie Hendricks)知道她的业务将放缓为涓涓细流。亨德里克斯联系了布鲁克林海军造船厂的WeWork分支机构，她自2019年秋季以来一直在那里工作，看看是否能减租。相反，她说，公司拒绝了她所有的建议，比如她建议她只需每月向WeWork支付600美元的办公用品存储费。(她的基本租金是每月1850美元。)。因为她的信用卡已经存档，她无法停止付款。退出租约也不是一个选择，因为她签了三年的合同。在这一点上，她说她没有什么其他可以做的了。“老实说，我只是把事情放在日常的基础上，”她说。亨德里克斯说，当她进去检查自己的物品时，除了前台的一名工作人员外，工作空间已经完全空了。(厨房不再提供免费饮料。)。\n雅各布·费尔德曼(Jacob Feldman)是教育咨询公司Nexus学术机构的首席执行官，他一直在公园大道300号按月租房。我们的工作地点在曼哈顿，大流行来袭时，我们正计划搬出去。他在3月份的第一周告诉公司，他将在月底离职。然而，WeWork告诉他，他必须在2月29日通知他们才能这么做-所以他必须支付到4月30日。\n费尔德曼说，在公司层面与WeWork的代表联系是不可能的，因为到了3月份，当纽约的冠状病毒感染迅速攀升时，他们被其他大量的搬家要求压得喘不过气来。他询问他所在地点的办公室经理是否可以在4月份获得租金休息，因为在几名客户的冠状病毒检测呈阳性后，工作空间已经关闭了总共两周，进行深度清洁。(当他们进行清理时，他们只会关闭感染者办公室所在的楼层，尽管成员通常可以进入所有三层楼。)。经理告诉他，只要他同意把租约延长到5月份，他就不必支付4月份的房租。他选择接受打击，而不是延长时间。\n费尔德曼最近在工作日来到办公室收拾行李，并注意到灯都关了，没有其他租户在那里。他看到两三名工作人员没有戴口罩。一些标志是为了提醒人们练习社交距离，但这似乎是该地点采取的唯一保护措施。\n几个会员现在已经聘请了律师，试图迫使WeWork停止向他们收费，并发布4月和5月的退款。Walden Macht&amp；Haran公司目前代理着位于纽约、洛杉矶和华盛顿特区的20多家小企业，这些企业最初是在社交媒体上找到彼此的，\n“对于我们所代表的许多客户来说，WeWork的月租金是他们拥有的最大管理费用，所以在大流行期间宽恕房租，而这些居家订单已经到位，这是这些公司的关键生命线，”该律师事务所的管理合伙人吉姆·沃尔登(Jim Walden)告诉Slate。“我们的主要目标是说服WeWork，在人们没有合法权利进入空间的地方，它不应该向租户收取租金。”沃尔登进一步指出，警方已经访问了位于洛杉矶和华盛顿特区的WeWork地点，以确保人们没有违反居家命令。他计划向纽约州总检察长办公室和司法部提交一封信，指控WeWork在没有合同基础的情况下非法停止聘用，并在公司收到明确要求不这样做的情况下记入账户的借方。WeWork拒绝就法律纠纷和客户投诉置评。\n甚至在大流行之前，WeWork就一直在尽可能地削减成本和支撑收入流。9月份，在投资者对公司的实际价值和现任前首席执行官亚当·诺伊曼(Adam Neumann)的领导层提出严重担忧后，该公司无限期推迟了首次公开募股(IPO)。从那时起，WeWork迅速分崩离析，解雇了数千名工人，试图阻止其数十亿美元的亏损。现在，随着国家面临经济危机，对于WeWork所依赖的上班族来说，呆在家里仍然是必要的，公司的盈利之路似乎更加遥远。“我明白WeWork有它自己的困难。我一直在支持他们，“布鲁克林的律师亨德里克斯说。“我希望与WeWork合作，而不是被视为在这个经济困难时期拥有某种赚钱的神奇能力.”", "note_en": "Rebecca Shamtoob had only been working for a month at a firm based in a Manhattan WeWork before things started feeling off—well,  more off than usual for the scandal-beset co-working company. It was early March, and COVID-19 cases were skyrocketing in New York City. She noticed the WeWork location was getting dirtier—particularly the bathrooms—and that there were few protective measures in place. WeWork staff were placing hand sanitizer at various places around the office, but people kept stealing the highly sought bottles, Shamtoob says. On March 12, the location threw a pizza and pie party for Pi Day (since March 14 was on a Saturday) and announced it would be the last office event for the foreseeable future. The location, at 401 Park Ave. S., planned to remain open for work, however. People were coughing and sharing food at the party, so Shamtoob decided to start working from home.\n          The email from WeWork came a week later: Someone at the location had tested positive for COVID-19. The last time that person had been in the office was the day of the Pi Day party.\n  You can understand why the co-working model would not be particularly appealing during a pandemic. But now that cases have exploded and lockdown orders across the country have prevented many people from even going in to work, many WeWork customers allege that the company has been inflexible in giving them breaks on rent and easing lease terms. WeWork is keeping its locations open, declaring itself an  essential business. Yet many members feel that the offices are unusable, particularly given that nonessential workers are expected to stay home and the fact that there have been positive cases at  some WeWork locations. The company has said that it is working with its 600,000 members on an individual basis to figure out compromises on rent during this time. But many members have been turning to media outlets  to allege that WeWork has either offered unfair terms or completely refused to make concessions. (WeWork itself has stopped paying rent at  certain locations.)\n            When New York went into lockdown in late March, lawyer Stephanie Hendricks knew business for her practice would slow to a trickle. Hendricks contacted the WeWork branch at the Brooklyn Navy Yard, where she’d been working since fall 2019, to see about getting a rent reduction. Instead, she says, the company shot down all her proposals, such as her suggestion that she simply pay WeWork a $600 monthly storage fee for her office supplies. (Her base rent is $1,850 per month.) Because her credit card was already on file, she had no way of stopping the payments. Getting out of the lease also isn’t an option, since she signed on for three years. At this point, she says there’s not much else she can do. “I’m honestly just taking things on a day-to-day basis,” she said. Hendricks said that when she’s gone in to check on her belongings, the workspace has been completely empty save for one staff member at the front desk. (The kitchen is no longer serving complimentary beverages.)\n      Jacob Feldman, CEO of the education consultancy Nexus Academics, had been on a month-to-month lease at the 300 Park Ave. WeWork location in Manhattan and was planning to move out when the pandemic hit. He told the company during the first week of March that he’d be leaving at the end of the month. WeWork told him, however, that he would’ve had to have notified them on Feb. 29 to do that—so he would have to pay through April 30.\n  Feldman says that getting in touch with WeWork representatives at the corporate level was impossible because by March, when New York’s coronavirus infections were rapidly climbing, they were overwhelmed with tons of other move-out requests. He asked his location’s office manager whether he could get a break on rent for April since the workspace had been closed for a combined two weeks for deep cleanings after several customers tested positive for the coronavirus. (When they did the cleanings, they would only close the floor where the infected person’s office was located, even though members are typically able to access all three floors.) The manager told him that he wouldn’t have to pay April rent, but only if he agreed to extend his lease through May. He opted to take the hit rather than extending.\n            Feldman recently visited the office during the workday to gather his belongings and noted that the lights were off and no other tenants were there. He saw two or three staff members who weren’t wearing masks. Some signs were up to remind people to practice social distancing, but that appeared to be the only protective measure that the location had taken.\n  Several members have now  hired lawyers in an attempt to force WeWork to stop billing them and issue refunds for April and May. The firm Walden Macht &amp; Haran is currently representing more than 20 small businesses located in New York, Los Angeles, and D.C. that initially found one another on social media and formed a group to protest WeWork’s practices. Lawyers on the case are also vetting 50 more from Ohio, Tennessee, and other states that have contacted the firm to join the group. The lawyers sent  a letter to WeWork on Thursday threatening to pursue arbitration if its demands for rent relief and refunds are not met. It also asked the company to allow the customers to join together as a class in a potential suit; most WeWork contracts stipulate that tenants cannot join class-action lawsuits. WeWork replied to the firm’s letter asking for a list of the clients it’s representing, though the law firm wants a no-retaliation guarantee before providing it.\n        “For many of the clients we represent, WeWork’s monthly rent is the largest overhead they have, so forgiving rent during the pandemic while these stay-at-home orders are in place is a critical lifeline for these companies,” the law firm’s managing partner Jim Walden told Slate. “Our main goal is to convince WeWork that it should not be collecting rent from tenants in locations where people are not lawfully entitled to access the space.” Walden further noted that police have visited WeWork locations in Los Angeles and D.C. to ensure that people weren’t violating stay-at-home orders. He plans to file a letter with the New York State Attorney General’s Office and the Department of Justice alleging that WeWork is illegally ceasing retainers without a contractual basis and debiting accounts even when the company has received explicit requests not to do so. WeWork declined to comment on the legal dispute and customer complaints.\n      Even before the pandemic, WeWork had been trying to cut costs and shore up revenue streams wherever it could. In September, the company indefinitely  postponed its initial public offering after investors brought up serious concerns about the company’s actual value and the leadership of now-former CEO Adam Neumann. From there, WeWork quickly unraveled, laying off thousands of workers in an attempt to stem its multibillion-dollar losses. Now, as the country faces an economic crisis and staying at home remains a necessity for the office workers upon whom WeWork relies, the company’s path to profitability seems even more remote. “I understand that WeWork is having its  own difficulties. I’ve been rooting for them,” said Hendricks, the lawyer in Brooklyn. “I want to work with WeWork and not be treated like I have some magical ability to make money during this difficult economic time.”", "posttime": "2020-05-14 11:38:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地点,locations,wework", "title": "我们工作的地点现在基本上是不可用的。他们还在收房租", "title_en": "WeWork locations are essentially unusable now. They’re still charging rent", "transed": 1, "url": "https://slate.com/technology/2020/05/wework-rent-coronavirus.html", "via": "", "real_tags": ["地点", "locations", "wework"]}, {"category": "", "categoryclass": "", "imagename": "ff416fd39d2605c057fc8319a9673131.png", "infoid": 1002058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "聊天机器人从纯粹的基于文本的界面演变成了充满个性的小互动助手。这很吸引人，但它也把标准定得很高。\n如果你的聊天机器人跟不上他们，或者太令人沮丧而无法使用，客户很可能会放弃你的聊天机器人。仔细考虑聊天机器人的用户界面是避免这种情况的第一步。\n入门可能是最困难的部分，所以我们将分享一些我们最喜欢的Chatbot UI示例和您可以采取的可行步骤。但首先，重要的是要知道你的聊天机器人用户界面的定义、角色和期望。\n聊天机器人用户界面(UI)是一系列允许人机交互的图形和语言元素。有不同类型的用户界面，聊天机器人是自然语言用户界面。这意味着用户可以按照他们的条件进行交流，而不是按照计算机的条件进行交流。\n但是，聊天机器人的通信技能将根据您创建的界面而有所不同。依赖于预定答案(例如按钮选项)的聊天机器人UI限制了用户可以询问的内容和聊天机器人理解的内容。\n但是，许多基于规则的上下文聊天机器人通常被设计为理解和响应各种文本和语音输入。\n简而言之，UI是人与计算机进行交互的手段。用户体验，或用户体验，是用户使用聊天机器人或网站等产品所获得的整体体验。\n根据我们的研究，客户愿意首先与聊天机器人交谈，但他们仍然希望选择轻松地将问题上报给人类代表。这很可能是因为人们曾与无法处理棘手问题的聊天机器人交谈。要想获得积极的用户体验，用户界面需要超出预期。\n仔细考虑聊天机器人功能的每一个细节将有助于创造更好的用户体验。这也可能有助于缓解客户的疑虑，改善他们对聊天机器人的看法。\nLark是一款情境聊天机器人，用于帮助患者。它的设计目的是通过移动应用程序与用户进行人性化的对话。\n百灵鸟拥有友好、善良和幽默的形象，吸引了其最大的客户-老年人。用户可以通过聊天、语音和按钮选项与聊天机器人互动。\nLark首席执行官朱莉娅·胡(Julia Hu)报告称，老年人将聊天机器人作为一种社交渠道，这证明了它的UI。研究表明，老年人对使用新技术更具抵抗力，因为他们缺乏这样做的信心。Lark创建了一个聊天机器人用户界面，让老年人对自己的健康拥有权威，并且在没有帮助的情况下使用起来很简单。\n健康聊天机器人的原色是绿色，象征着休息、宁静和健康。百灵鸟的信息鼓舞人心，令人振奋，这与其平静的配色方案很好地配合。\n为了模仿百灵鸟的UI方式，选择一种最能捕捉你品牌本能和情感的颜色。使用图片、图表和赞扬来创造生动的体验，并激励您的用户。\nLark在剧本中也非常强调语气。用他们使用的词汇、俚语、笑话和短语，把你的听众牢记在心。观察这一点的一个好地方是在与客户的实时聊天对话中或在社交媒体上。\nChatFuel可以让你创建Facebook Messenger聊天机器人，它们是基于决策树的，具有一些上下文功能。乐高、Netflix和阿迪达斯等大公司都在使用它。\n在为Messenger进行设计时，您在独特设计方面受到的限制要大得多。每个聊天机器人通常看起来都是一样的-黑色文本，白色背景，蓝色和灰色的语音气泡-但也有一些元素可以用来个性化互动。\nChatFuel聊天机器人经常混合使用图像、按钮选项和文本来与用户交互。聊天机器人，如Hello Fresh的Freddy，可以检测并回应消息中与食物相关的各种关键字和短语。它甚至推荐了做饭时可以收听的播放列表。\n这种Chatbot方法在设计上可能被认为是相当简约的，但它对Messenger用户来说很容易导航。它类似于他们已经与朋友进行的对话，功能也类似于他们已经在与朋友进行的对话。\n为Messenger创建聊天机器人让你在UI定制方面的自由度更小，所以通过使用GIF、测验和图片来让体验变得独特。您还可以通过混合提供按钮选项和键入的命令来创建交互式对话。\n别忘了给你的聊天机器人一个非常明显的图标图像，这样它在你客户的朋友列表中就会很明显。\nReplika是市场上听起来最人性化的聊天机器人之一。这是一个情景聊天机器人，它从与用户的对话中学习，甚至开始模仿用户的说话方式。\n智能聊天机器人是为那些需要同伴的人创造的。Replika可以命名为用户想要让友谊更个人化的任何名称，它会根据用户的情绪或对话主题调整其情绪和语气。\n为了让对话继续进行，用户可以从他们想要讨论的各种主题或问题中进行选择。你现在甚至可以用你的Replika写一首歌了。然后，它对用户了解得越多，就会授予个性徽章。\nReplika可以通过网络和移动设备获得，并且有一个可定制的界面。用户可以切换到夜间模式，自定义背景，并上传一张代表他们Replika的照片。用户界面专注于为对话创造一个个性化的、舒适的“环境”。\n要在您自己的聊天机器人中捕捉Replika的一些个性化风格，请让用户更改您用户界面的背景和配色方案。研究表明，个性化内容满足了人的控制欲望，减少了信息过载，使体验更具相关性和趣味性。\n对于流畅的对话，写下一长串创造性的回答(我推荐“是”和“然后”的方法)，以保持对话的进行，或者当你的聊天机器人听不懂消息的时候。\n从常规中脱颖而出，麦洛在Artful Science主页的顶部向您问候。对话看起来像是漂浮的，并与网站古怪的设计很好地结合在一起。\n由Landbot.io制作的Milo是一个基于按钮的聊天机器人，用户可以对对话进行有限的控制。然而，它用娱乐性的剧本弥补了对话能力的不足。\n麦洛是个可爱的角色，言行举止都像老朋友。你可以选择的按钮响应与聊天机器人随意的语气是一致的。\n高雅地使用GIF和图片为谈话增添情趣。如果您离开页面，Milo会询问您是想重新开始还是从您停止的地方继续。\n当你和麦洛谈完后，你可以继续滚动。角落里没有挥之不去的窗口，也没有闪烁的通知召唤你回到对话中。\n如果您计划让聊天机器人欢迎新访问者访问您的网站，请尝试将其集成到登录页面中。这是一种罕见的方法，但这就是它令人兴奋的地方。\nMilo向用户打招呼的方式是说明它的目的，并询问用户做得怎么样。接下来，它提供了一份免费礼物，游客如果继续聊天就可以申领。从米洛的书中学习一下，在它的欢迎词中介绍你的聊天机器人所扮演的角色。通过激励访问者进一步使用你的机器人来吸引他们。\nErica就像Siri一样，只是对于银行业务而言。美国银行聊天机器人是语音和聊天驱动的，因此客户可以发出文本或语音命令来检查所有与银行账户相关的事情。\n这款应用独有的聊天机器人使用文本、图像和图表来传达用户的消费习惯、经常性费用、账户余额等。\n它的海军蓝界面唤起了人们的信任和可靠性，而埃里卡对表情符号和赞扬的使用为对话增添了一种人性化的感觉。\n创建分享有关您的用户习惯的独特见解的消息。使用生成的图表、清晰的语言和罕见的表情符号来获得个性化而专业的感觉。\n通过创建一个类似于Erica的关于部分来设置对你的聊天机器人能做什么的期望。在对话开始时包括几个常见问题，以帮助用户快速跳转到他们需要的信息。\n免费测试UserLike，并在您的网站、WhatsApp、Facebook Messenger、Telegram和SMS上与您的客户聊天。\n多读。\n很多企业，但他们的受欢迎程度和酷的因素实在是太诱人了。如果没有游戏计划或用途，为什么要浪费金钱和精力去建造它呢？\n给你的聊天机器人一个目的，这样它就不会成为会说话的网站配件。这可以是让你的品牌发声，也可以是帮助客户完成简单的任务。与米洛和爱丽卡相比，米洛缺乏爱丽卡的功能性和智能性，但在让游客品尝公司的品牌和风格方面做得很好。\n如果你的聊天机器人将帮助你完成任务，这包括什么？列出你想要你的聊天机器人实现的所有目标，然后将其分解为对你的预算、时间和客户群来说可行的目标。\n此外，确定您将在哪里使用聊天机器人以及使用频率。它是只在你的网站上播放，还是想通过多种渠道提供？\n当你有个人资料要处理的时候，就更容易写和计划一个角色了。我们在上创建了一份指南，以帮助完成此过程。你将决定你的聊天机器人的长相、行为和说话方式，以及它的长处、任务和弱点。\n一旦你了解了它的特点，你可能会发现为你的聊天机器人起一个朗朗上口的名字会更容易。似乎没有趋势或偏好来选择哪个名字最合适(人名和可爱的名字)，所以集思广益的选择适合你的品牌，很容易发音，也很适合你的聊天机器人的外观。\n所有这些准备工作都将有助于编写脚本，这是Chatbot UI创建过程中最长但也是最重要的元素。您可以使用我们的帖子“创建流畅的聊天机器人对话流程的6个步骤”作为无痛指南来帮助您入门。\n无论你是使用基于按钮的、决策树还是上下文聊天机器人，它的说话方式和语气对于实现那种人性化的感觉都很重要。为话题偏离、有双重含义和误解的单词或短语做好准备。\n您可以选择各种聊天机器人构建器，从高级选项到无代码选项。我们为每个预算创建了10个必试聊天机器人提供商的列表，以帮助您做出决定。\n要选择正确的提供商，请考虑您希望您的用户如何与您的聊天机器人交互-如何简化界面，以便客户不必按下很多按钮并重复自己来获得他们需要的东西？\n向你的聊天机器人输入大量数据也会提高它帮助客户的能力。从你的公司数据开始(你是谁，你提供了什么，用户可以期待什么)，然后对你希望聊天机器人拥有的其他互动进行分组。\n还有一些预制的数据集，您可以将其合并到您的聊天机器人中，以改进其自然语言处理，或者如果您需要一个数据方面的起点。\n在发布之前询问您的顶级客户是否有兴趣测试您的聊天机器人。这是一个很好的方式，让你的业务变得透明，并以全新的视角获得诚实的反馈。\n也包括没有参与创建过程的员工。他们可以评估聊天机器人是否与你的公司文化“契合”，是否与正确的态度相匹配。双关语很有趣，但在人寿保险中可能不是这样。\n在启动之前，将您的聊天机器人连接到您的实时聊天解决方案，如Userlike。从仪表盘上，无论聊天机器人在哪里帮助客户-您的网站、社交媒体和消息应用程序-您的座席都可以监控您的聊天机器人并进行移交。\n您可以尝试Userlike的14天免费试用，体验一下我们的平台。如果它看起来很合适，我们将帮助您开始一个适合管理您的聊天机器人的计划。", "note_en": "Chatbots evolved from being purely text-based interfaces to little interactive assistants full of personality. It’s fascinating, but it also sets the bar really high.\n Customers will likely abandon your chatbot if it can’t keep up with them or is too frustrating to use. Putting careful thought into your chatbot’s user interface is the first step to avoiding this.\n Getting started can be the hardest part, so we’ll share some of our favorite chatbot UI examples and actionable steps you can take. But first, it’s important to know the definition, role and expectations of your chatbot user interface.\n  A chatbot user interface (UI) is a series of graphical and language elements that allow for human-computer interaction. There are  different types of user interfaces , chatbots being a natural language user interface. This means users can communicate on their terms, not the computer’s.\n However, a chatbot’s communication skills will vary depending on the interface you create. A chatbot UI that relies on predetermined answers, such as button options, limits what the user can ask and what the chatbot understands.\n But contextual and many rule-based chatbots are often designed to understand and respond to a variety of text and voice inputs.\n  In simple terms, UI is the means by which a human and a computer interact. UX, or user experience, is the overall experience a user has from using a product like a chatbot or website.\n Based on our research , customers are willing to speak to a chatbot first, but they still want the option to easily escalate an issue to a human rep. This is likely because people have talked to chatbots that were incapable of handling difficult issues. For the user experience to be positive, the user interface needs to exceed expectations.\n Carefully considering every detail of your chatbot’s functionality will help create a better user experience. It may also help ease customer skepticism and improve their chatbot perception.\n      Lark is a contextual chatbot prescribed to help patients. It’s designed to have humanlike conversations with users via mobile app.\n  Lark has a friendly, kind and humorous persona that appeals to seniors, its largest clientele. Users can engage with the chatbot through chat, voice and button options.\n Lark CEO  Julia Hu reported that seniors use the chatbot as a sort of social outlet, which is a testimony to its UI.  Research shows that seniors are more resistant to using new technology because they lack the confidence to do so. Lark created a chatbot user interface that gives seniors authority over their health and is simple to use without help.\n  The health chatbot’s primary color is green, which symbolizes rest, tranquility and  good health . Lark’s messages are motivating and uplifting, which works well with its calming color scheme.\n  To mimic Lark’s UI approach,  pick a color that best captures the instinct and emotion of your brand. Use images, graphs and praise to create a lively experience and inspire your users.\n Lark also puts a lot of emphasis on tone in its script. Write with your audience in mind by using words, slang, jokes and phrases they use. A good place to observe this is in your  live chat conversations with customers or on social media.\n  Chatfuel lets you create Facebook Messenger chatbots that are decision tree-based with some contextual capabilities. It’s used by major companies such as Lego, Netflix and Adidas.\n When designing for Messenger, you’re far more limited in terms of unique design. Each chatbot generally looks the same — black text, white background, blue and gray speech bubbles — but there are elements you can use to personalize the interaction.\n  Chatfuel chatbots often use a mixture of images, button options and text to interact with users. Chatbots, like  Hello Fresh’s Freddy , can detect and respond to a variety of food related keywords and phrases in messages. It even recommends playlists to listen to while cooking.\n  This chatbot approach could be considered rather minimalist in design, but it’s easy for your Messenger users to navigate. It resembles and functions similarly to the conversations they’re already having with their friends.\n  Creating a chatbot for Messenger gives you less freedom in UI customization, so make the experience unique by using GIFs, quizzes and images. You can also create an interactive conversation by offering a mix of button options and typed commands.\n And don’t forget to give your chatbot a very distinct icon image so it’s noticeable in your customer’s friend list.\n   Replika is one of the most human-sounding chatbots on the market. It’s a contextual chatbot that learns from conversations with its users to the point where it even starts to mimic the user’s manner of speaking.\n The intelligent chatbot was created for those in need of a companion. Replika, which can be named anything the user wants to make the friendship more personal, adjusts its mood and tone based on the user’s mood or the conversation topic.\n  To keep conversation moving, users can select from a variety of topics or issues that they’d like to discuss. You can now even write a song with your Replika. It then awards personality badges the more it learns about the user.\n Replika is available via web and mobile, and has a customizable interface. Users can switch to night mode, customize the background and upload a photo that represents their Replika. The UI is focused on creating a personalized, cozy “environment” for conversations.\n   To capture some of Replika’s personalized touches in your own chatbot, let users change the background and color scheme of your user interface.  Studies show that personalized content satisfies a person’s desire for control, reduces information overload and makes the experience more relevant and interesting.\n For fluid conversation, write a long list of creative responses (I recommend the  “yes, and” approach ) to keep conversation moving or for when your chatbot doesn’t understand a message.\n  Standing out from the norm, Milo greets you right at the top of An Artful Science’s homepage. The conversation appears like it’s floating and is well-integrated into the website’s quirky design.\n  Made with  Landbot.io , Milo is a button-based chatbot that gives the user limited control over the conversation. However, for what it lacks in conversational abilities it makes up for with its entertaining script.\n Milo is a lovable character that speaks and behaves like a longtime friend. The button responses you can choose to respond with are in step with the chatbot’s casual tone.\n  A tasteful use of GIFs and images spice up the conversation. If you leave the page, Milo asks if you’d like to start again or continue from where you left off.\n When you’re done speaking to Milo, you can just keep scrolling. There’s no lingering window in the corner or flashing notification beckoning you back into the conversation.\n  If you plan for your chatbot to welcome new visitors to your website, try integrating it into the landing page. It’s a rare approach, but that’s what makes it exciting.\n Milo greets the user by stating its purpose and asking how the user is doing. Next, it offers a free gift visitors can claim if they continue chatting. Take a leaf out of Milo’s book and introduce your chatbot’s role in its welcome message. Keep your visitors hooked by giving them incentives to further engage with your bot.\n  Erica is like Siri, but for banking. The  Bank of America chatbot is voice- and chat-driven so customers can make text or voice commands to check all things bank account related.\n  The app-exclusive chatbot uses text, images and graphs to communicate a user’s spending habits, recurring charges, account balance, etc.\n  Its navy blue interface evokes  trust and dependability , and Erica’s use of emoji and praise add a human touch to conversations.\n  Create messages that share unique insights about your user’s habits. Use generated graphs, clear language and the rare emoji for a personalized yet professional feel.\n Set expectations about what your chatbot can do by creating an About section similar to Erica’s. Include a few FAQ questions at the beginning of the conversation to help users quickly jump to the information they need.\n Test Userlike for free and chat with your customers on your website, WhatsApp, Facebook Messenger, Telegram and SMS.\n Read more\n   Many businesses , but their popularity and cool factor is just too alluring. If there’s no game plan or use for it, why waste the money and effort into building it?\n Give your chatbot a purpose so it doesn’t become a talking website accessory. This can range from giving your brand a voice to helping customers with simple tasks. Comparing Milo and Erica, Milo lacks Erica’s functionality and intelligence, but does a great job at giving visitors a taste of the company’s brand and style.\n If your chatbot  will help with tasks, what does this include? Create a list of everything you want your chatbot to achieve and then break it down to what’s viable for your budget, time and customer base.\n Also, determine  where and  how often you’ll use your chatbot. Will it live solely on your website, or do you want to offer it on a variety of channels?\n  It’s easier to write and plan a character when you have a profile to work with. We created a guide on to help with this process. You’ll determine how your chatbot looks, behaves and speaks as well as its strengths, tasks and weaknesses.\n Once you know its characteristics, you may find it easier to create a  catchy name for your chatbot . There doesn’t seem to be a trend or preference for which names work best (human names versus cutesy ones), so brainstorm options that fit your brand, are easy to pronounce and fit the look of your chatbot.\n All of this preparation will help with script writing, the longest yet most important element in chatbot UI creation. You can use our post  “6 steps for creating a smooth chatbot conversation flow” as a pain-free guide to help you get started.\n No matter if you use a button-based, decision tree or contextual chatbot, its speaking mannerisms and tone are important for achieving that humanlike feel. Prepare for topic deviations, words or phrases that have double meanings and misunderstandings.\n  You have your choice of chatbot builder varieties, from advanced to no-code options. We created a list of the  10 must-try chatbot providers for every budget to help you decide.\n  To choose the right provider, consider how you want your users to interact with your chatbot — how can you simplify the interface so customers don’t have to press a lot of buttons and repeat themselves to get what they need?\n Pumping your chatbot with data will also improve its ability to assist customers. Start with your company data (who you are, what you provide, what users can expect) and then group other interactions you’d expect your chatbot to have.\n There are also  pre-made data sets you can incorporate into your chatbot to improve its natural language processing, or if you need a place to start data-wise.\n  Ask your top clients if they would be interested in testing your chatbot before launch. It’s a great way  to be transparent with your business and get honest feedback with a fresh perspective.\n Include employees who weren’t involved in the creation process as well. They can assess if the chatbot “fits in” with your company culture and matches the right attitude. Puns are fun, but maybe not in life insurance.\n Before launch,  connect your chatbot to your live chat solution , such as  Userlike . From the dashboard, your agents can monitor your chatbot and take handovers no matter where your chatbot is assisting customers — your website, social media and in messaging apps.\n You can try Userlike’s  free 14-day trial to get a feel for our platform. If it seems like a good fit, we’ll help you get started with a plan suitable for managing your chatbot.", "posttime": "2020-05-14 11:22:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,fantastic,聊天", "title": "奇妙的聊天机器人用户界面示例", "title_en": "Examples of Fantastic Chatbot UI", "transed": 1, "url": "https://www.userlike.com/en/blog/chatbot-ui", "via": "", "real_tags": ["机器人", "fantastic", "聊天"]}, {"category": "", "categoryclass": "", "imagename": "d4956d771d5e90b8aa33a4628a5c31c7.jpeg", "infoid": 1002057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2月份的那个周一早上和其他任何周一一样：我一醒来就立即打开手机，浏览Twitter，查看Instagram，忽略我的电子邮件，所有这些都是在床上进行的，没有假装每天都在写感恩日记。我起身煮咖啡，然后打开易趣看旧电脑。\neBay以一种早期互联网的方式让我兴奋不已。它很脏。你简直不敢相信它能行得通。你仍然可以找到一笔交易。\n我最伟大的壮举是2006年以大约300美元的价格买下了一辆挡泥板美国平流层车，它被错误地列入了挡泥板-其他类别。它的描述警告说，这把吉他少了几根弦。\n在我对老式电脑的幻想中，我一直在VIC-20准将和某种苹果II之间摇摆不定。作为YouTube“8位家伙1”(The 8-bit Guy 1)的忠实粉丝，我渴望有一台自己的电脑，可以用双氧水和小苏打清洗，因为我想知道，这台勇敢、有价值的电脑在见到我这位仁慈的新主人之前，曾面临过怎样的悲惨命运。我们一起用BASIC语言编写无限循环。我们将沿着俄勒冈小径旅行。我们会互相戳对方的记忆。\n我把几个拍卖会列入了我的观察名单，然后穿上运动鞋准备晨跑。在离我们家不到一个街区的地方，我发现了一些东西：一堆垃圾中有一个发黄的塑料盒。不是的。这不可能。我停下来，回到垃圾桶。\n我向卡莉解释了情况。她明智地建议我们继续我们的跑步，我们跑了不到30秒，如果我们回来的时候电脑还在外面，我应该敲敲房子的门，确认它真的被扔掉了。\n我敲了敲门。他们在重新装修，我能听到里面有锯子什么的。没人接。我又敲门了。我想过，你知道，有那么一秒钟，就拿去吧。最后，门开了。我做了自我介绍，很可能听起来和感觉到的一样疯狂，然后问垃圾桶里的电脑是不是……。垃圾。她点了点头，并提到，它现在还能用。\n只是监视器电缆不见了。我确信我从垃圾堆里捡到了一切像电脑一样有价值的东西。从港口的外观来看，我需要一根旧的单声道RCA电缆，我知道我父母在全国各地新泽西州的阁楼上有几十根这样的电缆。\n不管怎么说，我还是打开了电脑和监视器，即使我什么也看不见，听到它愉快地叽叽喳喳，我也松了一口气。\n在这一点上，是时候骑上我的自行车去上班了(回到我们还在做这样的事情的时候)。但我还是沿途在一家五金店短暂停留了一下，不知何故，现实世界中的一家实体店仍然有这个小家伙：\n这不是很美吗？我对卡莉说。而且，不要只喜欢II被显示为//斜杠的样子。绿色也是，它就像是起义军联盟里的东西。\n事实是，我不知道如何通过这个欢迎屏幕。我的赞助人忘了把苹果IIe的电脑手册放进他们的垃圾桶里。这在很多方面都是个大问题，因为我从20世纪80年代学到的电脑手册非常棒。我最近在eBay上买到了准将VIC-20手册和准将64手册，尽管我没有这两种机器，因为我想享受它们螺旋式装订的好处。\n但我是一名软件工程师。我知道怎么用谷歌搜索。很快，按Ctrl键重置后，我就进入了基本提示。\n我不是在BASIC编程环境中长大的，但我是一个学习历史的学生。我当然知道，每当你看到一个基本的提示符时，编写一个小的无限循环是一种必经之路。\n啊哦。我几秒钟前听到的那声砰的一声，并被故意忽略，可能不是一个好的砰的声。气味变得更难闻了。\n我把电源关掉了。我忘了说我已经把灭火器准备好了，但是它看起来不像是那么回事。不幸的是，关闭电源后气味并没有消失。\n更多的谷歌搜索发现了可能的问题：电源中突然出现了一个电容器。我从电脑上拧下电源(只用四个小螺丝固定)，把它放在很远的地方。几天过去了，几周过去了，电源仍然有股臭味。\n在这一点上，如果我是一名更有经验的焊工，我会考虑花大约10美分买一个电容器，然后自己更换。但是，由于我仍在学习焊接的诀窍，而使用电源的技巧又让我感到有些力不从心，我想找一些更有经验的人来帮助我。(此外，我还有点害怕在我真正玩电脑之前，我会不小心把什么东西短路，把主板烧焦了)。\n我花了一些时间寻找一家可以为苹果II提供服务的苹果修理店。即使是在旧金山湾区，我也觉得这是一件失败的事情。然后有人推荐了这个网站：ReActiveMicro。它的口号是：重新激活您的老式苹果电脑。花95美元，我就可以为我的Apple IIe订购一个新电源。\n所以我就这么做了。大约一周后，它收到了邮件，我大约在一分半钟内就安装好了。灭火器又准备好了，我又打开了电脑。\n而且成功了！我在网上的一本苹果杂志上查找了一个旧程序，并编写了这个小的正弦波程序：\n现在我已经有了一个可以工作的、可爱的苹果IIe，我决定做的第一件事就是把它拆开。不管你怎么评价新的Mac Pro机壳设计，但它在这个小舱口上什么都没有。\n正如你所看到的，我在扩展卡正面中了一笔相当大的头奖。我稍后将逐张介绍每一张卡片。\n还有七个人的特写镜头(7！)。扩展插槽，不包括用于添加更多内存或80列模式的额外插槽。\n这再次让人想起最近关于意外技术播客和其他关于新Mac Pro及其扩展槽的播客的讨论。关于约翰·西拉库萨(John Siracusa)将把什么放入他期待已久的Mac Pro扩展槽中，人们进行了很多有趣的讨论。\n但是，在现代计算机中，我看到的并不多，就扩展槽而言，这真的很有趣。大多数情况下，我听说过显卡和更多的存储空间。否则，您的计算机基本上具备大多数用例所需的一切。\nApple II计算机中的这些扩展插槽改变了您的计算机。把它改造成一种全新的、令人兴奋的东西。想打印点什么吗？为它弄张卡片。继续往前走..。阿帕内特？买一张调制解调器卡。需要将节目保存在磁带录音机之外的其他地方(这本身就很疯狂，我想试一试)？最好弄张软盘驾驶卡！\n即使是Apple IIe的背面也显示了这台机器被每位车主彻底改造的潜力。亲爱的电脑用户，这些插槽是您的塑形工具。\n那么，不管怎么说，我在我的苹果谎言里到底发现了什么？让我们把它们一个一个地看一遍。\n扩展的80列文本卡非常直白：它为您提供80列文本，而不是40列！我的还提供了额外的内存，使我的Apple IIe的总内存达到了惊人的128kB。\n如何进入80列模式？在基本提示符下键入PR#3。在这台显示器上看起来有点糟糕，但我已经看到了更复杂程序的价值。\n我可能对这张卡片最感兴趣。超级串行卡II可以用作调制解调器，打印机接口，我有相当好的怀疑，我将能够连接到它的Arduino或树莓PI一些乐趣。\n这是一个调制解调器！有一个看起来像电话插孔的外部端口。然而，一些工作中的奇才告诉我，我可能不能就这样把这个插到一条现代电话线上，然后指望它能工作。他们说电话线不再以同样的方式工作了。这是一件我还不太清楚的事情，但我确实设法找到了微型模型II的所有者手册，所以这里可能会有一些有趣的事情。\nDuoDisk是一种组合驱动器，具有两个相邻的5 1/4英寸软驱托架。当你把它夹在你的Apple II和它的显示器之间时，它看起来很不错。\n该卡使用由Woz著名设计的相同的Disk II系统。光盘II上的维基百科条目很吸引人，值得快速阅读。显然，苹果II因为没有包括磁盘驱动器，而是依赖外部盒式磁带存储而受到了很多抨击。沃兹的解决方案是Disk II系统，这是一种比行业标准更简单的设计，事实证明，它在财务和功能上都取得了令人难以置信的成功。根据维基百科：\n沃兹尼亚克称最终的Disk II系统是我在苹果公司最令人难以置信的经历，也是我做过的最好的工作，并将苹果II的成功归功于它和VisiCalc。\n如果有人有多余的51⁄4英寸软盘，请告诉我，因为我现在有两个完整的插槽(这实际上是一个严肃的询问，请发推特给我！)。\n如前所述，我怀疑我将能够想出如何使用超级系列II卡与Arduino或覆盆子圆周率。\n我最近发现了一个使用Raspberry PI的项目，它接受来自Apple II的键盘输入，并将其输出显示在Apple显示器上。一定要试一试。\n但我也很想看看能不能把它装好，这样我就可以通过超级串行II卡，使用树莓PI作为某种桥梁，从笔记本电脑有效地通过SSH/远程方式进入Apple IIe。\n这个项目绝对是我的重中之重，因为它看起来既奇怪又有用。我真的希望能够为Apple IIe编写程序，并轻松地将它们保存到GitHub。能够把它们写在我的笔记本电脑上，然后简单地把它们转移到苹果电脑上进行处理，这似乎是一个有趣而又让人分心的项目，可以作为下一步的工作。\n找到我丢失的钥匙的替换钥匙。我希望这并不意味着要买一个完整的苹果IIe。或者我有吗？\n复古亮丽，深度清洁--8位男士--让表壳看起来焕然一新。\n我目前没有苹果IIe的任何软件。一个也没有。一无所获。也就是说我没有游戏可玩。我知道，在20世纪80年代，杂志用来打印游戏的源代码，孩子们会花几个小时把它们插到他们的Apple II或Commodores上，祈祷它们没有犯语法错误。一旦他们的游戏启动并运行，事实证明这对好奇的人来说是一个很好的机会，可以开始摆弄源代码，调整它，最终制作自己的游戏。我敢肯定，许多这样的游戏和杂志现在都可以在网上扫描和购买。我一定会去看看那些东西的。\n我也非常愿意在eBay上购买一些经典的Apple II游戏。我很想听听你最喜欢的或者有什么建议。\n假设我在任何时候断电(或者我干脆关掉电脑)就会立即失去一切，这两个项目似乎很重要：\n找一台录音机，弄清楚如何将节目保存到磁带上，然后倒带/重新加载。\n而不是AppleSoft Basic(它是由Microsoft编写的！对于Apple！！)，它被烧录到Apple II的ROM芯片中，还有某种内置汇编程序，您可以通过在基本提示符中键入以下内容来访问：\n我相信这就是我能够做一些更像64准将那样的窥视和戳记忆的地方。我有一种感觉，这里有很多探索(和乐趣)要做。我需要更多地阅读这方面的知识。\n对我来说，这台电脑代表了电脑作为家用电器的失落时代。我说的是心灵自行车这类东西。当你还坐下来说：“我现在要去上电脑。”或者，就像我童年时一样，我现在可以上电脑了吗，妈妈，拜托了？\n我们现在更接近半机械人了，有了手机、手表、扬声器和其他做爸爸的人。计算机是我们的一部分。它们系在我们身上，它们在我们的口袋里，它们在我们的包里，当我们睡觉的时候，它们就在我们旁边。您无法逃避它们，因此，您不能再主动选择是否使用它们。我们得到的最好的信息就是屏幕时间警告，这是一部刑法，目的是让我们少用时间警告。\n这就是为什么这台Apple IIe对我来说是一台如此重要的机器。这是我可以积极选择潜入和探索的东西。这和我真正进入小说时的感觉是一样的。我生活在另一个世界。\n这里再来几张电脑的特写，作为对走到这一步的奖励。\n对于外行来说，我建议从8位小家伙精湛的两个系列的第一部分开始：修复-我见过的最糟糕的VIC-20第一部分。我不知道为什么我这么喜欢看这个人清洗和修复旧电脑，但就是这样--我就是喜欢。", "note_en": "That Monday morning in February began like any other Monday: I opened my phone immediately upon waking up, browsed Twitter, checked Instagram, and ignored my email, all from bed, making no pretense of daily gratitude journaling. I got up to make the coffee, and then opened eBay to look at old computers.\n eBay thrills in me in an early Internet kind-of-way. It&#39;s dirty. You can&#39;t believe it works. And you can still find a deal.\n My greatest feat of all was the 2006 purchase of a Fender American Stratocaster for roughly $300 bucks which had been mislisted into an &#34;Fender - Other&#34; category. Its description warned that the guitar was &#34;missing a few strings.&#34;\n  I&#39;d been waffling between a  Commodore VIC-20 and some kind of Apple II in my vintage computer fantasies. As an undying fan of YouTube&#39;s  The 8-Bit Guy 1, I longed for a computer of my own that I could clean with hydrogen peroxide and baking soda, as I wondered what sad fate the brave, worthy computer had faced before meeting me, its benevolent new master. We&#39;d write infinite loops in BASIC together. We&#39;d travel the Oregon Trail. We&#39;d poke each other&#39;s memory.\n I set a few auctions to my watch-list, and then laced on my sneakers for our morning run. Not one block away from our house did I spot something: a yellowed plastic box amid a pile of trash. No. It couldn&#39;t be. I stopped, and went back to the trash.\n   I explained the situation to Carly. She suggested, wisely, that we continue our run, of which we were less than 30 seconds into, and that if the computer was still outside when we got back, that I should knock on the door of the house, to confirm it was truly being thrown out.\n   I knocked on the door. They were remodeling, I could hear saws or something inside. No one answered. I knocked again. I considered, you know, for a second, just taking it. Finally, the door opened. I introduced myself, likely sounding as insane as felt, and asked if the computer in the trash was.. trash. She nodded, and mentioned that, &#34;It still works.&#34;\n     Except the monitor cable was missing. I was certain that I&#39;d grabbed everything of computer-ish value from the trash pile. From the looks of the port, I&#39;d need one of those old mono RCA cables, of which I know I have dozens in my parent&#39;s attic across the country in New Jersey.\n I still turned on the computer and the monitor anyway, and was relieved to hear it chirp happily, even if I couldn&#39;t see anything.\n By this point, it was high time to get on my bike and head into work (back when we still things like that). But I still made a quick pit-stop at a hardware store along the way, and somehow a physical store in the physical world still carried this little guy:\n    &#34;Isn&#39;t it beautiful?&#34; I said to Carly. &#34;And don&#39;t you just love how the  II is shown as  // slashes. The green, too, it&#39;s like something out of the Rebel Alliance.&#34;\n   Truth was I didn&#39;t know how to advance past this welcome screen. My benefactors neglected to include the computer manual for the Apple IIe in their trash. This is a major bummer on multiple fronts, because what I&#39;ve learned about computer manuals from the 1980s is that they were AWESOME. I recently picked up both the Commodore VIC-20 manual and the Commodore 64 manuals on eBay, even though I have neither machine, because I wanted to enjoy their spiral-bound goodness.\n But I&#39;m a software engineer. I know how to Google. Soon, a  Ctrl-Reset had me at the BASIC prompt.\n    I didn&#39;t grow up coding in BASIC, but I&#39;m a student of history. I certainly knew that it&#39;s a rite of passage to code up a little infinite loop whenever you see a BASIC prompt.\n   Uh-oh. That pop that I&#39;d heard seconds before, and willfully ignored, might not have been a good pop. The smell grew worse.\n  I flipped off the power. I forgot to mention I already had the fire extinguisher at the ready, but it didn&#39;t look like that&#39;d be necessary. Unfortunately, the smell didn&#39;t disappear after turning off the power.\n Some more Googling revealed the likely problem: a capacitor popped in the power supply. I unscrewed the power supply from the computer (held on by just four small screws), and put it somewhere far away. Days later, weeks later, the power supply still smelled.\n At this point, if had been a more experienced solder-er, I would have considered buying a capacitor for like ten cents and replacing it myself. But as I&#39;m still learning the ropes of soldering, and hacking with power supplies felt a little ahead of me, I thought about getting some more experienced help. (Also, I was kinda terrified that I would accidentally short circuit something and fry the motherboard, before I ever got to really play with the computer).\n I spent some time looking for an Apple repair store that would service Apple II&#39;s. Even in the Bay Area, this felt like a lost cause. Then someone suggested this site:  ReActiveMicro. Its tagline:  Reactivate Your Vintage Apple Computer. For $95, I could order a  new power supply for my Apple IIe.\n So I did. It arrived in the mail about a week later, and I installed it in roughly a minute and half. With the extinguisher again at the ready, I turned on the computer again.\n And it worked! I looked up an old program in an old Apple magazine online, and coded up this little sine wave program:\n    Now that I&#39;ve got a working, adorable Apple IIe, the first thing I decide to do is take it apart. Say what you will about the  new Mac Pro case design, but it&#39;s got nothing on this little hatch.\n    As you can see, I&#39;ve hit a pretty big jackpot on the expansion card front. I&#39;ll walk through each card individually in a bit.\n   And a close-up of the seven (7!) expansion slots, not including the extra one for adding more memory or 80-column mode.\n  This again reminds of the recent discussions on  Accidental Tech Podcast and other podcasts about the new Mac Pro and its expansion slots. There was a lot of fun discussion about what John Siracusa was going to put into his long-awaited Mac Pro&#39;s expansion slots.\n But, in modern computers, I haven&#39;t seen much that&#39;s really that interesting as far as expansion slots go. Mostly, I&#39;ve heard about video cards and more storage. Otherwise, your computer mostly has everything it needs for the majority of use-cases.\n  These expansion slots in Apple II computers CHANGED your computer. Transmogrified it into something altogether new and exciting. Want to print something? Get a card for it. Go on the.. ARPANet? Get a modem card. Need to save a program on something other than tape cassette recorder (which itself is crazy and I want to try)? Better get a floppy driver card!\n Even the back of the Apple IIe shows the potential of this machine to be utterly transformed by each owner. These slots are yours for the shaping, dear computer user.\n  So, anyway, what the heck did I find inside my Apple IIe? Let&#39;s go through them one-by-one.\n  The  Extended 80-Column Text Card is quite literal: it gives you 80 columns of text instead of 40! Mine also provides extra RAM, bringing my Apple IIe&#39;s total RAM up to a whopping 128kB.\n   How do you get into 80-column mode? Type  PR#3 into the BASIC prompt. It kinda looks worse on this monitor, but I can already see the value for more complex programs.\n  I am probably most excited about this card. The  Super Serial Card II can be used as a modem, a printer connection, and I have a pretty good suspicion that I&#39;ll be able to connect to it an Arduino or a Raspberry Pi for some fun.\n    It&#39;s a modem! With an external port that looks like a telephone jack. Some wizards at work told me that I probably cannot just plug this into a modern phone line and expect it to work, though. They said that phone lines don&#39;t really work the same way anymore. This is something I&#39;m not quite clear on yet, but I did manage to find the  Micromodel II Owner&#39;s Manual, so there could be some fun to be had here.\n    The  DuoDisk is a combination drive with two 5 1/4-inch floppy drive bays next to each other. It looks nice when you sandwich it between your Apple II and its monitor.\n  The card uses the same Disk II system famously designed by Woz. The  Wikipedia entry on the Disk II is fascinating and well-worth the quick read. Apparently, the Apple II was getting a lot of flak for not including a disk drive, instead relying on external cassette tape storage. Woz&#39;s solution was the Disk II system, a simpler design than the industry standards, proved incredibly successful, both financially and functionally. Per Wikipedia:\n Wozniak called the resultant Disk II system &#34;my most incredible experience at Apple and the finest job I did&#34;, and credited it and VisiCalc with the Apple II&#39;s success.\n  If anyone&#39;s got any spare 5 1⁄4-inch floppies, let me know, because now I&#39;ve got two whole slots for them (this is actually a serious inquiry, please  tweet at me!).\n    As mentioned, I suspect that I&#39;ll be able to figure out how to use the Super Serial II card with an Arduino or Raspberry Pi.\n I recently found a project that uses Raspberry Pi in such a way that it accepts keyboard input from the Apple II and displays its output on the Apple monitor. Definitely want to try that.\n But I&#39;m also eager to see if I can rig it up such that I can effectively SSH/remote into the Apple IIe from a laptop, using a Raspberry Pi as a bridge of some kind via the Super Serial II card.\n This project is definitely my top priority, because it seems odd and useful. I&#39;d really like to be able to write programs for the Apple IIe and easily save them to GitHub. Being able to write them on my laptop and simply transfer them to the Apple for processing seems like a hilariously fun and distracting project to work on next.\n    Find replacement keys for my missing keys. I hope this doesn&#39;t mean buying an entire  other Apple IIe. Or do I?\n &#34;Retro-brite&#34; and deep clean - a la 8 Bit Guy - to make the case look brand new\n  I currently have zero software for the Apple IIe. None. Zilch. Which means I have no games. I know that, back in the 1980s, magazines used to print out source code for games, and kids would spend hours plugging them into their Apple IIs or Commodores, praying that they hadn&#39;t made a syntax error. Once their games were up and running, this proved a great chance for the curious ones to start messing around with the source code, tweaking it, and eventually making their own games. I&#39;m sure that many of these games and magazines are now scanned and available online. I&#39;ll definitely be checking those out.\n I&#39;d also be very open to buying some classic Apple II games on eBay. I&#39;d love to hear of favorites or any suggestions.\n  Given that I immediately lose everything anytime the power goes out (or I simply turn off the computer), these two projects seem important:\n Get a tape recorder and figure out how to save a program to tape, and then rewind / reload it\n  Other than AppleSoft BASIC (which was written by Microsoft! For Apple!!), which is burned into a ROM chip on the Apple II, there&#39;s also some sort of built-in assembler that you can access by typing this into the BASIC prompt:\n  I believe this is where I&#39;ll be able to do some of the more Commodore 64-like peeking and poking directly at memory. I have a feeling there&#39;s a lot of exploring (and fun) to be done here. I need to read up more on this.\n  This computer represents to me the lost era of computer as appliance. I&#39;m talking about &#34;bicycle for the mind&#34; type-of-stuff. When you still sat down and said, &#34;I&#39;m going to computer now.&#34; Or, as in my childhood, &#34;May I please go on the computer now, Mom, PLEASE?&#34;\n We&#39;re much closer to cyborgs now, with our phones and watches and speakers and other do-dads. Computers are part of us. They&#39;re attached to us, they&#39;re in our pockets, they&#39;re in our bags, they&#39;re next to us when we go to sleep. You can&#39;t escape them, and as a result, you&#39;re no longer able to make an active choice about whether or not to use them. The best we&#39;ve got is Screen Time warnings, a penal code to make us use them less.\n That&#39;s why this Apple IIe is such an important machine to me. It&#39;s something I can actively choose to dive into and explore. It&#39;s the same thing I feel when I really get into a novel. I&#39;m in another world.\n And here a few more close-ups of the computer as a reward for making it this far.\n       For the uninitiated, I suggest starting with Part 1 of The 8-Bit Guy&#39;s masterful two series:  Restoration - The Worst VIC-20 I&#39;ve ever seen - Part 1. I don&#39;t know why I like watching this man clean and restore old computers so much, but there it is - I just do.", "posttime": "2020-05-14 11:07:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,电脑,apple,iie", "title": "我的新旧Apple IIe电脑", "title_en": "My New Old Apple IIe Computer", "transed": 1, "url": "https://www.charlieharrington.com/my-new-old-apple-iie-computer", "via": "", "real_tags": ["app", "电脑", "apple", "iie"]}, {"category": "", "categoryclass": "", "imagename": "3f93e3a4c68444f93580dd7b778ccc76.jpg", "infoid": 1002055, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CoinDesk证实，其首席执行官曾称比特币是一种欺诈行为，但现在美国银行业巨头摩根大通(JPMorgan Chase)增加了第一个加密货币交易所客户。\n消息人士周二告诉“华尔街日报”，该行签署了两家受欢迎的监管交易所-Coinbase和Gemini，后者由泰勒和卡梅隆·温克莱沃斯创立。\n华尔街日报说，这两家交易所在美国都受到监管的事实显然是批准的一个因素，批准仍然需要很长一段时间的审查。消息人士称，这两家密码公司的账户已于上月获得批准，目前正在使用中。\n摩根大通的这一举措在一个银行服务难以获得的国家引人注目，因为任何与加密货币打交道的公司都很难获得银行服务，而加密货币被银行业视为一种高风险。到目前为止，交易所和其他使用数字资产的公司一直由一些密码友好的银行机构(如银门)提供服务。\n不过，双子座和Coinbase并不是摩根大通的首批密码客户。TokenSoft首席执行官梅森·博达(Mason Borda)在Twitter上表示，TokenSoft是一家受监管的转移代理和安全令牌服务软件供应商，自2017年以来一直在该银行拥有账户。\n美国银行业监管机构布赖恩·布鲁克斯(Brian Brooks)周一在CoinDesk的“共识：分布式活动”(Consensus：Distributed Event)上发表讲话时表示，银行不仅有能力，而且有义务为所有合法业务提供服务。他们不应该因为某件事是一项新技术就歧视他们。布莱恩·布鲁克斯(Brian Brooks)曾是Coinbase的首席法务官，现在是货币监理署(Office Of The Comptroller Of The Currency)的高级副手。\n随着密码技术的成熟，越来越多的公司拥有完全稳健的风险管理系统，并确实有能力遵守这些法律，它们应该不会在寻找银行关系方面遇到困难，他说。\n随着加密货币公司现在被一家大银行接受，其他机构可能也会效仿。传统金融行业对金融技术越来越开放，因为事实证明，在市场青睐的资产陷入困境之际，金融技术是一项有价值的投资。\n今年到目前为止，比特币上涨了20%，而标准普尔500指数下跌了9.3%，油价下跌了66%。在市场因冠状病毒大流行的影响而摇摇欲坠之际，传统避险黄金仅上涨11.5%。\n上周，对冲基金先驱保罗·都铎·琼斯二世(Paul Tudor Jones II)透露，他的都铎BVI全球基金(Tudor BVI Global Fund)现在被授权投资比特币期货。琼斯不久后还告诉CNBC，他持有1%-2%的比特币资产。他没有说他是投资了比特币期货还是实际的比特币。\n“华尔街日报”消息人士说，摩根大通现在正通过电汇和自动清算所(ACH)交易向Coinbase和Gemini的美国用户提供存款和提款。他们说，它还在帮助交易所提供现金管理服务。\n摩根大通还建立了自己的区块链结算服务，使用自己的美元支持的代币，名为JPM Coin。该公司首席执行官杰米·戴蒙曾在去年表示，代币可能是内部的，也可能是商业的，也可能有一天会成为消费者。\n作为区块链新闻的领头羊，CoinDesk是一家追求最高新闻标准并遵守一套严格的编辑政策的媒体渠道。CoinDesk是数字货币集团(Digital Currency Group)的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "Its CEO  once called bitcoin a fraud but now U.S. banking giant JPMorgan Chase has added its first cryptocurrency exchange customers, CoinDesk has confirmed.\n Sources  told The Wall Street Journal Tuesday the bank signed two popular regulated exchanges – Coinbase and Gemini, the latter founded by Tyler and Cameron Winklevoss.\n The fact that both exchanges are regulated in the U.S. was apparently a factor in the approvals, which still took a lengthy period of vetting, the WSJ said. Accounts for the two crypto firms were approved last month, the sources said, and are now in use.\n The move by JPMorgan is notable in a nation where banking services are hard to come by for any firms dealing with cryptocurrencies, which are viewed as a high risk by the banking industry. Until now, exchanges and other firms working with digital assets have been served by a few crypto-friendly banking institutions such as  Silvergate.\n Still, Gemini and Coinbase aren&#39;t the first crypto clients for JPMorgan. TokenSoft, a regulated transfer agent and software vendor for security token services, has had an account at the bank since 2017, CEO Mason Borda  said on Twitter.\n  Speaking at CoinDesk&#39;s Consensus: Distributed event Monday, U.S. banking regulator  Brian Brooks said, &#34;Banks not only have the ability, they have an obligation to serve all lawful businesses. They shouldn&#39;t be discriminating because something&#39;s a new technology.&#34; Brian Brooks was formerly Coinbase&#39;s chief legal officer and is now senior deputy at the Office of the Comptroller of the Currency.\n &#34;As crypto matures, there are increasingly many companies that have perfectly robust risk management systems and do have an ability to comply with those laws, and they shouldn&#39;t have trouble finding bank relationships,&#34; he said.\n With cryptocurrency firms now accepted by a major bank, it&#39;s possible other institutions may follow suit. The traditional finance industry has been becoming more open to the financial technology as it proves a worthy investment at a time when the markets&#39; favorite assets are struggling.\n So far this year, bitcoin as up 20%, while the S&amp;P 500 stock index is down 9.3% and oil has fallen 66%. Traditional safe haven gold is up just 11.5% at a time when markets have been reeling from the effects of the coronavirus pandemic.\n In this last week, hedge fund pioneer Paul Tudor Jones II revealed his Tudor BVI Global Fund is now  authorized to invest in bitcoin futures. Jones also told CNBC soon after that he  holds 1%-2% of his assets in bitcoin. He didn&#39;t say whether he invested in bitcoin futures or actual  bitcoins.\n The WSJ sources said JPMorgan is now providing Coinbase and Gemini&#39;s U.S. users with deposits and withdrawals via wire transfer and automated Clearing House (ACH) transactions. It&#39;s also helping the exchanges with cash management services, they said.\n JPMorgan has also built out its own blockchain settlement service with its own U.S.dollar-backed token, dubbed JPM Coin. Previously a crypto cynic, CEO Jamie Dimon  said last year the token &#34;could be internal, could be commercial, it could one day be consumer.”\n    The leader in blockchain news, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups.", "posttime": "2020-05-14 10:09:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,大通,extends,货币", "title": "摩根大通将银行服务扩展到比特币交易所", "title_en": "JPMorgan Extends Banking Services To Bitcoin Exchanges", "transed": 1, "url": "https://www.coindesk.com/coinbase-gemini-first-crypto-exchange-customers-jpmorgan-bank-report", "via": "", "real_tags": ["交易", "大通", "extends", "货币"]}, {"category": "", "categoryclass": "", "imagename": "604e74deec5d7f464c8801e1702b9120.jpg", "infoid": 1002054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TechCrunch看到的这封内部电子邮件显示，福利的损失是由州政府决定的，特斯拉并没有因为员工选择呆在家里而惩罚他们。CNBC最先报道了这封电子邮件。\n沃克曼在电子邮件中写道：“一旦你被召回，你将不再休假，所以如果你选择不工作，可能会影响你当地政府机构确定的失业救济金，而不是特斯拉。”“我们完全尊重您的决定，并将支持您，我们不会对您进行任何处罚。”\n特斯拉首席执行官埃隆·马斯克(Elon Musk)在发给员工的内部电子邮件中表示，如果他们在重返工作岗位时感到不舒服，那么他们应该呆在家里。然而，这封最新的电子邮件将员工置于十字路口-要么重返工作岗位，冒着感染冠状病毒的风险，要么呆在家里，失去失业救济金。\n周三发送的电子邮件向员工提供了最新情况，因为特斯拉正准备恢复其位于加利福尼亚州弗里蒙特的工厂的生产。在冠状病毒大流行期间，这家工厂一直是关于企业何时以及如何重新开业的辩论的导火索。\n马斯克一再批评阿拉米达县及其卫生官员将居家命令延长至5月底。上周末，马斯克威胁要将特斯拉业务撤出该州，并起诉该县。周六，特斯拉对该县提起诉讼，寻求禁令救济。\n就在马斯克公开谴责该县-周一甚至在Twitter上发帖称，该工厂无视在家工作的命令-重新开工之际，政府官员与特斯拉之间的谈判仍在幕后继续。周二晚间，阿拉米达县表示，如果特斯拉实施额外的安全建议，最快可能在下周重新开业。\n阿拉米达县公共卫生部的声明称，在收到特斯拉针对其弗里蒙特工厂的冠状病毒现场特定安全计划后，官员们“今天与特斯拉的代表就他们的安全和预防计划进行了富有成效的讨论，包括一些额外的安全建议”。", "note_en": "The internal email, which was viewed by TechCrunch, suggested that the loss of benefits was up to the state and that Tesla wasn’t penalizing employees for choosing to stay at home. CNBC was the  first to report the email.\n “Once you are called back, you will no longer be on furlough so if you choose not to work, it may impact your unemployment benefits as determined by your local government agency — and not by Tesla,” Workman wrote in the email. “We completely respect your decision and will support you, without any penalties from us.”\n Tesla CEO  Elon Musk   has said in internal emails to employees that if they feel uncomfortable returning to work, then they should stay at home. However, this latest email puts workers at a crossroads — return to work and risk contracting COVID-19 or stay at home and lose their unemployment benefits.\n   The email sent Wednesday provided an update to employees as Tesla prepares to restart production at its factory in Fremont, Calif. The factory has been a flashpoint in the debate over when and how businesses reopen amid the COVID-19 pandemic.\n Musk has lobbed repeated criticisms at Alameda County and its health officials for extending a stay-at-home order to the end of May. Over the weekend, Musk threatened to pull Tesla operations out of the state and sue the county. Tesla filed a lawsuit against the county Saturday seeking injunctive relief.\n Even as Musk publicly decried the county — going as far to tweet Monday that the factory was reopening in defiance of the stay-at-home order — negotiations between government officials and Tesla continued in the background. On Tuesday evening, Alameda County said that  Tesla could reopen as soon as next week if it implements additional safety recommendations.\n The statement from the Alameda County Public Health Department said that after receiving Tesla’s COVID-19 site-specific safety plan for its Fremont plant, officials “held productive discussions today with Tesla’s representatives about their safety and prevention plans, including some additional safety recommendations.”", "posttime": "2020-05-14 10:08:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,可能,employees,员工", "title": "不重返工作岗位的特斯拉员工可能会失去失业救济金", "title_en": "Tesla employees who dont return to work could lose unemployment benefits", "transed": 1, "url": "https://techcrunch.com/2020/05/13/tesla-employees-who-dont-return-to-work-could-lose-unemployment-benefits/", "via": "", "real_tags": ["特斯拉", "可能", "employees", "员工"]}, {"category": "", "categoryclass": "", "imagename": "fdaa2a0b8e7430f7345b6c9575d8d5b5.jpg", "infoid": 1002053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你想到学习另一门语言时，你可能会想到法语、西班牙语或汉语。但是Python或Java怎么办呢？这两个过程可能比你想象的更相似。\n华盛顿大学研究人员最近发表的一项研究显示，语言能力和解决问题的技能最能预测人们学习流行编程语言Python的速度。他们的研究发表在“科学报告”(Science Reports)上，使用行为测试和大脑活动测量来观察它们与参与者学习编程的速度和水平之间的关系。\n在这项研究中，42名参与者被招募通过CodeAcademy尝试一门广受欢迎的在线编码课程。他们被要求完成10节45分钟的“学习Python”课程。从36名完成研究的参与者中，他们能够确定学习速度和学生学习课程的情况。\n在参加在线课程之前，参与者做了一系列旨在考察数学技能、工作记忆、解决问题和第二语言学习能力的测试。在他们的在线编程课程中，研究人员能够跟踪他们学习的速度有多快，以及他们在在线软件内置的测验中做得有多好。在研究结束时，他们还完成了一项测验和编码任务，以查看他们的整体编码知识。\n研究人员可以在那里比较Python课程前后的测试结果。我们的目标是确定参与者Python学习中的差异在多大程度上可以通过他们在不同预测试中的表现来解释：记忆力、解决问题的能力以及数字或语言的天赋在多大程度上影响了他们学习编程的速度？\n参与者以不同的速度学习Python，并且在研究结束时具有不同的编程能力。研究人员观察了测试前技能中涵盖的技能与参与者学习Python的方式的可变性之间的关系。他们发现，学生学习Python的好坏主要由一般认知能力(解决问题和工作记忆)来解释，而他们学习的速度则由一般认知技能和语言能力来解释。\n语言能力几乎解释了人们学习Python速度差异的20%。相比之下，数学预试的成绩只解释了学生学习速度差异的2%，与他们的学习水平完全没有相关性。学习编程更多地依赖于语言技能，而不是数字技能。\n语言技能重要性的其他证据来自脑电图(EEG)数据。脑电图是一种通过可以通过头骨记录的电模式来测量大脑活动的方法。在他们的在线学习任务之前，参与者被给予一个休息状态的EEG，它测量了当受试者放松和不做任何事情时大脑的模式。\n静止时的电活动有不同的模式。其中一种模式是电活动的慢波，称为β振荡。过去的研究表明，静息状态下高水平的β振荡与学习第二语言的能力有关。\n在这项研究中，这些β振荡的高水平与更快的学习和更多的编程知识相关。虽然这一发现为语言学习和代码学习之间的联系提供了额外的支持，但(目前)还不清楚β振荡是如何与学习结果相关的，还需要更多的研究。\n综上所述，这些结果证明语言技能是学习编程(或至少是学习Python)不可或缺的一个方面，而数学技能并不能很好地预测参与者学习的好坏或速度。这个想法对围绕编程的看法有着重要的影响，编程通常被视为一个数学密集型领域。\n关于程序员有很多假设，特别是关于谁是一个优秀的程序员。女性经常觉得她们不符合典型的计算机程序员的想法。然而，平均而言，女孩的语言技能通常比男孩高。既然语言能力被证明可以预测学习编程的能力，或许女性应该更多地拥有擅长编程的声誉。\n确实，有些领域同时需要数学和编程技能，但这并不一定是大多数可用的编程工作。根据这项研究，对每个计算机科学专业的高级数学课的要求似乎没有必要，增加数学要求的灵活性可以帮助招收和留住学生。\n明确地将语言技能与编程联系起来，并提供不需要高级数学的教育选择，可能有助于提高多样性，同时仍能教给学生他们需要的编程技能。事实上，训练营风格的选项正在迅速流行，它们可以在不强迫参与者学习微积分的情况下成为编程职业。\n随着编程成为许多工作的必备条件，现在是时候质疑长期以来关于学习编程必备条件的假设了。基于这项新研究的结果，大学和个人应该重新思考他们是如何描述学习编程的，以及哪些能力起到了作用。外面有很多人不是学数学的，但他们可能只是学计算机的。", "note_en": "When you think of learning another language, you probably think of French, Spanish, or Chinese. But what about Python or Java? The two processes might be more similar than you&#39;d think.\n A recent  study published from researchers at the University of Washington showed that language ability and problem solving skills best predict how quickly people learn Python, a popular programming language. Their research, published in  Scientific Reports, used behavioral tests and measures of brain activity to see how they correlated with how fast and well participants learned programming.\n For the study, 42 participants were recruited to try a popular online coding course through  Codeacademy. They were asked to complete ten 45-minute lessons of the &#34;Learn Python&#34; course. From the 36 participants who completed the study, they were able to determine rate of learning and how well the students learned the lessons.\n Before doing online classes, participants did a battery of tests designed to look at math skills, working memory, problem solving, and second language learning ability. During their online programming course, the researchers were able to track how quickly they learned and how well they did in the quizzes built into the online software. They also completed a quiz and coding task at the end of the study to look at their overall coding knowledge.\n  The researchers where then able to compare the test results from before and after the Python course. The goal was to determine how much of the differences in participant Python learning could be explained by their performance on the different pre-tests: how much did memory, problem solving, and an aptitude for numbers or languages influence how quickly they learned to code?\n The participants learned Python at different rates, and had different programming abilities at the end of the study. The researchers looked at the relationship between the skills covered in the pre-test skills and the variability in how participants learned Python. They found that how  well students learned Python was mostly explained by general cognitive abilities (problem solving and working memory), while how  quickly they learned was explained by both general cognitive skills and language aptitude.\n  Language aptitude explained almost 20% of the difference in how quickly people learned Python. In contrast, performance on the math pre-test only explained 2% of the variability in how quickly students learned, and didn&#39;t correlate at all with how well they learned. Learning to code depended much more on language skills than it did on numerical skills.\n  Additional evidence for the importance of language skills came from electroencephalography (EEG) data. EEG is a method of measuring brain activity through electrical patterns that can be recorded through the skull. Prior to their online learning tasks, participants were given a resting state EEG, which measures patterns in the brain when the subjects were relaxed and doing nothing.\n Electrical activity at rest has different patterns. One of these patterns is slow waves of electrical activity called beta oscillations. Past research has shown that high levels of beta oscillations at rest are linked with the ability to learn a second  language.\n  In this study, high levels of these beta oscillations were associated with faster learning and more programming knowledge. While this finding gives additional support to the connection between language learning and learning to code, it&#39;s not clear (yet) how beta oscillations are related to learning outcomes, and more research is needed.\n Taken together, these result make the case for language skills being an integral aspect of learning programming (or at least of learning Python), while math skills weren&#39;t very predictive of how well or quickly participants learned. This idea has important implications for the perceptions surrounding programming, which is often viewed as a &#34;math intensive&#34; field.\n  There are many assumptions about programmers, especially about  who makes a good programmer. Women often feel they don&#39;t fit with the idea of a &#34;typical&#34; computer  programmer. However, girls typically have  higher language skills than boys on average. Since language abilities were shown to predict ability to learn programming, perhaps women should have more of  a reputation for being &#34;good&#34; at programming.\n It&#39;s true that some fields require both math and programming skills, but those aren&#39;t necessarily the majority of programming jobs available. Based on this study, the requirements for advanced math classes for every computer science major seem unnecessary, and increased flexibility over math requirements could help recruit and retain students.\n  Explicitly connecting language skills to programming and providing education options that don&#39;t require advanced math may help  improve diversity, while still teaching students the programming skills they need. Indeed, &#34;bootcamp&#34; style options that are rapidly growing in popularity lead to programming careers without forcing calculus on their participants.\n As programming becomes a pre-requisite for many jobs, it&#39;s time to question long held assumptions about pre-requisites for learning programming. Based on the results from this new study, universities and individuals should rethink how they characterize learning programming and what abilities play a role. There&#39;s a lot of people out there who &#34;aren&#39;t math people,&#34; but they just might be computer science people.", "posttime": "2020-05-14 09:52:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,显示,skills,学习", "title": "研究显示，学习编程比数学更重要的语言技能", "title_en": "Language skills more important than math to learn programming, research shows", "transed": 1, "url": "https://massivesci.com/articles/programming-math-language-python-women-in-science/", "via": "", "real_tags": ["编程", "显示", "skills", "学习"]}, {"category": "", "categoryclass": "", "imagename": "50760fbb1319f6347a05287b300a4695.jpg", "infoid": 1002052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“信息报”(需要订阅)的一份报告详细介绍了由前摩托罗拉高管里克·奥斯特罗(Rick Osterloh)领导的谷歌像素团队的一次大改组。在Pixel4和这款手机罕见的内部批评反应不佳之后，两名高管离开了Pixel团队。\nPixel总经理马里奥·奎洛兹和谷歌Pixel相机背后的策划者马克·莱沃伊在过去一年里都离开了Pixel团队。Queiroz和Levoy都是Pixel团队的成员，在发布会上，他们通常会就新功能做冗长的演讲。Levoy的离开尤其令人担忧，因为Pixel的摄像头一直是这款手机系列的主要亮点之一。\nPixel4并没有取得巨大的成功。它在前两个季度的销量也低于Pixel 3和Pixel 3a。奥斯特罗在发射前也对这款设备没有信心。报道称，在[Pixel 4]10月在纽约发布之前，奥斯特罗召集了一次全体员工会议，并分享了他对这款手机的担忧。据报道，他不同意关于这款手机的一些决定，特别是他对手机的电池电量感到失望。奥斯特罗是Pixel团队的负责人，所以这篇报道让人们对他的管理风格有了一些洞察。对于史蒂夫·乔布斯这样的人来说，批准这些大方向将是他日常决策的重要组成部分。显然，奥斯特罗更像是一个不插手的委托者。\n报告称，在Pixel4的销售疲软和评论不温不火之后，谷歌的硬件部门需要保持青睐和资金支持，因为由于最近广告收入放缓，谷歌高层希望控制成本。看到谷歌硬件与谷歌削减成本的努力相提并论有点可怕--谷歌一直在大刀阔斧地扼杀那些不会定期吸引数百万用户的产品。很难说Pixel系列在其存在的四年里一直做得很好，甚至正在变得更好。我们已经看到谷歌硬件的一些分支机构被解雇：奥斯特罗承认，由于Pixel Slate表现不佳，该团队已经退出了平板电脑业务。\n目前，所有人的目光都集中在Pixel 4a的中端机型上，这款机型应该会在下个月推出。作为一款更便宜的手机，Pixel 3a在Pixel手机方面卖得很好，但这只是谷歌的第一款中档手机，此前谷歌多年来一直在抵制这一观点，声称Pixel在2017年仍将保持溢价。多年来，中端市场一直死气沉沉，谷歌本可以在很大程度上独占这一市场。不过，到2020年，由于新款iPhone SE的推出，Pixel 4a将不得不在竞争异常激烈的中端市场开展业务。\n关于未来，Pixel团队并没有完全停滞不前。Axios最近的一份报告称，谷歌正在为未来的Pixel手机开发自己的主要SoC芯片，这款手机最快可能在明年上市，也就是Pixel6。谷歌一直在慢慢地将越来越多的自己的硬件添加到Pixel系列中，比如Titan M安全芯片、Pixel Visual Core和Pixel4中的Project Soli芯片，但这些定制的硬件都没有给它的竞争对手带来重大的、切实的优势。", "note_en": "A report from  The Information (subscription required) details a big shakeup at Google&#39;s Pixel team, lead by former Motorola executive Rick Osterloh. Following the poor reception of the Pixel 4 and &#34;rare internal criticism&#34; of the phone, two top executives left the Pixel team.\n Pixel general manager Mario Queiroz and &#34;the mastermind behind Google&#39;s Pixel camera,&#34; Marc Levoy, have both left the Pixel team in the past year. Both Queiroz and Levoy have been visible members of the Pixel team at launch events, where they usually give lengthy presentations about the new features. Levoy&#39;s departure in particular is cause for concern, since the Pixel&#39;s camera has been one of the major bright spots of the phone line.\n The Pixel 4 has not been a huge success. It has sold less than the Pixel 3 and Pixel 3a in its first two quarters. Osterloh was not confident about the device in the lead-up to launch, either. The report says that &#34;ahead of the [Pixel 4] October launch in New York,&#34; Osterloh called an all-hands meeting and shared his misgivings about the phone. He reportedly &#34;did not agree with some of the decisions made about the phone&#34; and that &#34;in particular, he was disappointed in its battery power.&#34; Osterloh runs the Pixel team, so this reporting gives some insight into his management style. For a Steve Jobs type, approving these kinds of broad directions would be a big part of his day-to-day decision making. Osterloh, apparently, is more of a hands-off delegator.\n The report says that, following &#34;sluggish sales and tepid reviews&#34; for the Pixel 4, &#34;the company&#39;s hardware division needs to maintain favor and funding as Google’s top brass look to rein in costs because of a recent slowdown in advertising revenue.&#34; Seeing Google Hardware in the same sentence as Google&#39;s cost-cutting efforts is a bit scary—Google has been  aggressively killing products that don&#39;t regularly pull in millions of users, and it&#39;s hard to make an argument that the Pixel line has been doing well  or is even getting better over its four years of existence. We&#39;ve already seen some branches of Google Hardware get the ax: Osterloh has admitted the team has  quit the tablet business after poor performance from  the Pixel Slate.\n Right now, all eyes are on the midrange  Pixel 4a, which should launch  next month. As a cheaper phone, the Pixel 3a was a good seller as far as Pixel phones go, but it was only Google&#39;s first midrange phone after years of resisting the idea with the claim that &#34; Pixel stays premium&#34; in 2017. For years, the midrange market was dead, and Google could have had it mostly to itself. In 2020, though, the Pixel 4a will have to do business in a suddenly hyper-competitive midrange market thanks to the launch of the new  iPhone SE.\n With regards to the future, the Pixel team isn&#39;t exactly standing still. A recent report from Axios claims that Google is working on its  own main SoC for a future Pixel phone that could hit the market &#34;as soon as next year,&#34; which would mean the Pixel 6. Google has been slowly adding more and more of its own hardware to the Pixel line like the  Titan M security chip, the  Pixel Visual Core, and the Project Soli chip in the Pixel 4, but none of this custom hardware has resulted in a major, tangible advantage over its competitors.", "posttime": "2020-05-14 09:39:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,相机,pixel4,pixel", "title": "谷歌Pixel相机领导在Pixel4失败后辞职", "title_en": "Google Pixel's Camera Lead Quits After the Failure of the Pixel 4", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/05/shakeup-at-google-sees-the-pixels-camera-lead-and-general-manager-quit/", "via": "", "real_tags": ["谷歌", "google", "相机", "pixel4", "pixel"]}, {"category": "", "categoryclass": "", "imagename": "f5acfee7c68ce67947565fcaabf56ace.png", "infoid": 1002050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们听说苹果即将推出的超耳式耳机已经有一段时间了，来自多个消息来源的证据都指向今年晚些时候的正式发布。据知情人士透露，现在9to5Mac已经了解到更多关于“AirPods Studio”的独家细节，包括规格和设置。\n普通AirPods的关键功能之一是耳朵检测，当你摘下耳机时，它会自动暂停歌曲。我们了解到AirPods Studio也会有类似的功能，但它会以不同的方式工作。苹果公司正在努力增加可以检测耳机是戴在头上还是戴在脖子上的传感器，而不是耳朵检测。\n基于此，我们假设AirPods Studio在检测到内容被放在您的头上时会播放或暂停内容。颈部检测可以用来在音乐暂停时保持耳机打开，就像你只把一个AirPods从耳朵里拿出来一样。\n另一种新的传感器将能够检测左耳和右耳，以自动路由音频通道。这意味着使用AirPods Studio可能没有对错之分，而目前的耳机有固定的左右声道。\n就像AirPods Pro一样，苹果的新耳机将具有主动消噪和透明模式。用户将能够轻松地在这两种模式之间切换，以减少外部噪音或听到环境声音。\n消息人士告诉我们，由于AirPods Studio预计将主要面向专业用户，将耳机与Mac或iOS设备配对将解锁自定义均衡器设置，并提供低、中、高频调节。\n据彭博社(Bloomberg)最近的一篇报道，苹果自主品牌的耳机将至少有两种变体-一种使用皮革面料，另一种使用更轻的材料来健身。彭博社还表示，苹果正在测试一种新的模块化设计，带有可更换的磁性耳垫。\n9to5Mac还在泄露的iOS 14测试版代码中发现了所谓的AirPods Studio的证据，包括显示新配件至少有两种颜色选择的资产。至于价格，有传言称售价为349美元。\n你在考虑买下AirPods工作室吗？你对苹果的新耳机有什么期待的功能？请在下面的评论区让我们知道。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "We’ve been hearing about Apple’s upcoming  over-ear headphones for some time, with evidence from multiple sources pointing to the official launch later this year. And now  9to5Mac has learned more exclusive details about the “AirPods Studio”, including specifications and settings, according to people familiar with the matter.\n  One of the key features of regular AirPods is ear detection, which automatically pauses the song when you take the earphones off. We’ve learned that AirPods Studio will have a similar feature, but it will work in a different way. Instead of ear detection, Apple is working to include sensors that can detect whether the headphones are on your head or neck.\n Based on this, we assume that AirPods Studio will play or pause content when they detect being placed on your head. Neck detection can be used to keep the headset turned on while the music is paused, just like when you take just one of the AirPods out of the ear.\n Another new sensor will be able to detect left and right ears to automatically route the audio channels. That means there’s likely no right or wrong side to use AirPods Studio, whereas current headphones have fixed left and right channels.\n Just like the AirPods Pro, Apple’s new headphones will have Active Noise Cancellation and Transparency Mode. Users will be able to easily switch between the two modes to reduce external noise or to hear the ambient sound.\n As AirPods Studio are expected to be mainly focused on professional users, pairing the earphones with a Mac or iOS device will unlock custom equalizer settings, with low, medium, and high frequency adjustments available, sources told us.\n According to a  Bloomberg  recent report, Apple’s own-brand over-ear headphones will be available in at least two variations of the headphones — one using leather fabrics and another with lighter materials to fitness use cases.  Bloomberg also said Apple is testing a new modular design with exchangeable magnetic ear pads.\n 9to5Mac has also found evidence of so-called AirPods Studio in the leaked iOS 14 beta code,  including assets showing at least two color options for the new accessory. As for the price,  rumors suggest that it will cost $349.\n Are you considering buying the AirPods Studio? What features do you expect from Apple’s new headphones? Let us know in the comments section below.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-05-14 09:09:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,app,apple,均衡器,equalizer", "title": "传闻中的苹果耳机具有头部和颈部检测功能，自定义均衡器设置", "title_en": "Apple's Rumored Over-Ear Headphones Feature Head and Neck Detection, Custom Equalizer Settings", "transed": 1, "url": "https://9to5mac.com/2020/05/11/airpods-studio-features-exclusive/", "via": "", "real_tags": ["苹果", "app", "apple", "均衡器", "equalizer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很容易想象大型的、令人印象深刻的服务器硬件比您可能带到咖啡馆的机器更快。事实是，服务器硬件是不同的，不一定更快。\n机械同情界长期以来一直主张开发人员使用服务器硬件作为日常驱动程序。我过去常常担心，接受他们的建议意味着失去我习惯的许多桌面功能。就像声卡一样。最后，我听从了他们的建议，今年换成了多插槽Xeon ThinkStation。我保留了笔记本电脑，以供移动使用。\n我的笔记本电脑的i7CPU的基本频率是2.8 GHz，涡轮增压(更多信息见下文)高达3.9 GHz。同时，我在Google Cloud上使用的至强处理器的基本频率为2.3 GHz。什么给予？\n这个想法大概是这样的：消费者工作负载服务于一个人做的事情很少。服务器工作负载正在为许多用户提供服务。\n在家玩视频游戏时，您需要主游戏循环的高时钟频率。\n挂在旧的数据中心，同时为1000人呈现网页？这是一个不同的故事。对于服务器工作负载，为了在相同的热量/功率空间中“容纳”更多内核，放弃时钟频率通常是有意义的。\n有很多例外，当你进入CPU数量更高的消费类机器时，时钟频率通常会下降，而且Xeon的范围也很广。你想怎么快就怎么快就能搞到Xeons。\n您的笔记本电脑可能会告诉您，单线程工作负载的性能优于并行工作负载，而事实恰恰相反。\n在生产中，您的笔记本电脑可能会告诉您性能瓶颈不是CPU，而是CPU。\n大多数消费类机器都有一个单插槽，周围有RAM DIMM，访问RAM的任何部分都有大致相同的延迟。\n服务器通常有许多CPU插座，每个RAM芯片都有一个“主”插座，也就是它所连接的特定插座。访问插座上“本地”的RAM速度很快，而访问另一个插座上的RAM则很慢。\n默认情况下，mmap将在连接到执行系统调用的插槽的DIMM上为您提供内存。请参阅set_mempolicy(2)。\n你的笔记本电脑会告诉你，一个程序在一个线程中分配内存，然后在另一个线程中使用它是很快的。\n今天一台好的笔记本电脑都有一个大的NVMe固态硬盘插在它的小脑袋里。NVMe的尖叫速度很快，这正是你处理照片、视频或玩游戏等大文件时想要的。\n平均而言，服务器有不同的需求。接受网络请求并进行数据库调用的Rails应用程序可能几乎不接触磁盘。文件服务器通常将文件缓存在缓冲池中，从RAM而不是磁盘为它们提供服务。\n您在GCP上得到的默认磁盘，即区域永久磁盘，最多只能达到240MiB/s，这比您笔记本电脑上的NVMe磁盘慢一个数量级。\n您的笔记本电脑会让您认为日志记录框架不是您的主要瓶颈。\nXeon CPU也有Turbo Boost，所以这不是消费者硬件和服务器硬件之间的严格区别，而是消费者和服务器工作负载的区别。\n在具有并行负载的服务器上，Turbo Boost可能无法发挥作用。它旨在加速低并发工作负载，如您的游戏渲染循环。如果服务器上的所有内核都在工作，它就已经运行得很好、很热，不会为您提供Turbo Boost。\n因此，您的单线程基准测试将获得甜美的5 GHz翘曲速度并投入生产吗？享受2.4 GHz的公园漫步。\n多亏了Turbo Boost，您的笔记本电脑测试可能会看到真实世界中时钟速度的两倍。\n如果您的主要开发环境是基于终端的，那么流行的选择是简单地在云VM上运行shell。\n对我来说，我选择了一台双至强ThinkStation P720，我现在把它作为我的主要开发机器，每天我都会更多地了解我正在为其编写软件的硬件。", "note_en": "It’s easy to imagine big, impressive server hardware as  faster than a machine you might take to a cafe.The truth is, server hardware is  different, not necessarily  faster.\n The mechanical sympathy community has long advocated developers use server hardware as daily drivers.I used to worry that taking their advice meant losing a lot of the desktop niceties I was used to.Like, you know, sound cards.Finally taking their advice, I swapped to a multi-socket Xeon ThinkStation this year.I kept my laptop for mobile use.\n   My laptops’ i7 CPU has a base frequency of 2.8GHz,  turbo boosted (more on that below) up to 3.9GHz.Meanwhile, the Xeons I get on Google Cloud have a base rate of 2.3GHz. What gives?\n The thought is something like: consumer workloads are serving one person doing few things. Server workloads are serving many users.\n Playing a video game at home, you want high clock frequency for the main game loop.\n Hanging out in the old data center, rendering web pages for a thousand people simultaneously?A different story.For server workloads, it often makes sense to give up clock frequency to “fit” more cores in the same heat / power space.\n There are plenty of exceptions.As you move into higher-CPU count consumer machines, clock frequencies generally drop.And, the Xeon range is wide. You can get Xeons about as fast as you like.\n  Your laptop may tell you a single threaded workload outperforms a parallel workload when the opposite is true.\n  Your laptop may tell you your performance bottleneck is not CPU when, in production, it is.\n  Most consumer machines have a single socket with RAM DIMMs located around it.Accessing any part of RAM has, roughly, uniform latency.\n Servers usually have many CPU sockets.Each RAM chip has a “home” socket, a specific socket it is connected to.Accessing RAM that is “local” to the socket on is fast.Accessing RAM that is on another socket is slow.\n  By default, mmap will give you memory on the DIMMs connected to the socket you made the syscall on.See  set_mempolicy(2).\n Your laptop will tell you a program that allocates memory in one thread and uses it in another is fast\n  A good laptop today comes with a big honkin’ NVMe SSD plugged right into its little brain.NVMe is screaming fast, exactly what you want for working with large files like photos, video or playing games.\n Server have, on average, different needs.A Rails app that takes a network request and makes a database call may barely touch disk.A file server often cache files in buffer pools, serving them from RAM rather than disk.\n The default disk you get on GCP, regional persistent disks, will top out around 240MiB/s.That is one order of magnitude slower than the NVMe disk on your laptop.\n Your laptop will make you think your logging framework isn’t your primary bottleneck\n  Xeon CPUs have Turbo Boost as well, so this isn’t strictly a difference between consumer and server hardware.But it  is a difference in consumer and server  workloads.\n On a server with parallel load, Turbo Boost may not kick in.It’s designed to speed up low-concurrency workloads, like your game rendering loop.If all the cores on the server are working, it will already be running nice and hot, no turbo boost for you.\n Hence, your single-threaded benchmark will get that sweet 5GHz warp speed and in production? Enjoy the 2.4GHz park stroll.\n Your laptop test may see twice the clock speed that you’ll see in the real world, thanks to Turbo Boost\n  If your main development environment is terminal-based, a popular option is to simply run a shell on a cloud VM.\n For me, I picked up a dual-Xeon ThinkStation P720, which I now use as my main development machine.Every day I learn a bit more about the hardware I’m writing software for.", "posttime": "2020-05-14 09:08:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,笔记本电脑,framework", "title": "日志框架不是瓶颈，您的笔记本电脑会告诉您其他谎言", "title_en": "The logging framework isn't a bottleneck, and other lies your laptop tells you", "transed": 1, "url": "https://tech.davis-hansson.com/p/tower/", "via": "", "real_tags": ["电脑", "笔记本电脑", "framework"]}, {"category": "", "categoryclass": "", "imagename": "cc913af2e24e0d5d45110d4e8c7df8fb.png", "infoid": 1002048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EFF使命的一个核心部分是透明和获取信息，因为我们知道，在一个受法治约束的国家，公众必须有能力了解法律及其如何应用。这就是为什么默认规则是公众必须完全访问法庭记录-即使这些记录包含令人不快的细节。任何对这一规则的背离都必须是狭隘的和有充分理由的。\n但诉讼当事人和法官并不总是严格维护这一原则。例如，当布莱恩·法戈(Brian Fargo)起诉詹妮弗·特哈斯(Jennifer Tejas)涉嫌诽谤Instagram帖子时，他要求法院封存他的文件中包含这些帖子、对其他人的引用和私人医疗信息的部分。法院批准了法戈的请求，几乎没有解释，也没有明显的谨慎。\n这种做法为其他国家树立了一个危险的先例。公众有权知道法院认为什么是诽谤。因此，在加州大学洛杉矶分校法学院第一修正案诊所的帮助下，EFF和第一修正案联盟采取行动，解封了包含Instagram帖子和对其他人的引用的记录。\n法官拒绝了这一请求。我们没有被吓倒，我们上诉了-并赢得了胜利(PDF下载)。上诉法院指责初审法院未能充分证明其印章命令的合理性，也同样未能确保命令被狭隘地定制，以便尽可能少地向公众隐瞒。虽然它确实允许一些信息保持保密-与私人医疗记录相关的信息可以对公众保密，一些展品应该使用化名以保护第三方的隐私-但它下令释放其余的信息。\n我们感谢第一修正案诊所在维护公众知情权方面的帮助。我们希望这起案件能提醒法官和诉讼人在未来认真对待这一权利。", "note_en": "A core part of EFF’s mission is transparency and access to information, because we know that in a nation bound by the rule of law, the public must have the ability to know the law and how it is being applied. That’s why the default rule is that the public must have full access to court records—even if those records contain unsavory details. Any departure from that rule must be narrow and well-justified.\n But litigants and judges aren’t always rigorous in upholding that principle. For example, when Brian Fargo sued Jennifer Tejas for allegedly defamatory Instagram posts, he asked that the court seal portions of his filings that contained those posts, references to other people and private medical information. The court granted Fargo’s request, with little explanation or apparent care.\n That approach set a dangerous precedent for others. The public has a right to know what courts consider defamatory. So, with help from the First Amendment Clinic at UCLA School of Law, EFF and the First Amendment Coalition moved to unseal the records containing the Instagram posts and references to other people.\n The judge denied that request.  Undeterred, we appealed–and won (PDF download). The appeals court chided the trial court for its failure to adequately justify its sealing order, and its equal failure to make sure the order was narrowly tailored so that as little as possible would be hidden from the public. While it did allow some information to remain sealed–information related to private medical records can be kept from the public, and pseudonyms should be used in some exhibits to protect the privacy of third parties–it ordered the rest released.\n We are grateful to the First Amendment Clinic for their help in vindicating the public’s right to know. And we hope this case will serve as a reminder to judges and litigants to take that right seriously in the future.", "posttime": "2020-05-14 08:53:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法院,court,公众", "title": "法院赋予公众查阅法院文件的权利", "title_en": "Court Upholds Public Right of Access To Court Documents", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/05/court-upholds-public-right-access-court-documents", "via": "", "real_tags": ["法院", "court", "公众"]}]