[{"category": "", "categoryclass": "", "imagename": "fbb4623ea58f7ba7e6d686bbc34244ad.jpeg", "infoid": 1008070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "之前的支持者包括OVH的创始人Octave Klaba，KelDoc的创始人Eduardo Ronzano，Fotolia的创始人Thibaud Elzière，Stupeflix的创始人Nicolas Steegmann，Teads的联合创始人Julien Romanetto&amp；Frédéric Montagnon，Dataiku的创始人Florian Douetteau，以及Michaël Benabou和Dominique。\napi.video由Libcast直播和点播SaaS视频平台的前创始人兼首席执行官塞德里克·蒙特特(Cédric Montet)于2019年创立，旨在完成将现代视频功能整合到网站和移动应用程序中所需的大量繁重工作，进而帮助发展其所称的“交易式视频通信”市场。\n这家法国公司解释说：“这可能包括度假者拍摄的视频评论，上传到Airbnb之类的网站上；发布到同行学习和教育网站上的视频片段，帮助解释课程的复杂部分；或者在通常以文本为导向的协作平台上发布视听内容，”这家法国公司解释说。\n为了实现这一点，api.video的平台承诺将现代在线视频的多步骤流程抽象成一个提供转码、托管、交付和分析的单一API。或者，简单地说，这家初创公司想成为视频领域的Twilio。\nMontet告诉我：“今天的大多数应用程序和网站都是基于共享文本和图像的，因为到目前为止，视频实在太复杂了，无法实现。”无论是酒店评论、约会网站、电子学习、协作和客户服务平台还是在线市场，视频都提供了文本和图像无法传达的深度。\n然而，问题是许多公司，特别是那些没有视频业务核心的公司，由于复杂性和观众需求的增加，一直没有推出这样的功能。\nApi.video不仅使任何公司、任何规模和类型的开发人员仅用几行代码就能释放视频的潜力，从而解决了这些问题。但它提供了完整的端到端解决方案，具有透明的定价计划和单一账单。“蒙特特解释说。\n他说，其结果是，无论他们的公司使用什么系统或需要什么类型的内容，开发人员都可以“大规模”地构建事务性视频通信。\n为此，蒙特特表示，来自Blossom Capital和Kima Ventures的资金将用于在国际上发展api.video团队，并“渗透新市场”。\n我们还在寻求聘用最优秀的人才，以实现我们的超低延迟流媒体和建立全球EDGE基础设施的技术目标。我们将为流行的平台添加开源插件，比如WordPress、电子学习环境和协作平台。我们的目标是继续以最流行的语言提供优秀的文档和本地SDK，帮助我们的用户轻松集成视频。“", "note_en": "Previous backers include Octave Klaba (founder of OVH), Eduardo Ronzano (founder of KelDoc), Thibaud Elzière (founder of Fotolia), Nicolas Steegmann (founder of Stupeflix), Julien Romanetto &amp; Frédéric Montagnon (co-founders of Teads) Florian Douetteau (founder of Dataiku) and Michaël Benabou and Dominique Romano (Veepee).\n Founded in 2019 by Cédric Montet, the former founder and CEO of Libcast’s live streaming and on-demand SaaS video platform, api.video aims to do a lot of the heavy lifting required to incorporate modern video functionality into websites and mobile apps, and in turn help grow the market for what it calls “transactional video communications”.\n  “This could include video reviews filmed by holidaymakers uploaded to the likes of airbnb; clips posted to peer-learning, educational sites that help explain complex parts of a curriculum; or audiovisual contents in collaborative platforms that are usually text-oriented,” explains the French company.\n To make this possible, api.video’s platform promises to abstract the multi-step processes of modern online video into a a single API that offers transcoding, hosting, delivery and analytics. Or, put simply, the startup wants to become the Twilio for video.\n “Most apps and websites today are based around sharing text and images, because video – until now – has simply been too complex to implement,” Montet tells me. “Whether it’s for hotel reviews, dating sites, e-learning, collaborative and customer service platforms or online marketplaces, video offers the ability to convey depth beyond what text and images can”.\n However, the problem that many companies, particularly those that don’t have video at the core of the business, have held back from introducing such features due to complexity and despite increasing demand from audiences.\n “Api.video solves these problems by not only enabling developers within any company, of any size and type, to unlock the potential of video with only a few lines of code. But it offers a complete end-to-end solution with a transparent pricing plan and a single bill,” explains Montet.\n The result is that developers can build transactional video communications “at scale,” he says, regardless of the systems their companies use or the type of content they need.\n To that end, Montet says the funding from Blossom Capital and Kima Ventures will be used to grow the api.video team internationally and to “penetrate new markets”.\n “We’re also looking to hire the best talent to achieve our tech goals of ultra-low latency streaming and building a global EDGE Infrastructure. We’ll add open-source plugins for popular platforms, such as WordPress, e-learning environments and collaborative platforms. We aim to keep providing an excellent documentation and native SDK in the most popular languages to help our users to integrate video without hassle”.", "posttime": "2020-06-25 13:07:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,视频,video", "title": "\n法国api.video筹集550万美元让开发者更容易添加视频功能", "title_en": "\n\t\t\t\tFrance’s api.video raises $5.5M to make it easier for developers to add video features\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/24/api-video/", "via": "", "real_tags": ["开发", "视频", "video"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我不得不承认，在经历了半年的大流行、隔离和社交疏远之后，我表现出了船舱热…的迹象。在我的情况下，其中一半是相当字面上的。“是的，我在山里的一个真正的小屋里。”“不，我没有发烧。”“耶！”至少目前，我是健康的…。对于一个71岁的走样的人来说，至少是…。尽我所能保持这种状态。\n至少，强制与世隔绝帮助了我写作。我每天都花很长时间在冬天的风上，稳步前进。我昨天读完了新的一章，三天前又读完了一章，前一周又读完了一章。但不是，这并不意味着这本书明天就会完成或下周出版。我认为这将是一本巨著，我还有很长的路要走。*请不要相信任何喜欢解析每一本书的点击诱饵网站。*但这并不意味着这本书明天就会完成或下周出版。我还有很长的路要走。*请不要相信任何喜欢解析每一本书的点击诱饵网站。*但这并不意味着这本书明天就会完成或下周出版。我还有很长的路要走。\n当科尼西兰岛由于流行病被迫进入虚拟世界，我不得不取消与帕里斯和我的奴才…去惠灵顿长途旅行的计划(令人兴奋的计划)时，我感到心碎。但这片乌云中肯定有一线希望。我现在最不需要的就是长时间的中断，这可能会让我失去所有建立起来的动力。：我明年总是可以去惠灵顿，那时我希望新冠肺炎和冬天的风都能做好。\n我仍然计划主持雨果奖，并履行我在WorldCon上的所有其他祝酒词精湛职责，并已经开始为颁奖典礼预先录制一些片段(这是一个明智的预防措施，因为我对Zoom和Skype之类的东西没有希望)，但这比飞往世界的另一端要少得多，也不会让人分心。在录制间隙，我会回到维斯特洛。最近我一直在拜访瑟曦、阿莎、提利昂、巴里斯坦爵士，这让我振作起来，但总而言之，我对事情的进展感到满意。\n当然，我真的希望他们能走得更快。早在1999年，当我深入撰写《刀剑风暴》的时候，我平均每个月要写150页左右的手稿。但我担心我再也不会回到那个速度了。现在回想起来，我不确定自己当时是怎么做到的。我确实是在发甲烧。\n无论如何，…。当我不写作或不想写作的时候，我就看电视和看书。美国出版商寄给我一大堆书，所以我的“待读”书堆总是在增长，不管我消费了多少书。当然，我也会买书。我忍不住，我是个书迷。史蒂芬·金(Stephen King)的新书“如果它流血了”是最近的最爱之一。我喜欢金在他的小说之间不时推出的这些中篇小说集。但这本书有一个新的霍尔顿。但是还有一个故事叫“老鼠”，讲的是一位作家试图在一间与世隔绝的小屋里完成一部小说，而…。啊…。出于某种原因，我产生了相当强烈的共鸣。有一次，作者在试图计算一个警长的门廊上能装下多少把摇椅时出轨了，那就是对我一直经历的那种事情的恰到好处的描述。史蒂夫的主人公在一只死老鼠成为他的缪斯女神时得到了一些帮助。但到目前为止，我的小屋里没有老鼠。希德去年确实抓到了几只老鼠，但她把它们当成了宠物。--还有蒂米和。(请不要给我发关于老鼠危险的长篇电子邮件，我们都知道这些东西)。\n另一本让我大吃一惊的新书是艾米丽·圣约翰·曼德尔的新书“玻璃旅馆”。几年前，她写了一部(嗯哼)大流行后的科幻小说，名为11号站，我当时很喜欢这部小说，现在虔诚的希望不会被证明是预言。这是我那一年最喜欢的小说，我认为它当之无愧地赢得了雨果和星云奖。遗憾的是，它没有做到这一点。但是我让艾米丽在我的剧院参加了一个作家活动，这很棒，并抢购了她之前的三部小说。我也真的很喜欢那些。现在又来了她的最新作品“玻璃旅馆”。“不，这部不是科幻或奇幻。”事实上，除了一部非常好的小说，我很难说出它是什么。这是关于偏远地区的一家酒店，在那里工作的人，住在那里的人，关于庞氏骗局，关于艺术，关于音乐，关于一个功能失调的家庭，还有…。哦，嗯，我不知道它是关于什么的，但我知道一旦我开始阅读，我就停不下来了。“当人们把一本书描述为”翻页人“时，通常他们谈论的是有很多情节的小说，而曼德尔肯定没有，但不知何故，她却让我不顾一切地翻页。而且她写得非常漂亮。*她的散文并不夸张，也没有过于华丽，就像太多被称为“文体师”的作家一样，而是…。它是可爱的，令人难以忘怀的，令人回味的，身临其境的…。我想是的\n但在山上，所有这一切似乎都很遥远，而且无论如何，大部分都已经断断续续地停止了，直到科维德离开。\n大多数情况下，只有我在维斯特洛，偶尔会在一本伟大的书中去其他地方旅行。\n现在你得原谅我了。艾莉亚先生打来电话。我想她是想杀人。", "note_en": "I have to confess, after half a year of pandemic, quarantine, and social distancing, I am showing signs of cabin fever… half of which is quite literal in my case.  Yes, I am in an actual cabin in the mountains.   No, I have no fever.    Yay!   For the present at least, I am healthy… for an out-of-shape guy of 71, at least … and doing all I can to stay that way.\n If nothing else, the enforced isolation has helped me write.   I am spending long hours every day on THE WINDS OF WINTER, and making steady progress.   I finished a new chapter yesterday, another one three days ago, another one the previous week.   But no, this does not mean that the book will be finished tomorrow or published next week.   It’s going to be a huge book, and I still have a long way to go.   Please do not give any credence to any of the click-bait websites that like to parse every word of my posts as if they were papal encyclicals to divine hidden meanings.\n I was heartbroken when CoNZealand was forced to go virtual due to the pandemic and I had to cancel my plans (exciting plans) for a long trip down to Wellington with Parris and my minions… but there is definitely a silver lining in that cloud.   The last thing I need right now is a long interruption that might cost me all the momentum I have built up.   I can always visit Wellington next year, when I hope that both Covid-19 and THE WINDS OF WINTER will be done.\n I still plan to host the Hugo Awards and fulfill all the rest of my toastmasterly duties for worldcon, and have started pre-recording some bits for the ceremony (a wise precaution, since I am hopeless with Zoom and Skype and like things), but that is a lot less time-consuming and distracting than flying to the other end of the world.   In between tapings, I return to Westeros.   Of late I have been visiting with Cersei, Asha, Tyrion, Ser Barristan, and Areo Hotah.   I will be dropping back into Braavos next week.    I have bad days, which get me down, and good days, which lift me up, but all in all I am pleased with the way things are doing.\n I do wish they would go faster, of course.   Way way back in 1999, when I was deep in the writing of A STORM OF SWORDS, I was averaging about 150 pages of manuscript a month.   I fear I shall never recapture that pace again.   Looking back, I am not sure how I did it then.    A fever indeed.\n Anyway… when I am not writing, or thinking about writing, I am watching television and reading.    Publishers send me huge piles of books, so my “to be read” pile is always growing, no many how many books I consume.   Of course, I also buy books as well.   Cannot help it, I am a book junkie.   The new Stephen King collection IF IT BLEEDS was one recent favorite.  I love these novella collections that King comes out with from time to time between his novels.   This one features a new Holly Gibney story, and it is always great to see that character again… but there’s also a story called “Rat” about a writer trying to finish a novel in an isolated cabin which… ah… resonated with me rather strongly for some reason.   One bit, where the writer gets derailed trying to figure out how many rocking chairs a sheriff could fit on his porch, was a dead-on depiction of the kind of stuff I go through all the time.   Steve’s protagonist gets some help when a dead rat turns up to be his muse.  So far, no rats at my cabin.    Sid did catch a couple of mice last year, but she made pets of them.  And Timmy and TomTom were no help whatsoever with WINDS.   (Please don’t send me long emails about the dangers of mice, we know all that stuff).\n Another recent book that really knocked me out was THE GLASS HOTEL, the latest by Emily St. John Mandel.    A few years back, she wrote a (ahem) post-pandemic SF novel called STATION ELEVEN which I loved at the time and now devoutly hope is not going to prove prophetic.  It was my favorite novel of that year, and I thought it deserved to win the Hugo and the Nebula.   Which it didn’t, alas.   But I had Emily at my theatre for an author event, which was great, and snapped up her three earlier novels.  I really liked those too.   Now comes her latest, THE GLASS HOTEL.  No, this one is not science fiction or fantasy.  In fact, I would be hard pressed to say what it  is except a damn fine novel.   It is about a hotel in a remote location, the people who work there, the people who stay there, it is about a Ponzi scheme, and art, and music, and a dysfunctional family, and… oh, well, I don’t know what it is about, but I do know that once I started reading, I could not stop.   When people describe a book as a “page turner,” usually they are talking about novels that have a lot of plot, which Mandel definitely does not, yet somehow she keeps me turning pages regardless.   And she writes just beautifully.   Her prose is not overblown or excessively ornate, as is the case with too many writers who are known as “stylists,” but… it is just lovely, haunting and evocative and immersive…   I guess you can say I am a big Emily St. John Mandel fanboy.   I look forward to whatever she writes next.\n There are other things going on in my life as well.   I bought a railroad… well, I bought a third of a railroad.   See the post below.   Hollywood has slowed to a crawl thanks to the pandemic, but THE HOUSE OF THE DRAGON is still flying along wonderfully, thanks to Ryan Condal and his writers, and the tireless Ti Mikkel.   With my producer hat on, I am still involved in trying to bring Nnedi Okorafor’s brilliant WHO FEARS DEATH to the small screen, and relaunch the WILD CARDS tv project.   We have feature films in development adapted from my stories “Sandkings” and “The Ice Dragon” and “The Lost Lands,” television shows in development based on works by Roger Zelazny and Tony Hillerman, there are the secret shorts we’re doing that… well, no, if I spilled that, it wouldn’t be secret.\n But up here on the mountain, all of that that seems very distant, and much of it has stuttered to a halt in any case, until Covid goes away.\n Mostly, it’s just me in Westeros, with occasional side trips to other places in the pages of a great book.\n Now you will have to excuse me.   Arya is calling.   I think she means to kill someone.", "posttime": "2020-06-25 13:05:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "写作,writing", "title": "写作、阅读、写作", "title_en": "Writing, Reading, Writing", "transed": 1, "url": "https://georgerrmartin.com/notablog/2020/06/23/writing-reading-writing/", "via": "", "real_tags": ["写作", "writing"]}, {"category": "", "categoryclass": "", "imagename": "c6f11ab0d7dcbb21eac870893d42f0fc.jpg", "infoid": 1008068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可以在我们的网站上在线观看配有英语、法语、德语和其他语言字幕的流行东欧电影。\n收藏包括在不同的欧洲和世界电影节上获得多个奖项的流行东欧电影，以及仅可在我们的网站上观看或下载的稀有发现。", "note_en": "You can watch popular Eastern European movies with subtitles in English, French, German and other languages on our site online.\n The collection includes popular Eastern European films, that received multiple Awards at the different European and World Film Festivals, and rare finds, that are available for viewing or downloading only at our site.", "posttime": "2020-06-25 13:05:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,东欧,european,流行", "title": "东欧电影", "title_en": "Eastern European Movies", "transed": 1, "url": "https://easterneuropeanmovies.com/", "via": "", "real_tags": ["电影", "东欧", "european", "流行"]}, {"category": "", "categoryclass": "", "imagename": "4a3c99b508ffd89bf8d4ce0654a9d03e.jpg", "infoid": 1008067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莫斯科-对男孩们来说，这只是一种甜蜜的款待。对于他们的父母，著名的医学研究人员来说，1959年那天在他们莫斯科的公寓里发生的事情是一次至关重要的实验，无数人的生命岌岌可危-他们自己的孩子就像豚鼠一样。\n“我们排成了一条线，”彼特·朱马科夫博士在接受采访时回忆道，当时他只有7岁。在每个等待的嘴里，一位家长突然拿出一块掺有减弱的脊髓灰质炎病毒的方糖-一种针对一种可怕疾病的早期疫苗。“我是从我母亲手中吃的。”\n如今，同样的疫苗再次受到研究人员的关注--其中包括长大后都成了病毒学家的兄弟们--作为对抗新型冠状病毒的可能武器，这在一定程度上是基于他们的母亲玛丽娜·沃罗希洛娃(Marina Voroshilova)博士所做的研究。\n沃罗希洛娃博士证实，脊髓灰质炎活疫苗有一个意想不到的好处，事实证明，这可能与当前的大流行有关：接种疫苗的人在接种疫苗后一个月左右的时间里没有患上其他病毒性疾病。她开始每年秋天给男孩们接种脊髓灰质炎疫苗，以预防流感。\n现在，几个国家的一些科学家正对改变现有疫苗的用途产生浓厚兴趣，比如一种活的脊髓灰质炎病毒疫苗和另一种结核病疫苗，看看它们是否能至少提供对冠状病毒的暂时抵抗力。俄罗斯人就是其中之一，他们借鉴了疫苗研究的悠久历史-以及研究人员的悠久历史，他们并不担心被嘲笑为疯狂的科学家，在自己身上进行实验。\n专家建议，这个想法-就像许多其他提出的应对大流行的方法一样-必须非常谨慎地对待。\n宾夕法尼亚大学佩雷尔曼医学院(Perelman School Of Medicine At The University Of Pennsylvania)教授、轮状病毒疫苗的共同发明人保罗·A·奥菲特(Paul A.Offit)博士在接受电话采访时说，“有了一种能诱导特定免疫力的疫苗，我们的日子会好得多。”他说，与定制疫苗相比，改变用途的疫苗带来的任何好处都“寿命短得多，而且不完整”。\n不过，罗伯特·加洛(Robert Gallo)博士是测试脊髓灰质炎疫苗对抗冠状病毒的主要倡导者之一，他说，重新调整疫苗的用途是“免疫学中最热门的领域之一”。马里兰大学医学院(University Of Marland School Of Medicine)人类病毒学研究所(Institute Of Human Virroology At The University Of Marland School Of Medicine)所长加洛博士说，即使减弱的脊髓灰质炎病毒只有一个月左右的免疫力，“它也能帮你渡过难关，而且会拯救很多人的生命。”\n数十亿人接种了脊髓灰质炎病毒活疫苗，几乎消灭了这种疾病。然而，在极其罕见的情况下，疫苗中使用的弱化病毒可能会变异成更危险的形式，导致脊髓灰质炎并感染其他人。据估计，瘫痪的风险为270万疫苗中就有一例。\n出于这些原因，公共卫生组织表示，一旦一个地区消除了自然发生的脊髓灰质炎，就必须停止常规使用口服疫苗，就像美国20年前所做的那样。\n本月，美国国家过敏和传染病研究所推迟了由加洛博士的研究所、克利夫兰诊所、布法罗大学和罗斯威尔公园综合癌症中心设计的一项研究，该研究以医护人员为对象，测试脊髓灰质炎活疫苗对抗冠状病毒的有效性。据熟悉这项研究应用的研究人员说，该机构提出了安全方面的担忧，包括活的脊髓灰质炎病毒进入供水系统并感染其他人的可能性。NI.A.I.D.的新闻办公室拒绝置评。\n但其他国家正在向前迈进。脊髓灰质炎疫苗的试验已经在俄罗斯开始，并计划在伊朗和几内亚比绍进行。\n针对冠状病毒的特定疫苗将训练免疫系统以特定的病毒为目标，世界各地正在开发超过125种候选疫苗。\n相比之下，改变用途的疫苗使用活的但减弱的病毒或细菌来刺激更广泛的先天免疫系统，以对抗病原体，至少是暂时的。\n第一种脊髓灰质炎疫苗是由美国人乔纳斯·索尔克博士开发的，它使用了“灭活”病毒颗粒--灭活的病毒颗粒。它必须注射，这是较贫穷国家开展免疫活动的障碍。\n1955年，当这种疫苗被广泛引入时，阿尔伯特·萨宾(Albert Sabin)博士正在测试一种使用活的但减毒的脊髓灰质炎病毒的疫苗，这种病毒可以口服。但在美国，由于Salk疫苗已经在使用，当局不愿承担进行活病毒试验的感知风险。\n萨宾将他的三种减毒病毒株交给了苏联一对已婚的病毒学家，米哈伊尔·楚马科夫(Mikhail Chumakov)博士和沃罗希洛娃(Voroshilova)博士。朱马科夫博士是一家脊髓灰质炎研究所的创始人，现在以他的名字命名。\n朱马科夫博士自己接种了疫苗，但一种主要针对儿童的药物需要儿童试验对象，所以他和沃罗希洛娃博士给了他们的三个儿子和几个侄女和侄子。\n他们的实验使朱马科夫博士能够说服苏联高级官员阿纳斯塔斯·米科扬(Anastas Mikoyan)继续进行更广泛的试验，最终导致了一种在世界各地使用的口服脊髓灰质炎疫苗的大规模生产。1961年，在苏联证明口服脊髓灰质炎疫苗是安全的后，美国开始接种脊髓灰质炎疫苗。\n“必须有人是第一个，”彼得·朱马科夫博士在一次采访中说。“我从来没有生气过。我觉得有这样一位父亲是非常好的，他足够自信自己所做的事情是正确的，并且肯定不会伤害自己的孩子。“。\n他说，如果说有什么不同的话，那就是他的母亲对对男孩进行测试更加热情。\n“她绝对相信没什么好怕的，”他说。\n一个典型的健康儿童是十几种呼吸道病毒的宿主，这些病毒几乎不会引起疾病，或者根本不会引起疾病。但Voroshilova博士在儿童接种脊髓灰质炎疫苗后不久就没有在他们身上发现任何一种。\n全国各地的科学家试图找出过滤微细颗粒物效果很好的日常材料。在最近的测试中，HEPA炉过滤器得分很高，真空吸尘器袋、类似法兰绒睡衣的布料以及600支枕套的得分也很高。测试的其他材料包括分层的咖啡过滤器、围巾和头巾。这些粒子得分较低，但仍捕获了一小部分粒子。\n英国运动医学杂志(British Journal Of Sports Medicine)网站本月发表的一篇评论文章指出，运动时遮住脸“会带来潜在的呼吸受限和不适问题”，需要“权衡益处和可能的不良事件”。美国运动理事会(American Council On Exercise)主席兼首席科学官塞德里克·X·布莱恩特(Cedric X.Bryant)说，口罩确实会改变运动。美国运动理事会是一个非营利性组织，为运动研究提供资金，并为健身专业人士提供认证。“根据我的个人经验，”他说，“当你戴上口罩时，心率会在相同的相对强度下更高。”新墨西哥大学运动科学教授Len Kravitz说，有些人在戴着面具进行熟悉的锻炼时也会感到头晕目眩。\n根据英国科学家的说法，类固醇地塞米松是第一种被证明可以降低重病患者死亡率的治疗方法。这种药物似乎可以减少免疫系统引起的炎症，保护组织。在这项研究中，地塞米松使使用呼吸机的患者的死亡人数减少了三分之一，使用氧气的患者的死亡人数减少了五分之一。\n冠状病毒紧急救援方案给了许多美国工人带薪假期，如果他们因为病毒需要休假的话。它给合格的工人两周的带薪病假，如果他们生病，被隔离，或者寻求冠状病毒的诊断或预防性护理，或者如果他们正在照顾生病的家庭成员。它给那些照顾孩子的人12周的带薪假期，这些孩子的学校关闭了，或者因为冠状病毒而无法提供托儿服务。这是美国第一次有广泛的联邦授权带薪休假，包括通常不会获得这种福利的人，比如兼职和零工经济工作者。但这项措施至少排除了一半的私营部门员工，包括美国最大雇主的员工，并给予小雇主拒绝休假的巨大回旋余地。\n到目前为止，证据似乎表明确实如此。4月份发表的一篇被广泛引用的论文表明，人们在冠状病毒症状出现前两天左右传染性最强，并估计44%的新感染是由于尚未显示出症状的人传播的。最近，世界卫生组织的一位顶级专家表示，没有症状的人传播冠状病毒的情况“非常罕见”，但她后来收回了这一说法。\n接触受污染的物体，然后将细菌感染我们自己，这并不是典型的病毒传播方式。但这是有可能发生的。对流感、鼻病毒、冠状病毒和其他微生物的多项研究表明，包括新型冠状病毒在内的呼吸道疾病可以通过接触受污染的表面传播，特别是在日托中心、办公室和医院等地方。但是，要让这种疾病以这种方式传播，必须发生一系列漫长的事件。保护自己免受冠状病毒感染的最好方法--无论是表面传播还是密切的人类接触--仍然是社交距离、洗手、不碰脸和戴口罩。\n欧洲科学家的一项研究首次证明了基因变异和新冠肺炎(冠状病毒引起的疾病)之间存在强烈的统计联系。根据这项新的研究，拥有A型血的患者需要氧气或使用呼吸机的可能性增加了50%。\n美国劳工部6月5日表示，5月失业率降至13.3%，这是美国就业市场的意外改善，因为就业反弹的速度快于经济学家的预期。4月份失业率达到14.7%，是二战后政府开始记录官方统计数据以来的最高水平，经济学家此前预测失业率将增加到20%。但失业率反而下降，雇主在4月份失去了2000多万个工作岗位后，又增加了250万个工作岗位。\n常见症状包括发烧、干咳、疲劳、呼吸困难或呼吸急促。这些症状中的一些与流感的症状重叠，使检测变得困难，但流鼻涕和鼻窦堵塞不太常见。疾控中心还增加了寒战、肌肉疼痛、喉咙痛、头痛和新的味觉或嗅觉丧失作为要注意的症状。大多数人在接触后五到七天就会生病，但症状可能会在短短两天或长达14天内出现。\n如果航空旅行是不可避免的，你可以采取一些措施来保护自己。最重要的是：勤洗手，不要再摸你的脸。如果可能的话，选择靠窗的座位。埃默里大学的一项研究发现，在流感季节，坐在飞机上最安全的地方是靠窗的，因为坐在靠窗座位的人与可能生病的人接触较少。对坚硬的表面进行消毒。当你坐到座位上，双手干净后，用消毒湿巾清洁座椅的硬表面，如头枕和扶手、安全带扣、遥控器、屏幕、座椅靠背口袋和托盘桌子。如果座椅很硬，不透气，或者是皮革或人造革的，你也可以把它擦干净。(在软垫座椅上使用湿巾可能会导致座椅湿润，传播细菌，而不是杀死他们。)。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n在沃罗希洛娃博士的监督下，从1968年到1975年，苏联进行了一项涉及32万人的大型研究，发现接种了其他疫苗(包括口服脊髓灰质炎疫苗)的人的流感死亡率有所降低。\n她在苏联赢得了认可，因为她展示了疫苗接种和对病毒性疾病的广泛保护之间的联系，可能是通过刺激免疫系统。\nVoroshilova博士和Chumakov博士的工作显然影响了他们儿子的思想和健康--他们不仅都成为了病毒学家，还接受了自我检测。\n今天的彼得·朱马科夫博士是俄罗斯科学院恩格尔哈特分子生物学研究所的首席科学家，也是克利夫兰一家用病毒治疗癌症的公司的联合创始人。他已经开发了大约25种用于治疗肿瘤的病毒-他说，所有这些病毒他都在自己身上进行了测试。\n他现在还在服用他在自己的实验室种植的脊髓灰质炎疫苗，作为对冠状病毒的可能保护。\n阿列克谢·朱马科夫(Alexei Chumakov)博士在他的父母用他的兄弟做实验时还没有出生，他职业生涯的大部分时间都在洛杉矶雪松-西奈大学(Cedars-Sinai)担任癌症研究人员。在莫斯科工作期间，他开发了一种戊型肝炎疫苗，并首先在自己身上进行了试验。\n“这是一个古老的传统，”他说。“当第一个重载通过时，工程师应该站在桥下。”\n康斯坦丁·朱马科夫(Konstantin Chumakov)博士是美国食品和药物管理局疫苗研究和审查办公室的副主任，该办公室将参与批准任何冠状病毒疫苗在美国人使用。他还与加洛博士等人合著了最近发表在“科学”杂志上的一篇文章，这篇文章促进了对现有疫苗再利用的研究。\n在一次采访中，康斯坦丁·楚马科夫博士说，他不记得在1959年吃过方糖--当时他只有5岁--但他赞同父母的实验，认为这是拯救无数瘫痪儿童的一步。\n“这是正确的做法，”他说。“现在，会有一些问题，比如‘你得到道德委员会的许可了吗？’”", "note_en": "MOSCOW — To the boys, it was just a sugary treat. To their parents, prominent medical researchers, what happened in their Moscow apartment that day in 1959 was a vital experiment with countless lives at stake — and their own children as guinea pigs.\n “We formed a kind of line,” Dr. Peter Chumakov, who was 7 at the time, recalled in an interview. Into each waiting mouth, a parent popped a sugar cube laced with weakened poliovirus — an early vaccine against a dreaded disease. “I was eating it from the hands of my mother.”\n Today, that same vaccine is gaining renewed attention from researchers — including those brothers, who all grew up to be virologists — as a possible weapon against the new coronavirus, based in part on research done by their mother, Dr. Marina Voroshilova.\n Dr. Voroshilova established that the live polio vaccine had an unexpected benefit that, it turns out, could be relevant to the current pandemic: People who got the vaccine did not become sick with other viral illnesses for a month or so afterward. She took to giving the boys polio vaccine each fall, as protection against flu.\n Now, some scientists in several countries are taking a keen interest in the idea of repurposing existing vaccines, like the one with live poliovirus and  another for tuberculosis, to see if they can provide at least temporary resistance to the coronavirus. Russians are among them, drawing on a long history of vaccine research — and of researchers, unconcerned about being scoffed at as mad scientists, experimenting on themselves.\n  Experts advise that the idea — like many other proposed ways of attacking the pandemic — must be approached with great caution.\n “We are much better off with a vaccine that induces specific immunity,” Dr. Paul A. Offit, a co-inventor of a vaccine against the rotavirus and professor at the Perelman School of Medicine at the University of Pennsylvania, said in a telephone interview. Any benefits from a repurposed vaccine, he said, are “much shorter lived and incomplete,” compared with a tailored vaccine.\n Still, Dr. Robert Gallo, a leading advocate of testing the polio vaccine against coronavirus, said that repurposing vaccines is “one of the hottest areas of immunology.” Dr. Gallo, director of the Institute of Human Virology at the University of Maryland School of Medicine, said that even if the weakened poliovirus confers immunity for only a month or so, “it gets you over the hump, and it would save a lot of lives.”\n Billions of people have taken live poliovirus vaccine, nearly eradicating the disease. However, in extremely rare cases, the weakened virus used in the vaccine can mutate into a more dangerous form, cause polio and infect other people. The risk of paralysis is estimated at one in 2.7 million vaccinations.\n  For those reasons, public health organizations say that once a region eliminates naturally occurring polio, it must  stop routine use of oral vaccine, as the United States did 20 years ago.\n And this month, the National Institute of Allergy and Infectious Diseases delayed a study designed by Dr. Gallo’s institute, the Cleveland Clinic, the University of Buffalo and Roswell Park Comprehensive Cancer Center to test the effectiveness of live polio vaccine against coronavirus, using health care workers as subjects. The agency raised safety concerns, including the chance of live poliovirus making its way into water supplies and infecting others, according to researchers familiar with the study application. The press office of the N.I.A.I.D. declined to comment.\n But other countries are moving ahead. Trials with the polio vaccine  have begun in Russia, and are planned in Iran and Guinea-Bissau.\n  A specific vaccine for the coronavirus would be one that trains the immune system to target that virus specifically, and more than  125 vaccine candidates are under development around the world.\n Repurposed vaccines, in contrast, use live but weakened viruses or bacteria to stimulate the innate immune system more broadly to fight pathogens, at least temporarily.\n The first polio vaccine, developed by Dr. Jonas Salk, an American, used “inactivated” virus — particles of killed virus. It had to be injected, an obstacle to immunization campaigns in poorer countries.\n When that vaccine was widely introduced in 1955, Dr. Albert Sabin was testing a vaccine using live but attenuated poliovirus, which could be taken orally. But in the United States, with the Salk vaccine already in use, the authorities were reluctant to take the perceived risk of conducting live-virus trials.\n Dr. Sabin gave his three strains of attenuated virus to a married pair of virologists in the Soviet Union, Dr. Mikhail Chumakov, the founder of a polio research institute that now bears his name, and Dr. Voroshilova.\n Dr. Chumakov vaccinated himself, but a medicine intended primarily for children needed child test subjects, so he and Dr. Voroshilova gave it to their three sons and several nieces and nephews.\n Their experiment enabled Dr. Chumakov to persuade a senior Soviet official, Anastas Mikoyan, to proceed with wider trials, eventually leading to the mass production of an oral polio vaccine used around the world. The United States began oral polio vaccinations in 1961 after it was proved safe in the Soviet Union.\n  “Somebody has to be the first,” Dr. Peter Chumakov said in an interview. “I was never angry. I think it was very good to have such a father, who is confident enough that what he is doing is right and is sure he will not harm his children.”\n His mother was, if anything, even more enthusiastic about running the tests on the boys, he said.\n “She was absolutely sure there was nothing to be scared of,” he said.\n  A typical healthy child is host to a dozen or so respiratory viruses that cause little or no illness. But Dr. Voroshilova could not find any of them in children soon after they were immunized against polio.\n Scientists around the country  have tried to identify everyday materials that do a good job of filtering microscopic particles. In recent tests, HEPA  furnace filters scored high, as did vacuum cleaner bags, fabric similar to flannel pajamas and those of 600-count pillowcases. Other materials tested included layered coffee filters and scarves and bandannas. These scored lower, but still captured a small percentage of particles.\n  A  commentary published this month on the website of the British Journal of Sports Medicine points out that covering your face during exercise “comes with issues of potential breathing restriction and discomfort” and requires “balancing benefits versus possible adverse events.”  Masks do alter exercise, says Cedric X. Bryant, the president and chief science officer of the American Council on Exercise, a nonprofit organization that funds exercise research and certifies fitness professionals. “In my personal experience,” he says, “heart rates are higher at the same relative intensity when you wear a mask.” Some people also could experience lightheadedness during familiar workouts while masked, says Len Kravitz, a professor of exercise science at the University of New Mexico.\n  The steroid, dexamethasone, is  the first  treatment shown to reduce mortality in severely ill patients, according to scientists in Britain. The drug appears to reduce inflammation caused by the immune system, protecting the tissues. In the study, dexamethasone reduced deaths of patients on ventilators by one-third, and deaths of patients on oxygen by one-fifth.\n  The coronavirus emergency relief package gives many American workers paid leave if they need to take time off because of the virus. It gives qualified workers two weeks of paid sick leave if they are ill, quarantined or seeking diagnosis or preventive care for coronavirus, or if they are caring for sick family members. It gives 12 weeks of paid leave to people caring for children whose schools are closed or whose child care provider is unavailable because of the coronavirus.  It is the first time the United States has had widespread federally mandated paid leave, and includes people who don’t typically get such benefits, like part-time and gig economy workers. But  the measure excludes at least half of private-sector workers, including those at the country’s largest employers, and gives small employers significant leeway to deny leave.\n  So far, the evidence seems to show it does. A widely cited  paper published in April suggests that people are most infectious about two days before the onset of coronavirus symptoms and estimated that 44 percent of new infections were a result of transmission from people who were not yet showing symptoms. Recently, a top expert at the World Health Organization stated that transmission of the coronavirus by people who did not have symptoms was “very rare,”  but she later walked back that statement.\n  Touching contaminated objects and then infecting ourselves with the germs is not typically how the virus spreads. But it can happen. A number  of studies of flu, rhinovirus, coronavirus and other microbes have shown that respiratory illnesses, including the new coronavirus, can spread by touching contaminated surfaces, particularly in places like day care centers, offices and  hospitals. But a long chain of events has to happen for the disease to spread that way. The best way to protect yourself from coronavirus — whether it’s surface transmission or close human contact — is still social distancing, washing your hands, not touching your face and wearing masks.\n  A study by European scientists is the first to document a strong statistical link between  genetic variations and Covid-19, the illness caused by the coronavirus.  Having Type A blood was linked to a 50 percent increase in the likelihood that a patient would need to get oxygen or to go on a ventilator, according to the new study.\n  The unemployment rate fell to 13.3 percent in May, the Labor Department said on June 5, an unexpected improvement in the nation’s job market as hiring rebounded faster than economists expected. Economists had forecast the unemployment rate to increase to as much as 20 percent, after it hit 14.7 percent in April, which was the highest since the government began keeping official statistics after World War II. But the unemployment rate dipped instead, with employers adding 2.5 million jobs, after more than 20 million jobs were lost in April.\n  Common symptoms  include fever, a dry cough, fatigue and difficulty breathing or shortness of breath. Some of these symptoms overlap with those of the flu, making detection difficult, but runny noses and stuffy sinuses are less common.  The C.D.C. has also added chills, muscle pain, sore throat, headache and a new loss of the sense of taste or smell as symptoms to look out for. Most people fall ill five to seven days after exposure, but symptoms may appear in as few as two days or as many as 14 days.\n  If air travel is unavoidable,  there are some steps you can take to protect yourself. Most important: Wash your hands often, and stop touching your face. If possible, choose a window seat. A  study from Emory University found that during flu season, the safest place to sit on a plane is by a window, as people sitting in window seats had less contact with potentially sick people. Disinfect hard surfaces. When you get to your seat and your hands are clean, use disinfecting wipes to clean the hard surfaces at your seat like the head and arm rest, the seatbelt buckle, the remote, screen, seat back pocket and the tray table. If the seat is hard and nonporous or leather or pleather, you can wipe that down, too. (Using wipes on upholstered seats could lead to a wet seat and spreading of germs rather than killing them.)\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n A huge study in the Soviet Union of 320,000 people, from 1968 to 1975, overseen by Dr. Voroshilova, found reduced mortality from flu in people immunized with other vaccines, including the oral polio vaccine.\n She won recognition in the Soviet Union for demonstrating a link between vaccinations and broad protection against viral diseases, likely by stimulating the immune system.\n Dr. Voroshilova’s and Dr. Chumakov’s work clearly influenced their sons’ minds as well as their health — not only did all of them become virologists, they embraced self-testing as well.\n  Dr. Peter Chumakov today is the chief scientist at the Engelhardt Institute of Molecular Biology at the Russian Academy of Sciences and co-founder of a company in Cleveland that treats cancer with viruses. He has developed about 25 viruses for use against tumors — all of which, he said, he has tested on himself.\n He is also now taking polio vaccine, which he grows in his own laboratory, as possible protection against coronavirus.\n  Dr. Alexei Chumakov, who was not yet born when his parents experimented on his brothers, worked as a cancer researcher at Cedars-Sinai in Los Angeles for much of his career. While working in Moscow, he developed a vaccine against hepatitis E, which he tested first on himself.\n “It’s an old tradition,” he said. “The engineer should stand under the bridge when the first heavy load goes over.”\n Dr. Konstantin Chumakov is an associate director of the U.S. Food and Drug Administration’s Office of Vaccine Research and Review, which would be involved in approving any coronavirus vaccines for use in Americans. He is also a co-author, with Dr. Gallo and others, of a recent article in  the journal Science that promotes research into repurposing existing vaccines.\n In an interview, Dr. Konstantin Chumakov said he cannot remember eating the sugar cube back in 1959 — he was 5 years old — but approved of his parents’ experiment as a step toward saving untold numbers of children from paralysis.\n “It was the right thing to do,” he said. “Now, there would be questions, like ‘Did you get permission from the ethics committee?’”", "posttime": "2020-06-25 13:04:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,病毒,苏联,研究", "title": "几十年前的苏联研究暗示冠状病毒战略", "title_en": "Decades-Old Soviet Studies Hint at Coronavirus Strategy", "transed": 1, "url": "https://www.nytimes.com/2020/06/24/world/europe/vaccine-repurposing-polio-coronavirus.html", "via": "", "real_tags": ["冠状病毒", "病毒", "苏联", "研究"]}, {"category": "", "categoryclass": "", "imagename": "626a64ff32b4c59a8a05e43695383988.jpg", "infoid": 1008066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NASA局长吉姆·布里登斯廷(Jim Bridenstine)周三宣布，NASA将为其总部大楼命名玛丽·W·杰克逊(Mary W.Jackson)，她是航天局第一位非洲裔女性工程师，作为“隐藏人物”之一，她克服了猖獗的种族歧视和性别偏见，在太空时代的黎明帮助推动了航天局的发展。\n杰克逊的职业生涯始于20世纪50年代，她在弗吉尼亚州汉普顿NASA兰利研究中心(NASA‘s Langley Research Center)的一个独立计算单元开始了她的职业生涯。最近，作为2016年电影“隐藏的人物”(Hidden Figures)的背景，这里引起了全国的关注。这部电影是根据同名书籍改编的。\n去年，位于美国国家航空航天局(NASA)华盛顿特区总部前的E St.SW部分被重新命名为“隐藏人物之路”，以表彰早期在NASA工作的非洲裔美国女性。\n就在这一消息发布的同一天，一些航天行业人士开始推动NASA将密西西比州南部的斯坦尼斯航天中心(Stennis Space Center)更名，该中心以密西西比州资深参议员约翰·C·斯坦尼斯(John C.Stennis)的名字命名。斯坦尼斯是一名反对种族平等和学校合并的种族隔离主义者。与此同时，在乔治·弗洛伊德被警方拘留期间被杀后，全国各地的社区正在拆除南部邦联纪念碑。\n这一努力与更换海军航空母舰的举措不谋而合，航空母舰也是以这位已故参议员的名字命名的。\n在回应重新命名太空中心的请求时，NASA的一位发言人说，NASA“领导层对世界各地正在进行的种族主义、歧视和不平等的讨论很敏感”。我们注意到了关于重新命名设施的对话，并正在与NASA的工作人员就这一主题进行持续的讨论。NASA致力于促进多样性，我们将继续采取措施做到这一点。“。\n该机构表示，很荣幸以杰克逊的名字命名其总部大楼，布里登斯汀说，杰克逊是“帮助NASA将美国宇航员送入太空的一群非常重要的女性中的一员”。玛丽从来不接受现状，她帮助打破障碍，为非裔美国人和女性在工程和技术领域打开了机会。“。\n杰克逊的女儿卡罗琳·刘易斯(Carolyn Lewis)表示，她的家人对这一认可感到“荣幸”。她是一位科学家、人道主义者、妻子、母亲和开拓者，她为成千上万的人铺平了道路，不仅在NASA，而且在整个国家都是如此。\n作为一名有成就的数学家和航空航天工程师，杰克逊加入了NASA的前身-国家航空咨询委员会，最初是一名研究数学家，在兰利的同事多萝西·沃恩(Dorothy Vaughn)手下工作。在影片中，杰克逊由女演员贾内尔·莫纳饰演。\n在NASA，杰克逊继续进行风洞实验，帮助在风速几乎是音速两倍的环境中进行实验。\n她的导师建议她通过一个项目继续深造，这样她就可以从数学家晋升为工程师。但所需培训项目的课程是在一所隔离的高中举行的，她必须获得特别许可才能参加该项目。\n在她一直持续到1985年从NASA退休的传奇职业生涯中，她写了大量的研究报告，其中许多都集中在飞机周围的空气边界层的行为上。\n但在1979年，“看到玻璃天花板是规则，而不是兰利的女性专业人士的例外，她做出了最后的戏剧性的职业生涯改变，”根据NASA的一份传记。她离开了工程学，接受了减薪，在机会平等专家领域担任管理员，致力于提拔女性和少数族裔。", "note_en": "NASA will name its headquarters building Mary W. Jackson, the first female African American engineer at the space agency, who as one of the “Hidden Figures” overcame rampant racial discrimination and gender bias to help propel the agency at the dawn of the Space Age, NASA Administrator Jim Bridenstine announced Wednesday.\n Jackson began her career in the 1950s in a segregated computing unit at NASA’s Langley Research Center in Hampton, Va., that recently drew national attention as the setting for the 2016 movie “Hidden Figures,” based on a book by the same name.\n Last year, the portion of E St. SW in front of NASA’s D.C. headquarters was  renamed “Hidden Figures Way” in recognition of the African American women who worked at NASA in its early days.\n  The news came the same day some in the space industry began to  push NASA to change the name of the Stennis Space Center in southern Mississippi, named for John C. Stennis, the longtime senator from Mississippi, a segregationist  who opposed racial equality and the integration of schools. And it comes as communities across the country are taking down Confederate monuments in the wake of the killing of George Floyd while he was in police custody.\n  The push coincided with a move to  change the Navy’s aircraft carrier, also named for the late senator.\n In response to the request to rename the space center, a NASA spokesman said that agency “leadership is sensitive to the discussions of racism, discrimination and inequalities going on around the world. We are aware of conversations about renaming facilities and are having ongoing discussions with the NASA workforce on this topic. NASA is dedicated to advancing diversity and we will continue to take steps to do so.”\n  The agency said it was honored to name its headquarters building after Jackson, who Bridenstine said was “part of a group of very important women who helped NASA in getting American astronauts into space. Mary never accepted the status quo, she helped break barriers and open opportunities for African Americans and women in the field of engineering and technology.”\n  Carolyn Lewis, Jackson’s daughter, said her family was “honored” by the recognition. “She was a scientist, humanitarian, wife, mother and trailblazer who paved the way for thousands of others to succeed, not only at NASA but throughout this nation.”\n An accomplished mathematician and aerospace engineer, Jackson joined NASA’s predecessor, the National Advisory Committee for Aeronautics, starting as a research mathematician and working under fellow “Hidden Figure” Dorothy Vaughn at Langley. In the film, Jackson was portrayed by actress Janelle Monáe.\n  At NASA, Jackson went on to work with wind tunnel experiments, helping conduct experiments in an environment where the winds howled at nearly twice the speed of sound.\n Her supervisor suggested she further her education with a program that would allow her to be promoted from mathematician to engineer. But the classes for the required training program were held a segregated high school, and she had to obtain special permission to attend the program.\n  Over a storied career that lasted until her retirement from NASA in 1985, she wrote numerous research reports, many focused on the behavior of the boundary layer of air around airplanes.\n But in 1979, “seeing that the glass ceiling was the rule, rather than the exception for Langley’s female professionals, she made a final, dramatic career change,”  according to a NASA bio. She left engineering and took a pay cut to serve as an administrator in the Equal Opportunity Specialist field, working to promote females and minorities.", "posttime": "2020-06-25 13:03:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,重新命名,rename", "title": "NASA将为第一位黑人女工程师玛丽·W·杰克逊(Mary W.Jackson)重新命名总部", "title_en": "NASA to rename headquarters for Mary W. Jackson, first Black female engineer", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/06/24/nasa-rename-headquarters-mary-w-jackson-agencys-first-female-african-american-engineer/", "via": "", "real_tags": ["nasa", "重新命名", "rename"]}, {"category": "", "categoryclass": "", "imagename": "c064475a2f550ce096a3264c638ef3d6.jpg", "infoid": 1008065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "寻找开放的职位，并与400多家经过审查、资助的YC初创公司的创始人和招聘团队建立联系。", "note_en": "Find open roles and connect with founders and hiring teams of over 400 vetted, funded YC startups.", "posttime": "2020-06-25 12:32:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,作业,work,开放", "title": "YC在启动时的工作让您可以为数百个工程作业创建一个应用程序", "title_en": "YC's Work at a Startup lets you create one application for hundreds of eng jobs", "transed": 1, "url": "https://www.workatastartup.com/jobs?role=eng&utm_source=hn_jobs", "via": "", "real_tags": ["程序", "作业", "work", "开放"]}, {"category": "", "categoryclass": "", "imagename": "5d642a64d21f755d451c91f8b0eecad0.jpg", "infoid": 1008064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名黑人职业IT专业人士提出晋升，但却被要求帮助招聘另一名白人候选人。一名黑人谷歌工程师与一名白人同事对峙，要求出示他的身份证。一位拉丁裔项目经理指出，他快速成长的初创公司几乎都是白人，首席执行官的回应是告诉他邀请他的朋友来申请工作。一名黑人空军退伍军人同时在Twitter和Snap获得了职位，但当把他带到那里的招聘计划解散时，他两次都被解雇了。一名签约的黑人程序员被拒绝了一份全职工作，要求她培训不合格的白人接班人。\n这些只是时报在2019年秋季开始对68名科技工作者进行的一项调查中收集的歧视女性、LGBTQ确认的人和有色人种的一部分。\n要求为被警察杀害的黑人伸张正义的公众抗议活动给商界带来了清算，高管被迫辞职，公司全面改革内部政策，员工辞职以示抗议。\n对于科技行业来说，自2014年以来，这种清算一直在以某种形式进行。但是，尽管大型科技和风险投资公司承诺做得更好，但黑人和其他有色人种被视为求职者、员工和投资者的方式几乎没有改变。\n调查回应中详述的一些常见经历：忍受每天的微侵略性；感觉自己成为上级或外部批评者的目标；被炫耀出来为公司的多元化做法辩护；承担通常留给多样性和包容性官员的额外工作。受访者描述了有色人种在普通和高管职位上的代表性严重不足的公司，以及可能会对任何不是异性恋、顺性别的白人男性怀有敌意的企业文化。\n在68名回复调查的科技工作者中，有一半的人表示，他们认为科技对来自不同背景的人没有包容性。\n一位不愿透露姓名的Hulu员工表示：“技术是包容的，因为无论他们承认与否，他们都需要我们的人才和人力。”“这是一种容忍和接受的光谱。”\n这位Hulu员工说，在他们所在的领域，身份被低估的人发现自己通过一套不同的镜头来评判自己，一套忽略了特权问题的镜头。“没有上过大学的单身母亲被视为没有受过教育，而白人大学辍学生则被视为‘天才’，好像他太适合上大学了。”\n尽管在以白人为主的男性空间导航很困难，但只有不到三分之一的受访者表示，他们曾因为歧视或不包容而离开公司。一位在一家教育科技初创公司工作并不愿透露姓名的女性说：“当你的职位如此微薄时，你很少离开，因为下一份工作永远不一定会在那里。”\n这些经历反映了皮尤研究中心(Pew Research)2018年初的一项研究结果，该研究发现，超过60%的STEM领域的黑人在工作中受到歧视，50%的女性、44%的亚洲STEM工人和42%的拉丁裔也是如此。皮尤研究中心发现，歧视通常表现为八种形式中的一种：被拒绝升职、被拒绝工作、被重要任务拒之门外、在工作中多次受到轻视(或微侵犯)、从上级得到的支持比同事少、比做同样工作的同事拿到的工资少、感觉被孤立，以及被视为能力不足。\n与时报分享的故事既捕捉到了这些整齐的类别，也超越了这些类别。这些描述来自数十次采访，反映了女性、LGBTQ身份识别的人和科技行业有色人种的经历，既有共同的，也有独特的。\n2019年10月，Pinterest受到民权活动组织Color of Change的压力，要求其停止宣传和浪漫化前奴隶种植园作为婚礼场所。该组织在Ifeoma Ozoma找到了一个盟友，当时他是该公司的公共政策和社会影响经理。\nOzoma在一封通知她的团队关于这封信的电子邮件中写道：“在这一点上，我完全同意他们的观点。”\n两个月后，该公司决定限制种植园婚礼内容的覆盖范围，这一决定得到了大量媒体的报道。在一份公开声明中，公司发言人感谢Color of Change引起了人们对“这种不尊重行为”的关注。但私下里，奥佐马受到了严厉批评。\n在一次绩效评估中，她的经理说她应该列出多个选项，每个选项都有利弊。他指责她“引导”公司达到她喜欢的结果。\nOzoma说：“作为一名黑人女性，我应该为促进奴隶种植园的发展提供专业人士。”\n这段插曲是Ozoma和她的同事Aerica Banks感到孤立的模式的一部分，因为他们说出了他们认为给公司和员工带来的问题。在上任之初，Ozoma感到被迫聘请了一名外部律师，因为她的上级拒绝承认公司向有色人种员工支付较低工资的做法，并将他们置于低于职责应得的水平。Ozoma和Banks都在这些员工之列；他们的经理保持着三人在他们部门内平等的外表，同时赋予他们大量的责任，并控制他们的薪酬和晋升。Ozoma说，尽管他们组成了“整个公司公共政策团队的三分之二”，并“领导着整个美国政府关系组合”，但他们的职位和薪酬都是“中入门级员工”的水平。\n还有一次，奥佐玛在被解雇后被迫雇佣了私人保安-她的个人信息在互联网上公布-以报复Pinterest对医疗错误信息的打击。班克斯在加入谷歌之前曾长期在谷歌和白宫从事政策工作，他警告Pinterest的管理层注意doxxing威胁，但却被忽视，并因批评另一团队处理问题的方式而受到谴责。\n在另一起事件中，身为黑人和日本人的班克斯报告了他们的共同经理主动发表了关于她的种族遗产的言论，结果被告知这些言论“没有负面含义”。\nBanks和Ozoma都于2020年5月离开了Pinterest。6月15日，该公司发布了一份声援黑人社区的声明后，两名女性都在推特上发表了关于不公平薪酬和平等待遇的问题。6月17日，Pinterest首席执行长本·西尔伯曼(Ben Silbermann)表示，公司正计划聘请一家外部公司来审查其薪酬做法，“从有色人种开始”。\n6月17日，谷歌首席执行官桑达尔·皮查伊表示，公司将结束长期以来指示员工监管自己同事的做法，并通过检查员工的徽章来寻找“未经授权的访客”。皮查伊在公告中写道：“我们已经意识到，这一过程很容易受到偏见的影响。”\n对于谷歌(Google)前工程总监、黑人莱斯利·麦利(Leslie Miley)来说，这一举措来得太久了。他在进入公司办公室时曾两次被同事拦住。\n2019年9月，麦莉与一名白人男同事在谷歌纽约办公室乘坐电梯。麦莉的员工徽章可以在他的右臀部看到，站在他右边的那个人也可以看到。两人走出电梯，进入一个小大厅，通向一扇防盗门。麦莉允许他的同事刷他的徽章，先进来。麦莉穿徽章进来时，那人试图推开身后紧闭的门。\n“我伸出手走进门，”麦莉说。“这个人会说，‘我能看看你的徽章吗？’”\n麦莉不理他，走开了，但那人追着他，在麦莉面前挥手，要求看他的徽章。据麦莉说，这名男子随后挡住了麦莉的路，胸部撞到了他。最后，他抓起还挂在臀部的麦莉的徽章，问他为什么不直接给他看。\n“我看起来像是，你为什么要主动和我进行身体接触？”麦莉回忆说。“他说，‘我们需要确保人们属于这里。’”\n麦莉和其他人已经向皮查伊和其他谷歌高层指出了种族主义员工治安的危险。2019年秋天离开谷歌的麦莉说：“我的电子邮件重复了桑达尔(在周三的声明中)说过的话。这是一种非常危险的活动，很容易被武器化。”你已经知道这件事了，这应该不再是问题了。“。\n对麦莉来说，员工监管的使用与其他鼓励歧视和种族主义并将其制度化的政策是一致的。“他们是种族主义政策，”麦莉说。“而且他们没有改变它们。”皮查伊宣布的修复措施，包括一项1.75亿美元的基金，用于支持黑人企业主、创始人和社区其他人，这根本是不够的。\n“我不想要1亿美元的承诺，”他说。“我不想要一个美元数字附在我身上。我希望在一个你们忽视的社区中持续投资，我希望公司承认他们忽视了这些社区。“。\n2018年初，黑人空军退伍军人布伦南·劳森(Brennan Lawson)在西洛杉矶科技公司Snap找到了他在科技行业的第一份工作。Snap创建了一个项目，帮助退伍军人在公司找到角色。一些科技公司已经承诺雇佣退伍军人或建立类似的计划。\n在Snap之前，劳森在2016年申请了Twitter的一个。在口头提出报价后，公司一直没有跟进，他通过推荐他的高级员工了解到，公司已经取消了该计划。推特表示，它对劳森的经历感到遗憾。\n劳森说，在Snap，老兵奖学金“运行得非常、非常糟糕”。“一场狗屎秀。”\n这个项目几乎没有上市；劳森是他的队列中唯一的成员，他是通过口口相传得知这一消息的。几乎没有结构：劳森确定了一个他想要为之工作的团队，并构建了自己的角色。劳森说，公司将继续向研究员提供3至6个月的短期延期，而不是直接为他们提供永久职位。Snap当时的全球多样性和包容性倡议负责人贾维斯·萨姆(Jarvis Sam)负责该项目，他在劳森担任研究员期间中途离开了公司。\n六个月后，由于局势不稳定，劳森离开Snap，前往Facebook工作。离开后，他得知奖学金计划已经停止。\n多样性项目通常“只是一个有主动性的人，如果他们恰好停留足够长的时间来完成它，你就很幸运了。”\n劳森通过一个名为BreakLine的组织获得了他在Facebook上的工作，该组织为退伍军人提供职业过渡计划。他和其他十几名退伍军人一起加入了公司。他说，人们普遍认为，大型科技公司很难打入代表性不足的群体，除非他们内部有倡导者，或者齐心协力创建通往社区的管道。\nFacebook和Snap一样，都有一位首席多样性官。劳森说，这些标题为这些公司提供了一种掩护。\n“你看到‘首席多元化官’的头衔，感觉就像，哦，哇，好像他们必须真的、真的、认真地对待这件事，因为没有多少公司的高管桌前坐着负责多元化倡议的人。”但在现实中可能并非如此。“。\n巴里·威廉姆斯(Bari Williams)现在是Human Interest法律部门的负责人，他出生于奥克兰，毕业于加州大学伯克利分校，曾在Facebook、StubHub和人工智能公司All Turtle担任过高级职位。尽管如此，作为一名黑人女性，她被问及是否通过平权行动计划进入伯克利。威廉姆斯说：“我丈夫被问到他是不是靠篮球奖学金进入大学的。”她的丈夫詹姆·威廉姆斯(Jaime Williams)是谷歌的产品经理，之前曾在过去的公司担任工程总监。他不打篮球。\n威廉姆斯说：“有了微侵略性，那里就没有了，所以你不能去人力资源部。”“人力资源是(有色人种女性)最后的手段，因为它会让别人有理由报复你。..。它会把一个目标放在你的背上。“\n另一种常规体验是：音调管制。在一个案例中，威廉姆斯回忆说，她曾要求一位不在法律团队中的同事不要编辑她正在处理的文件。就在几天前，另一位白人男性同事也提出了同样的要求。但当威廉姆斯这样做时，那个人抱怨她“不友好”，而且咄咄逼人。\n在过去的几周里，威廉姆斯和她的许多黑人同事不得不区分弗洛伊德被杀的压力和痛苦，以及她必须向她年幼的儿子解释为什么人们在抗议，以及在美国身为黑人的现实。\n她说：“在过去的两周里，每个人都有过这样的时刻，‘哦，天哪，我真的很想喊出黑人。’”“你不能，因为有人仍然期待你第二天跳上Zoom电话，谈论你昨晚在Netflix上看了什么，即使没有人关心，就像真的没有人一样。”这不舒服，但你必须这么做。“。\n在人口近50%是拉丁裔的洛杉矶县，一家快速增长的初创公司的一名项目经理回忆说，他是公司仅有的三名拉丁裔人之一。由于担心遭到报复，这名经理要求不具名。他说：“当我们大约有70到100名员工时，我就向高管们提出，(公司)仍然只有两三个拉丁裔员工。”“与其说我们应该做更多，因为我们在南加州，只有3%的员工是西班牙裔，我得到的反应是，嗯，你认识谁？你应该让你的朋友来申请。\n他说：“这个负担加在了我身上，人们的期望是，如果我和其他少数族裔人士对此有意见，我们应该利用我们的人脉来找人。”\n根据他的说法，公司将缺乏多样性归因于管道问题，然后“他们就像是举起了手。”他说，根据他的经验，科技公司通常唯一感兴趣的是赚钱和成长。“而任何没有做到这一点的事情，就像是，那我们为什么要关注它呢？”\n“在某个时候，你的意图并不重要，结果是不公正的，”他说。\n与许多回复我们调查的人一样，一名自认为一半是黑人，一半是西班牙裔(由于担心报复而要求不具名)的职业IT专业人士也被怀疑因为自己的种族而被拒绝晋升的疑虑所困扰。\n他说：“很多年前，我正处在一个职位空缺的位置上，我向我的老板，向比我高一级的大老板表示，我将申请这个职位。”他的老板建议他在招聘委员会帮忙。当他回击说他想自己申请这份工作时，他的老板毫不含糊。“他直接告诉我：我不能告诉你不要应聘这份工作，但我可以告诉你，我觉得这份工作不适合你.”\n他争论着如何处理他的配偶和朋友，最后决定加入寻找委员会，担心如果他继续做一个吱吱作响的轮子，他的老板会报复并损害他的职业生涯。他过去曾见过这种情况发生在黑人同事身上--说话后被冷落或被赶走。\n他说：“我认为，最好是在内部，能够从根本上选择我的老板，然后让自己面对一个敌对的局面。”“但我要说的是，在那次寻找之后，我发现自己在想，我可以也会比得到这个角色的人做得更好。”而拿到它的人是个白人。“。\n乔丹·曼(Jordan Mann)在过去10年里一直在洛杉矶担任虚拟现实和视觉效果专家，对于她来说，问题往往一走进门就开始出现。\n曼恩说：“如果我不把照片和简历一起寄来，他们就会因为我的名字而认为我是白人。”在她事先没有电话交谈就被叫来面试的情况下，她的震惊是显而易见的。“就像这次震动，他们看起来很惊讶，”曼恩说。“对我来说，即使是在那里，这也是一种偏见--为什么你会对一个黑人女性走进这扇门感到惊讶？”\n她说，如果她被录用，她将面临来自同事和主管的持续不断的破坏。曼恩说：“我真的想不出我去过的哪个领域没有人认为有人比我聪明。”“一般说来，人们对非黑人的看法是，我不会编程，我没有任何技术技能，我得到一份工作是因为平权行动，这简直是荒谬可笑。”他说，“人们通常认为我不会编程，我没有任何技术技能，我得到一份工作是因为平权行动，这太荒谬了。”\n她看到在一家快速增长的VR初创公司从同一职位起步的白人同龄人得到晋升，而她则被赶下台。有一次，在另一家公司，当她认为自己实际上得到的是一份固定的工作，而不是合同制的职位时，当她试图谈判自己的工资时，事情就发生了横向变化。\n“我反驳了，然后他们突然取消了工作邀请，”曼恩说。\n最后，她被要求培训被聘为全职职位的白人男子，她说这名男子没有使用这项工作所需的软件套件的经验，然后就放手了。\n她目前的雇主是她所说的“实际上是尊重和关心包容”的几十个雇主中的第一个，她将这一殊荣归功于公司的领导层。\n但她认为，科技和娱乐行业的人-无论是白人还是非黑人有色人种-需要开始审视他们是如何对待黑人同龄人的，并在他们直言不讳地谈论歧视时支持他们。\n“很多人甚至没有意识到他们如何不像对待人一样对待别人，”曼恩说。“高级员工需要教育他们的员工，并真正划清界限：如果有人基于种族或民族或诸如此类的原因进行骚扰，就解决这个问题。”\n当杰西卡·库珀(Jessica Cooper)从华盛顿特区搬回洛杉矶地区，在圣莫尼卡科技公司PatientPop找到一份工作时，她对这家公司--以及公司领导层--的白人程度感到震惊。\n在她曾从事IT工作的FCC，库珀说，她在工作场所从未感到孤立。库珀说，“现在我回家了，专门在科技行业工作，你看上去越高，你看到的女性就越少，你看到的大多是白人男性。”在她的团队中，她是25名员工中唯一的黑人女性。该公司的首席执行官由四名白人男性和一名白人女性组成，而更广泛的领导层只包括一名黑人高管。\n从2019年夏天开始，她和她的同事组成了一个团体，倡导公司更多的多样性和包容性。她说，她很感激公司让他们在上班时间做这项工作，但过去的六个月令人沮丧。\n“当时我满怀希望，”她说，“但在那段时间和我们所知的世界发生变化之间，有一种挫折感，因为尽管我们觉得自己在为变革而战，但似乎商业真的比这更重要。”\n“对于那些认为没有必要这么做的人来说，他们会说，‘不，让我们继续赚钱吧，’”她补充道。“轮子上了油，我们继续走吧。”\n但情况开始发生变化。随着弗洛伊德被杀，抗议活动在全国范围内蔓延，她惊喜地看到公司高管的反应。她说，虽然他们一开始行动有点慢，但他们一直在与像她这样的员工合作，积极制定新的流程和政策。\n这家为医疗实践提供在线服务的公司，已经看到来自新冠肺炎c的收入下降。\n..", "note_en": "A Black career IT professional put himself forward for a promotion but was instead asked to help recruit another candidate, who was white. A Black Google engineer was confronted by a white coworker demanding to see his ID badge. A Latino project manager pointed out his quickly growing startup was almost all white, and the chief executive responded by telling him to invite his friends to apply for jobs. A Black Air Force vet was offered positions at both Twitter and Snap, only to be set adrift both times when the recruiting programs that brought him there dissolved. A Black programmer on contract was denied a full-time job and asked to train her unqualified white replacement instead.\n These are just some of the stories of discrimination against women, LGBTQ-identified people, and people of color that The Times has collected in a survey of 68 tech workers that began in the fall of 2019.\n Public protests demanding justice for Black people killed by police have brought a reckoning to the business world, with executives forced to  resign, companies overhauling  internal policies and employees  quitting in protest.\n For the tech industry, this reckoning has been going on in some form  since 2014. But while large tech and venture capital firms have promised to do better, little has changed in how Black people and other people of color are treated as job candidates, employees and investors.\n     Some of the common experiences detailed in survey responses: enduring daily microaggressions; feeling targeted by superiors or external critics; being trotted out to defend a company’s diversity practices; being tasked with extra work typically reserved for diversity and inclusion officers. Respondents described companies where people of color are severely underrepresented in both rank-and-file and executive roles and corporate cultures that can feel hostile to anyone who is not a heterosexual, cisgender white male.\n Of the 68 tech workers who responded to the survey, half said they felt tech was not inclusive to people from diverse backgrounds.\n   “Tech is inclusive because they need our talent and manpower regardless of whether they acknowledge it or not,” one Hulu employee who asked not to be named said. “It’s a spectrum of tolerance and acceptance.”\n People whose identities are underrepresented in their field find themselves judged through a different set of lenses, one that ignores the question of privilege, the Hulu employee said. “A single mom that didn’t go to college is seen as uneducated whereas a white college dropout is seen as a ‘genius,’ as if he’s too good for college.”\n Despite the hardships of navigating largely white, male spaces, fewer than a third of respondents said they’ve ever left a company in response to discrimination or non-inclusiveness. “When your position is this tenuous, you rarely leave since the next job is never sure to be there,” one woman who works at an education-tech startup and asked to be anonymous said.\n   These experiences mirror the results of a  Pew Research study from early 2018, which found that more than 60% of Black people in STEM fields have been discriminated against at work, as have 50% of women, 44% of Asian STEM workers and 42% of Latino people. Pew found that discrimination typically took one of eight forms: being denied a promotion, being turned down for a job, being passed over for important assignments, experiencing repeated slights at work (or microaggressions), receiving less support from above than coworkers, getting paid less than coworkers doing the same job, feeling isolated, and being treated as less than competent.\n The stories shared with The Times both capture and transcend those neat categories. Drawn from dozens of interviews, these accounts reflect the experiences, both common and unique, of women, LGBTQ-identifying people, and people of color who work in tech.\n In October 2019, Pinterest came under pressure from the civil rights activist group Color of Change to stop promoting and romanticizing former slave plantations as wedding venues. The group found an ally in Ifeoma Ozoma, at the time a public policy and social impact manager at the company.\n “I agree with them on this — completely,” Ozoma wrote in an email notifying her team about the letter.\n The company’s decision two months later to limit the reach of plantation wedding content received considerable  press coverage. In a public statement, a company spokesperson thanked Color of Change for bringing attention to “this disrespectful practice.” But privately, Ozoma was chastised.\n In a performance review, her manager said she should have listed multiple options with pros and cons for each. He accused her of “channeling” the company to her preferred outcome.\n “I was supposed to, as a Black woman, provide pros for promoting slave plantations,” Ozoma said.\n The episode was part of a pattern in which Ozoma and her colleague Aerica Banks felt isolated for calling out what they saw as problems for the company and its employees. Early in her tenure, Ozoma felt forced to hire an outside lawyer after her supervisors refused to acknowledge the company practice of paying employees of color less and placing them lower than their responsibilities merited. Ozoma and Banks were among those employees; their manager maintained the outward appearance that the three were co-equals within their department while heaping them with responsibilities and controlling their pay and advancement. Ozoma said despite making up “two-thirds of the entire company’s public policy team” and “leading the whole U.S. government relations portfolio” they were placed and paid in levels for “mid-entry-level employees.”\n      On another occasion, Ozoma was forced to hire private security after being doxxed — her personal information published across the internet — in retaliation for Pinterest’s crackdown on medical misinformation. Banks, who had a long career in policy at Google and in the White House before joining the company, warned Pinterest’s management of the doxxing threat, only to be ignored and chastised for criticizing the way another team was handling the issue.\n In a separate incident, Banks, who is Black and Japanese, reported their shared manager for making unsolicited remarks about her ethnic heritage, only to be told the remarks carried “no negative connotations.”\n Both Banks and Ozoma left Pinterest in May 2020. After the company issued a statement of solidarity with the Black community on June 15, both women tweeted about their issues with unfair pay and leveling. On June 17, Pinterest Chief Executive Ben Silbermann said the company is planning to hire an outside firm to review its compensation practices “starting with people of color.”\n On June 17, Google Chief Executive Sundar Pichai said the company will put an end to a long-standing practice of directing employees to police their own colleagues and seek out “unauthorized visitors” by checking their badges. “We have realized this process is susceptible to bias,” Pichai wrote in the  announcement.\n For Leslie Miley, a former engineering director at Google and a Black man who had twice been physically stopped by coworkers when entering company offices, the move was a long time coming.\n In September 2019, Miley rode an elevator in Google’s New York office with a white male coworker. Miley’s employee badge was visible on his right hip, visible to the man, who stood to his right. The two exited the elevator into a small lobby giving onto a security door. Miley allowed his co-worker to swipe his badge and enter first. As Miley badged in, the man attempted to push the door shut behind him.\n “I stick my hand out and walk in the door,” Miley said. “The person’s like, ‘Can I see your badge?’”\n Miley ignored him and walked away but the man pursued him and waved his hand in Miley’s face, demanding to see his badge. The man then blocked Miley’s way and chest bumped him, according to Miley. Finally, he grabbed Miley’s badge, which was still hooked up to his hip, and asked why he didn’t just show it to him.\n   “I’m looking like, Why did you just initiate physical contact with me?’” Miley recalled. “He said, ‘We need to make sure that people belong here.’”\n Miley and others have pointed out the hazards of racist employee policing to Pichai and other Google higher-ups. “I have emails that repeat the exact words that Sundar said [in Wednesday’s statement,]” Miley, who left Google in the fall of 2019, said.&#34;It’s such a  pernicious activity that is so easily weaponized. You’ve known about this, it shouldn’t even be an issue anymore.”\n To Miley, the use of employee policing was of a piece with other policies that encouraged and institutionalized discrimination and racism. “They’re racist policies,” Miley said. “And they haven’t changed them.” And the fixes Pichai announced, including a $175-million fund to support Black business owners, founders and the rest of the community, are simply not enough.\n “I don’t want a hundred million dollar commitment,” he said. “I don’t want a dollar figure attached to me. I want sustained investment in a community that you have ignored and I would like companies to admit they have ignored these communities”\n Brennan Lawson, a Black Air Force veteran, got his first job in the tech industry at West L.A. tech company Snap in early 2018. Snap had created a program to help veterans find roles in the company. A number of tech companies have pledged to hire veterans or established similar programs.\n Before Snap, Lawson applied to one at Twitter in 2016. After extending a verbal offer, the company never followed up, and he learned through the senior employee who referred him that the company had scrapped the program. Twitter said it regretted Lawson’s experience.\n At Snap, the veteran fellowship was “very, very poorly run,” Lawson said. “A shitshow.”\n The program was barely marketed; Lawson, who was the only member of his cohort, heard about it through word of mouth. There was little structure: Lawson identified a team he wanted to work for and constructed his own role. The company would continually grant short extensions of three to six months to fellows, instead of offering them permanent positions outright, Lawson said. Snap’s then-head of Global Diversity and Inclusion Initiatives Jarvis Sam, who ran the program, left the company midway through Lawson’s fellowship.\n After six months, Lawson left Snap for a job at Facebook because of the instability. After leaving, he learned the fellowship program had been discontinued.\n Diversity programs are usually “just a person with an initiative and you’re lucky if they happen to stay long enough to see it through.”\n   Lawson got his Facebook job through an organization called BreakLine, which provides career transition programs for veterans. He joined the company with about a dozen other veterans. He said there’s a broad sense that big tech companies are difficult to break into for underrepresented groups unless they have an advocate on the inside, or there’s a concerted effort to create a pipeline to a community.\n Facebook, like Snap, has a chief diversity officer. These titles provide a sort of cover for the companies, Lawson said.\n “You see the title ‘chief diversity officer’ and it’s like, Oh wow like they must take this really, really, seriously, because there are not many companies that have someone running a diversity initiative who is sitting at the executive table. But in reality it may not be.”\n Bari Williams, now the head of legal at Human Interest, is an Oakland native and U.C. Berkeley grad, and has held high-level positions at Facebook, Stubhub and the AI company All Turtles. Still, as a Black woman, she is asked if she got into Berkeley through an affirmative action program. “My husband got asked if he got into college on a basketball scholarship,” Williams said. Her husband,  Jaime Williams, is a product manager at Google and previously held roles as the director of engineering at past companies. He doesn’t play basketball.\n “With microaggressions, there’s no there there so you can’t go to HR,” Williams said. “And HR is a last resort [for women of color] because it’ll give someone something to retaliate against you for. ... It puts a target on your back.”\n Another regular experience: tone policing. In one case, Williams recalled asking a colleague who was not on the legal team not to edit documents she was working on. Another colleague who was white and male had made the same request just days before. But when Williams did it the person complained that she “wasn’t being nice” and was aggressive.\n In the last few weeks, Williams and many of her Black colleagues have had to compartmentalize the stress and pain of Floyd’s killing and the fact that she has to explain why people are protesting and the reality of being Black in the United States to her young son.\n “Everybody had a moment in the last two weeks where we’re like, ‘Oh man, I really want to just call out Black,” she said. “And you can’t because somebody is still expecting you to hop on that Zoom call the next day and talk about what you watched on Netflix last night, even though nobody cares, like literally nobody. It’s not comfortable, but you have to do it.”\n In Los Angeles County, where the population is nearly 50% Latino, a project manager at a quickly growing startup, who asked not to be identified for fear of retaliation, recalled being one of only three Latino people at his company. “I raised the point to executives once we were at about 70 to a hundred employees that there were still only two or three Latinx people working at [the company],” he said. “Rather than say we should do more because here we are in Southern California and only like three percent of the employees are Hispanic, the response I got was, Well who do you know? You should ask your friends to apply.\n “The burden was placed on me and the expectation was that if me and other people who are minorities had an issue with it we should use our networks to find people” he said.\n According to him companies chalk up the lack of diversity to a pipeline problem and then “they just kind of throw their hands up.” He said, in his experience, often tech companies only interest is to make money and grow. “And anything that doesn’t do that, it’s like, Then why are we paying attention to it?”\n “There’s a point at which it doesn’t really matter what your intent is, the outcomes are unjust,” he said.\n Like many who responded to our survey, a career IT professional who identifies as half-Black and half-Hispanic (and who asked not to be identified for fear of retaliation) is haunted by the suspicion that he was denied a promotion because of his race.\n “I was in a position many years ago where the position above me opened up, and I expressed to my boss, to the big boss, the next level above that, that I was going to apply for the position,” he said. His boss suggested that he help out on the search committee instead. When he pushed back and said he wanted to apply for the job himself, his boss was unequivocal. “He directly told me: I can’t tell you not to apply for this job, but I can tell you that I don’t think this job is for you.”\n He debated what to do with his spouse and his friends, and decided to join the search committee in the end, fearful that his boss would retaliate and hurt his career if he continued to be a squeaky wheel. He had seen it happen to Black coworkers in the past -- frozen out or pushed out after speaking up.\n “I figured better to be on the inside and be in a position to essentially get to choose my boss then to set myself up for an adversarial situation,” he said. “But I will say that after that search, I found myself thinking that I could and would have done a better job in that role than the person who got it. And the person who got it was a white man.”\n For Jordan Mann, who has spent the last 10 years working as a virtual reality and visual effects specialist in Los Angeles, the problems often start as soon as she walks in the door.\n   “When I don’t send a picture with my resume, they assume I’m a white man because of my name,” Mann said. On the occasions that she’s called in for an interview without a phone conversation first, the shock is palpable. “It’s like this jolt, they look surprised,” Mann said. “To me right even there that’s bias—why would you be surprised a Black woman is coming through the door?”\n If she’s hired, she says she faces constant undermining from peers and supervisors alike. “I can’t really think of any space I’ve been in where it wasn’t assumed that someone was smarter than me,” Mann said. “People, speaking generally of non-Black people, always make the assumption that I don’t know how to code, that I don’t have any tech skills, that I got a job because of affirmative action, it’s just ridiculous.”\n She’s seen white peers who began at the same position at a fast-growing VR startup get promoted up the ladder, while she got pushed out. And once at a different firm, when she thought she was actually getting a permanent job rather than a contract position, things went sideways as soon as she tried to negotiate her salary.\n “I countered, and then all of a sudden they rescinded the job offer,” Mann said.\n In the end, she was asked to train the white man who was hired for the full-time position, who she said had no experience with the software suite necessary for the job, and then let go.\n Her current employer is the first out of dozens that she says has “actually been respectful and cares about inclusion,” and she credits the company’s leadership for that distinction.\n But she thinks that people in the tech and entertainment industry—whether white or non-Black people of color—need to start examining how they treat their Black peers and supporting them when they speak up about discrimination.\n “A lot of people don’t even realize how they don’t treat other people like they’re human,” Mann said. “Senior staff needs to educate their employees, and really draw a line: if someone is harassing based on race or ethnicity or anything like that, address it.”\n When Jessica Cooper moved back to the L.A. area from Washington D.C. and got a job at the Santa Monica tech company PatientPop, she was shocked at how white the company—and the company’s leadership—was.\n   At the FCC, where she had worked in IT, Cooper said she never felt isolated in her workplace. “Now that I’ve come back home, and working in the tech industry specifically,” Cooper said, “the higher up the ladder you look, you don’t see a lot of women, and you mostly see white males.” On her team, she’s the only Black woman out of 25 employees. The company’s C-suite consists of four white men and one white woman, and the broader leadership includes just one Black executive.\n Starting in the summer of 2019, she and her coworkers formed a group to advocate for more diversity and inclusion at the company. She’s grateful that the company has let them do that work on company time, but the past six months had been frustrating, she said.\n “I was hopeful at that time,” when she started the group, she said, “but between that time and when the world changed as we know it, there was this frustration, because as much as we felt like we’re fighting for change it seems like business was really prioritized over that.”\n “For people who don’t see a need for this, they’re like, ‘No, let’s just keep making money,’” she added. “The wheels are oiled, so let’s keep going.”\n But things are beginning to change. Following the killing of Floyd and the spread of protests around the country, she’s been pleasantly surprised to see the reaction from her company’s C-suite. While they were a little slow to move at first, she said, they’ve been working with employees like her to actively hammer out new processes and policies.\n The company, which provides online services to medical practices, has seen a decrease in revenue from the Covid-19 c\n......", "posttime": "2020-06-25 12:12:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "棕色,brown", "title": "黑人和棕色的技术工作者分享他们在工作中的种族主义经历", "title_en": "Black and brown tech workers share their experiences of racism on the job", "transed": 1, "url": "https://www.latimes.com/business/technology/story/2020-06-24/diversity-in-tech-tech-workers-tell-their-story", "via": "", "real_tags": ["棕色", "brown"]}, {"category": "", "categoryclass": "", "imagename": "5d52f8c9477ac09b7358a2a1225541b5.jpg", "infoid": 1008062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Skylake糟糕的质量保证是苹果最终决定放弃英特尔，转而专注于用于高性能机器的基于ARM的处理器的原因。这是直言不讳的前英特尔首席工程师弗朗索瓦·皮埃德诺尔(François Piednoël)的说法。\n这是上周的重大新闻之一；苹果终于宣布，在Mac台式机和笔记本系列产品方面，它将从英特尔手中过渡两年。对于为什么会出现这种情况，人们有很多猜测，主要的考虑因素是，它的目标是整合所有不同平台的架构，从iPhone到iPad，最后整合到笔记本电脑和台式机产品系列。\n从业务和架构的角度来看，这是完全有道理的，但尽管皮埃德诺埃尔表示，苹果一直在考虑这一点，但他相信，如果苹果没有在Skylake架构中发现这么多问题，它仍会继续留在英特尔芯片列车上。可以说，正是这根稻草压垮了苹果的后背。\n在一次随意的XPlane聊天和流媒体会议上，Piednoël表示，Skylake的质量保证不仅仅是一个问题。这是异常糟糕的。我们对天湖里的小事引用得太多了。基本上，我们在苹果的伙伴成为架构中问题的头号提交者。结果真的，真的很糟糕。\n当您的客户开始发现几乎与您发现的一样多的错误时，您就没有找到正确的地方。\n如果这是真的，你当然可以理解为什么身穿马球领衣的苹果团队可能已经开始更加认真地考虑如何有效地将整个工程和制造转移到ARM，以及整个Mac软件生态系统。苹果一定很讨厌天湖…。\n皮埃德诺说，对我来说，这是一个转折点，这就是那些一直在考虑换台的苹果员工，他们去看了看，说：嗯，我们可能不得不这么做。基本上，Skylake糟糕的质量保证导致他们真的离开了这个平台。&#34；Piednoël。&#34；这就是苹果的员工们一直在考虑更换的地方，他们去看了看，然后说：嗯，我们可能不得不这么做。基本上，Skylake糟糕的质量保证是导致他们真的离开了这个平台的罪魁祸首。\n不得不说，这只是一位前英特尔工程师公开发表的观点，并不一定能被视为事实，显然也不是更换的唯一原因。但皮德诺埃尔在英特尔任职期间一直是一个有趣的人物，也是一个非常直言不讳的人物，这经常让他的公关经理在我们这些记者面前懊恼不已。\n但是，无论Skylake架构的质量保证在多大程度上影响了苹果批发转用ARM的决定，它仍然是一个有趣的视角，可以解释为什么最终会发生这种情况。", "note_en": "The &#34;bad quality assurance of Skylake&#34; was responsible for Apple finally making the decision to ditch Intel and focus on its own ARM-based processors for high-performance machines. That&#39;s the claim made by outspoken former Intel principal engineer, François Piednoël.\n It&#39;s been one of the big stories from this last week;  Apple finally announcing its two-year transition away from Intel for its Mac desktop and notebook lines. There has been a lot of speculation about why this has happened, with the main consideration being that it&#39;s aiming to consolidate the architectures across all its different platforms, from iPhone, through iPad, and finally into its laptop and desktop range.\n   That makes complete sense from a business and an architectural point of view, but while it&#39;s something Piednoël says was always under consideration by Apple, he believes if the company hadn&#39;t found so many issues within the Skylake architecture it would still be onboard the Intel chip train. It was the straw that broke the Apple&#39;s back, so to speak.\n &#34;The quality assurance of Skylake was more than a problem,&#34; says Piednoël during a casual Xplane chat and stream session. &#34;It was abnormally bad. We were getting way too much citing for little things inside Skylake. Basically our buddies at Apple became the number one filer of problems in the architecture. And that went really, really bad.\n &#34;When your customer starts finding almost as much bugs as you found yourself, you&#39;re not leading into the right place.&#34;\n If that&#39;s true you can certainly see why the polo neck-wearing Apple contingent might have started getting a lot more serious about how it could effectively switch both its entire engineering and manufacturing over to ARM, but also the entire Mac software ecosystem too. Apple must have  really hated Skylake…\n  &#34;For me this is the inflection point,&#34; says Piednoël. &#34;This is where the Apple guys who were always contemplating to switch, they went and looked at it and said: &#39;Well, we&#39;ve probably got to do it.&#39; Basically the bad quality assurance of Skylake is responsible for them to actually go away from the platform.&#34;\n It has to be said that this is just the publicly stated opinion of one former Intel engineer and can&#39;t necessarily be taken as fact, and obviously isn&#39;t the only reason for the switch either. But Piednoël was always an interesting character while he  was at Intel and a very outspoken one too, often much to the chagrin of his PR handlers in front of us journalists.\n But however much the quality assurance of the Skylake architecture did or didn&#39;t impact Apple&#39;s decision to switch wholesale over to ARM, it&#39;s still an interesting perspective on why it has finally happened.", "posttime": "2020-06-25 11:50:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,英特尔,finally", "title": "英特尔最终失去了苹果，因为Skylake QA“异常糟糕”", "title_en": "Intel finally lost Apple because Skylake QA 'was abnormally bad'", "transed": 1, "url": "https://www.pcgamer.com/intel-skylake-why-apple-left/", "via": "", "real_tags": ["苹果", "apple", "英特尔", "finally"]}, {"category": "", "categoryclass": "", "imagename": "28f8948cae1d7519fb034ce5f140f9fe.jpg", "infoid": 1008061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看看这张由美国宇航局戈达德太空飞行中心(SDO)在过去10年中记录的一小时时间推移的太阳图像。每一秒都代表着..。", "note_en": "Check out this one hour time lapse imagery of the sun recorded over the course of 10 years by NASA's Goddard Space Flight Center/SDO. Each second represents ...", "posttime": "2020-06-25 11:49:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国宇航局,nasa,美国,看起来,小时", "title": "太阳在10年内看起来是什么样子(美国宇航局时间流逝)", "title_en": "What the SUN looks like over 10 years (NASA time lapse)", "transed": 1, "url": "https://www.youtube.com/watch?v=9lTtrcSe-Hc", "via": "", "real_tags": ["美国宇航局", "nasa", "美国", "看起来", "小时"]}, {"category": "", "categoryclass": "", "imagename": "fb0ac2cd5f0d6b01e4a063a0df95195c.jpg", "infoid": 1008060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在不到6个月的时间里，YouTube音乐将成为谷歌唯一的音乐服务。Google Play Music计划在今年年底关闭，YouTube将成为谷歌的一站式媒体品牌。作为这一转变的一部分，YouTube Music最近在其阵容中增加了谷歌音乐的最后一个重要功能：音乐库支持。在经历了令人痛苦的缓慢推出后，这位谷歌音乐的老用户试了试这项服务，并返回报告称：这将是一场混乱。\n对于那些没有意识到这一点的人，音乐库功能可以让您将自己购买的音乐带到该服务中。谷歌音乐在2011年推出了这一功能，允许你将MP3和其他任何东西上传到谷歌的服务器上，然后你可以将它们流媒体或下载到你的其他设备上。谷歌音乐有它的怪癖，但它是一项非常棒的服务，可以在多个设备上同步你的音乐收藏，备份你的音乐，并将你的音乐放入Google Cast生态系统，以便在谷歌家庭扬声器或Android电视上轻松播放。YouTube接管的这项服务包括一个简单的一键式图书馆转移功能，效果很好。YouTube音乐的问题在于限制性的播放规则，这是谷歌音乐的一个重大降级。\n我可以坐在这里抱怨YouTube音乐的倒退，迷宫般的用户界面，以及随机的YouTube垃圾和我的音乐收藏的奇怪混合。但我现在真正想在屋顶上喊的是：YouTube音乐不尊重购买音乐的人。如果你购买了你的音乐，上传到YouTube音乐，并期望得到像你拥有音乐一样的待遇，这项服务不适合你。如果你购买了谷歌家庭智能扬声器或任何其他Google Cast设备，谷歌现在的公开立场是，一旦谷歌音乐关闭，你需要支付月费才能投放到你的扬声器上。\n购买音乐，购买扬声器，然后购买在扬声器上播放音乐的权利。\nYouTube音乐实际上只面向音乐租赁者--他们希望每月、每月、永远支付10美元购买音乐溢价。这笔费用是为你不拥有的音乐每月购买流媒体许可证，我想其中很大一部分会流向音乐公司。当你不支付这笔租赁费时，YouTube音乐感觉就像是一款演示应用程序。\n我更喜欢拥有我的音乐，而且我拥有很多独立的音乐，这些音乐无论如何都不会被这个主要唱片公司的流媒体许可证所涵盖，所以我对这项服务没有兴趣。问题是，YouTube Music也会锁定每月租赁费背后的常规音乐播放功能，即使是你上传到该服务的音乐也是如此。最大的过错是，你不能在不支付租赁费的情况下使用Google Cast，但当它是我拥有的音乐和我拥有的扬声器时，这真的是不好的。谷歌音乐没有做到这一点。\n如果仅仅因为我不想订阅音乐高级版，就有人称我为免费用户，我会非常生气。我花了一大笔钱从网上买了很多音乐。我已经花了数百美元买了谷歌家庭扬声器，它(普通的中型音箱)是130美元一台。由于Google Home的基本功能最初推出缓慢，在很长一段时间内，通过多个扬声器播放音乐是Google Home唯一能做得很好的事情。当人们购买这些扬声器时，谷歌音乐是在谷歌主页上播放音乐的官方方式，当然，它这样做是免费的。当谷歌关闭谷歌音乐时，谷歌将拿走它的扬声器系列，并告诉客户，如果你想继续在你的扬声器上播放音乐，就开始支付月费。\n这看起来很疯狂，很难相信它真的会发生，但这就是现在的情况。在发表这篇文章之前，我联系了谷歌公关，试图找人驳斥突然收取月费使用我的扬声器的想法，但该公司只是重申，YouTube Music要求谷歌Cast支付月费。\n许多音乐应用和服务都内置了对Google Cast的支持，只需轻轻一点，您就可以将音乐发送到本地Wi-Fi网络上的任何其他Google Cast扬声器。Google Home扬声器确实有另一种蓝牙模式，在这种模式下，你可以将一个任意的蓝牙设备与他们配对，并在音乐上传输，但这带来了大量的倒退。首先，您不能在多扬声器组上使用蓝牙对，只能在单个扬声器上使用蓝牙对。记住，在很长一段时间里，多房间音乐播放是Google Home的唯一卖点。其次，管理多个蓝牙设备，特别是在Android上，是一场笨拙的噩梦，这是我绝对不想做的事情。第三，蓝牙仅限于蓝牙的范围，而Google Cast适用于整个家庭网络。第四，你的设备需要蓝牙，所以你不能从没有蓝牙的电脑上播放音乐。第五，你不能用语音命令开始播放音乐，这就像是Google Home的全部功能。蓝牙播放不能替代投射。\n与谷歌音乐相比，YouTube音乐的另一个奇怪之处是：你不能下载你的音乐吗？嗯，有时候你可以。你可以将整个曲库以ZIP文件的形式下载到PC上，也可以在应用程序中下载一首歌曲，但在不支付音乐租赁费的情况下，你不能在应用程序中下载播放列表。这没有任何意义。\n在谷歌音乐上，如果你的手机有足够的空间，下载你的云音乐收藏绝对是你应该做的事情。除了支持离线回放(这很棒)之外，它也只是一个普遍的性能改进。当你不需要的时候，为什么要往返于互联网呢？当新手机有128 GB到1TB的存储空间时，下载数千首歌曲真的没什么大不了的。谷歌音乐(Google Music)让这件事变得有点困难：你必须为你的音乐收藏制作一个播放列表，然后下载该播放列表，但至少这项服务可以做到这一点。YouTube音乐想要收费。\n但同样，当我拥有音乐时，收取费用将其下载到我的手机上是不好的。我可以很容易地插入USB数据线，然后将我的音乐传输过来。不管怎样，我每次播放一首歌时都会临时下载它--就让我保存它吧。这将节省我的带宽和Google的带宽，并将提高性能。谷歌音乐并没有为此收取任何费用。\n现在，YouTube音乐给人的感觉就像是抢钱。谷歌并不只是通过将用户踢出一项服务，然后要求他们转移到另一项服务来扰乱用户-该公司还在收紧螺丝，希望在这一过程中获得更多的月度订户。\n如果谷歌真的在谷歌音乐关闭时保留了这些限制，我将把它列为该公司有史以来做过的最糟糕的事情之一。近年来，谷歌通过关闭一批又一批产品，对其品牌和生态系统造成了令人难以置信的损害。最近，我们看到它扼杀或计划扼杀谷歌收件箱、Google Hangout、Google+、Google Cloud Print、Google Allo和YouTube Gaming，此前人们还记得谷歌笔记本电脑和谷歌阅读器(Google Reader)等痛苦的关闭事件。\n不过，谷歌音乐和谷歌主页的过渡是不同的。所有这些其他服务都是免费的-或者至少是广告支持的-产品。没有钱易手。当谷歌音乐消亡时，谷歌将拿走人们付费的硬件产品，并将音乐播放功能砖砌起来，除非他们开始支付月费。\n我真的希望公司在这方面改弦易辙，但我不确定，如果年底到来，价值数百美元的扬声器突然停止工作，我该怎么办。\n这一举措将伴随着与Nest生态系统合作的消亡，当时谷歌拆除了一些人的智能家居设置，因为它想关闭Nest的账户。至少，这有一个借口，那就是Nest不是在这里发明的，它是一笔收购。谷歌音乐的关闭纯粹是谷歌的注意力缺陷障碍在起作用。从外部来看，该公司没有自上而下的发展方向，似乎不能长期坚持产品。当谈到公司对自己品牌造成的损害时，谷歌高管似乎一无所知，像这样的关闭不仅仅影响了个人用户-他们向整个科技行业发出了一个信息，即谷歌的产品不值得信任，也不值得你花时间去投资。随着Google Stadia的推出，我们看到谷歌收获了它播下的种子--开发者和用户对这项服务敬而远之，因为他们预计谷歌将在几年内放弃这项服务。\n我想指出的是，YouTube在2019年赚了150亿美元。谷歌部门并不是在为现金而苦苦挣扎。什么时候才够呢？在你把用户赶走之前，只要试着对他们做正确的事情就行了。", "note_en": "In under six months, YouTube Music will be Google&#39;s one-and-only music service. Google Play Music is scheduled to shut down at the end of the year, leaving YouTube as Google&#39;s one-stop media brand. As part of this transition, YouTube Music  recently added the last great Google Music feature to its lineup: music-library support. After an agonizingly slow rollout, this long-time Google Music user gave the service a whirl and is back to report: this is going to be a mess.\n For those that aren&#39;t aware, the &#34;Music Library&#34; feature lets you bring your own purchased music to the service. Google Music launched with the feature  back in 2011, which let you upload your MP3s and whatever else to Google&#39;s servers, and then you could stream or download them to your other devices. Google Music has its quirks, but it is a fantastic service for syncing your music collection across multiple devices, backing up your music, and putting your music into the Google Cast ecosystem for easy playback on a Google Home speaker or Android TV. YouTube&#39;s takeover of the service includes an easy one-click library-transfer feature, which works great. The problem with YouTube Music are the restrictive playback rules, which are a major downgrade from Google Music.\n I could sit here and complain for days about YouTube Music&#39;s regressions, the maze-like UI, and the weird blending of random YouTube crap and my music collection. But what I really want to shout from the rooftops right now is this: YouTube Music doesn&#39;t respect people who purchase music. If you bought your music, uploaded it to YouTube Music, and expect to be treated like you  own the music, this service is not for you. If you bought a Google Home smart speaker or any other Google Cast device, Google&#39;s public position right now is that you&#39;ll need to pay a monthly fee to cast to your speaker once Google Music shuts down.\n Buy the music, buy the speaker, and then buy the right to play the music on the speaker\n YouTube Music is really only for The Music Renter—someone who wants to pay $10 per month, every month, forever, for &#34; Music Premium.&#34; This fee is to buy a monthly streaming license for music you do not own, and I&#39;d imagine a good portion of it goes to music companies. When you don&#39;t pay this rental fee, YouTube Music feels like a demo app.\n I prefer to own my music, and I own a lot of independent music that wouldn&#39;t be covered under this major-record-label-streaming-license anyway, so I have no interest in this service. The problem is YouTube Music also locks regular music-playback features behind this monthly rental fee, even for music you&#39;ve uploaded to the service. The biggest offense is that you can&#39;t use Google Cast without paying the rental fee, but when it&#39;s music that I own and a speaker that I own, that&#39;s really not OK. Google Music did not do this.\n  I would be pretty offended if someone referred to me as a &#34;free&#34; user just because I don&#39;t want to subscribe to Music Premium. I paid good money for plenty of music from all over the Web. I&#39;ve paid hundreds of dollars for Google Home speakers, which (for the normal &#34;medium&#34; size) are $130 a pop. Thanks to the initial slow rollout of basic features to a Google Home, for a long time, music playback across multiple speakers was  the only thing a Google Home could do well. When people purchased these speakers, Google Music was the official way to play your music on a Google Home, and of course, it did so without a monthly fee. When Google shuts down Google Music, Google will be taking its line of speakers and telling customers &#34;If you want to continue playing music on your speakers, start paying a monthly fee.&#34;\n This seems insane, and it is hard to believe that it will actually happen, but that is how things stand right now. Before publishing this article, I contacted Google PR and tried to get someone to shoot down the idea of suddenly charging a monthly fee to use my speakers, but the company only reiterated that YouTube Music requires a monthly fee for Google Cast.\n Google Cast support is built into many music apps and services, and with a single tap, you can send your music to any other Google Cast speakers on your local Wi-Fi network. Google Home speakers do have an alternative Bluetooth mode, where you can pair an arbitrary Bluetooth device to them and beam over music, but this comes with a ton of regressions over casting. First, you can&#39;t use Bluetooth pair on a multispeaker group, only a single speaker. And remember, for a long time, multiroom music playback was a Google Home&#39;s only selling point. Second, managing multiple Bluetooth devices, especially on Android, is a buggy, clunky nightmare, and something I definitely do not want to do. Third, Bluetooth is limited to the range of Bluetooth, while Google Cast works across the entire home network. Fourth, your device needs Bluetooth, so you can&#39;t start music from a computer that doesn&#39;t have Bluetooth. Fifth, you can&#39;t start music playback with a voice command, which is, like, the entire point of a Google Home. Bluetooth playback is not a replacement for casting.\n   The other rental-fee oddity of YouTube Music compared to Google Music: you can&#39;t download your music? Well, sometimes you can. You can download your entire library as a ZIP file on a PC, and you can download a single song in the app, but you can&#39;t download a playlist in the app without paying the music rental fee. It doesn&#39;t make any sense.\n On Google Music, downloading your cloud-based music collection is absolutely something you should do if your phone has the space for it. Besides enabling offline playback, which is great to have, it also is just a general performance improvement. Why make a round trip to the Internet when you don&#39;t have to? When new phones have anywhere between 128GB to 1TB of storage, downloading thousands of songs is really not a big deal. Google Music made this a bit difficult: you had to make a playlist of your music collection and then download that playlist, but at least the service would do it. YouTube Music wants to charge a fee.\n But again, when I own the music, charging a fee to download it to my phone is not OK. I could just as easily plug in a USB cable and transfer my music over. I&#39;m temporary &#34;downloading&#34; a song every time I stream it anyway—just let me save it. This will save my bandwidth and Google&#39;s bandwidth and will improve performance. Google Music didn&#39;t charge a fee for this.\n  Right now, YouTube Music feels like a cash grab. Google isn&#39;t just disrupting users by kicking them off a service and asking them to move other to another service—the company is also tightening the screws and hoping to pick up a few more monthly subscribers in the process.\n If Google actually keeps these restrictions around when Google Music closes, I will rank it as one of the worst things the company has ever done. Google has been doing an incredible amount of  damage to its brand and its ecosystem in recent years by shutting down product after product. Recently, we&#39;ve seen it kill or plan to kill  Google Inbox,  Google Hangouts,  Google+,  Google Cloud Print,  Google Allo, and  YouTube Gaming, and this is on top of painful earlier shutdowns people still remember, like the death of  Google Notepad and  Google Reader.\n The Google Music and Google Home transition is different though. All of those other services were free—or at least ad-supported—products. No money changed hands. When Google Music dies, Google will be taking a hardware product people paid for and bricking the music playback functionality unless they start paying a monthly fee.\n I am really hoping the company reverses course on this, but I&#39;m not sure what I&#39;d do if the end-of-the-year comes and hundreds of dollars worth of speakers suddenly stop working.\n This move would be up there with the death of the  Works with Nest ecosystem, when Google demolished some people&#39;s smart home setups because it wanted to shut down Nest accounts. At least that had the excuse of &#34;not invented here&#34;—Nest was an acquisition. The Google Music shutdown is purely Google&#39;s attention deficit disorder in action. From an outside perspective, the company has no top-down direction and can&#39;t seem to stick with products over the long haul. Google executives seem clueless when it comes to the damage the company is doing to its own brand, and shutdowns like this don&#39;t just affect the individual users—they send a message to the entire tech industry that Google products can&#39;t be trusted and aren&#39;t worth investing your time in. We&#39;re seeing Google reap what it has sown with the launch of Google Stadia—developers and users  are staying away from the service because they expect Google to give up on it in a few years.\n I would like to point out that YouTube made  $15 billion dollars in 2019. The Google division is not struggling for cash. When will it be enough? Just try to do right by your users before you chase them all away.", "posttime": "2020-06-25 11:48:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,youtube,谷歌,音乐,music", "title": "通过YouTube音乐，谷歌扣留了我的扬声器以换取赎金", "title_en": "With YouTube Music, Google is holding my speakers for ransom", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/youtube-music-library-transfers-your-purchased-music-is-not-welcome-here/", "via": "", "real_tags": ["google", "youtube", "谷歌", "音乐", "music"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我曾两次将大型JavaScript应用程序迁移到PureScript。在CitizenNet，我们用卤素代替了ANGLING，在觉醒安全，我们用PureScript Reaction代替了大部分Reaction应用程序。这两家公司的生产缺陷都出现了戏剧性的下降。\n由于PureScript的REACT和REACT-BASIC库，替换REACT相对容易。Reaction心理模型非常适合像PureScript(或Reason)这样的强类型纯函数式语言，并且使用相同的底层库意味着只需很少的修改就可以在语言之间共享组件。\n在Awake Security，我们共享国际化、Redux存储和中间件，以及更多内容，在代码库中，PureScript定期导入JavaScript，JavaScript定期导入PureScript。\n将一个重要的应用程序从一种语言重写到另一种语言的最佳方式是在它运行时递增。起初，新语言可以接管应用程序中逻辑上孤立的部分：管理仪表板、聊天窗口或表单。但最终您必须将两种语言的组件混合在一起-例如，为了支持共享全局状态。\n在这一点上，您不能让新语言接管DOM节点。您需要支持简单、清晰的混合语言功能。幸运的是，您可以将惯用的PureScript代码的接口转换为惯用的JavaScript(反之亦然)。使用REACT和REACT-Basic，您可以用PureScript编写业务逻辑，但很容易与更大的REACT生态系统和现有代码进行互操作。\n在本文中，我将演示如何用用PureScript编写的简单组件替换Reaction应用程序的一部分。在此过程中，我将分享使此互操作变得方便和可靠的最佳实践。示例很简单，但同样的技术也适用于复杂的组件。\n我鼓励您与本文一起编写代码；没有省略任何代码，并且固定了依赖项，以帮助确保示例是可重现的。此代码使用全局安装的Nodev11.1.0、Yarnv1.12.0和NPXv6.5.0，以及本地安装的PureScript工具。\nPeter Murphy已经使用Reaction Hooks实现了本文中的想法，如果您希望看到这一点的话。\n当有新帖子发布或我有重要更新时，请通知我，并帮助我决定下一步要写什么！\n我们将编写一个显示一些计数器的小型Reaction应用程序，然后我们将用PureScript替换它的组件。除了导入之外，生成的JavaScript代码将无法从原始代码中区分出来，但是在幕后它将完全是PureScript。\n让我们按照官方的Reaction文档使用create-action-app初始化项目，然后将源代码削减到最低限度。\n我们在src下有几个源文件，但是我们的应用程序只需要其中的两个：index.js(webpack的入口点)和app.js(我们的应用程序的根组件)。我们可以删除其余部分：\n#删除除入口点和#root app组件以外的所有源文件find src-type f-not\\(-name&#39；index.js&#39；-or-name&#39；app.js&#39；\\)-delete。\n最后，让我们将这两个文件的内容替换为本文所需的最小内容。从现在开始，我将提供一些差异，您可以将这些差异提供给git application，以应用与我所做的相同的更改。\n//src/App.js导入反应来自&#34；reaction&#34；；function App(){return(&lt；div&gt；&lt；h1&gt；my App&lt；/H1&gt；&lt；/div&gt；)；}导出默认App；\n让我们编写第一个反应组件：计数器。这可能是您遇到的第一个Reaction组件示例；它也是PureScript Reaction库中的第一个示例。它也足够小和简单，可以在本文过程中替换两次。\n计数器将是一个按钮，用于维护其已被点击的次数。它将接受显示在按钮上的标签作为其唯一的道具。\n//src/Counter.js从&#34；REACT&#34；；类计数器导入REACT扩展REACT。组件{构造函数(道具){超级(道具)；此。state={count：0}；}Render(){return(&lt；button onclick={()=&gt；this。setState({计数：此。州政府。Count+1})}&gt；{此。道具。标签}：{此。州政府。count}&lt；/button&gt；)；}}导出默认计数器；\n-a/src/App.js+b/src/App.js@@-1，9+1，13@@import反应来自&#34；reaction&#34；；/count&34；；函数App(){return(&lt；div&gt；&lt；h1&gt；my App&lt；/h1&gt；+&lt；counter label=&#34；count&34；；函数App(){return(&lt；div&gt；&lt；my App&lt；/h1&gt；+&lt；count label=&#34；count&#34；)。+&lt；计数器标签=&#34；交互&#34；/&gt；&lt；/div&gt；)；}。\n有了Sile Start，我们就可以运行开发服务器并查看我们的应用程序的运行情况。\n我们已经完全编写了太多的JavaScript。让我们在这个项目中也支持PureScript。我们的目标是用任何一种语言编写代码，并在两个方向上自由导入，而不会产生摩擦。为此，我们将安装PureScript工具，创建单独的PureScript源目录，并依赖编译器生成JavaScript代码。\n首先，我们必须安装PureScript工具。我建议安装与本文中使用的版本相匹配的编译器和Spago(包管理器和构建工具)版本。我将使用NPX来确保所有命令都使用本地副本运行。\n#随心所欲地安装编译器和Spago包管理器；#由于我们已经在REACT项目中，我将使用YarnyansAdd-D purescript@0.13.2 Spago@0.8.4。\n我们可以使用Spago init创建一个新的PureScript项目。从0.8.4版开始，Spago始终使用相同的包集进行初始化，这意味着您应该拥有与撰写本文时使用的包版本相同的包版本。我使用的是PSC-0.13.0-20190607套装。\n#npx确保我们重新使用安装在node_module es.npx Spago init中的Spago本地副本。\nSpago已经创建了一个Packages.dHall文件和一个spago.dHall文件，前者指向可以安装的软件包集合，后者列出了我们实际安装的软件包。我们现在可以安装所需的任何依赖项，并且可以确保所有版本都是兼容的。\n在安装之前，让我们更新现有的.gitignore文件以涵盖PureScript。对于基于Spago的项目，这将起作用：\n最后，让我们组织我们的源代码。通常将JavaScript源代码与PureScript源代码分开，除非为PureScript编写FFI文件。因为我们在这个项目中没有这样做，所以我们的源文件将完全分开。让我们将所有JavaScript代码移到javascript子目录中，并在其旁边创建一个新的purescript文件夹。\n-a/src/index.js+b/src/index.js@@-1，5+1，5@@import reaction from&#34；reaction&#34；；import ReactDOM from&#34；reaction-dom&34；；-从&#34；./App&#34；；+从&#34；./javascript/App&#34；；导入App&#34；；ReactDOM.Render(&lt；App/&gt。\n我们只剩下一项任务了。PureScript编译器在项目根目录中名为output的目录中生成JavaScript。但是create-action-app禁止导入src目录之外的任何内容。虽然有一些更花哨的解决方案，但对于这个项目，我们将通过将输出目录符号链接到src目录来绕过限制。\nsrc├──index.js├──javascript│├──App.js│└──计数器.js├──Output-&gt；../Output└──purescript。\n在将JavaScript Reaction组件替换为PureScript组件时，我喜欢遵循四个简单的步骤：\n为组件编写单独的互操作模块。此模块提供JavaScript接口以及PureScript和JavaScript类型和习惯用法之间的转换函数。\n我们将从Awake Security使用的Reaction库开始。它类似于Reaction-Basic，但更直接地映射到底层的Reaction代码，不那么固执己见。稍后，我们将切换到Reaction-Basic，这将演示它们之间的一些区别。\n当我们在这个过程中采取每一步时，我将更多地解释为什么它是必要的，以及一些需要牢记的最佳实践。让我们开始：安装Reaction库并准备编写我们的组件：\n#安装purescript-reaction库arynpx Spago install act#构建项目，以便编辑人员可以选择`output`目录ynpx Spago build#创建组件源filetouch src/purescript/Counter.purs。\n即使我们正在编写要从JavaScript使用的组件，我们仍然应该编写普通的PureScript。我们很快就会看到，可以只针对JavaScript调整组件的接口，而保持内部不变。如果该组件要同时由PureScript和JavaScript使用，这一点尤其重要；我们不想在这两个代码库中引入任何与互操作相关的笨拙。\n下面，我编写了一个具有相同道具、状态和呈现的组件版本。将其内容复制到src/purescript/Counter.purs。\n注意：在创建组件时没有必要对此进行注释，但是这样做可以提高错误的质量(如果您做错了事情)。\nimport Prelude import Reaction(ReactClass，ReactElement，ReactThis，Component，createLeafElement，getProps，getState，setState)import React.DOM as D import React.DOM.Props as P type props={Label：：String}type State={count：：int}Counter：：Props-&gt；ReactElement Counter=createLeafElement Counter Class：：ReactClass Props CounterClass=Component&#34；让Render=do state&lt；-getState this props&lt；-getProps这个纯$D。按钮[P.。onClick\\_-&gt；setState this{count：stat.。计数+1}][D.。TEXT$PROPS。标签&lt；&gt；&#34；：&#34；&lt；&gt；显示状态。计数]纯{状态：{计数：0}，呈现}\n在PureScript代码库中，这就是我们需要的全部内容；我们可以通过导入Counter并为其提供道具来使用该组件：\n--对比我们的JavaScript主应用导入计数器(计数器)renderApp：：ReactElement renderApp=div&#39；[h1&#39；[text&#34；My App&#34；]，计数器{Label：&#34；count&#34；}，Counter{Label：&#34；count&#34；}]。\n我们也可以从JavaScript中使用此组件。React库将从该代码生成一个可用的Reaction组件，我们可以像导入任何其他JavaScript Reaction组件一样导入该组件。让我们先试一试，然后再做一些改进。\n然后我们将导入组件。请注意，我们的实现非常接近，我们只需更改导入，而不需要更改其他内容！PureScript将在输出中生成文件，因此我们的计数器组件现在驻留在OUTPUT/COUNTER。\n-a/src/javascript/App.js+b/src/javascript/App.js@@-1，5+1，5@@import反应来自&#34；reaction&#34；；-从&#34；导入计数器。/count&#34；；+从&#34；../output/count&#34；；函数App(){return(){return(。\n运行Screen start，您应该会看到与以前完全相同的一组计数器。现在使用PureScript实现了我们的组件，我们不再需要我们的JavaScript版本：\n我们很幸运，我们的组件马上就可以工作了。事实上，它之所以有效，只是因为到目前为止我们使用的是简单的JavaScript类型，并且计数器组件的用户是值得信任的，并且没有省略标签prop，我们认为这是必需的。我们可以在PureScript中强制执行正确的类型和不缺失值，但在JavaScript中不能强制执行。\n嗯，将unDefined设置为标签并不好，但也没有整个应用程序崩溃那么糟糕-如果您试图对伪装为字符串的值使用PureScript函数，就会发生这种情况。问题是字符串类型不能很好地捕捉可能从JavaScript到达的值。作为一般规则，我希望人们以他们通常的方式编写JavaScript，这意味着使用内置类型、常规的非游标函数，并且有时会省略信息，而提供null或未定义的内容。这就是为什么在Awak Security，我们通常会为JavaScript代码中使用的组件提供互操作模块，这就是为什么我们要为JavaScript代码中使用的组件提供互操作模块：\n提供组件中使用的PureScript类型与简单JavaScript表示形式之间的映射。\n通过使用Nullable类型标记所有可能合理地为空或未定义的输入，从而添加了一层安全保护，这有助于我们的代码优雅地处理遗漏的值。\n将Currated形式的函数转换为常用的JavaScript函数，并将有效的函数(在生成的代码中表示为thunk)转换为调用时立即运行的函数。\n充当影响依赖JavaScript代码的PureScript代码更改的金丝雀，因此您可以格外小心。\n在本文的其余部分中，我们将探索这些技术中的每一种。目前，我们需要做的就是将输入字符串标记为Null，并显式处理省略时应该发生的事情。\n模块计数器.Interop WHERE IMPORT Prelude导入计数器(道具，计数器)导入数据。可能(From MMaybe)导入数据。可空(Null，toMaybe)导入反应(ReactElement)类型JSProps={Label：：Nullable String}jsPropsToProps：：JSProps-&gt；Props jsPropsToProps{Label}={Label：from mMaybe&#34；count&#34；$toMaybe Label}。\n我们已经为我们的组件JSProps创建了一个新接口，它将在JavaScript中使用，而不是在我们的PureScript接口Props中使用。我们还创建了一个在两个接口之间转换的函数，并生成了一个使用JavaScript接口而不是PureScript接口的新组件。\n将标签prop标记为Nullable会使编译器意识到该字符串可能不存在。然后，它迫使我们显式处理NULL或未定义的情况，然后才能将道具视为普通字符串。我们需要处理NULL情况，以便将新的JSProps类型映射到组件的预期道具类型。为此，我们将Nullable转换为可能，然后提供一个后备值，以便在道具不存在时使用。\nNullable类型显式用于与JavaScript进行互操作，但是它的行为并不总是完全符合您的预期。它不直接映射到普通的“可能”类型。通常应该尽快将任何可为空的类型转换为。如果您想了解更多关于这方面的信息，请查看可为空的库。\n让我们更改App.js中的导入，并验证省略的标签是否被正确处理。\n-a/src/javascript/App.js+b/src/javascript/App.js@@-1，5+1，5@@import反应来自&#34；reaction&#34；；-从&#34；../output/count&#34；；+import{jsCounter作为计数器}从&#34；../output/Counter.Interop&#34；；函数App(){return(){return(){return(。\n在本例中，我们的互操作模块只是将单个字段标记为Null。但是JavaScript接口与它正在转换的PureScript接口稍有不同是很常见的。通过保留单独的互操作模块，可以在不影响核心组件的情况下轻松完成此操作。\n它还确保对底层组件的任何更改都反映为互操作文件中的类型错误，而不是(潜在地)破坏JavaScript代码。当您习惯于编译器警告您一个文件中的更改将在另一个文件中产生的影响时，很容易对此变得懒惰！\n如果您使用TypeScript，Justin Woo写了一篇关于与来自PureScript的TypeScript透明共享类型的文章，值得一读。\n让我们再次尝试替换计数器，但这一次使用更新的、更自以为是的Reaction-Basic库。在此过程中，我们将使用一些更复杂的类型，并构建更复杂的互操作模块。\nimport Prelude import React.Basic(JSX，createComponent，Make)import React.Basic.DOM as R import React.Basic.DOM.Events(Capture_)type PROPS={Label：：String}Counter：：Props-&gt；JSX Counter=Make(createComponent&#34；Counter&#34；){initialState，Render}其中initialState={count：0}Render Self=R。按钮{onClick：CAPTURE_$SELF。setState\\s-&gt；s{count=s.。count+1}，子项：[r.。文本$SELF。道具。标签&lt；&gt；&#34；&34；&lt；&gt；显示自我。州政府。计数]}\n这两个Reaction库不共享类型，因此我们将更改互操作模块以描述生成JSX而不是ReactElement。\n-a/src/purescript/counter/Interop.purs+b/src/purescript/Counter/Interop.purs@@-5，13+5，13@@import Prelude import Counter(props，counter)import Data.Maybe(From MMaybe)import Data.Nullable(Nullable，toMaybe)-import reaction(ReactElement)+import React.Basic(JSX)type JSProps={Label：：NSX。ReactElement+jsCounter：：JSProps-&gt；JSX jsCounter=计数器&lt；&lt；jsPropsToProps。\n该组件在PureScript代码库中工作得很好。不过，与我们的Reaction组件不同的是，我们的Reaction-Basic组件也不会自动在JavaScript代码中工作。相反，我们需要使用make来构造一个用于PureScript的组件，并使用toReactComponent来构造一个用于JavaScript的组件。\n尽管如此，这两个函数使用相同的组件规范类型，因此新的限制很容易解决。我们只需移动initialState并呈现到模块作用域。这样，我们就可以将它们直接导入到互操作模块中，以提供给toReactComponent。\n-a/src/purescript/Counter.purs+b/src/purescript/Counter.purs@@-2，21+2，28@@模块计数器，其中import Prelude-import React.Basic(JSX，createComponent，make)+import React.Basic(Component，JSX，Self，createComponent，make)import React.Basic.DOM As R import React.Basic.DOM.Events(Capture_。JSX-Counter=make(createComponent&#34；Counter&#34；){initialState，Render}-where-initialState={count：0}--Render self=-R.button-{onclick：-Capture_$self.setState\\s-&gt；s{count=s.count+1}-，子项：-[R.text$self.pros.label&lt；&gt；&#34；&34；&lt；&gt；show self.state.count]-}+Counter=Make Component{initialState，Render}++initialState：：State+initialState={count：0}++Render：：Self Props State-&gt；JSX+Render Self=+R.Button+{onclick：+Capture_$self.setState\\s{count=s.count+1}+，子对象：+[R.text$self.pros.label&lt；&gt；&#34。\n否则我们将保持代码不变。接下来，让我们转到互操作模块。它现在应该使用toReactComponent来创建可从JavaScript使用的组件。此函数接受组件和组件规范，与make的方式完全相同，但它还接受一个额外的参数：我们的jsPropsToProps函数。\nReaction-Basic库使互操作比Reaction更加明确，但最终我们将编写几乎相同的互操作代码。\n-a/src/purescript/counter/Interop.purs+b/src/purescript/counter/Interop.purs@@-2，16+2，15@@MODULE计数器。Interop where import Prelude-导入计数器(props，count)+导入计数器(props，component，initialState，Render)import Data.Maybe(From MMaybe)import Data.Nullable(Nullable，toMaybe)-import action(ReactElement)-\n..", "note_en": "I have twice migrated large JavaScript apps to PureScript. At CitizenNet we replaced Angular with Halogen, and at Awake Security we’ve replaced most of a React application with PureScript React. Both companies have seen a dramatic drop in bugs in production.\n It’s relatively easy to replace React due to PureScript’s  react and  react-basic libraries. The React mental model fits well with a strongly-typed, pure functional language like PureScript (or Reason), and using the same underlying library means that components can be shared between languages with little modification.\n At Awake Security we share internationalization, a Redux store and middleware, and much more in an code base where PureScript regularly imports JavaScript and JavaScript regularly imports PureScript.\n The best way to rewrite a significant app from one language to another is incrementally, while it runs. At first the new language can take over logically isolated parts of the app: the management dashboard, or the chat window, or a form. But eventually you must mix components from both languages together – for example, to support shared global state.\n At this point you can’t just let the new language take over a DOM node. You need to support simple, clear features for intermixing the languages. Fortunately, you can transform the interface of idiomatic PureScript code into idiomatic JavaScript (and vice versa). With  react and  react-basic you can write business logic in PureScript but easily interoperating with the larger React ecosystem and your existing code.\n In this article I will demonstrate how to replace part of a React application with simple components written in PureScript. Along the way, I’ll share best practices for making this interop convenient and dependable. The examples will be simple, but the same techniques also apply to complex components.\n   I encourage you to code along with this article; no code is omitted and dependencies are pinned to help ensure the examples are reproducible. This code uses Node  v11.1.0, Yarn  v1.12.0, and NPX  v6.5.0 installed globally, and PureScript tooling installed locally.\n Peter Murphy has  implemented the ideas in this article using React Hooks if you’d like to see this in action.\n Get notified when new posts are published or I have important updates, and help me decide what to write next!\n  We are going to write a tiny React application which shows a few counters, and then we’re going to replace its components with PureScript. The resulting JavaScript code will be indistinguishable, aside from imports, from the original, and yet it will all be PureScript under the hood.\n Let’s follow the official React docs in using  create-react-app to initialize the project and then trim our source code to the bare minimum.\n    We have a handful of source files under  src, but our application will need just two of them:  index.js, the entrypoint for Webpack, and  App.js, the root component of our application. We can delete the rest:\n # Delete all the source files except for the entrypoint and # root app componentfind src -type f -not  \\( -name  &#39;index.js&#39; -or -name  &#39;App.js&#39;  \\) -delete\n Finally, let’s replace the contents of those two files with the bare minimum we’ll need for this article. From here on out I’ll supply diffs that you can supply to  git apply to apply the same changes I did.\n    // src/App.js  import  React  from  &#34;react&#34; ; function  App ()  {  return  (  &lt; div &gt;  &lt; h1 &gt; My  App &lt;/ h1 &gt;  &lt;/ div &gt;  ); } export  default  App ;\n  Let’s write our first React component: a counter. This is likely the first example of a React component you ever encountered; it’s the first example in the PureScript React libraries as well. It’s also small and simple enough to be replaced twice over the course of this article.\n  The counter will be a button which maintains the number of times it has been clicked. It will accept, as its only prop, a label to display on the button.\n // src/Counter.js  import  React  from  &#34;react&#34; ; class  Counter  extends  React . Component  {  constructor ( props )  {  super ( props );  this . state  =  {  count :  0  };  }  render ()  {  return  (  &lt; button  onClick = {()  = &gt;  this . setState ({  count :  this . state . count  +  1  })} &gt;  { this . props . label } :  { this . state . count }  &lt;/ button &gt;  );  } } export  default  Counter ;\n  --- a/src/App.js  +++ b/src/App.js  @@ -1,9 +1,13 @@  import React from &#34;react&#34;; +import Counter from &#34;./Counter&#34;;  function App() { return ( &lt;div&gt; &lt;h1&gt;My App&lt;/h1&gt; + &lt;Counter label=&#34;Count&#34; /&gt; + &lt;Counter label=&#34;Clicks&#34; /&gt; + &lt;Counter label=&#34;Interactions&#34; /&gt;  &lt;/div&gt; ); }\n With  yarn start we can run the dev server and see our app in action.\n   We’ve written entirely too much JavaScript. Let’s support PureScript in this project as well. Our goal is to write code in either language and freely import in either direction without friction. To accomplish that, we will install PureScript tooling, create a separate PureScript source directory, and rely on the compiler to generate JavaScript code.\n  First we must install PureScript tooling. I recommend installing versions of the compiler and Spago (a package manager and build tool) which match those used in this article. I’ll use NPX to ensure all commands are run using local copies.\n # Install the compiler and the Spago package manager however you prefer; # since we&#39;re already in a React project I&#39;ll use Yarnyarn add -D purescript@0.13.2 spago@0.8.4\n  We can create a new PureScript project with  spago init. As of version 0.8.4, Spago always initializes with the same package set, which means you should have identical package versions to those used to write this article. I’m using the  psc-0.13.0-20190607 package set.\n # npx ensures we&#39;re using our local copy of Spago installed in node_modules.npx spago init\n Spago has created a  packages.dhall file which points at the set of packages which can be installed and a  spago.dhall file which lists the packages we’ve actually installed. We can now install any dependencies we need and we’ll know for sure the versions are all compatible.\n Before installing anything, let’s update the existing  .gitignore file to cover PureScript. For a Spago-based project this will work:\n   Finally, let’s organize our source code. It’s typical to separate JavaScript source from PureScript source except when writing an FFI file for PureScript. Since we aren’t doing that in this project, our source files will be entirely separated. Let’s move all JavaScript code into a  javascript subdirectory and create a new  purescript folder next to it.\n   --- a/src/index.js  +++ b/src/index.js  @@ -1,5 +1,5 @@  import React from &#34;react&#34;; import ReactDOM from &#34;react-dom&#34;; -import App from &#34;./App&#34;;  +import App from &#34;./javascript/App&#34;;  ReactDOM.render(&lt;App /&gt;, document.getElementById(&#34;root&#34;));\n We’ve just one task left. The PureScript compiler generates JavaScript into a directory named  output in the root of the project. But  create-react-app disables importing anything outside the  src directory. While there are fancier solutions, for this project we’ll get around the restriction by symlinking the  output directory into the  src directory.\n   src├── index.js├── javascript│ ├── App.js│ └── Counter.js├── output -&gt; ../output└── purescript\n  I like to follow four simple steps when replacing a JavaScript React component with a PureScript one:\n Write a separate interop module for the component. This module provides the JavaScript interface and conversion functions between PureScript and JavaScript types and idioms.\n We’ll start with the  react library, which we use at Awake Security. It’s similar to  react-basic but maps more directly to the underlying React code and is less opinionated. Later, we’ll switch to  react-basic, which will demonstrate some differences between them.\n As we take each step in this process I’ll explain more about why it’s necessary and some best practices to keep in mind. Let’s start: install the  react library and prepare to write our component:\n # install the purescript-react librarynpx spago install react # build the project so editors can pick up the `output` directorynpx spago build # create the component source filetouch src/purescript/Counter.purs\n  Even though we are writing a component to be used from JavaScript, we should still write ordinary PureScript. As we’ll soon see, it’s possible to adjust only the interface of the component for JavaScript but leave the internals untouched. This is especially important if this component is meant to be used by both PureScript and JavaScript; we don’t want to introduce any interop-related awkwardness to either code base.\n Below, I’ve written a version of the component with the same props, state, and rendering. Copy its contents into  src/purescript/Counter.purs.\n Note: It’s not necessary to annotate  this when creating a component, but doing so improves the quality of errors if you do something wrong.\n module  Counter  where import  Prelude import  React  ( ReactClass ,  ReactElement ,  ReactThis ,  component ,  createLeafElement ,  getProps ,  getState ,  setState ) import  React.DOM  as  D import  React.DOM.Props  as  P type  Props  =  {  label  ::  String  } type  State  =  {  count  ::  Int  } counter  ::  Props  -&gt;  ReactElement counter  =  createLeafElement  counterClass counterClass  ::  ReactClass  Props counterClass  =  component  &#34;Counter&#34;  \\ ( this  ::  ReactThis  Props  State )  -&gt;  do  let  render  =  do  state  &lt;-  getState  this  props  &lt;-  getProps  this  pure  $  D . button  [  P . onClick  \\ _  -&gt;  setState  this  {  count :  state . count  +  1  }  ]  [  D . text  $  props . label  &lt;&gt;  &#34;: &#34;  &lt;&gt;  show  state . count  ]  pure  {  state :  {  count :  0  }  ,  render  }\n In a PureScript codebase this is all we need; we could use this component by importing  counter and providing it with its props:\n -- compare to our JavaScript main app import  Counter  ( counter ) renderApp  ::  ReactElement renderApp  =  div&#39;  [  h1&#39;  [  text  &#34;My App&#34;  ]  ,  counter  {  label :  &#34;Count&#34;  }  ,  counter  {  label :  &#34;Count&#34;  }  ,  counter  {  label :  &#34;Count&#34;  }  ]\n We can already use this component from JavaScript, too. The  react library will generate a usable React component from this code which we can import like any other JavaScript React component. Let’s go ahead and try it out, and then we’ll make a few improvements.\n   Then we’ll import the component. Note how our implementation is close enough that we only have to change the import, nothing else! PureScript will generate files in  output, so our counter component now resides at  output/Counter.\n --- a/src/javascript/App.js  +++ b/src/javascript/App.js  @@ -1,5 +1,5 @@  import React from &#34;react&#34;; -import Counter from &#34;./Counter&#34;;  +import { counter as Counter } from &#34;../output/Counter&#34;;  function App() { return (\n Run  yarn start and you ought to see the exact same set of counters as before. With our component now implemented in PureScript we don’t need our JavaScript version anymore:\n    We were lucky our component worked right away. In fact, it only worked because we’re using simple JavaScript types so far and the users of our counter component are trustworthy and haven’t omitted the label prop, which we consider required. We can enforce correct types and no missing values in PureScript, but not in JavaScript.\n   Well, setting  undefined as a label is not  good, but it’s not as bad as the entire app crashing – which is what happens if you attempt to use PureScript functions on the value you have pretended is a  String. The problem is that the  String type doesn’t quite capture what values are likely to arrive from JavaScript. As a general rule, I expect people to write JavaScript they way they usually do, which means using builtin types, regular uncurried functions, and to sometimes omit information and supply  null or  undefined instead. That’s why at Awake Security we usually provide an interop module for components that will be used in JavaScript code, which:\n Provides a mapping between PureScript types used in the component and a simple JavaScript representation\n Adds a layer of safety by marking all inputs that could reasonably be  null or  undefined with the  Nullable type, which helps our code handle missing values gracefully\n Translates functions in their curried form into usual JavaScript functions, and translates effectful functions (represented as thunks in generated code) into functions that run immediately when called\n Serves as a canary for changes in PureScript code that will affect dependent JavaScript code so that you can be extra careful\n Over the remainder of the article we’ll explore each of these techniques. For now, all we need to do is mark the input string as  Nullable and explicitly handle what should happen when it is omitted.\n      module  Counter.Interop  where import  Prelude import  Counter  ( Props ,  counter ) import  Data.Maybe  ( fromMaybe ) import  Data.Nullable  ( Nullable ,  toMaybe ) import  React  ( ReactElement ) type  JSProps  =  {  label  ::  Nullable  String  } jsPropsToProps  ::  JSProps  -&gt;  Props jsPropsToProps  {  label  }  =  {  label :  fromMaybe  &#34;Count&#34;  $  toMaybe  label  } jsCounter  ::  JSProps  -&gt;  ReactElement jsCounter  =  counter  &lt;&lt;&lt;  jsPropsToProps\n We have created a new interface for our component,  JSProps, which will be used in JavaScript instead of our PureScript interface,  Props. We’ve also created a function which translates between the two interfaces, and produced a new component which uses the JavaScript interface instead of the PureScript one.\n Marking the  label prop as  Nullable makes the compiler aware the string may not exist. It then forces us to explicitly handle the  null or  undefined case before we can treat the prop as a usual  String. We’ll need to handle the null case in order to map our new  JSProps type to our component’s expected  Props type. To do that, we convert  Nullable to  Maybe and then provide a fallback value to use when the prop does not exist.\n The  Nullable type is explicitly for interop with JavaScript, but it doesn’t always behave exactly the way you would expect. It does not map directly to the ordinary  Maybe type. You should usually convert any  Nullable types to  Maybe as soon as possible.  Check out the nullable library if you’d like to learn more about this.\n Let’s change the import in  App.js and verify that the omitted label is handled gracefully.\n --- a/src/javascript/App.js  +++ b/src/javascript/App.js  @@ -1,5 +1,5 @@  import React from &#34;react&#34;; -import { counter as Counter } from &#34;../output/Counter&#34;;  +import { jsCounter as Counter } from &#34;../output/Counter.Interop&#34;;  function App() { return (\n   In this case our interop module simply marked a single field as  Nullable. But it’s common for the JavaScript interface to diverge slightly from the PureScript interface it is translating. Keeping a separate interop module makes it easy to do this without affecting the core component.\n It also ensures that any changes to the underlying component are reflected as type errors in the interop file rather than (potentially) silently breaking JavaScript code. It’s easy to become lazy about this when you’re used to the compiler warning you of the effect changes in one file will have in another!\n If you use TypeScript, Justin Woo has  written a piece on transparently sharing types with Typescript from PureScript which is worth reading.\n  Let’s try replacing the counter again, but this time with the newer, more opinionated  react-basic library. Along the way we’ll use a few more complex types and build a more sophisticated interop module.\n    module  Counter  where import  Prelude import  React.Basic  ( JSX ,  createComponent ,  make ) import  React.Basic.DOM  as  R import  React.Basic.DOM.Events  ( capture_ ) type  Props  =  {  label  ::  String  } counter  ::  Props  -&gt;  JSX counter  =  make  ( createComponent  &#34;Counter&#34; )  {  initialState ,  render  }  where  initialState  =  {  count :  0  }  render  self  =  R . button  {  onClick :  capture_  $  self . setState  \\s  -&gt;  s  {  count  =  s . count  +  1  }  ,  children :  [  R . text  $  self . props . label  &lt;&gt;  &#34; &#34;  &lt;&gt;  show  self . state . count  ]  }\n The two React libraries don’t share types, so we’ll change our interop module to describe producing  JSX rather than a  ReactElement.\n --- a/src/purescript/Counter/Interop.purs  +++ b/src/purescript/Counter/Interop.purs  @@ -5,13 +5,13 @@ import Prelude  import Counter (Props, counter) import Data.Maybe (fromMaybe) import Data.Nullable (Nullable, toMaybe) -import React (ReactElement)  +import React.Basic (JSX)  type JSProps = { label :: Nullable String } jsPropsToProps :: JSProps -&gt; Props jsPropsToProps { label } = { label: fromMaybe &#34;Count&#34; $ toMaybe label } -jsCounter :: JSProps -&gt; ReactElement  +jsCounter :: JSProps -&gt; JSX  jsCounter = counter &lt;&lt;&lt; jsPropsToProps\n  This component works perfectly well in a PureScript codebase. Unlike our  react component, though, our  react-basic component will not automatically work in JavaScript code also. Instead, we need to use  make to construct a component meant for PureScript and  toReactComponent to construct one for JavaScript.\n Still, both functions use the same component spec type, so the new restriction is easy to work around. We’ll simply move  initialState and  render out to the module scope. That way we can import them directly into our interop module to supply to  toReactComponent.\n --- a/src/purescript/Counter.purs  +++ b/src/purescript/Counter.purs  @@ -2,21 +2,28 @@ module Counter where  import Prelude -import React.Basic (JSX, createComponent, make)  +import React.Basic (Component, JSX, Self, createComponent, make)  import React.Basic.DOM as R import React.Basic.DOM.Events (capture_) type Props = { label :: String } +type State = { count :: Int } + +component :: Component Props +component = createComponent &#34;Counter&#34; +  counter :: Props -&gt; JSX -counter = make (createComponent &#34;Counter&#34;) { initialState, render } - where - initialState = { count: 0 } - - render self = - R.button - { onClick: - capture_ $ self.setState \\s -&gt; s { count = s.count + 1 } - , children: - [ R.text $ self.props.label &lt;&gt; &#34; &#34; &lt;&gt; show self.state.count ] - }  +counter = make component { initialState, render } + +initialState :: State +initialState = { count: 0 } + +render :: Self Props State -&gt; JSX +render self = + R.button + { onClick: + capture_ $ self.setState \\s -&gt; s { count = s.count + 1 } + , children: + [ R.text $ self.props.label &lt;&gt; &#34; &#34; &lt;&gt; show self.state.count ] + }\n We’ll leave the code otherwise unchanged. Next, let’s turn to the interop module. It should now use  toReactComponent to create a component usable from JavaScript. This function takes the component and component spec, exactly the same way that  make does, but it  also takes an additional argument: our  jsPropsToProps function.\n The  react-basic library makes interop more explicit than  react does, but ultimately we’ll write nearly the same interop code.\n --- a/src/purescript/Counter/Interop.purs  +++ b/src/purescript/Counter/Interop.purs  @@ -2,16 +2,15 @@ module Counter.Interop where  import Prelude -import Counter (Props, counter)  +import Counter (Props, component, initialState, render)  import Data.Maybe (fromMaybe) import Data.Nullable (Nullable, toMaybe) -import React (ReactElement) -import React.Basic (JSX)  +import React.Basic (ReactComponent, toReactComponent)  type JSProps = { label \n......", "posttime": "2020-06-25 11:29:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "javascript,java,purescript", "title": "如何编写PureScript Reaction组件来取代JavaScript", "title_en": "How to Write PureScript React Components to Replace JavaScript", "transed": 1, "url": "https://thomashoneyman.com/articles/replace-react-components-with-purescript/", "via": "", "real_tags": ["java"]}, {"category": "", "categoryclass": "", "imagename": "489239a06bbfff26e43e19a01077dafa.png", "infoid": 1008056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Silq是苏黎世理工大学开发的一种用于量子计算的新型高级编程语言，具有很强的静态类型系统。", "note_en": "Silq is a new high-level programming language for quantum computing with a strong static type system, developed at ETH Zürich.", "posttime": "2020-06-25 11:27:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,量子,high", "title": "Silq：一种新的量子计算高级编程语言", "title_en": "Silq: A new high-level programming language for quantum computing", "transed": 1, "url": "https://silq.ethz.ch/", "via": "", "real_tags": ["编程", "量子", "high"]}, {"category": "", "categoryclass": "", "imagename": "6af62d26c845c68610b0e8ab10483f5b.jpg", "infoid": 1008055, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迈克尔·霍利(Michael Hawley)周三在马萨诸塞州剑桥市的家中去世。霍利是一名计算机程序员、教授、音乐家、演讲稿撰稿人和制片人，他帮助为现在所说的物联网奠定了理论基础。他58岁。\n霍利的职业生涯始于“星球大战”导演乔治·卢卡斯创建的卢卡斯影业公司，当时他是一名视频游戏程序员。他在过去的15年里一直在策划娱乐聚会(EG)，这是一个致力于新想法的会议。\n在此期间，他在史蒂夫·乔布斯(Steve Jobs)于20世纪80年代中期离开苹果后创立的颇具影响力的计算机公司NeXT工作，并在麻省理工学院媒体实验室(Massachusetts Institute Of Technology Media Lab)担任了九年的教授，这是一项开创性的努力，旨在推动科学技术进入艺术和其他学科。他被认为是一位思想、技能和友谊跨越异常广泛的领域的学者，从登山到制表。\n霍利曾与乔布斯和人工智能先驱马文·明斯基(Marvin Minsky)生活在一起，出版过世界上最大的一本书，在一次业余钢琴家的国际比赛中获得一等奖，在著名科学家比尔·奈(Bill Nye)的婚礼上与大提琴演奏家马友友(Yo-Yo Ma)并肩作战，参加了首批珠穆朗玛峰科学探险活动之一，并为乔布斯和谷歌联合创始人拉里·佩奇(Larry Page)撰写了毕业典礼演讲。\n霍利的两个媒体实验室项目--Things Think和Toys of Tomorrow--预见到了物联网运动，物联网运动的目标是将数字技术融入从汽车到电视再到家庭照明系统的一切领域。根据市场研究公司Statista的数据，在亚马逊(Amazon)、谷歌(Google)、英特尔(Intel)和微软(Microsoft)等公司的带领下，这场运动现在是一个价值2480亿美元的市场。\n媒体实验室创始人尼古拉斯·尼葛洛庞帝(Nicholas Negroponte)在一封电子邮件中说，霍利发展出了“一种在物联网出现之前很久就出现的想法模式”。\n“我认为这种模式不是人工智能，而是人工智能，”他写道。\n独立计算机安全顾问马克·塞登(Mark Seiden)在20世纪80年代初认识了霍利，当时他们都在巴黎的音乐实验室IRCAM工作，并最终在卢卡斯电影公司聘用了他。他将霍利的事迹与乔治·普林斯顿(George Plimpton)相提并论，后者的参与式新闻让他伪装成拳击手、职业橄榄球运动员、马戏团表演者和单口喜剧演员。\n“普林普顿是一位著名的业余爱好者，”塞登说。“迈克和普林普顿一样是多元化的--只是他不是外行。”\n迈克尔·杰罗姆·霍利1961年11月18日出生在加利福尼亚州海滨附近的彭德尔顿海军陆战队营地，父母是玛丽·凯(Dixon)和乔治·霍利，在纽瓦克以西约17英里的新泽西州新普罗维登斯长大。还在高中时，他就在贝尔实验室实习，他的父亲是那里的一名电气工程师。他还接受了多年的钢琴家正规培训，并在耶鲁大学本科期间同时学习音乐和计算机科学，并分别获得了学位。\n20世纪80年代初，霍利在卢卡斯影业的大堂与乔布斯见面后，与他合住一所房子，并在NeXT工作了六年，该公司的目标是制造一种新型的个人电脑。为了这台机器，霍利先生建造了首批数字图书馆之一。霍利的一位朋友曾在牛津大学出版社(Oxford University Press)制作新版“莎士比亚全集”(The Complete Of Shakespeare)，所以霍利和乔布斯飞往英国，就数字文件的交易进行谈判，预付2000美元，每售出一台个人电脑支付74美分。\n当下一台机器启动时，霍利添加了一本词典、一本同义词词典和一本语录--所有这些现在都是标准的在线票价。\n2005年，他帮助撰写了乔布斯在斯坦福大学(Stanford University)毕业典礼上的演讲(“保持饥饿，保持愚蠢”是其中一句经常被引用的台词)，这句话在很大程度上将这位苹果创始人在过去十年里定义为国际名人。四年后，在乘船穿越旧金山湾与佩奇相遇后，霍利重复了这一伎俩，并撰写了佩奇在密歇根大学(University Of Michigan)发表的毕业演讲。\n1985年，霍利作为研究生加入了全新的麻省理工学院媒体实验室，他住在明斯基的阁楼上，博士毕业后，他继续留在麻省理工学院担任教授。\n1998年，他在一次珠穆朗玛峰探险中担任科学总监。四年后，他在沃斯堡举行的享有盛誉的范克利本业余钢琴比赛中并列第一，演奏了自己改编的一套“西区故事”的曲目。(事实证明，他对百老汇演出曲调的选择是一个有争议的选择。)。\n作为麻省理工学院特别项目的负责人，霍利在2003年出版了“不丹：喜马拉雅王国的视觉奥德赛”(不丹：穿越喜马拉雅王国的视觉奥德赛)，他的经历和照片涵盖了他在过去15年里四次访问不丹的经历和照片。这本书长5英尺，宽7英尺，重量超过130磅，当时被吉尼斯世界纪录认证为世界上最大的书。\n“迈克尔总是在寻找一些很酷的新点子，”塞登说。“然后他就真的会这么做了。”\n霍利和他的妻子尼娜·尤(Nina You)在七世纪的不丹寺庙Kyichu Lhakang结婚，住在东剑桥一座有193年历史的教堂里，那里有三架钢琴，其中包括一架施坦威(Steinway)钢琴。她和他的父亲在他身后留下了儿子第谷(Tycho)、女儿乔基·拉莫(Choki Lhamo)和两个兄弟斯蒂芬(Stephen)和帕特里克(Patrick)。\n四月中旬，随着霍利先生的癌症在冠状病毒大流行中恶化，尼葛洛庞帝先生组织了一次网上庆典，庆祝自己的学术成果。那些谈论霍利及其成就的人包括互联网创始人之一伦纳德·克莱因罗克(Leonard Kleinrock)、“全球目录”(The Whole Earth Catalog)主编斯图尔特·布兰德(Stewart Brand)和法律学者劳伦斯·特雷布(Laurence Tribe)。这是由美国国家公共广播电台游戏节目“Wait，Wait…”的主持人彼得·萨格尔主持的。别告诉我！“。\n“我不知道Festschrift是什么，”萨加尔在接受采访时说，他想知道这是不是霍利帮助推广到世界各地的又一个大创意。", "note_en": "Michael Hawley, a computer programmer, professor, musician, speechwriter and impresario who helped lay the intellectual groundwork for what is now called the Internet of Things, died on Wednesday at his home in Cambridge, Mass. He was 58.\n  Mr. Hawley began his career as a video game programmer at Lucasfilm, the company created by the “Star Wars ” director George Lucas. He spent his last 15 years curating the Entertainment Gathering, or EG, a conference dedicated to new ideas.\n In between, he worked at NeXT, the influential computer company founded by  Steve Jobs after he left Apple in the mid-1980s, and spent nine years as a professor at the Massachusetts Institute of Technology Media Lab, a seminal effort to push science and technology into art and other disciplines. He was known as a scholar whose ideas, skills and friendships spanned an unusually wide range of fields, from mountain climbing to watchmaking.\n Mr. Hawley lived with both Mr. Jobs and the artificial intelligence pioneer  Marvin Minsky, published the world’s largest book, won first prize in an international competition of amateur pianists, played alongside the cellist Yo-Yo Ma at the wedding of the celebrity scientist Bill Nye, joined one of the first scientific expeditions to Mount Everest, and wrote commencement speeches for both Mr. Jobs and the Google co-founder Larry Page.\n Two of Mr. Hawley’s Media Lab projects — Things That Think and Toys of Tomorrow — anticipated the Internet of Things movement, which aims to weave digital technology into everything from cars to televisions to home lighting systems. Led by companies like Amazon, Google, Intel and Microsoft, the movement is now a $248 billion market, according to the market research firm Statista.\n Mr. Hawley developed “a pattern of ideas that emerged long before the Internet of Things,” Nicholas Negroponte, founder of the Media Lab, said in an email.\n “I would call that pattern not artificial intelligence, but intelligence in the artificial,” he wrote.\n Mark Seiden, an independent computer security consultant who met Mr. Hawley in the early 1980s when they were both working at IRCAM, a music lab in Paris, and eventually hired him at Lucasfilm, compared Mr. Hawley’s exploits to those of  George Plimpton, the writer whose participatory kind of journalism had him masquerading as a boxer, a professional football player, a circus performer and a stand-up comedian.\n “Plimpton was a famous dilettante,” Mr. Seiden said. “Mike was just as a diverse as Plimpton — except he wasn’t a dilettante.”\n Michael Jerome Hawley was born on Nov. 18, 1961, at the Camp Pendleton Marine Corps base near Oceanside, Calif., to Mary Kay (Dixon) and George Hawley, and grew up in New Providence, N.J., about 17 miles west of Newark. While still in high school, he interned at Bell Labs, where his father was an electrical engineer. He also underwent years of formal training as a pianist and went on to study both music and computer science as an undergraduate at Yale, earning degrees in each.\n After meeting Mr. Jobs in the lobby of Lucasfilm in the early 1980s, Mr. Hawley shared a house with him and spent six years at NeXT, which aimed to build a new kind of personal computer. For this machine Mr. Hawley built one of the first digital libraries. A friend of his had worked on a new edition of “The Complete Works of Shakespeare” at Oxford University Press, so Mr. Hawley and Mr. Jobs flew to England to negotiate a deal for the digital files, offering $2,000 upfront and 74 cents for each personal computer sold.\n When the NeXT machine was launched, Mr. Hawley added a dictionary, a thesaurus and a book of quotations — all now standard online fare.\n In 2005, he helped write  Mr. Jobs’s Stanford University commencement speech (“Stay hungry, stay foolish” was one of its much-quoted lines), which did much to define the Apple founder as an international celebrity in his last decade. Four years later, after meeting Mr. Page on a boat ride across San Francisco Bay, Mr. Hawley repeated the trick, writing the commencement speech that Mr. Page delivered at the University of Michigan.\n After he joined the brand-new MIT Media Lab as a graduate student in 1985, Mr. Hawley lived in Mr. Minsky’s attic, and after finishing his Ph.D. he stayed on at M.I.T. as a professor.\n In 1998, he served as the scientific director on an expedition to Mount Everest. Four years later, he tied for first place in the prestigious  Van Cliburn amateur piano competition in Fort Worth, playing his own arrangement of a suite of pieces from “West Side Story.” (His selection of Broadway show tunes proved a controversial choice.)\n  As the director of special projects at M.I.T., Mr. Hawley  published “Bhutan: A Visual Odyssey Across the Himalayan Kingdom” in 2003, drawing on his experiences and photographs spanning four visits to Bhutan over a decade and a half. Measuring five by seven feet and weighing more than 130 pounds, it was certified by Guinness World Records at the time as the world’s largest book.\n “Michael was always finding some cool new idea,” Mr. Seiden said. “And then he would actually do it.”\n Mr. Hawley and his wife, Nina You, were married at Kyichu Lhakhang, a seventh-century Bhutanese temple, and lived in a 193-year-old church in East Cambridge, where he kept three pianos, including a Steinway. She and his father survive him, as do a son, Tycho; a daughter, Choki Lhamo; and two brothers, Stephen and Patrick.\n In mid-April, as Mr. Hawley’s cancer worsened amid the coronavirus pandemic, Mr. Negroponte organized  an online Festschrift, a celebration of one’s scholarly work. Those that spoke about Mr. Hawley and his accomplishments included Leonard Kleinrock, one of the creators of the internet; Stewart Brand, editor of The Whole Earth Catalog; and the legal scholar Laurence Tribe. It was hosted by Peter Sagal, the host of the NPR game show “Wait, Wait … Don’t Tell Me!”\n “I didn’t know what a Festschrift was,” Mr. Sagal said in an interview, wondering if this was one more big idea Mr. Hawley had helped push across the world.", "posttime": "2020-06-25 11:26:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "媒体,hawley,霍利", "title": "麻省理工学院媒体实验室迈克尔·霍利逝世，享年58岁", "title_en": "Michael Hawley of MIT's Media Lab, Dies at 58", "transed": 1, "url": "https://www.nytimes.com/2020/06/24/technology/michael-hawley-dead.html", "via": "", "real_tags": ["媒体", "hawley", "霍利"]}, {"category": "", "categoryclass": "", "imagename": "cdce7caf9e4f07a2df8cc8b9ff73b13d.jpeg", "infoid": 1008054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纽约时报”一位名叫凯德·梅兹(Cade Metz)的记者负责摧毁一个名为“板岩之星法典”(Slate Star Codex)的优秀博客，这对我来说并不令人惊讶。\n据该博客的匿名作者透露，据“国家评论”透露，一名泰晤士报记者最近联系了他，说他正在博客上写一篇文章。他“告诉我，对于科技界人士来说，我们是一个有趣的聚集地，这将是一件非常积极的事情。”\n但这其中有个陷阱。“不幸的是，”博主写道，“他告诉我他发现了我的真名，并将在文章中披露。”\n由于该博客的作者是一名执业精神病学家，笔名是“斯科特·亚历山大”，所以有很多理由不透露他的真名。但是梅兹不会容忍的。\n当我向记者表达这些担忧时，他说“纽约时报”的政策是实名，他无法改变这一点。在考虑了我的选择之后，我决定了你现在看到的那个。如果没有博客，就没有故事。或者，至少这个故事必须包括一些关于“纽约时报”为了点击量而拒绝随机博客作者的策略的讨论。\n所以他关闭了博客。随之而来的是一场批评风暴，在此期间，梅茨被发现是在胡说八道。他愿意向那些想要与他谈论博客的人提供匿名-这公然违反了时报对文章中引用的消息来源给予匿名的政策。\n我相信梅兹开始写这个故事的目的是为了演绎“斯科特·亚历山大”。我认为他关于这篇文章会是有利的保证也可以被丢弃，因为他的竞选言论太多了。我抱有这种信念，因为我和梅茨打过交道，我发现他是一个完全肆无忌惮、不道德的记者--坦率地说，他是一个一流的臭鼬。\nDeep Capture是OverStock.com首席执行官帕特里克·伯恩运营的博客。他雇佣的打手是该公司的公关主管贾德·巴格利(Judd Bagley)。关于伯恩和巴格利的背景在互联网上随处可见，但这里有一篇关于伯恩的好文章，刊登在2005年的“财富”(Fortune)杂志上。如果你在伯恩担任首席执行官时对公司持批评态度-他去年逃到印尼，抛售了所有的股票-他出卖了巴格利。巴格利负责“深度捕捉”。\n诽谤和撒谎是一种有效的策略。记者苏珊·安蒂拉(Susan Antilla)几个月前在她的网站上观察到：\n多年来，伯恩和他的社交媒体伙伴贾德·巴格利(Judd Bagley)对那些不相信他们的阴谋论的记者进行了恶毒的攻击。它们足够有效，以至于一位财经新闻界的明星曾经告诉我，因为伯恩让记者们经历了所有的悲痛，所以不值得写关于他的文章。\n凯德·梅兹不是那些记者中的一员。他是伯恩和巴格利的朋友，在报纸上宣传他们的疯狂。\n完全基于巴格利的“研究”，梅茨在“登记册”中列出了一些片段，然后“连线”将伯恩疯狂的阴谋论全部吞下了-他将股市的所有弊病归咎于“股票伪造”-并将他所有真实和假想的敌人都纳入其中。伯恩/巴格利/梅兹声称，我编辑维基百科是为了推进这一阴谋，我在华尔街清算机构存托信托公司(Depository Trust Company)的一个办公室里工作。这一切都是彻头彻尾的垃圾，从头到尾都是谎言。但是巴格利和伯恩不在乎。\n最终伯恩和巴格利名誉扫地。巴格利是一名吸毒者，他因8项重罪被捕，罪名是伪造药物处方，在从药剂师到药剂师的过程中利用年幼的女儿作为掩护。他恳求不要坐牢。\n伯恩和他在深度捕捉公司的下属在加拿大成为他谎言的受害者之一提起的诽谤诉讼的对象。一名加拿大商人受到了通常的虚构指控，比如他是基地组织的金融家。伯恩的错误是让一名加拿大居民接受这种治疗。加拿大可能是地球上因诽谤而被起诉的最糟糕的地方。\n商人阿尔塔夫·纳泽拉利(Altaf Nazerali)提起诉讼，并在2016年赢得了创纪录的判决。纳泽拉利获得惩罚性赔偿和律师费，伯恩在漫长而严厉的判决中受到严厉批评。法院发现，伯恩和他的下属表现出“对真相的鲁莽漠视”，他们的动机是“损害”纳泽拉利，并引用了“伯恩先生公开表达的对原告的敌意，甚至仇恨”。\n法院的结论是，“证据很清楚，他们的意图是进行一场仇杀，而纳泽拉利先生本人的真相是无关紧要的。”\n尽管有诽谤的判决，梅茨仍在继续写吹捧伯恩的吹捧文章，兜售他的谎言和古怪的华尔街阴谋论-这些阴谋论涵盖了每一位批评他的媒体成员。梅兹从未提到诽谤诉讼或巴格利的伪造定罪。\n当伯恩于2019年8月逃到印尼并抛售他在Overstock的巨额股份时，梅茨与人合写了一篇文章，没有提到他对批评者的诽谤运动，也像往常一样，没有提到诽谤判决，这一判决已经在上诉中得到维持。首席执行官并不是每天都会受到这样的诽谤判决的打击，但在梅茨看来，这并不适合发表。他还对伯恩骚扰和攻击记者的运动只字不提，这一点泰晤士报自己也有报道。\n这并不令人惊讶-就像他试图对斯科特·亚历山大(Scott Alexander)进行“深度捕获”一样。\n“深度捕捉”的一个主要目的是斗鱼。巴格利对伯恩的任务之一是揭露匿名的互联网身份。他通常都会失败。没问题。他只是编造了些东西。\n在为数不多的几次谈话中，我犯了一个错误，那就是在梅茨开始公关时与他进行了交谈。在为伯恩竞选时，他向我明确表示，他完全相信伯恩的阴谋论，并赞同巴格利的策略。\n在我与他的第一次交谈中，梅茨歪曲了他准备的关于伯恩的文章的倾向性，表明这将是一篇强硬和怀疑的文章，而不是他制作的夸张的文章。因此，我要提醒斯科特·亚历山大和他的盟友们，要对梅茨的说法持怀疑态度，他说他计划做一个“积极的故事”，或者“时报政策”是他想要除掉亚历山大的原因。记者汤姆·奇弗斯(Tom Chivers)说，梅茨告诉他“他的编辑不会让他在没有点名的情况下写一篇关于亚历山大的文章。”\n这是有可能的。但我的理论是，他想让亚历山大在“泰晤士报”的枪械库存中占有一席之地，而不是因为他被一项他无法回避的糟糕政策束缚住了手铐。\n我预计“泰晤士报”会像记者们被抓个正着时那样，绕着梅兹转一圈。多亏了互联网，梅茨对斯科特·亚历山大的卑鄙待遇现在正在向所有人展示。无论凯德·梅兹发生什么事，无论他是被“纽约时报”关在怀里还是被赶走，任何和他谈话的人都是在冒很大的风险。我不会相信梅兹说过的任何一句话，包括“你好”和“我想外面在下雨。”", "note_en": "It’s no surprise to me that a  New York Times reporter named Cade Metz is responsible for the destruction of a superb blog called  Slate Star Codex.\n According to the anonymous author of the blog, a  Times reporter,  revealed by  National Review to be Metz, contacted him recently to say that he was writing an article on the blog. He “told me it would be a mostly positive piece about how we were an interesting gathering place for people in tech.”\n But there was a catch. “Unfortunately,” the blogger wrote, “he told me he had discovered my real name and would reveal it in the article, ie doxx me.”\n Since the blog’s author was a practicing psychiatrist, who writes under the pseudonym “Scott Alexander,” there were plenty of reasons not to reveal his real name. But Metz would have none of it.\n  When I expressed these fears to the reporter, he said that it was New York Times policy to include real names, and he couldn’t change that. After considering my options, I decided on the one you see now. If there’s no blog, there’s no story. Or at least the story will have to include some discussion of NYT’s strategy of doxxing random bloggers for clicks.\n So he shut the blog. A storm of criticism followed, during which it was revealed that Metz was talking out of both sides of his mouth. He had readily  offered anonymity to people who wanted to talk with him about the blog — a blatant violation of  Times policy on granting anonymity to sources quoted in articles.\n I believe that Metz embarked on this story with the intent of doxing “Scott Alexander.” I think his assurances that the article would be favorable can also be discarded as so much campaign rhetoric. I hold that belief because I have dealt with Metz, and I found him to be a totally unscrupulous, unethical reporter — a first-class skunk, to put it bluntly.\n  Deep Capture was a blog run by Overstock.com’s CEO Patrick Byrne. The hatchet man he employed as its “editor” was the company’s public relations chief Judd Bagley. Background on Byrne and Bagley can be found throughout the Internet, but here’s a  good piece on Byrne from 2005 in Fortune. If you were critical of the company when Byrne was CEO — he fled to Indonesia last year and dumped all his stock — he sicced Bagley on you. Bagley ran Deep Capture.\n Smears and lies were an effective strategy. Journalist Susan Antilla  observed in her website a few months ago:\n Over the years, Byrne and his social media sidekick Judd Bagley staged vicious attacks on the reporters who didn’t buy their conspiracy theories. They were effective enough that a star of financial journalism once told me it wasn’t worth writing about Byrne because of all the grief he put reporters through.\n Cade Metz wasn’t one of those journalists. He was a pal of Byrne and Bagley, promoting their craziness in print.\n Based solely on Bagley’s “research,” Metz ran pieces in  The Register and then  Wired swallowing whole all of Byrne’s insane conspiracy theories — he blamed all the stock market’s ills on “stock counterfeiting” — and included all of his real and imagined enemies in the mix. Byrne/Bagley/Metz claimed that I edited Wikipedia in furtherance of the conspiracy, working out of an an office at the Depository Trust Company, a Wall Street clearing operation. All of it was complete garbage, lies from beginning to end. But Bagley and Byrne didn’t care.\n  Eventually Byrne and Bagley were discredited. Bagley, a drug addict, was  arrested on eight felony counts of forging drug prescriptions, using his young daughter for cover as he went from pharmacist to pharmacist. He copped a plea to keep out of prison.\n  Byrne and his subordinates at Deep Capture were the subject of a libel suit in Canada by one of the victims of his lies. A Canadian businessmen had been targeted with the usual fictitious accusations, such as that he was a financier for Al Qaeda. Byrne’s mistake was to subject a Canadian resident to that treatment. Canada is probably the worst place on the planet to be sued for libel.\n The businessman, Altaf Nazerali, sued and won a record judgment in 2016. Nazerali was awarded  punitive damages and legal fees, and Byrne was excoriated in  a lengthy, scathing judgment. The court found that Byrne and his subordinates displayed a “reckless indifference for the truth,” that their motive was to “inflict damage” on Nazerali, and cited “the overt animosity, even hatred of the plaintiff, expressed by Mr. Byrne.”\n The court concluded that “it is clear on the evidence that their intention was to conduct a vendetta in which the truth about Mr. Nazerali himself was of no consequence.”\n  Despite the libel judgment, Metz continued to write puff pieces lionizing Byrne and peddling his lies and screwball Wall Street conspiracy theories — which encompassed every member of the press who ever was critical of him. Metz never mentioned the libel suit or Bagley’s forgery conviction.\n When Byrne fled to Indonesia in August 2019 and  dumped his immense stake in Overstock, Metz  co-wrote an article that didn’t mention his smear campaign against critics, and, as usual, failed to mention the libel verdict, which had already been upheld on appeal. It’s not every day that a CEO is smacked with that kind of libel verdict, but it wasn’t fit to print in Metz’s view. He also said not a word about Byrne’s campaign to harass and attack reporters, which  the Times itself had chronicled.\n  No surprise there — just as it is no surprise he would try to “pull a Deep Capture” on Scott Alexander.\n A principal purpose of Deep Capture was doxing. One of Bagley’s tasks for Byrne was to expose anonymous Internet identities. He usually failed. No problem. He just made stuff up.\n In one of the few conversations that I made the mistake of having with Metz when he was beginning his p.r. campaign for Byrne, he made it clear to me that he swallowed Byrne’s conspiracy theories hook, line and sinker, and approved of Bagley’s tactics.\n In my very first conversation with him, Metz misrepresented the slant of the article he was preparing on Byrne, indicating that it would be a tough and skeptical piece and not the puff piece he produced. So I would caution Scott Alexander and his allies to be skeptical of Metz’s statements that he was planning to do a “positive story” or that “Times policy” was the reason he wanted to dox Alexander. Journalist Tom Chivers,  says Metz told him “that his editors wouldn’t let him write a piece about Alexander without naming him.”\n That’s possible. But my theory is that he wanted to dox Alexander to get a notch on his gun stock at the  Times, not because he was handcuffed by a terrible policy he couldn’t duck.\n I expect that the Times will circle the wagons around Metz, as it tends to do when reporters are caught with their pants down. Thanks to the Internet, Metz’s shabby treatment of Scott Alexander is now on display for all to see. Whatever happens to Cade Metz, whether he’s kept in the bosom of the Times or sent packing, anyone who talks to him for a story is taking a grave risk. I wouldn’t believe a thing Metz ever says, including “hello” and “I think it’s raining outside.”", "posttime": "2020-06-25 11:26:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度,metz,伯恩", "title": "凯德·梅兹(Cade Metz)对板岩之星(Slate Star Codex)发起“深度捕获”", "title_en": "Cade Metz Pulls a ‘Deep Capture’ on Slate Star Codex", "transed": 1, "url": "https://medium.com/@garyweiss_86200/cade-metz-pulls-a-deep-capture-on-slate-star-codex-da649e8efe7", "via": "", "real_tags": ["深度", "metz", "伯恩"]}, {"category": "", "categoryclass": "", "imagename": "5d4e8b345de94e907d2048485b5febe3.jpg", "infoid": 1008053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国的研究人员使用他们所谓的“弹出式制造工艺”制造了HAMR-JR，这是一种微型机器人，与其以蟑螂为灵感的前身一样灵活。\nHAMR-JR由哈佛大学约翰·A·保尔森工程与应用科学学院(SEA)和哈佛·怀斯生物灵感工程研究所的研究人员开发，是HAMR-JR(哈佛动态微型机器人)的一半规模版本。\n大约1美分硬币大小的HAMR-JR几乎可以完成HAMR的所有壮举，使其成为迄今为止最灵巧的微型机器人之一。\n这篇论文的第一作者、前SEA和WYSS博士后研究员考希克·贾亚拉姆(Kaushik Jayaram)说：“大多数这种规模的机器人都非常简单，只展示了基本的移动性。”“我们已经证明，你不必在灵活性或大小控制上妥协。”\n这项研究几乎是在本周举行的第五届国际机器人与自动化大会(ICRA 2020)上发表的。\n小哈姆。它每秒可以跑14个身长，这使它不仅是最小的机器人之一，而且也是速度最快的微型机器人之一。(视频由Kaushik Jayaram提供/哈佛海洋提供)。\n根据该团队的说法，这项研究的一个关键问题是，用于制造以前版本的HAMR和其他微型机器人(包括The RoboBee)的弹出式制造工艺是否可以用于制造多个规模的机器人-从微型手术机器人到大型工业机器人。\nPC-MEMS(印刷电路微机电系统)是一种将机器人的部件蚀刻成2D薄板并以3D结构弹出的制造工艺。为了建造HAMR-JR，研究人员缩小了机器人的2D工作表设计-以及致动器和机载电路-以重建一个具有所有相同功能的较小的机器人。\n新设计的HAMR-JR与其前身HAMR-VI并驾齐驱。HAMR-JR在长度和宽度上只比一便士略大一点，使其成为最小但能力很强的高速昆虫规模的机器人之一。(图片来源：Kaushik Jayaram/哈佛海洋)。\n贾亚拉姆在一份声明中说：“这次演习的美妙之处在于，我们不必改变之前的设计。”“我们证明，这一过程基本上可以应用于各种尺寸的任何设备。”\nHAMR-JR长2.25厘米，重约0.3g。它每秒可以跑大约14个身长，使它成为最小、最快的微型机器人之一。\n该团队表示，缩小规模确实会改变步长和关节刚度等元素的一些原则，因此他们开发了一种模型，可以根据目标大小预测跑步速度、脚力和有效载荷等运动指标。然后可以使用该模型来设计具有所需规格的系统。", "note_en": "Researchers in the US have used their so-called ‘pop-up manufacturing process’ to fabricate HAMR-JR, a microrobot that is as agile as its cockroach-inspired predecessor.\n  Developed by researchers at the Harvard John A. Paulson School of Engineering and Applied Sciences (SEAS) and the Harvard Wyss Institute for Biologically Inspired Engineering, HAMR-JR is a half-scale version of HAMR (Harvard Ambulatory Microrobot).\n   About the size of one cent coin, HAMR-JR can perform almost all the feats of HAMR, making it one of the most dexterous microrobots to date.\n “Most robots at this scale are pretty simple and only demonstrate basic mobility,” said Kaushik Jayaram, a former postdoctoral fellow at SEAS and Wyss and first  author of the paper. “We have shown that you don’t have to compromise dexterity or control for size.”\n The research was presented virtually at the  International Conference on Robotics and Automation (ICRA 2020) this week.\n HAMR Jr. can run about 14 body lengths per second, making it not only one of the smallest but also one of the fastest microrobots. (Video courtesy of Kaushik Jayaram/Harvard SEAS)\n According to the team, a key question going into this research was whether or not the pop-up manufacturing process used to build previous versions of HAMR and other microbots, including the RoboBee, could be used to build robots at multiple scales – from tiny surgical bots to large-scale industrial robots.\n PC-MEMS (printed circuit microelectromechanical systems) is a fabrication process in which the robot’s components are etched into a 2D sheet and popped out in its 3D structure. To build HAMR-JR, the researchers shrunk the 2D sheet design of the robot – along with the actuators and onboard circuitry – to recreate a smaller robot with all the same functionalities.\n The newly designed HAMR-Jr alongside its predecessor, HAMR-VI. HAMR-Jr is only slightly bigger in length and width than a penny, making it one of the smallest yet highly capable, high-speed insect-scale robots. (Image: Kaushik Jayaram/Harvard SEAS)\n “The wonderful part about this exercise is that we did not have to change anything about the previous design,” Jayaram said in a statement. “We proved that this process can be applied to basically any device at a variety of sizes.”\n HAMR-JR is 2.25cm long and weighs about 0.3g. It can run about 14 body lengths per second, making it one of the smallest and fastest microrobots.\n The team said that scaling down does change some of the principles of elements such as stride length and joint stiffness, so they developed a model that can predict locomotion metrics like running speeds, foot forces, and payload based on a target size. The model can then be used to design a system with the required specifications.", "posttime": "2020-06-25 11:07:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,hamr,jr", "title": "HAMR-JR微型机器人展示灵巧", "title_en": "HAMR-JR microrobot demonstrates dexterity", "transed": 1, "url": "https://www.theengineer.co.uk/hamr-jr-microrobot-harvard/", "via": "", "real_tags": ["机器人", "hamr", "jr"]}]