[{"category": "", "categoryclass": "", "imagename": "6c7f7b9b61640e265b55a45aa3b543d2.jpg", "infoid": 1002679, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三星和韩国电信巨头SK电信首次亮相Galaxy A Quantum 5G智能手机，搭载量子随机数生成(RNG)芯片组。这是移动电话量子技术的首次商业化，它将成为全量子加密成为主流机会的重要风向标。\n量子加密通常被吹捧为“不可破解的”，因为它通过无法拦截、窃听或欺骗的粒子生成无法预测的随机数字和安全密钥。该理论认为，正是物理定律本身阻止了成功的破解。然而，研究人员不止一次证明了情况并非如此-尽管到目前为止，黑客攻击需要持续的物理访问设备。\n无论如何，三星手机将为这项技术提供一个有趣的测试案例-尽管关于芯片组实际工作方式的细节很少。然而，这些公司确实提供了一些评论，指出使用量子力学和光子来为其安全努力提供信息。\n该芯片组的尺寸为2.5毫米乘2.5毫米，由SK电信位于瑞士的子公司ID Quantique开发。\n据运营商称：“量子RNG芯片组通过生成不可预测和无模式的纯随机数，帮助智能手机用户安全地使用特定服务。”\n量子RNG芯片有一个发射光子的板载LED光源，它还有一个CMOS图像传感器来检测正在发射的光子。图像传感器负责接收光子，然后生成最终用于创建加密密钥的随机数。\n两家公司表示，这些随机数被提供给兼容的服务，并用于生成每个应用程序中使用的一次性加密密钥。\n根据SK的一份新闻稿，在三星的案例中，Galaxy将在几种不同的情况下使用量子RNG(Quantum RNG)(用谷歌翻译翻译)。这些措施包括登录设备上的运营商账户；通过支持区块链的“量子钱包”安全地存储个人文档；以及在零售店进行基于生物识别的移动支付。在线支付保护也在路线图上。\nSK电信还计划为开发者推出开放式API，以便开始在OEM和应用的基础上整合这项技术。\n至于量子加密到底是什么，光学学会在一篇学术文章中解释说，它使用光子(光粒子)来编码信息：数据基本上是以光的形式在空中传输，而不是像电荷一样通过电路传输。\n“在其最简单的形式，称为2D加密，每个光子编码一个比特：要么是1，要么是0。科学家们已经证明，单个光子可以编码更多的信息--这一概念被称为高维量子加密，“该学会解释说。例如，由于仅对一个字母进行编码需要8位，因此将更多信息打包到每个光子中将大大加快数据传输速度。\n由于量子力学的原理，从安全的角度来看，量子密码学具有显著的优势。正如QuantumXchange在一本在线入门读物中详细描述的那样，光子可以同时存在于多个地方或多个存在状态中；它们是在两个量子态中的一个中随机产生的。\n虽然科学家可以克隆粒子的一些量子属性，但到目前为止，克隆整个粒子是不可能的。这是因为人们无法在不改变或干扰量子属性的情况下测量或检查它，这意味着任何篡改都将使原始光子基本上不存在(从而挫败黑客攻击)。\n根据QuantumXchange的说法，“如果窃听者以任何方式读取或复制光子，光子的状态就会改变。”“端点将检测到更改。换句话说，这意味着您无法读取光子并将其转发或复制，而不会被检测到。“。\n量子加密通常通过光缆进行。发送设备通过滤光器(称为“偏振器”)传输光子，滤光器以四种随机的、可能的偏振之一将粒子发送出去。当光子到达接收器时，两个分光器“读取”每个光子的偏振。然而，接收器不知道对每个光子使用哪种分束器，必须猜测使用哪种分束器。\n根据QuantumXchange的说法，“一旦发送了光子流，接收方就会告诉发送方发送序列中的每个光子使用了哪个分束器，然后发送方将该信息与用来发送密钥的偏振器序列进行比较。”使用错误的分束器读取的光子将被丢弃，生成的位序列将成为关键。\n事实证明，在现实世界中将其付诸实践是难以捉摸的，因为量子计算需要大量的处理能力才能有效地进行。\n三星手机的安全芯片到底有多“量子”还有待观察，但值得注意的是，量子加密被视为跟上对手能力的重要进步，特别是如果量子计算-它可以立即打破RSA、SSL、TLS和HTTPS等传统的非对称加密算法-加入进来的话。\n一些人对此表示怀疑。在2月份RSA大会的密码学家小组会议上，Ron Rivest(RSA中的R)表示，他认为目前的量子计算永远不会达到有效部署的地步，因为它运行所需的马力和费用都是巨大的。在RSA会议上，Ron Rivest(RSA中的R)表示，他认为目前的量子计算永远不会达到有效部署的地步，因为它需要巨大的马力和费用。\nRivest说：“我认为聚变能力比量子计算有更高的成功机会。”“在破解密码学之前，必须进行大量的缩放，我不确定能不能做到。”\n也就是说，永远不要说永远不会，他指出：“我希望建造量子计算机的人失败。”Rivest指出。“这将意味着一种我们都熟悉和喜爱的可爱算法的消亡。”\n随着越来越多的互联设备运行我们的企业、推动我们的生产线、跟踪并向患者提供医疗保健等，您是否担心企业面临的物联网安全挑战？6月3日下午2点。ET，与著名安全技术专家Bruce Schneier、Armis CISO Curtis Simpson和Threatpost一起参加一个免费的网络研讨会，驯服非托管和物联网设备海啸。了解有关如何管理这一不断增长的新攻击面的独家见解。请在此注册参加本次赞助的网络研讨会。", "note_en": "Samsung and South Korean telecom giant SK Telecom have debuted the Galaxy A Quantum 5G smartphone, sporting a quantum random number generation (RNG) chipset. It’s the first commercialization of quantum technology for mobile phones, and it will serve as a significant bellwether for full quantum encryption’s chances of going mainstream.\n Quantum encryption in general has been touted as being “unhackable” because it generates random numbers and secure keys that cannot be predicted, via particles that can’t be intercepted, eavesdropped upon or spoofed. The very laws of physics themselves prevent successful cracking, the theory goes. However, researchers  have proven more than once that this isn’t the case—though hacks so far have required sustained physical access to a device.\n  In any event, the Samsung phone will provide an interesting test case for the technology — though details are scant in terms of how the chipset actually works. The companies did however offer a few comments that point to the use of quantum mechanics and photons to inform its security efforts.\n  The chipset, which measures 2.5 mm by 2.5 mm, was developed by SK Telecom’s Switzerland-based subsidiary ID Quantique.\n “The quantum RNG chipset helps smartphone users safely use specific services by generating unpredictable and patternless pure random numbers,” according to the carrier.\n The quantum RNG chip has an on-board LED light source that emits photons; it also has a  CMOS image sensor to detect the photons being emitted. The image sensor is responsible for receiving the photons, and then generating the random numbers ultimately used to create encryption keys.\n These random numbers are provided to compatible services, and are used to generate one-time encryption keys used in each app, the companies said.\n In Samsung’s case, the Galaxy will use quantum RNG in a few different scenarios, according to an  SK press release (translated with Google Translate). These include logging into carrier accounts on the device; securely storing personal documents via a blockchain-enabled “Quantum Wallet;” and for biometric-based mobile payments at retail stores. Online payment protection is also on the roadmap.\n SK Telecom also plans to roll out open APIs for developers to begin incorporating the technology on an OEM and application basis.\n  As for what quantum encryption actually is, the Optical Society explained in  an academic article, that it uses photons (light particles) to encode information: Data essentially moves over the air in the form of light, rather than across circuitry as electrical charges.\n “In its simplest form, known as 2D encryption, each photon encodes one bit: either a one or a zero. Scientists have shown that a single photon can encode even more information — a concept known as high-dimensional quantum encryption,” the Society explained. “With eight bits necessary to encode just one letter, for example, packing more information into each photon would significantly speed up data transmission.”\n Thanks to the principles of quantum mechanics, quantum cryptography has significant advantages from a security standpoint. As QuantumXchange detailed in  an online primer, photons can simultaneously exist in more than one place or more than one state of being; they’re generated randomly in one of two quantum states.\n While scientists can clone some quantum properties of a particle, cloning an entire particle as proven so far impossible. That’s because one can’t measure or examine a quantum property without changing or disturbing it, meaning that any tampering will render the original photon essentially non-existent (thus thwarting hacking).\n “If the photon is read or copied in any way by an eavesdropper, the photon’s state will change,” according to QuantumXchange. “The change will be detected by the endpoints. In other words, this means you cannot read the photon and forward it on or make a copy of it without being detected.”\n  Quantum encryption typically takes place over a fiber-optic cable. The sending apparatus transmits photons through a filter (known as a “polarizer”) which sends the particles out with one of four random, possible polarizations. When the photons reach the receiver, two light-beam splitters “read” the polarization of each photon. However, the receiver does not know which beam splitter to use for each photon and has to guess which one to use.\n “Once the stream of photons has been sent, the receiver tells the sender which beam splitter was used for each of the photons in the sequence they were sent, and the sender compares that information with the sequence of polarizers used to send the key,” according to QuantumXchange. “The photons that were read using the wrong beam splitter are discarded, and the resulting sequence of bits becomes the key.”\n  Putting this into practice in the real world has proven elusive, because quantum computing takes a lot of processing power to carry out effectively.\n It remains to be seen how “quantum” the Samsung handset’s security chip actually is, but it’s worth noting that quantum encryption is seen as an important advance in keeping up with adversary capabilities, particularly if quantum computing –  which can break traditional asymmetric encryption algorithms like RSA, SSL, TLS and HTTPS in an instant – comes on board.\n Some are skeptical on that front. At the Cryptographer’s Panel at the RSA Conference in February, Ron Rivest (the R in RSA), said that he believes that quantum computing as it stands will never get to the point of efficiently being deployed, because of the sheer amount of horsepower and expense it requires to function.\n “I give fusion power a higher chance of succeeding than quantum computing,” Rivest said. “There is a lot of scaling that has to be done before you can break cryptography, I am not sure it can be done.”\n That said, never say never, he noted: “I hope people building quantum computers fail,” Rivest noted. “It would mean the demise of a lovely algorithm we all know and love.”\n Concerned about the IoT security challenges businesses face as more connected devices run our enterprises, drive our manufacturing lines, track and deliver healthcare to patients, and more? On  June 3 at 2 p.m. ET, join renowned security technologist Bruce Schneier, Armis CISO Curtis Simpson and Threatpost for a FREE webinar,  Taming the Unmanaged and IoT Device Tsunami. Get exclusive insights on how to manage this new and growing attack surface.  Please register here for this sponsored webinar.", "posttime": "2020-05-19 02:56:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "安全,security,光子", "title": "量子安全与三星Galaxy合作", "title_en": "Quantum Security Goes Live With Samsung Galaxy", "transed": 1, "url": "https://threatpost.com/quantum-security-samsung-galaxy/155783/", "via": "", "real_tags": ["安全", "security", "光子"]}, {"category": "", "categoryclass": "", "imagename": "d0cca3be2e9248547505c96e94d1a982.jpg", "infoid": 1002675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这已经有很长一段时间在制作测试结果的时间了。要真正了解计算机存储的基本原理，研究各种传统RAID(廉价磁盘冗余阵列)拓扑对性能的影响非常重要。了解ZFS是什么以及它是如何工作的也很重要。但在某种程度上，人们(特别是互联网上的计算机爱好者)想要数字。\n首先，快速说明一下：这项测试自然是建立在这些基础之上的。当我们在这里探索ZFS拓扑时，我们将大量吸取经验教训。如果您还不完全了解池和vdevs之间的区别，或者asft和recordsize意味着什么，我们强烈建议您在潜入测试和结果之前重新查看这些解释。\n尽管每个人都喜欢看到原始数据，但我们敦促大家额外关注这些数字之间的相互关系。我们的所有图表都将大小为2到8个磁盘的ZFS池拓扑的性能与单个磁盘的性能相关联。如果您更改磁盘的型号，您的原始数字将相应更改-但在大多数情况下，它们与单个磁盘性能的关系不会改变。\n我们在本次测试中使用了2019夏季存储热棒中的八个空托架。它拥有大量的RAM和足够的CPU马力，可以毫不费力地完成这些存储测试。\nStorage HotRod还配备了专用的LSI-9300-8i主机总线适配器(HBA)，该适配器只用于测试中的磁盘。机箱的前四个托架上有我们自己的备份数据-但它们在这里的所有测试期间都处于空闲状态，并且连接到主板的SATA控制器，与我们的测试阵列完全隔离。\n一如既往，我们使用FIO来执行所有的存储测试。我们在热棒上本地运行它们，并使用三种基本的随机访问测试类型：读、写和同步写。每个测试都使用4K和1M的块大小运行，我运行测试时使用的是单个进程和ioDeep=1，还有八个进程的ioDepth=8。\n对于所有测试，我们都使用Linux 0.7.5上的ZFS，这可以在Ubuntu18.04LTS的主要存储库中找到。值得一提的是，Linux 0.7.5上的ZFS现在已经有两年的历史了--更新版本的OpenZFS有0.7.5中没有的特性和性能改进。\n我们还是用0.7.5进行了测试-这让至少一位非常资深的OpenZFS开发人员很恼火-因为当我们运行测试时，18.04是最新的Ubuntu LTS，也是最新的稳定发行版之一。在本系列的下一篇文章中-关于ZFS调优-我们将在Linux 0.8.3上更新到全新的Ubuntu20.04LTS和更新的ZFS。\n当我们测试mdadm和ext4时，我们并没有真正使用整个磁盘-我们在每个磁盘的头部创建了一个1TiB分区，并使用了这些1TiB分区。我们还必须调用晦涩难懂的参数-mkfs.ext4-E lazy_able_init=0，lazy_Journal_init=0-以避免ext4的预分配污染我们的结果。\n使用这些相对较小的分区而不是整个磁盘是一种实际需要，因为ext4需要遍历整个创建的文件系统并分散预分配的元数据块。如果我们使用了全部磁盘，八磁盘RAID6拓扑上的可用空间将大约为65TiB-格式化将需要几个小时，每个测试的拓扑都需要类似的痛苦等待。\n令人高兴的是，ZFS既不需要也不想预分配元数据块--它会在需要时动态创建元数据块。因此，我们完整地为ZFS提供了每个12TB的Ironwolf磁盘，我们不需要等待漫长的格式化过程-每个拓扑，即使是最大的拓扑，在创建后一两秒就可以使用了，不需要特殊的参数。\n传统RAID阵列是位于文件系统和一组磁盘之间的简单抽象层。它将整个阵列呈现为虚拟磁盘设备，从文件系统的角度来看，该设备与实际的单个磁盘没有什么区别-即使它比最大的单个磁盘大得多。\nZFS是一种完全不同的东西，它包含的功能在传统的类Unix型系统中通常可能占据三个不同的层。它是一个逻辑卷管理器、一个RAID系统和一个文件系统。像这样合并传统层让许多高级管理人员义愤填膺，但这是有很好的理由的。\nZFS提供了绝对丰富的功能，强烈鼓励不熟悉这些功能的用户查看我们2014年对下一代文件系统的报道，以获得基本概述，以及我们最近的ZFS 101文章，以获得更全面的解释。\n与上一篇文章一样，我们这里的性能度量单位是千兆字节(KiB)和兆字节(MIB)。千比字节是1,024字节，兆字节是1,024千比字节，依此类推-与千字节(1,000字节)和兆字节(1,000千字节)形成对比。\nKibibytes和它们的大兄弟一直是计算机存储的标准单位。在20世纪90年代之前，计算机专业人士只是将它们称为K和M--当他们拼写出它们时，会使用不准确的公制前缀。“但是，任何时候你的操作系统指的是GB、MB或KB--无论是在可用空间、网络速度还是RAM大小方面--它实际上指的是GiB、MIB和KiB。\n不幸的是，存储供应商最终抓住了指标之间的差异，将其作为以更低成本生产GB驱动器和TB驱动器的一种方式-因此，一个500 GB的固态硬盘实际上只有465GiB，而像我们今天重新测试的12TB硬盘每个实际上只有10.9TiB。", "note_en": "This has been a long while in the making—it&#39;s test results time. To truly understand the fundamentals of computer storage, it&#39;s important to  explore the impact of various conventional RAID (Redundant Array of Inexpensive Disks) topologies on performance. It&#39;s also important to  understand what ZFS is and how it works. But at some point, people (particularly computer enthusiasts on the Internet) want numbers.\n First, a quick note: This testing, naturally, builds on those fundamentals. We&#39;re going to draw heavily on lessons learned as we explore ZFS topologies here. If you aren&#39;t yet entirely solid on the difference between pools and vdevs or what ashift and recordsize mean, we  strongly recommend you revisit those explainers before diving into testing and results.\n And although everybody loves to see raw numbers, we urge an additional focus on  how these figures relate to one another. All of our charts relate the performance of ZFS pool topologies at sizes from two to eight disks to the performance of a single disk. If you change the model of disk, your raw numbers will change accordingly—but for the most part, their relation to a single disk&#39;s performance will not.\n     We used the eight empty bays in our  Summer 2019 Storage Hot Rod for this test. It&#39;s got oodles of RAM and more than enough CPU horsepower to chew through these storage tests without breaking a sweat.\n  The Storage Hot Rod&#39;s also got a dedicated  LSI-9300-8i Host Bus Adapter (HBA) which isn&#39;t used for anything but the disks under test. The first four bays of the chassis have our own backup data on them—but they were idle during all tests here and are attached to the motherboard&#39;s SATA controller, entirely isolated from our test arrays.\n  As always, we used  fio to perform all of our storage tests. We ran them locally on the Hot Rod, and we used three basic random-access test types: read, write, and sync write. Each of the tests was run with both 4K and 1M blocksizes, and I ran the tests both with a single process and iodepth=1 as well as with eight processes with iodepth=8.\n For all tests, we&#39;re using ZFS on Linux 0.7.5, as found in main repositories for Ubuntu 18.04 LTS. It&#39;s worth noting that ZFS on Linux 0.7.5 is two years old now—there are features and performance improvements in newer versions of OpenZFS that weren&#39;t available in 0.7.5.\n We tested with 0.7.5 anyway—much to the annoyance of at least one very senior OpenZFS developer—because when we ran the tests, 18.04 was the most current Ubuntu LTS and one of the most current stable distributions in general. In the next article in this series—on ZFS tuning and optimization—we&#39;ll update to the brand-new Ubuntu 20.04 LTS and a much newer ZFS on Linux 0.8.3.\n  When we tested mdadm and ext4, we didn&#39;t really use the entire disk—we created a 1TiB partition at the head of each disk and used those 1TiB partitions. We also had to invoke arcane arguments— mkfs.ext4 -E lazy_itable_init=0,lazy_journal_init=0—to avoid ext4&#39;s preallocation from contaminating our results.\n Using these relatively small partitions instead of the entire disks was a practical necessity, since ext4 needs to grovel over the entire created filesystem and disperse preallocated metadata blocks throughout. If we had used the full disks, the usable space on the eight-disk RAID6 topology would have been roughly 65TiB—and it would have taken several hours to format, with similar agonizing waits for  every topology tested.\n ZFS, happily, doesn&#39;t need or want to preallocate metadata blocks—it creates them on the fly as they become necessary instead. So we fed ZFS each 12TB Ironwolf disk in its entirety, and we didn&#39;t need to wait through lengthy formatting procedures—each topology, even the largest, was ready for use a second or two after creation, with no special arguments needed.\n  A conventional RAID array is a simple abstraction layer that sits between a filesystem and a set of disks. It presents the entire array as a virtual &#34;disk&#34; device that, from the filesystem&#39;s perspective, is indistinguishable from an actual, individual disk—even if it&#39;s significantly larger than the largest single disk might be.\n ZFS is an entirely different animal, and it encompasses functions that normally might occupy three separate layers in a traditional Unixlike system. It&#39;s a logical volume manager, a RAID system, and a filesystem all wrapped into one. Merging traditional layers like this has caused many a senior admin to grind their teeth in outrage, but there are very good reasons for it.\n There is an absolute  ton of features ZFS offers, and users unfamiliar with them are highly encouraged to take a look at our 2014  coverage of next-generation filesystems for a basic overview as well as our recent ZFS 101  article for a much more comprehensive explanation.\n  As in the last article, our units of performance measurement here are kibibytes (KiB) and mebibytes (MiB). A kibibyte is 1,024 bytes, a mebibyte is 1,024 kibibytes, and so forth—in contrast to a kilobyte, which is 1,000 bytes, and a megabyte, which is 1,000 kilobytes.\n Kibibytes and their big siblings have always been the standard units for computer storage. Prior to the 1990s, computer professionals simply referred to them as K and M—and used the inaccurate metric prefixes when they spelled them out. But any time your operating system refers to GB, MB, or KB—whether in terms of free space, network speed, or amounts of RAM—it&#39;s really referring to GiB, MiB, and KiB.\n Storage vendors, unfortunately, eventually seized upon the difference between the metrics as a way to more cheaply produce &#34;gigabyte&#34; drives and then &#34;terabyte&#34; drives—so a 500GB SSD is really only 465 GiB, and 12TB hard drives like the ones we&#39;re testing today are really only 10.9TiB each.", "posttime": "2020-05-19 02:39:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zfs,raid,测试", "title": "ZFS与RAID：八个Ironwolf磁盘，两个文件系统，一个赢家", "title_en": "ZFS versus RAID: Eight Ironwolf disks, two filesystems, one winner", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/05/zfs-versus-raid-eight-ironwolf-disks-two-filesystems-one-winner/", "via": "", "real_tags": ["zfs", "raid", "测试"]}, {"category": "", "categoryclass": "", "imagename": "86dc2c4e9da5ef8bc6e76666b338bdba.jpg", "infoid": 1002674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ZDNet获悉，安装在梅赛德斯-奔驰(Mercedez-Benz)面包车上的智能汽车组件的源代码周末在网上泄露。\n泄密事件发生之前，瑞士软件工程师蒂尔·科特曼(Till Kottmann)发现了戴姆勒(Daimler AG)旗下的一个Git门户网站。戴姆勒是梅赛德斯-奔驰(Mercedes-Benz)汽车品牌背后的德国汽车公司。\nKottmann告诉ZDNet，他可以在戴姆勒的代码托管门户上注册一个账户，然后下载580多个Git存储库，其中包含安装在梅赛德斯面包车上的车载逻辑单元(OLU)的源代码。\n据戴姆勒网站介绍，OLU是介于汽车硬件和软件之间的一个组件，它将车辆与云端连接起来。\n戴姆勒表示，Olu&34；简化了实时车辆数据的技术访问和管理，并允许第三方开发人员创建从梅赛德斯面包车检索数据的应用程序。\n这些应用程序通常用于跟踪面包车在路上的情况，跟踪面包车的内部状态，或者在被盗的情况下冻结面包车。\nKottmann在今天的一次采访中告诉ZDNet，他发现戴姆勒的GitLab服务器使用的是像Google DOKS(专门的谷歌搜索查询)这样简单的东西。\nGitLab是一个基于Web的软件包，公司使用它来集中处理Git存储库的工作。\nGit是一款专门用于跟踪源代码更改的软件，它允许多人工程团队编写代码，然后将其同步到中央服务器--本例中是戴姆勒基于GitLab的门户网站。\n考特曼告诉ZDNet，当我感到无聊的时候，我经常只是寻找有趣的GitLab实例，大多是简单的谷歌呆子，我一直惊讶于安全设置似乎几乎没有考虑过什么。\n老实说，这只是一个非常幸运的发现，当时我正在查看一些我以前没有检查过的品牌名称，希望能找到一些小承包商之类的东西。\n科特曼说，戴姆勒未能实施账户确认流程，这使得他能够使用一封不存在的戴姆勒公司电子邮件在公司的官方GitLab服务器上注册账户。\n这位研究人员说，他从该公司的服务器上下载了580多个Git存储库，并在周末将其公之于众，并将文件上传到几个位置，如文件托管服务Mega、互联网档案馆和他自己的GitLab服务器。\nZDNet已经审查了一些--而不是全部--泄露的Git存储库。我们查看的文件中没有一个包含开放源码许可证，这表明这是不应该公开的专有信息。\n泄露的项目包括梅赛德斯面包车OLU组件的源代码，但也包括Raspberry PI映像、服务器映像、用于管理远程OLU的内部戴姆勒组件、内部文档、代码示例等。\n虽然泄密事件一开始看起来是无害的，但此次泄密事件中的威胁情报公司也对数据进行了审查，该公司告诉ZDNet，他们发现了戴姆勒内部系统的密码和API令牌。这些密码和访问令牌如果落入不法分子之手，可能会被用来计划和发动针对戴姆勒云和内部网络的未来入侵。\n在ZDNet和Under Under今天都联系了戴姆勒之后，该公司关闭了Kottmann下载数据的GitLab服务器。戴姆勒发言人没有回复正式的置评请求。\nKottmann告诉ZDNet，他打算将戴姆勒的源代码放在网上，直到公司要求他将其删除。\n然而，关于科特曼行为的合法性仍然存在一些疑问，因为他没有试图在周末将源代码发布到网上之前通知公司。\n另一方面，GitLab服务器允许任何人注册帐户，有些人可能会认为这是一个开放的系统。此外，ZDNet今天早些时候审查的源代码没有包含这是专有技术的警告。", "note_en": "The source code for &#34;smart car&#34; components installed in Mercedez-Benz vans has been leaked online over the weekend, ZDNet has learned.\n The leak occurred after  Till Kottmann, a Swiss-based software engineer, discovered a Git web portal belonging to Daimler AG, the German automotive company behind the Mercedes-Benz car brand.\n Kottmann told ZDNet that he was able to register an account on Daimler&#39;s code-hosting portal, and then download more than 580 Git repositories containing the source code of onboard logic units (OLUs) installed in Mercedez vans.\n  According to the Daimler website, the OLU is a component that sits between the car&#39;s hardware and software, and &#34;connects vehicles to the cloud.&#34;\n Daimler says the OLU &#34;simplifies technical access and the management of live vehicle data&#34; and allows third-party developers to create apps that retrieve data from Mercedes vans.\n   These apps are usually employed for features such as tracking vans while on the road, tracking a van&#39;s internal status, or for freezing vans in case of theft.\n  Kottmann told ZDNet in an interview today that he found Daimler&#39;s GitLab server using something as simple as Google dorks (specialized Google search queries).\n   GitLab is a web-based software package that companies use to centralize work on Git repositories.\n Git is specialized software for keeping track of changes in source code and is allows multi-person engineering teams to write code and then synchronize it to a central server -- in this case, Daimler&#39;s GitLab-based web portal.\n &#34;I often just hunt for interesting GitLab instances, mostly with just simple Google dorks, when I&#39;m bored, and I keep being amazed by how little thought seems to go into the security settings,&#34; Kottmann told ZDNet.\n &#34;This was honestly just a very lucky find while I was going through some brand names I hadn&#39;t checked before in hopes of finding like some small contractors or something.&#34;\n Kottmann says Daimler failed to implement an account confirmation process, which allowed him to register an account on the company&#39;s official GitLab server using a non-existent Daimler corporate email.\n The researcher says he downloaded more than 580 Git repositories from the company&#39;s server, which he made publicly available over the weekend, uploading the files in several locations such as file-hosting service MEGA, the Internet Archive, and on his own GitLab server.\n   ZDNet has reviewed some -- not all -- of the leaked Git repositories. None of the files we viewed included an open-source license, suggesting this was proprietary information that was not meant to have been made public.\n The leaked projects included the source code of Mercedes vans OLU components, but also Raspberry Pi images, server images, internal Daimler components for managing remote OLUs, internal documentation, code samples, and more.\n While the leak appeared to be harmless in the beginning, threat intelligence firm  Under the Breach, which also reviewed the data, told ZDNet they discovered passwords and API tokens for Daimler&#39;s internal systems. These passwords and access tokens, in the wrong hands, could be used to plan and mount future intrusions against Daimler&#39;s cloud and internal network.\n After both ZDNet and Under the Breach reached out today to Daimler, the company took down the GitLab server from where Kottmann downloaded the data. A Daimler spokesperson did not return a formal request for comment.\n Kottmann told ZDNet he intends to leave Daimler&#39;s source code online until the company reaches out to request he takes it down.\n However, some questions remain about the legality of Kottmann&#39;s actions, as he did not attempt to notify the company before publishing its source code online over the weekend.\n On the other hand, the GitLab server allowed anyone to register an account, which some could interpret as being an open system. Furthermore, source code that ZDNet reviewed earlier today did not contain warnings that this was proprietary technology.", "posttime": "2020-05-19 02:24:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,车载,benz,戴姆勒", "title": "梅赛德斯-奔驰车载逻辑单元(OLU)源代码在线泄露", "title_en": "Mercedes-Benz Onboard Logic Unit (OLU) Source Code Leaks Online", "transed": 1, "url": "https://www.zdnet.com/article/mercedes-benz-onboard-logic-unit-olu-source-code-leaks-online/", "via": "", "real_tags": ["代码", "车载", "benz", "戴姆勒"]}, {"category": "", "categoryclass": "", "imagename": "1bad01431396f673e618b886da371b1e.jpg", "infoid": 1002671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ARM上的Windows10仍然有太多的限制值得推荐，但最严重的限制之一可能很快就会被淘汰。根据GitHub最近提交的代码，微软正准备在该平台上增加对64位x86应用程序仿真的支持。\n“在ARM64上添加对x64代码仿真的链接器支持”实际上就是代码提交所说的全部内容。它是由微软的Kenny Kerr发布的，Kenny Kerr是Windows团队的首席软件工程师。\n您可能知道，ARM上的Windows10现在是一个64位的ARM平台--最初是32位的--但是它现在可以在仿真中运行32位的x86软件代码。这一改变将极大地扩展这一功能，使其包括64位x86软件-或者一些人所称的x64软件-使该平台更加可行。\n而ARM上的Windows10一直存在很多问题，到目前为止，这主要是一次实验，对用户来说，这是一次令人沮丧的练习，因为有太多东西不能正常工作。演出一直很糟糕。兼容性问题非常严重，不仅仅是64位x86应用程序，还有所有x86驱动程序。\n微软和高通已经通过改进用于在ARM设备上驱动Windows 10的芯片组解决了一些性能问题。但软件问题仍然是一个挑战，我不相信增加64位x86应用程序支持，虽然非常有用，但会解决驱动程序问题。\n但尽管如此，这仍将是向前迈出的一步。正如我在2018年2月回复的那样，微软一直计划增加对64位x86应用的支持。但这一承诺似乎表明，这种支持最早可能在今年到来。\n目前还不清楚它是否将Windows 10放在ARM上：基于英特尔和AMD的PC已经提供了与x86/x64软件和驱动程序的100%兼容性，而且许多现代PC提供了微软在ARM上拥护的电池续航优势。因此，目前还不清楚微软和高通能做些什么，将Windows 10置于ARM之上。\n高级会员对新闻帖子的评论将以提升状态为特色，从而提高他们的可见性。此选项卡允许您与其他高级会员一起参与高级评论。注册以加入其他高级会员提升对话！\n注册或订阅。\n您没有登录但想要加入对话吗？成为瑟罗特高级或基本用户参与。\n登记簿", "note_en": "Windows 10 on ARM still has far too many limitations to recommend, but one of the most serious may soon be eliminated. According to a recent code commit on GitHub, Microsoft is preparing to add support for 64-bit x86 application emulation to the platform.\n “Add linker support for x64 code emulation on ARM64,” is literally all  the code commit says. It was posted by Microsoft’s Kenny Kerr, a principal software engineer on the Windows team.\n As you may know, Windows 10 on ARM is now a 64-bit ARM platform— it was 32-bit originally—but it can currently run 32-bit x86 software code in emulation. This change would dramatically expand this capability to include 64-bit x86 software—or what some call x64 software—-making the platform a lot more viable.\n And Windows 10 on ARM has  always had lots of problems and has been, to date, mostly an experiment and, for users, an exercise in frustration since so much does not work properly. The performance has been terrible. The compatibility issues are rampant, not just 64-bit x86 apps but all x86 drivers.\n Microsoft and Qualcomm have addressed some of the performance issues by improving the chipsets used to power Windows 10 on ARM devices. But the software issues remain a challenge, and I don’t believe that adding 64-bit x86 app support, while very useful, will solve that drivers problem.\n But still, it will be a step forward. Microsoft had always planned to add support for 64-bit x86 apps, as  I wrote back in February 2018. But this commit seems to indicate that that support could arrive as early as this year.\n Whether it puts Windows 10 on ARM over the top is unclear: Intel- and AMD-based PCs already provide 100 percent compatibility with x86/x64 software and drivers, and many modern PCs provide the battery life benefits that Microsoft champions on ARM. So it’s not clear what Microsoft and Qualcomm can do to put Windows 10 on ARM over the top.\n Premium member comments on news posts will feature an elevated status that increases their visibility.This tab would allow you to participate in Premium comments with other premium members.Register to join the other Premium members in elevating the conversation!\n  Register or Subscribe\n  Don&#39;t have a login but want to join the conversation? Become a Thurrott Premium or Basic User to participate\n  Register", "posttime": "2020-05-19 02:22:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,windows,app,windows-10,x86", "title": "ARM上的Windows 10可能很快就会支持64位x86应用程序", "title_en": "Windows 10 on ARM Could Soon Support 64-Bit x86 Apps", "transed": 1, "url": "https://www.thurrott.com/windows/windows-10/236253/windows-10-on-arm-could-soon-support-64-bit-x86-apps", "via": "", "real_tags": ["程序", "windows", "app", "x86"]}, {"category": "", "categoryclass": "", "imagename": "48ceba31cf05faab0f4fac42132df37c.jpg", "infoid": 1002670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我的世界”已经成为一种国际现象，但它的规模还在不断扩大。微软表示，其已有11年历史的世界构建游戏销量超过2亿份，每月有超过1.26亿人玩这款游戏。\n这个游戏最近的大部分成功都是在冠状病毒大流行期间取得的。微软表示，4月份，加入其游戏社区的新玩家数量增加了25%，一起玩游戏的人数激增了40%。\n微软“我的世界”工作室负责人海伦·蒋周一在一篇博文中写道，在这个非常时期，我们比以往任何时候都更加意识到像“我的世界”这样的游戏在逃避日常生活、培养朋友和家人之间的社交联系方面可以发挥的重要作用。这一声明是在微软5月19-20日在线举办的Build Developer活动之前发布的。\n“我的世界”的成功在一定程度上要归功于它的开放式设计，鼓励玩家探索；在游戏中找到物品和地点；然后建造他们喜欢的任何东西。它的成功还帮助催生了其他游戏，比如“我的世界世界”，该公司利用智能手机，以类似于“精灵宝可梦Go”的方式，将“我的世界”游戏覆盖在现实世界中。微软还计划发布一款新的动作冒险游戏，名为“我的世界地下城”，玩家在探索游戏世界的同时，与囤积的僵尸生物搏斗。\n随着人们纷纷避难以减缓这种新型冠状病毒的传播，我的世界和其他视频游戏的销量和游戏性一直在增长。根据约翰·霍普金斯大学(Johns Hopkins University)汇编的数据，这种新型冠状病毒已导致超过30.6万名患者死亡，超过450万人感染。由于家里有这么多人，玩游戏的人数激增，销量也随之增加。\n根据市场观察机构NPD Group汇编的数据，在截至3月份的季度里，人们仅在游戏上就花费了95.8亿美元，比去年同期增长了11%。推动这个创纪录季度的是《动物穿越：新地平线》、《使命召唤：现代战争》、《末日永恒》、《龙珠Z：卡卡罗》、《堡垒之夜》、《侠盗猎车手V》、《我的世界》、美国职棒大联盟的《秀20》和《NBA2K20》。\n为了帮助大多数要到秋季才能重返校园的学生，微软将其教育版“我的世界”免费提供给教师，直到6月份。微软表示，自3月份作为主要游戏“我的世界”的一部分提供以来，其教育内容的下载量已超过5000万次。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Minecraft has already become an international phenomenon, but it keeps getting bigger.  Microsoft said its 11-year-old world-building game crossed 200 million copies sold, with more than 126 million people playing each month.\n Much of the game&#39;s recent success has come during the   coronavirus pandemic. Microsoft said that in April, it tallied a 25% increase in the number of new players joining its game community, and a 40% spike in the number of people playing together.\n &#34;In these extraordinary times, we&#39;re reminded more than ever before of the important role games like Minecraft can play in providing an escape from the day-to-day and fostering social connections between friends and families,&#34; Helen Chiang, Microsoft&#39;s head of Minecraft studio Mojang, wrote in a blog post Monday. The announcement came ahead of Microsoft&#39;s Build developer event, being   held online May 19-20.\n                                             Minecraft&#39;s success is partly thanks to its open-ended design, encouraging players to explore; find items and places within the game; and then   build whatever they like. Its success has helped spawn other games,   such as Minecraft Earth, the company&#39;s effort to use   smartphones to  overlay Minecraft gameplay on the real world in a way similar to  Pokemon Go. Microsoft is also planning to release a new action-adventure title called  Minecraft Dungeons, where players fight hoards of zombielike creatures while exploring the game&#39;s world.\n Minecraft and other  video games have been notching larger sales and gameplay as people shelter in place to   slow the spread of the novel coronavirus, which has killed more than 306,000 patients and infected more than 4.5 million people, according to  data compiled by Johns Hopkins University. With so many people at home,   game playing has spiked, and sales have followed.\n For the quarter ended in March, people spent $9.58 billion just on games, up 11% from a year ago, according to data compiled by market watcher NPD Group. Driving the record-setting quarter were sales of  Animal Crossing: New Horizons,  Call of Duty: Modern Warfare,  Doom Eternal,  Dragon Ball Z: Kakarot,  Fortnite,  Grand Theft Auto V,  Minecraft,  MLB The Show 20 and  NBA 2K20.\n To help students, most of whom  aren&#39;t able to return to school until the fall, Microsoft made  its education edition of Minecraft available to teachers for free until June. Microsoft said its education content has been downloaded more than 50 million times since it was offered as a part of the main Minecraft game in March.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-19 01:45:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,病毒,游戏,month,世界", "title": "“我的世界”游戏“尖峰”，在冠状病毒中每月超过1.26亿建造者", "title_en": "Minecraft Play Spikes, Tops 126M Builders a Month Amid COVID-19", "transed": 1, "url": "https://www.cnet.com/news/amid-covid-19-minecraft-sees-sharp-spikes-over-126m-players-a-month/", "via": "", "real_tags": ["冠状病毒", "病毒", "游戏", "month", "世界"]}, {"category": "", "categoryclass": "", "imagename": "868d114f08bd6616448d2d2e68138591.jpeg", "infoid": 1002669, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包主要导入(&#34；fmt&#34；&#34；os&#34；&#34；github.com/duythinht/dbml-go/parser&#34；&#34；github.com/duythinht/dbml-go/scanner&#34；)Funcc Main(){f，_：=os。打开(&#34；test.dbml&#34；)s：=scanner。NewScanner(F)parser：=parser。NewParser(S)dbml，err：=parser。如果err！=nil{fmt，则解析()。打印(&#34；%s\\n&#34；，错误)操作系统。退出(1)}//此处处理dbml}。\n用法：dbml-gen-go-model[标志]标志：-f，--from string source of dbml，可以是https://dbdiagram.io/.|file_name.dbml(默认值&#34；database.dbml&#34；)-h，--dbml-gen-go-model-o的帮助，--out字符串输出文件夹(默认值&#34；model&#34；)-p，--打包多个文件的单个字符串(默认值&#34；model&#34；)。\n//database ase.dbmlTable Users as U{id int[pk，Unique，Increate]//自动递增FULL_NAME varchar[NOT NULL，UNIQUE，DEFAULT：1]CREATED_AT TIMESTAMP COUNTRY_CODE int注意：&#39；Khong Hieu DUOC&#39；}。\n//dbml-gen-go-model生成的代码。请勿编辑。//受duythinht@2020包模型支持//为表&#39；Users&#39；type user struct{id int`db：&#34；id&#34；mapstruct：&#34；id&#34；`FullName string`db：&#34；full_name&#34；json：&#34；full_name&#34；mapstructure：&#34；full_name&#34；生成的类型为&#39；Users&#39；type user struct{id int`db：&#34；id&#34；mapstructure：&#34；id&#34；`FullName string`db：&#34；full_name&#34；CREATED_AT&#34；MAPSTRUCTURE：&#34；CREATED_AT&#34；`CountryCode int`db：&#34；COUNTRY_CODE&#34；json：&#34；COUNTRY_CODE&#34；mapstructure：&#34；COUNTRY_CODE&#34；`}//table&#39；Users&#39；元数据结构type__tbl_Users struct{ID string FullName string CreatedAt String CountryCode string}//table&#。元数据信息var_tbl_users=__tbl_Users{CountryCode：&#34；，CreatedAt：&#34；Created_at&#34；，FullName：&#34；Full_Name&#34；，ID：&#34；id&#34；，}//Columns返回表&#39；Users&#39；的列表列名称。func(*__tbl_users)column()[]string{return[]string{&#34；id&#34；，&#34；full_name&#34；，&#34；create_at&#34；，&#34；Country_code&#34；}}//DataColumns返回表&#39；用户&#39；除&#39；id&#39；之外的列表列的名称。Columns func(*__tbl_users)DataColumns()[]string{return[]string{&#34；full_name&#34；，&#34；create_at&#34；，&#34；Country_code&#34；}}//string返回表&#39；Users&#39；Func(*__tbl_Users)string()string{return&#34；Users&#34；}//TBL返回表&#39。Users&39；func(*user)tbl()*__tbl_Users{return&amp；_tbl_Users}", "note_en": "package main import (\t &#34;fmt&#34;\t &#34;os&#34;\t &#34;github.com/duythinht/dbml-go/parser&#34;\t &#34;github.com/duythinht/dbml-go/scanner&#34;) func  main() {\t f,  _  :=  os. Open( &#34;test.dbml&#34;)\t s  :=  scanner. NewScanner( f)\t parser  :=  parser. NewParser( s)\t dbml,  err  :=  parser. Parse()\t if  err  !=  nil {  fmt. Printf( &#34;%s \\n&#34;,  err)  os. Exit( 1) }  // process dbml here}\n   Usage: dbml-gen-go-model [flags]Flags: -f, --from string source of dbml, can be https://dbdiagram.io/... | file_name.dbml (default &#34;database.dbml&#34;) -h, --help help for dbml-gen-go-model -o, --out string output folder (default &#34;model&#34;) -p, --package string single for multiple files (default &#34;model&#34;)\n   // database.dbmlTable users as U { id int [pk, unique, increment] // auto-increment full_name varchar [not null, unique, default: 1] created_at timestamp country_code int Note: &#39;khong hieu duoc&#39;}\n    // Code generated by dbml-gen-go-model. DO NOT EDIT. // Supported by duythinht@2020 package model // User is generated type for table &#39;users&#39; type  User  struct {\t ID  int  `db:&#34;id&#34; json:&#34;id&#34; mapstructure:&#34;id&#34;`\t FullName  string  `db:&#34;full_name&#34; json:&#34;full_name&#34; mapstructure:&#34;full_name&#34;`\t CreatedAt  int  `db:&#34;created_at&#34; json:&#34;created_at&#34; mapstructure:&#34;created_at&#34;`\t CountryCode  int  `db:&#34;country_code&#34; json:&#34;country_code&#34; mapstructure:&#34;country_code&#34;`} // table &#39;users&#39; metadata Structure type  __tbl_users  struct {\t ID  string\t FullName  string\t CreatedAt  string\t CountryCode  string} // table &#39;users&#39; metadata info var  _tbl_users  =  __tbl_users{\t CountryCode:  &#34;country_code&#34;,\t CreatedAt:  &#34;created_at&#34;,\t FullName:  &#34;full_name&#34;,\t ID:  &#34;id&#34;,} // Columns return list columns&#39;s name for table &#39;users&#39; func ( * __tbl_users)  Columns() [] string {\t return [] string{ &#34;id&#34;,  &#34;full_name&#34;,  &#34;created_at&#34;,  &#34;country_code&#34;}} // DataColumns return list columns&#39;s name for table &#39;users&#39; except &#39;id&#39; columns func ( * __tbl_users)  DataColumns() [] string {\t return [] string{ &#34;full_name&#34;,  &#34;created_at&#34;,  &#34;country_code&#34;}} // String return name of table &#39;users&#39; func ( * __tbl_users)  String()  string {\t return  &#34;users&#34;} // TBL return metadata info for table &#39;users&#39; func ( * User)  TBL()  * __tbl_users {\t return  &amp; _tbl_users}", "posttime": "2020-05-19 01:44:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,设计,model,dbml", "title": "从数据库设计生成GO模型", "title_en": "Generate Go model from database design", "transed": 1, "url": "https://github.com/duythinht/dbml-go", "via": "", "real_tags": ["database", "数据库", "设计", "model", "dbml"]}, {"category": "", "categoryclass": "", "imagename": "41148f03a54bd7bd3b849388761b4a7c.png", "infoid": 1002668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你在上一篇文章中做了硬件调查，你可能会想知道英特尔最新的主流架构在哪里。冰湖失踪了！\n好消息是：就在这里，…。而且很有趣。我们将直接进入上次对Skylake客户端所做的相同分析。如果您还没有读过第一篇文章，您可能想从那里开始，因为我们将引用那里介绍的概念，而不会在这里重新解释它们。\n像往常一样，您可以跳到调查结果的一口大小版本的摘要。\n让我们首先看一下总体性能：像我们对每个微体系结构所做的那样，面对填充0和填充1。请记住，填充0用零填充区域，而填充1用值1填充区域(作为4字节整数)。\n所有这些测试都运行在3.5 GHz。该芯片的最大单核涡轮增压频率为3.7 GHz，但由于AVX-512时钟效应和其他内核偶尔会激活，因此很难在此频率下持续运行。3.5 GHz是一个很好的折衷方案，可以保持芯片在相同频率下运行，同时保持接近理想的涡轮增压。禁用turbo不是一个好的选择，因为该芯片在没有turbo的情况下运行在1.1 GHz，这会在使用uncore和RAM时引入很大的失真。\n图7a图7b这两个有几个关键区别。首先，图7a在L1区域的右半部分发生了这种奇怪的事情：有两个明显且不同的性能级别可见，每个级别大约有一半的样本。\n第二件事是，虽然这两个曲线图在L3和RAM区域都显示了一些零优化效果，但图7b中的影响要大得多：\n那么这两个地块有什么不同呢？第一个是用-march=local编译的，第二个是用-march=icelake-client编译的。\n因为我是在Ice Lake客户端系统上编译这段代码，所以我认为它们会做同样的事情，但由于某些原因，它们不会这样做。主要区别是-march=ative会生成如下所示的512位指令(对于主循环)：\n。l4：vmovdqu32[rax]，zmm0添加rax，512 vmovdqu32[rax-448]，zmm0 vmovdqu32[rax-384]，zmm0 vmovdqu32[rax-320]，zmm0 vmovdqu32[rax-256]，zmm0 vmovdqu32[rax-192]，zmm0 vmovdqu32[rax-128]，zmm0。L4。\n。l4：vmovdqu32[rax]，ymm0 vmovdqu32[rax+32]，ymm0 vmovdqu32[rax+64]，ymm0 vmovdqu32[rax+96]，ymm0 vmovdqu32[rax+128]，ymm0 vmovdqu32[rax+160]，ymm0 vmovdqu32[rax+192]，ymm0 vmovdqu32[rax+192]。L4。\n大多数编译器默认使用256位指令，即使对于支持AVX-512的目标也是如此(原因：降频，所以这里奇怪的是-march=原生版本。所有早期的x86测试都使用256位指令。\n观察到图7a是运行512位指令的结果，再加上对数据的窥探，这让我们立即解开了双模式行为的谜团。\n以下是缓冲区大小为9864的17个样本的原始数据：\n对于填充0和填充1的测试，性能遵循特定的模式：对于前9-10个样本，开始时速度较慢(约90 Gb/s)，然后突然跃升到较高的性能级别(接近200 Gb/s)。事实证明，这只是电压和频率管理再次咬我们一口。在这种情况下，没有频率变化：原始数据有一个频率列，显示试验始终运行在3.5 GHz。仅存在电压变化，并且当电压变化时，CPU以降低的调度吞吐量2运行。\n对于每个新的试用集(新的缓冲区大小值)重复此效果的原因是，每个新的试用集之前都有一个100ms的自旋等待：该自旋等待不运行任何AVX-512指令，因此CPU下降回较低的电压电平，并且此过程重复。当基准进入L2区域时，这种影响就会停止，因为在那里它足够慢，以至于被丢弃的10次预热试验足以吸收切换到更高电压电平的时间。\n我们只需删除100ms的预热(将--预热-ms=0传递给基准)就可以避免这个问题，在本文的其余部分，我们将讨论无预热版本(我们保留10个预热试验，它们应该足够了)。\n因此，我们只剩下第二个效果，即256位存储版本显示非常有效的消除，而不是512位版本。现在，让我们停止挑选256到512之间的收藏夹(把它放到您的堆栈上，我们稍后再讨论它)，只关注256位存储的消除行为。\n下面是256位存储版本的L3区域的特写，还显示了L2逐出类型，如上一篇文章中所讨论的：\n图8我们最终实现了难以捉摸的(接近)100%消除冗余零商店！填充值为0的案例在96%的无提示(消除3个)逐出时达到峰值。典型的L3带宽在消除的情况下约为59 Gb/s，在未消除的情况下为约42 Gb/s，加速比超过40%！所以这对冰湖来说是一件潜在的大事。\n与上次一样，我们还可以检查非核心跟踪器性能计数器，以查看通常会写回内存的较大缓冲区会发生什么情况。\n图9与L3的情况一样，我们看到存储消除似乎有96%的效率：对于填充0的情况，去核到内存写回的数量持平于4%。将其与图3进行比较，图3是在Skylake-S上运行的相同基准，请注意，只消除了一半对RAM的写入。\n此图表还包括alt01基准测试的结果。回想一下，此基准测试写入64字节的0和64字节的1。这意味着，通过零过零消除，最多只能消除一半的行。在Skylake-S上，只有大约50%的合格(零)行被取消，但在这里我们又一次达到了96%的取消！也就是说，在alt01的情况下，消除了48%的所有写入，其中一半是全1写入，不符合条件。\nRAM区域的全零情况的渐近加速比小于L3区域，约为23%，但这仍然不是一个不容忽视的问题。交替情况的加速比为10%，略低于全零情况4好处的一半。在L3区域，我们还注意到alt01消除的好处仅约为7%，远低于您预期的约20%的好处(如果您削减全零情况下看到的40%好处)。我们在Skylake-S上看到了类似的效果。\n最后值得一提的是，uncore中的这一小幅上升写入了填充0的情况：\n这恰好发生在从L3到RAM的转换过程中，此时写入平缓降至每行0.04，但这种上升是相当稳定的。所以这里有一些有趣的效果，可能与L3缓存5的自适应特性有关。\n如果我们回溯时间，是时候弹出心理堆栈并返回到我们之前注意到的事情：与512位存储相比，256位存储似乎在L3区域获得了更好的性能。\n请记住，由于-march标志中的意外行为，我们最终得到了256位和512位版本。相反，他们依赖于这种怪异的6，让我们只编写稍微懒惰的7个方法，这些方法显式使用256位和512位存储，但在其他方面是相同的。填充256_0使用256位存储并写入零，我将让您模式匹配其余的名称。\n图10此图表仅显示了17个试验的中位数。您可以查看原始数据来了解试验方差，但它通常很低。\n在L1区域中，512位方法通常获胜，写入0或1之间没有明显区别(月球的两半大多对齐)。尽管如此，256位的商店与512位的商店大体上是有竞争力的：它们的吞吐量还不到512位的一半。这要归功于冰湖上的第二个商店港口。如果没有该功能，在3.5 GHz时您将被限制为112 Gb/s，但在这里，256位存储可以轻松达到~190 Gb/s，512位存储可以轻松达到~195 Gb/s。512位存储可能略有优势，因为执行的指令总数较少(约为256位情况的一半)和相关的二阶效应。\n然而，在L2区域，256位方法似乎遥遥领先。这有点像水牛比尔队赢得了超级碗：这是不应该发生的。\n图11 256位基准测试开始时与其512位基准大致持平，但随后随着区域接近L2的完整大小而逐渐远离。到L2区域结束时，它们拥有近13%的优势。这适用于两种填充256版本--写0和写1的风格。因此，这种效应似乎不能用商店淘汰来解释：我们已经知道商店被淘汰了，而且只有当区域是L3大小时，淘汰才开始发挥明显的作用。\n在L3中，情况发生了变化：现在256位版本确实领先了，但只有写零的版本。256位和512位单填充版本的吞吐量下降，几乎达到相同的水平(但256位版本似乎仍然略微领先，但速度提高了约2%)。256位填零版本现在领先了大约45%！\n让我们只关注写入零的两个基准：填充256_0和填充512_0，并打开L2逐出计数器(您现在可能已经看到了那个计数器)：\n仅显示L2线路输出静默事件-驱逐的其余部分照常处于非静默状态。\n尽管我不得不让右轴传说在剧情中间漂浮着，但我希望故事是清晰的：256位商店以通常96%的比率被淘汰，但512位商店却徘徊在绝对像天空湖(Skylake)一样的约56%的水平上，我希望故事是清晰的：256位商店以通常96%的比率被淘汰，但512位商店却徘徊在绝对像天空湖(Skylake)一样的56%。我不能肯定，但我预计这种门店淘汰的差异在很大程度上解释了业绩差异。\n我还检查了关闭预取时的行为，但模式非常相似，只是这两种方法在L3中的性能都有所降低(您可以自己看看)。有趣的是，对于零过零存储，L3中的256位存储性能几乎与L2中的512位存储性能相同！在性能方面(在此基准测试中)，它几乎为您购买了缓存层次结构中的整个级别。\n通常我会试着猜测这里发生了什么，但这次我不会这么做了。我就是不知道9。整个事情非常令人费解，因为L1之后的一切都是在缓存线的基础上操作的：我们希望核心在一个线内创建的细粒度存储模式基本上对缓存系统的其余部分是不可见的，因为它只看到整行。然而，对于内核是以两个256位块还是单个512位块写入高速缓存线，在L3中甚至在RAM10中存在一些较大的影响。\n我们发现，最初在Skylake客户端上发现的商店消除优化仍然存在于Ice Lake中，并且在我们的Fill基准中的效率大约是Fill基准的两倍。观察到消除了96%的L2写回(到L3)和L3写回(到RAM)，相比之下，Skylake只有50%到60%。我们发现，L3区域的加速比高达45%，RAM的加速比约为25%，而Skylake的加速比不到20%。\n我们发现，当针对L2缓存或更大大小的区域进行填零写入时，256位写入通常比512位写入快得多。这对L2的影响最大，在L2中，256位过零写入比512位写入快45%。我们发现即使对于非零写入也有类似的影响，但仅在L2中。\n目前还没有发布的Sunny Cove服务器芯片是否会表现出同样的优化，这是一个有趣的悬而未决的问题。\n除非你只为自己的笔记本电脑进行开发，否则截至2020年5月，冰湖部署在你所关心的主机总数的很小一部分上，所以前一篇文章中的标题建议是适用的：这种优化不适用于足够的硬件，不足以让你专门针对它。这种情况在未来可能会随着“冰湖”和续集的推出而改变。在这种情况下，影响的大小可能使其在某些情况下值得优化。\n如果你有什么要说的，请在下面留言或在黑客新闻上讨论。\n它实际上仍在使用evex编码的avx-512指令vmovdqu32，这里的效率更高一些，因为avx-512对偏移量的编码更紧凑，偏移量是向量大小的倍数(通常是这样)。-↩。\n在这种情况下，吞吐量只减少了一半，而当我们在SKx上查看调度限制时，吞吐量只有四分之一，因此根据这个非常初步的结果，冰湖的调度限制似乎不那么严重(这需要更深入的研究：我们从未使用商店在SKx上进行测试)。-↩。\n严格来说，无声冲销是消除的充分条件，但不是必要条件，因此是消除门店数量的下限。据我所知，100%的门店都被淘汰了，但其中4%的门店是非静默回写的(但不是修改后的状态)。--↩。\n其中一个原因可能是，只写入交替行比连续写入一半数据的成本要高一些。当然，这显然更接近核心，因为您接触的页面数量是连续情况下的一半，需要的页面遍历数量是一半，预取更有效，因为您跨越了一半的4K边界(4K边界处的预取存储)，依此类推。即使在内存接口，交替行写入也可能效率较低，因为您从打开每个DRAM页中获得的好处较少，不能超过64字节的突发，等等。在一种病态情况下，如果控制器将交替行映射到交替通道，则交替行可能是带宽的一半，因为您将仅访问单个通道。我们可以试着通过尝试更粗粒度的交织来隔离这种效果。--↩。\nL3能够确定当前的访问模式是否会更好地服务于类似MRU驱逐策略的东西，例如，当数据流在没有重用的情况下被访问时，最好是快速将该数据踢出缓存，而不是驱逐其他可能有用的数据。-↩\n毕竟，这个问题很有可能会在后来的GCC版本中得到修复。--↩。\n从我不做任何标量头或尾处理的意义上说，这些都是懒惰的：即使没有剩下64字节，最后的迭代也只执行全宽SIMD存储：我们最多用63字节覆盖缓冲区。我们在分配缓冲区时会考虑到这一点，方法是确保分配至少超出该数量。这对于较大的缓冲区来说无关紧要，但这意味着与准确执行填充的方法相比，此版本对于非常小的缓冲区将获得提升。无论如何，我们对这里的大缓冲很感兴趣。--↩。\n最有可能的是，L1具有单个64字节宽的写入端口，如SKX，并且存储缓冲器头部的提交逻辑可以向前看一个存储，以查看它是否在同一行中，以便在单个周期内将两个存储出列。如果没有此功能，您可以在每个周期执行两个存储，但只能提交一个，因此长期存储吞吐量将被限制为每个周期一个。“↩。\n我撒谎了。我至少有一些想法。CPU功率预算可能在核心和非核心之间动态划分，并且由于512位存储触发AVX-512功率预算，所以用于非核心的功率较少，并且它以较低的频率运行(可以检查)。这似乎不太可能，因为这应该不会明显影响淘汰的机会。--↩。\n我们没有仔细观察RAM中的影响，但它仍然存在，尽管幅度较低。256位过零写入比同类型的512位写入快约10%.(完)↩", "note_en": "If you made it down to the  hardware survey on the last post, you might have  wondered where Intel’s newest mainstream architecture was.  Ice Lake was missing!\n Well good news: it’s here… and it’s interesting. We’ll jump right into the same analysis we did last time for Skylake client. If you haven’t read the  first article you’ll probably want to start there, because we’ll refer to concepts introduced there without reexplaining them here.\n As usual, you can skip to the  summary for the bite sized version of the findings.\n   Let’s first take a look at the overall performance: facing off  fill0 vs  fill1 as we’ve been doing for every microarchitecture. Remember,  fill0 fills a region with zeros, while  fill1 fills a region with the value one (as a 4-byte  int).\n All of these tests run at 3.5 GHz. The max single-core turbo for this chip is at 3.7 GHz, but is difficult to run in a sustained manner at this frequency, because of AVX-512 clocking effects and because other cores occasionally activate. 3.5 GHz is a good compromise that keeps the chip running at the same frequency, while remaining close to the ideal turbo. Disabling turbo is not a good option, because this chip runs at 1.1 GHz without turbo, which would introduce a large distortion when exercising the uncore and RAM.\n  Figure 7a    Figure 7b   Those two have a couple of key differences. The first is this weird thing that  Figure 7a has going on in the right half of the L1 region: there are two obvious and distinct performance levels visible, each with roughly half the samples.\n  The second thing is that while both of the plots show  some of the zero optimization effect in the L3 and RAM regions, the effect is  much larger in  Figure 7b:\n  So what’s the difference between these two plots? The top one was compiled with  -march=native, the second with  -march=icelake-client.\n Since I’m compiling this  on the Ice Lake client system, I would expect these to do the same thing, but for  some reason they don’t. The primary difference is that  -march=native  generates 512-bit instructions like so (for the main loop):\n . L4 :  vmovdqu32  [rax],  zmm0  add  rax ,  512  vmovdqu32  [ rax - 448 ] ,  zmm0  vmovdqu32  [ rax - 384 ] ,  zmm0  vmovdqu32  [ rax - 320 ] ,  zmm0  vmovdqu32  [ rax - 256 ] ,  zmm0  vmovdqu32  [ rax - 192 ] ,  zmm0  vmovdqu32  [ rax - 128 ] ,  zmm0  vmovdqu32  [ rax - 64 ] ,  zmm0  cmp  rax ,  r9  jne  . L4\n  . L4 :  vmovdqu32  [rax],  ymm0  vmovdqu32  [ rax + 32 ] ,  ymm0  vmovdqu32  [ rax + 64 ] ,  ymm0  vmovdqu32  [ rax + 96 ] ,  ymm0  vmovdqu32  [ rax + 128 ] ,  ymm0  vmovdqu32  [ rax + 160 ] ,  ymm0  vmovdqu32  [ rax + 192 ] ,  ymm0  vmovdqu32  [ rax + 224 ] ,  ymm0  add  rax ,  256  cmp  rax ,  r9  jne  . L4\n Most compilers use 256-bit instructions by default even for targets that support AVX-512 (reason:  downclocking, so the  -march=native version is the weird one here. All of the earlier x86 tests used 256-bit instructions.\n The observation that  Figure 7a results from running 512-bit instructions, combined with a peek at the data lets us immediately resolve the mystery of the bi-modal behavior.\n Here’s the raw data for the 17 samples at a buffer size of 9864:\n  The performance follows a specific pattern with respect to the trials for both  fill0 and  fill1: it starts out slow (about 90 GB/s) for the first 9-10 samples then suddenly jumps up the higher performance level (close to 200 GB/s). It turns out this is just  voltage and frequency management biting us again. In this case there is no frequency change: the  raw data has a frequency column that shows the trials always run at 3.5 GHz. There is only a voltage change, and while the voltage is changing, the CPU runs with reduced dispatch throughput  2.\n The reason this effect repeats for every new set of trials (new buffer size value) is that each new set of trials is preceded by a 100 ms spin wait: this spin wait doesn’t run any AVX-512 instructions, so the CPU drops back to the lower voltage level and this process repeats. The effect stops when the benchmark moves into the L2 region, because there it is slow enough that the 10 discarded warmup trials are enough to absorb the time to switch to the higher voltage level.\n We can avoid this problem simply by removing the 100 ms warmup (passing  --warmup-ms=0 to the benchmark), and for the rest of this post we’ll discuss the no-warmup version (we keep the 10 warmup  trials and they should be enough).\n  So we’re left with the second effect, which is that the 256-bit store version shows  very effective elimination, as opposed to the 512-bit version. For now let’s stop picking favorites between 256 and 512 (push that on your stack, we’ll get back to it), and just focus on the elimination behavior for 256-bit stores.\n Here’s the closeup of the L3 region for the 256-bit store version, showing also the L2 eviction type, as discussed in the previous post:\n  Figure 8  We finally have the elusive (near) 100% elimination of redundant zero stores! The  fill0 case peaks at 96% silent (eliminated  3) evictions. Typical L3 bandwidth is ~59 GB/s with elimination and ~42 GB/s without, for a better than 40% speedup! So this is a potentially a big deal on Ice Lake.\n Like last time, we can also check the uncore tracker performance counters, to see what happens for larger buffers which would normally write back to memory.\n  Figure 9   As with the L3 case, we see that the store elimination appears 96% effective: the number of uncore to memory writebacks flatlines at 4% for the  fill0 case. Compare this to   Figure 3, which is the same benchmark running on Skylake-S, and note that only half the writes to RAM are eliminated.\n This chart also includes results for the  alt01 benchmark. Recall that this benchmark writes 64 bytes of zeros alternating with 64 bytes of ones. This means that, at best, only half the lines can be eliminated by zero-over-zero elimination. On Skylake-S, only about 50% of eligible (zero) lines were eliminated, but here we again get to 96% elimination! That is, in the  alt01 case, 48% of all writes were eliminated, half of which are all-ones and not eligible.\n The asymptotic speedup for the all zero case for the RAM region is less than the L3 region, at about 23% but that’s still not exactly something to sneeze at. The speedup for the alternating case is 10%, somewhat less than half the benefit of the all zero case  4. In the L3 region, we also note that the benefit of elimination for  alt01 is only about 7%, much smaller than the ~20% benefit you’d expect if you cut the 40% benefit the all-zeros case sees. We saw a similar effect in Skylake-S.\n Finally it’s worth noting that this little uptick in uncore writes in the  fill0 case:\n  This happens right around the transition from L3 to RAM, and this, the writes flatline down to 0.04 per line, but this uptick is fairly consistently reproducible. So there’s some interesting effect there, probably, perhaps related to the adaptive nature of the L3 caching  5.\n  If we rewind time, time to pop the mental stack and return to something we noticed earlier: that 256-bit stores seemed to get superior performance for the L3 region compared to 512-bit ones.\n Remember that we ended up with 256-bit and 512-bit versions due to unexpected behavior in the  -march flag. Rather they  relying on this weirdness  6, let’s just write slighly lazy  7  methods that explicitly use 256-bit and 512-bit stores but are otherwise identical.  fill256_0 uses 256-bit stores and writes zeros, and I’ll let you pattern match the rest of the names.\n   Figure 10  This chart shows only the the median of 17 trials. You can look at the raw data for an idea of the trial variance, but it is generally low.\n In the L1 region, the 512-bit approach usually wins and there is no apparent difference between writing 0 or 1 (the two halves of the moon mostly line up). Still, 256-bit stores are roughly  competitive with 512-bit: they aren’t running at half the throughput. That’s thanks to the second store port on Ice Lake. Without that feature, you’d be limited to 112 GB/s at 3.5 GHz, but here we handily reach ~190 GB/s with 256-bit stores, and ~195 GB/s with 512-bit stores. 512-bit stores probably have a slight advantage just because of fewer total instructions executed (about half of the 256-bit case) and associated second order effects.\n  In the L2 region, however, the 256-bit approaches seem to pull ahead. This is a bit like the Buffalo Bills winning the Super Bowl: it just isn’t supposed to happen.\n   Figure 11  The 256-bit benchmarks start roughly tied with their 512 bit cousins, but then steadily pull away as the region approaches the full size of the L2. By the end of the L2 region, they have nearly a ~13% edge. This applies to  both  fill256 versions – the zeros-writing and ones-writing flavors. So this effect doesn’t seem explicable by store elimination: we already know ones are eliminated, and elimination only starts to play an obvious role when the region is L3-sized.\n In the L3, the situation changes: now the 256-bit version really pulls ahead,  but only the version that writes zeros. The 256-bit and 512-bit one-fill versions fall down in throughput, nearly to the same level (but the 256-bit version still seems  slightly but measurably ahead at ~2% faster). The 256-bit zero fill version is now ahead by roughly 45%!\n Let’s concentrate only on the two benchmarks that write zero:  fill256_0 and  fill512_0, and turn on the L2 eviction counters (you probably saw that one coming by now):\n  Only the  L2 Lines Out Silent event is shown – the balance of the evictions are  non-silent as usual.\n Despite the fact that I had to leave the right axis legend just kind floating around in the middle of the plot, I hope the story is clear: 256-bit stores get eliminated at the usual 96% rate, but 512-bit stores are hovering at a decidedly Skylake-like ~56%. I can’t be sure, but I expect this difference in store elimination largely explains the performance difference.\n I checked also the behavior with prefetching off, but the pattern is very similar, except with both approaches having reduced performance in L3 (you can  see for yourself). It is interesting to note that for zero-over-zero stores, the 256-bit store performance  in L3 is almost the same as the 512-bit store performance  in L2! It buys you almost a whole level in the cache hierarchy, performance-wise (in this benchmark).\n Normally I’d take a shot at guessing what’s going on here, but this time I’m not going to do it. I just don’t know  9. The whole thing is very puzzling, because everything after the L1 operates on a cache-line basis: we expect the fine-grained pattern of stores made by the core,  within a line to basically be invisible to the rest of the caching system which sees only full lines. Yet there is some large effect in the L3 and even in RAM  10 related to whether the core is writing a cache line in two 256-bit chunks or a single 512-bit chunk.\n  We have found that the store elimination optimization originally uncovered on Skylake client is still present in Ice Lake and is roughly twice as effective in our fill benchmarks. Elimination of 96% L2 writebacks (to L3) and L3 writebacks (to RAM) was observed, compared to 50% to 60% on Skylake. We found speedups of up to 45% in the L3 region and speedups of about 25% in RAM, compared to improvements of less than 20% in Skylake.\n We find that when zero-filling writes occur to a region sized for the L2 cache or larger, 256-bit writes are often significantly  faster than 512-bit writes. The effect is largest for the L2, where 256-bit zero-over-zero writes are up to  45% faster than 512-bit writes. We find a similar effect even for non-zeroing writes, but only in the L2.\n  It is an interesting open question whether the as-yet-unreleased  Sunny Cove server chips will exhibit this same optimization.\n  Unless you are developing only for your own laptop, as of May 2020 Ice Lake is deployed on a microscopic fraction of total hosts you would care about, so the headline advice in the previous post applies: this optimization doesn’t apply to enough hardware for you to target it specifically. This might change in the future as Ice Lake and sequels roll out in force. In that case, the magnitude of the effect might make it worth optimizing for in some cases.\n     If you have something to say, leave a comment below or discuss on  Hacker News.\n    It’s actually still using the EVEX-encoded AVX-512 instruction  vmovdqu32, which is somewhat more efficient here because AVX-512 has more compact encoding of offsets that are a multiple of the vector size (as they usually are).  ↩\n  In this case, the throughput is only halved, versus the 1/4 throughput when we looked at dispatch throttling on  SKX, so based on this very preliminary result it seems like the dispatch throttling might be less severe in Ice Lake (this needs a deeper look: we never used stores to test on  SKX).  ↩\n  Strictly speaking, a silent writeback is a  sufficient, but not a  necessary condition for elimination, so it is a lower bound on the number of eliminated stores. For all I know, 100% of stores are eliminated, but out of those 4% are written back not-silently (but not in a modified state).  ↩\n  One reason could be that writing only alternating lines is somewhat more expensive than writing half the data but contiguously. Of course this is obviously true closer to the core, since you touch half the number of the pages in the contiguous case, need half the number of page walks, prefetching is more effective since you cross half as many 4K boundaries (prefetch stores at 4K boundaries) and so on. Even at the memory interface, alternating line writes might be less efficient because you get less benefit from opening each DRAM page, can’t do longer than 64-byte bursts, etc. In a pathological case, alternating lines could be  half the bandwidth if the controller maps alternating lines to alternating channels, since you’ll only be accessing a single channel. We could try to isolate this effect by trying more coarse grained interleaving.  ↩\n  The L3 is capable of determining if the current access pattern would be better served by something like an  MRU eviction strategy, for example when a stream of data is being accessed without reuse, it would be better to kick that data out of the cache quickly, rather than evicting other data that may be useful.  ↩\n  After all, there’s a good chance it will be fixed in a later version of gcc.  ↩\n  These are lazy in the sense that I don’t do any scalar head or tail handling: the final iteration just does a full width  SIMD store even if there aren’t 64 bytes left: we overwrite the buffer by up to 63 bytes. We account for this when we allocate the buffer by ensuring the allocation is oversized by at least that amount. This doesn’t matter for larger buffers, but it means this version will get a boost for very small buffers versus approaches that do the fill exactly. In any case, we are interested in large buffers here.  ↩\n  Most likely, the L1 has a single 64 byte wide write port, like  SKX, and the commit logic at the head of the store buffer can look ahead one store to see if it is in the same line in order to dequeue two stores in a single cycle. Without this feature, you could  execute two stores per cycle, but only commit one, so the long-run store throughput would be limited to one per cycle.  ↩\n  Well I lied. I at least have some ideas. It may be that the CPU power budget is dynamically partitioned between the core and uncore, and with 512-bit stores triggering the AVX-512 power budget, there is less power for the uncore and it runs at a lower frequency (that could be checked). This seems unlikely given that it should not obviously affect the elimination chance.  ↩\n  We didn’t take a close look at the effect in RAM but it persists, albeit at a lower magnitude. 256-bit zero-over-zero writes are about 10% faster than 512-bit writes of the same type.  ↩", "posttime": "2020-05-19 01:43:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "商店,lake,存储", "title": "冰湖商店的淘汰", "title_en": "Ice Lake Store Elimination", "transed": 1, "url": "https://travisdowns.github.io/blog/2020/05/18/icelake-zero-opt.html", "via": "", "real_tags": ["商店", "lake", "存储"]}, {"category": "", "categoryclass": "", "imagename": "54c5cf51c6f893a676d95ecb99a49c6c.png", "infoid": 1002667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我连续14天每晚睡4个小时，没有发现任何对认知的影响(通过心理运动警戒任务、自定义第一人称射击场景和SAT进行评估)。我是一名22岁的男性，通常睡眠时间为7-8小时。\n我完全清醒(非常粗略地)85%的时间是清醒的，10%的时间是中度困倦的，5%的时间是完全睡着的。通过玩15-20分钟的电子游戏，我可以随时从“入睡”到“完全清醒”。最终，我每天大约玩30-90分钟的视频游戏，在实验期间，我能够在每天超过16个小时的时间里充分发挥效率。\n我没有测量我的困倦程度。然而，在整个实验过程中，我不得不抵制规律的睡眠冲动，有几次当我不想玩电子游戏的时候，我非常接近实验失败，有一次我在椅子上睡着了，几分钟后被我的妻子叫醒。这个睡眠时间表极难维持。\n缺乏对认知能力的影响是令人惊讶的，可能反映了真正缺乏认知障碍，我希望证明由于长期睡眠剥夺而缺乏认知障碍，缺乏盲目的偏向测量，缺乏统计能力，和/或其他因素。\n我认为，这个实验提供了强有力的证据，证明我在12-14天里每天睡4小时没有经历过重大的认知障碍，而且它提供了微弱的提示性证据，表明根本没有认知障碍。\n我计划在这个实验之后进行急性睡眠剥夺实验(75小时不睡觉)和更长时间的部分睡眠剥夺实验(每天睡眠4小时，持续(可能)30天或更长时间)。\n我对将我的结果推广给其他人持谨慎态度，并欢迎独立复制这个实验。\n我用来执行统计和绘制图表的所有脚本、所有原始数据以及复制实验所需的所有配置文件都可以在GitHub上找到，分别是AimGood(5.99美元)和Inquisite6 Lab(30天试用期)。这里和GitHub上提供了预分析计划。\n额外觉醒的累积成本：慢性睡眠限制和完全睡眠剥夺对神经行为功能和睡眠生理的剂量反应影响范东恩H，麦斯林G，穆林顿JM，丁格斯DF。额外觉醒的累积成本：慢性睡眠限制和完全睡眠剥夺对神经行为功能和睡眠生理的剂量反应效应。睡吧。2003年3月1日；26(2)：117-26。是由汉斯·P·A·范·东恩、格雷格·梅斯林、珍妮特·M·穆林顿和大卫·F·丁格斯在2003年发表在“睡眠”杂志上的一项研究。\n从那时起，它已经成为睡眠科学中最著名的实验之一，累积了2700多次引用，其发现进入了流行文化。特别是，人们没有注意到由于睡眠不足而造成的认知障碍，以及连续两周每晚睡6个小时就足以产生重大认知障碍的想法似乎都源于这项研究。\n我对这项研究的发现很感兴趣，对马修·沃克(Matthew Walker)的“为什么我们睡觉”的调查提高了我对睡眠科学的兴趣，我决定尝试部分复制和推广它。\n实验前7天，我给自己8小时(23：30-07：30)的睡眠时间，以确保我没有任何睡眠欠账。我这几天(2020-03-27到2020-04-02)的平均睡眠时间是7.78小时(标准误差：0.15小时)。\n我每晚(3：30-7：30)睡4个小时，连续14天(Van Donen等人的实验条件之一)。2003年)，所有其他睡眠都被禁止，并将剥夺睡眠(治疗)第12天、第13天和第14天的认知能力与正常状态(对照组)进行了比较。我没有每天测试自己，因为Van Donen等人在4小时条件下的认知缺陷是单调增加的，而且我只对睡眠剥夺最严重的后果感兴趣。\n在实验期间，我一直呆在室内。我工作，玩电子游戏，看电影，浏览互联网，看书，在公寓里走来走去，但没有参加任何激烈的活动。我避免阳光直射，睡觉时关掉所有的灯。\n在实验前两周或实验期间，我没有使用任何咖啡因、酒精、烟草和/或药物。\n在实验前的两周里，我只在中午12点到晚上8点进食，并在实验期间继续这个时间表。我的饮食没有其他限制。\n我没有任何内科、精神病学或睡眠相关的疾病，除了偶尔会感到胸部有压力相关的压力，在实验过程中我也没有经历任何不寻常的症状。\n在过去的两年里，我既没有上过夜班，也没有上过轮班。在实验之前的3个月里，我没有跨越时区旅行。\n图4.我在实验中执行的任务片段。左：Pvt。中心：Guzey_Arena_0。右：Sat。使用ezgif.com创建。\n精神运动警戒任务本质上是一项长达10分钟的反应测试，已经成为睡眠研究中评估清醒程度的标准方法。分析PVT数据的标准方法是计算会话中的流逝次数(响应时间为&gt；=500ms的试验)。这就是我分析数据的方式。\nguzey_arena_0是第一人称射击场景，在该场景中，玩家必须尽快杀死在竞技场周围奔跑的20个机器人(一次有10个机器人出现，它们在杀戮时在随机位置重新出现)。这一场景需要快速反应时间(机器人经常改变方向并出现在随机位置)、战术思维(你必须选择追逐哪个机器人以及在哪里寻找它们)和精细运动技能(你必须使用键盘四处移动，并使用鼠标精确瞄准)。\nGUZEY_ARENA_0是我最关心的考试。我认为它优于PVT有几个原因：\n我相信它对我来说更具外在效力。guzey_arena_0比PVT更吸引人，也更好地反映了我通常从事的活动(写作、编码、玩视频游戏)。PVT可能是像长途驾驶这样乏味的任务的一个很好的模式，但我每天很少有这样的任务(而且根本不开车)。\n最重要的是，它需要实际的思考，而不仅仅是反应时间，因此更适合于评估对复杂认知能力的影响。\n它同时测试几种认知和运动技能，因此这三种能力中的任何一种都会被测试发现。\nSAT是一项长达3小时的综合测试，由语言(文本理解、语法等)组成。还有数学题。在美国，这是评估大学准备情况的标准方法，每年有数百万高中生参加。\n我在开始剥夺睡眠前1天以及结束睡眠剥夺后第4天和第5天进行了对照测量。我在剥夺睡眠的第12天、第13天和第14天进行了治疗测量。\n在预分析计划(PAP)中详细描述了数据收集，以及我处理实践效果的策略。讨论中描述了与PAP的所有偏差。\n我对PVT和Guzey_Arena进行配对t检验，将治疗和控制条件的均值在0.025.0 5显著性水平(0.0 5显著性水平，Bonferroni校正2次比较)与双侧替代方案进行比较。\n我没有提到t检验将是配对t检验，因为我没有意识到独立样本的t检验和配对样本的t检验是不同的。\n在pap中，我计算了pvt和guzey_arena_0所需的样本大小，以便能够在0.025的显著性水平和0.895次方(0.895次方确保我达到0.8联合次方(如果这两个假设都为假，则正确拒绝这两个零假设的概率)下分别检测到0.8%和0.5%的效果大小)。\n计算的样本量是PVT的39对观测和Guzey_ARENA_0的99对观测。这些是我收集的样本大小。\n然而，这些样本量计算是不正确的。由于配对t-检验的功效高于独立样本t-检验，结果表明，对于这些样本大小，我能够检测到的效应大小分别是pvt的0.58%和guzey_arena_0的0.35%(在0.025的显著性水平和0.895的幂)。\n图5.左：科恩的d为0.58。右：科恩的D为0.35。和R心理学家一起创造的。\n鉴于观察的数量非常少，我不会对SAT数据进行任何统计。\n考虑到我在讨论SAT结果，尽管我没有对它们进行任何统计，但我只修正了2个比较，这让我感到有点奇怪。\n摘要：在对照组和治疗条件下，我的PVT表现在统计学上没有显著差异。\n摘要：在对照组和治疗条件下，我的Guzey_arena_0性能没有统计学上的显著差异。\n控制分数(数学，语文)：(710,760)，(780,760)(750,690)；治疗分数(数学，语文)：(730,720)，(790,740)，(790,750)(越多越好)。\n我的关键假设是PVT上的失误数量增加了，因为它是一项无聊得像地狱一样的任务。仅仅盯着电脑看就是10分钟，等待红点周期性地出现。所以我认为被剥夺睡眠的人只是在任务过程中睡着了，但其他方面功能正常，他们的认知功能没有受到影响。因此，我预计我的PVT性能会下降，但艾姆神的性能不会下降，因为这是一项有趣的任务，尽管它主要依赖于注意力来提高性能。\n我的第一个假设没有得到证实。在对照组和治疗条件下，我的PVT表现没有差别。我以为在测试期间我会开始入睡，进入微睡状态，但似乎视频游戏-每当我感觉太困的时候就玩-刺激我到了这样的程度，即使做一个无聊的10分钟长的测试也不足以诱导微睡。\n我相信我的PVT数据质量不是很高。首先，虽然我计划在7：40、13：00、13：20、13：40、16：00、16：20、16：40、19：20、19：40、22：00、22：20、22：40乘坐PVT，但有时会忘记，有时会在指定时间内忙碌。因此，尽管我在指定时间的5-10分钟内参加了绝大多数测试(最大延迟：22分钟)，但我没有完全按时参加PVT。有人可能会争辩说，我策略性地推迟了PVT课程，以便在我开始感觉更警觉的时候参加测试。此外，在进行控制测量的最后两天里，我非常无聊，有时会分心并陷入思考，这导致我每个会话都会有3到4次失误(如图1所示)。我不认为这些失误代表我缺乏警觉性。最后，我不得不将最后一次治疗日的最后3次测试的时间从22：00，22：20，22：40改为21：00，21：20，21：40，因为我在22：00上床睡觉，而我在撰写方案时没有考虑到这一点(所有这些更改都可以在这里找到)。\n总而言之，我认为PVT的数据有力地表明，在实验期间，我能够控制自己的困倦程度，但我不认为可以从中得出太多其他结论。在我看来，这种解释似乎很有说服力，但我欢迎任何可能挑战它的进一步批评。\n我没有把握。我不认为我有任何突变使我需要更少的睡眠，因为我通常睡眠7-8小时。我认为最合理的解释是，我的认知表现并没有受到慢性失眠的太大影响。\n似乎人们对睡眠不足的反应差异很大。例如，Van Donen等人。2004年范东恩H，麦斯林G，Dinges DF。处理疲劳和表现的时间动态中的个体间差异：重要性和技巧。航空、太空和环境医学。2004年3月1日；75(3)：A147-54。(同一第一作者的另一篇论文)发现：\n通过精神运动警戒任务的表现失误来衡量(13)，发现一些受试者因睡眠不足而受到的损害比其他受试者严重得多(图1，左侧面板)。因此，一些受试者似乎相对容易受到睡眠不足造成的表现障碍的影响，而另一些受试者似乎相对有弹性。有趣的是，正如调查和日常日记所保证的那样，脆弱和有弹性的人在他们认为需要或经常获得的睡眠时间上没有显著差异。这表明，易受睡眠不足影响的个体之间的差异不仅仅是由睡眠需求的差异决定的(42)。\n图6.在实验室环境中，在完全剥夺睡眠的40小时内，精神运动警戒任务(PVT；左手面板)和斯坦福嗜睡量表(SSS；右手面板)的主观嗜睡分数导致神经行为表现下降(11)。星号显示最容易失眠(类型1)的8名受试者的PVT表现失误和SSS嗜睡评分；圆点显示最容易失眠(类型3)的7名受试者的数据。尽管在精神运动能力损害方面有相当大的差异，但这两组之间在嗜睡评分方面没有统计学上的显著差异。转载自Van Donen等人。2004年。\n我的第二个假设得到了证实。在对照和治疗条件下，我的Guzey_arena_0表现没有差别。\n我相信我的guzey_arena_0数据质量很高。我在相同的环境中参加测试，几乎总是全神贯注于测试。与PVT一样，我只在计划时间(几乎总是在计划时间的5-10分钟内)执行测试。和PVT一样，我不得不更改一些测试的时间，因为我忘了解释在实验的最后6天里我睡得更早的原因(所有这样的更改都可以在这里找到)。在一次治疗过程中，我不小心取了12个样本。我发现，当我从视频中提取数据时，我错误地计算了在那次会话中采集的样本数量，并且没有将样本12包括在数据中，因为我使用的配对样本t-test依赖于匹配的数据，而我的计划是在每次会话中恰好收集11个样本。即使当包括该样本时，控制平均值仍然不显著地高于处理平均值。\n综上所述，我认为Guzey_Arena_0强烈表明在治疗条件下没有重大的认知恶化。我认为，它提供了适度的证据，表明在治疗条件下没有中度的认知恶化。我认为，这是一个微弱的证据，表明在治疗条件下根本没有认知能力的恶化。\n与guzey_arena_0相反，SAT有一个绝对上限(每个部分800个)，我知道我可以接近这个上限(至少数学部分是这样)，因此创建了一个隐式的控制条件，使其不受我有意识或无意识地试图抑制我的控制性能的影响。这意味着，数学部分的分数在800分左右，语言部分的分数在700到750分之间，这是一个相当好的证据，表明认知能力没有严重恶化。\n在治疗的第12天、第13天和第14天，我在SAT的(数学、语言)部分得到了(730,720)、(790,740)和(790,750)分，而在控制日得到了(710,760)、(780,760)和(750,690)分。数学部分的第一个低控制分数是由于缺乏练习和我在一道问题上陷入困境后时间所剩无几的结果。语言部分的最后一个低控制分数是因为我对连续5天参加SAT变得非常厌倦，沉浸在10分钟的思考中，不得不匆忙。\n总而言之，我认为SAT的数据有力地表明，我的认知在许多方面都没有严重或中度的认知恶化，因为这项测试包括(对我来说)具有挑战性的阅读理解问题，需要快速的数学思维。我认为，它几乎没有提供任何关于轻微认知恶化的证据，因为我通常在每一节结束时都有空闲时间，我用这些时间来仔细检查我的反应，而轻微的认知恶化可能会导致我得到大致相同的分数，但剩下的时间更少了。\n我完全清醒(非常粗略地)85%的时间是清醒的，10%的时间是中度困倦的，5%的时间是完全睡着的。主观上，我觉得我每天增加了2到3个小时的工作时间。\n此外，我的睡眠债务似乎并没有随着时间的推移而增加。我的印象是，在急性睡眠剥夺期间，由于一个人70多个小时没有睡觉，大多数刺激都不起作用，这意味着视频游戏不再能够让人完全清醒。相反，我发现通过玩15-20分钟的电子游戏，我可以随时从“入睡”到“完全清醒”。最终，我每天大约玩30-90分钟的电子游戏。\n最后，即使我没有感觉到认知能力的恶化，也没有积累睡眠债务，维持这样的睡眠时间表是非常困难的。我不得不抵制规律的睡眠冲动，有几次当我不想玩电子游戏的时候，我非常接近实验失败，有一次我在椅子上睡着了，几分钟后被我的妻子叫醒。偶尔，当我试图看看我是否能在没有电子游戏的情况下完全恢复警觉时，我会陷入一系列长达几秒钟的微睡眠。如果不是我花了这么多时间设计和公开宣布我的实验，我觉得我不可能在这14天里保持这个时间表。\n在治疗第10天的晚上，我给一位朋友打了个电话，我经常和他聊天。我们花了一个小时讨论几篇学术论文的优缺点。在对话的大部分时间里，我都处于能力的巅峰状态，不得不不断地进行复杂的辩论，并在匆忙中进行大量思考，这对我的长期记忆、短期记忆、逻辑思维和说话能力造成了沉重的负担。打完电话后，我问那位朋友，他是否注意到我已经连续10天每晚睡4个小时了。他写道：\n我的室友知道我的实验，他问我，在我恢复睡眠两晚后，我每晚还能睡多久，意思是说，在我不再被剥夺睡眠后，他没有注意到我的状态有任何显著的变化。我通常每天和他聊30-60分钟。\n我喜欢醒着，不喜欢睡觉。因此，我发现睡眠剥夺对认知没有影响。与治疗条件相比，这可能会导致我在控制条件下不那么努力。不幸的是，我不知道如何让自己对睡眠时间视而不见。我在SAT小节中讨论了在这个实验的背景下没有失明的问题。\n我关心我的认知能力因睡眠不足而发生的哪怕是最小的变化。例如，如果效果大小为“仅”0.1，我仍然关心它。然而，为了在这个实验中检测到这样的效果，我必须花费40多个小时为guzey_arena_0收集1224对观测数据。\n如果我放弃PVT，只穿孔，情况看起来也不会好很多。\n..", "note_en": "I slept 4 hours a night for 14 days and didn’t find any effects on cognition (assessed via Psychomotor Vigilance Task, a custom first-person shooter scenario, and SAT). I’m a 22-year-old male and normally I sleep 7-8 hours.\n I was fully alert (very roughly) 85% of the time I was awake, moderately sleepy 10% of the time I was awake, and was outright falling asleep 5% of the time. I was able to go from “falling asleep” to “fully alert” at all times by playing video games for 15-20 minutes. I ended up playing video games for approximately 30-90 minutes a day and was able to be fully productive for more than 16 hours a day for the duration of the experiment.\n I did not measure my sleepiness. However, for the entire duration of the experiment I had to resist regular urges to sleep and on several occasions when I did not want to play video games was very close to failing the experiment, having at one point fallen asleep in my chair and being awakened a few minutes later by my wife. This sleep schedule was extremely difficult to maintain.\n Lack of effect on cognitive ability is surprising and may reflect true lack of cognitive impairment, my desire to demonstrate lack of cognitive impairment due to chronic sleep deprivation and lack of blinding biasing the measurements, lack of statistical power, and/or other factors.\n I believe that this experiment provides strong evidence that I experienced no major cognitive impairment as a result of sleeping 4 hours per day for 12-14 days and that it provides weak suggestive evidence that there was no cognitive impairment at all.\n I plan to follow this experiment up with an acute sleep deprivation experiment (75 hours without sleep) and longer partial sleep deprivation experiments (4 hours of sleep per day for (potentially) 30 and more days).\n I’m wary of generalizing my results to other people and welcome independent replications of this experiment.\n All scripts I used to perform statistics and to draw graphs, all raw data, and all configuration files for Aimgod ( costs $5.99) and for Inquisit 6 Lab ( has a 30-day trial) necessary to replicate the experiment are available on  GitHub. Pre-analysis plan is available  here and on  GitHub.\n   The cumulative cost of additional wakefulness: dose-response effects on neurobehavioral functions and sleep physiology from chronic sleep restriction and total sleep deprivation      \r Van Dongen H, Maislin G, Mullington JM, Dinges DF. The cumulative cost of additional wakefulness: dose-response effects on neurobehavioral functions and sleep physiology from chronic sleep restriction and total sleep deprivation. Sleep. 2003 Mar 1;26(2):117-26.\r is a study published in journal  Sleep in 2003 by Hans P.A. Van Dongen, Greg Maislin, Janet M. Mullington, and David F. Dinges.\n Since then it has become one of the most well-known experiments in sleep science, accumulating more than 2700 citations and having its findings enter the popular culture. In particular, it appears that the idea that people do not notice the cognitive impairment due to sleep deprivation and that sleeping 6 hours a night for two weeks is enough to produce significant cognitive impairment both originate from this study.\n Intrigued by the study’s findings and having my interest in sleep science heightened by  my investigation into Matthew Walker’s  Why We Sleep, I decided to attempt to partially replicate and extend it.\n   I gave myself a sleep opportunity of 8 hours (23:30-07:30) for 7 days prior to the experiment to make sure I don’t have any sleep debt carried over. My average sleep duration in these days (2020-03-27 to 2020-04-02) was 7.78 hours (standard error: 0.15 hours).\n I slept for 4 hours a night (3:30-7:30) for 14 days (one of the experimental conditions in Van Dongen et al. 2003), with all other sleep being prohibited, and compared my cognitive abilities on days 12, 13, and 14 of sleep deprivation ( treatment) to my normal state ( control). I did not test myself every day because the cognitive deficits in the 4-hour condition were increasing monotonically in Van Dongen et al., and I was only interested in the most severe consequences of sleep deprivation.\n I remained inside for the duration of the experiment. I worked, played video games, watched movies, browsed the internet, read, walked around the apartment, but did not engage in any vigorous activities. I avoided direct sunlight and turned off all lights during sleep times.\n I did not use any caffeine, alcohol, tobacco, and/or medications in the 2 weeks before the experiment or during the experiment.\n I only ate from 12pm to 8pm for the 2 weeks before the experiment and continued this schedule during the experiment. My diet was not otherwise restricted.\n I do not have any medical, psychiatric or sleep-related disorders, aside from occasionally experiencing stress-related strain in my chest, and I did not experience any unusual symptoms during the experiment.\n I worked neither regular night nor rotating shift work within the past 2 years. I have not travelled across time zones in the 3 months before the experiment.\n   Figure 4. Clips of tasks I performed in the experiment. Left: PVT. Center: guzey_arena_0. Right: SAT. Created with  ezgif.com.\n Psychomotor Vigilance Task is essentially a 10-minute-long reaction test that has become a standard way to assess wakefulness in sleep research. The standard way to analyze PVT data is to count the number of lapses (trials in which response time was &gt;=500ms) in a session. This is how I analyzed the data.\n guzey_arena_0 is a first-person shooter scenario in which the player has to kill 20 bots running around the arena as quickly as possible (10 bots are present at a time and they respawn in a random location on kill). The scenario requires a mix of quick reaction time (bots frequently change directions and appear in random locations), tactical thinking (you have to choose which bot to pursue and where to look for them), and fine-motor skills (you have to move your around using the keyboard and aim accurately using the mouse).\n guzey_arena_0 is the test I care the most about. I believe it’s superior to PVT for several reasons:\n I believe it is more externally valid for me. guzey_arena_0 is much more engaging than PVT and mirrors the activities I commonly engage in (writing, coding, playing video games) much better. PVT might be a good model of boring tasks like long-distance driving, but I have few such tasks day-to-day (and don’t drive at all)\n crucially, it requires actual  thinking, rather just reaction time and is thus better suited to assess the impact on complex cognitive abilities\n it tests several cognitive and motor skills at the same time, so a deterioration in any of those three abilities will be picked up by the test\n The  SAT is a 3-hour-long composite test that consists of verbal (text comprehension, grammar, etc.) and math problems. It is the standard way to assess college preparedness in the US and is taken by million of high school students every year.\n  I took control measurements 1 day before starting sleep deprivation and on days 4 and 5 after I ended sleep deprivation. I took treatment measurements on days 12, 13, and 14 of sleep deprivation.\n Data collection, as well as my strategy to deal with practice effects is described in detail in  pre-analysis plan ( PAP). All deviations from PAP are described in  Discussion.\n I performed paired t-tests for PVT and for guzey_arena comparing the means of treatment and control conditions at 0.025 significance level (0.05 significance level, Bonferroni-corrected for 2 comparisons) against a two-sided alternative.\n   I did not mention that t-tests will be paired t-tests, because I did not realize that t-tests for independent samples and for paired samples are different.\n In PAP, I calculated the required sample sizes for PVT and for guzey_arena_0 to be able to detect an effect-size of 0.8 and 0.5 respectively, at 0.025 significance level and 0.895 power (0.895 power ensures that I achieve 0.8 joint power (probability to correctly reject both null hypotheses if they’re both false)).\n The calculated sample size was 39 pairs of observations for PVT and 99 pairs of observations for guzey_arena_0. These are the sample sizes I collected.\n However, these sample size calculations were incorrect. Because the power of a paired t-test is higher than of an independent samples t-test, it turned out that the effect-sizes I was able to detect for these sample sizes was 0.58 for PVT and 0.35 for guzey_arena_0 (at 0.025 significance level and 0.895 power).\n  Figure 5. Left: Cohen&#39;s d of 0.58. Right: Cohen&#39;s d of 0.35. Created with  R Psychologist.\n I am not performing any statistics on the SAT data, in light of extremely small number of observations.\n I feel slightly weird that I’m only correcting for 2 comparisons, given that I’m discussing the SAT results, even though I’m not performing any statistics on them.\n       Summary: There was no statistically significant difference in my PVT performance between control and treatment conditions.\n       Summary: There was no statistically significant difference in my guzey_arena_0 performance between control and treatment conditions.\n   Control scores (math,verbal): (710,760), (780,760) (750,690); treatment scores (math,verbal): (730,720), (790,740), (790,750) (more is better).\n    My key hypothesis is that the number of lapses on PVT increases because it’s a boring as hell task. It’s 10 minutes just staring into the computer waiting for the red dot to appear periodically. So I think that sleep deprived are just falling asleep during the task but are otherwise functioning normally and their cognitive function is not compromised. Therefore,  I expect that my PVT performance will deteriorate but Aimgod performance will not, since this is an interesting task, even though it primarily relies on attention for performance.\n  My first hypothesis was not confirmed. There was no difference in my PVT performance between control and treatment conditions. I thought that during the test I would start falling asleep and fall into microsleeps but it seems that video games – which I played whenever I was feeling too sleepy – stimulated me to the point that even doing a boring 10-minute-long test was not enough to induce microsleeps.\n I believe that the quality of my PVT data is not very high. First, while I planned to take PVT at 7:40, 13:00, 13:20, 13:40, 16:00, 16:20, 16:40, 19:00 19:20, 19:40, 22:00, 22:20, 22:40, sometimes I forgot about it and sometimes I was busy during the designated time. As a result, even though I took the vast majority of tests within 5-10 minutes of designated time (largest delay: 22 minutes), I did not take PVT exactly on time. It could be argued that I strategically delayed my PVT sessions in order to take the test when I start feeling more alert. Further, I was extremely bored in the last 2 days of taking control measurements and sometimes got distracted and lost in thought, which resulted in me getting 3 and 4 lapses per session (as can be seen on Figure 1). I do not believe that these lapses represent my lack of alertness. Finally, I had to change the timing of last 3 tests on the last treatment day from 22:00, 22:20, 22:40 to 21:00, 21:20, 21:40 because I was going to bed at 22:00 and I did not account for this when writing the protocol (all such changes can be found  here).\n To conclude, I believe that PVT data strongly suggests that I was able to control my level of sleepiness for the duration of the experiment but I don’t think much else can be concluded from it. This interpretation seems to me to be robust, but I welcome any further criticisms that might challenge it.\n  I’m not sure. I don’t think that I have any mutations that make me need less sleep, given that I sleep 7-8 hours normally. I believe that the most plausible explanation is that my cognitive performance was just not affected by chronic loss of sleep that much.\n It seems that there’s very high variation in how people respond to sleep deprivation. For example,  Van Dongen et al. 2004      \r Van Dongen H, Maislin G, Dinges DF. Dealing with inter-individual differences in the temporal dynamics of fatigue and performance: importance and techniques. Aviation, space, and environmental medicine. 2004 Mar 1;75(3):A147-54.\r (a different paper by the same first author) find that:\n As measured by performance lapses on a psychomotor vigilance task (13), some subjects were found to have much greater impairment from sleep loss than others (Fig. 1, left-hand panel). Thus, some subjects seemed to be relatively vulnerable to performance impairment due to sleep loss, while others seemed to be relatively resilient. Interestingly, vulnerable and resilient individuals did not differ significantly in the amount of sleep they felt they needed or routinely obtained, as assured by surveys and daily diaries. This suggests that inter-individual differences in vulnerability to sleep loss are not just determined by differences in sleep need (42).\n Figure 6. Neurobehavioral performance lapses on a psychomotor vigilance task (PVT; left-hand panel) and subjective sleepiness score on the Stanford Sleepiness Scale (SSS; right-hand panel) during 40 h of total sleep deprivation in a laboratory environment (11). Stars show PVT performance lapses and SSS sleepiness scores for the eight subjects most resilient to sleep loss (type 1); dots show the data for the 7 subjects most vulnerable to sleep loss (type 3). Despite the considerable difference in psychomotor performance impairment, there was no statistically significant difference in the profile of sleepiness scores between these two groups. Reprinted from  Van Dongen et al. 2004.\n  My second hypothesis was confirmed. There was no difference in my guzey_arena_0 performance between control and treatment conditions.\n I believe that the quality of my guzey_arena_0 data is high. I took tests in the same environment and was virtually always fully focused on them. Like with PVT, I performed the tests only approximately at the planned time (almost always within 5-10 minutes of the scheduled time). Also like with PVT, I had to change the time I took some of the tests at because I forgot to account for me going to bed earlier in the last 6 days of the experiment (all such changes can be found  here). During one of the treatment sessions I accidentally took 12 samples. I discovered that I miscounted the number of samples I took in that session when I was extracting the data from the video and did not include sample 12 in the data, since the paired sample t-test I use relies on data being matched and my plan was to collect precisely 11 samples in each session. Even when including that sample, the control mean remains non-significantly higher than treatment mean.\n To conclude, I believe that guzey_arena_0 strongly suggests that there was no major cognitive deterioration in the treatment condition. I believe that it provides moderate evidence that there was no moderate cognitive deterioration in the treatment condition. I believe that it is weakly suggestive evidence that there was no cognitive deterioration at all in the treatment condition.\n  In contrast to guzey_arena_0, the SAT has an absolute ceiling (800 on each section), which I know I’m able to approach (at least for the math section), thus creating an implicit control condition and making it immune to the effect of me consciously or unconsciously trying to suppress my control performance. This means that hitting a score in the vicinity of 800 on the math section and somewhere between 700 and 750 on the verbal section is a pretty good evidence of lack of major cognitive deterioration.\n I ended up getting (730,720), (790,740), and (790,750) on (math,verbal) sections of SAT on days 12, 13, and 14 of treatment and getting (710,760), (780,760), and (750,690) on control days. The first low control score on the math section is a result of lack of practice and me running out of time after getting stuck on a question. The last low control score on the verbal section is a result of me becoming very bored with taking the SAT 5 days in a row, getting lost in thought for 10 minutes, and having to rush.\n To conclude, I believe that the SAT data strongly suggests that there was no major or moderate cognitive deterioration in many aspects of my cognition, given that test includes challenging (to me) reading comprehension questions and requires quick mathematical thinking. I believe that it provides barely any evidence regarding minor cognitive deterioration, given that I usually end up having free time at the end of every section, which I use to double check my responses, and minor cognitive deterioration could result in me getting roughly the same score but with less time left.\n  I was fully alert (very roughly) 85% of the time I was awake, moderately sleepy 10% of the time I was awake, and was outright falling asleep 5% of the time. Subjectively, I felt that I gained somewhere between 2 and 3 hours of productive time every day.\n Further, it appears that my sleep debt was not increasing over time. My impression is that during acute sleep deprivation, as one doesn’t sleep for 70+ hours, most stimulation ceases to work, meaning that video games are no longer able to bring one back to full alertness. In contrast to that, I found that I was able to go from “falling asleep” to “fully alert” at all times by playing video games for 15-20 minutes. I ended up playing video games for approximately 30-90 minutes a day.\n Finally, even though I felt no cognitive deterioration and no accumulating sleep debt, maintaining this sleep schedule was incredibly hard. I had to resist regular urges to sleep and on several occasions when I did not want to play video games was very close to failing the experiment, having at one point fallen asleep in my chair and being awakened a few minutes later by my wife. Occasionally, when I tried to see if I could regain full alertness without video games, I would fall into a series of several-seconds-long microsleeps. I do not feel that I would’ve been able to maintain this schedule for these 14 days, had I not committed so hard to it by spending so much time designing it and publicly announcing my experiment.\n  In the evening of day 10 of treatment I had a call with a friend whom I talk to regularly. We spent an hour discussing strengths and weaknesses of several academic papers. For the majority of the conversation I was functioning at the peak of my ability, having to constantly engage with complex arguments and to do a lot of thinking on the fly, which taxed my long-term memory, short-term memory, logical thinking, and speaking ability. After the call I asked that friend if he noticed that I’d been sleeping for 4 hours a night for 10 days. He wrote:\n   My roommate, who knew about my experiment, asked me how long I will continue to sleep for 4 hours a night after I had 2 nights of recovery sleep, meaning that he did not notice any significant changes in my state after I stopped being sleep deprived. I usually talk to him for 30-60 minutes a day.\n   I like being awake and I do not like sleeping. Thus, I was motivated to find the absence of effect of sleep deprivation on cognition. This might have resulted in me trying less hard in the control condition, compared to treatment condition. Unfortunately, I do not know how to blind myself to the amount of sleep I get. I discussed the lack of blinding in the context of this experiment in subsection  SAT.\n  I care about even the smallest changes in my cognitive ability due to sleep deprivation. For example, if the effect-size is “only” 0.1, I still care about it. However, in order to detect such effect in this experiment, I would have had to spend more than 40 hours collecting 1224 pairs of observations for guzey_arena_0.\n The situation would not look much better if I ditched PVT and only performe\n......", "posttime": "2020-05-19 01:42:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,睡眠,cognition", "title": "12~14天每晚4小时睡眠对认知的影响", "title_en": "The Effects on Cognition of Sleeping 4 Hours per Night for 12-14 Days", "transed": 1, "url": "https://guzey.com/science/sleep/14-day-sleep-deprivation-self-experiment/", "via": "", "real_tags": ["认知", "睡眠", "cognition"]}, {"category": "", "categoryclass": "", "imagename": "8c7adb1ae17b415394ffd7e664238229.jpg", "infoid": 1002666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两个氢原子相互靠近的艺术渲染。他们在什么时候触摸？这取决于你所说的触摸是什么意思。公共领域图像，来源：克里斯托弗·S·贝尔德(Christopher S.Baird)。\n答案取决于你所说的触摸是什么意思。在原子水平上，触摸有三种可能的含义：1)两个物体相互影响，2)两个物体相互显著影响，或3)两个物体位于完全相同的位置。请注意，日常的触摸概念(即两个物体的硬边界存在于同一位置)在原子水平上没有意义，因为原子没有硬边界。原子并不是真正的实心球体。它们是模糊的量子概率云，充满电子，散布成波浪形的云状，称为轨道。就像天空中的云一样，原子可以有一个形状和位置，而没有硬边界。这是可能的，因为原子有高密度的区域和低密度的区域。当我们说一个原子坐在A点时，我们真正的意思是原子的概率云的高密度部分位于A点。如果你把一个电子放在盒子里(就像量子点激光器所做的那样)，那么这个电子大部分都在盒子里。电子的波函数的一部分通过盒子的壁泄漏出来，直到无限大。这使得用于扫描隧道显微镜的量子隧道效应成为可能。考虑到原子的非固体性质，让我们来看看触摸的每一种可能的含义。\n1.如果把接触理解为两个原子相互影响，那么原子总是接触的。相距一英里的两个原子的波函数仍然重叠。如果一个原子与另一个原子的中心相距一英里，那么它与另一个原子中心重叠处的波函数的振幅会小得离谱，但不会是零。原则上，两个原子无论在宇宙中的哪个位置都会相互影响，因为它们向四面八方延伸。在实践中，如果两个原子的距离超过几纳米，它们对彼此的影响通常会变得非常小，以至于被更近的原子的影响所掩盖。因此，尽管从技术上讲，相距一英里的两个原子可能是接触的(如果我们将接触定义为原子波函数的重叠)，但这种接触通常是微不足道的，可以忽略不计。\n这是什么感人的东西？在物理世界中，物体相互影响的基本方式只有四种：通过电磁力、通过强核力、通过弱核力、通过引力。构成原子核的中子和质子相互束缚，并通过这两种核力发生反应。组成原子其余部分的电子被电磁力束缚在原子核上。原子被束缚在分子中，分子被电磁力束缚在日常物品中。最后，行星(以及其他大型天文物体)和行星表面的宏观物体由于重力而结合在一起。如果两个原子相距一米，它们就会通过所有四种基本力相互接触。然而，对于典型的原子来说，电磁力往往会凌驾于其他力之上。这种触摸会导致什么呢？如果两个原子相距太远，与周围的其他物体相比，它们的相互作用太弱，不会有任何结果。当两个原子足够接近时，这种相互作用可以导致很多事情。整个化学领域可以归结为研究当原子接近到足以相互影响时发生的所有有趣的事情。如果两个原子是非反应性的，并且不形成共价键、离子键或氢键，那么它们的电磁相互作用通常采用范德瓦力的形式。在范德墙效应中，相互靠近的两个原子在彼此之间产生电偶极矩，然后这些偶极子通过静电吸引而相互弱吸引。虽然根据触摸的定义，地球上的所有原子总是接触到地球上的所有其他原子的说法是严格正确的，但这并不是很有帮助。相反，我们可以任意定义一个包含大部分原子的有效周长，然后说原子的任何部分超出这个周长都不值得注意。这就把我们带到了我们对触摸的下一个定义。\n2.如果触摸意味着两个原子相互影响很大，那么原子确实会接触，但只有当它们足够近的时候。问题是，什么构成了重要的意义是可以解释的。例如，我们可以将原子的外周定义为包含95%原子的数学表面&#3", "note_en": "Artistic rendering of two hydrogen atoms moving close to each other. At what point do they &#34;touch&#34;? It depends on what you mean by touch. Public Domain Image, source: Christopher S. Baird.\n  The answer depends on what you mean by &#34;touch&#34;. There are three possible meanings of touch at the atomic level: 1) two objects influence each other, 2) two objects influence each other significantly, or 3) two objects reside in the exact same location. Note that the everday concept of touch (i.e the hard boundaries of two objects exist at the same location) makes no sense at the atomic level because atoms don&#39;t have hard boundaries. Atoms are not really solid spheres. They are fuzzy quantum probability clouds filled with electrons spread out into waving cloud-like shapes called &#34;orbitals&#34;. Like a cloud in the sky, an atom can have a shape and a location without having a hard boundary. This is possible because the atom has regions of high density and regions of low density. When we say that an atom is sitting at point A, what we really mean is that the high-density portion of the atom&#39;s probability cloud is located at point A. If you put an electron in a box (as is done in quantum dot lasers), that electron is only  mostly in the box. Part of the electron&#39;s wavefunction leaks through the walls of the box and out to infinity. This makes possible the effect of quantum tunneling, which is used in scanning tunneling microscopes. With the non-solid nature of atoms in mind, let us look at each of the possible meanings of touching.\n  1. If &#34;touching&#34; is taken to mean that two atoms influence each other, then atoms are always touching. Two atoms that are held a mile apart still have their wavefunctions overlapping. The amplitude of one atom&#39;s wavefunction at the point where it overlaps with the other atom&#39;s center will be ridiculously small if they are a mile apart, but it will not be zero. In principle, two atoms influence each other no matter where they are in the universe because they extend out in all directions. In practice, if two atoms are more than a few nanometers apart, their influence on each other typically becomes so small that it is overshadowed by the influence of closer atoms. Therefore, although two atoms a mile apart may technically be touching (if we define touching as the overlap of atomic wavefunctions), this touching is typically so insignificant that it can be ignored.\n  What is this &#34;touching&#34;? In the physical world, there are only four fundamental ways for objects to influence each other: through the electromagnetic force, through the strong nuclear force, through the weak nuclear force, and through the force of gravity. Neutrons and protons that make up the nucleus of an atom are bound to each other and undergo reactions via the two nuclear forces. The electrons that make up the rest of the atom are bound to the nucleus by the electromagnetic force. Atoms are bound into molecules, and molecules are bound into everyday objects by the electromagnetic force. Finally, planets (as well as other large astronomical objects) and macroscopic objects on the planet&#39;s surface are bound together by gravity. If two atoms are held a meter apart, they are touching each other through all four fundamental forces. However, for typical atoms, the electromagnetic force tends to dominate over the other forces. What does this touching lead to? If two atoms are too far apart, their interaction is too weak compared to other surrounding bodies to amount to anything. When the two atoms get close enough, this interaction can lead to many things. The entire field of chemistry can be summed up as the study of all the interesting things that happen when atoms get close enough to influence each other electromagnetically. If two atoms are non-reactive and don&#39;t form covalent, ionic, or hydrogen bonds, then their electromagnetic interaction typically takes the form of the Van der Walls force. In the Van der Walls effect, two atoms brought close to each other induce electric dipole moments in each other, and these dipoles then attract each other weakly through electrostatic attraction. While the statement that &#34;all atoms on the planet are always touching all other atoms on the planet&#34; is strictly true according to this definition of touching, it is not very helpful. Instead, we can arbitrarily define an effective perimeter that contains most of the atom, and then say that any part of the atom that takes extends beyond that perimeter is not worth noticing. This takes us to our next definition of touching.\n  2. If &#34;touching&#34; is taken to mean that two atoms influence each other significantly, then atoms do indeed touch, but only when they get close enough. The problem is that what constitutes &#34;significant&#34; is open to interpretation. For instance, we can define the outer perimeter of an atom as the mathematical surface that contains 95% of the atom&#39;s electron mass. As should be obvious at this point, a perimeter that contains 100% of the atom would be larger than the earth. With 95% of the atom&#39;s electron probability density contained in this mathematical surface, we could say that atoms do not touch until their 95% regions begin to overlap. Another way to assign an effective edge to an atom is to say it exists halfway between two atoms that are covalently bonded. For instance, two hydrogen atoms that are covalently bonded to each other to form an H 2 molecule have their centers separated by 50 picometers. They can be thought of as &#34;touching&#34; at this separation. In this approach, atoms touch whenever they are close enough to potentially form a chemical bond.\n  3. If &#34;touching&#34; is taken to mean that two atoms reside in the exact same location, then two atoms never touch at room temperature because of the Pauli exclusion principle. The Pauli exclusion principle is what keeps all the atoms in our body from collapsing into one point. Interestingly, at very low temperatures, certain atoms can be coaxed into the exact same location. The result is known as a Bose-Einstein condensate.\n  Again, atoms never touch in the everyday sense of the word for the simple reason that they don&#39;t have hard boundaries. But in every other sense of the word &#34;touch&#34; that has meaning at the atomic level, atoms certainly touch.", "posttime": "2020-05-19 01:41:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原子,atoms", "title": "原子曾经接触过彼此吗？(2013)", "title_en": "Do atoms ever touch each other? (2013)", "transed": 1, "url": "https://wtamu.edu/~cbaird/sq/2013/04/16/do-atoms-ever-actually-touch-each-other/", "via": "", "real_tags": ["原子", "atoms"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "手机定位数据显示，反封锁抗议活动的示威者-其中一些与C Ovid-19案件有关-经常长途跋涉数百英里前往活动现场，返回各自州的各个地方，甚至越境进入邻近的州。这些数据是由进步运动组织保护医疗保险委员会(Committee To Protect Medicare)提供给《卫报》(The Guardian)的，它提出了这样一种可能性，即抗议活动将在将冠状病毒疫情传播到迄今感染相对较少的地区方面发挥作用。匿名位置数据是从选择加入的手机应用程序中获取的，VoteMap公司的数据科学家利用它来确定参加4月底和5月初抗议活动的设备的移动情况，这五个州分别是密歇根州、威斯康星州、伊利诺伊州、科罗拉多州和佛罗里达州。\n然后，他们创建了可视化图像，跟踪这些设备在抗议活动结束后长达48小时的移动。可视化仅显示州内的移动，这是由于分析师在创建它们时所做的查询。但VoteMap的执行副总裁、数据科学家杰里米·费尔表示，在潜在的原始数据中，许多被视为到达州边界的设备都会继续穿过这些设备。一项可视化显示，在密歇根州兰辛市，在4月30日的抗议活动中，武装抗议者冲进国会大厦，州警察被迫封锁州长格雷琴·惠特默(Gretchen Whitmer)的通道，可以看到抗议现场出现的设备正在返回该州所有地区，从底特律到该州北部的偏远城镇。数据中可以看到的一个设备往返于距离首都超过180英里的阿夫顿。其他人到达了印第安纳州的边界，一些人越过了印第安纳州的边界。在4月19日丹佛“格栅行动”抗议之后的48小时内，设备到达了邻近州的边界，包括怀俄明州、内布拉斯加州、俄克拉何马州、新墨西哥州和犹他州。4月18日，在佛罗里达州，设备返回到半岛所有地区，并一直延伸到佐治亚州边境。4月24日，在威斯康星州，设备又回到了格林湾和沃索等较小的城镇，以及明尼苏达州和伊利诺伊州的边界。\n继4月份的第一波反封锁抗议活动之后，流行病学家警告说，这些抗议活动可能会导致新的病例激增。4月下旬，在北卡罗来纳州，该州反封锁抗议活动的一名领导人的冠状病毒检测呈阳性，但她表示将参加未来的集会。\n保护医疗保险委员会(Committee To Protect Medicare)执行主任罗布·戴维森(Rob Davidson)博士表示，尽管“很难在设备、参加抗议的个人和病例之间划清界限”，但数据表明，抗议活动可能是重大的流行病事件。“我们在抗议活动中看到的行为具有很高的感染风险。我们可以看到抗议者从一个高度集中的活动开始，然后广泛分散，“他补充说。戴维森以民主党人的身份竞选国会议员，他说，他和他的倡导团体目前都没有与民主党有关联。该组织由300多名“医生组成，他们担心他们病人的医疗保健已经变得负担不起”。在推特上广泛分享的一系列视频和帖子中，戴维森批评了特朗普，并试图消除他所说的“对公共卫生的不信任”，这种不信任是“唐纳德·特朗普在他的运动中煽动的”。", "note_en": "Cellphone location data suggests that demonstrators at anti-lockdown protests –  some of which have been connected with C ovid-19 cases – are often traveling hundreds of miles to events, returning to all parts of their states, and even crossing into neighboring ones.   The data, provided to the Guardian by the progressive campaign group the Committee to Protect Medicare, raises the prospect that the protests will play a role in spreading the coronavirus epidemic to areas which have, so far, experienced relatively few infections.   The anonymized location data was captured from opt-in cellphone apps, and data scientists at the firm VoteMap used it to determine the movements of devices present at protests in late April and early May in five states: Michigan, Wisconsin, Illinois, Colorado and Florida.\n  They then created visualizations that tracked the movements of those devices up to 48 hours after the conclusion of protests. The visualizations only show movements within states, due to the queries analysts made in creating them. But the data scientist Jeremy Fair, executive-vice president of VoteMap, says that many of the devices that are seen to reach state borders are seen to continue across them in the underlying raw data.   One visualization shows that in Lansing, Michigan, after a 30 April protest in which  armed protesters stormed the capit ol building and state police were forced to physically block access to Governor Gretchen Whitmer, devices which had been present at the protest site can be seen returning to all parts of the state, from Detroit to remote towns in the state’s north.  One device visible in the data traveled to and from Afton, which is over 180 miles from the capital. Others reached, and some crossed, the Indiana border.   In the 48 hours following a 19 April “Operation Gridlock” protest in Denver, devices reached the borders of neighboring states including Wyoming, Nebraska, Oklahoma, New Mexico and Utah.   In Florida on 18 April, devices returned to all parts of the peninsula and up to the Georgia border. In Wisconsin on 24 April, devices returned to smaller towns like Green Bay and Wausau, and the borders of Minnesota and Illinois.\n  Following the initial wave of anti-lockdown protests in April, epidemiologists  warned that they could lead to a new surge in cases.   In North Carolina in late April, one of the leaders of the state’s anti-lockdown protests  tested positive for Covid-19 but said she would attend future rallies.\n Dr Rob Davidson, executive director of the Committee to Protect Medicare, said that although “it’s hard to draw a straight line between devices, individuals at these protests, and cases”, the data suggests that the protests may be epidemiologically significant events.  “The behavior we’re seeing at protests carries a high risk of infection. We can see protesters are going from a highly concentrated event and then dispersing widely,” he added.   Davidson, who has run for Congress as a Democrat, said that neither he nor his advocacy group were currently affiliated with the Democratic party. The group is made up of more than 300 “doctors who are concerned that the healthcare for their patients has become unaffordable”.   In a series of widely shared videos and  threads on Twitter, Davidson has criticized Trump, and attempted to dispel what he calls the “distrust in public health” which “Donald Trump has fomented in his movement”.", "posttime": "2020-05-19 01:41:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,病毒,数据,protests,设备", "title": "手机数据显示，美国封锁抗议活动可能广泛传播了病毒", "title_en": "US lockdown protests may have spread virus widely, cellphone data suggests", "transed": 1, "url": "https://www.theguardian.com/us-news/2020/may/18/lockdown-protests-spread-coronavirus-cellphone-data", "via": "", "real_tags": ["手机", "病毒", "数据", "protests", "设备"]}, {"category": "", "categoryclass": "", "imagename": "67b7a85eaa8b05887a33b151c8d7f9f2.png", "infoid": 1002664, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我阅读关于JavaScript承诺的MDN文档时，我意识到Promise.all和Promise.allSetted之间的区别并不是一目了然的。来自上面链接的文档：承诺是在创建承诺时不一定知道的值的代理。它允许您将处理程序与异步操作的最终成功值或失败原因相关联。\n承诺处于以下状态之一：待定：初始状态，既不履行也不拒绝。已完成：表示操作成功完成。Rejected：表示操作失败。\n您可以像这样实例化承诺：TLDR；Promise.all如果任何一个承诺无法解析，都将立即拒绝，而Promise.allSetted将等待所有承诺的完成。向Promise.all()传递一个可迭代(通常是由其他承诺组成的数组)，并尝试解析所有承诺。如果这些承诺中的任何一个抛出例外或拒绝，Promise.all将立即调用其拒绝。您应该始终使用try/catch或.catch()将Promise.all()括起来。const promiseFunction=Async()=&gt；{const ResolvingPromise=new Promise(Resolve=&gt；setTimeout(()=&gt；Resolve(&#39；Success&39；)，1000))；Const RejectingPromise=New Promise((Resolve，Reject)=&gt；setTimeout(()=&gt；Reject(&#39；setTimeout(&#39；Fail&39；)，500))；尝试{const。all([ResolvingPromise，RejectingPromise])；}catch(E){//e是&#39；FAIL&39；，这是来自RejectingPromise//ResolvingPromise=Promise{&lt；Pending&&gt;；}控制台的Reject函数的内容。log(E)；}}；promiseFunction()；\n在上面的代码片段中，当调用console.log(E)时，Resolution vingPromise的状态仍然是挂起。catch语句中调用的代码在promiseFunction调用后大约500ms运行-因为rejectingPromise在500ms之后拒绝。const promisvingFunction=Async()=&gt；{const ResolvingPromise=new Promise(Resolve=&gt；setTimeout(()=&gt；Resolve(&#39；Success&39；)，1000))；Const ResolvingPromiseTwo=New Promise((Resolve，Reject)=&gt；setTimeout(()=&gt；Resolve(&#39；SuccessTwo&39；)，500)。all([ResolvingPromise，ResolvingPromiseTwo])；Console。log(AllPromises)；//allPromises=[&#39；SUCCESS&#39；，&#39；SUCCESS TWO&#39；]}catch(E){//控制台从不执行此代码块。log(E)；}}；promiseFunction()；\nPromise.All在调用后解析1000ms-ResolvingPromiseTwo在500ms后解析，ResvingPromise在1s后解析，这完成了所有承诺，这允许Promise.All承诺解析。Promise.all()返回一个数组，其中包含传递给它的每个承诺的解析值，按照它们被传递的顺序。在上面的例子中，它是一个字符串数组=[&#39；SUCCESS&#39；，&#39；SUCCESS TWO&#39；]。还会向Promise.allSetted()传递一个可迭代(通常是由其他承诺组成的数组)，并将尝试解析所有承诺。如果这些承诺中的任何一个抛出例外或拒绝，则其状态设置为拒绝。一个重要的注意事项是Promise.allSetted永远不会抛出。您不需要用try/catch包装它-它总是会解决的。const promiseFunction=Async()=&gt；{const ResolvingPromise=new Promise(Resolve=&gt；setTimeout(()=&gt；Resolve(&#39；Success&39；)，1000))；Const RejectingPromise=New Promise((Resolve，Reject)=&gt；setTimeout(()=&gt；Reject(&#39；setTimeout(&#39；Fail&39；)，500))；尝试{const。allSetted([ResolvingPromise，RejectingPromise])；控制台。log(AllPromises)；//allPromises//[//{状态：&#34；已完成&#34；，值：&#39；成功&#39；}，//{状态：&#34；拒绝&#34；，原因：&#39；失败&#39；}//]}catch(E){//此代码块从未在控制台执行。log(E)；}}；promiseFunction()；\nPromise.allSetted在1秒后解析-它等待所有承诺，而不管它们的状态如何，或者它们是否拒绝。然后，它返回一个对象数组。这取决于打电话的人检查每个承诺是兑现还是被拒绝。如果它已完成，则对象的值将包含已解析的内容。如果状态为Rejected，它将包含一个名为Reason的键，即抛出或拒绝的内容。Promise中还有另一个利益函数，称为Promise.race。Promise.race()方法返回一个承诺，该承诺在可迭代中的一个承诺实现或拒绝时立即实现或拒绝，并带有来自该承诺的值或原因。1个。\nconst promiseFunction=Async()=&gt；{const ResolvingPromise=New Promise(Resolve=&gt；setTimeout(()=&gt；Resolve(&#39；Success&#39；)，1000))；Const ResolvingPromiseTwo=New Promise((Resolve，Reject)=&gt；setTimeout(()=&", "note_en": "I was  reading the MDN docs on JavaScript promises and realized that the difference between  Promise.all and  Promise.allSettled wasn’t immediately obvious.  From the docs linked above: A  Promise is a proxy for a value not necessarily known when the promise is created. It allows you to associate handlers with an asynchronous action’s eventual success value or failure reason.\n A Promise is in one of these states:   pending: initial state, neither fulfilled nor rejected.   fulfilled: meaning that the operation completed successfully.   rejected: meaning that the operation failed.\n You can instantiate a promise like so:   tldr;  Promise.all will immediately reject if any of the promises fail to resolve, wherease  Promise.allSettled will await the completion of all promises.  Promise.all() is passed an iterable (usually an array of other promises) and will attempt to resolve all of them. If any of these promises throws an exception or  rejects,  Promise.all will immediateley invoke its  reject. You should always surround  Promise.all() with a  try/catch or a  .catch(). const  promiseFunction  =  async  ()  =&gt;  {  const  resolvingPromise  =  new  Promise ( resolve  =&gt;  setTimeout (()  =&gt;  resolve ( &#39; success &#39; ),  1000 ));  const  rejectingPromise  =  new  Promise (( resolve ,  reject )  =&gt;  setTimeout (()  =&gt;  reject ( &#39; fail &#39; ),  500 ));  try  {  const  allPromises  =  await  Promise . all ([ resolvingPromise ,  rejectingPromise ]);  }  catch  ( e )  { \t // e is &#39;fail&#39;, which is the contents of the reject function from rejectingPromise  // resolvingPromise = Promise {&lt;pending&gt;}  console . log ( e );  } }; promiseFunction ();\n In the above code snippet, when  console.log(e) is called, the status of  resolvingPromise will still be pending. The code invoked in the catch statement is run roughly  500ms after the  promiseFunction invocation - since  rejectingPromise rejects after 500ms. const  promiseFunction  =  async  ()  =&gt;  {  const  resolvingPromise  =  new  Promise ( resolve  =&gt;  setTimeout (()  =&gt;  resolve ( &#39; success &#39; ),  1000 ));  const  resolvingPromiseTwo  =  new  Promise (( resolve ,  reject )  =&gt;  setTimeout (()  =&gt;  resolve ( &#39; successTwo &#39; ),  500 ));  try  {  const  allPromises  =  await  Promise . all ([ resolvingPromise ,  resolvingPromiseTwo ]);  console . log ( allPromises );  // allPromises = [&#39;success&#39;, &#39;successTwo&#39;]  }  catch  ( e )  {  // this code block is never executed  console . log ( e );  } }; promiseFunction ();\n The  Promise.all resolves 1000ms after invocation -  resolvingPromiseTwo resolves after 500ms, and  resolvingPromise resolves after 1s, which completes all the promises, which allows the  Promise.all promise to resolve.  Promise.all() returns an array with the resolved value of each of the Promises passed to it, in the order in which they are passed. In the above case, it is an array of strings =  [&#39;success&#39;, &#39;successTwo&#39;].  Promise.allSettled() is also passed an iterable (usually an array of other promises) and will attempt to resolve all of them. If any of these promises throws an exception or  rejects, its status is set to  rejected. An important note is that  Promise.allSettled  can never throw. You do not need to wrap it with  try/catch - it will always resolve. const  promiseFunction  =  async  ()  =&gt;  {  const  resolvingPromise  =  new  Promise ( resolve  =&gt;  setTimeout (()  =&gt;  resolve ( &#39; success &#39; ),  1000 ));  const  rejectingPromise  =  new  Promise (( resolve ,  reject )  =&gt;  setTimeout (()  =&gt;  reject ( &#39; fail &#39; ),  500 ));  try  {  const  allPromises  =  await  Promise . allSettled ([ resolvingPromise ,  rejectingPromise ]);  console . log ( allPromises );  // allPromises  // [  // {status: &#34;fulfilled&#34;, value: &#39;success&#39;},  // {status: &#34;rejected&#34;, reason: &#39;fail&#39;}  // ]  }  catch  ( e )  {  // this code block is never executed  console . log ( e );  } }; promiseFunction ();\n Promise.allSettled resolves after 1s - it awaits all the promises, regardless of their status or if they  reject. It then returns an array of objects. It’s up to the caller to check if each promise  fulfilled or  rejected. If it  fulfilled, the  value of the object will be contain what was  resolved. If the status is  rejected, it will contain a key called  reason, which is what was thrown or  rejected.  There is also another interest function in  Promise called  Promise.race. The  Promise.race() method returns a promise that fulfills or rejects as soon as one of the promises in an iterable fulfills or rejects, with the value or reason from that promise.   1\n const  promiseFunction  =  async  ()  =&gt;  {  const  resolvingPromise  =  new  Promise ( resolve  =&gt;  setTimeout (()  =&gt;  resolve ( &#39; success &#39; ),  1000 ));  const  resolvingPromiseTwo  =  new  Promise (( resolve ,  reject )  =&gt;  setTimeout (()  =&gt;  resolve ( &#39; successTwo &#39; ),  500 ));  try  {  const  racedPromises  =  await  Promise . race ([ resolvingPromise ,  resolvingPromiseTwo ]);  console . log ( racedPromises );  // both promises would&#39;ve resolved, but resolvingPromiseTwo was faster, so racedPromises = &#39;successTwo&#39;`  }  catch  ( e )  {  // this code block is only executed if the first promise to settle rejects/throws  console . log ( e );  } }; promiseFunction ();\n In the above,  console.log(racedPromises) is called 500ms after invocation - both promises would’ve resolved, but  resolvingPromiseTwo was faster, and it is what  Promise.race resolves with. This is pretty specific behavior - most of the time this is probably  not what you want, but it’s pretty neat!", "posttime": "2020-05-19 01:02:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,承诺", "title": "JavaScript Promise.all与Promise.allSetted", "title_en": "JavaScript Promise.all vs. Promise.allSettled", "transed": 1, "url": "https://blog.jonlu.ca/posts/promises?ref=hnm18", "via": "", "real_tags": ["java", "承诺"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002663, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的一个项目中，我不得不研究检测rootkit的方法，以及捕捉它们的最有效措施。当我问到这个问题时，我问到，rootkit的现有解决方案是什么，它们是如何工作的？我的搜索最终让我找到了TrendMicro RootkitBuster，它将自己描述为“一个扫描隐藏文件、注册表项、进程、驱动程序和主引导记录(MBR)以识别和删除rootkit的免费工具”。\n它吹嘘的特点肯定引起了我的注意。他们声称检测到了几种Rootkit用来将自己钻进机器的技术，但它是如何在引擎盖下工作的，我们会滥用它吗？我决定通过逆向工程找出应用程序本身的核心组件，这至少可以说是把我带入了一个永远给我留下伤疤的兔子洞代码洞中。\n开始冒险时，启动应用程序会收到Process Hacker发出的奇妙警告，称已经安装了新的驱动程序。\n我们已经有了一个良好的开端，我们得到了一份趋势科技的“共同驱动程序”，这绝对是值得研究的东西。除了该驱动程序正在安装之外，这个友好的窗口也打开了，提示我接受趋势科技的用户协议。\n我现在还没有心情把自己的灵魂交给魔鬼，特别是因为条款中包含了一个条款，声明“您同意不尝试对…进行反向工程、反编译、修改、翻译、反汇编、发现源代码或创建派生作品。“。\n值得庆幸的是，在我接受任何条款之前，趋势科技已经在我的机器上部署了他们的软件。有趣的是，当我试图通过右键单击应用程序并按下“关闭窗口”来退出该过程时，它完全避开了许可协议，转到扫描仪的主屏幕，尽管我选择了“我不接受许可协议的条款”选项。谢谢趋势科技！\n当我启动应用程序时，我注意到一个快速的命令提示符闪烁。事实证明，这是一个7-Zip自解压二进制文件的结果，它将其余的应用程序组件解压到%temp%\\RootkitBuster。\nTmcomm驱动程序，标签为“TrendMicro Common Module”和“Trend Micro Eyes”。快速浏览该驱动程序表明，它接受了来自特权用户模式应用程序的通信，并执行了非特定于rootkit Remover本身的常见操作。该驱动程序不仅在Rootkit Buster中使用，而且在趋势科技的整个产品线中都有实施。\n在接下来的部分中，我们将深入研究tmcomm驱动程序。我们将把研究重点放在寻找滥用驱动程序功能的不同方法上，最终目标是能够执行内核代码。我决定不检查tmrkb.sys，因为虽然我确定它是易受攻击的，但它似乎只用于rootkit Buster。\n让我们从基本驱动程序开始我们的冒险之旅，它似乎不仅用于这个rootkit Remover实用程序，而且还用于其他几个趋势科技产品。正如我在上一节中所说的，非常简单地浏览一下驱动程序就会发现，它确实允许来自特权用户模式应用程序的通信。\n驱动程序采取的第一个操作之一是创建一个设备来接受来自用户模式的IOCTL通信。驱动程序在路径\\Device\\TmComm创建一个设备，并在\\DosDevices\\TmComm(可通过\\\\.\\global\\TmComm访问)创建指向该设备的符号链接。驱动程序入口点初始化了在整个驱动程序中使用的大量类和结构，但是，出于我们的目的，没有必要涵盖每个类和结构。\n我很高兴看到趋势科技做出了正确的决定，将他们的设备限制为系统用户和管理员。这意味着，即使我们确实发现了可利用的代码，因为任何通信都至少需要管理权限，所以业界中有相当大一部分人不会认为它是一个漏洞。例如，Microsoft本身并不将管理员到内核视为安全边界，因为他们获得了大量的访问权限。然而，这并不意味着趋势科技驱动程序中的可利用代码将毫无用处。\n驱动程序的一个很大的组件是它的“TrueApi”类，它在驱动程序的入口点期间实例化。该类包含指向在整个驱动程序中使用的导入函数的指针。下面是一个颠倒的结构：\nstruct TrueApi{Byte Initialized；PVOID ZwQuerySystemInformation；PVOID ZwCreateFile；PVOID unk1；//初始化为NULL。PVOID ZwQueryDirectoryFile；PVOID ZwClose；PVOID ZwOpenDirectoryObjectWrapper；PVOID ZwQueryDirectoryObject；PVOID ZwDuplicateObject；PVOID unk2；//初始化为NULL。PVOID ZwOpenKey；PVOID ZwEnumerateKey；PVOID ZwEnumerateValueKey；PVOID ZwCreateKey；PVOID ZwQueryValueKey；PVOID ZwQueryKey；PVOID ZwDeleteKey；PVOID ZwTerminateProcess；PVOID ZwOpenProcess；PVOID ZwSetValueKey；PVOID ZwDeleteValueKey。PVOID ZwQuerySecurityObject；PVOID unk3；//初始化为空PVOID unk4；//初始化为空PVOID ZwSetSecurityObject；}；\n查看代码，TrueApi主要用作直接调用函数的替代方法。我有根据的猜测是，趋势科技在初始化时缓存这些导入的函数，以避免延迟的IAT挂钩。但是，由于TrueApi是通过查看导入表来解析的，因此如果存在在驱动程序加载时挂钩IAT的rootkit，则此机制是无用的。\n与TrueApi类似，XrayApi是驱动程序中的另一个主要类。此类用于访问多个低级设备，并直接与文件系统交互。XrayConfig的一个主要组件是它的“config”。以下是表示配置数据的部分反向工程结构：\nstruct XrayConfigData{WORD SIZE；CHAR PAD1[2]；DWORD SystemBuildNumber；DWORD UnkOffset1；DWORD UnkOffset2；DWORD UnkOffset3；Char Pad2[4]；PVOID NotificationEntryIdentifier；PVOID NtoskrnlBase；PVOID IopRootDeviceNode；PVOID PpDevNodeLockTree；PVOID ExInitial.。\n配置数据存储Windows内核中内部/未记录变量的位置，如IopRootDeviceNode、PpDevNodeLockTree、ExInitializeNPagedLookasideListInternal和ExDeleteNPagedLookasideList。我猜测这门课的目的是直接访问低级设备，而不是使用可能被劫持的有文档记录的方法。\n在我们进入驱动程序允许我们做什么之前，我们需要了解IOCTL请求是如何处理的。\n在主调度函数中，Trend Micro驱动程序将IRP_MJ_DEVICE_CONTROL请求中的数据转换为我称为TmIoctlRequest的专有结构。\nTrend Micro组织IOCTL请求调度的方式是有几个“调度表”。“基本调度表”简单地包含IOCTL代码和相应的“子调度功能”。例如，当您发送代码为0xDEADBEEF的IOCTL请求时，它将比较此基本调度表的每个条目，如果存在具有匹配代码的表条目，则传递数据。基表条目可以由以下结构表示：\n在调用DispatchFunction之后，它通常会验证所提供的一些数据，范围从基本的nullptr检查到检查输入和输出缓冲区的大小。然后，这些“子分派函数”根据用户输入缓冲区中传递的代码进行另一次查找，以找到相应的“子表条目”。子表条目可以用下面的结构表示：\n在调用实际执行所请求操作的PrimaryRoutine之前，子调度函数调用ValidatorRoutine。此例程在输入缓冲区上执行“特定于操作”的验证，这意味着它对PrimaryRoutine将使用的数据执行检查。只有当ValidatorRoutine成功返回时，才会调用PrimaryRoutine。\n现在我们已经基本了解了IOCTL请求是如何处理的，让我们来看看它们允许我们做什么。回顾存储“子调度函数”的“基本调度表”的定义，让我们研究一下每个基表条目，并找出每个子调度表允许我们做什么！\n第一个分派表似乎与文件系统交互，但这实际上意味着什么？首先，“子调度表”条目的代码是通过从输入缓冲区的起始处取消引用DWORD来获得的。这意味着要指定要执行哪个子分派条目，只需在输入缓冲区的底部设置一个DWORD，使其与条目的**OperationCode**相对应。\n为了让我们的生活更轻松，趋势科技方便地包括了大量的调试字符串，通常可以让我们了解函数的作用。下面是我在此子调度表中颠倒的功能以及它们允许我们执行的操作。\n此调度表主要用于控制驱动程序的进程扫描功能。此子调度表中的许多函数使用单独的扫描线程，通过各种方法(有记录的和未记录的)同步搜索进程。\n如果系统“受支持”，则返回TRUE(无论它们是否具有用于您的构建的硬编码偏移量)。\n这些IOCTL围绕着一些我称之为“微任务”和“微扫描”的结构。以下是反向工程构建的结构：\nstruct MicroTaskVtable{PVOID构造器；PVOID新节点；PVOID删除节点；PVOID插入；PVOID插入之后；PVOID插入之前；PVOID第一个；PVOID下一个；PVOID移除；PVOID RemoveHead；PVOID RemoveTail；PVOID unk2；PVOID IsEmpty；}；struct MicroTask{MicroTaskVtable*vtable；PVOPVOID self2；//ptr自身。DWORD_PTR unk1；PVOID内存分配器；PVOID CurrentListItem；PVOID PreviousListItem；DWORD ListSize；DWORD unk4；//初始化为NULL。字符列表名称[50]；}；struct MicroScanVtable{PVOID Constructor；PVOID GetTask；}；struct MicroScan{MicroScanVtable*vtable；DWORD Tag；//Always&#39；PANS&#39；。字符PAD1[4]；DWORD64任务大小；微任务任务[4]；}；\n对于此子调度表中的大多数IOCTL，驱动程序填充的客户端传入一个MicroScan。在下一节中，我们将研究如何滥用这种信任。\n当我最初对此子调度表中的函数进行反向工程时，我非常困惑，因为代码“看起来不正确”。它看起来像是客户端将GetProcessesAllMethods等函数返回的MicroScan内核指针直接传递给DeleteTaskResults等其他函数。然后，这些函数将采用这个不受信任的内核指针，并且在类的基础上指定的虚拟函数表中几乎没有验证调用函数。\n查看DeleteTaskResults子分派表条目的“验证例程”，在输入缓冲区+0x10处指定的MicroScan实例上执行的唯一验证是确保它是有效的内核地址。\n除了确保提供的指针在内核内存中之外，唯一的其他检查是在DeleteTaskResults中进行简单检查，以确保MicroScan的标记成员是PANS。\n由于DeleteTaskResults调用在MicroScan实例的虚拟函数表中指定的构造函数，要调用任意内核函数，我们需要：\n能够分配至少10字节的内核内存(用于vtable和tag)。\n控制分配的内核内存来设置虚拟函数表指针和标签。\n幸运的是，当涉及到从用户模式分配和控制内核内存时，我的一位导师Alex Ionescu能够为我指明正确的方向。2010年的一份HackInTheBox杂志上有一篇由Matthew Jurczyk撰写的名为“在Windows7中保留对象”的文章。本文讨论了使用Windows7中引入的APC保留对象从用户模式分配可控内核内存。总体思路是，您可以使用ApcRoutine和ApcArgumentX成员作为内核内存中所需的数据将APC排队到APC保留对象，然后使用NtQuerySystemInformation在内核内存中查找APC保留对象。此保留对象将在一行中包含以前指定的KAPC变量，从而允许用户模式应用程序控制多达32字节的内核内存(在64位上)，并知道内核内存的位置。如果您想了解更多，我强烈建议您阅读这篇文章。\n这个技巧在Windows10中仍然有效，这意味着我们能够满足所有三个要求。通过使用APC保留对象，我们可以为MicroScan结构分配至少10个字节，并完全绕过不充分的检查。结果是什么呢？调用任意内核指针的能力：\n虽然我在DeleteTaskResults中提供了一个易受攻击的代码的具体示例，但我在表中用星号标记的任何函数都是易受攻击的。它们都信任不受信任的客户端指定的内核指针，并最终调用MicroScan实例的虚拟函数表中的函数。\n当我在调试字符串中看到它的名称时，这个函数引起了我的注意。使用此子调度表函数，不受信任的客户端可以注册多达16个在卸载驱动程序时调用的任意“卸载例程”。此函数的验证器例程检查来自不可信客户端缓冲区的该指针的有效性。如果调用方来自用户模式，则验证器对不受信任的指针调用ProbeForRead。如果调用方来自内核模式，则验证器将检查它是否为有效的内核内存地址。\n此函数不能立即用于用户模式下的利用漏洞攻击。问题是，如果我们是用户模式调用者，则必须提供用户模式指针，因为验证器例程使用ProbeForRead。当驱动程序卸载时，将调用此用户模式指针，但由于SMEP等缓解措施，它不会做太多事情。我将在后面的小节中引用此函数，但是看到一个不可信的用户模式客户端能够指示驱动程序调用任意指针的设计真的很可怕。\n此子调度表用于与XrayApi交互。虽然Xray Api通常由内核中实现的扫描使用，但此子调度表为客户端与物理驱动器交互提供了有限的访问权限。\n最后的子分派用于扫描各种系统结构中的挂钩。看到Trend Micro检查在对象类型、主要函数表甚至函数内联挂钩中包括挂钩的各种挂钩是很有趣的。\n是的，TMXMSCheckSystemObjectByName2就像听起来那么糟糕。在直接查看函数之前，下面是后面使用的几个反向工程结构：\nstruct CheckSystemObjectParams{PVOID Src；PVOID DST；DWORD Size；DWORD*Outsize；}；struct TXMSParams{DWORD OutStatus；DWORD HandlerID；Char unk[0x38]；CheckSystemObjectParams*CheckParams；}；\nTMXMSCheckSystemObjectByName2接受源指针、目标指针和字节大小。为TMXMSCheckSystemObjectByName2调用的验证器函数检查以下内容：\n本质上，这意味着我们需要传递一个有效的CheckParams结构，并且我们传递的DST指针位于用户模式内存中。现在让我们看一下函数本身：\n尽管for循环看起来可能很可怕，但它所做的只是检查一系列内核内存的优化方法。对于Src到Src+Size范围内的每个内存页，该函数调用MmIsAddressValid。真正可怕的部分是以下操作：\n这些行采用不受信任的Src指针，并将大小字节复制到不受信任的dst指针…。哎呀。我们可以使用memmove操作来读取任意内核指针，但是写入任意内核指针又如何呢？问题是TMXMSCheckSystemObjectByName2的验证器要求目标是用户模式内存。幸运的是，代码中还有另一个错误。\n下一行*params-&gt；outsize=size；从我们的结构中获取size成员，并将其放在由不受信任的outsize成员指定的指针处。没有对特大号指向什么进行验证，因此我们可以在每个IOCTL调用中最多编写一个DWORD。需要注意的是，Src指针需要指向最大字节大小的有效内核内存。为了满足这个要求，我刚刚传递了ntoskrnl模块的基础作为源。\n使用这个任意的写原语，我们可以使用前面找到的卸载例程技巧来执行代码。尽管如果我们从用户模式调用，验证器例程会阻止我们传入内核指针，但我们实际上不需要通过验证器。相反，我们可以使用WRITE原语写入驱动程序的.Data部分内的卸载例程数组，并放置所需的指针。\n通常情况下，我喜欢在我的博客文章中坚持严格的安全性，但这个驱动程序让我打破了这个传统。在本节中，我们不会讨论驱动程序的安全问题，而是全球数百万趋势科技客户使用的可怕代码。\n让我们来看看这里发生了什么。该函数有一个从0到0x10000的for循环，递增4，并检索当前索引后面的进程对象(如果有)。如果索引确实与某个进程匹配，则该函数检查该进程的名称是否为csrss.exe。如果进程名为csrss.exe，则最终检查该进程的会话ID是否为0。来吧，伙计们，确实有记录在案的api可以枚举内核…中的进程。暴力有什么意义？\n当我第一次看到这段代码时，我不确定我看到的是什么。该函数接受当前进程(恰好是系统进程)，因为这是在系统线程中调用的，然后它在第一个0x1000字节中搜索字符串“system”。现在发生的是…。Trend Micro通过在其EPROCESS结构中查找系统进程的已知名称，对EPROCESS结构的ImageFileName成员进行暴力攻击。如果需要进程的ImageFileName，只需使用带有ProcessImageFileName类…的ZwQueryInformationProcess。\n在此函数中，Trend Micro使用csrss进程的PID来暴力强制EPROCESS结构的PEB成员。该函数使用PsLookupProcessByProcessId检索csrss进程的EPROCESS对象，并使用ZwQueryInformationProcess检索PebBaseAddress。使用这些指针，它会尝试与已知PEB指针匹配的从0到0x2000的每个偏移量。如果您只能使用ZwQueryInformationProcess，就像您已经使用…一样，那么查找PEB成员的偏移量又有什么意义呢\n在这里，Trend Micro使用具有已知起始地址的当前系统线程来暴力强制ETHREAD结构的StartAddress成员。不需要查找原始偏移量的另一种情况。ZwQueryInformationThread有一个半文档化的类，名为ThreadQuerySetWin32StartAddress，它为您提供线程的起始地址。\n当我最初反编译此函数时，我认为IDA Pro可能会简化Memset操作，因为此函数所做的一切就是将所有TrueApi结构成员设置为零。我决定带上。\n..", "note_en": "For a recent project, I had to do research into methods rootkits are detected and the most effective measures to catch them when I asked the question, what are some existing solutions to rootkits and how do they function? My search eventually landed me on the  TrendMicro RootkitBuster which describes itself as “A free tool that scans hidden files, registry entries, processes, drivers, and the master boot record (MBR) to identify and remove rootkits”.\n The features it boasted certainly caught my attention. They were claiming to detect several techniques rootkits use to burrow themselves into a machine, but how does it work under the hood and can we abuse it? I decided to find out by reverse engineering core components of the application itself, leading me down a rabbit hole of code that scarred me permanently, to say the least.\n  Starting the adventure, launching the application resulted in a fancy warning by  Process Hacker that a new driver had been installed.\n  Already off to a good start, we got a copy of Trend Micro’s “common driver”, this was definitely something to look into. Besides this driver being installed, this friendly window opened prompting me to accept Trend Micro’s user agreement.\n  I wasn’t in the mood to sign away my soul to the devil just yet, especially since the terms included a clause stating  “You agree not to attempt to reverse engineer, decompile, modify, translate, disassemble, discover the source code of, or create derivative works from…“.\n Thankfully, Trend Micro already deployed their software on to my machine before I accepted any terms. Funnily enough, when I tried to exit the process by right-clicking on the application and pressing “Close Window”, it completely evaded the license agreement and went to the main screen of the scanner, even though I had selected the “I do not accept the terms of the license agreement” option. Thanks Trend Micro!\n  I noticed a quick command prompt flash when I started the application. It turns out this was the result of a 7-Zip Self Extracting binary which extracted the rest of the application components to  %TEMP%\\RootkitBuster.\n   The  tmcomm driver which was labeled as the “TrendMicro Common Module” and “Trend Micro Eyes”. A quick overlook of the driver indicated that it accepted communication from  privileged user-mode applications and performed common actions that are not specific to the Rootkit Remover itself. This driver  is not only used in the Rootkit Buster and is implemented throughout Trend Micro’s product line.\n In the follow sections, we’ll be deep diving into the  tmcomm driver . We’ll focus our research into finding different ways to abuse the driver’s functionality, with the end goal being able to execute kernel code. I decided not to look into the  tmrkb.sys because although I am sure it is vulnerable, it seems to only be used for the Rootkit Buster.\n  Let’s begin our adventure with the base driver that appears to be used not only for this Rootkit Remover utility, but several other Trend Micro products as well. As I stated in the previous section, a very brief look-over of the driver revealed that it does allow for communication from  privileged user-mode applications.\n  One of the first actions the driver takes is to create a device to accept IOCTL communication from user-mode. The driver creates a device at the path  \\Device\\TmComm and a symbolic link to the device at  \\DosDevices\\TmComm (accessible via  \\\\.\\Global\\TmComm). The driver entrypoint initializes a significant amount of classes and structure used throughout the driver, however, for our purposes, it is not necessary to cover each one.\n I was happy to see that Trend Micro made the correct decision of restricting their device to the  SYSTEM user and Administrators. This meant that even if we did find exploitable code, because any communication would require at least Administrative privileges, a significant amount of the industry would not consider it a vulnerability. For example,  Microsoft themselves do not consider Administrator to Kernel to be a security boundary because of the significant amount of access they get. This does not mean however exploitable code in Trend Micro’s drivers won’t be useful.\n   A large component of the driver is its “TrueApi” class which is instantiated during the driver’s entrypoint. The class contains pointers to  imported functions that get used throughout the driver. Here is a reversed structure:\n struct  TrueApi {\t BYTE  Initialized ;\t PVOID  ZwQuerySystemInformation ;\t PVOID  ZwCreateFile ;\t PVOID  unk1 ;  // Initialized as NULL.\t PVOID  ZwQueryDirectoryFile ;\t PVOID  ZwClose ;\t PVOID  ZwOpenDirectoryObjectWrapper ;\t PVOID  ZwQueryDirectoryObject ;\t PVOID  ZwDuplicateObject ;\t PVOID  unk2 ;  // Initialized as NULL.\t PVOID  ZwOpenKey ;\t PVOID  ZwEnumerateKey ;\t PVOID  ZwEnumerateValueKey ;\t PVOID  ZwCreateKey ;\t PVOID  ZwQueryValueKey ;\t PVOID  ZwQueryKey ;\t PVOID  ZwDeleteKey ;\t PVOID  ZwTerminateProcess ;\t PVOID  ZwOpenProcess ;\t PVOID  ZwSetValueKey ;\t PVOID  ZwDeleteValueKey ;\t PVOID  ZwCreateSection ;\t PVOID  ZwQueryInformationFile ;\t PVOID  ZwSetInformationFile ;\t PVOID  ZwMapViewOfSection ;\t PVOID  ZwUnmapViewOfSection ;\t PVOID  ZwReadFile ;\t PVOID  ZwWriteFile ;\t PVOID  ZwQuerySecurityObject ;\t PVOID  unk3 ;  // Initialized as NULL.\t PVOID  unk4 ;  // Initialized as NULL.\t PVOID  ZwSetSecurityObject ; };\n Looking at the code, the TrueApi is primarily used as an alternative to calling the functions directly. My educated guess is that Trend Micro is caching these imported functions at initialization to evade  delayed IAT hooks. Since the TrueApi is resolved by looking at the import table however, if there is a rootkit that hooks the IAT on driver load, this mechanism is useless.\n  Similar to the TrueApi, the XrayApi is another major class in the driver. This class is used to access several low-level devices and to interact directly with the filesystem. A major component of the XrayConfig is its “config”. Here is a partially reverse-engineered structure representing the config data:\n struct  XrayConfigData {\t WORD  Size ;\t CHAR  pad1 [ 2 ];\t DWORD  SystemBuildNumber ;\t DWORD  UnkOffset1 ;\t DWORD  UnkOffset2 ;\t DWORD  UnkOffset3 ;\t CHAR  pad2 [ 4 ];\t PVOID  NotificationEntryIdentifier ;\t PVOID  NtoskrnlBase ;\t PVOID  IopRootDeviceNode ;\t PVOID  PpDevNodeLockTree ;\t PVOID  ExInitializeNPagedLookasideListInternal ;\t PVOID  ExDeleteNPagedLookasideList ;\t CHAR  unkpad3 [ 16 ];\t PVOID  KeAcquireInStackQueuedSpinLockAtDpcLevel ;\t PVOID  KeReleaseInStackQueuedSpinLockFromDpcLevel ;\t ... };\n The config data stores the location of internal/undocumented variables in the Windows Kernel such as the  IopRootDeviceNode,  PpDevNodeLockTree,  ExInitializeNPagedLookasideListInternal, and  ExDeleteNPagedLookasideList. My educated guess for the purpose of this class is to access low-level devices directly rather than use documented methods which could be hijacked.\n  Before we get into what the driver allows us to do, we need to understand how IOCTL requests are handled.\n In the primary dispatch function, the Trend Micro driver converts the data alongside a  IRP_MJ_DEVICE_CONTROL request to a proprietary structure I call a  TmIoctlRequest.\n  The way Trend Micro organized dispatching of IOCTL requests is by having several “dispatch tables”. The “base dispatch table” simply contains an IOCTL Code and a corresponding “sub dispatch function”. For example, when you send an IOCTL request with the code  0xDEADBEEF, it will compare each entry of this base dispatch table and pass along the data if there is a table entry that has the matching code. A base table entry can be represented by the structure below:\n  After the  DispatchFunction is called, it typically verifies some of the data provided ranging from basic  nullptr checks to checking the size of the input and out buffers. These “sub dispatch functions” then do another lookup based on a code passed in the user input buffer to find the corresponding “sub table entry”. A sub table entry can be represented by the structure below:\n  Before calling the  PrimaryRoutine, which actually performs the requested action, the sub dispatch function calls the  ValidatorRoutine. This routine does “action-specific” validation on the input buffer, meaning that it performs checks on the data the  PrimaryRoutine will be using. Only if the  ValidatorRoutine returns successfully will the  PrimaryRoutine be called.\n Now that we have a basic understanding of how IOCTL requests are handled, let’s explore what they allow us to do. Referring back to the definition of the “base dispatch table”, which stores “sub dispatch functions”, let’s explore each base table entry and figure out what each sub dispatch table allows us to do!\n   This first dispatch table appears to interact with the filesystem, but what does that actually mean? To start things off, the code for the “sub dispatch table” entry is obtained by dereferencing a  DWORD from the start of the input buffer. This means that to specify which sub dispatch entry you’d like to execute, you simply need to set a  DWORD at the base of the input buffer to correspond with that entries’  **OperationCode**.\n To make our lives easier, Trend Micro conveniently included a significant amount of debugging strings, often giving an idea of what a function does. Here is a table of the functions I reversed in this sub dispatch table and what they allow us to do.\n    This dispatch table is primarily used to control the driver’s  process scanning features. Many functions in this sub dispatch table use a separate scanning thread to synchronously search for processes via various methods both documented and undocumented.\n Returns TRUE if the system is “supported” (whether or not they have hardcoded offsets for your build).\n These IOCTLs revolve around a few structures I call “MicroTask” and “MicroScan”. Here are the structures reverse-engineered:\n struct  MicroTaskVtable {\t PVOID  Constructor ;\t PVOID  NewNode ;\t PVOID  DeleteNode ;\t PVOID  Insert ;\t PVOID  InsertAfter ;\t PVOID  InsertBefore ;\t PVOID  First ;\t PVOID  Next ;\t PVOID  Remove ;\t PVOID  RemoveHead ;\t PVOID  RemoveTail ;\t PVOID  unk2 ;\t PVOID  IsEmpty ; }; struct  MicroTask {\t MicroTaskVtable *  vtable ;\t PVOID  self1 ;  // ptr to itself.\t PVOID  self2 ;  // ptr to itself.\t DWORD_PTR  unk1 ;\t PVOID  MemoryAllocator ;\t PVOID  CurrentListItem ;\t PVOID  PreviousListItem ;\t DWORD  ListSize ;\t DWORD  unk4 ;  // Initialized as NULL.\t char  ListName [ 50 ]; }; struct  MicroScanVtable {\t PVOID  Constructor ;\t PVOID  GetTask ; }; struct  MicroScan {\t MicroScanVtable *  vtable ;\t DWORD  Tag ;  // Always &#39;PANS&#39;.\t char  pad1 [ 4 ];\t DWORD64  TasksSize ;\t MicroTask  Tasks [ 4 ]; };\n For most of the IOCTLs in this sub dispatch table, a MicroScan is passed in by the client which the driver populates. We’ll look into how we can abuse this trust in the next section.\n  When I was initially reverse engineering the functions in this sub dispatch table, I was quite confused because the code “didn’t seem right”. It appeared like the  MicroScan kernel pointer returned by functions such as  GetProcessesAllMethods was being directly passed onto other functions such as  DeleteTaskResults by  the client. These functions would then take this untrusted kernel pointer and with almost no validation call functions in the virtual function table specified at the base of the class.\n  Taking a look at the “validation routine” for the  DeleteTaskResults sub dispatch table entry, the only validation performed on the  MicroScan instance specified at the input buffer  + 0x10 was making sure it was a valid kernel address.\n  The only other check besides making sure that the supplied pointer was in kernel memory was a simple check in  DeleteTaskResults to make sure the  Tag member of the  MicroScan is  PANS.\n  Since  DeleteTaskResults calls the constructor specified in the virtual function table of the  MicroScan instance, to call an arbitrary kernel function we need to:\n Be able to allocate at least 10 bytes of kernel memory (for vtable and tag).\n  Control the allocated kernel memory to set the virtual function table pointer and the tag.\n Fortunately a mentor of mine,  Alex Ionescu, was able to point me in the right direction when it comes to allocating and controlling kernel memory from user-mode. A  HackInTheBox Magazine from 2010 had an article by  Matthew Jurczyk called “Reserve Objects in Windows 7”. This article discussed using APC Reserve Objects, which was introduced in Windows 7, to allocate controllable kernel memory from user-mode. The general idea is that you can queue an Apc to an Apc Reserve Object with the  ApcRoutine and  ApcArgumentX members being the data you want in kernel memory and then use  NtQuerySystemInformation to find the Apc Reserve Object in kernel memory. This reserve object will have the previously specified  KAPC variables in a row, allowing a user-mode application to control up to 32 bytes of kernel memory (on 64-bit) and know the location of the kernel memory. I would strongly suggest reading the article if you’d like to learn more.\n This trick still works in Windows 10, meaning we’re able to meet all three requirements. By using an Apc Reserve Object, we can allocate at least 10 bytes for the  MicroScan structure and bypass the inadequate checks completely. The result? The ability to call arbitrary kernel pointers:\n  Although I provided a specific example of vulnerable code in  DeleteTaskResults, any of the functions I marked in the table with asterisks are vulnerable. They all trust the kernel pointer specified by the untrusted client and end up calling a function in the  MicroScan instance’s virtual function table.\n       This function caught my eye the moment I saw its name in a debug string. Using this sub dispatch table function, an  untrusted client can register up to 16 arbitrary “unload routines” that get called when the driver unloads. This function’s validator routine checks this pointer from the untrusted client buffer for validity. If the caller is from user-mode, the validator calls  ProbeForRead on the untrusted pointer. If the caller is from kernel-mode, the validator checks that it is a valid kernel memory address.\n This function cannot immediately be used in an exploit from user-mode. The problem is that if we’re a user-mode caller, we  must provide a user-mode pointer, because the validator routine uses  ProbeForRead. When the driver unloads, this user-mode pointer gets called, but it won’t do much because of mitigations such as  SMEP. I’ll reference this function in a later section, but it is genuinely scary to see an untrusted user-mode client being able to direct a driver to call an arbitrary pointer  by design.\n  This sub dispatch table is used to interact with the XrayApi. Although the Xray Api is generally used by scans implemented in the kernel, this sub dispatch table provides limited access for the client to interact with physical drives.\n    The final sub dispatch is used to scan for hooks in a variety of system structures. It was interesting to see the variety of hooks Trend Micro checks for including hooks in object types, major function tables, and even function inline hooks.\n   Yeah,  TMXMSCheckSystemObjectByName2 is as bad as it sounds. Before looking at the function directly, here’s a few reverse engineered structures used later:\n struct  CheckSystemObjectParams {  PVOID  Src ;  PVOID  Dst ;  DWORD  Size ;  DWORD *  OutSize ; }; struct  TXMSParams {  DWORD  OutStatus ;  DWORD  HandlerID ;  CHAR  unk [ 0x38 ];  CheckSystemObjectParams *  CheckParams ; };\n TMXMSCheckSystemObjectByName2 takes in a Source pointer, Destination pointer, and a Size in bytes. The validator function called for  TMXMSCheckSystemObjectByName2 checks the following:\n  Essentially, this means that we need to pass a valid  CheckParams structure and the  Dst pointer we pass is in user-mode memory. Now let’s look at the function itself:\n  Although that for loop may seem scary, all it is doing is an optimized method of checking a range of kernel memory. For every memory page in the range  Src to  Src + Size, the function calls  MmIsAddressValid. The real scary part is the following operations:\n  These lines take an untrusted  Src pointer and copies  Size bytes to the untrusted  Dst pointer… yikes. We can use the  memmove operations to read an arbitrary kernel pointer, but what about writing to an arbitrary kernel pointer? The problem is that the validator for  TMXMSCheckSystemObjectByName2 requires that the destination is user-mode memory. Fortunately, there is another bug in the code.\n The next  *params-&gt;OutSize = Size; line takes the  Size member from our structure and places it at the pointer specified by the untrusted  OutSize member. No verification is done on what  OutSize points to, thus we can write up to a DWORD each IOCTL call. One caveat is that the  Src pointer would need to point to valid kernel memory for up to  Size bytes. To meet this requirement, I just passed the base of the  ntoskrnl module as the source.\n Using this arbitrary write primitive, we can use the previously found unload routines trick to execute code. Although the validator routine prevents us from passing in a kernel pointer if we’re calling from user-mode, we don’t actually need to go through the validator. Instead, we can write to the unload routine array inside of the driver’s  .data section using our write primitive and place the pointer we want.\n  Typically, I like sticking to strictly security in my blog posts, but this driver made me break that tradition. In this section, we won’t be covering the security issues of the driver, rather the terrible code that’s used by millions of Trend Micro customers around the world.\n   Let’s take a look at what’s happening here. This function has a for loop from 0 to 0x10000, incrementing by 4, and retrieves the object of the process behind the current index (if there is one). If the index does match a process, the function checks if the name of the process is  csrss.exe. If the process is named  csrss.exe, the final check is that the session ID of the process is 0. Come on guys, there is literally documented API to enumerate processes from kernel… what’s the point of bruteforcing?\n    When I first saw this code, I wasn’t sure what I was looking at. The function takes the current process, which happens to be the System process since this is called in a System thread, then it searches for the string “System” in the first 0x1000 bytes. What’s happening is… Trend Micro is bruteforcing the  ImageFileName member of the  EPROCESS structure by looking for the known name of the System process inside of its  EPROCESS structure. If you wanted the  ImageFileName of a process, just use  ZwQueryInformationProcess with the  ProcessImageFileName class…\n   In this function, Trend Micro uses the PID of the  csrss process to brute force the  Peb member of the  EPROCESS structure. The function retrieves the  EPROCESS object of the  csrss process by using  PsLookupProcessByProcessId and it retrieves the  PebBaseAddress by using  ZwQueryInformationProcess. Using those pointers, it tries every offset from 0 to 0x2000 that matches the known  Peb pointer. What’s the point of finding the offset of the  Peb member when you can just use  ZwQueryInformationProcess, as you already do…\n   Here Trend Micro uses the current system thread with a known start address to brute force the  StartAddress member of the  ETHREAD structure. Another case where finding the raw offset is unnecessary. There is a semi-documented class of  ZwQueryInformationThread called  ThreadQuerySetWin32StartAddress which gives you the start address of a thread.\n   When I initially decompiled this function, I thought IDA Pro might be simplifying a  memset operation, because all this function was doing was setting all of the  TrueApi structure members to zero. I decided to tak\n......", "posttime": "2020-05-19 01:01:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rootkit,pvoid", "title": "如何使用Trend Micro的Rootkit Remover安装Rootkit", "title_en": "How to Use Trend Micro's Rootkit Remover to Install a Rootkit", "transed": 1, "url": "https://d4stiny.github.io/How-to-use-Trend-Micro-Rootkit-Remover-to-Install-a-Rootkit/", "via": "", "real_tags": ["rootkit", "pvoid"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002662, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "[列表中的上一个][列表中的下一个][线程中的前一个][线程中的下一个]列表：openbsd-techSubject：clarityFrom：&lt；johnc()armadilloSpace！COM&gt；日期：2020-05-16 19：13：37消息-ID：20200516121337.533b97457880de85c8001c140e636eb6.035aeb57e5.wbe()电子邮件18！好爸爸！com[下载原始消息或正文](不确定这是属于tech@还是misc@)关于非功能代码更改的想法是什么，这些更改只是为了在不更改功能的情况下提高清晰度？例如，在wsdisplay_mulops结构中，有int(*alloc_attr)(void*c，int fg，int bg，int flag，long*attrp)；void(*unpack_attr)(void*c，long attr，int*fg，int*bg，int*ul)；在结构的末尾是这样的注释，这表明至少有人(除了我之外)被它弄糊涂了：/*XXX需要一个free_attr()？*/我建议alloc_attr应该重命名为pack_attr，但是在39个独特的文件中，alloc_attr上有84个匹配项。同样，我在阅读代码时会做笔记，并且在各种文件和函数中添加一些注释可以帮助其他人更快地掌握未来的工作，但是我是这样做的。我希望写一篇关于我的探索的像样的文章，但内联注释是更持久的文档。[列表中的上一个][列表中的下一个][线程中的上一个][线程中的下一个]", "note_en": "[ prev in list] [ next in list] [ prev in thread] [ next in thread]   List:  openbsd-techSubject:  Code changes for clarityFrom:  &lt;johnc () armadilloaerospace ! com&gt;Date:  2020-05-16 19:13:37Message-ID:  20200516121337.533b97457880de85c8001c140e636eb6.035aeb57e5.wbe () email18 ! godaddy ! com[Download RAW  message or  body](Not sure if this belongs in tech@ or misc@)What is the thinking around non-functional code changes that justimprove clarity without functionality changes? I can imagine badexperiences with that, but there is certainly room for improvement.For instance, in the wsdisplay_emulops structure, there are:int\t(*alloc_attr)(void *c, int fg, int bg, int flags, long *attrp);void\t(*unpack_attr)(void *c, long attr, int *fg, int *bg, int *ul);And at the end of the structure is this comment, showing that atleast someone (other than me) was confused by it:\t/* XXX need a free_attr() ??? */I would suggest that alloc_attr should be renamed to pack_attr, butthere are 84 matches on alloc_attr across 39 unique files.Similarly, I am taking notes as I read the code, and adding a fewcomments in various files and functions could help other people getup to speed much faster in the future, but I am hesitant to submitpatches. I am hoping to write a decent article about my explorations,but inline comments are more durable documentation. [ prev in list] [ next in list] [ prev in thread] [ next in thread]", "posttime": "2020-05-19 01:01:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,carmack,attr", "title": "John Carmack正在阅读和贡献OpenBSD源代码", "title_en": "John Carmack is reading and contributing to OpenBSD source code", "transed": 1, "url": "https://marc.info/?l=openbsd-tech&m=158965652915344&w=2", "via": "", "real_tags": ["代码", "carmack", "attr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然在冠状病毒大流行到达美国后的头两个月，后期风险投资(VC)活动没有显著变化，但早期风险投资活动下降了38%。早期风险投资对市场状况的特别敏感性-我们表明，这在1976年至2017年40年的衰退中是常见的-引发了人们对风险投资的顺周期性及其对创新的影响的质疑，特别是考虑到风险投资相对不受公开市场影响的普遍说法。我们发现，这对创新的影响并不是良性的：由风投支持的公司在经济衰退期间进行的创新被引用的次数较少，原创性较差，一般性较差，与基础科学的关联度也较低。对于由早期风险基金资助的初创企业来说，这些影响更为明显。考虑到风险投资在为经济中的突破性创新提供资金方面扮演的重要角色，我们的发现对更广泛地讨论跨商业周期的创新的性质具有重要意义", "note_en": "Although late-stage venture capital (VC) activity did not change dramatically in the first two months after the COVID-19 pandemic reached the U.S., early-stage VC activity declined by 38%. The particular sensitivity of early-stage VC investment to market conditions—which we show to be common across recessions spanning four decades from 1976 to 2017—raises questions about the pro-cyclicality of VC and its implications for innovation, especially in light of the common narrative that VC is relatively insulated from public markets. We find that the implications for innovation are not benign: innovation conducted by VC-backed firms in recessions is less highly cited, less original, less general, and less closely related to fundamental science. These effects are more pronounced for startups financed by early-stage venture funds. Given the important role that VC plays in financing breakthrough innovations in the economy, our findings have implications for the broader discussion on the nature of innovation across business cycles", "posttime": "2020-05-19 01:01:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "资本,capital,创新", "title": "风险资本如何跟随经济下滑并限制创新", "title_en": "How venture capital follows the economy down and curtails innovation", "transed": 1, "url": "https://www.nber.org/papers/w27150", "via": "", "real_tags": ["资本", "capital", "创新"]}, {"category": "", "categoryclass": "", "imagename": "fcd32b4f875a968af27581eaf5699dc5.png", "infoid": 1002660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以Android 10为目标的不受信任的应用程序不能对应用程序主目录中的文件调用exec()。执行可写应用程序主目录中的文件属于W^X违规。应用程序应该只加载应用程序的APK文件中半嵌入的二进制代码。\n从长远来看，这个问题需要解决，Termux需要更新其目标API。此页面用于收集有关如何解决此问题的想法和信息。", "note_en": "Untrusted apps that target Android 10 cannot invoke exec() on files withinthe app&#39;s home directory. This execution of files from the writable app homedirectory is a W^X violation. Apps should load only the binary code that&#39;sembedded within an app&#39;s APK file.\n In the long run this needs to be fixed and Termux needs to update its target API.This page is for gathering ideas and information about how to work around this.", "posttime": "2020-05-19 01:00:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,android,扼杀,termux,应用程序", "title": "Android 10正在扼杀Termux终端应用", "title_en": "Android 10 Is killing Termux terminal app", "transed": 1, "url": "https://github.com/termux/termux-packages/wiki/Termux-and-Android-10", "via": "", "real_tags": ["app", "android", "扼杀", "termux", "应用程序"]}]