[{"category": "", "categoryclass": "", "imagename": "339ebd23c041ad8ce405e4d25d8ed43f.jpg", "infoid": 1001251, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)-市长周四宣布，西雅图居民将有更多的锻炼和骑自行车的空间，因为该市计划永久关闭20英里长的街道，禁止大多数机动车通行。\n保持健康街道倡议始于4月份，目的是暂时为居民提供更多的空间，让他们走出家门锻炼身体，同时在大流行期间保持社会距离。西雅图市长珍妮·A·德坎(Jenny A.Durkan)周四表示，关闭将是永久性的。\n杜尔坎在一份新闻稿中说，安全健康的街道是我们社区的家庭外出、锻炼和享受好天气的重要工具。从长远来看，这些街道将成为我们社区的宝贵资产。\n西雅图交通部(SDOT)表示，选择这些街道是为了在开放空间选择有限、汽车保有量较低以及连接人们与基本服务和食物外卖的路线的地区推广户外锻炼机会。\n鼓励人们在封闭的街道上滑冰、步行、慢跑、骑自行车和打滚。只有送货司机、急救人员、环卫人员和居民的车辆才能进入。\n斯多特在一份新闻稿中说：我们已经看到，在州长英斯利的“保持健康，留在家中”期间，西雅图市中心的车辆交通量下降了57%。找到新的和有创意的方法，比如保持健康的街道，在我们回归新常态的同时保持一些交通流量的减少，这对地球是有好处的，但也对我们与冠状病毒的长期斗争有好处。\n该市还宣布，随着西雅图开始重新开放，将加快自行车基础设施的建设，为居民提供更多的出行选择。\n西雅图自行车顾问委员会在一份声明中表示，这是我们需要采取的大胆行动，在我们应对当前危机的过程中，鼓励人们在我们的城市里选择健康的娱乐和旅行方式，并在我们进入复苏阶段时，阻止交通拥堵和相关的污染和伤害再次出现。所有这些行动将帮助西雅图重新成为一个更安全、更健康、更气候友好的城市。", "note_en": "(CNN) —  Seattle residents will have more space to exercise and bike on as the city plans to permanently close 20 miles of streets to most vehicular traffic,  the mayor announced Thursday.\n The Stay Healthy Streets initiative started in April to temporarily provide more space for residents to get out of the house and exercise while maintaining social distancing during the pandemic. Seattle Mayor Jenny A. Durkan said Thursday that the closures will be permanent.\n  &#34;Safe and Healthy Streets are an important tool for families in our neighborhoods to get outside, get some exercise and enjoy the nice weather,&#34; Durkan said  in a news release. &#34;Over the long term, these streets will become treasured assets in our neighborhoods.&#34;\n The streets were selected to promote outdoor exercise opportunities in areas with limited open space options, low car ownership and routes that connect people to essential services and food take out, according to the  Seattle Department of Transportation (SDOT).\n People are encouraged to skate, walk, jog, bike and roll down the closed streets. Only vehicular traffic from delivery drivers, first responders, sanitation crews and residents are allowed access.\n &#34;We&#39;ve witnessed a 57% drop in vehicle traffic volumes accessing downtown Seattle during Governor Inslee&#39;s Stay Healthy, Stay Home order,&#34; SDOT said in a news release. &#34;Finding new and creative ways, like Stay Healthy Streets, to maintain some of these traffic reductions as we return to our new normal is good for the planet, but is also good for our long-term fight against COVID-19.&#34;\n The city also announced it will accelerate construction of bike infrastructure to provide more mobility options for residents as Seattle begins the process on reopening.\n &#34;It is the kind of bold actions we need to encourage healthy options for recreating and traveling in our city as we deal with our current crisis, and discourage a return to high levels of traffic and associated pollution and injuries as we move into recovery,&#34; the Seattle Bicycle Advisory Board said in a statement. &#34;All these actions together will help Seattle come back as a safer, healthier, and more climate friendly city.&#34;", "posttime": "2020-05-08 20:31:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "街道,permanently", "title": "西雅图永久关闭20英里街道禁止车辆通行", "title_en": "Seattle to permanently close 20 miles of streets to traffic", "transed": 1, "url": "https://www.cnn.com/travel/article/seattle-streets-closed-stay-healthy-trnd/index.html", "via": "", "real_tags": ["街道"]}, {"category": "", "categoryclass": "", "imagename": "d72ffe485c42f0095f2f2827dc50cf16.png", "infoid": 1001250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "又到了JavaScript教程的时间了。这将是我到目前为止介绍的最复杂的代码，所以我希望您已经注意到了，而不仅仅是复制和粘贴！在这篇文章中，您将学习如何使用JavaScript构建纵横字谜生成器。\n首先，我将介绍这个项目的灵感来源，然后我将讨论不同的组件是什么以及它们是如何组合在一起的，最后我将讨论我所做的性能优化。\n您可以通过单击此链接进行试用。不过，在单击按钮后要有耐心，因为有时创建纵横字谜需要一些时间。你很快就会明白为什么。\n我已经编程很多年了，一路上犯了很多错误。我喜欢把自己想象成对构建软件略知一二的人。有大量的事情我不知道，但我对我的技能和我学习新概念和技术的能力充满信心。\n然而，我并不是一夜之间就有了这样的信心。我曾经相当糟糕，当我有机会查看我多年前的一些代码时，我会对我所做的愚蠢的事情感到畏缩。\n所以，如果现在是你，别难过！我们都必须从头做起，才能做好任何有价值的事情。\n这给我带来了一个小小的故事。我通过移植一个旧的Java程序创建了这个填字游戏生成器，这个Java程序是我刚从大学毕业时写回的。我已经很多年没有看过它了，我告诉你，它相当粗糙。如果你想嘲笑我，可以在GitHub上看看。\n我通过一次使用一个Java方法开始移植过程。我用一个闪亮的新JavaScript函数替换了每一个函数，该函数复制了它的逻辑。随着我的进步，我开始重构它，修复错误，并提高性能。\n最终的产品不是完全干净的代码，但它比以前好了很多。\n在完成我的纵横填字游戏生成器的JavaScript版本之后，我开始想知道是否值得为它写一篇教程。我百分之百确定有比我使用的算法更好的算法，我也百分之百确定我可以做更多的可读性和效率改进。我不想教你们任何坏习惯。\n最后我觉得这是个好主意。有这么多教程真的很琐碎，并且不能让您很好地了解典型的公司代码库是什么样子。这会给你一个更好的近似值。这是多个能力水平各不相同的开发人员多年来在一个相当复杂的问题上的协作。碰巧两个开发人员都是我。😂。\n它还会让您有机会添加您自己的改进，这是成长为开发人员的关键。\n我们正在构建一个使用JavaScript、HTML和CSS的纵横填字游戏生成器。这个想法是拿出一大串单词，随机挑选一些，然后试着用它们做一个纵横填字游戏。\n我们将从在网格上放置一个单词开始。然后，我们将获得另一个可能与该单词相关联的候选单词。那么我们将对另一个单词做同样的操作。我们将在ON上继续此过程，每次放置单词或单词不适合拼图中的任何位置时，都会选择一个不同的单词。\n我们什么时候才能停止试着用词呢？这是一个由两个主要因素决定的复杂答案：\n一旦做好了纵横字谜，我们就会继续创造更多的纵横字谜。然后我们会找到单词交叉点最多的一个，并将其显示在屏幕上！\n在这篇文章中，我不会像在以前的一些教程中那样深入研究杂草。有太多的功能和边缘案例要处理。相反，我认为如果我详细解释我们将创建的高级组件将是最有帮助的。知道所有的部件是如何组合在一起的就是成功的一半。\n我真的鼓励您研究每个函数都完成了什么，同时牢记哪些变量正在更改。如果你不明白什么，评论区是一个很好的求助方式。其他人可能会为此感谢你。\n在我最初的版本中，我从一个文本文件中调出了詹姆斯国王的圣经。\n在更新版本中，我只是制作了一个包含大量单词的JavaScript数组。您可以在这里查看。\n要将一个单词放到网格上，我们需要了解一些有关它的事情。显然，我们需要知道单词本身的文本，但我们还需要知道它的位置。我们需要一行和一列来标记它的起始位置。我们还需要一个布尔值来表示单词在方向上是水平的还是垂直的。\n我们将使用我们自己创建的Word对象来表示单词。您可以在这里查看。\n我们正在创建的纵横填字游戏对象是完全完成的纵横填字游戏的表示形式。每一个都有不同的功能，服务于不同的目的。下面是每个函数及其功能的综合列表：\ninvadingRegion：确定一个单词是否会在某个位置入侵另一个单词的领土。\n覆盖HorizontalWord：确定将字符放在特定行/列是否会覆盖水平单词。\noverwrite ingVerticalWord：确定将字符放在特定行/列是否会覆盖垂直字。\n一旦我们有能力将单词放在网格上，我们就需要开始制作一大堆纵横填字游戏。然后，我们需要挑选最好的一个并将其显示在屏幕上。执行所有这些操作的顶级函数称为createCrosswordPutle。\ncreateCrosswordPutle函数有几个有助于实现其目标的嵌套函数。下面是每个函数及其功能的综合列表：\ntemtemptToPlaceWordOnGrid：取一个给定的单词，并尝试将其放在纵横填字游戏上。\nisGoodWord：根据黑板上的字母确定一个单词是否适合放在纵横字谜游戏中。\nPush UsedWords：将一个单词标记为已使用，并将其字母添加到填字游戏中出现的字母列表中。\n除了上述函数外，该文件还包含一些助手函数，用于获取未使用的单词和各种随机值。\n我希望前面的几节已经帮助您了解了所有部分是如何组合在一起的。纵横字谜生成器不是一个微不足道的问题，但将其分解为较小的问题是解决它的一个好方法。事实上，对于任何编程任务来说，这都是一种很好的方法。\n我想更详细地谈一谈另一个方面。默认情况下，此代码速度不是很快。有非常大量的嵌套循环。\n我将与你们分享我为使其更快而采取的步骤。如果你知道更好的算法，我希望你能给我写个评论。这是一门毕生的手艺，我既是一名学生，也是一名教师。\n我采取了4个步骤来提高性能。我会把它们称为调整输入，选择智能单词，知道什么时候退出，以及说它足够好。\n有两个变量可以对程序的速度产生重大影响。一个控制要创建的网格的数量，另一个控制尝试将单词放入网格的次数。\n我发现尝试次数越多，意味着我可以减少要创建的网格总数。高次数的尝试有助于确保纵横填字游戏将密密麻麻地填满单词。\n自己操作这些输入，注意它们如何影响程序的速度以及纵横填字游戏的样子。我试图优化以创建一个好看的纵横填字游戏，同时不会导致页面超时。\n加快速度的一种方法是将我们的单词选择限制在有机会被放入网格中的单词。\n起初，我完全是随机挑选每个单词，但这导致我试图将单词放在网格上，而这些单词没有可能的匹配方式。所以我浪费了大量的时间在网格中循环，我也浪费了在网格上匹配词语的尝试。\n为了解决这个问题，我开始保存一个纵横字谜上存在哪些字母的列表。这样，我可以将我的单词选择限制为仅以这些字母中的一个开头的单词。我创建了下面的函数来帮助识别要尝试的好词。它不是完美的，但它防止了一些不必要的循环。\n有时候你只需要知道什么时候该放弃。随着更多的单词被添加到纵横填字游戏中，成功放置另一个单词的可能性会降低。它没有那么大的空间，而且对放置的要求也变得更加严格。\n最终，我们将开始在很长一段时间内无法将一个词放到网格上。我决定在这一点上结束这件事会更好。如果我们在将单词放到网格上有困难，那么无论如何它都可能是相当满的。\n下面是发生这种情况的代码部分。470这个数字相当随意。似乎就在做了一些测试之后。\n提高性能的最后一步是，一旦我创建了一个至少有4个单词交叉的纵横填字游戏，就停止生成纵横填字游戏。\n一个有4个单词交叉点的纵横填字游戏通常看起来很不错，所以一旦其中一个减少了我们的平均生成时间，就停止游戏。\n哇，那是一篇冗长而乏味的帖子。我真的希望真的有人能读到这一步。如果你有，请给我留言。编写所有这些😂会让我感觉更好\n我希望您已经能够启动并运行您自己的纵横字谜生成器。这是一个有趣的项目，有很多细节需要考虑。如果您能够自己实现它，并且了解所有部分的工作原理，那么您肯定会成为一个更好的开发人员。\n一如既往，感谢您的阅读。你可以订阅我的博客，如果你想要一些关于编写函数的技巧，并希望我的下一篇帖子通过电子邮件发送给你。", "note_en": "It’s time once again for a  JavaScript tutorial. This will be the most complex code I’ve introduced to date, so I hope you’ve been paying attention and not just copy and pasting! In this post you will learn how to build a crossword puzzle generator with JavaScript.\n First I’ll give an introduction into what inspired this project, next I’ll discuss what the different components are and how they fit together, and finally I’ll talk about the performance optimizations I made.\n You can try it out by clicking this link. Be patient after clicking the button though, as sometimes it takes a moment to create a crossword puzzle. You’ll see why soon enough.\n    I’ve been programming for many years now and have made lots of  mistakes along the way. I like to think of myself as somebody who knows a thing or two about building software. There is an enormous number of things I don’t know, but I’m confident in my skill set and my ability to learn new concepts and technologies as needed.\n However, I didn’t get that confidence overnight. I used to be pretty bad, and when I get the chance to look at some of my code from years back it makes me cringe at the silly things I did.\n So if that’s you right now don’t feel bad! We all have to  start from the beginning to become good at anything worthwhile.\n  And this brings me to a little a story. I created this crossword puzzle generator by porting an old  Java program I wrote back when I first got out of college. I hadn’t looked at it in years, and let me tell you, it was pretty rough. You can  check it out on GitHub if you want to laugh at me.\n I began the porting process by going one Java method at a time. I replaced each one with a shiny new JavaScript function that replicated its logic. As I progressed I began to refactor it, fix bugs, and improve the performance.\n  The finished product isn’t perfectly clean code, but it’s a whole lot better than it was before.\n After finishing the JavaScript version of my crossword puzzle generator I began wondering to myself if it’s worth writing a tutorial for. I’m 100% certain there are better  algorithms than the one I used, and I’m also 100% certain there are more readability and efficiency improvements I could make. I don’t want to teach you guys any bad habits.\n  In the end I decided it would be a good idea. So many tutorials out there are really trivial, and don’t give you a good sense of what a typical company code base looks like. This will give you a better approximation of that. It’s a collaboration of multiple developers with varying ability levels on a fairly complex problem over many years. It just so happens that both of the developers are me. 😂\n It will also give you an opportunity add your own improvements, which is key to growing as a developer.\n   We are building a crossword puzzle generator with  JavaScript, HTML, and CSS. The idea is to take a big list of words, pick some random ones, and try to make a crossword puzzle out of them.\n We’ll start by placing a word on a grid. Then we’ll get another word that is a possible candidate to connect to that word. Then we’ll do the same for another word. We’ll continue this process on an on, picking a different word each time the a word is placed or doesn’t fit anywhere in the puzzle.\n When do we stop trying to place words? That’s a complicated answer determined by two main factors:\n   Once a crossword puzzle is made, we’ll go ahead and create some more. Then we’ll find the one with the most word intersections and show it on the screen!\n    I won’t go into the weeds as much in this post as I do in some of my  previous tutorials. There are just too many functions and edge cases to go through. Instead, I think it will be most helpful if I explain in detail the high-level components we will be creating. Knowing how all the pieces fit together is half the battle.\n I really encourage you to study what each function is accomplishing while keeping in mind which variables are being changed. The comment section is a great way to reach out for help if you don’t understand something. Others will probably thank you for it.\n    In my original version I pulled the King James Bible in from a text file.\n In the updated version I just made a JavaScript array with a bunch of words in it. You can check it out  here.\n  To place a word on the grid we’ll need to know a few things about it. Obviously we’ll need to know the text of the word itself, but we’ll also need to know about it’s positioning. We’ll need a row and a column to mark it’s starting position. We’ll also need a boolean value to represent whether the word is horizontal or vertical in orientation.\n  We’ll represent words using a word object we create ourselves. You can check it out  here.\n  The crossword puzzle objects we’re creating are  representations of fully completed crossword puzzles. Each one will have various functions serving different purposes. Here is the comprehensive list of each function and what it does:\n invadingTerritory: Determines if a word will invade another word’s territory at a certain position.\n   overwritingHorizontalWord: Determines if placing a character at a particular row/column would be overwriting a horizontal word.\n overwritingVerticalWord: Determines if placing a character at a particular row/column would be overwriting a vertical word\n   Once we have the ability to place words on a grid we need to start making a whole bunch of crossword puzzles. Then, we need to pick the best one and display it on the screen. The top-level function that does all this is called  createCrosswordPuzzle.\n The  createCrosswordPuzzle function has several nested functions that help accomplish its goals. Here is the comprehensive list of each function and what it does:\n attemptToPlaceWordOnGrid: Take a given a word and try to place it on the crossword puzzle.\n   isGoodWord: Determine if a word is a good candidate to try placing on crossword puzzle based on the letters on the board.\n  pushUsedWords: Mark a word as used and add its letters to a list of ones present on the crossword puzzle.\n In addition to the functions above, this file contains some helper functions for getting unused words and various random values.\n   I hope the previous sections have helped you see how all the pieces fit together. A crossword puzzle generator is a non-trivial problem, but breaking it down into smaller problems is a good way to approach it. In fact, that’s a good approach for any programming task.\n I would like to cover one more aspect in further detail. By default, this code isn’t very fast. There is a very large amount of nested looping.\n I’m going to share with you the steps I took to make it faster. If you know of better  algorithms I’d love for you to write me a comment. This is a life long craft, and I’m as much of a student as I am a teacher.\n There are 4 steps I took to improve the performance. I’ll refer to them as Adjusting The Inputs, Smart Word Picking, Knowing When To Quit, and Calling It Good Enough.\n  There are two variables that can have a major affect on the speed of the program. One controls the number of grids to make, and the other controls the number of attempts to fit words on the grid.\n  I found that a high number of attempts meant that I could lower the total number of grids to make. A high number of attempts helps ensure that the crossword puzzle will be densely packed with words.\n Play around with these inputs yourself and notice how they affect the speed of the program and what the crossword puzzle looks like. I tried to optimize for creating a good looking crossword puzzle while not causing the page to timeout.\n  One way to speed things up is to limit our word selection to words that have a chance at being placed on the grid.\n At first I picked each word totally at random, but that resulted in trying to place words on the grid that had no possible way of fitting. So I wasted a bunch of time looping through the grid, and I also wasted attempts at fitting words on the grid.\n To fix this I started keeping a list of which letters exist on the crossword puzzle. That way I could limit my word selection to only words that start with one of those letters. I created the function below to aid in identifying good words to try. It isn’t perfect, but it prevents some unnecessary looping.\n   Sometimes you just gotta know when to quit. As more words are added to the crossword puzzle, the likelihood of successfully placing another word goes down. There isn’t as much space for it, and the requirements for placement become stricter.\n Eventually we’ll start failing for an exceedingly long time to place a word on the grid. I decided it would be better to just end things at that point. If we are having trouble placing words on the grid it is probably pretty full anyways.\n  Here is the section of code where this takes place. The number 470 is pretty arbitrary. It seemed about right after doing some testing.\n   The final step I took to improve performance was to stop generating crossword puzzles once I had created one with at least 4 word intersections.\n A crossword puzzle with 4 word intersections usually looks pretty good, so stopping once we have one of those cuts down on our average generation time.\n    Wow that was a long and tedious post. I really hope somebody actually reads this far. If you do, leave me a comment. It will make me feel better about writing all of this 😂\n I hope you’ve been able to get your own crossword puzzle generator up and running. It’s a fun project with a lot of details to consider. If you can implement it yourself and understand how all the pieces work you’ll definitely be a better developer for it.\n As always, thanks for reading. You can  subscribe to my blog if you’d like some tips on writing functions and to have my next post emailed to you.", "posttime": "2020-05-08 20:15:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "javascript,java,构建,crossword,单词", "title": "用JavaScript构建纵横字谜生成器", "title_en": "Building a Crossword Puzzle Generator with JavaScript", "transed": 1, "url": "https://mitchum.blog/building-a-crossword-puzzle-generator-with-javascript/", "via": "", "real_tags": ["java", "构建", "crossword", "单词"]}, {"category": "", "categoryclass": "", "imagename": "f7ca2582e716f4a6d9cf868bf6ac80b8.jpg", "infoid": 1001249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以风险换取回报。风险调整后的收益。风险管理。商业风险。集中仓位风险。交易对手风险。流动性风险。回报风险序列。长寿风险。职业风险。\n想了想之后，我读了更多关于它的书。然后我会把它写下来。然后我会在镜头前谈论这件事。然后我会在播客上谈论这件事。那我想再考虑一下。我全神贯注于这个话题，这使得我接下来要说的事情真的让…很尴尬。\n在读到这个年轻人艾哈茂德·阿贝里的故事后，我突然想到，经过这么多的时间和努力，我仍然不知道什么是他妈的风险。没什么。我与风险有一种理论上的关系，但不像其他人那样与现实生活在一起。\n一名25岁的男子慢跑，最终走上了他所住社区附近的一条路。但由于他的肤色，一对父子决定他不属于他们的道路，不属于他们的社区。所以他们首先报了警，他们自己说的原因是他是黑人，正在逃亡。然后他们挂上电话，抓起几把枪，上了一辆皮卡车，追捕他。然后他们把他截住，与他进行身体对抗，向他开枪，然后杀了他。白日青天。慢跑者。\n你可能会在你自己的州，在你自己的国家，因为你的肤色而被追捕和杀害。我不会承受这样的风险。这才是真正的风险。相比之下，这让我花了一天时间谈论的东西显得很幼稚。\n我们希望年轻人购买并投资于这一体系。我们需要他们让它永久化，还清我们的债务，修复我们对地球的破坏。我们希望年轻人投资他们的钱，在这个社会扎根。然后我们就会有这样的事情发生吗？\n为什么新一代人会相信一个两个月后仍然没有起诉这起谋杀案的社会？我们把它拍下来了。从字面上看，这是一盘录像带。这两个我都不会买。\n艾哈茂德·阿尔贝里被谋杀一事和到目前为止的反应是绝对的耻辱。并很好地提醒人们风险的真正含义，这是任何美国人都不应该承担的风险类型。", "note_en": "Risk in exchange for reward. Risk adjusted returns. Risk management. Business risk. Concentrated position risk. Counter-party risk. Liquidity risk. Sequence of returns risk. Longevity risk. Career risk.\n And then after thinking about it, I read some more about it. Then I write about it. Then I talk about it on camera. Then I talk about it on podcasts. Then I think some more on it. I’m consumed with the topic  which makes the next thing I’m going to say really embarrassing…\n After reading about this young man Ahmaud Arbery, it occurred to me that after all this time and effort, I still don’t know shit about risk. Nothing. I have a theoretical relationship with risk, but don’t live with the real thing in the way others do.\n A 25 year old man goes jogging and ends up on a road in an adjacent neighborhood to the one he lives in. But because of the color of his skin, a father and son decide he doesn’t belong on their road, in their neighborhood. So first they call the police, and their own stated cause for calling was that he was black and running. Then they hang up the phone, grab some guns, get into a pick up truck and hunt him down. Then they cut him off to have a physical confrontation with him, fire shots at him and kill him. In broad daylight. A jogger.\n  That you could be hunted and killed in your own state, in your own country, over the color of your skin. I don’t live with that risk. That’s real risk. It makes the stuff I spend my day talking about seem childish by comparison.\n We want young people to buy in and invest in the system. We need them to perpetuate it and pay off our debts, repair our damage to the planet. We want young people to invest their money and build roots in this society. And then we have stuff like this go on?\n Why would this new generation buy into a society where two months later there still hasn’t been a prosecution for this murder? We have it on camera. There’s literally a tape of it. I wouldn’t buy in either.\n The murder of Ahmaud Arbery and the response so far are an absolute disgrace. And a good reminder of the  real meaning of risk, the type of risk that no American should ever have to bear.", "posttime": "2020-05-08 20:15:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "知道,don,风险", "title": "你甚至不知道什么是风险", "title_en": "You don’t even know what risk is", "transed": 1, "url": "https://thereformedbroker.com/2020/05/07/you-dont-even-know-what-risk-is/", "via": "", "real_tags": ["知道", "don", "风险"]}, {"category": "", "categoryclass": "", "imagename": "a986f9cb323c3c966037f5b05c2d201d.jpg", "infoid": 1001248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大河能源公司是美国第二大电力公司，位于明尼苏达州剑桥市。这将是这家风险投资支持的电池技术开发商的长期储能技术的首次商业部署。\n来自Energy的电池系统具有重大意义，因为它能够在150小时内提供1兆瓦的电力-与目前用于大多数电网规模存储项目的锂离子电池相比，这是一个巨大的飞跃。这些电池系统可以持续两到四个小时。\n能源输送持续时间的阶段性改变应该会让储能项目取代依赖煤炭和天然气来稳定电网需求的调峰发电厂。\n普林斯顿大学(Princeton University)研究低碳能源系统工程的助理教授杰西·詹金斯(Jesse Jenkins)在一份声明中表示：“与目前大规模部署的传统电池储存系统相比，长期储能解决方案将在清洁电力系统中发挥完全不同的作用。”“锂离子电池非常适合能源生产的快速爆发，但它们在短短几个小时后就会耗尽能量。一种真正的低成本、可持续数天的能源储存解决方案，将填补风能和太阳能生产方面的缺口，否则这些缺口将需要启动一座化石燃料发电厂。像这样的技术可以使可靠的、负担得起的100%可再生电力系统成为现实。“。\n在麻省理工学院发动机投资工具、意大利能源公司Eni Spa的企业风险投资部门Eni Next和比尔·盖茨(Bill Gates)支持的专注于可持续发展的投资公司Breakthrough Energy Ventures等投资者超过4900万美元的风险投资支持下，Form Energy开发了一种名为“含水空气”电池系统的新存储技术。\n我们在Form Energy的愿景是释放可再生能源的力量，通过我们专有的长期存储来改造电网。Form Energy首席执行官马特奥·贾拉米洛(Mateo Jaramillo)在一份声明中表示：“这个项目代表着朝着证明在不牺牲可靠性的情况下，建立一个负担得起的、可再生的未来的愿景迈出了大胆的一步。”\nForm对公用事业公司的推销不仅仅依赖于开创性的能源储存技术，还包括对公用事业公司如何使用专有软件分析系统优化其能源组合的评估。该软件的目的是在系统层面对高渗透率的可再生能源进行建模，以确定如何将存储与可再生能源相结合，以创建一种可以为能源供应商带来更好回报的低成本能源。\n“大河能源公司很高兴能在这个重要项目上与Form Energy公司合作。电网越来越多地由可再生能源供应。商业上可行的长期存储可以通过确保可再生能源产生的电力随时可用来为我们的会员服务，从而提高可靠性。在持续几天的极端天气条件下，这样的储存可能特别重要。长期储存还为能源价格波动提供了极好的对冲，“Great River Energy副总裁兼首席供电官乔恩·布雷克(Jon Brekke)在一份声明中说。\n根据两家公司的声明，最终，这次部署将成为Form Energy的电池系统众多安装中的第一个。\n普林斯顿大学(Princeton University)研究低碳能源系统工程的助理教授杰西·詹金斯(Jesse Jenkins)在一份声明中表示：“与目前大规模部署的传统电池储存系统相比，长期储能解决方案将在清洁电力系统中发挥完全不同的作用。”“锂离子电池非常适合能源生产的快速爆发，但它们在短短几个小时后就会耗尽能量。一种真正的低成本、可持续数天的能源储存解决方案，将填补风能和太阳能生产方面的缺口，否则这些缺口将需要启动一座化石燃料发电厂。像这样的技术可以使可靠的、负担得起的100%可再生电力系统成为现实。“", "note_en": "The second-largest electric utility in the U.S., Great River Energy’s installation in Cambridge, Minn. will be the first commercial deployment of the venture-backed battery technology developer’s long-duration energy storage technology.\n From Energy’s battery system is significant for its ability to deliver 1 megawatt of power for 150 hours — a huge leap over the lithium ion batteries currently in use for most grid-scale storage projects. Those battery systems can last for two- to four-hours.\n  The step change in the duration of energy delivery should allow energy storage projects to replace the peaking power plants that rely on coal and natural gas to smooth demand on the grid.\n “Long duration energy storage solutions will play an entirely different role in a clean electricity system than the conventional battery storage systems being deployed at scale today,” said Jesse Jenkins, an assistant professor at  Princeton University   who studies low-carbon energy systems engineering, in a statement. “Lithium-ion batteries are well suited to fast bursts of energy production, but they run out of energy after just a few hours. A true low-cost, long-duration energy storage solution that can sustain output for days, would fill gaps in wind and solar energy production that would otherwise require firing up a fossil-fueled power plant. A technology like that could make a reliable, affordable 100% renewable electricity system a real possibility,”\n Backed with over $49 million in venture financing from investors including MIT’s The Engine investment vehicle; Eni Next, the corporate venture capital arm of the Italian energy firm Eni Spa, and the Bill Gates-backed sustainability focused investment firm,  Breakthrough Energy Ventures,   Form Energy has developed a new storage technology called an “aqueous air” battery system.\n “Our vision at Form Energy is to unlock the power of renewable energy to transform the grid with our proprietary long-duration storage. This project represents a bold step toward proving that vision of an affordable, renewable future is possible without sacrificing reliability,” said Mateo Jaramillo, the chief executive of Form Energy, in a statement.\n Form’s pitch to utilities relies on more than just a groundbreaking energy storage technology, and includes an assessment of how best utilities can optimize their energy portfolios using a proprietary software analytics system. That software, was built to model high penetration renewables at a system level to figure out how storage can be combined with renewable energy to create a low-cost energy source that can deliver better returns to energy providers.\n “Great River Energy is excited to partner with Form Energy on this important project. The electrical grid is increasingly supplied by renewable sources of energy. Commercially viable long-duration storage could increase reliability by ensuring that the power generated by renewable energy is available at all hours to serve our membership. Such storage could be particularly important during extreme weather conditions that last several days. Long-duration storage also provides an excellent hedge against volatile energy prices,” said Great River Energy Vice President and Chief Power Supply Officer Jon Brekke, in a statement.\n Ultimately, this deployment is intended to be the first of many installations of Form Energy’s battery systems, according to the statement from both companies.\n “Long duration energy storage solutions will play an entirely different role in a clean electricity system than the conventional battery storage systems being deployed at scale today,” said Jesse Jenkins, an assistant professor at Princeton University who studies low-carbon energy systems engineering, in a statement. “Lithium-ion batteries are well suited to fast bursts of energy production, but they run out of energy after just a few hours. A true low-cost, long-duration energy storage solution that can sustain output for days, would fill gaps in wind and solar energy production that would otherwise require firing up a fossil-fueled power plant. A technology like that could make a reliable, affordable 100% renewable electricity system a real possibility,”", "posttime": "2020-05-08 20:15:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "潜在,big,能源", "title": "在可再生能源的潜在重大胜利中，Form Energy获得了第一个", "title_en": "In a potential big win for renewable energy, Form Energy gets its first", "transed": 1, "url": "https://techcrunch.com/2020/05/07/in-a-potential-big-win-for-renewable-energy-form-energy-gets-its-first-grid-scale-battery-installation/", "via": "", "real_tags": ["潜在", "big", "能源"]}, {"category": "", "categoryclass": "", "imagename": "5bf1e34a582e526dcffcd3f0b4925021.jpg", "infoid": 1001247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "托特。那是4月下旬一个工作日的下午，我和几十个人一起登上了一架我们大多数人都以为会空着的飞机。空乘人员正在争先恐后地满足换座要求。旅行者-肩并肩挤成两排-戴着口罩相互抱怨。机上PA系统传来不祥的消息：“我们对这趟航班上令人震惊的乘客数量表示歉意。”我们每个人都是致命疾病的潜在传播媒介。\n我到了我指定的那排，发现我旁边的座位上坐着一个身材矮胖、头发花白的男人。当我走过去坐下时，他拦住了我。“坐在那里，”他指着我们身后的过道粗声说。“社交距离。”\n不急于对抗，我决定顺从。然而，几秒钟之内，一名空乘人员出现了，并命令我回到指定的座位。我的顽固不化的准同桌强烈反对这一进展，他的回应是用他的腿挡住了我进入排行口。\n一场对峙随之而来，愤怒的乘客抗议说有很多空位可以坐(那里没有)，长期受苦的空姐几乎威胁要把他踢下飞机(她没有)。最后，他心软了，我尴尬地挤到座位上，那个人低声说着脏话。\n在我出行前的几天里，同事和家人一再表示羡慕。“我太嫉妒了，”一位同事告诉我。“没有孩子坐飞机听起来就像天堂，”我妻子说。这次旅行并不奢侈；我要去的是一次不能重新安排的短期报道之旅。但我理解他的感受。像数以百万计的美国人一样，我已经与社会保持了近两个月的距离-关在家里，留着粗糙的隔离胡子，和莱索尔疯狂地擦拭杂货。收拾行李箱，穿上真正的裤子，登上飞机的前景听起来像是一次激动人心的放纵，一次宏伟的冒险。坐飞机旅行吧！谁能想象到这样的事情呢？\n但在大流行期间飞行，结果比我计划的更有压力-也更超现实。这些场景就像一部世界末日后的电影：偏执的旅行者戴着口罩在空荡荡的航站楼漫步，小心翼翼地互相盯着对方，一边用消毒剂模糊自己。反乌托邦的公共服务公告在机场回荡-“这是来自疾病控制和预防中心的信息……”即使是最小的、最例行公事的任务-比如处理触摸屏售票亭-也感觉充满了危险。\n我的旅行是在两条腿上进行的，第一条腿很奇怪，主要是在我预期的方式上。华盛顿国家机场除了少数商店和餐馆外，所有的商店和餐馆都关闭了。主舱的饮料服务被暂停(尽管显然向头等舱乘客提供姜汁汽水在流行病学上是可以接受的)。我的第一次飞行是如此空荡荡的，以至于飞行员警告说我们将经历“非常快速的起飞加速”。飞机一跃而起，我的胃都要掉下来了。在飞行的大部分时间里，我都在用我的一袋莱索尔湿巾反复擦洗触手可及的每个表面。\n在奥黑尔的中途停留是我的旅伴们紧张的神经更充分地映入眼帘的地方。在洗手间里，男人们像战斗归来的战士一样徘徊在水槽上，热情地洗手，用威胁的目光看着任何靠得太近的人。在美食广场，几个压力很大的陌生人之间爆发了一场叫喊比赛，警察不得不介入。\n登机口外，乘客们相隔五六个座位坐着，几乎不相互打招呼，更不用说试图交谈了。过了一会儿，怪异的寂静折磨着我。当我妻子发短信询问进展如何时，我能收集到的最好的描述是一个鬼脸表情。\n飞行从来都是不愉快的，而且充斥着小侮辱。很可能是我比往常对周围人的骚动更加警觉。但是，当美国在接下来的几周里笨拙地摇摇晃晃地走向经济“重新开放”的时候，我令人担忧的旅行经历突显了一个不受欢迎的事实：等待在这些呆在家里的订单的另一端的“正常”的闪闪发光的诱惑是一种海市蜃楼。\n我们在大流行前的生活中最怀念的事情-在餐馆用餐、娱乐旅行、卡拉OK之夜和棒球比赛-需要的不仅仅是政府的许可才能享受。这些活动不仅建立在密切的人际交往基础上，还建立在相互间的感情和善良的耐心基础上，取决于我们相互容忍的能力。州长可以取消限制，公司可以实施公共卫生协议。但是，除非我们不再条件反射地将人们视为病毒威胁，否则我们渴望的那些古老的小乐趣很可能仍然难以捉摸。\n我只需要坐在我愤怒的同座旁边几分钟。在他大发脾气后不久，一名空乘回到我们的排上来，对他怒目而视后告诉我，我要升职了。我收拾好我的东西，不好意思地走上过道，而那个愤愤不平的乘客讽刺地喊道：“哦，头等舱！”\n飞机上升时，我把头贴在窗户上，俯视着消失的跑道。我试图思考人类飞行的奇迹，品尝我正在经历的这一难得的特权。但随后，一个不愉快的想法浮出水面：今天有多少人用肮脏的手触摸了这扇窗户？我猛然后退，把一些洗手液喷在额头上。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n是“大西洋月刊”的特约撰稿人，也是“荒野”(The Wilderness)一书的作者，这本书讲述了共和党的未来之战。", "note_en": "T . It was a weekday afternoon in late April, and I was among dozens of people boarding an airplane that most of us had assumed would be empty. Flight attendants were scrambling to accommodate seat-change requests. Travelers—stuffed shoulder to shoulder into two-seat rows—grumbled at one another from behind masks. An ominous announcement came over the in-flight PA system: “We apologize for the alarming amount of passengers on this flight.” Each of us was a potential vector of deadly disease.\n   I arrived at my assigned row, and found a stocky, gray-haired man in the seat next to mine. When I moved to sit down, he stopped me. “Sit there,” he said gruffly, pointing to the aisle behind us. “Social distance.”\n Not eager for a confrontation, I decided to comply. Within seconds, though, a flight attendant materialized and ordered me back to my assigned seat. My recalcitrant would-be seatmate, vigorously objecting to this development, responded by blocking my entrance to the row with his leg.\n A standoff ensued, with the irate passenger protesting that there were plenty of empty rows where I could sit (there weren’t) and the long-suffering flight attendant all but threatening to kick him off the plane (she didn’t). Finally, he relented and I squeezed awkwardly into my seat as the man muttered profanities under his breath.\n    In the days leading up to my trip, colleagues and family members had repeatedly expressed envy. “I’m so jealous,” one co-worker told me. “Taking a flight without kids sounds like heaven,” my wife said. The travel wasn’t anything extravagant; I was going on a short reporting trip that couldn’t be rescheduled. But I understood the sentiment. Like millions of Americans, I’d been social distancing for nearly two months—cooped up at home, growing a gnarly quarantine beard, and manically wiping down groceries with Lysol. The prospect of packing a suitcase, putting on real pants, and boarding an airplane sounded like a thrilling indulgence, a grand adventure. Travel by air! Who could even imagine such a thing?\n   But flying during a pandemic turned out to be more stressful—and surreal—than I’d planned for. The scenes played out like a postapocalyptic movie: Paranoid travelers roamed the empty terminals in masks, eyeing one another warily as they misted themselves with disinfectant. Dystopian public-service announcements echoed through the airport—“ This is a message from the Centers for Disease Control and Prevention...” Even the smallest, most routine tasks—such as dealing with the touch-screen ticketing kiosk—felt infused with danger.\n  My trip took place in two legs, and the first was weird mostly in the ways that I’d expected. All but a few of the shops and restaurants at Washington National Airport were closed. Beverage service in the main cabin was suspended (though apparently serving ginger ale to first-class passengers was ruled epidemiologically acceptable). My first flight was so empty that the pilot warned we would experience “a very rapid acceleration for takeoff.” The plane leapt into the sky and my stomach dropped. I spent much of the flight using my baggie of Lysol wipes to scrub and re-scrub every surface within reach.\n The layover at O’Hare was where my fellow travelers’ fraying nerves came more fully into view.  In the restroom, men hovered over sinks like warriors returning from battle, fervently washing their hands and shooting menacing looks at anyone who got too close. At the food court, a shouting match broke out among several stressed-out strangers, and police had to intervene.\n Outside the gate, passengers sat five or six seats apart, barely acknowledging one another, let alone attempting conversation. The eerie silence wore on me after a while. When my wife texted to ask how it was going, the best description I could muster was a grimacing emoji.\n  Flying has always been unpleasant, and rife with small indignities. It’s likely that I was more alert than usual to the agitation of those around me. But as America lurches awkwardly toward an economic “reopening” in the weeks ahead, my fraught travel experience highlighted an unwelcome truth: The glittering allure of “normalcy” that waits on the other end of these stay-at-home orders is a mirage.\n    The things we miss most about our pre-pandemic lives—dine-in restaurants and recreational travel, karaoke nights and baseball games—require more than government permission to be enjoyed. These activities are predicated not only on close human contact but mutual affection and good-natured patience, on our ability to put up with one another. Governors can lift restrictions and companies can implement public-health protocols. But until we stop reflexively seeing people as viral threats, those old small pleasures we crave are likely to remain elusive.\n  I only had to sit next to my angry seatmate for a few minutes. Shortly after his tantrum, a flight attendant came back to our row and—after treating the man to a withering glare—informed me that I was being upgraded. I gathered my things and sheepishly made my way up the aisle while the aggrieved passenger sarcastically exclaimed, “Ooh,  first class!”\n As the plane ascended, I pressed my head against the window and peered down at the disappearing runway. I tried to ponder the miracle of human flight, to savor this rare privilege I was experiencing. But then an unhappy thought asserted itself:  How many people have touched this window today with their filthy hands? I jerked back, and squirted some hand sanitizer onto my forehead.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n          is a staff writer at  The Atlantic and the author of   The Wilderness, a book about the battle over the future of the Republican Party.", "posttime": "2020-05-08 20:14:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "想象,flying,乘客", "title": "飞行：比你想象的更糟", "title_en": "Flying: It’s Worse Than You Think", "transed": 1, "url": "https://www.theatlantic.com/politics/archive/2020/05/is-flying-safe-coronavirus/611335/", "via": "", "real_tags": ["想象", "flying", "乘客"]}, {"category": "", "categoryclass": "", "imagename": "7c286b222d2288b4a1ff60a9b92d468c.jpg", "infoid": 1001246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我还是个孩子的时候(1989年)，我很荣幸地收到了一台二手辛克莱ZX-81，它启发了我上面的画。它是首批8位家用计算机之一。它没有应用商店。它与一台黑白电视相连。当我拿到它的时候，它已经过时了，但那无关紧要。软件以声波的形式记录在盒式录音机上。有一本书解释了如何用BASIC编程这个设备，它也有ZX-81的电路图。对我来说，熟悉这台机器并让移动的符号出现在屏幕上是一件神奇的事情。这让我在90年代与电脑(特别是Amiga)建立了真正亲密的关系。计算机是一种工具，可以单独或与朋友一起将文本、图形、音频和程序塑造成形状。\n当微软Windows和后来的MacOSX开始占据主导地位时，这种情况发生了变化。随着Office和Web的出现，计算机成为知识工作和媒体消费的设备。除了与IBM兼容的模块化PC外，它们变得越来越专有，越来越受到限制。在一台现代电脑上，你绝对仍然可以有创造力。但是你会很难找到一台感觉像是你自己的、你真正理解的电脑。尤其是对于手机、平板电脑和笔记本电脑，主要参与者希望控制您数字体验的方方面面，直到您使用的大多数代码将在保留您个人数据的专有云中运行。驱动你的设备的芯片和驱动程序都是商业机密。\n大约三年前，我与工业设计师安娜·丹塔斯(Ana Dantas)合作设计了一款开放式硬件笔记本电脑。我们受到了加法制造、小规模PCB生产和早期开放硬件运动的可能性的启发，以及越来越多的人意识到，我们目前生产快速淘汰硬件的过程不能持续下去。我们想出了一个计划，带回一台比现状更能让你理解和信任的电脑。我们围绕i.MX6处理器制作了这款笔记本电脑的原型-MNT改革(类似于Bunnie和Xobs之前对Novena所做的事情)。时装设计师格里塔·梅尔尼克(Greta Melnik)和我们一起在家里组装了13台Beta笔记本电脑，其中大部分卖给了早期的支持者(谢谢！)。Greta现在全职为MNT Research工作，确保我们运送的每一件东西都有高水平的质量。\n2018年底，我很幸运地能够出售我参与的一家网络技术公司的股票。我用这笔钱购买了一些制造设备，并在柏林弗里德瑙现已拆除的诺克铸造厂的剩余部分租了一个真正的工作空间。凭借我们早期测试版测试人员的反馈，以及CCC和许多其他活动的无数讨论，我们在过去一年半的时间里自筹资金，致力于新的MNT改革。\n今天，我们将发起众筹，推出一款笔记本电脑，它没有粘合电池，没有焊接存储，也没有安全芯片，这些都会阻止你行使维修权。MNT改革是一个大胆的设计，它是我们所能做到的最开放和可修复的。它厚实结实(黑色阳极处理，磨铝)，有一个机械键盘和一个光学跟踪球(如果你愿意，也可以是一个多点触摸板)。虽然CPU+RAM模块最初是现成的部件(边界设备公司的Nitrogen8M)，但系统中的所有电路板都是由我们定制设计和开源的，包括轨迹球的SLA可打印机械部件。\n系统控制器、输入设备固件和所有驱动程序，包括3D图形(由etNaviv提供支持)也都是开源的。改革的初始CPU恩智浦i.MX8M在引导时使用专有(非ARM)例程来校准LPDDR4内存，您必须容忍类似的代码才能使用可选的HDMI输出。但是i.MX8M是我们能找到的最开放、记录最好的芯片，而且它没有焊接进去。\n如果一个更开放的版本出现(想想RISC-V)，任何人都可以制作一个针对改革格式的升级模块。CPU+RAM模块使用带有开放引脚的标准200针SO-DIMM连接器，因此我们或任何第三方都可以制造具有不同特性的更换模块。\n我们站在无数人的肩膀上，他们创建了自由软件生态系统，允许我们从第一天起就在改革上发布许多高质量的应用程序和游戏，包括LibreOffice、Inkscape 1.0、Blender 2.79、Aredour 5、Emacs和Vim或Firefox。我们通过数月的日常工作测试，确保您可以使用NVMe固态硬盘、mPCIe Wi-Fi卡和USB3.0外围设备。\n默认情况下，这台计算机附带Debian GNU/Linux(Bullseye)操作系统，我们正在与Genode实验室合作，为改革提供Genode。我们也希望看到所有的BSD和其他免费的、可替代的操作系统。我们是一家小公司，所以我们需要你的帮助。\nMNT改革不仅仅是开放。其高度模块化的方法旨在使其更具可持续性。希望你永远不需要扔掉一个。取而代之的是，您将能够对其进行10年以上的维护和升级。我们邀请每个人提供兼容的和可选的部件，我们发布我们的设计文件，并提供支持以使这一点变得容易。\nMNT改革DIY：我们极力要求将其控制在1000美元以下。这是一个套件，所有的电路板和机箱部件，你可以用它来建造你自己的笔记本电脑，宜家风格。不需要焊接。\nMNT REGATION MAX：满载版，配备1 TB NVMe固态硬盘和Atheros ath9k兼容Wi-Fi卡。在顶部，您将得到我们定制的黑色Piñatex素食皮袖和一本签名的手册。\nMNT改革主板：适用于为改革平台开发软件或围绕改革构建自己的硬件和/或机箱。\n我们只能梦想你会想出什么创造性的用途和修改。", "note_en": "When I was a kid (in ~1989), I was privileged to receive a second-hand Sinclair ZX-81 that inspired my drawing above. It was one of the first 8-bit home computers. It didn’t have an App Store. It connected to a black-and-white TV. It was already outdated when I got it, but that didn’t matter. Software was recorded as sound waves on a cassette recorder. There was a book that explained how to program this device in BASIC, and it had circuit diagrams of the ZX-81, too. It was magical for me to become familiar with this machine and make moving symbols appear on screen. This led to a really intimate relationship with computers (especially the Amiga) for me in the 90s. The computer was a tool to mold text, graphics, audio, programs into shape, alone or with friends.\n This changed when Microsoft Windows, and later Mac OS X, started to dominate. With Office and the Web, computers became devices for knowledge work and media consumption. With the exception of the modular IBM-compatible PC, they became more and more proprietary and locked down. You absolutely still can be creative on a modern computer. But you will have trouble finding a computer that feels like it’s really yours, that you really understand. Especially with phones, tablets, and laptops, the major players want to dictate every aspect of your digital experience, up until the point where most code that you use will run in proprietary clouds that keep your personal data. The chips and the drivers powering your devices are trade secrets.\n Almost three years ago, I teamed up with industrial designer Ana Dantas to design an open hardware laptop. We were inspired by the possibilites of additive manufacturing, small-scale PCB production, and the early open hardware movement, as well as the growing realization that our current course of producing quickly obsoleted hardware cannot be sustained. We came up with the plan to bring back a computer that you can understand and trust a lot more than the status quo. We made a prototype of this laptop — MNT Reform — around the i.MX6 processor (similar to what bunnie and xobs had done with the Novena before). Fashion designer Greta Melnik joined us in assembling 13 beta laptops at home, most of which we sold to early supporters (thank you!). Greta is now working full-time for MNT Research, making sure that everything that we ship has a high level of quality.\n   In the end of 2018, I was in the lucky position to be able to sell off shares of a web technology company I had been involved in. I took this money to buy some manufacturing equipment and rent a real working space in the remaining part of the now-demolished Noack foundry in Berlin Friedenau. Armed with feedback from our early beta testers and countless discussions at CCC and many other events, we worked the last one and a half years, self funded, on the new MNT Reform.\n   Today, we’re launching the crowdfunding of a laptop that doesn’t have glued-in batteries, soldered-in storage or &#34;security&#34; chips that prevent you from exercising your right to repair. MNT Reform is a daring design that is as open and repairable as we could make it. It’s chunky, robust (black anodized, milled aluminum), has a mechanical keyboard and an optical trackball (or a multitouch trackpad if you want). While the CPU+RAM module is initially an off-the-shelf part (Boundary Devices Nitrogen8M), all circuit boards in the system are custom designed and open-sourced by us, including the SLA-printable mechanical parts of the trackball.\n  The system controller, input device firmware and all drivers, including 3D graphics (powered by etnaviv) are open source, too. The initial CPU of Reform, NXP i.MX8M, uses a proprietary (non-ARM) routine to calibrate the LPDDR4 memory at boot, and you have to tolerate a similar piece of code to use the optional HDMI output. But i.MX8M is the most open and best documented chip we could find for Reform, and it is not soldered in.\n Should an even more open one appear (think RISC-V), anyone can make an upgrade module for the Reform format. The CPU+RAM module uses a standard 200-pin SO-DIMM connector with an open pinout, so we or any third party can make replacement modules that give Reform different characteristics.\n We’re standing on the shoulders of the countless people who have created the free software ecosystem that allows us to ship many high-quality applications and games on Reform from day one, including Libreoffice, Inkscape 1.0, Blender 2.79, Ardour 5, Emacs, and Vim, or Firefox. We’ve made sure you can use NVMe SSDs, mPCIe Wi-Fi cards, and USB3.0 peripherals — by months of testing them for daily work.\n This computer ships with the Debian GNU/Linux (Bullseye) operating system by default, and we’re collaborating with Genode Labs to ship Genode for Reform. We would like to see all the BSDs and other free and alternative operating systems on it, too. We’re a tiny company, so we’ll need your help with that.\n  MNT Reform is not only about being open. Its highly modular approach is meant to make it more sustainable. Hopefully you’ll never need to throw one away. Instead, you’ll be able to maintain and upgrade it for more than 10 years. We invite everyone to offer compatible and alternative parts, and we publish our design files and offer support to make this easy.\n  MNT Reform DIY: which we pressed hard to keep under $1000. This is a kit of all boards and case parts that you can build your own laptop from, IKEA-style. No soldering required.\n  MNT Reform Max: the fully-loaded version with 1 TB NVMe SSD and Atheros ath9k compatible Wi-Fi card. On top, you&#39;ll get our custom black Piñatex vegan leather sleeve and a signed copy of the handbook.\n MNT Reform Motherboard: for if you want to develop software for the Reform platform or if you want to build your own hardware and/or enclosure around the Reform.\n     We can only dream about what creative uses and modifications you will come up with.", "posttime": "2020-05-08 19:59:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mnt,reform,设备", "title": "MNT改革：这场运动是现场直播的", "title_en": "MNT Reform: The Campaign Is Live", "transed": 1, "url": "https://www.crowdsupply.com/mnt/reform/updates/the-campaign-is-live", "via": "", "real_tags": ["mnt", "reform", "设备"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "孩子，当你的“我要离开这里”的文章在网上疯传的时候，你有没有得到很多意见。一些回复经常出现，值得分享。这是通过电子邮件、Twitter DM、博客评论和LinkedIn消息实现的。所有的一切都变得一团糟。\n谢谢你的好话！·我不知道世界会对一个脾气暴躁、薪水过高的极客在公共场合发脾气作何反应。世界变得令人惊讶地温暖和友好。显然我按了一个我不知道存在的热键。地球上最古怪的极客不可能不让他们的心暖和起来。因此，在许多情况下，简单地说“谢谢你的善意的话”是正确的。\n亲爱的读者：是的，这篇文章中描述的一些答案保存在编辑器缓冲区中，并通过剪切和粘贴的方式提供。但我确实读了很多信息，以及我实际回复的所有信息。\n“你能来我们的电视节目吗？”·你可以说出它的名字：ABC、BBC、彭博、CBC、CBS、CTV、CNBC、CNN、NBC、NPR，以及一大堆很酷的博客和印度。还有安德森·库珀的人！\n“我们能通个电话吗，这样我就可以问你几个问题了？”·这个主题的变体，来自非广播组织。\n他们得到的答案都是一样的：“嗯，我没那么有趣，只是个脾气暴躁的老白种人工程师，在社交媒体上占有一席之地。如果你想要报道这个故事，你应该与被解雇的真实人群一起生活，他们年轻、面容鲜艳、充满激情，而且真的是新闻故事的中心人物。我建议联系艾米丽·坎宁安(联系人信息经过编辑)或马伦·科斯塔(同样的)或克里斯·斯莫尔斯(同样的)。\n“好的，我们和他们谈过了。现在你愿意和我们现场对话吗？“·这些人很好，只是想做好他们的工作。我同意在几个案例中回答几个电子邮件问题，但大多数时候只是说，“由于复杂的原因，我不想成为这个故事的公众代言人。对不起。“。\n“复杂的原因？”·是的，这是关于解雇举报人的故事，而不是关于一位随机的加拿大杰出工程师对此的反应。因此，新闻机构应该遵循主要消息来源，而不是我。\n还有更多。我在我应该说的话上花了很多心思，然后真的花了大量的工作来写那篇博客文章。我在风格和事实核查方面得到了帮助。(谢谢，劳伦。谢谢你，艾米丽。)。我在电话或电视采访中即兴创作的任何东西都不太可能会更好。我对盖尔曼健忘症效应也有过苦涩的亲身体验。\n我想它起作用了。新闻报道缺乏其他选择，大量引用了博客中的内容，我认为基本上所有的报道都是公平和准确的。让我们承认，这种策略只适用于那些接近新闻故事中心、是一个有能力的作家，并且有一个好的发表地点的人。\n我没有兴趣成为某种全职的反亚马逊积极分子。我只是不想为解雇举报人的组织工作。我是这么说的。看起来这条信息已经传达出去了。\n“你期望得到什么样的回应？”·我有17年的博客生涯，所以我根据经验说：不知道。我有一些博客，我认为这些博客非常重要，几天来一直在苦苦钻研，就像石头一样沉了下去，没有任何踪迹。然后，我会扔掉我在看电视和喝杜松子酒时写的三段哑剧，它就会变得白热化。这两个结果都不会让我感到惊讶。\n“你想实现什么？”·我是个博客写手。十七年来，我一直在写我在这里生活的故事。有足够多的人阅读它，并做出回应，这让我希望它至少是间歇性的有趣的，甚至可能是有用的。我是个作家，我不能不写作。这是我人生中的一个重大转折点。我完全不能不写。就这样。这就是为什么。\n“布拉德的文章怎么样？”·他们问的是人们对布拉德·波特(Brad Porter)离开蒂姆·布雷(Tim Bray)的反应。因为他有和我一样的“副总裁/杰出工程师”头衔，你会认为他是同龄人。实际上，他比我过去更重要、更有影响力，部分原因是他从早期就在那里，直接参与零售运营。\n我相信(正如布拉德所说)亚马逊零售业正在紧张而明智地努力使仓库变得更安全。但我也相信工人们。不管怎么说，解雇告密者是非常非常不受限制的。\n虽然这在某种程度上是对真正问题(解雇举报人)的杂耍，但布拉德也写道：\n不过，蒂姆·布雷(Tim Bray)说的“亚马逊将仓库中的人类视为可替代的拣选和打包单元”的说法最终是完全错误的。我发现这深深地冒犯了核心。\n我们必须同意不同意见。如果您管理的组织有数十万名生产线工人和数万名经理，并且人员流失率通常很高，那么您需要员工可替换的流程。有两件事可以同时成为事实：你努力工作以保护员工的健康，而你的管理文化将他们视为可替代的单位。\n事实上，我发现对布拉德文章的回复中出现的模式比他最初的帖子更具文化趣味性。\n嘿，奖金：在对话中还有另一个亚马逊的声音：安东·奥克米安斯基，他是一名“首席工程师”，也就是说被认为是一名世界级的技术专家，蒂姆·布雷写道，他离开了亚马逊。我的想法..。它包含了一句引人注目的话：“亚马逊应该成为社会正义问题上的领导者，从而在愤怒驱动的监管执法中保持领先地位。”\n如果再有几个亚马逊人的声音参与进来，那就太好了。但我不会屏息以待。\n“有遗憾吗？”·是的，我非常后悔没有链接到艾米丽·坎宁安(Emily Cunningham)原创的“亚马逊解雇我”推文，这条推文非常精美(你必须点击“显示这个帖子”)。\n最喜欢的回答？·注意，标题不要用引号引起来，因为没有人问，但无论如何我都会回答的。我可以抛出十几个媒体重量级人物的预兆，是的，每个人都很好地发表了意见。但这并不接近，我最喜欢的是Wonkette：亚马逊副总裁蒂姆·布雷·奎特菲尔斯(Tim Bray Quitfire Self Over&#39；Chickensh*t&t&#39；Active Quitfirings)。上面写着，你那卑微的抄写员，“革命来了，让我们记住不要吃这个”和“今日班级叛徒”。这些都寄托在我认为是完全清醒和精力充沛的情况下。", "note_en": "Boy, when your  I’m-outta-here essay goes viral, do you ever get a lot of input. A few responses came up often enough to be worth sharing. This was via email, Twitter DMs, blog comments, and LinkedIn messages. All of which went completely batshit.\n  Thanks for the kind words! · I had no notion how the world might react to a cranky old overpaid geek’s public temper tantrum. The world’s been astonishingly warm and welcoming. Apparently I hit a hot button I didn’t know existed. The crankiest geek on the planet couldn’t fail to have their heart warmed. So in a huge number of cases, simply “Thanks for the kind words” was the right thing to say.\n Dear readers: Yes, some of the answers described in this piece were kept handy in editor buffers and delivered by cut-and-paste. But I did read a lot of the messages, and all the ones I actually responded to.\n “Can you come on our TV show?” · You name it: ABC, BBC, Bloomberg, CBC, CBS, CTV, CNBC, CNN, NBC, NPR, and a whole lot of cool blogs and indies. Also Anderson Cooper’s people!\n “Can we get on the phone so I can ask you some questions?” · A variation on the theme, from non-broadcast organizations.\n They all got the same answer: “Hmm, I&#39;m not that interesting, just a grumpy old one-percenter white-guy engineer with a social media presence. If you want to go live with this story you should do it with the actual people who got fired, who are young, fresh-faced, passionate, and really at the center of the news story. I recommend reaching out to Emily Cunningham (contact info redacted) or Maren Costa (same) or Chris Smalls (same).”\n “OK, we talked to them. Now will you talk to us live?” · These people were nice and just trying to do their job. I agreed to answer a couple of email questions in a couple of cases, but mostly just said “For complicated reasons, I don’t want to be the public face of this story. Sorry.”\n “Complicated reasons?” · Yeah, the story is about firing whistleblowers, not about a random Canadian Distinguished Engineer’s reaction to it. So news organizations should follow the primary sources, not me.\n There’s more. I put a lot of thought into what I should say, and then really a whole lot of work into writing that blog piece. I had help with style and fact-checking. (Thanks, Lauren. Thanks, Emily.) It is very, very, unlikely that anything I’d improvise on a phone-call or TV interview would be better. I’ve also had bitter first-hand experience with the  Gell-Mann amnesia effect.\n I think it worked. The news coverage, lacking alternatives, quoted heavily from the blog, and I thought basically all of it came out fair and accurate. Let’s acknowledge that this tactic is only available to someone who’s near the center of a news story, is a competent writer, and has a good place to publish.\n I’ve no interest in becoming some sort of full-time anti-Amazon activist. I just don’t want to work for an organization that fires whistleblowers. I said so. It looks like the message got through.\n “What response did you expect?” · I have seventeen years of blogging scars, so I speak from experience in saying: No idea. I’ve had blogs that I considered mightily important and labored over for days sink like a stone with no trace. Then I’ll toss off some three-paragraph squib that I wrote while watching TV and drinking gin, and it goes white-hot. Neither outcome would have surprised me.\n “What were you trying to accomplish?” · I’m a blogger. I’ve been writing the story of my life here for seventeen years. Enough people read it and respond to give me hope that it’s at least intermittently interesting, and perhaps even useful. I’m a writer, I can’t not write. This is a major turning point in my life. I totally couldn’t not write it. That’s all. That’s  really, really why.\n “What about Brad’s piece?” · They’re asking about  Response to Tim Bray’s departure by  Brad Porter. Since he has the same “VP/Distinguished Engineer” title I did you’d think he’d be a peer. Actually he’s way more important and influential than I used to be, partly because he’s been there since the early days and is directly involved with the retail operation.\n I believe that (as Brad says) Amazon retail is working intensely and intelligently to make the warehouses safer. But I also believe the workers. And anyhow, firing whistleblowers is just way, way out of bounds.\n While it’s sort of a sideshow to the real issue here (firing whistleblowers), Brad also wrote:\n Ultimately though, Tim Bray is simply wrong when he says “It’s that Amazon treats the humans in the warehouses as fungible units of pick-and-pack potential.” I find that deeply offensive to the core.\n We’ll have to agree to disagree. If you run an organization with hundreds of thousands of line workers and tens of thousands of managers, and where turnover is typically significant, you need processes where the staff are fungible. Two things can be true at once: You work hard to preserve your employees’ health, and your administrative culture treats them as fungible units.\n I actually found the patterns emerging in the responses to Brad’s piece more culturally interesting than his original post.\n And hey, bonus: There’s another Amazon voice in the conversation:  Anton Okmyanskiy, who’s a “Principal Engineer”, which is to say regarded as a world-class technologist, wrote  Tim Bray quit Amazon. My thoughts.... It contains the remarkable sentence “Amazon should stay ahead of anger-driven regulatory enforcement by becoming a leader on social justice issues.”\n It’d be great if a few more Amazonian voices weighed in. But I’m not holding my breath.\n “Any regrets?” · Yes, I regret intensely that I didn’t link to Emily Cunningham’s original  “Amazon fired me” tweet thread, which is exquisite (you have to click “show this thread”).\n Favorite response? · Note, header not in quotes because nobody asked, but I’ll answer anyhow. I could drop a dozen portentous media-heavyweight names and yeah, pretty well everyone weighed in. But it’s not close, my fave was Wonkette:  Amazon VP VIP Tim Bray Quitfires Self Over &#39;Chickensh*t&#39; Activist Quitfirings. It says, of yr humble scrivener, “Come the revolution, let&#39;s remember not to eat this one” and “Class Traitor of the Day”. These lodged in what I thought was a thoroughly lucid and spirited take on the situation.", "posttime": "2020-05-08 19:59:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,再见,bye,博客", "title": "论对“再见，亚马逊”的回应", "title_en": "On responses to “Bye, Amazon”", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2020/05/06/Answers", "via": "", "real_tags": ["亚马逊", "amazon", "再见", "bye", "博客"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Web应用程序的架构在很大程度上受到框架开发人员所做的设计决策的影响，无论是隐式的还是显式的。有时，人们会有意识地接受这些决策，认为它们符合预期的整体系统架构。不过，更多情况下，它们之所以被接受，仅仅是因为开发人员认为它们体现了开发实践的最新水平。\nROCA试图定义一组独立于任何特定框架、编程语言或工具的建议，这些建议体现了我们所认为的好的Web应用程序架构的原则。它的目的是作为参考，可以按原样实现，也可以与其他方法进行比较，以突出不同的设计决策。\nROCA分为两部分：服务器端和客户端架构。服务器端由REST风格的后端组成，提供人类可读的内容以及用于机器到机器通信的服务，无论是公共的还是内部的。客户端侧重于基于渐进式增强原则的JavaScript和CSS的可持续且可维护的使用。几乎每一种基本的网络技术，例如HTML或HTTP，都在追求这种技术。客户端和服务器在很大程度上相互独立，但又相辅相成。服务器应用程序遵循REST原则，即它公开一组对坐在浏览器前面的用户有意义的资源，每个资源都有自己的URI，处理请求所需的所有信息都包含在请求本身中，HTTP方法按照其定义使用，资源状态由服务器维护(无状态通信)。休息。\n用户必须能够链接到特定的信息，例如，通过从浏览器的地址栏复制地址并将其粘贴到电子邮件中、创建书签或使用任何更时髦的方式共享URI。链环。\n必须能够通过浏览器以外的用户代理(例如命令行客户端，如cURL或wget)使用服务器的逻辑。非浏览器。\n所有经过身份验证的通信都依赖于HTTP基本身份验证或摘要身份验证，通常与SSL结合使用，也可能与客户端证书结合使用。或者，由于浏览器本地身份验证的限制(例如，不注销、不设置样式)，可以将基于表单的身份验证与cookie结合使用。如果使用Cookie，它们应该包括服务器处理它们所需的所有状态，并且应该支持另一种身份验证机制用于非浏览器访问。身份验证。\nCookie不得用于身份验证、用户跟踪或安全目的(如CSRF保护)以外的其他目的。曲奇饼。\n除了对身份验证信息进行简单算法验证所需的状态之外，可能没有任何会话状态。会话\n浏览器控件(如“后退”、“前进”和“刷新”按钮)必须按预期工作。即，后退按钮应该将用户带到他们期望被带到的地方(他们使用的最后一个有意义的资源)。浏览器刷新不应该导致重新呈现登录或主页，而不是用户正在查看的页面，或者(对用户而言)希望再次提交相同数据的意外问题(当用户不记得提交任何数据时，表明错误使用了POST动词)。浏览器控件。\n服务器返回与布局信息和客户端行为无关的结构化语义HTML标记。华贵。\n它必须能够访问每个页面的信息和功能通过使用辅助工具，如屏幕阅读器。无障碍。\nCSS用于格式化和布局。这遵循渐进增强的原则，例如，允许不具备CSS3特征的浏览器仍然使用基于CSS3的站点。惯用语-CSS。\n按照渐进式增强的原则，如果禁用JavaScript，则JavaScript的使用不会引起注意，应用程序仍可用(尽管可用性和便利性会降低)。不引人注目-javascript。\n相同的功能不能在客户端(JavaScript)和服务器上冗余实现。因此，由于应用程序逻辑要求，应用程序逻辑不能驻留在客户端。无重复。\n服务器代码可能不知道客户端代码生成的HTML结构(超越CSS)，反之亦然。例外情况是服务器为初始化上述客户端功能而生成的一些定义良好的HTML结构。知识结构。\n所有JavaScript代码和CSS代码都必须是静态的，并且不能由服务器以特定于请求的资源的形式动态生成。(请注意，这并不禁止使用CoffeeScript或更低的预处理器，因为相应的代码通常是作为发布过程的一部分预编译的。)。静态资产\n客户端上由JavaScript触发的任何动态路由或URI状态修改都应该使用HTML5 History API。历史雅皮人", "note_en": "A Web application&#39;s architecture is heavily influenced by the\tdesign decisions, both implicit and explicit, that have been\tmade by framework developers. Sometimes these decisions are\tconsciously accepted as being in line with the intended overall\tsystem architecture. More often, though, they are accepted\tsimply because developers assume they embody the state of the\tart of development practices.\n ROCA is an attempt to define a set of recommendations —\tindependent of any particular framework, programming language,\tor tooling — that embodies the principles of what we consider to\tbe good web application architecture. Its purpose is to serve as\ta reference, one that can be implemented as-is or be compared to\tother approaches to highlight diverging design\tdecisions.\n ROCA splits into two parts: The  server-side and the  client-side architecture. The server-side consists of RESTful backends, serving human-readable content as well as services for machine-to-machine communication, either public or internal. The client-side focuses on a sustainable and maintainable usage of JavaScript and CSS, based on the principle of Progressive Enhancement. This technique is pursued by nearly every basic web technology, e.g. HTML or HTTP. Client and server are largely independent from, yet complement each other.  The server application adheres to\t\tREST principles, i.e. it exposes a set of\t\tresources that are meaningful to a user sitting in\t\tfront of a browser, each resource has its own URI, all\t\tof the information necessary for handling a request is\t\tcontained within the request itself, HTTP methods are used\t\tin line with their definition, and the resource state\t\tis maintained by the server (stateless\t\tcommunication).  rest\n      A user must be able to link to a specific\t\tpiece of information, e.g. by copying the address from the\t\tbrowser&#39;s address bar and pasting it into an e-mail,\t\tcreating a bookmark, or using any of the fancier ways to\t\tshare URIs.  link\n  It must be possible to use\t\tthe server&#39;s logic through user agents other than a browser,\t\te.g. a command-line client such as curl or\t\twget.  non-browser\n    All authenticated communication relies on HTTP\t\tBasic or Digest Authentication, typically combined\t\twith SSL, possibly with client\t\tcertificates. Alternatively, because of the limits of\t\tbrowser-native authentication (e.g. no logout, no\t\tstyling), form-based authentication in conjunction\t\twith cookies can be used. If cookies are used, they\t\tshould include all of the state needed for the server\t\tto process them, and another authentication mechanism\t\tshould be supported for non-browser\t\taccess.  auth\n  Cookies may not be used for purposes other than\t\tauthentication, user tracking or security purposes like CSRF protection.  cookies\n  There may not be any session state beyond\t\twhat’s needed for simple algorithmic validation of\t\tauthentication information.  session\n  The browser controls like the back, forward\t and refresh buttons must work as expected.\t I.e. the back button should take the users where they\t\texpect to be taken to (the last meaningful resource they\t\tworked with).\t\tA browser refresh should not cause a re-rendering of the login or\t\thome page instead of the page the user was looking at, or a\t\t(to the user) unexpected question about wanting to\t\tsubmit the same data again (when the user doesn&#39;t recall\t\tsubmitting any data, indicating a mis-use of the POST verb).\t\t browser-controls\n  The server returns structured semantic HTML markup that is\t\tindependent of layout information and client behavior.\t\t posh\n  It must be possible to access each page&#39;s information\t and functionality by using accessibility tools like screen readers.\t  accessibility\n  CSS is used for formatting and layout. This is done following the\t principles of  progressive enhancement, e.g. to allow\t\ta browser not capable of CSS3 features still to use a CSS3-based site.\t\t idiomatic-css\n  In line with the principles\t\tof  progressive enhancement, JavaScript is\t\tused  unobtrusively\t\tand the application remains usable (albeit with a\t\tdecrease in usability and convenience) if JavaScript is\t\tdisabled.  unobtrusive-javascript\n  The same functionality must not be implemented\t\tredundantly on both the client (JavaScript) and the server.\t\tThus, due to the  application logic\t\trequirement, application logic must not reside on the client-side.\t\t no-duplication\n  The server code may not &#34;know&#34; the\t\tHTML structures the client code generates (beyond CSS) or\t\tvice versa. Exceptions are some well defined HTML structures the server\t\tgenerates to initialize the client functionality above.\t\t know-structure\n  All JavaScript code and CSS code must be static,\t\tand must not be dynamically generated by the server in\t\ta form specific to the resource requested.\t\t(Note that this does not prohibit the use of preprocessors\t\tlike  CoffeeScript or\t\t LESS,\t\tas the respective code is usually pre-compiled as part of the release\t\tprocess.)  static-assets\n  Any dynamic routing or URI state\t\tmodification triggered by JavaScript on the client\t\tside should use the HTML5 History API.\t\t historyapi", "posttime": "2020-05-08 19:58:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "资源,oriented", "title": "面向资源的客户端体系结构", "title_en": "Resource-Oriented Client Architecture", "transed": 1, "url": "https://roca-style.org/?hnx", "via": "", "real_tags": ["资源", "oriented"]}, {"category": "", "categoryclass": "", "imagename": "c0ac95e07e86c680dd4d4838cad76b22.png", "infoid": 1001243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，数字转换机构向公众发布了COVIDSafe应用程序的源代码。任何公众都可以查看托管在GitHub存储库中的源代码。\n保护下载和使用COVIDSafe的澳大利亚人的隐私是最重要的。在推出应用程序之前，源代码经过了政府安全机构、学者和行业专家的审查。“我们正在发布应用程序代码，但为了确保个人隐私和整个系统的完整性，与COVIDSafe国家信息存储系统相关的代码将不会发布。\n现在，研究人员、开发人员、学者和公众也可以详细查看源代码。\n您可以通过电子邮件support@covidsafe.gov.au提供有关应用程序源代码的反馈。我们欢迎在应用程序发布后已经提供的反馈。\n虽然我们可能无法回复每个提供反馈的人，但请注意，您的反馈将根据其对安全性和可用性的影响进行审查和分类。\n在某些情况下，DTA可能会联系您以更深入地了解所提出的问题。\n根据标准开发和软件实践，我们正在推出应用程序的更新版本，并将根据其优先级实施设计更改。\n本周，我们推出了第一个更新，解决了社区提出的一些最常见的问题，包括：\n内容进行了更改，使该应用程序更具用户友好性。注册过程和帮助主题之间更好地协调就是一个例子。\n内容更改，以便更好地向用户解释在用户检测出病毒呈阳性时上传数据的过程。\n更改以解决该应用程序对少数Android用户造成的操作系统问题。\n像所有的应用程序一样，我们计划反复增强CoVIDSafe，我们已经有了下几个版本的计划。这些版本将侧重于进一步加强应用程序的安全性，并提高其可用性和可访问性。我们的下一次更新将在2020年5月11日开始的一周内进行。\n我们还在与苹果和谷歌合作，因为他们正在开发可以增强COVIDSafe应用程序的技术。\n有关详细信息，请访问COVIDSafe网站或访问COVIDSafe应用程序的源代码。", "note_en": "Today the Digital Transformation Agency released to the public the source code for the COVIDSafe application. Any member of the public can view the source code, which is hosted on a  GitHub repository.\n  Protecting the privacy of Australians downloading and using COVIDSafe is paramount. Prior to launching the application, the source code was reviewed by government security agencies, academics and industry specialists. We are releasing the app code, but to ensure the privacy of individuals and integrity of the overall system, the code that relates to the COVIDSafe National Information Storage System will not be released.\n  Now researchers, developers, academics and members of the public can also review the source code in detail.\n You can provide feedback about the application’s source code by emailing  support@covidsafe.gov.au. We welcome the feedback that has already been provided following the app’s launch.\n While we may be unable to reply to every individual who provides feedback, please know that your feedback will be reviewed and triaged depending on its impact to security and usability.\n In some instances, the DTA may contact you to gain a deeper understanding about the issues raised.\n  In line with standard development and software practices, we are rolling out updated releases of the application and we will implement design changes based on their priority.\n This week we rolled out the first update, which addressed some of the most common issues raised by the community, including:\n Content changes to make the app more user friendly. An example is better alignment between the registration process and help topics.\n Content changes to better explain to the user the process to upload data if a user tests positive to the virus.\n   Changes to address the app causing issues with the operating system for a small number of Android users.\n  Like all apps, we plan to iteratively enhance COVIDSafe and we already have a plan for the next couple of releases. These releases will focus on further strengthening the security of the application and improve its usability and accessibility. Our next update will occur during the week commencing 11 May 2020.\n We are also working with Apple and Google as they develop technology that could enhance the COVIDSafe application.\n Visit the  COVIDSafe website for more information or to access the source code for the COVIDSafe application.", "posttime": "2020-05-08 19:58:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,代码,app,公布,government", "title": "澳大利亚政府公布COVIDSafe应用程序源代码", "title_en": "Australian Government releases COVIDSafe application source code", "transed": 1, "url": "https://www.dta.gov.au/news/dta-publicly-releases-covidsafe-application-source-code", "via": "", "real_tags": ["程序", "代码", "app", "公布"]}, {"category": "", "categoryclass": "", "imagename": "67ecb7d1a2ee79b82258d9331e112c49.png", "infoid": 1001242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们关切地听取了错误地认为群体免疫可能“很快减缓”冠状病毒传播的声音。例如，拉什·林堡2号最近声称“加州发生了群体免疫”。作为传染病流行病学家，我们希望清楚表明，除非发生公共卫生灾难，否则2020年不会在人口水平上实现对冠状病毒的群体免疫。\n尽管全球报告了250多万例冠状病毒确诊病例，但研究表明(截至2020年4月初)任何国家人口中感染SARS-CoV-2(导致冠状病毒的冠状病毒)的比例不超过2-4%、3-5%。即使是在像纽约市这样受疫情影响最严重的热点地区，初步研究表明，到目前为止，可能有15%-21%的6.7%的人接触过这种病毒。在达到这个暴露水平的过程中，纽约市840万人中已有超过17500人死亡(约每500名纽约人中就有一人死亡)，该市的总体死亡率表明，死亡人数可能被低估了，死亡率可能会更高。8个。\n一些人接受了“控制的自愿感染”的想法，类似于20世纪80年代的“水痘聚会”。然而，冠状病毒的致死性是水痘的100倍。例如，在钻石公主号游轮上，感染SARS-CoV-2的人的死亡率为1%。参加“冠状病毒聚会”感染的人不仅会大大增加自己在下个月死亡的机会，还会让家人和朋友处于危险之中。冠状病毒现在是美国的头号死因，每天有近2000名美国人死于冠状病毒。8水痘在一年内从未导致超过150名美国人死亡。9个。\n为了达到对冠状病毒的群体免疫力，可能70%或更多的人口需要免疫。如果没有疫苗，在我们达到这一门槛之前，将有超过2亿美国人受到感染。换句话说，即使美国目前冠状病毒大流行的速度继续下去-每天有超过2.5万例确诊病例-我们也要到2021年才能达到群体免疫力。如果目前的每日死亡率继续下去，到那时将有超过50万美国人死于冠状病毒。\n当我们讨论何时以及如何分阶段重新开放时，10重要的是要了解我们仍然是多么脆弱。增加检测将有助于我们更好地了解感染范围，但很明显，这场大流行才刚刚开始。\n麦凯·H·“群体免疫力”会对冠状病毒起作用吗？福克斯新闻。https://www.foxnews.com/health/will-heard-immunity-work-against-coronavirus.。发表于2020年3月23日。访问时间为2020年4月23日。\nFlaxman S，Mishra S，Gandy A等人。报告13：估计11个欧洲国家的感染人数和非药物干预措施对冠状病毒的影响。DOI：10.25561/77731。\nBendavid E，Mulaney B，Sood N等人。加利福尼亚州圣克拉拉县冠状病毒抗体血清阳性率。MedRxiv.。2020年4月：2020.04.14.20062463。DOI：10.1101/2020.04.14.20062463\n路透社。荷兰的一项研究表明，3%的人口有冠状病毒抗体。在线邮件。https://www.dailymail.co.uk/health/article-8224915/Dutch-study-suggests-3-population-coronavirus-antibodies.html.。发表于2020年4月16日。访问时间为2020年4月23日。\n8天前RR-SW。纽约市医院有数量惊人的孕妇冠状病毒检测呈阳性。生活科学网。https://www.livescience.com/coronavirus-in-pregnant-woman-high-nyc.html.。访问时间为2020年4月23日。\n幸运的是，21%的纽约人在早期检测中发现了L.Coronavirus抗体。MarketWatch。https://www.marketwatch.com/story/early-antibody-tests-find-21-of-new-yorkers-have-had-covid-19-2020-04-23.。访问时间为2020年4月28日。\n死亡人数达到正常水平的6倍，远远超过冠状病毒计数显示的水平。纽约时报。https://www.nytimes.com/interactive/2020/04/27/upshot/coronavirus-deaths-new-york-city.html.。发表于2020年4月27日。访问时间为2020年4月28日。\n“水痘聚会”如何扭转武汉病毒的风潮。https://thefederalist.com/2020/03/25/how-medical-chickenpox-parties-could-turn-the-tide-of-the-wuhan-virus/.。访问时间为2020年4月23日。", "note_en": "We have listened with concern to voices erroneously suggesting that herd immunity may “soon slow the spread” 1 of COVID-19. For example, Rush Limbaugh 2 recently claimed that “herd immunity has occurred in California.” As infectious disease epidemiologists, we wish to state clearly that herd immunity against COVID-19 will not be achieved at a population level in 2020, barring a public health catastrophe.\n Although more than 2.5 million confirmed cases of COVID-19 have been reported worldwide, studies suggest that (as of early April 2020) no more than 2-4% 3–5 of any country’s population has been infected with SARS-CoV-2 (the coronavirus that causes COVID-19). Even in hotspots like New York City that have been hit hardest by the pandemic, initial studies suggest that perhaps 15-21% 6,7 of people have been exposed so far. In getting to that level of exposure, more than 17,500 of the 8.4 million people in New York City (about 1 in every 500 New Yorkers) have died, with the overall death rate in the city suggesting deaths may be undercounted and mortality may be even higher. 8\n Some have entertained the idea of “controlled voluntary infection,” 9 akin to the “chickenpox parties” of the 1980s. However, COVID-19 is 100 times more lethal than the chickenpox. For example, on the Diamond Princess cruise ship, the mortality rate among those infected with SARS-CoV-2 was 1%. Someone who goes to a “coronavirus party” to get infected would not only be substantially increasing their own chance of dying in the next month, they would also be putting their families and friends at risk. COVID-19 is now the leading cause of death in the United States, killing almost 2,000 Americans every day.8 Chickenpox never killed more than 150 Americans in a year. 9\n To reach herd immunity for COVID-19, likely 70% or more of the population would need to be immune. Without a vaccine, over 200 million Americans would have to get infected before we reach this threshold. Put another way, even if the current pace of the COVID-19 pandemic continues in the United States – with over 25,000 confirmed cases a day – it will be well into 2021 before we reach herd immunity. If current daily death rates continue, over half a million Americans would be dead from COVID-19 by that time.\n As we discuss when and how to phase in re-opening, 10 it is important to understand how vulnerable we remain. Increased testing will help us better understand the scope of infection, but it is clear this pandemic is still only beginning to unfold.\n  McKay H. Will “herd immunity” work against coronavirus? Fox News.  https://www.foxnews.com/health/will-heard-immunity-work-against-coronavirus. Published March 23, 2020. Accessed April 23, 2020.\n  Flaxman S, Mishra S, Gandy A, et al. Report 13: Estimating the Number of Infections and the Impact of Non-Pharmaceutical Interventions on COVID-19 in 11 European Countries.; 2020. doi:10.25561/77731\n Bendavid E, Mulaney B, Sood N, et al. COVID-19 Antibody Seroprevalence in Santa Clara County, California. medRxiv. April 2020:2020.04.14.20062463. doi:10.1101/2020.04.14.20062463\n Reuters. Dutch study suggests 3% of the population has coronavirus antibodies. Mail Online.  https://www.dailymail.co.uk/health/article-8224915/Dutch-study-suggests-3-population-coronavirus-antibodies.html. Published April 16, 2020. Accessed April 23, 2020.\n ago RR-SW 8 days. Surprising number of pregnant women at NYC hospitals test positive for COVID-19. livescience.com.  https://www.livescience.com/coronavirus-in-pregnant-woman-high-nyc.html. Accessed April 23, 2020.\n Lucking L. Coronavirus antibodies found in 21% of New Yorkers in early testing. MarketWatch.  https://www.marketwatch.com/story/early-antibody-tests-find-21-of-new-yorkers-have-had-covid-19-2020-04-23. Accessed April 28, 2020.\n Katz J, Sanger-Katz M. N.Y.C. Deaths Reach 6 Times the Normal Level, Far More Than Coronavirus Count Suggests. The New York Times.  https://www.nytimes.com/interactive/2020/04/27/upshot/coronavirus-deaths-new-york-city.html. Published April 27, 2020. Accessed April 28, 2020.\n How “Chickenpox Parties” Could Turn The Tide Of The Wuhan Virus.  https://thefederalist.com/2020/03/25/how-medical-chickenpox-parties-could-turn-the-tide-of-the-wuhan-virus/. Accessed April 23, 2020.", "posttime": "2020-05-08 19:43:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,人口,immunity,冠状病毒", "title": "2020年不会在人口水平上实现对Covid的羊群免疫", "title_en": "Herd immunity against Covid will not be achieved at a population level in 2020", "transed": 1, "url": "https://coronavirus.jhu.edu/from-our-experts/early-herd-immunity-against-covid-19-a-dangerous-misconception", "via": "", "real_tags": ["2020", "人口", "immunity", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "软件保护扩展(SGX)代表了英特尔在可信计算领域的最新进军。最初的目的是作为一种保护云计算的手段，后来它被用于生产系统中的DRM和安全密钥存储。SGX与TrustZone等竞争对手的不同之处在于，它专注于减少其“安全世界”中的可信代码量。用SGX的话说，这些安全世界被称为Enclaves，并通过内存加密引擎和一组新的CPU指令的组合来保护不受信任的代码，以强制分离。\n从第六代英特尔酷睿(Skylake)开始，几乎所有英特尔处理器上都可以使用SGX。从那以后，它经历了一段有点坎坷的旅程。在其发布后，有人对SGX被用作传播恶意软件的媒介表示担忧。还出版了一份概念证明，证明了这一做法的有效性。然后，人们对发布生产中的飞地代码所需的强制性协议感到担忧。要使用英特尔的认证服务，这是构建在SGX上的任何远程应用程序的关键支持因素，开发人员必须获得英特尔的商业许可证。这种锁定引起了相当多的恐慌，到目前为止，英特尔还没有完全解决这一问题。然后就出现了漏洞。SGX被发现容易受到缓存计时攻击、投机性执行漏洞和加载值注入攻击。这进一步侵蚀了该平台的公信力。\n这就是说，已经有相当多的项目利用SGX来强化现有的解决方案或提出迄今未见过的应用程序。在这篇文章中，我们将看三个这样的提案，看看他们是如何利用SGX的，尽管它的属性令人担忧。在适用的情况下，我们还将讨论已发现的漏洞如何影响其生存能力。\n1.英特尔公司经过时间的证明，2016年(正在积极开发中)英特尔的锯齿是Hyperledger基金会的首批项目之一，Hyperledger基金会是Linux基金会的子公司，致力于开源许可的区块链项目。与未经许可的区块链(如比特币)相比，有许可的区块链的主要吸引力之一是它们承诺更高的能源效率。由于许可网络由一组封闭的已知合作者组成，因此可以使用比工作证明更有效的协商一致机制。最初允许的项目求助于使用标准的共识算法，如PBFT和RAFT，然而，由于可伸缩性的限制，这些算法最终不适合更大的网络。\n为了克服这些限制，英特尔设计了流逝时间证明(POET)，并将其作为锯齿图的默认共识算法发布。PEET是一个基于领导者的共识算法，它依赖于SGX的安全保证。该算法相当简单，在每个块时间，每个节点执行以下步骤：\n1.每个节点使用可信功能从其SGX飞地请求超时。2.节点休眠，直到超时返回。3.返回时，可信函数随后验证超时实际上已经到期。4.节点向网络广播其验证的超时值。具有最低超时的节点被选择为引导者。\nPEET的目标是创建一种类似于工作证明的领导人选举算法，但与计算工作不同的是，这里一个实体的“投票权”与该实体控制的SGX芯片的数量成正比。原则上，这会带来巨大的运行时效率提升，因为在领导人选举过程中不会执行密集的工作。不幸的是，这项提议受到一个关键的安全经济问题的影响：这里的节点维护人员有强烈的动机闯入他们自己的SGX芯片。如果对手设法妥协他们的SGX，他们可以通过将超时设置为0在每一轮的领导人选举中获胜。网络越有价值，危害您自己平台的动机就越强。\n这不仅仅是一个理论上的问题，因为在过去的几年里，SGX已经证明了一系列的漏洞。为了在一定程度上缓解这一问题，锯齿图现在包括z-test，以检查特定节点是否过于频繁地赢得选举。当然，这并不能完全否定对手的优势，而且已经表明，尽管存在z-test，但即使只有几个被攻破的节点，对手也可以危害网络。正因为如此，我认为PEET只有在没有有动机的对手的崩溃容错设置中才有用；从锯齿图上的论坛帖子来看，这似乎也是开发人员的普遍共识。\n2.不要挖掘排队等待：公平高效的区块链共识与鲁棒轮询，Mansoor Ahmed-Rengers和Kari Kostiainen，2019年著。本文直接源于前面的讨论，旨在创建一个基于SGX的共识算法，该算法不会受到同样的安全经济问题的困扰。由于很快就会明显的原因，我们将此算法称为鲁棒轮询算法(RRR)。我们首先断言，将可信计算设备掌握在对手手中意味着我们不能依赖于飞地不会受到危害。因此，我们不依赖Enclaves来提供运行时安全保证，而只是将它们用作用于一致性(即Sybil攻击预防)的身份的门控机制。\n我们唯一依赖的SGX原语是使用英特尔证明服务(IAS)执行的远程证明。此服务使用依赖硬件密钥的报价机制来向IAS证明它是SGX平台。现在，如果对手使用非SGX系统进行尝试，尝试将会失败，因为他们将无法访问必要的密钥。另一方面，如果对手确实拥有SGX系统，则他们不会通过损害其系统而获得任何好处，因为授予的密钥和身份之间存在1对1的关系。\n一旦为节点分配了身份，它就会将其身份广播给网络上所有注册的节点。当接收到该身份时，该身份加入事件被添加到区块链中，然后该节点被认为已注册。所有节点都维护按其“挖掘年龄”排序的注册身份列表。挖掘年龄是自身份上次挖掘某个块以来经过的块数。挖掘年龄最高的10个左右的节点被认为是候选矿工。然后，所有候选挖掘器向随机抽样的对数组投票节点发送候选消息。选民选择年龄最大的候选人作为矿工，然后他将广播下一个街区。因此，在没有离线节点的情况下，我们遵循确定性的轮询领袖选择，以确保奖励的公平性。\n该协议不会遭受与POTE相同的漏洞，但它容易受到集中式IAS的危害。如果英特尔是恶意的，或者如果IAS服务器受到威胁，则不能信任门控机制。因此，本文还提出了另一种形式的门控机制，它依赖于通过工作证明的初始自举阶段。然而，这一替代版本面临着与股权证明系统相同的一些问题(最终形成垄断，新参与者不容易进入)。\n3.EnclaveDB：A Secure Database Using SGX，Christian Piebe，Kapil Vaswani和Manuel Costa在本文中，作者介绍了SGX的另一个用例：保护数据库。他们提出了EnclaveDB，这是一个使用SGX Enclaves来阻止恶意数据库管理员的数据库引擎。他们设想EnclaveDB在云计算环境中很有用，因为在云计算环境中，用户可能不信任主机来处理敏感数据。\n作者考虑了一个威胁模型，其中对手控制服务器上运行的除Enclave之外的所有代码。这包括磁盘和网络I/O。它们不允许物理攻击，并假定SGX的内存保护保证有效。他们的目标是提供一个内存中的数据库，保证机密性、完整性和新鲜性，同时对性能影响很小。他们通过将数据库系统拆分成客户端和服务器端组件来实现这一目标。客户端负责存储数据库加密密钥以及建立到服务器端飞地的可信连接的密钥管理服务。\n在服务器端，EnclaveDB有两个组件：不受信任的SQL服务器和受信任的Enclave。SQL服务器可以对公共的、非敏感的数据执行查询。它还负责代表Enclave接收请求并调用Enclave内的存储过程。Enclave包含一个Hekaton内存数据库以及一组编译的查询。这些查询在客户端编译，然后加载到Enclave上，从而通过不需要将通用查询处理器加载到Enclave来减少攻击面。不幸的是，这还需要数据库模式中的任何更改都需要重新部署Enclave代码。实际的事务处理遵循Hekaton和主机之间相当简单的两阶段提交协议。\n系统设计的问题之一是在事务处理协议中使用SGX的单调计数器来防止回滚攻击。已经证明，在永久烧毁之前，这些设备仅支持有限数量的写入。这使他们的解决方案的有效性受到质疑，因为数据库维护人员可能希望从他们的服务器获得长时间的运行时间。作者建议采取部分缓解措施。", "note_en": "Software Guard eXtensions (SGX) represents Intel’s latest foray into trusted computing. Initially intended as a means to secure cloud computation, it has since been employed for DRM and secure key storage in production systems. SGX differs from its competitors such as TrustZone in its focus on reducing the volume of trusted code in its “secure world”. These secure worlds are called enclaves in SGX parlance and are protected from untrusted code by a combination of a memory encryption engine and a set of new CPU instructions to enforce separation.\n SGX has been available on almost every Intel processor since the sixth generation of Intel Core (Skylake). It has had a bit of a rocky journey since. Upon its release, there were concerns expressed about SGX being used as a medium for malware dissemination. A proof of concept demonstrating the effectiveness of this was also  published. Then there were concerns about the mandatory agreements required to publish enclave code in production. In order to use Intel’s attestation service, a key enabler for any remote application built on SGX, developers have to obtain a commercial license from Intel. This lock-in raised a fair bit of consternation and to date hasn’t been  fully addressed by Intel. Then came the vulnerabilities. SGX was found to be vulnerable to  cache timing attacks,   speculative execution vulnerabilities and to  Load Value Injection attacks. This has further eroded the credibility of the platform.\n That said, there have been a fair few projects that have utilized SGX either to harden existing solutions or to come up with hitherto unseen applications. In this post, we’ll look at three such proposals to see how they utilize SGX despite its concerning attributes. Where applicable, we will also talk about how the discovered vulnerabilities have affected their viability.\n  1.   Proof of Elapsed Time by Intel Corporation, 2016 (and under active development) Intel’s Sawtooth was one of the first projects in the Hyperledger Foundation, a Linux Foundation subsidiary dedicated to open source permissioned blockchain projects. One of the main appeals of permissioned blockchains versus permissionless blockchains (such as Bitcoin) is their promise of better energy efficiency. Since permissioned networks consist of a closed set of known collaborators, it is possible to use more efficient consensus mechanisms than Proof of Work. Initial permissioned projects resorted to using standard consensus algorithms such as PBFT and Raft, however, these turned out to be unsuitable for larger networks due to scalability restrictions.\n To overcome these restrictions, Intel designed Proof of Elapsed Time (PoET) and released it as the default consensus algorithm for Sawtooth. PoET is a leader-based consensus algorithm that relies on SGX for its security guarantees. The algorithm is fairly simple, at each block time every node performs the following steps:\n 1. Each node requests a timeout from its SGX enclave using a trusted function. 2. Node sleeps until the timeout returns. 3. Upon return, a trusted function then verifies that the timeout has actually expired. 4. Node broadcasts its verified timeout value to the network. The node with the lowest timeout is selected as the leader.\n The goal of PoET was to create a leader election algorithm akin to Proof of Work but instead of computational work, the “voting power” of an entity here is proportional to the number of SGX chips that that entity controls. In principle, this leads to massive runtime efficiency gains since no intensive work is performed as part of the leader election. Unfortunately, this proposal suffers from a critical security economics issue: node maintainers here have a strong incentive to break into their own SGX chips. If an adversary managed to compromise their SGX, they could win the leader election at every round by setting the timeout to 0. The more valuable the network, the stronger the incentive to compromise your own platform.\n This isn’t just a theoretical concern since a whole host of vulnerabilities have been demonstrated for SGX in the last couple of years. In order to mitigate this to some degree, Sawtooth now includes z-test to check if a particular node is winning elections too frequently. Of course, this doesn’t negate the adversary’s advantage completely and it  has been shown that even with a handful of compromised nodes the adversary can compromise a network, z-test notwithstanding. Because of this, I would consider PoET to only be useful in crash fault tolerant settings where there are no motivated adversaries; this also seems to be the general consensus among developers judging by forum posts on Sawtooth.\n 2.   Don’t Mine Wait In Line: Fair and Efficient Blockchain Consensus with Robust Round Robin by Mansoor Ahmed-Rengers and Kari Kostiainen, 2019 This paper follows directly from the preceding discussion and aims to create an SGX-based consensus algorithm that doesn’t suffer from the same security economics issues.  For reasons that will be obvious soon, we call this algorithm Robust Round Robin (RRR). We start off by asserting that having the trusted computing device in the adversary’s possession implies that we cannot rely on the enclaves not being compromised. Thus, we do not rely on the enclaves for runtime security guarantees, rather we only use them as a gating mechanism for identities used for consensus (i.e.,  sybil attack prevention).\n The only SGX primitive we rely on is the remote attestation performed with the Intel Attestation Service (IAS). This service uses a quoting mechanism that relies on a hardware key to prove to the IAS that it is an SGX platform. Now, if an adversary uses a non-SGX system to attempt this, the attempt will fail since they will not have access to the requisite key. On the other hand, if the adversary does have possession of an SGX system, they do not gain anything by compromising their system since there is 1-to-1 relation between keys and identities granted.\n Once a node is assigned an identity, it broadcasts its identity to all the enrolled nodes on the network. Upon receipt of this identity, this identity joining event is added to the blockchain and the node is then said to be enrolled. All nodes maintain the list of enrolled identities ordered by their “mining age”. The mining age is the number of blocks that have elapsed since an identity last mined a block. The ten or so nodes with the highest mining ages are considered to be candidate miners. All the candidate miners then send a candidate message to a logarithmic set of randomly sampled voting nodes. The voters pick the oldest candidate as the miner who then broadcasts the next block. Thus, in the absence of offline nodes we follow a deterministic round robin leader selection which ensure fairness of rewards.\n This protocol does not suffer the same vulnerabilities as PoET but it is susceptible to a compromise of the centralized IAS. If Intel is malicious or if the IAS servers are compromised then the gating mechanism cannot be trusted. An alternative version of the gating mechanism that relies on an initial bootstrapping phase via Proof of Work is therefore also presented in the paper. This alternative version, however, suffers from some of the same problems that Proof of Stake systems suffer from (eventual monopolies and lack of easy entry for new participants).\n 3.   EnclaveDB: A Secure Database Using SGX by Christian Piebe, Kapil Vaswani and Manuel Costa In this paper, the authors present a different use case for SGX: securing databases. They propose EnclaveDB, a database engine that uses SGX enclaves to thwart malicious database administrators. They envision EnclaveDB being useful in cloud computing settings where users may not trust the host with sensitive data.\n The authors consider a threat model where the adversary controls all code running on the server except for the enclave. This includes disk and network I/O. They do not allow physical attacks and assume that SGX’s memory protection guarantees hold. Their goal is to provide an in-memory database that guarantees confidentiality, integrity and freshness with a small performance impact. They achieve this goal by splitting the database system into client-side and server-side components. The client side is responsible for storing a database encryption key as well as a key management service that establishes trusted connections to the server side enclave.\n On the server side, EnclaveDB has two components: the untrusted SQL server and a trusted Enclave. The SQL server can perform queries on public, non-sensitive data. It is also responsible for receiving requests on behalf of the enclave and invoking stored procedures within the enclave. The enclave contains a Hekaton in-memory database along with a set of compiled queries.  These queries are compiled on the client side and then loaded on to the enclave thus reducing the attack surface by not requiring a general query processor to be loaded into the enclave. Unfortunately this also entails that any changes in the database schema would require redeploying the enclave code. The actual transaction processing follows a fairly simple two-phase commit protocol between Hekaton and the host.\n One of the issues with the system design is the use of SGX’s monotonic counters in the transaction processing protocol to prevent rollback attacks. These have been shown to support only a limitted number of writes before  permanently burning out. This calls into question the validity of their solution since database maintainers would presumably expect long run-times from their servers. The authors suggest a partial mitigation for this but this does not fully address the concern. More seriously, it appears to me that EnclaveDB is vulnerable to the aforementioned cache timing attacks revealed on SGX. It also appears that there isn’t much that can be done about this by way of implementation mitigations either without upstream fixes to SGX. Proposals such as  Varys have, however, provided promising avenues for these fixes.    Conclusion Intel SGX has its issues: vulnerabilities and archaic lock-in policies by Intel being the foremost ones. That said, it is the most accessible, widely deployed trusted computing framework for desktop and server-side developers. This wide availability is a key contributor to the large amounts of research being done on SGX. Moreover, as RRR demonstrates, it is possible to use SGX to gain integrity assurances despite the discovered vulnerabilites. Lastly, I expect SGX to see more widespread adoption as a relatively low cost defense-in-depth mechanism. Yes, there are vulnerabilities but using SGX nevertheless represents an additional hurdle for any potential adversary. If security economics has taught us anything, it is that introducing that hurdle can only be a good thing.", "posttime": "2020-05-08 19:43:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,sgx", "title": "英特尔SGX有什么好处？", "title_en": "What's Intel SGX Good For?", "transed": 1, "url": "https://www.lightbluetouchpaper.org/2020/05/07/three-paper-thursday-whats-intel-sgx-good-for/", "via": "", "real_tags": ["英特尔", "sgx"]}, {"category": "", "categoryclass": "", "imagename": "10c030b2429f801a5aed8756bdece9d2.jpg", "infoid": 1001240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust团队发布了Rust的新版本1.43.1。Rust是一种编程语言，它使每个人都能够构建可靠而高效的软件。\n如果您通过Rustup安装了以前版本的Rust，则获取Rust 1.43.1与以下操作一样简单：\n如果您还没有，您可以从我们网站的相应页面获取概要信息，并在GitHub上查看1.43.1的详细发行说明。\nRust1.43.1解决了1.43.0稳定版本中引入的两个回归问题，并更新了Cargo使用的OpenSSL版本。\nRust 1.27.0引入了对在标准库中检测x86CPU特性的支持，这要归功于IS_x86_FEATURE_DETECTED！宏。由于内部重构，Rust1.43.0阻止了对还不能在稳定(如AVX-512)上使用的功能的检测，即使在过去允许检测它们。Ruust 1.43.1修复了这种回归。有关回归的更多信息，请参见71473期。\nRust 1.43.0打破了对列出随Cargo一起发布的包中文件的支持，当这些文件位于具有路径依赖关系或未发布版本的工作区中时。该问题的修复包含在Rust 1.43.1中。有关该漏洞的更多信息可在货物问题#8151中获得。\n货物的依赖之一OpenSSL最近发布了一份安全建议。不幸的是，我们没有及时包含Rust1.43.0的补丁，所以我们在Rust1.43.1中升级了OpenSSL。我们没有证据表明此漏洞会危及货运用户的安全(如果有，请遵循我们的安全策略)。\n许多人聚集在一起创造了铁锈1.43.1。如果没有你们所有人，我们不可能做到这一点。谢谢!", "note_en": "The Rust team has published a new point release of Rust, 1.43.1.Rust is a programming language that is empowering everyone to build reliable and efficient software.\n If you have a previous version of Rust installed via rustup, getting Rust 1.43.1 is as easy as:\n  If you don&#39;t have it already, you can  get  rustup from theappropriate page on our website, and check out the  detailed release notes for1.43.1 on GitHub.\n  Rust 1.43.1 addresses two regressions introduced in the 1.43.0 stable release, and updates the OpenSSL version used by Cargo.\n  Rust 1.27.0 introduced support for detecting x86 CPU features in the standard library, thanks to the   is_x86_feature_detected! macro. Due to an internal refactoring, Rust 1.43.0 prevented the detection of features that can&#39;t be used on stable yet (such as AVX-512), even though detecting them was allowed in the past. Rust 1.43.1 fixes this regression. More information on the regression in available in  issue #71473.\n  Rust 1.43.0 broke support for listing the files included in packages published with Cargo, when inside a workspace with path dependencies or unpublished versions. A fix for the issue is included in Rust 1.43.1. More information on the bug is available in  Cargo issue #8151.\n  OpenSSL, one of the dependencies of Cargo, recently released a  security advisory. Unfortunately we were not able to include the fix in time for Rust 1.43.0, so we upgraded OpenSSL in Rust 1.43.1. We have no evidence this vulnerability could compromise the security of Cargo users (if you do,  please follow our security policy).\n  Many people came together to create Rust 1.43.1.We couldn&#39;t have done it without all of you.  Thanks!", "posttime": "2020-05-08 19:43:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈", "title": "铁锈1.43.1", "title_en": "Rust 1.43.1", "transed": 1, "url": "https://blog.rust-lang.org/2020/05/07/Rust.1.43.1.html", "via": "", "real_tags": ["rust", "铁锈"]}, {"category": "", "categoryclass": "", "imagename": "161f2a05438d8c7fe517e97346722453.png", "infoid": 1001239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员共同工作的家园。加入他们，发展您自己的开发团队，管理权限，并在项目中进行协作。\n报名", "note_en": "GitHub is home to over 50 million developers working together. Join them to grow your own development teams, manage permissions, and collaborate on projects.\n  Sign up", "posttime": "2020-05-08 19:28:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covidsafe,发展", "title": "CoVIDSafe", "title_en": "COVIDSafe", "transed": 1, "url": "https://github.com/AU-COVIDSafe", "via": "", "real_tags": ["covidsafe", "发展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国能源部科技信息办公室", "note_en": "The U.S. Department of Energy's Office of Scientific and Technical Information", "posttime": "2020-05-08 19:28:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,电子产品,electronics,科技", "title": "老式电子产品，可进行可靠的辐射测量", "title_en": "Vintage electronics for trusted radiation measurements", "transed": 1, "url": "https://www.osti.gov/servlets/purl/1616454", "via": "", "real_tags": ["rust", "电子产品", "科技"]}, {"category": "", "categoryclass": "", "imagename": "ee9eaba91da8cf4be9d3c909b1046c5b.jpg", "infoid": 1001237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个科技发达、资讯易得的年代，我们的学校仍然期望我们从书本上知道一切，而不考虑这是否我们在专业发展方面真正需要的。\n有多少次，你想知道你是否需要因为课程规定而需要学习的科目？芬兰已经决定改变他们教育系统中的这一点，引入一些适合21世纪的东西。\n到2020年，芬兰将通过教育引入一种不同的生活方式，而不是物理、数学、文学、历史或地理课程。欢迎来到基于现象的学习！\n正如现象教育在其网站上所说，“在基于现象的学习(PhenoBL)和教学中，整体的现实世界现象提供了学习的起点。这些现象是作为完整的实体，在它们的真实背景下研究的，与它们相关的信息和技能是通过跨越学科之间的边界来研究的。“。\n这意味着，学生将有机会从他们真实环境和世界的现象中选择，而不是为了学习而学习物理(或任何其他学科)，如媒体和技术，或欧盟。\n这些现象将通过跨学科的方法进行研究，这意味着学科将被包括在内，但只包括那些(而且只是其中的一部分)有助于在该主题中出类拔萃的学科。\n例如，想要学习职业课程的学生可以参加“自助餐厅服务”，并将通过数学、语言、写作和沟通技能等元素来研究这一现象。另一个例子是欧盟，它将包括经济、语言、地理和相关国家的历史。\n现在以你的职业为例，想一想你需要知道的所有与之相关的信息--你现在正在以PhenoBL的方式思考！\n这种学习将包括面对面和在线会议，强调通过电子学习过程对技术和互联网的有益利用。你可以在这里阅读更多关于它的信息。\n在学习过程中，学生将能够通过共享信息和集体探索和实施新信息作为构建工具，与他们的同龄人和老师合作。\n传统的以教师为中心的学习方式，学生坐在桌子后面，记录老师的每一节课，这种方法将改变为整体的水平。这意味着，每一种现象都将以最合适和最自然的方式来处理。\n然而，正如现象学习所说的那样，“基于现象的教学的出发点是建构主义，在建构主义中，学习者被视为积极的知识建构者，信息被视为解决问题的结果，从‘小块’构建成适合当时使用情况的整体。”\n这种教育系统倾向于在协作环境中学习(例如团队合作)，他们希望看到信息是在社会环境中形成的，而不是仅仅被视为个人的内部要素。\n这种方法将支持基于探究的学习、问题解决以及项目和档案袋学习。最后一步将是实际执行，被视为整个过程的结果。\n这项改革将需要不同学科的教师之间的大量合作，这就是为什么教师们已经在接受密集的培训。\n事实上，赫尔辛基70%的教师已经参与了符合新制度的准备工作。\n合作教学是课程创建的基础，来自多个学科专家的意见，接受这种新教学方式的教师将获得小幅加薪，以示认可。\n从教学的角度来看，这种风格对教师来说也是非常有价值的。一些已经在工作中实施了这种作风的教师表示，他们不能走回头路。\n这实在不足为奇，因为这种教学方式的互动是每个老师梦寐以求的。\n目前，学校有义务每年至少引入一段时间的基于现象的学习。计划是到2020年完全实施PhenoBL方法。\n学前教育部门正在使用一种类似的方法，称为游戏性学习中心，它将作为基于现象的学习的起点。\n一位拥有十多年不间断写作技巧的专业作家。她感兴趣的话题和专业知识范围从心理学到各种学科，如科学和新闻。", "note_en": "In an era of technology and easily accessible information, our schools still expect from us to know everything from the books, without considering whether this is going to be what we will actually need in our professional development.\n How many times have you wondered if you were going to need subjects you were made to learn because the curriculum said so? Finland has decided to change this in their educational system and introduce something which is suitable for the 21st century.\n  By 2020, instead of classes in physics, math, literature, history or geography, Finland is going to introduce a different approach to life through education. Welcome to the phenomenon based learning!\n As  Phenomenal Education states on their website, “In Phenomenon Based Learning (PhenoBL) and teaching, holistic real-world phenomena provide the starting point for learning. The phenomena are studied as complete entities, in their real context, and the information and skills related to them are studied by crossing the boundaries between subjects.”\n This means that instead of learning physics (or any other subject) for the sake of learning it, the students will be given the opportunity to choose from phenomena from their real surroundings and the world, such as Media and Technology, or the European Union.\n These phenomena will be studied through an interdisciplinary approach, which means subjects will be included, but only those (and only parts of them) that contribute to excelling in the topic.\n For example, a student who wants to study a vocational course can take “cafeteria services” and the phenomenon will be studied through elements of maths, languages, writing and communication skills. Another example is the European Union, which would include economics, languages, geography and the history of the countries involved.\n Now take your profession as an example and think of all the information you need to know connected to it – you are now thinking the PhenoBL way!\n This kind of learning will include both face-to-face and online sessions, with a strong emphasis on the beneficial use of technology and the Internet through the process of eLearning. You can read more about it  here.\n In the learning process, the students will be able to collaborate with their peers and teachers through sharing information and collectively exploring and implementing new information as a building tool.\n   Instead of the traditional style of teacher-centered learning, with students sitting behind their desks and recording every instruction given by the teacher, the approach is going to change to a holistic level. This means that every phenomenon will be approached in the most suitable and natural way possible.\n However, as Phenomenal Learning states, “The starting point of phenomenal-based teaching is constructivism, in which learners are seen as active knowledge builders and information is seen as being constructed as a result of problem-solving, constructed out of ‘little pieces’ into a whole that suits the situation in which it is used at the time.”\n This educational system tends to include leaning in a collaborative setting (e.g. teamwork), where they would like to see information being formed in a social context, instead of it being seen only as an internal element of an individual.\n This approach is going to support inquiry-based learning, problem-solution and project and portfolio learning. The last step is going to be practical implementation, being seen as the outcome of the whole process.\n This reform is going to require a lot of cooperation between teachers of different subjects and this is why the teachers are already undergoing an intense training.\n In fact, 70% of the teachers in Helsinki are already involved in the preparatory work in line with the new system.\n Co-teaching is at the base of the curriculum creation, with input from more than one subject specialist and teachers who embrace this new teaching style will receive a small increase in their salary as a sign of recognition.\n From a teaching perspective, this style is very rewarding and worthwhile for the teachers too. Some teachers, who have already implemented this style in their work, say that they cannot go back to the old style.\n This is indeed not surprising at all, as the interaction in this teaching style is something every teacher has always dreamed of.\n Currently, schools are obliged to introduce a period of phenomenal-based learning at least once a year. The plan is to completely implement the PhenoBL approach by 2020.\n A similar approach called the Playful Learning Centre is being used in the pre-school sector and it is going to serve as a starting point for the phenomenal-based learning.\n     A professional writer with over a decade of incessant writing skills. Her topics of interest and expertise range from psychology, to all sorts of disciplines such as science and news.", "posttime": "2020-05-08 18:58:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放弃,abandons,学习", "title": "芬兰放弃学校科目，转而支持基于现象的学习", "title_en": "Finland abandons school subjects in favour of phenomenon based learning", "transed": 1, "url": "https://curiousmindmagazine.com/goodbye-subjects-finland-taking-revolution-education-step/", "via": "", "real_tags": ["放弃", "abandons", "学习"]}]