[{"category": "", "categoryclass": "", "imagename": "8db98d1aa2c26b450adc28110b844dd4.jpg", "infoid": 1015817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周日下午，一艘略微烧焦的宇宙飞船从蓝天坠落，坠入平静的墨西哥湾。NASA宇航员道格·赫尔利(Doug Hurley)和鲍勃·本肯(Bob Behnken)从轨道安全返回，为近64天的任务画上了句号，这项任务证明了SpaceX，Crew Dragon建造的一艘新航天器的可行性。这是一次圆满的成功。\nSpaceX公司总裁兼首席运营官格温·肖特威尔(Gwynne Shotwell)在飞行后的新闻发布会上说，这是不寻常的一天。在几个月的焦虑之后，这是一个巨大的解脱。\nNASA和SpaceX现在将密切研究在这次试飞中收集的数据，基于这些分析，“乘员龙”运载火箭很可能获得国际空间站作战任务的认证。这些任务中的第一次可能最快在9月下旬到来，届时美国国家航空航天局(NASA)的三名宇航员和日本宇航员将开始为期六个月的在轨工作。\n今年夏天，“龙”的试飞结束了NASA在载人航天能力上长达九年的差距。自2011年7月以来，航天局一直依靠俄罗斯的联盟号飞船将宇航员送到空间站。现在，美国国家航空航天局有了自己的交通工具。在接下来的一年内，美国的第二架飞行器--波音公司的“星际客机”也将与三名宇航员一起进行首次试飞。希望以后再也不会有这样的差距。\n美国宇航局局长吉姆·布里登斯廷(Jim Bridenstine)说，我们正在进入一个太空飞行的新时代，他一直支持公私合作，以利用NASA的技术诀窍和私营行业的驱动力来推动航天事业向前发展。商业船员计划确实证明了我们如何前进的商业模式，以及我们如何做比以往任何时候都更多的事情。\n周六晚上，“龙”从空间站脱离，然后花了大约19个小时进行了一系列a阶段燃烧，以便排队等待重返大气层降落在墨西哥湾。NASA和SpaceX在佛罗里达州周围有七个地点可供选择，由于热带风暴伊萨亚斯沿着该州大西洋一侧的路径，他们选择了墨西哥湾一侧。\n墨西哥湾的天气再平静不过了，风几乎静止，海面风平浪静。被赫尔利和本肯命名为奋进号的机组人员龙飞船，在返回大气层的非常高的温度下继续进行，在此期间，等离子体阻止了大约6分钟的通信。但在这次停电后，航天器毫发无损地进入了较低的大气层，打开了减速伞，紧随其后的是电源，然后平稳地溅落下来。\n机组操作负责工程师迈克·海曼(Mike Heiman)通过无线电向机组人员打趣地说，欢迎回到地球，感谢你驾驶SpaceX。\nSpaceX和NASA在将航天器移到Go Navigator回收船上后，提前了他们的时间表。然而，就在舱门打开之前，技术人员注意到四氧化二氮的含量略高于正常水平，四氧化二氮是一种氧化剂，有助于为太空中的推进器提供动力。尽管机组人员本可以安全撤离，但公司和航天局花了时间来净化烟雾。\n然后，宇航员们准备好在两个多月后呼吸地球上的空气。就在他离开飞船之前，赫尔利祝贺SpaceX完成任务，并感谢他们的奉献。他说，任何触摸过奋进号的人都应该花点时间珍惜这一天，特别是考虑到今年发生的所有事情。\n回到SpaceX总部，他们正在珍惜这一天。在加利福尼亚州的任务控制室内，在机组人员安全离开飞船后，他们开了香槟。肖特维尔说：“我们应该把这当作一个跳板，与阿耳特弥斯·普罗甘姆一起做更难的事情，然后再去火星。”", "note_en": "On Sunday afternoon a slightly charred spacecraft dropped out of the blue sky, and splashed down into a placid Gulf of Mexico. The safe return of NASA astronauts Doug Hurley and Bob Behnken from orbit capped a nearly 64-day mission that proved the viability of a new spacecraft built by SpaceX, Crew Dragon. It was a complete success.\n &#34;This was an extraordinary day,&#34; said Gwynne Shotwell, president and chief operating officer of SpaceX, during a post-flight news conference. &#34;It was an enormous relief after months of anxiety.&#34;\n NASA and SpaceX will now closely study data collected during this test flight, and based upon this analysis the Crew Dragon vehicle will likely be certified for operational missions to the International Space Station. The first of those missions may come as soon as late September, when three NASA astronauts and on Japanese astronaut are due to begin a six-month stint in orbit.\n  This summer&#39;s test flight of Dragon brings to a close a nine-year gap in human spaceflight capability at NASA. Since July, 2011, the space agency has relied on Russian Soyuz spacecraft to get its astronauts to the space station. Now, NASA has its own transportation. Within the next year a second U.S. vehicle, Boeing&#39;s Starliner, should also make its first test flight with three astronauts. Hopefully, there will never be such a gap again.\n &#34;We are entering a new era of spaceflight,&#34; said NASA Administrator Jim Bridenstine, who has supported public-private partnerships to leverage NASA know-how and the drive of private industry to push spaceflight forward. &#34;The Commercial Crew Program has really just proven the business model for how we go forward, and how we do more than we’ve ever been able to do before.&#34;\n  Dragon undocked from the space station on Saturday night and then spent about 19 hours performing a series a phasing burns to line up for a reentry to land in the Gulf of Mexico. NASA and SpaceX had the choice of seven locations around the state of Florida, and chose the Gulf side due to the track of Tropical Storm Isaias along the Atlantic side of the state.\n The weather in the Gulf could not have been more sedate, with nearly stationary winds and calm seas. The Crew Dragon spacecraft, named  Endeavour by Hurley and Behnken, carried on through the very high temperatures of atmospheric return, during which plasma prevented communication for about six minutes. But after this blackout the spacecraft emerged into the lower atmosphere unscathed, popped its drogue parachutes, followed by its mains, and then a smooth splashdown.\n &#34;Welcome back to planet Earth and thanks for flying SpaceX,&#34; quipped Mike Heiman, Crew Operations Responsible Engineer, over the radio to the crew.\n SpaceX and NASA were ahead of their timeline after moving the spacecraft onto the  GO Navigator recovery ship. However, just before hatch opening, technicians noted slightly above normal levels of dinitrogen tetroxide, an oxidizer that helps power thrusters in space. Although the crew could have egressed safely, the company and space agency took the time to purge the fumes.\n  And then, the astronauts were ready to breathe air on planet Earth after more than two months. Just before he departed the spacecraft, Hurley congratulated SpaceX on the mission, and thanked them for their dedication. He said, &#34;Anybody who has touched  Endeavour should take a moment to cherish this day, especially given all of the things that have happened this year.&#34;\n Back at SpaceX headquarters, they were cherishing this day. Inside the mission control room in California, they popped champagne after the crew safely emerged from the spacecraft. &#34;We should think about this as a springboard to doing even harder things, with the Artemis Prorgam, and then moving on to Mars,&#34; Shotwell said.", "posttime": "2020-08-03 06:48:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,太空,nasa,飞行,flight", "title": "在一次精彩的飞行测试之后，美国国家航空航天局现在有了一次新的太空之旅。", "title_en": "After a splendid flight test, NASA now has a new ride to space", "transed": 1, "url": "https://arstechnica.com/science/2020/08/after-a-splendid-flight-test-nasa-now-has-a-new-ride-to-space/", "via": "", "real_tags": ["美国", "太空", "nasa", "飞行", "flight"]}, {"category": "", "categoryclass": "", "imagename": "1c9d152f0516497962f218fc38bc294d.jpg", "infoid": 1015816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "介绍开放Amiga采样器-一个负担得起的，开源的，8位/单声道，并行端口采样器的海军准将Amiga具有立体声混频和输入...", "note_en": "Introducing the Open Amiga Sampler - an affordable, open-source, 8-bit/mono, parallel port sampler for the Commodore Amiga featuring stereo mixdown and an in...", "posttime": "2020-08-03 06:44:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,硬件,amiga", "title": "打开Amiga采样器-新的Amiga硬件发布", "title_en": "Open Amiga Sampler – New Amiga Hardware Announcement", "transed": 1, "url": "https://www.youtube.com/watch?v=X3AKhhrNjcA", "via": "", "real_tags": ["发布", "硬件", "amiga"]}, {"category": "", "categoryclass": "", "imagename": "3ef20f60f341dea4bd92abc47188482e.jpg", "infoid": 1015814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "凭借其1亿个神经元，肠道赢得了身体“第二大脑”的美誉-与真正的大脑相对应，管理肠道肌肉活动和酶分泌等事情。越来越多的科学家现在正试图了解肠道神经元是如何与其大脑同行相互作用的，以及这一过程中的失败可能会如何导致疾病。现在，新的研究表明，肠道细菌在这些神经元通讯中起着直接作用，决定了肠道运动的速度。这项在老鼠身上进行并发表在“自然”杂志上的研究表明，我们的神经系统和微生物区系之间存在着显著程度的沟通。它也可能对治疗胃肠道疾病有影响。洛克菲勒大学副教授兼粘膜免疫学实验室主任丹尼尔·穆奇达说：“我们描述了微生物如何调节始于肠道、进入大脑、再回到肠道的神经元回路。”“我们描述了微生物如何调节始于肠道、进入大脑、再回到肠道的神经元回路”，洛克菲勒的副教授兼粘膜免疫学实验室主任丹尼尔·穆奇达(Daniel Mucida)说。“这个回路中的一些神经元与肠易激综合征有关，因此这个回路的失调有可能导致肠易激综合征。”这项工作由穆奇达实验室的前研究生保罗·A·穆勒(Paul A.Muller)领导。\n为了了解中枢神经系统如何感知肠道内的微生物，穆齐达和他的同事们分析了完全缺乏微生物的小鼠的肠道连接神经元，即所谓的无菌小鼠，这些小鼠从出生就在隔离的环境中长大，只吃经过彻底消毒的食物和水。他们发现，一些肠道连接的神经元在无菌小鼠中比对照组更活跃，并高水平表达一种名为CFOS的基因，这是神经元活动的标志。神经元活动的增加反过来会导致食物在老鼠消化道中的移动速度比往常更慢。当研究人员用一种能使这些肠道神经元沉默的药物治疗无菌小鼠时，他们看到肠道运动加快。目前尚不清楚神经元如何感知肠道微生物的存在，但穆齐达和他的同事们发现，关键可能是由肠道细菌产生的一组名为短链脂肪酸的化合物。他们发现，小鼠肠道中这些脂肪酸的水平较低，与肠道连接神经元的活动较大有关。当他们提高动物肠道中这些化合物的水平时，它们肠道神经元的活性就会降低。其他随微生物区系变化的微生物化合物和肠道激素也被发现调节神经元的活动，这表明这一回路中有更多的参与者。然而，进一步的实验揭示了一个难题。科学家们发现，在没有微生物的情况下，这种特殊类型的肠道连接神经元并没有延伸到肠子暴露的表面，这表明它们无法直接感觉到脂肪酸水平。因此，穆齐达和他的同事们决定反向追踪这一电路，并发现了一组脑干神经元，这些神经元在无菌小鼠中显示出活动增加。当研究人员操纵对照组小鼠来特异性激活这些相同的神经元时，他们看到肠道神经元的活动增加，肠道运动减少。研究人员继续向后研究，接下来将他们的注意力集中在从肠道向脑干发送信号的感觉神经元上。他们的实验显示，这些感觉神经元延伸到肠道区域的界面，这些区域暴露在包括脂肪酸在内的高水平微生物化合物中。他们关闭了这些神经元，以模拟缺乏脂肪酸或相关肠道信号的无菌小鼠的情况，并观察了脑干中激活的神经元，以及控制肠道运动的肠道神经元的激活。穆齐达说：“我们追踪了整个环路，发现肠外的神经元可以由肠内发生的事情控制。”“这里发现的回路可能参与了额外的肠道-大脑双向相互作用，这可能会影响几种肠道和神经疾病，包括肠易激综合征(IBS)，甚至行为异常。”Muller等人的研究成果。(2020)。微生物区系通过肠脑回路调节交感神经元。大自然。Doi：https://doi.org/10.1038/s41586-020-2474-7本文是从以下材料重新发布的。注意：材料的长度和内容可能已经过编辑。欲了解更多信息，请联系引用的消息来源。\n国际新闻组织的专家对重症新冠肺炎患者使用瑞德韦尔提出了一个微弱的建议，建议继续招募患者参加瑞德韦尔正在进行的临床试验，以便能够收集更多的数据。\n多读。\nJulich-Brain是第一个以微观分辨率反映大脑结构变异性的人脑3D图谱的名称。", "note_en": "With its 100 million neurons, the gut has earned a reputation as the body’s “second brain” – corresponding with the real brain to manage things like intestinal muscle activity and enzyme secretions. A growing community of scientists are now seeking to understand how gut neurons interact with their brain counterparts, and how failures in this process may lead to disease.  Now, new  research shows that gut bacteria play a direct role in these neuronal communications, determining the pace of intestinal motility. The research, conducted in mice and published in Nature, suggests a remarkable degree of communication between our nervous system and the microbiota. It may also have implications for treating gastrointestinal conditions.  “We describe how microbes can regulate a neuronal circuit that starts in the gut, goes to the brain, and comes back to the gut,” says Rockefeller’s Daniel Mucida, associate professor and head of the Laboratory of Mucosal Immunology. “Some of the neurons within this circuit are associated with irritable bowel syndrome, so it is possible that dysregulation of this circuit predisposes to IBS.”  The work was led by Paul A. Muller, a former graduate student in the Mucida lab.\n  To understand how the central nervous system senses microbes within the intestines, Mucida and his colleagues analyzed gut-connected neurons in mice that lacked microbes entirely, so-called germ-free mice that are raised from birth in an isolated environment, and given only food and water that has been thoroughly sterilized. They found that some gut-connected neurons are more active in the germ-free mice than in controls and express high levels of a gene called  cFos, which is a marker for neuronal activity.  This increase in neuronal activity, in turn, causes food to move more slowly than usual through the digestive tract of the mice. When the researchers treated the germ-free mice with a drug that silences these gut neurons, they saw intestinal motility speed up.  It’s unclear how the neurons sense the presence of gut microbes, but Mucida and his colleagues found hints that the key may be a set of compounds known as short-chain fatty acids, which are made by gut bacteria. They found that lower levels of these fatty acids within the guts of mice were associated with greater activity of the gut-connected neurons. And when they boosted the animal’s gut levels of these compounds, the activity of their gut neurons decreased. Other microbial compounds and gut hormones that change with the microbiota were also found to regulate neuronal activity, suggesting additional players in this circuit.    Further experiments revealed a conundrum, however. The scientists saw that the particular type of gut-connected neurons activated by the absence of microbes did not extend to the exposed surface of the intestines, suggesting that they cannot sense the fatty acid levels directly.  So Mucida and his colleagues decided to trace the circuit backwards and found a set of brainstem neurons that show increased activity in the germ-free mice. When the researchers manipulated control mice to specifically activate these same neurons, they saw an increase in the activity of the gut neurons and a decrease in intestinal motility.  The researchers continued to work backwards, next focusing their attention on the sensory neurons that send signals from the intestines to the brainstem. Their experiments revealed these sensory neurons extended to the interface of areas of the intestine that are exposed to high levels of microbial compounds, including fatty acids. They turned off these neurons, to mimic what happens in germ-free mice that lack the fatty acids, or associated gut signals, and observed activated neurons in the brainstem, as well as activation of the gut neurons that control intestinal motility.  “We traced the whole loop and saw that neurons outside the intestines can be controlled by what happens inside the intestines,” Mucida says. “It is plausible that the circuit identified here could be involved in additional gut-brain bidirectional interactions, which could influence several intestinal as well as neurological diseases, including IBS and even behavioral abnormalities.”      Muller  et al. (2020). Microbiota modulate sympathetic neurons via a gut–brain circuit.  Nature. DOI:  https://doi.org/10.1038/s41586-020-2474-7  This article has been republished from the following  materials. Note: material may have been edited for length and content. For further information, please contact the cited source.\n               News  International experts have made a weak recommendation for the use of remdesivir in patients with severe COVID-19, advising continuation of patient enrolment for ongoing clinical trials of remdesivir to enable the collection of additional data.\n  READ MORE\n    News  &#34;Julich-Brain&#34; is the name of the first 3D-atlas of the human brain that reflects the variability of the brain’s structure with microscopic resolution. The atlas features close to 250 structurally distinct areas, each one based on the analysis of 10 brains. German researchers led by Prof. Katrin Amunts have now presented the new brain atlas in the renowned journal Science.\n  READ MORE\n    News  Researchers from Vanderbilt University have developed a streamlined diagnostic approach for COVID-19 that renders RNA extraction – a bottleneck in the diagnostic process – unnecessary.\n  READ MORE", "posttime": "2020-08-03 06:19:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交感神经,gut,肠道", "title": "脑肠回路让微生物区系直接影响交感神经系统", "title_en": "Brain-Gut Circuit Lets Microbiota Directly Affect the Sympathetic Nervous System", "transed": 1, "url": "https://www.technologynetworks.com/tn/news/brain-gut-circuit-lets-microbiota-directly-affect-our-sympathetic-nervous-system-338082", "via": "", "real_tags": ["交感神经", "gut", "肠道"]}, {"category": "", "categoryclass": "", "imagename": "6504f3d4a41a768ac31b0cd799d16d68.jpg", "infoid": 1015813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "常见问题解答：·什么是Jukebox AI？简单地说，这是一种能产生音乐的人工智能-在官方博客上阅读更多关于它的信息：https://openai.com/blog/jukebox/·我能让我们…", "note_en": "FAQ: • What is Jukebox AI? Simply put, it's an AI that generates music - read more about it on the official blog: https://openai.com/blog/jukebox/ • Can I us...", "posttime": "2020-08-03 06:18:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "openai,jukebox", "title": "啊哈-接受我-但OpenAI Jukebox试图完成这首歌", "title_en": "Aha – Take On Me – but OpenAi Jukebox tries to complete the song", "transed": 1, "url": "https://m.youtube.com/watch?v=uSWTSML9hwY", "via": "", "real_tags": ["openai", "jukebox"]}, {"category": "", "categoryclass": "", "imagename": "f8389a294159a5699f988b98aeec4a55.png", "infoid": 1015808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我在2017年推出Feature Upvote时，我的B2B SaaS，价格是29美元/月，按年支付有20%的折扣。我武断地选择了这个价格，但也因为我觉得这是我愿意为类似的服务支付的价格。在反复听到开始创业的开发商需要收取更高的费用后，我想尝试一下小幅上调。我推迟了这样做，直到我每个月有足够的新客户来真正确定价格变化的效果。2019年1月，我把价格提高了…", "note_en": "When I launched Feature Upvote, my B2B SaaS, in 2017, the price was $29/month, with a 20% discount for paying yearly. I chose that price  arbitrarily, but also because it is what I felt I would pay for a similar service.  After hearing repeatedly that developers who start businesses need to charge more, I wanted to experiment with a small increase.  I delayed doing this until I had enough new customers each month to really be sure of the price change’s effect.  In January 2019 I put the price up...", "posttime": "2020-08-03 04:43:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "b2b,价格", "title": "当我提高我的B2B SaaS的价格时", "title_en": "When I raised my B2B SaaS’s prices", "transed": 1, "url": "https://discuss.bootstrapped.fm/t/when-i-raised-my-b2b-saass-prices/7017", "via": "", "real_tags": ["b2b", "价格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lisp(例如Common Lisp、Emacs Lisp)和Haskell的哲学上的一个不同之处在于，后者自由地使用许多完成单个任务的微小函数。这就是所谓的可组合性，或UNIX哲学。在Lisp中，过程倾向于接受配置其行为的许多选项。这被称为整体主义，或者像厨房水槽或瑞士军刀那样的程序。\n哪一个更好，可以在另一个帖子里讨论。我只想举出一个简单的例子，那就是在哲学和实践上确实是有区别的。在编写了我的相当一部分的Emacs Lisp(和一小部分Common Lisp；我维护了Common Lisp系统)和我的相当一部分的Haskell之后，我认为我可以做出判断了。\n完全公开：我们只看一些任何人都能理解的琐碎例子，暗示这些例子代表了用这些语言编写软件的一般方式(未经证实，但断言)。\n任何背景的程序员都应该很容易熟悉的一个例子是处理列表。例如，CL有Remove-If-Not过程。其文档签名如下：\n给出一个问题语句“从列表中取出满足谓词p的所有元素(前三个除外)，只取其中的前五个”，在Common Lisp中，您可以非常简洁地表示为：\n无论您了解Haskell还是Lisp，区别都应该是显而易见的，那就是在Lisp代码中，函数执行一些行为并接受参数来配置它们。在Haskell代码中，我们使用三个不同的函数来完成一项任务：\n那个。操作符将函数组合在一起，就像UNIX中的管道一样。我们可以在UNIX中表达这一点，如下所示：\n就像UNIX中的管道一样，当组合在一起时，这些函数足够聪明，可以很好地执行-我们不会遍历整个列表并每次都生成一个新列表，每个项目都是按需生成的。事实上，由于流融合，代码将被编译成一个快速循环。\n如果我们想要不满足谓词的内容，我们只需再次使用not：\n在Common Lisp中，组合有一点冗长，因为即使使用过，也很少使用，因此有另一个函数可以实现这一点：\n(可能更灵活的方法是对Remove-if函数使用：not关键字参数。)。\n在Lisp中，这种厨房水槽最病态的例子是众所周知的循环宏。\n问题：获取所有小于5的元素，然后只获取该集合中的偶数元素。\n在Haskell中，这同样适用于可以融合的矢量库、文本库和字节库。融合主要是一个纯度优势-如果您知道n个循环不会产生副作用，则可以将它们融合到一个循环中。这样的优势也可以应用于其他纯语言，如Idris、PureScript或ELM。", "note_en": "One difference in philosophy of Lisp (e.g. Common Lisp, Emacs Lisp) and Haskell is that the latter makes liberal use of many tiny functions that do one single task. This is known as  composability, or the UNIX philosophy. In Lisp a procedure tends to accept many options which configure its behaviour. This is known as  monolithism, or to make procedures like a kitchen-sink, or a Swiss-army knife.\n Which one is better can be discussed in another post. I just want to make the simple case that there is indeed a difference in philosophy and practice. Having written my fair share of non-trivial Emacs Lisp (and a small share of Common Lisp; I’ve maintained Common Lisp systems) and my fair share of non-trivial Haskell I think I’m in a position to judge.\n Full disclosure: We’ll just look at some trivial examples anyone can understand, with the (unproven but asserted) implication that these examples are representative of the general way software is written in these languages.\n An example which should be readily familiar to any programmer of any background is working on lists. For example, CL has the  remove-if-not procedure. Its documentation signature is like this:\n     Given a problem statement “take all elements from the list–except the first three–that satisfy predicate  p, and take only the first five of those”, in Common Lisp you’d express it quite concisely as this:\n    The difference which should be obvious whether you know Haskell or Lisp is that in the Lisp code the function does a few behaviours and accepts arguments to configure them. In the Haskell code, we use three different functions which do one task:\n  The  . operator composes functions together, just like pipes in UNIX. We might express this in UNIX something like:\n    Like pipes in UNIX, the functions are clever enough to be performant when composed together–we don’t traverse the whole list and generate a new list each time, each item is generated on demand. In fact, due to  stream fusion, the code will be compiled into one fast loop.\n If we want things that don’t satisfy the predicate, we just compose again with  not:\n  In Common Lisp composition is a bit wordier because it’s rarely if ever used, so instead there is another function for that:\n  (Probably a more Lispy approach would’ve been to have a  :not keyword argument to the  remove-if function.)\n The most pathological example of such a kitchen sink in Lisp is the well known LOOP macro.\n Problem: get all elements less than 5, then just the even ones of that set.\n     In Haskell the same applies to vector libraries and text libraries and bytes libraries, which can be fused. Fusion is chiefly an advantage of purity – you can fuse n loops together into one loop if you know that they don’t do side-effects. Such an advantage can also be applied to other pure languages like Idris or PureScript or Elm.", "posttime": "2020-08-03 04:43:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "哲学,difference,函数", "title": "哈斯克尔与里斯普的哲学差异", "title_en": "A philosophical difference between Haskell and Lisp", "transed": 1, "url": "https://chrisdone.com/posts/haskell-lisp-philosophy-difference/", "via": "", "real_tags": ["哲学", "函数"]}, {"category": "", "categoryclass": "", "imagename": "a15a28ca5b1ca56500813dcf6d9b47d6.png", "infoid": 1015806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家航空航天局(NASA)宇航员在完成SpaceX前往国际空间站的开创性任务后落入大海。\n鲍勃·本肯(Bob Behnken)和道格·赫尔利(Doug Hurley)降落在埃隆·马斯克(Elon Musk)的太空公司制造的太空舱里，成为45年来首批溅落的美国宇航员。\n在穿过地球大气层，并被降落伞安全带下后，抵达墨西哥湾结束了一项将改变美国太空旅行的任务。\n任务的成功完成意味着SpaceX的“龙”太空舱--宇航员被抬上太空，与国际空间站对接，然后安全降落--已经通过了最后一次测试，现在将投入飞行宇航员的常规使用。\n我代表SpaceX和NASA团队欢迎回到地球。感谢SpaceX的飞行，SpaceX任务控制中心在飞机坠落时说。\n在返回序列中，机载推进器和两组降落伞自动减慢橡子形太空舱的速度，使本肯和赫尔利在轨道上的时速从17500英里/小时降至大气层再入时的350英里/小时，最终在溅落时降至15英里/小时。\n在重返地球大气层的过程中，太空舱的外壳经受住了高达3500华氏度的高温，而本肯和赫尔利在舱内穿着SpaceX的白色飞行服，经历了85华氏度的高温。\n机组人员将在太空舱内漂浮长达一个小时，然后来自SpaceX和NASA的联合搜救队将他们带回岸上进行直升机旅行。在那里，两人将在飞往美国宇航局位于德克萨斯州休斯顿的约翰逊航天中心之前接受体检。\n亿万富翁企业家埃隆·马斯克(Elon Musk)的SpaceX公司发射了本肯和赫尔利(Behnken)和赫尔利(Hurley)，成为第一家将人类送入轨道的私营公司。返回空间站时，这两人将在空间站度过两个多月的时间。\n\n这项具有里程碑意义的任务于5月31日从美国宇航局肯尼迪航天中心发射，标志着自2011年航天飞机计划退役以来，美国航天局首次将人类送入美国本土。从那时起，美国一直依靠俄罗斯的太空计划将其宇航员送入空间站。\n上一次美国机组人员坠入海洋是在1975年，当时正在执行阿波罗任务。从那时起，宇航员总是降落在陆地上。\n输入您的电子邮件地址请输入电子邮件地址电子邮件地址无效填写此字段电子邮件地址无效电子邮件已存在。登录以更新您的时事通讯首选项，我希望每周通过电子邮件接收生活方式世界上最好的功能和趋势。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n想要讨论现实世界的问题，参与最引人入胜的讨论，听取记者的意见吗？立即开始您的独立高级订阅。\n已经注册了？登入。\n独立高级评论可以由我们会员计划的成员发布，独立高级。它允许我们参与度最高的读者辩论重大问题，分享他们自己的经验，讨论现实世界的解决方案，等等。我们的记者将尝试回应，在他们可能的情况下加入这些帖子，以创造一次真正的独立溢价会议。关于所有主题的最有洞察力的评论将每天发表在专门的文章中。您也可以选择在有人回复您的评论时通过电子邮件发送。\n对于那些没有订阅独立高级的人，现有的开放评论线程将继续存在。由于这个评论社区的巨大规模，我们不能对每个帖子给予同等程度的关注，但出于公开辩论的利益，我们保留了这一区域。请继续尊重所有评论者，并进行建设性的辩论。", "note_en": "Nasa astronauts have dropped into the sea after a pioneering  SpaceX mission to the International Space Station.\n  Bob Behnken and Doug Hurley became the first American astronauts to splashdown in 45 years when they landed in the capsule made by Elon Musk&#39;s space firm.\n    The arrival in the Gulf of Mexico – after having blazed through Earth&#39;s atmosphere, and being carried safely down by parachutes – brought an end to a mission that is set to change space travel in the US.\n                The successful finish to the mission means that SpaceX&#39;s Dragon capsule – in which the astronauts were carried up to space, docked with the ISS, and then safely came back down – has passed the last of its tests, and will now go into regular use flying astronauts.\n     &#34;On behalf of the SpaceX and NASA teams, welcome back to Planet Earth. Thanks for flying SpaceX,&#34; SpaceX mission control said upon splashdown.\n    For the return sequence, on-board thrusters and two sets of parachutes worked autonomously to slow the acorn-shaped capsule, bringing Behnken and Hurley&#39;s speed of 17,500 miles per hour in orbit down to 350 mph upon atmospheric reentry, and eventually 15 mph at splashdown.\n    During reentry to Earth&#39;s atmosphere, the capsule&#39;s outer shell withstood temperatures as high as 3,500 Fahrenheit while Behnken and Hurley, wearing SpaceX&#39;s white flight suits strapped inside the cabin, experienced 85 Fahrenheit.\n    The crew will spend up to an hour floating inside the capsule before joint recovery teams from SpaceX and NASA retrieve them for a helicopter trip ashore. There the duo will undergo medical checks ahead of a flight to NASA&#39;s Johnson Space Center in Houston, Texas.\n  Billionaire entrepreneur Elon Musk&#39;s SpaceX became the first private company to send humans to orbit with the launch of Behnken and Hurley, who will have spent more than two months on the space station upon returning.\n         \n  The landmark mission, launched from NASA&#39;s Kennedy Space Center on May 31, marked the first time the U.S. space agency launched humans from American soil since its shuttle program retired in 2011. Since then the United States has relied on Russia&#39;s space program to launch its astronauts to the space station.\n  The last time an American crew splashed down into the ocean was in 1975, during an Apollo mission. Since then, astronauts have always landed on dry land.\n        Enter your email address      Please enter an email address  Email address is invalid  Fill out this field  Email address is invalid  Email already exists. Log in to update your newsletter preferences    I  would like to receive the best features and trends across the world of lifestyle every week by email\n        You may not agree with our views, or other users’, but please respond to them respectfully\n  Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n    You may not agree with our views, or other users’, but please respond to them respectfully\n  Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n                 Want to discuss real-world problems, be involved in the most engaging discussions and hear from the journalists? Start your Independent Premium subscription today.\n       Already registered?  Log in\n          Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment.\n  The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates.", "posttime": "2020-08-03 04:20:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,宇航员,space,spacex", "title": "NASA宇航员在开创SpaceX前往国际空间站的任务后安全落海", "title_en": "NASA astronauts safely drop into sea after pioneering SpaceX mission to International Space Station", "transed": 1, "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/news/nasa-spacex-return-landing-tv-capsule-splashdown-a9650646.html", "via": "", "real_tags": ["nasa", "宇航员", "space", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "a56bef60e8d471c050fe588ea479cfde.jpg", "infoid": 1015803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将页面设计与架构进行比较似乎有些牵强，但我认为这种比较真的很管用。看一看中世纪的页面，不难将其视为一座工程建筑：一个由柱子和走廊定义的错综复杂的空间，房间里居住着思想和想法(图1)。在中世纪的页面上遇到的一切都不是巧合。每件事都是有原因的，都有特定的目的；文本在页面上展开的方式也是如此。就像手稿的其他材料特征一样，页面设计通常反映了这本书将如何使用，但在他们的选择中，抄写员也对最终使用手稿的个人的偏好-甚至是要求-做出了回应。\n反过来，读者更喜欢他们的书-以及其中的页面-以某种方式格式化，因为他们计划将它们用于执行特定的任务：教育或被教育(教师和学生)，娱乐或被娱乐(吟游诗人和朝臣)，或收集大量信息并查阅(学者、传教士、医生、律师)。单词在页面上的放置方式和位置-它们的大小和字体，以及它们的位置-是将这本书转变为能够胜任这项任务的工具的过程中的重要考虑因素。事实上，可以说页面的设计是(现在也是)一本书成功的关键。有哪些变量在起作用？对某种设计的选择对中世纪书籍的有效使用方式产生了怎样的正面和负面影响？\n如果页面是一座建筑，那么它的基础是在手稿制作的早期阶段奠定的。当抄写员想出如何处理一本特定的书-他知道它将如何使用，并从赞助人或修道院的图书管理员那里获得了意见-他将通过抓起两个工具开始设计页面，这两个工具对页面最终的外观是至关重要的。第一个是一个尖头的装置，允许他在羊皮纸或纸页上打孔，这些孔看起来像是沿着书的长边的圆点。第二个是一个工具，他可以用它将裁决添加到页面上。直到大约1150年，一种锋利的物体被用来产生檐沟-羊皮纸上的凹痕-这为流出钢笔的文本行创造了通道。在此日期之后，一块铅笔或钢笔和墨水产生了裁决(这张缩影显示了一名抄写员用尺子制作裁决；在这篇帖子的顶部是另一张)。\n以这种方式将这些点连接起来，抄写员在页面上放置了一幅网状线条(图2)。生成的网格形成了未来文本的轮廓：它定义并限制了列的数量和位置、它们将容纳的行数以及四个页边距的尺寸和位置。甚至在这个早期制作阶段，阅读辅助工具的最终存在也被认为是存在的。在上边空白处增加了额外的一行，以指导运行的标题(如果有计划的话)，而在准备边缘评论时，在边缘空间添加了额外的规则(两者都没有出现在图2中)。在某种程度上，这种水平和垂直线的网格就像是手稿的蓝图：它甚至在写下一个字母之前就定义了最终的一页。仍然空荡荡的行，还没有文字补充，决定了这本书会是什么样子，以及以后可以如何使用。\n羽毛笔将使这一蓝图栩栩如生：它将文字放在裁决上，从而产生文本和意义。这本书的正文两边可以有评论，这反过来又形成了额外的栏目。当出现几条评论时，页面的设计可能会相当令人望而生畏-而且肯定是一场噩梦(例如，参见图1)。然而，这种复杂性是相对的。图3中的示例显示了一个中心文本列，它用大字母和深黑色墨水书写，其中包含圣经文本(页面显示圣保罗给加拉太书的信)。在它的周围，彼得·隆巴德(Peter Lombard)用同样深色的墨水对圣保罗的信进行了评论。这一部分是13世纪下半叶在巴黎制作的，并在杜普拉特工作室进行了照明(来源)。\n这篇文章和评论周围的页边空白处一直是空的，直到1412年，彼得·塔伦塔西亚(Peter Tarentasia)的另一条评论被以较小的脚本添加到页面上。结果是一个复杂的页面，但也是一个非常有条理的页面。毕竟，信息被放在相对孤立的文本隔间--可以说是“房间”--由空白的走廊隔开。换句话说，什么是什么，读者一目了然：字母的较大尺寸标识了正文，而评论的较小字体以及它们在页面上的位置，则标识了其他房间的居住者。像这样的复杂手稿，呈现了一种Textus Inclusus或“SQ\n页面是一座房子，抄写员是它的设计师：这是很有吸引力的比较，这突显了一个有效的页面在多大程度上依赖于巧妙的设计、仔细的规划和细致的计算。就像建筑师一样，这位书记员确保为未来的居民创造一个舒适的家。\nRaymond Clemens&Amp；Timothy Graham，“手稿研究导论”(伊萨卡/伦敦：康奈尔大学出版社，2007)，第14-17页(“写作前的准备”)。讨论图纸的布局和准备。\nErik Kwakkel，“破译材料书：中世纪手稿中的文化残留物”，摘自“中世纪手稿书：文化途径”，编辑。迈克尔·范杜森(Michael Van Dussen)和迈克尔·约翰逊(Michael Johnson)(剑桥：剑桥大学出版社，2015)，60-76页。论述了选择稿件材料特征背后的理论基础。\nErik Kwakkel，印刷前的书籍(利兹：Arc Humanities Press，2018年)，第30-70页(“填充页面：脚本、写作和页面设计”)。通过案例研究概述页面设计。\nElaine Treharne，“早期英语的建筑编辑”，摘自A.G.爱德华兹和T.T.Takako(编)，Poetica 71(2009)，第1-13页。中世纪文本编辑中用作比喻的建筑语境。", "note_en": "It may seem a stretch to compare page design with architecture, but the comparison really works, I think. Looking at the medieval page, it is not difficult to regard it as an engineered construction: a convoluted space defined by columns and corridors, with rooms inhabited by thoughts and ideas (Figure 1). Nothing encountered on the medieval page is a coincidence. Everything is there for a reason and serves a specific purpose; and so, too, is the manner in which the text was spread out over the page. Like other material features of the manuscript, page design is usually reflective of how the book would be used, but in their choices scribes also responded to the preferences – demands, even – of the individuals who would ultimately use the manuscript.\n Readers, in turn, preferred their books – and the pages in them – to be formatted in certain ways because they planned to use them for performing particular tasks: to educate or be educated (teachers and students), to entertain or to be entertained (minstrels and courtiers), or to gather a body of information and consult it (scholars, preachers, physicians, lawyers). How and where words were placed on the page – their size and script, and their location – were important considerations in this process of turning the book into a tool that was up to the task. Indeed, it can be argued that a page’s design was (and is) key to a book’s success. What are some of the variables in play? And how did the choice for a certain design affect, positively and negatively, the manner in which the medieval book could be used effectively?\n   If the page is a building, its foundation was laid in an early stage of a manuscript’s production. After the scribe had figured out how to tackle a particular book – he knew how it would be used, having had input from the patron or the monastery’s librarian – he would start designing the page by grabbing two tools that were fundamental for what the page would ultimately look like. The first was a pointy device that allowed him to punch holes in the parchment or paper leaves, which appear like dots along the long edges of the book. The second was a tool with which he could add ruling to the page. Up to  c. 1150, a sharp object was used to produce gutters – indentations in the parchment – which created pathways for the lines of text flowing out of the pen. After that date a piece of lead or a pen and ink produced the ruling ( this miniature shows a scribe using a ruler to produce the ruling; at the top of  this post is another).\n Connecting the dots in this fashion, the scribe placed a web of lines on the page (Figure 2). The resulting grid formed the outline of the future text: it defined – and confined – the number and location of the columns, the number of lines they would hold, as well as the dimensions and positioning of the four margins. Even the ultimate presence of reading aids was construed during this early production stage. An extra line was added in the upper margin to guide the running title, if one was planned, while in preparation for marginal commentaries extra ruling was added to the marginal space (both not present in Figure 2). In a way this grid of horizontal and vertical lines functioned as the blueprint of the manuscript: it defined the ultimate page even before a single letter was written down on it. The still empty lines, yet to be complemented with words, determined what the book would look like and how it could be used later.\n   The quill would bring this blueprint to life: it placed words onto the ruling, thus producing text and meaning. The main text of the book could be flanked by commentaries, which in turn formed additional columns. When several commentaries were present, the design of the page can be quite daunting – and must have been a nightmare to produce (see for example Figure 1). However, this complexity is relative. The example in Figure 3 shows a central text column, written in a large letter and deep-dark black ink, which contains the biblical text (the page shows St Paul’s Letter to the Galatians). Around it, in equally dark ink, Peter Lombard’s commentary to St Paul’s letter is encountered. This part was produced in Paris during the second half of the 13th century and illuminated in the Du Prat workshop ( source).\n The margins around this text and commentary remained empty until 1412, when an additional commentary by Peter Tarentasia was added to the page in a smaller script. The result is a complex page, but also a remarkably organised one. After all, the information was placed in relatively isolated text compartments – “rooms,” as it were – which were separated by blank corridors. In other words, it was crystal clear to the reader what was what: the larger size of the letter identified the main text, while the smaller script of the commentaries as well as their positioning on the page, identified the occupants of the other rooms. Complex manuscripts like these, which present a   textus inclusus or “square-bracket” glossing pattern, contain pages inhabited by a maze of corridors, which “snake” between the columns and sometimes even underneath or above them.\n   The manuscripts in Figures 1 and 3 are so complex that it is difficult to say how many text columns they consist of. Evidently, however, in both cases the main text is copied out in a single column, a firm pillar written in a bold letter. Most medieval manuscripts hold either one or two columns of main text. Three or four are occasionally encountered. Usually it concerns a dictionary or encyclopedia (read about an example of four columns  here). A page with more than four columns is extremely rare. In fact, I only know of one such manuscript (Figure 4). It is kept in Amiens and holds a concordance of the Bible, a tool that enabled readers to identify where in the Bible certain concepts and figures were mentioned.\n The entries in this manuscript – often a name followed by a bible book and a chapter number – are short, which is why the scribe decided to place five of them on a single page. The book measures 310×208 mm and is thus not even unusually large, which tells you just how small the script is. Equally remarkable, the page has room for a sixth column, which is crammed into the outer margin. Here the reader could add remarks; one was added on the spread seen in Figure 4, all the way in the top left corner. In the lower margins, too, there is room planned for comments. A grid of square boxes is seen here, produced by pencil lines. This is a popular design for university textbooks, which contain many such penciled squares, sometimes over forty of them on one page. They act as comment boxes in which the student could jot down his notes ( this is an example of such a manuscript; more about this practice in  this blog post).\n  The page as a house, the scribe as its architect: they are attractive comparisons, which highlight just how much an effective page depended on crafty design, careful planning, and meticulous calculations. Like an architect, the scribe made sure to create a comfortable home for future inhabitants.\n  Raymond Clemens &amp; Timothy Graham,  Introduction to Manuscript Studies (Ithaca/London: Cornell University Press, 2007), pp. 14-17 (“Preparations prior to writing”). Discusses layout and the preparation of the sheets.\n Erik Kwakkel,   “Decoding the Material Book: Cultural Residue in Medieval Manuscripts,”  in   The Medieval Manuscript Book: Cultural Approaches , ed. Michael Van Dussen and Michael Johnson (Cambridge: Cambridge University Press, 2015), 60-76. Discusses the rationale behind the choice of a manuscript’s materials features.\n Erik Kwakkel,  Books Before Print (Leeds: Arc Humanities Press, 2018), pp. 30-70 (“Filling the Page: Script, Writing, and Page Design”). Overview of page design through case-studies.\n Elaine Treharne, “The Architextual Editing of Early English,” in A. G. Edwards and T. Takako (eds.),  Poetica 71 (2009), 1-13. Architectural context used as a metaphor in the editing of medieval texts.", "posttime": "2020-08-03 03:53:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建筑,中世纪,medieval,页面", "title": "《中世纪版的建筑》(2018)", "title_en": "The Architecture of the Medieval Page (2018)", "transed": 1, "url": "https://medievalbooks.nl/2018/09/07/the-architecture-of-the-medieval-page/", "via": "", "real_tags": ["建筑", "中世纪", "medieval", "页面"]}, {"category": "", "categoryclass": "", "imagename": "b09e42acdd24dcd68e0ff7b15e60e918.gif", "infoid": 1015801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX的机组人员龙似乎在整个任务中的表现完全符合预期，以一个全自动化的过程处理发射、国际空间站对接、脱离轨道和溅落，确保了宇航员的安全。这个最后阶段包括使用SpaceX的Go Navigator回收船在墨西哥湾的海上打捞本肯和赫尔利，到目前为止似乎也进展顺利，尽管仍在进行中。然而，贝肯和赫尔利被证实是安全和健康的，而且太空舱在水中的位置很理想。\n随着这项任务的成功完成，一切都应该准备就绪，以便根据NASA的确切标准，将机组人员龙和猎鹰9号完全认证为载人航天-前提是对整个任务从头到尾的最终彻底审查没有发现任何需要清理的遗留问题。同样，根据我们所看到的，对于Demo-2来说，从头到尾看起来都是一项或多或少完美的任务，所以我认为认证不会有任何重大障碍。请注意，这也是45年来的第一次人类溅落--1974年，最后一批天空实验室的工作人员这样做了。\n这意味着“乘员龙”号的下一步是开始定期服务，成为美国往返空间站的主要交通来源。它的第一次业务任务，指定的Crew-1，目前定于9月下旬的某个时候进行，将搭载三名NASA宇航员和一名日本宇宙航空研究开发机构的宇航员作为轨道科学平台的机组人员前往空间站进行定期巡视。\n这也意味着，自2011年航天飞机退役以来，NASA将控制自己的宇航员(以及来自友好国家的宇航员)往返空间站的运输方式。商业机组人员计划就是为了提供这一点，但它没有像航天飞机那样让NASA负责航天器的发射和运输，而是与私人公司合作，为这些飞行提供商业服务-SpaceX现在是第一个完成测试和开发计划的公司，波音公司正在成为NASA依赖的第二个商业搭乘提供商。\n美国国家航空航天局希望确保继续进入国际空间站，并希望通过与商业宇航员共享机组人员龙和波音公司的星际客机上的乘车，长期节省资金，并使商业航天行业得以发展。SpaceX已经与一家公司合作，开始为私人太空战士销售机组人员龙(没有国际空间站停留)的回程，龙总共有七个潜在的载人座位，美国国家航空航天局(NASA)的任务只计划占据其中的四个位置。", "note_en": "SpaceX’s   Crew Dragon appears to have performed exactly as intended throughout the mission, handling the launch, ISS docking, undocking, de-orbit and splashdown in a fully automated process that kept the astronauts safe and secure throughout. This final phase includes recovery of Behnken and Hurley at sea in the Gulf of Mexico using SpaceX’s GO Navigator recovery vessel, which also seems to be going smoothly so far, though it’s still in progress. Behnken and Hurley are confirmed to be safe and healthy, however, and the capsule is ideally positioned int he water.\n With the successful completion of this mission, everything should be in place to allow for the full certification of Crew Dragon and  Falcon   9 as rated for human spaceflight according to NASA’s exactly standards – provided a final, thorough review of the entire mission from start to finish doesn’t reveal any remaining issues that need tidying up. Again, based on what we’ve seen, it looks like a more or less picture-perfect mission for Demo-2 from start to finish, so I wouldn’t expect any major barriers to certification. Note that this is also the first human splashdown in 45 years – when the  final Skylab crew did that in 1974.\n   That means that the next step for Crew Dragon is to begin regular service as America’s primary source of transportation to and from the  Space Station  . The first of its operational missions, designated Crew-1, is currently set to take place sometime in late September, and will carry three NASA astronauts and one JAXA astronaut to the station for a regular tour as crew members of the orbital science platform.\n This now also means that NASA will have control over its own transportation method for its astronauts (and astronauts from friendly nations) to and from the Space Station since the retirement of the Space Shuttle in 2011. The Commercial Crew program was designed to provide just that, but rather than having NASA responsible for the launch and transportation spacecraft as with the Shuttle, it’s partnering with private companies to offer it commercial service for those flights – SpaceX is now the first to complete the testing and development program, and Boeing is in process of becoming a second commercial ride provider for NASA to rely on.\n NASA wants to ensure continued access to the ISS, and is also hoping to save money long-term and enable the commercial space industry by sharing rides aboard the Crew Dragon and Boeing’s Starliner with commercial astronauts. SpaceX has already partnered with a company to begin selling return trips aboard Crew Dragon (without an ISS stop) for private spacefarers, and Dragon has a total of seven potential seats for flying people, with NASA missions only ever slated to occupy four of those spots.", "posttime": "2020-08-03 03:05:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,crew,宇航员", "title": "\nSpaceX和NASA成功将载有宇航员的Crew Dragon飞船送回地球", "title_en": "\n\t\t\t\tSpaceX and NASA successfully return Crew Dragon spacecraft to Earth with astronauts on board\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/02/spacex-and-nasa-successfully-return-crew-dragon-spacecraft-to-earth-with-astronauts-on-board/", "via": "", "real_tags": ["nasa", "crew", "宇航员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何对狗、言语治疗、增强型和另类沟通(AAC)、动物心理学或其他新思想感兴趣的人，都可以畅所欲言。关注、阅读并跟随这段教我的狗说话的激动人心的旅程吧！", "note_en": "Hunger for Words is for anyone interested in dogs, speech therapy, Augmentative and Alternative Communication (AAC), animal psychology, or new ideas.  Watch, read, and follow along on this exciting journey of teaching my dog to talk!", "posttime": "2020-08-03 03:03:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "alternative,感兴趣", "title": "与狗进行增强性和替代性交流", "title_en": "Using Augmentative and Alternative Communication with Dogs", "transed": 1, "url": "https://www.hungerforwords.com/", "via": "", "real_tags": ["感兴趣"]}, {"category": "", "categoryclass": "", "imagename": "570dd83e288ec885c03ed47f27255734.jpg", "infoid": 1015798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊本周获得了美国通信监管机构的批准，可以将数千颗互联网中继卫星送入近地轨道。\n他们确切的发射时间还没有确定。事实上，根据FCC的一份报告，金属鸟的设计尚未最终敲定。不过，亚马逊希望以柯伊伯项目(Project Kuiper)为旗号，耗资100亿美元，部署3236颗卫星，为美国难以到达的地区提供互联网连接。这些鸟将分五批升空，第一批包含578个SAT，届时将开启服务。\n亚马逊(Amazon)高级副总裁戴夫·林普(Dave Limp)周五表示：“最近我们听到了很多关于人们无法完成工作或完成学业的故事，因为他们家里没有可靠的互联网。”他宣布了FCC的批准。“宽带接入不可靠或根本不存在的地方还是太多了。柯伊伯将改变这一点。“。\n该星座将在距地球表面590至630公里的轨道上运行，根据联邦通信委员会的说法，空间对地将使用17.7-18.6 GHz的频率，空间对地也将使用18.8-20.2 GHz的频率，而地对空将使用27.5-30.0 GHz的频率。\nFCC的报告称：“在审查了记录后，我们得出结论，根据这里规定的要求和条件，批准Kuiper申请将符合公众利益。”“柯伊珀提议提供的宽带服务将使美国消费者受益.”\n亚马逊必须在2026年7月30日之前推出50%的机队，并在2029年7月30日之前推出另一半。根据最新的FCC规则，这家电商巨头将不得不提交一份详细的计划，说明它计划如何将创造和传播轨道碎片的风险降至最低。随着越来越多的卫星被送入太空，物质相互碰撞的可能性变得更高。\n从鸟类身上移开的金属碎片可能会撞到其他碎片上，进而可能导致连锁反应，造成漂浮碎片的海洋，这将阻碍未来航天器的发射和部署，即所谓的凯斯勒效应(Kessler Effect)。FCC写道：“进一步命令，在空间站设计最终敲定后，在开始服务之前，柯伊珀必须寻求并获得委员会的批准，修改内容包含对其系统轨道碎片缓解计划的最新描述。”\n目前还不清楚亚马逊将如何将这些卫星送入轨道。不过，首席执行官杰夫·贝佐斯(Jeff Bezos)确实拥有自己的太空火箭公司Blue Origins。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Amazon got the stamp of approval this week from America&#39;s communications watchdog to operate thousands of internet-relaying satellites into low Earth orbit.\n  When exactly they will launch hasn’t been set. In fact, the design of the metallic birds are yet to be finalized,  according to a report by the FCC. Still, Amazon hopes to deploy 3,236 of the satellites, under the banner Project Kuiper and at a cost of $10bn, to deliver internet connectivity to hard-to-reach areas in the US. The birds will go up in five batches, the first containing 578 sats at which point the service will be switched on.\n  “We have heard so many stories lately about people who are unable to do their job or complete schoolwork because they don’t have reliable internet at home,”  said Dave Limp, a senior veep at Amazon, on Friday heralding the FCC approval. “There are still too many places where broadband access is unreliable or where it doesn’t exist at all. Kuiper will change that.”\n  The constellation will orbit between 590 and 630 kilometres above the surface of the Earth, and according the FCC will use the frequencies 17.7-18.6GHz for space-to-Earth, 18.8-20.2GHz also for space-to-Earth, and 27.5-30.0 GHz for Earth-to-space.\n  “After review of the record, we conclude that the grant of the Kuiper application will serve the public interest, subject to the requirements and conditions specified herein,” the FCC report stated. “The broadband services Kuiper proposes to provide will benefit American consumers.”\n    Amazon has up until July 30, 2026 to launch 50 per cent of its fleet, and until July 30, 2029 to launch the other half. As per the  updated FCC rules, the e-commerce giant will have to submit a detailed plan of how it plans to minimize the risk of creating and spreading orbital debris. As more and more satellites are lobbed into space, the probability of stuff colliding with one another gets higher.\n  Bits of metal dislodged from the birds could crash into others that could, in turn, lead to a chain reaction creating a sea of floating debris that will thwart the launch and deployment of future spacecraft, something known as the Kessler effect. “It is further ordered that upon finalization of its space station design and prior to initiation of service, Kuiper must seek and obtain the Commission’s approval of a modification containing an updated description of the orbital debris mitigation plans for its system,” the FCC wrote.\n  It’s unclear how Amazon is going to get these satellites into orbit. CEO Jeff Bezos does have Blue Origins, a space rocket company of  his own, though. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-08-03 02:38:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,美国,亚马逊,获准,light", "title": "亚马逊获准斥资100亿美元购买3000多颗互联网卫星。所有这些都是为了让美国人可以在亚马逊上更多地购物", "title_en": "Amazon gets green-light to blow $10bn on 3,000+ internet satellites. All so Americans can shop more on Amazon", "transed": 1, "url": "https://www.theregister.com/2020/08/01/amazon_to_fly_578_satellites/", "via": "", "real_tags": ["amazon", "美国", "亚马逊", "获准", "light"]}, {"category": "", "categoryclass": "", "imagename": "64739ad4b6b5202059b8ee29663e3a31.png", "infoid": 1015797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罗布森之前也是英国学生运营的加速器项目Kickstart London的联合创始人，曾在摩根士丹利(Morgan Stanley)担任分析师。上周，罗布森通过Twitter宣布，他已加入红杉资本蓬勃发展的欧洲业务，他表示将与该团队合作，“帮助欧洲各地的创始人建立下一代变革性公司”。\n罗布森写道：“在Revolut工作了大约3年后，与一些最聪明的人一起开发了世界上第一个真正的全球金融超级应用程序，是时候我的下一步行动了。我很高兴地告诉大家，我将于8月下旬作为欧洲合伙人加入红杉资本。“。在第二条推文中，他补充说，“(欧洲)比以往任何时候都有更多的机会和创新”。\n在@RevolutApp工作了大约3年后，我与一些最聪明的人一起打造了世界上第一个真正的全球金融超级应用，现在是我下一步行动的时候了。我很高兴地告诉大家，我将于8月下旬加入@Sequoia，成为欧洲的合伙人。#FirstTweet。\n在Revolut，罗布森是新银行付费银行账户Revolut Premium的产品负责人。他在领英(LinkedIn)上称自己是Revolut订阅产品团队的第一名员工，他表示，他为产品与工程、产品营销和战略合作伙伴关系招募和管理多个职能部门。\n据说，他还负责Revolut零售计划的路线图交付，包括推出“Revolut Metal”，以及包括礼宾、智能旅行、保险和礼品功能在内的多个第三方集成。\n与此同时，正如前面提到的，罗布森是红杉资本首批招募的欧洲合伙人之一。Lixandru是从Accel挖来的，最出名的是领导该公司在UiPath的A系列业务，还与Deliveroo、Miro和Tessian等欧洲其他成功的初创公司合作。", "note_en": "Robson, who also previously co-founded Kickstart London, a student-run accelerator programme in the U.K. and has worked at Morgan Stanley as an analyst,  announced via Twitter last week that he has joined Sequoia’s burgeoning European operation where he says he’ll be working with the team “to help founders across Europe build the next generation of transformative companies”.\n Writes Robson: “After ~3 years at Revolut working with some of the brightest minds building the world’s first truly global financial super-app, it’s time for my next move. I’m excited to share that I will be joining Sequoia as a Partner in Europe in late August”. In a second tweet, he adds that there is “more opportunity and innovation [in Europe] than ever”.\n  After ~3 years at  @RevolutApp working with some of the brightest minds building the world&#39;s first truly global financial super-app, it’s time for my next move. I’m excited to share that I will be joining  @sequoia as a Partner in Europe in late August.  #FirstTweet\n At Revolut, Robson was the product owner for Revolut Premium, the neobank’s paid-for bank account. Describing himself on LinkedIn as the first hire into Revolut’s subscription product team, he says he recruited for and managed multiple functions across product &amp; engineering, product marketing and strategic partnerships.\n He is said to also have been responsible for the roadmap delivery for Revolut’s retail plans, including the launch of “Revolut Metal”, and multiple third-party integrations including concierge, smart travel, insurance and gifting features.\n Meanwhile, as mentioned, Robson adds to Sequoia’s first European partner recruit.  Lixandru was poached from Accel and is best-known for leading the firm’s Series A in UiPath, and also worked with Deliveroo, Miro, and Tessian, amongst other successful upstart companies in Europe.", "posttime": "2020-08-03 02:37:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "红杉,hired,revolut", "title": "\n看起来红杉在欧洲聘请了第二个合作伙伴：Revolut产品负责人乔治·罗布森(George Robson)", "title_en": "\n\t\t\t\tIt looks like Sequoia has hired a second partner in Europe: Revolut product lead George Robson\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/02/sequoia-europe/", "via": "", "real_tags": ["红杉", "hired", "revolut"]}, {"category": "", "categoryclass": "", "imagename": "17e1180e09b236913e85d77d077c2c06.jpg", "infoid": 1015796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新披露的苹果看到亚马逊广告的故事和微软对收购TikTok的明显兴趣有什么共同之处？\nIT&#39；It‘这不是疯狂的谣言毕竟。微软似乎是字节舞中的关键人物&#39；%s计划尝试剥离其在美国的TikTok单位。但是白宫仍然可能会破坏计划。..。\n如果ByteDance剥离其TikTok美国业务，有没有足够的潜力游戏，教育或聊天协同效应供微软购买它?或者将会(也应该)微软坚持它的..。\n微软继续专注于其Cortana数字助理关于工作效率情景的研究，作者为逐步淘汰Cortana技能\n微软表示，使用SHA-1算法签名的文件下载是不安全的，将于2020年8月3日删除。", "note_en": "What can a newly-revealed tale about Apple seeing an Amazon ad and Microsoft&#39;s apparent interest in buying TikTok have in common?\n  It&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnot\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrazy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trumor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tafter\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tall.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tseems\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tkey\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplayer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tByteDance&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttry\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdivest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tU.S.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTikTok\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunit.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWhite\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHouse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcould\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscuttle\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplan.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tByteDance\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdivests\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTikTok\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tU.S.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toperations,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthere\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenough\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpotential\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgaming,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teducation\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsynergies\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbuy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOr\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(and\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tshould)\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstick\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontinuing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfocus\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCortana\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdigital\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tassistant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproductivity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscenarios\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tphasing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tout\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCortana\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSkills\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstarting\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSeptember\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdropping\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCortana\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmobile\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tapp\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsupport\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft highlights new Teams features at a time when students and teachers are probably working remotely.\n  Before Microsoft delivered the fix, one way to resolve Edge crashing with Google search was to use Microsoft Bing.\n  If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlooking\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toption\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdump\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGoogle&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChrome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbrowser,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconsider\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEdge\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbrowser,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhich\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdelivers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmuch\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsame\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texperience\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tget\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChrome,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  How\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconfigure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCs\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tavoid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcommon\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproblems?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThere&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsoftware\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmagic\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbullet,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunfortunately,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttools\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdifferent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmall\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusinesses\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenterprises.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft says file downloads signed with the SHA-1 algorithm are insecure and will be removed on August 3, 2020.", "posttime": "2020-08-03 02:37:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,chrome,edge,cortana", "title": "Microsoft Edge被控从Chrome窃取数据", "title_en": "Microsoft Edge Accused of Stealing Data From Chrome", "transed": 1, "url": "https://www.zdnet.com/article/microsoft-edge-is-malware-says-angry-windows-7-user/", "via": "", "real_tags": ["microsoft", "chrome", "edge", "cortana"]}, {"category": "", "categoryclass": "", "imagename": "6744d541d694ec405bbc29a9197fdff9.jpg", "infoid": 1015795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，SpaceX机组人员龙演示2号任务对于美国宇航局的商业机组人员计划来说是一帆风顺的。宇航员鲍勃·本肯(Bob Behnken)和道格·赫尔利(Doug Hurley)于5月下旬发射到国际空间站，现在几乎已经返回地球。\n机组人员龙于下午4点35分成功脱离国际空间站。PT在周六。NASA一直在通过NASA电视台的实况转播返回过程。\n墨西哥湾的溅落如期在上午11点48分进行。PT.。在那之前，将会有大约一个小时的激动人心的时刻，因为机组人员“龙”将脱轨并重新进入地球的大气层。\nNASA和SpaceX计划周日在佛罗里达州彭萨科拉海岸登陆，同时继续监测飓风伊萨亚斯的任何影响。\n航天局周日在推特上表示，这将是自1975年阿波罗探月时代结束以来，NASA宇航员首次在海上打捞船员。\n今天的@SpaceX龙奋进溅落标志着@NASA宇航员自1975年最后一次阿波罗飞船任务以来首次在海上打捞机组人员。Pic.twitter.com/awSOEepRp1。\n-美国国家航空航天局(@NASA)2020年8月2日。\n重返大气层的过程是戏剧性的。“龙”号机组人员在重返大气层前将以轨道速度飞行，移动速度约为每小时17,500英里。美国宇航局在7月24日的一份声明中说：“它在重返大气层时将经历的最高温度约为3500华氏度。”\n从实验室到你的收件箱。每周从CNET获取最新的科学故事。\nSpaceX回收船将与机组人员龙(宇航员将其命名为奋进号)会合，从水中收集航天器和降落伞。奋进号将被吊上船，本肯和赫尔利将由医疗队迎接。\n“乘员龙”的安全、平安无事的归来关系重大。美国国家航空航天局(NASA)在一份新闻稿中表示，这是SpaceX的最后一次试飞，将提供猎鹰9号火箭、乘员龙飞船和地面系统的性能数据，以及在轨、对接、溅落和回收操作的数据。\n如果机组人员龙通过了这些最终测试，那么SpaceX将能够从今年晚些时候开始向国际空间站提供定期的、可操作的飞行。这将结束NASA自航天飞机时代以来第一次对俄罗斯航天器的依赖。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "The  SpaceX Crew Dragon Demo-2 mission has been smooth sailing so far for  NASA&#39;s   Commercial Crew Program. Astronauts Bob Behnken and Doug Hurley   launched to the International Space Station in late May and are now almost back to Earth.\n Crew Dragon successfully undocked from the ISS at 4:35 p.m. PT on Saturday. NASA has been broadcasting the return process through a livestream on  NASA TV.\n Splashdown in the Gulf of Mexico is on schedule for 11:48 a.m. PT. There will be about an hour of excitement prior to that moment as Crew Dragon deorbits and re-enters Earth&#39;s atmosphere.\n  NASA and SpaceX are planning on a water landing off the coast of Pensacola, Florida, on Sunday while continuing to monitor any impact from Hurricane Isaias.\n This will be the first crew recovery at sea of NASA astronauts since 1975 at the end of the Apollo moon exploration era,  the space agency tweeted on Sunday.\n Today&#39;s  @SpaceX Dragon Endeavour splashdown marks the first crew recovery at sea for  @NASA_Astronauts since 1975, the year of the final Apollo spacecraft mission.  pic.twitter.com/awSOEepRp1\n— NASA (@NASA)  August 2, 2020\n  The reentry process is dramatic. &#34;Crew Dragon will be traveling at orbital velocity prior to reentry, moving at approximately 17,500 miles per hour. The maximum temperature it will experience on reentry is approximately 3,500 degrees Fahrenheit,&#34;  said NASA in a statement on July 24.\n From the lab to your inbox. Get the latest science stories from CNET every week.\n A SpaceX recovery vessel will meet Crew Dragon (which the astronauts named Endeavour) to collect the spacecraft and parachutes from the water. Endeavour will be hoisted onto the ship and Behnken and Hurley will be greeted by a medical team.\n  There&#39;s a lot riding on a safe, uneventful return for Crew Dragon. &#34;This is SpaceX&#39;s final test flight and is providing data on the performance of the Falcon 9 rocket, Crew Dragon spacecraft and ground systems, as well as in-orbit, docking, splashdown and recovery operations,&#34;  NASA said in a release.\n If Crew Dragon passes these final tests, then SpaceX will be able to provide regular,   operational flights to the ISS starting later this year. And it would end NASA&#39;s reliance on Russian spacecraft for the first time since the shuttle era.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-08-03 02:36:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,美国宇航局,nasa,返回,splashdown", "title": "美国宇航局宇航员发射脱轨燃烧。看着溅落返回地球", "title_en": "NASA Astronauts Fire Deorbiting Burn.  Watch Splashdown Back to Earth", "transed": 1, "url": "https://www.cnet.com/news/spacex-splashdown-watch-live-as-nasa-astronauts-return-to-earth-sunday/", "via": "", "real_tags": ["美国", "美国宇航局", "nasa", "返回"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：我们讨论了反对连续性和离散性的数学和物理论点，特别强调了埃米尔·波雷尔(Emile Borel，1871-1956)的思想。\n来自：Gregory J.Chaitin[查看电子邮件][v1]清华，2004年11月18日22：35：07 UTC(11 KB)[v2]Wed，24 11月24 03：15：31 UTC(11 KB)[v3]Mon，29 11月29 UTC(11 KB)16：41：15 UTC(11 KB)", "note_en": "Download PDF  Abstract: We discuss mathematical and physical arguments against continuity and infavor of discreteness, with particular emphasis on the ideas of Emile Borel(1871-1956).\n  From: Gregory J. Chaitin [ view email]     [v1] Thu, 18 Nov 2004 22:35:07 UTC (11 KB)    [v2] Wed, 24 Nov 2004 03:15:31 UTC (11 KB)  [v3]Mon, 29 Nov 2004 16:41:15 UTC (11 KB)", "posttime": "2020-08-03 02:35:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "实数,real,pdf", "title": "实数有多实？(2004)", "title_en": "How real are real numbers? (2004)", "transed": 1, "url": "https://arxiv.org/abs/math/0411418", "via": "", "real_tags": ["实数", "real", "pdf"]}]