[{"category": "", "categoryclass": "", "imagename": "181007d03a39202922196d23afb9a71d.jpg", "infoid": 1034887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近二十年来，苹果公司首次决定提高Mac操作系统的版本号。这一变化旨在唤起人们对即将到来的苹果硅片转型(Big Sur将是首个在苹果自有芯片上运行的MacOS版本，尽管它不是第一个需要这些芯片的版本)的关注，以及iPad风格的重新设计，这将在很长一段时间内首次对操作系统的外观、手感和声音进行重大改革。这一变化旨在引起人们对苹果硅谷转型的关注--Big Sur将是第一个在苹果自有芯片上运行的MacOS版本，尽管它并不是第一个需要这些芯片的版本。即使是iOS-7发布后的优胜美地(Yosemite)更新版也煞费苦心地让大多数东西保持不变，因为它改变了它们的外观。\n但与苹果从Mac OS 9跳到Mac OS X不同的是，苹果几乎抹去了之前操作系统的几乎所有方面，并从头开始打造了一个新的操作系统，而MacOS 11从根本上仍然是MacOS 10。早期的测试版甚至被贴上了MacOS 10.16的标签，Big Sur为了保持兼容性，仍然可以在一些较旧的软件中将自己标识为10.16版。几乎所有的东西都会以同样的方式工作--或者，至少Big Sur不会像旧的MacOS10更新那样破坏大多数软件。它甚至可能比卡特琳娜的颠覆性要小一些。在大多数情况下，这应该是一个平稳的过渡。\n我们也不会对审查的方式做出任何重大改变。我们将介绍该操作系统的新外观和新功能--任何一个巨无霸都能做的事情，不管它是运行在英特尔还是苹果的硅谷Mac上。在没有最终硬件的情况下，我们将介绍Apple Silicon Mac原生的MacOS新功能，并概述过渡过程中的软件方面的进展。", "note_en": "For the first time in  almost two decades, Apple has decided to bump up the version number of the Mac’s operating system. The change is meant to call attention to both  the pending Apple Silicon transition—Big Sur will be the first macOS version to run on Apple’s own chips, even if it’s not the first to  require those chips—and to an iPad-flavored redesign that significantly overhauls the look, feel, and sound of the operating system for the first time in a long while. Even the post-iOS-7 Yosemite update  took pains to keep most things in the same place as it changed their look.\n     But unlike the jump from  Mac OS 9 to Mac OS X, where Apple swept away almost every aspect of its previous operating system and built a new one from the foundation up, macOS 11 is still fundamentally macOS 10. Early betas were even labeled as macOS 10.16, and Big Sur can still identify itself as version 10.16 to some older software in order to preserve compatibility. Almost everything will still  work the same way—or, at least, Big Sur doesn’t break most software any more than older macOS 10 updates did. It may even be a bit  less disruptive than Catalina was. This ought to be a smooth transition, most of the time.\n We won’t be making any major changes to how we approach this review, either. We’ll cover the operating system’s new look and new features—the things that any Big Sur Mac will be able to do, regardless of whether it’s running on an Intel or an Apple Silicon Mac. To the extent that it’s possible to do without final hardware in-hand, we’ll cover the new macOS features that will be native to Apple Silicon Macs and outline how the software side of the transition will go.", "posttime": "2020-11-13 19:13:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sur,mac", "title": "MacOS 11.0 Big Sur：ARS技术回顾", "title_en": "macOS 11.0 Big Sur: The Ars Technica review", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/11/macos-11-0-big-sur-the-ars-technica-review/", "via": "", "real_tags": ["sur", "mac"]}, {"category": "", "categoryclass": "", "imagename": "7bb4064b99d0f39e3825aa466d96ebe1.jpg", "infoid": 1034884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管亚马逊通过各种方式让购物变得更加方便，但最后一英里的送货可能是个问题。该公司的关键服务就是试图解决这些问题，提供一种即使在居民不在家或无法联系到包裹的情况下也能递送包裹的方式。\n目前，该公司提供送货上门、送车和送货服务。后者于2019年推出，拥有50个城市，据该公司称，目前已达到4000多个城市。这些城市包括纽约、洛杉矶、芝加哥、费城、达拉斯、华盛顿特区、休斯顿、波士顿、亚特兰大和凤凰城。还有数千个附近的小城镇也在名单上。向纽约的阿斯托里亚欢呼吧。\n这一功能对拥有Myq车库门开启器的Prime会员开放，司机可以使用。除了现有的送货功能，亚马逊从今天开始在几个城市增加车库杂货送货服务，包括芝加哥、达拉斯、洛杉矶、旧金山和西雅图。这项功能将仅限于选定的地区，并将在未来的某个未指明的时间点扩展到其他美国城市。", "note_en": "For all the myriad ways  Amazon   has made shopping more convenient, the last-mile delivery can be an issue. The company’s Key service is an attempt to address those issues, offering a way for packages to get delivered even when residents aren’t home or are otherwise unreachable.\n Currently the company offers home, car and garage delivery options. The latter, which launched in 2019 with 50 cities, now reaches more than 4,000, according to the company. The cities include New York, Los Angeles, Chicago, Philadelphia, Dallas, Washington, D.C., Houston, Boston, Atlanta and Phoenix. There are thousands of nearby smaller cities and towns on the list, as well. Shout out to Astoria, New York.\n The feature is open to Prime members who have a myQ garage door opener, which drivers can access. In addition to the existing delivery features, Amazon is adding in-garage grocery delivers in a handful of cities starting today, including Chicago, Dallas, Los Angeles, San Francisco and Seattle. The feature will be limited to select areas and will be expending to other U.S. cities at some unspecified point in the future.", "posttime": "2020-11-13 19:08:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,亚马逊,amazon,送货,garage", "title": "\n亚马逊的车库送货服务现已覆盖美国4000个城市", "title_en": "\n\t\t\t\tAmazon’s in-garage delivery is now available in 4,000 US cities\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/amazons-in-garage-delivery-is-now-available-in-4000-us-cities/", "via": "", "real_tags": ["美国", "亚马逊", "amazon", "送货", "garage"]}, {"category": "", "categoryclass": "", "imagename": "5511a634e446309963feb6c1d08afc30.jpg", "infoid": 1034883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，化妆品世界也经历了一些快速的变化，事实证明，对于新兴的直接面向消费者和有影响力的品牌来说，化妆已经特别成熟。许多传统品牌的收入大幅下降，而其他品牌则通过采用新的技术和销售渠道趋势证明了自己的韧性。\n早在2018年，欧莱雅就做出了一个有趣的决定，收购了一家名为ModiFaces的增强现实过滤器公司。快进到2020年，他们选择推出一系列“虚拟化妆”自拍滤镜。“招牌脸”滤镜展示了该公司的眼妆、口红和美发产品。\n它们的应用范围相当广，推出的产品支持Instagram、Snapchat、Snap Camera和谷歌二人组(Google Duo)。尤其是Snap摄像头的支持，使得这些自拍可以在Houseparty和Zoom等大量视频聊天服务中使用；欧莱雅将这些自拍作为一种特别的方式在视频通话中为你的外表增添情趣。你可以在他们的网站上查看我们关于在哪里可以使用过滤器的更多详细信息。\n就滤镜本身而言，没有什么比Snapchat上流行多年的以化妆为中心的自拍滤镜更先进的了，但有趣的是，看到一个如此强大的品牌如此大力地倾斜，并提出这样的想法，即人们在视频通话中以一种不花哨的方式使用自拍滤镜。目前还不清楚技术或消费者习惯是否已经存在，但事情肯定会朝着这个方向发展，特别是在社交媒体应用开始更专注地成为商务平台的情况下。", "note_en": "The cosmetics world has also seen some rapid change in the past several years as makeup has proven particularly ripe for up-and-coming direct-to-consumer and influencer-endorsed brands to take hold. Plenty of legacy brands have seen their revenues decimated, while others have proven resilient by leaning into new tech and sales channel trends.\n Back in 2018, L’Oréal made the interesting decision to buy an augmented reality filter company called Modiface. Fast-forward to 2020 and they’ve opted to roll out a line of “virtual makeup” selfie filters. The “Signature Face” filters show off eye makeup, lipsticks and hair products from the company.\n  They’ve gone fairly wide, with the rollout supporting  Instagram,   Snapchat,  Snap   Camera and Google Duo. Snap Camera support in particular enables the selfies to be used across plenty of video chat services like Houseparty and Zoom; L’Oréal is marketing these selfies as a way to spice up your look on video calls specifically. You can check our more details on where you can use the filters on their  site.\n In terms of the filters themselves, there’s nothing terribly more advanced about them than the makeup-centric selfie filters that have been floating around Snapchat for years, but it is interesting to see such a substantial brand leaning in so heavily and pitching this idea where people use selfie filters during video calls in a non-gimmicky way. It’s not clear whether the technology or consumer habits are there yet but it’s certainly plausible that things could move in that direction, especially as social media apps begin a more focused drive toward becoming commerce platforms.", "posttime": "2020-11-13 19:08:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "虚拟化,推出,rolls,品牌", "title": "\n欧莱雅推出“虚拟化妆”系列", "title_en": "\n\t\t\t\tL’Oréal rolls out a line of ‘virtual makeup’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/loreal-rolls-out-a-line-of-virtual-makeup/", "via": "", "real_tags": ["虚拟化", "推出", "rolls", "品牌"]}, {"category": "", "categoryclass": "", "imagename": "6d90adfbe07a139a24dc85946278f6bc.jpg", "infoid": 1034882, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当然，《变形金刚3》是人工智能模型的最新版本，它写出了如此令人信服的副本，以至于天底下的每个人都让它写下关于它的专栏，然后试图通过在结尾透露事实来让读者大吃一惊。GPT-3，也就是生成性预先训练好的变形金刚3，当然是最新版本的人工智能模型。(不过，通常会有一些说法。)。\n不过，访问权限受到了谨慎的限制，Otherside AI的团队与OpenAI有着一种温馨但没有特征的关系。这件事始于团队在做之前的项目时，发现他们的电子邮件太多了，超出了他们的处理能力。当时，GPT-3的前身GPT-2非常流行。\n首席执行官马特·舒默说：“我们用它创建了一个冷冰冰的电子邮件系统，但后来我们想--这可能是我们应该追求的业务。”“所以我们决定全力以赴。”\n他和同事杰森·库珀伯格(Jason Kuperberg)和迈尔斯·费尔德斯坦(Miles Feldstein)制作了一个演示，当他们将其发布到Twitter上时，引起了一些关注，并很快获得了使用新版本GPT引擎的权限。\nOpenAI可以说已经完成了这个令人惊叹的语言引擎的困难部分，但它不是让它在某人的收件箱中疯狂运行那么简单。无拘无束的GPT-3会把自己的尾巴追进兔子洞，产生真正奇怪的东西，任何AI地下城的玩家都可以证明这一点。\n舒默说：“GPT-3是一个令人惊叹的演示，但把它放到产品中则是另一回事。”“从某种意义上说，我们的工作是驯服它的创造力。”\n由此产生的产品将摘要或要点转换为完整的电子邮件，并看起来如下所示：\n如果你不喜欢结果，或者有错误，或者你只是喜欢折磨人工智能，你可以点击按钮，它会以不同的方式再次生成它。首先稍微调整一下，系统就会明白，将来你会更喜欢新的方式。\nGPT系统对数百万个单词和短语进行训练，然后在输入工作后，在该语料库的启发下生成文本。在这种情况下，系统输入的不仅仅是你的要点，还有来自电子邮件链和用户过去偏好的其他信息。\n如果提到咖啡，它可能会说“很高兴和你坐下来喝杯咖啡”，即使你在行李牌上只写了“见到你很高兴”。它还可以学习你的风格，喜欢某些单词或短语，或者学习你喜欢用某种方式结束。\n它可以在技术和财务细节上做出很好的猜测，比如在提供工作机会时：\n当然，对于如此重要的事情，你可能会问：为什么要让人工智能来做这件事呢？\n这有点像一辆车的时速可以达到120英里，但你开的速度永远不会超过80英里(好吧，…。90)。你想知道这件事不会一离开它最明显的用例就会崩溃。对于Otherside AI的模型来说，这意味着足够健壮，可以处理“严肃”的电子邮件，即使它最有可能花时间替换死记硬背的邮件。\n库珀伯格说，该公司有近1万人等待进入测试版，已经看到工程师和开发人员以及销售和支持人员的兴趣。在支持或销售场景中，用户可以立即看到应用程序，其中可以重新生成一些脚本问题或回复，使其每次都有所不同，或者根据人员或情况进行略微调整。这就避免了收到一封“表格电子邮件”的感觉，尽管它等同于收到一封电子邮件。\n我提到了帮助那些打字有困难的人的可能性--那些必须用凝视检测逐个字母写电子邮件的人可能会发现这一点非常令人信服。舒默说，他们的雷达一开始就没有显示这一点，但在过去的几周里，他们看到了这个方向的兴趣。\n舒默小心翼翼地确保安全第一，这不是一个数据窃取操作-显然没有人会想要使用一个读取你的电子邮件并将这些信息用于邪恶目的的工具，除了Gmail。\n他们对自己的方法感到安全，指出谷歌似乎更感兴趣的是为上下文选择正确的回复，而文本生成工具还不够强大，无法轻松处理其他基于GPT-3的系统处理的输入。\n“如果你想用用户的语气发一封电子邮件，它无法猜测细节。它需要一个人类。这不是一种产生的反应，它是在引导方向。“舒默说。\n这轮260万美元的种子融资由Madrona Venture Group牵头，Active Capital、Hustle Fund第一章和更多公司参与其中。这一切都是为了建立团队，这样公司就可以制造出全面的产品。\n最终，他们设想这是对一个更大的人工智能连锁系统的小规模测试，这个系统可以安全可靠地相互连接，以类似人类的方式回答问题和提供信息，但只需最少的人工参与。显然，这在某种程度上是一个长期目标，但考虑到十多年来关于取代电子邮件的所有讨论都无济于事，或许是时候接受它了，但让其他人(或其他人)来承担一点负担。", "note_en": "GPT-3, or  Generative Pre-trained Transformer 3, is of course the latest version of the AI model that writes  such convincing copy that everyone under the sun has let it write their column about it, and then attempted to surprise readers by revealing the fact at the end. (There are usually a few tells, though.)\n Access is carefully limited, though, and the team at  OthersideAI   has a cozy but uncharacterized relationship with  OpenAI  . It began when the team was working on their previous project, and found they had more emails than they could handle. At the time, GPT-3’s predecessor GPT-2 was in vogue.\n   “We built a cold email thing with it, but then we thought — that might be the business we should be pursuing,” said CEO Matt Shumer. “So we decided to go all in.”\n He and his colleagues Jason Kuperberg and Miles Feldstein built a demo that got a bit of attention when they posted it to Twitter, and soon obtained access to the new version of the GPT engine.\n OpenAI arguably already did the hard part by building this astonishing language engine, but it’s not as simple as letting it run wild in someone’s inbox. Unrestrained, GPT-3 will chase its own tail down a rabbit hole, producing truly strange stuff, as any player of AI Dungeon can attest.\n “GPT-3 makes an amazing demo, but putting it in a product is another story,” said Shumer. “Our job is in a sense to tame its creativity.”\n The resulting product turns a summary or bullet points into a complete email, and looks like this in action:\n  If you don’t like the result, or there’s an error, or you just like torturing AIs, you can hit the button and it’ll generate it again, differently. Tweak it a bit first and the system will understand that in the future you’d prefer the new way.\n The GPT systems are trained on millions of words and phrases, and then generate text inspired by that corpus after being given an input to work from. In this case the system takes as input not just your bullet points, but other information from the email chain and the user’s past preferences.\n That way it picks up not just context: it may say “It was great to sit down for coffee with you” if coffee is referenced even if you only wrote “good to meet” in the bullet. And it also learns your style, preferring certain words or phrases or learning that you like to sign off a certain way.\n It can make good guesses at technical and financial details, such as in making a job offer:\n  Of course, for something so important, you may wonder: why bother letting an AI do it at all?\n It’s sort of like how a car  can go 120 MPH, but you never drive it faster than 80 (okay… 90). You want to know the thing isn’t going to fall apart as soon as it leaves its most obvious use case. For OthersideAI’s model, this means being robust enough to handle “serious” emails even if it’s most likely to spend its time replacing rote messages.\n Kuperberg said the company, which has almost 10,000 people waiting to get into its test version, has seen interest from engineers and developers as well as sales and support people. One instantly sees the application in a support or sales scenario where a handful of scripted questions or replies can be re-generated to be different every time, or slightly adjusted for the person or situation. That avoids the feeling of receiving a “form email” even though it amounts to the same thing.\n I mentioned the possibility of helping people who have trouble typing — someone who must write emails letter by letter using gaze detection might find this extremely compelling. Shumer said this hadn’t been on their radars to begin with but that in the last few weeks they’ve seen interest from this direction.\n  Shumer was careful to assure that security comes first and this isn’t a data-sucking operation — obviously no one would want to use a tool that reads your email and uses that info for nefarious purposes, with the notable exception of Gmail.\n They feel secure in their approach, noting that Google seems more interested in selecting the right reply for the context, and text generation tools aren’t robust enough to handle the inputs OthersideAI’s GPT-3-based system handles with ease.\n “If you want to make an email in the tone of the user, it can’t guess about the details. It needs a human. This isn’t a generated response, it’s taking direction,” Shumer said.\n The $2.6 million seed round was led by  Madrona Venture Group,   with Active Capital, Hustle Fund, Chapter One and more participating. It’s all going toward building the team so the company can build a full-scale product.\n Ultimately, they envision this as a small-scale test for a larger system of interlocking AIs that can safely and securely connect with one another, answering questions and providing information in a human-like way but with only the minimum human involvement. Obviously that’s somewhat of a long-term goal, but given all the talk for a decade or so about replacing email has come to nothing, perhaps it’s time to embrace it but let someone (or something) else take on a bit of the load.", "posttime": "2020-11-13 19:08:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ai,write,电子邮件", "title": "\nOtherside AI筹集260万美元让GPT-3为你写电子邮件", "title_en": "\n\t\t\t\tOthersideAI raises $2.6M to let GPT-3 write your emails for you\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/othersideai-raises-2-6m-to-let-gpt-3-write-your-emails-for-you/", "via": "", "real_tags": ["ai", "write", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "65c7de09204413d5961b95eb80c77faa.jpg", "infoid": 1034881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "InFeedo是一家成立四年的人力分析SaaS初创公司，总部设在古尔冈。InFeedo周四表示，它在新一轮融资中筹集了320万美元-但没有具体说明融资的名称。Bering Capital牵头了这轮融资，其创始人本杰明·凌(Benjamin Ling)已在InFeedo担任董事会席位。凌志强曾担任Khosla Ventures的普通合伙人，并曾在谷歌(Google)和Facebook担任高管。\nGreen Visor Capital的Simon Yoo、经济型住宿初创公司Oyo的首席战略官Maninder Gulati、软银(SoftBank)欧洲、中东和非洲地区董事总经理穆尼什·瓦尔马(Munish Varma)以及SaaS巨头FreshWorks的创始人吉里什·马特鲁布塔姆(Girish Mathrubootham)都参与了这轮融资。\n随着一家企业的发展壮大，员工人数激增到数千人、1万人和数万人，首席执行官不可能真正地与员工打交道，以衡量他们的士气，并了解他们是否希望公司做出任何改变。\n成立四年的初创公司InFeedo的创始人兼首席执行官坦玛亚·贾恩(Tanmaya Jain)解释说，InFeedo正在通过Amber来应对这一挑战。Amber是InFeedo打造的聊天机器人，它定期与员工联系，迅速了解事情的进展情况。\n在后台，高管们可以查看整个公司员工的状况，以及一些人--特别是顶尖人才--离开公司的可能性有多大。他们可以准确地检查这些员工过去提出了什么问题，以及他们的担忧是否得到了解决。\n琥珀之所以能够跟踪进度，是因为它记住了员工之前分享的内容。因此，每一次未来的谈话都是以询问自上次与员工交谈以来是否有任何有意义的改变开始的。\n“大约三年前，我们在OYO开始使用琥珀，我对这个产品感到惊讶。当我们在世界各地扩张时，我们利用这一点进行高管决策，以准确了解我们的员工在不同地理位置、不同职能部门的脉搏。我真的联系了坦马亚，很高兴能成为这次旅程的一部分。“Oyo的Gulati在一份声明中说。\nInFeedo已经在50多个国家积累了100多家客户-包括GE Healthcare、彪马、从钢到盐的综合企业塔塔集团(Tata Group)、电信公司Airtel、电脑供应商联想(Lenovo)、Oyo、印度互联网集团Times Internet和教育科技巨头Byju‘s。目前有超过30万用户使用InFeedo的服务。如今，这家初创公司的年收入达到160万美元，贾恩表示，他正在努力达到1000万美元。\n对于26岁的贾恩来说，InFeedo目前的头像是他在这家初创公司做出的第三个转折点。InFeedo最初是一个教育技术平台，在学生和他们的老师之间建立反馈循环。这家初创公司随后探索为公司建立一个社交网络。他解释说，这两个想法都没有获得太多吸引力。在第三次尝试中，贾恩说，他花了几天时间在早期客户那里，确切地了解他们需要什么功能。\n作为新一轮融资的一部分，迄今已筹集400万美元的InFeedo表示，已向早期投资者和早期员工或离职人员提供了110万美元的部分退出。他说：“帮助我周围的人赚这么多钱对我来说是最有成就感的事情之一。”他补充说，在疫情爆发期间，这种流动性对许多人非常有用。\n这家初创公司计划部署新的资金，让Amber理解多种语言，贾恩表示，这是一个关键方面，将帮助这家初创公司更好地为印度邻近市场的客户服务。InFeedo还希望扩大琥珀的使用案例，并试验GPT-3等新技术。该公司还在招聘产品、工程和营销领导职位。", "note_en": "InFeedo, a four-year-old people analytics SaaS startup with headquarters in Gurgaon, said on Thursday it has raised $3.2 million in a new financing round — the name of which it did not specify.  Bling Capital   led the round and its founder, Benjamin Ling, who previously served as a general partner at Khosla Ventures and executive roles at Google and Facebook, has assumed a board seat at InFeedo.\n Simon Yoo of Green Visor Capital, Maninder Gulati, chief strategy officer at budget lodging startup Oyo, Munish Varma, managing director for EMEA region at SoftBank and Girish Mathrubootham, founder of SaaS giant Freshworks, are among those who participated in the round.\n  As a business grows up and the headcount balloons over thousand, ten thousand, and tens of thousands, it becomes impossible for the chief executive to engage meaningfully with employees to gauge their morale and understand if there is anything they wish the company changed.\n InFeedo is tackling this challenge through Amber, a chatbot it has built that touches base with employees periodically to quickly check how things are going, explained Tanmaya Jain, founder and chief executive of the four-year-old startup.\n On the backend, executives can check the status of their employees across the company and how likely some individuals — especially the top talent — are at leaving the firm. They can check exactly what issues these employees have raised in the past, and whether their concerns were resolved.\n Amber is able to track the progress because it remembers what an employee has previously shared. So each future conversation begins with it asking whether anything has meaningfully changed since the last time it spoke to the employee.\n “Almost three years ago, we started using Amber at OYO and I was amazed by the product. We were using this for executive decision-making, to get an accurate pulse of our employees across geographies, functions as we were expanding across the world. I actually reached out to Tanmaya and am excited to be part of this journey,” said Oyo’s Gulati in a statement.\n InFeedo has amassed more than 100 customers — including GE Healthcare, Puma, steel-to-salt conglomerate Tata Group, telecom firm Airtel, computer vendor Lenovo, Oyo, Indian internet conglomerate Times Internet and edtech giant Byju’s — across over 50 countries. More than 300,000 users today use InFeedo’s service. The startup today is clocking an annual revenue run rate of $1.6 million, something Jain said he is working to get to $10 million.\n For Jain, 26, InFeedo’s current avatar is the third pivot he has made at the startup. InFeedo started as an edtech platform to create a feedback loop between students and their teachers. The startup then explored building a social network for companies. Neither of those ideas gained much traction, he explained. During the third attempt, Jain said he spent days at his early customers to understand exactly what features they needed.\n As part of the new financing round, InFeedo, which has raised $4 million to date, said it has delivered partial exits of $1.1 million to early investors and early employees or those who left. “Helping people around me make so much money has been one of the most fulfilling things for me,” he said, adding that this liquidity at the time of a pandemic has been immensely useful to many.\n The startup plans to deploy the new funding to make Amber understand multiple languages, a key aspect that Jain said would help the startup better serve clients in adjacent markets to India. InFeedo also wants to expand the use cases of Amber and experiment with new technologies such as GPT-3. It is also hiring for product, engineering and marketing leadership roles.", "posttime": "2020-11-13 19:07:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "capital,led,员工", "title": "\nInFeedo融资320万美元，由Bling Capital牵头", "title_en": "\n\t\t\t\tInFeedo raises $3.2 million led by Bling Capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/infeedo-raises-3-2m-led-by-bling-capital-delivers-1-1m-exit-to-early-employees-and-investors/", "via": "", "real_tags": ["capital", "led", "员工"]}, {"category": "", "categoryclass": "", "imagename": "8c16d1da53d28ff40b6c95dad83236b0.jpg", "infoid": 1034880, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这起集体诉讼指控亚马逊未能妥善保护其仓库工人，并违反了纽约市人权法以及联邦和州法律的规定。\n斯莫尔斯在一份声明中说：“我是一名忠诚的员工，我把我的一切都献给了亚马逊，直到我被无礼地解雇，就像昨天的垃圾一样被扔到一边，因为我坚持让亚马逊保护其敬业的员工不受新冠肺炎的伤害，”斯莫尔斯在一份声明中说。“我只是想让亚马逊为工人提供基本的防护装备，并对工作场所进行消毒。”\n今天，我在纽约州代表所有@亚马逊员工和所有基本员工提起了集体诉讼，这些员工在这场流行病期间在世界各地都没有受到保护。正如我在开头所说的，这不是亚马逊VS克里斯·斯莫尔斯，而是亚马逊VS People@jeffbezos。\n亚马逊没有对这起诉讼发表具体评论，但表示支持黑人员工、客户及其合作伙伴。\n亚马逊发言人丽莎·莱万多夫斯基(Lisa Levandowski)在接受TechCrunch采访时表示：“亚马逊的使命是成为全球最以客户为中心的公司，这一使命对我们在多元化和包容性方面的工作至关重要。”“多样化的团队帮助我们以更大和不同的方式思考我们为客户打造的产品和服务，以及我们工作场所的日常性质--这在我们的14条领导原则中得到了强化，这些原则提醒团队成员寻求不同的视角，学习和好奇，并不断赢得他人的信任。”\n这起诉讼得到了牧师杰西·杰克逊(Jesse Jackson)的支持，杰克逊说，他与斯莫尔斯和其他亚马逊仓库工人站在一起。\n杰克逊牧师在一份声明中说：“从仓库到监狱，新冠肺炎在很多层面上对黑人和布朗社区产生了不成比例的影响。”“这是一个看不见的敌人，正在杀害我们的社区。克里斯的案例是一个典型的例子，说明了企业的贪婪和麻木不仁会让社区暴露在数不清的、不必要的风险中。\n今年3月，在亚马逊位于斯塔滕岛(Staten Island)的一个履约中心组织了一场罢工后，斯莫尔斯被亚马逊解雇。因此，纽约州总检察长正在调查亚马逊解雇Smalls是否违反了联邦工人安全法和纽约州的举报人保护法。\nSmalls的解雇帮助激励了其他仓库工人，他们后来成立了一个国际组织，要求亚马逊仓库内部做出改变。组织者指出，工人报复是亚马逊工人国际(Amazon Workers International)成立的驱动因素之一。与此同时，据报道，亚马逊高管讨论了诋毁斯莫尔斯的名声，并让他成为组织运动的代言人。\n亚马逊的一位发言人此前告诉TechCrunch，该公司没有因为组织抗议活动而解雇Smalls。相反，亚马逊表示，它解雇了他，因为他“将他人的健康和安全置于危险之中，并违反了他的雇佣条款。”\n这位发言人说：“斯莫斯先生因违反社交疏远准则而多次收到警告。”“他还被发现与新冠肺炎确诊病例的一名确诊伙伴有密切接触，并被要求带薪在家14天，这是我们在世界各地采取的措施。”尽管有人指示他留在家里拿薪水，但他还是来到了现场，进一步让球队陷入了危险之中。", "note_en": "The class action suit alleges Amazon failed to properly protect its warehouse workers and violated elements of New York City’s human rights law, as well as federal and state laws.\n “I was a loyal worker and gave my all to Amazon until I was unceremoniously terminated and tossed aside like yesterday’s trash because I insisted that Amazon protect its dedicated workers from COVID-19,” Smalls said in a statement. “I just wanted Amazon to provide basic protective gear to the workers and sanitize the workplace.”\n  Today I filed a Class Action lawsuit in the state of NY on behalf of all  @Amazon employees and all essential workers that was unprotected all across the world during this pandemic. as I said in the beginning it’s not Amazon vs Chris Smalls it’s Amazon vs the People  @JeffBezos\n Amazon did not specifically comment on the lawsuit but said it stands in solidarity with Black employees, customers and its partners.\n “Amazon’s mission is to be the earth’s most customer-centric company, and this mission is central to our work in diversity and inclusion,” Amazon spokesperson Lisa Levandowski told TechCrunch. “Diverse teams help us think bigger, and differently, about the products and services that we build for our customers and the day-to-day nature of our workplace – this is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and constantly earn others’ trust.”\n The lawsuit has support from Rev. Jesse Jackson, who said he stands in solidarity with Smalls and other Amazon warehouse workers.\n “COVID-19 has disproportionately impacted Black and Brown communities on so many levels, from warehouses to jailhouses,” Rev. Jackson said in a statement. “It’s an invisible enemy that is killing our communities. Chris’ case is a classic example of how corporate greed and insensitivity can literally expose communities to untold and unnecessary risks.”\n  Smalls was  fired from Amazon in March after organizing a walkout at one of the company’s fulfillment centers in Staten Island. As a result,  New York’s attorney general is investigating if Amazon violated federal worker safety laws and New York state’s whistleblower protections laws by firing Smalls.\n Smalls’ termination helped galvanize other warehouse workers who later formed an international organization to demand change inside Amazon’s warehouses. Organizers pointed to worker retaliation as one of the driving factors for the formation of Amazon Workers International. Meanwhile,  Amazon executives reportedly discussed discrediting Smalls and making him the face of the organizing movement.\n An Amazon spokesperson previously told TechCrunch the company did not fire Smalls for organizing a protest. Instead, Amazon said it fired him for “putting the health and safety of others at risk and violations of his terms of employment.”\n “Mr. Smalls received multiple warnings for violating social distancing guidelines,” the spokesperson said. “He was also found to have had close contact with a diagnosed associate with a confirmed case of COVID-19 and was asked to remain home with pay for 14-days, which is a measure we’re taking at sites around the world. Despite that instruction to stay home with pay, he came onsite, further putting the teams at risk.”", "posttime": "2020-11-13 19:07:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,疫情,faces,工人", "title": "\n亚马逊面临诉讼，指控在疫情爆发期间未能向工人提供个人防护用品", "title_en": "\n\t\t\t\tAmazon faces lawsuit alleging failure to provide PPE to workers during pandemic\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/amazon-faces-lawsuit-alleging-failure-to-provide-ppe-to-workers-during-pandemic/", "via": "", "real_tags": ["亚马逊", "amazon", "疫情", "faces", "工人"]}, {"category": "", "categoryclass": "", "imagename": "33f584a11376d0d01d1af24dabcade3d.jpg", "infoid": 1034879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是索特想要解决的问题。该公司刚刚筹集了300万美元的种子资金，以支持其内罗毕和旧金山的业务，这些业务旨在改变非洲航运的物流基础设施-从清关和转运开始。\n其目标不亚于成为通往非洲大陆的数字物流门户。\n“他们正试图改变一个百年来没有任何创新的行业。马龙·尼科尔斯(Marlon Nichols)说，他是Mac Venture Capital的联合创始人兼董事总经理，也是Sote种子融资的投资者之一。“这里非常密集，开放的航道也很有限。搬运东西的唯一方式就是开车。非洲大陆内部缺乏基础设施，把东西运进非洲大陆的途径也很有限。传统的方法只是对…征税。通关的困难。“。\n最初，SOTE推出了一项软件服务，能够实现海关清关和转运，为工业货主提供一个中央仪表盘，供参与这一过程的所有各方使用。\n尼科尔斯说，虽然像FlExport这样的物流初创公司已经设法积累了220亿美元的物流服务估值，但非洲大陆一直没有得到科技开发商的充分服务。索特希望改变这一点。\n该公司的软件可以作为一个工作流程工具来管理货运清算和转运，也可以作为一个仪表盘来跟踪发货状态、支付历史和集装箱的预计到达时间。\nSote是由肯尼亚土生土长的费利克斯·奥瓦(Felix Orwa)和联合创始人梅卡·埃斯特-麦克唐纳(Meka Este-McDonald)和斯科特·雅科(Scott Yacko)创立的。埃斯特-麦克唐纳曾在Verizon和Gigster担任产品经理，斯科特·雅科(Scott Yacko)曾是亚马逊的软件工程总监和沃尔玛。\n考虑到Sote的垂直整合，Mac Venture Capital认为Sote可以开发的潜在市场总额约为200亿美元。\n它可以与科博网络(Kobo Networks)和洛里系统(Lori Systems)等公司合作，这两家公司都建立了由风险投资支持的大型企业，处理寻找卡车运输将商品运往当地市场的内陆物流问题。\n每年大约有2000万个集装箱通过非洲，超过100万个集装箱通过Sote最初的本土市场肯尼亚。肯尼亚实际上占非洲航运市场的六分之一，是非洲大陆第五繁忙的港口，也是通往坦桑尼亚、乌干达、索马里、卢旺达和南苏丹等东非国家的门户。\n该公司对每个处理的集装箱收取大约1000美元的费用，根据Mac Venture Capital的预测，如果它处理的运输只占集装箱总发货量的零点几个百分点，未来10年的年收入可能会达到1亿美元。\n“我们的基础产品实际上就像FlExport，”Orwa说。我们为客户所做的就是Flexport在美国所做的事情，我们帮助制造商在…地区运输货物。他们不需要拿到驾照之类的东西。Flexport是这样做的，因为你必须清关货物并缴税。我们正在向政府机构发放许可证，并帮助纳税。“。\n最终，Sote预计将处理仓储服务，并预订卡车运输。奥瓦说：“这个过程--移动一个集装箱--需要在所有玩家之间来回发送60条来回的电话、短信和电子邮件。”\n为该公司上个月结束的种子期融资提供资金的其他资助者还包括：Ac名人企业、BackStage Capital、Future Africa和GoFundMe董事长罗布·所罗门(Rob Solomon)。尼科尔斯在公司董事会中占有一席之地。", "note_en": "That’s the problem that Sote wants to target. The company just raised $3 million in seed funding to support its Nairobi and San Francisco operations designed to transform the logistics infrastructure for African shipping — starting with customs clearing and forwarding.\n The goal is no less than becoming the digital logistics gateway to the African continent.\n  “They are trying to transform an industry that hasn’t seen any innovation in a century. That’s the case with receiving and forwarding on the continent,” said Marlon Nichols, a co-founder and managing director of MaC Venture Capital and an investor in Sote’s seed round. “It’s so dense and there’s limited open waterways. The only way to move things is by vehicle. There’s a lack of infrastructure inside the continent and limited ways to get things into the continent. The traditional method was just taxing… the difficulty of clearing something through customs.”\n   Initially, Sote’s pitching a software service enabling customs clearing and forwarding to give industrial cargo owners a central dashboard for all of the parties involved in the process.\n While logistics startups like Flexport have managed to amass a $22 billion valuation for logistics services, the African continent has been underserved by tech developers, Nichols said. And Sote is hoping to change that.\n The company’s software can serve as a workflow tool to manage freight clearing and forwarding as well as a dashboard to track shipment status, payment history and the estimated arrival time for containers.\n Sote was founded by the Kenyan native Felix Orwa and co-founders Meka Este-McDonald, a former product manager at Verizon and Gigster, and Scott Yacko a former director of software engineering at Amazon and director of architecture at Walmart.\n MaC Venture Capital puts the total addressable market that Sote could tap at roughly $20 billion, given the company’s vertical integration.\n It can work with companies like Kobo Networks and Lori Systems, which have both built large, venture-backed businesses handling the land-locked logistics problems of finding truck transport to bring goods to local markets.\n There are roughly 20 million containers that move through Africa annually, and over 1 million containers move through Sote’s initial home market of Kenya. Kenya actually accounts for one-sixth of Africa’s shipping market, and is the fifth-busiest port on the continent, as well as the gateway to Eastern African nations like Tanzania, Uganda, Somalia, Rwanda and South Sudan.\n  The company charges approximately $1,000 per container handled, and if it were to handle transport of a fraction of a percent of the total number of containers shipped, it could hit $100 million in annualized revenue in the next 10 years, according to MaC Venture Capital’s predictions.\n  “Our foundational product is actually like Flexport,” Orwa said. “What we do for customers is what Flexport does in the U.S., we help manufacturers move cargo across … they don’t get into having to get into a license and all that. Flexport does because you have to clear the cargo and pay the taxes. We are licensing with the government agency and helping to pay the taxes.”\n Ultimately, Sote expects to handle warehousing services and book transportation on trucks. “That process — to move one container — requires 60 back and forth messages of calls and texts and emails flying back and forth between all of these players,” said Orwa.\n Additional backers who put up cash for the company’s seed round, which closed last month, include  Acceleprise, Backstage Capital, Future Africa and Rob Solomon — the chairman at  GoFundMe. Nichols is taking a seat on the company’s board.", "posttime": "2020-11-13 19:07:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "非洲,希望,africa,sote", "title": "\nSOTE希望成为非洲的航运物流门户", "title_en": "\n\t\t\t\tSote wants to be Africa’s shipping logistics gateway\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/sote-wants-to-be-africas-shipping-logistics-gateway-beginning-with/", "via": "", "real_tags": ["非洲", "希望", "africa", "sote"]}, {"category": "", "categoryclass": "", "imagename": "a1e03f13b93caa82816da7f2f4e8b479.gif", "infoid": 1034878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但在所有这些喧嚣中，另一个对初创企业具有重要意义的行业也受到了影响：教育科技(EdTech)。\n看看疫苗消息传出后，许多科技公司是如何交易的，这有助于我们了解公众投资者是如何看待这些公司的，并评估它们的长期增长前景。\n简而言之，像投资者一样，在疫苗消息传出后抛售edtech，就是押注该行业的增长将受到恢复正常的限制，而一种可靠的疫苗可能会加速这一点。这与TechCrunch关于11月9日软件公司自身抛售的讨论是一个相关的概念，即投资者押注这些公司未来的增长将受到快速恢复正常生活的限制。2020年，由于疫情改变了人们的工作方式和地点，这些公司的增长受到了提振。\n疫苗报道的疗效改变了投资者对未来的看法。但它在多大程度上改变了投资者对edtech未来的预期？在询问我们自己的医疗技术专家娜塔莎·马斯卡伦哈斯(Natasha Mascarenhas)从数据中看到的情况以及从投资者那里听到的情况之前，让我们先看看公开市场的结果。\n上市的教育科技公司并不多，但TechCrunch调查了我们所知道的公司。以下是11月3日(周五)收盘钟声响起后，三个人的立场：\n2U收报每股39.55美元。疫苗消息传出后，该公司周一收盘报31.46美元。价格下跌的价值约为20%。自那以来，该公司的股本大致持平。\nChegg公司6日周五收盘价为每股77.23美元。疫苗消息传出后，周一收盘价为69.51美元。价格下跌的价值约为10%。此后，该公司的股票进一步下跌。\nKahoot上周五收盘报每股64.60挪威克朗(KR)。疫苗消息传出后，该股周一收盘报59.00克朗。价格下跌的价值约为9%。此后，该公司的股票进一步下跌。", "note_en": "But amidst all that noise, another sector that has great import for startups was also taking lumps:  edtech.\n Looking at how a number of edtech companies traded in the aftermath of the vaccine news helps us understand how public investors view the companies and assess their long-term growth prospects.\n Simply put, selling edtech on the vaccine news — as investors did — was a bet that growth in the sector would be constrained by a return to normalcy, something a solid vaccine could hasten. This is a related concept to what  TechCrunch discussed regarding software’s own November 9 selloff — that investors were betting that future growth for those companies, boosted in 2020 by the pandemic shaking up how and where people worked, would be limited by a quick return to regular life.\n The vaccine’s reported efficacy changed how investors see the future. But how much did it change investor expectations for the future of edtech? Let’s examine the public market results before asking our own edtech expert  Natasha Mascarenhas on what she’s seeing in the numbers and hearing from investors.\n  There aren’t many public edtech companies, but TechCrunch surveyed those that we knew about. Here’s where three stood after the closing bell rang on Friday, November 3:\n 2U closed at $39.55 per share. It closed Monday after the vaccine news at $31.46. That price decline was worth about 20%. The company’s equity has been roughly flat since.\n Chegg closed Friday the 6th at $77.23 per share. It closed Monday, after the vaccine news, at $69.51. That price decline was worth around 10%. The company’s equity has fallen further since.\n Kahoot closed Friday the 6th at 64.60 Norwegian kroner (kr) per share. It closed Monday, after the vaccine news, at 59.00 kr. That price decline was worth around 9%. The company’s equity has fallen further since.", "posttime": "2020-11-13 19:07:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,投资者,investors", "title": "\n随着公众投资者对edtech的押注重新定价，炙手可热的创业行业将面临怎样的局面？", "title_en": "\n\t\t\t\tAs public investors reprice edtech bets, what’s ahead for the hot startup sector?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/as-public-investors-reprice-edtech-bets-whats-ahead-for-the-hot-startup-sector/", "via": "", "real_tags": ["创业", "投资者", "investors"]}, {"category": "", "categoryclass": "", "imagename": "b49ee2d926fabeeba793787d61bbd7f6.jpg", "infoid": 1034877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼克·萨恩兹(Nick Saenz)是Lewis&amp；Llewell yn LLP合伙人，专注于就业和商业机密问题。\n然而，加利福尼亚州的商业秘密法关于销售人员一旦跳到竞争对手那里就有能力招揽这些客户的问题，越来越令人困惑，而且未能就允许的行为类型提供有意义的指导。因此，销售人员从目前的公司跳槽到竞争对手是有风险的，因为目前还不清楚他们能否以及在多大程度上能够继续为他们以前工作过的客户或联系人提供服务。\n例如，为增值经销商(VAR)工作的销售人员在转向竞争对手之前，应该了解自己的处境--他们可能会冒着与原始设备制造商(OEM)和最终用户建立长期关系的风险。本文解释了这一问题上相互冲突的法律，以便计划跳槽的销售人员和考虑聘用他们的公司能够了解当前的法律状况。\n在绝大多数州，雇主可以，也确实会要求员工签订某种形式的竞业禁止协议，以换取继续就业。相比之下，加州有一项长期的政策，即优先考虑就业流动性，而不是雇主的担忧。加州的政策体现在“商业和职业法典”16600节中，该节规定：“除本章规定外，任何限制任何人从事任何合法职业、行业或业务的合同在此范围内都是无效的。”\n加州法院“一贯确认，16600条款明确规定了一项有利于公开竞争和员工流动的既定立法政策”，该政策旨在“确保每个公民都有权从事自己选择的任何合法就业和企业”。2该政策还允许加州雇主“有效地竞争其所在行业中最有才华、最有技能的员工，无论他们居住在哪里。”3因此，与大多数州不同，“雇员在自身流动性和改善方面的利益”通常比“雇主的竞争性商业利益”更重要。4.加州法院“一贯认为，雇员在自己的流动性和员工流动方面的既定立法政策”旨在“确保每个公民都有权从事自己选择的任何合法职业和企业”。2该政策还允许加州的雇主“有效地竞争其所在行业中最有才华、最有技能的员工”。\n法院广泛适用了16600条，使竞业禁止协议无效，该条款将禁止或限制员工离开公司为竞争对手工作。5重要的是，法院还宣布合同条款无效，这些条款旨在限制员工离开公司，然后招揽公司客户的能力。6换句话说，销售人员不能因为合同而被禁止离开他们的公司，加入竞争对手，继续与他们以前公司的客户进行招揽、服务和沟通。此外，除了有限的例外，加州法院将无视一项“法律选择”条款，该条款旨在强制法院遵守执行竞业禁止的州的法律。7个", "note_en": "Nick Saenz is a partner at  Lewis &amp; Llewellyn LLP, who focuses on employment and trade secret issues.\n  Yet California trade secret law regarding the ability of salespeople to solicit these customers once they jump to a competitor is increasingly confused and fails to provide meaningful guidance on what type of conduct is permissible. Thus, a salesperson’s move from their current company to a competitor is risky given it is unclear whether and to what extent they can continue servicing clients or contacts they previously worked with.\n A salesperson working for a value-added reseller (VAR), for instance, should understand what they are getting into before moving to a competitor — they may risk longstanding relationships with original equipment manufacturers (OEMs) and end users. This article explains the conflicting law on this issue so that salespeople planning on jumping ship, and the companies considering hiring them, can be informed regarding the current legal landscape.\n  In the vast majority of states, employers can, and do, require employees to enter into some form of non-competition agreement in exchange for continued employment. 1 In contrast, California has a long-standing policy of favoring employment mobility over an employer’s concerns. California’s policy is embodied in Business and Professions Code section 16600, which provides: “Except as provided in this chapter, every contract by which anyone is restrained from engaging in a lawful profession, trade, or business of any kind is to that extent void.”\n California courts “have consistently affirmed that section 16600 evinces a settled legislative policy in favor of open competition and employee mobility” that is intended to “ensure that every citizen shall retain the right to pursue any lawful employment and enterprise of their choice.” 2 The policy also allows California employers to “compete effectively for the most talented, skilled employees in their industries, wherever they may reside.” 3 Accordingly, unlike in most states, the “interests of the employee in [their] own mobility and betterment” generally outweigh the “competitive business interests of the employers.” 4\n Courts have broadly applied section 16600, invalidating non-competition agreements, which would prohibit or restrict an employee from leaving to work for a competitor. 5 Importantly, courts have also invalidated contractual provisions purporting to restrict an employee’s ability to leave and then solicit the company’s customers. 6 In other words, a salesperson cannot be contractually precluded from leaving their company, joining a competitor and continuing to solicit, service and communicate with their former company’s clients. Furthermore, with limited exceptions, California courts will disregard a “choice of law” provision purporting to mandate that the court follow the law from a state that enforces noncompetes. 7", "posttime": "2020-11-13 19:07:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,造成,california,员工", "title": "\n加州商业保密法在客户名单上的冲突造成不确定性", "title_en": "\n\t\t\t\tConflicts in California’s trade secret laws on customer lists create uncertainty\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/conflicts-in-californias-trade-secret-laws-on-customer-lists-create-uncertainty/", "via": "", "real_tags": ["商业", "造成", "员工"]}, {"category": "", "categoryclass": "", "imagename": "0c1b4733bf922f96efcc76d274290a31.jpg", "infoid": 1034876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是根据华特迪士尼公司(Walt Disney Company)第四季度收益报告得出的结论，该报告涵盖了该公司截至10月3日的财务状况。该公司此前表示，截至8月3日，迪士尼+拥有6050万订户。\n这份新闻稿还包括迪士尼其他流媒体服务的订户数量-Hulu有3660万(包括Hulu+Live TV的410万订户)，而ESPN有1030万(比一年前的350万翻了一番多)。\n总体而言，迪士尼直接面向消费者的业务收入同比增长41%，至49亿美元，运营亏损从2019年第四季度的7.51亿美元降至今年的5.8亿美元。迪士尼将亏损的减少归因于“Hulu和ESPN+业绩的改善，但这部分被迪士尼+的成本上升所抵消，因为迪士尼+的推出正在进行中。”\n对于迪士尼来说，这是一个艰难的季度，疫情迫使该公司关闭了一些公园，其余的则减少了运力。迪士尼的收入降至147亿美元(2019年第四季度为191亿美元)，每股亏损0.39美元。\n迪士尼首席执行官鲍勃·查佩克在一份声明中表示：“真正的亮点是我们直接面向消费者的业务，这对我们公司的未来至关重要。在迪士尼+推出一周年之际，我们很高兴地宣布，截至第四季度末，该服务的付费用户已超过7300万--远远超出了我们在第一年的预期，”首席执行官鲍勃·查佩克(Bob Chapek)在一份声明中表示。\n在投资者电话会议上，Chapek还指出，迪士尼+目前已在全球20多个国家推出，并计划周二在拉丁美洲推出。\n与此同时，今天早些时候，迪士尼+将其首部漫威系列电影《幻想曲》(Wandavision)的首映日期从12月推迟到了1月15日。", "note_en": "That’s according to  The Walt Disney Company’s    fourth-quarter earnings report, which covers the company’s finances through October 3. The company previously said Disney+ had  60.5 million subscribers as of August 3.\n The release also includes subscriber numbers for Disney’s other streaming services — Hulu had 36.6 million (including 4.1 million subscribers to Hulu + Live TV), while ESPN had 10.3 million (more than doubling from 3.5 million a year earlier).\n  Overall, Disney’s direct-to-consumer segment saw revenue grow 41% year-over-year to $4.9 billion, while its operating loss fell from $751 million in Q4 2019 to $580 million this year. Disney attributed the shrinking losses to “improved results at Hulu and ESPN+, partially offset by higher costs at Disney+, driven by the ongoing rollout.”\n  It was a tough quarter for Disney overall, with the pandemic forcing the company to keep some parks closed and the rest operating at reduced capacity. Disney’s revenue fell to $14.7 billion (compared to $19.1 billion during Q4 2019), with a loss of $0.39 per share.\n “The real bright spot has been our direct-to-consumer business, which is key to the future of our company, and on this anniversary of the launch of Disney+ we’re pleased to report that, as of the end of the fourth quarter, the service had more than 73 million paid subscribers – far surpassing our expectations in just its first year,” said CEO Bob Chapek in a statement.\n During the investor call, Chapek also noted that Disney+ is currently available in more than 20 countries worldwide, with plans to launch in Latin America on Tuesday.\n Meanwhile, earlier today,  Disney+ pushed the premiere date of its first Marvel series, “Wandavision,” from December until January 15.", "posttime": "2020-11-13 19:07:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "迪士尼,disney", "title": "\n迪士尼+有7300多万订户", "title_en": "\n\t\t\t\tDisney+ has more than 73M subscribers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/disney-73-million-subscribers/", "via": "", "real_tags": ["迪士尼", "disney"]}, {"category": "", "categoryclass": "", "imagename": "70cb84755c6e1c3dba801123370378e9.jpg", "infoid": 1034875, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们看到了来自用户和开发者的大量报告，这些问题阻碍了应用程序的正常发布，特别是那些不是苹果公司开发的应用程序。大多数人报告说，他们已经打开的应用程序没有问题，但试图打开任何新的应用程序，都会导致它一次在被告席上弹来弹去几分钟。\n这个问题今天早上首次出现(奇怪的是，恰逢MacOS Big Sur的发布)，对于一些…来说，这个问题似乎正在改善。但就目前而言，请注意你的应用程序可能不会像预期的那样工作。\n目前还不清楚到底发生了什么，但最流行的理论是，GateKeeper存在服务器端问题，这是一种在发布时验证MacOS应用程序真实性的安全功能。\n更新：太平洋时间下午2点过后，苹果的开发者系统状态页面显示，这个问题现在应该得到解决。\n😅看起来像是，当应用程序启动时，由于苹果服务器不堪重负，网守无法在互联网上检查它们的有效性。所以，呃，让我们都坚持下去！你能行的，果粉们！", "note_en": "We’re seeing a flood of reports from both users and developers of an issue preventing apps — particularly those not made by  Apple   — from properly launching. Most are reporting that apps they already had open are fine, but attempts to open any new apps will result in it just bouncing around in the dock for minutes at a time.\n The issue first popped up this morning (curiously coinciding with the launch of macOS Big Sur) and seems to be improving for some… but for the time being, be aware your apps might not work as expected.\n  It’s unclear exactly what’s happening, but the most popular theory is that there’s a server-side issue with Gatekeeper, the security feature that verifies the authenticity of macOS apps at launch.\n Update:  As of a bit after 2pm Pacific, Apple’s  Developer System Status page says this problem should now be fixed.\n 😅 Looks like, when apps are launched, Gatekeeper is unable to check their validity over the internet, due to overwhelmed Apple servers. So, uh, let’s all hang in there! You got this, Apple devops!", "posttime": "2020-11-13 19:07:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,程序,发布,苹果,应用程序", "title": "\nPSA：MacOS今早有点崩溃，许多非苹果应用程序在发布时挂起", "title_en": "\n\t\t\t\tPSA: macOS is a little broken this morning, with many non-Apple apps hanging at launch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/macos-apps-wont-launch/", "via": "", "real_tags": ["apple", "程序", "发布", "苹果", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "fb7b03ad88ef85c5c05cb2b525991f76.png", "infoid": 1034874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“不包括隐私”已经成为互联网维权人士的年度传统，考虑到智能扬声器、智能安全摄像头和智能垃圾箱的增加，今年有一大批令人毛骨悚然的设备。\n在“令人毛骨悚然”的一端是…。除了Kindle，亚马逊几乎什么都买了。当然，这些设备在设计上向亚马逊发送了大量数据，但Mozilla认为，该公司还没有赢得人们的信任，无法让这类事情被接受。Facebook的门户网站因为类似的原因赢得了一个令人毛骨悚然的位置。\n一些随机的设备，如智能咖啡机和Moleskine智能笔记本，评级令人毛骨悚然，因为它们没有提供任何收集这些信息的公司应该提供的关于数据和安全的保证。这类事情在智能设备中很常见--它们可能从根本上不是令人毛骨悚然的，但制造它们的公司保留随时让它变得令人毛骨悚然的权利。\n另一方面，Withing凭借其合理的隐私政策和安全性的智能设备获得积分。无环智能门铃得分很高，Garmin的智能手表也是如此。\n这些都是基于你的数据可能被滥用或暴露的非正式排名，这并不意味着它们是绝对安全或隐私的。如果你要买这些东西中的一件，最好立即检查一下设置和首选项，禁用任何闻起来有侵入性或令人毛骨悚然的东西。你总是可以再次启用这些功能，但是一旦你把你的数据放在那里，就很难再把它找回来了。", "note_en": "“Privacy not included” has become an annual tradition for the internet rights advocate, and this year has an especially solid crop of creepy devices, given the uptick in smart speakers, smart security cameras and smart litterboxes.\n On the “creepy” end of the spectrum is… pretty much everything by Amazon except the Kindle. The devices in question send tons of data to Amazon by design, of course, but  Mozilla   feels the company hasn’t yet earned the trust to make that sort of thing acceptable. Facebook’s Portal earns a creepy spot for a similar reason.\n   Some random gadgets like a smart coffee maker and Moleskine smart notebook get creepy ratings because they don’t give the kinds of assurances about data and security that any company collecting that information should give. That sort of thing is common in smart gadgets — they may not be fundamentally creepy, but the company that makes them reserves the right to make it creepy at any time.\n On the other end of the spectrum, Withings earns points for its smart devices with reasonable privacy policies and security. Non-Ring smart doorbells get good marks, and Garmin’s smart watches too.\n These are informal rankings based on the potential for abuse or exposure of your data, and it doesn’t mean that they’re perfectly safe or private. If you’re buying one of these things, it’s best to immediately go through the settings and preferences and disable anything that smells invasive or creepy. You can always enable features again, but once you’ve put your data out there, it’s hard to get it back.", "posttime": "2020-11-13 19:07:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "毛骨悚然,creep,智能", "title": "\n送一个小玩意儿？在Mozilla的“隐私不包括”的羞耻名单上检查它的令人毛骨悚然的因素", "title_en": "\n\t\t\t\tGifting a gadget? Check its creep factor on Mozilla’s ‘Privacy not included’ list of shame\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/gifting-a-gadget-check-its-creep-factor-on-mozillas-privacy-not-included-list-of-shame/", "via": "", "real_tags": ["毛骨悚然", "creep", "智能"]}, {"category": "", "categoryclass": "", "imagename": "a18c1fbd36da8a675b7239b41c4404d5.jpg", "infoid": 1034873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity(现已登陆Twitter！)，我们在这里解开头条背后的数字。\n全体股权团队到场就当前的风险资本市场展开辩论，他们好奇的是，如今的风险投资到底有多高或有多低。丹尼(Danny)、娜塔莎(Natasha)和我围绕本周的几条新闻展开了对话，其中包括：\nWrkfrce已经推出，我们想更多地谈论利基媒体的未来，把这家巨头自己的最近一轮融资和Quartz的重组纳入讨论。\n在媒体领域--这一直是一个高风险的风险投资领域--Spotify收购了另一家播客公司，这一次是斥资235美元收购扩音器。我们的想法？一连串的小规模退出可能不会鼓励风投在这个领域承担更多风险(Hunter Walk在这里也说过同样的话)。\n谈到更广泛的风险，我请娜塔莎(Natasha)参与风险投资市场的早期阶段，让丹尼(Danny)参与风险投资市场的后期阶段。资金仍然很多，但它似乎更专注于追逐赢家，而不是支持或支持不那么明显的初创企业。\n这个市场并没有减缓转向更多风险投资公司的冒险行动，因为先锋消息显示，该公司投资于新兴基金管理公司的新重点。\n而且，像Hopin这样的远程工作解决方案仍然有很强的风险承受能力，该公司刚刚以20多亿美元的估值筹集了1.25亿美元。我们在这轮融资中遇到了麻烦，但丹尼很喜欢，而且他曾是一名风险投资人。\n最后，我们聊了聊即将到来的IPO，以及软银(SoftBank)最近的业绩。如果DoorDash、Airbnb和其他公司今年要撤资，它们需要尽快撤资。到目前为止，没有骰子。\n这是忙碌的一周，尽管是一个月。预计下周会有更多这样的事情发生。\n最后，别忘了我们自己的克里斯·盖茨正在把你在YouTube上找到的每一集的Equity视频都删掉。他做得很好，能出现在视频和音频平台上是一件很棒的事情。\n股市每周一上午7点下跌。PDT和周四下午，我们会尽快发布它，所以请订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast ( now on Twitter!), where we unpack the numbers behind the headlines.\n The full Equity crew was on hand to debate the current venture capital market, curious about how risk-on, or risk-off things really are today.  Danny,  Natasha and  I framed the conversation around a number of news items from the week, including:\n Wrkfrce has  launched, and we wanted to chat more about the future of niche media, bringing The Juggernaut’s  own recent round and the  Quartz shakeup into the conversation.\n And on the media front — always a risky venture capital investing domain — Spotify has  snapped up another podcasting company, this time paying $235 for Megaphone. Our take? A string of small exits probably won’t encourage VCs to take on more risk in the space (Hunter Walk said the same thing  here.)\n Turning to risk more generally, I asked Natasha to weigh in on the earlier stages of the venture market, and Danny on its later tranches. There’s still lots of money, but it appears more focused on chasing winners than bolstering or supporting less-obvious startups.\n That market is not slowing a risk-on move toward more venture capital players, as  the Spearhead news showed a new focus for the firm to invest in emerging fund managers.\n And there’s still plenty of risk tolerance in remote-work solutions like Hopin, which  just raised $125 million at a $2+ billion valuation. We’re torn on the round, but Danny likes it and he’s a former VC.\n And we wrapped with a chat about  upcoming IPOs, and the  recent SoftBank results. If DoorDash, Airbnb and others are going to go this year, they need to go soon. So far, no dice.\n It was a busy week, despite the month. Expect more of the same next week.\n  Finally, don’t forget that our own  Chris Gates is cutting Equity videos out of every episode that you can find  over on YouTube. He does a great job and it’s great to be on video, as well as audio platforms.\n Equity drops every Monday at 7:00 a.m. PDT and Thursday afternoon as fast as we can get it out, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-11-13 19:07:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "国家,dllrs", "title": "\n这是我们的国家，也是我们的国家。", "title_en": "\n\t\t\t\tTh O’s r ptinal, th dllrs r mndtry\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/th-os-r-ptinal-th-dllrs-r-mndtry/", "via": "", "real_tags": ["国家", "dllrs"]}, {"category": "", "categoryclass": "", "imagename": "f8bdaf7288a7b6f01cd814d00cc43f18.png", "infoid": 1034872, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Netflix表示，该订阅源包括原创节目和授权节目的剪辑。它还包括现有Netflix社交频道“Netflix Is A Jocket”的视频片段，该频道目前在YouTube、Twitter、Facebook和Instagram上播放片段、较长的视频和其他社交内容。\n快速笑声与TikTok的相似之处在于，它可以垂直滑动，提供全屏视频，并将预订按钮放在右侧。但它并没有试图成为一个在娱乐的同时浪费时间的地方。\n就像Netflix的许多实验一样，Fast Laughs Feed的目标是帮助用户发现一些新的可看的东西。\n与你在社交视频应用程序中喜欢和评论视频不同，这个Feed旨在鼓励用户将节目添加到Netflix的观看列表中，供以后观看。从这个意义上说，它的作用与Netflix的“预览”功能类似，后者帮助用户通过观看热门和新发布节目的剪辑和预告片来发现节目。\n当用户浏览新的Fast Laughs Feed时，他们会看到各种各样的喜剧片段--比如凯文·哈特(Kevin Hart)的单口喜剧特别节目中的片段，或者《办公室》(The Office)中的搞笑片段。这些视频的长度也将从15秒到45秒不等。\n除了将剪辑添加到Netflix的“我的列表”功能中，用户还可以用一个笑脸按钮来回应剪辑，在社交媒体上与朋友分享剪辑，或者点击“更多”按钮来查看与你正在观看的剪辑相关的其他标题。\n英国社交媒体顾问马特·纳瓦拉(Matt Navarra)最先发现了这一功能。在他的应用程序中，快速笑声出现在预览版的前排，在介绍这一功能时，文字写道：“新！”\nNetflix向TechCrunch证实，今年早些时候，该实验曾在少数用户中进行过测试，但最近已于本月开始向更广泛的群体推出，包括英国、美国和其他精选市场的用户。\n目前，只有一小部分Netflix用户可以使用它，这些用户拥有成人档案或其他档案，但iOS设备上没有父母的控制。然而，用户不需要选择参加实验，也不需要使用Netflix应用程序的测试版才能看到这一功能。Netflix说，这更像是一种标准的A/B测试。\n由于这是一项测试，用户可能会看到相同功能的略有不同的版本。该产品也可能随着时间的推移而发展，以响应用户的反馈。\nNetflix并不是第一个为自己的应用程序“借用”TikTok格式的公司。近几个月来，Instagram和Snapchat等社交媒体平台也推出了自己的TikTok竞争对手。\n但Netflix并不是TikTok的直接竞争对手--除了在某种程度上，任何移动应用都会争夺用户的时间和注意力，因为一天只有这么几个小时。\n相反，新的Feed更多的是承认，TikTok格式的全屏垂直视频Feed，侧面有快速互动按钮，正在成为展示娱乐性内容的默认样式。\n“我们一直在寻找新的方法来改善Netflix的体验，”Netflix的一位发言人证实了这一实验。“我们的很多会员都喜欢喜剧，所以我们认为这将是一种令人兴奋的新方式，可以帮助他们发现新节目，欣赏经典场景。”我们在不同的国家和不同的时间段试验这类测试--只有在人们认为有用的情况下才能广泛使用。“他们补充道。", "note_en": "The feed includes clips from both originals and licensed programming, Netflix says. It also includes video clips from the existing Netflix social channel, “Netflix Is A Joke,” which today runs clips, longer videos and other social content across  YouTube,  Twitter,  Facebook and  Instagram.\n Fast Laughs resembles  TikTok   in the sense that it’s swiped through vertically, offers full-screen videos and places its engagement buttons on the right side. But it’s not trying to become a place to waste time while being entertained.\n  Like many of Netflix’s experiments, the goal with the Fast Laughs feed is to help users discover something new to watch.\n Instead of liking and commenting on videos, as you would in a social video app, the feed is designed to encourage users to add shows to their Netflix watch list for later viewing. In this sense, it’s serving a similar purpose to Netflix’s “Previews” feature, which helps users discover shows by watching clips and trailers from popular and newly released programming.\n As users scroll through the new Fast Laughs feed, they’ll encounter a wide range of comedy clips — like a clip from a Kevin Hart stand-up special or a funny bit from “The Office,” for example. The clips will also range in length anywhere from 15 to 45 seconds.\n In addition to adding clips to Netflix’s “My List” feature, users can also react to clips with a laughing emoji button, share the clip with friends across social media, or tap a “More” button to see other titles related to the clip you’re viewing.\n  The feature was first spotted by social media consultant  Matt Navarra, based in the U.K. In his app, Fast Laughs appeared in front of the row of Previews, where it was introduced with text that said “New!”\n Netflix confirmed to TechCrunch the experiment had been tested with a small number of users earlier this year, but has recently started rolling out to a wider group this month — including users in the U.K., the U.S. and other select markets.\n It’s currently available to a subset of Netflix users with adult profiles or other profiles without parental controls on iOS devices only. However, users don’t need to be opted in to experiments nor do they need to be on a beta version of the Netflix app to see the feature. It’s more of a standard A/B test, Netflix says.\n And because it’s a test, users may see slightly different versions of the same feature. The product may also evolve over time, in response to user feedback.\n  Netflix is hardly the first to “borrow” the TikTok format for its own app. Social media platforms, like Instagram and Snapchat, have also launched their own TikTok rivals in recent months.\n But Netflix isn’t a direct competitor with TikTok — except to the extent that any mobile app competes for users’ time and attention, as there are only so many hours in a day.\n Instead, the new feed is more of an acknowledgment that the TikTok format of a full-screen vertical video feed with quick engagement buttons on the side is becoming a default style of sorts for presenting entertaining content.\n “We’re always looking for new ways to improve the Netflix experience,” a Netflix spokesperson said, confirming the experiment. “A lot of our members love comedy so we thought this would be an exciting new way to help them discover new shows and enjoy classic scenes. We experiment with these types of tests in different countries and for different periods of time — and only make them broadly available if people find them useful,” they added.", "posttime": "2020-11-13 19:06:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tiktok,latest", "title": "\nNetflix的最新实验是一个类似TikTok的搞笑视频订阅源", "title_en": "\n\t\t\t\tNetflix’s latest experiment is a TikTok-like feed of funny videos\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/netflixs-latest-experiment-is-a-tiktok-like-feed-of-funny-videos/", "via": "", "real_tags": ["tiktok", "latest"]}, {"category": "", "categoryclass": "", "imagename": "dd22282061348edea2d355dc3699360d.jpg", "infoid": 1034871, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我在2016年第一次写到这家初创公司时，它的重点是帮助用户跟踪和取消不想要的订阅。从那时起，它扩展到了其他金融产品，比如你的个人开支报告，以及议价更低的账单的能力。\n本周，首席营收官叶海亚·莫赫塔尔扎达(Yahya Mokhtarzada)告诉我，随着疫情导致广告成本大幅下降，TrueBill能够使电视广告成为接触新用户的关键渠道。\n当然，金融不确定性也让这款产品更具吸引力--特别是它的智能储蓄工具，用户可以自动为自己的目标预留资金。\nMokhtarzada说：“人们意识到需要一些缓冲。”“你应该在事情进展顺利的时候，在你需要之前就开始存钱，但(在大流行期间)存钱总比根本不存钱好。”我们看到智能储蓄的采用率大幅上升，达到了历史最高水平。\n新一轮融资使TrueBill的总融资达到4000万美元。它由Bessemer Venture Partners牵头，Eldridge Capital、Cota Capital、Firebolt Ventures和Day One Ventures参与其中。\n这家初创公司表示，这轮融资将使其能够开发新的产品和功能，包括净资产跟踪、自动债务支付和共享账户。\nMokhtarzada补充说，该公司将在数据科学方面投入巨资，以帮助追随其财务健康的“北极星”，他说，“数据挑战是巨大的。”\n当然，识别一个人的财务状况是很简单的，但真正的目标是“在趋势和不足发生之前发现它们”。\n例如，Mokhtarzada说，当用户在账户上被收取透支费时，不是简单地提醒他们，“更有帮助的是让预测模型分析数据，预测现金流短缺，并有合适的工具来防止它。”", "note_en": "When  I first wrote about the startup in 2016, it was focused on helping users track and cancel unwanted subscriptions. Since then, it’s expanded into other financial products, like reports on your personal expenses and the ability to negotiate lower bills.\n This week, Chief Revenue Officer Yahya Mokhtarzada told me that with the pandemic leading to a dramatic reduction in ad costs,  Truebill   was able to make TV advertising a key channel for reaching new users.\n  And of course, the financial uncertainty has made the product more appealing too — particularly its smart savings tool, where users can automatically set aside money for their goals.\n “People became aware of the need to have some cushion,” Mokhtarzada said. “You should start saving when things are going well, before you need it, but [saving during the pandemic] is better than not doing it at all. We’ve seen a big bump in smart savings adoption, which is at an all-time high.”\n  The new round brings Truebill’s total funding to $40 million. It was led by  Bessemer Venture Partners,   with participation from Eldridge Capital, Cota Capital, Firebolt Ventures and Day One Ventures.\n The startup says the round will allow it to develop new products and features, including net worth tracking, automated debt payments and shared accounts.\n Mokhtarzada added that the company will be making big investments in data science to help follow its “north star” of financial health, where he said, “The data challenge is significant.”\n Sure, it’s pretty straightforward to recognize whether someone’s doing well or poorly financially, but the real goal is to “recognize trends and shortfalls before they happen.”\n For example, instead of simply alerting users when they’ve been charged an overdraft fee on their account, Mokhtarzada said, “What is helpful is to have predictive models analyze data to anticipate a cashflow shortage and have the right tools in place that prevent it.”", "posttime": "2020-11-13 19:06:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "金融,finance", "title": "\n个人金融初创公司TrueBill融资1700万美元", "title_en": "\n\t\t\t\tPersonal finance startup Truebill raises $17M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/truebill-series-c/", "via": "", "real_tags": ["金融", "finance"]}]