[{"category": "", "categoryclass": "", "imagename": "f22887312a9f17db31857107e96ff348.jpg", "infoid": 1068159, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Western Digital我的书NAS所有者全球发现他们的设备已被神秘的出厂重置和所有文件删除。\n WD我的书是一个网络连接的存储设备，看起来像一本可以站在桌面上的小垂直书。 WD我的预订Live应用程序允许所有者访问他们的文件并远程管理其设备，即使NAS位于防火墙或路由器后面也是如此。\n 今天，WD我的书业主突然发现，他们的所有文件都是神秘的删除，他们无法再通过浏览器或应用程序登录设备。\n 当他们试图通过Web仪表板登录时，该设备指出它们具有AN＆＃34;无效的密码。＆＃34;\n ＆＃34;我有一个我的书，我的书与我的家里有关，多年来工作罚款。我刚刚发现，在某种程度上，今天的所有数据都消失了，而目录似乎在那里但是空的。以前，2T的卷几乎是满满的，但现在它显示了全部容量，＆＃34;一个WD我的书店在西方数字社区论坛上报告。\n ＆＃34;即使是奇怪的事情是当我尝试登录控制UI进行诊断时，我只是能够使用输入框的“所有者密码”的输入框进入此着陆页。我已经尝试了默认的密码“admin”，也是我可以为它设置的东西没有运气。＆＃34;\n   在进一步所有者确认其设备遭遇同样的问题后，业主报告说，MyBook日志显示，该设备已收到远程命令，以便在昨天和夜晚开始于下午3点开始的工厂重置。 \n＆＃34;我在User.log的这个驱动器中找到了这个驱动器今天：6月23日15:14:05我的书柜FactoryRestore.sh：开始脚本：6月23日15:14:05我的书橱关闭[24582]：关闭系统重新启动6月23日16:02:26我的书柜s15mountdatavolume.sh：begin脚本：启动6月23日16:02:29我的书柜_：pkg：wd-nas 6月23日16:02:30我的书柜_：pkg：网络 - 综合将军23 16:02:30我的书柜_：PKG：Apache-Php-webdav Jun 23 16:02:31我的书橱_：PKG：Date-Time Jun 23 16:02:31我的书柜_：PKG：警报Jun 23 16:02:31我的书柜logger：hostname =我的booklive 6月23日16:02:32我的书柜_：pkg：admin-rest-api我相信这是为什么这发生的罪魁祸首......没有人甚至是家用此时这个时间...＆＃34;\n 与QNAP设备不同，该设备通常连接到因特网并暴露于诸如Q锁定器勒索软件之类的攻击，Western Digital My Book设备存储在防火墙后面并通过我的书籍实时云服务器进行通信以提供远程访问。\n 一些用户表示担心西部数字和＃39; S服务器被黑客攻击以允许威胁演员将远程出厂重置命令推出连接到服务的所有设备。\n 如果威胁演员擦拭设备，那么奇怪的是没有人报告赎金笔记或其他威胁，这意味着攻击只是意味着破坏性。\n 如果您拥有一个西部数字我的书NAS设备，强烈建议您将其与网络断开连接，直到我们了解有关正在发生的事情的更多信息。\n 更新5:45 PM EST：Western Digital告诉BleepingComputer，他们正在积极调查攻击，但不相信这是他们服务器的妥协。\n 他们认为，在一些我的账户遭到损害后，攻击是在经过账户的损害之后进行的。 \n＆＃34;西部数字已确定我的一些书籍现场设备是由恶意软件损害的。 在某些情况下，这种妥协导致出厂重置，似乎擦除了设备上的所有数据。 我的预订现场设备于2015年收到了最终的固件更新。我们了解客户的数据非常重要。 此时，我们建议您将我的书与互联网的Live断开连接，以保护您的数据在设备上。 我们正在积极调查，我们将在可用时为此线程提供更新。＆＃34; - 西部数据  但是，他们的陈述并没有解释在大约同时遭遇许多账户的突破。 ", "note_en": "Western Digital My Book NAS owners worldwide found that their devices have been mysteriously factory reset and all of their files deleted.\n WD My Book is a network-attached storage device that looks like a small vertical book that you can stand on your desk. The WD My Book Live app allows owners to access their files and manage their devices remotely, even if the NAS is behind a firewall or router.\n Today, WD My Book owners worldwide suddenly found that all of their files were mysteriously deleted, and they could no longer log into the device via a browser or an app.\n When they attempted to log in via the Web dashboard, the device stated that they had an &#34;Invalid password.&#34;\n &#34;I have a WD My Book live connected to my home LAN and worked fine for years. I have just found that somehow all the data on it is gone today, while the directories seems there but empty. Previously the 2T volume was almost full but now it shows full capacity,&#34; a WD My Book owner reported on the Western Digital Community Forums.\n &#34;The even strange thing is when I try to log into the control UI for diagnosis I was-only able to get to this landing page with an input box for “owner password”. I have tried the default password “admin” and also what I could set for it with no luck.&#34;\n   After further owners  confirmed that their devices suffered the same issue, owners reported that the MyBook logs showed that the devices received a remote command to perform a factory reset starting at around 3 PM yesterday and through the night.\n &#34;I have found this in user.log of this drive today: Jun 23 15:14:05 My BookLive factoryRestore.sh: begin script: Jun 23 15:14:05 My BookLive shutdown[24582]: shutting down for system reboot Jun 23 16:02:26 My BookLive S15mountDataVolume.sh: begin script: start Jun 23 16:02:29 My BookLive _: pkg: wd-nas Jun 23 16:02:30 My BookLive _: pkg: networking-general Jun 23 16:02:30 My BookLive _: pkg: apache-php-webdav Jun 23 16:02:31 My BookLive _: pkg: date-time Jun 23 16:02:31 My BookLive _: pkg: alerts Jun 23 16:02:31 My BookLive logger: hostname=My BookLive Jun 23 16:02:32 My BookLive _: pkg: admin-rest-api I believe this is the culprit of why this happens…No one was even home to use this drive at this time…&#34;\n Unlike QNAP devices, which are commonly connected to the Internet and exposed to attacks such as the  QLocker Ransomware, the Western Digital My Book devices are stored behind a firewall and communicate through the My Book Live cloud servers to provide remote access.\n Some users have expressed concerns that Western Digital&#39;s servers were hacked to allow a threat actor to push out a remote factory reset command to all devices connected to the service.\n If a threat actor wiped devices, it is strange as no one has reported ransom notes or other threats, meaning the attack was simply meant to be destructive.\n If you own a Western Digital My Book NAS device, it is strongly advised that you disconnect it from the network until we learn more about what is happening.\n Update 5:45 PM EST: Western Digital told BleepingComputer that they are actively investigating the attacks but do not believe it was a compromise of their servers.\n They believe that attacks were conducted after some of the My Book owners had their accounts compromised.\n &#34;Western Digital has determined that some My Book Live devices are being compromised by malicious software. In some cases, this compromise has led to a factory reset that appears to erase all data on the device. The My Book Live device received its final firmware update in 2015. We understand that our customers’ data is very important. At this time, we recommend you disconnect your My Book Live from the Internet to protect your data on the device. We are actively investigating and we will provide updates to this thread when they are available.&#34; - Western Digital\n However, their statement doesnt explain how so many account were breached at approximately the same time.", "posttime": "2021-06-25 09:04:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,软件,书籍,digital,weren", "title": "Western Digital表示，一些我的书籍现场设备正在受到恶意软件的损害，导致出厂重置删除所有数据，相信其服务器并未被黑客攻击 ", "title_en": "Western Digital says some My Book Live devices are being compromised by malware leading to a factory reset erasing all data, believes its servers weren't hacked", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/wd-my-book-nas-devices-are-being-remotely-wiped-clean-worldwide/", "via": "", "real_tags": ["黑客", "软件", "书籍", "digital", "weren"]}, {"category": "", "categoryclass": "", "imagename": "10bf05b4c56b06de8afec36d587c78d2.jpg", "infoid": 1068158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows 11，今年年晚些时候，充满了新的功能，包括一项新的开始菜单，已被移动到中心和Microsoft商店以及Android a ... ", "note_en": "Windows 11, due out later this year, is full of new features, including a new Start menu that's been moved to the center and a Microsoft Store with Android a...", "posttime": "2021-06-25 09:04:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,wsj,中心", "title": "WSJ / YOUTUBE. ", "title_en": "WSJ/YouTube", "transed": 1, "url": "https://www.youtube.com/watch?v=Ocj0sVB9ykY&t=365s", "via": "", "real_tags": ["youtube", "wsj", "中心"]}, {"category": "", "categoryclass": "", "imagename": "ac6e9c5b53d13171db099bfe7f9e581b.png", "infoid": 1068157, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Cupcake是一种高效的Rust图书馆（添加版本）Fan-Vercauteren同性恋加密方案，提供了脚趾缩写的能力，添加/减去两个加密的向量，并重新打开了一个密文。  我们包括具有均匀操作和底层算术运算的基准测试和测试。 它们可以使用货舱和货物测试运行。  目前，我们只提供一组安全参数，即fv ::＆lt; scalar＆gt; :: default_2048（）; 该参数集根据同性恋加密安全标准链路的估计安全级别为约128比位。 使用您自己的风险使用其他参数！ 使用默认参数集，明文类型为U8的矢量，具有固定长度2048。 ", "note_en": "Cupcake is an efficient Rust library for the (additive version of) Fan-Vercauteren homomorphic encryption scheme, offering capabilities toencrypt vectors, add/subtract two encrypted vectors, and rerandomize a ciphertext.\n              We have included benchmarks and tests for both homomorphic operations and underlying arithmetic operations. They can be run using  cargo bench and  cargo test.\n  Currently, we provide only one set of secure parameter, namely  FV::&lt;Scalar&gt;::default_2048();. This parameter set has an estimated security level of about 128 bits accordingto the homomorphic encryption security standards  link. Use other parameters at your own risk! With the default parameter set, the plaintext type is vector of  u8 with a fixed length 2048.", "posttime": "2021-06-25 09:03:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,蛋糕,添加", "title": "蛋糕 - 晶格基添加剂均匀加密的锈图书库 ", "title_en": "Cupcake - A Rust library for lattice-based additive homomorphic encryption", "transed": 1, "url": "https://github.com/facebookresearch/Cupcake", "via": "", "real_tags": ["rust", "蛋糕", "添加"]}, {"category": "", "categoryclass": "", "imagename": "ff6afaa2e40521cf75dbbc29b7f8388a.png", "infoid": 1068156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它是由Alex Biryukov，Daniel Dinu和Dmitry Khovratovich设计的，来自卢森堡大学。\n argon2有3个变种：argon2d，argon2i和argon2id。 Argon2i针对密码散列进行了优化。 argon2有6个输入参数：密码，盐，记忆成本（算法的内存使用量），时间成本（算法的执行时间和迭代的数量），并行系数（并行线程数），散列长度。\n 学到更多 ”\n 密码散列是通过使用加密哈希函数创建一个称为哈希的定位字符串来保护纯文本密码的单向过程。加密散列函数旨在成为单向功能，即函数不可行的函数。\n 密码散列竞争由加密和安全专家组织，是一个开放的竞争，以提高对需要强密码散列算法的认识，并识别可以被识别为推荐标准的散列函数。 Argon2被选为2015年7月20日的最终PHC获奖者。\n   注＃2：始终选择强密码，包含特殊字符，小写和大写字母和数字。 ", "note_en": "It is designed by Alex Biryukov, Daniel Dinu, and Dmitry Khovratovich from University of Luxembourg.\n Argon2 has 3 variants:   Argon2d,  Argon2i and  Argon2id. Argon2i is optimized for password hashing. Argon2 has 6 input parameters: password, salt, memory cost (the memory usage of the algorithm), time cost (the execution time of the algorithm and the number of iterations), parallelism factor (the number of parallel threads), hash length.\n Learn more »\n Password hashing is a one-way process of securing plain text password by creating a bit string of a fixed size called hash using cryptographic hash function. Cryptographic hash functions designed to be a one-way function, that is, a function which is infeasible to invert.\n Password Hashing Competition, organized by cryptography and security experts, is an open competition to raise awareness of the need of strong password hashing algorithms and to identify hash functions that can be recognized as a recommended standard. Argon2 was selected as the final PHC winner on 20 July 2015.\n   Note #2: Always choose a strong password, containing special characters, lowercase and uppercase letters and numbers.", "posttime": "2021-06-25 09:03:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,密码,password,散列", "title": "密码与argon2算法，密码散列竞争的获奖者 ", "title_en": "Password with Argon2 Algorithm, the Winner of the Password Hashing Competition", "transed": 1, "url": "https://argon2.online/", "via": "", "real_tags": ["算法", "密码", "password", "散列"]}, {"category": "", "categoryclass": "", "imagename": "a0b92e6f7a9af2afe13a1032fdbe3662.png", "infoid": 1068155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "评析是一个开源网站，用于组织和参与挑战，以推动AI任务的艺术状态。 ", "note_en": "EvalAI is an open-source web platform for organizing and participating in challenges to push the state of the art on AI tasks.", "posttime": "2021-06-25 09:03:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,滑动,open,网站", "title": "评价：滑动的开源替代品 ", "title_en": "EvalAI: An Open-Source Alternative to Kaggle", "transed": 1, "url": "https://eval.ai/", "via": "", "real_tags": ["开源", "滑动", "open", "网站"]}]