[{"category": "", "categoryclass": "", "imagename": "675890cdbf25a3727f733990442b7b50.jpg", "infoid": 1070678, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们被告知，大流行正在恶化，delta 变体具有很强的传染性，我们需要恢复对 covid-19 的限制——即使是对完全接种疫苗的美国人也是如此。洛杉矶已经恢复了室内戴口罩的规定，周二，疾病控制与预防中心撤销了之前的指导，建议接种疫苗的人在某些情况下在室内戴口罩。家长们正准备迎接教师工会的新举措，以推迟秋季学校的重新开放。这是荒谬的。虽然一些未接种疫苗的美国人正在遭受痛苦是可悲的，但对于接种疫苗的人来说，大流行已经结束。未接种疫苗的人中 covid-19 病例的增加对已接种疫苗的人没有构成严重威胁。数据很清楚：根据 CDC 的数据，截至 7 月 19 日，共有 4,072 名接种疫苗的美国人因有症状的突破性感染住院，其中超过 1.61 亿人已完全接种疫苗。这是低于 0.003% 的突破性住院率。更好的是，在住院的人中，只有 849 人死于 covid-19。这意味着那些突破性感染的死亡率为 0.0005%。换个角度来看，你死于雷击的几率是 0.0007%，你死于季节性流感的几率是 0.1%。如果您接种了疫苗，与死于 Covid-19 相比，您死于大黄蜂、黄蜂或蜜蜂线、狗袭击、车祸、溺水、中暑或食物窒息的可能性要大得多。绝大多数因突破性感染而重病的人年龄较大或有潜在疾病。根据明尼苏达州卫生部的数据，爆发性感染住院患者的中位年龄为 74 岁。以色列对爆发性感染住院患者的研究发现，只有 4% 的人没有合并症。其余的人患有癌症或充血性心力衰竭等预先存在的疾病，使他们容易患上严重的 covid-19。这意味着，对于其他健康的接种疫苗的人——以及那些对先前感染具有天然免疫力的人——死于 covid-19 的几率接近于零。未接种疫苗的儿童也是如此。正如约翰霍普金斯大学教授 Marty Makary 在《华尔街日报》上指出的那样，CDC 数据显示，在超过 60 万美国人死于新冠病毒诊断代码的记录中，只有 335 名是 18 岁以下的儿童——而 CDC 不知道是否他们有一个预先存在的条件，以及他们的新冠病毒诊断是偶然的还是因果关系。由 Makary 领导的约翰霍普金斯大学的一个研究小组对 48,000 名被诊断出患有 covid-19 的 18 岁以下儿童进行了研究，发现没有预先存在疾病（例如儿科癌症）的儿童的死亡率为零。事实上，没有官方的政府数据显示是否有任何健康儿童因 covid-19 而死亡。\n事实上，儿童感染 COVID-19 的风险极低。这一点是肯定的：接种过疫苗且身体健康的教师不会面临未接种疫苗的学生带来的严重风险。但是，由于 delta 变种引起的激增预计将在 8 月底或 9 月初达到顶峰——正好是学校即将开学的时候——预计教师工会将利用 delta 要求学校保持关闭，直到幼儿接种疫苗为止。抱歉，没有任何理由不开学，或要求孩子们戴口罩或接种疫苗才能返回教室。并且没有理由强制要求接种疫苗的美国人戴口罩，或对具有自然免疫力或接种疫苗的公民的日常活动重新施加任何限制。我们应该鼓励未接种疫苗的美国人为自己接种疫苗。今天，超过 99% 的死亡发生在未接种疫苗的人群中。这些死亡是悲惨的，因为它们几乎是完全可以预防的。在美国，任何想要接种疫苗的人现在都可以接种。但对于我们其他人来说，疫苗已经将 covid-19 从致命威胁变成了比普通感冒更危险的东西。 Makary 告诉我，“如果您接种了疫苗，那么您现在生活在一个季节性病毒的世界中，这种病毒非常温和，称为 covid-19，它可以让您季节性地出现轻微症状，这没关系。”事实上，他指出有四种季节性冠状病毒在美国传播了几十年，约占所有普通感冒病例的 25%。 Covid-19 可能会成为第五个。 “我们的战斗从来都不是针对普通感冒，”他说。 “它一直在反对死亡。”那场战斗已经赢了。我们可能需要助推器。如果出现新的变体，mRNA 技术可以迅速适应以靶向并击败它们。我们对病毒毫无防备的时代已经结束。是时候重新开始我们的生活了。当天最重要的新闻报道，由邮政编辑策划，每天早上发布。", "note_en": "The pandemic is worsening and the delta variant is so infectious, we are  told, that we need to return to covid-19 restrictions — even for fully vaccinated Americans. Los Angeles has already reinstated indoor mask mandates, and on Tuesday the Centers for Disease Control and Prevention reversed its previous guidance and  recommended that vaccinated people wear masks indoors in certain circumstances. Parents are bracing for a new push from teachers’ unions to  delay school reopenings in the fall.\n This is absurd. While it is tragic that some unvaccinated Americans are suffering, for the vaccinated, the pandemic is over. The rise in covid-19 cases among the unvaccinated poses no serious threat to those who have been immunized.\n The data is clear: According to the  CDC, as of July 19, a grand total of 4,072 vaccinated Americans had been hospitalized with symptomatic breakthrough infections, out of more than 161 million who have been fully vaccinated. That is a breakthrough hospitalization rate of less than 0.003 percent. Better still, of those hospitalized, only 849 have died of covid-19. That means the death rate from those breakthrough infections is 0.0005 percent.\n   To put that in perspective, your chance of dying  from a lightning strike is .0007 percent, and your chance of dying from a  seasonal flu is 0.1 percent. If you’re vaccinated, you have a much greater chance of  dying from a hornet, wasp or bee string, a dog attack, a car crash, drowning, sunstroke, or choking on food than you do of dying from covid-19.\n  The vast majority of those who do become seriously ill from breakthrough infections are older or have underlying conditions. According to the Minnesota Department of Health, the  median age of those hospitalized with breakthrough infections is 74. An  Israeli study of patients hospitalized with breakthrough infections found that only 4 percent had no co-morbidities. The rest had preexisting illnesses such as cancer or congestive heart failure that predisposed them to severe covid-19.\n What this means is that for otherwise healthy vaccinated people — and those who have natural immunity from previous infection — the chance of dying of covid-19 is close to zero.\n   The same is true for unvaccinated children. As Johns Hopkins University professor Marty Makary  points out in the Wall Street Journal, CDC data show that of the more than 600,000 Americans who died with a covid diagnosis code in their record, just 335 were children under 18 — and the CDC has no idea whether they had a preexisting condition and whether their covid diagnosis was incidental or causal. A research team at Johns Hopkins led by Makary looked at 48,000 children under 18 diagnosed with covid-19, and found a mortality rate of zero among children without a preexisting medical condition, such as pediatric cancer. Indeed, there is no official government data to show whether  any healthy children have died as a result of covid-19.\n The fact is children are at extremely low risk from covid-19. And this much is certain: Teachers who are vaccinated and otherwise healthy face no serious risk from their unvaccinated students. But with the surge caused by the delta variant  expected to peak in late August or early September — right when schools are set to open — expect the teacher unions to use delta to demand that schools stay closed until young children are vaccinated.\n Sorry, but there is no justification whatsoever not to open schools, or to  require that children wear masks or be vaccinated to return to the classroom. And there is no justification to mandate that vaccinated Americans wear masks, or to reimpose any restrictions on the everyday activities of citizens who have either natural or vaccinated immunity.\n   We should encourage unvaccinated Americans to get immunized for their own sakes. Over  99 percent of deaths occur today in unvaccinated people. These deaths are tragic because they are almost entirely preventable. Anyone in the United States who wants a vaccination can now get it.\n But for the rest of us, the vaccines have turned covid-19 from a mortal threat into something little more dangerous than the  common cold. Makary tells me, “If you’re vaccinated, you now are living in a world where there’s a seasonal virus that is very mild called covid-19 that could give you mild symptoms season to season, and that’s okay.” Indeed, he points out that there are four seasonal coronaviruses that have circulated in the United States for decades, and that make up about 25 percent of all cases of the common cold. Covid-19 is probably going to become the fifth. “Our battle has never been against the common cold,” he says. “It’s been against death.”\n That battle has been won. We may need boosters down the line. And if new variants emerge, mRNA technology can quickly be adapted to target and defeat them. The period when we were defenseless against the virus is over. It’s time to live our lives again.\n      The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-07-31 01:26:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,疫苗,americans", "title": "接种疫苗的美国人比 Covid 更有可能死于雷击", "title_en": "Vaccinated Americans more likely to die from a lightning strike than Covid", "transed": 1, "url": "https://www.washingtonpost.com/opinions/2021/07/27/vaccinated-americans-are-more-likely-die-lightning-strike-than-covid-dont-bring-back-restrictions/", "via": "", "real_tags": ["美国", "疫苗", "americans"]}, {"category": "", "categoryclass": "", "imagename": "89c8b04933308b7bf57b9a130b733d81.jpg", "infoid": 1070676, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Valve 对 Wolfire 4 月份的诉讼发出了严厉的回应，该诉讼指控 Steam 店面存在反竞争垄断做法。在回应中，Valve 认为该诉讼应该被驳回，因为它“未能指控反垄断案件的最基本要素”。 Wolfire 的案例部分是因为 Valve 要求使用 Valve 平台的开发人员生成的免费 Steam 密钥在其他平台上以不低于 Steam 上提供的价格出售。但 Valve 在其提交的文件中多次辩称，它“没有义务分发 Steam 密钥，更不用说允许开发人员使用 Steam 密钥来降低他们在其他商店的 Steam 价格了。” Valve 表示，免费密钥系统旨在“[给予] 开发商一种免费方式来销售（或赠送）合理数量的 Steam 游戏副本。”考虑到这一点，对这些密钥的非 Steam 定价的限制“阻止了开发者搭便车使用 Valve 对 Steam 的投资”。定价和数量指南“防止开发商侵蚀 Steam 上的大量销售，Valve 承担 100% 的创建和维护费用，但免费提供给用户。” Valve 继续表示，反垄断法“没有给 Valve 施加促进与自身竞争的义务”，并指出支持判例法。 “Valve 也没有义务继续提供 [免费密钥]、无限数量地授予它们，或允许开发人员使用它们在比 Steam 更便宜的其他商店销售支持 Steam 的游戏，”Valve 争辩道。 Wolfire 的诉讼还称，Valve 不仅试图对生成的 Steam 密钥执行定价平价，而且还对在其他平台上销售的非 Steam 版本执行定价。在回应中，Valve 对这一指控的事实依据并没有留下深刻印象，它说这与“Valve 的一个轶事有关，据称他告诉一位未具名的开发者，不应该在 Discord 的竞争中免费提供非 Steam 支持的游戏。平台，如果它向 Steam 用户收取 5 美元用于 Steam 上该游戏的 Steam 版本。” Valve 认为，这个狭隘的轶事“未能声称在整个市场范围内执行或可能对竞争产生任何影响。” Wolfire 的诉讼确实证明了许多游戏在 Steam 和其他收费较低的店面上的定价相同。但 Valve 认为，这种跨店面的定价平价是司空见惯的。即使不是这样，Valve 说，诉讼也没有“任何事实指控，Valve ......做了任何事情来影响，更不用说胁迫了，开发商在两家商店以相同的价格出售。” Valve 还指责 Wolfire 没有提供任何事实来支持其断言，即 Steam 30% 的游戏销售基数削减高于在更具“竞争性”的市场中可用的基数。相反，Valve 说，“原告只能得出一个概括，即经济学预测 Valve 的 30% 佣金应该随着时间的推移而减少。” Valve 指出，自从“Steam 开始时它的市场份额为零，因此除了具有竞争力的价格之外，没有权力收取任何费用”以来，它没有增加基本费用。相反，在 2018 年，Steam 降低了高收入游戏的费用，该公司表示此举“与超竞争佣金相反”。在这里，Valve 提到了 2008 年针对 Apple 及其 iPod/iTunes 音乐市场的反垄断案。在这种情况下，苹果成功地指出，它“在获得垄断权之前和之后都保持着每首歌曲 99 美分的成本——并且从未改变过这个价格，即使是在大卖家（亚马逊）进入市场之后”。\nSteam 的 30% 费用高于 Epic Games Store 等竞争对手的费用这一事实反映了“据称市场认为 Steam 更胜一筹……这与 Valve 能够公平地要求更高价格的能力是一致的，”Valve 说。为了支持这一点，Valve 引用了 Wolfire 自己诉讼中的台词，描述了当《无主之地 3》在 Steam 上不可用时消费者的强烈反应。 “Steam 平台不仅仅是一个中间人，而是为游戏玩家和开发者提供了真正的价值，”Valve 写道。 “事实上，据称游戏玩家非常看重 Steam，以至于 Epic 专门在其 Epic Games Store 平台上提供流行游戏‘引起了强烈反对’和被迫‘等待支持 Steam 的发行版或使用 PC 桌面游戏平台’的游戏玩家‘呼吁抵制’他们不喜欢。&#39;”", "note_en": "Valve has issued a scathing response to  Wolfire&#39;s April lawsuit alleging anticompetitive monopoly practices on the Steam storefront. In that response, Valve argues that the suit should be dismissed because it &#34;fails to allege the most basic elements of an antitrust case.&#34;  Wolfire&#39;s case centers in part on the fact that Valve requires  free Steam Keys generated by developers using Valve&#39;s platform to be sold on other platforms at prices no lower than those offered on Steam. But Valve argues multiple times  in its filing that it has &#34;no obligation to distribute Steam Keys, let alone to allow developers to use Steam Keys to undercut their Steam prices in other stores.&#34;\n The free key system, Valve says, is intended as a way to &#34;[give] developers a free way to sell (or give away) a reasonable number of copies of their Steam-enabled games.&#34; With that in mind, restrictions on off-Steam pricing for those keys &#34;prevents developers from free-riding on Valve’s investment in Steam.&#34; The pricing and quantity guidelines &#34;prevent developers from eroding large quantities of sales on Steam, which Valve bears 100% of the expense of creating and maintaining, yet provides to users for free.&#34;\n Valve goes on to say that the antitrust laws impose &#34;no obligation on Valve to facilitate competition with itself&#34; and points to supporting case-law to that effect. &#34;Nor does Valve have a duty to continue offering [free keys], to grant them in unlimited numbers, or allow developers to use them to sell Steam-enabled games in other stores cheaper than on Steam,&#34; Valve argues.\n Wolfire&#39;s lawsuit also alleges that Valve tries to enforce pricing parity not just for generated Steam keys but for non-Steam versions sold on other platforms. Valve, in its response, is not impressed with the factual basis for this allegation, which it says is tied to &#34;a single anecdote of Valve allegedly telling one unnamed developer it shouldn’t give a non-Steam-enabled game free on Discord’s competing platform if it charges Steam users $5 for the Steam-enabled version of that game on Steam.&#34; That narrow anecdote, Valve argues, &#34;fails to allege market-wide enforcement or plausibly lead to any effect on competition.&#34;\n     Wolfire&#39;s suit does present evidence that many games are priced at the same level on Steam and other storefronts that charge lower fees. But Valve argues that  this kind of pricing parity across storefronts is commonplace. Even if it wasn&#39;t, Valve says, the lawsuit is missing &#34;any factual allegation that Valve... did anything at all to affect, let alone coerce, the developers to sell at the same prices in two stores.&#34;  Valve also takes Wolfire to task for not presenting any facts to back up its assertion that Steam&#39;s 30 percent base cut for game sales is higher than what would be available in a more &#34;competitive&#34; market. Instead, Valve says, &#34;Plaintiffs can muster only a generalization that economics predicts Valve’s 30 percent commission should have decreased over time.&#34;\n  Valve points out that it hasn&#39;t increased its base fee since &#34;Steam’s beginning when it had zero market share, and hence no power to charge anything but a competitive price.&#34; On the contrary, in 2018, Steam  reduced its fees for high-earning games, a move the company suggests &#34;lay[s] out the opposite of a supracompetitive commission.&#34;\n Here, Valve points to  a 2008 antitrust case against Apple and its iPod/iTunes markets for music. In that case, Apple successfully pointed out that it had maintained the same 99 cent cost per song &#34;both before and after it obtained a monopoly—and never changed that price, even after a large seller (Amazon) entered the market.&#34;\n The fact that Steam&#39;s 30 percent fee is higher than that of competitors like the Epic Games Store is a reflection that &#34;the market allegedly regards Steam as superior... which is consistent with Valve’s ability to fairly command higher prices,&#34; Valve says. In support of this, Valve cites lines from Wolfire&#39;s own suit describing  consumer backlash when  Borderlands 3 was not available on Steam.\n &#34;The Steam platform is far more than a middleman but offers real value to gamers and developers,&#34; Valve writes. &#34;Indeed, gamers allegedly prize Steam so much that Epic’s offering popular games exclusively on its Epic Games Store platform &#39;caused backlash&#39; and &#39;calls for boycotts&#39; from gamers forced to &#39;wait for a Steam-enabled release or use a PC Desktop Gaming Platform they do not prefer.&#39;&#34;", "posttime": "2021-07-31 00:42:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,valve,issues,steam", "title": "Valve 就 Steam 反垄断案背后的事实发出严厉答复", "title_en": "Valve issues scathing reply over the facts behind a Steam antitrust case", "transed": 1, "url": "https://arstechnica.com/gaming/2021/07/valve-issues-scathing-reply-over-the-facts-behind-a-steam-antitrust-case/", "via": "", "real_tags": ["rust", "valve", "issues", "steam"]}, {"category": "", "categoryclass": "", "imagename": "2063a8b8ab441c056ef512db64933e8a.jpg", "infoid": 1070675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着向远程工作的转变，员工不得不为互联网账单买单，许多员工认为需要做出一些改变。在传统办公室中，员工通过公司提供的互联网连接登录工作日。由于 COVID-19 而转向远程工作，许多员工不得不为履行其职业职责所需的互联网接入买单。周三，AppNeta 发布了关于 WFH 相关互联网“痛点”的“互联网未来展望”报告，以及关于谁应该为与工作相关的连接买单的看法等等。该报告的一部分专门针对“连接灾难”，并阐明了自去年 3 月转向远程工作以来，由于互联网服务欠佳而导致人们经历的中断。在此期间，网站加载速度缓慢是连接投诉最多的问题 (49%)，其次是“视频通话冻结”(34%) 和服务中断 (33%)。涉及互联网提供商 (29%) 和流媒体内容 (25%) 的问题按顺序排在前五名。 “当协作是异步的（电子邮件、语音邮件等）时，连接的质量并不是真正的问题——即使是零星的中断，虽然令人讨厌，但也不是实质性的障碍。这完全改变了——当涉及到虚拟协作时，它要么是实时的，要么已经过时，”AppNeta 首席执行官马特·史蒂文斯 (Matt Stevens) 说。该调查要求受访者确定由于互联网连接挑战而不得不进行的特定场景或更新。大约三分之一的受访者 (37%) 表示他们“由于冻结或音频不佳而不得不关闭视频通话”，28% 的人表示他们已经更新了他们的“互联网相关设备”，20% 的人更新了他们的提供商计划或互联网包。报告称，绝大多数受访者 (79%) 表示他们为互联网付费，而在其他情况下，他们会为伴侣 (10%) 或父母 (5%) 买单。政府为 2% 的受访者提供互联网接入服务，这使表示其公司或雇主选择互联网选项卡的受访者数量 (1%) 翻了一番。有趣的是，38% 的受访者表示，如果一个人“在家中出于工作目的使用互联网”，他们的雇主应该对连接承担金钱责任。三分之一的受访者 (33%) 认为他们应该亲自买单，24% 的人表示他们在家工作时不需要上网，同样数量的受访者认为政府 (3%) 或业主/房东 ( 3%) 应支付这些情况下的互联网费用。\n有趣的是，大多数受访者 (61%) 表示，由于 COVID-19 和转向远程工作，他们对“谁应该负责支付互联网费用”的看法没有改变。在认为雇主应该支付家庭互联网费用的人中，26% 的人认为雇主应该直接支付部分账单，40% 的人认为雇主应该直接支付全部账单，34% 的人认为这应该通过常规津贴来支付。史蒂文斯表示，他相信未来会有更多雇主为员工支付互联网保险作为就业津贴，并补充说，有许多“雇主可以在许多方面做出贡献，让员工更轻松地工作”，例如协助支付育儿费用，“抵消通勤成本”或与其他家庭办公室支出相关的贡献。他说：“它们都有优点，需要在特定公司的背景下以及员工的组合及其个人情况下进行审查。”通过这些有关项目管理、预算和应对日常挑战的技巧，发现 IT 领导力成功的秘诀。周二和周四交付 今天注册", "note_en": "With the switch to remote work, employees have been left to foot the internet bill and many workers believe some changes are in order.\n  In the traditional office, employees log on for the workday via company-provided internet connectivity. With the switch to remote work due to COVID-19, many employees have been left to foot the bill for the internet access necessary to fulfill their occupational duties. On Wednesday, AppNeta published its &#34; Future of the Internet Outlook&#34; report about WFH-related internet &#34;pain points,&#34; sentiments regarding who should foot the bill for work-related connectivity and more.\n A portion of the report is dedicated to the &#34;connectivity catastrophe&#34; and sheds light on the disruptions people have experienced due to less-than-optimal internet service since the switch to remote work last March. During this time period, slow website loading times is the top connectivity complaint (49%) followed by &#34;video calls freezing&#34; (34%) and service outages (33%). Issues involving internet providers (29%) and streaming content (25%) round out the top five, in order.\n &#34;When collaboration was asynchronous (email, voice mail, etc.), the quality of the connectivity wasn&#39;t really an issue—even sporadic outages, while annoying, were not material blockers.  That&#39;s completely changed—when it comes to virtual collaboration, it&#39;s either real-time or it&#39;s obsolescence,&#34; said Matt Stevens, AppNeta CEO.\n   The survey asked respondents to identify specific scenarios or updates they&#39;ve had to make due to internet connectivity challenges. About one-third of respondents (37%) said they &#34;had to go off of video on calls due to freezing or poor audio,&#34; 28% said they&#39;d updated their &#34;internet-related equipment&#34; and 20% updated their provider plan or internet package.\n  The vast majority of respondents (79%) said they pay for their internet, according to the report, while a partner (10%) or parents (5%) are footing the bill in other instances. The government covers internet access for 2% of respondents, doubling the number of respondents who said their company or employer picks up their internet tab (1%).\n Interestingly, 38% of respondents said their employer should be monetarily responsible for connectivity if a person uses &#34;the internet at home for work purposes.&#34; One-third of respondents (33%) believed they personally should foot the bill, 24% said they did not require internet access while working at home, and the same number of respondents believed the government (3%) or building owners/landlords (3%) should cover internet costs in these situations.\n  Interestingly, the majority of respondents (61%) said their opinion about &#34;who should be responsible for paying for the internet&#34; has not changed due to COVID-19 and the switch to remote work. Among people who believe employers should cover home internet costs, 26% believed employers should pay some of the bill directly, 40% believed employers should pay the full bill directly and 34% felt this should be covered via a routine stipend.\n In the future, Stevens said he believes more employers will pay for employees&#39; internet coverage as an employment perk, adding that there are many &#34;dimensions where employers can contribute to make it easier for their employees to work,&#34; such as assisting with childcare costs, &#34;offsetting commuting costs&#34; or making contributions related to other home office expenditures.\n &#34;They all have merit and need to be examined within the context of a given firm and the mix of employees and their individual circumstances,&#34; he said.\n Discover the secrets to IT leadership success with these tips on project management, budgets, and dealing with day-to-day challenges. Delivered Tuesdays and Thursdays\n        Sign up today", "posttime": "2021-07-31 00:42:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程工作,应该,pay,互联网", "title": "雇主应该在远程工作期间支付家庭互联网费用吗？", "title_en": "Should employers pay for home internet during remote work?", "transed": 1, "url": "https://www.techrepublic.com/article/should-employers-pay-for-home-internet-during-remote-work/", "via": "", "real_tags": ["远程工作", "应该", "pay", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "3e7d3dcddf12c7215c845d537e72dd20.jpg", "infoid": 1070674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周四晚上在线发布的预印本中，谷歌的研究人员与斯坦福大学、普林斯顿大学和其他大学的物理学家合作表示，他们首次使用谷歌的量子计算机展示了真正的“时间晶体”。物理学家多年来一直努力实现的一个新的物质阶段，时间晶体是一种物体，它的部分以有规律的、重复的循环运动，在不燃烧任何能量的情况下维持这种不断变化。 “结果是惊人的：你逃避了热力学第二定律，”合著者、德国德累斯顿马克斯普朗克复杂系统物理研究所所长 Roderich Moessner 说。这就是说无序总是会增加的定律。时间晶体也是第一个自发打破“时间平移对称性”的物体，这是一个稳定的物体在整个时间里保持不变的通常规则。时间水晶既稳定又不断变化，特殊时刻以周期性的时间间隔出现。时间晶体是物质相的新类别，扩展了相的定义。所有其他已知相，如水或冰，都处于热平衡状态：它们的组成原子已经进入环境温度允许的最低能量状态，并且它们的特性不随时间变化。时间晶体是第一个“失衡”相：尽管处于激发和演化状态，但它具有有序和完美的稳定性。 “这就是我们现在正在研究的一个全新且令人兴奋的空间，”现任职斯坦福大学的凝聚态物理学家 Vedika Khemani 说，她在研究生期间共同发现了新相，并与他人合着了这篇新论文。 .普林斯顿大学的 Khemani、Moessner、Shivaji Sondhi 和英国拉夫堡大学的 Achilleas Lazarides 于 2015 年发现了该相的可能性并描述了其关键特性；不久之后，由微软 Q 站的 Chetan Nayak 和加州大学圣巴巴拉分校领导的一组竞争物理学家将其确定为时间晶体。\n在过去的五年里，研究人员竞相创造时间水晶，但之前的演示虽然按他们自己的条件取得了成功，但未能满足确定时间水晶存在所需的所有标准。 “有充分的理由认为，这些实验都没有完全成功，像 [Google 的] 这样的量子计算机将特别适合比那些早期的实验做得更好，”美国大学凝聚态物理学家约翰查尔克说。没有参与这项新工作的牛津。谷歌的量子计算团队在 2019 年首次进行了普通计算机在实际时间内无法完成的计算，从而成为头条新闻。然而，该任务是为了显示加速而设计的，并没有内在的兴趣。新的时间晶体演示标志着量子计算机第一次找到了有报酬的工作。 “这是对 [Google] 处理器的绝妙使用，”Nayak 说。凭借今天已提交出版的预印本和其他近期成果，研究人员实现了对量子计算机的最初希望。物理学家理查德·费曼 (Richard Feynman) 在 1982 年提出这些设备的论文中认为，它们可以用来模拟任何可以想象的量子系统的粒子。时间水晶体现了这一愿景。鉴于其微妙成分的复杂组合，它是一种自然本身可能永远不会创造的量子物体。大自然最令人费解的法则激发了想象力，创造了配方。诺贝尔奖获得者物理学家弗兰克·维尔切克 (Frank Wilczek) 于 2012 年构思了这个想法，当时他正在教授一门关于普通（空间）晶体的课程。 “如果你考虑太空中的晶体，那么考虑晶体行为的时间分类也是很自然的，”不久之后他告诉本杂志。考虑钻石，一团碳原子的结晶相。团块在空间中的任何地方都由相同的方程控制，但它采用具有周期性空间变化的形式，原子位于晶格点。物理学家说它“自发地打破了空间平移对称性”。只有最小能量平衡状态才会以这种方式自发地打破空间对称性。\nWilczek 设想了一个平衡的多部分物体，很像钻石。但是这个物体打破了时间平移对称性：它经历了周期性运动，以规则的间隔返回到它的初始配置。 Wilczek 提出的时间晶体与挂钟等也有很大的不同——挂钟是一个也经历周期性运动的物体。时钟指针消耗能量并在电池耗尽时停止。 Wilczekian 时间晶体不需要输入并无限期地继续，因为系统处于超稳定平衡状态。如果这听起来难以置信，那就是：在经历了很多激动和争议之后，2014 年的一项证明表明，威尔切克的处方失败了，就像历史上设想的所有其他永动机一样。那一年，普林斯顿的研究人员正在考虑其他事情。 Khemani 和她的博士导师 Sondhi 正在研究多体定位，这是安德森定位的延伸，这是 1958 年诺贝尔奖获得者发现电子可以卡在原地，就像在崎岖景观的缝隙中一样。一个电子最好被描绘成一个波，它在不同地方的高度给出了在那里检测到粒子的可能性。随着时间的推移，波浪自然地扩散开来。但是菲利普·安德森发现随机性——例如晶格中随机缺陷的存在——会导致电子波分裂，破坏性地干扰自身，并在除小区域之外的任何地方抵消。粒子定位。几十年来，人们一直认为多个粒子之间的相互作用会破坏干扰效应。但在 2005 年，普林斯顿大学和哥伦比亚大学的三位物理学家表明，一维量子粒子链可以经历多体局域化；也就是说，他们都陷入了一个固定的状态。这种现象将成为时间晶体的第一个成分。想象一排粒子，每个粒子都有一个向上、向下或两个方向都有可能指向的磁性方向（或“自旋”）。想象一下，最初的四次旋转最初指向上、下、下和上。如果可以的话，自旋将在量子力学上波动并快速对齐。但是它们之间的随机干扰会导致这排粒子卡在它们的特定配置中，无法重新排列或进入热平衡。他们会无限期地向上、向下、向下和向上。\nSondhi 和一位合作者发现多体局域化系统可以表现出一种特殊的秩序，这将成为时间晶体的第二个关键要素：如果你翻转系统中的所有自旋（向下、向上、向上和向下）在我们的示例中），您将获得另一个稳定的多体本地化状态。 2014 年秋季，Khemani 在德累斯顿马克斯普朗克研究所休假加入 Sondhi。在那里，Moessner 和 Lazarides 专门研究所谓的 Floquet 系统：周期性驱动的系统，例如用特定频率的激光刺激晶体。激光的强度以及其对系统的影响强度会周期性地变化。 Moessner、Lazarides、Sondhi 和 Khemani 研究了以这种方式周期性驱动多体局部系统时会发生什么。他们在计算和模拟中发现，当你用激光以特定方式刺激局部自旋链时，它们会来回翻转，在两个不同的多体局部状态之间永远重复循环，而不会吸收任何净能量从激光。他们将他们的发现称为 pi 自旋玻璃相（其中角度 pi 表示 180 度翻转）。该小组在 2015 年的预印本中报告了这一新物质相的概念——有史以来发现的第一个多体、非平衡相，但“时间晶体”一词并未出现在其中。作者在 2016 年 6 月发表在《物理评论快报》上的更新版本中添加了该术语，感谢审稿人在致谢中建立了他们的 pi 自旋玻璃相和时间晶体之间的联系。在预印本的出现和出版之间还发生了其他事情：Nayak 是 Wilczek 的前研究生，他的合作者 Dominic Else 和 Bela Bauer 在 2016 年 3 月发布了一份预印本，提议存在称为 Floquet 时间晶体的物体。他们以 Khemani 和公司的 pi 自旋玻璃相为例。 Floquet 时间晶体表现出 Wilczek 设想的那种行为，但仅限于由外部能源定期驱动。这种时间晶体从不声称处于热平衡状态，从而避免了 Wilczek 最初想法的失败。因为它是一个多体局域系统，它的自旋或其他部分无法达到平衡；他们被困在原地。但该系统也不会升温，尽管被激光或其他驱动器泵浦。相反，它在局部状态之间无限期地来回循环。激光已经打破了自旋行所有时刻之间的对称性，取而代之的是“离散时间平移对称性”——也就是说，只有在激光的每个周期循环之后才有相同​​的条件。但是，通过它的来回翻转，自旋行进一步打破了激光强加的离散时间平移对称性，因为它自己的周期是激光的倍数。\nKhemani 和合著者详细描述了这个阶段，但 Nayak 的团队用时间、对称性和自发对称性破坏的语言来描述它——所有物理学中的基本概念。除了提供更性感的术语外，他们还提供了新的理解方面，并且他们稍微概括了 pi 自旋玻璃相之外的 Floquet 时间晶体的概念（注意它不需要一定的对称性）。他们的论文于 2016 年 8 月发表在《物理评论快报》上，两个月后 Khemani 和公司发表了该阶段第一个例子的理论发现。两个团体都声称已经发现了这个想法。从那时起，竞争对手的研究人员和其他人开始竞相创造现实中的时间水晶。 Nayak 的团队与马里兰大学的 Chris Monroe 合作，后者使用电磁场来捕获和控制离子。上个月，该小组在《科学》杂志上报道说，他们将被捕获的离子变成了近似的或“预热”时间晶体。它的周期性变化（在这种情况下，离子在两种状态之间跳跃）实际上与真正的时间晶体无法区分。但与钻石不同的是，这种预热时间晶体不是永远的。如果实验运行的时间足够长，系统会逐渐平衡，循环行为就会崩溃。 Khemani、Sondhi、Moessner 和合作者在别处搭上了他们的马车。 2019 年，谷歌宣布其 Sycamore 量子计算机在 200 秒内完成了一项任务，而传统计算机需要 10,000 年。 （其他研究人员后来描述了一种大大加快普通计算机计算速度的方法。）在阅读公告文件时，Moessner 说，他和他的同事们意识到“Sycamore 处理器包含我们需要实现的基本构建块作为其基本构建块。 Floquet时间水晶。”偶然地，Sycamore 的开发人员也在寻找与他们的机器有关的东西，这台机器太容易出错，无法运行专为成熟的量子计算机设计的密码学和搜索算法。当 Khemani 和同事联系到 Google 的理论家 Kostya Kechedzhi 时，他和他的团队很快同意在时间水晶项目上进行合作。 “我的工作，不仅是离散时间晶体，还有其他项目，是尝试将我们的处理器用作研究新物理或化学的科学工具，”Kechedzhi 说。", "note_en": "In  a preprint posted online Thursday night, researchers at Google in collaboration with physicists at Stanford, Princeton and other universities say that they have used Google’s quantum computer to demonstrate a genuine “time crystal” for the first time.\n A novel phase of matter that physicists have strived to realize for many years, a time crystal is an object whose parts move in a regular, repeating cycle, sustaining this constant change without burning any energy.\n “The consequence is amazing: You evade the second law of thermodynamics,” said co-author  Roderich Moessner, director of the Max Planck Institute for the Physics of Complex Systems in Dresden, Germany. That’s the law that says disorder always increases.\n Time crystals are also the first objects to spontaneously break “time-translation symmetry,” the usual rule that a stable object will remain the same throughout time. A time crystal is both stable and ever-changing, with special moments that come at periodic intervals in time.\n The time crystal is a new category of phases of matter, expanding the definition of what a phase is. All other known phases, like water or ice, are in thermal equilibrium: Their constituent atoms have settled into the state with the lowest energy permitted by the ambient temperature, and their properties don’t change with time. The time crystal is the first “out-of-equilibrium” phase: It has order and perfect stability despite being in an excited and evolving state.\n “This is just this completely new and exciting space that we’re working in now,” said  Vedika Khemani, a condensed matter physicist now at Stanford who co-discovered the novel phase while she was a graduate student and co-authored the new paper.\n Khemani, Moessner,  Shivaji Sondhi of Princeton and  Achilleas Lazarides of Loughborough University in the United Kingdom discovered the possibility of the phase and described its key properties in 2015; a rival group of physicists led by  Chetan Nayak of Microsoft Station Q and the University of California, Santa Barbara identified it as a time crystal soon after.\n Researchers have raced to create a time crystal over the past five years, but previous demos, though successful on their own terms,  have failed to satisfy all the criteria needed to establish the time crystal’s existence. “There are good reasons to think that none of those experiments completely succeeded, and a quantum computer like [Google’s] would be particularly well placed to do much better than those earlier experiments,” said  John Chalker, a condensed matter physicist at the University of Oxford who wasn’t involved in the new work.\n  Google’s quantum computing team  made headlines in 2019 when they  performed the first-ever computation that ordinary computers weren’t thought to be able to do in a practical amount of time. Yet that task was contrived to show a speedup and was of no inherent interest. The new time crystal demo marks one of the first times a quantum computer has found gainful employment.\n “It’s a fantastic use of [Google’s] processor,” Nayak said.\n With today’s preprint, which has been submitted for publication, and other  recent results, researchers have fulfilled the original hope for quantum computers. In his  1982 paper proposing the devices, the physicist Richard Feynman argued that they could be used to simulate the particles of any imaginable quantum system.\n A time crystal exemplifies that vision. It’s a quantum object that nature itself probably never creates, given its complex combination of delicate ingredients. Imaginations conjured the recipe, stirred by nature’s most baffling laws.\n   The Nobel Prize­-winning physicist Frank Wilczek conceived the idea in 2012, while teaching a class about ordinary (spatial) crystals. “If you think about crystals in space, it’s very natural also to think about the classification of crystalline behavior in time,” he  told this magazine not long after.\n Consider a diamond, a crystalline phase of a clump of carbon atoms. The clump is governed by the same equations everywhere in space, yet it takes a form that has periodic spatial variations, with atoms positioned at lattice points. Physicists say that it “spontaneously breaks space-translation symmetry.” Only minimum-energy equilibrium states spontaneously break spatial symmetries in this way.\n Wilczek envisioned a multi-part object in equilibrium, much like a diamond. But this object breaks time-translation symmetry: It undergoes periodic motion, returning to its initial configuration at regular intervals.\n  Wilczek’s proposed time crystal was profoundly different from, say, a wall clock — an object that also undergoes periodic motion. Clock hands burn energy and stop when the battery runs out. A Wilczekian time crystal requires no input and continues indefinitely, since the system is in its ultra-stable equilibrium state.\n If it sounds implausible, it is: After much thrill and controversy,  a 2014 proof showed that Wilczek’s prescription fails, like all other perpetual-motion machines conceived throughout history.\n That year, researchers at Princeton were thinking about something else. Khemani and her doctoral adviser, Sondhi, were studying many-body localization, an extension of Anderson localization, the Nobel Prize-winning 1958 discovery that an electron can get stuck in place, as if in a crevice in a rugged landscape.\n An electron is best pictured as a wave, whose height in different places gives the probability of detecting the particle there. The wave naturally spreads out over time. But Philip Anderson discovered that randomness — such as the presence of random defects in a crystal lattice — can cause the electron’s wave to break up, destructively interfere with itself, and cancel out everywhere except in a small region. The particle localizes.\n People thought for decades that interactions between multiple particles would destroy the interference effect. But in 2005, three physicists at Princeton and Columbia universities  showed that a one-dimensional chain of quantum particles can experience many-body localization; that is, they all get stuck in a fixed state. This phenomenon would become the first ingredient of the time crystal.\n Imagine a row of particles, each with a magnetic orientation (or “spin”) that points up, down, or some probability of both directions. Imagine that the first four spins initially point up, down, down and up. The spins will quantum mechanically fluctuate and quickly align, if they can. But random interference between them can cause the row of particles to get stuck in their particular configuration, unable to rearrange or settle into thermal equilibrium. They’ll point up, down, down and up indefinitely.\n Sondhi and a collaborator had discovered that many-body localized systems can exhibit a special kind of order, which would become the second key ingredient of a time crystal: If you flip all the spins in the system (yielding down, up, up and down in our example), you get another stable, many-body localized state.\n  In the fall of 2014, Khemani joined Sondhi on sabbatical at the Max Planck Institute in Dresden. There, Moessner and Lazarides specialized in so-called Floquet systems: periodically driven systems, such as a crystal that’s being stimulated with a laser of a certain frequency. The laser’s intensity, and thus the strength of its effect on the system, periodically varies.\n Moessner, Lazarides, Sondhi and Khemani studied what happens when a many-body localized system is periodically driven in this way. They found in calculations and simulations that when you tickle a localized chain of spins with a laser in a particular way, they’ll flip back and forth, moving between two different many-body localized states in a repeating cycle forever without absorbing any net energy from the laser.\n They called their discovery a pi spin-glass phase (where the angle pi signifies a 180-degree flip). The group reported the concept of this new phase of matter — the first many-body, out-of-equilibrium phase ever identified — in  a 2015 preprint, but the words “time crystal” didn’t appear anywhere in it. The authors added the term in  an updated version, published in  Physical Review Letters in June 2016, thanking a reviewer in the acknowledgments for making the connection between their pi spin-glass phase and time crystals.\n Something else happened between the preprint’s appearance and its publication: Nayak, who is a former graduate student of Wilczek’s, and collaborators Dominic Else and Bela Bauer put out  a preprint in March 2016 proposing the existence of objects called Floquet time crystals. They pointed to Khemani and company’s pi spin-glass phase as an example.\n A Floquet time crystal exhibits the kind of behavior envisioned by Wilczek, but only while being periodically driven by an external energy source. This kind of time crystal circumvents the failure of Wilczek’s original idea by never professing to be in thermal equilibrium. Because it’s a many-body localized system, its spins or other parts are unable to settle into equilibrium; they’re stuck where they are. But the system doesn’t heat up either, despite being pumped by a laser or other driver. Instead, it cycles back and forth indefinitely between localized states.\n  Already, the laser will have broken the symmetry between all moments in time for the row of spins, imposing instead “discrete time-translation symmetry” — that is, identical conditions only after each periodic cycle of the laser. But then, through its back-and-forth flips, the row of spins further breaks the discrete time-translation symmetry imposed by the laser, since its own periodic cycles are multiples of the laser’s.\n Khemani and co-authors had characterized this phase in detail, but Nayak’s group couched it in the language of time, symmetry and spontaneous symmetry-breaking — all fundamental concepts in physics. As well as offering sexier terminology, they provided new facets of understanding, and they slightly generalized the notion of a Floquet time crystal beyond the pi spin-glass phase (noting that a certain symmetry it has isn’t needed). Their paper was  published in  Physical Review Letters in August 2016, two months after Khemani and company published the theoretical discovery of the first example of the phase.\n Both groups claim to have discovered the idea. Since then, the rival researchers and others have raced to create a time crystal in reality.\n  Nayak’s crew teamed up with  Chris Monroe at the University of Maryland, who uses electromagnetic fields to trap and control ions. Last month, the group  reported in  Science that they’d turned the trapped ions into an approximate, or “prethermal,” time crystal. Its cyclical variations (in this case, ions jumping between two states) are practically indistinguishable from those of a genuine time crystal. But unlike a diamond, this prethermal time crystal is not forever; if the experiment ran for long enough, the system would gradually equilibrate and the cyclical behavior would break down.\n Khemani, Sondhi, Moessner and collaborators hitched their wagon elsewhere. In 2019, Google  announced that its Sycamore quantum computer had completed a task in 200 seconds that would take a conventional computer 10,000 years. (Other researchers would later  describe a way to greatly speed up the ordinary computer’s calculation.) In reading the announcement paper, Moessner said, he and his colleagues realized that “the Sycamore processor contains as its fundamental building blocks exactly the things we need to realize the Floquet time crystal.”\n Serendipitously, Sycamore’s developers were also looking for something to do with their machine, which is too error-prone to run the cryptography and search algorithms designed for full-fledged quantum computers. When Khemani and colleagues reached out to  Kostya Kechedzhi, a theorist at Google, he and his team quickly agreed to collaborate on the time crystal project. “My work, not only with discrete time crystals but other projects, is to try and use our processor as a scientific tool to study new physics or chemistry,” Kechedzhi said.", "posttime": "2021-07-31 00:32:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,晶体,时间", "title": "物理学家说，他们第一次使用谷歌的量子计算机演示了一种时间晶体，它可以在状态之间永远循环而不消耗能量", "title_en": "Physicists say they used Google's quantum computer to demo a time crystal, which forever cycles between states without consuming energy, for the first time", "transed": 1, "url": "https://www.quantamagazine.org/first-time-crystal-built-using-googles-quantum-computer-20210730/", "via": "", "real_tags": ["谷歌", "google", "晶体", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021 年 7 月 28 日 RabbitMQ Streams 概述介绍了流，这是 RabbitMQ 3.9 中的一项新功能，RabbitMQ Streams First Application 提供了流 Java 客户端的编程模型的概述。这篇文章介绍了如何在 RabbitMQ Streams 中对已发布的消息进行重复数据删除。由于重复数据删除是一个关键且复杂的概念，本文将逐步引导您了解此机制，从一个幼稚且有些损坏的发布应用程序到优化且可靠的实现。应用程序很容易多次发布相同的消息：应用程序以错误的方式重新启动并从头开始重新发布所有数据，网络故障使应用程序重新连接并重新发送几条消息，等等。尽管消费应用程序应该使它们的处理具有幂等性，但应尽可能避免重复发布的消息，因为它们会减慢处理速度并占用额外的空间。这篇文章将从一个简单的应用程序开始，该应用程序会生成大量重复的消息（以帮助掌握问题），并将一点一点地改进它，最终得到一个强大的解决方案。发布程序模拟一个从数据源读取记录并为这些记录中的每一个发布消息的应用程序：Producer producer = environment。生产者建造者 () 。流（“重复数据删除流”）。建造 （）; int messageCount = 10 ;记录（ 0 ， messageCount ）。 forEach(record-&gt;{Message message=producer.messageBuilder().addData(record.content().getBytes(StandardCharsets.UTF_8)).build();producer.send(message,confirmationStatus-&gt;latch.countDown()) ; });\n我们假设应用程序读取了所有可用的记录，并且第一次运行时该数字是 10。如果您想要有关流 Java 客户端 API 的提醒，您可以阅读 RabbitMQ Streams First Application。如果你想在阅读时运行代码，你可以继续下一节。注意你可以按照帖子的其余部分不运行任何东西，所以如果你不想尝试，你可以跳过下一节代码。运行示例需要安装 Docker、Git 和 Java 8 或更高版本。您可以使用以下命令启动代理： docker run -it --rm --name rabbitmq -p 5552:5552 \\ -e RABBITMQ_SERVER_ADDITIONAL_ERL_ARGS = &#39;-rabbitmq_stream Adverted_host localhost&#39; \\ rabbitmq:3.9 代码托管在 GitHub 上。以下是如何克隆存储库并创建示例中使用的流： 在第一次运行时，应用程序从数据源读取所有记录（总共 10 条记录）对于这次运行）并为每个人发送一条消息。我们可以使用以下命令检查流的内容：./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume &#39; 正在连接...已连接。开始消费，按回车退出...message 0message 1message 2message 3message 4message 5message 6message 7message 8message 9\n到目前为止，一切都很好，我们发布了 10 条消息，我们可以在流中看到 10 条消息。现在让我们看看我们的应用程序是否可行并在第二次运行时保持正常工作。现在我们可以想象，我们在第二天运行应用程序，数据源包含 10 条额外记录，所以总共有 20 条记录。我们的发布应用程序是愚蠢的：它会从数据源读取所有内容并发布消息。让我们尝试：./ mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting消耗，按回车退出...message 0message 1message 2...message 9message 0message 1message 2...message 9message 10message 11...message 19 我们看到 30 条消息：第一次运行的 10 条消息和第二次运行的 20 条消息。前 10 条出现两次，所以我们的流包含重复。按照我们实现的方式应用程序这是预期的，但我们必须解决这个问题，因为我们只想在第二次运行时发布新记录。流 Java 客户端文档提供了有关生产者名称和发布 ID 的更多详细信息。注意消息重复数据删除并非特定于流 Java 客户端，只要符合语义，任何客户端都可以实现。我们只需要为我们的发布应用程序选择一个名称，并在不同的运行中保留这个名称。对于发布 ID，我们可以使用记录的 ID：它恰好是唯一的，并且记录按 ID 排序返回（例如只是像数据库中带有数字主键和适当查询的记录）。生产者生产者 = 环境。生产者建造者 () 。流（“重复数据删除流”）。 name (&quot;app-1&quot;) // 为生产者提供一个名字。 ConfirmTimeout ( Duration . ZERO ) // 永不停止重试。建造 （）; int messageCount = 10 ;记录（ 0 ， messageCount ）。 forEach ( record -&gt; { Message message = producer .messageBuilder ().publishId ( record . id ()) // 设置发布ID . addData ( record . content ( ). getBytes ( StandardCharsets . UTF_8 )) .build();生产者.发送(消息,confirmationStatus-&gt;闩锁.countDown());});\n代理将跟踪此生产者的最后一个发布 ID。我们将看到这如何允许对消息进行重复数据删除。 ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...连接。尝试删除流（如果存在）。已删除流。创建“重复数据删除流”流。已创建流。现在我们在第二天运行我们的应用程序，有额外的 10 条记录。我们的应用程序没有第一次那么愚蠢：它使用生产者名称和发布 ID 进行重复数据删除。但它仍然从数据源读取所有记录： ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting 正在消费，按回车退出...message 0message 1message 2...message 9message 10message 11message 12...message 19 这次没有重复，很好！即使我们重新发布了前 10 条消息，broker 还是设法过滤掉了它们。它知道它应该忽略发布 ID 小于 9（第一次运行中的最后一个值）的所有消息。注意，即使它过滤掉了这些重复项，它仍然向客户端确认了它们。这比我们第一个最终出现重复的应用程序要好得多，但仍然存在一个问题：应用程序每次都重新发送所有消息。如果数据不断增长，应用程序每次运行将花费越来越多的时间。幸运的是，可以找出应用程序在上次运行中停止的位置。在本节中，我们将看到如何通过不仅使用重复数据删除，而且还查询代理以获取它发送的最后一个发布 ID，从而使发布应用程序更加智能。\n./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...连接。尝试删除流（如果存在）。已删除流。创建“重复数据删除流”流。已创建流。这个版本的应用程序不是最聪明的，但对于“第一天”来说已经足够了。发布应用程序需要在第二天做得更好，其中数据源现在包含 20 条消息。它可以使用 Producer#getLastPublishingId 方法向代理查询此生产者的最后一个发布 ID 为该流。应用程序可以添加 1到这个值，它会得到它的起点。然后它只需要从这一点选择记录，直到最后一条可用记录。这样它就不会从头开始重新发布。以下代码显示了如何做到这一点：生产者生产者 = 环境。生产者建造者 () 。流（“重复数据删除流”）。 name (&quot;app-1&quot;) // 为生产者提供一个名字。 ConfirmTimeout ( Duration . ZERO ) // 永不停止重试。建造 （）;长开始=生产者。 getLastPublishingId () + 1 ; // 获取最后的发布 ID 并添加 1 int messageCount = 20 ;记录（ start ， messageCount ）。 forEach ( record -&gt; { Message message = producer .messageBuilder ().publishId ( record . id ()) // 设置发布ID . addData ( record . content ( ). getBytes ( StandardCharsets . UTF_8 )) .build();生产者.发送(消息,confirmationStatus-&gt;闩锁.countDown());}); ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$PublishSmartDedupSecondDay&#39;Connecting...Connected.Starting at 10Publishing Publishing 10 message with deduplication enabled.Messages确认？是 所以发布者从 10（9，第一次运行的最后一个发布 ID，+1）开始，发布 10（20，总共，- 10 个已经发布）新消息。我们可以检查流的内容：./ mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting消耗，按回车退出...message 0message 1message 2...message 9message 10message 11message 12...消息 19\n我们在流中获得了预期的消息数量，但这次使用了优化的发布应用程序。需要生成应用程序的名称和发布 ID 才能启用重复数据删除 发布 ID 是一个严格递增的序列，它通常是给定消息的标识符（例如数据库记录的主键、文件中的行）应用程序应该查询他们用来从中断处重新启动的最后一个发布 ID 的代理", "note_en": "July 28, 2021 RabbitMQ Streams Overview introduced streams, a new feature in RabbitMQ 3.9 and  RabbitMQ Streams First Application provided an overview of the programming model with the stream Java client. This post covers how to deduplicate published messages in RabbitMQ Streams.\n As deduplication is a critical and intricate concept, the post will walk you through this mechanism step by step, from a naive and somewhat broken publishing application to an optimized and reliable implementation.\n  It is quite easy for an application to publish the same message several times: the application is restarted in the wrong way and re-publishes all the data from the beginning, a network glitch makes the application reconnect and re-send a couple of messages, etc.\n Even though consuming applications should make their processing idempotent, duplicated published messages should be avoided as much as possible, as they can slow down processing and use extra space.\n This post will start from a simple application that generates lots of duplicate messages (to help grasp the problem) and will improve it little by little to get a robust solution at the end.\n  The publishing program mimics an application that reads records from a data source and publish a message for each a of these records:\n Producer  producer  =  environment . producerBuilder ()  . stream ( &#34;deduplication-stream&#34; )  . build (); int  messageCount  =  10 ; records ( 0 ,  messageCount ). forEach ( record  -&gt;  {  Message  message  =  producer . messageBuilder ()  . addData ( record . content (). getBytes ( StandardCharsets . UTF_8 ))  . build ();  producer . send ( message ,  confirmationStatus  -&gt;  latch . countDown ()); });\n We suppose the application reads  all the records available, and that number is 10 for the first run.In case you want a reminder on the stream Java client API, you can read  RabbitMQ Streams First Application.\n If you want to run the code as you are reading, you can move on to the next section.Note you can follow the remaining of the post without running anything, so you can skip the next section if you don’t want to try out the code.\n  Running the samples requires Docker, Git, and Java 8 or higher installed.You can start the broker with the following command:\n docker run -it --rm --name rabbitmq -p 5552:5552  \\  -e  RABBITMQ_SERVER_ADDITIONAL_ERL_ARGS = &#39;-rabbitmq_stream advertised_host localhost&#39;  \\  rabbitmq:3.9\n   The  code is hosted on GitHub.Here is how to clone the repository and create the stream used in the samples:\n      With this first run, the application read all the records from the data source (that is 10 records overall for this run) and send a message for each of them.We can check the content of the stream with the following command:\n ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39; Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2message  3message  4message  5message  6message  7message  8message  9\n So far, so good, we published 10 messages and we can see 10 messages in the stream.Let’s now if our application is viable and keeps working correctly for a second run.\n  We can imagine now that we run the application on the next day and the data source contains 10 additional records, so 20 records overall.Our publishing application is dumb: it will read everything from the data source and publishing messages.Let’s try:\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2...message  9message  0message  1message  2...message  9message  10message  11...message  19\n We see 30 messages: the 10 from the first run and the 20 from the second run.The first 10 appears twice, so our stream contains duplicate.With the way we implemented the application this is expected, but we have to fix this, because we just want to the new records to be published on the second run.\n     The  stream Java client documentation provides more details about the producer name and the publishing ID.Note message deduplication is not specific to the stream Java client, it can be implemented by any client as long as it complies to the semantics.\n We just have to pick a name for our publishing application and keep this name along the different runs.For the publishing ID, we can use the ID of a record: it happens to be unique and the records are returned sorted by ID (e.g. just like records from a database with a numeric primary key and the appropriate query).\n  Producer  producer  =  environment . producerBuilder ()  . stream ( &#34;deduplication-stream&#34; )  . name ( &#34;app-1&#34; )  // provide a name for the producer   . confirmTimeout ( Duration . ZERO )  // to never stop retrying   . build (); int  messageCount  =  10 ; records ( 0 ,  messageCount ). forEach ( record  -&gt;  {  Message  message  =  producer . messageBuilder ()  . publishingId ( record . id ())  // set the publishing ID   . addData ( record . content (). getBytes ( StandardCharsets . UTF_8 ))  . build ();  producer . send ( message ,  confirmationStatus  -&gt;  latch . countDown ()); });\n The broker will keep track of the last publishing ID for this producer.We’ll see how this allows to deduplicate messages.\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...Connected. Trying to delete stream  if it exists.Stream deleted.Creating  &#39;deduplication-stream&#39; stream.Stream created.\n     We run now our application on the second day, with the extra 10 records.Our application is less dumb that the first time: it uses the producer name and the publishing ID for deduplication. But it still reads  all the records from the data source:\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2...message  9message  10message  11message  12...message  19\n No duplicates this time, nice!Even though we re-published the first 10 messages, the broker managed to filter them out.It knew that it should ignore all the messages with a publishing ID lesser than 9 (the last value in the first run).Note even though it filtered out these duplicates, it nevertheless confirmed them to the client.\n This is much better that our first application where we ended up with duplicates, but there’s still a problem: the application re-sends  all the messages every time.If the data keeps growing, the application will take more and more time for each run.Fortunately it is possible to find out where the application left off in the last run.\n  We’ll see in this section how to make the publishing application even smarter by using not only deduplication but also querying the broker to for the last publishing ID it sent.\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...Connected. Trying to delete stream  if it exists.Stream deleted.Creating  &#39;deduplication-stream&#39; stream.Stream created.\n   This version of the application is not the smartest, but it is enough for “the first day”.\n  The publishing application needs to do better for the second day, where the data source contains now 20 messages.It can use the  Producer#getLastPublishingId method which queries the broker for the last publishing ID of this producer for this stream.The application can add 1 to this value and it will get its starting point.Then it just has to select the records from this point until the last record available.This way it does not re-publish from the beginning.The following code shows how to do this:\n Producer  producer  =  environment . producerBuilder ()  . stream ( &#34;deduplication-stream&#34; )  . name ( &#34;app-1&#34; )  // provide a name for the producer   . confirmTimeout ( Duration . ZERO )  // to never stop retrying   . build (); long  start  =  producer . getLastPublishingId ()  +  1 ;  // get last publishing ID and add 1  int  messageCount  =  20 ; records ( start ,  messageCount ). forEach ( record  -&gt;  {  Message  message  =  producer . messageBuilder ()  . publishingId ( record . id ())  // set the publishing ID   . addData ( record . content (). getBytes ( StandardCharsets . UTF_8 ))  . build ();  producer . send ( message ,  confirmationStatus  -&gt;  latch . countDown ()); });\n  ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$PublishSmartDedupSecondDay&#39;Connecting...Connected.Starting publishing at  10Publishing  10 message with deduplication enabled.Messages confirmed? yes\n So the publisher starts at 10 (9, the last publishing ID of the first run, + 1) and publishes the 10 (20, total, - 10 already published) new messages.We can check the content of the stream:\n ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2...message  9message  10message  11message  12...message  19\n We get the expected number of messages in the stream, but this time with an optimized publishing application.\n   a name for the producing application and a publishing ID are required to enable deduplication\n  the publishing ID is a strictly increasing sequence, it is usually the identifier of a given message (e.g. primary key for a database record, line in a file)\n applications should query the broker for the last publishing ID they used to restart where they left off", "posttime": "2021-07-31 00:32:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rabbitmq,deduplication,应用程序", "title": "使用 RabbitMQ Streams 进行消息重复数据删除", "title_en": "Message Deduplication with RabbitMQ Streams", "transed": 1, "url": "https://blog.rabbitmq.com/posts/2021/07/rabbitmq-streams-message-deduplication", "via": "", "real_tags": ["rabbitmq", "应用程序"]}]