[{"category": "", "categoryclass": "", "imagename": "c1af711e1ab28f245a7ecd28f75427f8.jpg", "infoid": 1069759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Freddie Sayers 会见 Larry Sanger。收听播客版本：https://shows.acast.com/lockdowntv-with-freddie-sayers/larry-sanger阅读她的全文...", "note_en": "Freddie Sayers meets Larry Sanger.Listen to the podcast version: https://shows.acast.com/lockdowntv-with-freddie-sayers/larry-sangerRead the full article her...", "posttime": "2021-07-26 10:42:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,联合,founder,sayers", "title": "维基百科联合创始人：我不再信任我创建的网站", "title_en": "Wikipedia co-founder: I no longer trust the website I created", "transed": 1, "url": "https://www.youtube.com/watch?v=l0P4Cf0UCwU", "via": "", "real_tags": ["rust", "联合", "founder", "sayers"]}, {"category": "", "categoryclass": "", "imagename": "f5c27fed1df0b31b15693f78a4f94b32.png", "infoid": 1069758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三年前，我发现 CcmExec.exe 未能关闭进程句柄导致 32 GB 内存泄漏。该错误已修复，但从那时起，我启用了 Windows 任务管理器中的句柄列，以防万一我遇到另一个句柄泄漏。由于这项例行检查，我在 2021 年 2 月注意到，Chrome 的一个进程打开了 20,000 多个句柄！这个 Chrome 错误现已修复，但我想分享如何调查处理泄漏，因为还有其他泄漏程序。我也想分享我的学习过程。对 Chrome 的任务管理器进行的一些调查表明，有问题的进程是 gmail 的渲染器进程，再多看看就会发现大多数 Chrome 渲染器进程的内核句柄少于 1,000 个。 20,000 似乎异常，经过几个小时的监控后，我可以看到句柄数量无限增加。怜悯活着，看起来我们的句柄泄漏了。我想知道的第一件事是这些是什么类型的手柄。 Windows 句柄可以引用文件、进程、线程、事件、信号量和许多其他内核对象。我转向 sysinternals 的句柄工具查看它是哪种类型，但它说在这个过程中只有几百个句柄打开。事实证明，handle.exe 默认只显示有关文件句柄的信息。要获取完整信息，您可以传递 -a 以转储有关所有句柄的信息，或传递 -s 以按类型进行汇总。 -s 选项对本次调查最有帮助。典型的输出像这样寻找 gmail（从管理命令提示符运行它会解析 &lt;Unknown type&gt; 句柄）：句柄类型摘要：&lt;Unknown type&gt; : 4 &lt;Unknown type&gt; : 77 &lt;Unknown type&gt; : 48 ALPC Port ：1 目录：2 事件：20858 文件：147 IoCompletion：4 IRTimer：6 键：8 信号量：8 线程：31 TpWorkerFactory：3 WaitCompletionPacket：10 总句柄：21207\n所以。事件处理它是。还可能会更糟糕的。泄漏的进程句柄保留了昂贵的内核结构，每个句柄似乎加起来大约 64 KB。相比之下，事件句柄相当便宜——可能只有 16 个字节左右（很难衡量）。这次泄漏的影响可能微乎其微。但是，Chrome 使用 RAII 对象来管理它的所有句柄，所以我们不应该有泄漏——我想知道出了什么问题。经过一番询问，我发现我的同事都不知道如何调查处理泄漏，所以我不得不弄清楚。我将调试器附加到 gmail 进程并尝试在创建事件的函数上设置断点，但我收到太多噪音。正在创建数百个事件，其中超过 99% 的事件被彻底删除。我需要更好的东西。有些人可能会说我太沉迷于使用 Windows 的事件跟踪来尝试解决所有问题，但只要它继续工作，我就会继续使用它。我怀疑 ETW 可能能够跟踪句柄创建和销毁并找到泄漏，但我不知道如何。一点谷歌搜索找到了这篇文章。它让我开始了，但它有一些缺陷： 文章显示数十个标志被传递给 xperf.exe，但没有解释它们是什么 指定的标志导致非常高的数据速率，这使得长时间运行的跟踪不切实际帖子承诺会在“下一个帖子”中解释如何分析数据，但没有“下一个帖子”和求助电话导致没有任何漏洞，这让我破案了。我开始主要按原样使用它。我编写了一个泄漏 10,000 个句柄的测试程序，并记录了一个跟踪，看看我是否可以看到故意泄漏。有效。然而，它以每小时许多 GB 的速度记录数据。因为手柄泄漏相当缓慢——泄漏 20,000 个手柄需要数周时间——我需要进行数小时的跟踪以确保我能发现泄漏。我专注于两种策略：\n您可以通过查看 xperf -providers 的输出找到更多关于其中一些含义的信息，但简短的版本是推荐的命令行不仅记录有关句柄的信息，还记录有关每个上下文切换和所有磁盘的信息。 /O（请参阅延迟），启用采样分析器（也在延迟中）等等。我的第一步是将其精简为这样：需要 PROC_THREAD+LOADER 来理解任何 ETW 跟踪，而 OB_HANDLE+OB_OBJECT 似乎是句柄跟踪的关键。一位 Microsoft 联系人告诉我不需要 OB_OBJECT，因此我将其删除。推荐的命令对 -stackwalk 标志也有六个不同的参数，而我真正需要的是分配句柄时的堆栈。我删除了其中的五个，然后添加了 HandleDuplicate 以防万一。您可以在 github 上的批处理文件中看到一个功能更齐全的命令行，但这显示了最小的想法。它开始跟踪，记录足够的信息以将事件归因于正确的线程和模块 (PROC_THREAD+LOADER)，记录有关句柄操作的信息 (OB_HANDLE) 并记录有关句柄创建和句柄复制的调用堆栈。完美的！然后我将（仍然太大的）跟踪加载到 WPA 中，并查看所有数据的来源。产生最多事件的进程是任务管理器和 Chrome 远程桌面。高流量意味着这两个进程正在创建和销毁大量句柄。这通常不是问题（它们没有泄漏句柄）但它使我的跟踪变大，因此解决方案很明确 - 在跟踪时关闭它们。关闭任务管理器很容易，但由于我是在家中在办公室的工作站上进行这项调查，因此关闭 Chrome 远程桌面不太方便。但是，不用担心。我确保一切正常运行，然后断开连接（以减少生成的数据量），然后在 12 小时后重新连接。这种策略 - 关闭生成过多数据的程序 - 通常对 ETW 很有用，因为它通常记录有关整个系统的信息，包括所有正在运行的进程。现在我有一些大但可管理的跟踪（~970 MB，压缩），我可以开始分析。我将跟踪加载到 Windows 性能分析器中，最终找到了句柄跟踪图。它位于 Graph Explorer 中的 Memory (???)、Handles、Outstanding Count by Process 下。完美的！打开它会给出一个图表，显示每个进程的句柄计数随着时间的推移。十二个小时内有很多活动。放大到十分钟的时间跨度显示一连串的活动。进程被创建，分配一些句柄，然后死亡，创建一个像数字纪念碑谷一样的视图。其他进程分配和释放句柄没有明确的模式，其他进程似乎无限期地增加它们的句柄数：图表很漂亮，但我决定我想要原始数字，所以我查看了表格。默认视图对于分配了近 150 万个句柄的 Chrome 浏览器进程来说非常糟糕。可是等等…\n句柄泄漏不在浏览器进程中，它远不及 150 万个句柄。好吧，事实证明默认视图具有误导性。虽然图表/表格被称为“按流程计算的杰出计数”，这确实是图形显示的内容，但该表格实际上显示了按流程计算的累计计数。也就是说，浏览器进程在 12 小时内分配了 150 万个句柄，但它释放了几乎所有的句柄，那么谁在乎呢？我想看到的是突出的句柄——已分配但未释放。该表可以显示这些数据，但它肯定不会让它变得容易。在堆跟踪表中有一个标记为类型的列。现在这是一个非常糟糕的列名选择，但它是一个非常重要的列。至关重要的是，在类型列的上下文中，“内部”表示在跟踪记录的时间范围内，而“外部”表示在跟踪记录的时间范围之外。可用的类型有： AIFO 是有趣的事件，因为它们是在记录跟踪时分配的，然后在跟踪记录停止之前未释放。它们可能在几秒钟后被释放，但是如果您在同一个调用堆栈上看到足够多的它们，您就会怀疑……这就是堆跟踪的工作原理。句柄跟踪采用了这个概念并将其更改为足以令人困惑的程度。他们将列从 Type 重命名为 Lifetime。 Lifetime 绝对是一个更好的名字，但不可避免地会发生一些混淆，因为同一概念有两个名字 他们默认关闭了该列。这和堆跟踪是一致的，默认情况下Type列是关闭的，但是莫名其妙。这是表格中最重要的一列，所以我不明白为什么它不在前面和中间。除了默认情况下关闭列之外，他们实际上隐藏了它！通常，您可以右键单击任何列标题，选择更多列...，然后查看您可以启用的列列表。许多用户（我很长一段时间）可能认为菜单中的列列表是完整的。它不是。对于某些列——包括极其重要的生命周期列——您必须调用视图编辑器（Ctrl+E 或单击“按进程未完成计数”右侧的齿轮框），然后从可用列列表中拖动生命周期列在左边到右边的列表。唉……我向 WPA 负责人报告了这些问题，他们同意需要改进。既然 WPA（预览版）在 Microsoft 商店中可用，我们应该期望像这样的修复程序将比以往任何时候都更快地发布。\nETW 的句柄跟踪要注意的最后一个问题是它似乎有一些记帐错误。它将报告给定“handle -s”输出不可能发生的泄漏，因此请务必在花费太多时间之前交叉检查您的结果。带着所有的学习和发现，我得出了这个观点。它显示了 gmail 进程在 12 小时内泄漏的 527 个事件句柄，其中 510 个都泄漏在同一个调用堆栈上，以 WaitableEvent 构造函数结束：事件对象由 Chrome 的 WaitableEvent 类分配并存储在其中，由其 ScopedHandle 成员管理多变的。这意味着如果我们泄漏了这些句柄，我们也会泄漏 WaitableEvent 对象。如果我们泄漏了那些，那么我们还泄漏了什么？我使用堆快照跟踪来监控 gmail 进程。这对我来说是熟悉的领域，所以它进行得很顺利。然后我通过类似于句柄泄漏的调用堆栈寻找潜在的泄漏并找到了一些。然后我环顾四周寻找其他潜在的泄漏，其计数相似且看起来似乎相关，我发现了一个似乎与 IDBFactory 和 OperationsController 对象泄漏相关的集合。我使用 Chrome 的开发人员工具查看 gmail 是否泄漏了 IDB 相关对象。事实并非如此，所以我不能把这归咎于 gmail 团队。有几个人最终为分析做出了贡献。我了解如何解释这些痕迹，并且可以在 Chrome 的自定义检测版本上重现泄漏，但我对 JavaScript 很糟糕，而且我不了解我们的 IDB 架构。我的一位同事了解泄漏对象的架构。这位同事意识到泄漏的分配发生在服务工作线程上，并且在 IndexedDB 连接打开时只要服务工作线程消失就会泄漏。事实证明，这种情况在某些网站上经常发生，而 Chrome 对此处理得很差。那就是错误！进一步的调查支持了这一理论——泄漏对象数量的增加与服务工作线程的退出有关。然后我意识到服务工作者与 Google Drive 的离线模式相关联。如果我禁用离线模式，那么泄漏就会消失。\n花了几个月的时间来理解这个错误，但很快就创建了一个修复程序（不是我 - 我仍然不理解代码的那部分）并在几天后登陆 Chromium 存储库。该修复于 5 月登陆 M92，并于 2021 年 7 月 21 日左右开始向普通用户推出。如果您还没有修复，那么您很快就会获得。一旦理解了错误，我就可以进行压力测试。使用带有 bug 的 Chrome 版本，我同时打开了 gmail、工作表、文档和驱动器。所有这些都使用离线模式，因此所有这些都泄漏了句柄。我的 Chrome 窗口看起来像这样： 在让有问题的 Chrome 像这样运行几天之后，任务管理器在按句柄排序时看起来像这样：前 11 个进程中有 5 个是 chrome.exe（四个渲染器加上浏览器进程）。更新浏览器后，四个渲染器不再显示在顶部列表中。但是其他过程呢？ WPA.exe 是 Windows 性能分析器——我用来分析句柄泄漏跟踪的工具。它打开了大约 1,700 个 .symcache 文件，并且似乎有一个事件句柄泄漏，就像 Chrome 一样。我已经向开发人员报告了这些问题，他们正在调查。系统混合了事件句柄、文件句柄、IoCompletion 句柄、进程句柄、WaitCompletionPacket 句柄等。我不知道这些是否代表泄漏。我猜他们没有。此 dllhost.exe 副本托管 thumbcache.dll。一些实验表明，如果我创建新的 .mp4 文件，那么当资源管理器创建缩略图时，这个过程会泄漏每个文件 12 个以上的 WaitCompletionPacket 句柄。当我清理假期视频时，这很容易泄漏成百上千个句柄。我在推特上提到过两次。我还在反馈中心报告了它（仅对 Windows 10 上的非公司用户可见）。可以在此处找到显示我创建 20 个 .mp4 文件并泄漏数百个句柄的 ETW 跟踪。这应该是固定的。最后一个是 IntelTechnologyAccessService.exe，它会泄漏事件句柄。没有符号或不知道它的作用，我只能说泄漏来自他们的 core.dll。我在推特上发布了关于泄漏的消息，并得到了一位想要修复泄漏的英特尔开发人员的迅速回应。我在禁用离线模式和固定版本的 Chrome（重新启用离线模式）的情况下进行了相同的压力测试。这清楚地表明禁用离线模式阻止了错误的出现，并且证明了修复是有效的。句柄泄漏消失了，相关的内存泄漏也消失了。\n当运行 Chrome 的固定版本时，Windows 任务管理器看起来更像这样。 Chrome 的浏览器和 GPU 进程（未显示）仍然有 1,000 多个句柄打开，因为它们的工作方式，但渲染器进程使用的句柄很少，以至于它们都不再出现在结果的第一页上——问题解决了。 dllhost.exe 的排名上升了，因为我通过创建 512 个新的 .mp4 文件对其进行了压力测试，并且资源管理器出现了，因为显然我的 .mp4 测试显示其中存在事件句柄泄漏。叹息……处理泄漏并不是最糟糕的事情。进程句柄泄漏非常昂贵，但事件句柄泄漏则不然。除了在某些情况下——比如 Chrome 的——句柄泄漏可能与其他泄漏相关，所以它们通常值得调查。注意任务管理器，尤其是你自己的进程，这样你就可以避免这个问题。我仍然不知道如何调查 GDI 句柄泄漏——如果有人知道，请告诉我。您可以在 Chromium 错误中阅读长达数月的调查——失误等等。此条目发表在错误、代码可靠性、调查报告、uiforetw、xperf 和标记句柄、泄漏。为永久链接添加书签。", "note_en": "Three years ago I found a  32 GB memory leak caused by  CcmExec.exe failing to close process handles. That bug is fixed, but ever since then I have had the  handles column in  Windows Task Manager enabled, just in case I hit another handle leak.\n Because of this routine checking I noticed, in February of 2021, that one of Chrome’s processes had more than 20,000  handles open!\n This Chrome bug is fixed now but I wanted to share how to investigate handle leaks because there are other leaky programs out there. I also wanted to share my process of learning.\n  A bit of investigation with  Chrome’s Task manager showed that the process in question was the  renderer process for gmail, and a bit more looking around showed that most Chrome renderer processes had fewer than 1,000 kernel handles.\n 20,000 seemed anomalous and after monitoring for a few hours I could see that the handle count was going up indefinitely. Mercy sakes alive, looks like we’ve got us a handle leak.\n  The first thing I wanted to know was what type of handles these were. Windows handles can refer to files, processes, threads, events, semaphores, and many other kernel objects. I turned to the sysinternals’   handle tool to see which type it was, but it said there were only a few hundred handles open in that process. It turns out that  handle.exe defaults to only displaying information about file handles. To get full information you can pass -a to dump information about all handles, or -s to summarize by type. The -s option is most helpful for this investigation. Typical output looked for gmail like this (running it from an admin command prompt would have resolved the &lt;Unknown type&gt; handles):\n Handle type summary:   &lt;Unknown type&gt;  : 4   &lt;Unknown type&gt;  : 77   &lt;Unknown type&gt;  : 48   ALPC Port       : 1   Directory       : 2   Event           : 20858   File            : 147   IoCompletion    : 4   IRTimer         : 6   Key             : 8   Semaphore       : 8   Thread          : 31   TpWorkerFactory : 3   WaitCompletionPacket: 10 Total handles: 21207\n So. Event handles it is. It could be worse. Leaked process handles keep around expensive kernel structures which seem to add up to about 64 KB per handle. Event handles, in comparison, are pretty cheap – perhaps sixteen bytes or so (it’s hard to measure). It was possible that the impact of this leak was minuscule. But, Chrome uses  RAII objects to manage all of its handles so we shouldn’t have leaks – I wanted to understand what was going wrong.\n After a bit of asking around I found that none of my coworkers knew how to investigate handle leaks, so I had to figure it out. I attached a debugger to the gmail process and tried setting a breakpoint on the functions that create events but I got too much noise. Hundreds of events were being created and more than 99% of them were being cleanly deleted. I need something better.\n  Some might say that am too obsessed with using  Event Tracing for Windows to try to solve all problems, but as long as it keeps working I’m going to keep using it. I suspected that ETW might be able to track handle creation and destruction and find leaks, but I had no idea how.\n A bit of Google searching found  this article. It got me started, but it has a few flaws:\n The article shows dozens of flags being passed to xperf.exe, but no explanation of what they are The flags specified led to a very high data rate, which made long-running tracing impractical The post promised to explain how to analyze the data in “the next post”, but there was no “next post” and a  call for help led to nothing\n Flaws or not, this let me crack the case. I started by using it mostly as-is. I wrote a test program that leaked 10,000 handles and I recorded a trace to see if I could see the intentional leak. It worked.\n However it was recording data at many GB per hour. Because the handle leak was fairly slow – it took weeks to leak 20,000 handles – I needed a many-hour trace to be sure I could catch the leak. I focused on two strategies:\n    You can find more about what some of these mean by looking at the output of  xperf -providers but the short version is that the recommended command line doesn’t just record information about handles, it also records information about every context switch and all disk I/O (see Latency), enables the sampling profiler (also in Latency), and so much more. My first step was to trim it down to just this:\n  PROC_THREAD+LOADER is required to make sense of any ETW trace, and OB_HANDLE+OB_OBJECT seemed to be the critical things for handle tracing. A Microsoft contact then told me that OB_OBJECT was not needed so I removed that. The recommended command also had six different parameters to the -stackwalk flag, when all I really need is the stacks for when handles are allocated. I deleted five of those and then added HandleDuplicate just in case.\n   You can see a more full-featured command line in the  batch file on github but this shows the minimal idea. It starts tracing, records enough information to attribute events to the right thread and module (PROC_THREAD+LOADER), records information on handle operations (OB_HANDLE) and records call stacks on handle creation and handle duplication. Perfect!\n  I then loaded the (still-too-large) traces into WPA and looked to see where all of the data was coming from. The processes that were generating the most events were  Task Manager and  Chrome Remote Desktop. The high amount of traffic meant that these two processes were creating and destroying a lot of handles. This was not normally a problem (they weren’t leaking handles) but it was making my trace larger, so the solution was clear – shut them down while tracing. Closing  Task Manager was easy enough, but since I was doing this investigation from home on my workstation in the office it was less convenient to close  Chrome Remote Desktop. But, no worries. I made sure everything was running correctly and then disconnected (to reduce the amount of data being generated) and then reconnected twelve hours later. This sort of tactic – shutting down programs that are generating excessive data – is often useful with ETW because it generally records information about the entire system, including all running processes.\n  Now I had some large-but-manageable traces (~970 MB, compressed) and I could start the analysis. I loaded the trace into Windows Performance Analyzer and eventually found the handle tracking graph. It’s in Graph Explorer, under Memory (???), Handles, Outstanding Count by Process. Perfect!\n Opening this gives a graph showing handle counts over time for every process. There’s a lot of activity over twelve hours. Zooming in to a ten-minute time span shows a flurry of activity. Processes are created, allocate some handles, and then die, creating a view like a digital Monument Valley. Other processes allocate and free handles with no clear pattern, and others seem to increase their handle count indefinitely:\n  The graph was pretty, but I decided I wanted raw numbers so I looked at the table. The default view looked pretty damning for Chrome’s browser process with almost 1.5 million handles allocated. But wait…\n  The handle leak wasn’t in the browser process, and it was nowhere near 1.5 million handles. Well, it turns out that the default view is misleading. While the graph/table are called “Outstanding Count by Process” and that is indeed what the graph shows, the  table actually shows  cumulative count by process. That is, the browser process allocated 1.5 million handles over twelve hours, but it freed pretty much all of them, so who cares?\n What I wanted to see was outstanding handles – allocated but not freed. The table can show that data, but it sure doesn’t make it easy.\n In the  heap tracing tables there is a column labeled  Type. Now that is a uniquely poor choice for a column name, but it is a very important column. Crucially, in the context of the  Type column “Inside” means inside the time range recorded by the trace and “Outside” means outside the time range recorded by the trace. The available types are:\n  AIFO are the interesting events because they were allocated while the trace was being recorded and then not freed before trace recording stopped. They  might have been freed a few seconds later, but if you see enough of them on the same call stack you get suspicious…\n That’s how heap tracing works. Handle tracing took that concept and changed it just enough to be confusing.\n They renamed the column from Type to Lifetime. Lifetime is definitely a better name, but there is inevitably some confusion that happens from having two names for the same concept They made the column off by default. This is consistent with heap tracing, which has the Type column off by default, but it is inexplicable. This is the single most important column in the table so I don’t understand why it isn’t front and center. In addition to having the column off by default they actually hide it! Normally you can right-click on any column header, select  More Columns…, and see a list of columns that you can enable. Many users (me for a long time) probably assume that the list of columns in the menu is complete. It is not. For some columns – including the vitally important  Lifetime column – you have to invoke the  View Editor (Ctrl+E or click the gear box to the right of “ Outstanding Count by Process”) and then drag the Lifetime column from the list of  Available Columns on the left to the list on the right. Sigh…\n I reported these problems to the WPA lead and they agreed that improvements were needed. Now that  WPA (Preview) is available in the Microsoft store we should expect that fixes like this will ship faster than ever before.\n A final issue to be aware of with ETW’s handle tracing is that it seems to have some accounting errors. It will report leaks that are impossible given the “handle -s” output, so be sure to cross-check your results before spending too much time.\n  With all of that learning and discovery behind me I arrived at this view. It showed 527 event handles leaked by the gmail process in twelve hours, with 510 of them all leaks on the same call stack, ending in the WaitableEvent constructor:\n    The event object was allocated by and stored in Chrome’s  WaitableEvent class, managed by its ScopedHandle member variable. That meant that if we were leaking these handles we were also leaking the WaitableEvent objects. If we were leaking those then what else were we leaking?\n I used  heap snapshot tracing to monitor the gmail process. This was familiar territory for me so it went smoothly. I then looked for potential leaks with call stacks similar to the handle leak and found some. I then looked around for other potential leaks with counts that were similar and that looked plausibly related and I found a set that seemed related to leaks of IDBFactory and OperationsController objects.\n I used Chrome’s developer tools to see if gmail was leaking IDB related objects. It was not, so I wasn’t able to blame this on the gmail team.\n  Several people ended up contributing to the analysis. I understood how to interpret the traces and I could reproduce the leaks on custom-instrumented versions of Chrome, but I am terrible at JavaScript and I don’t understand our IDB architecture. One of my coworkers understood the architecture of the leaking objects. This coworker realized that the leaked allocations were happening on service worker threads and were being leaked whenever service worker threads went away while an IndexedDB connection was open. It turns out this happens quite regularly on some websites, and Chrome was handling this poorly. That’s the bug!\n Further investigation supported this theory – the increases in leaked object counts were correlated with service worker threads exiting. I then realized that the service workers were associated with Google Drive’s offline mode. If I disabled offline mode then the leaks went away.\n It took months to understand the bug, but then a  fix was created fairly promptly (not by me – I still don’t understand that part of the code) and landed in the Chromium repo a few days later.\n The fix landed in May  in M92 which started rolling out to regular users around July 21st 2021. If you don’t have the fix already then you will soon.\n  Once the bug was understood I could do stress tests. Using a version of Chrome with the bug I left gmail, sheets, docs, and drive open simultaneously. All of these use offline mode so all of them leaked handles. My Chrome window looked like this:\n  After leaving buggy Chrome running like this for a few days Task Manager looked like this when sorted by handles:\n  Five of the top eleven processes are chrome.exe (four renderers plus the browser process). Once I updated my browser the four renderers no longer show up in the top list. But what about the other processes?\n WPA.exe is Windows Performance Analyzer – the tool I use to analyze the handle-leak traces. It leaves about 1,700 .symcache files open, and seems to have an Event handle leak, just like Chrome. I’ve reported these issues to the developer and they are investigating. System has a mixture of Event handles, File handles, IoCompletion handles, Process handles, WaitCompletionPacket handles, and others. I don’t know if these represent leaks. I’m guessing they do not. This copy of dllhost.exe hosts thumbcache.dll. A bit of experimentation showed that if I create new .mp4 files then this process leaks 12+ WaitCompletionPacket handles per file when explorer creates the thumbnails. When I’m cleaning up vacation videos this can easily leaks hundreds or thousands of handles. I  mentioned this on twitter,  twice. I also reported it on  Feedback Hub (only visible to non-corporate users on Windows 10). An ETW trace showing me creating 20 .mp4 files and leaking hundreds of handles can be  found here. This should be fixed. The last one is IntelTechnologyAccessService.exe, which leaks Event handles. Without symbols or any idea of what it does I can only tell that the leaks are from their core.dll. I   tweeted about the leak and got a swift response from an Intel developer who wants to fix the leak.\n I did the same stress test both with offline mode disabled and with fixed versions of Chrome (with offline mode re-enabled). This made it clear that disabling offline mode stopped the bug from appearing, and it proved that the fix was working. The handle leaks were gone, as were the associated memory leaks.\n When running the fixed version of Chrome the Windows Task Manager looked more like this. Chrome’s browser and GPU processes (not shown) still have more than 1,000 handles open, due to how they work, but the renderer processes are using few enough handles that none of them make it onto the first page of results anymore – problem solved. dllhost.exe has moved up the rankings because I stress-tested it by creating 512 new .mp4 files, and explorer showed up because apparently my .mp4 testing revealed an event handle leak in it. Sigh…\n  Handle leaks are not the worst thing ever. Process handle leaks are quite expensive, but event handle leaks are not. Except that in some cases – like Chrome’s – the handle leak may correlate with other leaks, so they are usually worth investigating.\n Pay attention to Task Manager, especially for your own processes, so that you can avoid  this problem.\n I still don’t know how to investigate  GDI handle leaks – if somebody knows then please let me know.\n You can read the multi-month investigation – missteps and all – in the  Chromium bug.\n    This entry was posted in  Bugs,  Code Reliability,  Investigative Reporting,  uiforetw,  xperf and tagged  handles,  leaks. Bookmark the  permalink.", "posttime": "2021-07-26 10:41:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,句柄", "title": "在 Chromium 等中查找 Windows HANDLE 泄漏", "title_en": "Finding Windows HANDLE leaks, in Chromium and others", "transed": 1, "url": "https://randomascii.wordpress.com/2021/07/25/finding-windows-handle-leaks-in-chromium-and-others/", "via": "", "real_tags": ["windows", "句柄"]}, {"category": "", "categoryclass": "", "imagename": "99a61ac6f3d338bfc2332313bc4e1cda.jpg", "infoid": 1069757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日本横滨，2021 年 7 月 16 日——Socionext Inc. 与高能加速器研究组织材料结构科学研究所、京都大学综合辐射与核科学研究所和大阪信息科学与技术研究生院的研究人员合作大学，并首次成功证明了介子和中子引起的半导体器件的软误差具有不同的特性。该研究小组在材料和生命科学设施 (MLF) 的μ 子科学设施 (MUSE)、日本质子加速器研究中心 (J-PARC)、京都大学研究中心的热中子束进行了用负和正μ子束照射半导体器件的实验反应堆 (KUR) 和大阪大学核物理研究中心 (RCNP) 的高能中子束。课题组通过使用多种类型的量子束，实现了对宇宙射线μ子和中子对环境辐射影响的综合测量。令人鼓舞的结果有望推动环境辐射引起的软错误的有效评估方法和对策的发展。预计结果还将导致创建高度可靠的半导体设备，以支持未来的基础设施。研究工作成果已于2021年5月21日在线发表在IEEE Transactions on Nuclear Science上。部分研究工作得到了“企业、研究所和学术界开放创新平台计划（OPERA）”的支持。日本科学技术振兴机构（JST）。背景技术随着半导体器件的集成度越来越高，其工作电压越来越低，它们更容易出现软错误，当电子信息被辐射意外改变时，就会发生软错误。有人担心环境辐射引起的软错误会导致更严重的问题。以前，环境辐射中的宇宙射线中子被认为是引起软误差问题的主要来源。另一方面，对于高度集成且使用较低电压的先进半导体器件，由同样源自宇宙射线的 μ 子引起的软错误已成为一个问题。在落入地球的宇宙射线中，介子约占所有粒子的四分之三，有人指出它们可能造成比中子更大的问题。但是，关于μ介子引起的软误差的报道很少，中子引起的软误差和μ介子引起的软误差之间的区别还不是很清楚。结果 本研究中，为了解宇宙射线μ子和中子引起的软误差差异，课题组通过用μ子和中子照射半导体器件进行了对比评价。本实验中使用了采用 20 纳米 CMOS 工艺技术制造的 SRAM 电路。每束量子束照射SRAM，分析每一个粒子的软错误发生率和趋势。发现μ子和中子在错误率的电源电压依赖性、多位错误的比率以及多位错误模式的特征方面存在明显差异。该结果在世界上首次获得。\n未来 这些结果将导致技术的发展，以有效解决包括 μ 子在内的环境辐射引起的问题。本研究发现的介子和中子之间效应的差异将有助于建立防止软错误的最佳设计方法。本研究的结果也有望通过数值模拟促进评估方法的发展。未来，基础设施的可靠性将取决于大量的半导体器件，预计环境辐射引起的软错误的评估和对策将变得更加重要。正如本研究中所做的那样，使用量子束进行软错误评估的开发有望导致创建更安全、更可靠和更可靠的半导体设备。文章信息主题：20 纳米 SRAM 中的介子诱导单事件翻转：与中子和 Alpha 粒子的比较表征作者： Takashi Kato 1、Motonobu Tampo 2、Soshi Takeshita 2、Hiroki Tanaka 3、Hideya Matsuyama 1、Masanori Hashimoto 4、 Yasuhiro Miyake 2 1 Socionext Inc. 可靠性工程部 2 Muon 科学实验室，材料结构科学研究所，高能加速器研究机构/ J-PARC 3 京都大学综合辐射与核科学研究所 4 大阪大学信息科学与技术研究生院 所有此处提及的公司或产品名称是其各自所有者的商标或注册商标。本新闻稿中提供的信息在发布时准确无误，如有更改，恕不另行通知。", "note_en": "Yokohama, Japan, July 16, 2021 --Socionext Inc. has collaborated with researchers from Institute of Materials Structure Science at High Energy Accelerator Research Organization, Institute for Integrated Radiation and Nuclear Science at Kyoto University and Graduate School of Information Science and Technology at Osaka University, and has successfully demonstrated, for the first time, that the soft errors of semiconductor devices induced by muons and neutrons have different characteristics. The research group conducted experiments to irradiate semiconductor devices with negative and positive muon beams at Muon Science Facility (MUSE) of Materials and Life Science Facility (MLF), Japan Proton Accelerator Research Complex (J-PARC), thermal neutron beams at Kyoto University Research Reactor (KUR), and high-energy neutron beams at Research Center for Nuclear Physics (RCNP) of Osaka University, respectively. By using multiple types of quantum beams, the research group has achieved a comprehensive measurement of the effects of cosmic-ray muons and neutrons in environmental radiation. The encouraging results are expected to drive the development of effective evaluation method and countermeasures for soft errors caused by environmental radiation. The results are also expected to lead to the creation of highly reliable semiconductor devices that will support the future infrastructure.\n The results of the research work have been published online in IEEE Transactions on Nuclear Science on May 21, 2021.\n Part of this research work was supported by the &#34;Program on Open Innovation Platform with Enterprises, Research Institutes and Academia (OPERA)&#34; of the Japan Science and Technology Agency (JST).\n Background As semiconductor devices become more highly integrated and their operation voltage becomes lower, they are more prone to soft errors, which occur when electronic information is unexpectedly altered by radiation. There are concerns that soft errors by environmental radiation will cause more serious problems.\n Previously, cosmic-ray neutrons in environmental radiation were considered as the main source of the problems to cause soft errors. On the other hand, for advanced semiconductor devices, which are highly integrated and use lower voltage, soft errors caused by muons, which are also derived from cosmic rays, have become a concern. Muons account for about three-quarters of all particles in cosmic rays that fall to the Earth, and it has been pointed out that they may cause a bigger problem than neutrons. However, there have been very few reports of soft errors caused by muons, and the difference between soft errors caused by neutrons and by muons has not been well understood.\n Results In this study, to understand the difference in soft errors caused by cosmic-ray muons and neutrons, the research group performed comparative evaluations by irradiating semiconductor devices with muons and neutrons. An SRAM circuit fabricated with 20-nm CMOS process technology has been used in this experiment. The SRAM was irradiated with each quantum beam, and the rate and the trend of soft error occurrence were analyzed by each of the particles.\n It was found that there are clear differences between muons and neutrons in terms of supply voltage dependency of the error rate, the ratio of multiple-bit errors, as well as the characteristics of the multiple-bit error patterns. The result has been obtained for the first time in the world.\n  Future The results will lead to a development of technologies to effectively solve the problems caused by environmental radiation which includes muons. The difference of effects between muons and neutrons, which have been discovered in this study, will help establish an optimal design method to prevent soft errors. The results of this study are also expected to contribute to the evolution of evaluation method by numerical simulations.\n In the future, the reliability of the infrastructure will depend on a vast number of semiconductor devices, and it is expected that evaluation and countermeasures against soft errors caused by environmental radiation will become even more important. Development of soft error evaluation using quantum beams, as was done in this study, is expected to lead to the creation of safer, securer, and more reliable semiconductor devices.\n Article Information Subject:  Muon-Induced Single-Event Upsets in 20-nm SRAMs: Comparative Characterization with Neutrons and Alpha Particles Authors: Takashi Kato 1, Motonobu Tampo 2, Soshi Takeshita 2, Hiroki Tanaka 3, Hideya Matsuyama 1, Masanori Hashimoto 4, Yasuhiro Miyake 2  1Reliability Engineering Department, Socionext Inc.  2Muon Science Laboratory, Institute of Materials Structure Science, High Energy Accelerator Research Organization/ J-PARC  3Institute for Integrated Radiation and Nuclear Science, Kyoto University  4Graduate School of Information Science and Technology, Osaka University\n          All company or product names mentioned herein are trademarks or registered trademarks of their respective owners. Information provided in this press release is accurate at time of publication and is subject to change without advance notice.", "posttime": "2021-07-26 10:41:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "介子,semiconductor,研究", "title": "宇宙线介子和中子引起的半导体软误差差异", "title_en": "Differences in Semiconductor Soft Errors Caused by Cosmic-Ray Muons and Neutrons", "transed": 1, "url": "http://www.socionextus.com/pressreleases/socionext-and-partners-clarify-differences-between-semiconductor-soft-errors-caused-by-cosmic-ray-muons-and-neutrons/", "via": "", "real_tags": ["介子", "研究"]}, {"category": "", "categoryclass": "", "imagename": "51a81b07663f1889989df2f903325846.jpeg", "infoid": 1069756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单击“注册”，即表示您同意接收来自 Insider 的营销电子邮件以及其他合作伙伴的优惠，并接受我们的服务条款和隐私政策。参议员伊丽莎白·沃伦 (Elizabeth Warren) 周日在推特上谈到了杰夫·贝佐斯 (Jeff Bezos) 最近的太空飞行，称如果他有能力去太空，他就可以支付更多的税。沃伦在推特上写道：“地球上最富有的人可以将自己送入太空，而超过一半的国家靠薪水过日子，近 4300 万人背负着学生债务，育儿费用迫使数百万人失业。” “他有能力投球，所以其他人都有机会。”据 ProPublica 6 月报道，亚马逊创始人兼前首席执行官杰夫·贝索斯 (Jeff Bezos) 在 2006 年至 2018 年间至少两年内缴纳了 0 美元的联邦所得税。重磅报道还透露，特斯拉首席执行官埃隆马斯克在 2018 年也做了同样的事情。 Insider 的 Lynnley Browning 在 2019 年报道称，亚马逊在 2017 年和 2018 年也缴纳了 0 美元的所得税。贝索斯目前被福布斯列为全球首富，其中净资产为 2092 亿美元。这位亿万富翁的太空探索公司 Blue Origin 周二成功完成了首次载人太空飞行，将贝索斯和其他三人送入太空，并在失重状态下进行了大约三分钟的飞行。\n沃伦上周还在飞行途中对贝索斯进行了猛烈抨击，他在推特上写道：“杰夫贝索斯忘记感谢所有辛勤工作的美国人，他们实际上缴纳了税款以维持这个国家的运转，而他和亚马逊却没有支付任何费用。”注册接收来自 Insider 的通知！随时了解您想知道的内容。形成“X”的两条​​交叉线。它指示一种关闭交互或关闭通知的方式。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    Sen. Elizabeth Warren tweeted Sunday about Jeff Bezos&#39;s recent space flight, saying that if he can afford to go to space he can afford to pay more in taxes.\n &#34;The richest guy on Earth can launch himself into space while over half the country lives paycheck to paycheck, nearly 43 million are saddled with student debt, and child care costs force millions out of work,&#34; Warren tweeted. &#34;He can afford to pitch in so everyone else gets a chance.&#34;\n Jeff Bezos, the founder and former CEO of Amazon, paid $0 in federal income taxes for at least two years between 2006 and 2018,  ProPublica reported in June. The  bombshell report also revealed Tesla CEO Elon Musk did the same thing in 2018.\n      Insider&#39;s Lynnley Browning  reported in 2019 that Amazon also paid $0 in income taxes in 2017 and 2018.\n   Bezos is currently listed by  Forbes as the richest person in the world, with a net worth of $209.2 billion.\n The billionaire&#39;s space exploration company Blue Origin  successfully completed its first passenger space flight on Tuesday, launching Bezos and three others into space for about three minutes of weightlessness.\n Warren had also  taken a jab at Bezos over the flight last week, writing on Twitter: &#34;Jeff Bezos forgot to thank all the hardworking Americans who actually paid taxes to keep this country running while he and Amazon paid nothing.&#34;\n    Sign up for notifications from Insider! Stay up to date with what you want to know.\n            Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-07-26 10:03:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,space", "title": "伊丽莎白沃伦：如果杰夫贝索斯可以上太空，他可以缴纳更多的税。 “地球上最富有的人可以将自己送入太空，而超过一半的国家则靠薪水过日子”", "title_en": "Elizabeth Warren: If Jeff Bezos Can Go to Space, He Can Pay More Taxes. 'The richest guy on Earth can launch himself into space while over half the country lives paycheck to paycheck'", "transed": 1, "url": "https://www.businessinsider.com/elizabeth-warren-jeff-bezos-can-go-to-space-while-paycheck-2021-7", "via": "", "real_tags": ["太空", "space"]}, {"category": "", "categoryclass": "", "imagename": "513657c8e762c7c2ce15fd4835c1a623.jpg", "infoid": 1069755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 的移动网络浏览器是今年 iOS 15 测试版的主要避雷针，它是否会在秋季真正推出还有待观察。多年前，Android 版 Chrome 尝试在 iOS 15 重新设计上使用类似的 Safari，该项目的设计师提供了一些有趣的见解，说明 Google 放弃它的原因。 iOS 15 上的 Safari 具有 Apple 所谓的“新标签栏设计”，其中地址字段和其他关键操作放置在屏幕底部的条带中，就在系统手势栏的上方。该公司表示，它“最大化了您的屏幕空间，并在您滚动和探索时不受干扰。”它位于一个非常容易到达的位置，允许您通过滑动在打开的标签之间跳转。最终，Apple 相信它是“为我们今天的浏览方式重新设计的”，但在过去的几个测试版中一直在对其进行调整。谷歌在 2016 年尝试通过名为“Chrome Home”的努力进行这样的重新设计。 克里斯李 - 谷歌的前员工交互设计师在“原始概念和宣传”背后 - 在他的个人网站上谈到了这个项目，称其为“雄心勃勃的”重新设计了移动 Chrome 的主用户界面。”在高层次上：它将 Chrome 的工具栏带到屏幕底部，并将 [它] 变成一个可以滑动以显示其他控件的窥视面板。多功能框移动到下方，旁边是选项卡切换器和溢出菜单。向上滑动，正如地址字段上方的拉片所暗示的那样，向用户显示具有四个部分的传统底部栏。第一个用于发现和最近的站点、下载、书签和历史记录。\n与当今 iOS 15 上的 Safari 一样，这种 Chrome 设计基于不断增长的屏幕尺寸以及创建“仍然可以用一只手使用”的界面的愿望。另一个原因是 Chrome 有很多功能只是放在“三点”溢出菜单中，因为没有其他地方可以显示它们，从而损害了可发现性。 Lee 说 Home “在内部受到了关注，最终成为 Chrome 组织的优先事项。”在原型设计、现场 Beta 实验/标志和测试之后，该团队“听到了各种各样的反应”。 “主流用户”表示重新设计“让人迷失方向”，尽管“该功能在技术社区中获得了狂热追随者”。 Chrome 为全球数十亿具有不同技术素养的用户提供服务。我越来越相信，推出 Chrome Home 并不能很好地为我们所有的用户服务。因此，就像我提出的最初概念一样[强烈]，我主张我们停止发布——这进行了不小的辩论。谷歌和这位设计师的外卖是关于“在大规模产品中进行创新所需的意图”。 2018 年 2 月，谷歌表示将“结束当前的 Chrome Home 实验”。今天的帖子终于解释了原因。然而，“Chrome Duplex”——后来更名为“Duet”——的工作几乎立即开始。这个“拆分工具栏”变体看到多功能框保留在屏幕顶部，但看到谷歌将标签切换器、溢出菜单和其他各种快捷方式带到底部的条上。该项目也在 2020 年年中被放弃，这表明谷歌仍然不适应大幅改变 Chrome 的用户界面。\n您正在阅读 9to5Google — 日复一日地发布有关 Google 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Google 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Apple’s mobile web browser is the main lightning rod of this year’s iOS 15 beta period and it remains to be seen whether it will actually launch in the fall. Chrome for Android tried a similar Safari on iOS 15 redesign years ago, and a designer on that project provided some interesting insight into why Google abandoned it.\n  Safari on iOS 15 has what Apple calls a “new tab bar design” where the address field and other key actions are placed in a strip at the bottom of the screen, just above the system gesture bar.\n The company says it “maximizes your screen space and stays out of the way as you scroll and explore.” It’s in a very reachable position and allows you to jump between open tabs by swiping.\n Ultimately, Apple believes it is “reimagined for the way we browse today,” but has been  tweaking it over the past few betas.\n   Google attempted such a redesign with an effort called “Chrome Home” in 2016. Chris Lee — a former staff interaction designer at Google behind the “original concept and pitch” —  talked about the project on his personal site, describing it as an “ambitious redesign of mobile Chrome’s main UI.” At a high level:\n It brought Chrome’s toolbar to the bottom of the screen and turned [it] into a peeking panel that could be swiped to expose additional controls.\n The Omnibox is moved below with the tab switcher and overflow menu right beside it. A swipe up, as hinted by a pull tab above the address field, shows users a traditional bottom bar with four sections. The first is for Discover and recent sites, Downloads, Bookmarks, and History.\n   Like Safari on iOS 15 today, this Chrome design was based on the growing screen sizes and the desire to create an interface that “would still be usable with one hand.” Another reason was how Chrome has a lot of features that are just placed in the “three dot” overflow menu because there’s nowhere else to surface them, thus hurting discoverability.\n Lee says Home “caught traction internally, eventually becoming a Chrome org priority.” After prototyping, live beta experiments/flags, and testing, the team “heard a mixture of reactions.”\n “Mainstream users” said the redesign “felt disorienting,” though the “feature gained a cult following among the tech community.”\n Chrome serves billions of users around the globe with varying tech literacy. I became increasingly convinced that launching Chrome Home would not serve all our users well.\n So just [as strongly] as I had pitched the original concept, I advocated for us to stop the launch – which took not a small amount of debate.\n Google and this designer’s takeaway was about the “intentionality needed to innovate within a product of massive scale.” In  February 2018, Google said it was “ending the current Chrome Home experiment.” Today’s post finally provides an explanation why.\n However, work on “Chrome Duplex” —  later renamed “Duet” — started almost immediately. This “ split toolbar” variant saw the Omnibox remain at the top of the screen, but saw Google bring the tab switcher, overflow menu, and various other shortcuts to a strip at the bottom. This project was  also abandoned by mid-2020 in a sign that Google was still not comfortable with drastically changing Chrome’s UI.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-07-26 09:54:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,google,ios,谷歌,设计", "title": "前谷歌员工讲述了谷歌如何放弃在 Android 上重新设计 Chrome 的尝试，这类似于 iOS 15 的 Safari，底部有 URL 栏", "title_en": "Ex-Google employee recounts how Google abandoned a redesign attempt of Chrome on Android, that was similar to iOS 15's Safari, with the URL bar at the bottom", "transed": 1, "url": "https://9to5google.com/2021/07/25/google-chrome-safari-ios-15/", "via": "", "real_tags": ["chrome", "google", "ios", "谷歌", "设计"]}, {"category": "", "categoryclass": "", "imagename": "2fc5a4fa0ae24f12ac9a09ef338e0b2c.png", "infoid": 1069753, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一年多以前，在我们两个数据中心之间的安全传输过程中，SSD 被盗。我们立即提出投诉并警告可能受影响的客户。出乎意料的是，最近，一位 YouTuber 准备了一个关于数据擦除及其格式化后持久性的主题，在分类网站上购买了这款 SSD 驱动器。由于我们客户数据的安全是重中之重，我们很快与这位 YouTuber 合作恢复了 SSD，他以书面形式向我们保证不再有副本。这一事件也使当前警方的调查取得了重大进展，这也使我们无法就此问题进行进一步沟通。针对此事件，我们对媒体传输流程进行了全面审核。对这种运输的加强控制已经到位。例如，现在可以在配备 GPS 跟踪器的加固箱中确保存储设备的运输。我们在多个标准（ISO 27001、HDS）的框架内对我们的基础设施进行定期审计，并继续朝这个方向投资。为了尽可能有效地保护您的数据，Scaleway 会随着市场标准不断发展。幸运的是，此事件并未损害我们客户的业务活动。另一方面，网络犯罪是一个真正的祸害，我们都应该以专业精神和谨慎态度与之抗争。该新闻经常引发主要参与者之间发生的重大事件，这些事件危及数百万人的个人数据，有时甚至是数十亿人的个人数据，或破坏商业活动。最后但并非最不重要的一点是，这一事件揭示了 Scaleway 团队在安全方面所做的工作。在间接参与的 300 多名员工中，有 12 名员工不知疲倦地工作，以抵御日常袭击，主要来自外部和域外。最应该向这些合作者致敬，因为在每一件事的背后，都有成千上万的人因为他们的辛勤工作而没有发生。", "note_en": "Il y a plus d’un an, nous avons fait l’objet du vol d’un SSD lors d’un transport sécurisé entre deux de nos datacenters. Nous avons sans délai porté plainte et prévenu la clientèle potentiellement impactée.  Rebondissement insoupçonné, très récemment, un Youtubeur, préparant un sujet sur l’effacement des données et de leur persistance après un formatage, a acheté sur un site de petites annonces ce disque SSD.  Puisque la sécurité des données de nos clients est une priorité absolue, nous avons rapidement collaboré avec ce Youtubeur pour récupérer le SSD et il nous a assuré par écrit qu’il n’existait plus de copie.  Cet événement a également permis une avancée significative de l’enquête de police en cours, qui par ailleurs, nous empêche de pouvoir communiquer davantage à ce sujet.  En réponse à cet incident, nous avons effectué un audit complet de nos processus de transport de médias. Un contrôle renforcé de ces transports a été mis en place. Par exemple, le transport de matériel de stockage est dorénavant assuré dans des mallettes durcies équipées de traceurs GPS.  Nous effectuons des audits réguliers de nos infrastructures dans le cadre de plusieurs normes (ISO 27001, HDS) et continuons à investir dans ce sens. Pour protéger vos données le plus efficacement possible, Scaleway évolue en permanence avec les standards du marché.  Fort heureusement, cet incident n’a pas endommagé l’activité commerciale de nos clients. En revanche, la cybercriminalité est un réel fléau que nous nous devons tous de combattre, avec professionnalisme et discrétion. L’actualité évoque régulièrement des incidents majeurs chez des grands acteurs qui compromettent les données personnelles de millions, parfois de milliards de particuliers, ou alors anéantissent des activités commerciales.  Enfin et surtout, cet incident permet de mettre en lumière le travail qu’effectuent les équipes de Scaleway au niveau de la sécurité. Parmi plus de 300 collaborateurs indirectement impliqués, une douzaine travaillent sans relâche pour repousser les attaques quotidiennes, majoritairement de l’extérieur et d’origines extra-territoriales. Ce sont ces collaborateurs qu’il convient avant toute chose de saluer, car derrière chaque incident se cachent des milliers d’autres qui ne surviennent pas grâce à leur travail acharné.", "posttime": "2021-07-26 09:54:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "传输,incident,数据", "title": "Scaleway：事件 SSD 在数据中心之间的安全传输过程中被盗", "title_en": "Scaleway: Incident SSD was stolen during a secure transport between datacenters", "transed": 1, "url": "https://blog.scaleway.com/incident-securitaire-video-youtube/", "via": "", "real_tags": ["传输", "incident", "数据"]}, {"category": "", "categoryclass": "", "imagename": "c51bc6b2582198fb3edc198c7747f4b5.jpg", "infoid": 1069752, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "那里！我说过，我认为番茄工作法很烂。它让学习感觉像是一件苦差事，并消除了我们可以给我们的大脑做任何任务的最大动力——进入……", "note_en": "There! I said it, I think Pomodoro s*cks. It makes studying feel like a chore and takes out the biggest incentive we can give our brain with any task - enter...", "posttime": "2021-07-26 09:53:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "番茄,pomodoro,感觉", "title": "番茄钟很烂。试试 Flowtime", "title_en": "Pomodoro Sucks. Try Flowtime", "transed": 1, "url": "https://www.youtube.com/watch?v=NgnZ_4iwExU", "via": "", "real_tags": ["番茄", "pomodoro", "感觉"]}, {"category": "", "categoryclass": "", "imagename": "2a1de059d6212cfbb608c9cd2830b5e7.jpg", "infoid": 1069751, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Olumide Soyombo 是尼日利亚科技初创公司和整个非洲知名的活跃天使投资人之一。自 2014 年开始天使投资以来，Soyombo 已经投资了 33 家初创公司，包括 Stripe 旗下的 Paystack、PiggyVest 和 TeamApt。今天，投资者宣布推出他与 [...] 共同创立的泛非风险投资公司 Voltron Capital。", "note_en": "Olumide Soyombo is one of the well-known active angel investors in Nigeria tech startups and Africa at large. Since he began angel investing in 2014, Soyombo has invested in 33 startups, including Stripe-owned Paystack, PiggyVest, and TeamApt. Today, the investor is announcing the launch of Voltron Capital, a Pan-African venture capital firm he co-founded with […]", "posttime": "2021-07-26 09:15:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "非洲,天使,high", "title": "尼日利亚一位备受瞩目的天使投资人正在为非洲初创公司设立基金", "title_en": "\n\t\t\t\tOne of Nigeria’s high profile angel investors is launching a fund for African startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/one-of-nigerias-high-profile-angel-investors-is-launching-a-fund-for-african-startups/", "via": "", "real_tags": ["非洲", "天使", "high"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069750, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "漫游英国的山区一直是我生活的重要组成部分。你不会感到惊讶，在我开始长途跋涉之前，我喜欢粗略地知道我让自己进去做什么。其中一部分是估计我将走多远。几十年前，我的同学兼登山朋友大卫告诉我一种快速而简单的方法来估算步行的长度。它使用印在英国山地步行者使用的军械测量地图上的平方公里网格。要估计步行的长度，请计算路线穿过的网格线的数量，然后除以 2。这使您可以估算步行的长度（以英里为单位）。是的，英里，即使网格线以千米为间隔。在右侧，您可以看到一个虚构的示例。该路线跨越 22 条网格线，因此我们估计其长度为 11 英里。这个规则实际上有用吗？显然，步行时间越长，路线可能穿过的网格线就越多，因此计算网格线肯定会给我们提供步行时间的某种度量。但是，这种措施有多好，为什么当网格线相距一公里时我们会得到以英里为单位的估计？我调查了所涉及的数学，这里是头条新闻。它们适用于典型摆动的步行；这条规则对于坚定不移地遵循一个罗盘方位的步行来说是不可靠的。平均而言，估计距离接近实际距离：从长远来看，该规则高估了步行距离 2.4%。\n当然，每次走路都有一些随机变化。对于大约 10 英里的步行，大约三分之二的时间步行的估计长度将在实际距离的 7% 以内。 2.4% 的长期高估是很小的：在 10 英里的步行中，它仅相当于四分之一英里。可变性更严重：大约三分之一的时间估计会超过 7%。但是其他不可估量的因素（例如地面的性质或迷路）对完成步行所需的精力或时间的影响会比这更大，所以我认为这没什么大不了的。总而言之，对于一个如此快速且易于使用的规则，这条规则对我来说已经足够了。这也一样，因为我在过去 35 年里毫无疑问地使用它。 George-Louis Leclerc, Comte de Buffon, (1707-1788) 是一位法国知识分子，对山地徒步没有任何兴趣。但他确实考虑了以下问题，即布冯的针：假设我们有一个由平行木条制成的地板，每条木条的宽度相同，我们将一根针放在地板上。针穿过两条带之间的一条线的概率是多少？让我们稍微重新提出这个问题并问：如果线条相距 1 个单位，并且我们多次放下针，那么被放下的针穿过的平均线数是多少？事实证明，其中 l 是针的长度。现在添加另一组直角线（好像地板是由方形块而不是条带制成的）。落针穿过的平均线数加倍为\n你能看出与距离估计规则的联系吗？地板上的裂缝变成了网格线，针变成了走道的一段。步行的直线段平均每公里长度将穿过网格线。现在一英里是 1.609 公里，所以步行的一段平均每英里将穿过网格线，非常接近每英里 2 条网格线，正如我们的规则所假设的那样。如果一英里是公里（1.570…公里），我们平均每英里正好有 2 条网格线。因此，使用公里网格为我们提供了以英里为单位的近距离距离测量这一事实只是祝您好运。这是因为一英里非常接近公里。在以后的文章中，我将进一步探讨数学。我们将看到上述结果的来源，并更详细地了解步行到步行的可变性。我们还将看到为什么适用于直线的结果也适用于曲线（如步行），并且在这样做时会发现布冯伯爵不仅有针，他还有面条。", "note_en": "Wandering the mountains of the UK has been a big part of my life. You won’t be surprised that before I start a long walk I like to know roughly what I’m letting myself in for. One part of this is estimating how far I’ll be walking.\n Several decades ago my fellow student and hillwalking friend David told me of a quick and simple way to estimate the length of a walk. It uses the grid of kilometre squares that is printed on the Ordnance Survey maps that UK hillwalkers use.\n To estimate the length of the walk, count the number of grid lines that the route crosses, and divide by two. This gives you an estimate of the length of the walk in miles.\n Yes,  miles, even though the grid lines are spaced at kilometre intervals. On the right you can see a made-up example. The route crosses 22 grid lines, so we estimate its length as 11 miles.\n Is this rule practically useful? Clearly, the longer a walk, the more grid lines the route is likely to cross, so counting grid lines will definitely give us  some kind of measure of how long the walk is. But how good is this measure, and why do we get an estimate in miles when the grid lines are a kilometre apart?\n I’ve investigated the maths involved, and here are the headlines. They are valid for walks of typical wiggliness; the rule isn’t reliable for a walk that unswervingly follows a single compass bearing.\n On average, the estimated distance is close to the actual distance: in the long run the rule overestimates the lengths of walks by 2.4%.\n There is, of course, some random variation from walk to walk. For walks of about 10 miles, about two-thirds of the time the estimated length of the walk will be within 7% of the actual distance.\n The long-run overestimation of 2.4% is tiny: it amounts to only a quarter-mile in a 10-mile walk. The variability is more serious: about a third of the time the estimate will be more than 7% out. But other imponderables (such as the nature of the ground, or getting lost) will have a bigger effect than this on the effort or time needed to complete a walk, so I don’t think it’s a big deal.\n In conclusion, for a rule that is so quick and easy to use, this rule is good enough for me. Which is just as well, because I’ve been using it unquestioningly for the past 35 years.\n   George-Louis Leclerc, Comte de Buffon,  (1707-1788) was a French intellectual with no recorded interest in hillwalking. But he did consider the following problem, known as  Buffon’s Needle:\n Suppose we have a floor made of parallel strips of wood, each the same width, and we drop a needle onto the floor. What is the probability that the needle will lie across a line between two strips?\n Let’s recast that question a little and ask: if the lines are spaced 1 unit apart, and we drop the needle many times, what’s the average number of lines crossed by the dropped needle? It turns out that it is\n  where  l is the length of the needle. Now add another set of lines at right angles (as if the floor were made of square blocks rather than strips). The average number of lines crossed by the dropped needle doubles to\n  Can you see the connection with the distance-estimating rule? The cracks in the floor become the grid lines, and the needle becomes a segment of the walk. A straight segment of a walk will cross, on average,   grid lines per kilometre of its length. Now a mile is 1.609 kilometres, so a segment of the walk will, on average, cross   grid lines per mile, which is very close to 2 grid lines per mile, as our rule assumes. If a mile were   km (1.570… km), we’d average exactly 2 grid lines per mile.\n So the fact that using a kilometre grid gives us a close measure of distance in miles is just good luck. It’s because a mile is very close to   kilometres.\n In a future post, I’ll explore the maths further. We’ll see where the results above come from, and look in more detail at walk-to-walk variability. We’ll also see why results that apply to straight lines also apply to curved lines (like walks), and in doing so discover that not only did the Comte de Buffon have a needle, he also had a noodle.", "posttime": "2021-07-26 09:07:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,love,步行", "title": "Hillwalkers应该喜欢Comte de Buffon", "title_en": "Hillwalkers should love the Comte de Buffon", "transed": 1, "url": "http://bencraven.org.uk/2020/08/05/why-hillwalkers-should-love-the-comte-de-buffon/", "via": "", "real_tags": ["应该", "love", "步行"]}, {"category": "", "categoryclass": "", "imagename": "a9f648df22e7fbca99ff537458fada4e.png", "infoid": 1069749, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CXXGraph 是一个小型库，只有头文件，用于管理 Graph 及其在 C++ 中的算法。换句话说，一个“综合 C++ 图形库”。 Graph Dijkstras Shortest Path Algorithm(Dijkstra&#39;s Shortest Path) Dijkstra&#39;s Algorithm 用于查找图中从源节点到所有其他可达节点的最短路径。该算法最初假设所有节点都无法从给定的源节点到达，因此我们将所有节点的距离标记为无穷大。（无穷大）到源节点（INF / 无穷大表示无法到达）。当边权重是小整数（以参数 C 为界）时，利用这一事实的专用队列可用于加速 Dijkstra 算法。这种类型的第一个算法是 Dial 算法（Dial 1969），用于具有正整数边权重的图，它使用桶队列来获得运行时间 O(|E|+|V|C)。（来源维基百科）Buckets 0， 1, 2,..wV 依次检查，直到找到第一个非空桶。根据定义，包含在第一个非空桶中的每个节点都具有最小距离标签。在扫描过程中，这些具有最小距离标签的节点被永久标记并从桶中删除。当顶点的距离标签发生变化时，临时标记的顶点在桶中的位置会相应更新。重复该过程，直到所有顶点都被永久标记（或所有顶点的距离最终确定）。\n(Breadth First Search) Breadth First Search Algorithm(广度优先搜索) 广度优先搜索，也引作BFS，是一种Graph Traversal Algorithm。时间复杂度 O(|V| + |E|) 其中 V 是顶点的数量，E 是图中的边的数量。广度优先搜索的应用是： 寻找两个顶点之间的最短路径，比如 u 和 v，有路径以边数衡量的长度（优于深度优先搜索算法） (Depth First Search) 深度优先搜索算法 (Depth First Search) 深度优先搜索，也引用为 DFS，是一种图遍历算法。时间复杂度 O(|V| + |E|) 其中 V 为顶点数，E 为图中边数。 -first search (DFS) 查找指向当前顶点的祖先的边（它包含后边）。 DFS 跳过的所有后边缘都是循环的一部分。在无向图中，节点的父节点的边不应该算作后边，但找到任何其他已经访问过的顶点将表示后边。在无向图的情况下，只需要 O(n) 时间就可以在 n 顶点图中找到一个循环，因为最多 n - 1 条边可以是树边。许多拓扑排序算法也会检测循环，因为这些是拓扑顺序存在的障碍。此外，如果有向图已被划分为强连通分量，则环仅存在于分量内而不存在于它们之间，因为环是强连通的。对于有向图，可以使用基于分布式消息的算法。这些算法依赖于这样一个想法，即一个顶点在一个循环中发送的消息将返回到自身。分布式循环检测算法对于在计算机集群（或超级计算机）上使用分布式图处理系统处理大规模图很有用。循环检测的应用包括使用等待图来检测并发系统中的死锁。\n顶点切割分区将图的边划分为相等大小的分区。保存边端点的顶点也与边本身放在同一分区中。但是，顶点在分区之间不是唯一的，并且可能必须复制（剪切），因为它们的边分布在不同的分区上。复制因子量化了与原始输入图的顶点数量相比，在计算机上复制的顶点数量。该算法是循环方式的简单顶点切割。它采用原始图边并将它们分配给分区，将其划分为相等（或相似）大小。该算法不考虑顶点复制（复制因子）中的优化，而只平衡分区中的边。所需的最低 C++ 标准是 C++17 和大于 7.3.0 的 G++ 编译器版本。库的使用很简单，把头文件放到需要的地方就行了！ git clone https://github.com/google/googletest.gitcd googletest # 克隆仓库的主目录.mkdir build # 创建一个目录来保存构建 output.cd buildcmake .. # 为 GoogleTest.makesudo make 生成原生构建脚本install # 默认安装在/usr/local/ Benchmark 需要大于3.9 的CMake 版本以及google test 和google benchmark 库。\n# 查看库。$ git clone https://github.com/google/benchmark.git# Benchmark 需要 Google Test 作为依赖项。将源代码树添加为子目录。$ git clone https://github.com/google/googletest.git benchmark/googletest# 转到库根目录$ cd benchmark# 创建一个构建目录以放置构建输出。$ cmake -E make_directory &quot;build&quot;# 使用 cmake 生成构建系统文件。$ cmake -E chdir &quot;build&quot; cmake -DCMAKE_BUILD_TYPE=Release ../# 或者，从 CMake 3.13 开始，使用更简单的形式：# cmake -DCMAKE_BUILD_TYPE=Release - 。 -B &quot;build&quot;#构建库$ cmake --build &quot;build&quot; --config Release# install library$ sudo cmake --build &quot;build&quot; --config Release --target install 编译完成后，可以运行位于“build”目录下的名为“test_exe”的可执行文件，带有简单的命令 ./test_exe。如果您想提供支持，您可以创建拉取请求或报告问题。如果您想更改代码、修复问题或实施新功能，请阅读我们的贡献指南我们正在寻找开发人员和提交者，也是首先经验，我们将一步步引导您走向开源世界！如果您有兴趣，请通过 zigrazor@gmail.com 与我们联系或为此项目做出贡献。我们正在等你！", "note_en": "CXXGraph is a small library, header only, that manages the Graph and it&#39;s algorithms in  C++. In other words a &#34;Comprehensive C++ Graph Library&#34;.\n   Graph Dijkstras Shortest Path Algorithm(Dijkstra&#39;s Shortest Path) Dijkstra&#39;s Algorithm is used to find the shortest path from a source node to all other reachable nodes in the graph. The algorithm initially assumes all the nodes are unreachable from the given source node so we mark the distances of all nodes as infinity.(infinity) from source node (INF / infinity denotes unable to reach).\n   When edge weights are small integers (bounded by a parameter  C), specialized queues which take advantage of this fact can be used to speed up Dijkstra&#39;s algorithm. The first algorithm of this type was Dial&#39;s algorithm (Dial 1969) for graphs with positive integer edge weights, which uses a bucket queue to obtain a running time O(|E|+|V|C).( source wikipedia)\n  Buckets 0, 1, 2,..wV are checked sequentially until the first non-empty bucket is found. Each node contained in the first non-empty bucket has the minimum distance label by definition.\n One by one, these nodes with minimum distance label are permanently labeled and deleted from the bucket during the scanning process.\n  The position of a temporarily labeled vertex in the buckets is updated accordingly when the distance label of a vertex changes.\n Process repeated until all vertices are permanently labeled (or distances of all vertices are finalized).\n   (Breadth First Search) Breadth First Search Algorithm(Breadth First Search) Breadth First Search, also quoted as  BFS, is a Graph Traversal Algorithm. Time Complexity O(|V| + |E|) where V are the number of vertices and E are the number of edges in the graph.Applications of Breadth First Search are :\n Finding shortest path between two vertices say u and v, with path length measured by number of edges (an advantage over depth first search algorithm)\n   (Depth First Search) Depth First Search Algorithm (Depth First Search) Depth First Search, also quoted as  DFS, is a Graph Traversal Algorithm. Time Complexity O(|V| + |E|) where V is number of vertices and E is number of edges in graph.Application of Depth First Search are:\n     The existence of a cycle in directed and undirected graphs can be determined by whether depth-first search (DFS) finds an edge that points to an ancestor of the current vertex (it contains a back edge). All the back edges which DFS skips over are part of cycles. In an undirected graph, the edge to the parent of a node should not be counted as a back edge, but finding any other already visited vertex will indicate a back edge. In the case of undirected graphs, only O(n) time is required to find a cycle in an n-vertex graph, since at most n − 1 edges can be tree edges.\n Many topological sorting algorithms will detect cycles too, since those are obstacles for topological order to exist. Also, if a directed graph has been divided into strongly connected components, cycles only exist within the components and not between them, since cycles are strongly connected.\n For directed graphs, distributed message based algorithms can be used. These algorithms rely on the idea that a message sent by a vertex in a cycle will come back to itself. Distributed cycle detection algorithms are useful for processing large-scale graphs using a distributed graph processing system on a computer cluster (or supercomputer).\n Applications of cycle detection include the use of wait-for graphs to detect deadlocks in concurrent systems.\n    A vertex-cut partitioning divides edges of a graph into equal size partitions. The vertices that hold the endpoints of an edge are also placed in the same partition as the edge itself. However, the vertices are not unique across partitions and might have to be replicated (cut), due to the distribution of their edge across different partitions.\n Replication factor quantifies how many vertexes are replicated over computers compared with the the number of vertexes of the original input graph.\n  This Algorithm is a simple vertex-cut in Round-Robin fashion.It takes the original graph edges and assign them to the partitions, dividing it in equal(or similar) size. This algorithm does not take care of optimization in vertex replication ( Replication Factor) but only balance the edge in the partitions.\n    The minimun C++ standard required is  C++17 and a G++ compiler version greater than 7.3.0.\n  The use of the library is very simple,  just put the header file where you need!\n     git clone https://github.com/google/googletest.gitcd googletest # Main directory of the cloned repository.mkdir build # Create a directory to hold the build output.cd buildcmake .. # Generate native build scripts for GoogleTest.makesudo make install # Install in /usr/local/ by default\n  The Benchmark required the CMake version greater than 3.9 and the  google test and the  google benchmark library.\n   # Check out the library.$ git clone https://github.com/google/benchmark.git# Benchmark requires Google Test as a dependency. Add the source tree as a subdirectory.$ git clone https://github.com/google/googletest.git benchmark/googletest# Go to the library root directory$ cd benchmark# Make a build directory to place the build output.$ cmake -E make_directory &#34;build&#34;# Generate build system files with cmake.$ cmake -E chdir &#34;build&#34; cmake -DCMAKE_BUILD_TYPE=Release ../# or, starting with CMake 3.13, use a simpler form:# cmake -DCMAKE_BUILD_TYPE=Release -S . -B &#34;build&#34;# Build the library.$ cmake --build &#34;build&#34; --config Release# install library$ sudo cmake --build &#34;build&#34; --config Release --target install\n      After the compilation, you can run the executable that is under the &#34;build&#34; directory with the name &#34;test_exe&#34;, with the simple command  ./test_exe.\n    If you want give your support you can create a   pull request    or report an   issue   .If you want to change the code, or fix issue, or implement a new feature please read our  CONTRIBUTING Guide\n                 We are looking for developers and committer, also at  first experience, we will guide you step by step to the open-source world!If you are interested, please contact us at  zigrazor@gmail.com or contribute to this project. We are waiting for you!", "posttime": "2021-07-26 09:06:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithms,c++,graph,顶点", "title": "C++ 中的高级图算法", "title_en": "Advanced Graph Algorithms in C++", "transed": 1, "url": "https://github.com/ZigRazor/CXXGraph", "via": "", "real_tags": ["算法", "c++", "graph", "顶点"]}, {"category": "", "categoryclass": "", "imagename": "11c246f46cd3c3f0d0b5807e5581c410.jpg", "infoid": 1069747, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我创建了一个 repo 来抓取和分析在 leetcode 的补偿页面上发布的帖子。报告是根据截至 7 月 22 日收集的 1940 条记录生成的（来自薪酬页面上的 272 页）。", "note_en": "I created a repo to scrape and analyse the posts made on the compensations page of leetcode.\n Reports are generated from 1940 records collected till Jul 22 (from the 272 pages available on the compensations page).", "posttime": "2021-07-26 08:20:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "薪酬,compensation,抓取", "title": "Leetcode 薪酬报告（印度）2019 年 1 月 – 2021 年 7 月", "title_en": "Leetcode Compensation report (India) Jan 2019 – Jul 2021", "transed": 1, "url": "https://www.reddit.com/r/developersIndia/comments/ors1zd/leetcode_compensation_report_india_jan_2019_jul/", "via": "", "real_tags": ["薪酬", "抓取"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试完全数字访问，看看为什么有超过 100 万读者订阅了 FT 选择 购买 1 美元的试用订阅 4 周 试用期结束后，您将每月支付 91 美元 4 周内获得对 FT 值得信赖的奖励的无限制高级数字访问- 获奖商业新闻礼品文章 – 每月最多与家人、朋友和同事分享 10 篇文章", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-07-26 08:19:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宽带,broadband,订阅", "title": "光纤宽带“淘金热”：英国的替代网络能否成功？", "title_en": "Fibre broadband ‘gold rush’: can the UK’s alt-nets pull it off?", "transed": 1, "url": "https://www.ft.com/content/0af3b0ea-a803-4b23-be18-a47717c095eb", "via": "", "real_tags": ["宽带", "broadband", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "55b07d20cf1174d0261ff81787f094a1.jpg", "infoid": 1069745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每 5 分钟，AEMO 将在全国电力市场 (NEM) 内调度发电机以满足需求。为了实现这一点，AEMO 需要预测未来 5 分钟内的需求情况。目前，AEMO 使用恰好一周前的 6 个调度间隔中的需求变化，以及当前调度间隔之前的 5 个调度间隔。这些计算的结果是 9 个值，代表了需求随时间的变化。然后将这 9 个值输入到称为神经网络的机器学习算法中。我已经在下面绘制了这个网络的结构，但您真正需要担心的是输入层（采用上面讨论的 9 个值）和预测需求变化的输出层。如果您对这个神经网络究竟如何接受这些输入并能够输出预测感兴趣，我已经在这里用 Python 从头开始​​实现了它。最后，我认为这份探索替代预测建模技术的报告非常值得一读。", "note_en": "Every 5 minutes, AEMO will dispatch generators across the National Electricity Market (NEM) in order to meet demand. To achieve this, AEMO needs to predict what demand will look like 5 minutes in the future.\n   Currently, AEMO uses the change in demand in the 6 dispatch intervals exactly a week before, and the 5 dispatch intervals immediately preceding the current dispatch interval. The outcome of these calculations is 9 values representing the change in demand over time.\n  These 9 values are then fed into a machine learning algorithm called a neural network. I’ve drawn the structure of this network below, but all you really need to worry about is the input layer (that takes the 9 values discussed above) and the output layer that predicts the change in demand.\n  If you’re interested in exactly how this neural network takes these inputs and is able to output a prediction, I’ve  implemented it here from scratch in Python.\n Finally, I think this  report exploring alternative predictive modelling techniques is well worth a read.", "posttime": "2021-07-26 08:19:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "预测,predict", "title": "AEMO 如何预测全国电力市场的需求？", "title_en": "How does AEMO predict demand in the National Electricity Market?", "transed": 1, "url": "https://jacksimpson.co/how-does-aemo-predict-demand-in-the-national-electricity-market/", "via": "", "real_tags": ["预测", "predict"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的论文是 Facebook 的 Tectonic Filesystem: Efficiency from Exascale from FaST &#39;21。这篇论文涵盖了 Facebook 的 Tectonic 文件系统、它的实现以及他们做出的各种设计决策。我将总结这篇论文，并深入探讨其中的一些亮点。虽然文件系统论文和系统有着丰富的历史，但阅读这篇 Tectonic 论文还是很不错的，因为许多经常被引用的论文已经有点长了。谷歌文件系统 (2003) 论文已有近 20 年的历史，但在野外被引用的次数超过了 Bill Murray。 1 还有一些更现代的论文，主要来自 Microsoft，如 Windows Azure Storage (2011) 和 Azure Data Lake Store (2017)，但很高兴看到来自不同公司的一些东西。 Tectonic 使用胖客户端架构，支持直接从磁盘到客户端的数据流，并使用分片元数据服务为文件系统提供服务。 Tectonic 将元数据层分成三个部分：(1) 名称层，(2) 文件层，和 (3) 块层。每个层负责一部分元数据，并且所有层都作为无状态微服务实现在 ZippyDB 之上，ZippyDB 是一个水平可扩展的键值存储。由于元数据层是完全独立的，每个层都可以独立缩放以处理其负载。 Name 层提供目录树抽象，将目录映射到它们包含的文件和目录。文件层从文件映射到它们的组成块。块是对连续字节串的抽象，隐藏了它们的存储或编码方式。文件只是块的有序列表。在 Tectonic 中，块使用复制编码，其中 \\(N\\) 个相同的块每个存储块的完整副本，或者使用 Reed-Solomon 编码，其中块被编码为 \\(X\\) 数据块和 \\(Y\\ ) 代码/奇偶校验块。块层包含从块到其编码及其组块集的映射。 Tectonic 的最后一部分是 Chunk Store，它是它自己的分布式数据存储，其中节点存储原始字节块和一些最小元数据，以从块 id 映射到存储在本地、修改过的 XFS 文件系统上的字节。 Name 层、File 层和 Block 层的模式在论文中的这张表中：\nName 层维护从目录到子目录和其中包含的文件的映射，并由目录的 dir_id 分片。 File 层从文件映射到其逻辑块列表，并由 file_id 分片。 Block 层从块映射到存储它的块/磁盘列表，并由 blk_id 分片。块层还维护从每个磁盘到存储在其上的块列表的映射。这种反向映射对于维护很有用，例如，当磁盘丢失时，这种映射允许后台维护任务准确枚举哪些块需要向上复制或以其他方式重建。 ZippyDB 将键组合成分片，并保证具有相同分片 id 的所有键值对都放置在同一个分片中。这意味着由 dir_id 分片的 Tectonic 的 Name 层可以从单个分片快速提供一个目录中所有子目录和文件的强一致性列表，而它的 File 层，由 file_id 分片，可以为所有的列表做同样的事情。文件块。但是，不能保证子目录与父目录位于同一分片上，并且 ZippyDB 不提供任何跨分片事务，因此不支持大多数递归文件系统操作。 Tectonic 的 ZippyDB 模式还将列表存储为（键，值）对的完全“扩展”组合。也就是说，对于包含子目录 bar 和 quux 的目录 foo，Tectonic 存储两个单独的键 (foo, bar) 和 (foo, quux)，并使用前缀键扫描 foo, 处理目录 foo 的列表请求。这种扩展的列表格式用于降低向已经拥有数百万个文件的大型目录添加或删除单个条目的成本，因为 Tectonic 不必反序列化、编辑、序列化和写回一百万个条目列表。 Tectonic 具有单写入器、仅追加语义——这意味着 Tectonic 禁止多个并发写入器写入一个文件，并且文件只能追加到。为确保单写入器语义，每当客户端打开文件时，它都会获得一个写入令牌，该令牌与文件一起存储在元数据层中。每当客户端希望写入文件时，它必须包含写入令牌，并且只有最新的写入令牌才被允许改变文件元数据并写入其块。当控制路径通过元数据层和 ZippyDB 时，数据路径直接从客户端到块存储节点。这减少了整个系统所需的网络带宽，以及在网络上移动字节所需的计算。 Tectonic 的胖客户端对其读取和写入具有非常细粒度的控制，因为它直接进入块存储节点来读取和写入单个块。这允许客户端针对不同的工作负载进行调整，例如，是否优化写入的持久性或延迟。与可能在整个文件系统中强制执行单个配置的其他系统相反，Tectonic 客户端还可以针对每个文件甚至每个块调整这些参数。 Tectonic 使用常见的仲裁提交或仲裁写入技术来优化客户端执行全块写入 - 只需要客户端持久地写入块的所有块副本中的大多数以提交块。举例来说，对于具有 3 个副本的 \\(R(3.2)\\) 复制文件 2 Tectonic 只需要客户端在考虑提交的块之前完成对其中 2 个副本块的写入——这有助于尾延迟 3。如果最后的第三个副本块写入失败，Tectonic 的后台维护服务将通过修复第 3 个块副本来修复块。\n除了这种常见的优化之外，Tectonic 还使用了一种称为 Reservation Requests 的巧妙技术来优化全块写入，这类似于 The Tail At Scale 中讨论的对冲请求。为了激发预留请求，我们将首先绕道而行，看看对冲请求、它们的优点和缺点，以及为什么预留请求可能更适合 Tectonic 的用例。对冲请求是一种延迟优化，您可以将请求发送到可能的多台服务器，并接受来自最快服务器的第一个响应，而不是为一项工作发送单个请求。不只是重复大量工作的关键是，不是立即将请求发送到多个服务器，而是等待一点，其中“一点”意味着您期望正常请求需要多长时间。如果回复仍未到达，那么您“对冲”您的赌注，即该服务器将在合理的时间范围内响应并将相同的请求发送到另一个副本。对冲请求有助于改善长尾延迟，因为您可以避免客户端在取得任何进展之前必须等待可能不健康的节点响应其请求的情况。然而，对冲请求的一个问题是，它们可能会导致接收服务器完成的工作量激增，以及额外请求和响应所需的额外带宽——这是存储系统所关心的像构造。此外，Tectonic 客户端不能真的只是选择另一个随机存储节点来写入他们的数据，他们必须与元数据层协调，以便元数据准确反映哪些节点存储哪些块。相反，Tectonic 使用保留请求，这些请求很小，类似于 ping 请求，客户端发送到多个块存储节点来决定将其数据实际写入哪些节点。 Tectonic 选择最先响应的块存储节点作为进行实际写入的节点，假设可以快速响应的节点当前没有过载。预留请求不携带任何用于实际写入的数据，因此它们使用的带宽非常少，并且处理成本非常低。例如，如果客户端正在写入 \\(R(3.2)\\) 复制文件，则客户端将首先向 5 个块存储节点发送预留请求。客户端选择最先响应的 3 个存储节点来实际发送 3 个写入请求。通过这种方式，数据仍然只广播到 3 个节点，但是首先通过预留请求进行的快速健康检查减少了客户端等待不健康或卡住的节点的可能性，从而减少了尾部延迟。预留请求不使用任何额外的带宽或处理，但与对冲请求相比确实有缺点。由于全块写入必须首先执行这些预留请求，因此它们会为每个写入增加一点延迟。这就是为什么预留请求仅用于全块写入，在这种情况下，写入的数据量足够大，这种延迟开销是可以接受的更好的尾部延迟的折衷。我假设预留请求在实践中运行良好，但我感兴趣的是预留请求提供的健康检查和负载平衡信号必须是多近的，以避免最糟糕的尾部延迟。我可以想象一个使用较少检查频率的系统可能仍然能够提供预订请求的大部分好处，同时还减少了完成的工作量。\nTectonic 还通过仲裁追加来优化小于块大小的追加，类似于完整块写入。优化有助于减少尾部延迟，但对于部分块追加而不是完整块写入，仲裁提交要正确实现有点棘手。如果您正在编写一个完整的块，那么您不必担心并发写入器争相写入同一个块，但是对于较小的写入，这可能是一个问题。为了说明可能发生的可能错误，请考虑一个 \\(R(3.2)\\) 文件，该文件的块大小为 8MB，多个客户端附加到单个块。客户端A追加512字节，成功提交追加到第一个和第二个块，但写入第三个块副本失败。然后客户端 B 控制文件并附加另外 512 个字节，但第二个块副本失败，第一个和第三个成功。最后，客户端 C 控制了文件并附加了另外 512 个字节，但是第一个块写入失败，而第二个和第三个成功。剩下的第一个块副本长度为 1024 字节（第一和第二次追加），第二个副本长度为 1024 字节（第一和第三次追加），第三个副本长度为 1024 字节（第二和第三次追加）。读者会看到文件元数据报告的块长度为 1536 字节，但实际数据块都不是那个长度！并且没有一个块包含相同的数据！并且不清楚在完成这些写入时读者可能会阅读什么！或者，如果所有的块都以相同的数据结束！或者，如果这篇博文中的其余句子将以感叹号结尾！ 4 Tectonic 处理这些潜在问题的方式是强制执行两条规则：(1) 只允许创建块的客户端附加到它，以及 (2) 客户端向元数据层提交新的块长度和校验和之前确认仲裁附加到应用程序。虽然论文没有明确说明这一点，但我认为单个客户端会将其追加序列化到给定的块存储节点——也就是说，如果它执行第一次追加和第二次追加，它将等待第一次追加到在将第二个 append 写入存储节点之前成功。通过客户端完成这种序列化，并强制只有一个客户端可以写入块，我们上面的竞争不会发生，因为客户端将在写入第二个追加之前等待第一个追加发生在块存储节点上。这可以确保多个作者不会互相踩踏。在每个仲裁追加之后提交块长度和校验和，但在向应用程序确认之前向读者保证他们可以读取的内容。这意味着应用程序应该具有写后读一致性，因为 Tectonic 向应用程序确认的任何数据都已持久提交到两个块存储节点，并将新长度提交到元数据层。一般来说，这意味着如果 Tectonic 报告的块长度为 \\(B\\) 字节，那么至少 \\(B\\) 字节已经被提交到两个块存储节点，并且任何客户端都可以读取到 \\(B\\)字节，并保证它们是正确的。许多工作负载是“一次写入，很少读取”，这意味着数据应该进行 Reed-Solomon 编码而不是复制以减少存储开销。但是，数据通常以交互方式写入，并且写入延迟对客户端很重要，因此使用复制编码来减少尾部延迟 5 是有意义的。利用复制写入改进的延迟，同时还具有提高了 Reed-Solomon 编码的字节效率。\n通过让客户端以复制编码写入块，Tectonic 可以吃蛋糕，也可以吃它，但是一旦块已满并密封，客户端将在后台将块重新编码为 Reed-Solomon。通过我们讨论的所有优化，应用程序通过这种方式获得了复制写入的改进延迟，但 Reed-Solomon 存储的空间效率。从论文中不清楚如果客户端应用程序崩溃会发生什么，但我假设有一个后台服务可以将完全写入的块重新编码为 Reed-Solomon。 Tectonic 使用副本集复制来最大程度地减少在遇到协调磁盘故障时数据丢失的可能性。 Copyset 复制真的很聪明，但我们将不得不稍微备份一下，以讨论在尝试将数据放置到磁盘上时存在的困难问题和权衡。在选择将数据写入哪些磁盘时，在磁盘可能出现故障的情况下，需要在数据丢失的可能性与每个数据丢失事件丢失的数据量之间进行权衡。例如，如果对于所有 \\(R(3.2)\\) 复制文件，您将每个块副本写入随机选择的磁盘，则任何 3 个磁盘故障将导致某些复制文件的数据丢失事件的可能性越来越大。这是因为对于每个块，我们随机选择一组 3 个磁盘来存储其块，并且随着我们向系统添加更多块，最终每组 3 个磁盘将存储某个块的所有块副本。这意味着对于随机磁盘选择，当我们由于数据中心故障而丢失磁盘时，发生数据丢失事件的概率最高。然而，每个数据丢失事件丢失的数据量非常低，因为一个块的块副本恰好位于一组失败的磁盘上的可能性很小，因为它们是随机选择的。一种思考方式是，如果 3 个磁盘发生故障，则丢失块的预期值较低，但至少丢失一个块的概率很高。但是，您可以想象另一种方法，将所有节点分成 3 个节点的集合，称为副本集。当我们想将一个块的块分配给存储节点时，我们首先为该块选择一个副本集，然后将块副本分配给该副本集的 3 个节点。在具有 9 个节点的数据中心中，节点 \\([1,2,3]\\) 可能是一个副本集，\\([4,5,6]\\) 将是另一个副本集，而 \\([7,8,9]\\ ) 将是最后一个。在该方案中，只有3个三节点故障会导致数据丢失，即只有一个副本集的所有节点丢失才会导致一个块的数据丢失。这是一个非常低概率的事件，因为在可能的 \\({9 \\choose 3} = 84\\) 个三节点集合中只有 3 个集合会导致数据丢失。相比之下，随机节点复制最终会使所有 84 个三节点集成为某个块的副本集，因此副本集复制比随机复制提高了 28 倍，以降低数据丢失的概率。但请记住，对于副本集复制，每个数据丢失事件丢失的数据量会非常高——分配给副本集的所有块都将丢失。虽然丢失所有数据可能不是正确的权衡，但我们可能会在每个事件丢失更多数据的情况下进行权衡，以减少任何数据丢失事件的可能性。这是因为任何数量的数据丢失都会导致大量固定的数据恢复工作开销，作为运营商，我们真的希望尽可能避免它。这是我们寻找更好的方式将块分配到磁盘的动机。\n除了影响数据丢失的概率之外，我们如何将块分配给节点也会影响我们假设的解决方案必须处理的系统的其他属性。在我们的 naive 3 copyset 设置中，如果节点 1 发生故障，我们只能从节点 2 和 3 恢复该数据，这可能会将这些节点上的负载增加 50%。对于随机磁盘选择设置，如果一个节点出现故障，我们可以从所有剩余节点恢复数据，因为数据已均匀分布在所有 84 个副本集上。因此，随机磁盘选择在提供潜在恢复工作的良好负载平衡方面具有优势。然而，如果我们打破严格的副本集设置，并允许一个节点上的数据潜在地复制到更多的其他节点，那么我们可以更快地从单个节点故障中恢复，并且不会在所有节点上施加太多负载。剩余节点。让我们将存储单个节点数据副本的节点数称为散点宽度。在上面 9 个节点和 3 个副本集的示例中，我们的分散宽度为 2，因为只有 2 个其他节点拥有任何其他节点数据的副本——节点 1 的数据也在节点 2 和节点 3 上。但是，如果我们引入了 3 \\([1,4,7]\\)、\\([2,5,8]\\) 和 \\([3,6,9]\\) 的更多副本集然后现在节点 1 上的数据可以在任一节点 2、3、4 或 7，因此分散宽度现在为 4——允许我们更快地从节点故障中恢复。总而言之，我们希望拥有较高的分散宽度以确保我们可以从大量节点恢复数据，但我们也希望将副本集的数量保持在较低水平以降低发生数据丢失事件的可能性。想出一个方案来做这两件事是一个不平凡的问题。 Copysets 论文为这个问题提供了一个近乎最优的解决方案，称为复制集复制，旨在创建给定散布宽度的少数副本集。换句话说，副本集复制降低了数据丢失事件的可能性，同时仍然允许节点之间的良好负载平衡。这篇论文解释了他们的算法如何是最优的，但核心思想是你创建系统中所有节点的排列，然后通过将排列组合成连续节点的运行来从排列中形成副本集。您可以通过创建更多排列来增加分散宽度，但这将创建更多副本集，因为额外的排列将具有不同的节点改组，从而导致不同和更多的副本集。但关键是副本集数量的这种增加将尽可能小，从而使数据丢失事件的概率尽可能低。当客户端需要写入块时，首先随机选择一个节点作为主节点，这将副本集集限制为每个排列一个。您可以选择一个随机排列及其副本集，或者在 Tectonic 的情况下，块层从对应于该块 ID 的排列中选择副本集，以排列数为模，以使其具有确定性。\n虽然相对于副本集方案初始放置是最佳的，但磁盘仍然会出现故障或被取出进行维护，因此后台重新平衡器服务也尝试将块的块保留在其原始副本集中。 Copyset 复制和 Tectonic&#39; ......", "note_en": "Today’s paper is  Facebook’s Tectonic Filesystem: Efficiency from Exascale from  FaST ‘21. The paper covers the Tectonic Filesystem at Facebook, its implementation, and various design decisions they made. I’ll summarize the paper and do a deeper dive on some of its highlights.\n While there is a rich history of filesystem papers and systems, it’s nice to read this Tectonic paper, since many of the oft-quoted papers are getting a bit long in the tooth.  The Google File System (2003) paper is almost two decades old but is cited more than  Bill Murray in the wild.  1 There are some more modern papers, mostly from Microsoft like  Windows Azure Storage (2011) and  Azure Data Lake Store (2017), but it’s nice to see something from a different company.\n  Tectonic uses a thick-client architecture, to enable streaming of data directly from disks to the client, and a sharded metadata service to serve the filesystem. Tectonic shards out the metadata layer into three components: (1) Name layer, (2) File layer, and (3) Block layer. Each of the layers are responsible for a part of the metadata, and all of them are implemented as stateless microservices on top of  ZippyDB, a horizontally scalable key-value store. Since the metadata layers are completely separate, each layer can be independently scaled to handle its load.\n  The Name layer provides the directory tree abstraction, mapping directories to the files and directories they contain. The File layer maps from files to their constituent  blocks. Blocks are an abstraction for a contiguous string of bytes that hide how they are stored or encoded. A file is just an ordered list of blocks.\n In Tectonic, blocks use either replicated encoding, where \\(N\\) identical chunks each store a complete copy of the block, or use  Reed-Solomon encoding where the block is encoded into \\(X\\) data chunks and \\(Y\\) code/parity chunks. The Block layer contains the mapping from a block to its encoding and its set of chunks.\n The final piece of Tectonic is the  Chunk Store which is its own distributed data-store where nodes store the raw byte chunks and some minimal metadata to map from chunk id to the bytes stored on a local, modified  XFS filesystem.\n  The schemas of the Name layer, File layer, and Block layer are in this table from the paper:\n    The Name layer maintains the mapping from directory to the subdirectories and files contained within it, and is sharded by the directory’s  dir_id. The File layer maps from files to its list of logical blocks and is sharded by the  file_id. The Block layer maps from blocks to the list of chunks/disks that store it and is sharded by the  blk_id. The Block layer also maintains a mapping from every disk to the list of blocks that are stored on it. This reverse mapping is useful for maintenance, e.g., when a disk is lost this mapping allows background maintenance tasks to enumerate exactly which blocks need to be up-replicated or otherwise reconstructed.\n ZippyDB groups keys together into shards, and guarantees that all key, value pairs with the same sharding id, are placed into the same shard. This means that Tectonic’s Name layer, which shards by  dir_id, can quickly serve from a single shard a strongly consistent list of all subdirectories and files in a directory, and its File layer, sharded by  file_id, can do the same for the list of all blocks for a file. However there’s no guarantee that subdirectories are placed on the same shard as the parent directory, and ZippyDB does not provide any cross-shard transactions, so most recursive filesystem operations are not supported.\n Tectonic’s ZippyDB schema also stores lists as fully “expanded” combinations of (key,value) pairs. That is, for a directory  foo containing subdirectories  bar and  quux, Tectonic stores two separate keys  (foo, bar) and  (foo, quux), and handles list requests for directory  foo with a prefix-key scan of  foo,. This expanded list format is used to reduce the cost of adding or removing single entries to large directories that already have many millions of files, since Tectonic does not have to deserialize, edit, serialize, and write back a million entry list.\n  Tectonic has single-writer, append-only semantics – meaning Tectonic prohibits multiple concurrent writers to a file, and files can only be appended to. To ensure single-writer semantics, whenever a client opens a file it is given a write token that is stored with the file in the metadata layer. Any time a client wishes to write to the file, it must include the write token, and only the most up-to-date write token is allowed to mutate the file metadata and write to its chunks.\n  While the control path goes through the metadata layer and ZippyDB, the data path is direct from the client to the chunk storage nodes. This reduces the networking bandwidth required for the system as a whole, as well as the compute required to move the bytes over the network.\n Tectonic’s thick-client has very fine-grained control over its reads and writes, since it goes directly to the chunk storage nodes to read and write individual chunks. This allows the client to be tuned for different workloads, e.g., whether to optimize for durability or latency of writes. The Tectonic client can also tune these parameters per file, and even per block, as opposed to other systems that may enforce a single configuration across the entire filesystem.\n  Tectonic uses the common  quorum commit, or quorum write technique, to optimize clients doing full-block writes – only requiring a client to durably write to a majority of all chunk replicas of a block in order to commit the block. To illustrate, for a \\(R(3.2)\\) replicated file with 3 replicas  2 Tectonic will only require the client to finish writing to 2 of the replica chunks before considering the block committed – which helps tail latency  3. If the final 3rd replica chunk write fails, Tectonic’s background maintenance services will fix up the block by repairing the 3rd chunk replica.\n  In addition to this common optimization, Tectonic uses a neat technique called  Reservation Requests to optimize full-block writes, that are similar to hedged requests discussed in  The Tail At Scale. To motivate reservation requests, we’ll first take a little detour and look at hedged requests, their benefits and drawbacks, and why reservation requests might be more suitable for Tectonic’s use case.\n Hedged requests are a latency optimization where instead of sending a single request for a piece of work, you send the request to potentially multiple servers, and accept the first response from the fastest server. The key to not just duplicating a lot of work though is that instead of immediately sending the request to multiple servers, you wait for a bit, where “a bit” means how long you’d expect a normal request to take. If the reply still hasn’t arrived, then you “hedge” your bet that this server will respond in a reasonable timeframe and send the same request to another replica.\n    Hedged requests help improve long-tail latency, since you avoid the situation where the client has to wait for a possibly unhealthy node to respond to its request before making any progress. However, a problem with hedged requests is that they can create a blow-up in the amount of work done by the receiving servers, as well as the additional bandwidth you need for the extra requests and responses – which is of concern for a storage system like Tectonic. In addition, Tectonic clients can’t really just choose another random storage node to write their data to, they have to coordinate with the metadata layer so that the metadata accurately reflects which nodes store which chunks.\n Tectonic instead uses  reservation requests, which are small, ping-like, requests that a client sends to multiple chunk storage nodes to decide which nodes to actually write its data to. Tectonic chooses the chunk storage nodes that respond first as the nodes to do the actual writes to, with the hypothesis that nodes that can respond quickly are not currently overloaded. The reservation requests don’t carry any of the data for actual writing, so they use very little bandwidth, and the processing can be super cheap.\n For example, if a client was writing to a \\(R(3.2)\\) replicated file, the client would first send reservation requests to 5 chunk storage nodes.\n  The 3 storage nodes that respond first are chosen by the client to actually send the 3 write requests to. In this way, the data is still only broadcast to 3 nodes, but the quick health-checking done first via the reservation requests reduces the likelihood that the client will wait on an unhealthy or stuck node, thereby reducing tail latency.\n  Reservation requests don’t use any extra bandwidth or processing, but do have drawbacks compared to hedged requests. Since full-block writes have to first perform these reservation requests, they add a little bit of latency to each of the writes. This is why reservation requests are only used for full-block writes, where the amount of data being written is large enough that this latency overhead is an acceptable tradeoff for better tail latency. I would assume reservation requests work well in practice, but I’d be interested how recent the health-checking and load-balancing signal provided by reservation requests has to be to avoid the worst of the tail latency. I could imagine a system using less frequent checks might still be able to provide the majority of the benefit of reservation requests, while also reducing the amount of work done.\n  Tectonic also optimizes smaller than block-size appends via quorum append, similar to full block writes. The optimization helps reduce tail latency, but for partial block appends instead of full block writes, quorum commit is a wee bit trickier to implement correctly. If you’re writing a whole block, then you don’t have to worry about concurrent writers racing to write to the same block, but with smaller writes this can be a problem.\n To illustrate the possible bugs that can happen, consider a \\(R(3.2)\\) file with a 8MB block size and multiple clients appending to a single block. Client A appends 512 bytes, and successfully commits the append to the first and second chunks, but the write to the third chunk replica fails. Then Client B takes control of the file and appends another 512 bytes, but the 2nd chunk replica fails, and the 1st and 3rd succeed. Finally, client C takes control of the file and appends another 512 bytes, but the 1st chunk write fails, while the 2nd and 3rd succeed. You’re left with the 1st chunk replica at length 1024 bytes (1st &amp; 2nd appends), the 2nd replica at 1024 bytes (1st and 3rd appends), and the 3rd replica at 1024 bytes (2nd &amp; 3rd appends).\n  Readers would see file metadata reporting a block length of 1536 bytes, but none of the actual data chunks are that length! And none of the chunks contain the same data!  And it’s unclear exactly what readers might read while these writes are being done! Or if all the chunks will end up with the same data! Or if the rest of the sentences in this blog post will end in exclamation points!   4\n The way Tectonic deals with these potential problems is to enforce two rules: (1) Only allow the client that created a block to append to it, and (2) The client commits to the metadata layer the new block-length and checksum before acknowledging the quorum append to the application.\n Although the paper doesn’t spell this out explicitly, I presume that a single client will serialize its appends to a given chunk storage node – that is, if it’s performing a first append and a second append, it will wait for the first append to succeed before writing the second append to the storage node. With this serialization done by a client, and enforcing only a single client can write to a block, our race above cannot happen as the client will wait for the 1st append to happen to a chunk storage node, before writing the 2nd append. This makes sure that multiple writers won’t stomp over each other.\n  Committing the block-length and checksum after each quorum append, but before acknowledging to the application gives readers guarantees about what they can read. It means the application should have read-after-write consistency, since any data that’s been acknowledged by Tectonic to the application, has been durably committed to two chunk storage nodes and the new length committed to the metadata layer. In general, this means that if Tectonic reports a block length of \\(B\\) bytes, then at least \\(B\\) bytes have been comitted to two chunk storage nodes, and any client can read up to \\(B\\) bytes and be guaranteed they’re correct.\n  Many workloads are “write once, read rarely” which would imply that the data should be Reed-Solomon encoded rather than replicated to reduce the storage overhead. However, the data is often written interactively, and the write latency is important to the client so it makes sense to use replicated encoding to reduce tail latency  5. It would be nice to take advantage of the improved latency of replicated writes while also having the improved byte efficiency of Reed-Solomon encoding.\n Tectonic is able to have its cake and eat it too by having the client write the block in a replicated encoding, but then once the block is full and sealed, the client will re-encode the block to Reed-Solomon in the background. This way the application gets the improved latency of replicated writes, with all the optimizations we discussed, but the space-efficiency of Reed-Solomon storage. It’s unclear from the paper what happens if the client application crashes, but I assume there is a background service that can re-encode fully written blocks to Reed-Solomon.\n  Tectonic uses   copyset replication to minimize its probability of data loss in the face of coordinated disk failures. Copyset replication is really smart, but we’ll have to back up a bit to discuss the difficult problems and tradeoffs that exist when trying to place data onto disks.\n When choosing which disks to write data to, in a world where disks can fail, there is a tradeoff between the likelihood of data loss and how much data is lost per data loss event. For example, if for all \\(R(3.2)\\) replicated files, you write each chunk replica to a randomly selected disk, it becomes increasingly likely that any 3 disk failures will result in a data loss event for some replicated file. This is because for every block, we choose a random set of 3 disks to store its chunks on, and as we add more blocks to the system, eventually every set of 3 disks will store all the chunk replicas for  some block.\n This means that for random disk selection, when we lose disks due to failures in the datacenter, we have the highest probability of a data loss event. However, the  amount of data lost per data loss event is very low, because of the low probability that a block will have its chunk replicas on exactly the set of disks that fail since they were chosen randomly. One way to think about this is that if 3 disks fail then the  expected value of blocks lost is low, but the probability that at least one block will be lost is high.\n However you could imagine another approach where all the nodes are separated into sets of 3 nodes, called a  copyset. When we want to assign chunks of a block to storage nodes, we first choose a copyset for the block, and then the chunk replicas are assigned to the 3 nodes of the copyset. In a datacenter with 9 nodes, nodes \\([1,2,3]\\) might be one copyset, \\([4,5,6]\\) would be another, and \\([7,8,9]\\) would be the last.\n  In this scheme, there are only 3 three-node failures that would cause data loss, i.e., only a loss of all the nodes of a copyset would cause data loss for a block. This is a very low probability event given that only 3 sets out of a possible \\({9 \\choose 3} = 84\\) three-node sets cause data loss. In comparison, random node replication will eventually make all 84 three-node sets a copyset for  some block, so copyset replication is a 28x improvement over random replication for reducing the probability of data loss. Remember though, that for copyset replication the amount of data lost per data loss event would be quite high –  all of the blocks assigned to the copyset would be lost.\n  While losing all of the data is probably not the right trade off, we’d probably trade off a little bit more data lost per event in order to reduce the likelihood of any data loss event. This is because any amount of data loss incurs such a large fixed overhead of work to recover data that as operators we’d really prefer to avoid it as much as possible. This is our motivation for finding a better way of allocating chunks to disks.\n Besides affecting the probability of data loss, how we assign chunks to nodes also affect other properties of the system that our hypothetical solution will have to deal with. In our naive 3 copyset setup, if node 1 failed, we could only recover that data from node 2 and 3, which could potentially increase the load on those nodes by 50%. For the random disk selection setup, if a node fails we can recover the data from all of the remaining nodes, since the data has been spread uniformly across all 84 copysets. So the random disk selection has the edge here in providing good load-balancing of potential recovery work.\n  However if we broke with our strict copyset setup, and allowed the data on a node to potentially be replicated to a larger number of other nodes, then we could recover from a single node failure faster, and not put as much load on all of the remaining nodes.\n Let’s call the number of nodes that store copies for a single node’s data our  scatter width. In our example above of 9 nodes, and 3 copysets, our scatter width is 2, as only 2 other nodes have copies of any other node’s data – node 1 has its data also on node 2 and node 3. However, if we introduced 3 more copysets of \\([1,4,7]\\), \\([2,5,8]\\), and \\([3,6,9]\\) then now the data on node 1 could be on either node 2, 3, 4, or 7, so the scatter width would be 4 now – allowing us to recover from node failures faster.\n  So to summarize, we’d like to have a high scatter width to ensure we can recover data from lots of nodes, but we also want to keep the number of copysets low in order to reduce the probability of a data loss event. Coming up with a scheme to do both of these things is a non-trivial problem.\n The  Copysets paper presents a near optimal solution to this problem called  copyset replication, that aims to create the fewset number of copysets given a scatter width. To put it another way, copyset replication reduces the probability of a data loss event while still allowing good load-balancing between nodes.\n The paper explains how their algorithm is optimal, but the core idea is that you create permutations of all nodes in the system, then form copysets from a permutation by chunking up the permutation into runs of consecutive nodes. You can increase scatter width by creating more permutations, but this will create more copysets since an additional permutation will have a different shuffling of nodes which results in different and more copysets. But the key is that this increase in the number of copysets will be as minimal as possible, keeping the probability of a data loss event as low as possible.\n  When a client needs to write a block, first a node is chosen randomly as the  primary, which constrains the set of copysets down to one per permutation. You could choose a random permutation and its copyset, or in Tectonic’s case the Block layer chooses the copyset from the permutation corresponding to that block ID modulo the number of permutations so that it’s deterministic.\n  While the initial placement is optimal with respect to the copyset scheme, disks will still fail or be taken out for maintenance, so the background rebalancer service also tries to keep a block’s chunks in its original copyset.\n Copyset replication, and Tectonic’\n......", "posttime": "2021-07-26 08:18:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,构造,tectonic,节点", "title": "Facebook 的构造文件系统：Exascale 的效率", "title_en": "Facebook's Tectonic Filesystem:Efficiency from Exascale", "transed": 1, "url": "https://paulcavallaro.com/blog/facebook-tectonic-filesystem/", "via": "", "real_tags": ["facebook", "构造", "tectonic", "节点"]}, {"category": "", "categoryclass": "", "imagename": "128366848b2d1f4a1cb3f28584ca70ab.png", "infoid": 1069742, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Wasp（Web 应用程序规范语言）是一种声明式 DSL（域特定语言），用于以更少的代码开发、构建和部署现代全栈 Web 应用程序。应用程序、页面、用户、登录、前端、生产等概念都融入到语言中，带来了新的表达水平，让您可以用更少的代码行完成更多的工作。在使用 Wasp 描述高级功能的同时，您仍然使用自己喜欢的技术（目前是 React、NodeJS、Prisma）编写其余逻辑。注意：Wasp 处于 alpha 阶段，因此可能会发生很大变化，存在错误并错过重要功能。 // file: main.wasp app TodoApp { title: &quot;Todo App&quot; } route &quot;/&quot; -&gt; page Main page Main { component: import Main from &quot;@ext/pages/Main.js&quot; // 导入 React 组件。 } query getTasks { fn: import { getTasks } from &quot;@ext/queries.js&quot; , // 导入 NodeJS 代码。实体：[任务]}实体任务{=psl id Int@id@default(autoincrement())描述字符串isDone布尔@default(false)psl=}源文件(.wasp,.js(x),.css,. ..) 由 waspc（Wasp 编译器）编译成您选择的 Web 技术堆栈（目前为 React + NodeJS/ExpressJS + Prisma）。快速入门：由于它的表现力，您可以使用很少的几行简洁、一致、声明性的代码从头开始创建和部署可用于生产的 Web 应用程序。\n灵活：当您需要比 Wasp 提供的更多控制时，您可以使用现有技术（例如 js/html/css/...）编写代码，并将其与 Wasp 代码结合使用！无锁定：如果 Wasp 对您来说限制太多，只需弹出并继续生成人类可读的源代码即可。在 OSX/Linux 上安装 Wasp。从那里，只需按照说明在不到一分钟的时间内运行您的第一个应用程序！这是 Wasp Universe 的主要存储库，包含核心代码（主要是 waspc - Wasp 编译器）和支持材料。目前，Wasp 处于 alpha 阶段并具有足够的功能，因此您可以在其中开发基本的 Web 应用程序！您可能会发现它在某些地方缺少灵活性或缺少一些更大的功能，但基础已经存在，我们现在正在添加在它们之上。万一你卡住了，你可以获取生成的代码并继续它。随着 Wasp 的进一步发展，它应该允许开发越来越复杂的 Web 应用程序，而无需弹出！虽然我们的想法是在未来支持多个 Web 技术堆栈，但现在我们专注于特定堆栈：React + react-query、NodeJS + ExpressJS、Prisma。随着时间的推移，考虑到趋势，我们可能会改变这一点，但就目前而言，这对于开发编译器和语言的目的来说非常有用。最好的起点是查看 waspc/，在那里你可以找到第一次贡献者的详细步骤 + 有关 Wasp 编译器的技术细节。\n即使您不打算提交任何代码，只要加入有关 discord 的讨论并提供您的反馈就已经很棒并且有很大帮助（激励我们并帮助我们弄清楚如何塑造 Wasp）！", "note_en": "Wasp ( Web  Application  Specification Language) is a declarative DSL (domain-specific language) for developing, building and deploying modern full-stack web apps with less code.\n Concepts such as  app,  page,  user,  login,  frontend,  production, etc. are baked into the language, bringing a new level of expressiveness and allowing you to get more work done with fewer lines of code.\n While describing high-level features with Wasp, you still write the rest of your logic in your favorite technologies (currently React, NodeJS, Prisma).\n NOTE: Wasp is in alpha and is therefore likely to change a lot, have bugs and miss important features.\n // file: main.wasp app  TodoApp  {  title:  &#34;Todo App&#34; } route   &#34;/&#34;  - &gt;  page  Main page  Main  { component:  import  Main  from  &#34;@ext/pages/Main.js&#34;  // Importing React component. } query  getTasks  { fn:  import  {  getTasks  }  from  &#34;@ext/queries.js&#34; ,  // Importing NodeJS code. entities:  [ Task ] } entity  Task  { = psl  id  Int @ id @ default ( autoincrement ( ) )  description   String  isDone  Boolean @ default ( false ) psl = }\n Source files ( .wasp,  .js(x),  .css, ...) are compiled by  waspc (Wasp compiler) into the web technology stack of your choice (currently React + NodeJS/ExpressJS + Prisma).\n   Quick start: Due to its expressiveness, you can create and deploy a production-ready web app from scratch with very few lines of concise, consistent, declarative code.\n Flexible: When you need more control than Wasp offers, you can write code in existing technologies such as js/html/css/... and combine it with Wasp code!\n No lock-in: If Wasp becomes too limiting for you, simply eject and continue with the generated source code, which is human-readable.\n     to install Wasp on OSX/Linux. From there, just follow the instructions to run your first app in less then a minute!\n   This is the main repo of the Wasp universe, containing core code (mostly  waspc - Wasp compiler) and the supporting materials.\n  Currently, Wasp is in alpha and has enough features so that you can develop a basic web app in it!You might find that it misses flexibility in some places or that some bigger features are missing, but the basics are there and we are now adding on top of them.In the case you get stuck, you can take the generated code and continue with it.As Wasp grows further, it should allow the development of web apps of increasing complexity, without the need to eject!\n While the idea is to support multiple web tech stacks in the future, right now we are focusing on the specific stack: React + react-query, NodeJS + ExpressJS, Prisma. We might yet change that as time goes, taking trends into account, but for now, this is serving us well for the purpose of developing compiler and language.\n   The best place to start is to check out  waspc/, where you can find detailed steps for the first time contributors + technical details about the Wasp compiler.\n Even if you don&#39;t plan to submit any code, just joining the discussion on discord    and giving your feedback is already great and helps a lot (motivates us and helps us figure out how to shape Wasp)!", "posttime": "2021-07-26 08:18:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,编程,programming,web,wasp", "title": "Wasp – 一种了解 Web 应用程序是什么的编程语言", "title_en": "Wasp – A programming language that understands what a web app is", "transed": 1, "url": "https://github.com/wasp-lang/wasp", "via": "", "real_tags": ["程序", "编程", "web", "wasp"]}]