[{"category": "", "categoryclass": "", "imagename": "41cd7f5530bcd148bbf64428cfd5c3c9.jpeg", "infoid": 1035362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我爱加州，但我不得不离开。我在弗里蒙特长大，就读于斯坦福大学，成年后的大部分时间都在旧金山湾区度过，创立了Palantir和Addesar等科技公司，并投资了许多其他公司。2011年，我创立了8VC，这是一家风险投资公司，如今管理着超过36亿美元的承诺资本。除了加州和几个全球金融中心，很少有顶级风险资本家考虑住在其他地方，但我和我的几十名8VC同事正在搬家……", "note_en": "I love California, but I had to leave. I grew up in Fremont, attended Stanford, and have spent most of my adult life in the San Francisco Bay Area, founding technology companies like Palantir and Addepar and investing in many others. In 2011 I founded 8VC, a venture-capital firm that today manages more than $3.6 billion in committed capital. Few top venture capitalists consider living anywhere other than California and a handful of global financial centers, but I am moving myself and dozens of my 8VC colleagues...", "posttime": "2020-11-16 10:31:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加利福尼亚,love", "title": "加利福尼亚，爱它就算了，别管它了", "title_en": "California, Love It and Leave It", "transed": 1, "url": "https://www.wsj.com/articles/california-love-it-and-leave-it-11605472619", "via": "", "real_tags": ["加利福尼亚", "love"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "登录失败。请检查您是否从列表中选择了正确的社团，并输入了用于登录您的社团网站的用户名和密码。\n一些社会期刊要求您创建个人简档，然后激活您的社会帐户。", "note_en": "Login failed. Please check you selected the correct society from the list and entered the user name and password you use to log in to your society website.\n   Some society journals require you to create a personal profile, then activate your society account", "posttime": "2020-11-16 10:11:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子游戏,设计,游戏,现状,state", "title": "电子游戏中无障碍设计的现状评价", "title_en": "Evaluating the State of Accessibility Design in Video Games", "transed": 1, "url": "https://journals.sagepub.com/doi/10.1177/1555412020971500", "via": "", "real_tags": ["电子游戏", "设计", "游戏", "现状", "state"]}, {"category": "", "categoryclass": "", "imagename": "27d82db34a2e73018981897478ec84f2.jpg", "infoid": 1035360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Bumble引以为豪的是，它是一款更具道德意识的约会应用。但它在保护9500万用户的私人数据方面做得足够吗？据《福布斯》杂志在其公开发布前进行的研究显示，在某些方面，情况并非如此。\n总部设在圣地亚哥的独立安全评估机构的研究人员发现，即使他们被禁止使用这项服务，他们也可以使用Bumble获取大量约会对象的信息。在本月早些时候修复漏洞之前，自研究人员提醒Bumble以来，这些漏洞已经开放了至少200天，他们可以获取每个Bumble用户的身份。如果一个账户连接到Facebook，就有可能检索到他们所有的“兴趣”或他们喜欢的页面。黑客还可以获取Bumble用户正在寻找的确切类型的人的信息，以及他们上传到该应用程序的所有照片。\n也许最令人担忧的是，如果黑客的总部设在同一座城市，就有可能通过查看用户的“英里距离”来获得用户的大致位置。然后攻击者可以伪造几个账户的位置，然后利用数学手段试图对目标的坐标进行三角定位。\n发现这些问题的ISE安全分析师桑贾纳·萨尔达(Sanjana Sarda)表示：“在针对特定用户时，这是微不足道的。”Sarda补充说，对于节俭的黑客来说，免费使用无限制投票和高级过滤等高级功能也是“微不足道的”。\n这一切都要归功于Bumble的API或应用编程接口的工作方式。可以将API看作是定义一个或一组应用程序如何从计算机访问数据的软件。在这种情况下，计算机是管理用户数据的Bumble服务器。\nSarda说，Bumble的API没有进行必要的检查，也没有允许她重复探测服务器以获取其他用户信息的限制。例如，她只需在之前的ID上加一个就可以列举出所有的用户ID号。即使在被锁在门外的时候，Sarda也能够继续从Bumble服务器中提取本应是私人数据的数据。所有这一切都是通过她所说的“简单的剧本”完成的。\n“这些问题相对容易利用，充分的测试可以将它们从生产中移除。”同样，修复这些问题应该相对容易，因为潜在的修复涉及服务器端请求验证和速率限制。\n萨达补充说，由于窃取所有用户的数据非常容易，可能会进行监控或转售这些信息，这突显出人们对苹果应用商店或谷歌Play市场上提供的大品牌和应用程序的信任可能是错误的。归根结底，这“对所有关心个人信息和隐私的人来说都是个大问题”。\n尽管花了大约六个月的时间，Bumble还是在本月早些时候解决了这些问题，一位发言人补充道：“Bumble与HackerOne及其漏洞赏金计划有着悠久的合作历史，这是我们整体网络安全实践的一部分，这是这种合作的又一个例子。”在收到该问题的警报后，我们开始了多阶段补救过程，其中包括在实施修复时实施控制措施以保护所有用户数据。与用户安全相关的基本问题已经解决，没有用户数据被泄露。“。\nSarda早在3月份就披露了这些问题。尽管自那以后，Bumble多次试图通过HackerOne漏洞披露网站获得回复，但Bumble一直没有提供回复。截至11月1日，Sarda表示，这些漏洞仍然存在于该应用程序中。然后，本月早些时候，Bumble开始修复这些问题。\nSarda早在3月份就披露了这些问题。据Sarda称，尽管此后多次试图在HackerOne漏洞披露网站上获得回应，但Bumble一直没有提供回应。但截至11月1日，Sarda表示，漏洞仍然存在于该应用程序上。然后，本月早些时候，Bumble开始修复这些问题。\n与之形成鲜明对比的是，今年夏天，Bumble的竞争对手Hinger与ISE研究员布兰登·奥尔蒂斯(Brendan Ortiz)密切合作，向Bumble旗下的约会应用提供了漏洞信息。根据Ortiz提供的时间表，该公司甚至提出让负责堵住软件漏洞的安全团队进入。这些问题在不到一个月的时间里就解决了。", "note_en": "Bumble prides itself on being one of the more ethically-minded dating apps. But is it doing enough to protect the private data of its 95 million users? In some ways, not so much, according to  research shown to  Forbes ahead of its public release.\n  Researchers at the San Diego-based Independent Security Evaluators discovered that even if they’d been banned from the service, they could acquire a wealth of information on daters using Bumble. Prior to the flaws being fixed earlier this month, having been open for at least 200 days since the researchers alerted Bumble, they could acquire the identities of every Bumble user. If an account was connected to Facebook, it was possible to retrieve all of their “interests” or pages they have liked. A hacker could also acquire information on the exact kind of person a Bumble user is looking for and all the pictures they uploaded to the app.\n  Perhaps most worryingly, if based in the same city as the hacker, it was possible to get a user’s rough location by looking at their “distance in miles.” An attacker could then spoof locations of a handful of accounts and then use maths to try to triangulate a target’s coordinates.\n    “This is trivial when targeting a specific user,” said Sanjana Sarda, a security analyst at ISE, who discovered the issues. For thrifty hackers, it was also “trivial” to access premium features like unlimited votes and advanced filtering for free, Sarda added.\n    This was all possible because of the way Bumble’s API or application programming interface worked. Think of an API as the software that defines how an app or set of apps can access data from a computer. In this case the computer is the Bumble server that manages user data.\n    Sarda said Bumble’s API didn’t do the necessary checks and didn’t have limits that allowed her to repeatedly probe the server for information on other users. For instance, she could enumerate all user ID numbers by simply adding one to the previous ID. Even when she was locked out, Sarda was able to continue drawing what should’ve been private data from Bumble servers. All this was done with what she says was a “simple script.”\n  “These issues are relatively simple to exploit, and sufficient testing would remove them from production. Likewise, fixing these issues should be relatively easy as potential fixes involve server-side request verification and rate-limiting,” Sarda said\n  As it was so easy to steal data on all users and potentially perform surveillance or resell the information, it highlights the perhaps misplaced trust people have in big brands and apps available through the Apple App Store or Google’s Play market, Sarda added. Ultimately, that’s a “huge issue for everyone who cares even remotely about personal information and privacy.”\n    Though it took some six months, Bumble fixed the problems earlier this month, with a spokesperson adding: “Bumble has had a long history of collaboration with HackerOne and its bug bounty program as part of our overall cyber security practice, and this is another example of that partnership. After being alerted to the issue we then began the multi-phase remediation process that included putting controls in place to protect all user data while the fix was being implemented. The underlying user security related issue has been resolved and there was no user data compromised.”\n  Sarda disclosed the problems back in March. Despite repeated attempts to get a response over the HackerOne vulnerability disclosure website since then, Bumble had not provided one. By November 1, Sarda said the vulnerabilities were still resident on the app. Then, earlier this month, Bumble began fixing the problems.\n  Sarda disclosed the problems back in March. Despite repeated attempts to get a response over the HackerOne vulnerability disclosure website since then, Bumble had not provided one, according to Sarda. By November 1, Sarda said the vulnerabilities were still resident on the app. Then, earlier this month, Bumble began fixing the problems.\n  As a stark comparison, Bumble rival Hinge worked closely with ISE researcher Brendan Ortiz when  he provided information on vulnerabilities to the Match-owned dating app over the summer. According to the timeline provided by Ortiz, the company even offered to provide access to the security teams tasked with plugging holes in the software. The problems were addressed in under a month.", "posttime": "2020-11-16 09:53:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,漏洞,bumble", "title": "研究人员：Bumble的漏洞暴露了约9500万Bumble用户的信息，其中包括一些人的Facebook数据，在接到修复该漏洞的通知后，花了200多天的时间", "title_en": "Researchers: flaws in Bumble exposed info of ~95M Bumble users, including Facebook data of some, and it took over 200 days after being notified to fix the bug", "transed": 1, "url": "https://www.forbes.com/sites/thomasbrewster/2020/11/15/bumble-vulnerabilities-put-facebook-likes-locations-and-pictures-of-95-million-daters-at-risk/", "via": "", "real_tags": ["facebook", "漏洞", "bumble"]}, {"category": "", "categoryclass": "", "imagename": "d3e23d24a57c76a018fbd6ee32757a46.gif", "infoid": 1035358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你好！我是OCaml的新用户。这篇文章的目的仅仅是分享我到目前为止在OCaml上的经验，并希望能引发一些关于其他社区用户如何看待和使用OCaml的随意对话。我希望从这篇文章中得到什么？批评，肯定，小贴士，什么都行。在大流行封锁期间，我在泡沫中独自学习了OCaml。我的经历是经典的OCaml学习经历，还是在某种程度上是独一无二的？我希望从其他社区成员那里获得反馈。..。", "note_en": "Greetings! I’m a new OCaml user. The intent of this post is simply to share my experience thus far in OCaml and hopefully generate some casual conversation about how other community users think about & use OCaml. What do I hope to get from this post? Critiques, affirmation, tips, whatever. I learned OCaml alone, in a bubble, during pandemic lockdown. Was my experience the classic OCaml learning experience, or was it unique in some way? I’m hoping to garner feedback from other community members. ...", "posttime": "2020-11-16 09:12:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,应用程序,completed,ocaml", "title": "对我在OCaml中完成的第一个应用程序的思考", "title_en": "Reflections on my first completed application in OCaml", "transed": 1, "url": "https://discuss.ocaml.org/t/reflections-on-my-first-completed-application-in-ocaml/6768", "via": "", "real_tags": ["程序", "应用程序", "completed", "ocaml"]}, {"category": "", "categoryclass": "", "imagename": "33293681e83de7ff50f954f70fcaf74c.jpeg", "infoid": 1035357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "越来越多的证据表明，与大流行相关的封锁和限制措施对年轻人造成的伤害比冠状病毒本身大得多。一份新的研究报告显示，近一半的18岁至24岁的人“至少表现出中度抑郁症状，对许多人来说，抑郁是严重的。”\n哈佛大学、东北大学、罗格斯大学和西北大学的研究人员从4月到10月在美国各州进行了八轮大规模调查，发现年轻人越来越多地有自杀念头。在整个美国成年人中，自杀念头的发生率通常徘徊在3.4%左右。但这项新研究显示，10月份，36.9%的年轻人有自杀念头，而在政府第一轮封锁之后的5月份，这一比例为32.2%。\n这些新数据强化了美国疾病控制与预防中心(CDC)8月份发布的同样令人沮丧的数据。疾控中心发现，在18-24岁的年轻人中，有四分之一的人在前一个月考虑过自杀，这在很大程度上是由于流行病和封锁。\n杰伊·巴塔查里亚博士说：实际上，我们一直在做的是要求年轻人承担起控制这种他们几乎没有风险的疾病的重担。\n根据这项新的研究，封锁和其他流行病政策已经彻底颠覆了大多数年轻人的生活。只有20%的研究参与者表示，自大流行开始以来，他们经历的变化很小。相反，刚刚超过一半的参与者表示，他们的学校或大学已经关闭，41%的人不得不适应在家工作，28%的人经历了减薪，26%的人下岗了。\n该报告的作者总结道：“下一届(总统)政府将领导一个空前数量的年轻人正在经历抑郁、焦虑，对一些人来说，还有自杀念头的国家。”“在我们的调查中，这些症状并不集中在任何特定的亚群或地区；在我们调查的每一个群体中，这些症状都有所增加。”\n斯坦福大学(Stanford University)医学教授杰伊·巴塔查里亚(Jay Bhattacharya)博士是倡导反对封锁的《大巴灵顿宣言》(Great Barrington宣言)的作者之一。他解释说，政府封锁对年轻人健康和福祉的负面影响要比病毒对这一人群的影响严重得多。\n在上周与哈佛大学流行病学家马克·利普西奇(Marc Lipsitch)的辩论中，巴塔查里亚博士承认，新冠肺炎“对老年人和患有某些慢性病的人来说，绝对是一种致命的疾病”。他解释说，70岁以上的人新冠肺炎的存活率为95%，而70岁以下的人目前的存活率为99.95%。\n“对于儿童来说，”巴塔查里亚博士在辩论中说，“流感更严重。”今年死于流感的儿童比死于柯维病的儿童还多。“。\n鉴于新冠肺炎对老年人和患有某些慢性病的人造成的不成比例的影响，巴塔查里亚博士和他的《大巴灵顿宣言》(Great Barrington宣言)的合著者主张采取一种“集中保护”的方式，保护社会中最脆弱的群体，同时允许更年轻、更健康的人继续自己的生活，帮助建立人群免疫力。\n巴塔查里亚博士在辩论中说，“封锁对国内外民众的身心健康都有绝对灾难性的影响。”“对于60岁或50岁以下的人来说，封锁造成的伤害--再一次是精神上和身体上的伤害--比COVID更严重。”\n随着美国越来越多的州和国家针对不断上升的新冠肺炎病例实施新的封锁，年轻人的心理健康状况可能会进一步恶化。由于工作、学校和大学停课，这些年轻人已经与许多同龄人断绝了联系，现在他们必须应对一些地区新的晚上10点宵禁和10人聚集的限制，餐馆和酒吧关闭，旅行限制，以及与社会疏远的假期。\n依靠政府的封锁来拯救一些生命，而忽视这些封锁对其他生命造成的伤害，是无济于事的，也是有害的。\n与此同时，大学生们因为庆祝足球队胜利而受到管理人员的羞辱，或者被同龄人告发社交活动。年轻人感到越来越焦虑和沮丧也就不足为奇了。\n正如巴塔查里亚博士上个月在讲话中所说：“实际上，我们一直在做的就是要求年轻人承担起控制这种他们几乎或根本没有风险的疾病的重担。”这与正确的做法完全背道而驰。“。\n许多主张结束封锁的人认识到了封锁的意想不到的后果，以及它们对个人和群体造成的伤害，这些伤害可能与病毒本身造成的伤害相当，甚至超过病毒本身造成的伤害。由于封锁、孤立和经济流离失所而导致的精神健康下降是这些政策的一个意想不到的后果，但还有其他一些后果。\n例如，世界银行(World Bank)10月份的报告称，到2021年，预计将有1.5亿人因应对大流行而陷入极端贫困，这将是20多年来全球贫困人口首次上升。\n管理流行病没有简单的答案，只有多种微妙的答案，只有自由社会，而不是自上而下的规划者才能发现。依靠政府的封锁来拯救一些生命，而忽视这些封锁对其他生命造成的伤害，是无济于事的，也是有害的。\n“令人不安的事实是，任何政策都不能拯救生命；它只能交换生命。好的政策会带来净的积极权衡。但在我们清醒地看待拯救生命的成本之前，我们不知道这种权衡是否为净积极。我们不可能做到这一点，除非我们停止‘如果它只拯救一条生命’的无稽之谈。“。\n随着疫情的继续，封锁年轻人和其他人的严重代价正变得令人痛心地变得清晰起来。", "note_en": "Mounting evidence shows that pandemic-related lockdowns and restrictions have inflicted much more harm on younger people than the coronavirus itself.  A new report reveals that nearly half of 18 to 24 year-olds are “showing at least moderate depressive symptoms,&#34; and for many the depression is severe.\n Researchers at Harvard, Northeastern, Rutgers, and Northwestern universities conducted eight large survey rounds across all US states from April through October, finding that young adults are increasingly having suicidal thoughts. In the US adult population as a whole, the incidence of suicidal ideation typically hovers around 3.4 percent. But this new study reveals that in October, 36.9 percent of young adults had suicidal thoughts, compared to 32.2 percent in May in the wake of the first round of government lockdowns.\n These new figures reinforce similarly dismal data released by the Centers for Disease Control and Prevention (CDC) in August. The CDC found that  one-quarter of young people ages 18-24 contemplated suicide in the previous month, in large part due to the pandemic and lockdowns.\n &#39;In effect, what we’ve been doing is requiring young people to bear the burden of controlling a disease from which they face little to no risk,&#39; said Dr. Jay Bhattacharya.\n According to the new study, lockdowns and other pandemic policies have drastically upended the lives of most young adults. Only 20 percent of study participants said that they experienced little change since the pandemic began. Instead, just over half of the participants said that their school or university had closed, while 41 percent had to adapt to working from home, 28 percent experienced a pay cut, and 26 percent were laid off.\n “The next [presidential] administration will lead a country where unprecedented numbers of younger individuals are experiencing depression, anxiety, and, for some, thoughts of suicide,” the report’s authors  conclude. “These symptoms are not concentrated among any particular subgroup or region in our survey; they are elevated in every group we examined.”\n  Dr.  Jay Bhattacharya, a professor of medicine at Stanford University and one of the authors of the  Great Barrington Declaration advocating against lockdowns, explains that the negative impact of government lockdowns on young people’s health and well-being is much more severe than the impact of the virus on this cohort.\n In a  debate last week with pro-lockdown Harvard epidemiologist, Marc Lipsitch, Dr. Bhattacharya acknowledged that COVID-19 “is an absolutely deadly disease for people who are older and for people who have certain chronic conditions.” He  explained that there is a 95 percent COVID-19 survival rate for people 70 and older, while for people who are under 70, there is currently a 99.95 percent survival rate.\n “For children,” said Dr. Bhattacharya in the debate, “the flu is worse. We’ve had more flu deaths of children this year than Covid deaths.”\n Given the disproportionate impact of COVID-19 on older people and those with certain chronic conditions, Dr. Bhattacharya and his Great Barrington Declaration  co-authors argue for a “Focused Protection” approach that would shield the most vulnerable in society while allowing younger, healthy people to go about their lives and help to build population immunity.\n “Lockdowns have absolutely catastrophic effects on physical and mental health of populations both domestically and internationally,” Dr. Bhattacharya said during the debate. “For people who are under 60 or 50 the lockdown harms—again mentally and physically—are worse than COVID.”\n  With more US states and countries now imposing  new lockdowns in response to rising COVID-19 cases, the mental health of young people is likely to further deteriorate. Already disconnected from many of their peers with work, school, and college shutdowns, these young people must now contend with new 10:00 pm curfews and 10-person gathering limits in  some areas, closed restaurants and bars, travel restrictions, and  socially distanced holidays.\n Relying on government lockdowns to save some lives while ignoring the ways in which these lockdowns do harm to other lives is unhelpful and damaging.\n Meanwhile, college students are being shamed by administrators for  celebrating their football team’s win or  snitched on by peers for socializing. It’s not surprising that young adults are feeling increasingly anxious and depressed.\n As Dr. Bhattacharya  said in remarks last month: “In effect, what we’ve been doing is requiring young people to bear the burden of controlling a disease from which they face little to no risk. This is entirely backward from the right approach.”\n  Many of those advocating an end to lockdowns recognize their unintended consequences and the harm they cause to individuals and groups that may match or exceed the harm caused by the virus itself. Declining mental health due to lockdowns, isolation, and economic displacement is one unintended consequence of these policies, but there are others as well.\n For example, the World Bank  reported in October that 150 million people are expected to be thrust into extreme poverty by 2021 as a result of the pandemic response, which would be the first rise in global poverty in more than 20 years.\n  There are no easy answers to managing a pandemic, just manifold subtle answers that only free societies, and not  top-down planners, can discover. Relying on government lockdowns to save some lives while ignoring the ways in which these lockdowns do harm to other lives is unhelpful and damaging.\n  “The uncomfortable truth is that no policy can save lives; it can only trade lives. Good policies result in a net positive tradeoff. But we have no idea whether the tradeoff is a net positive until we take a sober look at the cost of saving lives. And we can’t do that until we stop with the ‘if it saves just one life’ nonsense.”\n As the pandemic continues, the severe costs of lockdowns on young adults and others are becoming distressingly clear.", "posttime": "2020-11-16 09:12:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "年轻人,adults,封锁", "title": "近一半的年轻人在流行病中表现出抑郁的迹象", "title_en": "Nearly Half of Young Adults Showing Signs of Depression Amid Pandemic", "transed": 1, "url": "https://fee.org/articles/harvard-researchers-nearly-half-of-young-adults-showing-signs-of-depression-amid-pandemic", "via": "", "real_tags": ["年轻人", "adults", "封锁"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国联邦监管机构对这家美国最大的公用事业公司处以逾90万美元的罚款，原因是该公司在田纳西州一座核反应堆启动期间违反了程序，随后误导了调查人员。在田纳西河谷管理局(Tennessee Valley Authority)位于斯普林城的瓦茨巴尔(Watts Barr)核电站工作的两名经理和一名核电站操作员也被核管理委员会(Nuclear Regulatory Commission)发出违规通知。\n田纳西大学(University Of Tennessee)核安全研究所所长霍华德·霍尔(Howard Hall)表示，向田纳西州退伍军人管理局(TVA)发出的违规通知表明“管理存在系统性问题”。\n霍尔说：“作为一个一生都在这一领域工作的人，如果我收到这样一封信，我会感到震惊的。”\n在一份日期为11月6日的通知中，监管机构注意到事件发生时瓦茨酒吧存在“严重的安全文化问题”。他们还发现，“在检查和调查过程中，TVA的高级管理层和工作人员在与NRC的几次互动中，未能坦诚、清晰和诚实地沟通。”\n根据NRC的文件，2015年11月11日，瓦茨酒吧的一名值班经理指示控制室开始加热反应堆，尽管核电站通常的稳压系统(防止反应堆水变成蒸汽)已经停止使用。当试图用备用系统加热时，稳压器很快就开始注满水。随后，工作人员不得不“在适当的操作程序之外采取行动”，以降低水位。\n这一事件没有记录在核电站的日志上，管理人员后来在所发生的事情上误导了NRC调查人员。这位轮班经理告诉调查人员，一开始他对他们并不诚实，因为他担心自己说的任何话都会被反馈给管理层。根据这封信，这位轮班经理后来放弃了他的高级反应堆操作员的执照。\n核管理委员会认定，有几起违规行为是故意的，他们写道，管理者允许“生产和成本凌驾于安全之上”。\n曾与TVA、NRC以及忧思科学家联盟(Union Of Concerned Science)合作过的核工程师戴夫·洛赫鲍姆(Dave Lochbaum)表示：“问题不在于TVA处理初创公司的方式--我们离失去诺克斯维尔或类似的地方还有30分钟--而在于TVA的管理者误导或欺骗了NRC的调查人员。”\n田纳西河谷管理局(Tennessee Valley Authority)为东南部七个州的1000万人提供服务，11月6日的罚款是监管机构最近对该公用事业公司采取的几项行动之一。去年，NRC对TVA处以14.5万美元的罚款，原因是TVA提交了关于瓦茨酒吧备份系统的不完整和不准确的信息。同样在去年，TVA被勒令重新招聘，并向一名提出核安全担忧的举报人支付数千美元的欠薪和赔偿金。NRC表示，一名公用事业高管在那次解雇中发挥了重要作用，他被禁止在五年内从事任何需要NRC许可的活动。\n在11月6日的信中，NRC写道，TVA采取了行动来解决2015年违规行为的原因，但没有“阐明或记录广泛、全面和实质性的纠正行动”。\n然而，TVA首席执行官杰夫·莱什周五表示，NRC发现的问题是“过去的问题”。\n“当然，你必须把注意力集中在这件事上，确保你永远不会再看到那个鬼鬼祟祟的家伙回来。”但我非常有信心，这个组织，它今天的文化，不会表现出同样的行为，Lyash说。他说：“我对未来的安全文化感到非常满意。我现在很高兴这些章节都结束了。随着NRC发布审查报告，包括对他们的处罚，我们承担起责任，继续前行。“。\n我们的目标是为用户创造一个安全和吸引人的地方，让他们在兴趣和激情上建立联系。为了改善我们的社区体验，我们暂停了文章评论。", "note_en": "Federal regulators have fined the nation&#39;s largest public utility more than $900,000 for violating procedures during the startup of a Tennessee nuclear reactor and subsequently misleading investigators. Two managers and a plant operator who worked at the Tennessee Valley Authority&#39;s Watts Barr Nuclear Plant in Spring City were also issued violations by the Nuclear Regulatory Commission.\n Howard Hall, director of the University of Tennessee&#39;s Institute for Nuclear Security, said the notice of violation to TVA points to “a systemic problem in management.”\n “As someone who has worked in this field essentially my entire life, I would have been appalled to receive such a letter,&#34; Hall said.\n In a notice dated Nov. 6, regulators noted a “substantial safety culture issue” at Watts Bar at the time of the incident. They also found that “TVA senior management and staff failed to communicate with candor, clarity, and integrity during several interactions with the NRC during the course of the inspection and investigation.”\n  According to NRC documents, on Nov. 11, 2015, a shift manager at Watts Bar directed the control room to begin heating up a reactor even though the plant&#39;s usual pressurizer system, which keeps the reactor water from turning to steam, was out of service. When trying to heat up with an alternate system, the pressurizer rapidly began to fill with water. Staff then had to “take actions outside of proper operating procedures” to bring the water level down.\n The incident wasn&#39;t recorded in the plant&#39;s logbook and managers later misled NRC investigators about what had happened. The shift manager told investigators he wasn&#39;t truthful with them at first because he feared that whatever he said would be relayed back to management. The shift manager has since relinquished his senior reactor operator&#39;s license, according to the letter.\n The NRC determined that several of the violations were willful, writing that managers allowed “production and cost to override safety.&#34;\n  “The problem is not so much the way TVA handled the startup — it wasn&#39;t like we were 30 minutes away from losing Knoxville, or something like that — it&#39;s that TVA managers misled or lied to the NRC investigator,” said Dave Lochbaum, a nuclear engineer who has worked with both TVA and the NRC as well as the Union of Concerned Scientists.\n The Tennessee Valley Authority serves 10 million people in parts of seven southeastern states, and the Nov. 6 fine is one of several recent actions against the utility by regulators. Last year, the NRC fined TVA $145,000 for submitting incomplete and inaccurate information on a backup system at Watts Bar. Also last year, TVA was ordered to rehire and pay thousands of dollars in back pay and compensation to a whistleblower who raised concerns about nuclear safety. A utility executive who the NRC said played a significant role in that firing was banned from working in any activities that require licensing by the NRC for five years.\n In its Nov. 6 letter, the NRC wrote that TVA took actions to address the causes of the 2015 violations but did not “articulate or document broad, comprehensive and substantive corrective actions.”\n However, TVA CEO Jeff Lyash said Friday that the problems identified by the NRC are “problems of the past.&#34;\n “Certainly, you’ve got to keep a focus on it, make sure you never see that creep back in. But I’m very confident that the organization, its culture today, don’t exhibit those same behaviors,&#34; Lyash said. “I feel very good about the safety culture going forward. I’m just glad now to have those chapters closing. As the NRC issues their review, including their penalties, we take accountability and we move on.”\n Our goal is to create a safe and engaging place for users to connect over interests and passions. In order to improve our community experience, we are temporarily suspending article commenting.", "posttime": "2020-11-16 09:12:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "隐瞒事实,violations,tva", "title": "田纳西河谷管理局因违反核法规、隐瞒事实被罚款90万美元", "title_en": "Tennessee Valley Authority fined $900K for nuclear violations, coverup", "transed": 1, "url": "https://news.yahoo.com/federal-utility-fined-900k-nuclear-212434364.html", "via": "", "real_tags": ["隐瞒事实", "tva"]}, {"category": "", "categoryclass": "", "imagename": "1c3ffe73c9b5fffeb224fe262ebe040d.png", "infoid": 1035355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周二，马萨诸塞州的一项维修权法案以压倒性胜利获得通过。这项措施在投票中被称为“问题1”，它将迫使汽车制造商确保独立的维修店能够获得与制造商经营的维修店相同的诊断工具。这将改变马萨诸塞州的汽车维修格局，特别是对特斯拉(Tesla)来说。特斯拉是一家臭名昭著的神秘公司，它让电动汽车的维修变得困难而昂贵。\n里奇·伯努伊特是一名YouTuber和机械师，专门负责修复受损的特斯拉汽车。他表示，这项维修权法案改变了游戏规则，但仍有很多工作要做。Benoit在2018年的一部纪录片中向Motherboard详细介绍了特斯拉软件的某些方面，他在采购零部件和访问特斯拉软件的某些方面多次遇到问题。\nBenoit在电话中告诉Motherboard：“对我们来说，这意味着从2022年车型年开始，制造商必须向许多第三方提供他们在经销商处使用的相同工具。”\nBenoit很兴奋，但他知道获取信息和诊断工具将是一场战斗。他之所以知道这一点，是因为特斯拉以前曾反对过这类法律。2012年通过了一项类似的法律，规定经销商必须向维修商店提供服务手册和诊断信息。值得注意的是，特斯拉也不是全国汽车制造商签署的谅解备忘录的一部分，该备忘录实际上使马萨诸塞州的立法成为一项全国性法律。\n“他们通过说…来绕过这个问题。他们没有经销商。“Benoit说。“因此，从技术上讲，他们不需要做任何事情。”\n但特斯拉确实提供了一些信息。伯努瓦说：“出于他们的好心，他们做了一个门户网站，这样你就可以登录并访问他们的诊断信息。”“它是可以买到的，但只有特斯拉认证的商店才能买到。”\n特斯拉服务和维修信息门户允许车身商店注册并获得“免费账户访问”的认证。任何其他希望从特斯拉获取维修和诊断信息的人都必须付费订阅。100美元可以买到24小时的访问权。每年的订阅费是3000美元。\n“他们非常聪明，”伯努瓦说。“希望这一次他们能给我们更多一点。”\n特斯拉和其他汽车制造商一样，不希望第一个问题在马萨诸塞州通过。在投票之前，它向该州的特斯拉车主发送了一封电子邮件，敦促他们投反对票。\n特斯拉长期以来一直将开源理念应用于我们的电动汽车专利知识产权。本着这一精神，我们向公众提供我们的服务、零部件和车身维修手册、接线图、维修公告、劳工代码和时间，以及其他用于对我们的车辆进行机械、电气和碰撞维修工作的信息。“特斯拉在电子邮件中说。\n这在一定程度上是正确的，但特斯拉也多次使用软件，例如，将消费者锁在汽车的某些方面之外。特斯拉还与独立的维修公司进行了斗争，有时还拒绝对它们进行认证。\n特斯拉说：“第一个问题远远超出了完成这项工作所必需的范围，它可能会危及车辆和数据安全。”“由两个全国性汽车商店游说团体推动的这些要求，将使车辆更容易受到网络攻击，并将使成功的攻击更具危害性。”这种对网络攻击的恐惧与汽车创新联盟(Alliance For Automotive Innovation)在该州的电视广告闪电战中使用的是一样的。但没起作用。\n维修权对汽车业和特斯拉都很重要，特别是因为修理一辆特斯拉可能是一场代价高昂的噩梦。伯努瓦说：“该州只有两个修理点。”他说，特斯拉的销量已经达到顶峰，但“他们的维修基础设施就是不在那里。”\n修理特斯拉最大的两个问题是等待时间和成本。业主往往要等上几周甚至几个月才能完成简单的工作。当车主真的把车修好时，费用往往很离奇。Benoit说，一些商店仅人工一项的收费就高达每小时200美元。伯努瓦说：“便宜一点的特斯拉3款售价3.5万美元。”他说：“这就像是日产Maxima的顶级产品。想象一下，为了诊断费，你每小时咳出200美元。这就是迈凯轮的价格。\nBenoit知道还有更多的工作要做，他知道特斯拉将奋力拼搏每一步，以保住它的维修秘密，但他对未来充满希望。“这只是换个地方的问题，”他说。“这是人们的另一种选择。因为谁愿意花600美元买三个小时的刹车呢？", "note_en": "A right-to-repair measure in Massachusetts  passed in a landslide victory last Tuesday. “Question 1,” as the measure was called on the ballot, will force car manufacturers to ensure independent repair stores have access to the same diagnostic tools as manufacturer run repair stores. That will change the automobile repair landscape in Massachusetts, especially for Tesla, a notoriously secretive company that has made it hard and expensive to service its electric vehicles.\n    Rich Benoit, a  YouTuber and mechanic who  specializes in rebuilding busted Teslas, said that this right-to-repair bill is a game-changer, but that there’s still a lot of work to be done. Benoit has repeatedly run into issues sourcing parts and  accessing certain aspects of Tesla&#39;s software, as he detailed to Motherboard in a 2018 documentary.\n   “For us, that means that starting the model year 2022, manufacturers have to give the same tools that they use at the dealerships available to a lot of third parties,” Benoit told Motherboard on the phone.\n     Benoit is excited, but he knows that getting information and diagnostic tools is going to be a fight. He knows because Tesla has pushed back against these kinds of laws before. A similar law passed in 2012, one that said dealerships had to make service manuals and diagnostic information available to repair stores. Notably, Tesla also wasn&#39;t part of a memorandum of understanding signed by car manufacturers nationwide that effectively made the Massachusetts legislation a national law.\n   “They got it around it by saying…they don’t have dealers,” Benoit said. “So technically, they didn’t have to do anything.”\n   But Tesla did make some information available. “Out of the kindness of their heart, they made a portal so that you could log in and access their diagnostics,” Benoit said. “It’s available, but it’s only available to Tesla certified shops.”\n    The Tesla Service and Repair Information Portal allows body shops to sign up and get certified for “complimentary account access.” Anyone else looking to get repair and diagnostic information out of Tesla has to pay for a subscription. $100 buys you 24 hours of access. An annual subscription costs $3,000.\n   “They’re very clever,” Benoit said. “Hopefully, this time they give us a little bit more.”\n   Tesla, like other automanufactuers, didn’t want Question 1 to pass in Massachusetts. Ahead of the vote, it sent an email to Tesla owners in the state urging them to vote no.\n   “Tesla has long applied an open source philosophy to our patented intellectual property for electric vehicles. In this spirit, we provide public access to our service, parts, and body repair manuals, wiring diagrams, service bulletins, labor codes and times, and other information used to perform mechanical, electrical, and collision repair work on our vehicles,” Tesla said in the email.\n   Some of this is true, but Tesla has also repeatedly, for example, used software to lock consumers out of certain aspects of their cars. Tesla has also  fought against independent repair companies, and has at times refused to certify them.\n   “Question 1 goes well beyond what is necessary to perform this work, and it potentially jeopardizes vehicle and data security,” Tesla said. “The requirements, pushed by two national auto shop lobbying groups, would make vehicles more vulnerable to cyberattacks and would make successful attacks more harmful.” This fear of a cyber attack  is the same one the Alliance for Automotive Innovation used in its blitz of television ads in the state. It didn’t work.\n    The right-to-repair is important for the automotive industry and Tesla specifically because repairing a Tesla can be a costly nightmare. “There’s only two repair locations in the state,” Benoit said. He said Tesla sales are through the roof but “their repair infrastructure just isn’t there.”\n   The two biggest problems with repairing a Tesla are the wait time and cost. Owners often wait  weeks and even months for simple jobs to be finished. When an owner does get their car repaired, the costs are often outlandish. Benoit said that some shops charge upwards of $200 an hour for labor alone. “A cheaper model 3 Teslas costs $35,000,” Benoit said. “That’s like a top of the line Nissan Maxima. Imagine coughing up $200 an hour for a diagnostic fee. That’s McLaren prices.”\n   Benoit knows there’s more work to do and he knows that Tesla will fight every step of the way to hold on to its repair secrets, but he’s hopeful about the future. “It’s just a matter of having another place,” he said. “Another option for people. Because who wants to pay $600 for a three hour brake job?”", "posttime": "2020-11-16 08:58:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,维修,repair", "title": "新通过的《维修权法》将从根本上改变特斯拉维修", "title_en": "Newly Passed Right-to-Repair Law Will Fundamentally Change Tesla Repair", "transed": 1, "url": "https://www.vice.com/en/article/93wy8v/newly-passed-right-to-repair-law-will-fundamentally-change-tesla-repair?utm_content=1605468607&utm_medium=social&utm_source=VICE_facebook&fbclid=IwAR0pinX8QgCkYBTXqLW52UYswzcPZ1fOQtkLes-kIq52K4R6qUtL_R-0dO8", "via": "", "real_tags": ["特斯拉", "维修", "repair"]}, {"category": "", "categoryclass": "", "imagename": "b1e38e3be53da6e6bc9182c42673bcab.gif", "infoid": 1035354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX的载人发射计划是根据商业机组计划开发的，NASA选择了两家私人公司建造宇航员发射系统，将宇航员从美国本土运送到国际空间站。2014年，NASA选择SpaceX和波音公司一起创建各自的系统。今年早些时候，SpaceX的龙舱和猎鹰9号火箭成功完成了最后一次Demo-2测试任务，成为第一个获得NASA实际载人飞行认证的火箭。Demo-2测试任务飞往国际空间站，机上有两名美国宇航员。\n为了达到这一点，SpaceX公司必须成功完成一些里程碑，包括一次全自动的无人国际空间站会合任务，以及演示发射台中止和发射后中止紧急安全系统，以保护机组人员。在Demo-1任务中，虽然所有的实际发射、对接和着陆都是由SpaceX的全自动软件和导航处理的，但宇航员们也短暂地接管了手动控制，以展示如果需要，这个人工驾驶的后备设备将按预期运行。\n到目前为止，Crew-1正在按预期进行，从佛罗里达进行了一次完美的起飞，并成功回收了用于发射龙的猎鹰9号火箭上使用的第一级助推器。“复原力”号机组人员也按计划在发射后10分钟后离开了猎鹰9号的第二阶段，在与国际空间站会合之前将在轨道上飞行27个小时，对接定于美国东部时间周一晚上11点左右(太平洋标准时间晚上8点)进行。一旦完全对接，宇航员们将下船并前往空间站开始他们的现役逗留，这一逗留将持续到明年6月。\n这次任务的四名宇航员中有三名之前去过太空，但对于飞行员维克多·格洛弗来说，这是他第一次去太空。这四名宇航员将加入NASA的凯特·鲁宾斯(Kate Rubins)以及俄罗斯宇航员谢尔盖·雷日科夫(Sergey Ryzhikov)和谢尔盖·库德-斯维尔奇科夫(Sergey Kud-Sverchkov)的行列，使空间站的工作人员总数从通常的6人增加到7人(NASA表示，这将为宇航员腾出更多时间进行实验，而不是他们与空间站日常维护相关的任务)。\n这是自2011年航天飞机计划结束以来，宇航员首次在NASA的常规运行任务中发射到太空。这标志着美国载人航天能力的正式回归，有望成为SpaceX和Dragon执行的许多载人飞行任务中的第一个-无论是NASA的飞行，还是商业客户组织的飞行。", "note_en": "SpaceX’s human launch program was developed under the Commercial Crew program, which saw NASA select two private companies to build astronaut launch systems for carrying astronauts to the ISS from U.S. soil. SpaceX was chosen alongside  Boeing   by NASA in 2014 to create their respective systems, and SpaceX’s Dragon capsule and  Falcon   9 rocket became the first to achieve actual human flight certification from NASA earlier this year with the successful completion of its final, Demo-2 test mission, which flew to the ISS with two U.S. astronauts on board.\n To get to this point, SpaceX had to complete a number of milestones successfully, including a fully automated uncrewed ISS rendez-vous mission, and a demonstration of both a launch pad abort and post-launch abort emergency safety system for the protection of the crew. During the Demo-1 mission, while all actual launch, docking and landing was handled by SpaceX’s fully autonomous software and navigation, astronauts also took over manual control briefly to demonstrate that this human-piloted backup would operate as intended, if required.\n  So far, Crew-1 is proceeding as expected, with a picture-perfect takeoff from Florida, and a successful recovery of the first-stage booster used on the Falcon 9 rocket used to launch Dragon. Crew Dragon ‘Resilience’ also departed from the second-stage of the Falcon 9 as planned at just after 10 minutes after liftoff, and there will be a 27 hour trip in orbit before the Dragon meets up with the ISS for its docking, which is scheduled to take place at around 11 PM EST (8 PM PST) on Monday night. Once fully docked, the astronauts will disembark and go over to the station to begin their active duty stay, which is set to last until next June.\n  Three of the four astronauts on this mission have been to space previously, but for pilot Victor Glover, it’s his first time. These four will join NASA’s Kate Rubins, and Roscosmos cosmonauts Sergey Ryzhikov and Sergey Kud-Sverchkov on the station, bringing the total staff complement to seven (an increase from its usual six that NASA says will free up more time for the astronauts to perform experiments, as opposed to their tasks related to regular daily maintenance of the station).\n This is the first time that astronauts have launched to space during a regular operational NASA mission since the end of the Shuttle program in 2011. It marks an official return of U.S. human spaceflight capabilities, and should hopefully become the first in many human flight missions undertaken by SpaceX and Dragon – across both NASA flights, and those organized by commercial customers.", "posttime": "2020-11-16 08:54:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,nasa,送入,宇航员", "title": "\nSpaceX和NASA成功将四名宇航员送入太空，执行首次执行的龙机组任务", "title_en": "\n\t\t\t\tSpaceX and NASA successfully launch four astronauts to space for first operational Dragon crew mission\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/15/spacex-and-nasa-successfully-launch-four-astronauts-to-space-for-first-operational-dragon-crew-mission/", "via": "", "real_tags": ["太空", "nasa", "送入", "宇航员"]}, {"category": "", "categoryclass": "", "imagename": "ae7c77714b98d09b13527bfd6fe31c5f.jpg", "infoid": 1035353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "海岸阶段：美国国家航空航天局(https://youtu.be/eVB02SSeqgQ)和美国国家航空航天局(NASA)计划于11月15日(周日)发射猎鹰9号，这是“龙”号首次执行机组任务……", "note_en": "Coast Phase: https://youtu.be/eVB02SSeqgQ SpaceX and NASA are targeting Sunday, November 15 for Falcon 9’s launch of Dragon’s first operational crew mission ...", "posttime": "2020-11-16 08:49:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "spacex,美国国家航空航天局", "title": "SpaceX Crew-1", "title_en": "SpaceX Crew-1", "transed": 1, "url": "https://www.youtube.com/watch?v=bnChQbxLkkI&resubmit=1", "via": "", "real_tags": ["spacex", "美国国家航空航天局"]}, {"category": "", "categoryclass": "", "imagename": "ebab7dc37cda717452f3326bddf22cf9.jpg", "infoid": 1035352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX公司和美国国家航空航天局(NASA)计划于11月15日(周日)在佛罗里达州肯尼迪航天中心(NASA‘s Kennedy Space Center)的历史发射综合体39A(LC-39A)向国际空间站(ISS)发射猎鹰9号，这是“猎鹰9号”首次执行机组任务(Crew-1)。即时发射窗口在晚上7点27分开启。美国东部时间11月15日00：27世界标准时间11月16日。在分离级后，SpaceX公司将尝试将猎鹰9号的第一级降落在将驻扎在大西洋的“只需阅读说明”的无人机上。发射网络直播将在发射前4小时开始直播。请收看现场直播。\n作为商业机组计划的一部分，NASA宇航员迈克·霍普金斯、维克多·格洛弗、香农·沃克和日本宇宙航空研究开发机构的宇航员野口宗一将搭乘“龙”号前往国际空间站执行首次为期6个月的操作任务。\n继“龙”的第二次演示任务(Demo-2)之后，美国国家航空航天局(NASA)通过了SpaceX的认证，可以执行往返空间站的机组人员操作任务。Crew-1是2020年和2021年三次定期龙之旅中的第一次。\n载人航天带着有史以来最安全、最先进的系统返回美国，这是美国未来太空探索的一个转折点，它为登月、火星和其他地方的任务奠定了基础。", "note_en": "SpaceX and NASA are targeting Sunday, November 15 for Falcon 9’s launch of  Dragon’s first operational crew mission (Crew-1) to the International Space Station (ISS) from historic Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center in Florida. The instantaneous launch window opens at 7:27 p.m. EST on November 15, 00:27 UTC on November 16. Following stage separation, SpaceX will attempt to land Falcon 9’s first stage on the “Just Read the Instructions” droneship, which will be stationed in the Atlantic Ocean. The launch webcast will go live about 4 hours before liftoff. Tune in here to watch live.\n  As part of the Commercial Crew Program, NASA astronauts  Mike Hopkins,  Victor Glover,  Shannon Walker, and JAXA astronaut  Soichi Noguchi will fly aboard Dragon on its first six-month operational mission to the ISS.\n  Following Dragon’s second demonstration mission (Demo-2), NASA  certified SpaceX for operational crew missions to and from the space station. Crew-1 is the first of three scheduled Dragon flights over the course of 2020 and 2021.\n  The return of human spaceflight to the United States with one of the safest, most advanced systems ever built is a turning point for America’s future space exploration, and it lays the groundwork for missions to the Moon, Mars, and beyond.", "posttime": "2020-11-16 08:32:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,火箭,搭载,launches,任务", "title": "SpaceX公司发射猎鹰9号火箭，搭载载着4名宇航员的乘员龙太空舱", "title_en": "SpaceX Launches a Falcon 9 Rocket Carrying a Crew Dragon Capsule With Four Astronauts", "transed": 1, "url": "https://www.spacex.com/launches/index.html", "via": "", "real_tags": ["太空", "火箭", "搭载", "launches", "任务"]}, {"category": "", "categoryclass": "", "imagename": "ae7c77714b98d09b13527bfd6fe31c5f.jpg", "infoid": 1035351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX和美国国家航空航天局(NASA)计划于11月15日(周日)发射猎鹰9号(Falcon 9)，向国际空间站(International Space Statio)发射“龙”(Dragon)首次执行机组任务(CREW-1)。", "note_en": "SpaceX and NASA are targeting Sunday, November 15 for Falcon 9’s launch of Dragon’s first operational crew mission (Crew-1) to the International Space Statio...", "posttime": "2020-11-16 08:27:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,spacex,发射", "title": "NASA SpaceX Crew-1任务", "title_en": "NASA SpaceX Crew-1 Mission", "transed": 1, "url": "https://www.youtube.com/watch?v=bnChQbxLkkI", "via": "", "real_tags": ["nasa", "spacex", "发射"]}, {"category": "", "categoryclass": "", "imagename": "da17f53a764ed34b85b758b53437b3f3.jpg", "infoid": 1035350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下午3点15分开始收看节目。Est，准备好#LaunchAmerica！和我们一起现场报道SpaceX Crew-1，这是第一次飞往国际空间站的机组人员轮换飞行……", "note_en": "Tune in starting at 3:15 p.m. EST and get ready to #LaunchAmerica! Join us for live coverage of SpaceX Crew-1, the first crew rotation flight to the Internat...", "posttime": "2020-11-16 08:27:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,nasa,spacex,收看", "title": "美国国家航空航天局SpaceX Crew-1任务现场发射", "title_en": "Launch of NASA's SpaceX Crew-1 Mission Live", "transed": 1, "url": "https://www.youtube.com/watch?v=E_FIaPBOJgc", "via": "", "real_tags": ["美国", "nasa", "spacex", "收看"]}, {"category": "", "categoryclass": "", "imagename": "68bc0396ea251412f1d04e25eb04557d.jpg", "infoid": 1035349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于浦那和旧金山的创业公司的新一轮融资由软银愿景基金2牵头。该公司表示，这轮融资是债务和股权的结合。现有投资者Norwest Venture Partners、Accel Partners、Canaan、NEA、NewView Capital和高通风险投资公司(Qualcomm Ventures)也参与了这轮融资。据知情人士透露，这轮融资对这家成立八年的初创公司的估值约为5亿美元，高于去年的约2.5亿美元。\nMindTickle联合创始人兼首席执行官克里希纳·德普拉(Krishna Depura)在接受TechCrunch采访时表示，这只1亿美元的基金中的绝大多数是股权投资。不过，他拒绝透露具体金额，也拒绝就估值置评。\n我们曾经生活在一个卖家的世界里，买家只有很少的选择可供选择，他们可以从中挑选自己的产品。“如果你想买一辆车，每四年才会有一款新车。情况发生了变化。“德普拉说，他指出，今天的客户并不缺乏试图向他们出售类似系列产品的公司。\n虽然这对客户来说是件好事，但这意味着公司必须付出更多的努力来进行销售。十年前，当德普拉看到Facebook和Zynga等游戏公司开发出令人上瘾的产品和服务时，他想知道其中一些知识是否可以直接应用到现代销售活动中。\n这就是MindTickle的创立，它现在帮助公司指导他们面向客户的团队。无论这些公司试图销售什么，他们都在与数十家公司(如果不是更多的公司)竞争，而客户对听到这些话的耐心一直在下降。\nMindTickle的名字源于游戏化思维的想法，它允许公司大规模培训和提高销售人员的技能，并使用角色扮演方法帮助他们练习推销，以及如何处理客户的询问。\n德普拉说，该平台帮助销售人员衡量他们在收入指标方面的改善，并对他们打出的电话提供反馈。他说，该平台利用机器学习引擎为销售人员提供个性化的补救和增援。\nMindTickle目前的客户包括200多家企业，包括财富500强和福布斯全球2000强中的40多家，但该公司表示，根据保密协议，它不能透露几个名字。它确实分享了一些名字，包括MongoDB、Nutanix、Qualtrics、ProCore、Square、Janssen、Cloudera、德克斯康(Dexcom)、默克(Merck&amp；Co.)和贝纳通集团(Benetton Group)。\n在撰写本文时，MindTickle在G2上排名第五，G2是一个流行的软件和服务市场。\n软银投资顾问公司(SoftBank Investment Advisers)合伙人苏默·朱尼贾(Sumer Juneja)在一份声明中表示：“MindTickle在增长、产品质量和庞大客户群方面的过往记录凸显了它们的优势。”通过向用户提供引人入胜和个性化的培训，MindTickle处于独特的地位，可以支持企业增加收入，并在现有员工队伍中扩展关键能力。“。这家日本投资集团在大约3个月前开始与MindTickle进行谈判，目前正在探索对SaaS类别的更多投资。\n德普拉说，新的融资资本将使MindTickle进一步建立这一新类别。MindTickle在美国、欧洲和印度拥有约400名员工。这家初创公司正在开发新的产品功能，并将利用新资金在欧洲和美国进一步增长，美国已经是其关键市场之一。", "note_en": "The Pune and San Francisco-headquartered startup’s new financing round was led by  SoftBank   Vision Fund 2. The round is a combination of debt and equity, the startup said. Existing investors Norwest Venture Partners, Accel Partners, Canaan, NEA, NewView Capital, and Qualcomm Ventures also participated in the round, which according to a person familiar with the matter, valued the eight-year-old startup at roughly $500 million, up from about $250 million last year.\n The vast majority of this $100 million fund is equity investment, said Krishna Depura, co-founder and chief executive of MindTickle, in an interview with TechCrunch. He declined to disclose the specific amount, however, or comment on the valuation.\n  We used to live in a seller’s world, where buyers had a small selection of choices from which they could pick their products. “You wanted to buy a car, there would be only one new car model every four years. Things have changed,” said Depura, noting that customers today have no shortage of companies trying to sell them similar lines of products.\n While that’s great for customers, it means that companies have to put more effort to make a sale. A decade ago, as Depura watched Facebook and gaming firms like Zynga develop addictive products and services, he wondered if some of these learnings could be baked directly into modern age sales efforts.\n That was the inception of MindTickle, which now helps companies guide their customer-facing teams. Regardless of what these firms are attempting to sell, they are competing with dozens of firms, if not more, and customers have ever-so-declining patience to hear them.\n MindTickle, whose name is inspired from the idea of gamifying mindsets, allows companies to train and upskill their salespeople at scale, and uses role playing methods to help them practice their pitch, and how to handle a customer’s queries.\n  Depura said the platform helps salespeople measure their improvement in revenue metrics and offers feedback on the calls they made. The platform utilizes machine learning engines to serve personalized remediations and reinforcements to salespeople, he said.\n More than 200 enterprises, including more than 40 of the Fortune 500 and Forbes Global 2000 firms, are among MindTickle’s clients today — though, citing confidential agreements, the firm said it can’t disclose several names. Some of the names it did share include MongoDB, Nutanix, Qualtrics, Procore, Square, Janssen, Cloudera, Dexcom, Merck &amp; Co., and Benetton Group.\n As of this writing, MindTickle was ranked the  fifth best product for sales on G2, a popular marketplace for software and services.\n “MindTickle’s track record of growth, quality of product and marquee customer base highlights their strengths,” said Sumer Juneja, Partner at SoftBank Investment Advisers, in a statement. “By delivering engaging and personalized training to users, MindTickle is uniquely placed to support businesses to increase revenue generation and extend critical capabilities within their existing workforce.” The Japanese investment group, which began conversations with MindTickle about three months ago, is exploring more investments in SaaS categories.\n The new funding capital will allow MindTickle, which employs about 400 people in the U.S., Europe, and India, to further establish this new category, said Depura. The startup is developing new product features and will deploy the new funds to further grow in Europe, and the U.S., which is already one of its key markets.", "posttime": "2020-11-16 08:10:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "愿景,mindtickle", "title": "\n销售准备平台MindTickle募集1亿美元，由软银愿景基金2领投", "title_en": "\n\t\t\t\tSales readiness platform MindTickle raises $100 million led by SoftBank Vision Fund 2\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/15/sales-readiness-platform-mindtickle-raises-100-million-led-by-softbank-vision-fund-2/", "via": "", "real_tags": ["愿景"]}, {"category": "", "categoryclass": "", "imagename": "61a309036104bb93463714deca812c4d.jpg", "infoid": 1035348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是一名消费技术专家，撰写有关Windows、PC、笔记本电脑、Mac、宽带等方面的文章。\n当Twitter威胁要自动关闭不活跃的账户时，引发了用户的愤怒反应，他们担心自己死去的朋友和家人的账户将永远消失。在推特做出让步并承诺致力于纪念账户将近一年的今天，它仍在决定如何处理数百万死去的账户持有人。\n去年11月，Twitter表示，它正在实施一项新举措，如果用户在六个月内没有登录，账户可能会自动关闭，从而释放数百万用户名。\n然而，该公司没有考虑到已故账户持有人的朋友和家人的感受，他们通过回顾时间线和阅读已故用户的推文感到安慰。\n前TechCrunch撰稿人德鲁·奥兰诺夫(Drew Olanoff)在Twitter宣布这一消息时写道，他担心公司的新政策会让他已故父亲的账户失效，使他无法回去阅读他的推文。奥兰诺夫的父亲四年前去世了，他写道：“我仍然读着他的推文，时不时地与大家分享。”“这是我纪念他的方式，不管奇怪与否。让他的精神永存。他的推文是他与世界分享的带有时间戳的时刻。\n推特匆忙做出让步，在几天内宣布“我们已经听到了你们关于这将对死者账户造成的影响”，并表示“这是我们的失误”。\n推特补充说：“我们不会删除任何不活跃的账户，直到我们为人们创造一种新的方式来纪念账户。”\n然而，一年过去了，Twitter还没有实施这样的系统。Twitter拒绝置评，只是向我们指出了它一年前的声明。死者的描述保持不变--这本身也会造成问题。\n让死者的账户保持活跃的问题是，它们可能会成为滥用的磁石，特别是如果死者是高调的人。\nBBC最近的一部纪录片《奥斯卡·皮斯托瑞斯的审判》(The Trials Of Oscar Pistorius)突出了受害者--皮斯托瑞斯的女友瑞瓦·斯廷坎普(Reeva Steenkamp)--在她去世前的几个小时里是如何在推特上发帖的。它没有强调的是，在她被谋杀后对她的推文做出的一些病态回复，至今仍在她的账户上可见。\n英国电视节目主持人卡罗琳·弗莱克(Caroline Flake)的账号在自杀后也同样成为辱骂推特的目标，此前她曾因袭击男友而被起诉。\n让死者的账户敞开，让巨魔攻击，这与自动删除它们一样有问题。\n推特确实允许家属要求将死去用户的账户从网站上删除。该公司的政策规定：“如果推特用户死亡，我们可以与被授权代表遗产行事的人合作，或者与死者经核实的直系亲属合作，停用一个账户。”\n这绝不是一个立竿见影的过程，推特要求“死者的信息，你的身份证复印件，以及死者的死亡证明复印件”，然后才会停用账户。\n即便如此，这也是一种要么全有要么全无的方法。要么彻底删除这个账号，剥夺每个人回顾过去推文的能力，要么让它任由巨魔摆布。\n这就是记忆账户发挥作用的地方。Facebook允许账户持有人在他们去世的情况下指定某人来照看他们的账户。纪念账户上标有“记住”一词，以确保人们知道账户持有人已经去世，但也允许朋友和家人在他们的时间表上发布对已故账户持有人的回忆，遗留联系人可以删除和报告任何不合适的事情。\n当然，也会有一些人对他们的社交媒体资料比他们活得久感到不舒服，他们更愿意在自己去世的情况下删除自己的账户。\n这也是Facebook上的一个选项。该社交网络的纪念设置允许用户在他们去世时请求删除他们的账户，永久删除他们所有的帖子、照片和评论。当指定的遗留联系人通知他们账户持有人去世时，Facebook就会发出这一请求。\nTwitter没有提供这样的功能。如果你死了，你不能宣称你的账户会被删除，或者，实际上，你不能说你的账户是开着的。这由你的朋友和家人自行决定。\n毫无疑问，这是一个高度敏感的领域，需要谨慎实施，但在这个问题浮出水面一年后，Twitter仍在努力处理它的死亡者。", "note_en": "I am a consumer tech expert writing about Windows, PCs, laptops, Mac, broadband and more.\n When Twitter threatened to automatically close inactive accounts, it sparked a furious response from users who feared the accounts of their dead friends and family were about to disappear forever. Almost a year to the day since Twitter backed down and promised to work on a way to memorialize accounts, it’s still to decide how to deal with its millions of dead account holders.\n  Last November, Twitter said it was implementing a new initiative that could see accounts automatically closed if users hadn’t signed in for six months, freeing up millions of usernames in the process.\n  However, one thing the company failed to consider was the feelings of friends and family members of dead account holders, who take comfort in going back through timelines and reading tweets from deceased users.\n    Drew Olanoff, a former TechCrunch writer,  wrote at the time of Twitter’s announcement that he feared the company’s new policy would extinguish his dead father’s account, robbing him of the ability to go back and read his tweets. “I still read his tweets, and from time to time I still share them with you,” wrote Olanoff, whose father had died four years previous. “It’s my way, odd or not, of remembering him. Keeping his spirit alive. His tweets are timestamped moments that he shared with the world.”\n    Twitter hastily backed down, announcing within days that “we’ve heard you on the impact that this would have on the account of the deceased” and that “this was a miss on our part”.\n  “We will not be removing any inactive accounts until we create a new way for people to memorialize accounts,” Twitter added.\n    A year later, however, Twitter has yet to implement such a system. Twitter declined to comment, merely pointing us to the statements it made a year ago. The accounts of the dead remain untouched - and that can cause problems of its own.\n      The problem with leaving the accounts of the dead to remain active is that they can become a magnet for abuse, especially if the deceased is a high-profile person.\n  A recent BBC documentary, The Trials of Oscar Pistorius, highlighted how the victim - Pistorius&#39;s girlfriend, Reeva Steenkamp - had been tweeting in the hours leading up to her death. What it didn’t highlight was some of the sick replies to her tweets that were made after she’d been murdered, and still remain visible on her account today.\n  The account of British TV presenter, Caroline Flack, was similarly targeted for abusive tweets after she committed suicide, having previously been charged for the assault of her boyfriend.\n  Leaving the accounts of the dead open for the trolls to attack can be every bit as problematic as automatically removing them.\n    Twitter does allow family members to request that accounts of dead users be removed from the site. “In the event of the death of a Twitter user, we can work with a person authorized to act on behalf of the estate, or with a verified immediate family member of the deceased to have an account deactivated,” the  company’s policy states.\n  That is by no means an immediate process, with Twitter requiring “information about the deceased, a copy of your ID, and a copy of the deceased’s death certificate” before it will deactivate accounts.\n  Even then, it’s an all or nothing approach. Either have the account removed entirely and deprive everyone of the ability to look back at past tweets, or leave it open at the mercy of the trolls.\n  That’s where memorialized accounts come into play. Facebook allows account holders to appoint someone to look after their account in the event of their death. A memorialized account is marked with the word “remembering”, to ensure people know the account holder has passed away, but also allows friends and family to post memories of the deceased account holder on their timeline, with the legacy contact able to remove and report anything that is inappropriate.\n      Of course, there will also be people who are uncomfortable with their social media profile outliving them, who’d prefer to have their account deleted in the event of their death.\n  This, again, is an option on Facebook. The social network’s memorialization settings allow users to request their account is deleted upon their death, removing all of their posts, photos and comments permanently. Facebook enacts the request when the appointed legacy contact informs them of the account holder’s death.\n  Twitter offers no such feature. You can’t declare your wish to have your account removed in the event of your death or, indeed, left open. It’s left to the discretion of your friends and family.\n  There’s no doubt this is a highly sensitive area that needs to be implemented with care, but a year after this problem came to the fore, Twitter is still struggling to deal with its dead.", "posttime": "2020-11-16 08:09:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,launch,账户", "title": "一年前，Twitter承诺为人们创造一种方式来纪念已故用户的账户，但到目前为止，Twitter还没有推出这样的系统", "title_en": "A year after promising to create a way for people to memorialize accounts of deceased users, Twitter has yet to launch such a system", "transed": 1, "url": "https://www.forbes.com/sites/barrycollins/2020/11/15/a-year-on-twitter-still-doesnt-know-how-to-deal-with-its-dead/", "via": "", "real_tags": ["推出", "launch", "账户"]}, {"category": "", "categoryclass": "", "imagename": "8eaa3ff520453fd53be68b9f0289967c.jpeg", "infoid": 1035347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇报道只向《商业内幕》的订阅者开放。成为一名内幕人士，现在就开始阅读吧。\n从专业的吹发到厨师准备的菜肴送货上门，再到招募遛狗者，如今人们把一切都外包出去了。在约会应用上寻找匹配对象有什么不同呢？\n自从我在2015年推出了Spoon Meet Spoon以来，人们对我的约会应用代笔和辅导服务的兴趣一直在稳步增长。如果你仔细想想，这是有道理的。并不是每个人都有时间、耐心，甚至是在当今快节奏的数字世界中所需要的技术诀窍，去做建立真正的联系所需的跑腿工作。\n假设你才20多岁，你的约会档案正迷失在档案的海洋中，你需要一些东西来让你的档案脱颖而出。\n也许你发现自己经常被鬼魂缠身，不知道为什么。也许你是一位有工作的父母，你最不想把宝贵的休息时间花在刷卡上。你可能刚刚离婚，当你重新进入约会的场景时，你会发现很多事情都变了。你甚至可能是一位忧心忡忡的父母，希望给你成年的儿子或女儿一个有益的推动，让他们进入在线约会的世界。\n无论是推荐一家很棒的餐厅，担保一个好的保姆，推荐一份工作，还是安排两个人约会，我一直都是一个联络人。直到五年前，我还在为体育运动做这样的事情，从来没有想过这会带来一条职业道路。\n2015年，我给大约10个朋友发了一条群发短信，询问他们可以看到我做什么类型的工作。\n在引用了一大堆我给他们或他们认识的人牵线搭桥的例子后，他们的朋友、工作，甚至是伴侣，普遍的共识是我应该成为媒人。起初，我想到媒人这份工作看起来有多么过时，然后我回忆起我总是很享受接管朋友在线约会资料的数字控制权。我第一次想到，也许这里还有更多的东西。\n为了试运行约会应用市场，并确定我是否愿意把它作为一项业务来推进，我联系了五个人，他们都是我朋友的朋友，并免费提供了三个月的服务。\n没过多久，我就确信这对我来说是正确的举动，所以在创建了一个网站后，我在Facebook上发布了一个链接，宣布Spoon Meet Spoon进入我的网络。消息传开了，几天之内，我的网站就有了数千的点击量。\n我很快意识到，虽然大多数人的初衷都是好的，但即使是真正聪明的人，在约会时也可能做出糟糕的选择。\n自从我开始创业以来，我了解到，你的第一张照片就是让你与之相配的原因。\n似乎并不是每个人都意识到了这一点，因为我见过很多照片都属于唐的类别--包括前任的照片，父母死在医院病床上的照片，甚至是某人花园的照片。抱歉，没人刷你的西红柿。我经常帮助客户选择最能代表他们的照片，有时甚至推荐一位专业摄影师。\n除了照片，简历还应该用来提供让你打勾的信息，而不是你在比赛中寻找的东西。把这份简历想象成读者引诱对话的小抄，理想的情况是提前连接到一条消息，然后是视频聊天，最后是一次咖啡约会。\n约会应用的美妙之处在于它们可以制作大量的介绍。\n约会应用程序是用来建立联系的，但约会是很耗时的。我告诉我的客户，把视频聊天看作约会应用程序流程中的一个新步骤。它不会取代日期，它是见面前的筛选工具，它回答了一个问题：离开家去见这个人值得吗？\n与三个月的聊天相比，视频聊天可以在10分钟内给你提供更多关于某人的信息--顺便说一句，10天是继续前行的绝对上限。\n虽然视频聊天一开始可能会很尴尬，但第一次见面也可能会很尴尬。另外，虚拟聊天可以为你节省大量的时间和旅行。我建议预留30分钟聊天，但10分钟后你就会知道你是想留下来还是礼貌地结束谈话。我总是告诉客户，为自己辩解的一个好办法就是说，他们得去遛狗了，…。即使他们没有养狗。\n很多人认为网上约会不过是无休止的刷一刷而已，但在内心深处，有一种疯狂的方法。\n在直觉、假设和测试的综合作用下，我找到了答案--至少对其他人来说是这样。虽然我是一位45岁的已婚母亲，有两个男孩，但我每天花12到14个小时代表我的客户在Bumble、铰链、Match、Coffee Meets Bagel、OK丘比特、联盟和Tinder上。\n为了获得完美的个人资料，我花300美元创建你的约会资料。约会诊断的费用是600美元，包括约会档案和分析，以确定你是否使用了正确的应用程序，以及深入研究你的聊天历史，以确定我们如何改进你的约会游戏，以获得更好的结果。\n约会诊断Plus包括每月约会辅导(第一个月1500美元，以后每个月1000美元)。最后，我提供有限数量的全套套餐(第一个月2500美元，以后每个月2000美元)，我可以在这些套餐中完成所有的工作--刷卡、发短信、回复，直到你真正到了约会的时候。这么多年来，我一直在做这件事，从来没有人怀疑电话那头的是我，而不是我的客户。我每个月只接待5到6个这个级别的客户，因为工作量很大。\n目前，我有五个完整的客户。归根结底，无论人们购买哪种套餐，他们聘用我都是出于同样的原因--因为我知道什么时候该推动、改变和放弃这项任务。\n首先，客户需要填写一份全面的录取表格，这样我才能真正了解他们。除了你期待的标准问题外，我的问题还涉及到更深层次的后勤问题(你到目前为止的旅行距离是多少？)。到情感层面(你有没有和你的体重作斗争？你冷冻卵子了吗？)，奇怪的是(你最尴尬也最滑稽的时刻是什么？你最常使用的四个表情符号是什么？)\n我总是建议你一次使用一款应用，直到你用完了再使用下一款。\n否则，它可能会让人应接不暇。为了确保我的教练客户获得最好的投资回报，我提供了一个详细的循序渐进的列表，列出了登录、刷卡、心跳、发起消息和回复的具体日期和时间。\n总体而言，我建议周一到周四每天登录两次，如果你必须结束任何事情，周五登录一次。周末不要使用这款应用，除非你正在安排日程，下午5点之前完成。没有人喜欢热心的海狸。\n另一个小贴士是不惜一切代价避免凌空抽射，把它们留给面对面。约会应用程序实际上不是用来约会的，它们是用来联系的；真正的约会是离线进行的。\n我能给出的最重要的建议就是敞开心扉，给人们一个机会。\n不要那么死板，以至于你带着一份你在伴侣身上寻找的标准清单四处走动。或者，不要问别人他们想要什么样的伴侣。每个应用程序都有一个过滤器，你可以在其中确定他们是在寻找一段随意的关系，还是想结婚，或者介于两者之间的任何东西。此外，仅仅因为某人说他们有婚姻观念并不一定意味着他们想嫁给你，所以一定要降低你自己的期望值。\n问别人使用约会应用的经历也不是个好主意，比如，Bumble对你的态度如何？这相当于在你来到现场之前，去参加面试并询问其他应聘者的表现。\n一旦你安排了约会，就在约定的时间出现。这是一次会议，不是兄弟会聚会。永远不会有鬼魂。以善意和礼貌结束这一过程。你永远不知道生活会把你带到哪里，人们也不会忘记被幽灵笼罩。\n有时，即使是最明显的事情也需要说明，因为我看到或听说了这些事情的发生。\n例如，不要成为种族主义者。当我的一位客户与她会面的那个人说了一些下流的话时，我让她为自己辩解。另一个提醒是要全神贯注地关注别人。我的一位客户与一名男子进行了视频聊天，这名男子一直在焦躁不安地玩袜子。\n有一次，我在刷卡的时候看到一个资料，上面写着：我做爱时不说话，因为我妈妈告诉我不要和陌生人说话。也许有些人会觉得这很有趣，但我真的很担心那个女人。\n尽管有新冠肺炎，但我的生意现在又开始如火如荼了。疫情刚开始的时候，我关闭了两个月，但后来《今日秀》重播了我上过的一集，人们开始再次联系我。\n我一直在家工作，所以变化不大。工作日一开始，我会代表我的所有客户给潜在客户发信息/回复，给客户发送友好的提醒，提醒他们回复比赛和安排约会，创建个人资料，查看照片，并进行大量的滑动操作。\n下午4点开始。到晚上7点。我有和家人在一起的时间，然后我晚上7点就回来工作了。至晚上11点。代笔和编辑。\n对于很多人来说，疫情一直是一个隔离期，现在他们正开始做好准备，准备重返疫情。有时候，坐在副驾驶座位上，让别人一开始开车就更容易了--而我总是准备好掌舵。\n点击“注册”，即表示您同意接收来自Business Insider以及其他合作伙伴的营销电子邮件，并接受我们的服务条款和隐私政策。", "note_en": "This story is available exclusively to Business Insider subscribers.  Become an Insider and start reading now.\n  From professional hair blowouts to chef-prepared cuisine delivered to your door to enlisting dog walkers, people outsource everything these days. Why should finding a match on a dating app be any different?\n Since I launched  Spoon Meet Spoon in 2015, interest in my dating app ghostwriting and coaching services has steadily grown. It makes sense if you think about it. Not everyone has the time, patience, or even the know-how needed in today&#39;s fast-paced digital world to do the legwork it takes to make an authentic connection.\n Let&#39;s say you&#39;re in your 20s, your dating profile is getting lost in the sea of profiles, and you need a little something to make yours stand out.\n Maybe you find yourself getting ghosted a lot and don&#39;t know why. Perhaps you&#39;re a working parent, and the last thing you want to dedicate your precious downtime to is swiping. You may be newly divorced and upon reentering the dating scene, you&#39;re finding that a lot has changed. You might even be a concerned parent looking to give your adult son or daughter a helpful nudge into the world of online dating.\n  I&#39;ve always been a &#39; connector,&#39; whether it&#39;s suggesting a terrific restaurant, vouching for a great babysitter, recommending a job, or setting two people up on a date. Up until five years ago, I did this type of thing for sport, and never thought it could lead to a career path.\n In 2015, I sent a group text to about ten friends asking them what type of work they could see me doing.\n After referencing a bunch of instances where I had connected them or someone they knew with friends, jobs, and even partners, the general consensus was I should be a matchmaker. Initially, I thought of how old-fashioned the job of matchmaker seemed, then I recalled how I always enjoyed taking over the digital reins on my friends online dating profiles. For the first time, I thought &#39;maybe there is something more here.&#39;\n In an effort to test drive the dating app market and determine if I wanted to commit to moving ahead with this as a business, I connected with five people, all friends of friends, and offered my services for three months at no charge.\n   It didn&#39;t take long before I was convinced this was the right move for me, so after having a website created, I posted a link on Facebook announcing Spoon Meet Spoon to my network. Word got out and within days my site had thousands of hits.\n I soon realized that while most people have the best intentions, even really smart people can make poor choices when it comes to dating.\n  Since starting my business, I&#39;ve learned that your first photo is what gets you a match.\n  Not everyone seems to be aware of this, as I&#39;ve seen plenty of photos that would all fall under the &#34;Don&#39;t&#34; category — pictures featuring exes, photos of a parent dying in a hospital bed, even an image of someone&#39;s garden. No one is swiping right on your tomatoes, sorry. Often, I help clients select the best photo to represent them, sometimes even suggesting a professional photographer.\n Beyond the photo, bios should be used to provide information on what makes you tick, not what you&#39;re looking for in a match. Think of the bio as a cheat sheet for the reader to entice a conversation, ideally advancing a connection to a message, then a video chat, and eventually, a coffee date.\n The beauty of dating apps is in the high volume of introductions they can produce.\n Dating apps are about connecting, but going on dates is time-consuming. I tell my clients to consider the video chat a new step in the dating app process. It doesn&#39;t replace a date, it&#39;s a screening tool before meeting and answers the question &#39;Is it worth leaving my home to meet this person?&#39;\n A video chat can give you more data on someone in ten minutes than messaging with them for three months — which I don&#39;t ever recommend by the way, 10 days is the absolute maximum before moving on.\n While video chats can be awkward initially, so can meeting in person for the first time. Plus, a virtual chat can save you a lot of time and travel. I suggest reserving 30 minutes for a chat but after 10 minutes you&#39;ll know if you want to stick around or politely end the conversation. I always tell clients a great way to excuse themselves is to say they&#39;ve got to walk their dog… even if they don&#39;t have a dog.\n   A lot of people think online dating is nothing more than endless swiping, but deep down there is a method to the madness.\n Between a combination of hunches, hypotheses, and tests, I&#39;ve figured it out — at least for other people. And although I&#39;m a 45-year-old married mother of two boys, I spend between 12 and 14 hours a day, on Bumble, Hinge, Match, Coffee Meets Bagel, OK Cupid, The League, and Tinder, on behalf of my clients.\n  For   The Perfect Profile, I create your dating profile for $300.  Dating Diagnosis costs $600 and includes a dating profile plus analysis to determine if you&#39;re on the correct apps, as well as a deep dive into your chat history to determine how we can improve your dating game to yield better results.\n Dating Diagnosis Plus includes dating coaching on a monthly basis ($1,500 for the first month, $1,000 each additional month). Finally, I offer a limited number of T he Whole Shebang packages ($2,500 for the first month, $2,000 each additional month) where I do it all — swiping, messaging, and responding until it&#39;s actually time for you to show up for the date. In all the years I&#39;ve been doing this no one has ever suspected it&#39;s me on the other end and not my client. I only take five or six clients at this level a month, because it&#39;s a lot of work.\n Currently, I have five  Whole Shebang clients. At the end of the day, no matter which package people purchase, they are hiring me for the same reason — because I know when to nudge, convert, and abort the mission.\n To begin, clients are required to complete a comprehensive intake form so I can really get to know them. Besides the standard questions you&#39;d expect, my questions delve deeper from the logistical (What&#39;s the distance you&#39;ll travel to date?) to the emotional  (Do you struggle with your weight? Have you frozen your eggs?), to quirky (What&#39;s your most embarrassing yet comical moment? What four emojis do you use most?)\n I always suggest using one app at a time until you&#39;ve exhausted it before moving onto the next one.\n  Otherwise, it can be overwhelming. To ensure my coaching clients get their best return on investment, I provide a detailed step-by-step list outlining specific days and times to log on, swipe, heart, initiate messages, and respond.\n Overall, I recommend logging on twice daily Monday through Thursday, and once on Friday if you have to wrap anything up. Stay off the app on weekends unless you are in the process of scheduling, and do it before 5 p.m. No one likes an eager beaver.\n Another tip is to avoid volleys at all costs and save them for in-person. Dating apps are not actually for dating, they are for connecting; real dating happens offline.\n    The most important advice I can give is to be open and give people a chance.\n Don&#39;t be so rigid that you&#39;re walking around with a checklist of criteria you&#39;re looking for in a partner. Alternatively, don&#39;t ask people what they are looking for in a partner. Every app has a filter where you can determine whether they are looking for a casual relationship, or are marriage-minded, or anything in between. Also, just because someone says they are marriage-minded doesn&#39;t necessarily mean they want to marry you, so be sure to temper your own expectations.\n It&#39;s also never a good idea to ask someone about their experience with dating apps, like &#39;So, how&#39;s Bumble treating you?&#39; That&#39;s the equivalent of showing up for a job interview and asking how the other interviewees did before you arrived on the scene.\n Once you schedule a date, show up at the agreed upon time. It&#39;s a meeting, not a frat party. Never ghost people. End the process with kindness and manners. You never know where life will take you, and people don&#39;t forget being ghosted.\n Sometimes even the most obvious things need to be stated because I&#39;ve seen or heard about them happening.\n For example, don&#39;t be racist. I had a client excuse herself when the man she was meeting with made off-color remarks. Another reminder is to give people your undivided attention. A client of mine had a video chat with a man who was fidgeting and playing with his socks the whole time.\n Once while swiping, I once encountered a profile that read &#39;I don&#39;t talk during sex because my mother told me not to talk to strangers.&#39; Maybe that&#39;s amusing to some people, but I was genuinely scared for that woman.\n Despite COVID-19, my business is back in full swing now. I shut down for two months in the beginning of the pandemic, but then The Today Show ran a repeat of an  episode I was on, and people started reaching out again.\n I&#39;ve always worked from home, so not too much has changed. I start off the work day by messaging/responding to prospects on behalf of my  Whole Shebang clients, send friendly clients reminders to respond to matches and schedule dates, create profiles, review photos, and do a lot of swiping.\n   From 4 p.m. to 7 p.m. I have family time and then I&#39;m back working from 7 p.m. to 11 p.m. ghostwriting and editing.\n The pandemic has been an isolating period for a lot of people and now they are starting to gear up to get back out there. Sometimes it&#39;s just easier to get in the passenger seat and let someone else drive in the beginning — and I&#39;m always ready to take the wheel.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-11-16 08:05:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,应用程序,app,约会", "title": "我是一个约会应用程序资料的代写人，假装是网上的客户", "title_en": "I'm a dating app profile ghostwriter who pretends to be clients online", "transed": 1, "url": "https://www.businessinsider.com/job-diary-dating-app-profile-ghostwriter-helps-clients-online-2020-11", "via": "", "real_tags": ["程序", "应用程序", "app", "约会"]}]