[{"category": "", "categoryclass": "", "imagename": "f0a6fbd47b803ac88ec1ae5aa6b3d342.png", "infoid": 1067692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请在升级之前查看升级指南。在下面的打破变化部分中描述的特殊方案中有很少的破坏变化。\n     您还可以将Hasura元数据存储在由环境变量hasura_graphql_metadata_database_url给出的单独（postgres）数据库中\n  服务器概括为支持不同的数据库。我们通过为MS SQL Server和BigQuery提供只读支持来开始。\n      支持从GraphQL查询模板创建Idiomatic REST API端点，以便用户可以轻松支持非GraphQL客户端，并与其现有的REST工具集成。\n   权限系统已扩展到远程模式。您可以通过远程模式进行类型/字段屏蔽和预设参数（使用会话变量）。\n      您现在可以创建一个继承的角色，允许您将多个角色组合成一个角色（以添加方式）。这解决了许可系统的基本问题（如＃877和＃3442中所述），并且还可以帮助您以模块化方式管理角色。\n  在第一个版本中，仅在继承角色下公开postgres查询和订阅。 \nPS：继承角色是目前是一个实验特征。要启用继承的角色，请使用环境变量hasura_graphql_experish_features启动Hasura服务器：＆＃34;继承_＆＃34;\n   考虑两个表，项目（ID，名称，库存）和Shopping_cart（ID，Item_ID，数量），这两个表通过Item_ID列与。现在，在Shopping_cart表上定义INSERT权限时，只有在项目表中存在足够的库存时，才会检查才能将物品插入购物车。\n   现在支持使用Ltree，LQuery或LTXTQUERY类型的列上的比较运算符，用于搜索存储在层次结构树状结构中的数据。\n   MS SQL Server中的空间数据类型，几何和地理上的比较运算符现在支持。支持以下运营商：\n   我们现在支持使用ST_3DDWithin和ST_3DINtersects的功能在布尔表达式中使用。请注意，ST_3DINtersects需要使用SFCGAL支持构建POSTGIS，这可能取决于所使用的Partgis分布。\n  服务器：将请求字段添加到包含GraphQL查询/突变，其名称和通过的任何变量的Webhook Post Body（关闭＃2666）\n  服务器：无法再执行的一些突变将不再在模式中（例如，删除_PK突变＆＃39; t未在所有主键上选择权限的用户显示）（＃4111） \n服务器：可配置的WebSocket保持活动间隔。 添加--websocket -keepalive命令行标志和hasura_graphql_websocket_keekalive env变量（修复＃3539）  服务器：在表配置中引入可选的自定义表名，以根据自定义名称跟踪表。 已弃用set_table_custom_fields API，已添加新的API Set_Table_Customization以设置配置。 （＃3811）  服务器：支持将int或字符串标量类型连接到远程关系中的ID标量类型  服务器：各种更改，以确保在SIGTERM信号时及时清理背景线程和其他资源。  服务器：修复问题触发器在分区的表上定义的事件触发器（修复＃6261）  服务器：操作阵列关系现在支持与常用关系相同的输入参数（例如Where或Distinct_on）  服务器：修复在GraphQL-Engine中添加的远程模式的非可选模式的问题（修复＃6401） \n服务器：在JWT Config中接受新配置_SKSW，为JWT到期（修复＃2109）提供Leeway\n 服务器：始终以查询日志和http-log的detode.request_id路径记录request_id（＃6244）\n  服务器：如果从池中获取连接的时间超过可配置超时（＃6326），请终止请求\n      服务器：在远程关系＆＃39; s加入字段定义的自定义GraphQL名称时修复问题（修复＃6626）\n    服务器：删除仅支持基本类型函数参数的限制。具有表类型的参数的类型现在是＆lt; tablename＆gt; _scalar以避免与对象类型冲突＆lt; tablename＆gt ;.\n 服务器：添加--Async-actions-fetch-interning命令行标志和hasura_graphql_async_actions_fetch_interval环境变量，用于配置异步操作从元数据存储重新获取间隔（修复＃6460）\n    服务器：更新PG_DUMP清洁输出以禁用创建功能语句中的函数正文验证，以避免由于前进引用而导致的错误 \n服务器：添加＆＃34;善良＆＃34;字段查询日志项。善良可以是＆＃34;数据库＆＃34 ;,＃34;行动＆＃34 ;,＆＃34;远程模式＆＃34 ;,＆＃34; graphql＆＃34 ;,＆＃34;缓存和＃34 ;,或＃34;订阅＆＃34;\n   服务器：接受一个新的enc cenf hasura_graphqql_events_fetch_batch_size来配置从单个批处理中从事件日志表中获取的行数\n 服务器：在事件触发处理中恢复适当的批处理行为，以便一次在大多数2倍批处理事件中签出\n    服务器：仅在需要时初始化HDB_Catalog表，并且仅运行所需的源的事件循环\n         服务器：修复BIGINT溢出，在事件触发有效载荷中不正确的地质json格式（修复＃3697）（修复＃2368）\n  服务器：由GraphQL-Engine生成时转发X-Request-ID标题（而不是用户提供）（修复＃6654）\n 服务器：介绍--graceful-shutdown-timeout服务器配置，将在关闭之前等待机上计划和事件触发事件和异步操作以完成 \n服务器：Sanitize事件触发和计划触发日志以省略可能敏感的请求身体和标头  服务器：修复查询验证中的错误，这些错误会使用默认变量值拒绝（修复＃6867）  SERVER：SQL Server和BigQuery（Console Pending）上支持远程关系（数据库到远程模式连接）  服务器：BigQuery：从Dataloader方法切换到单个查询生成。 这应该导致更快的查询响应。  控制台：添加选项要将插入作为数据部分的迁移（关闭＃1766）（＃4933）  控制台：在表中具有非小写名称和评论时修复Postgres表创建（＃6760）  控制台：显示表格和Cloumn名称超过63个字符的错误通知，并缩减迁移名称超过255个字符 \n控制台：在列上添加修改功能，主键＆amp; 对MS SQL Server表的唯一键  CLI：CLI-EXT现在是CLI二进制的本机部分（不再需要作为插件）  CLI：Add --all-DatabaseS标志用于迁移应用，这允许在所有连接的数据库上应用迁移  CLI：FIX回归 - 元数据应用 - 运行在服务器上覆盖本地元数据文件时，它应该只显示差异  构建：将test_server_pg_13添加到CI以在Postgres V13上运行服务器测试（＃6070）  根据第704期间的讨论，比较输入对象中的显式空值将被视为错误，而不是导致正在评估为true的表达式。  例如：突变DELETE_USERS（其中：{id：{{_eq：$ userid}}）{name}如果$ userid为null，则会产生错误，而不是删除所有用户。 \n在远程模式关系查询中，当所有连接参数都不为空值时，将查询远程模式。当存在空值时，远程架构Won＆＃39;要查询，远程关系字段的响应将为null。早先，使用空值参数查询远程架构，响应依赖于远程模式如何处理空头参数但根据用户反馈，此行为显然不会预期。\n Order_by运算符将一个对象数组接受作为输入的输入，以便在给定顺序中按多个字段排序，即[{field1：sortorder}，{field2：sortorder}]，但它也接受一个具有多个键作为输入的单个对象， IE {field1：sortorder，field2：sortorder}。在早期版本中，HASURA＆＃39; s查询解析逻辑用于在输入对象中的键中保持键顺序，因此生成了与正确顺序的字段的适当顺序。\n 由于输入对象键的GraphQL规范提及是无序的，但新的和更严格查询解析逻辑并在输入对象中删除所生成的顺序的输入对象中的键顺序在给定的顺序中拥有字段。\n 例如：查询fetch_users（Order_by：{年龄：desc，name：asc}）{id name年龄}旨在获取由年龄命令的用户订购，然后通过他们的名称来保证首先按年龄排序返回结果然后通过他们的名称作为Order_by input作为对象传递。为了实现预期的行为，应使用以下查询fetch_users（Order_by：[{age：desc}，{name：asc}）{id name age}使用数组来定义字段顺序以生成相应的顺序按条款。\n 计算的字段参数的名称已从＆lt; compancy_name＆gt更改为＆gt; computed_field_name＆gt; _＆lt; table_name＆gt; _args作为函数名称是计算字段的内部详细信息。此更改还可以将根级跟踪函数添加为先前抛出输入类型冲突错误的计算字段。\n 由较旧的Hasura版本生成的Hasura API不能将远程模式添加到Hasura v2\n 使用v2.0，已扩展了一些自动生成的架构类型。例如，String_Comparison_exp具有另外的正则表达式输入对象字段。这意味着如果您有一个带有较旧的Hasura版本的Hasura API，则添加为远程模式，那么它将具有类型冲突。您应该升级所有Hasura远程模式以避免此类冲突。 \n在应用多个迁移时，在早期的Hasura CLI版本中，所有迁移文件都在一个事务块下运行。即，如果任何迁移抛出错误，则将滚动所有先前成功的迁移。使用Hasura CLI v2.0，每个迁移文件都在自己的事务块中运行，但所有迁移都不会在其中执行。即，如果任何迁移抛出错误，将停止应用进一步的迁移，但另一个成功执行的迁移到该点不会退回。\n 在v2.0中，使用以下env变量的值来在更新现有实例或开始新实例时定义默认数据库的连接参数。在元数据初始化期间，它们的值将移动到默认数据库的元数据，如此处定义。\n  发布初始设置/更新一旦初始化元数据，这些env变量可以被视为已弃用。即，这些env变为的变化或设置值将没有影响，因为现在使用Hasura元数据的值来定义连接参数。 ", "note_en": "Please check the  upgrade guide before upgrading. There are few breaking changes in special scenarios which are described in  Breaking changes section below.\n     You can also store Hasura metadata in a separate (Postgres) database given by the environment variable  HASURA_GRAPHQL_METADATA_DATABASE_URL\n  The server has been generalized to support different databases. We start off by providing read-only support for MS SQL server and BigQuery.\n      Support for creating idiomatic REST API endpoints from GraphQL query templates so that users can support non-GraphQL clients easily and integrate with their existing REST tooling.\n   The permission system has been extended for Remote Schemas. You can do type/field masking and preset arguments (with session variables) over remote schemas.\n      You can now create an  Inherited Role which allows you to combine multiple roles into one role (in an additive way). This solves fundamental problems with permission system (as described in  #877 and  #3442) and also helps you manage roles in a modular way.\n  In the first version, only Postgres queries and subscriptions are exposed for an inherited role.\n PS: Inherited roles is currently an experimental feature. To enable inherited roles, start the Hasura server with environment variable  HASURA_GRAPHQL_EXPERIMENTAL_FEATURES: &#34;inherited_roles&#34;\n   Consider two tables,  items(id, name, stock) and  shopping_cart(id, item_id, quantity) and these two tables are related via the  item_id column. Now, while defining insert permission on the  shopping_cart table, there can be a check to insert an item into the shopping cart only when there is enough  stock present in the  items table.\n   Comparison operators on columns with  ltree,  lquery or  ltxtquery types are now supported, for searching through data stored in a hierarchical tree-like structure.\n   Comparison operators on spatial data types, geometry and geography, are now supported in MS SQL Server. The following operators are supported:\n   We now support the use of the functions  ST_3DDWithin and  ST_3DIntersects in boolean expressions. Note that  ST_3DIntersects requires PostGIS be  built with SFCGAL support which may depend on the PostGIS distribution used.\n  server: add request field to webhook POST body containing the GraphQL query/mutation, its name, and any variables passed (close  #2666)\n  server: some mutations that cannot be performed will no longer be in the schema (for instance, delete_by_pk mutations won&#39;t be shown to users that do not have select permissions on all primary keys) ( #4111)\n   server: Configurable websocket keep-alive interval. Add --websocket-keepalive command-line flag and HASURA_GRAPHQL_WEBSOCKET_KEEPALIVE env variable (fix  #3539)\n server: introduce optional custom table name in table configuration to track the table according to the custom name. The set_table_custom_fields API has been deprecated, A new API set_table_customization has been added to set the configuration. ( #3811)\n server: support joining Int or String scalar types to ID scalar type in remote relationship\n   server: various changes to ensure timely cleanup of background threads and other resources in the event of a SIGTERM signal.\n server: fix issue with event triggers defined on a table which is partitioned (fixes  #6261)\n server: action array relationships now support the same input arguments (such as where or distinct_on) as usual relationships\n  server: fix issue with non-optional fields of the remote schema being added as optional in the graphql-engine (fix  #6401)\n server: accept new config allowed_skew in JWT config to provide leeway for JWT expiry (fixes  #2109)\n server: always log the request_id at the detail.request_id path for both query-log and http-log ( #6244)\n  server: terminate a request if time to acquire connection from pool exceeds configurable timeout ( #6326)\n      server: fix issue when a remote relationship&#39;s joining field had a custom GraphQL name defined (fix  #6626)\n    server: remove the restriction of supporting only base type function arguments. The type of an argument with a table type is now  &lt;tablename&gt;_scalar to avoid conflicts with the object type  &lt;tablename&gt;.\n server: add  --async-actions-fetch-interval command-line flag and  HASURA_GRAPHQL_ASYNC_ACTIONS_FETCH_INTERVAL environment variable for configuring async actions re-fetch interval from metadata storage (fix  #6460)\n    server: update pg_dump clean output to disable function body validation in create function statements to avoid errors due to forward references\n    server: add &#34;kind&#34; field to query-log items. Kind can be &#34;database&#34;, &#34;action&#34;, &#34;remote-schema&#34;, &#34;graphql&#34;, &#34;cached&#34;, or &#34;subscription&#34;\n   server: accept a new env conf  HASURA_GRAPHQL_EVENTS_FETCH_BATCH_SIZE to configure the number of rows being fetched from the events log table in a single batch\n server: restore proper batching behavior in event trigger processing so that at most 2x batch events are checked out at a time\n    server: initialise  hdb_catalog tables only when required, and only run the event loop for sources where it is required\n         server: fix bigint overflow, incorrect geojson format in event trigger payload (fix  #3697) (fix  #2368)\n  server: forward the x-request-id header when generated by graphql-engine (instead of being user-provided) (fix  #6654)\n server: introduce  --graceful-shutdown-timeout server config which will wait for the in-flight scheduled and event trigger events and async actions to complete before shutting down\n server: sanitise event trigger and scheduled trigger logs to omit possibly sensitive request body and headers\n   server: fix a bug in query validation that would cause some queries using default variable values to be rejected (fix  #6867)\n       server: remote relationships (database to remote schema joins) are now supported on SQL Server and BigQuery (console pending)\n server: BigQuery: switches to a single query generation from a dataloader approach. This should result in faster query responses.\n      console: add option to flag an insertion as a migration from Data section (close  #1766) ( #4933)\n                 console: fix Postgres table creation when table has a non-lowercase name and a comment ( #6760)\n              console: show error notification for table and cloumn names exceeding 63 characters and trim migration names exceeding 255 characters\n    console: add modify functionality on columns, primary keys &amp; unique keys to MS SQL Server tables\n        cli: cli-ext is now a native part of cli binary (no longer needed as a plugin)\n   cli: add  --all-databases flag for  migrate apply, this allows applying migrations on all connected databases in one go\n  cli: fix regression -  metadata apply —dry-run was overwriting local metadata files with metadata on server when it should just display the differences\n               build: add test_server_pg_13 to the CI to run the server tests on Postgres v13 ( #6070)\n  According to the discussion in  issue 704, an explicit  null value in a comparison input object will be treated as an error rather than resulting in the expression being evaluated to  True.\n For example: The mutation  delete_users(where: {id: {_eq: $userId}}) { name } will yield an error if  $userId is  null instead of deleting all users.\n In a remote schema relationship query, the remote schema will be queried when all of the joining arguments are not  null values. When there are  null value(s), the remote schema won&#39;t be queried and the response of the remote relationship field will be  null. Earlier, the remote schema was queried with the  null value arguments and the response depended upon how the remote schema handled the  null arguments but as per user feedback, this behaviour was clearly not expected.\n The  order_by operator accepts an array of objects as input to allow ordering by multiple fields in a given order, i.e.  [{field1: sortOrder}, {field2: sortOrder}] but it is also accepts a single object with multiple keys as an input, i.e.  {field1: sortOrder, field2: sortOrder}. In earlier versions, Hasura&#39;s query parsing logic used to maintain the order of keys in the input object and hence the appropriate  order by clauses with the fields in the right order were generated .\n As the  GraphQL spec mentions that input object keys are unordered, Hasura v2.0&#39;s new and stricter query parsing logic doesn&#39;t maintain the order of keys in the input object taking away the guarantee of the generated  order by clauses to have the fields in the given order.\n For example: The query  fetch_users(order_by: {age: desc, name: asc}) {id name age} which is intended to fetch users ordered by their age and then by their name is now not guaranteed to return results first ordered by age and then by their name as the  order_by input is passed as an object. To achieve the expected behaviour, the following query  fetch_users(order_by: [{age: desc}, {name: asc}]) {id name age} should be used which uses an array to define the order of fields to generate the appropriate  order by clause.\n The name of the computed field argument has changed from  &lt;function_name&gt;_args to  &lt;computed_field_name&gt;_&lt;table_name&gt;_args as the function name is internal detail for a computed field. This change also enables adding a root-level tracked function as a computed field which previously would have thrown input type conflict error.\n Hasura APIs generated by older Hasura versions cannot be added as Remote Schemas to Hasura v2\n With v2.0, some of the auto-generated schema types have been extended. For example,  String_comparison_exp has an additional  regex input object field. This means if you have a Hasura API with an older Hasura version added as a remote schema then it will have a type conflict. You should upgrade all Hasura remote schemas to avoid such type conflicts.\n While applying multiple migrations, in earlier Hasura CLI versions all migration files were run under one transaction block. i.e. if any migration threw an error, all the previously successfully executed migrations would be rolled back. With Hasura CLI v2.0, each migration file is run in its own transaction block but all the migrations are not executed under one. i.e. if any migration throws an error, applying further migrations will be stopped but the other successfully executed migrations up till that point will not be rolled back.\n In v2.0, the values of the following env vars are used to define the connection parameters of the  default database while updating an existing instance or while starting a fresh instance. During metadata initialization, their values are moved to the metadata of the  default database as defined  here.\n  Post the initial setup/update once the metadata is initialized, these env vars can be considered as deprecated. i.e. changing or setting values of these env vars will have no impact as the values in the Hasura metadata are now used to define the connection parameters.", "posttime": "2021-06-23 21:14:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "graphql,graphcell,服务器", "title": "HASURA GraphCell Engine 2.0 ", "title_en": "Hasura GraphQL Engine 2.0", "transed": 1, "url": "https://github.com/hasura/graphql-engine/releases/tag/v2.0.0", "via": "", "real_tags": ["graphql", "graphcell", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试全数字访问，了解为什么超过100万读者订阅FT  选择购买审判订阅$ 1持续4周，您将在审判结束后每月收费91美元  4周接收无限的优质数字访问FT＆＃39; S值得信赖，获奖的商业新闻  礼品文章 - 每月分享最多10条与家人，朋友和同事 ", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-06-23 21:14:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,民主,kong,订阅", "title": "香港民主小报苹果每天关闭 ", "title_en": "Hong Kong pro-democracy tabloid Apple Daily to shut down", "transed": 1, "url": "https://www.ft.com/content/1eec04cb-bc7d-497b-9c87-4518355b5fc6", "via": "", "real_tags": ["苹果", "apple", "民主", "kong", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "ac47bd9ae7ffd39361a85c87a05d50c5.png", "infoid": 1067690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们比以往任何时候都拍摄更多照片。根据Infotrends，这已经是天文部门的增长是爆炸性的，拍摄了超过1.4万亿的照片。从2017年的1万亿美元起。视频与YouTube近年来的视频相同，大约需要500小时的视频每一分钟到平台。\n 寻找解决这些珍贵记忆的解决方案比以往任何时候都更重要，而且它成为一个越来越大的解决问题。照片描绘了一个特殊的时刻，一个可以＆＃39; t的记忆或事件被重新创建。它们是不可替代的，在很大程度上只存在数字。因此，很少有几个类别的数据，适合自由和开放的自托管解决方案。\n 纯粹主义者会争辩说你的照片是你的，你应该永远拥有它们，无论什么，全部决议。实用主义者将争辩说，只要出口工具足够好，纯度并不重要。然而，对于许多日常照片服务用户，这是所有学术思想实验 - 大多数人都使用Google照片。这项服务两年前通过了十亿用户。 （顺便说一下，在Google照片上导出意味着使用Google Rakout。我一直在等待我所要求的数据七天的撰写。）\n  但本月，选择重新打开了许多互联网用户。截至6月1日，2021年6月，上传到Google照片的任何新照片和视频都将开始计入您的Google存储配额。以前感到永无止境的空间现在是有限的一些帐户。现有的高质量照片和视频免于这种变化，但此举有很多人，我包括，思考替代品。\n    具体而言，我一直在考虑自托管的照片管理替代品 - 特别是那些Web Apps的照片。\n  照片管理是一个主题的Juggernaut，它对不同的人意味着不同的东西。例如，专业的摄影师＆＃39;只有在他们的手机上采取自拍照的人之外的波兰人。\n 下面的每个应用程序都有其优点和缺点。在撰写本文时，我们认为您＆＃39;重新找到一个魔法＆＃34;一个尺寸适合所有＆＃34;选项。但是，在一起的一些应用程序可能会导致连贯的工作流程，使谷歌照片不那么痛苦。 \n您也可以将沟通谷歌照片视为一个机会。尝试以下工具作为自主照片管理世界的底漆，并将您暴露给最令人兴奋的Google照片替代品。这个空间正在迅速发展，我们＆＃39; d建议使用DEMOS大多数项目提供，以便在进行之前为自己评估应用程序。\n 我们故意忽略了像Adobe Lightroom，Darktable和Digikam等更多桌面以桌面为中心的应用程序。毕竟，Google照片是一个Web应用程序，所以这里正在测试的软件遵循同样的范式。\n  有无数的主流应用程序或服务的例子，我们依赖于在工资空中（You＆＃39; Ve Seed Ars＆＃39;奥谷歌杀死产品＆＃34;系列，右边的持续或放置一毫无免费的功能。因此，对于许多自主旅馆，使用开源的东西是一个基本要求。在一个自主托管团结的情况下，我们＆＃39; LL也主要专注于今天的开源软件。\n  也许是你＆＃39;在一个受到＆＃34的故事中的这一点上面做到了这一点;秋季＆＃34;谷歌照片并简单地想到自己，＆＃34;良好的riddance。＆＃34;但是，在2015年在2015年推出的服务以来，Google照片已成为许多事实上的照片管理软件的原因。\n    谷歌照片大多数人都有大多数人都想要这种类型的软件，它可以合理且轻松地完成这些事情。\n Google照片具有可搜索的对象和面部识别，专辑支持，移动设备的自动备份，以及具有粒度权限的简单照片共享，以及其他功能。该服务支持照片，实时照片和视频。并且通过允许人们通过日期，地点，对象或人员搜索他们的越来越多的图书馆，谷歌解决了单一行程的组织问题。\n 谷歌＆＃39;大规模的大部分是最重要的。它＆＃39; s允许公司培训其机器学习算法以了解A＆＃34之间的差异;山＆＃34;和一个＆＃34;树＆＃34;如此准确地或为这些算法学习您的照片中的面孔。然而，谷歌＆＃39;然而，SCALE也提出了关于隐私的问题。该公司表示，＆＃34;隐私是我们所做的一切的核心，＆＃34;它并不使用Gmail，Dri​​ve，Calendar或照片等个人产品中的数据以供广告目的。一个奇迹谷歌确实使用该数据。此外，元数据往往比数据本身更强大。 \n＆＃34;因为你们这么多人依赖于Google照片......它的重要性是它能够在长途运输中为您服务，＆＃34; Google照片产品领导David Lieb在Twitter上倒下了。 我想相信Google照片将在50年内左右，但鉴于谷歌＆＃39;杀死产品的轨道记录，感觉就像一个冒险的赌注。  所以是的，谷歌照片很好。 但我们可以信任我们的数据吗？ 只要我们需要它，服务就会围绕服务？ 在什么费用？ 这些是用户通过哪个镜头开始查看自托管解决方案。 ", "note_en": "We take more photos now than ever before. Growth in this already astronomical segment is explosive, with over 1.4 trillion photos taken last year, according to InfoTrends. That&#39;s up from 1 trillion in 2017. Video is much the same, with YouTube  saying in recent years that about 500 hours of video is uploaded to the platform  every minute.\n Finding a solution to organizing and safely storing these precious memories is more important than ever, and it&#39;s becoming an increasingly large problem to solve. Photos depict a special moment in time, a memory or event that can&#39;t be recreated. They are irreplaceable and largely only exist digitally. Because of this, there are few categories of data that suit a free and open self-hosted solution better.\n Purists will argue that your photos are yours and you should own them forever, no matter what, in full resolution. Pragmatists will argue that so long as the export tools are good enough, purity doesn&#39;t matter. For many day-to-day photo service users, though, that was all an academic thought experiment—most people use Google Photos. The service  passed a billion users two years ago. (Exporting on Google Photos, by the way, means using  Google Takeout. I&#39;ve been waiting for my requested data for seven days as of this writing.)\n  But this month, the choice reopens for many Internet users.  As of June 1, 2021, any new photos and videos uploaded to Google Photos will begin to count against your Google storage quota. Space that previously felt never-ending is now finite for some accounts. Existing high-quality photos and videos are exempt from this change, but the move has a lot of people, me included, thinking about alternatives.\n    Specifically, I&#39;ve been thinking about self-hosted photo management alternatives—particularly those with web apps.\n  Photo management is a juggernaut of a topic, and it means different things to different people. For example, a professional photographer&#39;s needs are poles apart from those of people taking selfies on their cell phones.\n Each app below has its pros and cons. At the time of writing, we think you&#39;re unlikely to find a magic &#34;one size fits all&#34; option. But stringing a few apps together might result in a coherent workflow that makes leaving Google Photos less painful.\n You can also look at ditching Google Photos as an opportunity. Trying out the following tools serves as a primer for the world of  self-hosted photo management and exposes you to the most exciting Google Photos alternatives. This space is developing rapidly, and we&#39;d advise making use of the demos most projects provide to evaluate the apps for yourself before proceeding.\n We&#39;ve deliberately ignored more desktop-focused apps like  Adobe Lightroom,  Darktable, and  digiKam. Google Photos is a web app, after all, so the software being tested here follows that same paradigm.\n  There are countless examples of mainstream applications or services we rely on becoming obsolete or placing once-free features behind a paywall (you&#39;ve seen Ars&#39; ongoing &#34; Google Kills Product&#34; series, right?). So for many self-hosters, using something that is  open source is a fundamental requirement. In a show of self-hosting solidarity, we&#39;ll also focus primarily on open source software today.\n  Perhaps you&#39;ve made it to this point in a story inspired by the &#34;fall&#34; of Google Photos and simply thought to yourself, &#34;Good riddance.&#34; But there&#39;s a reason why Google Photos has become the de facto photo-management software for many since the service launched in 2015.\n    Google Photos does most things most people want from this type of software, and it does those things reasonably well and easily.\n Google Photos has searchable object and face recognition, album support, automatic backup from mobile devices, and simple photo sharing with granular permissions, among other features. The service supports photos, live photos, and videos all the same. And by allowing folks to search their growing libraries by date, place, object, or person, Google solved the problem of organization with a single stroke.\n Google&#39;s massive scale is what makes most of this possible. It&#39;s what allows the company to train its machine-learning algorithms to know the difference between a &#34;mountain&#34; and a &#34;tree&#34; so accurately or for those algorithms to learn which faces are in your photos. Google&#39;s scale also raises questions about privacy, however.  The company says that &#34;privacy is at the heart of everything we do,&#34; and it doesn&#39;t use data in personal products like Gmail, Drive, Calendar, or Photos for advertising purposes. One wonders what Google does use that data for, though. Plus, metadata is often more powerful than the data itself.\n &#34;Since so many of you rely on Google Photos... it&#39;s important that it is able to serve you over the long haul,&#34; Google Photos product lead David Lieb  wrote on Twitter last fall. I want to trust that Google Photos will be around in 50 years, but that feels like a risky bet given Google&#39;s track record for killing products.\n So yes, Google Photos is good. But can we trust our data to it? And will the service be around for as long as we need it to be? At what cost? These are the lenses through which a user starts looking at self-hosted solutions.", "posttime": "2021-06-23 20:38:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,2020,照片,hosted", "title": "谷歌照片是如此2020-欢迎来到自主照片管理世界 ", "title_en": "Google Photos is so 2020—welcome to the world of self-hosted photo management", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/the-big-alternatives-to-google-photos-showdown/", "via": "", "real_tags": ["google", "谷歌", "2020", "照片", "hosted"]}, {"category": "", "categoryclass": "", "imagename": "4467c7a11f58139a401be8a4630b1b02.png", "infoid": 1067689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于旧金山的创业公司已筹集了1900万美元的统一，由Norwest Venture Partners领导。第一轮资本，设计师资金和涂鸦企业也参加了筹款，将用于继续投资产品和招聘：该公司现在拥​​有20本书，旨在将在今年年底之前加倍，在市场积极招待会的高跟鞋。\n 自去年正式推出以来，拟理已拿到100多家客户，初步关注自己的后院的快速扩展公司，这是一个D＆amp的标志;我特别在科技行业中焦点。那些使用人种进行比较和弄清楚赔偿的人包括Instacart，Scale.ai和Clearco，而该公司在过去的四个月中表示，该平台已被用来制作5,000个职位优惠。\n   CEO与Warren Lebovics（右图）共同创立的首席执行官Kaitlyn Knopp提出了拟理的想法，同样地相同的方式，即在企业世界中的许多创新来到市场：通过她自己的第一个 - 制造经验。\n 她花了十年的湾区就业补偿，在谷歌，Instacart和巡航中有了以前的角色。在那个时候，她发现了许多公司使用的工具缺乏，只在赔偿分析时缺乏“笨拙”。\n “到目前为止，市场工作的方式是平台作为一个元素的赔偿，而不是重点，”她说。 “这是标记线的末尾，候选人的”CRM的最后一部分“。但是你仍然必须填补所有的空白，你必须以正确的方式设置架构。随着薪酬，您必须在您自己的分析中烘焙，这意味着您必须拥有一些专业知识。“\n 事实上，与企业软件的其他方面一样，她补充说，这是最大的科技公司有时曾在自己的工具上工作，但不仅会留下更小或以其他方式以其他焦点的业务留出更好的计算工具，而且还意味着那些工具是孤独的，被扭曲的是工作世界的大量的塑造。 “我们想采取这个过程并拥有它。”\n Pequity产品基本上是通过插入HR Professional可能正在使用的所有其他工具 -  HRIS，ATS和工资单产品 - 在整个组织中管理薪水，以分析和比较赔偿如何寻找现有和潜在的员工。它结合了公司自己的数据，然后将其与来自更广泛市场的数据进行比较，包括典型的行业范围和市场趋势，为人力资源团队提供见解。 \n所有这一切都意味着人力资源团队能够做出更明智的决策，这是一个更加透明和公平的步骤编号，但也是拟理的优化，以专门涵盖其在团队中衡量补偿的优化。\n 并且符合这一点，knopp还想要在独立产品中寻址的补偿性思维方式，这是构建具有任务的工具的想法，一个可以提供可以带来数据的平台透明和公平的决定。\n “我互动的很多Comp工具都是反应的，”她说。 “您可能需要做，例如付费股权测试，您可以进行促销和优点周期，然后找到您必须解决的所有这些问题。我们正在通过我们的分析主动地将这些事情标记为我们的分析，因为我们将在这些系统中插入，这将在决定之前给您那些警报。“\n 作为这种方向的一个额度阶段，Knopp表示，最终她认为该工具应该是人力资源之外的那些，例如管理者和euployees本身，应该能够更好地了解自己补偿的逻辑并有更多信息进入任何谈判。\n 最终，看看现代化的产品是否像撒尿一样，这将是有趣的，这些产品正在解决新的方法和观点，在更广泛的市场中找到牵引力。如果人力资源中的一个目的是解决多样性和包含，那么这些问题的一部分是工具只是不适合该目的，那么我们似乎将看到更多的组织尝试新事物来看待新事物如果他们可以帮助他们自己的种族来保护人才。\n “赔偿反映了公司的价值观，影响其雇用人才的能力，并且是其P＆amp的最大费用。然而，大多数CoMP团队在电子表格和电子邮件上运行，“纳尔韦斯特，在诺尔韦斯特，在一个声明中。 “PEQUITY EMPOWERS COMPOW团队设计和管理具有由Comp专业人士设计的现代软件的公平薪酬计划，用于Comp专业人士。” ", "note_en": "The San Francisco-based startup has raised $19 million in a Series A led by Norwest Venture Partners. First Round Capital, Designer Fund, and Scribble Ventures also participated in the fundraise, which will be used to continue investing in product and also hiring: the company has 20 on its own books now and will aim to double that by the end of this year, on the heels of positive reception in the market.\n Since launching officially last year, Pequity has picked up over 100 customers, with an initial focus on fast-scaling companies in its own backyard, a mark of how D&amp;I have come into focus in the tech industry in particular. Those using Pequity to compare and figure out compensation include Instacart, Scale.ai and ClearCo, and the company said that in the last four months, the platform’s been used to make more then 5,000 job offers.\n   Kaitlyn Knopp, the CEO who co-founded the company with Warren Lebovics (both pictured, right), came up for the idea for Pequity in much the same way that many innovations in the world of enterprise IT come to market: through her own first-hand experience.\n She spent a decade working in employment compensation in the Bay Area, with previous roles at Google, Instacart, and Cruise. In that time, she found the tools that many companies used were lacking and simply “clunky” when it came to compensation analysis.\n “The way the market has worked so far is that platforms had compensation as an element but not the focus,” she said. “It was the end of the tagline, the final part of a ‘CRM for candidates.’ But you still have to fill in all the gaps, you have to set the architecture the right way. And with compensation, you have to bake in your own analytics, which implies that you have to have some expertise.”\n Indeed, as with other aspects of enterprise software, she added that the very biggest tech companies sometimes worked on their own tools, but not only does that leave smaller or otherwise other-focused businesses out of having better calculation tools, but it also means that those tools are siloed and miss out on being shaped by a bigger picture of the world of work. “We wanted to take that process and own it.”\n The Pequity product essentially works by plugging into all of the other tools that an HR professional might be using — HRIS, ATS, and payroll products — to manage salaries across the whole of the organization in order to analyse and compare how compensation could look for existing and prospective employees. It combines a company’s own data and then compares it to data from the wider market, including typical industry ranges and market trends, to provide insights to HR teams.\n All of this means that HR teams are able to make more informed decisions, which is step number one in being more transparent and equitable, but is also something that Pequity is optimized to cover specifically in how it measures compensation across a team.\n And in line with that, there is another aspect of the compensation mindset that Knopp also wanted to address in a standalone product, and that is the idea of building a tool with a mission, one of providing a platform that can bring in data to make transparent and equitable decisions.\n “A lot of the comp tools that I’ve interacted with are reactive,” she said. “You may have to do, say, a pay equity test, you do your promotion and merit cycles, and then you find all these issues that you have to solve. We’re flagging those things proactively with our analytics, because we’re plugging into those systems, which will give you those alerts before the decisions need to be made.”\n As an added step in that direction, Knopp said that ultimately she believes the tool should be something that those outside of HR, such as managers and emploiyees themselves, should be able to access to better understand the logic of their own compensation and have more information going into any kind of negotiation.\n Ultimately, it will be interesting to see whether modernized products like Pequity, which are tackling old problems with a new approach and point of view, find traction in the wider market. If one purpose in HR is to address diversity and inclusion, and part of the problem has been that the tools are just not fit for that purpose, then it seems a no-brainer that we’ll see more organizations trying out new things to see if they can help them in their own race to secure talent.\n “Compensation reflects a company’s values, affects its ability to hire talent, and is the biggest expense on its P&amp;L. And yet, most comp teams run on spreadsheets and emails,” said Parker Barrile, Partner at Norwest, in a statement. “Pequity empowers comp teams to design and manage equitable compensation programs with modern software designed by comp professionals, for comp professionals.”", "posttime": "2021-06-23 20:37:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旨在,compensation", "title": "Pequity，旨在提供更公平的薪酬的补偿平台，提高了1900万美元 ", "title_en": "\n\t\t\t\tPequity, a compensation platform designed for more equitable pay, raises $19M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/pequity-a-compensation-platform-designed-for-more-equitable-pay-raises-19m/", "via": "", "real_tags": ["旨在"]}, {"category": "", "categoryclass": "", "imagename": "001edc646b15af01e97c68d8171ae871.jpg", "infoid": 1067688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于许多原因，这一轮是值得注意的。首先，即使是今天的标准也是一个大的系列。融资还标志着以前在其七年历史中引发了较低的较低的外部资金。较低的是初创世界上这些天的罕见：有利可图。基于硅谷的Accel历史悠久，营业盈利，抢夺公司，也为1Password，阿特拉斯人，高音乐，网络流，工友和伽利略（由SOFI获得）的相似之处。\n 事实上，伽利略创始人粘土威尔克斯将VC公司推出到Dan Snyder，下的创始人和首席执行官。除了有利可图之外，这两家公司还有一些共同的事情：在采取机构资本之前，他们都在举行多年，两者都有总部在硅谷外面。\n  “我们立即感兴趣，因为基于俄亥俄州的较低呼应，”John Locke的Accel Partner John Locke说，较低，并作为投资的一部分占据公司董事会的席位。 “就像伽利略一样，较低的将是全球最成功的投机公司之一。在全球范围内的非传统区域内建造的公司的组合和一个引导的公司提醒我们​​[其他]我们与大型系列合作的公司。“\n 据较低，还有其他未命名的参与者，但加权为投资的“大多数”提供。\n Snyder于2014年共同创立了更低，目标是为消费者制作房屋过程更简单。该公司随招待所推出，其零售品牌认为，斯奈德描述为“一种技术杠杆零售抵押贷款银行”，与房地产经纪人和建筑物等。 2018年，该公司推出了较低的网站，其直接消费者数字贷款品牌具有使其平台的使命是一个停机者可以在线上网，以保存家庭，获得或再融资抵押贷款并获得保险通过其市场。今年，它推出了带有储蓄账户的下移动应用程序。\n  多年来，据斯奈德称，下降数十亿美元在贷款中获得数十亿美元的贷款，并在2020年在2020年举行令人印象深刻的收入。\n “我们的历史可能是今天Fintech公司的一点非典型，”他告诉TechCrunch。 “我们有一个看法回到公司的开始，我们希望有利地运行它。这是我们的支柱之一，所以这就是我们所做的一切。此外，我们都在抵押贷款行业中长大，所以我们先看到了市场的大小，也是多么伤了，所以我们想改变它。“ \n在推出直接消费者数字贷款品牌时，该公司正在努力使房屋过程更加“数字，透明，更容易获得消费者访问”，斯奈德说。\n 与此同时，公司不想失去人类的触感。\n “我们试图以您在应用程序中可以获得的方式设计应用程序流程，但如果您愿意在任何时间点，请与某人交谈或聊天，我们可以使用，”斯奈德补充道。\n  据斯奈德表示，较低的典型客户是千禧一代，现在是渴望拥有他们的第一家家。\n “他们可能正在思考，”好吧，我现在可能住在一个公寓里，但在接下来的几年里，我会遇到某人和/或有一个孩子，我想解开家庭的投资，' “他告诉TechCrunch。 “我们会帮助他们在那里的旅程。”\n Lower的最近推出的新应用程序提供存款账户，它是被称为“Homefund”。息息的FDIC保存账户提供了0.75％的百分比产量，并旨在帮助消费者为家庭储存，以“奖励美元的美元兑换”，斯内德说。\n 较低的工程与超过35个主要的保险公司全国，包括全国，自由，互联网。它拥有超过1,600名员工，其中大约一半以下的家庭州为基础。这是2020年6月的大约650名员工。 \n展望未来，该公司计划添加更多服务，并具有“积极的路线图”，用于为其平台添加新功能。例如，今天，较低的销售主要是Fannie Mae和Freddie Mac。虽然它提供了大部分贷款，但与许多大型贷方一样，它使用了一个子公司。然而，这将改变2022年初，当较低的打算启动自己的本机服务平台时。\n 虽然公司打算继续赚取有利可图，但斯奈德说，他和他的联合创始人“思考时间现在正在获得分享”。\n “我们希望成为全球品牌，筹集资金并获得市场份额，”他补充道。 “我们将继续在产品上加倍加倍并建立我们的能力。我们是Fintech中最好的秘密，并计划与智能品牌，广告和赞助的改变。“\n  最后但并非最不重要的是，降低了公共市场作为其长期路线图的一部分。\n “最终，我们知道我们可以建立一个伟大的公共公司，”斯奈德告诉TechCrunch。 “我们现在是一家公共公司的规模，但我们将继续下来，我们将继续建设未来几年，然后我认为我们可以在一个地方强大的公共业务。“\n Accel的Locke指出，在美国，抵押贷款和家庭金融是最大的金融服务市场之一，主要由大型银行处理。\n “对于大多数消费者来说，通过这些银行抵押贷款继续成为一种过于复杂的，缓慢移动的过程，”洛克告诉TechCrunch。 “我们认为，通过向消费者提供巨大的移动经验，降低将获得现任银行的份额，与Monzo这样的公司在银行或Venmo中的付款或贸易共和国和股票交易中的罗马时代的方式相同。” ", "note_en": "This round is notable for a number of reasons. First off, it’s a large Series A even by  today’s standards . The financing also marks the previously bootstrapped Lower’s first external round of funding in its seven-year history. Lower is also something that is kind of rare these days in the startup world: profitable. Silicon Valley-based Accel has a history of backing profitable, bootstrapped companies, having also led large Series A rounds for the likes of 1Password, Atlassian, Qualtrics, Webflow, Tenable and Galileo (which went on to be acquired by SoFi).\n In fact, Galileo founder Clay Wilkes introduced the VC firm to Dan Snyder, Lower’s founder and CEO. The two companies have a few things in common besides being profitable: they were both bootstrapped for years before taking institutional capital and both have headquarters outside of Silicon Valley.\n  “We were immediately intrigued because Ohio-based Lower echoes both of these themes,” said Accel partner John Locke, who led the firm’s investment in Lower and is taking a seat on the company’s board as part of the investment. “Like Galileo, Lower will be one of the most successful bootstrapped fintech companies globally. The combination of a company built in a nontraditional region across the globe and a bootstrapped company reminds us of [other] companies we have partnered with for a large Series A.”\n There were other unnamed participants in the round, but Accel provided the “majority” of the investment, according to Lower.\n Snyder co-founded Lower in 2014 with the goal of making the homebuying process simpler for consumers. The company launched with Homeside, its retail brand that Snyder describes as “a tech-leveraged retail mortgage bank” that works with realtors and builders, among others. In 2018, the company launched the website for Lower, its direct-to-consumer digital lending brand with the mission of making its platform a one-stop shop where consumers can go online to save for a home, obtain or refinance a mortgage and get insurance through its marketplace. This year, it launched the Lower mobile app with a savings account.\n  Over the years, Lower has funded billions of dollars in loans and notched an impressive $300 million in revenue in 2020 after doubling revenue every year, according to Snyder.\n “Our history is maybe a little atypical of fintech companies today,” he told TechCrunch. “We’ve had a view going back to the start of the company that we wanted to run it profitably. That’s been one of our pillars, so that’s what we’ve done. Also, we all grew up in the mortgage industry, so we saw firsthand the size of the market, but also how broken it was, so we wanted to change it.”\n In launching the direct-to-consumer digital lending brand, the company was working to make the homebuying process more “ digital, transparent and easier for consumers to access,” Snyder said.\n At the same time, the company didn’t want to lose the human touch.\n “We tried to design the app flow in a way where you can get as far along as you can in the application but if you want, at any point in time, to talk or chat with someone, we’re available,” Snyder added.\n  Lower’s typical customer is the millennial and now Gen Z who’s aspiring to own their first home, according to Snyder.\n “They might be thinking, ‘OK, I might be living in an apartment now, but in the next few years I’m going to meet someone and/or have a child and I want to unlock the investment that is a home,’ ” he told TechCrunch. “And we’ll help them on that journey.”\n Lower’s recently launched new app offers a deposit account it’s dubbed “HomeFund.” The interest-bearing FDIC-insured deposit account offers a 0.75% Annual Percentage Yield and is designed to help consumers save for a home with a “dollar-for-dollar match in rewards” up to the first $1,000 saved, Snyder said.\n Lower works with more than 35 major insurance carriers nationally, including Nationwide, Liberty Mutual and Allstate. It has more than 1,600 employees, about half of which are based in Lower’s home state. That’s up from about 650 employees in June of 2020.\n Looking ahead, the company plans to add more services and has an “aggressive roadmap” for adding new features to its platform.  Today, for example, Lower sells primarily to Fannie Mae and Freddie Mac. And while it services the majority of its loans, like many large lenders, it uses a subservicer. That will change, however, in early 2022, when Lower intends to launch its own native servicing platform.\n And while the company intends to continue to run profitably, Snyder said he and his co-founders “think the time is now to gain share.”\n “We want to become a global brand, raise money and gain market share,” he added. “We’re going to continue to double down on product and build out our capabilities. We are the best-kept secret in fintech and plan to change that with smart branding, advertising and sponsorships.”\n  And last but not least, Lower is eyeing the public markets as part of its longer-term roadmap.\n “Ultimately, we know we can build a great public company,” Snyder told TechCrunch. “We’re of the scale to be a public company right now, but we’re going to keep our heads down and we’re going to keep building for the next few years and then I think we can be in a spot to be a strong public business.”\n Accel’s Locke points out  that in the U.S., mortgage and home finance are among the largest financial service markets, and they have primarily been handled by large banks.\n “For most consumers, getting a mortgage through these banks continues to be an overly complex, slow-moving process,” Locke told TechCrunch. “We believe by providing consumers a great mobile experience, Lower will gain share from incumbent banks, in the same way that companies like Monzo have in banking or Venmo in payments or Trade Republic and Robinhood in stock trading.”", "posttime": "2021-06-23 20:37:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "accel,led", "title": "在7年的第一个资金中，盈利金融技术下降筹集了100万美元的级联由Accel领导 ", "title_en": "\n\t\t\t\tIn its first funding in 7 years, profitable fintech Lower raises $100M Series A led by Accel\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/lower-raises-100m-series-a-from-accel/", "via": "", "real_tags": ["accel", "led"]}]