[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1066490, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是六月繁忙的夏日。我试图解决似乎是一个简单的问题：计算美国小说的第一章的单词数量，莫克西迪克。我决定尝试四个不同的文本编辑，Google文档，Microsoft Word，语法和Apple页面。\n 结果让我感到惊讶。四个文本编辑中的每一个都给了我一个不同的词数：\n   结果的这种变化可能不会听起来很重要，但它可能取决于你所做的。想象一下，如果您是由单词数量支付的作家或编辑，您的收益的变化？\n 结果中的变化在某些情况下是可容许的。但对于产品的基本特征，在市场上几十年来，结果不应该是不精确的，而是完全正确。\n 但也许计算单词不是一个容易解决的问题。当我问几个程序员时，他们中的大多数都认为这不是一个挑战的问题，而是一个简单而无聊的问题。他们认为这个问题是一个直截了当的问题。他们认为这个问题已经精确解决了。然而，令人困惑的结果绘制了一个不同的故事。\n 这是一个惊喜，所有文本编辑没有给出一个相同的解决方案;一切都给出了不同的单词数。这是一个惊喜，因为大多数制作文本编辑的公司都不为他们的工程平庸而闻名，而是为了他们的长期认可的工程卓越。自20世纪80年代以来，至少有一家公司一直在致力于其文本编辑。\n 如果有伟大的工程人才的公司一直在努力这么久，为什么它没有精确解决？人们可以争辩说，它是因为工程团队的焦点有时更多地在花哨的问题上。这是因为人们将“简单”或“无聊”混淆“简单”的重点是。但无聊的问题并不总是容易的，就像令人兴奋的问题并不总是很难一样。而无聊的问题并不总是低影响，就像令人兴奋的问题并不总是很高的影响。 \n对基本问题的解决方案不应该错。 解决基本问题的解决方案，但无聊，需要正确。 正确性是一种美德。 不正确是无序的。 它导致混乱。 它导致损失。  当数百万人使用一些软件时，建造多年来，在丰富的盈利科技公司，那么这些公司应该考虑其优先考虑正确性的义务。 ", "note_en": "It was a busy summer day in June. I was trying to solve what seemed like a simple problem: counting the number of words in the first chapter of the American novel,  Moby Dick. I decided to try out four different text editors,  Google Docs,  Microsoft Word,  Grammarly, and Apple’s  Pages.\n The results surprised me. Each of the four text editors gave me a different word count:\n   This variation in result may not sound important, but it might depending on what you do. Imagine the variation in your earnings if you are a writer or editor who is paid by the word count?\n The variation in results is tolerable in some cases. But for fundamental features in products, that are in the market for decades, results should not be imprecise but precisely correct.\n But maybe counting words is not an easy problem to solve. When I asked several programmers, most of them considered it not a challenging problem but a simple and boring one. They thought the problem was a straightforward one. They thought this problem had already been precisely solved. Yet, the confusing results above paint a different story.\n It was a surprise that all text editors did not give one identical solution; all gave a different word count. It was a surprise because most companies that make text editors are known not for their engineering mediocrity, but for their long recognised engineering excellence. At least one of the companies has been working on its text editor since the 1980s.\n If companies with great engineering talent have been working on this problem for so long, why has it not been solved precisely? One could argue that it is because the focus of engineering teams is sometimes more on fancy problems. And it is because of such focus that people confuse “simple” with “easy” or “boring.” But boring problems are not always easy, just as exciting problems are not always hard. And boring problems are not always low-impact, just as exciting problems are not always high-impact.\n Solutions to fundamental problems should not be wrong. Solutions to fundamental problems, however boring, need to be correct. Correctness is a virtue. Incorrectness is disorderly. It leads to confusion. It leads to losses.\n When millions of people use some software, built over many years, at hugely profitable tech companies, then these companies should consider it their obligation to prioritize correctness.", "posttime": "2021-06-17 23:30:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需要,problems", "title": "无聊的问题也需要注意 ", "title_en": "Boring Problems Need Attention Too", "transed": 1, "url": "https://wyounas.com/2021/06/boring-problems-need-attention-too/", "via": "", "real_tags": ["需要", "problems"]}, {"category": "", "categoryclass": "", "imagename": "10c030b2429f801a5aed8756bdece9d2.jpg", "infoid": 1066489, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "铁锈团队很乐意宣布新版Rust，1.53.0。 Rust是一种专动图的语言，它能够赋予每个人来构建可靠的更丰富的软件。\n 如果您有通过Rustup安装的先前版本的RUDER，则获得RUST1.53.0和：\n  如果您已将其＆＃39;您已经拥有它，您可以在我们的网站上播放RustupFrom，并在Github上查看1.53.0的详细发行说明。\n  此版本包含多种新语言功能以及许多新的库功能，包括arrays的已久的中已久的Intorator实现.see详细发布Notesto了解此帖子未涵盖的其他更改。\n  这是第一个rust释放，其中阵列实现了Intilitor特征。这意味着您现在可以按值迭代数组：\n  以前，这仅通过参考，使用＆amp; [1,2,3]或[1,2,3] .iter（）。\n    由于倒退兼容性问题，这不是之前实现的。由于已经在早期版本中撰写的arrays.into_iter（）已经实现了对数组的引用，解析为（＆amp; array）.into_iter（）。 \n根据此版本，阵列实现了具有小型解决方法的大图子，以避免破坏代码。编译器将继续解析artray.into_iter（）到（＆amp; array）.into_iter（），好像特性实现不存在。这只是适用于.into_iter（）方法调用语法，并且在[1,2,3]，iter.zip（[1,2,3]）或中的任何其他语法，如[1,2,3]，e_toxer :: [1 ，2,3]），所有均编译细。\n 由于仅适用于.Into_iter（）所需的特殊情况以避免打破现有代码，因此它将在新版本中删除Rust 2021，这将在今年晚些时候发布。将Edition公布了解更多信息。\n  模式语法已扩展到支持|嵌套在图案中的任何地方。这使您可以写一些（1 | 2）而不是一些（1）|一些（2）。\n 匹配结果{OK（一些（1 | 2））=＆gt; {..} err（myereRor {种：filenotfound |许可，...}）=＆gt; {..} _ =＆gt; {..}}\n  标识符现在可以包含非ASCII字符。现在可以使用uax＃31中定义的Unicode中的有效标识符字符。包括来自许多不同脚本和语言的字符，但不包括Emoji。\n  ConstBlåhaj：＆amp; str =＆＃34;🦈＆＃34 ;; struct人{名字：字符串，}让α= 1;\n 编译器将警告有关潜在的困惑涉及不同脚本的情况。例如，使用看起来非常相似的标识符将导致警告。 \n货物不再假设Git存储库的默认头名为Master。这意味着您不再需要指定分支=＆＃34; Main＆＃34; 对于Git依赖性，从默认分支称为main的存储库。  许多人聚集在一起创造生锈1.53.0.我们不能在没有你所有人的情况下完成它。 谢谢！ ", "note_en": "The Rust team is happy to announce a new version of Rust, 1.53.0. Rust is aprogramming language that is empowering everyone to build reliable andefficient software.\n If you have a previous version of Rust installed via rustup, getting Rust1.53.0 is as easy as:\n  If you don&#39;t have it already, you can  get  rustupfrom the appropriate page on our website, and check out the detailed release notes for 1.53.0 on GitHub.\n  This release contains several new language features and many new library features,including the long-awaited  IntoIterator implementation for arrays.See the  detailed release notesto learn about other changes not covered by this post.\n  This is the first Rust release in which arrays implement the  IntoIterator trait.This means you can now iterate over arrays by value:\n  Previously, this was only possible by reference, using  &amp;[1, 2, 3] or  [1, 2, 3].iter().\n    This was not implemented before, due to backwards compatibility problems.Because  IntoIterator was already implemented for references to arrays, array.into_iter() already compiled in earlier versions,resolving to  (&amp;array).into_iter().\n As of this release, arrays implement  IntoIterator with a small workaround to avoid breaking code.The compiler will continue to resolve  array.into_iter() to  (&amp;array).into_iter(),as if the trait implementation does not exist.This only applies to the  .into_iter() method call syntax, and does notaffect any other syntax such as  for e in [1, 2, 3],  iter.zip([1, 2, 3]) or IntoIterator::into_iter([1, 2, 3]), which all compile fine.\n Since this special case for  .into_iter() is only required to avoid breaking existing code,it is removed in the new edition, Rust 2021, which will be released later this year.See  the edition announcementfor more information.\n  Pattern syntax has been extended to support  | nested anywhere in the pattern.This enables you to write  Some(1 | 2) instead of  Some(1) | Some(2).\n match result { Ok(Some(1 | 2)) =&gt; { .. } Err(MyError { kind: FileNotFound | PermissionDenied, .. }) =&gt; { .. } _ =&gt; { .. }}\n  Identifiers can now contain non-ascii characters.All valid identifier characters in Unicode as defined in  UAX #31 can now be used.That includes characters from many different scripts and languages, but does not include emoji.\n  const BLÅHAJ: &amp;str = &#34;🦈&#34;;struct 人 { 名字: String,}let α = 1;\n The compiler will warn about about potentially confusing situations involving different scripts.For example, using identifiers that look very similar will result in a warning.\n   Cargo no longer assumes the default  HEAD of git repositories is named  master.This means you no longer need to specify  branch = &#34;main&#34; for git dependenciesfrom a repository where the default branch is called  main.\n       Many people came together to create Rust 1.53.0.We couldn&#39;t have done it without all of you. Thanks!", "posttime": "2021-06-17 23:30:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,生锈,实现", "title": "生锈1.53. ", "title_en": "Rust 1.53", "transed": 1, "url": "https://blog.rust-lang.org/2021/06/17/Rust-1.53.0.html", "via": "", "real_tags": ["rust", "生锈", "实现"]}, {"category": "", "categoryclass": "", "imagename": "4d2b3ebfdf7081cfb2ae9fe50955c8d3.jpg", "infoid": 1066488, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "育儿是生命中最大的乐趣之一，对吧？并不适合所有人。密歇根州立大学心理学家的新研究检查了不想要孩子的成年人的特征和满足。\n  随着越来越多的人承认，他们根本不想让孩子们，詹妮弗Watling尼尔和佐卡拉里尼尔，副教授在MSU的心理学部门，是第一个潜入这些“无子女”个人与他人不同的人。\n  “大多数研究尚未向区分”无子女“个人的问题 - 那些选择不生孩子的人 - 来自其他类型的非父母，”詹妮弗Watling Neal说。 “非父母还可以包括计划有孩子的”未经父母“，而”无情“的人因不孕症或情况而没有孩子。以前的研究只是将所有非律法列入单个类别以将它们与父母进行比较。“\n  该研究 -  6月16日在PLOS中发布 - 使用了一组三个问题，以与父母和其他类型的非父母分开识别无子女。研究人员使用来自大学公共政策和社会研究所的国家调查状态的1,000名成年人的代表性样本中的数据。\n  “在控制人口特征后，我们发现无子女人物和父母，父母，父母，父母，父母或无子女的人格特征的生活满意度和差异有限的差异，”Zachary Neal说。 “我们还发现，无子女比父母更自由，而不是无子女的人对无子女感到不那么温暖。”\n  超越与生活满意度和人格特征相关的结果，研究揭示了额外的意外发现。\n  “我们最惊讶的是，有多少个无孩子的人，”詹妮弗Watling Neal说。 “我们发现，密歇根州的四个人中有一个以上的4人被确定为无子女，远远高于以前研究的估计患病率，这些研究依赖于生育能力来识别无子女。这些以前的研究率仅为2％至9％。我们认为我们的改善的测量可能能够更好地捕获识别无子女的人。“ \n研究人员称，鉴于密歇根州的大量无子女成年人，需要向该集团支付更多的注意。 例如，研究人员解释说，他们的学习只包括一个时间点，所以当人们决定没有孩子时，他们希望，他们希望即将到来的研究将帮助公众在人们开始识别无子女时理解 以及导致这种选择的因素。  （媒体注意事项：请在所有在线媒体覆盖范围内包含以下链接：https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0252528） ", "note_en": "Parenting is one of life’s greatest joys, right? Not for everyone. New research from Michigan State University psychologists examines characteristics and satisfaction of adults who don’t want children.\n  As more people acknowledge they simply don’t want to have kids,  Jennifer Watling Neal and  Zachary Neal, both associate professors in MSU’s  department of psychology, are among the first to dive deeper into how these “child-free” individuals differ from others.\n  “Most studies haven’t asked the questions necessary to distinguish ‘child-free’ individuals —  those who choose not to have children —  from other types of nonparents,” Jennifer Watling Neal said. “Nonparents can also include the ‘not-yet-parents’ who are planning to have kids, and ‘childless’ people who couldn’t have kids due to infertility or circumstance. Previous studies simply lumped all nonparents into a single category to compare them to parents.”\n  The study —   published June 16 in PLOS ONE —  used a set of three questions to identify child-free individuals separately from parents and other types of nonparents. The researchers used data from a representative sample of 1,000 adults who completed MSU’s State of the State Survey, conducted by the university’s Institute for Public Policy and Social Research.\n  “After controlling for demographic characteristics, we found no differences in life satisfaction and limited differences in personality traits between child-free individuals and parents, not-yet-parents, or childless individuals,” Zachary Neal said. “We also found that child-free individuals were more liberal than parents, and that people who aren’t child-free felt substantially less warm toward child-free individuals.”\n  Beyond findings related to life satisfaction and personality traits, the research unveiled additional unexpected findings.\n  “We were most surprised by how many child-free people there are,” Jennifer Watling Neal said. “We found that more than one in four people in Michigan identified as child-free, which is much higher than the estimated prevalence rate in previous studies that relied on fertility to identify child-free individuals. These previous studies placed the rate at only 2% to 9%. We think our improved measurement may have been able to better capture individuals who identify as child-free.”\n  Given the large number of child-free adults in Michigan, more attention needs to be paid to this group, the researchers said. For example, the researchers explained that their study only included one time point, so didn’t examine when people decided to be child-free —  however, they hope forthcoming research will help the public understand both when people start identifying as child-free as well as the factors that lead to this choice.\n  (Note for media: Please include the following link to the study in all online media coverage:   https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0252528 )", "posttime": "2021-06-17 23:30:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "想要,quarter,父母", "title": "研究：四分之一的成年人不想要孩子 - 他们仍然幸福 ", "title_en": "Study: A quarter of adults don’t want children – and they’re still happy", "transed": 1, "url": "https://msutoday.msu.edu/news/2021/childfree-adults", "via": "", "real_tags": ["想要", "quarter", "父母"]}, {"category": "", "categoryclass": "", "imagename": "95b41e4962cd3df706d234e8e8114179.png", "infoid": 1066487, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2015年，生产力工具概念近乎死亡。它的创始人，Ivan Zhao和Simon最后，在次优的技术堆栈上建立了他们的应用程序，它不断崩溃。他们的天使投资金钱Dwindling，他们面临着野蛮的选择：让他们的漂浮团队4队起来并从现金开始或耗尽现金。 “如果你看着烧伤率，我们都会在一起死去，”伊万说。 “这不是一个选择。”\n 所以他们将他们的旧金山办公室推向了一个更便宜的城市，他们可以专注于：京都。 “我们都没有说出日语，没有人说英语，所以我们所有的都是整个内衣的代码，”伊万说。\n 那时候我们注意到了Ivan在图中的图形。他突然弹出了我们最活跃的用户列表的顶峰 - 在我们的设计工具中每天上空超过18小时。正如我们稍后发现的那样，他在近距离睡觉，在一个新的应用程序版本到达1.0后抽出版本。\n 他和西蒙出发了从头开始重建概念，保持相同的使命：提供非技术人员在没有编写代码的情况下制作自己的工具的能力。他们希望人们定制技术来解决自己的问题。\n 设计意味着这里的一切。我们是一个解决人们日常问题的工具。\n 这是一个雄心勃勃的目标，他们需要指导用户体验。在他们的考虑年度期间，他们开发了一个独特的设计过程，以帮助他们做到这一点 - 从标签组合的设计挑战，激发用户流动的无穷无尽的排列。这些策略在转向公司周围的作用起着至关重要的作用，并在重新启动时成为他们产品的秘密酱。 （签出今天的关于概念的概念的新闻。）\n 我们与Ivan坐下来获取公司的枢轴上的完整背面故事（他们之前从未公开过谈论），并且在节省产品时扮演的角色设计。 \n有很多方法可以构建可自定义的软件工具。在第一个转组 - 概念Beta  -  Ivan和Simon制作了一个易于使用的编程应用程序，即使有人不知道如何代码。事实证明，人们对此并不感兴趣。\n “我们对我们想要带来世界的东西，”伊万把它放了。 “我们需要注意世界上想要的东西。”\n  正如你可能想象的那样，用他们的产品来脱离这一大面对面的新设计思维。在他们的临时岁月里，伊万和西蒙协作地协同工作，这样他们就可以一起移动。使用Figma的多人游戏功能，他们会同时跳入文件和头脑风暴。他们将彼此的想法或标签团队脱颖而出。\n “他正在编程，我正在设计。我可以编程，他正在设计。我们能够一起探索迷宫，“伊万说。 “与Figma的实时态度是关键 - 在许多其他产品中不能这样做。”\n 2018年3月，经过几个月的不眠之夜，概念1.0已准备好进行原始。简而言之，它飙升到产品狩猎的顶端，在华尔街日报的印刷版中获得了一篇发光的评论，并在别人敲门时忽略了别的东西 - 忽略了门。\n  它还为其用户体验提供了赞誉，有一些呼叫它，“UX设计史上的里程碑”。尽管该应用程序的功能强大，但新用户主屏幕是最小的。它拥有一小部分哈登回苏珊卡尔（Mac Iconogation母亲）的图标集。 ivan称之为“Windows 95”。\n  “设计意味着这里的一切，”伊万说。 “我们是一个解决人们日常问题的工具。就像他们如何关心锤子如何感受或刀切，概念如何对它们具有大量价值。“ \n在危机的一年中，Ivan会一次又一次地复制流程，在这里只调整小细节 - 交换图标，添加不同的文本。\n “我们的一般哲学就是疯狂的融合，”他说。 “如果在那里的味道，你可以通过研究排版和行业的巨人来增长，你可以在你找到最好的版本之前搅拌出版。”\n 至今，概念采用这种无穷迭代的方法来做出决策。设计人员创建了多个可交付的版本，以及撰稿人，工程师，甚至内部插图。关键是保持松散，哈希出了一堆粗糙的草稿，拥抱了大想法（甚至是坏人），并获得尽可能多的概念。然后转向你的队友，让他们压力测试。你将不可避免地将现场缩小到最佳选择。伊万说这种做法是概念的品牌如此鲜明。\n   概念通过直观地完成所有思考，优先考虑设计文化。他们在Get-Go中开发了Figma的想法，几乎像刮刀。该方法适用于小型13人公司的每个人，而不仅仅是设计师。\n “用图形，这对任何人都很容易，让任何人从他们的脑海中获得愿景，并进入其他人看，”伊万说。 “这真的是一个想法的工具，就像概念一样。所以我们觉得这样的烈酒就是这样。“\n 如果您访问概念的办公室（在深度使命的Skylit转换车库），您将看到人们在图中使用设计的设计来构建论点。他们将铺设页面，拖放元素，并敲击模拟，以响应产品辩论或社区支持门票。他们将用图形网址和线条附加说明：“像这样做的事情会做伎俩吗？”\n  鉴于概念的早期历史，伊万和西蒙对机构记忆有特别赞赏 - 以前曾经尝试过，有什么用的，什么都没有。就他们而言，没有任何东西应该被删除。 \n“我不断喜欢，'不要取代这篇文章！只需复制并创建一个新的画布！“”Ivan说。 “在Figma中，您可以打开我们的任何文件，并侧面有七个或八个画布。你了解一个与下一个和下一个之间的单词和设计如何进化。“\n 随着这种记录，人们可以从他们面前出现的人的错误中学习。概念的Figma工作空间分为粒度文件夹树结构，使其简单地导航到任何过去的项目。\n  拟合，新的概念雇用预计会审查伊万和西蒙在2015年重建工具中探讨的释义。 “他们需要了解我们如何用我们的想法方式提出，”伊万说。 “并且很多人都在我们所做的设计中生活。”\n  这些只是概念概念的巨大原因，尽管他们的小团队和微薄的资金，但仍然是无可争议的。只有在口袋里的种子投资，概念没有觉得需要更多的钱。他们没有它达到100万用户。\n 该工具正在渗透从上面的科技公司，就像松弛和Dropbox一样。在Figma，我们首先看到我们的客户服务团队悄悄地偷偷地偷看Google文档并切换到概念。人力资源接下来，随后是营销。像多米诺骨牌堆积在秋天一样，一旦一支球队分享福音并展示了可能的东西，其他人忍不住变得好奇。 ", "note_en": "In 2015,  productivity tool Notion nearly died. Its founders,  Ivan Zhao and  Simon Last, had built their app on a suboptimal tech stack, and it crashed constantly. Their angel investment money dwindling, they faced a brutal choice: Fire their fledgling team of 4 and start over, or run out of cash. “If you looked at the burn rate, we all would’ve died together,” Ivan says. “It wasn’t much of a choice.”\n So they sublet their San Francisco office and moved to a cheaper city where they could focus: Kyoto. “Neither of us spoke Japanese and nobody there spoke English, so all we did was code in our underwear all day,” Ivan says.\n It was around that time we noticed Ivan  in Figma. He suddenly popped to the top of our most active user list — spending upwards of 18+ hours a day in our design tool. As we’d later find out, he was designing frenetically and barely sleeping, pumping out version after version of a new app that would become Notion 1.0.\n He and Simon set out to rebuild Notion from scratch, keeping the same mission: Give non-techies the ability to make their own tools without writing code. They wanted people to customize technology to solve their own problems.\n Design means everything here. We’re a tool that solves people’s daily problems.\n It was an ambitious goal, and they needed to nail the user experience. During their year of reckoning, they developed a unique design process to help them do that — from tag-teaming design challenges, to brainstorming endless permutations of a user flow. These tactics played a crucial role in turning the company around and became the secret sauce of their product when they relaunched. (Check out  today’s news in The Verge about Notion  taking on Evernote.)\n We sat down with Ivan to get the full back story on the company’s pivot (which they&#39;ve never talked about publicly before), and the role design played in saving the product.\n  There’s a lot of ways to build a customizable software tool. In the first go-round — Notion beta — Ivan and Simon made a programming application that was easy to use even if someone didn’t know how to code. It turned out, people weren’t interested in that.\n “We focused too much on what we wanted to bring to the world,” Ivan put it. “We needed to pay attention to what the world wanted from us.”\n  As you might imagine, pulling off this big of an about-face with their product required fresh design thinking. In their crunch year, Ivan and Simon worked collaboratively so they could move faster together. With Figma’s multiplayer feature, they’d jump into files at the same time and brainstorm. They’d riff off each other’s ideas or tag team different parts of the work.\n “He’s programming, I’m designing. I could be programming, he’s designing. We were able to explore the maze together,” Ivan says. “The real-time thing with Figma is key — you can’t do that in many other products.”\n In March of 2018, after months of sleepless nights, Notion 1.0 was ready for primetime. In short stead, it  skyrocketed to the top of Product Hunt,  got a glowing review in the print version of the Wall Street Journal, and became famous for something else —  ignoring the door when VCs came knocking.\n  It also  garnered accolades for its user experience, with  some calling it, “a milestone in the history of UX design.” Despite the app’s powerful functionality, the new user home screen is minimal. It features a small collection of icons that harken back to  Susan Kare (the mother of Mac iconography). Ivan calls it very “Windows 95.”\n  “Design means everything here,” Ivan says. “We’re a tool that solves people’s daily problems. Just like how they care about how the hammer feels or the knife cuts, how Notion feels has substantial value to them.”\n   In their year of crisis, Ivan would replicate a flow again and again, tweaking only small details here and there — swapping out an icon, adding a different line of text.\n “Our general philosophy is to go crazy with permutations,” he says. “If the taste is there, which you can grow by studying typography and the giants of industry, you can churn out versions until you find the best one.”\n To this day, Notion employs this method of endless iteration to make decisions. Designers create multiple versions of any deliverable, as do copywriters, engineers, and even the in-house illustrator. The key is to stay loose, hash out a bunch of rough drafts, embrace big ideas (even bad ones), and free as many concepts from one’s brain as possible. Then turn to your teammates and let them stress test. You’ll inevitably narrow the field to the best option. Ivan says this practice is the reason Notion’s brand is so distinct.\n   Notion prioritizes a culture of design by doing all their thinking visually. They develop ideas in Figma from the get-go, using it almost like a scratchpad. And that method applies to everyone at the tiny 13-person company, not just designers.\n “With Figma, it’s easy enough for anyone to get a vision out of their head and onto the page for others to see,” says Ivan. “It’s truly a tool for thought, just like Notion. So we feel like kindred spirits in that way.”\n If you visit Notion’s office (a skylit converted garage in the deep Mission), you’ll see people playing with designs in Figma to build arguments. They’ll lay out pages, drag and drop elements, and whip up mocks in response to product debates or community support tickets. They’ll append notes with Figma URLs and the line: “Would something like this do the trick?”\n  Given Notion’s early history, Ivan and Simon have special appreciation for institutional memory — what has been tried before, what worked and what didn’t. As far as they’re concerned, nothing should ever be deleted.\n “I am constantly like, ‘Do not replace that text! Just copy and create a new canvas!’” says Ivan. “In Figma, you open any file of ours and there’s seven or eight canvases all side by side. You see how the words and design evolved between one and the next.”\n With that kind of record, people can learn from the mistakes of those who came before them. Notion’s Figma workspace is divided into a granular folder tree structure that makes it simple to navigate to any past project.\n  Fittingly, new Notion hires are expected to review the permutations Ivan and Simon explored during their 2015 rebuild of the tool. “They need to see how we came up with the way we think about things,” Ivan says. “And a lot of this lives in the designs we made.”\n  These are just a few of the reasons Notion’s rise continues uncontested, despite their small team and meager funding. With only a seed investment round in their pocket, Notion hasn’t felt the need to raise any more money. They hit 1 million users without it.\n The tool is infiltrating tech companies from the ground-up, much like Slack and Dropbox did. At Figma, we first saw our customer service team quietly sneak off Google Docs and switch to Notion. HR came next, followed by Marketing. Like dominoes stacked to fall, once one team shared the gospel and showed what was possible, others couldn’t help but get curious.", "posttime": "2021-06-17 23:29:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失败,pulled,概念", "title": "概念从失败的边缘拉起（2019） ", "title_en": "Notion pulled itself back from the brink of failure (2019)", "transed": 1, "url": "https://www.figma.com/blog/design-on-a-deadline-how-notion-pulled-itself-back-from-the-brink-of-failure/", "via": "", "real_tags": ["失败", "pulled", "概念"]}, {"category": "", "categoryclass": "", "imagename": "d87e30c5fb351e898bdb3355e3d3197a.jpeg", "infoid": 1066486, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于令人尴尬的编程错误，灰尘甚至没有沉淀铁稳定硬币的崩溃 -  262亿美元仍然被锁定在智能合同中，但我已经觉得自己写作。整件事对我来说很有趣，因为我相对毫发了毫发。至少对我来说，它是教育，启示均匀。\n  铁的崩溃是（如这种writing）没有拉力拉杆。开发人员似乎是为了创造一种新的stablecoin，它似乎得到了最高的，这是一个被“真正的”stablecoin部分抵押的一个。像许多金融崩溃故事一样，这是一个愚蠢的故事。\n [编辑：我从自我了解到这一点已经是Defi社区的笑容，遭到了他们的3个上一个项目中的每一个（现在4） - 虽然这可能是他们最大的打击]\n  铁稳定素背后的想法是“效率”之一。像戴一样的其他连锁店稳压是过度抵押的。戴伊上的每一美元，傣族系统中有〜1.75美元的加密资产。在USDC（和据说USDT）的情况下，每次1美元的银行账户中有1美元，每次1美元。我们不能比这更好吗？\n 过去，已经尝试设计了纯粹的算法stablecoins，这些算法没有用任何东西备份。铁的开发人员正确地指出了其中的缺陷：它们依赖于进来的新资金，当钉被破坏时最不可能满足的条件。来自铁文档：\n 非抵押的Stablecoins需要持续增长以获得成功。如果价格崩溃，没有抵押品将硬币归还回来，并且持有人的资金将丢失，如尝试使用这种设计的许多过去项目[SIC]所见。\n 相反，铁采取了一个混合方法：部分抵押了USDC的STablecoin  - 它的大部分短寿命大约为75％ - 其余的即将到来，形成一个挥发性资产。 \n稳定性应确保如下：如果铁的价格低于1美元，则符号可以在市场上少1美元购买它，然后以0.75美元的价格将其兑换为铁库金（多边形链的合同）和价值0.25美元的泰坦。\n 这里的问题应该变得显而易见：套利者不在令牌炒作业务中。他们不想持有任何风险资产，超过必要的时间（理想情况下在单一交易中购买和销售它）。因此，他们将其倾倒在市场上以收集无风险的利润。这将价格压力放在泰坦，从而进一步的脱钉铁，其部分地定价。\n 在他们的文件中，铁开发商有以下几点令牌的价值：\n 剩余部分以挥发性资产[泰坦]计值，这是作为抵押品所需的。此要求会为挥发性资产创造自然需求。 [重点添加]\n 换句话说，他们预计泰坦有一些价值，因为它可以用来薄荷。通过这样做，他们重新创建了他们早些时候谴责的算法Stablecoins的激励：更多的资金必须进入，否则PEG崩溃了。\n 如果他们选择了在自己的生态系统之外有一些价值的挥发性资产（可能是Matic，用于支付多边形链的交易费用的令牌）它可能已经持续了一点，但我不会打赌它 - 至少不是第二次。\n  糟糕的想法每天都出生，但为什么有人会打扰？在它的高峰时，20亿美元的东西被涌入这个生态系统（我应该澄清：价值20亿魔术互联网豆，而不是真钱。编辑2：只有大约一半是铁）。 \n乍一看，人们可以争辩说，斯巴伯因的创新设计就是吸引了所有这一资本（谁不想通过金融炼金术将1美元变成1.5美元？）然而，首先熨烫是实现这一设计的铁，也不是同一组织由同一开发者部署在二明赛智能链中的任何地方都在关注附近的任何地方。事实上，借助于本撰写的BSC网络的铁稳态素继续“功能”，保持其1美元的价格，小粉丝很少。\n 而是在多边形链的产量农业生态系统中可能会发现答案。在那里，几个自动复合者正在争夺人民资本。 Beefy.finance，AutoFarm和Polycat只是为了命名主要的。这些服务是合法的（对于一些合法的定义）：他们提供自动化收集和重新投资交易费用的过程，从提供自动化市场制造商的流动性，这反过来就是合法的（由某些定义）业务：提供资本，采取汇率风险，收取交易费用。\n 随着复合利息，这通常达到每年的几个百分点，具体取决于市场活动。与银行账户相比，但没有什么可以写回家的。铁USDC对发生了一些奇怪的事情。在一对STableCoins上，这些自动复合剂显示每天2％的返回2％（每年30,000％）。\n  这些返回是基于24小时交易量的推断。在这种感觉中，它们是“真实” - 通过与这些站点上的所有其他数字相同的公式计算。所以发生的是，人们打破了USDC-Iron对，就像没有明天一样，产生疯狂的交易费用，甚至进一步推动展示的Apy，吸引更多的吸盘堆积，产生更多的费用......\n 有一段时间，这项工作。每天人们都会赚取疯狂的奖励，预计3年时间在宇宙中的原子比原子更多。 Ironfinance Dumreddit上有人有以下问题：\n [关于30,000％的APY]我想知道这是否可以数学上？ -  Reddit上的人\n “数学上”。显然，许多人甚至没有远程资格参与其中。 \n正如要预期的那样，有足够的阴谋理论来围绕试图解释泰坦为何崩溃。我不能和他们中的任何一个人说话，但在结构上没有像铁stablecoin那样的东西，而且融合了这一点快速燃烧 - 从没有到10亿到10亿 - 任何数量的随机事件都可以触发崩溃。\n 崩溃是对这个故事的最不有趣的部分。每天在Crypto Wild West的某个地方，一场毫无价值的资产达到60美元并恢复到0美元。在附加的stablecoins中价值十亿美元是 - 有点新的部分。\n  泰坦崩溃后，每1根铁都有0.74美元的USDC，每一铁都有优秀。无论市场上的价格如何，它可以在任何时刻被铁合同本身兑换（目前〜0.71美元）。剩下的1美元的余额是在泰坦支付，但显然，现在这一部分是无关紧要的。\n 在实践中，它看起来有点不同。我在开始时，整个集中尚未结束，因为2.72亿美元的USDC仍然在合同中被锁定。为什么每个人都恢复了74美分？这里的事情变得真正搞笑。它是由于铁智能合同的兑换功能下行：\n  _share_price在这里是指泰坦的价格，由Oracle提供的，这是正确将其报告为... 0（在远处的某处，您可以听到一个房间全软件工程师爆发为笑声）。\n 由于条件指定为大于（＆gt;），而不是大于或等于（＆gt; =），因此无法再满足条件，因此每个呼叫都会失败。代码审核可能会抓住这一点（这种类型的错误在软件开发中是如此常见，我可能自己制作了数百次），但当然这个智能合同没有审计。只有其单向智能链的姊妹合同，用不同的语言写作。\n  因为泰坦价格下跌至0，我们未来的[SIC]，合同将恢复赎回交易。 [强调我的] \n那些熟悉金融灾难历史的人知道“我们从未期待过......”这句话在其中突出起来。 另一个牵引者是“我们很遗憾地通知你”和“我们承担全部责任”（不承担责任）。 我希望这些是在他们尚未发表的淘汰后遵循。 ", "note_en": "The dust hasn’t even settled on the collapse of the IRON stable coin —$262 million in USDC collateral is still locked in a smart contract due to an embarrassing programming bug —but I already feel like writing about it. The whole thing is funny to me, because I got out relatively unscathed. At least for me it was educational, revelatory even.\n  The collapse of IRON was (as of this wr  iting) not a rug pull. The developers seem to have been earnest in their attempt to create a new kind of stablecoin , one that was only partially collateralized by a “real” stablecoin. Like many financial collapse stories, this is a story of folly.\n [EDIT: I’ve since learned that the developer(s?) behind this are already the laughing stock of the DeFi community, having wrecked each of their 3 previous projects (now 4) — though this might be their biggest hit yet]\n  The idea behind the IRON stablecoin is one of “efficiency”. Other on-chain stablecoins like DAI are over-collateralised. For every $1 of DAI, there’s ~$1.75 worth of crypto assets in the DAI system. In the case of USDC (and supposedly USDT), there’s $1 sitting in a bank account somewhere for every $1 on-chain. Couldn’t we do better than that?\n In the past, attempts have been made to devise purely algorithmic stablecoins, that weren’t backed by anything. The developers of IRON correctly pointed out the flaw in these: They are dependent on new money coming in, a condition least likely to be met when the peg is broken. From the IRON documentation:\n Non-collateralized stablecoins require continual growth to be successful. In the event of a price crash, there is no collateral to liquidate the coin back into, and the holder’s money would be lost, as seen with many past projects trying to utilize such design [sic].\n Instead, IRON took a hybrid approach: Partially collateralize the stablecoin with USDC— it was around 75% for most of its short lifespan —with the rest coming form a volatile asset, TITAN.\n  The stability was to be ensured as follows: If the price of IRON fell below $1, arbitrageurs could buy it for less then $1 on the market, and then redeem it with the IRON treasury (a contract on the Polygon chain) for $0.75 USDC and $0.25 worth of TITAN.\n Here the problem should have become apparent: Arbitrageurs are not in the business of token speculation. They don’t want to hold any risky asset for longer than necessary (ideally buy and sell it within a single transaction). So they dump it on the market to collect their risk-free profit. This put price pressure on TITAN, thereby further de-pegging IRON which is partially priced in it.\n In their documentation, the IRON developers had the following to say about the value of the TITAN token:\n the remaining portion is denominated in a volatile asset [TITAN], which is required as collateral. This requirement creates […]  a natural demand for the volatile asset. [emphasis added]\n In other words, they expected TITAN to have some value, because it could be used to mint IRON. By doing this, they recreated the incentives of algorithmic stablecoins they’ve denounced earlier: More money has to come in, otherwise the peg collapses.\n If they had chosen a volatile asset that had some value outside of their own ecosystem (perhaps MATIC, the token used to pay the transactions fees on the Polygon chain) it could have lasted a little longer, but I wouldn’t bet on it — at least not a second time.\n  Bad ideas are born every day, but why would anyone bother? At its peak, something like 2 billion USD were poured into this ecosystem (I should clarify: 2 billion worth of magic internet beans, not real money. EDIT2: Only about half of this was IRON).\n At first glance, one could argue that the innovative design of the stablecoin is what attracted all this capital (who wouldn’t like turning $1 into $1.5 through financial alchemy?) However, neither was IRON the first to implement this design, nor did  the same contracts by the same developers deployed on the Binance Smart Chain attract anywhere near as much attention. In fact, the IRON stablecoin continues to “function” on the BSC network as of this writing, keeping its $1 peg, with little fanfare.\n Instead the answer might be found in the yield farming ecosystem on the Polygon Chain. There, several auto-compounders are vying for people’s capital. Beefy.finance, Autofarm, and Polycat just to name the major ones. These services are legit (for some definition of legit): They offer to automate the process of collecting and re-investing transaction fees from providing liquidity in automated market makers, which is in turn a legit (by some definition) business: Provide capital, take exchange rate risk, collect transaction fees.\n With compound interest factored in, this typically amounts to a couple of percentage points per year, depending on market activity. Good compared to a bank account, but nothing to write home about. Something odd happened with the IRON-USDC pair though. These auto compounders were showing returns of  2% per day (something like 30,000% per year)  on a pair of stablecoins.\n  These returns are extrapolations based on 24h trading volume. In that sense they are “real” — calculated by the same formula as all other numbers on these sites. It so happened that people were piling into the USDC-IRON pair like there was no tomorrow, generating insane amounts of trading fees, driving up the displayed APY up even further, attracting more suckers to pile into it, generating more fees…\n For a while, this worked. Every day people would earn crazy rewards, expecting to have more USD than atoms in the universe in 3 years time. Someone on the IronFinance subreddit had the following question:\n [about the 30,000% APY] I’m wondering if this can last mathematically?   — Someone on Reddit\n “Mathematically”. Clearly, many were not even remotely qualified to be involved in this.\n  As is to be expected, there are plenty of conspiracy theories to go around attempting to explain why TITAN collapsed. I cannot speak to any of them, but with with something as structurally unsound as the IRON stablecoin, and a fuse burning this fast — from nothing to 1 billion with two weeks — any number of random events could have triggered the collapse.\n The collapse is the least interesting part about this story. A worthless asset going to $60 and back to $0 happens every day somewhere in the crypto wild west. A billion $ worth in stablecoins attached to it is the — somewhat — novel part.\n  After the collapse of TITAN, there were still $0.74 worth of USDC in the IRON treasury for every 1 IRON outstanding. It can be redeemed by the IRON contract itself at any moment regardless of the price in the market (currently ~$0.71). The remainder towards a full $1 was to be payed out in TITAN, but obviously that part is irrelevant now.\n In practice it looks a little different. I’ve mentioned in the beginning the the whole episode isn’t over yet, because $272 million worth of USDC is still locked up in in the contract. Why hasn’t everyone recovered their 74 cents?  Here things become  truly hilarious. It is due to the following line in the  redeem function of the IRON smart contract:\n  _share_price here refers to the price of TITAN, as provided by an oracle, which is correctly reporting it as…  0 (somewhere in the distance, you can hear a room full software engineers burst into laughter ).\n Since the condition is specified as  greater than ( &gt;), rather than  greater than or equal ( &gt;=) , the condition can no longer be met, and so every call to  redeem fails. A code audit likely would have caught this (this type of bug is so common in software development, I’ve probably made it hundreds of times myself), but  of course this smart contract   was not audited. Only its sister-contract on the Binance Smart Chain, written in a different language, was.\n  Because the TITAN price falls to 0  which we have unthought of [sic], the contract will revert the redemption transaction. [emphasis mine]\n Those familiar with the history of financial catastrophes know that the phrase “we never expected …” features prominently in it. Another trope is “we regret to inform you” and “we take full responsibility” (without taking responsibility). I expect these to follow in their yet to be published postmortem.", "posttime": "2021-06-17 23:29:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "锁定,locks", "title": "偏离一误差锁定抵押亿美元的崩溃崩溃 ", "title_en": "Off-by-one error locks collateral after billon dollar stablecoin collapse", "transed": 1, "url": "https://irony-97882.medium.com/the-melting-of-iron-89469b01e083", "via": "", "real_tags": ["锁定", "locks"]}, {"category": "", "categoryclass": "", "imagename": "be60fd497c9f5c82664275fca82a347b.jpg", "infoid": 1066485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由亚马逊返回的公司＆＃39; S Jeff Bezos支持，以在牛津郡建造大规模的核聚变示范厂。  加拿大＆＃39;普通融合是旨在将融合的承诺转化为商业上可行的能源的领先私营企业之一。  新设施将在Culham建造，在您的英国＆＃39;国家融合研究计划中。  融合将在Culham校园建造该设施后与英国原子能管理局进行长期商业租赁。  虽然没有披露商业细节，但据说发展率约为400亿美元。  融合是太阳产生能量的过程。 在地球上利用它被视为朝着更环保的核电的关键步骤。  它通过尝试熔断原子而不是分裂它们来不同于传统的核方法。 \n在理论上，融合应该承诺一种更安全，无碳的能源，产生非常小的放射性废物。\n 但是，在温度下，在温度下融合的原子比太阳的表面更热，已经证明了巨大的技术和财务挑战。\n 建立融合反应堆的主要努力正在法国南部进行了迭代工程。\n 但是，这笔澳元的延迟和ISN＆＃39的延迟妨碍了这一澳元的冒险。在2035年之后，可能会有效地工作。\n 令人沮丧的进步进展缓慢，世界各地的私营公司一直在遵循自己的方法，并且常见融合和努力被视为最先进的努力。\n 由杰夫贝奥斯支持十多年来，该公司在最后一轮的资金中筹集了100万美元，并准备回到投资者以获得更多现金，以表明公司和＃39; S技术可以成功扩大。\n  在该方法中，将由特定形式的氢组成的等离子体的超加热气体喷射到圆柱体中，该气缸被液体金属壁包围。 \n然后使用数百个气动活塞来压缩等离子体直到原子熔断器，产生大量的热量。  该热量由液态金属转移，并用来煮沸水并使蒸汽驱动涡轮机。  该公司表示，他们的方法的一个关键优势是，大部分技术已经存在于业内。  例如，这是一个由其他融合程序所采取的方法，例如在CULHAM采取的方法。  校园由英国原子能管理局（UKAEA）拥有和管理，也是主要融合研究工作的位置：欧洲联合托伦（喷气机）和桅杆升级。  ＆＃34;来到Culham让我们有机会从UKAEA中受益，＆＃34; 一般融合的首席执行官Christofer Mowry说。  ＆＃34;通过在本校园定位，通用融合将我们的市场存在扩展到北美进入欧洲，扩大我们的政府，机构和工业伙伴的全球网络。 \n＆＃34;这是令人难以置信的令人兴奋的消息，不仅是一般的融合，而且是制定实用融合能源的全球努力。＆＃34;\n 在英国政府资助的情况下，在英国政府提供资金的决定，通过Christofer Mowry描述为＆＃34;非常有意义的货币金额。\n 虽然英国部长对发展是积极的，但他们不会在纳税人的数量上绘制。\n 政府表示，与一般融合的协议将在3年建设阶段以及在运营阶段的三年建设阶段以及许多其他人中支持数百名职位。\n 他们说它将补充政府和第39次的资金，为UKAEA和＃39;用于能源生产（步骤）计划的22200万英镑的承诺，旨在设计和建立世界＆＃39;第一个原型融合电厂2040。\n ＆＃34;这普通融合的新工厂是我们在英国开发一个融合产业的计划，我很激动人，那么Culham将成为这样一个尖端和潜在的变革项目的所在地，＆ ＃34;英国科学部长阿曼达山脉。\n ＆＃34;融合能源具有极大，低碳能源的源泉，今天＆＃39;宣布是该地区和英国的信心明确投票，＆＃39;作为全球科学超级大国的地位。 ＆＃34; ", "note_en": "A company backed by Amazon&#39;s Jeff Bezos is set to build a large-scale nuclear fusion demonstration plant in Oxfordshire.\n Canada&#39;s  General Fusion is one of the leading private firms aiming to turn the promise of fusion into a commercially viable energy source.\n The new facility will be built at Culham, home to the UK&#39;s national fusion research programme.\n  General Fusion will enter into a long-term commercial lease with the  UK Atomic Energy Authority following the construction of the facility at the Culham campus.\n While commercial details have not been disclosed, the development is said to cost around $400m.\n   Fusion is the process by which the Sun generates energy. Harnessing it here on Earth is seen as a critical step towards greener nuclear power.\n It differs from the traditional nuclear approach by attempting to fuse atoms together rather than splitting them.\n  In theory, fusion promises a safer, carbon-free energy source that produces very little radioactive waste.\n But getting atoms to fuse together at temperatures several times hotter than the surface of the Sun has proven a huge technological and financial challenge.\n A  major international effort to build a fusion reactor is underway in the south of France with the Iter project.\n But this $20bn dollar venture has been hampered by delays and isn&#39;t likely to be working effectively until after 2035.\n Frustrated by the slow progress, private companies across the world have been following their own approaches, and General Fusion&#39;s effort is seen as one of the most advanced.\n Backed by Jeff Bezos for over a decade, the company raised $100m in its last round of funding and is preparing to go back to investors for more cash to show that the firm&#39;s technology can be successfully scaled up.\n  In this process, a super-heated gas called a plasma, consisting of a particular form of hydrogen, is injected into a cylinder which is surrounded by a wall of liquid metal.\n Hundreds of pneumatic pistons are then used to compress the plasma until the atoms fuse, generating massive amounts of heat.\n This heat is transferred by the liquid metal, and used to boil water and make steam to drive a turbine.\n  The company says that a key advantage of their approach is that much of the technology exists in industry already.\n This is a very different approach to that being taken by other fusion programmes, at Culham for example.\n The campus is owned and managed by the UK Atomic Energy Authority (UKAEA) and is also the location of major fusion research efforts: the  Joint European Torus (Jet) and Mast Upgrade.\n &#34;Coming to Culham gives us the opportunity to benefit from UKAEA&#39;s expertise,&#34; said Christofer Mowry, the chief executive of General Fusion.\n &#34;By locating at this campus, General Fusion expands our market presence beyond North America into Europe, broadening our global network of government, institutional, and industrial partners.\n &#34;This is incredibly exciting news for not only General Fusion, but also the global effort to develop practical fusion energy.&#34;\n The decision to locate the demonstration plant in Oxfordshire was made possible by funding from the UK government, with the monetary amount described by Christofer Mowry in wire agency reports as &#34;very meaningful&#34;.\n While UK ministers were positive about the development, they wouldn&#39;t be drawn on the amount of taxpayer&#39;s money involved.\n The government says the agreement with General Fusion will support hundreds of jobs both in Oxfordshire and beyond, during the 3-year construction phase, as well as many others during the operational phase.\n They say it will complement the government&#39;s commitment of £222m for the UKAEA&#39;s Spherical Tokamak for Energy Production (Step) programme, which aims to design and build the world&#39;s first prototype fusion power plant by 2040.\n &#34;This new plant by General Fusion is a huge boost for our plans to develop a fusion industry in the UK, and I&#39;m thrilled that Culham will be home to such a cutting-edge and potentially transformative project,&#34; said UK Science Minister Amanda Solloway.\n &#34;Fusion energy has great potential as a source of limitless, low-carbon energy, and today&#39;s announcement is a clear vote of confidence in the region and the UK&#39;s status as a global science superpower.&#34;", "posttime": "2021-06-17 23:28:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "支持,energy,融合", "title": "核能：杰夫贝斯支持的融合植物在英国建造 ", "title_en": "Nuclear energy: Fusion plant backed by Jeff Bezos to be built in UK", "transed": 1, "url": "https://www.bbc.co.uk/news/science-environment-57512229", "via": "", "real_tags": ["支持", "energy", "融合"]}, {"category": "", "categoryclass": "", "imagename": "fcf01716234d8a2ae24f3ceb344b964b.png", "infoid": 1066484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Caribulite是一款实惠的教育，开源的SDR平台，也是覆盆子 -  PI家族的帽子（仅限40针版本）。它是为制造商，黑客和研究人员建造的，旨在补充SDR当前的生态系统，提供可扩展的独立双通道软件定义的无线电。\n  与许多其他帽子项目不同，Caribulite使用所有40针RPI版本的SMI（辅助存储器接口）。覆盆子-PI文档和Broadcomm＆＃39; S参考手册不彻底记录此接口。 [https://iosoft.blog/2020/07/16/raspberry-pi-smi/]（在https://github.com/jbentham/rpi]的代码）完成了一个惊人的工作，在黑客攻击此界面中有助于Caribulite＆＃39;技术可行性。 G.J提供界面的更深层次概述。 van loo，2017 [https://github.com/cariboulabs/caribulite/blob/main/docs/secondary%20memory%20Interface.pdf]。 SMI接口允许在RPI和帽之间交换到〜500Mbit / s，但结果在不同版本的RPI之间变化。结果进一步取决于特定的RPI版本和＃39; DMA速度。\n 在我们的应用中，每个ADC样本包含13位（I）和13位（Q），其流动，具有来自AT86RF215 IC的4 MSP的最大采样率。该通道需要4个字节（样本填充到32位）（和I / Q对）=＆gt; 16 mbytes / sec，为128 mbits / sec。除了I / Q中的每一个的13位之外，数据的TX / RX数据流包含流量控制和配置位。 Microchip的调制解调器（AT86RF215）IC包含来自其ADC的两个RX I / Q输出（每个物理信道 -  Sub-1GHz和2.4GHz），以及指向DAC的单个TX I / Q Intput。\n   公司的工作原型版本（Rev1）已经生产和测试以满足产品要求。同时，正在使用以下主要更新制作董事会的第二次修订（见下文图）：\n 图像抑制过滤改进 -  U10和U12（HPF＆amp; LPF） - 已由MiniCircuits的集成LTCC滤波器取代\n 删除FPGA闪存 - 冗余鉴于RPI在SPI中配置FPGA在＆lt; 1SEC中配置FPGA。\n 在Cari​​bulite-R2中，PCB设计已经完全重新思考，以满足其教育需求。 RF路径已经用图标注释，以便于通过其功能而不是逻辑描述符来添加友好的丝绸作品，以简化原理图纸中的方向，并将友好的丝绸写作描述系统＆＃39;符号。 \n注意：间隙由系统的设计载体定义，并且在现实生活中可能不存在。 实际调制解调器综合仪输出测试显示比在数据表中写入的那些更广泛的边缘AR室温，但是，正如Microchip所指出的那样，性能可能受到影响。 注意：（1）特征比较表与其他SDR设备将很快发布（2）上述一些规范是模拟而不是由调制解调器控制的（3）模拟带宽 ", "note_en": "CaribouLite is an affordable, educational, open-source SDR platform that is also a HAT for the Raspberry-Pi family of boards (40-pin versions only). It is built for makers, hackers, and researchers and was designed to complement the SDR current eco-systems offering with a scalable, standalone dual-channel software-defined radio.\n  Unlike many other HAT projects, CaribouLite utilizes the  SMI (Secondary Memory Interface) present on all the 40-pin RPI versions. This interface is not thoroughly documented by both Raspberry-Pi documentation and Broadcomm&#39;s reference manuals. An amazing work done by [ https://iosoft.blog/2020/07/16/raspberry-pi-smi/] (code in [ https://github.com/jbentham/rpi]) in hacking this interface contributes to CaribouLite&#39;s technical feasibility. A deeper overview of the interface is provided by G.J. Van Loo, 2017 [ https://github.com/cariboulabs/cariboulite/blob/main/docs/Secondary%20Memory%20Interface.pdf]. The SMI interface allows exchanging up to ~500Mbit/s between the RPI and the HAT, and yet, the results vary between the different versions of RPI. The results further depend on the specific RPI version&#39;s DMA speeds.\n In our application, each ADC sample contains 13 bit (I) and 13 bit (Q), that are streamed with a maximal sample rate of 4 MSPS from the AT86RF215 IC. This channel requires 4 bytes (samples padded to 32-bit) per sample (and I/Q pair) =&gt; 16 MBytes/sec which are 128 MBits/sec. In addition to the 13 bit for each of I/Q, the Tx/Rx streams of data contain flow control and configuration bits. The modem (AT86RF215) IC by Microchip contains two RX I/Q outputs from its ADCs (one for each physical channel - sub-1GHz and 2.4GHz), and a single TX I/Q intput directed to the DACs.\n   A working prototype version of the board ( REV1) has been produced and tested to meet product requirements.In a meanwhile, a second revision of the board is being produced with the following main updates (see picture below):\n Image rejection filtering improvement - U10 and U12 (HPF &amp; LPF) - have been replaced by integrated LTCC filters by MiniCircuits\n Removing FPGA flash - redundant given the fact that the the RPI configures the FPGA in &lt;1sec over SPI.\n In CaribouLite-R2 the PCB design has been thoroughly re-thought to meet its educational needs. The RF path has been annotated with icons to ease the orientation in the schematics sheets, friendly silk writing was added describing system&#39;s components by their functionality rather than logical descriptors, and more.\n       Note: The gaps are defined by the design constarints of the system and may not exist in real-life hardware. Actual modem synthisizer outputs test show wider margins ar room temperature than those written in the datatsheet, but, as noted by Microchip, performance may suffer.     Note:(1) Feature comparison table with other SDR devices will be published shortly(2) Some of the above specifications are simulated rather than tested(3) Analog bandwidth controlled by the modem", "posttime": "2021-06-17 23:28:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pi,cariboulite,sdr", "title": "CARIBULABS / CARIBULITE  - 将任何40针覆盆子-PI转换为TX / RX 6GHz SDR ", "title_en": "Cariboulabs/cariboulite – turn any 40-pin Raspberry-Pi into a Tx/Rx 6GHz SDR", "transed": 1, "url": "https://github.com/cariboulabs/cariboulite", "via": "", "real_tags": ["pi", "sdr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我一直在听到IO_调节。它是Linux中相对较新的技术，以允许高性能的IO具有很少的开销。\n 每当被提及时，它通常被呈现为选择，民意调查和威拓的新替代方案。这让我相信它只是那些设施的下一次迭代，这就是告知一个程序发生在文件或网络套接字或其他内容的程序中的另一个设施，以便它可以采取行动。换句话说，递增的改进，大概是较少的开销，但否则更多的是。哪个很好，但对我来说无聊：我很了解这个概念，但这些天我跑了其他人和＃39;软件，并不真正写自己，所以我没有太多关心更精细的细节。\n 然后上周我正在观看Brendan Gregg的Lisa21谈话“计算性能：在地平线上”，这张滑块引起了我的注意：\n    我不知道这是“更快的Syscalls”或图表的承诺，但有些东西告诉我，我意识到的是我的意识。我不知道是什么，但我以为我认为我应该尝试一下。\n Thinkng它是一种新的描述符读取性设施，我想只是写一个愚蠢的多用户Telnet聊天服务器。这种程序是对我来说的曾经是面包和黄油一次，很久以前 - 写作泥浆聊天服务器是我开始学习C，UNIX和网络编程的地方。事实证明，这还有很久以前，大多数有趣的信息都脱离了我的头脑。\n 因此，我设计了yoctochat：最简单的聊天服务器的一种形状，每次使用不同的描述符读取性设施多次实现。我开始选择一个，然后是一个投票。 EPOLS版本工具一点时间更长，因为我以前从未使用过，但是因为它更多的是，形状基本相同。\n 随着那些脱离的人，即使是几天，我甚至是yc_uration.c，即使是那些这些计划的人，也是一个人的统一。几次失败后，我开始感受到事物，它开始形成。后来，我停下来做一些房子琐事，正在考虑我建造的程序的形状，它打了我： \nIO_调节根本不是一个事件系统。 io_uring实际上是一般的异步Syscall设施。\n  Classic UNIX IO SYSCALL（例如，read（））都是同步的，阻塞。你称他们为他们，你的程序睡觉，直到你要求的东西发生。在read（）的情况下，即“数据到达”。\n 显而易见的问题是，如果你想一次从多件事中读取（），你会怎么做？如果我们在试图从一件事中读取时阻止怎么办，那么另一件事就会发生一些事情？它可能会永远等待！\n 有一个尴尬的解决方案，如设置警报以中断操作，以便我们可以移动到下一件事，或使用“非阻塞”模式，但两者都有他们的问题。唯一有效的是使用描述符读取性设施，以便我们可以说“当任何这些东西都有要读取的东西时叫醒我，然后告诉我哪些是”。一旦火灾，我们就会通过它报告的东西，并在每个人上呼叫读（），知道他们不会阻止，因为它们都有等待的东西。\n select（）是用于描述符准备的原始UNIX工具。它适用于少数人，但不缩放到很远。 poll（）是创建的，以解决其中一些问题，而是添加了一些问题。大多数Unixlikes在此之后，最重要的系统，最符合的是Linux的ePoll和FreeBSD的kque，这是多年来延伸的迄今为止的武器。它们都是概念上的与旧方法相同：让系统在任何有趣的事情发生的事情发生时唤醒过程，因此该过程可以去采取行动。\n 虽然我会采取不同的方法。它往后回来看看新的眼睛原来的问题，并说它是什么，而不是内核告诉我们什么时候准备好采取行动，以便我们可以接受它，我们告诉内核对我们有什么行动想采取，当条件变得正确时它会这样做。\n 无论如何，这几乎总是我们想要的。在传统的模型中，用户程序调用内核，要求它告诉它，当某些东西已准备就绪时，然后立即调用回内核以使其执行该操作。用户程序之间的任何内容都没有，因此如果可以将这两个调用组合并提交给内核，则用户程序根本不必参与。 \n它的操作也相当简单。所有它确实都分开了一半的呼叫 - 你提出了一个请求，一段时间后，它完成了，你会得到结果。虽然请求和响应以不同方式进行编码（调用名称和参数在您提交的内存缓冲区中，而不是实际函数调用），但它的效果相同 - 内核被要求代表该程序进行操作。\n 整件事件适用于一对队列：提交队列，您将请求服务，以及完成队列，您可以在那里找到与其结果完成的请求。\n 整个“环形缓冲区”和“催促”的东西？他们真的只是实施细节，这可能是这样的方式来解释我的混淆：每个该死的描述都对环形缓冲区感到兴奋，所以我认为它们实际上是它的重要组成部分，当真的感觉更像只是打电话给远程API。\n 自从另一种做Syscalls的方式，它基本上适用于一切，包括文件IO，传统上是难以异步的。所以它有可能使很多程序更简单。\n 一旦我想出来，我留下了非常深刻的印象，我很期待在我使用的更多程序中看到它。我只是希望它周围有点更好的文档，因为我想知道还有多少还没有看过它，因为他们认为这是不同的东西？谁知道！ ", "note_en": "I’ve been hearing about  io_uring on and off for the last couple of years. Its a relatively new technology in Linux to allow high-performance IO with very few overheads.\n Whenever its been mentioned, its usually been presented as a new alternative to  select,  poll and  epoll. This led me to believe that it was just the next iteration of those facilities, which is to say, another facility to inform a program that something has happened on a file or network socket or whatever, so that it can take action. In other words, and incremental improvement, presumably with fewer overheads, but otherwise just more of the same. Which is great, but boring for me: I understand the concept well, but these days I run other peoples&#39; software and don’t really write my own, so I haven’t cared too much about the finer details.\n Then last week I was watching Brendan Gregg’s LISA21 talk “ Computing Performance: On The Horizon”, and this slide caught my eye:\n    I don’t know if it was the promise of “faster syscalls” or the diagram, but something told me there was more to io_uring than I realised. I didn’t know what, but enough that I thought I figured I should try it out.\n Thinkng it was a new kind of descriptor readiness facility, I thought to just write a dumb multiuser telnet chat server. This kind of program was bread-and-butter for me once, long ago - writing MUD-like chat servers was where I got my start learning C, UNIX and network programming. As it turns out though, that was too long ago, and most of the interesting information had fallen out of my head.\n So, I devised  yoctochat: a sort of shape for the simplest possible chat server, implemented multiple times using a different descriptor readiness facility each time. I started with  one for  select, then  one for  poll. The  epoll version tool a little longer because I’d never used it before, but since its more of the same, the shape was basically the same.\n With those out of the way, and a clea runderstanding of what these programs are, even are, a couple of days ago I started on   yc_uring.c. After a few abortive starts I started to get a feel for things and it began to take shape. Later, I stopped to do some house chores and was thinking about the shape of the program I was building, and it hit me:\n io_uring is not an event system at all. io_uring is actually a generic asynchronous syscall facility.\n  The classic UNIX IO syscalls (eg  read()) are all synchronous, and blocking. You call them, and your program goes to sleep until the thing you requested occurs. In the case of  read(), that’s “data arrived”.\n The obvious problem is, what do you do if you want to  read() from more than one thing at a time? What if we block while trying to read from one thing, and then something happens on the other one thing? It might wait forever!\n There are awkward solutions like setting an alarm to interrupt the operation so we can move to the next thing, or using “non-blocking” mode, but both have their problems. The only thing that works is to use a descriptor readiness facility such that we can say “wake me when any of these things have stuff to be read, and then tell me which ones the are”. Once that fires, we go through the things it reported, and call  read() on each of them, knowing that they won’t block because they all have stuff waiting.\n select() is the original UNIX facility for descriptor readiness. It works fine for small numbers of things, but doesn’t scale very far.  poll() was created to address some of its problems, but added some of its own. Most UNIXlikes went their own way with improved systems after this, most notably Linux’s  epoll and FreeBSD’s  kqueue, which have been extended over the years the be the weapon of choice to date. They are all conceptually the same as the old methods though: ask the system to wake the process when something happens to any number of interesting things, so the process can then go and take action each one.\n io_uring takes a different approach though. It goes right back and looks at the original problem with fresh eyes, and says what if, instead of the kernel telling us when something is ready for an action to be taken so that we can take it, we tell the kernel what action to we want to take, and it will do it when the conditions become right.\n This is almost always what we want anyway. In the traditional model, the user program calls into the kernel to ask it to tell it when something is ready, and then immediately afterwards calls back into the kernel to make it perform the action. The user program doesn’t do anything in between, so if those two calls can be combined and submitted to the kernel, the user program doesn’t have to get involved at all.\n Its operation is fairly straightforward too. All it does is split a call in half - you make a request, and some time later, its done and you get the results back. While the requests and responses are encoded differently (the call name and arguments are in a memory buffer that you submit, rather than an actual function call), its the same effect - the kernel is asked to do something on behalf of the program.\n The whole thing works with a pair of queues: the submission queue, where you put requests for service, and the completion queue, where you find completed requests with their results.\n The whole “ring buffer” and “uring” thing? They’re really just implementation details, which probably goes some way to explain my confusion all this time: every damn description gets excited about ring buffers, so I thought they were actually an important part of it, when really it feels a lot more like just calling a remote API.\n And since just another way of doing syscalls, it works for basically everything, including file IO which has traditionally been hard to do asynchronously. So it has the potential to make a lot of programs much simpler.\n I was very impressed once I figured it out, and I’m looking forward to seeing it in more of the programs I use. I just wish it had a bit better documentation around it, because I wonder how many others haven’t yet looked at it because they thought it was something different? Who knows!", "posttime": "2021-06-17 23:28:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "io,uring", "title": "io_uring不是一个事件系统 ", "title_en": "Io_uring is not an event system", "transed": 1, "url": "https://despairlabs.com/posts/2021-06-16-io-uring-is-not-an-event-system/", "via": "", "real_tags": ["io", "uring"]}, {"category": "", "categoryclass": "", "imagename": "41884d0cf5a41b47f0b0cf64c80b4a13.png", "infoid": 1066482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站专用于帮助您启动自己的互联网服务提供商。具体而言，本指南是关于构建无线ISP（WISP）。\n 本指南专注于启动Wisp的最早阶段 - 通过连接前几个客户来确定可行性。在本指南中涵盖的100，1,000或10,000百万客户，有许多挑战将达到100，1,000或10,000个客户。\n 查看The Graham Castlet of Startyourownisp.com的Graham Castleton的文章，宽带早餐，以概述我们如何帮助农村社区改善互联网连接。\n  如果您想要与项目的个性化帮助，请随时与我一起预订。\n 加入讨论！与我（作者）聊天，其他人对此的这种东西感兴趣：#startyourkisp：matrix.org。\n   什么是一个聪明？为什么你想建立一个？还定义了一些术语。\n CostSwhat建立无线互联网服务提供商的费用是成本吗？ （链接到您可以复制和自定义的Google表格。） \n第1步：评估一个区域：确保您的区域是无线互联网网络的好候选者。  第2步：找到光纤提供商：找到您可以购买光纤连接并使用屋顶启动无线网络的建筑物。  第5步：计费和客户管理：确保您能够获得付费并支持您的客户。  第6步：网络拓扑：设计您的网络拓扑，使您的网络可靠和可扩展。 路由器，交换机，IP地址，VLAN等  第9步：营销：让人们了解您的服务，以便他们体验更好的互联网连接！  FORM 477：如何使用FCCForm 477准备和文件，用于确定哪些提供商提供哪些区域。 ISP必须每年递交两次。  工具您将想要安装所需的工具列表，您需要安装READS网站和客户。 \n瞄准描述瞄准逆向的适当技术的反向丘指南。 旨在打印出来并带到网站以供参考。  回程列表如果您只需要从点A到Point B获取实体的无线连接，然后使用此列表挑选正确的设备并将其设置为。  RF基础知识和渠道规划避免通过仔细选择接入点和后窗的频道而自我干扰。  MDU（多个住宅单位）为公寓，公寓，附加排列等服务提供服务的最佳实践  Google Earthsome提示指南和使用Google地球计划和构建网络的技巧。  想捐赠？ Patreon或BTC 1JKA1KDRP3R4XPSXBRJ6NPC6YDLCQQ4BP。 非常感谢！ ©2021 startyourownisp.com  - 使用材料主题使用Hugo构建的文档。 ", "note_en": "This site is dedicated to helping you start your own Internet Service Provider. Specifically this guide is about building a Wireless ISP ( WISP).\n This guide is focused on the very earliest stages of starting a WISP - determining feasibility up through connecting the first few customers. There are many challenges that will come up at 100, 1,000 or 10,000 customers that are not (yet) covered in this guide.\n Check out the article featuring Graham Castleton, author of startyourownisp.com, at  Broadband Breakfast for an overview of how we&#39;re helping rural communities improve their Internet connectivity.\n  If you’d like personalized assistance with a project feel free to  book some time with me.\n Join the discussion! Chat with me (the author) and others interested in this kind of thing here:  #startyourownisp:matrix.org.\n   What is a WISP?And why might you want to build one? Also defines some terminology.\n CostsWhat does it cost to build a wireless Internet Service Provider? (Link to a Google Sheet that you can copy and customize.)\n   Step 1: Evaluate an Area: Make sure your area is a good candidate for a Wireless Internet network.\n Step 2: Find a Fiber Provider: Find a building where you can purchase a fiber connection and use the rooftop to start your wireless network.\n   Step 5: Billing and Customer Management:Make sure you’re able to get paid and support your customers.\n Step 6: Network Topology:Design your network topology to make your network reliable and scalable. Routers, switches, IP addresses, VLANs, etc.\n   Step 9: Marketing:Let people know about your service so they can experience a better Internet connection!\n   Form 477: How to prepare and file with the FCCForm 477 is used by the FCC to determine which providers are servicing which areas. ISPs must file this form twice a year.\n Tools you’ll want to haveA list of the tools you’ll need to install relays sites and customers.\n Aim a BackhaulA guide describing the proper techniques for aiming backhauls. Designed to be printed out and taken to the site for reference.\n Backhaul ListIf you just need to get a solid wireless connection from Point A to Point B then use this list to pick the right equipment and get it set up.\n RF Basics and Channel PlanningAvoid self interference by carefully choosing channels for your access points and backhauls.\n MDUs (Multiple Dwelling Units)Best practices for providing service to apartment buildings, condos, attached townhomes, etc.\n Guide to Google EarthSome tips and tricks for using Google Earth to plan and build your network.\n   Looking to donate?  Patreon or BTC 1JKa1Kdrp3r4xPSXBRJ6nPC6YYdLcqQ4Bp. Many thanks!\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t© 2021 startyourownisp.com –\t\t\t\t\t\t\t\t\t\tDocumentation built with\t\t\t\t\t Hugo\t\t\t\t\tusing the\t\t\t\t\t Material theme.", "posttime": "2021-06-17 23:27:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "启动,start", "title": "启动自己的ISP ", "title_en": "Start Your Own ISP", "transed": 1, "url": "https://startyourownisp.com/", "via": "", "real_tags": ["启动", "start"]}, {"category": "", "categoryclass": "", "imagename": "6d722cf0ea14342e15772f363c9cdee4.png", "infoid": 1066481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个技术深度潜在的帖子，描述了为云中的校正算法交易平台提供幂的自定义消息传递中间件。对于我们系统的高级概述，请参阅此帖子。\n  如概述帖子中所述，我们的系统使用“测序流”架构。\n 以下是对此工作方式的快速描述：系统中的每个输入都被称为定序器称为定序器的中央组件，分配全局唯一的单调序列号和时间戳。该测序的事件流被传播给系统中的所有节点/应用程序，该节点/应用程序仅在这些序列的输入上运行，而不是在尚未排序的任何其他外部输入上运行。在其他应用程序或外部世界可以消耗之前，还必须首先对来自应用程序的任何输出进行排序。由于分布式系统中的所有节点具有完全相同的事件序列，因此它们相对简单地向每个事件到达相同的逻辑状态，而不会产生与节点间通信相关的任何开销或问题。\n  我们随便提到“传播到所有节点”，好像这是一个容易的壮举。这实际上是一个巨大的挑战，有时称为“扇出问题” - 挑战是，序列人正在执行排序的关键任务，也不能通过了解所有客户的任务并主动传输排序消息的任务负担每个客户都。\n 通常，使用UDP组播解决了此问题，其中生产者生成消息一次以及所有感兴趣的消费者都订阅了一个已知的多播组以消耗邮件。在此解决方案中，网络交换机对多个消费者进行数据的“扇出”，有时使用分层组合。这实际上很好，尽管没有陷阱并非没有陷阱，但鉴于UDP是不可靠的，并且很难进行良好的多播设置。我们不能在云中使用多播（否，虚假的多播覆盖无效），我们使用自定义消息层解决了这个问题，由Aeron启发。\n 我们没有直接使用Aeron，因为即使它呼叫自己是留言传输，它还配备了整个模块和服务的生态系统。我们不想采用所有不同的框架件，因为这会限制我们的建筑选择。此外，我们并不熟悉Aeron，并不知道所有的Gotchas。相反，我们决定建立自己的信息巴士，从最佳和最相关的陨石中获取灵感。\n  是的，是的，你是对的 - 尝试在这一天和年龄的年龄创建自己的消息中间件有点疯狂。我的意思是，谈谈重新发明轮子。但它确实有意义，当你想要做的时候不一定是一个具有更多功能的更好的轮子，而是一个只有非常具体的东西（并且快速且可靠地实现它们）的最小专业轮。我们不了解所有启用云的中间件，每秒具有数百万条消息的吞吐量，在一致的子毫秒延迟（除了它之外，我们还没有测试）。 \n让我们回忆起我们试图解决的问题：我们有一条消息，我们需要以最快的方式从生产者发送到一个或多个远程消费者。\n 我们不想为个人消费者承担任何东西：它可能正在与生产者同时处理数据，或者它可能会缓慢且几个小时后面。\n 我们不希望消费者错过在他们下降时产生的消息（可靠的交付）。\n 我们不希望消费者影响生产者 - 例如，如果我们有一个缓慢的消费者，我们不希望它以某种方式“推回”生产者。\n 我们不希望消费者的数量来影响生产者或其他消费者 - 例如，如果我们串联向大量消费者传输消息，那么随着消费者的数量上升，“最后”消费者会增加“最后”消费者的延迟而且整体吞吐量会减少。\n 此外，在我们希望支持具有不同性能特征的消费者的同时，我们希望为常见案例提供优化的快速路径：能够跟上的最新消费者，并且正在实时处理数据因为它可以收到它。\n 我们提出的解决方案是创建一个磁盘备份队列，它使用固定到专用CPU内核的线程在服务器之间复制。请继续阅读，看看如何满足以上所有需求。 \n复制商店是我们用于促进制作人和一个或许多消费者之间的沟通的一般构造。 Producer App将其消息流写入存储，该商店被实现为内存映射文件。使用内存映射的文件允许存储文件的最近内容保留在机器的虚拟内存中。复制服务器的一个或多个线程在同一主机上运行，​​映射了相同的存储文件。每个消费者服务器有一个Replication Server线程，如果商店文件的最后偏移（长度）已更改，则在专用核心上繁忙 - 旋转紧密循环。检测到更改后，将立即读取新记录并通过TCP传输到复制客户端，该复制客户端将它们写入远程服务器上的内存映射文件。然后，消费者应用程序读取商店的这种复制副本，再次可能在专用核心紧密旋转，但这不是强制性的，取决于每个消费者应用程序的个人需求。\n 这种设计的最终结果是，如果消费者与生产者具有相当合理的电流，则复制过程完全在内存中发生，直接从生产者的内存到消费者内存，没有涉及磁盘访问。一旦生产者写入记录，生产者存储文件的大小/偏移量在内存中递增，新的偏移和记录可作为微秒或两个中的Replication Server线程的原子更新。记录可以通过TCP传输到〜50μs（内核/网络延迟）中的消费者服务器，然后在几个微秒内到消费者应用程序。 （在某些时候，操作系统会将商店文件的映射部分刷新到磁盘，这可能导致延迟，但有些方法可以调整操作系统的时间和方式。\n 这一非常简单的解决方案的美丽是生产者从缓慢或远方消费者彻底解耦。即使消费者应用程序在一天中间开始，Replication Server也能够通过从第一条消息读取商店文件（这将涉及磁盘访问，这没问题，因为性能不是主要考虑这个用例）。另一个相关效果是，个人消费者是独立的 - 一个消费者的相对速度不会影响另一个消费者的相对速度。此外，消费者没有以串行方式发送消息，因此没有“第一”或“最后”消费者在延迟方面具有优缺点或不利地位。\n 我们将承认，这些设计昂贵，因为每个消费者服务器都需要生产的服务器上的专用核心（请参阅下面标题为“硬件效率注释”的部分）。如果我们需要这缩小到更多的消费者服务器，而不是我们有核心，我们将使用分层分发模式。现在，我们还没有必要这样做。\n  系统使用多个复制存储器组成。拼图的最后一块是iodaemon，因为名称暗示，负责在服务器上执行I / O.这个想法是，如果在服务器上运行多个应用程序，则可以通过从semencer  -  iodaemon作为复制客户端来通过单个传输获取它们的顺序流。 iodaemon还负责将应用程序输出消息（AKA“未激活的”消息）传输到序列仪以进行排序，以通过UDP单播进行排序。\n  我们不会进入TCP与UDP的任何深度技术细节，但它是一个值得触摸的主题。你什么时候选择一个，另一个？\n TCP是一种面向连接的协议，主要的好处是，通过TCP连接发送的所有数据包都将可靠地从发件人到接收器的方式，并按正确的顺序传递。此外，TCP包含拥塞控制算法，如果使用者无法跟上发送的数据，则返回发件人。所有这些功能都可以有用，但它们确实使协议在处理方面有点沉重。此外，您必须处理建立和维护连接，并从破损的连接中恢复。 \n如果您有一个情况，您对UDP的有损性质没有太烦扰，或者您可以从丢弃的数据包中恢复轻松的方法，您可以决定放弃这些功能，有利于使用更轻的UDP协议。像TCP一样的UDP坐在IP之上，但只有“删除”数据包（数据报），希望路由器将知道将它们引导到接收器的位置。没有连接建立，无法保证数据包将到达目的地。在实践中，它可以合理地运作，数据丢失很小。使用UDP为接收器使用UDP的另一个不同的益处是OS可以多路复用来自多个发送器的流，而不是必须手动组合超过多个TCP连接的数据（其中需要处理公平和饥饿问题）。\n 在我们的情况下，我们使用UDP单播将来自iodaemon的消息传输到定序器，我们实际上关注消息丢失。这不会让我们烦恼太多，因为我们有一种相对简单的方法来检测数据包滴。向定序器发送未驱换消息的iodaemon也在读取顺序流。序列流最终应包含iodaemon发送的所有这些消息。如果在预定义的时间（例如500ms）内未在排序的流上看到一组给定消息，则iodaemon可以假设邮件丢失，并且可以重新发送这些消息。如果消息实际上丢失，重新发送可能会成功，事情恢复正常;如果消息未丢失但只需延迟，则重新发送将导致序列器读取重复的消息，这智能足以丢弃重复项。最终结果是我们为有损失的UDP传输添加了可靠的交付。\n 为了传播测序的流，我们使用TCP，因为没有自然的方法来恢复序列仪中的错过的UDP报文。因此，如上所述，消费者通过复制商店掌握了所有这些情况的不同性能特征和TCP扇出。\n  使用顺序流架构创建交易系统的一种方法是真正将系统上的所有输入序列序列单个顺序流。然而，出于各种原因，特别是当不同类型的输入的比率非常大时，这可能会难以置信。例如，我们可能在系统中有1千个相关的消息，但是10亿市场数据事件。虽然将它们一起排序到单个测序的流和能力方面是完全合理的，但是系统将能够处理它们，只有icky才能咀嚼十亿+消息以便处理1000订单相关的消息。\n 为了简化此用法，我们将市场数据序列到从邮件的其余部分单独的测序流。这有助于我们的订单管理系统（OMS）显着，因为它不需要处理市场数据，并且能够使用更轻微的流。但是，这为我们的ILGO引擎创造了一个问题，这需要订单消息和市场数据。因此，我们实际上从两个组件流创建了一个复合流，并将其馈送到ILGO引擎中。将该复合流记录到磁盘，如果需要，也可用于将其流式传输到远程服务器。结果图像看起来如下。\n  关于这些流消息的内容的单词。从我们的先前经验中，我们知道我们希望为我们的内部通信使用二进制编码，优选地，一个具有固定位置的字段的二进制编码（用于便于随机访问）。在查看几个选项后，我们降落在简单的二进制编码（SBE）上，实际上是一个修复标准。\n SBE快速燃烧，支持直接现场访问，支持版本控制，并提供可以生成Java Encoder /解码器类的消息处理器。我们并没有真正烘焙，并且鉴于SBE是一个修复标准，我们有点朝着它绘制。使用它一段时间后，我会说性能是恒星，但我被特征集所做的，特别是支持不断发展的架构。我们已经扩展了SBE来做我们需要做的事情，但如果我不得不这样做，我会看看Cap'n Proto或FlinBuffers，我们将来可能会这样做。 \n你们中的一些人“正常”工程师可能会在所有这些地方使用专用核心困惑。首先，我们从未说过这是在硬件使用方面有效的！其次，专用核心上的固定线程是一种常见的，通常是实现低延迟的唯一方式。\n 这些线程在紧密的循环中运行，即使没有任何可能的流程，也不会屈服于OS，这在正常的软件架构中是相当不礼貌，但在低延迟的世界中完全被接受！操作系统有围绕此方法 - 例如，如果线程在一段时间内每次发出系统调用（例如，从网络接收消息），则内核将掌握在这些呼叫期间拦截线程必要的。要遍及这个，低延迟开发人员将使用内核旁路完全从这些过程中剪掉内核（例如，DPDK，VMA，OpenOnload）。兔子洞与FPGA，实时内核和其他这样的腹部更深。\n  我们意识到本文中描述的设计不是实现这些结果的唯一方法，实际上我们不确定是否有其他人这么做。我们简单地记录了我们在研究后降落的内容，这仍然是一项过程。\n 作为结束思想，我会在这里重复我在此时在这里所说的 - 如果你认为这很酷或者你可以为这项工作做出贡献，请致电@ProokTrading.com。如果你是技术学家，你擅长你所做的事情，并希望帮助建立一个现代平台并产生影响，有可能为您的证明作用。为了向我们的员工展示我们关心和我们欣赏，我们使他们成为真正的伙伴，拥有英俊的股票赠款，可能比你在职业生涯中看到的任何东西都大。\n 如果您有疑问，请访问我的推特：@preaksanghvi，或在info@prooktrading.com上联系我们。 ", "note_en": "This is a technical deep-dive post describing the custom messaging middleware that powers  Proof’s Algorithmic Trading Platform in the cloud. For a high-level overview of our system, please refer to  this post.\n  As described in the  overview post, our system uses the “sequenced stream” architecture.\n Here’s a quick description of how this works: Every input into the system is assigned a globally unique monotonic sequence number and timestamp by a central component known as a sequencer. This sequenced stream of events is disseminated to all nodes/applications in the system, which only operate on these sequenced inputs, and never on any other external inputs that have not been sequenced. Any outputs from the applications must also first be sequenced before they can be consumed by other applications or the external world. Since all nodes in the distributed system are presented with the exact same sequence of events, it is relatively straightforward for them to arrive at the same logical state after each event, without incurring any overhead or issues related to inter-node communication.\n  We mention “disseminated to all nodes” casually, as if it was an easy feat. This is in fact a huge challenge, sometimes known as the “fanout problem” — the challenge is that the sequencer, which is performing the critical task of sequencing, cannot also be burdened by the task of knowing all its clients and actively transmitting sequenced messages to each of those clients.\n Often, this problem is solved by using UDP multicast, where the producer produces the messages once and all interested consumers subscribe to a known multicast group to consume the messages. In this solution, the network switches do the “fanout” of data to multiple consumers, sometimes using a hierarchical set of switches. This works really well, though it is not without its pitfalls, given that UDP is unreliable and a good multicast setup is hard. We can’t use multicast in the cloud (no, the  fake multicast overlay is not effective), so we solved this problem using a custom messaging layer, inspired by  Aeron.\n We didn’t use Aeron directly because even though it calls itself a message transport, it comes with a whole ecosystem of modules and services. We didn’t want to adopt all of the different framework pieces, as that would limit our architectural choices. Plus, we’re just not that familiar with Aeron and don’t know all of the gotchas. Instead, we decided to build our own message bus, taking inspiration from the best and the most relevant parts of Aeron.\n  Yeah, yeah, you’re right — it is a little bit crazy to try to create your own messaging middleware in this day and age. I mean, talk about reinventing the wheel. But it really does make sense, when what you’re trying to do is not necessarily create a better wheel with more features, but rather a minimal specialized wheel that only does very specific things (and does them fast and reliably). We are not aware of any cloud-enabled middleware with a throughput of millions of messages per second at consistent sub-millisecond latency (except perhaps  this, which we haven’t tested).\n   Let’s recall the problem we are trying to solve: we have a stream of messages that we need to send from a producer to one or more remote consumers, in the fastest way possible.\n We do not want to assume anything about an individual consumer: it may be processing data contemporaneously with the producer, or it may be slow and hours behind.\n We do not want consumers to miss messages that were produced while they were down (reliable delivery).\n We do not want the consumers to affect the producer — for example, if we have a slow consumer, we do not want it to somehow “push back” on the producer.\n We do not want the number of consumers to affect the producer or the other consumers — for example, if we were serially transmitting messages to a large number of consumers, the latency for the “last” consumer would increase as the number of consumers goes up, and overall the throughput would decrease.\n In addition, while we wanted to support consumers with varying performance characteristics, we wanted to have an optimized fast path for the common case: an up-to-date consumer that is able to keep up and is processing data in real-time as fast as it can receive it.\n The solution we came up with is to create a disk-backed queue that is replicated between servers using threads pinned to dedicated CPU cores. Read on to see how this meets all of the above needs.\n  The Replicated Store is a general construct we use to facilitate communication between a producer and one or many consumers. The producer app writes its stream of messages to a store, which is implemented as a memory-mapped file. The use of a memory-mapped file allows the recent contents of the store file to remain in the machine’s virtual memory. One or more threads of a replication server run on the same host, having mapped this same store file. There is one replication server thread per consumer server, and it is busy-spinning on a dedicated core and checking in a tight loop if the last offset (length) of the store file has changed. Once a change is detected, the new records are read immediately and transmitted over TCP to a replication client, which writes them on the remote server to a memory-mapped file. This replicated copy of the store is then read by the consumer apps, again potentially in a tight spin on a dedicated core, though that’s not mandatory and depends on each consumer app’s individual needs.\n The end result of this design is that if the consumer is reasonably current with the producer,  the replication process happens entirely in memory, directly from the producer’s memory to the consumer’s memory, with no disk access involved. As soon as the producer writes a record, the size/offset of the producer store file is incremented in memory, and the new offset and records are available as an atomic update to the replication server thread(s) within a microsecond or two. The records can be transmitted over TCP to the consumer servers in ~50μs (kernel/network latency), and then to the consumer apps in a handful more microseconds. (At some point, the operating system will flush the mapped portions of the store files to disk and this can cause latency, but there are ways to tune when and how the OS does this).\n The beauty of this very simple solution is that the producer is completely decoupled from a slow or a far-behind consumer. Even if the consumer apps were started in the middle of the day, the replication server would be able to service them by reading the store file from the first message (this would involve disk access, and that’s ok because performance is not the primary consideration for this use case). Another related effect is that the individual consumers are independent — the relative speed of one consumer does not affect that of another consumer. Also, the consumers are not being sent the messages in a serial fashion, so there is no “first” or “last” consumer that is advantaged or disadvantaged in terms of latency.\n We’ll admit that the design is expensive in that each consumer server requires a dedicated core on the producer’s server (see below section titled “A Note on Hardware Efficiency”). If we needed this to scale to more consumer servers than we have cores, we would use a hierarchical distribution pattern. For now, we haven’t needed to do this.\n  The system is composed together using a number of these replicated stores. The last piece of the puzzle is the IODaemon, which as the name implies, is responsible for performing I/O on a server. The idea is that if there are multiple apps running on a server, they can all get their sequenced stream through a single transmission from the sequencer — IODaemon acts as the replication client. The IODaemon is also responsible for transmitting application output messages (aka “unsequenced” messages) to the sequencer for sequencing, over UDP unicast.\n  We won’t go into any deep technical details of TCP vs UDP, but it is a topic worth touching upon. When would you select one over the other?\n TCP is a connection-oriented protocol and the primary benefit is that all packets sent over a TCP connection will reliably make their way from the sender to the receiver and be delivered in the right order. In addition, TCP contains congestion control algorithms that push back on the sender if the consumer is unable to keep up with the data being sent. All of these features can be useful, but they do make the protocol a bit heavy in terms of processing. In addition, you have to deal with establishing and maintaining a connection, and recovering from a broken connection.\n If you have a situation where you aren’t too bothered by the lossy nature of UDP, or where you have an easy way to recover from dropped packets, you may decide to forego these features in favor of using a lighter UDP protocol. UDP, like TCP, sits on top of IP, but simply “flings” packets (datagrams) at the network hoping the routers will know where to direct them to get them to the receiver. There is no connection to establish and there is no guarantee that packets will reach their destination. In practice, it works reasonably well, and the data loss is minimal. Another distinct benefit of using UDP for the receiver is that the OS can multiplex the streams coming from multiple senders, as opposed to having to manually combine data coming over multiple TCP connections (where fairness and starvation issues would need to be dealt with).\n In our case, we use UDP unicast to transmit messages from the IODaemon to the Sequencer, and we do in fact care about message loss. This doesn’t bother us too much because we have a relatively easy way to detect packet drops. An IODaemon that is sending unsequenced messages to the sequencer is also reading the sequenced stream. The sequenced stream should eventually contain all of these messages being sent by the IODaemon. If a given set of messages are not seen on the sequenced stream within a predefined amount of time (e.g. 500ms), the IODaemon can assume the messages were lost, and can resend those messages. If the messages were in fact lost, the resend may succeed and things go back to normal; if the messages were not lost but simply delayed, the resend will cause duplicate messages to be read by the sequencer,  which is smart enough to discard the duplicates. The end result is that we’ve added reliable delivery to a lossy UDP transmission.\n For disseminating the sequenced stream though, we use TCP, because there is no natural way to recover missed UDP packets from the sequencer. As such, and as described above, consumers come with varying performance characteristics and TCP fanout via the replicated store handles all of those situations well.\n  One way to create a trading system using the sequenced stream architecture is to truly sequence all of the inputs for the system on a single sequenced stream. However, for various reasons, this may get unwieldy especially when the ratio of different types of inputs is very large. For example, we may have 1 thousand order-related messages in the system, but 1 billion market data events. While it is perfectly reasonable to sequence them together onto a single sequenced stream, and capacity-wise, the system would be able to handle them just fine, there is just something icky about having to chew through a billion+ messages in order to process the 1000 order-related messages.\n In order to streamline this usage, we sequence market data onto a separate sequenced stream from the rest of the messages. This helps our Order Management System (OMS) significantly since it does not need to deal with market data, and is able to work with a much lighter stream. However, this creates an issue for our Algo Engine, which does need  both the order messages and the market data. For this reason, we actually create a composite stream from the two component streams and feed it into the algo engine. This composite stream is recorded to disk and also available to be streamed away to a remote server if necessary. The resulting image looks something like below.\n  A word about the content of these stream messages. From our prior experience, we knew we wanted to use a binary encoding for our internal communication, and preferably, one that has fields at a fixed position (for ease of random access). After looking at a few options, we landed on  Simple Binary Encoding  (SBE), which is in fact a  FIX standard.\n SBE is  blazing  fast, supports direct field access, supports versioning, and provides a message processor that can generate Java encoder/decoder classes. We didn’t really do a full bake-off, and given that SBE is a FIX standard, we were kinda drawn towards it. After using it for a while, I’ll say that the performance is stellar, but I’m underwhelmed by the feature set, and in particular, support for an evolving schema. We’ve already extended SBE to do what we need it to do, but if I had to do this over, I’d look at  Cap’n Proto or  Flatbuffers, which we may yet do in the future.\n  Some of you “normal” engineers may be bewildered at the use of dedicated cores all over the place. First off, we never said this needed to be efficient in terms of hardware usage! Second, pinned threads on dedicated cores is a common, and often the only, way of achieving low latency.\n These threads run in a tight loop and do not yield to the OS even when there is nothing to process, which is rather impolite in normal software architecture but totally accepted in the world of low latency! The OS has ways around this — for example, if the thread is making a system call every once in a while (e.g.  recvmsg to receive a message from the network), the kernel will take the opportunity to intercept the thread during those calls, if necessary. To get around  that, low-latency developers will use kernel-bypass to cut out the kernel from these processes completely (e.g.  DPDK,  VMA,  OpenOnload). And the rabbit hole goes deeper with FPGAs, real-time kernels, and other such contraptions.\n  We realize that the design described in this article is not the only way to achieve these outcomes and in fact, we’re not sure if anyone else does it this way at all. We are simply documenting what we landed on after our research, and this remains a work-in-progress.\n As closing thoughts, I’ll repeat here what I’ve said elsewhere — if you think this is cool or that you can contribute to this work, please reach out at  careers@prooftrading.com. If you are a technologist, you’re good at what you do, and want to help build a modern platform and have an impact, there is likely a role for you at Proof. To show our employees that we care and we appreciate, we make them true partners, with handsome equity grants, possibly larger than anything you’ve seen in your career.\n If you have questions, reach out to me on Twitter:  @preraksanghvi, or reach us at  info@prooftrading.com.", "posttime": "2021-06-17 23:27:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,测序,based,消息", "title": "证明交易的基于云的测序流消息传递架构 ", "title_en": "Cloud-Based Sequenced Stream Messaging Architecture at Proof Trading", "transed": 1, "url": "https://medium.com/prooftrading/proof-engineering-the-message-bus-a7cc84e1104b", "via": "", "real_tags": ["交易", "测序", "based", "消息"]}, {"category": "", "categoryclass": "", "imagename": "11a603cd1d95978d554834623c278a5c.jpg", "infoid": 1066480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "试图重拍汽车保险业的两位竞争对手的波士顿区域初创公司正在加入力量。剑桥移动远程信息处理周三表示，它已经获得了Truemotion在跟踪驱动程序行为领域的领导者，以帮助设置保险费。\n 据熟悉该交易的消息来源，该交易条款未披露，但收购人数在数百万美元中受到价值。\n 合并的公司将雇用大约400人，并为美国25大汽车保险公司中的21人提供远程信息处理服务。如果剑桥手机继续增长，那么就在未来几年内通过较大的技术或保险公司获得公众或许是在轨道上。\n 两家公司的核心产品都是智能手机的应用，这些应用程序在手机中使用传感器来收集有关人们如何驾驶的数据，例如它们是否正在加速，经常制动，或者在应注意时，恢复他们的手机文本马路。\n 汽车保险公司正在竞争，提供跟踪客户的实际驾驶模式的政策，依靠来自剑桥手机，TrueMotion和Arity等公司的技术，这是一个由Allstate创建的五岁的初创公司。通常，汽车保险客户可以支付较低的保费以换取同意相当侵入的监控。\n 使用驾驶数据而不是基于客户的现场生活和其他人口统计数据可以提供具有更准确的设置速率信息的保险公司的充电。它还避免依赖于信用评分等争议数据，这可以反映社会偏见。有些研究表明，人们在知道他们的行为时更加谨慎地开车。\n 剑桥移动首席执行官William Powers表示，该公司还在使用其核心技术来从智能手机收集驾驶数据以扩大保险市场。在家庭安全计划下，公司的系统自动检测汽车事故和传票。权力也在寻找如何利用映射和协助自治车辆的数据。 \n“如果你想到道路上的汽车数量，那条路上的司机数量以及世界上的智能手机数量，这些数字非常迅速地变得非常大，”他说。\n 在消费者越来越多地关注过多的数据收集和与广告商共享时，剑桥移动和特鲁辐射表示他们没有与保险公司以外的任何人分享数据。 “我们的一家公司都不是一个糟糕的演员，我们没有像一些公司一样转售数据，”鲍尔斯说。 “这个想法是使用数据来改进程序并使人们更安全。”\n 两家公司成立于十年前，已收到风险投资支持。 MIT Spinout，剑桥手机，2018年抓住了日本的Softbank Vision基金的5亿美元的投资。并且Truemotion从一般催化剂，贝恩首都，十届Coves Capital，宣言合作伙伴和湖明星获得了较小的总和。 （Truemotion开始作为Censio，由前Zipcar首席执行官Scott Griffith领导，他去福特汽车公司）\n 在克罗斯斯敦的竞争对手发现自己越来越多地竞争同样的交易之后，合并了。\n “我们恰好基于彼此的后院，每次我们都会进入交易竞争，就会剩下两个，即我们，”TED格雷默，TreeMotion的前任首席执行官现在是剑桥手机的首席运营官。 “所以有一些工业逻辑，至少探索了一起工作的机会。” ", "note_en": "Two rival Boston-area startups trying to remake the auto insurance industry are joining forces. Cambridge Mobile Telematics said Wednesday it has acquired TrueMotion to create a leader in the field of tracking driver behavior to help set insurance rates.\n Terms of the deal weren’t disclosed, but the acquisition was valued in the hundreds of millions of dollars, according to a source familiar with the transaction.\n The combined company will employ about 400 people and provide telematics services to 21 of the 25 largest auto insurers in the United States. If Cambridge Mobile continues to grow, it would be on track to go public or perhaps be acquired by a larger tech or insurance firm in the next few years.\n Both companies’ core products are apps on smartphones that use the sensors in the phones to collect data about how people are driving, such as whether they are speeding, frequently braking hard, or picking up their phones to text when they should be paying attention to the road.\n Auto insurers are racing to offer policies that track customers’ actual driving patterns, relying on technology from companies such as Cambridge Mobile, TrueMotion, and Arity, a five-year-old startup created by Allstate. Typically, auto insurance customers can pay lower premiums in exchange for agreeing to the rather intrusive monitoring.\n Using driving data instead of charging based on where customers live and other demographics data could provide insurers with more accurate information for setting rates. It also avoids relying on controversial data like credit scores, which can reflect societal biases. And  some studies have shown that people drive more cautiously when they know their behavior is being tracked.\n Cambridge Mobile CEO William Powers said the company also is using its core technology of collecting driving data from smartphones to expand beyond the insurance market. Under a family safety program, the company’s system automatically detects car accidents and summons help. Powers also is looking at how to leverage the data for mapping and assisting autonomous vehicles someday.\n  “If you think about the number of cars on the road, the number of drivers on the road, and the number of smartphones in the world, these numbers get really large really quickly,” he said.\n At a time when consumers are growing more concerned about excessive data collection and sharing with advertisers, Cambridge Mobile and TrueMotion said they have not been sharing data with anyone other than insurers. “Neither one of our companies is a bad actor and we’re not reselling data like some companies do,” Powers said. “The idea is to use the data to improve the program and to make people safer drivers.”\n Both firms, which were founded about a decade ago, have received venture capital backing. Cambridge Mobile, an MIT spinout, grabbed a $500 million investment from Japan’s SoftBank Vision Fund in 2018. And TrueMotion has received smaller sums from General Catalyst, Bain Capital Ventures, Ten Coves Capital, Declaration Partners, and Lake Star. (TrueMotion started out as Censio, led by former Zipcar CEO Scott Griffith, who went on to Ford Motor Co.)\n The merger came about after the crosstown rivals found themselves increasingly competing for the same deals.\n ”We happen to be based in each other’s backyard and every time we would get into deal competition, there would be two left, that would be us,” said Ted Gramer, TrueMotion’s former CEO, who is now chief operating officer at Cambridge Mobile. “So there was some industrial logic that made sense to at least explore the opportunity to work together.”", "posttime": "2021-06-17 23:27:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "初创,startups,数据", "title": "波士顿初创公司合并以创建保险业的司机跟踪巨头 ", "title_en": "Boston startups merge to create driver-tracking giant for insurance industry", "transed": 1, "url": "https://www.bostonglobe.com/2021/06/17/business/boston-startups-merge-create-driver-tracking-giant-auto-insurance-industry/", "via": "", "real_tags": ["初创", "startups", "数据"]}, {"category": "", "categoryclass": "", "imagename": "7a923ffe3f86e2069282384ca602b6dd.jpg", "infoid": 1066479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "航空公司是空中污染的主要来源，使其更具可持续性是政府和航空业的目标。 There have been several proposed solutions to this problem by private companies and  elected officials, but a new sort of engine could reduce emissions and fuel consumption without having to sacrifice the existing convenience of air travel.当然，这个新的发动机不是作为超音速飞行的迷人，但它对环境更好。\n 由佛朗美航空航天公司CFM的开发，＆＃39; S称为AN＆＃34;开放式转子＆＃34;发动机，其野性的设计是它是现有高旁路涡扇发动机的演变。在没有穿越整流罩的情况下，大型转子叶片暴露于露天，以及一系列可调定子，以平滑气流。由于其非管道设计，风扇叶片可以具有更大的表面积并且更有效。这些开放式转子发动机，也称为＆＃34;道具粉丝，＆＃34;有可能使空中旅行更加清洁，更经济。\n   CFM-French发动机建设者Safran的一半 - 自2017年以来一直在试验这个想法。实际上，它建立了一个功能原型回来测试了这个想法。据称，双原则，对抗旋转设计在保持类似的推力水平的同时产生燃料消耗和排放的两位数百分比。然后噪音被引用为＆＃34;可比较＆＃34;对于现有的涡轮机，可能已经表明存在一些障碍来克服这些设计。但是，这款新电机是不同的。\n 新的开放式转子发动机，正在通过可持续发动机的革命性创新（上升）计划开发，只有一个坐在它后面的一个风扇刀片和可变几何定子。这种布局预计将更加高效，更加安静。它还将利用最新的风扇刀片技术，意味着碳纤维复合材料肯定会涉及。初步估计说，可以预期排放量和燃料消耗的减少20％，与今天的已经高效的Theofans竞争，＆＃39\n  当然，道具粉丝不是新技术。他们在20世纪70年代进行了对石油危机的反应，但由于恢复低燃料成本和储物室内噪音的水平，而且当时克服的内部噪音水平，这一想法是为商业航空的搁置。然而，随着与现代涡轮机相比，早期原型显示出额外的燃料效率为30％的燃料效率。\n 今天，燃料仍然相对便宜，但政府开始进一步限制客机的排放，以减轻气候变化。突然间，投资新的商业航空推进形式是有道理的，即使是从GE，Pratt＆amp的喜欢的更高效的涡轮机的兴起，也是如此。惠特尼，滚动罗伊斯和CFM本身。\n  CFM表示，在上升计划下的发动机赢得了＆＃39; t闪电速度看到的闪电速度＆＃39; s留下的闪电。在所有的扭结都有一定的扭结之前，这可能是十年，他们开始被钉在客机上。与此同时，最大，最强大的喷气发动机是由通用电气生产的，另一半的跨大西洋CFM合作伙伴关系。 GE9X很快就会在波音的翅膀下开始嗡嗡作响。新的777 x。即使这些道具粉丝是下一个大的东西，涡轮机也是用相当大的爆炸出去的。 ", "note_en": "Airlines are a major source of airborne pollution, and making them more sustainable is  a goal of governments and the aviation industry alike. There have been several proposed solutions to this problem by private companies and  elected officials, but a new sort of engine could reduce emissions and fuel consumption without having to sacrifice the existing convenience of air travel. Sure, this new engine isn&#39;t quite as glamorous as  supersonic flight, but it is much better for the environment.\n Under development by the Franco-American aerospace company CFM, it&#39;s called an &#34;Open Rotor&#34; engine, and its wild-looking design is the result of it being an evolution of existing high-bypass turbofan engines. Without a cowling, the large rotor blades are exposed to the open air along with a series of adjustable stators to smooth the airflow. Thanks to its non-ducted design, the fan blades can have a larger surface area and be more efficient. These open rotor engines, also known as &#34;prop fans,&#34; have the potential to make air travel much cleaner and more economical.\n   One-half of CFM—French engine builder Safran—has been experimenting with the idea since 2017. In fact, it built a functional prototype back then to test the idea. The twin-prop, contra-rotating design was claimed to produce a double-digit percentage reduction in fuel consumption and emissions while maintaining similar thrust levels. The noise back then was cited as &#34;comparable&#34; to existing turbofans, which may have indicated there were some hurdles to overcome with the design. This new motor is different, though.\n The new open rotor engine, being developed under the Revolutionary Innovation for Sustainable Engines (RISE) program, has only a single fan blade and a variable geometry stator sitting behind it. This layout is expected to be more efficient and significantly quieter. It will also utilize the latest in fan blade technology, meaning carbon fiber composites will definitely be involved. Preliminary estimates say a 20 percent reduction in emissions and fuel consumption can be expected, and that&#39;s competing with the already-efficient turbofans of today.\n  Prop fans are not new technology, of course. They were experimented with in the 1970s as a reaction to the oil crisis, but the idea was shelved for commercial aviation due to a return to low fuel costs and a level of in-cabin noise that couldn&#39;t be overcome at the time. The gains were real, however, as early prototypes showed fuel efficiency improvements  in the neighborhood of 30 percent as compared to contemporary turbofans.\n Today, fuel is still relatively cheap but governments are beginning to further restrict emissions from airliners in an attempt to alleviate climate change. Suddenly, investing in a new form of propulsion for commercial aviation makes sense business-wise, even with the rise of ever-more efficient turbofans from the likes of GE, Pratt &amp; Whitney, Rolls Royce, and CFM itself.\n  CFM says that engines under the RISE program won&#39;t be arriving with lightning speed seeing as there&#39;s plenty more R&amp;D left. It will likely be a decade before all of the kinks are worked out and they start getting tacked onto airliners. In the meantime, the largest and most powerful jet engine ever is being produced by General Electric, the other half of the trans-Atlantic CFM partnership.  The GE9X is set to start humming away soon under the wings of Boeing&#39;s new 777X. Even if these prop fans are the next big thing, turbofans are going out with a considerable bang.", "posttime": "2021-06-17 23:26:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "转子,open,发动机", "title": "野生的“开放式转子”发动机可以通过巨大的20％削减客机排放 ", "title_en": "Wild-Looking ‘Open Rotor’ Engine Could Cut Airliner Emissions by a Massive 20%", "transed": 1, "url": "https://www.thedrive.com/tech/41123/wild-looking-open-rotor-engine-could-cut-airliner-emissions-by-a-massive-20-percent", "via": "", "real_tags": ["转子", "open", "发动机"]}, {"category": "", "categoryclass": "", "imagename": "1e22bfe44e201b8f927709ea24b9d0e7.jpg", "infoid": 1066478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“人是任何组织的骨干。人们比产品更重要。没有人，你没有产品，“Joseph Ifiegbu说，他是Snap的人力资源技术领导，也以前的Wewore人民分析团队。\n Ifiegbu的初创公司称为Eqtble，想要为人力资源团队提供同类的详细分析，产品，销售和营销部门已经长时间拥有了很长时间，其目标是创建更多有订阅和包容性工作场所。本公司A组合员ALUM今天宣布，由初始化资本领导的种子资金筹集了270万美元，参与了SB机会基金，RS Ventures和其他风险投资公司和天使投资者。\n  Ifiegbu于2017年加入Wework的人民分析团队，当公司共有约2,000名员工时。当他离开2020年的时候，这个数字已经增长到15,000人。 Ifiegbu首次聘请Wework是Gabe Horwitz，是人民分析团队和现在Eqtble的联合创始人和首席产品官员的第一个数据科学家。 Startup的第三个联合创始人和首席技术官员是Ethan Veres。\n 在许多公司，特别是在迅速增长的公司中，劳动力数据分散在不同的人力资源软件上，包括人力资源信息系统（HRIS），订婚平台，福利计划和员工调查。\n 因为信息如此分散，所以公司可以错过重要的相关性。例如，他们可能没有看到为什么顶级员工正在退出的链接以及促进人们通常需要多长时间，或者忽略不平等。这反过来又影响了公司的文化，包括其多样性，公平和包容以及保留有才华的能力的方法。\n   随着Wewore迅速缩放，人们分析团队建立工具以分析来自公司的数据。\n “有很多问题被问到，比如我们的推广是什么样的？我们的消磨是什么，我们比女性更多的男人吗？我们的流程中有所有这些问题和瓶颈，我们希望了解我们的员工，“Ifiegbu说。 “所以我们建立了系统以捕获所有数据，清洁它，结构，并为我们的领导提供仪表板的见解。” \n这个过程需要大约两年了，人民分析团队最终成长为15人。 Ifiegbu和Horwitz意识到有许多需要同类分析的公司，但没有韦沃的资源。这会提示他们开始在EQTBLE上工作。\n “我们花了这么长的时间，很多钱，因为我们有这支球队[在Wework]，”他说。 “那么我们如何建立一种向他们提供这些见解的东西，但没有考虑到这一点，因为我们意识到领导力和决策者具有对其员工做出决定的决定是非常重要的。”\n  当前版本的EQTBLE可以在六周内仓库，IFiegbu表示，该公司的目标是缩短该过程仅仅两天。 EQTBLE是部门的不可知论者，其目标客户是高增长公司，员工250至约3,000名员工。\n 人力资源分析平台可以收集来自100多个来源的数据（包括工作日，ADP，Oracle，PeopleSoft，音乐和文化放大器，为少数几个）提供有关四个主要领域的见解和可视化：人才招聘，劳动力，参与（包括磨损，或工人戒烟）和补偿。\n  该平台可以帮助人力资源团队的一件事是确定为什么顶级候选人正在下降的优惠。\n 例如，EQTBLE的客户之一意识到他们的招聘经理正在通过更多的应用程序，而不是时间看。这创造了一个瓶颈，因为他们无法快速采访别人。其他客户看到候选人正在辍学，因为面试过程太长了。\n “如果你作为一个组织说'我们要有六轮采访，那么采访需要三个月的时间，你将失去良好的候选人，”Ifiegbu说。 “其他人在一到两周内在结束候选人。” \n一家公司使Dei承诺很容易，但即使是一个组织不愿意审查自己，也不会导致进步。由于Eqtble将数据与公司相结合，因此在决策者实现发生的事情之前，它可以突出潜在问题。\n “去年，所有的公司都说，'哦，我们要这样做，我们要做所有这些东西，'而且就像，好的，好，你可以说什么，但真相是你Ifiegbu说，不能改变你不衡量的东西。\n 例如，一家公司可能会为在男人和女性之间平等划分的劳动力而感到自豪，或者在现实是其中许多人没有得到或被晋升为管理角色。\n “如果您没有看到女性和颜色人民的较高水平，那50/50并不意味着什么。我们正在做的是向您展示您组织的照片。如果您可以看到它的不同部分，您可以看到您可以改进的零件，并采取可操作的步骤，而不仅仅是对媒体的唇部服务，“Ifiegbu说。 “eqtble表面您可以改进或在您做得好的地方，所以你可以继续这样做。”\n  IFieGBU很兴奋，人力资源分析空间正在获得关注。 “我觉得使用数据来驱动决策是如此重要的事情，最终建立了一个更健康的公司。”\n 种子资金将用于发展EQTBLE的工程团队及其平台的机器学习和可视化能力，以及用户采集。\n 在一份声明中，初始化的资本合作伙伴和詹·沃尔夫总统表示，“像Dei或公平赔偿等重要的组织问题并不只是一个公司可以检查的盒子，他们采取诚实的承诺。愿意使承诺的公司不应该等待几个月或者被金融投资劝阻，以了解他们已经拥有的数据来实现这些有意义的变化。 EQTBLE团队知道如何解决这个问题，他们赋予其他公司能够这样做。“ ", "note_en": "“People are the backbone of any organization. People are more important than the product. Without people, you don’t have a product,” says Joseph Ifiegbu, who is Snap’s former head of human resources technology and also previous lead of WeWork’s People Analytics team.\n Ifiegbu’s startup, called  eqtble, wants to give HR teams the same kind of detailed analytics that product, sales and marketing departments have had for a long time, with the goal of creating more engaged and inclusive workplaces. The company, a Y Combinator alum, announced today it has raised $2.7 million in seed funding, led by Initialized Capital, with participation from SB Opportunity Fund, RS Ventures and other venture capital firms and angel investors.\n  Ifiegbu joined WeWork’s People Analytics team in 2017, when the company had a total of about 2,000 employees. By the time he left in 2020, that number had grown to 15,000 people. One of Ifiegbu’s first hires at WeWork was Gabe Horwitz, the first data scientist on the People Analytics’ team and now eqtble’s co-founder and chief product officer. The startup’s third co-founder and chief technology officer is Ethan Veres.\n At many companies, especially ones that are growing quickly, workforce data is scattered across different HR software, including human resources information systems (HRIS), engagement platforms, benefit programs and employee surveys.\n Because information is so fragmented, companies can miss important correlations. For example, they might not see the links between why top employees are quitting and how long it typically takes to promote people, or overlook pay inequality. This in turn impacts a company’s culture, including its approach to diversity, equity and inclusion, and ability to retain talented people.\n   As WeWork was rapidly scaling, the People Analytics team built tools to analyze data from across the company.\n “There were a lot of questions being asked, like what is our promotion like? What is our attrition, are we hiring more men than women? There were all these questions and bottlenecks in our processes, and we wanted to have an understanding of our employees,” says Ifiegbu. “So we built systems to capture all that data, clean it, structure it and deliver dashboard insights to our leadership.”\n The process took about two years, and the People Analytics team eventually grew to 15 people. Ifiegbu and Horwitz realized there were many companies that needed the same kind of analytics, but didn’t have WeWork’s resources. This prompted them to start working on eqtble.\n “It took us such a long time and quite a bit of money because we had this team [at WeWork],” he says. “So how do we build something that delivers these insights to them, but doesn’t take that much time to do it, because we realize it’s very important that leadership and decision makers have the data to make decisions about their employees.”\n  The current version of eqtble can be onboarded in six weeks, and Ifiegbu says the company’s goal is to shorten that process to just two days. Eqtble is sector agnostic and its target customers are high-growth companies that have between 250 to about 3,000 employees.\n The human resources analytics platform can collect data from more than 100 sources (including Workday, ADP, Oracle, PeopleSoft, Qualtrics and Culture Amp, to name a few), and deliver insights and visualizations about four main areas: talent recruitment, workforce, engagement (including attrition, or when workers quit) and compensation.\n  One of the things the platform can help HR teams do is identify why top candidates are declining offers.\n For example, one of eqtble’s clients realized that their hiring managers were being passed more applications than they had time to look at. This created a bottleneck, because they weren’t able to interview people quickly enough. Other clients saw that candidates were dropping out because the interview process was too long.\n “If you as an organization are saying ‘we’re going to have six rounds of interviews, it’s going to take three months to interview, you’re going to lose out on good candidates,” says Ifiegbu. “Other people are closing candidates within one to two weeks.”\n  It’s easy for a company to make DEI pledges, but even the best of intentions don’t result in progress if an organization isn’t willing to scrutinize itself. Because eqtble combines data from across a company, it can highlight potential issues before decision makers realize what is happening.\n “Last year, all the companies were saying, ‘oh, we’re going to do this, we’re going to do all these things,’ and it’s like, ok, great, you can say anything, but the truth is you cannot change what you don’t measure,” says Ifiegbu.\n For example, a company might be be proud of having a workforce that is divided equally between men and women, or that has a large percentage of people of color, when the reality is that many of them aren’t getting raises or being promoted into management roles.\n “That 50/50 doesn’t mean anything if you don’t see representation at higher levels for women and people of color. What we’re doing is showing you a picture of your organization. If you can see the different parts of it, you can see the parts you can improve on and take actionable steps, not just lip service for the media,” says Ifiegbu. “Eqtble surfaces places you can improve or places where you are doing well so you can keep doing that.”\n  Ifiegbu is excited that the HR analytics space is gaining attention. “I feel like using data to drive decisions is such an important thing, and ultimately builds a healthier company.”\n The seed funding will be used to grow eqtble’s engineering team and its platform’s machine learning and visualization capabilities, and user acquisition.\n In a statement, Initialized Capital partner and president Jen Wolf said, “Important organizational issues like DEI or equitable compensation are not simply a box a company can check, they take honest commitment. Companies willing to make that commitment shouldn’t have to wait months or be discouraged by the financial investment it takes to understand the data they already own to make these meaningful changes. The eqtble team knows how to solve this, and they’re empowering other companies to do so.”", "posttime": "2021-06-17 22:45:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据分析,platform", "title": "EQTBLE，一个使用数据分析创建更健康工作场所的平台，提高了2.7米的种子 ", "title_en": "\n\t\t\t\teqtble, a platform that uses data analytics to create healthier workplaces, raises $2.7M seed\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/eqtble-a-platform-that-uses-data-analytics-to-create-healthier-workplaces-raises-2-7m-seed/", "via": "", "real_tags": ["数据分析", "platform"]}, {"category": "", "categoryclass": "", "imagename": "70ebe46a2c7e97d8570ed6998328f379.jpg", "infoid": 1066477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Chris Nicholson是Pathmind的创始人兼首席执行官，该公司将深入加强学习应用于工业运营和供应链。\n  大多数机器学习算法在街道上喊叫。他们表现了一个人可以在一秒钟内完成的看法任务。但另一种艾美 - 深入加强学习 - 是战略性的。它学会如何采取一系列行动以达到目标。这是强大而聪明的 - 它会改变很多行业。\n AI转化尖端的两种行业是制造和供应链。我们制造和运输物品的方式严重依赖于工作的机器组，这些机器的效率和弹性是我们经济和社会的基础。没有他们，我们不能购买我们生活和工作所需的基础知识。\n  像协变量一样的初创公司，Ocado的亲属和明亮的机器正在使用机器学习和加固学习，改变机器如何控制工厂和仓库，解决困难的挑战，例如让机器人检测和拾取各种尺寸和形状的物体，其中。他们正在攻击巨大的市场：去年工业控制和自动化市场价值为1520亿美元，而物流自动化价值超过500亿美元。\n  作为技术人士，您需要很多事情来制作深入的加强学习工作。第一份想想的是你将如何让你的深度加强学习代理能够练习你想要的技能。只有两种方式 - 使用真实数据或通过模拟。每种方法都有自己的挑战：必须收集和清洁数据，而必须构建和验证模拟。\n 一些例子将说明这意味着什么。 2016年，Googlex宣传其机器人“ARM农场” - 装满了机器人武器的空间，这些空间正在学习掌握物品并教授其他人如何做到这一点 - 这是加强学习算法在真实环境中练习其移动的一个早期方法并衡量其行动的成功。对目标导向的算法所需的反馈循环是学习的：它必须进行顺序决策，并查看它们的领先位置。\n 在许多情况下，构建强化学习算法可以学习的物理环境是不可行的。假设您希望测试不同策略，以便将数千名卡车从许多工厂移动到许多零售店的队伍。测试所有可能的策略将是非常昂贵的，这些测试不仅会花钱运行，但失败的运行将导致许多不满意的客户。 \n对于许多大型系统，唯一可能的方法可以使用仿真。在这些情况下，您必须创建要理解的物理系统的数字模型，以便生成数据强化学习需求。这些型号称为，交替，数字双胞胎，模拟和加强学习环境。它们本质上都意味着制造和供应链应用中的同样的东西。\n 重新创建任何物理系统需要了解系统如何运作的域专家。这对于单个履行中心的系统来说，这可能是一个问题，因为这是建造这些系统的人可能已经离开或死亡，并且他们的继任者学会了如何运行但不重建它们。\n 许多仿真软件工具提供低码接口，使域专家能够创建这些物理系统的数字模型。这很重要，因为域专业知识和软件工程技能往往无法在同一个人中找到。\n  为什么你会在一个算法遍及所有这些麻烦？由于深度加强学习始终产生其他机器学习和优化工具的结果。当然，Deepmind使用它来击败世界棋盘游戏的世界冠军。强化学习是算法的一部分，这是实现挑战结果与国际象棋，蛋白质折叠和atari游戏实现突破性结果。同样，Openai训练有素的深度加强学习，在Dota 2击败最好的人类团队。\n 就像深度人工神经网络开始在2010年中期找到商业应用，在Geoffrey Hinton被Google和Yann Lecun聘请的Facebook之后，因此，深度加固学习将对产业产生越来越大。当我们用Go看时，它将导致机器人自动化和系统控制的量子改进。这将是我们最好的，并且长期射门。\n 这些收益的后果将是巨大的效率和制造产品和运营供应链节省成本的增加，导致碳排放和工地事故减少。并且，要清楚地，物理世界的窒息和挑战是我们周围的。就在去年，由于Covid，锁定，苏伊士运河崩溃和极端天气事件，我们的社会受到多种供应链中断的击中。\n 在Covid上放大，即使在发达和批准之后，许多国家也遇到了困难并迅速分发。这些是制造和供应链问题，涉及我们无法为历史数据做好准备的情况。他们需要模拟来预测会发生什么，以及在他们最近的书中所示的迈克尔刘易斯在“预防”中所示的迈克尔刘易斯时，我们如何如何解决危机。 \n正是这种制约因素和新挑战的组合，在工厂和供应链中发生的加强学习和仿真可以帮助我们更快地解决。 我们肯定会在未来面对更多。 ", "note_en": "Chris Nicholson is the founder and CEO of  Pathmind, a company applying deep reinforcement learning to  industrial operations and supply chains.\n  Most machine learning algorithms are shouting names in the street. They perform perceptive tasks that a person can do in under a second. But another kind of AI — deep reinforcement learning — is strategic. It learns how to take a series of actions in order to reach a goal. That’s powerful and smart — and it’s going to change a lot of industries.\n Two industries on the cusp of AI transformations are manufacturing and supply chain. The ways we make and ship stuff are heavily dependent on groups of machines working together, and the efficiency and resiliency of those machines are the foundation of our economy and society. Without them, we can’t buy the basics we need to live and work.\n  Startups like  Covariant,  Ocado’s Kindred and  Bright Machines are using machine learning and reinforcement learning to change how machines are controlled in factories and warehouses, solving inordinately difficult challenges such as getting robots to detect and pick up objects of various sizes and shapes out of bins, among others. They are attacking enormous markets: The industrial control and automation market was worth  $152 billion last year, while logistics automation was valued at more than  $50 billion.\n  As a technologist, you need a lot of things to make deep reinforcement learning work. The first piece to think about is how you will get your deep reinforcement learning agent to practice the skills you want it to acquire. There are only two ways — with real data or through simulations. Each approach has its own challenge: Data must be collected and cleaned, while simulations must be built and validated.\n Some examples will illustrate what this means. In 2016, GoogleX advertised its robotic “arm farms” — spaces filled with robot arms that were learning to grasp items and teach others how to do the same — which was one early way for a reinforcement learning algorithm to practice its moves in a real environment and measure the success of its actions. That feedback loop is necessary for a goal-oriented algorithm to learn: It must make sequential decisions and see where they lead.\n In many situations, it is not feasible to build the physical environment where a reinforcement learning algorithm can learn. Let’s say you want to test different strategies for routing a fleet of thousands of trucks moving goods from many factories to many retail outlets. It would be very expensive to test all possible strategies, and those tests would not just cost money to run, but the failed runs would lead to many unhappy customers.\n For many large systems, the only possible way to find the best action path is with simulation. In those situations, you must create a digital model of the physical system you want to understand in order to generate the data reinforcement learning needs. These models are called, alternately, digital twins, simulations and reinforcement-learning environments. They all essentially mean the same thing in manufacturing and supply chain applications.\n Recreating any physical system requires domain experts who understand how the system works. This can be a problem for systems as small as a single fulfillment center for the simple reason that the people who built those systems may have left or died, and their successors have learned how to operate but not reconstruct them.\n Many simulation software tools offer low-code interfaces that enable domain experts to create digital models of those physical systems. This is important, because domain expertise and software engineering skills often cannot be found in the same person.\n  Why would you go through all this trouble for a single algorithm? Because deep reinforcement learning consistently produces results that other machine learning and optimization tools are incapable of.  DeepMind used it, of course, to beat the world champion of the board game of Go. Reinforcement learning was part of the algorithms that were integral to achieving breakthrough results with chess, protein folding and Atari games. Likewise,  OpenAI trained deep reinforcement learning to beat the best human teams at Dota 2.\n Just like deep artificial neural networks began to find business applications in the mid-2010s, after Geoffrey Hinton was hired by Google and Yann LeCun by Facebook, so too, deep reinforcement learning will have an increasing impact on industries. It will lead to quantum improvements in robotic automation and system control on the same order as we saw with Go. It will be the best we have, and by a long shot.\n The consequence of those gains will be immense increases in efficiency and cost savings in manufacturing products and operating supply chains, leading to decreases in carbon emissions and worksite accidents. And, to be clear, the chokepoints and challenges of the physical world are all around us. Just in the last year, our societies have been hit by multiple supply chain disruptions due to COVID, lockdowns, the Suez Canal debacle and extreme weather events.\n Zooming in on COVID, even after the vaccine was developed and approved, many countries have had trouble producing it and distributing it quickly. These are manufacturing and supply chain problems that involve situations we could not prepare for with historical data. They required simulations to predict what would happen, as well as how we could best address crises when they do occur, as Michael Lewis illustrated in his recent book “ The Premonition.”\n It is precisely this combination of constraints and novel challenges that take place in factories and supply chains that reinforcement learning and simulation can help us solve more quickly. And we are sure to face more of them in the future.", "posttime": "2021-06-17 22:44:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加强,reinforcement,学习", "title": "深度加强学习将改变制造业，因为我们知道它 ", "title_en": "\n\t\t\t\tDeep reinforcement learning will transform manufacturing as we know it\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/deep-reinforcement-learning-will-transform-manufacturing-as-we-know-it/", "via": "", "real_tags": ["加强", "学习"]}, {"category": "", "categoryclass": "", "imagename": "fdb437b2e6c96166fcf32a1a188c3f12.jpg", "infoid": 1066474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德国出生的程序员和Crypto Trader忘了密码解锁他的数字钱包，其中包含7,002位比特币，现在价值2.25亿美元。 Quantum计算机比传统电脑速度快几百万次，可能很容易帮助他破解代码。\n  虽然量子计算在其初期，但微软和谷歌等政府和私营部门公司仍然在努力使其成为现实。在十年之下，量子计算机可能足够强大，以打破保护手机，银行账户，电子邮件地址和 - 是 - 比特币钱包的加密安全性。\n ＆＃34;如果您今天有Quantum计算机，而且您是一个国家赞助商 - 例如，例如 - 最可能在大约八年内，您可以在区块链上裂开钱包，＆＃34; Creatpurrency矿业专家马拉松数字控股首席执行官的弗雷德·蒂尔。\n 这恰恰是为什么世界各地的加密人员正在竞争以构建量子抗性加密协议。\n  现在，世界上的大部分地区都在叫做不对称加密的东西上运行，其中个人使用私人和公钥对来访问电子邮件和加密钱包等事物。\n ＆＃34;每个单一的金融机构，每次打电话的每一个登录 - 都是基于非对称密码学，这易于用Quantum计算机进行黑客攻击;泰尔说。 Thiel是欧洲最大的加密公司之一Utimaco的前任主任，它与Microsoft，Google和Others在Quantum upotum加密上工作。\n  公私密钥对允许用户使用私钥生成数字签名，这些钥匙可以由具有相应公钥的人验证。 \n在诸如比特币等加密货币的情况下，这种数字签名称为椭圆曲线数字签名算法，它确保了比特币只能由合法的所有者花费。\n 从理论上讲，使用量子计算的人可以反向工程师私钥，伪造您的数字签名，然后清空比特币钱包。\n ＆＃34;如果我在恐惧中打交道......我＆＃39; D告诉你，在Quantum Computers的第一类数字签名中是椭圆曲线，因为我们今天使用它们，对于比特币钱包，＆＃34;塞尔斯滕·雷雷克，前Utimaco CTO和量子计算领域的顶级专家之一。\n  Crypto专家告诉CNBC，他们逃离了所有这些担心衡量比特币钱包的所有原因。\n Castle Island Ventures创始合作伙伴NIC Carter指出量子突破将是渐进的而不是突然。\n ＆＃34;如果量子计算达到成熟和复杂性的阶段，我们将有大量的预警，它开始威胁我们的核心加密原语，＆＃34;他说。 ＆＃34;它不会是一夜之间发生的事情。＆＃34;\n 还有人们认为，社区知道它即将到来，研究人员已经在建立量子安全加密过程中。 \n＆＃34;国家科学与技术研究所（NIST）一直在为未来加密的新标​​准，＆＃39; s量子证明，＆＃34;泰尔说。\n  ＆＃34;它＆＃39; s技术问题，以及它的技术解决方案，＆＃34;凹陷克雷克。 ＆＃34;数字签名有新的和安全的算法。 ...你将有多年的时间从​​一个账户迁移到另一个帐户。＆＃34;\n Gretker表示，他预计将第一个标准量子安全加密算法2024，仍然是他的依据，在我们＆＃39之前。D：D在我们＆＃39之前看到一个能够破坏比特币和＃39; C加密的量子计算机。\n 一旦建造了新标准化的Quantum安全密码，Groetker表示，大规模迁移过程将开始。 ＆＃34;拥有比特币或以外人的每个人都将从使用旧类型的关键的数字身份转移[他们]资金，以新的钱包或新账户，即用新类型固定和＃39; s钥匙，它将是安全的，＆＃34;他说。\n 但是，这种安全性需要用户积极主动。在某些情况下，菲亚特货币账户通过银行集中中央，此过程可能比要求分散的CryPTO持有人网络单独更新其系统更容易。\n ＆＃34;不是每个人，无论需要多长时间，会在时间内移动他们的资金，＃34;凹陷克雷克。不可避免地，将有忘记密码或可能在不分享其关键的情况下消失的用户。\n ＆＃34;会有一些钱包......这变得越来越不安全，因为它们＆＃39;重新使用较弱的键。＆＃34; \n但有些方法可以处理安全升级中的这种失败。 例如，组织可以锁定所有帐户仍然使用旧类型的密码，并给所有者提供某种方式访问它。 当用户去回收平衡时，这里的折衷将是匿名的。 ", "note_en": "The German-born programmer and crypto trader forgot the password to unlock his digital wallet, which contains 7,002  bitcoin, now worth $265 million. Quantum computers, which will be  several million times faster than traditional computers, could have easily helped him crack the code.\n  Though quantum computing is still very much in its infancy, governments and private-sector companies such as  Microsoft and  Google are working to make it a reality. Within a decade, quantum computers could be powerful enough to break the cryptographic security that protects cell phones, bank accounts, email addresses and — yes — bitcoin wallets.\n &#34;If you had a quantum computer today, and you were a state sponsor – China, for example – most probably in about eight years, you could crack wallets on the blockchain,&#34; said Fred Thiel, CEO of cryptocurrency mining specialist Marathon Digital Holdings.\n This is precisely why cryptographers around the world are racing to build a quantum-resistant encryption protocol.\n  Right now, much of the world runs on something called asymmetric cryptography, in which individuals use a private and public key pair to access things such as email and crypto wallets.\n &#34;Every single financial institution, every login on your phone — it is all based on asymmetric cryptography, which is susceptible to hacking with a quantum computer,&#34; Thiel said. Thiel is a former director of Utimaco, one of the largest cryptography companies in Europe, which has worked with Microsoft, Google and others on post-quantum encryption.\n  The public-private key pair lets users produce a digital signature, using their private key, which can be verified by anyone who has the corresponding public key.\n In the case of cryptocurrencies such as bitcoin, this digital signature is called the Elliptic Curve Digital Signature Algorithm, and it ensures that bitcoin can only be spent by the rightful owner.\n Theoretically, someone using quantum computing could reverse-engineer your private key, forge your digital signature, and subsequently empty your bitcoin wallet.\n &#34;If I was dealing in fear-mongering ... I&#39;d tell you that among the first types of digital signatures that will be broken by quantum computers are elliptic curves, as we use them today, for bitcoin wallets,&#34; said Thorsten Groetker, former Utimaco CTO and one of the top experts in the field of quantum computing.\n  Crypto experts told CNBC they aren&#39;t all that worried about quantum hacking of bitcoin wallets for a couple of different reasons.\n Castle Island Ventures founding partner Nic Carter pointed out that quantum breaks would be gradual rather than sudden.\n &#34;We would have plenty of forewarning if quantum computing was reaching the stage of maturity and sophistication at which it started to threaten our core cryptographic primitives,&#34; he said. &#34;It wouldn&#39;t be something that happens overnight.&#34;\n There is also the fact that the community knows that it is coming, and researchers are already in the process of building quantum-safe cryptography.\n &#34;The National Institute of Science and Technology (NIST) has been working on a new standard for encryption for the future that&#39;s quantum-proof,&#34; said Thiel.\n  &#34;It&#39;s a technical problem, and there&#39;s a technical solution for it,&#34; said Groetker. &#34;There are new and secure algorithms for digital signatures. ... You will have years of time to migrate your funds from one account to another.&#34;\n Groetker said he expects the first standard quantum-safe crypto algorithm by 2024, which is still, as he put it, well before we&#39;d see a quantum computer capable of breaking bitcoin&#39;s cryptography.\n Once a newly standardized post-quantum secure cryptography is built, Groetker said, the process of mass migration will begin. &#34;Everyone who owns bitcoin or  ethereum will transfer [their] funds from the digital identity that is secured with the old type of key, to a new wallet, or new account, that&#39;s secured with a new type of key, which is going to be secure,&#34; he said.\n However, this kind of upgrade in security requires users to be proactive. In some scenarios, where fiat money accounts are centralized through a bank, this process may be easier than requiring a decentralized network of crypto holders to update their systems individually.\n &#34;Not everybody, regardless of how long it takes, will move their funds in time,&#34; said Groetker. Inevitably, there will be users who forget their password or perhaps passed away without sharing their key.\n &#34;There will be a number of wallets ... that become increasingly insecure, because they&#39;re using weaker keys.&#34;\n But there are ways to deal with this kind of failing in security upgrade. For example, an organization could lock down all accounts still using the old type of cryptography and give owners some way to access it. The trade-off here would be the loss of anonymity when users go to reclaim their balance.", "posttime": "2021-06-17 22:36:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "比特币,计算机,computers,加密", "title": "为什么量子计算机不会最终破裂比特币钱包 ", "title_en": "Why Quantum Computers Won't End Up Cracking Bitcoin Wallets", "transed": 1, "url": "https://www.cnbc.com/2021/06/10/long-term-crypto-threat-quantum-computers-hacking-bitcoin-wallets.html", "via": "", "real_tags": ["比特币", "计算机", "computers", "加密"]}]