[{"category": "", "categoryclass": "", "imagename": "7f5397905636e5537b23df747befac7e.jpg", "infoid": 1016042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，EventGeek重新推出了Circa，并将新的重点放在了虚拟活动上。创始人兼首席执行官Alex Patriquin表示，Circa正在重用EventGeek的一些现有技术，但他估计该平台80%是新的。\n虽然重新启动才刚刚正式开始，但这家初创公司表示，它的软件已经被用来将4万场面对面的活动改编成虚拟会议和网络研讨会。\nPatriquin说，眼前的挑战只是弄清楚如何举办虚拟活动-Circa为这一点提供了一个剧本。但这家初创公司的目标不仅仅是虚拟活动后勤。\nPatriquin说：“我们的新重点实际上更多地放在资深营销利益相关者层面，帮助他们对客户有一个统一的看法。”\n他解释说，“活动总是与营销堆栈有点脱节”，因此，向虚拟的转变提供了一个机会，可以将活动参与视为更大客户之旅的一部分，并将活动纳入更广泛的客户记录中。为此，Circa集成了Salesforce和Marketo等销售和营销系统，以及Zoom和ON24等视频会议平台。\n“我们实际上并没有提供(会议)体验，”帕特里坎说。“我们把它放在客户之旅的背景下。”\nCirca客户Okta北美需求产生高级总监Liz Kokoska也提出了类似的观点。\n科科斯卡在一份声明中说：“在Circa之前，我们不得不在不同的系统中管理我们的实体和虚拟活动，尽管我们认为它们是同一营销渠道的一部分。”有了Circa，我们现在可以在一个地方看到我们所有活动的单一视图--这对计划和全公司范围内的营销活动可见性很有帮助。能够无缝适应虚拟和混合活动的新世界，给我们的团队带来了显著的优势。“。\n当帕特里坎展望一个可能再次举办大型会议的世界时，他预测“对于活动行业和Circa来说，仍然有一个非常大的机会”。\n“随着面对面的活动开始回归，将会有一个阶段，在这个阶段，健康和安全将是至高无上的，”他继续说。在健康和安全阶段之后，将是混合活动的时代-现在一切都是虚拟的，混合活动将提供机会，将关键的[虚拟]学习带回面对面的世界，拥有更多的数据和智能，并真正能够使与会者的体验个性化。“", "note_en": "Today, EventGeek relaunched as  Circa, with a new focus on virtual events. founder and CEO Alex Patriquin said that Circa is reusing some pieces of EventGeek’s existing technology, but he estimated that 80% of the platform is new.\n While the relaunch was only just became official, the startup says its software has already been used to adapt 40,000 in-person events into virtual conferences and webinars.\n  The immediate challenge, Patriquin said, is simply figuring out how to throw a virtual event — something that Circa offers a playbook for. But the startup’s goals go beyond virtual event logistics.\n “Our new focus is really more at the senior marketing stakeholder level, helping them have a unified view of the customer,” Patriquin said.\n He explained that “events have always been kind of disconnected from the marketing stack,” so the shift to virtual presents an opportunity to treat event participation as part of the larger customer journey, and to include events in the broader customer record. To that end, Circa integrates with sales and marketing systems like Salesforce and Marketo, as well as with video conferencing platforms like Zoom and On24.\n  “We don’t actually deliver [the conference] experience,” Patriquin said. “We put it into that context of the customer journey.”\n Liz Kokoska, senior director of demand generation for North America at Circa customer Okta, made a similar point.\n “Prior to Circa, we had to manage our physical and virtual events in separate systems, even though we thought of them as parts of the same marketing channel,” Kokoska said in a statement. “With Circa, we now have a single view of all our events in one place — this is helpful in planning and company-wide visibility on marketing activity. Being able to seamlessly adapt to the new world of virtual and hybrid events has given our team a significant advantage.”\n And as Patriquin looks ahead to a world where large conferences are possible again, he predicted that there’s still “a really big opportunity for the events industry and for Circa.”\n “As in-person events start to come back, there’s going to be a phase where health and safety are going to be paramount,” he continued. “After that health and safety phase, it’s going to be the age of hybrid events — where everything is virtual right now, hybrid will provide the opportunity to bring key [virtual] learnings the back into the in-person world, to have a lot more data and intelligence and really be able to personalize an attendee’s experience.”", "posttime": "2020-08-04 06:24:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "帮助,relaunches,活动", "title": "\nEventGeek作为Circa重新推出，帮助营销人员拥抱虚拟活动", "title_en": "\n\t\t\t\tEventGeek relaunches as Circa to help marketers embrace virtual events\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/eventgeek-relaunches-as-circa/", "via": "", "real_tags": ["帮助", "活动"]}, {"category": "", "categoryclass": "", "imagename": "633907dde70c61dce2a52640df811aa1.jpg", "infoid": 1016039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特称，美国联邦贸易委员会可能很快对其处以最高2.5亿美元的罚款，因其不当使用用户的电话号码和电子邮件地址。潜在的罚款将来自违反Twitter 2011年与联邦贸易委员会达成的协议，该协议旨在不再在如何保护消费者个人信息方面误导消费者。\n2013至2019年间，Twitter使用“出于安全和安保目的”提供的电话号码和电子邮件地址来帮助定向广告。Twitter早在10月份就披露了这一做法，称这是“无意中”做的，并称其为“一个错误”。联邦贸易委员会显然认为，Twitter没有披露他们的数据可能被以这种方式使用，从而误导了消费者。\n推特说，委员会在7月28日发出了一份起诉书草案，描述了涉嫌违反2011年协议的情况。推特估计，它可能会被罚款1.5亿至2.5亿美元，并预计将拨备1.5亿美元罚款。Twitter在提交给美国证券交易委员会(Securities And Exchange Commission)的10-Q年报中写道：“这件事仍未解决，任何最终结果的时间或条款都无法保证。”\nTwitter的一位发言人表示，该公司在今天提交的10-Q财报中“包括了一个估计的和解范围”，因为投诉是在7月23日其季度业绩提交后收到的。The Verge已经联系了联邦贸易委员会请其置评。", "note_en": "Twitter said that the Federal Trade Commission may soon fine it up to $250 million for improper use of users’ phone numbers and email addresses. The potential fines would come for violations of Twitter’s  2011 agreement with the FTC to no longer mislead consumers about how it protects their personal information.\n Between 2013 and 2019, Twitter used phone numbers and email addresses provided “for safety and security purposes” to help target ads. Twitter  disclosed the practice back in October, saying that it was done “inadvertently” and called it “an error.” The FTC evidently believes that Twitter misled consumers by not disclosing that their data may have been used in this way.\n Twitter says that the commission sent a draft complaint on July 28th describing alleged violations of the 2011 agreement. Twitter estimates that it could be fined anywhere from $150 million to $250 million, and it’s setting aside $150 million in expectation of a fine. “The matter remains unresolved, and there can be no assurance as to the timing or the terms of any final outcome,” Twitter writes in  its 10-Q filing with the Securities and Exchange Commission.\n A spokesperson for Twitter says the company “included an estimated range for settlement” in the 10-Q filed today because the complaint was received after its quarterly results were filed on July 23rd.  The Verge has reached out to the FTC for comment.", "posttime": "2020-08-04 06:22:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,推特,联邦贸易委员会,ftc,twitter", "title": "推特表示，联邦贸易委员会可能很快就会对其处以2.5亿美元的罚款，原因是使用用户的电子邮件地址和电话号码进行广告定向，做法于2019年10月披露", "title_en": "Twitter says FTC may soon fine it $250M for using users' email addresses and phone numbers for ad targeting, practice was disclosed in October 2019", "transed": 1, "url": "https://www.theverge.com/2020/8/3/21353232/twitter-ftc-fine-misused-email-phone-advertising-2011-settlement?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["广告", "推特", "联邦贸易委员会", "ftc", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "4b07f35a6fd7c0cb23b5759b39508e51.jpg", "infoid": 1016038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Take-Two Interactive今日公布，截至6月30日的第一财季(第二个历季)营收较上年同期增长54%，达到8.313亿美元，因球迷在疫情期间玩网络游戏。利润和收入的结果超出了华尔街的预期。\n侠盗汽车在线和侠盗汽车V，红死人救赎2和红死人在线，以及NBA 2K20都在一个季度内为公司贡献了巨大的销售额，当时它只从私人部门独立品牌中解体。其他贡献者包括“边界之地3”、希德·迈耶的“文明6号”、“WWE”、“外部世界”和“社会点”的手机游戏。在盘后交易中，Take-Two的股价上涨4.75%，至每股175.65美元。\n这家出版公司报告称，数字收入增长了70%，达到7.262亿美元，而去年同期为4.278亿美元。Take-Two强调，与新冠肺炎相关的全职订单导致其游戏的参与度和支出增加。\nCowen分析师Doug Creutz在给GamesBeat的电子邮件中表示，在非GAAP的基础上，Take-Two公布的每股收益为2.30美元，营收为9.96亿美元，并提高了全年业绩指引。分析师预计，该公司公布的季度收益为每股1.53美元，销售额为8.216亿美元。去年同期，该公司公布的销售额为4.222亿美元，每股收益为27美分。\n到目前为止，Take-Two表示，GTA V的终身销量为1.35亿辆，其中包括第一财季的500万辆。“红死人的救赎2”的票房是3200万美元。NBA 2K20的销量为1400万台。《边疆3》已售出1050万部。而“外星世界”已经卖出了280万部。\nNBA2K的日活跃用户比一年前增加了82%。在第一财季，《红色死神救赎2》的销量是去年同期的两倍。你可以将这些结果归因于大流行期间玩得更多的游戏玩家。Social Points Dragon City和Monster Legends手机游戏帮助推动该公司本季度营收同比增长54%。\nTake-Two首席执行官施特劳斯·泽尔尼克(Strauss Zelnick)在一份声明中表示，“2021财年开局良好，第一季度的经营业绩大大超出我们的预期，包括第一财季GAAP净收入和净预订量的创纪录。…。由于我们第一季度的经营业绩好于预期，并提高了对今年剩余时间的预测，我们正在上调2021财年的展望，这将是Take-Two的又一个伟大的一年。“。\n该公司表示，它拥有“公司历史上最强大的开发渠道”，但当然，每个人都想知道侠盗猎车手VI将于何时亮相。在一次分析师电话会议上，泽尔尼克表示，该公司有90款游戏正在研发中。但他没有透露任何关于GTA VI的线索。\n而Take-Two对此只字不提。Take-Two表示，员工仍在家中工作，尽管一些办公室是在自愿的基础上开设的。\n在截至9月30日的第二财季，Take-Two预计GAAP收入为7.5亿至8亿美元，净收入为9800万美元，或每股85美分，至1.1亿美元，或每股96美分。\n韦德布什证券分析师Michael Pachter在给GamesBeat的电子邮件中称，全年业绩指引从之前的每股3.00美元至3.25美元上调至每股4.05美元至4.30美元。加薪的金额超过了该公司超过第一季度业绩的金额，尽管第二财季的收入预计将低于第一季度。因此，更新后的预测是一种信心的表达。\n无论如何，很明显，随着下一代游戏机的推出，数字支出目前是Take-Two业务的最大组成部分，而且很可能在未来也是如此。", "note_en": "Take-Two Interactive reported today that revenue for its first fiscal quarter (the second calendar quarter) ended June 30 rose 54% from a year ago to $831.3 million as fans played online games during the pandemic. The results for profits and revenues beat Wall Street’s expectations.\n Grand Theft Auto Online and Grand Theft Auto V,  Red Dead Redemption 2 and Red Dead Online, and  NBA 2K20 all contributed to huge sales for the company in a quarter when it launched only Disintegration from its Private Division indie label. Other contributors included Borderlands 3, Sid Meyer’s Civilization VI, WWE, The Outer Worlds, and Social Point’s mobile games. In after-hours trading, Take-Two’s stock is up 4.75% to $175.65 a share.\n  The  publishing company reported digital revenue increased 70% to $726.2 million, compared to $427.8 million in the same period a year ago. Take-Two emphasizes that COVID-19-related stay-at-home orders led to increased engagement and spending in its games.\n On a non-GAAP basis, Take-Two reported earnings per share of $2.30 on $996 million in revenue and raised full-year guidance as well, said Cowen analyst Doug Creutz in an email to GamesBeat. Analysts expected the company to report quarterly earnings of $1.53 a share on sales of $821.6 million. In the same period a year ago, the company posted earnings of 27 cents a share on sales of $422.2 million.\n To date, Take-Two said that lifetime sales of GTA V are at 135 million units, including 5 million in the first fiscal quarter. Red Dead Redemption 2 is at 32 million. NBA 2K20 is at 14 million units. Borderlands 3 has sold 10.5 million. And The Outer Worlds has sold 2.8 million.\n Daily active users for NBA 2K were up 82% from a year ago. In the first fiscal quarter, Red Dead Redemption 2 sold twice as many copies as it did in the same period a year ago. You can chalk those results up to gamers playing more during the pandemic. Social Points Dragon City and Monster Legends mobile games helped drive it to 54% revenue growth in the quarter compared to a year ago.\n  Take-Two chief executive officer Strauss Zelnick said in a statement, “Fiscal 2021 is off to a terrific start with first-quarter operating results that significantly exceeded our expectations , including fiscal first-quarter records for GAAP net revenue and net bookings. … As a result of our better-than-expected first-quarter operating results and increased forecast for the balance of the year, we are raising our fiscal 2021 outlook, which is poised to be another great year for Take-Two.”\n The company said it has the “strongest development pipeline in the history of the company,” but, of course, everybody wants to know when Grand Theft Auto VI is going to debut. In an analyst call, Zelnick said the company has 90 games in its product pipeline. But he dropped no hints on GTA VI.\n And Take-Two isn’t saying anything about that. Take-Two said employees are still working from home, though some offices are opening on a voluntary basis.\n For the second fiscal quarter ended September 30, Take-Two expects GAAP revenue to be $750 million to $800 million, with net income at $98 million, or 85 cents a share, to $110 million, or 96 cents a share.\n Michael Pachter, an analyst at Wedbush Securities, said in an email to GamesBeat that full-year guidance was raised to $4.05 a share to $4.30 a share from the previous guidance of $3.00 to $3.25 a share. The amount of the raise was more than the amount that the company beat Q1 results by, even though the second fiscal quarter is expected to be lower than Q1 in revenue. So the updated forecast is an expression of confidence.\n Regardless, it’s clear that digital spending is the biggest part of Take-Two’s business now — and likely in the future as the next-gen consoles launch.", "posttime": "2020-08-04 06:22:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,预期,launching", "title": "Take-Two Interactive在第一财季的收入为8.313亿美元，同比增长54%，超出预期，尽管该季度没有推出任何新游戏", "title_en": "Take-Two Interactive beat expectations in fiscal Q1 with revenue of $831.3M, up 54% YoY, despite not launching any new games during the quarter", "transed": 1, "url": "https://venturebeat.com/2020/08/03/take-two-interactive-coasts-to-831-3-million-in-q2-2020-revenue-as-fans-flock-to-online-games/", "via": "", "real_tags": ["游戏", "预期", "launching"]}, {"category": "", "categoryclass": "", "imagename": "b71cc6160684cf712b8a217ff1c41cef.png", "infoid": 1016037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该项目的目标是提供一种使用低分辨率卫星图像和机器学习来更快、更便宜、更可扩展地检测快速增长的非正式住区的方法。\n在03_Model_Optimization.ipynb的3个实例中，我们评估了不同负采样参数下的模型性能，这反映在10K、30K、50K上。\n出于隐私方面的考虑，我们没有将标识哥伦比亚非正式住区的标签培训数据包括在此回购中。如果您需要此数据集，请联系ThinkingMachines或iMMAP，电子邮件为hello@thinkingmachin.es，info@immap.org。\n├──Data│├──pos_masks│├──{Area}_Mask.gpkg│├──ADMIN_Bound│├──{Area}.gpkg│├──Images&lt；派生&gt；│├──{Area}_2015-2016.tif│├──{Area}_2017-2018.tif│├──{Area}_2019-2020.tif│├──├──Index&lt；派生&gt；│和├──指数_{面积}_2015-2016.tif│和├──指数_{面积}_2017-2018.tif│和├──指数_{面积}_2019年-2020.tif。\n其中，Area是作为一个单词重新评估的区域的名称，例如Villa del Rosario-&gt；Viladelrosario。", "note_en": "The goal of this project is to provide a means for faster, cheaper, and more scalable detection of rapidly growing informal settlements using low-resolution satellite images and machine learning.\n          We evaluated model performance across different negative sampling parameters, and that is reflected on 10K, 30K, 50K, in the 3 instances of 03_Model_Optimization.ipynb\n  For privacy concerns, we did not include in this repo the labelled training data that identified informal settlements in Colombia. If you need this dataset, please contact ThinkingMachines or IMMAP at  hello@thinkingmachin.es,  info@immap.org.\n    ├── data│   ├── pos_masks│   ├── {area}_mask.gpkg│   ├── admin_bounds│   ├── {area}.gpkg│   ├── images &lt;derived&gt;│   ├── {area}_2015-2016.tif│   ├── {area}_2017-2018.tif│   ├── {area}_2019-2020.tif│   ├── indices &lt;derived&gt;│   ├── indices_{area}_2015-2016.tif│   ├── indices_{area}_2017-2018.tif│   ├── indices_{area}_2019-2020.tif\n where area is the name of the area you&#39;re evaluating for as one word, e.g. Villa del Rosario -&gt; villadelrosario.", "posttime": "2020-08-04 06:21:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检测,rapidly,area", "title": "检测到快速增长的非正式住区", "title_en": "Detection of Rapidly Growing Informal Settlements", "transed": 1, "url": "https://github.com/thinkingmachines/geoai-immap", "via": "", "real_tags": ["检测", "rapidly", "area"]}, {"category": "", "categoryclass": "", "imagename": "c9cf122a44c7d1aae575f35fb1ac397e.jpg", "infoid": 1016036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州大学伯克利分校(University of California，Berkeley)经济学家领导的一个研究小组的新发现显示，接受针对常见寄生虫感染的持续治疗的儿童长大后会获得更高的生活水平，长期的健康和经济利益会延伸到他们的社区。\n这项开创性的研究专注于肯尼亚，覆盖了20年。研究发现，额外接受几年驱虫治疗的儿童-每年的费用只有50美分-最终比那些接受较少治疗的儿童有更好的工作和更高的收入。\n加州大学伯克利分校(UC Berkeley)发展经济学家、主要作者爱德华·米格尔(Edward Miguel)表示：“我们发现，在肯尼亚，这一适度的投资显著改善了感染者和整个社区的生活，而且好处是长期的。”“但寄生虫感染在许多低收入国家仍然很普遍，在美国一些贫穷、农村、低收入地区，寄生虫感染正在卷土重来。显然，这项研究可以为世界大部分地区的政策制定者提供指导。“。\n合著者迈克尔·克雷默是哈佛大学经济学家，因开发了研究贫困的新方法而获得2019年诺贝尔经济学奖。他补充说，新的发现为新冠肺炎流行病提供了一个意想不到的警告：失去一年或更长时间学校和校本社会服务的学生-对他们的工作和赚钱能力造成了持久的负面影响。\n“这些结果表明，以学校为基础的驱虫可以有令人难以置信的高回报率，”克雷默说。“在目前肯尼亚和其他国家的背景下，很多在健康和教育方面的投资都被新冠肺炎打断了。找到恢复它们的方法对下一代孩子来说将是至关重要的。“。\n这项新研究今天(2020年8月3日)作为国家经济研究局(NBER)的工作论文发表。\n米格尔是加州大学伯克利分校(UC Berkeley)环境与资源经济学乐施会(Oxfam)教授，也是全球有效行动中心(CEGA)的教员主任，CEGA是校园内全球发展研究的中心。\n根据世界卫生组织(World Health Organization)的数据，约有15亿人-约占全球人口的20%-感染了钩虫、蛔虫和鞭虫等寄生虫(感染肠道)和血吸虫病(感染血管)。\n根据运营世界除虫倡议的非政府组织(NGO)证据行动(Evience Action)的数据，全球有超过8.68亿儿童面临风险。\n风险集中在温暖潮湿的气候中，低收入社区的卫生条件很差。当感染者在露天排便时，寄生虫的卵会污染土壤或淡水；然后，例如，微小的蠕虫可能会穿透过路人的脚，一直延伸到宿主的肠道。\n专家说，气候变化可能会增加蠕虫感染的可能性。随着一些地区更容易发生暴雨，洪水可能会将蠕虫或它们的卵带到新的地点，甚至进入家庭，从而增加对人类的威胁。\n根据感染程度的不同，对健康的影响可能从轻微到严重不等。孩子们可能会经历胃病和疲劳，这会扰乱他们在学校的注意力或让他们呆在家里。这种感染导致营养不足，可能导致贫血，还与身体和精神发育受损有关。\n1998年，一个非政府组织启动了小学驱虫项目，将肯尼亚西部布西亚地区(现在的布西亚县)的学校作为治疗工作的重点。初步研究发现，感染率超过90%-实际上，该地区的每个人都受到了感染。\n但由于该非政府组织的财政和行政限制，决定分阶段进行治疗：50所学校的学生被选中在1998年或1999年开始健康教育和驱虫治疗，而另外25所学校的学生从2001年开始接受治疗。\nMiguel和Kremer在2004年评估了肯尼亚的计划，发现了明显的积极影响：缺课率至少减少了25%，其中年轻学生的改善最大。他们发现，即使在未经治疗的学生中，驱虫也“大大提高了”学生的出勤率，因为治疗降低了该地区虫卵的流行率。\n除虫世界是在Miguel和Kremer于2004年进行研究后成立的，随后肯尼亚和全球各国政府采取了雄心勃勃的防蠕虫计划，极大地改善了数亿儿童的生活。\n这项新的研究是基于20年后的治疗结果，这是迄今为止在寄生虫感染和干预方面实现的最长的研究期之一。研究人员追踪了这些前学生成长并过渡到成年生活的过程，即使是那些在肯尼亚境内迁居或移民到其他国家的学生也是如此。\n他们发现，在该计划的头几年接受两三年额外治疗的学生报告说，作为成熟的成年人，他们获得了显著的好处：\n总体而言，驱虫治疗的少量投资产生了37%的年化回报率。“你可能会认为，在这样的项目中，对儿童来说，你会获得一些短暂的收益，但人们最终会回到原来的样子，”米格尔说。“但我们的研究表明，即使在20年后，这些人的生活质量也有了可衡量的、有意义的改善。”\n这与一个社区或一个国家的贫困有直接关系。他解释说，当一个社区中的数百人能够免于感染时，他们改善的健康和教育可以帮助释放社区的发展潜力。\n该研究项目的主要成就之一是它开创性地使用了随机对照试验。虽然各种因素最终可能对一个人成年后的健康和成功做出贡献，但这样的试验使研究人员能够分离出单一因素的影响。实际上，他们可以把父母的支持或教育成功放在一边，只看驱虫计划的效果。\n诺贝尔委员会在去年授予克雷默经济学奖时引用了他在这种研究技术上的发展，并特别提到了该团队在肯尼亚驱虫方面的工作。对米格尔来说，获奖也是对他工作的深刻肯定。\n现在，米格尔说，研究人员正在研究新的问题。他们想看看肯尼亚一代人所获得的好处是否会传给下一代人，以及为什么男性似乎比女性在经济上受益更多。他补充说，虽然驱虫研究帮助肯尼亚和印度等国实现了巨大的人类利益，但研究证据仍然必须带给许多其他低收入和中等收入国家的政策制定者、医务工作者和公众。\n但是，和克雷默一样，米格尔表示，新冠肺炎疫情给政策制定者带来了一个迫在眉睫的挑战：在许多低收入地区，学校是社会支持的中心，学生在这里获得餐饮和医疗服务，包括驱虫药物。如果学校停课，就像肯尼亚和其他许多国家目前的情况一样，学生们可能会错过这种支持。\n“对于这些孩子来说，”米格尔说，“失去几年的学校教育可能会带来非常糟糕的后果。他们现在需要做出回应，找到一种至少提供其中一些服务的方法。“。\n这项新研究的其他合著者是俄克拉何马大学的琼·哈莫里(Joan Hamory)、CEGA博士后学者迈克尔·沃克(Michael Walker)和乔治华盛顿大学(George Washington University)的莎拉·贝尔德(Sarah Baird)。\n该研究项目得到了美国国立卫生研究院(U.S.National Institutes of Health)的持续支持，并由GiveWell提供了部分资金。", "note_en": "Children who receive sustained treatment against common parasitic infections grow up to achieve a higher standard of living, with long-lasting health and economic benefits extending to their communities, according to new findings from a research team led by a University of California, Berkeley, economist.\n The pioneering  study, focused on Kenya and covering 20 years, found that children who receive a few extra years of deworming treatment — costing as little as 50 cents a year — eventually have better jobs and higher incomes than those who got less treatment.\n “We found that, in Kenya, this modest investment led to significant improvements in the lives of infected individuals and for whole communities, and the benefits are long-lasting,” said lead author Edward Miguel, a UC Berkeley development economist. “But parasitic infections remain prevalent in many low-income countries, and there’s a resurgence in some poor, rural, low-income areas of the United States. Clearly, this research can serve as a guide to policymakers in much of the world.”\n Co-author Michael Kremer, a Harvard University economist who shared the 2019 Nobel Prize in economics for developing novel ways to research poverty, added that the new findings provide an unanticipated warning about the COVID-19 pandemic: Students who lose a year or more of school — and school-based social services — suffer lasting negative impact on their work and earning power.\n “These results show that school-based deworming can have an incredibly high rate of return,” said Kremer. “In the current context of Kenya and other countries, many investments in health and education have been interrupted by COVID-19. Finding a way to resume them will be critical for the next generation of children.”\n The new research was published today (Aug. 3, 2020) as a working paper by the National Bureau of Economic Research  (NBER).\n Miguel is the Oxfam Professor in Environmental and Resource Economics at UC Berkeley and faculty director of the Center for Effective Global Action  (CEGA), a hub on campus for research on global development.\n  According to the  World Health Organization, about 1.5 billion people — roughly 20% of the global population — are infected with the parasitic worms such as hookworm, roundworm and whipworm, which infect the intestines, and schistosomiasis, which infects the blood vessels.\n  Globally, more than 868 million children are at risk, according to Evidence Action, a nongovernmental organization (NGO) that runs the  Deworm the World Initiative.\n The risk is concentrated in warm, damp climates where low-income communities have poor sanitation. When infected people defecate in the open, the parasites’ eggs contaminate the soil or fresh water; then, for example, the tiny worms might penetrate the feet of passersby and work their way up to the hosts’ intestines.\n And, experts say, climate change may increase the potential for worm infections. With a greater incidence of heavy storms in some regions, floodwaters can carry the worms or their eggs to new locations, even into homes, raising the threat to humans.\n The health impacts can range from mild to severe, depending on the degree of infection. Children may experience stomach ailments and fatigue, which disrupt their concentration at school or keep them home. The infections cause nutritional deficiency and can lead to anemia, and also have been linked to impaired physical and mental development.\n In 1998, an NGO started the Primary School Deworming Project, using the schools in the Busia District (now Busia County) of Western Kenya as a focus of treatment efforts. Preliminary research found that infection rates were over 90% — in effect, everyone in the district was infected.\n But because of the NGO’s financial and administrative constraints, a decision was made to phase in the treatment: Students at 50 schools were selected to begin health education and deworming treatment in 1998 or 1999, while students at 25 other schools received the treatment starting in 2001.\n Miguel and Kremer  evaluated the Kenyan program in 2004 and found a clear positive impact: School absenteeism was cut by at least 25%, with the greatest improvements among young students. Deworming “substantially improved” school attendance, even among untreated students, they found, because treatment reduced the prevalence of worm eggs in the area.\n Deworm the World was founded after the 2004 study by Miguel and Kremer, and subsequently governments in Kenya and globally adopted ambitious anti-worm programs, dramatically improving life for hundreds of millions of children.\n  The new research is based on treatment outcomes after 20 years, one of the longest study periods ever achieved for parasitic worm infections and interventions. The researchers tracked the former students as they grew up and transitioned to adult life, even those who moved within Kenya or migrated to other countries.\n They found that students who received two or three years of extra treatment in the early years of the program reported significant benefits as mature adults:\n  Overall, the small investment in deworming treatment produced an annualized 37% rate of return.“You might assume that, in a program like this, for children, you would get some transient gain, but that people would eventually go back to the way they were,” Miguel said. “But we’re showing that, even 20 years later, there are measurable, meaningful improvements in the quality of life for these individuals.”\n This has a direct bearing on poverty in a community, or a country. When hundreds of individuals in a community can be freed from infection, he explained, their improved health and education can help unlock the community’s development potential.\n  One of the primary accomplishments of the research project has been its pioneering use of randomized controlled trials. While a variety of factors might ultimately contribute to an individual’s health and success in adulthood, such trials allow the researchers to isolate the impact of a single factor. In effect, they can put parental support or educational success aside and look only at the effect of the deworming program.\n  The Nobel Committee  cited Kremer’s development of such research techniques in awarding him the economics prize last year and specifically noted the team’s work on deworming in Kenya. For Miguel, too, the prize was a  profound affirmation of his work.\n Now, said Miguel, the researchers are moving toward new questions. They want to see if the benefits achieved by one generation in Kenya carry over to the next, and why men seem to benefit economically more than women. While deworming research has helped countries such as Kenya and India to achieve great human benefit, he added, the research evidence still must be carried to policymakers, medical workers and the public in many other low- and middle-income countries.\n But, like Kremer, Miguel said the COVID-19 pandemic confronts policymakers with an immediate challenge: In many low-income areas, schools are a center of social support where students receive meals and medical care, including deworming medication. If school is suspended, as it is currently in Kenya and many other countries, students may miss out on that support.\n “For these kids,” Miguel said, “losing a couple of years of schooling can have really bad consequences. They need a response right now to find a way to deliver at least some of those services.”\n The other co-authors of the new research are Joan Hamory at the University of Oklahoma; Michael Walker, a postdoctoral scholar at CEGA; and Sarah Baird at George Washington University.\n The research project has received sustained support from the U.S. National Institutes of Health and was funded in part by GiveWell.", "posttime": "2020-08-04 06:21:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,children,研究", "title": "一项新的研究表明，为儿童治疗蠕虫会带来长期的好处", "title_en": "Treating children for worms yields long-term benefits, says new study", "transed": 1, "url": "https://news.berkeley.edu/2020/08/03/treating-children-for-worms-yields-long-term-benefits-says-new-study/", "via": "", "real_tags": ["表明", "children", "研究"]}, {"category": "", "categoryclass": "", "imagename": "003fe11d517b987ba69713580ff35118.png", "infoid": 1016035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "百度发布了PP-YOLO，并通过建立在YOLOv3(PaddlePaddle深度学习框架)和尖端计算机视觉研究的基础上，推动了目标检测研究的最先进水平。\nPP-YOLO评估指标显示，与当前最先进的目标检测模型YOLOv4相比，性能有所提高。然而，百度的作者写道：\n本文并不是要介绍一种新型的物体探测器。它更像是一份食谱，告诉您如何一步一步地构建更好的检测器。\nYOLO最初由约瑟夫·雷蒙德(Joseph Redmond)创作，目的是探测物体。对象检测是一种计算机视觉技术，它通过在对象周围画一个边界框并识别给定框所属的类别标签来定位和标记对象。与大型NLP变压器不同，YOLO的设计非常小巧，可实现设备上部署的实时推理速度。\nYOLO-9000是约瑟夫·雷蒙德(Joseph Redmond)发表的第二个物体探测器，改进了探测器，强调了探测器对世界上任何物体的泛化能力。\nYOLOv3对检测网络做了进一步的改进，开始将目标检测流程纳入主流。我们开始发布教程，介绍如何在PyTorch中训练YOLOv3，如何在Kera中训练YOLOv3，并将YOLOv3的性能与EfficientDet(另一个最先进的检测器)进行比较。\n自然，开源社区接过接力棒，继续推动YOLO技术向前发展。\nYOLOv4最近是今年春天由Alexey AB在他的For of the YOLO Darknet库中发表的。YOLOv4主要是其他已知计算机视觉技术的集合，通过研究过程进行组合和验证。请看这里，在YOLOv4上进行深度潜水。YOLOv4论文读起来类似于PP-YOLO论文，我们将在下面看到。我们整理了一些关于如何在暗网中训练YOLOv4的很棒的培训教程。\n然后，就在几个月前，YOLOv5发布了。YOLOv5采用了Darknet(基于C的)培训环境，并将网络转换为PyTorch。改进的训练技术进一步提高了模型的性能，并创建了一个很好的、易于使用的开箱即用的目标检测模型。从那以后，我们一直鼓励使用Roboflow的开发人员通过这个YOLOv5培训教程将他们的注意力集中到YOLOv5上，以形成他们的自定义对象检测器。\n如果PaddlePaddle对您来说是新的，那么我们是在同一条船上。PaddlePaddle最初是用Python编写的，看起来类似于PyTorch和TensorFlow。深入研究PaddlePaddle框架很有趣，但超出了本文的范围。\nPP-YOLO的论文读起来很像YOLOv4的论文，因为它是已知在计算机视觉中工作的技术的汇编。新的贡献是证明这些技术的集成提高了性能，并提供了一项关于每一步在整个过程中对模型有多大帮助的消融研究。\n在我们深入研究PP-YOLO的贡献之前，回顾一下YOLO检测器体系结构将是有用的。\nYOLO主干-YOLO主干是一种卷积神经网络，它汇集图像像素以形成不同粒度的特征。主干通常在分类数据集(通常是ImageNet)上进行预训练。\nYOLO Neck-YOLO Neck(上面选择的FPN)在传递到预测头部之前组合和混合ConvNet层表示。\nYOLO Head-这是网络中进行边界框和类预测的部分。它以类、盒、对象性三个YOLO损失函数为指导。\n第一种PP YOLO技术是将YOLOv3 Darknet53主干替换为Resnet50-vd-DCN ConvNet主干。RESNET是一个更流行的主干，有更多的框架针对其执行进行了优化，并且它比Darknet53具有更少的参数。对于PP YOLO来说，通过交换这个主干看到MAP的改进是一个巨大的胜利。\nPP YOLO跟踪网络参数的指数移动平均值，以保持预测时间内模型权重的阴影。这已被证明可以提高推理的准确性。\nPP-YOLO将批量从64提高到192。当然，如果您有GPU内存限制，这很难实现。\nPP YOLO在FPN颈部实现DropBlock正则化(过去，这通常发生在主干上)。DropBlock在网络中的给定步骤随机移除训练特征块，以教导模型不依赖关键特征进行检测。\nYOLO损失函数不能很好地转换为MAP度量，后者在计算中大量使用UNION上的交集。因此，考虑到这一端预测来编辑训练损失函数是有用的。此编辑也出现在YOLOv4中。\nPP-YOLO网络增加了一个预测分支来预测模型对给定对象的估计借条。在做出预测对象或不预测对象的决策时，将这种欠条意识包括在内可以提高性能。\n旧的YOLO模型不能很好地预测锚箱区域的边界。以稍微不同的方式定义长方体坐标可以避免此问题。这项技术也出现在YOLOv4中。\n非最大抑制是一种去除候选对象的建议以进行分类的技术。矩阵NMS是一种并行地对这些候选预测进行排序的技术，从而加快了计算速度。\nCoordConv的动机是ConvNet在简单地将(x，y)坐标映射到一个热点像素空间时遇到的问题。CoordConv解决方案使卷积网络能够访问其自己的输入坐标。CoordConv干预在上面用黄色菱形标记。更多细节可以在CordConv的论文中找到。\n空间金字塔池是骨干层之后的一个额外块，用于混合和汇集空间要素。也在YOLOv4和YOLOv5中实现。\nPP YOLO的作者提炼出一个更大的ResNet模型作为主干。较好的预训练模型也能改善下游迁移学习。\n事实上，作者指出，这是一个错误的问题。作者的意图不是介绍一种新的新探测器，而是展示仔细调整对象探测器以最大化性能的过程。这里引用了这篇论文的引言：\n本文的重点是如何将一些几乎不影响效率的有效技巧叠加起来，以获得更好的性能。本文并不是要介绍一种新型的物体探测器。它更像是一份食谱，告诉您如何一步一步地构建更好的检测器。我们发现了一些对YOLOv3探测器有效的技巧，可以节省开发人员的试错时间。最终的PP-YOLO模型将COCO上的MAP从43.5%提高到45.2%，速度比YOLOv4快。\n上面的PP-YOLO贡献参考将YOLOv3模型从38.9提高到44.6，并将推理FPS从58提高到73。白皮书中显示的这些指标超过了YOLOv4和EfficientDet目前公布的结果。\n在将PP-YOLO与YOLOv5进行基准比较时，YOLOv5似乎在V100上仍具有最快的推断精度时间性能(AP与FPS)折衷。然而，YOLOv5的论文仍有待发布。此外，已经表明，在YOLOv5 Ultralytics存储库上培训YOLOv4体系结构的性能优于YOLOv5，并且，过渡地，使用YOLOv5贡献进行培训的YOLOv4将优于这里发布的PP-YOLO结果。这些结果仍有待正式公布，但可以追溯到GitHub的这次讨论。\n值得注意的是，许多在YOLOv4中使用的技术(如架构搜索和数据增强)在PP YOLO中没有使用。这意味着，随着更多的这些技术组合和集成在一起，目标检测领域的最新水平仍有增长的空间。\nPP-YOLO模型展示了最先进的目标检测的前景，但相对于其他目标检测器来说，改进是渐进的，并且它是在一个新的框架中编写的。在这个阶段，最好的做法是通过在您自己的数据集上训练PP-YOLO来开发您自己的经验结果。(要在您的数据集上轻松使用PP-YOLO时收到通知，请订阅我们的时事通讯。)\n同时，我建议您查看以下YOLO教程，以便让您的对象检测器脱离地面：", "note_en": "Baidu publishes PP-YOLO and pushes the state of the art in object detection research by building on top of YOLOv3, the PaddlePaddle deep learning framework, and cutting edge computer vision research.\n  PP-YOLO evaluation metrics show improved performance over  YOLOv4, the incumbent state of the art object detection model. Yet, the Baidu authors write:\n This paper is not intended to introduce a novel object detecotor. It is more like a recipe, which tell you how to build a better detector step by step.\n   YOLO was originally authored by Joseph Redmond to detect objects. Object detection is a computer vision technique that localizes and tags objects by drawing a bounding box around them and identifying the class label that a given box belongs too. Unlike massive NLP transformers, YOLO is designed to be tiny, enabling realtime inference speeds for deployment on device.\n YOLO-9000 was the second &#34;YOLOv2&#34; object detector published by Joseph Redmond, improving the detector and emphasizing the detectors ability to generalize to any object in the world.\n  YOLOv3 made further improvements to the detection network and began to mainstream the object detection process. We began to publish tutorials on  how to train YOLOv3 in PyTorch,  how to train YOLOv3 in Keras, and  compared YOLOv3 performance to EfficientDet (another state of the art detector).\n  Naturally, the open source community picked up the baton and continues to move YOLO technology forward.\n YOLOv4 was published recently this spring by Alexey AB in his for of the YOLO Darknet repository. YOLOv4 was primarily an ensemble of other known computer vision technologies, combined and validated through the research process. See here for a  deep dive on YOLOv4. The YOLOv4 paper reads similarly to the PP-YOLO paper, as we will see below. We put together some great training tutorials on  how to train YOLOv4 in Darknet.\n Then, just a few months ago  YOLOv5 was released. YOLOv5 took the Darknet (C based) training environment and converted the network to PyTorch. Improved training techniques pushed performance of the model even further and created a great, easy to use, out of the box object detection model. Ever since, we have been encouraging developers using Roboflow to direct their attention to YOLOv5 for the formation of their custom object detectors via this  YOLOv5 training tutorial.\n     If PaddlePaddle is new to you, then we are in the same boat. Primarily written in Python, PaddlePaddle seems akin to PyTorch and TensorFlow. A deep dive into the PaddlePaddle framework is intriguing, but beyond the scope of this article.\n  The PP-YOLO paper reads much like the YOLOv4 paper in that it is a compilation of techniques that are known to work in computer vision. The novel contribution is to prove that the ensemble of these technologies improves performance, and to provide an ablation study of how much each step helps the model along the way.\n Before we dive into the contributions of PP-YOLO, it will be useful to review the YOLO detector architecture.\n    YOLO Backbone - The YOLO backbone is a convolutional neural network that pools image pixels to form features at different granularities. The Backbone is typically pretrained on a classification dataset, typically ImageNet.\n YOLO Neck - The YOLO neck (FPN is chosen above) combines and mixes the ConvNet layer representations before passing on to the prediction head.\n YOLO Head - This is the part of the network that makes the bounding box and class prediction. It is guided by the three YOLO loss functions for class, box, and objectness.\n    The first PP YOLO technique is to replace the YOLOv3 Darknet53 backbone with the Resnet50-vd-dcn ConvNet backbone. Resnet is a more popular backbone, more frameworks are optimized for its execution, and it has fewer parameters than Darknet53. Seeing a mAP improvement by swapping this backbone is a huge win for PP YOLO.\n   PP YOLO tracks the Exponential Moving Average of network parameters to maintain a shadow of the models weights for prediction time. This has been shown to improve inference accuracy.\n  PP-YOLO bumps the batch size up from 64 to 192. Of course, this is hard to implement if you have GPU memory constraints.\n  PP YOLO implements DropBlock regularization in the FPN neck (in the past, this has usually occurred in the backbone). DropBlock randomly removes a block of the training features at a given step in the network to teach the model to not rely on key features for detection.\n   The YOLO loss function does not translate well to the  mAP metric, which uses the Intersection over Union heavily in its calculation. Therefore, it is useful to edit the training loss function with this end prediction in mind. This edit was also present in YOLOv4.\n  The PP-YOLO network adds a prediction branch to predict the model&#39;s estimated IOU with a given object. Including this IoU awareness when making the decision to predict an object or not improves performance.\n  The old YOLO models do not do a good job of making predictions right around the boundaries of anchor box regions. It is useful to define box coordinates slightly differently to avoid this problem. This technique is also present in YOLOv4.\n  Non-Maximum Suppression is a technique to remove over proposals of candidate objects for classification. Matrix NMS is a technique to sort through these candidate predictions in parallel, speeding up the calculation.\n  CoordConv was motivated by the problems ConvNets were having with simply mapping (x,y) coordinates to a one-hot pixel space. The CoordConv solution gives the convolution network access to its own input coordinates. CoordConv interventions are marked with yellow diamonds above. More details are available in  the CordConv paper.\n  Spatial Pyramid Pooling is an extra block after the backbone layer to mix and pool spatial features. Also implemented in YOLOv4 and YOLOv5.\n  The PP YOLO authors distilled down a larger ResNet model to serve as the backbone. A better pretrained model shows to improve downstream transfer learning as well.\n  In fact, the authors note this is the wrong question to be asking. The authors&#39; intent is not to introduce a new novel detector, rather to show the process of carefully tuning an object detector to maximize performance. Quoting the paper&#39;s introduction here:\n The focus of this paper is how to stack some effective tricks that hardly affect efficiency to get better performance... This paper is not intended to introduce a novel object detector. It is more like a recipe, which tell you how to build a better detector step by step. We have found some tricks that are effective for the YOLOv3 detector, which can save developers’ time of trial and error. The final PP-YOLO model improves the mAP on COCO from 43.5% to 45.2% at a speed faster than YOLOv4\n The PP-YOLO contributions reference above took the YOLOv3 model from 38.9 to 44.6 mAP on the COCO object detection task and increased inference FPS from 58 to 73. These metrics are shown in the paper to beat the currently published results for YOLOv4 and EfficientDet.\n In benchmarking PP-YOLO against  YOLOv5, it appears  YOLOv5 still has the fastest inference time-to-accuracy performance (AP vs FPS) tradeoff on a V100. However, a YOLOv5 paper still remains to be released. Furthermore, it has been shown that training the YOLOv4 architecture on the YOLOv5 Ultralytics repository outperforms YOLOv5 and, transitively, YOLOv4 trained using YOLOv5 contributions would outperform the PP-YOLO results posted here. These results are still to be formally published but can be traced to  this GitHub discussion.\n   It is worth noting that many of the techniques (such as architecture search and data augmentation) that were used in YOLOv4 were not used in PP YOLO. This means that there is still room for the state of the art in object detection to grow as more of these techniques are combined and integrated together.\n   The PP-YOLO model shows the promise of state of the art object detection, but the improvements are incremental over other object detectors and it is written in a new framework. At this stage, the best thing to do is to develop your own empirical result by training PP-YOLO on your own dataset. (To be notified when you can easily use PP-YOLO on your dataset,  subscribe to our newsletter.)\n In the meantime, I recommend checking out the following YOLO tutorials to get your object detector off the ground:", "posttime": "2020-08-04 06:21:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检测,yolo", "title": "PP-YOLO超越YOLOv4-最先进的目标检测技术", "title_en": "PP-YOLO Surpasses YOLOv4 – State of the Art Object Detection Techniques", "transed": 1, "url": "https://blog.roboflow.ai/pp-yolo-beats-yolov4-object-detection/", "via": "", "real_tags": ["检测", "yolo"]}, {"category": "", "categoryclass": "", "imagename": "5957214543e61b2009e2522cc6045172.png", "infoid": 1016034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为世界上最大的互联网平台公司之一，腾讯利用技术丰富用户生活，帮助企业进行数字化升级。一个例子是广受欢迎的微信应用程序，它在全球拥有10多亿活跃用户。平台和内容集团(PCG)负责整合腾讯的互联网、社交和内容平台。盈科推动IP跨平台、多模式开发，总目标是打造更多元化的优质数字内容体验。自成立以来，许多主要产品-从著名的QQ、QQ空间、视频、应用商店、新闻和浏览器，到生态系统中相对较新的成员，如直播、动漫和电影-一直在巩固的基础设施和一套基础技术组件的基础上不断发展。\n在我们的中心矗立着连接数据和计算的实时消息传递系统。我们自豪地围绕Apache Kafka建立了许多重要的数据管道和消息队列。我们的Kafka应用与其他组织类似：我们构建跨地域日志摄取的管道、机器学习平台、微服务之间的异步通信。独特的挑战来自沿多个维度扩展我们的架构，即可扩展性、定制和SLA。以下是一些值得注意的要求：\n工作量。要全面掌握复杂应用中的数据动态，需要近距离、持续的观察。在一个月活跃用户超过10亿的消费互联网的高度季节性和多事性的环境中，产品推广和大规模的试验往往会导致交易量每天激增20倍。在高峰期，我们的管道需要为单个产品每秒传输400万封邮件(或64 GB/秒)。因此，我们的运营团队面临着管理和优化总共超过1000个物理节点的群集的挑战。\n低延迟和高SLA。随着组织迅速转向利用实时分析来推动业务决策，对数据准确性和及时性的要求变得比以前更加严格。想象一下，当视频消费事件被提供给推荐算法时，或者当发现引导内容供应激励的热门趋势时-希望数据能够在发布后的几秒钟内使用，并且端到端损失率低至0.01%。\n灵活性。现在的实时数据处理体系结构是组件化和可配置的。因此，消息传递系统需要在不影响性能的情况下处理使用者数量、访问模式和主题分布的频繁更改。我们不能像传统的摄取管道那样简单地针对静态拓扑优化系统。\n理想情况下，我们需要一个多租户、巨大的pub/sub系统来满足所有这些需求。在高峰期，它应该可靠地支持每秒数百千兆位的数据传输。它应该几乎立即进行配置，而不会中断现有工作负载；它还需要容忍单节点和群集故障。考虑到接口问题，我们希望尽量兼容Kafka SDK。在探索了单个卡夫卡集群的局限性之后，我们进行了一系列的发展。\n我们选择在Kafka生态系统中开发，因为它的成熟，丰富的客户端和连接器集，以及替代产品中的卓越性能。另一方面，使用Apache Kafka来满足上述要求还存在一些空白。例如，超出预期的是，我们发现在频繁使用期间，多个磁盘故障会导致副本不足，甚至群集级别的可靠性问题。此外，扩展群集的容量(即添加代理)需要大量的数据重新平衡，通常会造成数小时的操作延迟。如果没有完全自动化的容量管理，这将极大地限制我们支持大型企业的方式。\n鉴于我们决定将最初的增强重点放在可伸缩性和容错性上，我们开始构建一个代理层，该层联合多个Kafka集群，并向提供者和消费者提供兼容的接口。代理层将逻辑主题呈现给Kafka客户端，并在内部将它们映射到每个Kafka集群中的不同物理主题。在下图中，一个有8个分区(P0-P7)的逻辑主题被分配到两个物理集群，每个集群有4个分区(P0-P3)。\n逻辑主题的额外抽象层允许我们实现以下所需的行为。首先，我们可以用很少的(重新)同步开销来扩展数据管道的容量。如果达到最大大小的两个群集无法处理预测的峰值容量，我们可以轻松地部署另外两个群集，而无需调整任何现有数据。其次，较小的群集更易于管理容错，因为我们可以细粒度调配额外容量，并以较低成本重定向流量。最后，在(并不罕见)物理集群迁移事件中，透明代理消除了在应用程序端更改任何代码和配置的需要。我们只需要在旧群集完全排空之前将其设置为只读模式，同时将代理与新群集相关联。从逻辑主题的角度来看，这种维护是不可见的。\n在本节中，我们将更详细地介绍我们构建的新组件以及它们在基本场景中如何交互，如下图所示。两个代理服务，一个用于生产者(Pproxy)，另一个用于消费者(Cproxy)，实现Kafka代理的核心协议。它们还负责将逻辑主题映射到它们的物理化身。应用程序使用相同的Kafka SDK直接连接到代理，代理充当代理。\n为了处理这组代理代理，我们构建了一个轻量级名称服务来维护客户机ID和代理服务器集合之间的这种关系。SDK将在通信开始时使用客户端ID请求一次代理代理列表。在内部，我们实现的最复杂、最庞大的部分涉及管理联合集群的元数据，包括主题状态和代理节点的生命周期。我们将Kafka控制器节点的逻辑(如主题元数据)提取到一个单独的服务中，该服务也称为“控制器”，但它不同于Kafka自己的控制器功能。此服务负责收集物理集群的元数据，组成分区信息逻辑主题，然后将其发布给代理代理。\n在最常见的操作过程中，我们可以看到这些组件与下面的Kafka集群之间交互的一些示例：\n逻辑主题元数据检索1.控制器从配置数据库中读取逻辑主题和物理主题之间的映射。2.Controller扫描每个Kafka集群中所有物理主题的元数据。3.控制器从心跳报文中查找可用的pproxy列表。4.控制器编写逻辑主题的元数据。5.控制器将主题映射和主题元数据都推送到代理代理。6.将元数据发送到Kafka SDK。\n群集设置工作流程1.提供一个空群集(群集3)，并将其添加到群集1和群集2的现有联合。2.控制器从配置数据库加载从逻辑主题到物理主题的映射。3.控制器从集群3.4的物理主题加载元数据。4.控制器通过合并2的结果来重构元数据，递增版本。5.Controller将新版本发布给Proxy Broker，客户端刷新后SDK可以看到。\n群集停用工作流程1.控制器在配置数据库中将群集(群集1)标记为以只读模式停用。2.当控制器从数据库获取元数据时，它会拾取此状态更改。3.控制器重建生产者的元数据，从物理集群中移除集群1。4.控制器将新版本的生产者元数据推送到代理。此时，数据停止写入集群1，而消费端不受影响。5.当集群中的所有主题都过期时，控制器再次重构消费者元数据，并移除不再有效的物理主题。6.消费者代理加载新的元数据，现在当新的消费者到达时，它将不再拾取集群1，这就完成了退役操作。\n在过去的一年里，我们在腾讯盈科陆续上了很多产品，使用联合卡夫卡解决方案。除了群集，我们还一直在开发更好的监控和自动化管理工具。我们的设计原则很快就得到了许多关键业务用例的验证，例如实时分析、功能工程等。到目前为止，我们已经部署了几百个大小不一的集群，每天总共处理超过10万亿条消息。下表总结了我们的典型设置和操作基准。\n由带有代理层的集群联合组成的第一种设计有两个明显的局限性。首先，逻辑分区的分布对于在生成消息时使用散列键指定分区的客户端是不透明的。因此，当我们添加新集群时，具有相同键的消息可能会被传递到不同的分区，因此顺序会打乱。事实证明，这不是我们当前用例的拦路器，原因有两个。首先，我们调查了产品团队，发现他们只是偶尔使用键控消息。此外，当他们面临应用程序级别的容错和可伸缩性之间的权衡时，他们通常更喜欢后者，有时会采用一种机制，在更新集群成员身份时暂时停止生产。\n一个更根本的限制是，随着更多的功能需要公开，以及本机Kafka的发展，我们必须频繁地发展代理代理的接口。这会导致不必要的代码重复，并使整个系统更难管理。将来，我们将探索在Kafka中实现类似的语义，如下一节所述。\n正如我们上面解释的，腾讯是全球最大的卡夫卡用户之一，每天处理数万亿条消息。这也意味着，为了支持我们的许多用例，我们已经成功地突破了卡夫卡的一些界限。我们知道Kafka社区内部正在进行的发展和提议，我们进一步发现，我们的一些想法，比如抽象出控制器和跨多个控制器的流量分片，与社区正在走向的方向是一致的。如果我们的联合解决方案与分层存储(KIP-405)和动物园管理员移除(KIP-500)等新功能集成，我们可能会看到显著的好处，我们期待着做出已经证明的贡献，帮助腾讯重返社区。\n在本文中，我们将介绍为需要高可伸缩性和容错能力的业务用例构建联合Kafka集群的过程。通过强大的工程解决方案和运营投入，我们正在弥合差距，支持腾讯盈科的持续增长。我们的经验使我们对卡夫卡生态系统恢复了信心，并阐明了我们如何进一步扩展其能力。我们将继续沿着这个方向发展。\n如果您想了解更多关于Kafka和活动流的信息，请查看Confluent Developer，找到最大的入门资源集合，包括端到端的Kafka教程、视频、演示、Meetup、播客等。\n肯威·陈(Kenway Chen)是腾讯盈科(Tencent PCG)的技术主管和工程经理。他有10多年构建大规模分布式系统、应用程序和数据管道的经验。肯威为腾讯的许多基础技术做出了贡献，例如开源服务框架TARS及其消息队列。他还是Java应用程序、数据库查询引擎和微服务框架领域的专家。\n卡恩·陈(Kahn Chen)是腾讯盈科(Tencent PCG)的高级工程师。他在数据基础设施和应用程序方面有七年的工作经验。具体地说，Kahn专注于消息传递平台和实时数据处理框架。\nGeorge Shu是腾讯盈科的总经理，负责其数据基础设施和平台，并支持所有产品和业务。他拥有10多年构建大型后端系统、机器学习基础设施和商业智能平台的经验。", "note_en": "As one of the world’s biggest internet-based platform companies, Tencent uses technology to enrich the lives of users and assist the digital upgrade of enterprises. An example product is the popular WeChat application, which has over one billion active users worldwide. The Platform and Content Group (PCG) is responsible for integrating Tencent’s internet, social, and content platforms. PCG promotes the cross-platform and multi-modal development of IP, with the overall goal of creating more diversified premium digital content experiences. Since its inception, many major products—from the well-known QQ, QZone, video, App Store, news, and browser, to relatively new members of the ecosystem such as live broadcast, anime, and movies—have been evolving on top of consolidated infrastructure and a set of foundational technology components.\n  At our center stands the real-time messaging system that connects data and computing. We have proudly built many essential data pipelines and messaging queues around Apache Kafka. Our application of Kafka is similar to other organizations: We build pipelines for cross-region log ingestion, machine learning platforms, and asynchronous communication among microservices. The unique challenges come from stretching our architecture along multiple dimensions, namely scalability, customization, and SLA. Here are some of the notable requirements:\n Workload. It takes close and continuous observation to fully grasp the dynamics of data in complex apps. In a highly seasonal and eventful environment of consumer internet with over a billion monthly active users, product promotion and large-scale experimentations often cause volume to burst up 20x from one day to another. At the peak, our pipeline needs to transfer 4 million messages per second (or 64 gigabytes/second) for a single product. Our ops team, therefore, is challenged with managing and optimizing clusters with more than a thousand physical nodes in total.\n Low latency and high SLA. As the organization moves quickly toward leveraging real-time analytics for driving business decisions, the requirements of data accuracy and timeliness become more rigid than before. Imagine when a video-consuming event is fed to the recommendation algorithm or when discovering hot trends that guide the incentivisation of content supply—it is desirable that the data can be used within a few seconds since its emission and with an end-to-end loss rate as low as 0.01%.\n Flexibility. Nowadays real-time data processing architectures are componentized and configurable. Consequently, the messaging system needs to handle frequent changes in the number of consumers, access pattern, and topic distribution without impacting performance. We cannot simply optimize the system for a static topology as a traditional ingestion pipeline.\n Ideally, we need a multi-tenant, gigantic pub/sub system to satisfy all these requirements. At peak time, it should reliably support data transfer at hundreds of gigabits per second. It should be provisioned almost instantly without disrupting existing workload; it also needs to tolerate single-node and cluster failure. Considering interface concerns, we want it to be compatible with the Kafka SDK as much as possible. After exploring the limitations of a single Kafka cluster, we’ve moved forward with a series of developments.\n  We chose to develop in the Kafka ecosystem for its maturity, rich set of clients and connectors, as well as superb performance among alternatives. On the other hand, there are a few gaps in using Apache Kafka to meet the requirements above. For instance, more than expected, we found during heavy usage that multiple disk failures caused insufficient replica or even cluster-level reliability problems. Moreover, expanding the capacity of a cluster (i.e., adding brokers) requires significant data rebalancing, often imposing hours of operational latency. Without fully automated capacity management, this greatly limits how we can support a large business.\n Given that we decided to focus our initial enhancement on scalability and failure tolerance, we started off building a proxy layer that federates multiple Kafka clusters and provides compatible interfaces to both providers and consumers. The proxy layer presents logical topics to Kafka clients and internally maps them to distinct physical topics in each Kafka cluster. In the figure below, a logical topic with eight partitions ( P0–P7) is distributed to two physical clusters each with four partitions ( P0–P3).\n  The extra layer of abstraction of logical topics allows us to achieve the following, desirable behavior. First, we can expand the capacity of the data pipeline with little (re)synchronization overhead. In case two clusters at their maximum size cannot handle the predicted peak volume, we can easily deploy two additional clusters without shuffling any existing data. Second, fault tolerance is easier to manage with smaller clusters, as we can provision extra capacity at fine granularity and redirect traffic at a low cost. Lastly, in the (not-so-rare) event of physical cluster migration, the transparent proxy eliminates the need for any code and configuration change on the application side. We would only need to set the old clusters in read-only mode before it is completely drained, while associating the proxy with the new clusters. Such maintenance is not visible from the perspective of logic topics.\n  In this section, we get into more details of the new components we built and how they interact in essential scenarios, as shown in the figure below. Two proxy services, one for the producer ( pproxy) and another for the consumer ( cproxy), implement the core protocols of the Kafka broker. They are also responsible for mapping logical topics to their physical incarnation. The application uses the same Kafka SDK to connect directly to the proxy, which acts as a broker.\n In order to address the set of proxy brokers, we built a lightweight name service that maintains this relationship between client ID and the collection of proxy servers. The SDK will request the list of proxy brokers using client ID once at the beginning of the communication. Internally, the most complicated and bulky part of our implementation involves managing the metadata of the federated cluster, including both the state of the topics as well as the lifecycle of the proxy nodes. We extract the logic of the Kafka controller node (such as topic metadata) into a separate service, which is also called “the controller,” but it is different from Kafka’s own controller functionality. This service is responsible for collecting the metadata of physical clusters, composing the partition information logical topics, and then publishing it to the proxy brokers.\n  We see some examples of interactions among these components and the Kafka clusters underneath during the most common operations:\n Logical topic metadata retrieval   1. Controller reads the mapping between logical topic and physical topic from the config database. 2. Controller scans metadata of all physical topics from each Kafka cluster. 3. Controller finds the list of available  pproxy from heartbeat message. 4. Controller composes the metadata for the logical topics. 5. Controller pushes both the topic mapping and topic metadata to proxy brokers. 6. The metadata is sent to the Kafka SDK.\n Cluster provisioning workflow  1. An empty cluster (cluster 3) is provisioned and added to the existing federation of cluster 1 and cluster 2. 2. Controller loads the mapping from logical topics to physical topics from the config database. 3. Controller loads metadata from physical topics from cluster 3. 4. Controller reconstructs metadata by merging the result of 2, incrementing the version. 5. Controller publishes the new version to proxy brokers, which will be visible to the SDK after the client refreshes.\n Cluster decommission workflow   1. Controller marks the cluster (cluster 1) to be decommissioned in read-only mode in the config database. 2. Controller picks up this state change when it fetches the metadata from the database. 3. Controller reconstructs metadata for producers, removing cluster 1 from the physical clusters. 4. Controller pushes a new version of producer metadata to the proxy. At this moment, data stops being written to cluster 1, while the consuming side is not impacted. 5. While all topics in the cluster are expired, the controller reconstructs the consumer metadata again and removes the physical topics no longer valid. 6. Consumer proxy loads the new metadata and now when the new consumer arrives, it will no longer pick up cluster 1. This completes the decommission operation.\n  Over the past year, we have gradually onboard many products in Tencent PCG to use the federated Kafka solution. Alongside the cluster, we have also been developing better monitoring and automated management tools. Our design principles have been quickly validated by many critical business use cases such as real-time analytics, feature engineering, and more. Up to now, we have deployed a few hundreds of clusters of various sizes, which collectively handle more than 10 trillion messages every day. The following table summarizes our typical setup and operational benchmarks.\n  There are two notable limitations of the first design composed of cluster federation with a proxy layer. First, the distribution of logical partitions is not transparent to clients who use a hash key to specify the partition when producing a message. Consequently, when we add a new cluster, messages with identical keys might be delivered to different partitions and hence get out of order. This did not turn out to be a blocker for our current use cases for two reasons. First, we surveyed the product teams and found that they only use keyed messages occasionally. Furthermore, when they face the trade-off between application-level fault tolerance and scalability, they typically prefer the latter and sometimes settle with a mechanism to briefly halt production when cluster membership is updated.\n A more fundamental limitation is that we have to frequently evolve the interface of the proxy broker as more functionalities need to be exposed and as native Kafka evolves. This leads to unnecessary code duplication and makes the whole system harder to manage. In the future, we will explore implementing similar semantics inside Kafka, as described in the next section.\n  As we explained above, Tencent is one of the largest Kafka users in the world, processing trillions of messages every day. This also means that to power our many use cases, we have successfully pushed some of Kafka’s boundaries. We are aware of the ongoing development and proposals within the Kafka community, and we further find that some of our ideas, such as abstracting out the controller and shard in traffic across multiple controllers, are along the same lines as what the community is moving toward. We may see significant benefits if our federation solution integrates with new features like  Tiered Storage (KIP-405) and  ZooKeeper removal (KIP-500), and we look forward to contributing what has been proven to help Tencent back into the community.\n  In this article, we introduce our journey of building federated Kafka clusters for business use cases that require high scalability and fault tolerance. Through a strong engineering solution and investment in the operation, we are bridging the gap and supporting the continued growth of Tencent PCG. Our experience has reassured our confidence in the Kafka ecosystem and shed light on how we can further extend its capabilities. We will continue our development along this direction.\n  If you want more on Kafka and event streaming, you check out  Confluent Developer to find the largest collection of resources for getting started, including end-to-end Kafka tutorials, videos, demos, meetups, podcasts, and more.\n Kenway Chen is a tech lead and engineering manager at Tencent PCG. He has more than 10 years of experience building large-scale distributed systems, applications, and data pipelines. Kenway has contributed to many of Tencent’s foundational technology, such as the open source service framework TARS and its message queue. He is also an expert in the area of Java application, database query engines, and the microservices framework.\n Kahn Chen is a senior engineer at Tencent PCG. He has seven years of experience working on data infrastructure and application. Specifically, Kahn focuses on messaging platforms and real-time data processing frameworks.\n George Shu is a general manager at Tencent PCG responsible for its data infrastructure and platforms and supporting all products and business. He has more than 10 years of experience building large-scale backend systems, machine learning infrastructure, and business intelligence platforms.", "posttime": "2020-08-04 06:20:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "腾讯,盈科,pcg,数据", "title": "腾讯盈科如何使用Apache Kafka每天处理10T+消息", "title_en": "How Tencent PCG Uses Apache Kafka to Handle 10T+ Messages per Day", "transed": 1, "url": "https://www.confluent.io/blog/tencent-kafka-process-10-trillion-messages-per-day/", "via": "", "real_tags": ["腾讯", "盈科", "pcg", "数据"]}, {"category": "", "categoryclass": "", "imagename": "b0012e3b33e0a6154719862b441d1a1e.jpg", "infoid": 1016033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌和ADT宣布建立长期战略合作伙伴关系，谷歌将向ADT投资4.5亿美元，两家公司将智能家居和家庭安防产品组合在一起。谷歌表示，两家公司将合作打造下一代有帮助的家庭，而ADT表示，这笔交易将把Nest屡获殊荣的硬件和服务(采用谷歌的机器学习技术)与ADT的安装、服务和专业监控结合起来。详细介绍合作的网站位于adt.com/google。\n多年来，谷歌和ADT都在致力于智能家居安全解决方案。谷歌是从一家进军智能家居的互联网公司起步的，而ADT是从一家老式的家庭安全公司起步的，它不想被这些智能家居的新贵撞倒。到目前为止，两者已经覆盖了相同的区域，并且有大量的重叠。有谷歌和ADT智能手机应用程序、智能显示屏、安全摄像头、烟雾探测器，当然还有家庭安全系统，带有运动探测器、入口传感器、钥匙链存在传感器、安全键盘和月度订阅。(谷歌的安全解决方案是不太知名的Nest Secure)。\n谷歌没有针对专业远程监控的内部解决方案，但Nest Secure使用了Brinks Home Security监控。ADT没有语音命令和智能扬声器等智能家居自动化的内部解决方案，但ADT设备可以与Z-Wave、Google Assistant或Amazon Alexa设备配合使用。\n谷歌和ADT产品线的合并似乎意味着Nest硬件与ADT监控和安装。ADT首席执行官吉姆·德弗里斯(Jim DeVries)接受英国“金融时报”采访时表示，他的公司与谷歌的硬件合作关系是独家的，这意味着ADT未来只会销售谷歌设备。\n在这两份新闻稿中，ADT的安装大军都大声疾呼，对谷歌来说，这将是主要的业务改进之一。智能家居解决方案，特别是那些希望监控每一扇门窗的解决方案，可能涉及购买和安装数十台设备。对于许多潜在客户来说，即使是规划这样的系统也可能太多了，但现在ADT安装程序可以出现，并使用谷歌硬件处理从估算到安装的所有事情。\n谷歌4.5亿美元将获得ADT 6.6%的股份。ADT表示，如果达到某些里程碑，每家公司将额外承诺1.5亿美元，用于联合营销、产品开发、技术和员工培训，以推进合作伙伴关系。\nNest最近经历了从独立公司到谷歌子品牌的艰难过渡。谷歌关闭了与Nest合作的生态系统，破坏了第三方应用程序和设备的互操作性。它杀死了Nest账户，迫使谷歌账户进入用户，同时将之前被认为敏感的智能家居数据合并到谷歌的大数据收集中。据报道，这些变化导致一些第三方安装商抛弃Nest产品，转而使用限制性较低的替代产品。谷歌还将Nest品牌扩展到其大部分智能家居产品，如今，除了Nest公司开发的所有产品外，谷歌Nest指的是所有谷歌家庭扬声器、谷歌Wi-Fi和Chromecast。\n虽然这笔交易最终将使ADT独家安装谷歌硬件，但实现这一目标需要一些时间。ADT表示，它预计从今年开始向客户提供某些谷歌设备，并在2021年扩大整合。", "note_en": "Google and ADT have announced, &#34;a long-term, strategic partnership&#34; that will see Google invest $450 million in ADT and the two companies combine their smart home and home security lineup.  Google says the two companies will work together to &#34;create the next generation of the helpful home,&#34; while  ADT says the deal &#34;will combine Nest&#39;s award-winning hardware and services, powered by Google&#39;s machine-learning technology, with ADT&#39;s installation, service and professional monitoring.&#34; A site detailing the collaboration is up at  adt.com/google.\n Google and ADT have both been working toward smart home security solutions over the years. Google is coming from the position of an Internet company moving into smart homes, while ADT is starting from an old-school home-security company that doesn&#39;t want to get run over by these smart home upstarts. By now, both have covered the same areas and have a ton of overlap. There are Google and ADT smartphone apps, smart displays, security cameras, smoke detectors, and, of course, home-security systems, with motion detectors, entryway sensors, keychain presence sensors, security keypads, and monthly subscriptions. (Google&#39;s security solution is the not-very-well-known  Nest Secure).\n Google doesn&#39;t have an in-house solution for professional remote monitoring, but Nest Secure worked with  Brinks Home Security monitoring. ADT doesn&#39;t have an in-house solution for smart home automation like voice commands and smart speakers, but ADT devices worked with Z-Wave, Google Assistant, or Amazon Alexa devices.\n Merging the Google and ADT product lines seems to mean Nest hardware with ADT monitoring and installation. ADT CEO Jim DeVries spoke to  the Financial Times (paywalled) and categorized his company&#39;s hardware relationship with Google as &#34;exclusive,&#34; meaning ADT will only sell Google devices in the future.\n A big shoutout in both press releases is given to ADT&#39;s army of installers, which, for Google, will be one of the main business improvements. Smart home solutions, especially ones that want every door and window to be monitored, can involve purchasing and installing dozens of devices. The prospect of even planning for a system like this can be too much for many potential customers, but now an ADT installer can show up and handle everything from estimates to installations using Google hardware.\n Google&#39;s $450 million will get a 6.6 percent stake in ADT. ADT says &#34;  Each company will commit an additional $150 million, subject to the achievement of certain milestones, to be used for co-marketing, product development, technology and employee training to advance the partnership&#34;\n Nest has been going through  a rocky transition from standalone company to Google sub-brand lately. Google shut down the &#34;Works with Nest&#34; ecosystem, breaking third-party apps and device interoperability. It  killed Nest accounts and forced Google accounts on users while  merging what was previously considered sensitive smart home data into Google&#39;s Big Data collection. The changes have reportedly lead to some third-party installers  dumping Nest products for less restrictive alternatives. Google has also extended the Nest brand to most of its smart home products, and today in addition to all the products developed by Nest, the company, &#34; Google Nest&#34; means all of the Google Home speakers, the Google Wi-Fi, and Chromecast.\n While the deal will eventually see ADT exclusively install Google hardware, but getting there will take some time. ADT says it &#34;  expects to offer certain Google devices to its customers beginning this year and to expand the integration in 2021.&#34;", "posttime": "2020-08-04 05:57:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,硬件,google,交易,安装", "title": "ADT将在价值4.5亿美元的谷歌交易中独家安装Nest硬件", "title_en": "ADT will exclusively install Nest hardware in $450 million Google deal", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/08/adt-will-exclusively-install-nest-hardware-in-450-million-google-deal/", "via": "", "real_tags": ["谷歌", "硬件", "google", "交易", "安装"]}, {"category": "", "categoryclass": "", "imagename": "2e991f68d88af0be37a674972e531010.jpg", "infoid": 1016032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(CNN)Facebook的事实核查人员周日称这段视频部分虚假，称其被篡改，使其看起来像是众议院议长南希·佩洛西(Nancy Pelosi)喝醉或下药。这段视频自周四以来一直在Facebook上流传，截至周日晚上，点击量已超过200万次。\n2019年5月，佩洛西的一段类似的虚假视频在Facebook上疯传。当时，佩洛西抨击Facebook没有删除这段视频。相反，Facebook给它贴上了事实核查的标签。\nFacebook周日也没有删除这段新视频，这意味着它仍然可以在平台上观看，但已经贴上了警告标签。该公司表示，被标记为虚假的视频也较少受到Facebook算法的影响。Facebook表示，它还将向分享这段视频的人发送通知，以标记事实核查。\n这段视频的观看次数如此之多，可能会促使人们重新审视针对虚假信息的政策。早些时候被操纵的佩洛西视频引发了类似的审查。\n这段视频来自佩洛西5月份举行的一次新闻发布会，当时她被问及唐纳德·特朗普总统对MSNBC主持人、前共和党国会议员乔·斯卡伯勒的虚假指控。\n视觉取证专家、加州大学伯克利分校(University Of California Berkeley)教授哈尼·法里德(Hany Farid)周日查看了这段视频，并告诉CNN，视频经过编辑并放慢了速度。\n法里德说，这似乎与去年四处流传的议长佩洛西的操纵类型相同。\n法里德说，根据Facebook操纵媒体的政策，这段视频应该被删除。Facebook发言人安迪·斯通(Andy Stone)周日晚间告诉CNN，这段视频并没有以一种值得删除的方式违反其政策。\n斯通告诉CNN，在一年多前议长佩洛西之前的一段视频发生事件后，我们采取了一些关键步骤，让Facebook上的人们非常清楚地知道，当第三方事实核查人员确定内容是虚假的时，我们还会更新我们的政策，明确我们将删除哪种被操纵的媒体。而且，和往常一样，当一段视频被认定为虚假时，其传播量会大幅减少，观看它、试图分享或已经分享过它的人会看到警告，提醒他们该视频是虚假的。\n这段视频是一名Facebook用户周四上传的，配文为：这简直难以置信，她疯了，我打赌这个视频一定会被删除！\n这位Facebook用户根据视频末尾的一张图片，使用了最初发布在TikTok上的视频副本。\n美国有线电视新闻网(CNN)周日询问这段视频后，TikTok的一位发言人表示，该公司已将其删除，原因是该视频违反了其合成媒体政策。\n这位发言人在一份声明中表示：我们的用户重视在TikTok上看到真实的内容，我们也是如此，这就是为什么当我们意识到这些内容时，我们会删除有害的、误导性和欺骗性的内容。\n这段视频的副本也在YouTube上流传。YouTube发言人法沙德·沙德洛(Farshad Shadloo)表示，该公司删除了CNN周日晚间询问的三份视频副本，原因是该公司违反了其对受操纵媒体的政策。\n在CNN询问后，Twitter还在其平台上删除了该视频的一个版本，该版本的点击量已超过30万次。", "note_en": "New York (CNN)Facebook&#39;s fact-checkers on Sunday labeled as &#34;partly false&#34; a video that it said was manipulated to make it appear as if House Speaker Nancy Pelosi was drunk or drugged. The video had been circulating on Facebook since Thursday and by Sunday night had been viewed more than 2 million times.\n A similarly false video of Pelosi went viral on Facebook in May 2019. At the time, Pelosi blasted Facebook for not removing the video. Facebook had instead applied a fact-check label to it.\n Facebook did not remove the new video on Sunday either, meaning it can still be viewed on the platform but a warning label has been placed on it. Videos marked false are also promoted less by Facebook&#39;s algorithms, the company says. Facebook said it will also send a notification to people who shared the video to flag the fact check.\n   That the video was viewed so many times will likely prompt renewed scrutiny of policies on misinformation. The earlier manipulated Pelosi video prompted similar scrutiny.\n   The video is from a press conference Pelosi gave in May in which she was asked about  false allegations President  Donald Trump made about the MSNBC host and former Republican congressman Joe Scarborough.\n Hany Farid, a visual forensic expert and professor at the University of California Berkeley, reviewed the video on Sunday and told CNN it had been edited and slowed down.\n &#34;This appears to be the same type of manipulation (of) the Speaker Pelosi that made the rounds last year,&#34; Farid said.\n Farid said the video should be removed under Facebook&#39;s manipulated media policy. Facebook spokesperson Andy Stone told CNN Sunday night the video did not break its policies in a way that would warrant it being removed.\n Stone told CNN, &#34;Following an incident over a year ago with a previous video of Speaker Pelosi, we took a number of key steps, making it very clear to people on Facebook when a third-party fact-checker determines content to be false and updating our policy to make explicit the kind of manipulated media we will remove. And, as always, when a video is determined false, its distribution is dramatically reduced and people who see it, try to share it, or have already shared it, see warnings alerting them that it&#39;s false.&#34;\n The video was posted by a Facebook user Thursday with the caption, &#34;This is unbelievable, she is blowed out of her mind, I bet this gets taken down!&#34;\n The Facebook user used a copy of the video that was originally posted on TikTok, based on a graphic at the end of the video.\n  After CNN asked about the video Sunday, a TikTok spokesperson said the company had removed it for violating its &#34;synthetic media policy.&#34;\n &#34;Our users value seeing authentic content on TikTok, and we do, too, which is why we remove harmful misleading and deceptive content as we become aware of it,&#34; the spokesperson said in a statement.\n Copies of the video also circulated on YouTube. The company removed three copies of the video CNN asked about on Sunday evening for violating its policies on manipulated media, said Farshad Shadloo, a YouTube spokesperson.\n Twitter also removed a version of the video on its platform that had more than 300,000 views after CNN asked about it.", "posttime": "2020-08-04 05:55:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,facebook,视频,twitter", "title": "另一段让南希·佩洛西(Nancy Pelosi)看起来喝醉了的视频在网上疯传；YouTube、Twitter删除了视频的各个版本，而拥有200万点击量的Facebook则增加了事实核查标签", "title_en": "Another video making Nancy Pelosi seem drunk goes viral; YouTube, Twitter removed versions of it, while Facebook, where it has 2M+ views, adds fact-check label", "transed": 1, "url": "https://cnn.com/2020/08/02/politics/fake-nancy-pelosi-video-facebook/", "via": "", "real_tags": ["youtube", "facebook", "视频", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "0a5083e64c593302e7047850ed4449c8.jpeg", "infoid": 1016031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近一直在试用戈多游戏引擎，我看到的东西给我留下了深刻的印象。\n虽然它是为制作游戏而设计的，但它有一个非常复杂的图形用户界面制作系统。我认为这是高级GUI应用程序的未来。不相信？\n请看下图。这是来自戈多编辑器的。它看起来相当精致，对吧？您需要：\n可视化编程系统中使用的连接节点的节点画布(以及其他几个受支持的编程系统)。\n平铺地图编辑器、动画编辑器和大量其他音频编辑器，还有很多其他我甚至没有时间去探索的东西。\n你认为他们是如何制作出如此复杂的图形用户界面的？是QT吗？电子？要可可吗？\n不，这都是用戈多游戏引擎本身制作的。他们真的是在吃自己的狗粮。因此，您在这里看到的所有内容都可以使用Godot在您自己的应用程序中完成。\n当然，您可以通过其他工具找到类似这样的复杂GUI。一些竞争对手的引擎使用Qt来制作它们的编辑器。\n带有Engine End Editor的所有Godot只需下载31.1MB。一键安装，编辑器立即启动。\n当我解包并安装时，它仍然只有70MB左右。与您获得的功能数量相比，这是一个绝对微不足道的安装。让我们来看一看这件事。仅下载Qt5，就需要5 GB的可用空间！\n考虑一下Qt Creator IDE，它非常简约，没有运行所需的Qt，需要超过200MB。\nXcode怎么样？下载量超过5 GB。安装后，它在我的硬盘上大约需要10 GB。这是一个完全不同的联赛。Android Studio为500MB，Android SDK为1.5G。这些东西都很大，尽管还不清楚它们是否提供了比Godot多得多的功能。\n仅用于演示内容的Keynote有433.5 MB的大小。这可能不包括共享框架，它使用。\n让我们来看看Godot在大小上与哪些应用程序相比较。1安装管理密码的密码为55.5MB。离戈多很近。邮件的大小约为30MB，照片的大小约为50MB。\n换句话说，Godot的大小非常接近于功能非常有限的应用程序。\n与我以前习惯的设计相比，Godot GUI设计的速度快得让人抓狂。在构建UI时，他们确实仔细考虑了这么多常见问题。\n你可以用键盘在这棵树上上下移动。因此，例如，我可以使用箭头键移动到我想要添加GUI组件的容器或面板。然后我可以点击Cmd+A(在Mac上)打开一个对话框来选择GUI组件。\n现在，您可以使用鼠标展开显示大量节点的大树。但非常有效的是，当对话框打开时，您会立即进入搜索栏。我可以开始键入“Button”来查看存在哪些类似节点的按钮。当我键入时，列表被过滤。\n在此过程中，我可以同时使用箭头键在列表中移动以进行选择。即使我那样做了，我也不会错过对搜索栏的关注。\n因此，我只需选择我想要的节点，然后按Enter键即可。它将作为子节点添加到我之前选择的节点。\n这样，我完全使用键盘上的箭头键、Cmd+A和Enter来构建GUI。如果我在组件上按Enter键，我可以更改其名称。如果我按Cmd+D，我会复制它。因此，我不需要打开和搜索，比方说标签多次。如果我知道我需要10个标签。我可以只做一个标签，然后复制10次。\n在各种UI设计工具中，最让我沮丧的事情之一是选择由多个其他组件组成的UI组件。例如，在Qt Creator中，我经常尝试选择包含子组件的布局，结果却意外地选择了一个子组件并将其从布局中拉出。\n在Godot中，意外选择子组件不是问题。请注意我在下面的MarginContainer旁边用粉红色圈出的小图标。这个图标被切换是因为我之前点击了用黄色圈出的工具栏中的图标。这样就不能在画布上选择子对象。我仍然可以在树中选择它们，但是如果在布局时单击组件，我将获得父组件。\n这真的很实用，因为它使处理布局变得容易。在其他编辑器中，选择布局可能很棘手。另一个对戈多有利的重要细节。您不能在画布上更改父关系，只能在节点树中更改。因此，您不会意外地从层次结构中拉出组件。在这种情况下，您要做的就是将子组件的相对位置更改为其父组件。\n在任何高级GUI中，您都需要以特定的方式配置大量特殊的自定义GUI组件，以适合您的应用程序。\n这对传统的GUI设计者来说从来都不是件好事。您可以子类化一个组件，但通常它在GUI编辑器中只会显示为一个灰色矩形。\n如果它确实出现了，您就无法对其进行过多配置。通常情况下，所有事情都必须用代码来完成。戈多就不是这样了。\n在下图中，您可以看到我们已经将一个脚本附加到名为ColorPicker的节点上，该节点的类型为OptionButton。将脚本附加到Godot中的节点相当于将该节点子类化。这就是为什么您可以看到脚本代码说扩展OptionButton的原因。\nOptionButton是一个下拉菜单。开箱即用的Godot在GUI中没有任何机制来指定它应该包含哪些元素。\n但是，我们可以将自己的属性添加到任何场景节点对象的Godot编辑器的检查器中。您可以在高亮显示中看到我编写了以下代码行：\n这告诉Godot成员变量itemvalue应该在Godot编辑器中可见。我还告诉它它是一个包含字符串元素的Array。使用的语言GDScript是动态类型的，所以这些更像是提示。\n这样做的结果是，当选择ColorPicker时，Inspector会显示一个itemvalue条目，我可以在其中修改元素。您可以看到，在本例中，我将最后一个值从&#34；蓝色&#34；更改为&#34；青色&34；\n当组件已加载到场景中并准备好使用时，将调用_Ready函数。在本例中，我们利用这个机会阅读用户设置的项目值，并将每个条目添加到下拉菜单框中。\n聪明并没有止步于此。如果我复制此组件并在其他地方使用它，将使用相同的附加脚本。如果我更改一个组件上的代码，它将更改所有其他组件上的代码。因此，它们不容易失去同步。如果我真的想要自定义行为，我可以分离特定组件上的脚本。或者我可以用一个子类来扩展它以改进行为。\n我可以继续讲几十个其他的小细节，这使得GUI编辑在戈多变得轻而易举。但我希望我已经明白了这一点，他们真的考虑到了人体工程学。\n我过去遇到的许多问题阻碍了我高效地使用GUI，这似乎是他们预料到的。\n但也许真正的杀手级功能是，您可以运行应用程序并在运行时修改其GUI布局和附加脚本的代码，这些更改会立即反映在运行的应用程序中。\n当然，这种您可以在运行时编辑代码的功能以某种形式存在于许多地方。但是，如果您的经验与我类似，您知道，如果您处理编译语言，这些东西往往非常脆弱和有限。\nGodot使用一种带有Python语法的动态语言，称为GDScript，它是专门为与编辑器集成而定制的。这意味着它是为处理重载和同步而设计的。你可以看出它工作得很好。\n这是一门超级容易学的语言。我基本上一天就学会了。它与发动机非常好地结合在一起。\n您可以命令单击任何内容以跳转到其定义文档。你会得到很好的命令完成。尽管它不是一种真正的静态类型语言，但它在识别类型方面非常出色。就像现代Python一样，您可以在任何想要改进猜测的地方添加类型提示。\n它不仅完成了类型名称和函数名称。当您将路径写入场景图中的节点时，它甚至会完成字符串。\n当然，另一种选择是使用像Electron、Qt widgets、Qt QML或Cocoa这样的工具。替代方案的第一个问题是，它们是巨大的、臃肿的、笨拙的野兽。\n想想看，如果有人想要查看您正在处理的某个GUI，您可以将Godot项目文件发送给他们，而这些文件只需下载31MB即可查看。哦，我有没有告诉过你，Godot是完全免费的，开源的，并且在麻省理工学院的许可下？\n没错，任何人都可以免费下载它，并使用Godot做任何他们想做的事情。\n试着让人看看你做的Qt设计。“哎呀，对不起，你需要5 GB的下载空间才能做到这一点。哦，顺便说一句，你需要在网站上注册一个账户，登录并努力搜索才能找到免费版本。“。\n更不用说，如果您使用Qt小部件，它应该用于大型专业GUI应用程序(这是我在这里讨论的主题)，那么您必须使用GUI设计器，这非常糟糕。事实上，这就是我制作自己的标记语言ERML的原因，只是为了允许对Qt Creator的GUI以外的QtUI文件进行更合理的编辑。\n你问为什么Qt Creator很烂？这篇文章中提到的许多事情。选择和使用组件的嵌套布局几乎是不可能的。而且对象树结构不允许您执行任何有用的操作。\n它基本上是一个“只写”系统。您可以很好地制作一个复杂的GUI，但祝您稍后回到它并进行重大修改时好运。你会弄坏布局，你不会记得怎么把它放回原来的样子。\n而且没有一种合理的方法来定义您想要在编辑器中使用的自定义组件。在戈多，这是微不足道的。您可以制作由其他组件组成的任意复杂组件，并轻松重用它们。当然，您可以在Qt Creator中复制粘贴一组GUI组件，但是如果您决定要进行修改，那么您就完蛋了。\n相比之下，在Godot中，您可以使用您制作的GUI组件集合作为模板。更改模板以及基于该模板更改的所有其他GUI组件。\n更不用说你不能改变你的用户界面。Qt C++项目很容易获得非常慢的周转时间，这在制作GUI时会完全扼杀生产力。\n那么QML呢？它解决了许多问题，并利用动态语言使动态类型的更改变得更容易。\n老实说，关于QML是如何工作的，我不记得太多细节。我只记得这并不像我希望的那样直观。编辑花了我相当长的时间才把我的头脑弄清楚，真的一点也不光鲜。\n很多东西都感觉很慢。我做的图形用户界面效果不是很好。当我调整窗口大小时，即使是相当简单的东西在重新绘制时也是非常糟糕的。也许是因为它是为移动设备设计的，所以它没有针对改变大小的窗口进行优化？我不知道。\n尽管考了很多次，我的绘画还是没有拿到像样的成绩。但最大的杀手可能是没有一套全面的高级小部件来构建高级GUI应用程序。\n当我使用SWIFT在Xcode中处理iOS应用程序时，我使用过基于约束系统的布局管理器。这是一个非常强大和先进的系统。\n起初，我认为这真的是前进的方向。然而，根据我的经验，它太复杂了，无法处理。即使对于简单的屏幕，我有时也会遇到非常复杂的约束，这可能很难调试。\n虽然我在Xcode和Swift上花了很多时间，但也许检验它是否有效的最终测试是，在离开它一段时间后，你花了多少时间再次投入其中。\n这对我来说不太管用。我无法理解我过去做过的很多事情。斯威夫特变得太复杂了。这是一种很好的语言，但讽刺的是，它正在开发一些与C++和Haskell相同的问题。类型系统的复杂性和严格性有点太频繁了。\n这是一把双刃剑。当我开始使用SWIFT时，我喜欢强大的打字能力捕捉到了许多错误。但它总是带着一种复杂的感觉，因为与类型系统的斗争是经常发生的。现在，情况似乎变得更糟了，尤其是在处理闭包时。\n整个设置很容易让你精神超负荷。我无法有效地使用该系统，因为我无法将您需要了解的所有内容都保存在我的脑海中。\nSwiftUI似乎是一个很有前途的选择。它在某种程度上遵循与QML相同的方法。我认为这是一个很有前途的模式。我不反对QML，因为我认为它是个坏主意，只是因为我认为它执行得不好。\n我只短暂地使用过SwiftUI。对我来说，这看起来是一个明显的进步，但我觉得它仍然没有戈多那么好。虽然您获得了GUI组件的GUI检查器面板，但您仍然被迫在很大程度上用代码编写GUI。我认为GUI编辑应该同时支持两者。GUI设计是一个非常直观的过程，IMHO。\n也许更重要的是，人们仍然没有能力对正在运行的应用程序进行实时更改和修改。对于包含大型项目的复杂GUI应用程序来说，必须在进行测试之前加载这些项目，这是一个杀手锏。\n我对Web技术的讨论需要一些免责声明。我几乎没有使用Web技术的经验，我也不太喜欢Web技术。我是一个老派的GUI工具包爱好者，他在一台旧的Amiga1000上使用直觉工具包做了他的第一个GUI东西。\n不过，我必须承认，我喜欢网络技术的很多地方。在浏览器中，您可以实时编辑和更改属性，并查看对GUI的即时更改。\n这真的很复杂。我学习现代HTML5、CSS和JavaScript框架的个人经验需要相当长的时间。我试图概述不同的网络技术以及它们之间的关系，这可能会让我对此有所了解。\n它是为网页制作的，而不是应用程序。当我试图为一个应用程序制作GUI时，我发现我经常遇到假设我们在某个可滚动的网页上的假设所带来的限制。\n后者需要一些解释。创建可重用组件的Web方式是通过某种模板。基本上，您只需复制粘贴一大块HTML，多次表示新的自定义组件即可。\n这意味着您通常通过模板引擎工作，您正在编写的内容和Web浏览器中正在进行的操作之间没有一对一的映射。\n这与Godot形成对比，例如，从开发的角度来看，我可以创建一个自定义组件并实例化它。当我在我的应用程序运行时进行实时修改时，这些事情是相同的。我在实时应用程序中获得了与我编码时相同的节点。这在整个往返过程中都有帮助，并降低了操作过程中的心理复杂性。\n现在，使用游戏引擎来制作应用程序似乎很疯狂，因为由于需要不断渲染，它确实窃取了更多的CPU周期。然而，在许多方面，这与基于Web的应用程序相比就相形见绌了。\n像VSCode和Atom这样的编辑器表明，您可以使用Web技术制作一些很棒的东西。然而，我们也有像失眠游戏这样的公司，他们尝试用网络工具制作他们的游戏引擎编辑器。\n那基本上是一次失败的实验。他们所看到的问题是，它在制作复杂的自定义GUI组件方面工作得太差了。今天大多数Web技术的使用都没有问题，因为他们不使用自定义组件。例如，Atom没有带色轮的颜色选择功能。\n使用游戏引擎来制作GUI应用程序似乎很疯狂。人们可能会本能地觉得这样做是错误的。\n但我认为，世界可能会以这种方式结束，这是有很好的理由的。这一切都是关于钱在哪里，有什么激励措施在发挥作用。\n博彩业规模巨大。今天的游戏具有巨大的复杂性，可以与大多数实际应用程序相媲美。游戏开发面临着一些相当残酷的生存条件。\n它们必须允许开发非常高性能的代码，这样才能从您的计算机中榨取每一分性能。他们必须在迭代的同时做到这一点，在制作游戏时，实验必须非常快速和简单。游戏几乎是被定义的，而不是你可以预先明确定义的。要想让游戏变得正确，需要进行大量的调整、实验和游戏。\n这使得游戏引擎解决了我们这些从事大型复杂GUI应用程序开发的人所面临的问题。实时修改运行代码在游戏引擎世界中是很正常的事情。它必须是。你不能在每次你想要调整某个你正在尝试的特定级别的东西时重新加载整个该死的东西。\n把这一点与投入到这个问题上的巨额资金结合起来。大型复杂的GUI应用程序是一个很小的利基市场，而游戏则不是。\n这就是为什么为机器人制造模拟器的人最终改用游戏引擎的原因。引擎市场意味着游戏引擎在质量、性能和易用性上远远超过机器人模拟器。\n由于规模经济的原因，这种利用看似无关的奇怪东西的方式并不是什么新鲜事。例如，特斯拉的理念是，他们没有使用定制的汽车电池制造汽车，而是选择了一个看似疯狂的想法，使用7000个笔记本电脑电池为他们的汽车提供动力。\n这看起来像是一个荒谬的解决方案，但它奏效了，因为标有标签的笔记本电脑太大了，这使得笔记本电脑的电池真的很好很便宜。\n这将发生在传统的GUI工具包中：它们将落后于竞争激烈的游戏引擎世界中正在发生的事情。\n使用游戏引擎的主要缺点是经常渲染，这会导致更高的恒定GPU和CPU使用率。尽管许多读过本文的人都反复向我指出，Godot实际上有一个低CPU使用率模式。显然，这仅在需要重新渲染对象时才会渲染。也许我们可以既吃蛋糕又吃蛋糕？\n我写这篇报道时认为戈多是解决制作大型复杂GUI的人所面临的挑战的答案。但也许这实际上是每个人的解决方案。据我所知，Godot引擎给解决方案增加了20-30MB的开销。对于相当中等规模的应用程序，这可能是可以接受的。它似乎与我的日常编辑器TextMate有很大关系，TextMate的大小为30MB。然而，与Atom编辑器相比，它的容量高达500-600MB，这是非常划算的。\n那么为什么要跳到Web技术来获得跨平台GUI应用程序呢？我们有一个工具，Godot，它可以在所有主要平台上运行，使用最少的资源，任何人都可以快速上手。\n谦虚地说，现实是网络技术更为人所知，这将使它们继续占据主导地位。然而，我认为对于大型、复杂的GUI应用程序，我们一直缺乏选择，而Web技术根本不能满足我们的需求。如果戈多想要打入应用程序开发市场，他们可能不得不像特斯拉一样，从高性能跑车开始，然后一路向下发展到日常用车。\n百闻不如一见。不确定你是否可以用戈多做真正的应用程序？看看这些家伙中的一些人。我们请到了阿尔弗雷德·雷诺德·鲍迪希，他很友好地分享了他使用戈多制作特雷洛克隆人的经验。\n我们有安德鲁·伍尔德里奇，他在戈多制作了这本内容广泛的RSS阅读器指南。\n也有一些相当壮观的例子，比如用来制作奇幻世界地图的WonderDraft。\n而我。\n.", "note_en": "I have been trying out the  Godot Game Engine lately, and I have been mightily impressed with what I see.\n While it was designed to make games, it has an exceptionally sophisticated system for making graphical user interfaces. I think this is the future for advanced GUI applications. Not convinced?\n Look at the the image below. This is from the Godot Editor. It looks pretty sophisticated right? You got:\n A canvas of nodes connected nodes used in a visual programming system (in addition to several other supported programming systems).\n     Tile map editor, animation editor and tons of other editors for audio, and many other things I haven’t even gotten time to explore.\n  How do you think they made such a sophisticated GUI? Was it Qt? Electron? Cocoa?\n No, this was all made with the Godot Game Engine itself. They are really  eating their own dog food. So everything you see here you can accomplish in your own application using Godot.\n Sure you can find sophisticate GUIs like this through other tools. E.g. some of the competing engines use  Qt to make their editor.\n   All of Godot with Engine end Editor is a mere 31.1 MB download. One click installation and the editor launches instantly.\n When I unpack and install it is still just around 70 MB. That is an absolutely tiny install relative to the amount of functionality you get. Let us put this a bit in perspective. Merely downloading Qt5, requires 5 GB of free space!\n Consider Qt Creator IDE which is quite minimalist, without Qt which it requires to run, requires over 200 MB.\n How about Xcode? Downloading it is over 5 GB. After installation it takes around 10 GB on my hard drive. That is a different league altogether. Android Studio is 500 MB, and Android SDK is 1.5 GB. These things are big, despite the fact that it is not clear that they offer significantly more functionality than Godot.\n Keynote which is just for presenting stuff comes in at a hefty 433.5 MB. And that probably excludes shared frameworks, it uses.\n Let is look at what kind of applications Godot compares with in size. 1Password which manages passwords is 55.5 MB installed. Quite close to Godot. Mail is about 30 MB, Photos 50 MB.\n In other words Godot is in size much close to applications with a very narrow set of functionality.\n  Godot GUI design is insanely fast to work with compared to what I have been used to before. They have really thought through so many of the common problems when constructing a UI.\n   You can move up and down this tree with the keyboard. So I can e.g. use the arrow keys to move to a container or panel I wish to add a GUI component to. Then I can hit  Cmd+A (on Mac) to open up a dialog to select a GUI component.\n   Now you can expand a large tree showing tons of nodes here using the mouse. But what is very efficient is that when the dialog opens you are immediately in the search bar. I can start typing “Button” to see what button like nodes exist. As I am typing the list gets filtered.\n While this is happening I can at the same time move in list with my arrow keys to make a selection. I don’t miss focus on the search bar even if I do that.\n So I can just select the node I want and hit enter. It get added as a child to the node I had selected earlier.\n This way I use the keyboard entirely with arrow keys,  Cmd+A and  Enter to build up a GUI. If I hit enter on a component I can change its name. If I hit  Cmd+D I duplicate it. Hence I don&#39;t need to open and search for say a label multiple times. If I know I need 10 labels. I can just make one label and duplicate it 10 times.\n   One of the most frustrating things for me in various UI design tools is selecting UI components made up of multiple other components. E.g. in Qt Creator I would frequently try to select a layout containing child components only to accidentally select a child component and pull it out of the layout.\n In Godot accidentally selecting a child component is not a problem. Notice the little icon I have circled in pink next to the  MarginContainer below. This icon got toggled because I had earlier clicked on the icon in the toolbar circled in yellow. It makes it so children cannot be selected on the canvas. I can still select them in the tree, but if I click on the component as it is laid out I will get the parent instead.\n  This is really practical because it makes it easy to deal with layouts. In other editors selecting a layout can be tricky. Another important detail in Godot’s favor. You don’t change parent relationships on the canvas, only in the node tree. Hence you don’t accidentally pull out a component from a hierarchy. All you would do in that case is to change the relative position of a child component to its parent.\n  In any advanced GUI you will need a lot of special customized GUI components configured in particular ways to fit your application.\n This  never plays nice with traditional GUI designers. You may be able to subclass a component but often it will just show up as a gray rectangle in the GUI editor.\n And if it  does show up, you cannot configure it much. Everything will typically have to be done in code. Not so with Godot.\n In the image below you can see we have attached a script to the node called  ColorPicker which is of type  OptionButton. Attaching a script to a node in Godot is the equivalent to subclassing that node. That is why you can see the script code says  extends OptionButton.\n OptionButton is a dropdown menu. Out of the box Godot does not have any mechanism in the GUI for specifying what elements it should contain.\n  However we can add our own properties to the Godot Editor’s inspector for any scene node object. You see in highlight I have written this code line:\n  This tells Godot that the member variable  itemvalues should be visible in the Godot editor. I also tell it that it is an  Array with  String elements. The language used, GDScript is dynamically typed so these are more like hints.\n The result of this is that you can see that when  ColorPicker is selected the Inspector shows an entry for  itemvalues where I can modify elements. You can see I changed the last value from &#34;blue&#34; to &#34;cyan&#34; in this example\n  The  _ready function gets called when the component has been loaded into the scene and is ready to be used. In this case we use the opportunity to read of what the user had set  itemvalues to and add each entry to the dropdown menu box.\n The cleverness does not stop at that point. If I duplicate this component and use it elsewhere the same attached script will be used. If I change the code on one component it will change on all others. Thus they do not easily get out of sync. If I truly want custom behavior I can detach the script on a particular component. Or I can extend it with a subclass to refine the behavior.\n  I could go on about dozens other little details which makes GUI editing a breeze in Godot. But I hope I have gotten across the point that they have really thought about ergonomics.\n So many of the problems I have faced in the past hindering me from working efficiently with GUIs they seem to have anticipated.\n But perhaps the real killer feature is that you can run your application and modify its GUI layout and the code of attached scripts while it is running and those changes get immediately reflected in the running application.\n Sure this kind of functionality where you can edit code while you are running exists many places in some form. But if your experience is anything like mine you know this stuff tends to be quite brittle and limited if you deal with compiled languages.\n Godot uses a dynamic language with Python syntax called  GDScript which was specifically tailored to integrate with the editor. This means it was designed to handle reloading and syncing. And you can tell it works really well.\n It is a super easy language to learn. I picked it up in basically a day. It integrates exceptionally well with the engine.\n You can command click on anything to jump to its documentation of definition. You get great command completions. Even though it is not really a statically typed language it is amazing good at figuring out types. And just like modern Python you can add type hints wherever you want to improve the guessing.\n It not only completes type names and function names. It will even complete strings when you are writing paths to nodes in the scene graph.\n  The alternative is of course to use something like Electron, Qt Widgets, Qt QML or Cocoa. The first issue with the alternatives is that they are huge bloated lumbering beasts.\n Think about it if somebody wants to look at some GUI you are working on, you can send them the Godot project files and they are a 31 MB download away from looking at it. Oh did I tell you that Godot is entirely free, open source and under an MIT license?\n That is right, anybody can download it at no cost and do whatever they want with Godot.\n  Try having somebody look at a Qt design you made. “Oops sorry you need a 5 GB download to do that. Oh and btw you need to register an account on a website, login and search really hard to find the free version.”\n  Not to mention that if you use Qt Widgets which is supposed to be used for large professional GUI applications which is my topic of discussion here then you have to use a GUI designer which quite frankly sucks. In fact that is why I made my own  markup language ERML, just to allow some more sane editing of Qt ui files other than Qt Creator’s GUI.\n Why does Qt Creator suck you ask? Many of the things mentioned through this article. Selecting and working with nested layout of components is next to impossible. And the object tree structure doesn’t let you do anything useful.\n It is basically a “write-only” system. You can make a complex GUI fairly well, but good luck coming back to it later and making significant modifications. You will beak the layout and you will not remember how to put it back to how it was before.\n And there is no sane way to define custom components which you want to use in the editor. In Godot this is trivial. You can make arbitrary complex components made up of other components and easily reuse them. Sure you can copy paste a collection of GUI components in Qt Creator, but if you decide you want to make a modification you are screwed.\n In Godot in contrast you can use a collection of GUI components you made as a template. Change the template and all other GUI components based off that template changes as well.\n Not to mention you cannot do life changes to you user interface. A Qt C++ project easily gets a very slow turn around time which totally kills productivity when making a GUI.\n  So what about QML then? It solves many problems and utilize a dynamic languages which makes on the fly types of changes easier.\n Honestly I don’t remember much of the details of what QML was like working with. I just remember it was not as intuitive as I would have wished. The editor took quite some time for me to wrap my head around and it really did not feel polished at all.\n  A lot of stuff just felt slow. The GUIs I made did not work great. Even fairly simple stuff was very bad in redrawing when I resized the window. Perhaps because it was made for mobile it was not optimized for windows changing size? I don’t know.\n Despite various tests I could not get decent performance in drawing. But perhaps the biggest killer was that there was no comprehensive set of advanced widgets to build an advanced GUI application with.\n  I have used layout managers based off a constraint based system when working on iOS applications in Xcode with Swift. It is a very powerful and advanced system.\n At first I thought this was really the way forward. However in my experience it was just too complex to work with. Even for simple screens I sometimes ended up with really complex constraints which can be hard to debug.\n While I have spent a lot of time with Xcode and Swift perhaps the ultimate test of how well it works is how much time you spend jumping into it again after being away from it for a while.\n That did not work well for me. I cannot make sense of a lot of stuff I have done in the past. Swift is getting too complex. It is a nice language but it is developing some of the same problems as C++ and Haskell ironically. The complexity and strictness of the type system is getting in your face a little bit too often.\n It is a double edged sword. When I began using Swift I loved how the strong typing caught many mistakes. But it was always with a mixed feeling, as battling the type system was a regular occurrence. Now it seems to have gotten worse especially when dealing with closures.\n The whole setup just easily gives you a mental overload. I cannot be effective working with the system because I simply am not able to keep all the stuff you need to know in my head.\n SwiftUI seems like a promising alternative. It is kind of following the same approach as QML. Which I think is a promising model. I am not against QML because I think it is a bad idea, just because I think it is poorly executed.\n I have only used SwiftUI briefly. To me it looks like a clear improvement but IMHO it still falls short of Godot. While you get a GUI inspector panel for your GUI components you are still forced to largely write the GUI in code. I think GUI editing should support both. GUI design is a very visual process IMHO.\n Perhaps more importantly one still does not have the ability to make live changes and modification to a running application. For a complex GUI application with large projects which have to be loaded before you get to the thing you want to test, this is a killer.\n  My discussion of Web technologies needs some disclaimers. I have little experience with web technologies, and I am not very fond of web technology. I am an old school GUI toolkit guy, who did his first GUI stuff using the  Intuition toolkit on an old Amiga 1000.\n  Still I must concede there are many things I like about web technologies. In the browser you can do live editing and changing of properties and see immediate changes to a GUI.\n  It is really complex. My personal experience in learning modern HTML5, CSS and JavaScript frameworks take considerable amount of time. My attempt at giving an  overview of different web technologies and how they relate may give a sense of this.\n It was made for web pages not applications. When trying to make a GUI for an application I found that I so often hit on the limitations imposed by the assumption that we are in some scrollable webpage.\n The latter needs some explanation. The web way of creating reusable components is through some kind of templating. You are basically just copy pasting a chunk of HTML several times representing your new custom component.\n This means you are typically working through templating engines and there is no one to one mapping between what you are writing and what is going on in the web browser.\n This contrasts with Godot e.g. From a development standpoint I can create a custom component and instantiate that. When I do live modifications while my app is running these things are one and the same. I got the same nodes in live application as when I was coding. This helps on he whole round trip and lowers mental complexity in working with it.\n Now it may seem crazy to use a game engine for making an application given that it does steal more CPU cycles due to the need for constant rendering. However in many ways that pales in comparison to the resource hog web based applications are.\n Editors like VSCode and Atom show that you can make some great stuff using web technologies. However we also have companies like  Insomniac Games which tried making their game engine editors using web tools.\n That was mostly a failed experiment. The problem as they saw it was that it works too poorly to make complex custom GUI components. Most use of web technologies today don’t have problem with that because the don’t use custom components. Atom e.g. doesn’t have color pick with a color wheel.\n  It seems crazy to use a game engine to make a GUI application. And people may feel it is instinctively wrong to do so.\n But I think there are very good reasons why the world may end up that way. It is all about where the money is and what incentives are at play.\n The gaming industry is huge. Games today have massive complexity rivaling most actual applications. Game development faces some rather brutal conditions to survive.\n They must allow the development of very high performance code which squeezes every ounce of performance out of your computer. They have to do this while iterating and experimentation has to be really quick and easy when making a game. Games are almost be definition not something you can clearly define up front. A lot of tweaking, experimentation and playing will be needed to get a game right.\n This has caused game engines to solve the problem that has faced those of us working on large complex GUI applications. Live modification of running code is a normal thing in the game engine world. It has to be. You cannot reload the whole damn thing each time you want to tweak something at a particular level you are trying out.\n Combine this with the massive amounts of money thrown at the problem. Large complex GUI applications are a small niche, games are not.\n This is why people who made simulators for robots eventually switched to game engines. The market for engines meant game engines where far beyond robot simulators in quality, performance and ease of use.\n This way of utilizing a weird thing seemingly unrelated due to economics of scale is not new. E.g. Tesla was built on the idea that instead of building a car using custom car batteries, they opted for the seemingly insane idea of using 7000 laptop batteries to power their car.\n It seemed like a nonsensical solution, but it worked because the laptop marked was so huge and this had caused laptop batteries to be really good and cheap.\n This will happen with traditional GUI toolkits: They will fall behind what is happing in the hyper competitive game engine world.\n The key downside of using a Game Engine is that is renders constantly which causes a higher constant GPU and CPU usage. Although as many who read this article have pointed out to me repeatedly, Godot does in fact have a low CPU usage mode. Apparently this only renders when objects need to be re-rendered. Perhaps we can have a cake and eat it too?\n I wrote this story thinking Godot was the answer to the challenges people who make large complex GUIs have. But perhaps this is actually a solution to everbody. Godot Engine adds an overhead of 20–30 MB has to a solution as far as I know. For quite moderately size applications that may be acceptable. It may seem much relative to my day-to-day editor  TextMate which comes in at 30 MB. However compared to the  Atom editor which comes in at a hefty 500-600 MB it is a steal.\n So why should be jump to web technologies to get cross platform GUI applications? We got a tool, Godot, that runs on all major platforms which uses minimal resources and which anyone can get started using quickly.\n To be humble, reality is that web technologies are far better known, and that will keep them dominating. However I think for large complex GUI applications we have been starved for choice and web technologies simply don’t cut it. If Godot is to break into the application development market they may have to do like Tesla, begin with the high performance sports car and work your way downwards to the everyday car.\n  Seeing is believing. Not sure if you can make real applications with Godot? Check out some of these guys. We got Alfred Reinold Baudisch who was kind to share his experience with using Godot to make a Trello clone.\n  And we have Andrew Wooldridge who made this  extensive guide to making an RSS Reader in Godot.\n  There are also some rather spectacular examples, such as  Wonderdraft which is used to make fantasy world maps.\n  And I \n......", "posttime": "2020-08-04 05:54:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,godot,advanced", "title": "用Godot制作高级GUI应用程序", "title_en": "Making Advanced GUI Applications with Godot", "transed": 1, "url": "https://medium.com/swlh/what-makes-godot-engine-great-for-advance-gui-applications-b1cfb941df3b", "via": "", "real_tags": ["程序", "godot", "advanced"]}, {"category": "", "categoryclass": "", "imagename": "10ff1cec5a71abc9e216d2ffc0b0b5d5.png", "infoid": 1016030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奥克兰大学将要求学生在今年秋天冠状病毒大流行的情况下返回校园时，宿舍里的居民必须佩戴“生物按钮”。\n“BioButton”是一种可穿戴技术，可以实时监测你的重要指标，包括体温和心率。它可以持续长达90天。它应该戴在胸前，并连接到你的移动设备上。\n“为了降低校园内病毒爆发的风险，现正使用BioButton筛查工具。它为健康筛查提供了更多信息。”该按钮将与日常健康评估结合使用，以确定您是否能够参加校园活动。个人数据将对佩戴者保密，不会与其他人共享。“该大学在其网站上声明。\n一群奥克兰大学的学生发起了一份请愿书，反对这项政策，理由是侵犯了隐私和数据。\n“很大一部分学生认为这侵犯了他们的隐私，一些学生表示，他们拒绝这一想法是出于宗教原因。”此外，这一新想法(显然是一个很大的调整)没有被提及，而是被进一步放到网站上，供个人偶然发现。“请愿书的作者写道。\n截至周一上午，请愿书已有2000多个电子签名。该大学还建议教职员工和经常在校园的学生佩戴BioButton。", "note_en": "Oakland University will require residents to wear a “BioButton” in residence halls when students return to campus this fall amid the coronavirus pandemic.\n The “BioButton” is wearable technology that monitors your vitals, including temperature and heart-rate, in real time. It can last for up to 90 days. It’s meant to be worn on the chest and connects to your mobile device.\n “In order to lower the risk of virus outbreaks on campus a BioButton screening tool is being used. It provides additional information for health screening. The button will be used in conjunction with the daily health assessment to determine if you are able to participate in campus activities. The individual data will remain private to the wearer and is not shared with others,”  the university states on its website.\n A group of Oakland University students have  launched a petition against the policy, citing an intrusion of privacy and data.\n “A large portion of students feel that this in violation of their privacy and some students have stated that their rejections of this idea come from a religious basis. Moreover, the new idea (evidently a large adjustment) was not mentioned but instead put further into the website for individuals to stumble across,”  the petition’s author writes.\n As of Monday morning, the petition had more than 2,000 e-signatures. The university is also advising the BioButton to be worn by faculty, staff, and students who will be on campus regularly.", "posttime": "2020-08-04 05:54:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,require,学生", "title": "大学要求居民佩戴“BioButton”，以跟踪健康状况", "title_en": "University to require residents wear ‘BioButton, to track health", "transed": 1, "url": "https://www.clickondetroit.com/news/2020/08/03/oakland-university-to-require-residents-to-wear-biobutton-to-track-health-students-launch-petition/", "via": "", "real_tags": ["大学", "require", "学生"]}, {"category": "", "categoryclass": "", "imagename": "d9eb0f129db3c376ff6f0c4aa49a7265.jpg", "infoid": 1016028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，安全电子邮件服务ProtonMail背后的开发者站出来抨击苹果涉嫌利用其App Store控制iOS用户访问并将竞争对手拒之门外的方式。该公司几乎是在恳求监管机构采取更强有力的行动。\nProtonMail创始人兼首席执行官安迪·严(Andy Yen)在公司博客中写道，苹果已经成为垄断企业，用剥削费用粉碎潜在的竞争对手，并代表独裁者进行审查，ProtonMail创始人兼首席执行官安迪·严(Andy Yen)在公司的一篇博客文章中写道。我们之所以知道这一点，是因为我们多年来一直默默容忍这种剥削。\n甄子丹称，苹果正在利用其市场力量将我们所有的开发者扣为人质。他将苹果通过App Store从任何销售额中抽取的30%的提成称为税金。他补充说，传统的零售空间类比在软件方面是站不住脚的：\n苹果试图通过辩称App Store与商场没有什么不同来证明这些费用是合理的，在商场里，寻求提供产品的公司必须向商场的所有者(在这种情况下，是苹果)支付租金。这一论点很容易忽略了这样一个事实，即当涉及到iOS时，只有一个购物中心，没有竞争的购物中心可供租用空间的可能性。苹果拥有商场和租赁空间并不违法，苹果拥有唯一的商场也不违法。非法的是，利用它拥有唯一一家定价过高的购物中心的事实，这损害了竞争对手。\n日元认为，这实际上与保护行骗没有什么区别。如果开发商想要继续经营下去，这是一项必须支付的费用。这是一项最终损害消费者利益的费用，因为这些费用是间接转嫁给用户的，要么是通过更高的价格，要么是通过市场上更少的竞争产品。\nProtonMail并不是第一个认为苹果30%的减税相当于不公平地削减了其他公司的收入，并使其更难与苹果的第一方应用程序竞争的人。严写道，这种行为不仅是非法的，而且利用这一权力来压制数字自由是完全不道德的，早该有人指责苹果公司的这种行为。\n当涉及到破坏信任、反竞争行为和潜在的滥用市场力量的问题时，亚马逊、Facebook和谷歌往往更容易陷入困境。但苹果也面临着一大堆调查-不仅在美国，特别是在欧洲。\nSpotify于2019年3月向欧洲监管机构提交了针对苹果的反垄断申诉。苹果公司创始人兼首席执行官丹尼尔·埃克(Daniel Ek)当时表示，苹果在App Store中引入了一些规则，故意限制选择，扼杀创新，损害用户体验。电子阅读器服务Kobo在今年6月加入了投诉。\n欧盟委员会(European Commission)的初步调查发现，人们担心苹果的限制可能会扭曲苹果设备上对音乐流媒体服务的竞争。上个月，欧盟正式对苹果的App Store及其Apple Pay支付系统展开更深入的调查。\n电子邮件管理服务公司嘿的创始人大卫·海内迈尔·汉森(David Heinemeier Hansson)上个月公开抱怨称，苹果将自己的服务凌驾于他的第三方应用程序之上。汉森在接受“礼仪”采访时表示：你听了其中一些应用程序开发者的话，他们听起来就像人质一样。他们听起来像是在读一份事先准备好的声明，因为否则苹果可能会损害他们的业务。这是真的！&#34；\n即时通讯应用Telegram上周也加入了这场争斗，当时它也向欧盟提交了一份申诉，指控苹果滥用其垄断权来扼杀创新。", "note_en": "The developer behind secure email service ProtonMail today came out swinging against the way Apple allegedly uses its App Store to control access to iOS users and cut out competitors. The company is all but begging regulators to take stronger action.\n &#34;Apple has become a monopoly, crushing potential competitors with exploitative fees and conducting censorship on behalf of dictators,&#34; ProtonMail founder and CEO Andy Yen wrote in a  company blog post. &#34;We know this because we have quietly tolerated this exploitation for years.&#34;\n Apple, Yen claimed, is using its market power &#34;to hold all of us [developers] hostage.&#34; Referring to the 30 percent cut Apple takes of any sales through its App Store as a &#34;tax,&#34; he added that traditional analogies to retail space break down when it comes to software:\n Apple attempts to justify these fees by arguing that the App Store is no different from a mall, where companies seeking to offer their products must pay rent to the owner of the mall (in this case, Apple). This argument conveniently ignores the fact that there is just a single mall when it comes to iOS and no possibility of a competing mall to rent space from. It is not illegal for Apple to own a mall and rent space, nor is it illegal for Apple to own the only mall. What is illegal, is exploiting the fact that it owns the only mall to charge excessively high pricing which harms competitors.\n &#34;This is virtually indistinguishable from a protection racket,&#34; Yen argued. &#34;It is a fee that developers must pay if they want to stay in business. And it is a fee which ultimately harms consumers because these fees are indirectly passed on to users, either through higher prices or through fewer competing products in the marketplace.&#34;\n ProtonMail is not the first to argue that Apple&#39;s 30 percent cut amounts to a tax that cuts unfairly into other firms&#39; revenue and makes it harder to compete against Apple&#39;s first-party apps. This behavior is not only illegal, Yen wrote, but &#34;leveraging this power to suppress digital freedom is simply unethical, and it is long overdue that somebody called out Apple for this behavior.&#34;\n  Amazon, Facebook, and Google tend to be in the  hot seat more often when it comes to matters of trustbusting, anticompetitive behavior, and potential abuse of market power. But Apple, too, is facing a bevy of probes—not only in the United States, but especially in Europe.\n Spotify  filed an antitrust complaint against Apple with European regulators in March 2019. &#34;Apple has introduced rules to the App Store that purposely limit choice and stifle innovation at the expense of the user experience,&#34; company founder and CEO Daniel Ek said at the time. Ereader service Kobo joined the complaint in June of this year.\n The European Commission&#39;s preliminary investigation found &#34;concerns that Apple&#39;s restrictions may distort competition for music streaming services on Apple&#39;s devices,&#34; and last month the EU  formally opened a deeper probe into Apple&#39;s App Store and its Apple Pay payment system.\n David Heinemeier Hansson, founder of email-management service Hey,  publicly complained last month that Apple privileged its own services over third-party apps such as his. &#34;You listen to some of these app developers, and they sound like hostages,&#34; Hansson told  Protocol. &#34;They sound like they&#39;re reading a prepared statement, because otherwise Apple could hurt their business. Which is true!&#34;\n Messaging app Telegram also joined the fray last week, when it, too  filed a complaint with the EU alleging Apple was abusing its &#34;monopolistic power&#34; to stifle innovation.", "posttime": "2020-08-04 05:30:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,创始人,founder", "title": "ProtonMail创始人：苹果利用垄断“挟持我们所有人”", "title_en": "ProtonMail founder: Apple uses monopoly to “hold all of us hostage”", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/08/protonmail-founder-apple-uses-monopoly-to-hold-all-of-us-hostage/", "via": "", "real_tags": ["苹果", "apple", "创始人", "founder"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约，纽约州，2020年8月3日(环球通讯社)--BankMobile是Customers Bank的一个部门，也是美国最大和增长最快的移动优先银行之一，今天宣布执行与谷歌的一项协议，引入数字银行账户，并将向其客户开放。\nBankMobile联合创始人兼首席执行官Luvleen Sidhu表示：“我们很高兴能与谷歌合作，为我们的客户提供增强的数字银行账户。”“今天，通过我们与全国约800个校区的关系，BankMobile大约为每三个大学生中就有一个提供服务。通过与谷歌合作，我们可以为全美数百万大学生提供更好的银行体验，帮助他们管理、储蓄和增值。“。\n注册这些账户的客户将能够通过Google Pay管理他们的账户，并可以访问财务洞察和预算工具，以保持对其交易的控制。\n数字支票账户将建立在BankMobile现有的银行基础设施之上，这些账户将由FDIC提供保险。谷歌将提供前端、直观的用户体验。这使得BankMobile和Google都能将各自的优势发挥到桌面上。谷歌在建立卓越的用户体验和高度规模化和安全的基础设施方面的专业知识是对BankMobile的金融和监管专业知识及其在高等教育领域的独特客户获取渠道的极大补充。\n“现在很多大学生都在努力管理自己的钱财，因为他们在兼职和上学。通过我们与谷歌的合作，我们相信我们可以提供适当的金融工具，帮助他们成功渡过这些困难的境地，“Sidhu说。\n谷歌支付生态系统副总裁菲利克斯·林(Felix Lin)表示：“谷歌很高兴能与BankMobile合作，实现对所有人都公平的数字体验，并满足新一代客户不断变化的需求。”“我们相信，我们可以利用我们的技术专长，让用户、银行和整个金融生态系统受益.”\nBankMobile成立于2015年1月，其使命是提供简单、负担得起、消费者友好的合规、移动优先的银行体验。BankMobile在2019年被LendIt评为“最具创新力的银行”，拥有一种极具颠覆性的、多合作伙伴的分销模式，被称为“银行即服务”(BAAS)。今天，BankMobile通过BankMobile支付向高校提供BAAS平台，为全国近800个校园的500多万名学生提供服务。通过这一分销渠道，BankMobile为全国每三名大学生中就有一名提供服务。\nBankMobile正在与谷歌合作的新账户将于2021年向客户开放。\nBankMobile成立于2015年，是Customers Bank的一个部门，也是美国最大、增长最快的移动优先银行平台之一，提供支票和储蓄账户、个人贷款和信用卡。被LendIT金融科技评为2019年“最具创新力银行”的BankMobile，提供了传统模式之外的另类银行体验。它专注于技术、创新、易用产品和教育，以“客户至上”为使命，创造“终身客户”。BankMobile采用了一种被称为“银行即服务”(BAAS)的颠覆性多合作伙伴分销模式，使该公司能够以比传统银行更高的数量和更低的费用获得客户。其高效的运营模式使其能够为低收入/中等收入的美国人提供低成本的银行服务，这些美国人已经被“传统”银行的高收费模式甩在了后面。今天，BankMobile向学院和大学提供BAAS平台，目前在近800个校园为200多万账户持有人提供服务(覆盖美国三分之一的学生)。按支票账户衡量，它是全国最大的15家银行之一。BankMobile是Customers Bank的数字银行部门，Customers Bank是一家受美联储监管、由FDIC保险的商业银行。欲获知更多信息，请访问：www.bankmobile.com。\nCustomers Bank是Customers Bancorp，Inc.的子公司。是一家银行控股公司，是一家提供全方位服务的超级社区银行，截至2020年6月30日的资产约为179亿美元。Customers Bank是联邦储备系统的成员，存款由联邦存款保险公司担保，是一家机会平等的贷款机构，为中小企业、专业人士、个人和家庭提供一系列银行和贷款服务。客户银行的服务和产品在法律允许的任何地方都可以通过移动优先应用程序、在线门户网站以及办公室和分支机构网络获得。Customers Bancorp，Inc.的有投票权普通股在纽约证券交易所挂牌交易，代码为CUBI，更多信息可在该公司网站www.customersbank.com上找到。", "note_en": "New York, NY, Aug. 03, 2020 (GLOBE NEWSWIRE) --  BankMobile, a division of Customers Bank, and among America’s largest and fastest-growing mobile-first banks, today announced an execution of an agreement with Google to introduce digital bank accounts, which will be available to its customers.\n  “We are thrilled to be collaborating with Google to offer our customers enhanced digital bank accounts,” stated Luvleen Sidhu, Co-Founder and CEO, BankMobile. “Today, BankMobile serves approximately one in every three college students through our relationship with ~800 campuses across the country. By collaborating with Google, we can provide millions of college students across America with an even better banking experience to help them manage, save and grow their money.”\n  Customers who sign up for these accounts will be able to manage their accounts through Google Pay and have access to financial insights and budgeting tools to stay in control over their transactions.\n  The digital checking account will be built on top of BankMobile’s existing banking infrastructure and the accounts will be FDIC-insured. Google will provide the front-end, intuitive user experience. This enables both BankMobile and Google to bring the best of their respective strengths to the table. Google’s expertise in building great user experiences and highly-scaled and secure infrastructure is a great complement to BankMobile’s financial and regulatory expertise and its unique customer acquisition funnel in the higher education segment.\n  “Many college students today are struggling to manage their money as they work part-time and attend school. Through our collaboration with Google, we believe we can provide the appropriate financial tools to help them navigate through these difficult situations successfully,” said Sidhu.\n  “Google is excited to partner with BankMobile in enabling a digital experience that is equitable for all and meets the evolving needs of a new generation of customers,” said Felix Lin, vice president of Payments Ecosystems at Google. “We believe that we can use our technology expertise to benefit users, banks and the entire financial ecosystem.”\n  Launched in January 2015, BankMobile’s mission is to provide a compliant, mobile-first banking experience that is simple, affordable, and consumer-friendly. Named “Most Innovative Bank” by LendIt in 2019, BankMobile has a disruptive, multi-partner distribution model, known as “ Banking-as-a-Service” (BaaS). Today, BankMobile provides its BaaS platform to colleges and universities through  BankMobile Disbursements, which serves more than five million students on nearly 800 campuses nationwide. Through this distribution channel, BankMobile serves one in every three college students in the country.\n  The new accounts that BankMobile is working on with Google will be available to customers in 2021.\n          Established in 2015, BankMobile is a division of Customers Bank and among the largest and fastest-growing mobile-first banking platforms in the U.S., offering checking and savings accounts, personal loans and credit cards. BankMobile, named the “Most Innovative Bank” by LendIt Fintech in 2019, provides an alternative banking experience to the traditional model. It is focused on technology, innovation, easy-to-use products and education with the mission of being “customer-obsessed” and creating “customers for life.” BankMobile employs a disruptive, multi-partner distribution model, known as “Banking-as-a-Service” (Baas), that enables the company to acquire customers at higher volumes and substantially lower expense than traditional banks. Its efficient operating model enables it to provide low-cost banking services to low/middle-income Americans who have been left behind by the high-fee model of “traditional” banks. Today, BankMobile provides its BaaS platform to colleges and universities and currently serves over two million account-holders at nearly 800 campuses (covering one out of every three students in the U.S.). It is one of the Top 15 largest banks in the country, as measured by checking accounts. BankMobile is operating as the digital banking division of Customers Bank, which is a Federal Reserve regulated and FDIC-insured commercial bank. For more information, please visit:  www.bankmobile.com.\n    Customers Bank, a subsidiary of Customers Bancorp, Inc. a bank holding company, is a full-service super-community bank with assets of approximately $17.9 billion at June 30, 2020. A member of the Federal Reserve System with deposits insured by the Federal Deposit Insurance Corporation, Customers Bank is an equal opportunity lender that provides a range of banking and lending services to small and medium-sized businesses, professionals, individuals and families.  Services and products are available wherever permitted by law through mobile-first apps, online portals, and a network of offices and branches. Customers Bancorp, Inc.’s voting common shares are listed on the New York Stock Exchange under the symbol CUBI.  Additional information can be found on the company’s website,  www.customersbank.com.", "posttime": "2020-08-04 05:28:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,bankmobile,partner,银行", "title": "谷歌将与BankMobile合作提供数字银行账户", "title_en": "Google to partner with BankMobile to offer digital bank accounts", "transed": 1, "url": "https://www.globenewswire.com/news-release/2020/08/03/2071746/0/en/BankMobile-Announces-a-Collaboration-with-Google-to-Offer-Digital-Bank-Accounts.html", "via": "", "real_tags": ["谷歌", "google", "partner", "银行"]}, {"category": "", "categoryclass": "", "imagename": "2f5e2a9402e5e347779e2f5cc4abe8bf.png", "infoid": 1016025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你们公司有让每个人都能看到彼此日历的文化吗？人们经常在没有询问的情况下，在有空缺的时候安排会议吗？\n如果是这样的话，你的日程表就是黑名单。唯一不能让人偷走的时间是已经说好的时间。这是个问题。当前没有预订的时间段不应该是免费的房地产。那是我的时间！你不能不问就拿走。\n相反，我们的日历应该是白名单。我们应该说“如果你想和我说话，这是你可以的时候”，而不是“这是你不能的时候”。我们不应该捍卫我们的时间，就像它是黄金，我们的同事是海盗一样。我们应该假设这是我们的事，我们可以按照自己认为合适的方式消费。\n有些人阻止休假，试图保护他们的日历。他们在日历上创建了很大的“GTD”区块，并希望没有人在上面预订会议。我甚至听说过有人编造假的或模糊的会议标题，希望其他人会认为那是一个真实的会议。这是一个糟糕的变通办法，而且还不够。\n解决办法应该是办公时间。我们应该可以说“我周二和周四下午2点到5点有空开会，如果你想和我聊聊，那你就可以了。”在大多数公司，这样做会让你很烦人。这些公司不尊重深度工作。\n安排会议应该会有点痛苦。你应该真的很想要它。你应该被迫质疑自己。这真的值得我不厌其烦地想出如何安排这次会议吗？或者会不会是一场异步讨论呢？办公时间和日历作为白名单有这个额外的好处。", "note_en": "Does your company have a culture of letting everyone see each other’s calendars? Do people often schedule meetings whenever there are openings, without asking?\n If so, your calendar is a blacklist. The only time that isn’t available for someone to steal is time that’s already spoken for. This is a problem. A time slot that isn’t currently booked shouldn’t be free real estate. That’s my TIME! You can’t just take it without asking.\n Instead, our calendars should be whitelists. We should say “if you want to talk to me, this is when you can” instead of “this is when you CAN’T.” We shouldn’t have to defend our time like it’s gold and our coworkers are pirates. We should just assume that it’s ours to spend how we see fit.\n Some people block time off to try to protect their calendars. They create big “GTD” blocks on their calendar and hope that nobody books meetings on top of them. I’ve even heard of people creating fake or vague meeting titles in hopes that others will assume there’s a real meeting at that time. This is a crappy workaround, and it isn’t enough.\n The solution should be office hours. We should be able to say say “I’m free for meetings from 2-5pm on Tuesdays and Thursdays, and if you want to talk to me then that’s when you can.” In most companies, doing that would make you an annoyance. Those companies don’t respect Deep Work.\n Scheduling meetings should be a little bit painful. You should have to really want it. You should be forced to question yourself.  Is this actually worth me going to the trouble of figuring out how to schedule this meeting? Or could it instead be an asynchronous discussion? Office hours and calendars-as-whitelists have this added benefit.", "posttime": "2020-08-04 05:03:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,whitelist", "title": "您的日历应该是白名单，而不是黑名单", "title_en": "Your calendar should be a whitelist, not a blacklist", "transed": 1, "url": "https://critter.blog/2020/08/03/your-calendar-should-be-a-whitelist-not-a-blacklist/", "via": "", "real_tags": ["应该", "whitelist"]}, {"category": "", "categoryclass": "", "imagename": "440a36cc72abbf5e76eb0517bc271aee.jpeg", "infoid": 1016024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当计算机可以比我们更好地记录我们的问题时，这意味着什么？\n人们一直在谈论GPT-3，但更多的是作为一种新奇的东西，而不是一种工具(不知道GPT-3是什么？请看这里)。一些聪明人甚至想出了如何让它从描述生成代码。然而，我认为最好的用例在技术之外。\n我相信GPT-3有可能改变我们的写作方式。但我不能只告诉人们，大多数人都不会相信。人们在开始认真对待这些事情之前，至少需要一些证据。\n在过去的两周里，我一直在推广GPT-3写的一个博客。\n我会写下标题和简介，添加一张照片，然后让GPT-3来做剩下的事情。这个博客已经有超过26000名访问者，我们现在有大约60名忠实的订阅者…。\n人们谈论GPT-3经常写得语无伦次、语无伦次。但是，这并不能阻止人们阅读它…。而且很喜欢。\n事实上，第一个帖子就登上了黑客新闻的头号位置。\n曼努埃尔·阿拉奥斯(Manuel Araoz)在他的文章中做了类似的事情，但他的方法不同。当他透露这篇课文是由GPT-3写的时，人们都很惊讶。正是他的揭露使这篇文章变得有趣，否则，它只是一篇拙劣的文章(GPT-3写的，其余的都很好)。\n在这篇文章中，人们不仅没有意识到他们正在阅读生成的文本，而且他们非常喜欢这篇文章，以至于他们把它投票给了其他几十篇人写的文章。\n我必须承认，我早些时候告诉你只有一个人注意到的时候实际上我撒谎了。只有一个人找到我，问这些文章是不是GPT-3写的。然而，在黑客新闻上也有一些评论者也猜到了这一点。有趣的是，没有人注意到，因为社区否决了这些评论。\n考虑到它真的是由GPT-3写的，我感觉有点不好，但它仍然很有趣。\n无论如何，我认为这足以证明这个概念是可行的。那么，这意味着什么呢？\nGPT-3最大的好处是效率。我需要写的只是一个好的标题和引言。如果我愿意，我可以在一小时内写出五本，然后在一天内全部出版。\n换句话说，一个拥有GPT-3的优秀作家现在可以做以前需要一组内容创建者做的工作。\n如果你读了我做的一些内容，你可能不会相信它的质量。的确，有一些不合逻辑的痕迹，很难抓住主题，有重复的问题，等等。为了这个实验的目的，我选择了尽可能不经过编辑的内容[1]。\n但是，通过非常小的编辑，您可以使这些内容变得像样。删掉无关紧要的东西，写一个结论，然后砰-人们就没有机会分辨出其中的区别了。\n那么，这对未来的在线内容意味着什么呢？嗯，我不完全确定。\n对于基于事实的内容制作者来说，您(可能)是安全的。我选择自助风格的主题来写博客是有原因的。GPT-3擅长创造动人心弦的优美语言，而不是硬性的逻辑思维和理性思考。\n然而，我认为这里真正的价值并不在于博客帖子，那只是为了证明这个概念。它真正的价值在于它是一种书写工具。为作家发明的GPT-3就像为农民发明的麦考密克收割机。它提高了效率，从而降低了劳动力成本，就像任何其他技术创新一样。不同的是，这是技术第一次有可能影响创意部门的工作。\n对于大型媒体公司来说，这可能意味着巨额节省。同样，对于基于事实的报道，您不能只让GPT-3为您编写内容。然而，作为一种辅助工具，我认为它肯定可以加快这一过程，为他们节省相当多的现金。让我们做一些餐巾纸的算术，好吗？\nBuzzFeed Inc.。根据GlassDoor的数据，该公司拥有1700名员工，一名作家的平均基本工资为42000美元。我不知道这些员工中有多少人是作家(如果你是，给我发消息)，但我猜有几百人。就我们的目的而言，假设400名作家。作为另一个简化，让我们假设年收入与生产的文章数量挂钩(即，只要生产的文章数量保持不变，年收入也应该保持不变)。这么说吧，对于这个网站上的那种内容，GPT-3只能将效率提高50%(请记住，对于自助风格的写作，加速比对我来说超过了5倍，但我也从未在媒体工作过，所以我是保守的)。更保守的说法是，Buzzfeed的作者中只有一半能从这些效率提升中受益。\n这将意味着拥有GPT-3的大约133名作家可以产生与200名没有GPT-3的作家相同数量的内容。如果我们从劳动力成本的角度来看，用133人取代200人的团队，GPT-3支持的团队每年将为Buzzfeed节省约300万美元。\n老实说，除非GPT-3最终是内容制作的彻底失败，否则我认为这个数字可能要高得多。\n然而，我认为Buzzfeed不会开始让他们的作者使用GPT-3。我认为他们的员工会对此产生太大的抵触情绪。他们可能会对电脑比他们写得更好的说法感到恼火，或者它会阻碍他们的风格。但是，考虑到这些公司在COVID期间的苦苦挣扎，谁知道他们会做什么。\n这为一种新型的媒体公司留下了空间。一辆又快又瘦的车。写作团队规模很小，但却是让GPT-3屈从于自己意愿的专家。这是一辆2006年的雪佛兰郊区车对一辆2020年的特斯拉。你不能把你的郊区改装成特斯拉，它们是完全不同的车型。\n我做这个实验很开心。有些人可能会因为我欺骗别人而生我的气，但不管怎样。将其以私人测试版形式发布的全部意义在于，这样社区就可以向OpenAI展示他们应该鼓励或关注的新用例。\n哦，还有，我实际上没有GPT-3的权限。我必须找到一个博士生，他好心帮助我，但又不至于直接给我API密钥。所以我不得不通过Messages…向他发送提示并手动调整参数。\n山姆·奥特曼，如果你正在读这篇文章，我能不能访问GPT-3，这样我就可以让这位可怜的博士生清静一下？\n[1]有时，会有一些必须改变的小改变，否则就会让人大白于天下。例如，它曾将鲍勃·迪伦(Bob Dylan)的一句话归功于爱默生。也有一些简单的语法错误。", "note_en": "What does it mean when a computer can write about our problems better than we can?\n People have been talking a lot about GPT-3, but more as a novelty than a tool (don’t know what GPT-3 is? look  here). Some clever  people have even figured out how to get it to generate code from descriptions. Yet, I think that the best use cases lie outside of tech.\n I believe that GPT-3 has the potential to change the way we write. But I can’t just tell that to people, most of them won’t believe it. People need at least some proof before they begin to take these things seriously.\n  Over the last two weeks, I’ve been promoting a blog written by GPT-3.\n I would write the title and introduction, add a photo, and let GPT-3 do the rest. The blog has had over 26 thousand visitors, and we now have about 60 loyal subscribers...\n  People talk about how GPT-3 often writes incoherently and irrationally. But, that doesn’t keep people from reading it… and liking it.\n In fact, the very first  post made it to the  number one spot on Hacker News.\n   Manuel Araoz had done something similar with his  article, but his approach was different. People were surprised when he revealed the text was written by GPT-3. It was his revealing that made the article interesting, otherwise, it’s just a crappy piece of writing (what GPT-3 wrote, the rest is quite good).\n In this post, not only did people not realize they were reading generated text, but they enjoyed the writing so much that they voted it above dozens of other human-written articles.\n I must confess, I actually lied earlier when I told you only one person noticed. Only one person reached out to me to ask if GPT-3 was writing the articles. However, there were a few commenters on hacker news who also guessed it. Funny enough, nobody took notice because the community  downvoted the comments.\n   I felt a little bad considering that it really was written by GPT-3, but it’s still pretty funny.\n Regardless, I think this is enough to prove that the concept works. So, what does it mean?\n  The biggest benefit of GPT-3 is efficiency. All I need to write is a good title and intro. I could write five of them in an hour and publish them all in one day if I wanted to.\n In other words, one good writer with GPT-3 can now do the same work that took a team of content creators before.\n If you read some of the content I made, you may not be convinced about its quality. Indeed, there are traces of illogic, difficulty with staying on topic, issues with repetition, etc. I chose to leave the content as unedited as possible [1] for the purposes of this experiment.\n However, with very minor editing, you could make these decent. Cut out irrelevant stuff, write a conclusion, and boom - people don&#39;t stand a chance of telling the difference.\n So, what does this mean for online content going forward? Well, I’m not entirely sure.\n For facts based content producers, you’re (probably) safe. There’s a reason I chose a self-help style theme for the blog. GPT-3 is great at creating beautiful language that touches emotion, not hard logic and rational thinking.\n However, I think the real value here is not in blog posts, that was just to prove the concept. Its true value lies as a writing tool. The invention of GPT-3 for writers is like the invention of the McCormick reaper for farmers. It increases efficiency, and thus reduces labor costs, like any other technological innovation. The difference is, this is one of the first times technology has the potential to affect jobs in the creative sector.\n For big media companies, this could mean huge savings. Again, for fact-based reporting you won’t be able to just let GPT-3 write the thing for you. As a supplementary tool, however, I think it could certainly speed up the process, saving them quite a bit of cash. Let’s do some napkin math, shall we?\n Buzzfeed Inc. has 1700 employees with an average base salary for a writer being 42k USD according to  glassdoor. I don’t know how many of those employees are writers (if you do, message me), but I’m going to guess it’s a few hundred. For our purposes, let&#39;s say 400 writers. As another simplification, let’s assume annual revenue is tied to the number of articles produced (i.e. as long as the number of articles produced stays the same, annual revenue should also remain the same). let&#39;s say for the kind of content on this website, GPT-3 can only increase efficiency by 50% (keep in mind for self-help style writing, speedup was over 5x for me, but I’ve also never worked in media, so I’m being conservative). Remaining even more conservative, let&#39;s say that only  half of the writers at Buzzfeed can benefit from these efficiency gains.\n This would mean that ~133 writers with GPT-3 can produce the same amount of content as 200 writers without it. If we viewed this in terms of labor costs, replacing the 200 person team with a 133 person, GPT-3 supported team would save Buzzfeed about  3 million dollars annually.\n Honestly, unless GPT-3 ends up being a total flop for content production, I think this number could be much higher.\n However, I don’t think Buzzfeed is going to start making their writers use GPT-3. I think their staff will be too resistant to it. They may be offended at the suggestion that a computer can write better than they can, or it cramps their style. But, given how much these companies are struggling during COVID, who knows what they’ll do.\n This leaves room for a new kind of media company. One that’s fast and lean. The writing team will be small, but experts at bending GPT-3 to their will. It’s a 2006 Chevy Suburban vs a 2020 Tesla. You can&#39;t mod your suburban into a Tesla, they’re completely different models.\n  I had a lot of fun doing this experiment. Some people will probably get mad at me for tricking people, but whatever. The whole point of releasing this in private beta is so the community can show OpenAI new use cases that they should either encourage or look out for.\n Oh also, I don’t actually have access to GPT-3. I had to find a PhD student who was kind enough to help me out, but not so kind as to give me the API keys outright. So I’ve been having to send him prompts and adjust parameters manually over messages…\n Sam Altman, if you’re reading this, can I please get access to GPT-3 so I can leave this poor PhD student alone?\n  [1] There were, on occasion, small changes that had to be changed or would have been dead giveaways. For instance, it once attributed a Bob Dylan quote to Emerson. There were also some simple grammatical errors.", "posttime": "2020-08-04 05:02:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,gpt,visitors", "title": "我的GPT-3博客在两周内获得了2.6万的访问量", "title_en": "My GPT-3 Blog Got 26 Thousand Visitors in 2 Weeks", "transed": 1, "url": "https://liamp.substack.com/p/my-gpt-3-blog-got-26-thousand-visitors", "via": "", "real_tags": ["博客", "gpt", "visitors"]}]