[{"category": "", "categoryclass": "", "imagename": "88ab38356b9d754b5eddf01d47af4b16.jpg", "infoid": 1066925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\nWarning: Can only detect less than 5000 characters\nWarning: Can only detect less than 5000 characters\n这些邪教总是存在于Saqqara。他们的根源伸展到捕获时间，他们特别在被抚养的文艺复兴期间茁壮成长，也许是因为他们被视为埃及的埃及人，这是一位埃及人在开罗的美国大学的埃及人 - 这是一个象征的象征国外影响是一个持久威胁的国家身份。但是，他们在希腊人下更受欢迎，以数百万只动物繁殖，可能是在附近的农场上的订购，并且经常在出生后不久牺牲。 Waziri和他的同事发现了不同品质的动物木乃伊，可能相应地定价。 X射线揭示了一些“木乃伊”根本没有猫。而且与人类骨骼的混合表明，如果牧师在专门的动物地潮中耗尽空间，他们只是征服了老式的人墓。换句话说，动物邪教成为更加重要的经济和精神力量，有助于驾驶Saqqara的最终蓬勃发展。或者作为价格所说：“Saqqara就像一个巨大的，神圣的磁铁或电池，由所有这些动物木乃伊提供动力。”\n  对于希腊人来说，这些埃及海关的一部分可能一直易于向众神提供个人辩护，通过访问销售木乃伊动物的摊位并从一系列准备的产品上选择提供的产品。奖励同样令人吸引人：当时埃及神学的承诺是一个永恒的辉煌之后的神学。相比之下，“来世的希腊想法非常沉闷，”价格说。例如，在经典的希腊文学中，死者只是阴影居住在黑暗的黑暗中。巴比伦和犹太人的传统非常独特的天堂概念;永生为神灵保留。但埃及文本覆盖了Saqqara金字塔内部的墙壁描述了国王的灵魂在死后在天空中加入太阳后升起。到2000年左右，B.C.，复活法术直接写在棺材中，使普通公民如Ta-Gemi甚至可以让田园诗般的金色田地旅行。虽然后世的细节随着时间的推移而变化，但在发布时期最理想的后期目的地是“芦苇领域”，一个农业天堂，带有不懈的收获和永恒的春天。\n      在克利奥帕特拉结束了30家学士学位之后，将PTolemaic时代带到了最后，罗马统治了埃及。鉴于希腊人融入了埃及文化，而罗马人则重塑它，巩固其法律和行政系统，及时，他们新采用的基督教信仰。在Saqqara，最后的埃及人的木乃伊到了第三世纪A.D。然而，尽管罗马的文化胜利，但有些埃及的图标生活在基督教叙事中。许多学者都注意到埃及和基督教宗教象征主义之间的相似之处，例如在女神伊斯尼斯和她儿子荷鲁斯和圣母玛利亚和她的儿子耶稣的故事中。 “基督教中的很多图标是来自古埃及的，”开罗美国大学Ikram说。\n    这并不是说这些图像必须直接拨出;相反，在古代中，这些影响在许多方向上奔跑。牛津的历史学家侨民Macculloch指出，这种来世的基督徒的想法特别是希腊信仰大量吸引了柏拉图的概念的“词汇”，即人类灵魂“可能反映了神圣的力量超越自己的神圣力量。“柏拉图，为他的部分受到毕达哥拉斯的影响，他们被认为在埃及在埃及学习了六世纪。 “当时克里斯\n...... ", "note_en": "Twenty miles south of Cairo, on the Nile&#39;s west bank, where riverfed crop fields give way to desert, the ancient site of Saqqara is marked by crumbling pyramids that emerge from the sand like dragon&#39;s teeth. Most striking is the famous Step Pyramid, built in the 27th century B.C. by Djoser, the Old Kingdom pharaoh who launched the tradition of constructing pyramids as monumental royal tombs. More than a dozen other pyramids are scattered along the five-mile strip of land, which is also dotted with the remains of temples, tombs and walkways that, together, span the entire history of ancient Egypt. But beneath the ground is far more—a vast and extraordinary netherworld of treasures.\n        One scorching day last fall, Mohammad Youssef, an archaeologist, clung to a rope inside a shaft that had been closed for more than 2,000 years. At the bottom, he shined his flashlight through a gap in the limestone wall and was greeted by a god’s gleaming eyes: a small, painted statue of the composite funerary deity Ptah-Sokar-Osiris, with a golden face and plumed crown. It was Youssef’s first glimpse of a large chamber that was guarded by a heap of figurines, carved wooden chests and piles of blackened linen. Inside, Youssef and his colleagues found signs that the people buried here had wealth and privilege: gilded masks, a finely carved falcon and a painted scarab beetle rolling the sun across the sky. Yet this was no luxurious family tomb, as might have been expected. Instead, the archaeologists were astonished to discover dozens of expensive coffins jammed together, piled to the ceiling as if in a warehouse. Beautifully painted, human-shaped boxes were stacked roughly on top of heavy limestone sarcophagi. Gilded coffins were packed into niches around the walls. The floor itself was covered in rags and bones.\n  This eerie chamber is one of several “megatombs,” as the archaeologists describe them, discovered last year at Saqqara, the sprawling necropolis that once served the nearby Egyptian capital of Memphis. The excavators overseen by Youssef uncovered hundreds of coffins, mummies and grave goods, including carved statues and mummified cats, packed into several shafts, all untouched since antiquity. The trove includes many individual works of art, from the gilded portrait mask of a sixth- or seventh-century B.C. noblewoman to a bronze figure of the god Nefertem inlaid with precious gems. The scale of discoveries—captured in the  Smithsonian Channel documentary series  “Tomb Hunters,” an advance copy of which was made available to me—has excited archaeologists. They say it opens a window into a period late in ancient Egyptian history when Saqqara was at the center of a national revival in pharaonic culture and attracted visitors from across the known world. The site is full of contradictions, entwining past and future, spirituality and economics. It was a hive of ritual and magic that arguably couldn’t seem more distant from our modern world. Yet it nurtured ideas so powerful they still shape our lives today.\n    Travelers visiting Egypt have long marveled at the vestiges of the pharaohs’ lost world—the great pyramids, ancient temples and mysterious writings carved into stone. But Egyptology, the formal study of ancient Egyptian civilization, didn’t begin in earnest until Napoleon Bonaparte invaded at the turn of the 19th century and French scholars collected detailed records of ancient sites and scoured the country for antiquities. When Jean-François Champollion deciphered hieroglyphs, in the 1820s, the history of one of humanity’s great civilizations could finally be read, and European scholars and enthusiasts flocked to see not only the pyramids at Giza but also the colossal Ramses II statues carved into the cliffs at Abu Simbel and the royal tombs in Luxor’s Valley of the Kings.\n    Apart from its eroding pyramids, Saqqara was known, by contrast, for its subterranean caverns, which locals raided for mummies to use as fertilizer and tourists ransacked for souvenirs. Looters carted off not only mummified people but also mummified animals—hawks, ibises, baboons. Saqqara didn’t attract much archaeological attention until the French Egyptologist Auguste Mariette, who became the first director of Egypt’s Antiquities Service, visited in 1850. He declared the site “a spectacle of utter devastation,” with yawning pits and dismantled brick walls where the sand was mixed with mummy wrappings and bones. But he also noticed the half-buried statue of a sphinx, and probing further he found a sphinx-lined avenue leading to a temple called the Serapeum. Beneath the temple were tunnels that held the coffins of Apis bulls, worshiped as incarnations of Ptah and Osiris.\n  Since then, excavations have revealed a history of burials and cult ceremonies spanning more than 3,000 years, from Egypt’s earliest pharaohs to its dying breaths in the Roman era. Yet Saqqara has remained overshadowed by the glamour of Luxor to the south, where in the second millennium B.C. pharaohs covered the walls of their tombs with depictions of the afterlife, and the Great Pyramids just miles to the north.\n    It certainly took a while for Mostafa Waziri, the archaeologist directing the latest project, to be converted to Saqqara’s charms. He spent most of his career excavating in Luxor, but in 2017 he was appointed director of  Egypt’s Supreme Council of Antiquities (making him, among other things, a successor to Mariette). The new job entailed a move to Cairo. Continuing to dig in southern Egypt was therefore no longer practical, he says, but on his doorstep was another great opportunity: “I realized it was less than one hour from my office to Saqqara!”\n  Working with an Egyptian team, including Youssef, the site director, Waziri chose to excavate near a mysterious temple called the Bubasteion, dedicated to the cat goddess Bastet, that had been cut into limestone cliffs near the site’s eastern boundary around 600 B.C. A group of French archaeologists had worked nearby for decades, where they found, among other discoveries, the 14th-century B.C. tomb of King Tutankhamen’s wet nurse, Maia. But Waziri targeted an area that the French team had used to pile the debris from their excavations, calculating that whatever lay beneath it had remained untouched.\n    His approach paid off. In December 2018, Waziri announced the discovery of a 4,400-year-old tomb, intact and ornately carved, that belonged to a high-ranking priest named Wahtye. The next season yielded intriguing caches of animal mummies—not just cats but a cobra, a lion cub, a mongoose and even a scarab beetle. Then, in September 2020, the team unearthed a vertical shaft dug 30 feet down into the bedrock, the first of the “megatombs.” In separate niches at the bottom were two giant coffins, and when the archaeologists cleared the surrounding debris they found dozens more. “I had to call the [antiquities] minister,” says Waziri. “He asked me, ‘How many?’” Eighteen months later, Waziri is still counting.\n    In a simple conservation lab set up at the site, Youssef and his colleagues admired the first coffin to be removed from the shaft. Sealed with black resin, it was roughly human-shaped but huge and squat—more than 7.5 feet long and 3 feet wide—with a wide, impassive face. Removing the intricately carved wooden lid revealed a glint of gold: A second coffin was nested inside, complete with gilded mask. Beautifully preserved, it showed the face of a woman with large, kohl-lined eyes. The rest of the inner coffin was intricately painted in blue, green and red, and included flower and leaf motifs and a depiction of the sky goddess, Nut, with outstretched wings. Most exciting, though, were the hieroglyphs, because they provided valuable information about the occupant: not just spells to aid her journey to the afterlife but details of her family, as well as her name: Ta-Gemi-En-Aset.\n    These details and the distinctive style of the coffin indicate that she lived during the sixth or seventh century B.C., at the start of Egypt’s Late Period, when a pharaoh named Psamtik I reunified the country after a period of instability and foreign invasions. Egypt was strong and prosperous once again, a global power alongside Babylon and Persia. Psamtik also revived the powerful city of Memphis, then home to around two million people, and nearby Saqqara to hold its dead. According to Campbell Price, curator of Egypt and Sudan at the Manchester Museum in England, the name Ta-Gemi-En-Aset means “she who was found by Isis.” The coffin inscriptions describe her mother as a singer, and include a symbol representing a sistrum, a musical rattle used in temples. Price suggests that Ta-Gemi may have belonged to the cult of Isis, and perhaps played a role in rituals and festivals in a nearby temple devoted to the goddess.\n  The second coffin retrieved from the shaft was similar to Ta-Gemi’s, and it also contained an inner coffin with a gilded mask. This time, the portrait mask showed a bearded man named Psamtik (probably in honor of one of several pharaohs of this period who shared the name). At first, the team wondered whether Ta-Gemi and Psamtik were related. The hieroglyphs revealed that their fathers had the same name: Horus. But their mothers’ names were different, and further discoveries revealed a different picture.\n    The team dug deeper, a painfully slow process that involved the help of local laborers, who scooped out the sand by hand and hauled basketsful of debris to the surface using a traditional wooden winch called a  tambora, the design of which hasn’t changed in centuries. Below Psamtik’s burial niche was a room filled with many additional coffins, covered in rubble and damaged by ancient rockfalls. The bottom of the shaft led to a second, even bigger cavern, inside of which were jammed more than a hundred coffins of different styles and sizes. There were also loose grave goods, including  ushabtis, miniature figures intended as servants in the afterlife, and hundreds of Ptah-Sokar-Osiris statuettes. There were even coffins buried in the base of the shaft itself, as if whoever put them there was running out of space. The result was a megatomb described by the research team as the largest concentration of coffins ever unearthed in Egypt.\n              Great collections of mummies and coffins have been found before, but never grouped so densely together. This was mass burial on an astonishing scale, and it shines a light on Egyptian culture at a moment of transition. In the Old Kingdom, in the third millennium B.C.—Djoser’s time—the elites appear to have favored private family spaces such as the priest Wahtye’s rock-cut tomb, which included an ornate, above-ground chapel for visitors lined with painted reliefs, inscriptions and statues of Wahtye himself. Burial shafts dug into the floor of such tombs were dedicated to particular family members. By the Late Period, some 2,000 years later, well-to-do Egyptians such as Ta-Gemi and Psamtik were packed into tight, shared spaces like cheap crates. Why did people who could clearly afford expensive coffins settle for such a crowded resting place?\n  According to Aidan Dodson, an Egyptologist at the University of Bristol, in England, they did so in part because by then the practice was simply routine. Shared tombs became popular across Egypt around 1000 B.C., driven by economic necessity as the kingdom faced a period of instability and collapse. When Psamtik I restored order in the seventh century B.C., the practice stuck. “We know that from the Late Period, that’s how burials are done,” Dodson says.\n    Campbell Price, of the  Manchester Museum, adds that the answer also has to do with Saqqara’s pyramids. The necropolis had always been a center for religious cults, from the time high-ranking Egyptians were first buried there, often in low, flat-roofed tombs called  mastabas, and probably long before. To help bring the country together after turbulent times, Psamtik encouraged a revival of traditional rituals and belief; after a long period as a backwater, Saqqara exploded again in popularity. Far more than a local cemetery, says Price, it became a pilgrimage site, “like an ancient Mecca or Lourdes,” attracting visitors not just from Egypt but from all over the eastern Mediterranean. Buildings such as the Step Pyramid were already thousands of years old at this time, and people believed their creators, such as Djoser and his architect Imhotep, were gods themselves. Cults and temples sprang up. Pilgrims would bring offerings, and they vied for burial spaces for themselves and their families near the ancient, sacred tombs. “Saqqara would have been the place to be seen dead in,” says Price. “It had this numinous, divine energy that would help you get into the afterlife.”\n    That created conditions for a thriving commercial operation entwined with the spiritual one, resulting in a kind of real estate market for the dead. “It’s a business,” says Dodson. There was probably a sliding scale of options available. Senior officials and military officers were interred in large tombs near the Old Kingdom pyramids of Unas and Userkaf, for example, while the poorest in society were probably buried “in the desert in a sheet.” But the wealthy middle classes appear to have opted for a shared shaft, perhaps with a private niche if they could afford it, or were simply piled with others on the floor. If you wanted to be close to the magical energy of Saqqara’s gods and festivals, Dodson says, “you bought yourself a space in a shaft.”\n    The supersized burials unearthed by Waziri’s archaeology team reveal how intense the desire for particular locations became—and how profitable they were. Instead of digging new tombs, the priests in charge of burials reused older shafts, expanding them and, Price and Dodson suggest, cramming in as many coffins as they could. The cliffs of the Bubasteion, overlooking the landscape and close to the main processional route, may have been one of the most sought-after spots of all.\n    Last October, the archaeologists found a new shaft beneath the ruins of the Bubasteion—the chaotic, painted chamber illuminated by Youssef’s flashlight. It was another megatomb, bursting with some of the finest coffins and mummies yet discovered, as well as grave goods including a falcon-topped wooden box (possibly a canopic chest, used to store internal organs removed during mummification) and numerous painted Ptah-Sokar-Osiris statues, one of which contained seeds of corn, a symbol of rebirth.\n    Many of the burials date later than the other finds at Saqqara, to the era of Greek rule in Egypt following the Late Period, after Ptolemy, one of Alexander the Great’s top generals, founded a new dynasty of pharaohs in 305 B.C. With the Ptolemaic pharaohs came strong Greek cultural influences, particularly at the Mediterranean capital of Alexandria, home to some of the finest scholars of the Hellenistic world, such as the mathematician Euclid and the physician-anatomist Herophilus. Hundreds of thousands of migrants from across the Greek world settled elsewhere in Egypt, and many were awarded plots of land. Public life was Greek-run, but in private life, including religious worship, there was considerable freedom, and many of the new arrivals appear to have adopted Egyptian beliefs and customs, including mummification. As time went on, says Dodson, “more people who self-identified as Greeks were being buried according to Egyptian customs.” Saqqara was as busy as ever, and the new discoveries suggest the priests were still squeezing as many bodies as possible into the shafts.\n        In a nearby shaft, the team unearthed cat mummies along with human remains. Previous excavations had discovered a huge cat necropolis at the Bubasteion, where the animals, sacred to the feline goddess Bastet, were embalmed and left as offerings. It was one of many local animal cults. Just north of the Bubasteion is the Anubieion, a temple complex dedicated to the jackal-headed god of death, Anubis, where mazelike tunnels are estimated to have held millions of mummified dogs. Beyond that are catacombs once filled with mummified ibises, hawks and baboons. To the west is the Serapeum, where Apis bulls were laid to rest.\n      These cults always existed at Saqqara. Their roots stretch back to predynastic times, and they thrived especially in the Late Period, during the renaissance inaugurated by Psamtik, perhaps because they were seen as archetypally Egyptian, says Salima Ikram, an Egyptologist based at the  American University in Cairo—a symbol of national identity when foreign influence was an ever-present threat. But they became even more popular under the Greeks, with millions of animals bred to order, presumably on nearby farms, and often sacrificed shortly after birth. Waziri and his colleagues found animal mummies of varying qualities, which were probably priced accordingly. X-rays reveal that some “mummies” have no cat remains inside at all. And the mix with human bones suggests that if priests ran out of space in the dedicated animal catacombs, they simply commandeered older human tombs. The animal cults, in other words, became an ever more significant economic and spiritual force, helping to drive Saqqara’s final flourish. Or as Price puts it: “Saqqara was like an enormous, divine magnet or battery, powered by all these animal mummies.”\n  To the Greeks, part of the appeal of such Egyptian customs may have been the ease of making a personal plea to the gods, by visiting a stall selling mummified animals and choosing from a range of prepared products on offer. And the reward would likewise have been appealing: the promise, unique to Egyptian theology at that time, of an eternal afterlife of splendor. By contrast, “Greek ideas for the afterlife were pretty dull,” says Price. In classic Greek literature, for example, the dead were mere shadows inhabiting a dark underworld. The Babylonian and Jewish traditions had very exclusive notions of heaven; eternal life was reserved for the gods. But Egyptian texts covering the walls inside the Saqqara pyramids describe the king’s soul rising up after death to join the sun in the sky. By around 2000 B.C., resurrection spells were written onto coffins directly, enabling even ordinary citizens such as Ta-Gemi to make the journey to idyllic, golden fields. Although the details of the afterlife changed over time, the most desirable postmortem destination during the Ptolemaic period was the “Field of Reeds,” an agricultural paradise with unfailing harvests and eternal spring.\n      After Cleopatra ended her life in 30 B.C., bringing the Ptolemaic era to an end, Rome ruled Egypt. Whereas the Greeks had integrated into Egyptian culture, the Romans remade it, imposing their laws and administrative systems and, in time, their newly adopted Christian faith. At Saqqara, the last Egyptian mummies date to the third century A.D. Despite the cultural triumph of Rome, however, some Egyptian iconography lives on in Christian narratives. Many scholars have noted similarities between Egyptian and Christian religious symbolism, for example in stories of the goddess Isis and her son Horus and the Virgin Mary and her son Jesus. “A lot of the iconography in Christianity is derived from ancient Egypt,” says Ikram, of the American University in Cairo.\n    Which is not to say that these images were necessarily appropriated directly; rather, in antiquity these influences ran in many directions. The historian Diarmaid MacCulloch, of Oxford, notes that Christian ideas of the afterlife in particular drew heavily on Greek belief, which by then had developed a “vocabulary” for concepts such as Plato’s notion that the human soul “might reflect a divine force beyond itself.” Plato, for his part, was influenced by Pythagoras, who is thought to have studied in Egypt in the sixth century B.C. “By the time Chris\n......", "posttime": "2021-06-20 02:47:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "saqqara,tombs,埃及", "title": "在Saqqara的坟墓里面 ", "title_en": "Inside The Tombs of Saqqara", "transed": 1, "url": "https://www.smithsonianmag.com/history/inside-tombs-saqqara-180977932/", "via": "", "real_tags": ["saqqara", "tombs", "埃及"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与它们一样，终止终止字符串对于C至关重要，并且在所有琐碎的程序中都必须与它们一起工作。虽然C型字符串是使用语言的基本部分，但操作它们是安全错误和性能丢失的共同来源。其中一个最常见的操作是将字符串从一个缓冲区复制到另一个，并且有各种字符串函数声称在C.轶事中执行此操作，但是，对他们实际做的事情有很大的困惑，而且许多人渴望具有以下属性的字符串复制功能：\n 该函数应接受一个返回的源字符串，目标缓冲区和表示目标缓冲区大小的整数。\n  返回后，函数应确保目的地缓冲区在可能时（具体地，当目的地缓冲器具有非零大小时）以避免未经未勿绒的字符串的问题，以确保目标缓冲区指向包含源极字符串的前缀。 （虽然字符串截断有自己的问题，但通常是一个相当合理的回力。）\n  该函数应指示它从源复制的字符数量，以及指示是否发生了溢出。 （如果需要，这允许处理溢出。）\n  该函数应该是有效的，它不应该读取或写入它不必的内存。这些部分携手合作：函数应该在单个通行证中运行，而不是将目标缓冲区写入NUL字节IT位置，或者从源字符串中读取字符，一旦确定它已填充目标缓冲区。理想情况下，实现将是矢量图（放宽一些先前的约束，以便在平台对齐保证中）。\n  该功能应该是标准化的，因此可以跨系统使用它。符合ISO C或POSIX.1通常是最理想的。\n 也就是说，通常需要的是下面的功能，我们将调用strxcpy： \nchar * strxcpy（char *限制dst，const char *限制src，size_t len）{if（！len）{return null; } whiled（ -  len＆amp;＆amp;（* dst ++ = * src ++））;如果（！len）{* dst ++ =＆＃39; \\ 0＆＃39; ;返回* src？ null：dst; }否则{返回dst; }}\n 除了标准化之外，此函数将从SRC到DST和CUP副本复制STRLEN（SRC）或LEN  -  1字节的较小函数。在SRC在DST中配合的情况下，它将返回一个指针，它放置了NUL字节;否则，它返回null以指示截断。虽然目前的编译器似乎在其控制流程时遇到困难，但它也应该相当直接向矢量化，因为核心环路有点类似于Strncpy和Strlen的组合。\n 通过指导回顾，让我们来看看各种复制例程，看看它们是否可以帮助我们。\n 要远离通常的问题，我们将假设我们必须使用C，并且我们将避免使用作为第三方库可用的各种长度前缀或聚合字符串结构。除了使用不同的语言时可以解决此处提到的语言中的许多问题;它并不总是可取的甚至可能利用它们。除了使用第三方库的通常缺点外，替换空终止字符串通常会导致添加句法开销和不兼容性，这些代码旨在与它们一起使用。\n   标准strcpy函数，将字符从src副本复制到dst，最多，包括第一个NUL字节。如果DST小于或别名SRC，则程序的行为是未定义的。 DST被归还。\n Strcpy肯定会满足要求2和4的部分：它将始终写出空终止的字符串，它会很快。但是，它根本无法执行界限，所以我们只能使用它，如果我们知道我们的目标缓冲区小于我们的源缓冲区 - 它失败要求1.此外，它并不告诉我们它写了多少个字符，即它要求3.这是C的一部分，所以它确实满足要求5。\n  STRNCPY将从SRC到DST的LEN字符复制到LEN字符。如果SRC短于LEN，则DST为NUL-PADDED到LEN字符。 DST被归还。 \nStrncpy采用我们想要的参数，所以它满足要求1;即使在一个任意源字符串的面上，它也不会表现出未定义的行为，只要我们将其提供正确的目的地缓冲区长度。但是，如果源更长的是目标，则缓冲区不会终止，如果它缩短strncpy将继续将NUL字节写入目的地。此外，它并不指示写入源中的许多字符，但是可以通过将NUL字节写入目标缓冲区的最后一个字符并在呼叫后检查来检测溢出。这意味着它失败了2,3和4的要求，但由于它已经存在，只要它确实满足要求5。\n   Memcpy根本不关心NUL角色;它甚至不需要源是空终止的字符串。它失败了蝙蝠的前三个要求，但它是C的一部分，它肯定会达到要求4和5。\n  strcpy_s符合ISO C11，如果在包括字符串之前定义__stdc_want_lib_ext1__并且定义__stdc_lib_ext1__，则可用。\n    执行相同操作的strcpy的界限版本，除了它可以将未指定的值写入DST的剩余部分，如果src == null，dst == null，如果发生截断，则Len为零或大于RSIZE_MAX或SRC和DST重叠，如果可能，它将将NUL字节写入* DST，返回非零值，并调用约束处理程序函数。\n 在表面上，这种功能似乎有用 - 但仔细观察显示它有许多不幸的问题。最大的是，任何截断都会调用约束处理程序功能，该函数可以执行许多事情，例如中止程序。此外，它并没有告诉我们它写了多少，可以涂鸦目的地，并且是标准化的，但仅作为C11的可选扩展名。总的来说，它只满足要求1。\n  strncpy_s符合ISO C11，如果在包括字符串之前定义__stdc_want_lib_ext1__和定义__stdc_lib_ext1__，则可用。\n    strncpy的界限版本，如果src == null，dst == null，则返回非零值，如果发生截断，则Len为零或大于RSize_max，或SRC和DST重叠，在这种情况下将NUL字节写入* DST，如果可能，未指定的值为DST的剩余部分，返回非零值，并调用约束处理程序函数。否则，将从SRC复制LEN字节从SRC到DST，然后在DST [LEN-1]中添加NUL终端字节，返回零。 \n此函数具有与strcpy_s相同的约束处理程序问题，也是标准化但通常不可用。虽然当字符串适合并仅在错误时删除目的地时，它将终止，但它仍然只满足第一个要求。\n  与strncpy相同，除了返回指向写入NUL字节的指针，如果有的话;否则返回DST + LEN。\n stpncpy是对strncpy的改进，但它只修复了检测终止或溢出的问题，这是要求3.它仍然失败的要求2，因为它不一定是空终止，它失败要求4因为它将nuls写入结束目的地缓冲区。与它是POSIX的一部分，但除了要求1之外，它仍然符合要求5。\n  当与％s一起使用时，将第一个Variadic参数（一个字符串）复制到DST，或者第一LEN  -  1字节后跟NUL字节。返回第一个Variadic参数的长度。\n SnPrintf是一种奇怪的包含，但它是一个标准函数，可以帮助我们，如果我们使用“％s”作为格式字符串，则占据尺寸和终止其目的地。它符合要求1,2和5，但在3和4下降：其返回值基本上是“Sprintf将返回的是什么”，这意味着它必须至少执行相同的Strlen。这很慢，而不是我们想要的，以及一个int（不是size_t）。\n  语义上等同于Sprintf（DST，Len，＆＃34;％s＆＃34; src）保存返回值，这是一个size_t。\n strlcpy与之前的Sprintf调用相同，除了它使用正确的size_t return类型。这仍然意味着它无法满足3和4的性能要求，而不是标准，因此它不满足5。由于它执行副本并将您带有零终止的字符串，它填充了前两个要求。 \nstrscpy复制src到dst如果它适合缓冲区并返回复制的字符数，则不包括尾随NUL字节;否则它将复制第一个LEN  -  1个字符并将DST [LEN-1]设置为NUL字节，返回-e2big。\n strscpy是我们看到的第一个功能，它满足了四个功能要求：它可以追溯到尽可能大的源字符串，null终止目标缓冲区，返回复制的字符数，并且不执行过多的读取或写入。实际上，我们可以使用它来实现我们的strxcpy函数：\n char * strxcpy（char *限制dst，const char *限制src，size_t len）{ssize_t复制= strscpy（dst，src，len）;复制返回！=  -  e2big：src +复制+ 1：null; }\n 它有两个问题：第一个问题，它是它返回一个ssize_t而不是size_t，但实际上这不是一个问题。第二个是，不幸的是非标准 - 这是Linux内核为自己写的东西 - 这意味着它违反了要求5。\n  Memccpy与Memcpy相同，但如果SRC在DST中的位置后，SRC包含CHR，复制CHR和返回指针，则可能会过早停止。如果在不遇到CHR的情况下复制LEN字符，则返回NULL。\n Memccpy，当与NUL字符一起使用时，满足除了第二个之外的所有要求，但这是微不足道的修复：\n char * strxcpy（char *限制dst，const char *限制src，size_t len）{char * end = memccpy（dst，src，＆＃39; \\ 0＆＃39;，len）;如果（！结束）{dst [len-1] =＆＃39; \\ 0＆＃39; ;返回结束; } \n虽然它将在即将推出的C标准中发货，但它已经广泛使用作为流行的可选POSIX扩展。\n  对于简洁起见，存在一些其他功能 -  Stpcpy，Mempcpy，Sprintf，Sprintf_s和SnPrintf_s  - 因为它们的行为（和问题）是基于其他功能的相当自我解释。 （Mempcpy是一个GNU扩展。）\n  复制C字符串在C中是一个极其常见的操作，但是如此安全有效地进行了非琐碎。几乎所有目前可用的字符串例程，标准化与否，具有微妙的怪癖，通常阻止它们匹配达到它们的程序员的期望。这个问题是通过许多样式指南或林特将建议使用其中一个（或有时超过一个！）这些函数来替换Strcpy而不讨论其限制。最后，正如我们在上面所看到的那样，职能相当差：我们的StrxCPY，学术而不是不可能的场景，无法在其实施中使用任何一个;人们只能想象那些为其编写ad-hoc的人来说，这两个错误都可能产生错误。\n 相比之下，Memccpy的标准化是一个非常欢迎的改进，因为它促进了更安全和更高效的字符串算法的构建 - 除了Strxcpy之外，讨论的许多功能也很容易构建它。由于它变得更广泛，大多数依赖于StrxCPY的一些语义的代码，但使用其他功能的代码应该迁移到Memccpy，理想情况下，推动逐步淘汰它们将推动标准化和采用。许多广泛适用的字符串函数。\n 问题？注释？更正？随意在saagar@saagarjha.com与我联系;我喜欢听到你的想法！ ", "note_en": "Like them or not,  null-terminated strings are essential to C, and working with them is necessary in all but the most trivial programs. While C-style strings are a fundamental part of using the language, manipulating them is a common source of security bugs and lost performance. One of the most common operations is copying a string from one buffer to another, and there are a variety of string functions that claim to do this in C. Anecdotally, however, there is much confusion about what they actually do, and many people desire a string copying function with the following properties:\n The function should accept a null-terminated source string, a destination buffer, and an integer representing the size of the destination buffer.\n  Upon return the function should ensure that the destination buffer points to a null-terminated string containing a prefix of the source string when possible (specifically, when the destination buffer has a non-zero size) to avoid issues in the future with unterminated strings. (While string truncation has its own issues, it is often a fairly reasonable fallback.)\n  The function should indicate how many characters it copied from the source, as well as indicate if an overflow occurred. (This allows for dealing with the overflow, if desired.)\n  The function should be efficient, and it should not read or write memory that it does not have to. These go partially hand-in-hand: the function should run in a single pass, not write to the destination buffer past the NUL byte it places, or read characters from the source string once it’s determined that it has filled the destination buffer. Ideally, the implementation would be vectorizable (relaxing some of the previous constraints slightly to within platform alignment guarantees).\n  The function should be standardized, so that it may be used portably across systems. Conformance to  ISO C or  POSIX.1 are generally the most desirable.\n That is, what is often necessary is the function below, which we’ll call  strxcpy:\n char  * strxcpy ( char  * restrict  dst ,  const  char  * restrict  src ,  size_t  len )  {\t if  ( ! len )  {\t\t return  NULL ;\t }\t while  ( -- len  &amp;&amp;  ( * dst ++  =  * src ++ ))\t\t ;\t if  ( ! len )  {\t\t * dst ++  =  &#39;\\0&#39; ;\t\t return  * src  ?  NULL  :  dst ;\t }  else  {\t\t return  dst ;\t } }\n Other than standardization, this function will copy the smaller of  strlen(src) or  len - 1 bytes from  src to  dst and cap the copy with a NUL character. In the case where  src fits in  dst, it will return a pointer past the NUL byte it placed; otherwise it returns  NULL to indicate a truncation. While  current  compilers seem to have trouble with its control flow, it should also be fairly straightforwards to vectorize, as the core loop is somewhat similar to a combination of  strncpy and  strlen.\n With guidance to look back to, let’s take a look at a variety of copying routines and see if they can help us.\n To head off the usual concerns, we’ll assume that we must use C, and that we will be eschewing the various length-prefixed or aggregate string constructions available as third-party libraries. While using a different language can solve many of the issues in C besides the one mentioned here; it’s not always desirable or even possible to utilize them. In addition to the usual drawbacks to using third-party libraries, replacing null-terminated strings often causes added syntactical overhead and incompatibilities with other code that has been designed to work with them.\n   The standard  strcpy function, which copies characters from  src to  dst, up to and including the first NUL byte encountered. If  dst is smaller than or aliases  src, then the behavior of the program is undefined.  dst is returned.\n strcpy certainly fulfills requirement 2 and parts of 4: it will always write out a null-terminated string and it’ll do so quickly. However, it cannot perform bounds checks at all, so we can only use it if we know our destination buffer is smaller than our source buffer–it fails requirement 1. Plus it doesn’t tell us how many characters it wrote, either–that’s requirement 3. It’s been part of C forever, so it does meet requirement 5.\n  strncpy copies up to  len characters from  src to  dst. If  src is shorter than  len, then  dst is NUL-padded to  len characters.  dst is returned.\n strncpy takes the parameters we want, so it satisfies requirement 1; even in the face of an arbitrary source string it won’t exhibit undefined behavior, provided that we supply it with the correct destination buffer length. However, if the source is longer that the destination, the buffer will not be null-terminated, and if it is shorter  strncpy will continue writing NUL bytes to the destination up to its size. In addition, it doesn’t indicate how many characters from the source were written, though it is possible to detect overflow by writing a NUL byte to the last character of the destination buffer and checking it after the call. That means it fails requirements 2, 3, and 4, but as it’s been around in C for as long as  strcpy it does meet requirement 5.\n   memcpy doesn’t care about NUL characters at all; it doesn’t even require the source to be a null-terminated string. It fails the first three requirements right off the bat, but it’s part of C and it sure is fast so it meets requirements 4 and 5.\n  strcpy_s conforms to  ISO C11, and is available if  __STDC_WANT_LIB_EXT1__ is defined prior to including string.h and  __STDC_LIB_EXT1__ is defined.\n    A bounds-checked version of  strcpy that performs the same operation and returns zero except it can write unspecified values to the remainder of  dst, and if  src == NULL,  dst == NULL, if truncation would occur,  len is zero or greater than  RSIZE_MAX, or  src and  dst overlap, it will write a NUL byte to  *dst if possible, return a nonzero value, and call a constraint handler function.\n On the surface, this function  seems useful–but a closer look shows that it has a number of unfortunate issues. The largest is that any truncation will call a constraint handler function which can do many things,  like abort the program. In addition, it doesn’t tell us how much it wrote, can scribble over the destination, and is standardized but only available as an optional extension to C11. Overall, it only satisfies requirement 1.\n  strncpy_s conforms to  ISO C11, and is available if  __STDC_WANT_LIB_EXT1__ is defined prior to including string.h and  __STDC_LIB_EXT1__ is defined.\n    A bounds-checked version of  strncpy, that returns a non-zero value if  src == NULL,  dst == NULL, if truncation would occur,  len is zero or greater than  RSIZE_MAX, or  src and  dst overlap, in which case it will write the NUL byte to  *dst if possible, unspecified values to the remainder of  dst, return a nonzero value, and call a constraint handler function. Otherwise is will copy  len bytes from  src to  dst and then add a NUL terminating byte at  dst[len - 1], returning zero.\n This function has the same constraint handler issue as  strcpy_s, and is also standardized but often not available. While it will null-terminate when the string fits and only clobber the destination on an error, it still only satisfies the first requirement.\n  Identical to  strncpy, except that a pointer to the written NUL byte is returned, if any; otherwise  dst + len is returned.\n stpncpy is an improvement on  strncpy, but it only fixes the issue of detecting termination or overflow, which is requirement 3. It still fails requirement 2 because it doesn’t necessarily null-terminate and it fails requirement 4 because it writes NULs to the end of the destination buffer. Unlike  strncpy it’s part of POSIX, but it still meets requirement 5 in addition to requirement 1.\n  When used with  %s as  fmt, copies the first variadic parameter (a string) to  dst, or the first  len - 1 bytes followed by the NUL byte. Returns the length of the first variadic parameter.\n snprintf is a somewhat strange inclusion, but it’s a standard function that can help us if we use “%s” as the format string, taking a size and null-terminating its destination. It fulfills requirements 1, 2, and 5, but falls short on 3 and 4: its return value is essentially “what  sprintf would have returned”, which means it must perform an equivalent of a  strlen at the very least. This is slow, not what we want, and an  int (not a  size_t).\n  Semantically equivalent to  sprintf(dst, len, &#34;%s&#34;, src) save for the return value, which is a  size_t.\n strlcpy is identical to the  sprintf invocation from before, except it uses the correct  size_t return type. This still means it fails to satisfy the performance requirements of 3 and 4, and it’s not standard so it doesn’t satisfy 5 either. Since it does the copy and leaves you with a null-terminated string it fills the first two requirements.\n  strscpy copies  src to  dst if it fits in the buffer and return the number of characters copied excluding the trailing NUL byte; otherwise it will copy the first  len - 1 characters and set  dst[len - 1] to a NUL byte, returning  -E2BIG.\n strscpy is the first function we’ve seen that satisfies the four functional requirements: it copies the as much of the source string as possible, null terminates the destination buffer, returns the number of characters copied, and does not perform excessive reads or writes. In fact, we can implement our  strxcpy function using it:\n char  * strxcpy ( char  * restrict  dst ,  const  char  * restrict  src ,  size_t  len )  {\t ssize_t  copied  =  strscpy ( dst ,  src ,  len );\t return  copied  !=  - E2BIG  :  src  +  copied  +  1  :  NULL ; }\n It has two issues: the first, is that it returns an  ssize_t rather than a  size_t, but in practice this isn’t really a problem. The second is that it’s unfortunately non-standard–it’s something the Linux kernel wrote for itself–which means it violates requirement 5.\n  memccpy is identical to  memcpy, but may stop prematurely if  src contains  chr, copying  chr and returning pointer after its location in  dst. If  len characters are copied without encountering  chr, then  NULL is returned.\n memccpy, when used with the NUL character, satisfies all the requirements except for the second one, but this is trivial to fix:\n char  * strxcpy ( char  * restrict  dst ,  const  char  * restrict  src ,  size_t  len )  {\t char  * end  =  memccpy ( dst ,  src ,  &#39;\\0&#39; ,  len );\t if  ( ! end )  {\t\t dst [ len  -  1 ]  =  &#39;\\0&#39; ;\t }\t return  end ; }\n While it’ll ship in an upcoming C standard, it’s already widely available as a popular, optional POSIX extension.\n  There’s a couple of other functions– stpcpy,  mempcpy,  sprintf,  sprintf_s, and  snprintf_s–that have been omitted for brevity, as their behavior (and issues) are fairly self-explanatory based on the other functions. ( mempcpy is a GNU extension.)\n  Copying strings in C is an extremely common operation, but doing so safely and efficiently is non-trivial. Almost all currently available string routines, standardized or not, have subtle quirks that often prevent them from matching the expectations of the programmer who reaches for them. This issue is compounded by the fact that many style guides or linters will recommend the use of one (or sometimes more than one!) of these functions to replace  strcpy without discussing their limitations. Finally, as we saw above the functions compose quite poorly: our  strxcpy, an academic but not improbable scenario, could not use any of them in its implementation; one can only imagine that those writing an ad-hoc replacement for it may make both errors in doing so.\n In contrast, the standardization of  memccpy is a very welcome improvement, as it facilitates the construction of safer and more efficient string algorithms–in addition to  strxcpy, a number of the functions discussed are  also easy to construct with it. As it becomes more widespread, most code that relies on some of the semantics of  strxcpy but uses one of the other functions to achieve it should probably migrate to  memccpy, and ideally the push to phase out the use of them will drive the standardization and adoption of many more widely applicable string functions.\n Questions? Comments? Corrections? Feel free to reach out to me at  saagar@saagarjha.com; I&#39;d love to hear your thoughts!", "posttime": "2021-06-20 02:47:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,designing,字符串", "title": "设计一个更好的strcpy ", "title_en": "Designing a Better Strcpy", "transed": 1, "url": "https://saagarjha.com/blog/2020/04/12/designing-a-better-strcpy/", "via": "", "real_tags": ["设计", "designing", "字符串"]}, {"category": "", "categoryclass": "", "imagename": "6e598e2013f754bd1703399af43148e9.jpeg", "infoid": 1066923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "地址：通讯员地址：人口卫生科学研究所，纽卡斯尔大学，Baddiley-Clark大厦，Richardson Road，纽卡斯尔在泰恩NE2 4AX，英国。电子邮件：[电子邮件受保护]\n  此审查的预先打印未收到任何资金。此更新版本由Crowdfunding Initiative Https://www.gofundme.com/f/help-us-get-lifesaving-drug- aggreved-for-covid19资助\n    T. A. Lawrie和A. Bryant CowRote审查;他们还筛选了搜索和分类研究以包含和输入并检查了Revman中的数据并进行了分析。数据提取在T. A. Lawrie，A. Bryant和T. Dowswell之间分开。 Dowswell和A. Bryant评级了证据。 E. J. Fordham在伊维菌素机制上制备了文本，在怀孕中使用，以及老年人。 S. R. Hill编写了简短的经济评论。临床医生S. Mitchell和T. C. Tham致力于解释讨论和结论中的证据。所有作者审查并批准了稿件的最终版本。\n    这是在Creative Commons归因归因 - 非商业广告衍生物许可证4.0（CCBY-NC-ND）的条款下分发的开放式文章，在那里允许下载并分享该工作，提供它被正确引用。无论如何都不能以任何方式改变工作，而无需允许的杂志。\n   重新灌注的药物可能对SARS-COV-2病毒作用。抗病毒和抗炎性质的抗寄生虫伊维菌素现已在许多临床试验中进行了测试。\n    我们评估了伊维菌素治疗在降低死亡率，中嗜患者和化学缺口的疗效，患有患者或高风险的Covid-19感染的疗效。\n    我们搜索了2021年4月25日的书目数据库。两次审查作者为研究，提取数据提取和评估偏倚风险。进行了荟萃分析，并确定了使用级别方法评估证据的确定性，另外在试验顺序分析中进行死亡率。涉及3406名参与者的二十四项随机对照试验审查包容。 \n第15项试验的Meta分析发现，伊维菌素与无伊维菌素（平均风险比0.38,95％置信区间0.19-0.73; n = 2438; I 2 = 49％;中等确定性证据）减少了死亡风险使用相同的Dersimonian-Laird方法，在试验顺序分析中确认了该结果，该方法是未经调整的分析。这对使用BigGerstaff-Tweedie方法的试验顺序分析来说也是强大的。低确定性证据发现，伊维菌素预防性降低了Covid-19感染平均86％（95％置信区间79％-91％）。二次结果提供了不太某些证据。低确定性证据表明，伊维菌素可能没有益处“需要机械通风”，而“改善”的估计和“变质”的估计明显有利于伊维菌素使用。治疗试验中严重不良事件罕见，并且没有差异的证据被评估为低确定性。关于其他二级结果的证据非常低。\n    适度确定的证据发现使用伊维菌素可以进行Covid-19死亡的较大减少。早期在临床过程中使用伊维菌素可以减少对严重疾病的数量。表观安全性和低成本表明，Ivermectin可能对全球SARS-COV-2大流行产生重大影响。 ", "note_en": "Address for correspondence: Population Health Sciences Institute, Newcastle University, Baddiley-Clark Building, Richardson Road, Newcastle Upon Tyne NE2 4AX, United Kingdom. E-mail:    [email protected]\n  The preprint of this review received no funding. This updated version was funded by the crowdfunding initiative   https://www.gofundme.com/f/help-us-get-lifesaving-drug-approved-for-covid19\n    T. A. Lawrie and A. Bryant cowrote the review; they also sifted the search and classified studies for inclusion and entered and checked the data in RevMan and performed analyses. Data extraction was divided among T. A. Lawrie, A. Bryant, and T. Dowswell. T. Dowswell and A. Bryant graded the evidence. E. J. Fordham prepared the text on ivermectin mechanisms, use in pregnancy, and among the elderly. S. R. Hill prepared the brief economic commentary. Clinicians S. Mitchell and T. C. Tham contributed to the interpretation of the evidence in the discussion and conclusions. All authors reviewed and approved the final version of the manuscript.\n    This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND), where it is permissible to download and share the work provided it is properly cited. The work cannot be changed in any way or used commercially without permission from the journal.\n   Repurposed medicines may have a role against the  SARS-CoV-2 virus. The antiparasitic ivermectin, with antiviral and anti-inflammatory properties, has now been tested in numerous clinical trials.\n    We assessed the efficacy of ivermectin treatment in reducing mortality, in secondary outcomes, and in chemoprophylaxis, among people with, or at high risk of, COVID-19 infection.\n    We searched bibliographic databases up to April 25, 2021. Two review authors sifted for studies, extracted data, and assessed risk of bias. Meta-analyses were conducted and certainty of the evidence was assessed using the GRADE approach and additionally in trial sequential analyses for mortality. Twenty-four randomized controlled trials involving 3406 participants met review inclusion.\n    Meta-analysis of 15 trials found that ivermectin reduced risk of death compared with no ivermectin (average risk ratio 0.38, 95% confidence interval 0.19–0.73; n = 2438; I 2 = 49%; moderate-certainty evidence). This result was confirmed in a trial sequential analysis using the same DerSimonian–Laird method that underpinned the unadjusted analysis. This was also robust against a trial sequential analysis using the Biggerstaff–Tweedie method. Low-certainty evidence found that ivermectin prophylaxis reduced COVID-19 infection by an average 86% (95% confidence interval 79%–91%). Secondary outcomes provided less certain evidence. Low-certainty evidence suggested that there may be no benefit with ivermectin for “need for mechanical ventilation,” whereas effect estimates for “improvement” and “deterioration” clearly favored ivermectin use. Severe adverse events were rare among treatment trials and evidence of no difference was assessed as low certainty. Evidence on other secondary outcomes was very low certainty.\n    Moderate-certainty evidence finds that large reductions in COVID-19 deaths are possible using ivermectin. Using ivermectin early in the clinical course may reduce numbers progressing to severe disease. The apparent safety and low cost suggest that ivermectin is likely to have a significant impact on the  SARS-CoV-2 pandemic globally.", "posttime": "2021-06-20 02:47:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "菌素,prevention", "title": "伊维菌素预防和治疗Covid-19感染 ", "title_en": "Ivermectin for Prevention and Treatment of Covid-19 Infection", "transed": 1, "url": "https://journals.lww.com/americantherapeutics/Abstract/9000/Ivermectin_for_Prevention_and_Treatment_of.98040.aspx", "via": "", "real_tags": ["菌素"]}, {"category": "", "categoryclass": "", "imagename": "ea0e14e0f94d101f8228b15e8abbe0a4.jpg", "infoid": 1066922, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然有些人仍然怀疑电动革命已经开始，但另一个汽车制造商已经设定了一个日期，以便停止将新的气体和柴油车带到市场上。\n 董事会主席Markus Deesmann在与公司高管和劳工代表的会晤中表示，奥迪将停止将新的化石燃料燃烧汽车引入2026年。此外，他们的阵容仅包括2028年的“电子”品牌汽车。\n  这不是德国汽车制造商将转向电动的第一个信号。今年早些时候Deesmann表示，欧洲联盟严格的排放指南有助于推动他们结束新型内燃机（ICE）的开发。\n 奥迪最近推出了2022年奥迪Q4 E-Tron。电动交叉将有三种不同的修剪选项，提供从200英里（321km）的范围，最高可达323英里（520公里）。\n 汽车制造商计划在未来五年内推出多达20个EV模型，作为母公司大众汽车推动电气化的一部分。\n 编者注意：本文的先前版本奥迪将停止将军汽车达到2026年。相反，奥迪将在2026年将新的燃气车带到市场。这已经纠正。 ", "note_en": "While some still doubt the electric revolution has begun, another automaker has set a date to stop bringing new gas and diesel cars to market.\n In a meeting with company executives and labour representatives, board chairman Markus Duesmann said Audi would stop introducing new fossil fuel burning cars by 2026. Additionally, their lineup will only consist of “e-” branded cars by 2028.\n  This isn’t the first signal the German automaker would be shifting to electric. Earlier this year Duesmann said the European Union’s strict emission guidelines helped push them to end development of new internal combustion engines (ICE).\n Audi recently unveiled the  2022 Audi Q4 e-tron. The electric crossover will come in three different trim options, and offer ranges varying from 200 miles (321km) up to 323 miles (520km) on a full charge.\n The automaker plans to introduce as many as 20 EV models in the next five years as part of parent company  Volkswagen’s push to electrification.\n Editor‘s  note: A previous version of this article stated Audi would stop making gas cars by 2026. Instead, Audi will no longer bring new gas cars to market by 2026. This has been corrected.", "posttime": "2021-06-20 02:46:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,柴油车,tesla,汽车", "title": "奥迪将在2026年将新的天然气和柴油车停止 - 驾驶特斯拉加拿大 ", "title_en": "Audi will halt new gas and diesel cars by 2026 – Drive Tesla Canada", "transed": 1, "url": "https://driveteslacanada.ca/news/audi-stop-gas-and-diesel-cars-2026/", "via": "", "real_tags": ["特斯拉", "柴油车", "tesla", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "9628a3dffb922bdb9dace93a44260955.jpg", "infoid": 1066921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索OpenCola是一个开源可乐的品牌，在那里制作它的说明是免费提供的和可修改的。任何人都可以喝酒，任何人都可以修改和改进食谱。它于2001年由自由软件P2P公司Opencola推出，推广其公司。 [1]\n   原始版本1.0由Grad Conn，Cory Doctorow和John Henson发布于2001年1月27日。当前版本为1.1.3。虽然最初是作为解释自由和开源软件的促销工具，但饮料占据了自己的寿命，销售了150,000罐。 [2]基于多伦多的公司Opencola对饮料更好地了解，而不是它应该推广的软件。莱德布朗，公司＆＃39;高级策略师，将其成功归功于对大公司和＆＃34的广泛不信任;几乎所有东西的专有性质＆＃34; [3]\n        将浓缩物混合到规定的配方（包括所有推荐的安全预防措施）后，用（＆＃34;优选无钠＆＃34;）苏打水稀释5：1，使成品饮用;在该稀释中，上述成分组合将产生约24升的Opencola。\n 全食品还包括由诸如酵母和糖等基本成分生产的自制苏打水的说明书，以使整个过程开源;否则需要使用商业生产的瓶装或罐装苏打水，或具有商业制造的二氧化碳罐的消费碳化机。 [4] [5]\n     ^ Paul Heltzel（2001年4月9日）。 ＆＃34; Opencola  - 有一些代码和微笑＆＃34;麻省理工学院技术审查。 OpenCola恰好产生苏打水的软件公司使用点对点搜索来查找网络上的信息。它的软饮料，Opencola，有助于推广公司。\n ^ Malyn（2007年2月18日）。 ＆＃34; Opencola  - 开源可口可乐＆＃34;数字期刊。软饮料最初是旨在帮助解释开源软件的促销工具，但自推出它以来＆＃39;在自己的生活中拍摄。推出它的公司已经为饮料越来越闻名于他们提供的软件......销售饮品的网站已售出超过150,000罐！\n ^ ian Steadman（2013年4月13日）。 ＆＃34;开源可乐和＆＃39; Napster时刻＆＃39;为食品商业＆＃34;有线 。它＆＃39; S称为Open Cola，该产品首先由现在缺勤多伦多软件公司Opencola作为一个笑话。从Richard Stallman＆＃39;自由软件是＆＃34的着名·格尔曼的灵感来自言论自由，不像啤酒＆＃34;那样是一种促销工具。食谱在线发布，供任何人采取和适应。版本1.0于2001年1月27日发布 - 最新版本为1.1.3。 Opencola于2003年关闭，但开放可乐＆＃39;仍然存在。 \n^ a b c＆＃34; opencola.com  - 软饮料配方 - 互联网档案＆＃34; 2001.从2001-02-18归档原件。 ", "note_en": "Jump to navigation  Jump to search  OpenCola is a brand of  open-source cola, where the instructions for making it are freely available and modifiable. Anybody can make the drink, and anyone can modify and improve on the recipe. It was launched in 2001 by free software P2P company Opencola, to promote their company.  [1]\n   The original version 1.0 was released on 27 January 2001 by Grad Conn,  Cory Doctorow, and John Henson. The current version is 1.1.3. Although originally intended as a promotional tool to explain  free and open source software, the drink took on a life of its own and 150,000 cans were sold.  [2] The Toronto-based company Opencola became better known for the drink than the software it was supposed to promote. Laird Brown, the company&#39;s senior strategist, attributes its success to a widespread mistrust of big corporations and the &#34;proprietary nature of almost everything&#34;.  [3]\n        After mixing up the concentrate to the prescribed recipe (including all recommended safety precautions), the syrup is diluted 5:1 with (&#34;preferably  sodium-free&#34;)  soda water to make the finished drink; at this dilution, the above combination of ingredients will yield approximately 24 litres of OpenCola.\n The full recipe also includes instructions for home-made soda water produced from basic ingredients such as  yeast and  sugar in order to make the entire process open source; otherwise there would be a need to use commercially produced bottled or canned soda, or consumer  carbonation machines with commercially manufactured  carbon dioxide canisters.  [4]  [5]\n     ^   Paul Heltzel (9 April 2001).  &#34;OpenCola-Have Some Code and a Smile&#34;.  MIT Technology Review .  A software company that happens to produce a soda, OpenCola uses peer-to-peer searching to find information on the Web. Its soft drink, OpenCola, helps to promote the company.\n ^    Malyn (18 February 2007).  &#34;OpenCola - Open Source Coca Cola&#34;. Digital Journal .  The soft drink was originally intended to be a promotional tool to help explain open source software but since its launch it&#39;s taken on a life of its own. The company that launched it has become more well known for the drink than the software they offer... the website selling the drink has sold over 150,000 cans!\n ^    Ian Steadman (13 April 2013).  &#34;Open source cola and the &#39;Napster moment&#39; for the food business&#34;.  Wired .  It&#39;s called Open Cola, a product first produced by now-defunct Toronto software company Opencola as something of a joke. Taking inspiration from Richard Stallman&#39;s famous dictum that free software was &#34;free as in speech, not as in beer&#34;, it was meant as a kind of promotional tool. The recipe was published online for anyone to take and adapt. Version 1.0 was published on 27 January 2001 -- the latest version is 1.1.3. Opencola closed in 2003, but Open Cola&#39;s recipe is still around.\n ^     a     b     c     &#34;OpenCola.com - Soft Drink Formula - Internet Archive&#34;. 2001. Archived from  the original on 2001-02-18 .", "posttime": "2021-06-20 02:46:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "opencola", "title": "Opencola（饮料） ", "title_en": "OpenCola (Drink)", "transed": 1, "url": "https://en.wikipedia.org/wiki/OpenCola_(drink)", "via": "", "real_tags": ["opencola"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在某些时候，每个工程师都必须决定是否为某些东西写测试或只是运送功能并继续前进。\n 在一段时间嘎吱嘎吱的情况下，我将经常为简单的东西写测试（例如纯函数）或写下为他们的降压提供最大的爆炸的测试（例如，服务的端到端集成测试）。\n 测试代码与外部系统相互作用，如数据库或S3，需要更多的努力。但是，重要的业务逻辑经常发生在此代码中，最近我对测试它更感兴趣。\n    来自Dataclasses Import DataClass Import Json Import Boto3 S3_Bucket =＆＃34;食谱＆＃34; def get_s3（）：返回boto3。客户端（＆＃34; s3＆＃34;）@ dataclass类配方：名称：str说明：str @ classmethod def get_by_name（cls，name：str）：＆＃34;＆＃34;＆＃34;抬起食谱按名称args：name（str）：食谱名称返回食谱对象＆＃34;＆＃34;＆＃34; response = get_s3（）。 get_object（bucket = s3_bucket，key = name）响应= json。加载（响应[＆＃34;身体＆＃34;]。read（））返回cls（响应[＆＃34;名称＆＃34;]，响应[＆＃34;指令＆＃34;]）@ classMethod def update_instructions（ CLS，名称：str，new_instructions：str）：＆＃34;＆＃34;＆＃34;更新食谱args的说明：name（str）：要更新new_instructions（str）的配方的名称：新的指令和＃34;＆＃34;＆＃34;食谱= CLS。 get_by_name（name）配方。说明= new_instructions返回配方@ classmethod def delete（cls，name：str）：＆＃34;＆＃34;＆＃34;删除食谱args：name（str）：删除配方的名称和＃34;＆ ＃34;＆＃34; get_s3（）。 delete_object（bucket = s3_bucket，key = name）def to_json（self）：＆＃34;＆＃34;＆＃34;序列化json returns：str：json表示配方＆＃34;＆＃34; ＆＃34;返回json。转储（{＆＃34;名称＆＃34; self。名字，＆＃34;指示＆＃34; self。说明}）def save（self）：＆＃34;＆＃34;＆＃34;＆＃34;＆＃34;持续存在FEREAPE到S3＆＃34;＆＃34;＆＃34; serialized_recipe = self。 to_json（）。编码（＆＃34; UTF-8＆＃34;）get_s3（）。 put_object（bucket = s3_bucket，key = self。名称，body = serialized_recipe）\n   Moto是一个Python库，可以轻松地模拟AWS在测试中的服务。让我们使用它来测试我们的应用程序。\n 首先，创建一个创建我们S3存储桶的PyTest。 Mock_s3上下文管理器中的所有S3交互将在Moto的Virtual AWS帐户中定向。\n 从Moto Import Mock_s3导入Boto3从食谱导入配方，S3_Bucket @ PyTest进口Pytest。夹具def s3（）：＆＃34;＆＃34;＆＃34;在假moto aws帐户中创建食谱桶的Pytest夹具产生假的Boto3 S3客户＆＃34;＆＃34;＆＃34; Mock_s3（）：s3 = boto3。客户（＆＃34; s3＆＃34;）s3。 CREATE_BUCKET（BUCKET = S3_BUCKET）产量S3 \ndef test_create_and_get（s3）：配方（name =＆＃34;玉米虫＆＃34;，指示=＆＃34;在芯片上融合奶酪＆＃34;）。保存（）配方=配方。 get_by_name（＆＃34; Nachos＆＃34;）断言食谱。 name ==＆＃34;玉米片＆＃34;断言食谱。说明==＆＃34;在芯片上融化奶酪＆＃34;\n 如果我们尝试获取不存在的配方，则应提出异常。此测试涵盖了这种情况。\n  我们还可以更新配方。此测试确认在调用Save（）后更新数据。\n def test_update（s3）：old_instructions =＆＃34;芯片上的熔体奶酪＆＃34; new_instructions =＆＃34;微波一盘装满玉米片和奶酪＆＃34;食谱（名称=＆＃34; Nachos＆＃34;，指令= Old_Instructions）。保存（）new_recipe =配方。 update_instructions（name =＆＃34; nachos＆＃34;，new_instructions = new_instructions）＃在调用save（）配方=配方之前没有更改。 get_by_name（＆＃34; Nachos＆＃34;）断言食谱。指令== old_instructions new_recipe。保存（）＃保存配方=配方后的配方更新。 get_by_name（＆＃34; Nachos＆＃34;）断言食谱。指令== new_instructions.\n  def test_delete（s3）：食谱（名称=＆＃34;玉米虫＆＃34;，指示=＆＃34;在芯片上融合奶酪＆＃34;）。保存（）响应= S3。 list_objects_v2（桶= s3_bucket）断言Len（响应[＆＃34;内容＆＃34;]）== 1断言响应[＆＃34;内容＆＃34; ] [0] [＆＃34; key＆＃34; ] ==＆＃34; Nachos＆＃34;食谱 。删除（＆＃34; Nachos＆＃34;）＃删除配方响应= S3后，S3中的数据消失了。 list_objects_v2（桶= s3_bucket）断言＆＃34;内容＆＃34;不是回应。键（）\n 总的来说，Moto在实施S3 API时做得很好。安装易于安装，感觉就像真实的S3一样，并且不需要任何代码更改。\n   以下是创建S3存根的PyTest夹具。由于其他S3客户端不会使用此存根，我们还需要修补get_s3并用存根替换其返回值 - 从而强制在配方类中的所有S3客户端来使用我们的存根。 \n导入DateTime Import JSON来自Dateutil.tz导入Tzutc从Io Import Bytesio从unittest.stub导入补丁导入boto3从botocore.stub导入stubber，任何来自botocore.response导入流媒体导入pytest从配方导入配方，s3_bucket @ pytest。夹具def s3_stub（）：＆＃34;＆＃34;＆＃34;用s3客户端存根模拟get_s3函数的pytest灯具会产生s3客户端＆＃34的脱茬;＆＃34;＆＃34; s3 = boto3。客户端（＆＃34; s3＆＃34;）stubber = stuber（s3）与补丁（＆＃34; recipe.get_s3＆＃34;，return_value = s3）：产量脱茬\n 然后，我们可以将put_object和get_object s3 apis停留响应。使用那些存根，我们可以运行创建并随后获取配方的测试。\n def test_create_and_get（s3_stub）：＃stup out put_object响应＃注意：这些存根是不完整的 - 我省略了诸如#brevity pured_object_response = {＆＃34; respectemetadata＆＃34等事情。 ：{＆＃34; quequentId＆＃34; ：＆＃34; 5994D680BF127CE3＆＃34; ，＆＃34; httpstatuscode＆＃34; ：200，＆＃34; retryattempts＆＃34; ：1，}，＆＃34; Etag＆＃34; ：＆＃39;＆＃34; 6299528715bad0e3510d1e4c4952ee7e＆＃34;＆＃34; ，} put_object_expected_pa​​rams = {＆＃34;铲斗＆＃34; ：任何，＆＃34; key＆＃34; ：任何，＆＃34;身体＆＃34; ：任何} s3_stub。 add_response（＆＃34; put_object＆＃34; put_object_response，put_object_expecty_params）＃创建Get_Object Encoded_Message = JSON返回的流体。转储（{＆＃34;姓名＆＃34;：＆＃34;玉米虫＆＃34;，＆＃34;指示＆＃34;：＆＃34;碎片上的熔体奶酪＆＃34;}）。编码（＆＃34; utf-8＆＃34;）raw_stream = streamingbody（bytesio（encoded_message），len（encoded_message））＃stup out get_object响应get_object_response = {＆＃34; respectemetadata＆＃34; ：{＆＃34; quequentId＆＃34; ：＆＃34; 6BFC00970E62BC8F＆＃34; ，＆＃34; httpstatuscode＆＃34; ：200，＆＃34; retryattempts＆＃34; ：1，}，＆＃34; LastModified＆＃34; ：  约会时间 。 DateTime（2020,4,6,5,39,29，Tzinfo = Tzutc（）），＆＃34; contentLength＆＃34; ：58，＆＃34; Etag＆＃34; ：＆＃39;＆＃34; 6299528715bad0e3510d1e4c4952ee7e＆＃34;＆＃34; ，＆＃34; contenttype＆＃34; ：＆＃34;二元/八元门流＆＃34; ，＆＃34;元数据＆＃34; ：{}，＆＃34;身体＆＃34; ：raw_stream，} get_object_expected_pa​​rams = {＆＃34;铲斗＆＃34; ：任何，＆＃34; key＆＃34; ：任何} s3_stub。 add_response（＆＃34; get_object_response，get_object_eppect_params）＃用s3_stub激活stuber：crecipe = crecipe（name =＆＃34;玉米虫＆＃34;，指示=＆＃34;碎片搅拌奶酪＆＃34; ）  食谱 。保存（）配方=配方。 get_by_name（＆＃34; Nachos＆＃34;）断言食谱。 name ==＆＃34;玉米片＆＃34;断言食谱。说明==＆＃34;在芯片上融化奶酪＆＃34;\n 虽然Botocore Stubs是功能的，但我不喜欢用它们工作有几个原因：\n 他们需要更多的准备。创建存根是耗时的。即使您交互方式运行真实代码并复制响应，也需要替换一些事情 - 例如上面的流体。\n  他们是脆弱而假的。首先返回响应，首先出局 - 因此，如果您以不同的顺序调用S3 API，则它将抛出错误。如果您在如何调用API中有一个错误，可能不会被捕获。\n  要使存根看起来有点逼真，你必须嘲笑你的代码不关心的很多领域，并将您的测试与假响应融为一体。 \n它们从正在测试的模块中泄漏实现详细信息。例如，如果模块从使用s3.list_objects切换到s3.list_objects_v2，则测试将失败，因为它取决于被调用的特定API。这会创建对模块的私有API的不必要依赖，而不是测试公共API。\n  第三个选项是LocalStack，它允许您在本地提出整个AWS云堆栈。\n  版本：＆＃34; 3.7＆＃34;服务：测试：图片：S3_TESTING：最新网络： - 应用程序输入点： -  /pp/wait-for-it.sh--t  - ＆＃34; 30＆＃34; -  localstack：4572  -   -   -   -  pytest  - 测试/环境： -  aws_access_key_id = fake  -  aws_default_region = fake  -  aws_secret_access_key = fake localstack：图片：localstack / localstack端口： - ＆＃34; 4566-4599：4566-4599＆＃34;网络： - 应用环境： -  Services = S3网络：应用程序：驱动程序：桥接器：桥\n 接下来，我们再次模拟get_s3，此时间用连接到localstack的s3客户端替换它。\n 来自unittest.mock import补丁导入boto3从食谱导入配方，s3_bucket @ pytest导入pytest。夹具DEF S3_LOCALSTACK（）：S3 = BOTO3。客户（＆＃34; s3＆＃34;，endpoint_url =＆＃34; http：// localstack：4572＆＃34;）s3。 CREATE_BUCKET（BUCKET = S3_BUCKET）带补丁（＆＃34; recipe.get_s3＆＃34;，return_value = s3）：产量s3\n 通过这种模拟，我们可以使用Moto运行的相同测试。\n def test_create_and_get（s3_localstack）：食谱（name =＆＃34; Nachos＆＃34;，指示=＆＃34;在芯片上融合奶酪＆＃34;）。保存（）配方=配方。 get_by_name（＆＃34; Nachos＆＃34;）断言食谱。 name ==＆＃34;玉米片＆＃34;断言食谱。说明==＆＃34;在芯片上融化奶酪＆＃34; def test_get_does_not_exist（s3_localstack）：使用pytest。提升（S3_Localstack。例外。Nosuchkey）：食谱=配方。 get_by_name（＆＃34;三明治＆＃34;） \nLopalStack非常易于使用，但在我的机器上旋转需要近30秒。  Moto和LocalStack都非常强大，易于使用。 两个解决方案都做好实现S3 API，并且它们还支持其他AWS服务，包括EC2，RDS，Lambda等。 除了Python之外，它们还可以用于测试代码以其他语言。  lopalstack可能是实际连接到aws的最接近的事情，但对于上面提出的简单用例，我无法证明旋转堆栈所需的额外开销和时间。 因此，我推荐Moto，因为它是正确实现S3 API的最轻量级的解决方案。  对于测试S3性能的更复杂的项目，LocalStack可能是一个不错的选择。 Botocore Stubs不会削减。  谢谢阅读！ 如果您有任何反馈，我很乐意收到您的消息 - 在Twitter上关注我或在LinkedIn上留言。 ", "note_en": "At some point, every engineer has to decide whether to write tests for something or just ship the feature and move on.\n Under a time crunch, I’ll often write tests for the easy things (e.g. pure functions) or write the tests that provide the biggest bang for their buck (e.g. an end-to-end integration test for the service).\n Testing code that interacts with external systems, like a database or S3, requires a bit more effort. However, important business logic often happens in this code and recently I’ve become more interested in testing it.\n    from  dataclasses  import  dataclass import  json import  boto3 S3_BUCKET  =  &#34;recipes&#34; def  get_s3 ():  return  boto3 . client ( &#34;s3&#34; ) @ dataclass class  Recipe :  name :  str  instructions :  str  @ classmethod  def  get_by_name ( cls ,  name :  str ):  &#34;&#34;&#34;Looks up a Recipe by name Args: name (str): Recipe name Returns a Recipe object &#34;&#34;&#34;  response  =  get_s3 (). get_object ( Bucket = S3_BUCKET ,  Key = name )  response  =  json . loads ( response [ &#34;Body&#34; ]. read ())  return  cls ( response [ &#34;name&#34; ],  response [ &#34;instructions&#34; ])  @ classmethod  def  update_instructions ( cls ,  name :  str ,  new_instructions :  str ):  &#34;&#34;&#34;Updates the instructions for a recipe Args: name (str): Name of the recipe to update new_instructions (str): New instructions &#34;&#34;&#34;  recipe  =  cls . get_by_name ( name )  recipe . instructions  =  new_instructions  return  recipe  @ classmethod  def  delete ( cls ,  name :  str ):  &#34;&#34;&#34;Deletes a recipe Args: name (str): Name of the recipe to delete &#34;&#34;&#34;  get_s3 (). delete_object ( Bucket = S3_BUCKET ,  Key = name )  def  to_json ( self ):  &#34;&#34;&#34;Serialize the recipe to json Returns: str: JSON representation of the Recipe &#34;&#34;&#34;  return  json . dumps ({ &#34;name&#34; :  self . name ,  &#34;instructions&#34; :  self . instructions })  def  save ( self ):  &#34;&#34;&#34;Persists a recipe to S3 &#34;&#34;&#34;  serialized_recipe  =  self . to_json (). encode ( &#34;utf-8&#34; )  get_s3 (). put_object ( Bucket = S3_BUCKET ,  Key = self . name ,  Body = serialized_recipe )\n   Moto is a Python library that makes it easy to mock out AWS services in tests. Let’s use it to test our app.\n First, create a pytest a fixture that creates our S3 bucket. All S3 interactions within the  mock_s3 context manager will be directed at moto’s virtual AWS account.\n import  boto3 from  moto  import  mock_s3 import  pytest from  recipe  import  Recipe ,  S3_BUCKET @ pytest . fixture def  s3 ():  &#34;&#34;&#34;Pytest fixture that creates the recipes bucket in the fake moto AWS account Yields a fake boto3 s3 client &#34;&#34;&#34;  with  mock_s3 ():  s3  =  boto3 . client ( &#34;s3&#34; )  s3 . create_bucket ( Bucket = S3_BUCKET )  yield  s3\n  def  test_create_and_get ( s3 ):  Recipe ( name = &#34;nachos&#34; ,  instructions = &#34;Melt cheese on chips&#34; ). save ()  recipe  =  Recipe . get_by_name ( &#34;nachos&#34; )  assert  recipe . name  ==  &#34;nachos&#34;  assert  recipe . instructions  ==  &#34;Melt cheese on chips&#34;\n If we try to fetch a Recipe that doesn’t exist, an exception should be raised. This test covers that scenario.\n  We can also update a Recipe. This test confirms that the data is updated after  save() is called.\n def  test_update ( s3 ):  old_instructions  =  &#34;Melt cheese on chips&#34;  new_instructions  =  &#34;Microwave a plate full of tortilla chips and cheese&#34;  Recipe ( name = &#34;nachos&#34; ,  instructions = old_instructions ). save ()  new_recipe  =  Recipe . update_instructions (  name = &#34;nachos&#34; ,  new_instructions = new_instructions  )  # Nothing changes until you call save()  recipe  =  Recipe . get_by_name ( &#34;nachos&#34; )  assert  recipe . instructions  ==  old_instructions  new_recipe . save ()  # Recipe updates after saving  recipe  =  Recipe . get_by_name ( &#34;nachos&#34; )  assert  recipe . instructions  ==  new_instructions\n  def  test_delete ( s3 ):  Recipe ( name = &#34;nachos&#34; ,  instructions = &#34;Melt cheese on chips&#34; ). save ()  response  =  s3 . list_objects_v2 ( Bucket = S3_BUCKET )  assert  len ( response [ &#34;Contents&#34; ])  ==  1  assert  response [ &#34;Contents&#34; ][ 0 ][ &#34;Key&#34; ]  ==  &#34;nachos&#34;  Recipe . delete ( &#34;nachos&#34; )  # Data in S3 is gone after deleting the recipe  response  =  s3 . list_objects_v2 ( Bucket = S3_BUCKET )  assert  &#34;Contents&#34;  not  in  response . keys ()\n Overall, moto does a great job of implementing the S3 API. It’s easy to install, feels just like the real S3, and doesn’t require any code changes.\n   Below is a pytest fixture that creates an S3 stub. Since other S3 clients won’t use this stub, we also need to patch  get_s3 and replace its return value with the stub - thereby forcing all S3 clients in the Recipe class to use our stub.\n import  datetime import  json from  dateutil.tz  import  tzutc from  io  import  BytesIO from  unittest.mock  import  patch import  boto3 from  botocore.stub  import  Stubber ,  ANY from  botocore.response  import  StreamingBody import  pytest from  recipe  import  Recipe ,  S3_BUCKET @ pytest . fixture def  s3_stub ():  &#34;&#34;&#34;Pytest fixture that mocks the get_s3 function with a S3 client stub Yields a Stubber for the S3 client &#34;&#34;&#34;  s3  =  boto3 . client ( &#34;s3&#34; )  stubber  =  Stubber ( s3 )  with  patch ( &#34;recipe.get_s3&#34; ,  return_value = s3 ):  yield  stubber\n Then, we can stub out responses for the  put_object and  get_object S3 APIs. With those stubs in place, we can run the test that creates and subsequently fetches a Recipe.\n def  test_create_and_get ( s3_stub ):  # Stub out the put_object response  # Note: These stubs are incomplete - I omitted things such as  # HTTP headers for brevity  put_object_response  =  {  &#34;ResponseMetadata&#34; :  {  &#34;RequestId&#34; :  &#34;5994D680BF127CE3&#34; ,  &#34;HTTPStatusCode&#34; :  200 ,  &#34;RetryAttempts&#34; :  1 ,  },  &#34;ETag&#34; :  &#39;&#34;6299528715bad0e3510d1e4c4952ee7e&#34;&#39; ,  }  put_object_expected_params  =  { &#34;Bucket&#34; :  ANY ,  &#34;Key&#34; :  ANY ,  &#34;Body&#34; :  ANY }  s3_stub . add_response ( &#34;put_object&#34; ,  put_object_response ,  put_object_expected_params )  # Create the StreamingBody that will be returned by get_object  encoded_message  =  json . dumps (  { &#34;name&#34; :  &#34;nachos&#34; ,  &#34;instructions&#34; :  &#34;Melt cheese on chips&#34; }  ). encode ( &#34;utf-8&#34; )  raw_stream  =  StreamingBody ( BytesIO ( encoded_message ),  len ( encoded_message ))  # Stub out the get_object response  get_object_response  =  {  &#34;ResponseMetadata&#34; :  {  &#34;RequestId&#34; :  &#34;6BFC00970E62BC8F&#34; ,  &#34;HTTPStatusCode&#34; :  200 ,  &#34;RetryAttempts&#34; :  1 ,  },  &#34;LastModified&#34; :  datetime . datetime ( 2020 ,  4 ,  6 ,  5 ,  39 ,  29 ,  tzinfo = tzutc ()),  &#34;ContentLength&#34; :  58 ,  &#34;ETag&#34; :  &#39;&#34;6299528715bad0e3510d1e4c4952ee7e&#34;&#39; ,  &#34;ContentType&#34; :  &#34;binary/octet-stream&#34; ,  &#34;Metadata&#34; :  {},  &#34;Body&#34; :  raw_stream ,  }  get_object_expected_params  =  { &#34;Bucket&#34; :  ANY ,  &#34;Key&#34; :  ANY }  s3_stub . add_response ( &#34;get_object&#34; ,  get_object_response ,  get_object_expected_params )  # Activate the stubber  with  s3_stub :  recipe  =  Recipe ( name = &#34;nachos&#34; ,  instructions = &#34;Melt cheese on chips&#34; )  recipe . save ()  recipe  =  Recipe . get_by_name ( &#34;nachos&#34; )  assert  recipe . name  ==  &#34;nachos&#34;  assert  recipe . instructions  ==  &#34;Melt cheese on chips&#34;\n While botocore stubs are functional, I don’t like working with them for several reasons:\n They require a lot more prep. Creating stubs is time-consuming. Even if you run the real code interactively and copy the response, some things need to be replaced - such as the StreamingBody above.\n  They’re fragile and fake. Responses are returned first in, first out - so if you call the S3 APIs in a different order than you added the responses, it will throw an error. If you have a bug in how you call the API, it might not be caught.\n  To make the stubs look somewhat realistic, you have to mock many fields that your code doesn’t care about and bloat your tests with fake responses.\n  They leak implementation details from the module being tested. For example, if a module switched from using  s3.list_objects to  s3.list_objects_v2, the test would fail because it depends on a specific API being called. This creates an unnecessary dependency on the private API of the module, instead of testing the public API.\n  A third option is  localstack, which allows you to bring up an entire AWS cloud stack locally.\n  version :  &#34; 3.7&#34; services :  tests :  image :  s3_testing:latest  networks :  -  app  entrypoint :  -  /app/wait-for-it.sh  -  -t  -  &#34; 30&#34;  -  localstack:4572  -  --  -  pytest  -  test/  environment :  -  AWS_ACCESS_KEY_ID=fake  -  AWS_DEFAULT_REGION=fake  -  AWS_SECRET_ACCESS_KEY=fake  localstack :  image :  localstack/localstack  ports :  -  &#34; 4566-4599:4566-4599&#34;  networks :  -  app  environment :  -  SERVICES=s3 networks :  app :  driver :  bridge\n Next, we mock  get_s3 again and this time replace it with an S3 client that is connected to localstack.\n from  unittest.mock  import  patch import  boto3 import  pytest from  recipe  import  Recipe ,  S3_BUCKET @ pytest . fixture def  s3_localstack ():  s3  =  boto3 . client ( &#34;s3&#34; ,  endpoint_url = &#34;http://localstack:4572&#34; )  s3 . create_bucket ( Bucket = S3_BUCKET )  with  patch ( &#34;recipe.get_s3&#34; ,  return_value = s3 ):  yield  s3\n With this mock in place, we can run the same tests that we ran with moto.\n def  test_create_and_get ( s3_localstack ):  Recipe ( name = &#34;nachos&#34; ,  instructions = &#34;Melt cheese on chips&#34; ). save ()  recipe  =  Recipe . get_by_name ( &#34;nachos&#34; )  assert  recipe . name  ==  &#34;nachos&#34;  assert  recipe . instructions  ==  &#34;Melt cheese on chips&#34; def  test_get_does_not_exist ( s3_localstack ):  with  pytest . raises ( s3_localstack . exceptions . NoSuchKey ):  recipe  =  Recipe . get_by_name ( &#34;sandwich&#34; )\n Localstack is extremely easy to use, but it takes almost 30 seconds to spin up on my machine.\n  Both moto and localstack are very powerful and easy to work with. Both solutions do a good job of implementing the S3 API, and they also support other AWS services including EC2, RDS, Lambda, and more. They can both be used to test code in other languages in addition to Python.\n Localstack is probably the closest thing to actually connecting to AWS, but for my simple use case presented above, I can’t justify the extra overhead and time required to spin up the stack. Therefore, I recommend moto as it’s the most lightweight solution that properly implements the S3 API.\n For more complicated projects that are testing S3 performance, localstack could be a good choice. Botocore stubs don’t make the cut.\n  Thanks for reading! If you have any feedback, I’d love to hear from you - follow me on  Twitter or message me on  LinkedIn.", "posttime": "2021-06-20 02:46:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,测试,s3", "title": "如何在Python中测试S3 ", "title_en": "How to Test S3 in Python", "transed": 1, "url": "https://www.sanjaysiddhanti.com/2020/04/08/s3testing/", "via": "", "real_tags": ["python", "测试", "s3"]}, {"category": "", "categoryclass": "", "imagename": "9d432380c4c2b578e7f0e8c15712b3a6.jpeg", "infoid": 1066919, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "快速上升的住房成本有助于将通货膨胀推向13年。但政府统计学家追踪消费品价格的方式可能缺少最近几个月爆炸性的房价增长。\n  根据劳工统计局周四发布的月度周四发布的最新版本的最新版本，住房成本在4月至5月之间增长0.4％。与去年相比，租房者和房主相似的住房价格上涨2.2％。\n  总共，房价的上涨占10月份通胀总体上涨的一季度，反映了政府经济学家如何重量这一支出类别。\n  但如果这是2.2％的数字似乎是根据自己的购买或销售房屋的经验，这并不是一个惊喜。不是每个人都同意房价增长的速度。\n    其他数据表明，房价升值和租赁增长的速度要快得多，且超过该水平。\n  3月份案件 - 海运房价指数的最新报告表明，自2005年以来的最大增长率涨幅超过13％以上。\n  那么CPI如何计算住房？首先，住房单位本身不包括CPI市场篮子。 \n其次，租赁数据建立每六个月的价格如何变化。每月或双月地收集大多数其他CPI项目的计算。\n  “与大多数其他经济系列一样，CPI视为房屋单位作为资本（或投资）货物而不是作为消费物品，”劳工统计局表示。 “支出购买和改进房屋和其他住房单位是投资而不是消费。”\n  “租用住房住房的住所的成本是租金。对于业主占用的单位，庇护所的成本是所有者占用者如果他们租房的房屋必须支付的隐含租金，“它增加了。\n   政府Pollsters询问房主：“如果有人今天租用你的家，你认为每月，无家具和没有公用事业会租多少钱？”\n  他们询问租房人：“您的[家庭]的租赁费用是什么，包括车库和停车设施的任何额外费用？不包括当地，州或联邦机构的直接付款。这个封面是什么时间？“\n   “房价升值率并不类似于通货膨胀，”Title Insurance Company First American Financial Services FAF的首席​​经济学家Mark Fleming说。\n  开始，住房是一个非常基本的必要性。 “对避难所的需求不会消失 - 它只是移动，”弗莱明说。换句话说，如果航空公司的价格飙升7％，就像过去一个月一样，家庭可以反对那个夏天的逃亡。 \n当涉及到住房时，选择并不是那么简单。随着庇护所的成本增加，国家低收入住房联盟研究副总裁Andrew Aurand表示，它可以对“极低收入租房者的级联效应”。\n    来自Aurand的组织的研究表明，超过920万“极低的收入”租房者因住房成本负担，这意味着他们在庇护相关费用上花费了超过三分之一的收入。这些家庭中的许多家庭在住房上花费了50％，留下了其他购买的少量资金。\n  这些家庭的替代方案将在他们的头上失去屋顶。近年来，这已成为许多美国人的现实。特朗普政府发布的2019年研究估计，全国各地每晚睡超过500,000人，而许多长沙发冲浪或利用庇护所无与伦比的人。\n  与此同时，对于拥有自己的家园的人，购买物业与买单不一样，比如香蕉。拥有香蕉不会在长期的情况下在经济上受益，而您可以期待看到其价值增加并盈利。但房屋不是一种纯粹的投资资产 - 这是两者的混合。\n    由于实际的结构本身可能更值得升高，因为劳动力和木材的成本上升，而且因为人们认为它作为资本投资的价值也是如此。\n  因此，经济学家或政府统计日的升级房价的方式可能存在不匹配，以及对消费者的意思是什么意思。\n  “在价格上涨的市场环境中如此迅速地购买房屋，经济学家会说，全国家庭建设者协会首席经济学家罗伯特·迪茨（Robert Dietz）表示。 “但是对于买方来说，它代表了更高的生活成本。” \n人们对大多数其他产品不同地体验通货膨胀率，这使得衡量挑战。\n  对于典型的房主，他们的住房成本可能在过去一年中没有太多变化。\n  “如果您有固定的抵押贷款，在您的家中，同年年，您的住所更改的生活费用是多少？不是很多，“弗莱明说。 “唯一一年多年来的税收和保险的唯一事情。”\n  即使有租房者，住房的价格也不会从一个月开始或更低。这就是为什么劳动统计局统计局比CPI篮子中的大多数其他物品更少收集住房数据。\n  对于租房和买家来说，当您的生活安排发生变化时，您遇到了不断变化的成本：当您搬到新的家中时，签署新的租约或再融资您的抵押贷款。\n    但美国人确实需要知道房屋成本上升或下降的程度 - 并非最少的是，因为住宅房地产构成了这一大部分的国家经济。\n  政府的消费者价格指数计算“占用租金” - 基本上，房主支付住房的金额而不是支付房东。 \n如果没有这样做，GDP实际上会堕落，Dietz说，“因为租房所支付的市场租赁的金钱突然消失。”\n  为弥合这一挑战，政府依赖调查数据，以生产租房和房主的住房成本估计。在租房的情况下，他们只是询问他们支付多少住房。\n  但业主并没有被问到他们的抵押贷款是什么 - 毕竟不是每个人都有抵押贷款。相反，这就是为什么他们被要求估计他们能够收取多少费用以租赁他们当前的家。\n  政府统计人定期调查同一伙伴们的美国人，以产生他们的发现和跟踪变化，以估计住房成本。\n  “房价普遍存在”的通货膨胀和[变化]，Kimc总裁兼私立房地产投资公司Kimc总裁兼首席投资官Jonathan Fellell表示。他补充说，房价上涨“在某些情况下超出了通货膨胀”。\n  然而，一些研究人员认为，这种方法也可以低估和/或避免识别住房市场发生的真正通胀。\n  Fannie Mae Fnma的新分析，+ 2.26％表明，当房价实际上上升时，通常存在滞后，当价格增长反映在消费者价格指数等通货膨胀报告中。 \n住房偏好和Covid-19大流行引起的需求的转变也使我们衡量通胀在住房市场中的效果的能力复杂化。\n  富裕的美国人，其中许多人突然发现自己能够远程工作，选择将主要城市移开到郊区的更大，更便宜的家，往往节省了这个过程中的钱。因此，Pricier社区的租金率下降。\n  但在更实惠的地区，租金实际上增加了。由于大流行而失去了工作的美国人赶紧找到更便宜的住房，推动楼宇最便宜的公寓和郊区的房屋租金。\n  这些效果开始消散，但将继续称为像消费者价格指数一样的官方措施，因为当时发生的时间滞后。\n    所以外壳迅速变得越来越贵吗？经济学家同意的答案是肯定的。第一个美国金融服务有自己的措施，真正的房价指数，这与美国人负担得起基于现行利率和家庭收入的物业的能力将标称价格收益相比。\n  弗莱明说，在2018年至2020年之间与2020年初，真正的房价指数正在下降，因为美国人的购买力速度升高，弗莱明说。不再是这种情况。\n  “通货紧缩变成了通货膨胀，而不是因为利率已经上涨 - 他们只上涨了一点点 - 但由于房价只是疯狂，”弗莱明说。 \n房价上涨的原因如此之快，相当简单。经济衰退巨大后，家庭建筑活动都除了建筑行业恢复时，所有人都达到了一个停滞不前。\n    因此，新房建设并没有与人口增长和新家庭的形成保持步伐。\n  这让房地产市场带来严重短缺，就像千禧一代开始结婚并拥有孩子 - 现场购买兴趣的传统标志。\n  随着大流行，遥控工作和低利率的转变只会加剧了事物。\n  解决住房失控通货膨胀的主要解决方案将是建造更多的家园 - 而不是完成的东西。 “我们面临在住宅建筑行业供应方面的一些挑战将持续到2022年，”Dietz说。\n  这些挑战从木材高成本到缺乏技术工人来完成建筑项目的挑战。另一个因素：全国各地的分区规定防止在许多城市建设更密集的住房，在此过程中有效地提高房价和租金。\n  最后，单独的新家庭建筑不会让所有美国人更容易。由于成本高，建设者更容易构建更昂贵的房屋，即使需求和竞争对入门级属性最强。 \n随着时间的推移，房地产市场底层中增加的浓度正在推动那些最不起的人的价格。  “有这个论点，如果你只是建立更多的供应来满足需求，它将最终有助于极低和极低的收入租房者，”Aurand说。 “但市场不会充分服务，主要是极低的收入租房。” ", "note_en": "Fast-rising housing costs have helped to push inflation to a 13-year high. But the way that government statisticians track the price of consumer goods may be missing just how explosive home-price growth has been in recent months.\n  Housing costs rose by 0.4% between April and May, according to  the latest edition of the monthly consumer price index released Thursday by the Bureau of Labor Statistics. Compared with last year, housing prices for renters and homeowners alike were up 2.2%.\n  Altogether, the rise in housing prices  accounted for over a quarter of the overall increase in inflation in May, a reflection of how heavily government economists weight this spending category.\n  But if that 2.2% figure seems off based on your own experience of buying or selling a home, it’s not a surprise. Not everyone agrees on the rate of house-price growth.\n    Other data suggested a much faster pace of home price appreciation and rental growth, well in excess of that level.\n  The  most recent report from the Case-Shiller Home Price Index for March showed that home prices were up more than 13%, the largest rate of growth since 2005.\n  So how does the CPI calculate housing? Firstly, housing units themselves are not included the CPI market basket.\n  Secondly, rental data to establish how prices are changing are collected every six months. The calculations for most other CPI items are collected monthly or bimonthly.\n  “Like most other economic series, the CPI views housing units as capital (or investment) goods and not as consumption items,”  the Bureau of Labor Statistics says. “Spending to purchase and improve houses and other housing units is investment and not consumption.”\n  “The cost of shelter for renter-occupied housing is rent. For an owner-occupied unit, the cost of shelter is the implicit rent that owner occupants would have to pay if they were renting their homes,” it adds.\n   The government pollsters ask homeowners: “If someone were to rent your home today, how much do you think it would rent for monthly, unfurnished and without utilities?”\n  And they ask renters: “What is the rental charge to your [household] for this unit including any extra charges for garage and parking facilities? Do not include direct payments by local, state or federal agencies. What period of time does this cover?”\n   “The rate of house price appreciation is not akin to inflation,” said Mark Fleming, chief economist at title insurance company First American Financial Services  FAF.\n  For a start, housing is a very basic necessity. “Demand for shelter doesn’t go away — it just moves around,” Fleming said. In other words, if the price of airfares skyrockets 7%, as it did over the past month, families could decide against going on that summer getaway.\n  That choice isn’t so simple when it comes to housing. As the cost of shelter increases it can have a “cascading effect on extremely low-income renters,” said Andrew Aurand, vice president for research at the National Low Income Housing Coalition.\n    Research from Aurand’s organization has shown that more than 9.2 million “extremely low-income” renters are cost burdened by their housing, meaning they spent more than a third of their income on shelter-related expenses. Many of these households spend upwards of 50% on housing, leaving little money behind for other purchases.\n  The alternative for these households would be losing the roof over their heads. In recent years, that has become the reality for many Americans. A  2019 study released by the Trump administration estimated that more than 500,000 people sleep outdoors each night across the country, while many more couch surf or utilize shelters for unhoused people.\n  Meanwhile, for people who own their homes, buying a property isn’t the same as buying, say, a banana. Owning that banana won’t benefit you financially in the long-run, whereas with a house you can expect to see its value increase and to profit off that. But a home isn’t a pure investment asset like a stock — it’s a mix of both.\n    Home prices can rise both because the actual structure itself may be worth more — thanks to the rising cost of labor and lumber — but also because people see value in it as a capital investment.\n  As a result, there can be a mismatch in the way economists or government statistician view rising home prices, and what that means to a consumer.\n  “In a market environment where prices are rising so quickly to buy a home the economist would say that’s the increase in the price of the capital good,” said Robert Dietz, chief economist at the National Association of Home Builders. “But to the buyer, it represents a higher cost of living.”\n   People experience inflation vis-à-vis housing differently to most other products, and that makes it a challenging to measure.\n  For the typical homeowner, their housing costs likely haven’t changed too much over the past year.\n  “If you have a fixed mortgage, on your home, year over year, how much does your cost of living in that home change? Not very much,” Fleming said. “The only things that change year over year are your escrows for taxes and insurance.”\n  Even with renters, the price of housing doesn’t shift higher or lower from month to month. That’s why the Bureau of Labor Statistics collects housing data more infrequently than most other items in the CPI basket of goods.\n  For renters and buyers, you encounter the changing cost when something about your living arrangement changed: When you move to a new home, sign a new lease or refinance your mortgage.\n    But Americans do need to know how much housing costs are rising or falling — not the least of which because residential real-estate makes up such a huge portion of the nation’s economy.\n  The government’s Consumer Price Index calculates the “imputed rent” — essentially the amount a homeowner is paying for their housing rather than paying a landlord.\n  If it did not do so, GDP would actually fall, Dietz said, “because money that would be a rental payment in the marketplace paid by a renter suddenly disappears.”\n  To bridge this challenge, the government relies on survey data to produce its estimates of housing costs for renters and homeowners. In renters’ cases, they are simply asked how much they pay for housing.\n  But owners aren’t asked what their mortgage payment is — after all, not everyone has a mortgage. Instead, that’s why they are asked to estimate how much they would be able to charge for rent to lease out their current home.\n  Government statisticians survey the same cohort of Americans periodically to produce their findings and track changes over time to estimate housing costs.\n  “Inflation and [changes in] housing prices have generally been matched up,” said Jonathan Needell, President and Chief Investment Officer of KIMC, a private real-estate investment company. He added that rising housing prices has “exceeded inflation in some circumstances.”\n  Some researchers have argued, however, that this approach  can also understate and/or be slow to identify true inflation occurring in the housing market.\n  A  new analysis from Fannie Mae  FNMA,  +2.26% showed that there is typically a lag between when home prices are actually rising, and when that price growth is reflected in inflation reports like the consumer price index.\n   The shifts in housing preferences and needs caused by the COVID-19 pandemic has also complicated our ability to gauge the effect of inflation in the housing market.\n  Wealthier Americans, many of whom suddenly found themselves able to work remotely, chose to move away from major cities into larger and cheaper homes in the suburbs, often saving money in the process. As a result, rental rates declined in pricier neighborhoods.\n  But in more affordable areas, rents actually increased. Americans who lost their jobs because of the pandemic rushed to find cheaper housing, pushing rents higher for the least expensive apartments and homes in the suburbs.\n  Those effects are beginning to dissipate, but will continue to weigh on official measures like the consumer price index given the time lags that occur.\n    So is housing quickly becoming more expensive? The answer, economists agree, is yes. First American Financial Services has its own measure, the Real House Price Index, which compares nominal-price gains with Americans’ ability to afford to purchase a property based on the prevailing interest rates and household income.\n  For a period of time between 2018 and the beginning of 2020, the  Real House Price Index was falling, because Americans’ buying power was rising faster than home prices, Fleming said. That’s not the case anymore.\n  “Deflation has turned into inflation, not because interest rates have gone up — they’ve only gone up a little bit — but because house prices are just crazy,” Fleming said.\n  The reason home prices are rising so fast is fairly simple. After the Great Recession, home-building activity all but drew to a standstill as the construction industry worked to recover.\n    As a result, the construction of new homes did not keep pace with population growth and the formation of new households.\n  That left the housing market with a serious shortage of homes, just as millennials have begun getting married and having kids — traditional hallmarks of home-buying interest.\n  With the pandemic, the shift to remote working and low interest rates have only exacerbated things.\n  The primary solution to address runaway inflation in housing will be to build more homes — something that’s easier said than done. “Some of the challenges that we face on the supply side of the residential construction industry are going to persist well into 2022,” Dietz said.\n  Those challenges run the gamut from the high cost of lumber to the lack of skilled workers to complete construction projects. Another factor: Zoning regulations across the country prevent the construction of more dense housing in many cities, effectively driving up home prices and rents in the process.\n  Finally, new-home construction alone won’t make matters easier for all Americans. Because of the high costs, it’s easier for builders to construct more expensive homes, even though the demand and competition is strongest for entry-level properties.\n  Over time, that increased concentration in the bottom-tier of the housing market is driving up prices for those who can least afford it.\n  “There’s this argument that if you just build more supply to meet the demand, it will eventually help extremely low and very low-income renters,” Aurand said. “But the market is not going to adequately serve mostly extremely low-income renters.”", "posttime": "2021-06-20 02:45:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,风暴,storm,住房", "title": "通货膨胀风暴正在为美国住房市场来临 ", "title_en": "An inflation storm is coming for the U.S. housing market", "transed": 1, "url": "https://www.marketwatch.com/story/an-inflation-storm-is-coming-for-the-u-s-housing-market-11623419869?mod=mw_more_headlines", "via": "", "real_tags": ["美国", "风暴", "storm", "住房"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JPEG XL图像格式包括所谓的＆＃34;预测器和＃34;，通过在其邻居颜色的颜色方面表达像素的颜色来提高压缩的小程序。可以在JPEG XL预测器中实现规则110蜂窝自动机。 （它不是任何复杂的东西，但我想我是第一个做到这一点。）由于规则110是完成的，这似乎证明了JPEG XL预测因子本身是完整的 - 除了他们不是！为了帮助并行解码，JPEG XL解码器在图像1024的片段上工作1024像素的尺寸。所以JPEG XL本身是＆＃39; T完成;没有1024×1024像素限制的情况的一个版本。\n   这是我JPEG XL实现规则110的裁剪。单击它以查看完整图像。\n   当我在下面写下代码时，JXL预测器的源代码格式并没有发表评论或常量，我想让它更容易理解。这就是代码需要预处理步骤的原因。在编译之前，应用sed命令sed＆＃39; s | \\ s *;。* $ ||; s | t 1 | t 255 |; s | -1 | -255 |＆＃39;剥去注释并转换±1至±255。\n  如果Y＆gt; 0如果n＆gt; 0如果nw-n＆gt; -1; n = 1如果n-ne＆gt; 0; nw = 1  - 设置1; ne = 0  - 设置0; ne = 1  - 设置1; NW = 1，NE = 0/1如果nw-n>; 0; n = 0如果n-ne＆gt; -1; nw = 1  - 设置0; ne = 0  - 设置1; NE = 1如果n-ne＆gt; -1; nw = 0  - 设置0; ne = 0  - 设置1; NE = 1如果x＆gt; 1022  -  SET 255  -  SET 0\n  JPEG XL预测器用于创建艺术。您可以在JPEG XL Developer Jon Sneyers的JXL Art Gallery中看到其中的一些艺术者，他们在JPEG XL Discord中的#JXL-ART通道上进行了开创了预测艺术。该库需要一个支持JPEG XL的浏览器。\n “JPEG XL艺术：＆＃39; eeg在Mount sierpinski＆＃39; 77字节的基地。 reddit线程通过Jon Sneyers发表评论，以他以前的图像格式解释预测因子及其起源。 ", "note_en": "The  JPEG XL image format includes so-called &#34;predictors&#34;, small programs that improve compression by expressing the color of a pixel in terms of the colors of its neighbors. It is possible to implement the  Rule 110 cellular automaton in JPEG XL predictors. (It wasn&#39;t anything complicated, but I think  I was the first to do it.) Since Rule 110 is Turing-complete, this seems to prove that JPEG XL predictors are themselves Turing-complete — except they are not! To help with parallel decoding, JPEG XL decoders work on slices of images 1024 by 1024 pixels in size. So JPEG XL itself isn&#39;t Turing-complete; a version of it without the 1024×1024 pixel limitation would be.\n   This is a crop of my JPEG XL implementation of Rule 110. Click it to see the full image.\n   When I wrote the code below, the source code format for JXL predictors didn&#39;t have comments or constants, which I wanted to make it easier to understand. This is why the code needs a preprocessing step. Before you compile it, apply the sed command  sed &#39;s|\\s*;.*$||;s|t 1|t 255|;s|-1|-255|&#39; to strip out the comments and convert ±1 to ±255.\n  if y &gt; 0 if N &gt; 0 if NW-N &gt; -1 ; N = 1 if N-NE &gt; 0 ; NW = 1 - Set 1 ; NE = 0 - Set 0 ; NE = 1 - Set 1 ; NW = 1, NE = 0/1 if NW-N &gt; 0 ; N = 0 if N-NE &gt; -1 ; NW = 1 - Set 0 ; NE = 0 - Set 1 ; NE = 1 if N-NE &gt; -1 ; NW = 0 - Set 0 ; NE = 0 - Set 1 ; NE = 1 if x &gt; 1022 - Set 255 - Set 0\n  JPEG XL predictors are used to create art. You can see some of it in the  JXL Art Gallery of JPEG XL developer Jon Sneyers, who pioneered predictor art, and on the #jxl-art channel in the JPEG XL Discord. The Gallery requires a browser that supports JPEG XL.\n “JPEG XL art: &#39;EEG at the base of Mount Sierpinski&#39;, 77 bytes”. The Reddit thread has a comment by Jon Sneyers explaining predictors and their origin in his previous image format, FLIF.", "posttime": "2021-06-20 02:45:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xl", "title": "JPEG XL将完成（通过规则110） ", "title_en": "JPEG XL would be Turing-complete (via Rule 110)", "transed": 1, "url": "https://dbohdan.com/wiki/jpeg-xl?", "via": "", "real_tags": ["xl"]}, {"category": "", "categoryclass": "", "imagename": "40145bf97ec8eb7ea6b18110810623ce.jpg", "infoid": 1066917, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约（CNN业务）Peloton用户正在警告与自行车+上的触摸屏有关的新安全威胁，可能是由黑客控制的。\n 在一份报告周三发布的报告中，网络安全公司McAfee发现了一种脆弱性，允许黑客访问Peloton＆＃39; S自行车屏幕，并使用其麦克风和相机潜在地窥探车手。然而，威胁最有可能影响公共空间中使用的2,495美元的自行车，例如酒店或健身房，因为黑客需要使用包含恶意代码的USB驱动器物理访问屏幕。\n 根据McAfee＆＃39;先进的威胁研究团队，黑客可以谨慎地控制静止自行车和＃39; S屏幕，并干扰其操作系统。这意味着黑客可以安装看起来像netflix或spotify的应用程序，并窃取用户＆＃39;登录信息。也许更令人惊讶的是，网络安全团队能够通过相机和麦克风来间谍，通常用于与其他用户的视频聊天。\n      ＆＃34;因此，一个毫无戒心的健身家，以旋转为旋转旋转的危险可能有着他们的个人数据受到损害的危险，并且他们的锻炼在不知不觉中观看，＆＃34;报告说。它还警告了黑客可以在任何时候配置这个间谍软件，包括在供应链或交付过程中，没有所有者知道。\n   无论是互联网连接的设备，无论是自行车，电脑还是均匀的冰箱都易受黑客攻击。 Cyber​​attacks越来越多地抓住了公众，并注意到了高调的公司，包括麦当劳，微软和电子艺术，公开揭示最近的安全漏洞。\n  McAfee表示，它在Peloton＆＃39; s软件上与A＆＃34;关键眼睛＆＃34;找到漏洞和警告用户。这两家公司一起致力于＆＃34;负责任地发展和发出补丁。＆＃34;\n Peloton（Pton）发布了一个强制性的软件更新，该软件更新将本月早些时候对用户修复问题。安全风险不会影响较低价格的Peloton自行车，因为它使用了不同类型的触摸屏。 \nMcAfee的说法，这是所有连接设备的用户的重要提醒，以激活自动软件更新，以防止它们免受最新攻击的保护。  ＆＃34;留在您的设备制造商的软件更新之上，特别是因为它们并不总是宣传他们的可用性，＆＃34; McAfee＆＃39; S的研究人员说。 ＆＃34;定期访问他们的网站，以确保您不要错过可能影响您的消息。＆＃34;  本报告标志着两个月内佩洛顿的第二次安全问题。 5月，健身公司发布了一种安全更新，该安全更新密封泄漏，这些泄漏揭示了个人账户信息，例如用户＆＃39;年龄，城市和体重。 这只虫子的新闻在当同一天释放了Peloton在儿童死亡后召回了跑步机，当机器运行时，其他人受伤。 ", "note_en": "New York (CNN Business) Peloton users are being warned of a new security threat relating to the touchscreen on their Bike+ that could potentially be  controlled by hackers.\n In a report released Wednesday,  cybersecurity company McAfee discovered a vulnerability that allows hackers to access Peloton&#39;s bike screen and potentially spy on riders using its microphone and camera. However, the threat most likely affects only the  $2,495 bike used in public spaces, such as in hotels or gyms, because the hacker needs to physically access the screen using a USB drive containing a malicious code.\n According to McAfee&#39;s Advanced Threat Research team, a hacker can discreetly control the stationary bike&#39;s screen remotely and interfere with its operating system. That means hackers could, for example, install apps that look like Netflix or Spotify and steal the users&#39; log-in information. Perhaps more alarmingly, the cybersecurity team was able spy on users via the camera and microphone, which is normally used for video chats with other users.\n      &#34;As a result, an unsuspecting gym-goer taking the Peloton Bike+ for a spin could be in danger of having their personal data compromised and their workout unknowingly watched,&#34; the report said. It also warned the hacker could configure this spyware at any point, including during the supply chain or delivery process, without the owner knowing.\n   Internet-connected devices, whether they are bikes, computers or even refrigerators,  are all susceptible to hacks. Cyberattacks have increasingly caught the public&#39;s attention, with high-profile companies including  McDonald&#39;s, Microsoft and Electronic Arts publicly revealing recent security breaches.\n  McAfee said it pored over Peloton&#39;s software with a &#34;critical eye&#34; to find vulnerabilities and warn users. The two companies worked together to &#34;responsibly develop and issue a patch.&#34;\n Peloton  (  PTON) released a mandatory software update that fixes the issue to users earlier this month. The security risk doesn&#39;t affect the lower-priced Peloton Bike because it uses a different type of touchscreen.\n This is an important reminder for users of all connected devices to activate automatic software updates to keep them protected against the latest attacks, according to McAfee.\n   &#34;Stay on top of software updates from your device manufacturer, especially since they will not always advertise their availability,&#34; McAfee&#39;s researchers said. &#34;Visit their website regularly to ensure you do not miss news that may affect you.&#34;\n This report marks the second security concern for Peloton in two months. In May, the fitness firm released a security update that sealed a leak that was revealing personal account information, such as a user&#39;s age, city and weight. News of that bug was  released the same day Peloton recalled its treadmill after a child died and others were injured while the machine was operating.", "posttime": "2021-06-20 00:55:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,相机,patches,黑客", "title": "Peloton在相机中修补漏洞，允许间谍骑车者 ", "title_en": "Peleton Patches Vulnerability In Camera That Allowed Spying on Riders", "transed": 1, "url": "https://www.cnn.com/2021/06/16/tech/peloton-bike-plus-hack/index.html", "via": "", "real_tags": ["漏洞", "相机", "patches", "黑客"]}, {"category": "", "categoryclass": "", "imagename": "0cf295f4538ae1816270f3e5c9b86353.png", "infoid": 1066916, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Harvester是一种非常简单的使用，但旨在有效的工具，旨在用于渗透测试或红色团队参与的早期阶段。使用它用于开放源智能（Osint）收集，以帮助确定互联网上的公司和＃39; S外部威胁景观。该工具使用包含的多个公共数据来源收集电子邮件，名称，子域，IPS和URL，其中包括：\n  Censys：Censys搜索引擎，将使用证书搜索枚举子域（需要API键，见下文。） -  Censys.io\n      GitHub代码：GitHub代码搜索引擎（需要GitHub个人访问令牌，请参阅下文。） -  www.github.com\n          Pentesttools：强大的渗透测试工具，易于使用（需要API键，而不是API Access） -  https://pentest-tools.com/home\n projecdiscovery：我们积极收集和维持互联网范围的资产数据，以增强研究和分析DNS周围的变化，以获得更好的见解 -  https://chaos.projectdiscovery.io（需要API键）\n  RapidDNS：DNS查询工具，使查询子域或同一IP的网站容易！ https://rapiddns.io.\n SecurityTrails：安全跟踪搜索引擎，世界＆＃39;历史DNS数据的最大存储库（需要API键，请参阅下文。） -  www.securitytrails.com \nShodan：Shodan Search引擎，将搜索发现的主机的端口和横幅（需要API键，见下文。） -  www.shodanhq.com  URLSCAN：Web的沙箱是一个URL和网站扫描仪 -  https://urlscan.io  猎人 - 限制在自由计划上的10个，所以您需要执行-l 10交换机  Spyse  - 需要有一个付费账户现在可以使用API ", "note_en": "theHarvester is a very simple to use, yet powerful and effective tool designed to be used in the early stages of a penetration test or red team engagement. Use it for open source intelligence (OSINT) gathering to help determine a company&#39;s external threat landscape on the internet. The tool gathers emails, names, subdomains, IPs and URLs using multiple public data sources that include:\n  censys: Censys search engine, will use certificates searches to enumerate subdomains (Requires an API key, see below.) -  censys.io\n      github-code: GitHub code search engine (Requires a GitHub Personal Access Token, see below.) -  www.github.com\n          pentesttools: Powerful Penetration Testing Tools, Easy to Use (Needs an API key and is not free for API access) -  https://pentest-tools.com/home\n projecdiscovery: We actively collect and maintain internet-wide assets data,to enhance research and analyse changes around DNS for better insights -  https://chaos.projectdiscovery.io(Requires an API key)\n  rapiddns: DNS query tool which make querying subdomains or sites of a same IP easy!  https://rapiddns.io\n securityTrails: Security Trails search engine, the world&#39;s largest repository of historical DNS data (Requires an API key, see below.) -  www.securitytrails.com\n shodan: Shodan search engine, will search for ports and banners from discovered hosts (Requires an API key, see below.) -  www.shodanhq.com\n       urlscan: A sandbox for the web that is a URL and website scanner -  https://urlscan.io\n     hunter - limited to 10 on the free plan so you will need to do -l 10 switch\n      spyse - need to have a paid account be able to use the api now", "posttime": "2021-06-20 00:54:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,emails,需要", "title": "TheHarvester：电子邮件，子域和名称收割机用于over ", "title_en": "TheHarvester: Emails, subdomains and names harvester for OSINT", "transed": 1, "url": "https://github.com/laramies/theHarvester", "via": "", "real_tags": ["电子邮件", "emails", "需要"]}, {"category": "", "categoryclass": "", "imagename": "9fd97ab1a536b084da17b6fa623b2d80.png", "infoid": 1066915, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Prusa Mini + Buddy Board船用在工厂预先闪过的引导加载程序。 在从该存储库中编译固件源代码时，Bootloader按Utils / Bo以二进制形式下载... ", "note_en": "The Prusa Mini+ Buddy board ships with a bootloader pre-flashed at the factory. When compiling the firmware source code from this repository, the bootloader is downloaded in binary form by utils/bo...", "posttime": "2021-06-20 00:53:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,程序,mini,code", "title": "prusa mini +附带实际引导加载程序的源代码在哪里？ ", "title_en": "Where is the source code for the actual bootloader shipped with the Prusa Mini+?", "transed": 1, "url": "https://github.com/prusa3d/Prusa-Firmware-Buddy/issues/1440", "via": "", "real_tags": ["代码", "程序", "mini", "code"]}, {"category": "", "categoryclass": "", "imagename": "70fcf8496746bfe6fb3bbe8ad384de18.png", "infoid": 1066913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您遵循美国或其他码头，如Chrome Unboxed，您现在就意识到谷歌/阀门在Chromeos上播放蒸汽有充足的谣言。我们知道技术碎片在那里，最近在我们最近的播客中与Luke Short讨论过。但是，我们仍在等待官方宣布，将预期的谣言变为现实。\n 虽然不是官方确认，但我通过源将保持下列信息，这将保持下列信息：\n 现在有一些QA测试人员正在聘请用于分类游戏的“Chromeos Steam Mail发布团队”，在特定配置中找到缺陷和测试性能。\n 正如我没有第一手确认，那就用一粒盐来，但我觉得足够有信心，这很可能是为了发布这一点。\n 这可能与确认一样紧密，因为我们将在Google / Chromeos或Valve实际上在此问题上宣布任何内容之前。\n 这是绝对的好消息，因为这现在会把谷歌作为一个支持Linux游戏前沿和中心的额外公司 - 而不仅仅是阀门。我们都知道谷歌是一个在心脏的Linux商店，但我们还没有看到这一切都与他们的体育平台合作。\n 谁知道，也许在回流阀将有助于通过Steam目录带来Stadia？这不是一个完全疯狂的想法。你怎么看？ \nBoIningSteam让您免费访问我们的内容，但写作文章是一个不断的投资。 我们不使用广告或赞助，帮助我们通过帕勒顿或利巴妥捐赠，使我们能够通过Patreon或LiberaPay进行可持续的活动。 您可以按照我们的时事通讯，我们的RSS Feed，我们的Mastodon型材或我们的推特饲料进行我们所做的事情。 我们还有Peertube，YouTube和LBry频道。 如果你喜欢聊天，你也可以在#boilingsteam：matrix.org上找到我们。 （什么是矩阵？） ", "note_en": "If you follow us or other sources like   Chrome Unboxed you are by now aware that there’s ample rumors about Google/Valve working on bringing Steam on ChromeOS. We know the technology pieces are there, as recently discussed with  Luke Short in our recent podcast. However, we are still waiting for an  official announcement that would turn the expected rumors into reality.\n While not an official confirmation yet, I have received the following information through a source that will remain anonymous:\n There are now some QA testers being hired to work on the “ ChromeOS Steam Launch Team” to triage games, find defects and test performance in specific configurations.\n As I don’t have first hand confirmation, take this  with a grain of salt, but I feel confident enough that this is very likely true to publish this.\n That’s probably as close as a confirmation as we are going to get before Google/ChromeOS or Valve actually announces anything on this matter.\n This is absolutely excellent news, as this would now bring Google as an additional company supporting Linux Gaming front and center –  and not just Valve. We all know that Google is a Linux shop at heart, but we have yet to see how this all fits with their  Stadia platform.\n Who knows, maybe in return Valve will help bring titles to Stadia via the Steam catalogue? That would not be a completely crazy idea. What do you think?\n   BoilingSteam lets you access our content for free, but writing articles is a constant investment. We don&#39;t use ads or sponsporship, help us make our activities sustainable by donating via   Patreon or   LiberaPay if you prefer it anonymous. You can follow what we do via our   newsletter, our   RSS feed, our   Mastodon profile or our   Twitter feed. We also have   Peertube,   Youtube and   LBRY channels. If you&#39;d like to chat, you can also find us on #boilingsteam:matrix.org. ( what is Matrix?)", "posttime": "2021-06-20 00:53:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,chromeos", "title": "Chromeos上的蒸汽：不再是谣言了 ", "title_en": "Steam on ChromeOS: Not a Rumor Anymore", "transed": 1, "url": "https://boilingsteam.com/steam-on-chromeos-not-a-rumor-anymore/", "via": "", "real_tags": ["chrome", "chromeos"]}, {"category": "", "categoryclass": "", "imagename": "60004b378724fb2d57fdd1dee2413a54.jpg", "infoid": 1066912, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罐装金枪鱼蛋白质高，脂肪低，迄今为止最受欢迎的货架稳定的海鲜。\n 它也可以是神秘的，可疑和丑闻。正如华盛顿邮政在1月底报道的那样，地铁 - 世界上最大的三明治链 - 目前在加利福尼亚州的课程诉讼中，声称其金枪鱼三明治“是完全妨碍金枪鱼作为成分。”\n 新闻发布后，笑话迅速遵循。 Jessica Simpson（谁是着名的不知道海的鸡是否在2003年的鸡或金枪鱼）推文：“这是@Subway。这是令人困惑的。“竞争对手Jimmy John's开始向拍摄主题发送电子邮件爆炸：“金枪鱼👏三明治👏应该👏使用👏真实👏金枪鱼”。\n 其部分地铁已经分裂地否认了这一指控。 “在加利福尼亚州提交的投诉中的指控没有真相，”一位发言人写在纽约时报的电子邮件中。 “地铁将100％的煮熟的金枪鱼送到其餐厅，与蛋黄酱混合，并用新鲜的三明治，包裹和由我们的客人享受的沙拉使用。”\n 然而，从记者的角度来看，案件进一步调查 - 如果你愿意，深潜力。\n 因此，我采购了超过60英寸的地铁金枪鱼三明治。我拆除并冻结了金枪鱼肉，然后将其全国各地发布到商业食品测试实验室。我花了几周与金枪鱼专家聊天。我等待，等待，直到实验室结果回来。\n   罐装金枪鱼有其顽皮和反对者，但它肯定卖。据尼尔森控股，全球数据和分析公司，在美国，大约7亿个金枪鱼队在去年销售。 \n“我认为这是它的一部分是怀旧的，”食子纽约的首席食品评论家Ryan Sutton说，当被要求解释罐头鱼的升级时。 “这是很多人在饮食中。”\n 19世纪初的金枪鱼三明治崛起，当时人们实现罐头鱼可以转化为没有烹饪的快速和便宜的膳食。到20世纪50年代，金枪鱼在普及的鲑鱼中超过了鲑鱼，并且在20世纪80年代，尽管鱼类中的高水平汞造成了令人担忧，但估计的85％的美国人在他们的储藏室中有罐装金枪鱼。\n 经过几十年的金枪鱼消费量下降，2018年华尔街日记学故事表明，千禧一代被责备（“许多人不能打开和排出罐头”），虽然新的品牌提供了更多可持续选择的选择是看到他们的市场分享成长。\n 然后，在2020年，罐装货物充满了紧急性，因为购物者争先恐后地购买货架稳定的食物，不知道大流行可能持续多久。这一年度，根据Grand View Research，全球罐装金枪鱼市场的价值高达85.7亿美元。\n 地铁在全球拥有近40,000个地点，其中大约有一半的地区（作为Grub Street一旦计算出来，曼哈顿的地铁之间的平均距离为1,154英尺，或大约四个半块）。）地区的总数已经下降自2015年以来，纽约时报调查的趋势部分地部分地归因于有针对性和操纵的检查。\n 尽管如此，地铁的店面普遍存在，据该公司称，其金枪鱼三明治是最好的销售。 “地铁的金枪鱼三明治在我们最喜欢的三明治中排名第一，”连锁店的发言人在一封电子邮件中写道。\n   但是，可以安全地说，诉讼中的原告 - 不爱地铁的金枪鱼，他们认为是“除了金枪鱼的任何事情”，根据他们从1月份的申请。 （Dhanowa女士和Amin女士的法律团队拒绝对本条的案件发表评论。） \n原告究竟认为含有的三明治，他们不会说。但在1月份的申请中，他们据称，地铁通过销售产品“虚假宣传为”金枪鱼“，以便收取”优惠价格“。\n 当被问及案件的进展时，地铁的发言人在提交了原始投诉时重申了声明。\n “我们的金枪鱼的味道和质量使其成为地铁最受欢迎的产品之一，这些毫无指控威胁要损坏我们的特许经营者，”她在电子邮件中写道。\n “鉴于事实，诉讼构成了对地铁品牌和善意的鲁莽和不当的攻击，”她补充道。\n 通过所有这一点，我开始寻找可以测试地铁产品样本的商业实验室。少数人礼貌地拒绝了我的询问，引用了使我的金枪鱼的技术限制和公司政策有资格分析。最终，我发现自己在手机上用一个专门从事鱼类测试的实验室的发言人。他同意测试金枪鱼，但要求在本文中没有命名的实验室，因为他不想危及直接与美国最大的三明治链一起工作的机会。\n 对于大约500美元，他的实验室可以进行PCR测试 - 这迅速增加了数百万或数十亿份特定的DNA样品 - 并试图告诉我这种物质是否包含五种不同的金枪鱼种类中的五种。\n  根据海鲜名单，由美国食品和药物管理局编制，有15种游牧咸水鱼可以标记为“金枪鱼”。 \n地铁的金枪鱼和海鲜采购声明称，该连锁店仅销售Skipjack和Yellowfin Tuna  - 物种，实验室将被认为是Katsuwonus Pelamis和T. Albacares。\n 在它落在地铁三明治之前，这种金枪鱼，如大多数商业销售的金枪鱼，被渔民在独家经济区工作。 （例如，距离每个国家海岸大约200海里的区域;美国，超过13,000英里的海岸线，控制世界上最大的e.e.z.，含有340万广场海洋海洋。）\n 有五个组织在这些经济区内管理区域渔业。他们的工作是执行法规，并确保海洋生态系统的掠夺者留在海洋中，而不是在我们的盘子里，“斯坦福大学海洋科学教授，他共同指导了斯坦福的金枪鱼研究和保护中心。\n “在可持续水平上删除是许多人的优先事项，”博士在电子邮件中添加了“但仅限少数人练习。”例如，Bluefin Tuna现在是几十年过度捕捞后的濒危物种。\n 这些渔业使用三种方法来捕获金枪鱼：钱包塞，龙亭和杆线钓鱼。\n 极线钓鱼是这种好运的人参与：坐在船上并一次带来一个抓住。较大的钓鱼业务往往依赖于其他两种方法。\n 钱包Seiners落下了一所鱼类周围的一个大圆墙，然后“钱包”底部关闭，以防止鱼逃逸。龙坡将一个30或40英里长的线放入水中，然后等待鱼以捕获数百（或数千）的钩子。 \n然后将鱼类清洁，分类，最终，罐头。加泰罗尼岛海上产品总裁Dave Rudie（世界上前金枪鱼首都），与罐头的罐头一起销售每年大约一百万只罐头的金枪鱼，其中10,000个含有来自他的Bigeye。\n “真正完美的彩色金枪鱼 - 最聪明的红色 - 去寿司酒吧，”Rudie先生说。 “金枪鱼在烹饪中有点漂亮的颜色会更加漂亮，你在外面坐着，它是在中间的原始。”\n “我们还获得了一些更多的灰色金枪鱼，那些脱色金枪鱼，我们将其切割并冻结，”他继续。 “我们将它送到俄勒冈州的罐头。”\n 罐头往往遵循相同的一般过程。 “大多数罐头金枪鱼被Purse Seiners抓住，它在船上冻结了，”Rudie先生说。 “他们要把它带到罐头里，他们最有可能会煮它一次，然后他们会把肉从骨头上拉，他们会把它放在一个罐子里，然后它会被腐败 - 煮熟一点点 - 在他们密封罐头之前最后一次消毒它。“\n 然后有标签问题。当EASOCA是一个专注于海洋宣传的组织，在2010年代初进行了最大的“鱼类欺诈”调查之一，发现“海鲜可能会误标定为26至87％的常用鱼类，如石斑鱼，鳕鱼和鲷鱼，伪装的鱼不太理想，更便宜或更容易获得。“\n  这种区别可能是不可取的，或者所有令人不安的是每个消费者。但是当你试图弄清楚地铁金枪鱼三明治中的东西时，他们就重要了。\n 我被告知，如果我把地铁金枪鱼的Ziploc送入了一个带有几个冰袋的发泡胶水包装凉爽，并邮寄到全国各地，实验室可以测试它。 \n为了采购三明治标本，我访问了洛杉矶周围的三个不同地铁站。只有在三明治上只订购金枪鱼似乎没有额外的蔬菜，奶酪或敷料 - 因为实验室已经对识别至少一次煮熟的鱼的挑战，与梅奥混合，冷冻并在全国各地发货。\n 我的第一个冻结的金枪鱼装运，在运输过程中丢失了150美元的费用。但第二次尝试，样本完好无损。在两到三周后，实验室会告诉我它是否包含任何金枪鱼。\n  虽然地铁拒绝披露其金枪鱼供应商，但斯契，曾在加利福尼亚州的地铁经理三年，分享了有关该产品如何到达她的地点的一些细节。 （圣人要求不害怕雇主的报复害怕她的全名。）\n “金枪鱼在箱子里面，有六个铝袋，它就像一个压制的真空密封板块的金枪鱼，”圣人说。 “这是片状的，它显然在水中浸泡 - 就像盐水一样，所以它只是浸泡在盐水中 - 它只是片刻的金枪鱼。我们只是用手散开它“ - 当然 - ”和梅奥混合在一起。“\n 圣人说，每个商店都遵循公司指导方针，这指示某些肉类可以在商店的冷藏夹心棒中留出24,48或72小时。\n 她说，金枪鱼有72小时的抗议生活（地铁发言人也确认了时间框架），虽然圣人说她的商店经常在击中三天之前取代它。 “我们都同意 - 我们所有人都在那里工作 - 它得到了粗略的，”她说。\n 这是一个前地铁“三明治艺术家”，他在一年内坐在一年的地位，她说她无法想象哪些激励地铁必须用其他任何东西取代金枪鱼。 （Jen还要求不害怕雇主的报复害怕她的全名。） \n“我一直在处理这个金枪鱼，”詹登说道。 “成分在包装上，金枪鱼是一个相对便宜的肉。没有必要让替代金枪鱼使它更便宜。“\n 作为地铁金枪鱼的偶尔消费者，Jen表示她确信它的鱼。\n “我个人对鱼有一个真正弱的胃，这就是我们如何知道金枪鱼是真实的，”她说。 “上次我吃了它，我呕吐了。”\n 但圣人说，除了满足这些食品安全标准之外，她并不是很关心这个金枪鱼是否真实。\n “我们根本不真实地关心，”她对自己和她的三明治艺术家说。 “我猜，这可能听起来很奇怪，但客户会把它带起来，我们只是去，”我不知道。你想要什么样的奶酪？“”\n   “样品中没有出现可增加的金枪鱼DNA，因此我们没有从DNA获得扩增产物，”电子邮件读取。 “因此，我们无法识别物种。”\n 来自实验室的发言人提供了一些分析。 “有两个结论，”他说。 “一个人，这是如此大量处理，无论我们可以拉出什么，我们都无法识别。或者我们有一些，没有那么金枪鱼。“ （地铁拒绝评论实验室结果。） \n为了公平，当Inside Edition在今年早些时候从皇后区出发的三个地铁地区发送样本时，实验室发现标本确实是金枪鱼。\n 即使原告已经软化了原来的主张。在从6月份的新申请中，他们的投诉不在于地铁的金枪鱼根本是金枪鱼，但无论是“100％可持续地抓住鲣鱼和黄鳍金枪鱼”。\n 通过所有测试，有主要的警告需要考虑。一旦金枪鱼被煮熟，它的蛋白质变得变性 - 意味着鱼的特征性质可能被摧毁，这使得难以辨认，如果不是不可能的话，才能识别。\n 我所说的所有人也询问了为什么地铁会换掉其金枪鱼。\n “我不认为三明治的地方会故意误导，”来自卡塔利娜海上产品的鲁迪先生说。 “他们买了一罐金枪鱼，说'金枪鱼。如果在这种情况下有任何欺诈，它发生在罐头里。”\n Peter Horn是一个在PEW慈善信托基金会的非法捕鱼项目的主任，同意如果是这种情况，难以将责任归咎于地铁。\n “在辩护地铁，或者很多这些鱼贩，进一步你从骨头中捞出鱼，难以理解的是那种鱼是越来越难的，”他说。 \n“我们大多数人看到骨骼上的鱼，皮肤完好无损，我们可以识别出什么样的鱼，”他继续。 “你把头和尾巴放下，变得更加困难，但你仍然可以识别它。你把皮肤脱掉了，你把它从骨头上拿走了，你把它切成了切片，然后你只是有点说，'对，颜色和纹理是什么？“\n 索特顿先生，食品评论家建议这一事件可以鼓励消费者对他们的食物来自哪里感兴趣。\n “我希望这样的问题会导致全国各地的更多人，各地都花更多的时间考虑供应食物的环境，劳动和经济供应链的每一步，”他说。\n 甚至由于地铁价格超过了5美元的脚踏板，霍尔表示，该公司的明显廉价三明治提出了比其金枪鱼的完整性更重要的问题。\n “我们不能继续对价格下跌，”霍恩先生说，“因为我们都希望摇滚底部价格上的一切，这意味着什么，某个地方会被剥削，无论是人还是人海洋 - 可能都在。“ ", "note_en": "Canned tuna is high in protein, low in fat and by far the  most popular shelf-stable seafood in the United States.\n It can also be mysterious, questionable and scandalous. As  The Washington Post reported in late January, Subway — the  world’s largest sandwich chain — is currently facing a class-action lawsuit in the state of California that claims its tuna sandwiches “are completely bereft of tuna as an ingredient.”\n After the news broke, the jokes swiftly followed. Jessica Simpson (who  famously didn’t know whether Chicken of the Sea was chicken or tuna back in 2003)  tweeted: “It’s OK @SUBWAY. It IS confusing.” Jimmy John’s, a competitor, started sending email blasts with subjects like: “Tuna 👏 Sandwiches 👏 Should 👏 Use 👏 Real 👏 Tuna 👏.”\n Subway, for its part, has categorically denied the allegations. “There simply is no truth to the allegations in the complaint that was filed in California,” a spokeswoman wrote in an email to The New York Times. “Subway delivers 100 percent cooked tuna to its restaurants, which is mixed with mayonnaise and used in freshly made sandwiches, wraps and salads that are served to and enjoyed by our guests.”\n From a reporter’s perspective, however, the case bore further investigation — a deep dive, if you will.\n So, I procured more than 60 inches worth of Subway tuna sandwiches. I removed and froze the tuna meat, then shipped it across the country to a commercial food testing lab. I spent weeks chatting with tuna experts. I waited, and waited, until the lab results came back.\n   Canned tuna has its die-hards and naysayers, but it certainly sells. According to Nielsen Holdings, a global data and analytics company, about 700 million cans of tuna were sold in the U.S. over the last year.\n “I think part of it is just nostalgia,” said Ryan Sutton, the chief food critic for  Eater NY, when asked to explain the ascendancy of the canned fish. “It’s what a lot of people grew up eating.”\n Tuna sandwiches rose to prominence  in the early 1900s, when people realized canned fish could translate into a quick and cheap meal that involved no cooking. By the 1950s,  tuna had surpassed salmon in popularity, and during the 1980s, an  estimated 85 percent of Americans had canned tuna in their pantries despite growing concerns about high levels of  mercury in the fish.\n After a decades-long decline in tuna consumption, a  2018 Wall Street Journal story suggested that millennials were to blame (“many can’t be bothered to open and drain the cans”), though newer brands offering more sustainable options were seeing their market share grow.\n Then, in 2020, canned goods took on great urgency as shoppers  scrambled to buy shelf-stable food, not knowing how long the pandemic might last. That year, the global canned tuna market was valued at $8.57 billion, according to  Grand View Research.\n Subway has nearly 40,000 locations worldwide, about half of them in the U.S. (As  Grub Street once calculated, the average distance between Subways in Manhattan is 1,154 feet, or about four and a half blocks.) The total number of locations has been  in decline since 2015, a trend that a New York Times investigation attributed, in part, to targeted and manipulated inspections.\n Still, Subway’s storefronts are ubiquitous, and according to the company, its tuna sandwiches are some of the best selling. “Subway’s tuna sandwich ranks among our guests’ favorite sandwiches,” the chain’s spokeswoman wrote in an email.\n   But it’s safe to say that Karen Dhanowa and Nilima Amin — the plaintiffs in the lawsuit — do not love Subway’s tuna, which they believe is “anything but tuna,” according to their filing from January. (Ms. Dhanowa and Ms. Amin’s legal team declined to comment on the case for this article.)\n What exactly the plaintiffs believed the sandwiches contained, they wouldn’t say. But in their filing from January, they alleged that Subway has deliberately misled customers by selling products “falsely advertised as ‘tuna’” in order to charge a “premium price.”\n Subway’s spokeswoman, when asked about the progress of the case, reiterated the statement shared when the original complaint was filed.\n “The taste and quality of our tuna make it one of Subway’s most popular products and these baseless accusations threaten to damage our franchisees,” she wrote in an email.\n “Given the facts, the lawsuit constitutes a reckless and improper attack on Subway’s brand and goodwill,” she added.\n With all of that in mind, I began searching for a commercial lab that could test a sample of Subway’s product. A handful of them politely declined my inquiries, citing technical limitations and company policies that made my tuna ineligible for analysis. Eventually, I found myself on the phone with a spokesman for a lab that specializes in fish testing. He agreed to test the tuna but asked that the lab not be named in this article, as he did not want to jeopardize any opportunities to work directly with America’s largest sandwich chain.\n For about $500, his lab could conduct a PCR test — which rapidly makes millions or billions of copies of a specific DNA sample — and try to tell me whether this substance included one of five different tuna species.\n  According to  the Seafood List, which is compiled by the U.S. Food and Drug Administration, there are 15 species of nomadic saltwater fish that can be labeled “tuna.”\n Subway’s  tuna and seafood sourcing statement says the chain only sells skipjack and yellowfin tuna — species that a lab would recognize as Katsuwonus pelamis and T. albacares.\n Before it lands on a Subway sandwich, that tuna, like the majority of commercially sold tuna, is caught by fishermen working in exclusive economic zones. (E.E.Z.s are areas that extend roughly 200 nautical miles from each country’s coast; the U.S., with over 13,000 miles of coastline, controls the largest E.E.Z. in the world, containing 3.4 million square nautical miles of ocean.)\n There are five organizations that manage regional fisheries within those economic zones. Their job is to enforce regulations and “make sure the predators of ocean ecosystems remain in the ocean and not on our plates,” according to Barbara Block, a professor of marine sciences at Stanford University who co-directs Stanford’s Tuna Research and Conservation Center.\n “Removal at sustainable levels is a priority of many,” Dr. Block added in an email, “but practiced by few.” Bluefin tuna, for example, is now an endangered species following  decades of overfishing.\n There are three methods these fisheries use to catch tuna: purse seining, longlining and pole-and-line fishing.\n Pole-and-line fishing is the kind hobbyists take part in: sitting on a boat and bringing in one catch at a time. Larger fishing operations tend to rely on the other two methods.\n Purse seiners drop a large, round wall of netting around a school of fish and then “purse” the bottom of the net shut to prevent fish from escaping. Longliners drop one 30- or 40-mile-long line into the water, then wait for the fish to catch on hundreds (or thousands) of hooks.\n Then the fish is cleaned, sorted and, eventually, canned. Dave Rudie, the president of Catalina Offshore Products in San Diego (the former  tuna capital of the world), works with a cannery that sells about a million cans of tuna each year, 10,000 of which contain bigeye sourced from him.\n “The really perfect colored tuna — the brightest red — goes to the sushi bars,” Mr. Rudie said. “Tuna that’s a little bit paler in color will go more for the cooking, where you sear the outside and it’s raw in the middle.”\n “We also get some more off-color tuna and that off-color tuna, we cut it up and freeze it,” he continued. “And we send it up to a cannery in Oregon.”\n Canneries tend to follow the same general process. “Most canned tuna is caught by purse seiners and it’s frozen on the boat,” Mr. Rudie said. “They’re going to take it to a cannery, where they’re most likely going to cook it once, and then they’re going to pull the meat off the bone, and they’re going to put it in a can, and then it’s going to get retorted — cooked a little bit — to sterilize it the last time before they seal the can.”\n Then there’s the issue of labeling. When  Oceana, an organization focused on ocean advocacy, conducted one of the largest “fish fraud” investigations in the early 2010s, it discovered that “seafood may be mislabeled as often as  26 to 87 percent of the time for commonly swapped fish such as grouper, cod and snapper, disguising fish that are less desirable, cheaper or more readily available.”\n  Such distinctions might not be noticeable, or all that troubling, to every consumer. But when you’re trying to figure out what’s in a Subway tuna sandwich, they matter.\n I was told that if I packed a Ziploc of Subway tuna into a Styrofoam shipping cooler with a few ice packs and mailed it across the country, the lab could test it.\n To procure the sandwich specimens, I visited three different Subway locations around Los Angeles. It seemed logical to order only tuna on the sandwiches — no extra vegetables, cheese or dressing — as the lab was already wary about the challenges of identifying a fish that’s been cooked at least once, mixed with mayo, frozen and shipped across the country.\n My first frozen tuna shipment, which cost upward of $150, was lost in transit. But on second try, the sample arrived intact. In two to three weeks, the lab would tell me whether it contained any tuna.\n  Though Subway declined to disclose its tuna suppliers, Sage, who has been a Subway manager in California for three years, shared some details about how the product arrives at her location. (Sage asked not to use her full name out of fear of reprisal from her employer.)\n “The tuna comes in a case and inside the case, there are six aluminum pouches and it’s just like a pressed, vacuum sealed slab of tuna,” Sage said. “It’s flaky and it’s clearly soaked in water — it’s like a brine, so it’s just soaked in salt water — and it’s just flaky tuna. We just spread it apart with our hands” — gloved, of course — “and mix it with mayo.”\n Sage said that each store follows corporate guidelines, which instruct that certain meats can stay out in the store’s refrigerated sandwich bar for up to 24, 48 or 72 hours.\n Tuna, she said, has a 72-hour counter life (the time frame was also confirmed by Subway’s spokeswoman), though Sage said her store often replaces it before it hits three days. “We all agree — all of us that work there — it gets kind of gross,” she said.\n Jen, a former Subway “ sandwich artist” who worked at a location in Iowa for a year, said she couldn’t imagine what incentive Subway would have to replace the tuna with anything else. (Jen also asked not to use her full name out of fear of reprisal from her employer.)\n “I dealt with the tuna all the time,” Jen said. “The ingredients are right on the package and tuna is a relatively cheap meat. There would be no point to making replacement tuna to make it cheaper.”\n And as an occasional consumer of Subway’s tuna, Jen said she’s confident it’s fish.\n “I personally have a really weak stomach to fish, which is how we know the tuna is real,” she said. “Last time I ate it, I puked my guts out.”\n But Sage said that beyond meeting these food safety standards, she’s not very concerned about whether this tuna is real or not.\n “We don’t really care at all,” she said of herself and her fellow sandwich artists. “Which may sound kind of weird, I guess, but customers will bring it up and we just go, ‘I don’t know. What kind of cheese do you want?’”\n   “No amplifiable tuna DNA was present in the sample and so we obtained no amplification products from the DNA,” the email read. “Therefore, we cannot identify the species.”\n The spokesman from the lab offered a bit of analysis. “There’s two conclusions,” he said. “One, it’s so heavily processed that whatever we could pull out, we couldn’t make an identification. Or we got some and there’s just nothing there that’s tuna.” (Subway declined to comment on the lab results.)\n To be fair, when  Inside Edition sent samples from three Subway locations in Queens out for testing earlier this year, the lab found that the specimens were, indeed, tuna.\n Even the plaintiffs have softened their original claims. In a new filing from June, their complaints centered not on whether Subway’s tuna was tuna at all, but whether it was “100% sustainably caught skipjack and yellowfin tuna.”\n With all testing, there are major caveats to consider. Once tuna has been cooked, its protein becomes denatured — meaning that the fish’s characteristic properties have likely been destroyed, making it difficult, if not impossible, to identify.\n All of the people I spoke with also questioned why Subway would swap out its tuna.\n “I don’t think a sandwich place would intentionally mislabel,” Mr. Rudie from Catalina Offshore Products said. “They’re buying a can of tuna that says ‘tuna.’ If there’s any fraud in this case, it happened at the cannery.”\n Peter Horn, the director of the  Ending Illegal Fishing Project at the Pew Charitable Trusts, agreed that it would be difficult to place blame on Subway if this were the case.\n “In the defense of Subway, or quite a lot of these fishmongers, the further you get the fish from the bone, the harder it is to recognize what that fish is,” he said.\n “Most of us see the fish on the bone, skin intact, and we can recognize what sort of fish that is,” he continued.  “You drop the head and the tail off, it becomes more difficult, but you can still probably recognize it. You take the skin off it, you take it off the bone and you cut it into slices then you’re only sort of saying, ‘Right, what’s the color and texture?’”\n Mr. Sutton, the food critic, suggested that this incident could encourage consumers to take more interest in where their food comes from.\n “I would hope that an issue like this would cause more people across the country and all across the world to spend more time thinking about every step of the environmental, labor and economic supply chains that supply their food,” he said.\n And even as Subway’s prices have risen beyond the days of $5 footlongs, Mr. Horn said the company’s notably cheap sandwiches raise more important questions than the integrity of their tuna.\n “We can’t just continue to have a downward pressure on the price,” Mr. Horn said, “because if we all want everything at rock bottom prices, that means something, somewhere is going to be exploited, whether that’s people or the ocean — probably both.”", "posttime": "2021-06-20 00:52:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金枪鱼,tuna", "title": "实验室测试在地铁金枪鱼中找到“没有金枪鱼DNA” ", "title_en": "Lab test finds “no tuna DNA” in Subway tuna", "transed": 1, "url": "https://www.nytimes.com/2021/06/19/style/subway-tuna-sandwich-lawsuit.html", "via": "", "real_tags": ["金枪鱼", "tuna"]}, {"category": "", "categoryclass": "", "imagename": "5fff342aa4ac846753b14f93fc041a47.webp", "infoid": 1066911, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“当加密从万亿岁下降时，或者Meme股来自数十亿美元，#mainstreet损失将接近国家的规模，”伯里发了推文。 ", "note_en": "'When crypto falls from trillions, or meme stocks fall from tens of billions, #MainStreet losses will approach the size of countries,' Burry tweeted.", "posttime": "2021-06-20 00:52:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "母亲,burry,meme", "title": "迈克尔伯里警告了“所有撞车的母亲”即将来临 ", "title_en": "Michael Burry warns the 'mother of all crashes' is coming", "transed": 1, "url": "https://markets.businessinsider.com/currencies/news/big-short-michael-burry-warns-meme-stocks-crypto-crash-coming-2021-6-1030534935", "via": "", "real_tags": ["母亲", "burry", "meme"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066910, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索递归岛或湖泊是一个岛屿或湖泊岛屿或湖泊。 [1]\n      该岛在技术上是人为的，因为它是由于丹尼尔约翰逊大坝的创造而淹没了一个较小的现有湖泊所做的\n 如果Sääminginsalo被认为是一个岛屿，因为它由人工运河（Raikuu Canal）与一侧分开。\n       如果Kotasaari被认为是一个岛屿，因为它由人工运河（Summa Canal）与一侧分开。\n    火山口湖本身是由迈阿马山山爆发形成的火山口;一系列较小的爆发后来形成了Cindera地板上的煤渣锥，其中巫师岛最高，现在唯一可见湖面上方的表面。 [3]\n      如果Sääminginsalo被认为是一个岛屿，因为它由人工运河（Raikuu Canal）与一侧分开。由一些[谁是什么？]成为一个湖的一个湖的世界上最大的岛屿。另一个岛屿，苏布斯萨里（62°5'28“N 28°59'28”E / 62.09111°N 28.99111°E / 62.09111; 28.99111）在Hanhijärvi，也位于Sääminginsalo，大约大约一半Kokkosaari。\n 在Chaunoy湖中存在超过10个岛屿，其中最大的岛屿最大的少于十分之一的内容 \n如果Kotasaari被认为是一个岛屿，因为它由人工运河（Summa Canal）与一侧分开。\n                            大岛屿看起来像怀孕的袋鼠，较小的岛屿看起来像它的胚胎。莱茵河正在漂浮到湖泊＆＃34; Knielinger See＆＃34;在Knielingen.\n   在西南11公里的湖到湖中，含有较大的岛屿。这个岛屿湖中没有其他岛屿\n     岛上的湖被认为有一个名字，但尚未被识别出来\n 直到2020年，[13] Vulcan Point是一个在菲律宾卢塞湖田湖火山岛的主要火山口湖中存在的岛屿。 [14]在2020塔尔火山喷发期间，主要的火山口湖蒸发。 [13]\n              穆斯博尔德被声称存在于美国湖瑞安岛上的穆斯特普罗斯岛的季节性池塘，在美国湖上的斯莱·罗伊尔岛，[20]使其成为第四阶岛。在2020年，对岛屿的探险无法找到它。 [21]\n     ^是一个半岛，直到1906年，当运河被挖掘时，将其从内地分开。 [5] \n^ a b c记录，吉尼斯世界（2018年8月28日）。 2019年吉尼斯世界纪录。 第40-41页。 ISBN 978-1-912286-43-0。  ^ a b c d e f g h i j k l m n o海岸线 - 湖泊（ranta10），2020.芬兰环境中心，ILLY中心。 在CC-BY-4.0下发布。  ^＆＃34;一个湖的岛上在一个岛上的一个湖的一个湖和＃34; EarthObservatory.nasa.gov。 2015年2月22日。  ^ a b freedman，安德鲁; Meko，Tim; Karklis，Laris（1月17日）。 ＆＃34; Taal Volcano＆＃39; Crater Lake几乎是空的＆＃34; 华盛顿邮报。  ^＆＃34;一些有趣的岛屿和湖泊＆＃34; Topografisch Verbonded Elbruz。 2013年9月19日从原件存档。  ^ Valenzuela，奥兰多。 ＆＃34; Puerta Laguna Misteriosa [门至神秘泻湖]＆＃34; El Nuevo Diario（西班牙语）。  ^＆＃34;世界上最大的湖泊最大的岛屿＆＃34; Albert Lea Tripune。 2009年7月21日。 ", "note_en": "Jump to navigation  Jump to search  A  recursive island or lake is an  island or  lake that is itself within an island or lake.  [1]\n      The island is technically artificial as the lake it is in was made by flooding a smaller existing lake due to the creation of the  Daniel-Johnson dam\n If Sääminginsalo is considered an island, as it is separated from one side by an artificial canal ( Raikuu canal).\n       If Kotasaari is considered an island, as it is separated from one side by an artificial canal ( Summa canal).\n    Crater Lake itself is a caldera formed by the eruption of  Mount Mazama; a series of smaller eruptions later formed cinder cones on the caldera floor, of which Wizard Island is the highest, and the only one now visible above the lake&#39;s surface.  [3]\n      If Sääminginsalo is considered an island, as it is separated from one side by an artificial canal (Raikuu canal). Claimed by some [   by whom?] to be the world largest island in a lake in an island in a lake. Another island, Suursaari (      62°5′28″N  28°59′28″E ﻿ / ﻿  62.09111°N 28.99111°E ﻿ /  62.09111; 28.99111) in Hanhijärvi, is also located in Sääminginsalo, and it is about half the size of Kokkosaari.\n There exist more than 10 other islands in lake chaunoy, the largest of which is less than a tenth of the size of the one mentioned here\n       If Kotasaari is considered an island, as it is separated from one side by an artificial canal (Summa canal).\n                            The greater islands looks like a pregnant kangaroo, and the smaller island looks like its embryo. River  Rhine is floating west to the lake &#34;Knielinger See&#34; in  Knielingen\n   In a lake 11 km south west to the lake that contains the larger island. There are no other island in this islands lake\n     Lake that island is on is believed to have a name but as of yet has not been identified\n Until 2020,  [13]  Vulcan Point was an island that existed in  Main Crater Lake on  Volcano Island in  Lake Taal on  Luzon in the  Philippines.  [14] Main Crater Lake evaporated during the  2020 Taal Volcano eruption.  [13]\n              Moose Boulder was claimed to exist in the  seasonal pond of Moose Flats on Ryan Island in  Siskiwit Lake on  Isle Royale in  Lake Superior in the United States,  [20] making it a fourth order island. In 2020, an expedition to the island was unable to find it.  [21]\n     ^  Was a peninsula until 1906 when a canal was dug, separating it from the mainland.  [5]\n   ^     a     b     c   Records, Guinness World (August 28, 2018).   2019 Guinness World Records. pp. 40–41.  ISBN   978-1-912286-43-0.\n      ^     a     b     c     d     e     f     g     h     i     j     k     l     m     n     o   Shoreline - lakes (Ranta10), 2020.  Finnish Environment Centre, ELY centres. Released under CC-BY-4.0.\n    ^     &#34;Island in a Lake on an Island in a Lake on an Island&#34;.  earthobservatory.nasa.gov. February 22, 2015 .\n  ^     a     b    Freedman, Andrew; Meko, Tim; Karklis, Laris (January 17, 2020).  &#34;Taal volcano&#39;s crater lake is nearly empty&#34;.  Washington Post.\n ^     &#34;Some interesting islands and lakes&#34;. Topografisch Verbond Elbruz.  Archived from the original on September 19, 2013 .\n    ^    Valenzuela, Orlando.  &#34;Puerta laguna misteriosa [Door to mysterious lagoon]&#34;.  El Nuevo Diario (in Spanish).\n  ^     &#34;Largest island on the largest lake in the world&#34;.  Albert Lea Tribune. July 21, 2009 .", "posttime": "2021-06-20 00:52:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "岛屿,islands", "title": "岛上的岛屿在岛上的岛屿上的岛屿上的岛屿 ", "title_en": "Islands in lakes on islands in lakes on islands", "transed": 1, "url": "https://en.wikipedia.org/wiki/Recursive_islands_and_lakes#Islands_in_lakes_on_islands_in_lakes_on_islands", "via": "", "real_tags": ["岛屿", "islands"]}]