[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1006567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "保加利亚布尔加斯-索非亚环球报(Sofia Globe)报道称，保加利亚南部黑海海岸的一个建筑工地正在挖掘14个可追溯到公元前5世纪左右的仪式坑。还发现了至少10个额外的坑。地区历史博物馆的米罗斯拉夫·克拉斯纳科夫(Miroslv Klasnakov)表示，已经找到了人和动物的骨头、煤以及陶瓷碗和双筒的碎片。他补充说，大部分陶器都是当地制造的。想要了解在公元3世纪色雷斯人的葬礼中发现的拟人油船，可以去巴斯巴迪(Bath Buddy)。", "note_en": "BURGAS, BULGARIA—  The Sofia Globe reports that 14 ritual pits dated to about the fifth century B.C. are being excavated at a construction site on southern Bulgaria’s Black Sea coast. At least ten additional pits have also been found. Miroslav Klasnakov of the Regional History Museum said human and animal bone, coal, and fragments of ceramic bowls and amphoras have been recovered. Most of the pottery was made locally, he added. To read about an anthropomorphic oil vessel found in a third-century A.D. Thracian burial, go to &#34; Bath Buddy.&#34;", "posttime": "2020-06-15 04:36:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "仪式,ritual", "title": "保加利亚发现色雷斯人仪式坑", "title_en": "Thracian Ritual Pits Discovered in Bulgaria", "transed": 1, "url": "https://www.archaeology.org/news/8795-200612-bulgaria-ritual-pits", "via": "", "real_tags": ["仪式", "ritual"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我经常进入一个奇怪的睡眠周期，我睡得很晚，在上午晚些时候甚至下午醒来。\n这通常不是因为我“晚上工作得更好”--实际上我觉得我可能在晚上工作得更差。或者更确切地说，如果夜里太晚了，我会下意识地更多地懈怠，或者也不能集中精力。\n这并不是因为我“更喜欢晚上醒着”。是的，天气更凉爽，更安静，但这不是原因。\n不，那是因为我一直在努力在一天中取得更多的成就。\n比方说，我按照“正常”的作息时间睡觉--早起，午夜前睡觉，诸如此类。如果我对白天取得的成绩不满意，我会通过熬夜来挤出一点时间。\n这会产生连锁反应，让我晚一点醒来(假设我没有要做的事)。\n重复这个足够多的次数，我突然在中午醒来，然后在太阳开始升起的同时入睡！\n我最终不得不做一个“改正日”，让我保持更长时间的清醒，并在“正常”时间睡觉。\n我不认为这一定是健康的。我想我需要学会“放手”，第二天取得更多的成就；我可能会更精神饱满，更渴望工作。\n我不这样做的主要原因是，在我选择推迟睡眠时间表的晚上，我处于一种“心流状态”，而早上我不一定会处于这种状态。\n所以我猜“经理时间表”上的人比“制造者时间表”上的人更容易维持规律的睡眠时间表；制造者确实需要“心流状态”。\n也许我应该换一种方式试试。如果我想“推动”实现更多一点，我应该记下我需要做什么，直接去睡觉，但把我的闹钟设为提前一个小时才能完成？\n另外，我参加聚会迟到了，不过我最近有一个推特账号，你可以在这里关注。", "note_en": "I often end up in a weird sleep cycle where I sleep at a very late time and wake up during the late morning or even during the afternoon.\n This usually isn’t because I “work better at night” - I actually feel like I probably work worse at night. Or rather, if it’s too late in the night, I subconsciously slack off more or can’t focus as well.\n And it isn’t because I “prefer to be awake at night”. I do - it’s cooler and quieter - but that’s not the reason.\n No, it’s because  I keep trying to push to achieve more in a day.\n Let’s say I’m sleeping at a ‘normal’ sleep schedule - waking up early, sleeping before midnight, whatever. If I’m not happy with what I achieved during the day, I try to squeeze in  a little bit more by staying up late.\n This has a knock-on effect of making me wake up later (assuming that I don’t have a commitment to attend to).\n Repeat this enough times, and suddenly  I’m waking up during the middle of the day, and heading to sleep at around the same time that the sun is beginning to rise!\n I end up having to do a ‘correction day’ where I stay awake for longer and sleep at a ‘normal’ time.\n I don’t think that this is necessarily healthy. I think that I need to learn to “let it go” and just achieve more the next day; I’ll probably be more refreshed and eager to work.\n The main reason that I don’t do that is because I’m in a “flow state” during the nights when I choose to push the sleep schedule, which I wouldn’t necessarily be in during the morning.\n So I’d guess that it’s easier for someone on a “ Manager’s Schedule” to maintain a regular sleep schedule than someone on a “Maker’s Schedule”; the maker has a real need for a ‘flow state’.\n Maybe I should try it the other way. If I want to “push” to achieve a little more, I should note what I need to do, go directly to sleep, but set my alarm for an hour early to get it done?\n P.S. I&#39;m late to the party, but I recently got  a twitter account that you can follow  here.", "posttime": "2020-06-15 04:18:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "熬夜,staying,睡觉", "title": "熬夜到很晚", "title_en": "Staying Up Late", "transed": 1, "url": "https://jetholt.com/micro/staying-up-late/", "via": "", "real_tags": ["熬夜", "staying", "睡觉"]}, {"category": "", "categoryclass": "", "imagename": "9f716b74a89e8ff61511c81008dcdc81.jpg", "infoid": 1006564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，制造催化剂将废二氧化碳转化为有用的工业产品一直既昂贵又复杂。新南威尔士大学的工程师们展示了这就像玩乐高一样简单。\n来自悉尼新南威尔士大学的化学工程师已经开发出新技术，帮助将有害的二氧化碳排放转化为化学积木，以制造有用的工业产品，如燃料和塑料。\n如果大规模采用，在世界向绿色经济过渡的过程中，这一过程可能会给世界带来喘息的空间。\n在今天发表在《先进能源材料》杂志上的一篇论文中，新南威尔士大学化学工程学院的Rahman Daiyan博士和Emma Lovell博士详细介绍了一种创造纳米颗粒的方法，这种纳米颗粒可以促进将废弃的二氧化碳转化为有用的工业零部件。\n研究人员在“科学”杂志前教授罗斯·阿迈勒(Rose Amal)领导的粒子与催化研究实验室开展了他们的工作，他们表明，通过使用一种名为火焰喷雾热解(FSP)的技术在非常高的温度下制造氧化锌，他们可以创造出纳米颗粒，作为催化剂将二氧化碳转化为“合成气”-一种用于制造工业产品的氢气和一氧化碳的混合物。研究人员说，与目前可用的方法相比，这种方法更便宜，更能满足重工业的要求。\n洛维尔博士说：“我们使用燃烧温度为2000华氏度的明火来制造氧化锌纳米颗粒，然后利用电能将二氧化碳转化为合成气。”\n“合成气通常被认为是乐高的化学等价物，因为两种积木-氢和一氧化碳-可以不同的比例用于制造合成柴油、甲醇、酒精或塑料等东西，这些都是非常重要的工业前体。\n“因此，从本质上说，我们正在做的就是将二氧化碳转化为这些前体，这些前体可以用来制造所有这些重要的工业化学品。”\n戴燕博士说，在工业环境中，含有FSP产生的氧化锌颗粒的电解槽可以用来将废二氧化碳转化为有用的合成气排列。\n“从发电厂或水泥厂排出的二氧化碳可以通过这个电解槽，里面有我们的火焰喷涂的氧化锌材料，呈电极的形式。”他说：“当我们把废弃的二氧化碳排入时，它是用电力处理的，然后以CO和氢的混合物的合成气的形式从出口释放出来。”\n研究人员说，实际上，他们正在关闭工业过程中产生有害温室气体的碳循环。通过对FSP技术燃烧纳米颗粒的方式进行微小调整，他们可以确定二氧化碳转化产生的合成气体积木的最终混合物。\n戴燕博士说：“目前，人们通过使用天然气来产生合成气--化石燃料也是如此。”“但我们正在利用废弃的二氧化碳，然后根据你想在哪个行业使用它，按一定的比例将其转化为合成气。”\n例如，一氧化碳和氢气之间的比例为1：1，这就使得合成气可以用作燃料。但戴燕博士说，四份一氧化碳和一份氢的比例适合制造塑料。\n通过选择氧化锌作为催化剂，研究人员确保了他们的解决方案与之前在这一领域尝试的方案相比，仍然是一种更便宜的替代方案。\n戴燕博士表示：“过去的尝试都使用了钯等昂贵的材料，但这是第一次成功地将澳大利亚当地开采的一种非常廉价且储量丰富的材料成功地应用于废物二氧化碳转化的问题。”\n洛弗尔博士补充说，这种方法吸引人的另一个原因是使用FSP火焰系统来创造和控制这些有价值的材料。\n她说：“这意味着它可以工业化使用，可以规模化，制造材料的速度非常快，非常有效。”\n“我们不需要担心使用非常昂贵的金属和前体的复杂合成技术-我们可以燃烧它，在10分钟内就可以让这些颗粒准备就绪。通过控制燃烧方式，我们可以控制所需合成气积木的比例。“。\n虽然这两家公司已经建造了一台电解槽，并用含有污染物的二氧化碳废气进行了测试，但将这项技术推广到可以转化发电厂排放的所有二氧化碳的程度，仍有一段路要走。\n“我们的想法是，我们可以采用二氧化碳的点源，比如燃煤发电厂、天然气发电厂，甚至是天然气矿山，在那里你可以释放出大量的纯二氧化碳，我们可以在这些工厂的后端基本上改造这项技术。”然后你可以捕获产生的二氧化碳，并将其转化成对工业有巨大价值的东西，“洛维尔博士说。\n该小组的下一个项目将是在烟气环境中测试他们的纳米材料，以确保它们对恶劣的条件和工业废气中发现的其他化学物质具有耐受性。", "note_en": "Making catalysts to convert waste carbon dioxide into useful industrial products has been expensive and complicated – until now. UNSW engineers show it’s as easy as playing with Lego.\n   Chemical engineers from UNSW Sydney have developed new technology that helps convert harmful carbon dioxide emissions into chemical building blocks to make useful industrial products like fuel and plastics.\n And if adopted on a large scale, the process could give the world breathing space as it transitions towards a green economy.\n In a paper published today in the journal  Advanced Energy Materials, Dr Rahman Daiyan and Dr Emma Lovell from UNSW’s School of Chemical Engineering detail a way of creating nanoparticles that promote conversion of waste carbon dioxide into useful industrial components.\n  The researchers, who carried out their work in the  Particles and Catalysis Research Laboratory led by Scientia Professor Rose Amal, show that by making zinc oxide at very high temperatures using a technique called flame spray pyrolysis (FSP), they can create nanoparticles which act as the catalyst for turning carbon dioxide into ‘syngas’ – a mix of hydrogen and carbon monoxide used in the manufacture of industrial products. The researchers say this method is cheaper and more scalable to the requirements of heavy industry than what is available today.\n “We used an open flame, which burns at 2000 degrees, to create nanoparticles of zinc oxide that can then be used to convert CO 2, using electricity, into syngas,” says Dr Lovell.\n “Syngas is often considered the chemical equivalent of Lego because the two building blocks – hydrogen and carbon monoxide – can be used in different ratios to make things like synthetic diesel, methanol, alcohol or plastics, which are very important industrial precursors.\n “So essentially what we’re doing is converting CO 2 into these precursors that can be used to make all these vital industrial chemicals.”\n  In an industrial setting, an electrolyser containing the FSP-produced zinc oxide particles could be used to convert the waste CO 2 into useful permutations of syngas, says Dr Daiyan.\n “Waste CO 2 from say, a power plant or cement factory, can be passed through this electrolyser, and inside we have our flame-sprayed zinc oxide material in the form of an electrode. When we pass the waste CO 2 in, it is processed using electricity and is released from an outlet as syngas in a mix of CO and hydrogen,” he says.\n The researchers say in effect, they are closing the carbon loop in industrial processes that create harmful greenhouse gases. And by making small adjustments to the way the nanoparticles are burned by the FSP technique, they can determine the eventual mix of the syngas building blocks produced by the carbon dioxide conversion.\n “At the moment you generate syngas by using natural gas – so from fossil fuels,” Dr Daiyan says. “But we’re using waste carbon dioxide and then converting it to syngas in a ratio depending on which industry you want to use it in.”\n For example, a one to one ratio between the carbon monoxide and hydrogen lends itself to syngas that can be used as fuel. But a ratio of four parts carbon monoxide and one part hydrogen is suitable for the creation of plastics, Dr Daiyan says.\n  In choosing zinc oxide as their catalyst, the researchers have ensured that their solution has remained a cheaper alternative to what has been previously attempted in this space.\n “Past attempts have used expensive materials such as palladium, but this is the first instance where a very cheap and abundant material, mined locally in Australia, has been successfully applied to the problem of waste carbon dioxide conversion,” Dr Daiyan says.\n Dr Lovell adds that what also makes this method appealing is using the FSP flame system to create and control these valuable materials.\n “It means it can be used industrially, it can be scaled, it’s super quick to make the materials and very effective,” she says.\n “We don’t need to worry about complicated synthesis techniques that use really expensive metals and precursors – we can burn it and in 10 minutes have these particles ready to go. And by controlling how we burn it, we can control those ratios of desired syngas building blocks.”\n  While the duo have already built an electrolyser that has been tested with waste CO 2 gas that contains contaminants, scaling the technology up to the point where it could convert all of the waste carbon dioxide emitted by a power plant is still a way down the track.\n “The idea is that we can take a point source of CO 2, such as a coal fired power plant, a gas power plant, or even a natural gas mine where you liberate a huge amount of pure CO 2 and we can essentially retrofit this technology at the back end of these plants. Then you could capture that produced CO 2 and convert it into something that is hugely valuable to industry,” says Dr Lovell.\n The group’s next project will be to test their nanomaterials in a flue gas setting to ensure they are tolerant to the harsh conditions and other chemicals found in industrial waste gas.", "posttime": "2020-06-15 04:01:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "有用,find,二氧化碳", "title": "工程师们找到了将废物二氧化碳转化为有用材料的巧妙方法", "title_en": "Engineers find neat way to turn waste carbon dioxide into useful material", "transed": 1, "url": "https://newsroom.unsw.edu.au/news/science-tech/engineers-find-neat-way-turn-waste-carbon-dioxide-useful-material", "via": "", "real_tags": ["有用", "find", "二氧化碳"]}, {"category": "", "categoryclass": "", "imagename": "cff84eee244b6503686e11d17f700644.jpg", "infoid": 1006563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然现代网络技术正在积极弥合本地应用程序的差距，但Google Chrome和Microsoft Edge等网络浏览器应用程序希望Windows 10用户在很大程度上依赖进步网络应用程序(PWAS)直接从任务栏执行常见任务，这要归功于应用程序快捷方式。Google Chrome&amp；Microsoft Edge正在开发App快捷方式，让你可以直接从Windows10任务栏发送电子邮件、撰写推文等。\n谷歌Chrome85正在推出App快捷方式，使渐进式Web应用与Windows10操作系统中的本机操作系统组件(如任务栏)完全兼容。这样，用户将能够快速执行常见任务，如直接从Windows10任务栏撰写电子邮件或推文。\nGoogle Chrome和Microsoft Edge支持App快捷方式的可能性几乎是无穷无尽的，根据特定Web应用程序的功能，Windows10用户可以选择直接从任务栏执行常见任务。例如，如果在接下来的几天里，相应的渐进式Web应用程序能够直接从Windows10任务栏一键访问经常联系的WhatsApp组或YouTube搜索栏，我们不会感到惊讶。\n回想一下，Windows 10 2018年10月更新允许使用Microsoft Edge访问Windows任务栏或开始菜单上跳转列表中的顶级站点。不仅是Windows，Mac用户也可以通过与MacOS底座上的Chrome图标交互，直接创建一个新的网络浏览器窗口。同样的理念也适用于使用基于Chromium引擎的Web浏览器应用程序的应用程序快捷方式。\n“允许Web应用程序注册常见任务的快捷方式。这些通常会添加到应用程序启动器图标(对于渐进式Web应用程序)，使用户能够快速运行关键任务。将这些功能添加到Web平台上，可提供与许多平台上的本地应用程序相同的功能。“。\n快速启动栏中的Windows 10原生应用程序图标支持应用程序中常用或频繁执行的任务的快捷菜单。可以通过右键单击应用程序的快速启动栏图标来调用此菜单。\n作为Chromium中PWA安装过程的一部分，会在桌面、快速启动栏和应用程序启动器等位置添加图标，以帮助用户快速启动PWA。但目前，Chromium不允许用户通过Windows10任务栏在PWA内启动关键任务。这正是基于Chromium的网络浏览器现在正试图改变的。\n此功能将使Web开发人员能够在Chromium中添加对Web应用程序清单中定义的快捷方式的支持。因此，Chromium PWAS可以为其快速启动栏图标提供App快捷方式，就像本地应用程序一样。\nMicrosoft Edge上当前正在开发应用程序快捷方式功能。同时，谷歌Chrome85也在Dev频道。", "note_en": "While modern web technologies are  actively bridging the native app gap, web browser applications like Google Chrome and Microsoft Edge want Windows 10 users to rely heavily on  Progressive Web Apps (PWAs) to perform common tasks directly from the taskbar, courtesy of  App shortcuts.  Google Chrome &amp;  Microsoft Edge are working on App Shortcuts that allow you to send emails, compose tweets, etc, directly from Windows 10 taskbar.\n   Google Chrome 85 is rolling out App shortcuts to make progressive web apps fully compatible with native OS components such as taskbar in the Windows 10 operating system. This way, users will be able to quickly perform common tasks like composing an email or tweets directly from  Windows 10 taskbar.\n The possibilities of App shortcuts support in Google Chrome and Microsoft Edge are practically endless, and depending on the functionalities of particular web applications, Windows 10 users can choose to perform common tasks directly from the taskbar. For example, we won’t be surprised if respective progressive web apps enable one-click access to frequently contacted WhatsApp groups or YouTube search bar directly from Windows 10 taskbar in the coming days.\n  To recall, Windows 10 October 2018 Update enabled access to top sites in the Jump List on the Windows taskbar or Start menu using Microsoft Edge. Not only Windows but Mac users can also create a new web browser window directly by interacting with the Chrome icon on the macOS dock. The same philosophy will apply to App shortcuts using web browser applications based on the Chromium engine.\n  “Lets a web application register shortcuts for common tasks. These would typically be added to the app launcher icon (for a progressive web app) enabling the user to quickly run key tasks. Adding these to the web platform provides an equivalent capability to native apps on many platforms.”\n Windows 10 native app icons in the quick launch bar support a shortcut menu for commonly or frequently performed tasks in the app. This menu can be invoked by right-clicking the app’s quick launch bar icon.\n As part of the PWA installation process in Chromium, icons are added in several locations like the desktop, quick launch bar, and app launcher to help users quickly launch the PWA. But right now, Chromium does not allow users to start a key task within a PWA through the Windows 10 taskbar. This is exactly what Chromium-based web browsers are now trying to change.\n This feature will enable web developers to add support in Chromium for shortcuts defined in a Web App Manifest. As a result, Chromium PWAs can offer App shortcuts for their quick launch bar icon much like native apps.\n  App shortcuts feature is currently in development on Microsoft Edge. Meanwhile, Google Chrome 85 is in the Dev channel.", "posttime": "2020-06-15 03:45:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,windows,windows-10,google,chrome", "title": "谷歌Chrome 85允许用户从Windows 10任务栏撰写推文", "title_en": " Google Chrome 85 To Allow Users To Compose Tweets From Windows 10 Taskbar", "transed": 1, "url": "https://news.thewindowsclub.com/pwas-to-let-you-send-emails-compose-tweets-directly-from-windows-10-taskbar-courtesy-of-app-shortcuts-100745/", "via": "", "real_tags": ["谷歌", "windows", "google", "chrome"]}, {"category": "", "categoryclass": "", "imagename": "005b0297772ddaa7e3f74d3af5846d7b.png", "infoid": 1006562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在宣布全国各地的图书馆、学校和大学因新冠肺炎全球疫情而关闭后的几天内，我们启动了临时国家应急图书馆，在关闭期间提供图书，以支持紧急远程教学、研究活动、自主奖学金和智力激发。\n我们从图书馆员、作家、家长、老师和学生那里听到了数以百计的故事，讲述了NEL如何在这场危机中填补了一个重要的空白。\n例如，来自新泽西州的图书管理员本·S(Ben S)告诉我们，他使用NEL“为我工作的学术医疗中心的一线医务人员找到了所需的基本生命维持手册”。由于新冠肺炎的原因，我们的实物收藏被关闭了，NEL让我仍然可以向我们医院的顾客提供所需的健康信息材料。“。我们为能帮助一线工作人员而感到自豪。\n今天我们宣布，国家紧急图书馆将在6月16日关闭，而不是6月30日，回归传统的受控数字借阅。我们了解到，绝大多数人在互联网档案馆使用数字化图书的时间很短。即使NEL关闭了，我们也能够通过受控的数字借阅为大多数顾客提供服务，这在一定程度上要归功于非营利性的HathiTrust数字图书馆的出色工作。HathiTrust的新紧急临时接入服务具有我们计划遵循的短期接入模式。\n我们提前了日程，因为上周一，四家商业出版商选择在一场全球大流行期间起诉互联网档案馆。“然而，这起诉讼不仅仅是关于临时国家紧急图书馆的。”起诉书抨击了任何拥有和借阅数字图书的图书馆的概念，挑战了数字世界中图书馆是什么的想法。这起诉讼与一些学术出版商形成鲜明对比，他们最初表达了对NEL的担忧，但最终决定与我们合作，为那些与物理学校和图书馆隔绝的人提供访问权限。我们希望类似的合作在这里是可能的，出版商取消了他们代价高昂的攻击。\n受控数字借阅是指九年来，有多少图书馆一直在提供获取数字化图书的途径。受控数字借阅是由版权专家开发的法律框架，一次只有一名读者可以阅读合法拥有的图书馆图书的数字化副本。数字化图书受到出版商在自己网站上用于数字产品的相同数字保护。自2011年以来，包括互联网档案馆在内的许多图书馆都采用了这一系统，以在日益数字化的世界中利用他们对旧纸质图书的投资。\n我们现在都被互联网束缚着，充斥着错误信息和虚假信息--为了与这些作斗争，我们都比以往任何时候都更需要获得书籍。要做到这一点，我们需要图书馆、作家、书商和出版商之间的合作。", "note_en": "Within a few days of the announcement that libraries, schools and colleges across the nation would be closing due to the COVID-19 global pandemic, we launched the temporary  National Emergency Library to provide books to support emergency remote teaching, research activities, independent scholarship, and intellectual stimulation during the closures.\n We have heard hundreds of stories from librarians, authors, parents, teachers, and students about how the NEL has filled an important gap during this crisis.\n Ben S., a librarian from New Jersey, for example, told us that he used the NEL “to find basic life support manuals needed by frontline medical workers in the academic medical center I work at. Our physical collection was closed due to COVID-19 and the NEL allowed me to still make available needed health informational materials to our hospital patrons.” We are proud to aid frontline workers.\n Today we are announcing the National Emergency Library will close on June 16th, rather than June 30th, returning to traditional controlled digital lending. We have learned that the vast majority of  people use digitized books on the Internet Archive for a very short time. Even with the closure of the NEL, we will be able to serve most patrons through controlled digital lending, in part because of the good work of the non-profit HathiTrust Digital Library. HathiTrust’s new  Emergency Temporary Access Service features a short-term access model that we plan to follow.\n We moved up our schedule because, last Monday, four commercial publishers chose to sue Internet Archive during a global pandemic.  However, this lawsuit is not just about the temporary National Emergency Library. The complaint attacks the concept of any library owning and lending digital books, challenging the very idea of what a library is in the digital world. This lawsuit stands in contrast to some academic publishers who initially expressed concerns about the NEL, but ultimately decided to  work with us to provide access to people cut off from their physical schools and libraries. We hope that similar cooperation is possible here, and the publishers call off their costly assault.\n Controlled digital lending is how many libraries have been providing access to digitized books for nine years.  Controlled digital lending is a legal framework, developed by copyright experts, where one reader at a time can read a digitized copy of a legally owned library book. The digitized book is protected by the same digital protections that publishers use for the digital offerings on their own sites. Many libraries, including the Internet Archive, have adopted this system since 2011 to leverage their investments in older print books in an increasingly digital world.\n We are now all Internet-bound and flooded with misinformation and disinformation—to fight these we all need access to books more than ever. To get there we need collaboration between libraries, authors, booksellers, and publishers.", "posttime": "2020-06-15 03:44:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图书馆,national", "title": "国家临时紧急图书馆将提前2周关闭", "title_en": "Temporary National Emergency Library to close 2 weeks early", "transed": 1, "url": "https://blog.archive.org/2020/06/10/temporary-national-emergency-library-to-close-2-weeks-early-returning-to-traditional-controlled-digital-lending/", "via": "", "real_tags": ["图书馆", "national"]}, {"category": "", "categoryclass": "", "imagename": "6abe98fc4fb5b6b504f0f91926c603e5.png", "infoid": 1006561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们众筹了一笔10000美元的赏金，以比特币支付，购买一个开源工具，帮助人们将他们的追随者从推特输出到Substack、Ghost、当地人或其他用户控制的平台上。\n因为这是许多人想要的，所以解决这一问题的好方案可以成为一种产品，甚至是一家初创公司。你首先要让它对Twitter有影响力的人起到很好的作用，可能是通过白手套服务，为前100个左右的账户提供服务。然后让它在其他社交平台上运行。像Buffer这样的公司做得非常好(2000万美元+ARR！)。类似的看似简单的产品填补了社交网络领域的一个漏洞。\nTwitter是一个学习和寻找志同道合的人的令人难以置信的平台。我很钦佩杰克·多尔西和他的团队所取得的成就。\n然而，对于拥有大量追随者的用户来说，它有几个缺点，因为它缺乏用于以下方面的工具：\n货币化：你不会作为推特有影响力的人赚钱，也不会去店面卖东西。\n优先顺序：您不能对您的订阅源或您的关注者的提要中出现的内容进行上调或下调。\n品牌管理：您不能控制自己的品牌或域名，因为它是twitter.com/instance而不是example.com。\n由于这些和更多的原因，许多人正在转向Substack、Ghost、Locals等平台。在这些平台中，有影响力的人对他们的社区拥有完全的根权限，可以提供更丰富的体验。你不需要付钱给Twitter广告来接触你的追随者，也不需要相信他们会把你的内容送到他们的feed上。\n然而，问题是，从Twitter上输出一个庞大的追随者基础并不是一件微不足道的事！\n请注意，这里的问题不是导出自己的配置文件数据。这相对容易，Twitter已经支持这一点。问题不是访问你自己的数据，而是在没有Twitter额外同意的情况下联系你的追随者(例如通过电子邮件或电话)的能力。\n理想的情况是这样的：如果你有N个粉丝，你会得到这些粉丝的N个电子邮件(或电话号码)列表，他们明确同意在另一个平台上与他们联系，而且不会给他们带来太多甚至根本就是不必要的麻烦。此外，解决方案不应该占用影响者运行和维护脚本的太多时间。\n理论上，Twitter可以增加一个功能，用户可以选择加入，允许他们关注的几个、部分或所有账户查看他们的电子邮件，或许可以换取某种形式的小额支付。例如，一个账户可以为每个账龄超过3个月的关注者和&gt；100个现实关注者的验证电子邮件支付X美元。\n但是在没有这样的内置功能的情况下，有几种重叠的方式可以将用户基导出到example.com/SUBSCRIBE。\n建立一个单独的新帐户，做#1-4，以避免在您的时间线上公开提及。\n解析每个关注者帐户的个人简历以获取公共联系信息(例如，如果他们的简历中有他们的电子邮件)，然后通过example.com/scribe向他们发送带外电子邮件。\n这些都不是十全十美的。但是最后一个看起来是合理的(对于选择跟随你的人来说，单个DM应该是可以的)，并且在理论上相对容易自动化。我们称这为大众DM方法。特别值得一提的是，Twitter为企业提供了一系列工具，用于通过DM对客户服务进行文档编制，这些工具可能会被重新用于此用例。\n大规模DM方法最简单的解决方案可能是命令行应用程序，它接受一个Twitter API密钥和发送给每个用户的消息作为输入。它为你提供了所有关注者的预览，提供了一些选项来根据重要性对他们进行排名，并允许你在每天开放到1000个账户之前，通过向几个账户发送测试邮件来进行尝试。它存储状态，这样您就知道您过去给谁发了消息，这样您就不会无意中重新联系他们。\n你可以想象一个更华丽的本地Mac App，它在上面描述的命令行引擎之上放了一个漂亮的GUI。或者一个更华丽的托管版本，带有单独的转换链接，这样你就可以知道哪些用户名转换成了哪些电子邮件。托管版本还允许您每天在后台运行1000个DM，因此它可以是一项SaaS服务。\n有足够多的其他人对此感兴趣，截至2020年6月14号星期日，赏金总额已达&gt；10000美元！\n如果有更多的钱超过10,000美元，我们将分配第一个10,000美元给获胜者。然后，我们将把剩余的钱分配给那些测试过这款应用的人，和/或可能分配给第二名和第三名的用户。\n在机制方面，我(@balajis)将在2020年6月21日之前决定获胜者，然后将获胜者的BTC地址提供给公开支持赏金的各个人。\n这些人每个人都有义务支付他们提交给获胜者的金额。他们可以选择公开发布在线确认。\n请转到本期并发表评论，并提供指向您的项目的链接。理想情况下，它应该有一个gif或什么东西来证明它是有效的。\n如上所述，理想的情况是，如果你有N个追随者，在他们明确同意在另一个平台上与他们联系的情况下，你会得到这些追随者的n封电子邮件(或电话号码)列表，而不会给他们带来太多或根本的麻烦，也不会对影响者造成太多时间或金钱的要求。\n这些都是一个关键的约束。如果你有一个解决方案在理论上是有效的，但它破坏了拥有很多追随者的账户，或者因为垃圾邮件而导致账户被禁止或影子被禁止，或者有其他一些严重的负面副作用，那么你就没有解决方案。\n因为您每天只能发送1000个DM，所以您需要确定关注者的优先顺序，以便首先导出最重要的关注者。这些人可能自己拥有最多的追随者，或者在他们的个人简历中有一些属性(比如#比特币标签)，或者有一些其他的标准。实际上，这意味着您可能需要一个关注者表，其中第一列是Twitter用户名，后续列是该用户名的元数据(以及上次收集该元数据的时间戳，因为随着人们更新他们的配置文件，它可能会变得陈旧)。\n是的，Twitter的默认API有每天1000 DM的限制。因此，您的工具可能需要运行数天。\n开放源码版本将在本地运行，并具有某种状态，如SQLite数据库或平面文件。它将使用该状态来记录DM的人员、时间，以及他们说了什么以及他们是否做出了回应。您还应该允许在新的关注者出现时定期重新运行该工具，而不需要影响者考虑他们是否在不经意间给他们已经发过消息的人发消息。\n也许吧，只要API访问对于拥有(比方说)10000名追随者的典型Twitter影响者来说不是太昂贵或太耗时。\n这是最简单的版本，但理想情况下应该有一个简单的Macapp和一个托管版本。\n这款Mac应用程序将面向那些不是开发人员，但又不想把他们的Twitter证书分发给一个新网站的人。他们更喜欢在本地粘贴API密钥。\n托管版本可能是使用最广泛的，在这里有人登录Twitter OAuth并在后台设置这个大规模的DM Torun，分析谁被联系了，谁注册了，等等。\n然而，由于Twitter上有很多变幻莫测的应用程序，而且考虑到这个应用程序所做的事情的性质(大量追随者)，有影响力的人会想要小心地照看它，而开源版本的出现将增加人们对托管版本的信任。\n在GitHub和更广泛的互联网上，有大量的开源工具可以与Twitter协同工作。你可以随意使用它们，而不是重新发明轮子。\n输出你的追随者的问题适用于所有的社交媒体，人们已经讨论了十年的大部分时间，但现在感觉它已经沸腾了。有一大批人正在转移到Substack、Ghost和当地人这样的平台上，这些平台可以更好地控制你的观众(随之而来的是，为影响者赚钱，为观众带来好处)。\n如果我们能为推特解决这个问题，我们也许可以将其推广到Facebook和Instagram等其他平台上的部分有影响力的人离开。\n请注意，Twitter和公司很快就会好起来的，而且不会很快消失。这是一种山洞与公地的方法。大型的全球社交网络可能还会持续一段时间，因为你可以在那里招募成员，但这些由个人影响力人士领导的社区将会蓬勃发展。\n最后，如上所述，像Buffer这样解决这类看似简单问题的公司已经获得了2000万美元以上的ARR。如果你能构建和维护一个工具，在得到用户同意的情况下，以合理的价格可靠地从Twitter和其他社交网络导出大量追随者电子邮件，那么你就拥有了可能会让大量有影响力的人付钱的东西。", "note_en": "People have crowdfunded a  $10000 bounty, payable in BTC, for an open sourcetool that helps people export their followers from Twitter to Substack,  Ghost,  Locals, or other user-controlledplatforms.\n  Because this is desired by many people, a good solution to this bountycould become a product or even a startup. You&#39;d want to first get itto work robustly for Twitter influencers, probably via white gloveservice for the first 100 or so accounts. And then make it work forother social platforms. Companies like  Buffer have donesurprisingly well ($20M+ ARR!) with similar seemingly simpleproducts that fill a hole in the social networking landscape.\n  Twitter is an incredible platform for learning and finding people oflike mind. I admire much of what Jack Dorsey and his team haveaccomplished.\n However, it has several downsides for users with large follower bases,as it lacks tools for:\n monetization: you don&#39;t make money as a Twitter influencer, and don&#39;t get a storefront to sell things\n   prioritization: you can&#39;t up- or down-regulate what appears in your feed or that of your followers\n brand management: you don&#39;t control your own brand or domain name, as it&#39;s twitter.com/example rather than example.com\n For these reasons and more, many people are moving to platforms like Substack,  Ghost,  Locals, or the like. In these platforms,an influencer has full root privileges over their community and cangive a richer experience. You don&#39;t need to pay Twitter ads to reachyour followers, or trust that they will deliver your content to theirfeed.\n The issue, however, is that it&#39;s not trivial to export a largefollower base from Twitter!\n Note that the problem here is  not the export of one&#39;s own profiledata. That is relatively easy and  Twitter alreadysupports that. The issue is not the  access to your own data, theissue is the ability to  contact your followers (eg via email orphone) without Twitter&#39;s additional consent.\n  Here&#39;s the ideal: if you have N followers, you get a list of N emails(or phone numbers) for those followers  with their explicit consentto contact them on another platform, and without bothering them verymuch or at all. Also, the solution shouldn&#39;t take too much time on thepart of the influencer to run and maintain a script.\n In theory, Twitter could add a feature where users could opt in toallowing their emails to be viewed by a few, some, or all of theaccounts they followed, perhaps in return for a micropayment of somekind. For example, an account could pay $X for the verified email ofeach follower with an account age over 3 months and &gt;100 realfollowers themselves.\n But in the absence of a built-in feature like this, there are severaloverlapping ways to export your userbase to example.com/subscribe.\n Set up a separate new account that does #1-4, to keep the public mentions out of your timeline\n Parse the bios of each follower account for public contact info (eg if they have their email in their bio), and email them out-of-band with example.com/subscribe\n None of these are perfect. But the last one seems like it has theright balance of being reasonable (a single DM to someone who haschosen to follow you should be OK) and in theory relatively easy toautomate. Call this the mass DM approach. In particular, Twitter has a bunch of tools for corporations to docustomer service  via DM that might be repurposed for this use case.\n  The simplest solution for the mass DM approach might be a command line app that takes as input a Twitter API key and a message to send each user. It gives you a preview of all of your followers, gives you some options to rank them by importance, and lets you try it out by sending test messages to a few accounts before opening it up to message 1000 accounts per day. It stores state so you know who you messaged in the past, such that you don&#39;t inadvertently recontact them.\n You can imagine a fancier local Mac App that puts a nice GUI on top of the command line engine described above. Or an even fancier hosted version with individually attributable conversion links, so you know which usernames converted to which emails. The hosted version would also allow you to keep running the 1000 DMs per day in the background, so it could be a SaaS service.\n     Enough other people were interested in this that the total bounty funds are now &gt;$10000 as of Sunday June 14, 2020!\n If more money comes in beyond $10,000, we will allocate the first $10,000 to the winner. We&#39;ll then allocate remaining monies to folks who test out the app and/or possibly to second and third place submissions.\n   In terms of mechanics, I (@balajis) will decide on the winner by June21, 2020, and then the BTC address of the winner will be provided tothe various people who have publicly supported the bounty.\n It will be incumbent upon each of these people to pay what they havecommitted to the winner. They can optionally publicly post an on-chainconfirmation.\n   Go to this  issue and make a comment with a link toyour project. Ideally it should have a gif or something that showsthat it works.\n  As noted above, the ideal is that if you have N followers, you get a list ofN emails (or phone numbers) for those followers  with their explicitconsent to contact them on another platform, and without botheringthem very much or at all, or requiring too much time or money on the partof the influencer.\n   These are a critical constraint. If you have a solution that works in theory, but thatbreaks on accounts with many followers, or gets an account banned or shadowbanned for spam,or has some other serious negative side effect, then you don&#39;t have a solution.\n  Because you can only send 1000 DMs per day, you will want to prioritize your followers such that you export the most important ones first. These might be the ones who have the most followers themselves, or who have some attribute in their bio (like a #Bitcoin hashtag), or that have some other criteria. In practice this means that you&#39;ll likely want a  follower table, where the first column is the Twitter username and subsequent columns are metadata on that username (along with a timestamp for when that metadata was last collected, as it can become stale as people update their profiles).\n  Yes, Twitter&#39;s default API has a  1000-daily-DM limit. So your tool might need to runfor multiple days.\n The open source version would run locally and have some state, like aSQLite database or a flatfile. It would use that state to record whatpeople it had DM’d and when, along with what was said and whether theyresponded. You should also allow re-running of the tool periodicallyas new followers arise, without requiring the influencer to thinkabout whether they are inadvertently messaging people they alreadymessaged.\n  Maybe, so long as that API access isn&#39;t too expensive or timeconsuming to get for the typical Twitter influencer with (say) 10,000followers.\n   That&#39;s the simplest version, but ideally there should be a simple Macapp and a hosted version as well.\n The Mac app would be for folks who aren&#39;t developers, but don&#39;twant to give their Twitter credentials out to a new website. They&#39;dprefer to paste in an API key locally.\n The hosted version will probably be the most widely used, wheresomeone logs in with Twitter OAuth and sets up this mass DM torun in the background, with analytics on who has been contacted,who signed up, and so on.\n However, because there are many fly-by-night Twitter apps, and becauseof the nature of what this app is doing (mass DM of followers), theinfluencer will want to carefully babysit it and the presence of theopen source versions will increase trust in the hosted version.\n    There are tons of open source tools for working with Twitter out thereon GitHub and the broader internet. Feel free to use them rather thanreinventing the wheel.\n  The problem of exporting your following applies to all social media,and has been discussed for the better part of a decade, but it nowfeels like it&#39;s gotten to a boil. There is a critical mass of peoplewho are moving to platforms like Substack, Ghost, and Locals thatoffer greater control over your audience (and, with it, monetizationfor the influencer and benefits for the audience).\n If we can solve it for Twitter, we can probably generalize this towork for  partial exodus of influencers from other platforms likeFacebook and Instagram.\n Please note that Twitter and company will be fine and won&#39;t go away any time soon.This is a  cave-and-commons approach. The large global social networkswill likely persist for some time as &#34;commons&#34; where you recruitmembers, but these &#34;caves&#34; off to the side with individual influencer-led communitieswill thrive.\n Finally, as noted above, companies like Buffer that solve seemingly simple problemslike this have gotten to $20M+ in ARR. If you can build and maintain a tool that reliably exportsa large percentage of follower emails from Twitter and other social networks, with the consent of the users and at a reasonable price, you have something that a large number of influencers will likely pay for.", "posttime": "2020-06-15 03:27:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,开源,赏金,bounty,twitter", "title": "10000美元的比特币赏金，购买一个开源工具来导出你的推特追随者", "title_en": "$10000 BTC Bounty for an open source tool to export your Twitter followers", "transed": 1, "url": "https://github.com/balajis/twitter-export", "via": "", "real_tags": ["推特", "开源", "赏金", "bounty", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL；DR：我们来看看当Unix编程模型排除检查输出本身时，Zsh和Fish如何能够在程序输出中指出缺少的终止换行符。\n大多数shell，包括bash、ksh、dash和ash，都会在前一个命令退出光标时离开光标的位置显示提示符。\n提示符(几乎)总是出现在下一行熟悉的最左边一列，这是因为Unix程序在退出时普遍合作将光标停在那里。\n要做到这一点，请始终确保输出终止换行符\\n(也称为换行符)：\nvidar@vidarholen-vm2~$whamividarvidar@vidarholen-vm2~$whomami|HEXDUMP-c0000000 v i d a r\\n。\n如果程序未能遵循此约定，提示将在错误的位置结束：\n但是，我最近注意到，zsh和fish将改为显示一个字符，指示缺少换行符，并且仍然在您期望找到它的位置开始提示：\nvidarholen-vm2%ECHO-n34；hello zsh&#34；hello zsh%vidarholen-vm2%vidar@vidarholen-vm2~&gt；ECHO-n34；hello fish⏎vidar@vidarholen-vm2~&gt；\n如果您对有一整篇博客文章都是关于这一点感到失望，那么您可能还没有尝试编写一个shell。这是一个问题，你知道的越多，看起来就越难(强制性的XKCD)。\n如果您心中有一个简单的解决方案，可能是这样的：if(！output.ends_with(&#34；\\n&#34；))printf(&#34；%\\n&#34；)；，请考虑以下限制*：\n与普遍认为的相反，shell并不位于程序和终端之间。外壳不能拦截或检查程序的终端输出。\n终端编程模型基于电传打字机(又名TTY)，即20世纪初的机电打字机。他们逐个字母地打印到纸上，因此没有内存或屏幕缓冲区可以编程回读。\n外壳可以使用管道拦截所有输出，并将其中继到终端。虽然它在woami这样的普通情况下有效，但有些程序会检查stdout是否是终端并改变它们的行为，有些程序会越过您的权限直接与TTY对话(例如，ssh的密码提示符)，有些程序会使用特定于TTY的ioctls，如果输出不是TTY，比如查询窗口大小或禁用密码输入的本地回显，这些ioctls就会失败。\n外壳程序可以ptrace该进程，以查看它在哪里写入了什么内容。这会带来巨大的开销，并破坏sudo、ping和其他依赖suid的命令。\nshell可以创建伪tty(Pty)，在其中运行命令，并像ssh或脚本一样来回转发信息。这是一种烦人且笨重的方法，其最终形式需要重新实现整个终端仿真器。\n外壳可以使用ECMA-48光标位置报告功能：printf&#39；\\e[6n&39；]在支持的终端上，将导致终端模拟表单^[[y；xr]上的用户输入，其中y和x是行和列。然后，外壳可以读取它来确定光标的位置。这些类型的往返是可行的，但是对于如此简单的功能，实现起来有些缓慢和烦人。\n相反，Zsh和Fish有一种简单得多、聪明得多的方法来做这件事：\n这个解决方案非常简单，因为它只需要在每个提示之前打印一个固定的字符串，但它在所有终端上都非常有效。\n让我们假设我们的终端有10列宽，3行高，一个规范的程序刚刚编写了一个带有尾随换行符的短字符串：\n光标(由|表示)位于该行的开头。这是在步骤1和2中将发生的情况：\n此时将显示指示符，由于我们正好写入了$Column字符，因此光标位于最后一列之后。步骤3(回车符)现在将其移回起点：\n最终结果与我们简单地写出光标所在位置的提示符完全相同。\n现在，让我们看看当程序没有输出终止换行符时会发生什么：\n将显示指示符，但这一次步骤2中的空格会导致该行一直换行到下一行：\n提示现在显示在该行上，因此不会覆盖指示器：\n现在你就知道了。一个看似简单的问题被证明比预期的要难，但巧妙地使用换行使它再次变得容易。\n现在我们知道了秘诀，我们当然可以在Bash中做同样的事情：\n虽然很有用并且经常被请求，但是没有可靠的方法来获取先前执行的命令的输出。\n截取终端的屏幕截图/转储令人惊讶地棘手，而且它只在特定的终端上工作。\n背景进程输出装饰性地破坏前景进程的现象是众所周知的，但是没有解决方案", "note_en": "tl;dr: We look at how Zsh and Fish is able to indicate a missing terminating linefeed in program output when the Unix programming model precludes examining the output itself.\n Most shells, including bash, ksh, dash, and ash, will show a prompt wherever the previous command left the cursor when it exited.\n The fact that the prompt (almost) always shows up on the familiar left-most column of the next line is because Unix programs universally cooperate to park the cursor there when they exit.\n This is done by always making sure to output a terminating linefeed  \\n (aka newline):\n vidar@vidarholen-vm2 ~ $ whoamividarvidar@vidarholen-vm2 ~ $ whoami | hexdump -c0000000 v i d a r \\n\n If a program fails to follow this convention, the prompt will end up in the wrong place:\n  However, I recently noticed that  zsh and  fish will instead show a character indicating a missing linefeed, and still start the prompt where you’d expect to find it:\n vidarholen-vm2% echo -n &#34;hello zsh&#34;hello zsh% vidarholen-vm2%vidar@vidarholen-vm2 ~&gt; echo -n &#34;hello fish&#34;hello fish⏎vidar@vidarholen-vm2 ~&gt;\n If you’re disappointed that  this is what there’s an entire blog post about, you probably haven’t tried to write a shell. This is one of those problems where the more you know, the harder it seems ( obligatory XKCD).\n If you have a trivial solution in mind, maybe along the lines of  if (!output.ends_with(&#34;\\n&#34;)) printf(&#34;%\\n&#34;);, consider the following restrictions*:\n Contrary to popular belief, the shell does  not sit between programs and the terminal. The shell has no ability to intercept or examine the terminal output of programs.\n The terminal programming model is based on teletypes (aka TTYs), electromechanical typewriters from the early 1900s. They printed letter by letter onto paper, so there is no memory or screen buffer that can be programmatically read back.\n  The shell could use pipes to intercept all output, and relay it onto the terminal. While it works in trivial cases like  whoami, some programs  check whether stdout is a terminal and change their behavior, others go over your head and talk to the TTY directly (e.g.  ssh‘s password prompt), and some use TTY specific  ioctls that fail if the output is not a TTY, such as querying window size or disabling local echo for password input.\n The shell can  ptrace the process to see what it writes where. This has a huge overhead and breaks  sudo,  ping, and other commands that rely on suid.\n The shell can create a pseudo-tty (pty), run commands in that, and relay information back and forth much like  ssh or  script does. This is an annoying and heavy-handed approach, which in its ultimate form would require re-implementing an entire terminal emulator.\n The shell can use ECMA-48 cursor position reporting features:  printf &#39;\\e[6n&#39; on a supported terminal will cause the terminal to simulate user input on the form  ^[[y;xR where  y and  x is the row and column. The shell could then read this to figure out where the cursor is. These kinds of round trips are feasible, but somewhat slow and annoying to implement for such a simple feature.\n Zsh and Fish instead have a much simpler and far more clever way of doing it:\n  This solution is very simple because it only requires printing a fixed string before every prompt, but it’s highly effective on all terminals.\n  Let’s pretend our terminal is 10 columns wide and 3 rows tall, and a canonical program just wrote a short string with a trailing linefeed:\n  The cursor, indicated by  |, is at the start of the line. This is what would happen in step 1 and 2:\n  The indicator is shown, and since we have written exactly  $COLUMN characters, the cursor is after the last column. Step 3, a carriage return, now moves it back to the start:\n    The final result is exactly the same as if we had simply written out the prompt wherever the cursor was.\n Now, let’s look at what happens when a program does  not output a terminating linefeed:\n  The indicator is shown, but this time the spaces in step 2 causes the line to wrap all the way around to the next line:\n    The prompt is now shown on that line, and therefore doesn’t overwrite the indicator:\n  And there you have it. A seemingly simple problem turned out harder than expected, but a clever use of line wrapping made it easy again.\n Now that we know the secret sauce, we can of course do the same thing in Bash:\n    While useful and often requested, there is no robust way to get the output of the previously executed command.\n It’s surprisingly tricky to take screenshots/dumps of terminals, and it only works on specific terminals.\n The phenomenon of background process output cosmetically trashing foreground processes is well known, and yet there’s no solution", "posttime": "2020-06-15 03:27:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缺少,fish,终端", "title": "Zsh和Fishâuro™高亮显示缺少的换行符的简单而聪明的技巧", "title_en": "Zsh and Fishâ€™s simple but clever trick for highlighting missing linefeeds", "transed": 1, "url": "https://www.vidarholen.net/contents/blog/?p=878", "via": "", "real_tags": ["缺少", "fish", "终端"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年5月和6月，Cure53完成了对ring、webpki和rustls的审计。他们的报告(PDF)全面描述了审计情况，读起来很有趣。\n不过，首先，(奎恩项目的)Dirkjan Ochtman最终实现了这一目标，值得非常感谢。我们在2018年巴黎RustFest上首次讨论了进行这样的审计的可能性。为了获得赞助商，他花了将近两年的时间坚定不移地工作。谢谢德尔坎！\n云本地计算基金会(Linux基金会的一部分)应在链接器数据平面中使用沙沙的浮标公司的要求资助了这次审计。因此，进一步感谢Linux基金会的Chris Aniszczyk和浮标公司的Oliver Gould对这些项目的支持。(注：原生云计算基金会是Linux基金会的一部分)应浮标基金会的要求资助这次审计，浮标基金会的Chris Aniszczyk和浮标基金会的奥利弗·古尔德对这些项目给予了支持。\n“[..]。审计团队认为总体代码质量非常好，可以证明所有范围的项目都一致地留下了坚实的印象。“。\n“无论是从设计的角度还是从实现的角度来看，整个范围都可以被认为是异常高标准的。”\n开发商提供高质量TLS实施的意图非常明确，这一目标可以被认为是成功实现的。“。\n“这里和那里的小建议对任何项目来说都是可能的，但这并不能改变这样一个事实，即在沙沙中真的没有太多需要改进的地方。Cure53非常高兴能对展示的软件留下令人难以置信的印象。\n有两个信息性的发现和两个轻微的严重程度的发现。详细内容见报告，下面的讨论反映了我对这些问题的看法。\n这一发现表明RING使用来自EverCrypt项目的正式验证的密码学实现，很难反对基础密码学代码的形式验证。这里值得注意的是，RING确实已经使用了正式验证的curve25519实现(来自Fiat-Crypto项目)。\n这一发现与unwork()的实例相关，这些实例没有出现恐慌，但是很难推断是这样的情况。推理跨越了几个不同的模块，这本身就是一个可读性和维护风险。因此，正在讨论的代码已经得到了改进。\n此发现涉及表示为RFC5280中指定的IP地址空间的证书名称约束。RFC没有指定对网络掩码的任何限制，但是不允许稀疏掩码似乎是明智的。\n这一发现正确地指出了Rustls中的一个函数，该函数在应用于大于64KB的X.501名称时产生不正确的输出。虽然这是一种非常不可能的情况，并且错误不会导致不安全的操作(但可能是连接故障)，但该函数已经更正，可以为所有输入生成有效的输出。\n与其他形式的软件测试一样，归根结底，第三方审核只能显示缺陷的存在，而不能显示缺陷的缺失。话虽如此，报告中的积极反馈和这些发现的低严重性肯定是令人鼓舞的。", "note_en": "In May and June 2020, Cure53 completed an audit of   ring,  webpki, and  rustls. Their report ( PDF) fully describes the audit, and makes for interesting reading.\n First off, though, Dirkjan Ochtman (of the  Quinn project) deserves a great deal of thanksfor ultimately making this happen. We first discussed the possibility of an audit like this atRustFest Paris 2018. He worked with great determination for almost two years to secure a sponsor.Thanks Dirkjan!\n The  Cloud Native Computing Foundation (a part of the Linux Foundation) fundedthis audit, at the request of  Buoyant who use rustls in the data plane of  linkerd.So further thanks are due to Chris Aniszczyk of the Linux Foundation, and Oliver Gould of Buoyantfor their support of these projects.\n    “[..] the team of auditors considered the  general code quality really good and can attestto a solid impression left consistently by all scope items”\n “Both from a design point of view as from an implementationperspective the entire scope can be  considered of exceptionally high standard.”\n “The developer’s intent to provide a high-quality TLS implementation isvery clear and  this goal can be considered as achieved successfully.”\n “Minor recommendations here and there are always possible for any project, but this doesnot change the fact that there is really not much to improve at rustls. Cure53 had therare pleasure of being  incredibly impressed with the presented software.”\n  There were two informational and two minor-severity findings. See  the report for the full details.The discussion below reflects my opinion on these issues.\n  This finding suggests  ring uses formally verified cryptography implementations from the EverCrypt project.It’s hard to argue against formal verification of foundational cryptography code.It’s worth noting here that  ring does already use a formally verified curve25519 implementation(from the  fiat-crypto project).\n  This finding relates to instances of  unwrap() that were free of panics, but where it was too hardto reason that this was the case. The reasoning spanned several different modules, which itself isa readability and maintenance hazard. The code in question has been improved as a result.\n  This finding relates to certificate name constraints expressed as a space of IP addresses asspecified in  RFC5280. The RFC doesn’t specify any constraints on network masks, but itdoes seem sensible to disallow sparse masks.\n  This finding rightly points out a function in rustls that produces incorrect output when appliedto an X.501 Name that is larger than 64KB. While that’s an exceedingly unlikely case, and thebug does not cause unsafe operation (but perhaps connection failure), the function has beencorrected to produce valid output for all inputs.\n  As with other forms of software testing, ultimately a third-party audit can only show thepresence of defects but not their absence. With that said, the positive feedback in thereport and the low severity of these findings are certainly encouraging.", "posttime": "2020-06-15 03:10:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,rustls,audit,项目", "title": "Rustls的第三方审计", "title_en": "Third-Party Audit of Rustls", "transed": 1, "url": "http://jbp.io/2020/06/14/rustls-audit.html", "via": "", "real_tags": ["rust", "rustls", "audit", "项目"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-15 03:10:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apl,网站", "title": "APL自1978年以来[pdf]", "title_en": "APL Since 1978 [pdf]", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3386319", "via": "", "real_tags": ["apl", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请求太多", "note_en": "Too Many Requests", "posttime": "2020-06-15 02:54:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交付,deliveries,请求", "title": "更多无人机交付在美国进行测试", "title_en": "More Drone Deliveries Being Tested in America", "transed": 1, "url": "https://www.roanoke.com/news/education/google-backed-drones-will-drop-library-books-so-kids-in-christiansburg-can-do-their-summer/article_d39a226c-edc1-5cd2-9af3-868ea26f5432.html", "via": "", "real_tags": ["交付", "请求"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，我一直在断断续续地研究一种方法，帮助人们评估自己的学习情况，并找出下一步要学习什么。\n在过去的一周里，我构建了一个新的版本：https://questions.wizardzines.com，，它现在有两组问题：\n这仍然是一项正在进行的工作，但我已经为此工作了很长一段时间，所以我想写下我是如何来到这里的。\n首先，让我们谈谈我的目标。我对帮助那些试图自学的人很感兴趣。我没有任何具体的材料要教--我想帮助人们学习他们想学的东西。\n我通过写博客帖子和杂志做了很多这件事，但我觉得我错过了一些东西--人们真的学到了他们想学的东西吗？他们怎么知道他们是否学会了呢？\n我觉得我想要某种“测验”或“测试”，但我不确定它应该是什么样子。\n让我们非常快速地绕道进入术语。教师在学校中使用的评估方式有两种。\n形成性评价：“用于调整教与学活动以提高学生成就的评价。”\n如果你是在自学，那么分数是没有意义的(谁会在乎你是否在插座考试中得A呢？)。但是形成性评估！如果你能做一些评估来帮助你决定下一步你到底应该自学什么！这看起来更有用。所以我开始对构建某种“形成性评估”工具感兴趣。\n您是否参加过课程(在线或离线！)。首先给你一个测验，你可以用它来检查你在一开始对这个主题的理解情况？它对你有帮助吗？\n我收到了大约90个回复。以下是我从回复中拿走的一些主题：\n人们喜欢使用测验，如果他们可以指导自己的学习(“如果我已经知道了就跳过X部分”)。\n一个人说，他们参加了一次测验，一开始得分很低，这帮助他们意识到，他们实际上并不像他们想象的那样了解课程内容。\n我从中学到的一件事是，对很多人来说，被告知不知道某件事是一种糟糕的经历。\n我的第一个想法是重新设计一个测试，把它作为一种学习方式。所以，它不是告诉你你不知道的东西(哪种，那又怎么样？)，而是帮助你学到一些新的东西！\n所以我针对不同的主题制作了几套抽认卡。这是我制作的第一套抽认卡，如果你想试一试的话，那就是容器上的抽认卡。\n基本上-有1400个问题，你点击卡片就能看到答案，对于每一张卡片，你都将其归类为“我知道”、“我学到了一些东西”或“那令人困惑”(这意味着是一种“其他”类别，你不知道这些，你什么也没学到)。\n这个想法是，答案包含了足够的信息，你实际上可以从他们那里学到一些东西，如果你感兴趣的话，希望能受到启发，去自己学更多的东西。\n“抽认卡”这个词有很多我不想要的包袱--它与语言学习/记忆紧密相关。我自己根本不用闪存卡，所以没有引起我的共鸣。\n格式是有限制的，有时我想在答案中包含更多的信息，而不是空间所能容纳的信息。\n用户界面有点混乱，有些人想不出你应该点击卡片来翻转它。\n也许我从制作这些抽认卡中学到的最重要的一件事是，问题与读者的心理模型是否匹配真的很重要。\n我从写问题开始，记下我通常对特应性疾病所做的陈述，然后把它们变成问题。有时候这真的不管用。\n这里有一个不起作用的例子：我认为“HTTP请求有4个部分：主体、头、请求方法和被请求的路径”这句话相对来说并不令人反感。这就是我对什么是HTTP请求的看法。\n但是如果我问您“HTTP请求的4个部分是什么？”答案是“主体、标头、请求方法和被请求的URL”？事实证明，那是完全不同的！！并不是每个人都认为HTTP请求有4个部分-他们可能认为它有3个部分(第一行、头和正文)。或者2个部分和1个可选部分(第一行和标题，可能还有一个可选的正文)。或者其他方式！所以被问到“HTTP请求的4个部分是什么”是很奇怪的。\n还有很多类似的例子，人们对我提出的一些与他们对主题的看法不符的问题反应不好。所以我了解到，如果我问一个问题，它与读者的心理模型的匹配程度会比发表同样的陈述时的标准更高，所以我了解到，如果我问一个问题，它会被要求更高的标准，因为它与读者的心理模型匹配的程度比发表同样的陈述时要高。\n我认为这里的一个更好的问题是“每个HttpRequest都有头吗？”(是的！HTTP/1.1RFC要求主机报头必须设置！)。但即便如此，这也可能有点棘手--尽管99.99%的HTTP请求都有头，但世界上可能至少有一个HTTP/1.0客户端实现在发送请求时没有标头。\n当然，如果问题/答案与读者的心理模型不匹配，如果他们的心理模型是不正确的，那也没关系，但如果他们的模型是正确的，那么我认为它应该是匹配的。\n我从这些抽认卡上学到的另一件事是，很多人不喜欢多项选择。我还没有想太多，但老实说，我也不太喜欢多项选择题，所以我决定摆脱它。\n我不记得为什么，但我已经让那个小阴谋家在我脑海里晃了一阵子了。实际上，我自己并没有读过整本书，但我一直听到人们在谈论它。这是“小阴谋家”的第一页，如果你没有听说过的话：\n这让我想起了很多我想要做的事情--有问题也有答案，但目标不是让你把所有的问题都“答对”。相反，我认为目标是让你思考你是否知道答案，并边走边学。\n所以，我保留了类似的问答格式，但换成了并排的格式，比如“小阴谋家”(The Little Schemer)。\n你可以同时看到这两个，所以你不会忘记问题是什么。\n然后，更有意义的做法是将所有问题和答案都放在相同的页面上，这样您就可以根据需要轻松地返回查看上一个问题。\n基本上我喜欢它给读者更多的控制权，我认为这很重要。\n我还把这个项目重命名为“问题”，因为这真的是我思考自己学习的方式-我不做“抽认卡”，但我确实经常问自己关于我不理解的主题的问题，找出这些问题的答案，然后重复这些问题，直到我像我想的那样理解这个主题。\n但是，当你不是很多的时候，自己想出正确的问题是很困难的，所以我希望给人们提供一系列问题(和答案)来思考，这将帮助你决定下一步想要学习什么。\n当我在udp上发布第一组问题时，我没有包括一个“我学到了一些东西”的按钮，我注意到了一些奇怪的事情-很多人在推特上写着“我得到了8个⁄10”，“我得到了10个⁄10”之类的东西。\n我有点担心这一点，因为整个想法是为了帮助人们确定他们可以学到的东西，所以说“我得到了8个⁄10”感觉就像是专注于你已经知道的东西，而忽略了最重要的事情-也许你可以学到新东西的两个问题！\n所以我加了一句“我学到了一些东西！”按钮返回到每个问题，并且花费了太多时间构建有趣的SVG+CSS动画，当您按下按钮时播放该动画。到目前为止，它似乎起到了作用-我看到更多的人评论“我学到了一些东西”，而更少的人评论“我得到了9个⁄10”。\n像往常一样，建造简单的小东西需要比我预期的更多的时间！“一些问题和答案”的概念看起来真的很简单，但我已经通过构建这个格式学到了很多，我想我对这种格式还有很多需要学习的地方。\n但我很高兴能学到更多，我很想知道你的想法。如果你想试试，这里又来了：https://questions.wizardzines.com.", "note_en": "For the last few months, I’ve been working on and off on a way to help peopleevaluate their own learning &amp; figure out what to learn next.\n This past week I built a new iteration of this:  https://questions.wizardzines.com, which today has 2sets of questions:\n  It’s still a work in progress, but I’ve been working on this for quite a whileso I wanted to write down how I got here.\n  First, let’s talk about my goal. I’m interested in helping people who aretrying to learn on their own. I don’t have any specific materials I’m trying toteach – I want to help people learn what  they want to learn.\n I’ve done a lot of this by writing blog posts &amp; zines, but I felt like I was missing something –were people really learning what they wanted to learn? How could they tell ifthey’d learned it?\n I felt like I wanted some kind of “quiz” or “test”, but I wasn’t sure what itshould look like.\n  Let’s take a very quick detour into terminology. There are two kinds ofassessment teachers use in school.\n formative assessment: “evaluations used to modify teaching and learning activities to improve student attainment.”\n  Grades are pretty pointless if you’re teaching yourself (who cares if you gotan A in sockets?). But formative assessments! If you could take some kind ofevaluation to help you decide what exactly you should teach yourself next! Thatseems more useful. So I got interested in building some kind of “formativeassessment” tool.\n    have you ever taken a class (online or offline!) where you were given a quizfirst that you could use to check your understanding of the topic at the start?did it help you?\n I got about 90 replies. Here are some themes I took away from the replies:\n people like using quizzes if they can direct their own learning (“skip Xsection if I already know the thing”)\n one person said they took a quiz where they got a low score at the beginningand it helped them realize that they didn’t actually know the course contentas well as they thought\n One thing I learned from this is that being told you  don’t know something isa bad experience for a lot of people.\n  My first idea was to reframe a test as a way to  learn. So instead of itbeing something that tells you what you  don’t know (which, so what?), ithelps you learn something new!\n So I built a few sets of flashcards about various topics.Here’s the first set I built,  flashcards on containers, if you want to try it out.\n   Basically – there are 14ish questions, you click the card to see the answer,and for each card you categorize it as “I knew that!”, “I learned something”,or “that’s confusing” (which is meant to be a kind of “other” category, whereyou didn’t know that and you didn’t learn anything).\n The idea is that the answers contain enough information that you could actuallylearn a little bit from them, and hopefully be inspired to go learn more onyour own if you’re interested.\n      the word “flashcards” has a lot baggage I didn’t want – it’s stronglyassociated with language learning / memorization. I don’t use flashcardsmyself at all myself so it didn’t really resonate with me.\n the format was constrained, and sometimes I wanted to include moreinformation in the answer than there was space for\n the UI was a bit confusing, some people couldn’t figure out that you weresupposed to click on the card to flip it.\n  Probably the most important thing I learned from making these flashcards isthat it really matters how well the question matches the reader’s mental model.\n I started out by writing questions by taking statements I’d normally make about atopic, and turning them into questions. Sometimes this really didn’t work.\n Here’s an example of it not working: I think the statement “a HTTP request has4 parts: a body, the headers, the request method, and the path being requested”is relatively unobjectionable. That how I think about what a HTTP request is.\n But what if I ask you “what are the 4 parts of a HTTP request?” and the answeris “a body, the headers, the request method, and the URL being requested”? Itturns out, that’s totally different!! Not everyone thinks about HTTP requestsas having 4 parts – they might think of it has having 3 parts (the first line,the headers, and the body). Or 2 parts and 1 optional part (the first line, andthe headers, and maybe an optional body). Or some other way! So it’s weird tobe asked “what are the 4 parts of a HTTP request”.\n There were a lot of other examples like this, where people reacted badly tosome question I asked that didn’t match up with how they think about a topic.So I learned that if I’m asking a question, it gets held to a higher standardfor how well it matches with the reader’s mental model than when making thesame statement.\n An example of what I think would be a better question here is “Does every HTTPrequest have headers?” (yes! the HTTP/1.1 RFC requires that the Host header beset!). But even that is maybe a little tricky – probably at least one HTTP/1.0client implementation is out there in the world sending requests withoutheaders, even though 99.99% of HTTP requests have headers.\n Of course, it’s ok if the question/answer doesn’t match the reader’s mentalmodel if their mental model is incorrect, but if their model is correct then Ithink it should match.\n  The other thing I learned from these flashcards is that a lot of people dislikemultiple choice. I haven’t thought about this that much, but honestly I don’treally like multiple choice either so I decided to get rid of it.\n  I don’t remember why, but I’ve had The Little Schemer kicking around in my headfor a while. I haven’t actually read the whole thing myself, but I kept hearingpeople talking about it. Here’s the first page of The Little Schemer, if youhaven’t heard of it:\n  This reminded me a lot of what I was trying to do – there are questions andanswers, but the goal isn’t for you to get all the questions “right”. Instead,I think the goal is for you to think about whether you know the answer yet ornot and learn as you go.\n  So, I kept a similar question/answer format, but switched to a side-by-side format, like the Little Schemer.\n   you can see both at the same time, so you don’t forget what the question was\n it then makes more sense to just put all the questions &amp; answers on the samepage, so you can easily go back and look at the previous question if you want\n Basically I like that it gives the reader more control, which I think is important.\n  I also renamed the project to “questions” because that’s really how I thinkabout learning for myself – I don’t do “flashcards”, but I do constantly askmyself questions about topics I don’t understand, figure out the answers tothose questions, and then repeat until I understand the topic as well as I wantto.\n But coming up with the right questions on your own is hard when you don’t alot, so I’m hopeful that providing folks with a bunch of questions (andanswers) to think about will help you decide what you want to learn next.\n  When I released the first set of questions on UDP, I didn’t include an “Ilearned something” button, and I noticed something weird – a lot of peoplewere tweeting things like “I got  8⁄ 10”, “I got  10⁄ 10”.\n I was a bit worried about this because the whole idea was to help peopleidentify things they could learn, so saying “I got  8⁄ 10” felt like it wasfocusing on the things you already knew and ignoring the most important thing– the 2 questions where maybe you could learn something new!\n So I added an “I learned something!” button back to each question and spent waytoo much time building a fun SVG+CSS animation that played when you pressed thebutton. And so far it seems to have worked – I see more people commenting “Ilearned something” and less “I got  9⁄ 10”.\n  As usual, building small simple things takes more time than I’d expect! Theconcept of “some questions and answers” seems really simple, but I’ve alreadylearned a lot by building this and I think I still have a lot more to learnabout this format.\n But I’m excited to learn more, and I’d love to know your thoughts. Here it isagain if you’d like to try it:  https://questions.wizardzines.com.", "posttime": "2020-06-15 02:53:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人们,people,问题", "title": "帮助人们决定学习什么的问题", "title_en": "Questions to help people decide what to learn", "transed": 1, "url": "https://jvns.ca/blog/2020/06/14/questions-to-help-you-learn/", "via": "", "real_tags": ["人们", "people", "问题"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "那时禅宗是克里斯汀·多德雷尔的一个新项目，旨在提供一种更好的方式来教授冥想。在西方观众中，冥想因为过于复杂、深奥和巴洛克风格而声名狼藉；然而，这些都与事实相差不远。它可以像观察呼吸发生一样简单，也可以从那里开始呼吸。\n如果您对此感兴趣，请查看介绍，并随时查看冥想或技能指南。", "note_en": "When Then Zen is a new project by  Christine Dodrill to offer a better way to teach meditation. Meditation has gotten a really bad reputation in Western audiences as overcomplicated, esoteric and baroque; however those couldn&#39;t be farther from the truth. It can be as simple as watching breathing happen or build off of there.\n If this interests you, please check out the  introduction and feel free to look at the  meditation or  skill guides.", "posttime": "2020-06-15 02:53:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冥想,teach", "title": "教冥想的一种更好的方法", "title_en": "A better way to teach meditation", "transed": 1, "url": "https://when-then-zen.christine.website/", "via": "", "real_tags": ["冥想", "teach"]}, {"category": "", "categoryclass": "", "imagename": "78554a7a00fe56dbde833674de540c00.jpg", "infoid": 1006553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年6月10日，世界各地数以千计的STEM科学家和组织举行罢工，抗议学术界的系统性种族主义。他们联合在#ShutDownSTEM和#Strike4BlackLives等标签下，希望他们的努力将导致学术机构和组织内部采取直接行动，永远消除种族主义。\n在学术界，我们的思想和语言变成了新的认识方式。我们的研究论文变成了加强反黑人叙事的媒体发布、书籍和立法。在STEM，我们创造的技术影响到我们社会的每一个部分，并且经常被武器化来对付黑人。“。在#ShutDownSTEM的网站上写下#ShutDownSTEM的组织者。\n“我不想要更多的多样性和包容性研讨会。这些活动被用来为机构提供一个盾牌，这样它们就可以做最少的事情。“。费米实验室的天体物理学家、“为黑人生活罢工”和#ShutDownStem的组织者布莱恩·诺德(Brian Nord)说。\n虽然黑人和非裔美国人约占美国人口的13%，但他们毕业于9%的理科学士学位和3.9%的本科工程学位。\n相比之下，尽管白人约占美国人口的72%，但白人占理科学位的55.7%，占工科学位的59.3%。虽然亚裔只占美国人口的6%，但他们拥有9%的本科生理科学位和10.8%的本科生工科学位。\n当观察博士毕业生和学术教职员工的人口统计数据时，美国黑人和非裔美国公民的差距变得更加明显。2017年，授予美国公民和永久居民的博士学位中，只有6.7%授予了黑人学生。与此同时，白人获得了70%的博士学位，亚裔获得了10%的博士学位。\n同年，虽然黑人和非裔美国学生占本科生总数的14%，但只有6%的教职员工是黑人。与此同时，81%的教授和80%的讲师是白人。\n教育机构的代表权可能是问题的一部分。研究指出，学生更有可能将同种族和民族的教师视为榜样，而且由于距离他们较近，他们会在教育上投入更多精力，并有更高的大学抱负。来自社区学院的其他研究表明，如果教师和教授与他们的学生有更相似的种族背景，少数族裔学生之间的表现差距可以缩小20%到50%。\n社会经济因素也可能起作用。尽管在过去20年里，越来越多的黑人学生完成了高中学业，进入了大学课程，但他们的辍学率也是所有种族中最高的，债务负担也是最大的。2015年至2016年间，美国公立学校四年制博士生的贷款中值为57968美元，而黑人学生的贷款中值为107602美元。\n鉴于黑人和非裔美国人的家庭收入中位数在美国所有种族中最低(2018年仅为41361美元，而所有种族的平均收入为63179美元)，追求教育的高成本壁垒可能会对大学成绩和抱负产生影响。\n在STEM领域以及更普通的学术界对黑人和非裔美国大学生的待遇，也可能会阻碍许多人从事学术和研究事业。黑人科学家和教职员工不仅经常回忆起自己是房间里唯一的黑人，他们还回忆起无数种族歧视的时刻。他们的成就被贬低并归因于积极的歧视，在工作中无缘无故地受到大学警卫和警察的骚扰，据报道在申请研究拨款时遭遇了负面偏见，这些情况不一而足。\n著名的科学杂志“自然”说：“我们认识到，”自然“是造成研究和学术偏见的白人机构之一。科学事业一直是--而且仍然是--系统性种族主义的同谋，它必须更加努力地纠正这些不公正。\n对技术和行为生物学有浓厚兴趣的科学作家。她目前的重点是这些领域之间的相互作用，以创建有意义的交互、应用程序和环境。\n外层空间挤满了恒星和围绕它们运行的行星，但让恒星成为……的东西之间只有一条细微的界限。\n最近发表在“科学进展”上的一项研究结果报告了对一种普遍享受的公共生活方式的演变的新见解。\n太阳只是我们宇宙中存在的无数恒星中的一颗。但它是最突出的之一，因为它&amp；r；\n一项关于关节内流体和颗粒传输的新研究报告称，相距6英尺的生命可能还不够远。\n我们人类已经完善了很多东西，但还没有完全理解。以玻璃为例，科学家们……。\n发表在“先进光学材料”杂志上的一项新研究突出了一项创新技术，该技术为无线通信提供了信号。", "note_en": "On June 10th 2020, thousands of STEM scientists and organziations around the world went on strike to protest systemic racism in academia. Uniting under hashtags including ‘#ShutDownSTEM’ and ‘#Strike4BlackLives’, they hope their efforts will lead to direct action within academic institutions and organizations to eliminate racism for good.\n  &#34;In academia, our thoughts and words turn into new ways of knowing. Our research papers turn into media releases, books and legislation that reinforce anti-Black narratives. In STEM, we create technologies that affect every part of our society and are routinely weaponized against Black people.” write the organizers of #ShutDownSTEM on their          website      .\n  “I don’t want more diversity and inclusion seminars. Those activities are used to provide a shield to institutions so that they can do the bare minimum.” says Brian Nord, an astrophysist at Fermilab and organizer for ‘Strike For Black Lives’ and #ShutDownStem.\n    While black and African American people make up around 13% of the US population, they          graduate       from 9% of bachelor degrees in science and 3.9% of undergraduate engineering degrees.\n  By comparison, white people make up 55.7% of science degrees and 59.3% of engineering degrees, despite making up around 72% of the US population. Although those of Asian descent account for just 6% of the US population, they hold 9% of undergraduate science degrees and 10.8% of undergraduate engineering degrees.\n  The disparity for black and African American citizens in the US becomes more pronounced when looking at the demographics of Ph.D. graduates and academic faculty members. In          2017      , just 6.7% of PhDs awarded to US citizens and permanent residents were given to black students. Meanwhile, white people received 70% of PhDs, and Asians: 10%.\n  The same year, while black and African American students          accounted       for 14% of the undergraduate population, just 6% of faculty members were black. In the meantime, 81% of professors and 80% of lecturers were white.\n      Representation in institutions of education may be part of the problem.          Research       has pointed out that students are more likely to regard teachers of the same race and ethnicity as role models, and due to proximity to them, put more effort into education and have higher college ambitions. Other          research       from community colleges has suggested that performance gaps between minority students can close between 20% and 50% should teachers and professors have more similar ethnic backgrounds to their students.\n  Socio-economic factors may also play a role. Although increasing numbers of black students have completed high school and enrolled in college programs over the last two decades, they also have some of the highest dropout rates and the largest debt burdens among all ethnicities. Between 2015 and 2016, while the median loan per doctoral student in the US for a four-year program in a public school was $57,968, the same amount for black students was $107, 602.\n    Given that black and African American people have the          lowest       median household income among all ethnicities in the country (at just $41,361 in 2018 compared to an average $63,179 among all ethnicities), high-cost barriers towards pursuing education may make a difference in both college achievement and aspiration.\n  The treatment of black and African American college students in STEM fields, and more general academia, could also discourage many from pursuing academic and research careers. Not only do black scientists and faculty members often recall being the          only       black person in the room, they also recall          numerous       moments of racial discrimination. These range from having their achievements belittled and attributed to &#39;positive discrimination&#39;, to being hassled by university guards and police for no reason while at work, and reportedly experiencing negative bias when applying for research grants.\n  Renowned science journal, Nature,          said      , &#34;We recognize that Nature is one of the white institutions that is responsible for bias in research and scholarship. The enterprise of science has been — and remains — complicit in systemic racism, and it must strive harder to correct those injustices.&#34;\n      Science writer with keen interests in technology and behavioral biology. Her current focus is on the interplay between these fields to create meaningful interactions, applications and environments.\n    Outer space is chock-full of stars and planets orbiting them, but there’s a fine line between what makes a star a ...\n  Findings from a recent study published in Science Advances report new insights on the evolution of a commonly enjoyed pl ...\n  The Sun is just one of countless stars that exist in our universe. But it’s one of the most prominent because it&amp;r ...\n  Life from six feet apart might not be far enough, reports a new study on the transport of fluids and particles in the jo ...\n  There are many things we humans have come to perfect, but don&#39;t yet fully understand. Take glass for example, scientists ...\n  New research published in the journal Advanced Optical Materials highlights an innovative technology that signals for wi ...", "posttime": "2020-06-15 02:35:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑人,people,研究", "title": "为什么斯特姆的黑人这么少？", "title_en": "Why Are There So Few Black People in Stem?", "transed": 1, "url": "https://www.labroots.com/trending/chemistry-and-physics/17877/black-people-stem", "via": "", "real_tags": ["黑人", "people", "研究"]}, {"category": "", "categoryclass": "", "imagename": "e3475b67baadb631e1cb013a37bf088c.jpg", "infoid": 1006552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "钻石矿商被价值数十亿美元的宝石困住了，因为冠状病毒大流行让世界上几乎没有人想要.", "note_en": "  Diamond miners are stuck with billions of dollars worth of gems as the coronavirus pandemic has left very few people around the world wanting to...", "posttime": "2020-06-15 02:35:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "钻石,dollars,商被", "title": "数十亿美元的未售出钻石正在世界各地堆积。", "title_en": "Billions of dollars of unsold diamonds are piling up around the world", "transed": 1, "url": "https://markets.businessinsider.com/news/stocks/diamond-sales-miners-stuck-gems-worth-billions-dollars-coronavirus-2020-6-1029300342", "via": "", "real_tags": ["钻石", "dollars", "商被"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自动区分是深度学习框架的基础。深度学习模型通常使用基于梯度的技术进行训练，Autodiff使得即使是从巨大的、复杂的模型中也很容易获得梯度。“反向模式自动比较”是大多数深度学习框架使用的自动比较方法，因为它的效率和准确性。\n小型autodiff框架将处理标量。我们可以(稍后)使用NumPy将其矢量化。\n术语说明：从现在开始，“autodiff”将指“反向模式autodiff”。“Gradient”用法松散，但在本文中通常指“一阶偏导数”。\na=4 b=3 c=a+b#=4+3=7 d=a*c#=4*7=28。\n问题1：$d$相对于$a$的梯度是多少，即$\\frac{\\Partial{d}}{\\Partial{a}}$？(来试试这个吧！)。\n有很多方法可以求解Q1，但我们使用乘积规则，即如果$y=x_1x_2$，则$y‘=x_1’x_2+x_1x_2‘$。\nphew…。如果你想知道$\\frac{\\Partial{d}}{\\Partial{b}}$，你必须重新执行这个过程。\n现在我们来看一下解决Q1问题的自动求差方法。以下是一个数字：\n在左边，我们看到系统用图形表示。每个变量都是一个节点；例如，$d$是最上面的节点，$a$和$b$是最下面的叶节点。\n在右边，我们从autodiff的角度看系统。让我们将图边上的值称为局部导数。通过使用局部导数和简单的规则，我们将能够计算出我们想要的导数。\n这是Q1的答案，用自动差分法计算。你能看出它与这个数字有什么关系吗？\n我们通过查找从$d$到$a$(不与虚线箭头相反)的路由，然后应用以下规则，从图中获得此答案：\n第一条路线是直接从$d$到$a$，这给我们提供了$\\frac{\\Partial{\\bar{d}{\\Partial{a}}$Term。第二条路线是从$d$到$c$再到$a$，这给出了术语$\\frac{\\Partial{\\bar{d}{\\Partial{c}}*\\frac{\\Partial{\\bar{c}{\\Partial{a}}$。\n我们的autodiff实现将沿着图向下，计算$d$相对于每个子节点的导数，而不是像我们刚才对$d$所做的那样，只计算特定节点的导数。请注意，我们可以计算$d$相对于$c$和$b$的梯度，而不需要太多的工作。\n我们在上面的图形边上看到了“本地导数”，其形式为：$\\frac{\\Partial\\bar{y}}{\\Partial x}$。\n一般而言：要获得局部导数，请将进入节点的变量视为不是其他变量的函数。\n例如，回想一下$d=a*c$。然后将$\\frac{\\Partial{d}}{\\Partial{a}}=2a+b$与$\\frac{\\Partial\\bar{d}}{\\Partial a}=c$进行比较。局部导数$\\frac{\\PARTIAL\\BAR{d}}{\\PARTIAL a}=c$，是在对$d$的表达式进行微分之前将$c$视为常量而获得的。\n定义简单函数的局部导数通常很容易，如果您知道局部导数，那么将函数添加到autodiff框架中也很容易。例如：\n加法：$n=a+b$，本地导数为：$\\frac{\\Partial\\bar{n}}{\\Partial a}=1$和$\\frac{\\Partial\\bar{n}}{\\Partial b}=1$。\n乘法：$n=a*b$，本地导数为：$\\frac{\\Partial\\bar{n}}{\\Partial a}=b$和$\\frac{\\Partial\\bar{n}}{\\Partial b}=a$。\n函数get_gradients使用节点的渐变数据递归地遍历图形，计算渐变。它使用我们在上面看到的规则：\n堆栈中的元组(在get_gradients中)类似于grad中的元组，但是它们包含当前路由值，而不是局部导数值。\n从集合导入defaultdict类Var：&#34；&#34；&#34；一个叶节点(没有子节点)。&#34；&#34；&#34；def__init__(self，value)：self。value=value#节点的标量值。类add：&#34；&#34；&#34；&#34；&#34；&#34；&#34；&#34；def__init__(self，a，b)：self。值=a。值+b。重视自我。grad=[(a，1)，(b，1)]#子节点&amp；对应&#39；本地导数&39；class mul：&#34；&#34；&#34；&#34；&#34；&#34；def__init__(self，a，b)：self。值=a。值*b。重视自我。梯度=[(a，b.。值)、(b，a。value)]def get_gradients(Parent_Node)：&#34；&#34；&#34；&#34；往下走，计算`parent_node`对每个节点的导数。&#34；&#34；&#34；&#34；gradients=defaultdict(lambda：0)stack=parent_node。格拉德。copy()#(节点，ROUTE_VALUE)元组列表。而STACK：NODE，ROUTE_VALUE=STACK。POP()梯度[node]+=route_value#&#34；将不同的路由相加。&#34；如果没有isinstance(node，Var)：#如果节点有子节点，则将它们放到堆栈中。对于CHILD_NODE，节点中的CHILD_ROUTE_VALUE。葛兰德：堆叠。APPEND((CHILD_NODE，CHILD_ROUTE_VALUE*ROUTE_VALUE))#&#34；将路径的边相乘。&#34；RETURN DICT(渐变)。\na=Var(4)b=Var(3)c=add(a，b)#=4+3=7 d=mul(a，c)#=4*7=28渐变=get_gradients(D)print(&#39；d.value=&#39；，d..。值)打印(&#34；d关于a的偏导数=&#34；，梯度[a])\n类操作：&#34；&#34；&#34；允许使用+、*、-等。&#34；&#34；&#34；def__add__(self，ther)：return add(self，Other)def__mul__(self，ther)：return MUL(self，Other)def__sub__(self，Other)：return add(self，Neg(Other))def__truediv__(self，Other)：return Mul(self，Inv(Other))class Var(Ops)：def__init_(self，value)：self。value=值类添加(操作)：def__init__(self，a，b)：self。值=a。值+b。重视自我。grad=[(a，1)，(b，1)]class mul(Ops)：def__init__(self，a，b)：self。值=a。值*b。重视自我。梯度=[(a，b.。值)、(b，a。value)]class neg(运算)：def__init__(self，var)：self。值=-1*var。重视自我。grad=[(var，-1)]类存货(操作)：def__init__(self，var)：self。值=1/var。重视自我。grad=[(var，-var.。值**-2)]。\n我们可以从我们添加到框架中的函数中获得任意函数的梯度。例如：\na=Var(230.3)b=Var(33.2)def(a，b)：return(a/b-a)*(b/a+a+b)*(a-b)y=f(a，b)梯度=获取梯度(Y)print(&#34；y关于a的偏导数=&#34；，梯度[a])print(&#34；y关于b的偏导数=&#34；，渐变[b])。\ny对a的偏导数=-153284.83150602411 y对b的偏导数=3815.0389441500993。\nΔ=Var(1e-8)Numerical_grad_a=(f(a+δ，b)-f(a，b))/Delta Numerical_grad_b=(f(a，b+Delta)-f(a，b))/Delta Print(&#34；a=#34；，Numerical_grad_a的数值估计。value)打印(&#34；b=&#34；，Numerical_grad_b.。值)。\n将numpy导入为NP类Sin(Ops)：def__init__(self，var)：self。值=NP。Sin(var.。值)自我。梯度=[(var，np。Cos(var.。value))]class Exp(Ops)：def__init__(self，var)：self。值=NP。EXP(变量。值)自我。grad=[(var，sel.。value)]类日志(Ops)：def__init__(self，var)：self。值=NP。LOG(变量。值)自我。grad=[(var，1./var.。值)]。\nA=Var(43.。)。B=Var(3.)。C=Var(2.)。def(a，b，c)：F=Sin(a*b)+Exp(c-(a/b))返回Log(f*f)*Cy=f(a，b，c)梯度=get_gradients(Y)print(&#34；y关于a的偏导数=&#34；，梯度[a])print(&#34；y关于b的偏导数=&#34；，渐变[b])打印(&#34；y关于c的偏导数=&#34；，渐变[c])。\ny对a的偏导数=60.85353612046653 y对b的偏导数=872.2331479536114 y对c的偏导数=-3.2853671032530305\nDelta=Var(1e-8)Numerical_grad_a=(f(a+Delta，b，c)-f(a，b，c))/Delta Numerical_grad_b=(f(a，b+Delta，c)-f(a，b，c))/Delta Numerical_grad_c=(f(a，b，c+Delta)-f(a，b，c))/Delta print(&#34；a=#34；，Numerical_grad_a的数值估计。value)打印(&#34；b=&#34；，Numerical_grad_b.。value)打印(&#34；c=&#34；，Numerical_grad_c的数值估计。值)。\na=60.85352186602222的数值估计b=872.232160009645 c=-3.285367089489455的数值估计。\n对我们的最小框架最有效的补充将是向量化(但不是以下面的方式执行)。\n我们将研究一种计算效率极低的方法来向量化我们的autodiff框架。(不推荐将其用于任何事情，因为它太慢了。)。\n将numpy导入为np to_var=np。Vector torize(lambda x：var(X))#将NumPy数组转换为Var对象数组TO_VERVIES=NP。矢量化(λ变量：变量。value)#从Var对象数组中获取值。\n将matplotlib.pylot导入为PLT def update_weights(权重、渐变、速率)：对于范围内的i(权重。Shape[0])：对于范围内的j(权重。Shape[1])：权重[i，j]。value-=lrate*梯度[权重[i，j]]np。随机的。SEED(0)INPUT_SIZE=50 OUTPUT_SIZE=10 LARATE=0.001 x=TO_VAR(NP。随机的。RANDOM(INPUT_SIZE))y_TRUE=to_var(np.。随机的。随机(Output_Size))权重=to_var(np.。随机的。随机((INPUT_SIZE，OUTPUT_SIZE))，对于范围(100)内的i，LASS_VALUES=[]：Y_PRED=Np。点(x，重量)损失=Np。SUM((y_true-y_pred)*(y_true-y_pred))LOSS_VALUES。追加(损失。值)渐变=get_gradients(损耗)update_weights(权重、渐变、速率)PLT。绘制(亏损)PLT。xlabel(&#34；时间点&#34；)；PLT。ylabel(&#34；亏损&34；)；PLT。标题(#34；单线性层学习)PLT。show()。\n马上就要来了：第二部分，我们将研究如何更高效地向量化我们的最小框架。\n份额：", "note_en": "Automatic differentiation is the foundation upon which deep learning frameworks lie. Deep learning models are typically trained using gradient based techniques, and autodiff makes it easy to get gradients, even from enormous, complex models. ‘Reverse-mode autodiff’ is the autodiff method used by most deep learning frameworks, due to its efficiency and accuracy.\n   The small autodiff framework will deal with scalars. We can (and will later) use NumPy to vectorise it.\n Note on terminology: from now on ‘autodiff’ will refer to ‘reverse-mode autodiff’. ‘Gradient’ is used loosely, but in this context generally means ‘first order partial derivative’.\n   a  =  4 b  =  3 c  =  a  +  b  # = 4 + 3 = 7 d  =  a  *  c  # = 4 * 7 = 28\n Q1: What is the gradient of $d$ with respect to $a$, i.e. $\\frac{\\partial{d}}{\\partial{a}}$? (Go ahead and try this!)\n  There’s many ways to solve  Q1, but let’s use the product rule, i.e. if $ y = x_1x_2 $ then $y’ = x_1’x_2 + x_1x_2’$.\n Phew… and if you wanted to know $\\frac{\\partial{d}}{\\partial{b}}$ you’d have to carry out the process again.\n  We’ll now look at the autodiff way to solve  Q1. Here is a figure:\n  On the left we see the system represented as a graph. Each variable is a node; e.g. $d$ is the topmost node, and $a$ and $b$ are leaf nodes at the bottom.\n On the right we see the system from autodiff’s point of view. Let’s call the values on the graph edges  local derivatives. By using local derivatives and simple rules, we will be able to compute the derivatives that we want.\n Here is the answer to  Q1, calculated the autodiff way. Can you see how it relates to the figure?\n We get this answer from the graph by finding the routes from $d$ to $a$ (not going against the dotted arrows), and then applying the following rules:\n  The first route is straight from $d$ to $a$, which gives us the $\\frac{\\partial{\\bar{d}}}{\\partial{a}}$ term. The second route is from $d$ to $c$ to $a$, which gives us the term $\\frac{\\partial{\\bar{d}}}{\\partial{c}} * \\frac{\\partial{\\bar{c}}}{\\partial{a}}$.\n Our autodiff implementation will go down the graph and compute the derivative of $d$ with respect to every sub-node, rather than just computing it for a particular node, as we have just done with $d$. Notice that we could compute the gradient of $d$ with respect to $c$, and $b$, without much more work.\n  We saw ‘local derivatives’ on the graph edges above, written in the form: $ \\frac{\\partial \\bar{y} }{\\partial x}$.\n  In general: to get a local derivative, treat the variables going into a node as not being functions of other variables.\n For example, recall that $d = a * c$. Then compare $ \\frac{\\partial{d}}{\\partial{a}} = 2a + b $, to $ \\frac{\\partial \\bar{d} }{\\partial a} = c $. The local derivative $\\frac{\\partial \\bar{d} }{\\partial a} = c$, is obtained by treating $c$ as a constant before differentiating the expression for $d$.\n  It is often easy to define the local derivatives of simple functions, and adding functions to the autodiff framework is easy if you know the local derivatives. E.g.\n Addition: $n = a + b$.The local derivatives are: $\\frac{\\partial \\bar{n} }{\\partial a} = 1$ and $\\frac{\\partial \\bar{n} }{\\partial b} = 1$.\n Multiplication: $n = a * b$.The local derivatives are: $\\frac{\\partial \\bar{n} }{\\partial a} = b$ and $\\frac{\\partial \\bar{n} }{\\partial b} = a$.\n     The function  get_gradients uses the nodes’  grad data to go through the graph recursively, computing the gradients. It uses the rules we saw above:\n  The tuples in  stack (in  get_gradients) are similar to the tuples in  grad, but they contain the current route value, instead of the local derivative value.\n  from  collections  import  defaultdict class  Var :  &#34;&#34;&#34;A leaf node (a node with no children).&#34;&#34;&#34;  def  __init__ ( self ,  value ):  self . value  =  value  # the scalar value of the node. class  Add :  &#34;&#34;&#34;The node that results from adding two nodes.&#34;&#34;&#34;  def  __init__ ( self ,  a ,  b ):  self . value  =  a . value  +  b . value  self . grad  =  [( a ,  1 ),  ( b ,  1 )]  # child nodes &amp; corresponding &#39;local derivatives&#39; class  Mul :  &#34;&#34;&#34;The node that results from multiplying two nodes.&#34;&#34;&#34;  def  __init__ ( self ,  a ,  b ):  self . value  =  a . value  *  b . value  self . grad  =  [( a ,  b . value ),  ( b ,  a . value )] def  get_gradients ( parent_node ):  &#34;&#34;&#34;Go down the graph, and compute derivative of `parent_node` with respect to each node.&#34;&#34;&#34;  gradients  =  defaultdict ( lambda  :  0 )  stack  =  parent_node . grad . copy ()  # list of (node, route_value) tuples.  while  stack :  node ,  route_value  =  stack . pop ()  gradients [ node ]  +=  route_value  # &#34;Add together the different routes.&#34;  if  not  isinstance ( node ,  Var ):  # if the node has children, put them onto the stack.  for  child_node ,  child_route_value  in  node . grad :  stack . append (( child_node ,  child_route_value  *  route_value ))  # &#34;Multiply the edges of a route.&#34;  return  dict ( gradients )\n  a  =  Var ( 4 ) b  =  Var ( 3 ) c  =  Add ( a ,  b )  # = 4 + 3 = 7 d  =  Mul ( a ,  c )  # = 4 * 7 = 28 gradients  =  get_gradients ( d ) print ( &#39;d.value =&#39; ,  d . value ) print ( &#34;The partial derivative of d with respect to a =&#34; ,  gradients [ a ])\n                  class  Ops :  &#34;&#34;&#34;Enables use of +, *, -, etc.&#34;&#34;&#34;  def  __add__ ( self ,  other ):  return  Add ( self ,  other )  def  __mul__ ( self ,  other ):  return  Mul ( self ,  other )  def  __sub__ ( self ,  other ):  return  Add ( self ,  Neg ( other ))  def  __truediv__ ( self ,  other ):  return  Mul ( self ,  Inv ( other )) class  Var ( Ops ):  def  __init__ ( self ,  value ):  self . value  =  value  class  Add ( Ops ):  def  __init__ ( self ,  a ,  b ):  self . value  =  a . value  +  b . value  self . grad  =  [( a ,  1 ),  ( b ,  1 )] class  Mul ( Ops ):  def  __init__ ( self ,  a ,  b ):  self . value  =  a . value  *  b . value  self . grad  =  [( a ,  b . value ),  ( b ,  a . value )]  class  Neg ( Ops ):  def  __init__ ( self ,  var ):  self . value  =  - 1  *  var . value  self . grad  =  [( var ,  - 1 )] class  Inv ( Ops ):  def  __init__ ( self ,  var ):  self . value  =  1  /  var . value  self . grad  =  [( var ,  - var . value  **  - 2  )]\n  We can get the gradients of arbitrary functions made from the functions we’ve added to the framework. E.g.\n a  =  Var ( 230.3 ) b  =  Var ( 33.2 ) def  f ( a ,  b ):  return  ( a  /  b  -  a )  *  ( b  /  a  +  a  +  b )  *  ( a  -  b ) y  =  f ( a ,  b ) gradients  =  get_gradients ( y ) print ( &#34;The partial derivative of y with respect to a =&#34; ,  gradients [ a ]) print ( &#34;The partial derivative of y with respect to b =&#34; ,  gradients [ b ])\n The partial derivative of y with respect to a = -153284.83150602411The partial derivative of y with respect to b = 3815.0389441500993\n  delta  =  Var ( 1e-8 ) numerical_grad_a  =  ( f ( a  +  delta ,  b )  -  f ( a ,  b ))  /  delta numerical_grad_b  =  ( f ( a ,  b  +  delta )  -  f ( a ,  b ))  /  delta print ( &#34;The numerical estimate for a =&#34; ,  numerical_grad_a . value ) print ( &#34;The numerical estimate for b =&#34; ,  numerical_grad_b . value )\n    import  numpy  as  np class  Sin ( Ops ):  def  __init__ ( self ,  var ):  self . value  =  np . sin ( var . value )  self . grad  =  [( var ,  np . cos ( var . value ))] class  Exp ( Ops ):  def  __init__ ( self ,  var ):  self . value  =  np . exp ( var . value )  self . grad  =  [( var ,  self . value )]  class  Log ( Ops ):  def  __init__ ( self ,  var ):  self . value  =  np . log ( var . value )  self . grad  =  [( var ,  1.  /  var . value )]\n  a  =  Var ( 43. ) b  =  Var ( 3. ) c  =  Var ( 2. ) def  f ( a ,  b ,  c ):  f  =  Sin ( a  *  b )  +  Exp ( c  -  ( a  /  b ))  return  Log ( f  *  f )  *  c y  =  f ( a ,  b ,  c ) gradients  =  get_gradients ( y ) print ( &#34;The partial derivative of y with respect to a =&#34; ,  gradients [ a ]) print ( &#34;The partial derivative of y with respect to b =&#34; ,  gradients [ b ]) print ( &#34;The partial derivative of y with respect to c =&#34; ,  gradients [ c ])\n The partial derivative of y with respect to a = 60.85353612046653The partial derivative of y with respect to b = 872.2331479536114The partial derivative of y with respect to c = -3.2853671032530305\n delta  =  Var ( 1e-8 ) numerical_grad_a  =  ( f ( a  +  delta ,  b ,  c )  -  f ( a ,  b ,  c ))  /  delta numerical_grad_b  =  ( f ( a ,  b  +  delta ,  c )  -  f ( a ,  b ,  c ))  /  delta numerical_grad_c  =  ( f ( a ,  b ,  c  +  delta )  -  f ( a ,  b ,  c ))  /  delta print ( &#34;The numerical estimate for a =&#34; ,  numerical_grad_a . value ) print ( &#34;The numerical estimate for b =&#34; ,  numerical_grad_b . value ) print ( &#34;The numerical estimate for c =&#34; ,  numerical_grad_c . value )\n The numerical estimate for a = 60.85352186602222The numerical estimate for b = 872.232160009645The numerical estimate for c = -3.285367089489455\n    The most fruitful addition to our minimal framework would be vectorisation (but  not carried out in the manner that follows).\n   We will look at an incredibly computationally inefficient way to vectorise our autodiff framework.(It is not recommended to use this for anything, because of how slow it is.)\n   import  numpy  as  np to_var  =  np . vectorize ( lambda  x  :  Var ( x ))  # convert NumPy array into array of Var objects to_vals  =  np . vectorize ( lambda  var  :  var . value )  # get values from array of Var objects\n  import  matplotlib.pyplot  as  plt def  update_weights ( weights ,  gradients ,  lrate ):  for  i  in  range ( weights . shape [ 0 ]):  for  j  in  range ( weights . shape [ 1 ]):  weights [ i ,  j ]. value  -=  lrate  *  gradients [ weights [ i ,  j ]] np . random . seed ( 0 ) input_size  =  50 output_size  =  10 lrate  =  0.001 x  =  to_var ( np . random . random ( input_size )) y_true  =  to_var ( np . random . random ( output_size )) weights  =  to_var ( np . random . random (( input_size ,  output_size ))) loss_vals  =  [] for  i  in  range ( 100 ):  y_pred  =  np . dot ( x ,  weights )  loss  =  np . sum (( y_true  -  y_pred )  *  ( y_true  -  y_pred ))  loss_vals . append ( loss . value )  gradients  =  get_gradients ( loss )  update_weights ( weights ,  gradients ,  lrate )  plt . plot ( loss_vals ) plt . xlabel ( &#34;Time step&#34; );  plt . ylabel ( &#34;Loss&#34; );  plt . title ( &#34;Single linear layer learning&#34; ) plt . show ()\n  Coming soon: a part two, where we look at how to vectorize our minimal framework more efficiency.\nShare:", "posttime": "2020-06-15 02:35:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,反向,reverse,var", "title": "从头开始：反向模式自动区分(Python中)", "title_en": "From scratch: reverse-mode automatic differentiation (in Python)", "transed": 1, "url": "https://sidsite.com/posts/autodiff/", "via": "", "real_tags": ["python", "反向", "reverse", "var"]}]