[{"category": "", "categoryclass": "", "imagename": "145ee9abadc7081fbd669e405d487bae.jpg", "infoid": 1071860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在 13 岁，这家总部位于旧金山的网站随着在线众筹世界的发展而成熟。而且，当然，Indiegogo 有一个前排座位，可以应对所有的起起落落。 Indiegogo 推出了数百万美元的活动，但该平台经常与 Kickstarter 进行比较，Kickstarter 已成为该类别的代名词。杨坐下来讨论在他任职期间 Indiegogo 发生了怎样的变化、众筹是如何演变的，以及两者在大流行后的世界中会是什么样子。我在 Reddit 做核心产品，当 Indiegogo 的董事会和创始人联系时，真的是这样，“嘿，我们会喜欢有产品经验和社区背景的人。” Indiegogo 中发生的事情实际上是对“我们的核心价值观是什么？”的评估。当我接过马鞍和统治时，真正关注的是我们是谁的核心，我们想要追求的细分市场，以及我们想要关注的地方。我们想把我们的产品集中在哪里？从这个角度来看，在过去的两年里，我们一直在低头，只是在内部工作，专注于核心——我们称之为“将人群带回众筹”。我认为很多平台本质上都非常具有交易性，所以我认为支持者、消费者和用户已经接受了亚马逊的培训，可以点击按钮并在两个小时后得到东西。众筹的前提是非常不同的。您可能会也可能不会在您期望的时间范围内获得此福利，并帮助教育支持者和周围的社区，这才是我们真正的核心。在过去的两年里，我们经历了 COVID，但自从我加入以来，我们一直在盈利，这是巨大的。我们可以控制自己的命运，真正花时间做正确的事情，并在信任和安全、社区等领域进行投资，这是我们真正想要的。我们没有盈利。我很享受，然后我们削减到盈利，或者至少是一种中立的状态，随着领导层的任何变化，一些终身职位的人选择退出，我们基本上在一夜之间变成了一个新团队，以重新创建公司，在过去的几年里，我们一直在缓慢地增加人员，但始终关注盈利能力和控制我们自己的命运。除了人们改变角色之外，还必须发生什么才能使公司盈利？\n确实加倍努力确保我们了解我们的销售渠道，并确保从供应的角度来看，我们有来自多个类别的多个活动。显然，我们的面包和黄油就是我们所说的技术和创新、消费电子硬件，但也看看我们可以依靠的其他类别。我们在漫画、旅行、户外活动方面绝对强大，我们可以通过在我们看到增长的不同领域扩展我们的楔子和类别来做些什么。我认为我们目前看到的一个趋势是大量绿色技术。只是想了解哪些类别正在增长，我们的品牌在哪些方面与企业家和支持者产生共鸣。这就是需要发生的事情——确保我们在平台上有足够的供应，而且只是从支持者方面来看，我们传统上并没有关注支持者方面。我们非常关注供应方，但真正开始再次回到众筹中，依靠我的 Reddit 经验，确保我们能够以新的和有趣的方式与社区互动。", "note_en": "Now 13 years old, the San Francisco-based site matured alongside the world of online crowdfunding. And, certainly, Indiegogo had a front-row seat for all of the ups and downs. Indiegogo introduced several million-dollar campaigns, but the platform has often suffered from comparisons to Kickstarter, a service that has become synonymous with the category for many.\n Yang sat down to discuss how Indiegogo has changed under his tenure, how crowdfunding has evolved and what both will look like in a post-pandemic world.\n   I was at Reddit doing core product, and when Indiegogo’s board and founders reached out, it was really around, “Hey, we would love somebody with product experience, a background in community.” What was going on in Indiegogo was really an evaluation of, “What’s our core values?” When I took the saddle and the reigns, it was really focusing on that core of who we are, what segments do we want to go after, and where do we want to focus. Where do we want to focus our product?\n  From that perspective, we’ve been really heads-down for the last two years, just working on ourselves, internally, and focusing on the core — what we’re terming “bringing the crowd back in crowdfunding.” I think a lot of the platforms have been very transactional in nature, and so I think backers and consumers and users have been trained by Amazon to click a button and get things two hours later. The premise of crowdfunding is very different.\n You may or may not get this perk delivered in the time frame that you’re expecting, and to help educate backers and the community around that is really core to who we are. We’ve been through the last two years with COVID, but we’ve been profitable since I’ve joined, which is huge. We can control our own destiny and really take the time to do things right and invest in areas like trust and safety, like community, that we really wanted to.\n  We weren’t profitable. I enjoyed and then we cut to profitability, or at least kind of a neutral state, and with any kind of change in leadership, some tenured folks opted out, and we basically became a new team overnight to kind of re-found the company, and we’ve been slowly adding people over the last couple years, but always with that eye on profitability and controlling our own destiny.\n Beyond people changing roles, what had to happen in order for the company to become profitable?\n Really doubling down on making sure that we understood our sales pipeline and making sure that, from a supply perspective, that we had a number of campaigns from across a number of categories. Obviously, our bread and butter is what we call tech and innovation, consumer electronics hardware, but also seeing what other categories that we can lean into. We’re definitely strong in comics, travel, outdoors, and what can we do from expanding our wedge and our categories in different areas that we’re seeing growth. I think a trend that we’re currently seeing is a lot of green tech. Just trying to understand what categories are growing, where our brand resonates with entrepreneurs and backers.\n That’s what needed to happen — just making sure that we had adequate supply on the platform, and also just from the backer side, we had not traditionally focused on the backer side. We had heavily focused on the supply side, but really starting to, again, return back to the crowd in crowdfunding, leaning on my Reddit experience, just making sure that we can engage the community in new and interesting ways.", "posttime": "2021-08-07 04:31:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "首席,ceo,支持者", "title": "Indiegogo 首席执行官谈众筹如何应对大流行", "title_en": "\n\t\t\t\tIndiegogo’s CEO on how crowdfunding navigated the pandemic\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/indiegogos-ceo-on-how-crowdfunding-navigated-the-pandemic/", "via": "", "real_tags": ["首席", "ceo", "支持者"]}, {"category": "", "categoryclass": "", "imagename": "11db16725e03a348d89edd16ca62bb0b.jpg", "infoid": 1071859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自去年 4 月完成合并以来，T-Mobile 一直在将 Sprint 整合到其运营中。本周详细介绍了下一步，运营商网站上的一个支持页面显示 T-Mobile 计划在 2022 年 6 月 30 日关闭 Sprint 的 4G LTE 网络。 Light Reading 发现的该页面详细说明了原因这样做。该公司表示，“淘汰旧的网络技术”使其“释放资源和频谱，这将有助于我们加强整个网络，让所有客户转向更先进的技术并弥合数字鸿沟。”该帖子继续说，此过程的一部分“涉及将 Sprint 的 LTE 频谱转移到 T-Mobile 网络。” T-Mobile 表示，“大多数”Sprint LTE 和 5G 设备都可以使用其 LTE 或 5G 网络。它补充说，只要这些 Sprint 用户从 Sprint 发行的 SIM 卡升级到 T-Mobile 的 SIM 卡，这些设备“将继续在 T-Mobile 的 LTE 和 5G 网络上运行”。您还需要确保为语音通话启用了 LTE 语音（也称为 VoLTE）。该运营商补充说，它将联系那些可能受到转换影响的人，并表示它已经“从去年年底开始发送通知”。自合并完成以来，T-Mobile 一直致力于将 Sprint 用户和设备转移到其网络上，上个月宣布“80% 的 Sprint 客户流量”现在在其网络上进行，“三分之一”的 Sprint 客户已经已转移到 T-Mobile。关闭 Sprint 的 4G LTE 网络是 T-Mobile 的最新关闭。去年 7 月，该运营商关闭了 Sprint 的 5G 网络以支持其自己的 5G 产品，同时它最近宣布计划在 2022 年 1 月 1 日关闭 Sprint 的旧 3G CDMA 网络。 Dish 从 T-Mobile 购买了 Boost Mobile 预付费品牌作为司法部对 Sprint 合并的要求的一部分，由于 Boost 用户仍然拥有连接到前 Sprint 网络的设备，因此已公开反对关闭 3G 网络。 T-Mobile 反驳说，它在 2020 年 10 月将这些计划通知了 Dish，远远早于合同规定的六个月通知。\n作为 DOJ 中介交易的一部分，Dish 被授予在 T-Mobile 建立自己的 5G 网络的同时使用 T-Mobile 网络七年的能力。这家卫星电视公司最近宣布与 AT&amp;T 建立合作伙伴关系，以使用其网络，因为它与 T-Mobile 的关系变坏了。目前尚不清楚这一最新举措将如何影响 Dish 或 Boost。 Boost Mobile 执行副总裁斯蒂芬斯托科尔斯告诉 CNET，他的公司“仍在对公告进行一些分析”，但没有进一步详细说明。保持尊重，保持文明并保持话题。我们会删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时自行决定关闭讨论线程。", "note_en": "T-Mobile has been moving to integrate Sprint into its operations since completing its merger last April. This week the next step was detailed, with a  support page on the carrier&#39;s website revealing that T-Mobile plans to shut down Sprint&#39;s 4G LTE network on June 30, 2022.\n The page, spotted by  Light Reading, details a bit about why it is doing this. The company says that &#34;retiring older network technologies&#34; allow it &#34;to free up resources and spectrum that will help us strengthen our entire network, move all customers to more advanced technologies and bridge the Digital Divide.&#34; Part of this process, the post continues, &#34;involves moving Sprint&#39;s LTE spectrum to the T-Mobile network.&#34;\n   T-Mobile says that &#34;most&#34; Sprint LTE and 5G devices can work with its LTE or 5G network. It adds that those devices &#34;will continue to operate on T-Mobile&#39;s LTE and 5G networks,&#34; so long as those Sprint users upgrade from Sprint-issued SIM cards to ones from T-Mobile. You will also need to make sure that Voice over LTE (also known as VoLTE) is enabled for voice calls.\n The carrier adds that it will be contacting those who might be impacted by the switch, stating that it already &#34;began sending notifications late last year.&#34;\n T-Mobile has been working to move Sprint users and devices onto its network since the merger was finalized,  announcing last month that &#34;80% of Sprint customer traffic&#34; is now carried on its network with &#34;one-third&#34; of Sprint customers having already been moved to T-Mobile.\n Shuttering Sprint&#39;s 4G LTE network is the latest shutdown for T-Mobile. Last July the carrier   turned off Sprint&#39;s 5G network to bolster its own 5G offering while it has more recently announced that plans to shutter Sprint&#39;s older 3G CDMA network on Jan. 1, 2022.\n Dish, which   purchased the Boost Mobile prepaid brand from T-Mobile as part of a Department of Justice requirement for the Sprint merger, has spoken out against the 3G network shutdown as Boost users still have devices that connect to the former Sprint network. T-Mobile has countered by saying that it notified Dish about these plans in October 2020, well ahead of the six months notice it was required to give by contract.\n As part of a   DOJ-brokered deal, Dish was granted the ability to use T-Mobile&#39;s network for seven years while it builds out its own 5G network. The satellite TV company   recently announced a partnership with AT&amp;T to use its network as its relationship with T-Mobile turned sour.\n It is unclear how this latest move might impact Dish or Boost. Stephen Stokols, executive vice president of Boost Mobile, told CNET that his company was &#34;still doing some analysis&#34; on the announcement but did not elaborate further.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2021-08-07 04:17:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "关闭,shut,mobile", "title": "T-Mobile 将于 2022 年 6 月 30 日关闭 Sprint 的 4G LTE 网络", "title_en": "T-Mobile Will Shut Down Sprint's 4G LTE Network on June 30, 2022", "transed": 1, "url": "https://www.cnet.com/tech/mobile/t-mobile-will-shut-down-sprints-4g-lte-network-on-june-30-2022/", "via": "", "real_tags": ["关闭", "shut", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "8d830fb2b2b33029a548c72ef94be3f6.jpeg", "infoid": 1071858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 CNBC 获得的初步计划，谷歌正在规划另一个硅谷园区，该园区将毗邻一个部分致力于硬件的新中心。从 2018 年开始，谷歌在加利福尼亚州圣何塞北部的土地上花费了超过 3.89 亿美元，该公司此后提交了详细的初步提案，显示了其对该空间的计划的先见之明。这些作为“研发”设施提交的计划显示了一个硬件运营中心和一个可供公众访问的独立新技术园区，位于其目前位于山景城的总部和最近批准的大型混合用途园区之间在圣何塞。被称为“中点”的未来科技园区将包括五座办公楼，这些办公楼通过一条道路上的人行天桥相连。根据几份规划文件，它将毗邻三座工业建筑，这些建筑将为其硬件部门提供一些业务，包括 Nest 产品。谷歌已经提交了一个“研发”中心的计划，其中包括对三座工业建筑的数百次更新。根据 CNBC 查看的计划和许可，包括会议室、休息区、微型厨房、设备平台、传送带和运输仓库。这些计划提到了“谷歌硬件”和“Nest”，它们指的是该公司的联网家庭业务。据公司发言人称，这些建筑还将存放一般用品和存放当地校园家具等物品。新空间出现之际，谷歌似乎在执行官里克·奥斯特洛 (Rick Osterloh) 的领导下进行了更多的内部硬件工作，他负责监督设备和服务，包括 Nest、谷歌 Home 智能扬声器、其旗舰 Pixel 智能手机和 PixelBook 笔记本电脑。与搜索、YouTube 和谷歌云等核心互联网服务相比，硬件部门为该公司带来的收入微乎其微，但高管们最近表示，今年将试图抢占更多市场份额。谷歌本周宣布了它在硬件方面最认真的尝试，当时它表示将放弃高通芯片并创建自己的芯片，包括用于其旗舰 Pixel 手机的芯片。它还一直在为全国越来越多的数据中心使用自己的芯片。今年 1 月，它完成了对健身追踪硬件公司 Fitbit 的收购，该公司在监管审查中被搁置了​​一年多。特别是一栋建筑正在进行大修。根据计划，该建筑的 20% 被指定为办公空间，80% 被指定为制造、存储、分销和其他用途。文件显示，该公司至少从 2018 年就开始规划该网站。\n“新的内部空间将用于设备仓库、配送和支持办公功能，”该计划指出。计划显示该空间最多可容纳 169 人，但谷歌发言人拒绝透露将容纳多少员工。一份规划文件描述了用海洋主题的物品装饰室内，包括艺术装置、壁画、漂流木口音、来自 Etsy 的贝壳声明件以及悬挂在会议室和培训室天花板上的冲浪板，计划显示。会议室以加利福尼亚州蒙特雷及其周边的海滨地区命名，包括罐头厂街、太平洋格罗夫、渔人码头和德尔蒙特。对场地的其他拟议修改包括停车场重新配置、新设备垫、屋顶设备外壳、ADA 升级和建筑物表面的更新。该公司的计划显示，整个场地有 794 个停车位，其中包括 20 多辆大型或半卡车以及几个电动汽车充电站和一个现场丙烷罐。坐落在工业中心旁边的是一个更传统的科技园区，被称为“中点”，最多可容纳 3,500 名员工。根据 CNBC 查看的计划，该园区需要对现有办公室进行景观美化和建筑更新，而不是全新的开发。该公司没有给出预计 Midpoint 何时完成的时间表。 Mercury News 此前曾报道过其中的一些功能。谷歌房地产和工作场所服务项目主管维尼·巴尔加瓦 (Vini Bhargava) 在今年夏天提交的初步审查请求中写道：“拟议项目的目标是提高行人和自行车的安全性以及建筑物与周围社区之间的连通性。”\n新园区也符合该公司在担心流离失所的情况下向非技术邻居开放的转变。拟议的升级也是因为该公司计划在大流行后时代让更多员工在办公室工作。 Bhargava 补充说，它希望将景观纳入“户外聚会和会议区，为现场员工提供服务”。为此，她提议将混凝土停车场变成绿色的景观场地，使用再生水并种植树木作为自然冷却系统和遮荫处。巴尔加瓦在她的信中补充说，这些新功能旨在“改善野生动物栖息地和授粉机会”​​。初步要求还提出了一个新的“交通枢纽”，为员工提供班车、自行车停放处和过境通行证，以减少单人乘车次数。该枢纽还将包括供通勤者使用的淋浴间、储物柜和更衣室。它将提供通勤班车服务，为来自整个湾区的员工提供巴士服务，Bhargava 表示，“事实证明，与地区平均水平相比，单独开车上班的员工数量显着减少。”", "note_en": "Google is planning yet another Silicon Valley campus, which will sit adjacent to a new center partly devoted to hardware, according to preliminary plans obtained by CNBC.\n Beginning in 2018,  Google spent more than $389 million on land in north San Jose, Calif., and the company has since filed detailed preliminary proposals showing a sneak peak of its plans for the space. The plans, which are filed as an &#34;R&amp;D&#34; facility, show a center for hardware operations and a separate new tech campus that would be accessible to the public, sitting between its current headquarters in Mountain View and its recently approved  mega mixed-use campus in San Jose.\n  Dubbed &#34;Midpoint,&#34; the future tech campus will include five office buildings connected via a pedestrian bridge over a road. It will sit adjacent to three industrial buildings that will house some operations for its hardware division, including Nest products, according to several planning documents.\n  Google has filed plans for an &#34;R&amp;D&#34; center that includes hundreds of updates to three industrial buildings. including meeting rooms, lounge areas, micro kitchens, equipment platforms, conveyor belts and a shipping warehouse, according to plans and permits viewed by CNBC. The plans mention &#34;Google Hardware&#34; and &#34;Nest,&#34; which refers to the company&#39;s connected home business. These buildings will also house general supplies and store items like furniture for local campuses, according to a company spokesperson.\n The new space comes as Google appears to be bringing more hardware efforts in-house under executive Rick Osterloh, who oversees devices and services, including Nest, the Google Home smart speakers, its flagship Pixel smartphone, and the PixelBook laptops. The hardware unit has produced minimal revenue for the company compared with its core internet services like Search, YouTube, and Google Cloud, but executives recently said it would be attempting to  grab more market share this year.\n  Google announced arguably its most serious attempt at hardware this week when  it said it will be ditching Qualcomm chips and creating its own, including those used for its flagship Pixel phone. It also has been using its own chips for its growing number of data centers across the country. In January, it  completed the acquisition of fitness tracking hardware company Fitbit, which had been held up in regulatory review for more than a year.\n One building in particular is getting a major overhaul . 20% of that building is designated for office space and 80% for manufacturing, storage, distribution, and other purposes, according to plans. The company has been planning the site since at least 2018, according to documents.\n  &#34;New interior space will be used for device warehouse, distribution and supporting office functions,&#34; the plans state. Plans show the space can hold up to 169 people but a Google spokesperson declined to specify how many employees it will house.\n  One planning document describes dressing the interior in ocean-themed items, including with art installations, murals, drift wood accents, seashell statement pieces from Etsy and a surfboard suspending on ceilings of meeting and training rooms, plans show. Meeting rooms are named after seaside areas in and around Monterey, Calif., including Cannery Row, Pacific Grove, Fisherman&#39;s Wharf and Del Monte.\n Other proposed modifications to the site include parking lot reconfigurations, new equipment pads, rooftop equipment enclosures, ADA upgrades, and updates to the faces of the buildings.\n The company&#39;s plans show the overall site features 794 parking spaces, including spaces for more than 20 large or semi trucks as well as several EV charging stations and an on-site propane tank.\n   Sitting beside the industrial center is a more traditional tech campus dubbed &#34;Midpoint&#34; that will accommodate up to 3,500 employees. That campus will require landscaping and construction updates to existing offices as opposed to totally new development, according to plans viewed by CNBC.\n The company did not give a timeline for when it expects Midpoint to be completed. The Mercury News previously  reported on some of the features.\n &#34;The goal of the proposed project is to enhance pedestrian and bicycle safety and connectivity between the buildings and the surrounding community,&#34; Vini Bhargava, a project executive with Google&#39;s real estate and workplace services, wrote in a preliminary review request filed this summer.\n  The new campus also falls in line with the company&#39;s shift to  open itself up to its non-tech neighbors amid concerns of displacement. The proposed upgrades also come as the company plans for more employees to work in offices in the post-pandemic era.\n Bhargava added that it wants to incorporate landscaping for &#34;outdoor gathering and meeting areas to serve on-site employees.&#34; To do so, she proposed turning concrete parking lots into green, landscaped sites that uses recycled water as well as planting trees to act as natural cooling systems and shade. The new features aim to &#34;enhance wildlife habitat and pollination opportunities,&#34; Bhargava added in her letter.\n  The preliminary request also proposes a new &#34;transit hub&#34; with shuttles, bike parking and transit passes for employees to reduce single occupant vehicle trips. The hub will also include showers, lockers and changing rooms for commuters.\n It will have a commuter shuttle service that will bus in employees from throughout the Bay Area, which Bhargava said is &#34;proven to significantly reduce the number of employees that drive alone to work compared to the regional average.&#34;", "posttime": "2021-08-07 04:16:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "硬件,谷歌,google,planning,计划", "title": "计划显示，谷歌正在规划一个带有硬件中心的新硅谷园区", "title_en": "Google is Planning a New Silicon Valley Campus With Hardware Hub, Plans Show", "transed": 1, "url": "https://www.cnbc.com/2021/08/06/google-planning-silicon-valley-campus-hardware-lab.html", "via": "", "real_tags": ["硬件", "谷歌", "google", "planning", "计划"]}, {"category": "", "categoryclass": "", "imagename": "6b34abd8de87ec5dd87b1cf4d6923989.jpeg", "infoid": 1071857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook Inc. 的 WhatsApp 消息传递部门抨击 Apple Inc. 计划在 iPhone 上监控儿童的性剥削图片，认为这不利于隐私，从而在全球两家最大的科技公司之间开辟了新战线。 WhatsApp 负责人威尔·卡斯卡特 (Will Cathcart) 周五表示：“这种方法给世界带来了一些非常令人担忧的事情。” “我们不会在 WhatsApp 上采用它。”一天前，苹果公司表示，它计划在今年晚些时候为美国用户发布一个更新，旨在识别和报告儿童性剥削图像的集合，作为它为 iPhone 准备的一系列变化的一部分，以保护儿童免受性侵犯。 WhatsApp 的立场加深了 Facebook 和苹果之间关于数据的斗争。 Facebook 首席执行官马克·扎克伯格 (Mark Zuckerberg) 长期以来一直哀叹他认为苹果对这家社交媒体巨头的业务拥有过大的权力。 Apple 已将保护 iPhone 和其他一些设备上的用户信息作为其向消费者宣传的关键部分，并因 Facebook 的数据收集做法而对其进行了抨击。 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "Facebook Inc.’s WhatsApp messaging unit blasted Apple Inc.’s plan to monitor sexually exploitative images of children on iPhones as bad for privacy, opening a new front in the battle between two of the world’s biggest tech companies.\n  “This approach introduces something very concerning into the world,” Will Cathcart, the head of WhatsApp, said Friday. “We will not adopt it at WhatsApp.”\n  Apple a day earlier said it  planned to release an update for U.S. users later this year designed to identify and report collections of sexually exploitative images of children, as part of a series of changes it is preparing for the iPhone to protect children from sexual predators.\n  WhatsApp’s position deepens  the battle between Facebook and Apple about data. Facebook Chief Executive Mark Zuckerberg has long bemoaned what he sees as too much power Apple has over the social-media giant’s business.\n  Apple has made the protection of user information on the iPhones and some other devices a key part of its pitch to consumers and  taken shots at Facebook for its data-collection practices.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-08-07 04:16:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,软件,苹果,apple,安全软件", "title": "Facebook的WhatsApp针对儿童安全软件计划瞄准苹果", "title_en": "Facebook's WhatsApp Takes Aim At Apple Over Child Safety Software Plan", "transed": 1, "url": "https://www.wsj.com/articles/whatsapp-rejects-apples-approach-on-exploitative-images-of-children-11628273991", "via": "", "real_tags": ["facebook", "软件", "苹果", "apple", "安全软件"]}, {"category": "", "categoryclass": "", "imagename": "3e20745a0c4bebe39b7e77e11333c940.jpg", "infoid": 1071856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容 PC 游戏巨头 Valve 出人意料地宣布推出自己的 400 美元便携式游戏机三周后，我飞往该公司位于华盛顿贝尔维尤的总部，旋风式地参观了该公司的最新原型——并有机会将它们与Nintendo Switch 和早期的 AMD 驱动的手持游戏系统 Aya Neo。我使用我的 Steam 帐户登录，在几周或几个月前我在台式游戏 PC 上停下来的地方拿起了《巫师 3》和《控制》，并用拇指杆、精确触摸板和陀螺仪瞄准在《毁灭战士永恒》中咀嚼了几个恶魔。虽然我没有得到诸如如何无缝地安装自己的游戏、具有较慢 eMMC 存储的模型如何工作，或者它在户外工作如何等紧迫问题的答案，但我绝对能够感受到这款便携式设备的舒适度以及如何它拥有强大的力量。进入之后，我们知道预计性能远远领先 Nintendo Switch，但与下一代游戏机的性能相差甚远，因为 Steam Deck 的原始图形功能甚至不到微软入门级 Xbox Series S 的一半。但自从它只需要支持 720p 游戏，而不是 1440p 甚至 1080p，你可能会以四百美元的价格获得惊人的收益：我能够将 The Witcher 3 和 Control 的要求部分调至中等规格而不会感到不舒服。这是比创始人版本 Aya Neo 更高的完整图形层，我通常在最低设置下玩这些游戏，有时仍然陷入困境。当我走进 Valve 的大厅时，我并不一定想到：Steam Deck 在 Nintendo Switch 旁边看起来有多么巨大——然而，它握起来有多舒服。虽然它勉强能放进一个很深的工装裤口袋里（如果你能把“向各个方向凸出”称为合身的话），但我现在相信 Valve，它说 Deck 是为长时间游戏而设计的。我第一次拿起它时，感觉就像我的手指刚刚融入它的把手和凹槽中，将所有控件都放在我的指尖——包括更丰富的操纵杆和比我使用过的僵硬、咔嗒声的控件更深、更柔软的触发器期待来自 Switch 和类似 Switch 的 PC 竞争对手。不过，我不确定我是否喜欢光滑、平顶的操纵杆。即使您可以通过将手指放在隐藏的电容式传感器上来进行一些很棒的陀螺仪瞄准，但您已经可以使用精密触摸板实现相同的技巧，而且我不确定是否值得在操纵杆抓地力方面进行权衡。不过，我需要进行更多测试。虽然我立即注意到与 Switch 相比重量增加了半磅，但在我的简短会议期间并没有让我感到困扰。 Deck 可能更重，但这些原型相对于它们的尺寸来说似乎很轻，有点空洞的感觉——想想看——可能会两极分化。我想知道 Valve 是否会保持这种状态，以及屏幕表面处理和塑料是否会有所改善。在室内，我在 Valve 的光面屏幕和优质蚀刻防眩光处理之间并没有明显的偏好——因为你在防眩光中获得了活力，但我在底盘上发现了一些划痕。我也确实感觉到了一些热量和电池消耗，在我们会话开始时插入的一个单元在一个半小时后几乎没电了。由于 Valve 承诺在玩《传送门 2》时实际电池续航时间为 4 小时，而票价要求较低则可达 8 小时，因此我认为这不正常。 Valve 无法说明这些 EV2 开发人员单元和最终版本之间会有什么具体变化，但构建质量仍在改进中。\n（Valve 在发布后告诉我们，这些单元刚从之前与另一组记者的 1.5 小时会议中出来，这肯定有助于解释这一点，而且我在开始时拍摄的第一张 Steam Deck 照片确实是我的会话显示一个电池指示器没有完全关闭。）Valve 预先表示它肯定仍在解决一些软件错误，例如偶尔冻结或 Prey 如何突然决定我将在我的屏幕上放置一个鼠标光标游戏的中间。昨天在 Valve 总部的一个半小时内，我确实有很多事情无法做，比如深入研究新的 SteamOS（尽管我确实喜欢它看起来更加精简，以及如何轻松地看到哪些游戏是你喜欢的）有 SD 卡和内部驱动器），尝试任何在线或多人游戏，或将其连接到更大的显示器。团队也不会让我们拆掉它——我问过！但是我能够得到一些悬而未决的问题的部分答案，并承诺这不会是 Steam 甲板在 2021 年末/2022 年初发布之前的最后一次观察。作为一个例子，Valve 表示它计划制作自己的视频来准确解释打开 Steam 平台并访问内部结构的含义，因为这绝对是公司计划让你做的事情。 （它有飞利浦头螺钉。）我们已经听说您可以更换 SSD，但公司也非常重视可修复性。 Valve 的 Greg Coomer 说，该公司有一套完整的、细致入微的答案，可以解决您在那里提出的紧迫问题。您可能还记得 Valve 计划为 Steam Deck 提供一个扩展坞，以便轻松输出到电视，虽然这仍在进行中，但该团队表示希望将其与便携式设备一起发货。您可能可以在 Deck 旁边订购一个，但不确定。您将能够从 Steam 平台浏览网站，将您最喜欢的图标添加到您的 Steam 库中，就像您今天在技术上将任何通用 Windows 应用程序添加到 Steam 启动器一样。虽然 Valve 并没有做出肯定的承诺，但该团队表示正在与反作弊制造商“积极讨论”与 Proton 的兼容性，解锁 Apex Legends、Destiny 2、Fortnite、PUBG 和其他不会的游戏在没有那个反作弊软件的情况下运行。 “我们认为我们将推出这款产品，”Valve 的 Erik Peterson 说。\n精确的触摸板仍然具有与 Steam 控制器中相同的古怪的、可听的触觉反馈。 “我们没有尝试让他们播放歌曲，但我相信如果你尝试过，你可以，”一位 Valve 团队成员说。对于依赖 Vulkan API 来实现图形性能的游戏，Valve 将预编译着色器，并在您首次下载和安装游戏文件时将其包含在内，这可以加快首次游戏的启动速度。在这个原型阶段，这可能需要一段时间。团队对 Valve 是否会为 Steam 平台带来任何新游戏或是否会盈利的问题置之不理——“我们不会一头扎进这个领域并损失一大笔钱”——但他们确实向我强烈建议他们不会像制作《半条命：爱莉克斯》那样为 VR 制作专属于便携式设备的游戏，并表示他们不会以同样的方式考虑 Steam 平台的输入。虽然该团队认为一些游戏制造商可能会专门针对便携式设备优化他们的控制，但 Valve 表示，它并没有根据让玩家的手来设计 Steam 平台，即使平台在你的八个手指下方有按钮并且可以感知你的拇指位置.更多的是为 PC 游戏玩家和开发人员提供更多按钮来映射，一位团队成员提出了 Xbox Elite 控制器如何为您提供额外的拨片，这样您就不必将手指从操纵杆上移开。 “更多的是关于投入的质量和投入的数量，”一位团队成员说。但是当我建议我们可以在独立 VR 耳机（如 Oculus Quest）中看到 Steam Deck 的定制 APU 时，Coomer 确实亮了。他说他喜欢这个问题。 “我们还没有准备好对此发表任何意见，但它会在那种环境下运行良好，需要 TDP……这与我们和我们的未来计划非常相关，”他说。更新，美国东部时间下午 2 点 22 分：Valve 告诉我们，我们看到电池寿命低的原因是因为早先的小组简报，所以当我们开始时，他们没有充满电。更正：我们玩的是《毁灭战士永恒》，而不是《毁灭战士终极》，这将是一个不那么令人印象深刻的表现。", "note_en": "Skip to main content                                                                                                                Three weeks after PC gaming giant  Valve surprise-announced its own $400 portable game console, I flew to the company’s headquarters in Bellevue, Washington, for a whirlwind tour of the company’s latest prototypes — and a chance to compare them to the Nintendo Switch and an earlier AMD-powered handheld gaming system,  the Aya Neo.\n I logged in with my Steam account, picked up  The Witcher 3 and  Control right where I left off weeks or months ago on my desktop gaming PC, and chewed through a few demons in  Doom Eternal with thumbsticks, precision touchpads, and gyroscopic aiming. While I didn’t get answers to burning questions like how seamlessly you can install your own games, how the model with slower eMMC storage works, or how well it works outdoors, I was absolutely able to feel how comfortable this portable might be and how much power it has on tap.\n Going in, we knew to expect performance far ahead of a Nintendo Switch but not nearly that of a next-gen game console  since the Steam Deck has slightly less than half the raw graphical muscle of even Microsoft’s entry-level Xbox Series S. But since it only has to power 720p gaming, not 1440p or even 1080p, you may get a surprising amount of bang for your four hundred bucks: I was able to turn up demanding sections of  The Witcher 3 and  Control to medium spec without feeling uncomfortable. That’s a full graphical tier higher than the founder’s edition Aya Neo, where I’m typically playing those games on lowest settings and sometimes still bogging down.\n  What I didn’t necessarily envision when I walked into Valve’s lobby: just how gigantic the Steam Deck looks next to a Nintendo Switch — and yet, how much more comfortable it is to hold. While it just barely fits into a deep cargo pants pocket (if you can call “bulges out in every direction” a fit), I now believe Valve when it says the Deck was sculpted for long play sessions.\n The first time I picked it up, it felt like my fingers just melted into its grips and grooves, placing every control at my fingertips — including far meatier joysticks and a deeper, softer throw to its triggers than the stiff, clicky controls I’ve come to expect from the Switch and Switch-like PC competitors. I’m not sure I’m a fan of the smooth, flat-topped joysticks, though. Even though you can do some awesome gyroscopic aiming by leaving your finger on the hidden capacitive sensor there, you can already pull that same trick with the precision touchpad, and I’m not sure it’s worth the trade-off in joystick grippyness. I’d need to test more, though.\n  While I immediately noticed the extra half-pound of weight compared to the Switch, it didn’t bug me during my brief session. The Deck may be heavier, but these prototypes seem light for their size, with a slightly hollow feeling that — come to think of it — might be polarizing. I wonder if Valve will keep it that way and if the screen finish and the plastics might improve. Indoors, I didn’t really have a clear preference between Valve’s glossy screen and the premium etched anti-glare treatment — since what you gain in anti-glare you lose in vibrancy — and I spotted a few scratches on the chassis.\n I also definitely felt some heat and battery drain, with one unit that was plugged in at the beginning of our session nearly dead after an hour and a half. Since Valve promised four hours of real-world battery life playing  Portal 2 and up to eight hours with less demanding fare, I imagine that’s not normal. Valve couldn’t say what will specifically change between these EV2 developer units and final, but that build quality is still being improved.\n (Valve told us after publish that these units just came out of a previous 1.5 hour session with a different group of journalists, which would definitely help explain that, and it’s true that the very first photo I shot of the Steam Deck at the beginning of my session showed a battery indicator that wasn’t completely topped off.)\n And Valve was upfront that it’s definitely still working out some software bugs, like the occasional freeze or how  Prey suddenly decided I was going to have a mouse cursor atop my screen in the middle of the game.\n  There’s a lot I really wasn’t able to do in an hour and a half at Valve’s HQ yesterday, like dig in deep on the new SteamOS (though I do like how much more streamlined it looks and how you can easily see which games you’ve got on an SD card and the internal drive), try any online or multiplayer gaming, or hook it up to a bigger monitor. The team also wouldn’t let us tear it down — I asked!\n But I was able to get some partial answers to some lingering questions and a promise that this won’t be the last look at the Steam Deck ahead of its late-2021 / early-2022 launch.\n As one example, Valve says it’s planning to produce its own video to explain exactly what it means to open up the Steam Deck and access the internals, because that’s definitely a thing the company’s planning to let you do. (It has Philips-head screws.) We’d already heard  you can swap the SSD, but reparability is very much on the company’s mind as well. Valve’s Greg Coomer says the company has a complete set of nuanced answers to your burning questions there.\n You might also remember that Valve plans to offer a docking station for the Steam Deck to easily output to a TV, and while that’s still in the works, the team says it’s hoping to ship that alongside the portable. It’s possible you might be able to order one alongside the Deck, though not for certain.\n  You’ll be able to browse websites from the Steam Deck, adding icons for your favorites to your Steam library the same way you can technically add any generic Windows app to the Steam launcher today. And while Valve isn’t promising it for sure, the team says it’s “in active discussions” with anti-cheat makers about getting compatibility with Proton,  unlocking games like  Apex Legends, Destiny 2, Fortnite, PUBG, and others that won’t run without that anti-cheat software. “We think we’re going to have that for launch,” said Valve’s Erik Peterson.\n The precision touchpads still have the same kind of quirky, audible haptic feedback as they did in the Steam Controller. “We haven’t tried to make them play songs, but I’m sure you could if you tried,” said one Valve team member.\n With games that rely on the Vulkan API for graphics performance, Valve will be pre-compiling the shaders and including them when you first download and install game files, which could speed up first-time game launches. In this prototype phase, that can take a while.\n  The team brushed off questions about whether Valve would bring any new games to the Steam Deck or whether it’s going to be profitable — “We’re not going to dive into this and lose a bunch of money” — but they did  strongly suggest to me that they wouldn’t make any games exclusive to portables the way they made  Half-Life: Alyx exclusive to VR, saying they don’t think about the Steam Deck’s inputs the same way.\n While the team believes some game manufacturers might specifically optimize their controls for portables, Valve says it didn’t design the Steam Deck in terms of giving the player  hands, even though the Deck has buttons under eight of your fingers and can sense your thumb position. It was more about having more buttons for PC gamers and developers to map, and one team member brought up how the Xbox Elite controller gives you extra paddles so you don’t have to take your fingers off the sticks. “It’s more about quality of inputs and quantity of inputs,” said one team member.\n But Coomer did light up when I suggested maybe we could see the Steam Deck’s custom APU in a standalone VR headset, like the Oculus Quest. He said he loved the question. “We’re not ready to say anything about it, but it would run well in that environment, with the TDP necessary... it’s very relevant to us and our future plans,” he said.\n  Update, 2:22PM ET:  Valve tells us the reason we saw low battery life was because of an earlier group briefing, so they weren’t at full charge when we began.\n Correction:  We played Doom Eternal, not Doom Ultimate, which would be   a far less impressive showing.", "posttime": "2021-08-07 04:15:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,设计,电脑,steam,valve", "title": "Valve Steam Deck 动手操作：比其他掌上电脑游戏设备更好地处理资源密集型游戏，出色的人体工程学设计，陀螺仪瞄准功能运作良好", "title_en": "Valve Steam Deck hands-on: handles resource-intensive games better than other handheld PC gaming devices, great ergonomics, gyroscopic aiming feature works well", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22612886/valve-steam-deck-handheld-gaming-pc-hands-on-preview?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["游戏", "设计", "电脑", "steam", "valve"]}]