[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1004643, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可以称它们为指导方针、试探法或经验法则。无论如何，目的都是一样的：提供一个合理的近似值。这些经验法则可以帮助您了解您所使用的系统，将您的注意力集中到正确的解决方案上，并突出潜在的问题区域。\n这些只是我在过去一年里收集的初步经验法则。如果您有任何其他有用的规则或启发式方法，请发送电子邮件给我或在下面留下评论。\n保持一个系统正常工作要比在你破坏它之后修复它容易得多。(詹姆斯·格勒宁)。\n通过消除分心和干扰，开发人员的生产效率大大提高“住在小隔间里的开发人员可能不是很有效率。检查他们是如何管理中断的。“。(杰克·甘斯勒)。\n“复杂性呈指数增长；罗伯特·格拉斯(Robert Glass)计算出，问题的难度每增加25%，代码的大小就会翻一番。一个数百万行的程序可以假设许多人类无法掌握的大小状态。(杰克·甘斯勒)。\n在自然界中，最佳值几乎总是在中间的某个地方。不相信最优处于极值点的断言。(阿金定律)。\n过去的经验非常适合提供现实核查。然而，太多的现实可能会毁掉一个原本有价值的设计(阿金定律)。\n根据经验，您在缺陷预防上花费的每一个小时将使您的修复时间从三个小时减少到十个小时。(史蒂夫·麦康奈尔)\n复杂系统从工作的简单系统进化而来(约翰·加尔)“工作的复杂系统总是从工作的简单系统进化而来的。相反的命题似乎也是正确的：从头开始设计的复杂系统永远不会工作，也不能让它工作。你必须从头开始，从一个运行简单的系统开始。“。(约翰·加尔)。\n如果你不能用通俗易懂的英语描述行为，你就不能用代码成功地描述它。\n如果一个问题可以分解成两个或多个独立可解的问题，那么就把复杂的问题分解成更小的子问题，然后先独立解决它们！\n在实施和测试解决方案之后，将各个部分合并到一个更大的操作中。\n正确地设计一艘航天器需要付出无限的努力。这就是为什么将它们设计为在某些情况出错时运行是个好主意。(阿金定律)。\n设计是一个迭代的过程。所需的迭代次数比您当前已完成的次数多一次。这在任何时候都是正确的。(阿金定律)。\n从来没有单一的正确解决方案。然而，总是有多个错误的。(阿金定律)。\n(爱迪生定律)“更好”是“好”的敌人。(阿金定律)\n估计日期而不是小时保证项目延迟(杰克·甘斯勒)“当开发人员不将日历时间与工程时间分开时，日程安排灾难是不可避免的。”(杰克·甘斯勒)。\n“如果进度表出现人员利用率远远超过50%的幻觉，项目将按比例落后。”(Jack Ganssle)“一些数据显示，开发者平均只有55%的人在从事新产品工作。其他例行公事，从处理文书工作到谈论幸存者十六世，几乎消耗了一周一半的工作时间。(杰克·甘斯勒)。\n我们经常没有预见到开发的困难领域“我们对大多数项目的进度估计得多么糟糕，这不是很令人惊讶吗？80%的嵌入式系统交付得很晚。大多数权威人士认为，平均每个项目消耗的开发工作量是最初预算的两倍。(杰克·甘斯勒)。\n5%的函数消耗了80%的调试时间(Jack Ganssle)“我观察到大多数项目都在调试周期中打滚，调试周期通常占整个计划的一半。显然，如果我们能对代表我们大部分麻烦的那几个功能做些什么，这个项目就会更快地推出。“。(杰克·甘斯勒)。\n时间表的增长速度远远快于固件大小--代码行增加了一倍，并且交付日期增加了2倍以上(Barry Boehm)。\n“代码的前90%占开发时间的前90%。剩下的10%的代码占用了另外90%的开发时间。“。(汤姆·嘉吉)。\n当将旧代码移植到新项目时，如果修改超过25%，就不会有太大的进度提升(理查德·塞尔比)。\n加载到90%处理器容量的系统需要的开发时间是加载70%或更少的系统的2倍。95%的加载是开发时间的三倍。(Jack Ganssle)“当只剩下几个字节时，即使是微不足道的功能也可能需要数周时间，因为开发人员必须重写大量代码来释放内存或CPU周期。”(杰克·甘斯勒)\n你制定的时间表看起来就像是一部完整的虚构作品，直到你的客户因为你没有达到它而解雇你的时候。(阿金定律)。\n有时候，到达终点的最快方法就是扔掉所有东西，然后重新开始。(阿金定律)。\n(巴顿计划法则)现在猛烈执行的好计划胜过下周完美的计划。(阿金定律)。\n每个传感器都是温度传感器。一些传感器还可以测量其他东西。(Elecia White)。\n将令人讨厌的实时硬件功能分解成独立的CPU(Jack Ganssle)，每秒处理1000个来自设备的中断？将其分区到其自己的控制器，并将所有ISR开销卸载主处理器。\n只要可以简化软件就添加硬件(Jack Ganssle)这将大大降低NRE和软件开发成本，但代价是增加BOM成本。\n加载到90%处理器容量的系统需要的开发时间是加载70%或更少的系统的2倍。95%的加载是开发时间的三倍。添加额外的硬件以减少负载。(杰克·甘斯勒)。\n(阿特金演示定律)当硬件工作完美时，真正重要的访客就不会出现。(阿金定律)\n遵循“三个规则”：允许你复制和粘贴代码一次，但是当相同的代码复制三次时，它应该被提取到一个新的程序中(马丁·福勒)。\n在一个软件包真正可重用之前，它必须至少被重用过三次(Jack Ganssle)“我们不够聪明，无法真正理解软件块可能被使用的应用程序的范围。每个领域都需要自己独特的功能和调整；除非我们在足够广泛的应用程序中实际使用了代码几次，否则我们不会对其进行足够的通用化，以使其真正可重用。“。(杰克·甘斯勒)。\n重用在大段代码中效果最好-考虑重用整个驱动程序或库，而不是函数(Jack Ganssle)理查德·塞尔比发现，当将旧代码移植到新项目时，如果修改了大约25%以上，就不会有太大的进度提升。\n过早的优化是浪费时间，“比起其他任何单一的原因--包括盲目的愚蠢，以效率的名义(不一定达到效率)犯下的计算错误更多。”(W.A.Wulf)。\n“程序优化的第一条规则是：不要这样做。程序优化的第二条规则(仅限专家！)：先别做。“。(迈克尔·A·杰克逊)。\n只有在对代码进行概要分析后才能优化代码，以确定问题区域“瓶颈出现在令人惊讶的地方，所以在证明瓶颈在那里之前，不要尝试事后猜测和提高速度。”(罗伯·派克)。\n“我们应该忘记小效率，比方说97%的时间：过早优化是万恶之源。然而，我们不应该错过这关键的3%的机会。一个好的程序员不会因为这样的推理而自满，他会明智地仔细检查关键代码；但只有在代码被确定之后“(唐纳德·努斯)。\n帕累托原理可以应用于资源优化：80%的资源被20%的操作使用。软件工程中有90/10定律：一个程序90%的执行时间花在执行10%的代码上\n算法优化比微优化有更大的影响“真正的效率收益来自于改变算法复杂度的顺序，比如从O(N2)复杂度变为O(NlogN)复杂度。”\n永远不要为了感知到的效率而牺牲清晰度，特别是在效率提高没有数据证明的情况下。\n当开发人员不敢更改函数时，是时候从头开始重写代码了(杰克·甘斯勒)。\n重复代码表明设计不佳或编程习惯不佳。它必须被消灭。“复制是一种糟糕的做法，因为它使代码更难维护。当在复制的代码片段中编码的规则发生更改时，维护该代码的任何人都必须在所有地方正确地更改它。此过程容易出错，并且经常会导致问题。如果代码只存在于一个地方，那么可以很容易地在那里进行更改。“。(杰克·甘斯勒)。\n“这条规则甚至可以应用于少量代码，甚至是单行代码。例如，如果你想调用一个函数，然后在它失败时再次调用它，有两个调用点是可以的；但是，如果你想在放弃之前尝试五次，那么一个循环内应该只有一个调用点，而不是5个独立的调用。“。(杰克·甘斯勒)。\n禁用中断往往是件坏事(Jack Ganssle)，即使在最好的情况下，它也会增加系统延迟并可能降低性能。\n警惕单独启用中断(EI)命令(Jack Ganssle)“位于中断服务例程(ISR)之外的EI通常意味着危险-启动代码中的初始EI除外。”(杰克·甘斯勒)。\n如果使能不是DI/EI对的一部分(这两条指令必须彼此非常接近才能保持较低的延迟和较高的可维护性)，那么代码很可能是一口错综复杂的深井；探测这些深度将使最热切的开发人员老去。(杰克·甘斯勒)\n当代码中充斥着DI/EI对(Jack Ganssle)时要小心“，但是当出现系统设计问题时，这些DI/EI对会大量溜进代码中，这会产生很多易受可重入性问题影响的关键区域。您知道这是怎么回事：勇敢的开发人员追逐一个错误，发现一个被上下文切换丢弃的变量。插入快速DI/EI对。然后还有另一个。还有另一个。就像吸食海洛因的人最后一次吸毒。它永远不会结束。“。(杰克·甘斯勒)。\n除了最短暂的时间和最迫切的需求之外，让中断一直存在。(杰克·甘斯勒)。\n如果在代码块中禁用中断，请在同一块中重新启用它们(Jack Ganssle)。\n保持ISR较小，设置一个标志，向队列添加值，然后依靠用户空间代码来处理更复杂的任务。\n检查在返回前立即重新启用中断的任何ISR的设计(Jack Ganssle)“允许另一个设备中断ISR是完全可以的！或者甚至允许相同的中断这样做，只要有足够的堆栈空间。这建议我们应该创建服务例程，尽早执行所有不可重入的事情(如维护硬件)，发出EI，然后继续执行可重入活动。然后弹出寄存器并返回。“。(杰克·甘斯勒)。\n避免涉及动态内存分配的操作，因为分配可能需要锁定，并且需要不确定的时间。\n避免堆栈分配取决于您的体系结构和操作模型，您的中断处理程序可能会利用中断线程的堆栈或公共的“中断堆栈”。\n功能点是软件一部分的功能度量，您可以在这里阅读。一个C函数点平均大约需要130行代码。\n以下是Capers的经验法则，其中“FP”表示功能点。这些摘自杰克·甘斯勒的时事通讯。\n项目中注入的大约错误数量：FP 1.25手动代码检查将发现大约65%的错误。对于纪律严明的团队来说，这个数字要高得多。\n如果有人说你要用声音调制解调器工作，问问他们它是否会设在另一栋楼里。除非答案是肯定的，否则拒绝。(Elecia White)", "note_en": "You may call them guidelines, heuristics, or rules of thumb. No matter, the purpose is the same: to provide a reasonable approximation of the truth. These rules of thumb can help guide your understanding of the systems you work on, focus you toward the right solutions, and highlight potential problem areas.\n These are just the initial rules of thumb that I’ve collected over the past year. If you have any other useful rules or heuristics, please  send me an email or leave a comment below.\n     It’s easier to keep a system working than to fix it after you break it. (James Grenning)\n      Developer productivity is dramatically increased by eliminating distractions and interrupts “Developers who live in cubicles probably aren’t very productive. Check how they manage interruptions.” (Jack Ganssle)\n “Complexity grows exponentially; Robert Glass figures for every 25% increase in the problem’s difficulty the code doubles in size. A many-million line program can assume a number of states whose size no human can grasp.” (Jack Ganssle)\n In nature, the optimum is almost always in the middle somewhere. Distrust assertions that the optimum is at an extreme point. (Akin’s Laws)\n Past experience is excellent for providing a reality check. Too much reality can doom an otherwise worthwhile design, though (Akin’s Laws)\n As a rule of thumb, every hour you spend on defect prevention will reduce your repair time from three to ten hours. ( Steve McConnell)\n  Complex systems evolve out of simple systems that worked (John Gall) “A complex system that works is invariably found to have evolved from a simple system that worked. The inverse proposition also appears to be true: A complex system designed from scratch never works and cannot be made to work. You have to start over, beginning with a working simple system.” (John Gall)\n If you can’t describe the behavior in plain English, you can’t successfully describe it with code\n Decompose complex problems into smaller sub-problems If a problem is can be decomposed into two or more independently solvable problems, then solve them independently first!\n After you have implemented and tested the solutions, combine the parts into a larger operation\n    To design a spacecraft right takes an infinite amount of effort. This is why it’s a good idea to design them to operate when some things are wrong. (Akin’s Laws)\n Design is an iterative process. The necessary number of iterations is one more than the number you have currently done. This is true at any point in time. (Akin’s Laws)\n There is never a single right solution. There are always multiple wrong ones, though. (Akin’s Laws)\n (Edison’s Law) “Better” is the enemy of “good”. (Akin’s Laws)\n (Shea’s Law) The ability to improve a design occurs primarily at the interfaces. This is also the prime location for screwing it up. (Akin’s Laws)\n Studies have found that reworking defective requirements, design, and code typically consumes 40 to 50 percent of the total cost of software development. ( Steve McConnell, citing Capers Jones) In the worst case, reworking a software requirements problem once the software is in operation typically costs 50 to 200 times what it would take to rework the problem in the requirements stage. ( Steve McConnell, citing Boehm and Papaccio)\n  Software is expensive “Study after study shows that commercial code, in all of the realities of its undocumented chaos, costs $15 to $30 per line. A lousy 1000 lines of code – and it’s hard to do much in a thousand lines – has a very real cost of perhaps $30,000. The old saw ‘it’s only a software change’ is equivalent to ‘it’s only a brick of gold bullion’.” (Jack Ganssle)\n “The answer is $15 to $40 per line of code. At the $40 end you can get relatively robust, well designed code suitable for industry applications. The $15 end tends to be code with skimpy design packages and skimpy testing. (In other words, some people spend only $15/line, but their code is of doubtful quality.)” (Phil Koopman)\n “UPDATE, October 2015. It’s probably more like $25-$50 per line of code now. Costs for projects outsourced to Asia have done up dramatically as wages and competition for scarce coders have increased.” (Phil Koopman)\n If you want to reduce software development costs, look at every requirements document and brutally strip out features. (Jack Ganssle)\n  It is easier  and cheaper to completely rewrite the 5% of problematic functions than to fix the existing implementation “Perhaps we really blew it when first writing the code, but if we can identify these crummy routines, toss them out, and start over, we’ll save big bucks.” (Jack Ganssle)\n  There’s never enough time to do it right, but somehow, there’s always enough time to do it over. (Akin’s Laws)\n Estimating dates instead of hours guarantees a late project (Jack Ganssle) “Scheduling disasters are inevitable when developers don’t separate calendar time from engineering hours.” (Jack Ganssle)\n “If the schedule hallucinates a people-utilization factor of much over 50% the project will be behind proportionately.” (Jack Ganssle) “Some data suggests the average developer is only about 55% engaged on new product work. Other routine activities, from handling paperwork to talking about Survivor XVI, burn almost half the work week.” (Jack Ganssle)\n We often fail to anticipate the difficult areas of development “Isn’t it amazing how badly we estimate schedules for most projects? 80% of embedded systems are delivered late. Most pundits figure the average project consumes twice the development effort originally budgeted.” (Jack Ganssle)\n 5% of functions consume 80% of  debugging time (Jack Ganssle) “I’ve observed that most projects wallow in the debug cycle, which often accounts for half of the entire schedule. Clearly, if we can do something about those few functions that represent most of our troubles, the project will get out the door that much sooner.” (Jack Ganssle)\n Timelines grow much faster than firmware size – double the lines of code, and the delivery date increases by more than 2x (Barry Boehm)\n “The first 90 percent of the code accounts for the first 90 percent of the development time. The remaining 10 percent of the code accounts for the other 90 percent of the development time.” (Tom Cargill)\n When porting old code to a new project, if more than about 25% gets modified there’s not much of a schedule boost (Richard Selby)\n Systems loaded to 90% of the processor capability require 2x development time over systems loaded at 70% or less. 95% loading triples development time. (Jack Ganssle) “When only a few bytes are left, even trivial features can take weeks as developers must rewrite massive sections of code to free up memory or CPU cycles.” (Jack Ganssle)\n The schedule you develop will seem like a complete work of fiction up until the time your customer fires you for not meeting it. (Akin’s Laws)\n Sometimes, the fastest way to get to the end is to throw everything out and start over. (Akin’s Laws)\n (Patton’s Law of Program Planning) A good plan violently executed now is better than a perfect plan next week. (Akin’s Laws)\n  Every sensor is a temperature sensor. Some sensors measure other things as well. (Elecia White)\n Break out nasty real-time hardware functions into independent CPUs (Jack Ganssle) Handling 1000 interrupts per second from a device? Partition it to its own controller and offload all of the ISR overhead off of the main processor\n Add hardware whenever it can simplify the software (Jack Ganssle) This will dramatically reduce NRE and software development costs, at a tradeoff for an increase in BOM costs.\n Systems loaded to 90% of the processor capability require 2x development time over systems loaded at 70% or less. 95% loading triples development time. Add additional hardware to reduce loading. (Jack Ganssle)\n (Atkin’s Law of Demonstrations) When the hardware is working perfectly, the really important visitors don’t show up. (Akin’s Laws)\n  Follow the “Rule of Three”: you are allowed to copy and paste the code once, but that when the same code is replicated three times, it should be extracted into a new procedure (Martin Fowler)\n Before a package is truly reusable, it must have been reused at least three times (Jack Ganssle) “We’re not smart enough to truly understand the range of applications where a chunk of software may be used. Every domain requires its own unique features and tweaks; till we’ve actually used the code several times, over a wide enough range of apps, we won’t have generalized it enough to have it truly reusable.” (Jack Ganssle)\n Reuse works best when done in large sections of code – think about reusing entire drivers or libraries, not functions (Jack Ganssle) Richard Selby found that, when porting old code to a new project, if more than about 25% gets modified there’s not much of a schedule boost\n  Premature optimization is a waste of time “More computing sins are committed in the name of efficiency (without necessarily achieving it) than for any other single reason — including blind stupidity.” (W.A. Wulf)\n “The First Rule of Program Optimization: Don’t do it. The Second Rule of Program Optimization (for experts only!): Don’t do it yet.” (Michael A. Jackson)\n Only optimize code after you have profiled it to identify the problem area “Bottlenecks occur in surprising places, so don’t try to second guess and put in a speed hack until you have proven that’s where the bottleneck is.” (Rob Pike)\n “We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil. Yet we should not pass up our opportunities in that critical 3%. A good programmer will not be lulled into complacency by such reasoning, he will be wise to look carefully at the critical code; but only after that code has been identified” (Donald Knuth)\n The Pareto principle can be applied to resource optimization: 80% of resources are used by 20% of operations Alternatively, there is the 90/10 law in software engineering: 90% of the execution time of a program is spent executing 10% of the code\n Algorithmic optimizations have a greater impact than micro optimizations “Real efficiency gains come from changing the order of complexity of the algorithm, such as changing from O(N 2) to O(NlogN) complexity”\n Never sacrifice clarity for perceived efficiency, especially when the efficiency improvement has not been proven with data\n  When developers are afraid to change a function, it’s time to rewrite that code from scratch (Jack Ganssle)\n Duplicate code is an indication of poor design or poor programming habits. It must be eliminated. “Duplication is a bad practice because it makes code harder to maintain. When the rule encoded in a replicated piece of code changes, whoever maintains the code will have to change it in all places correctly. This process is error-prone and often leads to problems. If the code exists in only one place, then it can be easily changed there.” (Jack Ganssle)\n “This rule is can even be applied to small number of lines of code, or even single lines of code. For example, if you want to call a function, and then call it again when it fails, it’s OK to have two call sites; however, if you want to try it five times before giving up, there should only be one call site inside a loop rather than 5 independent calls.” (Jack Ganssle)\n   Disabling interrupts tends to be A Bad Thing (Jack Ganssle) Even in the best of cases it’ll increase system latency and probably decrease performance\n Be wary of solo Enable Interrupt (EI) commands (Jack Ganssle) “An EI located outside an interrupt service routine (ISR) often suggests peril – with the exception of the initial EI in the startup code.” (Jack Ganssle)\n “When the enable is not part of a DI/EI pair (and these two instructions must be very close to each other to keep latency down and maintainability up) then the code is likely a convoluted, cryptic well; plumbing these depths will age the most eager of developers.” (Jack Ganssle)\n Be wary when code is peppered with DI/EI Pairs (Jack Ganssle) “But these DI/EI pairs slip into code in great numbers when there’s a systemic design problem that yields lots of critical regions susceptible to reentrancy problems. You know how it is: chasing a bug the intrepid developer uncovers a variable trashed by context switching. Pop in quick DI/EI pair. Then there’s another. And another. It’s like a heroin user taking his last hit. It never ends.” (Jack Ganssle)\n  Leave interrupts on, for all but the briefest times and in the most compelling of needs. (Jack Ganssle)\n If you disable interrupts in a block of code, re-enable them in the same block (Jack Ganssle)\n Keep ISRs small Set a flag, add a value to a queue, and then rely on user-space code to handle more complex tasks\n  Check the design of any ISR that reenables interrupts immediately before returning (Jack Ganssle) “It’s perfectly fine to allow another device to interrupt an ISR! or even to allow the same interrupt to do so, given enough stack space. That suggests we should create service routines that do all of the non-reentrant stuff (like servicing hardware) early, issue the EI, and continue with the reentrant activities. Then pop registers and return.” (Jack Ganssle)\n  Avoid operations that involve dynamic memory allocations, as the allocation may require a lock and will take a non-determinate amount of time\n Avoid stack allocations Depending on your architecture and operational model, your interrupt handler may utilize the stack of the interrupted thread or a common “interrupt stack”.\n  A function point is the measure of functionality of a part of a software, which  you can read about here. One  C function point is about 130 lines of code, on average.\n Here are Capers’s rules of thumb, where “FP” means function points. These were extracted from Jack Ganssle’s newsletter.\n Approximate number of bugs injected in a project: FP 1.25 Manual code inspections will find about 65% of the bugs. The number is much higher for very disciplined teams.\n  If anyone says you are to work with an acoustic modem, ask them if it will be located in another building. Refuse unless the answer is yes. (Elecia White)", "posttime": "2020-06-01 19:05:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经验,rules,代码", "title": "嵌入式经验法则", "title_en": "Embedded Rules of Thumb", "transed": 1, "url": "https://embeddedartistry.com/blog/2018/04/26/embedded-rules-of-thumb/", "via": "", "real_tags": ["经验", "rules", "代码"]}, {"category": "", "categoryclass": "", "imagename": "c4de5d8a2fa5184b43f74ce232851e9f.jpeg", "infoid": 1004642, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请注意，Imager已经从我的个人帐户转移到这里的imager-io GitHub源。\n来源：▇39.00M(4张图片)kraken.io：▇24Mjpegmini.com：▇16M压缩.ai：▇8.90M成像器：▇4.20M。\n如果您正在运行自己的基准测试，有些网站会在图像超过一定分辨率时自动调整图像大小。这会扭曲结果的！就我个人而言，这发生在我的一次现场演示中。", "note_en": "Note that  Imager has moved from my personal account to the  imager-io GitHub origination  here.\n   source : ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ 39.00M (4 images)kraken.io : ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ 24Mjpegmini.com : ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ 16Mcompression.ai: ▇▇▇▇▇▇▇▇ 8.90Mimager : ▇▇▇▇ 4.20M\n    If you’re running your own benchmarks, some sites will automatically resize images if they exceed a certain resolution. This will distort the results! Personally this happened to me during a live presentation.", "posttime": "2020-06-01 19:04:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图像,noisy,imager", "title": "将嘈杂的高分辨率图像优化为相当“小”的文件", "title_en": "Optimize noisy, high resolution images into rather “tiny” files", "transed": 1, "url": "https://github.com/colbyn/imager-bench-2019-11-2", "via": "", "real_tags": ["图像", "noisy", "imager"]}, {"category": "", "categoryclass": "", "imagename": "709db1b17926b0f53b09f290326a0a90.jpg", "infoid": 1004641, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook的数据泄露事件在2020年达到顶峰，现在还不到一半。所以问题是，它还安全吗？\n每天我醒来，一边吃早餐一边浏览Reddit，我会浏览数据泄露的新闻，黑客出售账户的新闻，或者类似的用户受到威胁的新闻。\n最常见的例子是Facebook。我们给了他们这么多数据，但这值得吗？我的意思是，是的，能够使用像Facebook这样的社交媒体，与你所有的朋友和家人互动，聊天，玩游戏，了解他们的最新生活，这是一件很好的事情。但我们相信他们会提供如此多的数据，而忽略了这样一个事实，那就是毕竟这并不安全。\n一个月前，Cyble的一个研究小组报告称，2.67亿个Facebook账户在黑暗网络上被黑客以仅540美元的价格出售，幸运的是，数据中没有密码，但有电子邮件地址、姓名、Facebook ID、出生日期和电话号码。这个数据集足够完美，足以让黑客或骗子产生一次全面的钓鱼攻击，即使只有5%的用户上当，也可以给用户造成巨大的损失。这一数据集足够完美，足以让黑客或骗子产生全面的钓鱼攻击，即使只有5%的用户上当，也可以给用户造成巨大的损失。\n另一起事件发生在Business Insider报道，Facebook在150万Facebook用户登录账户时，在他们不知情或未经他们同意的情况下提取了他们的电子邮件地址。\n自2016年5月以来，Facebook已经提取了150万名Facebook新用户的电子邮件联系人。他们表示，这些电子邮件数据是无意中上传到Facebook的，现在正在被删除。\n现在，正如我们所知，没有什么是无意的。对于一家如此庞大的公司来说，这是一件非常不光彩的事情。不负责任。\n据hackread报道，这起泄密事件发生在一个配置错误的Elasticsearch服务器暴露了Facebook用户在之前的一次入侵中涉及的数据之后。\n关闭，直到另行通知，服务器已关闭。现在，我们接受Facebook再次需要增加其笔试能力，并对它允许外人在任何情况下获得的信息进行调查，即使是出于法律目的。\n现在作为一名用户，这是非常危险的，因为你的数据不应该被那样对待，因为它是敏感的，入侵可能会把你置于风险之中。\n应该在每个单独的级别实施通用做法，在浏览网络时使用安全的VPN连接，只向社交网站提供最低限度的信息，不信任网络上的任何人，等等。如果你不想让你的真实信息在互联网上到处泄露，伪信息也是一个很好的主意。\n作为用户，我们可以限制我们与任何网站共享的那种数据，因为一切都是可以黑客攻击的。此外，我们还没有听到Facebook对最近这些入侵事件的回应，因为他们没有提到任何事情。但有一件事是肯定的，那就是它不再安全了。", "note_en": "Data breaches on Facebook has reached it&#39;s peak in 2020 and it&#39;s not even half yet. So the question is, is it even safe anymore?\n  Everyday I wake up and scroll through reddit while having my breakfast, and I go through the news of a data breach, hackers selling accounts, or something similar where the user is getting compromised.\n  The most common example is Facebook. We have given them so much data, but is it even worth it? I mean, yeah, it&#39;s good to be able to use social media like Facebook and interact with all your friends and family, chat, play games and stay up to date with their lives. But we&#39;re trusting them with so much data overlooking the fact that it isn&#39;t after-all, secure.\n    A month ago, a research team at   Cyble reported that 267Million Facebook Accounts were sold on the dark web by hackers for just 540$. Fortunately, there were no passwords in the data  but it had email addresses, names, Facebook IDs, dates of birth and phone numbers. This data set is perfect enough for a hacker or a scammer to generate a full-fledged phishing attack and if  even 5% of the users fall for it, a great amount of loss can be dealt to the users.\n  Another incident happened where business insider reported that Facebook extracted   the email addresses of 1.5 million Facebook users without their awareness or consent when they signed in to their accounts\n  Since May 2016, Facebook has extracted the email contacts of 1.5 million people new to Facebook. They stated that the email data was &#34;unintentionally uploaded to Facebook,&#34; and it is now getting deleted.\n  Now, as we know, nothing is unintentional. And for a company this huge, that&#39;s a very shady thing to do. Irresponsible.\n  Reported by  hackread, &#34;The leak came after a misconfigured Elasticsearch server exposed Facebook users’ data involved in a previous breach.&#34;\n  To close, until further notice, the server has been brought down. Right now, we accept that Facebook once more needs to increase its pen-testing capacities and do a survey of the information it permits outsiders to get to in any event, even for legal purposes.\n  Now as a user, this is very dangerous since your data shouldn&#39;t be treated like that as it is sensitive and breaches can put you at risks.\n  Common practices should be implemented at each individual level, by using a  secure VPN connection while browsing the web, only providing minimum information to social websites, not trusting anyone on the web, etc. Pseudo information is also a great idea if you don&#39;t want your real information leaked everywhere on the internet.\n  As users, we can restrain the sort of data we share with any site as everything is hackable. In addition, we are yet to hear Facebook&#39;s response to these most recent breaches as they haven&#39;t mentioned anything. But one thing is for sure, it isn&#39;t safe anymore.", "posttime": "2020-06-01 18:32:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,safe", "title": "Facebook还安全吗？", "title_en": "Is Facebook even safe anymore?", "transed": 1, "url": "https://privacytips.jimdofree.com/is-facebook-safe/", "via": "", "real_tags": ["facebook", "safe"]}, {"category": "", "categoryclass": "", "imagename": "62b9b382898f8483a69adae6c770edd7.jpg", "infoid": 1004640, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于这种元素的廉价和丰富的性质，使用钠离子化学而不是普通的锂离子的电池可以提供许多优势。华盛顿州立大学(Washington State University)的科学家们提出了一种被标榜为这一领域潜在游戏规则改变者的设计-一种钠离子电池，其能量容量和循环能力与市场上已有的一些锂离子电池相当。\n在某种程度上，钠离子电池的功能就像锂离子电池一样，通过在液体电解液中的一对电极之间反弹离子来发电。然而，它们目前的形式存在的一个问题是，在这种情况下，不活跃的钠晶体往往会在带负电的电极(阴极)的表面积聚，最终杀死电池。此外，钠离子电池不像锂离子电池那样能容纳那么多的能量。\n华盛顿州立大学(Washington State University)的宋俊华(音)是这篇论文的主要作者，他说，关键的挑战是电池既要有高能量密度，又要有良好的循环寿命。\n宋和他的团队相信他们可能已经想出了解决这些缺点的办法。通过对钠离子电池的设计进行实验，研究小组生产出了一种由层状金属氧化物制成的阴极和具有更高浓度钠离子的液体电解质的版本。\n在测试中，研究小组发现，这导致电解质和阴极之间的相互作用更加顺畅，使钠离子能够持续移动，并避免了在阴极表面堆积不活跃的晶体的麻烦。其结果是电池提供的容量类似于一些锂离子电池，并且不间断地发电，在1000次循环后保持80%的电量。\n林说：我们的研究揭示了阴极结构演变和表面与电解质相互作用之间的本质联系。这是有史以来报道的层状阴极钠离子电池的最好结果，表明这是一项可行的技术，可以与锂离子电池相媲美。\n对结果充满热情的团队现在正在研究电解质与阴极是如何相互作用的，以更好地理解这些相互作用，希望进一步改进设计，甚至可能避免使用其他稀有金属，如钴。\n宋说，这项工作为实现实用的钠离子电池铺平了道路，我们获得的关于阴极-电解质相互作用的基本见解，为我们未来如何在钠离子电池以及其他类型的电池化学中开发无钴或低钴正极材料提供了启示，宋健说，这项工作为实现实用的钠离子电池铺平了道路，我们获得的关于阴极-电解质相互作用的基本见解，有助于我们未来如何在钠离子电池以及其他类型的电池化学中开发无钴或低钴的阴极材料。如果我们能找到锂和钴的可行替代品，钠离子电池就能真正与锂离子电池竞争。而且，这将是游戏规则的改变者。", "note_en": "Batteries that use a sodium-ion chemistry rather than the commonplace lithium-ion could offer a number of advantages, owing to the cheap and abundant nature of the element. Scientists at Washington State University have come up with a design billed as a potential game changer in this area – a sodium-ion battery offering a comparable energy capacity and cycling ability to some lithium-ion batteries already on the market.\n In a way,  sodium-ion batteries function just like lithium-ion batteries, generating power by bouncing ions between a pair of electrodes in a liquid electrolyte. One of the problems with them in their current form, however, is that while this is going on inactive sodium crystals tend to build up on the surface of the negatively-charged electrode, the cathode, which winds up killing the battery. Additionally, sodium-ion batteries don&#39;t hold as much energy as their lithium-ion counterparts.\n &#34;The key challenge is for the battery to have both high energy density and a good cycle life,&#34; says Washington State University&#39;s Junhua Song, lead author on the paper.\n Song and his team believe they may have come up with a solution to these shortcomings. Experimenting with the design of sodium-ion batteries led the team to produce a version with a cathode made of layered metal oxide and a liquid electrolyte with a higher concentration of sodium ions.\n In testing, the team found that this led to a much smoother interaction between the electrolyte and the cathode, enabling the continuous movement of the sodium ions and avoiding the troublesome buildup of inactive crystals on the cathode surface. The upshot of that was battery offering capacity similar to some lithium-ion batteries and with an uninterrupted generation of electricity, maintaining 80 percent of its charge after 1,000 cycles.\n &#34;Our research revealed the essential correlation between cathode structure evolution and surface interaction with the electrolyte,&#34; Lin says. &#34;These are the best results ever reported for a sodium-ion battery with a layered cathode, showing that this is a viable technology that can be comparable to lithium-ion batteries.&#34;\n Enthused with the results, the team is now investigating how the electrolyte interacts with the cathode to better understand these interactions, with hopes of improving the design further, possibly even to avoid the use of other rare metals like cobalt.\n &#34;This work paves the way toward practical sodium-ion batteries, and the fundamental insights we gained about the cathode-electrolyte interaction shed light on how we might develop future cobalt-free or low cobalt cathode materials in sodium-ion batteries as well as in other types of battery chemistries,&#34; Song says. &#34;If we can find viable alternatives to both lithium and cobalt, the sodium-ion battery could truly be competitive with lithium-ion batteries. And, that would be a game changer.&#34;", "posttime": "2020-06-01 18:32:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,电池,salty", "title": "额外的盐钠电池性能与锂相当", "title_en": "Extra salty sodium battery performs on par with lithium", "transed": 1, "url": "https://newatlas.com/energy/sodium-battery-alternative-lithium/", "via": "", "real_tags": ["性能", "电池", "salty"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004638, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转在概率论和统计学中，无意识统计学家定律(LOTUS)是一个定理，用来计算随机变量X的函数g(X)的期望值，当一个人知道X的概率分布，但不知道g(X)的分布。定律的形式可以取决于陈述随机变量x的概率分布的形式。如果它是离散分布，并且知道其概率质量函数ƒX(但不知道ƒg(X))，则g(X)的期望值为。\ne⁡[g(X)]=∑x g(X)f X(X)，{\\DisplayStyle\\OperatorName{E}[g(X)]=\\∑_{x}g(X)f_{X}(X)，\\，}。\n其中总和是x的所有可能值。如果它是连续分布，并且知道其概率密度函数ƒX(但不知道ƒg(X))，则g(X)的期望值为。\ne⁡[g(X)]=∫−∞∞g(X)f X(X)d x{\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{-\\infty}^{\\infty}g(X)f_{X}(X)\\，\\mathm{d}x}。\n如果知道累积概率分布函数FX(但不知道Fg(X))，则g(X)的期望值由Riemann-Stieltjes积分给出。\nE⁡[g(X)]=∫−∞∞g(X)d F X(X){\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{-\\infty}^{\\infty}g(X)\\，\\mathm{d}F_{X}(X)}。\n这一命题被称为无意识统计学家的定律，因为学生们被指责使用了身份，而没有意识到它必须被视为严格证明的定理的结果，而不仅仅是一个定义。[4]。\n联合分布也有类似的性质。对于离散随机变量X和Y，二元函数g和联合概率质量函数f(x，y)：[5]\ne⁡[g(X，Y)]=∑y∑x g(x，y)f(x，y){\\displaystyle\\Operatorname{E}[g(X，Y)]=\\sum_{y}\\sum_{x}g(x，y)f(x，y)}。\ne⁡[g(X，Y)]=∫−∞∞∫−∞∞g(x，y)f(x，y)d x dy{\\DisplayStyle\\OperatorName{E}[g(X，Y)]=\\INT_{-\\INFTY}^{\\INFTY}\\INT_{-\\INFTY}^{\\INFTY}g(x，y)f(x，y)\\，\\mathm{d}x\\，\\mathm{d}y}。\n这条定律并不像乍看起来那样是定义的一个微不足道的结果，而是必须得到证明。[5][6][7]。\n对于连续随机变量X，设Y=g(X)，并假设g是可微的，且其逆g−1是单调的。通过反函数和微分的公式，\nd d y(g−1(Y))=1g‘(g−1(Y)){\\DisplayStyle{\\frac{d}{dy}}(g^{-1}(Y))={\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}。\ndx=1g‘(g−1(Y))dy{\\displaystyle dx={\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}dy}。\n∫−∞∞g(X)f X(X)dx=∫−∞∞y f X(g−1(Y))1g‘(g−1(Y))dy{\\DisplayStyle\\INT_{-。\\infty}^{\\infty}g(X)f_{x}(X)\\，dx=\\int_{-\\infty}^{\\infty}yf_{x}(g^{-1}(Y)){\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}\\，dy}。\n现在，请注意，由于累积分布函数F Y(Y)=P(Y≤y){\\DisplayStyle F_{Y}(Y)=P(Y\\leq y)}，代入g(X)的值，取两边的倒数，重新排列得到FY(Y)=FX(g−1(Y)){\\DisplayStyle F_{Y}(Y)=F_{X}(g^{-1}(Y))}。然后，根据连锁反应法则，\nf Y(Y)=f X(g−1(Y))1g‘(g−1(Y)){\\DisplayStyle f_{Y}(Y)=f_{X}(g^{-1}(Y)){\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}。\n∫−∞∞g(X)f X(X)dx=∫−∞∞y f Y(Y)dy{\\displaystyle\\int_{-\\infty}^{\\infty}g(X)f_{x}(X)\\，dx=\\int_{-\\infty}^{\\infty}yf_{Y}(Y)\\，dy}。\ne⁡[g(X)]=∫−∞∞g(X)f X(X)d x{\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{-\\infty}^{\\infty}g(X)f_{X}(X)\\，dx}。\n设Y=g(X){\\displaystyle Y=g(X)}。然后从期望值的定义开始。\nE⁡[Y]=∑y y f Y(Y){\\DisplayStyle\\操作员名称{E}[Y]=\\SUM_{y}yf_{Y}(Y)}。\nE⁡[g(X)=Y]=∑y y P(g(X)=y){\\DisplayStyle\\OperatorName{E}[g(X)=Y]=\\SUM_{y}YP(g(X)=y)}。\ne⁡[g(X)]=∑y y∑x：g(X)=y f X(X){\\DisplayStyle\\OperatorName{E}[g(X)]=\\SUM_{y}y\\SUM_{x\\，：\\，g(X)=y}f_{X}(X)}。\ne⁡[g(X)]=∑x g(X)f X(X){\\DisplayStyle\\OperatorName{E}[g(X)]=\\SUM_{x}g(X)f_{X}(X)}\n使用测度论中的参数可以从技术上完整地推导出结果，其中变换后的随机变量g(X)的概率空间与原始随机变量X的概率空间相关。这里的步骤包括定义变换后的空间的推进测度，然后结果是变量变换公式的示例。[5]。\n∫Ωg∘X d P=∫R g d(X∗P){\\DisplayStyle\\INT_{\\OMEGA}g\\CIRC X\\，\\mathm{d}P=\\int_{\\mathbb{R}}g\\，\\maththm{d}(X_{*}P)}。\n如果d(X∗P){\\DisplayStyle\\mathm{d}(X_{*}P)}关于勒贝格测度μ{\\DisplayStyle\\µ}绝对连续，我们称X{\\DisplayStyle X}有一个密度。在这种情况下。\nd(X∗P)=f dμ{\\DisplayStyle\\mathm{d}(X_{*}P)=f\\，\\mathm{d}\\mu}。\n其中f：r→R{\\displaystyle f：\\mathbb{R}\\to\\mathbb{R}}是密度(参见Radon-Nikodym导数)。因此，可以将上面的内容重写为更熟悉的。\nE⁡[g(X)]=∫Ωg∘X d P=∫Rg(X)f(X)d x{\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{\\omega}g\\cic X\\，\\mathm{d}P=\\int_{\\mathbb{R}}g(X)f(X)\\，\\maththm{d}x}。\n艾瑞克·基(1998)第6讲：随机变量存档2009-02-15在回路机上，利兹大学讲稿。\n^Bengt Ringner(2009)&#34；无意识统计学家定律，隆德大学数学科学中心，未发表说明\n约瑟夫·K·布利茨坦；杰西卡·黄(2014)。概率论导论(第一版)。查普曼和霍尔。第156页。\n^a b DeGroot，Morris；Schervish，Mark(2014)。“概率统计”(第4版)。培生教育有限公司。第213页。\n谢尔顿·M·罗斯著(2010)。概率模型导论(第10版)。爱思唯尔公司(Elsevier，Inc.)。\n？概率与统计虚拟实验室，科室，首页--期刊主要分类--期刊细介绍。3.1&#34；期望值：定义和性质&34；，第#34；项；基本结果：变量变换定理&#34；。", "note_en": "Jump to navigation  Jump to search  In  probability theory and  statistics, the  law of the unconscious statistician (LOTUS) is a theorem used to calculate the  expected value of a  function  g( X) of a  random variable  X when one knows the  probability distribution of  X but one does not know the distribution of  g( X). The form of the law can depend on the form in which one states the probability distribution of the random variable  X. If it is a  discrete distribution and one knows its  probability mass function  ƒ X (but not  ƒ  g( X)), then the expected value of  g( X) is\n E  ⁡  [  g  (  X  )  ]  =    ∑    x    g  (  x  )    f    X    (  x  )  ,      {\\displaystyle \\operatorname {E} [g(X)]=\\sum _{x}g(x)f_{X}(x),\\,}\n where the sum is over all possible values  x of  X. If it is a  continuous distribution and one knows its  probability density function  ƒ  X (but not  ƒ  g( X)), then the expected value of  g( X) is\n E  ⁡  [  g  (  X  )  ]  =    ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )      d   x    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,\\mathrm {d} x}\n If one knows the  cumulative probability distribution function  F  X (but not  F  g( X)), then the expected value of  g( X) is given by a  Riemann–Stieltjes integral\n E  ⁡  [  g  (  X  )  ]  =    ∫    −  ∞     ∞    g  (  x  )      d     F    X    (  x  )    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{-\\infty }^{\\infty }g(x)\\,\\mathrm {d} F_{X}(x)}\n    This proposition is known as the law of the unconscious statistician because students have been accused of using the identity without realizing that it must be treated as the result of a rigorously proved theorem, not merely a definition.  [4]\n  A similar property holds for  joint distributions. For discrete random variables  X and  Y, a function of two variables  g, and joint probability mass function  f( x,  y):  [5]\n E  ⁡  [  g  (  X  ,  Y  )  ]  =    ∑    y      ∑    x    g  (  x  ,  y  )  f  (  x  ,  y  )    {\\displaystyle \\operatorname {E} [g(X,Y)]=\\sum _{y}\\sum _{x}g(x,y)f(x,y)}\n  E  ⁡  [  g  (  X  ,  Y  )  ]  =    ∫    −  ∞     ∞      ∫    −  ∞     ∞    g  (  x  ,  y  )  f  (  x  ,  y  )      d   x      d   y    {\\displaystyle \\operatorname {E} [g(X,Y)]=\\int _{-\\infty }^{\\infty }\\int _{-\\infty }^{\\infty }g(x,y)f(x,y)\\,\\mathrm {d} x\\,\\mathrm {d} y}\n  This law is not a trivial result of definitions as it might at first appear, but rather must be proved.  [5]  [6]  [7]\n  For a continuous random variable  X, let  Y =  g( X), and suppose that  g is differentiable and that its inverse  g −1 is monotonic. By the formula for  inverse functions and differentiation,\n d    d  y     (    g    −  1    (  y  )  )  =      1      g    ′    (    g    −  1    (  y  )  )       {\\displaystyle {\\frac {d}{dy}}(g^{-1}(y))={\\frac {1}{g^{\\prime }(g^{-1}(y))}}}\n  d  x  =      1      g    ′    (    g    −  1    (  y  )  )     d  y    {\\displaystyle dx={\\frac {1}{g^{\\prime }(g^{-1}(y))}}dy}\n  ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )    d  x  =    ∫    −  ∞     ∞    y    f    X    (    g    −  1    (  y  )  )      1      g    ′    (    g    −  1    (  y  )  )       d  y    {\\displaystyle \\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,dx=\\int _{-\\infty }^{\\infty }yf_{X}(g^{-1}(y)){\\frac {1}{g^{\\prime }(g^{-1}(y))}}\\,dy}\n Now, notice that because the cumulative distribution function              F    Y    (  y  )  =  P  (  Y  ≤  y  )    {\\displaystyle F_{Y}(y)=P(Y\\leq y)}  , substituting in the value of  g( X), taking the inverse of both sides, and rearranging yields              F    Y    (  y  )  =    F    X    (    g    −  1    (  y  )  )    {\\displaystyle F_{Y}(y)=F_{X}(g^{-1}(y))}  . Then, by the  chain rule,\n f    Y    (  y  )  =    f    X    (    g    −  1    (  y  )  )      1      g    ′    (    g    −  1    (  y  )  )       {\\displaystyle f_{Y}(y)=f_{X}(g^{-1}(y)){\\frac {1}{g^{\\prime }(g^{-1}(y))}}}\n  ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )    d  x  =    ∫    −  ∞     ∞    y    f    Y    (  y  )    d  y    {\\displaystyle \\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,dx=\\int _{-\\infty }^{\\infty }yf_{Y}(y)\\,dy}\n  E  ⁡  [  g  (  X  )  ]  =    ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )    d  x    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,dx}\n  Let            Y  =  g  (  X  )    {\\displaystyle Y=g(X)}  . Then begin with the definition of expected value.\n E  ⁡  [  Y  ]  =    ∑    y    y    f    Y    (  y  )    {\\displaystyle \\operatorname {E} [Y]=\\sum _{y}yf_{Y}(y)}\n E  ⁡  [  g  (  X  )  =  Y  ]  =    ∑    y    y  P  (  g  (  X  )  =  y  )    {\\displaystyle \\operatorname {E} [g(X)=Y]=\\sum _{y}yP(g(X)=y)}\n E  ⁡  [  g  (  X  )  ]  =    ∑    y    y    ∑    x    :    g  (  x  )  =  y      f    X    (  x  )    {\\displaystyle \\operatorname {E} [g(X)]=\\sum _{y}y\\sum _{x\\,:\\,g(x)=y}f_{X}(x)}\n E  ⁡  [  g  (  X  )  ]  =    ∑    x    g  (  x  )    f    X    (  x  )    {\\displaystyle \\operatorname {E} [g(X)]=\\sum _{x}g(x)f_{X}(x)}\n  A technically complete derivation of the result is available using arguments in  measure theory, in which the  probability space of a transformed  random variable  g( X) is related to that of the original random variable  X. The steps here involve defining a  pushforward measure for the transformed space, and the result is then an example of a  change of variables formula.  [5]\n ∫    Ω    g  ∘  X      d   P  =    ∫      R     g      d   (    X    ∗    P  )    {\\displaystyle \\int _{\\Omega }g\\circ X\\,\\mathrm {d} P=\\int _{\\mathbb {R} }g\\,\\mathrm {d} (X_{*}P)}\n We say            X    {\\displaystyle X}   has a density if              d   (    X    ∗    P  )    {\\displaystyle \\mathrm {d} (X_{*}P)}   is absolutely continuous with respect to the Lebesgue measure            μ    {\\displaystyle \\mu }  . In that case\n d   (    X    ∗    P  )  =  f      d   μ    {\\displaystyle \\mathrm {d} (X_{*}P)=f\\,\\mathrm {d} \\mu }\n where            f  :    R   →    R     {\\displaystyle f:\\mathbb {R} \\to \\mathbb {R} }   is the density (see  Radon-Nikodym derivative). So the above can be rewritten as the more familiar\n E  ⁡  [  g  (  X  )  ]  =    ∫    Ω    g  ∘  X      d   P  =    ∫      R     g  (  x  )  f  (  x  )      d   x    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{\\Omega }g\\circ X\\,\\mathrm {d} P=\\int _{\\mathbb {R} }g(x)f(x)\\,\\mathrm {d} x}\n  ^  Eric Key (1998)  Lecture 6: Random variables   Archived 2009-02-15 at the  Wayback Machine, Lecture notes, University of Leeds\n ^  Bengt Ringner (2009)  &#34;Law of the unconscious statistician&#34;, unpublished note, Centre for Mathematical Sciences, Lund University\n ^   Blitzstein, Joseph K.; Hwang, Jessica (2014).  Introduction to Probability (1st ed.). Chapman and Hall. p. 156.\n ^     a     b   DeGroot, Morris; Schervish, Mark (2014).  Probability and Statistics (4th ed.). Pearson Education Limited. p. 213.\n ^     a     b     c   Ross, Sheldon M. (2010).  Introduction to Probability Models (10th ed.). Elsevier, Inc.\n ^   Virtual Laboratories in Probability and Statistics, Sect. 3.1 &#34;Expected Value: Definition and Properties&#34;, item &#34;Basic Results: Change of Variables Theorem&#34;.", "posttime": "2020-06-01 18:15:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "统计学家,unconscious,displaystyle", "title": "无意识统计学家定律", "title_en": "Law of the Unconscious Statistician", "transed": 1, "url": "https://en.wikipedia.org/wiki/Law_of_the_unconscious_statistician", "via": "", "real_tags": ["统计学家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-01 17:23:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "透明度,moderation,网站", "title": "适度的透明度重要吗？[PDF]", "title_en": "Does Transparency in Moderation Matter? [pdf]", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3359252", "via": "", "real_tags": ["透明度", "网站"]}, {"category": "", "categoryclass": "", "imagename": "0058383b157d7c4f7e1da37985b1b679.png", "infoid": 1004634, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(彭博社)-高级Facebook Inc.。员工们周末在Twitter上表达了他们对首席执行官马克·扎克伯格(Mark Zuckerberg)决定不对煽动性言论采取行动的失望之情。", "note_en": "(Bloomberg) -- Senior Facebook Inc. employees took to Twitter over the weekend to express their dismay at Chief Executive Officer Mark Zuckerberg’s decision not to take action on incendiary comment...", "posttime": "2020-06-01 17:22:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,员工,employees,mark", "title": "Facebook员工批评扎克伯格在特朗普问题上无所作为", "title_en": "Facebook Employees Criticize Zuckerberg’s Inaction over Trump", "transed": 1, "url": "https://www.bloombergquint.com/onweb/facebook-employees-criticize-zuckerberg-s-inaction-over-trump", "via": "", "real_tags": ["facebook", "员工", "employees", "mark"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004633, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家矿业公司获准炸毁巨坎峡谷洞穴，该洞穴为今天的传统所有者提供了4000年前的基因联系。\n西澳大利亚的一处圣地在一座铁矿的扩建中被摧毁，该圣地显示了4.6万年的持续占领，并为今天的传统所有者提供了4000年的基因联系。\n这个洞穴位于哈默斯利山脉的久坎峡谷，距离汤姆普莱斯山约60公里，是皮尔巴拉西部地区最古老的洞穴之一，也是澳大利亚唯一一个在上一个冰河时代显示出持续人类占领迹象的内陆遗址。周日，它与另一个圣地一起被炸毁。\n矿业公司力拓(Rio Tinto)在2013年根据西澳过时的土著遗产法获得了部长们的同意，同意摧毁或破坏该遗址。该法律于1972年起草，目的是有利于采矿支持者。\n在获得同意一年后，一项旨在抢救一切可以挽救的考古挖掘发现，该遗址的历史是之前认为的两倍多，并蕴藏着丰富的文物，包括神圣的物品。\n最珍贵的是一段4000年前的编成的人类头发，由几个不同的人的头部的头发编织在一起，DNA测试显示这是今天生活的Puutu Kunti Kurrama和Pinikura传统所有者的直系祖先。\n但过时的土著遗产法不允许在新信息的基础上重新谈判同意。因此，尽管与力拓定期会面，普图昆蒂库拉马和皮尼库拉土著公司(PKKP)仍无法阻止爆炸继续进行。\n“它是皮尔巴拉地区最神圣的地方之一…。我们希望该地区得到保护，“库尔德工人党负责人Burchell Hayes告诉澳大利亚卫报。\n“在我们国家发现的那样的辫子头发，然后进行进一步的测试，将其与库拉马人联系起来，这是非常宝贵的。”这是一件值得骄傲的事情，但也是令人难过的。它4000年来的安息之地已不复存在。“。\n海耶斯说，该地点曾被库拉马用作穿过该地区的营地，包括在一些长老的记忆中。\n“我们想做同样的事情，我们想展示给下一代看，”他说。“现在，如果这个遗址已经被摧毁，那么我们可以给他们讲故事，但我们不能给他们看照片，也不能让他们站在岩石掩体前说：这就是你的祖先生活的地方，从4.6万年前开始。”\n自2012年以来，土著遗产法一直以某种形式接受审查。前自由党政府在2014年提出的立法草案遭到否决，此前就连一名国民党议员也认为这对传统所有者不公平，没有允许进行充分的咨询。\n在2017年赢得选举之前，重写该法案被列为工党的优先事项，上个月，由于冠状病毒大流行，西澳土著事务部长本·怀亚特(Ben Wyatt)将对他的法案草案的最终咨询推迟到今年晚些时候。\n怀亚特说，新立法将提供上诉或修改协议的选项，以允许破坏遗产遗址。直到周一，他才意识到居坎遗址的风险，也就是它的破坏。\n他说：“它将规定传统业主和倡议者之间的协议包括一个程序，以考虑可能曝光的新信息，并允许各方在双方同意的情况下修订协议。”“如果任何一方不遵守协议，法例亦会提供上诉的选择。”\n力拓在提交给立法审查的文件中表示，它大体上支持拟议的改革，但根据当前制度授予的同意令应该继续下去，上诉权应该是固定的，不是广泛的，也不是可以延长的，以免“在项目的关键时刻延长批准或上诉程序”。\n力拓的一位发言人表示，该公司与普图·昆蒂·库拉马(Puutu Kunti Kurrama)和皮尼库拉(Pinikura)人的关系可以追溯到30年前，“过去17年来，我们一直在聚坎地区合作”。\n该公司表示：“力拓在一系列遗产问题上与PKKP人员进行了建设性的合作，并在可行的情况下修改了运营，以避免对遗产的影响，并保护对集团具有重要文化意义的地方。”\n这家矿业公司在2011年与传统所有者签署了一项原住民所有权协议，四年后，他们的原住民所有权主张得到了联邦法院的正式批准。他们在2014年为打捞挖掘提供了便利，揭开了该遗址的真实年龄。\n2008年进行的一次1米长的试掘确定该遗址的历史约为2万年，但打捞探险发现了一个“非常有意义的遗址”，收集了7000多件文物，包括4万年前的格子石，数千块来自幼虫的骨骼，这些骨头显示了动物群落随着气候变化的变化，以及神圣的物品。\n洞穴平坦的地面允许堆积很深的土壤和沙子，部分地方形成了近两米深的一层。皮尔巴拉的大多数考古挖掘都在30厘米处碰到岩石。\n最重要的是，考古记录并没有在上一个冰河时代消失。澳大利亚的大多数内陆考古遗址表明，在2.3万到1.9万年前的冰河时代，随着国家的枯竭和水源的枯竭，人们迁离了。来自巨坎峡谷的考古证据表明，它在整个过程中都被占领了。\n“这是那种你不常访问的网站，你可以在那里工作多年，”他说。“要有多大的意义，才能得到更广泛的社会的重视？”他说。\n·本文于2020年5月27日修改，更正了Burchell Hayes的拼写。·本文", "note_en": "Mining company was given permission to blast Juukan Gorge cave, which provided a 4,000-year-old genetic link to present-day traditional owners\n    A sacred site in Western Australia that showed 46,000 years of continual occupation and provided a 4,000-year-old genetic link to present-day traditional owners has been destroyed in the expansion of an iron ore mine.\n The cave in Juukan Gorge in the Hammersley Ranges, about 60km from Mt Tom Price, is one of the oldest in the western Pilbara region and the only inland site in Australia to show signs of continual human occupation through the last Ice Age. It was blasted along with another sacred site on Sunday.\n Mining company Rio Tinto received ministerial consent to destroy or damage the site in 2013 under WA’s outdated Aboriginal heritage laws, which were drafted in 1972 to favour mining proponents.\n One year after consent was granted, an archeological dig intended to salvage whatever could be saved discovered the site was more than twice as old as previously thought and rich in artefacts, including sacred objects.\n  Most precious was a 4,000-year-old length of plaited human hair, woven together from strands from the heads of several different people, which DNA testing revealed were the direct ancestors of Puutu Kunti Kurrama and Pinikura traditional owners living today.\n But the outdated Aboriginal Heritage Act does not allow for a consent to be renegotiated on the basis of new information. So despite regular meetings with Rio Tinto, the Puutu Kunti Kurrama and Pinikura (PKKP) Aboriginal Corporation was unable to stop the blast from going ahead.\n “It’s one of the most sacred sites in the Pilbara region … we wanted to have that area protected,” PKKP director Burchell Hayes told Guardian Australia.\n “It is precious to have something like that plaited hair, found on our country, and then have further testing link it back to the Kurrama people. It’s something to be proud of, but it’s also sad. Its resting place for 4,000 years is no longer there.”\n Hayes said the site had been used as a campsite by Kurrama moving through the area, including in the memory of some elders.\n “We want to do the same, we want to show the next generation,” he said. “Now, if this site has been destroyed, then we can tell them stories but we can’t show them photographs or take them out there to stand at the rock shelter and say: this is where your ancestors lived, starting 46,000 years ago.”\n  The Aboriginal Heritage Act has been up for review, in some form, since 2012.  Draft legislation put forward by the former Liberal government in 2014 was rejected after  even a National party MP argued it was unfair to traditional owners and  did not allow for adequate consultation.\n Rewriting the act was listed as a priority for Labor before their election win in 2017, and last month WA’s Aboriginal affairs minister Ben Wyatt pushed back the final consultation on his draft bill until later this year due to the coronavirus pandemic.\n The new legislation will provide options to appeal or amend agreements to allow for the destruction of heritage sites, Wyatt said. He wasn’t aware of the risk to the Juukan site, or its destruction, until Monday.\n “It will provide for agreements between traditional owners and proponents to include a process to consider new information that may come to light, and allow the parties to be able to amend the agreements by mutual consent,” he said. “The legislation will also provide options for appeal should either party not be compliant with the agreement.”\n In its submission to the legislative review, Rio Tinto said it was broadly supportive of the proposed reform but that consent orders granted under the current system should be carried over, and that rights of appeal should be fixed, not broad or subject to extensions, lest it “prolong approvals or appeals processes at a critical point in the project.”\n A spokesman from Rio Tinto said the company had a relationship with the Puutu Kunti Kurrama and Pinikura people dating back three decades, “and we have been working together in relation to the Juukan area over the past 17 years”.\n “Rio Tinto has worked constructively together with the PKKP People on a range of heritage matters and has, where practicable, modified its operations to avoid heritage impacts and to protect places of cultural significance to the group,” the company said.\n The mining company signed a native title agreement with the traditional owners in 2011, four years before their native title claim received formal assent by the federal court. They facilitated the salvage dig in 2014, which uncovered the true age of the site.\n   An earlier 1 metre test dig, conducted in 2008, dated the site at about 20,000 years old, but the salvage expedition uncovered a “very significant site” with more than 7,000 artefacts collected, including grid stones that were 40,000 years old, thousands of bones from middens which showed changes in fauna as the climate changed, and sacred objects.\n The flat floor of the cave allowed for a significant depth of soil and sand to build up, creating a layer almost two metres deep in parts. Most archeological digs in the Pilbara hit rock at 30cm.\n Most significantly, the archeological records did not disappear during the last Ice Age. Most inland archeological sites in Australia show that people moved away during the Ice Age between 23,000 and 19,000 years ago, as the country dried up and water sources dried up. Archeological evidence from Juukan Gorge suggest it was occupied throughout.\n “It was the sort of site you do not get very often, you could have worked there for years,” he said. “How significant does something have to be, to be valued by wider society?” he said.\n • This article was amended on 27 May 2020 to correct the spelling of Burchell Hayes.  • This article", "posttime": "2020-06-01 17:06:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "土著,tinto,遗址", "title": "力拓炸毁4.6万年前的土著遗址扩大铁矿", "title_en": "Rio Tinto blasts 46,000-year-old Aboriginal site to expand iron ore mine", "transed": 1, "url": "https://www.theguardian.com/australia-news/2020/may/26/rio-tinto-blasts-46000-year-old-aboriginal-site-to-expand-iron-ore-mine", "via": "", "real_tags": ["土著", "tinto", "遗址"]}, {"category": "", "categoryclass": "", "imagename": "375a709d5d702a2c295ce38d168068fd.png", "infoid": 1004632, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "绘制警察暴力地图是一项研究合作项目，收集全国警察杀人的全面数据，以量化警察暴力在社区中的影响。", "note_en": "Mapping Police Violence is a research collaborative collecting comprehensive data on police killings nationwide to quantify the impact of police violence in communities.", "posttime": "2020-06-01 16:31:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,警察,police", "title": "绘制警察暴力地图", "title_en": "Mapping Police Violence", "transed": 1, "url": "https://mappingpoliceviolence.org/", "via": "", "real_tags": ["app", "警察", "police"]}, {"category": "", "categoryclass": "", "imagename": "c13d0ab8a8f0e5ba179d48b84bbc9919.jpg", "infoid": 1004630, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着生物技术的进步，我们对作为人类意味着什么的想法也可能随之进步。\n今天，我们可以用以前无法想象的方式改变我们的身体，无论是植入微芯片，安装先进的假肢，甚至是设计全新的感官。\n所谓的超舒曼主义者--那些寻求通过科技改善身体来改善自己生理的人--认为我们的自然条件阻碍了我们对世界的体验，而我们可以通过科学超越我们目前的能力。\n对一些人来说是技术进步的想法，对另一些人来说是有争议的。但对摄影师大卫·文特纳来说，它们完全是另一回事：美丽。\n文特纳说，美存在于工程产品中。他多年来一直在为即将出版的新书“我想相信--跨舒马主义探索”拍摄现实生活中的半机械人和身体修改器。\n这本书是与艺术总监兼评论家杰姆·弗莱彻合作完成的，书中有各种各样的人，他们在某种程度上认为自己是超舒曼，包括一位长着能感觉到大气压力变化的仿生耳朵的男人，一位能感觉到世界各地正在发生的地震的女人，还有一位研发出实验室器官的技术人员。在某种程度上，这本书的特色是：一位长着能感觉到大气压变化的仿生耳朵的男人，一位能感觉到世界各地正在发生的地震的女人，还有一位研发出实验室器官的技术人员。\n弗莱彻最初是通过伦敦未来主义集团(London Futurist Group)接触到跨舒曼主义亚文化的，这是一个探索技术如何应对未来危机的组织。在会见了一些成员后，这位伦敦的艺术总监找到了文特纳，提出了用一系列肖像拍摄他们的想法。\n温特纳在电话采访中回忆道，我们的第一张照片是与安德鲁·弗拉基米罗夫(Andrew Vladimirov)一起拍摄的，他是一名DIY&34；大脑黑客。每次我们给新人拍照时，我们都会要求推荐和介绍运动中的其他关键人物。\n虽然这位摄影师承认，跨舒马主义者的说法一开始可能看起来很奇怪，但他很快就看到了科技自我提升的吸引力。如果有机会，你会如何设计你自己的身体，你希望它对你有什么影响？&#34；他问道。\nVintiner的研究对象之一詹姆斯·杨(James Young)在2012年的一次事故中失去了手臂和腿，后来转向了仿生学。杨一直对生物技术感兴趣，尤其被科幻美学所吸引。想象他的身体如何在最新技术的帮助下被重建，甚至执行增强的任务，成为他康复过程的一部分。\n但据这位29岁的年轻人说，医生提供给他的选择一点也不令人兴奋--标准配置的带有肉色硅胶袖子的钢制仿生假肢。\n杨在一次视频采访中说，最让人心烦意乱的是看看能买到什么。\n就工具和技术而言，人体可以构成什么是如此模糊的东西--如果你想一想手臂，它只是一件感官设备。\n如果有人会被砍掉胳膊和腿，那一定是我，因为我对技术和它能做的事情感到兴奋。\n日本游戏巨头Konami与假肢雕塑家索菲·德·奥利维拉·巴拉塔(Sophie De Oliveira Barata)合作，为杨设计了一套仿生肢体。结果是一只由灰色碳纤维制成的手臂和腿--这种美学灵感部分来自Konami的“金属齿轮实心”(Metal Gear Solid)，这是这位当时22岁的年轻人最喜欢的视频游戏之一。\n除了预期的功能之外，杨的机械臂还配备了一个USB端口，一个显示他推特信息的屏幕，以及一个装有遥控无人机的可伸缩基座。四肢由传感器控制，传感器将杨的脊椎中的神经冲动转化为身体运动。\nYoung的Vintiner说，先进的假肢使詹姆斯改变了人们对残疾的看法，并补充说：当你第一次向人们展示照片时，他们会被照片中包含的想法震惊和不安。但是如果你仔细分析这些想法，他们会意识到它们是非常务实的。\n杨说，人们花了几年时间不仅欣赏先进的仿生肢体的功能，还欣赏它们的美学。他说，仿生和电子肢体被认为是可怕的，纯粹是因为它们的外观。他们不谋而合，认为残疾并不性感。\n他还觉得仿生学周围有耻辱，因为患者经常被给予肉色的袖子来隐藏他们的假肢。\n从视觉上看，我们认为这是人体的边界，杨说，指的是他剩下的生物手臂。变性人的机会打开了，因为仿生手臂感觉不到疼痛，或者如果你有钱的话，它可以立即被取代。它有不同的耐热能力和不被晒伤的能力。\n当文特纳继续拍摄肖像画时，他感到自己的许多先入为主的观念受到了挑战。这一过程也提出了一个深刻的问题：如果技术可以改变人类的意义，那么它也能改变美丽的意义吗？\n他说，我的大部分(原创)作品都是以人为中心的--他们的行为、性格、怪癖和故事。但是这个项目将美的概念提升到了另一个层次。\n对文特纳来说，科学对我们对美学理解的影响是跨舒马主义最吸引人的方面之一。然而，他发现，这场运动中的许多人仍然将现有的美容标准视为后人类完美的典范。\n弗莱彻和文特纳的书中的另一个主题是索菲亚，一个由汉森机器人公司的科学家大卫·汉森和本·戈泽尔设计的机器人。索菲亚是迄今为止最先进的类人机器人之一。\n在2018年接受CNN Style采访时，汉森表示，索菲亚的造型将会引起世界各地的人们的共鸣，她的出现在一定程度上受到了包括汉森的妻子和奥黛丽·赫本在内的真实女性的启发，还有埃及王后奈菲尔蒂蒂的雕像。\n但她淡褐色的眼睛，完美的拱形眉毛，长长的睫毛，轮廓分明的颧骨和丰满的嘴唇--索菲亚的外表可以说是传统美丽的高加索女性的缩影。\n当我给本·戈泽尔拍照时，他说他没有花时间考虑他(自己)的样子--他对此并不感兴趣，摄影师回忆起那次拍照。\n文特纳看到了一定的讽刺意味：一个不关心自己外表的人仍然会通过他的公司的发明来投射我们对美的关注。\n它还提醒人们，吸引力可能比算法所能理解的要复杂得多。\n温特纳说：“我担心，如果我们能设计出没有任何生物构成缺陷的人类，事情就会越来越完美，达到我们现在只能想象的完美程度。”看看整形手术如何在很短的时间内改变了我们对美的看法。\n如果跨舒曼主义者是对的，我们作为人类可以活到几百岁，那么我们对美的概念和做人的意义将发生巨大的变化。\n由于冠状病毒的流行，“我想相信--跨国界主义探索”以及Kickstarter活动和图片展的启动被暂时推迟。", "note_en": "As biotechnology advances, so too may our ideas of what it means to be  human.\n Today, we can alter our bodies in previously unimaginable ways, whether that&#39;s implanting microchips, fitting advanced prosthetic limbs or even designing entirely new senses.\n So-called transhumanists -- people who seek to improve their biology by enhancing their bodies with technology -- believe that our natural condition inhibits our experience of the world, and that we can transcend our current capabilities through science.\n  Ideas that are &#34;technoprogressive&#34; to some are controversial to others. But to photographer David Vintiner, they are something else altogether: beautiful.\n  &#34;Beauty is in the engineered products,&#34; said Vintiner, who has spent years photographing  real-life cyborgs and body-modifiers for his upcoming book, &#34;I Want to Believe -- An Exploration of Transhumanism.&#34;\n  Made in collaboration with art director and critic Gem Fletcher, the book features a variety of people who identify, to some degree, as &#34;transhuman&#34; -- including a man with bionic ears that sense changes in atmospheric pressure, a woman who can &#34;feel&#34; earthquakes taking place around the world and technicians who have developed lab-made organs.\n Fletcher was first introduced to the transhumanist subculture via the London Futurist Group, an organization that explores how technology can counter future crises. Upon meeting some of its members, the London-based art director approached Vintiner with the idea of photographing them in a series of portraits.\n  &#34;Our first shoot was with Andrew Vladimirov, a DIY &#39;brain hacker,&#39;&#34; Vintiner recalled in a phone interview. &#34;Each time we photographed someone new, we asked for referrals and introductions to other key people within the movement.&#34;\n Though the photographer admitted that the transhumanists&#39; claims can seem outlandish at first, he soon saw the appeal of technological self-enhancement. &#34;If given the chance, how would you  design your own body and what would you want it to say about you?&#34; he asked.\n  One of Vintiner&#39;s subjects, James Young, turned to bionics after losing his arm and leg in an accident in 2012. Young had always been interested in biotechnology and was particularly drawn to the aesthetics of science fiction. Visualizing how his body could be &#34;re-built,&#34; or even perform enhanced tasks with the help of the latest technology, became part of his recovery process.\n But according to the 29-year-old, the options presented to him by doctors were far from exciting -- standard-issue steel bionic limbs with flesh-colored silicone sleeves.\n   &#34;To see what was available was the most upsetting part,&#34; Young said in a video interview.\n &#34;What the human body can constitute, in terms of tools and technology, is such a blurry thing -- if you think about the arm, it&#39;s just a sensory piece of equipment.\n &#34;If there was anyone who would get their arm and leg chopped off, it would be me because I&#39;m excited about technology and what it can get done.&#34;\n  Japanese gaming giant Konami worked with prosthetics sculptor Sophie de Oliveira Barata to design a set of bionic limbs for Young. The result was an arm and leg made from gray carbon fiber -- an aesthetic partly inspired by Konami&#39;s &#34;Metal Gear Solid,&#34; one of the then-22-year-old&#39;s favorite video games.\n Beyond the expected functions, Young&#39;s robotic arm features a USB port, a screen displaying his Twitter feed and a retractable dock containing a remote-controlled drone. The limbs are controlled by sensors that convert nerve impulses from Young&#39;s spine into physical movements.\n &#34;Advanced prosthetics enabled James to change people&#39;s perception of (his) disability,&#34; said Vintiner of Young, adding: &#34;When you first show people the photographs, they are shocked and disconcerted by the ideas contained within. But if you dissect the ideas, they realize that they are very pragmatic.&#34;\n  Young says it has taken several years for people to appreciate not just the functions of advanced bionic limbs but their aesthetics, too. &#34;Bionic and electronic limbs were deemed scary, purely because of how they looked,&#34; he said. &#34;They coincided with the idea that &#39;disability is not sexy.&#39;&#34;\n He also felt there was stigma surrounding bionics, because patients were often given flesh-colored sleeves to conceal their artificial limbs.\n  &#34;Visually, we think that this is the boundary of the human body,&#34; Young said, referring to his remaining biological arm. &#34;Opportunities for transhumanists open up because a bionic arm can&#39;t feel pain, or it can be instantly replaced if you have the money. It has different abilities to withstand heat and to not be sunburned.&#34;\n As Vintiner continued shooting the portraits, he felt many of his preconceptions being challenged. The process also raised a profound question: If technology can change what it is to be human, can it also change what it means to be beautiful?\n &#34;Most of my (original) work centers around people -- their behavior, character, quirks and stories,&#34; he said. &#34;But this project took the concept of beauty to another level.&#34;\n   Science&#39;s impact over our understanding of aesthetics is, to Vintiner, one of the most fascinating aspects of transhumanism. What he discovered, however, was that many in the movement still look toward existing beauty standards as a model for &#34;post-human&#34; perfection.\n Another subject of Fletcher and Vintiner&#39;s book is Sophia, a robot designed by scientists David Hanson and Ben Goertzel at Hanson Robotics.  Sophia is one of the most advanced humanoid robots to date.\n Speaking to CNN Style in 2018, Hanson said that Sophia&#39;s form would resonate with people around the world, and that her appearance was partly inspired by real women including Hanson&#39;s wife and Audrey Hepburn, as well as statues of the Egyptian queen Nefertiti.\n  But with her light hazel eyes, perfectly arched eyebrows, long eyelashes, defined cheekbones and plump lips -- Sophia&#39;s appearance arguably epitomizes that of a conventionally beautiful Caucasian woman.\n  &#34;When I photographed Ben Goertzel, he vocalized how he took no time to consider how he (himself) looked -- it was of no interest to him,&#34; the photographer recalled of the photo shoot.\n Vintiner saw a certain irony: that someone who was unconcerned about his own appearance would nonetheless project our preoccupation with beauty through his company&#39;s invention.\n It also served as a reminder that attractiveness may be more complex than algorithms can ever fathom.\n  &#34;I fear that if we can design humans without any of the &#39;flaws&#39; that occur in our biological makeup, things will be pushed further and further towards a level of perfection we can only imagine right now.&#34; Vintiner said. &#34;Look at how plastic surgery has altered our perception of beauty in a very short space of time.\n &#34;If the transhumanists are right and we, as humans, can live to be several hundreds of years old, our notion of beauty and the very meaning of what it is to be human will change dramatically.&#34;\n Due to the coronavirus pandemic, the launch of &#34;I Want to Believe -- An Exploration of Transhumanism,&#34; as well as a   Kickstarter  campaign and accompanying photo exhibition, have been temporarily postponed.", "posttime": "2020-06-01 15:58:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "舒马,transhumanists,技术", "title": "“技术进步”的跨舒马主义者是如何用技术增强他们的身体的", "title_en": "How 'Technoprogressive' Transhumanists Are Enhancing Their Bodies With Technology", "transed": 1, "url": "https://www.cnn.com/style/article/david-vintiner-transhumanism/index.html", "via": "", "real_tags": ["舒马", "技术"]}, {"category": "", "categoryclass": "", "imagename": "2fe743cf37eb2957d0b662469bb26213.jpg", "infoid": 1004628, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴黎--在过去两个月的大部分时间里，巴黎一直空无一人--商店和咖啡馆关门，街道空无一人，数百万游客突然蒸发。\n没有了人，城市景观让人联想到一个更老的巴黎。特别是，它让人想起了欧仁·阿特吉(Eugène Atget)的独特巴黎，他是20世纪初现代摄影之父，对细节的无情关注。\n在数以千计的照片中，阿吉特拍摄了一座空荡荡的城市，每天清晨起床，拖着他的原始设备走遍街道。他的形象将巴黎还原为建筑的精髓。\n毛里西奥·利马(Mauricio Lima)追随阿吉特的脚步，拍摄了他著名的前任拍摄的相同场景的图像。但这一次，由于冠状病毒大流行，这些街道空无一人。利马先生的娱乐活动为阿吉特的作品提供了新的洞察力，也让人们对一个城市的意义有了新的见解，这座城市的独特之处在于它的美丽，但也在于它的寒冷。\n评论家和哲学家沃尔特·本杰明在讨论阿吉特的照片时引用了著名的犯罪现场。他指的是他们的空虚，他们对城市景观细节的冷静关注，他们对多愁善感和浮夸的绝对拒绝。\n正如本杰明所说，阿吉特建立了有益的“人与环境之间的距离”。利马先生令人难忘的最新娱乐证实了这位去世已久的摄影师令人不安的洞察力-巴黎并不关心你的存在。它是无关紧要的，而且肯定会在没有你的情况下继续下去。\n你可以站在巴黎的街道上感到快乐，但这种感觉并没有得到回报。\n阿吉特出生于1857年，他最初尝试表演和绘画，但都没有成功。1890年，他以摄影师的身份开了一家店，目的是-就像他门上的一块牌子所说的那样-为“艺术家提供文件”。他知道画家需要图像作为他们工作的模型，于是他着手为他们提供家具。\n在近30年的时间里，他扛着沉重的三脚架在这座城市里跋涉，记录着已经消失的狭窄街道和肮脏覆盖的低矮建筑组成的巴黎。\n1920年，阿吉特写道：“我可以说我拥有了整个老巴黎。”\n直到1927年阿吉特去世的几年前，他遇到了一位年轻的美国摄影师贝雷尼斯·阿博特(Berenice Abbott)，当时他是艺术家曼·雷(Man Ray)的助手，直到那时，世界对他的作品几乎无动于衷。她拍了他的照片，写了他的故事，获得了他的许多照片，并坚持不懈地宣传了他50年。\n他的照片中的巴黎空荡荡的，隐约出现在看起来像是永恒的雾的昏暗的光线中。他的建筑是独立于人的。他们甚至不需要他们。信息似乎是，巴黎仍在继续。它不关心个人的存在。这座城市对人类并不感情用事。\n诚然，人性的痕迹在他的照片中无时无刻不存在-撕破的广告海报，手工制作的商店招牌，一箱箱蔬菜，一排排靴子。但这些只是提醒人们，这座城市可能曾经有人居住。而在图片中几乎没有人证实这一点。\n本杰明写道，在阿吉特的巴黎，“整个城市都被疏散了，就像一间公寓还没有找到新的租户。”\n把它和今天的图片对比一下。偶尔出现的蒙面人物是风景的附属品。他们戴着面具，遮住了部分脸部，这是对他们人性的进一步否认。\n城市景观独立于人，展现了它的存在。在今天拍摄的塞纳街拐角的奇怪角度的照片中，在现在很时髦的第六区--阿吉特最著名的形象之一--中，这座建筑似乎傲慢地从天空中突现出来，就像一座雕塑。\n维勒街(Rue de l‘Hôtel de Ville)上孤独的骑车人强调了街道的空旷，Servandoni街14号前的小狗也是如此。当前照片中较亮的光线突出了布切里街上石头冰冷坚硬的角度。巴黎似乎比以往任何时候都更加漠不关心。\n从现在的照片中也可以明显看出，巴黎已经被大刀阔斧地清理干净了。积聚了几个世纪的污垢和烟尘-仍然存在于20世纪60年代-已经被冲走了。\n在二战期间德国占领巴黎的照片中，变黑的正面非常突出，现在是白色的。曾经贴在许多门面上的广告海报早已不复存在。墙壁已经被平整过，重新铺设过，重新粉刷过。\n巴黎不再是一个劳动人民的城市。木匠、鞋匠、烟囱清洁工、菜妇和搬运工的存在在阿吉特的照片中被唤起了(如果不是总是被表现出来的话)已经消失很久了。\n塞纳街拥有屋顶花园和别致的店面，现在是这座城市价格较高的地区之一。在阿吉特的指纹里肯定不是这样的。但在今天的照片中，巴黎已经被美化和中产阶级化了。\n正如本杰明所指出的，阿吉特回避的“风景如画”更难避免。难度很大，但在冠状病毒流行的时代，或许并非不可能。", "note_en": "PARIS — For much of the last two months,  Paris has been empty — its shops and cafes shuttered, its streets deserted, its millions of tourists suddenly evaporated.\n Freed of people, the urban landscape has evoked an older Paris. In particular, it has called up the singular Paris of Eugène Atget, an early 20th-century father of modern photography in his unsentimental focus on detail.\n In thousands of pictures, Atget shot an empty city, getting up early each morning and lugging his primitive equipment throughout the streets. His images reduced Paris to its architectural essence.\n Mauricio Lima has followed in Atget’s footsteps, shooting images of the same scenes his famous predecessor captured. But this time those streets are deserted because of the coronavirus pandemic. Mr. Lima’s recreations offer new insight into Atget’s work — and into the meaning of a city unique in its beauty but also in its coldness.\n The critic and philosopher Walter Benjamin famously invoked crime scenes in discussing Atget’s photographs. He was pointing to their emptiness, their clinical attention to details of the urban landscape, their absolute rejection of the sentimental and the grandiose.\n As Benjamin observed, Atget established a beneficial “distance between man and his environment.” And Mr. Lima’s haunting updated recreations confirm the long-dead photographer’s disquieting insight — Paris doesn’t care about your presence. It is indifferent, and will certainly go on without you.\n You can feel joy at standing on a Paris street, but the feeling is not reciprocated.\n    Atget, who was born in 1857, initially tried unsuccessfully at acting and painting. In 1890, he set up shop as a photographer, in order — as a sign over his door said — to provide “Documents for Artists.” He knew that painters needed images as models for their work, and he set about furnishing them.\n For nearly three decades, he trudged through the city, bearing his heavy tripod and documenting a Paris of narrow streets and grime-covered low buildings that was already disappearing.\n In 1920, Atget wrote: “I can say that I possess all of Old Paris.”\n    The world was mostly indifferent to Atget’s work until, several years before his death in 1927, he met a young American photographer, Berenice Abbott, who was working as an assistant to the artist Man Ray. She photographed him, wrote about him, acquired many of his prints and promoted him relentlessly for 50 years.\n  The empty Paris of his prints looms out of the half-light of what seems like perpetual fog. His buildings are independent of  people. They don’t even need them. Paris, the message seems to be, continues. It does not care about the individual presence. The city is not sentimental about humankind.\n True, traces of humanity are ever-present in his pictures — torn advertising posters, artisanal shop signs, bins of vegetables, rows of boots. But these are only reminders that the city might once have been inhabited. And there are few people in the images to confirm this.\n In Atget’s Paris, “the city is evacuated, like an apartment that hasn’t yet found its new tenant,” Benjamin wrote.\n    Compare that with the images from today. The occasional masked figures are incidental to the landscape. That they wear masks, hiding part of their faces, is a further denial of their humanity.\n The urban landscape asserts its presence, independent of people. In the present-day photograph of the strange angle at the corner of the Rue de Seine, in the now-fashionable 6th arrondissement — one of Atget’s most famous images — the building seems to jut insolently out of the sky, like a kind of sculpture.\n The lonely cyclist on the Rue de l’Hôtel de Ville emphasizes the street’s emptiness, as does the small dog in front of 14 Rue Servandoni. The brighter light of the current pictures emphasizes the cold, hard angles of the stone on the Rue de la Bûcherie. Paris seems more indifferent than ever.\n    It is also evident in the present-day photographs that Paris has been mightily cleaned up. The accumulated grime and soot of centuries — still present in the 1960s — has been washed away.\n The blackened facades, so prominent in photographs of Paris during the German occupation in World War II, are now white. The advertising posters that once plastered many of the facades are long gone. Walls have been smoothed over, resurfaced, repainted.\n Paris is no longer a city of working people. The carpenters, cobblers, chimney-sweeps, vegetable-ladies and porters whose presence is evoked, if not always represented, in Atget’s pictures are long since gone.\n The Rue de Seine, with its rooftop gardens and chic storefronts, is now one of the pricier bits of the city. It certainly doesn’t look like that in Atget’s print. But in today’s pictures, Paris has been prettified and gentrified.\n The “picturesque” — which Atget shunned, as Benjamin points out — is more difficult to avoid. Difficult but, in the time of the coronavirus, perhaps not impossible.", "posttime": "2020-06-01 15:38:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "年后,ne,照片", "title": "100年后，欧仁·阿特吉的巴黎", "title_en": "Eugène Atget's Paris, 100 years later", "transed": 1, "url": "https://www.nytimes.com/2020/05/27/world/europe/paris-atget-coronavirus.html", "via": "", "real_tags": ["年后", "ne", "照片"]}, {"category": "", "categoryclass": "", "imagename": "73aeda0cb1405b26592ed9bf313c2017.png", "infoid": 1004627, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索Qt公司在2020年1月宣布，他们将把Qt工具包的LTS版本限制为付费客户，这一举措受到了广泛批评。Qt公司是许多自由软件使用的流行Qt工具包的制造商。他们目前正在强烈考虑更进一步，将所有Qt版本限制在前12个月向许可证持有者支付费用。这危及流行的KDE等离子体桌面环境和LXQt桌面环境的未来，并使使用Qt工具包进行自由软件开发的智慧受到质疑。\nQt公司是广受欢迎的双许可Qt工具包的制造商，目前在纳斯达克赫尔辛基的交易价格约为每股20欧元。\n德国KDE开发人员Olaf Schmidt-Wischhöfer在欧洲发展研究和培训机构协会(European Association Of Development Research And Training Institutes)工作，当他不是KDE社区的志愿者时，他在KDE社区邮件列表上发布了一条关于Qt公司(Qt Group Oyj，QTCOM，目前的交易价格为19.90欧元)和KDE社区之间关系的非常令人担忧的消息。\n到目前为止，Qt公司已经在双许可模式下发布了Qt，在这种模式下，自由软件用户和开发人员可以在GNU GPL下免费使用工具包，而不道德专有软件的商业开发者则被要求在商业许可下许可工具包。Qt公司通过结束这种双许可模式来拉拢自由软件社区的可能性已经有很长一段时间了，这是一个真正令人担忧的问题。当Qt公司在2020年1月宣布Qt长期支持发布将仅限于向许可证持有者支付费用时，这一威胁变得非常现实。\nKDE基金会以其无限的智慧，在几年前的一份书面协议中巩固了Qt和自由软件社区之间的特殊关系。本协议要求Qt公司继续放行Qt(..)的所有部件。根据GPLv3或兼容的许可证&#34；。这很好，但有个漏洞：\n如果这些许可条款在Qt发布时还不存在，则它们必须在不超过12个月的时间范围内应用。&#34；\nQt公司似乎不顾一切地想要最大限度地利用这个漏洞，从发布之日起关闭Qt的LTS版本和开发版本12个月。这一举动给KDE社区和一般使用Qt工具包的部分自由软件社区带来了巨大的问题。让我们假设在Qt中发现了一个巨大的安全漏洞，它影响了KDE或其他基于Qt的免费软件。如果自由软件用户必须保持一整年的易受攻击状态，才能获得更新版本的补丁，那将是非常不幸的。\n12个月的限制原则上不会使Qt成为专有软件，但从实践的角度来看，它也可以是专有的。\n使用KDE或Qt软件的用户可能希望阅读KDE社区邮件列表上Olaf Schmidt-Wischhöfer提供的标题为Qt；Qt，Open Source and Corona&34；的完整消息：\nKDE社区、Qt项目和Qt公司之间的关系一直很密切，对三方都有利。\nQt公司受益于围绕其产品拥有一个由贡献者、开发人员和专家组成的庞大而健康的社区。\nQt项目受益于将公司作为管理人员和非常大的贡献者，并将KDE作为一个大型且知名的子社区。\n幸运的是，KDE Free Qt基金会的存在确保了开源Qt：https://kde.org/community/whatiskde/kdefreeqtfoundation.phpTogether和Martin Konold的继续存在，我在该基金会的董事会中代表KDE。\n在过去的两年中，Qt公司和KDE Free Qt基金会就更新合同进行了谈判。\n在不损害Qt项目或KDE社区的情况下帮助公司增加收入。\n修复付费Qt许可条款与使用或贡献开源(https://www.qt.io/terms-conditions/中的“禁止组合”)之间的不兼容性\n修复Qt Design Studio(它只是部分自由软件)与我们与该公司现有合同之间的许可证不兼容。\n加强我们与该公司的合同，要求他们立即发布Qt的免费软件(目前，他们被允许延迟12个月)，以确保提供适用于KDE的LTS安全补丁。\n评估公司建议的合同变更，目的是使qt业务更有利可图，例如，可以选择将qt与其他软件捆绑销售，或者使与专有第三方软件的集成成为可能。\n谈判中的一个挫折是Qt公司在1月份宣布：https://www.qt.io/blog/qt-offering-changes-2020They宣布Qt的LTS版本将只对付费许可证持有者开放。目前还不清楚这对Qt的贡献以及各方(包括Qt公司、众多贡献Qt的专家、KDE社区和Linux发行版)之间的安全修复共享意味着什么。\n尽管如此，3月6日在法兰克福举行的面对面会议上，我们仍设法为可能的前进道路奠定了基础，继续采取对各方都有利的方法。\n但上周，该公司突然通知KDE e.V.董事会和KDE Free Qt基金会，科罗娜病毒造成的经济前景给他们带来了更大的压力，要求他们增加短期收入。因此，他们正在考虑将所有Qt版本限制在前12个月的付费许可证持有者范围内。他们意识到，这将意味着通过开放治理的贡献在实践中的终结。\n显然，脱离非常强大的Qt+KDE社区是不可能符合Qt公司的中长期健康的。\n我们希望QT公司重新考虑。然而，开放源码社区面临的这种威胁需要预料到，这样Qt和KDE社区才能做好准备。\nQt公司说，只有我们在其他方面给他们优惠，他们才愿意重新考虑这种做法。然而，我想起了半年前的情况。我们曾讨论过一种合同更新的方法，但他们突然通过限制Qt的LTS发布而抛弃了这一方法。\n这对Qt的未来和KDE的未来意味着什么？\nQt中的所有软件更改仍将按照我们的合同要求以开源的方式提供-如果公司决定与社区分道扬镳，可能会延迟12个月。\n我们将继续致力于合同更新，这对各方都有帮助。但是，即使这些谈判被Qt公司单方面阻止，Qt仍将保持开源，KDE将能够使用它。我也绝对相信，即使Qt公司决定放弃合作的好处，Qt+KDE社区也会继续在新功能、错误修复和安全修复方面进行合作。\n瑞典KDE贡献者和FOSS爱好者Jens Reurberg在4月8日对KDE社区邮件列表的回复中谈到了Qt公司：\n在我看来，他们想烧毁田地，却仍然认为春天就能收获的事实是荒谬的，而且似乎是由一个对自己项目涉及的技术或社会层面的工作过程一无所知的人所做的。&#34；\nKrita开发者Boudewijn Rempt在谈到自由软件社区未来的选择时是这样说的：\n如果我们与Qt社区中的其他参与者一起工作，那么这可能是可行的。事实上，我认为有必要开始召集一群利益相关者，并开始为分叉做准备。&#34；\n这是个相当可怕的消息。我可以理解为什么GTK成为现在最占主导地位的工具包。这很不幸，因为GNOME在Linux上真的走上了独裁者的道路。现在Linux上的工具包情况似乎不太好。\n哥们儿，把Qt冻结到5.2版或者其他什么版本都行。任何东西都比侏儒图形用户界面好，它比20年的贪婪更糟糕。\n许多项目试图通过对自由含糊其辞来廉价赚取大笔资金。相当恶心的策略。首先充当反盖茨的救世主，然后一旦人们上瘾就敲诈他们。太丢人了。\n伙计，如果QT公司从Covid19破产，KDE电动汽车可以花1欧元买下它。问题解决了。\n如果Qt公司未能在12个月内发布最新的Qt，KDE有权(根据双方签署的协议)要求在任何免费许可(如BSD或MIT或其他)下发布整个Qt。这将意味着Qt公司的终结，因为当前的许可(LGPL)允许他们在客户需要修改Qt并且不想发布代码时赚钱，但是有了BSD/MIT许可，即使没有Qt公司的商业许可，他们也可以这样做。\nLinuxReviews欢迎所有评论。如果您不想匿名，请注册或登录。它是免费的。", "note_en": "Jump to navigation Jump to search The Qt Company, maker of the popular Qt toolkit used by a lot of free software, announced that they would be restricting LTS releases of the Qt toolkit to paying customers in a widely criticized move back in January, 2020. They are currently strongly considering taking that one step further by restricting all Qt releases to paying license holders for the first 12 months. This jeopardizes the future of the popular KDE Plasma desktop environment as well as the LXQt desktop environment and it puts the wisdom of using the Qt toolkit for free software development in question.\n  The Qt Company, maker of the popular dual-licensed Qt toolkit, is currently trading around €20 per share at NASDAQ Helsinki.\n Germany KDE developer  Olaf Schmidt-Wischhöfer, who works at the  European Association of Development Research and Training Institutes when he is not volunteering for the KDE community, has published a  very worrisome message about the relationship between the  Qt Company (QT Group Oyj,  QTCOM, currently trading at €19.90) and the KDE community on the KDE community mailing list.\n The  Qt Company has so far released Qt under a dual-license model where  free software users and developers have been able to use the toolkit for free under the GNU GPL while  commercial developers of immoral proprietary software have been required to license the toolkit under a commercial license. The possibility of  Qt Company pulling the rug on the free software community by ending this dual-license model has been a real concern for quite some time. This threat become very real when the  Qt Company announced that Qt Long Term Support releases would be restricted to paying license holders back in January 2020.\n The KDE foundation, in its infinite wisdom, cemented the special relationship between Qt and the  free software community  in an written agreement years ago. This agreement  requires the  Qt Company to keep releasing &#34;All parts of Qt (..) under the GPLv3 or under a compatible license&#34;. That&#39;s nice, but there  is a loophole:\n &#34;If these license terms are not yet present at the time of the Qt release, then they must be applied within a timeframe of not more than 12 months. &#34;\n It appears that the  Qt Company are hell-bent in exploiting this loophole to the fullest extent possible by closing off both LTS versions and development versions of Qt for 12 months from their release. That move poses huge problems for both the KDE community and the parts of the  free software community who utilize the Qt toolkit in general. Let&#39;s say that a huge gaping security hole in Qt, which affects KDE or other free Qt-based software, is found. It would be very unfortunate if  free software users would have to remain vulnerable for a full year before they could have access to a newer version with a fix.\n The 12 month restriction would, in principle, not make Qt proprietary software, but it might as well be proprietary from a practical point of view.\n  Those who use KDE or Qt based software may want to read the entire message titled &#34;Qt, Open Source and corona&#34; from  Olaf Schmidt-Wischhöfer on the KDE community mailing list:\n the relationship between the KDE community, the Qt project and The Qt Company has always been close and beneficial for all three.\n The Qt Company benefits from having a large and healthy community of contributors, developers and experts around their product.\n  The Qt project benefits from having the company as a steward and very large contributor, and having KDE as a large and well-known sub-community.\n   Fortunately, the KDE Free Qt Foundation exists, which secures the continued existence of Open Source Qt: https://kde.org/community/whatiskde/kdefreeqtfoundation.phpTogether with Martin Konold, I represent KDE in the board of the foundation.\n  During the past two years, there have been negotiations between The Qt Company and the KDE Free Qt Foundation for updating the contract.\n  helping the company increase their revenue without harming the Qt project or the KDE community\n  Fixing the incompatibility between paid Qt license terms and using or contributing to Open Source (“Prohibited Combination” in  https://www.qt.io/terms-conditions/ )\n Fixing the license incompatibility between the Qt Design Studio (which is only partly Free Software) and our existing contract with the company\n Making our contract with the company stronger, requiring them to make immediate Free Software releases of Qt (currently, they are allowed to delay by 12 months) to ensure the availability of LTS security fixes for KDE\n  Evaluating contract changes suggested by the company aimed at making the Qt business more profitable, for example the option of selling bundles of Qt with other software, or making integrations with proprietary third-party software possible\n One setback in the negotiations has been an announcement of The Qt Company in January:  https://www.qt.io/blog/qt-offering-changes-2020They announced that LTS releases of Qt will only be available for paid license holders. It is still unclear what this implies for contributions to Qt and for the sharing of security fixes between the various parties (including The Qt Company, the many Qt experts contributing, the KDE community, and Linux distributions).\n At an in-person meeting in Frankfurt on March 6, we nevertheless managed to lay the groundwork for a possible path forward, continuing with an approach beneficial to all sides.\n But last week,  the company suddenly informed both the KDE e.V. board and the KDE Free QT Foundation that the economic outlook caused by the Corona virus puts more pressure on them to increase short-term revenue. As a result, they are thinking about restricting ALL Qt releases to paid license holders for the first 12 months. They are aware that this would mean the end of contributions via Open Governance in practice.\n Obviously, it cannot be in the middle- and long-term health of The Qt Company to separate itself from the very strong Qt + KDE communities.\n We hope The Qt Company will reconsider. However, this threat to the Open Source community needs to be anticipated, so that the Qt and KDE communities can prepare themselves.\n The Qt Company says that they are willing to reconsider the approach only if we offer them concessions in other areas. I am reminded, however, of the situation half a year ago. We had discussed an approach for contract updates, which they suddenly threw away by restricting LTS releases of Qt instead.\n What does this mean for the future of Qt and for the future of KDE?\n All software changes in Qt will still be available at as Open Source as required by our contract – maybe with a delay of 12 months if the company decides to part ways with the communities.\n We will continue to work on a contract update that helps all sides. But even if these negotiations were to be unilaterally stopped by The Qt Company, Qt will stay Open Source, and KDE will be able to use it. I am also absolutely sure that the Qt + KDE communities will continue cooperation on new features, bug fixes, and security fixes, even should The Qt Company decide to forgo the benefits of cooperation.\n The Swedish KDE contributor and FOSS enthusiast  Jens Reuterberg has this to say about the Qt Company in a reply on the KDE Community mailing list on April 8th:\n &#34; The fact that they want to burn the field and still think they can harvest come spring is to me ridiculous and seems to be done by someone who has no understanding of the process of work involved in their own project on the technical or social level. &#34;\n Krita developer  Boudewijn Rempt had this to say about the  free software community&#39;s options going forward:\n &#34;If we work together with other participants in the Qt community, then it might be feasible. In fact, I think it&#39;s necessary to start bringing together a group of stakeholders and start preparing for a fork. &#34;\n We do hope that the Qt company will reconsider and allow both development versions and LTS versions of Qt to be licensed under the GNU GPLv3 from day one. However, we are not convinced that using Qt is a good idea even if they do: The  Qt Company has shown that they are  not trustworthy. They lost massive amounts of face when they broke the spirit of their agreement with the  free software community by restricting LTS releases to commercial users back in January. They lost additional face when they dishonored and disgraced themselves by sending a message to the KDE e.V. board and the KDE Free Qt Foundation saying that they will likely restrict all versions of Qt to commercial users for 12 months from their release. They have now put themselves in a position they can not get out of in any even remotely honorable way. The Qt Company would lose additional face if they back-pedal and show that they are weaker than a bunch of hippies in a non-profit foundation and they would lose massive amounts of face and dishonor themselves on a grand scale if they break the spirit of their agreement with the  free software community by restricting Qt releases to a proprietary license for the first 12 months. There is no honorable face-saving way out of this. Thus;  free software developers, and users, should seriously question and consider whether they want to have anything to do with the  Qt Company and their products going forward.\n Update: The Qt Company released this rushed and rather vague statement in their blog on April 9th: &#34;There have been discussions on various internet forums about the future of Qt open source in the last two days. The contents do not reflect the views or plans of The Qt Company.\n The Qt Company is proud to be committed to its customers, open source, and the Qt governance model. &#34;\n It would appear that the public backlash has made the Qt Company leadership seriously reconsider the wisdom of immensely angering the entire free software community.\n  This article is not truthful. The Qt Company has a good and healthy relationship with KDE and active co-operation with the KDE representatives of the KDE Free Qt Foundation (a non-profit foundation with purpose of ensuring Qt&#39;s long-term success). We are also actively working via the Qt Project&#39;s open governance to develop Qt forward together with the open-source community.\n  The article seems to truthfully report what Olaf Schmidt-Wischhöfer wrote publicly. Which is based on alleged **private communication** from Qt Company. NOT the public statement Qt made in January on their blog.\n &gt; But **last week**, the company suddenly informed both the KDE e.V. board and the&gt; KDE Free QT Foundation that the economic outlook caused by the Corona virus&gt; puts more pressure on them to increase short-term revenue. As a result, they&gt; are thinking about restricting ALL Qt releases to paid license holders for the&gt; first 12 months. They are aware that this would mean the end of contributions&gt; via Open Governance in practice.\nDo you have good reason to doubt his representation? If yes, please be more specific. Seems to me personally that Qt Company is just backpedalling due to the backlash, but of course I could be wrong.\n      this is pretty terrible news. i can understand why GTK has been the most dominant toolkit now. which is unfortunate since gnome has really gone the ways of being a dictator on linux. seems like the toolkit situation on linux right now isn&#39;t in a good situation.\n    dude freezing Qt to version 5.2 or whatever is fine with me. anything is better than th Gnome GUI which sucks harder than 20 years of covid19.\n  a number of projects tried to make big money on the cheap by being vague about their freedom. Quite disgusting strategy. First act as anti-Gates the saviour, then rip off people once they&#39;re hooked. such a disgrace.\n    dude if Qt Corp. goes bancrupt from Covid19 , KDE e.V. can buy it for 1 €. problem solved.\n  If Qt Company ever fails to release the latest Qt withing 12 months, KDE is entitled (by mutual agreement both sides signed) to demand release of the entire Qt under any free license (like BSD or MIT or others). Which would mean the end for Qt Company, because current licensing (LGPL) allows them to make money when clients need to modify Qt and do not want to release the code, but with BSD/MIT license they would be allowed to do this even without a commercial license from Qt Company.\n LinuxReviews welcomes  all comments. If you do not want to be anonymous,  register or  log in. It is free.", "posttime": "2020-06-01 15:20:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,qt", "title": "Qt可以成为专有的，KDE关系和基于Qt的自由软件在Jeopardy", "title_en": "Qt Could Go Proprietary, KDE Relationship and Qt-Based Free Software in Jeopardy", "transed": 1, "url": "https://linuxreviews.org/Qt_Could_Go_Proprietary,_KDE_Relationship_And_Qt-Based_Free_Software_In_Jeopardy", "via": "", "real_tags": ["软件", "qt"]}, {"category": "", "categoryclass": "", "imagename": "b94e8e7c8ed90533261a5a8bb7e236d5.jpg", "infoid": 1004625, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在泥盆纪-石炭纪交界处(3.59亿年前)有一次无法解释的陆地大灭绝。在格陵兰岛东部发现的畸形陆地植物孢子表明，物种灭绝与UV-B辐射增加是一致的，表明臭氧层减少。水星通过灭绝级别的数据证明，与其他大规模灭绝不同的是，没有行星规模的火山喷发。重要的是，泥盆纪-石炭纪交界处的陆地大规模灭绝与一次重大的气候变暖相吻合，这场气候变暖结束了最新泥盆纪冰期的强烈末期冰川循环。快速变暖期间臭氧层减少的一个机制是增加了ClO的对流输送。因此，快速变暖过程中的臭氧损失是地球系统固有的过程，不可避免的结论是，在未来变暖的世界中，我们应该对这种可能发生的事件保持警惕。\n泥盆纪末期的大灭绝[或3.59亿年前的汉根堡危机(1)]现在被列为一级大灭绝(2，3)。这次灭绝是一场多重生物危机，与黑色页岩和缺氧有关的海洋灭绝的早期主要阶段(2)与陆地鱼类大规模灭绝(4)和陆生植物的同时灭绝(5)相隔了大约30万年(Ka)(1)。关于花粉和孢子，陆地上的灭绝清楚地表现为泥盆纪-石炭纪(D-C)界线上的多样性完全丧失(6，7)，至少有四个主导孢子组合的主要孢子群灭绝(7)。灭绝后即刻的VI孢子组合以其简单性著称(6)，恢复的植被以小型的简单陆地植物为主。因此，这一事件是一次重大的生态系统破坏，包括结构化森林社区的崩溃(8)。\n在这里，我们报道了格陵兰岛东部陆地D-C边界剖面的一个断面(图1)，它全部包含了灭绝级别。其中一段含有丰富的植物孢子和孢子四分体，具有畸形的雕刻和着色的壁面，这一点是独一无二的。这些畸形与暴露于高水平的紫外线-B(UV-B)是完全一致的，紫外线-B在保护孢粉蛋白壁形成之前破坏了DNA。这表明全球保护性臭氧层暂时丧失。\n在东格陵兰岛，D-C边界是一个2到4米厚的区间，有两个永久性的湖泊，可以沿着75公里长的横断面从远端和深部到近端的浅水环境追踪(图1)。这些湖泊最厚、最远的部分在StensiöBjerg(图1和图2)。S1)。下湖包括一段0.5m厚的泥盆纪末期泥岩[Retispora liidophyta-Verrucosiporites nitidus(LN)过渡孢子带(10)，这里标记为LN*]。在该带上方，有一个0.8米厚的区间，通过该区间，床中点的总有机碳含量(TOC重量%；表S1)逐渐增加到相当异常的最大值21%。然而，高有机质含量的后果是，当TOC%增加到2%以上(图1)时，无定形有机质(AOM)占优势，孢子恢复丧失。孢子只在上游湖中再次发现，但作为极早石炭纪的低多样性后灭绝的VI孢子组合(6，7)。\n160m厚的Stensiöbjerg组的孢子组合。S2~S4)湖泊以下多样性较低(主要为Retispora、鳞藻门和硅藻门)。随着下游湖泊的形成，古环境变得越来越湿润，孢子多样性也随之显著增加，形成了LN*带。然而，随着湖泊的进一步发育，孢子多样性急剧下降，主要孢子群灭绝。S3和S4)，以前在中泥盆世和晚泥盆世是多样的、分布广泛的和范围很长的。这包括在最近的法门纪中实现了全球分布的鳞藻门，所有不同的具有分叉尖端的番茄脚类孢子群(如Ancyropora)，以及Dducites spp，这是形成泥盆纪森林的林下层的Rhacophyton(11)的孢子体，而Diducites spp是形成泥盆纪森林的林下层的Rhacophyton(11)的孢子。\n我们从摄氏度Bjerg上的D-C边界区间收集的数据(图2，表S2和图2)。使我们能够将这些孢子灭绝与巨型孢子的记录联系起来，因为树木大小的植物茎在这个更近的部分丰富。这些树干代表了上游森林中植物残渣的下游堆积。我们的数据表明，这些大的茎在D-C界线上突然完全消失，而在图尔奈期，即早石炭世的前7 Ma(12)，仍然没有消失。这标志着主要森林树冠的坍塌，并与透辉石的灭绝相吻合。然而，\n许多标本，包括四分体和分离的孢子，都是棕色的(图3，H到J和W)。这与直接来自上下岩层的黄橙色孢子颜色(图3，A到C和N到P)所显示的低热成熟度水平形成了对比，镜质体反射率为0.7%(表S3)证实了这个值，相当于最高埋藏温度为107°C。这些在下湖的颜色变化是在每个样本的50个单个角棉样本(图3B和表S3)上测量的，表明平均半透明度从底部的50%逐渐下降。\n这些独特的角藻标本将注意力集中在下游湖内的其他孢子上，这些孢子在检查时也显示出无处不在的畸形。图4显示了孢子Verrucosiporites nitidus，另一个跨越D-C边界的知名物种(16)。边界下面(图4，A到C)和上面(图4，N到P)，这些孢子颜色苍白，有一个形状良好的疣状雕塑。在较低的湖泊内，两栖弧菌表现出从典型到异常的连续的形态范围。然而，大多数拥有结构良好的雕塑的标本都是棕色的。少数人脸色苍白，直径较小，雕塑没有完全成型，元素间距不规则，大小不均匀。似乎在孢子壁发育过程中，产生这种色素沉着的孢子也获得了一定程度的保护。在下湖孢粉组合的其余部分追踪畸形更加困难，因为这个简单的孢子组合中的大多数物种都没有刺，壁面光滑。其中许多在东格陵兰岛和其他地方也是深棕色的，并且在整个VI孢子带都是如此。然而，在所研究的所有三个部分的上游湖泊中都没有明显的畸形孢子，表明破坏的原因已经停止。\n孢子和花粉壁中的畸形在活体花粉(9，17)和化石花粉(9，18)中都有很好的记录，并且是由于DNA[通常是相对碱基对的融合(19)]的破坏造成的，这种损伤发生在保护孢粉蛋白壁层沉积之前。于是花粉就不能复制墙面雕塑的错综复杂和规律性的图案。这种DNA损伤可以通过暴露在UV-B辐射(17)和大气污染物(20)的实验中产生。化石的例子包括二叠纪-三叠纪(9，18，21，22)和三叠纪-侏罗纪(23)的大规模灭绝，那里的针叶花粉和孢子四分体都显示出畸形，通常被解释为来自大火成岩省(LIP)喷发的火山气体的直接影响。然而，在对活的针叶树进行实验之后(9)，这被重新解释为二叠纪-三叠纪的大规模灭绝是由于随着UV-B通量的增加，火山气体最初破坏了臭氧层，然后破坏了花粉和孢子DNA。相比之下，来自三叠纪-侏罗纪的研究则归因于唇部发疹过程中产生的汞(Hg)的遗传毒性效应。\n深色孢子在二叠纪-三叠纪(22)和三叠纪-侏罗纪(23)大规模灭绝级别也有报道。虽然因果关系仍未得到证实，但孢子壁和花粉壁天然地呈黄色，以提供对UV-B的保护，因此任何额外的不透明都会增加这种保护。\n从其它D-C边界区段中已知(26)畸形孢子。一项重要的记录来自波兰(26)，它位于D-C边界(LN孢子带)的正下方，其中包括许多畸形的瓦拉蒂孢子岩标本和孢子四分体。然而，畸形孢子和四分体在波兰都很少见，只有一个样本的四分体含量超过3%，这是裸子植物花粉正常群体的背景突变水平(18)。此外，只有(26)个可用的VI孢子带样本(只包含保存不佳的孢子)与Rebild Bakker的畸形孢子同龄。这些来自波兰的畸形被归因于火山喷发的影响。另一个记录来自比利时(27)，在那里，与LN孢子带相同年龄的畸形孢子被归因于冷却/干旱。同样，比利时剖面与波兰一样，在最早的石炭纪VI带，也就是最大变形发生在东格陵兰岛的时候，没有发现孢子。\n我们对畸形花粉和孢子的记录告诉我们，在大规模灭绝期间起作用的杀死机制是UV-B升高的一段时间，这与保护臭氧层的丧失有关。弗拉斯-法门期(晚泥盆世)、二叠纪末期和三叠纪-侏罗纪大灭绝的致死机制是一种崩塌。\n关于火山气体局部喷发造成DNA损伤的可能性，目前在格陵兰岛东部还没有已知的火山岩产状，最接近的年龄(38岁)大约早于13 Ma。关于空气中的污染物，例如，现代冶炼厂的花粉畸形证据(20)表明，浓度必须非常高才能产生任何影响。因此，这种影响也可以被认为是一种畸形机制，因为穿过D-C边界区间和整个盆地的沉积剖面(38)没有包含异常的沉积物，这些沉积物表明异常的化学派生的气载呼气。\n理解D-C边界臭氧层丧失的关键观测是畸形孢子与下部湖泊完全重合。此外，这些畸形孢子的比例和变暗程度系统地增加到湖床的中点。位于D-C界线的两个湖泊横向分布广泛(38个)(至少50000 km2)，TOC含量异常高，代表了具有分层水柱的长期深湖系统。在D-C边界存在的两个湖泊横向延伸(38)(至少50000 km2)，TOC含量异常高，代表了具有分层水柱的长期深湖体系。这些湖泊的存在与东格陵兰泥盆纪至早石炭世7 km和60 Ma的旱地河流和风沙沉积的正常模式形成了鲜明的对比。这种普遍的干旱与其所处的位置(39)完全一致，无论是在旧红砂岩大陆的内部(距海约1000公里)，还是在南部干旱带的15°古口。只有当持续的季节性降雨量足以维持常年站立的淡水湖时，才能形成这样的大型湖泊。从许多第四纪(40)和深层例子(41，42)可以很好地理解将所需的季节性降雨强度带入这样一个干旱地带大陆内陆的机制。其过程是，大陆内陆夏季的高温导致正常环流的逆转。这种反转吸引了潮湿的空气，然后上升并冷却，产生了强烈的季节性季风。在这些模型中，湖泊是温度最高的，从它们通常干旱的大陆内部位置来看，代表了异常和持续的变暖事件。这将孢子畸形的最大程度置于下湖的中点，与最高温度一致。这种升温与嘴唇在实际喷发期间(即畸形发生时)造成的降温形成对比。与LIP相关的冷却是大气中高水平的火山灰和SO2双重影响的直接结果(3)，并进一步证明在D-C边界没有行星尺度的火山活动。\n最大畸形与气候最大值的重合使我们现在开始寻找温度升高导致臭氧损失的机制。来自美国大陆的综合现代观测和模拟数据(43)提供了这样一种臭氧去除机制，观察到中纬度夏季温度上升，导致向平流层低层对流注入的水蒸气增加。这种增加的高海拔水含量然后超过增加催化活性ClO的产生的阈值(43)，从而增加臭氧损失率。\n正反馈机制在晚泥盆世和早石炭世也可能起作用，因为那里有广阔的陆架海，有大量的碳埋藏(2，44)，因此有机生产力也很高。甲基卤素是由广泛的有机体自然产生的(45)；因此，任何有机生产力的提高最终都会增加供应。臭氧的逐渐丧失和破坏性UV-B的增加将导致观察到的泥盆纪森林环境及其结构性群落的崩溃。随之而来的更高的径流速率将产生一次性的营养物质流入陆架海，从而增加甲基卤素的生产。只有当气温从湖泊循环的顶峰下降时，这一过程才会放缓，从而使臭氧层得以重建。从Stensiöbjerg湖沉积中异常高的TOC间隔的厚度(0.8m)可以估计出持续的时间，这代表了最持久的层化和最温暖的条件。这代表了大约50%。\n..", "note_en": "There is an unexplained terrestrial mass extinction at the Devonian-Carboniferous boundary (359 million years ago). The discovery in east Greenland of malformed land plant spores demonstrates that the extinction was coincident with elevated UV-B radiation demonstrating ozone layer reduction. Mercury data through the extinction level prove that, unlike other mass extinctions, there were no planetary scale volcanic eruptions. Importantly, the Devonian-Carboniferous boundary terrestrial mass extinction was coincident with a major climatic warming that ended the intense final glacial cycle of the latest Devonian ice age. A mechanism for ozone layer reduction during rapid warming is increased convective transport of ClO. Hence, ozone loss during rapid warming is an inherent Earth system process with the unavoidable conclusion that we should be alert for such an eventuality in the future warming world.\n The end-Devonian mass extinction [or Hangenberg Crisis, 359 million years (Ma) ago (  1)] is now included (  2,   3) among the first-order mass extinctions. The extinction was a multiple biotic crisis with an early main phase of marine extinctions associated with black shales and anoxia (  2) separated by an estimated 300 thousand years (ka) (  1) from a terrestrial mass extinction of fish (  4) with coincident extinctions (  5) in land plants. Regarding pollen and spores, the terrestrial extinction is clearly expressed as the complete loss of diversity (  6,   7) across the Devonian-Carboniferous (D-C) boundary with the extinction of at least four major spore groups that had dominated the spore assemblage (  7). The immediate post-extinction VI spore assemblage was remarkable for its simplicity (  6) with the recovery vegetation dominated by small simple land plants. Hence, the event was a major ecosystem disruption that included the collapse of the structured forest community (  8).\n Here, we report on a transect ( Fig. 1) of terrestrial D-C boundary sections from East Greenland that all include the extinction level. One section is unique in containing abundant plant spores and spore tetrads with malformed sculpture and pigmented walls. These malformations are entirely consistent (  9) with exposure to elevated levels of ultraviolet-B (UV-B) that damaged the DNA before the formation of their protective sporopollenin walls. This indicates the temporary loss of the global protective ozone layer.\n In East Greenland, the D-C boundary is a 2- to 4-m-thick interval with two permanent lakes that can be traced ( Fig. 1) along a 75-km-long transect from distal and deep to proximal shallow water environments. The thickest, most distal section of these lakes is on Stensiö Bjerg ( Fig. 1 and fig. S1). The lower lake includes a 0.5-m-thick interval of mudstone of very latest Devonian age [ Retispora lepidophyta - Verrucosisporites nitidus (LN) transitional spore zone (  10), here labeled as LN*]. Above this zone, there is a 0.8-m-thick interval through which the total organic carbon content (TOC weight %; table S1) progressively increases to the quite exceptional maximum of 21% in the midpoint of the bed. However, a consequence of the high organic matter content is that, as TOC% increased above 2% ( Fig. 1), amorphous organic matter (AOM) dominates and spore recovery is lost. Spores are only found again in the upper lake, but as the low diversity post-extinction VI spore assemblage (  6,   7) of very earliest Carboniferous age.\n The spore assemblage in the 160-m-thick Stensiö Bjerg Formation (figs. S2 to S4) below the lakes is of low diversity (largely  Retispora lepidophyta and  Diducites spp). As the lower lake started to form, the paleoenvironment became wetter and more humid, and with it, the spore diversity strikingly increased, which defines the LN* zone. However, as the lake further developed, spore diversity sharply declined with extinctions of major spore groups (figs. S3 and S4) that were formerly diverse, widely distributed, and long ranging through the Mid and Late Devonian. These include  R. lepidophyta that had achieved a global distribution in the latest Famennian, all of the diverse group of lycopod spores with bifurcate tips (e.g.,  Ancyrospora), and  Diducites spp, which is the spore of  Rhacophyton (  11) that formed the understory layer to the Devonian forests.\n The data that we have collected from the D-C boundary interval on Celsius Bjerg ( Fig. 2, table S2, and fig. S5) enable us to link these spore extinctions to the megafossil record, as tree-sized plant stems are abundant in this more proximal section. These stems represent the downstream accumulation of plant debris from forests present upstream. Our data show that these large stems suddenly and entirely disappear exactly at the D-C boundary and remained absent for the Tournaisian, i.e., the first 7 Ma (  12) of the early Carboniferous. This marks the collapse of the main forest canopy and was coincident with the extinction of  Diducites. However, many of the plant groups that formed these first forests reappeared later and had survived as scattered remnants (  13). On Celsius Bjerg, we can also recognize the sedimentological response to this collapse (fig. S6), as the fluvial sandstones above the boundary were deposited by more active larger-scale systems that reflected increased sediment transport in the absence of a structured terrestrial vegetation community.\n  The missing spore record from the lower lake on Stensiö Bjerg was found at Rebild Bakker (  14) ( Fig. 1 and table S3). Here, the two boundary lakes occur within fluvial sandstones and immediately above palynologically dated latest Devonian sediments. The 50-cm-thick lower lake contains no AOM, and five samples from its lower part contain well-preserved, low thermal maturity spores. All the spores that became extinct at the D-C boundary are absent apart from a single specimen of  R. lepidophyta at 9 cm above the base. The top of the Devonian is picked at this and the corresponding level at Stensiö Bjerg. This shows that the missing 0.8-m AOM-rich interval from Stensiö Bjerg was earliest Carboniferous in age.\n The spores from this marginal lake environment are morphologically more diverse. They include  Grandispora cornuta that has long spines that demonstrate a number of unique and highly atypical malformations ( Fig. 3 and figs. S7 and S8) and that reveal the unusual conditions that drove the terrestrial extinctions.  G. cornuta is well known in other D-C boundary sections (  6,   15) and normal specimens ( Fig. 3, D and E) had two wall layers, with the outer wall covered with near-identical long spines (15 to 30 in number) that are regularly spaced, similar in length, and taper evenly to pointed tips.  G. cornuta also have regular circular spots between each inter-ray of the trilete mark, an unusual feature for spores from the D-C boundary interval, which enables it to be uniquely identified even as fragmentary malformed specimens. At Rebild Bakker, malformed specimens of  G. cornuta are the majority ( Fig. 3, F to W) and increase upward in relative abundance through the lower lake from 71 to 95% ( Fig. 3A). The commonest malformation is that the spines become both irregularly spaced (e.g.,  Fig. 3, F, H, and J) and reduced in number, sometimes to as few as five. These spines show a variety of malformed tips that are not evenly pointed, but instead variously became blunt, irregular-shaped crooks, sinuously elongate, or fused together. In other specimens, the sculpture is coalesced and entwined as residual stumps ( Fig. 3, K, N, and P) or elongated with crook ends ( Fig. 3, L and S). On a few specimens, the sculpture was deposited as an irregular mass ( Fig. 3O). On rare specimens, the inner wall never formed ( Fig. 3L), whereas others ( Fig. 3Q) never developed the outer wall. The latter can occur in tetrads ( Fig. 3V), so they are not isolated inner walls from broken spores. Tetrads representing unseparated meiotic spores are common (15% maximum;  Fig. 3, A, R, and W) and show the full range of spine modifications, as shown on the isolated single spores.\n  Many of the specimens, both tetrads and isolated spores, are brown in color ( Fig. 3, H to J and W). This contrasts with the low thermal maturity level demonstrated by the yellow-orange spore colors ( Fig. 3, A to C and N to P) from the beds immediately above and below, a value confirmed by a vitrinite reflectivity of 0.7% (table S3), equivalent to a maximum burial temperature of 107°C. These color variations in the lower lake were measured on 50 single specimens of  G. cornuta from each sample ( Fig. 3B and table S3) and show that the average translucency declined progressively from 50% at the base of the bed to 10% in the highest sample and in parallel with the increase in proportion of malformed specimens.\n These distinctive specimens of  G. cornuta focus attention on other spores within the lower lake that, on examination, also display pervasive malformations.  Figure 4 shows the spore  Verrucosisporites nitidus, another well-known species (  16) that crosses the D-C boundary. Both below ( Fig. 4, A to C) and above ( Fig. 4, N to P) the boundary, these spores are pale in color and with a well-formed sculpture of verrucae. Within the lower lake,  V. nitidus shows a continuous range of morphologies from typical to aberrant forms. However, most specimens that have a well-formed sculpture are brown in color. A minority are pale, smaller in diameter, and with a sculpture that did not fully form, the elements being irregularly spaced and uneven in size. It would appear that spores that developed this pigmentation also acquired a degree of protection during spore wall development. It is more difficult to track malformation in the remainder of the lower lake palynological assemblage, as most of the species in this simple spore assemblage lack spines and have smooth walls. Many of these, in East Greenland and elsewhere, are also dark brown in color and remain so through the entirety of the VI spore zone. However, obvious malformed spores are absent from the upper lake in all three sections that were studied, showing that the cause of the damage has ceased.\n  Malformations in spore and pollen walls are well documented in both living (  9,   17) and fossil pollen (  9,   18) and result from damage to the DNA [typically fusion of opposing base pairs (  19)] that occurs before deposition of the protective sporopollenin wall layer. The pollen are then unable to replicate the intricate and regular pattern of the wall sculpture. Such DNA damage can be produced experimentally by exposure to UV-B radiation (  17) and atmospheric pollutants (  20). Examples from fossil material include the Permo-Triassic (  9,   18,   21,   22) and Triassic-Jurassic (  23) mass extinctions, where both conifer pollen and spore tetrads show malformation that have generally been interpreted as the direct effect of volcanic gases from large igneous province (LIP) eruptions. However, following experiments with living conifers (  9), this has been reinterpreted for the Permo-Triassic mass extinction as the initial destruction of the ozone layer by volcanic gases with the increased UV-B flux and then damaging the pollen and spore DNA. In contrast, that from the Triassic-Jurassic has been attributed (  24) to the genotoxic effects of mercury (Hg) generated during LIP eruptions.\n Dark-colored spores are also reported from the Permo-Triassic (  22) and Triassic-Jurassic (  23) mass extinction levels. Although cause and effect remain unproven, spore and pollen walls are naturally pigmented yellow to provide protection (  25) against UV-B so any additional opacity increases this protection.\n Malformed spores are known (  26) from other D-C boundary sections. An important record is from Poland (  26) immediately below the D-C boundary (LN spore zone) that includes many malformed specimens of  Vallatisporites together with spore tetrads. However, both malformed spores and tetrads are rare in Poland, with only a single sample containing tetrads above 3% that is the background mutation level (  18) within normal population of gymnosperm pollen. In addition, there (  26) was only a single available VI spore zone sample (and that contained only poorly preserved spores) that is coeval with the malformed spores from Rebild Bakker. These malformations from Poland were attributed (  26) to the effects of volcanic eruptions. Another record is from Belgium (  27), where malformed spores of equivalent age to the LN spore zone were attributed to cooling/aridity. Again, the Belgian section in common with Poland had no spore recovery in the earliest Carboniferous VI zone that was when the maximum malformation occurred in East Greenland.\n Our record of malformed pollen and spores informs us that the kill mechanism acting during the mass extinction was an interval of elevated UV-B related to the loss of the protective ozone layer. The kill mechanism inferred for the Frasnian-Famennian (Late Devonian), end Permian, and Triassic-Jurassic mass extinctions is a collapse of the Earth system linked to known LIPs, which are also evidenced (  28,   29) by Hg anomalies. In contrast, compiled records (  26,   29,   30) of igneous activity for the D-C boundary show nothing that approached the planetary scale of a LIP eruption.\n To test the LIP hypothesis [and as advocated in (  31)], we analyzed Hg through the Stensiö Bjerg, Celsius Bjerg, and Rebild Bakker D-C boundary sections. The results ( Fig. 1, tables S1 and S3, and fig. S9) show a number of clear peaks from Stensiö Bjerg. However, when the Hg values are normalized against TOC, the peak coincident with the AOM-rich, high-TOC interval disappears. Hg and TOC analyses ( Fig. 1 and fig. S9) from the correlative Rebild Bakker samples (that lack AOM) only reach a maximum of 7 parts per billion (ppb) and 0.3%, respectively. When normalized as Hg/TOC, the values range from 14 to 26, similar to those from Stensiö Bjerg. Therefore, there is no Hg anomaly coincident with the malformed spores, i.e., at exactly the extinction level. Hg is well known (  32) to be readily absorbed from lake waters by AOM. Hence, a high content simply reflects high AOM absorbing the available Hg. The remaining Hg/TOC peaks at Stensiö Bjerg ( Fig. 1) are coincident with the shifts between carbonate and organic matter–dominated sediments. Hg is also known (  32) to become more concentrated in lake waters that lack organic matter. This then becomes available in excess to become absorbed onto any subsequent AOM produced. These, the first records of Hg through a terrestrial D-C boundary section, in common with marine records from China (  33), the Czech Republic (  33), and Vietnam (  31), have yet to demonstrate convincing evidence (  28) for a LIP.\n A second mechanism to explain an ozone collapse would be the widely repeated hypothesis (  34) of reduced atmospheric  PO 2 (partial pressure of oxygen) across the D-C boundary. This, if correct, would lead to a reduced level of ozone. However, this hypothesis can be refuted as the boundary bed ( Fig. 3C and table S5), and the entire Devonian and Carboniferous section in East Greenland and elsewhere (  35) contains abundant highly reflective dispersed charcoal with reflectivities over 2% and hence of unequivocal wildfire origin. This, in common with a recently updated atmospheric oxygen modeling curve (  36), shows that  PO 2 was in excess of 16.5% (  37).\n Regarding the likelihood of DNA damage from local eruptions of volcanic gases, there are no known occurrences of volcanic rocks at this time in east Greenland, the closest in age (  38) being some 13 Ma earlier. With regard to airborne pollutants, the evidence (  20) from pollen malformation at, for example, modern smelter sites shows that concentrations have to be very high to have any effect. So, this effect can also be discounted as a malformation mechanism because the sedimentary sections (  38) through the D-C boundary interval, and throughout the basin, contains no unusual sediments that are indicative of abnormal chemically derived airborne exhalatives.\n The key observation to understanding the loss of the D-C boundary ozone layer is that the malformed spores occur exactly coincident with the lower lake. In addition, the proportion of these malformed spores and their degree of darkening systematically increases to the midpoint of the lake bed. The pair of lakes present at the D-C boundary was laterally extensive (  38) (at least 50,000 km 2), with exceptionally high TOC contents, and represents long-lived deep lacustrine systems with a stratified water column. The presence of these lakes is in stark contrast to the normal pattern of dryland fluvial and aeolian sedimentary deposition through the 7 km and 60 Ma of the Devonian to early Carboniferous succession in East Greenland. This prevailing aridity is entirely consistent with its location (  39), both in the interior of the Old Red Sandstone Continent (some 1000 km from the sea) and at 15° paleosouth in the southern arid zone. Such large lakes can only form when there is sustained seasonal rainfall sufficient to maintain a perennial standing body of fresh water. The mechanisms that bring the required intensity of seasonal rainfall into such an arid zone continental interior are well understood from many Quaternary (  40) and deep-time examples (  41,   42). The process is that high summer temperatures in the continental interior cause a reversal of the normal circulation. This reversal draws in moisture-laden air, which then rises and cools to produces an intense seasonal monsoon. In these models, the lakes were thermal highs and, from their normally arid continental interior locations, represent episodes of exceptional and sustained warming. This places the maximum degree of spore malformation at the midpoint of the lower lake coincident with the thermal maximum. This warming is in contrast to the cooling that a LIP causes during the actual eruption, i.e., when the malformation would occur. LIP-related cooling is the direct result (  3) of the dual impact of high levels of both ash and SO 2 in the atmosphere and further evidence for the absence of planetary scale volcanism at the D-C boundary.\n The coincidence of maximum malformation with the climatic maximum now leads us to look for a mechanism for ozone loss driven by increasing temperature. Combined modern observation and modeling data (  43) from the continental United States provide such an ozone removal mechanism with an observed increase in mid-latitude summer temperature, leading to an increase in the convective injection of water vapor into the lower stratosphere. This increased high-altitude water content then passes the threshold (  43) for an increased production of catalytically active ClO with ensuing increased rate of ozone loss.\n A positive feedback mechanism could also be at play in the Late Devonian and early Carboniferous, as there were extensive shelf seas with high volumes of carbon burial (  2,   44) and hence high organic productivity. Methyl halogens are produced naturally by a wide range of organisms (  45); hence, any increased organic productivity ultimately increased supply. Progressive ozone loss and increased influx of damaging UV-B would have led to the observed collapse of the Devonian forest environment together with its structured community. The resultant higher rates of runoff would then produce a one-time nutrient flush into the shelf seas and hence increased production of methyl halogens. The process only slowed when temperatures fell from the peak of the lacustrine cycle, allowing the ozone layer to reestablish. A time duration can be estimated from the thickness (0.8 m) of the exceptionally high TOC interval in the lake deposit at Stensiö Bjerg that represents the most persistent stratification and warmest conditions. It represents about 50% \n......", "posttime": "2020-06-01 14:47:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "辐射,radiation,孢子", "title": "UVB辐射是泥盆纪-石炭系灭绝的致死机制", "title_en": "UVB radiation was the Devonian-Carboniferous extinction kill mechanism", "transed": 1, "url": "https://advances.sciencemag.org/content/6/22/eaba0768", "via": "", "real_tags": ["辐射", "radiation", "孢子"]}, {"category": "", "categoryclass": "", "imagename": "4ef103a5666dcd289c4f4fccb49a97f1.png", "infoid": 1004623, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Solid是用于创建用户界面的声明性Javascript库。它不使用虚拟DOM。相反，它选择将模板编译为实际的DOM节点，并将更新包装在细粒度的反应中。这样，当您的状态仅更新依赖于它的代码时，就会运行。\n快地!。性能与优化的、令人痛苦的、命令式的普通DOM代码几乎没有区别。请参阅关于JS框架基准的实体。\n支持JSX、片段、上下文、门户、悬念、SSR、错误边界和异步渲染等现代功能。\n从&#34；solid-js/dom&#34；；const HelloMessage=props=&gt；&lt；div&gt；Hello{pros.name}&lt；/div&gt；；Render(()=&gt；&lt；HelloMessage name=&#34；Taylor&#34；/&gt；，document导入{Render}。getElementById(&#34；hello-Example&#34；)；\n简单的组件只是一个接受属性的函数。Solid使用呈现函数来创建应用程序的反应式挂载点。\n从&#34；solid-js/dom&#34；；const_tmpl$=template(`&lt；div&gt；Hello&lt；/div&gt；`)；const HelloMessage=props=&gt；{const_el$=_tmpl$]导入{Render，Template，Insert，createComponent}。cloneNode(True)；插入(_el$，()=&gt；道具。name，null)；return_el$；}；Render(()=&gt；createComponent(HelloMessage，{name：&#34；Taylor&#34；})，document。getElementById(&#34；hello-Example&#34；)；\n那个_el$是一个真正的div元素，pros.name(在本例中是Taylor)被附加到它的子节点。注意，pros.name包装在一个函数中。这是因为这是该组件中将再次执行的唯一部分。即使名称从外部更新，也只会重新计算该表达式。编译器优化初始呈现，运行时优化更新。这是两全其美的。\n或者，您可以在自己的项目中安装依赖项。要将实体与JSX一起使用(推荐)，请运行以下命令：\nSolid的渲染由DOM表达式库完成。这个库为像Solid这样的细粒度库提供了一个通用的优化运行时，可以使用许多不同的渲染API。最佳选择是将JSX预编译与Babel插件JSX DOM表达式结合使用，以提供最小的代码大小、最干净的语法和最高性能的代码。编译器将JSX转换为本机DOM元素指令，并在反应计算中包装动态表达式。\n最简单的设置方法是将babel-preset-solid添加到您的.babelrc中，或将Babel配置添加到webpack，或ROLLUP：\n请记住，即使语法几乎相同，Solid的JSX和Reaction这样的库的工作方式也有很大的不同。有关更多信息，请参阅JSX呈现。\n或者，在非编译环境中，您可以使用标记模板文字、LIT DOM表达式，甚至将HyperScript与Hyper DOM表达式一起使用。\nSolid的数据管理建立在一组灵活的反应性原语之上。类似于Reaction Hooks，不同的是，它们独立地负责所有的更新，而不是将拥有的组件的更改列入白名单。\n固态原语可以说是它最强大和最独特的原语。通过使用代理和显式设置器，它提供了对不可变接口的控制和可变接口的性能。setter支持多种形式，但要开始使用对象设置和更新状态。\n从&#34；Solid-js&#34；导入{createState，onCleanup}；const CountingComponent=()=&gt；{const[state，setState]=createState({count：0})；const间隔=setInterval(()=&gt；setState({count：stat.。计数器+1})，1000)；onCleanup(()=&gt；clearInterval(Interval))；return&lt；div&gt；{stat.。计数器}&lt；/div&gt；；}；\nconst[state，setState]=createState({user：{firstName：&#34；jack&#34；，lastName：&#34；smith&#34；}})createEffect(()=&gt；setState({displayName：`${state.。用户。FirstName}${state。用户。lastName}`})；控制台。日志(状态。displayName)；//杰克·史密斯setState(&#39；用户&#39；，{FirstName：&#34；Jacob&#34；})；控制台。日志(状态。DisplayName)；//雅各布·史密斯\n每当任何依赖项更改时，State值都会立即更新。每个setState语句将与应用的所有更改同步通知订阅方。这意味着您可以依赖于在下一行上设置的值。\nSolid State还公开了与setState一起使用的协调方法，该方法进行深度差异，以允许与Redux、Apollo(GraphQL)或RxJS等不变存储技术自动有效地交互。\n并查看下面的文档、示例和文章以更熟悉Solid。\n细致入微地思考：SolidJS的性能为何如此出色？从头到尾看看是什么让SolidJS如此快速。\nSolid与JavaScript框架的RealWorld演示比较Solid在更大的应用程序中表现如何？\n设计SolidJS：JSX为什么虚拟DOM诞生的语法也是反应式UI库的最佳语法呢？\n设计SolidJS：不变性反应性状态管理是否既是不可变的，又是性能最好的？\n我们如何编写最快的JavaScript UI框架，多么坚实，超过了JS框架基准。\nUI组件的实际成本不同UI库中组件的成本比较。\n渲染所有实体渲染器与世界上最快的库的DOM比较的最快方法。\nSolid在其V1.0.0版本中功能基本齐全。下一个版本将主要是在稳定的道路上进行错误修复和API调整。", "note_en": "Solid is a declarative Javascript library for creating user interfaces. It does not use a Virtual DOM. Instead it opts to compile its templates down to real DOM nodes and wrap updates in fine grained reactions. This way when your state updates only the code that depends on it runs.\n  Fast! Almost indistinguishable performance vs optimized painfully imperative vanilla DOM code. See Solid on  JS Framework Benchmark.\n  Supports modern features like JSX, Fragments, Context, Portals, Suspense, SSR, Error Boundaries and Asynchronous Rendering.\n  import {  render }  from   &#34;solid-js/dom &#34;; const  HelloMessage  =  props  =&gt; &lt;div&gt;Hello {props.name}&lt;/div&gt;; render( ()  =&gt; &lt;HelloMessage name=&#34;Taylor&#34; /&gt;,  document . getElementById(  &#34;hello-example &#34;));\n A Simple Component is just a function that accepts properties. Solid uses a  render function to create the reactive mount point of your application.\n  import  {  render ,  template ,  insert ,  createComponent  }  from  &#34;solid-js/dom&#34; ; const  _tmpl$  =  template ( `&lt;div&gt;Hello &lt;/div&gt;` ) ; const  HelloMessage  =  props  =&gt;  {  const  _el$  =  _tmpl$ . cloneNode ( true ) ;  insert ( _el$ ,  ( )  =&gt;  props . name , null ) ;  return  _el$ ; } ; render (  ( )  =&gt;  createComponent ( HelloMessage ,  {  name:  &#34;Taylor&#34;  } ) ,  document . getElementById ( &#34;hello-example&#34; ) ) ;\n That  _el$ is a real div element and  props.name,  Taylor in this case, is appended to it&#39;s child nodes. Notice that  props.name is wrapped in a function. That is because that is the only part of this component that will ever execute again. Even if a name is updated from the outside only that one expression will be re-evaluated. The compiler optimizes initial render and the runtime optimizes updates. It&#39;s the best of both worlds.\n      Or you can install the dependencies in your own project. To use Solid with JSX (recommended) run:\n   Solid&#39;s rendering is done by the  DOM Expressions library. This library provides a generic optimized runtime for fine grained libraries like Solid with the opportunity to use a number of different Rendering APIs. The best option is to use JSX pre-compilation with  Babel Plugin JSX DOM Expressions to give the smallest code size, cleanest syntax, and most performant code. The compiler converts JSX to native DOM element instructions and wraps dynamic expressions in reactive computations.\n The easiest way to get setup is add  babel-preset-solid to your .babelrc, or babel config for webpack, or rollup:\n  Remember even though the syntax is almost identical, there are significant differences between how Solid&#39;s JSX works and a library like React. Refer to  JSX Rendering for more information.\n Alternatively in non-compiled environments you can use Tagged Template Literals  Lit DOM Expressions or even HyperScript with  Hyper DOM Expressions.\n     Solid&#39;s data management is built off a set of flexible reactive primitives. Similar to React Hooks except instead of whitelisting change for an owning Component they independentally are soley responsible for all the updates.\n Solid&#39;s State primitive is arguably its most powerful and distinctive one. Through the use of proxies and explicit setters it gives the control of an immutable interface and the performance of a mutable one. The setters support a variety of forms, but to get started set and update state with an object.\n import {  createState,  onCleanup }  from   &#34;solid-js &#34;; const  CountingComponent  = ()  =&gt; {  const [ state,  setState]  =  createState({   counter:  0 });  const  interval  =  setInterval( ()  =&gt;  setState({   counter:   state . counter  +  1 }),  1000 );  onCleanup(()  =&gt;  clearInterval( interval));  return &lt; div&gt; {  state . counter }&lt;/ div&gt;;};\n  const  [ state ,  setState ]  =  createState ( {  user:  {  firstName:  &#34;Jake&#34; ,  lastName:  &#34;Smith&#34;  } } ) createEffect ( ( )  =&gt;  setState ( {  displayName:  `  ${ state . user . firstName }   ${ state . user . lastName }`  } ) ) ; console . log ( state . displayName ) ;  // Jake Smith setState ( &#39;user&#39; ,  { firstName:  &#34;Jacob&#34;  } ) ; console . log ( state . displayName ) ;  // Jacob Smith\n Whenever any dependency changes the State value will update immediately. Each  setState statement will notify subscribers synchronously with all changes applied. This means you can depend on the value being set on the next line.\n Solid State also exposes a reconcile method used with  setState that does deep diffing to allow for automatic efficient interopt with immutable store technologies like Redux, Apollo(GraphQL), or RxJS.\n     And check out the Documentation, Examples, and Articles below to get more familiar with Solid.\n        Thinking Granular: How is SolidJS so Performant? An end to end look at what makes SolidJS so fast.\n A Solid RealWorld Demo Comparison of JavaScript Frameworks How does Solid perform in a larger application?\n   Designing SolidJS: JSX How is it that the syntax born of the Virtual DOM is also secretly the best syntax for Reactive UI libraries?\n Designing SolidJS: Immutability Can Reactive State Management be both Immutable and also the most performant?\n    How we wrote the Fastest JavaScript UI Frameworks How Solid topped the JS Framework Benchmark.\n  The Real Cost of UI Components Comparison of the cost of Components in different UI Libraries.\n The Fastest Way to Render the DOM Comparison of all Solid Renderers against the Fastest Libraries in the World.\n  Solid is mostly feature complete for its v1.0.0 release. The next releases will be mostly bug fixes API tweaks on the road to stability.", "posttime": "2020-06-01 13:40:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,用于,declarative,dom", "title": "Solid-用于构建用户界面的声明性JavaScript库", "title_en": "Solid – A declarative JavaScript library for building user interfaces", "transed": 1, "url": "https://github.com/ryansolid/solid", "via": "", "real_tags": ["java", "用于", "dom"]}, {"category": "", "categoryclass": "", "imagename": "705cf26cac7d9545aef22998556ddb9e.jpg", "infoid": 1004622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周末，针对警察杀害乔治·弗洛伊德(George Floyd)和美国历史上无数其他人的抗议活动继续在全国范围内蔓延，警方的回应是如此残酷，甚至连阿拉尼斯·莫里塞特(Alanis Morissette)都可以看到这种讽刺。\n示威者、记者，甚至坐在家里门廊上的人在社交媒体上发布的视频显示，军事化的警察似乎急于在街头实施暴力，而不是帮助平息暴力。\n在明尼阿波利斯，在前警官德里克·肖文(Derek Chauvin)跪在乔治·弗洛伊德(George Floyd)的脖子上超过8分钟后，日益高涨的抗议活动开始了，警察不仅向示威者发射催泪瓦斯、橡皮子弹和颜料罐，而且还向在家观察的平民发射催泪瓦斯、橡皮子弹和颜料罐：\n昨日发布在社交媒体上的视频捕捉到了纽约警察局警察驾车撞向一群抗议者的画面，这让人想起2017年夏洛茨维尔发生的悲剧画面，当时一名白人至上主义者撞上了一群反对种族暴力的示威人群，并杀害了希瑟·海耶(Heather Heyer)。\n另一段视频显示，纽约警察局的一名警官拉下了一名黑人抗议者的口罩，这名抗议者举起了双手，胡椒直接喷到了他的脸上：\n媒体成员在履行报道抗议活动的职责时，也继续遭到警察的枪击和其他攻击。\nCNN记者奥马尔·吉米内斯(Omar Jiminez)本周早些时候在直播中被明尼阿波利斯警察逮捕，他继续报道街道上的反乌托邦场景，据报道，明尼苏达州公共安全部表示，部署警察是为了“解决复杂的城市战争网络”。\n警察的目标是阻止“城市战争”，还是继续对他们应该保护和服务的人发动战争？\n与此同时，美国总统继续向警方和全国各地的其他人发出他自己对暴力的嗜血的信号。\n周六，他在Twitter上发帖称，如果白宫的抗议者接近冲破围栏，“他们将受到最恶毒的狗和最不祥的武器的迎接”。\n“许多特勤局特工都在等待行动。特朗普在推特上写道：“我们把年轻人放在第一线，先生，他们喜欢这样。”\n据“独立报”报道，明尼阿波利斯警察工会负责人鲍勃·克罗尔中尉去年在特朗普的一次集会上发表讲话，庆祝总统允许警察残暴。\n这位中尉上台时穿着一件红色的“支持特朗普的警察”衬衫，抨击奥巴马政府所谓的“卑鄙”对待警察的方式，并补充道：“特朗普总统上任后做的第一件事就是扭转…的颓势。他决定开始让警察做他们的工作，给罪犯戴上手铐，而不是我们。“", "note_en": "The blaze of protests that continue to spread across the country this weekend in response to the police killing of George Floyd and countless others throughout American history is being responded to by policing so brutal even Alanis Morissette could clock the irony.\n  Videos posted on social media by demonstrators, journalists, and even people sitting on their porches at home show militarized police officers who appear eager to enact violence on the streets rather than help quell it.\n In Minneapolis, where the Fed Up-Rising protests started after former police officer Derek Chauvin kneeled on the neck of George Floyd for more than 8 minutes, cops have not only been firing tear gas, rubber bullets, and paint canisters at demonstrators but also on civilians observing from home:\n   Videos posted on social media yesterday captured New York Police Department officers driving into a crowd of protestors, reminiscent of the tragic images from Charlottesville in 2017 where a white supremacist ran into a crowd of people demonstrating against racial violence and killed Heather Heyer.\n    Another video shows an NYPD officer pulling down the face mask of a black protestor, whose hands are raised, and pepper spraying him directly in the face:\n   Members of the media also continue to be shot at and otherwise targeted by police officers while doing their job reporting on the protests.\n    CNN reporter Omar Jiminez, who was arrested on-air by Minneapolis officers earlier this weekend, continued covering the dystopian scenes on the streets where   the Minnesota Department of Public Safety reportedly said cops were deployed to “address a sophisticated network of urban warfare.”\n   Are the police aiming to stop “urban warfare” or are they the ones continuing to wage it against people they are supposed to protect and serve?\n  Meanwhile, the president of the U.S. continues to signal to police and everyone else across the country his own bloodthirst for violence.\n On Saturday he posted on Twitter that protestors at the White House “would have been greeted with the most vicious dogs, and most ominous weapons,” if they had come close to breaching the fence.\n  “Many Secret Service agents just waiting for action. ‘We put the young ones on the front line, sir, they love it,” Trump tweeted.\n According to reporting from the Independent, the head of the Minneapolis Police Union Lieutenant Bob Kroll spoke at a rally for Trump last year where he celebrated the permission the president gave to cops to be brutal.\n   Donning a red “Cops for Trump” shirt as he took the stage, the lieutenant attacked the Obama administration over its alleged “despicable” treatment of police, adding: “The first thing President Trump did when he took office was turn that around … he decided to start to let cops do their job, put the handcuffs on the criminals instead of us.”", "posttime": "2020-06-01 13:22:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全国,instigating,警察", "title": "警方在全国范围内的抗议活动中煽动暴力", "title_en": "Police Are Instigating Violence During the Nationwide Protests", "transed": 1, "url": "https://www.theroot.com/police-prove-point-of-protests-by-instigating-violence-1843797562", "via": "", "real_tags": ["全国", "警察"]}]