[{"category": "", "categoryclass": "", "imagename": "887ef309c0772a0581bddc2c9e3a3c96.jpg", "infoid": 1007649, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个国际科学家小组警告说，使用气溶胶反射阳光和冷却地球将削弱两个半球温带纬度的风暴路径。他们的模型表明，虽然这样的太阳地球工程计划可以减轻冬季风暴的严重程度，但它们也会使夏季的天气系统停滞不前。这可能会导致更强烈的热浪，空气污染增加，海洋环流发生变化。\n太阳地球工程涉及通过反射入射的阳光来冷却地球，一些科学家认为这是减轻全球变暖影响的一种方式。一种流行的策略是在平流层放置反射气溶胶-使用飞机、气球或飞艇-以阻挡阳光。\n但太阳地球工程的效果尚不清楚。它不会像冷却地球那样简单地起作用，从而使地球的气候恢复到工业化前的水平。太阳地球工程下的气候将有所不同，因为大气中的二氧化碳水平仍将显著增加。\n查尔斯·格特勒(Charles Gertler)是美国麻省理工学院地球、大气和行星科学系的研究生，他和同事们感兴趣的是，向大气中注入气溶胶将如何影响两个半球的极地到赤道温度梯度，以及这可能对温带风暴路径产生的影响。这些地区位于中高纬度地区，被称为温带气旋的风暴发生频率较高，在决定世界许多地区的日常天气条件方面发挥着重要作用。\n格特勒解释说：“世界上大约一半的人口生活在温带地区，那里的风暴路径主导着天气。”他补充说，“风暴路径依赖于经向温度梯度，而风暴路径之所以有趣，是因为它们帮助我们了解极端天气。”\n该研究小组使用各种气候模型来探索太阳地球工程对风暴路径的影响。首先，他们分析了地球工程模型对比项目实验G1中的模拟，该项目为研究人员提供了太阳辐射管理方案，供研究人员与气候模型一起使用。\n在G1方案中，太阳辐射减少，以平衡二氧化碳浓度相对于工业化前水平翻了两番而导致的变暖。这一模型运行了50年，并与将二氧化碳保持在工业化前水平的模型和模拟二氧化碳浓度翻了两番的模型进行了比较，以分别提供基线和全球变暖情景。\n该团队还进行了另外两次气候模拟。第一个被称为“半个G1”，旨在模拟一个介于G1地球工程模拟和未来二氧化碳浓度翻两番之间的情景。在另一个模型中，气溶胶被注入四个不同纬度的平流层，由反馈算法控制。\n发表在“地球物理研究快报”上的他们的研究结果表明，反射太阳辐射以抵消全球变暖将削弱南北半球的风暴路径。这些影响是由不同纬度的平均温度和湿度的变化推动的，这些变化降低了两半球从极点到赤道的温度梯度。从本质上讲，减少传入的太阳辐射会使赤道降温，而两极则继续变暖。\n“我们的结果表明，太阳地球工程不会简单地逆转气候变化，”格特勒解释说。“相反，它本身有可能导致气候发生新的变化。”\n在北半球，风暴路径预计也会随着气候变化而减弱。最新的研究表明，这将发生在与太阳地球工程类似的震级。然而，在南半球，全球变暖预计将增加风暴路径的强度，并使其向南移动。有了太阳地球工程，这些风暴路径将会减弱，一些模型表明，这些系统可能也会向极地移动。\n格特勒说：“在两个半球，减弱的风暴路径将意味着更弱的冬季风暴，但也会导致更多的停滞天气，这可能会影响热浪。”“在所有季节，这可能会影响空气污染的通风。这也可能会削弱水文循环，导致区域降雨量减少。与我们习惯的基线气候相比，这些都不是什么好的变化。“。研究人员警告说，在南半球，风暴路径强度的变化可能会影响风力驱动的海洋环流，并影响南极冰盖的稳定性。\n格特勒说：“这项工作突出表明，太阳地球工程并没有逆转气候变化，而是用一种前所未有的气候状态取代了另一种。”", "note_en": "Using aerosols to reflect sunlight and cool the planet will weaken storm tracks in the temperate latitudes in both hemispheres, an international team of scientists warn. Their modelling suggests that while such solar geoengineering schemes could reduce the severity of winter storms, they would also stagnate weather systems in the summer. This could lead to more intense heat waves, increases in air pollution, and changes in ocean circulation.\n   Solar geoengineering involves cooling the Earth by reflecting incoming sunlight and is seen by some scientists as a way of mitigating the effects of global warming. One popular strategy involves placing reflective aerosols in the stratosphere – using aircraft, balloons or blimps – to block sunlight.\n But the effects of solar geoengineering are unknown. It would not work as simply as cooling the planet and therefore returning Earth’s climate to pre-industrial levels. Climate under solar geoengineering would be different, as there would still be marked increases in atmospheric carbon dioxide levels.\n  Charles Gertler, a graduate student in the Department of Earth, Atmospheric and Planetary Sciences at the Massachusetts Institute of Technology, in the US, and colleagues were interested in how injecting aerosols into the atmosphere would impact the pole‐to‐equator temperature gradient in both hemispheres, and the effect that could have on extratropical storm tracks. These are regions in the mid and high latitudes with heightened incidences of storms known as extratropical cyclones, which play a significant role in determining the day-to-day weather conditions in many parts of the world.\n “About half the world’s population lives in the extratropical regions where storm tracks dominate weather,” Gertler explains. He adds, “Storm tracks feed off of meridional temperature gradients, and storm tracks are interesting because they help us to understand weather extremes.”\n The team used various climate models to explore the effects of solar geoengineering on storm tracks. First, they analysed simulations from experiment G1 of the  Geoengineering Model Intercomparison Project which provides solar radiation management schemes for researchers to use with climate models.\n  In the G1 scenario solar radiation is reduced to balance warming caused by a quadrupling of carbon dioxide concentrations, relative to pre-industrial levels. This was run for 50 years and compared with a model that kept carbon dioxide at pre-industrial level and one that simulated a quadrupling of carbon dioxide concentrations, to provide a baseline and a global warming scenario, respectively.\n The team ran two other climate simulations. The first, known as ‘half G1’, aims to model a scenario half-way between the G1 geoengineering simulation and a future where carbon dioxide concentrations quadruple. In the other model aerosols are injected into the stratosphere at four different latitudes controlled by a feedback algorithm.\n Their results, described in   Geophysical Research Letters, show that reflecting solar radiation to counteract global warming would weaken storm tracks in both the northern and southern hemispheres. These effects are driven by changes in mean temperature and humidity at different latitudes that reduce the pole‐to‐equator temperature gradient in both hemispheres. Essentially, reducing incoming solar radiation cools the equator while the poles continue to warm.\n  “Our results show that solar geoengineering will not simply reverse climate change,” Gertler explains. “Instead, it has the potential itself to induce novel changes in climate.”\n In the Northern hemisphere storm tracks are also predicted to weaken with climate change. The latest work suggests that this would occur at a similar magnitude as with solar geoengineering. In the southern hemisphere, however, global warming is expected to increase the intensity of the storm tracks and shift them south. With solar geoengineering these storm track would weaken, with some of the models indicating that there may also be a poleward shift in these systems.\n  “A weakened storm track, in both hemispheres, would mean weaker winter storms but also lead to more stagnant weather, which could affect heat waves,” Gertler says. “Across all seasons, this could affect ventilation of air pollution. It also may contribute to a weakening of the hydrological cycle, with regional reductions in rainfall. These are not good changes, compared to a baseline climate that we are used to.” In the southern hemisphere changes in storm track intensity could impact wind‐driven ocean circulations and affect the stability of Antarctic ice sheets, the researchers warn.\n “This work highlights that solar geoengineering is not reversing climate change, but is substituting one unprecedented climate state for another,” Gertler says.", "posttime": "2020-06-22 23:21:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,geoengineering,风暴", "title": "建模表明，太阳地球工程可能会导致不必要的气候变化", "title_en": "Solar geoengineering could cause unwanted changes in climate, modelling suggests", "transed": 1, "url": "https://physicsworld.com/a/solar-geoengineering-could-cause-unwanted-changes-in-climate-new-modelling-suggests/", "via": "", "real_tags": ["表明", "风暴"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007648, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "古老的工作场所极其危险，它的条件会导致健康问题，从老茧和疤痕到永久性畸形或其他不太明显的问题，比如呼吸问题。尽管缺乏对健康和安全的现代理解，甚至缺乏基本的卫生原则，但在那里工作的人认识到保护的必要性，他们使用各种保护设备来管理，从初级到高级，其复杂性和独创性无所不包。\n农业工作伴随着许多危险。在最基本的层面上，工人们长时间在烈日下工作，戴着头盔保护自己。田园诗人卡尔普尔纽斯·斯库鲁斯(Calpurnius Scurus)形容他们戴着贴身的皮帽，而考古学家威廉·马修·弗林德斯·皮特里(William Matthew Flinders Petrie)在1901年至1902年在埃及的发掘季节发现了一顶巴拿马风格的草帽，这可能也有类似的目的。自那以后，它被放射性碳测得可以追溯到公元420-568年，使其成为世界上最古老的此类帽子。根据植物学家Theophrastus的说法，当冒险进入茂密的灌木丛时，工人们还试图通过穿戴坚固的手部和脚部覆盖物来避免致命的叮咬和叮咬。读了埃利修斯的诗，这就说得通了。这首诗讲的是一个叫敏登的人，在砍树的时候，被一只蜘蛛咬伤了脚；被咬的地方感染了，变成了坏疽，他的腿被截肢了。这也是众所周知的，一些植物有很强的特性，既有正面的，也有负面的。普卢塔克记录说，那些负责收获鸦片罂粟的人被警告要警惕令人昏昏欲睡的烟雾，并用什么东西遮住鼻子和嘴巴，也许是皮革或布料制成的口罩，以防止吸入。\n埃涅阿斯·塔克提库斯在围困期间对破坏的实际操作提供了长篇指导：“一个人应该把两辆马车的杆子…绑在一起。高高举起的，朝同一点倾斜的。然后，当这件事做完后，除了上面的其他木头和各种覆盖物外，还应该把杆子绑在上面，用粘土把它们覆盖起来。因此，这个装置可以在你想要的任何地方通过轮子前进和撤退，而那些正在挖掘的人可以保持在这种保护之下。\n显然，军事矿工比那些开采矿物和金属的矿工更受重视：后者没有这样的保护，在悲惨的条件下劳动-就像从古代矿山发现的骨骼所显示的那样-经常戴着镣铐和锁链。老普林尼在服兵役期间曾在西班牙的银矿呆过相当长的时间，并详细描述了他们的工作方式。他说，那些负责加工矿物的人会把动物膀胱制成的口罩绑在他们的鼻子和嘴巴上，以防止他们吸入灰尘并损害肺部。他们的眼睛保持畅通，这样他们就能看到他们在做什么。根据学者朱利叶斯·波勒克斯(Julius Pollux)的说法，这种临时面罩是逐渐开发和改进的：增加了一个麻布过滤器，并开始与身体其他地方佩戴的袋子和麻袋一起使用，想必是为了保护皮肤的敏感区域不受伤害和感染。\n潜水员在寻找用于制造紫色染料、海绵、珍珠甚至从沉船中打捞的蜗牛时，通常会把海绵绑在他们的头上。亚里士多德得出结论，这是为了保护他们的耳朵。Lycophron在他唯一幸存的诗中建议，有时潜水员还会穿着简陋的皮革潜水服，让自己适应冰冻的水。虽然许多古代潜水似乎采取了我们今天所知的自由潜水的形式，但亚里士多德关于这一主题的反复写作清楚地表明，有时会使用类似通气管的呼吸器-似乎一些潜水员甚至走得更远，用大锅制作初级潜水钟，即使在水下也可以保留一定数量的空气。几个世纪以来，关于这些策略的故事流传开来，变得越来越富有想象力，越来越精致，最终变得虚构。他们最终发现自己融入了亚历山大传奇的中世纪现象，在这一现象中，亚历山大大帝被描绘成指挥着现代潜艇的古代先驱。这个装置被认为是由玻璃制成的气泡、桶或盒子组成的，这些气泡、桶或盒子被放在船上，带到大海中，然后通过金属链条从侧面一直降到海床上，让亚历山大能够在相对安全和舒适的情况下征服海洋，就像他征服陆地一样。\n就像战士，无论是士兵还是角斗士，在战斗中穿着盔甲保护自己不受伤害和死亡一样，其他不那么引人注目的古代工人在日常生活中也理所当然地使用个人防护装备。但必须指出的是，由于这项工作的大部分是由被奴役和以前被奴役的人承担的，c", "note_en": "The ancient workplace was extremely hazardous, its conditions causing health problems from callouses and scars to permanent deformities or other, less immediately visible, issues, such as breathing problems. Despite the absence of the modern understanding of health and safety, or even basic principles of hygiene, the people working in it recognised the need for protection, which they managed using a variety of protective equipment, ranging in complexity and ingenuity from the rudimentary to the advanced.\n Agricultural work came with many dangers. At the most basic level, workers, spending long hours under the hot sun, protected themselves with headgear. The bucolic poet Calpurnius Siculus describes them wearing close-fitting leather caps, while the archaeologist William Matthew Flinders Petrie recovered a Panama-style straw hat during his 1901-2 excavation season in Egypt, which may have served a similar purpose. It has since been radiocarbon-dated to AD 420-568, making it the oldest such hat in the world. According to the botanist Theophrastus, workers also attempted to avoid deadly bites and stings by wearing sturdy hand and foot coverings when venturing into dense undergrowth. This makes sense when read against Erycius’ poem about a man named Mindon, who, while cutting down a tree, was bitten on the foot by a spider; the bite became infected, turned gangrenous and his leg was amputated. It was common knowledge, too, that some plants had powerful properties, both positive and negative. Plutarch records that those tasked with harvesting the opium poppy were warned to be on their guard against the soporific fumes and to cover their noses and mouths with something, perhaps a mask made from leather or cloth, to prevent inhalation.\n Aeneas Tacticus provided lengthy instructions on the practicalities of undermining during a siege: ‘One should fasten together the poles of two wagons … raised aloft, inclining toward the same point. Then, when this has been done, one should fasten on to the poles in addition other timbers and sorts of covering above and cover them over with clay. This device, then, could be advanced and withdrawn on its wheels wherever you desire, and those who are excavating could keep under this protection.’\n Clearly, military miners were valued more highly than those who mined for minerals and metals: the latter had no such protection and laboured in miserable conditions, often – as skeletons recovered from ancient mines have shown – in shackles and chains. Pliny the Elder spent considerable time at the silver mines in Spain during his military service and described their workings in detail. Those responsible for processing the minerals, he recounted, tied masks made from animal bladders over their noses and mouths to prevent them from inhaling the dust and damaging their lungs. Their eyes were left unobstructed so they were able to see what they were doing. According to the scholar Julius Pollux, this makeshift mask was gradually developed and refined: a sackcloth filter was added and it began to be used in conjunction with bags and sacks worn elsewhere on the body, presumably to protect sensitive areas of skin from injury and infection.\n  Divers on the lookout for snails used in the manufacture of purple dye, sponges, pearls, or even salvage from shipwrecks, would routinely bind sponges around their heads. Aristotle concluded that it was to protect their ears. Lycophron suggested in his only surviving poem that, on occasion, divers would also wear rudimentary leather wetsuits to inure themselves to the freezing water. While much ancient diving seems to have taken the form of what we know today as freediving, Aristotle’s repeated writings on the subject make it clear that breathing apparatus akin to a snorkel was sometimes used – and it seems some divers went even further than that, making rudimentary diving bells out of cauldrons that could retain a certain amount of air even while submerged. Over the centuries, stories about these tactics spread and became increasingly imaginative, elaborate – and, ultimately, fictional. They eventually found themselves incorporated into the medieval phenomenon of the  Alexander Romance, in which Alexander the Great was portrayed commanding an ancient precursor to the modern submarine. This contraption was thought to have consisted of a bubble, barrel or case made of glass that was placed on a ship, taken out to sea, then lowered over the side and all the way down to the seabed on a metal chain, allowing Alexander, in relative safety and comfort, to conquer the sea as he had conquered the land.\n Just as warriors, whether soldiers or gladiators, wore armour to protect themselves from injury and death during battle, other, less high profile, types of ancient workers also used personal protective equipment as a matter of course in their daily lives. But it is important to note that, since much of this work was undertaken by the enslaved and formerly enslaved, considered to be the lowest of the low in ancient Greek and Roman society, the physical and mental welfare of the members of the workforce was not uppermost in the minds of those in charge of and responsible for them; they were not considered to be individuals of consequence, or even individuals at all. In fact, ancient authors routinely referred to them as ‘articulate tools’. Rather, it was their productivity that was privileged. Consequently, these measures were not only aimed at protecting the frail human body, they were also aimed at augmenting it to provide a functional advantage in an inhospitable environment, somewhere that humans would not, or could not, normally go, all in the pursuit of financial gain for a relative few.", "posttime": "2020-06-22 23:20:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "古代,easily,保护", "title": "轻松呼吸：古代世界对防护设备的解决方案", "title_en": "Breathing Easily: The ancient world's solutions for protective equipment", "transed": 1, "url": "https://www.historytoday.com/history-matters/breathing-easily", "via": "", "real_tags": ["古代", "easily", "保护"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "唐纳德·特朗普(Donald Trump)总统一直在以子弹头列车的速度解雇联邦监督机构。在4月和5月的短短6周时间里，总统解雇了5名联邦机构的监察长。在上周五晚上的政变中，司法部长威廉·巴尔(William Barr)作为总统的参谋罢免了纽约南区联邦检察官，后者是负责监督该地区华尔街银行起诉的联邦检察官。私人所有的纽约联邦储备银行(Federal Reserve Bank Of New York)也位于该地区，该银行负责美联储的大部分救助计划。\n巴尔和总统希望让一个没有检察官经验的人来负责这个办公室，杰伊·克莱顿目前是美国证券交易委员会(Securities And Exchange Commission)的主席，而证券交易委员会只有民事执行权。在加入SEC成为Sullivan&amp；Cromwell合伙人之前的三年里，克莱顿代表了华尔街10家最大银行中的8家。\n不幸的是，监管机构和检察官是美国公民目前最需要的，因为财政部和美联储都有大量资金下落不明。\n被称为CARE法案的刺激法案于2020年3月27日由总统签署成为法律。它呼吁“不超过454,000,000美元的…。可向联邦储备系统理事会设立的项目或设施提供贷款和贷款担保，并对其进行其他投资，目的是向支持向符合条件的企业、州或市政当局放贷的金融系统提供流动性。“。此外，如果财政部有国会在CARE法案中分配的460亿美元剩余资金中的任何一笔，以帮助航空公司或国家安全企业，这笔资金也将移交给美联储。\n近三个月前，在大萧条以来最严重的经济动荡开始时，CARE法案获得通过。有人会认为，国会采取行动通过这项立法的紧迫性，会导致4540亿美元迅速部署到美联储，以帮助支撑经济。\n但根据美国联邦储备委员会(Federal Reserve)上周四公布的数据，在国会拨给美联储的4540亿美元中，财政部只上缴了1140亿美元。美国联邦储备委员会(Federal Reserve)每周公布的资产负债表数据(H.4.1)显示，一个标题为“财政部对信贷安排的贡献”的项目显示，余额仅为1140亿美元。\nH.4.1上的一个脚注确切地解释了哪些美联储救助计划从财政部获得了这笔钱：\n“商业票据融资工具II LLC的股权投资额为100亿美元，企业信贷融资工具LLC为375亿美元，MS[Main Street]Facilities LLC为375亿美元，市政流动性工具LLC为175亿美元，TALF II LLC为100亿美元，货币市场互惠基金流动性工具的信用保护为15亿美元。”\n总统的经济顾问拉里·库德洛(Larry Kudlow)在立法签署前的新闻发布会上解释了为什么美联储将获得这笔巨额资金。这笔钱将被美联储用作特殊目的载体(Special Purpose Vehicle)的股权投资，这些资金将用作“吸收亏损的资本”，这意味着纳税人将承担前4540亿美元的损失。然后，美联储将可以自由地将这笔钱的杠杆率提高10倍，以创建4.54万亿美元的救助计划。\n美联储主席鲍威尔在3月26日的《今日秀》节目中史无前例地亮相，并这样解释该计划：\n鲍威尔：“在像现在这样的某些情况下，我们确实有能力基本上使用我们的紧急贷款权力，唯一的限制将是我们从财政部获得多少支持。我们被要求为我们的贷款获得全额担保，这样我们就不会赔钱。因此，财政部在我们估计可能的损失时提供了资金，…。实际上，财政部吸收1美元的损失支持足以支持10美元的贷款。\nCARE法案立法的撰稿人显然预计美联储可能想要对其一些货币交易保密，因为CARE法案的第4009条暂停了美联储的信息自由法，并允许美联储秘密举行会议，直到总统表示冠状病毒国家紧急状态结束。\n鲍威尔和美联储负责监管的副主席兰德尔·夸尔斯都在听证会上多次向国会表示，这些救助计划的接受者对美国人民将是透明的。上周二和周三，美联储主席鲍威尔每半年一次在参议院银行和众议院金融服务委员会露面。他就美联储的紧急救助机制向两个委员会发表了以下声明：\n“这些设施中的许多都得到了CARE法案的资金支持。我们将按月披露每项贷款参与者的姓名和详情；借款金额和收取的利率；以及每项贷款的总成本、收入和费用。我们接受我们对美国人民的责任，即尽可能地透明，我们理解，当我们被要求使用我们的紧急权力时，透明度的必要性变得更加必要。“。\n但这是美联储的网页，显示了根据美联储法案第13(3)条指定为紧急贷款工具的安排向国会披露的情况。列出了11个项目。只有3个项目(占总数的27%)提供了实际交易数据，显示了向特定收款人提供的具体贷款。\n这些计划是二级市场公司信贷安排(Second Market Corporation Credit Facility)，它花了大部分资金购买由贝莱德(BlackRock)赞助的交易所交易基金(ETF)，贝莱德是美联储聘请来监督该计划的投资管理公司；市政流动性安排只向伊利诺伊州提供了一笔12亿美元的贷款，因为该计划的条款非常苛刻，本应帮助州和地方政府在大流行病关闭后幸存下来；以及Paycheck Protection Program流动性安排，它向一家规模很小的新泽西银行提供了53亿美元，占其总支出的9%。\n但这份美联储正在运营的11项救助设施的清单很难说是全貌。2019年9月17日，美联储开始每周向华尔街大型银行的交易部门发放数千亿美元的超低成本回购贷款。这些贷款正在进行中，目前的利率仅为1%的十分之一。自去年9月以来，美联储已经累计发放了超过9万亿美元的这些贷款。它没有公布任何关于华尔街公司具体收到了这笔钱的信息，或者他们各自收到了多少钱。\n美联储还通过贴现窗口向华尔街银行发放了多笔贷款。美联储没有公布这些银行的名称，也没有公布它们需要借入多少钱。美联储还没有解释它如何能够不断地告诉美国人民，华尔街的银行“资本充足”，而它需要继续发放这些最后贷款人的贷款。\n美联储(Federal Reserve)还设立了一项流动性安排，进行大规模的外国央行美元掉期，为这些央行购买美元计价资产创造流动性，并帮助支撑市场。上周四的H.4.1显示，美元掉期机制目前的余额为3520亿美元。截至5月27日，该机构的余额高达4490亿美元。\n根据美国政府问责局(Government Accounability Office)在2008年金融危机后对美联储进行的审计，这是当时那些美元掉期额度的用途之一：\n“2008年10月，根据美国联邦储备委员会(美联储/FED)工作人员的说法，联邦储备委员会允许瑞士国家银行(瑞士央行)根据其互换额度协议使用美元向瑞士大型银行组织瑞银提供特别援助。具体地说，2008年10月16日，瑞士国家银行(Swiss National Bank)宣布，将使用通过与纽约联邦储备银行(FRBNY)互换额度获得的美元，帮助为其将创建的特殊目的工具(SPV)提供资金，以从瑞银(UBS)购买至多600亿美元的非流动性资产。\n瑞银是一家主要的投资银行和贸易公司，也是华尔街的主要参与者。它在2000年收购了美国大型零售经纪公司PaineWebber。瑞银暗池(UBS Dark Pool)，相当于在瑞银内部运营的监管不力的证券交易所，一直是华尔街银行股的最大交易商之一。\n联邦储备理事会已经让纽约联邦储备银行负责这些救助计划的大部分。它的冲突很多。(请参阅下面的相关文章。)。现在是国会阻止美联储重复其弥天大谎的时候了，即它将不遗余力地保持透明度，并迫使它交出这些贷款接受者的姓名和美元金额。", "note_en": "President Donald Trump has been sacking federal watchdogs at the speed of a bullet train. In just a six-week period in April and May,  the President fired five Inspectors General of federal agencies. In last Friday night’s coup d’état, Attorney General William Barr, acting as consigliere for the President, ousted the U.S. Attorney for the Southern District of New York, the federal prosecutor that oversees prosecutions of Wall Street banks in that district. The privately owned Federal Reserve Bank of New York, which is in charge of the bulk of the Fed’s bailout programs, also resides in that district.\n Barr and the President want to put a man with zero experience as a prosecutor in charge of that office, Jay Clayton, who currently heads the Securities and Exchange Commission which has only civil enforcement powers. Clayton represented 8 of the 10 largest Wall Street banks in the three years before going to the SEC as a partner at Sullivan &amp; Cromwell.\n Unfortunately, watchdogs and prosecutors are what American citizens need the most right now as vast sums of money are unaccounted for at both the Treasury and Federal Reserve.\n The stimulus bill known as  the CARES Act was signed into law by the President on March 27, 2020. It called for “Not more than the sum of $454,000,000,000…shall be available to make loans and loan guarantees to, and other investments in, programs or facilities established by the Board of Governors of the Federal Reserve System for the purpose of providing liquidity to the financial system that supports lending to eligible businesses, States, or municipalities.” In addition, if the Treasury had any of its $46 billion left over that Congress had allotted in the CARES Act to assist airlines or national security businesses, that was to be turned over to the Fed as well.\n The CARES Act was passed almost three months ago at the outset of the worst economic upheaval since the Great Depression. One would have thought that the urgency with which Congress acted to pass the legislation would have resulted in rapid deployment of the $454 billion to the Fed to help shore up the economy.\n But according to data released this past Thursday by the Federal Reserve, the Treasury has turned over just $114 billion of the $454 billion that was allocated to the Fed by Congress. The Federal Reserve’s weekly balance sheet data release,  known as the H.4.1, showed a line item titled “Treasury contributions to credit facilities” and it showed a balance of just $114 billion.\n A footnote on the H.4.1 explained exactly which Fed bailout programs had received the money from the Treasury:\n “Amount of equity investments in Commercial Paper Funding Facility II LLC of $10 billion, Corporate Credit Facilities LLC of $37.5 billion, MS [Main Street] Facilities LLC of $37.5 billion, Municipal Liquidity Facility LLC of $17.5 billion, and TALF II LLC of $10 billion, and credit protection in the Money Market Mutual Fund Liquidity Facility of $1.5 billion.”\n  The President’s economic advisor, Larry Kudlow, explained at a press briefing before the signing of the legislation, why the Fed was to get this vast sum of money. The money would be used as equity investments by the Fed in Special Purpose Vehicles that would use the money as “loss absorbing capital,” meaning that taxpayers would eat the first $454 billion in losses. The Fed would then be free to leverage this money up by a factor of 10 to create $4.54 trillion in bailout programs.\n Fed Chairman Powell made an unprecedented appearance on the  Today show on March 26 and explained the plan like this:\n Powell: “In certain circumstances like the present, we do have the ability to essentially use our emergency lending authorities and the only limit on that will be how much backstop we get from the Treasury Department. We’re required to get full security for our loans so that we don’t lose money. So the Treasury puts up money as we estimate what the losses might be…Effectively $1 of loss absorption of backstop from Treasury is enough to support $10 of loans.”\n The writers of the CARES Act legislation apparently expected that the Fed might want to keep some of its money transactions a secret because Section 4009 of the CARES Act suspends the Freedom of Information Act for the Fed and allows it to conduct its meetings in secret until the President says the coronavirus national emergency is over.\n Both Powell and the Fed’s Vice Chairman for Supervision, Randal Quarles, have repeatedly stated to Congress in hearings that the recipients of these bailout programs would be transparent to the American people. Last Tuesday and Wednesday, Fed Chairman Powell made his semi-annual appearances before the Senate Banking and House Financial Services Committee. He stated the following to both Committees regarding the Fed’s emergency bailout facilities:\n “Many of these facilities have been supported by funding from the CARES Act. We will be disclosing, on a monthly basis, names and details of participants in each such facility; amounts borrowed and interest rate charged; and overall costs, revenues, and fees for each facility. We embrace our responsibility to the American people to be as transparent as possible, and we appreciate that the need for transparency is heightened when we are called upon to use our emergency powers.”\n But this is the  Fed’s web page that shows the disclosures being made to Congress under the facilities that the Fed has designated as emergency lending facilities under Section 13(3) of the Federal Reserve Act. There are 11 programs listed. Just three of the programs, or 27 percent of the total, have provided the actual transaction data showing specific loans to specific recipients.\n Those programs are the Secondary Market Corporation Credit Facility, which has spent the bulk of its money buying up Exchange Traded Funds sponsored by BlackRock, the investment manager that the Fed hired to oversee the program; the Municipal Liquidity Facility which has made just one loan of $1.2 billion to the state of Illinois because the terms are so onerous in this program that is supposed to be helping state and local governments survive the pandemic shutdowns; and the Paycheck Protection Program Liquidity Facility, which provided $5.3 billion or 9 percent of its total outlays to  a tiny New Jersey Bank that has been cited by the Federal Deposit Insurance Corporation for “unsafe or unsound banking practices.”\n But this list of 11 bailout facilities that the Fed is operating is hardly the full picture. On September 17, 2019 the Fed began making hundreds of billions of dollars a week in super low cost repo loans to the trading units of Wall Street’s mega banks. Those loans are ongoing and are currently being made at an interest rate of just 1/10 th of one percent interest. Since September of last year, the Fed has made more than $9  trillion cumulatively in these loans. It has not announced one scintilla of information on what specific Wall Street firms have received this money or how much they individually received.\n The Fed has also made multiple loans through its Discount Window to Wall Street banks. The Fed has not released the names of these banks or how much they needed to borrow. The Fed has yet to explain how it can continuously be telling the American people that the Wall Street banks are “well capitalized” while it needs to continue to make these lender-of-last-resort loans.\n The Federal Reserve has also set up a liquidity facility to make massive foreign central bank dollar swaps to create liquidity for those central banks to buy dollar-denominated assets and help prop up markets. Last Thursday’s H.4.1 shows the dollar swap facility has a current balance of $352 billion. The facility’s balance had been as high as $449 billion as of May 27.\n According to the Government Accountability Office’s audit of the Fed that was conducted after the 2008 financial crisis, this is one of the uses of those dollar swap lines back then:\n “In October 2008, according to Federal Reserve Board staff, the Federal Reserve Board allowed the Swiss National Bank [the central bank of Switzerland] to use dollars under its swap line agreement to provide special assistance to UBS, a large Swiss banking organization. Specifically, on October 16, 2008, the Swiss National Bank announced that it would use dollars obtained through its swap line with FRBNY [Federal Reserve Bank of New York] to help fund an SPV [Special Purpose Vehicle] it would create to purchase up to $60 billion of illiquid assets from UBS.”\n UBS is a major investment bank and trading house and a major player on Wall Street. It purchased the large U.S. retail brokerage firm, PaineWebber, in 2000. The UBS Dark Pool, the equivalent of a thinly regulated stock exchange operating internally within UBS, has been one of the largest traders in Wall Street bank stocks.\n The Federal Reserve Board of Governors has put the New York Fed in charge of the bulk of these bailout programs. Its conflicts are legion. (See related articles below.) It’s time for Congress to stop the Fed from repeating its Big Lie that it’s going out of its way to be transparent and force it to cough up the names and dollars amounts of the recipients of these loans.", "posttime": "2020-06-22 23:03:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "移交,turn,美联储", "title": "4540亿美元中的3400亿美元姆努钦将移交给美联储，但下落不明", "title_en": "$340B of $454B Mnuchin Was to Turn over to the Fed Is Unaccounted For", "transed": 1, "url": "https://wallstreetonparade.com/2020/06/340-billion-of-the-454-billion-that-mnuchin-was-to-turn-over-to-the-fed-is-unaccounted-for/", "via": "", "real_tags": ["移交", "turn", "美联储"]}, {"category": "", "categoryclass": "", "imagename": "13b564ff7381912ff0be3b2bc175429d.jpeg", "infoid": 1007646, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透法兰克福/马尼拉8月23日电-Wirecard周一表示，其账户中失踪的19亿欧元(21亿美元)可能永远不存在，该公司正在考虑出售或关闭部分业务，以避免迫在眉睫的现金紧缩.。\n这家前德国股市宠儿为Visa和万事达卡(Mastercard)等公司处理支付业务，最近几天其价值蒸发了数十亿欧元，并开始在法兰克福交易，跌幅达40%。\nWirecard正忙于支撑其财务状况，并已任命投资银行Houlihan Lokey与债权人达成协议。上周五，评级机构穆迪(Moody‘s)将Wirecard的信用评级大幅下调至“垃圾”。\n在周一的一份声明中，Wirecard还撤回了2019年的财务报表，并表示正在研究削减成本，以应对这场危机。这场危机曾被誉为德国科技行业相对罕见的成功故事。\n“Wirecard的管理委员会评估.。银行信托账户余额19亿欧元很可能不存在，“它说。\nWirecard周四表示，审计师安永(EY)拒绝签署其2019年的账目，因为它无法确认信托账户中存在19亿欧元的现金余额，约占其资产负债表的四分之一。\n近年来，安永(EY)经常批准Wirecard的账户，该公司拒绝签署2019年协议，证实了毕马威(KPMG)4月份的一项外部调查发现的失败之处，随后英国“金融时报”发布了调查报告。\nWirecard的最新声明发布之前，前首席执行官马库斯·布劳恩(Markus Braun)上周五离职，由德国证券交易所前合规官詹姆斯·弗里斯(James Freis)接替。\n自从一名举报人声称该公司的成功部分归因于虚假交易网络以来，该公司一直受到密切关注。这在寻找失踪的现金时达到了顶峰，在菲律宾陷入了死胡同。\n菲律宾央行表示，似乎没有一笔资金进入该国，此前菲律宾群岛银行(BPI)和BDO Unibank表示，据称显示Wirecard在他们那里存入资金的文件是虚假的。两人都表示，Wirecard不是客户。\nBPI告诉路透社，它已经将一名助理经理停职，这名助理经理的签名出现在其中一份文件上，而BDO告诉央行，其一名营销人员似乎伪造了一份银行证书。\n周一，Pilipinas总裁Benjamin Diokno对ANC电视频道表示：“央行实际上正在进行自己的调查。”(Bangko Sentral Ng Pilipinas)行长本杰明·迪奥克诺(Benjamin Diokno)。\n总部位于慕尼黑的Wirecard被誉为金融科技在本土取得的成功，并于2018年被推入德国蓝筹股DAX指数。Mirabaud的分析师表示，其DAX成员资格现在完全不合适，应该进行审查。\n一些人担心愈演愈烈的丑闻会损害德国的声誉，联邦议院议员法比奥·德·马西(Fabio De Masi)表示，该国的金融监管机构Bafin失职。\nWirecard既是向消费者发行真实和“虚拟”支付卡的机构，也是代表商家进行收购的机构。\n该公司曾将自己定位为一个通用支付平台，定位于从数字支付的增长中获利。它还为商家和消费者推出了智能手机支付应用。", "note_en": "FRANKFURT/MANILA (Reuters) - Wirecard said on Monday that 1.9 billion euros ($2.1 billion) missing from its accounts was likely never there and it was looking at the sale or closure of parts of its business as it sought to avert a looming cash crunch.\n The former German stock market darling, which processes payments for companies including Visa and Mastercard, has seen billions of euros wiped off its value in recent days and began trading in Frankfurt down 40%.\n Wirecard is scrambling to shore up its finances and has appointed investment bank Houlihan Lokey as it seeks a deal with creditors, after seeing its credit rating slashed to ‘junk’ by rating agency Moody’s on Friday.\n In a statement on Monday, Wirecard also withdrew financial statements for 2019 and said it was examining cost cuts to address the crisis which has engulfed what was once hailed as a relatively rare success story for the German technology sector.\n “The Management Board of Wirecard assesses ... that there is a prevailing likelihood that the bank trust account balances in the amount of 1.9 billion EUR do not exist,” it said.\n Wirecard said on Thursday that auditor EY had refused to sign off its 2019 accounts as it was unable to confirm the existence of 1.9 billion euros in cash balances in trust accounts, about a quarter of its balance sheet.\n EY had regularly approved Wirecard’s accounts in recent years, and its refusal to sign off for 2019 confirmed failings found in an external investigation by KPMG in April, which in turn followed investigative reports by the Financial Times.\n  Wirecard’s latest announcement follows the exit on Friday of former chief executive Markus Braun, who was replaced by James Freis, an ex-compliance officer at Germany’s stock exchange.\n The company has been under scrutiny since a whistleblower alleged that it owed its success in part to a web of sham transactions. This culminated in a search for the missing cash, which hit a dead end in the Philippines.\n The Philippine central bank said none of the money appeared to have entered the country, after Bank of the Philippine Islands (BPI) and BDO Unibank said documents purporting to show Wirecard had deposited funds with them were false. Both said Wirecard was not a client.\n BPI told Reuters it had suspended an assistant manager whose signature appeared on one of the documents, while BDO told the central bank one of its marketing officers appeared to have fabricated a bank certificate.\n “The central bank is actually doing its own investigation,” Bangko Sentral ng Pilipinas Governor Benjamin Diokno told television channel ANC on Monday.\n Munich-based Wirecard has been lauded as a home-grown fintech success and was propelled into Germany’s blue-chip DAX index in 2018. Analysts at Mirabaud said its DAX membership was now completely inappropriate and should be reviewed.\n Some fear the growing scandal will damage Germany’s reputation and Fabio De Masi, a lawmaker in the Bundestag, said the country’s financial watchdog Bafin had failed in its duty.\n  Wirecard operates both as an issuer of real and ‘virtual’ payment cards to consumers, and as an acquirer on behalf of merchants.\n The company had marketed itself as a universal payments platform positioned to profit from the growth in digital payments. It also launched smartphone payment apps for merchants and consumers.", "posttime": "2020-06-22 22:42:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "存在,existed,wirecard", "title": "Wirecard称失踪21亿美元从来不存在，撕毁了早先的账户", "title_en": "Wirecard Says Missing $2.1 Billion Never Existed, Rips Up Earlier Accounts", "transed": 1, "url": "https://www.reuters.com/article/us-wirecard-accounts-idUSKBN23T06V", "via": "", "real_tags": ["存在", "existed", "wirecard"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常有人会提出这样的建议：HTML不应该发展成今天这样的变异应用程序运行时。文档的表示关注点与应用程序呈现不同。javascript堆栈应该是完全独立的。我强烈认为我们应该创建一个轻量级的HTML fork，它同样是以文档为中心的，并且不允许所有这些javascript的胡言乱语。一些不允许愚蠢的自定义用户界面或行为跟踪的东西。只有文本、图像、视频和链接。绘制算法将非常简单，文档加载将闪电般的快，我们相信不会有广告恶意软件。\n我决定写这篇博文，而不是直接回复，这样下次我就可以再看一遍。这里有不正确的事实假设。文档的表现关注点与应用程序呈现不同；呈现是不正确的；有很多重叠，静态文档和交互式应用程序之间有一个连续体，用例一直都在这个连续体中。不允许愚蠢的自定义用户界面或行为跟踪的东西。仅仅文字、图像、视频和链接是矛盾的；嵌入的图像、视频和链接允许大量的跟踪和自定义UI。一个更大的问题是，定义HTML的静态分支很容易，但说服Web开发人员使用它才是真正的问题所在，而这是非常困难的，而且没有人知道如何做到这一点。当然，如果您确实找到了说服Web开发人员避免您不喜欢的功能的方法，那么定义一个特定的HTML静态子集就没有多大价值了。顺便说一下，我刚刚撒了部分谎。定义HTML的静态分支很容易，但我敢肯定，每个认为现代Web已经脱轨的人都有一个略微不同的应该允许的功能列表，所以让你的整个支持者就允许的功能的具体列表达成一致将是非常困难的。(例如，表单是否在该子集中？心满意足吗？录像？动画GIF？CSS：悬停？CSS媒体查询？对于这些问题，不同的人会给出不同的答案。)。有些人认为定义HTML的静态子集将使Web开发人员和用户受益，因为我们可以为该子集构建更高效的浏览器(或浏览器模式)。作为一名前Mozilla杰出工程师，我对此表示怀疑。即使像窗口大小更改这样的基本操作也需要增量重新布局的能力。任何类型的编辑或表单都需要支持DOM更改，递增加载文档的呈现也是如此。你可以走几条捷径，但在相同的内容上，你不会轻易击败现有浏览器的性能，特别是要记住，那些浏览器已经实现了令人难以置信的优化。我看到定义的静态HTML子集唯一可能的好处是，对于选择加入该子集的文档，浏览器可以将所有这些文档放入单个沙箱子进程中，而不是将它们拆分到每个站点的不同沙箱进程中，前提是这些文档对彼此的安全风险可以忽略不计。我不认为这是静态HTML子集倡导者最关心的问题。", "note_en": "Quite often someone proposes something like this: HTML should never have grown into the mutated application runtime it is today. The presentational concerns for documents are different from application rendering. The javascript stack should have been something entirely separate. I strongly feel we should create a lightweight HTML fork that is again document-centric and doesn&#39;t allow for all of this javascript nonsense. Something that doesn&#39;t allow for stupid custom UI or behavioural tracking. Just text, images, videos, and links. The painting algorithm would be dead simple, documents would load lightning fast, and we&#39;d be confident there would be no ad malware.\nRather than reply directly, I decided to write this blog post so I can refer to it again next time this comes up. There are incorrect factual assumptions here. &#34;The presentational concerns for documents are different from application rendering&#34; is incorrect; there&#39;s a lot of overlap, and there is a continuum between static documents and interactive applications, with use-cases all the way along that continuum. &#34;Something that doesn&#39;t allow for stupid custom UI or behavioural tracking. Just text, images, videos, and links&#34; is contradictory; embedded images, videos and links allow for lots of tracking and custom UI. A bigger issue is that defining a static fork of HTML is easy, but persuading Web developers to use it is where the real problem lies, and that is immensely difficult and no-one has any good ideas for how to do it. Of course, if you do find a way to persuade Web developers to avoid features you don&#39;t like, there isn&#39;t much value in defining a specific &#34;static subset&#34; of HTML. By the way, I just partially lied. Defining a static fork of HTML is easy, but I&#39;m sure everyone who thinks the modern Web has gone off the rails has a slightly different list of features that should be allowed, so getting your entire constituency to agree on a specific list of allowed features is going to be very difficult. (E.g., are forms in that subset? contenteditable? Video? Animated GIFs? CSS :hover? CSS media queries? Different people will give different answers to these questions.) Some people believe that defining a static subset of HTML would benefit Web developers and users because we could build a much more efficient browser (or browser mode) for that subset. As a former Mozilla distinguished engineer, I&#39;m skeptical. Even something as fundamental as window size changes requires the ability to do incremental relayout. Any kind of editing or forms requires support for DOM changes, as does rendering of incrementally loaded documents. You could take a few shortcuts but you won&#39;t easily beat the performance of existing browsers on the same content, especially keeping in mind the incredibly impressive optimizations those browsers have already implemented. The only possible benefit I can see of a defined static HTML subset is that for documents opting into that subset, browsers  might be able to put all those documents into a single sandboxed child process instead of splitting them into a different sandboxed process per site, on the assumption that these documents are a negligible security risk to each other. I don&#39;t think this is at the forefront of the minds of advocates for a static HTML subset.", "posttime": "2020-06-22 22:23:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "派生,html,文档", "title": "为什么将HTML派生为静态语言没有意义", "title_en": "Why Forking HTML into a Static Language Doesn't Make Sense", "transed": 1, "url": "https://robert.ocallahan.org/2020/05/why-forking-html-into-static-language.html", "via": "", "real_tags": ["派生", "html", "文档"]}, {"category": "", "categoryclass": "", "imagename": "46b566a8548fd684730b4028949183ff.jpg", "infoid": 1007644, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "接收日期：2020年5月25日/修订日期：2020年6月17日/接受日期：2020年6月18日/发布日期：2020年6月20日。\n在世界许多地区的前瞻性队列研究中，习惯喝咖啡与较低的疾病风险(如2型糖尿病、慢性肝病、某些癌症类型或降低全原因死亡率)之间的关联已得到证实。其分子机制尚不清楚。咖啡成分清除自由基和抗炎的活性太弱，无法解释这些影响。我们在这里争辩说，咖啡作为植物性食物与许多蔬菜和水果具有相似的有益特性。最近的研究已经确定了咖啡、蔬菜和水果共同的促进健康的机制，即激活适应性细胞反应，其特征是参与细胞保护的蛋白质上调，特别是抗氧化酶、解毒酶和修复酶。这种反应的关键是酚类植物化学物质激活Nrf2(核因子红系2相关因子-2)系统，诱导细胞防御基因的表达。咖啡在这方面起着主导作用，因为在发达国家，咖啡是酚酸和多酚的主要膳食来源。一种可能的支持作用可能是咖啡中未消化的益生菌成分对肠道微生物区系的调节，但可用的数据仍然很少。我们得出结论，咖啡促进健康的途径与其他蔬菜和水果相似。咖啡豆可以被视为健康的蔬菜食品和膳食酚类植物化学物质的主要供应商。查看全文。\n关键词：咖啡；植物化学物质；咖啡因；糖尿病；dna损伤；抗氧化剂；nrf2；微生物区系咖啡；植物化学物质；咖啡因；糖尿病；dna损伤；抗氧化剂；nrf2；微生物区系。\n►显示数字", "note_en": "Received: 25 May 2020 / Revised: 17 June 2020 / Accepted: 18 June 2020 / Published: 20 June 2020\n The association of habitual coffee consumption with a lower risk of diseases, like type 2 diabetes mellitus, chronic liver disease, certain cancer types, or with reduced all-cause mortality, has been confirmed in prospective cohort studies in many regions of the world. The molecular mechanism is still unresolved. The radical-scavenging and anti-inflammatory activity of coffee constituents is too weak to account for such effects. We argue here that coffee as a plant food has similar beneficial properties to many vegetables and fruits. Recent studies have identified a health promoting mechanism common to coffee, vegetables and fruits, i.e., the activation of an adaptive cellular response characterized by the upregulation of proteins involved in cell protection, notably antioxidant, detoxifying and repair enzymes. Key to this response is the activation of the Nrf2 (Nuclear factor erythroid 2-related factor-2) system by phenolic phytochemicals, which induces the expression of cell defense genes. Coffee plays a dominant role in that regard because it is the major dietary source of phenolic acids and polyphenols in the developed world. A possible supportive action may be the modulation of the gut microbiota by non-digested prebiotic constituents of coffee, but the available data are still scarce. We conclude that coffee employs similar pathways of promoting health as assumed for other vegetables and fruits. Coffee beans may be viewed as healthy vegetable food and a main supplier of dietary phenolic phytochemicals. View Full-Text\n Keywords:  coffee; phytochemicals; caffeine; diabetes; DNA damage; antioxidant; Nrf2; microbiota   coffee;  phytochemicals;  caffeine;  diabetes;  DNA damage;  antioxidant;  Nrf2;  microbiota\n  ► ▼Show Figures", "posttime": "2020-06-22 22:23:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "咖啡,effects", "title": "咖啡对健康的影响", "title_en": "Health Effects of Coffee", "transed": 1, "url": "https://www.mdpi.com/2072-6643/12/6/1842", "via": "", "real_tags": ["咖啡", "effects"]}, {"category": "", "categoryclass": "", "imagename": "b244013f8dadcbe1ee009c650489722d.png", "infoid": 1007643, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6月19日周五深夜，苹果应用商店审核委员会批准了上周搁置的嘿iOS应用程序的漏洞修复，这让我们大吃一惊：\n(他们所指的推文是当晚我们刚刚延长两个小时的橄榄枝推文)。\n今天早上的第一件事是，我们向我们的客户发布了新批准的1.0.2错误修复更新。这对苹果来说是一场胜利，对我们来说也是一场胜利，对我们的客户来说也是一场胜利。\n当然，1.0.2不是我们打算发布到App Store的最后一个版本。我们希望继续发布更新，并尽最大努力将iOS版的嘿App做到最好。但在我们被明确允许这么做之前，苹果要求我们做一些改变。\n苹果负责全球营销的高级副总裁菲尔·席勒(Phil Schiller)告诉我们，他希望看到我们做出什么样的改变。他的主要反对意见是“你下载了这款应用程序，但它不起作用，这不是我们想在商店里看到的。”\n好吧。我们认为我们遵循了苹果ʼ对多平台软件即服务产品的不成文规定：没有注册，没有链接，没有提到在哪里注册。今天，App Store中的许多应用程序都是这样工作的，包括Netflix、Google、Salesforce和任天堂(Nintendo)长期批准的应用程序。\n但席勒随后表示，“嘿本可以走的一条路……是在App Store上提供免费或付费版本的应用程序，带有基本的电子邮件阅读功能，然后在自己的网站上单独提供升级后的电子邮件服务，与iOS上的嘿应用程序配合使用。”因此，我们开始认真工作，并在周末工作，以便在周一早上获得苹果办公桌上的最新消息。我们的团队很好地实现了席勒要求的产品更改，今天早上的第一件事就是，在我们将1.0.2交付给客户之后，我们向App Store提交了1.0.3以供批准。\n这个新版本为iOS应用程序引入了一个新的免费选项。现在，用户可以直接在应用内注册一个免费的、临时的、随机的@hey.com电子邮件地址，有效期为14天。把它想象成你在旅行时买的一张临时SIM卡。或者当你不想给出你的真实电子邮件地址时，比如一个短期的“待售”列表，就像Craigslist那样。\n我们还加快了我们的多用户嘿for work服务的速度，在这种服务中，公司付钱，但员工不付钱。这使得嘿与Basecamp以及其他几十个在App Store允许了十年的高调多平台企业服务保持一致。我们刚刚完成了多家公司的入职，我们所有的Basecamp公司电子邮件都通过嘿运行，而且已经有数千家企业加入了嘿的工作等待名单。嘿，工作用的是和其他人一样的iOS应用。\n因此，现在我们提供了这个新的免费选项，以及多用户嘿for Work-所有这些都在同一个iOS应用程序中。我们相信，这些改进将满足席勒对用户体验和商业模式的担忧。希望这也能为像我们这样的其他多平台SaaS服务铺平一条可预测的道路。\n我们和苹果一样关心用户体验，这是一个很好的折衷方案。苹果的iOS用户可以注册新的免费版本的嘿，我们可以继续对所有客户给予同样的特殊照顾，无论平台是什么。此外，iOS客户可以使用一项流行的新电子邮件服务，该服务包含我们承诺追求的所有错误修复和新功能，而不必支付比其他平台客户更高的价格。\n菲尔，我们为你留出了一个令人惊叹的@hey.com地址。终身免费，我们送给您的礼物。让我知道。", "note_en": "Late Friday night, on June 19th, Apple’s App Store Review Board surprised us by approving the pending bug fixes to the HEY iOS app that were held up all last week:\n  (The tweets they refer to were  the olive-branch tweets we extended just two hours earlier that night)\n  First thing this morning, we released the newly-approved 1.0.2 bug-fix update to our customers. A win for Apple, a win for us, and a win for our customers.\n But of course 1.0.2 isn’t the last version we intend to ship to the App Store. We want to continue shipping updates, and putting in our best effort to make the HEY App for iOS the best it can be. But before we’re definitively allowed to do that, Apple asked us make some changes.\n Phil Schiller, Apple’s Senior Vice President of Worldwide Marketing,  told us the kind of changes he’d love to see us make. His primary objection \twas “You download the app and it doesn’t work, that’s not what we want on the store.”\n Okay. We thought we were following Appleʼs unwritten rules for multi-platform SaaS products: No signups, no links, no mentions of where to sign up.  Plenty of applications in the App Store work exactly like this today, including long-approved apps from Netflix, Google, Salesforce, and Nintendo.\n But  then Schiller said “One way that HEY could have gone...is to offer a free or paid version of the app with basic email reading features on the App Store, then separately offered an upgraded email service that worked with the Hey app on iOS on its own website.” So we got down to it, and worked the weekend to get an update on Apple’s desk Monday morning. Our team did a great job implementing the product changes that Schiller asked for, and first thing this morning, right after we shipped 1.0.2 to our customers, we submitted 1.0.3 to the App Store for approval.\n This new version introduces a new free option for the iOS app. Now users can sign up directly in-app for a free, temporary, randomized @hey.com email address that works for 14 days. Think of it like a temporary SIM card you buy when traveling. Or for when you don’t want to give out your real email address, like a short term “for sale” listing, like Craigslist does it.\n We’ve also accelerated our multi-user HEY for Work offering where the company pays but the employees don’t. This brings HEY in line with Basecamp, and dozens of other high profile multi-platform enterprise offerings that have been permitted in the App Store for a decade. We just completed onboarding multiple companies, we’re running all our Basecamp company email through HEY, and thousands of businesses have joined  the HEY for Work waitlist already. HEY for Work uses the same iOS app as everyone else.\n So now we offer this new free option, and the multi-user HEY for Work — all in the same iOS app. We’re confident these improvements will satisfy Schiller’s concerns about both the user experience and business model. Hopefully this paves a predictable path for other multi-platform SaaS services like ours as well.\n We care as much about the user experience as Apple, and this is a good compromise. Apple’s iOS customers can sign up for a new free version of HEY, and we can continue to  take the same exceptional care of all our customers, regardless of platform. Plus, iOS customers get access to a popular new email service with all the bug fixes and new features we’ve committed to pursue, without having to pay higher prices than customers on other platforms.\n And Phil, we set aside an amazing @hey.com address for you. Free for life, our gift to you. Lemme know.", "posttime": "2020-06-22 22:22:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,前进,hey,服务", "title": "苹果，嘿，还有前进的道路", "title_en": "Apple, Hey, and the Path Forward", "transed": 1, "url": "https://hey.com/apple/path/", "via": "", "real_tags": ["苹果", "apple", "前进", "hey", "服务"]}, {"category": "", "categoryclass": "", "imagename": "ff03be275fa4479793949fd507723c35.jpeg", "infoid": 1007642, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个实现比用Python编写的竞争对手快一到两个数量级，能够在带有GPU的标准台式计算机上解决琐碎的游戏。\nDeepMind的AlphaZero算法除了在国际象棋和围棋等游戏中达到超人水平这一广为人知的成功之外，还展示了一种更通用的方法，将学习和搜索结合起来，有效地探索更大的组合空间。我们相信，这种方法论在许多不同的研究领域都会有令人兴奋的应用。\n由于AlphaZero非常耗费资源，成功的开源实现(如Leela Zero)都是用低级语言(如C++)编写的，并针对高度分布式的计算环境进行了优化，这使得学生、研究人员和黑客很难访问它们。\n这个项目的动机是提供一个AlphaZero的实现，它足够简单，可以广泛访问，同时也足够强大和快速，可以在有限的计算资源上进行有意义的实验。我们发现Julia语言在实现这一目标方面发挥了重要作用。\nGit克隆https://github.com/jonathan-laurent/AlphaZero.jl.gitcd AlphaZero.jljulia--项目-e&34；导入包；Pkg.instantiate()&#34；jia--项目--color=yes脚本/alphazero.jl--游戏连接-4系列。\n在配备英特尔酷睿i5 9600K处理器和8 GB nVidia RTX2070 GPU的台式计算机上，每次培训迭代需要一到两个小时。我们在下面绘制了AlphaZero代理相对于两条基线(一条普通的MCTS基线和一条使用手工设计的启发式在深度5计划的minmax代理)的胜率演变图：\n注意，AlphaZero代理在培训期间不会接触到基线，完全是通过自我发挥学习的，没有任何形式的监督或事先的知识。\n我们还评估了神经网络单独在相同基线下的性能。我们不是将其插入到MCTS中，而是在每个状态下播放分配有最高先验概率的操作：\n不出所料，该网络一开始无法赢得任何一场比赛，然而，尽管不能执行任何搜索，它最终仍明显强于minmax基线。\n有关使用AlphaZero.jl培训Connect 4代理的更多信息，请参阅我们的完整教程。\n非常欢迎对AlphaZero.jl的贡献。在我们的投稿指南中有很多投稿的想法。请不要犹豫，打开一期Github来分享任何想法、反馈或建议。\n本材料基于美国空军和美国国防部高级研究计划局(DARPA)根据第号合同支持的工作。FA8750-18-C-0092。本材料中表达的任何观点、发现和结论或建议均为作者的观点，不一定反映美国空军和DARPA的观点。", "note_en": "Being between one and two orders of magnitude faster than competingalternatives written in Python, this implementation enables to solvenontrivial games on a standard desktop computer with a GPU.\n  Beyond its much publicized success in attaining superhuman level at gamessuch as Chess and Go, DeepMind&#39;s AlphaZero algorithm illustrates a moregeneral methodology of combining learning and search to explore largecombinatorial spaces effectively. We believe that this methodology canhave exciting applications in many different research areas.\n  Because AlphaZero is resource-hungry, successful open-sourceimplementations (such as  Leela Zero)are written in low-level languages (such as C++) and optimized for highlydistributed computing environments.This makes them hardly accessible for students, researchers and hackers.\n The motivation for this project is to provide an implementation ofAlphaZero that is simple enough to be widely accessible, while also beingsufficiently powerful and fast to enable meaningful experiments on limitedcomputing resources.We found the  Julia language to be instrumental in achieving this goal.\n   git clone https://github.com/jonathan-laurent/AlphaZero.jl.gitcd AlphaZero.jljulia --project -e &#34;import Pkg; Pkg.instantiate()&#34;julia --project --color=yes scripts/alphazero.jl --game connect-four train\n   Each training iteration takes between one and two hours on a desktopcomputer with an Intel Core i5 9600K processor and an 8GB Nvidia RTX2070 GPU. We plot below the evolution of the win rate of our AlphaZero agent against two baselines (a vanilla MCTS baseline and a minmax agent that plans at depth 5 using a handcrafted heuristic):\n    Note that the AlphaZero agent is not exposed to the baselines during training andlearns purely from self-play, without any form of supervision or prior knowledge.\n We also evaluate the performances of the neural network alone against the samebaselines. Instead of plugging it into MCTS, we play the action that isassigned the highest prior probability at each state:\n    Unsurprisingly, the network alone is initially unable to win a single game.However, it ends up significantly stronger than the minmax baseline despite notbeing able to perform any search.\n For more information on training a Connect Four agent using AlphaZero.jl, see our full  tutorial.\n    Contributions to AlphaZero.jl are most welcome. Many contribution ideas are available in our  contribution guide.Please do not hesitate to open a Github issue to shareany idea, feedback or suggestion.\n  This material is based upon work supported by the United States Air Force andDARPA under Contract No. FA8750-18-C-0092. Any opinions, findings andconclusions or recommendations expressed in this material are those of theauthor(s) and do not necessarily reflect the views of the United StatesAir Force and DARPA.", "posttime": "2020-06-22 22:22:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,julia,alphazero,implementation", "title": "DeepMind的AlphaZero算法在Julia中的快速实现", "title_en": "Fast implementation of DeepMind's AlphaZero algorithm in Julia", "transed": 1, "url": "https://github.com/jonathan-laurent/AlphaZero.jl", "via": "", "real_tags": ["算法", "julia", "alphazero"]}, {"category": "", "categoryclass": "", "imagename": "db15d0cd49be4cb18e8a6d2c617e8a4a.jpg", "infoid": 1007641, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着呆在家里的订单减少，城市重新开业，许多医生和医院管理人员呼吁迅速将医疗保健恢复到大流行前的水平。几个月来，常规护理一直被推迟。选择性程序-赚钱的大手笔-被停止，这样医院就可以将资源转移到治疗新冠肺炎患者上。常规的诊所就诊被取消或取而代之的是在线会议。这给医院和诊所造成了严重的经济损失。医疗诊所已经关门了。医院被迫让员工休假或削减工资。\n另一方面，大多数患者，至少是那些慢性病稳定的患者，似乎都做得不错。在最近的一项调查中，只有十分之一的受访者表示，他们的健康或家庭成员的健康因延误治疗而恶化。86%的人表示，他们的健康状况大致保持不变。\n诚然，推迟医疗对一些非新冠肺炎疾病的患者的健康造成了可怕的后果，比如那些新诊断的癌症患者因为门诊被取消而没有得到治疗，或者是因为患者出于对感染冠状病毒的恐惧而避免去医院。在危机期间，纽约等大城市的死亡人数激增，几乎肯定包括这样的患者。\n尽管如此，绝大多数患者的情况似乎比大多数医生预期的要好。可能需要数年时间才能理解其中的原因。也许病人可以通过采取健康的行为来减轻延误护理的危害，比如减少吸烟和多锻炼。也许压力的巨大增加被其他事情所抵消，比如花更多的时间与所爱的人在一起。\n然而，还有一个更令人不安的解释需要考虑：也许美国人不需要他们的医生习惯提供的医疗量。\n众所周知，美国大量的医疗保健是浪费的，占医疗保健预算总额的数千亿美元。造成医疗浪费的原因有很多：医生试图避免诉讼的“防御性”药物；医生和患者不愿接受诊断的不确定性(这会导致更多的检查)；美国医生和医院收取的过高价格(至少与其他国家的收费相比是如此)；对哪些治疗有效缺乏共识；以及普遍认为更新、更昂贵的技术总是更好的信念。“。\n造成医疗浪费的最重要因素之一是某些地区的人均医疗服务供给过多。例如，在专科医生密集的迈阿密-戴德县，医疗保险的人均支出是新墨西哥州圣达菲的两倍多，这主要是因为那里的人均医生服务利用率更高。可悲的是，更多的关怀并不总是带来更好的结果。\n如果有益的常规护理在大流行封锁的过去几个月里减少了，那么它的恶性对应的不必要的护理可能也是如此。如果是这样的话，这对我们应该如何重新开放我们的医疗保健系统有一定的影响。医生和医院将希望加强护理，以弥补收入的损失。但这并不能满足我们病人的需要。\n初创公司应该重新承诺促进有益的护理并消除不必要的护理。大多数医生都认识到这一区别的重要性，即使我们并不总是采取行动。在几年前的一项调查中，三分之二的美国医生承认15%到30%的医疗保健可能是不必要的。\n医学会已经列出了必要的和最好避免的程序清单。后者包括大多数下腰痛的核磁共振扫描和没有心脏病迹象的核负荷测试。随着医院和诊所对非新冠肺炎的护理重新开放，这样的名单应该得到更广泛的宣传。\n病人也扮演着重要的角色。研究表明，在一些专科中，高达20%的手术是不必要的。如果你的手术是因为大流行而推迟的，那么有必要和你的医生谈谈是否还需要做手术。尽管今天的疾病很复杂，但有时疾病确实会自行好转。在某些情况下，预定的手术从一开始就没有必要。\n许多机构正在利用我们国家历史上的这段艰难时期做出改变。医疗保健系统也应该这样做。这场大流行让我们看到了一个世界，在这个世界上，我们的医疗保健系统一切照旧被颠覆了。它还提供了一个以更健康和更具财务责任感的方式重新启动的机会。条件反射地回到现状可能对我们的底线有好处，但对我们的病人没有很好的服务。\n桑迪普·焦哈尔(@sjauhar)是一位心脏病专家，也是一位观点撰稿人，最近出版了“心脏：历史”(Heart：a History)一书。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "As stay-at-home orders ease and cities reopen for business, many doctors and hospital administrators are calling for a quick return of health care to pre-pandemic levels. For months now, routine care has been postponed. Elective procedures — big moneymakers — were halted so that hospitals could divert resources to treating Covid-19 patients. Routine clinic visits were canceled or replaced by online sessions. This has resulted in grievous financial losses for hospitals and clinics. Medical practices have closed. Hospitals have been forced to furlough employees or cut pay.\n Most patients, on the other hand, at least those with stable chronic conditions, seem to have done OK. In a recent  survey, only one in 10 respondents said their health or a family member’s health had worsened as a result of delayed care. Eighty-six percent said their health had stayed about the same.\n Admittedly, postponing health care had terrible health consequences for some patients with non-Covid-19 illnesses, such as those with newly diagnosed cancers that went untreated because outpatient visits were canceled, or because patients avoided going to the hospital out of fear of contracting the coronavirus. The spike in deaths in major cities like New York during the crisis almost certainly includes such patients.\n Still, a vast majority of patients seem to have fared better than what most doctors expected. It will probably take years to understand why. Perhaps patients mitigated the harm of delayed care by adopting healthful behaviors, such as smoking less and exercising more. Perhaps the huge increases in stress were balanced out by other things, such as spending more time with loved ones.\n However, there is a more troubling explanation to consider: Perhaps Americans don’t require the volume of care that their doctors are used to providing.\n It is well recognized that a substantial amount of health care in America is wasteful, accounting for hundreds of billions of dollars of the total health care budget. Wasteful care is driven by many forces: “defensive” medicine by doctors trying to avoid lawsuits; a reluctance on the part of doctors and patients to accept diagnostic uncertainty (which leads to more tests); the exorbitant prices that American doctors and hospitals charge, at least compared to what is charged in other countries; a lack of consensus about which treatments are effective; and the pervasive belief that newer, more expensive technology is always better.\n One of the most significant factors in wasteful health care is having too much supply of health care per capita in certain areas. In specialist-heavy Miami-Dade County, for example, Medicare  spends more than twice per person what it spends in Santa Fe, N.M., largely because there is more per capita utilization of doctors’ services. Sadly, more care doesn’t always result in better outcomes.\n If beneficial routine care dropped during the past few months of the pandemic lockdown, so perhaps did its malignant counterpart, unnecessary care. If so, this has implications for how we should reopen our health care system. Doctors and hospitals will want to ramp up care to make up for lost revenue. But this will not serve our patients’ needs.\n The start-up should begin with a renewed commitment to promoting beneficial care and eliminating unnecessary care. Most doctors recognize the importance of this distinction, even if we don’t always act on it. In a survey a few years ago, two-thirds of doctors in the United States  admitted that between 15 percent and 30 percent of health care is probably unnecessary.\n Medical societies already produce lists of procedures that are essential and those that are better avoided. The latter  include M.R.I. scans for most lower-back pain and nuclear stress tests when there are no signs of heart disease. As hospitals and clinics reopen for non-Covid-19 care, such lists should be more widely publicized.\n Patients have an important role to play, too. Studies  suggest that up to 20 percent of surgeries in some specialties are unnecessary. If your surgery was postponed because of the pandemic, it is worth having a conversation with your doctor about whether it is still needed. Despite the complexity of disease today, ailments sometimes do get better by themselves. And in some cases, scheduled surgeries weren’t necessary in the first place.\n Many institutions are using this difficult time in our nation’s history to make changes. The health care system should do the same. The pandemic has given us a glimpse of a world in which business as usual in our health care system was upended. It has also provided an opportunity to start up again in a healthier and more financially responsible way. Reflexively returning to the status quo may be good for our bottom line, but it won’t serve our patients well.\n Sandeep Jauhar ( @sjauhar) is a cardiologist, a contributing Opinion writer and the author, most recently, of “Heart: A History.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-06-22 22:21:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看起来,stopped,医生", "title": "人们已经不去看医生了，大多数人看起来都很好。", "title_en": "People have stopped going to the doctor and most seem fine", "transed": 1, "url": "https://www.nytimes.com/2020/06/22/opinion/coronavirus-reopen-hospitals.html", "via": "", "real_tags": ["看起来", "stopped", "医生"]}, {"category": "", "categoryclass": "", "imagename": "a66e167dc1e6a36f3e8496da07d3d660.jpg", "infoid": 1007640, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NVIDIA、英特尔和AMD已经宣布支持微软的新努力，将图形处理器支持引入用于Linux的Windows10Windows子系统，以增强机器学习培训。\n周三，在微软重新组织的测试结构下，Windows10版本20150的开发频道预览版提供了图形处理器对无线SL的支持，这使得它可以测试不与未来特定功能版本捆绑在一起的Windows10版本。\n几周前，微软在Build 2020上宣布了即将推出的GPU对WSL的支持，以及对运行Linux GUI应用程序的支持。针对WSL的GPU访问的这一举措旨在将在WSL2中运行的应用程序的性能提升到与Windows上运行的应用程序相当的水平。\n20150更新包括对NVIDIA的CUDA并行计算平台和GPU的支持，以及来自AMD和英特尔的GPU。它还支持DirectML(直接机器学习)，即微软的Windows10API，用于硬件加速的机器学习。\n在Build 2020上，微软透露，它一直在使用其DirectX(Direct 3D 12/D3D12)图形API，为运行在WSL2上的基于Linux的机器学习工作负载带来GPU硬件加速。它为WSL2&#39；的Linux内核创建了一个定制的基于DirectX的Linux GPU内核驱动程序--dxgkrnl Linux版，该驱动程序可以与微软的Hyper-V一起使用。\n以前，GPU虚拟化可用于在虚拟机或容器内运行的Windows，但不能用于Linux客户。\n微软认为NVIDIA的CUDA平台对于加强WSL机器学习培训非常重要，两家公司已经推出了针对WSL 2的CUDA预览版，其中包括对关键机器学习工具的支持，比如Facebook的PyTorch和谷歌的TensorFlow。\n即使在使用小数据集的情况下，训练ML模型也是一项耗时的计算任务。Windows AI平台团队的项目经理Clarke Rahrig解释说，为了加快培训速度，其中许多工具使用NVIDIA的CUDA作为GPU硬件加速的优化路径，使数据科学家能够在NVIDIA GPU上硬件加速他们的培训脚本。\nWindows对NVIDIA CUDA的支持已存在多年。然而，存在各种仅在本地Linux环境中运行CUDA计算应用程序。为了支持与身处其中的专业数据科学家会面，我们将在WSL2中增加对CUDA的支持。\n微软还发布了带有DirectML的TensorFlow预览版，并计划在几个月内将其开源。AMD、英特尔和NVIDIA也发布了支持WSL上的DirectML TensorFlow软件包的预览驱动程序。\nAMD用于WSL GPU加速的驱动程序与其配备Vega显卡的Radeon和Ryzen处理器兼容。英特尔指出，其WSL驱动程序只在Ubuntu 18.04和Ubuntu 20.04上验证过。\n注册后，即表示您同意使用条款并承认隐私政策中概述的数据做法。\n您还可以免费订阅ZDNet的今日技术更新和ZDNet公告时事通讯。您可以随时取消订阅这些时事通讯。\n您同意接收来自CBS系列公司的更新、提醒和促销信息，包括ZDNet的今日技术更新和ZDNet公告时事通讯。你可以随时退订。\n通过注册，您同意接收您可以随时取消订阅的选定时事通讯。您也同意使用条款，并承认我们的隐私政策中概述的数据收集和使用做法。\n基准测试表明，编程语言Julia可能是使用CSV格式文件进行大数据分析的最佳选择。\n微软自1.0版以来的第一个Windows终端预览版包括许多新的设置和功能。\n该公司由SAP所有，的目标是精简通过允许个人自我报告其新冠肺炎的身份和匿名通知已经在接触中..。\n云计算风起云涌，随之而来的是人们对微服务和站点可靠性工程的兴趣。然而，无服务器计算仍然是一个悬而未决的问题。\n不幸的是，调查显示，大量的IT时间都花在了消防上。DevOps来营救吗？\n我编写WordPress插件，而不是Mac应用程序，但我使用Mac来做这件事。这些是我的工具。\nGitHub表示，它开源了其内部的皮棉工具GitHub Super Linter，以清理代码。\nMozilla VPN将退出测试版今年夏天。未来的计划包括推出一项Mac客户端。目前仅在Windows上可用，Android、iOS、和Firefox扩展。..。", "note_en": "Nvidia, Intel and AMD have announced their support for Microsoft&#39;s new effort to bring graphics processor support to the Windows 10 Windows Subsystem for Linux to enhance machine-learning training.\n GPU support for WSL  arrived on Wednesday in the Dev Channel preview of Windows 10 build 20150 under Microsoft&#39;s reorganized testing structure, which lets it test Windows 10 builds that aren&#39;t tied to a specific future feature release.\n    Microsoft announced  upcoming GPU support for WSL a few weeks ago at Build 2020, along with support for running Linux GUI apps. The move on GPU access for WSL is intended to bring the performance of applications running in WSL2 up to par with those running on Windows.\n     The 20150 update includes support for Nvidia&#39;s CUDA parallel computing platform and GPUs, as well as GPUs from AMD and Intel. It also supports  DirectML (Direct Machine Learning), Microsoft&#39;s Windows 10 API for hardware-accelerated machine learning.\n At Build 2020, Microsoft revealed it has been using its DirectX (Direct 3D 12/D3D12) APIs for graphics to bring GPU hardware acceleration to Linux-based machine-learning workloads running on WSL2. It created a custom DirectX-based Linux GPU kernel driver – the dxgkrnl Linux Edition – for WSL2&#39;s Linux kernel, which works with Microsoft&#39;s Hyper-V.\n   Previously GPU virtualization was available to Windows running inside a VM or container, but not Linux guests.\n Microsoft sees Nvidia&#39;s CUDA platform as important for enhancing machine-learning training on WSL and the pair have launched a  preview of CUDA for WSL 2, which includes support for key machine-learning tools like Facebook&#39;s PyTorch and Google&#39;s TensorFlow .\n &#34;Training ML models is a time-consuming computational task even when using small datasets. To speed up training, many of these tools use Nvidia&#39;s CUDA as the optimized path for GPU hardware acceleration, enabling data scientists to hardware-accelerate their training scripts on NVIDIA GPUs,&#34; explained  Clarke Rahrig, a program manager on the Windows AI platform team.\n &#34;Nvidia CUDA support has been present on Windows for years. However, there is a variety of CUDA compute applications that only run in a native Linux environment. In support of meeting professional data scientists where they&#39;re at we&#39;re adding support for CUDA inside WSL 2.&#34;\n  Microsoft has also released a  preview of TensorFlow with a DirectML, which it plans to open-source in a few months. AMD, Intel and Nvidia have also released preview drivers that support the DirectML TensorFlow package on WSL.\n AMD&#39;s driver for WSL GPU acceleration is compatible with its Radeon and Ryzen processors with Vega graphics. Intel  notes that its WSL driver has only been validated on Ubuntu 18.04 and Ubuntu 20.04.\n  By registering, you agree to the  Terms of Use and acknowledge the data practices outlined in the  Privacy Policy.\n  You will also receive a complimentary subscription to the ZDNet&#39;s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe from these newsletters at any time.\n         You agree to receive updates, alerts, and promotions from the CBS family of companies - including ZDNet’s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe at any time.\n      By signing up, you agree to receive the selected newsletter(s) which you may unsubscribe from at any time. You also agree to the  Terms of Use and acknowledge the data collection and usage practices outlined in our  Privacy Policy.\n       Benchmarks suggest programming language Julia may be the best choice for big-data analysis using CSV format files.\n  Microsoft&#39;s first preview of Windows Terminal since version 1.0 includes a number of new settings and features.\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompany,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\towned\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSAP,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taiming\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstreamline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontact\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttracing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tallowing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tindividuals\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tself-report\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttheir\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCOVID-19\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstatus\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tanonymously\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnotify\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpeople\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontact\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Cloud surges, and with it, interest in microservices and Site Reliability Engineering. However, serverless computing remains an open question.\n  Unfortunately, a good deal of IT time is spent firefighting, survey shows. DevOps to the rescue?\n  I code WordPress plugins, not Mac apps, but I use the Mac to do it. These are my tools.\n  GitHub says it&#39;s open-sourcing its in-house linting tool, the GitHub Super Linter, to clean up code.\n  Mozilla\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVPN\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsummer.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFuture\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplans\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinclude\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlaunching\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMac\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tclient.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCurrently\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tavailable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndroid,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tiOS,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFirefox\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\textension.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-06-22 22:03:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,程序,windows,nvidia,英特尔", "title": "Windows 10 Linux子系统：借助英特尔、AMD、NVIDIA驱动程序实现GPU加速", "title_en": "Windows 10 Linux Subsystem: You Get GPU Acceleration -- With Intel, AMD, Nvidia Drivers", "transed": 1, "url": "https://www.zdnet.com/article/windows-10-linux-subsystem-you-get-gpu-acceleration-with-intel-amd-nvidia-drivers/", "via": "", "real_tags": ["linux", "程序", "windows", "nvidia", "英特尔"]}, {"category": "", "categoryclass": "", "imagename": "c27f8ed25b977a1a829021bc9b2ae392.jpg", "infoid": 1007639, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，当你在https://linus.ting.com/注册时，可以额外获得25美元的Ting信用额度。MacBook Air 2020真的是一款炙手可热的产品。很快就会是一个很酷的DU..。", "note_en": "Receive an additional $25 credit for Ting today when you sign up at https://linus.ting.com/ The MacBook Air 2020 is a real hot boi... soon it'll be a cool du...", "posttime": "2020-06-22 21:27:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macbook,苹果,apple,macbook-air,2020", "title": "苹果在2020 MacBook Air中忘记连接风扇和CPU散热器", "title_en": "Apple forgot to connect the fan and CPU heatsink in 2020 MacBook Air", "transed": 1, "url": "https://www.youtube.com/watch?v=MlOPPuNv4Ec", "via": "", "real_tags": ["macbook", "苹果", "apple", "2020"]}, {"category": "", "categoryclass": "", "imagename": "e47b617c57abff15662c1c8870cbe8b8.jpg", "infoid": 1007638, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，有报道称发生了一起非常奇怪的公司丑闻：联邦当局指控几名前eBay公司安全员工参与了一场针对一名博客作者的网络跟踪运动，这场运动涉及Twitter骚扰和将昆虫邮寄到她的家。现在，当时领导公司的eBay前首席执行官德文·维尼格告诉Recode，本周他听到竞选活动的细节感到震惊，他对此“没有方向”，也没有“默许”。\n但多名前eBay内部人士告诉Recode，这位eBay前首席执行官有时对有问题的新闻网站的报道感到非常沮丧，以至于他在内部多次提出eBay应该创建自己的竞争对手出版物的想法。\n维尼格在一份声明中告诉Recode：“周一，我和其他所有人一起阅读了指控，感到震惊和愤怒。”“我必须重申，一项独立调查证实，我与据称发生的活动没有任何关系，也不知道这些活动的发生，这一点对我来说很重要。没有方向，没有知识，没有私人理解，没有默许。永远不会。“。\n尽管如此，eBay的安全团队据称对针对这位博主和她的丈夫执行这样的行动感到放心，这一事实表明，领导团队充其量也只是有问题的盲点。\n周一，马萨诸塞州的美国检察官办公室披露了一起针对六名前eBay员工的案件，他们涉嫌对运营EcommerceBytes的夫妻团队发起了一场“咄咄逼人的网络跟踪运动”。EcommerceBytes是一家报道面向在eBay和亚马逊上销售的在线商家的商业新闻的公司。该网站和一些在文章下面发表评论的读者经常批评维尼格领导下的eBay，有时还批评维尼格本人。\n当局指控这些前eBay员工从事了广泛的恶意活动，包括给他们送去“一个葬礼花圈，一本关于在失去配偶后幸存下来的书，以及色情作品--其中最后一件是寄给时事通讯的出版商，但寄到了他邻居的家里。”由前eBay安全负责人詹姆斯·鲍尔(James Baugh)领导的该小组也对这对夫妇进行了监视，并考虑闯入他们的车库，在他们的车辆上安装GPS跟踪设备。\n在法庭文件中，短信副本显示，韦尼格两次指示他的公关主管史蒂夫·怀默(Steve Wmer)“拿下她”，他指的是EcommerceBytes的所有者兼作家艾娜·斯坦纳(Ina Steiner)。周四，维尼格在一份声明中告诉Recode，这些文本“在一些媒体报道中被严重曲解和完全断章取义”。\n韦尼格在声明中说：“我当时是在和一名公关高管即兴发言，谈到我希望在我们的公关努力中更加积极；我做梦也想不到，后来可能会有人把这种沟通与马萨诸塞州起诉书中提到的活动类型联系起来。”\n维尼格的声明补充道：“我对这对不得不忍受这些猥亵行为的夫妇表示诚挚的歉意。任何人都不应该经历这种情况，特别是作为一名记者。所发生的事情并不能代表我花了8年时间打造的公司文化，也不能代表我在那里认识的员工。\n法庭文件显示，eBay的公关主管Wmer聘请了一家咨询公司，该公司“准备了一份文件，其中包括一项建议，即eBay推广对公司友好的内容，这将降低时事通讯在搜索引擎结果中的帖子。”这样的行动可以被视为一种相当良性的公关策略。但Wmer也发来了带有攻击性语气的短信，比如：“我们要粉碎这位女士。”\n法庭文件还包括Wmer和安全主管Baugh之间的一次交流，在交流中，Baugh提到了与EcommerceBytes夫妇有关的一个未指明的“B计划”。Wmer表示愿意在内部管理任何后果，但这些信息并不表明Wmer对“B计划”的含义有任何了解。\n记者联系到Wmer请其置评，Wmer告诉Recode，“我永远不会宽恕或参与任何这样的活动。”\neBay表示，它进行了一项内部调查，没有发现任何证据表明韦尼格指挥或对骚扰运动有任何了解。但该公司暗示，在他2019年9月被免职的原因中，他的“不恰当沟通”起到了一定作用。根据eBay周一在其网站上发布的一份声明，在联邦当局通知该公司“安全人员对一名博客作者的可疑行为”后，该公司在同月解雇了Wmer，原因是该公司在外部律师事务所的帮助下进行了一项内部调查。\nWmer和Venig都没有受到指控，当局也没有在宣誓书中提到他们的名字；相反，这两人被简单地称为高管1和高管2。美国马萨诸塞州检察官办公室的一名发言人拒绝评论其他eBay员工是否会被起诉。“(我)正在进行调查，”这位发言人说。\n多名前eBay内部人士表示，在担任eBay首席执行官的四年时间里，维尼格经常亲自面对负面新闻，当谈到EcommerceBytes和Steiner时，他尤其脸皮薄。据一位前内部人士透露，“他经常会对她说一些非常丰富多彩的话。”消息人士称，维尼格曾多次在内部宣传eBay应该为卖家创建自己的新闻网站，以反击他认为来自EcommerceBytes的有偏见的报道。从未创建过竞争对手站点。\n多名前eBay内部人士告诉Recode，包括eBay现任高管温迪·琼斯(Wendy Jones)在内的其他高管也经常表达对该网站的不满。\n但这些消息来源一致认为，他们从未目睹韦尼格说过或做过任何会让他们认为他会批准或容忍被指控的犯罪活动的事情。同样，一位在之前的工作中与Wmer密切合作的人告诉Recode，如果这位通讯主管参与了被指控的罪行，他们会感到震惊。这位消息人士承认，这位公关主管有时在工作讨论中可能会给人以极端的印象。\n“这是夸张，”该人士在宣誓书中披露的短信中谈到韦默的语言时说。“史蒂夫不会碾碎一只蚂蚁。但在这项运动最激烈的时候，他会说一些极端的话。“。\nRecode了解到，涉嫌实施犯罪的eBay安全团队向该公司现任全球客户体验和运营高级副总裁温迪·琼斯(Wendy Jones)汇报了情况。eBay发言人Trina Somera告诉Recode，该公司的内部调查“没有发现温迪有任何不当行为”，“她不是政府控诉中提到的人之一。”\n在Vox的每一天，我们都致力于回答您最重要的问题，并为您和世界各地的观众提供有能力拯救生命的信息。此时此刻，我们的使命从未像现在这样重要：通过理解来增强你们的能力。VOX的工作正在接触到比以往任何时候都多的人，但我们独特的解释性新闻品牌需要资源-特别是在大流行和经济低迷时期。您的财政贡献不会构成捐赠，但它将使我们的工作人员能够继续以当前所需的质量和音量提供免费的文章、视频和播客。请考虑今天就为VOX做出贡献。", "note_en": "Earlier this week, reports emerged of a very strange corporate scandal:  Federal authorities charged several former eBay corporate security employees for their roles in a cyberstalking campaign targeting a blogger that involved Twitter harassment and mailing insects to her house. Now, former eBay CEO Devin Wenig, who led the company at the time, tells Recode that he was shocked to hear details of the campaign this week and that he gave “no direction” nor “tacit approval” for it.\n But the former eBay chief executive was at times so frustrated with coverage from the news website in question that he on several occasions floated the idea internally that eBay should create its own competitor publication, multiple former eBay insiders told Recode.\n “On Monday, I read the charges along with everyone else, and was shocked and outraged,” Wenig told Recode in a statement. “It is important for me to reiterate, and an independent investigation confirmed, that I had nothing to do with and no knowledge of the activities alleged to have occurred. There was no direction, no knowledge, no private understanding, no tacit approval. Ever.”\n Still, the fact that eBay’s security team allegedly felt comfortable executing such a campaign against the blogger and her husband suggests that the leadership team had, at best, problematic blind spots.\n On Monday, the US Attorney’s Office in Massachusetts revealed a case against six former eBay workers who allegedly waged an “aggressive cyberstalking campaign” against the husband-and-wife team that runs EcommerceBytes, which reports business news geared toward online merchants who sell on eBay and Amazon. The site, and some of its readers who post comments below articles, were often critical of eBay under Wenig’s leadership and sometimes of Wenig himself.\n Authorities accuse the former eBay workers of a wide range of malevolent activities, including shipping them “a funeral wreath, a book on surviving the loss of a spouse, and pornography — the last of these addressed to the newsletter’s publisher but sent to his neighbors’ homes.” The group, led by former eBay security head James Baugh, also surveilled the couple and considered breaking into their garage to place a GPS tracking device on their vehicle.\n In court documents, copies of text messages showed Wenig twice instructing his communications chief, Steve Wymer, to “take her down,” referring to the EcommerceBytes owner and writer Ina Steiner. On Thursday, Wenig told Recode in a statement that those texts “have been wildly misinterpreted and taken completely out of context in some media reports.”\n “I was speaking off the cuff to a communications executive about my desire to be more aggressive in our PR effort; never in my wildest dreams would I fathom that, later, someone might associate that communication with the type of activity mentioned in the Massachusetts complaint,” Wenig said in the statement.\n Wenig’s statement added: “I am genuinely sorry for the couple that had to endure these obscene acts. No one should have to experience that, especially not a journalist. What happened isn’t representative of the company culture I spent 8 years building, or the employees I knew there.”\n Court documents show that Wymer, eBay’s communications chief, hired a consultancy that “prepared a document [which] included the recommendation, among others, that eBay promote company-friendly content that would drive the Newsletter’s posts lower in search engine results.” Such an action could be seen as a fairly benign PR strategy. But Wymer also sent text messages with an aggressive tone such as: “We are going to crush this lady.”\n Court documents also include an exchange between Wymer and the security chief Baugh in which Baugh references an unspecified “Plan B” in relation to the EcommerceBytes couple. Wymer expressed a willingness to manage any fallout internally, but the messages do not indicate that Wymer had any knowledge of what the “Plan B” entailed.\n Reached for comment, Wymer told Recode, “I would never condone or participate in any such activity.”\n  EBay has said it conducted an internal investigation and found no evidence that Wenig directed or had any knowledge of the harassment campaign. But the company implied that “inappropriate communications” from him played a role in his ouster in September 2019. The company fired Wymer that same month in relation to an internal investigation it conducted with the help of an external law firm, after federal authorities notified the company of “suspicious actions by its security personnel toward a blogger,” according to a statement  eBay posted on its website Monday.\n Neither Wymer nor Wenig has been charged, and authorities did not name them in the affidavit; instead, the two were simply referred to as Executive 1 and Executive 2. A spokesperson for the US Attorney’s Office in Massachusetts declined to comment on whether other eBay employees might be charged. “[I]t’s an ongoing investigation,” the spokesperson said.\n Multiple former eBay insiders say that over his four years as eBay CEO, Wenig often took negative press personally, and that when it came to EcommerceBytes and Steiner, he was especially thin-skinned. “He would often have very colorful words to say about her,” according to one former insider. Wenig on several occasions promoted the idea internally that eBay should create its own news site for sellers to counter what he saw as biased coverage from EcommerceBytes, sources said. The competitor site was never created.\n Other executives, including current eBay executive Wendy Jones, also frequently aired frustrations about the site, multiple former eBay insiders told Recode.\n But those same sources were in agreement that they never witnessed Wenig say or do anything that would make them think he would approve or tolerate the alleged criminal activity. Similarly, a person who worked closely with Wymer in a previous job told Recode that they would be shocked if the communications executive was involved with the alleged crimes. The same source admitted that the communications executive could sometimes come across as extreme in work discussions.\n “It’s hyperbole,” the person said of Wymer’s language in the text messages revealed in the affidavit. “Steve wouldn’t crush an ant. But in the heat of the sport, he will say things that are extreme.”\n The eBay security team that allegedly carried out the crimes reported up to Wendy Jones, the company’s current senior vice president of global customer experience and operations, Recode has learned. EBay spokesperson Trina Somera told Recode that the company’s internal investigation “found no wrongdoing with regard to Wendy” and that “she is not one of the people referenced in the government’s complaint.”\n   Every day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires.  Please consider making a contribution to Vox today.", "posttime": "2020-06-22 21:26:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,执行官,ceo,ebay", "title": "eBay前首席执行官否认与博客作者的网络跟踪有任何联系", "title_en": "eBay’s former CEO denies any link to the cyberstalking of a blogger", "transed": 1, "url": "https://www.vox.com/recode/2020/6/18/21295992/ebay-security-stalking-ecommercebytes-cyberstalking-devin-wenig-james-baugh", "via": "", "real_tags": ["博客", "执行官", "ceo", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "f532236ad2ac3b71e8aeb5e0bd42820d.png", "infoid": 1007637, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\nRPI-VK-Driver是用于Broadcom Videocore IV GPU的低级GPU驱动程序，它实现了Vulkan(Khronos Group的注册商标)标准的子集。该实现不符合标准(因此，官方不能将其称为Vulkan驱动程序)，但会尝试尽可能严格地遵循硬件允许的标准。与现有的OpenGL驱动程序相比，它提供了超高的速度，包括精确且可预测的内存管理和多线程命令提交。它还提供了更广泛的功能集，如MSAA支持、低级别程序集着色器和性能计数器。另一方面，它目前不支持GLSL着色器。", "note_en": "GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n                  RPi-VK-Driver is a low level GPU driver for the Broadcom Videocore IV GPU that implements a subset of the Vulkan (registered trademark of The Khronos Group) standard. The implementation is not conformant to the standard (therefore it cannot be called a Vulkan driver, officially) but tries to follow it as closely as the hardware allows for it. Compared to the available OpenGL drivers it offers superb speed including precise and predictable memory management and multi-threaded command submission. It also offers a wider feature set such as MSAA support, low level assembly shaders and performance counters.On the other hand it currently does not support GLSL shaders.", "posttime": "2020-06-22 21:26:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,程序,pi,driver,驱动程序", "title": "Raspberry PI(Broadcom VideoCore IV)的Vulkan驱动程序", "title_en": "Vulkan Driver for the Raspberry Pi (Broadcom Videocore IV)", "transed": 1, "url": "https://github.com/Yours3lf/rpi-vk-driver", "via": "", "real_tags": ["程序", "pi", "driver", "驱动程序"]}, {"category": "", "categoryclass": "", "imagename": "fa3178cb6f09cc111c803c04a4999e77.jpg", "infoid": 1007636, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按：这个故事的前一个版本包括一张肯塔基州路易斯维尔一名抗议者被汽车撞到的照片。这张照片是由编辑选择的，似乎不是故事中描述的袭击事件的例子，已经被替换了。警方还没有起诉司机，但已经起诉了参与那起事件的两名抗议者。当局仍在继续调查。\n右翼极端分子正在将汽车变成武器，据报道，自5月底全国爆发反对警察暴力的抗议活动以来，至少发生了50起撞车事件。\n芝加哥大学(University Of Chicago)芝加哥安全与威胁项目(Chicago Project On Security And Threat)恐怖主义研究员阿里·韦尔(Ari Weil)周五发布的统计数据显示，至少有18起被归类为蓄意袭击；另有20多起动机不明或仍在调查中。自抗议活动开始以来，韦尔一直在追踪车辆撞击袭击(VRA)。\n在撞车事件中面临起诉的20人包括弗吉尼亚州三K党(Virginia Ku Klux Klan)的一名州领导人，以及一名加州男子，这名男子被控谋杀未遂，此前他激怒了抗议者，然后开车撞向他们，撞上了一名十几岁的女孩。一些袭击的视频片段显示，司机在按下油门之前对黑人生命也是抗议者大喊大叫或威胁他们。\n韦尔说，他们试图传递的信息是，你需要离开街头，停止这些抗议活动。他们正试图恐吓最近一波的BLM抗议者，以阻止他们的运动。\n韦尔说，上一次车辆撞车事件发生在2015年和2016年，当时，为了回应黑人生命也是命(Black Lives Matter)抗议活动和反对有争议的达科他州管道的示威活动，碾压撞车的迷因在极右翼圈子里流行起来。\n最引人注目的袭击发生在一年后，在弗吉尼亚州夏洛茨维尔举行的2017年Unite the Right集会上。一名白人至上主义者在一个血腥的周末将他的汽车撞向人群，导致32岁的希瑟·海耶(Heather Heyer)死亡，数十人受伤，这让全国认识到极右翼暴力的死灰复燃的威胁。\n对和平抗议者使用汽车袭击越来越成为白人至上主义者蓄意的恐怖策略，美国诚信优先(Integrity First First For America)的执行董事艾米·斯皮塔尔尼克(Amy Spitalnick)说。该组织是一家民权非营利组织，正代表夏洛茨维尔撞车事件的受害者领导一场民事诉讼。这起诉讼的目标是破产并解散几个帮助组织集会的仇恨团体。\n斯皮塔尔尼克说，正如我们在诉讼中详细描述的那样，夏洛茨维尔的暴力事件是提前几个月在网上策划的--包括讨论用汽车袭击抗议者。\n韦尔说，对袭击的支持不仅出现在极端主义渠道，而且还在更主流的共和党和保守派空间蔓延。\n夏洛茨维尔袭击事件发生后，福克斯新闻删除了一篇鼓励撞车袭击的辛迪加报道，并为此道歉。这篇在线文章最初是由右翼的“每日来电”(Daily Caller)发表的，其中包括一段汽车袭击的视频蒙太奇，标题为“这里是一卷汽车驶过试图封锁道路的抗议者”。\n在公众的强烈反对之后，福克斯新闻删除了在福克斯国家频道上播放的版本。福克斯新闻的一位高管告诉CNN财经频道，这篇文章是不恰当的，我们已经将其删除。“每日来电”也删除了最初的帖子。\n威尔说：我想提醒大家，这不仅仅是一件极右的新纳粹主义的事情，而且它正在成为受到广泛鼓励的事情，我认为这应该让每个人都感到担忧。\n从5月27日到6月17日，韦尔记录了全国至少50起撞车事件。其中5人是执法人员，45人是平民。根据伟尔对警方和法庭记录以及新闻报道的分析，至少有18起平民事件涉及恶意行为，另有23起事件的动机尚不清楚。大部分袭击发生在抗议活动的前14天。\n韦尔说，在两个周末内看到数十起这样的事件发生，令人惊讶地高。\n其中四人被裁定为意外，包括明尼阿波利斯一辆油罐车在高速公路上疾驰而过的病毒式事件，导致惊恐的抗议者逃命。当局后来在没有指控的情况下释放了这名司机，称他的行为很愚蠢，但并不是故意针对抗议者。\n最近的大多数撞车事件都被视频捕捉到了。这段视频遵循了一个可怕的模式：当一辆汽车或卡车突然出现在画面中并冲向人群时，示威者和平地行走。人们跑着、蹲着、尖叫着，哦，我的上帝！然后司机要么设法加速离开，要么被愤怒的抗议者包围和袭击。\n波士顿的一起撞车事件在当地电视新闻上直播，现场记者说，刚刚有几个人被撞到了！刚有几个人被车碾过！&#34；\n例如，明尼苏达州的抗议者努尼·尼科尔斯(Nuny Nichols)从未报告过她和几个朋友在5月30日晚上发生的事情。他们刚刚回到明尼苏达州的圣保罗，在明尼阿波利斯花了一天的时间向河对岸的抗议者分发食物。这三个人都是黑人女性，当时他们正走向尼科尔斯广场，这时他们来到一个十字路口，一个开着SUV的白人男子正等着红绿灯。\n他有点像是示意我们一起去，你知道，就像，来吧，尼科尔斯说。于是我们开始走出去。我们一到他的车前面，他就加速了。\n尼科尔斯和她的朋友尖叫着跑了。他们安然无恙地逃了出来，但尼科尔斯说她永远不会忘记有辆车瞄准她身体的感觉。她确信司机很清楚自己在做什么。\n尼科尔斯说，他是故意这么做的。这不像是，哦，他闯了灯，或者我们走路，没有。他真的一直等到我们几乎就在他的车前面，然后他踩油门加速。\n尼科尔斯说，白天和白人抗议者肩并肩地站在一起，一直到晚上，这让人想起了外面的仇恨。尼科尔斯说，但由于目前警察和抗议者之间的紧张关系，她没有报告这一事件。\n取而代之的是，她在卧室里呆了一天，太慌乱了，不能直接回到抗议活动中去。尼科尔斯的妹妹在2014年被车意外撞死；尼科尔斯说，她无法摆脱母亲差点以同样的方式失去另一个女儿的想法。\n尼科尔斯说：“我以前从未陷入过这样的困境，有人想杀了我。”他对我一无所知--他只是想碾过我。\n尼科尔斯在网上搜索有关撞车事件的信息，发现了庆祝和鼓励汽车袭击的令人不安的论坛。她看到了最近有关西弗吉尼亚州一名消防队长被解职的新闻报道。这名消防队长穿着一件印有一辆汽车撞向抗议者的T恤，上面写着“众生飞溅”的字样。尼科尔斯将这名消防队长的照片保存在她的手机上，以提醒人们她的经历并不是孤立的。\n尼科尔斯说：“我就像是，哇，#34；我是这样的。‘尼科尔斯说。这让我想到，也许这更多的是一个经过深思熟虑的过程，一个让他们碾压人的深思熟虑的计划。", "note_en": "Editor&#39;s note: A previous version of this story included a photo of a protester being struck by a car in Louisville, Kentucky. The photo, chosen by editors, does not appear to be an example of the assaults described in the story, and has been replaced. Police have not charged the driver, but have charged two of the protesters involved in that incident. Authorities continue to investigate.\n  Right-wing extremists are turning cars into weapons, with reports of at least 50 vehicle-ramming incidents since protests against police violence erupted nationwide in late May.\n  At least 18 are categorized as deliberate attacks; another two dozen are unclear as to motivation or are still under investigation, according to a count released Friday by Ari Weil, a terrorism researcher at the University of Chicago&#39;s  Chicago Project on Security and Threats. Weil has tracked vehicle-ramming attacks, or VRAs, since protests began.\n  The 20 people facing prosecution in the rammings include a state leader of the  Virginia Ku Klux Klan, as well as a California man who was charged with attempted murder after antagonizing protesters and then driving into them, striking a teenage girl.  Video footage of some attacks shows drivers yelling at or threatening Black Lives Matter protesters before hitting the gas.\n    &#34;The message they&#39;re trying to send is, &#39;You need to get out of the street and stop these protests,&#39; &#34; Weil said. &#34;They&#39;re trying to intimidate the most recent wave of BLM protesters, to stop their movement.&#34;\n  The last rash of vehicle rammings occurred in 2015 and 2016, Weil said, when the &#34; Run Them Over&#34; meme was popularized in far-right circles in response to Black Lives Matter protests and demonstrations against the controversial Dakota Access Pipeline.\n  The most high-profile attack occurred a year later, during the 2017 Unite the Right rally in Charlottesville, Virginia. A white supremacist plowed his car into a crowd, killing  32-year-old Heather Heyer and wounding dozens of others in a bloody weekend that jolted the country into recognizing the resurgent threat of far-right violence.\n  &#34;The use of car attacks against peaceful protesters is increasingly a deliberate terror tactic for white supremacists,&#34; said Amy Spitalnick, executive director of Integrity First for America, a civil rights nonprofit that&#39;s leading  a civil suit on behalf of Charlottesville ramming victims. The goal of the suit is to bankrupt and dismantle several hate groups that helped organize the rally.\n  &#34;As detailed in our lawsuit, the Charlottesville violence was planned months in advance online — including discussions of hitting protesters with cars,&#34; Spitalnick said.\n  Weil said support for the attacks is not just seen in extremist channels but is also spreading in more mainstream Republican and conservative spaces.\n  After the Charlottesville attack, Fox News deleted and apologized for running a syndicated piece that encouraged car-ramming attacks. Originally published by the right-wing Daily Caller, the online article included a video montage of car attacks under the headline &#34;Here&#39;s A Reel Of Cars Plowing Through Protesters Trying To Block The Road.&#34;\n  After public backlash, Fox News deleted the version that had run on Fox Nation. A Fox News executive  told CNN Money that &#34;the item was inappropriate and we&#39;ve taken it down.&#34; The Daily Caller also deleted its original post.\n  &#34;I want to caution that this isn&#39;t just a far-right, neo-Nazi thing, but it&#39;s becoming something that&#39;s encouraged broadly, and I think that should worry everyone,&#34; Weil said.\n  From May 27 to June 17, Weil recorded at least 50 vehicle-ramming incidents nationwide. Of those, five were by law enforcement and 45 by civilians. At least 18 of the civilian incidents involved malice, and another 23 remain unclear as to motive, according to Weil&#39;s analysis of police and court records, as well as news reports. The bulk of the attacks occurred in the first 14 days of protests.\n  &#34;To see dozens of these incidents occur over two weekends was surprisingly high,&#34; Weil said.\n  Four were ruled accidental, including the viral incident when a tanker barreled down a highway in Minneapolis, sending terrified protesters running for their lives. Authorities later  released the driver without charges, saying he had acted foolishly but did not deliberately target protesters.\n  Most of the recent rammings have been  captured on video. The footage follows a grim pattern: Protesters are shown walking peacefully when, suddenly, a car or truck appears in the frame and hurtles toward the crowd. People run, crouch and scream, &#34;Oh my God!&#34; Then the driver either manages to speed off or is surrounded and set upon by the outraged protesters.\n  One ramming in Boston unfolded live on the local TV news, with the reporter at the scene saying, &#34;Several people just got hit! Several people just got run over!&#34;\n    Minnesota protester Nuny Nichols, for example, never reported what happened to her and a couple of friends on the night of May 30. They had just returned to St. Paul, Minn., after spending the day passing out food to protesters across the river in Minneapolis. The three of them — all black women — were walking to Nichols&#39; place when they came to an intersection where a white man in an SUV was waiting at the light.\n  &#34;He kind of like motioned for us to come, you know, like, come on,&#34; Nichols said. &#34;So we started walking out. And as soon as we got right in front of his car, he just sped up.&#34;\n  Nichols and her friends screamed and ran. They escaped without being hit, but Nichols said she&#39;ll never forget what it felt like to have a car aiming for her body. She&#39;s convinced the driver knew exactly what he was doing.\n  &#34;He deliberately did it,&#34; Nichols said. &#34;It wasn&#39;t like, oh, he ran the light, or we walked, no. He literally waited until we got almost right in front of his car — then he put his foot on the gas and sped up.&#34;\n  Nichols said it was jarring to go from standing shoulder to shoulder with white protesters during the day to the evening&#39;s reminder of the hate that&#39;s out there. But because of the tensions between cops and protesters right now, Nichols said, she didn&#39;t report the incident.\n  Instead, she stayed in her bedroom for a day, too rattled to go right back to the protests. Nichols&#39; sister died in 2014 after being accidentally struck by a car; Nichols said she couldn&#39;t shake the thought that her mother almost lost another daughter the same way.\n  &#34;I&#39;ve never been in a predicament like that before, where somebody just wanted to kill me,&#34; Nichols said. &#34;He didn&#39;t know anything about me — he just tried to run me over.&#34;\n  Nichols searched online for information about rammings and discovered the disturbing forums that celebrate and encourage car attacks. She saw the recent news reports about a  fire chief in West Virginia who was dismissed from his post for wearing a T-shirt showing a car hitting protesters and the words &#34;All Lives Splatter.&#34; Nichols saved the chief&#39;s photo to her phone as a reminder that her experience wasn&#39;t isolated.\n  &#34;I was, like, &#39;Wow,&#39; &#34; Nichols said. &#34;It made me think about, maybe this is more of an actual thought-out process, a deliberate plan for them to run people over.&#34;", "posttime": "2020-06-22 20:50:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抗议者,attacks", "title": "极端分子以抗议者为目标，汽车袭击事件增加", "title_en": "Vehicle attacks rise as extremists target protesters", "transed": 1, "url": "https://www.npr.org/2020/06/21/880963592/vehicle-attacks-rise-as-extremists-target-protesters", "via": "", "real_tags": ["抗议者", "attacks"]}, {"category": "", "categoryclass": "", "imagename": "30990b6cc2a5f781791e2cd6d0e02d6c.jpg", "infoid": 1007635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您想了解什么是存储驱动程序、在某些操作系统上建议使用哪些存储驱动程序以及如何更改它，或者想了解有关设备映射程序设置的详细信息，请查看：\n如果您计划将Docker Enterprise与多个节点或群一起使用-请记住在节点之间设置时间同步-为此使用NTP。\n安装坞站引擎(有效的GPG密钥：060A 61C5 1B55 8A7F 742B 77AA C52F EB6B 621E 9F35)。\n在写这篇文章的当天，CentOS 8有关于tainerd.io依赖的问题-您可以通过在运行docker-ce安装命令之前手动安装正确版本的tainerd.io来解决这个问题。举例。\n要安装Docker Enterprise Edition，您必须在从Docker Hub帐户Docker EE Repo地址获取后，在您的操作系统上设置回购。\n如果您希望运行的容器不会因docker守护进程而停止，您可以启用实时还原功能。开启后，无需停止运行容器即可升级坞站引擎。\n在CentOS或Ubuntu上升级-如果我们从repo安装docker引擎-可以通过简单的yum升级或apt-get升级命令来执行。", "note_en": "If you want to get to know what is storage driver, what storage drivers are advised on certain OS and how to change it or looking for detailed info about setup of devicemapper, look at:\n    If you plan to use Docker Enterprise with multiple nodes or Swarm - remember to set up time synchro between nodes - use NTP for that.\n       Install docker engine(Valid GPG Key:  060A 61C5 1B55 8A7F 742B 77AA C52F EB6B 621E 9F35)\n  CentOS 8 at day of writing this post has problem with dependiences for containerd.io - you can solve this by installing manually correct version of containerd.io before running  docker-ce instalation command. Example\n        For installing Docker Enterprise Edition you have to set up repo on your OS after getting from  Docker Hub Account Docker EE Repo Adress.\n                 If you want that running containers won’t stop with docker daemon you can enable live restore feature. After enabling it you can perform upgrade of docker engine without stopping running containers.\n   Upgrade on CentOS or Ubuntu - if we install docker engine from repo - can be performed with simple  yum upgrade or  apt-get upgrade commands.", "posttime": "2020-06-22 20:50:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,ubuntu,安装,install", "title": "Docker安装和升级指南-CentOS和Ubuntu", "title_en": "Docker install and upgrade guide – CentOS and Ubuntu", "transed": 1, "url": "https://knowledgepill.it/posts/docker_install_upgrade/", "via": "", "real_tags": ["docker", "ubuntu", "安装", "install"]}]