[{"category": "", "categoryclass": "", "imagename": "0074b0fe4e23783563f7c8f272bed7fa.jpg", "infoid": 1017224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何在2015年1月1日至2019年4月2日期间拥有Google Plus账户的美国人，都认为自己受到了谷歌2018年披露的一个安全漏洞的影响，现在可以注册从集体诉讼和解中获得赔偿。这起诉讼已经以总计750万美元的价格达成和解。在计入律师费和其他费用后，每个集体诉讼成员都有资格获得最高12美元的赔偿，尽管这可能会根据提交索赔的人数而有所不同。您必须在10月8日之前注册。\n尽管谷歌当时表示，没有证据表明暴露的数据曾被访问过，但该公司在公开承认这一失误后，立即宣布将关闭其社交网络。谷歌在宣布关闭时表示，其社交网络的“使用率和参与度都很低”，这并不令人惊讶，因为它从未真正成功地与Facebook和Twitter等社交媒体重量级公司竞争。\n虽然已达成和解，但谷歌否认诉讼中的指控。该公司否认有任何不当行为，并认为没有用户“因软件漏洞而遭受任何损害或伤害”。\n如果你有兴趣提出索赔，那么你可以在和解网站上重新申请，在那里你需要提供与你的Google Plus账户相关联的电子邮件地址。除了在列出的日期之间持有一个账户外，你的数据肯定是作为安全漏洞的一部分被暴露的(谷歌之前曾表示，多达50万用户受到了影响)。最终的公平听证会定于11月19日举行。", "note_en": "Anyone in the United States who held a Google Plus account between January 1, 2015 and April 2, 2019, and believes they were impacted by a  security flaw that Google disclosed in 2018 can now  register for a payout from a class action settlement. The lawsuit has settled for a total of $7.5 million. Each class action member is eligible for a payout of up to $12 after attorney fees and other costs are accounted for, although this could vary depending on the number of people who submit a claim. You have until October 8 to register.\n Although Google said at the time that there was  no evidence the exposed data was ever accessed, the company wasted no time in announcing that it would  shut down its social network after publicly admitting the lapse. When it announced the shutdown, Google said that its social network had seen “low usage and engagement,” which is unsurprising given it never really managed to compete against social media heavyweights like Facebook and Twitter.\n  Although it’s reached a settlement, Google denies the allegations made in the lawsuit. It denies any wrongdoing, and believes that no users “sustained any damages or injuries due to the software bugs.”\n If you’re interested in making a claim, then you can do so over on the  settlement’s website, where you’ll need to provide the email address associated with your Google Plus account. As well as holding an account between the dates listed, your data must have been exposed as part of the security lapse (Google has previously said that as many as 500,000 users were affected). A final fairness hearing is scheduled for November 19.", "posttime": "2020-08-10 02:29:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,班级,谷歌", "title": "Google+违规和解协议为班级成员每人提供高达12美元的赔偿", "title_en": "Settlement for Google+ Breach Offers Class Members Up to $12 Each", "transed": 1, "url": "https://www.theverge.com/2020/8/7/21358338/google-plus-security-lapse-settlement-12-dollars-exposed-data", "via": "", "real_tags": ["google", "班级", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近乎完美的艺术品只在很小的方面有所改进：APL比英国教授艾伦·J·佩利斯(Alan J.Perlis)更像耶鲁大学(Yale University)教授。\n我是来自阿尔戈尔的叛教者。在ALGOL编程语言环境中长大的我，在相当晚的时候就受到了APL的影响。就像所有晚年进入有趣事物的人一样，一个人往往很快就会忘乎所以。我想说一下我是如何受到APL的影响可能会很有趣，因为也许你们中的许多人都走过同样的路线。\n我当时正在英国纽卡斯尔参加一个会议，我应邀在那里发表演讲，还有斯坦福大学的唐·克努斯、IBM的肯·艾弗森以及其他一些人。我坐在观众席中，中间夹着两位非常受人尊敬的计算机科学和计算界人士-弗里茨·鲍尔(Fritz Bauer)和埃茨格·迪克斯特拉(Edsger Dijkstra)，前者在慕尼黑的总部负责巴伐利亚州的计算机业务，后者在荷兰的总部负责全球的计算机业务。\nKen在放映一些幻灯片-他的一张幻灯片上有一些东西，后来我才知道这是一个APL的俏皮话。他把这个作为APL符号表现力的一个例子。我相信一行代码是用来表示代数表达式中括号嵌套级别的标准代码之一。但是这一行很短--十个字符，大概十个字符--我参与了很长一段时间的编程，意识到这需要相当数量的代码才能完成，我看着它说，“天哪，这门语言肯定有什么东西。”鲍尔，在我左边。我没看到这一点。他看到或听到的是肯的话，他说APL是一种非常适合教授代数的语言，他低声对我说，“只要我活着，APL就永远不会在慕尼黑使用。”坐在我另一边的迪克斯特拉靠向鲍尔说，“在荷兰也不是。”我们三个人听的是同一堂课，但我们听到的显然是不同的东西。\n因此，APL吸引我的是一种感觉，也许通过APL，一个人可以开始获得我们在自然语言中崇敬的编程的一些维度--一些组成的乐趣，说得优雅；简洁、诗意、艺术，这使得我们的自然语言对我们来说是如此珍贵。编程的这一方面是我长期以来一直感兴趣的，但在我使用FORTRAN、ALGOL、PL/I学派语言的经验中，我从未找到任何接近这一水平的语言。很明显，在那些语言中，编程实际上是一项管道工程。一个是建造一个复杂的物体，而主要的问题就是让你的头浮出水面。但是，要让你的头从这些语言中脱身是非常困难的，以至于我们在编程中使用的语言的这一方面从来没有浮出水面。对我来说,。在听肯的时候--我以前听过他的话--对我来说，在那一刻，我只能说是一种启示。\n1963年，我在普林斯顿的一个编程语言会议上听过Ken的演讲，他谈到了APL。但当时APL并没有在任何一台计算机上运行，他坚决认为它没有必要在计算机上运行。对他来说，这是一种他可以用来表达算法概念的符号；而对于当时的他来说，这似乎已经足够了。对于我们这些关心让程序在真实计算机上运行的人来说，这似乎远远达不到目标。几年后，由于天上的星星--一些非常优秀的程序员，哈佛大学没有给肯终身教职而他去了IBM，360可以使用，人们认为人们应该可以用它来分时--天才程序员的结合，肯、阿丁·法尔考夫和其他几个人的出现，360给了我们所有的APL。我认为我们今天都应该意识到，APL之所以是现在的样子，是因为有了这样的连词。它运行的系统是如此坚如磐石，以至于在分时度假是一项极其不稳定的活动的时候，人们实际上可以保证合理的持续运营；在第一个360实现中所代表的语言；以及一群热心的追随者，他们将这种语言潜入了IBM之外-因为在那些日子里，IBM远没有像它应该接受的那样容易接受。但这一直是IBM的历史。像所有的大公司一样，它拥有大量的事后智慧。但这真的意味着我们--尤其是那些为IBM工作的人--必须时刻意识到IBM对好点子的顺从，但克服巨人的惰性需要时间，需要很长时间。\n现在，回到APL作为一种语言的问题上来。在与人们交谈时，我经常感到惊讶-但回想起来并不惊讶-当我谈到APL时，几乎就像我们在谈论两件不同的事情：他们对A的看法", "note_en": "Almost Perfect Artifacts Improve\ronly in Small Ways: \rAPL is more French than English   Professor Alan J. Perlis \rYale University\n  I’m an apostate from ALGOL.\rHaving been raised on programming languages\rof the ALGOL variety, I came under the \rinfluence of APL rather late in life.\rLike all people who enter interesting\rthings late in life,\rone tends to go over one’s head very quickly.\rI think it might be interesting to say \rhow I came under the influence of APL,\rbecause maybe many of you have gone the same route.\n  I was at a meeting in Newcastle, England, \rwhere I’d been invited\rto give a talk, as had Don Knuth of Stanford, \rKen Iverson from IBM, and a few others as well.\rI was sitting in the audience sandwiched between\rtwo very esteemed people in computer science and computing —\rFritz Bauer, who runs computing in Bavaria \rfrom his headquarters in Munich,\rand Edsger Dijkstra, who runs computing all over the world\rfrom his headquarters in Holland.\n  Ken was showing some slides — and one of his slides\rhad something on it that I was later to learn was an APL\rone-liner.\rAnd he tossed this off as an example of the expressiveness\rof the APL notation.\rI believe the one-liner was one of the standard ones\rfor indicating the nesting level of the parentheses\rin an algebraic expression.\rBut the one-liner was very short — ten characters,\rsomething like that — and having been involved\rwith programming things like that for a long time\rand realizing that it took a reasonable amount \rof code to do,\rI looked at it and said,\r“My God, there must be something in this language.”\rBauer, on my left, didn’t see that.\rWhat he saw or heard was Ken’s remark that\rAPL is an extremely appropriate language for teaching algebra,\rand he muttered under his breath to me,\rin words I will never forget,\r“As long as I am alive,\rAPL will never be used in Munich.”\rAnd Dijkstra, who was sitting on my other side,\rleaned toward Bauer and said,\r“Nor in Holland.”\rThe three of us were listening to the same lecture,\rbut we obviously heard different things.\n  What attracted me, then, to APL was a feeling that\rperhaps through APL one might begin to acquire some\rof the dimensions in programming that we revere\rin natural language — some of the pleasures of composition;\rof saying things elegantly;\rof being brief, poetic, artistic,\rthat makes our natural languages so precious to us.\rThat aspect of programming was one \rthat I’ve long been interested in \rbut have never found any level for coming close to\rin my experience with languages of the FORTRAN, ALGOL, PL/I school.\rIt was clear in those languages \rthat programming was really an exercise in plumbing.\rOne was building an intricate object,\rand the main problem was just to keep your head above water.\rBut, so difficult is it to keep your head above water\rwith those languages\rthat this aspect of the languages \rwe use in programming just never surfaces.\rFor me, in listening to Ken then —\rand I’d heard him before —\rfor me, at that moment,\rthere came what I can only call a revelation.\n  I heard Ken speak in 1963 at Princeton at a\r meeting \ron programming languages,\rand he spoke about APL.\rBut at that time APL was not running on any computer;\rand he stoutly insisted that it was unnecessary\rthat it ever run on a computer.\rIt was for him a notation with which\rhe could express algorithmic concepts;\rand for him at that time,\rthat seemed sufficient.\rTo those of us who were concerned\rwith making programs work on real computers,\rthis seemed far short of the mark.\rSome years later, due to a favourable conjunction\rof stars in the heavens —\rsome very good programmers,\rthe fact that Harvard didn’t give Ken tenure\rand he went to IBM,\rand that the 360 was available\rand people thought one ought to be able\rto do timesharing with it —\rthat conjunction of talented programmers,\rthe availability of Ken, Adin Falkoff, and a few others,\rand the 360 gave us all APL.\rAnd I think we should all realize today\rthat APL is what it is because of such a conjunction.\rThe system under which it ran was so rock stable\rthat people could actually be assured of \rreasonable continuity of operation\rat a time when timesharing was \ran extremely unstable activity;\rthe language, as represented in the\rfirst 360 implementation;\rand a group of ardent disciples\rwho submarined the language outside of IBM —\rbecause back in those days,\rIBM was not anywhere near as receptive\ras it should have been.\rBut that’s been IBM’s history all along.\rLike all large corporations,\rit has a large amount of  post facto wisdom.\rBut that really means that we —\rparticularly those of you who work for IBM —\rmust always be aware of the fact that IBM\ris amenable to good ideas, but it takes time,\rlots of time, \rto overcome the inertia of a Goliath.\n  Now, to get back to this question of APL \ras a language.\rIn talking to people, I am constantly amazed —\rbut in retrospect not surprised —\rthat when I talk about APL,\rit’s almost as if we’re talking about\rtwo different things: \rtheir vision of APL and mine.\rAnd when I look at your symposium papers,\rI find that many of you are concerned\rwith aspects of APL \rthat don’t interest me at all,\rand I’m sure that I’m\rinterested in aspects that probably\rdon’t interest you at all.\rWhat does that mean?\rTo my mind, \rit means that APL, as a language,\ris approaching a kind of completeness\rthat we expect from a good, rich language.\rThere are large, intelligent, useful groups of people\rwho find the language worthwhile\rand have an intersection of interests in common\rwhich is almost null.\rThat’s not bad;\rI think it is good and inevitable.\rAnd it points out, I think,\rthat in attempting to arrange for APL’s\rfuture development,\rwe’re probably going to find the task\ran extraordinarily difficult one.\rBecause those of us who use APL approach it \rfrom so many different avenues,\rand are concerned with so many different points\rabout how the language should change.\rIn a way, we are very fortunate, I think,\rthat the language is as good as it is and\ris changing so slowly.\rOne thing that those of us in programming\rhave certainly become aware of over the years\ris that people don’t mind programming\rwith a bad language or an incomplete language.\rAs long as they get some useful work from it\rand some pleasure,\rthey will find any kind of rationalization\rto support their continuance of that language —\reven in the presence of much better linguistic vehicles,\ras witness the fact that FORTRAN thrives.\rI know practically no one who is interested \rin programming languages as such \rwho has anything good to say about FORTRAN,\rother than the fact that its influence\rand its use continues to grow.\rThat is a very good thing to say \rabout any language.\rWhat’s happened, of course,\rwith FORTRAN is that it has become the\r lingua franca of the computing world.\rIt is  the one language that everybody\runderstands to some level of detail —\rit is on every computer, in every country,\rmade by every manufacturer —\rand one could learn to use FORTRAN \rreading books at every level of complexity,\rwritten in every language \ron the surface of the earth.\rIt is universal, like the air we breathe,\rand I don’t think it’s going to be displaced\rfor a long time to come.\rAnd one of the reasons it’s not going to be displaced,\rand perhaps should not be displaced,\ris that there are always new groups of programmers\rcoming into existence \rfor whom FORTRAN is mother’s milk.\rIt isn’t going to do us a bit of good\rto throw before them\ran APL one-liner that will do as well as\r50 lines of FORTRAN.\rFirst of all, \rit will take the people a long time\rto learn how to use the one-liner \rand even more to write one,\rso that FORTRAN will continue to grow and succeed.\rAnd I don’t think APL will usurp its position;\rthere’s no reason why it should.\rAnd it certainly shouldn’t be\ra goal of people who use APL to stand forth and say,\r“Why do you jackasses use these inferior\rlinguistic vehicles \rwhen we have something here \rthat’s so precious, so elegant,\rwhich gives me so much pleasure?\rHow can you be so blind and so foolish?”\rThat debate you’ll never win,\rand I don’t think you ought to try.\n  Now, there’s a great deal of talk today —\rsince APL is such an almost perfect instrument —\rof making it perfect. \rWe won’t succeed in that.\rFor the simple reason that for all of us\rthere are so many different avenues\rby which APL can reach fruition or perfection.\rThere is no single avenue.\rSome people say the most important issue at hand\ris to improve the data structures of APL.\rOthers say what APL needs is a little bit\rof Franglais, which in our terms is APLGOL.\r“If APL only had the  while-statement,\ror the  if-then-else, or the  for-statement,\rit would become such a perfect language.”\rThat’s ridiculous.\rAnd it’s silly to say\rthat if APL had arrays of arrays,\rall of our troubles would disappears.\rIn point of fact, what will happen\ris that the amount of troubles\rwould just grow almost exponentially\rif that happened.", "posttime": "2020-08-10 02:28:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apl,french", "title": "APL更像法语而不是英语(1978)", "title_en": "APL is more French than English (1978)", "transed": 1, "url": "https://www.jsoftware.com/papers/perlis78.htm", "via": "", "real_tags": ["apl", "french"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一切都过于简单化了，但大致来说是相当准确的。当然，到处都有损失，因此，事实上，返回浪中的能量将不会与最初浪中的能量相同，因此它不会那么高，以此类推。但这个想法大致是正确的。\n我们的水流被反射回来，超过高度的水位与运河的深度完全相同。如果运河有两米深，回流浪就会有两米高。那么，这一切与CMOS和电子产品有什么关系呢？在我正在处理的特定情况下，我将一个信号放入CMOS门的输入端。现在，CMOS门输入非常像一条被封锁的运河。你把电流沿着导线送到输入端，电流就无处可去了。但电线中的电流，回到信号原点，并不知道这一点。电线周围的磁场使电流保持流动，就像运河中的水的重量使水保持流动一样。CMOS输入栅极的电荷不断上升，就像运河尽头的水一样。在没有保护的情况下，这种电荷会溢出并进入芯片微妙的内部。在最坏的情况下，这会烧焦部件并杀死它。充其量，溢出会导致隐式寄生晶体管锁定，关闭整个电路的电源并让它保持5分钟，让电荷消散就可以覆盖整个电路。即便如此，您也需要防止过电压。一种方法是把电荷/电流放在某个地方。这可以通过在CMOS输入栅极和地之间连接一个电阻器来实现。当电流到达时，一些仍会反射回来，而另一些会进入地，您可以通过计算这些值来确保输入端的电压不会超过最大值。另一种是连接稳压二极管，还有一些是把电阻放在别处。诸若此类。有很多书都有关于这类事情的整章，我在这里不能公正地解释这个话题。但是，想象运河中的水流，直到它被反电势阻止，这让我理解了什么是信号反射，以及如何防止它。或者至少是受控的。电不是水，水也不是电，但这个类比很好，足以给人一种直觉，即&不会太具误导性。可以设计类似于电气部件的水，并且可以使其具有合理的精确度。(工业和信息化部电子科学技术情报研究所陈皓)。维基百科有一篇关于这方面的文章(这并不令人惊讶)：就我个人而言，我不喜欢封闭管道的类比，我更喜欢开放式的类比。电压是水的深度，等等。电不是水……。我知道..。但这个类比帮助我理解了信号反射，我们在阻抗的每一次变化中都会得到信号反射，包括从高到低(狭窄的运河变成更宽的运河，那么什么样的信号会被反射？)。也许你觉得这激怒了你，或许你觉得很有启发性。或者，也许就是这样。让我知道。你可以在这里给我们发个信息。它不会发布，它只会给我们发送一封电子邮件，而且它是一种简单的方式来询问任何问题或发表任何评论，而不必单独发送电子邮件。所以只要填好空格，然后", "note_en": "This is all  way over-simplified, but the broad sweep isreasonably accurate. There are, of course, losses all over theplace, so the energy in the returning wave would, in truth, notbe the same as in the initial wave, so it wouldn&#39;t be as high, etc, etc. But the idea is roughly right.\n Our flow is being reflected back, and the &#34;over height&#34; is exactlythe same as the depth of the canal. If the canal is two metres deep,the return &#34;wave&#34; will be two metres high. So what has all this to do with CMOS and electronics? In the specific case I was working with, I was putting a signal downa wire into the input of a CMOS gate. Now, a CMOS gate input is verylike a blocked off canal. You send a current down a wire into thatinput, the current has nowhere to go. But the current in the wire, back at the signal origin, doesn&#39;t knowthat. The magnetic field around the wire works to keep the electricalcurrent flowing, just as the weight of water in the canal keeps thewater flowing. And the electrical charge at the CMOS input gate keepspiling up, just like the water at the end of the canal. And without protection, that charge spills out and into the delicateinternals of the chip. At worst this will fry the components and killit. At best the overspill can cause a lockup of the implicit parasitictransistors, and powering the entire circuit down and leaving it alonefor 5 minutes to let the charge dissipate will cover it. Even so, you need to prevent the over-voltage. One way is to give the charge/current somewhere to go. This can bedone by connecting a resistor between the CMOS input gate and ground.As the current arrives, some will still be reflected back, while somewill &#34;go to ground&#34;, and you can computer the values to ensure thatthe voltage on the input never exceeds the maximum. Another is toconnect a zener diode, still others are to put resistors elsewhere. And so on. There are books with entire chapters on this sort ofstuff, and I can&#39;t do justice to the topic here. But the visualisationof water in the canal, flowing until it&#39;s stopped by a back potential,is what gave me an understanding of what signal reflection is, andhow it can be prevented. Or at least, controlled. Electricity is not water, and water is not electricity, but the analogyis good enough to provide an intuition that&#39;s not too misleading. Wateranalogs to electrical components can be designed, and can be made to bereasonably accurate. Wikipedia has an article on this (no surprisethere): Personally, I don&#39;t like the closed pipe analogy, I prefer the opencanal analogy. Voltage is the depth of water, etc. Electricity is not water ... I know ... but this analogy helped meto understand signal reflection, which we get at  every change ofimpedance, including high to low (a narrow canal into a wider one,what kind of signal gets reflected then?) Perhaps you found this enraging, or perhaps enlightening. Or perhapsjust &#34;Meh&#34;. Let me know.  You can send us a message here. It doesn&#39;t get published,it just sends us an email, and is an easy way to ask anyquestions, or make any comments, without having to send aseparate email. So just fill in the boxes and then", "posttime": "2020-08-10 02:27:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "信号,signal,电流", "title": "信号反射", "title_en": "Signal Reflection", "transed": 1, "url": "https://www.solipsys.co.uk/new/SignalReflection.html?th08hn", "via": "", "real_tags": ["信号", "signal", "电流"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从弗朗西斯·斯普福德到莎拉·沃特斯，当代作家给历史小说带来了新的复杂性和趣味性。\n读完“狼厅”和“带起身体”的读者可以毫无疑问地知道，希拉里·曼特尔的历史三部曲(请看第12页评论)的最后一卷“镜子与光明”将把他们带到哪里去。1540年7月28日，托马斯·克伦威尔将在塔山被斩首。但是，尽管我们知道克伦威尔要去哪里，他却不知道。曼特尔巧妙地利用了历史小说的宿命。它活跃在读者的知识和主人公的不确定性之间的鸿沟中。她的特殊成就是恢复了历史的临时性--运气、意外、惊喜。在曼特尔非凡的现在式叙述中，历史在我们面前展开。克伦威尔，这位小说家的代理人，是一位敏锐的人类分析家，但永远不能确定他们下一步会做什么。\n这就是历史小说开始的地方。当沃尔特·斯科特(Walter Scott)在1814年与韦弗利(Waverley)一起发明了这一体裁时，他的同名英雄是一个年轻的理想主义者，卷入了1745年雅各布派(Jacobite)对乔治二世的叛乱。(读者知道叛乱将会失败。)。19世纪，在司各特的觉醒下，历史小说具有很高的地位。现在很少有人阅读的作品-萨克雷的“亨利·埃斯蒙德·埃斯克的历史”，乔治·艾略特的“罗莫拉”，哈代的“小号大调”-曾经被认为是他们作者的最高成就。\n到了下个世纪，历史小说已经没落了。现代主义使历史看起来像是逃避现实，小说家们对此避而不谈。随着20世纪中叶的临近，历史小说在商业上取得了成功，但明显带有民粹主义色彩。大名鼎鼎的作家有乔治特·海耶(Georgette Heyer)和让·普莱迪(Jean Plaidy)(多产的埃莉诺·希伯特(Eleanor Hibbert)的笔名)。他们热爱他们的历史。特别是海耶，她的研究很严谨，她的摄政时期的小说有时会凝结着时代的细节。当今最成功、最多产的历史小说家菲利帕·格雷戈里同样为自己的准确性感到自豪。你可以对伯纳德·康威(Bernard Cornwe)的夏普系列或帕特里克·奥布赖恩(Patrick O‘Brian)的拿破仑航海小说说同样的话。\n然而，有时历史背景并不意味着时期细节的积累，而是恰恰相反。一些小说家回到过去，以摆脱现代世界的干扰。这里的典范是威廉·戈尔丁(William Golding)，在他1964年的小说《尖顶》(The Spire)和《到地球尽头》(To The Ends Of The Earth)中，这是他20世纪80年代的小说三部曲，故事发生在19世纪初一艘载着英国移民前往澳大利亚的。戈尔丁用想象中的过去来提炼人类的基本欲望和冲突。在尖顶，建造中世纪的英国大教堂尖顶是院长乔斯林的基督教使命，但他和那些为他工作的人被欲望或恐惧的黑暗灵魂所附身。\n更近的一本书，如吉姆·克雷斯(Jim Crace)的《黑暗的田园收割》，故事发生在一个偏远的英国村庄，当时土地被强迫包围(日期尚不确定)，属于同样的历史小说类别。在过去，社会秩序很难保护人们免受某种霍布斯式的自然状态的影响。一个可比的例子是萨曼莎·哈维(Samantha Harvey)2018年的小说《西风》(The Western Wind)，它把我们带到了15世纪一个与世隔绝的萨默塞特村。它由一位聪明、疲惫的教区牧师讲述，要求我们想象宗教信仰在信仰的时代可能是什么样子。(这是许多近期历史小说的兴趣所在。)。行动发生在四天内，按相反的时间顺序进行，就好像时间在把我们拉回过去一样。有一个神秘的情节-村里最富有和最聪明的人失踪了，可能淹死了-但为了找到解决方案，我们回到了叙述者一直知道的事情上。它揭示的历史是一段社区暴力的历史。奇怪的是，背景和主人公与罗伯特·哈里斯(Robert Harris)2019年的新历史小说《第二次睡眠》有一些相似之处。虽然这是从宣布它的事件发生在1468年开始的，但我们很快就发现我们进入了一个遥远未来的黑暗时代，在经历了一些灾难之后，历史被重写了。这也是一部讲述一小群人可以攻击另一小群人的杀戮暴力的小说。\n一部以几个世纪前为背景的小说拥有一种被剥夺的自由，而小说的自由可以追溯到几十年前，回到我们仍然有记录甚至记忆的时代。一些当代小说家显然认为历史距离是一种解放。安德鲁·米勒的“现在我们将完全自由”(2018年)以1809年为背景，讲述了一名饱受创伤的军官从半岛战争中归来的故事，他逃离了战争的恐怖，但却被一个复仇的恶棍追捕。小说乐趣的关键在于疏远的时代细节-我们探索摄政时期的枪店，参观纺织厂，或者对当时的外科医生的工作退缩。(米勒一直对早期不完整的医学和科学知识着迷)。然而，这些句子\n近年来，戏谑和模仿悄悄进入了历史小说。一个巧妙的例子是弗朗西斯·斯普福德(Francis Spufford)的“金山”(Golden Hill)，故事发生在17世纪40年代的纽约，本身就是对18世纪小说的模仿。斯普福德把他的书称为“约瑟夫·安德鲁斯或大卫·简朴的殖民地版”，分别由亨利和莎拉·菲尔丁的兄妹写于18世纪40年代的畅销小说。两者都雇佣了朴实无华的英雄，在一个狡猾的世界里释放出来。金山的主人公从伦敦来到这个危险的小镇，看起来是个无辜的人，但事实证明并非如此。\n斯普福德用18世纪的场景娱乐我们：纸牌游戏，暴徒，监禁，决斗，戏剧(你可以在菲尔丁的小说中找到所有这些)。从崔斯特瑞姆·尚迪到“米德尔马契”，“金山”充满了戏仿的繁华，并不合时宜地改编了著名英语小说中的台词。它也有一种在最近的小说中并不陌生的后现代转折，在小说的结尾，我们发现了关于我们一直在读的叙事的一个意想不到的真相。这本18世纪的模拟书对它是如何制作的提供了自己的描述。自约翰·福尔斯(John Fowles)的“法国中尉的女人”(the France中尉‘s Women)以来，历史小说就允许这种普遍的嬉戏。你可以在莎拉·沃特斯(Sarah Waters)的新维多利亚时代小说“给天鹅绒和指匠小费”或查尔斯·帕利瑟(Charles Palliser)的小说中找到这一点。写遥远的过去意味着重写你正在重温的那个时期的小说。\n曼特尔并不是唯一一个给历史小说带来新的文学复杂性的人。然而，她做了一些奇特的事情。她不仅给了我们环境的准确性(衣服，食物，举止)，还给了我们挑剔的叙述精确性。几乎每一个被命名的角色都是我们所知道的存在于那个时间和地点的人。每一集都符合历史记录。学术历史学家可能不喜欢她对托马斯爵士的看法-一个在狼厅里冷酷的狂热分子-但他们与她争执不下，就像与一位专家同行争执一样。她使历史小说不再居高临下，但也开创了一个严酷的先例。这似乎是一种不可能效仿的行为。", "note_en": "From Francis Spufford to Sarah Waters, contemporary writers have brought new complexity and playfulness to historical fiction\n   R eaders of  Wolf Hall and  Bring Up the Bodies can be in no doubt about where  The Mirror &amp; the Light, the concluding volume of Hilary Mantel’s historical trilogy (reviewed on page 12), will take them. On 28 July 1540, Thomas Cromwell will be beheaded at Tower Hill. But while we know where Cromwell is going, he does not. Mantel has brilliantly exploited the predestination of historical fiction. It comes alive in the gap between the reader’s knowledge and her protagonist’s uncertainty. Her special achievement is to restore provisionality – luck, accident, surprise – to history. In Mantel’s extraordinary present-tense narration, history is unfolding before us. Cromwell, the novelist’s surrogate, is a piercing analyst of human beings, but can never be sure of what they will do next.\n This is where historical fiction began. When Walter Scott in effect invented the genre with   Waverley in 1814, his eponymous hero was a young idealist drawn into the 1745 Jacobite rebellion against George II. (The reader knew that the rebellion was to fail.) In the 19th century, in Scott’s wake, the historical novel had high status. Works that are now little read – Thackeray’s  The History of  Henry Esmond Esq,  George Eliot’s   Romola,  Hardy’s   The Trumpet Major  – were once thought their authors’ highest achievements.\n  By the next century, historical fiction had sunk. Modernism made history look like escapism and novelists avoided it. As the mid-20th century approached, historical fiction was commercially successful but distinctly populist. The big names were authors such as  Georgette Heyer and  Jean Plaidy (the nom de plume of the prolific Eleanor Hibbert). They loved their History. Heyer, in particular, was exacting in her research, her Regency novels sometimes clotted with period detail. The most successful and prolific historical novelist of today,  Philippa Gregory, equally prides herself on accuracy. You can say the same for  Bernard Cornwe ll, with his Sharpe series, or  Patrick O’Brian, with his Napoleonic nautical novels.\n  Yet sometimes a historical setting means not an accumulation of period detail, but the very opposite. Some novelists go to the past to lose the distractions of the modern world. The model here is  William Golding, in both his 1964 novel  The Spire and  To the Ends of the Earth, his trilogy of novels from the 1980s set on a ship taking British migrants to Australia in the early 19th century. Golding used the imagined past to distil essential human appetites and conflicts. In  The Spire, the building of an English cathedral spire in the middle ages is the Christian mission of Jocelin, the dean, but he and those who work for him are possessed by dark spirits of lust or fear.\n A more recent book such as Jim Crace’s dark antipastoral   Harvest, set in a remote English village at a time of forced enclosures of land (the date is uncertain), belongs to the same category of historical fiction. The past is where social order hardly protects people from some Hobbesian state of nature. A comparable example is Samantha Harvey’s  2018 novel   The Western Wind, which takes us to an isolated Somerset village in the 15th century. Narrated by an intelligent, weary parish priest, it asks us to imagine what religious belief might be like in an age of faith. (This is an interest of much recent historical fiction.) The action takes place over four days, in reverse chronological order, as if time is pulling us backwards. There is a mystery plot – the wealthiest and cleverest man in the village has disappeared, perhaps drowned – but to find the solution we return to what the narrator has always known. The history that it reveals is one of communal violence. Oddly, the setting and the protagonist have something in common with Robert Harris’s 2019 neo-historical novel   The Second Sleep. Although this begins by declaring that its events take place in 1468, we soon find that we are in a Dark Age of the distant future, where history has been remade after some catastrophe. It is also a novel that turns on the murderous violence with which one small group can turn on another.\n A novel set centuries ago has a freedom denied to fiction that goes back only decades, to times for which we still have records or even memories. Some contemporary novelists clearly find historical distance a liberation. Andrew Miller’s   Now We Shall Be Entirely Free (2018) is set in 1809 and narrates the return from the Peninsular war of a traumatised army officer, who flees the horrors of war but is pursued by a vengeful villain. Essential to the novel’s pleasure is the estranging period detail – we explore a Regency gunshop, visit a textile mill, or flinch from the work of a surgeon of the time. (Miller has always been fascinated by the incomplete medical and scientific knowledge of earlier ages ). Yet the sentences are only lightly touched by archaism.\n For Miller, as for some other contemporary novelists, history has become an escape into the wonderful. The challenge is language: how do you make your characters’ sentences belong to another age?  Paul Kingsnorth’s   The Wake took the archaising principle to an unmatchable extreme. His novel, set in 11th‑century Lincolnshire, is narrated in an invented neo-Old English, full of words and syntactic patterns taken from Anglo-Saxon, comprehensible to the modern reader. Among recent historical novels,  James Meek’s   To Calais, in Ordinary Time is rare in making its vocabulary and occasionally syntax sound old. The novel is set in 1348. The “ordinary time” of its title names a period in the religious calendar between major festivals, but also refers ironically to the extraordinary time of the Black Death, impending as the novel begins. It centres on three characters of different social groups and fashions different languages for each of them: a dialect culled from Chaucer, a diction learned from French romance and an elaborately Latinate English. There is a delight about this, but also a price to pay. We notice the characters less than the author’s amusement as he fabricates his antique idiolects from magpie visits to the  Oxford English Dictionary.\n  Playfulness and pastiche have crept in to historical fiction in recent years. A cunning example is  Francis Spufford’s   Golden Hill, set in New York in the 1740s, and itself an imitation of an 18th-century novel. Spufford offers his book as “a colonial counterpart to   Joseph Andrews or  David Simple”, bestselling novels of the 1740s by brother and sister Henry and Sarah Fielding, respectively. Both employ guileless heroes, set loose in a guileful world.  Golden Hill’s hero, who has arrived from London in this dangerous town, appears to be an innocent, yet turns out to be anything but.\n Spufford entertains us with 18th-century setpieces: a card game, a rioting mob, confinement in prison, a duel, a play (you will find all these in the novels of the Fieldings).  Golden Hill is full of parodic flourishes and incongruously replanted lines from famous English novels, from   Tristram Shandy to   Middlemarch. It also has the kind of postmodern twist not unfamiliar in recent fiction, where we discover near the novel’s end an unexpected truth about the narrative that we have been reading. The mock 18th-century book provides its own account of how it got made. Such generic playfulness has been permitted to historical fiction since John Fowles’s   The French Lieutenant’s Woman. You find it in the neo-Victorian fiction of Sarah Waters –  Tipping the Velvet and  Fingersmith – or in Charles Palliser. Writing about the distant past means rewriting the novels of the period that you are revisiting.\n Mantel has hardly been alone in bringing new literary complexity to historical fiction. Yet she has done something singular. She gives us not just circumstantial accuracy (the clothes, the food, the manners) but fastidious narrative exactitude. Almost every named character is someone that we know existed, exactly in that time and place. Every episode fits the historical record. Academic historians may not like her take on Sir Thomas More – a cold fanatic in  Wolf Hall – but they dispute with her as with a fellow expert. She has freed the historical novel from any condescension, but she has also set a stern precedent. It seems an impossible act to follow.", "posttime": "2020-08-10 02:27:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "超越,historical,小说", "title": "超越曼特尔：历史小说", "title_en": "Beyond Mantel: Historical novels", "transed": 1, "url": "https://www.theguardian.com/books/2020/feb/29/an-escape-wonderful-historical-fiction", "via": "", "real_tags": ["超越", "小说"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你有没有走过另一条路，我指的是大多数人使用产品A的地方，然后通常会长大，或者进化到使用产品B，然后你就走另一条路了呢！。一个虚构的B到A的例子是拼车应用程序-&&gt；在手机上呼叫出租车服务。\n在软件世界里，当你走另一条路时，你会注意到所有的博客帖子，在线帮助一点帮助都没有。他们认为你只会去A&G；B。\n我发现的例子有：从AWS迁移到Heroku进行托管，或者从Ledger-CLI迁移到YNAB4进行预算。\n我将在本文中介绍这些示例中的第一个。我将讨论从AWS到Heroku的tryjobalert ts.com站点托管和数据处理。\n我猜你们中的许多人都已经尝试了慷慨的AWS免费服务一年，然后在第13个月收到了第一张账单，然后说：“哦，错了。”好的。这种情况发生在我身上，促使我剔除或移出了大量运行在AWS中的东西。另一方面，我惊讶于SES是多么便宜-我想我的账单是0.10美元，而Elastic Search是多么昂贵，我的账单是50美元，一个很少使用的集群。如果看到这些数字反转，我不会感到惊讶。\n然而，在账单之前，我已经开始将EC2服务器移到Heroku。原因不是成本-Heroku通常要贵一点，因为它在云基础设施上提供额外的包装和服务。我搬家的原因很明显，那就是我很懒。其是用于好时间优先排序的码字。我不想管理操作系统、服务器或配置项管道。取而代之的是，我想要一位专家为我打理这件事，每月额外支付5美元。\n我从EC2转到Heroku并不是一个深思熟虑的合乎逻辑的决定，因为我是坐在真皮沙发上沉思软件架构的。这是一个情绪化的决定，因为我的节点应用程序崩溃了，我为tryjobalert ts.com提供的所有服务都停用了5分钟，而且还在继续计数。如果有人试图编辑他们的设置，却得到一个错误页面，该怎么办？真让人难堪。虽然这几天并不少见，但我并不想成为那个人。\n接下来该怎么做？那么，在历史悠久的解决方案&#34；关闭它，然后再打开&#34；中，我重新启动了EC2实例和BAAM！节点应用程序再次崩溃。不管它做了什么，它以这样的方式取出了机器，我无法通过SSH连接到它来解决问题。在这一点上，我仓促地决定搬到赫鲁库去。我只是不忍心修复这些狗屎当我想编码。我知道这种情况可能会一次又一次地发生，我很可能会在向库伯内斯缓慢行进的过程中结束。\n这是不是一个仓促的决定？嗯，也许是这样，但很长一段时间以来，这一直是一种潜意识中的想法。设置nginx、let‘s encyrpt、PM2等等有点有趣，但感觉像是从我真正想要做的事情上分心。我很高兴有别人来处理这件事，如果所有的东西都死了，那就再来一次吧。我会把精力集中在代码上，非常感谢。\n我试了试赫鲁库。我想，让我们看看这有多容易。如果它能正常工作，我就换一个。否则我会下载K8(开玩笑！)。当网站像灯光一样熄灭时，我正在做这件事，没有人可以访问他们的设置，没有人可以注册或接收电子邮件-所以不要有压力。\n搬到赫罗库非常容易。我只需要创建一个名为Procfile的文件，其中包含以下内容：\n在Heroku用户界面中设置一些东西-秘密之类的。我还必须将port express运行的端口从固定的端口3001更改为Heroku作为环境变量提供的数字。在15分钟内，我说我让它工作了，没有DNS条目。\n我让事情保持了几个星期。然后，我从AWS收到了比预期更高的账单，其中包括一笔相当大的PSQL费用。没有什么太令人震惊的东西，但它看起来并不物有所值。\n我注意到Heroku提供了每月9美元的业余爱好基本PSQL，最多有1000万行。事实证明，我在文本字段中使用了相当大的空间，但没有使用太多行。所以我迁移到了那里。是的，令人难以置信的是，为了省钱，我正在将一些东西从AWS迁移到Heroku。\n这个限制很奇怪，它基于行数而不是存储大小。我想知道有多少优秀的数据可以存储为10M行的BLOB-也许我应该保持沉默，因为Heroku产品负责人可能正在阅读。\n我在网上搜索了移动数据的最佳方式。我喜欢Stack Overflow，因为如果有人有过战争故事，你会听到它，而不是亲身经历。然而，网上的大多数建议是如何将你的数据从Heroku转移到AWS。走另一条路。\n因此，我尝试了几种方法。事实证明，使用psql命令行工具pg_dump和pg_restore非常容易。它第一次起作用了，花了大约30分钟的时间-大部分时间是我在做家务，同时等待PG_Restore来做它的工作。\n(如果它对任何人都有帮助，这里的提示是不要使用Heroku CLI，从Heroku门户获取连接详细信息，并使用psql标准工具。)。\n令我惊讶的是，Heroku在PSQL数据库上竟然更便宜。这可能是因为它们不像RDS那样提供强大的功能，尽管它们在一定程度上使用了AWS--也许它们自己管理虚拟机。\n这可能是Heroku乐于在Hobby基本层上损失一点钱，或者他们比AWS在RDS中更积极地共享资源，所以在负载下它会更快崩溃。\nHeroku的业余爱好Basic PSQL不提供回滚功能，这可能是它便宜的另一个原因。这意味着我需要自己处理备份，但是，通过定期转储数据库，这可以很容易地实现自动化。\n我在搬到Heroku时犯的一个大错误是尝试使用免费的dynos。仅对非生产MVP执行此操作。通过使用免费的SSL，我不得不用Cloudflare做大量的工作来设置SSL，而且我从来没有让它真正工作过。\n然后我意识到我无论如何都需要付费的dynos，因为免费的dynos不能重新启动(！)。在没有部署的情况下。所以我升级了，然后对SSL进行了排序。不需要云耀斑。如果我一开始就这么做了，我就可以省去几个小时令人沮丧的DNS黑客攻击。\n这永远是一条微妙的界线。我的意思是，你尽量省钱，但有时你事先并不知道免费层陷阱是什么。也许Heroku可以让这一点变得更明显，但他们确实警告说，免费的dynos主要是供业余爱好使用的，所以足够公平。\n在这一点上我听起来像个Heroku推销员。市场上还有其他平台即服务产品。我在2014年刚刚使用过Heroku，我喜欢它仍然存在，所以我使用了它。不过，你也可以有更好的选择，去看看吧。或者，也许像AWS这样的常规旧云就是您一直需要的。\n无论如何，你可以选择另一条路，选择对你正在做的项目有意义的东西。\n加入JobAlerts，从精心策划的优秀来源名单中获得免费的每日电子邮件，其中包含最新的技术工作。点击这里了解更多信息。", "note_en": "Have you ever &#34;gone the other way&#34;, by which I mean where most people use product A then usually &#34;grow up&#34; or &#34;evolve&#34; and use product B, and you went the other way! B to A. A made up example of B to A would be ridesharing apps -&gt; calling a taxi service on the phone.\n In the software world, when you go the other way you notice how all the blog posts, online help is not really helpful at all. They assume you&#39;d only ever go A -&gt; B.\n Examples of this I have found are: moving from AWS to Heroku for hosting or from Ledger-CLI to YNAB4 for budgeting.\n I&#39;ll cover the first of those examples in this article. I will talk about going from AWS to Heroku for the tryjobalerts.com site hosting and data processing.\n  I&#39;m guessing many of you have tried the generous free year of AWS services, and then got your first bill on the 13th month and said &#34;errr. OK&#34;. That happened to me and prompted me to cull or move out a load of stuff running in AWS. On the flip side, I was amazed at how cheap SES is - I think my bill was $0.10, and how expensive Elastic Search is, where my bill was $50 for a hardly used cluster. I would have not been suprised to see those numbers reversed.\n However before the bill, I had started off moving EC2 servers to Heroku. The reason wasn&#39;t cost - Heroku is typically a little more expensive as it provides additional wrapping and services over cloud infrastructre. I moved for the obvious reason that I&#39;m lazy. Which is a codeword for good time prioritisation. I don&#39;t want to manage a operating system, server or CI pipeline. Instead I want an expert to take care of that for me for an extra $5 a month.\n The point where I switched from EC2 to Heroku wasn&#39;t a well thought out logical decision, based on sitting on a leather couch, musing about software architecture. It was an emotional decision based on my node app crashing, and all my services for tryjobalerts.com being out of action for 5 minutes and counting. What if someone tries to edit their settings and they get an error page? how embarassing. Although not that unusual these days, I didn&#39;t want to be the one.\n What to do next? Well, in the time honoured solution of  &#34;turning it off and on again&#34;, I restarted the EC2 instance and BaaM! the node app crashed again. Whatever it did, it took out the machine in such a way I couldn&#39;t connect to it via SSH to fix the problem. By this point I rashly decided to move to Heroku. I just didn&#39;t have the heart to fix this shit when I wanted to be coding. And I knew this would likely happen again and again, and I&#39;d probably end up on the slow march towards Kubernetes.\n Was that a hasty decision? Well maybe it was, but it had been a subconcious thought for quite a while. Setting up nginx, let&#39;s encyrpt, PM2 etc. etc. was mildly intersting but feels like a distraction from what I am really trying to do. I am happy for someone else to deal with that, and if everything dies, build them up again. I&#39;ll concentrated on the code, thank you very much.\n I gave Heroku a try. I thought, let&#39;s just see how easy it is. If it &#34;just works&#34; I&#39;ll switch over. Otherwise I&#39;m downloading k8s (joking!). I was working on this while the site was out like a light, no one could access their settings, sign up or receive an email - so no pressure.\n Moving to Heroku was redicuously easy. I just had to create a file called Procfile with this in it:\n  And set up a few things in the Heroku UI - secrets and such like. I also had to change the port express run on from a fixed port 3001 to the number Heroku provides as an environment variable. Within 15 minutes I say I had it working, sans DNS entries.\n  I kept things this way for a few weeks. I then got that bigger than expected bill from AWS, including a fair amount for the PSQL. Nothing too catastophic but it didn&#39;t seem like good value for money.\n  I noticed Heroku offers a &#34;Hobby Basic&#34; $9/month PSQL with up to 10M rows. It turns out I use a decent amount of space in TEXT fields, but not too many rows. So I migrated to that. Yes unbelievably I am migrating something from AWS to Heroku to save money.\n The limit is weird, being based on number of rows rather than storage size. I wonder how much excellent data you can store as blobs in 10M rows - maybe I should keep quiet as the Heroku Product Owner could be reading.\n I searched online for the best way to move the data over. I like Stack Overflow because if someone has had a war story you hear about it instead of experiencing it first hand. However most of the advice online is how to get your data out of Heroku into AWS. Going the other way.\n Therefore I tried a couple of ways. It turned out it was easy enough to use psql command line tools  pg_dump and  pg_restore. It worked first time and took about 30 minutes to do - most of the time was me doing housework while waiting for  pg_restore to do it&#39;s work.\n (Incase it&#39;s helpful to anyone, the tip here is don&#39;t use the Heroku CLI, get the connection details from the Heroku portal, and use the psql standard tools.)\n It is quite amazing to me that Heroku turns out to be cheaper on the PSQL database. It might be because they don&#39;t offer as much power as RDS, although they are using AWS in some capacity - perhaps they manage the VM themselves.\n It could be that Heroku is happy to lose a bit of money on that Hobby Basic tier, or they more aggressively share resources than AWS does in RDS, so under load it would crack sooner.\n Heroku&#39;s Hobby Basic PSQL doesn&#39;t offer rollbacks, and that could be another reason it&#39;s cheap. It means I need to take care of backups myself, however this can be automated quite easily with a periodic dump of the DB.\n  The big mistake I made when moving to Heroku was to try and use the free dynos. Only do this for non-production MVPs. By using the free ones, I had to do a lot of work setting up SSL with Cloudflare, and I never quite got it to work.\n I then realised I needed the paid dynos anyway because the free ones cannot be restarted (!) without a deployment. So I upgraded, and then the SSL was sorted. No Cloudflare needed. Had I done that in the first place I&#39;d have saved a couple of hours of frustrating DNS hacking.\n It&#39;s always a fine line. I mean you try to save money where you can, but sometimes you don&#39;t know in advance what the free-tier traps are. Maybe Heroku could make this more obvious, but they did warn that free dynos are mainly for hobby use, so fair enough.\n  I sound like a Heroku salesman at this point. There are other &#34;Platform as a Service&#34; offerings out there. I had just used Heroku before in 2014, and liked that it still existed, so I used that. However there could be better options for you, check them out. Or maybe a regular old cloud like AWS is what you needed all along.\n Regardless, it&#39;s OK to go the other way, choose whatever makes sense for the project you are doing.\n  Join JobAlerts to get free daily emails with the latest tech jobs from a curated list of excellent sources.  Click here to learn more.", "posttime": "2020-08-10 02:27:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "heroku", "title": "走另一条路", "title_en": "Going the Other Way", "transed": 1, "url": "https://tryjobalerts.com/blog/2020-08-05-going-the-other-way/", "via": "", "real_tags": ["heroku"]}, {"category": "", "categoryclass": "", "imagename": "fcec5fe0af3d0855230830cb3b783f15.jpg", "infoid": 1017218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何去过希腊的人，或者甚至在美国的希腊餐厅用餐的人，都可能从喜欢葡萄酒的朋友那里得到了善意的建议：不要喝Retsina。\n从表面上看，这个警告是有道理的。Retsina是一种注入了阿勒颇松树树脂的葡萄酒，它的味道经常被比作松节油，即使是喜欢这种东西的人也是如此。大多数现代的Retsina都是用劣质、稀薄的葡萄酒酿造的。树脂的加入有效地掩盖了底座的暗淡，给人一种尖锐的、令人振奋的刺激感。\n希腊人从古代酿酒最早的日子起就喜欢雷斯纳，当时他们使用松脂来排列和密封陶俑。即使在木桶取代了两栖动物成为首选的储藏容器之后，希腊人仍然保留了他们对视网膜的品味。\n一百年前，当希腊还是以农业为主的时候，农业社区会喝当地白葡萄酒制成的雷斯纳酒。酒馆和家庭可能会利用当地的松树来获取他们自己的新鲜树脂供应。\n如今，大众市场的视网膜酒，装在透明的500毫升带皇冠盖的瓶子里出售，通常是希腊可以买到的最便宜的葡萄酒。通常，在雅典这样的城市，它会与软饮料混合在一起，并由那些有学生预算的人消费(主要是为了获得快感)。这些就是我们被警告过的Retsinas。\n但Retsina似乎正在经历一场复兴。一些生产商正在证明，如果用认真种植的葡萄精心酿造雷西娜，它可以是一种美味的葡萄酒，不仅可以与各种各样的希腊食物搭配，而且还可以与其他许多自信的菜肴搭配得很好。这款酒是用认真种植的葡萄酿造的，它可以是一种美味的葡萄酒，不仅可以与各种各样的希腊食物搭配，还可以与其他许多自信的菜肴搭配。\n拥抱Retsina的生产商并不是想把它变成一种深邃的葡萄酒，一件值得陈年的收藏品或瓶子，以展示它的复杂性。相反，他们想把Retsina变成现代希腊人可以引以为豪的一种文化传统。\n我曾写过自己对Good retsina的介绍：几年前，我在旧金山停下来吃午饭，Souvla是一家受希腊Souvlaki酒馆启发的漂亮的小型休闲连锁餐厅。在按玻璃杯挑选的葡萄酒中，Souvla提供了一款承诺不错的Retsina。\n所以我试了一款配烟熏烧焦羊肉沙拉的玻璃杯，我很喜欢。从那以后，我有幸重复了几次这种经历。\n这款酒就是来自希腊最好的现代酒庄之一盖亚的Ritinitis Nobilis。自1998年首次发行以来，盖亚一直试图将视网膜重新定义为一种自豪的习俗，而不是一种应该回避的流派。\nRitinitis Nobilis的起源可以追溯到25年前的盖亚之前，当时创始人兼酿酒师扬尼斯·帕拉斯凯沃普洛斯(Yannis Paraskevopoulos)在历史悠久的希腊生产商布塔里(Boutari)工作。拥有布塔里的家族的导师扬尼斯·布塔里斯(Yannis Boutaris)随口说了一句话，这句话让他印象深刻：Retsina可以是一种优质的葡萄酒。\n他说，这句话对他构成了挑战，既要确定这是不是真的，也要看看他是否能做到。\n帕尔斯基沃波洛斯在一封电子邮件中写道，“当时优质的Retsinas还不存在。”他说，在当时，他们更多的是一种耻辱。\n“Retsina是希腊的国酒，因此需要保护，”他说。“问题是，你既不能保护也不能推广不好的东西。我必须做出一个好的决定。“。\n大众市场的瑞典娜通常是用希腊种植最广泛的葡萄萨瓦蒂亚诺(Savatiano)酿造的，这种葡萄有个名声，也许不配，充其量只能酿造乏味的葡萄酒。在最坏的情况下，种植是为了高产而不是高质量，它需要工业剂量的松脂来获得认同感。\n取而代之的是，帕尔斯基沃波洛斯选择了生长在海拔2300至3300英尺的相对高海拔地区的玫瑰葡萄--这种葡萄可以酿造新鲜、辛辣的葡萄酒。他说，他还密切关注树脂的质量，确保它特别新鲜。\n结果是一种清新、令人振奋的葡萄酒，带有明亮的辛辣，似乎已经为希腊烹饪准备好了，因为它所有的大蒜味和草本植物的荣耀。虽然Retsina主要是一种白葡萄酒(偶尔也是玫瑰酒)，但它与烤羊肉搭配得很好，其强烈的味道拒绝与美味的肉相融合。我还发现视网膜是辛辣印度食物的绝佳伴侣。\n虽然盖亚是新浪潮Retsinas最著名的生产商，但它并不是唯一的生产商。Lemnos岛上的Manolis Garalis用生长在石质火山土中的亚历山大有机麝香葡萄制作了一种活泼、芳香的视网膜。为什么是亚历山大港的麝香？\n加拉斯的美国进口商Eklektikon的阿里斯·索尔塔诺斯(Aris Soultanos)说：“这是岛上唯一的白葡萄。”\n索尔塔诺斯说，Eklektikon的目标是通过进口葡萄酒复兴希腊传统。他寻找那些同时使用本土葡萄和风格的小生产商，他们以有机或生物动力学的方式耕种，并且只需最少的干预就能酿造葡萄酒。\n这包括Retsinas。除了Garalis retsina，Eklektikon还从Georgas Family进口了两个Retsinas，该家族在雅典以东的Spata镇以生物动力方式种植了约11英亩的Retsinas。一种是Georgas传统型Retsina，由少量二氧化硫制成，二氧化硫是大多数商业葡萄酒中使用的稳定剂，并且经过最低限度的过滤。它将在大约一个月后首次在纽约亮相。\n另一种是Georgas Black标签，不含任何二氧化硫或过滤，葡萄汁在发酵前与果皮浸泡，以赋予葡萄酒一点颜色和质地。不出所料，黑色标签是一种浑浊的葡萄酒，与松树的味道产生了共鸣。口感浓郁，略带辛辣，完全是令人愉悦的组合。\n传统的在味道上稍微狭窄一些，在质地上更有针对性。经过过滤，它和任何现代白葡萄酒一样清澈。\n对于他的目标市场，索尔塔诺斯更多地瞄准了以天然葡萄酒为特色的餐厅和酒吧，而不是希腊餐厅。\n“这是一种天然葡萄酒，但也是一种独特的希腊天然葡萄酒，”他在谈到乔治亚斯家族的黑色标签时说。他说，这种小产量的葡萄酒需求如此之大，以至于它可能是第一款只能在小批量供应的视网膜葡萄酒。\n在售罄之前，它一直在去年9月在布鲁克林科布尔山开业的海鲜餐厅Saint Julivert Fisherie的名单上。预计在接下来的几周内会有一批新货。\n“我是这种酒的铁杆粉丝，和我们供应的食物搭配起来很棒，”大厨亚历克斯·雷吉(Alex Raij)说，她和丈夫埃德·蒙特罗(Eder Monte O)是店主之一。\n葡萄酒队长丹尼尔·斯蒂克勒(Daniel Stickler)说，他可以把客人分成两组：一组是35岁以上的人，他们对视网膜有不好的记忆；另一组年轻的人对视网膜一无所知。他说，一般来说，他会解释葡萄酒是如何酿造的，以及希腊的传统。然后，大多数客人都愿意品尝它。\n这些葡萄酒与大众市场Retsinas的不同之处在于葡萄酒本身的明显品质。在唐人街的一家很棒的希腊酒馆Kiki‘s，我尝试了马拉马蒂娜(Malamatina)，一种更好的批量生产的Retsina。树脂味辛辣而纯净，它完全主宰了葡萄酒，一种单薄的萨瓦蒂亚诺(Savatiano)。\n“在希腊，如果你把可口可乐放进去，没人会眨眼，”店主Kiki Karamintzas说。\n可怜的、四面楚歌的萨瓦蒂亚诺葡萄首当其冲地受到批评，认为它是坏视网膜的媒介，但Eklektikon的索尔塔诺斯坚持认为，如果种植得当，精心酿造，它可以酿造好酒。它没有展现出耀眼的香气。相反，它更多的是关于质地和微妙，他说。\n2017年的Georgas Black Label Savatiano，就像Black Label Retsina一样制作，但没有添加树脂，是一种华丽的葡萄酒，浑浊，玫瑰色，充满辛辣的柑橘味道。\n黑色标签Savatiano和Retsina都来自2017年的年份，但希腊的标签法不允许Retsinas是年份葡萄酒，所以它们不能贴上年份的标签。盖亚的Paraskevopoulos先生说这是个问题。\n他说：“不幸的是，Retsinas的年龄并不大。”“Retsinas应该在其生产的一年内食用。不允许印刷他们的古董酒也没有什么真正的帮助。“。\n我还没有验证这个假设，所以进一步的研究还在等待。如果你想探索视网膜，来自盖亚的诺比利斯Rittis是一个很好的起点。除了很棒的Georgas和Garalis Retsinas，我还推荐Tetramythos和Kechris的Tear of the Pine。", "note_en": "Anyone who has traveled to Greece or even eaten at a Greek restaurant in the United States may have received well-meaning advice from wine-loving friends: Don’t drink the retsina.\n On the face of it, the warning makes sense. The flavor of retsina, a wine infused with the resin of Aleppo pine trees, has often been likened to turpentine, even by people who like the stuff. Most modern retsinas are made with poor, thin wine. A potent addition of resin masks the dullness of the base with a sharp, bracing pungency.\n The Greeks have favored retsina since the earliest days of ancient winemaking, when they used pine resin to line and seal terracotta amphoras. Even after wooden barrels replaced amphoras as the preferred storage vessels, the Greeks retained their taste for retsina.\n A hundred years ago, when Greece was still largely agricultural, farming communities would drink retsina made from the local white wine. Taverns and families might tap the local pines for their own supply of fresh resin.\n Nowadays, mass-market retsina, sold in clear 500-milliliter bottles with crown caps, is usually the cheapest wine available in Greece. Often, in cities like Athens, it is mixed with soft drinks and consumed (primarily to catch a buzz) by those on student budgets. These are the retsinas we have been warned about.\n  But retsina appears to be undergoing a renaissance. A trickle of producers is demonstrating that if retsina is made thoughtfully and carefully, from grapes grown conscientiously, it can be a delicious wine that goes beautifully not only with a wide variety of Greek foods, but with many other assertive cuisines as well.\n The producers who have embraced retsina are not trying to transform it into a profound wine, a collectible or a bottle worth aging to show its complexities. Instead, they want to turn retsina into a cultural tradition of which modern Greeks can be proud.\n I’ve written about  my own introduction to good retsina: I stopped for lunch in San Francisco a few years ago at Souvla, a smart little chain of casual restaurants inspired by Greek souvlaki taverns. Among its selection of wines by the glass, Souvla offered a retsina that it promised was good.\n So I tried a glass with a smoky, charred lamb salad, and loved it. It’s an experience I’ve had the pleasure of repeating several times since.\n That wine was the  Ritinitis Nobilis from Gaia, one of Greece’s best modern wineries. Since it was first issued, back in 1998, Gaia has been trying to redefine retsina as a proud custom rather than a genre to be shunned.\n  The origin of Ritinitis Nobilis stretches back more than 25 years ago to the days before Gaia, when  Yiannis Paraskevopoulos, a founder and the winemaker, was working at Boutari, a historic Greek producer. A mentor, Yiannis Boutaris, of the family that owned Boutari, dropped an offhand remark that stayed with him: Retsina  can be a wine of quality.\n That remark challenged him, he said, both to determine whether it was true and to see if he could do it.\n “Quality retsinas didn’t really exist back then,” Mr. Paraskevopoulos wrote in an email. At the time, he said, they were more a source of shame.\n “Retsina was Greece’s national wine, and as such it needed protection,” he said. “The thing is, you can neither protect nor promote something that isn’t good. I had to make a good one.”\n Mass-market retsina is generally made with savatiano, Greece’s most widely planted grape, which has a reputation, perhaps undeserved, for making dull wines at best. At worst, farmed for high yields rather than good quality, it required industrial doses of pine resin for a sense of identity.\n Instead, Mr. Paraskevopoulos chose roditis grapes — which can make fresh, spicy wines — grown at relatively high altitudes, 2,300 to 3,300 feet above sea level. He also paid close attention to the quality of the resin, he said, making sure it was especially fresh.\n The result was a refreshing, invigorating wine, with a bright pungency that seems ready-made for Greek cooking in all its garlicky, herbal glory. Though retsina is primarily a white wine (and occasionally a rosé), it goes beautifully with roasted lamb, its punchy flavors refusing to knuckle under to the savory meat. I have also found retsina to be a wonderful partner for spicy Indian food.\n While Gaia is the most prominent producer of new-wave retsinas, it is not the only one.  Manolis Garalis, on the island of Lemnos, makes a lively, aromatic retsina with organic muscat of Alexandria grapes, grown in stony volcanic soils. Why muscat of Alexandria?\n  “It’s the only white grape they have on the island,” said Aris Soultanos of  Eklektikon, Garalis’s American importer.\n Eklektikon’s aim, Mr. Soultanos said, is to revive Greek traditions through the wines it imports. He seeks out small producers who are working both with indigenous grapes and styles, who are farming organically or biodynamically, and who make wines with a minimal amount of intervention.\n That includes retsinas. In addition to the Garalis retsina, Eklektikon also imports two retsinas from  Georgas Family, which farms about 11 acres biodynamically in the town of Spata, east of Athens. One, the Georgas Traditional retsina, is made with a small amount of sulfur dioxide, a stabilizer used in most commercial wines, and is minimally filtered. It will make its first appearance in New York in about a month or so.\n  The other, the Georgas Black Label, is made without any sulfur dioxide or filtering, and the grape juice is allowed to macerate with the skins before fermentation to give the wine a bit of color and texture. Not unexpectedly, the Black Label is a cloudy wine, resonant with pine flavors. On the palate it is rich and mildly pungent, an altogether delightful combination.\n The Traditional is a little narrower in flavor and more focused texturally. With filtering, it’s as clear as any modern white wine.\n For his target market, Mr. Soultanos is aiming more at restaurants and bars featuring natural wines than at Greek restaurants.\n “It’s a natural wine, but a uniquely Greek natural wine,” he said of the Georgas Family Black Label. The demand has been so great for this small-production wine, he said, that it may be the first retsina available only in small allocations.\n Until it sold out, it had been on the list at  Saint Julivert Fisherie, a seafood restaurant that opened last September in Cobble Hill, Brooklyn. A new shipment is expected in the next few weeks.\n “I’m a huge fan of this wine, and it’s great with the food we serve,” said Alex Raij, the chef and co-owner with her husband, Eder Montero.\n Daniel Stickler, the wine captain, says he can divide his guests into two groups: those 35 and up, who have bad memories of retsina, and a younger group that knows nothing about retsina. Generally, he said, he explains how the wine was made and the Greek tradition. Most guests are then willing to sample it.\n  What sets these wines apart from mass-market retsinas is the obvious quality of the wine itself. At  Kiki’s, an excellent Greek tavern in Chinatown, I tried Malamatina, one of the better mass-produced retsinas. The resinous taste was pungent and pure, and it completely dominated the wine, a thin savatiano.\n “In Greece, nobody blinks if you put Coca-Cola in it,” said Kiki Karamintzas, an owner.\n The poor, beleaguered savatiano grape has borne the brunt of criticism as a vehicle for bad retsina, but Mr. Soultanos of Eklektikon insists that it can make good wine if grown properly and vinified carefully. It does not exhibit flamboyant aromas. Rather, it’s more about texture and subtlety, he said.\n The 2017 Georgas Black Label savatiano, made just like the Black Label retsina but without the addition of resin, is a gorgeous wine, cloudy, rosy in color and rich with spicy citrus flavors.\n Both the Black Label savatiano and the retsina were from the 2017 vintage, but Greek labeling laws do not permit retsinas to be vintage wines, so they cannot be labeled with a year. Mr. Paraskevopoulos of Gaia said this was a problem.\n “The unfortunate fact is that retsinas do not age well,” he said. “Retsinas should be consumed within the year of their production. Not being allowed to print their vintage doesn’t really help.”\n I have not yet tested that hypothesis, so further research awaits. If you want to explore retsina, Ritinitis Nobilis from Gaia is a great place to start. Aside from the excellent Georgas and Garalis retsinas, I also recommend Tetramythos and Kechris’s Tear of the Pine.", "posttime": "2020-08-10 02:26:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "oxymoron,retsina,葡萄酒", "title": "伟大的Retsina，一个不再是Oxymoron的人", "title_en": "Great Retsina, an Oxymoron No More", "transed": 1, "url": "https://www.nytimes.com/2019/01/17/dining/drinks/retsina-wine-greece.html", "via": "", "real_tags": ["oxymoron", "retsina", "葡萄酒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：最近的研究表明，深度学习神经网络(DNNs)容易受到人类视觉系统无法感知的微小扰动的影响，但会欺骗DNN模型，导致错误的输出。提出了一类在不同环境下产生鲁棒物理扰动的对抗性攻击网络算法。这些算法是通过提供一条训练未来防御网络的途径来推进安全深度学习的第一次努力，然而，它们固有的复杂性阻碍了它们的广泛应用。在本文中，我们提出了第一个基于忆阻器交叉开关阵列的硬件加速器来应对恶意攻击。我们的设计显著提高了视觉对抗性扰动系统的吞吐量，可以进一步提高未来深度学习系统的健壮性和安全性。基于算法的唯一性，我们提出了四种恶意攻击加速器($A^3$)的实现，以提高吞吐量、能量效率和计算效率。", "note_en": "Download PDF  Abstract: Recent studies identify that Deep learning Neural Networks (DNNs) arevulnerable to subtle perturbations, which are not perceptible to human visualsystem but can fool the DNN models and lead to wrong outputs. A class ofadversarial attack network algorithms has been proposed to generate robustphysical perturbations under different circumstances. These algorithms are thefirst efforts to move forward secure deep learning by providing an avenue totrain future defense networks, however, the intrinsic complexity of themprevents their broader usage. In this paper, we propose the first hardware accelerator for adversarialattacks based on memristor crossbar arrays. Our design significantly improvesthe throughput of a visual adversarial perturbation system, which can furtherimprove the robustness and security of future deep learning systems. Based onthe algorithm uniqueness, we propose four implementations for the adversarialattack accelerator ($A^3$) to improve the throughput, energy efficiency, andcomputational efficiency.", "posttime": "2020-08-10 02:26:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,硬件,深度学习,学习,accelerator", "title": "深度学习神经网络对抗性攻击的硬件加速器", "title_en": "Hardware Accelerator for Adversarial Attacks on Deep Learning Neural Networks", "transed": 1, "url": "https://arxiv.org/abs/2008.01219", "via": "", "real_tags": ["神经网络", "硬件", "深度学习", "学习"]}, {"category": "", "categoryclass": "", "imagename": "a9f104b8a89a47ded143abcf9d02419a.jpeg", "infoid": 1017216, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的政府数据显示，截至5月初，英国封锁造成的死亡人数中，每三人中就有两人死于冠状病毒。\n据估计，截至5月1日，已有1.6万人死于错过医疗护理，而同期冠状病毒导致2.5万人死亡。\n这些数字包括6000人，他们在封锁最严重的时候没有参加A&A；E，因为他们担心自己可能会感染病毒，而且因为宣扬“留在家里，保护NHS，拯救生命”的信息，他们觉得应该留在家里。\n同样，据认为，由于提前出院和无法获得危重护理，已有1万人在疗养院死亡。\n报告还发现，由于更健康的生活方式，更少的儿童传染病，空气污染的下降和道路死亡的减少，封锁期间可能拯救了2500人的生命。\n7月中旬提交给政府紧急情况科学咨询小组(SAGE)的新数据是由卫生部、国家统计局(ONS)、政府精算师部门和内政部计算得出的。\n该报还估计，由于医疗保健限制，到下个月可能还会有2.6万人死亡。\n研究人员预测，由于对非紧急选择性医疗的等待时间更长，以及病毒危机导致的经济衰退的影响，在未来50年内，总共有81500人可能会失去生命。\n在接下来的五年里，预计还会有1400人因为被诊断出癌症太晚而死亡。\n尽管延迟医疗造成的中长期死亡人数尚未量化，但同一团队早些时候的一份报告显示，死亡人数可能高达18.5万人。\n这份报告是最新一份显示封锁影响严重的报告，给政府带来了更大的压力，要求其避免今年冬天在全国范围内进一步实施限制(见下文视频)。\n慈善机构和医疗组织一直警告说，将NHS如此多的精力集中在冠状病毒上会带来长期危险。\n英国皇家外科学院院长尼尔·莫滕森教授警告说，医疗服务机构再也不能只提供冠状病毒服务了。\n他说：我们必须首先处理临床上最紧急的病人，然后尽快处理那些等待时间最长的病人。在常规冬季压力出现之前，8月和9月的这段时间对于取得进展至关重要。“。\n英国政府周五发布的新的疫情复制估计显示，英国各地的病毒数量略高于上周--目前在0.8至1.0之间，高于上周的0.8至0.9。英格兰的利率保持在0.8至1.0之间不变。\n这些数字还估计增长率在0%到-5%之间，这意味着新感染人数在保持稳定和每天减少5%之间。\n这些数据是基于测试数据、住院人数、重症监护入院人数和死亡人数，比目前的情况晚了大约两到三周，这表明这是7月中旬的情况。\nSage表示，它不确定目前的疫情数字是否低于1，但警告称，当疾病发病率较低或人口数量变化较大时(例如在局部疫情期间)，该指标在确定疫情状态方面用处较小。\n诺丁汉大学(University Of Nottingham)传染病流行病学名誉教授基思·尼尔(Keith Neal)表示：在病例数量较少的情况下做出估计变得越来越困难，也越来越不准确，因此估计的范围很大。\n对于这个国家的许多地区来说，感染率在继续下降，但需要继续谨慎和避免高危混合。\n来自国家统计局(ONS)感染试点调查的最新监测数据也表明，冠状病毒病例现在正在持平或下降。\n上周，英国国家统计局拭子检测显示，每1500人中就有1人感染-比前一周略有上升，这也是鲍里斯·约翰逊(Boris Johnson)呼吁暂停取消更多限制的原因之一(见下面的视频)。\n然而，周五的结果表明，在7月27日至8月2日的一周内，病例已降至1900人中有一人感染，估计有28,300人感染-低于前一周的35,700人。\n该调查的联合负责人凯瑟琳·肯特(Katherine Kent)表示：尽管我们仍报告称，自6月下旬有记录以来，英国的感染人数有所上升，但本周的估计表明，与我们上周公布的数据相比，这一趋势可能正在趋于平稳。\n来自英国公共卫生组织的监测数据也表示，病毒似乎是稳定的。本周英国发现的病例稳定在4605例，而前一周为4625例。\n周五，政府表示，在英国冠状病毒检测呈阳性后，已有46,511人在医院、疗养院和更广泛的社区死亡。英国国家统计局发布的另一项数据显示，在死亡证明上提到冠状病毒的英国，目前已有56600人死亡。\n每日电讯报重视您的评论，但恳请所有帖子都是主题、建设性和尊重的。请检查我们的评论政策。", "note_en": "The UK lockdown killed two people for every three whose deaths had been caused by coronavirus by the beginning of May, new Government figures suggest.\n The estimates show that 16,000 people had died through missed medical care by May 1, while coronavirus killed 25,000 in the same period.\n The figures include 6,000 people who  did not attend A&amp;E at the height of lockdown because of fears they might catch the virus and the feeling they should remain at home because of the  &#34;Stay Home, Protect the NHS, Save Lives&#34; message.\n Likewise, 10,000 people are thought to have  died in care homes due to early discharge from hospital and not being able to access critical care.\n  The report also found that 2,500 lives may have been saved during lockdown because of healthier lifestyles, fewer infectious diseases in children, falls in air pollution and a decrease in road deaths.\n The new figures – presented to the Government&#39;s Scientific Advisory Group for Emergencies (Sage) in the middle of July – were calculated by the Department of Health, the Office for National Statistics (ONS), the Government Actuary&#39;s Department and the Home Office.\n The paper also estimates that a further 26,000 people could die by next month because of the healthcare restrictions.\n In total, researchers predict that 81,500 people could lose their lives in the next 50 years through waiting longer for non-urgent elective care and the impact of the recession caused by the virus crisis.\n In the next five years, 1,400 people are also expected to die because they were  diagnosed with cancer too late.\n Although the medium to long-term deaths from delayed healthcare have not been quantified, an earlier report by the same team suggested they could be as high as 185,000.\n The report is the latest to show that  the impact of lockdown has been severe, and puts more pressure on the Government to avoid further nationwide  restrictions this winter (see video below).\n  Charities and medical organisations have consistently warned of the long term dangers of focusing so much of the NHS on coronavirus.\n Professor Neil Mortensen, the president of the Royal College of Surgeons of England, warned that the health service &#34;must never again be a coronavirus-only service&#34;.\n &#34;We have to deal first with the most clinically urgent patients, and then as soon as possible with those who have been waiting the longest,&#34; he said. &#34;The period through August and September is vitally important in making progress before routine winter pressures emerge.”\n New reproduction estimates for the pandemic, published by the Government on Friday, suggest  the &#39;R&#39; number is slightly higher across Britain than last week – now at between 0.8 and 1.0, up from 0.8 to 0.9 last week. The rate for England has remained unchanged at between 0.8 and 1.0.\n The figures also estimated a growth rate of between 0 per cent to -5 per cent, meaning the number of new infections is somewhere between remaining stable and shrinking by five per cent every day.\n The data is based on testing data, hospital admissions, intensive care admissions and deaths and is around two to three weeks behind the current situation, suggesting this was the picture in mid-July.\n Sage said it was not confident that the &#39;R&#39; number was currently below one but warned that the indicator is less useful in determining the state of the epidemic when disease incidence is low or where there is significant variability in the population – for example during  local outbreaks.\n Professor Keith Neal, emeritus professor of the epidemiology of infectious diseases at the University of Nottingham, said: &#34;Making estimates of &#39;R&#39; with small number of cases becomes increasingly difficult and inaccurate, hence the wide range of the estimates.\n &#34;For many parts of the country, infection rates continue to fall, but caution and avoidance of high-risk mixing needs to continue.&#34;\n The latest surveillance figures from the Office for National Statistics (ONS) Infection Pilot Survey also suggest cases of coronavirus are now levelling off or falling.\n Last week, ONS swab testing suggested that 1 in 1,500 people were infected – a slight rise from the previous week, and one of the reasons that Boris Johnson called a halt to the lifting of more restrictions (see video below).\n  However, Friday’s results suggest cases have fallen to one in 1,900 for the week of July 27 to August 2, with an estimated 28,300 infected – down from 35,700 the previous week.\n Katherine Kent, the co-head of the survey, said: &#34;Although we are still reporting an increase in England since the lowest recorded level of infection in late June, this week&#39;s estimates suggest this trend may be levelling off when compared with the data we published last week.&#34;\n Surveillance data from Public Health England also said the virus appeared to be stable. Case detections in England were stable at 4,605 this week compared to 4,625 the previous week.\n On Friday, the Government said 46,511 people had died in hospitals, care homes and the wider community after testing positive for coronavirus in the UK. Separate figures, published by the ONS, show there have now been 56,600 deaths registered in the UK where coronavirus was mentioned on the death certificate.\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2020-08-10 02:25:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,killed,英国", "title": "封锁高峰时每三名死于冠状病毒的人中就有两人死亡", "title_en": "Lockdown 'killed two people for every three who died of coronavirus' at peak", "transed": 1, "url": "https://www.telegraph.co.uk/news/2020/08/07/lockdown-killed-two-three-died-coronavirus/", "via": "", "real_tags": ["病毒", "冠状病毒", "killed", "英国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017214, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：抽样调查我们宇宙历史的概率分布P代表了一种关于一切的理论。我们假设P是形式可描述的。由于大多数(不计其数的许多)分布都不是，这就造成了强烈的归纳偏差。我们证明了对于任何缺少简短描述的宇宙x，P(X)都是小的，并研究了两个P跨越的脚趾的谱，一个反映了最紧凑的构造性描述，另一个反映了计算一切的最快方法。前者源于传统的可计算性、Solomonoff的算法概率、Kolmogorov复杂性和比Chaitin的Omega更随机的对象，后者来自Levin的普遍搜索和面向自然资源的假设：该优化算法在时间t内无法计算的所有x的累积先验概率应该是1/t。在这两个P之间，我们找到了支配传统可计数度量的通用累积可计数度量；我们为进化的观察者、归纳推理、量子物理、哲学和我们宇宙的预期持续时间推导出P特定的结果。", "note_en": "Download PDF  Abstract: The probability distribution P from which the history of our universe issampled represents a theory of everything or TOE. We assume P is formallydescribable. Since most (uncountably many) distributions are not, this imposesa strong inductive bias. We show that P(x) is small for any universe x lackinga short description, and study the spectrum of TOEs spanned by two Ps, onereflecting the most compact constructive descriptions, the other the fastestway of computing everything. The former derives from generalizations oftraditional computability, Solomonoff&#39;s algorithmic probability, Kolmogorovcomplexity, and objects more random than Chaitin&#39;s Omega, the latter fromLevin&#39;s universal search and a natural resource-oriented postulate: thecumulative prior probability of all x incomputable within time t by thisoptimal algorithm should be 1/t. Between both Ps we find a universalcumulatively enumerable measure that dominates traditional enumerable measures;any such CEM must assign low probability to any universe lacking a shortenumerating program. We derive P-specific consequences for evolving observers,inductive reasoning, quantum physics, philosophy, and the expected duration ofour universe.", "posttime": "2020-08-10 01:00:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithmic,宇宙", "title": "万物的算法理论", "title_en": "Algorithmic Theories of Everything", "transed": 1, "url": "https://arxiv.org/abs/quant-ph/0011122", "via": "", "real_tags": ["算法", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017213, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2017年，美国海军在其中东总部破获了一个性交易网络。“军事时报”对接下来发生的事情进行了调查。", "note_en": "In 2017, the U.S. Navy uncovered a sex-trafficking network at its Middle East HQ. Military Times investigates what happened next.", "posttime": "2020-08-10 01:00:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,交易,海军,sex", "title": "美国海军在巴林的性交易丑闻", "title_en": "U.S. Navy Sex-Trafficing Scandal in Bahrain", "transed": 1, "url": "https://www.militarytimes.com/bahrain-scandal/", "via": "", "real_tags": ["美国", "交易", "海军", "sex"]}, {"category": "", "categoryclass": "", "imagename": "7499258361dad4de8b49b2c7c44bf861.png", "infoid": 1017212, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华为是一家独立的私人持股公司。我们不属于或控制于政府或任何其他第三方公司，也不隶属于政府或其他任何第三方公司。\n事实上，华为由我们的员工通过从一开始就实施的员工持股计划(ESOP)拥有。没有人不在华为工作就不能拥有股份，截至2018年，共有96768名持股员工。我们的创始人任正非拥有该公司1.14%的股份。\n股票赋予投票权。持股员工选举成员组成一个代表委员会，每持有一股就有一票。然后，委员会选举公司的董事会和监事会。在2019年1月的上一次选举中，86514名持股员工在全球416个投票站投票选举了115名代表。\n员工持股对我们的快速发展起到了重要作用。多年来，它激励了我们忠诚的员工，并帮助我们吸引了人才。与许多公有公司不同的是，华为的决定并不是基于对季度回报和年度股息的需求。", "note_en": "Huawei is an independent, privately-held company. We are not owned or controlled by, nor affiliated with the government, or any other 3rd party corporation.\n In fact, Huawei is owned by our employees through an Employee Stock Ownership Program (ESOP) that has been in place since the beginning. No one can own a share without working at Huawei, and as of 2018 there were 96,768 shareholding employees. Our founder, Ren Zhengfei, owns a 1.14% stake in the company.\n Shares confer voting rights. Shareholding employees elect members to form a Representatives&#39; Commission, getting one vote for each share held. Then the Commission elects the company’s Board of Directors and Supervisory Board. At the last election in January 2019, 86,514 shareholding employees voted to elect 115 representatives at 416 polling stations around the world.\n Employee-ownership is instrumental to our rapid growth. Over the years, it has offered an incentive to our loyal employees and helped us attract talented people. Unlike many publicly-owned companies, Huawei’s decisions are not based on the need for quarterly returns and annual dividends.", "posttime": "2020-08-10 01:00:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥有,owns,员工", "title": "谁拥有华为？", "title_en": "Who Owns Huawei?", "transed": 1, "url": "https://www.huawei.com/en/facts/question-answer/who-owns-huawei", "via": "", "real_tags": ["拥有", "owns", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就其核心而言，Portmaster位于您的内核上，只是简单地拦截您的所有网络连接。您可以根据需要决定要启用或禁用哪些隐私功能。\n因为Portmaster位于您的内核上，所以您最终可以保护您的整个计算机，而不仅仅是您的浏览器。是否要阻止整个操作系统的广告和分析？还是整个国家？港口管理员会掩护你的。\n您的内核是您计算机的重要组成部分，因此鼓励您验证我们的声明。\n完全切断应用程序与互联网的连接，阻止系统进程或仅将应用程序限制在特定的域中。\n即使没有入侵连接，您也可能不想公开共享您的DNS请求。使用Portmaster，您可以轻松地将所有DNS查询重新路由到您选择的DNS-over-TLS提供商。\n一只鞋不能适合所有人。这就是您可以随意启用或禁用隐私功能的原因。最棒的是什么呢？一切都是自由和开源软件。\n你也可以免费使用所有的本地功能，只有最酷的SPN需要订阅才能解锁。\nPortmaster仍处于早期开发阶段。虽然有些功能可能仍然有缺陷，但它运行相当稳定，可以很容易地再次卸载。我们将在进行过程中推送更新和修复。有限的支持可用，见下文。\n请报告Portmaster存储库的技术问题，Portmaster-UI Repo上的用户界面问题，并在Reddit上寻求帮助。\n这些平台是兼容的，但并非所有功能都已实现或测试。遇到未知问题的可能性很高。UI组件可能受损或完全损坏。下面列出了我们了解的问题：\n通过时事通讯保持联系我同意Safing&amp；Rapidmail.de可以出于时事通讯的目的处理和使用电子邮件。", "note_en": "At its core, the Portmaster sits on your kernel and simply intercepts all your network connections. You decide which privacy features you want to enable or disable as you desire.\n  Since the Portmaster sits on your kernel, you can finally protect your whole computer, not just your browser. Do you want to block Ads and Analytics for your whole operating system? Or whole countries? The Portmaster has you covered.\n  Your kernel is a cricital part of your computer, so be encouraged to validate our claims.\n  Cut off apps from the Internet entirely, block system processes or limit applications to specific domains only.\n  Even with invasive connections gone, you might not want to share your dns requests out in the open. With the Portmaster, you can easily re-route all your dns queries to a DNS-over-TLS provider of your choice.\n  One shoe does not fit all. That is why you can enable or disable privacy features at your will. And the best thing? Everything is FOSS, free and open-source software.\n  You can use all local features free of charge as well, only the coolest one, the SPN, requires a subscription to unlock.\n The Portmaster is still in its early &#34;alpha&#34; development stage. While some features might still have bugs, it runs quite stable and can easily be uninstalled again. We&#39;ll push updates and fixes as we go. Limited support is available, see below.\n    Please report technical issues on the  portmaster repository, problems with the user interface on the  portmaster-ui repo and ask for help on  Reddit\n  These platforms are compatible, but not all functionality is implemented or tested.  Probability of encountering unknown issues is high. UI components may be impaired or completely broken. Issues we know about are listed:\n  Stay Connected via Newsletter  I agree that Safing &amp;   rapidmail.de  may proccess and use the email for newsletter purposes.", "posttime": "2020-08-10 01:00:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "端口,portmaster", "title": "端口管理员", "title_en": "Portmaster", "transed": 1, "url": "https://safing.io/portmaster/", "via": "", "real_tags": ["端口"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分形董事会提供了一种新的信息组织方式，建立在特雷洛推广的董事会概念的基础上。它是对这一熟悉概念的一种不同而强大的理解，它已经在改变Workflow用户组织大脑的方式。", "note_en": "Fractal boards offer a new way to organize information, building upon the concept of boards popularized by Trello. It&#39;s a different and powerful take on this familiar concept, and it&#39;s already changing the way Workflowy users organize their brains.", "posttime": "2020-08-10 00:59:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "递归,support,董事会", "title": "对电路板的工作流支持，带递归", "title_en": "Workflowy Support for Boards, with Recursion", "transed": 1, "url": "https://workflowy.com/post/fractal-boards/", "via": "", "real_tags": ["递归", "support", "董事会"]}, {"category": "", "categoryclass": "", "imagename": "78d790226158721dcbebf6d662af2d69.jpg", "infoid": 1017206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我以前的保险业高管生涯中，我的工作就是在美国人的医疗保健问题上欺骗他们。我误导人们保护利润。事实上，作为一名企业宣传员，我的主要目标之一就是为“提升股东价值”尽自己的一份力。这项工作直接促成了一种更少人参保的氛围，这塑造了我们国家与冠状病毒的斗争，只有在每个人都愿意并能够接受治疗的情况下，我们才能与之抗争。如果像我这样的发言人没有拿到钱来掩盖有关美国和加拿大医疗体系差异的重要事实，数万在大流行中死亡的美国人可能还活着。\n2007年，我在信诺担任企业公关副总裁。那年夏天，迈克尔·摩尔(Michael Moore)正准备发行他的最新纪录片“西科”(Sicko)，将美国的医疗保健与其他富裕国家的医疗保健进行对比。(自然，我们看起来很糟糕。)。我花了几个月的时间与其他大型保险公司的同行秘密会面，策划我们对这部电影的攻击，其中有许多关于被拒绝承保重要治疗的患者的轶事。3岁的安妮特·诺伊(Annette Noe)就是一个例子。当她的父母要求信诺支付两个可以让她听力的人工耳蜗植入费用时，我们同意只覆盖一个。\n显然，我和我的同事需要一个强有力的辩护。在该行业最大的行业协会美国健康保险计划(AHIP)的一个特别工作组中，我们讨论了如何让加拿大、法国、英国甚至古巴的医疗体系看起来与我们的一样糟糕。我们招募了一家大型公关公司APCO Worldwide。那里的特工与AHIP合作，为像我这样的公司侧翼整理了一份夹层谈话要点的活页夹，供我在新闻发布会和对记者发表声明时使用。\n以下是活页夹中的一份AHIP简报中的一个例子：“2004年5月的一项民意调查发现，87%的加拿大商界领袖如果有紧迫的医疗问题，会支持在政府系统之外寻求医疗保健。”消息来源是行业支持的太平洋研究所(Pacific Research Institute)所长萨利·皮普斯(Sally Pipes)2004年出版的一本书，书名为“奇迹疗法：如何解决美国的医疗危机以及为什么加拿大不是答案”(Miracle Cure：How to Solution American‘s Health Care Crisis)。同一本书中的另一个要点援引加拿大放射学家协会首席执行官的话说：“加拿大的放射设备太差了，‘如果不立即采取行动，放射科医生将无法再保证检查的可靠性和质量。’”\n这在很大程度上与许多美国人的经历背道而驰，特别是数百万利用加拿大低药价来满足处方需求的人。但对这些说法持怀疑态度的还有更具体的原因。例如，我们不知道是谁进行了2004年的调查，也不知道任何关于样本量或方法的事情-甚至不知道用什么标准来确定谁有资格成为“商业领袖”。我们不知道关于成像设备的断言是基于可靠的数据还是只是一种观点。你可以很容易地在美国医院找到类似的关于过时设备的投诉。\n(华盛顿邮报联系到AHIP的一位发言人说，这种观点是“来自ACA之前的过去”。我们着眼于未来，建立在可行的基础上，修复无效的。“。他补充说，该组织“相信每个人都应该得到负担得起的、高质量的保险和护理--无论健康状况、收入或先前存在的状况如何。”APCO Worldwide的一位发言人告诉“华盛顿邮报”，该公司“一直在支持我们的客户发展医疗保健系统。”我们为我们的工作感到自豪。“。信诺没有回复记者的置评请求。)。\n然而，在那一年的大部分时间里，我都是作为一名行业发言人，这是我在这个行业工作20年后的最后一次，向记者和立法者传播AHIP的“信息”，以制造我们的医疗体系远远优于加拿大的印象，我们希望人们相信加拿大的医疗体系正处于崩溃的边缘。这场运动奏效了。新闻媒体开始报道对加拿大制度持负面看法的故事。2009年初，当民主党人开始起草后来成为“平价医疗法案”(Affordable Care Act)的法案时，他们没有认真考虑过像加拿大这样由公共资金资助的体系。我们如此成功地将这个想法定义为激进，以至于时任参议院财政委员会(Senate Finance Committee)主席的民主党参议员马克斯·鲍卡斯(Max Baucus)在一次听证会上将支持单一支付者的人赶出了听证会。\n今天，加拿大和美国各自对冠状病毒大流行的反应证明了我帮助传播的想法是多么错误。美国人均冠状病毒感染人数是加拿大的三倍多，死亡率是加拿大的两倍。虽然我们现在人均测试的人数更多，但我们的北方邻国在测试上取得的成功要早得多，这帮助我们取得了不同的成就。\n我们延续的最有效的神话-每当提出重大改革时，该行业都会抛出-是加拿大人和其他单一支付者国家的人们不得不忍受漫长的等待，等待所需的护理。就在去年，在提交给国会委员会就2019年全民医疗保险法案举行听证会的一份声明中，AHIP坚持认为，在单一付款人制度下，“患者将支付更多费用，等待更长时间的更差医疗”。\n虽然加拿大人有时确实需要等待数周或数月的选择性手术(经常引用膝盖置换手术)，但事实是，他们根本不必等待绝大多数的医疗服务。而且，与我过去兜售的另一个神话-加拿大医生正蜂拥到美国-相反，加拿大每1000人中有更多的医生比这里多。加拿大人平均每年看医生6.8次，而这个国家每年只有4次。\n最重要的是，在加拿大没有人会因为缺乏资金而拒绝医生，加拿大人可以接受冠状病毒检测和治疗，而不用担心收到违反预算的医疗账单。这无疑是加拿大新冠肺炎死亡率比我们低得多的原因之一。在美国，过高的账单是我们医疗保健系统的一个决定性特征。根据众多报道，尽管特朗普总统和国会议员保证，新冠肺炎患者不会因为检测或治疗而被收取费用，但他们还是被套上了巨额账单。\n加拿大的情况并非如此，那里的保险福利没有自付、免赔额或共同保险。在服务点是免费的。那些在加拿大下岗的人也不用担心失去医疗保险。相比之下，在美国，超过4000万人在这场大流行中失去了工作，其中数百万人-以及他们的家人-也失去了保险。\n然后是医疗质量问题。从很多方面来看，加拿大的情况要好得多。一些例子：加拿大因糖尿病(几乎是这里的两倍)和高血压(超过美国的八倍)等可预防的原因住院的比率远远低于美国。尽管加拿大在人均医疗保健方面的支出不到我们的一半，但该国的预期寿命为82岁，而美国为78.6岁。\n当大流行到达北美时，加拿大医院比许多美国医院更好地为患者的涌入做好了准备。加拿大医院在年度全球预算下运营-固定支付通常在省和地区两级分配，以支付运营费用。加拿大增加个人防护装备的速度比我们快得多。\n对于我曾经的谋生行为，我有很多遗憾，其中最大的一个是诽谤加拿大的医疗保健系统。如果美国在2009年(或自那以后的任何时候)进行一项不同的改革，一种不依赖于私人保险公司的改革，这些公司有充分的动机限制他们支付的费用，我们今天的国家会更健康。没有保险的生活极大地增加了你不必要地死亡的机会。在过去的13年里，数以万计的美国人可能过早死亡，因为与我们北方的邻国不同，他们要么没有保险，要么没有足够的保险，以至于他们负担不起所需的医疗费用。我每天都生活在那种恐怖中，以及我在其中扮演的角色。", "note_en": "In my prior life as an insurance executive, it was my job to deceive Americans about their health care. I misled people to protect profits. In fact, one of my major objectives, as a corporate propagandist, was to do my part to “enhance shareholder value.” That work contributed directly to a climate in which fewer people are insured, which has shaped our nation’s struggle against the  coronavirus, a condition that we can fight only  if everyone is willing and able to get medical treatment. Had spokesmen like me not been paid to obscure important truths about the differences between the U.S. and Canadian health-care systems, tens of thousands of Americans who have died during the pandemic might still be alive.\n    In 2007, I was working as vice president of corporate communications for Cigna. That summer, Michael Moore was preparing to release his latest documentary, “ Sicko,” contrasting American health care with that in other rich countries. (Naturally, we looked terrible.) I spent months meeting secretly with my counterparts at other big insurers to plot our assault on the film, which contained many anecdotes about patients who had been denied coverage for important treatments. One example was  3-year-old Annette Noe. When her parents asked Cigna to pay for two cochlear implants that would allow her to hear, we agreed to cover only one.\n  Clearly my colleagues and I would need a robust defense. On a task force for the industry’s biggest trade association, America’s Health Insurance Plans (AHIP), we talked about how we might make health-care systems in Canada, France, Britain and even Cuba look just as bad as ours. We enlisted APCO Worldwide, a giant PR firm. Agents there worked with AHIP to put together a binder of laminated talking points for company flacks like me to use in news releases and statements to reporters.\n    Here’s an example from  one AHIP brief in the binder: “A May 2004 poll found that 87% of Canada’s business leaders would support seeking health care outside the government system if they had a pressing medical concern.” The source was a 2004 book by Sally Pipes, president of the industry-supported Pacific Research Institute, titled “ Miracle Cure: How to Solve America’s Health Care Crisis and Why Canada Isn’t the Answer.” Another bullet point, from the same book, quoted the CEO of the Canadian Association of Radiologists as saying that “the radiology equipment in Canada is so bad that ‘without immediate action radiologists will no longer be able to guarantee the reliability and quality of examinations.’ ”\n    Much of this runs against the experience of many Americans, especially the millions who take advantage of low pharmaceutical prices in Canada to meet their prescription needs. But there were more specific reasons to be skeptical of those claims. We didn’t know, for example, who conducted that 2004 survey or anything about the sample size or methodology — or even what criteria were used to determine who qualified as a “business leader.” We didn’t know if the assertion about imaging equipment was based on reliable data or was an opinion. You could easily turn up  comparable complaints about outdated equipment at U.S. hospitals.\n  (Contacted by The Washington Post, an AHIP spokesman said this perspective was “from the pre-ACA past. We are future focused by building on what works and fixing what doesn’t.” He added that the organization “believes everyone deserves affordable, high-quality coverage and care — regardless of health status, income, or pre-existing conditions.” An APCO Worldwide spokesperson told The Post that the company “has been involved in supporting our clients with the evolution of the health care system. We are proud of our work.” Cigna did not respond to requests for comment.)\n    Nevertheless, I spent much of that year as an industry spokesman, my last after 20 years in the business,  spreading AHIP’s “information” to journalists and lawmakers to create the impression that our health-care system was  far superior to Canada’s, which we wanted people to believe was on the verge of collapse. The campaign worked. Stories began to appear in the press that cast the Canadian system in a negative light. And when Democrats began writing what would become the Affordable Care Act in early 2009, they gave no serious consideration to a publicly financed system like Canada’s. We succeeded so wildly at defining that idea as radical that Sen. Max Baucus (D-Mont.), then chair of the Senate Finance Committee, had single-payer supporters  ejected from a hearing.\n  Today, the respective responses of Canada and the United States to the coronavirus pandemic prove just how false the ideas I helped spread were. There are more than three times as many coronavirus infections per capita in the United States, and the mortality rate is twice the  rate in Canada. And although we now test more people per capita, our northern neighbor had much earlier successes with testing, which helped make a difference throughout the pandemic.\n    The most effective myth we perpetuated — the industry trots it out whenever major reform is proposed — is that Canadians and people in other single-payer countries have to endure long waits for needed care. Just last year, in a  statement submitted to a congressional committee for a hearing on the Medicare for All Act of 2019, AHIP maintained that “patients would pay more to wait longer for worse care” under a single-payer system.\n  While it’s true that Canadians sometimes have to wait weeks or months for elective procedures (knee replacements are often cited), the truth is that they  do not have to wait at all for the vast majority of medical services. And, contrary to another myth I used to peddle — that Canadian doctors are flocking to the United States — there are  more doctors per 1,000 people in Canada than here. Canadians see their doctors an average of  6.8 times a year, compared with just four times a year in this country.\n    Most important, no one in Canada is turned away from doctors because of a lack of funds, and Canadians can get tested and treated for the coronavirus without fear of receiving a budget-busting medical bill. That undoubtedly is one of the reasons Canada’s covid-19 death rate is so much lower than ours. In America, exorbitant bills are a defining feature of our health-care system. Despite the assurances from President Trump and members of Congress that covid-19 patients will not be charged for testing or treatment, they are on the hook for  big bills, according to numerous  reports.\n  That is not the case in Canada, where there are no co-pays, deductibles or coinsurance for covered benefits. Care is free at the point of service. And those laid off in Canada don’t face the worry of losing their health insurance. In the United States, by contrast, more than  40 million have lost their jobs during this pandemic, and millions of them — along with their families — also lost their coverage.\n    Then there’s quality of care. By numerous measures, it is better in Canada. Some examples: Canada has far lower rates than the United States of  hospitalizations from preventable causes like diabetes (almost twice as common here) and hypertension (more than eight times as common). And even though Canada spends less than half what we do per capita on health care, life expectancy there is 82 years, compared with 78.6 years in the United States.\n  When the pandemic reached North America, Canadian hospitals, which operate under annual  global budgets — fixed payments typically allocated at the provincial and regional levels to cover operating expenses — were  better prepared for the influx of patients than many U.S. hospitals. And Canada ramped up production of personal protective equipment much more quickly than we did.\n  Of the many regrets I have about what I once did for a living, one of the biggest is slandering Canada’s health-care system. If the United States had undertaken a different kind of reform in 2009 (or anytime since), one that didn’t rely on private insurance companies that have every incentive to limit what they pay for, we’d be a healthier country today. Living without insurance  dramatically increases your chances of dying unnecessarily. Over the past 13 years, tens of thousands of Americans have probably died prematurely because, unlike our neighbors to the north, they either had no coverage or were so inadequately insured that they couldn’t afford the care they needed. I live with that horror, and my role in it, every day.", "posttime": "2020-08-10 00:31:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "医疗保健,care,加拿大", "title": "医疗保健恐慌", "title_en": "The health care scare", "transed": 1, "url": "https://www.washingtonpost.com/outlook/2020/08/06/health-insurance-canada-lie/", "via": "", "real_tags": ["医疗保健", "care", "加拿大"]}, {"category": "", "categoryclass": "", "imagename": "dd2d064efb6233b567c6ecd1c29c01e9.png", "infoid": 1017205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "探测冰上企鹅粪便污渍的卫星测绘技术显示，在快速变暖的南极洲，帝王殖民地的数量比之前发现的多了近20%。\n根据英国南极调查局科学家周三发布的一项研究，发现了11个新的该物种殖民地，使整个极地大陆的人口普查达到61个。科学家们使用来自欧洲哥白尼哨兵2号任务的图像来定位这些不会飞的鸟。\n主要作者兼地理学家彼得·弗雷特威尔在一份声明中说，这是一个令人兴奋的发现。虽然这是个好消息，但是企鹅群很小，所以总体数量只增加了5%-10%，只有50万多一点。\n帝王是最大的物种，它们在南极洲生活和繁殖，这块大陆变暖的速度比世界其他地方更快。这一发现将被科学家利用，他们正在监测这些鸟类，并提出了担忧，因为它们特别容易受到气候变化导致的海冰融化的影响。\n观察遥远的殖民地在过去是极其困难的，因为它们被发现在偏远的地方，那里的温度可以降到零下59华氏度(-50摄氏度)。在过去的十年里，英国南极调查局的科学家们通过搜索冰上的企鹅鸟粪标记来搜索冰原的图像，以寻找新的殖民地。\n科学家警告说，大多数新发现的企鹅栖息地可能会随着气候变暖而消失，企鹅交配的大片季节性冰块有消失的危险。\n因此，这些地点的鸟类很可能是煤矿里的金丝雀，BAS的保护生物学负责人菲尔·特拉森(Phil Trathan)说。我们需要仔细观察这些地点，因为气候变化将影响这个地区。", "note_en": "Satellite-mapping technology that detects stains on the ice from penguin droppings has revealed there are nearly 20% more Emperor colonies than previously identified in fast-warming Antarctica.\n   Eleven new colonies of the species were found, taking the census to 61 across the polar continent, according to a study by scientists at the British Antarctic Survey published Wednesday. The scientists used images from Europe&#39;s Copernicus Sentinel-2 mission to locate the flightless birds.\n      &#34;This is an exciting discovery,&#34; said lead author and geographer Peter Fretwell in a statement. &#34;Whilst this is good news, the colonies are small and so only take the overall population count up by 5-10%, to just over half a million penguins.&#34;\n      Emperors are the largest of the species, and they live and breed in Antarctica, a continent that&#39;s warming at a faster rate than the rest of the world. The discovery will be used by scientists who are monitoring the birds and raising concerns because they&#39;re particularly vulnerable to sea ice melting from climate change.\n          Observing far-flung colonies has been extremely difficult in the past because they are found in remote locations where temperatures can drop to -59 Fahrenheit (-50 degrees Celsius). For the past decade, scientists at the British Antarctic Survey have scouring images of ice fields for new colonies by searching for penguin guano markings on the ice.\n       Scientists warned that most of the newly found colonies are in locations likely to be lost as the climate warms and large sections of seasonal ice -- where penguins mate -- risk disappearing.\n       &#34;Birds in these sites are therefore probably the &#39;canaries in the coal mine&#39;,&#34; said Phil Trathan, head of conservation biology at BAS. &#34;We need to watch these sites carefully as climate change will affect this region.&#34;", "posttime": "2020-08-10 00:05:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,看到,poop,企鹅", "title": "从太空看到的企鹅粪便导致发现新的殖民地", "title_en": "Penguin Poop Seen From Space Leads To Discovery of New Colonies", "transed": 1, "url": "https://www.sfgate.com/business/article/Penguin-guano-seen-from-space-leads-to-discovery-15460556.php", "via": "", "real_tags": ["太空", "看到", "poop", "企鹅"]}]