[{"category": "", "categoryclass": "", "imagename": "001edc646b15af01e97c68d8171ae871.jpg", "infoid": 1067688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于许多原因，这一轮是值得注意的。首先，即使是今天的标准也是一个大的系列。融资还标志着以前在其七年历史中引发了较低的较低的外部资金。较低的是初创世界上这些天的罕见：有利可图。基于硅谷的Accel历史悠久，营业盈利，抢夺公司，也为1Password，阿特拉斯人，高音乐，网络流，工友和伽利略（由SOFI获得）的相似之处。\n 事实上，伽利略创始人粘土威尔克斯将VC公司推出到Dan Snyder，下的创始人和首席执行官。除了有利可图之外，这两家公司还有一些共同的事情：在采取机构资本之前，他们都在举行多年，两者都有总部在硅谷外面。\n  “我们立即感兴趣，因为基于俄亥俄州的较低呼应，”John Locke的Accel Partner John Locke说，较低，并作为投资的一部分占据公司董事会的席位。 “就像伽利略一样，较低的将是全球最成功的投机公司之一。在全球范围内的非传统区域内建造的公司的组合和一个引导的公司提醒我们​​[其他]我们与大型系列合作的公司。“\n 据较低，还有其他未命名的参与者，但加权为投资的“大多数”提供。\n Snyder于2014年共同创立了更低，目标是为消费者制作房屋过程更简单。该公司随招待所推出，其零售品牌认为，斯奈德描述为“一种技术杠杆零售抵押贷款银行”，与房地产经纪人和建筑物等。 2018年，该公司推出了较低的网站，其直接消费者数字贷款品牌具有使其平台的使命是一个停机者可以在线上网，以保存家庭，获得或再融资抵押贷款并获得保险通过其市场。今年，它推出了带有储蓄账户的下移动应用程序。\n  多年来，据斯奈德称，下降数十亿美元在贷款中获得数十亿美元的贷款，并在2020年在2020年举行令人印象深刻的收入。\n “我们的历史可能是今天Fintech公司的一点非典型，”他告诉TechCrunch。 “我们有一个看法回到公司的开始，我们希望有利地运行它。这是我们的支柱之一，所以这就是我们所做的一切。此外，我们都在抵押贷款行业中长大，所以我们先看到了市场的大小，也是多么伤了，所以我们想改变它。“ \n在推出直接消费者数字贷款品牌时，该公司正在努力使房屋过程更加“数字，透明，更容易获得消费者访问”，斯奈德说。\n 与此同时，公司不想失去人类的触感。\n “我们试图以您在应用程序中可以获得的方式设计应用程序流程，但如果您愿意在任何时间点，请与某人交谈或聊天，我们可以使用，”斯奈德补充道。\n  据斯奈德表示，较低的典型客户是千禧一代，现在是渴望拥有他们的第一家家。\n “他们可能正在思考，”好吧，我现在可能住在一个公寓里，但在接下来的几年里，我会遇到某人和/或有一个孩子，我想解开家庭的投资，' “他告诉TechCrunch。 “我们会帮助他们在那里的旅程。”\n Lower的最近推出的新应用程序提供存款账户，它是被称为“Homefund”。息息的FDIC保存账户提供了0.75％的百分比产量，并旨在帮助消费者为家庭储存，以“奖励美元的美元兑换”，斯内德说。\n 较低的工程与超过35个主要的保险公司全国，包括全国，自由，互联网。它拥有超过1,600名员工，其中大约一半以下的家庭州为基础。这是2020年6月的大约650名员工。 \n展望未来，该公司计划添加更多服务，并具有“积极的路线图”，用于为其平台添加新功能。例如，今天，较低的销售主要是Fannie Mae和Freddie Mac。虽然它提供了大部分贷款，但与许多大型贷方一样，它使用了一个子公司。然而，这将改变2022年初，当较低的打算启动自己的本机服务平台时。\n 虽然公司打算继续赚取有利可图，但斯奈德说，他和他的联合创始人“思考时间现在正在获得分享”。\n “我们希望成为全球品牌，筹集资金并获得市场份额，”他补充道。 “我们将继续在产品上加倍加倍并建立我们的能力。我们是Fintech中最好的秘密，并计划与智能品牌，广告和赞助的改变。“\n  最后但并非最不重要的是，降低了公共市场作为其长期路线图的一部分。\n “最终，我们知道我们可以建立一个伟大的公共公司，”斯奈德告诉TechCrunch。 “我们现在是一家公共公司的规模，但我们将继续下来，我们将继续建设未来几年，然后我认为我们可以在一个地方强大的公共业务。“\n Accel的Locke指出，在美国，抵押贷款和家庭金融是最大的金融服务市场之一，主要由大型银行处理。\n “对于大多数消费者来说，通过这些银行抵押贷款继续成为一种过于复杂的，缓慢移动的过程，”洛克告诉TechCrunch。 “我们认为，通过向消费者提供巨大的移动经验，降低将获得现任银行的份额，与Monzo这样的公司在银行或Venmo中的付款或贸易共和国和股票交易中的罗马时代的方式相同。” ", "note_en": "This round is notable for a number of reasons. First off, it’s a large Series A even by  today’s standards . The financing also marks the previously bootstrapped Lower’s first external round of funding in its seven-year history. Lower is also something that is kind of rare these days in the startup world: profitable. Silicon Valley-based Accel has a history of backing profitable, bootstrapped companies, having also led large Series A rounds for the likes of 1Password, Atlassian, Qualtrics, Webflow, Tenable and Galileo (which went on to be acquired by SoFi).\n In fact, Galileo founder Clay Wilkes introduced the VC firm to Dan Snyder, Lower’s founder and CEO. The two companies have a few things in common besides being profitable: they were both bootstrapped for years before taking institutional capital and both have headquarters outside of Silicon Valley.\n  “We were immediately intrigued because Ohio-based Lower echoes both of these themes,” said Accel partner John Locke, who led the firm’s investment in Lower and is taking a seat on the company’s board as part of the investment. “Like Galileo, Lower will be one of the most successful bootstrapped fintech companies globally. The combination of a company built in a nontraditional region across the globe and a bootstrapped company reminds us of [other] companies we have partnered with for a large Series A.”\n There were other unnamed participants in the round, but Accel provided the “majority” of the investment, according to Lower.\n Snyder co-founded Lower in 2014 with the goal of making the homebuying process simpler for consumers. The company launched with Homeside, its retail brand that Snyder describes as “a tech-leveraged retail mortgage bank” that works with realtors and builders, among others. In 2018, the company launched the website for Lower, its direct-to-consumer digital lending brand with the mission of making its platform a one-stop shop where consumers can go online to save for a home, obtain or refinance a mortgage and get insurance through its marketplace. This year, it launched the Lower mobile app with a savings account.\n  Over the years, Lower has funded billions of dollars in loans and notched an impressive $300 million in revenue in 2020 after doubling revenue every year, according to Snyder.\n “Our history is maybe a little atypical of fintech companies today,” he told TechCrunch. “We’ve had a view going back to the start of the company that we wanted to run it profitably. That’s been one of our pillars, so that’s what we’ve done. Also, we all grew up in the mortgage industry, so we saw firsthand the size of the market, but also how broken it was, so we wanted to change it.”\n In launching the direct-to-consumer digital lending brand, the company was working to make the homebuying process more “ digital, transparent and easier for consumers to access,” Snyder said.\n At the same time, the company didn’t want to lose the human touch.\n “We tried to design the app flow in a way where you can get as far along as you can in the application but if you want, at any point in time, to talk or chat with someone, we’re available,” Snyder added.\n  Lower’s typical customer is the millennial and now Gen Z who’s aspiring to own their first home, according to Snyder.\n “They might be thinking, ‘OK, I might be living in an apartment now, but in the next few years I’m going to meet someone and/or have a child and I want to unlock the investment that is a home,’ ” he told TechCrunch. “And we’ll help them on that journey.”\n Lower’s recently launched new app offers a deposit account it’s dubbed “HomeFund.” The interest-bearing FDIC-insured deposit account offers a 0.75% Annual Percentage Yield and is designed to help consumers save for a home with a “dollar-for-dollar match in rewards” up to the first $1,000 saved, Snyder said.\n Lower works with more than 35 major insurance carriers nationally, including Nationwide, Liberty Mutual and Allstate. It has more than 1,600 employees, about half of which are based in Lower’s home state. That’s up from about 650 employees in June of 2020.\n Looking ahead, the company plans to add more services and has an “aggressive roadmap” for adding new features to its platform.  Today, for example, Lower sells primarily to Fannie Mae and Freddie Mac. And while it services the majority of its loans, like many large lenders, it uses a subservicer. That will change, however, in early 2022, when Lower intends to launch its own native servicing platform.\n And while the company intends to continue to run profitably, Snyder said he and his co-founders “think the time is now to gain share.”\n “We want to become a global brand, raise money and gain market share,” he added. “We’re going to continue to double down on product and build out our capabilities. We are the best-kept secret in fintech and plan to change that with smart branding, advertising and sponsorships.”\n  And last but not least, Lower is eyeing the public markets as part of its longer-term roadmap.\n “Ultimately, we know we can build a great public company,” Snyder told TechCrunch. “We’re of the scale to be a public company right now, but we’re going to keep our heads down and we’re going to keep building for the next few years and then I think we can be in a spot to be a strong public business.”\n Accel’s Locke points out  that in the U.S., mortgage and home finance are among the largest financial service markets, and they have primarily been handled by large banks.\n “For most consumers, getting a mortgage through these banks continues to be an overly complex, slow-moving process,” Locke told TechCrunch. “We believe by providing consumers a great mobile experience, Lower will gain share from incumbent banks, in the same way that companies like Monzo have in banking or Venmo in payments or Trade Republic and Robinhood in stock trading.”", "posttime": "2021-06-23 20:37:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "accel,led", "title": "在7年的第一个资金中，盈利金融技术下降筹集了100万美元的级联由Accel领导 ", "title_en": "\n\t\t\t\tIn its first funding in 7 years, profitable fintech Lower raises $100M Series A led by Accel\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/lower-raises-100m-series-a-from-accel/", "via": "", "real_tags": ["accel", "led"]}, {"category": "", "categoryclass": "", "imagename": "7db3de167e86ef7acc471d901324cd0a.jpg", "infoid": 1067687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的宣传只有几周后的赛道上推出了它的新托管数据库平台，也称为被称为PlanetsCale。该公司以前提供了托管版Vitess，但是通过这项新服务，它进一步逐步，并提供它所谓的“开发人员第一个数据库”，它摘要摘要所有基础架构，以确保开发人员不会拥有考虑云区域，群集大小和其他细节。\n 事实上，PlanetsCale Ceo和联合创始人Jiten Vaidya对本早期产品的局限性非常开放。 “我们去年建造了什么是托管Vitess，这与今天的大量云提供商提供数据库没有什么不同，”他说。 “所以这种易用性并不是这种优雅，这些优雅都不是开发商想要和期望今天的最先进的经历，我们已经建立在我们的产品中。”\n  但几个月前，该公司带来了前Github VP的工程Sam Lambert担任其首席产品官。 Vaidya指出，Lambert将很多开发人员同情推广，并帮助它推出了这款新产品。\n “人们来找你，因为他们不是数据库专家，但他们有数据，他们有问题，”兰伯特说。 “而且太多的公司，特别是在数据库世界中，不要想到他们的用户的日常生活。他们不会考虑用户实际尝试的完整旅程，这是为客户提供价值。他们对自己留下了非常深刻的印象，用于存储和检索数据。就像是，是的，我们一直这样做。自60年代以来，我们一直这样做。我们现在可以做别的吗？“\n 该公司今天的用户包括Slack，Figma，GitHub和Square的喜欢，因此它显然为大量用户提供了价值。随着Lambert的注意，Planetscale旨在为他们提供一种简单易用的产品。 “只是因为它很简单易用，而且美丽，诚实 - 就像只是美丽，设计精心的工具 - 它并不意味着它的劣等。这并不意味着它缺少任何东西。他说，这意味着其他人错过了诗歌和额外的美丽元素，即你可以添加到基础设施产品中，“他说。\n PlanetsCale计划使用新的资金来扩展其团队，并加速其平台的采用。 Insight Partners董事总经理Nikhil Sachdev将加入该公司的董事会，该公司的董事总经理前导董事Praveen Akkiraju也作为董事会观察员加入。\n “PlanetsCale正在为无服务器时代的基于云的数据库为简单，性能和可扩展性设置新栏，”Sachdev说。 “数据库的开发人员体验对于太长而痛苦。 PlanetsCale正在破坏那个链条，解决与可扩展性和可靠性相关的长期存在，以极其优雅，典雅和有用的方式。“ ", "note_en": "Today’s announcement comes only a few weeks after PlanetScale launched its new hosted database platform, also dubbed PlanetScale. The company had previously offered a hosted version of Vitess, but with this new service, it is going a step further and offering what it calls a “developer-first database” that abstracts away all of the infrastructures to ensure that developers won’t have to think about cloud zones, cluster sizes and other details.\n Indeed, PlanetScale CEO and co-founder Jiten Vaidya was quite open about the limitations of this earlier product. “What we had built last year was pretty much hosted Vitess, which was no different than how a lot of cloud providers today give you databases,” he said. “So none of this ease of use, none of this elegance, none of these state-of-the-art experiences that the developers want and expect today, we had built into our product.”\n  But a few months ago, the company brought on former GitHub VP of Engineering  Sam Lambert as its Chief Product Officer. Vaidya noted that Lambert brought a lot of developer empathy to PlanetScale and helped it launch this new product.\n “People come to you because they’re not database experts, but they have data, they have problems,” Lambert said. “And too many companies, especially in the database world, do not think about the daily lives of their users like we do. They don’t think about the complete journey of what the user is actually trying to do, which is to provide value to their customers. They’re just very impressed with themselves for storing and retrieving data. And it’s like, yep, we’ve been doing that. We’ve been doing that since the 60s. Can we do something else now?”\n The company’s users today include the likes of Slack, Figma, GitHub and Square, so it’s clearly delivering value to a lot of users. As Lambert noted, PlanetScale aims to offer them a product that is simple and easy to use. “Just because it is simple and easy to use, and beautiful, honestly — like just beautiful, well-designed tooling — it doesn’t mean it’s inferior. It doesn’t mean it’s missing anything. It means the others are missing the poetry and the additional elements of beauty that you can add to infrastructure products,” he said.\n PlanetScale plans to use the new funding to scale its team globally and accelerate the adoption of its platform. Insight Partners Managing Director Nikhil Sachdev will join the company’s board, with the firm’s Managing Director Praveen Akkiraju also joining as a board observer.\n “PlanetScale is setting a new bar for simplicity, performance and scalability for cloud-based databases in the serverless era,” said Sachdev. “The developer experience for databases has been painful for too long. PlanetScale is breaking that chain, solving longstanding problems related to scalability and reliability in an extremely elegant, tasteful, and useful way.”", "posttime": "2021-06-23 20:36:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,数据库,产品", "title": "PlanetsCale为其数据库服务筹集了30万美元的B系列 ", "title_en": "\n\t\t\t\tPlanetScale raises $30M Series B for its database service\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/planetscale-raises-30m-series-b-for-its-database-service/", "via": "", "real_tags": ["database", "数据库", "产品"]}, {"category": "", "categoryclass": "", "imagename": "efa7efa928252b1db0781fba9af8f9ab.jpg", "infoid": 1067685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为Vercel票据，该公司最近几个月出现了强劲增长，自10月2020年10月以来，其网络上的所有网站和应用程序都有流量。世界上最大的10,000个网站的一半现在使用Next.js。鉴于下一个框架的开源性质，并非所有这些用户都显然是Vercel客户，但其当前的支付客户包括Carhartt，GitHub，IBM，McDonald和优步的喜好。\n  “对我们来说，它一切都以前端开发人员开头，”Vercel Ceo Guillermo Rauch告诉我。 “我们的目标是创造和赋予那些开发人员 - 以及他们的团队 - 为他们的客户创造令人愉快的沉浸式网络体验。”\n 使用Vercel，RAUCH和他的团队拍摄了下一个.JS框架，然后建立了一个无服务器的平台，专门迎合此框架，允许开发人员专注于构建前端，而无需担心缩放和性能。\n RAUCH辩论的旧解决方案是孤立地建立的，云平台和无服务技术，将其留给开发人员部署和扩展其解决方案。虽然一些潜在的用户也可能是使用无头内容管理系统的内容，但Rauch认为，越来越多地认为，开发人员需要能够建立可以更深入的解决方案，这些解决方案比当今许多企业使用的现成解决方案更深入。\n RAUCH还指出，开发人员真的喜欢Vercel每次开发人员编辑代码时都会为网站前端生成预览URL的能力。 “所以所以，我们只是在代码审查中花费所有的时间，我们正在转移方程来花费时间审查或经历前端。这使得经验更加合作，“他说。 “所以现在，设计师，营销人员，它，首席执行官现在可以在这种建筑前端的合作中聚集在一起，说，”蓝色阴影不是蓝色的正确阴影。＆＃39;“\n “Vercel领导市场转型，我们通过它看到的大多数价值 - 在前端传送的Web和云应用程序开发中，最接近用户，在那里做出真正的经验，享受真正的经验，”创始人Geoff Lewis说并在基岩管理伙伴。 “我们非常热情地与Guillermo和无与伦比的团队密切合作，他组装出来推动这场革命，非常高兴能够联合这一轮。” ", "note_en": "As Vercel notes, the company saw strong growth in recent months, with traffic to all sites and apps on its network doubling since October 2020. About half of the world’s largest 10,000 websites now use Next.js . Given the open-source nature of the Next.js framework, not all of these users are obviously Vercel customers, but its current paying customers include the likes of Carhartt, Github, IBM, McDonald’s and Uber.\n  “For us, it all starts with a front-end developer,” Vercel CEO Guillermo Rauch told me. “Our goal is to create and empower those developers — and their teams — to create delightful, immersive web experiences for their customers.”\n With Vercel, Rauch and his team took the Next.js framework and then built a serverless platform that specifically caters to this framework and allows developers to focus on building their front ends without having to worry about scaling and performance.\n Older solutions, Rauch argues, were built in isolation from the cloud platforms and serverless technologies, leaving it up to the developers to deploy and scale their solutions. And while some potential users may also be content with using a headless content management system, Rauch argues that increasingly, developers need to be able to build solutions that can go deeper than the off-the-shelf solutions that many businesses use today.\n Rauch also noted that developers really like Vercel’s ability to generate a preview URL for a site’s front end every time a developer edits the code. “So instead of just spending all your time in code review, we’re shifting the equation to spending your time reviewing or experiencing your front end. That makes the experience a lot more collaborative,” he said. “So now, designers, marketers, IT, CEOs […] can now come together in this collaboration of building a front end and say, ‘that shade of blue is not the right shade of blue.&#39;”\n “Vercel is leading a market transition through which we are seeing the majority of value-add in web and cloud application development being delivered at the front end, closest to the user, where true experiences are made and enjoyed,” said Geoff Lewis, founder and managing partner at Bedrock. “We are extremely enthusiastic to work closely with Guillermo and the peerless team he has assembled to drive this revolution forward and are very pleased to have been able to co-lead this round.”", "posttime": "2021-06-23 20:29:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,开发,react,开发人员", "title": "Vercel，它开发了流行的开源Next.js React Framework，由Bedrock Capital达到1.1亿美元的估值培养了102米系列C LED ", "title_en": "Vercel, which develops the popular open-source Next.js React framework, raises $102M Series C led by Bedrock Capital at a $1.1B valuation", "transed": 1, "url": "https://techcrunch.com/2021/06/23/vercel-raises-102m-series-c-for-its-next-js-based-front-end-development-platform/", "via": "", "real_tags": ["开源", "开发", "react", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "9fe23b8ae301ebe4343cbc02d311047c.jpg", "infoid": 1067684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，Apple越来越多地呼吁允许IOS和iPadoS平台的第三方应用商店，这将使称为“Sideloading”的过程 - 在源自官方App Store之外的设备上安装应用程序。\n   支持者争辩说Android允许Sideloading，因此Apple也应该。允许用户在没有Apple作为中间人的IPADS上安装应用程序，因为中间人将减轻对其应用勘探和费用的担忧，这是自13年前首次授权的第三方iPhone应用程序以来的持续戏剧的一部分。 Sideloading还将削弱Apple对App Store的控制金额为非法垄断的论据。\n 但是，苹果公司隐私专家的许多安全专家以及粉丝 - 找到了这种提案令人震惊。 Android允许SIDeloading允许Sideloading是真实的，但Sideloading是Google的移动操作系统如此徽章恶意软件的主要原因之一。坏演员知道，如果他们想要攻击Android设备，那么最简单的方法就是将其隐藏在伪装的应用程序中，例如，流行的防病毒应用程序甚至是Android系统更新。一旦应用程序安装在Android设备上，它就可以注入恶意软件有效载荷，例如Ransomware。\n 为了帮助公众更好地了解Apple对Sideloading的立场，该公司已发布其最新的隐私白皮书，专注于该主题。在论文的发布之前，我与Apple的用户隐私负责人，Erik Neuenschwander关于实践以及为什么从我们的谈话中撰写的苹果判断 - 仍然是强烈反对的。\n  作为经常撰写隐私和安全的人，我同意Apple对该主题的立场。有人认为苹果应该允许签名的应用说，它将为用户提供更多选择。然而，首选是Neuenschwander说该公司通过提供不允许缺席的平台提供用户。\n “在这种情况下，侧面加载实际上是消除的选择，”他说。 “希望直接访问在没有任何审查的情况下访问应用程序的用户今天在其他平台上侧行。 iOS平台是用户理解他们不能被欺骗或欺骗到一些黑暗的小巷或侧面道路的那个，即使他们没有打算，他们也会最终结束的侧面道路。“\n 如果你有朋友在恐慌中联系你，告诉你他们的手机被恶意软件击中，你会理解的是Neuenschwander的论点如何。如果没有iOS，用户就不会有一个移动操作系统平台，他们可以选择，不可能通过恶意缺陷来定位。在Apple的观点中，换句话说：你想要最好的隐私和安全吗？你的选择是ios。你想要sideloading吗？您的选择是Android。 \nNeuenschwander不会推测在Android平台上浮现多少恶意软件因缺陷而浮动，但独立的安全专家在Android设备上发现了一个惊人的恶意软件 - 高达IOS的15倍。攻击的主要载体之一？ SIDELOODED应用程序。\n 即使在应用商店的安全措施到位，恶意软件也会潜入iPhone。但Neuenschwander认为，如果Apple将iPhone开启到侧面，那么它的数量“显然会高得多”。为什么？因为现在有两个安全检查，可保护用户免受恶意应用程序。\n 第一个是Apple的开发人员策略和进程，它规范了应用程序可以且不能做的。 Apple可以检查开发人员是否关注这些策略，因为人类审核每个应用程序提交给App Store。并通过将应用程序上传到App Store的行为，该应用程序也扫描了所有已知的恶意软件，从而保护用户免受Nefarious应用程序的更多信息。\n  第二个安全检查是用户自己。由于Apple要求开发人员以普遍的方式向用户询问您可以访问此类功能作为iPhone的麦克风或摄像机之前，因此用户可以识别应用程序内是否正在进行中的某些内容。\n 但是，如果苹果允许通过第三方应用商店签名，但它无法运行那些在第一个重要安全检查的商店的应用程序上的人类和自动检查。它还无法验证Sideloaded应用程序是否要求用户在其常用的界限内访问系统服务的权限，这意味着欺骗用户更容易欺骗恶意应用程序对诸如其照片或消息的内容。\n “今天，我们有我们的技术防御，我们有我们的政策防御，然后我们仍然拥有用户自己的智慧，”Neuenschwander说，参考Apple的App Store进程。他争辩，侧面载会否定这些防御。\n  有些人可能会争辩说，Sideloading的缺点只会击中那些签名的应用程序。那些仍然选择只通过Apple的App Store下载应用程序的人是安全的吗？ \n但是，Neuenschwander指出（如本公司的白皮书），仅仅是缺陷的应用程序的存在，它会鼓励糟糕的演员通过试图引诱他们从非官方商店或网站下载他们的恶意的人来实现毫无戒心的用户。当你看到它时，你可能会娴熟，足够谨慎地知道假的应用商店，但是你的15岁的侄子或75岁的父亲？\n “甚至是打算的用户 - 他们有意识地认为自己只是要从App Store的应用程序下载应用程序，攻击者知道这一点，所以他们会试图说服他们正在下载应用程序的用户即使在App Store中，即使在发生这种情况下，Neuenschwander也是如此。 “真的，你必须非常创造性地思考，因为攻击者追求这么多用户在他们的设备上如此丰富的数据之后。因此，无论他们是否打算导航除Apple以外的应用商店，用户将被攻击。“\n  如果您认为声音很远，请让我向您介绍假谷歌播放商店。\n  尽管苹果公司坚持不懈地，侧载的应用程序和应用商店对于选择访问它们的用户以及没有的用户来说，必须指出的是，Apple并未完全反对缺席。事实上，Apple的最旧的平台允许它：麦斯科座。\n MacOS提供自己的App Store，但您不需要用它来下载应用程序。您也可以通过第三方商店或网站来这样做。那么为什么涉及到侧面加载时，Mac和iPhone之间的政策中的差异差异？\n  部分答案归结为数学。 Neuenschwander指出，世界上至少有10倍的iPhone，因为有MACS，这使得iPhone将更加诱人的目标对坏行为者。 iPhone也可能具有比平均Mac更敏感的用户数据，而iPhone通常与他们到达的任何地方都与用户一起使用。\n “这是你随身携带的设备，”Neuenschwander笔记。 “所以它知道你的位置。因此，有人可以攻击的人会得到关于你的生活模式。它有一个麦克风，因此这是一个可以在你身边的麦克风比你的Mac的麦克风更容易。所以那种敏感的数据[在iPhone上]更令攻击者。“ \n但那并非全部。 “Mac的使用模式 - 只是风格，人们如何使用那个平台 - 往往是他们得到一些他们用来做工作或他们的爱好的应用程序，然后它达到稳定状态，” Neuenschwander解释道。 “但我们所看到的是，包括iPhone，包括iPhone的移动平台是用户正在继续持续下载应用程序的平台。这使攻击者更多的机会进入并获得该用户。因此iOS边的威胁远远高于MAC方面的威胁。“\n  还应该注意到，在最近的史诗般的竞赛中，Apple试用，Apple的软件Cred Creacerighi表示，Mac上有一个不可接受的恶意软件，这一金额是“比ios要糟糕。”它可以理解，苹果不希望问题传播到iPhone。\n 如果Apple曾经允许SIDELOADINATING IOS和iPados应用程序，可能是因为它没有选择。亚利桑那州和北达科他州的拟议法律，旨在破坏其在这些国家的应用店垄断的垄断已经失败了。但该公司在联邦级别的立法者交叉队伍中仍然在立法者的十字准则中，并将放松其对其平台的控制的反垄断补救措施仍在桌面上。\n 尽管如此，我怀疑希望看到iOS支持的iPhone用户数量相对较小。设备安全和隐私是任何小工具的一些最重要的方面，以及苹果产品的巨大销售点。很难想象许多iPhone用户愿意为潜在的狡猾的侧载应用程序牺牲这一点。如果他们想牺牲Sideload的安全性，他们已经拥有了这个选择：他们可以获得一个Android手机。\n  至于Neuenschwander，他对Sideloading的争论归结为苹果 - 包括Tim Cook的每个人都在制作。 “我相信我们所建造的是什么以及现在提供用户的内容都是统一的，因为我们可以专注于那个较小的攻击表面和我们更强大的保护，以帮助保持用户安全，”Neuenschwander说。\n Apple的白皮书现在出现，可以在这里访问。对于任何思考士和安全和安全的人来说，这是一个有趣的，非本质阅读。 ", "note_en": "Recently there have been growing calls for Apple to allow third-party app stores for the iOS and iPadOS platforms, which would  enable a process known as “sideloading”—installing an app on a device that originates outside of the official App Store.\n   Proponents argue that Android allows sideloading, so Apple should too. Allowing users to install apps on their iPhones and iPads without Apple serving as an intermediary would alleviate concerns about its  App Store rejections and  fees, which have been part of an ongoing drama since the first authorized third-party iPhone apps debuted 13 years ago. Sideloading would also weaken arguments that Apple’s control of the App Store amounts to  an illegal monopoly.\n But many security experts—and fans of Apple’s privacy features—find such a proposal alarming. It’s true that Android allows sideloading, but  sideloading is one of the main reasons that Google’s mobile operating system is so riddled with malware. Bad actors know that if they want to attack an Android device, the easiest way to do so is to hide it in a sideloaded app disguised as, for example,  a popular anti-virus app or  even an Android system update. Once the app is installed on the Android device, it can then inject the malware payload,  such as ransomware.\n To help the public better understand Apple’s stance on sideloading, the company  has released its newest privacy white paper, which focuses on the topic. In advance of the paper’s release, I spoke to Apple’s head of user privacy, Erik Neuenschwander, about the practice and why Apple—judging from our conversation—remains vehemently opposed to it.\n  As someone who frequently writes about privacy and security, I agree with Apple’s position on the topic. Some who argue that Apple should allow sideloaded apps say that it would provide users with more choice. Yet choice is exactly what Neuenschwander says the company is offering users by providing a platform that does not allow sideloading.\n “Sideloading in this case is actually eliminating choice,” he says. “Users who want that direct access to applications without any kind of review have sideloading today on other platforms. The iOS platform is the one where users understand that they can’t be tricked or duped into some dark alley or side road where they’re going to end up with a sideloaded app, even if they didn’t intend to.”\n If you’ve ever had friends contact you in a panic, telling you their phone has been hit by malware, you’ll understand just how sound Neuenschwander’s argument is. Without iOS, users wouldn’t have a mobile operating system platform they could choose from that is impossible to be targeted by malicious sideloading. In Apple’s view, in other words: Do you want the best privacy and security possible? Your choice is iOS. Do you want sideloading? Your choice is Android.\n  Neuenschwander wouldn’t speculate on just how much malware is floating around on the Android platform due to sideloading, but independent security experts have found a staggering amount of malware on Android devices— up to 15 times more than iOS. One of the main vectors of attack?  Sideloaded apps.\n Even with the App Store’s security measures in place, malware  does sneak onto iPhones. But Neuenschwander contends that its quantity “would be obviously much higher” if Apple opened the iPhone to sideloading. Why? Because right now there are two security checks that protect users from malicious apps.\n The first is Apple’s developer policies and processes, which regulate what an app can and cannot do. Apple can check whether a developer is following these policies, because a human reviews every app submitted to the App Store. And by the very act of uploading an app to the App Store, that app is also scanned for all known malware, protecting users from nefarious apps even more.\n  The second security check is the users themselves. Because Apple requires developers to ask the user for permission in a universal way before it can access such features as an iPhone’s microphone or camera, a user can identify if something shady is going on inside the app.\n But if Apple were to allow sideloading via third-party app stores, it couldn’t run those human and automated checks on apps posted to those stores—negating that first important security check. It also couldn’t verify that sideloaded apps are asking users for permission to access system services within the bounds they are used to, which means it would be easier to fool a user into granting a malicious app access to content such as their photos or messages.\n “Today, we have our technical defenses, we have our policy defenses, and then we still have the user’s own smarts,” Neuenschwander says, referring to Apple’s App Store processes. Sideloading would negate those defenses, he contends.\n  Some may argue that the drawbacks of sideloading would hit only those who sideload apps. Wouldn’t those who still choose to download apps only through Apple’s App Store be safe?\n But Neuenschwander points out (as does the company’s white paper) that the mere existence of sideloaded apps would encourage bad actors to target unsuspecting users more by trying to lure them to download their malicious ones from unofficial stores or sites. You might be savvy and cautious enough to know a fake app store when you see it, but is your 15-year-old nephew or 75-year-old father?\n “Even users who intend—they’ve consciously thought themselves that they are only going to download apps from the App Store—well, the attackers know this, so they’re going to try to convince that user that they’re downloading an app from the App Store even when that’s not happening,” Neuenschwander says. “Really, you have to think very creatively, very expansively as an attacker would trying to go after so many users with such rich data on their device. And so users will be attacked regardless of whether or not they intend to navigate app stores other than Apple’s.”\n  If you think that sounds far-fetched, let me introduce you to  the fake Google Play Store.\n  Despite Apple’s insistence that sideloaded apps and app stores would be bad for both users who choose to access them and users who don’t, it must be pointed out that Apple isn’t against sideloading altogether. As a matter of fact, Apple’s oldest platform allows it: MacOS.\n MacOS offers an App Store of its own, but you don’t need to use it to download apps. You can also do so via third-party stores or websites. So why the discrepancy in policy between the Mac and iPhone when it comes to sideloading?\n  Part of the answer comes down to math. Neuenschwander notes that there are at least 10 times as many iPhones in the world as there are Macs, which makes the iPhone a much more enticing target to bad actors. An iPhone also likely carries much more sensitive user data than the average Mac does, and the iPhone is generally with a user everywhere they go.\n “It’s the device you carry around with you,” Neuenschwander notes. “So it knows your location. And therefore somebody who could attack that would get pattern-of-life details about you. It has a microphone, and therefore that’s a microphone that could be around you much more than your Mac’s microphone is likely to be. So the kind of sensitive data [on the iPhone] is more enticing to an attacker.”\n But that’s not all. “The pattern of use of the Mac—just the style, how people use that platform—tends to be that they get a few applications that they use to do their job or their hobby, and then it kind of reaches a steady state,” Neuenschwander explains. “But what we’ve all seen is that mobile platforms, including iPhone, are ones where users are downloading apps on a continuing basis. And that gives an attacker more opportunities to get in and get at that user. So the threat on the iOS side is much higher than the threat on the Mac side.”\n  It should also be noted that at the recent  Epic Games v. Apple trial, Apple’s software chief Craig Federighi  said there was an unacceptable level of malware on the Mac, an amount “that is much worse than iOS.” It’s understandable then that Apple doesn’t want the problem to propagate over to the iPhone.\n If Apple ever does allow sideloading of iOS and iPadOS apps, it might be because it has no choice. Proposed laws in  Arizona and  North Dakota that aimed to break its App Store monopoly in those states have apparently failed. But the company  remains in legislators’ crosshairs at the federal level, and antitrust remedies that would loosen its control over its platforms remain on the table.\n Still, I suspect the number of iPhone users who would like to see sideloading supported on iOS is relatively small. Device security and privacy are some of the most important aspects of any gadget, and a huge selling point for Apple products. It’s hard to imagine that many iPhone users would be willing to sacrifice that for potentially dodgy sideloaded apps. And if they  want to sacrifice security for sideloading, they  already have that choice: They can get an Android phone.\n  As for Neuenschwander, his argument against sideloading boils down to the case that everyone at Apple— including Tim Cook—has been making all along. “I believe that what we’ve built and what we’re offering users now is uniformly better, because we can focus in on that smaller attack surface and our stronger protections to help keep users safe,” Neuenschwander says.\n Apple’s white paper is out now  and can be accessed here. It’s an interesting, nontechnical read for anyone pondering the pros and cons of sideloading and security.", "posttime": "2021-06-23 20:28:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,表示,policy,应用程序", "title": "Apple的用户隐私负责人表示，Sideloading实际上是“消除选择”，并会否定技术和政策抗辩 ", "title_en": "Apple's head of user privacy says sideloading is actually “eliminating choice” and would negate technical and policy defenses", "transed": 1, "url": "https://www.fastcompany.com/90649203/apple-iphone-sideloading-safety-apps-tech", "via": "", "real_tags": ["apple", "表示", "policy", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067683, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我拨打了56874次来电探索电话网络。这是我发现的。\n  刚开始在2000年代初从旧电话目录融入时，这个问题出现了。\n 至少有普通的订阅者，商业客户支持线，语音邮件和传真机.Subscribers和客户支持线对ME是特别感兴趣的。我对让来电者与他们交互的自动化系统更感兴趣..voice邮件和传真机适合这个定义。但是还有其他东西吗？\n 随着电话网络在芬兰预测互联网超过100年，它可以非常古老且遮掩。在互联网上获得普及，这些系统用于提供我们今天在互联网上使用的类似服务。它不是有趣的是探索一下，看看这一天幸存了什么？因为没有像电话网络的Shodan的搜索引擎，我需要自己做探索。这篇文章描述了我的探索努力。\n 要探索，我使用了Wornialing.Wordialing是一种用计算机来电呼叫电话号码列表的技术，用于使用旧的使用者使用的计算机来探索电信网络，如目前使用的端口扫描探索互联网。\n 我用手柄来称之为一堆数字并记录了在保持安静的同时收到的前60秒。这个产生的呼叫记录我可以分析更多地了解电话网络中的系统。对于我的知识，没有人发表的结果他们之前的手提努力。特别是关于芬兰数量的芬兰数空间或最近的2021年。\n 我是如何避免在半夜用幽灵呼唤的羞辱人们 \n在接收端时，手柄会导致幽灵呼叫。你得到一个电话，你拿起了一个电话，但是来电者仍然是沉默的。一段时间后，呼叫者挂断了。这个来电可以感到威胁到某个人。另外还有什么在夜间中旬叫醒，后来你了解到你在电话上所说的一切都被录制了，与第三方分享并发表了？我会生气。因此，我采取了行动，尽量减少对业主造成的任何伤害电话号码打电话。\n 语音本身就是个人信息。人们也可能透露有关他们不想被共享或发布的手机的信息。避免违反人的隐私，我做了以下情况：\n 确保任何私人的录音都没有在欧盟以外的最终，由第三方保存，或用于训练机器学习模型\n 为避免共同调用人们或泛滥的紧急服务，我选择普通订阅者或紧急线路通常不使用的数字空间。我也选择隐藏我正在调用的号码（在接收者结束时显示未知数字）希望人们不会接听电话。\n 我本可以通过录制每个呼叫来进一步最大限度地减少个人信息收集，以便更短的时间。然而，这将使录音难以对其进行分类并在另一端识别服务。60秒录制被认为是最佳的足以让呼叫连接，并且对于任何录音来发挥足够长的录音来理解它们。\n 尽管我努力不骚扰私人，但我在夜间中至少醒来了3人。这是他们在回答或明显睡觉时宣布的时候判断。\n 由于速度非常适度的速度完成，我认为它不对服务提供商的带宽有害。 \n由于我的房子里没有铜普通的老电话服务（锅）线，我不得不寻找Wornial.i发现了一个现代化的Workialer Warvox，它使用VoIP来调用.I决定使用它。\n 工作，Warvox需要VoIP中继.VoIP中继是一种作为IP网络与公共交换电话网络（PSTN）之间的网关的服务。芬兰有几个VoIP集群服务，但它们只为商业客户，或者只有偶尔的偶尔的工王昂贵。我也假设他们不会满意的手提。外国Voip中断服务对于警告芬兰电话号码昂贵。\n 在学习VoIP业务中的非法终止之后，我了解到有设备，如VoIP GSM网关，可用于设置自己的VoIP主干。这个设备有可能更改IMSI号码.VoIP GSM网关通过GSM网络充当IP网络和PSTN网络之间的桥梁。\n 通过内部SIM卡，它们可以像手机一样连接到PSTN网络，允许您制作和接听电话。IP网络，它们提供一个接口，例如SIP，可用于以编程方式制作和接听电话。\n 我买了最便宜的VoIP GSM网关，它在IP网络上提供SIP接口.warvox说话IAx2，而不是SIP，所以我必须在两个协议之间配置星号作为代理。\n 要连接到PSTN网络，我购买了5欧元的最便宜的预付费SIM。如果服务提供商不喜欢我的行为，他们可以简单地阻止这个SIM卡。\n   芬兰运输和通信机构（Traficom）在其网站上发布有关电话网络编号的决定。我使用了芬兰的E164编号计划作为选择目标电话号码来调用的起点。这份文件从2019年初指定了不同的空格，并描述了他们的不同空间目的高水平。 \n没有私人（我不想惹恼和吓唬人们在半夜用鬼呼叫）\n 最终，在芬兰的R164编号计划上的免费电话空间（使用“非地理编号 - 全国范围的服务号码（Freephone）”）被确定为最佳候选人。订户在此空间中的数字支付更高的费用以覆盖呼叫者的成本。本空间中的数字不需要呼叫，因此它适合第一个要求。\n 我想到了更高的费用将至少保持私人的数量，因为你不会指望私人要支付更高的费用，以便自由地调用它们。因此，它假设适合第二个要求。\n 自由手机空间中的系统数量很难预测。在该空间中的系统将是有意义的，以集中使用它们的成本。\n 在编号计划中，还有一个用于机器到机器通信的空间，听起来它只包含机器。不幸的是，该空间是如此庞大（11位数字），很难找到它中使用的数字。我最初选择这个空间，但在没有一个答案的情况下调用超过10 000号码后放弃了。\n  购买的VoIP GSM网关仅适用于单个SIM卡，它只支持单线。因此我只能一次性拨打一次电话。随机地对属于自由手机空间的数字进行调用。\n Warvox在每个电话上都花了60秒，无论是回答还是没有。这导致了1个电话/分钟的速度。56874呼叫，这意味着大约40天致电日夜。 \n连接呼叫所需的时间和某人接收所需的时间从60秒中扣除。这意味着录像仍然短于60秒。\n 我配置了VoIP GSM网关不要发送来电显示，所以人们会拿起更少的人，没有人会给我回电话。\n   在运行Warvox之后，我留下了包含1724个回答的Calls.warvox的录制的音频文件，自动标识调制解调器和传真机，为所有录音提供信号图。信号图形可用于按照相似性对录制进行排序，但我找到了这一点对分类和识别录音的糟糕。\n 为避免聆听所有录音，使用Google云语音到文本来传输录制，然后使用转录到具有相同消息的呼叫记录。这将呼叫数量减少到300左右的呼叫次数减少到300左右的呼叫数量。可忍受的数字。\n 然后，我手动收听不同的录音并根据下图分类：\n  在该图中，探讨呼叫被分类，每个分类都标记为不乐趣或有趣。有趣的是让来电者以某种方式与服务交互的答案，或者可能会让，如在音乐和未知系统的情况下.How许多录音每个分类都包含在图中可见。\n 由人类回答的所有电话都是企业或私人。我通过非正式的答复电话公认的私人个人。 \n当仅静音或回铃时，不可能确定在线时究竟存在什么。录像包含回铃的事实表示接收端上有一个PBX，这会拾取然后尝试调用扩展名。\n 一台机器回答的所有录音都是人类声音，传真机，音乐或未知（机器）的录音。音乐包含包含整个录制音乐的录制。未知（机器）包含包含机电声音的呼叫的录制。\n 人类声音的录音是公告宣布的东西（如不使用的数字）或者要求输入。要求输入的值为测试号码，语音邮件，电话会议服务或无法识别，因此未知（等待输入） ）。\n 总共只有3％的呼叫得到回答。其中69％被确定为有趣。只有2％的所有电话都有一个有趣的答案。\n  作为等待投入的大多数有趣的记录是未知的，我决定进一步对它们进行分类。通过相同的录制内容进行分类。类别内部的录音称为变型。基于此分类，有74个独特的有趣答案。\n 等待呼叫者输入的未知记录类别包含16种不同的变体。有2种不同的测试数变体。语音邮件类别包含23个不同的变体，电话会议类别中有24种不同的变体。所有传真机听起来与我的相同耳朵，虽然我的手柄设置有7个不同的歌曲。最后，两个未知的机器都听起来与我相同。\n   我假设所有有趣的记录除了传真机和未知机器外，都是由私有分支交流（PBXS）提供的服务.PBXS是通常由在多个用户之间进行呼叫的业务通常使用的电话系统，并且可以提供语音邮件等额外服务电话会议。 \n从未知（等待输入）的系统有大量答案，等待输入的系统在他们提供的服务中没有提示。它们的Part使用拨号盘询问PIN码或菜单选项，其他用于语音命令。\n 要求PIN的人可以是例如语音邮件盒子或电话会议服务..他们也可以对遥控的PBX的身份验证？唯一可以找到某人或试图蛮力代码的唯一方法。然而非法的。\n  寻求语音命令的人是僵尸。是一个芬兰语和一个英语机组。他们可以通过与他们进行互动进一步调查。\n   前者宣布它是一个ICS测试平台，并进行DTMF和传真测试。后一项测试服务似乎属于DTMF测试，CL回读，回声测试和SMS菜单。 。\n 仍然使用语音邮件。录制的部分是企业语音邮件要求客户反馈或联系方式。其余的是普通的，只需在哔哔声后询问消息。\n TelecoCofercing是一个受到公认的有趣记录中提供的最受欢迎的服务。最多似乎是由企业提供的。电话会议服务的确切用例并未透露。他们可以成为内部或针对外部用户的公司。\n  11个呼叫只有音乐回答。音乐可以指示某些东西，例如在某些服务中排队。所有音乐变体除了一个像通用电梯音乐一样，可能是PBX中的默认保持音乐。 \n一些未知的机器相同地回答了两个呼叫。它是不可能识别他们来自录制的何种机器。他们声音机电。\n  有一个响应存在于1074年回答的呼叫（占所有有趣答案的91％），并等待呼叫者自身互动。“Tervetuloa Palveluun”（欢迎来服务），然后重复“Anna Tunnusluku”。 （请给出访问代码）。机器没有任何暗示它的任何服务。\n 我联系了芬兰电信公司ELISA，希望他们能够识别这项服务。这篇帖子一旦我得到答案就会更新。\n  2个未知的机器声音机电。这些神秘机器听起来像evan门铃的东西的东西。我联系了Evan，希望他能够识别机器并将更新这篇文章，以防他这样做。\n   在我的手柄设置上播放了同样的录音，在两个不同的数字上。我非常惊讶地听到关于世界末日和Zombie Opocalypse在收听录音时的奇怪消息。\n 谷歌唱的数字或录音上的句子没有告诉我这是什么。录音听起来像Captchas.note我没有触摸音调！\n  Clevercrossing的枫木确认消息。其中6个。这可能是什么？什么是什么？ \n英语言语机器人不理解沉默，并将升级我的电话：\n      根据我的结果，有私人和商业电话，传真机，PBX和未识别的系统。PBXS例如作为电话会议系统，测试号码和语音邮件。有些PBX也可能还有其他目的，但这项研究不是足以找出什么。\n 我无法识别的系统，例如未知的机器和未知的PBX服务，可能会出现意外。因此，如果您知道他们是什么，请与我联系！您可以找到录制的链接这篇文章的结尾。\n 我无法完全回答原始问题，因为数字空间选择窄，样本尺寸相对较小。因此，练习更好地用于2021年的芬兰自由手机号空间中的哪种系统。\n 我只拨打了数字并被动地听了60秒。尝试以某种方式尝试与发现的服务进行交互并看看它们是如何反应的。\n 另一个想法将是具有相同方法的状况的其他电话号码空间.E164编号计划指出，长度5位数的电话号码仍用于旧的分配。因此，它是一个有希望的目标，可以发现旧服务。 ，这个数字空间足够小以在合理的时间内致电。但是，此范围可能包含充电溢价率的服务号码。\n  此处提供所有原始录制，标记在分拣图中，除语音邮件外，可以在此处提供。 \n语音邮件未公布，因为它们的一部分包含所有者自己或所有者的号码正在录制录制。 ", "note_en": "I made 56874 calls to explore the telephone network. Here’s what I found.\n  This question appeared to me a while ago when leafing through an old telephone directory from the early 2000s.\n There are at least ordinary subscribers, business customer support lines, voice mails, and fax machines.Subscribers and customer support lines are not of special interest to me.I am more interested in automated systems that let the caller interact with them somehow.Voice mails and fax machines fit this definition.But is there something else as well?\n As the telephone network predates the Internet in Finland by over 100 years, the systems in it can be very old and obscure.Before the Internet gained popularity, these systems were used to provide similar services we use on the internet today.Would it not be interesting to explore a bit and see what has survived to this day?As there are no Shodan-like search engines for the telephone network, I needed to do the exploration myself.This post describes my exploration efforts.\n To explore, I used wardialing.Wardialing is a technique to call a list of telephone numbers automatically using a computer.Hackers of old used wardialing to explore the telephone network much like port-scanning is used today to explore the Internet.\n I used wardialing to call a bunch of numbers and recorded the first 60 seconds of audio received while staying quiet myself.This produced call recordings I could analyze to learn more about systems in the telephone network.To my knowledge, nobody has published the results of their wardialing efforts before.Especially about wardialing Finnish number-spaces or as recent as 2021.\n How I tried to avoid scaring people with ghost calls in the middle of the night\n On the receiving end, wardialing causes a ghost call.You get a call, which you pick up, but the caller remains silent.After a while, the caller hangs up.This alone can feel threatening to some people.What if additionally you were woken up by the call in the middle of the night and later you learned that everything you said on phone was recorded, shared with third parties, and published?I would be angry.Therefore, I took action to minimize any harm caused to the owners of phone numbers called.\n Voice is personal information in itself.People may also disclose information on the phone they do not want to be shared or published.To avoid violating people’s privacy, I did the following:\n Ensured that any recording of private individuals did not end up outside the EU, being saved by third parties, or used to train machine learning models\n To avoid calling people altogether or flooding emergency services, I chose to call a number space that is typically not used by ordinary subscribers or emergency lines.I also chose to hide the number I was calling from (displays unknown number at the receiver’s end) in hopes that people would not pick up my calls.\n I could have further minimized the personal information collection by recording each call for a shorter amount of time.This however would have made it harder to classify the recordings and recognize the service at the other end.The 60-second recording was considered optimal as it is enough for the call to be connected and for any recordings to play long enough to make sense of them.\n Despite my efforts to not harass private individuals, I woke at least 3 persons in the middle of the night.This was judged by their announcement of the time when answering or apparent sleepiness.My apologies to them!\n As wardialing was done at a very modest speed, I considered it to not be harmful to the bandwidth of the service providers.\n  Since I have no copper Plain Old Telephone Service (POTS) line in my house, I had to look for other ways to wardial.I discovered a modern wardialer,  WarVOX, that uses VoIP for calling.I decided to use it.\n To work, WarVOX requires a VoIP trunk.VoIP trunk is a service that acts as a gateway between IP network and the Public Switched Telephone Network (PSTN).There are a few VoIP trunking services in Finland, but they are either for business customers only, or expensive for only occasional wardialing.I also assume they would not be happy with wardialing.Foreign VoIP trunking services are expensive for wardialing Finnish phone numbers.\n After learning about illegal termination in the VoIP business, I learned that there is equipment, such as VoIP GSM gateways, that can be used to set up your own VoIP trunk.Curiously, this equipment comes with the possibility to change the IMSI number.VoIP GSM gateways act as bridges between IP network and the PSTN network through the GSM network.\n With SIM card(s) inside, they connect to the PSTN network like your mobile phone does, allowing you to make and receive calls.On the IP network, they provide an interface, such as SIP, which can be used to programmatically make and receive calls.\n I bought the cheapest VoIP GSM gateway, which provides a SIP interface on the IP network.WarVOX speaks IAX2, not SIP, so I had to configure Asterisk as a proxy between the two protocols.\n To connect to the PSTN network, I bought the cheapest prepaid SIM with a 5 EUR credit.If the service provider does not like my actions, they can simply block this SIM card.\n   Finnish Transport and Communications Agency (Traficom) publishes  decisions regarding telephone network numberings on their website.I used the  Finland’s E164 numbering plan as a starting point for choosing target phone numbers to call.This document from early 2019 specifies the different number spaces and describes their purpose on a high level.\n  No private individuals (I did not want to annoy and scare people with ghost calls in the middle of the night)\n In the end, the freephone space (usage “Non-geographic number - Nationwide service numbers (freephone)” on Finland’s R164 numbering plan) was determined to be the best candidate.The subscriber pays a higher fee for the numbers in this space to cover the costs of the callers.Thus the numbers in this space cost nothing to call so it fits the first requirement.\n I imagine the higher fee would keep the number of private individuals at a minimum, as you would not expect private individuals to pay higher fees so that they can be called for free.Therefore it hypothetically fits the second requirement.\n The number of systems in the freephone space is hard to predict.Having systems in this space would make sense to centralize the costs of using them.\n In the numbering plan, there is also a space for Machine-to-Machine communication that sounds like it contains only machines.Unfortunately, the space is so huge (11 digits) that it is very hard to find numbers that are in use in it.I initially chose this space but gave up after calling over 10 000 numbers without a single answer.\n  The bought VoIP GSM Gateway fits only a single SIM card, and it only supports a single line.Therefore I could only make a single call at a time.The calls were made randomly to numbers belonging to the freephone space.\n WarVOX spent 60 seconds on every call, whether it was answered or not.This resulted in a wardialing speed of 1 call/minute.For 56874 calls, this means roughly 40 days calling day and night.\n The time required to connect the call and the time it takes for someone to pick up is deducted from the 60 seconds.This means that the recordings are all shorter than 60 seconds.\n I configured the VoIP GSM Gateway to not send Caller ID, so fewer people would pick up and nobody would call me back.\n   After running WarVOX, I was left with audio files containing recordings of 1724 answered calls.WarVOX identifies Modems and Fax machines automatically and provides signal graphs for all recordings.The signal graphs can be used to sort the recordings by similarity, but I found this to be poor for classifying and identifying the recordings.\n To avoid listening to all recordings myself, used Google Cloud Speech-to-Text to transcribe the recordings, and then used the transcriptions to aside the call recordings that have the same message.This reduced the number of calls to listen manually to around 300, a bearable number.\n I then manually listened to the different recordings and classified them according to the following diagram:\n  In the diagram, prospect calls are classified and each classification is marked either not interesting or interesting.The interesting ones are the answers that let the caller interact with the service somehow, or may let, as in the case of music and unknown systems.How many recordings each classification contains is visible in the diagram.\n All calls answered by a human were either  businesses or  private individuals.I recognized private individuals from businesses by the informal style of answering the phone.\n It is not possible to determine what exactly there are at the other end when there is only  silence or  ringback on the wire.The fact that the recordings contain ringback indicates though that there is a PBX on the receiving end, which picks up and then tries calling an extension.\n All recordings that were answered by a machine were recordings of human voice,  fax machines, music, or unknown (machine). Music contains recordings that contain music for the whole recording. Unknown (machine) contains recordings of calls that contain electromechanical sound.\n Recordings of human voice were either  announcements that announced something (such as number not in use) or asked for input.Recordings asking for input were either  test numbers,  voice mails,  teleconferencing services or they could not be identified, thus  unknown (waiting for input).\n In total, only 3% of calls were answered.Out of these, 69% were identified as interesting.Thus only 2% of all calls got an interesting answer.\n  As the large majority of interesting recordings that wait for input were unknown, I decided to classify them further.The classification was done by identical recording content.Different recordings inside categories are called variants.Based on this classification, there are 74 unique interesting answers.\n The category of unknown recordings that wait for caller input contained 16 different variants.There were 2 different test number variants.The voice mail category contained 23 different variants and there were 24 different variants in the teleconference category.All fax machines sound the same to my ears, while there were 7 different songs played at my wardialing setup.Finally, both unknown machines sounded identical to me.\n   I hypothesize that all interesting recordings, except fax machines and unknown machines, are services offered by Private Branch Exchanges (PBXs).PBXs are telephone systems usually used by businesses that switch calls between multiple users and which can offer additional services such as voice mail and teleconferencing.\n There was a large number of answers from  Unknown (waiting for input), systems waiting for input that did not hint at what service they provide.Part of them ask for a PIN code or menu option using a dial-pad, others for voice commands.\n The ones asking for PIN could be for example voicemail boxes or teleconferencing services.Maybe they could be authentications to remote-controlled PBXs too?The only ways to find out would be to ask someone or trying to brute force the codes.Brute forcing is however illegal.\n  The ones asking for voice commands were bots.There was one Finnish and one English bot.They could be investigated further by interacting with them.\n   The former announces that it is an ICS test platform and proceeds to offer DTMF and FAX testing.The latter test service seems to belong to Twilio, an American communication platform provider.It offers DTMF testing, CL readback, echo test, and an SMS menu.\n Voice mail is still used.Part of the recordings were business voice mails asking for customer feedback or contact details.The rest were ordinary ones simply asking for messages after the beep.\n Teleconferencing was a popular service offered in among the recognized interesting recordings.Most of them seemed to be offered by businesses.The exact use cases of the teleconferencing services were not revealed.They could be company internal or aimed at external users.\n  11 Calls were answered with only  music.The music could indicate something, such as being in queue for some service.All music variants except for one sounded like generic elevator music that could be the default hold music in PBXs.\n  Two calls were answered identically by some  unknown machine.It was not possible to identify what kind of machines they are from the recording alone.They sound electromechanical.\n  There was a single response that was present in 1074 answered calls (91% of all interesting answers) and that waits for the caller to interact with itself.It says “Tervetuloa palveluun” (Welcome to the service) followed by repeating “Anna tunnusluku” (Please give access code).The machine does not give any hint of what kind of service it is.\n I contacted Finnish telecommunications company Elisa in hopes they could identify this service.This post will be updated once I get an answer.\n  2 unknown machines sound electromechanical.These mystery machines sound like something out of  Evan Doorbell’s tapes.I contacted Evan in hopes he will recognize the machines and will update this post in case he does.\n   This same recording was played at my wardialing setup on two different numbers.I was very surprised to hear this bizarre message about the end of the world and a zombie apocalypse when listening to the recordings.\n Googling the numbers or the sentences on the recording did not tell me what this is.The recordings sound like captchas.Note that I pressed no touch tones!\n  Maple confirmation message for Clevercrossing.There were 6 of these.What could this be?A confirmation message for what?\n   English speech bot that does not understand silence and is going to escalate my call:\n      Based on my results, there are private and business telephones, fax machines, PBXs, and unidentified systems.The PBXs serve for example as teleconferencing systems, test numbers, and voice mails.Some PBXs may also have other purposes, but this research was not enough to find out what.\n The systems I was not able to identify, such as the unknown machines and the unknown PBX services, could turn out to be something unexpected.Therefore if you know what they are, please contact me!You can find a link to the recordings at the end of this post.\n I cannot fully answer the original question, because of the narrow number space selection and relatively small sample size.My exercise thus serves better as a peek into what kind of systems there are in the Finnish freephone number space in 2021.\n I only called the numbers and passively listened for 60 seconds.It would be interesting to attempt interacting with the discovered services somehow and see how they react.\n Another idea would be to wardial other phone number spaces with the same methodology.The E164 numbering plan states that phone numbers of length 5 digits are still in use for older assignments.Therefore, it is a promising target to discover older services.As a bonus, this number space is sufficiently small to call through in a reasonable time.However, this range may contain service numbers that charge premium rates.\n  All raw recordings marked interesting in the sorting figure, except voice mail, are available  here.\n Voice mails are not published as part of them contain a recording of the owners themselves or the owner’s number is being read by the recording.", "posttime": "2021-06-23 20:28:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "来电,explore,呼叫", "title": "我拨打了56874次来电探索电话网络。 这是我发现的 ", "title_en": "I made 56874 calls to explore the telephone network. Here’s what I found", "transed": 1, "url": "https://shufflingbytes.com/posts/wardialing-finnish-freephones/", "via": "", "real_tags": ["来电", "explore", "呼叫"]}]