[{"category": "", "categoryclass": "", "imagename": "7d757493fa3161e74d509107b1eefea3.png", "infoid": 1008358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一个在90年代和00年代长大的人，我的一些最美好的记忆源于互联网和计算机技术的进步。从拨号上网升级到DSL在我们家里是一件盛事。我记得我和哥哥为了玩2003年上映的“沃尔芬斯坦-敌人领地”这样的游戏，日复一日地在电脑前吵架。(我确信这将是有史以来最好的FPS游戏。)。几乎在同一时间，我们升级到了当时市面上最好的戴尔计算机之一。它有512MB的RAM和奔腾4处理器。这是对我们的康柏赛扬的重大升级，康柏赛扬拥有大约64MB的RAM。\n最终，随着世界其他地区开始采用有线和光纤互联网，DSL的辉煌逐渐消退。直到我短暂地搬到费城，我才终于能够体验到我错过的东西。上大学的时候，我住在一个社区，那里是威瑞森最早的菲奥斯建筑之一。我完全被25 Mbps的连接打动了。这是在2009年。令我惊讶的是，十多年过去了，也就是2020年，一些家庭仍然无法接入有线或光纤互联网。\n就像我们现在的许多客户一样，我从来不明白为什么让我们获得光纤服务如此困难。电缆很便宜，扔到杆子上给我上网就行了！对吗？嗯，别那么快……。\n大多数人都知道，向家庭或企业提供公用事业服务主要有两种方式。空中和地下。由于显而易见的原因，水、煤气和下水道总是在地下供水。电力、电话、电缆和光纤可以位于地面之上或地下。\n支持的主要是前期成本(这是有争议的)和部署速度(这也是有争议的)。\n缺点是，与实际部署的成本相反，杆子所有者通常会预先收取现成费用。这些费用从0美元到5万美元/英里不等。从本质上讲，玩游戏是值得的。如果我们想要连接到50根电线杆上，电线杆所有者可能会确定其中10根电线杆是旧的，需要更换才能连接到它们。他们不会自己付钱，而是会强迫我们支付更换电线杆的费用，以便批准附件。\n除此之外，还有每年的撑杆费。根据您的协议，我们看到的撑杆费从7美元/杆到43美元/杆不等，每年上涨10%(我正在考虑PPL)。这个荒谬的速度纯粹是为了阻止我们依附在他们的杆子上，国际海事组织。用这样的汇率是不可能赚钱的)。\n另一个缺点是，即使在电线杆上安装电缆更快，电线杆所有者通常需要大约6个月的时间来审查申请并确定准备就绪的要求和成本。举个例子，如果我们在一根电线杆上有光纤，而这根电线杆比你的房子短1根电线杆，那么光是把光纤连接到那一根额外的电线杆上就需要至少6个月的时间。如此接近，但到目前为止。\n当你在地下安装一项服务时，你将终身拥有它。没有年费。你只需支付一次安装费用，你就可以终身使用了。这听起来很专业，但也是个骗局。当我们运营地铁管道时，成本通常在15-25美元/英尺(不包括客户降价)。为了便于讨论，让我们假设我们处于成本的高端。如果我们安装1000英尺长的管道，我们需要自掏腰包预付25000美元。有些街区有30多个客户，但另一些街区只有5个。假设每个街区平均有20个客户，那就是每个客户预付1250美元，假设我们每一个客户都有客户的话。保守地说，我们最初预计入住率为50%。这可能会增长到100%的加班费，但我们从来没有做出过这样的假设。也就是说，每位顾客2500美元。想象一下，每栋房子/建筑花费2500美元，然后他们告诉你，你每米69美元的服务太贵了。一般说来，除非我们的数字看起来比这更好，否则我们不会走一条街，但随着我们扩大规模并获得更便宜的资金，这是一个现实的情况，等等。\n撇开成本问题不谈，仅仅为了开始建设网络的过程，人们还需要克服许多其他障碍。你会认为不惜一切努力将当地经济带入21世纪将是一个受欢迎的景象吗？我也是这么想的，难道我错了。虽然有很多支持者(我真的很感谢你们所有人)，但也有同样多(如果不是更多)的批评者。\n我们很幸运，有几个人加班加点地支持我们，给了我们一次机会。我敢肯定，其他人没有过得这么容易。我之所以知道这一点，是因为即使在过去的4年里，我们已经成为我们城市的一名老牌玩家，邻近的乡镇和市政当局仍然没有像我预期的那样，或者像我希望的那样，敞开武装欢迎我们进入他们的社区。\n我将在下面更详细地介绍小政府政策，这些政策确实阻碍了我们在地下部署的能力。\n一般说来，我是试图在他们的社区产生影响的个人公民的铁杆粉丝。然而，在太多的情况下，这些贡献似乎是以无益的抱怨的形式作出的，而不是以有成效的反馈或行动的形式做出的。太多的人对他们可能不应该做的事情有发言权。\n一位新客户最近与我们签署了一项协议，将光纤接入他们的大楼。这是一个非营利性的组织，他们的成员无私地贡献他们的时间来恢复社区的地标建筑。在收到他们的签名后，我通知市政府，我们将申请许可证，将问题建筑与我们的地下网络连接起来。他们说没问题，就是这样。我们最近的现有手孔在新客户的物业右侧约90英尺处，在另一个物业的前面。出于礼貌，我通知了那家店的经理，让她知道我们将在周末(从周五到周六)工作。他们周六和周日都关门了，所以我以为他们会感激这份通知，甚至可能会和我们签约。该项目将包括拆除90英尺长的人行道，铺设管道，然后用全新的混凝土修复人行道。发生这种情况的总时间跨度是48小时，从我们的铲子落地到新的人行道就位。我从他们组织的一名成员那里得到的回应让我很难堪。\n在收到这封电子邮件后不久，我意识到他们甚至不拥有这座有问题的建筑，更不用说人行道了。他们把它租出去了。在非营利组织总裁和相关机构之间进行了一系列谈判后，这一问题最终得到了解决。很多时候，我们没有那么幸运。\n我们最初计划在他们签署合同后的一周内安装这个新客户。现在从开始到结束大约需要2个月的时间。长话短说，我学到了试着礼貌的教训。\n去年，我们正在为我们的光纤网络安装管道。不计其数的例子中，人们真的会停车，摇下车窗，对我们大喊大叫。在什么样的世界里，成年人才能接受这样的行为呢？我无法想象自己如此疯狂，以至于我会觉得有必要对一群试图建造光纤网络的建筑工人大喊大叫(并不是说他们根本不知道我们在做什么)。如果这些人是影响决策的那类人，那就有问题了。\n城市工人有一项艰巨的工作，要处理像这样的人的抱怨，我对此表示赞赏。不过，它应该不会影响政策。\n在上例B之后不久发生的另一起事件中，可能是一两天。当我们在95华氏度的高温中挥舞镐斧时，一位当地商店老板回到我们身边，告诉我们需要加快步伐，应该雇佣更多的工人。我的顾客不断打电话来，说没有地方可以停车。请注意，我们正站在一个巨大的停车场旁边，大约三分之一的停车场都停满了。我尽了最大努力善意地解释说，付钱给3个人，让他们站在一个洞周围看一个人手挖一个公用事业，不会让我们的工作进行得更快。我想他不喜欢我的回答。\n在许多情况下，居民投诉是合理的。公用事业提供商需要为糟糕的修复工作负责。然而，打击糟糕的恢复工作的方式是适得其反的。地方政府对路缘到路缘的恢复要求大幅增加。这些规定基本上规定的是，每当公用事业公司切割沥青超过预定长度(例如100英尺)时，他们就有责任更换从街道左侧的路缘到街道右侧的路缘的整个路面。我相信一些市政当局也在试图引入这些措施，以减轻自己重新铺设道路的成本，类似于电线杆所有者根据他们的现成要求迫使你更换老化的电线杆。(当我参加地方议会会议，试图让他们为我们放弃这项荒谬的法令时，一个市政当局也告诉了我同样的话。)。\n这些政策最终将弊大于利。对我们来说，这些是阻碍我们在这些领域提供优质光纤互联网服务的唯一原因。强迫路缘到路缘的沥青修复基本上会使我们提供服务的成本翻一番。除此之外，这样的政策会迫使其他公用事业业主尽可能等待更长时间才进行公用事业维修。我们已经在当地看到过一个例子，天然气公司推迟了对泄漏的天然气管道的修理，后来被罚款数百万美元。这家公用事业公司还卷入了与邻近城市的一场诉讼，该城市最近通过了一项限量管制政策。\n这个问题的处理方式应该是让公用事业公司对糟糕的恢复工作负责。如果你对坑洞进行精修，那么他们会被鼓励在第一时间正确地恢复他们的铺路切口。这是威尔克斯-巴雷城(Wilkes-Barre City)最近的做法，如果执行得当，在鼓励基础设施升级和安抚居民之间取得了更有效的平衡。\n我们挖了数千英尺的沟渠，没有任何坑洞或额外的维修工作就修复了沥青。下面是两个这样的例子。\n这是我在结束这篇帖子之前想说的另一个小点子。最近，美国联邦通信委员会(FCC)和美国农业部(USDA)等机构创建了大量资金，努力在服务不足的地区部署宽带。这是一项令人钦佩的努力。然而，如果你看看这些钱传统上都花到哪里去了，你会发现这些钱大多都流向了ILEC和少数几家大型CLEC。这些项目中的大多数在像我们这样的小型ISP甚至还没有意识到它们的存在之前就已经发放了资金，因为他们没有资源积极寻找这样的项目。\n那些获得资助的人要么是部署了低于平均水平的无线服务的大型无线ISP(我确信它的服务比以前更好，但宽带使用量在几年内就会超过这些技术)，要么就是那些部署了低于平均水平的无线服务的大型无线ISP(我确信这是比以前更好的服务，但宽带使用量将在几年内超过那些技术)。或者是ILEC的人，他们基本上把钱挥霍掉了，几乎没有什么可展示的。我记得看到每套房子超过5,000美元的数字，这简直是疯了。\n我是几个由光纤互联网提供商组成的小型在线社区的一员，他们以大公司所做成本的一小部分来部署光纤网络。这些都是在农村地区部署的公司，在农村接入方面可以提供最大的回报。\n我希望我错了，但这些政策中的许多似乎永远不会改变。我在起草完这封信后不久就把它寄给了一位朋友。他的回答是，这篇文章太有趣了，因为这正是我们在2000年初在阿伦顿试图铺设光纤时所经历的挣扎。从字面上看，一切都没有改变。供应商在20年前也曾面临过同样的问题。如果允许他们在更优惠的政策下继续进行，到目前为止，所有这些道路都会被重新铺设2-3次以上，每个人都会有光纤互联网。\n我希望至少有一位政策制定者读到这篇文章，能够更好地把握小型ISP面临的挑战。大多数社区只有一家互联网提供商是有原因的。这并不是说没有人想进入你们的市场，而通常是现有的政策让你们几乎不可能这样做。\n(有趣的是，邻居的一位官员给人的印象是，当地的有线电视公司拥有排他性；我纠正了他，并告诉他，自1996年以来，提供或执行独家特许协议一直是非法的。)", "note_en": "As someone who grew up throughout the 90&#39;s and 00&#39;s, some of my fondest memories stem from progressive advancements in internet and computing technologies. Upgrading from Dial-Up internet to DSL was a grand event in our house. I remember my brother and I fighting over the computer day in and day out to play games like Wolfenstein - Enemy Territory, which was released in 2003. (I&#39;m convinced that this will be the all-time best FPS game ever created.) At around the same time, we upgraded to one of the best Dell computer&#39;s available at the time. It had 512MB of RAM and a Pentium 4 processor. This was a major upgrade from our Compaq Celeron, which had something like 64MB of RAM.\n Eventually, the grandeur of DSL faded as the rest of the world began to adopt Cable and Fiber internet. It wasn&#39;t until I briefly moved to Philadelphia that I was finally able to experienced what I had been missing out on. In college I lived in a neighborhood that was one of Verizon&#39;s first Fios builds. I was absolutely blown away by the 25 Mbps connection. This was in 2009. I&#39;m amazed that over a decade later, in 2020, some households still don&#39;t have access to cable or fiber internet yet.\n Like many of our customers do now, I could never figure out why it was so difficult to get us fiber service. The cable is cheap, just throw it up on a pole and give me internet! Right? Well, not so fast...\n  As most people know, there are primarily two ways to deliver utility services to a home or business. Aerial and underground. Water, gas, and sewer are always serviced underground for obvious reasons. Electric, telephone, cable, and fiber have the ability to either be above or below ground.\n   The pro&#39;s are primarily upfront costs (this is debatable) and speed of deployment (this is also debatable).\n The con&#39;s are that contrary to it being cheaper to physically deploy, the pole owners generally charge up-front make ready fee&#39;s. These fees can range from $0 to upwards of $50,000/mile. It&#39;s essentially pay to play. If we want to attach to 50 poles, the pole owner might determine that 10 of those poles are old and need to be replaced before we can attach to them. Rather than fork up the cash themselves, they&#39;ll force us to pay to replace their poles in order to approve the attachment.\n In addition to that, there are the annual pole fee&#39;s. Depending on your agreement, we&#39;ve seen pole fee&#39;s ranging anywhere from $7/pole per year all the way up to $43/pole per year with 10% annual increases (I&#39;m looking at you PPL. This ridiculous rate was purely intended to keep us from attaching to their poles, IMO. It&#39;s impossible to make money with these rates).\n Another con is that even though installing the cable on poles is faster, it usually takes the pole owner around 6 months just to review applications and to determine make ready requirements and costs. As an example, if we have fiber on a pole that&#39;s 1 pole short from being able to service your house, it would take at least 6 months just to run fiber to that one additional pole. So close, yet so far.\n   When you install a service underground, you own it for life. There are no annual fee&#39;s. You pay one time to install it and you&#39;re set for life. This sounds like a pro, but it&#39;s also a con. When we run metro conduit, it generally costs us between $15-25/ft (not including customer drops). For the sake of argument, let&#39;s assume we&#39;re at the high-end of our costs. If we install 1,000ft of conduit, that&#39;s $25,000 that we need to pay out of pocket upfront. Some blocks have upwards of 30 customers, but others have as little as 5. Let&#39;s average it out at 20 customers per block, that&#39;s $1,250 upfront per customer, assuming we get every single customer. Conservatively, we&#39;re initially looking at a 50% take rate. This could grow to 100% overtime, but we never make that assumption. So that&#39;s $2,500/customer. Imagine spending $2,500 per house/building and then have them tell you that your $69/m service is too expensive. Generally speaking, we won&#39;t do a street unless our numbers look better than this, but this is a realistic scenario as we scale and get access to cheaper capital, etc.\n   Cost issues aside, there are a number of other hurdles one needs to get past just to begin the process of building out a network. You&#39;d think that risking everything you have in an effort to bring your local economy into the 21st Century would be a welcome sight. That&#39;s what I thought too; was I wrong. While there are plenty of supporters (I truly appreciate you all), there are just as many, if not more, critics.\n We&#39;ve been fortunate enough to have had a handful of people get behind us overtime and give us a shot. I&#39;m sure others haven&#39;t had it so easy. I know this because even after we&#39;ve become an established player in our city throughout the past 4 years, neighboring townships and municipalities haven&#39;t been as opened armed to welcome us into their communities as I had anticipated or would have liked.\n I&#39;ll go into more detail on small government policies that really hamper our ability to deploy underground later below.\n  I&#39;m generally a big fan of individual citizens trying to make an impact in their communities. However, in too many cases these contributions seem to be made in the form of unproductive complaints rather than productive feedback or action. Far too many people have a say in things that they probably shouldn&#39;t.\n  A new customer had recently signed an agreement with us to run fiber into their building. This is a non-profit who&#39;s members are selflessly donating their time to restore a landmark in the community. Upon receiving their signature, I notified the city that we would be pulling a permit to connect the building in question to our underground network. They said okay; that was that. Our nearest existing hand hole is approximately 90ft to the right of the new customer&#39;s property; in front of another property. As a courtesy, I notified the manager of that establishment to let her know that we would be performing work over the weekend, from Friday into Saturday. They&#39;re closed Saturday and Sunday so I had assumed they would appreciate the notice and possibly even sign up with us. The project would involve removing 90ft of sidewalk, running conduit, and then restoring the sidewalk with brand spankin&#39; new concrete. The total timespan that this would occur, from when our shovel hit the ground to having new sidewalks in place, would be 48 hrs. The response that I received from a member of their organization made me facepalm.\n  Not long after receiving this email, I became aware that they didn&#39;t even own the building in question, nevermind the sidewalk. They lease it. This was eventually &#34;resolved&#34; after a series of negotiations between the non-profit&#39;s president and the establishment in question. Often times we aren&#39;t as lucky.\n We initially planned to have this new customer installed within a week of them signing the contract. Now it will end up being around 2 months from start to finish. Long story short, I learned my lesson in trying to be courteous.\n  Last year we were installing conduit for our fiber optic network. There were countless instances where people would literally stop their cars, roll down their windows, and yell profanities at us. In what world is that acceptable behavior for an adult? I can&#39;t imagine being so far off my rocker that I would feel the need to yell at a bunch of construction workers trying to build a fiber optic network (not that they had any idea what we were doing). If these are the types of people influencing decisions, there&#39;s something wrong.\n City workers have a tough job fielding complaints from people like this and I commend them for it. It shouldn&#39;t affect policy though.\n  In another incident that took place not long, maybe a day or two, after  Case B above. A local store owner came back to us as we&#39;re swinging pick axes in 95 degree heat telling us we need to hurry up and we should hire more workers. &#34;My customers keep calling saying there&#39;s no where to park.&#34; Mind you, we&#39;re standing right next to a massive parking lot that is approximately 1/3rd full. I made my best attempt to kindly explain that paying 3 guys to stand around a hole to watch one person hand-dig to expose a utility isn&#39;t going to make our work go any faster. I don&#39;t think he liked my response.\n  In many cases, resident complaints are justified. Utility providers need to be held accountable for shitty restoration work. However, the way in which bad restoration work is being combated is counter productive. There has been a huge increase in curb-to-curb restoration requirements by local governments. Essentially what these rules state is that anytime a utility cuts asphalt beyond a predetermined length, say 100ft, they are then responsible for replacing the entire road surface from the curb on the left side of the street to the curb on the right side of the street. I believe some municipalities are also trying to introduce these measures to offload the costs of repaving roads themselves, similar to how pole owners force you to replace their aging utility poles under their make-ready requirements. (One municipality told me as much when I attended a local council meeting in an effort to get them to waive this ridiculous ordinance for us.)\n These policies will ultimately do more harm than good. For us, these are the one and only thing preventing us from providing superior fiber internet services in these areas. Forcing curb-to-curb asphalt restoration essentially doubles our cost to provide service. Apart from that, policies like these are going to force other utility owners to wait as long as possible before doing any utility repairs. We&#39;ve already seen one instance locally where the gas company put off repairs to a leaking gas line and was later fined several million dollars. This utility company is/was also involved in a lawsuit with a neighboring city who had recently passed a curb-to-curb policy.\n The way this issue should be handled is to hold utilities accountable for bad restoration work. If you fine utilities for potholes, they will then be encouraged to restore their pave cuts properly the first time. This has recently been Wilkes-Barre City&#39;s approach and, if enforced properly, is a much more effective balance of encouraging infrastructure upgrades while also appeasing residents.\n We&#39;ve trenched thousands of feet and have restored the asphalt without any potholes or additional repair work. Two examples of such are below.\n  This is another tid-bit that I want to throw in before I wrap up this post. Recently, the FCC and USDA, among others, have created massive funds in an effort to deploy broadband in underserved areas. This has been an admirable effort. However, if you take a look at where all of that money has traditionally gone, it&#39;s mostly all going to ILEC&#39;s and a handful of large CLEC&#39;s. Most of these programs have dished out funding before small ISP&#39;s like ourselves, who don&#39;t have the resources to actively seek out programs like these, have even been made aware of their existence.\n Those who have received funding are either large wireless ISP&#39;s whom have deployed sub-par wireless service (I&#39;m sure it&#39;s better service than what was previously available, but broadband usage will outgrow those technologies within a few years.) or are ILEC&#39;s who basically squandered away the money with very little to show for it. I recall seeing figures in excess of $5,000/home, which is absolutely batshit insane.\n I&#39;m a part of several small online communities of fiber internet providers who deploy fiber networks at small fractions of the cost of what the big guys do. Those are the companies that are deploying in rural areas and who can provide the most bang for the buck in regards to rural access.\n  I hope I&#39;m wrong, but it seems like many of these policies will never change. I sent a friend this write up shortly after drafting it. His response was this, &#34;the read is so funny, because its the exact struggles we had in allentown trying to lay fiber in the early 2000&#39;s.  Literally nothing has changed&#34;. Providers faced this same issue 20 years ago. If they were allowed to proceed under more favorable policies, all of those roads would have been repaved 2-3 times over by now and everyone would have fiber internet.\n My hope is that at least one policy maker reads this post and can better grasp the challenges that face small ISP&#39;s. There&#39;s a reason that most communities have only one internet provider. It&#39;s not that no one wants to enter your market, it&#39;s usually that the policies in place make it near impossible to do so.\n (What&#39;s funny is a neighboring official was under the impression that the local cable company had exclusivity; I corrected him and informed him that it has been illegal to provide or enforce exclusive franchise agreements since 1996.)", "posttime": "2020-06-26 13:16:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "互联网,upstart,光纤", "title": "对新兴光纤互联网提供商的战争", "title_en": "The War on Upstart Fiber Internet Providers", "transed": 1, "url": "http://chrishacken.com/the-war-on-upstart-fiber-optic-internet-providers/", "via": "", "real_tags": ["互联网", "upstart", "光纤"]}, {"category": "", "categoryclass": "", "imagename": "fc7a1ca2b80acf731f1311e2ce4e10d6.jpg", "infoid": 1008356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波士顿已禁止在该市使用面部监控技术，成为世界上第二大这样做的社区。\n市议会周三一致投票禁止使用这项技术，并禁止任何市政府官员通过第三方要求获得面部监控。这项措施现在将以不受否决的多数票提交给市长马蒂·沃尔什(Marty Walsh)。沃尔什的办公室表示，他将审查这项禁令。\n尽管市政府官员表示，波士顿警察局还没有使用这项技术--尽管该部门可以通过软件升级来获得这些权力，但这一举措还是发生了。\n议员里卡多·阿罗约(Ricardo Arroyo)与议员米歇尔·吴(Michelle Wu)共同发起了这项法案，他指出，这项技术对有色人种来说非常不准确。麻省理工学院的一项研究发现，对于肤色较深的女性，面部分析程序的错误率高达35%。\n它有明显的种族偏见，这是危险的，阿罗约在听证会前说。但它也对公民自由产生了某种寒蝉效应。因此，在我们看到以争取权利的游行和抗议形式出现如此多直接行动的时候，任何一种可能被用来本质上冷却言论自由或……的监视技术都是如此。或多或少监督激进主义或积极分子是危险的。\n在周三的会议上和投票前，吴说波士顿不应该使用种族歧视的技术。她注意到密歇根州已知的第一起男子被面部识别技术误认后被捕的报道。\n“我们正在努力结束系统性种族主义，”吴说。所以结束这场.。对有色人种社区的过度监视需要成为其中的一部分，我们只是真正坚持公共安全和公共卫生必须建立在信任基础上的价值观。“。\n在本月早些时候的一次听证会上，波士顿警察局长威廉·格罗斯(William Gross)表示，目前的技术并不可靠，该部门并未使用这项技术。\n“我没有忘记，我是非洲裔美国人，我也可能被误认，”他补充道。\n虽然警察局现在没有使用面部识别技术，但该部门目前使用的名为BriefCam的视频分析软件的升级版确实具有面部分析功能。波士顿警方在最近的一次市议会工作会议上表示，他们不会签署软件更新的这一部分。\n目前还不清楚该部门是否已经升级到最新版本的BriefCam，也不清楚该市目前是否与该公司签订了合同。波士顿警方尚未回应有关合同的问题。\n吴说，政府经常追逐新技术，并试图在事后制定法规-从叫车到房屋共享。她说，在这种情况下，对有色人种的不成比例的影响使得现在的表演变得更加重要。\nKenzie Bok议员在委员会会议上说，仅仅因为一种技术是可能的并不意味着它就应该被使用。\n她说：“在这个国家，我们真的有一种倾向，就是让我们的技术走在我们希望如何生活在一起的常识之前。”这就是为什么对我来说，这是理事会在这个时刻进行的如此关键的干预。“。\n波士顿现在是世界上第二大禁止面部识别技术的城市，仅次于旧金山。马萨诸塞州的其他五个社区也有禁令：萨默维尔、布鲁克林、北安普顿、斯普林菲尔德和剑桥。\n美国公民自由联盟(American Civil Liberties Union)马萨诸塞州分会推动在这些地方实施禁令，并正在游说州立法者采取行动。全州范围内没有禁令，尽管一项暂停人脸识别系统的法案目前正在等待参议院联合司法委员会的审议。波士顿条例不会影响私人公司或联邦机构，如联邦调查局，使用这项技术。\n美国公民自由联盟的卡德·克罗克福德(Kade Crockford)表示，该州现在应该采取行动，以防日后受到伤害。\n克罗克福德说，让我们确保我们把政策放在技术车之前，用我们的价值观引领，这样我们就不会意外地在某一天醒来时处于反乌托邦的监视状态，因为在幕后，警察部门和科技公司创造了一个非常难以消除的压迫架构。\n波士顿市议会条例指出，尽管需要公众信任才能有效应对这场危机，但世界各国政府对新冠肺炎疫情的回应是史无前例的使用监控工具。", "note_en": "Boston has banned the use of facial surveillance technology in the city, becoming the second-largest community in the world to do so.\n The city council unanimously voted on Wednesday to  ban the use of the technology and prohibit any city official from obtaining facial surveillance by asking for it through third parties. The measure will now go to Mayor Marty Walsh with a veto-proof majority. Walsh&#39;s office said he would review the ban.\n That move comes even as city officials say the technology isn&#39;t yet used by the Boston Police Department — though the department could access those powers with a software upgrade.\n Councilor Ricardo Arroyo, who sponsored the bill along with Councilor Michelle Wu, noted the technology is wildly inaccurate for people of color. A  MIT study found that for darker skinned women, facial analysis programs had an error rate of up to 35%.\n &#34;It has an obvious racial bias and that&#39;s dangerous,&#34; Arroyo said ahead of the hearing. &#34;But it also has sort of a chilling effect on civil liberties. And so, in a time where we&#39;re seeing so much direct action in the form of marches and protests for rights, any kind of surveillance technology that could be used to essentially chill free speech or ... more or less monitor activism or activists is dangerous.&#34;\n During Wednesday&#39;s meeting and before the vote, Wu said that Boston shouldn&#39;t be using racially discriminatory technology. She noted the  reports of the first known case of a man arrested after being misidentified by facial recognition technology in Michigan.\n “We’re working to end systemic racism,&#34; Wu said. &#34;So ending the ... over-surveillance of communities of color needs to be a part of that, and we’re just truly standing with the values that public safety and public health must be grounded in trust.”\n During a hearing earlier this month, Boston Police Commissioner William Gross said the current technology isn&#39;t reliable, and that it isn&#39;t used by the department.\n  “I didn’t forget that I&#39;m African American and I can be misidentified as well,&#34; he added.\n While the police department isn&#39;t using facial recognition technology now, an upgraded version of a video analysis software currently used by the department, called BriefCam, does have facial analysis power. Boston police said at a recent city council working session that it would not sign up for that part of the software update.\n It&#39;s not clear whether the department has upgraded to the newest version of BriefCam or if the city has a current contract with the company. Boston police did not yet respond to questions about the contract.\n Wu said government often chases new technologies and tries to put in regulations after the fact — from ride-hailing to home-sharing. She said in this case, the disproportionate impact on people of color makes acting now even more important.\n Councilor Kenzie Bok said during the council meeting that just because a technology is possible doesn&#39;t mean it should be used.\n “We really have a tendency in this country to let our technology go ahead of our common sense about how we want to live together,&#34; she said. &#34;And that’s why this to me is such a critical intervention for the council to be making in this moment.”\n Boston is now the second-largest city in the world to ban facial recognition technology, behind San Francisco. Five other Massachusetts communities have a ban:  Somerville,  Brookline, Northampton, Springfield and  Cambridge.\n The Massachusetts chapter of the American Civil Liberties Union pushed for the bans in those places, and is lobbying state lawmakers to act. There is no statewide ban, though a bill that would put a moratorium on face recognition systems  is currently pending before the joint judiciary committee. The Boston ordinance would not affect private companies or federal agencies, like the FBI, from using the technology.\n Kade Crockford, with the ACLU, said the state should act now to prevent harm down the line.\n &#34;Let&#39;s just ensure that we put the policy horse before the technology cart and lead with our values so we don&#39;t accidentally wake up someday in a dystopian surveillance state,&#34; Crockford said, &#34;because behind the scenes, police departments and technology companies have created an architecture of oppression that is very difficult to dismantle.&#34;\n The Boston city council ordinance notes  governments  around the world have responded to the COVID-19 pandemic with &#34;an unprecedented use of surveillance tools&#34; despite needing the public trust to effectively respond to the crisis.", "posttime": "2020-06-26 12:52:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "禁止,bans,技术", "title": "波士顿禁止使用面部识别技术", "title_en": "Boston Bans Use of Facial Recognition Technology", "transed": 1, "url": "https://www.wbur.org/news/2020/06/23/boston-facial-recognition-ban", "via": "", "real_tags": ["禁止", "bans", "技术"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1008353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "过去有指责和抨击一家公司明目张胆抄袭另一家公司想法的时间和地点。但现在感觉很幼稚。谁真的在乎呢？俗话说“好艺术家临摹，伟大艺术家偷窃”。每个人都会借钱。每件事都是从之前的事情中获得灵感的。\niOS14可能不会像iOS7那样进行全系统范围的UI升级，但这没问题，因为iOS14的所有新功能都是如此强劲，以至于几乎没有任何有意义的理由去渴望Android的绿色牧场。\n王的文章的标题是“点击诱饵”(“在iOS14之后，几乎没有理由再买Android手机了”)，但实际上这篇文章是深思熟虑的。除了任何特定的功能之外， - 主屏幕小工具、应用程序剪辑、内置语言翻译 - 在我看来仅仅是热情的落差。\n你有没有感觉到，整个公司的谷歌都对Android感兴趣？我没有。无论是作为软件平台的管理者，还是作为Pixel硬件的制造商，谷歌似乎都对Android失去了兴趣。旗舰安卓硬件制造商肯定对安卓感兴趣，但他们不能改变安卓开发者生态系统 - ，只有谷歌可以。\n从制度上讲，苹果一如既往地关注iPhone和iOS。我认为，从制度上讲，谷歌已经厌倦了Android。", "note_en": "There used to be a time and place for pointing fingers and bashingone company for blatantly copying another’s ideas. But now itfeels juvenile. Who really cares? “Good artists copy, greatartists steal” as the saying goes. Everyone borrows. Everything isinspired by something before it.\n iOS 14 may not be a complete overhaul with a system-wide-UIupgrade à la iOS 7, but that’s okay because the sum of everythingnew in iOS 14 is so robust that there are virtually no meaningfulreasons to pine for Android’s green pastures.\n The headline for Wong’s piece is clickbait-y (“After iOS 14, There’s Almost No Reason to Buy an Android Phone Anymore”) but the actual article is thoughtful. Above and beyond any specific features — home screen widgets, app clips, built-in language translation — it occurs to me that there’s simply an enthusiasm gap.\n Do you get the sense that Google, company-wide, is all that interested in Android? I don’t. Both as the steward of the software platform and as the maker of Pixel hardware, it seems like Google is losing interest in Android. Flagship Android hardware makers sure are interested in Android, but they can’t move the Android developer ecosystem — only Google can.\n Apple, institutionally, is as attentive to the iPhone and iOS as it has ever been. I think Google, institutionally, is bored with Android.", "posttime": "2020-06-26 12:29:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,ios,features", "title": "在iOS 14上，Android最先获得的功能", "title_en": "On iOS 14 Picking Up Features Android Had First", "transed": 1, "url": "https://daringfireball.net/linked/2020/06/25/wong-ios-14-android", "via": "", "real_tags": ["android", "ios", "features"]}, {"category": "", "categoryclass": "", "imagename": "ad23e10a12ebced16402764d63a94590.jpg", "infoid": 1008352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2月下旬，来自世界各地的约175名高管参加了生物技术公司Biogen在波士顿举行的领导层会议。在两天多的时间里，与会者握手，相互交谈，分享食物。出席者还有：新型冠状病毒。参加活动的几个人在不知不觉中感染了导致新冠肺炎的微生物，这种微生物很快在那里传播开来，然后他们把它带回了家。仅马萨诸塞州就有至少99人患病。\n大约在同一时间，冠状病毒在佐治亚州奥尔巴尼参加葬礼的100多人中传播。引发了一场疫情，很快导致周围的农村县发布了全国累计发病率最高的新冠肺炎事件之一。第二个月，在华盛顿州长达两个半小时的唱诗班练习中，一名患有这种疾病的人感染了52人。有两个人死了。在阿肯色州，一名受感染的牧师和他的妻子在几天的时间里将病毒传染给了30多名参加教堂活动的人，导致至少3人死亡。这些新病例蔓延到另外26人，其中至少有一人死亡。\n随着科学家对新冠肺炎的了解越来越多，人们越来越清楚地看到，所谓的超级传播者事件-一个人感染了不成比例的其他人-在导致疾病的病毒传播中发挥了过大的作用。根据疾病控制和预防中心首席副主任安妮·舒查特的一份报告，波士顿会议和佐治亚州的葬礼是几个超级传播者事件中的两个，这些事件在新冠肺炎在美国早期的传播中发挥了显著作用。事实上，对实际病例和大流行模型的研究表明，10%到20%的感染者要为冠状病毒传播的80%负责。\n东北大学研究传染病的网络科学家塞缪尔·斯卡皮诺(Samuel Scarpino)表示，这些数字意味着，预防超级传播者事件可以在很大程度上阻止新冠肺炎。科学家们已经确定了催化这类事件的因素，包括人群规模大，人与人之间的密切接触，以及通风不良的受限空间。目前的证据表明，主要是这样的情况，而不是特定个人的生物学特性，为这种新型冠状病毒的极端传播奠定了基础。\n在描述SARS-CoV-2病毒如何传播时，流行病学家不仅使用一个人感染的其他人的平均人数，还使用了另一个关键值，称为分散因子，即“k”。这个数字描述了一种疾病聚集的程度。较小的k通常意味着负责传输的情况相对较少，而较大的k表示传输分布更均匀。在香港，研究人员计算出，在他们检查的1,000多个新冠肺炎案例中，k的值是0.45.。这一数值高于SARS或MERS-前两次以超级传播为特征的病毒爆发-但远低于1918年流感大流行的数值。换言之，Scarpino说，SARS-CoV-2的传播不像SARS和MERS那样依赖于超级传播，但比流感依赖得多。\n这种新型冠状病毒似乎主要通过感染者在咳嗽、打喷嚏、说话或呼吸时产生的呼吸道飞沫传播。下一个人通过将这些飞沫吸入他或她的肺部或将其送入鼻子或嘴里而受到感染。如果人们在感染后立即生病，他们可能会呆在家里卧床休息，几乎没有机会传播病毒。相反，得克萨斯大学奥斯汀分校新冠肺炎模特联盟的执行董事劳伦·安塞尔·迈耶斯(Lauren Ancel Meyers)表示，患有新冠肺炎的人在出现症状之前就会传染。美国疾病控制与预防中心估计，大约40%的传播发生在感染者出现任何症状之前，症状平均需要六天时间才能开始。这段时间给了感染者一个很长的接触其他人的窗口-也许还可以进入一个超级传播的时机成熟的情况。\n研究人员已经确定了几个使超级传播更容易发生的因素。其中一些是环保的。例如，通风不良的室内区域似乎特别有利于病毒的传播。对日本1 1 0例新冠肺炎病例的初步分析发现，在封闭环境中传播病原体的几率是在露天传播的18倍以上。作者得出结论，密闭空间可以促进超级传播者事件的发生。(这项研究尚未经过同行审查。)。另一项由伦敦研究人员进行的初步印刷前研究，检查了几组新冠肺炎病例，发现几乎所有的病例都是室内或室内外环境。最大的集群是在努尔等室内空间发现的\n时间也很重要。一个群体保持联系的时间越长，病毒在他们之间传播的可能性就越大。纽约市健康+医院的特殊病原体专家Syra Madad说，人们到底需要多长时间才能拿到它仍然是一个悬而未决的问题。她补充说，在她的接触者追踪工作中用于风险评估的基准是与感染者接触10分钟，尽管疾控中心使用15分钟作为指导。像杂货店收银员和疗养院员工这样的基本工作者根据需要与大团体互动，并在为超级传播做好准备的情况下工作。迈耶斯说，如果我们想要遏制新冠肺炎，我们就必须想办法保护他们，让他们的工作场所不那么有利于这类活动。\n人们的所作所为也很重要，因为一些活动似乎更容易传播呼吸道粘液。我们都见过有人咳嗽或打喷嚏时飞溅的水滴。但加州大学戴维斯分校的化学工程师威廉·里斯帕特说，即使当你说话的时候，你也会释放出“大量”的颗粒。“没有人会想到他们，但他们就在那里，”他说。Ristenpart的研究小组发现，与正常呼吸相比，说话会释放出更多的粒子。而且，随着人们说话的声音越来越大，排放量也会增加。唱歌释放出更多的粒子，这可能在一定程度上解释了华盛顿州合唱团实践中的超级传播者事件。锻炼时呼吸急促也可能有助于新冠肺炎的传播。在小房间里举行的健身舞蹈课，一次最多可容纳22名学生，这与韩国约65例埃博拉病例有关。但是，同一设施中的一个瑜伽课并没有与任何集群联系在一起。一项对日本新冠肺炎集群的研究发现，与在健身房锻炼、卡拉OK派对、在俱乐部欢呼和在酒吧交谈有关的病例，为这些活动可能有助于传播提供了进一步的证据。\nRistenpart和他的同事们还没有证实他们看到的颗粒物排放的变化是否影响了新型冠状病毒的传播。他们的研究没有测量SARS-CoV-2本身。但空气中的颗粒可能是病毒颗粒的重要载体。科学家们还发现了耐人寻味的证据，表明一小部分人可能表现为“语言超级排放者”--那些持续广播的呼吸颗粒物比同龄人多一个数量级的人。“很难提前确定谁将成为超级排放者，”他说。“其中一名超级排放者是一名非常娇小的年轻女子。我是一个更高大、更笨重的人，不是一个超级排放者。“。\n有关超级传播活动的证据让研究人员相信，他们是新冠状病毒大部分传播的罪魁祸首。斯卡皮诺说：“到目前为止，我看到的所有数据都表明，如果你压制超级传播者事件，感染的增长速度就会非常、非常快地停止。”“我们在西雅图看到，至少有几次介绍没有导致新的病例”-这意味着如果拒绝病毒传播的条件，它可能会逐渐消失。\n但在美国-那里已经有近216万例病例和超过11.7万人死亡-这些情况可能正在上升。各州正在重新开放商业和活动，这意味着更多的人将以更大的群体相互接触。因此，将允许超级蔓延事件发生的条件降至最低，对于遏制新冠肺炎至关重要。在日本，卫生官员建议人们避免出现三个C的情况：通风不良的封闭空间、拥挤的空间和近距离接触的环境。圣达菲研究所的计算机科学家克里斯托弗·摩尔(Cristopher Moore)对病毒传播事件进行了模拟，他说，病毒感染的能力并不完全是这种病原体的属性。“这是病毒和人类社会相互作用的一种属性，”他指出，这是我们有能力改变的东西。\n点击此处阅读更多有关冠状病毒爆发的信息，请点击此处。并在这里阅读我们最新的国际杂志网络的报道。", "note_en": "In late February about 175 executives from around the world came to the biotechnology company Biogen’s leadership conference in Boston. Over two days, attendees shook hands, talked among themselves and shared meals. Also in attendance: the new coronavirus. Several people at the event were unknowingly infected with the microbe that causes COVID-19, and it quickly spread among others there, who then brought it home. At least 99 people ended up sick in Massachusetts alone.\n  Around the same time, the coronavirus was spreading among more than 100 people who went to a funeral in Albany, Ga. sparking an outbreak that soon led to the surrounding rural county posting one of the nation’s highest cumulative incidences of COVID-19. The next month a single individual with the disease  infected 52 people during a two-and-a-half-hour choir practice in Washington State. Two people died. In Arkansas, an infected pastor and his wife passed the virus on to more than 30 attendees at church events over the course of a few days, leading to at least three deaths. And these new cases spread to 26 more people, at least one of whom died.\n  As scientists have learned more about COVID-19, it has become clear that so-called superspreader incidents—in which one person infects a disproportionate number of other individuals—have played an oversized role in the  transmission of the virus that causes the disease. The Boston conference and the funeral in Georgia were among several superspreader events that played “ a notable role in the early U.S. spread of COVID-19,” according to a report by Anne Schuchat, principal deputy director of the Centers for Disease Control and Prevention. In fact,  research on actual cases, as well as models of the pandemic, indicate that between 10 and 20 percent of infected people are responsible for 80 percent of the coronavirus’s spread.\n  These numbers mean that preventing superspreader events could go a long way toward stopping COVID-19, says Samuel Scarpino, a network scientist who studies infectious disease at Northeastern University. Scientists have identified factors that catalyze such events, including large crowd sizes, close contact between people and confined spaces with poor ventilation. Current evidence suggests that it is mostly circumstances such as these, rather than the biology of specific individuals, that sets the stage for extreme spreading of the novel coronavirus.\n  When describing how the SARS-CoV-2 virus spreads, epidemiologists not only use the average number of other people that one individual infects but also employ another key value called the dispersion factor, or “k.” This number describes how much a disease clusters. A small k generally means that a relatively small number of cases are responsible for transmissions, while a larger k indicates that transmissions are more evenly spread. In Hong Kong, researchers calculated that in more than 1,000 COVID-19 cases they examined, the value for k was 0.45. That value was higher than that of SARS or MERS—two previous viral outbreaks that featured superspreading—but much lower than that of the 1918 flu pandemic. In other words, SARS-CoV-2’s transmission is not as reliant on superspreading as SARs and MERS were but is far more dependent on it than influenza, Scarpino says.\n  The novel coronavirus seems to primarily spread  via respiratory droplets produced by an infected individual during coughing, sneezing, talking or breathing. The next person becomes infected by inhaling these droplets into his or her lungs or by getting them in the nose or mouth. If people got sick right away after they were infected, they might stay at home in bed, giving them few opportunities to transmit the virus. Instead individuals with COVID-19 are contagious before they have symptoms, says Lauren Ancel Meyers, executive director of the  University of Texas at Austin COVID-19 Modeling Consortium. The  CDC estimates that about 40 percent of transmissions occur before the infected person has any symptoms and that symptoms take an average of six days to begin. That time gives an infected individual a long window to come into contact with other people—and to perhaps get into a situation ripe for superspreading.\n  Researchers have identified several factors that make it easier for superspreading to happen. Some of them are environmental. For instance, poorly ventilated indoor areas seem especially conducive to the virus’s spread. A preliminary analysis of 110 COVID-19 cases in Japan found that the odds of transmitting the pathogen in a closed environment  was more than 18 times greater than in an open-air space. And the authors concluded that confined spaces could promote superspreader events. (The study has not yet been peer-reviewed.) Another preliminary preprint study, by researchers in London, examined  clusters of COVID-19 cases and found that  nearly all of them were indoor or indoor-outdoor settings. The largest clusters were found in indoor spaces such as nursing homes, churches, food-processing plants, schools, shopping areas, worker dormitories, prisons and ships.\n  Unsurprisingly, another thing these superspreader venues have in common is that they are places where large numbers of people congregate. The more individuals you pile into one place, the greater the opportunity for the coronavirus to infect many people at once, Meyers says. “If you max out at five people, it will be very hard to have a superspreading event,” she adds. But as a group’s size increases, so does the risk of transmitting the virus to a wider cluster. A large group size also increases the chance that someone present will be infectious.\n  Time matters too. The longer a group stays in contact, the greater the likelihood that the virus will spread among them. Exactly how much time someone needs to pick it up remains an unanswered question, says Syra Madad, a special pathogens expert at NYC Health + Hospitals. She adds that the benchmark used for risk assessment in her contact-tracing work is 10 minutes of contact with an infectious person, though the CDC uses 15 minutes as a guideline. Essential workers such as grocery store checkers and nursing home employees interact with large groups by necessity and work in situations primed for superpreading. Meyers says that if we want to contain COVID-19, we will have to find ways to protect them and make their workplaces less favorable to such events.\n  What people are doing matters, too, because some activities seem to make it easier to spread respiratory gunk. We have all seen droplets go flying when someone coughs or sneezes. But even when you talk, you emit a “tremendous amount” of particles, says University of California, Davis, chemical engineer William Ristenpart. “Nobody thinks about them, but they’re there,” he says. Ristenpart’s team has found that speech emits more particles than normal breathing. And emissions also increase as people speak louder. Singing emits even more particles, which may partially explain the superspreader event at the Washington State choir practice. Breathing hard during exercise might also help the spread of COVID-19. Fitness dance classes held in small rooms with up to 22 students at a time were linked to  65 cases of the disease  in South Korea. But yoga classes at one of the same facilities were not linked to any clusters. A study of COVID-19 clusters in Japan found cases  connected to exercising in gyms, karaoke parties, cheering at clubs and holding conversations in bars, providing further evidence that these activities may aid transmission.\n  Ristenpart and his colleagues have not yet confirmed that the particle-emission changes they saw affect transmission of the novel coronavirus. Their study did not measure SARS-CoV-2 itself. But the airborne particles are presumably important carriers of viral particles. The scientists also have found intriguing evidence that a small subset of people may behave as “speech superemitters”—individuals who consistently broadcast an order of magnitude more respiratory particles than their peers. “It is very difficult to identify who is going to be a superemitter ahead of time,” he says. “One of the superemitters was a very petite young woman. And I was a bigger, bulkier guy and was not a superemitter.”\n  The evidence about superspreading activities has led researchers to believe they are responsible for much of the new coronavirus’s transmission. “All of the data I’m seeing so far suggest that if you tamp down the superspreader events, the growth rate of the infections stops very, very quickly,” Scarpino says. “We saw in Seattle that there were at least a couple of introductions that did not lead to new cases”—implying that the virus can fade out if it is denied circumstances for spreading.\n  But in the U.S.—where there have been nearly 2.16 million cases and more than 117,000 deaths—those situations may be on the rise. States are reopening businesses and activities, which means more people are coming in contact with one another in larger groups. So minimizing conditions that allow superspreading events to happen will be crucial for keeping COVID-19 in check. In Japan, health officials have  advised people to avoid situations with the three C’s: closed spaces with poor ventilation, crowded spaces and close-contact settings. A virus’s ability to infect is not entirely a property of that pathogen, says Cristopher Moore, a computer scientist at the Santa Fe Institute who models virus-spreading events. “It’s a property of how the virus and human society interact,” he notes, and that’s something we have the power to change.\n  Read more about the coronavirus outbreak   from Scientific American  here . And read coverage from our  international network of magazines here.", "posttime": "2020-06-26 12:10:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "事件,events,传播", "title": "“超级传播”事件如何带动新冠肺炎的大部分传播", "title_en": "How ‘Superspreading’ Events Drive Most COVID-19 Spread", "transed": 1, "url": "https://www.scientificamerican.com/article/how-superspreading-events-drive-most-covid-19-spread1/", "via": "", "real_tags": ["事件", "events", "传播"]}, {"category": "", "categoryclass": "", "imagename": "c6371c046b70ff6137d98efa648cb0fc.jpeg", "infoid": 1008351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-06-26 11:49:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,言论,longer,注册", "title": "由于Facebook平台缺乏仇恨言论的节制，所有的公司都不再在Facebook上投放广告", "title_en": "All of the companies no longer advertising on Facebook due to the platform's lack of hate speech moderation", "transed": 1, "url": "https://www.businessinsider.com/companies-no-longer-advertising-on-facebook-after-poor-speech-moderation-2020-6", "via": "", "real_tags": ["广告", "facebook", "言论", "longer", "注册"]}, {"category": "", "categoryclass": "", "imagename": "68eaf7cbc24c7a945ffc310e105698cf.jpg", "infoid": 1008350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当然，这些都不是真正重要的。这一切都是关于福特为改进其阵容中最重要、最有利可图的汽车所做的一切。距离上次重新设计已经六年了。这款全新的F-150提供了福特卡车车主所期待的性能和丰富的选择。例如，福特提供了11种不同的格栅选择。\n但这一次脱颖而出的是技术以及推动轻度混合动力车进入全混合动力总成领域的努力。\n这是新F-150的所有技术，从内饰开始，特别是信息娱乐系统。\n基础XL版本的卡车将标配一个8英寸的中央触摸屏显示器。然而，在更高的装饰-XLT及以上-F-150将有一个可以拆分的12屏，这样用户就可以同时控制多种功能，包括导航、音乐或卡车功能。\n如果显示器没有支持大量功能的底层连接，谁会在乎它是否很大呢？值得注意的重要方面是，F-150有一个新的同步4系统和嵌入式4G LTE调制解调器，可以为多达10个设备提供Wi-Fi接入。同步4的计算能力是上一代的两倍，将成为F-150所有型号的标准，并将具有自然的语音控制和实时映射功能。还将提供通过SiriusXM提供的必要点播音频内容。\n这里的关键新部分是，系统是在福特内部建造的，而不是外包的，可以支持空中软件更新。这意味着该系统推出了对车辆的升级，例如增加或改进驾驶员辅助功能，以及保持地图最新。Sync 4将通过其AppLink系统提供第三方应用，包括Waze和亚马逊Alexa的一个名为Ford+Alexa的版本。\n福特显然瞄准了那些花大量时间在卡车上工作的人。新的F-150将在中控台区域配备一个可选的工作面。表面被设计成一个方便的地方，用来签署文件，安装15英寸大小的笔记本电脑，或者停放三明治。最妙的是，福特设法保住了控制台移位器。司机按下按钮，它就会折叠成一个隔间，为笔记本电脑工作区腾出空间。\n后门外面是另一个工作面，包括集成尺子、移动设备支架、杯架和铅笔架。\n回到驾驶室的是卧铺座椅，在大揭幕之前得到了一些报道。这些“最大倾斜式”座椅有国王牧场(King Ranch)、白金(Platinum)和限量型(Limited)等高端车型可供选择，而且可以像广告中说的那样：平放到近180度。\n福特正在提供其“动力助推”系统，这是指全混合动力总成，在装饰水平上从F-150XL到有限。该系统将福特3.5升V6发动机和10速变速器与35千瓦电动机相结合。这款电动马达将使用再生制动能量捕获器，帮助位于卡车下方的1.5千瓦时锂离子电池充电。\n福特表示，其目标是EPA估计的单箱汽油行驶里程约700英里，并将提供至少12000磅的最大可用拖曳能力。\n卡车还将提供一种名为Pro Power Onboard的车载发电机。该功能在可选的汽油发动机上提供2.0千瓦的输出。混合动力F-150将标配2.4千瓦的输出或可选的7.2千瓦的输出。\n车主可以通过机舱内的插座以及货舱内最多四个120伏20安培插座使用此电源。7.2千瓦的电源选项将包括一个240伏30安培的插座。该系统将允许工具上的电池在车辆移动时充电。\n这里太多了，很难保持整齐。驾驶员辅助功能是福特品牌的Co-Pilot 360 2.0系统的一部分。重要的细节是，更多这些先进的驾驶员辅助功能是基础XL内饰的标准配置，包括具有自动紧急制动和行人检测功能的碰撞前辅助功能、具有动态搭载辅助功能的后视摄像头、自动远光前大灯和自动开/关前大灯。\n福特增加了(查看笔记)10个新的驾驶员辅助功能。其中最值得注意的是Active Drive Assist，这是福特计划通过对特定车辆进行软件更新而推出的免提驾驶功能，包括2021年第三季度推出的全电动野马马赫-E(Mustang Mach-E)。\n免提功能将在美国和加拿大预先绘制的、分隔的高速公路上运行约10万英里。监控系统将包括一个先进的面向司机的红外摄像头，它将跟踪眼睛凝视和头部位置，以确保司机注意道路。DMS将在免提模式下使用，并在司机选择车道居中模式时使用，该模式适用于任何有车道线的道路。不向前看的司机将通过仪表盘上的视觉提示进行通知。\n还有“交叉口辅助”和“主动停车辅助2.0”，前者在司机试图左转时检测迎面而来的车辆，后者在司机按住按钮的平行或垂直停车动作中处理所有转向、换档、刹车和油门控制。\n最后，还有“拖车反向引导”和“专业拖车后备辅助”。这两个都不是新功能，但它们对于拖车用户来说都是重要的功能。", "note_en": "Of course, none of that really matters. It’s all about what Ford has done to improve the most important and profitable vehicle in its lineup. It’s been six years since the last redesign. This all-new F-150 offers kind of performance and abundance options that Ford truck owners have come to expect. Ford is offering 11 different grille options, for instance.\n But what stands out this time is the tech as well as a push beyond mild hybrids into the realm of a full hybrid powertrain.\n Here’s all the technology in the new F-150, starting with the interior and specifically the infotainment system.\n  The base XL version of the truck will come standard with an 8-inch center touchscreen display. However, on higher trims — XLT and above — the F-150 will have a 12-screen that can be split so that users can control multiple functions simultaneously, including navigation, music or truck features.\n   Who cares if the display is big if it doesn’t have the underlying connectivity to support a host of features? The important aspect to note is the F-150 has a new SYNC 4 system and embedded 4G LTE modem, which can provide Wi Fi access for up to 10 devices. SYNC 4, which has twice the computing power or the previous generation, is going to be standard in all models of the F-150 and will feature natural voice control and real-time mapping. The requisite on-demand audio content offered via SiriusXM will also be available.\n  The critical new piece here is that system, which was built within Ford instead of outsourced, can support over-the-air software updates. That means the system roll out upgrades to the vehicle such as adding or improving driver assistance features and keeping maps up to date. SYNC 4 will offer third-party apps through its AppLink system, including Waze and a version of Amazon’s Alexa called Ford+Alexa.\n  Ford is clearly aiming for people who spend a lot of time working out of their truck. The new F-150 will come with an optional work surface in the center console area. The surface is designed to be used as a convenient place to sign documents, set up a laptop up to 15-inches in size or park that sandwich. The nifty part is that Ford managed to keep the console shifter. The driver hits the button, it folds into a compartment and makes room for the laptop work area.\n  Out on the tailgate is another work surface that includes integrated rulers, a mobile device holder, cupholder and pencil holder.\n  Back inside the cab are the sleeper seats, which got a bit of coverage before the big reveal. These “max recline” seats are available in the higher end models like King Ranch, Platinum and Limited and do as advertised: fold flat to nearly 180 degrees.\n  Ford is offering its “PowerBoost” system, which refers to the full hybrid powertrain, on trim levels from the F-150 XL to the Limited. The system combines Ford’s 3.5-liter V6 engine and 10-speed transmission with a 35-kilowatt electric motor. This electric motor will use regenerative braking energy capture to help recharge the 1.5-kilowatt-hour lithium-ion battery, which is located underneath the truck..\n Ford said it’s targeting an EPA-estimated range of about 700 miles on a single tank of gas and will deliver at least 12,000 pounds of available maximum towing.\n  The truck will also offer an onboard generator called Pro Power Onboard. The feature is available with a 2.0-kilowatt output on optional gas engines. The hybrid F-150 will come standard with 2.4 kilowatts of output or an optional 7.2 kilowatts of output.\n Owners can access this power source through outlets located in the cabin as well as up to four 120-volt 20-amp outlets in the cargo. The 7.2 kw power option will include a 240-volt 30-amp outlet. The system will allow for the batteries on tool to charge while the vehicle is moving.\n  There are so many in here, it’s hard to keep them straight. The driver assistance features are part of Ford’s branded Co-Pilot 360 2.0 system. The important details are that more of these advanced driver assistance features are standard on the base XL trim, including a pre-collision assist with automatic emergency braking and pedestrian detection, rearview camera with dynamic hitch assist and auto high-beam headlamps and auto on/off headlamps.\n Ford has added (checks notes) 10 new driver-assist features. The most notable one is Active Drive Assist, the hands-free driving feature that Ford plans to roll out via software updates to specific vehicles, including the all-electric Mustang Mach-E in the third quarter of 2021.\n The hands-free feature will work on about 100,000 miles of pre-mapped, divided highways in the U.S. and Canada. The monitoring system will include an advanced infrared driver-facing camera that will track eye gaze and head position to ensure drivers are paying attention to the road. The DMS will be used in the hands-free mode and when drivers opt for lane-centering mode, which works on any road with lane lines. Drivers who don’t keep their eyes forward will be notified by visual prompts on their instrument cluster.\n Then there’s “Intersection Assist,” which detects oncoming traffic while the driver is attempting a left turn, and “Active Park Assist 2.0,” which handles all steering, shifting, braking and accelerator controls during a parallel or perpendicular parking maneuver while the driver holds down a button.\n Finally, there is “Trailer Reverse Guidance” and “Pro Trailer Backup Assist.” Neither are new, but they’re important features for users who haul trailers.", "posttime": "2020-06-26 11:48:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,ford,功能", "title": "\n福特最重要的汽车中的所有技术：2021年的F-150卡车", "title_en": "\n\t\t\t\tAll the tech in Ford’s most important vehicle: the 2021 F-150 truck\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/all-the-tech-in-fords-most-important-vehicle-the-2021-f-150-truck/", "via": "", "real_tags": ["福特", "ford", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很高兴向Python-dev社区提交一个新的PEP以供审查。这是与勃兰特·布赫、托拜厄斯·科恩、伊万·列夫基夫斯基和塔林的合作。\n很多人都想用一种类似于Scala、Rust、F#、Haskell和其他具有函数风格的语言中的模式匹配形式来扩展Python。这个话题经常出现在Python-Ideas上(最近一次是昨天：-)。", "note_en": "I&#39;m happy to present a new PEP for the python-dev community to review. Thisis joint work with Brandt Bucher, Tobias Kohn, Ivan Levkivskyi and Talin.\n Many people have thought about extending Python with a form of patternmatching similar to that found in Scala, Rust, F#, Haskell and otherlanguages with a functional flavor. The topic has come up regularly onpython-ideas (most recently yesterday :-).", "posttime": "2020-06-26 11:46:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "结构化,pattern,python", "title": "PEP 622：结构化模式匹配", "title_en": "PEP 622: Structural Pattern Matching", "transed": 1, "url": "https://mail.python.org/archives/list/python-dev@python.org/thread/RFW56R7LTSC3QSNIZPNZ26FZ3ZEUCZ3C/", "via": "", "real_tags": ["结构化", "pattern", "python"]}, {"category": "", "categoryclass": "", "imagename": "6b071139b1975d1dd1312b84d6a00b66.jpeg", "infoid": 1008348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纽约时报”(New York Times)的员工在另一项敏感的编辑决定上意见不一，这标志着这家有记录的报纸内部最近一次爆发冲突，过去几个月来，该报一直受到内部冲突的困扰。\n周一晚些时候，这位创立了博客Slate Star Codex的科学和哲学作家宣布，他将关闭这个阅读量很大的网站，因为他说时报即将发表一篇报道，分享他的真实身份。\n执掌该博客的精神病学家斯科特·亚历山大(Scott Alexander)用自己的名字和中间名撰写文章，他说，由于过去曾有过针对他的死亡威胁，他不想透露自己的全名，也担心这会让他的精神科诊所和病人处于危险之中。取而代之的是，他要求他的读者给“纽约时报”发垃圾邮件，要求该报不要刊登他的全名。\n“在考虑了我的选择后，我决定选择你们现在看到的那个，”他在这个被清理的网站上唯一的一篇帖子中写道。“如果没有博客，就没有故事。或者，这篇报道至少要讨论一下《纽约时报》为了获得点击量而将随机博客作者拒之门外的策略。\n这位博主的支持者立即跟进，猛烈抨击“纽约时报”，并声称该出版物是在不必要地“欺骗”这位精神病学家和作家。在该报的队伍中，亚历山大有一些明显的盟友-特别是在非编辑人员中。\nSlate Star Codex事件在“纽约时报”的“新闻编辑室-反馈”松弛频道引发了一场紧张的对话，这是一个内部留言板，员工们越来越有勇气对该报以及不可避免地对自己同事的工作提出批评和质疑。\n在亚历山大的博客帖子之后，该报技术和产品团队的几名编辑部非编辑人员询问他为什么被“解雇”，并指出这位博客作者的事业在计算机科学网站黑客新闻(Hacker News)上获得了吸引力。另一名非编辑人员说，他们为该报的客户服务部门标记了这篇尚未发表的报道，“以防这场雪球般的取消数量激增。”\n一名员工写道：“我们的一名开发人员正在询问一位科技博客作者，他关闭了他们的博客，而不是被我们欺骗了。”“这是因为我们的标准造成的吗？技术部门的人能提供一些见解吗？“\n“我真诚地希望，记者们不打算刊登某人的全名，这个人似乎有几个该死的充分理由用假名写博客，”另一名非编辑时报员工怒气冲冲地写道，这呼应了其他技术和产品员工的情绪。\n“纽约时报”的几名员工予以回击，指出该报并不是在“抛弃”亚历山大，因为这个词被广泛用来描述揭露一个人的身份的目的明确是为了鼓励骚扰的情况。\n这场纷争只是最近几周扰乱《纽约时报》的一系列内部紧张局势中的最新一起。本月早些时候，该报的观点版发表了共和党参议员汤姆·科顿(Tom Cotton)的一篇专栏文章，呼吁唐纳德·特朗普(Donald Trump)总统“出兵”，以回应全国范围内反对警察暴行的抗议活动，之后，许多编辑人员公开表示反抗。数十名员工在社交媒体上公开告诫该报，称这篇评论文章将黑色时报的员工置于危险境地。那次内部起义导致了市政厅，该报的高管轮流向愤怒的员工道歉，因为他们经营了参议员的专栏；这导致了观点编辑詹姆斯·班内特(James Bennet)的下台，他承认在这篇文章发表前没有对其进行审查。\n最近发生的其他事件进一步暴露了该报的裂痕，松弛频道经常是冲突的东道主。\n内部人士告诉每日野兽报，在过去的几周里，时报的一些非编辑人员越来越积极地在编辑部回馈室提出问题，这是一个拥有2000多名时报员工的频道，已经为反馈提供了一个方便的论坛，但也引发了争议和内部头疼。虽然一些编辑人员欣赏并接受了这些批评，但编辑部的其他记者和编辑对非编辑部工作人员对新闻采集、报道和编辑过程的热情入侵感到愤怒。\n本月早些时候，“纽约时报”媒体专栏作家本·史密斯(Ben Smith)指出，贝内特离职后，两名员工立即在Slake上发了一个“断头台”的表情符号，引发了内部投诉和时报发言人的公开谴责。这些表情符号最初是在新闻编辑室-回馈室分享的。\n许多泰晤士报的牛肉已经连续几周在房间里上演了。虽然一些员工周二就Slate Star Codex的决定进行了辩论，但一名员工也对观点编辑巴里·韦斯(Bari Weiss)提出了质疑，称当她在Twitter上发帖称自己对科顿专栏的愤怒感到沮丧时，她“直截了当地撒了谎，说纽约时报内部不存在一场战斗，因为她知道这会是一条更有趣的推文。”\n一些员工似乎厌倦了渠道中持续不断的来来回回，特别是在没有直接参与正在辩论的特定决策的员工中。\n周二，一位人士插话提醒员工，他们的评论广泛可供数千人查看。这位员工写道：“我想温和地提醒大家，这个闲置的渠道有2000人，我们应该注意这一点。”", "note_en": "New York Times employees are at odds over another sensitive editorial decision, marking the latest flare-up within the paper of record that has been roiled by internal strife over the past several months.\n Late on Monday, the science and philosophy writer who founded the blog Slate Star Codex announced that he was shutting down his widely read site over what he said was a forthcoming story in the  Times that would share his real identity.\n Scott Alexander, the psychiatrist who helms the blog and writes under his first and middle name, said that he did not want to reveal his full name because of past death threats made against him, as well as fear that it would put his psychiatric clinic and patients at risk. Instead, he asked his readers to spam  The  New York Times demanding the paper not publish his full name.\n “After considering my options, I decided on the one you see now,” he wrote in the only post now atop the scrubbed website. “If there’s no blog, there’s no story. Or at least the story will have to include some discussion of NYT’s strategy of doxxing random bloggers for clicks.”\n  The blogger’s supporters immediately followed through, slamming the  Times and claiming the publication was unnecessarily “doxxing” the psychiatrist and writer. And within the paper’s ranks, Alexander has some apparent allies—particularly among non-editorial staffers.\n The Slate Star Codex incident set off a tense conversation in the  Times’ “newsroom-feedback” Slack channel, an internal message board in which staff have felt increasingly emboldened to criticize and raise questions about the paper and, inevitably, the work of their own colleagues.\n Following Alexander’s blog post, several non-editorial newsroom staffers from the paper’s tech and product teams asked why he was being “doxxed,” and pointed out that the blogger’s cause was gaining traction on the computer-science site Hacker News. Another non-editorial staffer said they flagged the not-yet-published story for the paper’s customer care department “in case this snowballs into a spike in cancellations.”\n “One of our developers is asking about a tech blogger who took their blog down rather than be doxed by us,” one employee wrote. “Is this something arising because of our standards? Can someone from the technology desk provide some insight?”\n “I sincerely hope that the reporters did not intend to print the full name of someone who seems to have several damned good reasons to blog with a pseudonym,” fumed another non-editorial  Times staffer, echoing a sentiment reflected by other tech and product staffers.\n Several  Times staffers pushed back, noting that the paper was not “doxxing” Alexander, as that term is widely used to describe situations where the goal of revealing a person’s identity is specifically to encourage harassment.\n The dust-up is just the latest in a series of internal tensions that have roiled the  Times in recent weeks. Many editorial staffers  openly revolted earlier this month after the paper’s opinion page published a column from Republican Sen. Tom Cotton calling for President Donald Trump to “send in the troops” in response to nationwide protests against police brutality. Dozens of employees openly admonished the paper on social media, saying the op-ed put Black  Times staffers in danger. That internal uprising led to a town hall in which the paper’s  executives took turns apologizing to irate staffers for running the senator’s column; and it resulted in  the ouster of opinions editor James Bennet, who admitted to having not reviewed the piece before its publication.\n Other recent incidents have further exposed fissures at the paper, with Slack channels often playing host to the conflicts.\n Insiders told The Daily Beast that over the past few weeks, some non-editorial staffers at the  Times have become increasingly active in raising issues in the newsroom-feedback room, a channel with more than 2,000  Times staffers that has already provided a convenient forum for feedback but has sparked controversy and internal headaches as well. While some editorial staffers have appreciated and accepted the criticism, other reporters and editors in the newsroom have bristled at the zealous incursion by non-newsroom staff into the newsgathering, reporting, and editing process.\n  Earlier this month,  New York Times media columnist Ben Smith noted that immediately following Bennet’s departure, two employees reacted in Slack with an emoji of the word “guillotine,” prompting internal complaints and a public reprimand from a  Times spokesperson. The emojis were initially shared in the newsroom-feedback room.\n Many of the  Times beefs have played out in the room for weeks on end. While some employees debated the Slate Star Codex decision on Tuesday, one staffer also raised issues about opinion staff editor Bari Weiss, saying that when she posted on Twitter about her dismay over the anger about Cotton’s column, she “straight up lied about a nonexistent battle within the new york times because she knew it would be a juicier tweet.”\n Some employees have appeared to tire of the constant back-and-forth in the channel, particularly among employees with no direct involvement in particular decisions being debated.\n On Tuesday, one person chimed in to remind staff that their comments were widely available for thousands of people to see. “I’d like to gently remind people that there are two thousand people in this slack channel and we should be mindful of that,” the employee wrote.", "posttime": "2020-06-26 11:26:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,开发商,times,员工", "title": "《纽约时报》开发商就让斯科特·亚历山大昏迷的决定争论不休", "title_en": "New York Times developers squabble over decision to doxx Scott Alexander", "transed": 1, "url": "https://www.thedailybeast.com/the-slate-star-codex-doxxing-is-the-latest-squabble-inside-new-york-times", "via": "", "real_tags": ["开发", "开发商", "times", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一台安装了LXD的专用服务器，在其中我运行了一系列系统容器来托管我的许多游乐场服务，要访问这些LXC容器的操作系统，我需要通过SSH连接到LXD主机，然后执行或ssh连接到该LXC容器。\n这变得单调乏味，并且想要一种直接ssh到它们的方式，因为它们没有公共IP地址，这是不可能的，但是发现使用代理跳转来访问它们是可能的。\n添加虚拟机管理程序上创建的公钥(~/.ssh/id_rsa.pub)和目标VM的~/.ssh/Authorized_Key文件。\nHost*StrictHostKeyChecking no UserKnownHostsFile=/dev/null主机虚拟机管理程序主机名hv.domain.com用户myuser IdentityFile~/.ssh/id_rsa主机CTR1主机名10.37.117.132用户根标识符File~/.ssh/id_rsa ProxyJump虚拟机管理程序。\n$ssh CTR1警告：将&#39；x，x&#39；(ECDSA)永久添加到已知主机列表。警告：将&#39；10.37.117.132&#39；(ECDSA)永久添加到已知主机列表。root@CTR1~$。\n我叫阮，我是一名来自南非开普敦的DevOps工程师。我热衷于AWS、开源、容器、Linux、自动化，并与世界分享我的发现。在我的网站ruan.dev上有更多关于我的信息。关注@ruanbekker", "note_en": "I have a dedicated server with LXD installed where I have a bunch of system containers running to host a lot of my playground services, and to access the operating system of those lxc containers, I need to SSH to the LXD host, then exec or ssh into that LXC container.\n This became tedious and wanted a way to directly ssh to them, as they don’t have public ip addresses, it’s not possible but found its possible to access them using proxyjump.\n    Add the created public key ( ~/.ssh/id_rsa.pub) on the hypervisor and the target vm’s  ~/.ssh/authorized_key files.\n  Host *  StrictHostKeyChecking no  UserKnownHostsFile=/dev/null  Host hypervisor  Hostname hv.domain.com  User myuser  IdentityFile ~/.ssh/id_rsa  Host ctr1  Hostname 10.37.117.132  User root  IdentityFile ~/.ssh/id_rsa  ProxyJump hypervisor\n  $ ssh ctr1 Warning: Permanently added &#39;x,x&#39; (ECDSA) to the list of known hosts. Warning: Permanently added &#39;10.37.117.132&#39; (ECDSA) to the list of known hosts. root@ctr1~ $\n  My name is  Ruan, i&#39;m a DevOps Engineer from Cape Town, South Africa. I&#39;m passionate about AWS, OpenSource, Containers, Linux, Automation and sharing my findings with the world. More info about me on my website,  ruan.dev.      Follow @ruanbekker", "posttime": "2020-06-26 11:25:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,公网,ssh", "title": "对没有公网IP的虚拟机使用带SSH的ProxyJump", "title_en": "Use ProxyJump with SSH for VMs with No Public IPs", "transed": 1, "url": "https://blog.ruanbekker.com/blog/2020/06/13/using-proxyjump-with-ssh-for-vms-with-no-public-ips/", "via": "", "real_tags": ["虚拟机", "公网", "ssh"]}, {"category": "", "categoryclass": "", "imagename": "8862d47d534f32e4940df69cb9065b30.png", "infoid": 1008346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你本周观看了苹果公司一年一度的WWDC活动，或者甚至一直在随意地观察公司发布的一些声明，你可能会注意到一些新的东西-一些有点刺耳的东西。\n昨天，苹果推出了全新的MacOS版本，超越了X的名称，进入了新的版本号：11。MacOS11(被称为Big Sur)拥有大量新功能，使其更接近iPhone和iPad上的iOS同行，但有一个领域似乎存在分歧，那就是…。它的图标和用户界面设计。你可以把它归咎于一种叫做新形态主义的东西，不管你喜欢还是讨厌它，它都将是UI设计的下一波浪潮。\n新形态主义已经在Design Twitter上流传了一段时间了，大多数人对它的反应都是负面的。有很多有效的批评，主要是早期的设计实验侧重于设计差异，而不是实际的可用性。但是，如果你超越我们到目前为止已经看到的具体实现-通常是由专注于形式主义而不是可用性的设计师创建的-到基本概念，你会发现有些东西实际上是相当令人兴奋和可持续的；一些东西还没有完全实现。\n归根结底，气体同形是对光如何在三维空间中运动的关注。它的前身skeumogism通过模拟表面的纹理，如扑克桌上的毛毡或磁带录音机的刷子金属，在数字界面上创造了真实感。这种设计风格的一个附属(虽然不发达)方面是照明，它与所表现的材料进行了逼真的互动；这就是为什么阴影和黑暗在早期的界面中如此普遍。\n归根结底，气体同形是对光如何在三维空间中运动的关注。\n但为这些设计进行的照明和纹理模拟仍然相对简单：哪些物体是有光泽的，哪些是粗糙的？哪些对象是透明的，哪些是不透明的？这些最终都是功利性的、有点武断的选择。气形与其前身的不同之处在于，焦点是光本身，以及它如何与纯数字空间中的各种物体相互作用。气体变形中的灯光模拟更为复杂，主要集中在一个对象的灯光如何影响另一个对象，或对象本身的功能。\n最早招致如此多批评的例子通常是在白色背景上显示白色UI元素，这种差异完全是由元素与光的相互作用、从顶部反射的光线和从底部投射的阴影造成的，这表明它们是从表面升起的。在此样式能够广泛应用之前，需要进行可用性改进，但它展示了偏态形态主义所没有的东西-超越单个对象并规定多个对象如何在一个世界中交互的全局照明方案的概念。\n在2010年代初，放弃了偏向形态主义，转而采用平面设计，这使得颜色和设计元素的工具包变得更加广泛和更具表现力。从物理物体的基础上解脱出来，物体可以变成任何颜色，空间可以得到更好的利用。通过去掉仅仅是为了表示元素是为了表示三维对象而存在的不必要的修饰，设计师可以自由探索。\n在平面设计近十年的统治期间，在可用性和用户体验领域取得了许多重要的发展。但是随着时间的推移，以物理为基础的二维设计变得越来越不常见，重新引入物理总是会吸引人们回到并进一步研究。当你考虑把从平面设计中学到的东西带回更具体的背景中的可能性时，这一点就加倍正确了。于是钟摆开始往回摆动。\n撇开批评不谈，气体变形有一个不可否认的特点，使它如此吸引人。看起来是新的。平面设计的核心“数字原生”外观，以及它对堆栈、页面和层等概念的实现，在过去的8年多里已经变得无处不在。新形态主义与用户已经习惯的东西相去甚远，它确实让人感觉像是一种新的语言。这种差异化是有价值的，特别是对于像苹果这样试图将其操作系统19年来首次迁移到新的编号版本的公司来说。\niPhone于2007年发布，iOS7的扁平化设计于2013年推出。它的基本外观和感觉比最初的歪曲变形的iPhone UI存在的时间更长，只做了很小的改动。Neumogism提供了一种保持事物运转的方法，而不需要对设计语言进行认真的检查(老实说，“实现气流”最基本的就是添加投影、外部发光和偶尔出现的3D对象；非常简单)。但是，当系统超越了简单的视觉效果，当它探索和利用这些数字空间，使用户界面更容易理解、更容易接近和更美观时，气体形态真正变得有趣起来。\n那么为什么苹果在这件事上看起来..。有点糟糕吗？如前所述，气体同形的概念框架相对较新，并且在很多设计界都存在阻力。UI设计长期受到设计师的困扰，他们喜欢创造不受实际可用性或用户体验需求束缚的假想设计，这纯粹是一种正式的练习，这导致了内斗。一方面，概念设计探索就是那样的探索。另一方面，UI/UX设计与某些设计规程不同，因为对成功和失败有非常具体的定义(有些人会争辩说，所有的设计规程都需要严格的解释，这只是Design™的本质，但那些人是书呆子，是错误的)。\n设计者可以“探索”用户需要点击的按钮是否应该是不可见的，但是由于用户因此不能前进，在此应用程序中，设计被认为是失败的。在界面设计领域，表单试验总是很难与可用性取得平衡，但这并不意味着它应该被完全抛弃。铁杆的UX/UI设计者贬低几乎所有形式的正式实验都是不必要的和投机性的；几乎不可能存在于现实世界中。\n一些对同形的否定源于这种分歧，早期的深入探索集中在将新风格的最可识别的方面应用到用户界面的最可识别的方面，导致它被用于这样做会破坏UX设计必要原则的地方。为了发展到应有的形态，我们需要把它们分开一点，独立地发展它们。在某种程度上，苹果针对OS11的新设计系统似乎是这种脱钩实际发生的第一个高调实例。有一些变形风格的迹象，特别是在这些图标中，所有这些图标都关注于在非UI元素上使用的灯光的复杂交互。\n与往常一样，第三方将以比苹果更快和更大胆的速度推进球。\n在一些地方，它比其他地方执行得更成功。在从二维图标到三维灵感的变形风格转换明显的地方，图标更成功。例如，查看消息图标，语音气泡的概念是明确定义的，因此该对象在这些照明条件下的行为方式是已知的。然而，还有其他更抽象的实例，其中到三维、光交互对象的平移不太清楚。这就是风格开始崩溃的地方。\n照片图标就是一个很好的例子。为了让它容易辨认，设计几乎没有改变，但为了让它在这个充气的世界里舒服地坐着，一些阴影和外部光芒被应用到了一个原本平坦的图标上。这增加了复杂性，而不会将实际对象解析为与套件中的其他图标一起存在于共享空间中的对象。App Store图标的表现略好于Photos图标，但同样的原理也适用于此，将专为二维设计的线条图标转化为有效的3D数字面条。要让这样的东西真正属于设计者正在走向的对象套件，它需要经历更重要的重新思考，这就为用户的困惑打开了大门。\n显然，这些设计将随着时间的推移逐渐修改，直到它们开始形成一个更有凝聚力的整体。当你回顾iOS7平板设计的第一次裁剪时，有很多边缘粗糙的地方。Helvetica Neue太淡了，整体外观的颜色太甜了。一点一点地，它进化了，变得更精致了。苹果进军同形现象无疑也是如此。事实上，它迈向这一设计流派的举动为这一概念赋予了一种合法性的气氛，现在任何希望融入公司新哲学的设计师都会很好地利用这一概念。\n现在整个设计界将被迫面对同形现象，围绕系统的可能性将会有一个爆炸性的发展，在这个新的数字空间的哲学如何合法地适用于用户界面设计和功能方面将取得更大的进展。与往常一样，第三方将以苹果无法召集的更快和更大胆的速度向前推进--这是我们真正开始释放气体同形的力量的时候。\nJack Koloskus是输入和大纲的首席设计者。他喜欢植物、蘑菇(不是植物)、3D软件和设计网站。你可以在这里跟他打个招呼。", "note_en": "If you watched Apple’s annual  WWDC event this week, or have been even casually observing some of the announcements the company made, you may have noticed something new — something a bit jarring.\n Yesterday saw the introduction of a  whole new version of macOS, moving beyond the X designation into a new version number: 11. macOS 11 (known as Big Sur) boasts loads of new features that bring it closer to parity with its  iOS counterparts on iPhones and iPads, but one area where there seems to be a divergent path is… its icon and  user interface design. You can blame that on a little something called Neumorphism, and like or hate it, it’s the next wave in UI design.\n Neumorphism has been making the rounds on Design Twitter for a little while now, and most of the response to it has been negative. There are plenty of valid criticisms out there, primarily that early design experiments were focused on design differentiation and not actual usability. But if you look beyond specific implementations we’ve seen thus far — usually created by designers whose focus is formalism as opposed to usability — to the base concepts, there is something that&#39;s actually quite exciting and sustainable; something that has yet to be fully realized.\n  When you boil it down, neumorphism is a focus on how light moves in three-dimensional space. Its predecessor, skeumorphism, created realism in digital interfaces by simulating textures on surfaces like felt on a poker table or the brushed metal of a tape recorder. An ancillary — though under-developed — aspect of this design style was lighting that interacted realistically with the materials that were being represented; this is why shadows and darkness were so prevalent in those early interfaces.\n When you boil it down,  neumorphism is a focus on  how light moves in three-dimensional space.\n But the lighting and texture simulations being done for those designs were still relatively simple: which objects are shiny and which are rough? Which objects are transparent and which opaque? These were ultimately utilitarian and somewhat arbitrary choices. What sets neumorphism apart from its progenitor is that the focus is on the light itself and how it interacts with a variety of objects in a purely digital space. The light simulations in neumorphism are more complex, and are focused on how light from one object could affect another, or the function of the object itself.\n  The earliest examples that drew so much criticism often show white UI elements on white backdrops, with the differentiation created solely by the interaction of the elements with light, the reflection of the light from the top and shadows cast from the bottom, suggesting they were raised from the surface. There are usability improvements that would need to happen before this style could be widely applied, but it demonstrated something that skeumorphism had not — a concept of a global lighting schema that transcends one individual object and dictates how multiple objects interact in one world.\n   Abandoning skeumorphism in favor of flat design in the early 2010s allowed for a much wider and more expressive toolkit of colors and design elements. Untethered from a basis in physical objects, objects could become any color and space could be better used. By removing unnecessary embellishments that only existed to indicate an element was intended to represent a three-dimensional object, designers were free to explore.\n During the near-decade reign of flat design a lot of important developments were made in the realms of usability and user experience. But as time wore on and physically-based, two-dimensional design became less common, the reintroduction of physicality was always going to be appealing to return to and investigate further. This is doubly true when you consider the possibility of bringing the learnings from flat design back into a more tangible context. And so the pendulum began to swing back.\n  Criticisms aside, there is one undeniable feature to neumorphism that makes it so appealing. It looks  new. Flat design’s core “digitally native” look, and its implementation of ideas like stacks, pages, and layers have become familiar to the point of ubiquity over the last 8+ years. Neumorphism is far enough away from what users have become accustomed to that it genuinely does feel like a new language. That differentiation is valuable, especially to a company like Apple trying to move its operating system to a new numbered version for the first time in 19 years.\n The iPhone was released in 2007, and the flat-design of iOS 7 was introduced in 2013. Its basic look and feel has existed for longer than the original skeumorphic iPhone UI and has undergone only minor alterations. Neumorphism provides a way to keep things moving without committing to a serious overhaul of the design language (let’s be honest, “implementing neumorphism” at its most basic is just adding drop shadows, outer glows, and the occasional 3D object; pretty easy). But where neumorphism really gets interesting is when the system goes beyond simple visuals, when it explores and exploits those digital spaces to make user interfaces more understandable, approachable, and beautiful.\n   So why does Apple’s take on it look... kinda bad? As mentioned earlier, the conceptual framework of neumorphism is relatively new, and there has been a resistance to it in much of the design world. UI design has been plagued for the longest time by designers who love to create hypothetical designs untethered to actual usability or user experience needs as a purely formal exercise, and this has led to infighting. On one hand, conceptual design explorations are just that — explorations. On the other, UI/UX design is unique from some design disciplines in that there are very concrete definitions of success and failure (some would argue that  all design disciplines require a rigid interpretation and that this is simply the nature of Design™ but those people are nerds and are wrong).\n  A designer could “explore” whether a button that a user needs to tap should be invisible, but since the user is thus not able to progress, in this application the design is considered a failure. Experimentation with form will always be difficult to balance with usability in the field of interface design, but it doesn’t mean it should be dismissed outright. Hardcore UX/UI designers disparage almost all forms of formal experimentation as unnecessary and speculative; hardly something that could exist in the real world.\n Some of the dismissals of neumorphism stem from this divide, the early in-depth explorations centered around applying the most identifiable aspects of the new style to the most identifiable aspects of user Interfaces, resulting in it being utilized in places where doing so would break the necessary tenets of UX design. In order to develop neumorphism to what it should be, we need to separate them a little and develop them independently. In a way, Apple’s new design system for OS 11 seems to be the first high-profile instance of this decoupling actually happening. There are signs of neumorphic style, particularly a focus on the complex interactions of light being used on non-UI elements all throughout these icons.\n As always,  third-parties will move the ball forward  faster and with more  daring than  Apple can muster\n In some places it’s executed more successfully than others. In places where the translation from two-dimensional icons to three-dimensional-inspired neumorphic style was obvious, the icons are more successful. Looking at the Messages icon, for example, the concept of a speech bubble is well-defined, and so the way that this object would behave in these lighting conditions is known. There are other, more abstract instances, however, where the translation to a three-dimensional, light-interacting object is less clear. This is where the style starts to break down.\n  The Photos icon is a great example. In an effort to keep it recognizable, the design was barely altered, but to allow it to sit comfortably in this neumorphic world, some drop shadows and outer glows were applied to an otherwise flat icon. This adds complexity without resolving the actual object into something that exists in shared space alongside other icons in the suite. The App Store icon fared a little better than the Photos icon did, but the same principle applies, translating a line-art icon designed for two-dimensions into what is effectively 3D digital noodles. To have something like this truly belong in the suite of objects designers are moving towards, it would need to undergo a more significant rethink, which then opens the door for user confusion.\n Obviously, these designs will be gradually modified over time until they begin to form a more cohesive whole. When you look back at the very first cut of flat design in iOS 7, there were many places that were  rough around the edges. The Helvetica Neue was too light, the overall appearance of the colors too saccharine. Little by little, it evolved and became more refined. The same will be undoubtedly true of Apple’s foray into neumorphism. In fact, its move towards this school of design confers an air of legitimacy to the concept that will now be well exploited by any designer hoping to fit within the company’s new philosophy.\n  Now that the design world at large will be forced to reckon with neumorphism, there will be an explosion of development around the possibilities of the system, and far more headway made on how the philosophy of this new digital space is legitimately applicable to user interface design and functionality. As always, third-parties will move the ball forward faster and with more daring than Apple can muster — and this is when we will truly begin to unlock the power of neumorphism.\n  Jack Koloskus is the lead designer for Input and The Outline. He likes plants, mushrooms (which are not plants), 3D software, and designing websites. You can say hello to him  here.", "posttime": "2020-06-26 11:04:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,新形态,big,设计", "title": "苹果、大苏尔与新形态主义的兴起", "title_en": "Apple, Big Sur, and the Rise of Neumorphism", "transed": 1, "url": "https://www.inputmag.com/design/apple-macos-big-sur-the-rise-of-neumorphism", "via": "", "real_tags": ["apple", "苹果", "新形态", "big", "设计"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "邮政信箱22400坦佩，亚利桑那州，邮编：85285(480)9677979*传真：(480)8942028年。\nGPO信箱982斯普林希尔，QLD 4127(07)3891 1191*传真(07)3891 1194", "note_en": "P.O. Box 22400 Tempe, AZ 85285  (480) 967-7979 * fax (480) 894-2028\n  GPO Box 982 Springhill, QLD 4127  (07) 3891 1191 * fax (07) 3891 1194", "posttime": "2020-06-26 11:04:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,邮寄,mail,亚利桑那州", "title": "邮寄游戏", "title_en": "Play-by-Mail Games", "transed": 1, "url": "http://reality.com/", "via": "", "real_tags": ["游戏", "邮寄", "mail", "亚利桑那州"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你是新来的，你可能想订阅我的RSS订阅源，或者把我的帖子放到你的收件箱里。谢谢光临！\n如果有一条建议，我希望我能在山上向所有的云工程师喊话，那就是这条。\n运营，特别是规模化运营，是一个难题。边缘案例变得司空见惯。失败比比皆是。自动化和标准化至关重要。拥有如此规模的软件和硬件运营经验的人往往是稀有和昂贵的。他们所犯的错误和他们从中学到的情况并不容易接受。\n当您使用某家主要云供应商提供的托管服务时，您可以以较低的软件价格获得其团队的全部智慧以及自动化和系统的强大功能。\n托管服务是一种服务，如AWS关系数据库服务、Google Cloud SQL或Azure SQL数据库。使用所有这三项服务，您将获得最佳的关系数据库系统配置和管理。您需要进行配置，但是设置复制或备份等困难或乏味的任务可以快速而轻松地完成(这一点可以从多年来养育和照料MySQL复制系统的人那里学到)。根据您的云供应商和需求，您可以获得针对现代软件系统关键组件的托管服务，例如：\n(请注意，这些都是您的应用程序的组件，开发人员仍需要时间才能将它们线程在一起。)。\n它会运行得很好的。云提供商可以提供的专业知识和他们能够负担得起的自动化很可能会超越您的能力，特别是跨多种服务。\n会更便宜的。特别是当你考虑到员工成本的时候。最昂贵的AWS RDS实例约为10万美元/年(全价)。这不是苹果与苹果的比较，但在许多国家，您无法以那样的薪水获得数据库架构师。\n开发起来会更快。开发人员可以专注于连接这些基础设施，而不是学习如何设置和运行它们。\n托管服务并不适用于所有人。如果您需要能够调整每个设置，托管服务不会允许您这样做。您可能具有托管服务无法满足的严格性能或安全要求。您也可以从托管服务开始，然后逐渐发展壮大。(恭喜！)。\n另一个重要的考虑因素是锁定。一些托管服务与备选方案兼容(Kubernetes服务就是一个很好的例子)。如果是这样的话，你可以移动云层。其他是专有的，如果您需要迁移，则需要对您的应用程序进行大量修改。\n如果您在云中工作，并且您的应用程序需要构建块(如关系数据库或消息队列)，请从托管服务开始(如果不满足您的需要，请自行托管)。利用云供应商的卓越运营优势，您将能够构建更多、更快的产品。", "note_en": "If you&#39;re new here, you may want to subscribe to my  RSS feed or  get my posts in your inbox. Thanks for visiting!\n  If there was one piece of advice I wish I could shout from the mountains to all cloud engineers, this would be it.\n Operations, especially operations at scale, are a hard problem. Edge cases become commonplace. Failure is rampant. Automation and standardization are crucial. People with experience running software and hardware at this scale tend to be rare and expensive. The mistakes they’ve made and situations they’ve learned from aren’t easy to pick up.\n When you use a managed service from one of the major cloud vendors, you’re getting access to all the wisdom of their teams and the power of their automation and systems, for the low price of their software.\n A managed service is a service like AWS relational database service, Google Cloud SQL or Azure SQL Database. With all three of these services, you’re getting best of breed configuration and management for a relational database system. There’s configuration needed on your part, but hard or tedious tasks like setting up replication or backups can be done quickly and easily (take this from someone who fed and cared for a mysql replication system for years). Depending on your cloud vendor and needs, you can get managed services for key components of modern software systems like:\n  (Note that these are all components of your application, and will still require developer time to thread together.)\n  It’s going to be operated well. The expertise that the cloud providers can provide and the automation they can afford to implement will likely surpass what you can do, especially across multiple services.\n It’s going to be cheaper. Especially when you consider employee costs. The most expensive AWS RDS instance is approximately $100k/year (full price). It’s not an apples to apples comparison, but in many countries you can’t get a database architect for that salary.\n It’s going to be faster for development. Developers can focus on connecting these pieces of infrastructure rather than learning how to set them up and run them.\n A managed service doesn’t work for everyone. If you need to be able to tweak every setting, a managed service won’t let you. You may have stringent performance or security requirements that a managed service can’t meet. You may also start out with a managed service and grow out of it. (Congrats!)\n Another important consideration is lock-in. Some managed services are compatible with alternatives (kubernetes services are a good example). If that is the case, you can move clouds. Others are proprietary and will require substantial reworking of your application if you need to migrate.\n If you are working in the cloud and you need a building block for your application like a relational database or a message queue, start with a managed service (and self host if it doesn’t meet your needs). Leverage the operational excellence of the cloud vendors, and you’ll be able to build more, faster.", "posttime": "2020-06-26 11:02:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托管,managed,服务", "title": "使用托管服务。请", "title_en": "Use Managed Services. Please", "transed": 1, "url": "http://www.mooreds.com/wordpress/archives/3358", "via": "", "real_tags": ["托管", "managed", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "杰森·戴维斯→地图→球面沃罗诺伊图数据：自然地球，1：10M文化矢量：人口稠密的地方(行政-0首都)。世界领土被重新划分，因此一个地区由最近的首都决定。这是使用球面Voronoi图计算的，该图在计算距离时考虑了地球的曲率。", "note_en": "Jason Davies →  Maps →  Spherical Voronoi Diagrams   Data:  Natural Earth, 1:10m Cultural Vectors: Populated Places (Admin-0 capitals).  World territories have been redrawn so that a region is determined by the closest capital city. This is calculated using a  spherical Voronoi diagram, which takes into account the curvature of the Earth when computing distances.", "posttime": "2020-06-26 10:21:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "沃罗诺,capitals,球面", "title": "世界首都沃罗诺伊", "title_en": "World Capitals Voronoi", "transed": 1, "url": "https://www.jasondavies.com/maps/voronoi/capitals/", "via": "", "real_tags": ["沃罗诺", "capitals", "球面"]}, {"category": "", "categoryclass": "", "imagename": "30e146e22a68b1374bba16e02b608e98.gif", "infoid": 1008340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上瘾是指尽管一种化学物质正在造成伤害，但它无法停止消费或从事某种活动。\n我几乎接触到了所有与上瘾有关的物质或行为：酒精、毒品、咖啡、色情、性、赌博、工作、消费、设备和社交媒体。我都滥用过，但别以为我上瘾了。在平衡记分卡上，这些物质和行为，包括虐待和所有，在我的生活中都是净积极的，甚至@Twitter。\n我们物种的大多数疾病和困难都是由稀缺造成的-盐、糖、脂肪太少，认可太少，安全，交配机会太少。因此，当我们发现这些东西时，我们的大脑就会产生终极的奖赏--愉悦荷尔蒙多巴胺。这是有道理的。大自然奖励那些确保物种繁殖的行为。\n流水线、处理能力和亚马逊Prime不仅达到了生存的最低门槛，而且给我们的物种带来了新的威胁：超多。糖尿病、收入不平等和假新闻都是我们相信越多越好的结果。杰夫·贝佐斯捕获和囤积挪威的GDP对这个物种来说没有意义，但他的本能(害怕饥饿，挥舞着权力)占据着至高无上的地位。\n生存、繁殖和消费应该使下一代变得更聪明、更快、更强大。事情脱轨的地方是我们的创新经济比我们的本能发展得更快的一个功能。从历史上看，人类从事的活动都有自然的停止提示-章节的结尾，结尾的字幕。Facebook、Instagram和Netflix等平台已经系统地消除了停车提示。甚至赌场的布局也刻意没有硬角，所以这都是一个连续的空间，你会一直穿过它，继续到下一场比赛。\n技术进步，对我们本能的校准，在无穷无尽的卷轴中达到顶峰。我们找不到开关。与我们的父母和祖父母不同，对我们来说，多巴胺的释放不再依赖于牺牲、承诺或毅力，而是静静地坐着，就像在15秒、14秒、13秒之后，第五集就要开始了。过滤过的照片更多了，色情作品更多了，股票更多了，利润更多了，多巴也更多了，更多的时间没有了需要从事生活的麻烦。\n最近的顶级交易商是在线交易平台(OTP)。在交易平台上，无穷无尽的卷轴是什么样子的？\n游戏化：用户每天最多可以点击1000次，以提高自己在罗宾汉现金管理功能(本质上是应用程序上的一个高收益支票账户)等待名单上的位置。\n我们的机构(法院、国会、证券交易委员会)应该放慢我们的思考速度，这样我们的本能就会得到遏制，我们就可以决定不歧视，不往河里倒汞，不让一家破产的汽车租赁公司(Hertz)发行注定一文不值的股票。你输了，他们就赢了。\n技术变革的速度远远超过了我们人类适应无穷无尽的刺激的能力。这种调制方式上的差异爆发了我们青少年抑郁和社会混乱的程度。我们正处在一场超级海洋喷火中，每天都在加速，希望机身能在接近音障时保持一致--播放“辛普森一家”31季，栩栩如生的视频游戏，无处不在的日益极端的色情内容，高清实时记录你15岁的女儿没有被邀请参加的派对，社交媒体算法推动情绪与真实性的对比，以及立即批准“公牛扩散”的保证金。\n昨天，在得知20岁的亚历山大·卡恩斯(Alexander Kearns)自杀的消息后，我简直是一团糟。卡恩斯来自伊利诺伊州内珀维尔，对市场感兴趣，开始交易股票。卡恩斯错误地认为，在罗宾汉应用程序上交易期权后，他下跌了73万美元，并结束了自己的生命。我们不知道还有什么因素在这里起作用，年轻人在市场上赔钱后自杀并不是什么新现象。\nFacebook和Twitter做了CNN和福克斯几十年来一直在做的事情，但做得更好。我担心罗宾汉可能会成为一个让人上瘾的交易平台--Instagram。罗宾汉的用户年龄偏小(32%的访问者年龄在25-34岁之间)。该公司报告称，2020年第一季度新增客户300万。一半是首次交易。此外，随着拉斯维加斯和体育博彩几乎关闭，OTPS已经成为新兴赌博成瘾扎根的地方和/或你的赞助商是经销商的康复设施。\n学习投资和了解市场是件好事，与在线朋友…联系也是如此。在某种程度上。社交媒体和赌博有相同的上瘾心理机制：可变奖励(当你不断执行一个动作，希望获得可能但不太可能的奖励)。这是一种“最容易上瘾、最难戒掉”的行为。罗宾汉的管理层和投资者已经从大技术公司得到了启示，并做出了一个有意识的决定，为了个人财富而无视我们年轻人的福祉。\n12%的交易活动来自日内交易者，而日内交易者只占所有有利可图的交易者的1.6%。\n投资者在其投资组合中持有风险较高的股票，他们目前的经济状况与他们的抱负水平之间存在很大差异。\n大多数文章将集中在我们美国人认为的新手在线交易员…激增带来的深刻风险上。市场可能会下跌。大多数市场高点都与散户投资者入场不谋而合。据我所知，我们还没有见过20多岁的人投资政府救援基金，通过智能手机的预先批准来杠杆化，导致市场崩盘的规模。\n我们的民选官员以及对金钱和创新者的粗暴崇拜已经淹没了那些负责减缓我们思维速度和保护我们孩子安全的机构。乔·斯卡伯勒(Joe Scarborough)说得好：“马克、谢丽尔和杰克，你们暴露了自己是平淡无奇的庸俗之徒，将美国人的健康、种族正义、公平选举和基本真理置于危险境地。”\n我们在哪里转弯？保护孩子免受设备成瘾的压力主要落在父母身上--限制(严重)使用，并让学校的其他家长也限制使用，这样孩子们就不会觉得自己是一个例外。这很困难，而且需要完成。“电子速食”，也许对整个家庭来说，可以让神经系统重新启动。降低你的多巴胺阈值会让你获得更少的快感。\n上瘾的威胁一直在拖累我们的家庭。我们的一个儿子表现出了与设备成瘾一致的行为。太可怕了。他做的、说的和努力的每一件事，都是为了追求在他的iPad上等待着的多巴热销。他妈妈和我正在做大多数父母都会做的事情--阅读，寻求外界帮助，限制使用。但最重要的是，我们在试着放慢脚步。花时间陪他，尤其是在户外或看书。和他一起上床的时间到了，给他讲他祖父成为皇家海军蛙人的故事。让一切都慢下来。它似乎在起作用。\n我看到了亚历克斯·卡恩斯，也看到了我的大儿子。一个笑容满面的书呆子，对市场着迷，寻找多巴安非他明。我无法想象那个家庭的痛苦。我无法想象我们如何失去了剧本，让有意义的-创新和金钱-压倒了深刻的东西：我们的孩子。青少年自杀率在十年间增加了56%。2009年至2015年间，10岁至14岁的女孩自残事件增加了两倍。每天使用社交媒体超过五个小时的青少年患抑郁症的可能性是那些每天使用社交媒体不到一小时的青少年的两倍。\n难怪蒂姆·库克不想让他的侄子出现在社交媒体上？如果他不是蒂姆·库克，他还会说，我也不想让他有iPad吗？\n武器是我们的手机和平板电脑，子弹是由反社会的寡头领导的社交媒体公司。现在，我们可能有一个新的威胁在捕食年轻人：在线交易平台。\n我们是一个病毒肆虐的国家，宵禁警报会发送到我们的手机上。创新已成为剥削的代名词。我们在市场中找到了慰藉，但市场并不是经济或进步的反映，而是越来越多地反映出少数公司利用技术与监管之间的差距进行套利的能力。这真让人沮丧。怎么办呢？我会查一下我的点赞、提及和股票。\n另外，通过报名参加由您真心教授的七月战略冲刺活动，加入一个由全球近3000名校友组成的网络。我们G教授节目的嘉宾是进化心理学家杰弗里·米勒，他认为美德信号实际上可能是一股巨大的向善的力量。", "note_en": "Addiction is the inability to stop consuming a chemical or pursuing an activity although it’s causing harm.\n I engage with almost every substance or behavior associated with addiction: alcohol, drugs, coffee, porn, sex, gambling, work, spending, devices, and social media. I’ve abused all of them, but don’t think I’m addicted. On a balanced scorecard, these substances and behaviors, abuse and all, have been a net positive in my life, even @twitter.\n Most disease and hardship for our species has been a function of scarcity — too little salt, sugar, fat, approval, safety, opportunities to mate. As a result, when we find these things, our brain produces the ultimate reward, the pleasure hormone dopamine. And it makes sense. Nature rewards behaviors that ensure the propagation of the species.\n  The assembly line, processing power, and Amazon Prime have not only met the minimum thresholds for survival but created a new threat to our species: superabundance. Diabetes, income inequality, and fake news all are a function of our belief that more is better. Jeff Bezos capturing and hoarding the GDP of Norway doesn’t make sense for the species, but his instincts (fear of starvation, wielding power) reign supreme.\n Survival, propagation, and consumption should result in the next generation being smarter, faster, and stronger. Where things have come off the rails is a function of our innovation economy moving faster than our instincts. Historically, humans have engaged in activities that have natural stopping cues — the end of a chapter, the end credits. Platforms like Facebook, Instagram, and Netflix have systematically  eradicated stopping cues. Even casinos are deliberately laid out without hard angles, so it’s all one continuous space and you keep moving through it, on to the next game.\n Technological progress lapping the calibration of our instincts culminates in an endless scroll. We’re unable to find the off switch. Unlike our parents and grandparents, for us, dopamine release no longer depends on sacrifice, engagement, or grit, but on sitting still, as in 15, 14, 13 seconds until episode five of  Killing Eve will begin. There are more filtered photos, more porn, more equities, more margin, more dopa, and more time without the nuisance of needing to engage in life.\n The most recent crack dealers are online trading platforms (OTPs). What does an endless scroll look like on a trading platform?\n Gamification: Users can tap up to  1,000x per day to improve their position on the waitlist for Robinhood’s cash management feature (essentially a high-yield checking account on the app).\n  Our institutions (courts, Congress, the SEC) are supposed to  slow our thinking so our reflexive instincts are checked and we can decide not to discriminate, not to pour  mercury into the rivers, and not to let a bankrupt car rental firm ( Hertz) issue shares bound to be worthless. You lose, they win.\n Technological change is vastly outpacing our species’ ability to adapt to an endless barrage of stimuli. This discrepancy in modulation has exploded our levels of teen  depression and social chaos. We are in a Supermarine Spitfire, accelerating every day, hoping the fuselage holds together as we approach the sound barrier — streaming 31 seasons of  The Simpsons, lifelike video games, ubiquitous porn of increasing extremes, high-def documentation in real time of the party your 15-year-old daughter wasn’t invited to, social media algorithms fueled on emotion vs. veracity, and immediate approval of margin for a “bull put spread.”\n  I was a fucking mess yesterday after learning of the suicide of Alexander Kearns, a 20-year-old from Naperville, Illinois, who was interested in the markets and began trading stocks. Kearns mistakenly believed he was down $730,000 after trading options on the Robinhood app and took his own life. We don’t know what other factors were at play here, and young men taking their own lives after losing money in the market is not a new phenomenon.\n  Facebook and Twitter do what CNN and Fox have been doing for decades, but better. I’m afraid Robinhood might become an addictive platform — Instagram for trading. Robinhood users skew young (32% of visitors are between 25–34). The firm reported 3 million new accounts in Q1 2020.  Half were first-time traders. In addition, with Vegas and sports wagering all but shut down, OTPs have become the place where emerging gambling addiction can take root and/or a rehab facility where your sponsor is a dealer.\n Learning to invest and understanding the markets are good things, as is connecting with friends online… to a point. Social media and gambling have the same addictive psychological mechanism: variable rewards (when you keep performing an action in hopes of getting a possible but unlikely reward). This is the type of behavior that’s the “most addictive and  hardest to stop.” Robinhood management and investors have taken cues from Big Tech and made a conscious decision to disregard the well-being of our youth for personal enrichment.\n   12% of all trading  activity is from day-traders, yet day-traders are only 1.6% of all profitable traders.\n   Investors with a large differential between their existing economic conditions and their aspiration levels hold riskier stocks in their portfolios.\n Most articles will focus on what we, Americans, view as the profound risk with the surge in rookie online traders… that the  markets might go down. Most market tops coincide with retail investors entering. We haven’t, to my knowledge, seen the scale of a market crash driven by twentysomethings  investing government rescue funds, levered up via preapproval on their smartphones.\n Our elected officials and gross idolatry of money and innovators have overrun the institutions charged with slowing our thinking and keeping our kids safe. Joe Scarborough  put it well: “Mark, Sheryl, and Jack, you have revealed yourselves to be vapid vulgarians who put at risk Americans’ health, racial justice, fair elections, and basic truths.”\n Where do we turn? The bulk of the pressure to protect kids from device addiction falls on parents — limiting use (severely) and getting other parents at school to limit use as well, so kids don’t feel they are an exception. It’s difficult, and it needs to be done. An “electronics fast,” perhaps for the whole family, can allow the nervous system to  reset. Lowering your  dopamine threshold allows a smaller amount of pleasure to be satisfying.\n The threat of addiction has been slowing our household down. One of our sons demonstrates behavior consistent with device addiction. It’s terrifying. Everything he does, says, and works toward, is in pursuit of the dopa hit waiting on his iPad. His mom and I are doing what most parents would do — reading, seeking outside help, limiting use. But more than anything, we’re trying to slow things down. Time with him, especially outdoors or with books. Time in bed with him telling him stories about his grandfather becoming a frogman in the Royal Navy. Slowing everything down. It appears to be working.\n I see Alex Kearns, and I see my oldest son. A nerd, with a big smile, fascinated by the markets and seeking dopa hits. I can’t imagine the pain of that family. I can’t imagine how we’ve lost the script, letting the meaningful—innovation and money—trump the profound: our kids. The youth suicide rate has increased by  56% in a decade. Girls between 10 and 14 had a  tripling of self-harm episodes between 2009 and 2015. Teens who are on social media for more than five hours a day are  twice more likely to be depressed than those who are on for less than an hour.\n  Is it any wonder Tim Cook  doesn’t want his nephew on social media? If he wasn’t Tim Cook, would he also say, I don’t want him to have an iPad either?\n The weapons are our phones and tablets, and the bullets are social media  firms headed by sociopathic oligarchs. And now, we may have a new menace preying on young men: online trading platforms.\n We are a virus-ravaged nation where curfew alerts are sent to our phones. Innovation has become synonymous with exploitation. We find solace in the market being high, but the market is not a reflection of the economy or progress, but increasingly of the ability of a few firms to arbitrage the gap between the pace of technology and regulation. It’s depressing. What to do? I’ll check my likes, mentions, and stocks.\n  P.S. Join a network of nearly 3,000 alumni worldwide by signing up for the  July Strategy Sprint, taught by yours truly. And our guest on the   Prof G Show is evolutionary psychologist Geoffrey Miller, who thinks virtue signaling could actually be a huge force for good.", "posttime": "2020-06-26 10:20:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,gamified,市场", "title": "罗宾汉把在线交易变成了一种瘾", "title_en": "Robinhood Has Gamified Online Trading into an Addiction", "transed": 1, "url": "https://marker.medium.com/robinhood-has-gamified-online-trading-into-an-addiction-cc1d7d989b0c", "via": "", "real_tags": ["交易", "gamified", "市场"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当黑洞碰撞时，考虑到这两个物体都是看不见的，随之而来的宇宙戏剧被认为是在黑暗的斗篷下上演的。但现在天文学家相信他们已经完成了这种合并的第一次光学观测，其标志是一道比太阳亮一万亿倍的火焰。\n这场耀斑与去年由引力波天文台LIGO探测到的已知黑洞合并有关，LIGO接收到了通过空间结构发出的涟漪。最新的观测表明，当这些灾难性事件发生在一个更巨大的黑洞的吸积盘内时，它们会被周围的尘埃和气体照亮，使它们也能被光学望远镜看到。\n“这个超大质量黑洞在这次突如其来的耀斑之前已经存在多年了，”这项工作的主要作者、加州理工学院天文学研究教授马修·格雷厄姆(Matthew Graham)说。“我们的结论是，耀斑很可能是黑洞合并的结果。”\n作者并未完全排除其他来源，但纽约城市大学(City University Of New York)的合著者萨维克·福特(Saavik Ford)表示，怀疑的窗口很窄。“我们有99.9%的把握，”她说。\n伯明翰大学引力波天文学研究所所长Alberto Vecchio教授表示，专家们现在将密切关注最新的观测结果与LIGO科学家将在未来几个月发表的对同一事件的详细分析。“如果两个独立的观察结果与…一致。这真的会是相当壮观的事情，“他说。\n在观察之前，福特和她的同事巴里·麦克南(Barry McKernan)从理论上预测，如果黑洞合并发生在第三个超大质量黑洞的吸积盘的背景下，黑洞合并将是可见的，这与预期相反。\n福特和麦科南与兹维基瞬变设施(ZTF)的项目科学家格雷厄姆合作，ZTF是一台全天巡天望远镜，旨在发现明亮的事件。福特说：“事实证明，它对这样的东西来说是完美的。”\n科学家们仔细研究了Zwicky的数据，寻找与LIGO检测到的已知碰撞在时间和地点上重合的任何耀斑，LIGO在每次检测到耀斑时都会发布公共警报。有一件事格外引人注目：LIGO在去年5月检测到一项名为S190521g的合并。\n格雷厄姆说：“这肯定不是我们三年前开始调查时预测到的事情之一。”\n更仔细的分析表明，合并发生在一个名为J1249+3449的遥远的超大质量黑洞附近，其直径相当于地球绕太阳的轨道。这对较小的黑洞位于吸积盘的外部，一个由恒星、尘埃和气体组成的光环围绕着巨大的中央天坑旋转。福特说：“这些物体就像愤怒的蜜蜂一样聚集在中心那只可怕的蜂后周围。”\n由于这对黑洞的大小约为怀特岛大小，总质量为150个太阳，向内螺旋并合并，引力波在太空中发出，新的合并后的物体受到相反方向的踢，使其穿过圆盘的尘埃和气体，向外飞入周围空间。\n麦科南说：“正是气体对这颗飞驰的子弹的反应，产生了用望远镜可以看到的明亮耀斑。”\n如果得到证实，这些观测可能有助于解决黑洞天文学中的一个核心问题：重量级黑洞的数量远远超过了应有的数量。黑洞是由坍塌的古老恒星形成的。当它们合并时会形成更大的黑洞，但一些黑洞太大了，从理论上说，它们滚雪球达到观测到的大小需要比宇宙年龄更长的时间。\n一个潜在的解释是，如果黑洞在吸积盘中聚集在一起，那么多轮合并的可能性就会大得多。Vecchio说：“如果你有一个地方可以把这些黑洞保留在一个地方，那么你就可以有效地将它们配对。”“气体是把它们粘在一起的粘合剂。”\nLIGO的观测并不容易解决这个问题，因为引力波天文学不能准确地定位合并发生在天空中的什么地方，但如果用传统望远镜也能看到同样的事件，答案可能很快就会出来。这项研究结果发表在“物理评论快报”杂志上。", "note_en": "When black holes collide, the ensuing cosmic drama was assumed to play out under the cloak of darkness, given that both objects are invisible. But now astronomers believe they have made the first optical observations of such a merger, marked by a blaze of light a trillion times brighter than the sun.\n The flare was linked to a known black hole merger detected last year by the gravitational wave observatory, Ligo, which picked up ripples sent out through the fabric of space. The latest observations suggest that when these cataclysmic events occur within the accretion disk of an even more gigantic black hole, they are brilliantly illuminated by the surrounding dust and gas, making them also visible to optical telescopes.\n “This supermassive black hole was burbling along for years before this more abrupt flare,” said Matthew Graham, a research professor of astronomy at the California Institute of Technology and lead author of the work. “We conclude that the flare is likely the result of a black hole merger.”\n  The authors have not entirely ruled out other sources, but Saavik Ford, a co-author based at the City University of New York, said the window of doubt was narrow. “We are 99.9% sure,” she said.\n Prof Alberto Vecchio, the director of the Institute of Gravitational Wave  Astronomy at the University of Birmingham, said experts would now be watching closely to see how the latest observations align with a detailed analysis of the same event due to be published in the coming months by Ligo scientists. “If the two independent observations line up … this would really be something rather spectacular,” he said.\n The observations came after Ford and her colleague, Barry McKernan, made theoretical predictions that black hole mergers would be visible, contrary to expectations, if they occurred against the backdrop of the accretion disk of a third supermassive black hole.\n Ford and McKernan teamed up with Graham, a project scientist for the Zwicky Transient Facility (ZTF), an all-sky survey telescope designed to spot bright events. “It turns out to be perfect for something like this,” said Ford.\n  The scientists trawled through the Zwicky data looking for any flares that coincided in place and time with known collisions that had been detected by Ligo, which releases public alerts each time a detection is made. One event stood out: a merger referred to as S190521g that Ligo detected in May last year.\n “It’s certainly not one of the things you would have predicted three years ago when we started the survey,” said Graham.\n Closer analysis suggested the merger had taken place in the vicinity of a distant supermassive black hole called J1249+3449, with a diameter equivalent to Earth’s orbit around the sun. The pair of smaller black holes sat at the outer reaches of the accretion disk, a halo of stars, dust and gas swirling around the vast central sinkhole. “These objects swarm like angry bees around the monstrous queen bee at the centre,” said Ford.\n As the pair of black holes, each around the size of the Isle of Wight and with a combined mass of 150 suns, spiral inwards and coalesce, gravitational waves are sent out across space and the new, merged object experiences a kick in the opposite direction, sending it ploughing through the dust and gas of the disk and out into surrounding space.\n  “It’s the reaction of the gas to this speeding bullet that creates a bright flare, visible with telescopes,” said McKernan.\n If confirmed, the observations could help to resolve a central problem in black hole astronomy: that there are far more heavyweight black holes than there ought to be.  Black holes form from collapsed ancient stars. Bigger black holes form when these merge, but some black holes are so big that in theory it ought to have taken longer than the age of the universe for them to snowball to their observed size.\n A potential explanation is that if black holes cluster together in accretion disks then multiple rounds of mergers become far more likely. “If you have a place where you can retain these black holes in one place, then you can pair them up efficiently,” said Vecchio. “The gas is the glue that keeps them all together.”\n Ligo observations are not easily able to resolve this question, because gravitational wave astronomy is not able to pinpoint exactly where in the sky a merger has taken place, but if the same events could be seen using conventional telescopes, an answer could be imminent. The findings are published in the journal  Physical Review Letters", "posttime": "2020-06-26 10:18:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,黑洞,holes", "title": "科学家说，黑洞可能与一万亿个太阳的光融合。", "title_en": "Black holes may merge with light of a trillion suns, scientists say", "transed": 1, "url": "https://www.theguardian.com/science/2020/jun/25/black-holes-may-merge-with-light-of-a-trillion-suns-scientists-say", "via": "", "real_tags": ["科学家", "黑洞", "holes"]}]