[{"category": "", "categoryclass": "", "imagename": "a253641dad19a274732c109cc45d7e56.jpg", "infoid": 1000435, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还没有足够的研究来得出为什么冠状病毒的症状似乎在一些人身上重新出现的原因", "note_en": "There hasn’t been enough research to conclude why symptoms of Covid-19 seem to re-emerge in some people", "posttime": "2020-05-03 09:23:33", "tags": "病毒,dawn,冠状病毒,research", "title": "“False Dawn”康复困扰着再次患病的病毒幸存者", "title_en": "‘False Dawn’ Recovery Haunts Virus Survivors Who Fall Sick Again", "transed": 1, "url": "https://www.bloombergquint.com/onweb/-false-dawn-recovery-haunts-virus-survivors-who-fall-sick-again", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "dawn", "冠状病毒", "research"]}, {"category": "", "categoryclass": "", "imagename": "6a9dfec79864bb4f73f0135ce0443d98.jpg", "infoid": 1000434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Bitfinex密码交易所正在进行新的努力，以寻找并可能追回其支付处理商的银行账户被冻结后被四个不同国家的法律当局扣押的超过8亿美元的用户资金。\n本月，Bitfinex的母公司iFinex Inc.在科罗拉多州、亚利桑那州和佐治亚州申请了传票，要求联邦法院协助存放可能持有Crypto Capital资金的银行。Crypto Capital是Bitfinex存储客户资金和兑换资金的支付处理商。\n希望确认银行记录的实体可以申请传票，因为银行通常不能在没有法院命令的情况下共享这些文件。\niFinex周二申请传票，要求太阳信托银行在佐治亚州的员工作证。在此之前，4月初，科罗拉多银行(Bank Of Colorado)和亚利桑那州的ABT&amp；Trust也提出了类似的传票申请。Bitfinex正在寻找证据，以支持其在波兰、里斯本、伦敦和其他地方的银行账户中持有的约8.8亿美元的法律索赔，这些账户已被对Crypto Capital提起反洗钱刑事指控的当局查封。\nBitfinex的申请是在2019年10月在加州提交初步传票请求之后提出的，当时该交易所要求TCA Bancorp的一名前高管就Crypto Capital的账户作证。这张传票后来被批准了。亚利桑那州的一名联邦法官同样批准了iFinex的申请，而佐治亚州的一名地方法官则要求该公司首先提交一份公司披露声明。\n“Crypto Capital使用北卡罗来纳州花旗银行的银行账户。(“花旗银行”)接受申请人客户的某些存款。该账户是以‘全球贸易解决方案有限责任公司’的名义持有的，“亚利桑那州的备案文件说。\nBitfinex总法律顾问斯图尔特·霍格纳(Stuart Hoegner)告诉CoinDesk，提交这些文件的目的是“获得有关Crypto Capital持有的基金的进一步信息”。\n他通过一名发言人表示：“正如我们之前所说的，Bitfinex是欺诈的受害者，它正在通过在各国启动的法律措施，维护自己对Crypto Capital拿到的资金的权利。”\nBitfinex及其姊妹公司stablecoin运营商Tether正受到民事诉讼和纽约州总检察长办公室的调查，指控它们存在欺诈和市场操纵行为。\nTether在公开声明中否认了这些指控。自调查开始以来，它还积极发行了更多系绳(USDT)；仅在周四就发行了约8，000万美元的新USDT虚拟货币。根据鲸鱼警报跟踪服务，这将货币的推定市值提高到约80亿美元，在过去40天里增加了约20亿美元。\n一直在密切关注此案的比特币作家兼研究人员贝内特·汤姆林(Bennett Tomlin)说，“当你在研究像这样的大型系泊债券发行时，你应该看看其他货币在市场上的表现。”“其他稳定股似乎没有同样的资金流入。而且你很少会看到系绳赎回。它几乎总是会上升。因为我们从他们的律师那里了解到，它并没有得到充分的支持，所以我通常对更大规模的系绳发行持怀疑态度。\nBitfinex在提交给佐治亚州的文件中表示，随着其他银行关系的恶化，Bitfinex开始依赖Crypto Capital。由于担心与跨境洗钱法相冲突，银行对为加密货币贸易提供便利变得谨慎起来。\n然而，加密资本的总裁伊万·曼努埃尔·莫利纳·李(Ivan Manuel Molina Lee)在10月份被波兰当局逮捕，并被控为一个国际团伙的成员，该团伙“从非法来源”洗钱高达15亿złoty，约合3.9亿美元。当局写道，Molina Lee的罪行包括“使用加密货币交易所为哥伦比亚贩毒集团洗钱”。\n10月，联邦检察官起诉Crypto Capital的第二名负责人奥兹·优素福(Oz Yosef)，罪名是合谋实施银行欺诈、银行欺诈和合谋经营无照汇款业务。奥兹·优素福(Oz Yosef)的妹妹拉维德(Ravid)也因与Crypto Capital有关的欺诈指控而被起诉，但她仍在以色列逍遥法外。\n根据Bitfinex的申请，Crypto Capital设法将Bitfinex储备隐藏在世界各地的银行。“Crypto Capital随后在包括欧洲和美国在内的多家银行之间转移资金。仅在美国，申请人就有信息表明，Crypto Capital不仅使用了SunTrust持有的账户，还使用了美国银行、科罗拉多银行、花旗银行、企业银行和信托银行、汇丰银行、Stearns银行、富国银行、TD银行和美国银行的账户，“Bitfinex.。\n备案文件显示，Bitfinex希望追踪Crypto Capital是如何将资金从一个银行账户转移到另一个银行账户，以支持其对处理器曾经持有的资金的所有权主张。要做到这一点，需要驾驭用于管理m的错综复杂的账户所有权链、混合资金和财务转账Crypto Capital", "note_en": "The Bitfinex crypto exchange is making a new push to find and potentially recover more than $800 million in user funds seized by legal authorities in four different countries after its payment processor’s bank accounts were frozen.\n iFinex Inc., Bitfinex&#39;s parent firm, applied for subpoenas in Colorado, Arizona and Georgia this month, asking federal courts to aid it in deposing banks that may have held funds for Crypto Capital, the payment processor on which Bitfinex stored customers’ and exchange funds.\n An entity hoping to confirm bank records can apply for a subpoena as banks cannot usually share those documents without a court order.\n iFinex applied for a subpoena Tuesday to depose  SunTrust Bank employees in Georgia. This follows a similar subpoena application to depose the  Bank of Colorado earlier in April and  ABT &amp; Trust in Arizona. Bitfinex is looking for evidence to support its legal claims to about $880 million held in bank accounts in Poland, Lisbon, London and elsewhere that have been seized by authorities pursuing anti-money laundering criminal charges against Crypto Capital.\n Bitfinex’s application follows  an initial subpoena request from October 2019, filed in California, where the exchange sought testimony from a former TCA Bancorp executive about Crypto Capital’s accounts. This subpoena  was later granted. A federal judge  likewise granted iFinex&#39;s application in Arizona, while a magistrate judge in Georgia asked the company to  file a corporate disclosure statement first.\n “Crypto Capital used a bank account with Citibank, N.A. (‘Citibank’) to accept certain deposits from Applicant’s customers. The account was held in the name of ‘Global Trading Solutions, LLC,’” the filing in Arizona stated.\n  Bitfinex General Counsel Stuart Hoegner told CoinDesk the filings “are aimed squarely at obtaining further information” about the funds held by Crypto Capital.\n “As we have said before, Bitfinex is the victim of a fraud and is asserting its rights to funds taken by Crypto Capital through legal measures initiated in various countries,” he said through a spokesperson.\n  Bitfinex and its sister firm, stablecoin operator Tether, are the subject of civil lawsuits and an investigation by the  New York Attorney General&#39;s office alleging fraud and market manipulation.\n Tether has denied the allegations in  public statements. It has also aggressively issued more tether (USDT) since the investigation began; about $80 million in new USDT virtual currency  on Thursday alone. This raises the presumed market value of the currency to about $8 billion, an increase of about $2 billion over the last 40 days, according to the Whale Alert tracking service.\n “When you’re looking at big tether issuances like that, you should look at how other currencies are acting in the market,” said Bennett Tomlin, a bitcoin writer and researcher who has been following the case closely. “The other stablecoins don’t seem to have the same kind of inflows. And you will very rarely see tether redemptions. It almost always goes up. Because we know from their lawyers that  it’s not fully backed, I’m generally skeptical of larger issuances of tether.”\n Bitfinex began to rely on Crypto Capital as other banking relationships deteriorated, the firm said in the Georgia filing. Banks have grown wary of facilitating trade in cryptocurrency for fear of running afoul of cross-border money laundering laws.\n However, the president of Crypto Capital, Ivan Manuel Molina Lee,  was arrested by Polish authorities in October and charged with being a member of an international gang laundering up to 1.5 billion złoty or about $390 million “from illegal sources.” Authorities wrote that Molina Lee’s crimes included “laundering dirty money for Columbian drug cartels using a cryptocurrency exchange.”\n Federal prosecutors indicted a second principal of Crypto Capital, Oz Yosef, in October on charges of conspiracy to commit bank fraud, bank fraud and conspiracy to operate an unlicensed money transmitting business. Oz Yosef’s sister, Ravid, was also indicted on fraud charges connected to Crypto Capital but remains at large in Israel.\n  Crypto Capital managed to stash Bitfinex reserves in banks across the world, according to Bitfinex ’s application. “Crypto Capital subsequently transferred funds between and among various banks, including in Europe and the United States. In the U.S. alone, Applicant has information that Crypto Capital used accounts held not only at SunTrust, but also Bank of America, Bank of Colorado, Citibank, Enterprise Bank &amp; Trust, HSBC, Stearns Bank, Wells Fargo, TD Bank, and US Bank, ”Bitfinex  ...\n  Bitfinex hopes to trace how Crypto Capital moved money from one bank account to another to bolster its ownership claims over funds once held by the processor, according to the filings. Doing so requires navigating the convoluted chain of account ownership, commingled funds and financial transfers Crypto Capital used to manage money, Bitfinex notes in the application.\n Polish banks held about $335 million in Bitfinex fiat currency reserves, while Portuguese banks held about another $218 million, according to the Georgia filing.\n Referring to  statements made by Giancarlo Devasini, Bitfinex ’s chief financial officer, the subpoena application said, “[F]rom approximately April to June 2018, Crypto Capital used a bank account ending in -9503 with Citibank to accept deposits from Applicant ’s customers. The account was held in the name of Global Trading Solutions, LLC. Because the name of this LLC was similar to that of the entity that then owned Crypto Capital (Global Trade Solutions AG), Applicant believed  ...\n Global Trading Solutions LLC is owned by Reggie Fowler, a former National Football League investor tied to Crypto Capital. Fowler was  indicted one year ago on charges of bank fraud and operating an unlicensed money transmitting business.\n He  rejected a p l ea deal earlier this year; a trial scheduled to begin Tuesday has been pushed to Jan. 11, 2021. A Department of Justice spokesperson said he did not know if the delay is related to the COVID-19 pandemic disrupting judicial schedules.\n Citibank in California told Bitfinex’s legal team Fowler opened a separate, personal Citibank banking account at the same time and funded it with a $200,000 deposit from an unknown source and two subsequent wire transfers totaling $4 million. The wire transfers came from Banco BPI, one of three Portuguese banks Crypto Capital used for Bitfinex accounts.\n While Crypto Capital was taking transfers from Bitfinex into one Citibank account, Fowler transferred $380,000 from his account to a SunTrust account, according to the subpoena application.\n  Later, nearly $2 million of iFinex customer funds were transferred from the Citibank account to a Bank of Colorado account, Bitfinex said in the Colorado court filing.\n Citibank told Bitfinex that this Bank of Colorado account “is held in the name of Eligibility Criterion, an entity owned or controlled by Fowler. Moreover, the wire transfer instructions indicated these transfers were ‘Intercompany Transfers.’” according to the document.\n New York courts have enjoined the firms from further depleting their cash reserves and from transferring any of those cash reserves to company executives, and directed the firms’ executives to produce documents and information central to the attorney general’s investigation. The companies are fighting those disclosures in court, an act that the Attorney General’s office described as “ deeply perverse.”\n    The leader in blockchain news, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups.", "posttime": "2020-05-03 09:23:27", "tags": "tether,银行,bitfinex", "title": "Bitfinex，Tether在美国各地寻找失踪8亿美元的传票", "title_en": "Bitfinex, Tether Seek Subpoenas Across US in Hunt for Missing $800M", "transed": 1, "url": "https://www.coindesk.com/bitfinex-tether-seek-subpoenas-across-us-in-hunt-for-missing-800m", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["tether", "银行", "bitfinex"]}, {"category": "", "categoryclass": "", "imagename": "c0812a4035e2c30ee7ae22d5ad612b43.png", "infoid": 1000433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这看起来很简单，但实际上这是谷歌电话面试的标准问题之一。旨在淘汰那些比其他人更了解复杂性的聪明工程师。\n从我在谷歌的朋友那里，我听说70%的人回答错了。这有点令人震惊。\n给定任意字符串，例如。‘aabcdef’；返回第一个循环字符。\n对于字符串中的所有字符，如果其中任何字符是相同的回车字符，则将字符i与其他字符进行比较。\n是的，这个解决方案确实有效。但别指望谷歌之后会给你回电话。\n此解决方案中有两个嵌套的for循环。这应该会提示您，此解决方案的时间复杂度为O(n²)-我们可以做得更好。\n为字符串中的所有字符创建结构为{character}的哈希表/对象/查找表(如果字符在哈希表中，则返回字符)，否则将字符添加到哈希表", "note_en": "It seems simple, but in fact it is one of the standard phone-interview questions at google. Designed to weed out the smart engineers who understand complexity over the rest.\n From my friends at google I heard  70% of people answer it wrong. Which is kind of shocking.\n  Given an arbitrary string of character eg. ‘aabcdef’;  Return the first recurring character.\n   For all characters in string\tCompare character I to every other character\tIf any of those characters are the same\t\tReturn character\n Yes this solution  does work. But don’t expect google to call you back after.\n There are two nested for loops inside this solution. This should tip you off this solution has a time complexity of  O(n²) - we can do much better.\n  Create a hashtable/object/lookup table of structure { character }For all characters in string\tIf character is in the hashtable \t\tReturn character\tElse \t\tAdd character to hashtable", "posttime": "2020-05-03 09:23:11", "tags": "google,面试,谷歌,phone,字符", "title": "谷歌最常见的电话面试问题", "title_en": "Most common phone interview question at Google", "transed": 1, "url": "https://crunchskills.com/most-common-interview-question-at-google/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["google", "面试", "谷歌", "phone", "字符"]}, {"category": "", "categoryclass": "", "imagename": "2c463a4f7ce312c96157ab4ecd9e8af2.png", "infoid": 1000432, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雅虎财经是2020年伯克希尔哈撒韦年度股东大会的独家在线主持人，该年会将于5月2日(星期六)举行。实况报道从美国东部时间下午4点开始。投资者和非投资者都可以现场见证历史，因为伯克希尔哈撒韦公司(Berkshire Hathaway)董事长兼首席执行官沃伦·巴菲特(Warren Buffett)分享了他对公司、市场、经济、公司治理等许多方面的即兴观点。请与我们一起参加这个独特的活动，时间是5月2日星期六下午4：00。", "note_en": "Yahoo Finance is the exclusive online host of the 2020 Berkshire Hathaway Annual Shareholders Meeting which takes place on Saturday, May 2nd. Live coverage begins here at 4:00pmET. Investors and non-investors alike can witness history, live, as Berkshire Hathaway Chairman and CEO Warren Buffett shares his unscripted views on the company, the markets, the economy, corporate governance, and a lot more. Please join us here for this unique event on Saturday May 2nd at 4:00pmET.", "posttime": "2020-05-03 09:23:05", "tags": "2020,伯克希尔,实况,meeting,live", "title": "伯克希尔哈撒韦2020年会实况流", "title_en": "Berkshire Hathaway 2020 Annual Meeting Livestream", "transed": 1, "url": "https://finance.yahoo.com/BRKlivestream/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["2020", "伯克希尔", "实况", "meeting", "live"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000431, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果有哪家公司能很好地抵御冠状病毒，那就是Deliveroo。在封锁的早期，对餐厅和外卖送餐服务的需求激增。几家大型餐厅和快餐连锁店在关闭的早期阶段决定关闭数周，这可能会削弱需求，但随着它们开始重新开业送货-大多数其他活动仍在减少-这家科技公司的前景似乎是光明的。\n现实情况看起来截然不同。本周早些时候，据报道，Deliveroo将从其2500名员工中裁员367人(并再裁员50人)。其他人似乎也处于同样黯淡的境地-据说优步正在讨论裁员约20%，约5400个职位的计划。更广泛的英国初创企业已经要求-并获得了-政府纾困资金。\n为什么Deliveroo在一场应该有利于其商业模式的危机中苦苦挣扎，告诉我们的不仅仅是一家初创公司。该公司名义上需要裁员的理由是，冠状病毒之后将出现经济低迷，这可能会打击订单。这似乎是可能的，但远不是既定的。\n2008年的金融危机导致了自大萧条以来最严重的经济衰退，“廉价奢侈品”的表现相当不错。比方说，人们会用餐厅的一顿饭换一份10 GB的玛莎百货(Marks&Amp；Spencer)套餐。对许多人来说，Deliveroo比餐厅用餐便宜得多-不需要支付保姆的费用，也不需要支付旅行费用，也不需要以餐厅价格购买酒类。为什么Deliveroo会如此肯定经济低迷会是个坏消息？\n答案在于，Deliveroo真正的商业模式几乎与送餐赚钱无关。就像几乎所有其他同类初创企业一样，一旦你考虑到所有成本，Deliveroo的每一次送货都会赔钱，即使在从餐厅收取了很大的提成，并从客户那里收取了送货费之后也是如此。优步，现在已经有十多年的历史了，它的服务提供的每一次乘车和快递员送的每一顿饭仍然是亏损的。\n当每个客户都在亏损时，如果客户数量保持稳定甚至增加，对你的业务来说就不是好消息，除非有人认为这是一件好事。这些公司所依赖的是讲述一个故事-主要是向将在它们身上投资的人讲述。他们的说法是，他们正在“颠覆”现有的行业，将建立巨大的市场份额和客户基础，因此不能不最终变得非常有利可图-只是现在还没有。\n这就是整个风险投资模式-硅谷及其以外的整个科技行业的金融模式。不要担心缓慢和可持续的增长，不要担心利润，不要担心后果。只要全力以赴，皮革地狱，并尽可能快地变得更大。只要有几家公司成功了，大多数公司都会尝试失败，这并不重要。估值将飙升，公司将公开上市(这一程序被称为IPO)，以及…。\n这是一种建立在乐观基础上的整体商业模式。如果没有这种乐观情绪，以及随之而来的自由流动的资金来应对天文数字的损失，整个系统就会崩溃。这才是这类公司面临的真正挑战。这也是为什么拯救这个行业的想法应该是一个笑话：风险资本追逐的回报是其投资的10倍，因为它具有高风险和高回报。如果我们去掉“风险”的因素，我们基本上就是在漏斗……。\n然而，推动这一点超越我们许多人可能乐于写成因果报应的故事的，是它所产生的远远超出世界其他地方的影响。\n科技巨头进军之前支撑了数百万个就业机会并帮助人们谋生的现有行业-出租车和私人出租，餐饮业，仅举几例。他们提供了一种新的、有补贴的替代方案，让顾客相信可以更便宜地提供服务，或者让他们从餐厅体验中精挑细选-例如，许多餐厅依靠酒类销售和一顿饭来弥补利润率。\n这些初创企业进入现有的行业，实质上是向客户免费提供资金：5英镑，价值10 GB的东西。事实证明，这很容易卖出去。但在这个过程中，他们撕裂了现有业务的核心，并按照自己的形象重塑了整个经济部门。现在，面对一场大流行，他们开始和其他人一样苦苦挣扎。不难看出这个令人遗憾的故事是如何结束的。已经扰乱了他们的产业，以至于在营业结束后离开了生意……", "note_en": "If any company can weather coronavirus well, it should be  Deliveroo. The early days of lockdown saw demand surge for the service delivering food from restaurants and takeaways. The decision by several major restaurant and fast-food chains to shut for weeks during the early stages of lockdown might have dented demand, but as they begin to reopen for delivery – with most other activities still curtailed – prospects would seem bright for the tech company.\n The reality looks quite different. Earlier this week,  Deliveroo was reported to be cutting 367 jobs (and furloughing 50 more) from its workforce of 2,500. Others seem to be in similarly bleak positions –  Uber is said to be discussing plans to let go around 20% of its workforce, some 5,400 roles. The broader UK start-up scene has asked for –  and secured – government bailout funds.\n  Why Deliveroo is struggling during a crisis that should benefit its business model tells us about much more than just one start-up. The company’s nominal reasoning for needing cuts is that coronavirus will be followed by an economic downturn, which could hit orders. That’s plausible, but far from a given.\n The financial crash of 2008 – which led to the most severe recession since the Great Depression – saw “cheap luxuries” perform quite well. People would swap a restaurant meal for, say, a £10 Marks &amp; Spencer meal deal. Deliveroo is far cheaper than a restaurant meal for many people – there’s no need to pay for a childminder, or travel, and there’s no need to purchase alcohol at restaurant prices. Why would Deliveroo be so certain a downturn would be bad news?\n The answer lies in the fact that Deliveroo’s real business model has almost nothing to do with making money from delivering food. Like pretty much every other start-up of its sort, once you take all of the costs into account, Deliveroo loses money on every single delivery it makes, even after taking a big cut from the restaurant and a delivery fee from the customer. Uber, now more than a decade old, still loses money for every ride its service offers and every meal its couriers deliver.\n When every customer loses you money, it’s not good news for your business if customer numbers stay solid or even increase, unless there’s someone else who believes that’s a good thing. What these companies rely on is telling a story – largely to people who will invest in them. Their narrative is they’re “disrupting” existing industries, will build huge market share and customer bases, and thus can’t help but eventually become hugely profitable – just not yet.\n This is the entire venture capital model –the financial model for Silicon Valley and the whole technology sector beyond it. Don ’t worry about growing slowly and sustainably, don ’t worry about profit, don ’t worry about consequences. Just go flat out, hell for leather, and get as big as you can as fast as you can. It doesn ’t matter than most companies will try and fail, provided a few succeed. Valuations will soar, the company will become publicly listed (a procedure known as an IPO) and  ...\n This is a whole business model based on optimism. Without that optimism, and the accompanying free-flowing money to power through astronomical losses, the entire system breaks down. That ’s the real struggle facing this type of company. It ’s also why the very idea of bailing out this sector should be a joke: venture capital chases returns of at 10 times their investment, on the basis that it ’s high risk and high reward. If we take out the element of “risk ”, we ’re basically just funnelling  ...\n What pushes this beyond a tale that many of us might be happy to write down to karma, though, is the effects it has well beyond the rest of the world.\n  Tech giants move in on existing sectors that previously supported millions of jobs and helped people make their livelihoods – cabs and private hire, the restaurant business, to name just a few. They offer a new, subsidised alternative, that makes customers believe a service can be delivered much more cheaply, or that lets them cherry-pick from the restaurant experience – many restaurants relied on those alcohol sales with a meal to cover their margins, for example.\n These start-ups come in to existing sectors essentially offering customers free money: £10 worth of stuff for a fiver. It turns out that ’s easy to sell. But in the process, they rip the core out of existing businesses and reshape whole sectors of the economy in their image. And now, in the face of a pandemic, they are starting to struggle just like everyone else. It ’s not hard to see how this sorry story ends. Having disrupted their industries to the point of leaving business after business  ...", "posttime": "2020-05-03 08:23:45", "tags": "风险,poster,餐厅,restaurant", "title": "Deliveroo是风险资本的典范。现在不太好了", "title_en": "Deliveroo was the poster child for venture capitalism. It's not so good now", "transed": 1, "url": "https://www.theguardian.com/commentisfree/2020/may/02/deliveroo-venture-capitalism-food-delivery-business-model", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["风险", "poster", "餐厅"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请注意，我没有写10本你必须读才能在市场上赚数百万美元的书，这看起来有点像是点击诱饵/流言蜚语。不幸的是，从数据科学家/SEO的角度来看，这会更有利可图。\n当我们都经历了这个四部曲时，我只是整理了一份我读过的书的清单，我相信这些书塑造了我对市场的理解，也塑造了我的投资哲学。我认为像“大空头”和“黑天鹅”这样的大图画书比技术书重要得多。\n我认为创造算法和/或交易策略是从创造过程开始的，可能只是盯着图表看几个小时，或者损失很多钱。我很幸运，我是一个自学的程序员，我可以实现我的策略，而不会纠结于我的代码是否是面向对象的，如果我有正确的类等等。我总是说代码是容易的部分，它是找到一个好的策略，而不是困难的部分。\n这些是我喜欢的书，也许你也会喜欢。如果你有什么建议，请在评论中留言，因为我一直在寻找可以读/听的东西。", "note_en": "Notice I didn’t write 10 books you have to read to make millions of dollars in the market.That just seems a little click-bait/Buzz Feedy. Unfortunately, from a data scientist/ SEO perspective that would have been the more profitable.\n  As we all suffer through this quatrine I just put together a list of books that I have read that I believe have shaped my understanding of markets and have molded my investment philosophy. I think bigger picture books such a The Big Short and Black Swan are far more important than technical books.\n Creating algorithms and or trading strategies is something that I believe starts with the creative process, maybe just staring at charts for hours or losing a lot of money. I’m lucky, I’m a self taught coder and I can implement my strategies without getting caught up in whether my code is object oriented and if I have the correct classes etc. I always say that the code is the easy part, it’s finding a good strategy that is hard part.\n So these are some books that I have enjoyed and maybe you will too as well. If you have any recommendation, please leave them in the comments as I’m always looking for something to read / listen to.", "posttime": "2020-05-03 08:23:41", "tags": "算法,algorithms,交易,书籍,构建", "title": "推荐构建交易算法的书籍", "title_en": "Recommend Books for building trading algorithms", "transed": 1, "url": "https://www.strategic-options.com/insight/2020/05/02/recommend-books-for-building-trading-algorithms/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["算法", "交易", "书籍", "构建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JED是适用于Unix、VMS、MSDOS、OS/2、BeOS、QNX和win9X/NT平台的免费文本编辑器。尽管它是专为程序员设计的功能强大的编辑器，但它的下拉菜单功能使其成为最友好的文本编辑器之一。因此，它非常适合撰写简单的电子邮件，以及用各种计算机语言编辑复杂的程序。JED广泛使用了S-lang库，这赋予了它强大的S-lang脚本语言。这个功能和其他功能..。", "note_en": "JED is a freely available text editor for Unix, VMS, MSDOS, OS/2, BeOS, QNX, and win9X/NT platforms. Although it is a powerful editor designed for use by programmers, its drop-down menu facility make it one of the friendliest text editors around. Hence it is ideal for composing simple email messages as well as editing complex programs in a variety of computer languages. JED makes extensive use of the  S-Lang library, which endows it with the powerful  S-Langscripting language. This and other features  ...", "posttime": "2020-05-03 08:01:48", "tags": "程序,程序员,programmer,lang,text", "title": "JED程序员的编辑器", "title_en": "The Jed Programmer's Editor", "transed": 1, "url": "http://www.jedsoft.org/jed/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["程序", "程序员", "lang", "text"]}, {"category": "", "categoryclass": "", "imagename": "e93d792b574b2f9f6de1cf7fcb8b18be.jpg", "infoid": 1000428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "35岁的西安-皮埃尔·雷吉斯(Sian-Pierre Regis)已经习惯了和室友住在一起。在过去的10年里，他和两个(在某些情况下是三个)朋友平分了他在曼哈顿切尔西社区的公寓的租金。但在6月份，他得到了一位不同类型的合租者：他78岁的母亲丽贝卡·丹尼格利斯(Rebecca Danigelis)。\n“我想我们都没想到会出现这种情况，”自由电影制作人里吉斯说。他的母亲做了40多年的酒店管家，后来升到了管理职位，直到三年前她的工作突然被解雇了。\n从那时起，她就靠微薄的退休储蓄(她在2002年将自己的401(K)计划中的大部分用来支付里吉斯先生的大学学费)和她能找到的任何兼职清洁工作为生。当冠状病毒大流行来袭时，她再次失业，5月底，她在波士顿的补贴住房租约将到期。她付不起房租。\n“我不知道她本可以做得更好，也不知道她怎么能阻止这种情况，”里吉斯说。“她工作时间很长，不在酒店上班时从不请病假和打扫房子赚外快。她没有任何恶习。“。\n尽管如此，作为一名抚养两个孩子的单亲父母，她很难存钱。“当她失业时，她的储蓄账户里有600美元，”他说。“她没有什么可以依靠的。”\n那就是说，除了她的儿子什么都没有。这使得里吉斯成为越来越多的千禧一代中的一员，他们在经济上支持他们的父母，在某些情况下，还给了他们一个居住的地方。通常由于经济原因，父母搬到成年子女身边的现象被称为反向回旋镖效应，这种现象正在上升。根据皮尤研究中心对人口数据的分析，2017年住在别人家里的成年人中有14%是户主的父母，.。\n波士顿学院退休研究中心(Center For Retiment Research At Boston College)预测，如今一半的工人退休后将没有足够的储蓄来维持他们的生活水平。根据AARP公共政策研究所的数据，到2030年，五分之一的美国人将超过65岁(2017年这一比例为七分之一)，“我们的国家将面临可获得和负担得起的住房严重短缺，以满足他们的需求。”\n进入多代住房的复兴，至少两代人的成年人共享同一个家。皮尤中心(Pew)的另一项分析显示，在1980年降至最低点后，多代住房现在接近1950年的峰值，占2016年美国总人口的20%。\n虽然这一趋势在很大程度上是由20多岁的年轻人与中年父母一起生活推动的，但皮尤研究人员发现，近年来，老年人与成年子女生活在一起的可能性也明显高于20世纪90年代。\n俄勒冈州波特兰的财务规划师乔治亚·李·赫西(George Lee Hussey)在全国各地都有客户，她说，美国年轻人应该认真对待这种模式。她说：“我的大多数客户都至少有一位父母需要考虑到他们的财务计划中。”“棘手的是，对于一些家庭来说，这可能是意想不到的。特别是在美国白人文化中，60岁以上的人谈论自己的财务状况往往会感到不自在，并羞于向孩子寻求帮助。“。\n不要低估否认的力量。赫西指出，许多婴儿潮一代眼睁睁看着自己的父母享受着养老金计划更丰盛、医疗费用更低的时代。现在，许多美国人一生都在努力工作，但仍然没有足够的储蓄来退休。“然后，他们的孩子突然意识到，‘哦，我得照顾爸爸了，’”她说。“这可能会导致一些令人难以置信的困难对话。”\n对于45岁的杜西妮亚·迈尔斯-纽科姆来说，当她80岁的父亲来波特兰看望她和她8岁和14岁的两个孩子时，她意识到了这一点-然后就再也没有离开过。“他说，‘所以，我不是真的来参观。我现在住在这里，‘“她说。“我知道父亲一生中从来没有为这个阶段做过打算，但我和丈夫都没有准备好让他像他那样马上搬进来。”\n为了给他们的新室友腾出空间，房地产经纪人迈尔斯-纽科姆安排在他们的小后院安装了所谓的附属住宅单元--一套建在单户住宅地块上的二级公寓。但这个价格-大约11万美元-让这家人陷入了困境。像许多美国人一样，她和她的丈夫已经夹在挥之不去的学生债务和努力为自己的退休储蓄之间。他们申请了房屋净值信用额度来支付.。\n迈尔斯-纽科姆女士说：“我希望有一天我的孩子们不必为我做这些，但我认为我们的孩子看到我们在照顾我们的长辈是很美好的。”“我在工作中也越来越多地看到这一点：我的同龄人和更年轻的人收留了他们的父母。”\n“我的父母非常明确地说，我和我的兄弟姐妹是他们的", "note_en": "Sian-Pierre Regis, 35, is used to living with roommates. For the past 10 years, he has split the rent on his apartment in the Chelsea neighborhood of Manhattan with two (in some cases, three) friends. But in June, he’s getting a co-tenant of a different sort: his 78-year-old mother, Rebecca Danigelis.\n “I don’t think either of us expected to be in this situation,” said Mr. Regis, a freelance filmmaker. His mother worked for over 40 years as a hotel housekeeper, rising to a management position, until her job was abruptly eliminated three years ago.\n Since then, she has lived off her slim retirement savings (she liquidated most of her 401(k) to pay Mr. Regis’s college tuition in 2002) and whatever part-time cleaning jobs she could find. When the coronavirus pandemic hit, she again was out of work, and at the end of May, the lease on her subsidized housing in Boston will expire. She can’t afford the rent.\n “I don’t know what she could have done better, or how she could have prevented this,” Mr. Regis said. “She worked long hours, never called in sick and cleaned houses to make extra money when she wasn’t at her hotel job. She had no vices.”\n Still, as a single parent raising two children, she struggled to save. “When she lost her job, she had $600 in her savings account,” he said. “She had nothing to fall back on.”\n Nothing except her son, that is. Which makes Mr. Regis one of the growing number of millennials who are supporting their parents financially and, in some cases, giving them a place to live. Known as the reverse-boomerang effect, the phenomenon of parents moving in with their adult children, often for financial reasons, is on the rise. According to a  Pew Research Center analysis of population data, 14 percent of adults living in someone else ’s home in 2017 were a parent of the head of household,  ...\n Expressed in starker terms, the Center for Retirement Research at Boston College has  predicted that half of today’s workers will not have enough savings to sustain their standard of living when they retire. According to the AARP Public Policy Institute,  one in five Americans will be over the age of 65 by 2030 (compared with  one in seven in 2017), “and our nation will face a severe shortage in accessible and affordable housing to meet their needs.”\n  Enter the resurgence of multigenerational housing, when adults from at least two generations share the same home. After declining to its lowest point in 1980, multigenerational housing is now close to its 1950 peak, representing 20 percent of the total American population in 2016,  according to another Pew analysis.\n While that trend is largely driven by 20-somethings living with their middle-aged parents,  Pew researchers found that older adults were also significantly more likely to be living with their grown children in recent years than they were in the 1990s.\n Younger Americans should take this pattern seriously, says Georgia Lee Hussey, a financial planner in Portland, Ore., who has clients across the country. “Most of my clients have at least one parent that needs to be factored into their financial plan,” she said. “What’s tricky is that for some families, it can be unexpected. Especially in white American culture, people over 60 are often uncomfortable talking about their finances, and ashamed to ask their children for help.”\n And don’t underestimate the power of denial. Ms. Hussey noted that many baby boomers watched their own parents enjoy an era of heartier pension plans and lower health care costs. Now, many Americans work hard all their lives but still don’t have enough savings to retire. “Then, suddenly their child realizes, ‘Oh, I’m going to have to take care of dad,’” she said. “It can lead to some incredibly difficult conversations.”\n  For Dulcinea Myers-Newcomb, 45, that realization happened when her 80-year-old father came to visit her and her two children, ages 8 and 14, in Portland — and then never left. “He said, ‘So, I’m not really visiting. I live here now,’” she said. “I knew that my father did not ever plan for this phase in his life, but my husband and I were not prepared for him to move in as soon as he did.”\n To make room for their new housemate, Ms. Myers-Newcomb, a real-estate agent, arranged to install what is known as an accessory dwelling unit —a secondary apartment built on a single-family residential lot —in their small backyard. But the price —about $110,000 —put the family in a tight spot. Like many Americans, she and her husband were already sandwiched between lingering student debt and trying to save for their own retirement. They took out a home equity line of credit to cover the  ...\n “I hope my kids don’t have to do this for me someday, but I think it’s beautiful that our children see that we’re taking care of our elders,” Ms. Myers-Newcomb said. “I’m seeing it more and more in my work, too: people my age and younger taking in their parents.”\n “My parents were pretty explicit that my siblings and I were their retirement plan,” said Ka Po Lam, a 28-year-old treasury analyst who works for a bank in New York City. His family moved to the United States when he was a young boy, and he started giving half his take-home pay to his father at age 15, when he got his first job at McDonald’s.\n “Being from Hong Kong, it’s part of our culture to help the family,” he said. “As immigrants, both my parents worked manual labor jobs. They don’t get Social Security. The traditional ways to afford retirement aren’t really available to them.”\n  Mr. Lam now sends about $800 a month to his parents, who live with his older sister in Boston. “I ’m basically paying double rent —mine and my parents ’—so I manage money pretty carefully, ”he said. For a while, he had a second job at a coffee shop to earn extra cash on weekends —a different lifestyle from most of his banker colleagues ’, but he ’s not complaining. “It ’s not something I hide, ”he said. “As much of a burden as that can be, I find validation in the fact that I can  ...\n Still, financial responsibility for aging parents can be daunting no matter how much planning you do, said Athena Valentine Lent, 34, a program manager for a nonprofit in Phoenix, Ariz. “I’m Latina, and multigenerational households are normal in our culture,” she said. “I always knew my dad would come to live with me someday, and I’ve worked hard to prepare, but it’s still not easy.”\n Although her father is only 53, she expects that a combination of his health and financial issues will put him on her doorstep within the next five years. “I have a ‘dad fund, ’and I put a couple hundred dollars a month in it, ”she said. “It affects a lot of my life decisions. If my partner and I decide to buy a house, it will have to be big enough for my dad to live there with us. It ’s a lot to think about, especially since I ’d like to have children of my own in the next couple  ...\n To make matters more complicated, her father takes care of his mother, Ms. Lent’s grandmother. “So I wouldn’t just be taking care of him. I would also take in my grandma, and possibly my aunt too, because she also lives with them,” she said. “Sometimes we don’t just inherit our parents — we inherit entire families.”\n These early reverse-boomerang pioneers are laying important groundwork, said Rodney Harrell, the vice president of family, home, and community at the AARP. “As it becomes more normalized for older adults to live with their grown children, I think it will get easier for everybody,” he said. “If your neighbor builds an accessory dwelling unit, or has their parents living with them, you might realize it’s a viable option for you and your family, too.”\n That’s certainly been the case for Mr. Regis. “At first, I felt really lost. My situation was foreign to my closest friends, the people I’d gone to college with,” he said. But when he made a documentary film about his mother’s experience, “Duty Free,” the response was huge. “When we released the trailer for the film, I heard from so many people, my own age and younger, who said, ‘Thank you for making this. My mom just moved in with me, too, and I would do anything for her.’”\n He also sees a silver lining. “In our country, the elderly become invisible. We don’t see them, and we don’t feel like we need to help them,” he said. “But they have so much to give, and maybe, if they live in our homes with us, people will realize that more.”", "posttime": "2020-05-03 08:01:21", "tags": "积蓄,savings,父母,parents", "title": "没有积蓄的退休人员正和他们千禧年的孩子们一起搬进来。", "title_en": "Retirees without savings are moving in with their millenial children", "transed": 1, "url": "https://www.nytimes.com/2020/05/02/business/Parents-retirement-moving-in-millennials.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["积蓄", "savings", "父母", "parents"]}, {"category": "", "categoryclass": "", "imagename": "c95c6640c04b0b64f58812e5c40b98fc.jpg", "infoid": 1000427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的团队DeisLabs最近发布了一款名为Krustlet的新软件，它是一个用于在流行的开源容器管理工具Kubernetes上运行WebAssembly模块的工具。Kubernetes被广泛用于在许多供应商和公司中运行云软件，并且主要是用Go编程语言编写的。虽然已经有很多关于使用Rust进行系统级编程的故事，但您并不经常听到关于云软件或Kubernetes软件的故事……。\n首先，让我们从一些重要的上下文开始。WebAssembly(缩写为WASM)最初设计为在浏览器中运行。WASM是编译后的二进制文件，可以下载并在任何浏览器中运行。这允许性能良好的应用程序在浏览器内部运行，并且目前在许多主要的Web应用程序中使用。最近的工作使编译后的WASM二进制文件(称为模块)能够在任何系统上运行。Rust是为数不多的对这些二进制文件具有本机构建支持的语言之一。..。\n我们选择铁锈的另一个原因是它强大的安全保障。像大多数铁锈新手一样，我们一开始就咒骂铁锈的借阅检查器(它静态地执行了铁锈的许多安全保证)，有时还会和它斗争几个小时。但是，在我们开始更好地理解如何编写代码后，我们意识到编译器为我们节省了多少错误和问题。它使我们避免暴露可能的空指针、线程安全问题和其他被忽视的错误。..。\n这方面的一个具体示例是Rust编译器如何保护我们免受各种并发错误的影响。Krustlet负责并行运行任意数量的WASM模块。当我们编写用于管理正在运行的模块的代码时，借用检查器捕捉到我们在线程之间传递数据结构的情况，这可能会导致不安全或并发的数据访问问题。它还阻止我们使用可能已经被代码的前面部分访问的对象。\n尽管我们有时会错过垃圾收集器，这样我们就不必担心克隆、借用、所有权等问题，但是由于Rust编译器的严格规则，我们所避免的痛苦是无法估量的。作为比较，上周我们在另一个我们维护的名为Helm(用围棋编写的)的Kubernetes相关项目中发现了一个重要的竞争状况，该项目已经在那里存在了一年或更长时间，并且通过了围棋的竞赛检查器。这个错误永远不会逃脱铁锈编译器的惩罚，从而阻止.。\n由于自定义数据类型的大量定制(至少在Kubernetes中是如此)和云计算的分布式本质，在编译器级别拥有这些保护和安全保证使我们对正在编写的代码非常有信心。它决不能消除所有的错误，但它确实帮助我们从一开始就避免了许多常见的并发错误。此外，具有仍然允许可扩展性的强类型系统(以特征的形式，这是.。\n简而言之，Rust的灵活性、安全性和安全性超过了必须遵循严格的生存期、借用和其他编译器规则，甚至没有垃圾收集器带来的任何不便。这些特性是云软件项目亟需的补充，将有助于避免它们中常见的许多错误。\n仅仅因为我们喜欢“锈”的很多方面，并不意味着一切都是美好的。我们还了解了一些陷阱，我们认为在您决定是否将Rust用于新的云软件项目时需要指出这些陷阱。\n需要指出的最重要的问题之一是异步运行时仍然有点不清楚。目前有两种不同的选择可供选择，每种选择都有自己的权衡和问题。此外，许多实现细节都绑定到特定的运行时，这意味着如果您有一个依赖项使用一个运行时而不是另一个运行时，您通常会被锁定在那个运行时选择中。在过去的一年里，“铁锈”的异步故事取得了很大的进展，但仍然存在一些问题…。\n另一件需要注意的事情是学习曲线。学习如何在Rust中正确编写代码需要几周的艰苦努力，然后才能使学习曲线变得平坦。然而，由于前面提到的安全功能，前期的艰苦努力得到了回报。我们还注意到，一旦开发人员越过了最初的曲线，他们就能够像使用任何其他语言一样轻松地为代码做出贡献。只要意识到最初会有一些痛苦就行了。\n如果您愿意处理这些当前的问题，那么您没有理由不至少考虑在您的下一个项目中使用Rust。所有的语言都有它们的权衡，但我们觉得所获得的好处超过了这些痛点中的任何一个。\n我们看到了Rust在云软件领域的光明前景。在不久的将来，我们计划在任何适合它的项目中继续使用它。鉴于铁锈带来的特征", "note_en": "Our team,  DeisLabs, recently released a new piece of software called  Krustlet, which is a tool for running  WebAssembly modules on the popular, open-source container management tool called  Kubernetes. Kubernetes is used quite extensively to run cloud software across many vendors and companies and is primarily written in the  Go programming language. While there have been many stories about using Rust for systems level programming, you don’t often hear stories about cloud software  orKubernetes software  ...\n  First off, let ’s start with some important context. WebAssembly (abbreviated as WASM) was originally designed to be run in browsers. WASM is a compiled binary that can be downloaded and run in any browser. This allows for performant applications to be run inside of a browser and is currently used in many major web applications. Recent work has enabled compiled WASM binaries (called modules) to be run on any system. Rust is one of the few languages with native build support for these binaries.  ...\n  The other reason we chose Rust was its strong safety and security guarantees. Like most Rust newbies, we started off cursing Rust ’s borrow checker (which statically enforces many of Rust ’s safety guarantees) and sometimes fighting with it for hours. But after we started to get a better understanding of how to code things, we realized how many bugs and problems the compiler was saving us from. It kept us from exposing possible null pointers, thread safety issues, and other overlooked bugs.  ...\n A concrete example of this is how the Rust compiler protected us from various concurrency bugs. Krustlet is responsible for running arbitrary numbers of WASM modules in parallel. As we wrote the code for managing the running modules, the borrow checker caught cases of us passing a data structure between threads that would have resulted in unsafe or concurrent data access problems. It also prevented us from using objects that could have already been accessed by previous parts of the code.\n Even though we sometimes miss having a garbage collector so we don’t have to worry about cloning, borrowing, ownership, etc., the pain we have avoided because of the Rust compiler’s strict rules is incalculable. For comparison, last week  we caught a significant race condition in another Kubernetes-related project we maintain called  Helm(written in Go) that has been there for a year or more, and which passed the race checker for Go. That error would never have escaped the Rust compiler, preventing  ...\n Because of the large amount of customization (at least in Kubernetes) with custom data types and the distributed nature of cloud computing, having these protections and safety guarantees at the compiler level gives us great confidence in the code we are writing. By no means does it eliminate all bugs, but it does help us avoid many of the common concurrency ones from the beginning. In addition, having a strong type system that still allows for extensibility (in the form of  traits, which the  ...\n In short, the flexibility, safety, and security of Rust outweighs any inconvenience of having to follow strict lifetime, borrowing, and other compiler rules or even the lack of a garbage collector. These features are a much-needed addition to cloud software projects and will help avoid many bugs commonly found in them.\n  Just because we love many things about Rust doesn’t mean everything is rosy. We also learned of a few gotchas that we consider important to point out as you make the decision of whether to use Rust for a new cloud software project.\n One of the biggest ones to point out is that async runtimes are still a bit unclear. There are currently two different options to choose from, each of them with their own tradeoffs and problems. Also, many of the implementation details are tied to specific runtimes, meaning that if you have a dependency that uses one runtime over another, you ’ll often be locked into that runtime choice. Rust has made great progress in the past year with its async story, but there are still some issues  ...\n The other thing to watch out for is the learning curve. It takes several weeks of hard effort learning how to code properly in Rust before the learning curve levels out. However, that hard effort up front pays off in dividends due to the aforementioned safety features. We also noticed that once developers are over that initial curve, they are able to contribute to code just as easily as with any other language. Just be aware that there will be some initial pain.\n If you are willing to deal with these current problems, then there is no reason why you shouldn’t at least consider using Rust for your next project. All languages have their tradeoffs, but we feel the benefits gained outweigh any of these pain points.\n  We see a bright future for Rust in cloud software. In the immediate future, we plan on continuing its use for any of our projects where it would be a good fit. Given the features Rust brings to the table, even with its lack of some familiar features (such as garbage collection), we highly recommend it as an option for your next cloud software project.", "posttime": "2020-05-03 06:55:25", "tags": "rust,内斯,boat", "title": "安全之舟：库伯内斯与铁锈", "title_en": "The Safety Boat: Kubernetes and Rust", "transed": 1, "url": "https://msrc-blog.microsoft.com/2020/04/29/the-safety-boat-kubernetes-and-rust/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["rust", "内斯", "boat"]}, {"category": "", "categoryclass": "", "imagename": "7280eba46b61dab05e8197ccb546d9f2.jpg", "infoid": 1000426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取所有关于冠状病毒的最新新闻，并每天将更多信息发送到您的收件箱。请在此处注册。\n根据周三的一份报告，印第安纳州泰森食品(Tyson Foods)一家工厂的近900名工人被检测出冠状病毒呈阳性。\n泰森食品总裁迪恩·班克斯(Dean Banks)表示，该公司正在与临床服务公司Matrix Medical合作，以确保冠状病毒不会在检测到冠状病毒的植物中传播。\n这给了我们需要的团队，确保当我们把食物放在美国餐桌上时，班克斯在周五早上的“福克斯与朋友”(Fox&amp；Friends)节目中说。\n泰森工厂位于印第安纳州洛根斯波特，在不到一周的时间里，其2200名员工中有890人检测呈阳性，占员工总数的40%以上。这是全国范围内由于病毒爆发而自愿关闭的几家泰森工厂之一。\n据印第安纳波利斯的Wish-TV报道，卡斯县的官员们一直在与美国最大的肉类供应商泰森(Tyson)合作，制定重新开业的计划。\n卡斯县专员瑞安·布朗宁(Ryan Browning)表示，在特朗普总统周二签署行政命令后，该计划得到了加快，以确保肉类加工厂在猪冠状病毒大流行期间保持开放。\n根据国防生产法，这些企业现在被宣布为“关键基础设施”企业。\n布朗宁告诉电视台：“所以有一些担忧可能会迫使他们按下开关离开，但我们仍在继续我们的计划。”\n据Wish-TV报道，猪肉加工厂为工人提供的个人空间很小，他们通常在近四分之一的环境中工作。据美国疾病控制和预防中心(Centers For Disease Control And Prevention)称，已知该病毒通过空气中的呼吸道飞沫在6英尺内的人与人之间传播。\n“我们一直在监测工人的温度，需要防护面罩，并进行额外的清洁和消毒。据电视台称，我们还实施了社交疏远措施，比如工作站分隔符和更多的休息室空间。\n截至周二，卫生官员报告了该县1283例冠状病毒病例。预计未来两周的病例数量将达到高峰。\n根据约翰·霍普金斯大学(Johns Hopkins University)的数据，截至周五早些时候，印第安纳州已有超过17835例冠状病毒病例，至少1114人死于该病毒。", "note_en": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\n   Almost 900 workers at a Tyson Foods plant in  Indiana have tested positive for the  coronavirus, according to a report on Wednesday.\n Dean Banks, president of Tyson Foods, said the company is working with Matrix Medical, a clinical services company, that will ensure coronavirus is not spreading in plants where it has been detected.\n &#34;That gives us the team that we need to come in and make sure that we put food on the American table,&#34; Banks said on &#34;Fox &amp; Friends&#34; Friday morning.\n The Tyson plant located in Logansport, Ind., has seen 890 of its 2,200 employees test positive in just under a week -- more than 40 percent of its workforce. It&#39;s one of several Tyson plants across the country that have voluntarily closed due to virus outbreaks.\n  Cass County officials have been working with Tyson, the largest U.S. meat supplier, in developing a plan to reopen, according to Indianapolis&#39;s WISH-TV.\n   Cass County Commissioner Ryan Browning said that plan has been expedited after President Trump signed an executive order on Tuesday, ensuring meat processing plants would stay open during the coronavirus pandemic.\n The businesses are now declared as “critical infrastructure” under the Defense Production Act.\n “So there is some worry there that might force them to flip a switch and go but we are continuing with our plan,” Browning told the station.\n  Pork processing offers workers little personal space, who typically work in a close-quarter environment, WISH-TV reported. The virus is known to spread from person-to-person within six-feet, through respiratory droplets in the air, according to the Centers for Disease Control and Prevention.\n   “We’ve been screening worker temperatures, requiring protective face coverings and conducting additional cleaning and sanitizing. We’ve also implemented social distancing measures, such as workstation dividers and more breakroom space,&#34; it said, according to the  station.\n Health officials reported 1,283 coronavirus cases in the county as of Tuesday. The peak number of cases is expected to hit in the next two weeks.\n  Indiana has seen more than 17,835 coronavirus cases and at least 1,114 deaths from the virus, as of early Friday, according to data from Johns Hopkins University.", "posttime": "2020-05-03 06:55:09", "tags": "coronavirus,病毒,冠状病毒,工厂,tyson", "title": "印第安纳州泰森食品工厂近900名工人冠状病毒检测呈阳性", "title_en": "Nearly 900 workers at Tyson Foods plant in Indiana test positive for coronavirus", "transed": 1, "url": "https://www.foxnews.com/health/nearly-900-tyson-foods-plant-indiana-test-positive-coronavirus", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "工厂", "tyson"]}, {"category": "", "categoryclass": "", "imagename": "c2275ef7b92e4ddb8189c34292a6004e.png", "infoid": 1000425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我第一次写产品需求文档(PRD)，我承认，我不知道从哪里开始。但我知道一件事：我知道我对这样一份耗时的技术性文件持怀疑态度。\n在我回到研究生院之前，我是一个使用敏捷方法论的营销团队的项目经理。我被灌输了一个特别的Scrum原则：使用最低限度的礼仪。换句话说，以文档为中心、流程繁重、仪式繁重的方法需要花费时间和精力。只记录您需要记录的内容。尽可能简化或消除流程。去掉不必要的繁文缛节。\n然而，我在这里，任务是写一份密密麻麻的文档，只是为了重申原型已经展示的东西，对吗？嗯，也许吧。但我学到了两件事。\n首先，最低限度的仪式并不意味着永远没有文档，当谈到构建产品时，确实需要有一个真理来源，几乎没有留下什么可供解释的来源。\n其次，作为一名已经在UX上工作了几个月的产品设计师，我忘记了在可点击原型中什么是显而易见的，而在某个地方的草图上仍然是什么，特别是在交互设计和内容策略方面。\n因此，考虑到这一点，我正在尽我最大的努力在PRD中翻译设计，只要有足够的细节让开发人员理解它，但又不会越界进入臃肿的文档。祝我好运！\n与此同时，以下是我发现有帮助的几个资源：\n本指南深入介绍了如何创建适合敏捷方法的精益PRD。它介绍了PRD中常见的成分类型，以及如何保持简短和甜蜜。(经由亚特兰西亚岛)", "note_en": "I’m writing a product requirement document (PRD) for the first time, and I’ll admit, I didn’t know quite where to start. But I did know one thing: I knew that I was skeptical of such a time-intensive, technical document.\n Before I came back to grad school, I was a project manager on a marketing team using agile methodologies. I was indoctrinated into one scrum principle in particular:  Employ minimally sufficient ceremony. In other words, document-centric, process-heavy, high-ceremony approaches cost time and effort. Only document what you need to document. Simplify or eliminate processes whenever possible. Get rid of unnecessary formality.\n Yet here I am, tasked with writing a dense document that’s just there to reiterate what the prototype already demonstrates, right? Well, maybe. But I’ve learned two things.\n First,  minimally sufficient ceremony doesn’t mean  no documentation ever, and when it comes to building a product, there does need to one source of truth that leaves little open to interpretation.\n Second, as the product designer who’s been working on UX for months now, I forget what’s obvious in the clickable prototype vs. what’s still on a sketch somewhere, particularly when it comes to interaction design and content strategy.\n So, with that in mind, I’m trying my best to translate the design in a PRD with just enough detail that the developer gets it, but without slipping over the line into bloated documentation. Wish me luck!\n In the mean time, here are a handful of resources that I’ve found helpful:\n  This guide gives insight into how to make a lean PRD that fits into an agile approach. It walks through types of components usually found in PRDs and how to keep it all short and sweet. ( via Atlassian)", "posttime": "2020-05-03 06:54:36", "tags": "需求,product,文档,document", "title": "如何编写您的第一份产品需求文档", "title_en": "How to Write Your First Product Requirement Document", "transed": 1, "url": "https://medium.com/re-write/how-to-write-your-first-product-requirement-document-3d6b68d5b52f", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["需求", "product", "文档", "document"]}, {"category": "", "categoryclass": "", "imagename": "0aba79a271fc9138f80c9e4362f2ea3e.jpg", "infoid": 1000423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一种强烈的愿望，想成为最好的自己，释放我的全部人类潜力。\n在过去的四个月里，我研究了潜意识。不仅在理论上，而且把我学到的东西付诸实践。\n虽然我认为我只是肤浅，但以下是我的一些结果：\n大多数人都是自我限制的。我们可以做的比我们想象的要多得多。更糟糕的是，我们中的大多数人都低估了自己；我们低估了自己，低估了自己。其结果是，大多数人都有自卑感。\n目标是“从生活中获得更多的生活”。成为我们所能做到的最好的版本。利用我们拥有的才华和潜力是我们的责任。\n我们95%的行为、感觉和反应都是习惯性和无意识的。这些自动机制在潜意识中发挥作用。\n把失败的想法和过去的错误灌输给这个机制，它就会成为一个失败的机制。\n给这个机制注入乐观和有价值的目标，它就会成为一个成功的机制。\n可悲的是，大多数人都在不断地重温他们的失败和糟糕的记忆。他们阻挡和破坏自己。\n当使用潜意识时，我们实际上是在利用安慰剂效应。接受安慰剂的患者相信他们正在接受合法的药物治疗。关键词是“相信”。我们可以用同样的效果来治愈疾病，给我们的生活带来成功。\n我们的大脑和神经系统无法区分真实体验和生动想象的体验。\n我们需要养成重温过去成功的习惯。与“那种胜利感”联系起来。并利用这一点为自己的成功“做好准备”。\n如果我们不断回忆过去的失败和不愉快的时刻，我们怎么能成功呢？它造成了一个负螺旋。\n我们想要的是一个积极的螺旋。当你回想起过去的成功时，它会让你变得自信和乐观。然后，这种能量可以作为燃料，在当下创造更多的成功。\n你需要“始终如一”。尽可能生动地描绘出最终的结果。如果你是一名音乐家，想象一首完成的歌曲，一幅站在舞台上表演你的作品的图片。如果你是一位作家，想象一下完成的那本书，人们读着它，告诉你他们有多喜欢它。添加细节和感觉。为你的工作感到自豪。想象一下人们会为你的工作感到高兴和感动。\n放松比意志力更重要。意志力会导致紧张，这会阻碍你的成功机制。放松点，让你的自动机械来做这件事。\n你的工作是想象，感受，并将目标灌输给你的潜意识。然后放松，让你的潜意识引导你。这就是“淋浴时想出点子”的工作方式。你放松点。你让一切顺其自然。无论您需要做什么，都会自动完成。不需要意志力。\n我们需要保持积极进取的奋斗目标态度。以大规模行动应对挑战。无论是在现实中还是在想象中，都要做到这一点。想象一下你克服了所有的挑战。永远不要退回到被动的、防御性的、受害者般的态度。\n失败型人格不会将他的精力和情感力量引导到一个有价值的目标上。相反，这个人抱怨，沉浸在自怜中，或者“吞下”他的沮丧，导致疾病和不快乐。\n工作仍然是最好的疗法之一，也是困扰精神的最好的镇静剂之一。\n人类就像一辆自行车。只有在朝着某一目标前进的时候，它才能保持平衡和平衡。\n我们不安的感觉不是由外界引起的，而是由我们自己的反应引起的。我们需要学会如何忽略、延迟或改变这些反应。\n犯错是好事。没有他们，学习是不可能的。但是，错误只是达到目的的一种手段。一旦我们成功了，我们就应该忘掉错误。我们只应该记住那次成功的尝试。\n当你的自动机制被设定为“成功”时，我们就会体验到“那种胜利感”。\n培养对未来的怀念，而不是对过去的怀念。有一些值得期待的东西。不要活在过去。这就是老年人该做的。\n渐进性很重要。我们需要安排事情，这样我们就可以在小事上取得成功，然后逐渐积累起来。就像举重运动员和拳击手一样。成功是建立在成功的基础上的。如果你从一件太难的事情开始，你将永远没有动力继续下去。\n我们要对自己的生命负责。过去解释了我们是如何走到这一步的。但我们从这里走向何方是我们的责任。责备别人和抱怨并不能改善我们的生活。接受你的出身，用你所拥有的做最好的事情。\n正如安慰剂效应所显示的那样，身体能够自我愈合。事实上，所有的治愈都是自我愈合的。“外科医生包扎伤口，上帝医治。”\n我们需要培养一种“内心的微笑”。最好的方法是想象一个目标，并为拥有它而感觉良好。如果你对某件事感觉不好，它就不会起作用。感情总是比这更强烈", "note_en": "I have a burning desire to become the best version of myself, to unlock my full human potential.\n In the past four months, I studied the subconsious mind. Not only theoretically, but putting what I learned into practice.\n While I believe that I have only scrached the surface, here are some of my results:\n    Most people are self-limiting. We can do way more than we believe. Even worse, most of us underrate ourselves; we shortchange ourselves, and sell ourselves short. The result is that most people suffer from feelings of inferiority.\n The goal is to “get more living out of life”. To become the best version we can be. It’s our duty to use the talents and potential that we have.\n 95% of our behavior, feeling, and response is habitual and automatic. These automatic mechanisms play themselves out in the subconscious mind.\n   Feed this mechanism with thoughs of failure and past mistakes, and it will act as a failure mechanism.\n Feed this mechanism with optimism and a worthwhile goal, and it will act as a success mechanism.\n The sad thing is that most people are constantly reliving their failures and bad memories. They block and sabotage themselves.\n   When using the subconscious mind, we are in effect harnessing the placebo effect. Patients receiving a placebo believe they are receiving legitimate medicine. The key word is “believe”. We can use the same effect to cure illnesses and bring success to our lives.\n Our brain and nervous system cannot tell the difference between a real experience, and one that is vividly imagined.\n  We need to develop the habit of reliving past successes. Connect with “that winning feeling”. And use this to “prime” ourselves for success.\n How can we succeed if we constantly remember our past failures and bad moments? It creates a negative spiral.\n What we want is a positive spiral. When you remember your past successes, it leads to self-confidence and optimism. This energy can then be used as fuel to create more success in the present moment.\n You need to “start with the end in mind”. Picture the end result, as vividly as possible. If you are a musician, picture a finished song, picture standing on stage, performing your work. If you are an autor, picture the finished book, people reading it, telling you how much they liked it. Add details and feelings. Be proud of your work. Imagine people being happy and touched by your work.\n Relaxation is more important than willpower. Willpower leads to tension, which blocks your success mechanism. Just relax and let your automatic mechanism do the work.\n Your work is to imagine, to feel, and to feed the goal to your subconscious mind. Then relax and let your subconscious mind guide you. That’s how “getting ideas in the shower” works. You relax. You let things flow. And whatever you need to do comes automatically. No willpower needed.\n We need to maintain a positive aggressive goal-striving attitude. Attack challenges with massive action. Do this in reality as well as in imagination. Imagine yourself overcoming all challenges. Never fall back to a passive, defensive, victim-like attitude.\n  The failure-type personality does not direct his energy and emotional steam toward a worthwile goal. Instead, this person complains, drowns in self-pity or “swallows” his frustration, leading to illness and unhappiness.\n Work remains one of the best therapies, and one of the best tranquilizers for a troubled spirit.\n A human is like a bicycle. It maintains it’s poise and equilibrium only so long as it is going forward toward something.\n Our disturbed feelings are caused not by externals, but by our own responses. We need to learn how to ignore, delay or change these responses.\n Mistakes are good. Without them, learning is impossible. But, mistakes are only a means to an end. Once we succeed, we should forget the mistakes. We should only remember the successful attempt.\n When your automatic mechanism is “set for success” we experience “that winning feeling”.\n Develop a nostalgia for the future instead of for the past. Have something to look forward to. Don’t live in the past. That’s what old people do.\n Gradualness is important. We need to arrange things so that we can succeed in little things, and then gradually build up. Like weight lifters and boxers do. Success is build upon success. If you start with something too difficult, you will never have the momentum to continue.\n We are responsible for our own life. The past explains how we got here. But where we go from here is our responsibility. Blaming others and complaining does not improve our life. Accept where you came from, and do the best with what you have.\n As the placebo effect shows, the body is capable of healing itself. In fact, all healing is self-healing. “The surgeon dresses the wound, God heals it.”\n We need to cultivate an “inner smile”. The best way is to imagine a goal, and feel good about having it. If you don’t feel good about something, it won’t work. Feelings are always stronger than thoughts. Your feelings and thoughts need to be in sync. If you imagine a goal but feel anxiety or frustration, the anxiety and frustration will win.\n Not even willpower can overcome feelings. You can expend as much willpower as you want, if you don’t feel good about something, you won’t achieve it.\n  Reserve judgement for 21 days, because it requires a minimum of 21 days to effect any perceptible change in a mental image or habit.\n The goal is to develop new habits, new automatic patters. Which means that daily practice is key. Even if it’s just 5 minutes.\n  Practice the Coué method „Day by day, in every way, I am getting better and better.“ (Repeat 20 times in a low, hearable voice)\n Tell yourself that you’ll be having a great day today. You will feel good. You will be successful. The more emotion you use, the better.\n  Coué method: If you have physical or emotional pain, put your hand on the hurting spot or your head (emotional pain), then relax and repeat 20 times “It passes. It passes. It passes”\n  Theatre of the mind When you begin, scan your body for tension and relax your head, torso, waist, legs, and so on\n  Then go into the future and picture how you want to be with the same feeling you felt in the past\n   How to be calmer Build an imaginary quiet room in your mind and retire to it regularly (your personal decompression chamber)\n Deliberate practice Practice whatever you want to improve in a realistic way (social situations, giving talks etc.)\n How to cure worry “What is the worst that can possibly happen?” and realize that it probably won’t be so bad.\n Practice positive mental imagery, immediately and “on cue”, whenever you become aware of negative feelings.\n How to change habits The best way to break a habit is to form a clear mental image of the desired end result, and to practice without effort toward reaching that goal\n Challenge your beliefs Don’t just pass these questions by casually. Wrestle with them. Think hard on them. Get emotional about them.\n Can you see that you have cheated yourself and sold yourself short, not because of a “fact”, but only because some stupid belief?\n Whenever you are angry on someone, write a letter to the person. Pull out all the stops. Leave nothing to the imagination. Then burn the letter.\n  How to be calm Create in your imagination a vivid mental picture of yourself sitting quietly, composed, unmoved, “letting the telephone ring”\n Say to yourself, “I am letting the telephone ring”, whenever you are tempted to “obey” or respond to some fear-bell or anxiety-bell\n  See yourself in various situations that have in the past upset you, only now you remain “set”, settled, poised, by not responding.\n  “Sleep on it”: Sometimes the best thing is to take a nap or sleep on something\n Clear your mechanism before undertaking a new task (go to your quiet room between tasks)\n See negative feelings as challenges Reframe negative situations into something positive: make an effort to find the positive in a situation\n Change your memories Change past failures, modify the memories, like you modify a tape recording by adding material or replacing a recording\n Play with your memories. You don’t have to be a slave to them. Do with them whatever you want. Change them. Ignore them. Delete them.\n Act and feel young People get old when they stop moving, when they get stuck, when they stop going forward\n Live in day-tight compartments “When I fall asleep I die. When I wake up I start a new life”\n  Go through your day and change all negative situations into positive ones. Imagine you acted and reacted perfectly.\n Practice the Coué method „Day by day, in every way, I am getting better and better.“ (Repeat 20 times in a low, hearable voice)\n Tell yourself that you will fall asleep easily. And that you will wake up fully refreshed.\n If you have children, you can make suggestions to them while they sleep (without waking them up), and also practice with them while they are awake.", "posttime": "2020-05-03 06:32:54", "tags": "解开,subconscious,过去,practice", "title": "解开潜意识", "title_en": "Unlocking the Subconscious Mind", "transed": 1, "url": "https://remo.org/2020/04/30/subconscious-mind/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["解开", "过去", "practice"]}, {"category": "", "categoryclass": "", "imagename": "dd6990a258080047d30d69583a789369.jpeg", "infoid": 1000421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从健身手环到血糖监测，现代科技使人们能够快速、准确、有效地跟踪自己的健康状况。对人类有益的东西往往对我们的毛茸茸的朋友也有好处。\n蓬勃发展的全球宠物护理市场预计到2025年将增长到2800亿美元。近年来，人工智能技术和物联网技术实现了基于大数据的智能兽医项目和创新的宠物护理产品，如智能项圈和智能喂养和浇水系统，这些产品可以使用机器学习算法进行定制。这些前沿技术也在帮助主人为他们的宠物提供更健康、更长寿的生活。\n猫肾病对宠物主人来说是一场噩梦。虽然大多数猫肾脏疾病是随着年龄的增长而发展起来的，但慢性猫肾脏疾病是随机发生的，没有治愈的方法，是五岁以上猫的头号死因。成立于1937年的比利时公司玛氏Petcare开发了一种名为RenalTech的人工智能动力工具，用于早期诊断慢性猫肾病。RenalTech系统分析宠物患者的数据，包括肌酐、血尿素氮、白细胞……。\n虽然慢性病是诊断和治疗的重点，但宠物主人自然也会担心宠物的一般健康状况。此外，保持健康的生活可以帮助保护宠物免受其他疾病的侵袭。成立于2018年的英国初创公司Vet-AI正在开发一个创新的技术平台，可以在宠物发展成严重问题之前预测它们的医疗状况。VET-AI使用贝叶斯网络来模仿兽医的思维方式，并计算概率…。\n这项技术的最终目标不是取代兽医，而是给他们一种可以帮助早期诊断的工具。该公司已经启动了其Vet-AI项目的第一阶段，这是一款名为Joii的应用程序，可以为动物疾病提供全面的症状检查。\n另一个越来越受关注的话题是宠物的长寿。PetScount于2018年在拉脱维亚成立，利用大数据技术开发了一个生物医学数据平台。该平台从宠物主人那里收集数据，并使用自主开发的机器学习模型来生成个性化的宠物护理指南。Petsensus最近与Insilo Medicine建立了合作伙伴关系，以寻找延长宠物寿命的方法。两家公司希望利用PetScount生物医学数据平台来加速.。\n由于许多新的和人工智能辅助技术的发展，宠物保健市场具有前所未有的前景和潜力。此外，在这一领域以及在基因研究和数据库建设等方面加强全球研究合作，最终不仅会使宠物受益，还会使牲畜、野生动物甚至人类受益。", "note_en": "From fitness bracelets to glucose monitoring, modern technology has made it possible for people to quickly, accurately and effectively keep track of their own health condition. And what’s good for humans is often also good for our furry friends.\n The booming global pet care market is projected to grow to US$280 billion by 2025. In recent years, AI techniques and IoT technologies have enabled big-data-based smart vet projects and innovative pet care products such as smart collars and smart feeding and watering systems that can be customized using machine learning algorithms. These frontier technologies are also helping owners provide their pets with healthier and longer lives.\n  Cat kidney disease is a nightmare for pet owners. While most cat kidney disease develops with age, chronic cat kidney disease happens randomly, has no cure, and is the number one cause of death for cats over five years old.  Mars Petcare, a Belgian company founded in 1937, has developed an artificial intelligence powered tool called RenalTech for early diagnosis of chronic cat kidney disease. The RenalTech system analyzes pet patient data including creatinine, blood urea nitrogen, white blood cell  ...\n  While chronic diseases are a diagnosis and treatment focus, pet owners also naturally worry about the general health condition of their pets. Moreover, maintaining a healthy life can help protect pets from other illnesses. Founded in 2018, UK-based startup Vet-AI is working on an innovative technology platform that can predict medical conditions in pets before they develop into serious problems. Vet-AI uses a Bayesian network to mimic the way a veterinarian thinks and calculate the probability  ...\n The ultimate goal for this tech is not to replace vets but to give them a tool that can help with early diagnosis. The company has already launched the first stage of its Vet-AI project, an app called Joii, which can provide comprehensive symptom check-ups for animal ailments.\n  Another topic that is attracting more and more attention is pet longevity. PetSensus, founded in Latvia in 2018, has developed a biomedical data platform using big data techniques. The platform collects data from pet owners and uses a homegrown machine learning model to generate a personalized pet care guide. Petsensus recently entered into a partnership with Insilico Medicine to find ways to extend pet longevity. The companies hope to use the PetSensus biomedical data platform to accelerate  ...\n The pet healthcare market has unprecedented promise and potential thanks to the development of many new and AI-assisted technologies. Moreover, increasing global research collaboration in this area and on genetic studies and database building etc. will ultimately benefit not only pets but also livestock, wildlife, and even humans.", "posttime": "2020-05-03 06:32:18", "tags": "宠物,人工智能,solutions,pet", "title": "为宠物提供更健康、更长寿的人工智能解决方案", "title_en": "AI Solutions for Healthier and Longer Pet Lives", "transed": 1, "url": "https://medium.com/syncedreview/ai-solutions-for-healthier-longer-pet-lives-2c9062398eb3", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["宠物", "人工智能", "solutions", "pet"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000420, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hacker News上一篇博文中关于功能分支命名的对话激起了我对这个话题的看法。这看起来似乎是一个微不足道的话题，但正如谚语所说：\n在计算机科学中只有两件难事：缓存失效和命名。--菲尔·卡尔顿(Phil Karlton)。\n前面提到的博文概述了如何命名特性分支的约定；在前面加上来自问题跟踪器的ID，并使用连字符作为分支所涉及的特性的简短描述的分隔符。例如：\n这是可行的，但在现实世界中，功能分支很少处理像计费模块这样大的项目。在开发时，我们通常处理此类功能的较小的子任务。当然，理想情况下，每个子任务都应该有问题跟踪器ID，但它们通常没有。与同一功能相关的分支通常如下所示：\n鉴于这种情况，GitHub和GitLab都采用在提交中引用问题作为连接到问题跟踪器的解决方案。\n那么，功能分支的命名取决于它们的目的：它们应该是短暂的、面向任务的，并且在它们重新合并时被删除。他们的目的是敏捷。\n虽然我同意分支机构名称的烤肉串形式，但作为开发人员，我们应该继续自由地命名我们的分支机构，因为我们认为合适。功能分支应该保持轻量级，不应该用来创建另一个流程。", "note_en": "The  conversations on Hacker News on a blogpost about the naming of feature branches stirred me to share my thoughts on the topic. It may seem like a trivial topic of discussion but as the saying goes:\n There are only two hard things in Computer Science: cache invalidation and naming things. - Phil Karlton\n The aforementioned blogpost outlines conventions on how feature branches could be named; prepending with an ID from an issue tracker and using hyphens as separators for a short description of the feature the branch addresses. For example:\n  This would work, but in the real-world, feature branches rarely address such a large item as &#34;billing module&#34;. While developing, we typically work on smaller subtasks of such a feature. Ideally, of course, each subtask would have issue tracker IDs but they often don&#39;t. Branches related to the same feature would typically look like this:\n  Given that this is the case, both  GitHub and  GitLab have adopted referencing the issue in the commit instead as the solution for connecting to the issue tracker.\n The naming of feature branches then, depends on their purpose: they should be short-lived, task-oriented and, deleted when they&#39;re merged. Their purpose is agility.\n While I agree with the kebab-casing of branch names, as developers we should remain free to name our branches as we see fit. Feature branches should stay lightweight and should  not be used to create yet another process.", "posttime": "2020-05-03 05:48:45", "tags": "分支,branch,branches", "title": "现实世界中的Git分支命名约定", "title_en": "Git Branch Naming Conventions for the Real World", "transed": 1, "url": "https://blog.kowsheek.com/git-branch-naming-conventions-for-the-real-world/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["分支", "branch", "branches"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Juliusz Chroboczek JCH at iif.fr Fri May 1 12：15：56 BST 2020嗨，很抱歉在另一篇离题的帖子中滥用了这份列表。你们中的一些人可能还记得几周前我广告过的点对点WebRTC服务器。虽然这仍然是我推荐的一对一谈话方式(点对点很好)，但我一直在为更大的人群开发一个集中化的解决方案。我们昨天刚刚测试了一个有12人参加的会议(12人进来，132人流出)，会议举行了。所以我想..。", "note_en": "Juliusz Chroboczek  jch at irif.fr    Fri May 1 12:15:56 BST 2020  Hi, and sorry for abusing this list for another off-topic post.Some of you may remember the peer-to-peer WebRTC server I advertised a fewweeks ago. While it is still what I recommend for one-on-one conversations(peer-to-peer is good), I&#39;ve been working on a centralised solution forlarger groups of people.We&#39;ve just tested yesterday a meeting with 12 participants (12 incomingand 132 outgoing flows), and it held. So I guess  ...", "posttime": "2020-05-03 05:48:40", "tags": "webrtc,视频会议,video,点对点,peer", "title": "集中式视频会议WebRTC服务器可供测试", "title_en": "Centralized video conference WebRTC server available for testing", "transed": 1, "url": "https://alioth-lists.debian.net/pipermail/babel-users/2020-May/003730.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["webrtc", "视频会议", "video", "点对点", "peer"]}]