[{"category": "", "categoryclass": "", "imagename": "0c458a9ab0f101b4e804419e2fa8361d.jpg", "infoid": 1002011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，参议院阻止了一项两党合作的努力，该努力旨在保护美国人的互联网浏览和搜索历史免受未经授权的监视。\n议员们以59票赞成、37票反对的结果通过了参议员史蒂夫·戴恩斯(R-Mont)和罗恩·怀登(Ron Wyden)(俄勒冈州民主党人)提出的修正案。众议院批准的一项法案，该法案将重新授权国内监控机构。这是参议员们在3月份同意的一系列至少三项修正案投票中的第一项。\n这些情报工具于3月15日到期，原因是参议员们在没有更新“外国情报监视法案”(Foreign Intelligence SurveMonitoring Act)关键条款的情况下离开了该市，原因是隐私鹰派人士表示，这项妥协法案在保护美国人个人数据和通信方面做得不够。\n参议院情报委员会成员怀登在一次发言中指出，由于冠状病毒大流行，美国人比以往任何时候都更依赖互联网。\n难道这些美国人不应该得到某种程度的隐私吗？他问道，并辩称如果没有修正案，现在是任何人最私人信息的开放季节。\n预计参议员们将在今天晚些时候就犹他州参议员迈克·李(Mike Lee)和佛蒙特州民主党参议员帕特里克·莱希(Patrick Leahy)提出的一项修正案进行投票，该修正案旨在加强对联邦监控目标个人的法律保护。\n周四，他们将就肯塔基州共和党参议员兰德·保罗(Rand Paul)的一项修正案进行投票。这将禁止FISA法院授权监视美国公民。然后他们将进入最后的通道。", "note_en": "The Senate on Wednesday blocked a bipartisan effort to shield Americans’ internet browsing and search histories from warrantless surveillance.\n Lawmakers voted 59-37 on an amendment by Sens. Steve Daines (R-Mont) and Ron Wyden (D-Ore.) to a House-approved bill that would reauthorize domestic surveillance authorities. It was the first in a series of at least three amendment votes that senators agreed to in March.\n  The intelligence tools expired on March 15 after senators left town without renewing key sections of the Foreign Intelligence Surveillance Act, amid objections from privacy hawks who said the compromise bill didn&#39;t go far enough to safeguard Americans’ personal data and communications.\n Wyden, a member of the Senate Intelligence Committee, noted in a floor speech that Americans are relying on the internet more than ever due to the Covid-19 pandemic.\n &#34;Don&#39;t those Americans deserve some measure of privacy?&#34; he asked, arguing that without the amendment &#34;it is open season on anybody&#39;s most personal information.&#34;\n Senators were expected to vote later today on an amendment from Sens. Mike Lee (R-Utah) and Patrick Leahy (D-Vt.), which aims to bolster legal protections for individuals targeted by federal surveillance.\n On Thursday they will vote on an amendment from Sen. Rand Paul (R-Ky.) that would prohibit the FISA court from authorizing surveillance of a U.S. citizen. Then they will move onto final passage.", "posttime": "2020-05-14 03:30:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "否决,defeats,参议员", "title": "参议院否决对FISA搜索中屏蔽浏览历史的修正案", "title_en": "Senate Defeats Amendment To Shield Browsing Histories in FISA Searches", "transed": 1, "url": "https://www.politico.com/news/2020/05/13/senate-browsing-histories-fisa-254970", "via": "", "real_tags": ["否决", "defeats", "参议员"]}, {"category": "", "categoryclass": "", "imagename": "1495e8df68d654d573e0e9e1a73ec2ea.png", "infoid": 1002010, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "国际标准化组织发布的FORTRAN标准(https://wg5-fortran.org/)，没有标准库。该项目的目标是为Fortran提供一个由社区驱动并达成一致的事实上的标准库，称为Fortran标准库(Stdlib)。我们有一个严格的流程，就像我们的工作流程中记录的那样，如何开发stdlib。stdlib既是一种规范，也是一种参考实现。我们正在与Fortran标准委员会合作(例如，J3委员会存储库开始的工作)，计划在未来继续与该委员会合作(如在工作流文档中的步骤5)，因此，如果委员会想要标准化标准库中已有的某些功能，它将以标准库的实现为基础。\n数学(线性代数、稀疏矩阵、特殊函数、快速傅立叶变换、随机数、统计学、常微分方程、数值积分、最优化等)。\n预处理器fypp(https://github.com/aradi/fypp)是必需的，因为使用了元编程。它可以使用命令行安装程序pip进行安装。", "note_en": "The Fortran Standard, as published by the ISO ( https://wg5-fortran.org/), doesnot have a Standard Library. The goal of this project is to provide a communitydriven and agreed upon  de facto &#34;standard&#34; library for Fortran, called aFortran Standard Library ( stdlib). We have a rigorous process how  stdlib isdeveloped as documented in our  Workflow.  stdlib is both aspecification and a reference implementation. We are cooperating with theFortran Standards Committee (e.g., the effort started at the J3committee repository) and the plan is to continue working with the Committee inthe future (such as in the step 5. in the  Workflow document), sothat if the Committee wants to standardize some feature already available in  stdlib, it wouldbase it on  stdlib&#39;s implementation.\n   Mathematics (linear algebra, sparse matrices, special functions, fast Fouriertransform, random numbers, statistics, ordinary differential equations,numerical integration, optimization, ...)\n     The preprocessor  fypp ( https://github.com/aradi/fypp) is needed because metaprogramming is used.It can be installed using the command line installer  pip.", "posttime": "2020-05-14 03:29:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "标准,standard", "title": "Fortran标准库", "title_en": "Fortran Standard Library", "transed": 1, "url": "https://github.com/fortran-lang/stdlib", "via": "", "real_tags": ["标准", "standard"]}, {"category": "", "categoryclass": "", "imagename": "4680ea9b742f412ecfa297702a06d684.jpg", "infoid": 1002009, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook人工智能负责人对特斯拉首席执行官埃隆·马斯克在人工智能领域的实际智慧表示怀疑。\n在周三早上的一条推文中，Facebook人工智能负责人杰罗姆·佩森蒂表示，马斯克在谈论人工智能时完全不知道自己在说什么。佩森蒂是在回应CNBC的一篇报道，该报道援引匿名人工智能研究人员和首席执行官的话质疑马斯克的人工智能资质。\n马斯克是多家知名人工智能初创公司的早期投资者，包括价值10亿美元的OpenAI实验室和总部位于伦敦的DeepMind，后者后来被谷歌收购(马斯克于2018年离开OpenAI董事会，以避免与特斯拉的利益冲突，特斯拉也有一个人工智能实验室)。广告马斯克也是一位自封的人工智能专家，他经常警告说，这项技术将迅速超过人类，而且可能比核武器更危险。\n他在2017年表示：我接触到了最尖端的人工智能，我认为人们应该真正关注它。人工智能是人类文明生存的根本威胁。\n佩森蒂呼应了CNBC周二的报道中提出的担忧，他辩称，世界上没有一种人工智能系统接近实现人工通用智能，或与人脑相提并论的智能。佩森蒂后来澄清说，他并不是以官方身份代表Facebook发表讲话。佩森蒂并不是唯一一个公开批评马斯克的Facebook人工智能员工。Facebook首席执行官马克·扎克伯格在2017年称马斯克不负责任，Facebook首席人工智能科学家扬恩·勒昆在2018年因他关于人工智能危险的言论而称他为疯子。前DeepMind工程师、现供职于Facebook的爱德华·格雷芬斯泰特(Edward Grefenstette)称马斯克是个投机取巧的白痴，因为这位特斯拉(Tesla)首席执行官上个月在推特上写道，“现在就自由美国”(Free America Now)。\n阅读“商业内幕”的原文", "note_en": "Facebook&#39;s head of artificial intelligence has doubts about Tesla CEO Elon Musk&#39;s actual intelligence when it comes to the field of AI.\n In a tweet Wednesday morning, Facebook AI head Jerome Pesenti said Musk &#34;has no idea what he is talking about when he talks about AI.&#34; Pesenti was reacting to a  CNBC story that quoted anonymous AI researchers and CEOs questioning Musk&#39;s AI credentials.\n Musk was an early investor in multiple prominent AI startups, including the $1 billion  OpenAI lab and London-based  DeepMind, which was later acquired by Google (Musk left OpenAI&#39;s board in 2018 to avoid conflicts of interest with Tesla, which also has an AI lab). Advertisement    Musk is also a self-fashioned AI pundit, regularly  warning that the technology will rapidly outsmart humans and could be &#34;potentially more dangerous than nukes.&#34;\n &#34;I have exposure to the most cutting edge AI, and I think people should be really concerned by it,&#34; he  said in 2017. &#34;AI is a fundamental risk to the existence of human civilization.&#34;\nPesenti echoed the concerns raised in Tuesday&#39;s CNBC story, arguing that there&#39;s no AI system in the world that&#39;s close to achieving &#34;artificial general intelligence,&#34; or intelligence on par with a human mind. Pesenti later  clarified that he wasn&#39;t speaking in an official capacity on behalf of Facebook.      Pesenti isn&#39;t the only Facebook AI employee to publicly criticize Musk. Facebook CEO Mark Zuckerberg called Musk  &#34;irresponsible&#34; in 2017, and Facebook Chief AI Scientist Yann Lecun called him  &#34;nuts&#34; in 2018 over his remarks on the danger of AI. Edward Grefenstette, a former DeepMind engineer who now works for Facebook, called Musk an  &#34;opportunistic moron&#34; after the Tesla CEO tweeted &#34;FREE AMERICA NOW&#34; last month.\n Read the original article on  Business Insider", "posttime": "2020-05-14 03:15:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,埃隆·马斯克,facebook,head", "title": "脸书的人工智能负责人说埃隆·马斯克“不知道他在说什么”", "title_en": "Facebook's head of AI says Elon Musk 'has no idea what he is talking about'", "transed": 1, "url": "https://www.businessinsider.in/tech/news/facebooks-head-of-ai-says-elon-musk-has-no-idea-what-he-is-talking-about/articleshow/75724767.cms", "via": "", "real_tags": ["人工智能", "埃隆·马斯克", "facebook", "head"]}, {"category": "", "categoryclass": "", "imagename": "f569f4bfbe21d37e7103aee685ec0cbd.jpeg", "infoid": 1002008, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "种族主义者发布了一个充满仇恨的数据库，将白人女性与黑人和棕色男性约会作为“叛徒”-一些人在网上受到骚扰。", "note_en": "Racists have published a hate-filled database targeting white women dating black and brown men as “traitors” — and some are being harassed online.", "posttime": "2020-05-14 03:00:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "劝说,supremacists,数据库", "title": "白人至上主义者建了一个网站来劝说跨种族的情侣", "title_en": "White Supremacists Built a Website to Doxx Interracial Couples", "transed": 1, "url": "https://www.vice.com/en_us/article/n7ww4w/white-supremacists-built-a-website-to-doxx-interracial-couples-and-its-going-to-be-hard-to-take-down", "via": "", "real_tags": ["劝说", "数据库"]}, {"category": "", "categoryclass": "", "imagename": "c6f13391eea08d5f2dab9d0d36a9fff5.jpg", "infoid": 1002006, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要使用新功能，您可以右键单击某个选项卡，然后选择“将选项卡添加到组中”。然后，您可以选择要将选项卡移动到的现有组，也可以创建一个新组，您还将为其命名并添加标签。\n正如一些人已经发现的那样，在今天公开发布之前，该公司已经对这个解决方案进行了几个月的测试。基于这项早期研究，谷歌表示，它发现许多人倾向于按主题组织标签-例如，他们正在进行的一个项目或一组购物和评论网站。\n然而，其他人会根据紧急程度来组织选项卡，比如“尽快”、“本周”或“晚些时候”。谷歌还建议，标签组可以用来帮助你保持对任务进度的关注，方法是将它们分成“正在进行”、“需要跟进”和“已完成”等区域。\n如果你喜欢更简约的外观，标签组也支持在标签中使用表情符号，\n打开太多选项卡的问题对于任何花时间上网的人来说都是一个常见的问题，无论是为了工作、学习、研究、网购，甚至只是为了好玩。标签开始与你需要在其他时间返回的所有东西堆积在一起--当然，除非它们是固定标签的永久集合的一部分，而且永远不会关闭。\n尽管“标签太多”的问题很普遍，但谷歌还没有为Chrome用户推出解决方案。这导致了诸如OneTab、Workona、Toby等标签管理工具的家庭手工业的产生。\n与此同时，其他浏览器制造商利用消费者对更好的标签管理解决方案的需求，使这成为他们自己的Chrome替代品的卖点。例如，Vivaldi提供自动标签堆叠功能，以保持标签的杂乱无章。Opera在今年早些时候推出了新版本的网络浏览器，可以让你将标签组织到各种工作空间中。\n考虑到谷歌在桌面领域近乎完全的主导地位，它不太可能太担心自己的多数市场份额会被竞争对手抢走。但随着其他浏览器的进军，Chrome在桌面浏览器市场的份额已从2019年8月的71.15%降至2019年4月的67.15%。这可能只是一个推动，让谷歌专注于新功能，让消费者留在其生态系统中。\n从今天起，Google Chrome Beta中的标签组可供预览。当更新版本下周开始推出时，这一功能也将适用于Chrome OS、Windows、Mac和Linux的桌面上的Chrome。\n然而，谷歌告诫称，标签组将缓慢推出，以确保Chrome的稳定性和性能不受影响。因此，如果你渴望更早地使用新的标签组功能，你可能想暂时切换到测试版。", "note_en": "To use the new feature, you can right-click on a tab and choose “Add tab to group.” You can then select an existing group to move the tab to or create a new one, which you’ll also name and label.\n The company had been testing this solution for several months before today’s public release,  as some had already spotted. Based on this early research, Google says it found that many people tended to organize their tabs by topic — like a project they’re working on or a set of shopping and review sites, for example.\n  Others, however, would organize tabs by urgency — labeling them things like “ASAP,” “this week,” or “later.” Google also suggests tab groups can be used to help keep you focused on task progress, by grouping them into areas like “in progress,” “need to follow up,” and “completed.”\n And if you prefer a more minimalist look, tab groups also support the use of emoji in their labels,\n   The problem of having too many tabs open is one that’s common to anyone who spends time on the internet, whether for work, school, research, online shopping, or even just browsing for fun. Tabs start to stack up with all those things you need to come back to at some other time — unless, of course, they’re part of your permanent collection of pinned tabs that never get closed.\n Despite the prevalence of the “too-many-tabs” problem, Google had yet to introduce a solution for Chrome users. That led to the creation of a cottage industry of tab management tools like  OneTab,  Workona,  Toby, and many  others.\n Meanwhile, other browser makers tapped into consumer demand for better tab management solutions to make that a selling point for their own Chrome alternatives. For instance, Vivaldi  offers automatic tab stacking to keep tab clutter down. And  Opera earlier this year introduced a new version of its web browser that lets you organize tabs into various workspaces.\n  Google isn’t likely too worried about losing its majority market share to its rivals, given its near-complete dominance on the desktop. But Chrome has fallen from  a 71.15% share of the desktop browser market in August 2019 to  67.15% as of April 2019, as other browsers made inroads. That could have been just enough of a push to get Google to focus on new features that will keep consumers in its ecosystem.\n Tab Groups are  available in Google Chrome Beta for preview as of today. The feature will also be available for Chrome on the desktop across Chrome OS, Windows, Mac and Linux when the updated version begins rolling out next week.\n However, Google cautions tab groups will be slowly rolled out to ensure Chrome’s stability and performance aren’t impacted. So if you’re itching to use the new tab groups feature sooner, you may want to switch to the beta for the time being.", "posttime": "2020-05-14 02:45:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrom,google,组织,chrome,标签", "title": "Google Chrome最终将帮助您组织选项卡", "title_en": "Google Chrome Will Finally Help You Organize Your Tabs", "transed": 1, "url": "https://techcrunch.com/2020/05/13/google-chrome-will-finally-help-you-organize-your-tabs/", "via": "", "real_tags": ["chrom", "google", "组织", "chrome", "标签"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002005, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "[更新(06/16/08)：这是几年前写的一份现实世界的项目审查备忘录，其中描述了(以及其他许多事情)死海效应。]。\n[注：你们中的一些人已经询问了我和Ruby Raley撰写的Cutter IT Journal文章。它现在也在这里上线了。]。\n大型组织(无论是公共组织还是私人组织)在信息技术(IT)发展中苦苦挣扎的原因有很多。其中一个，我已经在这里和这里讨论过了，它涉及到寻找和雇佣你能找到的最好的工程师。但是，即使你确实找到并雇佣了优秀的IT工程师，真正的问题是：你能留住他们吗？\n我在大型组织中看到了一种反模式，我称之为“死海效应”。当然，死海是以色列和约旦之间的一大片水域，位于海平面以下。约旦河注入其中；水只有通过蒸发才能离开，这意味着随着时间的推移，死海已经变得非常咸(例如，比海洋咸8倍)。因此，它通常无法维持生命，除非春季洪水暂时降低了盐度。\n许多大型企业/政府IT公司--还有不少小公司--的运作就像死海一样。管理层认为有必要时，就会引进新员工。他们的资历(人才、教育、专业精神、经验、技能)往往会有很大的不同，这取决于当前的需求、员工离职、人事预算和招聘人员的一般招聘能力。在所有条件相同的情况下，IT部门的一般能力应该与新员工的分布大致相同。\n但根据我的经验，情况并非如此。相反，发生的情况是，更有才华和效率的IT工程师最有可能离开-如果你愿意的话，就是蒸发。他们是最不可能忍受困扰大型组织的频繁的愚蠢和工作场所问题的人；他们也是最有可能有其他机会的人，他们可以随时转移到其他地方。\n留下来的往往是“剩余者”--才华最差、效率最低的IT工程师。他们往往对自己有份工作心存感激，对管理层的要求较少；即使他们发现工作场所令人不快，他们也是最不可能在其他地方找到工作的。他们倾向于巩固自己，成为关键系统的维护专家，承担其他人都不想要的责任，这样组织就不能让他们离开。\n我在这里用相当宽泛的笔触作画，但我在不同的公司和不同的IT商店看到了同样的效果。大公司往往会失去真正有才华的IT工程师，而保留那些才华横溢的人，而他们应该积极寻求做相反的事情。其影响往往是自我强化的：IT商店变得越糟糕，就越难让真正有才华和效率的IT工程师加入它，如果他们这样做了，也更难留住他们。它可以达到这样的程度，即真正优秀的人才只会作为入门级人员进入，他们不知道更好的东西-但一旦他们变得聪明起来，他们就会离开。\n关于Slashdot的讨论，以及下面的评论，都提出了很好的问题，尽管有些人误解了我上面所说的内容。这是对我看到的主要主题的回应。\n死海效应并不是IT独有的。的确如此，尽管我可以对几乎任何有关IT的项目管理问题说同样的话。IT的不同寻常之处(与其他工程学科相同)是个人才华和其他因素对生产力和质量的影响程度。IT的独特之处(与土木工程/机械/化学工程师、建筑师等不同)。就是没有标准的(国营)专业认证，所以不能保证最低学历和能力。\n这是显而易见的/常识/微不足道的。IT中的大多数问题也是如此。弗雷德·布鲁克斯(Fred Brooks)和杰里·温伯格(Jerry Weinberg)在30多年前几乎明确了IT项目和人事管理中的所有基本问题；然而，令人惊讶的是，这些问题并没有完全消失！IT领域严重缺乏专业和机构记忆；几乎每个写IT项目/人事管理的人(包括我自己)都在寻找新的方法来预测或解释核心问题，希望这一次有人会真正倾听和解决这些问题。\n死海效应就是彼得原理(或其推论)。不，不是。彼得原则是一个特定的人上升(被提升)到她/他的无能水平(实际上我已经足够大了，还记得“彼得原则”第一次出现的时候)。这与IT组织内部的晋升无关；它与自选从该IT组织中移除无关，这不是因为缺少晋升或机会，而只是因为其他地方有更好的发展空间。\n并不是所有的IT商店都是这样的。我当然希望如此。事实上，有些IT组织的情况正好相反；IT工程师的素质相当高，平庸或具有颠覆性的工程师要么不会被聘用，要么就算聘用了，也不会持续很长时间。我在一个这样的IT小组(Pages Software)工作了五年。在那段时间里，我们只有一个人自愿离职(网络管理员)；我们还有另外两个人因为问题而被解雇，还有几个人(痛苦地)被裁员。(另一方面，这里有一些关于人们为什么会离开像谷歌这样杰出(且有利可图的)IT组织的想法。)。\n并不是每个“落在后面”的人都是无能的。同样，这个症状并不适用于所有IT组，也不适用于所有IT组。IT人员的流动率很常见(尽管可以通过智能管理来减少)，仅仅因为优秀的工程师离开了一个给定的IT团队并不意味着剩下的人实际上就是剩余者。我在这里谈的是一种非常真实的综合症，通常在大公司和政府机构中发现，但它肯定不是普遍存在的。\nIT招聘流程已经中断。阿门。在许多组织中，不仅IT招聘流程被打破，整个IT方法也经常被打破。它充斥着帝国建设、“英雄主义”的项目管理和“可互换代码猴子”的思维模式。正如下面的评论部分所提到的，Ruby Raley和我为Cutter IT Journal写了一篇文章，声称模仿专业运动队的方法可能会更有效，但还没有人雇佣我来尝试。另一方面，我认为这在很大程度上是我们作为页面采取的方法，这就是为什么我们有一个如此伟大和有效的IT团队，而营业额如此之少。\n问题在于领导力的失败。再说一遍，阿门。十多年前，我写了一整本关于这方面的书(“器皿的艺术”，M&amp；T Books，1995)，目前我正在修改这本书。\n这并不能描述/涵盖专业IT商店中的所有问题。如果是这样的话，生活会容易得多。同样，请注意，我已经在这个主题上写了一些东西。我目前正在写我的两本书(“软件的艺术”(2.0版)和“现代软件工程的陷阱”)的修订版，同时还在写一本新书(“生存的复杂性”)，这篇关于“死海效应”的帖子只是一个非常非常小的摘录。\n谢谢你的评论和反馈；我希望我能让你们在我所有书的所有章节都这样做。\n对于这种现象的真实例子，只需花一些时间阅读Daily WTF(我强烈推荐给所有IT经理的网站)。特别值得一提的是，他们的“面试故事”类别从招聘过程的双方提供了一些有趣的见解。\n此外，经营每日WTF的亚历克斯·帕帕迪莫里斯(Alex Papadimolis)也提出了自己的建议，以解决IT人员流失的问题。我特别喜欢他关于价值顶点的概念。一定要读他的文章，这是我对它的回应……布鲁斯。", "note_en": "[ Updated (06/16/08): Here’s  a real-world project review memo, written several years ago, that described (among many other things) the Dead Sea effect.]\n [ Note: some of you have asked about the Cutter IT Journal  article that Ruby Raley and I wrote. It’s now  online here as well.]\n  There are  many reasons why large organizations, public and private, struggle with information technology (IT) development. One, which I’ve already discussed  here and  here, deals with finding and hiring the best engineers you can. But even if you do find and hire excellent IT engineers, the real question is: can you hold onto them?\n There is an  anti-pattern that I’ve seen in large organizations which I have come to call “the Dead Sea effect”.  The Dead Sea, of course, is a large body of water between Israel and Jordan, located well below sea level. The Jordan River empties into it; water leaves only by evaporation, which means that over the eons, the Dead Sea has become very salty (e.g., 8x saltier than the ocean). As such, it is generally unable to support life, except when spring floods temporarily lower the salinity.\n Many large corporate/government IT shops — and not a few small ones — work like the Dead Sea. New hires are brought in as management deems it necessary. Their qualifications (talent, education, professionalism, experience, skills —  TEPES) will tend to vary quite a bit, depending upon current needs, employee departure, the personnel budget, and the general hiring ability of those doing the hiring. All things being equal, the general competency of the IT department should have roughly the same distribution as the incoming hires.\n But in my experience, that’s not what happens. Instead, what happens is that the more talented and effective IT engineers are the ones most likely to leave — to evaporate, if you will. They are the ones least likely to put up with the frequent stupidities and workplace problems that plague large organizations; they are also the ones most likely to have  other opportunities that they can readily move to.\n What tends to remain behind is the ‘residue’ — the least talented and effective IT engineers. They tend to be grateful they have a job and make fewer demands on management; even if they find the workplace unpleasant, they are the least likely to be able to find a job elsewhere. They tend to entrench themselves, becoming maintenance experts on critical systems, assuming responsibilities that no one else wants so that the organization can’t afford to let them go.\n I’m painting with pretty broad strokes here, yet I’ve seen this same effect taking place in different companies and different IT shops. Large companies tend to lose the really talented IT engineers and hold onto the less talented ones, when they should been actively seeking to do just the opposite. And the effect tends to be self-reinforcing: the worse an IT shop becomes, the harder it is to get really talented and effective IT engineers to join it and the harder it is to retain them if they do. It can reach a point that the really good talent only comes in as entry-level personnel who don’t know any better — but once they do wise up, they’re gone.\n  The  discussion over at Slashdot, as well as the comments below, have raised excellent issues, though some misunderstand or mischaracterize what I’m talking about above. Here’s a response to the main themes that I see coming up there.\n The Dead Sea effect isn’t unique to IT.  True enough, though I could say the same thing about just about any project management issue regarding IT. What is unusual about IT (shared with other engineering disciplines) is the degree to which  individual talent and other factors affect productivity and quality. And what is unique about IT (as opposed to, say, civil / mechanical / chemical engineers, architects, etc.) is that there is no standard (state-run) professional certification, so there is no assurance of minimum education and competency.\n This is obvious/common sense/trivial. So are most of the problems in IT.  Fred Brooks and  Jerry Weinberg pretty much nailed down all the essential issues in IT project and personnel management more than 30 years ago; yet, amazingly, the problems haven’t all gone away! There is a profound lack of professional and institutional memory in IT; almost everyone who  writes about IT project/personnel management (myself included) is looking for new ways to cast or explain the core issues in a touching hope that maybe  this time someone will actually listen and fix them.\n The Dead Sea effect is just the Peter Principle (or a corollary thereof). No, it isn’t.  The Peter Principle is that a given person rises (is promoted) to her/his level of incompetence (I’m actually old enough to remember when ‘the Peter Principle’ first came out). This has nothing to do with promotion within the IT organization; it has to do with self-selected removal from that IT organization, not due to a lack of promotion or opportunity, but just because there are greener pastures elsewhere.\n Not all IT shops are like this. I would certainly hope so. In fact, there are IT organizations where just the opposite occurs; the quality of the IT engineers is quite high, and engineers who are mediocre or disruptive either don’t get hired or don’t last long if they are. I worked in one such IT group ( Pages Software) for five years. During that time, we had only one voluntary departure (the network admin); we had two others who were dismissed due to problems, and a few others who were (painfully) cut in downsizing. (On the other hand, here are some thoughts on  why people would leave an outstanding (and lucrative) IT organization like Google.)\n Not everyone ‘left behind’ is incompetent. Again, this syndrome doesn’t apply to all IT groups, and it doesn’t apply to the same extent to all IT groups. Turnover in IT personnel is common (though it can be reduced by intelligent management), and just because good engineers have left a given IT group doesn’t mean that the rest are, in fact, residue. What I’m talking about here is a very real syndrome, typically found in large corporations and government organizations, but it’s certainly not universal.\n The IT hiring process is broken. Amen. Not only is the IT hiring process broken in many organizations, the entire approach to IT is often broken. It is rife with empire-building, ‘heroic’ project management, and an ‘interchangeable code monkeys’ mindset. As mentioned in the comments section below, Ruby Raley and I wrote an article for Cutter IT Journal that stated that  an approach modeled after professional sport teams could well be far more effective, but no one has yet hired me to try it out. On the other hand, I would argue that this is to a large extent the approach we took as Pages, which is why we had such a great and effective IT group with so little turnover.\n The problem is a failure of leadership. Again, amen. I wrote an entire book about that over a decade ago ( The Art of ‘Ware, M&amp;T Books, 1995), which  I’m currently revising.\n This doesn’t describe/encompass all the problems in professional IT shops. If it did, life would be much easier. Again, note that  I’ve written a bit on the subject. I’m currently working on revised versions of two of my books ( The Art of ‘Ware [Version 2.0] and  Pitfalls of Modern Software Engineering) while writing a new one ( Surviving Complexity), from which this posting on the “Dead Sea effect” is a  very, very tiny extract.\n Thanks for the great comments and the feedback; I wish I could get you folks to do this for all sections of all of my books.\n For real-world examples of this phenomenon, just spend some time reading  The Daily WTF (a site I highly recommend for all IT managers). In particular, their “ Tales from the Interview” category gives some interesting insights from both sides of the hiring process.\n Also, Alex Papadimoulis, who runs The Daily WTF, has put forth  his own proposal for dealing with IT turnover. I especially like his concept of the Value Apex. Be sure to read his article;  here’s my response to it ..bruce..", "posttime": "2020-05-14 02:44:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "死海,crisis,问题", "title": "“湿地危机：死海效应”(2008)", "title_en": "The Wetware Crisis: the Dead Sea effect (2008)", "transed": 1, "url": "http://brucefwebster.com/2008/04/11/the-wetware-crisis-the-dead-sea-effect/", "via": "", "real_tags": ["死海", "crisis", "问题"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月前，我发布了一些关于缩放的想法，并承诺很快会发布更多。嗯，说到快速扩展--在3月份的短短两周内，可汗学院的网站使用量就增长到去年同期的2.5倍，并且到目前为止一直保持着这个水平。随着世界各地的学校因冠状病毒大流行而关闭，学生、家长和教师转向远程学习，可汗学院能够做出回应，免费提供高质量的内容和课堂体验。在4月份，我们在我们的平台上为3000万名学习者提供了服务。最近一项针对家长的全国性调查发现，可汗学院是“使用最多的在线资源”。\n我感到自豪的是，我们在没有中断用户的情况下吸收了这种快速增长。除了在几天内迅速做出反应以缓解压力点之外，我们已经提前做好了准备，这种准备产生了红利。我们很容易进行扩展，这在很大程度上是因为我们的体系结构和谨慎选择外部服务并正确使用它们的严格实践。\n因此，在这篇文章中，我将讨论对我们网站的可伸缩性起关键作用的架构方面。\n我们架构的两个基本组件在这里特别适合我们。我们使用Google Cloud，包括AppEngine、Datastore和Memcache，以及Fastly CDN，它们是无服务器和缓存战略的主干，而无服务器和缓存战略是我们可伸缩性的关键。\n使用GCP App Engine，这是一个完全托管的环境，这意味着我们几乎可以毫不费力地轻松扩展。即使流量大幅增加，我们的网站仍然保持了良好的运行状态，只需最少的干预。我们自己不需要担心负载平衡问题，因为服务器实例是在没有任何干预的情况下按需启动的。我们同样使用数据存储区，它可以自动横向扩展存储和访问容量，其方式与App Engine横向扩展Web服务器实例的方式大致相同。\n快速CDN允许我们缓存所有静态数据，并最大限度地减少服务器行程。巨大的可扩展性，它还帮助我们优化主机资源，在我们的App Engine无服务器模型中，成本随着使用量的增加而线性增长。如架构图所示，所有客户端请求都能快速通过，因此我们可以防止不必要的服务器流量，从而提高性能。我们主要从YouTube下载视频，其次是Fastly。这也降低了成本，同时确保了视频的快速加载。\n除了快速缓存静态数据外，我们还广泛缓存常见查询、用户首选项和会话数据，并利用这一点来加快数据获取性能。除了围绕数据存储区实施其他关键最佳做法外，我们还大量使用memcache，以确保快速响应。\n当然，我们的现场可靠性(SRE)团队需要做好铁板一块的监控准备--我们做到了。我们注意到在最初几天出现了一些速度减慢的情况，并发现是部署导致了这些点击率。应我们的要求，Google增加了我们的Memcache容量，一周之内，我们就安心地回到了正常的持续部署模式。这一速度非常关键，因为我们的团队正在快速开发资源，以尽可能轻松地指导新站点用户进行自注册。\n总体而言，我们努力仔细选择服务，遵循最佳实践，并根据需要开发我们自己的服务。凭借正确的技术、精心的准备和我们令人惊叹的工程团队的现场调整，我们能够不间断地为现在比以往任何时候都更依赖我们的学生、家长和教师提供服务。\n可汗学院使用量的增加也增加了我们的托管成本，我们是一个非营利性组织，依赖于像您这样的人的慈善捐款。", "note_en": "A few months ago I posted  some thoughts on scaling and promised to post more soon. Well, talk about rapid scaling — within just two weeks in March, Khan Academy site usage grew to 2.5x what it was at the same time last year and has sustained that level to date. As schools all over the world closed because of the coronavirus pandemic and students, parents, and teachers moved to distance learning, Khan Academy was able to respond, offering high-quality content and classroom experience — for free. In the month of April, we served 30 million learners on our platform. A recent national survey of parents found that  Khan Academy was the “most used online resource”.\n  I’m proud that we absorbed this rapid growth without disrupting our users. In addition to reacting quickly to alleviate pressure points within a few days, we had prepared in advance, and that preparation paid dividends. We scaled readily in large part because of our architecture and a rigorous practice of choosing external services carefully and using them properly.\n  So in this post I’ll discuss architectural aspects that play a key role in the scalability of our site.\n  Two fundamental components of our architecture serve us particularly well here. We use  Google Cloud, including AppEngine, Datastore, and Memcache, and  Fastly CDN, and they were the backbone of the  serverless and caching strategy that’s key to our scalability.\n      Using GCP App Engine, a fully managed environment, means we can scale very easily with virtually no effort. Even with a substantial traffic increase, our site stayed up and performed well, with minimal intervention. We didn’t need to worry about load balancing ourselves because server instances were brought up as needed without any intervention. We similarly use Datastore which scales out storage and access capacity automatically in much the same way App Engine scales out web server instances.\n    Fastly CDN allows us to cache all static data and minimize server trips. Huge for scalability, it also helps us optimize hosting resources, for which costs grow linearly with usage in our App Engine serverless model. As shown in the architecture diagram, all client requests go through Fastly so we can prevent unnecessary server traffic, improving performance. We load videos primarily from YouTube and secondarily from Fastly. This also keeps costs down as well as ensures that the videos load quickly.\n  In addition to caching static data in Fastly, we also extensively cache common queries, user preferences, and session data, and leverage this to speed up data fetching performance. We use Memcache liberally, in addition to exercising other key best practices around Datastore to ensure quick response times.\n  Our site reliability (SRE) team of course needed to be prepared with ironclad monitoring - and we were. We noticed some slowdowns in the first few days and found that deploys were causing those hits. At our request, Google increased our Memcache capacity, and within a week we were comfortable returning to our normal continuous deployment pattern. This speed was critical, as our teams were quickly developing  resources to guide new site users in onboarding as easily as possible.\n  Overall, we work hard to choose services carefully, follow best practices, and develop our own as needed. With the right technology, careful preparation, and adjustments on the spot by our amazing engineering team, we’ve been able to serve the students, parents, and teachers who rely on us now more than ever without interruption.\n    Khan Academy&#39;s increased usage has also increased our hosting costs, and we&#39;re a not-for-profit that relies on  philanthropic donations from folks like you.", "posttime": "2020-05-14 02:30:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学院,academy,服务器", "title": "汗学院如何在一周内成功处理2.5倍的流量", "title_en": "How Khan Academy Successfully Handled 2.5x Traffic in a Week", "transed": 1, "url": "http://engineering.khanacademy.org/posts/handling-2x-traffic-in-a-week.htm", "via": "", "real_tags": ["学院", "academy", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们推弹公司从谷歌收到了一些坏消息。如果我们不在14天内进行必要的更改，我们的扩展似乎将从Chrome Web Store中删除。不太好！更大的问题是什么？谷歌还没有告诉我们需要做出哪些改变。\nPushBullet Chrome扩展在Chrome网上商店上已经有6年多的时间了，目前拥有超过100万用户，平均评分为4.5星。你自己在这里看看吧。我们对此感到非常自豪。除了大量的用户和优秀的评分，我们的扩展也经常被Chrome网络商店团队所采用，我们真的很欣赏！这是我们在“回家的工作”收藏中的照片。\n考虑到我们多年来所做的所有工作，以实现一个特别的Chrome扩展，这项扩展值得Chrome网络商店团队使用，读到我们距离被从网络商店移除只有不到14天的时间，这是令人震惊的。\nPushBullet扩展是我们安装最多的桌面应用程序。它被移除很可能是“推弹”的彻底终结。这对我们来说是件大事。\n14天，而且还在继续。我们必须继续猜测所需的更改才不会被从Chrome Web Store中剔除？\n幸运的是，谷歌给了我们一个提示，告诉我们需要做出哪些改变。以下是电子邮件中所说的：\n您的产品违反了策略中的权限使用部分，该部分要求您：\n请求访问实现产品功能或服务所需的最窄权限。\n如果可以使用多个权限来实现一项功能，则必须请求对数据或功能具有最少访问权限的权限。\n不要试图通过请求可能使尚未实施的服务或功能受益的权限来证明您的产品是未来的产品。\n我们似乎违反了Chrome网络商店政策中的“使用权限”部分。这可不妙！\n根据我对列出的要点的解释，我相信Google希望我们找到方法来减少我们的扩展请求的权限。好的，很公平。我接受这个挑战。目前还不清楚Google希望我们删除哪些权限(或者多少权限，或者诸如此类的权限)，但是让我们真诚地努力减少我们的扩展请求的权限！\n我们的扩展需要以下权限：选项卡、活动选项卡、上下文菜单、Cookie、通知、IDLE、https://*/*，和http://*/*.。如果用户想要启用某些功能：后台、剪贴板读取、剪贴板写入，我们也可以有选择地请求这些权限。\n首先，让我们从优先顺序开始。我相信Chrome团队最关心的是所需的权限(这些权限都是在安装时授予的)。稍后会请求可选权限，并且必须由用户手动授予。因为可选权限是由用户专门批准的，所以它们看起来相当温顺。让我们集中精力减少所需的权限！\n当我查看权限和我们的扩展实际需要操作的内容时，我注意到有很好的机会减少我们的权限请求。我们不需要请求访问https://*/*和http://*/*.上的数据。相反，我们只需请求https://*.pushbullet.com/*，http://*.pushbullet.com/*，和http://localhost/*.的数据访问。这大大减少了我们的扩展在理论上可以访问的私有数据。大获全胜！\n另一个机会是Tabs权限。此权限允许扩展查看哪些选项卡处于打开状态。PushBullet使用此权限来避免在单击镜像通知时打开已打开的网站的新选项卡。为了放弃一个大的许可，这只是一个小小的牺牲。让我们放手吧！\n我们的扩展现在只需要：Active Tab、Context Menu、Cookie、Notify、IDLE、https://*.pushbullet.com/*，http://*.pushbullet.com/*，和http://localhost/*.。\n这大大降低了PushBullet操作所需的访问级别！大获成功。让我们把它提交到Chrome网络商店吧！\n在提交更新的延期大约24小时后，它被拒绝了。不幸的是，我们所做的改变似乎并不是谷歌要求的改变。\n谷歌没有就他们需要做出哪些改变提供进一步的指导。拒绝的原因和我们原来的通知完全一样。我也回复了要求进一步指导的电子邮件，但没有收到任何回复。我显然不指望有这样的机会，但试一试也没什么坏处。\n我试着想出一些其他理论，我们可以做出其他改变，以潜在地克服阻碍我们扩展的任何东西。以下是我目前的理论：\n将http(S)：//*.push bullet.com/*数据权限更改为http(S)：//www.push bullet.com。这应该没什么关系，因为它毕竟是我们自己的第一方域名，但也许缩小范围会有所帮助？\n删除剪贴板读取和剪贴板写入权限。这些权限是可选的，仅当用户启用通用复制和粘贴时才需要。然而，也许Chrome现在不愿意允许扩展请求这些权限？毕竟，谷歌最近确实杀死了Android上的剪贴板管理器。这将意味着从我们的扩展中删除该功能。\n为什么不继续尝试修改可能有帮助的提交，直到它通过审查？\n我想我别无选择，但也不是没有风险。我担心谷歌的自动系统会认为我在试图找到绕过规则的方法，并授权我的整个谷歌账户。他们的政策确实明确规定：这也可能导致与您的Google账户相关的Google服务被暂停。\n今天晚些时候，我将用上面列出的2项更改再试一次提交。关注我们的博客和@PushBullet获取最新消息！\n到目前为止，我很想听听人们是怎么想的。我是不是漏掉了什么明显的东西？你有什么我可能没有想到的好建议吗？你有在Chrome上工作的朋友吗？请分享!。我已经在PushBullet Subreddit上发了一篇帖子，让我们在这里讨论这个问题。", "note_en": "We at Pushbullet have received some bad news from Google. It appears our extension will be removed from the Chrome Web Store if we don’t make required changes within 14 days. Not good! The bigger problem? Google hasn’t told us what those required changes are.\n  The Pushbullet Chrome extension has been on the Chrome Web store for over 6 years, currently has over 1,000,000 users, and has a 4.5 star average rating.  See for yourself here. We are very proud of this. In addition to the large number of users and excellent rating, our extension is also frequently featured by Chrome Web Store team which we really appreciate!  Here’s us in the Work From Home collection.\n Considering all of the work we’ve done over the years to make an exceptional Chrome extension that this worthy of being featured by the Chrome Web Store team, it was shocking to read we are less than 14 days away from being removed from the Web Store.\n The Pushbullet extension is our most-installed app for desktop. It being removed may very well be the end of Pushbullet altogether. This is a big deal for us.\n 14 days and counting. What do we have to go on to guess the required changes to not get kicked off the Chrome Web Store?\n Fortunately, Google has given us a hint of what changes we need to make. Here’s what the email said:\n Your product violates the &#34;Use of Permissions&#34; section of the policy, which requires that you:\n  Request access to the narrowest permissions necessary to implement your product’s features or services.\n  If more than one permission could be used to implement a feature, you must request those with the least access to data or functionality.\n  Don&#39;t attempt to &#34;future proof&#34; your product by requesting a permission that might benefit services or features that have not yet been implemented.\n We appear to violate the “Use of Permissions” section of the Chrome Web Store policy. That’s not good!\n Based on my interpretation of bullet points listed, I believe Google wants us to find ways to reduce the permissions our extension requests. Ok, fair enough. I’ll accept that challenge. It’s not clear what permissions Google wants us to remove (or how many, or anything like that) but lets make a good-faith effort to reduce the permissions our extension requests!\n  Our extension requires these permissions:  tabs,  activeTab,  contextMenu,  cookies,  notifications,  idle,  https://*/*, and  http://*/*. We also optionally request these permissions if a user wants to enable certain features:  background,  clipboardRead,  clipboardWrite.\n  First, let’s start off by prioritizing. I believe the Chrome team are most concerned with the required permissions (these are all granted at install). Optional permissions are requested later and must be manually granted by the user. Since the optional permissions are specifically approved by a user, they seem pretty tame. Let’s focus on reducing the required permissions!\n As I looked at the permissions and what our extension actually needs to operate, I noticed a great opportunity to reduce our permissions requests. We do not need to request access to data on  https://*/* and  http://*/*. Instead, we can simply request data access for  https://*.pushbullet.com/*,  http://*.pushbullet.com/*, and  http://localhost/*. This is a huge reduction in the private data our extension could theoretically access. A big win!\n The other opportunity is the  tabs permission. This permission lets extensions see what tabs are open. Pushbullet uses this permission to avoid opening new tabs for websites that are already open when  mirrored notifications are clicked. This is a small sacrifice to make to let go of a big permission. Let’s let it go!\n  Our extension will now only require:  activeTab,  contextMenu,  cookies,  notifications,  idle,  https://*.pushbullet.com/*,  http://*.pushbullet.com/*, and  http://localhost/*.\n This is a huge reduction in the level of access Pushbullet requires to operate! A big success. Let’s get it submitted to the Chrome Web Store!\n  Around 24 hours after submitting the updated extension, it was rejected. Unfortunately, it appears the changes we’ve made are not the changes Google requires.\n Google has provided no further guidance on what changes they require. The reason for rejection was exactly the same as our original notice. I also replied to the email asking for further guidance but have not received any response. I obviously don’t expect one but it was no harm to try.\n  I’ve tried coming up with a few theories of other changes we could make to potentially get past whatever is blocking our extension. Here are my current theories:\n Change the  http(s)://*.pushbullet.com/* data permissions to  http(s)://www.pushbullet.com. This shouldn’t really matter since it is our own first-party domain after all, but perhaps reducing the scope would help?\n  Remove the clipboardRead and clipboardWrite permissions. These permissions are optional and only requested if a user enables  Universal copy &amp; paste. However, perhaps Chrome is unwilling to allow extensions to request these permissions now?  Google did kill clipboard managers on Android recently after all. This will mean removing the feature from our extension.\n Why not just keep trying submissions with changes that might help until it passes review?\n I think I don’t have any choice to do this, but it isn’t without risk. I fear Google’s automated system will think I am trying to find a way around the rules and permaban my entire Google account. Their policy does specifically state:  This may also result in the suspension of related Google services associated with your Google account.\n  Later today I am going to give another submission a try with the 2 changes I listed above. Follow our blog and  @pushbullet for updates!\n  I’m eager to hear what people think so far. Am I missing something obvious? Do you have a good suggestion I may not have thought of? Do you have a friend that works on Chrome? Please share!  I have made a post on the Pushbullet subreddit for us to discuss this here.", "posttime": "2020-05-14 02:29:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,终止,权限", "title": "让我们猜猜谷歌在14天内需要什么，否则他们会终止我们的扩展", "title_en": "Let's Guess What Google Requires in 14 Days or They Kill Our Extension", "transed": 1, "url": "https://blog.pushbullet.com/2020/05/13/lets-guess-what-google-requires-in-14-days-or-they-kill-our-extension/", "via": "", "real_tags": ["谷歌", "google", "终止", "权限"]}, {"category": "", "categoryclass": "", "imagename": "8a8ffbe523848713ca1d5fa1a4674b4f.png", "infoid": 1002002, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "状态：Examples文件夹包含几个使用录制的示例。在隔离结束之前，我无法在硬件上测试它，但我相信它应该可以工作。我们非常欢迎您的反馈！\n如果您发现这些代码很有用，请考虑使用存储库。这将帮助我们获得支持该项目的资金。\nTempest(或Van Eck Phreking)是一种通过接收VGA/HDMI电缆和连接器发出的电磁信号来窃听视频监视器的技术(尽管其他目标也是可能的，例如通常使用相同术语的键盘，请参阅Wikipedia/Tempest)。\n这基本上是马丁·马里诺夫(Martin Marinov)卓越的TempestSDR在GNU Radio中的重新实现(参见https://github.com/martinmarinov/TempestSDR).。原因是我觉得它可能更容易维护和扩展。但是请注意，基本思想被模仿了，但是同步算法是不同的，并且缺少一些功能(特别是在GUI中)。\n对于技术上的解释，你可以阅读马里诺夫的论文或巴勃罗·梅诺尼的论文(西班牙语)。对于使用TempestSDR的演示，您可能会看到以下视频。\n有关工作示例，请参阅Examples文件夹(查看实际操作示例，请参阅https://www.youtube.com/watch?v=oTCu8HTaN3Y)。录音可以从https://iie.fing.edu.uy/investigacion/grupos/artes/es/proyectos/espionaje-por-emisiones-electromagneticas/(西班牙语)获得。\nMANUAL_SIMULATED_TEMPEST_example.grc。这是暴风雨和你实际监视的信号的模拟。它有助于理解所涉及的参数和由此产生的信号问题。信道和同步算法参数都可以从接口在运行中修改。图像源主要是从GR-PAINT复制的，可以使用PIL可读的任何图像文件(并且可以使用任何大小，因为块会将其重塑到块中指定的大小)。\nMANUAL_TEMPEST_example.grc。将录音或指向VGA电缆的USRP送入，您应该会看到一张图像！然而，在该示例中，VGA信号的所有参数都是手动设置的(并且基于这些参数校正采样误差)。此外，应对精细采样校正进行修改，直到获得稳定的图像(水平和垂直对齐也是可变的)。\nSemi_Automatic_temest_example.grc.。与上面相同，但分辨率是从可用的最典型分辨率列表中获取的。我已经从TempestSDR获得了该列表(尽管命令xrandr--Verbose也应该生成该列表)。\nauto_temest_example.grc。与上面相同，但水平线是同步的(因此，只需要手动垂直对齐)。要实现这一点，您应该估计分隔图像中始终出现的两条垂直线(由于消隐)的像素数。但是请注意，该算法可能不稳定。在这种情况下，请回退到Semi_Automatic_temest_example.grc。\n还包括半自动和手动示例，以监视HDMI信号。由于VGA和HDMI有很大的不同，目前还没有自动版本。\n间谍图像显示在Video SDL Sink中，这有其局限性(例如动态设置其尺寸)。然而，块组帧通过选择输入信号的用户定义的矩形在一定程度上解决了这个问题。因此，现在可以在执行流程图的同时探索分辨率。请参阅流程图上的注释。\n同步块可能会加重PC的负担。这可以通过正确配置Volk来缓解，如下所述。此外，如果CPU仍然是采样同步块的问题，您可以尝试减少lib/Samples_Synchronization_impl.cc中的变量d_proba_of_update和/或d_max_devision(并且仅使用MANUAL_SIMPLICED_TEMPEST_example.grc)。\n要求：GNU Radio 3.7，从源代码编译或与二进制文件一起安装(如果这是您的进一步要求，请参阅下面的案例)。一个与3.8兼容的版本即将问世。\ngit克隆https://github.com/git-artes/gr-tempest.git cd gr-tempestmkdir build CD build cmake../make&amp；&amp；sudo make install。\n对于用户空间安装或GNU Radio安装在与默认位置/usr/local不同的位置：\n请注意，如果您使用PyBOMBS安装GNU Radio，则DCMAKE_INSTALL_PREFIX应该指向PyBOMBS前缀。\n上面的说明假设您已经下载并编译了GNU Radio(使用build-gnuradio脚本或PyBOMBS)。如果您使用的是预编译的二进制软件包(比如$sudo apt-get install gnuradio)，那么您还应该安装gnuradio-dev(当然还有cmake和git，如果没有安装的话，再加上libost-all-dev、libcppunit-dev、liblog4cpp5-dev和swg)。\n请注意，gr-temest大量使用Volk。应该运行配置文件，以便最大限度地利用它。有关说明，请访问https://gnuradio.org/redmine/projects/gnuradio/wiki/Volk，或只需运行：\n问：Cmake抱怨未满足的要求。有什么问题吗？答：你应该仔细阅读这些错误(尽管我们认为它们有时是神秘的)。很可能是一个失踪的图书馆。候选的是Boost(在Ubuntu libost-all-dev中)或libcppunit(在Ubuntu libcppunit-dev中)。\n问：Cmake抱怨一些策略CMP0026和位置目标属性，谁知道还有什么。再问一次，问题出在哪里？答：例如，将Cmake与安装在Ubuntu16中的版本&gt；=3一起使用时会出现问题。好消息是，您可能会忽略所有这些警告。\n问：它没有编译。有什么问题吗？答：再说一遍，你应该仔细阅读错误。同样，它很可能是缺少的库，例如log4cpp(在Ubuntu liblog4cpp5-dev中)。如果问题出在GNU Radio的API上，您应该更新它。我已经用GNU电台3.7.11测试过gr-temest。最后，如果它抱怨随机数生成器，您必须使用-std=c++11标志进行编译。\n问：我收到以下错误：&#34；AttributeError：&#39；模块&#39；对象没有属性&#39；SAMPLICATION_SYNCHRONIZATION&#39；&#34；(或其他块)。为什么？答：这个问题可能是由几个因素造成的。你做过sudo ldconfig&34；吗？另一种可能是您没有安装SWIG(在这种情况下，您必须卸载gr-temest，删除build目录中的CMakeCache.txt，然后重新安装；即在安装SWIG之后)。", "note_en": "Status: The examples folder contains several examples that work with recordings. Until the end of the quarantine I won&#39;t be able to test it on hardware, but I&#39;m confident it should work. Feedback is more than welcome!\n If you find the code useful, please consider starring the repository. This will help us get funding to support the project.\n TEMPEST (or  Van Eck Phreaking) is a technique to eavesdrop video monitors by receiving the electromagnetic signal emitted by the VGA/HDMI cable and connectors (although other targets are possible, such as keyboards, for which the same term is generally used, see  Wikipedia/Tempest).\n This is basically a re-implementation of Martin Marinov&#39;s excelent TempestSDR in GNU Radio (see  https://github.com/martinmarinov/TempestSDR). The reason is that I felt it may be easier to maintain and extend. Note however that the basic ideas were imitated, but the synchronization algorithms are different, and some functionalities (particularly in the GUI) are missing.\n For a technical explanation you may read  Marinov&#39;s thesis or  Pablo Menoni&#39;s thesis (in spanish). For a demo using TempestSDR you may see the  following video.\n  See the examples folder for working examples (and  https://www.youtube.com/watch?v=oTCu8HTaN3Y to see them in action). Recordings may be obtained from  https://iie.fing.edu.uy/investigacion/grupos/artes/es/proyectos/espionaje-por-emisiones-electromagneticas/ (in spanish).\n  manual_simulated_tempest_example.grc. This is a simulation of TEMPEST and the signal you are actually spying. It helps to understand the parameters involved and the resulting signal&#39;s problems. Both the channel&#39;s and the synchronization algorithms&#39; parameters may be modified on the fly from the interface. The image source was mostly copied from  gr-paint&#39;s and any image file readable by PIL may be used (and in any size, as the block reshapes it to the size indicated in the block).\n manual_tempest_example.grc. Feed a recording or the USRP pointing to a VGA cable and you should see an image! However, in this example all parameters of the VGA signal are manually set (and sampling errors are corrected based on these parameters). Moreover, the fine sampling correction should be modified until a stable image is obtained (and horizontal and vertical alignment are also changeable).\n semi_automatic_tempest_example.grc. Same as above, but the resolutions are obtained from a list of the most typical resolutions available. I&#39;ve obtained the list from TempestSDR (although the command  xrandr --verbose should produce the list too).\n automatic_tempest_example.grc. Same as above, but the horizontal line is synchronized (thus, only manual vertical alignment is necessary). To achieve this, you should estimate the number of pixels that separate two vertical lines that always appear in the image (due to blanking). Note however that the algorithm may be unstable. In that case, fall back to  semi_automatic_tempest_example.grc.\n Semi-automatic and manual examples are also included to spy on HDMI signals. Due to the significant difference between VGA and HDMI, there is no automatic version yet.\n  The spied image is shown in a  Video SDL Sink, which has its limitations (such as dynamically setting its dimensions). However, the block  Framing somewhat solves this problem by choosing a user-defined rectangle of the incoming signal. Thus, exploring resolutions while executing the flowgraph is now possible. See the comments on the flowgraph.\n The synchronization blocks may be heavy on the PC. This may be alleviated by properly configuring VOLK as explained below. Moreover, if CPU is still a problem with the  sampling synchronization block, you may try reducing the variable  d_proba_of_updating and/or  d_max_deviation in  lib/sampling_synchronization_impl.cc (and using only  manual_simulated_tempest_example.grc).\n Requirements: GNU Radio 3.7, either compiled from source or installed with a binary (see below if this this is your case for further requirements). A 3.8-compatible version coming soon.\n   git clone https://github.com/git-artes/gr-tempest.git cd gr-tempestmkdir build cd build cmake ../ make &amp;&amp; sudo make install\n For a user space installation, or GNU Radio installed in a location different from the default location /usr/local:\n  Please note that if you used PyBOMBS to install GNU Radio the DCMAKE_INSTALL_PREFIX should point to the PyBOMBS prefix.\n    Instructions above assume you have downloaded and compiled GNU Radio (either with the build-gnuradio script or with PyBOMBS). If you&#39;ve used a pre-compiled binary package (like in $ sudo apt-get install gnuradio), then you should also install gnuradio-dev (and naturally cmake and git, if they were not installed, plus libboost-all-dev, libcppunit-dev, liblog4cpp5-dev and swig).\n Note that gr-tempest makes heavy use of VOLK. A profile should be run to make the best out of it. Please visit  https://gnuradio.org/redmine/projects/gnuradio/wiki/Volk for instructions, or simply run:\n  Q: Cmake complains about unmet requirements. What&#39;s the problem?  A: You should read the errors carefully (though we reckon they are sometimes mysterious). Most probably is a missing library. Candidates are Boost (in Ubuntu libboost-all-dev) or libcppunit (in Ubuntu libcppunit-dev).\n Q: Cmake complains about some Policy CMP0026 and LOCATION target property and who knows what else. Again, what&#39;s the problem?  A: This is a problem with using Cmake with a version &gt;= 3, which is installed in Ubuntu 16, for instance. The good news is that you may ignore all these warnings.\n Q: It is not compiling. What&#39;s the problem?  A: Again, you should read carefully the errors. Again, it&#39;s most probably a missing library, for instance log4cpp (in Ubuntu liblog4cpp5-dev). If the problem is with the API of GNU Radio, you should update it. I&#39;ve tested gr-tempest with GNU Radio 3.7.11. Finally, if it complains about the random number generator, you have to compile using the -std=c++11 flag.\n Q: I got the following error: &#34;AttributeError: &#39;module&#39; object has no attribute &#39;sampling_synchronization&#39;&#34; (or some other block). Why?  A: This problem may be generated by several factors. Did you &#34;sudo ldconfig&#34;? Another possibility is that you don&#39;t have swig installed (in this case, you must uninstall gr-tempest, delete CMakeCache.txt in the build directory, and re-install; that is, after installing swig).", "posttime": "2020-05-14 02:29:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "tempest", "title": "GNU无线电中TEMPEST的一种实现", "title_en": "An Implementation of Tempest in GNU Radio", "transed": 1, "url": "https://github.com/git-artes/gr-tempest", "via": "", "real_tags": ["tempest"]}, {"category": "", "categoryclass": "", "imagename": "5053de39ce37902bc1051ff3e36236a4.jpg", "infoid": 1002001, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Alienware发布了其旗舰产品Area-51M游戏笔记本电脑的第二代产品Area-51M R2。它在外观上与最初的51M很相似，但内部规格几乎完全翻新了，配备了第10代英特尔处理器，新的NVIDIA GPU，更快的RAM，以及更好的显示选项。不过，所有这些升级都将仅限于新的R2机型。尽管Alienware的目标是面向未来的可升级部件，但这个面积为5100万的地区未能发挥其潜力。\n该地区最大的吸引力之一-51M是用户可更换部件的选项。为了缩小尺寸，大多数现代笔记本电脑几乎所有的内部部件都密封到位。但Area-51M采取了不同的方式。它很大，易于拆卸，几乎所有内部组件，从RAM到CPU，到GPU，甚至散热组件，都可以轻松更换。我们的想法是制造出比其他台式机更便携，但比任何笔记本电脑更具定制化的东西。\nAlienware的母公司戴尔甚至为笔记本电脑中的可更换GPU打造了自己的系统，名为DGFF(戴尔图形外形规格)，以便将来更容易升级。这是一个想法，戴尔稍后将通过向最初购买功能较差的GTX 1660Ti或RTX 2060卡并决定想要升级的用户销售更换的RTX 2070和2080模块来实现这一想法。诚然，在同一个家庭中从一个GPU升级到另一个并不是大多数人在游戏PC上所做的事情。\n公平地说，当Alienware推出Area-5100万的时候，该公司从未直接承诺过会提供新的GPU-只是客户可以在已经提供的卡中进行升级。该公司当时甚至告诉The Verge，它“希望能够(对新的GPU升级)说”是“；目前，我们还不知道。”\n但现在，随着Area-51M R2的推出，出现了使用DGFF格式的新GPU。根据戴尔的说法，“Area-51M R1仅支持当前一代显卡内的GPU升级。”换句话说：您可以通过升级套件升级到已有的RTX 2070和2080，但不能升级到Area-51M R2附带的新RTX 2070 Super和2080 Super选项。\n您也不能将R1型号的处理器升级到R2型号提供的新的第10代芯片；与GPU一样，客户只能在R1附带的现有第9代芯片阵列内升级，尽管Area-51M使用标准台式机插槽。\n并不是所有这些都在Alienware上。例如，英特尔改变了其新的第10代台式机芯片的插座规格，使其与使用第9代阵容的旧主板(如Area-51M R1)不兼容。但它突显了单一笔记本电脑采用台式机式方式的局限性：如果台式机用户想要利用英特尔最新的硬件，同时保留大部分(如果不是全部)个人电脑部件，他们可以很容易地升级主板。这不是面积为5100万的业主可以选择的。\n除了失败的实验，很难将51m的面积视为任何东西。以高昂的价格(第一代的价格在2000美元到5000美元之间，新机型的起价为3049.99美元)，你可以买一台功能更强的台式电脑，它实际上提供面向未来的功能，而Area-51M的不足之处，或者你可以买一台更轻、更便宜、更便携的游戏笔记本，电池续航时间更长，但与Area一样缺乏升级性-例如，51M-就像Alienware自己的M17。\n面积-51M本应在一台设备中提供台式游戏PC和便携式游戏笔记本的最佳部件。取而代之的是，由于其高昂的价格和有限的可升级性，它最终以一系列妥协告终，强调了这两类产品最糟糕的局限性。", "note_en": "Alienware has announced the second generation of its flagship Area-51m gaming laptop, the Area-51m R2. It’s largely similar on the outside to the  original Area-51m, but the specs are almost completely overhauled on the inside, with 10th Gen Intel processors, new Nvidia GPUs, faster RAM, and better display options. All of those upgrades will be limited to the new R2 model, though. Despite Alienware’s goals for future-proofed upgradable parts, the Area-51m has failed to live up to its potential.\n One of the biggest draws of the Area-51m was the option for user-replaceable parts. Most modern laptops have nearly all of their internal components sealed in place in an effort to cut down on size. But the Area-51m  took a different approach. It was big, easy to disassemble, and made it simple to replace nearly every internal component, from RAM to the CPU to the GPU to even the thermal cooling components. The idea was to make something more portable than any other desktop but more customizable than any laptop.\n   Alienware’s parent company, Dell, even built its own system for replaceable GPUs in laptops, called DGFF (Dell Graphics Form Factor) to make it easier to upgrade in the future. It’s an idea that Dell would later make good on by  selling replacement RTX 2070 and 2080 modules for users who had initially bought the less powerful GTX 1660Ti or RTX 2060 cards and decided that they wanted an upgrade. Admittedly, upgrading from one GPU to another within the same family isn’t what most people do with gaming PCs.\n  To be fair to Alienware, back when it launched the Area-51m, the company never outright promised that it would offer new GPUs — only that customers would be able to upgrade within the selection of cards already on offer. The company even  told  The Verge at the time that  it’d “like to be able to say yes [to new GPU upgrades]; right now, we have no idea.”\n But now, with the launch of the Area-51m R2, there  are new GPUs that use the DGFF format. According to Dell, the “Area-51m R1 only supports GPU upgrades within its current generation of graphics cards.” In other words: you can upgrade to the already-available RTX 2070 and 2080 through upgrade kits but not the new RTX 2070 Super and 2080 Super options that are shipping with the Area-51m R2.\n   You also can’t upgrade the processor in the R1 model to the new 10th Gen chips that are being offered on the R2 model; like the GPU, customers can only upgrade within the existing array of 9th Gen chips that the R1 shipped with, despite the fact that the Area-51m uses standard desktop sockets.\n Not all of this is on Alienware. Intel, for example, changed the socket specifications for its  new 10th Gen desktop chips, making them incompatible with older motherboards that work with the 9th Gen lineup — like the Area-51m R1. But it highlights the limitations of taking a desktop-style approach to a single laptop: desktop PC owners can easily upgrade their motherboards if they want to take advantage of Intel’s latest hardware while retaining most (if not all) of their PC’s parts. That’s not an option that’s available to Area-51m owners.\n It’s hard to look at the Area-51m as anything but a failed experiment. For the massive price it costs (the first gen ranged between $2,000 to $5,000; the new model starts at $3,049.99), you can buy a more capable desktop PC that actually offers the future-proofing at which the Area-51m falls short, or you can buy a lighter, cheaper, more portable gaming laptop with better battery life that has the same lack of upgradability as the Area-51m — like Alienware’s own m17, for example.\n   The Area-51m was supposed to offer the best parts of desktop gaming PCs and portable gaming laptops in a single device. Instead, with its hefty price tag and limited upgradability, it’s ended up as a series of compromises that emphasize the worst limitations of both categories.", "posttime": "2020-05-14 02:14:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "alienware,dream,升级", "title": "Alienware Area-51M的可升级梦想在短短一年内就失败了", "title_en": "The Alienware Area-51m's Upgradable Dream Has Failed in Just One Year", "transed": 1, "url": "https://www.theverge.com/circuitbreaker/2020/5/13/21256845/alienware-area-51m-r1-r2-specs-upgradable-parts-gpu-dgff-limited", "via": "", "real_tags": ["alienware", "dream", "升级"]}, {"category": "", "categoryclass": "", "imagename": "7a09c4d1dc2a1223a27b2e0ee35c4beb.jpeg", "infoid": 1002000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒的流行给外卖公司带来了前所未有的商机：数百万美国人呆在家里，错过了他们最喜欢的餐厅。\n然而，他们正在努力从几十年来最大的外卖市场之一中获利。包括GrubHub Inc.在内的公司。优步技术公司(Uber Technologies Inc.)旗下的优步Eats(Uber Eats)部门在送货订单上亏损或勉强实现盈亏平衡。他们说，他们不确定有多少食客会在在家点餐放松后坚持送货。\n..。", "note_en": "The coronavirus pandemic handed food-delivery companies an unprecedented business opportunity: millions of Americans stuck at home, missing their favorite restaurants.\n  Yet they are struggling to profit from one of the greatest food-delivery markets in decades. Companies including Grubhub Inc. and Uber Technologies Inc.’s Uber Eats division, are losing money on delivery orders or barely breaking even. And they say they aren’t sure how many diners will stick with delivery after stay-at-home orders are relaxed.\n...", "posttime": "2020-05-14 01:59:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "快递,stuck", "title": "美国被困在国内，但快递公司仍在为盈利而苦苦挣扎", "title_en": "America Is Stuck at Home, but Food-Delivery Companies Still Struggle to Profit", "transed": 1, "url": "https://www.wsj.com/articles/america-is-stuck-at-home-but-food-delivery-companies-still-struggle-to-profit-11589374801", "via": "", "real_tags": ["快递", "stuck"]}, {"category": "", "categoryclass": "", "imagename": "31554ed7f4f3b06b0edeb2f4c235281b.jpg", "infoid": 1001999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊首席运营官周二在接受Recode采访时表示，亚马逊计划将仓库工人的危险津贴延长至5月底，但将在6月恢复正常薪酬水平。这一决定出台之际，亚马逊正面临进步政客、活动团体和自己员工的严格审查，原因是亚马逊对待在冠状病毒大流行期间仍在工作的一线员工。\n3月中旬，随着大流行关闭了世界各地被认为不必要的业务，亚马逊开始向其在美国的仓库和送货员工支付额外的每小时2美元，以及双倍的加班费。它为加拿大、英国和一些欧洲国家的一线员工提供了类似的临时加薪。\n亚马逊负责全球运营的高级副总裁戴夫·克拉克(Dave Clark)告诉Recode：“我们将对其再做一次延期，并将其推到本月底。”\n当亚马逊在3月16日宣布首次加薪时，加薪计划将持续到4月底。亚马逊后来将这一政策延长至5月16日。现在，涨价将于5月31日结束。\n我们现在继续看到来自客户和…的令人难以置信的需求。我们团队重返工作岗位的反应也非常好，“克拉克说。“我们认为，这对员工来说是正确的，对客户来说也是正确的，让他们保留几个星期。”\n当被问及为什么加薪不会持续到6月份时，亚马逊的一位发言人没有直接回答这个问题。\n这位发言人在一份声明中说：“这种欣赏和薪酬激励使我们能够在这个前所未有的时期向社区提供必要的物品。”“我们感谢同事在需求增加的时候支持客户，并在月底恢复我们的正常工资和加班工资.”\n亚马逊恢复定期支付之际，美国一些州已经开始开放非必要的业务，但美国最大的大都市区仍然几乎完全关闭。周二，政府首席传染病专家安东尼·福奇(Anthony Fuci)博士警告称，过早开业可能会导致新的疫情爆发。一些零售商，如食品杂货连锁店克罗格(Kroger)，将在未来几天内结束对一线员工的奖金支付，而塔吉特(Target)将在5月底之前支付奖金，沃尔玛(Walmart)将支付到6月。\n亚马逊上个月表示，4-6月间将产生40亿美元与冠状病毒相关的费用，原因是工资上涨、“对个人防护设备的投资、加强对我们设施的清洁”，以及其他举措，包括针对该病毒的内部检测计划。该公司辩称，其薪酬和福利计划，以及在大流行期间加强安全措施的时机，与其同行零售商和其他美国主要雇主相比是有利的。\n但包括一些亚马逊仓库和公司员工在内的批评人士抱怨称，该公司在应对流行病方面存在缺陷。一些员工表示，他们担心在工作中感染病毒，在履行中心并不总是可能保持社交距离，他们希望获得有关各自机构确诊病例的更多信息。对于亚马逊的企业员工来说，最大的问题是该公司如何解雇了几名公开表达安全担忧的一线和企业员工。\n在最引人注目的一起案件中，亚马逊解雇了仓库员工克里斯蒂安·斯莫尔斯(Christian Smalls)，几个小时前，他在纽约斯塔顿岛(Staten Island)的一个仓库领导了一场小型罢工。亚马逊表示，由于与一名冠状病毒检测呈阳性的同事保持密切联系，斯莫尔斯因返回设施而被解雇，此前该公司将他送回家进行自我隔离，并支付了费用。\n斯莫尔斯否认违反了社交距离警告，并认为他是因为自己的激进主义而成为攻击目标。亚马逊领导层会议泄露的笔记进一步激起了愤怒-包括亚马逊的公司员工-他们透露，亚马逊的首席律师称斯莫尔斯“不聪明，也不善于表达”。\n亚马逊决定终止3月中旬实施的无限制无薪休假政策，以及计划结束危险津贴，也令一些员工和维权团体感到不安。克拉克告诉Recode，尽管无限制无薪休假政策已经结束，但员工还有其他几种休假选择，该公司超过1万名一线员工已经使用这些选择来休假。\n亚马逊仓库网络内的工作条件长期以来一直是争议的主题，但这场流行病提高了员工的赌注，亚马逊高管将他们称为“零售英雄”。当地方政府命令数千万美国人留在家里试图减缓疾病的传播时，亚马逊仓库和送货工人一直在为亚马逊客户挑选、包装和运送食物、补给和其他物品。\n在Vox的每一天，我们都致力于回答您最重要的问题，并为您和世界各地的观众提供有能力拯救生命的信息。此时此刻，我们的使命从未像现在这样重要：通过理解来增强你们的能力。VOX的工作正在接触到比以往任何时候都多的人，但我们独特的解释性新闻品牌需要资源-特别是在大流行和经济低迷时期。您的财政贡献不会构成捐赠，但它将使我们的工作人员能够继续以当前所需的质量和音量提供免费的文章、视频和播客。请考虑今天就为VOX做出贡献。", "note_en": "Amazon plans to extend hazard pay for warehouse workers through the end of May, but it will return to normal pay rates in June, the company’s top operations executive told Recode in an interview on Tuesday. The decision comes as Amazon faces intense scrutiny from  progressive politicians,  activist groups, and  its own workforce over its treatment of its front-line employees who have kept working during the  coronavirus pandemic.\n In mid-March, as the pandemic shut down businesses across the world that are deemed nonessential, Amazon started paying its warehouse and delivery employees in the US an additional $2 per hour as well as double overtime pay. It offered similar temporary pay increases for front-line staff in Canada, the UK, and some European countries.\n “We’re going to do one more extension on it and push it out until the end of the month,” Dave Clark, Amazon’s senior vice president of worldwide operations, told Recode.\n When Amazon announced the first wage hike on March 16, it was set to run through the end of April. Amazon later extended the policy through May 16. Now the increases will end on May 31.\n “We continue to see incredible demand from customers right now and … our team’s response in coming back to work has been really great as well,” Clark said. “We think it’s the right thing for employees and the right thing for customers to keep it on for a couple of weeks.”\n Asked why the pay bump won’t continue into June, an Amazon spokesperson did not answer the question directly.\n “This appreciation and pay incentive enabled us to deliver essential items to communities during these unprecedented times,” the spokesperson said in a statement. “We are grateful to associates supporting customers during a time of increased demand, and are returning to our regular pay and overtime wages at the end of the month.”\n Amazon’s return to regular pay comes as  some US states have begun to open up nonessential businesses, but the country’s largest metro areas remain almost completely shut down. On Tuesday, Dr. Anthony Fauci, the government’s top infectious disease expert, warned that premature business openings  could lead to new outbreaks. Some retailers like the grocery chain Kroger are ending bonus pay for front-line workers over the next few days, while Target is paying bonuses through the end of May and Walmart into June.\n Amazon said last month that it would incur $4 billion in expenses related to Covid-19 between April and June because of wage increases, “investments in personal protective equipment, enhanced cleaning of our facilities,” and other initiatives, including an in-house testing program for the virus. The company has argued that its pay and benefit programs, as well as the timing of its increased safety measures during the pandemic, compare favorably to its fellow retailers and other major US employers.\n But critics, including some Amazon warehouse and corporate employees, have complained about flaws in the company’s pandemic response. Some employees say they are concerned about contracting the virus at work, that social distancing is not always possible in fulfillment centers, and that they want more information about confirmed cases at their respective facilities. And for corporate employees at Amazon, the biggest issue has been how the company  fired several front-line and corporate employees who spoke out publicly about safety concerns.\n In the highest-profile case,  Amazon fired warehouse employee Christian Smalls hours after he led a small walkout at a warehouse in Staten Island, New York, at the end of March. Amazon said Smalls was terminated for returning to the facility after the company had sent him home with pay to self-quarantine because he had been in close contact with a colleague who tested positive for Covid-19.\n Smalls has denied violating social distancing warnings and believes he was targeted for his activism. Leaked notes from an Amazon leadership meeting fueled further outrage —  including among Amazon’s corporate workers — when they revealed Amazon’s top lawyer  referred to Smalls as “not smart, or articulate.”\n Some employees and activist groups have also been upset by Amazon’s decision to end an unlimited unpaid time off policy it implemented in mid-March, as well as the planned end of hazard pay. Clark told Recode that employees have several other leave options despite the end of the unlimited unpaid time off policy, and that more than 10,000 of its front-line workers have used those options to take time off.\n Working conditions inside Amazon’s warehouse network  have long been a subject of controversy, but the pandemic has raised the stakes for workers, whom Amazon executives have referred to as “retail heroes.” When local governments are ordering tens of millions of Americans to remain home to try to slow the spread of the disease, Amazon warehouse and delivery workers have kept picking, packing, and delivering food, supplies, and other items to Amazon customers.\n   Every day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires.  Please consider making a contribution to Vox today.", "posttime": "2020-05-14 01:32:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,奖金,extends,员工", "title": "亚马逊延长一线员工奖金，但表示将于6月结束", "title_en": "Amazon Extends Bonus Pay For Front-line Workers But Says it Ends in June", "transed": 1, "url": "https://www.vox.com/recode/2020/5/13/21256756/amazon-pay-increases-frontline-warehouse-workers-covid-19-coronavirus-pandemic-may", "via": "", "real_tags": ["amazon", "亚马逊", "奖金", "extends", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Erlang生态系统中任何编程语言的成功都可以分为三个紧密耦合的组件。它们是：1)Erlang编程语言的语义，在此基础上实现其他语言；2)用于构建可伸缩和弹性并发系统的OTP库和中间件；3)与语言语义和OTP紧密耦合的BEAM虚拟机。\n把这些组件中的任何一个单独拿出来，你就会获得亚军。但是，将这三者放在一起，您就会在可伸缩、弹性的软实时系统方面获得无可争议的赢家。引用Joe Armstrong的话说，“您可以复制Erlang库，但如果它不在BEAM上运行，您就无法模仿其语义”。这由Robert Virding的编程第一规则强制执行，该规则规定“任何用另一种语言编写的足够复杂的并发程序都包含半个Erlang的特别的、非正式指定的、充满错误的缓慢实现。”\n在这篇文章中，我们想要探索BEAM VM的内部结构。我们将在适用的情况下将它们与JVM进行比较，强调您应该关注它们的原因。太长时间以来，该组件一直被视为一个黑匣子，理所当然，没有理解其原因或含义。是时候改变这一点了！\nErlang和BEAM VM被发明为解决特定问题的合适工具。它们由爱立信开发，以帮助实现同时处理移动和固定网络的电信基础设施。该基础设施本质上是高度并发和可伸缩的。它必须显示软实时属性，并且可能永远不会失败。我们不希望在祖母挂断的情况下我们手机上的Hangout通话，或者我们对堡垒之夜的在线游戏体验受到系统升级、高用户负载或软件、硬件和网络中断的影响。BEAM VM通过提供在可预测的并发编程模型之上工作的微调功能进行了优化，以解决其中的许多挑战。\n它的秘诀是不共享内存的轻量级进程，由调度器管理，调度器可以跨多个内核管理数百万个进程。它使用在每个进程基础上运行的垃圾收集器，高度优化以减少对其他进程的任何影响。因此，垃圾收集器不会影响系统的整体软实时属性。BEAM也是唯一大规模使用的具有内置分发模型的广泛使用的VM，该模型允许程序透明地在多台机器上运行。\nJava虚拟机(JVM)是由Sun Microsystem开发的，目的是为在任何地方运行的“一次编写”代码提供一个平台。他们创建了一种类似于C++的面向对象语言，但是内存安全，因为它的运行时错误检测检查数组边界和指针取消引用。JVM生态系统在互联网时代变得非常流行，使其成为企业服务器应用程序的事实标准。广泛的适用性得益于可满足多种用例的虚拟机，以及一组令人印象深刻的面向企业开发的库。\nJVM的设计考虑到了效率。它的大部分概念都是流行操作系统中特性的抽象，比如映射到操作系统线程的线程模型。JVM是高度可定制的，包括垃圾收集器(GC)和类加载器。一些最先进的GC实现提供了高度可调的特性，以迎合基于共享内存的编程模型。JVM允许您在程序运行时更改代码。而且，JIT编译器允许将字节码编译成本机代码，目的是加速应用程序的某些部分。\nJava世界中的并发性主要关注在并行线程中运行应用程序，以确保它们是快速的。使用并发原语进行编程是一项困难的任务，因为它的共享内存模型带来了挑战。为了克服这些困难，有人尝试简化和统一并发编程模型，最成功的尝试是Akka框架。\n我们谈到如果部分代码同时在多个内核、处理器或计算机上运行，则称为并行代码执行，而并发编程指的是独立处理到达系统的事件。并发执行可以在单线程硬件上模拟，而并行执行不能。尽管这种区别可能看起来很迂腐，但这种区别导致了一些非常不同的问题需要解决。想想很多厨师做了一盘卡波纳拉意大利面。在并行方法中，任务被分配到可用的厨师数量上，单个部分的完成速度与这些厨师完成其特定任务的速度一样快。在一个并发世界中，您将为每个厨师分得一部分，在那里每个厨师都完成所有的任务。您使用并行度来表示速度，使用并发性来表示规模。\n并行执行试图解决问题的最优分解，将问题分解成相互独立的部分。烧开水，得到意大利面，搅拌鸡蛋，炸墨西哥火腿，磨碎佩科里诺奶酪1。共享的数据(或者在我们的例子中，是服务的菜肴)通过锁、互斥和各种其他技术来处理，以确保正确性。看待这一点的另一种方式是，数据(或成分)是存在的，并且我们希望利用尽可能多的并行CPU资源来尽可能快地完成工作。\n另一方面，并发编程处理在不同时间到达系统的许多事件，并试图在合理的时间内处理所有事件。在多核或分布式体系结构上，有些执行是并行运行的，但这不是必需的。另一种看待它的方式是，同一个厨师煮水，吃意大利面，搅拌鸡蛋等等，遵循一个总是相同的顺序算法。流程(或厨师)之间的变化是要处理的数据(或配料)，这些数据(或配料)存在于多个实例中。\nJVM是为并行而构建的，而BEAM是为并发而构建的。这是两个本质上不同的问题，需要不同的解决方案。\nBEAM提供了轻量级的进程来为运行的代码提供上下文。这些进程(也称为参与者)不共享内存，而是通过消息传递进行通信，将数据从一个进程复制到另一个进程。消息传递是虚拟机通过各个进程拥有的邮箱实现的功能。消息传递是非阻塞操作，这意味着将消息发送到另一个进程几乎是瞬间的，并且发送者的执行不会被阻止。发送的消息以不变数据的形式，从发送进程的堆栈复制到接收进程的邮箱。这是在进程之间不需要锁定和互斥的情况下实现的，仅在多个进程并行向同一收件人发送消息的情况下锁定邮箱。\n不可变的数据和消息传递使程序员能够编写彼此独立工作的进程，并将重点放在功能上，而不是对内存的低级管理和任务的调度。事实证明，这个简单的设计不仅适用于单个线程，而且还适用于运行在同一VM中的本地计算机上的多个线程，并且使用内置的分发版本，跨具有VM和机器群集的网络运行。如果消息在进程之间是不可变的，则可以将它们发送到另一个线程(或机器)而不加锁，在分布式多核体系结构上几乎是线性扩展的。本地VM上的进程寻址方式与VM群集中的相同，消息发送工作透明，而与接收进程的位置无关。\n进程不共享内存，因此您可以复制数据以获得恢复能力，并按规模分发数据。这意味着在两台不同的机器上拥有同一进程的两个实例，彼此共享状态更新。如果一台机器出现故障，另一台机器将拥有数据副本，并可以继续处理请求，从而使系统具有容错能力。如果两台机器都正常运行，则两个进程都可以处理请求，从而为您提供可伸缩性。BEAM为所有这些无缝工作提供了高度优化的原语，而OTP(“标准库”)提供了更高级别的构造，使程序员的生活变得轻松。\nAkka在复制更高级别的构造方面做得很好，但是由于缺少JVM提供的原语，这在一定程度上受到了限制，这使得它可以针对并发进行高度优化。虽然JVM的原语支持更广泛的用例，但它们使分布式系统编程变得更加困难，因为它们没有用于通信的内置原语，并且通常基于共享内存模型。例如，在分布式系统中，您将共享内存放在哪里？使用它的费用是多少？\n我们提到过，BEAM最强大的功能之一是能够将程序分解成小的、轻量级的过程。管理这些进程是调度器的任务。与JVM不同的是，JVM将其线程映射到OS线程并让操作系统对其进行调度，而BEAM带有自己的调度器。\n默认情况下，调度程序为每个内核启动一个操作系统线程，并优化它们之间的工作负载。每个进程都由要执行的代码和随时间变化的状态组成。调度程序挑选运行队列中准备运行的第一个进程，给它一定的减量来执行，其中每个减量大致相当于一个命令。一旦进程耗尽减量、被I/O阻塞、正在等待消息或完成执行其代码，调度程序就会选择运行队列中的下一个进程并将其分派。这种调度技术称为抢占式。\n我们多次提到Akka框架，因为它最大的缺点是需要用调度点来注释代码，因为调度不是在JVM级别进行的。通过从程序员手中移除控制，软实时属性被保留和保证，因为它们没有意外导致进程饥饿的风险。\n这些进程可以分布在可用的调度程序线程中，并最大限度地提高CPU利用率。有很多方法可以调整调度器，但很少有，仅在边缘和边缘情况下才需要，因为默认选项覆盖了大多数使用模式。\n有一个关于调度器的敏感话题经常出现：如何处理本地实现的功能(NIF)。NIF是用C语言编写的代码片段，作为库编译，并在与光束相同的内存空间中运行以提高速度。NIF的问题在于它们不是先发制人的，可能会影响调度程序。在最近的BEAM版本中，添加了一个新功能，脏调度器，以便更好地控制NIF。脏调度器是单独的调度器，它们在不同的线程中运行，以最大限度地减少NIF可能在系统中造成的中断。“脏”一词指的是由这些调度程序运行的代码的性质。\n当今的现代高级编程语言大多使用垃圾收集器进行内存管理。BEAM语言也不例外。当您想要编写高级并发代码时，信任虚拟机来处理资源和管理内存非常方便，因为它简化了任务。多亏了基于不可变状态的内存模型，垃圾收集器的底层实现相当简单和高效。数据是复制的，而不是变异的，并且进程不共享内存的事实消除了任何进程的相互依赖性，因此不需要管理它们。\nBEAM的另一个特性是，仅在需要时才按进程运行垃圾收集，而不会影响在运行队列中等待的其他进程。因此，Erlang中的垃圾收集不会“阻止世界”。它可以防止处理延迟峰值，因为VM永远不会作为一个整体停止-只有特定的进程才会停止，而且永远不会同时停止所有进程。在实践中，它只是流程所做工作的一部分，并被视为另一种减少。垃圾收集器收集进程会在非常短的时间间隔(通常是微秒)内挂起该进程。因此，将会有许多小突发，只有在进程需要更多内存时才会触发。单个进程通常不会分配大量内存，而且通常是短暂的，通过在终止时立即释放其分配的所有内存，进一步降低了影响。JVM的一个特性是能够交换垃圾收集器，因此通过使用商业GC，还可以在JVM中实现不间断GC。\nLukas Larsson在一篇优秀的博客文章中讨论了垃圾收集器的特性。有许多复杂的细节，但它经过优化，可以高效地处理不可变的数据，在每个进程的堆栈和堆之间划分数据。最好的方法是在短期流程中完成大部分工作。\n在这个主题上经常出现的一个问题是，光束使用了多少内存。在幕后，VM分配大量内存，并使用自定义分配器有效地存储数据，最大限度地减少系统调用的开销。这有两个明显的影响：1)在不需要空间后，已用内存逐渐减少；2)重新分配大量数据可能意味着将当前工作内存增加一倍。\n如果确实需要，可以通过调整分配器策略来缓解第一个影响。如果您了解不同类型的内存使用情况，则第二个选项很容易监视和计划。(提供开箱即用的系统指标的一种这样的监控工具是WOMBATOAM)。\n热代码加载可能是BEAM被引用最多的独特功能。热代码加载意味着可以通过更改系统中的可运行代码来更新应用程序逻辑，同时保留内部进程状态。这是通过替换加载的BEAM文件并指示VM替换运行进程中的代码引用来实现的。\n这是电信基础设施无需停机代码升级的关键功能，在电信基础设施中，冗余硬件用于处理峰值。如今，在集装箱化时代，其他技术也被用于生产更新。那些从未使用过它的人认为它是一个不太重要的功能，但它在开发工作流中的用处仍然很小。开发人员可以通过替换部分代码来加快迭代速度，而无需重新启动系统进行测试。即使应用程序设计为不能在生产中升级，这也可以减少重新编译和重新部署所需的时间。\n这在很大程度上是关于适合这项工作的工具。您需要一个速度极快的系统，但是不关心并发性吗？并行处理几个事件，并且必须快速处理它们？需要处理图形、人工智能或分析方面的数字吗？沿着C++、Python或Java路线走下去。电信基础设施不需要在浮动车上快速操作，因此速度从来都不是优先事项。借助动态类型(必须在运行时执行所有类型检查)，编译器时间优化就不那么简单了。因此，数字处理最好留给JVM、GO或其他编译为本机的语言。在JVM上运行的Erlang版本Erjang上的浮点操作比BEAM快5000%也就不足为奇了。但我们看到的亮点是使用其并发性来协调数字处理，将分析外包给C、Julia、Python或Rust。您可以在梁的外部绘制贴图，并在梁内进行减少。\n口头禅总是够快的。人类只需要几百毫秒就能感知到刺激(事件)并在大脑中进行处理，这意味着微秒或纳秒的响应时间对于许多应用程序来说并不是必需的。你也不会把光束用在微控制器上，它太耗费资源了。但是对于处理能力稍高一些的嵌入式系统来说，多核正在成为标准，您需要并发性，并且光束大放异彩。早在90年代，我们就在实施电话交换机，处理在16MB内存的嵌入式主板上运行的数以万计的用户。现在RaspberryPI有多少内存？最后是硬实时系统。您可能不希望光束管理您的安全气囊控制系统。您需要硬保证，只需要一个硬实时操作系统和一种没有垃圾收集或异常的语言。在裸机(如GRiSP)上运行的Erlang VM的实现将为您提供类似的保证。\n使用合适的工具来完成这项工作。如果您正在编写一个软实时系统，该系统必须开箱即用且永不失败，而且没有重新发明轮子的麻烦，那么BEAM就是您正在寻找的久经考验的技术。对许多人来说，它就像一个黑匣子。不知道它是如何工作的，就好比开着一辆法拉利，不能达到最佳性能，或者不知道那个奇怪的声音是从马达的哪个部分发出的。这就是为什么你应该学习更多关于梁的知识，了解它的内部结构，并准备好对其进行微调和修复。对于那些愤怒地使用Erlang和Elixir的人，我们推出了一个为期一天的讲师指导课程，它将揭开您所看到的许多神秘面纱，并解释您所看到的许多内容，同时为您处理大规模并发做好准备。该课程可通过我们的新讲师Lead远程培训获得，请单击此处了解更多信息。我们还推荐埃里克·斯坦曼(Erik Stenman)的BEAM书和德米特罗·利托夫琴科(Dmytro Lytovchenko)的文章集《BEAM WISDOMS》。\n1.其中一位作者还喜欢一道看起来类似的菜肴，不叫科纳拉拉，而是用奶油做的。", "note_en": "The success of any programming language in the Erlang ecosystem can be apportioned into three tightly coupled components. They are: 1)  the semantics of the Erlang programming language, on top of which other languages are implemented 2)  the OTP libraries and middleware used to architect scalable and resilient concurrent systems and 3)  the BEAM Virtual Machine tightly coupled to the language semantics and OTP.\n Take any one of these components on their own, and you have a runner up. But, put the three together, and you have the uncontested winner for scalable, resilient soft-real time systems. To quote Joe Armstrong, “You can copy the Erlang libraries, but if it does not run on BEAM, you can’t emulate the semantics”. This gets enforced by Robert Virding’s First Rule of Programming, which states that “Any sufficiently complicated concurrent program in another language contains an ad hoc informally-specified bug-ridden slow implementation of half of Erlang.”\n In this post, we want to explore the BEAM VM internals. We will compare and contrast them with the JVM where applicable, highlighting why you should pay attention to them and care. For too long, this component has been treated as a black box and taken for granted, without understanding the reasons or implications. It is time to change that!\n  Erlang and the BEAM VM were invented to be the right tool to solve a specific problem. They were developed by Ericsson to help implement telecom infrastructure handling both mobile and fixed networks. This infrastructure is highly concurrent and scalable in nature. It has to display soft real-time properties and may never fail. We don’t want our Hangouts calls on our mobile with our grandmothers dropped or our online gaming experience of Fortnite to be affected by system upgrades, high user load or software, hardware and network outages. The BEAM VM is optimised to solve many of these challenges by providing fine-tuned features which work on top of a predictable concurrent programming model.\n Its secret sauce are light-weight processes which don’t share memory, managed by schedulers which can manage millions of them across multiple cores. It uses a garbage collector which runs on a per-process basis, highly optimized to reduce any impact on other processes. As a result, the garbage collectors do not impact the overall soft real time properties of the system. The BEAM is also the only widely used VM used at scale with a built-in distribution model which allows a program to run on multiple machines transparently.\n  The Java Virtual Machine (JVM) was developed by Sun Microsystem with the intent to provide a platform for ‘write once’ code that runs everywhere. They created an object oriented language similar to C++, but memory-safe because its runtime error detection checks array bounds and pointer dereferences. The JVM ecosystem became extremely popular with the Internet-era, making it the de-facto standard for enterprise server applications. The wide range of applicability was enabled by a virtual machine that caters for a wide range use cases, and an impressive set of libraries catering for enterprise development.\n The JVM was designed with efficiency in mind. Most of its concepts are an abstraction of features found in popular operating systems such as the threading model which maps to operating system threads. The JVM is highly customisable, including the garbage collector (GC) and class loaders. Some state-of-the-art GC implementations provide highly tunable features catering for a programming model based on shared memory. The JVM allows you to change the code while the program is running. And, a JIT compiler allows byte code to be compiled to the native machine code with an intent to speed up parts of the application.\n Concurrency in the Java world is mostly concerned with running applications in parallel threads, ensuring they are fast. Programming with concurrency primitives is a difficult task because of the challenges created by its shared memory model. To overcome these difficulties, there are  attempts to simplify and unify the concurrent programming models, with the most successful attempt being the  Akka framework.\n  We talk about parallel code execution if parts of the code are run at the same time on multiple cores, processors or computers, while concurrent programming refers to handling events arriving to the system independently. Concurrent execution can be simulated on single threaded hardware, while parallel execution cannot. Although this distinction may seem pedantic, the difference results in some very different problems to solve. Think of many cooks making a plate of Carbonara pasta. In the parallel approach, the tasks are split across the number of cooks available, and a single portion would be completed as quickly as it took these cooks to complete their specific tasks. In a concurrent world, you would get a portion for every cook, where each cook does all of the tasks. You use parallelism for speed and concurrency for scale.\n Parallel execution tries to solve an optimal decomposition of the problem to parts that are independent of each other. Boil the water, get the pasta, mix the egg, fry the guanciale ham, grate the pecorino cheese  1. The shared data (or in our example, the serving dish) is handled by locks, mutexes and various  other techniques to guarantee correctness. Another way to look at this is that the data (or ingredients) are present, and we want to utilise as many parallel CPU resources as possible to finish the job as quickly as possible.\n Concurrent programming, on the other hand, deals with many events that arrive at the system at different times and tries to process all of them within a reasonable time. On multi-core or distributed architectures, some of the execution is run parallel, but this is not a requirement. Another way to look at it is that the same cook boils the water, gets the pasta, mixes the eggs and so on, following a sequential algorithm which is always the same. What changes across processes (or cooks) is the data (or ingredients) to work on, which exist in multiple instances.\n The JVM is built for parallelism, the BEAM for concurrency. They are two intrinsically different problems, requiring different solutions.\n  The BEAM provides  light-weight processes to give context to the running code. These processes, also called actors, don’t share memory, but communicate through message passing, copying data from one process to another. Message passing is a feature that the virtual machine implements through mailboxes owned by individual processes. The message passing is a non-blocking operation, which means that sending a message to another process is almost instantaneous and the execution of the sender is not blocked. The messages sent are in the form of immutable data, copied from the stack of the sending process to the mailbox of the receiving one. This is achieved without the need for locks and mutexes among the processes, only a lock on the mailbox in case multiple processes send a message to the same recipient in parallel.\n The immutable data and the message passing enable the programmer to write processes which work independently of each other and focus on the functionality instead of the low-level management of the memory and scheduling of tasks. It turns out that this simple design not only works on a single thread, but also on multiple threads on a local machine running in the same VM and, using the built in distribution, across the network with a cluster of VMs and machines. If the messages are immutable between processes, they can be sent to another thread (or machine) without locks, scaling almost linearly on distributed, multi-core architectures. The processes are addressed in the same way on a local VM as in a cluster of VMs, message sending works transparently regardless of the location of the receiving process.\n Processes do not share memory, allowing you to replicate your data for resilience and distribute it for scale. This means having two instances of the same process on two separate machines, sharing state updates among each other. If a machine fails, the other has a copy of the data and can continue handling the request, making the system fault tolerant. If both machines are operational, both processes can handle requests, giving you scalability. The BEAM provides the highly optimised primitives for all of this to work seamlessly, while OTP (the “standard library”) provides the higher level constructs to make the life of the programmers easy.\n Akka does a great job at replicating the higher level constructs, but is somewhat limited by the lack of primitives provided by the JVM, allowing it to be highly optimised for concurrency. While the primitives of the JVM enable a wider range of use cases, they make programming distributed systems harder as they have no built in primitives for communication and are often based on a shared memory model. For example, where in a distributed system do you place your shared memory? And what is the cost of accessing it?\n  We mentioned that one of the strongest features of the BEAM is the ability to break a program into small, light-weight processes. Managing these processes is the task of the scheduler. Unlike the JVM, which maps its threads to OS threads and lets the operating system schedule them, the BEAM comes with its own scheduler.\n The scheduler starts, by default, an OS thread for every core and optimises the workload between them. Each process consists of code to be executed and a state which changes over time. The scheduler picks the first process in the run queue that is ready to run, gives it a certain amount of reductions to execute, where each reduction is the rough equivalent of a command. Once the process has either run out of reductions, is blocked by I/O, is waiting for a message or completes executing its code, the scheduler picks the next process in the run queue and dispatches it. This scheduling technique is called pre-emptive.\n We mentioned the Akka framework many times, as its biggest drawback is the need to annotate the code with scheduling points, as the scheduling is not done at the JVM level. By removing the control from the hands of the programmer, soft real time properties are preserved and guaranteed, as there is no risk of them accidentally causing process starvation.\n The processes can be spread around the available scheduler threads and maximise CPU utilisation. There are many ways to tweak the scheduler but it is rare and needed only for edge and borderline cases, as the default options cover most usage patterns.\n There is a sensitive topic that frequently pops up regarding schedulers: how to handle Natively Implemented Functions (NIFs). A NIF is a code snippet written in C, compiled as a library and run in the same memory space as the BEAM for speed. The problem with NIFs is that they are not pre-emptive, and can affect the schedulers. In recent BEAM versions, a new feature, dirty schedulers, was added to give better control for NIFs.  Dirty schedulers are separate schedulers that run in different threads to minimise the interruption a NIF can cause in a system. The word dirty refers to the nature of the code that is run by these schedulers.\n  Modern, high level programming languages today mostly use a  garbage collector for memory management. The BEAM languages are no exception. Trusting the virtual machine to handle the resources and manage the memory is very handy when you want to write high level concurrent code, as it simplifies the task. The underlying implementation of the garbage collector is fairly straightforward and efficient, thanks to the memory model based on immutable state. Data is copied, not mutated and the fact that processes do not share memory removes any process interdependencies, which, as a result, do not need to be managed.\n Another feature of the BEAM is that garbage collection is run only when needed, on a per process basis, without affecting other processes waiting in the run queue. As a result, the garbage collection in Erlang does not ‘stop-the-world’. It prevents processing latency spikes, because the VM is never stopped as a whole - only specific processes are, and never all of them at the same time. In practice, it is just part of what a process does and treated as another reduction. The garbage collector collecting process suspends the process for a very short interval, often microseconds. As a result, there will be many small bursts, triggered only when the process needs more memory. A single process usually doesn’t allocate large amounts of memory, and is often short lived, further reducing the impact by immediately freeing up all its allocated memory on termination. A feature of the JVM is the ability to swap garbage collectors, so by using a commercial GC, it is also possible to achieve non-stopping GC in the JVM.\n The features of the garbage collector are discussed in an excellent  blog post by Lukas Larsson. There are many intricate details, but it is optimised to handle immutable data in an efficient way, dividing the data between the stack and the heap for each process. The best approach is to do the majority of the work in short lived processes.\n A question that often comes up on this topic is how much memory the BEAM uses. Under the hood the VM allocates big chunks of memory and uses custom allocators to store the data efficiently and minimise the overhead of system calls. This has two visible effects: 1) The used memory decreases gradually after the space is not needed 2) Reallocating huge amounts of data might mean doubling the current working memory.\n The first effect can, if really necessary, be mitigated by tweaking the allocator strategies. The second one is easy to monitor and plan for if you have visibility of the different types of memory usage. (One such monitoring tool that provides system metrics out of the box is  WombatOAM).\n  Hot code loading is probably the most cited unique feature of the BEAM. Hot code loading means that the application logic can be updated by changing the runnable code in the system whilst retaining the internal process state. This is achieved by replacing the loaded BEAM files and instructing the VM to replace the references of the code in the running processes.\n It is a crucial feature for no downtime code upgrades for telecom infrastructure, where redundant hardware was put to use to handle spikes. Nowadays, in the era of containerization, other techniques are also used for production updates. Those who have never used it dismiss it as a less important feature, but it is none-the-less useful in the development workflow. Developers can iterate faster by replacing part of their code without having to restart the system to test it. Even if the application is not designed to be upgradable in production, this can reduce the time needed for recompilation and redeployments.\n  It is very much about the right tool for the job. You need a system to be extremely fast, but are not concerned about concurrency? Handling a few events in parallel, and having to handle them fast? Need to crunch numbers for Graphics, AI or analytics? Go down the C++, Python or Java route. Telecom infrastructure does not need fast operations on floats, so speed was never a priority. Aided with dynamic typing, which has to do all type checks at runtime means compiler time optimizations are not as trivial. So number crunching is best left to the JVM, Go or other languages which compile to native. It is no surprise that floating point operations on Erjang, the version of Erlang running on the JVM, was 5000% faster than the BEAM. But where we’ve seen the BEAM shine is using its concurrency to orchestrate number crunching, outsourcing the analytics to C, Julia, Python or Rust. You do the map outside the BEAM and the reduce within the BEAM.\n The mantra has always been fast enough. It takes a few hundred milliseconds for humans to perceive a stimulus (an event) and process it in their brain, meaning that micro or nano second response time is not necessary for many applications. Nor would you use the BEAM for microcontrollers, it is too resource hungry. But for embedded systems with a bit more processing power, where multi-core is becoming the norm, you need concurrency, and the BEAM shines. Back in the 90s, we were implementing telephony switches handling tens of thousands of subscribers running in embedded boards with 16mb of memory. How much memory does a RaspberryPi have these days? And finally, hard real time systems. You would probably not want the BEAM to manage your airbag control system. You need hard guarantees, something only a hard real time OS and a language with no garbage collection or exceptions. An implementation of an Erlang VM running on the bare metal such as GRiSP will give you similar guarantees.\n  Use the right tool for the job. If you are writing a soft real time system which has to scale out of the box and never fail, and do so without the hassle of having to reinvent the wheel, the BEAM is the battle proven technology you are looking for. For many, it works as a black box. Not knowing how it works would be analogous to driving a Ferrari and not being capable of achieving optimal performance or not understanding what part of the motor that strange sound is coming from. This is why you should learn more about the BEAM, understand its internals and be ready to finetune and fix it. For those who have used Erlang and Elixir in anger, we have launched a one day instructor-led course which will demystify and explain a lot of what you saw whilst preparing you to handle massive concurrency at scale. The course is available through our new instructor lead remote training,  learn more here. We also recommend  The BEAM book by Erik Stenman and the  BEAM Wisdoms, a collection of articles by Dmytro Lytovchenko.\n       1.One of the authors also likes a similar looking dish not called carbonara but made with cream.", "posttime": "2020-05-14 01:31:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,并发,comparing,进程", "title": "在优化并发时比较BEAM Erlang VM和JVM的博客", "title_en": "Blog comparing the BEAM Erlang VM and JVM when optimising for concurrency", "transed": 1, "url": "https://www.erlang-solutions.com/blog/optimising-for-concurrency-comparing-and-contrasting-the-beam-and-jvm-virtual-machines.html", "via": "", "real_tags": ["博客", "并发", "comparing", "进程"]}, {"category": "", "categoryclass": "", "imagename": "aafdc94d23c117c4592af3f867194b88.jpg", "infoid": 1001997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4月24日，我们自豪地庆祝了我们第一个开发学位项目的毕业典礼。这一里程碑在Shopify历史上占有特殊的地位，因为这是一个从试错、实验、迭代和忙碌中诞生的日子。2016年的同龄人有幸成为我们的第一个班级，经历了新设计的项目的动荡和转折，并在全球大流行期间完成了教育，投入到远程学习和工作中。学生们的成功证明了他们的奉献精神、适应能力和毅力。它也是精心设计的项目和高功能的开发学位团队的产物。如何才能创造一个环境，让学生在四年内茁壮成长，成长为准备工作的员工？我们通过开发学位项目实现了这一使命。我们成功的关键在于我们的学习结构和多学科团队。有了我们的模式，学生比传统方法更快地掌握开发技能。开发学位计划结构当我们在2016年着手改革软件教育行业时，我们没有规范的蓝图来指导我们，也没有久经考验的最佳实践。尽管如此，我们还是抓住了与值得信赖的大学导师和经验丰富的Shopife内部教育工作者合作开辟一条新道路的机会，我们的愿景是创建一种替代传统合作模式的方式，这种模式在大学学习和工作安排之间交替。在开发学位课程中，学生在参加大学课程的同时，通过技能培训和团队安置，获得在Shopify连续四年的开发人员实践经验。此模式加速了理解，并允许学生将课堂理论应用于广泛的技术领域的现实产品开发。开发学位时间虽然计算机科学和技术是我们学习模型的核心，但提升该课程的是对个人成长的关注、可操作的反馈循环以及对公司、同事和商家产生影响的机会。大学课程开发学位课程可获得经认可的计算机科学学位，这是许多学生及其家人探索高等教育机会的决定性因素。所有必需的核心理论概念、计算机科学课程、数学课程和选修课都由大学定义并在大学教授。在整个四年制课程中，学生们每学期在Shopify每周工作25个小时，同时每学期学习三门大学课程。大学课程的所有正式评估、评分和期末考试都是由大学进行的。开发学位结构虽然大学对课程设定了要求，但我们合作定义了课程顺序，以确保学生在开始在商店进行团队安置工作之前，在他们的计划中尽可能早地接触到计算机科学的内容。除了核心的大学课程外，还有教授适用于技术行业的软件开发概念的实习课程。大学通过实践报告和与大学主管或顾问的会议来评估实习课程的学习结果。Shopify教授的课程和概念建立在大学课程的基础上，向学生传授动手开发技能、沟通技能、开发工具培训，以及如何有效地为现实世界的产品开发团队做出贡献。开发人员技能培训：建立坚实的基础我们在计划早期学到的课程之一是，学生在被安排到开发团队之前需要扎实的开发技能基础，才能感到有信心并准备做出贡献。Shopify的第一年使开发人员学位课程有别于其他工作集成学习课程，因为我们让学生沉浸在我们由Shopify主导的开发人员技能培训中。在第一年，我们向学生介绍构成他们在Shopify和其他公司工作的基础的技能和工具。在进入团队之前，他们需要培养一些技能，例如使用代码库和提交代码、使用命令行、前端开发、处理数据等等。学生在开发学位第一年学习的技术技能的广度超出了传统的大学课程。这个基础可以让学生自信地加入他们的第一个就业团队，并产生立竿见影的效果。我们特意采用这种方式进行教学。大学经常选择一种自下而上的学习模式，这种模式是由前置理论和概念驱动的。我们将我们的计划设计为让学生在自上而下和自下而上之间的某个地方沉浸其中，让他们在每天开发一些基本技能和代码后逐渐发现基础知识。由于软件开发的不断发展性质，我们经常更新开发人员技能培训路径。我们当前的课程包括以下技术：命令行界面(CLI)Vi", "note_en": "On April 24th, we proudly celebrated the graduation of our first Dev Degree program cohort. This milestone holds a special place in Shopify history because it’s a day born out of trial and error, experimentation, iteration, and hustle. The 2016 cohort had the honor and challenge of being our first class, lived through the churn and pivots of a newly designed program, and completed their education during a worldwide pandemic, thrust into remote learning and work. The students’ success is a testament to their dedication, adaptability, and grit. It’s also the product of a thoughtfully-designed program and a high-functioning Dev Degree team.What does it take to create an environment where students can thrive and develop into work-ready employees in four years?We’ve achieved this mission with the Dev Degree program. The key to our success is our learning structure and multidisciplinary team. With our model, students master development skills faster than traditional methods.The Dev Degree Program StructureWhen we set out to shake-up software education in 2016, we had no prescriptive blueprint to guide us and no tried-and-true best practices. Still, we embraced the opportunity to forge a new path in partnership with trusted university advisors and experienced internal educators at Shopify.Our vision was to create an alternative to the traditional co-op model that alternates between university studies and work placements. In Dev Degree, students receive four years of continual hands-on developer experience at Shopify, through skills training and team placements, in parallel to attending university classes. This model accelerates understanding and allows students to apply classroom theory to real-life product development across a breadth of technology.Dev Degree TimelineWhile computer science and technology are at the core of our learning model, what elevates the program is the focus on personal growth, actionable feedback loops, and the opportunity to make an impact on the company, coworkers, and merchants.University Course CurriculumThe Dev Degree program leads to an accredited Computer Science degree, which is a deciding factor for many students and their families exploring post-secondary education opportunities. All required core theoretical concepts, computer science courses, math courses, and electives are defined by and taught at the universities. Students take three university courses per semester while working 25 hours per week at Shopify throughout the four-year program. All formal assessments, grading, and final exams for university courses are carried out by the universities.Dev Degree StructureWhile the universities set the requirements for the courses, we work collaboratively to define the course sequencing to ensure the students are exposed to computer science content as early as possible in their program before they start work on team placements at Shopify.In addition to the core university courses, there are internship courses that teach software development concepts applicable to the technology industry. The universities assess the learning outcomes of the internship courses through practicum reports and meetings with university supervisors or advisors.The courses and concepts taught at Shopify build on the university courses and teach students hands-on development skills, communication skills, developer tools training, and how to contribute to a real-world product development team effectively.Developer Skills Training: Building a Strong FoundationOne of the lessons we learned early in the program was that students need a solid foundation of developer skills before being placed on development teams to feel confident and ready to contribute. The first year at Shopify sets the Dev Degree program apart from other work-integrated learning programs because we immerse the students in our Shopify-led developer skills training.In the first year, we introduce the students to skills and tools that form the foundation for how they work at Shopify and other companies. There are skills they need to develop before moving into teams, such as working with code repositories and committing code, using a command line, front-end development, working with data, and more.The breadth of technical skills that students learn in their first year in Dev Degree goes beyond the traditional university curriculum. This foundation allows students to confidently join their first placement team and have an immediate impact.We teach this way on purpose. Universities often chose a bottom-up learning model by front-loading theory and concepts. We designed our program to immerse students somewhere in the middle of top-down and bottom-up, allowing them to discover the fundamentals gradually after they develop base skills and code a bit every day.Due to the ever-evolving nature of software development, we update the developer skills training path often. Our current courses include the following technologies:Command Line Interface (CLI)VimGit & GitHubRubyHTML, CSS, JavaScriptDatabasesRuby on RailsReactTypeScriptGraphQLTeam Placements: Working on Merchant-Facing ProjectsAfter they’ve completed their developer skills training courses, students spend the next three years on team placements. This is a big deal. On team placements, students get to apply what they learn in their developer skills training at Shopify and from their university courses to meaningful, real-world software development work. Our placements are purposefully-designed to expose students to a wide range of disciplines and teams to make them well-rounded developers, give them new perspectives, and introduce them to new people.Working with their placement producer, students interview with teams from back-end, front-end, data, security, and production engineering disciplines.Over the course of the Dev Degree program, each student receives:One 12-month team placementThree 8-month team placementsFour different technical mentorsA dedicated Life@Shopify mentorTwenty hours per week working on a Shopify teamActionable feedback on a regular cadenceEvaluations from mentors and leadsHigh-touch support from the Dev Degree teamAccess to new people and workplace cultureBy the time students complete the program, they’ve been on four back-to-back team placements in their final three years at Shopify. This experience makes them a valuable asset to their future company. It also allows students to launch their careers with the confidence that they are well-prepared to make a positive contribution.It Takes a Village: Building an Impactful Program TeamCreating a successful work-integrated learning program requires a significant commitment of time and resources from a team that spans multiple disciplines and functions. While the Dev Degree program team is responsible for the bulk of the heavy-lifting, including logistics, mentorship, and support, the program doesn’t happen without expertise and time from other Shopify subject matter experts and university stakeholders.Dev Degree Program TeamThe Dev Degree team are the most actively involved in all aspects of the program and with the students from onboarding to graduation. They are responsible for ensuring that the program meets the needs of the students, the university, and Shopify.Program LeadsThe Dev Degree program leads are the liaison between Shopify and our university partners. We have a program lead to represent each partnership, and they keep this ambitious program on the rails, including working with educators to define the curriculum and developer skills training courses. They are also responsible for hiring and evaluating student performance.Student Life ProducersMany of the Dev Degree students come to Shopify straight from high school, which can be daunting. In traditional co-op programs, students have a couple of years of university experience before starting their internships and being dropped into a professional workplace setting. To ease the transition to Shopify, our student life producers are responsible for supporting students’ well-being, connecting them with other mentors, helping them learn how to become effective communicators, and being the voice of the students at Shopify. This nurturing environment helps protect first-year students from being overwhelmed and underprepared for team placements.Placement ProducersTeam placements are an integral part of the applied learning in the Dev Degree program. Placement producers are responsible for coordinating and overseeing all four 8-month placements for each cohort. This high-touch role requires extensive relationship-building with development teams and a deep understanding of the goals and interests of the students to ensure appropriate compatibility. To ensure that development teams get the return on investment (ROI) from investing in mentorship, producers place students on teams where they can be impactful. Placement producers also support the leads and mentors on the development teams and play an active role in advocating for an influential culture of mentorship within Shopify.EducatorsThe courses we teach at Shopify are foundational for students to prepare them for their team placements. Dev Degree educators have an extensive background in education and computer science and are responsible for building out the curriculum for all the developer skills training courses taught at Shopify. They design and deliver the course material and evaluate the students on technical expertise and subject knowledge. The instructors create courses for a wide range of development skills relevant to development at Shopify and other companies.Recruitment TeamAs with all recruitment at Shopify, we aim to recruit a diverse mix of students to the Dev Degree program. Our talent team is actively involved in helping us create a recruitment strategy to engage and attract top talent from a variety of schools and programs, including university meetups and mentorship in youth programs like Technovation.MentorsAfter four years of having Dev Degree students on teams across twelve disciplines, the program is woven into the Shopify culture, and mentorship plays a big role.Development Team MentorsDevelopment team mentors are critical to helping students build confidence, technical skills, and gain the experience needed to become an asset to the team. Mentors are responsible for guiding, evaluating, and providing actionable feedback to students throughout their 8-month placements. Mentorship requires a strong commitment and takes up about 10% of a developer’s time. We feel it’s worth the investment to build mentors and invest in a culture of mentorship. It’s a challenging but rewarding role, and especially helpful to developers looking to grow leadership skills and level up in their roles.Life@Shopify MentorsIn addition to placement mentors, we also have experienced Shopify employees who volunteer to mentor students as they navigate through the program, their placements, and the company on the whole. These Life@Shopify mentors act as a trusted guide and help round out the mentorship experience at Shopify.University StakeholdersClose relationships between the universities and Shopify help integrate the theory and development practices and deepen both the understanding of concepts and work experience. We’re fortunate to have both Carleton and York University as part of the Dev Degree program and fully engaged in the model that we’ve built. The faculty advisors play an active role in working with the students to guide them on their course selections, navigate the program, and evaluate their internship courses and practicums. Without university buy-in and support, a program like Dev Degree doesn’t happen.Deg Degree is Worth the InvestmentBuilding a new work-integrated learning program requires a big commitment of company time, resources, and cost, but we are reaping the benefits of our gamble.Graduates are well-rounded developers with a rich development experience across a range of teams and disciplines.88% of the 2016 cohort have been offered, and have accepted, full-time positions here at Shopify.Students who accept positions at Shopify have already built four years of relationships and have acquired vast knowledge and skills that will help them make an immediate impact on their teams.We are building future leaders through mentorship. While we are excited about how far we’ve come, we still have room to grow. We are looking at metrics and data to help us quantify the success of the program and to drive program improvements to take computer science education to a new level. When we started this ambitious endeavor, we wanted to mature it to a point where we could create a blueprint of the Dev Degree program for other companies and universities to adopt it and evolve it. There’s interest in what we’re doing here. It’s just a matter of time before we help make the Dev Degree model of computer science education the norm rather than the exception.Additional InformationDev Degree websiteLearn about contributions our graduates made:Refactoring Legacy Code with the Strangler Fig PatternRuby on Rails podcast: 313: Strangler Fig Pattern & God Objects with Adrianna Chang We're always on the lookout for talent and we’d love to hear from you. Visit our Engineering career page to find out about our open positions. Learn about the actions we’re taking as we continue to hire during COVID‑19", "posttime": "2020-05-14 01:01:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,degree,课程", "title": "开发学位：幕后", "title_en": "Dev Degree: Behind the Scenes", "transed": 1, "url": "https://engineering.shopify.com/blogs/engineering/dev-degree-behind-the-scenes", "via": "", "real_tags": ["开发", "degree", "课程"]}, {"category": "", "categoryclass": "", "imagename": "d5c8627a0f032e1d7cfd01b9840e83bc.jpg", "infoid": 1001996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EPIC在线服务现在可以使用，开发人员可以免费访问用于支持史诗游戏庞大的堡垒之夜玩家基础的相同类型的工具。周三上线的新套装支持跨多个平台的统一游戏体验，包括任天堂交换机、PlayStation、PC平台(Windows、Mac和Linux)和Xbox。它让开发人员和他们的社区可以随时访问交叉播放、交叉发展、统一配对、大堂等功能。很快就会增加对Android和iOS平台的支持。\n史诗游戏在线服务总经理克里斯·迪尔(Chris Dyl)在一份新闻稿中表示：“在史诗游戏，我们相信开放、集成的平台，相信游戏未来会成为一种高度社会化和互联的体验，”史诗游戏在线服务总经理克里斯·迪尔(Chris Dyl)在一份新闻稿中表示。通过史诗在线服务，我们努力帮助为开发者和玩家建立一个用户友好的生态系统，在这个生态系统中，无论创建者选择如何构建和发布他们的游戏，他们都可以受益，玩家可以在哪里与他们的朋友玩游戏，无论他们拥有什么硬件，都可以享受到同样高质量的体验。“。\n史诗在线服务于2018年12月首次宣布，可能是现代视频游戏的范式转变。该系统有别于索尼和微软等主要平台持有者提供的其他在线服务，同时整合了所有这些公司的信息。这意味着玩家可以访问统一的好友列表，并使用该列表在多人游戏中启动跨平台游戏会话，就像他们在堡垒之夜中可以做的那样。EPIC在线服务还支持跨平台大堂和点对点网络连接。\n此外，Etic Online Services还包括访问云保存功能，着眼于实现平台迁移。从理论上讲，玩家可以将他们的成就从一个游戏机带到另一个游戏机上，而不需要从头开始。同样的功能也可以应用于在游戏中购买的物品。\n并不是史诗在线服务的所有功能都可以在选择使用该系统的所有游戏中使用。EPIC表示，开发者在开发游戏时可以自由选择许多不同的功能。\n周三的公告中没有语音聊天等额外的生活质量功能。EPIC此前表示，预计2019年将提供这些和其他功能。", "note_en": "Epic Online Services is now available, giving developers free access to the same kinds of tools used to support Epic Games’ massive   Fortnite player base. The new suite, which went live on Wednesday, enables a unified gameplay experience across multiple platforms, including Nintendo Switch, PlayStation, PC platforms (Windows, Mac, and Linux), and Xbox. It gives developers and their communities ready access to features like cross-play, cross-progression, unified matchmaking, lobbies, and more. Support for Android and iOS platforms will be added soon.\n “At Epic, we believe in open, integrated platforms and in the future of gaming being a highly social and connected experience,” said Chris Dyl, general manager of online services at Epic Games, in a news release. “Through Epic Online Services, we strive to help build a user-friendly ecosystem for both developers and players, where creators can benefit regardless of how they choose to build and publish their games, and where players can play games with their friends and enjoy the same quality experience regardless of the hardware they own.”\n  First announced  in December 2018, Epic Online Services could be a paradigm shift for modern video gaming. The system stands apart from other online services provided by major platform holders like Sony and Microsoft, while integrating information from all of them. This means players could have access to a unified friends list, and use that list to launch cross-platform play sessions in multiplayer games just like they can in   Fortnite. Epic Online Services also supports cross-platform lobbies and peer-to-peer network connectivity.\n Additionally, Epic Online Services includes access to cloud save functionality with an eye toward enabling platform migration. Theoretically, players could take their achievements and unlocks from one game console to another without needing to start over from scratch. The same functionality can also be applied to items purchased in-game.\n Not every feature of Epic Online Services will be available in all games that choose to use the system. Epic said developers are free to pick and choose from many different features when developing games.\n Additional quality-of-life features, such as voice chat, are absent from Wednesday’s announcement. Epic previously said to expect these and other features  in 2019.", "posttime": "2020-05-14 00:47:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,cross", "title": "史诗在线服务推出，让其他游戏可以访问堡垒之夜风格的交叉游戏等", "title_en": "Epic Online Services Launches, Giving Other Games Access To Fortnite-style Cross-play and More", "transed": 1, "url": "https://www.polygon.com/2020/5/13/21257211/epic-online-services-fortnite-cross-play-cloud-saves-friends-list", "via": "", "real_tags": ["游戏", "cross"]}]