[{"category": "", "categoryclass": "", "imagename": "0ae489867426ac1ee455cb890aea6a7c.jpg", "infoid": 1016355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Chrome85中推出的content-visibility属性可能是提高页面加载性能的最有效的新CSS属性之一。内容可见性使用户代理可以跳过元素的渲染工作，包括布局和绘画，直到需要为止。因为会跳过呈现，所以如果很大一部分内容在屏幕外，则利用Content-Visibility属性可以更快地加载初始用户。它还允许与屏幕上的内容进行更快的交互。相当整洁。\n内容可见性依赖于CSS ContainmentSpec中的原语。虽然目前只有Chrome85支持内容可见性(对于Firefox来说，这也被认为是值得进行原型开发的)，但大多数现代浏览器都支持包容规范(Containment Spec)。\nCSS包容的关键和总体目标是通过提供可预测的DOM子树与页面其余部分的隔离来提高Web内容的渲染性能。\n基本上，开发人员可以告诉浏览器页面的哪些部分被封装为一组内容，从而允许浏览器对内容进行推理，而无需考虑子树之外的状态。知道哪些内容位(子树)包含隔离内容意味着浏览器可以为页面呈现做出优化决策。\nCSS包含有四种类型，每种类型都是CONTAIN CSS属性的潜在值，它们可以组合在一个空格分隔的值列表中：\n大小：元素上的大小限制确保该元素的框可以在不需要检查其后代的情况下被取出。这意味着如果我们只需要元素的大小，我们可能会跳过后代的布局。\n布局：布局包容是指后代不影响页面上其他框的外部布局。这允许我们潜在地跳过子代的播放，如果我们只想布局其他框的话。\n样式：样式包含确保不仅影响其后代的属性不会转义元素(例如计数器)。这允许我们潜在地跳过子代的样式计算，如果所有我们想要的都是计算其他元素的样式。\n油漆：油漆容器确保包含盒子的后代不会显示在其边界之外。任何东西都不能明显地溢出元素，如果元素在屏幕外或以其他方式不可见，那么它的子代也将不可见。这样，如果元素在屏幕外，我们可能会跳过绘制后代。\n可能很难确定使用哪些包含值，因为浏览器优化可能只有在指定适当的集合时才会生效。您可以使用这些值来查看哪种方法效果最好，或者可以使用另一个名为Content-Visibility的CSS属性自动应用nesidedcontainment。内容可见性确保您作为开发人员以最少的努力获得浏览器所能提供的最大性能收益。\nContent-Visibility属性接受多个值，但AUTO是提供即时性能改进的一个。具有内容可见性的元素：自动获得布局、样式和绘画包容度。如果元素在屏幕外(否则与用户相关的元素是那些在其子树中有焦点或选择的元素)，它也会获得大小控制(并且停止绘制和命中测试其内容)。\n这是什么意思？简而言之，如果元素在屏幕外，则不会呈现其后代。浏览器在不考虑元素的任何内容的情况下确定元素的大小，到此为止。大多数呈现，比如元素的子树的样式和布局，都会被跳过。\n当元素接近视口时，浏览器不再添加大小娱乐，并开始绘制和点击测试元素的内容。这使得渲染工作可以及时完成，用户可以看到。\n旅游博客通常包含一组带有几张图片和一些描述性文字的故事。以下是一个典型的浏览器在导航到旅游博客时会发生的情况：\n浏览器设置页面所有内容的样式和布局，而不考虑内容是否对用户可见。\n浏览器返回到步骤1，直到下载完所有页面和资源。\n在步骤2中，浏览器处理所有内容，查找可能已更改的内容。它会更新任何新元素的样式和布局，以及可能因新更新而改变的元素。这是渲染工作。这需要时间。\n现在考虑一下，如果在博客中的每个单独的故事上放置content-visibility：auto，会发生什么情况。一般循环是相同的：浏览器下载并呈现页面的大块。但是，不同之处在于它在步骤2中所做的工作量。\n有了内容可见性，它将对用户当前可见的所有内容(它们在屏幕上)设置样式并进行布局。但是，当处理完全在屏幕外的文章时，浏览器将跳过渲染工作，仅对元素框本身进行样式和布局。\n加载此页面的性能就像它包含完整的屏幕上故事和每个屏幕外故事的空框一样。这样的性能要好得多，预计可以从加载的渲染成本中降低50%或更多。在我们的示例中，我们看到渲染时间从232ms提高到30ms。这使性能提升了7倍。\n您需要做什么工作才能获得这些好处？首先，我们将内容分成几个部分：\n请注意，当内容移入和移出可见性时，它将根据需要开始呈现和停止呈现。然而，这并不意味着浏览器将不得不一遍又一遍地呈现相同的内容，因为在可能的情况下会保存呈现工作。\n为了实现内容可见性的潜在好处，浏览器需要应用大小控制，以确保内容的呈现结果不会以任何方式影响元素的大小。这意味着元素的布局将好像是空的。如果元素没有在常规块布局中指定的高度，则它的高度将为0。\n这可能并不理想，因为滚动条的大小会发生变化，这依赖于每个具有非零高度的故事。\n值得庆幸的是，CSS提供了另一个属性，CONTAIN-INTERNAL-SIZE，如果元素受到大小控制的影响，它可以有效地指定元素的自然大小。在我们的示例中，我们将其设置为1000px作为截面高度和宽度的估计值。\n这意味着它的布局就像它只有一个固有尺寸的子项，确保您的未调整大小的div仍然占用空间。CONTAINE-INTERNAL-SIZE用作占位符大小，而不是呈现内容。\n如果您希望保持内容不呈现，而不管内容是否显示在屏幕上，同时利用缓存呈现状态的好处，该怎么办呢？输入：内容-可见性：隐藏。\nContent-Visibility：Hidden属性为您提供了与Content-Visibility：auto在屏幕外提供的所有未呈现内容和缓存呈现状态相同的好处。不过，与AUTO不同的是，它不会在屏幕上自动启动Torender。\n这给了您更多的控制权，允许您隐藏元素的内容，并在以后快速将其取消隐藏。\nDISPLAY：NONE：隐藏元素并破坏其呈现状态。这意味着取消隐藏元素的代价与使用相同内容呈现新元素的代价一样高。\n可见性：隐藏：隐藏元素并保持其呈现状态。这并不能真正从文档中删除该元素，因为它(以及它的子树)仍然占据页面上的几何空间，并且仍然可以点击。它还会在需要时随时更新渲染状态，甚至在隐藏时也是如此。\nContent-Visibility：另一方面，Hidden在保留元素呈现状态的同时隐藏元素，因此，如果需要进行任何更改，它们仅在元素再次显示时才会发生(即，Content-Visibility：Hidden属性被移除)。\n内容可见性：隐藏的一些很好的用例是在实现高级虚拟滚动和测量布局时。\n内容可见性和CSS包含规范意味着一些令人兴奋的性能提升将直接应用到您的CSS文件中。有关这些属性的更多信息，请查看：", "note_en": "The  content-visibilityproperty, launching in Chromium 85, might be one of the most impactful new CSSproperties for improving page load performance.  content-visibility enables theuser agent to skip an element&#39;s rendering work, including layout and painting,until it is needed. Because rendering is skipped, if a large portion of yourcontent is off-screen, leveraging the  content-visibility property makes theinitial user load much faster. It also allows for faster interactions with theon-screen content. Pretty neat.\n   content-visibility relies on primitives within the  the CSS ContainmentSpec. While  content-visibility is onlysupported in Chromium 85 for now (and deemed  &#34;worthprototyping&#34; forFirefox), the Containment Spec is supported in  most modernbrowsers.\n  The key and overarching goal of CSS containment is to enable renderingperformance improvements of web content by providing  predictable isolation ofa DOM subtree from the rest of the page.\n Basically a developer can tell a browser what parts of the page are encapsulatedas a set of content, allowing the browsers to reason about the content withoutneeding to consider state outside of the subtree. Knowing which bits of content(subtrees) contain isolated content means the browser can make optimizationdecisions for page rendering.\n There are four types of  CSScontainment,each a potential value for the  contain CSS property, which can be combinedtogether in a space-separated list of values:\n size: Size containment on an element ensures that the element&#39;s box can belaid out without needing to examine its descendants. This means we canpotentially skip layout of the descendants if all we need is the size of theelement.\n layout: Layout containment means that the descendants do not affect theexternal layout of other boxes on the page. This allows us to potentially skiplayout of the descendants if all we want to do is lay out other boxes.\n style: Style containment ensures that properties which can have effects onmore than just its descendants don&#39;t escape the element (e.g. counters). Thisallows us to potentially skip style computation for the descendants if all wewant is to compute styles on other elements.\n paint: Paint containment ensures that the descendants of the containing boxdon&#39;t display outside its bounds. Nothing can visibly overflow the element,and if an element is off-screen or otherwise not visible, its descendants willalso not be visible. This allows us to potentially skip painting thedescendants if the element is offscreen.\n  It may be hard to figure out which containment values to use, since browseroptimizations may only kick in when an appropriate set is specified. You canplay around with the values to see  what worksbest, or youcan use another CSS property called  content-visibility to apply the neededcontainment automatically.  content-visibility ensures that you get the largestperformance gains the browser can provide with minimal effort from you as adeveloper.\n The content-visibility property accepts several values, but  auto is the onethat provides immediate performance improvements. An element that has content-visibility: auto gains  layout,  style and  paint containment. Ifthe element is off-screen (and not otherwise relevant to the user—relevantelements would be the ones that have focus or selection in their subtree), italso gains  size containment (and it stops paintingand hit-testingits contents).\n What does this mean? In short, if the element is off-screen its descendants arenot rendered. The browser determines the size of the element without consideringany of its contents, and it stops there. Most of the rendering, such as stylingand layout of the element&#39;s subtree are skipped.\n As the element approaches the viewport, the browser no longer adds the  sizecontainment and starts painting and hit-testing the element&#39;s content. Thisenables the rendering work to be done just in time to be seen by the user.\n   A travel blog typically contains a set of stories with a few pictures, and somedescriptive text. Here is what happens in a typical browser when it navigates toa travel blog:\n The browser styles and lays out all of the contents of the page, withoutconsidering if the content is visible to the user.\n The browser goes back to step 1 until all of the page and resources aredownloaded.\n In step 2, the browser processes all of the contents looking for things that mayhave changed. It updates the style and layout of any new elements, along withthe elements that may have shifted as a result of new updates. This is renderingwork. This takes time.\n  Now consider what happens if you put  content-visibility: auto on each of theindividual stories in the blog. The general loop is the same: the browserdownloads and renders chunks of the page. However, the difference is in theamount of work that it does in step 2.\n With content-visibility, it will style and layout all of the contents that arecurrently visible to the user (they are on-screen). However, when processing thestory that is fully off-screen, the browser will skip the rendering work andonly style and layout the element box itself.\n The performance of loading this page would be as if it contained full on-screenstories and empty boxes for each of the off-screen stories. This performs muchbetter, with  expected reduction of 50% or more from the rendering cost ofloading. In our example, we see a boost from a  232ms rendering time to a 30ms rendering time. That&#39;s a  7x performance boost.\n What is the work that you need to do in order to reap these benefits? First, wechunk the content into sections:\n     Note that as content moves in and out of visibility, it will startand stop being rendered as needed. However, this does not mean that the browserwill have to render and re-render the same content over and over again, sincethe rendering work is saved when possible.\n  In order to realize the potential benefits of  content-visibility, the browserneeds to apply size containment to ensure that the rendering results of contentsdo not affect the size of the element in any way. This means that the elementwill lay out as if it was empty. If the element does not have a height specifiedin a regular block layout, then it will be of 0 height.\n This might not be ideal, since the size of the scrollbar will shift, beingreliant on each story having a non-zero height.\n Thankfully, CSS provides another property,  contain-intrinsic-size, whicheffectively specifies the natural size of the element  if the element isaffected by size containment. In our example, we are setting it to  1000px asan estimate for the height and width of the sections.\n This means it will lay out as if it had a single child of &#34;intrinsic-size&#34;dimensions, ensuring that your unsized divs still occupy space. contain-intrinsic-size acts as a placeholder size in lieu of rendered content.\n  What if you want to keep the content unrendered regardless of whether or not itis on-screen, while leveraging the benefits of cached rendering state? Enter: content-visibility: hidden.\n The  content-visibility: hidden property gives you all of the same benefits ofunrendered content and cached rendering state as  content-visibility: auto doesoff-screen. However, unlike with  auto, it does not automatically start torender on-screen.\n This gives you more control, allowing you to hide an element&#39;s contents andlater unhide them quickly.\n  display: none: hides the element and destroys its rendering state. Thismeans unhiding the element is as expensive as rendering a new element with thesame contents.\n visibility: hidden: hides the element and keeps its rendering state. Thisdoesn&#39;t truly remove the element from the document, as it (and it&#39;s subtree)still takes up geometric space on the page and can still be clicked on. Italso updates the rendering state any time it is needed even when hidden.\n content-visibility: hidden, on the other hand, hides the element whilepreserving its rendering state, so, if there are any changes that need tohappen, they only happen when the element is shown again (i.e. the content-visibility: hidden property is removed).\n Some great use cases for  content-visibility: hidden are when implementingadvanced virtual scrollers, and measuring layout.\n  content-visibility and the CSS Containment Spec mean some exciting performanceboosts are coming right to your CSS file. For more information on theseproperties, check out:", "posttime": "2020-08-05 15:45:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "visibility,元素", "title": "`content-visibility`：增强呈现效果的新CSS属性", "title_en": "`content-visibility`: the new CSS property that boosts your rendering", "transed": 1, "url": "https://web.dev/content-visibility/", "via": "", "real_tags": ["元素"]}, {"category": "", "categoryclass": "", "imagename": "f4b0c3ed07fdaa4cbba742f14606fbcc.jpg", "infoid": 1016354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "暴动游戏公司，英雄联盟和Valorant的开发商，将在8月10日给员工一周的假期来“断开连接，充电，并重新启动”，该公司在周二发布的一篇博客文章中宣布。\nRiot最近超越了其全球大热英雄联盟，包括发布了汽车格斗机手团队格斗战术、类似炉石的纸牌游戏“亡灵传奇”(这两款游戏都以英雄联盟为背景)，以及受到“反击：全球进攻”和“守望”启发的全新战术射击游戏“Valorant”。但在一个以超负荷工作和强制加班(被称为“Crash”)来运送和维护游戏的行业中，Riot正在给员工一个休息时间，以帮助他们的健康。\n“作为游戏开发者，我们都非常清楚紧缩的影响。”\nRiot在其博客中说：“作为游戏开发者，我们都非常清楚紧要关头和基于项目的最后期限的影响。”“我们应该把我们的健康作为一个团队(嗯，很多团队)放在首位，这样我们才能在未来很长一段时间里给你们带来新的体验，这是我们对自己和你们的责任。”Riot还表示，将“稍微移动一些补丁和发布时间表”，以适应休息时间，并表示“一些团队也在错开休假时间，以确保一切顺利运行。”\n其他开发商也以不同的方式应对危机，近年来，许多制片厂在应对倦怠措施方面变得更加透明，这在很大程度上要归功于媒体对游戏开发商工作条件的报道，以及行业推动成立工会的努力。\nEPIC Games在2019年6月至7月期间给员工提供了两周的假期，此前一份Polygon报告详细描述了数月来为支持人气极高的堡垒之夜而进行的紧张工作。据Wral TechWire报道，EPIC过去也曾在圣诞节前后给员工两周的假期。史诗游戏员工杰伊·霍斯费尔特在2019年6月的一条推文中表示，公司“夏季关闭工作室2周，冬季关闭2周”。\n艺电旗下的Respawn工作室表示，2019年4月，就在Polygon关于史诗游戏的报告发布一天后，它不会匆忙更新自己的热门皇家战斗射击游戏Apex Legends，以帮助“避免崩溃”。\nRiot已经采取了一系列措施来改善其公司文化，该公司文化过去曾因一些员工涉嫌的性别歧视行为和未能解决一再滥用行为的有毒管理层而受到审查。2019年12月，该公司与现任和前任女员工以1000万美元达成和解，起诉Riot基于性别的歧视和性骚扰。", "note_en": "Riot Games, the developer of  League of Legends and  Valorant, will be giving employees the week of August 10th off to “disconnect, recharge, and reboot,” the studio announced in a blog post  published Tuesday.\n Riot has recently expanded beyond its global smash hit  League of Legends, including releasing auto battler  Teamfight Tactics,  Hearthstone-like card game  Legends of Runeterra (which are both set in the  League of Legends universe), and  Valorant, a brand-new tactical shooter that takes cues from  Counter Strike: Global Offensive and  Overwatch. But in an industry known for overwork and enforced overtime, referred to as “crunch,” to ship and maintain games, Riot is giving employees a break to help with their health.\n “As game developers, we’re all hyper aware of the effects of crunch”\n “As game developers, we’re all hyper aware of the effects of crunch and project-based deadlines,” Riot said in its blog. “We owe it to ourselves and to you to prioritize our health as a team (well, many teams) so we can bring you new experiences long into the future.” Riot also said it would be “shifting some patches and release timelines a bit” to accommodate the break and that “a few teams are also staggering their time off to make sure everything is running smoothly.”\n Other developers have dealt with crunch in different ways, and many studios have become more transparent in recent years about measures to combat burnout thanks in large part to  media reports on game developer working conditions and  industry pushes for unionization.\n Epic Games  gave employees a two-week vacation between June and July of 2019 following a   Polygon report detailing months of intense crunch to support the massively popular  Fortnite. Epic has also given staff a two-week break around Christmas in the past, according  WRAL  TechWire. And Epic Games employee Jay Hosfelt said the company “shuts the studio down for 2 weeks in the summer and two in the winter,”  in a June 2019 tweet.\n EA-owned studio Respawn said it wouldn’t rush updates to its own hit battle royale shooter,  Apex Legends, to help “avoid crunch”  in April 2019, just a day after  Polygon’s report about Epic Games was published.\n Riot has taken  a number  of steps to improve its company culture, which has come under scrutiny in the past for  alleged sexist behavior from some employees and toxic management that failed to address repeated abuses. The studio settled with current and former female employees for $10 million  in December 2019 in a lawsuit that accused Riot of gender-based discrimination and sexual harassment.", "posttime": "2020-08-05 15:20:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "games,游戏", "title": "Riot Games通过给员工放假一周来解决工作倦怠和嘎吱作响问题", "title_en": "Riot Games Addresses Burnout and Crunch By Giving Employees a Week Off", "transed": 1, "url": "https://www.theverge.com/2020/8/4/21354553/riot-games-burnout-crunch-employees-week-time-off", "via": "", "real_tags": ["games", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Intellipaat人工智能课程在线认证使用TensorFlow是一个行业认可的认证培训计划，可帮助您掌握卷积神经网络(CNN)、CNN中的感知器、TensorFlow、TensorFlow代码、转移学习、图形可视化、递归神经网络(RNN)、深度学习库、深度学习中的GPU、KERAS和TFL学习API、反向传播和超参数。因此，通过使用TensorFlow在线报名最好的人工智能课程来学习AI，成为一名成功的人工智能工程师！\nIntellipaat提供全面的人工智能计划，将帮助您研究当今尖端技术人工智能(AI)。作为这一最佳人工智能培训的一部分，您将掌握人工神经网络的各个方面、有监督和无监督学习、具有神经网络思维模式的逻辑回归、二进制分类、矢量化、用于编写机器学习应用脚本的Python等等。\n这门课程的主要目标是让你熟悉AI的方方面面，这样你就可以开始你的人工智能工程师职业生涯了。您将在本计划中学习的众多主题/模块中，有几个是：\n任何人都可以参加这门在线课程，成为一名成功的机器学习工程师或人工智能工程师，而不考虑他们之前的知识。\n如今，人工智能几乎征服了所有行业。在一两年内，近80%的新兴技术将基于AI。机器学习，特别是深度学习，是人工智能最重要的方面，它被用于人工智能支持的推荐系统(聊天机器人)和搜索引擎，用于在线电影推荐。因此，为了保持与这一新兴技术的相关性并获得专业知识，请注册Intellipaat的AI课程。\n这将帮助您建立坚实的AI职业生涯，并在领先的组织中获得最好的人工智能工程师职位。\n1.1机器学习领域，它对人工智能领域的影响1.2机器学习的好处。传统方法1.3深度学习介绍及其与所有其他机器学习方法的不同之处1.4监督学习中的分类和回归1.5非监督学习中的聚类和关联，这些类别中使用的算法1.6人工智能和神经网络简介1.7机器学习概念1.8使用神经网络的监督学习1.9统计学、假设检验、概率分布和隐马尔可夫模型的基础。\n2.1多层网络简介、正则化、深度神经网络2.2多层感知器2.3过拟合和容量2.4神经网络双参数、逻辑门2.5神经网络中使用的不同激活函数，包括RELU、Softmax、Sigmoid和双曲线函数2.6反向传播、前向传播、收敛、超参数和过拟合。\n3.1用于训练人工神经网络的各种方法3.2感知器学习规则、梯度下降规则、调整学习率、正则化技术、优化技术3.3随机过程、消失梯度、转移学习、回归技术、3.4套索L1和脊L2、无监督预训练、Xavier初始化。\n4.1了解深度学习是如何工作的4.2激活函数，说明感知器，感知器培训4.3多层感知器，感知器的关键参数；4.4 TensorFlow简介及其开源软件库，用于设计、创建和培训4.5深度学习模型，随后是Google的张量处理单元(TPU)可编程的AI4.6在TensorFlow中的Python库，代码基础，变量，常量，占位符4.7图形可视化，用例实现，Keras，等等。\n5.1 KERAS高级神经网络，在TensorFlow 5.2上工作，定义复杂的多输出模型5.3使用KERAS 5.3顺序和功能组合组成模型，批次标准化5.4使用张力板部署KERAS，以及神经网络训练过程定制。\n6.1使用tfLearning API实现神经网络6.2定义和合成模型，部署张力板。\n7.1用深度神经网络(DNN)绘制人脑图7.2人工神经网络(ANN)的几个构建块7.3 DNN的体系结构及其构建块7.4 DNN概念中的强化学习、DNN中的各种参数、层和优化算法，以及激活函数。\n8.1什么是卷积神经网络？8.2了解CNN 8.3的体系结构和用例：“什么是池层？”如何使用CNN 8.4可视化如何微调卷积神经网络8.5什么是转移学习？8.6了解递归神经网络、内核过滤器、特征映射和汇集，并在TensorFlow中部署卷积神经网络。\n9.1介绍RNN模型9.2使用案例，建模序列9.3 RNN与反向传播9.4长短期记忆(LSTM)9.5递归神经张量网络理论，基本RNN细胞，展开RNN，动态RNN 9.6时间序列预测。\n10.1 GPU的介绍，“它们与CPU有什么不同？”，GPU的意义10.2深度学习网络，前向传递和后向传递训练技术10.3GPU组成，具有更简单的内核和并发硬件。\n11.1 RBM和自动编码器简介11.2为深度神经网络部署RBM，使用RBM进行协作过滤11.3自动编码器的功能和应用。\n13.1利用以下任何描述技术的自动对话机器人：IBM Watson、Microsoft的Luis、开放-闭合域机器人、13.2生成模型和Sequence to Sequence模型(LSTM)。\n问题陈述：正在创建深度学习模型，根据用户对相应图像的搜索来识别互联网上的正确对象。\n描述：在本项目中，您将学习如何使用Google TensorFlow构建卷积神经网络。您将使用培训进行图像可视化，提供输入图像、损失以及激活和渐变的分布。您将学习如何将每个图像拆分成可管理的块，并将它们输入卷积神经网络以获得所需的结果。\n描述：在这个项目中，通过了解客户需求，您将能够通过人工智能聊天机器人提供正确的服务。您将学习如何创建具有适当层数的正确人工神经网络，以确保人工智能聊天机器人可以理解客户查询。这将帮助您了解自然语言处理，超越关键字、数据解析，并提供正确的解决方案。\n描述：该项目涉及与推荐系统合作，通过TensorFlow向客户提供正确的产品推荐。你将学习如何使用人工智能来检查用户过去的购买习惯，找出齐头并进的产品，并推荐可以与特定产品一起购买的最佳产品。\n这门AI课程的全部内容都是由领先的AI专业人士开发的，帮助您在顶级跨国公司找到最好的人工智能工程工作。在认证培训期间，您将参与真实世界的项目，这些项目将帮助评估您在实时业务场景中的技能和学习，从而帮助您毫不费力地加速您的职业生涯。\n本次人工智能在线课程完成后，将有反映认证考试题型的小测验，帮助您获得更好的分数。\nIntellipaat课程结业证书将在完成项目工作(专家评审之后)并在测验中获得至少60%的分数时颁发。Intellipaat认证在爱立信、思科、Cognizant、索尼、Mu Sigma、圣戈班、渣打、TCS、Genpact、Hexware等80多家跨国公司中得到了很好的认可。\n我们的人工智能在线培训涉及在线环境中学习者和教师的同时参与。作为一名学习者，您可以从任何地方登录到我们的应用AI课程课程，无需亲自到场上课。此外，我们还记录所有AI课程的过程，并为您配备这些课程，以进一步增强您的学习过程。在线完成此次AI培训后，您的体验将相当于在行业工作6个月的专业人士的体验。\n在Intellipaat，您可以报名参加讲师指导的在线培训或自定进度的培训。除此之外，Intellipaat还为组织提供企业培训，以提高其员工的技能。Intellipaat的所有培训人员都有12年以上的相关行业经验，他们一直积极担任同一领域的顾问，这使他们成为主题专家。浏览样本视频，检查我们培训师的质量。\nIntellipaat提供全天候查询解决方案，您可以随时与专门的支持团队联系。您可以利用电子邮件支持您的所有查询。如果您的问题没有通过电子邮件得到解决，我们还可以安排与我们的培训人员进行一对一的培训。\n您将很高兴知道，即使在完成培训后，您也可以联系Intellipaat支持部门。我们也没有限制您可以为解决问题和清除疑问而筹集的罚单数量。\nIntellipaat为那些想要按照自己的节奏学习的人提供自定进度的培训。此培训还为您带来了通过电子邮件解决查询、与培训师进行现场会议、全天候支持以及终身访问LMS上的学习模块的好处。此外，您还可以免费获得最新版本的课程材料。\n与在线讲师指导的培训相比，Intellipaat的自定进度培训的价格低75%。如果您在学习过程中遇到任何问题，我们也可以与培训师一起安排虚拟直播课程。\n作为培训计划的一部分，Intellipaat将为您提供最新的、相关的和高价值的真实世界项目。这样，您就可以实现在真实的行业设置中学到的知识。所有培训都有多个项目，可以彻底测试您的技能、学习和实践知识，使您完全为行业做好准备。\n你将在高科技，电子商务，市场营销，销售，网络，银行，保险等领域从事非常令人兴奋的项目。成功完成这些项目后，你的技能将相当于6个月的严格行业经验。\nIntellipaat积极为所有成功完成培训的学员提供安置帮助。为此，我们与来自世界各地的80多家顶级跨国公司进行了独家合作。这样，你就可以在索尼、爱立信、塔塔咨询公司、Mu Sigma、渣打银行、Cognizant和思科等其他同样伟大的企业中被安排到优秀的组织中工作。我们还帮助您进行面试和准备简历。\n你只需支付额外的费用，就可以从自定进度的培训切换到在线讲师指导的培训。您可以参加下一批，我们会及时通知您的。\n一旦您完成Intellipaat的培训计划，从事真实世界的项目、测验和作业，并在资格考试中获得至少60%的分数，您将获得Intellipaat的课程结业证书。该证书在Intellipaat的附属组织中得到了很好的认可，包括来自世界各地的80多家顶级跨国公司和一些财富500强公司。\n显然，没有。我们的就业援助计划旨在帮助您找到理想的工作。它为你提供了一个潜在的机会，让你探索企业界各种竞争激烈的职位，并找到一份与你的个人资料相匹配的高薪工作。招聘的最终决定总是基于你在面试中的表现和招聘人员的要求。", "note_en": "Intellipaat Artificial Intelligence course online certification using TensorFlow is an industry-recognized certification training program to help you master convolutional neural networks (CNN), perceptron in CNN, TensorFlow, TensorFlow code, transfer learning, graph visualization, recurrent neural networks (RNN), Deep Learning libraries, GPU in Deep Learning, Keras and TFLearn APIs, backpropagation, and hyperparameters via hands-on projects. Therefore, learn AI by enrolling in the best Artificial Intelligence course online using TensorFlow and become a successful Artificial Intelligence Engineer!\n   Intellipaat offers a comprehensive Artificial Intelligence program that will help you work on today cutting-edge technology Artificial Intelligence (AI). As part of this best AI training, you will master various aspects of artificial neural networks, supervised and unsupervised learning, logistic regression with a neural network mindset, binary classification, vectorization, Python for scripting Machine Learning applications, and much more.\n The main goal of this course is to familiarize you with all aspects of AI so that you can start your career as an artificial intelligence engineer. A few of the many topics/modules that you will learn in the program are:\n  Anyone can take this online course and be a successful machine learning engineer or AI engineer regardless of their previous knowledge.\n Today, Artificial Intelligence has conquered almost every industry. Within a year or two, nearly 80% of emerging technologies will be based on AI. Machine Learning, especially Deep Learning, which is the most important aspect of Artificial intelligence, is used from AI-powered recommender systems (Chatbots) and Search engines for online movie recommendations. Therefore, to remain relevant and gain expertise in this emerging technology, enroll in Intellipaat’s AI Course.\n This will help you build a solid AI career and get the best artificial intelligence engineer positions in leading organizations.\n  1.1 Field of machine learning, its impact on the field of artificial intelligence  1.2 The benefits of machine learning w.r.t. Traditional methodologies  1.3 Deep learning introduction and how it is different from all other machine learning methods  1.4 Classification and regression in supervised learning  1.5 Clustering and association in unsupervised learning, algorithms that are used in these categories  1.6 Introduction to ai and neural networks  1.7 Machine learning concepts  1.8 Supervised learning with neural networks  1.9 Fundamentals of statistics, hypothesis testing, probability distributions, and hidden markov models.\n 2.1 Multi-layer network introduction, regularization, deep neural networks  2.2 Multi-layer perceptron  2.3 Overfitting and capacity  2.4 Neural network hyperparameters, logic gates  2.5 Different activation functions used in neural networks, including relu, softmax, sigmoid and hyperbolic functions  2.6 Back propagation, forward propagation, convergence, hyperparameters, and overfitting.\n 3.1 Various methods that are used to train artificial neural networks  3.2 Perceptron learning rule, gradient descent rule, tuning the learning rate, regularization techniques, optimization techniques  3.3 Stochastic process, vanishing gradients, transfer learning, regression techniques,  3.4 Lasso l1 and ridge l2, unsupervised pre-training, xavier initialization.\n 4.1 Understanding how deep learning works  4.2 Activation functions, illustrating perceptron, perceptron training  4.3 multi-layer perceptron, key parameters of perceptron;  4.4 Tensorflow introduction and its open-source software library that is used to design, create and train  4.5 Deep learning models followed by google’s tensor processing unit (tpu) programmable ai  4.6 Python libraries in tensorflow, code basics, variables, constants, placeholders  4.7 Graph visualization, use-case implementation, keras, and more.\n 5.1 Keras high-level neural network for working on top of tensorflow  5.2 Defining complex multi-output models  5.3 Composing models using keras  5.3 Sequential and functional composition, batch normalization  5.4 Deploying keras with tensorboard, and neural network training process customization.\n 6.1 Using tflearn api to implement neural networks  6.2 Defining and composing models, and deploying tensorboard\n 7.1 Mapping the human mind with deep neural networks (dnns)  7.2 Several building blocks of artificial neural networks (anns)  7.3 The architecture of dnn and its building blocks  7.4 Reinforcement learning in dnn concepts, various parameters, layers, and optimization algorithms in dnn, and activation functions.\n 8.1 What is a convolutional neural network?  8.2 Understanding the architecture and use-cases of cnn  8.3‘What is a pooling layer?’ how to visualize using cnn  8.4 How to fine-tune a convolutional neural network  8.5 What is transfer learning?  8.6 Understanding recurrent neural networks, kernel filter, feature maps, and pooling, and deploying convolutional neural networks in tensorflow.\n 9.1 Introduction to the rnn model  9.2 Use cases of rnn, modeling sequences  9.3 Rnns with back propagation  9.4 Long short-term memory (lstm)  9.5 Recursive neural tensor network theory, the basic rnn cell, unfolded rnn,  dynamic rnn  9.6 Time-series predictions.\n 10.1 Gpu’s introduction, ‘how are they different from cpus?,’ the significance of gpus  10.2 Deep learning networks, forward pass and backward pass training techniques  10.3 Gpu constituent with simpler core and concurrent hardware.\n 11.1 Introduction  rbm and autoencoders  11.2 Deploying rbm for deep neural networks, using rbm for collaborative filtering  11.3 Autoencoders features and applications of autoencoders.\n  13.1 Automated conversation bots leveraging any of the following descriptive techniques:  Ibm watson, Microsoft’s luis, Open–closed domain bots,  13.2 Generative model, and the sequence to sequence model (lstm).\n Problem Statement: Creating a Deep Learning model to identify the right object on the Internet as per the user search for the corresponding image\n Description: In this project, you will learn how to build a convolutional neural network using Google TensorFlow. You will do the visualization of images using training, providing input images, losses, and distributions of activations and gradients. You will learn to break each image into manageable tiles and input them to the convolutional neural network for the desired result.\n      Description: In this project, by understanding the customer needs, you will be able to offer the right services through Artificial Intelligence chatbots. You will learn how to create the right artificial neural network with the right amount of layers to ensure that the customer queries are comprehensible to the Artificial Intelligence chatbot. This will help you understand Natural Language Processing, going beyond keywords, data parsing, and providing the right solutions.\n      Description: This project involves working with recommender systems to provide the right product recommendation to customers with TensorFlow. You will learn how to use Artificial Intelligence to check for users’ past buying habits, find out the products that go hand-in-hand, and recommend the best products that can be bought together with a particular product.\n The entire content of this AI course is developed by leading AI professionals to help you find the best artificial intelligence engineering job at the top MNCs. During the certification training, you will work on real-world projects that will help evaluate your skills and learning in real-time business scenarios, thus helping you accelerate your career effortlessly.\n Upon the completion of this artificial intelligence online course, there will be quizzes that reflect the type of questions asked in the certification examination and will help you score better.\n Intellipaat Course Completion Certification will be awarded on the completion of the project work (after the expert review) and upon scoring at least 60 percent marks in the quiz. Intellipaat certification is well recognized in top 80+ MNCs like Ericsson, Cisco, Cognizant, Sony, Mu Sigma, Saint-Gobain, Standard Chartered, TCS, Genpact, Hexaware, etc.\n   Our Artificial Intelligence online training involves the simultaneous participation of both learners and instructors in an online environment. Being a learner, you can log in to our applied AI course sessions from anywhere and attend the class without having to be present physically. Also, we record the proceedings of all AI classes and equip you with them to further enhance your learning process. On the completion of this AI training online, your experience will be equivalent to that of a professional who has worked for 6 months in the industry.\n At Intellipaat, you can enroll in either the instructor-led online training or self-paced training. Apart from this, Intellipaat also offers corporate training for organizations to upskill their workforce. All trainers at Intellipaat have 12+ years of relevant industry experience, and they have been actively working as consultants in the same domain, which has made them subject matter experts. Go through the sample videos to check the quality of our trainers.\n Intellipaat is offering the 24/7 query resolution, and you can raise a ticket with the dedicated support team at anytime. You can avail of the email support for all your queries. If your query does not get resolved through email, we can also arrange one-on-one sessions with our trainers.\n You would be glad to know that you can contact Intellipaat support even after the completion of the training. We also do not put a limit on the number of tickets you can raise for query resolution and doubt clearance.\n Intellipaat offers self-paced training to those who want to learn at their own pace. This training also gives you the benefits of query resolution through email, live sessions with trainers, round-the-clock support, and access to the learning modules on LMS for a lifetime. Also, you get the latest version of the course material at no added cost.\n Intellipaat’s self-paced training is 75 percent lesser priced compared to the online instructor-led training. If you face any problems while learning, we can always arrange a virtual live class with the trainers as well.\n Intellipaat is offering you the most updated, relevant, and high-value real-world projects as part of the training program. This way, you can implement the learning that you have acquired in real-world industry setup. All training comes with multiple projects that thoroughly test your skills, learning, and practical knowledge, making you completely industry-ready.\n You will work on highly exciting projects in the domains of high technology, ecommerce, marketing, sales, networking, banking, insurance, etc. After completing the projects successfully, your skills will be equal to 6 months of rigorous industry experience.\n Intellipaat actively provides placement assistance to all learners who have successfully completed the training. For this, we are exclusively tied-up with over 80 top MNCs from around the world. This way, you can be placed in outstanding organizations such as Sony, Ericsson, TCS, Mu Sigma, Standard Chartered, Cognizant, and Cisco, among other equally great enterprises. We also help you with the job interview and résumé preparation as well.\n You can definitely make the switch from self-paced training to online instructor-led training by simply paying the extra amount. You can join the very next batch, which will be duly notified to you.\n Once you complete Intellipaat’s training program, working on real-world projects, quizzes, and assignments and scoring at least 60 percent marks in the qualifying exam, you will be awarded Intellipaat’s course completion certificate. This certificate is very well recognized in Intellipaat-affiliated organizations, including over 80 top MNCs from around the world and some of the Fortune 500companies.\n Apparently, no. Our job assistance program is aimed at helping you land in your dream job. It offers a potential opportunity for you to explore various competitive openings in the corporate world and find a well-paid job, matching your profile. The final decision on hiring will always be based on your performance in the interview and the requirements of the recruiter.", "posttime": "2020-08-05 15:19:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,artificial,学习", "title": "人工智能课程", "title_en": "Artificial Intelligence Course", "transed": 1, "url": "https://intellipaat.com/artificial-intelligence-deep-learning-course-with-tensorflow/", "via": "", "real_tags": ["人工智能", "学习"]}, {"category": "", "categoryclass": "", "imagename": "07f17f3f7c2736e91dbf843cad395ce3.gif", "infoid": 1016352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MATLAB是数据科学家和人工智能研究人员等使用的强大工具。虽然有一个学习曲线，但它是值得投入的，因为一旦你对它理解得足够好，可以把事情做好，你很可能会发现它既高效又优雅。一旦您有机会体验它们，它们的库和工具就很难放弃。作为额外的好处，他们提供支持包来在各种平台上生成和运行代码，包括Raspberry Pi！\n开始时，您需要一台安装了Matlab的PC。我正在使用2020a版本，我将通过运行Catalina的Macbook Pro进行设置。\n在安装的最后一个屏幕上，选择立即安装。这将打开电路板设置向导。\n注意：如果您已经在安装向导中将其关闭，您可以通过选择&#34；Add-ONS&34；&gt；Manage Add-ONS&#34；，然后选择Raspberry PI支持包旁边的齿轮按钮(安装)来找到映像安装程序。\nMATLAB通过在Raspberry PI硬件上运行的服务器与Raspberry PI交互。这是一个自定义服务器，用于解释MATLAB发送的命令。\n主板设置向导将引导您下载包含服务器的MATLAB Raspbian映像。然后，它将引导您配置它以使用您选择的任何网络选项。\nMATLAB无法在Mac上刻录图像，所以我最终简单地使用BalenaEtcher刻录了图像。\n在“写入固件”页面上，MATLAB检查SD卡以确保它已被烧录。我重新插入SD卡，以便烧录的图像对程序可见。这样，我就可以选择下一步并跳到下一步。\n在Matlab中，选择“连接到无线网络”。&#34；填写主板和PC都连接到的SSID和密码(注意-My Raspi 3 B+无法连接到2.4 GHz WiFi网络。显然，这是一个已知的问题)。\n通常，MATLAB会自动在您的主板上设置网络连接，但是由于我们必须跳过前面的成像步骤，所以我们必须在PI上手动设置WiFi。要在PI上设置WiFi，您可能希望连接键盘、鼠标和HDMI显示器，不过您也可以通过SSH进行连接。\n通过微型USB将PI连接到至少5V 2A的电源。\n插入MIPI-CSI电缆，蓝色一面朝向pi的以太网连接器，蓝色一端背对相机镜头，将相机连接到主板上。\n您应该看到显示&#34；测试硬件连接成功&#34；的屏幕。如果没有，请仔细检查您的pi和运行笔记本电脑的PC是否连接到同一网络，然后再次尝试运行测试连接。\n现在，您只需键入以下命令，即可使用Matlab控制台将Raspberry PI连接到Matlab：\n这将调出董事会的信息，您还可以在Workspace中看到它。电路板的信息将包含可用的数字引脚、LED、SPI通道、I2C总线及其速度的列表。\n分辨率是可选的，也可以设置为不同的分辨率。默认值为640x480。设置相机时，输出中会列出可用的分辨率。\n清除我们之前创建的与电路板的连接，因为面部检测代码创建了一个新连接。\n确保您的圆周率相机的位置，以便它可以看到您的脸(或任何人的脸)。\n在Matlab中创建一个新脚本，然后将包含的代码复制并粘贴到该脚本中。将其命名为faceDetection.m。&#34；请确保您当前的目录是具有faceDetection.m的目录。\n在faceDetection.m打开的情况下，在编辑器选项卡上选择&#34；Run&#34；(或在控制台中键入&#34；faceDetection&#34；)。您将再次看到一系列像素值，图1的窗口将打开并开始检测人脸。它将一直运行，直到您选择&#34；暂停&#34；，然后选择&#34；结束调试&#34；退出。\n如您所见，运行人脸检测只需要几行代码。代码运行的是级联对象检测器，它使用Viola-Jones算法来检测人的脸、鼻子、眼睛、嘴巴或上半身。\n我发现Matlab人脸检测器在Raspberry Pi3B+上既快又准确.。它也可以训练级联物体探测器来识别其他物体，如停车标志或汽车。\n多读", "note_en": "MATLAB is a powerful tool used by data scientists and artificial intelligence researchers, among others. Although there is a learning curve, it&#39;s worth diving in, because once you understand it well enough to get things done, you&#39;ll likely find it efficient and elegant. Their libraries and tools are hard to give up once you&#39;ve had the chance to experience them. As a bonus, they offer support packages to generate and run code on a variety of platforms, including Raspberry Pi!\n  Starting out, you&#39;ll need a PC with Matlab installed. I&#39;m using version 2020a and I&#39;ll be doing the setup via my Macbook Pro running Catalina.\n     On the final screen of setup, choose &#34;Setup now.&#34; That will open the board setup wizard.\n Note: If you already closed it the installation wizard, you can find the image setup by selecting &#34;Add-Ons&#34; &gt; &#34;Manage Add-Ons&#34; and then selecting the gear button ( setup ) next to the Raspberry Pi support package.\n   MATLAB interfaces with Raspberry Pi by way of a server running on the Raspberry Pi hardware. This is a custom server that interprets commands send by MATLAB.\n The board setup wizard will guide you through downloading  MATLAB&#39;s raspbian image  that includes the server. Then it will walk you through configuring it to work with whichever networking option you choose.\n    Matlab was not able to burn the image on Mac, so I ended up simply using BalenaEtcher to burn the image instead.\n On the &#34;Write Firmware&#34; page, MATLAB checks the SD card to make sure it has been burned. I reinserted the SD card so that the burned image was visible to the program. That way I was able to select &#34;Next&#34; and skip to the next step.\n        In Matlab, choose &#34; Connect to wireless network.&#34;  Fill in the SSID and password that both the board and PC are connected to (note - my Raspi 3 B+ is not able to connect to 2.4GHz wifi networks. Apparently it&#39;s a known issue)\n  Normally, MatLab sets the network connection up on your board automatically, but since we had to skip the previous imaging step, we&#39;ll have to set up the WIFI on the Pi manually. To set up WIFI on the Pi, you may wish to connect a keyboard, mouse and HDMI monitor, although you can also do it via SSH.\n Connect the Pi to a power supply of at least 5V 2A via the micro-USB.\n  Connect the camera to the board by inserting the MIPI-CSI cable with blue side facing the pi&#39;s ethernet connectors, and the other blue side facing away from the camera lens.\n  You should see the screen that says &#34;Test Hardware Connection successful&#34;. If not, double check that your pi and PC running laptop are connected to the same network and try running &#34;test connection&#34; again.\n  You can now connect your Raspberry Pi to Matlab using the Matlab console by simply typing:\n  That brings up the board&#39;s information, and you will also see it in Workspace. The board&#39;s info will contain a list of the available digital pins, leds, SPI channels, I2C buses and their speed.\n      The resolution is optional, and can also be set to a different resolution. Default is 640x480. The available resolutions are listed in the output when you set up your camera.\n      to clear the connection to the board that we created previously, since the face detection code creates a new connection.\n Make sure that your Pi camera is positioned so that it can see your face (or anyone&#39;s face).\n Create a new script in Matlab, and copy and paste the included code into the script. Name it &#34;facedetection.m.&#34; Make sure your current directory is the one with facedetection.m.\n  With facedetection.m open, select &#34;run&#34; on the editor tab (or type &#34;facedetection&#34; in the console). Once again, you will see a cascade of pixel values, and the &#34;Figure 1&#34; window will open and begin detecting faces. It will run until you select &#34;pause&#34; and then &#34;end debugging&#34; to quit.\n  As you can see, there are only a few lines of code needed to run face detection. The code is running the  cascade object detector , which uses the  Viola-Jones algorithm  to detect people’s faces, noses, eyes, mouth, or upper body.\n  I found the Matlab face detector to be both fast and accurate on Raspberry Pi 3 B+. It&#39;s also possible to  train the Cascade Object Detector  to recognize other objects, like stop signs or cars.\n     Read more", "posttime": "2020-08-05 15:18:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,树莓,recognition,matlab", "title": "基于Mathworks的树莓猪人脸识别", "title_en": "Face Recognition Using Mathworks on Raspberry Pi", "transed": 1, "url": "https://www.hackster.io/monica/face-recognition-using-mathworks-on-raspberry-pi-40120c", "via": "", "real_tags": ["树莓", "matlab"]}, {"category": "", "categoryclass": "", "imagename": "50beaa8d581c26904171b0c4e254de10.jpg", "infoid": 1016351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有争议的工程师安东尼·莱万多夫斯基(Anthony Levandowski)因在自动驾驶行业的各种工作期间窃取商业机密而被判处18个月监禁。莱万多夫斯基曾在谷歌(Google)部门工作，在创立卡车运输公司奥托(Otto)并将其出售给优步(Uber)之前，该部门后来成为Waymo。他的判决为一场多年的法律传奇画上了句号，这场传奇源于莱万多夫斯基在硅谷的职业生涯，在过去十年的大部分时间里，他在硅谷的职业生涯起起伏伏。\n莱万多夫斯基最初是在3月份被判刑的，当时美国地区检察官办公室建议判处27个月的刑期。据TechCrunch报道，法官威廉·阿尔苏普周三判处莱万多夫斯基18个月监禁，由于新冠肺炎大流行，他将在晚些时候服刑。\n“在过去的三年半里，我不得不接受我的所作所为。我想借此机会向我在谷歌的同事道歉，因为我辜负了他们的信任，也想向我的整个家人道歉，因为他们已经并将继续为我的行为付出代价，“Levandowski在一份声明中说。\n“过去的三年半迫使我接受我的所作所为。”\nWaymo的一位发言人告诉The Verge：“安东尼·莱万多夫斯基(Anthony Levandowski)窃取自主技术商业机密的行为对Waymo造成了巨大的破坏和伤害，构成了背叛，如果没有被发现，后果可能会更加严重。”“我们赞同美国助理检察官凯瑟琳·瓦兹尼亚克(Katherine Wawrzyniak)的观点，即这起盗窃‘抹去了许多其他人的贡献，他们也为这个制造更安全自动驾驶汽车的项目付出了血汗和泪水。”阿尔苏普法官今天决定判处莱万多夫斯基18个月监禁，罪名是窃取我们的商业机密，这代表着促进尖端技术发展的商业秘密法取得了胜利。“。\n莱万多夫斯基曾经是快速增长的自动驾驶汽车世界的超级明星工程师，他帮助谷歌成立了一个致力于这项技术的部门。他后来被指控在创立自动驾驶卡车公司Otto之前窃取了他在谷歌期间的文件。2016年，他将奥托出售给优步(Uber)，这使他得以加入这家叫车公司，担任其自动驾驶部门的高级管理人员。\n出售后不久，谷歌的自动驾驶部门(当时名为Waymo)对优步提起诉讼，指控其窃取商业机密，指控优步收购奥托，使该公司能够获得莱万多夫斯基在外出时非法携带的敏感和机密Waymo技术。\n优步和Waymo就诉讼达成和解，但莱万多夫斯基在法庭诉讼期间拒绝交出任何文件后，仍被加州北区联邦检察官办公室提起的窃取商业机密刑事指控套牢。据TechCrunch报道，莱万多夫斯基最终达成认罪协议，作为今天判决的一部分，他将向谷歌支付近7.57亿美元的赔偿和9.5万美元的罚款。\n除了这些罚款外，莱万多夫斯基还被迫宣布破产，此前另一项法院裁决发现，他非法挖走了Waymo工程师，并被勒令向Waymo支付1.79亿美元，这是他负担不起的。\n根据TechCrunch的说法，莱万多夫斯基不在法律部工作。上个月，他提起了另一起诉讼，指控优步欠他钱，作为收购奥托的协议的一部分，但优步从未支付过这笔钱，因为与Waymo的商业秘密摊牌实际上扼杀了这笔交易的前景，以及它本可以给莱万多夫斯基的经济回报。目前还不清楚这将如何进行，但他要求至少41亿美元，这大致相当于最近报道的优步货运(Uber Freight)的估值，优步货运是优步从收购奥托(Otto)中挽救出来的自动驾驶卡车业务。", "note_en": "Controversial engineer Anthony Levandowski, who worked for the Google division that would become Waymo before founding trucking company Otto and selling it to Uber, has been sentenced to 18 months in prison for trade secret theft during his various stints in the self-driving industry. His sentencing closes the book on a multi-year legal saga stemming from Levandowski’s high-rising and equally fast-falling career in Silicon Valley spanning much of the past decade.\n Levandowski was  initially sentenced back in March, when the US District Attorney’s office recommended a 27-month sentence. Judge William Alsup on Wednesday sentenced Levandowski to 18 months in prison, to be served at a later date due to the COVID-19 pandemic,  according to  TechCrunch.\n “The last three and a half years have forced me to come to terms with what I did. I want to take this time to apologize to my colleagues at Google for betraying their trust, and to my entire family for the price they have paid and will continue to pay for my actions,” Levandowski said in a statement.\n “The last three and a half years have forced me to come to terms with what I did.”\n “Anthony Levandowski’s theft of autonomous technology trade secrets has been enormously disruptive and harmful to Waymo, constituted a betrayal, and the effects would likely have been even more severe had it gone undetected,” a Waymo spokesperson tells The Verge. “We echo Assistant U.S. Attorney Katherine Wawrzyniak’s sentiment that this theft ‘ erases the contributions of many, many other people that have also put their blood, sweat and tears into this project that makes a safer self-driving car.’ Judge Alsup’s decision today to sentence Levandowski to 18 months in prison for stealing trade secrets from us represents a win for trade secret laws that promote cutting-edge technology development.”\n Levandowski was once a superstar engineer in the fast-growing world of self-driving cars who helped jumpstart a Google division dedicated to the technology. He was later accused of stealing documents from his time at Google before founding Otto, a self-driving truck company. He would go on to  sell Otto to Uber in 2016, which allowed him to join the ride-hailing company as a high-ranking executive in its self-driving division.\n Shortly after the sale, Google’s self-driving unit, then called Waymo, filed a lawsuit against Uber for trade secret theft, alleging its acquisition of Otto allowed the company to gain access to sensitive and confidential Waymo technology Levandowski illegally took with him on his way out.\n Uber and Waymo  settled the lawsuit, but Levandowski was still on the hook for criminal charges of trade secret theft brought by the US Attorney’s Office of the Northern District of California after he refused to hand over any documents during the court case. Levandowski ultimately reached a plea deal, and as part of today’s sentencing he will pay nearly $757 million in restitution to Google and a fine of $95,000,  TechCrunch reports.\n In addition to those fines, Levandowski was forced to declare bankruptcy after a separate court ruling found he illegally poached Waymo engineers and was  ordered to pay Waymo $179 million, which he could not afford.\n According to  TechCrunch, Levandowski isn’t done in the legal department. He filed another lawsuit last month alleging Uber owes him money as part of its agreement to acquire Otto that it never paid, because the trade secret showdown with Waymo effectively killed the deal’s prospects and the financial rewards it would have given Levandowski. It’s not clear how that will play out, but he’s asking for at least $4.1 billion, which is roughly equivalent to the last reported valuation of Uber Freight, the self-driving trucking business the company salvaged from its Otto acquisition.", "posttime": "2020-08-05 14:54:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,安东尼,levandowski,waymo", "title": "前谷歌高管安东尼·莱万多夫斯基因窃取自动驾驶汽车机密被判18个月监禁", "title_en": "Former Google exec Anthony Levandowski sentenced to 18 months for stealing self-driving car secrets", "transed": 1, "url": "https://www.theverge.com/2020/8/4/21354906/anthony-levandowski-waymo-uber-lawsuit-sentence-18-months-prison-lawsuit", "via": "", "real_tags": ["谷歌", "google", "安东尼", "waymo"]}, {"category": "", "categoryclass": "", "imagename": "cde9f17e27ff32926f852f58e2c074dc.jpeg", "infoid": 1016350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年5月，人气颇高的竞技射手Valorant中的一些球员似乎拥有超能力。他们每次开枪，都会直接击中对手的头部，很快就把他们打死了。他们几乎不可能失手。\n在某种程度上，这些球员确实拥有超能力：他们使用了最先进的作弊手段之一来对付Valorant，这是Riot Games制造的五对五战术第一人称射击游戏。作弊本质上是一个程序，它利用游戏代码中的缺陷侵入了视频游戏，并颠覆了游戏规则。虽然Riot在其游戏中继续打击作弊者，但由于一名义务警员夜以继日地工作，捕捉作弊者及其工具，并向Riot或暴雪(Blizzard)等公司报告作弊行为，Riot或暴雪(Blizzard)等公司将报告给Riot或暴雪(Blizzard)等公司。Overwatch是另一款受欢迎的在线射击游戏Overwatch的制造商。他没有受雇于任何游戏开发人员，也没有从他的工作中获得报酬，但他确实投入了大量的时间和精力来阻止作弊者，当他发现什么时，游戏开发人员会倾听。\n他的名字是Mohamed Al-Sharifi，但他最出名的名字是GamerDoc。这位来自伦敦的24岁年轻人正在成为游戏公司与黑客和欺骗开发者之间似乎永无止境且不断升级的猫捉老鼠游戏的重要参与者。今天所有的在线游戏都采用了先进的反作弊系统，可以监控玩家的电脑，看看他们是否在运行任何作弊行为。对于Valorant，Riot Games开发了在内核级别运行的先锋系统。这是操作系统不可或缺的一部分，该操作系统几乎管理系统所做的每一件事。它应该是任何计算机系统中最安全的部分之一，如果被黑客访问，它可能会完全危及用户的安全。出于这个原因，Riot招致了对先锋的批评，安全专家表示，它太具侵入性了。但即使是像先锋这样拥有先进系统的游戏也会有作弊者。当游戏还处于测试阶段时，该公司就禁止了其中的8000多个。\n“没有哪种游戏是不可破解的。没有什么作弊是不被察觉的，“GamerDoc在电话采访中说。“这只是一个方式和地点的问题。”\n“我们总是很高兴收到人们的信息，特别是如果他们对作弊社区有洞察力的话，”暴动的Valorant的反作弊负责人保罗·张伯伦(Paul Chamberlain)在一份电子邮件声明中说。像GamerDoc这样的人提供的信息帮助我们加快反作弊的发展，并最终更快地让作弊者离开游戏。“。\n一家游戏公司的三名参与反作弊努力的消息人士表示，GamerDoc在追捕作弊和作弊者方面非常有效，导致作弊行为得到修补，作弊行为被禁止。由于没有获得接受媒体采访的授权，这三名消息人士要求匿名。\n其中一名员工表示：“他的提示帮助我们对一些作弊行为做出了更快的反应，这些作弊行为很容易让(作弊开发者)破产。”\n另一位网友表示，GamerDoc“在发现作弊行为并将其报告给我们方面非常有帮助。”\n“对于反作弊开发者来说，他是他们的志愿者侦察员，”一位绰号为sadko2的作弊开发者说。“他建立了一个社区，并增加了一层额外的报道。玩家手动报告具有概念证明的某人有点像是在向反作弊开发人员和真正的反向工程师灌输信息。所以总而言之，他一个人什么都做不了，单枪匹马，但他强大的社区和手动上报功能绝对是欺骗开发者的一大威胁。“。\nGamerDoc承认他“这样做招致了很多敌人”。但GamerDoc一度表示，他们中的一群人发起了一个现已被删除的GoFundMe，以筹集资金聘请刺客将他干掉。还有一次，有人试图让他的前老板透露他的家庭住址。他说，他还经常收到死亡威胁。虽然他承认这类事情会影响他的精神，但这不会阻止他做他热爱的事情。\nGamerDoc从2018年开始追捕作弊开发者和用户，当时他创建了一个名为O.W.警察局的不和谐服务器，以揭露Overwatch中赢得交易的玩家。在这个计划中，玩家群体允许彼此赢得比赛，以人为地提高自己的排名。他因此而获得的关注导致更多的玩家举报作弊者。\nGamerDoc说：“我开始调查这些事情，我开始索要证据，我开始索要视频剪辑，然后它就一直堆积如山。”“(我认为)这就像是一场巨大的灾难，在这场比赛中作弊的人太多了。”\n他在那里的成功激励他定期这样做，不仅追查个人作弊者，而且追查整个生态系统。2014年，PC Gamer的一项调查显示，游戏中的作弊是一项带来数百万美元收入的巨大业务。使用作弊的玩家经常从经销商那里获得作弊，这些经销商在面向客户的网站上推广作弊。这些卖家与欺骗开发人员有直接关系，这些开发人员对游戏引擎进行反向工程，开发本质上是价值数千美元的漏洞。这就是巨人GamerDoc要对抗的。\nGamerDoc说：“我一直在努力寻找破解作弊行为、摧毁作弊企业、为玩家伸张正义的方法。”\n他的动机很简单：他认为游戏正在被作弊者“毁了”，被“只想赚几个快钱的复制粘贴黑客”毁了。\n“总的来说，我就是讨厌作弊的人。我认为把所有的乐趣都据为己有是自私的。人们有一份工作，他们回家就是为了享受一天美好的游戏，但如果因为某个孩子用他妈妈的信用卡买作弊而毁了这份工作，那就太糟糕了。“GamerDoc说。“不仅如此，还有一些人甚至试图与作弊者进行职业水平的竞争，这会破坏许多人的竞争诚信，这些人为了成为最好的人而练习了无数个小时。”\n你是否在游戏中进行反向工程和开发作弊？或者你是做反作弊引擎的？我们很想听到你的消息。使用非工作电话或计算机，您可以安全地通过SIGNAL电话+1 917 257 1382联系Lorenzo Franceschi-Bicchierai，通过Wickr联系Lorenzofb，或通过OTR Chat电子邮件联系lorenzofb@jabber.ccc.de，或发送电子邮件至lorenzofb@vice.com。\nGamerDoc现在运营着两个不和谐服务器，O.W.警察局和Valorant警察局，这两个部门分别有近3000名和2000多名成员。在这些渠道中，志愿者义务警员发布涉嫌作弊的报告，分享他们在游戏中的ID，他们被看到作弊的日期和时间，他们所在的地区，以及任何支持这一说法的证据，如作弊者的视频。GamerDoc和服务器上的其他管理员梳理这些报告，查看它们，并将他们认为准确的报告发送给Riot Games和暴雪。\n特别是在新冠肺炎引发的经济危机导致他下岗后，GamerDoc表示，追捕作弊者几乎已经成为他的全职工作。GameDoc拒绝透露他是否通过漏洞赏金计划赚钱。\n“我有一定的声誉，我不会发送虚假报告，因为这会让球员很糟糕，也会让其他所有人都很糟糕，而且我会失去公司的公信力。”GamerDoc说。“我不想浪费他们的时间。”\n坦率地说，GamerDoc的超能力似乎就是他对阻止作弊者一窍不通。\n为了发现作弊和作弊的人，GamerDoc还潜伏在作弊的论坛和不和谐的频道上，用他的话说就是“收集情报”。有时，这意味着对作弊开发者或卖家进行社会工程，让他们为他提供作弊，这样他就可以将作弊应用程序传递给Riot Games、暴雪和其他游戏工作室的反作弊团队。GamerDoc说，其他时候，作弊开发者与他联系，揭露竞争对手在这个大生意中犯下的其他作弊行为，在这个大生意中，最好的作弊行为可以卖到数百甚至数千美元。\n“作弊很像毒品。这些作弊企业就像是一个完整的层次结构，你有开发人员，有助理开发人员，有销售经理，然后有副销售经理，然后还有经销商。“GamerDoc说。“每个人都各司其职，都在赚钱。”\nGamerDoc不仅通过向视频游戏公司出卖作弊者来扰乱他们，他还在他的反作弊警察局Twitter账户上公开点名并羞辱他们。有时，GamerDoc会公布他们的姓名或玩家ID，以便其他玩家可以举报或远离他们。\n自2018年开始以来，他估计他已经有5万到7万名作弊者在Overwatch和Valorant被禁止，包括发送到他的不和谐频道的报告，以及他向这些公司报告流行作弊引发的禁令浪潮。在一家游戏公司工作的两名消息人士表示，这些数字是可行的。但同样重要的是要记住，在GamerDoc通知公司之后，开发人员会做好自己的工作，查看报告并确定它们是否准确，这是一项至关重要的工作。\nGamerDoc的一位名为Hina的合作者表示：“作为一个人，对抗看起来像巨人的东西并不总是容易的，但GamerDoc有很多人站在他这边，相信他的事业，也许有一天大公司也会看到这一点，并在他们的软件中加入更好的反作弊功能。”\nGamerDoc表示，未来他计划推出一个公共网站，玩家可以在那里发送报告给版主进行审查，发送给游戏公司，然后发布一份已知作弊者的名单。\n随着玩“使命召唤：战区”(Call of Duty：Warzone)等热门网络游戏的玩家抱怨普遍存在的作弊行为，游戏制片厂正在加大力度，设计更好、更复杂的反作弊系统。但据两名在一家游戏公司工作的消息人士称，他们也使用了GamerDoc使用的一些相同的技术，在作弊社区内监控和培养线人。\n在Valorant作弊的情况下，GamerDoc获得作弊并将其传递给Riot，Riot对其进行修补并使作弊变得无用。这个特别的骗局是由一位自称Bukky的开发人员所做的。Bukky说，他过去常常以每天15欧元、每周70欧元、每月150欧元或终身500欧元的价格出售作弊订阅-提供持续支持-分别约为17美元、82美元、177美元和590美元。Bukky说，他有近1万名用户通过他的网站Applecheats.cc购买了订阅。\n就像他的作弊一样，巴基的网站现在也瘫痪了。但巴克基否认曾被GamerDoc抓获，并驳回了他的工作。\n“他只是个混蛋，把作弊的装载机送到Riot，”Bukky在一次网上聊天中说。“他没什么特别的。”\n然而，参与反作弊努力的消息人士证实了GamerDoc对这个故事的描述，暗示Bukky只是想要削弱GamerDoc的成就。\n一家游戏公司的员工说：“在作弊过程中获取作弊密钥、作弊副本或游戏内存转储都是GamerDoc提供的帮助我们更快发现新作弊的东西。”\nGamerDoc说：“当我禁止作弊者或让他们的东西被发现时，我总是很高兴。”\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "In May, some players in the popular competitive shooter  Valorant  seemed to have super powers. Every time they fired their guns,  they hit their opponents right in the head, killing them quickly. They practically couldn&#39;t miss.\n  In some way, these players did have superpowers: they were using one of the most advanced cheats for  Valorant, the five-on-five tactical first-person shooter made by Riot Games. The cheat was essentially a program that hacked the video game and subverted its rules by exploiting flaws in the game’s code. While Riot continues to fight cheaters across its games, that particular cheat is no longer available thanks to a vigilante who works around the clock to catch cheaters and their tools, reporting them to companies like Riot or Blizzard, the makers of  Overwatch, another popular online shooter. He&#39;s not employed by any game developer, nor does he get paid for his work, but he does devote a great deal of his time and energy to stopping cheaters, and when he finds something, game developers listen.\n  His name is Mohamed Al-Sharifi but he’s best known as  GamerDoc. This 24-year-old from London is becoming an important player in the seemingly never-ending and ever-escalating cat-and-mouse game between gaming companies against hackers and cheat developers. All online games today employ  advanced anti-cheat systems that monitor gamers’ computers to see if they’re running any cheats. For  Valorant, Riot Games developed the Vanguard system, which runs at the kernel level. This is an integral part of the operating system that manages almost every single thing a system does. It should be one of the most highly secure parts of any computer system, and which could completely compromise a user if accessed by a hacker. Riot  has drawn criticism for Vanguard for this reason, with security experts saying it&#39;s too intrusive. But even a game with an advanced system like  Vanguard has cheaters. The company  banned more than 8,000 of them when the game was still in beta.\n  “No game is unhackable. No cheat is undetectable,” GamerDoc said in a phone interview. “It&#39;s just a matter of how and where.”\n     “We&#39;re always happy to receive information from people, especially if they have insight into cheating communities,” Paul Chamberlain, the anti-cheat lead for Riot’s  Valorant, said in an emailed statement. “The information people like GamerDoc provides helps us accelerate our anti-cheat development and ultimately gets cheaters out of the game faster.”\n  Three sources at a gaming company who are involved in anti-cheat efforts, and who asked to remain anonymous because they were not authorized to speak to the press, said that GamerDoc has been very effective at hunting cheats and cheaters, leading to the cheats getting patched and the cheaters banned.\n  “His tips have helped us react faster to some cheats, which can easily send [the cheat developers] out of business,” said one of the employees.\n  Another one said GamerDoc has been “super helpful in finding cheats and reporting them to us.”\n    “For the anti-cheat developers he&#39;s their volunteer scouter,” said a cheat developer who goes by the moniker sadko2. “He&#39;s built a community and added an extra layer of reporting. Players manually reporting somebody with proof of concept is kinda spoon-feeding the anti-cheat developers and real reverse engineers. So to conclude, he can do nothing by himself, all alone, but his strong community and manual reporting feature is definitely a big threat to cheat developers.”\n  GamerDoc admitted that he’s “made many enemies doing this.”  At one point, GamerDoc said a group of them launched  a now-deleted GoFundMe to raise money to hire an assassin to take him out. Another time, someone tried to get his old boss to reveal his home address. He said he also regularly receives death threats. And while he admitted that this kind of stuff affects him mentally, it won’t stop him from doing what he’s passionate about.\n  GamerDoc started hunting cheat developers and users in 2018, when he created a Discord server called The O.W. Police Department  to expose players in Overwatch who were &#34; win trading.&#34; In this scheme, groups of players allow each other to win matches in order to artificially increase their ranking. The attention he got for this led to more players reporting cheaters.\n  “I started to look into these things, I started to ask for proof, I started to ask for video clips, and it just kept piling up,” GamerDoc said. “[I thought] this is like a huge disaster, there&#39;s too many people cheating in this game.”\n  His success there motivated him to do this regularly and go after not just individual cheaters, but the whole ecosystem. Cheating in games is a huge business that moves millions of dollars,  as an investigation in PC Gamer revealed in 2014. Players who use cheats often get them from resellers who promote them on customer-facing websites. These sellers have direct relationships with cheat developers who reverse engineer game engines and develop what essentially are exploits which are worth thousands of dollars. This is the goliath GamerDoc is going up against.\n  “I’ve just been trying to find ways to break cheats and destroy cheating businesses and get justice for players,” GamerDoc said.\n  His motivations are simple: he thinks games are being “ruined” by cheaters, by “copy paste hackers who just try to earn a few quick bucks.”\n  “I just hate cheaters in general. I think it&#39;s selfish to have all the fun for yourself. People have a job they come home to enjoy a nice day of gaming, and for that to be ruined because of some kid who used his moms credit card to buy cheats just sucks,” GamerDoc said. “Not only that, there are people who even try to compete at a pro level with cheats ruining the competitive integrity for many who practice countless hours to be the best.”\n Do you reverse engineer and develop cheats for games? Or do you work on anti-cheat engines? We’d love to hear from you. Using a non-work phone or computer, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, lorenzofb on Wickr, OTR chat at  lorenzofb@jabber.ccc.de, or email  lorenzofb@vice.com  .\n  GamerDoc now runs two Discord servers, The O.W. Police Department and The Valorant Police Department, which have almost 3,000 and over 2,000 members respectively. In these channels, volunteer vigilantes post reports of alleged cheaters, sharing their in-game IDs, the date and time they were seen cheating, the region where they play in, and any evidence to support the claim, such as videos of the cheater. GamerDoc and other admins on the servers comb through the reports, review them, and send the ones that they deem accurate to Riot Games and Blizzard.\n  Especially since he was laid off at his day job due to the economic crisis triggered by COVID-19, GamerDoc said hunting cheaters has practically become a full time job for him. GameDoc declined to say whether he makes any money via bug bounty programs.\n  “I have somewhat of a reputation to maintain that I&#39;m not sending false reports over, because it would suck for the player, and it would suck for everyone else, and I would lose credibility from the company.” GamerDoc said. “I don&#39;t want to waste their time.”\n  GamerDoc’s super power seems to be, put bluntly, that he gives a shit about stopping cheaters.\n  In order to find cheats and cheaters, GamerDoc also lurks on cheaters&#39; forums and Discord channels, “gathering intelligence,” as he put it. Sometimes, that means socially engineering the cheat developers or sellers into providing him the cheat so he can pass the cheating app on to the anti-cheat teams at Riot Games, Blizzard, and other game studios. Other times, GamerDoc said that cheat developers get in touch with him to expose other cheats made by competitors in what is a big business where the best cheats can go for hundreds or even thousands of dollars.\n  “Cheating is pretty much like drugs. And there&#39;s like a whole hierarchy as well with these cheating businesses where you have the developer, you have the assistant developer, you have the sales manager, then you have the under sales manager, and then you have the resellers,” GamerDoc said. “Everyone does their part and makes money.”\n   GamerDoc doesn’t just disrupt cheaters by ratting them out to video game companies, he also  names and  shames  them publicly  on his Anti-Cheat Police Department Twitter account. Sometimes, GamerDoc publishes their names or gamer IDs so that other gamers can report them or stay away from them.\n  Since he started in 2018, he estimates that he has gotten between 50,000 and 70,000 cheaters banned across  Overwatch and  Valorant, counting both reports sent to his Discord channels, as well as ban waves triggered by him reporting popular cheats to the companies. Two sources who work at a gaming company said those numbers are feasible. But it’s also important to remember that after GamerDoc alerts the companies, the developers do their part of the job and look into the reports and determine whether they are accurate, which is crucial work.\n  “It&#39;s not always easy as a single person to fight versus what looks like a goliath but GamerDoc has people on his side, believing in his cause, and maybe one day big corporations will see that as well and put a better anti-cheat in their software,” said one of GamerDoc’s collaborators, who goes by the name of Hina.\n  For the future, GamerDoc said he is planning to launch a public website where gamers can send in reports for moderators to review them, send them to the gaming companies, and then publish a list of known cheaters.\n  As gamers who play popular online games like  Call of Duty: Warzone  complain  about  pervasive  cheating, game studios are ramping up their efforts, designing better, more sophisticated anti-cheat systems. But they also employ some of the same techniques GamerDoc uses, monitoring and cultivating informants within the cheating community, according to two sources who work at a gaming company.\n  In the case of the  Valorant cheat, GamerDoc obtained the cheat and passed it on to Riot, which patched it and rendered the cheat useless. That particular cheat was made by a developer who calls himself Bukky. Bukky said he used to sell a subscription to the cheat—providing continuous support—for 15 euros a day, 70 euros a week, 150 euros a month, or 500 for life (around $17, $82, $177, and $590 respectively). Bukky said he had almost 10,000 users who purchased the subscription through his website Applecheats.cc.\n  Just like his cheat, Bukky’s website is now down. But Bukky denied ever getting caught by GamerDoc, and dismissed his work.\n  “He’s just an asshole that sends cheats loaders to Riot,” Bukky said in an online chat. “He’s nothing special.”\n  Sources involved in anti-cheat efforts, however, confirmed GamerDoc’s account of the story, suggesting Bukky is just trying to diminish GamerDoc’s accomplishments.\n  “Acquiring a key for the cheat, or a copy of the cheat or a memory dump of the game while the cheat is running are all things that GamerDoc has provided that have helped us detect a new cheat faster,” said an employee of a gaming company.\n  “I&#39;m always happy when I&#39;m banning a cheater or getting their stuff detected,” GamerDoc said.\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-08-05 14:52:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "overwatch,cheaters,作弊", "title": "穆罕默德·沙里菲(Mohamed Al-Sharifi)，又名GamerDoc，一名志愿者，他花了两年时间在Overwatch和Valorant追捕作弊者，禁止了大约50K-70K作弊者", "title_en": "Profile of Mohamed Al-Sharifi, aka GamerDoc, a volunteer who has spent two years hunting cheaters in Overwatch and Valorant, getting ~50K-70K cheaters banned", "transed": 1, "url": "https://www.vice.com/en_us/article/bv857z/gamerdoc-catching-banning-cheaters-hackers-overwatch-valorant", "via": "", "real_tags": ["overwatch", "cheaters", "作弊"]}, {"category": "", "categoryclass": "", "imagename": "db58203203d63e82a8c905d2b7028903.jpg", "infoid": 1016346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你想听这条信息，我们用我们的声音记录下来：\n这个项目是艺术家Bojana Coklyat和Shannon Finnican之间的合作，由EyeBeam和残疾可见性项目支持。\n眼束“使人们能够创造性地、批判性地思考技术对社会的影响，其使命是为所有人揭示通向更公正未来的新道路。”残疾人可见性项目“是一个致力于创建、分享和放大残疾媒体和文化的在线社区。”\n我们很高兴您能加入我们的行列，一起探索Alt-Text，并希望在这个过程中努力使在线社区更易访问、更有趣、更受欢迎。\n先回过头来看看菜单，一些背景知识。我们，❁shannon和❀bojana，都是残疾人艺术家和活动家。大约在香农第一次考虑Alt-Text的时候，我们通过共同的朋友在纽约相识。我们意识到我们的兴趣有很多重叠之处，于是决定投身到这个合作项目中。\nAlt-Text是在线发布的图像的书面描述。Alt-Text还可以添加到数字文档(PDF、Word文档、Google文档、演示文稿等)中嵌入的图像。\nAlt-Text有多种用途，但我们关注的是它作为Web无障碍的重要组成部分的作用。\nAlt-Text允许盲人、视力低下或有某些认知障碍的人访问可视内容。\n盲人通常使用称为屏幕阅读器的软件来访问数字显示器。屏幕阅读器浏览屏幕上的文本，并将其输出到合成语音或可刷新的盲文显示器。在网站上，屏幕阅读器可能会读出导航栏中的选项，然后是标题、第一段、第二段等。当屏幕阅读器遇到图像时，它无法“阅读”它。因此，它转而查找alt-text(嵌入在代码中的图像描述)并将其读出。这就是Alt-Text作为图像的非视觉替代项的功能。\n您不能在这里看到Alt-Text，因为只有屏幕阅读器可以阅读，或者在本网站的源代码中可以查看。但是，例如，如果你安装了这个小书签(Chrome，Firefox)，并将鼠标放在图像上，Alt-Text就会直观地显示在屏幕上。它可能看起来像这样。您也可以通过打开屏幕阅读器(许多设备都有内置的屏幕阅读软件)或使用Inspect Element浏览器工具来签出Alt-Text。\nAlt-Text自20世纪90年代以来就存在了，但它经常被完全忽视，或者仅仅从遵守的角度来理解。由此产生的替代文本通常是以不情愿的、敷衍了事的风格写成的，但它具有巨大的表达潜力。\n这个项目将另类文本重新定义为诗歌的一种类型，并提供了谈论和练习写作的机会。我们不仅希望Alt-Text用户能够访问互联网上的可视内容，我们还希望他们在数字空间有一种归属感。\n我们两人都感兴趣的是，社区如何才能朝着更好、更细微的接入方式发展。如果我们以残疾文化为中心，创造性地、慷慨地处理无障碍问题，而不是专注于合规和做最低限度的工作，情况会怎样？我们如何创造残疾人不仅可以进入而且想要进入的空间和体验？\n将另类文本作为诗歌的一种类型，使我们能够用诗人们发展出来的一些想法和策略来接近它。\n也就是说，除了让互联网更容易访问之外，我们对创作另类文本诗歌并不感兴趣。我们认识到，其他人已经使用Alt-Text和代码作为诗歌的灵感和媒介，但对我们来说，提高网站可访问性仍然是Alt-Text诗意潜力的第一个也是最重要的条件。\n这里有三个来自诗坛的想法，我们发现它们在写替代文本时特别有帮助：\n只要用思考和谨慎的方式编写替代文本，我们就可以改变这一过程。我们用的是什么词？它们的内涵是什么？我们的写作基调是什么(我们写作的方式)？那个声音(读者听到的是谁)是什么？这些如何与图像的色调和透视对齐，或如何对比度？\n刚开始描述的人有过度描述图像的倾向。虽然有时会出现冗长和冗长的描述，但Alt-Text通常以简洁为目标。对于大多数图片来说，一到两句话就可以了。诗歌教会了我们很多关于如何精简语言以创造出既有表现力又简洁的东西。\n我们可以从诗歌中学到很多关于如何写替代文本更好玩和更具探索性的东西。我们对为实验而进行的实验不感兴趣--我们想要的是一种能为Alt-Text用户提供更好、更细致入微的可访问性的实验。在将视觉信息转换为文本时，会出现许多复杂而有趣的问题。我们需要尝试不同的方法来做到这一点，相互学习对方的战略和技术。\n这个项目的目的不是告诉你如何编写Alt-Text。有许多现有的资源提供了指导方针和使用方法(您可以在工具部分找到一些列出的资源)。\n我们的主要目的是将Alt-Text放在您的雷达上(如果还没有的话)，让您创造性地思考它，并探索在将图像转换为文本时出现的几个关键问题。\n我们希望您在这里读到的内容和体验清楚地表明，就像所有可访问性实践一样，编写Alt-Text需要持续的练习、学习和协作。\n我们还需要注意的是，我们对Alt-Text的想法一直在转变和改变。当然，人们对如何处理另类文本有很多不同的看法。因此，对所有这些都持保留态度，寻找不同的观点，并自由地表示不同意见。\n我是一名视觉艺术家、活动家和学者。我把我的硕士学习重点放在残疾研究和艺术管理的交叉点上。这包括在惠特尼艺术博物馆(Whitney Museum Of Art)的接入和社区计划中实习，以及参加2018年肯尼迪中心艺术与残疾领导力交流国际会议。2019年，我为纽约大学画廊(NYU Gallatin Gallery)策划了一场突破性的展览。我目前也是纽约大学基梅尔美术馆顾问委员会的成员，曾为惠特尼美术馆、纽约大学画廊和纽约犹太博物馆做过咨询工作。几十年来，我还在泽西城社区担任艺术家和草根通道组织者，策划以残疾艺术家为特色的活动和展览。2020年，我将在捷克完成2019-2020年富布赖特研究资助，重点研究残疾人在艺术方面的无障碍。\n我是一个笑容可掬的白人女人，留着及下巴的黑发波波头。我身高约5英尺6英寸，步入40多岁，外出时通常会带着我的白色手杖。今晚，我穿了一套典型的晚间服装，一件印有图案的黑白T恤，樱桃红色羊毛衫和黑色牛仔裤。\n我是一个多学科的艺术家，创作关于残疾、文化和无障碍的作品。我曾与班夫中心、塔林艺术馆、隐形狗、高架之友和瓦塞克项目合作过。我曾在布鲁克林博物馆、诗意计算学院、8楼、数据与放大器协会以及安德鲁·海斯克尔盲文和会说话的图书图书馆做过演讲。2018年，我获得了永利·纽豪斯奖，并参加了艺术超越视觉的艺术+残疾人居留。2019年，我是EyeBeam的一名住院医生。\n我是一个身高5英尺2英寸的金发白人。我个子很小，30岁出头，尽管人们经常说我看起来更年轻。我的残疾影响了我的走路，所以我走路有点摇晃。我现在正在家里写作，我穿着一套蓝色的格子棉布睡衣。\n返回菜单我们建议您与朋友或同事一起使用工作簿。你可以自己做，但我们发现参与者从阅读别人的替代文本并有机会讨论过程中学到了很多。\n我们估计完整的工作簿需要1.5到2.5小时。你可以随意拆散时间，跳过部分，或者随心所欲地重新排序。\n回到菜单作为这个项目的一部分，我们领导了Alt-Text as诗歌小组工作坊。如果您有兴趣将研讨会带到您的组织/学校/朋友小组等，请给我们发电子邮件。\n回到菜单，这个项目仍在进行中，但希望很快就会到来！请以后再次检查此空间。\n返回菜单，这些读物和资源可能会对您继续和扩展有关Alt-Text的学习有所帮助。\n不仅仅是遇见眼睛：乔治娜·克莱格(Georgina Kleege)(2017年)的这本书给艺术带来了什么，这本书是这个项目的基础，是关于失明和视觉信息之间关系的丰富知识。\nWeb AIM是一家专注于扩大Web可访问性的非营利性组织。他们的Alt-Text指南是一个很好的概述。\n“看不见的艺术”的语言描述训练。“看不见的艺术”的训练侧重于长篇描述，侧重于艺术。它包括许多与在线描述图像相关的技术。\n芝加哥MCA描述指南芝加哥是首批承诺在其网站上描述所有图像的大型博物馆(据我们所知)之一。他们有一套简短的指导方针，是一个有趣的参考点。\n植根于权利无障碍指南是一家总部位于西雅图的组织，在创建和推广无障碍媒体实践方面做了大量工作。\n艺术中的无障碍：卡罗琳·拉扎德(Carolyn Lazard)的承诺和实践，由休会艺术无障碍：艺术中的承诺和实践委托编写，是一本面向小规模艺术、非营利组织和这些组织所服务的潜在公众的无障碍指南。它详细说明了残疾人被排除在文化空间之外的具体方式，并为这些障碍提供了可能的解决方案。从历史和法律上对无障碍的定义出发，本指南考虑了小规模艺术组织满足残疾社区需求的独特能力。它运用残疾正义的原则来思考可以紧急做些什么来创造更公平和更无障碍的艺术空间。\n米娅·明格斯(Mia Mingus)、爱丽丝·王(Alice Wong)和何超琼(Sandy Ho)所著的Access Is Love包括一份资源列表，其中包含一系列关于无障碍的优秀读物和指南。他们还列出了开始创建和扩展访问权限的10种方法。\n浏览器扩展/加载项Firefox扩展Chrome扩展大多数设备都有一个内置的屏幕阅读器，当你在网络上移动时，你可以打开它来签出Alt-Text。学习如何使用屏幕阅读器需要一些时间，所以另一个选择是这些浏览器扩展，它们可以直观地显示Alt-Text。这是一种简单的方式来阅读其他人的描述，并感觉到描述的图像有多么少。\n回到菜单这个项目是围绕这个主题精心而丰富的工作生态系统的一部分。所有这些想法都不是新的-残疾人长期以来一直在要求并创造出深思熟虑和创造性的方法来替代文本和描述。这项工作之所以可能，是因为几十年来残疾人的思考、写作、梦想和组织塑造了我们对无障碍的总体理解。它与许多其他艺术家和思想家正在进行的关于描述的重要工作并驾齐驱。\n艾斯林·托马斯·艾斯林是一位艺术家，他的作品经常是关于描写的。看看Photophagia，一个截然不同的聚合，以及由三个声音描述的三个窗口。\nAmalle Dublon Amalle是一名研究人员。“艺术报”引用阿马勒的话说：[从创造通道中]获得的是一种厚度，人们不可避免地会爱上这种厚度，因为他们开始沉迷于四处走动或交流的方式，以及这种方式的诗意或编排。这种厚度让他们放慢了脚步。他们在艺术家空间的一次演讲中讨论了类似的主题。\n奥布里·彭尼·奥布里(Aubree Penney Aubree)是一位策展人，他的项目“演讲展示了一把中间的椅子”将音频描述重新想象为一种艺术实践形式。\n烛台烛台是一位诗人。我们对Candystore为Instagram制作的描述工作感到兴奋，邮箱是@agayWhitemale。\n卡门·帕帕莉亚·卡门(Carmen Papalia Carmen)是一位艺术家，她的“社会参与实践是一种努力，目的是忘记视觉至上地位，抵制推动能力主义常态概念的支持选项。”\n钱西舰队钱西是一名图书管理员和技术专家。请看Chancey在无障碍技术中的Talk Dark Pattern。\n乔治娜·克里奇·乔治娜是一名作家和教授。我们喜欢她所写的每一件事，但在表达中描述的音频描述对这个项目来说是特别重要的。\n杰伦·赫尔曼·杰伦是一位跨学科的艺术家。我们受到了杰伦将描述融入舞蹈和表演的方式的影响。\n乔丹勋爵乔丹是一位电影制作人和艺术家，他正在仔细考虑将其描述为视频和电影制作中的一种材料。例如，我能听到我妈妈的声音。\n约书亚·迈勒·约书亚是一名研究员和技术专家。Joshua的项目YouDescribe是该项目的重要参考。\n贾斯汀·艾伦·贾斯汀是一名表演者和作家。我们通过Instagram阅读了贾斯汀的描述，并听说这些描述也是贾斯汀表演的一部分。\n凯拉·汉密尔顿·凯拉是一位运动艺术家和教育家。凯拉的作品“近视：揭开黑暗”彻底改变了我们对音频描述与表演关系的理解。\n动光动光是一家表演艺术公司。动力之光团队一直在思考和梦想描述新的可能性。请看Contra*播客对爱丽丝·谢泼德的采访。\nLiza Sylvestere Liza是一位使用音频描述作为素材的艺术家，例如在音频描述项目中。\n路易丝·希克曼·路易丝是一名活动家和研究员。我们花时间在路易丝的项目“四件物品”上。\n麦迪逊·扎洛帕尼·麦迪逊是一位艺术家、活动家和博物馆教育家。我们喜欢通过Instagram阅读麦迪逊的描述。\n帕克·麦克阿瑟·帕克是一位艺术家。朴槿惠的195个项目彻底改变了我们对有声之旅作用的理解。\nPelenakeke Brown Keke是一位跨学科的艺术家。科克的工作帮助我们理解了分数和运动之间的关系，以及分数也可以用来描述的方式。\n重生服装重生服装是性别不一致的可穿戴设备和配饰，适用于不同性别、大小和能力的人。这个视频通过音乐进行描述，是最有趣/最激动人心的事情！\n回到菜单，我们的博客“Alt-Text Study Club”提供了Alt-Text和图像描述的例子，这样我们就可以相互学习对方的策略和技术，并扩展我们的集体工具包。\n提交Alt-Text以在此处进行特色介绍请访问我们的博客“Alt-Text Study Club”查看更多内容。\n这个网站是为❁Shannon和❀Bojana创建的，是我们之间的合作-我们是设计师和程序员Laurel Schwulst和Taichi Aritomo。\n如您所知，Alt-Text描述图像。但是网站(因为它有视觉形式)也可以被认为是一种图像。下面是我们对该网站的视觉描述：\n本网站以深蓝色为背景，标题为“Alt-Text as Poy”，大而居中。标题下方显示颜色鲜艳的导航按钮(每个部分通过特殊颜色区分)。在按钮下面，欢快地用一圈白色的花朵图标宣布自己的欢迎信息。在整个网站上，更多关于…的鲜花图标随处可见。其他一些装饰图案，如花卉首饰和独特的像素化边框，在每个部分都以各自鲜艳的颜色出现。网站上的所有文本都以高度易读且随处可见的Times New Roman serif字体显示。\n作为网站的创建者，我们想提供一些背景信息。下面你会看到我们的一些文字--为什么网站看起来是这样的，我们制作网站的过程，以及其他一些技术和哲学细节。总体而言，我们的目标是让这个网站变得有吸引力、可访问性、快乐性和经济性。希望您喜欢！\n网站上线时间：2020年6月", "note_en": "If you’d like to listen to this message, we recorded it with our voices:\n       This project is a collaboration between artists Bojana Coklyat and Shannon Finnegan, supported by  Eyebeam and the  Disability Visibility Project.\n  Eyebeam “enables people to think creatively and critically about technology&#39;s effect on society, with the mission of revealing new paths toward a more just future for all.” The Disability Visibility Project “is an online community dedicated to creating, sharing, and amplifying disability media and culture.”\n  We’re excited for you to join us in exploring alt-text and hopefully in the process work towards making online communities more accessible, fun, and welcoming.\n   Back to menu  First off, some context. We,  ❁ Shannon and  ❀ Bojana, are both disabled artists and activists. We met in New York through mutual friends around the time Shannon was first thinking about alt-text. We realized there was a lot of overlap between our interests and decided to jump into this collaborative project.\n      Alt-text is a written description of an image posted online. Alt-text can also be added to images embedded in digital documents (PDFs, Word documents, Google docs, presentations, etc).\n  Alt-text has multiple uses, but we are focused on its role as an essential part of web accessibility.\n  Alt-text allows visual content to be accessible to people who are blind, low vision, or have certain cognitive disabilities.\n  Blind people typically use software called a screen reader to access digital displays. The screen reader goes through the text on the screen and outputs it to a synthetic voice or refreshable braille display. On a website, a screen reader might readout options in the navigation bar, followed by the title, the first paragraph, the second paragraph, etc. When a screen reader encounters an image, it’s unable to “read” it. So instead, it looks for the alt-text — a description of the image embedded in the code — and reads it out. This is how alt-text functions as a non-visual alternative to an image.\n      You can’t see alt-text here because only readable by screen readers or viewable in the source code of this website. But if you, for instance, install this bookmarklet ( Chrome,  Firefox), and mouse over the image, the alt-text displays visually on the screen. It may look something like  this. You can also check out the alt-text by turning on your screen reader (many devices have built-in screen reading software) or by using the &#34;Inspect Element&#34; browser tool.\n       Alt-text has existed since the 1990s, but it is often overlooked altogether or understood solely through the lens of compliance. The resulting alt-text is often written in a reluctant, perfunctory style, but it has tremendous expressive potential.\n  This project reframes alt-text as a type of poetry and provides opportunities to talk about it and practice writing it. We don’t just want alt-text users to be able to access visual content on the internet, we want them to feel a sense of belonging in digital spaces.\n  Both of us are interested in how communities can move towards better and more nuanced approaches to access. Instead of focusing on compliance and doing the minimum, what if we approach access creatively and generously, centering disability culture? How do we make spaces and experiences that disabled people not only  can access but  want to access?\n       Framing alt-text as a type of poetry allows us to approach it with some of the ideas and strategies that have been developed by poets.\n  That said, we’re not interested in producing alt-text poetry that exists outside of making the internet more accessible. We recognize that others have used alt-text and code as inspiration and media for poetry, but for us, increasing website accessibility remains the first and most important condition of alt-text’s poetic potential.\n  Here are three ideas from the world of poetry that we have found to be particularly helpful when writing alt-text:\n  Simply by writing alt-text with thought and care, we shift the process. What words are we using? What are their connotations? What is the tone of our writing (the way in which we’re doing the writing)? What is the voice (who the reader hears)? How do these align with, or contrast, the tone and perspective of the image?\n  People who are new to description have a tendency to over-describe images. While there are times for long and lavish descriptions, alt-text usually aims for brevity. For most images, one to two sentences will do. Poetry has a lot to teach us about paring down language to create something that is expressive, yet concise.\n  We have so much to learn from poetry about being more playful and exploratory in how we write alt-text. We are not interested in experimentation for experimentation’s sake — we want a kind of experimentation that moves towards better and more nuanced accessibility for alt-text users. There are lots of complex and interesting questions that come up when translating visual information into text. We need to try out different ways of doing this, learning from each other&#39;s strategies and techniques.\n       The purpose of this project is not to tell you how to write alt-text. There are many existing resources that provide guidelines and how-tos (you can find a few listed in the  Tools section).\n  Our primary intent is to put alt-text on your radar (if it wasn’t already), to get you thinking about it creatively, and to explore a few of the key questions that come up when translating images into text.\n  We hope what you read and experience here makes clear that, like all accessibility practices, writing alt-text requires ongoing practice, learning, and collaboration.\n  We also want to note that our thinking about alt-text is shifting and changing all the time. And of course, people have lots of different opinions about how to approach alt-text. So take all of this with a grain of salt, seek out alternate viewpoints, and feel free to disagree.\n           I am a visual artist, activist, and scholar. I focused my MA studies on the intersection of Disability Studies and Art Administration. This included an internship at the Whitney Museum of Art in its Access and Community program and participation in the 2018 Kennedy Center International conference on Leadership Exchange in the Arts and Disability. In 2019, I curated Crip Imponderabilia a groundbreaking show for the NYU Gallatin Gallery. I’m also currently on the NYU Advisory Committee for the Kimmel Gallery and have done consulting work for The Whitney, NYU Gallatin Galleries, and the New York Jewish Museum. I have also worked as an artist and grassroots access organizer in the Jersey City community for decades, curating events and exhibits featuring disabled artists. In 2020, I am completing a 2019-2020 Fulbright Research Grant in the Czech Republic, focusing my research on access in the arts for disabled people.\n  I’m a smiley white woman with a chin-length brunette bob. I’m about 5-feet 6-inches, easing into my 40s and usually have my white cane with me when outside. Tonight, I’m wearing a typical outfit of late, a graphic black and white t-shirt, cherry red cardigan and black jeans.\n        I’m a multidisciplinary artist making work about disability culture and accessibility. I’ve done projects with The Banff Centre, Tallinn Art Hall, The Invisible Dog, Friends of the High Line, and the Wassaic Project. I’ve spoken at the Brooklyn Museum, School for Poetic Computation, The 8th Floor, Data &amp; Society, and The Andrew Heiskell Braille and Talking Book Library. In 2018, I received a Wynn Newhouse Award and participated in Art Beyond Sight’s Art + Disability Residency. In 2019, I was a resident at Eyebeam.\n  I’m a 5-foot-2-inch, blond, white person. I’m a fairly small person and I’m in my early 30s, though people often tell me I look younger. My disability affects my walking so I move with a slight wobble. I’m currently writing from home where I’m wearing a blue, gingham PJ-set.\n   Back to menu  We encourage you to engage with the workbook with a friend or colleague. You can do it on your own, but we’ve found participants learn a lot from reading someone else’s alt-text and having a chance to discuss the process.\n  We estimate the full workbook takes between 1.5 and 2.5 hours. Feel free to break up the time, skip sections, or re-order things however you like.\n   Back to menu  As part of this project, we lead Alt-Text as Poetry Workshops with groups.  Email us if you are interested in bringing the workshop to your organization/school/friend group/etc.\n   Back to menu  This project is still in the works but hopefully coming soon! Please check this space again in the future.\n   Back to menu  These are readings and resources that may be helpful as you continue and expand your learning about alt-text.\n  More than Meets the Eye: What Blindness Brings to Art By Georgina Kleege (2017)   This book was foundational to this project and is a wealth of knowledge about the relationship between blindness and visual information.\n  Web Accessibility in Mind  Web AIM is a non-profit focused on expanding web accessibility. Their guide to alt-text is a great overview.\n  Art Beyond Sight&#39;s Verbal Description Training  Art Beyond Sight’s training is geared toward longform description and focused on art. It includes lots of techniques relevant to describing images online.\n  MCA Chicago Guidelines for Describing  MCA Chicago was one of the first big museums (that we know of) to commit to describing all of the images on their website. They have a brief set of guidelines that are an interesting reference point.\n  Rooted in Rights Accessibility Guide  Rooted in Rights is a Seattle-based organization that has done extensive work around creating and promoting accessible media practices.\n  Accessibility in the Arts: A Promise and a Practice By Carolyn Lazard, Commissioned by Recess Art   Accessibility in the Arts: A Promise and a Practice is an accessibility guide geared toward small-scale arts nonprofits and the potentially expansive publics these organizations serve. It details specific ways in which disabled people are excluded from cultural spaces and offers possible solutions to those barriers. Moving away from historical and juridical definitions of accessibility, this guide considers the unique capacity of small scale arts organizations to meet the needs of disabled communities. It engages principles of disability justice to think through what can urgently be done to create more equitable and accessible arts spaces.\n  Access is Love By Mia Mingus, Alice Wong, and Sandy Ho   Access is Love includes both a resource list with a bunch of great readings and guides about accessibility. They also have a list of 10 ways to start creating and expanding access.\n  Browser extensions/add-ons  Firefox extension   Chrome extension   Most devices have a built-in screen reader that you can turn on to check out alt-text as you move around the web. It takes some time to learn how to use a screen reader, so another option is these browser extensions that visually surface the alt-text. It’s an easy way to read other people’s descriptions and get a sense of how few images are described at all.\n   Back to menu  This project is part of an elaborate and rich ecosystem of work around this topic. None of these ideas are new — disabled people have been asking for and producing thoughtful and creative approaches to alt-text and description for a long time. This work is only possible because of the decades of thinking, writing, dreaming, and organizing disabled people have done to shape how we understand access in general. It exists alongside the important work about description that’s being done by many other artists and thinkers.\n          Aislinn Thomas  Aislinn is an artist whose work is often about description. Check out   Photophagia,   A distinct aggregation, and   Three windows described by three voices.\n  Amalle Dublon  Amalle is a researcher. Amalle quoted in  Art Papers: &#34;That gain [from creating access] is a thickness that people inevitably fall in love with, because they become involved with the means of getting around, or communicating, and the poetry or choreography of that means. That thickness slows them down.&#34; They discussed similar themes in a  talk at Artists Space.\n  Aubree Penney  Aubree is a curator who’s project   a speech showed a chair in the middle “reimagines audio description as a form of artistic practice.”\n  Candystore  Candystore is a poet. We are excited about the description work that Candystore produces for Instagram at  @agaywhitemale.\n  Carmen Papalia  Carmen is an artist who’s “socially engaged practice is an effort to unlearn visual primacy and resist support options that promote ableist concepts of normalcy.”\n    Chancey Fleet  Chancey is a librarian and technologist. Check out Chancey’s talk   Dark Patterns in Accessibility Tech.\n    Georgina Kleege  Georgina is a writer and professor. We love everything she’s written, but  Audio Description Described in Representations was especially foundational to this project.\n  Jerron Herman  Jerron is an interdisciplinary artist. We’ve been influenced by the ways Jerron weaves description into dance and performance.\n    Jordan Lord  Jordan is a filmmaker and artist who is carefully considering description as a material in video and filmmaking. For example,   I Can Hear My Mother’s Voice.\n  Joshua Miele  Joshua is a researcher and technologist. Joshua’s project  YouDescribe was an important reference for this project.\n  Justin Allen  Justin is a performer and writer. We read Justin’s descriptions via  Instagram and have heard that description is also part of Justin’s performances.\n  Kayla Hamilton  Kayla is a movement artist and educator. Kayla’s piece   Nearly Sighted: Unearthing the Dark revolutionized our understanding of audio description’s relationship to performance.\n  Kinetic Light  Kinetic Light is a performing arts company. The Kinetic Light team has been thinking and dreaming of new possibilities for description. Check out  this interview with Alice Sheppard on Contra* podcast.\n  Liza Sylvestere  Liza is an artist using audio description as a material, for example in   Audio Description Project.\n  Louise Hickman  Louise is an activist and researcher. We spent time with Louise’s project   Four Objects.\n  Madison Zalopany  Madison is an artist, activist, and museum educator. We love reading Madison’s descriptions via  Instagram.\n  Park McArthur  Park is an artist. Park’s   Projects 195 radicalized our understanding of the role of an audio tour.\n  Pelenakeke Brown  Keke is an interdisciplinary artist. Keke’s work has helped us understand the relationship between score and movement and the ways a score can also function as a description.\n  Rebirth Garments  Rebirth Garments are gender non-conforming wearables and accessories for people on the full spectrum of gender, size and ability.  This video takes on description through music and is the most fun/exciting thing!\n   Back to menu  Our blog “ Alt-Text Study Club” features examples of alt-text and image description so that we can learn from each other’s strategies and techniques, and expand our collective toolkit.\n          Submit alt-text to be featured here    Visit our blog “Alt-Text Study Club” to see more\n     This website, made for and with ❁ Shannon and ❀ Bojana, has been a collaboration between us—we are designers &amp; programmers Laurel Schwulst and Taichi Aritomo.\n  As you know, alt-text describes images. But a website (since it has a visual form) can also be considered a type of image. So here is our visual description of the site:\n  This website has a dark blue background and presents its title, “Alt-Text as Poetry” large and centered at the top. Below the title appear brightly colored navigation buttons (with each section differentiated through a special color). Underneath the buttons, a welcome message cheerfully announces itself with an arc of white flower icons. Throughout the entire site, even more flower icons are sprinkled about… and some other decorative motifs like floral drop caps and unique pixelated borders appear per section in their respective bright colors. All of the text on the site is presented in the highly-legible and widely-available Times New Roman serif font.\n  As the website’s creators, we wanted to provide some context. Below you’ll find some of our writing—why the website looks the way it does, our process of making the website, and some other technical and philosophical details. Overall, we aimed to make this website inviting, accessible, joyful, and economical. We hope you like it!\n       Website launched: June 2020", "posttime": "2020-08-05 14:00:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "alt,text,描述", "title": "作为诗歌的Alt-Text", "title_en": "Alt-Text as Poetry", "transed": 1, "url": "https://alt-text-as-poetry.net", "via": "", "real_tags": ["alt", "text", "描述"]}, {"category": "", "categoryclass": "", "imagename": "886da2f8d942b94fe116981baf8588f4.jpeg", "infoid": 1016345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "民主党参议员理查德·德宾(Richard Durbin)要求美联储(Federal Reserve)调查涉嫌反竞争的做法，这些做法迫使商家支付冠状病毒危机期间由Visa Inc.等大型网络征收的过高借记卡费用。和万事达卡公司(Mastercard Inc.)。\n德宾在致美联储主席鲍威尔(Jerome Powell)的一封信中说，大型信用卡网络和借记卡发行商的做法正在削弱在线支付市场的竞争，给商家造成的损失可能高达数十亿美元。这封信，德宾先生的办公室..。", "note_en": "Democratic Sen. Richard Durbin is asking the Federal Reserve to probe allegedly anticompetitive practices that are forcing merchants to pay excessive debit-card fees levied during the coronavirus crisis by large networks like Visa Inc. and Mastercard Inc.\n  In a letter to Fed Chairman Jerome Powell, Mr. Durbin said practices by the large card networks and debit-card issuers are diminishing competition in the online payments marketplace and costing merchants potentially billions of dollars. The letter, which Mr. Durbin’s office...", "posttime": "2020-08-05 14:00:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德宾,mastercard", "title": "Visa，万事达卡借记费正在损害零售商，参议员理查德·德宾说", "title_en": "Visa, MasterCard Debit Fees Are Hurting Retailers, Sen. Richard Durbin Says", "transed": 1, "url": "https://www.wsj.com/articles/visa-mastercard-debit-fees-are-hurting-retailers-sen-richard-durbin-says-11595669401", "via": "", "real_tags": ["德宾"]}, {"category": "", "categoryclass": "", "imagename": "877aa36087b4f4ac2b82d3e4156f53b8.png", "infoid": 1016344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是关于印度的保险公司，他们对患有既往疾病的客户的行为。如果你不是来自印度，你可能仍然会发现这些内容很有用，因为几乎所有这些公司都与一家大型国际保险公司合作，而你可能与该公司有保单。\n我患有可以最简单地概括为骨相关疾病的疾病，我在2018年7月做了一次大手术，后来病情得到了成功的解决。我一直非常公开自己的健康状况，以提高人们的意识，并支持其他面临此类疾病的人。\n像新冠肺炎大流行期间的许多其他人一样，我申请了医疗保险充值计划，因为我目前的基本计划(大约5年前订阅，早在2018年手术之前)没有必要的覆盖范围，无法补偿私立医院为新冠肺炎治疗收取的费用。\n印度一家私立医院对新冠肺炎的治疗收费是多少？(点击查看.jpg)。\n上面的照片在社交网络上疯传并受到广泛批评后，医院发布了以下推文。(点击查看.jpg)", "note_en": "This is about Insurance companies in India, their behaviour with customers with preexisting illness. Incase you are not from India, you might still find this content useful as almost all of these companies are in tie-up with a major international insurer whom you might have your policy with.\n I’m suffering from what could be best summarised in simple terms as   Bone related diseases, I had a  major surgery in July 2018 for ailments which has since been successfully addressed. I’ve been very open about my health condition to raise awareness and to support others facing such ailments.\n Like many others during this COVID-19 pandemic, I applied for a health insurance top-up plan as my current base plan(subscribed ~5 years ago, much before 2018 surgery) doesn’t have the necessary coverage to compensate for the amount of money private hospitals are charging for COVID-19 treatment.\n How much a private hospital in India charges for COVID-19 treatment?(Click to see the .jpg)\n After the above picture went viral on social networks and received widespread criticism, the hospital released the following tweet.(Click to see the .jpg)", "posttime": "2020-08-05 13:59:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "putting,疾病", "title": "在新冠肺炎期间，保险公司正在将病人和残疾人的生命置于危险之中", "title_en": "Insurers are putting the lives of sick and disabled at risk during COVID-19", "transed": 1, "url": "https://abishekmuthian.com/insurers-are-putting-the-lives-of-sick-and-disabled-at-risk-during-covid-19-pandemic/", "via": "", "real_tags": ["putting", "疾病"]}, {"category": "", "categoryclass": "", "imagename": "25ab75b31e981e7957d1930a32ddd4e3.png", "infoid": 1016343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首页--期刊主要分类--期刊细介绍--期刊题录与文摘--文摘内容。(主编)，Fokkinga，M.M.，&amp；Paterson，R.(1991)。使用香蕉、镜头、信封和带刺铁丝网的函数式编程。124-144。Https://doi.org/10.1007/3540543961_7。\n基于与数据类型定义相关的递归运算符，我们开发了一种用于懒惰函数式编程的演算。对于这些算子，我们导出了在推导和操作程序时有用的各种代数定律。我们将展示Bird and Wadler{#34；}函数式编程简介{#34；}中的所有示例函数都可以使用这些运算符表示。&#34；，\nMeijer，E，Hughes，J(编辑)，Fokkinga，MM&amp；Paterson，R 1991；&#39；&#39；pp.124-144。Https://doi.org/10.1007/3540543961_7。\n使用香蕉、镜头、信封和带刺铁丝网的函数式编程。题名/责任者：Meijer，Erik，Hughes，J.。题名/责任者：[by]J.。\n一九九一年。124-144。\nN2-我们基于与数据类型定义相关的递归运算符，开发了一种用于惰性函数编程的演算。对于这些算子，我们导出了在推导和操作程序时有用的各种代数定律。我们将展示Bird and Wadler‘s&34；函数编程导论中的所有示例函数都可以使用这些运算符表示。\nAB-我们开发了一个基于与数据类型定义相关的递归操作符的懒惰函数式编程演算。对于这些算子，我们导出了在推导和操作程序时有用的各种代数定律。我们将展示Bird and Wadler‘s&34；函数编程导论中的所有示例函数都可以使用这些运算符表示。", "note_en": "Meijer, E., Hughes, J. (Ed.), Fokkinga, M. M., &amp; Paterson, R. (1991).    Functional Programming with Bananas, Lenses, Envelopes and Barbed Wire. 124-144.   https://doi.org/10.1007/3540543961_7\n    abstract = &#34;We develop a calculus for lazy functional programming based on recursion operators associated with data type definitions. For these operators we derive various algebraic laws that are useful in deriving and manipulating programs. We shall show that all example functions in Bird and Wadler&#39;s {&#34;}Introduction to Functional Programming{&#34;} can be expressed using these operators.&#34;,\n  Meijer, E, Hughes, J (ed.), Fokkinga, MM &amp; Paterson, R 1991, &#39; &#39; pp. 124-144.   https://doi.org/10.1007/3540543961_7\n  Functional Programming with Bananas, Lenses, Envelopes and Barbed Wire. / Meijer, Erik; Hughes, J. (Editor); Fokkinga, M.M.; Paterson, Ross.\n 1991. 124-144.\n  N2 - We develop a calculus for lazy functional programming based on recursion operators associated with data type definitions. For these operators we derive various algebraic laws that are useful in deriving and manipulating programs. We shall show that all example functions in Bird and Wadler&#39;s &#34;Introduction to Functional Programming&#34; can be expressed using these operators.\n AB - We develop a calculus for lazy functional programming based on recursion operators associated with data type definitions. For these operators we derive various algebraic laws that are useful in deriving and manipulating programs. We shall show that all example functions in Bird and Wadler&#39;s &#34;Introduction to Functional Programming&#34; can be expressed using these operators.", "posttime": "2020-08-05 13:58:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,镜头", "title": "香蕉、镜头、信封和带刺铁丝网的函数式编程", "title_en": "Functional Programming with Bananas, Lenses, Envelopes and Barbed Wire", "transed": 1, "url": "https://research.utwente.nl/en/publications/functional-programming-with-bananas-lenses-envelopes-and-barbed-w", "via": "", "real_tags": ["编程", "镜头"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "默认情况下，所有响应都是JSON格式。除了JSON，我们还支持XML，很快还支持YAML和CSV。\n你可以使用30多种不同的数据模型，比如车辆、Twitter用户和条纹对象。\n很快，我们也将支持GraphQL。访问100多个型号，并精确指定您需要的数据。\n单击上面的“入门”按钮或访问此处的文档页面。开始只需不到30秒。", "note_en": "By default, all responses are in JSON format. Besides JSON, we support XML, and soon YAML, and CSV.\n  There are over 30 different data models you can play with, like vehicles, twitter users and stripe objects.\n  Soon, we will also supoprt GraphQL. Access more than 100 models and specify exactly what data you need.\n        Click the &#34;Get Started&#34; button above or visit our documentation page   here. It takes less than 30 seconds to get started.", "posttime": "2020-08-05 13:58:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,程序,数据,random,支持", "title": "生成随机假数据并填充您的应用程序以简化开发", "title_en": "Generate random fake data and populate your application for easier development", "transed": 1, "url": "https://random-data-api.com/", "via": "", "real_tags": ["开发", "程序", "数据", "random", "支持"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您已经做了足够长时间的软件工程师，您很可能见过这个浮点背信弃义的例子：\n我们理解这是因为浮点数只有64位精度存储，不能代表整个实数行。此外，当我们使用这些浮点数执行运算时，其表示形式中固有的错误可能会累积并成倍增加。这个故事的寓意是，永远不要用浮点数来代表金钱。\n至少，这是金融应用的寓意所在。在广场，我们用了一大笔钱，我们过得很好。然而，对于大多数有充分理由使用浮点的应用程序来说，这并不是故事的结束。如果浮点数像我曾经认为的那样不可预测、不可靠，我们就不能用数字方法求解微分方程或线性系统，也不能登陆月球。相反，有一门关于浮点误差的科学，它是一般数字误差科学的一部分，它试图驯服和理解误差在我们的计算过程中发生了什么。一般说来，数字误差是可以相当精确地量化的东西，正如我们将看到的。在此过程中，我们将了解浮点算术的基本公理，至少，它听起来比“每个开发人员都应该知道浮点数的10件事”要酷得多。\n从根本上说，浮点数的误差是由“舍入”问题引起的。就像在基数10中一样，我们不能表示数字\\(1/3\\)而不将其舍入到某个位置：\n在以2为基数的情况下，我们不能在不舍入的情况下表示许多数字。当然，有些数字我们可以准确地表示出来。例如，然后是1号。或范围\\((-2^{53}，2^{53})\\)中的任意整数。同样值得注意的是，可以准确地表示许多分数：\n但是，像\\(1/10\\)这样的数字，就像基数10中的\\(1/3\\)一样，必须截断以适合尾数的24位或53位。当我们在控制台或源代码中输入0.1时，实际存储的值与0.1略有不同。根据这个出色的IEEE-754浮点转换器，实际存储的浮点数(对于64位浮点)是。\n所以我们计算的初始输入是有缺陷的！我们不是在计算0.1*3，我们实际上是在计算。\n这个误差有多大？我们可以通过计算有效数字\\(00055\\点0.100\\)之间的零来得出一个概念。在这种情况下，有16个。因此，简单地输入一个不能用浮点数精确表示的数字，我们招致了大约\\(10^{-16}\\)的相对误差。\n事实上，在所有情况下，我们都可以预计会招致大约\\(10^{-16}\\)的相对误差。这个量级称为计算机ε，通常写为\\(\\epsilon_{\\text{MACHINE}}\\)。它来自于两个相继浮点数之间的相对差异。与数字行不同的是，对于每个可表示的浮点数\\(x\\)，都有一个下一个浮点数，它大约是\\(x+\\epsilon_{\\text{Machine}}x\\)。因此，对于任意实数\\(x_0\\)，它落在两个浮点值\\(x\\)和\\(x+\\εx\\)之间(为简明起见，去掉下标)。当我们以浮点形式表示\\(x_0\\)时，我们将获得这两个值中的一个。用\\(\\text{fl}(X_0)\\)表示\\(x_0\\)的浮点表示。绝对误差是。\n\\BEGIN{公式*}e_{\\text{abs}}=|\\text{fl}(X_0)-x_0|\\leq\\max(|x_0-x|，|x_0-(x+\\epsilon x)|)\\leq|\\epsilon x|。\\end{公式*}。\n凉爽的!。所以我们已经看到，在表示浮点数时，我们能做的最差的相对值大约是\\(10^{-16}\\)。这在几乎所有的实际目的中都是非常好的。因为记住，我们说的是相对误差。这意味着我们能够非常准确地表示非常小的值。以下是最接近\\(10^{-20}\\)的浮点数：\n如果你好奇，我邀请你数一下9，一共有16个。即使在处理极小的数字时，我们也保持相同的相对精度。\n现在你可能在想，等等！当我们表示浮点数时，我们可以获得很好的相对精度，这是很好的，但是当我们要对它们做些什么的时候呢？这里我们有两个浮点数，它们都不精确，我们要把它们相乘！谁知道会发生什么事呢？\n这种担心是有根据的，因为浮点运算的算法必须以有限精度实现。如果我们被要求用笔和纸把两个大数相乘，我们大多数人将使用的算法是我们在学校学到的算法，它涉及到大量的加法、进位、减法等运算。如果所有这些中间步骤都使用某种二进制表示法，那么在我们进行的过程中，中间产品可能会失去精度！这看起来像是灾难的秘诀。幸运的是，浮点实现有一个我们可以要求的特性，IEEE-754和大多数其他流行的浮点标准都满足这个特性，这将把我们从完全的无政府状态中拯救出来。这就是Trefeten和Bau，数值线性代数，称为浮点算术的基本公理：\n这意味着对于任意两个浮点数，例如\\(x\\)和\\(y\\)，涉及它们的任何操作都将给出一个浮点结果，该结果在真实结果的因子\\(1+\\epsilon_{\\text{machine}}\\)内。如果我们使用特殊的符号来表示浮点版本，比如说，\\(+\\)，这是最容易理解的。让我们写\\(\\Oplus\\)表示浮点加法，\\(+\\)表示精确加法。那么基本公理告诉我们，\n请记住，\\(x\\)和\\(y\\)完全可以表示为浮点数，但当然它们在数学上也是实数。因此，(x+y)是一个实数(数字线上的点)，它可能不是精确表示的推理点。基本公理告诉我们，假设我们的计算机可以访问数学的无限精度对象\\(x+y\\)，浮点运算\\(\\Oplus\\)不会比简单地尝试将数字\\(x+y\\)表示为浮点值\\(x+y\\)做得更差。\n换句话说，我们通过浮点运算不会产生额外的错误，而不是使用神奇的计算机对我们的浮点值进行精确的运算，然后再转换回浮点。用数学术语来说，\n\\BEGIN{公式*}\\FRAC{\\LEFT|(\\text{fl}(A)\\Oplus\\text{fl}(B))-(a+b)\\right|}{a+b}\\Approx\\frac{\\Left|\\text{fl}(\\text{fl}(A)+\\text{fl}(B))-(a+b)\\right|}{a+b}\\Approx\\epsilon_{\\text{机器}}。\\。\n回想一下，当我们试图用浮点表示\\(A)时，\\(\\text{fl}(A)\\)是我们实际表示的数学数字。因此，第一个分数给出了对浮点表示\\(a\\)和\\(b\\)执行\\(Oplus)运算的相对误差，第二个分数给出了对浮点表示\\(a\\)和\\(b\\)执行精确算术运算\\(+\\)，然后将结果转换为浮点运算的相对误差。\n浮点算术的基本公理使我们能够分析即使复杂的算术运算可能引起的数值误差。为了了解这是如何工作的，让我们考虑一下计算2D向量\\([x，y]\\)的长度的问题。从数学上讲，它的形式是。\n计算有几个阶段，在每个阶段我们都会产生一点数值误差：\n在每一步，我们得到的结果将等于真实结果，乘以某个误差因子\\((1+\\epsilon)\\)，其中每个\\(\\epsilon\\)非常小，在\\(\\epsilon_\\text{机器}\\)的另一端。每个操作可能有不同的错误\\(\\epsilon\\)，但我们将对所有操作使用相同的符号。我们不太关心\\(\\\\ε\\)的精确值，只关心它非常小。\n我们将把这些\\(\\ε\\)通过计算，看看它们是如何影响最终结果的。为了方便起见，我们可以使用特殊的算术规则来操作\\(\\epsilon\\)：\n\\(\\Epsilon^2=0\\)。如果\\(epsilon\\约10^{-16}\\)，则\\(\\epsilon^2\\约10^{-32}\\)如此之小以至于我们决定完全忽略它。\n\\(\\sqrt{1+\\epsilon}=1+\\frac{\\epsilon}{2}-\\frac{\\epsilon^2}{8}+\\cdots=1+\\frac{\\epsilon}{2}\\)。这是通过在点1附近对sqrt进行泰勒展开而得到的。另一种观点是，当\\(x\\)非常接近1时，\\(\\sqrt{x}\\近似x\\)，且\\(\\sqrt{x}\\)在\\(x=1\\)处的图的斜率是\\(1/2)。\n有了这些规则，我们就可以进行误差计算了。红色表达式是每个计算的新误差因子，在下一个表达式中显示为蓝色：\n\\BEGIN{ALIGN*}\\text{fl}(X)&amp；={\\color{red}{(1+\\epsilon)}}x\\text{fl}(Y)&amp；={\\color{red}{(1+\\epsilon)}}y\\text{fl}(X)\\oTimes\\text{fl}(X)&amp；=(1+\\epsilon)\\Left[{\\color{Blue}{(1+\\epsilon)}}^2 x^2\\右]=(1+\\epsilon)^3 x^2\\\\&amp；=(1+3\\epsilon+3\\epsilon^2+\\epsilon^3)x^2\\\\&amp；={\\color{red}{(1+3\\epsilon)}}x^2\\text{fsilon。=(1+\\epsilon)\\Left[{\\color{Blue}{(1+\\epsilon)}}^2 y^2\\右]=(1+\\epsilon)^3 y^2\\\\&amp；=(1+3\\epsilon+3\\epsilon^2+\\epsilon^3)y^2\\&amp；={\\color{red}{(1+3\\epsilon)}}y^2\\[\\text{fl}(X)\\oTimes\\text{fl}(X)]\\oplus[\\text{fl}(Y)\\oTimes\\text{fl}(Y)]&amp；=(1+\\epsilon)\\Left[{\\color{Blue}{(1+3\\epsilon)}}x^2+{\\color{Blue}{(1+3\\epsilon)}}y^2\\right]\\\\&amp；=(1+\\epsilon+3\\epsilon+3\\epsilon^2)[x^2+y^2]\\&amp；={\\color{red}{(1+4\\epsilon)}}(x^2+y^2)\\sqrt[\\text{fl}]{\\text{fl}(X)\\oTimes\\text{fl}(X)\\oplus\\text{fl}(Y)\\oTimes\\text{fl}(Y)}&amp；=(1+\\epsilon)\\sqrt{{\\color{Blue}{(1+。=(1+\\epsilon)\\sqrt{(1+4\\epsilon)}\\sqrt{x^2+y^2}\\&amp；=(1+\\epsilon)(1+2\\epsilon)\\sqrt{x^2+y^2}\\&amp；={\\color{red}{(1+3\\epsilon)}\\sqrt{x^2+y^2}\\end{align*}。\n哟！将我们的误差因素带入计算的所有步骤后，我们发现总的数值误差至多是机器精度的3倍。请记住，这是上限。我们真的不能说实际误差是多少，只能说它不大于\\(3\\epsilon_{\\text{机器}}\\)。\n我们上面所做的误差分析非常随意地操纵了神奇的误差值\\(\\epsilon\\)。我们不必太小心，因为使用这些规则，正值(如\\(x^2)和\\(y^2\\))的乘法和加法是安全的。然而，当我们考虑减法时，我们必须更加小心。假设\\(X\\)和\\(Y\\)是非常大的数，但是它们非常接近：\\(X-Y\\)是小的。让我们试着用浮点数来计算\\(X-Y\\)，看看结果如何。现在我们可能会想写，\n\\BEGIN{ALIGN*}\\text{fl}(X)\\ominus\\text{fl}(Y)&amp；=(1+\\epsilon)[(1+\\epsilon)(X)-(1+\\epsilon)(Y)]\\&amp；=(1+\\epsilon)^2(X-Y)\\&amp；=(1+2\\epsilon)(X-Y)。\\end{Align*}。\n然而，我们不能从减法中提取\\(1+\\ε\\)的因子！我们必须记住，我们只是在假装\\(\\epsilon\\)在这些操作中是相同的。事实上，更准确地说，我们应该写。\n\\BEGIN{ALIGN*}\\text{fl}(X)\\ominus\\text{fl}(Y)&amp；=(1+\\epsilon_\\ominus)[(1+\\epsilon_X)(X)-(1+\\epsilon_Y)(Y)]\\end{Align*}\n为了区分我们在不同步骤得到的误差值。现在，考虑如果\\(\\epsilon_Y=0\\)，但\\(\\epsilon_X\\NEQ 0\\)会发生什么。嗯，那么，\n\\BEGIN{ALIGN*}(1+\\epsilon_X)(X)-(1+\\epsilon_Y)(Y)=X+\\epsilon_X-Y=(X-Y)+\\epsilon_X X.\\end{Align*}。\n上面我们假设(X-Y)很小，但是(X)很大。现在我们已经证明，减去\\(X\\)和\\(Y\\)的浮点表示所产生的误差是\\(\\epsilon_\\text{Machine}X\\)量级的，这可能比\\(\\epsilon_\\text{Machine}\\)大得多！下面是一段Python代码片段来说明：\n我们应该得到0.125，但是最终得到了0.1，误差为25%！这种效应被称为“灾难性抵消”，数值分析人员非常谨慎地设计他们的算法来避免它。\n浮点算术的基本公理为我们分析数值方法提供了一个起点，但这绝不是全部。最好的数值算法有一种称为“向后稳定”的神奇特性，它本质上确保它们准确地解决几乎是正确的问题--它们所解决的问题完全在你想要解决的问题的机器精度之内。这些算法的精确度远远超过它们应有的精确度。一旦你开始使用数值线性代数的算法来求解随时间演变的微分方程，就有了一套完整的科学来确保每个时间步产生的舍入误差不会以指数级膨胀。有了这些工具，我们就可以预测和控制它，而不是被数字误差吓倒。虽然看到你的计算给出几乎完全正确的答案是一种很好的感觉，但计算你得到的误差，并验证它也和预期的一样大，还有一些更令人满意的事情。\n我所知道的关于这些东西的一切，我都是从劳埃德·特雷费森和大卫·鲍尔写的“数值线性代数”这本优秀的书中学到的，还有华盛顿大学无与伦比的安妮·格林鲍姆(Anne Greenbaum)。", "note_en": "If you’ve been a software engineer for long enough, it is very likely that you’ve seen this example of floating point perfidy:\n  We understand that this is due to the fact that floating point numbers, stored with only 64 bits of precision,cannot represent the entire real number line. Moreover, when we perform operations with these floating point numbers,the errors inherent in their representation can accumulate and  multiply. The moral of the story is, never use afloating point number to represent money.\n At least, that is the moral for financial applications. At Square, we used a  long amount_cents, and we got along withour lives. However, for most applications that have a good reason to use floating point, this can’t be the end of thestory. If floating point were the unpredictable, unreliable thing that I once believed it to be, we wouldn’t be able tonumerically solve differential equations, or linear systems, or land on the moon. Rather, there is a science of floatingpoint error, forming part of a science of numerical errors in general, which seeks to tame and understand what happensto errors as they flow through our calculations. In general, numerical error is something that can be rather preciselyquantified, as we’ll see. Along the way we’ll look at the Fundamental Axiom of Floating Point Arithmetic, which, at thevery least, sounds way cooler than “10 things every developer should know about floating point numbers”.\n  Fundamentally, error in floating point is due to the problem of “roundoff”. Just as in base 10, we cannot represent thenumber \\(1/3\\) without rounding it off somewhere:\n  in base 2, we cannot represent many numbers without rounding. Of course, some numbers we  can represent exactly. Thenumber 1, for example. Or any integer in the range \\((-2^{53}, 2^{53})\\). Also notably, many fractions can be exactlyrepresented:\n  However, a number like \\(1/10\\), just like \\(1/3\\) in base 10, must be truncated to fit in the 24 or 53 bits of the mantissa. When we enter  0.1 in a console or in source code, the value that is  actually stored is very slightlydifferent than  0.1. According to this excellent  IEEE-754 Floating Point Converter, the floating point number that isactually stored (for 64-bit floating point) is\n  So the initial input to our calculation was flawed! We weren’t calculating  0.1 * 3, we were actually calculating\n  How much of an error is this? We can get an idea by counting the zeros in between the significantdigits, \\(0.100\\dots 00055\\). In this case, there are 16. So in simply entering a number which is not representableexactly in floating point, we have incurred a relative error of roughly \\(10^{-16}\\).\n Indeed, in  all cases we can expect to incur a relative error of roughly \\(10^{-16}\\). This magnitude is called machineepsilon, often written \\(\\epsilon_{\\text{machine}}\\). It comes from the relative difference between two successivefloating point numbers. Unlike the number line, for every representable floating point number \\(x\\), there is a  nextfloating point number, and it is approximately \\(x + \\epsilon_{\\text{machine}} x\\). So for an arbitrary real number \\(x_0\\),it falls between two floating point values \\(x\\) and \\(x + \\epsilon x\\) (leaving off the subscript for conciseness). When werepresent \\(x_0\\) in floating point, we will get one of these two values. Denote the floating point representationof \\(x_0\\) by \\(\\text{fl}(x_0)\\). The absolute error is\n \\begin{equation*}e_{\\text{abs}} = |\\text{fl}(x_0) - x_0| \\leq \\max(|x_0 - x|, |x_0 - (x + \\epsilon x)|) \\leq |\\epsilon x|.\\end{equation*}\n   Cool! So we’ve seen that the worst we can do, in relative terms, when representing a floating point number, isapproximately \\(10^{-16}\\). This is, for almost all practical purposes,  very good. Because remember, we’re speaking ofa relative error. That means we’re able to represent even very small values, very accurately. Here’s the nearest floating pointnumber to \\(10^{-20}\\):\n  If you’re curious, I invite you to count the 9’s. There are 16 of them. Even when dealing with extremely small numbers,we maintain the same relative precision.\n  Now you might be thinking, wait! It’s all good and well that we can get excellent relative accuracy when  representingfloating point numbers, but what about when we go to  do something with them? Here we’ve got two floating pointnumbers, both of which are inexact, and we’re about to multiply them! Who knows what might happen?\n This concern is well-founded, because the algorithms of floating point arithmetic must be implemented with finiteprecision. If we are asked to multiply two large numbers with pen and paper, the algorithm that mostof us will use is the one we learned in school, which involves lots of addition, carrying, sub-multiplications, and soon. If all of those intermediate steps are using some kind of binary representation, then the intermediate products maybe losing precision as we go along! This seems like a recipe for disaster. Fortunately, there is a property that we canrequire of a floating point implementation, one which is satisfied by IEEE-754 and most other popular floating pointstandards, that will save us from total anarchy. This is what Trefethen and Bau,  Numerical Linear Algebra, refer toas the  Fundamental Axiom of Floating Point Arithmetic:\n  This means that for any two floating point numbers, say \\(x\\) and \\(y\\), any operation involving them will give a floatingpoint result which is within a factor of \\(1 + \\epsilon_{\\text{machine}}\\) of the true result. This is easiest tounderstand if we use a special notation to represent the floating point version of, say, \\(+\\). Let’s write \\(\\oplus\\) todenote floating point addition, and \\(+\\) to denote exact addition. Then the Fundamental Axiom tells us,\n  Remember, \\(x\\) and \\(y\\) are exactly representable as floating point numbers, but of course they are also, mathematically,just real numbers. So \\(x + y\\) is a real number (point on the number line), which  may not be exactly representable infloating point. The Fundamental Axiom is telling us that the floating point operation \\(\\oplus\\) can do no worse thansimply trying to represent the number \\(x + y\\) as a floating point value directly, assuming our computer had access to themathematical, infinite precision object \\(x + y\\).\n Put another way, we incur no extra error by going through floating point arithmetic, than we would by using a magicalcomputer to do exact arithmetic on our floating point values, and then casting back to floating point. In mathematicalterms,\n \\begin{equation*}\\frac{\\left|(\\text{fl}(a) \\oplus \\text{fl}(b)) - (a + b)\\right|}{a + b} \\approx \\frac{\\left|\\text{fl}(\\text{fl}(a) + \\text{fl}(b)) - (a + b)\\right|}{a + b} \\approx \\epsilon_{\\text{machine}}.\\end{equation*}\n Recall that \\(\\text{fl}(a)\\) is the mathematical number we actually represent, when we try to represent \\(a\\) in floatingpoint. So the first fraction gives the relative error from performing \\(\\oplus\\) on the floating point representations of \\(a\\)and \\(b\\), and the second fraction gives the relative error from performing the exact arithmetic operation, \\(+\\), on thefloating point representations of \\(a\\) and \\(b\\), then casting the result to floating point.\n  The Fundamental Axiom of Floating Point Arithmetic allows us to analyze the numerical error that may be incurred by evencomplex arithmetic operations. To see an idea of how this works, let’s consider the problem of computing the length of a2D vector, \\([x, y]\\). Mathematically, this has the form\n  There are several stages to the computation, and at each one we will incur a little bit of numerical error:\n  At each step, the result we get will be equal to the true result, times some error factor \\((1 + \\epsilon)\\), whereeach \\(\\epsilon\\) is very small, on the other of \\(\\epsilon_\\text{machine}\\). Each operation may have a differenterror \\(\\epsilon\\), but we’ll use the same symbol for all of them. We don’t care so much about the exact valueof \\(\\epsilon\\), only that it is very small.\n We’re going to carry these \\(\\epsilon\\) through the computation to see how theyaffect the final result. To make that easier, we can use special rules of arithmetic to manipulate \\(\\epsilon\\):\n \\(\\epsilon^2 = 0\\). If \\(\\epsilon \\approx 10^{-16}\\), then \\(\\epsilon^2 \\approx 10^{-32}\\), which is so small that we justdecide to completely ignore it.\n  \\(\\sqrt{1 + \\epsilon} = 1 + \\frac{\\epsilon}{2} - \\frac{\\epsilon^2}{8} + \\cdots = 1 + \\frac{\\epsilon}{2}\\). This comesfrom doing a Taylor expansion of  sqrt around the point 1. Another way to look at it is that, when \\(x\\) is very closeto 1, \\(\\sqrt{x} \\approx x\\), and the slope of the graph of \\(\\sqrt{x}\\) at \\(x = 1\\) is \\(1/2\\).\n With these rules, we’re ready to do the error calculation. Red expressions are the new error factor for eachcalculation, which appear in blue in the next expression down:\n \\begin{align*}\\text{fl}(x) &amp;= {\\color{red}{(1 + \\epsilon)}} x \\\\\\ \\text{fl}(y) &amp;= {\\color{red}{(1 + \\epsilon)}} y \\\\\\ \\\\\\ \\text{fl}(x) \\otimes \\text{fl}(x) &amp;= (1 + \\epsilon) \\left[ {\\color{blue}{(1 + \\epsilon)}}^2 x^2 \\right] = (1 + \\epsilon)^3 x^2 \\\\\\ &amp;= (1 + 3\\epsilon + 3\\epsilon^2 + \\epsilon^3) x^2 \\\\\\ &amp;= {\\color{red}{(1 + 3\\epsilon)}} x^2 \\\\\\ \\text{fl}(y) \\otimes \\text{fl}(y) &amp;= (1 + \\epsilon) \\left[ {\\color{blue}{(1 + \\epsilon)}}^2 y^2 \\right] = (1 + \\epsilon)^3 y^2 \\\\\\ &amp;= (1 + 3\\epsilon + 3\\epsilon^2 + \\epsilon^3) y^2 \\\\\\ &amp;= {\\color{red}{(1 + 3\\epsilon)}} y^2 \\\\\\ \\\\\\ [\\text{fl}(x) \\otimes \\text{fl}(x)] \\oplus [\\text{fl}(y) \\otimes \\text{fl}(y)] &amp;= (1 + \\epsilon) \\left[ {\\color{blue}{(1 + 3\\epsilon)}} x^2 + {\\color{blue}{(1 + 3\\epsilon)}} y^2 \\right] \\\\\\ &amp;= (1 + \\epsilon + 3\\epsilon + 3\\epsilon^2) [ x^2 + y^2 ] \\\\\\ &amp;= {\\color{red}{(1 + 4\\epsilon)}}(x^2 + y^2) \\\\\\ \\\\\\ \\sqrt[\\text{fl}]{ \\text{fl}(x) \\otimes \\text{fl}(x) \\oplus \\text{fl}(y) \\otimes \\text{fl}(y)} &amp;= (1 + \\epsilon) \\sqrt{{\\color{blue}{(1 + 4\\epsilon)}}(x^2 + y^2)} \\\\\\ &amp;= (1 + \\epsilon)\\sqrt{(1 + 4\\epsilon)} \\sqrt{x^2 + y^2} \\\\\\ &amp;= (1 + \\epsilon)(1 + 2\\epsilon) \\sqrt{x^2 + y^2} \\\\\\ &amp;= {\\color{red}{(1 + 3\\epsilon)}} \\sqrt{x^2 + y^2}\\end{align*}\n Phew! After carrying our error factors through all steps of the calculation, we find that the total numericalerror is at most 3 times the machine precision. Keep in mind, this is an upper bound. We can’t really say anythingabout what the actual error will  be, only that it is not greater than \\(3 \\epsilon_{\\text{machine}}\\).\n  The error analysis we did above was pretty carefree with manipulating the magical error value \\(\\epsilon\\). We didn’t haveto be too careful, because multiplication and addition  of positive values (like \\(x^2\\) and \\(y^2\\)) is safe, using those rules. However, whenwe’re considering subtraction, we have to be much more careful. Suppose \\(X\\) and \\(Y\\) are very large numbers, but thatthey are very close together: \\(X - Y\\) is small. Let’s try to compute \\(X - Y\\) in floating point, and see where we get.Now we might be tempted to write,\n \\begin{align*}\\text{fl}(X) \\ominus \\text{fl}(Y) &amp;= (1 + \\epsilon) [ (1 + \\epsilon) (X) - (1 + \\epsilon) (Y) ] \\\\\\ &amp;= (1 + \\epsilon)^2 (X - Y) \\\\\\ &amp;= (1 + 2\\epsilon) (X - Y).\\end{align*}\n However, we can’t pull out a factor of \\(1 + \\epsilon\\) from the subtraction! We have to remember that we are onlypretending that \\(\\epsilon\\) is the same across these operations. In fact, to be more precise, we should write\n \\begin{align*}\\text{fl}(X) \\ominus \\text{fl}(Y) &amp;= (1 + \\epsilon_\\ominus) [ (1 + \\epsilon_X) (X) - (1 + \\epsilon_Y) (Y) ] \\\\\\ \\end{align*}\n to distinguish between the error values we get at different steps. Now, consider what happens if \\(\\epsilon_Y = 0\\), but\\(\\epsilon_X \\neq 0\\). Well, then,\n \\begin{align*}(1 + \\epsilon_X) (X) - (1 + \\epsilon_Y) (Y) = X + \\epsilon_X X - Y = (X - Y) + \\epsilon_X X.\\end{align*}\n We supposed above that \\(X - Y\\) was small, but \\(X\\) was large. Now we have shown that the error incurred by subtractingthe floating point representations of \\(X\\) and \\(Y\\) is of the order \\(\\epsilon_\\text{machine} X\\), which may be  muchlarger than \\(\\epsilon_\\text{machine}\\)! Here’s a Python snippet to illustrate:\n  We should have gotten  0.1, but ended up getting  0.125, an error of 25%!This effect is known as “catastrophic cancellation”, and numerical analysts arevery careful to design their algorithms so as to avoid it.\n  The Fundamental Axiom of Floating Point Arithmetic gives us a starting point to analyze numerical methods, but it is byno means the whole story. The very best numerical algorithms have a magical property called “backwards stability”, whichessentially ensures that they  exactly solve a problem which is  almost the correct problem–the problem they solveexactly is within machine precision of the problem you meant to solve. These algorithms are far more accurate than theyhave any right to be. Once you start to use the algorithms of numerical linear algebra to solve differential equationsthat evolve in time, there is a whole science of ensuring that the roundoff error incurred at each time step does notblow up exponentially. With these tools, rather than be intimidated by numerical error, we can anticipate and controlit. While seeing your calculation give almost exactly the right answer is a good feeling, there is something even moresatisfying about computing the error you got, and verifying that it, too, is exactly as large as expected.\n Everything I know about this stuff, I learned from the excellent book   Numerical Linear Algebra, by Lloyd Trefethen andDavid Bau, as well as the inimitable  Anne Greenbaum of the University of Washington.", "posttime": "2020-08-05 13:33:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基本,axiom,浮点", "title": "浮点运算的基本公理", "title_en": "The Fundamental Axiom of Floating Point Arithmetic", "transed": 1, "url": "http://www.johnbcoughlin.com/posts/floating-point-axiom/", "via": "", "real_tags": ["基本", "axiom", "浮点"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我上一次写这篇文章是在4月份，讲述了我在加速Rust编译器方面所做的工作。又到了更新的时间了。\n首先是流程改变：我已经开始每周进行性能分类。每周二，我都会查看过去一周合并的所有公关的业绩结果。对于性能下降或提高了不可忽略的每个PR，我都会向PR添加一条注释，并提供指向测量结果的链接。我还将这些结果收集到一份每周报告中，本周的“锈”杂志中提到了这一点，并在每周的编译器团队会议上进行了研究。\n这样做的目标是确保快速捕获倒退并采取适当的操作，并提高对总体性能问题的认识。每次大约需要45分钟。说明书的编写方式是任何人都可以做的，尽管新手需要一些练习才能适应这个过程。我已经开始分享这项任务，马克·鲁斯科夫(Mark Rousskov)正在进行最近的分诊。\n这一流程变化的灵感来自尼基塔·波波夫(又名尼基塔·波波夫)的一篇优秀的BLOST帖子中的“防止倒退”一节。Nikic)，关于他们一直在做的提高LLVM速度的工作。(这个过程还借鉴了我几年前领导Project Uptime时建立的Firefox Nighly Crash分类的一些想法。)。\nLLVM的速度直接影响到rustc的速度，因为rustc使用的是LLVM作为后端。这在实践中是一件大事。升级到LLVM10导致了rustc的一些显著的性能倒退，尽管几乎在同一时间有足够的其他性能改进，相关的rustc版本总体上仍然更快。然而，多亏了Nikic的工作，升级到LLVM 11将夺回升级到LLVM 10时损失的大部分性能。\n似乎LLVM的性能在过去可能没有受到太多关注，所以我很高兴看到这个新的关注点。有条不紊的绩效工作需要大量的时间和精力，从长远来看，不是一个人就能有效地完成的。我强烈建议那些从事LLVM工作的人将这作为一个团队工作，并且任何有相关技能和/或兴趣的人都可以参与进来。\n对rustc-perf也进行了一些重大改进，rustc-perf是驱动perf.rust-lang.org的性能套件和工具，也用于本地基准测试和评测。\n#683：本地基准测试和性能分析命令的命令行界面很难看，令人困惑，以至于有人在Zulip上提到他们尝试使用它们，但都失败了。我们真的希望人们进行本地基准测试和分析，所以我提交了这个问题，然后实现了PR#685和#687来修复它。为了让您对改进有一个了解，下面显示了对整个套件进行基准测试的最小命令。\n#旧目标/发布/收集器--db&lt；DB&gt；BENCH_LOCAL--rustc&lt；RUSTC&gt；--Cargo&lt；Cargo&gt；&lt；ID&gt；#新目标/发布/收集器BENCH_LOCAL&lt；RUSTC&lt；ID&gt；\n#675：Joshua Nelson增加了对Rustdoc基准测试的支持。这很好，因为Rustdoc的性能在过去很少受到关注。\n#699、#702、#727、#730：这些PR为本地基准测试和性能分析命令添加了一些适当的CI测试，这些命令有被无意破坏的历史。\nMark Rousskov还对rustc-perf做了许多小改进，包括减少运行套件所需的时间，以及改进状态信息的表示。\n去年我写了关于内联和代码膨胀的文章，以及它们如何对编译时间产生重大影响。我提到过测量代码大小的工具会很有帮助。因此，我很高兴了解到非常棒的Cargo-llvm-line，它测量每个函数生成了多少行LLVM IR。结果可能会令人惊讶，因为泛型函数(特别是像vec：：ush()、option：：map()和result：：map_err()这样的公共函数)可以在单个机箱中被实例化数十次甚至数百次。\n#15：这个PR增加了Cargo-llvm-line输出的百分比，从而更容易判断每个函数对代码总量的贡献有多重要。\n#20、#663：这些PR在rustc-perf中添加了对Cargo-llvm-line的支持，这使得测量为标准基准生成的LLVM IR变得容易。\n#72013：rawVec：：Growth()是由vec：：Push()调用的函数。它是一个很大的泛型函数，处理与向量增长有关的各种情况。此PR将大多数非泛型代码移到单独的非泛型函数中，可获得高达5%的收益。\n(即使在那次PR之后，测量显示向量增长代码仍然占据了不小的代码量，而且感觉还有进一步改进的空间。我做了几次尝试，试图进一步改进它，但都失败了：#72189，#73912，#75093，#75129。即使它们减少了LLVM IR生成的量，它们也是性能损失。我怀疑这是因为这些额外的更改影响了其中一些函数的内联，这可能会很热门。)。\n#72166：这份PR为切片添加了一些专门的迭代器方法(for_each()，all()，any()，find()，find_map())，在clap-rs上赢得了高达9%的胜利，在其他各种基准上赢得了高达2%的胜利。\n#72139：此PR为Iterator：：Fold()添加了一个直接实现，取代了调用更通用的Iterator：：Try_Fold()的旧实现。在几个基准上，这赢得了高达2%的胜利。\n#73882：此PR简化了RawVec：：Allocation_in()中的代码，在众多基准测试中赢得了高达1%的支持。\nCargo-llvm-line对应用程序/机箱作者也很有用。例如，Simon Sapin设法将Servo中最大的板条箱的编译速度提高了28%！使用Cargo安装它，安装Cargo-llvm-line，然后使用Cargo llvm-line(用于调试版本)或Cargo llvm-line--release(用于发布版本)运行它。\n#71942：此PR将LocalDecl类型从128byte缩小到56byte，将一些基准测试的峰值内存使用率降低了几个百分点。\n#72227：如果您将多个元素推送到一个空的vec上，它必须重复重新分配内存。所使用的增长战略产生了以下容量序列：0、1、2、4、8、16等。“微小的VEC是愚蠢的”，所以这个PR在大多数情况下将其更改为0、4、8、16等，这使得rustc本身完成的分配数量减少了10%或更多，并将许多基准测试的速度提高了高达4%。理论上，此更改可能会增加内存使用量，但实际上并非如此。\n#74310：此PR将SparseBitSet更改为使用数组VEC而不是SmallVEC作为其存储，这是可能的，因为预先知道最大长度，对于高达1%的WIND。\n#75133：此PR消除了结构中的两个字段，这两个字段仅在内部编译器错误的情况下用于打印错误消息，WINS高达2%。\n自从我上一篇博客文章以来，编译时间的变化好坏参半(表、图)。没有像上次那样在表格结果中看到一片绿色的海洋，这是令人失望的，而且还有许多似乎令人担忧的倒退。但这并不像乍看起来的那么糟糕！要理解这一点，需要稍微了解基准测试套件的细节。\n大多数出现较大百分比回归的基准都是极短时间运行的。(基准测试说明有助于使这一点更加清晰。)。例如，HelloWorld的非增量检查构建从0.03s变为0.08s。(#70107和#74682是两个主要原因。)。在实践中，当许多板条箱需要几秒钟或几十秒来编译时，每个板条箱几毫秒的微小额外开销将不会被注意到。\n在“现实世界”基准中，一些基准的结果好坏参半(例如regex、ripgrep)，而另一些则有明显的改进，其中一些改进幅度很大(例如clap-rs、style-server、webrender、webrender-wench)。\n考虑到所有这些，从我上一篇文章开始，对于大多数实际情况，编译器可能要么不慢，要么稍微快一点。\n另一个关于长期生锈速度的有趣数据点来自Hacker News：一个项目(Lewton)的编译速度在过去三年中快了2.5倍。\nLLVM11还没有落地，所以这很快就会给现实世界的案例带来很大的改进。希望在我的下一篇帖子中，结果会更加一致地积极。", "note_en": "I last wrote  in April about my work on speeding up the Rust compiler. Time for another update.\n  First up is a process change: I have started doing  weekly performance triage. Each Tuesday I have been looking at the performance results of all the PRs merged in the past week. For each PR that has regressed or improved performance by a non-negligible amount, I add a comment to the PR with a link to the measurements. I also gather these results into a weekly report, which is mentioned in  This Week in Rust, and also looked at in the weekly compiler team meeting.\n The goal of this is to ensure that regressions are caught quickly and appropriate action is taken, and to raise awareness of performance issues in general. It takes me about 45 minutes each time. The  instructions are written in such a way that anyone can do it, though it will take a bit of practice for newcomers to become comfortable with the process. I have started sharing the task around, with Mark Rousskov doing the most recent triage.\n This process change was inspired by the “Regressions prevented” section of  an excellent blost post from Nikita Popov (a.k.a. nikic), about the work they have been doing to improve the speed of LLVM. (The process also takes some ideas from the  Firefox Nightly crash triage that I set up a few years ago when I was leading  Project Uptime.)\n The speed of LLVM directly impacts the speed of rustc, because rustc uses LLVM for its backend. This is a big deal in practice. The upgrade to LLVM 10 caused some  significant performance regressions for rustc, though enough other performance improvements landed around the same time that the relevant rustc release was still faster overall. However, thanks to nikic’s work, the upgrade to LLVM 11 will  win back much of the performance lost in the upgrade to LLVM 10.\n It seems that LLVM performance perhaps  hasn’t received that much attention in the past, so I am pleased to see this new focus. Methodical performance work takes a lot of time and effort, and can’t effectively be done by a single person over the long-term. I strongly encourage those working on LLVM to make this a team effort, and anyone with the relevant skills and/or interest to get involved.\n  There have also been some major improvements to  rustc-perf, the performance suite and harness that drives  perf.rust-lang.org, and which is also used for local benchmarking and profiling.\n #683: The command-line interface for the local benchmarking and profiling commands was ugly and confusing, so much so that one person mentioned on Zulip that they tried and failed to use them. We  really want people to be doing local benchmarking and profiling, so I filed this issue and then implemented PRs  #685 and  #687 to fix it. To give you an idea of the improvement, the following shows the minimal commands to benchmark the entire suite.\n # Old\rtarget/release/collector --db &lt;DB&gt; bench_local --rustc &lt;RUSTC&gt; --cargo &lt;CARGO&gt; &lt;ID&gt;\r \r# New\rtarget/release/collector bench_local &lt;RUSTC&gt; &lt;ID&gt;\n  #675: Joshua Nelson added support for benchmarking rustdoc. This is good because rustdoc performance has received little attention in the past.\n #699,  #702,  #727,  #730: These PRs added some proper CI testing for the local benchmarking and profiling commands, which had a history of being unintentionally broken.\n Mark Rousskov also made many small improvements to rustc-perf, including reducing the time it takes to run the suite, and improving the presentation of status information.\n  Last year I wrote about  inlining and code bloat, and how they can have a major effect on compile times. I mentioned that tooling to measure code size would be helpful. So I was happy to learn about the wonderful  cargo-llvm-lines, which measures how many lines of LLVM IR generated for each function. The results can be surprising, because generic functions (especially commons ones like  Vec::push(),  Option::map(), and  Result::map_err()) can be instantiated dozens or even hundreds of times in a single crate.\n  #15: This PR added percentages to the output of cargo-llvm-lines, making it easier to tell how important each function’s contribution is to the total amount of code.\n #20,  #663: These PRs added support for cargo-llvm-lines within rustc-perf, which made it easy to measure the LLVM IR produced for the standard benchmarks.\n #72013:  RawVec::grow() is a function that gets called by  Vec::push(). It’s a large generic function that deals with various cases relating to the growth of vectors. This PR moved most of the non-generic code into a separate non-generic function, for wins of up to 5%.\n (Even after that PR, measurements show that the vector growth code still accounts for a non-trivial amount of code, and it feels like there is further room for improvement. I made several failed attempts to improve it further:  #72189,  #73912,  #75093,  #75129. Even though they reduced the amount of LLVM IR generated, they were performance losses. I suspect this is because these additional changes affected the inlining of some of these functions, which can be hot.)\n #72166: This PR added some specialized  Iterator methods  ( for_each(),  all(),  any(),  find(),  find_map()) for slices, winning up to 9% on  clap-rs, and up to 2% on various other benchmarks.\n #72139: This PR added a direct implementation for  Iterator::fold(), replacing the old implementation that called the more general  Iterator::try_fold(). This won up to 2% on several benchmarks.\n #73882: This PR streamlined the code in  RawVec::allocate_in(), winning up to 1% on numerous benchmarks.\n cargo-llvm-lines is also useful to application/crate authors. For example, Simon Sapin managed to  speed up compilation of the largest crate in Servo by 28%! Install it with  cargo install cargo-llvm-lines and then run it with  cargo llvm-lines (for debug builds) or  cargo llvm-lines --release (for release builds).\n  #71942: this PR shrunk the  LocalDecl type from 128 bytes to 56 bytes, reducing peak memory usage of a few benchmarks by a few percent.\n #72227: If you push multiple elements onto an empty  Vec it has to repeatedly reallocate memory. The growth strategy in use resulted in the following sequence of capacities: 0, 1, 2, 4, 8, 16, etc. “Tiny vecs are dumb”, so this PR changed it to 0, 4, 8, 16, etc., in most cases, which reduced the number of allocations done by rustc itself by 10% or more and sped up many benchmarks by up to 4%. In theory, the change could increase memory usage, but in practice it doesn’t.\n  #74310: This PR changed  SparseBitSet to use an  ArrayVec instead of a  SmallVec for its storage, which is possible because the maximum length is known in advance, for wins of up to 1%.\n #75133: This PR eliminated two fields in a struct that were only used in the printing of an error message in the case of an internal compiler error, for wins of up to 2%.\n  Since my last blog post, changes in compile times have been mixed ( table,  graphs). It’s disappointing to not see a sea of green in the table results like last time, and there are many regressions that seem to be alarming. But it’s not as bad as it first seems! Understanding this requires knowing a bit about the details of the benchmark suite.\n Most of the benchmarks that saw large percentage regressions are extremely short-running. (The  benchmark descriptions help make this clearer.) For example a non-incremental check build of  helloworld went from 0.03s to 0.08s.  ( #70107 and  #74682) are two major causes.) In practice, a tiny additional overhead of a few 10s of milliseconds per crate isn’t going to be noticeable when many crates take seconds or tens of seconds to compile.\n Among the “real-world” benchmarks, some of them saw mixed results (e.g.  regex,  ripgrep), while some of them saw clear improvement, some of which were large (e.g.  clap-rs,  style-servo,  webrender,  webrender-wrench).\n With all that in mind, since my last post, the compiler is probably either no slower or somewhat faster for most real-world cases.\n Another interesting data point about the speed of rustc over the long-term came from Hacker News: compilation of one project ( lewton) got  2.5x faster over the past three years.\n LLVM 11 hasn’t landed yet, so that will give some big improvements for real-world cases soon. Hopefully for my next post the results will be more uniformly positive.", "posttime": "2020-08-05 13:07:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,2020,编译,进一步提高,性能", "title": "如何在2020年内进一步提高Rust编译器的速度", "title_en": "How to speed up the Rust compiler some more in 2020", "transed": 1, "url": "https://blog.mozilla.org/nnethercote/2020/08/05/how-to-speed-up-the-rust-compiler-some-more-in-2020/", "via": "", "real_tags": ["rust", "2020", "编译", "进一步提高", "性能"]}, {"category": "", "categoryclass": "", "imagename": "e987a985631b8586fcf100959543744c.png", "infoid": 1016339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面向组织和个人的开源密码管理器Bitwarden今天宣布，备受期待的单点登录(SSO)功能将于2020年9月推出。\n带SSO的Bitwarden登录功能将密码安全与基于身份的单点登录集成在一起。现在，用户可以通过其现有身份提供商进行身份验证，并获得访问所有Bitwarden密码管理功能的权限。此安全功能还为管理员和最终用户带来了新的优势：\nBitwarden Login with SSO通过与任何使用SAML 2.0或OpenID Connect的现有SSO解决方案集成，为组织提供了身份管理的终极灵活性。\n新功能将包含在更新的企业计划中。随着这个即将发布的版本，Bitwarden正在更新订阅计划，以便为所有用户提供更多功能和价值。有关计划功能和定价的更多信息，请阅读此处。\n单点登录(SSO)是访问SaaS应用程序的用户身份验证服务。通过SSO，员工可以使用一组凭据(如用户名和密码)安全地访问多个应用程序。要使用SSO系统，应用程序必须支持SSO集成协议。\n虽然SSO支持在企业SaaS应用程序中很常见，但许多在线服务不支持SSO。要安全地访问这些在线服务，员工必须设计自己的方法来确保密码安全，这会造成潜在的威胁和隐藏的漏洞。密码管理解决方案缩小了这一差距。\n使用Bitwarden Login with SSO，企业可以应用其现有的单点登录安全控制来访问Bitwarden Vault中基于密码的应用程序，因此，员工可以获得针对其所有在线体验的端到端密码保护。\nBitwarden Login with SSO为员工高效、安全地在线操作提供了企业所需的安全基础。\n与其他没有SSO集成或强制企业使用专有SSO服务和身份解决方案的密码管理器不同，Bitwarden允许公司将密码管理与现有的、基于标准的身份访问解决方案统一起来。\n这种集成提供了两全其美的效果，因为企业可以方便地扩展其身份管理，同时将密码管理部署到每个人。\n虽然使用SSO登录是使用Bitwarden的一个关键原因，但还有许多其他显著的优点。\n开源：Bitwarden采用开源方法来增强用户信任，提供透明度和简单的检查来验证代码质量。开源软件也为充满活力和参与度的Bitwarden社区奠定了基础。\n自托管选项：特定行业和公司需要自托管解决方案来实现安全性或合规性。Bitwarden提供内部部署或私有云中的自托管服务。\n跨平台功能：Bitwarden支持所有主要浏览器、操作系统和移动设备，以及面向开发人员的命令行界面和强大的API。\n完整的云产品：企业用户可以将Bitwarden实施为云服务，包括使用SSO登录功能，并确保所有数据都使用端到端加密进行保护。\n要了解有关Bitwarden的更多信息，或者开始使用组织或个人帐户，请访问bitwarden.com。", "note_en": "Bitwarden, the open source password manager for organizations and individuals, today announced the highly anticipated Login with Single Sign-On (SSO) capability will be available in September 2020.\n The Bitwarden Login with SSO feature integrates password security with identity-based single sign-on. Now users can authenticate through their existing identity provider and gain access to all Bitwarden password management capabilities. This security feature also introduces new advantages for administrators and end-users:\n  Bitwarden Login with SSO gives organizations the ultimate flexibility for identity management by integrating with any existing SSO solution that uses SAML 2.0 or OpenID Connect.\n The new feature will be included on an updated Enterprise Plan. With this coming release, Bitwarden is updating subscription plans to incorporate more functionality and value for all users. For more information about Plan features and pricing, read  here.\n  Single sign-on (SSO) is a user authentication service to access SaaS applications. With SSO, employees are able to use one set of credentials, such as a username and password, to securely access multiple applications. To work with SSO systems, applications must support an SSO integration protocol.\n While SSO support is common for enterprise SaaS applications, many online services do not support SSO. To access these online services securely, employees must devise their own methods to keep passwords safe, creating potential threats and hidden vulnerabilities. Password management solutions close this gap.\n With Bitwarden Login with SSO, enterprises apply their existing single sign-on security controls to access password-based applications in the Bitwarden Vault, and as a result, employees gain end-to-end password protection for all of their online experiences.\n  Bitwarden Login with SSO delivers the secure foundation enterprises need for employees to operate efficiently and safely online.\n Unlike other password managers that have no SSO integration, or that force businesses to use proprietary SSO services and identity solutions, Bitwarden allows companies to unite password management with existing, standards-based identity access solutions.\n This integration delivers the best of both worlds as enterprises conveniently extend their identity management while deploying password management to everyone.\n While login with SSO is a key reason to use Bitwarden, there are many other notable advantages.\n Open-source: Bitwarden takes an open source approach to enhance user trust, offering transparency and easy scrutiny to validate code quality. Open source software also sets the foundation for a vibrant and engaged Bitwarden community.\n  Self-host option: Select industries and companies need self-hosted solutions for security or compliance. Bitwarden offers self-hosting on-premises or in a private cloud.\n  Cross-platform functionality: Bitwarden supports all major browsers, operating systems, and mobile devices, along with a command line interface and robust API for developers.\n  Complete Cloud offering: Enterprise users can implement Bitwarden as a cloud service, including the Login with SSO feature, with the assurance that all data is secured with end-to-end encryption.\n To learn more about Bitwarden, or to get started with an organization or individual account, visit  bitwarden.com.", "posttime": "2020-08-05 13:06:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,宣布,announces,bitwarden", "title": "Bitwarden宣布将密码安全与基于身份的单点登录集成在一起", "title_en": "Bitwarden Announces Integrated Password Security with Identity-Based SSO", "transed": 1, "url": "https://bitwarden.com/blog/post/bitwarden-password-manager-login-with-sso/", "via": "", "real_tags": ["密码", "宣布", "announces", "bitwarden"]}, {"category": "", "categoryclass": "", "imagename": "e07296017158bc8ef5530a0281e6ba00.jpg", "infoid": 1016338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以印度为例。在当地的移动市场，两轮和三轮汽车开始成为迅速扩大的中产阶级的热门选择，他们正在寻找更负担得起的选择。电动汽车版本很受欢迎，因为与汽油替代品相比，它们的维护成本更低，可靠性更高。\n只有一个问题，这也是每个试图从汽油转换为电动的国家都面临的问题：如何建设充电站网络，使这些车辆可以在车库以外的小范围内使用？\n这是典型的先有鸡还是先有蛋的问题。你需要电动汽车才能在充电站赚钱，但在电动汽车普及之前，你负担不起建造充电站的费用。一些初创公司试图首先自己建设这些网络。也许最著名的例子是Better Place，这是一家以色列初创公司，在2013年死于负现金流之前，筹集了8亿美元的风险投资。特斯拉试图通过创建一个超级增压器网络来解决这个问题，既是鸡又是蛋。\n这就是Statiq如此有趣的原因。该公司总部位于新德里郊区古鲁格拉姆(Gurugram)，正在使用多收入模式启动一个电动汽车充电网络，希望这将使其能够避免其他充电网络所面临的财务挑战。它在当前的Y Combinator批次中，并将在本月晚些时候的演示日上展示。\n该公司的联合创始人阿克利特·班萨尔和拉格哈夫·阿罗拉之前曾合作担任顾问，并创建了一家在线购买照片的公司，最终月度活跃人数达到5万人。他们决定转向电动汽车，特别是充电设备。\n“我们觉得有必要对气候做些什么，因为我们住在德里，德里是世界上污染最严重的城市之一，而印度是世界上很多污染城市的家园。所以我们想为此做点什么。“班萨尔说。当他们研究污染的原因时，他们了解到汽车尾气是当地问题的一大部分。他们寻找了替代方案，但电动汽车充电站在全国范围内基本上仍然不存在。\n因此，他们于2019年10月成立了Statiq，并于今年5月正式推出。他们已经在德里、班加罗尔、孟买和周边地区安装了150多个充电站。\n不过，让我们来谈谈经济问题，因为对我来说，这是他们故事中最吸引人的部分。正如我所说，Statiq有一种多收入模式。首先，终端用户向Statiq购买使用网络的订阅，然后用户支付每个收费会话的费用。这笔会话费在Statiq和物业所有者之间平分，给安装车站的房东带来了额外的收入增长。\n当谈到安装时，Statiq有几个诀窍。首先，根据Bansal的说法，该公司的充电设备的成本大约是美国设备同等成本的三分之一。这使得获得基础技术的成本更低。在那里，该公司与房东谈判安装事宜，房东将支付固定的安装费用，以换取持续的时段费用。\n最重要的是，充电站上有广告，提供了另一种收入来源，特别是在购物中心等知名度高的地点，这对成功的电动汽车充电网络至关重要。\n简而言之，Statiq不必花费资金来安装充电设备-而且在今年早些时候向YC申请之前，他们已经能够自举了。Bansal表示，在加入他们的YC批次之前，该公司在其平台上有数十个充电站和数千个付费会话，“我们现在每周增长20%。”\n下一个是什么？这一切都是关于刻意的缩放。印度的电动汽车市场正在启动，Statiq希望成为那些汽车所在的地方。班萨尔和他的联合创始人希望乘势而上，继续建设关键的基础设施。印度政府可能会继续提供帮助：它批准了数十亿美元的电动汽车和充电站激励措施，将经济进一步推向清洁汽车的未来。", "note_en": "Take India for instance. In the local mobility market,  two- and three-wheel vehicles are starting to emerge as a popular option for a rapidly expanding middle class looking for more affordable options. EV versions are popular thanks to their reduced maintenance costs and higher reliability compared to gasoline alternatives.\n   There’s just one problem, and it’s the same one faced by every country which has attempted to convert from gasoline to electric: how do you build out the charging station network to make these vehicles usable outside a small range from their garage?\n It’s the classic chicken-and-egg problem. You need EVs in order to make money on charging stations, but you can’t afford to build charging stations until EVs are popular. Some startups have attempted to build out these networks themselves first. Perhaps the most famous example was Better Place,  an Israeli startup that raised $800 million in venture capital before dying from negative cash flow back in 2013. Tesla has attempted to solve the problem by being both the chicken and egg by creating a network of  Superchargers.\n That’s what makes  Statiq so interesting. The company, based in the New Delhi suburb of Gurugram, is bootstrapping an EV charging network using a multi-revenue model that it hopes will allow it to avoid the financial challenges that other charging networks have faced. It’s in the current Y Combinator batch and will be presenting at Demo Day later this month.\n Akshit Bansal and Raghav Arora, the company’s co-founders, worked together previously as consultants and built a company for buying photos online, eventually reaching 50,000 monthly actives. They decided to make a pivot — a hard pivot really — into EVs and specifically charging equipment.\n  “We felt the need to do something about the climate because we were living in Delhi and Delhi is one of the most polluted cities in the world, and India is home to a lot of the polluted cities in the world. So we wanted to do something about it,” Bansal said. As they researched the causes of pollution, they learned that automobile exhaust represented a large part of the problem locally. They looked at alternatives, but EV charging stations remain basically non-existent across the country.\n Thus, they founded Statiq in October 2019 and officially launched this past May. They have installed more than 150 charging stations in Delhi, Bangalore, and Mumbai and the surrounding environs.\n Let’s get to the economics though, since that to me is the most fascinating part of their story. Statiq as I noted has a multi-revenue model. First, end users buy a subscription from Statiq to use the network, and then users pay a fee per charging session. That session fee is split between Statiq and the property owner, giving landlords who install the stations an incremental revenue boost.\n  When it comes to installation, Statiq has a couple of tricks up its sleeves. First, the company’s charging equipment — according to Bansal — costs roughly a third of the equivalent cost of U.S. equipment. That makes the base technology cheaper to acquire. From there, the company negotiates installations with landlords where the landlords will pay the fixed costs of installation in exchange for that continuing session charge fee.\n On top of all that, the charging stations have advertising on them, offering another income stream particularly in high-visibility locations like shopping malls which are critical for a successful EV charging network.\n In short, Statiq hasn’t had to outlay capital in order to put in place their charging equipment — and they were able to bootstrap before applying to YC earlier this year. Bansal said the company had dozens of charging stations and thousands of paid sessions on its platform before joining their YC batch, and “we are now growing 20% week-over-week.”\n What’s next? It’s all about deliberate scaling. The EV market is turning on in India, and Statiq wants to be where those cars are. Bansal and his co-founder are hoping to ride the wave, continuing to build out critical infrastructure along the way. India’s government will likely continue to help:  its approved billions of dollars in incentives for EVs and for charging stations, tipping the economics even further in the direction of a clean car future.", "posttime": "2020-08-05 12:42:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支持,backed,电动汽车", "title": "\nYC支持的Statiq希望引导印度的电动汽车充电网络", "title_en": "\n\t\t\t\tYC-backed Statiq wants to bootstrap India’s EV charging network\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/04/yc-backed-statiq-wants-to-bootstrap-indias-ev-charging-network/", "via": "", "real_tags": ["支持", "backed", "电动汽车"]}]