[{"category": "", "categoryclass": "", "imagename": "988c5d69fc8d994821b57cccbd3326c2.png", "infoid": 1069293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "浏览器中的 Blockly 允许网页包含用于 Blockly 支持的五种编程语言中的任何一种或您自己的可视化代码编辑器。在 Blockly Games 中，如图所示，用户可以使用右侧的 Blockly 编辑器解决迷宫问题。我们有大约 80 名 Blockly 社区成员参加了 16 场关于 Blockly 及其应用的技术讲座。", "note_en": "Blockly in a browser allows web pages to include a visual code editor for any of Blockly&#39;s five supported programming languages, or your own. In Blockly Games, pictured here, users can solve a maze using Blockly&#39;s editor on the right.\n  We had around 80 members of the Blockly community attend with 16 tech talks on Blockly and its applications.", "posttime": "2021-07-24 07:03:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,可视化,programming,编程,javascript", "title": "用于构建可视化编程编辑器的 JavaScript 库", "title_en": "A JavaScript library for building visual programming editors", "transed": 1, "url": "https://developers.google.com/blockly", "via": "", "real_tags": ["java", "可视化", "编程"]}, {"category": "", "categoryclass": "", "imagename": "480c58ea61ab85a6d10a67ed1eb20050.png", "infoid": 1069292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你的眼睛不会欺骗你。从 5.0-14690 开始，Dolphin 现在直接内置了 mGBA，作为处理 Game Boy Advance 与 GameCube 游戏连接的新方法。对于那些不知道的人来说，mGBA 是这个时代最著名、最准确的 GBA 模拟器，并且自问世以来一直在迅速改进。最近，我们写了关于 mGBA 添加对我们的 TCP GBA 协议的支持，但这是全新的东西。通过 bonta 完成的集成和同步工作，现在可以大大简化将您最喜爱的 GameCube 游戏与 Game Boy Advance 的多人游戏和其他奖励功能连接起来。当设置为一个或多个控制器端口时，称为集成 GBA 的精简版 mGBA 将与 Dolphin 一起启动。这些 mGBA 实例与 GameCube 仿真时钟同步，以实现无可挑剔的连接稳定性。通过将这两个模拟器整合到一个包中，GBA 连接功能现在可以与流行的功能（如保存状态、输入录音和网络播放）一起使用！所有这一切都伴随着改进的性能和兼容性的额外好处。如果您不相信我们，请自己检查一下！达到这一点是跨越几代开发人员和模拟器的试验。如果我们要讲述模拟 GBA 到 GCN 通信背后的完整故事，我们必须从头开始。作为 GameCube 的一项功能，Game Boy Advance 的连接性在系统早期在 E3、杂志和电视广告等活动中得到了很大程度的推动。来自 Sonic Team USA、Nintendo EAD、The Pokemon Company 和其他公司的才华横溢的开发人员发布了可以利用该功能的游戏，很容易看到其潜力。最好的情况是，GBA 连接游戏非常有趣，并提供您在任何其他控制台上都找不到的相当独特的体验。拥有 GameCube 的人都知道，这些体验很少。该功能被留在了一个尴尬的地方，它很昂贵，需要很多游戏来证明成本是合理的，但由于用户群很小，大多数开发人员不愿意在 GBA 连接功能上投入大量精力。有一些不可否认的宝石，但通常 GBA 连接功能作为某种复选框功能被添加得很差。现在设置库后，我们可以将 GBA 连接功能的类型分为五个粗略的类别。多人游戏 - 这些游戏严重依赖 GBA &lt;-&gt; GCN 连接来为每个玩家提供独特的信息或他们自己的屏幕，有时可以玩。这包括塞尔达传说：四剑历险记、最终幻想水晶编年史和吃豆人大战。奖励积分归于因素 5，因为它允许 Rogue Squadron III 中的玩家在竞技多人游戏中链接 GBA 以用作隐藏命令的额外屏幕，即使它的数量不多。可转移小游戏 - 这些游戏可让您将可分离游戏转移到 GBA。有时是奖励 NES 游戏，有时是您正在玩的游戏的微型版本。有时是... Crash Blast。具有此功能的游戏示例包括 Nintendo Puzzle Collection、Animal Crossing 和技术上的 Crash Bandicoot: Wrath of Cortex。奖励模式或额外内容 - 游戏还可以在单​​人游戏环境中使用 GBA 来解锁主游戏中的奖励内容。 Animal Crossing 的 GBA 岛、洛克人 X：指挥任务的宝藏追踪器和 Wind Waker 的 Tingle Tuner 就是很好的例子。这似乎是一个相当昂贵的奖励功能，但至少它不是解锁快速翘曲的 amiibo，对吧？\n与 GBA 游戏的连接 - 标题还可以与特定的 GBA 游戏连接以解锁内容或在一个或两个游戏之间执行操作。许多游戏都这样做，包括 Harvest Moon: A Wonderful Life、Sonic Adventure 2: Battle 和 Metroid Prime。请注意，Sonic Adventure 2：Battle 也可以连接到没有游戏的 GBA，因为它的功能略低。口袋妖怪游戏 - 我们将其分为一个单独的类别，因为在这种情况下 GBA 游戏是主要产品。 Pokemon Colosseum、Pokemon XD: Gale of Darkness、Pokemon Box 以及它们的奖励光盘都可以连接到各种第 3 代 Pokemon GBA 游戏以获得奖励、交易和战斗。 Pokemon Box 还可以让您存储 Pokemon 并具有冒险模式，您可以在没有 Game Boy Player 的情况下在大屏幕上玩 GBA​​ 游戏。尽管如此，真正支持 GBA 连接的少数游戏还是带来了有趣的仿真挑战。多年来，一些开发人员开始执行多系统任务。最早记录的 GBA 连接仿真实现可以追溯到 2009 年左右，该功能首先在 Dolphin r2578 中发现。虽然我们不知道将最早版本连接到 GBA 模拟器背后的确切细节，但我们确实从开发人员帐户中知道，围绕该时代最好的 GBA 模拟器 VBA-M 对多个想法进行了试验。但在我们可以连接到另一个模拟器之前，我们需要了解连接的实际工作方式。 GameCube 游戏实际上会加密发送到各种游戏的 GBA 二进制文件，它这样做的方式实际上在早期给 Dolphin 带来了一些问题。加密过程在数字信号处理器 (DSP) 上以我们称为 GBA 微码的特殊微码进行。现在这听起来可能很奇怪，因为大多数人认为 GameCube/Wii 的数字信号处理器 (DSP) 专门用于音频模拟，但有时它也可以用于其他任务。在这种情况下，它用于将发送到 GBA 的可执行文件编码为一种弱混淆形式。这个过程中最值得注意的部分是 GBA BIOS 用于解密的密码包括一个步骤，其中数据与其作者的昵称 kawasedo 进行异或。这指的是 Tomohiro Kawasae，他最终还编写了 NES 仿真功能，这些功能将用于 GBA 连接游戏，如动物之森、银河战士 Prime 等。所有这些都在初始连接期间发生一次，并且只需要一帧的一小部分。之后，游戏会在您甚至听到音频中断之前迅速跳回之前的微码。需要特别说明的是，某些第一方任天堂游戏跳过了这一步并且从不交换微码。在这些罕见的情况下，游戏（或服务盘）将直接在 PowerPC 代码中实现加密过程。这包括塞尔达传说：风之杖、动物之森和一些可能的服务光盘。\n除了那一点点曲线球之外，GCN 与 GBA 通信的协议非常简单。 GBA 链路电缆连接到 GBA 的数据端口并插入 GameCube 上的控制器端口。在 GameCube 端，通信由串行接口 (SI) 处理。主要问题是找出一种在两个完全不同的模拟器之间实现通信的好方法。虽然我们知道尝试了多种方法，但那个时代幸存的实现使用传输控制协议 (TCP) 来桥接 GameCube 和 GBA 模拟器之间的通信。虽然使用网络通信协议似乎是一个奇怪的选择，但做出这一决定是为了保持将多个独立设备连接到 GameCube 的体验。这个想法是，如果需要，您仍然可以在同一台 PC 上连接 VBA-M，或者您可以从同一网络上的另一台计算机连接它。这些努力由 shuffle2 带头，虽然旧的支持日志似乎表明该功能只是一个框架并且功能很少，但用户确实声称可以进入 Animal Crossing 的 GBA 岛。想拿就拿吧。虽然最初的 GBA 控制器选项出现在 2009 年，但真正可玩性的第一个证据出现在 2010 年初，shuffle2 的开发帖子解释了如何在 VBA-M 中使用新的 Joybus 选项以及在 Dolphin 中该做什么。当然，他还包含了一些会让潜在玩家惊叹的屏幕截图。 GBA 连接终于开始工作了，但性能却很糟糕。这是由于我们之前提到的混淆。 Dolphin 的 DSP-HLE 不支持 GBA 微码，迫使用户退回到 DSP-LLE。这不是我们今天喜欢的 DSP-LLE Recompiler。不，这是 DSP-LLE 解释器。 shuffle2 对该项目失去了兴趣，表示在解决极端性能问题之前，做任何事情都没有多大意义。这最终将通过 shuffle2 开发的 GBA 微码的 DSP-HLE 实现来解决。有了 DSP-HLE 的支持，少数可以运行的游戏的性能猛增，但并没有解决核心可用性问题和低兼容性问题。 2011 年，对该功能进展缓慢感到沮丧，最终导致 VBA-M 和 Dolphin 开发人员之间的关系紧张。这出戏导致 shuffle2 对 VBA-M 对 Dolphin 连接项目失去兴趣，但这并不是他最后一次涉足该领域GBA 连通性。他于 2014 年返回，这次使用 Higan GBA 核心作为他新实验的催化剂。在考虑最好的 GBA 模拟器时，使用 Higan 的 GBA 内核从表面上看似乎很奇怪，尤其是在 2014 年。它相当不成熟，无法与 VBA-M 的高兼容性或性能相提并论。但这不是他需要的。 Higan 的 GBA 核心提供了 VBA-M 绝对不能提供的东西：一个干净、现代化的代码库，更容易使用和集成。他还放弃了 TCP 通信实现。 shuffle2 反而写了一个新的共享内存通信方法。这是一种较低开销的进程间通信方法，允许更紧密的同步，但意味着您将无法在单独的机器上运行 GBA。看到在 LAN 上运行 GBA 模拟器对前一种方法的工作有多大问题后，他不再认为这是一个可行的想法。这些更改产生了立竿见影的效果，因为性能和兼容性都有了巨大的明显改进。塞尔达传说：四剑历险记（和四剑+！）现在变得流畅且反应灵敏。还有大量新游戏也有效，例如塞尔达传说：风之杖、任天堂拼图合集、动物之森和洛克人 X：指挥任务。现在有超过六款游戏支持。甚至更令人印象深刻？所有这些游戏都在全速运行！我们在博客上对这个功能感到非常兴奋，我们制作了一个视频，期待它的最终发布！对于那些跟随开发的人来说，你已经知道这个实现永远不会被合并。正如我们在博客上痛苦地了解到的那样，有时最困难的部分不是证明某些东西可以工作，而是清理它并使其完成的过程。兼容性和性能都很好，但使用起来很困难，而且有很多方法会导致崩溃。还有一个小问题，在原型中一次只能连接一个 GBA 模拟器，并且实现被锁定在 Windows 机器上。虽然所有这些问题都可以通过足够的时间和精力来解决，但该项目最终停滞不前，永远不会看到曙光。\n随着 Higan Dolphin 共享内存项目的永久暂停，GBA 连接仿真处于生命支持状态。早期的协议只支持几款游戏，并没有多大用处。它缓慢，繁琐，更糟糕的是，双方的许多开发人员都对支持的连接项目表示不屑。由于 VBA-M 开发人员甚至制定了从官方版本中删除该功能的计划，看起来好像一切都在崩溃......直到它没有。事情能够在艰难时期保持一致的一个关键原因是一个名为skidau的开发人员。他们是 Dolphin 和 VBA-M 的贡献者，还帮助了​​ 2010 年实施的 GBA 方面。在那之后的几年里，他们提供支持并帮助用户获得 GBA 连接功能。凭借这一经验，他们对大湾区连通性方面的问题和挑战有了深入的了解。与 shuffle2 使用他们从 2010 年实现中学到的东西来创建新协议不同，skidau 接受了他们学到的东西并试图改善当前的 TCP GBA 情况。 2015 年，他们的劳动成果随着对 Dolphin 和 VBA-M 的大量更改而交付。一夜之间，Dolphin 从能够连接到几个游戏到至少与大多数 GBA 连接库有一定的兼容性。这是通过一个聪明的系统实现的，该系统使模拟器以最少的同步进行通信。其中的关键组成部分是 GBA 模拟器在等待来自 Dolphin 的数据包时保持暂停状态。 Dolphin 会在连接时将数据包发送到 GBA 仿真器，告诉 GBA 它在仿真中的位置以及预计下一个回复的时间。然后，GBA 模拟器将在模拟无上限之前立即回复数据包中报告的访客时间。如果此时它没有收到另一个命令，GBA 仿真器将暂停并等待下一个数据包。解决方案相当粗糙，帧速度也不是很好，但它奏效了。这个核心思想将成为未来几年 Dolphin 中 GBA 连接的基础，即使现在该实现中的一些代码仍在使用！正是在这一点上，天平开始倾斜，GBA &lt;-&gt; GCN 连接性不仅仅是一种实验性的好奇心。通过使用 Dolphin 和 VBA-M，您可以访问流行游戏中的 GBA 连接功能，例如风之杖和塞尔达传说：四剑大冒险中的多人游戏。大量其他游戏也可以运行，甚至《最终幻想水晶编年史》也可以连接……至少在某种程度上是这样。大多数其他功能较小的游戏都可以运行，但这里和那里有一些例外。事情终于走到了一起，但该功能并没有发挥其全部潜力。首先需要澄清的是，虽然 TCP 是一种网络通信协议，但 TCP GBA 在网络上的工作效果并不好。事实上，像使用 WiFi 这样简单的事情就足以将延迟推得太高以维持连接。有线局域网可以在某些游戏中工作，但即便如此，它也非常接近。该功能仅在一款游戏《塞尔达传说：四剑大冒险》中真正适用于局域网，并增加了大量的性能影响。说到性能，使用 TCP GBA 的 CPU 要求对很多用户来说是一个巨大的破坏。在最基础上，与仅运行基础游戏相比，所有的暂停和等待意味着您需要一台更强大的计算机来保持全速运行。请记住，早在 2015 年，您很可能会使用 LLE（重新编译器）音频来连接您的 GBA，因为 HLE 音频限制兼容性的众多问题。只有最强大的计算机才能在像塞尔达传说：四剑大冒险这样同时连接多个 VBA-M 实例的游戏中保持全速运行。无论您尝试做什么，最终幻想水晶编年史都会因输入丢失而缓慢。但这些游戏至少在大部分时间都可以连接和运行。 2015 年实施的最大问题之一是一些相当大的游戏难以连接。我们正在谈论 Pokemon Colosseum 和 XD 以及他们的奖励光盘。对于许多用户来说，这是 GBA 连接最大的失望。多年来，聪明的用户已经想出了一些技巧来让它有时连接起来。战斗更加一致，因为它有重试连接选项，但交易几乎不可能。\n是什么导致了所有这些问题，尤其是考虑到协议实际上有多简单？关键在于 TCP GBA 如何与 Dolphin 保持联系。这些游戏特别喜欢发送大量命令，有时每帧发送 200 多个命令。这暴露了 TCP GBA 协议中一个相当严重的缺陷。也就是说，如果他们在继续向前模拟以赶上前一个命令的点时收到命令，他们可能会被绊倒。这可能会重复发生，直到 GBA 远远落后以至于 GameCube 得到没有意义的响应。此时，游戏将停止与 GBA 对话，并且会发生某种通信错误。更糟糕的是，如果通信错误没有得到妥善处理，其中一个或两个模拟器可能会完全冻结，因为每个模拟器都会陷入困境，等待另一个的响应。超时功能通常会在崩溃时完全阻止，但肯定有时一切都会发生灾难性的错误。虽然指责糟糕的模拟很容易，但游戏并没有让事情变得简单。许多游戏都依赖于比赛条件，甚至在控制台上也存在计时问题！在 2015 年 TCP GBA 实施之后的几年里，改进几乎没有那么显着，但不断使情况好转一些。大多数改进都在实际协议之外。最值得注意的是修复 HLE 音频，允许连接多个 TCP GBA，从而在这些情况下显着提高性能。对逆向工程 DSP-LLE 的添加允许在挑剔的游戏中进行连接，而无需专门从 GameCube 或 Wii 转储 DSP 文件。虽然 GameCube 方面的情况没有改变，但 GBA 的格局正在发生范式转变。 VBA-M 现在是一个传奇的仿真器，它牢牢地载入了仿真历史的史册，但是新一代的仿真器已经出现。很快，mGBA 不断改进并成为具有大量高级功能的强大、准确的替代方案。随着用户看到支持更多硬件外围设备，许多人想知道 Joybus 支持和与 Dolphin 的连接是否最终会出现。事实证明，用户并不是唯一感兴趣的人； endrift 还想实现对 Joybus 的支持，甚至向 Dolphin 提交了修复程序以准备支持。不幸的是，mGBA 的其他功能和工作导致事情一次又一次地延迟。最后，在 2021 年，mGBA 0.9 中添加了对 Dolphin 连接的支持！ mGBA 更准确的仿真立即对兼容性产生了影响。在《塞尔达传说：四剑+》等 GBA 连接游戏中困扰 VBA-M 的音频问题在 mGBA 中没有发生。 Endrift 对 Dolphin 的其他修复还修复了与《索尼克大冒险 2：战斗》和《最终幻想水晶编年史》等游戏的连接。除了正确播放音频之外，endrift 和 bonta 修复了塞尔达传说：四剑 + 中回合之间的关键挂起。更令人印象深刻的是，所有这些更改都是在 2015 协议的范围内进行的！向后兼容性不受影响，VBA-M 不需要任何更改。然而，在所有的准备和开发过程中，另一个项目揭开了面纱，一个不受 TCP GBA 协议限制的项目。在开发渠道的讨论中，bonta 注意到一些开发人员正在与 endrift 讨论对 GBA &lt;-&gt; GCN 协议的潜在改进。考虑到他的个人项目可能会引起人们的兴趣，他决定直言不讳并宣布他一直致力于将 mGBA 直接集成到 Dolphin 中。他甚至声称这些内部 GBA 与 netplay 兼容。\n大承诺很容易实现......", "note_en": "Your eyes are not deceiving you. As of  5.0-14690, Dolphin now has  mGBA directly built into it as a new way to handle Game Boy Advance connectivity with GameCube titles. For those who don&#39;t know, mGBA is the most renowned and accurate GBA emulator of this era and has been rapidly improving since its inception. Recently,  we wrote about  mGBA adding support for our TCP GBA protocol, but this is something completely new. With integration and synchronization work done by   bonta, connecting your favorite GameCube titles with a Game Boy Advance for multiplayer and other bonus features is now greatly simplified. Dubbed the  Integrated GBA, a stripped-down version of mGBA will boot up alongside Dolphin when set to one or more controller ports. These mGBA instances are clock-synced to GameCube emulation for impeccable connection stability. By bringing these two emulators together in one package, GBA connectivity features now work with popular features like savestates, input recordings, and  netplay! All of this comes with the added bonus of improved performance and compatibility. If you don&#39;t believe us, check it out yourself!\n   Getting to this point has been a trial that spans generations of developers and emulators. If we&#39;re going to tell the full story behind emulating GBA to GCN communication, we have to start from the very beginning.\n  As a feature of the GameCube, Game Boy Advance connectivity was pushed to a significant degree in the early days of the system at events like E3, magazines, and of course television commercials. With talented developers from  Sonic Team USA,  Nintendo EAD,  The Pokemon Company, and others releasing titles that would take advantage of the feature, it was easy to see the potential. And at its best, GBA connectivity games are incredibly fun and provide rather unique experiences that you wouldn&#39;t be able to find on any other console.\n  As those who had a GameCube would know, these experiences were few and far between. The feature was left in an awkward spot where it was expensive and needed lots of games to justify the cost, but because of the small userbase most developers weren&#39;t willing to invest a significant amount of effort into GBA connectivity features. There are some undeniable gems, but more often than not GBA connectivity features were tacked on poorly as some kind of checkbox feature. With the library now set, we can sort the types of GBA connectivity features into five rough categories.\n  Multiplayer Games - These games heavily rely on GBA &lt;-&gt; GCN connectivity to give each player unique information or their own screen to play off of at times. This includes  The Legend of Zelda: Four Swords Adventures,  Final Fantasy Crystal Chronicles, and  Pac-Man Vs. Bonus points go to Factor 5 for allowing players in  Rogue Squadron III to link a GBA in competitive multiplayer to use as an extra screen for hiding orders, even if it doesn&#39;t amount to much.\n Transferrable Minigames - These games let you transfer detachable games to the GBA. Sometimes it is a bonus NES game, sometimes it&#39;s a miniature version of the game you&#39;re playing. Sometimes it is...  Crash Blast. Examples of games with this feature include  Nintendo Puzzle Collection,  Animal Crossing, and  technically  Crash Bandicoot: Wrath of Cortex.\n Bonus Modes or Extra Content - Games could also use the GBA in a single player context to unlock bonus content on the main game.  Animal Crossing&#39;s GBA island,  Mega Man X: Command Mission&#39;s Treasure Tracker and  Wind Waker&#39;s Tingle Tuner are great examples of this. This may seem like a rather expensive bonus feature, but at least it&#39;s not an amiibo to unlock quick warping, right?\n Connectivity with a GBA game - Titles could also connect with specific GBA games to unlock content or do things between one or both games. Many games do this, including  Harvest Moon: A Wonderful Life,  Sonic Adventure 2: Battle, and  Metroid Prime. Note that  Sonic Adventure 2: Battle can also connect to a GBA  without a game for a slightly lesser version of what it does.\n The Pokemon Games - We split this into a separate category because the GBA games are the  main product in this case.  Pokemon Colosseum,  Pokemon XD: Gale of Darkness,  Pokemon Box, and their bonus discs can all connect to various Generation 3 Pokemon GBA games for bonuses, trading, and battling.  Pokemon Box also let you store Pokemon and had an adventure mode where you could play the GBA games on the big screen without a Game Boy Player.\n  Still, the few games that truly embraced GBA connectivity presented an interesting emulation challenge. Over the years, several developers have embarked on the multi-system mission.\n  The earliest recorded implementations of GBA connectivity emulation go back to around 2009, with the feature first being spotted in  Dolphin r2578. While we don&#39;t know the exact details behind connecting the earliest versions to a GBA emulator, we do know from developer accounts that multiple ideas were trialed with a focus around the best GBA emulator of the era,  VBA-M.\n But before we could connect to another emulator, we needed to understand how the connection actually works. GameCube games will actually encrypt the GBA binary that is sent to the various games, and the way it does this actually posed a bit of a problem for Dolphin early on. The encryption process took place on the  Digital Signal Processor (DSP) under a special microcode that we refer to as the  GBA microcode. Now this may sound weird, as most people consider the GameCube/Wii&#39;s Digital Signal Processor (DSP) specifically for  audio emulation, but sometimes it could be used for other tasks. In this case, it is used to encode the executable sent to the GBA as a weak form of obfuscation.\n The most notable part of this process is that the cipher used by the GBA BIOS for decryption includes a step where data is XORed with its author&#39;s nickname, kawasedo. This refers to  Tomohiro Kawasae, who would also end up coding NES emulation features that would be used in GBA connectivity games like  Animal Crossing,  Metroid Prime and many others.\n All of this happens once during the initial connection and only takes a fraction of a frame. After that the game quickly jumps back to the previous microcode before you can even hear an interruption in audio. As a special note, certain first party Nintendo games skipped this step and never swap microcodes. In these rare cases, the game (or service disc) will implement the encryption process directly in PowerPC code. This includes  The Legend of Zelda: The Wind Waker,  Animal Crossing, and potentially some service discs.\n Other than that little bit of a curveball, the protocol in which the GCN communicated to the GBA was dead simple. The GBA Link Cable attached to the data port of the GBA and plugged into a controller port on the GameCube. On the GameCube side, communication was then handled by Serial Interface (SI). The main problem was then figuring out a good way to implement communication between two completely different emulators. While we know several methods were trialed, the surviving implementation from that era used the Transmission Control Protocol (TCP) to bridge communication between the GameCube and GBA emulators. While it may seem like an odd choice to use a  network communication protocol, the decision was made in an effort to preserve the experience of having multiple separate devices connected to the GameCube. The idea was that you could still connect VBA-M on the same PC if you wanted,  or you could connect it from another computer on the same network. These efforts were spearheaded by   shuffle2 and while old support logs seem to indicate that this feature was just a framework and had very little functionality, users did claim that getting to  Animal Crossing&#39;s GBA island was possible. Take that as you will.\n  While the initial GBA controller option turned up in 2009, the first evidence of  true playability turned up in early 2010, with development posts from   shuffle2 explaining how to use the new Joybus options in VBA-M and what to do in Dolphin. He, of course, included some screenshots that would wow prospective players.\n  GBA connectivity was finally working, but performance was abysmal. This was due to the obfuscation we mentioned earlier. Dolphin&#39;s DSP-HLE didn&#39;t support the GBA microcode, forcing users to fall back to DSP-LLE. And this isn&#39;t the DSP-LLE  Recompiler we enjoy today. No, this was  DSP-LLE Interpreter.   shuffle2 lost interest in the project, saying that until the extreme performance problems were solved, there wasn&#39;t much point in doing anything. This would eventually be remedied with a DSP-HLE implementation of the GBA microcode developed by...   shuffle2. With DSP-HLE support, performance in the few games that  did work skyrocketed, but it didn&#39;t fix the core usability issues and low compatibility.\n Frustration with how slowly the feature was progressing eventually strained relations between VBA-M and Dolphin developers in 2011. The drama resulted in   shuffle2 losing interest in the VBA-M to Dolphin connectivity project, but it wouldn&#39;t be his last foray into the realm of GBA connectivity. He returned in 2014, this time using the Higan GBA core as the catalyst for his new experiment. When thinking about the best GBA emulators, using Higan&#39;s GBA core might seem odd on the surface, especially back in 2014. It was rather immature and couldn&#39;t match the high compatibility or performance of VBA-M. But that&#39;s not what he needed. Higan&#39;s GBA core offered something that VBA-M absolutely couldn&#39;t: A clean, modernized codebase that was easier to work with and integrate.\n He also abandoned the TCP communication implementation.   shuffle2 instead wrote a new  Shared Memory communication method. This was a lower overhead method of interprocess communication which allowed for tighter synchronization but meant that you wouldn&#39;t be able to run GBAs on separate machines. Having seen how problematic running a GBA emulator across LAN worked for the previous method, he no longer considered that a viable idea anyway.\n These changes yielded immediate results, as there were huge visible improvements to both performance and compatibility.  The Legend of Zelda: Four Swords Adventures (and Four Swords+!) was now smooth and responsive. There were tons of new games that also worked, like  The Legend of Zelda: The Wind Waker,  Nintendo Puzzle Collection,  Animal Crossing, and  Mega Man X: Command Mission. There were now over half a dozen games supported. And even more impressively? All of these games were running  full speed! We here at the blog were so excited about the feature that we made a video anticipating its eventual release!\n  For those that followed development back then, you already know that this implementation would never be merged. As we at the blog painfully learned, sometimes the hardest part isn&#39;t proving that something can work, but rather is the process of cleaning it up and getting it to completion. Compatibility and performance was great, but using it was difficult and there were a lot of ways to cause crashes. There was also the  small issue that you could only connect one GBA emulator at a time in the prototype and the implementation was locked to Windows machines. While all of these problems were fixable with enough time and effort, the project eventually stalled and would never see the light of day.\n  With the permanent suspension of the Higan Dolphin Shared Memory project, GBA connectivity emulation was on life support. The early protocol only supported a few games and it didn&#39;t see much use. It was slow, cumbersome, and worse yet, many developers on both sides showing disdain toward the supporting connectivity project. With VBA-M developers even drawing up plans to remove the feature from official builds, it really seemed as though everything was falling apart... until it wasn&#39;t.\n One of the key reasons things were able to hold together through rough times was a developer known as   skidau. They were a contributor to both Dolphin and VBA-M and also helped with the GBA side of the 2010 implementation. Throughout the years after that, they provided support and helped users get GBA connectivity features working. Because of this experience, they had a deep knowledge of the problems and challenges around GBA connectivity. Unlike   shuffle2, who used what they learned from the 2010 implementation to create a new protocol,   skidau took what they learned and tried to improve the current TCP GBA situation. In 2015, the fruits of their labor were delivered with tons of changes to both Dolphin and VBA-M.\n   Overnight, Dolphin went from being able to connect to a couple of games to having  at least some compatibility with most of the GBA connectivity library. This was accomplished through a clever system that kept emulators communicating with minimal syncing. The key component to this was that the GBA emulator was to remain paused while waiting for packets from Dolphin. Dolphin would in turn send packets to the GBA emulator while they were connected, telling the GBA where it was in emulation and when the next reply was expected. The GBA emulator would then reply immediately before emulating  uncapped to the reported guest time in the packet. If by that point it hadn&#39;t received another command, the GBA emulator would pause and wait for the next packet. The solution was rather crude and the framepacing wasn&#39;t fantastic, but it  worked. This core idea would become the basis for GBA connectivity in Dolphin for years to come, and even now some of the code from this implementation is still used!\n  It was at this point then the scales tipped and GBA &lt;-&gt; GCN connectivity became more than an experimental curiosity. By using Dolphin and VBA-M, you could access GBA connectivity features in popular games like  Wind Waker and multiplayer in  The Legend of Zelda: Four Swords Adventures. Tons of other games worked too, and even  Final Fantasy Crystal Chronicles could connect... at least to some degree. Most other games with smaller features worked, with a few exceptions here and there.\n  Things were finally coming together, but the feature wasn&#39;t living up to its full potential. The first thing that has to be clarified is that while TCP is a  network communication protocol, TCP GBAs do not work very well over the network. In fact, something as simple as using  WiFi was enough to push the latency too high to maintain connectivity. Wired LAN  could work in some games, but even then it was cutting it  extremely close. The feature only really worked on LAN in one game,  The Legend of Zelda: Four Swords Adventures, and added tons of performance implications.\n Speaking of performance, the CPU requirements of using TCP GBAs were a huge deal breaker for a lot of users. At the very base, all of the pausing and waiting meant that you needed a much stronger computer just to keep things running full speed compared to running just the base game. And remember, back in 2015 you&#39;d most likely be using LLE (Recompiler) audio to connect your GBAs as the numerous problems with HLE audio limited compatibility. Only the most powerful computers could maintain full speed in games like  The Legend of Zelda: Four Swords Adventures with multiple VBA-M instances connected at once.  Final Fantasy Crystal Chronicles was slow with dropped inputs no matter what you tried to do.\n But those games at least connected and worked most of the time. One of the biggest problems with the 2015 implementation was that some rather big titles  struggled to connect. We&#39;re talking about  Pokemon Colosseum and  XD and their bonus discs. For many users, this was the biggest disappointment of GBA connectivity. Over the years, clever users have figured out tricks to make it connect  sometimes. Battling was more consistent because it had a retry connection option but trading was near impossible.\n What was causing all of these problems, especially considering how simple the protocol actually was? The key was in how the TCP GBAs remained in contact with Dolphin. These games in particular loved to spam tons of commands, sometimes sending over  200 commands a frame. This exposed a rather serious flaw in the TCP GBA protocol. Namely, they could get tripped up if they received a command while they were still emulating forward to catch up to the point from the previous command.\n  This could happen on repeat until the GBA falls so far behind that the GameCube gets responses that don&#39;t make sense. At this point, the game would cease talking to the GBA and a communication error of some kind would occur. Worse yet, one or both of the emulators could outright freeze if the communication error wasn&#39;t handled cleanly, as each emulator would be stuck in limbo waiting for a response from the other. Timeout features  usually prevented full on crashes, but there were definitely times where everything would go catastrophically wrong. While it would be easy to just blame bad emulation, the games didn&#39;t exactly make things easy. Many of the games relied on race conditions or had timing issues even   on console!\n  In the years following the 2015 TCP GBA implementation, improvements were not nearly as dramatic but kept making the situation a little bit better. Most of the improvements came outside of the actual protocol. Most notably were things like  fixes to HLE audio that allowed for the connection of multiple TCP GBAs, giving a sizeable performance increase in those situations. Additions to  reverse engineered DSP-LLE allowed connectivity in picky games  without needing to specifically dump DSP files from a GameCube or Wii.\n While things weren&#39;t changing on the GameCube side of things, the GBA landscape was seeing a paradigm shift. VBA-M was now a legendary emulator that had firmly cemented itself into the annals of emulation history, but a new generation of emulators had emerged. Rapidly,  mGBA was improving and becoming a robust, accurate alternative with a plethora of advanced features. As users saw more hardware peripherals supported, many wondered if Joybus support and connectivity with Dolphin would eventually come. It turns out that users weren&#39;t the only one interested;   endrift also wanted to implement Joybus support and even submitted fixes to Dolphin in preparation for support. Unfortunately, other features and work on mGBA caused things to get delayed again and again. Finally, in 2021,  support for Dolphin connectivity was added in mGBA 0.9!\n mGBA&#39;s more accurate emulation immediately made an impact in compatibility. Audio issues that plagued VBA-M in GBA connectivity titles like  The Legend of Zelda: Four Swords+ did not happen in mGBA. Additional fixes to Dolphin from   endrift also fixed connectivity with games like  Sonic Adventure 2: Battle and  Final Fantasy Crystal Chronicles. On top of playing audio correctly, fixes by both   endrift and   bonta fixed a critical hang between rounds in  The Legend of Zelda: Four Swords+.\n More impressively, all of these changes were made within the confines of the 2015 protocol! Backward compatibility wasn&#39;t affected and there weren&#39;t any changes needed from VBA-M. However, during all of the preparation and development another project was unveiled, one that wouldn&#39;t be limited by the TCP GBA protocol.\n  During discussions in the development channels,   bonta noticed that several developers were talking with   endrift about potential improvements to the GBA &lt;-&gt; GCN protocol. Figuring that his personal project may be of interest, he decided to speak up and announced that he had been working to integrate mGBA directly into Dolphin. He even claimed that these internal GBAs were compatible with  netplay.\n Big promises are easy to ma\n......", "posttime": "2021-07-24 07:02:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "集成,integration,gba", "title": "MGBA 集成：介绍集成的 GBA", "title_en": "MGBA Integration: Introducing the Integrated GBA", "transed": 1, "url": "https://dolphin-emu.org/blog/2021/07/21/integrated-gba/", "via": "", "real_tags": ["集成", "gba"]}, {"category": "", "categoryclass": "", "imagename": "5338670d178b7cecf3f940522aa34190.jpeg", "infoid": 1069291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果没有科学仪器或知识来告诉他们，你可以原谅古代人类最初相信地球是平的。毕竟，从人类的角度来看，世界确实在我们面前伸展开来，而没有像半管一样突然向下倾斜。但是，虽然这个概念已经被彻底否定了几个世纪，但最近出现了一种新的扁平与弯曲的辩论，引起了学术界的想象。这一次，科学家们正在辩论宇宙本身的形状。在 arXiv 预印本服务器上最近发表的一篇论文中，来自乌尔姆大学和里昂大学的一组天体物理学家和宇宙学家研究了大爆炸的剩余光——被称为宇宙微波背景，或 CMB——并确定宇宙可能不是平面，正如许多科学家目前认为的那样。 “我们论文中的例子是……一个甜甜圈形状的宇宙模型，”里昂大学宇宙学教授、新论文的合著者 Thomas Buchert 在一封电子邮件中解释道。 Buchert 写道，这种形状也称为三环面，也就是三维甜甜圈。宇宙具有圆环形状的想法是一些非常遥远的东西的中心，例如中央情报局 1980 年代关于通灵现象的网关报告。这篇论文尚未经过同行评审，但 Buchert 表示已提交给期刊进行审议。 Buchert 和他的同事并不是第一个提出形状奇特的宇宙的人。环面形状的想法起源于 1980 年代，新数据在 2003 年重新激发了研究人员之间的讨论。但在过去的 18 年中，科学家们对宇宙的形状普遍得出了不同的结论。也就是说，他们认为它在几何上是平坦的——意味着时空结构中的平行线保持平行——并且无限扩展。观察到的红移证明了最后一条原则，这是一种来自宇宙边缘的光信号，表明它正在后退。宇宙的形状本质上是一张无限大的平面纸的想法似乎是故事的结尾，但布赫特和同事在他们的论文中写道，CMB 中存在一些不太一致的东西。 “[CMB] 频谱不仅是离散的，而且还有很大的差距，”他们写道。这造成了“[标准模型] 的预测和 CMB 观察结果之间的有趣差异。”\n换句话说，如果宇宙真的像标准模型所提出的那样是无限的，那么 CMB 似乎会丢失一些信号。对此的一种解释是，在这些缺失的点上，宇宙实际上是“多重连接”的，这意味着它的拓扑结构是弯曲的，以至于它像甜甜圈一样重新连接到自身上。就像你可以在不改变平行属性的情况下将一张扁平的纸折叠成弯曲的形状一样，这个解决方案意味着宇宙既可以是平的，也可以是甜甜圈的。通过对 CMB 的模拟，这正是研究人员发现的。然而，如果被证明是正确的，这将意味着宇宙不再是无限的，Buchert 说，这在哲学上可能对某些人来说是刺耳的。 “有限宇宙模型对某些人来说可能很可怕，但你不会体验到边界，”布赫特说。 “所以你生活在一个无限的宇宙中，尽管它的体积是有限的。”但是，即使你不一定会撞到这个有限宇宙的边缘，你能绕着它航行并最终回到你开始的地方吗？理论上，是的。 “光可以在整个有限的宇宙中传播，但对于太空旅行者来说，这将是困难的，”布赫特说。 “当然，如果未来的技术允许在时空中创造虫洞，或者如果我们能够实现不受光速限制的[曲速驱动器]，那么原则上可以四处旅行。”但即使你可以跳上曲速航天器，它也可能会产生一些意想不到的后果，布赫特警告说。 “预计你在曲速气泡中的适当时间比你在地球上开始的时间要短得多，”他说。 “如果你完成循环并回来，地球可能不再存在。”\n在等待新的经线工艺开发出来的同时，Buchert 和他的同事们将继续以旧时尚的方式探索这个谜团：分析来自普朗克、WMAP 和 COBE 等探测器的数据，以发现宇宙诞生时隐藏的线索。", "note_en": "Without scientific instruments or knowledge to tell them otherwise, you can forgive ancient humans for initially believing the Earth was flat. After all, from a human perspective, the world does appear to stretch out before us without suddenly sloping down like a half-pipe. But while this notion has been thoroughly disproven for centuries, a new kind of flat-versus-curved debate has recently captured academic imagination. And this time, scientists are debating the very shape of the universe itself.\n    In a   paper recently published on the arXiv preprint server, a team of astrophysicists and cosmologists from Ulm University and the University of Lyon have studied the leftover light from the Big Bang—known as the Cosmic Microwave Background, or CMB—and determined that the universe may not be a flat plane, as many scientists currently believe.\n  “The example in our paper is… a donut shaped universe model,” explained    Thomas Buchert, a professor of cosmology at the University of Lyon and coauthor on the new paper, in an email. This shape is also known as a   three-torus, Buchert wrote, AKA a three-dimensional donut. The idea that the universe has a torus shape is at the center of some pretty far-out stuff, such as   the CIA’s 1980s Gateway report on psychic phenomena.\n  This paper has not yet been peer-reviewed, but Buchert said it has been submitted to journals for consideration.\n  Buchert and colleagues are not the first to propose an oddly shaped universe. The idea of a torus shape originated in the 1980s, and new data   reinvigorated discussions among researchers in 2003. But in the last 18 years scientists have broadly come to a different conclusion about the universe’s shape. Namely, they believe it to be geometrically flat—meaning parallel lines in the fabric of spacetime remain parallel—and infinitely expanding. This last tenet is evidenced by observed redshifts, a signal from light that it’s retreating, at the edge of the universe.\n    This idea that the universe’s shape is essentially an infinite sheet of flat paper would seem like the end of the story, but Buchert and colleagues write in their paper that there was something in the CMB that didn’t quite line up.\n  “The [CMB] spectrum is not only discrete but has in addition large gaps,” they write. Which creates “intriguing discrepancies between predictions of the [standard model] and CMB observations.”\n  In other words, there appear to be signals missing from the CMB that would be present if the universe were truly infinite as the standard model proposes. One explanation for this would be that the universe is actually “multiply connected,” at these missing points, meaning that its topology is curved in such a way that it connects back  onto itself like a donut.\n  The same way you can fold a flat piece of paper into a curved shape without changing its parallel properties, this solution would mean the universe could be both flat  and donut shaped. Through simulations of the CMB, this is exactly what the researchers found. However, if proven to be true, this would mean that the universe was no longer infinite, said Buchert, which may be philosophically jarring to some.\n  “Finite universe models might be scary to some people, but you do not experience a boundary,” said Buchert. “So you live in an unbounded Universe although it has finite volume.”\n    But even if you won’t necessarily bonk into the edge of this finite universe, can you sail around it and end up back where you started? Theoretically, yes.\n  “Light can travel around the whole finite Universe, but for a space-traveler it&#39;ll be difficult,” said Buchert. “Certainly, if future technologies would allow to create wormholes in spacetime, or if we would realize [warp drives that are] not limited by the speed of light, then it is in principle possible to travel around.”\n  But even if you could hop onboard a warp-speed spacecraft, it might have some unintended consequences, warns Buchert.\n  “It is expected that your proper time   within the warp bubble is considerably shorter than the time elapsed at Earth where you started from,” he said. “If you would complete the loop and come back, Earth might no longer exist.”\n  While they wait for new warp craft to be developed, Buchert and colleagues will instead continue probing this mystery the old fashion way: analyzing data from probes like Planck, WMAP and COBE to uncover hidden clues at the birth of the universe.", "posttime": "2021-07-24 07:01:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宇宙,giant", "title": "宇宙是一个巨大的甜甜圈，我们住在里面", "title_en": "The universe is a giant donut that we live inside", "transed": 1, "url": "https://www.vice.com/en/article/3aqjkn/the-universe-is-a-giant-donut-that-we-live-inside-new-research-suggests", "via": "", "real_tags": ["宇宙", "giant"]}, {"category": "", "categoryclass": "", "imagename": "db0d48a05e8b5977c4385610642193d2.jpg", "infoid": 1069289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我翻译理论与实践硕士期间最喜欢的文章之一。 MA当然更侧重于翻译的理论方面，这从本文中可以明显看出。这篇文章的重点是比较一个文本的两个翻译，并在各个层面讨论它们的“等效性”。我选择了 Jabberwocky，因为它是我长大的一首诗。我大约 7 岁的时候就学会了歌词，今天仍然可以完整地背诵它们。所以探索两个日语翻译对我来说非常令人兴奋。在将源文本 (ST) 翻译成另一种语言的目标文本 (TT) 时实现等效是翻译人员的主要目标。然而，许多理论家在句法层面（Nida 1964；Nida 2000；Baker 1992）、语义层面（Nida and Taber 1982； Newmark 1981)，文体的或散漫的。此外，翻译将使用哪种对等取决于许多因素，包括文本类型、其信息、作者的目的、译者的意图（偏向 ST 或 TT）以及读者（Newmark 1981：20 -21, 39；奈达和泰伯 1982：31；奈达 2000：127）。讨论各种文本类型、受众和目标对于本文的范围来说太过分了，所以我想特别关注一个文本；刘易斯卡罗尔的“Jabberwocky”的诗作。诗歌在对等性方面的分析特别有趣，因为它在源语言的文化、诗歌风格和抽象含义方面具有强大的基础。诗歌翻译者必须处理翻译意义与话语的这些问题，以使其忠实于 ST，同时使其在 TT 中易于理解和有意义（参见 Nida 2000：131）。\n本文将着眼于在 Yanagawa (Carroll 1994) 和 Sawasaki (2008) 的“Jabberwocky”的两个日文翻译中实现对等时的这些问题，重点关注诗歌的词汇方面并借鉴以前的对等理论，贝克尤其如此。翻译实现对等的一种方式是在词汇层面，或者如 Baker (1992) 所说，在词层面。 “Jabberwocky”是 1871 年为《镜花水月》一书写的一篇文章。在某些人看来，它被写成一首“胡说八道的诗”（Klug 2000：4），这是由于卡罗尔捏造了大量文字。但是，当您分解所谓的“捏造”话语时，您会发现它们在英语中具有某种意义，而日语翻译中也借鉴了这些话语。以“frumious”这个词（它描述了 Bandersnatch，一个虚构的怪物）为例。在英语中，这个词借鉴了“furious”和“fuming”这两个词，这两个词都意味着“愤怒”，但“fuming”也带有“吸烟”的意思。 Yagawa 将其翻译为takeburu，它借鉴了takeru（意思是“凶猛”）和keburu（意思是“吸烟”）这两个词。而 Sawasaki 将这个词翻译成 iburikurueru，使用 iburidau，“把动物抽出去”和 kuruu，“发疯”。两者都使用接近英语“frumious”的意象，用类似的“smoky”词来表示“fuming”，尽管他们对“furious”、“fierce”或“mad”的解释各不相同。 Baker 的词级对等理论侧重于如何在文本之间无法实现直接对等，因此需要不同的方法来实现词级的对等 (Baker 1992: 18-21)。虽然她关注的是带词缀的词的翻译问题，但贝克的不同形式的非对等概念（同上：21）最适合源文本中捏造词的问题。\nYagawa 和 Sawasaki 都通过在日语中使用他们自己捏造的词来解释“frumious”（同上：38），实现了“frumious”的等价性，这种策略与 Carroll 类似，他利用自己的母语中的两个词创造了一个新词。然而，Yagawa 和 Sawasaki 并没有对文本中的每一个捏造的词都使用这种策略，例如“burble”这个词（用来描述 Jabberwocky 接近时的噪音），卡罗尔本人被引用为源自英语单词“bleat” &#39;、&#39;杂音&#39;和&#39;颤音&#39;（Carroll 2009）。翻译人员试图使用 Baker 所说的“使用无关词的释义翻译”（Baker 1992：38）来实现对等，这种策略与前一种策略类似，但使用了修改后的从句而不是改变语言的形式。矢川使用了sawaga mashiku，意思是“全速喧闹”。 Sawasaki 将其翻译为 domekizuri，它使用汉字的 onyomi（基于中文原文的阅读），意思是“愤怒”，mekimeki，意思是“明显”，而 zuriagaru 意思是“爬起来”。 Sawasaki 使用了与 Carroll 类似的方法，将三个词组合在一起，在日语中创建了一个虚构的词，意思是“愤怒地爬上显眼”。尽管他使用相同的方法，但他丢失了很多原始图像。 Yagawa 确实试图保持 Jabberwocky 发出的声音的意象，但他们都没有利用这个词的完整英语起源，而是通过将这个词翻译成从句来关注生物的移动方式。 “Jabberwocky”并非完全由捏造的单词组成，两位翻译人员翻译标准英语话语的方式很重要。\nST 中的一个词与 TT 中的一个词直接对应的现象已经被一些理论家研究过，包括 Catford (1965)。他提出了文本对等的概念，即“任何 T​​L 形式（文本或文本的一部分）被观察到与给定的 SL 形式（文本或文本的一部分）等效”（Catford 1965；27）。他使用了英语中的“son”与法语 fil 的例子，这也可以在“Jabberwocky”中看到，两位译者都将“son”翻译成日语中的 musuko。可以在诗中的许多地方看到文本对等，其中两位译者都使用了相同的对应话语，例如 tsurugi 意思是“剑”，或者 mori，意思是“森林”。但是，并非所有您可能希望应用文本对等的话语都如此，例如 Yagawa 翻译为 tsume 和 Sawasaki 翻译为 kagitsume 的“claws”。后者的意思是“钩爪”，为了诗意的效果和意象，从 ST 的意思略有变化。这与 Catford 的文本对等理论背道而驰，尽管他确实说在目标语言中没有对等的文本将在文本的级别或类别上发生变化（Catford 1965：73）。然而，Sawasaki 并没有改变翻译的意思，因为没有直接从 ST 翻译。与文本对等平行，卡特福德理论化了他所谓的正式对应。这是“仅近似”的翻译（idib：32），因为当两种语言“尽可能接近地在 TL 的‘经济’中占据‘相同’的位置，就像给定的 SL 类别在SL”（同上：27）。这意味着 Sawasaki 将“爪”翻译成“钩爪”仍然可以被认为是一种对等形式，因为它“占据”了与原文的“近似”。与 Catford 类似，奈达对形式等价进行了理论化，其中“接受语言中的信息应尽可能匹配源语言中的不同元素。\n这意味着，例如，接收者文化中的信息不断与源文化中的信息进行比较，以确定准确性和正确性的标准”（Venuti 中的 Nida：127）。换句话说，实现形式上的对等取决于翻译者将 TT 与 ST 匹配的程度。然而，这些方法存在一些问题，因为 Catford 和 Nida 的方法显示出对 ST 的偏见，指出只有当 TT 被翻译成尽可能接近原始词汇、句法、风格等时才能实现等效。如果真是这样，本来就难懂的《Jabberwocky》，日本观众就完全听不懂了。但是，在这种情况下，有时译者不使用这些方法，而是完全改变原文的词汇以适应目标受众。一个这样的例子是“He go to galumphing back”（Carroll 2009）这句话，Sawasaki 将其翻译为 kare wa ikitoutou taru gaisen no gyaroppu wo fumu，其后翻译为“他的心 [going] step-step he walks a chievant return gallop” .虽然它仍然传达了男孩归来的相同形象，但泽崎已经重新措辞以适应日本观众，使用日语拟声词形成更具描述性的形象。在上面的例子中，译者使用了奈达所说的动态对等，在“翻译中，人们并不那么关心将接受者语言信息与源语言信息相匹配，但是……接受者和信息之间的关系应该基本上是与原始接收器和信息之间存在的相同”（Nida 2000：129）。换句话说，在“Jabberwocky”的部分，译者泽崎和矢川偏离了逐字翻译这首诗，而是创造了一种动态对等，重新创造了卡罗尔英文原文中可能唤起的信息和感受日本观众。\n根据 Nida 和 Taber (1982:22) 的说法，这种动态方法在大多数翻译中比形式对等具有更高的优先级，翻译人员必须考虑受众的需求而不是语言形式（同上：31）。在诗歌翻译中尤其如此，在那里非常需要关注“再现情感强度和风味”（Nida 2000：127）。人们不应该把一首诗当作散文来翻译，而应该用目标语言创作另一首诗，这首诗将拥有与源文本分开的生命（Matthews 1959 in Nida 2000: 127）。这将解释两位译者如何创造出日语版本的原文，既传达了原始信息，又是两个不同的文本。一个例子是卡罗尔的文本“一，二！一二！并且彻头彻尾”，Yagawa 将其翻译为 Ei，是的！诶，耶！ Koredemo kato bakari，意思是&#39;Ei，你！诶，耶！即使这样[他也做了]更多的&#39;，这意味着男孩在打架时大喊大叫。泽崎将其翻译为：ichi，ni！一，你！ Tsuranukite nao mo tsuranuku 这是更接近原文的翻译，反译为“一，二！一二！通过和通过更多&#39;。正如你在这里看到的，两位译者都试图保持原文的句法结构，但同时用日语创作了自己独特的作品。尽管 Yagawa 比 Sawasaki 更远离 ST，但她试图平衡信息与日语中听起来自然的台词。就像矢川一样，译者面临着源文本的准确性和目标文本的自然性的问题，并在两者之间找到适当的平衡点。贝克从搭配的角度讨论了这个问题，译者面临着“在什么是典型的和什么是准确的之间的艰难选择”（贝克 1992：60）。尽管 TT 中的句子可能会发生变化，但它可能会无意中稍微改变目标受众的意思。这不一定是件坏事，因为某些词和搭配在很大程度上基于文化理解，可能不会转移到另一种文化，稍微改变含义可能会使其在 TT 中更容易理解。\n这些特定文化的搭配在“Jabberwocky”中很难观察到，因为大量捏造的词汇首先在英语中造成了不标准的搭配，例如“the Jabberwock with eyes of fire”是一种明显的搭配“眼睛”和“火焰”。诸如此类的不寻常搭配就是 Baker (1992: 55) 所说的标记搭配，是故意选择的不寻常的词组合，以创造新的图像并挑战我们作为读者的期望。这通常用于小说、幽默、新闻、广告和诗歌。泽崎将这句话翻译成 ryou no manako wo keikei 到 moyashitaru &#39;两个眼睛都瞪着又燃烧&#39; Yagawa 的翻译是 manako ranran，意思是“眼睛瞪”或“燃烧”。 Sawasaki 和 Yagawa 的翻译都试图保持“火热”的形象，但由于在日语中使用了更自然的搭配，并带有说明 Jabberwocky 是刺眼的词语，这仅在标记的搭配中暗示，从而失去了一些偏向于自然的准确性。英语。由于诗歌的文化嵌入思想和抽象性质，这种信息的自然性和准确性的平衡可以说是诗歌转型中译者最困难的任务。为了实现对等，译者面临许多问题，这很可能是 Catford (1965: 27) 指出翻译是一种“经验现象”的原因。本文讨论了如何在诗歌“Jabberwocky”的两个不同日文翻译中实现对等，重点是基于先前对等理论的词汇差异。\n矢川和泽崎都以不同的方式处理卡罗尔的捏造词，虽然都尝试了自己捏造的日语词，但两位译者都使用了完全相同的措辞，而是用他们自己对英语的解释来解释他们翻译中的意思。这与非虚构的词相同，因为每个译者都以自己的方式解释它们。在某些情况下，他们的翻译与卡特福德的文本对等理论相匹配，而在其他时候，他的形式对应理论与他们的翻译相匹配，但没有一个全文与他的任何一个理论完全匹配。这主要是由于 Catford 的工作存在许多问题，包括他专注于在 TT 尽可能接近 ST 时实现等效，尽管可能需要进行一些转变才能使其在 TT 中有意义。问题在于诗歌，尤其是“Jabberwocky”，不是可以直接逐字翻译的东西，即使有转换，它对目标日本受众也没有意义。 Nida 和 Taber 的理论更关注受众，当信息从 ST 准确转换为 TT 时，就实现了对等。我认为这是在 Yagawa 和 Sawasaki 的翻译中实现的，因为他们试图为日本观众重新创造卡罗尔最初的目标受众可能会唤起的信息和感受。\n诗歌与技术文本不同，是一种创造性的媒介，需要以创造性的方式进行翻译，以便将原始信息和情感传递给目标受众。然而，过于有创意和远离 ST 可能会冒着改变信息的风险，并可能引发与作者最初意图不同的情绪。雅各布森指出，由于带有其自主意义的语言代码的独特特征，“根据定义，诗歌是不可翻译的”（1959：238）。我认为“Jabberwocky”的情况并非如此，因为日语译者已经实现了连贯的翻译，尽可能地匹配与原文相同的信息，同时还保持了诗的创作风格，借鉴了卡罗尔的一些捏造词汇。这保持了与源文本相似的感觉，同时还通过释义一些捏造的词汇使日本观众更容易理解。尽管在这些情况下，人们可能会争辩说译者正在失去原文的含义并唤起不同的情感，但贝克讨论了文本是否一致取决于个人读者及其对世界的理解（贝克 1992：233）。根据她的定义，一些日本本土读者可能会发现一首诗比其他诗更符合源文本。因此，这使得作为学者很难判断文本中是否实现了对等；虽然我相信这两首诗都达到了对等，但其他学者可能不会。\n注意：我没有列出我的参考文献，以防有人决定复制这篇文章。 （如果有人愚蠢到抄袭这篇文章，他们会立即被发现抄袭，因为大学有程序可以检查互联网上的此类内容。）太棒了，滑溜溜的托夫在 wabe 中旋转和摇晃；所有的 mimsy 都是 borogoves，而 mome raths 不屑一顾。当心Jabberwock，我的儿子！咬人的下巴，抓住的爪子！当心 Jubjub 鸟，避开烦躁的 Bandersnatch！他手里拿着他的 vorpal 剑：他寻找的曼苏姆敌人已经很久了 所以他在 Tumtum 树旁休息，站了一会儿陷入沉思。就像他以为他站着一样， Jabberwock，带着火焰的眼睛， 嗖嗖嗖嗖地穿过塔尔吉树林， 来的时候发出咕噜咕噜的声音！一二！一二！并且通过和通过vorpal刀片去窃笑小吃！他让它死了，他带着它的头飞快地回去了。\n你杀了 Jabberwock 吗？来到我的怀里，我喜气洋洋的孩子！哦，美好的一天！Callooh！Callay！他在他的快乐中咯咯地笑着。而妈妈却很生气。\n没关系，就算是蛇，也是沙蛇。”是的，喂！即便是这把刀，也只能作为刀刃使用。 “你打倒邪恶的阿里奥鬼了吗？对不起。来吧，我的皮卡坦森。\n哦，真是有趣的一天。 Yuuhi Kirara 一定是绕来绕去的 Toov 和被称为“Itokayo”的 Laas 位于鲁巴，呈圆形。\n所有弱点都是Borogove，因此是Satoto Lars的尖叫。 “我的儿子，当心贾伯沃克！咬牙（Agito），爪子抓！不要担心 Jubjub Birds，也不要停留在阴燃的 Bandersnatch！ 』\\ Vorpal的剑（剑），捡起来，寻找像尾巴一样的东西。\n在其余的旁边，有一棵Tamtam树，当时我在一种暴力的感觉中停下来，当时，一个灼热双眼的Jabberwock，以及一个穿过Tarjii森林并得到的Jabberwock生气。（做）我想知道我是否正在接近那里！一二！一二！ Vorpal 的剑，刺穿，仍然刺穿，被斩断接住！\n从 Jabberwock 开始的生活，从脖子到英雄。他踏上凯旋归来的驰骋。 “对了，Jabberwock的失败是真的吗？靠近我的手臂，我是一个红发男孩！这一天似乎是个好天气！是花柳吗？是不是很厉害！ 』\\父亲高兴地咯咯笑。晚火时，粘托夫位于哈鲁巴，有一个圆形的手镯。所有弱点都是Borogove，因此是Satoto Lars的呻吟。", "note_en": "This is one of my favourite essays from my MA in Translation Theory and Practice. The MA certainly focuses more on the theory side of translation which is evident from this essay. The point of the essay was to compare two translations of a text and discuss their “equivalence” on various levels.\n I chose the Jabberwocky because it’s a poem that I grew up with. I learnt the lyrics when I was about 7 and can still recite them in full today. So exploring two Japanese translations were very exciting for me.\n     Achieving equivalence when translating a source text (ST) to a target text (TT) in another language is a translator’s main goal.\n However, many theorists debate what determines equivalence between texts, whether it is between corresponding lexical utterances (Catford 1965; Baker 1992), on a syntactic level (Nida 1964; Nida 2000; Baker 1992), a semantic level (Nida and Taber 1982; Newmark 1981), stylistic or discursive.\n Also, which equivalence a translation will use depends on a number of factors including the type of text, its message, the purpose of the author, the intention of the translator (bias towards ST or TT), and the audience (Newmark 1981: 20-21, 39; Nida and Taber 1982: 31; Nida 2000: 127).\n To discuss the various text types, audiences and aims would be too much for a the scope of this essay, so I wish to focus on one text in particular; the poetic work of Lewis Carroll’s  “Jabberwocky”.\n  Poetry is particularly interesting to analyse in regards to equivalence because it has a strong base in the culture, poetic styles, and abstract meanings of its source language. Translators of poetry have to deal with these issues of translating the meaning versus utterances, to make it faithful to the ST while also making it understandable and meaningful in the TT (see Nida 2000: 131).\n This essay will look at these issues when trying to achieve equivalence in two Japanese translations of the “Jabberwocky” by Yanagawa (Carroll 1994) and Sawasaki (2008)., focusing on the lexical aspects of the poems and drawing on previous theories of equivalence, Baker’s in particular.\n   One way a translation can achieve equivalence is at a lexical or, as Baker (1992) says, at the word level. The “Jabberwocky” is a piece written in 1871 for the book  Through the Looking Glass. It was written as, what some people view, a “nonsense poem” (Klug 2000: 4) due to the large number of fabricated words by Caroll. However, when you break down the so-called ‘fabricated’ utterances you can see there is some sense to them in the English language which has been drawn upon in the Japanese translations.\n Take the word “frumious” (which describes the Bandersnatch, a fictional monster) for example. In English this word draws upon the words ‘furious’ and ‘fuming’ both of which mean ‘angry’, but ‘fuming’ carries with it a ‘smoking’ meaning as well.\n Yagawa has translated this to  takeburu which draws on the words  takeru which means ‘to be fierce’ and  keburu which means ‘to smoke’. Whereas Sawasaki translated this word to  iburikurueru, using  iburidau, ‘to smoke an animal out’ and  kuruu, ‘to go mad’.\n Both of these use imagery close to the English “frumious” with similar ‘smoky’ words for ‘fuming’, although they varied on their interpretations of ‘furious’ to ‘fierce’ or ‘mad’.\n Baker’s theory of equivalence at the word level focuses on how direct equivalence is unachievable between texts, and so different approaches are needed to achieve equivalence at the word level (Baker 1992: 18-21).\n Although she focuses on the issue of translating words with affixes, Baker’s concept of non-equivalence in different forms (ibid: 21) is most appropriate for this issue of fabricated words in the source text.\n Both Yagawa and Sawasaki have achieved equivalences for “frumious” by paraphrasing it (ibid: 38), using their own fabricated words in Japanese, a similar tactic as Carroll, who drew upon two words in his native language to create a new one.\n   Yagawa and Sawasaki do not use this tactic with every fabricated word in the text however, such as with the word “burble” (to describe the noise of the Jabberwocky as it approaches), which Caroll himself was quoted as originating from English words ‘bleat’, ‘murmur’ and ‘warble’ (Carroll 2009).\n The translators have tried to achieve equivalence using what Baker calls “translation by paraphrase using unrelated word” (Baker 1992: 38), a tactic similar to the previous one but using a modified subordinate clause rather than changing the form of the language.\n Yagawa uses  sawaga mashiku which means ‘noisily at full speed’. Sawasaki translates it to  domekizuri which uses the  onyomi (reading based on the original Chinese) of the kanji meaning ‘angry’,  mekimeki, meaning ‘conspicuously’, and  zuriagaru which means ‘to creep up’.\n Sawasaki uses a similar approach to Carroll by combining three words, which creates a fabricated word in Japanese meaning ‘angrily creeps up conspicuously’. Although he uses the same approach he loses a lot of the original imagery.\n Yagawa does attempt to maintain the imagery of the sound the Jabberwocky is making, but neither have drawn upon the full English origins for this word, and have instead focused on the way the creature is moving by translating the word to subordinate clauses.\n   The “Jabberwocky” is not entirely made up of fabricated words and the way the two translators have translated the standard English utterances are important to touch upon.\n The phenomenon when a word in the ST has direct correspondence with a word in the TT has been approached by a few theorists, including Catford (1965). He composed the idea of textual equivalence which is “any TL form (text or portion of text) which is observed to be the equivalent of a given SL form (text or portion of text)” (Catford 1965; 27).\n He uses the example of ‘son’ in English compared to the French  fil, which can also be seen in the “Jabberwocky” where both translators have translated ‘son’ to  musuko in Japanese.\n Textual equivalence can be viewed at a number of points in the poems where both translators have used the same corresponding utterances, such as  tsurugi which means ‘sword’, or  mori, ‘forest’.   However, this is not the case with all utterances where you might expect textual equivalence to apply, such as ‘claws’ which Yagawa translates to  tsume and Sawasaki translates to  kagitsume. The latter meaning ‘hooked claws’ is a slight shift in meaning from the ST for the sake of poetic effect and imagery.\n This goes against Catford’s theory of textual equivalence, although he does say that texts which do not have an equivalent in the target language will have shifts in levels or categories of the text (Catford 1965: 73).\n Sawasaki, however, did not shift the meaning of the translation because there was no direct translation from the ST. Parallel to textual equivalence Catford theorised what he called formal correspondence.\n This is translation that is “only approximate” (idib: 32) because it is achieved when two languages “occupy, as nearly as possible, the ‘same’ place in the ‘economy’ of the TL as the given SL category occupies in the SL” (ibid: 27). Which means that Sawasaki’s translation of ‘claw’ to ‘hooked claw’ can still be considered a form of equivalence as it ‘occupies’ a ‘close approximation’ to the original.\n   Similar to Catford, Nida theorised formal equivalence, where the “message in the receptor language should match as closely as possible the different elements in the source language.\n This means, for example, that the message in the receptor culture is constantly compared with the message in the source culture to determine standards of accuracy and correctness” (Nida in Venuti: 127).\n In other words, achieving formal equivalence can be determined by how closely a translator matches the TT to the ST.\n There are issues with these approaches however, as Catford and Nida’s approaches display a bias towards the ST, stating that equivalence is only achieved when the TT is translated as close to the original lexis, syntax, style etc. as possible. If this were the case, the already difficult to understand “Jabberwocky” would become completely incomprehensible to a Japanese audience.\n However, there are instances in this case where the translator does not use these approaches and completely changes the lexis of the original to suit the target audience. One such instance is the line “He went galumphing back” (Carroll 2009) which Sawasaki translates to  kare wa ikitoutou taru gaisen no gyaroppu wo fumu, which back translates to ‘his heart [going] step-step he stepped a triumphant return gallop’.\n Although it still conveys the same image of the boy returning, Sawasaki has re-worded it to suit a Japanese audience using Japanese onomatopoeia to form a more descriptive image.\n   In the instance above, the translator has used what Nida calls dynamic equivalence, where in “translation one is not so concerned with matching the receptor-language message with the source-language message, but…the relationship between receptor and message should be substantially the same as that which existed between the original receptors and the message” (Nida 2000: 129).\n In other words, at parts in the “Jabberwocky” the translators Sawasaki and Yagawa depart from translating the poem word-for-word and create a dynamic equivalence that re-creates the message and feelings that might have been evoked in Carroll’s original English text for a Japanese audience.\n  This dynamic approach, according to Nida and Taber (1982 :22), has, in most translations, a higher priority over formal equivalence, and a translator must consider the needs of the audience over the forms of the language (ibid: 31).\n This is especially the case in poetry translations where there is a great need to focus on “reproducing the emotional intensity and flavour” (Nida 2000: 127). One should not translate a poem as if it were prose, but compose another poem in the target language which will have a life of its own separate from its source text (Matthews 1959 in Nida 2000: 127).\n This would explain how both translators have created Japanese versions of the original that convey the original message while also being two different texts in their own right. One example is the line in Carroll’s text “One, two! One, two! And through and through”, which Yagawa translates to  Ei, ya! Ei, yaa! Koredemo kato bakari which means ‘ Ei, ya! Ei, yaa! Even this [he did] more of’, implying the boy shouting a lot as he fights.\n Sawasaki translates this to:  ichi, ni! Ichi, ni! Tsuranukite nao mo tsuranuku which is a closer translation to the original, back translating to ‘One, two! One, two! Through and through more’.\n As you can see here, both translators have attempted to keep the syntactic structure of the original but have composed their own unique works in Japanese at the same time. Although Yagawa has moved away from the ST more than Sawasaki she has tried to balance the message with the line sounding natural in Japanese.\n   Just like Yagawa, translators are faced with the issue of accuracy to the source text and naturalness in the target text, and finding an appropriate balance between the two. Baker discussed this issue in terms of collocations, where translators are faced with “a difficult choice between what is typical and what is accurate” (Baker 1992: 60).\n Although a sentence might be changed in the TT, it could inadvertently change the meaning slightly for the target audience. This is not necessarily a bad thing, as certain words and collocations are heavily based in cultural understandings which might not transfer to another culture and changing the meaning slightly may make it more understandable in the TT.\n These culturally specific collocations are difficult to observe in the “Jabberwocky” due to the large quantity of fabricated lexis which create non-standard collocations in English in the first place, such as “the Jabberwock with eyes of flame” which is a marked collocation between ‘eyes’ and ‘flame’.\n Unusual collocations such as these are what Baker (1992: 55) calls marked collocations, unusual combinations of words deliberately chosen to create new images and to challenge our expectations as readers. This is normally used in fiction, humour, news, advertisements and poetry.\n Sawasaki translated this to  ryou no manako wo keikei to moyashitaru ‘both eyes glaring and burning’; whereas Yagawa’s translation is  manako ranran which means ‘eyes glaring’ or ‘burning’.\n Both Sawasaki and Yagawa’s translations have attempted to keep the ‘fiery’ image, but have lost some accuracy in favour of naturalness by using more natural collocations in Japanese with the words that state the Jabberwocky is glaring, which is only implied in the marked collocation in English.\n This balance of naturalness and accuracy of message is arguably the most difficult task for a translator in poetry transition due to the cultural embedded ideas and abstract nature of poetry.\n   There are many issues translators face in order to achieve equivalence, which is most likely why Catford (1965: 27) stated that translation was an “empirical phenomenon”.\n This essay discussed how equivalence was achieved in two different Japanese translations of the poem “Jabberwocky”, focusing on the lexical differences based on previous theories of equivalence.\n Both Yagawa and Sawasaki handled Carroll’s fabricated words in different ways, although both attempted their own fabricated Japanese words, but neither translator used the exact same wording, instead using their own interpretations of the English to paraphrase the meaning in their translations.\n This is the same with the non-fabricated words, as each translator has interpreted them in their own way.\n In some instances their translations match with Catford’s theory of textual equivalence, and at other times his theory of formal correspondence, but neither of the full texts match either of his theories entirely.\n This is mostly due to a number of issues with Catford’s work, including  his concentrating on achieving equivalence when a TT is as close to the ST as possible, although some shifts may be needed for it to make sense in the TT.\n The problem with this is that poetry, especially the “Jabberwocky”, is not something one can directly translate word-for-word, and even with shifts it would not make sense to the target Japanese audience.\n Nida and Taber’s theories focus more on the audience and that equivalence is achieved when the message is accurately translated from ST to TT.\n I would argue that this is achieved in Yagawa and Sawasaki’s translations, as they attempt to re-create the message and feelings that might have been evoked in Carroll’s original target audience for their Japanese audience.\n  Poetry, unlike a technical text, is a creative medium and needs to be translated in a creative way for the original message and emotions to transfer to the target audience.\n Being too creative and moving away from the ST, however, can risk changing the message and may evoke emotions that are different from what the author originally intended. Jakobson states how, due to distinctive features of verbal code which carry their own autonomous signification, “poetry by definition is untranslatable” (1959: 238).\n I would argue that this is not the case with “Jabberwocky” as the Japanese translators have achieved coherent translations that match, as best they can, the same message as the original while also maintaining the creative style of the poem drawing upon some of Carroll’s fabricated lexis.\n This maintains a similar feeling as the source text, while also making it more understandable for a Japanese audience by paraphrasing some of the fabricated lexis.\n Although in these instances one might argue the translators are losing the meaning of the original and are evoking different emotions, but Baker discusses whether a text coheres or not depends on the individual reader and their understanding of the world (Baker 1992: 233).\n By her definition some native Japanese readers might find one poem more equivalent to the source text than others.\n This therefore makes it difficult to judge as a scholar if equivalence is achieved in a text or not; although I believe equivalence is achieved in both these poems, other scholars might not.\n     Note: I haven’t listed my references in case someone decides to copy this essay.\n (And if someone was stupid enough to copy this essay they will be discovered for plagiarism right away because Universities have programs which check the internet for this kind of stuff.)\n    Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe.\n Beware the Jabberwock, my son! The jaws that bite, the claws that catch! Beware the Jubjub bird, and shun The frumious Bandersnatch!\n He took his vorpal sword in hand: Long time the manxome foe he sought So rested he by the Tumtum tree, And stood awhile in thought.\n And as in uffish thought he stood, The Jabberwock, with eyes of flame, Came whiffling through the tulgey wood, And burbled as it came!\n One, two! One, two! And through and through The vorpal blade went snicker-snack! He left it dead, and with its head He went galumphing back.\n And hast thou slain the Jabberwock? Come to my arms, my beamish boy! O frabjous day! Callooh! Callay! He chortled in his joy.\n Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe.\n    ゆうまだきらら　しなねばトオヴ\n まわるかのうち　じゃいってきりる\n いとかよわれの　おんボロゴオヴ\n までたるラアス　ほさめすりつつ\n 「むすこよ　邪婆有尾鬼にゃ心ゆるすな\n   いいか　たけぶる万蛇砂魑にも」\n      かの邪婆有尾鬼がまなこらんらん\n 重る木の森をびゅるびゅると過ぎ\n  えい、や！えい、やあ！これでもかとばかり\n ことしえる刃でしたたかぐさり！\n   「邪婆有尾鬼をやっつけたんだと？\n でかしたぞ　来い　わがピカ天息子\n ああ愉快なる日よ　あっぱれかっぽれ！」\n  ゆうまだきらら　しなねばトオヴ\n まわるかのうち　じゃいってきりる\n いとかよわれの　おんボロゴオヴ\n までたるラアス　ほさめすりつつ\n    夕火（あぶり）の刻、粘滑（ねばらか）なるトーヴ\n 遥場（はるば）にありて回儀（まわりふるま）い錐穿（きりうが）つ。\n 総て弱ぼらしきはボロゴーヴ、 かくて郷遠（さととお）しラースのうずめき叫ばん。\n 『我が息子よ、ジャバウォックに用心あれ！\n 喰らいつく顎（あぎと）、引き掴む鈎爪！\n ジャブジャブ鳥にも心配るべし、そして努（ゆめ）\n 燻り狂えるバンダースナッチの傍に寄るべからず！』\n ヴォーパルの剣（つるぎ）ぞ手に取りて\n 尾揃（おそろ）しき物探すこと永きに渉れり\n 憩う傍らにあるはタムタムの樹、\n  かくて暴（ぼう）なる想いに立ち止まりしその折、\n 両の眼（まなこ）を炯々（けいけい）と燃やしたるジャバウォック、\n そよそよとタルジイの森移ろい抜けて、\n 怒（ど）めきずりつつもそこに迫り来たらん！\n 一、二！　一、二！　貫きて尚も貫く\n ヴォーパルの剣（つるぎ）が刻み刈り獲らん！\n ジャバウォックからは命を、勇士へは首を。\n 彼は意気踏々（いきとうとう）たる凱旋のギャロップを踏む。\n 『さてもジャバウォックの討ち倒されしは真（まこと）なりや？\n 我が腕（かいな）に来たれ、赤射（せきしゃ）の男子（おのこ）よ！\n おお芳晴（かんば）らしき日よ！　花柳かな！　華麗かな！』\n 父は喜びにクスクスと鼻を鳴らせり。\n 夕火（あぶり）の刻、粘滑（ねばらか）なるトーヴ 遥場（はるば）にありて回儀（まわりふるま）い錐穿（きりうが）つ。 総（すべ）て弱ぼらしきはボロゴーヴ、 かくて郷遠（さととお）しラースのうずめき叫ばん。", "posttime": "2021-07-24 07:00:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,胡言乱语,jabberwocky,翻译", "title": "两首日本胡言乱语诗（2017）", "title_en": "Two Japanese Jabberwocky Poems (2017)", "transed": 1, "url": "https://j-entranslations.com/two-japanese-jabberwocky-poems/", "via": "", "real_tags": ["日本", "胡言乱语", "翻译"]}, {"category": "", "categoryclass": "", "imagename": "48a3b53842fb9c8f700659443747d789.png", "infoid": 1069288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在之前的一些博客文章中，我们详细描述了如何通过将图转换合并到代码生成中来泛化自动微分以自动增强稳定性和各种其他细节。但是，我们没有过多讨论的一件事是这些类型的算法的局限性。这种限制就是我们所说的“准静态”，即一种算法可以重新解释为某种静态算法的特性。事实证明，出于非常根本的原因，这与某些主要机器学习框架对它们可以完全优化的代码（例如 Jax 或 Tensorflow）强加的限制相同。这让我们产生了一个问题：在这种心态下是否存在不可优化的算法，为什么？答案现已在 ICML 2021 上发布，让我们深入研究这个更高层次的概念。首先，让我们对什么是准静态算法有一个具体的想法。它是算法空间，可以以某种方式重新表示为静态算法。可以将“静态算法”视为具有不需要完整计算机描述的简单数学描述的算法，即没有循环、重写到内存等。作为示例，让我们看一下 Jax 文档中的一个示例。下面是Jax JIT的作用： 注意它是用控制流表示的，即用循环表示的代码，但是循环不是必须的 我们也可以把这个方法理解为2*2*2 *x 或 8*x。默认情况下 JIT 将失败的示例是：@jit def f (x): if x &lt; 3: return 3. * x ** 2 else: return - 4 * x # 这将失败！ try: f ( 2 ) except Exception as e: print ( &quot;Exception {}&quot;.format (e) ) 在这种情况下，我们可以看到本质上有两个计算图在 x&lt;3 处拆分，因此如上所述这并没有有一个描述计算的数学语句。你可以通过执行 lax.cond(x &lt; 3, 3. * x ** 2, -4 * x) 来解决这个问题，但请注意这是一个根本不同的计算：lax.cond 形式总是计算 if 的两边在选择要结转哪一个之前的语句，而 true if 语句根据条件更改其计算。 lax.cond 形式之所以如此适用于 Jax 的 JIT 编译系统，是因为它是准静态的。将发生的计算是固定的，即使结果不是，而原始 if 语句将更改基于输入值计算的内容。存在此限制是因为 Jax 跟踪程序以尝试在以下情况下构建静态计算图hood，然后尝试在该图上进行实际转换。还有其他类型的框架可以做类似的事情吗？事实证明，可转换为纯符号语言的算法集是准静态算法集，所以像 Symbolics.jl 这样的东西在其算法的行为中也有一种准静态表现形式。也是出于同样的原因：在符号算法中，您可以定义诸如“x”和“y”之类的符号变量，然后通过程序进行交易以构建“2x^2 + 3y”的静态计算图，然后您对其进行符号处理。在常见问题中，有一个问题是当函数到符号的转换失败时会发生什么。如果你看一下例子： function factorial (x ) out = x while x &gt; 1 x -= 1 out *= x end out end @variables xfactorial (x ) 你可以看到这是因为算法不能表示为单个数学表达式：阶乘不能写为固定乘法次数，因为乘法次数取决于您尝试计算 x 的值 x！为了！符号语言抛出的错误是“ERROR: TypeError: non-boolean (Num) used in boolean context”，这是说它不知道如何符号扩展“while x &gt; 1”来表示它静态地。这不是不一定“可修复”的东西，这是该算法无法由固定计算表示并且必须需要根据输入更改计算这一事实的基础。\n“解决方案”是通过“@register factorial(x)”为图形定义一个新的原语，这样这个函数本身就是一个固定节点，不会尝试进行符号扩展。这与定义 Jax 原语或 Tensorflow 原语的概念相同，其中算法根本不是准静态的，因此获得准静态计算图的方法是将动态块视为函数“y = f (x)”是注定存在的。在符号语言和机器学习框架的上下文中，要使其充分发挥作用，您还需要定义所述函数的导数。最后一部分是捕获。如果您再看一下其中一些工具的文档的深度，您会注意到许多表示非静态控制流的原语都超出了完全处理的领域。在文档中，它指出您可以用 lax.while_loop 替换 while 循环，但这不适用于反向模式自动微分。原因是因为它的反向模式 AD 实现假设存在这种准静态算法并将其用于两个目的，一是用于生成反向传递，二是生成算法的 XLA（“Tensorflow”）描述，然后进行 JIT 编译优化。 XLA 需要静态计算图，对于这种情况，它也不一定存在，因此存在基本限制。解决这个问题的方法当然是用它自己的快速梯度计算定义你自己的原语，这个问题就消失了......有机器学习框架不假设准静态但也优化，大多数Julia 编程语言中的 Diffractor.jl、Zygote.jl 和 Enzyme.jl（注意 PyTorch 不假设准静态表示，尽管 TorchScript 的 JIT 编译会）。这让我思考：是否存在真正的机器学习算法，这是一个真正的限制？这是一个很好的问题，因为如果你提出像卷积神经网络这样的标准方法，那就是一个固定函数内核调用，定义了一个很好的导数，或者一个循环神经网络，这是一个固定大小的循环。如果你想打破这个假设，你必须进入一个基本上关于算法的空间，在那里你无法知道“计算量”，直到你知道问题中的特定值，而方程求解器就是这种形式。牛顿法收敛需要多少步？自适应 ODE 求解器需要多少步？这不是可以先验回答的问题：它们基本上是需要了解的问题：因此，在 Python 框架中工作的人们一直在寻找处理方程求解的“正确”方法（ODE 求解，求根 f( x)=0 等）作为黑盒表示。如果你再看一下神经常微分方程论文，它提出的一项重要建议是将神经 ODE 处理为一个黑盒，其导数由 ODE 伴随定义。原因当然是因为自适应 ODE 求解器必须迭代到容差，所以必然存在诸如“while t &lt;tend”之类的东西，这取决于当前计算是否计算到容差。作为在他们工作的框架中没有优化的东西，这是使算法工作所必需的。不，将此类算法视为黑盒并不是根本。事实上，几年前我们有一篇相当受欢迎的论文，表明可以通过一些 Julia AD 工具直接使用正向和反向模式自动微分训练神经随机微分方程。原因是因为这些 AD 工具（Zygote、Diffractor、Enzyme 等）由于它们如何进行直接的源到源转换而不一定采用准静态形式，因此它们可以直接区分自适应求解器并吐出正确的梯度。所以你不一定要以“定义一个 Tensorflow op”的风格来做，但哪个更好？事实证明，“更好”真的很难定义，因为这两种算法不一定相同并且可以计算不同的值。您可以将其归结为：您是要对方程的求解器进行微分，还是要对方程进行微分并对其应用求解器？前者相当于算法的自动微分，称为离散灵敏度分析或离散然后优化。后者是连续敏感性分析或优化然后离散化的方法。机器学习并不是第一个遇到这个问题的领域，所以关于通用微分方程和科学机器学习生态系统的论文有一个相当长的描述，我将引用：“”“之前的研究表明离散伴随方法是在某些情况下比连续伴随更稳定 [41, 37, 42, 43, 44, 45] 而连续伴随已被证明在其他情况下更稳定 [46, 43] 并且可以减少虚假振荡 [47, 48, 49] . 离散和连续伴随方法之间的这种权衡已经在一些方程中被证明是稳定性和计算效率之间的权衡 [50, 51, 52, 53, 54, 55, 56, 57, 58]。必须小心被视为伴随方法的稳定性可能取决于所选的离散化方法 [59, 60, 61, 62, 63]，我们的软件贡献帮助研究人员在所有这些优化方法之间切换，并结合数百个微分方程求解er 方法只需一行代码更改。 &quot;&quot;&quot;\n或者，tl; dr：有大量先前的研究表明，连续伴随词不如离散伴随词稳定，但它们可以更快。我们最近进行了跟进，表明这些说法在现代软件的现代问题上是正确的。具体来说，这篇关于刚性神经 ODE 的论文说明了为什么在多尺度数据上训练时离散伴随比连续伴随更稳定，但我们最近还表明，连续伴随在梯度计算方面比（某些）当前用于离散伴随的 AD 技术要快得多。好吧，如果您正在处理这些硬微分方程、微分偏微分方程等，那么使用离散伴随技术确实有好处，这在 80 年代在控制理论领域就已为人所知。但除此之外，这是一种洗礼，因此尚不清楚区分此类算法在机器学习中是否更好，对吗？这现在让我们了解最近的 ICML 论文如何适应这种叙述。是否存在真正对标准机器学习有用的非准静态算法？答案是肯定的，但是如何到达那里需要一些巧妙的技巧。首先，设置。神经 ODE 可能是一种有趣的机器学习方法，因为它们使用自适应 ODE 求解器从本质上为您选择层数，因此它就像一个循环神经网络（或者更具体地说，像一个残差神经网络）自动找到“正确”层数，其中层数是 ODE 求解器决定采取的步数。换句话说，用于图像处理的神经 ODE 是一种自动进行超参数优化的算法。整洁的！但是……“正确”的层数是多少？对于超参数优化，您会假设这将是“准确预测的最少层数”。但是，默认情况下，神经 ODE 不会为您提供那么多层：它们会给您任何感觉。事实上，如果你看一下原始的神经 ODE 论文，随着神经 ODE 训练它不断增加它使用的层数：那么有没有办法改变神经 ODE 以使其将“正确的层数”定义为“最少的层数”？在学习易于求解的微分方程的工作中，他们就是这样做的。他们是如何做到的，他们正则化了神经 ODE 的训练过程。他们查看了解决方案并指出，发生更多变化的 ODE 必然更难求解，因此您可以通过添加一个表示“使高阶导数项尽可能小”的正则化项将训练过程转换为超参数优化.本文的其余部分是如何实现这个想法。那是怎么做的？好吧，如果您必须将算法视为黑盒，则需要定义一些黑盒方法来定义高阶导数，从而导致 Jesse 非常酷的泰勒模式自动微分公式。但无论你怎么说，这都将是一个昂贵的计算对象：计算梯度比前向传递更昂贵，二阶导数比梯度更贵，三阶等等，所以一个需要六阶导数的算法训练会很讨厌。通过一些非常英勇的工作，他们得到了这个黑盒操作的公式，它需要两倍的时间来训练，但成功地完成了超参数优化。有没有办法通过神经 ODE 训练更快地进行自动超参数优化？是的，我们的论文不仅使它们的训练速度比其他方法快，而且比普通神经 ODE 训练速度更快。我们可以使层超参数优化不那么免费：我们可以使它比不进行优化更便宜！但是如何？诀窍是打开黑匣子。让我向您展示自适应 ODE 求解器的步骤是什么样的：请注意，自适应 ODE 求解器通过使用误差估计来选择时间步长是否合适。 ODE 算法的实际构造是为了免费计算误差估计值，即“这个 ODE 求解的难度”的估计值。如果我们使用这个自由误差估计作为我们的正则化技术会怎样？事实证明，训练速度比以前快 10 倍，同时类似地自动执行超参数优化。\n请注意我们结束的地方：结果算法不一定是准静态的。该误差估计是通过自适应 ODE 求解器的实际步骤计算的：要计算该误差估计，您必须执行与 ODE 求解器相同的计算和相同的 while 循环。在此算法中，您无法避免直接对 ODE 求解器进行微分，因为 ODE 求解器的内部计算部分现在是正则化的一部分。这从根本上没有被需要准静态计算图（Jax、Tensorflow 等）的方法优化，并且这使得超参数优化比不进行超参数优化更便宜，因为正则化器是免费计算的。我只是觉得这个结果太酷了！所以是的，这篇论文是一篇关于如何使用神经 ODE 的技巧免费进行超参数优化的机器学习论文，但我认为它所处的一般软件上下文突出了论文的真实发现。这是我所知道的第一个算法，它有明确的动机用于现代机器学习，而且，Jax 和 Tensorflow 等常见机器学习框架无法处理它们是有根本原因的最佳。即使是 PyTorch 的 TorchScript，由于其编译过程的假设，从根本上也不会在该算法上工作。这些假设是明智地选择的，因为大多数算法都可以满足它们，但这个算法不能。这是否意味着机器学习在算法上停滞不前？可能是因为我完全相信在不优化此算法的工具集中工作的人永远不会找到它，这让我非常发人深省。还有哪些算法比我们当前的方法更好，但仅因为当前的机器学习框架而更差？我迫不及待地等到 Diffractor.jl 的发布才开始深入探讨这个问题。", "note_en": "In some previous blog posts we described in details how  one can generalize automatic differentiation to give automatically stability enhancements and all sorts of other niceties by incorporating graph transformations into code generation. However, one of the things which we didn&#39;t go into too much is the limitation of these types of algorithms. This limitation is what we have termed &#34;quasi-static&#34; which is the property that an algorithm can be reinterpreted as some static algorithm. It turns out that for very fundamental reasons, this is the same limitation that some major machine learning frameworks impose on the code that they can fully optimize, such as Jax or Tensorflow. This led us to the question: are there algorithms which are not optimizable within this mindset, and why?  The answer is now published at ICML 2021, so lets dig into this higher level concept.\n  First of all, lets come up with a concrete idea of what a quasi-static algorithm is. It&#39;s the space of algorithms which in some way can be re-expressed as a static algorithm. Think of a &#34;static algorithm&#34; as one which has a simple mathematical description that does not require a full computer description, i.e. no loops, rewriting to memory, etc. As an example, let&#39;s take a look at an example from  the Jax documentation. The following is something that the Jax JIT works on:\n  Notice that it&#39;s represented by something with control flow, i.e. it is code represented with a loop, but the  but the loop is not necessary We can also understand this method as 2*2*2*x or 8*x. The demonstrated example of where the JIT will fail by default is:\n @jit def f (x ):  if x  &lt;  3:  return  3. * x **  2  else:  return - 4 * x  # This will fail! try: f ( 2 ) except  Exception  as e:  print ( &#34;Exception {}&#34;. format (e ) )\n In this case, we can see that there&#39;s essentially two compute graphs split at x&lt;3, and so as stated this does not have a single mathematical statement that describes the computation. You can get around this by doing lax.cond(x &lt; 3, 3. * x ** 2, -4 * x), but notice this is a fundamentally different computation: the lax.cond form always computes both sides of the if statement before choosing which one to carry forward, while the true if statement changes its computation based on the conditional. The reason why the lax.cond form thus works with Jax&#39;s JIT compilation system is thus because it is quasi-static. The computations that will occur are fixed, even if the result is not, while the original if statement will change what is computed based on the input values.This limitation exists because Jax traces through a program to attempt to build the static compute graph under the hood, and it then attempts to do its actual transformations on this graph. Are there other kinds of frameworks that do something similar? It also turns out that the set of algorithms which are transformable into purely symbolic languages is the set of quasi-static algorithms, so something like  Symbolics.jl also has a form of quasi-staticness manifest in the behaviors of its algorithms. And it&#39;s for the same reason: in symbolic algorithms you define symbolic variables like &#34;x&#34; and &#34;y&#34;, and then trade through a program to build a static compute graph for &#34;2x^2 + 3y&#34; which you then treat symbolically. In the  frequently asked questions, there is a question for what happens when a conversion of a function to symbolic fails. If you take a look at the example:\n function factorial (x ) out = x  while x  &gt;  1 x -=  1 out  *= x  end out end @variables xfactorial (x )\n You can see that the reason for this is because the algorithm is not representable as a single mathematical expression: the factorial cannot be written as a fixed number of multiplications because the number of multiplications is dependent on that value x you&#39;re trying to compute x! for! The error that the symbolic language throws is &#34;ERROR: TypeError: non-boolean (Num) used in boolean context&#34;, which is saying that it does not know how to symbolically expand out &#34;while x &gt; 1&#34; to be able to represent it statically. And this is not something that is not necessarily &#34;fixable&#34;, it&#39;s fundamental to the fact that this algorithm is not able to be represented by a fixed computation and necessarily needs to change the computation based on the input.\n  The &#34;solution&#34; is to define a new primitive to the graph via &#34;@register factorial(x)&#34;, so that this function itself is a fixed node that does not try to be symbolically expanded. This is the same concept as defining a Jax primitive or a Tensorflow primitive, where an algorithm simply is not quasi-static and so the way to get a quasi-static compute graph is to treat the dynamic block just as a function &#34;y = f(x)&#34; that is preordained to exist. In the context of both symbolic languages and machine learning frameworks, for this to work in full you also need to define derivatives of said function. That last part is the catch. If you take another look at the  depths of the documentation of some of these tools, you&#39;ll notice that many of these primitives representing non-static control flow fall outside of the realm that is fully handled.\n  Right there in the documentation it notes that you can replace a while loop with lax.while_loop, but that is not amenable to reverse-mode automatic differentiation. The reason is because its reverse-mode AD implementation assumes that such a quasi-static algorithm exists and uses this for two purposes, one for generating the backpass but secondly for generating the XLA (&#34;Tensorflow&#34;) description of the algorithm to then JIT compile optimize. XLA wants the static compute graph, which again, does not necessarily exist for this case, hence the fundamental limitation. The way to get around this of course is then to define your own primitive with its own fast gradient calculation and this problem goes away...\n   There are machine learning frameworks which do not make the assumption of quasi-staticness but also optimize, and most of these things like Diffractor.jl, Zygote.jl, and Enzyme.jl in the Julia programming language (note PyTorch does not assume quasi-static representations, though TorchScript&#39;s JIT compilation does). This got me thinking: are there actual machine learning algorithms for which this is a real limitation? This is a good question, because if you pull up your standard methods like convolutional neural networks, that&#39;s a fixed function kernel call with a good derivative defined, or a recurrent neural network, that&#39;s a fixed size for loop. If you want to break this assumption, you have to go to a space that is fundamentally about an algorithm where you cannot know &#34;the amount of computation&#34; until you know the specific values in the problem, and equation solvers are something of this form.\n How many steps does it take for Newton&#39;s method to converge? How many steps does an adaptive ODE solver take? This is not questions that can be answered a priori: they are fundamentally questions which require knowing:\n  For this reason, people who work in Python frameworks have been looking for the &#34;right&#34; way to treat equation solving (ODE solving, finding roots f(x)=0, etc.) as a blackbox representation. If you take another look at the  Neural Ordinary Differential Equations paper, one of the big things it was proposing was the treatment of neural ODEs as a blackbox with a derivative defined by the ODE adjoint. The reason of course is because adaptive ODE solvers necessarily iterate to tolerance, so there is necessarily something like &#34;while t &lt; tend&#34; which is dependent on whether the current computations are computed to tolerance. As something not optimized in the frameworks they were working in, this is something that was required to make the algorithm work.  No it&#39;s not fundamental to have to treat such algorithms as a blackbox. In fact, we  had a rather popular paper a few years ago showing that neural stochastic differential equations can be trained with forward and reverse mode automatic differentiation directly via some Julia AD tools. The reason is because these AD tools (Zygote, Diffractor, Enzyme, etc.) do not necessarily assume quasi-static forms due to how they do direct source-to-source transformations, and so they can differentiate the adaptive solvers directly and spit out the correct gradients. So you do not necessarily have to do it in the &#34;define a Tensorflow op&#34; style, but which is better?\n It turns out that &#34;better&#34; can be really hard to define because the two algorithms are not necessarily the same and can compute different values. You can boil this down to: do you want to differentiate the solver of the equation, or do you want to differentiate the equation and apply a solver to that? The former, which is equivalent to automatic differentiation of the algorithm, is known as discrete sensitivity analysis or discrete-then-optimize. The latter is continuous sensitivity analysis or optimize-then-discretize approaches. Machine learning is not the first field to come up against this problem, so the paper on  universal differential equations and the scientific machine learning ecosystem has a rather long description that I will quote:\n &#34;&#34;&#34; Previous research has shown that the discrete adjoint approach is more stable than continuous adjoints in some cases [41, 37, 42, 43, 44, 45] while continuous adjoints have been demonstrated to be more stable in others [46, 43] and can reduce spurious oscillations [47, 48, 49]. This trade-off between discrete and continuous adjoint approaches has been demonstrated on some equations as a trade-off between stability and computational efficiency [50, 51, 52, 53, 54, 55, 56, 57, 58]. Care has to be taken as the stability of an adjoint approach can be dependent on the chosen discretization method [59, 60, 61, 62, 63], and our software contribution helps researchers switch between all of these optimization approaches in combination with hundreds of differential equation solver methods with a single line of code change. &#34;&#34;&#34;\n Or, tl;dr: there&#39;s tons of prior research which generally shows that continuous adjoints are less stable than discrete adjoints, but they can be faster. We have done recent follow-ups which show these claims are true on modern problems with modern software. Specifically,  this paper on stiff neural ODEs shows why discrete adjoints are more stable that continuous adjoints when training on multiscale data, but  we also recently showed continuous adjoints can be much faster at gradient computations than (some) current AD techniques for discrete adjoints.\n So okay, there&#39;s a true benefit to using discrete adjoint techniques if you&#39;re handling these hard stiff differential equations, differentiating partial differential equations, etc. and this has been known since the 80&#39;s in the field of control theory. But other than that, it&#39;s a wash, and so it&#39;s not clear whether differentiating such algorithms is better in machine learning, right?\n  This now brings us to how  the recent ICML paper fits into this narrative. Is there a non-quasi-static algorithm that is truly useful for standard machine learning? The answer turns out to be yes, but how to get there requires a few slick tricks. First, the setup. Neural ODEs can be an interesting method for machine learning because they use an adaptive ODE solver to essentially choose the number of layers for you, so it&#39;s like a recurrent neural network (or more specifically, like a residual neural network) that automatically finds the &#34;correct&#34; number of layers, where the number of layers is the number of steps the ODE solver decides to take. In other words, Neural ODEs for image processing are an algorithm that automatically do hyperparameter optimization. Neat!\n But... what is the &#34;correct&#34; number of layers? For hyperparameter optimization you&#39;d assume that would be &#34;the least number of layers to make predictions accurately&#34;. However, by default neural ODEs will not give you that number of layers: they will give you whatever they feel like. In fact, if you look at the original neural ODE paper, as the neural ODE trains it keeps increasing the number of layers it uses:\n  So is there a way to change the neural ODE to make it define &#34;correct number of layers&#34; as &#34;least number of layers&#34;? In the work  Learning Differential Equations that are Easy to Solve they did just that. How they did it is that they regularized the training process of the neural ODE. They looked at the solution and noted that ODEs which have more changes going on are necessarily harder to solve, so you can transform the training process into hyperparameter optimization by adding a regularization term that says &#34;make the higher order derivative terms as small as possible&#34;. The rest of the paper is how to enact this idea. How was that done? Well, if you have to treat the algorithm as a blackbox, you need to define some blackbox way to defining high order derivatives which then leads to Jesse&#39;s pretty cool formulation of Taylor-mode automatic differentiation. But no matter how you put it, that&#39;s going to be an expensive object to compute: computing the gradient is more expensive than the forward pass, and the second derivative moreso than the gradient, and the third etc, so an algorithm that wants 6th derivatives is going to be nasty to train. With some pretty heroic work they got a formulation of this blackbox operation which takes twice as long to train but successfully does the hyperparmeter optimization.\n   Is there a way to make automatic hyperparameter optimization via neural ODEs train faster? Yes,  and our paper makes them not only train faster than that other method, but makes it train faster than the vanilla neural ODE. We can make layer hyperparameter optimization less than free: we can make it cheaper than not doing the optimization! But how? The trick is to open the blackbox. Let me show you what a step of the adaptive ODE solver looks like:\n  Notice that the adaptive ODE solver chooses whether a time step is appropriate by using an error estimate.  The ODE algorithm is actually constructed so that the error estimate, the estimate of &#34;how hard this ODE is to solve&#34;, is computed for free. What if we use this free error estimate as our regularization technique? It turns out that is 10x faster to train than before, while similarly automatically performing hyperparameter optimization.\n  Notice where we have ended up: the resulting algorithm is necessarily not quasi-static. This error estimate is computed by the actual steps of the adaptive ODE solver: to compute this error estimate, you have to do the same computations, the same while loop, as the ODE solver. In this algorithm, you cannot avoid directly differentiating the ODE solver because pieces of the ODE solver&#39;s internal calculations are now part of the regularization. This is something that is fundamentally not optimized by methods that require quasi-static compute graphs (Jax, Tensorflow, etc.), and it is something that makes hyperparameter optimization cheaper than not doing hyperparameter optimization since the regularizer is computed for free. I just find this result so cool!\n  So yes, the paper is a machine learning paper on how to do hyperparameter optimization for free using a trick on neural ODEs, but I think the general software context this sits in highlights the true finding of the paper. This is the first algorithm that I know of where there is both a clear incentive for it to be used in modern machine learning, but also, there is a fundamental reason why common machine learning frameworks like Jax and Tensorflow will not be able to treat them optimally. Even PyTorch&#39;s TorchScript will fundamentally, due to the assumptions of its compilation process, not work on this algorithm. Those assumptions were smartly chosen because most algorithms can satisfy them, but this one cannot. Does this mean  machine learning is algorithmically stuck in a rut? Possibly, because I thoroughly believe that someone working within a toolset that does not optimize this algorithm would have never found it, which makes it very thought-provoking to me.\n What other algorithms are out there which are simply better than our current approaches but are worse only because of the current machine learning frameworks? I cannot wait until Diffractor.jl&#39;s release to start probing this question deeper.", "posttime": "2021-07-24 07:00:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithms,pytorch,optimized", "title": "未经 Jax、PyTorch 或 TensorFlow 优化的有用算法", "title_en": "Useful algorithms that are not optimized by Jax, PyTorch, or TensorFlow", "transed": 1, "url": "https://www.stochasticlifestyle.com/useful-algorithms-that-are-not-optimized-by-jax-pytorch-or-tensorflow/", "via": "", "real_tags": ["算法", "pytorch", "optimized"]}]