[{"category": "", "categoryclass": "", "imagename": "e704e6d38e1a7077d78c425b3f7cd718.jpeg", "infoid": 1066893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英格兰（AP）普利茅斯 -  50多年前，五月花在其开拓海上航行到美国。 现在，它的人工智能助力的名称是自己的一些故障。 ", "note_en": "PLYMOUTH, England (AP) — The Mayflower had a few false starts before its trailblazing sea voyage to America more than 400 years ago. Now, its artificial intelligence-powered namesake is having some glitches of its own. ", "posttime": "2021-06-19 22:39:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,ai,人工智能", "title": "机器人AI动力船试图回溯可能的航行，不得不回头 ", "title_en": "Robotic AI-Powered Ship Tries Retracing Mayflower's Voyage, Has to Turn Back", "transed": 1, "url": "https://apnews.com/article/science-oddities-lifestyle-technology-business-2c7bde56c626daa255e906e3423c8116", "via": "", "real_tags": ["机器人", "ai", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "a94253d49100e68876b48daa0903b552.jpeg", "infoid": 1066892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚非福顿的大多数属性包括Amazon.com和Zappos.com正在防止谷歌的跟踪系统絮状物 - 或联合学习的队列 - 根据网站代码收集反映亚马逊广阔电子商务宇宙产品研究的宝贵数据通过挖掘多达三个技术专家分析，帮助挖掘挖掘码头。\n 由于Google的系统收集有关人员网络的数据，以告知其如何对其进行分类，亚马逊的下雷达举措不仅可以对谷歌的使命来指导饼干死后的数字广告跟踪未来的重大打击 - 它可以给亚马逊a腿部以自己的努力销售在开放网上剩下的左侧的广告。\n “这一举措与谷歌试图为第三方饼干提供替代方案直接相关，”数字代理Gogway集团的企业伙伴关系副总裁Amanda Martin表示。她叫亚马逊的选择阻止了大部分地点的絮状赛的另一个例子是谷歌，Apple，Facebook和亚马逊正在制作，因为数据隐私压力强迫遭到互联网上的数据跟踪基础：第三方饼干。在三位技术人员的帮助下，挖掘最后一周在亚马逊向其数字属性添加了代码，以阻止Floc使用Google Chrome浏览器跟踪访问者。例如，虽然在本周的早期wholefoods.com和woot.com未包括块絮凝的代码，但到了星期四的挖掘，那些网站确实特征代码告诉谷歌的系统不包括他们访问者的活动，以告知队列或分配ID。但亚马逊的阻止出现散落。虽然其中一位技术人员看到了阻止絮凝的那些网站，另一个没有，另一个没有，并且说亚马逊的部署可能在国家不同地区的不同服务器中明显。\n 然而，在整个食物页面上有一个关于絮凝物的警告。虽然此处提到的其他亚马逊拥有的域，但是块絮凝物使用Google的推荐方法，涉及从HTML页面发送响应标题，但整个食品阻止使用策略从Amazon Analytics请求发送退出标题。一个人要求不被命名为这个故事的技术专家表示，这是值得注意的，因为亚马逊为大多数网站实施了谷歌推荐的方法，因此“已知为100％效力”，据该技术人员说用于阻止整个食品页面的絮凝物的方法可能是对亚马逊部分的监督或故意选择，可能是对某种的考验。谷歌表示，Floc旨在保护人们的隐私，因为它使用机器学习基于他们已查看的网页对它们进行分组而不是在个人级别跟踪它们。现在，系统处于导频阶段，组装数据指示人们感兴趣的网站，内容和产品。为什么亚马逊阻止絮凝物\n 虽然似乎很明显，亚马逊希望在任何谷歌计划中抛出扳手，但该公司有很多原因阻碍了絮絮的成功。\n 首先，亚马逊希望保护其知识产权 - 珍贵的数据显示，它显示了人们研究，审查和在线购买的产品。随着购物者的涌入预计将于6月21日和22日的主要日子涌入该网站，现在是施加电动栅栏的时间，防止谷歌喂掉该宝贵的数据槽。正如挖掘通讯上周报告的，广告科技公司和机构正在收集和分析絮凝ID数据，以提高靶向和识别能力。简而言之，它不是亚马逊的最大兴趣，让像谷歌或其他广告科技公司这样的外人利用其宝贵的购物者数据。\n 如果没有亚马逊游客在混合中，谷歌的絮状物可能处于劣势，这是一个匿名的挖掘那个机构高管表示。亚马逊选择没有阻止絮状块，公司可以通过启用“明显改善某些市场购物流的结果”来协助谷歌，说。已经，谷歌的索赔对方法的表现已经受到审查。 \n亚马逊的举动是谷歌购物者数据收集的“巨大限制”，这是一位在研究这个故事的研究中提供挖掘和要求不被命名的技术人员。 “你浏览亚马逊的是你是谁，”与广告技术相关的数据一起使用的来源说。\n 此外，阻塞絮状物是竞争决定。亚马逊拥有自己的愿望，可以通过在亚马逊属性之外销售数字广告来抓取更多广告谷歌控件。随着亚马逊的需求侧平台业务起飞，该公司计划通过亚马逊的出版商服务部门来推出跟踪和测量广告的标识符，并通过发布商通过发布商。 “它加强了[亚马逊] DSP提出来阻止它，”代理执行。\n  “为什么要给谷歌一英寸？”另外亚马逊专注的机构高管们在匿名的条件下与挖掘那些讨论过。\n 但是，在阻碍絮状物成为第三方Cookie跟踪的首选替代方案时可以帮助亚马逊，而该公司通过阻止絮凝物可以对其的一些信息丢失。与防止跟踪方法的其他出版商一样，亚马逊将无法拦截线索絮凝物ID，提供窗口进入人们的行为。可以说，考虑到它处于处置的登录购物者信息的格式，信息对亚马逊的价值有限。为什么亚马逊网站在弗洛克亚马逊拥有的电子商务网站，包括全方位，Zappos，ShopBop和Goodreads显示块的絮凝剂;然而，至少在这个故事的出版时，亚马逊拥有的书籍网站abebook没有阻止它。\n 第二个机构主管推测，亚马逊可以让谷歌的追踪者借助谷歌的追踪者来注意到的内容和书籍观察员的观察员。 “他们不仅仅是做的东西，”关于亚马逊的故意方法，执行官说。 “这必须是某种测试，”exec说。例如，虽然亚马逊在内部有很多关于与书籍有关的人的兴趣，但公司可以了解哪些絮凝物ID告诉它在网站外的Abebooks游客的利益。\n 亚马逊可能还希望了解自己的广告跟踪和定位在某种程序的控制测试中如何对谷歌进行堆叠。 “然后你可以在没有告诉他们的情况下把谷歌放在自己的赛马中，”exec说。\n 但是，亚马逊可能计划在Ad Tech研究员Krzysztof Franaszek进行Floc Research并帮助验证亚马逊的絮絮上为这个故事验证亚马逊的絮絮上，这也计划停止在Abebook上停止絮絮跟踪。公司“可能有不同的团队负责这些网站，”他说。 “也许他们没有绕过它。” ", "note_en": "Most of Amazon’s properties including Amazon.com, WholeFoods.com and Zappos.com are preventing Google’s tracking system FLoC — or Federated Learning of Cohorts — from gathering valuable data reflecting the products people research in Amazon’s vast e-commerce universe, according to website code analyzed by Digiday and three technology experts who helped Digiday review the code.\n As Google’s system gathers data about people’s web travels to inform how it categorizes them, Amazon’s under-the-radar move could not only be a significant blow to Google’s mission to guide the future of digital ad tracking after cookies die — it could give Amazon a leg up in its own efforts to sell advertising across what’s left of the open web.\n “This move is in direct correlation with Google’s attempt to provide an alternative to the third-party cookie,” said Amanda Martin, vp of enterprise partnerships at digital agency Goodway Group. She called Amazon’s choice to block FLoC on most of its sites another example of the chess moves Google, Apple, Facebook and Amazon are making as data privacy pressures force the destruction  of the foundation of data tracking across the internet:  the third party cookie.   With the help of three technologists, Digiday watched last week as Amazon added code to its digital properties to block FLoC from tracking visitors using Google’s Chrome browser. For example, while earlier in the week WholeFoods.com and Woot.com did not include code to block FLoC, by Thursday Digiday saw that those sites did feature code telling Google’s system not to include activities of their visitors to inform cohorts or assign IDs. But Amazon’s blocking appears scattered. While one of the technologists saw both of those sites blocking FLoC, another did not, and said Amazon’s deployment could be evident on different servers in different parts of the country.\n There is a caveat regarding FLoC blocking on Whole Foods pages, however. While other Amazon-owned domains mentioned here that block FLoC do so using Google’s recommended approach involving sending a response header from HTML pages, Whole Foods blocking employs a tactic that sends an opt-out header from Amazon analytics requests. One technologist who asked not to be named for this story said the distinction is noteworthy because the approach Amazon has implemented for most sites employs the approach recommended by Google, and therefore “known to be 100% effective,” according to the technologist, who said the approach used to block FLoC on Whole Foods pages could be an oversight or a deliberate choice on Amazon’s part, possibly as a test of some kind.   Google says FLoC is intended to protect people’s privacy because it uses machine learning to group them based on the web pages they have viewed rather than tracking them at the individual level. Right now, the system is in a pilot phase, assembling data indicating what websites, content and products people are interested in.   Why Amazon is blocking FLoC\n While it may seem obvious that Amazon would want to throw a wrench in any Google initiative, the company has plenty of reasons for hindering FLoC’s success.\n First, Amazon wants to protect its intellectual property — the prized data it has that shows what products people research, review and buy online. With an influx of shoppers expected to flood to the site on its Prime Days on June 21 and 22, now is the time to put up an electric fence preventing Google from feeding off that valuable data trough. Already, as reported by Digiday last week, ad tech firms and agencies are  gathering and analyzing FLoC ID data in the hopes of improving targeting and identification capabilities. Put simply, it is not in Amazon’s best interest to let outsiders like Google or other ad tech firms take advantage of its valuable shopper data.\n Without Amazon visitors in the mix, Google’s FLoC could be at a disadvantage, said one agency executive who spoke anonymously with Digiday. Had Amazon chosen not to block FLoC, the company could have assisted Google by enabling “significantly improved results of certain in-market shopping FLoCs,” said the exec. Already, Google’s claims about the performance of the method have been  subject to scrutiny.\n Amazon’s move is a “huge restriction” on Google’s shopper data gathering, said one of the technologists who assisted Digiday in research for this story and asked not to be named. “What you browse on Amazon is who you are,” said the source, who works with ad tech-related data.\n Plus, blocking FLoC is a competitive decision. Amazon has its own aspirations for grabbing more of the ad dollars Google controls by selling digital ads outside Amazon properties. As Amazon’s demand-side platform business takes off, the firm  plans to launch an identifier for tracking and measuring ads sold through the DSP and by publishers through Amazon’s publisher services division. “It strengthens [Amazon’s] DSP offering to block it,” said the agency exec.\n  “Why give Google an inch?” asked another Amazon-focused agency executive who also spoke with Digiday on condition of anonymity.\n However, while impeding FLoC from becoming a preferred alternative to third-party cookie tracking could help Amazon, the company loses out on some information that could be of value to it by blocking FLoC. Like other  publishers preventing the tracking method, Amazon will not be able to intercept the clues FLoC IDs provide that give a window into people’s behavior. Arguably, that information is of limited value to Amazon considering the trove of logged-in shopper information it has at its disposal.   Why an Amazon site is letting in FLoC   Amazon-owned e-commerce sites including WholeFoods, Zappos, ShopBop and GoodReads display code that block FLoC; however, at least at the time of this story’s publication, Amazon-owned bookselling site AbeBooks was not blocking it.\n Amazon could have a motive for enabling Google’s trackers to take note of what content and books AbeBooks visitors look at, the second agency executive speculated. “They don’t just do stuff,” said the exec regarding Amazon’s deliberate approach. “This has got to be a test of some kind,” said the exec. For instance, while Amazon has lots of data internally about people’s interests related to books, the company could want to learn what FLoC IDs tell it about the interests of AbeBooks visitors outside the site, they added.\n Amazon might also want to see how its own ad tracking and targeting stacks up against Google’s in a control test of some sort. “You could then put Google in their own horse race without telling them,” said the exec.\n But, Amazon might be planning to stop FLoC tracking on AbeBooks, too, according to ad tech researcher Krzysztof Franaszek, who has  conducted FLoC research and helped verify Amazon’s FLoC blocking for this story. The company “probably has different teams responsible for those websites,” he said. “Maybe they haven’t gotten around to it.”", "posttime": "2021-06-19 22:39:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,google,amazon,谷歌,阻止", "title": "亚马逊正在阻止谷歌的絮絮 ", "title_en": "Amazon is Blocking Google's FLoC", "transed": 1, "url": "https://digiday.com/media/amazon-is-blocking-googles-floc-and-that-could-seriously-weaken-the-fledgling-tracking-system/", "via": "", "real_tags": ["亚马逊", "google", "amazon", "谷歌", "阻止"]}, {"category": "", "categoryclass": "", "imagename": "f05002f8ee1fd5095ae5a02daee4a4d5.png", "infoid": 1066891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于面部识别技术的表观问题，在否认失业救济金后，全国各地的人们会愤怒。\n  失业收件人对身份验证服务ID.ME的几个月抱怨，它使用生物信息和官方文件的组合来证实申请人是否声称是谁。在Axios发表了关于失业欺诈威胁的基于id.me的统计数据，本周，投诉达到了另一个Crescendo。\n    一些失业申请人表示，ID.Me的面部识别模式未能妥善识别它们（一般而言，面部识别技术对于妇女和颜色人民来说是众所周知的。在他们的申请被搁置之后，因为他们的身份无法核实，许多应该是受益者必须等待几天或几周才能达到id.me“可信赖的裁判”，他们可以证实技术无法做些什么。\n  在Twitter上，关于ID.Me每天有几十个投诉，而全国各地的本地新闻文章在几个月内详细介绍了问题。在加利福尼亚州，新年前夜突然暂停140万失业受益人账目，需要使用id.me重新验证其身份的受益人，这是许多人发现困难的过程，导致他们等待几周重新激活他们的帐户挣扎成结束。\n   在科罗拉多州，在ID.ME接管之前没有问题的福利收件人在id.me接管之前，突然被拒绝了，并且没有收到他们有资格的付款。\n      id.me首席执行官布莱克霍尔告诉主板，公司的面部识别技术做一对一的匹配 - 比较一张面对同一面孔的图片（从驾驶执照，比如说） - 核心面部识别试图找到的其他应用在面部大型数据集中的脸部匹配，称为一对多匹配。\n  “用于面部匹配的算法操作效果约为99.9％，”霍尔在电子邮件中写入主板。 “肤色与面部匹配失败的情况毫无关系A 1：1基础”根据公司执行的回归分析。 \n这并不是在蒂姆维亚这样的人们在Twitter上分享的经验，拉斯维加斯的一名Gig经济职工在3月下旬突然从他的失业救济人员突然切断了Id.Me未能识别他。\n  韦弗告诉主板，当他试图传递id.me的面部识别测试时，他在他面前举行了一部手机，在指示的位置，但“它拒绝了它，没有给我们一个理由，只是拒绝了它。它拒绝了三次，然后把我锁在系统中。“\n  韦弗表示，他试图通过聊天功能联系公司的客户支持，并声称每周七天提供24小时的援助。他在一天中的所有时间都尝试过多次。他试图联系内华达州以获取帮助，但员工将他返回id.me.\n    韦弗说，这已经过去几周了，直到他发布了对公司的紧张批评，然后达到了几个令人沮丧的日子验证了韦弗的身份。\n  韦弗没有收到他的利益就去了三个星期。 “我无法支付账单，”他说。 “幸运的是，我有足够的食物，所以我不必担心这一点。这只是荒谬的。“\n  在他对主板的声明中，霍尔表示，面部识别失败不是技术的问题，而是与人们使用它来验证他们的身份。 “例如，如果有人上传只有只显示他们脸部的自拍照。”\n  “我们不知道符合条件的人，他们无法验证与id.me的身份，”他说，并“现在的等待时间现在不到五分钟，它一直不到30岁以下整个星期分钟。“ \n快速搜索id.me指示的推文显示了本公司锁定失业账户的人。\n  至少21个州使用ID.Me检测欺诈性福利索赔。该技术的传播恰逢来自大厅的积极媒体闪电师，其中他已经使用一些流体统计数据引起了对失业欺诈危机的恐惧。\n    2月，他告诉俄勒冈州电视台，失业欺诈造成了1000亿美元的价格。几个星期后，他告诉蒙大拿电视台，失业欺诈的成本占该国近2000亿美元。下个月，他告诉圣地亚哥站，失业欺诈将花费3000亿美元。到了id.me到达Axios，这是400亿美元。\n  霍尔告诉主板，俄勒冈电视台直接引用他 - 它确实归因于他的1000亿美元估计，而且他一直在1月和2月估计失业欺诈的损失约为2000亿美元。 “随着我们在更多州筛选现有索赔人，我们在6月份有更多的数据点......我估计超过4000万美元的损失，符合过去的估计。所有这些数据点随着时间的推移是一致的。“\n  大厅没有回应主板关于id.me如何计算其估计的问题。\n    失业欺诈的成功率迅速增长，因此大厅的成本估计 - 但id.me还对描绘欺诈作为一个主要问题的既得利益，这是一个大厅一再做的。这是一家对学习欺诈进行反欺诈技术的公司有意义;它＆＃39是公开的公开展会持怀疑态度，这些公司会受益于显示欺诈是一个主要问题。\n  Axios现已发布了两篇文章，该文章＆＃39; S数字，以及在Twitter上，Axios作家Felix Salmon建议在大流行期间与扩大的失业保险相关联的欺诈行为导致＆＃34;很可能是所有时间的最大盗窃。＆＃34; \nAXIOS文章已被广泛批评使用ID.Me-A公司，其经济动力充气失业欺诈率 - 作为其主要来源。虽然许多当地新闻网点提供了由于ID.ME系统因ID.ME系统而导致的延迟引起的疼痛的覆盖范围。其他人已经与类似于Axios的故事一起运行，引用了公司的数字。 Axios文章也被共和党在代表中的共和党人引用，作为美国政府普遍欺诈的证据。\n  美国工党部表示，在3月和10月20日之间，它在可能的欺诈性失业率下揭示了仅56亿美元。虽然最近的数据表明，损失实际上是更高的，但原子能机构估计他们将“进入数十亿美元。”\n  Weaver表示，他认为防止欺诈性索赔非常重要，但他对ID.Me甚至在内华达州的疯狂硕士争议，以便在当前的身份验证系统以及如何在此类短时间内实施。 ", "note_en": "People around the country are furious after being  denied their unemployment benefits due to apparent problems with facial recognition technology that claims to prevent fraud.\n  Unemployment recipients have been  complaining for months about the identity verification service ID.me, which uses a combination of biometric information and official documents to confirm that applicants are who they claim to be. The complaints reached another crescendo this week after Axios  published a “deep dive” article about the threat of unemployment fraud based on statistics provided to the outlet by ID.me.\n    Some unemployment applicants have said that ID.me’s facial recognition models fail to properly identify them (generally speaking, facial recognition technology is notoriously less accurate for women and people of color). And after their applications were put on hold because their identity couldn’t be verified, many should-be beneficiaries have had to wait days or weeks to reach an ID.me “trusted referee” who could confirm what the technology couldn’t.\n  On Twitter, there are dozens of complaints about ID.me per day, and local news articles all over the country have detailed the problem over the course of months. In California, 1.4 million unemployment beneficiary accounts were abruptly suspended on New Year’s Eve and the beneficiaries were required to re-verify their identity using ID.me, a process which  many found difficult and resulted in them waiting for weeks to reactivate their accounts while they struggled to make ends meet.\n   In Colorado, benefit recipients who had no problem establishing their identity before ID.me took over  were suddenly rejected and went months without receiving the payments they were eligible for.\n      ID.me CEO Blake Hall told Motherboard that the company’s facial recognition technology does one-to-one matching—comparing one face against a picture of that same face (from a driver’s license, say)—whereas other applications of facial recognition attempt to find a match for a face in a large dataset of faces, known as one-to-many matching.\n  “The algorithms used for Face Match operate ~99.9% efficacy,” Hall wrote in an email to Motherboard. “There is in fact no relationship between skin tone and Face Match failure on a 1:1 basis” according to a regression analysis the company performed.\n  That doesn’t mesh with the  experiences being shared on Twitter by people like Tim Weaver, a gig economy worker in Las Vegas who was suddenly cut off from his unemployment benefits in late March after ID.me failed to identify him.\n  Weaver told Motherboard that when he attempted to pass ID.me’s facial recognition test he held a phone in front of him in the instructed position but “it rejected it, didn’t give us a reason, just rejected it. It rejected it three times, and then it locked me out of the system.”\n  Weaver said he attempted to contact the company’s customer support through its chat feature, which claims to provide assistance 24-hours a day, seven days a week. He tried numerous times at all hours of the day. He tried contacting the state of Nevada for help, but the employees there directed him back to ID.me.\n    This went on for several weeks, Weaver said, until he tweeted a  scathing criticism of the company, which then reached out and—after several more frustrating days—verified Weaver’s identity.\n  Weaver went for three weeks without receiving his benefit. “I couldn’t pay bills,” he said. “Luckily I had enough food saved up so I didn’t have to worry about that. It’s just ridiculous.”\n  In his statement to Motherboard, Hall said that facial recognition failures are not a problem with the technology but with the people using it to verify their identity. “For example, if someone uploads a selfie that only shows half their face.”\n  “We are unaware of eligible individuals who have not been able to verify their identity with ID.me,” he said, and “the wait time for a live video chat session right now is less than five minutes and it has been consistently under 30 minutes all week.”\n  A quick search for  tweets directed at ID.me shows reams of people locked out of their unemployment accounts by the company.\n  At least  21 states use ID.me to detect fraudulent benefit claims. The spread of the technology has coincided with an aggressive media blitz from Hall in which he has stoked fears about the crisis of unemployment fraud using some fluid statistics.\n    In February, he told an  Oregon TV station that unemployment fraud had cost the country $100 billion. Several weeks later, he told a Montana TV station that unemployment fraud had  cost the country nearly $200 billion. The next month, he was telling a  San Diego station that unemployment fraud would cost $300 billion. By the time ID.me reached Axios, it was $400 billion.\n  Hall told Motherboard that the Oregon TV station didn’t quote him directly—it did attribute the $100 billion estimate to him, though—and that he was consistent through January and February estimating the losses from unemployment fraud around $200 billion. “As we screened existing claimants in more states, we had more data points … In June, I estimated the loss over $400 [billion] in line with past estimates. All of those data points are consistent over time.”\n  Hall did not respond to Motherboard’s question about how ID.me calculated its estimates.\n    It’s possible that the rate of successful unemployment fraud is growing rapidly—hence Hall’s rising cost estimates—but ID.me also has a vested interest in depicting fraud as a major problem, which Hall has repeatedly done. It makes sense for a company that makes anti-fraud technology to study fraud; it&#39;s also fair for the general public to be skeptical of fraud statistics published by companies that would benefit from showing that fraud is a major problem.\n  Axios has now published two articles that have cited the company&#39;s numbers, and, on Twitter, Axios writer Felix Salmon suggested that fraud associated with expanded unemployment insurance during the pandemic has resulted in &#34; quite possibly the largest theft of all time.&#34;\n  The Axios article has been widely criticized for using ID.me—a company with a financial incentive to inflate the rate of unemployment fraud—as its main source. And while many local news outlets have provided great coverage of the pain caused by delays due to ID.me’s system, others have run with stories similar to Axios’s, citing the company’s numbers. The Axios article was also immediately cited by  Republicans in the House of Representatives as evidence of widespread defrauding of the U.S. government.\n  The U.S. Department of Labor says that between March and October 2020 it  uncovered just $5.6 billion in potentially fraudulent unemployment payments. And while more recent data suggests the losses are actually higher, the agency estimated that they would be “into the tens of billions of dollars.”\n  Weaver said he thinks it’s very important to prevent fraudulent claims, but he’s mad at ID.me and even madder at Nevada for wthe current identity verification system and how it was implemented on such short notice.", "posttime": "2021-06-19 22:38:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,识别,id,欺诈", "title": "一些美国失业申请人表示身份证验证服务使用的面部识别模型id.me未能识别它们，将它们锁定摆脱福利 ", "title_en": "Some US unemployment applicants say facial recognition models used by ID verification service ID.me are failing to identify them, locking them out of benefits", "transed": 1, "url": "https://www.vice.com/en/article/5dbywn/facial-recognition-failures-are-locking-people-out-of-unemployment-systems", "via": "", "real_tags": ["美国", "识别", "id", "欺诈"]}, {"category": "", "categoryclass": "", "imagename": "c3bd3267e2043bcfc770d28b8629ad00.jpg", "infoid": 1066890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们正在改变美国的发布利率，以更好地对准我们的产品和服务提供的价值。我们的目标是与客户有关更改的透明和前期。这些利率将适用于美国2002年8月2日开始的一部分商家客户。我们开始通知一些客户，您可以在我们的策略更新页面上找到通知。\n  Paypal Digital付款：对于PayPal付款产品（如PayPal结账，用Venmo，PayPal Credit，支付4，PayPal支付奖励，结帐与加密），其中包括卖方对符合条件的交易的保护，在线交易的速度将是每笔交易3.49％+ 0.49美元。\n  个人支付：对于PayPal和Venmo QR QR码交易超过10美元，率将为1.90％+ 0.10美元，而且此类交易10美元及以下，利率为2.40％+ 0.05美元。对于某些内部借记和信用交易，费率将为2.29％+ 0.09美元。\n  信用卡和借记卡付款：在线信用卡和借记卡交易将每笔交易2.59％+ 0.49 1美元，无需退款保护，或2.99％+ 0.49美元，退款保护。\n  慈善交易：确认慈善机构的慈善交易费用为1.99％+ 0.49美元（申请和预批准）。\n  非标准定价：对于拥有习俗，非标准定价的美国商家，可根据商定的这些服务保持不变。\n          由于PayPal一直与我们的商业伙伴一起发展我们的业务，我们加快了产品，特征和能力的推出，而不是以往任何时候都提供更多的利益。有了这个，PayPal已成为一个按钮或支付处理器，是一个能够为全部或在线或亲自驾驶所有大小的企业增长的全部商业平台。事实上，我们的商家客户受益于以下内容： \n选择PayPal作为支付方式的消费者比不选择PayPal作为付款方式的消费者更容易转换60％。 2\n  当PayPal在结账时提供购买时，消费者的可能性近三倍。 3.\n  我们最近宣布的立即购买，支付后来的解决方案已导致业务支付量的15％电梯。 4.\n  此外，我们还在继续合作和投资我们的平台，以加强支付经验，为人们支付的商品和服务的方式提供更多选择，提高保护和安全措施，以便在数量交换时给予人们的安心，并改善授权和转换费率。\n  我们正在继续创新以纪录的步伐和授权企业，无论他们做生意，都不会错过交易。通过投资我们的数据分析能力，改善我们的欺诈工具，以及我们使用的产品提供的新消费者体验，如现在购买的产品，并稍后付款，并使用奖励积分支付，以及Checkout与Crypto  - 我们留在付款的前沿。\n  了解美国的调整后的定价如何堆积在行业中的其他人，您可以在这个SMB定价页面上了解更多信息：\n          我们对我们合作伙伴的承诺 - 是我们社区和经济的生命线的企业 - 从未如此强大。我们将继续投资，创新，并提供他们需要成长，转换和留住客户所需的工具和经验的业务。 \n有关这些更改的更多信息，请访问我们的PayPal商家费和我们的定价常见问题。 ", "note_en": "We are making changes to our published rates in the United States to better align our pricing with the value that our products and services provide. Our goal is to be transparent and upfront with our customers about the changes. These rates will apply to a portion of our merchant customers in the U.S. beginning August 2, 2021. We began notifying some customers today, and you can find a notice on our  Policy Updates page.\n  PayPal Digital Payments: For PayPal payment products (such as PayPal Checkout, Pay with Venmo, PayPal Credit, Pay in 4, PayPal Pay with Rewards, Checkout with crypto), which include Seller Protection on eligible transactions, the rate for online transactions will be  3.49% + $0.49 1 per transaction.\n  In-person Payments: For PayPal and Venmo QR code transactions over $10, the rate will be  1.90% + $0.10, and for such transactions $10 and under, the rate will be  2.40% + $0.05. For certain in-person debit and credit transactions the rate will be  2.29% + $0.09.\n  Credit and Debit Card payments:  Online credit and debit card transactions will be  2.59% + $0.49 1 per transaction without Chargeback Protection, or  2.99% + $0.49 with Chargeback Protection.\n  Charity Transactions: Fees for charity transactions will be  1.99% + $0.49 for confirmed charities (subject to application and pre-approval).\n  Non-standard Pricing: For U.S. merchants who have custom, non-standard pricing, rates will remain unchanged for those services as agreed.\n          As PayPal has been evolving our business alongside our merchant business partners, we have accelerated the rollout of products, features, and capabilities, delivering more benefits than ever before. With this, PayPal has become more than just a button or payment processor to be a full commerce platform capable of driving growth for businesses of all sizes online or in person. In fact, our merchant customers benefit from the following:\n  Consumers who choose PayPal as a payment method are  60% more likely to convert than consumers who do not choose PayPal as a payment method.  2\n  Consumers are  nearly three times more likely to complete their purchase when PayPal is available at checkout. 3\n  Our recently announced Buy Now, Pay Later solutions have resulted in a  15% lift in payment volume for businesses. 4\n  Additionally, we are continuing to partner and invest in our platforms to enhance payment experiences, provide greater choice for the way people pay for goods and services, improve protection and security measures to give people peace of mind when transacting digitally, and improve authorization and conversion rates.\n  We are continuing to innovate at record pace and empower businesses to never miss a transaction no matter where they do business. By investing in our data analytics capabilities, the improvement of our fraud tools, and the new consumer experiences we are delivering with products like Buy Now and Pay Later, Pay with Rewards Points, and Checkout with crypto – we remain at the cutting edge of payments.\n  See how our adjusted pricing in the U.S. stacks up to others in the industry, and you can learn more at this  SMB pricing page:\n          Our commitment to our partners – businesses that are the lifeblood of our communities and economy - has never been stronger. We will continue to invest, innovate, and provide businesses with the tools and experiences they need to grow, convert, and retain customers.\n  For more information about these changes, please visit our  PayPal Merchant Fees page and our  pricing FAQ.", "posttime": "2021-06-19 22:38:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,企业,upcoming,支付", "title": "即将到来的一些美国企业的变化 ", "title_en": "Upcoming Changes for Some US Businesses", "transed": 1, "url": "https://newsroom.paypal-corp.com/2021-06-18-Upcoming-Changes-for-Some-US-Businesses", "via": "", "real_tags": ["美国", "企业", "upcoming", "支付"]}, {"category": "", "categoryclass": "", "imagename": "0b7f10476c1ff9f38b7786e8867b93d8.jpg", "infoid": 1066889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LiveBook是一个Web应用程序，用于编写交互式和协作代码Notebooks.https：//github.com/elixir-nx/livebook/see elixirconf.com为Lates ... ", "note_en": "Livebook is a web application for writing interactive and collaborative code notebooks.https://github.com/elixir-nx/livebook/See ElixirConf.com for the lates...", "posttime": "2021-06-19 22:38:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "valim,livebook", "title": "Jose Valim介绍了LiveBook V0.2：输入，图形等 ", "title_en": "Jose Valim introduces LiveBook v0.2: inputs, graphs, and more", "transed": 1, "url": "https://www.youtube.com/watch?v=MOTEgF-wIEI", "via": "", "real_tags": ["valim", "livebook"]}, {"category": "", "categoryclass": "", "imagename": "a25834e671f1317b78cd89cfeee6cb6d.png", "infoid": 1066888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "知识杂志来自年度评论，一项非营利组织出版商，致力于综合和整合科学进程的知识和社会的利益。 ", "note_en": "Knowable Magazine is from  Annual Reviews, a nonprofit publisher dedicated to synthesizing and integrating knowledge for the progress of science and the benefit of society.", "posttime": "2021-06-19 22:38:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爸爸,evolution,知识", "title": "爸爸的演变 ", "title_en": "Evolution of the Dad", "transed": 1, "url": "https://knowablemagazine.org/article/living-world/2021/evolution-dad", "via": "", "real_tags": ["爸爸", "evolution", "知识"]}, {"category": "", "categoryclass": "", "imagename": "236f554864c527200117a9ff6dd2031a.jpeg", "infoid": 1066887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在澳大利亚内陆的中间，有一个烟囱从沙子和大红色标志上升的一个小镇，警告人们的＆＃34;未标记的洞。＆＃34;  自1916年开始的是世界上最大的蛋白石采矿业务的始于世界上最大的蛋白石采矿业务，此后扩展到了从该地区安全地脱离的地下社区和120度夏季。  整个卧室，书店，教堂和酒吧都安装在Coober Pedy的雕刻的地下墙上 - 在这些＆＃34生活100年之后; Dugouts，＆＃34; 称之为家的人没有停止的计划。  点击“注册”，您同意从Insider以及其他合作伙伴提供的营销电子邮件以及接受我们的服务条款和隐私政策。  形成一个＆＃39的两个交叉线; x＆＃39; 它表示封闭互动或解雇通知的方法。 ", "note_en": "In the middle of the Australian Outback, there&#39;s a town where chimneys rise from the sand and big red signs warn people of &#34;unmarked holes.&#34;\n  What began in 1916 as perhaps  the largest opal mining operation in the world has since expanded into a subterranean community that is safely out of reach from the region&#39;s  120-degree summers.\n Entire bedrooms, bookstores, churches, and bars are installed in the carved underground walls of Coober Pedy — and after 100 years of living in these &#34;dugouts,&#34; the folks who call it home have no plans of stopping.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-06-19 22:37:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pedy,警告", "title": "Coober Pedy，澳大利亚矿业城居民住在地下 ", "title_en": "Coober Pedy, the Australian mining town where residents live underground", "transed": 1, "url": "https://www.businessinsider.com/inside-coober-pedy-australias-underground-town-2016-1", "via": "", "real_tags": ["pedy", "警告"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您使用过Steam，您知道您可以使用它下载和安装游戏。玩游戏后，您还可以写下关于这些游戏的评论。遗憾的是，蒸汽可能并不是那么容易。\n  上个月我从Steam购买了新的Metro Exodus增强版版本。正如名称所暗示的，它是2019年发布的Metro Exodus游戏的增强版。今天我完成了比赛，我想写关于它的审查。 Steam已经编写了一个评论选项，但是对于此版本而不是工作。它只为通用提供“您的评论发布了问题”。当一个人试图为此游戏提交评论时出错。\n 我不是第一个注意到这个问题的人。问题似乎是Steam没有增强版的商店页面，因此，即使Steam表明您应该发布关于游戏的审查，也没有人能在那里发布评论。自然可以发布审查Metro Exodus，因为它确实有商店页面。\n  但由于地铁埃及州和地铁埃德罗斯增强版是蒸汽中的单独物品，我必须在我为它写评论之前下载Metro Exodus。\n  所以我开始了57.51 GB从Steam下载，所以我可以写点评。 ", "note_en": "If you have used  Steam, you know that you can download and install games with it. After playing games, you can also write reviews about those games. Unfortunately writing a review might not be that easy with Steam.\n  Last month I bought new  Metro Exodus Enhanced Edition release from Steam. As name suggests, it is an Enhanced Edition of  Metro Exodus game that was released in 2019. Today I completed the game, and I wanted to write a review about it. Steam has write a review option, but for this release it doesn’t work. It only gives generic  “There was a problem posting your review.” error when one tries to submit a review for this game.\n I am not a first person to notice  this issue. The problem seems to be that Steam doesn’t have store page for Enhanced Edition, so nobody can post reviews there even when Steam suggests that you should post a review about the game. Naturally one can post a review for Metro Exodus since it does have a store page.\n  But since both Metro Exodus and Metro Exodus Enhanced Edition are separate items in Steam, I have to download Metro Exodus before I can write a review for it.\n  So I started a 57.51 GB download from Steam, so I can just write a review.", "posttime": "2021-06-19 22:37:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "下载,required,steam", "title": "蒸汽需要额外的57.51 GB下载审查 ", "title_en": "Steam required additional 57.51 GB download for a review", "transed": 1, "url": "https://mcraiha.github.io/steam/review/metro/exodus/enhanced/edition/2021/06/19/Steam_required_additional_download_for_review.html", "via": "", "real_tags": ["下载", "required", "steam"]}, {"category": "", "categoryclass": "", "imagename": "387e7c7ad97ebe76fa562e5f12f74eeb.jpg", "infoid": 1066884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "彼得森林希望从其基石之一开始重建大部分现代数学。现在，他从一个不太可能的来源获得验证验证他的追求的验证：计算机。\n 虽然大多数数学家怀疑机器会很快取代他们职业的创造性方面，但有些人承认技术将在他们的研究中发挥越来越重要的作用 - 这种特殊的壮举可能是其接受的转折点。\n Schearze，一个数字化学家，阐述了雄心勃勃的计划 - 他与哥本哈根大学的他的合作垃圾桶共同创作 - 在2019年在德国波恩大学的一系列讲座中，他是基于的。这两位研究人员被称为它“浓缩数学”，他们表示，它有望在远离几何到数字理论之间进行新的洞察和联系。\n 其他研究人员正在关注：Scholze被认为是数学最耀眼的明星之一，并具有引入革命概念的轨道记录。 Maryland的约翰霍普金斯大学的数学家Manymatician表示，如果Scholze和Clausen的愿景意识到，数学的方式在50年来毕业的方式可能会与今天的不同。 “我认为有很多数学领域将来会受到他的想法的影响，”她说。\n 到目前为止，大部分愿景都依赖于技术证明，如此，即使是Scholez和Clausen也无法确定它是正确的。但本月早些时候，Scholze宣布了一个通过专门的计算机软件检查证据的核心的项目已经成功。\n  数学家有长期使用的计算机进行数值计算或操纵复杂公式。在某些情况下，他们通过使计算机做出大量重复性工作 - 最着名的是20世纪70年代最着名的证据，即任何地图都可以用四种不同的颜色着色，而不填写任何两个相邻国家的证据颜色。\n  但是被称为证明助手的系统更深入。用户将语句输入系统，以教授数学概念的定义 - 基于机器已经知道的更简单的对象。声明也可以是指已知对象，并且证明助手将根据目前的知识来回答事实是否“显然”是真实的还是假。如果答案不明显，则用户必须输入更多详细信息。因此，验证助手迫使用户以严谨的方式阐述他们的论点的逻辑，并且他们填补了人类数学家有意识或无意识地跳过的更简单的步骤。 \n一旦研究人员就把一组数学概念翻译成校正助手就完成了艰苦的工作，该程序会生成一个可以由其他研究人员构建的计算机代码库，并用于定义更高级别的数学对象。通过这种方式，证明助手可以帮助验证否则耗时和困难的数学证据，也许甚至几乎不可能，对于人类来检查。\n 帝国伦敦帝国学院的数学家Kevin Buzzard表示，校正助理有长期的粉丝，这是他们第一次在田野的尖端发挥着重要作用，这是一家检查Schoolze和Clausen的合作的一部分结果。 “剩下的剩余问题是：他们可以处理复杂的数学吗？”秃鹰说。 “我们表明他们可以。”\n 这一切都发生得比任何人想象的要快得多。 Scholze于2020年12月向探索助理专家挑战了他的挑战，并由一群由Johan Commelin领导的志愿者是德国弗赖堡大学的数学家领导的志愿者。 6月5日 - 少于六个月后 -  Scholze发布在Buzzard的博客上，实验的主要部分成功了。 “我发现它绝对疯狂，互动证明助理现在处于级别，在一个非常合理的时间跨度，他们可以正式验证困难的原创研究，”Spolze写道。\n  据Schoolze和Clausen称，浓缩数学的关键点是重新定义拓扑的概念，是现代数学的一个基石。数学家学习的许多物体具有拓扑结构 - 一种确定对象部分靠近哪个结构的结构，而不是。拓扑提供了一种形状的概念，但比熟悉的学校级几何形状更具缺乏态度：在拓扑中，任何没有撕裂物体的转变就可以允许。例如，任何三角形都是拓扑相当于任何其他三角形 - 甚至是圆形 - 但不是直线。\n 拓扑不仅在几何形状中发挥关键部分，而且在功能分析中，研究功能的研究。函数通常在具有无限数量的空间中“活”（例如是Quantum Mementics的波力事件）。它对称为P-ADIC数字的数字系统也很重要，具有异国情调的“分形”拓扑。\n  2018年左右，Scholze和Clausen开始意识到拓扑概念的传统方法导致这三种数学宇宙 - 几何，功能分析和P-ADIC数字之间的不兼容性 - 但是该替代基础可以弥合那些差距。许多结果在每个领域的结果似乎在其他领域都有类似物，即使他们显然处理完全不同的概念。但是，一旦拓扑以“正确”方式定义，两位研究人员都会被揭示理论之间的类比是同一“浓缩数学”的情况。克劳森说：“这是一些大统一”的三个领域。\n Scholze和Clausen表示，他们已经发现了一些简单的“浓缩”的一些几何事实，并且他们现在可以证明以前未知的定理。他们还没有制作这些公众。 \n然而，有一个捕获，但是要表明几何形状适合这张照片，Schoolze和Clausen必须对这一套普通实数来证明一个高技术定理，这具有直线的拓扑。 “这就像允许实数进入这个新框架的基础定理一样，”Commelin解释道。\n  克劳森回忆起Sechze如何无情地在证明之前努力，直到它完成“通过愿意”，在该过程中产生许多原创思想。 “这是我见过的最神奇的数学壮举，”克劳森召回。但争论是如此复杂，Schole自己担心整个企业无效的微妙差距。 “看起来很令人信服，但它只是小说，”克劳森说。\n 有关帮助检查该工作，Schearze转向Buzzard，这是一个代价理论家，他们是精益的专家，验证助理软件包。精益最初是由华盛顿雷德蒙德的微软研究的计算机科学家创建的，目的是严格检查计算机代码的错误。\n Buzzard一直在运行一个多年计划，以编制帝国帝国的整个本科数学课程。他还尝试进入系统进入系统，包括Perfetoid Spaces的概念，这有助于在2018年获得Schole Sender邮票。\n Commelin，谁也是一个数字主义者，在努力验证Schearze和Clausen的证据中的努力。 Commelin和Schearze决定将他们的瘦液呼吁液体张量实验，在渐进式摇滚乐队液体张力实验中，其中两种数学家都是粉丝。\n 随之而来的是发热的在线合作。十几个左右的数学家，倾向于加入的体验，研究人员在路上得到了计算机科学家的帮助。六月初，该团队完全翻译了ScheCze的证据的核心 - 这部分担心他最多 - 倾向于精益。它都检查过 - 软件能够验证证明的这一部分。\n  Commelin说，Scholze的证据的精益版本包括数万条代码，比原来版本长100倍。 “如果你只是看看精益代码，你将非常艰难地了解证明，特别是现在的方式。”但研究人员称，让证据在计算机上工作的努力帮助他们也能更好地了解。 \nRiehl是在经过实验助理的数学家之一，甚至在她的一些本科课程中教授它们。她说，虽然她没有在她的研究中系统地使用它们，但他们已经开始改变她认为对构建数学概念和说明和证明他们的定理的做法的方式。 “以前，我想到了截至两种不同的东西，现在我认为它们是一样的。”\n 许多研究人员表示，数学家不太可能被机器更快替换。校正助手无法读取数学教科书，他们需要从人类的连续输入，他们无法决定数学陈述是否有趣或深刻 - 只有无论是正确的，秃鹰都说。尽管如此，计算机还可以很快指出数学家未能注意到的已知事实的后果。\n Schearze说，他对卫生助手的途径有多么惊讶，但他不确定他们是否会在他的研究中继续发挥重要作用。 “现在，我无法真正看到他们如何帮助我作为数学家的创造性工作。” ", "note_en": "Peter Scholze wants to rebuild much of modern mathematics, starting from one of its cornerstones. Now, he has received validation for a proof at the heart of his quest from an unlikely source: a computer.\n Although most mathematicians doubt that machines will replace the creative aspects of their profession anytime soon, some acknowledge that technology will play an increasingly important role in their research — and this particular feat could be a turning point towards its acceptance.\n Scholze, a number theorist, set forth the ambitious plan — which he co-created with his collaborator Dustin Clausen from the University of Copenhagen — in a series of lectures in 2019 at the University of Bonn, Germany, where he is based. The two researchers dubbed it ‘condensed mathematics’, and they say it promises to bring new insights and connections between fields ranging from geometry to number theory.\n Other researchers are paying attention: Scholze is considered one of mathematics’ brightest stars and has a track record of introducing revolutionary concepts. Emily Riehl, a mathematician at Johns Hopkins University in Baltimore, Maryland, says that if Scholze and Clausen’s vision is realized, the way mathematics is taught to graduate students in 50 years’ time could be very different than it is today. “There are a lot of areas of mathematics that I think in the future will be affected by his ideas,” she says.\n Until now, much of that vision rested on a technical proof so involved that even Scholze and Clausen couldn’t be sure it was correct. But earlier this month, Scholze announced that a project to check the heart of the proof using specialized computer software had been successful.\n  Mathematicians have long used computers to do numerical calculations or manipulate complex formulas. In some cases, they have proved major results by making computers do massive amounts of repetitive work — the most famous being a proof in the 1970s that any map can be coloured with just four different colours, and without filling any two adjacent countries with the same colour.\n  But systems known as proof assistants go deeper. The user enters statements into the system to teach it the definition of a mathematical concept — an object — based on simpler objects that the machine already knows about. A statement can also just refer to known objects, and the proof assistant will answer whether the fact is ‘obviously’ true or false based on its current knowledge. If the answer is not obvious, the user has to enter more details. Proof assistants thus force the user to lay out the logic of their arguments in a rigorous way, and they fill in simpler steps that human mathematicians had consciously or unconsciously skipped.\n Once researchers have done the hard work of translating a set of mathematical concepts into a proof assistant, the program generates a library of computer code that can be built on by other researchers and used to define higher-level mathematical objects. In this way, proof assistants can help to verify mathematical proofs that would otherwise be time-consuming and difficult, perhaps even practically impossible, for a human to check.\n Proof assistants have long had their fans, but this is the first time that they have played a major role at the cutting edge of a field, says Kevin Buzzard, a mathematician at Imperial College London who was part of a collaboration that checked Scholze and Clausen’s result. “The big remaining question was: can they handle complex mathematics?” Says Buzzard. “We showed that they can.”\n And it all happened much faster than anyone had imagined. Scholze  laid out his challenge to proof-assistant experts in December 2020, and it was taken up by a group of volunteers led by Johan Commelin, a mathematician at the University of Freiburg in Germany. On 5 June — less than six months later —  Scholze posted on Buzzard’s blog that the main part of the experiment had succeeded. “I find it absolutely insane that interactive proof assistants are now at the level that, within a very reasonable time span, they can formally verify difficult original research,” Scholze wrote.\n  The crucial point of condensed mathematics, according to Scholze and Clausen, is to redefine the concept of topology, one of the cornerstones of modern maths. A lot of the objects that mathematicians study have a topology — a type of structure that determines which of the object’s parts are close together and which aren’t. Topology provides a notion of shape, but one that is more malleable than those of familiar, school-level geometry: in topology, any transformation that does not tear an object apart is admissible. For example, any triangle is topologically equivalent to any other triangle — or even to a circle — but not to a straight line.\n Topology plays a crucial part not only in geometry, but also in functional analysis, the study of functions. Functions typically ‘live’ in spaces with an infinite number of dimensions (such as wavefunctions, which are foundational to quantum mechanics). It is also important for number systems called  p-adic numbers, which have an exotic, ‘fractal’ topology.\n  Around 2018, Scholze and Clausen began to realize that the conventional approach to the concept of topology led to incompatibilities between these three mathematical universes — geometry, functional analysis and  p-adic numbers — but that alternative foundations could bridge those gaps. Many results in each of those fields seem to have analogues in the others, even though they apparently deal with completely different concepts. But once topology is defined in the ‘correct’ way, the analogies between the theories are revealed to be instances of the same ‘condensed mathematics’, the two researchers proposed. “It is some kind of grand unification” of the three fields, Clausen says.\n Scholze and Clausen say they have already found simpler, ‘condensed’ proofs of a number of profound geometry facts, and that they can now prove theorems that were previously unknown. They have not yet made these public.\n There was one catch, however: to show that geometry fits into this picture, Scholze and Clausen had to prove one highly technical theorem about the set of ordinary real numbers, which has the topology of a straight line. “It’s like the foundational theorem that allows the real numbers to enter this new framework,” Commelin explains.\n  Clausen recalls how Scholze worked relentlessly on the proof until it was completed ‘through force of will’, producing many original ideas in the process. “It was the most amazing mathematical feat I’ve ever witnessed,” Clausen recalls. But the argument was so complex that Scholze himself worried there could be some subtle gap that invalidated the whole enterprise. “It looked convincing, but it was simply too novel,” says Clausen.\n For help checking that work, Scholze turned to Buzzard, a fellow number theorist who is an expert in Lean, a proof-assistant software package. Lean was originally created by a computer scientist at Microsoft Research in Redmond, Washington, for the purpose of rigorously checking computer code for bugs.\n Buzzard had been running a multi-year programme to encode the entire undergraduate maths curriculum at Imperial into Lean. He had also experimented with entering more-advanced mathematics into the system, including the concept of perfectoid spaces, which helped to earn Scholze a Fields Medal in 2018.\n Commelin, who is also a number theorist, took the lead in the effort to verify Scholze and Clausen’s proof. Commelin and Scholze decided to call their Lean project the Liquid Tensor Experiment, in an  homage to progressive-rock band Liquid Tension Experiment, of which both mathematicians are fans.\n A febrile online collaboration ensued. A dozen or so mathematicians with experience in Lean joined in, and the researchers got help from computer scientists along the way. By early June, the team had fully translated the heart of Scholze’s proof — the part that worried him the most — into Lean. And it all checked out — the software was able to verify this part of the proof.\n  The Lean version of Scholze’s proof comprises tens of thousands of lines of code, 100 times longer than the original version, Commelin says. “If you just look at the Lean code, you will have a very hard time understanding the proof, especially the way it is now.” But the researchers say that the effort of getting the proof to work in the computer has helped them to understand it better, too.\n  Riehl is among the mathematicians who have experimented with proof assistants, and even teaches them in some of her undergraduate classes. She says that, although she doesn’t systematically use them in her research, they have begun to change the very way she thinks of the practices of constructing mathematical concepts and stating and proving theorems about them. “Previously, I thought of proving and constructing as of two different things, and now I think of them as the same.”\n Many researchers say that mathematicians are unlikely to be replaced by machines any time soon. Proof assistants can’t read a maths textbook, they need continuous input from humans, and they can’t decide whether a mathematical statement is interesting or profound — only whether it is correct, Buzzard says. Still, computers might soon be able to point out consequences of the known facts that mathematicians had failed to notice, he adds.\n Scholze says he was surprised by how far proof assistants could go, but that he is unsure whether they will continue to have a major role in his research. “For now, I can’t really see how they would help me in my creative work as a mathematician.”", "posttime": "2021-06-19 22:37:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学家,computer,数学", "title": "数学家欢迎“大统一”理论中的计算机辅助证明 ", "title_en": "Mathematicians welcome computer-assisted proof in ‘grand unification’ theory", "transed": 1, "url": "https://www.nature.com/articles/d41586-021-01627-2", "via": "", "real_tags": ["数学家", "computer", "数学"]}, {"category": "", "categoryclass": "", "imagename": "46692cd9fe3cc47a3e7abe917ac9d86a.jpg", "infoid": 1066883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Casu Martzu [1]（[KazuMaëtsu];字面上＆＃39;腐烂/ Putrid Cheese＆＃39;），有时拼写Casu Marzu，也称Casu Modde，CasuCundídu和CasuFràzigu在撒丁岛语言，是一只传统的撒丁岛羊奶奶酪，含有活昆虫幼虫（蛆虫）。奶酪的变异，Casgiu Merzu，[2]也在Sartene这样的一些南罗西尼亚村庄生产。 [3]\n Casu Martzu来自Pecorino，超越了典型的发酵到分解的阶段，由乳酪氏菌族的乳酪幼虫的消化作用引起的。这些幼虫被刻意引入奶酪，促进先进水平的发酵水平，并分解奶酪＆＃39;脂肪。奶酪的质地变得非常柔软，有一些液体（称为làgrima，撒丁岛，＆＃34;泪水拍摄）。幼虫本身出现在半透明的白色蠕虫，大约8毫米（0.3英寸）。 [4]\n   Casu Martzu是通过将整个Pecorino奶酪留在外面，其中一部分RIND除去，让奶酪飞蝇蛋白酪蛋白的鸡蛋放入奶酪中。一个女性P.酪虫一次可以一次留下超过500个鸡蛋。 [4] [5]鸡蛋孵化，幼虫开始通过奶酪吃。 [6]来自蛆虫的酸＆＃39;消化系统分解了奶酪＆＃39;脂肪，[6]使奶酪的质地变得非常柔软;当它准备好消费时，典型的Casu Martzu将包含数千个这些蛆虫。 [7]\n  Casu Martzu被Sardinian Aficionados考虑到奶酪中蛆虫死亡时要吃不安全。 [8]因为这一点，只吃蛆虫仍然活着的奶酪通常被吃掉，尽管对已经冷藏的奶酪制造了津贴，这导致蛆虫被杀死。 [8]当奶酪发酵足够时，它通常被切成薄片，并在湿润的撒丁岛扁平面包（窗格Carasau）上涂抹，配上像Cannonau这样的强红葡萄酒。 [6] [9] Casu Martzu被撒丁岛认为是一种壮阳药。 [10]因为奶酪中的幼虫可以在受到干扰的情况下为高达15厘米（6英寸）的距离启动，[4] [11]用餐者把手握住三明治上方，以防止蛆虫跳跃。一些吃奶酪的人更喜欢不能摄取蛆虫。那些不希望吃它们的人将奶酪放在密封的纸袋里。蛆虫，饥饿的氧气，扭曲并跳进袋子里，创造一个＆＃34; Pitter-patter＆＃34;声音。当声音消退时，蛆虫已经死了，奶酪可以被吃掉。 [12] [8]\n  根据一些食物科学家，幼虫可以在胃酸中存活并留在肠中，导致叫做假瘤病的病症。已经记录了PSSudomyiasis的案例。 [13] [14]\n 由于欧盟食品卫生法规，奶酪已被禁止，违法者面临重金属罚款。 [12]然而，一些撒丁岛组织自己，以使Casu Martzu在黑色市场上提供，可以销售普通菌奶酪的普通块的价格。 [10] [8]截至2019年，这款奶酪的非法生产估计为100吨（98长的吨;每年110吨），价值2-3米。 [15]\n 通过Casu Martzu宣布了传统食品的意大利和欧盟的禁令进行了规避，以规避意大利和欧盟禁令[8]（它已经以同样的方式制造超过25年，因此免于普通食品卫生法规）。制造奶酪的传统方式由撒丁岛政府的官方文件解释。 [16] \nSassari大学绵羊农民与研究人员之间的合作开发了一种卫生生产方法，2005年旨在允许奶酪的法律销售。 [18]\n  在撒丁岛以外，在法国科西嘉岛的类似牛奶奶酪也是在一些南方村庄生产的撒丁岛芝士的局部变化，并且称为Casgiu Merzu [2]或Casgiu Sartinesu，以及一些意大利人地区。 [19] [20] [21]\n  欧洲其他地区生产的其他几种奶酪与飞幼虫。例如，山羊牛奶奶酪留下露天，直到P. casei鸡蛋天然铺设在奶酪中。 [6]那么它在白葡萄酒中老化，葡萄和蜂蜜，防止幼虫出现，给予奶酪强烈的味道。此外，欧洲的其他地区有传统的奶酪，依赖于现场节肢动物的衰老和调味，如德国Milbenkäse和法国模仿，两者都依赖于奶酪螨虫。\n 早期印刷的斯蒂尔顿奶酪指向类似的生产技术。他1724年的Daniel Defoe在Thro＆＃39的旅游工作英国的整个岛屿«我们通过芝士，这是奶酪的斯蒂尔顿，这是奶酪的，呼叫＆＃39; D我们的英国巴马干酪，并带到螨虫或蛆虫，如此厚他们带上了一把勺子，让你吃螨虫，就像你一样。» [22]\n    ^＆＃34; casu，ditzionàriu在líniade sa limba e de sa cultura sarda＆＃34; RegioneAutōnomade Sardigna。 C。 Martzu = Casu Fatu，Fatitadu，Fatitu，Giampagadu，Cunnitu。\n ^ a b camille cazorla（2016年）。 ＆＃34; Le Casu Marzu，Le Fromage（àrarves）le plus dangereux du monde＆＃34;。勒菲图。 Le Casu Marzu Qui SignifieLittéralement«FromagePouri»Est OriginaIredeSardaigne，ÎleMéditerranéenneSituéeAuSud de la Corse。在L＆＃39; y Retrouve Sous Placieurs Appellations，Casu Modde，Casu Cundhidu，Mais Aussi en Italie，Formaggio Marcio，Ou Encore en Corse，Sous Le Nom de Casgiu Merzu。\n  ^ a b c berenbaum，5月r（1993）。九十九个蛆，螨虫和munchers。伊利诺伊大学出版社。第10-14页。 ISBN 0-252-06322-8。 \n^斯蒂芬斯，安德鲁（2008年8月30日）。 ＆＃34;前五名......挑战食物;吃，喝酒，做饭......和＆＃34;年龄。 p。 A2。 ＆＃34; casu martzu＆＃34;\n ^ a b c d orceTreet，Robin M（2003年12月）。 ＆＃34;总统地址：风味芽和其他美食＆＃34;寄生虫学杂志。哈利法克斯，新斯科舍省，加拿大：美国寄生虫学家。 89（6）：1093-1107。 DOI：10.1645 / GE-236。 PMID 14740894.S2CID 34903443。在＆＃34;僵尸和其他昆虫＆＃34;部分。\n ^ Hegarty，Shane（2006年4月1日）。 ＆＃34;蛆，鸣禽和其他获得的品味＆＃34;爱尔兰时代。 p。 12.\n ^ a b c d e hay，mark（2020年3月31日）。 ＆＃34;世界背后的秘密阻力＆＃39;最危险的奶酪＆＃34;大纲。\n ^ Looomis，Susan Herrmann（2002年5月）。 ＆＃34;撒丁岛，意大利＆＃34; bonappétit。 2006年4月9日从原件存档。\n ^ a b trofimov，雅罗斯拉夫（2000年10月23日）。 ＆＃34;作为奶酪转弯，所以转变许多蛆的故事---爬上蠕虫和非法，撒丁岛＆＃39;撒丁岛的成熟的pecorinos在脸上脱颖而出，＃34;华尔街日报（东方版）。 236（37）：A1。 ISSN 0099-9660。\n ^ Bethune，Brian（2006年10月16日）。 ＆＃34;后页＆＃34;麦克莱恩＆＃39; s。敏捷蛆提供了一个额外的弗里森：他们可以如此紧张地弯曲，当他们放手时，释放的力量释放了六英寸或更多。 \n^ a b frauenfelder，mark（2005）。 ＆＃34;大多数腐烂的奶酪＆＃34;世界上最糟糕的世界：地球上最恶心，丑陋，无能，危险的人，地方和东西的指导。编年史书籍。第22-23页。 ISBN 978-0-8118-4606-6。\n ^ peckenschneider，l .; pokornō，c .; Hellwig，C. A.（1952年5月17日）。 ＆＃34;与＆＃34的蛆虫的肠道侵扰;奶酪飞行＆＃34; （piophila casei）＆＃34;美国医学协会杂志。 149（3）：262-263。 DOI：10.1001 / Jama1952.72930200005011b。\n ^品牌，Alonzo F.（1931年1月）。 ＆＃34;胃肠肌病：案例的报告＆＃34;贾马内科。贾马。 47（1）：149-154。 DOI：10.1001 / ARCHINTE.1931.00140190160017\n  ^＆＃34; casu frazigu  -  formaggi＆＃34; （PDF）（在意大利语中）。 Regione Automa Della Sardegna  -  Ersat：Ente Regionale di Sviluppo E Asstenza Tecnica。从2011年7月22日归档（PDF）来自原件。\n ^梵玺，霍莉（2019年5月30日）。 ＆＃34;这些奶酪被禁止在美国＆＃34;每日吃饭。论坛。\n  ^ comuni italiani。 ＆＃34; cacie＆＃39; Punt＆＃34 ;. www.comuni-italiani.it。从2011年2月7日从原件存档。\n ^＆＃34; formaggio saltarello＆＃34; Prodotti Tipici。从2011年12月12日从原始（PDF）存档。 \n^典型的产品。 ＆＃34; Pecorino Marcetto＆＃34; （PDF）。 www.prodottitipici.com。 productstipici.com。 从2011年12月12日从原件存档。 ", "note_en": "Jump to navigation  Jump to search  Casu martzu  [1] (   [ˈkazu ˈmaɾtsu]; literally &#39;rotten/putrid cheese&#39;), sometimes spelled   casu marzu, and also called   casu modde,   casu cundídu and   casu fràzigu in  Sardinian language, is a traditional  Sardinian  sheep milk cheese that contains live insect  larvae ( maggots). A variation of the cheese,   casgiu merzu,  [2] is also produced in some  Southern Corsican villages like  Sartene.  [3]\n Derived from  pecorino, casu martzu goes beyond typical  fermentation to a stage of  decomposition, brought about by the  digestive action of the larvae of the  cheese fly of the  Piophilidae family. These larvae are deliberately introduced to the cheese, promoting an advanced level of fermentation and breaking down of the cheese&#39;s  fats. The texture of the cheese becomes very soft, with some liquid (called  làgrima, Sardinian for &#34;teardrop&#34;) seeping out. The larvae themselves appear as translucent white worms, roughly 8 mm (0.3 in) long.  [4]\n   Casu martzu is created by leaving whole pecorino cheeses outside with part of the rind removed to allow the eggs of the cheese fly  Piophila casei to be laid in the cheese. A female  P. casei can lay more than 500 eggs at one time.  [4]  [5] The eggs hatch and the larvae begin to eat through the cheese.  [6] The acid from the maggots&#39; digestive system breaks down the cheese&#39;s  fats,  [6] making the texture of the cheese very soft; by the time it is ready for consumption, a typical Casu Martzu will contain thousands of these maggots.  [7]\n  Casu martzu is considered by  Sardinian aficionados to be unsafe to eat when the maggots in the cheese have died.  [8] Because of this, only cheese in which the maggots are still alive is usually eaten, although allowances are made for cheese that has been refrigerated, which results in the maggots being killed.  [8] When the cheese has fermented enough, it is often cut into thin strips and spread on moistened Sardinian flatbread ( pane carasau), to be served with a strong red wine like  cannonau.  [6]  [9] Casu martzu is believed to be an  aphrodisiac by  Sardinians.  [10] Because the larvae in the cheese can launch themselves for distances up to 15 centimetres (6 in) when disturbed,  [4]  [11] diners hold their hands above the sandwich to prevent the maggots from leaping. Some who eat the cheese prefer not to ingest the maggots. Those who do not wish to eat them place the cheese in a sealed paper bag. The maggots, starved for oxygen, writhe and jump in the bag, creating a &#34;pitter-patter&#34; sound. When the sounds subside, the maggots are dead and the cheese can be eaten.  [12]  [8]\n  According to some food scientists, it is possible for the larvae to survive the stomach acid and remain in the intestine, leading to a condition called  pseudomyiasis. There have been documented cases of pseudomyiasis with  P. casei.  [13]  [14]\n Because of  European Union food hygiene-health regulations, the cheese has been outlawed, and offenders face heavy fines.  [12] However, some Sardinians organized themselves in order to make casu martzu available on the  black market, where it may be sold for double the price of an ordinary block of  pecorino cheese.  [10]  [8] As of 2019, the illegal production of this cheese was estimated as 100 tonnes (98 long tons; 110 short tons) per year, worth 2-3 m€.  [15]\n Attempts have been made to circumvent the Italian and EU ban by having casu martzu declared a traditional food  [8] (it has been made in the same manner for more than 25 years, and it is therefore exempt from ordinary  food hygiene regulations). The traditional way of making the cheese is explained by an official paper of the Sardinian government.  [16]\n  A cooperation between sheep farmers and researchers of the  University of Sassari developed a hygienic method of production, in 2005, aiming to allow the legal selling of the cheese.  [18]\n  Outside of Sardinia, similar milk cheeses are also produced in the French island of Corsica, as a local variation of the Sardinian cheese produced in some Southern villages and known as  casgiu merzu  [2] or  casgiu sartinesu, as well as in a number of Italian regions.  [19]  [20]  [21]\n  Several other regional varieties of cheese with fly larvae are produced in the rest of Europe. For example, goat-milk cheese is left to the open air until  P. casei eggs are naturally laid in the cheese.  [6] Then it is aged in white wine, with grapes and honey, preventing the larvae from emerging, giving the cheese a strong flavour. In addition, other regions in Europe have traditional cheeses that rely on live  arthropods for ageing and flavouring, such as the German   Milbenkäse and French   Mimolette, both of which rely on  cheese mites.\n An early printed reference to  Stilton cheese points to a similar production technique.  Daniel Defoe in his 1724 work   A tour thro&#39; the whole island of Great Britain notes «We pass&#39;d Stilton, a town famous for cheese, which is call&#39;d our English  Parmesan, and is brought to table with the  mites or  maggots round it, so thick, that they bring a spoon with them for you to eat the mites with, as you do the cheese.»  [22]\n    ^    &#34;Casu, Ditzionàriu in línia de sa limba e de sa cultura sarda&#34;. Regione Autònoma de Sardigna.  c. martzu = casu fatu, fatitadu, fatitu, giampagadu, cunnitu.\n ^     a     b    Camille Cazorla (2016).  &#34;Le casu marzu, le fromage (à larves) le plus dangereux du monde&#34;.  Le Figaro.  le casu marzu qui signifie littéralement « fromage pourri » est originaire de Sardaigne, île méditerranéenne située au sud de la Corse. On l&#39;y retrouve sous plusieurs appellations,  casu modde,  casu cundhidu, mais aussi en Italie,  formaggio marcio, ou encore en Corse, sous le nom de  casgiu merzu.\n  ^     a     b     c    Berenbaum, May R (1993).    Ninety-Nine More Maggots, Mites, and Munchers. University of Illinois Press. pp.  10–14.  ISBN   0-252-06322-8.\n ^    Stephens, Andrew (30 August 2008). &#34;Top five ... challenging foods; eat, drink, cook ... and be merry&#34;.  The Age. p. A2.  Under &#34;Casu martzu&#34;\n ^     a     b     c     d    Overstreet, Robin M (December 2003).  &#34;Presidential Address: Flavor Buds and Other Delights&#34;.  Journal of Parasitology. Halifax, Nova Scotia, Canada: American Society of Parasitologists.  89 (6): 1093–1107.  doi: 10.1645/GE-236.  PMID  14740894.  S2CID  34903443 .  Under the &#34;Botflies and other insects&#34; section.\n ^    Hegarty, Shane (1 April 2006). &#34;Maggots, songbirds and other acquired tastes&#34;.  The Irish Times. p. 12.\n ^     a     b     c     d     e    Hay, Mark (31 March 2020).  &#34;The secret resistance behind the world&#39;s most dangerous cheese&#34;.  The Outline.\n ^    Loomis, Susan Herrmann (May 2002).  &#34;Sardinia, Italy&#34;.  Bon Appétit. Archived from  the original on 9 April 2006 .\n ^     a     b     Trofimov, Yaroslav (23 October 2000). &#34;As a Cheese Turns, So Turns This Tale Of Many a Maggot --- Crawling With Worms and Illicit, Sardinia&#39;s Ripe Pecorinos Fly In the Face of Edible Reason&#34;.  Wall Street Journal (Eastern Edition).  236 (37): A1.  ISSN  0099-9660.\n ^    Bethune, Brian (16 October 2006). &#34;The back pages&#34;.  Maclean&#39;s.  The agile maggots offer an additional frisson: they can bend themselves so tightly that, when they let go, the force unleashed propels them six inches or more.\n ^     a     b    Frauenfelder, Mark (2005). &#34;Most Rotten Cheese&#34;.  The World&#39;s Worst: A Guide to the Most Disgusting, Hideous, Inept, and Dangerous People, Places, and Things on Earth. Chronicle Books. pp. 22–23.  ISBN   978-0-8118-4606-6.\n ^    Peckenschneider, L. E.; Pokorný, C.; Hellwig, C. A. (17 May 1952). &#34;Intestinal infestation with maggots of the &#34;cheese fly&#34; ( Piophila casei)&#34;.  The Journal of the American Medical Association.  149 (3): 262–263.  doi: 10.1001/jama.1952.72930200005011b.\n ^    Brand, Alonzo F. (January 1931). &#34;Gastrointestinal Myiasis: Report of a Case&#34;.  JAMA Internal Medicine. JAMA.  47 (1): 149–154.  doi: 10.1001/archinte.1931.00140190160017.\n  ^     &#34;Casu frazigu – Formaggi&#34;  (PDF) (in Italian). Regione autonoma della Sardegna – ERSAT: Ente Regionale di Sviluppo e Assistenza Tecnica.  Archived  (PDF) from the original on 22 July 2011 .\n ^    Van Hare, Holly (30 May 2019).  &#34;These Cheeses Are Banned in the US&#34;.  The Daily Meal. Tribune .\n  ^    Comuni italiani.  &#34;Cacie&#39; punt&#34;.  www.comuni-italiani.it.  Archived from the original on 7 February 2011 .\n ^     &#34;Formaggio saltarello&#34;.  Prodotti tipici. Archived from  the original  (PDF) on 12 December 2011 .\n ^    Prodotti tipici.  &#34;Pecorino marcetto&#34;  (PDF).  www.prodottitipici.com. prodottitipici.com.  Archived from the original on 12 December 2011 .", "posttime": "2021-06-19 22:36:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "知道,casu,奶酪", "title": "天气不知道真理 ", "title_en": "Casu Martzu", "transed": 1, "url": "https://en.wikipedia.org/wiki/Casu_martzu", "via": "", "real_tags": ["知道", "casu", "奶酪"]}, {"category": "", "categoryclass": "", "imagename": "6a1db6e142614c31e352aae45c00d2fc.jpg", "infoid": 1066882, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数学困惑：KurtGödel（图片在1935年向他展示）图片：图片联盟\n  关于开创性的性能，曾经撕裂了数学 - 并最终建立了理论计算机科学。客人贡献。\n     今年，我们庆祝KurtGödel的突破性工作成立90周年，其成立了1931年的现代理论计算机科学和人工智能理论（AI）。戈德尔通过学术界派遣冲击波，因为他展示了计算的基本限制，ki，逻辑和数学本身。这对20世纪的科学和哲学产生了巨大影响。\n  出生于布尔诺（现在布尔诺），戈德尔在他在维也纳工作时，戈德尔为25岁。在他的研究过程中，他设计了一种通用语言来编码任意可编程的过程。它基于整数，允许描绘两个数据，例如基本房地产的公理和可提供的教学集（定理）以及程序，例如在数据上的演变行。特别是，它允许以公理形式正式地形成任何数字计算机的行为。 Gödel构建着名，自我相关，失业的正式陈述，意味着您的真实内容不是由发票确定的。\n  因此，他最终确定了算法定理提供，计算和任何类型的计算ki的基本限制。有些人甚至误解了他的结果，并认为他已经表明，男人优于ki。事实上，四十年代早期的千年早期的一大部分九十世纪次处理了戈德尔风格的定理升迁和扣除（与当今主导机械工程的归纳方法相比）。通过决定性的专家系统成功地成功地支持人类专家。\n   就像几乎所有伟大的科学家都站在别人的肩膀上。他从1891年（这表明有不同的Infinity各种各样的不同品种）的Georg颂扬的对角线诀窍来自Gottlob Frege的基本洞察力，他于1879年介绍了第一位正规语言，以及在1923年推出的职能主要递归的Thoralf Skolem。 （这些是可计算的基本构建块），以及雅克赫兰德，他认识到Skolem方法的界限。为他们，这些工作扩大了突破性的想法，该想法已经是普通学者和“第一台计算机科学家”Gottfried Wilhelm Leibniz。\n    莱布尼兹“计算！”是一个不断的启蒙的报价：“哲学家之间会有一个争议，因此他们不再需要作为会计师争论。他们只需要坐在铅笔和板岩面板上，互相说：让我们期待！“1931年，戈德尔表明，有什么至关重要的基本限制。 \n1935年，Alonzo Church领导了戈德尔的必然结果：决策问题没有一般的解决方案。为此，他使用了他的替代普通语言，称为无型Lambda微积分，这构成了有影响力的编程语言Lisp的基础。 1936年，Alan Turing介绍了另一种通用模型：图灵机​​。他再次管理上面提到的结果。同年，1936年EMIL POST公布了另一种独立的普遍模型的计算。今天我们知道很多这样的模型。然而，据称，它是突然工作，使戈德尔从他自己的方法的普遍性中信服。\n    许多戈德尔的命令序列是用整数的编码存储设施乘法键。戈德尔并不关心这种乘法的计算复杂性往往会随着记忆大小而增加。同样，教会还忽略了其算法的基本操作的上下文依赖性房间复杂度 - 计算工作必须操作以执行某种操作，并不限制开始。\n     伊朗处于经济危机深处。要完成，这需要一个新的总统 - 特别是原子协议，没有制裁。\n  电晕疫苗只有47％的初步疗效。 Curevac希望继续研究，直到他们与其他电晕案件的最终评估。\n  气候保护是一场选举活动，但只有它尽可能少的费用。 CO2价格如何增加社会可接受？\n            气候保护是一场选举活动，但只有它尽可能少的费用。 CO2价格如何增加社会可接受？\n  为什么Ey的审计师已经在WIRECARD中发现了这么长时间的骗局？现在新老板谈到了世纪丑闻。 \n在匈牙利半场前不久，令人惊讶的是领导力。 但在变革之后，法国开启了。 首先在帖子上射门，然后在门口。 游戏再次开放。 在Live Tickacter中遵循游戏。  在党大会的开始时，联合主席Hennig-Wellsow试图让左右持有左右持有的左右勇气。 但下一个争吵不应该很长。 最后，必须采用计划。  总是最新的你有帖子！ 订阅我们的FAZ.NET通讯，我们将最重要的新闻直接交给您的邮箱。 出错了。 请再试一次。  感谢您对F.a.z.-Newsletter的兴趣。 您将在几分钟内收到一封电子邮件，以确认您的时事通讯订单。 ", "note_en": "Hat die Mathematik durcheinandergewirbelt: Kurt Gödel (das Bild zeigt ihn im Jahr 1935) \t\t\t\t  Bild: Picture-Alliance\n  Über eine wegweisende Leistung, die einst die Mathematik durchrüttelte – und letztlich die theoretische Informatik begründete. Ein Gastbeitrag.\n     In diesem Jahr feiern wir den 90. Jahrestag von Kurt Gödels bahnbrechender Arbeit, die 1931 die moderne theoretische Informatik und die Theorie der Künstlichen Intelligenz (KI) begründete. Gödel sandte seinerzeit Schockwellen durch die akademische Gemeinschaft, als er die fundamentalen Grenzen des Rechnens, der KI, der Logik und der  Mathematik selbst aufzeigte. Dies hatte enorme Auswirkungen auf Wissenschaft und Philosophie des 20. Jahrhunderts.\n  Geboren in Brünn (heute Brno), war Gödel 25 Jahre alt, als er seine Arbeit in Wien verfasste. Im Zuge seiner Studien entwarf er eine universelle Sprache zur Codierung beliebiger formalisierbarer Prozesse. Sie beruht auf den ganzen Zahlen und erlaubt, sowohl Daten darzustellen, etwa Axiome für die Grundrechenarten und beweisbare Lehrsätze (Theoreme), als auch Programme, zum Beispiel beweiserzeugende Reihen von Operationen auf den Daten. Insbesondere gestattet sie, das Verhalten eines beliebigen digitalen Computers in axiomatischer Form zu formalisieren. Gödel konstruierte berühmte, selbstbezügliche, unentscheidbare formale Aussagen, die implizieren, dass ihr Wahrheitsgehalt nicht durch eine Rechnung ermittelbar ist.\n  Damit identifizierte er letztlich fundamentale Grenzen des algorithmischen Theorembeweisens, des Rechnens und jeder Art rechnender KI. Manche missverstanden sein Ergebnis sogar und dachten, er hätte gezeigt, dass der Mensch der KI überlegen sei. In der Tat beschäftigte sich ein Großteil der frühen KI der Vierziger- bis Siebzigerjahre mit Theorembeweisen und Deduktion im Gödel-Stil (im Gegensatz zum induktiven Ansatz des heute dominanten maschinellen Lernens). Dabei gelang es bis zu einem gewissen Grade, menschliche Spezialisten durch schlussfolgernde Expertensysteme zu unterstützen.\n   Wie fast alle großen Wissenschaftler stand Gödel auf den Schultern anderer. Er kombinierte Georg Cantors berühmten Diagonalisierungstrick aus dem Jahre 1891 (der zeigte, dass es verschiedene Sorten der Unendlichkeit gibt) mit grundlegenden Einsichten von Gottlob Frege, der im Jahr 1879 die erste formale Sprache vorstellte, sowie von Thoralf Skolem, der im Jahr 1923 primitiv rekursive Funktionen einführte (das sind Grundbausteine des Berechenbaren), sowie von Jacques Herbrand, der die Grenzen von Skolems Ansatz erkannte. Diese Arbeiten erweiterten ihrerseits bahnbrechende Ideen, die schon viel früher der Universalgelehrte und „erste Informatiker“ Gottfried Wilhelm Leibniz hatte.\n    Leibniz’ „Calculemus!“ war ein prägendes Zitat der Aufklärung: „Käme es zwischen Philosophen zur Kontroverse, so bräuchten sie nicht mehr zu streiten als Buchhalter. Sie müssten sich nur mit ihren Bleistiften und Schiefertafeln hinsetzen und zueinander sagen [...]: Lasst uns rechnen!“ Im Jahr 1931 zeigte Gödel jedoch, dass es fundamentale Grenzen dessen gibt, was durch Rechnen entscheidbar ist.\n  Im Jahre 1935 leitete dann Alonzo Church ein Korollar des Gödel’schen Ergebnisses ab: Das Entscheidungsproblem hat keine allgemeine Lösung. Dazu verwendete er seine alternative universelle Sprache namens Untyped Lambda Calculus, welche die Grundlage der einflussreichen Programmiersprache LISP bildet. Im Jahr 1936 wiederum stellte Alan Turing ein weiteres universelles Modell vor: die Turing-Maschine. Damit leitete er das oben erwähnte Ergebnis abermals ab. Im selben Jahr 1936 veröffentlichte auch Emil Post ein weiteres unabhängiges Universalmodell des Rechnens. Heute kennen wir viele solcher Modelle. Angeblich war es aber Turings Arbeit, die Gödel von der Universalität seines eigenen Ansatzes überzeugte.\n    Viele von Gödels Befehlssequenzen waren Aneinanderreihungen von Multiplikationen von codierten Speicherinhalten mit ganzen Zahlen. Gödel kümmerte sich nicht darum, dass die rechnerische Komplexität solcher Multiplikationen tendenziell mit der Speichergröße zunimmt. In ähnlicher Weise ignorierte auch Church die kontextabhängige raumzeitliche Komplexität der grundlegenden Operationen seiner Algorithmen – der Rechenaufwand, der dabei zur Ausführung einer bestimmten Operation betrieben werden muss, ist nicht von vorneherein beschränkt.\n     Iran steckt in einer tiefen Wirtschaftskrise. Um die zu beenden, braucht es mehr als einen neuen Präsidenten – vor allem ein Atomabkommen und keine Sanktionen.\n  Der Corona-Impfstoff hat Untersuchungen zufolge nur eine vorläufige Wirksamkeit von 47 Prozent. CureVac will die Studie aber bis zu ihrer finalen Auswertung mit weiteren Corona-Fällen fortsetzen.\n  Klimaschutz ist ein Wahlkampfschlager, aber nur dann, wenn er möglichst wenig kostet. Wie lässt sich der CO2-Preis sozialverträglich erhöhen?\n            Klimaschutz ist ein Wahlkampfschlager, aber nur dann, wenn er möglichst wenig kostet. Wie lässt sich der CO2-Preis sozialverträglich erhöhen?\n  Warum haben die Wirtschaftsprüfer von EY den Betrug bei ­Wirecard so ­lange nicht ­entdeckt? Jetzt ­sprechen die neuen Chefs über den Jahrhundertskandal.\n  Kurz vor der Halbzeit geht Ungarn überraschend in Führung. Doch nach dem Wechsel dreht Frankreich auf. Erst landet ein Schuss am Pfosten, dann einer im Tor. Die Partie ist wieder offen. Verfolgen Sie das Spiel im Liveticker.\n  Zu Beginn des Parteitags versucht die Ko-Vorsitzende Hennig-Wellsow der verunsicherten Linkspartei Mut zu machen. Aber der nächste Streit dürfte nicht lange auf sich warten lassen. Schließlich muss noch ein Programm verabschiedet werden.\n  Immer auf dem Laufenden  Sie haben Post!  Abonnieren Sie unsere FAZ.NET-Newsletter und wir liefern die wichtigsten Nachrichten direkt in Ihre Mailbox.  Es ist ein Fehler aufgetreten. Bitte versuchen Sie es erneut.\n    Vielen Dank für Ihr Interesse an den F.A.Z.-Newslettern. Sie erhalten in wenigen Minuten eine E-Mail, um Ihre Newsletterbestellung zu bestätigen.", "posttime": "2021-06-19 22:36:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "del,kurt,计算", "title": "由于KurtGödel发现了可预测的限制 ", "title_en": "Als Kurt Gödel die Grenzen des Berechenbaren entdeckte", "transed": 1, "url": "https://www.faz.net/aktuell/wirtschaft/digitec/mathematik-als-kurt-goedel-die-grenzen-des-berechenbaren-entdeckte-17388864.html", "via": "", "real_tags": ["del", "kurt", "计算"]}, {"category": "", "categoryclass": "", "imagename": "23183137c8de35ba21b0f69bbf986a9d.png", "infoid": 1066880, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在大流行期间吸取了学习电子产品，并且享受了一点。我一直在编程25年以上，所以有不同的东西来学习和工作，仍然是技术和创造力。对自然工作的基本势力如何更好地了解了更好的了解，以及在需要的情况下，能够从旧打印机的手工曲柄动力手电筒（看出40秒的视频！）。在一天结束时，在一天结束时也是很好的，尽管它确实需要消耗品部分，所以有优点和缺点。\n 朋友（嗨韦恩！）和YouTube帮助了我了解了很多，但我发现这个主题很漂亮，并希望在不同的POV的一些解释中尝试我的手。这篇文章通过将第一步进入DC电子产品来开始该旅程。\n  如果存在流入的路径，则电力流动，并且流量由电子组成。\n 电子被带负电，从而从电路的负侧行进到正侧。\n 常规电流从此向后倒退，并表示电力从正面流到负面。在这种情况下，它不是电子流动但“孔”流动。孔是一个奇怪的概念，但它们只是一个接受电子的地方。\n 这是一个开路，这意味着存在间隙。由于电路未关闭，电力不能流动。 （由https://www.circuitlab.com/Editor/#）\n    左侧的圆圈是带有+和终端的电源。它标记为1.5伏的电池。 \n这里是具有可用于打开或关闭电路的开关的电路的图。能够读取并使电路图在建立事物或试图了解电路工作时真正有用。\n  注意：电压越高，电力越远可以跨越差距。因此，虽然在低电压下，电路可以打开，转动电压可能使其在电弧跨越时关闭！\n    您可以了解DC电力的最有用的东西是俄亥俄州的法律，其中数学地解释了电压，电流和阻力之间的关系。欧姆的法律是：\n  在等式中，我代表强度，意味着当前的AKA放大器，V代表电压，R代表电阻。\n 如果电力是水，电压将是水压，恒温将是通过管道贯穿多少水，并且电阻将是管道的挤压，就像上面的图像一样。\n 在安培中测量安培或字母A. 500mA是500毫安，或者AMP的一半，1.2A是1.2安培。注意：电力很危险！它可以只需要几百毫安是致命的，但需要电压才能让那些安培穿透你的皮肤。\n 电压以伏特或字母V测量。如果您在电池上看到9V，这意味着它是9伏电池，并且能够提供9伏。 \n在欧姆或ω符号中测量电阻。所以，如果你看到这意味着5欧姆的抵抗力。如果您看到这意味着5千克姆，则阻力量1000倍。如果你用国会大厦M看到，这意味着5兆米，这是抵抗力的1000倍。\n 欧姆法派上方便的地方是，当你知道这三个值中的两个时，你试图计算第三个价值。\n 正如书面所示，该公式显示了如何在您了解电压和电阻时计算放大器，但您可以使用代数重新安排到其中任何三种的公式：\n    这常常出现 - 如果您知道电池有多大电压，并且您知道您需要多少放大器，可以使用它来计算电阻的值以获得所需的放大器。\n  LED代表发光二极管。二极管是让电力仅在一个方向上流动的东西，并且它有几种常见用途：\n 通过整流它将交流电流（AC）转换为直流（AC）（防止AC的负部分通过。与最后一个例子相同）\n 很多很酷的技巧，就像通过在电路中的特定值“溢出”上的特定值“溢出”上稳定不均匀的功率水平。 \n这是一包我从亚马逊购买的各种二极管10美元。有一个相当多种不同类型的二极管，这对于不同的情况有用。\n  这是一些二极管关闭。黑色是In4001的整流二极管，并且更彩色的是开关二极管1n4148。这些部件号实际上是在二极管中写入的，但有点难看。您可以使用这些数字来查找零件的数据表，以了解它们的工作原理，它们的属性是多少，它们可以处理多少电压和放大器，并且通常甚至看到使用它们进行常用任务的简单电路图。数据表是超级有用的，如果做电子产品的工作，你将谷歌曲相当多！以下是1N4148的数据表，我发现了“1n4148数据手册”的谷歌曲和单击第一个链接。 1N4148数据表。\n  以下是其中两个电路图。带有线的黑色三角形是二极管。箭头显示它允许传统流动的方向。箭头上的线对应于上述图像中的二极管右侧的频带，这是二极管（阴极）的负侧。左电路是闭合电路，并允许电流流动。二极管是向前偏置的。右侧的电路具有二极管反向偏置，其不允许电流流动。\n  LED可以做很多常规二极管可以做的事情，因为它们是二极管，但它们有电力流过它们的财产，它们亮起。由于它们是二极管，并且只能让电力在一个方向上流动，因此LED具有+侧和A  - 侧，并且您必须在电路中正确地将它们挂钩，以便它们点亮。如果您将其挂钩错误的方式，它不会损坏它们，但它们不会亮起，并且它们不会关闭电路电路以流动。 LED的符号是二极管符号，但箭头出来。\n  以下是我拥有的一组LED，作为更大的电子套件的一部分。您可以从亚马逊获得多种颜色的百次LED约10美元。有些LED呈彩色塑料情况，有些是清晰的案例。甚至有红外线和紫外线闪耀的LED。 LED也有不同的尺寸。该包装有3mm和5mm的LED。\n  这是一个仔细看看白色LED。较长的腿是正面，这意味着如果您希望它亮起，您需要将电路的正侧插入其中。负面有一个较短的腿，但是负面在底部的圆环上也具有平坦的一侧，在这张照片中不能真正看到。\n  所有二极管都有一个电压降，这是二极管消耗的电压量。如果您提供少于该电压量，则二极管将充当开口开关，电力不会流过它。二极管的具体电压降可以在数据表中找到，但我发现很难找到LED的数据表。幸运的是，我从亚马逊拿起了一个“Mega328”的组件测试仪15美元。它允许您插入组件，按蓝色按钮，然后告诉您有关组件的信息。这是超级方便！在这里，您可以看到2个不同LED的电压降。较小的红色LED具有1.88V的电压降，而较大的绿色LED具有2.5V的电压降。如果您提供少于该电压量的供应，它们不会亮起！ \n那么如果我们试图将LED连接到下面的电池时会发生什么？\n  大型绿色LED具有2.5V电压下降，而AAA电池仅有1.5V，您可以在标签上看到。这意味着LED不会亮起。\n 较小的红色LED具有1.88V电压下降，并连接到9V电池，因此它具有足够的电压，应亮起。让我们使用欧姆定律来计算大量的电流 - 正在通过LED。\n i = v / r，在我们的情况下，v是9并且r是0，因为我们没有阻力。\n  哎呀我们有无限的电流！插入后，LED畅销。\n 实际上没有无限电流，因为连接到LED的金属线对它们具有非常小的电阻，就像所有导线一样，电池限制它可以给出多少放大器。因此，无论如何，它不是无限的放大器，但它是一个非常大的数字，受到9V电池实际上可以提供多少安培的限制。 LED实际上将被摧毁。您应该基本上总是使用带有LED的电阻来限制电流并将其保留被销毁。以下是关于如何计算电池内部电阻的有趣，然后电池将告诉您可以为您提供多少放大器：测量电池的内部电阻。\n 当您有一个具有这种较低电阻的电路时，它被认为是短路，如果LED没有被摧毁，电池将开始变热，它可能成为危险情况。这也是为什么短路本身是坏消息。他们有很多目前穿过它们，这可能导致升温，融化和着火。 \n3mm和5mm LED通常需要20毫安最大（20mA或0.02A）处于全亮度。如果您减少，它们将不那么光明但仍然是功能。\n 我们可以计算，如果我们知道我们使用的电源的电压，并且我们试图为LED的电压下降，我们想要最大程度的阻力。\n 让我们带上2.5V电压下降的较大的绿色LED，并用9V击打电压，旨在获得20mA。\n 首先，我们从电源中减去电压下降，看看我们必须使用的电压：9V  -  2.5V = 6.5V。\n 接下来，我们知道我们想要20mA，我们有6.5V，我们只是试图解决抵抗，所以我们使用欧姆的法律：r = v / i。\n  因此，我们需要325欧姆的抵抗力，从9V电池中获得20mA。这是我从亚马逊获得的一包电阻12美元。\n  电阻器有滑稽的彩色乐队，告诉你他们的评分。您可以找到用于解码它们的图表，但再次，“Mega328”也会告诉您这个。 \n事实上，多米将告诉您。多米不是很贵。这是我从亚马逊获得的35美元，这有大量的功能，真的很好地工作。\n  我没有任何325欧姆电阻，但我确实有470欧姆电阻，所以我只需使用其中一个。如果你做数学的那样，那就是那么低于20mA，但尽管没有像它一样明亮，但它仍然很好。您可以通过并行连接电阻或串联连接和执行一些数学来获得不同的电阻，但这是现在的作用。我用了一个迷你面包板（绿色的东西）来挂钩这个电路。每个5个孔的水平线电连接。这是一个很好的方式，不必一起焊接焊接。按照惯例，红色用于正端子，黑色或蓝色用于负面。\n    顺便说一下，快速有趣的事实。当下降到1.35V时，1.5V AA电池被认为是死亡的。此时，它仍然有能量！如果您是巧妙的电子产品，您可以将电路从死电池中使用此电源以提供1.5V或更高，并且您可以进一步排出所谓的戴前电池。\n  电子产品中的许多东西都变得可逆。发言者作为较差的麦克风，麦克风作为穷人工作。同样，LED可以用作差的太阳能电池并将光线变为能量。想看吗？这里我将万用表挂钩到LED，并将其设置为读取伏特。它读了48.7mv。能量从我们周围流动到无线电波等，所以它正在拿起一些。\n  当我将LED放在手电筒的光束中时，它跳跃高达1.644V。相当酷吧？\n   它比我通常写的一些不同，但希望你喜欢它。虽然，但这件东西很快就会升级。在您知道之前，您将收获来自旧打印机的光耦合器和线圈，以制作轨道枪。 ", "note_en": "I’ve taken up learning electronics during the pandemic, and have enjoyed it quite a bit. I’ve been programming for 25+ years, so it’s nice to have something different to learn and work on that is still both technical and creative. It’s cool getting a deeper understanding of how the fundamental forces of nature work, as well as being able to MacGyver a hand crank powered flashlight from an old printer if needed ( Check out a 40 second video of that here!). It’s also nice having something physical to show at the end of the day, although it does require consumable parts, so there are pros and cons vs making software.\n Friends (Hi Wayne!) and YouTube have helped me learn a lot, but I found the subject pretty alien at first and wanted to try my hand at some explanations from a different POV. This post starts that journey by taking the first steps into DC electronics.\n  Electricity flows if there is a path for it to flow in and the flow is made up of electrons.\n Electrons are negatively charged so travel from the negative side of a circuit to the positive side.\n Conventional current flow is backwards from this though, and says that electricity flows from the positive side to the negative side. In this case, it’s not electrons flowing but “holes” flowing. Holes are a weird concept, but they are just a place that will accept an electron.\n Here is an open circuit, which means that there is a gap. Since the circuit is not closed, electricity cannot flow. (made in  https://www.circuitlab.com/editor/#)\n    The circle on the left is a power source with a + and – terminal. It’s labeled as a 1.5 volt double A battery.\n Here is a diagram of a circuit with a switch that can be used to open or close the circuit. Being able to read and make circuit diagrams is real helpful when building things or trying to understand how circuits work.\n  Of note: the higher the voltage, the farther that electricity can jump across gaps. So, while at low voltage, a circuit may be open, turning up the voltage may make it closed when the electricity arcs across!\n    The most useful thing you can learn about DC electricity is Ohm’s law which mathematically explains the relationship between voltage, amperage and resistance. Ohm’s law is:\n  In the equation I stands for Intensity and means current aka amps, V stands for voltage and R stands for resistance.\n If electricity was water, voltage would be the water pressure, amperage would be how much water was running through the pipe, and resistance would be a squeezing of the pipe, like in the image above.\n Amps are measured in amperes or the letter A. 500mA is 500 milliamps, or half of an amp, and 1.2A is 1.2 amps. Note: electricity is dangerous! It can take only a few hundred milliamps to be fatal, but voltage is needed to be able to let those amps penetrate your skin.\n Voltage is measured in volts or the letter V. If you see 9V on a battery, that means it’s a 9 volt battery, and is capable of providing 9 volts.\n Resistance is measured in Ohms or the omega symbol  . So if you see   that means 5 Ohms of resistance. If you see   that means 5 kiloohms which is 1000 times as much resistance. If you see   with a capitol M, that means 5 megaohms, which is 1000 times as much resistance again.\n Where Ohm’s law comes in handy is when you know two of these three values and you are trying to calculate the third one.\n As written, the formula showed how to calculate amps when you know voltage and resistance, but you can use algebra to re-arrange it to a formula for any of the three:\n    This comes up quite often – if you know how much voltage a battery has, and you know how many amps you need, you can use this to calculate the value of the resistor to get the desired amps.\n  LED stands for Light Emitting Diode. A diode is something which lets electricity only flow in one direction and it has a couple of common uses:\n Turning Alternating Current (AC) into Direct Current (AC) by rectifying it (preventing the negative part of AC from getting through. Same as last bullet point)\n Lots of cool tricks, like stabilizing uneven power levels by letting voltage over a specific value “spill over” out of the circuit.\n Here is a pack of various diodes i bought from amazon for 10$. There are a quite a few different types of diodes, which are useful for different situations.\n  Here are some diodes close up. The black one is a rectifier diode IN4001, and the more colorful one is a switching diode 1N4148. Those part numbers are actually written on the diodes themselves but are a bit hard to see. You can use these numbers to look up the data sheet for the parts to understand how they work, what their properties are, how much voltage and amps they can handle, and often even see simple circuit diagrams on using them for common tasks. Data sheets are super useful and if doing electronics work, you will be googling quite a few of them! Here is the data sheet for 1N4148 which i found by googling for “1N4148 data sheet” and clicking the first link.  1N4148 Data sheet.\n  Here are two circuit diagrams with diodes in them. The black triangle with the line on it is a diode. The arrow shows the direction that it allows conventional flow to travel. The line on the arrow corresponds to the bands on the right of the diodes in the image above, which is the negative side of the diode (cathode). The left circuit is a closed circuit and allows electricity to flow. That diode is forward biased. The circuit on the right has the diode reverse biased which does not allow electricity to flow.\n  LEDs can do many things regular diodes can do, since they are diodes, but they have the property that when electricity flows through them, they light up. Since they are diodes, and only let electricity flow in one direction, LEDs have a + side and a – side and you have to hook them up correctly in a circuit for them to light up. If you hook them up the wrong way, it doesn’t damage them, but they don’t light up and they don’t close the circuit for electricity to flow. The symbol for an LED is the diode symbol, but with arrows coming out of it.\n  Here are a pack of LEDs i have that came as part of a larger electronics kit. You can get a couple hundred LEDs in a variety of colors from amazon for about 10$. Some LEDs are in colored plastic cases, some are in clear cases. There are even LEDs that shine in infrared and ultraviolet. LEDs also come in different sizes. This pack has 3mm and 5mm LEDS.\n  Here is an up close look at a white LED. The longer leg is the positive side, which means you need to plug the positive side of the circuit into it if you want it to light up. the negative side has a shorter leg, but the negative side also has a flat side on the circular ring at the bottom, which can’t really be seen in this picture.\n  All diodes have a voltage drop, which is a voltage amount consumed by the diode. If you are providing less than that amount of voltage, the diode will act as an open switch, and electricity won’t flow through it. The specific voltage drop for diodes can be found in data sheets, but i’ve found it difficult to find data sheets for LEDs. Luckily I picked up a “Mega328” component tester from amazon for 15$. It lets you plug in a component, press the blue button, and then tells you information about the component. It’s super handy! Here you can see the voltage drop of 2 different LEDs. The smaller red LED has a voltage drop of 1.88V while the larger green LED has a voltage drop of 2.5V. If you supply them with less than that amount of voltage, they will not light up!\n   So what would happen if we tried to connect the LEDs to the batteries below?\n  The large green LED has a 2.5V voltage drop, while the AAA battery only has 1.5V as you can see on the label. That means the LED doesn’t light up.\n The smaller red LED has a 1.88V voltage drop and is connecting to a 9V battery so it has enough voltage and should light up. Let’s use Ohm’s law to calculate how much current – in amps – are going through the LED.\n I = V/R and in our case V is 9 and R is 0 because we have no resistance.\n  Oops we have infinite current! The LED is destroyed pretty quickly after you plug it in.\n There isn’t actually infinite current, because the metal wires connected to the LED have a very tiny amount of resistance to them, just like all wire, and the battery has a limit of how many amps it can give. So in any case, it isn’t infinite amps, but it is a very large number, limited by how many amps the 9V battery can actually deliver. The LED would actually be destroyed. You should basically always use a resistor with an LED to limit the current and keep it from being destroyed. Here is an interesting read about how to calculate the internal resistance of a battery which will then tell you how many amps it can give you:  Measuring Internal Resistance of Batteries.\n When you have a circuit with this low of resistance, it’s considered a short circuit, and if the LED didn’t get destroyed, the battery would start getting hot and it could become a dangerous situation. This is also why short circuits themselves are bad news. They have a LOT of current running through them which can cause things to heat up, melt and catch fire.\n 3mm and 5mm LEDs typically want 20 milliamps maximum (20mA or 0.02A) to be at full brightness. If you give them less, they will be less bright but still function.\n We can calculate then how much resistance they want to be maximally bright if we know the voltage of the power source we are using and the voltage drop off of the LED we are trying to power.\n Let’s take the larger green LED with a 2.5V voltage drop, and power it with a 9V batter, aiming to get 20mA.\n First we subtract the voltage drop from the supply to see how much voltage we have to work with: 9V – 2.5V = 6.5V.\n Next, we know we want 20mA and we have 6.5V, and we are just trying to solve for resistance so we use Ohm’s law: R = V/I.\n  So, we need 325 ohms of resistance to get 20mA in our LED from a 9V battery. Here is a pack of resistors i got from amazon for 12$.\n  Resistors have funny colored bands on them which tell you their rating. You can find charts for decoding them all over the place, but again, the “Mega328” will tell you this too.\n  In fact, a multi meter will tell you as well. Multi meters aren’t very expensive. Here’s one i got from amazon for 35$ which has tons of features and works really nicely.\n  I don’t have any 325 ohm resistors, but i do have 470 ohm resistors, so i’ll just use one of those. That’s 14mA if you do the math, which is a bit lower than 20mA, but it still works just fine despite not being as bright as it could be. You can get different resistances by connecting resistors in parallel or series and doing some math, but this works for now. I used a mini breadboard (the green thing) to hook this circuit up. Every horizontal line of 5 holes is connected to each other electrically. It’s a nice way to play with circuits without having to solder things together. By convention, red is used for the positive terminal and black or blue is used for the negative.\n    By the way, quick fun fact. A 1.5V AA battery is considered dead when it has dropped down to 1.35V. At this point, it still has energy in it though! If you are clever with electronics, you could make circuitry to use this power from dead batteries to give you 1.5V or higher, and you could drain so called dead batteries even further.\n  Many things in electronics turn out to be reversible. Speakers work as poor microphones, and microphones work as poor speakers. Similarly, LEDs can work as poor solar cells and turn light into energy. Want to see? Here i hook my multimeter up to an LED, and have it set to read volts. It reads 48.7mV. Energy is flowing all around us from radio waves, etc, so it’s picking up some of that.\n  When i put the LED in the beam of the flashlight, it jumps up to 1.644V. Pretty cool huh?\n   It’s a little different than what I usually write about, but hopefully you liked it. Careful though, this stuff escalates quickly. Before you know it you’ll be harvesting optocouplers and coils from old printers to make a rail gun.", "posttime": "2021-06-19 21:53:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放大器,amps,led", "title": "电压，放大器，电阻和LED ", "title_en": "Voltage, Amps, Resistance and LEDs", "transed": 1, "url": "https://blog.demofox.org/2021/06/15/voltage-amps-resistance-and-leds-ohms-law/", "via": "", "real_tags": ["放大器", "amps", "led"]}, {"category": "", "categoryclass": "", "imagename": "fa6f8bd2006b2508a2fe5ac5837786f8.png", "infoid": 1066879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约一千年前，20多岁的年轻人在英格兰遇到了一个暴力的终结。距离丹麦800公里（500英里）距离丹麦，一个在他的50多岁时幸存一生的老人幸存下来。乍一看，没有什么可以建议它们之间的联系在这样的距离之间。但根据最近对他们的DNA进行研究，这两个人是二级亲属：半兄弟姐妹，叔叔和侄子，或祖父和孙子。\n 今天，他们的骷髅在丹麦国家博物馆并排，经过几个世纪以来，年鉴（AFP）报告。\n 遗传学家将该对的DNA测序，作为更大的研究的一部分，其在欧洲和格陵兰群岛的景点中的400多个人类骷髅中取样和测序古代DNA。该数据显示，Vikings比历史学家经常被认为是历史学家更具种族的多样化，并且它帮助跟踪了定义了Viking年龄的迁移。在那些较大的模式的背景下，来自两个骷髅的古代DNA，在截然不同的情况下埋葬了数百公里，讲述了更多的个人故事。\n “这是一个很大的发现，因为现在你可以通过家庭追踪空间和时间的运动，”丹麦国家博物馆的Jeannette瓦尔特格说。\n 鉴于Viking Age所知道的，很容易想象至少这个家庭故事的广泛笔画。 50岁的历史可能是沿着大陆欧洲海岸的突袭的退伍军人，或者在英国群岛上袭击的退伍老兵;他的骨骼显示出在战斗中持续的旧的长期愈合伤口的证据。但他为他的时间和职业生活到了一个相对较大的时代（正如他们所说，让一个老人在一个男人通常死亡的职业中）。\n    在英国海岸的袭击中，20岁可能已经死亡，或者他可能已经在Etheled II国王的丹麦州丹麦队赶上了。他在英格兰牛津的一个群众坟墓中结束了，他的头骨被杀死他的吹吹。推测这两个男人彼此认识或至少互相认识这两个人是合理的，但是考古学家的证据是不够的，可以说他们是否同时生活，或者哪一个先生。\n “这很难判断他们是否在同一年龄中生活或者他们可能因一代人而异，因为你在坟墓里没有材料可以给出精确的约会，”瓦尔特格说。 \n这是一个在英格兰去世的年轻人们与塞米尔，叔叔或祖父留在丹麦的思想中，争夺战斗; 也许他们并肩作战，或者也许他希望达到他的老年人的故事。 再一次，在丹麦去世的老将战士都记得兄弟姐妹或比赛中的兄弟姐妹的故事，这同样符合。  无论哪种方式，这对勇士都是一个古老的DNA和考古的优秀提醒，更普遍 - 可以告诉我们过去，从扫描大规模的人类运动模式，以更为个人的生命，对个人和家庭的更多个人生活。 曾经很大程度上，这两种故事都从同一研究中出现。 ", "note_en": "Roughly a thousand years ago, a young man in his early 20s met a violent end in England. 800 kilometers (500 miles) away, in Denmark, an older man who had survived a lifetime of battles died sometime in his 50s. At first glance, there’s nothing to suggest a connection between them over such a distance. But according to a recent study of their DNA, the two men were second-degree relatives: half-siblings, uncle and nephew, or grandfather and grandson.\n Today, their skeletons lie side-by-side in the National Museum of Denmark, reunited after centuries, Agence France-Presse (AFP) reported.\n Geneticists sequenced the pair’s DNA as part of a much larger study, which sampled and sequenced ancient DNA  from more than 400 human skeletons at sites across Europe and Greenland. That data revealed that Vikings were much more ethnically diverse than historians have often assumed, and it helped track the migrations that defined the Viking Age. Against the backdrop of those larger patterns, the ancient DNA from two skeletons, buried hundreds of kilometers apart under very different circumstances, told a much more personal story.\n “This is a big discovery because now you can trace movements across space and time through a family,” Jeannette Varberg of the National Museum of Denmark said.\n Given what is known about the Viking Age, it’s easy to imagine at least the broad strokes of this family’s story. The 50-year-old may have been a veteran of raids along the coast of continental Europe, or a returning veteran of raids on the British Isles; his bones showed evidence of old, long-healed wounds sustained in combat. But he lived to a relatively old age for his time and occupation (as they say, beware an old man in a profession where men usually die young).\n    The 20-year-old may have may have died during a raid on the English coast, or he may have been caught up in King Ethelred II’s 1002 CE purge of Danes living in England. He ended up in a mass grave in Oxford, England, with his skull shattered by the blows that killed him. It’s reasonable to speculate that the two men knew each other, or at least knew of each other, but there’s not enough evidence for archaeologists to say whether they lived at the same time, or which of them was born first.\n “It’s very difficult to tell if they lived in the same age or they differ maybe by a generation, because you have no material in the grave that can give a precise dating,” Varberg said.\n It’s plausible that the young man who died in England went to battle with thoughts of impressing a sibling, an uncle, or a grandfather back in Denmark; perhaps they fought side-by-side, or perhaps he was hoping to live up to his elder’s stories. Then again, it’s equally plausible that the veteran warrior who died in Denmark remembered the stories of a sibling or older relative who died in battle far to the west.\n Either way, the pair of warriors are an excellent reminder of what ancient DNA—and archaeology, more generally—can tell us about the past, from sweeping large-scale patterns of human movements to the much more personal lives of individual people and families. And once in a great while, both kinds of stories emerge from the same study.", "posttime": "2021-06-19 21:18:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "burials,丹麦", "title": "两艘Viking Burials，被海洋隔开，包含关闭亲属 ", "title_en": "Two Viking burials, separated by an ocean, contain close kin", "transed": 1, "url": "https://arstechnica.com/science/2021/06/ancient-dna-finds-family-ties-between-viking-age-warriors/", "via": "", "real_tags": ["burials", "丹麦"]}, {"category": "", "categoryclass": "", "imagename": "f97351b0e3e2646aeee931d9866e2752.jpg", "infoid": 1066878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即便如此，在工作，就业和社会中，学者们在2020年9月20日在2020年9月去世的美国人类学家David Graeber中赞赏，突出了一个人的工作和心理健康之间的联系。\n 格拉伯最初提出了“胡说八道工作”的概念 - 即使是那些在他的2013年文章中观看毫无价值的工作的概念 - 在他的2013年民主项目中。他进一步扩大了这一理论，在2018年的书废话工作中：一个理论，看待这种工作的可能原因。\n Graeber被描述为废话（BS）的工作范围从门卫和接待员到Lobbys和公共关系专家到法律职业，特别是企业律师和法律顾问。\n 剑桥大学索维亚博士以及文章的作者中的一位作者中的哪个福祉作品，说：“对废话的工作理论有一些吸引人。许多人在某些地方工作的事实可以解释为什么格拉伯工的工作与如此许多人都与他所提供的账户有关的人共鸣。但他的理论不是基于任何可靠的经验数据，即使他提出了几个命题，所有这些都是可测试的。“\n 为了测试格法伯的命题，研究人员转向2005  -  2015年欧洲工作条件调查（EWCS），检查了导致受访者回答“很少”或“从不”的声明的原因：'我有做有用的工作的感觉'。调查 -  2010年，2010年和2015年 - 采取了对工作的有用性，工人的福祉和客观数据的措施。受访者人数从2005年超过21,000人增长到2015年近30,000人。\n 根据Graeber的说法，在劳动力的20％和50％之间的某个地方 - 可能在BS工作中使用多达60％。然而，EWCS发现只有4.8％的欧盟工人表示他们没有觉得他们做了有用的工作。英国和爱尔兰的数字略高，但仍然只有5.6％的工人。\n 格劳斯也声称，尽管没有经验证据，但近年来，BS工作的数量已经“近年来迅速增加”。研究人员再次发现没有证据支持这一猜想 - 事实上，BS就业人民的百分比从2005年的7.8％下降到2015年的4.8％ - 与Graeber的预测完全相同。 \n他的下一个假设是，BS工作集中在特定的职业，如金融，法律，行政和营销，在很大程度上缺席，例如与公共服务和人工劳动有关的人。 “许多服务工人讨厌他们的工作;但即使是那些确实的人也意识到他们所做的事情确实在世界上产生了一些有意义的差异。 。 。 [但是]我们只能假设任何一个人可能怀疑的办公室工作人员秘密地认为自己是胡说八道的工作，确实相信这一点，“他写道。\n 当研究人员通过评级工作的比例很少或从未有用的人排名职业时，他们没有发现任何证据存在占领的职业，其中大多数工人觉得他们的作品无用。\n 作者发现，一些职业的工人，如教师和护士，通常会看到自己做了有用的工作，而销售工人的比例高于平均值，他们的工作是没有有用的（7.7％）。即便如此，大多数结果都违反了格拉伯的断言。例如，法律专业人士和行政专业人员在这一排名中都很低，而Greaber率作为基本非BS工作的示例，例如垃圾收集者（9.7％）和清洁剂和助手（8.1％）很高这个规模。\n 然而，不是格拉伯建议的一切都是错误的。例如，他争辩说，BS工作是一种“精神暴力”的形式，导致工人之间的焦虑，抑郁和痛苦。这些团队在一个人的工作中发现了强有力的证据，无用，个人的心理健康，尽管是相关的，而不是必然是一个因果关系。在英国2015年，在世界卫生组织的福利指数上，觉得自己的工作的工人没有得分明显降低，而不是那些觉得他们正在做有用的工作的人（平均值为49.3，而与64.5相比）。其他欧盟各国存在类似的差距。\n 来自伯明翰大学的Alex Wood博士说：“当我们从欧洲的大型人群中查看易用的数据时，这对我们来说显而易见的是，格拉伯柏理论中很少有人的关键命题可以持续 - 这在我们看过的每个国家都是如此，以不同程度的情况。但他最重要的命题之一 -  BS工作是一种“精神暴力”的形式 - 似乎是数据的支持。“\n 鉴于，绝对术语，大量的人不会将工作视为有用，然后导致这种感觉？该团队发现，这些人认为受到管理受到尊重和鼓励的人不太可能将其工作报告为无用。相反，当员工经历不尊重，低效或穷人的管理时，他们不太可能将其工作视为有用。\n 同样，将其工作视为有用的个人倾向于能够在工作中使用自己的想法 - 这是一个重要的因素，以便您的工作为您提供充分利用您的技能的能力 - 与效用的看法相关。人们之间有明显的关系，人们认为他们有足够的时间做好工作的时间以及他们对工作的有用率的评价，这表明一个感觉一份无用的源是一个人的速度工作，影响实现一个人的潜力和能力的能力。其他因素与感觉相关的因素有价值，包括经理和同事的支持以及影响组织的重要决策和方向的能力。 \nBrendan Burchell教授来自剑桥大学说：“虽然数据并不总是支持大卫格劳伯的主张，但他的洞察力和富有想象力的工作在提高对无用工作危害的认识方面发挥了重要作用。 他可能已经在普通的BS工作方面已经离开了标记，但他是正确的，但是将人们对他们的工作态度联系起来，这是雇主 - 以及整个社会的东西 - 应该认真对待。  “最重要的是，如果转弯是价值的，员工需要受到尊重和重视 - 并从心理上以及财务上效益 - 他们的工作。”  参考索维亚，M，Wood，AJ和Burchell，B.异化不是“废话”：一个实证批评Graeber的BS工作理论。 WES; 2021年6月3日; DOI：10.1177 / 09500170211015067 ", "note_en": "Even so, writing in  Work, Employment and Society, the academics applaud its proponent, American anthropologist David Graeber, who died in September 2020, for highlighting the link between a sense of purpose in one’s job and psychological wellbeing.\n Graeber initially put forward the concept of ‘bullshit jobs’ – jobs that even those who do them view as worthless – in his 2013 essay The Democracy Project. He further expanded this theory in his 2018 book Bullshit Jobs: A Theory, looking at possible reasons for the existence of such jobs.\n Jobs that Graeber described as bullshit (BS) jobs range from doormen and receptionists to lobbyists and public relations specialists through to those in the legal profession, particularly corporate lawyers and legal consultants.\n Dr Magdalena Soffia from the University of Cambridge and the What Works Centre for Wellbeing, one of the authors of the article, said: “There’s something appealing about the bullshit jobs theory. The fact that many people have worked in such jobs at some point may explain why Graeber’s work resonates with so many people who can relate to the accounts he gives. But his theory is not based on any reliable empirical data, even though he puts forward several propositions, all of which are testable.”\n To test Graeber’s propositions, the researchers turned to the 2005–2015 European Working Conditions Surveys (EWCS), examining reasons that led to respondents answering ‘rarely’ or ‘never’ to the statement: ‘I have the feeling of doing useful work’. The surveys – taken in 2005, 2010 and 2015 – gather measures on the usefulness of the job, workers’ wellbeing and objective data on the quality of work. The number of respondents grew from over 21,000 in 2005 to almost 30,000 in 2015.\n According to Graeber, somewhere between 20% and 50% of the workforce – possibly as many as 60% - are employed in BS jobs. Yet the EWCS found that just 4.8% of EU workers said they did not feel they were doing useful work. The figure was slightly higher in the UK and Ireland, but still only 5.6% of workers.\n Graeber also claimed that the number of BS jobs has been ‘increasing rapidly in recent years’, despite presenting no empirical evidence. Again the researchers found no evidence to support this conjecture – in fact, the percentage of people in BS jobs fell from 7.8% in 2005 to just 4.8% in 2015 – exactly the opposite of Graeber’s prediction.\n His next hypothesis was that BS jobs are concentrated in particular professions, such as finance, law, administration and marketing, and largely absent in others, such as those linked to public services and manual labour. “Many service workers hate their jobs; but even those who do are aware that what they do does make some sort of meaningful difference in the world . . . [Whereas] we can only assume that any office worker who one might suspect secretly believes themselves to have a bullshit job does, indeed, believe this,” he wrote.\n When the researchers ranked the occupations by the proportion of people who rated their job as rarely or never useful, they found no evidence for the existence of occupations in which the majority of workers feel their work is not useful.\n The authors found that workers in some occupations, such as teachers and nurses, generally see themselves as doing useful jobs, while sales workers are above average in the proportion rating their job as not useful (7.7%). Even so, most of the results contradict Graeber’s assertion. For example, legal professionals and administration professionals are all low on this ranking, and jobs that Graeber rates as being examples of essential non-BS jobs, such as refuse collectors (9.7%) and cleaners and helpers (8.1%), are high on this scale.\n Not everything that Graeber suggested was wrong, however. He argued, for example, that BS jobs are a form of ‘spiritual violence’ that lead to anxiety, depression and misery among workers. The team found strong evidence between the perception of one’s job as useless and an individual’s psychological wellbeing, albeit a correlation rather than necessarily a causal link. In the UK in 2015, workers who felt their job was not useful scored significantly lower on the World Health Organisation Well-Being Index than those who felt they were doing useful work (a mean average of 49.3 compared with 64.5). There was a similar gap across other EU nations.\n Dr Alex Wood from the University of Birmingham said: “When we looked at readily-available data from a large cohort of people across Europe, it quickly became apparent to us that very few of the key propositions in Graeber’s theory can be sustained – and this is the case in every country we looked at, to varying degrees. But one of his most important propositions – that BS jobs are a form of ‘spiritual violence’ – does seem to be supported by the data.”\n Given that, in absolute terms, a substantial number of people do not view their jobs as useful, what then leads to this feeling? The team found that those individuals who felt respected and encouraged by management were less likely to report their work as useless. Conversely, when employees experience management that is disrespectful, inefficient or poor at giving feedback, they were less likely to perceive their work as useful.\n Similarly, individuals who saw their job as useful tended to be able to use their own ideas at work – an important element for feeling that your job provides you with the ability to make the most of your skills – was correlated with a perception of usefulness. There was a clear relationship between the extent to which people felt that they had enough time to do their job well and their rating of the usefulness of their job, suggesting that one source of feeling a job to be useless is the pace at which one is working, affecting the ability to realise one’s potential and capabilities. Other factors correlated with feeling that a job was worthwhile included support by managers and colleagues and the ability to influence important decisions and the direction of an organization.\n Professor Brendan Burchell from the University of Cambridge said: “Although the data doesn’t always support David Graeber’s claims, his insightful and imaginative work played an important role in raising awareness of the harms of useless jobs. He may have been way off the mark with regards how common BS jobs are, but he was right to link people’s attitudes towards their jobs to their psychological wellbeing, and this is something that employers – and society as a whole – should take seriously.\n “Most importantly, employees need to be respected and valued if they in turn are to value – and benefit psychologically as well as financially from – their jobs.”\n Reference Soffia, M, Wood, AJ and Burchell, B.  Alienation Is Not ‘Bullshit’: An Empirical Critique of Graeber’s Theory of BS Jobs. WES; 3 June 2021; DOI: 10.1177/09500170211015067", "posttime": "2021-06-19 21:17:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "无用,workers", "title": "二十名工人中的一个是“无用”的工作 - 远远少于以前的想法 ", "title_en": "One in twenty workers are in ‘useless’ jobs – far fewer than previously thought", "transed": 1, "url": "https://www.cam.ac.uk/research/news/one-in-twenty-workers-are-in-useless-jobs-far-fewer-than-previously-thought", "via": "", "real_tags": ["无用", "workers"]}, {"category": "", "categoryclass": "", "imagename": "7893b017bd80b993aafca720442764f8.png", "infoid": 1066877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "也许你想知道为什么我没有写过我通常的WWDC文章分享了我对主题演讲的观察。好吧，我的主要工作再次吸收了我的大部分时间和精力。但是，坦率地说，坦率地说，没有任何东西值得争夺争夺。\n 在所有Apple平台上，WWDC 2021，WWDC 2021介绍了很多好的东西，但总的来说，它觉得前往一家餐馆，为您提供体面的食物。你吃得好吗？你说是的。你吃得这么好，值得在线留下冗长的评论吗？并不真地。\n 如果我发现一个有趣的角度，我会写一些关于WWDC的东西，这是一个值得在事件结束后三到四周的有趣角度。\n  但是，真正值得一提的是苹果如何搞砸了整个甜点。\n 当然，甜点是Mac，当然，在称之为甜点时，我正在尝试给出一个尊重的，礼貌的标签到最后剩下的东西。处理它，我仍然是Mac用户，Mac平台仍然是我最关心的，所以我已经优先于其他一切。\n 近期由Pundits写了一波碎片，该款是现在说那些相信苹果的人并没有真正关心Mac的人错了。看，新的苹果硅芯片！外观，新硬件更新！甚至重新设计的MAC！哇，疯狂的东西确实。\n 为什么Mac OS留下了WWDC主题演讲？因为基本上，蒙特雷即将到来的一切都是最初设计用于iOS和iPadOS设备的功能，然后适用于Mac OS。和通用控制我称之为生态系统功能。对于我的回忆，没有任何内容，特别是利用MAC作为强大的多功能机器和平台。没有什么是专门设计的MAC。没有什么设计为MAC-First功能。 \n发生在Mac上的Safari的彻底用户界面Butchery再次将iOS的人员又一次。那些现在在iOS条款中思考的人。将Veneral Mac OS用户界面视为一个年长的人的人，其特质必须在整形手术后的整形手术，直到这个人看起来更年轻。不幸的是，效果更像是这个人最终看......奇怪。\n 这些人看着Mac的UI和（这是印象，至少）并不真正理解它。它的基础来自过去几乎似乎留下的过去。可用性提示和功能都皱纹。 iOS和iPados没有这些奇怪的皱纹，他们冥想。我们必须隐藏它们。我们将使这个壮观的整容造成这个壮观的整容，我们将逐个隐藏它们。 Mac OS将看起来像yoS的年轻（和愚蠢，咳嗽）！\n   新的野生动物园。图片©Apple，Inc。并从Mac OS Monterey Preview网页获取。\n 多年来，Safari的界面在极简主义和功能之间存在良好的平衡。 App Chrome被刮掉，迭代后迭代，似乎已达到其最低限度但仍然是可行的占地面积。\n 在我的11英寸MacBook Air（运行Mac OS 10.13高山脉和Safari 13.1.2），Safari标题栏/工具栏拍摄的总垂直空间，收藏夹BAR和TAB栏是86像素，64如果隐藏收藏夹吧。 11英寸MacBook Air的显示屏只有768像素，但即使在这些“狭窄”条件下也有足够的空间，以便在一个透明度和有意义的导航。特别是如果您隐藏了最受欢迎的栏并在全屏模式下使用Safari。\n 在我的13英寸视网膜MacBook Pro运行Mac OS Big Sur 11.5 Beta和Safari 14.1.2中，Safari标题栏/工具栏拍摄的总垂直空间，收藏夹BAR和TAB栏是110像素，82如果隐藏收藏栏栏。\n 在这两个情况下，标签栏拍摄的垂直空间是28像素。二十八。 \n我用所有这些像素偷窥的点是测量可以忽略不计。摆脱标签栏与您拯救空间的借口是我曾经曾经闻过的臭臭的废话。任何当前MAC显示器的28个像素都没有。\n  通过具有细牙梳的大苏尔的用户界面揭示了优先考虑功能的任意设计决策，因此反映了一种无论是用于无缝，周到的可用性的用户界面和可用性力学的无用机制愉快的MAC体验。\n 苹果已经为Safari 15做了什么并非不同。自从WWDC 2020这所诅咒的诸如Alan Dye（Apple的人类界面）的报价以来已经留下了我，并且大多数发生在Mac Os和Mac OS上发生的事情总是回到它：\n 我们降低了视觉复杂性，以保持对用户内容的关注。当您需要时，按钮和控件显示，当您没有时，它们会退缩。\n 我会重申这一点，直到我气喘吁吁：这不是正确的方法。或者至少，如果在界面的某些部分地区应用，它可能会有意义。 Safari 15发生的是，按钮和控制实际上已经在带有（··）图标的地毯下扫过，并且在您需要时不会出现 - 您必须查找它们。并且它没有任何意义，任何一个人想要去寻找一个小型菜单中的重新加载按钮，更多...图标。\n 什么比新的标签栏设计更常规？任何用户的两件事，无论他们的技术精明，还需要在浏览器中提供：\n 一个宽敞的地址栏，可以准确地查看它们的位置，它加载了哪个网页，整个URL。 \n一个适当的标签栏，具有尽可能多的水平空间，以便能够打开大量标签，并读取至少一小部分标题。\n （并且不，我认为只有书呆子一次只打开几十个浏览器选项卡。我在这么多场合和上下文中看到它，它不能只是轶事数据。）\n 他们在Safari 15做了什么？当然，它们合并了这两个浏览器栏，从而提供了两个世界的最糟糕：\n 一方面，当您创建更多选项卡时，地址栏会保持转换位置和更改宽度（意味着它会更短）。请打开你的常识，并考虑这是多么荒谬。\n 另一方面，现在，选项卡必须与同一行上的地址栏共存，它们具有更少的空间。意思是，在相对较小的13英寸显示器上，它可能足以打开只需六个标签，然后在狭窄的东西之前打开，标签文本被截断到无意义。\n 换句话说，浏览器需要的是水平呼吸室，相反，我们有苹果倒退，牺牲水平空间给我们给我们什么，28个垂直像素？似乎设计团队中的人们都专门在32英寸Apple XDR Pro显示屏上工作。\n 许多人也对Safari的App Chrome更改颜色的新功能也在发布否定，以获取当前加载的网站的重点颜色。 Michael Tsai说：将页面背景颜色放入选项卡区域，使其更加难以读取，并且当前页面的颜色感觉非常奇怪地影响其他标签外观的方式。它也不一致地工作，即使在Apple网站上的相同页面。至少有一个偏好改变它。我同意他的看法，但与其他徒步旅行者的UI屠宰相比，这是一个轻微的罪行。 \n顺便说一下，如果您认为这是一个原始功能，请参阅Vivaldi浏览器。当你在那里，看看Vivaldi如何解决'太多的标签'问题。扰流板：通过添加第二个选项卡栏。我说，为什么不。目前计算机上有足够的垂直空间。以及通常处理大量标签的用户优先考虑易于访问它们和标签易读的标签，而不是具有20个可用的20个垂直像素。\n 虽然我们在浏览器选项卡管理的主题时，Apple的提议解决方案 - 创建标签组 - 很少有效，整体上令人难以置信。一点实验：您目前打开多少浏览器标签？让我们保守。让我们说九。彼此之间有多少如此紧张，你可以将它们分组在一起？我打赌没有很少。除非您开始使用这种通用标签，否则您始终需要在每个组内检查，以查看您有哪些网站。\n 我目前有18个标签在我的主要Mac上打开勇敢。每个点到与任何其他不相关的网站，不能放在同一个标​​签或类别下。在日常浏览器中使用时，标签是一个凌乱的事情，这是一个杂乱的设计，并且用户通常很好。我们需要打开选项卡，我们需要看看始终打开了什么，我们需要能够快速跳转到我们需要的标签。在这种情况下，Pinning Tabs比对它们分组并隐藏起来更有用。您最受欢迎的网站在标签栏中有一个持久的位置。他们的标签减少以仅显示Favicons，因为你很了解它们，没有歧义。那真的。这种浏览方式不是寻找解决方案的问题，Apple。您有这么多的UI问题来修复，而是通过“彻底改变”Safari来添加更多更多。停止 - 隐藏 -  UI  - 元素 - 任意！\n 我非常希望Safari中的新UI可以通过浏览器首选项中的一些切换来中和。但我也希望这个思想的UI不会向勇敢，Firefox和其他浏览器的设计师提供奇怪的想法。顺便说一下，我真的很喜欢Vivaldi。其用户界面可能变得非常复杂，但开发人员和设计师已经开放了足以让用户提供大量的灵活性，以便您可以真正为您的需求定制VivalDi。\n 我也非常喜欢另一个浏览器，我一直在测试了很长一段时间，我希望很快就会详细说明。 ", "note_en": "Maybe you’ve wondered why I haven’t written my usual post-WWDC article sharing my observations about the keynote. Well, once again my main job absorbed most of my time and energies. But also, frankly, there hasn’t been anything extraordinarily good worth scrambling to write down.\n Don’t get me wrong, plenty of nice things have been introduced at WWDC 2021 across all Apple platforms, but overall it felt like going to a nice restaurant serving you decent food. Did you eat well? You’d say yes. Did you eat  so well it’s worth leaving a lengthy review online? Not really.\n I  will write something about WWDC, if I find an interesting-enough angle that’s worth writing about three or four weeks after the event.\n  What’s really worth mentioning, though, is how Apple has screwed up the whole dessert.\n The dessert is the Mac, of course, and in calling it a dessert I’m trying to give a respectable, polite label to something that was left for last. Deal with it, I’m still a Mac user first, the Mac platform is still the one I care most, so I’m giving it precedence over everything else.\n There has been a wave of pieces written in recent times by pundits who now say that those who believed Apple did not really care about the Mac were wrong. Look, the new Apple Silicon chips! Look, new hardware updates! Even redesigned Macs! Whoa, crazy stuff indeed.\n Why was Mac OS left for last at the WWDC keynote? Because essentially, everything new that’s coming in Monterey are features originally devised for iOS and iPadOS devices, and then adapted for Mac OS. And Universal Control I’d call an ecosystem feature. Nothing, to my recollection, was conceived specifically to take advantage of the Mac as a powerful, versatile machine and platform. Nothing was designed specifically with the Mac in mind. Nothing was designed as a Mac-first feature.\n The utter user-interface butchery happening to Safari on the Mac is once again the work of people who put iOS first. People who by now  think in iOS terms. People who view the venerable Mac OS user interface as an older person whose traits must be experimented upon, plastic surgery after plastic surgery, until this person looks younger. Unfortunately the effect is more like this person ends up looking… weird.\n These people look at the Mac’s UI and (that’s the impression, at least) don’t really understand it. Its foundations come from a past that almost seems inscrutable to them. Usability cues and features are all wrinkles to them. iOS and iPadOS don’t have these strange wrinkles, they muse. We must hide them. We’ll make this spectacular facelift and we’ll hide them, one by one. Mac OS will look as young (and foolish,  cough) as iOS!\n   The new Safari. Image © Apple, Inc. and taken from the  Mac OS Monterey Preview webpage.\n For years, Safari’s interface has been a good balance between minimalism and functionality. The app chrome was shaved away, iteration after iteration, and it seemed it had reached its minimum but still viable footprint.\n On my 11-inch MacBook Air (running Mac OS 10.13 High Sierra and Safari 13.1.2), the total vertical space taken by Safari’s Title bar/Toolbar, Favourites bar and Tab bar is 86 pixels, 64 if you hide the Favourites bar. The 11-inch MacBook Air’s display is only 768 pixels tall, but even in these ‘cramped’ conditions there’s still enough space left to a website for clarity and meaningful navigation. Especially if you hide the Favourites bar and use Safari in full-screen mode.\n On my 13-inch retina MacBook Pro running Mac OS Big Sur 11.5 beta and Safari 14.1.2, the total vertical space taken by Safari’s Title bar/Toolbar, Favourites bar and Tab bar is 110 pixels, 82 if you hide the Favourites bar.\n In both instances, the vertical space taken by the Tab bar is 28 pixel. Twenty-eight.\n The point I’m making with all this pixel peeping is that these are  negligible measurements. Getting rid of the Tab bar with the excuse that you’re saving space is the stinkiest bullshit I’ve ever smelt in a while. 28 pixels for any of the current Mac displays is nothing.\n  Going through Big Sur’s user interface with a fine-tooth comb reveals arbitrary design decisions that prioritise looks over function, and therefore reflect an un-learning of tried-and-true user interface and usability mechanics that used to make for a seamless, thoughtful, enjoyable Mac experience.\n What Apple has done to Safari 15 is no different. Ever since WWDC 2020 this damned quote by Alan Dye (Apple’s VP of Human Interface) has stayed with me, and most of what’s happening on Mac OS and to Mac OS always comes back to it:\n We’ve reduced visual complexity to keep the focus on users’ content. Buttons and controls appear when you need them, and they recede when you don’t.\n I’ll reiterate this until I’m out of breath: it’s not the right approach. Or at least, it  could make sense if applied thoughtfully in certain parts of the interface. What’s going on in Safari 15 is that buttons and controls have actually been swept under a rug with an (···) icon, and they don’t appear when you need them — you have to look for them. And it makes  no sense whatsoever that one would want to go looking for the  Reload button in a tiny menu with a  More… icon.\n And what’s more arbitrary than the new Tab bar design? Two things  any user, no matter their tech-savviness, has needed in a browser:\n A wide Address bar to see exactly where they are, which webpage it’s loaded, the whole URL.\n A proper Tab bar, with as much horizontal space as possible, to be able to open a lot of tabs and read at least a small part of their titles.\n (And no, I don’t think that only nerds open dozens of browser tabs at a time. I’ve seen it firsthand in so many occasions and contexts that it can’t be just anecdotal data.)\n And what have they done in Safari 15? They merged these two browser bars, of course, thus delivering the worst of both worlds:\n On the one hand, the Address bar keeps  shifting position and  changing width (meaning it gets shorter) as you create more tabs. Please, turn on your common sense, and consider how ridiculous this is.\n On the other hand, now that tabs have to coexist with the Address bar on the same line, they have less space. Meaning that on a relatively small 13-inch display, it’s probably enough to open just six tabs before things get cramped and tab text gets truncated to meaninglessness.\n In other words, what a browser needs is  horizontal breathing room, instead we have Apple doing things backwards, sacrificing horizontal space to give us what, 28 more vertical pixels? It seems as if the people in the design team are all working exclusively on 32-inch Apple XDR Pro Displays.\n Many people are also commenting negatively about the new feature where Safari’s app chrome changes colour by taking the accent colour of the currently loaded website.  Michael Tsai says:  Having the page background color bleed into the tab area makes it harder to read, and it feels weird for the current page’s color to affect the way  other tabs look. It also works inconsistently, even on the same pages on Apple’s site. At least there’s a preference to turn it off. And I agree with him, but this is a minor offence compared with the rest of Safari’s UI butchery.\n By the way, in case you thought it was an original feature, go have a look at  Vivaldi browser. While you’re there, take a look at  how Vivaldi tackles the ‘too many tabs’ problem. Spoiler: by  adding a second Tab bar. And I say, why not. There’s enough vertical space on current computers. And those users who usually deal with a lot of tabs prioritise having easy access to them and tab legibility, not having 20 more vertical pixels available.\n While we’re on the subject of browser tab management, Apple’s proposed solution — creating groups of tabs — is rarely efficient and overall unconvincing. A little experiment: how many browser tabs do you have currently open? Let’s be conservative. Let’s say nine. How many are so tightly related among one another that you can meaningfully group them together? I bet none to very few. Unless you maybe start using such generic labels that you always need to check inside each group to see which sites you have there.\n I have currently 18 tabs open in Brave on my main Mac. Each points to a website that is not related to any other and can’t be put under the same label or category. In everyday browser use, tabs are a messy affair that is kind of messy by design and users are generally fine with it. We need open tabs, we need to see what’s open at all times, and we need to be able to quickly jump to the tab we need in the here and now. In this scenario, pinning tabs is much more useful than grouping them and hiding them away. Your most visited sites have a persistent place in the Tab bar. Their tabs are reduced to show only the favicons because you know them well and there’s no ambiguity. And that’s really it. This way of browsing is not a problem in search of a solution, Apple. You have so many more UI issues to fix, instead you add some more by ‘revolutionising’ Safari.  Stop — hiding — UI — elements — arbitrarily!\n I dearly hope the new UI in Safari can be neutralised by some toggles in the browser preferences. But I also hope this thoughtless UI won’t give strange ideas to the designers of Brave, Firefox, and other browsers. I’m really liking Vivaldi at the moment, by the way. Its user interface can become quite complex, but the developers and designers have been open enough to give the user a great deal of flexibility, so that you can truly customise Vivaldi to your needs.\n I’m also really liking another browser I’ve been beta testing for quite a while, about which I’ll hopefully talk in more detail soon.", "posttime": "2021-06-19 21:10:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mac,os,标签", "title": "在Mac OS上的Safari 15，用户界面混乱 ", "title_en": "Safari 15 on Mac OS, a user interface mess", "transed": 1, "url": "https://morrick.me/archives/9368", "via": "", "real_tags": ["mac", "os", "标签"]}]