[{"category": "", "categoryclass": "", "imagename": "aad1ef4a9a5d3da1d58dc4137c15a9db.jpg", "infoid": 1012902, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一项新的研究，使用纤维捕捉装置作为洗衣过程的一部分，可以极大地减少潜在进入海洋环境的微小颗粒物的数量。普利茅斯大学进行的一项研究比较了六种不同设备的效率，范围从原型到商用产品。\n最成功的一次将排放到废水中的纤维数量减少了近80%，这表明它们有相当大的环境效益潜力。\n然而，来自该大学国际海洋垃圾研究单位的研究人员在“总环境科学”杂志上撰文称，它们只会是任何解决方案的一部分。\n该大学最近的一项研究显示，穿衣服时的正常损耗与洗涤时释放出来的微塑料一样重要，而2020年5月为Defra制作的一份报告强调，在洗衣机上安装过滤器可能不如改变面料设计来减少纤维损失。\n因此，目前这项研究的作者表示，科学家们需要与产业界和政策制定者合作，以确保从设计阶段到衣物洗涤方式的改进。\n研究员、国家地理探险家伊莫金·纳珀博士是一名天空海洋救援学者，也是这项研究的主要作者，他说：衣服上的纤维是微塑料的主要来源之一，公司正在发明方法，声称可以减少进入废水中的纤维数量。我们想看看它们在捕捉纤维方面有多有效，但也想从一开始就阻止衣服脱落。我们的结果显示，可用的设备种类繁多，有些设备显著减少了纤维的释放量。\n在这项研究中，科学家们洗涤了三种不同类型的合成纤维织物(100%涤纶、100%丙烯酸和60%涤纶/40%棉混纺)，以代表典型的混合负荷。\n他们使用一个网来捕获进入废水的纤维，测量没有过滤器产生的颗粒物的质量，然后用三个滚筒内设备和三个外部洗衣机过滤器。\n结果显示最有效的减少了78%的微纤维的释放，而在这项特殊的研究中分析的最不有效的减少了21%的微纤维的释放。\n理查德·汤普森(Richard Thompson)教授是这项研究的合著者，他是国际海洋垃圾研究小组的负责人。近年来，他为英国政府的时尚业可持续性调查和最近的经合组织关于服装和鞋类行业尽职调查的论坛提供了证据。他补充说：太多时候，追求快速时尚和市场压力意味着适当的环境考虑正在被牺牲。如果我们要实现广泛和持久的变化，科学家必须提供独立的证据，证明问题的规模以及任何潜在的解决方案。我们测试的一些设备无疑可以减少洗衣过程中产生的纤维，但也许最重要的变化将是设计更耐用的服装，从一开始就减少纤维脱落。更多信息：Imogen E.Napper等人，旨在减少洗衣过程中微纤维释放的设备的效率，总体环境科学(2020)。Doi：10.1016/j.scittenv.2020.140412", "note_en": "Using fiber-catching devices as part of the laundry process can dramatically reduce the amount of microscopic particles potentially entering the marine environment, according to new research.    A study conducted at the University of Plymouth compared the efficiency of six different devices, ranging from prototypes to commercially available products.\n  The most successful reduced the amount of fibers released into wastewater by almost 80%, suggesting there is considerable potential for them to have environmental benefits.\n  However, writing in  Science of the Total Environment, researchers from the University&#39;s International Marine Litter Research Unit say they will only ever be part of any solution.\n  A recent study at the University showed normal wear and tear when wearing clothes is just as significant a source of microplastics as release from laundering, while a report produced for Defra in May 2020 highlighted that fitting filters to washing machines could be less effective than changing fabric designs to reduce fiber loss.\n  As such, the current study&#39;s authors say there is an ongoing need for scientists to collaborate with industry and policy makers to ensure improvements are made right from the design phase through to how clothes are washed.\n     Research Fellow and National Geographic Explorer Dr. Imogen Napper, a Sky Ocean Rescue Scholar and the study&#39;s lead author, said: &#34;Fibers from clothing are among the key sources of microplastics, and companies are inventing ways which claim to reduce the amount of fibers which enter wastewater. We wanted to see how effective they were both in catching fibers, but also stopping clothes from shedding them in the first place. Our results show there is a huge variety between the devices available, with some significantly reducing the number of fibers released.&#34;\n  For the research, scientists washed three different synthetic fabric types (100% polyester, 100% acrylic, and a 60% polyester/40% cotton blend) to represent a typical mixed load.\n  They used a mesh to capture fibers entering wastewater, measuring the mass of particles generated without filters and then with three in-drum devices and three external washing machine filters.\n   The results showed the most effective   reduced the quantity of microfibres being released by 78%, while the least effective analysed in this particular study reducing it by 21%.\n    Professor Richard Thompson OBE, Head of the International Marine Litter Research Unit, was co- author on the study. In recent years, he has given evidence to both the UK Government&#39;s Sustainability of the Fashion Industry inquiry and the recent OECD Forum on due diligence in the garment and footwear sector. He added: &#34;Too often, the quest for fast fashion and market pressures means that appropriate environmental considerations are being sacrificed. If we are to achieve widespread and lasting change, it is essential for scientists to provide the independent evidence that demonstrates the scale of the problem as well as any potential solutions. Some of the devices we tested can undoubtedly reduce the fibers generated through the laundry process, but perhaps the most overarching change would be to design garments to last longer and shed less fibers in the first place.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tImogen E. Napper et al, The efficiency of devices intended to reduce microfibre release during clothes washing,  Science of The Total Environment (2020).  DOI: 10.1016/j.scitotenv.2020.140412", "posttime": "2020-07-20 00:52:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "洗衣,reduce,纤维", "title": "设备可以将洗衣周期中产生的纤维减少高达80%", "title_en": "Devices can reduce fibers produced in laundry cycle by up to 80%", "transed": 1, "url": "https://phys.org/news/2020-07-devices-fibers-laundry.html", "via": "", "real_tags": ["洗衣", "reduce", "纤维"]}, {"category": "", "categoryclass": "", "imagename": "63e7411ba6072a4b92e54c9943f84d87.jpg", "infoid": 1012900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是开放式课程上2200多门课程中的一门。在左侧链接的页面中查找本课程的材料。\n麻省理工学院开放式课程软件是一个免费开放的出版物，内容来自数千门麻省理工学院的课程，涵盖整个麻省理工学院的课程。\n没有注册或注册。自由浏览和使用开放式课程的材料，您可以按照自己的节奏。没有注册，也没有开始或结束日期。\n知识是你的回报。用开放式课程指导自己的终身学习，或者教给别人。我们不提供使用开放式课程的学分或认证。\n为分享而生。下载文件以备以后使用。发送给朋友和同事。修改、混合和重用(只需记住引用OCW作为源代码)。", "note_en": "This is one of over 2,200 courses on OCW. Find materials for this course in the pages linked along the left.\n  MIT OpenCourseWare is a free &amp; open publication of material from thousands of MIT courses, covering the entire MIT curriculum.\n  No enrollment or registration. Freely browse and use OCW materials at your own pace. There&#39;s no signup, and no start or end dates.\n  Knowledge is your reward. Use OCW to guide your own life-long learning, or to teach others. We don&#39;t offer credit or certification for using OCW.\n  Made for sharing. Download files for later. Send to friends and colleagues. Modify, remix, and reuse (just remember to cite OCW as the source.)", "posttime": "2020-07-20 00:30:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开放式,ocw,课程", "title": "麻省理工学院开放式课程：申请统计(2016)", "title_en": "MIT OCW: Statistics for Applications (2016)", "transed": 1, "url": "https://ocw.mit.edu/courses/mathematics/18-650-statistics-for-applications-fall-2016/lecture-slides/", "via": "", "real_tags": ["开放式", "ocw", "课程"]}, {"category": "", "categoryclass": "", "imagename": "e127bbc2726c5bd4a9c3784f39305895.jpeg", "infoid": 1012899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "互联网在其初级阶段感觉到了深深的解放。它让信息变得容易获取，为人际关系创造了前所未有的机会，并为我们的个人体验提供了更丰富的背景。\n原始互联网的精神，在其用户中，是充满希望和开放的。然而，同样的生态系统已经被渴求利润的巨头们所利用，他们在自己的行业内建立了一种压迫文化，并在我们的世界里与平等作斗争。\n互联网--美丽而不可预测--怎么会如此轻易地变成了一个充满锁和笼子的地方呢？它是如何从一个充斥着科学家和制造者建造他们的智力和艺术家园的平台变成一个由更有兴趣获取财富的组织主导的平台？建立在这个平台之上的科技行业是如何成为种族主义和性别歧视的温床的？\n我们今天在科技行业面临的问题-我们隐私权的丧失，数据所有权的缺乏，以及颠覆自由和民主的科技产品和服务的激增-源于以价值提取、不平等和非人性化为基础的经济体系。\n它使主导科技行业的科技公司成为变革的反对者，这些变革可能有助于赋予工人权力，使世界变得更加公平。\n一如既往，我们看到，在承诺建立一个更加开放和公平的世界的基础上建立起来的科技行业阻碍了这一目标的实现。\n与科技公司合作影响这些法律实施的一大批权势强大的公司律师，往往会让至关重要的劳动法变得软弱无力，从而确保了保护客户利益的空间。\n有正当不满的员工经常受到欺凌或报复。特别是在科技行业，即使雇主在工作场所从事非法行为，人们也有一种深刻而合理的恐惧，担心会因为反击而失去工作。\n例如，在2019年7月的一次女性创始人基金会议上，一位女性CEO(由于该活动的隐私规定，她将不具名)在一次关于招聘的表格讨论中表示，她不会雇佣一名起诉前雇主歧视或性骚扰的女性，因为对她来说，作为所有者来说风险太大了。如果一个历来被硅谷拒之门外的群体中的一名成员不想雇佣那些直言不讳地反对不公正的人，这说明了一个行业的文化是什么呢？\n这还不是全部。许多人们认为牢不可破的保护，以及我们社会契约的一部分，在科技行业不断遭到破坏或炫耀，而同样是这些科技公司却在兜售一个营销神话--它们关心的是它们正在伤害的空间和人。\n埃隆·马斯克的两家公司，SpaceX和特斯拉，都藐视环境和劳工法规，试图殖民火星，销售电动汽车，同时还喋喋不休地谈论气候变化和环境资源。如果一个人或一个公司不能抽出时间来关心他们的社区和星球，是什么让我们认为他们会关心新的社区和新的星球呢？特斯拉和SpaceX并不是唯一家推土机实现增长的公司。\n在优步走下坡路之前，他们的整个全球扩张战略都建立在陈词滥调的基础上，即请求原谅，而不是请求许可。为此，他们广为人知的、经常是毋庸置疑的做法包括避开监管机构，欺负竞争对手，虐待司机，以征服一座新城市。\n优步不仅扰乱了蓝领移民和试图攀登经济阶梯的有色人种的生命线现有模式，而且还一再将乘客置于危险之中，而且毫无悔意。\n市政府早在2010年就反对优步，但随着无限的风险资本资源触手可及，政策和沟通团队编造故事来影响公众舆论和地方监管机构，城市很难追究优步的责任。\n只有内部人士才能说出真相。2017年，当苏珊·福勒(Susan Fowler)写了一篇关于公司性骚扰和歧视的公开帖子时，所有内部的腐烂都渗出了出来。苏珊·福勒是一位勇敢的女性开发者，从来没有人听说过她的名字。\n科技公司不断将请求原谅而不是许可作为其增长战略的基础，这并不令人意外，如果这能让投资者和创始人有利可图地退出，他们就会继续使用它。特别是在监管者几乎没有尝试控制它们的情况下。\n该行业的文化必须改变，以使他们建立的技术能够变得更好。\n尽管最近员工爆料和发声的现象激增，但监管机构在很大程度上保持了对科技行业监管的不插手做法。科技公司利用民选官员缺乏技术知识和轻而易举地支付联邦贸易委员会的小额罚款来获利，这使得国会很难设计和推进有效的问责措施和法律。\n科技公司也投入巨资进行游说，以确保不会通过要求它们遵守的新法律。2010年至2019年间，Facebook花费了8100万美元，仅在2019年，亚马逊就花费了1600万美元，谷歌在过去十年里花费了超过1.5亿美元，游说联邦、州和地方政府零监管，利润率不断扩大。即使Facebook允许煽动种族灭绝，操纵选举，谷歌将用户的个人信息暴露在互联网上，国会仍然没有通过新的法律来监管他们。\n科技员工一直对他们的公司缺乏道德保持沉默，已经改变了职业生涯，试图私下解决困扰他们以前行业的问题，而一些人，其中一些享有特权，已经讲述了他们的故事，要求追究责任。科技充斥着的基于战争的战略、经常性的滥用和鼓励的贪婪，使得个人很难有效地站起来，特别是在美国，那里几乎没有公共资源或结构来支持和保护我们。尽管如此，一场翻天覆地的变化正在发生。\n科技领袖因人权和种族平等问题公开辞职，公开拒绝建造造成伤害的产品或结构。其他员工，损失更大，正在选择不确定性，而不是继续为一家他们认为不道德的公司工作。\n今天，科技公司文化看起来很像执法文化-它们都要求完全忠诚，在自己的系统中建立广泛的不透明，创建基于恐惧的监控结构，并随意使用手铐，无论是黄金手铐还是其他手铐。但是，就像公共安全可以从根本上重新想象一样，我们建立的技术也可以。\n人们冒着巨大的个人风险持续在街上游行，有效地推动了对话超越警察改革，转向更大的改革，如取消对警察的资助。\n正如上周五去世的民权领袖、国会议员约翰·刘易斯(John Lewis)所说，这带来了巨大的变化，迫使我们的民选官员更新议程并修改法律，以保护自由和人权。科技员工应该自己挑起一些好麻烦，参与有组织的、持续的行动，为他们的部门争取解放和平等。\n玛丽·里纳尔迪(Mary Rinaldi)是一位社会正义倡导者，一位创意技术专家和作家，也是New Inc.的常驻导师。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "The internet in its infancy felt deeply liberating. It made information accessible, created opportunities for relationships that hadn&#39;t existed before, and provided richer context for our individual experiences.\n The ethos of the original internet, among its users, was hopeful and open. Yet, that same ecosystem has been co-opted by profit-hungry giants who have built a culture of oppression within their industry and fought against equality in our world.\n How did the internet — beautiful and unpredictable — so easily become a place of locks and cages? How did it change from a platform filled with scientists and makers building their intellectual and artistic homes to one dominated by organizations more interested in extracting wealth? How did the tech industry built on top of that platform  become a hotbed of racism and  sexism?\n    The problems we face in the technology industry today — the  loss of our right to privacy, a  lack of data ownership, and the proliferation of tech products and services that  subvert freedom and democracy — stem from an economic system that is predicated on value extraction, inequality, and dehumanization.\n And it makes the tech companies who dominate the tech industry the opponents of changes that could help empower workers and make the world a more equitable place.\n  Consistently, we&#39;ve seen the tech industry that was built with the promise of a more open and equitable world stand in the way of achieving that goal.\n Vital labor laws are often rendered toothless by armies of high-powered corporate attorneys who work with tech companies to  influence the implementation of those laws, ensuring room for protection of their clients&#39; interests.\n   Employees with valid grievances are often  bullied or  retaliated against. Particularly in tech, there is a deep and valid fear of becoming unemployable for fighting back, even if the employer has engaged in  illegal behavior in the workplace.\n For example, during a table discussion on hiring at a Female Founders Fund Conference in July 2019, a female CEO (who will remain unnamed due to the privacy rules of the event) commented that she wouldn&#39;t hire a woman who brought a suit against a former employer for discrimination or sexual harassment, because it would be &#34;too risky&#34; for her as an owner. What does it say about the culture of an industry if even a member of a group that has historically been denied entry into Silicon Valley doesn&#39;t want to hire people who speak up against injustice?\n That&#39;s not all. Many of the protections that people believe are impenetrable and a part of our social contract are consistently undermined or flaunted in the tech industry, while the very same tech companies sell a marketing myth — that they care about the spaces and people they&#39;re harming.\n Both Elon Musk&#39;s companies, SpaceX and Tesla, have flouted  environmental and  labor regulations in their pursuit to colonize Mars and sell electric cars, while waxing on about climate change and environmental resources. If a person or company can&#39;t take the time to care for their community and planet, what makes us think they&#39;ll care for new community and new planet? And Tesla and SpaceX are not alone in their bulldozing approach to growth.\n   Before Uber&#39;s fall from grace, they built their entire global expansion strategy on the platitude, &#34;ask for forgiveness, not permission.&#34; To that end, their  well-publicized, often  unquestioned approach included sidestepping regulators, bullying competitors, and mistreating drivers in order to conquer a new city.\n Not only did Uber disrupt existing models that were the lifeblood for blue collar immigrants and people of color trying to climb the economic ladder, but  they put riders in danger repeatedly and without remorse.\n City governments  opposed Uber as early as 2010, but with the infinite resources of venture capital at their fingertips, and policy and communications teams spinning stories to influence public opinion and local regulators, cities struggled to hold Uber accountable.\n It took someone on the inside to tell the truth. In 2017 when Susan Fowler, a courageous woman developer whom no one had ever heard of,  wrote a public post about the sexual harassment and discrimination at the company then  all the rot on the inside came oozing out.\n   It&#39;s not a surprise that tech companies keep utilizing &#34;I&#39;d rather ask for forgiveness than permission&#34; as the basis for their growth strategy, if it gets investors and founders to a profitable exit, they&#39;ll keep using it. Especially since regulators have made few attempts to rein them in.\n The culture of the industry has to change to that the tech they build can become better\n Even with a recent proliferation of employees whistleblowing and speaking up, regulators have largely maintained a hands-off approach to tech industry oversight. Tech companies capitalize on elected officials&#39; lack of technical knowledge and bank on easily  paying minor FTC fines, making it difficult for Congress to design and advance effective accountability measures and laws.\n Tech companies have also invested heavily in lobbying to ensure new laws aren&#39;t passed that would require their compliance. Between 2010 and 2019, Facebook spent $81 million, in 2019 alone Amazon spent $16 million, and Google spent over $150 million over the decade lobbying federal, state and local government for zero oversight and ever-expanding profit margins. Even after Facebook  allowed the incitement of a  genocide,  manipulated elections, and Google  exposed users&#39; personal information on the internet, Congress still has not adopted new laws to regulate them.\n Tech employees have remained silent about the lack of morality their companies practice, have changed careers attempting to reckon in a private with the problems that plague their former industry, while a few, some privileged, have told their stories, demanding accountability. The war-based strategies, regular abuse and encouraged greed that tech is rife with makes it difficult for individuals to stand up effectively, especially here in the US, where there are few public resources or structures to support and protect us. In spite of that, a sea change is happening.\n   Tech leaders are publicly resigning  over human rights and  racial equity issues, publicly refusing to build products or structures that cause harm. Other employees, with much more to lose, are  choosing uncertainty over continuing to work for a company they believe is unethical.\n Today, tech company culture looks a lot like law enforcement culture — they both demand complete loyalty, institute widespread opacity in their systems, create fear-based surveillance structures, and use handcuffs liberally, golden or otherwise. But just as public safety can be radically reimagined, so can the technologies we build.\n People continuously marching in the streets, at great personal risk have effectively pushed the conversation beyond police reform towards bigger changes like defunding the police.\n This &#34;good trouble&#34; as John Lewis,  the Civil Rights leader and congressman  who died on Friday, called it, drives big change, forcing our elected officials to update agendas and change laws to protect freedom and human rights. Tech employees should stir up some good trouble themselves, engaging in organized, sustained action that reclaims their sector for liberation and equality.\n   Mary Rinaldi is a social justice advocate, a creative technologist and writer who is a Mentor-in-Residence at NEW INC.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-20 00:08:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "压迫,industry", "title": "科技产业本应帮助世界变得更加自由，但它却变成了压迫的工具。", "title_en": "The tech industry was supposed to help make the world more free, but instead it has turned into a tool of oppression", "transed": 1, "url": "https://www.businessinsider.com/tech-companies-silicon-valley-hurting-democracy-justice-labor-rights-2020-7", "via": "", "real_tags": ["压迫", "industry"]}, {"category": "", "categoryclass": "", "imagename": "2aec1dbcce93d427bb57b8d48387ee2d.jpg", "infoid": 1012898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我远程工作已经有很多年了，但老实说：现在很多人都是这样。最近，我一直在努力提升我的家庭办公室的外观，特别是在视频会议功能方面。我开始用单反作为我的网络摄像头，配上环形灯和可调暗的房间灯。做完基础工作后，我下一步想做的就是在办公室的每个书架下面安装LED灯条，以改善办公室的背景。\n如果你看过YouTube或Twitch Streamers，你可能已经注意到它们背后有有趣的背景，通常架子上或角落里都有彩色LED灯。我的新家庭办公室有一堆内置的浮动架子，我想它会是安装LED条的完美位置。\nLED令人惊叹。它们非常明亮，而且耗电量也很低。现代技术几乎把它们融入到了所有东西中，这使得灯条的价格低得离谱。你在上面照片中看到的我的最终产品，45英尺(15米)的光线总共花费了大约100美元，包括一个硬连线的控制器，所有的线路和电源。\n首先要注意的是：你可以买到很棒的预制消费级LED灯条，这种灯条带有遥控器，可以由你的手机控制，而且相对便宜。就我个人而言，我已经买了几个Govee灯条，像这个长的，它们对于简单的应用非常有用，比如放在架子上，或者在门卡上，或者放在皇冠上。对于大多数人90%的需求来说，这是最好也是最简单的方法。\n因为我有六个架子，所以我不想管理六个插头，所以我在这里描述的是完全DIY路线，切断你的LED条，使用焊枪，创造出你的空间所需的精确灯光。我是这么做的。\n本视频对LED灯条的所有选项进行了精彩的概述，但长话短说的是，WS2812B是简单的、可单独寻址的LED灯串的标准名称。我买的没有防水(因为它们是在室内使用的)，我买了30像素/米的密度，以保持较低的电力需求。通常情况下，6英尺(2米)的售价约为10美元，16英尺(5米)的售价约为20美元。它们在eBay、亚马逊和阿里快递(Aliexpress)上随处可见(这是最便宜的，但可能需要最长的时间才能到达)。\n灯条有一个简单的粘性背衬来安装在东西下面，但我额外买了一些专为LED设计的铝通道，它还附带了一个有助于分散光线的漫射板。你把它们拧进什么东西里，把你的LED条插进去，然后扣上外面的散光片，以便进行更持久的安装。\n我也完成了我的安装，将这个护角放在灯的前面，既隐藏了铝条，又进一步分散了上面三个货架上的光线。它给人一种很好的向下发光的效果。\n你的灯将由一个装有WiFi适配器的微型计算机芯片控制，而你想要的是NodeMCU ESP8266。最棒的是，它们每个只要三四美元，我在亚马逊买了这套三件套，以防我在路上烤了一件。下载WLED软件并将其刷新到您的NodeMCU，然后将其配置到您的WiFi网络。所有这一切都在这个逐步视频中涵盖，以构建您的第一个灯条。如果你买了你需要的东西，只需密切遵循ZZ博士的指导，让它们都能正常工作(我就是这么做的)。\n上面的视频还涉及到如何为LED选择电源的数学问题。我的条带总共有400个LED，所以我需要一个相当大的电源。我买了这个30安培的型号，它没有风扇，运行起来很酷。我第一次买的是一个60安培的电源，有一个巨大的风扇，但当你插上电源时，它听起来像个吹风机，我建议只在户外使用。\n我使用基本的红/黑线在每个条带的末端掉电。我用一些LED线把它们全部连接回控制器。我使用了这些特别制作的连接器，它们完美地贴合了我的LED条，避免了大量的焊接。我还使用了这些T型连接器来连接额外的电源，同时减少了所需的焊接量。需要一组跳线将NodeMCU快速连接到电源。\n下载并安装适用于您手机的WLED应用程序，经过一些配置后，您应该能够控制您的灯光(不要忘记输入您拥有的LED的确切数量，并使用您的LED首选项)。只需转到控制器的内部IP地址，您也可以从桌面Web浏览器控制它们。\nWLED是相当不可思议的，因为它已经内置了几百种不同的图案，你只需选择它们就可以让你的灯运行复杂的图案。我自定义了我的设置，将每个书架的条带分割成各自的部分，这样就可以在每个书架上同时产生程控灯光效果。\n我还通过使用WLED家桥插件将灯条添加到Homekit控件中，这样我就可以在屋内或屋外的手机上关闭或打开它们，并将其作为例行公事的一部分。目前，我正在开发一款iOS快捷方式，每当我将AirPods连接到笔记本电脑时(也就是我即将参加Zoom会议的时候)，它会自动调暗我房间的色调灯，并打开LED条。\n为了完成我办公室的外观，我增加了一台三星相框55英寸的电视，我每天早上打开它，展示三星的艺术版画，我经常把它们轮换出来。边框电视相当令人难以置信，屏幕采用哑光处理，在肉眼看来确实像一幅画，尽管在拍摄时，它往往会夸大亮度，使其看起来更像一台明亮的电视。如果我的起居室壁炉架上有一台电视，我绝对会买一台，因为当你不看电视的时候，它看起来很棒。\n这里还有几张我安装的LED的照片，以及我在Zoom会议上的样子(周六，穿着扎染衬衫)。\n我已经把LED设置成我放慢了速度的彩虹程序，在我开会的背景下，它们会轻轻地改变。\n同样，如果你有一个简单的设置，只需使用现成的选项，如Govee灯，但如果你想要完全定制，LED条是一种有趣而廉价的方式来为你的环境增加一些颜色。\n(如果你想知道，那不是一把真正的Eames椅子，这是我在Aliexpress上花500美元买的一把不错的仿制品，胶合板/皮椅是Aliexpress花150美元买的另一款著名的仿制品，它们主要是用来看书的，或者给客人提供一个坐下的地方。)", "note_en": "I work remotely and have for many years, but let’s be honest: it’s the case for a lot of people now. Lately I’ve been trying to step up how my home office looks, especially with regards to its video conferencing capabilities.  I started using a DSLR as my webcam along with a ring light and dimmable room lights. With the basics out of the way, I next wanted to work on my office’s background by installing LED light strips below each my office’s bookshelves.\n  If you’ve watched YouTube or Twitch streamers, you might have noticed they have interesting backgrounds behind them, often with colored LED lighting on shelves or in corners. My new home office has a bunch of built-in floating shelves and I thought it’d be a perfect place to install LED strips.\n  LEDs are amazing. They’re incredibly bright while also using low power. Modern technology has incorporated them into almost everything and that’s driven the price for light strips ridiculously low. What you see in my final product in the photo above cost about $100 total for 45 feet (15m) of light, including a hard-wired controller, all the wiring, and the power supply.\n BIG NOTE UP FRONT: You can buy great pre-built, consumer grade LED light strips that come with a remote control, can be controlled by your phone, and are relatively cheap. Personally, I’ve purchased  a few Govee light strips like this long one and they work great for simple applications like on a shelf, or around a door jam, or up on a crown molding. For 90% of most people’s needs, that’s the best and easiest way to go.\n Since I had six shelves, I didn’t want to have to manage six plugs, so what I’m describing here is going the full-on DIY route, cutting your LED strips up, using a solder gun, and creating the exact lights you need for your space. Here’s how I did mine.\n   This video is a fantastic overview of all the options when it comes to LED strips, but the long-story-short is WS2812B is the standard designation for a simple, individually addressable string of LED lights. I bought mine with no waterproofing (since they’re used indoors) and I got them in 30 pixels/meter density to keep my power needs low. Typically you’d pay about $10 for a 6 foot (2m) string and 16 foot (5m) strings are about $20. They’re all over eBay,  Amazon, and Aliexpress (which is the cheapest but can take the longest to arrive).\n Light strips come with a simple adhesive sticky backing to mount under things, but I went a little extra and bought some  aluminum channel designed for LEDs that also comes with a diffuser panel that helps spread out the light. You screw them into something, stick your LED strips inside, then snap on the outside light diffuser for a more permanent installation.\n I also finished off my mounting by putting  this corner guard in front of the lights to both hide the aluminum strip and further diffuse the light on the upper three shelves. It gives a nice downward glow.\n  Your lights will be controlled by a tiny computer chip with a WiFi adapter in it and the one you want is a NodeMCU ESP8266. The great part is they’re only about three or four bucks each and I bought  this set of three at Amazon just in case I fried one along the way .  Download WLED software and flash it to your NodeMCU, then configure it onto your WiFi network. All of it is covered in this step-by-step video to building your first light strip. If you buy the things you need, just follow Dr Zz’s guide closely to get them all working (it’s how I did mine).\n   The above video also goes into the math around how to select a power supply for your LEDs. My strips all together total 400 LEDs so I needed a pretty big power supply. I bought  this 30 amp model that is fanless and runs cool. My first purchase was a 60 amp power supply with a giant fan but it sounded like a hair dryer when you plugged it in and I’d only suggest using those for outdoor applications.\n I used  basic red/black wire for dropping power on each strip’s end. I used  some LED wire to connect them all together back to the controller. I avoided a lot of soldering by using  these specially made connectors that fit my LED strips perfectly. I also used  these T-connectors for connecting additional power while reducing the amount of soldering needed.  A set of jumper wires is needed to quickly connect up your NodeMCU to your power supply.\n   Download and install the WLED app for your phone and you should be able to control your lights after some configuration (don’t forget to input the exact number of LEDs you have and play with your LED preferences). You can also control them from a desktop web browser by simply going to your controller’s internal IP address.\n WLED is pretty incredible since it comes with a couple hundred different patterns already built-in and you simply select them to make your lights run complex patterns. I’ve customized my setup to split each bookshelf’s strip into its own segment, so programmed light effects happen on every shelf at once.\n I’ve also added my light strips to my Homekit control by using a WLED homebridge plugin so I can turn them off or on from my phone inside or outside my house, and as part of routines. Currently, I’m working on an iOS Shortcut to automatically dim  my room’s Hue lights and turn on the LED strips whenever I connect my AirPods to my laptop (which is when I’m about to jump into a Zoom meeting).\n To complete the look for my office, I added  a Samsung Frame 55″ TV I flush wall mounted that I turn on each morning to display Samsung’s art prints, which I rotate out often. The Frame TV is pretty incredible, with a screen that has a matte finish and it really does look like a painting to the naked eye, though when photographing it, it tends to overstate the brightness making it look more like a bright TV. If I had one TV in my living room over a fireplace mantel, I’d totally buy one of these, since it looks great when you’re not watching TV.\n  Here are a few more shots of what my LEDs look like installed, along with what I look like in a Zoom meeting (on a Saturday, wearing a tie-dye shirt).\n    I’ve got the LEDs set to a rainbow routine that I’ve slowed down, and they gently change in the background of my meetings.\n Again, if you have a simple setup, just go with an off-the-shelf option like the Govee lights, but if you want to go fully custom, LED strips are a fun cheap way to add some color to your surroundings.\n (in case you were wondering, that’s not a real Eames chair, it’s a nice knock-off I bought on Aliexpress for $500 and the plywood/leather chair is another famous knock-off from Aliexpress for $150, they’re mostly used for reading books in or giving guests a place to sit.)", "posttime": "2020-07-20 00:07:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diy,led", "title": "制作DIY LED条来娱乐", "title_en": "Building DIY LED strips for fun", "transed": 1, "url": "https://a.wholelottanothing.org/2020/07/18/building-diy-led-strips-for-fun/", "via": "", "real_tags": ["diy", "led"]}, {"category": "", "categoryclass": "", "imagename": "d4bc4dc9a6690aac25fc2e07c694778c.jpg", "infoid": 1012897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看着她26岁的弟弟死去几个小时后，弗吉尼亚·斯蒂芬给她最亲密的朋友之一写了一封信。在那封写于1906年11月20日的信中，她对她哥哥的死只字不提；她甚至没有提到他的名字。弗吉尼亚与弗吉尼亚·伍尔夫结婚成为弗吉尼亚·伍尔夫已经有24年了，而从出版她的第一部小说到现在已经有9年了。她和她的三个兄弟姐妹刚刚从希腊和土耳其旅行归来，那次旅行以灾难告终。弗吉尼亚的大哥索比·斯蒂芬(Thoby Stephen)感染了伤寒。\n弗吉尼亚在斯蒂芬去世那天写给维奥莱特·狄金森的信是写给陪同斯蒂芬夫妇旅行的维奥莱特·狄金森的。她也是带着伤寒回家的。自从回到伦敦后，这两个女人一直在通信，她们中的许多人全神贯注于索比和维奥莱特的健康。弗吉尼亚竟然没有向维奥莱特提起她哥哥的死讯，这很奇怪，更奇怪的是她在他死后两天寄来的那封信。这一次，她确实提到了他，但她的信传达了一个令人震惊的谎言：“索比是尽可能好的。我们并不焦虑。“。\n弗吉尼亚在接下来的一个月里继续对她的朋友撒谎。在历时28天的19封信中，她编造了一个索比康复的生动故事。他死后三天：“变化不大。今天下午他的体温又升到了104度，但除此之外，他的脉搏很好，而且他喝牛奶也吃得很好。“。五天：“托比过得很好。”九天：“亲爱的老索比还在仰卧着--但在这个姿势上，他和大多数人用后腿站立时一样充满了活力。”十二天：“他在床上画鸟。”两周后，弗吉尼亚悄悄加入了这个故事：“我们开始和我们的护士调情，称她们为‘我的女人’，她们给他织淡蓝色领带，如果他乖的话。”在她哥哥去世近一个月后，弗吉尼亚满怀热议地谈论着前方的事情：“他真的相处得很好，我们谈到了起床、离开和未来。”\n未来。从我今天坐在那里写作的角度来看，弗吉尼亚想要离开病态的气候，想要站起来离开，想要被运送到一个人们无法完全看到的未来--可能并不存在--这种愿望感觉既熟悉又强烈。我想上车开车；有时我会想，如果我开得足够远，开得足够长，我不仅会找到进入一个不同的地方的路，而且会进入一个不同的时代，从今天的悲伤和恐惧中解脱出来。幻想与担忧交织在一起：在我们热情洋溢地谈论“这一切”结束后我们会做什么时，我们是不是像弗吉尼亚一样，欺骗了彼此，也欺骗了我们自己？或者，我们逃离的梦想是否会为其他可能性腾出空间，这些可能性是我们想要生活但还无法描述的世界？欲望能成为一种知晓的方式吗？\n最近，我发现自己被这些伍尔夫早期的信件所吸引-它们令人不安地混合了悲伤与希望，失落与渴望-因为我在其中看到一个作家在危险地试验幻想的变革潜力。在某种程度上，所有的信都是这样做的：如果我今天给你写信，几天后我的话就必须让你看得清楚。我们的友谊将不得不延伸，以适应这种异步。虽然我的信的现在时态对你来说只存在于书页中，但我的现在和你的现在的缝合在一起，将把我们两个人从我们的生活中拉出来，无论多么短暂，都将进入一个虚构但共享的时光。在书信写作中，异步感变成了一种亲密无间的形式。\n在我们社交疏远的时代，有时感觉这是我们仅存的亲密关系。我们完全分开，发短信、发电子邮件、发推特和D.M.，这会把我们带到哪里呢？通信可能看起来像是我们渴望的物理存在的朦胧阴影，但它有它自己的回报。想一想收到一封信是什么感觉。在某些方面，这封信的公司超过了可以亲自收到的数量。如果你来看我，你可以随时离开。不过，给我寄封信吧，只要我想，信就是我的。艾米丽·狄金森(Emily Dickinson)在一首诗中描述了读一封信的广泛影响，对她来说，很多社交活动都是书信体。独自一人在房间里，她可以“慢慢地撬开”信封的锁，感觉自己被抬出了自己的生活--突然间拥有了神圣的力量。“仔细看看我是多么的无限，”她幸灾乐祸地说。这样的转变会让人上瘾。“请永远不要停止给我写信，”伊丽莎白·毕晓普在给罗伯特·洛厄尔的信中写道：“它们总是能让我感觉到自己是更高的自我。”\n索比去世时，弗吉尼亚·斯蒂芬和维奥莱特·狄金森已经当了将近五年的记者。弗吉尼亚写给维奥莱特的信(伍尔夫书集第一卷中发表的数百封信中的一封)始于她20岁时，她的父亲最近被诊断出患有癌症。维奥莱特比弗吉尼亚大17岁，几乎高出一英尺。“我希望你是一只袋鼠，”弗吉尼亚写道，沉浸在焦虑和悲伤中。\n在索比去世前两年的通信过程中，弗吉尼亚失去了她的父亲。她一直给维奥莱特写信，直到最糟糕的时候。信件变短了：每天更新她父亲的体温，他的情绪，医生的最新预测。但我们也看到，在这种恐惧中，弗吉尼亚向维奥莱特伸出援手，寻求一封信的安慰。看着父亲在临终前受苦，弗吉尼亚写道：“这看起来确实很难。我敢肯定，生活对他来说并不愉快--如果一周前他死了，他会很高兴的--但他也没有办法。眼睁睁看着他一天比一天慢慢虚弱，真是太难了。但显然，在这个残酷的世界里，人们必须经历这些事情。“。然后，她承认了这一可怕的事实，便在附言中向她索要只有紫罗兰的一封信才能提供的香油。“跟我说说你的衣服，”她写道，“还有凯旋。”\n弗吉尼亚沉浸在父亲去世的悲痛之中。她陷入了她认为是精神崩溃的境地。最后，她倒进了维奥莱特的怀抱。弗吉尼亚从维奥莱特位于伦敦郊外韦尔温的家中的故障中恢复过来。在那段时间里，她没有写信，但三个月后，当她被认为足够健康，可以与她的兄弟姐妹团聚时，她给紫罗兰写道：“我想血液终于进入了我的大脑。这是一种最奇怪的感觉，好像我的一个死去的部分又活过来了。“。对弗吉尼亚来说，复活意味着重新获得思考的能力。紧随其后的是一种执着的愿望，想写道：“我渴望开始工作。我知道我会写作，总有一天我会写出一本好书。“。\n弗吉尼亚在她父亲生病期间写给维奥莱特的信证明了通信提供陪伴、安慰甚至爱的力量。然而，在两年后索比去世后她写的信中，还有其他一些因素在起作用。如果说一封信的收件人有一种力量(居住在别人的世界里并在其中逗留的力量)，那么信件的发件人则有另一种同样激进的力量：履行的权力；扣留的权力；甚至欺骗的权力。是什么吸引了弗吉尼亚，在她哥哥死后，开始写这方面的信呢？\n维奥莱特之所以知道索比的死讯，是因为事发一个月后，杂志的一篇文章把这件事作为旁白提了出来。弗吉尼亚立即写信给她：“你恨我说了这么多谎话吗？你知道我们必须这么做。“。弗吉尼亚暗示，为了保护正在从自己的疾病中恢复的维奥莱特，她不得不撒谎。毫无疑问，弗吉尼亚确实非常关心维奥莱特；在索比身上，她有一个活生生的例子，近在咫尺，说明伤寒可能有多危险。在她的信中，弗吉尼亚将这两起案件联系在一起。在索比去世的前一天-他的感染导致了他的肠穿孔和腹膜炎-弗吉尼亚曾写信给维奥莱特：“我不知道你的斑点有哪些。索比发誓他比你的体温还高，和斯蒂芬伤寒相比，我们有点鄙视狄金森伤寒。“。这种黑色幽默不仅掩盖了索比症状的严重性，也掩盖了弗吉尼亚对维奥莱特的关注的紧迫性。在接下来的几天里，弗吉尼亚没有承认他的死讯，而是以她哥哥的案例为参照，来理解她朋友的情况：“我想你和他现在差不多处于同一阶段，只是我认为他受到了更猛烈的攻击。”十天后，弗吉尼亚对她死去的弟弟说：“你还可以吃固体食物吗，他想知道。”弗吉尼亚的书信复活托比给了她一种表达热切愿望的方式，希望维奥莱特活着，活得好好的。“现在，我的紫罗兰，”她在她精心编造的谎言将近一个月后写道，“吃了你的药，想想我。我们还能再见面吗？“。\n然而，弗吉尼亚的表演不仅仅是为了维奥莱特的利益。她还找到了一种方法，为自己假装她的兄弟实际上还活着。赫敏·李在她精彩的伍尔夫传记中写道，这些奇怪的信件“标志着她将索比变成小说，从而开始留住他。”多年来，伍尔夫又回到了这种悲哀的思想转向，并将其正式化地写进了小说中：索比的版本可以在“雅各布的房间”(1922年)和“海浪”(1931年)中再次找到，他们的父母的版本也可以在“到灯塔去”(1927年)中找到。在“过去的素描”(A Sketch Of The Past)一书中，伍尔夫解释说，她对“震惊”的反应能力使她成为了一名作家。这本回忆录始于她生命的尽头。\n索比的死无疑是一个“震惊”，有可能毁了她。给维奥莱特写信给弗吉尼亚提供了一种与她已经失去的哥哥保持联系的方式，并让她紧紧抓住一位她担心失去的朋友。\n从某种意义上说，她的谎言是不可能得逞的。索比死了，维奥莱特很快就会知道真相。但是，通过提供暂时的缓刑，她很快就必须面对的消息，弗吉尼亚州\n早在弗吉尼亚焦急地看着父亲去世的时候，她告诉维奥莱特，她计划保留她收到的信件：“我一生中从未保留过一封信--但这种浪漫的友谊应该保留下来。”然而，弗吉尼亚并没有保存维奥莱特的信件，没有一封幸存下来。另一方面，维奥莱特拿出了一套弗吉尼亚写给她的信的打字本，并把它们装订成几卷。1936年，在两人分居多年后，在赫敏·李所说的“怪异的责备或呼吁的时刻”，维奥莱特把这些信退还给了弗吉尼亚。弗吉尼亚被保存在那里的她自己的版本吓了一跳。“你喜欢那个女孩吗？”她在一封信中问道。“我不确定我会这么做。”当时54岁的弗吉尼亚·伍尔夫是七本小说的作者，她恳求她的朋友：“我恳求你不要让别人读那些信。”\n想必伍尔夫对那个女孩年轻时的热情洋溢感到难堪；也许她对她觉得有必要说的那些谎言感到羞愧。到了中年，突然面对年轻的热情洋溢的爱情记录，就会面临一个令人眼花缭乱的问题：你是谁，你与曾经的你有什么关系--把存在于时间中的许多自我召唤在一起。重读她写给维奥莱特的信，弗吉尼亚一定已经意识到，索比·斯蒂芬从来没有机会得到这样的重新评价。\n他死后，她的生活发生了一些变化。1929年圣诞节后的第二天，伍尔夫在日记中写道：“索比的身影隐约可见--那个古怪的鬼魂。”然而，与此同时，他似乎躺在她的前面。她想象着他在她生命末期的某个地方等着她：“我有时认为死亡是我在他死后进行的一次短途旅行的结束。好像我应该进来似的&说，好吧，给你。“。就好像他的死让她走上了自己的死亡之路。仿佛她的生命就是一封信，而托比则是收信人。仿佛每一个版本的她--即使是那个二十岁的女孩，甚至是她很快就会变成的死去的女人--都能以某种方式保存下来，活着，在它的褶皱里。因为她就在那里。", "note_en": "Hours after watching her twenty-six-year-old brother die, Virginia Stephen wrote a letter to one of her dearest friends. In that letter, written on November 20, 1906, she did not utter a word about her brother’s death; she did not so much as mention his name. Virginia was twenty-four—six years from marrying and becoming  Virginia Woolf, nine years from publishing her first novel. She and her three siblings had just returned from a trip to Greece and Turkey, which had ended in disaster. Thoby Stephen, Virginia’s eldest brother, had been infected with typhoid.\n The letter Virginia wrote the day he died was to Violet Dickinson, who had accompanied the Stephens on their trip. She, too, had come home with typhoid. The two women had been exchanging letters since their return to London, many of them preoccupied with Thoby’s and Violet’s health. That Virginia would have neglected to mention her brother’s death to Violet was strange; stranger still was the letter she sent two days after his death. This time, she did mention him, but her letter conveyed a shocking lie: “Thoby is as well as possible. We aren’t anxious.”\n   Virginia went on lying to her friend for the next month. In nineteen letters, sent over the course of twenty-eight days, she fabricated a vivid story of Thoby’s recovery. Three days after his death: “There isnt much change. His temp is up to 104 again this afternoon, but otherwise his pulse is good, and he takes milk well.” Five days: “Thoby is going on splendidly.” Nine days: “Dear old Thoby is still on his back—but manages to be about as full of life in that position as most people are on their hind legs.” Twelve days: “He draws birds in bed.” After two weeks, Virginia slipped herself into the narrative: “We begin to flirt with our nurses, and call them ‘my woman’ and they knit pale blue ties which they promise him, if he’s good.” And when nearly a month had passed since her brother had died, Virginia was full of talk about what lay ahead: “He is really getting on well, and we talk of getting up, and going away, and the future.”\n The future. From where I sit today and write, Virginia’s desire to leave behind a climate of illness, to get up and go away, to be transported to a future one can’t quite see—and which may not exist—feels familiar and intense. I want to get in my car and drive; sometimes I catch myself thinking that if I drive far enough, for long enough, I will have found my way not only into a different place but into a different time, released from today’s grief and dread. The fantasy is interwoven with worry: in our fond talk of what we’ll do after “all this” is over, are we, like Virginia, deceiving one another, and ourselves? Or might our dreams of escape make room for other possibilities, worlds we want to live in but can’t yet describe? Can desire be a way of knowing?\n Recently, I’ve found myself drawn to these early Woolf letters—to their unsettling mix of grief and hope, loss and desire—because in them I see a writer experimenting, perilously, with fantasy’s transformative potential. To some extent, all letters do this: if I write you a letter today, my words will have to be legible to you days from now. Our friendship will have to stretch to accommodate this asynchrony. Though the present tense of my letter will exist for you nowhere but in its pages, the stitching together of my present with yours will pull us both out of our lives, however briefly, and into a notional but shared time. Asynchrony becomes, in letter writing, its own form of intimacy.\n  In our time of  social distancing, it sometimes feels like the only intimacy we have left. Kept literally apart, we text and e-mail, tweet and D.M. Where can it lead us? Correspondence may seem like a dim shadow of the physical presence we crave, but it has its own rewards. Consider what it feels like to receive a letter. In some ways, the letter’s company  exceeds what can be received in person. If you visit me, you can leave whenever you please. Send me a letter, though, and it’s mine for as long as I want. Emily Dickinson—for whom so much of sociality was epistolary—described, in a poem, the expansive effects of reading a letter. Alone in her room, she could “slowly pick the lock” of an envelope and feel herself lifted out of her life—suddenly possessed of divine power. “Peruse how infinite I am,” she gloats. Such transformations become addictive. “Please never stop writing me letters,” Elizabeth Bishop wrote to Robert Lowell: “they always manage to make me feel like my higher self.”\n By the time Thoby died, Virginia Stephen and Violet Dickinson had been correspondents for nearly five years. Virginia’s letters to Violet (among the hundreds published in the first volume of Woolf’s  collected letters) began when she was twenty and her father had recently been diagnosed with cancer. Violet was seventeen years older and nearly a foot taller than Virginia. “I wish you were a Kangaroo,” Virginia wrote, immersed in anxiety and sadness about her father’s decline, “and had a pouch for small Kangaroos to creep to.” In a photograph of the two women standing side by side during this period, that desire for maternal protection is palpable; Virginia leans into Violet and clasps her hand; she wants to be taken in; she looks at the camera as though she wants that desire to be known.\n Letters gave the women another way to embrace. In them, Virginia referred to herself as Violet’s “Sparroy” (derived from “sparrow”), offering herself to this older woman as though she were a delicate pet. As her father recovered from an operation, Virginia asked Violet, “Have you a real affection for the Sparroy? She folds you in her feathery arms, so that you may feel the Heart in her ribs.” The letter became a means by which Virginia could not only declare a desire but, as it were, act it out: she folded Violet into her feathery arms, then folded the sheet of paper that was destined for Violet’s hands. The materials of her letter writing—pen and ink, paper—double for Virginia’s distant body: in another letter, she wrote, “you observe how thick the ink gets at this point—quite spontaneous.” We don’t know whether the sexual desire between these women ever moved off the page, but there are moments in the letters that suggest as much. “I will lick you tenderly,” Virginia promised.\n In the midst of this correspondence, two years before Thoby died, Virginia lost her father. She kept writing to Violet through the worst of it. The letters become shorter: daily updates on her father’s temperature, his mood, the doctors’ latest prognoses. But we also see, amid that horror, Virginia reaching out to Violet for the comfort of a letter. Watching her father suffer near the very end, Virginia wrote, “It does seem very hard. Life, I am sure, is no pleasure to him—and he would have been glad to die a week ago—but theres no help for it. It is so hard to wait and see him get slowly weaker day by day. But these are the things one has to go through in this Brute of a world apparently.” Then, having acknowledged this terrible truth, she asked, in a postscript, for the balm that only a letter from Violet could provide. “Tell me about your clothes,” she wrote, “and triumphs.”\n  Virginia sank beneath the grief of her father’s death. She sank into what she would understand as a nervous breakdown. And she sank, eventually, into Violet’s arms. Virginia recovered from that breakdown in Violet’s home in Welwyn, outside London. She didn’t write any letters during that period, but when, after three months, she was deemed well enough to rejoin her siblings, she wrote to Violet: “I think the blood has really been getting into my brain at last. It is the oddest feeling, as though a dead part of me were coming to life.” Coming back to life, for Virginia, meant regaining the ability to think. What followed close behind was an insistent desire to write: “I am longing to begin work. I know I can write, and one of these days I mean to produce a good book.”\n  The letters Virginia wrote to Violet during her father’s illness testify to the power of correspondence to provide company, comfort, and even love. Something else is at work, though, in the letters she wrote in the wake of Thoby’s death, two years later. If the recipient of a letter has one kind of power (the power to inhabit someone else’s world, and to linger in it), the sender of a letter has a different kind, just as radical: the power to perform; the power to withhold; the power, even, to deceive. What was it that drew Virginia, in the wake of her brother’s death, to this aspect of letter writing?\n Violet learned of Thoby’s death only because it was mentioned, a month after the fact, as an aside in a magazine article. Virginia wrote to her immediately: “Do you hate me for telling so many lies? You know we had to do it.” She had to lie, Virginia implies, in order to shield Violet, who was recovering from her own illness. No doubt Virginia  did feel intense concern for Violet; in Thoby she had a vivid example, close at hand, of how dangerous typhoid could be. Throughout her letters, Virginia linked the two cases. The day before Thoby’s death—his infection had led to a perforation of his bowels and peritonitis—Virginia had written to Violet: “I don’t know what variety of spots yours are. Thoby swears he beats your temperature, and we are a little scornful of the Dickinson typhoid compared to the Stephen typhoid.” That kind of dark humor masked not only the severity of Thoby’s symptoms but also the urgency of Virginia’s concern for Violet. In the days that followed, without acknowledging his death, Virginia used her brother’s case as a point of reference for understanding her friend’s: “I suppose you and he are about at the same stage now, only I think he has had a much sharper attack.” Ten days later, Virginia ventriloquized her dead brother: “Are you allowed solids yet, he wants to know.” Virginia’s epistolary resurrection of Thoby gave her a way of expressing a fervent wish that Violet stay alive and well. “Now, my Violet,” she wrote, nearly a month into her elaborate lie, “take your medicine and think of me. Shall we ever meet again?”\n Virginia’s performance wasn’t only for Violet’s benefit, though. She had also found a way of pretending, for herself, that her brother had in fact survived. In her brilliant  biography of Woolf, Hermione Lee writes that these strange letters “mark the beginning of her  keeping Thoby by turning him into fiction.” Woolf would return to this elegiac turn of thought over the years, formalizing it in novels: versions of Thoby can be found again in “ Jacob’s Room” (1922) and “ The Waves” (1931), and versions of their parents in “ To the Lighthouse” (1927). In “A Sketch of the Past,” a memoir begun near the end of her life, Woolf explained that her capacity to respond to a “shock” had made her into a writer:\n  Thoby’s death undoubtedly was a “shock,” one that threatened to undo her. Writing letters to Violet had given Virginia a means of keeping contact with the brother she had already lost and of holding fast to a friend whose loss she feared.\n  In one sense, her lies could not succeed. Thoby was dead, and Violet would soon enough know the truth. But, by offering a provisional reprieve from news she’d soon enough have to face, Virginia’s lies—awkward, creepy, scandalous as they were—pointed to a source of relief more durable than the lies themselves. Writing would be, for her, a way to live. Even in the face of shocking loss, writing might give pleasure. And  letter writing in particular—its power to summon presence out of absence, to warp the ordinary progress of time—would make it possible not simply to record but to animate her past, to draw it into her present, to make room for it in a future worth having. That work would absorb her. In the middle of her grief for Thoby and her lies to Violet, Virginia offered this self-diagnosis in a letter to another friend, Nelly Cecil: “I cant help feeling that the more I work and the less I talk the better—at least the less bad—for the world at present.”\n There are times when I, too, would rather work than talk. This seems to be one of those times. Writing offers a way to engage with the present while also deferring its entanglements to some future—perhaps a future in which one will feel readier to unravel them. Correspondence, whether letters or D.M.s, can afford the room—and exact the cost—of doing so in one’s relationships. Everything I write is a letter. Every letter is addressed to the future. By whom will my words be read, and when?\n Back in the period when Virginia was anxiously watching her father die, she told Violet that she planned to keep the letters that she’d received from her: “I’ve never kept a single letter all my life—but this romantic friendship ought to be preserved.” And yet Virginia did not preserve Violet’s letters; none of them survive. Violet, on the other hand, produced a set of typescript copies of Virginia’s letters to her and bound them in a few volumes. In 1936, many years after the two had drifted apart, in what Hermione Lee calls “an odd moment of reproach or appeal,” Violet returned the letters to Virginia. Virginia was taken aback by the version of herself that had been preserved there. “Do you like that girl?” she asked, in a letter. “I’m not sure that I do.” Virginia Woolf, by then the fifty-four-year-old author of seven novels, implored her friend: “all I beg of you is dont let anybody else read those letters.”\n  Presumably Woolf was embarrassed by the youthful effusions of that girl; maybe she felt some shame about the lies she had found it necessary to tell. To have reached middle age and to be suddenly confronted with the record of young, effusive love is to face a dizzying question about who you are, about what relation you bear to who you once were—to summon together the many selves that exist across time. Rereading her letters to Violet, Virginia must have realized that Thoby Stephen had never had the chance for such a reappraisal.\n Something altered in her life when he died. The day after Christmas, in 1929, Woolf wrote in her diary about feeling haunted by him: “Thoby’s form looms behind—that queer ghost.” And yet, at the same time, he seems to lie ahead of her. She imagined him waiting for her, somewhere, at the end of her life: “I think of death sometimes as the end of an excursion which I went on when he died. As if I should come in &amp; say well, here you are.” As if his dying had put her on the path to her own death. As if her very life were a letter, Thoby its recipient. As if every version of herself—even the girl at twenty, even the dead woman she would soon enough become—could somehow be preserved, alive, in its folds. For there she was.", "posttime": "2020-07-20 00:06:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "伍尔夫,woolf,弗吉尼亚", "title": "弗吉尼亚·伍尔夫用书信保住了她弟弟的性命。", "title_en": "Virginia Woolf kept her brother alive in letters", "transed": 1, "url": "https://www.newyorker.com/culture/culture-desk/how-virginia-woolf-kept-her-brother-alive-in-letters", "via": "", "real_tags": ["伍尔夫", "woolf", "弗吉尼亚"]}, {"category": "", "categoryclass": "", "imagename": "5fbacd88eba87815d206b2928b251a14.jpg", "infoid": 1012896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然机器学习可能会成为一种强大的医疗工具，但统计学家警告说，目前的模型存在严重缺陷。\n多年来，许多人工智能爱好者和研究人员承诺，机器学习将改变现代医学。已经开发了数以千计的算法来诊断癌症、心脏病和精神疾病等疾病。现在，正在训练算法，通过识别肺部CT扫描和X射线图像中的模式来检测新冠肺炎。\n这些模型中的许多旨在预测哪些患者的结果最严重，哪些患者需要呼吸机。人们的兴奋是显而易见的；如果这些模型是准确的，它们可以为医生在检测和治疗冠状病毒患者方面提供巨大的帮助。\n但是，人工智能辅助医学治疗真实的新冠肺炎患者的吸引力似乎还很遥远。世界各地的一群统计学家担心绝大多数机器学习模型的质量，以及如果医院很快采用它们可能造成的伤害。\n荷兰乌得勒支大学医学中心的医学统计学家马尔滕·范·斯梅登(Maarten Van Smeden)说：“(它)吓坏了我们很多人，因为我们知道模型可以用来做出医疗决策。”“如果模型不好，他们可能会让医疗决策变得更糟。所以它们实际上会伤害病人。“。\n范斯梅登正在与一大批国际研究人员共同领导一个项目，使用标准化标准评估新冠肺炎模型。这个项目是BMJ有史以来第一次进行现场审查，这意味着他们的40名审查员团队(而且还在不断壮大)正在积极更新他们的审查，因为新车型发布了。\n到目前为止，他们对新冠肺炎机器学习模型的评价并不好：他们苦于严重缺乏来自广泛研究领域的数据和必要的专业知识，但新的新冠肺炎算法面临的问题一点也不新鲜：医学研究中的AI模型多年来一直存在严重缺陷，范斯梅登等统计学家一直试图敲响警钟，以扭转局面。\n在新冠肺炎大流行之前，范德比尔特大学(Vanderbilt University)的生物统计学家弗兰克·哈雷尔(Frank Harrell)正在全国各地向医学研究人员讲授目前医学人工智能模型中普遍存在的问题。他经常借用一位著名经济学家的一句话来描述这个问题：医学研究人员正在使用机器学习来“折磨他们的数据，直到它吐出供词。”\n这些数字支持了哈雷尔的说法，揭示了绝大多数医学算法几乎没有达到基本的质量标准。2019年10月，由英国伯明翰大学(University Of Birmingham)的刘晓轩(音译)和阿拉斯泰尔·丹尼斯顿(Alastair Denniston)领导的一个研究团队发表了第一篇系统综述，旨在回答这个时髦但难以捉摸的问题：在诊断病人方面，机器能像人类医生一样好，甚至更好吗？他们的结论是，当从医学成像中检测疾病时，大多数机器学习算法都与人类医生不相上下。然而，还有另一个更有力、更令人震惊的发现-自2012年以来发表的关于疾病检测算法的总共20530项研究中，只有不到1%的研究在方法上足够严格，可以纳入他们的分析。\n研究人员认为，绝大多数人工智能研究的惨淡质量与最近对人工智能在医学上的过度炒作有直接关系。科学家们越来越想把人工智能加入他们的研究中，期刊比以往任何时候都更想发表使用人工智能的研究。丹尼斯顿说：“与我们预期的如果标题中没有人工智能的情况相比，正在出版的研究的质量并不好。”\n以前算法的主要质量问题也出现在新冠肺炎模型中。随着新冠肺炎机器学习算法数量的迅速增加，它们正迅速成为该领域已经存在的所有问题的一个缩影。\n就像他们的前辈一样，新的新冠肺炎车型的缺陷始于缺乏透明度。统计学家很难简单地试图弄清楚新冠肺炎人工智能研究的研究人员实际上做了什么，因为这些信息往往没有记录在他们的出版物中。范斯梅登说：“它们的报道如此之差，以至于我不能完全理解这些模型有什么作为输入，更不用说它们提供了什么作为输出。”“这太可怕了。”\n由于缺乏文件，范·斯梅登的团队一开始就不确定建立该模型的数据从何而来，因此很难评估该模型是否对疾病的严重程度做出了准确的诊断或预测。这也让人不清楚该模型在应用于新患者时是否会产生准确的结果。\n另一个常见的问题是，训练机器学习算法需要大量数据，但范斯梅登说，他的团队审查的模型使用得很少。他解释说，复杂的模型可能有数百万个变量，这意味着有数千名患者的数据集对于建立准确的诊断或疾病进展模型是必要的。但范斯梅登表示，目前的车型甚至还没有接近这一水平；大多数车型只有数百辆。\n然而，这些小的数据集并不是由于世界各地新冠肺炎病例的短缺造成的。相反，范斯梅登说，研究人员之间缺乏合作导致各个团队依赖自己的小数据集。这也表明，不同领域的研究人员没有共同努力，这给研究人员开发和微调模型的能力造成了相当大的障碍，这些模型真正有可能提高临床护理水平。正如范斯梅登指出的那样，“你不仅需要建模师的专业知识，还需要统计学家、流行病学家(和)临床医生共同努力，制造出真正有用的东西。”最后，范斯梅登指出，人工智能研究人员需要时刻平衡质量和速度--即使在大流行期间也是如此。毕竟，速度快的模型是糟糕的模型，最终只会浪费时间。\n“我们不想成为统计警察，”他说。“我们确实想找到好的模特。如果有好的模式，我想他们可能会有很大的帮助。“", "note_en": "Technology  While machine learning might hold promise as a powerful medical tool, statisticians warn that current models are severely flawed.\n For years, many artificial intelligence enthusiasts and researchers have promised that machine learning will change modern medicine. Thousands of algorithms have been  developed to diagnose conditions like cancer, heart disease and psychiatric disorders. Now, algorithms are being trained to detect COVID-19 by recognizing patterns in CT scans and X-ray images of the lungs.\n Many of these models aim to predict which patients will have the most severe outcomes and who will need a ventilator. The excitement is palpable; if these models are accurate, they could offer doctors a huge leg up in testing and treating patients with the coronavirus.\n But the allure of AI-aided medicine for the treatment of real COVID-19 patients appears far off. A group of statisticians around the world are concerned about the quality of the vast majority of machine learning models and the harm they may cause if hospitals adopt them any time soon.\n “[It] scares a lot of us because we know that models can be used to make medical decisions,” says Maarten van Smeden, a medical statistician at the University Medical Center Utrecht in the Netherlands. “If the model is bad, they can make the medical decision worse. So they can actually harm patients.”\n Van Smeden is co-leading a project with a large team of international researchers to evaluate COVID-19 models using standardized criteria. The project is the  first-ever living review at  The BMJ, meaning their team of 40 reviewers (and growing) is actively updating their review as new models are released.\n So far, their reviews of COVID-19 machine learning models aren’t good: They suffer from a serious lack of data and necessary expertise from a wide array of research fields. But the issues facing new COVID-19 algorithms aren’t new at all: AI models in medical research have been deeply flawed for years, and statisticians such as van Smeden have been trying to sound the alarm to turn the tide.\n  Before the COVID-19 pandemic, Frank Harrell, a biostatistician at Vanderbilt University, was traveling around the country to give talks to medical researchers about the widespread issues with current medical AI models. He often borrows a line from a famous economist to describe the problem: Medical researchers are using machine learning to “torture their data until it spits out a confession.”\n And the numbers support Harrell’s claim, revealing that the vast majority of medical algorithms barely meet basic quality standards. In October 2019, a team of researchers led by Xiaoxuan Liu and Alastair Denniston at the University of Birmingham in England  published the first systematic review aimed at answering the trendy yet elusive question: Can machines be as good, or even better, at diagnosing patients than human doctors? They concluded that the majority of machine learning algorithms are on par with human doctors when detecting diseases from medical imaging. Yet there was another more robust and shocking finding — of 20,530 total studies on disease-detecting algorithms published since 2012, fewer than 1 percent were methodologically rigorous enough to be included in their analysis.\n The researchers believe the dismal quality of the vast majority of AI studies is directly related to the recent overhype of AI in medicine. Scientists increasingly want to add AI to their studies, and journals want to publish studies using AI more than ever before. “The quality of studies that are getting through to publication is not good compared to what we would expect if it didn’t have AI in the title,” Denniston says.\n And the main quality issues with previous algorithms are showing up in the COVID-19 models, too. As the number of COVID-19 machine learning algorithms rapidly increase, they’re quickly becoming a microcosm of all the problems that already existed in the field.\n  Just like their predecessors, the flaws of the new COVID-19 models start with a lack of transparency. Statisticians are having a hard time simply trying to figure out what the researchers of a given COVID-19 AI study actually did, since the information often isn’t documented in their publications. “They’re so poorly reported that I do not fully understand what these models have as input, let alone what they give as an output,” van Smeden says. “It’s horrible.”\n Because of the lack of documentation, van Smeden’s team is unsure where the data came from to build the model in the first place, making it difficult to assess whether the model is making accurate diagnoses or predictions about the severity the disease. That also makes it unclear whether the model will churn out accurate results when  it’s applied to new patients.\n Another common problem is that training machine learning algorithms requires massive amounts of data, but van Smeden says the models his team has reviewed use very little. He explains that complex models can have millions of variables, and this means datasets with thousands of patients are necessary to build an accurate model of diagnosis or disease progression. But van Smeden says current models don’t even come close to approaching this ballpark; most are only in the hundreds.\n Those small datasets aren’t caused by a shortage of COVID-19 cases around the world, though. Instead, a lack of collaboration between researchers leads individual teams to rely on their own small datasets, van Smeden says. This also indicates that researchers across a variety of fields are not working together — creating a sizable roadblock in researchers’ ability to develop and fine-tune models that have a real shot at enhancing clinical care. As van Smeden  notes, “You need the expertise not only of the modeler, but you need statisticians, epidemiologists [and] clinicians to work together to make something that is actually useful.”Finally, van Smeden points out that AI researchers need to balance quality with speed at all times — even during a pandemic. Speedy models that are bad models end up being time wasted, after all.\n “We don’t want to be the statistical police,” he says. “We do want to find the good models. If there are good models, I think they might be of great help.”", "posttime": "2020-07-19 23:44:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,警告,warn,模型", "title": "统计学家警告称，人工智能仍未做好诊断新冠肺炎的准备", "title_en": "Statisticians Warn That AI Is Still Not Ready To Diagnose COVID-19", "transed": 1, "url": "https://www.discovermagazine.com/technology/is-ai-ready-to-help-diagnose-covid-19", "via": "", "real_tags": ["人工智能", "警告", "warn", "模型"]}, {"category": "", "categoryclass": "", "imagename": "9973784702758c684a5b074ba8de73b1.jpg", "infoid": 1012895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球客户智能平台提供商ZeoTap在C系列融资中筹集了4200万美元。\n支持者包括Neue Capital、Coparion、Kathaka、卡罗琳·鲁伯特的家族理财室、MathCapital、TTCER Partners，以及现有投资者New Science Ventures、Capnamic Ventures、Iris Capital、Here、Innov8(Singtel)和Ioniq，以及埃里克·罗扎(Eric Roza)、克里斯·斯科金斯(Chris Scoggins)、泰勒·巴拉达(Taylor Barada)、伯恩德·米勒(Bernd Miehler)、安迪·伯斯基(Andy Bursky)和吉姆·索尼(Jim Thoeni)等商业天使。除了这笔资金，Datalogix和甲骨文数据云的前负责人埃里克·罗扎(Eric Roza)也加入了ZeoTap的董事会。\n该公司打算利用这笔资金继续投资于其客户智能平台，并加倍投资其最近推出的通用营销身份解决方案ID+。\nZeoTap成立于2014年，由创始人兼首席运营官Projjol Banerjea和创始人兼首席执行官Daniel Heer领导，提供基于SaaS的客户情报平台(CIP)，使公司能够将第一方数据连接并转换为可操作的客户情报，了解客户并预测行为，投资于更有意义的体验。\n新启动的ID+项目将增强营销生态系统-品牌、出版商和供应商-的隐私合规机制，以克服Cookie/标识符限制和世界各地日益严格的监管带来的身份解析挑战。\n该平台通过一套集成的解决方案来满足营销人员的需求，这些解决方案可用于第一方数据统一、身份解析、丰富、分析/建模(包括在数据净化室中)，以及激活营销生态系统中的100多个合作伙伴。\nZeoTap与全球前100个品牌中的70多个品牌合作，包括梅赛德斯-奔驰、红牛、西班牙对外银行、橙色电信和沃达丰。该公司在柏林、纽约、伦敦、米兰、马德里、巴黎、孟买和班加罗尔设有办事处。", "note_en": "Zeotap, a global provider of a customer intelligence platform, raised $42m in Series C funding.\n  Backers included Neue Capital, coparion, Kathaka, Caroline Rupert’s family office, MathCapital, TTCER Partners, and existing investors New Science Ventures, Capnamic Ventures, Iris Capital, HERE, Innov8 (Singtel), and IONIQ, and business angels including Eric Roza, Chris Scoggins, Taylor Barada, Bernd Miehler, Andy Bursky, and Jim Thoeni, among others. In conjunction with the funding, Eric Roza, former leader of Datalogix and Oracle Data Cloud, joined Zeotap’s Board of Directors.\n The company intends to use the funds to continue to invest in its customer intelligence platform and double down on ID+, its recently launched universal marketing identity solution.\n Founded in 2014 and led by Projjol Banerjea, founder and CPO, and Daniel Heer, founder and CEO, Zeotap provides a SaaS-based customer intelligence platform (CIP) that enables companies to connect and transform their first-party data into actionable customer intelligence, understand their customers and predict behaviors, to invest in more meaningful experiences.\n The newly launched ID+ project will empower the marketing ecosystem – brands, publishers, and vendors alike – with a privacy-compliant mechanism to overcome identity resolution challenges arising from cookie/identifier restrictions and increasingly stringent regulation across the world.\n The platform addresses marketers’ needs with an integrated suite of solutions for first-party data unification, identity resolution, enrichment, analytics/modeling (including in data clean rooms), and activation to 100+ partners in the marketing ecosystem.\n Zeotap works with over 70 of the top 100 global brands, including Mercedes Benz, Red Bull, BBVA, Orange Telecom, and Vodafone. The company has offices in Berlin, NY, London, Milan, Madrid, Paris, Mumbai, and Bangalore.", "posttime": "2020-07-19 23:44:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "bringing,客户", "title": "ZeoTap是一家帮助公司提供客户智能的SaaS初创公司，根据Crunchbase的数据，该公司筹集了4200万美元的C系列资金，使其筹资总额超过6000万美元", "title_en": "Zeotap, a SaaS startup that helps companies with customer intelligence, raises $42M Series C, bringing its total raised to over $60M according to Crunchbase", "transed": 1, "url": "http://www.finsmes.com/2020/07/zeotap-raises-42m-in-series-c-funding.html", "via": "", "real_tags": ["bringing", "客户"]}, {"category": "", "categoryclass": "", "imagename": "cd8cb7c4d25a4bd0c1f85639686e2e18.png", "infoid": 1012894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "C语言不支持继承，但是它支持结构组合，可以对其进行调整以服务于需要父子关系的用例。在本文中，我们将了解结构组合如何帮助我们在C中模拟继承并保持代码的可扩展性。我们还将了解它如何驱动计算机科学领域有史以来发明的两个最重要的东西。\n结构组合是指我们将一个结构放在另一个结构中，不是通过它的指针，而是作为一个本机成员-类似这样。\n//此结构定义链表的一个节点，//它只保存指向链表中的下一个和//上一个//节点的指针。Struct{struct*；//指向当前struct下一个节点的指针*；//指向当前struct前一个节点的指针}；//list_int保存LIST_HEAD和整数数据成员struct{struct；//公共Next和Prev指针值；//根据实现指定成员}；//List_int保存LIST_HEAD和char*数据成员结构{struct；//公共Next和Prev指针char*str；//具体成员按实现}；\n在上面的示例中，我们使用结构组合定义了链表的一个节点。通常，一个链表节点有3个成员-两个指向相邻节点(下一个和前一个)的指针，第三个可以是数据或指向它的指针。链表的定义因素是逻辑上形成节点链的两个指针。为了保持抽象，我们创建了一个名为LIST_HEAD的结构，该结构包含NEXT和PREV这两个指针，并省略了细节，即数据。\n使用LIST_HEAD结构，如果我们要定义包含整数值的链表节点，我们可以创建另一个名为LIST_INT的结构，该结构包含LIST_HEAD类型的成员和整数值。下一个和前一个指针通过LIST_HEAD LIST引入到此结构中，可以称为list.next和list.prev。\n为链表节点和结构成员选择这样奇怪的名称是有非常真实的原因的；这样做的原因将在本文后面的部分中阐明。\n由于上述结构定义，构建包含任何类型的链表节点变得轻而易举。例如，保存字符串的节点可以快速定义为具有list_head和char*的struct list_str。这种扩展LIST_HEAD并构建包含任何类型和任何细节的数据的节点的能力使低级代码变得简单、统一和可扩展。\nC中的结构没有填充，它们甚至没有保存任何元信息，甚至没有成员名称的信息；因此，在分配期间，为它们分配的空间刚好足以保存实际数据。\n在上图中，我们可以看到LIST_INT的成员如何映射到其单个成员所需的已分配空间上。它被分配了12字节的连续空间-两个指针中的每一个都是4字节，另外4字节是整数值。如下所示，可以通过打印出成员的地址来验证空间分配的邻接性和成员在分配期间的顺序。\nVoid(){//创建LIST_INT保持值41434结构*=(41434)的节点；//打印单个成员的地址printf(&#34；%p：head\\n&34；，head)；printf(&#34；%p：head-&&gt;list.next\\n&34；，&amp；((head-&&gt;list).next))；printf(&#34；%p：head-&&gt;；list.。，&amp；((head-gt；list).prev))；printf(&#34；%p：head-&gt；value\\n&#34；，&amp；(head-gt；value))；}~$make&amp；&amp；/a.out 0x4058f0：head 0x4058f0：head-&gt；list.next 0x4058f4：head-&gt；list.prev 0x4058f8。\n我们清楚地看到了所有3个成员，按照它们在结构中的定义顺序占用了12个字节的连续内存段。\n上面的代码是在整数和指针大小各为4字节的机器上执行的。根据机器和CPU体系结构的不同，结果可能会有所不同。\n在C语言中，当指向一个结构的指针强制转换为指向另一个结构的指针时，引擎会根据目标结构类型的各个成员的顺序和偏移量，将它们映射到源结构实例的内存片上。\n当我们将LIST_INT*转换为LIST_HEAD*时，引擎会将目标类型(即LIST_HEAD)所需的空间映射到LIST_INT占用的空间上。这意味着它将LIST_HEAD所需的8个字节映射到LIST_INT实例占用的前8个字节上。通过上面讨论的内存表示，我们发现list_int的前8个字节实际上是list_head，因此将list_int*转换为list_head*实际上只是通过一个新变量引用list_int的list_head成员。\n这有效地在两个结构之间建立了父子关系，这样我们就可以安全地将子LIST_INT类型转换为其父LIST_HEAD。\n这里需要注意的是，建立父子关系只是因为LIST_INT的第一个成员是LIST_HEAD类型。如果我们更改LIST_INT中成员的顺序，它将不起作用。\n如上所述，通过将一个结构放入另一个结构中作为其第一个元素，我们可以有效地在这两个结构之间创建父子关系。由于这使我们能够安全地将子结构类型转换为其父结构，因此我们可以定义接受指向父结构的指针作为参数的函数，并执行实际上不需要处理细节的操作。这允许我们不必重写每个子扩展的功能逻辑，从而避免冗余代码。\n从我们已经设置的上下文中，假设我们想要编写一个函数，在链表中的这两个节点之间添加一个节点。执行此操作的核心逻辑实际上不需要处理任何细节，只需对NEXT和PREV进行几次指针操作即可。因此，我们可以只定义接受LIST_HEAD*类型的参数的函数，并将该函数编写为。\n/**在两个已知的连续条目之间插入新条目。**这仅用于内部列表操作，其中我们已知道*prev/next条目！*/static void__list_add(struct list_head*new，struct list_head*prev，struct list_head*next){next-&gt；prev=new；new-&gt；next=next；new-&gt；prev=prev；prev-&gt；next=new；}。\n因为我们可以安全地将list_int*和list_str*类型化为list_head*，所以我们可以传递任何特定的实现函数__list_add，并且它仍然会无缝地添加其他两个之间的节点。\n因为链表上的核心操作只需要指针操作，所以我们可以将这些操作定义为接受LIST_HEAD*的函数，而不是像LIST_INT*这样的特定类型。因此，我们不需要为具体内容编写类似的函数。删除节点的函数可以编写为。\n/**通过使上一个/下一个条目*相互指向来删除列表条目。**这仅适用于已知道*prev/next条目的内部列表操作！*/static inline void__list_del(struct list_head*prev，struct list_head*next){next-&gt；prev=prev；prev-&gt；next=next；}。\n其他链表实用程序，如向尾部添加节点、交换节点、拼接列表、旋转列表等，只需要操作NEXT和PREV指针。因此，它们也可以用非常相似的方式编写，即接受LIST_HEAD*，这样就不需要为每个单个子实现重新实现函数逻辑。\n这种行为与现代OOP语言(如Python和Java)中允许子代调用任何父函数的继承的工作方式非常相似。\n使用结构成分的实际用法有很多，但最著名的是。\n为了保持事物的抽象性和可扩展性，Linux内核在多个地方使用了结构组合。它使用组合的最重要的地方之一是管理和维护链表，这正是我们在上面看到的。结构定义和代码片段按原样取自内核的源代码，因此结构和变量名看起来与通常不同。\nPython是当今世界最重要的语言之一，它使用结构组合来构建类型层次结构。Python定义了一个名为PyObject的根结构，它保存引用计数，定义引用对象的位置数和对象类型，确定对象的类型，即int、str、list、dict等。\nTyfinf struct_{py_ssize_t ob_refcnt；//保存对象PyTypeObject*ob_type的引用计数；//保存对象的类型}PyObject；\n由于Python希望这些字段出现在运行时创建的每个对象中，因此它使用结构组合来确保整数、浮点、字符串等对象将PyObject作为其第一个元素，从而建立父子关系。Python中的Float对象定义为。\n现在，可以将每次访问任何对象时递增和递减引用计数的实用程序函数编写为接受PyObject的单个函数，如下所示。\n因此，我们不再需要为每个单独的对象类型重写INCREF，只需为PyObject编写一次，它将适用于通过PyObject扩展的每个单独的Python对象类型。\n如果你喜欢你所读的内容，订阅，你可以随时订阅我的时事通讯，并将帖子直接送到你的收件箱。我写各种工程主题的文章，并通过我的每周时事通讯👇与人分享。\nMongoDB的cursor.skip()效率非常低，为什么呢？尽管它速度慢，效率低，但……。\n写时复制用于建模时间旅行，构建没有锁的数据库，并使分叉系统...。\nTF-IDF被广泛应用于搜索引擎以及各种文档分类和聚类分析中。", "note_en": "C language does not support inheritance however it does support Structure Compositions which can be tweaked to serve use-cases requiring parent-child relationships. In this article, we find out how Structure Compositions help us emulate inheritance in C and keep our code extensible. We will also find how it powers two of the most important things to have ever been invented in the field of computer science.\n  Structure Composition is when we put one structure within another, not through its pointer but as a native member - something like this\n // this structure defines a node of a linked list and // it only holds the pointers to the next and the previous // nodes in the linked list.  struct   {\t  struct   * ;  // pointer to the node next to the current one\t  struct   * ;  // pointer to the node previous to the current one}; // list_int holds an list_head and an integer data member  struct   {\t  struct    ;  // common next and prev pointers\t int value;  // specific member as per implementation}; // list_int holds an list_head and an char * data member  struct   {\t  struct    ;  // common next and prev pointers\t char * str;  // specific member as per implementation};\n In the example above, we define a node of a linked list using structure composition. Usually, a linked list node has 3 members - two pointers to adjacent nodes (next and previous) and a third one could either be the data or a pointer to it. The defining factor of a linked list is the two pointers that logically form a chain of nodes. To keep things abstract we create a struct named  list_head which holds these two pointers  next and  prev and omits the specifics i.e. data.\n Using  list_head structure, if we were to define a node of a linked list holding an integer value we could create another struct, named  list_int that holds a member of type  list_head and an integer value  value. The next and previous pointers are brought into this struct through  list_head list and could be referred to as  list.next and  list.prev.\n There is a very genuine reason for picking such weird names for a linked list node and members of structures; the reason to do so will be cleared in the later sections of this essay.\n Because of the above structure definition, building a linked list node holding of any type becomes a breeze. For example, a node holding string could be quickly defined as a struct  list_str having  list_head and a  char *. This ability to extend  list_head and build a node holding data of any type and any specifics make low-level code simple, uniform, and extensible.\n  Structures in C are not padded and they do not even hold any meta information, not even for the member names; hence during allocation, they are allocated the space just enough to hold the actual data.\n  In the illustration above we see how members of  list_int are mapped on the allocated space - required by its individual members. It is allocated a contiguous space of 12 bytes - 4 bytes for each of the two pointers and another 4 bytes for the integer value. The contiguity of space allocation and order of members during allocation could be verified by printing out their addresses as shown below.\n void   () {  // creating a node of the list_int holding value 41434   struct   *  =  (41434);  // printing the address of individual members  printf( &#34;%p: head\\n&#34;, head);  printf( &#34;%p: head-&gt;list.next\\n&#34;, &amp;((head-&gt; list).next));  printf( &#34;%p: head-&gt;list.prev\\n&#34;, &amp;((head-&gt; list).prev));  printf( &#34;%p: head-&gt;value\\n&#34;, &amp;(head-&gt;value));}~ $ make &amp;&amp; ./a.out 0x4058f0: head 0x4058f0: head-&gt; list.next 0x4058f4: head-&gt; list.prev 0x4058f8: head-&gt;value\n We clearly see all the 3 members, occupying 12 bytes contiguous memory segments in order of their definition within the struct.\n The above code was executed on a machine where the size of integer and pointers were 4 bytes each. The results might differ depending on the machine and CPU architecture.\n  In C language, when a pointer to a struct is cast to a pointer to another struct, the engine maps the individual members of a target struct type, depending on their order and offsets, on to the slice of memory of the source struct instance.\n When we cast  list_int * into  list_head *, the engine maps the space required by target type i.e.  list_head on space occupied by  list_int. This means it maps the 8 bytes required by  list_head on the first 8 bytes occupied by  list_int instance. Going by the memory representation discussed above, we find that the first 8 bytes of  list_int are in fact  list_head, and hence casting  list_int * to  list_head * is effectively just referencing the  list_head member of  list_int through a new variable.\n  This effectively builds a parent-child relationship between the two structs where we can safely typecast a child  list_int to its parent  list_head.\n It is important to note here that the parent-child relationship is established only because the first member of  list_int is of type  list_head. it would not have worked if we change the order of members in  list_int.\n  As established above, by putting one struct within another as its first element we are effectively creating a parent-child relationship between the two. Since this gives us an ability to safely typecast child to its parent we can define functions that accept a pointer to parent struct as an argument and perform operations that do not really require to deal with specifics. This allows us to  NOT rewrite the functional logic for every child extensions and thus avoid redundant code.\n From the context we have set up, say we want to write a function that adds a node between the two in a linked list. The core logic to perform this operation does not really need to deal with any specifics all it takes is a few pointer manipulations of  next and  prev. Hence, we could just define the function accepting arguments of type  list_head * and write the function as\n /* * Insert a new entry between two known consecutive entries. * * This is only for internal list manipulation where we know * the prev/next entries already! */ static  void __list_add(struct list_head * new, struct list_head *prev, struct list_head *next){ next-&gt;prev =  new;  new-&gt;next = next;  new-&gt;prev = prev; prev-&gt;next =  new;}\n Since we can safely typecase  list_int * and  list_str * to  list_head * we can pass any of the specific implementations the function  __list_add and it would still add the node between the other two seamlessly.\n Since the core operations on linked lists only require pointer manipulations, we can define these operations as functions accepting  list_head * instead of specific types like  list_int *. Thus we need not write similar functions for specifics. A function to delete a node could be written as\n /* * Delete a list entry by making the prev/next entries * point to each other. * * This is only for internal list manipulation where we know * the prev/next entries already! */ static  inline  void __list_del(struct list_head * prev, struct list_head * next){ next-&gt;prev = prev; prev-&gt;next = next;}\n Other linked list utilities like  adding a node to tail,  swapping nodes,  splicing the list,  rotating the list, etc only require manipulations of  next and  prev pointers. Hence they could also be written in a very similar way i.e accepting  list_head * and thus eliminating the need to reimplement function logic for every single child implementation.\n This behavior is very similar to how inheritance in modern OOP languages, like Python and Java, work where the child is allowed to invoke any parent function.\n  There are a ton of practical usage of using Structure Compositions but the most famous ones are\n  In order to keep things abstract and extensible, Linux Kernel uses Structure Composition at several places. One of the most important places where it uses composition is for managing and maintaining Linked Lists, exactly how we saw things above. The struct definitions and code snippets are taken as-is from the  Kernel&#39;s source code, and hence the structure and variable names look different than usual.\n  Python, one of the most important languages in today&#39;s world, uses Structure Composition to build Type Hierarchy. Python defines a root structure called  PyObject which holds reference count, defining the number of places from which the object is referenced - and object type - determining the type of the object i.e.  int,  str,  list,  dict, etc.\n typedef   struct _  { Py_ssize_t ob_refcnt;  // holds reference count of the object PyTypeObject *ob_type;  // holds the type of the object} PyObject;\n Since Python wants these fields to be present in every single object that is created during runtime, it uses structure composition to ensure that objects like integers, floats, string, etc put  PyObject as their first element and thus establishing a parent-child relationship. A Float object in Python is defined as\n  Now writing utility functions that increments and decrements references count on every access of any object could be written as just a single function accepting  PyObject * as shown below\n  Thus we eradicate a need of rewriting  INCREF for every single object type and just write it once for  PyObject and it will work for every single Python object type that is extended through  PyObject.\n    If you like what you read subscribe you can always subscribe to my newsletter and get the post delivered straight to your inbox. I write  essays on various engineering topics and share it through my weekly  newsletter 👇\n    MongoDB&#39;s cursor.skip() is very inefficient, why is that? Even though it is slow and inefficient, t...\n  Copy-on-write is used to model Time Travel, build databases with no locks, and makes the fork system...\n  TF-IDF is extensively used in search engines and in various document classification and clustering t...", "posttime": "2020-07-19 23:43:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,inheritance,list", "title": "C语言中的继承", "title_en": "Inheritance in C", "transed": 1, "url": "https://arpitbhayani.me/blogs/inheritance-c", "via": "", "real_tags": ["语言", "list"]}, {"category": "", "categoryclass": "", "imagename": "2c99e2b342e2af50977d75936b09d4f3.jpg", "infoid": 1012893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tl；dr-如果您对游戏的问题和修复方式的深入概述不感兴趣，请向下滚动到下载部分获取下载链接。\n“大众效应”是科幻角色扮演游戏中很受欢迎的特许经营游戏。第一款游戏最初是由BioWare于2007年底在Xbox360独家发布的，作为与微软达成的发行协议的一部分。几个月后的2008年年中，这款游戏获得了Demiurge Studios开发的PC端口。这是一个不错的端口，没有明显的缺陷，直到2011年AMD发布了基于推土机的新CPU。当在配备现代AMD处理器的PC上玩游戏时，游戏中的两个区域(Noveria和ilos)显示出严重的图形伪像：\n虽然不是不能玩，但肯定会让人分心。谢天谢地，有解决办法-比如通过控制台命令禁用照明，或者修改游戏地图来移除破碎的灯光，但似乎这个问题一直没有完全被理解。一些消息来源声称FPS计数器模块也可以修复这个问题，但我找不到太多关于这个问题的信息，国防部的源代码似乎也无法在线获得，也没有关于国防部如何解决这个错误的文档。\n是什么让这个问题特别有趣？特定于供应商的漏洞并不是什么新鲜事，游戏已经有几十年的历史了。然而，据我所知，这是唯一由处理器而不是显卡引起的图形问题。在大多数情况下，问题发生在特定的GPU供应商身上，他们不关心CPU，而在这种情况下，问题恰恰相反，这使得这个问题非常独特，值得研究。\n在网上查阅现有的讨论，这个问题似乎影响到AMD FX和Ryzen芯片。与老式的AMD芯片相比，这些芯片缺少3D Now！指令集。不管是否相关，社区的共识是这是错误的原因，游戏在检测到AMD CPU时试图使用这些指令。鉴于英特尔CPU和3D Now！上没有发生此错误的已知案例！说明是AMD独有的，难怪社区认为这就是问题所在。\n这真的是问题所在，还是完全不同的原因造成的？让我们来看看吧！\n尽管这个问题重现起来微不足道，但我无法深入研究很长时间，原因很简单--我无法接触到任何装有AMD硬件的PC！值得庆幸的是，这一次我不再孤军奋战--拉斐尔·里维拉(Rafael Rivera)在整个研发过程中都得到了我的支持，为我提供了一个拥有AMD芯片、洞察力和想法的测试环境，同时还忍受了我在试图找到这些未知问题的根源时通常会胡乱猜测的数百种盲目猜测。\n既然我们现在有了一个很好的测试环境，第一个要测试的理论当然是cpuid-如果人们假设3DNow是正确的！指令是罪魁祸首，在游戏代码中应该有一个地方，让他们检查自己的存在，或者至少检查一下CPU供应商。然而，这一推理是有缺陷的；如果游戏试图使用3DNow是真的！指令在AMD芯片上运行的任何时候，如果不检查它们是否受支持，当试图执行非法指令时，游戏很可能会崩溃。此外，快速扫描游戏代码会发现游戏没有检查CPU功能。因此，无论这个问题出了什么问题，它似乎都不是由游戏错误检测CPU功能引起的，因为它似乎从一开始就不关心它们。\n当这看起来像是一个无法调试的案例时，Rafael给我带来了一个实现-禁用PSGP(处理器特定图形管道)解决了这个问题，字符被正确地照亮了！PSGP不是记录最好的术语，但简而言之，它是允许Direct3D执行处理器特定优化的遗留功能(仅涉及较旧的DirectX版本)：\n在早期版本的DirectX中，有一条路径允许执行顶点处理，称为PSGP。应用程序必须考虑到这条路径，并支持处理器和图形核心上的顶点处理路径。\n这样说来，为什么禁用PSGP会修复AMD上的伪像-现代AMD处理器所走的道路可能会以某种方式中断。如何禁用它？我脑海中浮现出两种方式：\n可以将D3DCREATE_DISABLE_PSGP_THREADING标志传递给IDirect3D9：：CreateDevice。它被定义为：将计算限制到主应用程序线程。如果未设置该标志，则运行时可以在工作线程中执行软件顶点处理和其他计算，以提高多处理器系统上的性能。\n遗憾的是，设置该标志并不能解决问题。看起来，尽管旗帜上有“PSGP”的名字，但它不是我们要找的。\nDirectX指定两个注册表项在D3D中禁用PSGP，并仅为D3DX禁用PSGP-DisablePSGP和DisableD3DXPSGP。这些标志可以在系统范围或进程范围内设置。有关如何仅为特定进程设置它们的信息，请参阅Rafael Rivera关于启用特定于应用程序的Direct3D标志的指南。\nDisableD3DXPSGP似乎是解决该问题的可行解决方案。因此，如果您对下载第三方修复/修改有反感，或者您必须在不对游戏进行任何更改的情况下修复此问题，这是一个非常好的方法。只要您只为质量效果设置该标志，而不是在系统范围内设置，就可以了！\n与图形问题一样，PIX可能是人们可以用来诊断这些问题的最有用的工具。我们从英特尔和AMD硬件捕获了类似的场景，并对结果进行了比较。其中一个差异立刻就显而易见--与我以前的项目不同，在以前的项目中，捕获的内容没有携带错误，相同的捕获在不同的PC上看起来会不同(表示驱动程序或d3d9.dll错误)，这些捕获会携带错误！换句话说，从安装了英特尔硬件的PC上打开的AMD硬件捕获确实会显示该错误。\n英特尔上的AMD捕获与获取它的硬件上的AMD捕获看起来没有什么不同：\n由于PIX不“截取屏幕”，而是捕获D3D命令序列并在硬件上执行它们，因此我们可以观察到，执行从AMD框捕获的命令在Intel上执行时会导致相同的错误。\n这强烈地表明，这种差异不是由命令执行方式的不同(这就是如何获得GPU特定的错误)造成的，而是由执行哪些命令引起的。\n换句话说，几乎可以肯定它不是任何类型的驱动程序错误。取而代之的是，GPU的输入准备方式似乎不知何故被破坏了1。这确实是非常罕见的情况！\n在这一点上，找到bug就是找出捕获之间的任何不和谐的差异。这很乏味，但这是唯一可行的方法。\n在戳了很长一段时间之后，一个全身抽签的呼唤引起了我的注意：\n在英特尔捕获的图像中，此绘图输出角色的大部分身体，以及照明和纹理。在AMD捕捉上，它输出纯黑色模型。这条路看起来很不错。\n检查的第一个明显的候选对象是绑定纹理，但是它们看起来很好，并且在捕获过程中是一致的。但是，一些像素着色器常量看起来很奇怪。它们不仅有NAN(不是号码)，而且似乎只出现在AMD捕获上，而不出现在英特尔捕获上：\n这看起来很有希望--导致奇怪视觉效果的NaN值并不是闻所未闻的。有趣的是，PlayStation3版本的“质量效果2”在RPCS3中有一个非常相似的外观问题，这也与nans有关！\n但是，在我们过于兴奋之前，这些值可能只是以前绘制的剩余值，它们可能最终不会用于当前绘制。幸运的是，在这种情况下，可以清楚地看到这些NaN被提交到D3D以用于此特定绘制…。\n49652 IDirect3DDevice9：：SetVertexShaderConstantF(230，0x3017FC90，4)49653 IDirect3DDevice9：：SetVertexShaderConstantF(234，0x3017FCD0，3)49654 IDirect3DDevice9：：SetPixelShaderConstantF(10，0x3017F9D4，1)//提交常量c1049655 IDirect3DDevice9：：SetPixelShaderConstantF(11，0x3017F9C4，1)//提交常量c1149656 IDirect3DDevice9：：SetRenderState(D3DRS_FILLMODE，D3DFILL0.000f)49660 IDirect3DDevice9：：TestCooperativeLevel()49661 IDirect3DDevice9：：SetIndices(0x296A5770)49662 IDirect3DDevice9：：DrawIndexedPrimitive(D3DPT_TRIANGLELIST，0，0，2225，0,3484)//绘制角色模型。\n这两个常量似乎直接来自虚幻引擎，从名称来看，它们可能会直接影响照明。对啰!。\n游戏中的快速测试进一步证实了这一理论-在Intel机器上，4 nA值的向量从未作为像素着色器常量提交；同时，在AMD机器上，只要玩家进入照明中断的区域，nans就会开始显示！\n这是否意味着工作已经完成？不，远非如此，因为找到被破坏的常量只是成功的一半。问题仍然存在，它们是从哪里来的，可以被取代吗？游戏中用零代替NaN值的测试部分解决了这个问题-丑陋的黑色斑点消失了，但人物仍然太暗了：\n考虑到这些灯光值对场景可能有多么重要，采用这样的解决方法是不可行的。不过，我们知道我们是在正确的轨道上！\n遗憾的是，任何追踪这些常量来源的尝试都指向类似于呈现线程的东西，而不是提交的真实位置。虽然不是不可调试的，但很明显，我们需要尝试一种新的方法，然后才可能花费无限的时间跟踪特定于游戏的和/或特定于UE3的结构之间的数据流。\n退后一步，我们意识到我们之前忽略了一些东西。回想一下，要“修复”这个问题，必须添加两个注册表项中的一个-DisablePSGP和DisableD3DXPSGP。假设它们的命名没有误导性，那么DisableD3DXPSGP应该是DisablePSGP的子集，前者仅在D3DX中禁用PSGP，后者在D3DX和D3D中都禁用它。根据这个假设，我们将目光转向了D3DX。\n看一看列表，如果我在没有从捕获中获得先验知识的情况下接近它，我会认为D3DXPreprocess Shader或D3DXCompileShader可能是罪魁祸首-着色器可能被错误地优化和/或在AMD上编译，但修复这个问题可能非常具有挑战性。\n然而，根据我们目前的知识，有一个函数从这个列表中脱颖而出-D3DXMatrixInverse是唯一可以合理地用于准备像素着色器常量的函数。\n我是…。不过，做得不太好。快速浏览d3dx9_31.dll会发现，D3DXMatrixInverse没有触及输出参数，并且返回nullptrif矩阵求逆失败(由于输入矩阵是单一的)，但是游戏根本不关心这一点。输出矩阵可能没有初始化，嘘！在游戏中确实会出现求逆的奇异矩阵(最常出现在主菜单中)，但无论我们做了什么来使游戏更好地处理它们(例如，将输出置零或将其设置为单位矩阵)，视觉效果都不会改变。哦，好吧。\n揭穿了这一理论之后，我们回到了PSGP-PSGP在D3DX中到底做了什么？拉斐尔·里维拉(Rafael Rivera)对此进行了研究，其背后的逻辑被证明是相当简单的：\nAddFunctions(X86)IF(DisablePSGP||DisableD3DXPSGP){//所有优化已关闭}Else{IF(IsProcessorFeaturePresent(PF_3DNOW_Instructions_Available)){IF((GetFeatureFlags()&amp；mmx)&amp；&amp；(GetFeatureFlags()&amp；3现在！){AddFunctions(amd_MMX_Available。Sse){AddFunctions(Amdsse)}}Else if(IsProcessorFeaturePresent(PF_XMMI64_Instructions_Available/*SSE2*/)){AddFunctions(Intelsse2)}Else if(IsProcessorFeaturePresent(PF_XMMI_Instructions_Available/*sse*/){AddFunctions(Intelsse)}}。\n除非禁用PSGP，否则D3DX会选择优化以利用特定指令集的函数。这是有道理的，并与最初的理论联系在一起。事实证明，D3DX具有针对AMD和3DNow而优化的功能！指令集，所以游戏毕竟是间接的利用了这些，用3DNow！删除指令后，现代AMD处理器采用与英特尔处理器相同的代码路径，即intelsse2。\nAMD CPU支持3D Now！采用amd_mmx_3dnow或amd3dnow_amdmmx代码路径，而没有3DNow的CPU采用intelsse2代码路径。\n有了这些信息，我们提出了一个假设-AMD SSE2指令可能有问题，用intelsse2路径在AMD上计算矩阵求逆的结果要么太不准确，要么完全不正确。\n附注：您可能在想-“嗯，游戏使用的是d3dx9_31.dll，但最新的D3DX9库是d3dx9_43.dll，这肯定要在以后的版本中修复？”。我们试图通过“升级”游戏以链接到最新的DLL来验证这一点，但没有任何改变。\n我们编写了一个简单的独立程序来验证矩阵求逆的精度。在“窃听”游戏区的一次简短的游戏会话中，我们将D3DXMatrixInverse的每一次输入和输出记录到一个文件中。后来，该文件被独立的测试程序读取，并再次重新计算结果。为了验证正确性，随后将游戏的输出与测试程序计算的输出进行了比较。\n根据从英特尔和AMD芯片收集的数据进行多次尝试后，在启用/禁用psgp的情况下，我们对机器之间的结果进行了交叉检查，结果如下：✔️表示成功(结果相等)，❌表示失败(结果不相等)。最后一列指示游戏是否处理好此数据或是否出现故障。我们故意不将浮点数学的不精确性带入账户，而是将结果与memcmp进行比较：\n没有SSE2的计算被游戏“接受”，尽管与英特尔SSE2的计算不同。\n这就提出了一个问题--AMD SSE2的计算到底出了什么问题，最终导致游戏出现故障？我们没有确切的答案，但它似乎是两个因素的产物：\nD3DXMatrixInverse的SSE2实现在数值上可能很差-似乎某些SSE2指令在Intel/AMD上给出了不同的结果(可能是不同的舍入模式)，并且该函数的编写方式不能帮助减少不准确性。\n游戏代码的编写方式对准确性问题过于敏感。\n在这一点上，我们准备提出一个修复方案，将D3DXMatrixInverse替换为D3DX函数的x86变体的重写，然后就到此为止。但是，在继续之前，我还有一个随机的想法-D3DX被弃用，并被替换为DirectXMath。我想，既然我们无论如何都要替换那个矩阵函数，我可以尝试用XMMatrixInverse替换它，使其成为D3DXMatrixInverse的“现代”替代。XMMatrixInverse也使用SSE2指令，因此它对D3DX函数应该是同样优化的，但我几乎可以肯定它会以同样的方式中断。\n我们肯定是因为SSE2指令的微小差异而产生的问题，毕竟可能是纯粹的数字问题。尽管也使用了SSE2，XMMatrixInverse在Intel和AMD上都给出了完美的结果。因此，我们重新进行了同样的测试，结果至少可以说是令人惊讶的：\n不仅游戏运行良好，而且结果完全相同，并且可以跨机器传输！\n考虑到这一点，我们修改了这个错误背后的理论-毫无疑问，这款游戏对问题过于敏感是错误的，但随着额外的测试，D3DX似乎在编写时就考虑到了快速数学，而DirectXMath可能更关心精确的计算。这是有道理的-D3DX是21世纪初的产物，它的编写将性能作为主要优先事项是完全合理的。DirectXMath拥有稍后进行工程设计的“奢侈”，因此它可以将更多的注意力放在精确的、确定性的计算上。\n我花了一段时间才到这里，所以我希望你还没有无聊到要死。总而言之，这就是我们所经历的：\n我们验证了这款游戏没有使用3DNow！直接执行指令(仅系统DLL可以)。\n我们模糊了该函数，发现当使用SSE2指令时，它在Intel和AMD CPU之间不能给出一致的结果。\n我们意外地发现XMMatrixInverse没有这个缺陷，是一个可行的替代品。\n剩下的唯一一件事就是实现一个适当的替换！这就是出现用于质量效果的SilentPatch的地方。我们认为解决此问题的最干净的方法是提供替换的d3dx9_31.dll，它将质量效果导出的所有函数转发到系统DLL，但D3DXMatrixInverse除外。对于此函数，我们使用XMMatrixInverse开发了一个替代函数。\n一个替换的DLL使得安装非常干净和防弹，它已经被证实在Origin和Steam版本的游戏中都能很好地工作。它开箱即用，不需要ASI Loader或任何其他第三方软件。\n据我们所知，这款游戏现在看起来完全是它应该的样子，没有任何灯光降级：\n可以在Mods&amp；补丁中下载修改。单击此处直接转到游戏页面：\n下载SilentPatch以获得质量效果下载后，您需要做的就是将存档解压到游戏的目录中，仅此而已！不确定如何继续？检查设置说明。\n对于感兴趣的人，mod的完整源代码已经在giHub上发布，因此可以免费用作参考：请参阅gihub上的源代码。\n从理论上讲，这也可能是d3d9.dll内部的错误，这会使事情变得有点复杂。谢天谢地，情况并非如此。--↩。\n当然，假设它们有SSE2指令集，但任何没有这些指令的英特尔CPU都低于质量效应的最低系统要求。-↩", "note_en": "TL;DR - if you are not interested in an in-depth overview of what was wrong with the game and how it was fixed,scroll down to   Download section for a download link.\n     Mass Effect is a popular franchise of sci-fi roleplaying games. The first game was initially released by BioWare in late 2007 on Xbox 360 exclusively as a part of a publishing deal with Microsoft.A few months later in mid-2008, the game received PC port developed by Demiurge Studios. It was a decent port with no obvious flaws, that is until 2011 when AMD released their new Bulldozer-based CPUs.When playing the game on PCs with modern AMD processors, two areas in the game (Noveria and Ilos) show severe graphical artifacts:\n  While not unplayable, it’s definitely distracting. Thankfully, workarounds exist – such as disabling lighting via console commandsor  modifying the game’s maps to remove broken lights, but seemingly the issue has never been fully understood.Some sources claim that an FPS Counter mod can also fix that issue, but I couldn’t find much information about it and the mod’s sources don’t seem to be available online,and there is no documentation on how the mod tackles this error.\n What makes this issue particularly interesting? Vendor-specific bugs are nothing new, and games have had them for decades. However, to my best knowledge, this is the only case where a graphicalissue is caused by a  processor and not by a graphics card. In the majority of cases, issues happen with a specific vendor of GPU and they don’t care about the CPU, while in this case, it’s the exact opposite.This makes the issue very unique and worth looking into.\n Looking up existing discussions online, this issue seems to affect AMD FX and Ryzen chips. Compared to the older AMD chips, these lack a  3DNow! instruction set.Unrelated or not, the community consensus was that this was the cause of the bug and that the game tried to use those instructions upon detecting an AMD CPU.Given that there are no known cases of this bug occurring on Intel CPU’s and that 3DNow! instructions were exclusive to AMD, it’s no surprise the community assumed that this is the issue.\n Is this really the issue, or is it caused by something entirely different? Let’s find out!\n   Even though the issue is trivial to reproduce, I couldn’t look into it for the longest time for a simple reason – I don’t have access to any PCs with AMD hardware!Thankfully, this time I’m not approaching research alone –  Rafael Rivera got my back during the entire process of R&amp;D,providing a test environment with an AMD chip, insights, ideas as well as putting up with hundreds of blind guesses I usually throw around when trying to find the way to the root of such unknown problems.\n Since we now had a good testing environment, the first theory to test was of course  cpuid – if people are right in assuming that 3DNow! instructions are to blame, there should a place in the game’s codewhere they check for their presence, or at the very least check for the CPU vendor. That reasoning is flawed, though; if it was true that the game attempts to use 3DNow! instructions any time it runs on an AMD chip,without checking if they are supported, the game would most likely crash when trying to execute an illegal instruction. Moreover, a quick scan around the game’s code reveals that the game  doesn’tcheck for CPU capabilities. Therefore, whatever is up with this issue, it doesn’t appear to be caused by the game mis-detecting CPU features, because it seemingly doesn’t care about them in the first place.\n When this started looking like an undebuggable case, Rafael came back to me with a realization – disabling  PSGP (Processor Specific Graphics Pipeline) fixes the issue and the characters are properly lit!PSGP is not the best documented term, but in short, it’s a legacy (concerning only older DirectX versions) feature allowing Direct3D to perform processor-specific optimizations:\n In previous versions of DirectX, there was a path that allowed to do vertex processing called the PSGP. Applications had to take this path into account and support a path for vertex processingon the processor and graphics cores.\n Putting it this way, it makes sense why disabling PSGP fixes artifacts on AMD – the path taken by modern AMD processors may be somehow broken.How to disable it? Two ways come to mind:\n It is possible to pass a  D3DCREATE_DISABLE_PSGP_THREADING flag to  IDirect3D9::CreateDevice. It’s defined as:    Restrict computation to the main application thread. If the flag is not set, the runtime may perform software vertex processing and other computations in worker threadto improve performance on multi-processor systems.\n  Sadly, setting that flag doesn’t fix the issue. Looks like, despite the flag having “PSGP” in name, it’s not what we are looking for.\n  DirectX specifies two registry entries to disable PSGP in D3D and to disable PSGP only for D3DX –  DisablePSGP and  DisableD3DXPSGP. Those flags can be set system-wide or process-wide.For information on how to set them only for a specific process, see  Rafael Rivera’s guide on enabling application-specific Direct3D flags.\n DisableD3DXPSGP appears to be a viable fix for that issue. Therefore, if you have an aversion towards downloading third party fixes/modifications or you must fix this issue without makingany changes to the game, it’s a perfectly fine way of doing it. As long as you set that flag only for Mass Effect and not system-wide, it’s fine!\n  As always with graphical issues, PIX is likely the most useful tool one could use to diagnose them. We captured similar scenes from Intel and AMD hardware and compared the results.One difference was instantly noticeable – unlike with my past projects, where  captures did not carry the bug with them and the same capturewould look different on different PCs (indicating a driver or d3d9.dll bug), these captures carry the bug with them! In other words, a capture from an AMD hardware opened on a PC with Intel hardware does show the bug.\n An AMD capture on Intel looks no different than on the hardware it was taken from:\n   Since PIX does not “take screenshots” but instead captures the sequence of D3D commands and executes them on hardware, we can observe that executing the commands captured from an AMD boxresults in the same bug when executed on Intel.\n  This strongly implies that the difference is not caused by the difference in  how the commands are executed (that’s how you get GPU specific bugs), but  what commands are executed.\n In other words, it’s almost certainly not any sort of a driver bug. Instead, the way inputs for the GPU are prepared seems to be somehow broken  1. That is indeed a very rare occurrence!\n At this point, finding the bug is a matter of finding any jarring differences between captures. It’s tedious, but that’s the only viable way.\n After a long while spent poking the capture, a full body draw call caught my attention:\n  On an Intel capture, this draw outputs most of the character’s body, together with lighting and textures. On an AMD capture, it outputs a plain black model. This looks like a good trail.\n The first obvious candidate for checking would be bound textures, but they seem to be fine and are consistent across captures.However, some of the pixel shader constants looked weird. Not only do they have NaNs (Not a Number), but they also seem to only appear on the AMD capture and not the Intel capture:\n  This looks promising – NaN values causing strange visuals are not unheard of. Funnily enough, a PlayStation 3 version of Mass Effect 2 had a very similar looking issue in RPCS3 which was also related to NaNs!\n However, before we get too excited, those values could just be leftovers from previous draws and they might end up being unused for the current draw.Luckily, in this case it’s clearly visible that those NaNs get submitted to D3D for this specific draw…\n 49652\tIDirect3DDevice9::SetVertexShaderConstantF(230, 0x3017FC90, 4)49653\tIDirect3DDevice9::SetVertexShaderConstantF(234, 0x3017FCD0, 3)49654\tIDirect3DDevice9::SetPixelShaderConstantF(10, 0x3017F9D4, 1) // Submits constant c1049655\tIDirect3DDevice9::SetPixelShaderConstantF(11, 0x3017F9C4, 1) // Submits constant c1149656\tIDirect3DDevice9::SetRenderState(D3DRS_FILLMODE, D3DFILL_SOLID)49657\tIDirect3DDevice9::SetRenderState(D3DRS_CULLMODE, D3DCULL_CW)49658\tIDirect3DDevice9::SetRenderState(D3DRS_DEPTHBIAS, 0.000f)49659\tIDirect3DDevice9::SetRenderState(D3DRS_SLOPESCALEDEPTHBIAS, 0.000f)49660\tIDirect3DDevice9::TestCooperativeLevel()49661\tIDirect3DDevice9::SetIndices(0x296A5770)49662\tIDirect3DDevice9::DrawIndexedPrimitive(D3DPT_TRIANGLELIST, 0, 0, 2225, 0, 3484) // Draws the character model\n   Both constants appear to  come straight from Unreal Engine and judging by the name,they might directly influence the lighting. Bingo!\n A quick in-game test further confirms the theory – on an Intel machine, a vector of 4 NaN values was never submitted as pixel shader constants;meanwhile, on an AMD machine, NaNs would start showing up as soon as the player entered the area where lighting breaks!\n Does it mean work is done? No, far from it, as finding broken constants is only half of the success. The question remains, where do they come from, and can they be replaced?An in-game test replacing NaN values with zeros partially fixed the issue – ugly black blobs disappeared, but characters were still way too dark:\n  Given how important these light values might be for the scene, it’s not feasible to settle with a workaround like this. We know we are on the right track though!\n Sadly, any attempt to track down the origin of these constants pointed towards something resembling a render thread and not the real place of submission.While not undebuggable, it’s clear that we needed to try a fresh approach before potentially spending an infinite amount of time following the data flow between game-specificand/or UE3-specific structures.\n  Taking a step back, we realized that we overlooked something earlier on. Recall that to “fix” the issue, one of two registry entries had to be added –  DisablePSGP and  DisableD3DXPSGP.Assuming their naming is not misleading, then  DisableD3DXPSGP should be a subset of  DisablePSGP, with the former disabling PSGP in D3DX only, and the latter disabling it in both D3DX and D3D.With this assumption, we turned our sights to D3DX.\n   Looking at the list, if I approached it without prior knowledge gained from the captures I would have expected  D3DXPreprocessShader or  D3DXCompileShader to be possible culprits – shaderscould be wrongly optimized and/or compiled on AMD, but fixing that could be insanely challenging.\n However, with our current knowledge one function stands out from this list –  D3DXMatrixInverse is the only function that could reasonably be used to prepare pixel shader constants.\n   It’s… not too well made, though. A quick peek inside  d3dx9_31.dll reveals that  D3DXMatrixInverse does not touch the output parameters and returns  nullptrif matrix inversion fails (due to the input matrix being singular), yet the game doesn’t care about this at all. Output matrix might be left uninitialized, boo!Inverting singular matrices does indeed happen in the game (most frequently in the main menu), but no matter what we did in an attempt to make the game handle them better(e.g. zeroing the output or setting it to an identity matrix), visuals wouldn’t change. Oh well.\n With this theory debunked, we are back to PSGP – what is PSGP doing exactly in D3DX? Rafael Rivera looked into that and the logic behind it turns out to be quite simple:\n AddFunctions ( x86 ) if ( DisablePSGP  ||  DisableD3DXPSGP )  {  // All optimizations turned off }  else  {  if ( IsProcessorFeaturePresent ( PF_3DNOW_INSTRUCTIONS_AVAILABLE ))  {  if (( GetFeatureFlags ()  &amp;  MMX )  &amp;&amp;  ( GetFeatureFlags ()  &amp;  3 DNow ! ))  {  AddFunctions ( amd_mmx_3dnow )  if ( GetFeatureFlags ()  &amp;  Amd3DNowExtensions )  {  AddFunctions ( amd3dnow_amdmmx )  }  }  if ( GetFeatureFlags ()  &amp;  SSE )  {  AddFunctions ( amdsse )  }  }  else  if ( IsProcessorFeaturePresent ( PF_XMMI64_INSTRUCTIONS_AVAILABLE  /* SSE2 */ ))  {  AddFunctions ( intelsse2 )  }  else  if ( IsProcessorFeaturePresent ( PF_XMMI_INSTRUCTIONS_AVAILABLE  /* SSE */ ))  {  AddFunctions ( intelsse )  } }\n Unless PSGP is disabled, D3DX picks functions optimized to make use of a specific instruction set. That makes sense and ties back to the original theory.As it turns out, D3DX has functions optimized for AMD and 3DNow! instruction set, so the game is indirectly making use of those after all.With 3DNow! instructions removed, modern AMD processors take the same code path as Intel processors – that is,  intelsse2.\n  AMD CPUs supporting 3DNow! take a  amd_mmx_3dnow or  amd3dnow_amdmmx code path, while CPUs without 3DNow take an  intelsse2 code path.\n With this information, we put forward a hypothesis –  something is possibly wrong with AMD SSE2 instructions, and the results of matrix inversion calculated on AMD with an  intelsse2 pathare either too inaccurate or completely incorrect.\n  P.S.: You may be thinking – “well, the game uses  d3dx9_31.dll but the newest D3DX9 library is  d3dx9_43.dll, surely that must be fixed in later revisions??”.We tried to verify that by “upgrading” the game to link against the newest DLL – and nothing changed.\n  We prepared a simple, standalone program to verify the precision of matrix inversions. During a short game session in the “bugged” game area, we recorded every input and outputof  D3DXMatrixInverse to a file. Later, this file was read by a standalone test program and the results were recalculated again. To verify correctness, outputs from the game were then comparedwith outputs calculated by the test program.\n After several attempts basing on data collected from Intel and AMD chips and with PSGP enabled/disabled, we cross-checked the results between machines.The results are as follows, ✔️ indicating success (results were equal) and ❌ indicating failure (results were not equal). The last column indicates whether the game handles this data fineor if it glitches out. We deliberately did not take imprecision of floating-point maths into the account and instead compared the results with  memcmp:\n    Calculations without SSE2 are “accepted” by the game despite not being identical to the ones from Intel SSE2.\n This raises a question – what exactly is wrong with calculations from AMD SSE2 so they end up glitching the game?We don’t have a precise answer for that, but it seems to be a product of two factors:\n SSE2 implementation of  D3DXMatrixInverse might be poor numerically – seems like some SSE2 instructions give different results on Intel/AMD (possibly different rounding modes),and the function is not written in a way which would help mitigate the inaccuracies.\n  The game’s code is written in a way that is too sensitive to accuracy issues.\n At this point, we were ready to put forward a fix which would replace  D3DXMatrixInverse with a rewrite of an x86 variation of the D3DX function and call it a day.However, before proceeding I had one more random idea – D3DX is deprecated and got replaced with  DirectXMath.I figured that since we were to replace that matrix function anyway, I could try replacing it with  XMMatrixInverse being a “modern” replacement for  D3DXMatrixInverse. XMMatrixInverse also uses SSE2 instructions so it should be equally optimal to the D3DX function, but I was nearly sure it would break the same way.\n   What we were sure to be an issue coming from tiny differences in SSE2 instructions may have been a purely numerical issue after all. Despite also using SSE2,  XMMatrixInverse gave perfect resultson both Intel and AMD. Therefore, we re-ran the same tests and the results were surprising, to say the least:\n   Not only the game works fine, but results are perfectly identical and transfer across machines!\n With this in mind, we revised the theory behind that bug – without a doubt, the game is at fault for being too sensitive to issues, but with additional tests, it seems likeD3DX may have been written with fast math in mind, while DirectXMath may care more about precise calculations. This makes sense – D3DX is a product of the 2000s and it is perfectly reasonablethat it was written with performance being the main priority. DirectXMath has the “luxury” of being engineered later, so it could put more attention towards precise, deterministic computations.\n  It took a while to get here, so I hope you’re still not bored to death. To summarize, that’s what we went through:\n We verified that the game does not use 3DNow! instructions directly (only the system DLLs do).\n        We fuzzed that function and found out that it does not give consistent results between Intel and AMD CPUs when SSE2 instructions are used.\n  We accidentally found out that  XMMatrixInverse does not have this flaw and is a viable replacement.\n The only thing that’s left is to implement a proper replacement! That’s where  SilentPatch for Mass Effect appears.We have decided that the cleanest way to fix this issue is to provide a replacement  d3dx9_31.dll, which forwards every function exported by Mass Effectto the system DLL, except for  D3DXMatrixInverse. For this function, we have developed a replacement using  XMMatrixInverse.\n A replacement DLL makes for a very clean and bulletproof installation, and it’s been confirmed to work fine with both Origin and Steam versions of the game.It works out of the box, without the need for an ASI Loader or any other third party software.\n To our best knowledge, the game now looks exactly how it should, without any downgrades in the lighting:\n      The modification can be downloaded in  Mods &amp; Patches. Click here to head to the game’s page directly:\n Download SilentPatch for Mass Effect  After downloading, all you need to do is to extract the archive to the game’s directory and that’s it! Not sure how to proceed? Check the  Setup Instructions.\n  For those interested,full source code of the mod has been published on GitHub, so it can be freely used as a point of reference:     See source on GitHub\n In theory, this could also be a bug inside d3d9.dll, which would complicate things a bit. Thankfully, it wasn’t the case.  ↩\n  Of course, assuming they have an SSE2 instruction set, but any Intel CPU not having those instructions falls below the minimum system requirements of Mass Effect.  ↩", "posttime": "2020-07-19 23:42:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "效应,mass,游戏", "title": "将质量效应黑斑固定在现代AMD CPU上", "title_en": "Fixing Mass Effect black blobs on modern AMD CPUs", "transed": 1, "url": "https://cookieplmonster.github.io/2020/07/19/silentpatch-mass-effect/", "via": "", "real_tags": ["效应", "mass", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "2a6a1d401072f6971df678cfa01da47f.png", "infoid": 1012892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但你可能会投资于Twitter！那你是做什么的？这里有一个逐步退出的秘诀。\n第一步是使用此处的说明在您自己的自定义域中设置一份时事通讯(可以选择化名)。你可以在一个小时内完成这项工作，每月的维护费不到30美元。然后只在你的网站上发布帖子，使用你的域名作为一种简单的身份验证形式。\n第二步是开始在你自己的网站上建立你的会员名单。如果您愿意，请帮助我们查看开源工具，以便将您的Twitter关注内容导出到电子邮件列表中，并批量删除任何DM。\n第三步是一起离开Twitter，开始建立一个去中心化的媒体生态系统，将个人域名的主权与社交网络社区结合起来。其中的v1是一个简单的联合RSS订阅源，聚合了多个独立的时事通讯，但我们可以在分散的网络技术上变得更加复杂。事实可能会证明，我们建立的东西有助于Twitter本身的改革，但至少它将提供另一种选择。\n这不仅仅是黑客攻击的问题。Twitter在安全、身份验证、化名、分发、激励和文化方面有几个重叠的问题。\n推特是不安全的。认为个人安全可以弥补集中式网络服务的根本缺陷的想法是错误的：任何获得twitter.com控制权的人都获得了对您账户的控制权。我们已经从2017年的事件和杰克·黑客事件中知道了这一点。但现在，世界上最著名的人和公司(贝佐斯、盖茨、扎克伯格、马斯克、苹果、优步等)都遭到了公开和公开的黑客攻击。明天你可能会成为受害者。与这些有价值的人不同的是，你可能会被悄悄地私下黑掉。也许你已经这么做了。\nTwitter未经过身份验证。信任Twitter的集中验证过程来验证发布到该服务的所有内容是错误的。没有任何数字签名来帮助确定这些消息是否真的来自用户控制的设备，或者是由中央服务器伪造的。\n推特并不完全是化名。在网上到处使用我们的真实姓名是一个错误，特别是在Twitter上。这让我们很容易受到人身和身体的攻击。社交媒体暴徒可能会在网上蜂拥而至你的真实姓名，并在现实生活中注销你。DOXXING会使威胁在肉食空间成为现实，从而增加危险。假名是一个更好的默认选择，特别是现在我们可以用假名赚钱。\n推特是一个分销瓶颈。将我们的分销外包给Twitter是一个错误。推特用户不能完全控制他们的覆盖范围、品牌或货币化。你可以随时被降级或降级，就像你在YouTube和其他集中化平台上所做的那样。拥有自己的电子邮件列表是一个更好的选择。\n推特不会创造财富。让这么多人花这么多时间在一件可以说破坏的财富比创造的财富更多的事情上，这是一个错误。因为默认情况下，你不会在Twitter上创造财富。你可以为Twitter或其链接被流传的媒体公司创造财富，但不能为你自己或他人创造财富。没有与其他用户的经济结合感，没有相互责任感。\n推特把社会变成推特。让Twitter为我们的社会设立激励机制是一个错误。当每个名人都知道怎么做的一件事就是在推特上互相争抢点赞和追随者时，这对这个世界不好。它已经把社会变成了精英们玩的零和地位游戏，产生了真正的后果。每天，蓝色支票都会用越来越耸人听闻的帖子来争夺有限的关注度。有关于什么是流行的即时反馈，但没有关于什么是真实的反馈。经济上的缺乏，实名的存在，有毒的文化，以及用户体验本身都鼓励了持续不断的争斗。\n现在，让我对这些评论进行限定。我个人从Twitter获得了巨大的价值，尽管上面有所有这些观点。毕竟，您只会批评您使用的服务！\n需要说明的是，杰克·多尔西是一位杰出的企业家。我尊重他所做的一切和他建立的团队。创建一家价值数十亿美元的公司是很难的，更不用说两家了。无论是通过他的个人慷慨，还是通过他的创业工具，他都为整个世界做了巨大的好事。我也不希望任何Twitter员工倒霉，因为他们中的许多人都是真正伟大的人，我知道这件事有多难。\n此外，即使在这次黑客攻击之后，Twitter很可能在相当长的一段时间内仍将是一个重要的互联网战场。这太容易了，太方便了。事实可能会证明，无论是什么为了退出Twitter而建造的，最终都会通过他们的去中心化协议与Twitter本身进行交互，即使只是作为一种帮助人们下台的训练轮的形式。希望这能以一种双赢的方式完成，这样Twitter和它的员工就会受到激励，允许人们逐步退出并解决集中服务上的问题。\n但是，我们已经过了开始建设更好的东西的时候了，它保留了Twitter的优点(偶然学到的东西，吸引人的人)，但过滤了缺点。这可能意味着退出我们自己的领域，然后将它们联网成分散的媒体。\n关于这一点，我可能是错的，但我不认为一个更好的Twitter是从一项简单地克隆Twitter的服务开始的，只不过是一个不同的社区。我认为它始于一个独立的(并且可以独立货币化的)域名社区，我们以新颖的方式将这些域名联系在一起，以建立去中心化的媒体。\n为此，逐步退出Twitter的第一步是在自定义域名上建立自己的付费时事通讯(这里有说明)，并限制自己主要在tweet上发布帖子。这确实比写280个字符需要更多的努力！但这就是为什么它很好的原因。努力有助于恢复你的注意力持续时间，并提高平均帖子质量。除了其他好处外，指向您的域的链接还可以作为数字签名的简单替代方案，让人们看到内容是真实的您的内容。\n中期的步骤是开发工具，将你的追随者从Twitter迁移到电子邮件列表，并作为预防措施批量删除所有DM。如果您想为此目的帮助检查一些现有的工具，我们正在努力。\n长期的步骤是通过将这些单独的域编织到一个开源的、分散的媒体生态系统中，开始使用Twitter来解决这些问题。这意味着要解决以下问题：\n至关重要的是，与以往的努力不同，我们的目标将是先建设这个社区，而不是先建设技术。具体地说，一旦我们在他们自己的领域建立了足够的付费时事通讯，我们就可以试验新的分散的网络技术，将他们联系在一起。如果您将您的URL提交到此表单，我们将看看是否可以组成一个社区。我们可能会从一个联合的RSS提要开始，然后变得更加复杂。\n哦，你可以通过将你在Twitter上的名字改为你的URL来表明你对分散的媒体感兴趣，如下所示：\n退出Twitter并建立去中心化的媒体将是一项长期的工程，我们不能保证成功。但这千里之行始于你自己领域的一份时事通讯！所以现在就准备好你的吧。", "note_en": "But you may be invested in Twitter! So what do you do? Here&#39;s one recipe for  gradual exit.\n Step one is to set up an (optionally pseudonymous) newsletter at your  own custom domain using the instructions  here. You can do this in an hour and maintain it for less than $30 per month. Then only tweet out posts from your site, using your domain name as a simple form of authentication.\n Step two is to start building your membership list at your own site. If you want, help us review  open source tools to export your Twitter following to an email list and  mass delete any DMs.\n And step three is to get off Twitter all together, and start building a decentralized media ecosystem that combines the sovereignty of individual domain names with the community of social networking. The v1 of that is a simple joint RSS feed that aggregates multiple independent newsletters, but we can get much more  sophisticated  with  tech  for  the  decentralized  web. It may turn out that what we build helps reform Twitter itself, but at a minimum it will present an alternative.\n   It&#39;s not just the hack. There are several overlapping issues with Twitter around security, authentication, pseudonymity, distribution, incentives, and culture.\n Twitter is insecure. It was a mistake to think that personal security could compensate for the fundamental flaw of centralized web services: anyone who gains control over twitter.com gains control over your account. We knew this already from the  2017 incident and the  Jack Hack. But now the most prominent people and companies in the world (Bezos, Gates, Zuckerberg, Musk, Apple, Uber, among others) have been  openly and publicly hacked. Tomorrow you may be the victim. And unlike these worthies, you may be  silently and  privately hacked. Perhaps you already have been.\n Twitter is not authenticated. It was a mistake to trust Twitter&#39;s centralized verification process to validate everything posted to the service. There weren&#39;t any  digital signatures to help establish whether the messages were really coming from a user-controlled device, or faked by a central server.\n Twitter is not fully pseudonymous. It was a mistake to use our real names everywhere online, particularly on Twitter. It made us vulnerable to personal and physical attacks. Social media mobs can swarm your real name online and cancel you in real life. Doxxing can heighten the danger by making threats  materialize in  meatspace. Pseudonymity is a better default, especially now that we can  earn under a pseudonym.\n Twitter is a distribution chokepoint. It was a mistake to outsource our distribution to Twitter. Twitter users don&#39;t fully control their reach, brand, or monetization. You can be  downranked or  deplatformed at any time, just like you can on YouTube and other centralized platforms. Owning your  own  email  list is a far better alternative.\n Twitter doesn&#39;t create wealth. It was a mistake to have so many people spending so much time on something that  arguably destroys more wealth than it creates. Because by default, you don&#39;t create wealth on Twitter. You may create wealth  for Twitter, or for the media corporations whose links are circulated, but not for yourself or for others. There&#39;s no sense of economic alignment with other users, no sense of mutual obligation.\n Twitter turns society into Twitter. It was a mistake to let Twitter set up the incentives for our society. It&#39;s not good for the world when the one thing every prominent person knows how to do is  fight each other on Twitter for likes and followers. It has converted society into a zero-sum status game played by elites with real consequences. Every day, blue checks compete for a finite pie of attention with ever more sensational posts. There is instant feedback on what is popular, but none on what is true. The lack of economics, the presence of real names, the toxic culture, and the UX itself all encourage constant fighting.\n Now, let me qualify these comments. I personally have gotten  enormous value out of Twitter, despite all the points above. After all, you only critique the services you use!\n And to be clear, Jack Dorsey is a phenomenal entrepreneur. I respect everything he&#39;s done and the team that he&#39;s built. It&#39;s hard to build one multibillion dollar company, let alone  two. He&#39;s done immense good for the world overall, both through his  personal generosity and his startup vehicles. And I also don&#39;t wish any Twitter employee ill, as many of them are truly great people and I know how hard this stuff is.\n Moreover, even after this hack, Twitter will likely continue to be an important internet battlefield for quite sometime. It&#39;s just too easy, too convenient. And it may turn out that whatever is built to exit Twitter will end up interfacing with Twitter itself, via their  decentralized protocol, if only as a form of training wheels to help people get off. Hopefully this can be done in a win-win way, such that Twitter and its employees are incentivized to allow people to gradually exit and fix the issues on the centralized service.\n But it&#39;s past time for us to start building something better, that keeps the good aspects of Twitter (the serendipitous learning, the fascinating  people) but filters the bad. That may mean exiting to our own domains and then networking them into decentralized media.\n   I may be wrong about this, but I don&#39;t think a &#34;better Twitter&#34; starts with a service which is simply a clone of Twitter except with a different community. I think it starts with a community of independent (and independently monetizable) domains that we network together in novel ways, to build  decentralized media.\n Towards this end, the first step in gradually exiting Twitter is to set up your own paid newsletter at a custom domain ( instructions here) and restrict yourself mainly to tweeting out posts. This does require more effort than writing 280 characters! But that&#39;s why it&#39;s good. Effort helps restore your attention span and improves average post quality. And in addition to the other benefits, the link to your domain doubles as a simple alternative to a  digital signature, a way for people to see that the content is authentically yours.\n The medium-term step is to develop  tools to migrate your followers off Twitter to an email list, and to mass delete all DMs as a precautionary step. If you want to help review some existing tools towards this end, we&#39;re working on it  here.\n The long-term step is to start addressing the issues with Twitter by knitting these individual domains together into an open source decentralized media ecosystem. That means addressing:\n  Crucially, unlike past efforts our goal would be to build this  community-first rather than  technology-first. Specifically, once we get enough paid newsletters set up at their own domains, we can experiment with new decentralized web technologies for linking them together. If you submit your URL to  this form, we&#39;ll see if we can form a community. We&#39;ll probably start with a joint  RSS feed and then  get more sophisticated.\n Oh, and you can signal that you&#39;re interested in decentralized media by changing your name on Twitter to your URL, as  follows:\n  Exiting Twitter and building decentralized media will be a long project and we aren&#39;t assured of success. But this journey of a thousand miles begins with a single newsletter at your own domain! So  set yours up now.", "posttime": "2020-07-19 23:41:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "退出,exit,twitter", "title": "如何逐步退出Twitter", "title_en": "How to Gradually Exit Twitter", "transed": 1, "url": "https://balajis.com/how-to-gradually-exit-twitter/", "via": "", "real_tags": ["退出", "exit", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "aff29c702f7437f9d59f31784623a71e.jpeg", "infoid": 1012891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我并不总是测试我的代码，“世界上最有趣的人沉思着，这是有史以来最坚固的技术迷因之一，但当我测试时，我会在生产中测试。\n自从我第一次看到这个表情包，我就一直在嘲笑它。。。2013年？这不仅仅是有趣。太搞笑了！\n从那时起，“在产品中测试”已经成为我们与生产服务互动的所有不负责任的方式的缩写，或者在我们匆忙发货时偷工减料，为此我指责最有趣的人和他不可抗拒的迷因。\n因为，坦率地说，我们所有人都在生产中测试。(至少，优秀的工程师是这样做的。)。这本身并不是坏事，也不是疏忽的表现--对于工程师来说，每天与生产交互，观察他们编写的代码与基础设施和用户以他们永远无法预测的方式交互的方式，实际上是一种不合格的好处。\n在生产中进行测试是一种超级大国。是我们不能承认我们正在做这件事，然后投资于工具和培训来安全地做这件事，这是在扼杀我们。\n测试的核心是通过检查已知故障、过去的故障和可预测的故障(可以说是您的已知未知)来减少不确定性。如果我在特定环境中运行一段确定性代码，我预计结果会以可重复的方式成功或失败，这让我对该环境下的代码充满信心。“Cool。\n当我们说生产时，“我们通常指的是所有这些东西的星座，甚至更多。尽管我们尽了最大努力将EC2实例上的eth0卡上的固件版本等烦人的低级别细节抽象出来，但我在这里要让您失望的是：在不可预测的情况下，您仍然必须关心这些事情。\n如果测试是关于不确定性的，那么您可以“在部署到生产环境的任何时候”进行测试。毕竟，每个部署都是工件、环境、基础设施和一天中的时间的独特且不可复制的组合。当你测试完的时候，它已经改变了\n部署之后，您将不再测试代码，而是测试系统-由用户、代码、环境、基础设施和时间点组成的复杂系统。这些系统具有不可预测的交互，缺乏任何合理的排序，并且会发展出新的属性，这些属性会永久地、永远地违背您进行确定性测试的能力。\n“我不总是测试，但当我测试时，我在生产中测试”这句话似乎暗示您只能做其中之一：在生产之前测试或在生产中测试。但这是错误的二分法。所有负责的团队都会执行这两种测试。\n然而，我们只承认第一种类型的测试，即负责任的“类型”。没有人承认第二点，更不用说谈论我们如何能做得更好、更安全。没有人会在他们的测试中投资生产“工具”。这就是我们做得如此糟糕的原因之一。\n对于我们大多数人来说，世界上最稀缺的资源是工程周期。每当我们选择利用时间做某事时，我们都会含蓄地选择不做数以百计的其他事情。选择把宝贵的时间花在什么上是任何团队都能做的最困难的事情之一。它可以成就一家大公司，也可以毁掉一家大公司。\n作为一个行业，我们在生产系统的工具上系统性投资不足。我们谈论测试的方式和我们实际使用软件的方式完全集中在防止问题进入生产阶段。承认无论我们做什么，都会有一些虫子被刺激，这已经是一个无法言说的现实。正因为如此，我们发现自己缺乏在代码开发的最重要的黄色化阶段理解、观察和严格测试代码的方法。\n让我给你讲个故事。2019年5月，我们决定为整个蜂巢生产基础设施升级Ubuntu。Ubuntu14.04AMI即将失去支持，自从我在2015年第一次建立我们的基础设施以来，它还没有系统地推出过。我们做了所有负责任的事情：我们测试了它，我们写了一个脚本，我们首先把它推广到临时服务器和狗粮服务器。然后我们决定推出它来刺激。事情并没有按计划进行。(他们曾经这样做过吗？)。\n引导数据库仍在运行时，cron作业按小时运行时出现问题。(我们广泛使用自动伸缩组，数据存储节点相互引导。)。结果发现，我们只在一小时的60分钟中有50分钟测试了自举。自然，我们看到的大多数问题都与我们的存储节点有关，因为它们当然是。\n数据在rsync期间过期时出现问题。Rsync在未看到段文件的元数据时死机，反之亦然。在插装、正常重新启动和命名空间方面存在问题。像往常一样。但它们都是负责任地在生产中进行测试的很好的例子\n我们在一个人造环境中做了适量的测试。我们在非生产环境中尽了最大努力。我们建立了安全措施。践行可观测性驱动发展。我们添加了工具，这样我们就可以跟踪进度并发现故障。我们把它铺开，同时用我们的肉眼仔细观察它，看有没有任何不熟悉的行为或可怕的问题。\n在投入生产之前，我们能不能把所有的错误都解决掉呢？不是的。你永远不能保证你已经解决了所有的错误。我们当然可以花更多的时间试图增加我们的信心，即我们已经解决了所有可能的错误，但你很快就达到了回报快速递减的地步。\n我们是个初创公司。初创公司往往不会因为行动太快而失败。他们往往会失败，因为他们痴迷于实际上不能提供商业价值的琐事。重要的是，我们要达到合理的信任级别，处理错误，并拥有多个级别的故障保护(即备份)。\n我们每天都在进行风险管理的实验，往往是在不知不觉中进行的。每一次你决定合并为主要的或部署为生产的时候，你都在承担风险。每次您决定不合并或部署时，您都在承担风险。如果你过于认真地考虑你正在承担的所有风险，它实际上可能会让你陷入瘫痪。\n不部署可能比部署风险小，但事实并非如此。这只是一种不同的风险。您冒着无法运送用户需要或想要的东西的风险；您冒着部署文化迟缓的风险；您可能会输给您的竞争对手。在有限的爆炸半径下，经常和小块地练习危险的东西，比完全避免危险的东西要好。\n组织的风险偏好会有所不同。即使在一个组织内部，也可能存在广泛的风险容忍度。容忍度往往是最低的，而偏执狂往往是最高的，你越接近在磁盘上放置比特，特别是用户数据或计费数据。对于开发人员工具端或离线或无状态服务，容忍度往往更高，在这些服务中，错误不太容易被用户看到或永久存在。许多工程师，如果你问他们，会宣称他们绝对拒绝一切风险。他们满怀激情地认为，任何错误都是多此一举。然而，这些工程师不知何故每天早上都会设法离开家，有时甚至会开车。(太恐怖了！)。风险无处不在，我们要做的每一件事。\n不采取行动的风险不那么明显，但同样致命。当它们被摊销更长的时间或被不同的团队感觉到时，它们只是更难被内部化。好的工程纪律包括强迫自己每天承担很小的风险，并保持良好的实践。\n事实是，分布式系统处于局部退化的持续状态。失败是唯一不变的。现在您的系统上正在以您不知道也可能永远不知道的一百种方式发生故障。纠结于个别错误，充其量只会把你逼到最近的威士忌酒瓶的底部，让你彻夜难眠。只有通过服务级别目标(SLO)和服务级别指标(SLI)接受错误预算，批判性地思考用户可以容忍多少故障，并连接反馈循环以使软件工程师能够从头到尾拥有他们的系统，才能重新获得内心的平静(和良好的睡眠)\n一个系统的弹性不是由它是否没有错误来定义的，而是由它在许多错误中生存的能力来定义的。我们建立对人类和用户更友好的系统，不是通过降低我们对错误的容忍度，而是通过提高容错度。失败并不可怕。失败就是被拥抱，被实践，并成为你的好朋友。\n这意味着我们需要帮助彼此克服对生产系统的恐惧和偏执。你每天都应该忙得不可开交。Prod是您的用户居住的地方。Prod是用户在您的基础架构上与您的代码进行交互的地方。\n因为我们系统性地在生产相关工具上投资不足，我们选择直接禁止人们生产，而不是建造护栏，默认情况下，护栏帮助他们做正确的事情，让他们很难做错误的事情。我们已经将部署工具分配给实习生，而不是我们最高级的工程师。我们已经建造了一座玻璃城堡，在那里我们应该有一个更好的操场。\n我们怎么才能把自己从这个烂摊子里弄出来呢？这个答案有三个方面：技术、文化和管理。\n这是一款仪表盘游戏。在开发和传播有关可观察性和仪表性的合理约定方面，我们落后于我们作为一个行业应该达到的水平，因为我们一直在构建以适应愚蠢数据格式的限制太长时间了。我们必须考虑传播请求的完整上下文并定期发出请求，而不是将检测视为字符串和度量的最后努力。除非工程师能回答这样的问题，否则任何拉取请求都不应该被接受，我如何知道这个请求是否会中断？\n工程师应该随叫随到，获取他们自己的代码。在部署的同时，我们应该条件反射地通过我们仪器的镜头来看待世界。它的工作方式和我们预期的一样吗？有没有什么看起来很奇怪的事？虽然模糊和不精确，但这是你抓住那些危险的未知未知，那些你从未预料到的问题的唯一途径。\n这种对错误采取不健康的零容忍方式最常来自于控制狂的管理压力。管理者需要学会使用错误预算、SLO和SLI的语言，以结果为导向，而不是以灾难性和不可预测的方式潜入低水平的细节。管理层的工作是定下基调(并坚守底线)，即错误和失败是我们的朋友和谦卑的老师，而不是要害怕和避免的东西。冷静点。冷静点。表扬你想看到更多的行为。\n在高水平上分配资源也是管理层的工作。管理者需要认识到，80%的错误是用20%的努力就能捕捉到的，在这之后，你会得到急剧递减的回报。现代软件系统需要在生产前强化方面的投资较少，在生产后恢复能力方面需要更多投资\n在将代码抛出墙外、等待分页、在代码发布时警惕地监视代码、监视工具和主动调整新功能之间有很多时间。根据安全需求、产品需求，甚至团队之间的社会文化差异，都有很大的变化空间。然而，有一点是不变的：现代软件工程师的工作只有在他们看到用户在生产中使用他们的代码之后才能完成。\n我们现在知道，构建高质量系统的唯一方法是投资于软件所有权，让编写服务的工程师一直负责到生产。我们还知道，如果我们大大降低大多数团队遇到的中断和寻呼事件的数量，我们才能期望人们长期待命。弹性与所有权齐头并进，所有权与生活质量齐头并进。三者在良性循环中相辅相成。你不能孤立地工作在一个项目上：在生产中进行实验和测试的健康文化将这三个因素结合在一起。\n从已知的未知中删除一些循环，并将它们分配给未知的未知-真正困难的问题-是闭合循环并建立真正成熟的系统的唯一途径，这些系统为用户提供高质量的服务，并为他们的人力资源投标提供高质量的生活。\n是的，你应该在生产前和生产过程中进行测试。但如果我必须选择-谢天谢地我没有-我会选择在生产中观看我的代码的能力，而不是世界上所有的前期测试。只有一个代表现实。只有一个能给你权力和灵活性来回答任何问题。这就是为什么我会在推特上测试", "note_en": "I don’t always test my code,” muses The Most Interesting Man in the World in one of the sturdiest tech memes of all time,  but when I do, I test in production.\n I’ve been laughing at that meme since I first saw it back in . . . 2013? It’s more than funny. It’s hilarious!\n Since then,  test in prod” has become shorthand for all the irresponsible ways we interact with production services or cut corners in our rush to ship, and for this I blame The Most Interesting Man and his irresistible meme\n Because, frankly, all of us test in production all the time. (At least, the good engineers do.) It’s not inherently bad or a sign of negligence —it’s actually an unqualified good for engineers to be interacting with production on a daily basis, observing the code they wrote as it interacts with infrastructure and users in ways they could never have predicted\n Testing in production is a superpower. It’s our inability to acknowledge that we’re doing it, and then invest in the tooling and training to do it safely, that’s killing us\n At its core, testing is about reducing uncertainty by checking for known failures, past failures, and predictable failures —your known unknowns, as it were. If I run a piece of deterministic code in a particular environment, I expect the result to succeed or fail in a repeatable way, and this gives me confidence in that code for that environment. Cool\n    When we say  production,” we typically mean the constellation of all these things and more. Despite our best efforts to abstract away such pesky low-level details as the firmware version on your eth0 card on an  EC2 instance, I’m here to disappoint: You’ll still have to care about those things on unpredictable occasions\n And if testing is about uncertainty, you  test” any time you deploy to production. Every deploy, after all, is a unique and never-to-be-replicated combination of artifact, environment, infra, and time of day. By the time you’ve tested, it has changed\n Once you deploy, you aren’t testing code anymore, you’re testing systems —complex systems made up of users, code, environment, infrastructure, and a point in time. These systems have unpredictable interactions, lack any sane ordering, and develop emergent properties which perpetually and eternally defy your ability to deterministically test\n  The phrase  I don’t always test, but when I do, I test in production” seems to insinuate that you can only do one or the other: test before production or test in production. But that’s a false dichotomy. All responsible teams perform both kinds of tests\n Yet we only confess to the first type of testing, the  responsible” type. Nobody admits to the second, much less talks about how we could do it better and more safely. Nobody invests in their  test in prod” tooling. And that’s one reason we do it so poorly\n For most of us, the scarcest resource in the world is engineering cycles. Any time we choose to do something with our time, we implicitly choose not to do hundreds of other things. Selecting what to spend our precious time on is one of the most difficult things any team can do. It can make or break a company\n As an industry, we’ve systematically underinvested in tooling for production systems. The way we talk about testing and the way we actually work with software has centered exclusively on preventing problems from ever reaching production. Admitting that some bugs will make it to prod no matter what we do has been an unspeakable reality. Because of this, we find ourselves starved of ways to understand, observe, and rigorously test our code in its most important, luteal phase of development\n  Let me tell you a story. In May 2019, we decided to upgrade Ubuntu for the entire Honeycomb production infrastructure. The Ubuntu 14.04  AMI was about to age out of support, and it hadn’t been systematically rolled out since I first set up our infra way back in 2015. We did all the responsible things: We tested it, we wrote a script, we rolled it out to staging and dogfood servers first. Then we decided to roll it out to prod. Things did not go as planned. (Do they ever?)\n There was an issue with cron jobs running on the hour while the bootstrap was still running. (We make extensive use of auto-scaling groups, and our data storage nodes bootstrap from one another.) Turns out, we had only tested bootstrapping during 50 out of the 60 minutes of the hour. Naturally, most of the problems we saw were with our storage nodes, because of course they were\n There were issues with data expiring while rsync-ing over. Rsync panicked when it did not see metadata for segment files, and vice versa. There were issues around instrumentation, graceful restarts, and namespacing. The usual. But they are all great examples of responsibly testing in prod\n We did the appropriate amount of testing in a faux environment. We did as much as we could in nonproduction environments. We built in safeguards. We practiced observability-driven development. We added instrumentation so we could track progress and spot failures. And we rolled it out while watching it closely with our human eyes for any unfamiliar behavior or scary problems\n Could we have ironed out all the bugs before running it in prod? No. You can never, ever guarantee that you have ironed out all the bugs. We certainly could have spent a lot more time trying to increase our confidence that we had ironed out all possible bugs, but you quickly reach a point of fast-diminishing returns\n We’re a startup. Startups don’t tend to fail because they moved too fast. They tend to fail because they obsess over trivialities that don’t actually provide business value. It was important that we reach a reasonable level of confidence, handle errors, and have multiple levels of fail-safes ( i.e., backups)\n  We conduct experiments in risk management every single day, often unconsciously. Every time you decide to merge to master or deploy to prod, you’re taking a risk. Every time you decide not to merge or deploy, you’re taking a risk. And if you think too hard about all the risks you’re taking, it can actually be paralyzing\n It can feel less risky to not deploy than to deploy, but that’s just not the case. It’s simply a different kind of risk. You risk not shipping things your users need or want; you risk a sluggish deploy culture; you risk losing to your competition. It’s better to practice risky things often and in small chunks, with a limited blast radius, than to avoid risky things altogether\n  Organizations will differ in their appetite for risk. And even within an organization, there may be a wide range of tolerances for risk. Tolerance tends to be lowest and paranoia highest the closer you get to laying bits down on disk, especially user data or billing data. Tolerance tends to be higher toward the developer tools side or with offline or stateless services, where mistakes are less user-visible or permanent. Many engineers, if you ask them, will declare their absolute rejection of all risk. They passionately believe that any error is one too many. Yet these engineers somehow manage to leave the house each morning and sometimes even drive cars. (The horror!) Risk pervades everything that we do\n The risks of not acting are less visible, but no less deadly. They’re simply harder to internalize when they are amortized over longer periods of time or felt by different teams. Good engineering discipline consists of forcing oneself to take little risks every day and keep in good practice\n  The fact is, distributed systems exist in a continual state of partial degradation. Failure is the only constant. Failure is happening on your systems right now in a hundred ways you aren’t aware of and may never learn about. Obsessing over individual errors will, at best, drive you to the bottom of the nearest whiskey bottle and keep you up all night. Peace of mind (and a good night’s sleep) can only be regained by embracing error budgets via service-level objectives ( SLOs) and service-level indicators ( SLIs), thinking critically about how much failure users can tolerate, and hooking up feedback loops to empower software engineers to own their systems from end to end\n A system’s resilience is not defined by its lack of errors; it’s defined by its ability to survive many, many, many errors. We build systems that are friendlier to humans and users alike not by decreasing our tolerance for errors, but by increasing it. Failure is not to be feared. Failure is to be embraced, practiced, and made your good friend\n This means we need to help each other get over our fear and paranoia around production systems. You should be up to your elbows in prod every single day. Prod is where your users live. Prod is where users interact with your code on your infrastructure\n And because we’ve systematically underinvested in prod-related tooling, we’ve chosen to bar people from prod outright rather than build guardrails that by default help them do the right thing and make it hard to do the wrong thing. We’ve assigned deploy tooling to interns, not to our most senior engineers. We’ve built a glass castle where we ought to have a playground\n  How do we get ourselves out of this mess? There are three aspects to this answer: technical, cultural, and managerial\n  This is an instrumentation game. We’re behind where we ought to be as an industry when it comes to developing and propagating sane conventions around observability and instrumentation because we’ve been building to fit the strictures of stupid data formats for too long. Instead of seeing instrumentation as a last-ditch effort of strings and metrics, we must think about propagating the full context of a request and emitting it at regular pulses. No pull request should ever be accepted unless the engineer can answer the question,  How will I know if this breaks?\n  Engineers should be on call for their own code. While deploying, we should reflexively be looking at the world through the lens of our instrumentation. Is it working the way we expected it to? Does anything seem weird? Though fuzzy and imprecise, it’s the only way you’re going to catch those perilous unknown unknowns, the problems you never knew to expect\n   This unhealthy zero-tolerance approach to errors comes most often from control-freak management pressures. Managers need to learn to speak the language of error budgets,  SLOs, and  SLIs, to be outcome-oriented rather than diving into low-level details in a catastrophic and unpredictable way. It’s management’s job to set the tone (and hold the line) that errors and failure are our friends and humble teachers, not something to fear and avoid. Be calm. Chill out. Praise the behaviors you want to see more of\n It’s also management’s job to allocate resources at a high level. Managers need to recognize that 80 percent of the bugs are caught with 20 percent of the effort, and after that you get sharply diminishing returns. Modern software systems need less investment in pre-prod hardening and more investment in post-prod resiliency\n There’s a lot of daylight between just throwing your code over the wall and waiting to get paged and having alert eyes on your code as it’s shipped, watching your instrumentation, and actively flexing the new features. There’s plenty of room for variation according to security needs, product requirements, and even sociocultural differences between teams. The one constant, however, is this: A modern software engineer’s job is not done until they have watched users use their code in production\n We now know that the only way to build high-quality systems is to invest in software ownership, making engineers who write services responsible for them all the way up to production. We also know that we can only expect people to be on call for the long run if we vastly pay down the amount of interruptions and paging incidents that most teams encounter. Resiliency goes hand in hand with ownership, which goes hand in hand with quality of life. All three reinforce each other in a virtuous cycle. You cannot work on one in isolation: A healthy culture of experimentation and testing in production pulls together all three\n Removing some cycles from the known unknowns and allocating them to the unknown unknowns —the really, truly hard problems —is the only way to close the loop and build truly mature systems that offer a high quality of service to users and a high quality of life to their human tenders\n Yes, you should test before and in prod. But if I had to choose —and thankfully I do not —I would choose the ability to watch my code in production over all the pre-prod testing in the world. Only one represents reality. Only one gives you the power and flexibility to answer any question. That’s why I test in prod", "posttime": "2020-07-19 23:19:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品,test,生产", "title": "我在产品中测试(2019年)", "title_en": "I Test in Prod (2019)", "transed": 1, "url": "https://increment.com/testing/i-test-in-production/", "via": "", "real_tags": ["产品", "test", "生产"]}, {"category": "", "categoryclass": "", "imagename": "c3cbf3225a0fb09287827ebcd5403933.jpg", "infoid": 1012890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大黄蜂是一种显微镜大小的黄蜂。它长20000μm(​1⁄5 mm；​1⁄125英寸)，是现存的第三小昆虫，[1]大小可与单细胞生物体相媲美。它的神经系统高度缩小，只有7400个神经元，比大型昆虫少几个数量级(例如，一只蜜蜂大约有85万个神经元)。这是所有昆虫和所有飞行动物中已知的最小数量的神经元。成年时的平均寿命为5天。[2]。\n1920年1月，在夏威夷收集了一种与蓟马有关的未知昆虫的标本，怀疑它们是卵寄生虫。1924年，菲利普·亨特·汀布莱克(Philip Hunter Timberlake)将这些昆虫描述为一个新种和一个新属。1927年3月29日，在一个巴豆属植物的叶片上再次发现了具蓟马的M.mymaripenne标本。1930年5月10日，在蓟马和蓟马卵附近发现标本，并在蓟马卵内发现成熟蛹。到1930年为止，该属被认为不是夏威夷的原产植物。[3]。\n神经系统是限制身体缩小的主要因素之一。整个中枢神经系统构成了mymaripenne身体质量的6%，而大脑本身则占到了2.9%。在黄蜂的7400个神经元中，有4600个位于大脑。其他科的小昆虫经常通过将大脑移到胸腔甚至腹部来处理大脑相对于头部大小的问题。然而，黄蜂不能保持头部的灵活性，头部与胸部的连接相对有限。[2]。\n独一无二的是，当美洲斑潜蝇成年时，其95%的神经细胞已经失去了它们的细胞核。中枢神经系统中只有339-372个细胞核，其中179-253个在大脑中。美洲斑潜蝇蛹的神经系统占其体重的19%，其中11%是大脑。与成虫不同，蛹中的细胞有细胞核。只有在发育的最后阶段，这些细胞才会发生溶解，这会大大减少神经系统的体积。蛹的大脑为93,600μm3，成虫的大脑仅为52,200μm3。伴随着脑体积的缩小，头部枕区缩小，角质层折叠成螺旋状。[2]研究人员认为，黄蜂可以在没有细胞核的情况下生存，因为它的寿命很短；在蛹阶段产生的蛋白质可以维持动物足够长的时间来完成它的生命旅程。[4]。\n尽管成年黄蜂的神经系统减少了，但它们仍然具有飞行、取食和定位产卵宿主的能力。[2]黄蜂卵沉积在蓟马的卵中。[1]为了浮出水面，黄蜂在卵上切开了一个80-90μm的近圆形洞。[3]。\n^a b yong，Ed.。小黄蜂是如何应付比变形虫还小的情况的。探索杂志。\n^a b c d Polilov，Alexey A(2012年1月)。最小的昆虫进化出无核神经元。节肢动物结构与发展。41(1)：29-34。Doi：10.1016/j.asd.2011.09.001。PMID为22078364。\n^a b Pemberton，C E(1931年4月)。夏威夷蓟马的卵寄生虫(PDF)。夏威夷昆虫学会论文集。VII(3)：481-482\n^Bob Yirka(2011年12月1日)。昆虫学家首次在仙蜂身上发现了没有细胞核的完整神经元。PhysOrg.com。", "note_en": "Megaphragma mymaripenne is a microscopically sized  wasp. At 200  μm (​  1⁄ 5 mm; ​  1⁄ 125 inch) in length, it is the third- smallest extant insect,  [1] comparable in size to  single-celled organisms. It has a highly reduced  nervous system, containing only 7,400  neurons, several orders of magnitude fewer than in larger  insects (for example, a  honey bee has about 850,000). This is the smallest known number of neurons in all insects and in all flying animals. Its average lifespan at adulthood is 5 days.  [2]\n In January 1920, specimens of an unknown insect were collected in  Hawaii associated with  thrips, to which they were suspected to be egg parasites. The insects were described as a new species and genus  Megaphragma mymaripenne, in 1924 by  Philip Hunter Timberlake.  M. mymaripenne specimens were next found on 29 March 1927, again with thrips, on the leaf of a genus   Croton plant. On 10 May 1930, specimens were found near thrips and thrips eggs, and mature  pupae were found inside the thrips eggs. As of 1930, the genus was not thought to be native to Hawaii.  [3]\n Nervous systems are one of the principal factors that limit shrinking body size. The entire  central nervous system forms 6% of the body mass of  M. mymaripenne, and the brain itself makes up 2.9%. Of the wasp&#39;s 7,400 neurons, 4,600 are located in the brain. A small insect from other families often deals with the issue of having a large brain in relation to its head size by shifting its brain into its thorax and even abdomen. However, wasps cannot, as to keep their heads flexible, the head&#39;s connection to the thorax is relatively limited.  [2]\n Uniquely, by the time  M. mymaripenne reaches adulthood, 95% of its nervous cells have lost their nuclei. Only 339–372 nuclei are found throughout the central nervous system, of which 179–253 are found in the brain. The nervous system of the pupae of  M. mymaripenne makes up 19% of its body mass, 11% of which is the brain. Unlike in adults, cells in the pupae have nuclei. Only in the final stage of development do these undergo  lysis, which greatly reduces the volume of the nervous system. While the brains of pupae are 93,600 μm 3, those of the adults are only 52,200 μm 3. Accompanying this shrinkage of brain volume is a shrinking of the  occipital area of the head, with the  cuticle folding into helical spirals.  [2] Researchers believe the wasp can survive without nuclei because of its short lifespan; the proteins manufactured during the  pupal stage last the animal long enough to complete its life journey.   [4]\n Despite their reduced nervous systems, adult wasps retain the ability to fly, to feed, and to locate hosts in which to lay their eggs.  [2] The wasp eggs are deposited in the eggs of  thrips.  [1] To emerge, the wasps cut an 80-90 μm near-circular hole in the eggs.  [3]\n  ^     a     b   Yong, Ed.  &#34;How tiny wasps cope with being smaller than amoebas&#34;. Discover Magazine .\n ^     a     b     c     d   Polilov, Alexey A (January 2012). &#34;The smallest insects evolve anucleate neurons&#34;.  Arthropod Structure &amp; Development.  41 (1): 29–34.  doi: 10.1016/j.asd.2011.09.001.  PMID  22078364.\n ^     a     b   Pemberton, C E (April 1931).  &#34;An Egg Parasite of Thrips in Hawaii&#34;  (PDF).  Proceedings of the Hawaiian Entomological Society.  VII (3): 481–482.\n ^   Bob Yirka (December 1, 2011).  &#34;Entomologists discover first instance of intact neurons without nucleus - in fairy wasps&#34;. PhysOrg.com .", "posttime": "2020-07-19 23:18:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "megaphaphma,megaphragma,黄蜂", "title": "大红豆杉(Megaphaphma Mymaripenne)", "title_en": "Megaphragma mymaripenne", "transed": 1, "url": "https://en.wikipedia.org/wiki/Megaphragma_mymaripenne", "via": "", "real_tags": ["黄蜂"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于许多成年人来说，宜家就像一个游乐场。这家家具零售商销售数以千计的物品，由顾客在家里组装，每一件物品-从床和床头柜到书架和书桌-都遵循同样干净、现代的设计。对于购物者来说，在它的过道上来回穿梭本身就是一种冒险，因为一个人的想象力可以接管你能建造的所有东西。许多商店都有餐厅，甚至有托儿所，让成年人可以花一天的大部分时间逛街(最终是消费)。哦，而且自己制造的模式也使他们的产品比替代产品便宜一点。\n因此，该公司在过去20年中取得了巨大的成功。今天，宜家的规模非常巨大-它拥有20多万名员工，在50多个国家拥有400多家门店，2019年的收入超过400亿美元。它的商店也是如此。据估计，宜家平均占地30万平方英尺(约2.7万平方米)，大约相当于5个足球场或4个足球场的大小。有这么大的空间，这么多过道，还有那么多成年人想要度过一个有趣的下午，宜家看起来是个玩捉迷藏的好地方，对吧？\n这些问题始于2014年夏天。据彭博社(Bloomberg)报道，那一轮充满活力的儿童游戏吸引了数百人来到比利时宜家(Ikea)的一家门店，一开始，宜家不仅对此没有意见，而且他们还帮忙解决了问题。正如Fast Company解释的那样，“一位名叫Elise de Rijck的比利时博客作者在她当地的Wilrijk商店协调了一场捉迷藏聚会，以庆祝她的30岁生日。她创建了一个Facebook群，并邀请了她的朋友-但很快，成千上万的人加入了这个群。宜家比利时得到了这一计划的风声，而不是压制它，而是提供了宜家的全力支持，包括增派工作人员和安保人员来举办这场活动。参与者几乎无处不在；据彭博社报道，“人们躲在冰箱里，毛绒玩具下面，宜家的蓝色购物袋下面，甚至床下的储藏室里。”\n但是，虽然宜家认为这是一次愚蠢的一次性活动，但其他捉迷藏的粉丝希望有机会。这家商店的其他粉丝开始通过Facebook组织大型比赛，人数与大型体育赛事的上座率不相上下。据“时代”周刊报道，2015年初，“有3.2万人在埃因霍温注册了Facebook活动；在阿姆斯特丹注册了1.9万人；在乌得勒支注册了1.2万人。”有关计划中活动的消息广为传播，RSVP的数量证明了这一点，宜家高管注意到了这一点，并采取了行动。与Facebook合作，宜家取消了这些活动，有效地结束了数以千计的隐藏者和寻求者的梦想。\n今天，宜家的政策很明确-你不能在它的门店里玩捉迷藏。虽然宜家管理层可能不会因为你9岁的孩子躲在床罩下而逮捕他，但如果他们听到有大型比赛正在组织的风声，他们肯定会报警。2019年，躲藏者和搜索者试图在格拉斯哥开始一场3000人的游戏，但最终发现了他们意想不到的五名搜索者-警察。据“纽约邮报”报道，“8月31日，五名警察在这家商店待了一整天，以判断人们是在浏览一张便宜的桌子，还是真的在寻找完美的藏身地点。”据“华盛顿邮报”报道，没有人被捕。\n额外的事实：宜家的产品名称是瑞典语，有时会出错。2004年，该零售商为儿童推出了一款新的工作台，但你再也找不到他们的目录上的产品了。这张桌子是以瑞典语“速度”或“全速”命名的，不幸的是，它变成了“FartFull”。", "note_en": "For many adults, IKEA is like a playground. The furniture retailer sells thousands of items designed to be assembled at home by the customer, and each item — from beds and nightstands to bookshelves and desks — follows the same, clean, modern design. For shoppers, going up and down its aisles can be an adventure in its own right, as one’s imagination can take over with all the things you can build. Many stores have restaurants and even day cares, allowing adults to spend the better part of a day browsing (and ultimately, spending). Oh, and the build-it-yourself model also makes their products a little less expensive than the alternative.\n As a result, the company has seen significant success over the last two decades. Today, IKEA is enormous — it employs more than 200,000 people, has more than 400 stores in more than fifty countries, and did more than $40 billion in revenue in 2019. And so is its stores.  Per some estimates, an average IKEA runs 300,000 square feet (about 27,000 square meters), or about the size of five football fields or four soccer pitches. And with all that space, and all those aisle, and all those grown-ups looking to have a fun afternoon anyway, IKEA seems like a great place to play hide-and-seek, right?\n   The problems started in the summer of 2014.  According to Bloomberg, “a spirited round of the children’s game attracted hundreds of people to a Belgian Ikea outlet” that year, and at first, IKEA was not only okay with it, but they helped out. As Fast Company  explains, “a Belgian blogger named Elise De Rijck coordinated a hide-and-seek meet-up at her local Wilrijk store to celebrate her 30th birthday. She created a Facebook group and invited her friends—but soon, thousands of people had joined the group. Ikea Belgium got wind of the plan and instead of squashing it, offered Ikea’s full support, including extra staff and security to host the event.” Participants hid virtually eveywhere; per Bloomberg, “people were hiding in fridges, under stuffed toys, under Ikea’s blue shopping bags and even in the storage space under beds.”\n But while IKEA saw this as a silly one-time event, other hide-and-seek fans wanted their chance. Other fans of the store began organizing massive games via Facebook, with numbers rivaling attendance at major sporting events. As Time  reported, in early 2015, “32,000 people signed up for a Facebook event in Eindhoven; 19,000 in Amsterdam; and 12,000 in Utrecht.”  News of the planned events spread widely, as evidenced by the number of RSVPs, and IKEA execs took notice — and action. Working with Facebook, IKEA had the events removed, effectively ending the dreams of the thousands of hiders and seekers.\n Today, IKEA’s policy is clear — you can’t play hide-and-seek in its stores. While IKEA management probably won’t arrest your nine-year-old for ducking under some bed covers, they’ll definitely call the police if they get wind of a massive game being organized. In 2019, hiders and seekers tried to start a 3,000 person game in Glasgow, but ended up five seekers they weren’t counting on — the police.  Per the New York Post, “five cops stayed at the shop for the entire day on Aug. 31 to gauge whether folks were browsing for a cheap desk — or actually hunting the perfect spot to hide.” Per the Post, no one was arrested.\n Bonus fact: IKEA’s product names are in Swedish, and sometimes, that goes wrong. In 2004, the retailer introduced a new workbench for children, but you won’t find the product on their catalog any longer. The desk was named for the Swedish phrase for “speedy” or “full speed,” which, unfortunately,  became “FartFull.”", "posttime": "2020-07-19 23:18:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宜家,不能,ikea", "title": "在宜家有一件事是不能做的", "title_en": "The One Thing You Can’t Do in IKEA", "transed": 1, "url": "http://nowiknow.com/the-one-thing-you-cant-do-in-ikea/", "via": "", "real_tags": ["宜家", "不能", "ikea"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust的模块系统出人意料地令人困惑，给初学者带来了很多挫败感。\n在这篇文章中，我将用实际的例子解释模块系统，这样你就可以清楚地了解它是如何工作的，并可以立即开始在你的项目中应用它。\n由于Rust的模块系统非常独特，我请求读者以开放的心态阅读这篇文章，不要将其与其他语言中模块的工作方式进行比较。\nMy_project├──cargo.toml└─┬src├──main.rs├──config.rs├─┬Routs│├──│└──_route.rs└─┬_route.rs└──Models User_Model.rs。\n这3个例子应该足以解释Rust的模块系统是如何工作的。\n每个人都会犯的第一个错误是因为我们有config.rs、Health_route.rs等文件，我们认为这些文件是模块，我们可以从其他文件导入它们。\n下面是我们看到的(文件系统树)和编译器看到的(模块树)：\n令人惊讶的是，编译器只看到板条箱模块，这是我们的main.rs文件。这是因为我们需要在Rust中显式构建模块树-文件系统树到模块树之间没有隐式映射。\n我们需要在Rust中显式构建模块树，没有隐式映射到文件系统。\n要将文件添加到模块树中，我们需要使用mod关键字将该文件声明为子模块。下一件让人困惑的事情是，您会认为我们将文件声明为同一文件中的模块。但是我们需要在另一个文件中声明这一点！因为我们在模块树中只有main.rs，所以让我们将config.rs声明为main.rs中的子模块。\nMy_project├──cargo.toml└─┬src├──main.rs└──my_mode.rsormy_project├──cargo.toml└─┬src├──main.rs└─┬my_module└──mod.rs。\n由于main.rs和config.rs位于同一目录中，因此我们按如下方式声明config模块：\n我们已经成功声明了配置模块！但这还不足以调用config.rs内的print_config函数。默认情况下，Rust中的几乎所有内容都是私有的，我们需要使用关键字pub将函数设置为公共的：\n现在，这起作用了。我们已经成功地调用了在不同文件中定义的函数！\n如前所述，我们只能对同一目录中的my_module e.rs或my_module/mod.rs使用mod关键字。\n因此，为了从main.rs调用routes/Health_route.rs内的函数，我们需要执行以下操作：\nMy_├──货物.toml└─┬src├──main.rs├──config.rs├─┬Routs+│├──mod.rs│├──│└──_route.rs└─┬Models└──User_Model.rs。\n让我们进行与前面相同的更改-声明子模块、使函数成为公共函数并添加mod.rs文件。\nMy_├──货物.toml└─┬src├──main.rs├──config.rs├─┬Routs│├──mod.rs│├──│└──_route.rs└─┬User_route.rs├──Model.rs└──User_Model.rs。\n等等，我们还没有真正从print_user_route调用print_user_model！到目前为止，我们只从main.rs调用了其他模块中定义的函数，如何从其他文件调用这些函数呢？\n如果我们查看我们的模块树，则print_user_model函数位于crate：：model：：user_model路径中。因此，为了在不是main.rs的文件中使用模块，我们应该考虑到达模块树中该模块所需的路径。\n我们已经成功地从非main.rs的文件中调用了在文件中定义的函数。\n如果我们的文件组织是多个目录深度的，则完全限定名会变得太长。比方说，无论出于什么原因，我们都想从print_user_route调用print_Health_route。它们分别位于路径CARATE：：ROUES：：Health_ROUTE和CARATE：：ROUES：：USER_ROUTE下。\n我们可以使用完全限定名crate：：routes：：health_route：：print_health_route()来调用它，但是我们也可以使用相对路径SUPERR：：HANTONALY_ROUTE：：PRINT_HANTONALY_ROUTE()；。请注意，我们已经使用SUPER来引用父作用域。\n在上面的示例中使用完全限定名甚至相对名称会很繁琐。为了缩短名称，我们可以使用USE关键字将路径绑定到新名称或别名。\n添加到Cargo.toml的依赖项对项目内的所有模块全局可用。使用依赖项不需要显式导入或声明任何内容。\n例如，假设我们将兰特板条箱添加到项目中。我们可以在代码中直接使用它，如下所示：\n模块系统是显式的-与文件系统没有1：1的映射。\n我们需要显式地将函数、结构等声明为公共函数，以便可以在其他模块中使用它们。\n谢谢你的阅读！请随时在推特上关注我，获得更多这样的帖子：)。\n在Github、Twitter或LinkedIn上找到我。请随时通过sheshbabu[at]gmail.com与我联系", "note_en": "Rust’s module system is surprisingly confusing and causes a lot of frustration for beginners.\n In this post, I’ll explain the module system using practical examples so you get a clear understanding of how it works and can immediately start applying this in your projects.\n Since Rust’s module system is quite unique, I request the reader to read this post with an open mind and resist comparing it with how modules work in other languages.\n  my_project├── Cargo.toml└─┬ src ├── main.rs ├── config.rs ├─┬ routes │ ├── health_route.rs │ └── user_route.rs └─┬ models └── user_model.rs\n   These 3 examples should be sufficient to explain how Rust’s module system works.\n     The first mistake that everyone makes is just because we have files like  config.rs,  health_route.rs etc, we think that these files are  modules and we can import them from other files.\n Here’s what we see (file system tree) and what the compiler sees (module tree):\n  Surprisingly, the compiler only sees the  crate module which is our  main.rs file. This is because we need to explicitly build the module tree in Rust - there’s no implicit mapping between file system tree to module tree.\n We need to explicitly build the module tree in Rust, there’s no implicit mapping to file system\n To add a file to the module tree, we need to declare that file as a submodule using the  mod keyword. The next thing that confuses people is that you would assume we declare a file as module in the same file. But we need to declare this in a different file! Since we only have  main.rs in the module tree, let’s declare  config.rs as a submodule in  main.rs.\n     my_project├── Cargo.toml└─┬ src ├── main.rs └── my_module.rsormy_project├── Cargo.toml└─┬ src ├── main.rs └─┬ my_module └── mod.rs\n Since  main.rs and  config.rs are in the same directory, let’s declare the config module as follows:\n      We’ve successfully declared the  config module! But this is not sufficient to be able to call the  print_config function inside  config.rs. Almost everything in Rust is private by default, we need to make the function public using the  pub keyword:\n    Now, this works. We’ve successfully called a function defined in a different file!\n     As we discussed earlier, we can use the  mod keyword only for  my_module.rs or  my_module/mod.rs in the same directory.\n So in order to call functions inside  routes/health_route.rs from  main.rs, we need to do the following things:\n  my_project├── Cargo.toml└─┬ src ├── main.rs ├── config.rs ├─┬ routes + │ ├── mod.rs │ ├── health_route.rs │ └── user_route.rs └─┬ models └── user_model.rs\n             Let’s make the same changes as before - declaring submodules, making functions public and adding the  mod.rs file.\n my_project├── Cargo.toml└─┬ src ├── main.rs ├── config.rs ├─┬ routes │ ├── mod.rs │ ├── health_route.rs │ └── user_route.rs └─┬ models + ├── mod.rs └── user_model.rs\n        Wait, we haven’t actually called  print_user_model from  print_user_route! So far, we’ve only called the functions defined in other modules from  main.rs, how do we do that from other files?\n If we look at our module tree, the  print_user_model function sits in the  crate::models::user_model path. So in order to use a module in files that are not  main.rs, we should think in terms of the path necessary to reach that module in the module tree.\n  We’ve successfully called a function defined in a file from a file that’s not  main.rs.\n  The fully qualified name gets too lengthy if our file organization is multiple directories deep. Let’s say for whatever reason, we want to call  print_health_route from  print_user_route. These are under the paths  crate::routes::health_route and  crate::routes::user_route respectively.\n We can call it by using the fully qualified name  crate::routes::health_route::print_health_route() but we can also use a relative path  super::health_route::print_health_route();. Notice that we’ve used  super to refer to the parent scope.\n    It would be tedious to use the fully qualified name or even the relative name in the above examples. In order to shorten the names, we can use the  use keyword to bind the path to a new name or alias.\n        Dependencies added to  Cargo.toml are available globally to all modules inside the project. We don’t need to explicitly import or declare anything to use a dependency.\n  For example, let’s say we added the  rand crate to our project. We can use it in our code directly as:\n     The module system is explicit - there’s no 1:1 mapping with file system\n   We need to explicitly declare functions, structs etc as public so they can be consumed in other modules\n Thanks for reading! Feel free to follow me in  Twitter for more posts like this :)\n Find me in  Github ,  Twitter  or  LinkedIn .  Feel free to contact me at sheshbabu [at] gmail.com", "posttime": "2020-07-19 22:54:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈,explanation,模块", "title": "清晰解释铁锈的模块系统", "title_en": "Clear explanation of Rust’s module system", "transed": 1, "url": "http://www.sheshbabu.com/posts/rust-module-system/", "via": "", "real_tags": ["rust", "铁锈", "模块"]}, {"category": "", "categoryclass": "", "imagename": "778db365f46d3426a2a41e0696cbee4a.jpg", "infoid": 1012887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "坦桑尼亚北部又是一个酷热的下午，又是一场高风险的音乐椅游戏。我们跌跌撞撞地回到营地躲避阳光，拼命想找个座位，我们互相瞥了一眼，然后看了看那张空置的露营椅。另一张桌子上坐着奥纳瓦西，他是一位受人尊敬的老人，有着顽皮的嗜好，咧嘴笑着。他似乎很享受这一切。\n我们在哈扎族社区度过夏天，哈扎族是地球上最后的狩猎-采集者群体之一。在工业化程度较高的国家，哈扎族的男性和女性设法避免了心脏病和其他疾病，我们想要了解其中的原因。我们的小型研究小组乘坐了两辆满载技术的陆地巡洋舰，测量哈扎族男男女女每天在风景中搜寻野味、蜂蜜、块茎和浆果时所做的每一个动作和燃烧的卡路里。\n经过一个漫长的上午，我们被难免的炎热和潮湿弄得筋疲力尽。我们只想坐着。奥纳瓦西似乎也有同样的感受。他整个上午都在打猎，肯定比我们更配坐这把椅子。但这件事已经失控了。我们珍贵的野营椅，尽管它们很重，我们还是把它们带到了灌木丛中，它们是哈扎磁铁。我们这个小小的研究区的每一个参观者似乎都被它们所吸引，就像飞蛾被门廊的灯光所吸引一样。\n我们知道，在保持身体活动方面，我们需要从哈扎身上学到很多东西。原来他们也有一些关于休息的重要东西要教我们。在接下来的10年里，我们将一起理解为什么椅子如此诱人，为什么它们似乎让…。\n*免费礼品仅适用于在英国、美国、加拿大、澳大利亚、新西兰或欧元区订阅交付的季度和年度订阅购买", "note_en": "ANOTHER blistering afternoon in northern Tanzania, another high-stakes game of musical chairs. Stumbling back into camp to escape the sun, desperate for a seat, we glanced at each other and then at the single unoccupied camp chair. In the other, grinning, sat Onawasi, a respected elder with a mischievous bent. He seemed to be enjoying this.\n We were spending our summer with the Hadza community, one of the last populations of hunter-gatherers on the planet. Hadza men and women manage to avoid heart disease and other diseases of the more industrialised world, and we wanted to understand why. Our small research team had come in two Land Cruisers loaded with tech to  measure every movement made and calorie burned as Hadza men and women scoured the landscape every day for wild game, honey, tubers and berries.\n After a long morning, we felt drained by the inescapable heat and humidity. All we wanted to do was sit. Onawasi seemed to feel the same way. He had spent the morning hunting, and certainly deserved the chair more than we did. But this was getting out of hand. Our precious camp chairs that we took into the bush despite their weight were Hadza magnets. Every visitor to our little research area seemed drawn to them like moths to a porch light.\n We knew we had a lot to learn from the Hadza about staying physically active. It turns out they also had something important to teach us about resting. Together, over the next 10 years, we would come to understand why chairs are so irresistible, and why they seem to make …\n  *Free gift is only available with quarterly and annual subscription purchases where subscription delivery is in the United Kingdom, USA, Canada, Australia, New Zealand or Euro area", "posttime": "2020-07-19 22:53:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "坐姿,sit,椅子", "title": "改变你的坐姿可以延长你的寿命", "title_en": "Changing the way you sit could add years to your life", "transed": 1, "url": "https://www.newscientist.com/article/mg24732913-000-how-changing-the-way-you-sit-could-add-years-to-your-life/", "via": "", "real_tags": ["坐姿", "sit", "椅子"]}]