[{"category": "", "categoryclass": "", "imagename": "dcdf1e05ec316850f22a3f92dff89fff.jpg", "infoid": 1033715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超文本的概念比万维网早了几十年。但几乎所有的超文本系统都能处理本地文件。蒂姆·伯纳斯·李(Tim Berners-Lee)希望创建一个可以跨网络工作的系统，这样人们就可以将一台机器上的文件链接到另一台机器上的另一台文件。\nWorldWideWeb不仅仅是一个浏览文件的程序。它是一个浏览器和编辑器。引言文本是这样写的：\n今天，很难想象网页浏览器也能被用来创建网页。事实证明，人们非常乐意用手写HTML--这是Tim Berners-Lee和他的同事们从未预料到的。他们认为制作网页和链接需要某种用户界面。这正是WorldWideWeb浏览器提供的功能。您可以在一个窗口中打开文档，然后对其进行标记。然后，在另一个窗口的文档中，您可以创建指向标记页面的链接。\n在使用WorldWideWeb浏览器时，您会注意到需要双击链接才能打开它们。这是因为只需点击一下即可进行编辑。\nWorldWideWeb浏览器的用户界面在某种程度上模糊了您自己计算机上的文档和网络上的文档之间的界限。要直接浏览到网络上的文档，您需要知道其URL。但是，您不能简单地将该URL键入地址栏中，因为没有地址栏。相反，你必须遵循一系列步骤：\n一旦你在WorldWideWeb中打开了一个基于网络的文档(或者我们今天所说的网页)，你就可以通过双击链接来导航。您双击的每个链接都会在一个新窗口中打开。\nWorldWideWeb的核心是一个文字处理器…。但有链接。正如您可以纯粹使用文字处理器来阅读文档一样，当您编写自己的文档时，真正的乐趣就来了。尤其是当你把超链接加入其中的时候。\n一旦你写好了一份文档，是时候把普通文本变成超文本了：\n要链接到另一个文档，您需要在另一个窗口中打开该文档。单击其标题栏将其聚焦。\n现在切换回您的example.html文档并突出显示您想要作为链接的文本。\n您甚至可以将新文档保存到硬盘上。点击&#34；文档&#34；菜单下的&#34；保存一份脱机副本(&#34；Save a Copy Offline&#34；)。\n一旦你把文件下载到你的电脑上，你就可以用文本编辑器打开它，看看HTML会是什么样子。\n要编辑任何文档，无论是您创建的文档还是万维网上的页面：\n如果要保留已编辑文档的副本，请从文档菜单中选择脱机保存副本。\n下面是一组基于HTML的组件，它们重新创建了原始的Next界面。可以随意抓取、查看源代码等，用于您自己的项目。\n普鲁斯和枯草杆菌及枯草杆菌新世界储备库的一种新的世界储备库，它是一种新的动物模型，它的特点是，它是一种新的动物模型，是一种新的技术，也是一种新的技术。\nAMA Me fideliter Fidem meam nota de corde totaliter et Ex Mente tota Ama Me fideliter Fidem meam nota de corde totaliter et Ex Mente tota。\n这是一种新的治疗方法，它是一种新的治疗方法，它不会引起任何恶习，也不会引起任何人的反感，因为它是一种特殊的治疗方法，它是一种特殊的治疗方法，它是一种特殊的治疗方法，它是一种治疗方法，也是一种有效的治疗方法。", "note_en": "The idea of hypertext preceded the World Wide Web by decades. But nearly all hypertext systems worked on local files. Tim Berners-Lee wanted to create a system that would work across networks so that people could link from a file on one machine to another file on another machine.\n  WorldWideWeb wasn&#39;t just a programme for browsing files. It was a browser and editor. The introductory text reads:\n    Today it&#39;s hard to imagine that web browsers might also be used to create web pages. It turned out that people were quite happy to write HTML by hand—something that Tim Berners-Lee and colleagues never expected. They thought that some kind of user interface would be needed for making web pages and links. That&#39;s what the WorldWideWeb browser provided. You could open a document in one window and &#34;mark&#34; it. Then, in a document in another window, you could create a link to the marked page.\n  You&#39;ll notice as you use the WorldWideWeb browser that you need to double-click links to open them. That&#39;s because a single click was used for editing.\n The user interface of the WorldWideWeb browser somewhat blurred the lines between documents on your own computer and documents out on the network. To &#34;browse&#34; directly to a document out on the network, you need to know its URL. But you can&#39;t simply type that URL into an address bar; there is no address bar. Instead you have to follow a sequence of steps:\n    Once you&#39;ve got a web-based document (or web page, as we would say today) open in WorldWideWeb, you can navigate by double-clicking on links. Every link you double-click will open in a new window.\n At its heart, WorldWideWeb is a word processor …but with links. And just as you  can use a word processor purely for reading documents, the real fun comes when you write your own. Especially when you throw hyperlinks into the mix.\n      Once you&#39;ve got a document written, it&#39;s time to turn from regular text into  hypertext:\n  To link to another document, you need to have that other document open in another window. Click on its title bar to focus it.\n    Now switch back to your example.html document and highlight the text you want to be a link.\n  You can even save your new document on to your hard drive. Click on &#34;Save a copy offline&#34; under the &#34;Documents&#34; menu.\n  Once you&#39;ve downloaded the file to your computer, you can open it up with a text editor to see what the HTML would have looked like.\n To edit any document, whether it&#39;s one you created, or a page on the world wide web:\n      If you want to keep a copy of the edited document, choose &#34;Save a copy offline&#34; from the &#34;Documents&#34; menu.\n Here is a collection of HTML-based components recreating the original NeXT interface. Feel free to grab, view-source, etc, to use for your own projects.\n          Omnia sol temperat\t\t\t\t\t\t\t\tPurus et subtilis \t\t\t\t\t\t\t\tNovo mundo reserat \t\t\t\t\t\t\t\tFaciem Aprilis \t\t\t\t\t\t\t\tAd amorem properat \t\t\t\t\t\t\t\tAnimus herilis \t\t\t\t\t\t\t\tEt iocundis imperat \t\t\t\t\t\t\t\tDeus puerilis \t\t\t\t\t\t\t\tEt iocundis imperat \t\t\t\t\t\t\t\tDeus puerilis\n  Ama me fideliter \t\t\t\t\t\t\t\tFidem meam nota \t\t\t\t\t\t\t\tDe corde totaliter \t\t\t\t\t\t\t\tEt Ex mente tota \t\t\t\t\t\t\t\tAma me fideliter \t\t\t\t\t\t\t\tFidem meam nota \t\t\t\t\t\t\t\tDe corde totaliter \t\t\t\t\t\t\t\tEt Ex mente tota\n  Rerum tanta novitas \t\t\t\t\t\t\t\tIn sollmenti vere \t\t\t\t\t\t\t\tEt veris auctoritas \t\t\t\t\t\t\t\tIubet nos gaudere \t\t\t\t\t\t\t\tVices prebet solitas \t\t\t\t\t\t\t\tEt in tuo vere \t\t\t\t\t\t\t\tFides est et probitas \t\t\t\t\t\t\t\tTuum retinere \t\t\t\t\t\t\t\tFides est et probitas \t\t\t\t\t\t\t\tTuum retinere", "posttime": "2020-11-07 18:23:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "worldwideweb,文档", "title": "浏览器--WorldWideWeb的下一个应用", "title_en": "The Browser – WorldWideWeb Next Application", "transed": 1, "url": "https://worldwideweb.cern.ch/worldwideweb/", "via": "", "real_tags": ["文档"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首先，由于这些讨论的本质，我想补充一条免责声明，即本文并不属于Luddiism(正如您将看到的那样，恰恰相反)，更重要的是，我不反对在FreeBSD的衍生产品(如FreeNAS或PC-BSD)中集成Mach/libSystem/Launchd。这完全是关于FreeBSD的，也是为什么我对iXSystems领导的NextBSD项目的目标持怀疑态度的原因，该项目正在推动OS X化的努力。\n我关注NextBSD已经有一段时间了，当时它刚开始是Open Launchd，这是R.Tyler在2005年作为GSOC学生时发起的一项努力，意在将启动的系统和服务管理器移植到FreeBSD上，这一点并不令人意外。它被搁置了很长一段时间，直到2013年底复兴，但再次进展非常缓慢。\n2014年11月左右，在MeetBSD大会上，Jordan Hubbard发表了题为“FreeBSD：未来10年”的演讲，概述了对FreeBSD更“事件驱动”和统一配置方法的普遍渴望，强烈暗示了将Launchd用作系统引导和服务守护进程，以及OS X低级用户空间的其他部分。\n当时，很多人(包括我自己)认为这更多的是一种假设，而不是真正的持续努力。他们当然很低调。然而，随着我对GNU Hurd的研究兴趣与日俱增，我很快就想起了Open Launchd的努力，并向Kip Macy询问了FreeBSD的Mach IPC端口的状态。\n事实证明，他不仅移植了OSF Mach的部分实现，而且还移植了Apple System Logger、xPC、libdispatch、libtify、libaudit和带有JSON解析器的Launchd。\n在这一点上，我意识到事情变成了现实。不久之后，该项目在2015年8月的旧金山湾区FreeBSD用户小组会议上正式揭幕，乔丹·哈伯德和基普·梅西发表了演讲。\n这就引出了这篇文章，以及为什么我认为这是被误导的。虽然实验没有什么错，但我会尝试说服读者为什么Launchd和Mach不适合FreeBSD。\n它的要点是，启动架构是如此特定于OS X的特定用例，试图将其逐字移植到另一个系统会导致概念上的不匹配。\n在OS X环境中，Launchd是Mach Bootstrap服务器，管理名称-端口绑定的名称空间，用于在Mach服务之间进行发现。由于Mach端口命名空间是任务内部的，因此选择了一个中央仲裁器来处理查找和服务注册。\n非常重要的一点是要注意到，这绝不是必须的。例如，GNU Hurd没有相当于引导服务器的功能。相反，每个进程都被分配了一个引导端口，用于与启动它的服务器库会合。因此，引导是一项分散的活动，但NextBSD开发人员在很大程度上考虑的是Mach语义，关于OS X如何具体实现它们，而不是一般的，并继续推断和推断特定的体系结构，就好像它是法定的一样。\nLaunchd可能是第一个普及“套接字激活”这一时髦概念的系统，这实际上是对FD传递和inetd风格的服务启动这一古老观念的重塑。它不是像UCSPI那样的通用方案，而是一种临时集中管理的协议，如果完全利用该协议，会鼓励守护程序编写者链接到liblaunch，从而造成不受欢迎的锁定。\n然而，Launchd的核心污点是它对服务分类的绝对混乱的语义。Launchd旨在启动和监控守护进程，即所谓的代理(实际上是按用户/会话守护进程)、Mach服务和xPC服务。一开始，后两者就是特定于OS X的，并绑定到IPC机制，这是一种不一致的服务分类方式。然后，代理可以是四种“会话类型”之一：预登录、按用户、图形用户界面会话和非图形用户界面会话。请注意，图形用户界面和登录前会话类型的概念是如何在考虑到Aqua界面和LoginWindow应用程序(特定于OS X的显示管理器)的情况下清晰地设计出来的。它们无关紧要，而且在其他平台上存在阻抗不匹配问题。因此，非GUI会话代理的概念与Launchd如何从其plist启动sshd紧密相连，而plist是一个专门用于整个代理类型的特别有限的领域。\n更复杂的是实际的流程类型，如Launchd.plist(5)中所述。在这里，甚至像system d这样的东西都将它们视为应该执行哪些启动例程的信息，在这里，它们与应该应用什么调度策略和资源限制紧密相关！有四种类型，名称含糊的背景、标准、自适应和交互。背景很简单，这是一个由Launchd…守护的常规服务。但具有自动资源限制。标准是隐式默认设置。使用xPC在后台和交互式之间进行自适应切换。因此，它是一种与使用IPC机制的特定方式相耦合的进程类型。令人困惑的是，互动是没有任何资源限制的。你可能会对这个泥潭感到困惑。嗯，对于需要良好的优先级调度和资源统计的桌面来说，这确实是很有意义的，这样即使在系统事件排队时，应用程序也可以保持响应。但是对于服务器和嵌入式系统来说，FreeBSD的主要用途是什么呢？这绝对是无稽之谈。这种行为甚至也不能很好地观察到。\n此外，Launchd在很大程度上仅限于一个创业纪律：懒惰地按需加载服务。现在，例如，类似daemontools的东西是基于“让它崩溃”的哲学，即不断地重新启动服务，直到它们的依赖关系得到满足。由于其低开销和多功能性，它可以用作一次启动一切的标准渴望服务管理器，但也可以通过使用简单的套接字工具包接口(类似于inetd，但模块化程度更高)(如UCSPI)来使其变得懒惰。System d也可以以懒惰和急切的方式使用，通过其复杂的依赖系统实现这一点。\n不过，Launchd并不能很好地应对这种渴望。它没有正式的依赖或排序系统，也不太符合“让它崩溃”的范例。事实上，引用《创建启动守护程序和代理》，它一般不能很好地处理非启动守护程序：\n如果您的守护程序依赖于未启动的守护程序，则在启动守护程序时该未启动的守护程序尚未启动时，您必须格外小心，以确保守护程序正常工作。要做到这一点，最好的方法是在启动时包含一个循环，该循环检查未启动的守护进程是否正在运行，如果没有运行，则在再次检查之前休眠几秒钟。\n确保在此循环之前为SIGTERM设置处理程序，以确保在您所依赖的守护进程永远不可用时能够正确关闭。\n为了帮助解决这个问题，Launchd以KeepAlive密钥的形式提供了一个黑客攻击，将服务的正常运行时间与特定的资源条件绑定在一起。它几乎所有的选择都受到内在竞争条件的影响。还有NetworkState，它绑定到正在运行的网络接口，在这里被定义为“至少有一个非环回接口处于运行状态，并且为其分配了IPv4或IPv6地址”，而PathState用于只要给定路径上的inode存在，就保持活动状态，并具有文件系统事件通知所带来的所有快捷性。但是，最可笑的是，还有其他启用的工作。没错。您可以将一个作业耦合到由其标签启用的另一个作业。一个穷人的依赖体系，已经到了可以滥用的时候，完全颠覆了Launchd存在的整个假想。\n当然，最重要的是，使用名为LaunchOnlyOnce的键(而不是某种类型，这更有意义)的一次性作业、StartCalendarInterval的类似crond的功能(据报道不能很好地与实际的crond配合使用)、更模糊的资源平衡键(如LimitLoadTo和LowPriorityIO)，以及首先通过WaitForDebugger向调试器屈服的能力(这是否意味着Launchd中断ptrace(2。我希望不会。)。\n我们不要忽视，所有这些服务状态都与全局系统状态相关联，而不是被隔离到具有不同职责的不同进程中。\n顺便说一下。我描述的一切？所有的数据都在PID1中。这只是一个可靠性问题，不管你怎么切分它。它可能适用于桌面系统，但一点也不通用。\n另一个可靠性问题是配置解析也是在PID1中完成的。随着苹果公司的推出，其格式是可扩展标记语言(XML)。随着NextBSD的推出，它变得更理智了。相反，他们选择了JSON。但总的来说，解析可能应该在PID1的临界基之外处理，因为解析器长期以来一直是臭名昭著的错误来源，尤其擅长输入模糊。\n归根结底，推出的架构是一堆分层违规、语义不一致和奇怪的模棱两可的界面，这使得它真的很难使用。这源于这样一个事实，即它试图成为整个该死系统上几乎每一个CPU时间单位的管理者。显然，它是一个针对OS X的限制而高度定制的工具。它主要是为面向开发人员和塑造桌面体验而设计的，而不是系统管理员会大量使用的东西。这在OS X上没问题。它很笨拙，对FreeBSD或其他很多东西都不好。\n乔丹·哈伯德(Jordan Hubbard)声称，在Mach和Unix概念之间并没有那么大的阻抗不匹配，但我要反驳这一点。\n我们希望更进步，愿意尝试新事物。如果有必要，我们不怕改变启动系统，也不怕把Unix拖入21世纪。\n他们将把unix的喧哗和尖叫拖入21世纪的…。通过将80年代中期的第一代研究微内核集成到其臭名昭著的IPC中。\n现在，请记住，我不是在抨击马赫本身。GNU Hurd在GNU Mach上做得很好，多年来甚至对其进行了一些有趣的重构和更新。我相信OS X在XNU中也能很好地使用Mach(它的IPC被广泛使用)。\n然而，…在2015年有意识地采用了它的界面。这是一个令人费解的时代错误，特别是对于一个如此自豪于其未来主义和远见的项目。当然，现在他们填补的MkLinux上的OSF Mach接口主要只是获得OS X系统的一种手段，但他们也试图以其自身的优点来证明它的合理性。\n现在，有了这样的决定，最好是拥有一个Userland Mach服务器。然而，这是不切实际的，因为Mach语义实际上很难确定为单片Unix。即使作为内核模块，它们也不支持内存对象，因为这些对象是由来自外部分页程序(即用户空间页面错误处理程序)的存储支持的。铁板一块的工会从来没有好的机制来实现这一点。一种古老的黑客攻击是陷害SIGSEGV(例如，使用GNU libsigSegv)，但这是非常有限的。受KVM工作的启发，有人提出了一种适用于Linux的userfaultfd(2)机制，但该机制尚未合并。\nMach强制执行非常严格的任务-线程二分法，即虚拟地址空间和在其下运行的CPU时间单位之间的二分法。它们结合在一起就形成了一个过程。在FreeBSD的例子中，他们不得不以一种丑陋的方式来简化它，假定任务=进程和线程=kthread，这违反了正确的Mach语义。顺便说一句，在Linux上也可能需要这样做。\nMach VM系统似乎移植得很好。Mach的vm_read()和vm_write()函数通过映射到离散任务地址空间和从离散任务地址空间映射来工作，因此这可能是促使它成为内核模块的原因。这仍然是一个可靠性问题。\nNextBSD幻灯片称赞Mach IPC促进了不是文件系统的独立服务命名空间，好像这是一个巨大的缺点。使用Plan 9和Inferno告诉我，具有每个进程名称空间的9p比整数描述符表(这就是端口名称空间)要优雅和通用得多。\n他们提到了一个“预先存在的定义良好的RPC接口”，我猜想这个接口是指MIG。MiG是一个编译器，它将RPC定义从一种名为Matchaker的语言转换成用于打包Mach消息的精心设计的C代码。它使用起来不是特别舒服，主要是Mach IPC使用起来费力的副作用(这就是苹果公司做出XPC的原因)，而且据我所知，它从未被用来实现位置透明通信。\n归根结底，这就是问题所在。NextBSD的努力几乎没有考虑过解决问题。他们只是拥有与苹果有关联或曾经与苹果联系在一起的人，被OS X作为一种技术迷住了，只是照例移植OS X基础设施，就好像它是一个不需要正当理由的内在正确的法令一样。我们想要动力系统，所以我们当然会把船运到港口。我们想要更好的索引日志记录，所以我们当然会移植ASL。嘿，所有这些都需要Mach和XPC，所以让我们将部分OSF Mach作为内核模块放在同一个地址空间中。\n最大的问题是：我为什么不直接使用OS X呢？我想不出任何理由。NextBSD目前的努力并不打算对OS X系统做任何有趣的事情，而是直接按照上游计划使用它们，因此它们将永远追赶达尔文。如果我想直接使用达尔文，我会运行类似PureDarwin的程序。如果我想要一整套，我只需要使用OSX--它已经可以和Unix(实际上是一个授权的Unix)进行合理的互操作了。NextBSD是关于“必须有所作为”这一古老笑话的深刻例证。这是一件事，所以我们必须去做。“。\n一种是使用nosh，这是由jonathan de boyne pollard开发的高度灵活和模块化的系统和服务管理工具包，它实现了许多类似system和Launchd的功能，但其架构却与它们截然相反。它在FreeBSD上运行，大多数rc.d脚本甚至已经移植。\n二是效仿蜻蜓BSD。Matthew Dillon为它编写了一个小型但功能强大的服务管理器svc(8)，它使用监狱进行服务跟踪和隔离，并使用proctl(2)系统调用在没有初始化的情况下成为收割机(类似于Linux&gt；=3.4的prctl(2)中的PR_SET_CHILD_SUBREAPER标志)。虽然在其他方面还不够完善，但我们的目标是编写一个简单但完整且多功能的服务管理器，利用本地的FreeBSD特性。\n第三个是什么都不做，坚持使用rc.d。我不会进一步评论这一点，这是相当不言而喻的。\n我已经发现了Launchd架构的结构性技术问题，Mach的概念如何不能很好地映射到单片Unix上，以及作为二手OS X而不是利用本地功能或在现有结构上构建而不是粗俗地逐字移植外国系统软件的普遍愚蠢之处。", "note_en": "Firstly, because of the visceral nature of these discussions, I would like to add a disclaimer that this article is not borne of Ludditism (quite the contrary, as you shall see) and that more importantly I do  not oppose having Mach/libSystem/launchd integration inside derivative products of FreeBSD, such as FreeNAS or PC-BSD. This is strictly about FreeBSD and why I am skeptical of the goals of the NextBSD project led by iXsystems, which is pushing the OS X-ification effort.\n  I have been keeping an eye on NextBSD for some time, when it was initially just openlaunchd, an effort initially started by R. Tyler as a GSoC student in 2005 to, unsurprisingly, port the launchd system and service manager to FreeBSD. It was stalled for a long time until its revival in late 2013, but again moving very slowly.\n Around November of 2014 at the MeetBSD conference, Jordan Hubbard delivered a talk entitled “ FreeBSD: The Next 10 Years,” which outlined a general desire for a more “event-driven” and unified configuration approach to FreeBSD, strongly implying the use of launchd as system bootstrap and service daemon, as well as other parts of the OS X low-level userspace.\n At the time, a lot of people (including myself) considered this more of a hypothetical than a true ongoing effort. They certainly kept a low profile. However, with my growing research interest in GNU Hurd, I was quickly reminded of the openlaunchd effort and went to ask Kip Macy about the status of a Mach IPC port for FreeBSD.\n As it turned out, not only had he ported a partial OSF Mach implementation, but also Apple System Logger, XPC, libdispatch, libnotify, libaudit and launchd with a JSON parser.\n At that point, I realized that things had gotten real. Soon after, the project is officially unveiled at a Bay Area FreeBSD User Group meeting in August 2015, with a  talk featuring Jordan Hubbard and Kip Macy.\n Which brings me to this article, and why I believe this is misguided. Though there is nothing wrong with experimentation, I will attempt to persuade the reader why launchd and Mach are not good fits for FreeBSD.\n  The gist of it is that the launchd architecture is so specific to OS X’s particular use cases that trying to verbatim port it to another system leads to a conceptual mismatch.\n In the context of OS X, launchd is, among other things, the Mach bootstrap server, managing a namespace of name-port bindings for discovery purposes among Mach services. Since Mach port namespaces are internal to tasks, a central arbiter was chosen to handle lookups and service registration.\n It’s very important to note that this is by no means a necessity. For instance, GNU Hurd does not have the equivalent to a bootstrap server. Instead, each process is assigned a bootstrap port for rendezvous with the server library that starts it. Bootstrapping is therefore a decentralized activity, but the NextBSD developers instead largely think of Mach semantics with regard to how OS X specifically implements them rather than in general, and proceed to infer and extrapolate a specific architecture as if it were fiat.\n launchd was probably the first system to popularize the  buzzword idea of “socket activation”, really a rebranding of the age old ideas of fd-passing and inetd-style service launching. It is not a generic scheme like UCSPI, but an ad-hoc centrally managed protocol that to fully exploit  encourages daemon writers to  link to liblaunch, creating an undesirable lock-in.\n However, the core blot of launchd is its absolutely muddy and confused semantics for categorizing services. launchd is designed to start and supervise daemons, so-called agents (really per-user/session daemons), Mach services and XPC services. Right off the bat, the latter two are OS X-specific and bound to an IPC mechanism, which is an inconsistent way to categorize a service. An agent  can then be one of four “session types”: pre-login, per-user, GUI session and non-GUI session. Notice how the idea of GUI and pre-login session types is quite clearly designed with the Aqua interface and the loginwindow application (OS X-specific display manager) in mind. They are irrelevant and an impedance mismatch on other platforms. The idea of a non-GUI session agent, then, is tightly coupled to how launchd starts sshd from its plist, which is a peculiarly limited domain to devote an entire agent type to.\n Further complicating things is the actual process types, as documented in launchd.plist(5). Where even something like systemd treats them as information for what startup routines should be performed, here they’re tightly coupled to what scheduling policy and resource limits should be applied! There are four types, ambiguously named Background, Standard, Adaptive and Interactive. Background is straightforward, it’s a regular service daemonized by launchd… but with automatic resource limiting. Standard is the implicit default. Adaptive switches between Background and Interactive using XPC. So it’s a process type coupled to a particular way of using an IPC mechanism. And then Interactive is, quite confusingly, one without any resource limits. You might be baffled at this quagmire. Well, it does make decent sense  for a desktop where you want good priority scheduling and resource accounting so that applications can be kept responsive even as system events queue up. But for a server and for embedded systems, which is what FreeBSD is primarily used for? It is absolutely nonsensical. Nor is this behavior even well observable.\n Moreover, launchd is largely limited to one startup discipline: lazy loading of services on demand. Now, for example, something like daemontools is based on the philosophy of “let it crash” and restarting services continuously until their dependencies are met. Because of its low overhead and versatility, it can be used as a standard eager service manager that boots everything up at once, but it can also be made lazy through the use of simple socket toolkit interfaces (similar to inetd, but much more modular) like UCSPI. systemd, too, can be used in both lazy and eager fashions, achieving this via its complicated dependency system.\n launchd, though, can’t handle eagerness particularly well. It has no formal dependency or ordering system, and it doesn’t fit well with the “let it crash” paradigm, either. In fact, quoting from “Creating Launch Daemons and Agents”, it can’t play well with non-launchd daemons in general:\n If your daemon has a dependency on a non-launchd daemon, you must take additional care to ensure that your daemon works correctly if that non-launchd daemon has not started when your daemon is started. The best way to do this is to include a loop at start time that checks to see if the non-launchd daemon is running, and if not, sleeps for several seconds before checking again.\n Be sure to set up handlers for SIGTERM prior to this loop to ensure that you are able to properly shut down if the daemon you rely on never becomes available.\n To help get around this, launchd provides a hack in the form of the KeepAlive key to bind a service’s uptime with a particular resource condition. Just about all of its options suffer from intrinsic race conditions. There’s NetworkState, which binds to a network interface being up, here being defined as “at least one non-loopback interface being up and having IPv4 or IPv6 addresses assigned to them,” PathState for keeping alive as long as an inode at a given path exists, with all the raciness that comes with file system event notifications. But, most laughably, there’s OtherJobEnabled. That’s right. You can couple a job to another job being enabled by its label. A poor man’s dependency system that’s ripe for abuse and completely subverts the whole supposed point for launchd’s existence to begin with.\n Then, of course, on top of all this, you have one-shot jobs with a key named LaunchOnlyOnce (as opposed to being some sort of type, which would make more sense), crond-like functionality with StartCalendarInterval that  reportedly doesn’t play well with an actual crond, more ambiguous resource balancing keys like LimitLoadTo and LowPriorityIO and the ability to yield to a debugger first via WaitForDebugger (Does this mean launchd breaks ptrace(2) semantics? I hope not.)\n Let’s not neglect that all of this service state is being meshed with the global system state, instead of being isolated into different processes with different responsibilities.\n And by the way. Everything I described?  All of it is in PID 1. That’s just a reliability concern no matter what way you slice it. It might be fine for desktop systems, but it is not generic in the slightest.\n Another reliability concern is that configuration parsing is done in PID 1, too. With Apple’s launchd, the format is XML. With NextBSD’s launchd, it’s a bit saner. They chose JSON, instead. But in general, parsing should probably be handled outside of the critical base of PID 1, since parsers have long been notorious sources of bugs and particularly adept to input fuzzing.\n Ultimately, the launchd architecture is a mess of layering violations, semantic inconsistencies and odd ambiguous interfaces that make it really awkward to use. This emerges from the fact that it tries to be the manager of just about  every unit of CPU time on the whole damned system. It’s clearly a highly specifically tailored tool to OS X’s constraints. It’s designed mostly to be developer-facing and for shaping the desktop experience, rather than something a sysadmin would heavily use. That’s fine for OS X. It’s clumsy and not fine for FreeBSD, or really much of anything else.\n  Jordan Hubbard claims that there isn’t such a grand impedance mismatch between Mach and Unix concepts, but I’d contest that.\n  We hope to be more progressive and willing to try new things. We do not fear changing the startup system or dragging Unix kicking and screaming into the 21st century by its hair, if necessary.\n  They’re going to drag Unix kicking and screaming into the 21st century… by integrating a mid-80s first-generation research microkernel for its infamous IPC.\n Now, keep in mind I’m not bashing Mach  per se. The GNU Hurd does fine with its GNU Mach and has even done some interesting refactoring and updates on it throughout the years. I’m sure OS X does fine with Mach in XNU, as well (its IPC is used extensively).\n Consciously adopting its interfaces in 2015, however… it’s such a baffling anachronism, especially for a project so priding itself on its futurism and vision. Now, of course, the OSF Mach interfaces from MkLinux they’ve shimmed in are mostly just a means to getting the OS X systems stuff, but they try to justify it on its own merits, too.\n Now, with such a decision, it would have been best to have a userland Mach server. This is however impractical, because Mach semantics are in fact really tricky to pin down on a monolithic Unix. And even as a kernel module, they don’t support memory objects, because those are backed by a store from an external pager (i.e. a userspace page fault handler). Monolithic Unixes have never had good mechanisms for achieving this. An old hack is trapping SIGSEGV (e.g. with GNU libsigsegv), but that’s very limited. A userfaultfd(2) mechanism was proposed for Linux, inspired by work on KVM, but it has yet to be merged.\n Mach enforces a very strict task-thread dichotomy, i.e. a dichotomy between the virtual address space and the unit of CPU time running under it. Together, they’re combined to form a process. In FreeBSD’s case, they had to shortcut it in an ugly fashion by assuming task = process and thread = kthread, which violates proper Mach semantics. The same would probably need to be done on Linux, by the way.\n The Mach VM system appears to be well ported. Mach’s vm_read() and vm_write() functions work by mapping to and from discrete task address spaces, so that was a likely motivator for making it a kernel module. It is still a reliability concern.\n The NextBSD slides praise Mach IPC as facilitating separate service namespaces that isn’t a file system, as if that’s a huge disadvantage. Using Plan 9 and Inferno has taught me that 9P with per-process namespaces is much more elegant and versatile than a table of integer descriptors, which is what a port namespace is.\n They mention a “pre-existing well-defined RPC interface,” which I presume is in reference to MIG. MIG is a compiler that translates RPC definitions from a language called Matchmaker into elaborate C code for packing Mach messages. It’s not particularly pleasant to use, mostly a side effect of Mach IPC being grueling to use (hence why Apple made XPC), and to the best of my knowledge has never been used to implement location transparent communication.\n  This is what it boils down to. The NextBSD effort is barely even trying to think about solving problems. They just have people who are or were associated with Apple, are enamored with OS X as a technology and simply ritualistically port the OS X infrastructure as if it were an inherently correct fiat that needs no justification. We want dynamic systems, so of course we’re gonna port launchd. We want nice indexed logging, so of course we’re gonna port ASL. Hey, all of this needs Mach and XPC, so let’s put a partial OSF Mach as a kernel module in the same address space.\n The big question:  Why wouldn’t I just use OS X instead? I can’t think of any reason. The NextBSD effort as it stands has no intention of doing anything interesting with the OS X-isms but using them directly as upstream intended, thus they’re in a position where they’ll play eternal catch-up with Darwin. If I want to use Darwin directly, I’d run something like PureDarwin. If I want the whole shebang, I’ll just use OS X - it’s already reasonably interoperable with Unix (a licensed Unix, in fact). NextBSD is a profound example of the age-old joke about “Something must be done. This is something, therefore we must do it.”\n    One is to use  nosh, a highly flexible and modular system and service management toolkit made by Jonathan de Boyne Pollard which implements a lot of systemd and launchd-like features, yet has an architecture that is the polar opposite of each of them. It runs on FreeBSD and most rc.d scripts have even been ported.\n The second is to follow DragonFly BSD’s example. Matthew Dillon wrote a small yet powerful service manager for it called  svc(8), which uses jails for service tracking and isolation, plus the proctl(2) system call for becoming a reaper without being init (similar to the PR_SET_CHILD_SUBREAPER flag in Linux &gt;=3.4’s prctl(2)). Though otherwise rudimentary, the goal would be to write a simple yet complete and versatile service manager that exploits native FreeBSD features.\n The third is to do nothing and stick with rc.d. I won’t comment further on that, it’s pretty self-explanatory.\n  I have identified structural technical issues with the launchd architecture, how Mach concepts do not map well to monolithic Unix, and the general folly of being a second-fiddle OS X instead of exploiting native features or building on top of existing structures rather than hacky verbatim porting of foreign system software.", "posttime": "2020-11-07 18:22:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不应,adopt,mach", "title": "FreeBSD不应采用Launchd(2015)", "title_en": "FreeBSD should not adopt launchd (2015)", "transed": 1, "url": "https://blog.darknedgy.net/technology/2015/08/26/0/", "via": "", "real_tags": ["不应", "adopt", "mach"]}, {"category": "", "categoryclass": "", "imagename": "bfc8a966b009d1412b726d1f294fd612.jpg", "infoid": 1033713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AMD第三代EPYC 7713‘米兰’Zen 3 CPU，64核，128线程，2.45 GHz时钟用于早期样品，比四个英特尔至强白金CPU更快。\nAMD基于Zen 3的Ryzen 5000台式机CPU昨天发布，现在我们已经开始获得其第三代EPYC米兰CPU阵容的第一批泄露。在SiSoftware数据库中，Momomo_US发现了名为EPYC 7713的EPYC米兰CPU。\nAMD第三代和第三代采用EPYC 7713和713；米兰的64核服务器CPU，2.45 GHz用于早期样品。\n第三代EPYC米兰阵容预计将于今年晚些时候开始发货，并计划在明年全面上市。看起来第一批芯片确实已经开始在时间内发货，这些下一代服务器处理器现在已经开始更频繁地出现在在线基准数据库中。\n我们现在看到的例子是AMD EPYC 7713，这是一款基于米兰和赞恩3的第三代EPYC CPU，适用于数据中心和服务器。该芯片以千兆字节的MZ72-HB0-00服务器为特色，具有两个SP3插座，并支持TDP高达280W的EPYC芯片。主板具有16个DDR4 DIMM插槽，并支持8通道内存接口，总容量最高可支持2 TB(RDIMM或LRDIMM)。\nAMD EPYC 7713；米兰Zen 3 CPU拥有64个内核和128个线程。有两个CPU在运行，所以我们要查看的是128个核心和总共256个线程。每个芯片都有32MB的二级缓存和256MB的三级缓存，总共有288MB的缓存。据报道，该芯片的时钟速度约为2.45 GHz，没有提到这些时钟是基时钟还是升压时钟。\n根据Executable Fix的说法，该芯片的OPN代码为100-000000324。看起来EPYC 7713仍然是一个早期的样本，我们绝对可以期待在最终版本中时钟更快，就像消费者Ryzen 5000 CPU所看到的那样，整个阵容的时钟增加了，通过新的Zen 3核心架构，IPC改进了19%。\n两个AMD EPYC 7713&#39；米兰Zen 3 CPU在基准测试中摧毁了四个英特尔至强白金CPU\n在CPU算术测试中的性能方面，AMD EPYC 7713 CPU，即使使用2.45 GHz时钟，也与之不相上下，有时甚至超过了令人印象深刻的四路英特尔至强白金(Cascade Lake-SP)系统。CPU目前在算术测试排行榜上排名第四，轻松击败了运行速度更快的3.39-3.35 GHz时钟的双CPU配置。\n英特尔至强白金8280L处理器位居榜首，仅比EPYC米兰Zen 3配置快5%，我们很容易看到最终的变种轻松登顶榜首。这里要考虑的更重要的是每瓦&安培的性能，以及EPYC米兰将提供的每美元价值的性能，而不是英特尔的Cascade Lake-SP产品，甚至是Ice Lake，它预计要到明年才会发货。\nAMD的EPYC米兰处理器将接替目前的EPYC罗马阵容。EPYC米兰阵容的根本变化将是新的Zen 3核心架构，它将基于先进的7纳米制程节点。据我们所知和AMD官方展示的，基于AMD Zen 3的EPYC米兰处理器将主要关注整体性能功耗比增强，但这并不意味着我们不会关注核心更新。\n采用Zen 3核心架构的AMD EPYC米兰CPU不仅采用了全新的芯片架构，而且IPC比Zen 2处理器提高了19%，基于我们在消费级芯片上看到的性能功耗比跃升了40%。更高的单核性能跃升将使AMD与英特尔的下一代至强处理器平起平坐，同时进一步领先于多线程处理器。\n当被问及米兰的CPU核心微架构，也就是所谓的Zen 3，相对于罗马所依赖的Zen 2微架构，在每个CPU时钟周期(IPC)处理的指令方面，它将带来怎样的性能提升时，诺罗德说，与Zen 2不同，Zen 2更多地是为第一代Epyc CPU提供动力的Zen 2微架构的演变，而Zen 3将基于一个全新的架构。\n诺罗德确实对自己的言论进行了限定，指出Zen 2带来的IPC收益超过了进化升级的正常水平--AMD表示，它的平均IPC收益约为15%--因为它实施了AMD最初对Zen提出的一些想法，但后来不得不放弃。然而，他也断言，Zen 3将带来性能提升，这与你对全新架构的期望是一致的。\n在之前的一张幻灯片中，AMD展示了他们基于Zen 3的7纳米处理器比英特尔的10纳米Ice Lake-SP Xeon芯片提供了更好的性能功耗比。至于新功能，除了采用Zen 3核心设计外，米兰还将提供与SP3平台的插座兼容性，将支持DDR4内存和PCIe 4.0接口，并声称提供64个内核和2倍线程(128个线程)。这些芯片的TDP额定功率为120-225W，与现有的罗马部件相似。\n所以总结一下EPYC米兰的一切，我们来看看以下几个主要特点：\n展望未来，就发布日期而言，AMD重申EPYC米兰处理器将于2020年底发货。这两款处理器将与英特尔的Cooper Lake-SP 14纳米和Ice Lake-SP 10纳米处理器正面交锋，这两款处理器将分别在今年和明年发货。", "note_en": "AMD 3rd Gen EPYC 7713 ‘Milan’ Zen 3 CPU Spotted, 64 Cores, 128 Threads &amp; 2.45 GHz Clocks For Early Sample, Faster Than Four Intel Xeon Platinum CPUs\n    AMD&#39;s Zen 3 based Ryzen 5000 Desktop CPUs launched yesterday and now we have started getting the first leaks of its 3rd Gen EPYC Milan CPU lineup. An EPYC Milan CPU known as the EPYC 7713 is spotted within the  SiSoftware database by  Momomo_US.\n AMD&#39;s 3rd Gen &amp; Zen 3 Powered EPYC 7713 &#39;Milan&#39; 64 Core Server CPU Spotted, 2.45 GHz For Early Sample\n The 3rd Gen EPYC Milan lineup is expected to start shipping later this year with full availability planned for next year. It looks like the first chips have indeed started shipping within time and these next-generation server processors have now started appearing more frequently in online benchmark databases.\n  The sample we are looking at is the AMD EPYC 7713 which is a 3rd Gen Milan &amp; Zen 3 based EPYC CPU for data centers and servers. The chip was featured in the Gigabyte MZ72-HB0-00 server that features two SP3 sockets and support for EPYC chips with TDPs of up to 280W. The motherboard features 16 DDR4 DIMM slots and supports an 8-channel memory interface with up to 2 TB total capacity support in either RDIMM or LRDIMM flavors.\n  The AMD EPYC 7713 &#39;Milan&#39; Zen 3 CPU featured 64 cores and 128 threads. There were two CPUs running so we are looking at 128 cores and 256 threads in total. Each chip featured 32 MB of L2 and 256 MB of L3 cache for a total of 288 MB cache. The clock speeds for the chip were reported around 2.45 GHz and there&#39;s no mention if these were the base or boost clocks.\n According to  ExecutableFix, the chip has the &#39;100-000000324&#39; OPN code. It looks like the EPYC 7713 is still an early sample and we can definitely expect faster clocks in the final variant as seen with the consumer Ryzen 5000 CPUs which saw a clock increase for the entire lineup along with 19% IPC improvements through the new Zen 3 core architecture.\n Two AMD EPYC 7713 &#39;Milan&#39; Zen 3 CPU Destroy Four Intel Xeon Platinum CPUs in Benchmarks\n In terms of performance within the CPU Arithmetic tests, the AMD EPYC 7713 CPU, even with 2.45 GHz clocks, is on par and sometimes outperforms a quad Intel Xeon Platinum (Cascade Lake-SP) system which is mighty impressive. The CPU currently has the fourth position in the Arithmetic tests chart and easily beats the dual EPYC 7742 &#39;Rome&#39; configurations which run at much faster 3.39-3.35 GHz clocks.\n   The top position held by 4x Intel Xeon Platinum 8280L CPUs is only a mere 5% faster than the EPYC Milan Zen 3 configuration and we can easily see the final variants topping the chart with ease. The more important thing to consider here is the performance per watt &amp; also the performance per $ value that EPYC Milan will be offering over Intel&#39;s Cascade Lake-SP offerings and even Ice Lake which isn&#39;t expected to ship till next year.\n  The AMD EPYC Milan processors would succeed the current EPYC Rome lineup. The fundamental change for the EPYC Milan lineup would be the new Zen 3 core architecture which will be based upon an advanced 7nm process node. From what we know and what AMD has officially shown, the AMD Zen 3 based EPYC Milan processors would focus primarily on overall performance per watt enhancements but that doesn&#39;t mean we won&#39;t be looking at core updates.\n  The AMD EPYC Milan CPUs featuring the Zen 3 core architecture will not only feature a brand new chip architecture but also feature a 19% increase in IPC over Zen 2 processors and a 40% jump in performance per watt based on what we have seen on the consumer level chips. The higher single-core performance jump will put AMD on par with Intel&#39;s next-generation Xeon CPUs while taking the multi-threaded lead even further.\n When asked about what kind of performance gain Milan&#39;s CPU core microarchitecture, which is known as Zen 3, will deliver relative to the Zen 2 microarchitecture that Rome relies on in terms of instructions processed per CPU clock cycle (IPC), Norrod observed that -- unlike Zen 2, which was more of an evolution of the Zen microarchitecture that powers first-gen Epyc CPUs -- Zen 3 will be based on a completely new architecture.\n Norrod did qualify his remarks by pointing out that Zen 2 delivered a bigger IPC gain than what&#39;s normal for an evolutionary upgrade -- AMD has said it&#39;s about 15% on average -- since it implemented some ideas that AMD originally had for Zen but had to leave on the cutting board. However, he also asserted that Zen 3 will deliver performance gains &#34;right in line with what you would expect from an entirely new architecture.&#34;\n  In a previous slide, AMD  showed their Zen 3 based 7nm processors offering better performance per watt than Intel&#39;s 10nm Ice Lake-SP Xeon chips. As for the new features, other than featuring its Zen 3 core design, Milan would offer socket compatibility with SP3 platforms, would feature support for DDR4 memory, PCIe 4.0 interface, and is stated to offer 64 cores and 2x the threads (128 threads). The chips will have a TDP rated at 120-225W which is similar to existing Rome parts.\n So summing everything up for EPYC Milan, we are looking at the following main features:\n   Moving forward, as far as the launch date is concerned, AMD has reaffirmed that EPYC Milan CPUs will ship in late 2020. The CPUs will go head to head with  Intel&#39;s Cooper Lake-SP 14nm and Ice Lake-SP 10nm CPUs which will be shipping this and next year, respectively.", "posttime": "2020-11-07 18:22:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zen,cpu", "title": "AMD EPYC 7713‘米兰’Zen 3 CPU基准测试", "title_en": "AMD EPYC 7713 'Milan' Zen 3 CPU Benchmarked", "transed": 1, "url": "https://wccftech.com/amd-3rd-gen-epyc-7713-milan-zen-3-cpu-spotted-64-cores-spotted-benchmarked/", "via": "", "real_tags": ["zen", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "1ae11f3d75cd58453e981f058850e28c.png", "infoid": 1033711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "曾经有一个社会，横向极权主义是如此成功，以至于不需要任何国家或机构，来自朋友和邻居的简单社会压力就足以保护一种文化和它的习俗，可能超过4万年。人们甚至可以推测，如果詹姆斯·库克船长没有在澳大利亚上岸，它可能会持续更长时间。这个岛国大陆的土著人民暗示了横向极权主义的力量，因为它是一种能够塑造人们的组织形式，以至于几乎任何可能改变传统世界观和习俗的个人倡议几乎都消失了。澳大利亚原住民不需要把那些打破禁忌或拒绝尊重和遵守传统仪式的人烧死在火刑柱上。他们的同龄人会把他们排除在社区之外，然后他们就会死在沙漠里，这就足够了(例如，参见菲利普·克拉克(Philip Clarke)的《祖先行走的全面人类学历史》(Philip Clarke‘s Complete人类学History Where the祖先，2003))。\n在其他社会，技术更先进，总体上意识形态不那么铁板一块，为了消除背离横向极权规范的意识形态和行为，有必要进行制度性压制。在许多地方，职业化的神职人员很快承担起制定社区法律并确保这些法律得到遵守的责任，使用类似于刑事审判的起诉方式，对被认为是罪恶的行为进行审判。这些罪过被广泛理解为危害社会的罪行，或者更确切地说，是针对维持对个人思想的极权控制的罪行。例如，古希伯来祭司的情况就是这样，他们的判决是由人民通过石块集体执行的，这一事实表明，惩罚不仅仅是一个自上而下执行其意志的当局的责任，也是罪人/犯罪者的邻居和熟人的责任。是社区承担并行使了惩罚的权利。随着时间的推移，国家越来越多地将这一权力据为己有，用垂直秩序取代了早期的水平秩序，最终以法西斯主义和共产主义等现代形式达到顶峰。如今，除了被古巴独裁政权用来谋取自身利益，以及那些渴望在拉美其他西班牙语地区效仿的人，水平极权主义在几乎所有地理位置和文明中都失去了制度力量。这包括澳大利亚，那里的原住民，就像新几内亚的原住民一样，不得不接受现代对个人的尊重，以及至少在理论上的教会、国家和种族的分离。但是，这并不意味着横向极权主义已经成为历史。即使没有一个成熟的制度力量，它的社会表现形式仍然在太多的地方压迫着人们，现代西方世界也不例外。与纵向极权主义形成对比的是，横向极权主义根本不需要统治公共机构才能产生，也不需要摧毁个人，因为它早于这些机构，独立于这些机构而存在。\n事实上，横向极权主义也可能在没有制度代理的情况下出现，因为它不需要任何机构来镇压或消除持不同政见者。与这种极权主义作斗争是困难的，因为任何人都可能是它的代理人之一，它的运作方式可能仍然不透明，即使是那些在日常生活中热衷于实践它的人也是如此。横向极权主义是一种极权主义，由特定社区的多数人(或能够左右和操纵多数人的占主导地位的少数人)通过压迫不遵守其不成文规则的其他成员而实行的极权主义。它压迫少数群体，以及那些被视为扰乱或威胁社区作为一个独特和完整实体的同质性的人。在横向极权主义中，外部当局没有必要强加他们的意志，而被压迫者的社区反过来可以反抗他们。由于大多数人(由压迫者及其墨守成规的追随者组成)和少数被压迫的人生活在同一社会层面上，被迫害的人很难依靠其他持不同政见者的团结，因为他们发现自己孤立于实行统一和社会极权统一的不成文法则的广大个人中，被剥夺了权力。\n对一些人来说，将这种水平压迫称为“极权主义”似乎有些过头。然而，它对个人和社会造成的后果比垂直极权主义更严重。从一开始，就有数不清的人死于他们的邻居和同胞之手。有多少穆斯林妇女被邻居用石头砸死\n在西方文学中，水平极权主义大多被描述在一个单一的背景下：农村，尽管从古代到当代知识分子经常将农村生活理想化，他们似乎无法摆脱高尚的野蛮刻板印象，或者更确切地说，是善良农民的刻板印象，这主要源于让-雅克·卢梭(Jean-Jacques Rousseau)被广泛阅读并模仿的小说《朱莉，或新赫洛伊丝》(Julie，or the New Heloise)(1761年)。传统的欧洲村庄及其压抑的机械团结主要(几乎完全)出现在主要写于1850年至1960年之间的现实主义叙事中。当时，进步实证主义者和马克思主义者都意识到，如果不打破主导着农村最传统地区的惯性和对变革的抵制，现代化和发展将是不可能的。通过这种方式，这些作家与传统封闭社会的捍卫者发生了冲突，在这些社会中，人们不会质疑礼仪、古老的宗教作为与每个人的意识密切相关的集体现象，也不质疑习俗的父权制性质，也不质疑一群农民作为民族精神储存库的民族纯洁性，不像城市里忘恩负义的陌生人。在现代国家及其法律的行动越来越深入到农村的背景下，城市的影响以进步的自由和思想和习俗的多样性而闻名，农村反乌托邦的作者知道如何使用富有表现力的现实主义来叙述村民如何对那些他们认为与受到自由个人主义和最新资本主义组织威胁的机械团结背道而驰的人采取集体镇压的方式。\n值得一提的是，奥诺雷·德·巴尔扎克(Honoréde Balzac)的法国小说《农民》(Les Paysans[The Peasantry]，1855)讲述了一个富有的局外人购买并搬进一座豪宅和相应的农业庄园，最终由于富人和穷人反对他的存在和从事生产活动而不得不离开的故事。西班牙作家文森特·布拉斯科·伊巴涅斯(Vicente Blasco Ibáñez)在《La Barraca[The Cabin](1898年)》一书中讲述了类似的集体反应。在这部小说中，一个非常贫穷的家庭为了生存，搬进了一个被村子里的人宣布为禁区的小农场。在邻居烧毁农舍后，他们最终被迫离开。在瑞士，吉安·丰塔纳(Gian Fontana)在“瓦尔代市长”(The Mayer of Valdei，1935)中还展示了乡村人民的仇外心理如何以狂热的方式捍卫社区的同质化，以至于他们宁愿摧毁自己的家园，也不愿向世界开放：在这部罗曼什中篇小说中，吉普赛家庭租来的房子被纵火蔓延，最终烧毁了整个村庄。在意大利和罗马尼亚，乔瓦尼·维尔加(Giovanni Verga)的故事--标题为《自由》(Libert Ka)(1882年)和利维·雷布雷亚努(Liviu Rebreanu)的小说《RăScoala》(1932年)--不仅仅是两个农民起义故事的例子。在这两种情况下，群众的盲目暴力说明了村庄机械团结的本能特征，表现为针对房东和他们的行政人员的非理性(和适得其反的)集体暴力，他们在社区中被视为局外人。作为局外人，他们必须带着类似于穷人的愤怒被赶出社区，穷人因为他们的外表而被从社会的怀抱中带走。例如，菲亚略·德·阿尔梅达(Fialho De Almeida)的葡萄牙短篇小说《矮人》(O Anão)(1893年)中的侏儒就是这样的例子。在另一些例子中，他们可能会因为自己的行为而成为局外人，比如维克多·卡塔拉(Victor Catalka)的《Idil·li Xorc》(1902年)中的老年人物，他们因为结婚年龄太早而在加泰罗尼亚的一个村庄被石头砸死。在这些现实主义的例子中，人们可以加上弗里德里希·杜伦马特(Friedrich Dürrenmatt)的戏剧《Der Besuch der alten Dame](1956)，它展示了在一个给定的社区内，外部因素如何煽动和利用水平极权主义，以消灭某些人。值得一提的是，雪莉·杰克逊(Shirley Jackson)的“彩票”(The Lottery，1948；收录于The Lottery，或詹姆斯·哈里斯历险记，1949)，以及多萝西·K·海恩斯(Dorothy K.Haynes)的“完全融合”(Full Integrated)，它写于1949年左右，出版于1976年。前者是一个高超的哥特式寓言，讲述了机械团结社会中集体正义的牺牲性质。后者也是一个寓言，这一次是一个封闭和相互联系的农村社区排斥外来者，外来者只能以当地人吃人的食物的形式融入其中。\n莫的这些经典作品", "note_en": "There once was a society in which horizontal totalitarianism was so successful that, without any need for a State or institutions, simple social pressure from friends and neighbours was sufficient to conserve a culture and its customs, perhaps for over forty thousand years. One could even speculate that if Captain James Cook had not disembarked in Australia it may have lasted even longer. The indigenous people of this island-continent are suggestive of the power of horizontal totalitarianism as a form of organisation capable of formatting people so that practically any individual initiative that may alter traditional world-views and customs virtually disappears. Aboriginal Australians did not need to burn at the stake those who broke taboos or refused to respect and follow traditional rites. It was enough that their peers would exclude them from the community, and that they would then perish in the desert (see, for instance, Philip Clarke’s comprehensive anthropological history  Where the Ancestors Walked, 2003).\n In other societies, more technologically advanced and on the whole ideologically less monolithic, institutional repression has been necessary to eliminate ideologies and behaviours that diverge from horizontal totalitarian norms. In many places, professionalised clergy quickly assumed responsibility for fixing community laws and seeing that they were obeyed, using prosecution analogous to criminal trials against what was considered sinful conduct. These sins were widely understood as crimes against society, or rather, against the maintenance of totalitarian control over individual minds. This is the case, for example, of the ancient Hebrew priesthood, whose sentences were carried out collectively by the people through stoning, a fact that indicated that the punishment was not purely the responsibility of an authority that enforced its will from top to bottom, but also that of the neighbours and acquaintances of the sinner/offender. It was the community that took on and carried out the right to punish. Over time, the State increasingly assumed this power for itself, substituting a vertical order for the earlier horizontal one, which ultimately culminated in modern forms such as fascism and communism. Nowadays, aside from its use by the Cuban dictatorship for its own interests, as well as those who aspire to imitate it in other parts of Spanish-speaking Latin America, horizontal totalitarianism has lost its institutional power in almost all geographical locations and civilizations. This includes Australia, where the aboriginal people, like those of New Guinea, have had to accept modern respect for the individual and the separation, at least in theory, of church, State and ethnicity. However, this does not mean that horizontal totalitarianism is a thing of the ancient past. Even without an established institutional power, its social manifestations continue to oppress people in all too many places, and the modern Western world is no exception. In contrast to the vertical kind, horizontal totalitarianism does not by any means need to dominate public institutions in order to come into being, or to crush the individual, because it pre-dates and exists independently from these institutions.\n In fact, horizontal totalitarianism may also arise without availing itself of institutional agency, since it does not require any institutions in order to repress or eliminate dissidents. It is difficult to fight against this type of totalitarianism because anyone could be one of its agents and its workings can remain opaque even to those who enthusiastically practice it in their daily lives. Horizontal totalitarianism represents a totalitarianism exercised by the majority (or a dominant minority able to sway and manipulate a majority) of a given community by oppressing other members of that community who do not adhere to its unwritten rules. It oppresses minorities as well as those who are seen as disturbing or threatening the homogeneity of the community as a unique and complete entity. In horizontal totalitarianism, there is no need for external authorities to impose their will, against whom the community of the oppressed can, in turn, rebel. Since the majority, made up of oppressors and their conformist followers, and the minority of oppressed people live on the same social plane, the persecuted can hardly rely on the solidarity of their fellow dissidents because they find themselves isolated and disempowered among the mass of individuals who apply the unwritten laws of uniformity, and of the totalitarian unity of the community.\n It may seem excessive to some to term this horizontal oppression ‘totalitarian’. However, its consequences for people and societies are even more serious than those of vertical totalitarianism. An incalculable number of people have died at the hands of their neighbours and countrymen since the beginning of time. How many Muslim women have been stoned to death by their neighbours for not adhering to their society’s sexual mores? How many Hindu men and women have been murdered by their relatives for daring to marry outside their caste? How many individuals have died for not believing in their tribe’s chosen god? How many have died for daring to question the beliefs and prejudices held by the majority of people in their community? And we are not talking about primitive societies here, nor solely those of the past. Today, homosexual people still commit suicide in communities where widespread homophobia turns their existence into a living hell. We still see people exiled or forced to seek asylum because they refused to partake in the religious or political ideas of their people, or because they do not belong to the predominant ethnicity or ideological affiliation of their region. Criticism, whether more or less open; social vacuums; and the impossibility of leading a life of one’s own, continue to hound all those who, for whatever reason, are seen as being  abnormal.\n Even our private lives are threatened, and not only by corrupt and opportunistic politicians who take advantage of people’s prejudices to limit minority rights and secure their own power. This power, built on populism, is but the political face of horizontal totalitarianism. Thanks to the development of the surveillance methods and mutual control structures offered by information technologies, before long we might begin to receive scores (c.f. China’s social credit system) and, consequently, punishments and rewards, based on our neighbours’ or communities’ opinions of us. No longer will anyone wish to be original, extravagant or creative, nor outspokenly contrarian, because this may cause that group of people who judge us with each passing moment to turn against us. This phenomenon can be observed in the actions of existing successful public silencing initiatives, which confront questions and divergent opinions with insults, as seen in the unfortunate social media lynchings perpetrated in recent years by fanaticised supporters of MeToo or Black Lives Matter, or by similar movements with equally extreme ideologies. While it is true that these phenomena are not new, in the past they were only dangerous once they crossed into the physical realm, when people became a policing mass, as explained by Gustave Le Bon in  The Crowd: A Study of the Popular Mind ( Psychologie des foules 1895). Thanks to current technologies and the eternal social instincts of the human being, the ‘mechanical solidarity’ of closed, traditional communities, as described by Émile Durkheim in  The Division of Labour in Society ( De la division du travail social 1893), may even accumulate more repressive force today than it has already enjoyed for millennia.\n The Internet has been and continues to be a powerful tool for unleashing self-expression and individual creativity. In theory, anyone can propose anything online, and by the same token, can oppose anything. Then again, it is important to ask oneself how many people might maintain their silence, or hide their convictions for fear of the aforementioned media lynchings. We are also aware of numerous children and adolescents who have committed suicide to escape cyberbullying perpetrated by their neighbours and classmates, for their apparent lack of conformity to some ideal or principle of normalcy prevalent at the time. For horizontal totalitarianism, social harassment is a powerful weapon that the Internet has not deactivated; one could even argue that its power has intensified, since the Internet makes it easy for the number of bullies to increase exponentially.\n The danger appears even greater when taking into account that neither writers nor intellectuals wish to denounce it. On the contrary, the modern and postmodern idealisation of all manner of closed societies, from primitive tribes to rural villages, has inspired numerous texts precisely condemning that one place where the individual may, to an extent, escape horizontal totalitarianism. That is, the great modern city in which economic and political freedom prevail, as well as freedom to practice traditional customs. In the city, it is not possible for everyone to know and control you. Unlike the village or tribe, in which everyone knows everyone else, no one has any reason to know anything about you and thus you can carry on your life without fear of criticism or attacks from other members of the community. No one will disapprove of you because you do not attend mass or believe in the God or gods that the village or tribe dictates you should, make love in a way that is condemned by the ruling community’s morality, or fail to profess belief in your nationality being superior to that of foreigners. Aside from mandatory compliance with laws and the reciprocal respect essential to a peaceful coexistence, the individual is sovereign and is no longer a mere component of a mechanical social body that nullifies free will, creativity or, indeed, individuality. Nonetheless, nowadays those who should be the most interested in preserving their individuality, since their writing depends on it, are publishing a steady stream of dystopias instead. These works no longer describe the workings of vertical totalitarianism (imposed from above, by a ruling government, party or all-powerful person), as was the case in the modern classic dystopias against fascist or communist regimes, despite the fact that these still exist today, albeit in marginal countries such as North Korea.\n Conversely, it seems very few writers have addressed the oppression of dissident individuals by horizontal totalitarianism either in ‘primitive’, traditional communities or in complex, modern societies. In dystopian literature, following a strict definition of the genre, there are hardly any examples of complex descriptions of this type of totalitarianism. In the context of anarchist movements that aim to eliminate all vertical institutions so that horizontal organisation becomes all-inclusive and, as a result, total(itarian), one can call to mind dedicated anarchists who have warned, through their fiction, against the danger to the individual, as well as to technological and cultural development, posed by conformism horizontally imposed by a libertarian community. One supreme example is the destiny of the scientist who discovers a device for interstellar communication in the novel  The Dispossessed (1974), by Ursula K. Le Guin. The reaction of the utopic anarchist society in which he lives is so negative that he is forced to go into exile on another planet, just like countless peers who have had to escape their closed-minded villages in order to avoid being stoned to death.\n In Western literature horizontal totalitarianism has mostly been described in a single setting: the countryside, despite the frequent idealisation of rural life from Ancient times until our contemporary intellectuals who seem to be incapable of getting past the  noble savage stereotype, or rather the stereotype of the virtuous peasant, which mainly originated in Jean-Jacques Rousseau’s widely read and imitated novel  Julie ou la Nouvelle Héloïse [ Julie, or the New Heloise] (1761). The traditional European village and its oppressive mechanical solidarity feature primarily, and almost solely, in realist narratives written mainly between 1850 and 1960. At this time, both progressive positivists and Marxists were aware that modernisation and development would be impossible if there were to be no break with the inertia and resistance to change that dominated the most traditionalist areas of countryside. In this way, these writers entered into conflict with the defenders of traditional closed societies, those in which one did not question ritual, archaic religiosity as a collective phenomenon closely tied in with the consciousness of each individual, nor the patriarchal nature of customs, nor the ethnic purity of a group of peasants as the repository of national spirit, unlike the ungrateful strangers of the city. In a context in which the actions of the modern State and its laws penetrated further and further into the countryside, in which urban influence was making itself known in progressive freedom and diversity of ideas and customs, the authors of rural dystopias knew how to narrate, using expressive realism, the way in which villagers could resort to collective repression against those they perceived as contrary to a mechanical solidarity threatened by liberal individualism and the latest capitalist organisation.\n It is worth mentioning the French novel  Les Paysans [ The Peasantry] (1855), by Honoré de Balzac, the story of a wealthy outsider who buys and moves into a mansion and the corresponding agricultural estate, before ultimately having to leave due to the opposition to, and even criminal action taken against, his presence and productive activities by both wealthy and poor locals. A similar collective reaction is narrated in  La barraca [ The Cabin] (1898), by Spanish author Vicente Blasco Ibáñez, in which, in order to survive, a very poor family moves into a small farm that has been declared off-limits by the people of the village. They are eventually forced to leave after their neighbours burn down the farmhouse. In Switzerland, Gian Fontana also shows, in “Il President da Valdei” [ The Mayor of Valdei] (1935), the way in which village peoples’ xenophobia violently defends the homogeneity of the community with such fanaticism that they would rather destroy their home than open it up to the world: in this Romansh novella the arson of the house rented by Gypsy families spreads and ends up burning down the whole village. In Italy and Romania, Giovanni Verga’s story, with the title “Libertà” [ Liberty] (1882) and the novel  Răscoala [ The Uprising] (1932), by Liviu Rebreanu, are more than just two examples of tales of peasant revolt. In both, the blind violence of the masses illustrates the instinctive character of a village’s mechanical solidarity which reveals itself in an irrational (and counterproductive) collective violence directed against landlords and their administrators, who in the community are perceived as outsider elements. Being outsiders, they must be removed from the community with a fury akin to that reserved for the poor individuals who, due to their physical appearance, are removed from the bosom of society. This is the case, for instance, of the dwarf in the Portuguese short story “O anão” [‘The Dwarf’] (1893), by Fialho de Almeida. In other examples they may become outsiders because of their behaviour, like the elderly characters of Victor Català’s “Idil·li Xorc” [‘Barren Romance’] (1902) who are stoned to death in a Catalonian village for having married at such an advanced age. To these realist examples one could add Friedrich Dürrenmatt’s play  Der Besuch der alten Dame [ The Visit] (1956), which demonstrates how within a given community horizontal totalitarianism can be stoked and exploited by external elements in order to eliminate certain individuals. In English, Shirley Jackson’s “The Lottery” (1948; collected in  The Lottery, or, The Adventures of James Harris, 1949), is worth mentioning, as well as Dorothy K. Haynes’ “Fully Integrated,” a horror story written around 1949 and published in 1976. The former is a masterful gothic parable dealing with the sacrificial nature of collective justice in societies subjected to mechanical solidarity. The latter is also a parable, this time of the rejection of outsiders by a rural community so closed and mutually bound that outsiders can only be integrated into it in the form of cannibalistic food for locals.\n These classic works of modern fiction have never been studied as a thematic whole, a sub-genre capable of examining the mechanisms of horizontal totalitarianism with the same penetration and mastery of dystopias such as those of Yevgeni Zamiatin and George Orwell, which investigated vertical totalitarianism. But, how could those studies have been carried out if the very concept of horizontal totalitarianism is practically unknown beyond studies in crowd psychology, which are generally limited to those rare moments of paroxysm in which the masses become collective agents (violent protests, lynchings, etc.)? Perhaps the answer lies in that our herd instinct is so strong that we do not even notice its terrible effects. Sometimes, in the name of integration and equality/uniformity, we do not hesitate in treating misfits or  abnormal peoplewith cruelty. Millennia of discriminatory religiosity, centuries of equally exclusive and discriminatory nationalism and an eternity of collective prejudices have desensitised us to horizontal totalitarianism, especially when one considers the all-pervading influence of its latest manifestation: peer-enforced political correctness.\n In our postmodern times, it is fashionable to critique Popperian open societies and liberal economic and political systems, which are precisely the only ones having proven that mechanical solidarity and the ensuing communalism and horizontal totalitarianism can actually be curbed. But postmodern intellectuals usually prefer to imagine the downfall and disintegration of those classical liberal societies as demonstrated by the staggering amount of contemporary anti-capitalist dystopias from early cyberpunk fiction to the ones written, for example, in Spain in the aftermath of the 2008 Great Recession (see Diana Palardy,  The Dystopian Imagination in Contemporary Spanish Literature and Film, 2018). There are even intellectuals who have condemned tourism (see, for instance,  Andrea Víctrix, a 1974 dystopian novel written in Catalan by Llorenç Villalonga targeting mass tourism in his native Majorca), followed by influential left-wing activists and politicians (most notably in Barcelona), for whom tourists represent a threat to ethnic integrity and economic self-sufficiency, in other words, two underlying ideals of traditional society, which are contrary to the globalisation and cosmopolitanism that tourism implies.\n Currently, instead of humanist cosmopolitanism, it is  multiculturalism that seems to predominate among hegemonic intellectuals in the academic sphere and the mainstream press. Underpinning this mode of observation is a form of cultural relativism that regards cultures as discreetly delineated, separate realities; their blending or co-experience thus often draws accusations of ‘cultural appropriation.’ Following this logic, the practice of horizontal totalitarianism becomes acceptable if it is part of ‘their culture,’ as an internal reflection and quasi justification of the superimposed civic community enforcing its overarching diversitarian narrative in an analogous process of higher-order horizontal totalitarianism. What is important is the group and, for multiculturalists, there is nothing wrong with formatting the mind of its members to such a point that they will accept, for example, th\n......", "posttime": "2020-11-07 18:19:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生活,totalitarianism,社会", "title": "生活和文学中的横向极权主义", "title_en": "Horizontal totalitarianism in life and literature", "transed": 1, "url": "https://www.sciphijournal.org/index.php/2020/10/01/horizontal-totalitarianism-in-life-and-literature/", "via": "", "real_tags": ["生活", "社会"]}, {"category": "", "categoryclass": "", "imagename": "68b84909f50accac52b3257ea09065e5.jpeg", "infoid": 1033710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着苹果iPad Pro 11配备LiDAR扫描仪，3D传感变得更加丰富，更加精细。飞行时间包括间接飞行时间和直接飞行时间。", "note_en": "With Apple iPad Pro 11 featuring LiDAR Scanner, 3D sensing has gotten richer, more granular. Time of Flight (ToF) comes with indirect ToF and direct ToF...", "posttime": "2020-11-07 18:18:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ipad", "title": "深入iPad Pro 11s激光雷达扫描仪", "title_en": "Look inside iPad Pro 11s Lidar Scanner", "transed": 1, "url": "https://www.eetasia.com/look-inside-ipad-pro-11s-lidar-scanner/", "via": "", "real_tags": ["ipad"]}, {"category": "", "categoryclass": "", "imagename": "a874aec8b0d98058e4bf0f11a57d3844.jpg", "infoid": 1033709, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国老牌电子游戏公司Codemaster证实，计划将其出售给美国巨头Take-Two。\nCodemaster最出名的是它的赛车游戏，包括Dirt Rally系列和F1牌照。\n该工作室成立于英国，目前总部设在沃里克郡的索瑟姆。\nTake-Two提出了一项交易，对Codemaster的估值为7.39亿英镑(合9.73亿美元)，Codemaster表示打算向股东推荐。\n在宣布这一消息的同一天，该公司发布了最新的游戏《尘土5》(Dirt 5)。\n尽管Codemaster目前专注于赛车游戏，但多年来它已经涉足了其他几个值得注意的特许经营权。\n该公司在Spectrum和Commodore时代开发了Dizzy系列平台游戏，以及几款体育游戏。\n20世纪90年代，该公司推出了另一款赛车游戏，形式是成功的微型机器(Micro Machines)特许经营权。该公司还发布了著名的英国制造的体育游戏布莱恩·劳拉·板球(Brian Lara Cricket)和乔纳·洛姆·拉格比(Jonah Lomu Rugby)，尽管没有开发出来。\n这笔收购交易相当于每股Codemaster股票价值1.20 GB的现金和3.65 GB的Take-Two股票。\n然而，这笔交易还没有完全敲定，还没有正式提出一份确定的报价。在媒体有关可能出售的报道浮出水面后，两家公司证实了目前这笔交易的存在。\nTake-Two认为，Take-Two和Codemaster的合并将带来两个世界级的互动娱乐产品组合，在赛车流派中，2K和Codemaster之间具有很强的互补性。Take-Two指的是Take-Two视频游戏发行商2K，其产品目录中包括许多体育游戏。", "note_en": "Veteran British video game company Codemasters has confirmed it plans to sell to US giant Take-Two.\n Codemasters is best known for its racing games, including the Dirt Rally series and Formula 1 licences.\n The studio was founded in the UK, and currently has its headquarters in Southam, Warwickshire.\n Take-Two has offered a deal that values Codemasters at £739m ($973m), and Codemasters says it intends to recommend it to its shareholders.\n The announcement comes on the same day the firm released its latest title, Dirt 5.\n Despite its current focus on racing games, Codemasters has dabbled in several other notable franchises over the years.\n The firm created the Dizzy series of platforming games in the Spectrum and Commodore era, as well as several sports games.\n An alternative take on its racing games arrived in the form of the successful Micro Machines franchise in the 1990s, and it also published - though did not develop - well-known British-made sports games Brian Lara Cricket and Jonah Lomu Rugby.\n  The buyout deal is worth £1.20 in cash and £3.65 in Take-Two shares for every Codemasters share.\n It is not, however, fully finalised, with a &#34;firm offer&#34; yet to be officially made. The two companies confirmed the existence of the current deal after media reports of a possible sale emerged.\n &#34;Take-Two believes that the combination of Take-Two and Codemasters would bring together two world-class interactive entertainment portfolios, with a highly complementary fit between 2K and Codemasters in the racing genre,&#34; Take-Two said, referencing the Take-Two video game publisher 2K, which counts many sports titles among its catalogue.", "posttime": "2020-11-07 18:18:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,codemaster,codemasters", "title": "英国Codemaster出售给Take-Two游戏", "title_en": "UK Codemasters Sold to Take-Two Games", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-54840773", "via": "", "real_tags": ["游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "例如，如果您的电子邮件是[电子邮件受保护]，则您的计划将仅适用于该电子邮件地址。任何其他源地址都将被丢弃。要更改您的源电子邮件地址(或添加其他地址)，请发送消息：[电子邮件受保护]。\n电子邮件在FIFO(先进先出)优先队列中处理。优先&gt；基础&&gt;试用。换句话说，我们首先处理优先计划……。那么基本的计划是..。然后是试验计划。\n每月的纯文本报告将通过电子邮件发送。将来，我们可能会设置启用每周报告--但是，嘿，我们正在努力清理你的收件箱，对吗？\n在超过每月5封电子邮件的试用计划之前，不必担心账单问题。一旦发生这种情况，我们会给您发送一份表格，通过Strike或Paypal注册一项计划。\n我们的目标电子邮件是集体发送的营销电子邮件。9/10次这些电子邮件只会泄露你的电子邮件地址。有时，他们会提到你的名字--带点个人色彩。\n处理后，您的电子邮件将被放入GSuite的垃圾桶，并将在30天内清除。\n如果您希望从这些聚合中删除，请向[受保护的电子邮件]发送电子邮件，主题为&#34；选择退出&#34；。", "note_en": "For example, if your emailis   [email protected], then your plan will only apply to thatemail address. Any other source addresses will be dropped. To change yoursource email address (or add another), please message:  [email protected].\n  Emails are processed in a FIFO (First-in, First-out) Priority Queue.   Priority &gt; Basic &gt; Trial . In other words, we process priority plans first... then the basic plans... then the trial plans.\n A monthly plain-text report will be delivered via email. In the future, we might a setting to enable weekly reports -- but hey, we&#39;re trying to unclog your inbox, right?\n     No need to worry about billing until you exceed the  &#34;Trial Plan&#34; which is  5 emails/month. Once that happens, we will send you a form to enroll in a plan via Stripe or Paypal.\n    The emails we are targeting are marketing emails sent  en masse. 9/10 times these emails don&#39;t disclose anything other than your  email address. Sometimes, they mention your  first name -- for a bit of a  &#34;personal touch&#34; &lt;/sarcasm&gt;.\n After processing, your emails will be placed in Gsuite&#39;s trash, which will be purged in 30 days.\n  If you would like to be removed from these aggregates, please email   [email protected] with the subject &#34;opt-out&#34;.", "posttime": "2020-11-07 18:18:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "取消,unsubscribe,电子邮件", "title": "启动HN：请-取消订阅.com-fwd电子邮件以取消市场营销订阅", "title_en": "Launch HN: Please-unsubscribe.com – fwd emails to unsubscribe from marketing", "transed": 1, "url": "https://please-unsubscribe.com", "via": "", "real_tags": ["取消", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从小就在电视上收看节目，用的是辛克莱ZX81，然后是ZX频段。内置在键盘上的电脑，你可以很容易地插到电视上，是我DNA的一部分。那么，考虑到这一点，我怎么能抗拒购买新的树莓派400呢？\n以下是我对硬件的初步想法，以及使用它进行轻量级开发的初步想法。\nRaspberry Pi 400本质上是一个内置在键盘内的Raspberry Pi 4。你可以在其他地方读到更好的描述，但技术规格中的要点是：\n400配有一个预装了Raspbian的16 GB SD卡，以及一系列应用程序(LibreOffice)、开发工具(Geany、数学、Scratch)、实用程序(Chromium、VLC Media Player)和游戏(Minworld)。\n插上400的电源并让它启动和运行是非常容易的。这是一个整洁的设备，后面有很多端口和连接器。键盘为…。好的。该设备在英国的标准是GB 67。我购买了符合GB94标准的套件(包括鼠标、电源、HDMI电缆和官方指南)。考虑到这款键盘的价位，它绝对没问题，但它确实感觉有点“可塑性”。\n400没有音频输出。音频通过HDMI输出传送。对我来说，这是个问题，因为我的显示器没有扬声器。这不是什么大问题，但这是我没有考虑过的事情。\n400没有的另一件事是Raspberry Pi摄像头模块的连接器。再说一次，这对我来说不是什么大不了的事，但如果你希望建造任何相机项目，那么400不是正确的选择。\n400的背面有GPIO接口，因此使用带状电缆可以非常轻松地构建电子项目。我有一个Adafruit T-Cobbler Plus，它可以非常容易地将400连接到面包板上，并构建…。东西！\n400启动速度很快，作为一款通用台式机功能非常强大。我今天大部分时间都在它上面浏览网页，同时也在安装应用程序、运行docker容器和构建代码，而且大部分时间它都感觉很快。\n总体而言，硬件相当不错，我喜欢它的外形。我可以看到学校/代码俱乐部购买这些设备，并在他们的计算实验室中使用。\n我花了一天的时间来设置我的树莓派400，我印象非常深刻。我的设置包括：\n安装了VS Code Remote Containers扩展，这样我就可以使用Docker dev Containers在。\n总体而言，这种设置很容易。太简单了，简直无聊死了！我有几个问题，但总的来说，设置我的Raspberry PI 400非常容易，这样我就可以编写代码、使用Docker并将更改推送到GitHub。例如，我目前正在VS Code中撰写这篇博客文章，在Docker容器中使用Jekyll构建它。\n我碰到的唯一问题是各种Docker图像的手臂支撑。默认的Ruby dev容器镜像不会构建，因为它有一些没有ARM变体的依赖项。最后，我以Ruby2.7的docker图像为基础，将我需要的定义部分复制/粘贴到我自己的Dockerfile中(删除Node、Zsh、oh my Zsh和其他一些东西)。我不确定到底是什么导致构建失败，所以我需要回去解决这个问题，但是值得记住的是，如果Rasberry PI是基于ARM的，并且并不是所有的开发工具都有ARM构建。\n安装了工具，玩了一玩，我已经构建了一些非常基本的Rust代码(构建时间与我的MacBook相当！)，我已经编写了一些基于GPIOZero的Python3代码(控制按钮和LED)，我已经设置了Jekyll/Ruby dev容器并构建/更新了我的博客。\n我有几台Raspberry Pi电脑(1、2和3)。大部分都是B型的，但我也有几个Zero。他们都坐在一个盒子里，没有人用过。我已经和他们玩过了，然后把他们收起来。这在一定程度上是因为性能不是很好，但外形因素是一个主要因素。感觉Raspberry Pi 400拥有我所需要的功能(对于非正式项目)，而且它的外形可以让我很高兴地把插头放在办公桌上。\n在下面的图片中，我有两个VS代码实例(都在运行dev容器)，另外我正在浏览。这一切都是从容不迫的。\n我还没有尝试建造任何巨大的…。但这不是它的目的。这是为了玩得开心，…", "note_en": "I grew up programming on my TV, with a Sinclair ZX81 followed by a ZX Spectum. Computers built into keyboards, that you can easily plug into a TV, are part of my DNA. So, given this, how could I resist buying the new  Raspberry Pi 400!?\n The following are my initial thoughts on the hardware, and on using it for light weight development.\n   The Raspberry Pi 400 is, essentially, a Raspberry Pi 4 housed within a keyboard. You can read much better descriptions elseewhere, but the main points from the tech specs are:\n   The 400 comes with a 16GB SD card pre-installed with Raspbian, and a host of apps (LibreOffice), dev tools (Geany, Mathematica, Scratch), utilities (Chromium, VLC Media Player), and games (Minecraft).\n  It was  very easy to plug the 400 in and get it up and running. It’s a neat device, with a good collection of ports and connectors at the back. The keyboard is…ok. The device is £67 in the UK. I bought the kit (which includes a mouse, power supply, HDMI cable, and official guide) for £94. Given the price point the keyboard is absolutely fine, but it does feel a tiny bit “plasticy”.\n The 400 doesn’t have an audio-out. Audio is delivered via the HDMI output. For me, that’s a problem because my monitor doesn’t have speakers. It’s not a BIG problem, but it’s something I hadn’t considered.\n The other thing the 400 doesn’t have is the connector for the Raspberry Pi camera module. Again, this isn’t a big deal for me but if you were expecting to build any camera projects then the 400 isn’t the right choice.\n The 400has the GPIO header at the back, so with a ribbon cable you can build electronics projects very easily. I have an  Adafruit T-Cobbler Plus which makes it very easy to connect the 400 to a breadboard and build…stuff!\n  The 400 starts up quickly, and is very capable as a general purpose desktop device. I’ve spent most of today browsing the web on it, while also installing apps, running docker containers, and building code, and it’s felt fast/snappy pretty much most of the time.\n Overall, the hardware is pretty good and I love the form factor. I can see schools/code clubs purchasing these devices and using the in their computing labs.\n  I’ve spent the day setting my Raspberry Pi 400 up, and I’m pretty impressed. My setup has included:\n Installed the  VS Code Remote Containers extension so that I can use Docker dev containers to develop code within\n On the whole, this setup was easy. So easy it was almost boring! I had a couple of issues, but on the whole it was very easy to set my Raspberry Pi 400 up so that I can write code, use Docker, and push changes to GitHub. For example, I’m currently writing this blog post within VS Code, building it using  Jekyll within a Docker container.\n The only issue that I hit is the ARM support for various Docker images. The default Ruby dev container image wouldn’t build because it had some dependencies that didn’t have ARM variants. In the end I took the Ruby 2.7 docker image as a base, and copy/pasted into my own  Dockerfile the parts of the defintion I needed (removing Node, Zsh, Oh my Zsh and a few other things). I’m not sure exactly what it was that was failng to build, so I need to go back and work it out, but it’s worth remembering that if the Rasberry Pi is ARM based, and not all development tools have ARM builds.\n Having installed tools, and played around, I’ve built some very basic Rust code (with build times comparible to my MacBook!), I’ve written some  GPIOZero based Python 3 code (controlling butons and LEDs), and I’ve set up a Jekyll/Ruby dev container and built/updated my blog.\n  I own several Raspberry Pi computers (1, 2 and 3). Most of them are the Model B format, but I have couple of Zeros too. All of them sit in a box, unused. I’ve played with them, then put them away. Part of that is because the performance hasn’t been that great, but the form factor is a major factor. It feels like the Raspberry Pi 400 has the power I need (for casual projects), and comes in a form factor that I can happily leave plugged in on my desk.\n   In the picture below I have two instances of VS Code (both running dev containers), plus I’m browsing. It takes it all in its stride.\n  I’ve not tried building anything huge…but that’s not what it’s for. It’s for having fun…", "posttime": "2020-11-07 18:18:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,覆盆子,raspberry,代码", "title": "覆盆子派400--第一印象", "title_en": "Raspberry Pi 400 – First Impressions", "transed": 1, "url": "https://martinpeck.com/blog/2020/11/06/Raspberry-Pi-400/", "via": "", "real_tags": ["覆盆子", "raspberry", "代码"]}, {"category": "", "categoryclass": "", "imagename": "edb66b11b48a64297484e46560109985.png", "infoid": 1033706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "战争可以在现实世界中进行，但也有一个虚拟战场--而且同样有害。《合法获取加密数据法案》是获取人们加密数据的最新尝试，也是另一项强化措施。\n这种“免授权”的加密方式对普通用户的通信安全几乎没有什么帮助，但对于那些将互联网用于非法目的的人来说，这却是一个重大的好处。\n这一说法显然是错误的。加密对普通用户也有同样的好处，如果不是更多的话。每个有挂锁标志(HTTP S)的网站、自2016年以来的每一款iPhone应用、自2018年以来的每一款安卓应用以及几乎每一款现代应用都使用了加密--这是有充分理由的。加密有助于保护敏感信息(例如与您的银行共享的信息，或者您在网站上使用密码的任何时候)。它还可以帮助保护不在使用(静止)的文件，或者在服务器被未经授权的人访问的情况下(例如罪犯试图抽走重要数据)。\n2016年，布鲁斯·施奈尔(Bruce Schneier)写了一篇关于加密价值的文章，清楚地概述了为什么需要加密。Schneier接着说，当美国政府之前与密码学作斗争时，他想知道他们自己是否意识到自己有多么依赖密码学。没有人可以凌驾于法律之上，所以如果你禁止强加密，联邦调查局也不应该使用它。司法部长巴尔给人的印象是，政府和某些大公司应该对这项法律有例外。巴尔承认有些事情是保密的，但他没有意识到普通公民可能也想要享受隐私。\n巴尔在福特汉姆大学举行的国际网络安全会议上说：“我们不是在谈论保护国家的核发射密码。”\n“我们也不一定是在谈论大型商业企业用来保护其运营的定制加密。我们谈论的是消费产品和服务，比如短信、智能手机、电子邮件、语音和数据应用。\n不知何故，因为普通的乔没有政府级别的秘密，他不再有权获得加密。我们都是人，我们都需要隐私。通过取消加密，你就剥夺了在线隐私。\n这项法案针对的是第230条，它确保任何互动计算机服务提供商都不应被视为其用户发布内容的发布者或演讲者-这是所有搜索引擎、社交媒体平台和视频共享网站生存的关键部分。如果没有它，互联网将成为一个自我审查的平台-一个更关注于抵御诉讼，而不是像最初那样为想法和创新提供媒介的平台。\n由于恐怖分子、恋童癖者和毒贩都使用加密技术，一项法案正在被推动通过，这很容易让人同情。读到《纽约时报》(New York Times)报道性虐待的网络图片，会让人不禁想知道，为什么这类法案还没有通过。同样，如果没有人加密，那么抓到上面提到的骗子和家伙肯定会更容易。\n然而，加密并没有造成这些问题；在它出现之前很久，这些犯罪就已经存在了。此外，那些参与非法活动的人总会找到漏洞和方法，比如使用没有后门的产品或加密工具。根据定义，罪犯不遵守法律。此外，很多无辜的人使用与这些罪犯类似的加密方式，但只是为了保护隐私，而不是隐藏任何非法行为，但他们仍然可能受到某种形式的起诉。人们认为，如果太多人使用非回溯软件，那么使用或拥有非回溯软件也将成为一种犯罪。据统计，人们一致认为，社会上无辜的人比罪犯多得多；这些无辜的人会因为少数人的不良行为而受到惩罚。\n对于一个政府来说，制定一部可以在其本国以外适用的此类法律是不可行的。世界各国政府几乎肯定会在哪些国家应该被允许进入后门的问题上存在分歧。因此，这个后门肯定会导致每个未经授权的人都能访问，因为解密数据的密钥会被第三方发现，这将导致所有人的加密完全破解。在联合网络(如Matrix)中，甚至不可能为每个家庭服务器添加后门。联盟分散了信任，这意味着部署服务器的人不一定是开发客户端软件或服务器软件的同一实体。Matrix甚至写了一篇详尽的文章，讲述了如何在没有后门的情况下打击这种虐待行为。\n无论如何，削弱加密只会导致犯罪分子使用强加密，而不会解决法律声称要解决的任何问题。没有简单的解决方案，这取决于政客们提供一个解决方案。是的，加密可以被怀有恶意的人使用，但它也被这么多普通人使用，他们永远不会想到以恶意的方式使用它。生活中几乎每一种工具都可能被用于邪恶的目的，但这并不意味着它不应该用于合法的非犯罪用途。你可以用锤子砸人，但这并不意味着锤子应该是用泡沫做的，因为如果泡沫是的话，人们就会用刀来代替。弱化加密不会解决这些问题，这可能是因为它们不是该法案的重点。相反，这项法律似乎试图将没有后门的强加密定为刑事犯罪，尽管政府很清楚这无法阻止犯罪分子。美国政府应该停止设计侵犯公民隐私的新方法，专注于解决该法案未能解决的问题。\n1988年，蒂莫西·梅(Timothy May)预测，“政府当然会以国家安全担忧、毒贩和逃税者使用加密技术以及担心社会解体为由，试图减缓或阻止加密技术的传播”。他说得很对。", "note_en": "Wars can be fought in the real world but there is also a virtual battlefield - and it is just as harmful. The  Lawful Access to Encrypted Data Act is the latest attempt to access people&#39;s encrypted data and it serves as another reinforcement.\n This type of “warrant-proof” encryption adds little to the security of the communications of the ordinary user, but it is a serious benefit for those who use the internet for illicit purposes.\n This statement is plainly false. Encryption has as much benefit, if not more, for ordinary users. Encryption is used in every website that has the padlock sign (HTTP S), in every iPhone app since 2016, in every Android app since 2018 and in almost every modern application - and for good reason. Encryption helps protect sensitive information (such as that shared with your bank, or any time you use a password on a website). It may also help protect files which are not in use (at rest), or in the event the server is accessed by an unauthorised person (such as a criminal attempting to siphon off important data).\n In 2016, Bruce Schneier wrote an article on  the value of encryption clearly outlining why encryption is needed. Schneier went on to say that when the US Government was  previously  fighting cryptography, he wondered if they were aware how much they relied on it themselves. No-one is above the law, so if you ban strong encryption, the FBI should not use it either. Attorney General Barr,  gives the impression that the government, along with certain large companies, should have an exception to the law. Barr recognises that there are some things that are secret, but he doesn&#39;t recognise that regular citizens might also want to enjoy privacy as well.\n “We are not talking about protecting the nation’s nuclear launch codes,” Barr told the International Conference on Cyber Security at Fordham University.\n “Nor are we necessarily talking about the customized encryption used by large business enterprises to protect their operations. We are talking about consumer products and services such as messaging, smart phones, email, and voice and data applications.&#34;\n Somehow, because your average Joe does not have government level secrets, he is no longer entitled to encryption. We are all humans, and we all need privacy. By taking away encryption, you are taking away privacy online.\n This act is aimed at Section 230, which ensures that no interactive computer service provider shall be treated as the publisher or speaker of content published by their users - an essential part of the survival of all search engines, social media platforms and video sharing sites. Without it, the internet would become a self-censored platform – one that is more concerned with fending off lawsuits than providing a medium for ideas and innovation as it originally was.\n It is easy to sympathise with an act that is being pushed through on the grounds that terrorists, paedophiles and drug-dealers all use encryption. Reading the  New York Times&#39;  reporting on online images of  sexual abuse would leave some wondering why this sort of Act has not been passed already. Equally, if no-one had encryption then it would certainly be easier to catch above mentioned crooks and fellons.\n Encryption, however, did not create these problems; these crimes were around long before it came into existence. In addition, those who partake in illicit activity will always find loopholes and ways to do so, such as using products or encryption tools that don&#39;t have backdoors. Criminals do not obey laws by definition. Furthermore, many innocent people use similar encryption to these criminals, but only to protect privacy, not hide any illegalities and yet they could still be subject to some kind of prosecution. It is assumed the use or possession of non-backdoored software would also become an offence if too many people used that instead. Statistically, it&#39;s agreed there are many more innocent people in society than criminals; those innocent people would be punished as a result of the bad actions of a few.\n It is not feasible for a government to make a law of this sort that can apply outside of it&#39;s own country. Governments around the world would almost certainly disagree on which countries should be allowed access to the backdoor. As a result, this backdoor would most certainly lead to every unauthorised party having access, as the key to decrypt the data would be discovered by third parties, this would result in completely broken encryption for all. In federated networks, such as Matrix, it&#39;s not even possible to add a backdoor to every homeserver. Federation decentralises trust, which means that the person deploying the server isn&#39;t necessarily the same entity who makes the client software or server software. Matrix has even written a  thorough article on how to combat this sort of abuse without backdoors.\n Weakening encryption will only result in criminals using strong encryption anyway, without fighting any of the problems that the the law claims to solve. There is no easy solution, and it is down to politicians to provide one. Yes, encryption can be used by people with bad intentions, but it is also used by so many ordinary people who would never think to use it in a malicious way. Nearly every tool in life can be used for nefarious purposes, but does not mean it should be unavailable for legitimate non-criminal uses. You could hit someone with a hammer, but it doesn&#39;t mean hammers should be made out of foam, because if they were, people would just use knives instead. Weakening encryption will not solve these issues, and that&#39;s probably because they were not the the focus of the Act. Instead, it seems that this law seeks to criminalises strong encryption that does not have backdoors, even though the government knows full well that this will not stop criminals. The US Government should stop devising new ways to breach its citizens privacy, and focus on combating the issues that this Act fails to.\n In 1988, Timothy May  predicted that “the State will of course try to slow or halt the spread of [encryption], citing national security concerns, use of the technology by drug dealers and tax evaders, and fears of societal disintegration”. He was spot on.", "posttime": "2020-11-07 18:18:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,继续,continues,加密", "title": "美国政府继续加密战", "title_en": "US Government Continues Encryption War", "transed": 1, "url": "https://blog.privacytools.io/us-government-continues-encryption-war/", "via": "", "real_tags": ["美国", "继续", "continues", "加密"]}, {"category": "", "categoryclass": "", "imagename": "acd75a6286e3d73c58af1698d1fb0877.jpg", "infoid": 1033705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从SG1电视剧中做了一个“工作”的星门模型。它旋转，人字形移动并点亮，当拨打正确的地址时，虫洞就建立起来了。虫洞是一个无限大的镜面效应。闸门是由DHD控制的。你可以在这里查看星际之门的运行视频：\n我喜欢3D打印、电子产品、编程和制作。我也喜欢电视剧《星际之门》，并决定制作一个电视剧中所见的星门模型。\n这是一个充满挑战和乐趣的项目，我必须学习很多新东西。这是一个非常耗时的项目。剧中使用了几种不同的星门游戏，我选择了SG1系列的原版。正如在电视剧中看到的那样，星门的技术工作也存在几个合乎逻辑的“故障”，甚至在不同的剧集中它的表现也不同。我已经尽我所能让它发挥了作用，同时尽可能地真实地表达了这部电视剧的感觉和精髓。\n当旅行者使用DHD输入地址时，星门环会旋转并将拨号符号放置在正确的V字形上。\n就像在电视节目中一样，虫洞可以保持打开38分钟。当达到时间限制时，播放提到时间限制的节目中的随机引用，虫洞就会脱离。\n想知道这一切是如何组合在一起的吗？在这里找到更多关于星际之门的信息，在这里找到更多关于DHD的信息。\n您对这个项目有什么问题或意见吗？请随意使用下面的表格。表单经过审核，您的评论在获得批准之前不会向世界显示。如果您想直接联系我，可以发邮件到kristian@thestargateproject t.com联系我。\n伟大的项目。我见过的最详细的模型。你有没有把3D文件发布到Thingiverse或其他类似的网站，或者愿意出售？", "note_en": "I have a made a “working” Stargate model from the SG1 TV-show. It spins, the chevrons move and lights up and when a correct address is dialed, the wormhole is established. The wormhole is an infinity mirror effect. The gate is controlled with a DHD. You can check out the video presentation of the Stargate in action here:\n  I like 3d printing, electronics, programming and making stuff. I also enjoy the Stargate  TV-series and decided to make a “working” model of the gate as seen in the TV-show.\n This was a challenging and fun project and I had to learn a lot of new stuff. This has been a very time consuming project. There are a few variations of Stargates used in the show and I chose to make the original one from the SG1 series. There are also several logical “glitches” in the technical workings of the gate as seen in the TV show and it even behaves differently in different episodes . I have made it work as best I can while staying as true as possible to the feeling and essence of the TV-Show.\n   The Stargate ring spins and places the dialed symbol on the correct chevron as the traveler is inputting the address by using the DHD.\n       As in the TV-Show the wormhole can stay open for 38 minutes. When the time limit is reached, a random quote from the show where the time limit is mentioned is played and the wormhole disengages.\n Want to know how it’s all put together? Find out more about the Stargate  here, and the DHD  here.\n  Have you got any questions or comments related to this project? Feel free to use the form below. The form is moderated and your comment will not appear to the world until it’s approved. Would you rather want to contact me directly, you can reach me at kristian@thestargateproject.com\n Great project. Highest detailed models I’ve seen. Did you post the 3D files to Thingiverse or other similar site or willing to sell?", "posttime": "2020-11-07 18:16:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,星门,stargate", "title": "交互式3D打印星门，具有虫洞效果", "title_en": "Interactive, 3D printed Stargate with wormhole effect", "transed": 1, "url": "https://thestargateproject.com/", "via": "", "real_tags": ["打印", "星门", "stargate"]}, {"category": "", "categoryclass": "", "imagename": "b0cd0a8ac6bf0f44ebb1ce6fceb77fee.jpg", "infoid": 1033704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有毒的人，如恶性自恋者、精神病患者和那些具有反社会特征的人，在人际关系中会做出不适应的行为，最终会剥削、贬低和伤害他们的亲密伴侣、家人和朋友。他们使用了过多的转移注意力的策略，扭曲了受害者的现实，转移了责任。虽然那些不自恋的人也可以使用这些策略，但施虐的自恋者过度使用这些策略，试图逃避对自己行为的责任。\n煤气灯是一种操纵性策略，可以用三个词的不同变体来描述：“那不是真的”、“你想象的”和“你疯了吗？”煤气灯可能是最阴险的操纵性策略之一，因为它会扭曲和侵蚀你的现实感；它会侵蚀你信任自己的能力，不可避免地会让你觉得自己没有理由去呼喊虐待和虐待。\n当一个自恋者、反社会者或精神病患者向你投掷毒气时，你可能倾向于用投掷气体来调和可能出现的认知失调。有两种相互矛盾的信念在争斗：这个人是对的，还是我可以相信我的经历？一个善于操控的人会让你相信，前者是一个不可避免的事实，而后者则是你的一端功能失调的迹象。\n为了抵制煤气灯，重要的是让自己置身于自己的现实之中--有时，把事情发生的时候写下来，告诉朋友，或者向支持网络重申你的经历，都有助于抵消煤气灯的影响。拥有一个令人信服的社区的力量在于，它可以将你从一个恶人的扭曲现实中重新引导回你自己的内心指引。\n中毒的一个明显迹象是，一个人长期不愿看到自己的缺点，并竭尽全力避免为自己的缺点负责。这就是所谓的投影。投射是一种防御机制，用于通过将自己的负面行为和特质归因于他人来推卸责任。它最终会离题，避免所有权和责任。\n根据自恋人格临床专家Martinez-Lewi博士的说法，虽然我们都在某种程度上参与了投射，但自恋者的投射通常是心理虐待的。恶性自恋者和反社会者不是承认自己的缺陷、不完美和错误，而是选择以一种痛苦和过度残忍的方式将自己的特征倾倒在毫无戒心的嫌疑人身上。他们宁愿受害者为自己的行为负责，并为自己感到羞耻，而不是承认自我改进是正常的。对于自恋者来说，这是一种将他们对自己的任何有害羞耻投射到另一个人身上的方式。\n例如，一个病态说谎的人可能会指责他们的伴侣撒谎；一个贫穷的配偶可能会说他们的丈夫“粘人”，试图把他们描绘成一个独立的人；一个粗鲁的员工可能会说他们的老板效率低下，试图逃避关于他们自己生产力的真相。\n自恋型施虐者喜欢玩“火焰转移游戏”。这个游戏的目标是：他们赢了，你输了，你或者整个世界都要为他们的一切错误负责。这样，当你被推入自我怀疑的海洋时，你可以照看他们脆弱的自我。很有趣，对吧？\n解决方案是什么？不要把你自己的同情心或同理心“投射”到一个有毒的人身上，也不要拥有这个有毒的人的任何投射。正如操控专家、作家乔治·西蒙博士(Dr.George Simon，2010年)在其著作《穿着绵羊的衣服》(In Sheep‘s Cloth)中指出的那样，将我们自己的良知和价值体系投射到他人身上，可能会遭到进一步的剥削。\n极端自恋者通常对自我洞察或改变不感兴趣。尽快切断联系，结束与有毒人士的互动是很重要的，这样你才能专注于自己的现实，验证自己的身份。你不必生活在别人的功能障碍的污水池里。\n如果你认为你会和一个有毒的人进行一次深思熟虑的讨论，那就准备好进行史诗般的思维操控，而不是对话式的专注。\n恶毒的自恋者和反社会者使用文字沙拉、循环对话、自我陶醉、投射和灯光来迷惑你，使你偏离正轨，如果你与他们有任何不同意见或以任何方式挑战他们的话。他们这样做是为了诋毁你、迷惑你、挫败你，分散你对主要问题的注意力，让你为自己作为一个人而感到内疚，因为你的真实想法和感受可能与他们自己的不同。在他们眼里，如果你恰好存在，你就是问题所在。\n花十分钟和一个有毒的自恋者争论，你会发现自己在想这场争论到底是怎么开始的。他们荒谬地声称天空是红色的，现在你的整个童年、家庭、朋友、职业和生活方式的选择都受到了攻击，你只是不同意他们的说法。这是因为你们的分歧挑剔了他们认为自己无所不能、无所不知的错误信念，导致了一种自恋的伤害。\n记住：有毒的人不会和你争论，他们本质上是在和自己争论，而你会听到他们冗长的、令人精疲力竭的独白。他们从戏剧中茁壮成长，并为之而活。每次你试图提供一个观点来反驳他们荒谬的断言时，你都是在给他们提供补给。不要给自恋者提供食物--相反，要让你自己确认他们的虐待行为才是问题所在，而不是你。一旦你预料到互动会升级，就缩短互动，把你的精力用在一些颓废的自我护理上。\n恶性自恋者并不总是智力上的高手--他们中的许多人智力上都很懒惰。他们不会花时间仔细考虑不同的观点，而是泛化你所说的一切，发表笼统的声明，既不承认你的论点中的细微差别，也不考虑你所崇敬的多种观点。更好的是，为什么不给你贴上一个完全否定你观点的标签呢？\n在更大的范围内，概括和笼统的陈述使那些不符合社会不受支持的假设、模式和刻板印象的经验失效；它们也被用来维持现状。这种形式的离题夸大了一种观点，以至于社会正义问题可能会变得完全模糊。例如，针对受人喜爱的人物的强奸指控经常会提醒人们，发生了一些关于强奸的虚假报告。虽然这种情况确实发生了，但很少见，在这种情况下，一个人的行为被贴上了大多数人的行为的标签，而具体的报告本身仍然没有得到解决。\n这些日常的微侵略性行为也会发生在有毒的关系中。例如，如果你向一个自恋的施虐者提出他们的行为是不可接受的，他们通常会对你的过敏症一概而论，或者像“你永远不满意”或“你总是太敏感”这样的概括，而不是解决手头的真正问题。你可能有时过于敏感，但也有可能施虐者在大部分时间里也是麻木不仁和残忍的。\n坚持你的真理，不要一概而论，要意识到它们实际上是非黑即白的不合逻辑的思维形式。恶毒的人挥舞着笼统的声明，并不代表着丰富的体验--他们代表的是他们的单一体验和过度膨胀的自我意识中的有限体验。\n在恶毒的自恋者或反社会的人手中，你的不同观点、合法情感和生活经历都会转化为性格缺陷和你非理性的证据。\n自恋者编造一些夸张的故事来重塑你实际说的话，以此来让你的观点显得荒谬或令人发指。假设你提出了这样一个事实，即你对一个有毒的朋友对你说话的方式感到不满。作为回应，他或她可能会把话塞进你的嘴里，说：“哦，那么现在你是完美的了？”或者“所以我是个坏人，是吗？”当你除了表达你的感受什么都没做的时候。这使得他们使你无法对他们不恰当的行为产生想法和情绪的权利失效，并在你试图建立界限时向你灌输一种负罪感。\n这也是一种流行的转移注意力和认知扭曲的形式，被称为“读心术”。有毒的人通常认为他们知道你的想法和感受。他们长期根据自己的触发因素得出结论，而不是后退一步，认真评估形势。他们根据自己的妄想和谬误采取相应的行动，对由此造成的伤害毫无歉意。因为口是心非而臭名昭著，他们把你描绘成一个你没有的意图或古怪的观点。他们指责你认为他们有毒--甚至在你有机会指责他们的行为之前--这也是一种先发制人的防御方式。\n简单地说一句“我从来没有说过”，如果对方继续指责你做了或说了一些你没有说过的话，你就应该走开，这有助于在这种类型的互动中设定一个明确的界限。只要这个有毒的人能够转移和偏离他们自己的行为，他们就成功地说服了你，你应该为给他们任何现实的反馈而感到“羞耻”。\n建设性批评和破坏性批评的区别在于存在人身攻击和不可能的标准。这些所谓的“批评者”通常不想帮助你提高，他们只是想挑剔你，拉你下水，以任何他们能做的方式来替你找替罪羊。辱骂的自恋者和反社会的人使用一种被称为“移动球门柱”的逻辑谬论，以确保他们有充分的理由永远对你不满。这就是，即使你已经提供了世界上所有的证据来证实你的论点，或者采取了行动来满足他们的要求，他们仍然对你产生了另一种期望，或者要求你提供更多的证据。\n你的事业成功吗？然后，自恋者就会开始挑剔为什么你还不是百万富翁。你是否已经满足了他们被过度迎合的需求？现在是时候证明你也可以保持“独立”了。目标帖子会永远改变，甚至可能彼此都不相关；除了让你争抢自恋者的认可和认可之外，它们没有任何其他意义。\n通过一次又一次地提高期望值，或者完全改变期望值，高度操控和有毒的人会给你灌输一种无处不在的不值一提的感觉，永远感觉不到足够的东西。自恋者指出一个不相干的事实或你做错的一件事，并将注意力集中在这件事上，就会转移你的注意力，让你沉迷于任何缺点或弱点。他们让你思考你将不得不满足他们的下一个期望--直到最后你不遗余力地试图满足他们的每一个需求--才意识到这并没有改变他们对待你的可怕方式。\n不要纠结于吹毛求疵和改变目标位置--如果有人选择一遍又一遍地重复一个不相干的观点，以至于他们不承认你为证实自己的观点或满足他们所做的工作，他们的动机并不是为了更好地理解。这会进一步激起你的感觉，好像你必须不断地证明自己。认可并认可自己。要知道，你已经足够了，你不必总是觉得自己在某种程度上是不足的或不值得的。\n这种策略就是我喜欢称之为“我呢？”综合症。它从字面上偏离了实际的主题，将人们的注意力重新引向了一个完全不同的问题。自恋者不希望你谈论让他们对任何事情负责的话题，所以他们会改变讨论方向，让他们受益。抱怨他们疏忽的教育？他们会指出你七年前犯下的一个错误。这种转移注意力的方式在时间和主题内容上没有限制，通常以一句话开头，比如“What What the Time When…”\n在宏观层面上，这些转移注意力的做法破坏了挑战现状的讨论。例如，关于同性恋权利的讨论可能很快就会被某个人打断，他提出了另一个社会正义问题，只是为了分散人们对主要论点的注意力。\n正如《畅所欲言：21世纪妇女和女孩手册》一书的作者塔拉·莫斯指出的那样，要想恰当地解决和解决问题，需要有针对性--这并不意味着提出的问题无关紧要，只是意味着具体的时间和地点可能不是讨论这些问题的最佳时机。\n不要偏离轨道--如果有人对你进行了一次切换，你可以运用我所说的“打破记录”的方法，继续陈述事实，而不会让他们分心。通过说：“这不是我要说的。”让我们把注意力集中在真正的问题上。“。如果他们不感兴趣，那就脱离他们，把你的精力花在更有建设性的事情上--比如，不要和一个心理年龄还在蹒跚学步的人辩论。\n当过度的权利感、虚假的优越感和浮夸的自我意识受到任何挑战时，自恋的施虐者和其他有毒的人都会感到非常危险。他们往往会对别人提出无理的要求--同时惩罚你没有达到他们不可能达到的期望。\n他们没有成熟地处理分歧或妥协，而是试图向你灌输对不同意或遵从他们要求的后果的恐惧，从而转移你拥有自己身份和观点的权利。对他们来说，任何挑战都会带来最后通牒，“要么做这个，要么我就做那个”成为他们每天的口头禅。\n如果有人对你设定界限或持不同意见的反应是威胁你屈服，无论是几乎不加掩饰的威胁，还是公开承认他们的计划，这都是一个危险信号，表明某人拥有很高的权利，没有妥协的计划。认真对待威胁，向自恋者表明你是认真的；记录威胁，并尽可能在法律上可行的情况下报告它们。\n自恋者会先发制人地毁掉任何他们认为威胁到自己优越感的东西。在他们的世界里，只有他们才有可能是对的，任何敢说不是这样的人都会制造一种自恋伤害，导致自恋愤怒。正如医学博士马克·古尔斯顿(Mark Goulston)所断言的那样，自恋愤怒并不是由于缺乏自尊，而是一种高度的权利感和虚假的优越感。\n最底层的人在想不出更好的方法来操纵你的观点或微观管理你的情绪时，会以辱骂的形式诉诸自恋愤怒。辱骂是一种快速而简单的方式，可以贬低你，贬低你，侮辱你的智力、外表或行为，同时使你作为一个独立的人、有权表达自己观点的权利失效。\n辱骂也可以用来批评你的信仰、观点和见解。一个经过充分研究的观点或见多识广的观点在恶性自恋者或反社会者手中突然变得“愚蠢”或“愚蠢”，他们感到受到威胁，无法做出尊重、令人信服的反驳。他们不是针对你的论点，而是把你作为一个人，并试图以任何可能的方式破坏你的可信度和智商。重要的是要结束任何由辱骂组成的互动，并传达你不会容忍的信息。不要将其内在化：要意识到他们求助于骂人是因为他们缺乏更高层次的方法。\n有毒的人会让你把自己的优势、才华和快乐记忆与虐待、沮丧和不尊重联系在一起。他们通过暗地里和公开地贬低他们曾经理想化的品质和特点，破坏你的目标，破坏你的庆祝活动、假期和假期，从而做到这一点。他们甚至会让你与你的朋友和家人隔绝，让你在经济上依赖他们。就像巴甫洛夫的狗一样，随着时间的推移，你基本上被“训练”成害怕去做那些曾经让你的生活变得充实的事情。\n自恋者、反社会者、精神病患者和其他有毒瘾的人这样做是因为他们希望把注意力转移回自己身上，以及你如何取悦他们。如果他们之外有任何东西可能威胁到他们对你生活的控制，他们会试图摧毁它。他们需要在任何时候都成为关注的中心。在理想化阶段，你曾经是自恋者世界的中心--现在自恋者变成了你的中心。\n自恋者天生就有病态的嫉妒心理，他们不想让任何东西干扰他们对你的影响。你的幸福代表着他们觉得在他们肤浅的生活中无法拥有的一切。毕竟，如果你知道除了有毒的人，你还可以从其他来源获得认可、尊重和爱，还有什么能阻止你离开他们呢？对于有毒的人来说，小小的条件反射会让你如履薄冰，离你的远大梦想只有一步之遥。\n当有毒类型的人不能控制你看待自己的方式时，他们开始控制别人如何看待你；他们扮演殉道者的角色，而你则被贴上有毒的标签。诽谤运动是一种先发制人的打击，目的是破坏你的声誉和诽谤你的名字，这样你就没有可以依靠的支持网络，以免你决定脱离并切断与这个有毒的人的联系。他们甚至可能跟踪和骚扰你或你认识的人，以此来“揭露”关于你的真相；这种曝光是一种隐藏他们自己的虐待行为的方式，而把它投射到你身上。\n一些诽谤运动甚至可以让两个人或两个群体相互竞争。与自恋者处于虐待关系中的受害者通常不知道他们在关系中说了些什么，但他们最终会在谎言被抛弃后不久发现这些谎言。\n有毒的人会在你背后(当着你的面)说三道四，对你所爱的人或他们所爱的人诽谤你，编造故事，把你描绘成侵略者，而他们却扮演受害者，并声称你做了他们担心你会指责他们做的事情。他们还会有条不紊地、秘密地、故意地虐待你，这样他们就可以利用你的反应来证明他们是你虐待的所谓“受害者”。\n处理诽谤运动的最好方法是注意你的反应，并坚持事实。这一点尤其适用于与自恋者的高冲突离婚，这些自恋者可能会利用你对他们对你的挑衅的反应。记录任何形式的骚扰、网络欺凌或跟踪事件，并尽可能通过律师与你的自恋者交谈。如果你觉得跟踪和骚扰正在失控，你可能希望采取法律行动；如果是这样的话，找到一位精通自恋型人格障碍的律师是至关重要的。当自恋者的假面具开始脱落时，你的品格和正直将不言而喻。\n有毒的人会让你经历理想化的阶段，直到你完全被吸引并投入到开始与你的友谊或关系中。然后，他们开始贬低你的价值，同时侮辱他们。\n.", "note_en": "Toxic people such as  malignant narcissists,  psychopaths and those with  antisocial traits engage in maladaptive behaviors in relationships that ultimately exploit, demean and hurt their intimate partners, family members and friends. They use a plethora of diversionary tactics that distort the reality of their victims and deflect responsibility. Although those who are not narcissistic can employ these tactics as well, abusive narcissists use these to an excessive extent in an effort to escape accountability for their actions.\n   Gaslighting is a manipulative tactic that can be described in different variations of three words: “That didn’t happen,” “You imagined it,” and “Are you crazy?”  Gaslighting is perhaps one of the most insidious manipulative tactics out there because it works to distort and erode your sense of reality; it eats away at your ability to trust yourself and inevitably disables you from feeling justified in calling out abuse and mistreatment.\n When a  narcissist, sociopath or psychopath gaslights you, you may be prone to gaslighting yourself as a way to reconcile the cognitive dissonance that might arise. Two conflicting beliefs battle it out: is this person right or can I trust what I experienced? A manipulative person will convince you that the former is an inevitable truth while the latter is a sign of dysfunction on your end.\n In order to resist gaslighting, it’s important to ground yourself in your own reality – sometimes writing things down as they happened, telling a friend or reiterating your experience to a support network can help to counteract  the gaslighting effect. The power of having a validating community is that it can redirect you from the distorted reality of a malignant person and back to your own inner guidance.\n  One sure sign of toxicity is when a person is chronically unwilling to see his or her own shortcomings and uses everything in their power to avoid being held accountable for them. This is known as projection. Projection is a defense mechanism used to displace responsibility of one’s negative behavior and traits by attributing them to someone else. It ultimately acts as a digression that avoids ownership and accountability.\n While we all engage in projection to some extent, according to Narcissistic Personality clinical expert Dr. Martinez-Lewi, the projections of a narcissist are often  psychologically abusive. Rather than acknowledge their own flaws, imperfections and wrongdoings, malignant narcissists and sociopaths opt to dump their own traits on their unsuspecting suspects in a way that is painful and excessively cruel. Instead of admitting that self-improvement may be in order, they would prefer that their victims take responsibility for their behavior and feel ashamed of themselves. This is a way for a narcissist to project any toxic shame they have about themselves onto another.\n For example, a person who engages in pathological lying may accuse their partner of fibbing; a needy spouse may call their husband “clingy” in an attempt to depict them as the one who is dependent; a rude employee may call their boss ineffective in an effort to escape the truth about their own productivity.\n Narcissistic abusers love to play the “blameshifting game.” Objectives of the game: they win, you lose, and you or the world at large is blamed for everything that’s wrong with  them. This way, you get to babysit their fragile ego while you’re thrust into a sea of self-doubt. Fun, right?\n Solution? Don’t “project” your own sense of compassion or empathy onto a toxic person and don’t own any of the toxic person’s projections either. As manipulation expert and author Dr. George Simon (2010) notes in his book   In Sheep’s Clothing, projecting our own conscience and value system onto others has the potential consequence of being met with further exploitation.\n Narcissists on the extreme end of the spectrum usually have no interest in self-insight or change. It’s important to cut ties and end interactions with toxic people as soon as possible so you can get centered in your own reality and validate your own identity. You don’t have to live in someone else’s cesspool of dysfunction.\n  If you think you’re going to have a thoughtful discussion with someone who is toxic, be prepared for epic mindfuckery rather than conversational mindfulness.\n Malignant narcissists and sociopaths use  word salad, circular conversations, ad hominem arguments, projection and gaslighting to disorient you and get you off track should you ever disagree with them or challenge them in any way. They do this in order to discredit, confuse and frustrate you, distract you from the main problem and make you feel guilty for being a human being with actual thoughts and feelings that might differ from their own. In their eyes,  you are the problem if you happen to exist.\n Spend even ten minutes arguing with a toxic narcissist and you’ll find yourself wondering how the argument even began at all. You simply disagreed with them about their absurd claim that the sky is red and now your entire childhood, family, friends, career and lifestyle choices have come under attack. That is because your disagreement picked at their false belief that they are omnipotent and omniscient, resulting in a  narcissistic injury.\n Remember: toxic people don’t argue with you, they essentially argue with themselves and you become privy to their long, draining monologues. They thrive off the drama and they live for it. Each and every time you attempt to provide a point that counters their ridiculous assertions, you feed them  supply. Don’t feed the narcissists supply – rather, supply yourself with the confirmation that their abusive behavior is the problem, not you. Cut the interaction short as soon as you anticipate it escalating and use your energy on some decadent self-care instead.\n  Malignant narcissists aren’t always intellectual masterminds – many of them are intellectually lazy. Rather than taking the time to carefully consider a different perspective, they generalize anything and everything you say, making blanket statements that don’t acknowledge the nuances in your argument or take into account the multiple perspectives you’ve paid homage to. Better yet, why not put a label on you that dismisses your perspective altogether?\n On a larger scale, generalizations and blanket statements invalidate experiences that don’t fit in the unsupported assumptions, schemas and stereotypes of society; they are also used to maintain the status quo. This form of digression exaggerates one perspective to the point where a social justice issue can become completely obscured. For example, rape accusations against well-liked figures are often met with the reminder that there are false reports of rape that occur. While those do occur,  they are rare, and in this case, the actions of one become labeled the behavior of the majority while the specific report itself remains unaddressed.\n These everyday microaggressions also happen in toxic relationships. If you bring up to a narcissistic abuser that their behavior is unacceptable for example, they will often make blanket generalizations about your hypersensitivity or make a generalization such as, “You are  never satisfied,” or “You’re  always too sensitive” rather than addressing the real issues at hand. It’s possible that you are oversensitive at times, but it is also possible that the abuser is also insensitive and cruel the majority of the time.\n Hold onto your truth and resist generalizing statements by realizing that they are in fact forms of black and white illogical thinking. Toxic people wielding blanket statements do not represent the full richness of experience – they represent the limited one of their singular experience and overinflated sense of self.\n  In the hands of a malignant narcissist or sociopath, your differing opinions, legitimate emotions and lived experiences get translated into character flaws and evidence of your irrationality.\n Narcissists weave tall tales to reframe what you’re actually saying as a way to make your opinions look absurd or heinous. Let’s say you bring up the fact that you’re unhappy with the way a toxic friend is speaking to you. In response, he or she may put words in your mouth, saying, “Oh, so now  you’re perfect?” or “So I am a bad person, huh?” when you’ve done nothing but express your feelings. This enables them to invalidate your right to have thoughts and emotions about their inappropriate behavior and instills in you a sense of guilt when you attempt to establish boundaries.\n This is also a popular form of diversion and cognitive distortion that is known as  “mind reading.” Toxic people often presume they know what you’re thinking and feeling. They chronically jump to conclusions based on their own triggers rather than stepping back to evaluate the situation mindfully. They act accordingly based on their own delusions and fallacies and make no apologies for the harm they cause as a result. Notorious for putting words in your mouth, they depict you as having an intention or outlandish viewpoint you didn’t possess. They accuse you of thinking of them as toxic – even before you’ve gotten the chance to call them out on their behavior – and this also serves as a form of preemptive defense.\n Simply stating, “I never said that,” and walking away should the person continue to accuse you of doing or saying something you didn’t can help to set a firm boundary in this type of interaction. So long as the toxic person can blameshift and digress from their own behavior, they have succeeded in convincing you that you should be “shamed” for giving them any sort of realistic feedback.\n  The difference between constructive criticism and destructive criticism is the presence of a personal attack and impossible standards. These so-called “critics” often don’t want to help you improve, they just want to nitpick, pull you down and scapegoat you in any way they can. Abusive narcissists and sociopaths employ a logical fallacy known as  “moving the goalposts” in order to ensure that they have every reason to be perpetually dissatisfied with you. This is when, even after you’ve provided all the evidence in the world to validate your argument or taken an action to meet their request, they set up another expectation of you or demand more proof.\n Do you have a successful career? The narcissist will then start to pick on why you aren’t a multi-millionaire yet. Did you already fulfill their need to be excessively catered to? Now it’s time to prove that you can also remain “independent.” The goal posts will perpetually change and may not even be related to each other; they don’t have any other point besides making you vie for the narcissist’s approval and validation.\n By raising the expectations higher and higher each time or switching them completely, highly manipulative and toxic people are able to instill in you a pervasive sense of unworthiness and of never feeling quite “enough.” By pointing out one irrelevant fact or one thing you did wrong and developing a hyperfocus on it, narcissists get to divert from your strengths and pull you into obsessing over any flaws or weaknesses instead. They get you thinking about the next expectation of theirs you’re going to have to meet – until eventually you’ve bent over backwards trying to fulfill their every need – only to realize it didn’t change the horrific way they treated you.\n Don’t get sucked into nitpicking and changing goal posts – if someone chooses to rehash an irrelevant point over and over again to the point where they aren’t acknowledging the work you’ve done to validate your point or satisfy them, their motive isn’t to better understand. It’s to further provoke you into feeling as if you have to constantly prove yourself. Validate and approve of yourself. Know that you are enough and you don’t have to be made to feel constantly deficient or unworthy in some way.\n  This type of tactic is what I like to call the “What about me?” syndrome. It is a literal digression from the actual topic that works to redirect attention to a different issue altogether. Narcissists don’t want you to be on the topic of holding them accountable for anything, so they will reroute discussions to benefit them. Complaining about their neglectful parenting? They’ll point out a mistake you committed seven years ago. This type of diversion has no limits in terms of time or subject content, and often begins with a sentence like “What about the time when…”\n On a macrolevel, these diversions work to derail discussions that challenge the status quo. A discussion about gay rights, for example, may be derailed quickly by someone who brings in another social justice issue just to distract people from the main argument.\n As Tara Moss, author of  Speaking Out: A 21st Century Handbook for Women and Girls, notes, specificity is needed in order to resolve and address issues appropriately – that doesn’t mean that the issues that are being brought up don’t matter, it just means that the specific time and place may not be the best context to discuss them.\n Don’t be derailed – if someone pulls a switcheroo on you, you can exercise what I call the “broken record” method and continue stating the facts without giving in to their distractions. Redirect their redirection by saying, “That’s not what I am talking about. Let’s stay focused on the real issue.” If they’re not interested, disengage and spend your energy on something more constructive – like not having a debate with someone who has the mental age of a toddler.\n  Narcissistic abusers and otherwise toxic people feel very threatened when their  excessive sense of entitlement, false sense of superiority and grandiose sense of self are challenged in any way. They are prone to making unreasonable demands on others – while punishing you for not living up to their impossible to reach expectations.\n Rather than tackle disagreements or compromises maturely, they set out to divert you from your right to have your own identity and perspective by attempting to instill fear in you about the consequences of disagreeing or complying with their demands. To them, any challenge results in an ultimatum and “do this or I’ll do that” becomes their daily mantra.\n If someone’s reaction to you setting boundaries or having a differing opinion from your own is to threaten you into submission, whether it’s a thinly veiled threat or an overt admission of what they plan to do, this is a red flag of someone who has a high degree of entitlement and has no plans of compromising. Take threats seriously and show the narcissist you mean business; document threats and report them whenever possible and legally feasible.\n  Narcissists preemptively blow anything they perceive as a threat to their superiority out of proportion. In their world, only they can ever be right and anyone who dares to say otherwise creates a narcissistic injury that results in  narcissistic rage. As Mark Goulston, M.D. asserts, narcissistic rage does not result from low self-esteem but rather a high sense of entitlement and false sense of superiority.\n The lowest of the low resort to narcissistic rage in the form of name-calling when they can’t think of a better way to manipulate your opinion or micromanage your emotions. Name-calling is a quick and easy way to put you down, degrade you and insult your intelligence, appearance or behavior while invalidating your right to be a separate person with a right to his or her perspective.\n Name-calling can also be used to criticize your beliefs, opinions and insights. A well-researched perspective or informed opinion suddenly becomes “silly” or “idiotic” in the hands of a malignant narcissist or sociopath who feels threatened by it and cannot make a respectful, convincing rebuttal. Rather than target your argument, they target you as a person and seek to undermine your credibility and intelligence in any way they possibly can. It’s important to end any interaction that consists of name-calling and communicate that you won’t tolerate it. Don’t internalize it: realize that they are resorting to name-calling because they are deficient in higher level methods.\n   Toxic people condition you to associate your strengths, talents, and happy memories with abuse, frustration and disrespect. They do this by sneaking in covert and overt put-downs about the qualities and traits  they once idealized as well as sabotaging your goals, ruining celebrations, vacations and holidays. They may even isolate you from your friends and family and make you financially dependent upon them. Like  Pavlov’s dogs, you’re essentially “trained” over time to become afraid of doing the very things that once made your life fulfilling.\n Narcissists, sociopaths, psychopaths and otherwise toxic people do this because they wish to divert attention back to themselves and how you’re going to please them. If there is anything outside of them that may threaten their control over your life, they seek to destroy it. They need to be the center of attention at all times. In the idealization phase, you were once the center of a narcissist’s world – now the narcissist becomes the center of yours.\n Narcissists are also naturally  pathologically envious and don’t want anything to come in between them and their influence over you. Your happiness represents everything they feel they cannot have in their emotionally shallow lives. After all, if you learn that you can get validation, respect and love from other sources besides the toxic person, what’s to keep you from leaving them? To toxic people, a little conditioning can go a long way to keep you walking on eggshells and falling just short of your big dreams.\n  When toxic types can’t control the way you see yourself, they start to control how others see you; they play the martyr while you’re labeled the toxic one. A smear campaign is a preemptive strike to sabotage your reputation and slander your name so that you won’t have a support network to fall back on lest you decide to detach and cut ties with this toxic person. They may even stalk and harass you or the people you know as a way to supposedly “expose” the truth about you; this exposure acts as a way to hide their own abusive behavior while projecting it onto you.\n Some smear campaigns can even work to pit two people or two groups against each other. A victim in an abusive relationship with a narcissist often doesn’t know what’s being said about them during the relationship, but they eventually find out the falsehoods shortly after they’ve been discarded.\n Toxic people will gossip behind your back (and in front of your face), slander you to your loved ones or their loved ones, create stories that depict you as the aggressor while they play the victim, and claim that you engaged in the same behaviors that they are afraid you will accuse them of engaging in. They will also methodically, covertly and deliberately abuse you so they can use your reactions as a way to prove that they are the so-called “victims” of your abuse.\n The best way to handle a smear campaign is to stay mindful of your reactions and stick to the facts. This is especially pertinent for high-conflict divorces with narcissists who may use your reactions to their provocations against you. Document any form of harassment, cyberbullying or stalking incidents and always speak to your narcissist through a lawyer whenever possible. You may wish to take legal action if you feel the stalking and harassment is getting out of control; finding a  lawyer who is well-versed in Narcissistic Personality Disorder is crucial if that’s the case. Your character and integrity will speak for itself when the narcissist’s false mask begins to slip.\n  Toxic people put you through an idealization phase until you’re sufficiently hooked and invested in beginning a friendship or relationship with you. Then, they begin to devalue you while insulting t\n......", "posttime": "2020-11-07 18:16:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "注意力,tactics,自恋", "title": "转移注意力的策略有毒的人用来沉默和贬低", "title_en": "Diversionary tactics toxic people use to silence and degrade", "transed": 1, "url": "https://thoughtcatalog.com/shahida-arabi/2016/06/20-diversion-tactics-highly-manipulative-narcissists-sociopaths-and-psychopaths-use-to-silence-you/", "via": "", "real_tags": ["注意力", "tactics", "自恋"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过未连接设备(包括已连接设备和未连接设备)泄露数据是一个非常有趣的话题，通常被称为“软风暴”。这通常是昂贵得离谱的实验室设备的领域，源代码没有公布等等。在这里，我想用最简单的设备和方法来演示这一点，并使其非常容易复制。\n要传输电磁波，需要有一个由高频电源驱动的导体。使用各种总线：监视器电缆、PCI总线等。这里我建议使用以太网。\n以太网电缆由4条阻抗为100欧姆的双绞线组成，传输的射频信号范围在百分之几十到百分之一兆赫之间。电缆(不对称等)或接口中的任何缺陷都会导致无线电信号被辐射。\n可以使用不同的方法来调制信号。为了简单起见，这里我将使用摩尔斯电码。这也使得人们只需听一听就可以判断信噪比。如果一个人知道摩尔斯电码，也可以在不需要额外设备的情况下用耳朵破译它，如果不知道，也有很多软件可以做到这一点(尽管通常比有经验的人工操作员的性能差得多)。\n传输是通过非常简单的Shell脚本实现的。只需要bash、ethtool和ping。这使得该脚本可以很容易地在嵌入式设备和其他平台上使用，在这些平台上，传输二进制文件、安装Python环境等可能会遇到问题。\n各种以太网速度具有不同的调制速度、类型和编码。通过切换，我们可以调制从电线泄漏的射频信号。\n10BASE-T采用曼彻斯特编码，码率为10 MHz。这用作空间信号(逻辑0)。\n100BASE-T使用4b5b编码和NRZI，符号速率为125 MHz。这导致容易接收125 MHz左右的信号，这被用作标记信号(逻辑1)。\n以太网在没有数据包的情况下发送空闲序列，因此信号是恒定的。必须改变接口的速度才能显示信号，而不必发送数据包。\n传输是通过一个简单的bash脚本实现的，该脚本发送作为参数提供的短文本文件的内容，如果没有提供，则发送“etherify demo”。该信号可在125 MHz左右以莫尔斯电码的形式接收，请在接收器中使用USB或CW模式，并使用窄带滤波器。\n确保两个覆盆子PI已连接，并且它们之间有以太网链路(通过LED发出信号)。\n它可以通过一个简单的莫克森定向天线和一个业余无线电接收器(也可以使用SDR)通过耳朵进行解码。\n如果有疑问，让一位经验丰富的业余无线电操作员来解码。我无法用软件解码100米的信号。\n以1Gbps发送数据流也会在125 MHz处产生可检测到的信号变化。可能还有其他频率的信号更易读，但设备可以接收到125兆赫的信号。这可能是通过在生成分组时加载电源电压来实现的。电压的变化可能会略微改变某些时钟的频率，从而产生FSK(准确地说是F1a)。请注意，这并不适用于所有硬件，这可以用接口负载调制频率的假设来解释。\n大流量代表逻辑1，而没有流量代表逻辑0。\n传输被实现为一个简单的bash脚本，它发送作为参数提供的短文本文件的内容，如果没有提供，则发送“etherify demo”。该信号可以在125 MHz左右以莫尔斯电码的形式接收，请在接收器中使用USB或CW模式，并使用窄带滤波器，也可以使用AM模式。\n确保两个覆盆子PI已连接，并且它们之间有以太网链路(通过LED发出信号)。将一个Raspberry PI设置为192.168.1.1/24，将另一个设置为192.168.1.2/24(IP地址可以在etherify2脚本中更改)。确保两个树莓PI具有IP连接并且可以相互ping通，并且接口速率为1Gbps。\n通过简单的莫克森定向天线和业余无线电接收器，信号可以在30米远的地方用耳朵进行解码。\n所使用的设备和以太网电缆类型不同，射频辐射也不同。为了使这个演示可重现，我使用了两个Raspberry PI 4，因为它使每个人都可以很容易地获得用于这个实验的确切硬件。树莓PI是通过官方提供的树莓PI 4初学者工具包提供的以太网线连接起来的。使用的是入门工具包中SD卡上提供的普通Raspbian 10操作系统。这些设备是通过串行控制台访问的。\n电力是通过电力银行提供的。这是为了避免与电源电压连接，因为电力线可能是无意中的散热器。\n信号是通过125 MHz的莫克森天线和带有500赫兹连续波滤波器的YAEU FT-817收发机接收的。摩尔斯电码是通过耳朵接收和解码的。\n这些实验可以在其他带有以太网端口的设备上重复进行，例如两台笔记本电脑，运行任何Linux发行版并安装所需的工具(大多数设备都会提供现成的工具)。这些设备应该能够在交换速度之后非常快地建立以太网链路。SDR接收器可以用于接收，任何天线都可以接收125 MHz(首先在近距离测试)。莫尔斯电码译码可以通过软件完成，例如fldigi[3]。\n最简单的接收设置可能是带有RTL-SDR加密狗的GQRX，以及用于决定信号的Fldigi。如果信号没有被解码，它应该播放给可以通过耳朵接收摩尔斯电码的人。通常情况下，这样的人能够很容易地破译它。\n实验应该首先在电磁安静的区域进行，附近的以太网网络会产生很多干扰。如果在其他以太网附近进行测试，请将天线移动得更近，并尽可能降低接收器增益。\n通过简单的天线和适中的接收器，可以在100米处(醚化1)和30米(醚化2)用耳朵来解码信号。具有更大增益和更好接收器的天线肯定会产生更大的射程。\n附近的以太网网络在相同的频率上会产生大量干扰。125兆赫的频率落在108-137兆赫的空中频段，人们可以预料到来自附近飞机和机场的强信号对附近频率的干扰。因此，首先应在干扰较小的区域进行测试，如室外区域或地下停车场。\n选择125 MHz频率是因为有可用的设备。一个人很难拿着和操作天线、笔记本电脑和SDR接收器。其他频率可能更好。\nEtherify 1可以提供更好的范围，但是Etherify 2可以使用网络中其他位置的设备作为发送器。该设备可能在物理上更靠近接收器，或者可能具有更大的以太网电缆泄漏。通过向网络发送UDP数据报或可能的其它数据，可将Etherify 2用作非根用户。\n我没有对类似的以前的出版物进行过广泛的搜索，但几次快速搜索都没有找到任何结果。如果你知道什么，请告诉我。\n如果您引用这一点，请包括网页地址和属性Jacek Lipkowski(SQ5BPF)。电子邮件可以发送到my_callsign@this_domain。", "note_en": "Leaking data via out of unconnected devices (both connected and unconnected) is a very interesting topic, often called “soft tempest”. Often this is the realm of absurdly costly lab equipment, source code isn’t published etc.  Here i would like to demonstrate this using the simplest equipment and means, and make it very easy to reproduce.\n To transmit an elecromagnetic wave one needs to have a conductor driven by a high frequency source. Various busses are used: monitor cables, pci buses etc. Here i propose the use of ethernet.\n An ethernet cable consists of 4 twisted pair lines with 100ohm impedance., which carries RF signals in the tens to hundredths MHz range. Any imperfections in the cable (asymetry etc) or in the interface will cause radio signals to be radiated.\n Signals can be modulated using different methods. Here i will use morse code for simplicity. This also allows one to judge the signal to noise ratio by just listening. It is also possible to decode it by ear without additional devices if one knows morse code, if not there is a lot of software that can do it (although usually with much worse performance than an experienced human operator).\n Transmission is implemented via very simple shell scripts. Only bash, ethtool and ping is needed. This enables the script to be used easily on embedded devices and other platforms where shipping binaries, installing a python environment etc might be a problem.\n   Various ethernet speeds have different modulation speeds, types and encoding. By switching between we can modulate the RF signal leaking from the wires.\n 10base-T uses manchester encoding with 10MHz symbol rate. This is used as the space signal (logical 0).\n 100base-T uses 4B5B encoding with NRZI at 125MHz symbol rate . This results in an easy to receive signal around 125MHz, this is used as the mark signal (logical 1).\n Ethernet transmits an idle sequence when no packets are carried, so the signal is constant. No packets have to be transmitted for the signal to be present, on the speed of the interface has to be changed.\n The transmission is implemented by a simple bash script, which sends the content of a short text file given as the argument, or “etherify demo” if none is given. The signal can be received as morse code around 125MHz, please use USB or CW mode in the receiver and use a narrow filter.\n  Ensure that the two raspberry PIs are connected and that there is an ethernet link between them (signalled via the LEDs).\n       The is decodable by ear with a simple Moxon directional antenna and a ham radio receiver (SDR could be used too).\n     If in doubt let an experienced amateur radio operator decode it. I was not able to decode the signal at 100m with software.\n  Sending a stream of data at 1Gbps also produces a detectable signal change at 125MHz. There may be other frequencies where the signals were more readable, but equipment was avaliable to receive at 125MHz. This probably works by loading the supply voltage when the packets are generated. A change of voltage probably changes the frequency of some clock slightly, thus generating FSK (F1A to be exact). Note that this doesn’t work with all hardware, which could be explained by the hypothesis about the frequency being modulated by the interface load.\n A large volume of traffic represents a logical 1, while no traffic represents logical 0.\n The transmission is implemented as a simple bash script, which sends the content of a short text file given as the argument, or “etherify demo” if none is given. The signal can be received as morse code around 125MHz, please use USB or CW mode in the receiver and use a narrow filter, also AM mode can be used.\n  Ensure that the two raspberry PIs are connected and that there is an ethernet link between them (signalled via the LEDs). Set one raspberry PI to 192.168.1.1/24 and the other to 192.168.1.2/24 (the IP address can be changed in the etherify2 script). Ensure that the two raspberry PIs have IP connectivity and can ping each other, and that he interface rate is 1Gbps.\n      The signal was decodable by ear at a distance of 30m with a simple Moxon directional antenna and a ham radio receiver.\n      The RF radiation differs with different equipment and ethernet cable type being used. In order to make this demo reproducible i used two Raspberry PI 4, because it makes it easy for everyone to obtain the exact hardware that was used for this experiment. The raspberry PIs were connected using the ethernet cable supplied with the official Raspberry PI 4 starter kit. The stock Raspbian 10 operating system, which was supplied on the SD cards  in the Starter Kit, was used. The devices were accessed via the serial console.\n Power was provided via powerbanks. This was to avoid a connection to the mains voltage, because the powerline could be an unintentional radiator.\n    The signal was received via a Moxon antenna built for 125MHz and a Yaesu FT-817 transceiver with a 500Hz CW filter. Morse code was received and decoded by ear.\n The experiments can be repeated with other devices with ethernet ports, for example two laptops, running any linux distribution and the required tools installed (most will come with them out of the box). The devices should be able to establish an ethernet link very quickly upon switching speed. An SDR receiver can be used for reception, with any antenna that can receive 125MHz (test first at close range). Morse code decoding can be done via software, for example fldigi [3].\n The easiest receive setup would probably be gqrx with an rtl-sdr dongle, and fldigi for deciding the signals. If the signal is not decoded, it should be played to someone who can receive morse code by ear. Often such person will be able to decode it with ease.\n The experiment should be first conducted in an electromagnetically quiet area, nearby ethernet networks will generate a lot of interference. If testing in the vicinity of other ethernet networks move the antenna closer, and reduce the receiver gain as much as possible.\n  The signal was shown to be decodable by ear at 100m for etherify 1, and 30m for etherify 2. This was done via a simple antenna and modest receiver. An antenna with more gain and better receiver would surely yield better range.\n Nearby ethernet networks will generate a lot of interference at the same frequencies. The 125MHz frequency falls in the 108-137MHz air band, and one can expect interference from strong signals on nearby frequencies from nearby airplanes and airports. Therefore first tests should be conducted in areas with less interference, such as outdoor areas or underground parking lots.\n The 125MHz frequency was chosen because of avaliable equipment. It would be hard for one person to hold and operate an antenna, laptop and SDR receiver. Other frequencies may be better.\n Etherify 1 yields better range, however etherify 2 may enable to use a device located somewhere else in the network as the transmitter. This device may be physically closer to the receiver or may have greater leakage from the ethernet cable. Etherify 2 can be exploited as a non-root user by flooding the network with UDP datagrams or possibly other data.\n  I haven’t done an extensive search for similar prior publications, but a few quick searches didn’t yield any results. If you know of any, please let me know.\n If you cite this, please include the webpage address and attribute Jacek Lipkowski (SQ5BPF). Email can be sent to my_callsign @ this_domain.", "posttime": "2020-11-07 18:15:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "以太,bringing,设备", "title": "以太化-将以太带回以太网", "title_en": "Etherify – bringing the ether back to ethernet", "transed": 1, "url": "https://lipkowski.com/etherify/", "via": "", "real_tags": ["以太", "bringing", "设备"]}, {"category": "", "categoryclass": "", "imagename": "d10a27ed4b8c1d405d3b3dc57385a3b2.jpg", "infoid": 1033702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于冠状病毒的流行，许多员工这些天感到精疲力尽，这迫使许多人在家里兼顾工作和家庭需求，并为下岗同事收拾残局。但老年人似乎比年轻人更好地应对压力。\n人力资源公司罗伯特哈夫(Robert Half)对2800名美国员工进行了一项新的调查，其中29%的55岁及以上的员工表示，他们今天感到比一年前更疲惫。这一数字在25岁至40岁的受访者中为37%，在41岁至54岁的受访者中为32%。\n在与之配套的一项调查中，Robert Half发现88%的高级经理担心留住员工，其中近一半的经理说这是因为员工通常在繁重的工作负荷下举步维艰。\n当您加入AARP并注册第一年的自动续订时，可节省25%。您可以即时获得折扣、计划、服务和您所需的信息，让您的生活各个领域受益。\nRobert Half的高级执行董事保罗·麦克唐纳(Paul McDonald)通过电子邮件表示，越来越多的老年员工可能正在避免倦怠，因为多年来他们已经磨练了时间管理技能，并培养了将工作与其他生活分开的能力。麦克唐纳说：“在照顾在家上学的孩子和全职工作之间，也可能有不承担双重责任的因素。”\n根据麦克唐纳的说法，遭受职业倦怠折磨的年长员工面临着与年轻员工相同的潜在有害影响。他解释说：“这对创造力和整体健康是危险和适得其反的。”\n根据梅奥诊所的网站，工作倦怠与过度压力、疲劳、失眠和极端情绪有关。它还与心脏病、高血压和其他身体疾病有关。", "note_en": "A lot of workers are feeling stretched thin these days because of the  coronavirus pandemic, which is forcing many to juggle work and family needs while at home and to pick up the slack for laid-off colleagues. But older people seem to be handling the strain better than younger ones.\n In a new survey of 2,800 U.S. employees by staffing company Robert Half, 29 percent of those age 55 and older said they are feeling more burned out today than a year ago. The figure was 37 percent for respondents ages 25 to 40 and 32 percent for those ages 41 to 54.\n In a companion survey, Robert Half found that 88 percent of senior managers are worried about staff retention, and nearly half of those managers say it&#39;s because employees generally are struggling under heavy workloads.\n Save 25% when you  join AARP and enroll in Automatic Renewal for first year. Get instant access to discounts, programs, services, and the information you need to benefit every area of your life.\n Paul McDonald, senior executive director at Robert Half, said via email that more older workers may be avoiding burnout because they have refined their time management skills over the years and developed the  ability to separate work from the rest of their lives. “There may also be an element of not pulling double duty between caring for children who are home schooling and working full time,” McDonald observed.\n Older employees who are suffering from burnout face the same potentially harmful effects as younger ones, according to McDonald. “It&#39;s dangerous and counterproductive to creativity and overall health,” he explained.\n According to the Mayo Clinic website, job burnout is associated with excessive stress, fatigue, insomnia and extreme emotions. It&#39;s also linked to heart disease, high blood pressure and other physical ailments.", "posttime": "2020-11-07 18:15:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "员工,workers", "title": "年龄较大的员工可能不太容易产生职业倦怠", "title_en": "Older Workers May Be Less Susceptible to Burnout", "transed": 1, "url": "https://www.aarp.org/work/working-at-50-plus/info-2020/older-workers-burnout.html", "via": "", "real_tags": ["员工", "workers"]}, {"category": "", "categoryclass": "", "imagename": "71b967649799317f4986aacced50e408.jpg", "infoid": 1033701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比尔·赫德和戴夫·海尼在2020年10月10日和11日举行的虚拟活动--东方老式电脑节(Vintage Computer Festival East 2020)上的演讲。", "note_en": "A presentation by Bil Herd and Dave Haynie at Vintage Computer Festival East 2020, a virtual event held October 10th & 11th, 2020.", "posttime": "2020-11-07 18:15:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "展示,show,戴夫", "title": "海军准将展示和讲述--比尔·赫德和戴夫·海尼(Dave Haynie)", "title_en": "Commodore Show and Tell – Bil Herd and Dave Haynie", "transed": 1, "url": "https://www.youtube.com/watch?v=segHBfVSRoU&feature=youtu.be", "via": "", "real_tags": ["展示", "show", "戴夫"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免责声明：对这篇报道有贡献的资源是Scribe的编辑。Flannery和Webb发表的观点和观点是他们自己的观点，并不反映Scribe作为一个组织的地位。\nUCCS主修英语和中学教育的大四学生布兰登·弗拉纳里(Brandon Flanery)说：“第二天早上，这是我的神经系统第一次没有受到惊吓。”此前，他第一次给自己服用了迷幻药物裸盖菇素蘑菇(蘑菇)，这是他第一次使用这种迷幻药来治疗自己的焦虑情绪。之后，布兰登·弗拉纳里(Brandon Flanery)如是说。弗兰纳里是UCCS英语和中学教育专业的大四学生。\n目前有很多处方药可用于治疗各种精神健康障碍，根据目前的研究结果，迷幻剂可能很快就会被列入这些名单。它们已经被临床证明可以显著降低抑郁、焦虑、创伤后应激障碍等精神健康障碍的症状，同时还能改善情绪、开放性、创造力、自我效能和精力。\n根据Timeline的说法，尽管迷幻剂已经被使用了数千年，但对其潜在积极影响的医学研究直到20世纪40年代才开始。令人遗憾的是，这项研究因“禁毒战争”而放缓，直到21世纪初的最近，科学家和医生开始重新审视他们对迷幻剂的研究，包括迷幻剂--根据《迷幻科学》的说法，这是一种由麦角中的酸性物质合成的致幻剂，麦角酸是一种真菌和蘑菇的种类，它是一种由麦角中的酸性物质合成的迷幻剂，是一种真菌和蘑菇的种类。在21世纪初，科学家和医生们开始重新审视他们对迷幻药的研究，其中包括LSD。\n据LiveScience报道，当扫描那些受蘑菇影响的人的大脑时，大脑活动发生在通常不相连的区域。据纽约大学朗格尼健康中心报道，一项新的研究发现，蘑菇刺激神经发生，使修复和生长发生在海马区--负责情绪和记忆障碍的区域。\n根据美国国家医学图书馆的说法，使用迷幻剂的研究产生了一种“幸福的状态…”并且积极地经历了去人格化和去人格化。“。LSD和蘑菇都对个性和情绪产生了积极的长期影响。\n正如美国国家医学图书馆所说，LSD和蘑菇在化学上不会上瘾，这意味着我们的身体不会对药物产生依赖。这些迷幻剂甚至可以帮助那些滥用药物的人克服毒瘾。\n据《时代》杂志报道，一项研究发现，那些与酗酒作斗争的人受益于微量注射或经历一次受控的“旅行”--服用75到200微克的迷幻剂。据“时代”杂志报道，在实施迷幻剂的人中，超过一半的人在六个月后报告没有或明显减少酗酒。\n美国国家医学图书馆报道的另一项研究显示，在使用蘑菇后，绝症癌症患者的生活质量得到改善，他们与周围人的关系更好，他们想要参与更多的外部健康活动，他们经历的心理痛苦也更少。\n乔伊·韦伯(Joy Webb)是英国哲学和英语专业的大四学生，在结束抗焦虑和抗抑郁药物治疗后，她会服用微量的蘑菇。她说：“这让我感觉精力充沛，头脑清醒，开诚布公，感觉很好。”\n韦伯还尝试了更大剂量的蘑菇，她形容这是她的重要转型时期，尤其是对她的精神健康而言。她说，这是超现实主义的、特别的、对我的存在至关重要的。她说，它帮助她从抑郁和创伤后应激障碍中痊愈，并声称它帮助她应对焦虑，让她理解、接受和爱自己。\n与大多数药物、处方药或其他药物一样，LSD和蘑菇可能会产生负面副作用。最令人担心的副作用是经历一次“糟糕的旅行”，这是一种可怕的或令人焦虑的状态，或者是对这些物质的反应而产生的闪回。这可能会对亲历者的精神状态造成潜在的损害。\n然而，根据美国国家医学图书馆的数据，在目前在受控环境下进行的医学研究中，没有参与者经历过严重的焦虑、恐惧或作为副作用的严重不良反应。当迷幻剂用于娱乐时，在使用者更有可能感到不安全或不舒服的环境中，这种情况更常见。\n弗兰纳里和韦伯都强调，在使用迷幻剂之前，无论是精神上还是身体上都要处于良好的状态。弗兰纳里将微剂量治疗与心理咨询相结合，并声称这种方法对他很有效。他说：“我不会向那些没有从事治疗大脑创伤的认知工作的人推荐蘑菇。”\n根据美国国家医学图书馆的数据，LSD的其他副作用包括血压、心率、体温和瞳孔大小的暂时性增加。使用后，头晕、身体不平衡、口干、恶心、食欲不振和注意力难以集中等影响可能会持续长达24小时，而头痛或疲惫的感觉可能会持续长达72小时。\n我从经验中了解到，许多治疗精神疾病的药物在化学上会上瘾，并会产生一系列严重的负面副作用。不幸的是，天然的、不会上瘾的、可以说更安全的替代品，如本文中讨论的迷幻剂，在美国还没有广泛获得或合法。\n有一些合法的方式可以追求迷幻体验。加入临床试验是一种选择，你可以在Clinicaltrials.gov上找到正在进行的试验。在美国，也有一些教堂可以合法地使用迷幻物质作为宗教圣礼，因此加入其中一家教堂是另一种选择。\n话虽如此，我不会鼓励或支持这些活动，Scribe也不会。\n希望在不久的将来，人们可以享受到这些迷幻药物的好处，而不必担心在这个过程中会被罚款或逮捕。", "note_en": "Disclaimer :  S ources  contributing to this story   are editors at the Scribe.  The v iews and opinions expressed  by Flannery and Webb  are their own  and not reflective o f the position  of the Scribe as an organization .\n “The next morning, it was the first time I did not have my nervous system freaking out,” said Brandon Flanery, a senior at UCCS majoring in English secondary education, after his first-time micro-dosing psilocybin mushrooms (shrooms), a psychedelic drug, to treat his anxiety.\n There are many prescription drugs available to treat a variety of mental health disorders, and with the findings from current studies, psychedelics may soon be included in these lists. They have been clinically proven to significantly decrease depression, anxiety, PTSD and other symptoms from mental health disorders while improving mood, openness, creativity, self-efficacy and energy.\n Though psychedelics have been used for thousands of years, medical studies on their potential positive impacts only began in the 1940s, according to Timeline. The “war on drugs” unfortunately slowed down this research until recently, in the early 2000s, when scientists and doctors began to revisit their research on psychedelics, including LSD — a hallucinogenic synthetically made from the acid in ergot, a type of fungus — and shrooms, according to Psychedelic Science.\n When scanning the brains of those under the influence of shrooms, brain activity takes place in areas that normally are not connected, reported LiveScience. One study found that shrooms stimulated neurogenesis, allowing repair and growth to take place in the hippocampus — the area responsible for emotion and memory — according to NYU Langone Health.\n According to the U.S. National Library of Medicine, studies using LSD produced a “blissful state … and positively experienced derealization and depersonalization.” LSD and shrooms both produced positive long-term effects on personality and mood.\n LSD and shrooms are not chemically addictive, meaning our bodies do not become dependent on the drug, as stated by the U.S. National Library of Medicine. These psychedelics can even help people with substance abuse overcome addiction.\n One study found that those who struggled with alcoholism benefited from micro-dosing or experiencing a controlled “trip” — 75 to 200 micrograms of LSD — with over half of those who implemented psychedelics reporting no or significantly less alcohol abuse up to six months later, according to Time Magazine.\n Another study reported on by the U.S. National Library of Medicine showed that after using shrooms, terminally ill cancer patients’ quality of life improved, they had better relationships with the people around them, they wanted to participate in more external activities and they experienced less psychological distress.\n  Joy Webb, a senior majoring in philosophy and English, micro-dosed with shrooms when coming off her anti-anxiety and anti-depressant medications. “It felt like it gave me an increased energy, clear head, an openness and made me feel good,” she said.\n Webb has also experimented with larger doses of shrooms, and she described it as an important transformational period for her, especially for her mental health. “It was surreal, special and pivotal to my being.” She said it helped her heal from depression and PTSD, and she claimed it helped her cope with anxiety and allowed her to understand, accept and love herself.\n As with most drugs, prescription or otherwise, LSD and shrooms can produce negative side effects. The most generally feared side effect is experiencing a “bad trip” which is a frightening or anxiety-inducing state, or the experience of flashbacks, in response to substances. This can be potentially damaging to the mental state of those who experience it.\n However, according to the U.S. National Library of Medicine, in current medical studies performed in controlled environments, no participants have experienced severe anxiety, fear or severe adverse reactions as a side effect. This is more common when psychedelics are used recreationally, in settings where users are more likely to feel unsafe or uncomfortable.\n Both Flanery and Webb emphasize the importance of being in a good place, both mentally and physically, before using psychedelics. Flanery combines micro-dosing with counseling and claims that method has been effective for him. “I would not recommend shrooms to people who are not doing the cognitive work of healing trauma in the mind,” he said.\n Other side effects of LSD include temporary increases in blood pressure, heart rate, body temperature and pupil size, according to the U.S. National Library of Medicine. Effects including dizziness, imbalance, dry mouth, nausea, lack of appetite and difficulty concentrating may be present for up to 24 hours after use, whereas headaches or feelings of exhaustion may be present for up to 72 hours.\n I know from experience that many medications prescribed for mental health disorders are chemically addictive and can produce an array of severe, negative side effects. Unfortunately, natural, nonaddictive and arguably safer alternatives such as the psychedelics discussed in this article are not yet widely available or legal in the U.S.\n There are some legal ways to pursue a psychedelic experience. Joining a clinical trial is one option, and you can find ongoing trials at clinicaltrials.gov. There are also some churches in the U.S. that can legally use psychedelic substances as religious sacraments, so joining one of these churches is another option.\n That being said, I do not encourage or endorse these activities, and neither does the Scribe.\n Hopefully some day in the near future, people can enjoy the benefits of these psychedelic drugs without worrying about being fined or arrested in the process.", "posttime": "2020-11-07 18:14:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旅行,mental,蘑菇", "title": "去旅行吧：这是为了你的心理健康", "title_en": "Take a trip: it’s for your mental health", "transed": 1, "url": "https://scribe.uccs.edu/take-a-trip-its-for-your-mental-health/", "via": "", "real_tags": ["旅行", "mental", "蘑菇"]}]