[{"category": "", "categoryclass": "", "imagename": "f9cb951999d1930b3cedf655d512f4c8.jpg", "infoid": 1033105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在网上销售，就像在生活中一样，重要的不是你卖什么，而是你卖的方式。\n通过允许零售商和制造商使用增强现实、视频和3D图像在网上销售他们的商品，产品信息管理初创公司InRiver声称可以推动在线销售。周一，这家瑞典公司发布了自己的融资公告。\nInRiver筹集了3,200万美元，其联合创始人兼首席产品官约翰·博斯特罗姆(Johan Bostrom)表示，这是在该公司需求旺盛的时期。InRiver的美国总部设在芝加哥。他计划利用这笔资金进一步增长公司的北美客户群，他说北美客户群代表着这家初创公司最大的核心增长市场。\n博斯特罗姆告诉“内置”杂志：“大流行将五年的变化压缩到了有时感觉就像五周的时间里。”他补充说，仅来自现有客户的年度经常性收入“比以往任何时候都增加了，这是因为他们更多地使用了这款产品。”\nInRiver成立于2007年，帮助500多家制造商和零售商(如Office Depot)集中他们的产品目录并在网上销售商品。Bostrom表示，自该公司六年前进入美国以来，其最大的增长领域一直是制造商使用其产品信息管理(PIM)系统通过亚马逊(Amazon)、沃尔玛(Walmart)或家得宝(Home Depot)等经销商分销网络进行销售。随着新冠肺炎大流行推动网购增加，制造商正在加快他们的数字化转型。\n“在B2B内部，我们看到了一种转变。它已经从我们计划要做的事情变成了我们必须做的事情。“博斯特罗姆说。\nBostrom说，InRiver将使用新的资金为这些客户构建功能。明年，该公司计划推出一种说明性分析系统，制造商可以用来查看他们在个别第三方平台上的销售额与竞争对手相比如何，以及他们需要采取哪些行动才能保持领先于类似卖家一步。InRiver打算收集和处理流量、销售和图片数据，以突出显示，比方说，在页面上添加更多图片可能会增加客户在亚马逊上的销售额。\n博斯特罗姆说：“当你在家得宝(Home Depot)、亚马逊(Amazon)或格兰杰(Grainger)上销售时，你得到的数据非常少。”“我们会让你知道，你需要添加更多图片，或者你需要有一个A+页面，或者任何顾客想要购买产品的东西。”\n博斯特罗姆说，该公司在当地的存在将是推动这些升级不可或缺的一部分。InRiver已经与当地的AR/VR初创公司Threekit合作，帮助其客户升级产品形象。展望未来，这家初创公司计划与更多的当地科技公司合作，调整其系统，并在其25人的当地办事处增加至多10人。InRiver计划在芝加哥招聘开发人员、销售工程师、客户经理等。\n“芝加哥知道如何制造和销售东西，”博斯特罗姆说。在这一领域，我们可以与大量其他公司合作，创建联合解决方案，共同提供比单独提供更多价值的解决方案。“。\n这轮融资使inRiver的总投资至少达到4990万美元。卢加德路资本公司(Lugard Road Capital)领导了这轮融资，来自Verdane、Industrifonden、Zobito和RoosGruppen的公司参与了这轮融资。", "note_en": "In online sales, as in life, it’s not what you sell, but how you sell it.\n By allowing retailers and manufacturers to use augmented reality, video and 3D imagery to sell their items online, product information management startup  inRiver claims to drive online sales. On Monday, the Swedish company issued a funding announcement of its own.\n InRiver raised $32 million, which co-founder and chief product officer Johan Bostrom said comes amid a period of high demand for the company, which operates its U.S. headquarters out of Chicago. He plans to use the funds to further grow the company’s North American customer base, which he said represents the startup’s largest growth market.\n “The pandemic has compressed five years of change into what sometimes feels like five weeks,” Bostrom told Built In, adding that annual recurring revenue from existing customers alone “has increased more than ever, and that is due to them utilizing the product more.”\n Founded in 2007, inRiver helps more than 500 manufacturers and retailers like Office Depot centralize their product catalogs and sell items online. Since the company entered the U.S. six years ago, Bostrom said its largest area of growth has been manufacturers using its product information management (PIM) system to sell through dealer distribution networks like Amazon, Walmart or Home Depot. As the COVID-19 pandemic drives increased online shopping, manufacturers are accelerating their digital transformations.\n “Within B2B, we&#39;ve seen a shift. It&#39;s gone from something we plan to do to something we have to,” Bostrom said.\n InRiver will use the fresh funding to build features for these customers, Bostrom said. Next year, the company plans to unveil a prescriptive analytics system manufacturers can use to see how their sales compare to their competitors on individual third-party platforms, and what actions they need to take to stay a step ahead of similar sellers. InRiver intends to collect and crunch traffic, sales and image data to highlight how, say, adding more images to a page might increase a customer’s sales on Amazon.\n “When you&#39;re selling on Home Depot or Amazon or Grainger, you have very little data,” Bostrom said. “We&#39;re going to let you know that you need to add more images, or you need to have an A-plus page, or whatever it is that the customers are looking for in order to buy a product.”\n The company’s local presence will be integral in driving these upgrades, Bostrom said. InRiver has already partnered with Threekit, a local AR/VR startup, to help its customers upgrade their product images. Going forward, the startup plans to partner with additional local tech companies to tweak its systems, as well as add up to 10 people to its 25-person local office. InRiver plans to hire developers, sales engineers, account managers and more in Chicago.\n “Chicago knows how to manufacture and market things,” Bostrom said. “There are loads of other companies around in this area that we can cooperate with to create joint solutions that provide even more value together than they do separately.”\n The funding round brings total investment in inRiver to at least $49.9 million. Lugard Road Capital led the round, with participation from Verdane, Industrifonden, Zobito and RoosGruppen.", "posttime": "2020-11-04 10:36:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,north", "title": "瑞典初创公司InRiver的产品信息管理软件帮助零售商在网上销售商品，该公司筹集了3200万美元，用于扩大北美业务", "title_en": "Swedish startup inRiver, whose product information management software helps retailers sell items online, raises $32M to expand North American operations", "transed": 1, "url": "https://www.builtinchicago.org/2020/11/02/inriver-raises-32m-hiring", "via": "", "real_tags": ["软件", "north"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免责声明：我花了很多时间浏览Github，阅读了很多自述文件。这篇文章是一篇讽刺文章，许多很棒的回帖/登录页面都有以下一些习语。我并不想冒犯专业的维护人员和文档作者，尽管我觉得针对开发人员的营销比喻很有趣。\n我们在该项目的文档网站上使用了它，除了最新的Chrome浏览器之外，我们没有收到任何投诉。\n速度足够快--在我们最新一代的Macbook Pros上，以及我们已经按摩过的临时微基准测试上，我们比&lt；类似的项目&gt；都要快得多。不过，我们不支持边缘情况。\n仅适用于启用了实验标志和自定义巴别塔插件的最新Chrome。预计每隔1-2个月就会在没有通知的情况下中断更改。\n我们已经编写了docker-compose.yml文件，它可以在AWS上运行。您需要将机密作为环境变量传递。\n在所有网络、Android、iOS和Electron上都很落后。所有版本都包括20Mb的Node API多边形填充。\n100Gbps网速，NA下载时间不超过几秒。\n我们有复制-粘贴&lt；meta name=&#34；viewport&#34；content=&#34；width=device-width，Initial-scale=1&#34；&gt；，它可以在我们的Macbook Pro上运行，最新的Chrome浏览器模仿iPhone X。\n用我们熟悉的语言编写，使用我们自己的线条约定。只能在最新的Chrome上运行。预计每2-3个月就会发生重大变化。\n代码分布在10个不同的紧密耦合的包中。我们公开了一个插件配置选项，该选项只接受我们自己的插件。预计插件API每2-3个月就会发生变化。\n我们发布了解析器的源代码，并编写了一个看起来像RFC的自述文件。\n您可以在配置文件和环境变量中选择退出自动后门分析，并且每次更新时都必须再次这样做。\n我们使用display：flex而不是display：block，并用1em替换了16px。\n您需要一个至少有3个节点的Kubernetes集群来为您的博客提供服务。顺便说一下，我们还提供付费托管服务。\n我们的依赖项嵌入在供应商文件夹中，和/或我们有不支持边缘情况的常用函数的自定义实现，其中大多数是从StackOverflow复制/粘贴的，没有属性。", "note_en": "Disclaimer: I spent a LOT of time browsing Github, and read a lot of READMEs. This post is a satire, and many great repos / landing pages feature some of the following idioms. I don&#39;t mean to offend dedicated maintainers &amp; docs writers, however funny I find dev-targeted marketing tropes.\n        We used it for the docs website of the project and we haven&#39;t received any complains except for browers other than latest Chrome.\n   Fast-enough on our latest-gen Macbook Pros and on the adhoc microbenchmark we have massaged into being faster than  &lt;similar project&gt;. We don&#39;t support edge cases though.\n      Only works in latest Chrome with experimental flags enabled and a custom  babel plugin. Expect breaking changes without notice every 1-2 months.\n   We have written a  docker-compose.yml file and it works on AWS. You need to pass secrets as environment variables.\n         Laggy on all Web, Android, iOS and Electron. All versions include 20Mb of Node API polyfills.\n            With 100Gbps network speed, it takes no more than several seconds to download in NA.\n   We have copy-pasted  &lt;meta name=&#34;viewport&#34; content=&#34;width=device-width, initial-scale=1&#34;&gt; and it works on our Macbook Pros in latest Chrome emulating iPhone X.\n   Written in a language we are familiar with, using our own linting conventions. Only works on latest Chrome. Expect breaking changes every 2-3 months.\n   Code is spread over 10 different tighly-coupled packages. We expose a  plugin configuration option that only accepts our own plugins. Expect breaking plugin API changes every 2-3 months.\n   We published the source code of our parser and wrote a README file that looks like an RFC.\n   You may opt-out of automated backdoor analytics in both your config file and environment variables, and you must do so again every time you update.\n         We use  display: flex instead of  display: block and we have replaced  16px with  1em.\n      You need a Kubernetes cluster with at least 3 nodes to serve your blog. We also provide paid hosting, by the way.\n                     Our dependencies are embeded in a  vendor folder, and/or we have custom implementations of common functions that don&#39;t support edge cases, most of which are copy/pasted from StackOverflow without attribution.", "posttime": "2020-11-04 10:32:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming", "title": "现代编程词汇表", "title_en": "Modern Programming Glossary", "transed": 1, "url": "https://elie.rotenberg.io/b/p/modern-programming-glossary", "via": "", "real_tags": ["编程"]}, {"category": "", "categoryclass": "", "imagename": "0030fd87cbb5b52ed96128d264f6e9f7.jpeg", "infoid": 1033103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入我们的社区，与志同道合的远程员工建立网络&amp；随时了解远程工作的最新情况-http://remoteclan.comYou还可以在twitter-https://twitter.com/intent/user?screen_name=hrishiptweets上关注我在远程工作、技术和创业方面的最新消息", "note_en": "Join our community to network with like-minded remote workers &amp; stay updated on the latest in remote work - http://remoteclan.comYou can also follow my updates on remote work, tech &amp; startups on Twitter - https://twitter.com/intent/user?screen_name=hrishiptweets", "posttime": "2020-11-04 10:32:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "full,远程", "title": "Reddit正在进行完全远程操作。为员工提供相同的薪酬，无论他们身在何处", "title_en": "Reddit is going full remote. Offers same pay to employees no matter the location", "transed": 1, "url": "https://www.linkedin.com/posts/hrishikeshpardeshi_remotework-remoteworking-workfromhome-activity-6727086968682889216-dqxW/", "via": "", "real_tags": ["full", "远程"]}, {"category": "", "categoryclass": "", "imagename": "c791e40ec34023e25e8317e3a3d5e9fa.jpg", "infoid": 1033102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "韩国Pinkfong公司录制的“鲨鱼宝宝”，这首引人入胜的童谣，已经成为YouTube上点击量最高的视频。“鲨鱼宝宝”是韩国品客公司(Pinkfong)录制的动听童谣，已经成为YouTube上点击量最高的视频。\n这首歌现在已经被播放了70.4亿次，超过了之前的纪录保持者Despacito，这首歌是由歌手路易斯·丰西(Luis Fonsi)创作的拉丁流行歌曲。\n“鲨鱼宝宝”花了四年时间才登上YouTube上播放量最高的排行榜榜首，但这首歌实际上比这要古老得多。\n它被认为起源于20世纪70年代的美国夏令营。有一种理论认为它是在1975年发明的，当时史蒂芬·斯皮尔伯格的“大白鲨”在世界各地掀起了票房热潮。\n在基本前提上有大量的变体，包括一个版本，冲浪者在鲨鱼面前失去了一只手臂，另一个版本中，主人公死了。\n也有国际版本-包括法国的Bebe Requin和德国的Kleiner Hai(小鲨鱼)，这部电影于2007年在欧洲成为次要热门。\n但它们都比不上品客坊翻唱的惊人成功，这首歌由10岁的韩裔美国歌手霍普·塞戈因演唱，并于2015年上传到YouTube上。\n它让人上瘾，钩子和鱼腥舞在韩国风靡一时，红天鹅绒乐队、少女一代和BlackPink等流行乐队开始将其融入他们的演唱会。\n次年6月，Pinkfong发布了第二个视频，名为Baby Shark Dance，视频中两个可爱的孩子表演了舞蹈例行公事。\n这段视频激发了#宝宝鲨鱼挑战#的标签-从印尼农场工人到流行歌星卡迪·B和乔什·格罗班，每个人都加入了这一有趣的行列。\n这首歌非常吸引孩子们，他们对重复的胃口无疑帮助它在YouTube上点击率最高的视频排行榜上攀升。\n童谣一直都有点慢，非常可爱，但它能帮助你的孩子入睡--而不是“鲨鱼宝宝”，品客网的市场总监杰米·吴在2018年告诉BBC。\n品客的“鲨鱼宝宝”非常时髦，它的节奏非常明快，舞步也很有趣。这部动画非常生动。我们称它为下一代的K-Pop。\n该公司正在将这首歌改编成电影和音乐剧，并渴望制作另一部经典的儿童音乐作品，比如“闪烁的小星星”(Twinkle Twinkle Little Star)，Oh补充道。\n然而，Pinkfong的母公司SmartStudy去年被儿童音乐创作人乔纳森·赖特(Jonathan Wright)起诉，后者在2011年录制了一首类似的改编歌曲，并辩称自己拥有这首歌的版权。\nSmartStudy回应说，他们的版本是根据一首传统的伴唱歌曲改编的，这首歌已经被公之于众。此案仍在韩国版权委员会的审议中。\n上个月，这首歌成为另一场争议的中心，当时俄克拉何马州的三名监狱工作人员被指控用这首歌惩罚囚犯。\n根据法庭文件，五名囚犯被铐在墙上，被迫站着两个小时，同时重复听“鲨鱼宝宝”(Baby Shark)。\n地区检察官大卫·普拉特(David Prater)表示，这首歌给囚犯带来了不必要的情绪压力，他们很可能已经在遭受痛苦。\n去年10月，当埃莉安·贾布尔(Eliane Jabbour)出人意料地发现自己处于黎巴嫩的一场反政府示威活动中时，她担心骚乱会吓到她15个月大的儿子，他刚刚从她车的副驾驶座位上午睡中醒来。\n取而代之的是，抗议者包围了她的车，并唱起了Baby Shark，以帮助这个蹒跚学步的孩子平静下来。\n贝鲁特事件的一段视频-罗宾睁大眼睛看着歌声和舞蹈-本身就在网上疯传，并成为抗议活动中希望的象征。\n在Facebook或Twitter@BBCNewsEnts上关注我们。如果您有故事建议，请发送电子邮件至Entertainment.news@bbc.co.uk。", "note_en": "Baby Shark, the infuriatingly catchy children&#39;s rhyme recorded by South Korean company Pinkfong, has become the most-watched video ever on YouTube.\n The song has now been played 7.04 billion times, overtaking the previous record holder Despacito, the Latin pop smash by singer Luis Fonsi.\n    It took four years for Baby Shark to ascend to the top of YouTube&#39;s most-played chart, but the song is actually much older than that.\n It is thought to have originated in US summer camps in the 1970s. One theory says it was invented in 1975, as Steven Spielberg&#39;s Jaws became an box office smash around the world.\n There are a huge number of variations on the basic premise, including one version where a surfer loses an arm to the shark, and another where the protagonist dies.\n There are also international versions - including the French Bebe Requin and the German  Kleiner Hai (Little Shark), which became a minor hit in Europe in 2007.\n  But none of them could match the phenomenal success of Pinkfong&#39;s interpretation, which was sung by 10-year-old Korean-American singer Hope Segoine and uploaded to YouTube in 2015.\n It&#39;s addictive &#34;doo doo doo doo doo doo&#34; hook and fishy dance moves became a craze in South Korea, where popular bands like Red Velvet, Girls&#39; Generation and Blackpink started incorporating it into their concerts.\n The following June, Pinkfong put out a second video, titled Baby Shark Dance, featuring two cute kids performing the dance routine.\n That clip that inspired the hashtag #BabySharkChallenge - with everyone from Indonesian farmworkers to pop stars Cardi B and Josh Groban joining the fun.\n The song is catnip for children, whose appetite for repetition has undoubtedly helped it climb the ranks of YouTube&#39;s most-watched videos.\n &#34;Nursery rhymes have always been sort of slow, very cute, but something that would help your children fall asleep - as opposed to Baby Shark,&#34; Pinkfong&#39;s marketing director Jamie Oh told the BBC in 2018.\n &#34;Pinkfong&#39;s Baby Shark is very trendy and it has a very bright beat with fun dance moves. The animation is very vivid. We call it K-Pop for the next generation.&#34;\n The company is turning the song into a movie and a musical, and aspires to make Baby Shark &#34;another classic for kids music, like Twinkle Twinkle Little Star&#34;, Oh added.\n  However, Pinkfong&#39;s parent company SmartStudy was sued last year by children&#39;s songwriter Jonathan Wright, who recorded a similar arrangement of the song in 2011 and argues that he owns the copyright to that interpretation.\n SmartStudy responded that their verison was &#34;based on a traditional sing-along chant which has passed to public domain&#34;. The case is still under consideration by the Korea Copyright Commission.\n Last month, the song was at the centre of another controversy, when three prison workers in Oklahoma were accused of using it to punish inmates.\n According to court documents, five prisoners were handcuffed against a wall and forced to stand for two hours while listening to Baby Shark on repeat.\n Exposure to the song put &#34;undue emotional stress on the inmates who were most likely already suffering&#34;, said district attorney David Prater.\n   When Eliane Jabbour unexpectedly found herself in the middle of an anti-government demonstration in Lebanon last October, she was concerned the commotion would scare her 15-month-old son, who had just woken from a nap in the passenger seat of her car.\n Instead, the protestors circled her car and sang Baby Shark to help calm the toddler down.\n A video of the episode in Beirut - with Robin staring wide-eyed at the singing and dancing - itself went viral, and became a symbol of hope amid the protests.\n  Follow us on  Facebook , or on Twitter  @BBCNewsEnts . If you have a story suggestion email  entertainment.news@bbc.co.uk .", "posttime": "2020-11-04 10:16:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,观看,shark,首歌", "title": "“鲨鱼宝宝”成为YouTube有史以来观看次数最多的视频", "title_en": "Baby Shark Becomes YouTube's Most-Watched Video of All Time", "transed": 1, "url": "https://www.bbc.com/news/entertainment-arts-54783116", "via": "", "real_tags": ["youtube", "观看", "shark", "首歌"]}, {"category": "", "categoryclass": "", "imagename": "fec6cb93b782d0fb20a9a445e1486af3.jpg", "infoid": 1033101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上最大的冰山，也就是众所周知的A68a，正在逼近英国的南乔治亚海外领地。\n这座南极冰川的大小与南大西洋岛国相当，而这座冰山现在极有可能在野生动物避难所的近海搁浅并下锚。\n这些动物的正常觅食路线可能会被堵塞，使它们无法正确喂养幼崽。\n不用说，所有生活在海底的生物都会在A68a降落的地方被粉碎-这一扰动需要很长时间才能扭转。\n英国南极调查局(BAS)的杰伦特·塔林教授表示，生态系统当然可以而且将会反弹，但这里有一个危险，如果这座冰山被困住，它可能会在那里呆上10年。\n他告诉BBC新闻，这将产生非常大的不同，不仅对南乔治亚州的生态系统，而且对其经济也是如此。\n这些表格上的庞然大物是在强流的作用下从白色大陆拉上来的，结果它们的龙骨被这个偏远岛屿周围的大陆架的浅滩缠住了。\n这种事一次又一次地发生。巨大的冰雕在陆地的视线中慢慢枯萎。\nA68a看起来像一只手，手指指向，自从2017年年中从南极洲挣脱出来后，它就一直在这条冰山小巷上飞行。它现在就在机器人西南方向几百公里处。\n这座山的面积大致相当于英国萨默塞特县(4200平方公里)，重达数千亿吨。但它的相对薄(水下深度可能在200米或更少)意味着它有可能在下锚前直接漂流到南乔治亚州的海岸。\n塔林教授解释说，一座靠近冰山的冰山对陆地食肉动物可能在哪里觅食有着巨大的影响。\n当你在谈论企鹅和海豹的时候，它们在幼崽和雏鸟的饲养过程中非常关键，它们为了寻找食物而旅行的实际距离真的很重要，这一点你可以说是非常重要的，因为这段时间对企鹅和海豹来说是非常关键的--在幼崽和小鸡的养育过程中，它们要走多远才能找到食物。如果它们不得不绕道走很长一段路，那就意味着它们不能及时回到幼崽身边，以免在此期间饿死。\n2004年，当巨人A38在南乔治亚州搁浅时，在当地海滩上发现了无数死亡的企鹅幼崽和海豹幼崽。\nBAS的研究人员正在努力组织资源，以便在南乔治亚州研究A68a，如果它做得最差，并在野生动物和当地渔业的关键产区之一落地的话。\n例如，冰山带来了大量的灰尘，这些灰尘将使它们周围的海洋浮游生物变得肥沃，然后这种好处将沿着食物链向上蔓延。\n尽管卫星图像显示A68a正在直达南乔治亚州的道路上，但它仍有可能逃脱捕获。BAS遥感和测绘专家Peter Fretwell博士说，一切皆有可能。\n洋流应该会把它带到南乔治亚州南端看起来像是一个奇怪的环路上，然后沿着大陆架的边缘旋转，回到西北方向。但很难说到底会发生什么，他告诉BBC新闻。\n同事安德鲁·弗莱明(Andrew Fleming)博士表示，欧洲航天局(European Space Agency)正在要求提供更多卫星图像，特别是它的两艘哨兵1号雷达航天器。\n这些成像仪的工作波长允许他们透过云层看到，这意味着无论天气情况如何，他们都可以跟踪冰山。\n弗莱明博士说，A68a很壮观。它仍然是一大块碎片的想法实际上是非同寻常的，特别是考虑到你在雷达图像中看到的穿过它的巨大裂缝。我早就料到它现在已经分崩离析了。\n如果它绕着南乔治亚州旋转并向北移动，它应该会开始解体。它会很快进入更温暖的水域，特别是波浪作用会开始杀死它。", "note_en": "The world&#39;s biggest iceberg, known as A68a, is bearing down on the British Overseas Territory of South Georgia.\n The Antarctic ice giant is a similar size to the South Atlantic island, and there&#39;s a strong possibility the berg could now ground and anchor itself offshore of the wildlife haven.\n  The animals&#39; normal foraging routes could be blocked, preventing them from feeding their young properly.\n And it goes without saying that all creatures living on the seafloor would be crushed where A68a touched down - a disturbance that would take a very long time to reverse.\n &#34;Ecosystems can and will bounce back of course, but there&#39;s a danger here that if this iceberg gets stuck, it could be there for 10 years,&#34; said Prof Geraint Tarling from the British Antarctic Survey (BAS).\n &#34;And that would make a very big difference, not just to the ecosystem of South Georgia but its economy as well,&#34; he told BBC News.\n   These tabular behemoths get drawn up from the White Continent on strong currents, only for their keels to then catch in the shallows of the continental shelf that surrounds the remote island.\n Time and time again, it happens. Huge ice sculptures slowly withering in sight of the land.\n A68a - which has the look of a hand with a pointing finger - has been riding this &#34;iceberg alley&#34; since breaking free from Antarctica in mid-2017. It&#39;s now just a few hundred km to the southwest of the BOT.\n  Roughly the size of the English county of Somerset (4,200 sq km), the berg weighs hundreds of billions of tonnes. But its relative thinness (a submerged depth of perhaps 200m or less) means it has the potential to drift right up to South Georgia&#39;s coast before anchoring.\n &#34;A close-in iceberg has massive implications for where land-based predators might be able to forage,&#34; explained Prof Tarling.\n &#34;When you&#39;re talking about penguins and seals during the period that&#39;s really crucial to them - during pup- and chick-rearing - the actual distance they have to travel to find food really matters. If they have to do a big detour, it means they&#39;re not going to get back to their young in time to prevent them starving to death in the interim.&#34;\n When the colossus A38 grounded at South Georgia in 2004, countless dead penguin chicks and seal pups were found on local beaches.\n  The BAS researcher is in the process of trying to organise the resources to study A68a at South Georgia, should it do its worst and ground in one of the key productive areas for wildlife and the local fishing industry.\n  For example, icebergs bring with them enormous quantities of dust that will fertilise the ocean plankton around them, and this benefit will then cascade up the food chain.\n Although satellite imagery suggests A68a is on a direct path for South Georgia, it might yet escape capture. Anything is possible, says BAS remote-sensing and mapping specialist Dr Peter Fretwell.\n &#34;The currents should take it on what looks like a strange loop around the south end of South Georgia, before then spinning it along the edge of the continental shelf and back off to the northwest. But it&#39;s very difficult to say precisely what will happen,&#34; he told BBC News.\n Colleague Dr Andrew Fleming said a request was going into the European Space Agency for more satellite imagery, particularly from its pair of Sentinel-1 radar spacecraft.\n These imagers work at wavelengths that allow them to see through cloud, meaning they can track the iceberg no matter what the weather conditions are like.\n &#34;A68a is spectacular,&#34; Dr Fleming said. &#34;The idea that it is still in one large piece is actually remarkable, particularly given the huge fractures you see running through it in the radar imagery. I&#39;d fully expected it to have broken apart by now.\n &#34;If it spins around South Georgia and heads on northwards, it should start breaking up. It will very quickly get into warmer waters, and wave action especially will start killing it off.&#34;", "posttime": "2020-11-04 10:11:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冰山,iceberg,可能", "title": "A68冰山在与南乔治亚州的碰撞路径上", "title_en": "A68 iceberg on collision path with South Georgia", "transed": 1, "url": "https://www.bbc.com/news/science-environment-54798031", "via": "", "real_tags": ["冰山", "iceberg", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Www.Phythoc.org正在使用一项安全服务来防御在线攻击。该服务需要完全的Cookie支持才能查看此网站。", "note_en": "www.physoc.org is using a security service for protection against online attacks. The service requires full cookie support in order to view this website.", "posttime": "2020-11-04 10:11:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "说服,family,服务", "title": "我是如何说服我的家人我不是理疗师的", "title_en": "How I convinced my family I wasn’t a physiotherapist", "transed": 1, "url": "https://www.physoc.org/blog/how-i-convinced-my-family-i-wasnt-a-physiotherapist-a-member-spotlight/", "via": "", "real_tags": ["说服", "family", "服务"]}, {"category": "", "categoryclass": "", "imagename": "d07dc33763d84ab4850f7f54e433f709.jpg", "infoid": 1033099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的研究发现，新冠肺炎的一些幸存者带有令人担忧的迹象，表明他们的免疫系统已经启动，这让人想起狼疮和类风湿性关节炎等潜在的致衰性疾病。\n研究表明，在某种程度上，这些患者的身体防御系统转变为攻击自身，而不是攻击病毒。这些患者正在产生一种名为“自身抗体”的分子，这种分子针对的是来自人类细胞的遗传物质，而不是来自病毒的遗传物质。\n这种被误导的免疫反应可能会加重严重的新冠肺炎。这也可能解释了为什么所谓的“长途运输者”在他们最初的疾病已经解决，病毒从他们的身体里消失几个月后仍然有挥之不去的问题。\n这一发现对治疗具有重要的意义：利用现有的可以检测自身抗体的测试，医生可以确定哪些患者可能从狼疮和类风湿性关节炎的治疗中受益。目前还没有治愈这些疾病的方法，但一些治疗方法可以降低突发事件的频率和严重程度。\n亚特兰大埃默里大学(Emory University)的免疫学家、该研究的主要作者马修·伍德拉夫(Matthew Woodruff)说，“有可能你可以用其中一些更具侵略性的药物对适当的患者进行更严厉的治疗，并期待更好的结果。”\n这一结果已于周五在预印服务器MedRxiv上报道，但尚未在科学期刊上发表。但其他专家表示，进行这项研究的研究人员以其仔细、一丝不苟的工作而闻名，而且这一发现并不出人意料，因为其他病毒性疾病也会引发自身抗体。\n耶鲁大学的免疫学家岩崎明子说：“我并不感到惊讶，但看到这真的发生了，这很有趣。”“即使是中度到轻度的疾病也有可能引发这种抗体反应。”\n几个月来已经很清楚，冠状病毒可以导致一些人的免疫系统失控，最终对身体造成的损害比病毒本身更大。(事实证明，特朗普总统在被诊断为Covid后服用的类固醇地塞米松对一些患有严重Covid的人有效，可以抑制这种过度活跃的免疫反应。)\n病毒感染会导致受感染的人类细胞死亡。有时细胞会安静地死亡，但有时，特别是在严重感染的阵痛中，它们可能会爆炸，散落在内部。当这种情况发生时，通常隐居在细胞核内卷曲成束的DNA突然变得四散可见。\n在对病毒的典型反应中，被称为B免疫细胞的细胞产生抗体，识别来自病毒的病毒RNA片段并锁定它们。\n但在像狼疮这样的情况下，一些B细胞永远不会学会这样做，而是产生自身抗体，这种抗体会从死亡的人类细胞中掠过DNA碎片，误以为它们是入侵者。研究表明，类似的情况可能正发生在新冠肺炎的患者身上。\n西雅图华盛顿大学(University Of Washington)的免疫学家马里恩·佩珀(Marion Pepper)说，“任何时候，只要你有炎症和细胞死亡的结合，就有可能出现自身免疫性疾病和自身抗体，更重要的是，会出现这种情况。”\n伍德鲁夫博士和他的同事本月早些时候报告说，一些重度新冠肺炎患者也有这种未经提炼的B免疫细胞。这一发现促使他们探索这些B细胞是否会产生自身抗体。\n在这项新的研究中，研究人员观察了亚特兰大埃默里医疗系统内的52名患者，他们被归类为患有严重或危重的新冠肺炎，但没有自身免疫性疾病的病史。\n他们在近一半的患者身上发现了识别DNA的自身抗体。他们还发现了针对一种名为类风湿因子的蛋白质和其他有助于凝血的抗体。伍德拉夫说，在病情最严重的上半部分患者中，超过70%的患者检测到了针对其中一个目标的自身抗体。\n“这不仅仅是因为这些患者有一种类似自身免疫的免疫反应，”他说。“这是因为这些免疫反应与实际的真正可检测的临床自身反应相结合。”\n马萨诸塞大学伍斯特分校的免疫学家和狼疮专家Ann Marshak-Rothstein指出，研究人员发现的一些自身抗体与血液流动问题有关。\n“你在新冠肺炎患者身上看到的一些凝血问题很可能是由这些免疫复合物驱动的，”她说。\n她说，如果自身抗体真的被证明是长期存在的，它们可能会给新冠肺炎幸存者带来持续的，甚至终身的问题。\n她说：“你永远无法真正治愈狼疮--他们有红斑，然后会好起来，然后又会有红斑。”“这可能与自身抗体记忆有关。”\nMarshak-Rothstein博士、岩崎博士和其他几十个团队正在密切研究对冠状病毒的免疫反应。考虑到自身抗体测试的简便性，可能很快就会变得清晰起来，这些抗体是仅仅因为研究人员去寻找它们而被识别出来，还是它们代表了免疫系统更永久性的改变。\n“在这一点上，我不清楚这一切意味着什么，”佩珀博士说。“这需要一点时间才能理解这是否会导致下游病理。”", "note_en": "Some survivors of  Covid-19 carry worrying signs that their immune system has turned on the body, reminiscent of potentially debilitating diseases like lupus and rheumatoid arthritis, a new study has found.\n At some point,  the body’s defense system in these patients shifted into attacking itself, rather than the virus, the study suggests. The patients are producing molecules called “auto antibodies” that target genetic material from human cells, instead of from the virus.\n This misguided immune response may exacerbate severe Covid-19. It may also explain why so-called “long haulers” have lingering problems months after their initial illness has resolved and the virus is gone from their bodies.\n The findings carry important implications for treatment: Using existing tests that can detect autoantibodies, doctors could identify patients who might benefit from treatments used for lupus and rheumatoid arthritis. There is no cure for these diseases, but some treatments decrease the frequency and severity of flare-ups.\n “It’s possible that you could hit the appropriate patients harder with some of these more aggressive drugs and expect better outcomes,” said Matthew Woodruff, an immunologist at Emory University in Atlanta and lead author of the work.\n The results were  reported Friday on the preprint server MedRxiv, and have not yet been published in a scientific journal. But other experts said the researchers who carried out the study are known for their careful, meticulous work, and that the findings are not unexpected because other viral illnesses also trigger autoantibodies.\n “I’m not surprised, but it’s interesting to see that it’s really happening,” said Akiko Iwasaki, an immunologist at Yale University. “It’s possible that even moderate to mild disease may induce this kind of antibody response.”\n For months it has been clear that the coronavirus can cause the immune system to run amok in some people, ultimately wreaking more damage to the body than the virus itself. ( Dexamethasone, the steroid President Trump took after his Covid diagnosis, has proved effective in some people with severe Covid to tamp down this over-exuberant immune response.)\n  Viral infections cause infected human cells to die. Sometimes the cells die a quiet death — but sometimes, and especially in the throes of severe infection, they can blow up, strewing their innards. When that happens, DNA, normally cloistered in coiled bundles inside the nucleus, is suddenly scattered and visible.\n In the typical response to a virus, cells known as B immune cells make antibodies that recognize pieces of viral RNA from the virus and lock onto them.\n But in conditions like lupus, some B cells never learn to do this and instead produce autoantibodies that glom onto DNA debris from dead human cells, mistaking them for intruders. Something similar may be happening in patients with Covid-19, the research suggests.\n “Anytime you have that combination of inflammation and cell death, there is the potential for autoimmune disease and autoantibodies, more importantly, to emerge,” said Marion Pepper, an immunologist at the University of Washington in Seattle.\n Dr. Woodruff and his colleagues  reported earlier this month that some people with severe Covid-19 also have such unrefined B immune cells. The finding prompted them to explore whether those B cells make autoantibodies.\n In the new study, the researchers looked at 52 patients within the Emory health care system in Atlanta who were classified as having either severe or critical Covid-19, but who had no history of autoimmune disorders.\n They found autoantibodies that recognize DNA in nearly half of the patients. They also found antibodies against a protein called rheumatoid factor and others that help with blood clotting. Among the top half of the most seriously ill patients, more than 70 percent had autoantibodies against one of the targets tested, Dr. Woodruff said.\n “It’s not just that these patients have an autoimmune-like immune response,” he said. “It’s that those immune responses are coupled with actual true testable clinical auto-reactivities.”\n Some of the autoantibodies the researchers identified are associated with blood flow problems, noted Ann Marshak-Rothstein, an immunologist and lupus expert at the University of Massachusetts, Worcester.\n “It’s very possible that some of the coagulation issues that you see in Covid-19 patients are being driven by these kinds of immune complexes,” she said.\n If the autoantibodies do turn out to be long-lasting, she said, they may result in persistent, even lifelong, problems for Covid-19 survivors.\n “You never really cure lupus — they have flares, and they get better and they have flares again,” she said. “And that may have something to do with autoantibody memory.”\n Dr. Marshak-Rothstein, Dr. Iwasaki and dozens of other teams are closely studying the immune response to the coronavirus. Given the ease of testing for autoantibodies, it may soon become clear whether the antibodies were identified only because the researchers went looking for them, or whether they represent a more permanent alteration of the immune system.\n “It’s not clear to me what it all means at this point,” Dr. Pepper said. “It’s going to take a little bit of time to understand if this is something that’s going to lead to downstream pathology.”", "posttime": "2020-11-04 10:10:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,幸存者,survivors,抗体", "title": "一些Covid幸存者的抗体是攻击身体的，而不是病毒", "title_en": "Some Covid Survivors Have Antibodies That Attack the Body, Not Virus", "transed": 1, "url": "https://www.nytimes.com/2020/10/27/health/covid-antibodies-autoimmunity.html", "via": "", "real_tags": ["病毒", "幸存者", "survivors", "抗体"]}, {"category": "", "categoryclass": "", "imagename": "f6b1f706c48c48d4014a81d60f7c451b.jpg", "infoid": 1033097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过学习背后的数学知识来建立您的数据科学和机器学习技能。", "note_en": "Build your data science and machine learning skills by learning the math behind.", "posttime": "2020-11-04 09:51:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学,math,学习", "title": "数据科学的基本数学--该书", "title_en": "Essential Math for Data Science – The Book", "transed": 1, "url": "https://www.essentialmathfordatascience.com/", "via": "", "real_tags": ["科学", "math", "学习"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我断断续续地接触过码头，每次我看到它，似乎都需要重温一下。在本文中，我们将介绍您需要了解的关于Docker的所有内容，以便您可以直接进入现有项目，也可以开始使用它。\nDocker基本上是一个在主机上以隔离方式运行进程的系统，使用了几个Linux内核功能。因此，Docker比成熟的虚拟机更轻量级。Docker容器与虚拟机相比的缺点是多个容器共享相同的底层操作系统内核。虽然监禁进程的概念并不新鲜，Docker的流行本质上是因为它提供的工具使得旋转和管理容器变得非常简单。\nDocker由各种组件组成。主要组件是docker引擎，它由管理容器、映像、构建等的轻量级运行时组成。它在Linux系统上本机运行，由以下部分组成：\nDocker客户端是您作为最终用户用来与Docker守护进程通信的工具，例如docker run hello-world。\nDocker守护进程实际上执行的是在主机上构建和运行容器等命令。Docker客户端也可以在同一台计算机上运行，但它不是必须的。它还可以与运行在不同主机上的Docker守护进程通信。\n我们将在本文后面介绍其他Docker组件，如Docker集线器等。\n可以将Docker映像视为设置安装了所有必需软件和依赖项的计算机的秘诀。除了安装软件，映像还可以定义启动时要运行的进程。Docker镜像是通过Dockerfile中写入的指令创建的。图像是建立在层的概念之上的。始终有一个基本层，后面可能跟有表示文件更改的附加层。每一层都堆叠在其他层之上，由它与上一层之间的差异组成。这是通过联合文件系统实现的。\nDocker容器是镜像的运行实例。这包括操作系统、应用程序代码、运行时、系统工具、系统库等。Docker镜像可以看作是可执行文件，容器可以看作正在运行的应用程序。请注意，在此类比中，每个运行的应用程序都是其自己的实例，并且独立于其他应用程序。\n一般的想法是，一旦您成功创建了容器，您就可以在任何环境中运行它，而不必进行更改。\nDocker卷是容器的数据部分，在创建容器时初始化。卷允许您持久化和共享容器的数据。Docker卷独立于默认的联合文件系统，并作为普通目录和文件存在于主机文件系统上。\n作为docker安装过程的一部分，通过docker run hello-world下载并执行hello world映像。\n$docker imagesRePOSITORY标记映像ID创建SIZEubuntu最新94e814e2efa8 2周前88.9MB hello-world最新fce289e99eb9 2个月前1.84kB。\n从新容器中的映像交互运行命令：docker run-it ubuntu bash。\n列出所有正在运行的容器：Docker PS。要列出所有以前运行的容器，请使用docker ps-a：\n$docker ps-aCONTAINER ID image命令CREATED STATUS PORTS NAMESd2d651741317 ubuntu&#34；bash&#34；45分钟前退出(0)43分钟前可疑_kalam36813bdb6434 ubuntu&#34；bash&#34；大约一小时前退出(0)大约一小时前正在激励_banach46f352a0cde9 hello-world&#34；/hello&#34；2小时前退出(0)2小时前口渴_clke。\n请注意，在上面的输出中，对于每个docker run命令，都创建了一个新容器。如前所述，每个容器都有自己的数据卷，对其中一个的更改不会影响其他容器。要运行现有容器：Docker run[CONTAINER-NAME.。这将启动容器，停靠器ATTACH[CONTAINER-NAME]将跳到其中。\n此时，您应该有足够的资源开始使用现有的docker项目。如果您希望与Ddocker一起开发，请继续阅读。\n如前所述，Docker镜像是通过Dockerfile指定的。下面是一个非常基本的示例，它使用ubuntu基本映像，并将名为sysinfo的可执行文件从当前目录复制到容器中并执行它：\n让我们看看如何通过docker build命令启动并运行此映像(请注意，需要GCC编译二进制文件)：\n$cd~$mkdir-p docker/sysinfo$cd docker/sysinfo$vim sysinfo.cpp#include&lt；iostream&gt；#include&lt；sys/utsname.h&gt；Using&lt；int main(){struct utsname sysinfo；uname(&amp；sysinfo)；cout&lt；&lt；&#34；系统名称：&#34；&lt；&lt；sysinfo.sysname&lt；&lt；Endl；cout&lt；&lt；&34；主机名：&34；&lt；&lt；nodename&lt；发布(内核)版本：&#34；&lt；&lt；sysinfo.release&lt；&lt；Endl；cout&lt；&lt；&34；内核构建时间戳：&#34；&lt；版本&lt；&lt；sysinfo.version&lt；&lt；&#34；Machine Arch：&#34；&lt；&lt；sysinfo.Machine&lt；&lt；Endl；cout&lt；&lt；&#34；Machine Arch：&#34；&lt；&lt；sysinfo.Machine&lt；&lt；Endl；cout&lt；&lt；&#34；域名：&#34；&lt；&lt；sysinfo.domainname&lt；&lt；Endl；return 0；}$g++sysinfo.cpp-o sysinfo$。/sysinfoSystem名称：Linux主机名：CoolbeansRelease(内核)版本：4.18.0-16-GenericKernel Build时间戳：#17-Ubuntu SMP Fri Feb 8 00：06：57 UTC 2019Machine Arch：x86_64域名：(无)$vim DockerfileROM Fubuntu：18.04COPY sysinfo/cmd[&#34；/sysinfo&#34；$docker build。-t sysinfo$docker run sysinfoSystem名称：Linux主机名称：d8e53b009d72Release(内核)版本：4.18.0-16-GenericKernel Build Timestamp：#17-Ubuntu SMP Fri Feb 8 00：06：57 UTC 2019Machine Arch：x86_64域名：(无)。\n请注意以上输出中本地系统(CoolBeans)和运行容器(D8e53b009d72)之间的主机名差异。\n如果您犯了错误，可以通过docker RMI[image-name]--force删除图像。清理与映像相关的未使用的容器和卷可以通过停靠系统修剪--卷来完成。\n在上面的示例中，我们使用标准的Ubuntu映像作为基础映像创建了一个自定义映像，在我们进一步创建自定义映像之前，最好注意到docker集线器为各种软件提供了大量免费的预配置映像。这是第二个Docker组件，有时也称为Docker注册表(也可以有私有注册表)。\n在大多数情况下，我们希望通过Docker运行服务。让我们以一个非常简单Web服务器为例，看看如何实现这一点。按如下方式创建映像(请注意，下面的示例使用GO创建二进制文件)：\n$cd~$mkdir-p docker/webapp$cd docker/webapp$vim webapp.gopackage mainimport(&#34；io&#34；&#34；net/http&34；)func hello(w http.ResponseWriter，r*http.Request){io.WriteString(w，&#34；Hello from webapp！&#34；)}func main(){http.HandleFunc(&#34；/&#34；，hello)http.ListenAndServe(&#34；：8000&#34；)。，nil)}$go build webapp.go$vim DockerfileFROM ubuntu：18.04COPY webapp/cmd[&#34；/webapp&#34；]$docker build。-t Webapp$docker run-d webappcfab907c828a40ce4cc53b88b26badabf8fa6672fd538d0c072fd0947f36d650。\n在上面的示例中，我们构建了一个webapp映像，并使用-d标志启动了docker容器。这将以分离模式启动容器，并打印容器ID，以便我们可以与其交互。我们可以通过坞站PS确认它正在运行：\n容器ID映像命令已创建状态端口NAMEScFab907c828a Webapp&#34；/webapp&#34；4分钟前开始工作4分钟HERELAUS_HERSCEL。\n此时，我们的Web应用程序在停靠容器中运行，但我们无法与其通信。运行docker check cFab907c828a以json格式输出容器配置。我们对NetworkSettings.Networks.bridge ge.IPAddress属性感兴趣。让我们尝试连接到提供的IP地址http://172.17.0.2:8000(在我的例子中)，我们可以看到我们的Web应用程序正在运行！\n还可以将端口从docker容器绑定到主机，这样我们就可以访问服务，就像它们在本地运行一样，docker run-d-p3000：8000 webapp。因此，我们的Web应用程序现在可以在http://localhost:3000！上使用。\n默认情况下，Docker容器具有自己的存储空间，只要容器在运行，该存储空间就会一直存在。如果我们想要跨容器持久化数据，可以将本地文件/目录绑定到容器，也可以创建并挂载命名的Docker卷。使用Docker卷的额外好处是，它不必是主机文件系统上的资源，也可以是外部云存储服务，具体取决于驱动程序。\n这里有一个使用Postgres docker图像和持久数据存储的非常实用的示例。\n我们了解了Docker的基本概念，创建了几个容器，运行了一些服务，甚至在机器重新启动时保存了数据！这超过了10分钟，但应该足够和多克一起走了。", "note_en": "I&#39;ve been exposed to docker on and off and every time I see it, I seem to need a refresher. In this article we will go through everything you need to know about Docker in order to either jump into an existing project or get started with it.\n  Docker is basically a system of running processes on the host machine in an isolated way, using several Linux kernel features. Thus, Docker is more lightweight than a full-blown virtual machine. The disadvantage of a Docker container vs. a virtual machine is that multiple containers share the same underlying OS kernel. While the concept of jailed processes is not new, Docker&#39;s popularity was essentially due to the tooling that it provided to which made it really straightforward to spin up and manage containers.\n Docker is made up of various components. The main component is the the docker engine, which consists of a lightweight runtime that manages containers, images, builds, and more. It runs natively on Linux systems and is made up of:\n  The Docker client is what you, as the end-user use to communicate with the Docker daemon, e.g.  docker run hello-world.\n The Docker daemon is what actually executes commands like building and running containers on the host machine. The Docker Client can run on the same machine as well, but it does not have to. It can also communicate with the Docker Daemon running on a different host.\n We will look at other Docker components like the Docker hub, etc. later in this article.\n  A Docker image can be though of as a recipe for setting up a machine with all required software and dependencies installed. Apart from installing software, images can also define what processes to run when launched. Docker images are created via instructions written in a  Dockerfile. Images are built on the concept of layers. There is always a base layer, potentially followed by additional layers that represent file changes. Each layer is stacked on top of the others, consisting of the differences between it and the previous layer. This is achieved via a  Union file system.\n A Docker container is the running instance of an image. This includes the operating system, application code, runtime, system tools, system libraries, etc. A Docker image can be thought of as an executable and a container can be thought of as the running application. Note that in this analogy each running application is its own instance and independent of the others.\n The general idea is that once you have successfully created a container, you can then run it in any environment without having to make changes.\n A Docker volume is the &#34;data&#34; part of a container, initialized when a container is created. Volumes allow you to persist and share a container&#39;s data. Docker volumes are separate from the default Union File System and exist as normal directories and files on the host filesystem.\n  As part of the docker installation process, a hello world image was downloaded and executed via:  docker run hello-world\n  $ docker imagesREPOSITORY TAG IMAGE ID CREATED SIZEubuntu latest 94e814e2efa8 2 weeks ago 88.9MBhello-world latest fce289e99eb9 2 months ago 1.84kB\n Run a command interactively from an image in a new container:  docker run -it ubuntu bash\n List all running containers:  docker ps. To list all previously run containers use  docker ps -a:\n $ docker ps -aCONTAINER ID IMAGE COMMAND CREATED STATUS PORTS NAMESd2d651741317 ubuntu &#34;bash&#34; 45 minutes ago Exited (0) 43 minutes ago suspicious_kalam36813bdb6434 ubuntu &#34;bash&#34; About an hour ago Exited (0) About an hour ago inspiring_banach46f352a0cde9 hello-world &#34;/hello&#34; 2 hours ago Exited (0) 2 hours ago thirsty_clarke\n Note that in the output above, for each docker  run command, a new container was created. As mentioned previously, each container has it&#39;s own data volume and changes to one do not affect the others. To run an existing container:  docker run [container-name. This will start the container and  docker attach [container-name] will jump into it.\n At this point, you should have enough to get started with an existing docker project. Read on if you&#39;re looking to develop with docker.\n  As noted previously, Docker images are specified via a  Dockerfile. Here&#39;s an extremely basic example that uses a ubuntu base image and copies an executable called  sysinfo from the current directory into the container and executes it:\n  Let&#39;s see how we can get this image up and running via the  docker build command (note that gcc is required to compile the binary):\n $ cd ~$ mkdir -p docker/sysinfo$ cd docker/sysinfo$ vim sysinfo.cpp#include &lt;iostream&gt;#include &lt;sys/utsname.h&gt;using namespace std;int main() { struct utsname sysinfo; uname(&amp;sysinfo); cout &lt;&lt; &#34;System Name: &#34; &lt;&lt; sysinfo.sysname &lt;&lt; endl; cout &lt;&lt; &#34;Host Name: &#34; &lt;&lt; sysinfo.nodename &lt;&lt; endl; cout &lt;&lt; &#34;Release(Kernel) Version: &#34; &lt;&lt; sysinfo.release &lt;&lt; endl; cout &lt;&lt; &#34;Kernel Build Timestamp: &#34; &lt;&lt; sysinfo.version &lt;&lt; endl; cout &lt;&lt; &#34;Machine Arch: &#34; &lt;&lt; sysinfo.machine &lt;&lt; endl; cout &lt;&lt; &#34;Domain Name: &#34; &lt;&lt; sysinfo.domainname &lt;&lt; endl; return 0;}$ g++ sysinfo.cpp -o sysinfo$ ./sysinfoSystem Name: LinuxHost Name: coolbeansRelease(Kernel) Version: 4.18.0-16-genericKernel Build Timestamp: #17-Ubuntu SMP Fri Feb 8 00:06:57 UTC 2019Machine Arch: x86_64Domain Name: (none)$ vim DockerfileFROM ubuntu:18.04COPY sysinfo /CMD [&#34;/sysinfo&#34;]$ docker build . -t sysinfo$ docker run sysinfoSystem Name: LinuxHost Name: d8e53b009d72Release(Kernel) Version: 4.18.0-16-genericKernel Build Timestamp: #17-Ubuntu SMP Fri Feb 8 00:06:57 UTC 2019Machine Arch: x86_64Domain Name: (none)\n Note in the difference in hostname between local system (coolbeans) and the running container (d8e53b009d72) in the above output.\n If you make a mistake, you can remove an image via  docker rmi [image-name] --force. Cleaning up unused containers and volumes related to the image can be accomplished via  docker system prune --volumes.\n In the above example, we created a custom image using the standard Ubuntu image as our base image, before we go further with creating custom images it would be good to note that the docker  hub provides lots of free pre-configured images for various software. This is the second Docker component and is also sometimes called the Docker registry (one can also have private registries).\n  In most cases, we would like to run a service via Docker. Let is look at how we can accomplish this by using a very simple web server as an example. Create the image as follows (note that the example below uses Go to create the binary):\n $ cd ~$ mkdir -p docker/webapp$ cd docker/webapp$ vim webapp.gopackage mainimport (\t&#34;io&#34;\t&#34;net/http&#34;)func hello(w http.ResponseWriter, r *http.Request) {\tio.WriteString(w, &#34;Hello from webapp!&#34;)}func main() {\thttp.HandleFunc(&#34;/&#34;, hello)\thttp.ListenAndServe(&#34;:8000&#34;, nil)}$ go build webapp.go$ vim DockerfileFROM ubuntu:18.04COPY webapp /CMD [&#34;/webapp&#34;]$ docker build . -t webapp$ docker run -d webappcfab907c828a40ce4cc53b88b26badabf8fa6672fd538d0c072fd0947f36d650\n In the above example we built a webapp image and started the docker container with the  -d flag. This started the container in detached mode and printed the container id so that we could interact with it. We can confirm it is running via  docker ps:\n CONTAINER ID IMAGE COMMAND CREATED STATUS PORTS NAMEScfab907c828a webapp &#34;/webapp&#34; 4 minutes ago Up 4 minutes zealous_herschel\n At this point we have our web application running in a docker container but we have no way to communicate with it. Run  docker inspect cfab907c828a to output the container configuration in json format. We are interested in the  NetworkSettings.Networks.bridge.IPAddress property. Let&#39;s try connecting to the provided ip address, http://172.17.0.2:8000 (in my case) and we can see our web application in action!\n It is also possible to bind ports on from the docker container to the host machine so that we can access services as if they were running locally,  docker run -d -p3000:8000 webapp. Thus our web application is now available on http://localhost:3000!\n  By default Docker containers come with their own storage which lives as long as the container is running. If we would like to persist data across containers, we can either bind a local file/directory to our container or create and mount a named Docker volume. The added benefit of using a Docker volume is that it does not necessarily have to be a resource on the host file system, it can also be an external cloud storage service depending upon the driver.\n A very practical example of using a postgres docker image with persistent data storage can be found  here.\n  We looked at Docker basic concepts, created a few containers, ran some services and even persisted data across machine restarts! This was longer than 10 minutes but it should be enough to get going with Docker.", "posttime": "2020-11-04 09:51:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,码头", "title": "码头10分钟后开工", "title_en": "Docker in 10 Minutes", "transed": 1, "url": "https://smalldata.tech/blog/2019/06/08/docker-in-10-minutes", "via": "", "real_tags": ["docker", "码头"]}, {"category": "", "categoryclass": "", "imagename": "a678a0a9b966d4475f245b0ed520d2b8.jpg", "infoid": 1033095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "控制冠状病毒大流行的部分挑战是快速识别和隔离感染者-当新冠肺炎的症状并不总是明显的时候，尤其是在早期，这并不是特别容易。现在，科学家们开发出一种新的人工智能模型，可以从简单的强迫咳嗽中检测出病毒。\n有证据表明，人工智能可以发现人耳听不到的咳嗽差异，如果探测系统能被整合到智能手机等设备中，研究团队认为它可能成为一种有用的早期筛查工具。\n这项工作建立在已经在通过咳嗽和说话检测阿尔茨海默氏症的研究基础上。一旦大流行开始蔓延，研究小组将注意力转向新冠肺炎，利用已经了解到的关于疾病如何导致我们的语言和其他噪音产生非常小的变化的知识。\n来自麻省理工学院(MIT)的研究科学家布莱恩·苏比拉纳说，说话和咳嗽的声音都受到声带和周围器官的影响。\n这意味着当你说话时，你说话的一部分像咳嗽，反之亦然。\n这也意味着，我们很容易从流利的语言中学到一些东西，人工智能可以简单地从咳嗽中学到东西，包括这个人的性别、母语，甚至是情绪状态。事实上，在你咳嗽的方式中嵌入了情感。\n这项针对新冠肺炎的阿尔茨海默氏症研究涉及一种名为ResNet50的神经网络。它被训练了1000小时的人类语音，然后是在不同情绪状态下说的话的数据集，然后是咳嗽的数据库，以发现肺部和呼吸性能的变化。\n当这三种模型组合在一起时，一层噪音被用来过滤掉较弱咳嗽中的较强咳嗽。在捕获的大约2,500份确认患有新冠肺炎的咳嗽记录中，人工智能正确识别了其中的97.1%-以及100%的无症状病例。\n这是一个令人印象深刻的结果，但还有更多的工作要做。研究人员强调，它的主要价值在于找出无症状人群的健康咳嗽和不健康咳嗽之间的区别，而不是真正诊断新冠肺炎，而这需要进行适当的测试。换句话说，它是一个早期预警系统。\n苏比拉纳说，如果每个人都在去教室、工厂或餐馆之前使用这个群体诊断工具，那么这个群体诊断工具的有效实施可以减少大流行的传播。\n事实上，这项检测是非侵入性的，几乎可以免费运行，而且应用速度快，这增加了它的潜在用处-尽管它不是为诊断已经出现症状的新冠肺炎患者而设计的，但它可以告诉你，在没有主要病毒迹象的情况下，你是否应该隔离并进行适当的检测。\n研究人员现在想要在一组更多样化的数据上测试引擎，看看是否有其他因素涉及到达到如此令人印象深刻的高检测率。如果它真的进入了手机应用程序阶段，显然也会对隐私产生影响，因为我们中很少有人会希望自己的设备不断监听健康状况不佳的迹象。\n一旦我们开始将冠状病毒大流行抛诸脑后，这项新的研究可以帮助反馈到咳嗽和阿尔茨海默氏病检测的研究中。数据显示，神经网络只需稍作调整就能适应每种情况。\n研究人员在他们发表的论文中写道，我们的研究揭示了阿尔茨海默氏症和COVID歧视之间惊人的相似之处。\n完全相同的生物标记物可以用来作为两者的鉴别工具，这表明，除了温度、压力或脉搏之外，也许还有一些更高水平的生物标记物可以充分诊断曾经被认为几乎不相关的各个专业的情况。\n这项研究已经发表在IEEE医学和生物学工程开放期刊上。", "note_en": "Part of the challenge in controlling the  coronavirus  pandemic is in identifying and isolating infected people quickly – not particularly easy when  COVID-19 symptoms  aren&#39;t always noticeable, especially early on. Now scientists have developed a new  artificial intelligence model that can detect the  virus from a simple forced cough.\n   Evidence shows that the AI can spot differences in coughing that can&#39;t be heard with the human ear, and if the detection system can be incorporated into a device like a smartphone, the research team thinks it could become a useful early screening tool.\n The work builds on research that was already happening into  Alzheimer&#39;s detection through coughing and talking. Once the pandemic started to spread, the team turned its attention to COVID-19 instead, tapping into what had already been learned about how disease can cause very small changes to speech and the other noises we make.\n &#34;The sounds of talking and coughing are both influenced by the vocal cords and surrounding organs,&#34;  says research scientist Brian Subirana, from the Massachusetts Institute of Technology (MIT).\n &#34;This means that when you talk, part of your talking is like coughing, and vice versa.&#34;\n &#34;It also means that things we easily derive from fluent speech, AI can pick up simply from coughs, including things like the person&#39;s gender, mother tongue, or even emotional state. There&#39;s in fact sentiment embedded in how you cough.&#34;\n   The Alzheimer&#39;s research repurposed for COVID-19 involved a neural network known as ResNet50. It was trained on a thousand hours of human speech, then on a dataset of words spoken in different emotional states, and then on a database of coughs to spot changes in lung and respiratory performance.\n When the three models were combined, a layer of noise was used to filter out stronger coughs from weaker ones. Across around 2,500 captured cough recordings of people confirmed to have COVID-19, the AI correctly identified 97.1 percent of them – and 100 percent of the asymptomatic cases.\n That&#39;s an impressive result, but there&#39;s more work to do yet. The researchers emphasise that its main value lies in spotting the difference between healthy coughs and unhealthy coughs in asymptomatic people – not in actually diagnosing COVID-19, which a proper test would be required for. In other words, it&#39;s an early warning system.\n &#34;The effective implementation of this group diagnostic tool could diminish the spread of the pandemic if everyone uses it before going to a classroom, a factory, or a restaurant,&#34;  says Subirana.\n The fact that the test is non-invasive, virtually free to run and speedy to apply adds to its potential usefulness – while it&#39;s not designed to  diagnose people with COVID-19 who are already showing symptoms, it could tell you if you should isolate and get a proper test when no major signs of the virus are showing.\n The researchers now want to test the engine on a more diverse set of data, and see if there are other factors involved in reaching such an impressively high detection rate. If it does make it to the phone app stage, there are obviously going to be privacy implications too, as few of us will want our devices constantly listening out for signs of ill health.\n Once we start to put the coronavirus pandemic behind us, the new research could help feed back into the study of coughs and  Alzheimer&#39;s detection. The data show that the neural networks only required slight tweaking in order to be adapted to each condition.\n &#34;Our research uncovers a striking similarity between Alzheimer&#39;s and COVID discrimination,&#34; write the researchers in their  published paper.\n &#34;The exact same biomarkers can be used as a discrimination tool for both, suggesting that perhaps, in addition to temperature, pressure or pulse, there are some higher-level biomarkers that can sufficiently diagnose conditions across specialties once thought mostly disconnected.&#34;\n The research has been published in the   IEEE Open Journal of Engineering in Medicine and Biology.", "posttime": "2020-11-04 09:37:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "肺炎,asymptomatic,研究", "title": "麻省理工学院团队的咳嗽检测器即使在没有症状的人中也能识别出97%的新冠肺炎病例", "title_en": "MIT Team's Cough Detector Identifies 97% of COVID-19 Cases Even in Asymptomatic People", "transed": 1, "url": "https://www.sciencealert.com/ai-cough-analysis-could-detect-covid-19-even-if-you-re-asymptomatic", "via": "", "real_tags": ["肺炎", "研究"]}, {"category": "", "categoryclass": "", "imagename": "1eab9e94912c708f8ca13033b4e11eb9.jpg", "infoid": 1033094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔通过一封简短的便条向我们确认了这笔收购。一位发言人表示：“我们可以确认，我们已经收购了Cnvrg。”“Cnvrg将是一家独立的英特尔公司，将继续为现有和未来的客户服务。”这些客户包括Lightricks、St Unitas和Playtika。\n英特尔没有透露这笔交易的任何财务条款，也没有透露这家初创公司的哪些人将加入英特尔。由Yochay Ettun(首席执行官)和Leah Forkosh Kolben共同创立的Cnvrg已经从包括Hanaco Venture Capital和耶路撒冷风险投资伙伴在内的投资者那里筹集了800万美元，PitchBook估计它在上一轮融资中的估值约为1700万美元。\n就在一周前，英特尔又进行了一次收购，以推动其人工智能业务，也是在机器学习建模领域：它收购了SigOpt，后者开发了一个运行机器学习建模和仿真的优化平台。\n虽然SigOpt的总部设在旧金山湾区，但Cnvrg位于以色列，加入了英特尔在该国专门在人工智能研发领域建立的广泛足迹，围绕其Mobileye自动驾驶汽车业务(2017年以150多亿美元收购)和收购人工智能芯片制造商哈瓦那(2019年底以20多亿美元收购)。\nCnvrg.io的平台可以跨内部部署、云和混合环境运行，它分为付费和免费两个层次(我们去年报道了免费服务品牌Core的推出)。它的竞争对手包括Databricks、Sagemaker和Dataiku，以及建立在开源框架上的H2O.ai等规模较小的公司。Cnvrg的前提是，它为数据科学家提供了一个用户友好的平台，这样他们就可以专注于设计算法和测量它们的工作方式，而不是构建或维护他们运行的平台。\n虽然英特尔没有对这笔交易发表太多言论，但上周收购SigOpt背后的一些相同逻辑似乎也适用于此：英特尔一直在围绕下一代芯片调整业务重点，以更好地与NVIDIA等公司和GraphCore等规模较小的公司竞争。因此，为客户提供/投资人工智能工具也是有意义的，特别是帮助他们在这些芯片上运行的计算负载的服务。\n值得注意的是，在我们去年关于Core free层的文章中，Frederic指出，那些在云中使用该平台的人可以使用运行在Kubernetes集群上的NVIDIA优化容器来做到这一点。目前还不清楚这种情况是否会继续，或者容器是否会针对英特尔架构进行优化，或者两者兼而有之。Cnvrg的其他合作伙伴包括RedHat和NetApp。\n英特尔将重点放在下一代计算上，旨在抵消其遗留业务的下滑。上一季，英特尔公布营收下滑3%，数据中心业务下滑领跌。该公司表示，预计到2024年，人工智能硅市场将超过250亿美元，数据中心的人工智能硅市场在此期间将超过100亿美元。\n2019年，英特尔报告了约38亿美元的人工智能驱动收入，但它希望像SigOpt这样的工具将有助于推动该业务的更多活动，与在更广泛的业务中推动更多人工智能应用相吻合。", "note_en": "Intel   confirmed the acquisition to us with a short note. “We can confirm that we have acquired Cnvrg,” a spokesperson said. “Cnvrg will be an independent Intel company and will continue to serve its existing and future customers.” Those customers  include Lightricks, ST Unitas and Playtika.\n Intel is not disclosing any financial terms of the deal, nor who from the startup will join Intel. Cnvrg, co-founded by Yochay Ettun (CEO) and Leah Forkosh Kolben,  had raised $8 million from investors that include Hanaco Venture Capital and Jerusalem Venture Partners and PitchBook  estimates that it was valued at around $17 million in its last round.\n  It was only a week ago that Intel  made another acquisition to boost its AI business, also in the area of machine learning modeling: it picked up SigOpt, which had developed an optimization platform to run machine learning modeling and simulations.\n While SigOpt is based out of the Bay Area, Cnvrg is in Israel and joins an extensive footprint that Intel has built in the country specifically in the area of artificial intelligence research and development, banked around its Mobileye autonomous vehicle business (which it acquired for  more than $15 billion in 2017) and its acquisition of AI chipmaker Habana (which it  acquired for $2 billion at the end of 2019).\n Cnvrg.io’s platform works across on-premise, cloud and hybrid environments and it comes in paid and free tiers (we  covered the launch of the free service, branded Core, last year). It competes with the likes of Databricks, Sagemaker and Dataiku as well as smaller operations like H2O.ai that are built on open source frameworks. Cnvrg’s premise is that it provides a user-friendly platform for data scientists so that they can concentrate on devising algorithms and measuring how they work, not building or maintaining the platform that they run on.\n While Intel is not saying much about the deal, it seems that some of the same logic behind last week’s SigOpt acquisition applies here as well: Intel has been refocusing its business around  next-generation chips to better compete against the likes of Nvidia and smaller players like GraphCore. So it makes sense to also provide/invest in AI tools for customers, specifically services to help with the compute loads that they will be running on those chips.\n It’s notable that in our article about the Core free tier last year, Frederic noted that those using the platform in the cloud can do so with Nvidia-optimized containers that run on a Kubernetes cluster. It’s not clear if that will continue to be the case, or if containers will be optimized instead for Intel architecture, or both. Cnvrg’s other partners include Red Hat and NetApp.\n Intel’s focus on the next generation of computing aims to offset declines in its legacy operations. In the last quarter, Intel  reported a 3% decline in its revenues, led by a drop in its data center business. It said that it’s projecting the AI silicon market to be bigger than $25 billion by 2024, with AI silicon in the data center to be greater than $10 billion in that period.\n In 2019, Intel reported some $3.8 billion in AI-driven revenue, but it hopes that tools like SigOpt’s will help drive more activity in that business, dovetailing with the push for more AI applications in a wider range of businesses.", "posttime": "2020-11-04 09:14:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,收购,acquired,人工智能", "title": "\n英特尔收购了Cnvrg.io，这是一个管理、构建和自动化机器学习的平台", "title_en": "\n\t\t\t\tIntel has acquired Cnvrg.io, a platform to manage, build and automate machine learning\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/intel-has-acquired-cnvrg-io-a-platform-to-manage-build-and-automate-machine-learning/", "via": "", "real_tags": ["英特尔", "收购", "acquired", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "d245dc07cadeda5688068982c0ea7a35.png", "infoid": 1033093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，在选民开始投票时，一波可疑的机器人电话和短信轰炸了他们，引发了人们新的担忧，即恶意行为者可能会在多大程度上利用美国人的智能手机来吓唬投票站的人。\n据追踪电信业的专家称，最近几天，全国各地的选民估计收到了1000万个自动垃圾电话，告诉他们“确保安全，呆在家里”。在密歇根州，政府官员周二表示，他们目睹了更多欺骗该州选民的企图，其中包括一次针对弗林特市的机器人通话活动，该活动错误地告诉人们，如果他们希望避免今天排起长队，就应该明天投票。\n每一通电话和短信的来源尚不清楚，反映了机器人呼叫者通常采用的复杂策略，以便通过广泛的设备和服务接触到美国人。作为回应，州选举官员争先恐后地安抚选民，密歇根州州长格雷琴·惠特默(Gretchen Whitmer)周二承诺“迅速消除错误信息。”一名特朗普政府官员表示，联邦调查局(FBI)也对密歇根州的机器人通话展开了调查。\n“待在家里”电话的范围和时机同样引起了州和联邦政府领导人的注意，包括纽约州总检察长利蒂夏·詹姆斯(Letitia James)，她说她已经发出传票调查入侵的来源。YouMail是一家为智能手机提供机器人通话屏蔽应用的科技公司，该公司为“华盛顿邮报”准备的数据显示，自今年夏天活动开始以来，全国317个区号中的280个都接到了电话。该国最大的电信运营商认为这些电话来自外国。\n虽然机器人电话会议没有明确提到2020年总统选举或可能影响选民福祉的问题，包括冠状病毒大流行，但它仍然造成了广泛恐慌或混乱的可能性。YouMail首席执行官亚历克斯·奎利奇(Alex Quilici)表示，这表明该国电话系统中挥之不去的、令人担忧的漏洞。\n他说：“如果你想在美国为选举造成严重破坏，一种方法显然就是机器人通话。”“这整件事暴露出，要对一场大规模的呼叫量活动做出快速反应可能非常困难。”\n当扎克·麦克马伦(Zach McMullen)周一接到一个电话，告诉他“是时候呆在家里了”时，他以为这一警告与冠状病毒有关。他在亚特兰大一家面包店的同事也收到了同样的信息，他们最初认为是市政府在执行其公共卫生指导方针。\n但“机器人的声音”让麦克马伦停顿了一下，第二个电话-然后是第三个，第四个-在同一天传递了同样的单调信息。\n纷至沓来的电话表明，选民们说，在一场令人眼花缭乱的总统竞选的最后几天，这些技术被用来说服和迷惑他们。在俄罗斯特工利用社交媒体传播分裂信息四年后，美国人开始期待着到处都有类似的努力-包括在他们的手机上。\n长期以来，机器人电话一直代表着一个国家的祸害：就在上个月，美国人接到了40亿个自动电话，诈骗者做出了很大贡献，击败了华盛顿监管机构多年来打击垃圾邮件的努力。但是，考虑到2020年总统竞选的争议性，这些策略-集体拨打美国人的电话，有时是非法的，而且没有得到他们的同意-变得更加重要。那些帮助候选人和他们的盟友正确接触到他们的支持者的工具，也代表了谎言广泛传播和不太显眼的新途径。\n匹兹堡大学网络法律、政策和安全研究所(Institute for Cyber Law，Policy，and Security)政策主任克里斯·德鲁齐奥(Chris Deluzio)表示：“选举日本身就是这些压制努力真正显现出来的最脆弱的时候。”\n周二上午，密歇根州司法部长达娜·内塞尔(Dana Nessel)警告当地选民，一通可疑的电话和短信试图在投票过程中播下混乱的种子。一条短信说，一个“印刷错误”意味着“打算投票给乔·拜登”的人不得不选择特朗普总统，反之亦然。内塞尔的办公室与“华盛顿邮报”分享的这篇文章将这些信息归因于“联邦调查局”(Federal Berue[原文如此])。\n内塞尔在推特上写道：“迪尔伯恩的选民们，据报道，发送短信是为了欺骗你，让你以为选票传感器有问题。”“别上当，这是个骗局！”\n国土安全部的一名高级官员周二表示，联邦调查局正在调查这些机器人通话，通过“正常的刑事程序”进行操作。这位官员补充说，他预计会看到更多这样的努力，并指出之前的选举都是采取类似策略的场合。\n负责监管该国电信巨头的联邦通信委员会(Federal Communications Commission)拒绝透露是否正在调查此事。AT&amp；T、Verizon和T-Mobile也没有回应置评请求。在纽约州，州总检察长承诺“最大限度地依法”追究肇事者的责任。\n詹姆斯在一份声明中说：“试图阻止选民行使投票权的做法令人沮丧、令人不安，而且是错误的。”“更重要的是，这是违法的，是绝对不能容忍的。”\n根据YouMail收集的数据，自今年夏天以来，这个“呆在家里”的机器人电话似乎一直轰炸着美国人，有时每天大约有50万个电话。它们都有相同的简短录音信息：一个电脑化的女性声音说这是一个“测试电话”，然后两次鼓励人们留在室内。这些机器人电话来自一系列虚假或未知的号码，在10月份达到顶峰，也影响了其他一些国家。\n美国电话电报公司(AT&amp；T)、威瑞森(Verizon)和其他电信巨头的行业协会USTelecom发言人布莱恩·韦斯(Brian Weiss)表示，该组织最近几天一直在寻求追踪和打击这场运动。他说，早期证据表明，这些电话“可能来自欧洲”，尽管它们有时会通过其他外国电信提供商转接。\nUSTelecom和其他机器人通话专家表示，机器人通话活动背后的身份不明的参与者似乎还依赖于额外的复杂策略，以确保该国电话系统背后的公司不能轻易阻止它。这包括在电话号码之间循环，通常使用与他们试图拨打的人拥有的号码类似的号码，这种做法被称为欺骗。\n与大多数试图欺骗美国人回电话并交出敏感信息的机器人电话骗局不同，“呆在家里”运动也引起了怀疑，因为这些电话没有这样的努力。\n拥有智能手机屏蔽应用RoboKiller的TelTech营销副总裁朱莉娅·波特(Giulia Porter)说，“他们通常威胁你要提供你的社保号码，否则你会出事。”“从这个机器人电话中，我们看不到任何迹象表明他们真的在试图从你那里得到什么。”\n周二，这一信息的性质引起了一些州选举官员的警觉，他们试图向当地选民保证，他们当地的投票站是安全的。内布拉斯加州国务卿罗伯特·埃夫宁(Robert Evnen)在一条推文中警告人们注意机器人电话，他说，“我们的选民和投票工作人员将受到保护。”\n他们表达的担忧-可能会成功地让人们停止投票-反映了长期以来的担忧，即大流行可能会破坏人们对2020年选举的参与。出于安全考虑，许多州都扩大了邮寄投票的机会，选举管理人员也煞费苦心地对冠状病毒的面对面投票进行了改造，提供了洗手液和其他保障措施。\n40岁的凯文·波尔曼(Kevin Porman)住在印第安纳波利斯郊外，他说：“我的反应是，这很可能是为了让人们不要投票。”\n费城护士劳里·基安巴莱罗(Laurie Chiambalero)的区号是波士顿，她说，她接这个电话是因为她相信这可能是一个友好的公共卫生提醒。\n“但当我第二次拿到它的时候，”她说，“它真的感觉就像是因为选举的原因，它告诉我接下来几天要呆在家里。”\n然而，Chiambalero说她已经投票了。“他们没有吓唬我，”她宣布。\n投票须知：美国已经创下了投票人数的纪录。如果你今天亲自投票，找出你所在州的规则。\n关于总统竞选有什么要知道的：到底是谁投票，他们投票给谁？探索关键人口群体投票率和投票模式的变化如何影响总统竞选。\n关于参议院：以下是值得关注的参议院竞选|关于众议院，以下是值得关注的众议院竞选。\n选举结果：以下是我们知道的关于何时预期结果的信息，包括关键的摇摆州。\n显示更多", "note_en": "A wave of suspicious robocalls and texts bombarded voters as they began to cast their ballots on Tuesday, sparking fresh concerns about the extent to which malicious actors might harness Americans’ smartphones to scare people from the polls.\n  Across the country, voters have received an estimated 10 million automated, spam calls in recent days telling them to “ stay safe and stay home,” according to experts who track the telecom industry. In Michigan, government officials on Tuesday said they had witnessed additional attempts to deceive their state’s voters in particular, including one robocall campaign targeting the city of Flint that inaccurately told people to vote tomorrow if they hoped to avoid long lines today.\n The origins of the each of the calls and texts remain unclear, reflecting the sophisticated tactics that robocallers typically deploy in order to reach Americans en masse across a wide array of devices and services. State election officials have scrambled to reassure voters in response, with Michigan Gov. Gretchen Whitmer  pledging Tuesday to “work quickly to stamp out misinformation.&#34; The FBI also has opened an investigation into the Michigan robocalls, a Trump administration official said.\n  The reach and timing of the “stay home” calls similarly caught the attention of state and federal government leaders, including New York Attorney General Letitia James (D), who said she had already sent subpoenas to investigate the source of the intrusion. Data prepared for The Washington Post by  YouMail, a tech company that offers a robocall-blocking app for smartphones, shows that the calls have reached 280 of the country’s 317 area codes since the campaign began in the summer. The country’s top telecom carriers believe the calls are foreign in origin.\n  While the robocall did not explicitly mention the 2020 presidential election or issues that might affect voters’ well-being, including the  coronavirus pandemic, it still created the potential for widespread panic or confusion. And it illustrated lingering, worrisome vulnerabilities in the country’s phone system, said Alex Quilici, YouMail’s chief executive.\n   “If you wanted to cause havoc in America for the elections, one way to do it is clearly robocalling,” he said. “This whole thing is exposing [that] it can be very difficult to react quickly to a large calling volume campaign.”\n  When Zach McMullen received a call Monday telling him it was “time to stay home,” he assumed the warning was related to the coronavirus. His co-workers at an Atlanta bakery had received the same message, and they initially figured it was the city government enforcing its public health guidelines.\n But the “robotic voice” gave McMullen pause, as did the second call — and then the third, and the fourth — delivering the same monotone message on the same day.\n   The torrent of calls illustrated the wide array of technologies that voters say are being used to convince and confuse them in the closing days of a dizzying presidential campaign. Four years after Russian agents exploited social media to spread divisive messages, Americans have come to expect similar efforts everywhere — including on their phones.\n  Robocalls long have represented a  national scourge: Scammers contributed greatly to the 4 billion automated calls  placed to Americans just last month, outwitting years of efforts by  Washington regulators to crack down on the spam. But these tactics — dialing Americans en masse, sometimes illegally and without their consent — have taken on greater significance given the contentiousness of the 2020 presidential race. The same tools that have helped candidates and their allies reach their supporters properly also  represent new avenues for falsehoods to spread widely and without much visibility.\n  “Election Day itself is the most vulnerable time for those kinds of suppressive efforts to really show up,” said Chris Deluzio, policy director at the University of Pittsburgh’s Institute for Cyber Law, Policy, and Security.\n  On Tuesday morning, Michigan Attorney General Dana Nessel warned local voters about a suspicious calls and texts that sought to sow confusion about the voting process. One text said a “typographical error” meant that people who are “intending on voting for Joe Biden” instead had to select President Trump, and vice versa. The text, which Nessel’s office shared with The Washington Post, attributed the information to the “Federal Berue [sic] of Investigation.&#34;\n  “Dearborn voters, text messages are reportedly being sent to trick you into thinking there are ballot sensor issues,”  Nessel tweeted. “Do not fall for it, it’s a trick!”\n  A senior official at the Department of Homeland Security said Tuesday that the FBI is investigating the robocalls, operating through its “normal criminal process.” The official added that he’d expect to see more such efforts, noting that prior elections have been occasions for similar tactics.\n  The Federal Communications Commission, which regulates the country’s telecom giants, declined to say if it is probing the matter. AT&amp;T, Verizon and T-Mobile also did not respond to requests for comment. In New York, the state’s attorney general pledged to hold perpetrators accountable “to the fullest extent of the law.”\n “Attempts to hinder voters from exercising their right to cast their ballots are disheartening, disturbing, and wrong,&#34; James said in a statement. “What’s more is that it is illegal, and it will not be tolerated.”\n  The “stay home” robocall appears to have bombarded Americans since the summer, sometimes yielding a roughly estimated half-million calls each day, according to data collected by YouMail. They all feature the same short, recorded message: A computerized female voice says it is a “test call” before twice encouraging people to remain inside. The robocalls have come from a slew of fake or unknown numbers, peaked in October and affected some other countries as well.\n  USTelecom, a trade association for AT&amp;T, Verizon and other telecom giants, has sought to trace and combat the campaign in recent days, according to Brian Weiss, the group’s spokesman. He said early evidence suggests that the calls are “possibly coming from Europe,” though they are sometimes routed through other foreign telecom providers.\n The unidentified actor behind the robocall campaign also appears to have relied on additional sophisticated tactics to ensure that the companies behind the country’s phone systems could not easily stop it, according to USTelecom and other robocall experts. That includes cycling through phone numbers, often using a number similar to the one owned by the person they are trying to dial, a practice known as spoofing.\n  Unlike most robocall scams, which seek to swindle Americans into returning the calls and surrendering sensitive information, the “stay home” campaign also has raised suspicions because the calls include no such effort.\n  “They’re usually threatening you to provide your Social Security number or something will happen to you,” said Giulia Porter, the vice president of marketing at TelTech, which owns the smartphone blocking app RoboKiller. “From this robocall, we can’t see anything that is indicating they’re actually trying to get something from you.”\n  The nature of the message raised alarms Tuesday with some state election officials, who sought to reassure local voters that their local polling places are safe. “Our voters and our poll workers will be kept safe,” said Robert Evnen, the secretary of state for Nebraska, in a  tweet warning people about the robocall.\n  The concerns that they expressed — that it might succeed in turning people off from voting — reflect long-standing fears that the pandemic could undermine participation in the 2020 election. Numerous states have expanded opportunities to vote by mail in response to safety concerns, and election administrators have taken pains to retrofit in-person voting for the coronavirus, supplying hand sanitizer and other safeguards.\n  “My reaction was this is likely an attempt to get people not to vote,” said Kevin Porman, a 40-year-old living outside Indianapolis.\n  Laurie Chiambalero, a nurse in Philadelphia who has a Boston area code, said she answered the call out of a belief that it might be a friendly public health reminder.\n “But when I got it a second time,” she said, “it really felt like it was telling me to stay indoors the next few days because of the election.&#34;\n Chiambalero, however, said she’d already cast her ballot. “They’re not intimidating me,” she announced.\n What to know about voting: The United States has  already hit a record for the number of people who have already voted. If you are casting your ballot in person today,  find out the rules in your state.\n  What to know about the Presidential race:  Who actually votes, and who do they vote for? Explore how shifts in turnout and voting patterns for key demographic groups could affect the presidential race.\n What to know about the Senate:  Here are the Senate races to watch |  What to know about the House:  Here are the House races to watch.\n   Election results: Here’s what we know about  when to expect results, including in key swing states.\n  Show More", "posttime": "2020-11-04 09:13:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,美国,安全部,stay,电话", "title": "国土安全部和联邦调查局正在调查一起机器人电话和短信竞选活动，警告美国选民“安全待在家里”", "title_en": "DHS and the FBI are investigating a robocall and text campaign warning US voters to “stay safe and stay home”", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/11/03/robocall-election-day/", "via": "", "real_tags": ["机器人", "美国", "安全部", "stay", "电话"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我还是个孩子的时候，电脑很酷。现在？没那么多。我知道，我知道。脾气暴躁的老家伙一毛钱一打，他们对过去的看法往往被幸福的健忘和怀旧的金色阴霾所过滤。当然，对我来说也是如此，但我仍然认为这一点是有道理的：计算机过去比现在酷得多--比现在酷了几个数量级。或许可以用一个类比来解释这种情况：你有一辆生锈的1994年的菲亚特庞托(Fiat Pinto)，你迫切需要投资一辆新车。当然，你可以有远大的梦想--也许你想要一辆装甲运兵车，也许是一辆马力十足、拉皮条的特斯拉(Tesla)，配上所有的铃铛和口哨，或者为什么不想要一辆法拉利(Ferrari)呢？然而，现实地说，你可能正在考虑一辆全新的福特汽车：一款明智的家用汽车，仍将是你目前驾驶的那辆破旧汽车的升级版。而且，一旦你积累了足够的资金，那很可能就是你要买的东西。不过，那个APC..。伙计，开一辆这样的车该多甜蜜啊？只是在早上的交通中雷鸣般的通过，拳头在空中挥舞，对那个开着SUV的家伙大喊大叫，这个家伙总是在杂货店的十字路口超车，冲到你前面。现在可不是那么自鸣得意了，嗯，运动公用事业先生？这就是电脑过去的样子。别误会我的意思。如果你愿意，你可以花几乎无限的钱买一台电脑--它一直都是这样的，而且很可能在可预见的将来也是这样。对于用于科学的超级计算机集群和维持银行和股票市场运转的大型机来说，情况尤其如此。但是，当我们梦想着计算机的能力时，很少有人能想象有机会接触到这样的庞然大物。除非我们在业余时间涉足计算生物学，否则我们用机器做的事情只能快到一定程度。这就像用一艘航空母舰取代我们虚弱的菲亚特一样：当然，它是强大的，但它上下班不太实用。不，我们梦寐以求的办公桌上的电脑通常比我们实际买得起的要快一点，时尚一点，贵一点。如果你是一名专心玩游戏的人，总会有下一块显卡、额外的内存，以及你可以追逐的额外每秒几帧--但这仍然是现实的梦想，它是触手可及的；或许不太像一辆明智的福特，但也没有APC那么远。而且，即使你目前梦想拥有一台相当于APC的家用电脑(让我们假装自己是最好的Mac Pro，只是为了争辩)，买一台也不会对日常使用有太大影响。当然，这台机器可能会比你现在的机器更快，但除了极少数情况下你真正利用了所有的电力外，它不会提供与iMac相比完全不同的用户体验，成本只有iMac的一小部分。它是相同的操作系统、相同的应用程序和相同的基本架构。对于Windows和Linux计算机也是如此：您可以添加更多的RAM、磁盘和CPU核心，但是计算机的行为方式与您习惯的方式不会有明显的不同。现在，当我还是个孩子的时候。电脑很酷。1994年，我买了一台带120兆硬盘的二手Amiga1200。这是一台低成本、功能强大的家用电脑，声音和图形效果都很好。对于我这个年龄的孩子想做的游戏和学校作业来说，这已经绰绰有余了，但14 MHz的处理器在搬运重物时有点慢。对分辨率非常低的JPEG文件仅应用一丝高斯模糊需要花费很长时间。在涉足动画的过程中，我经常遇到它附带的2兆RAM的障碍。然而，它也有一个主板接口，可以增加更多的内存和更快的CPU。这就是合情合理的梦想：这是我触手可及的，这是明智的福特家族。因此，在1995年，我对它进行了CPU和RAM升级，使其速度提高了大约4倍。在那些日子里，这是一次相当大的升级：与今天机器时速10000英里和40000英里之间的差异相比，人类更容易注意到从每小时10英里到40英里的加速。但是加速并没有深刻地改变我的用户体验。我仍然在拖着同样的旧软件走来走去，我仍然在等待高斯模糊计算完成-尽管没有以前那么长的时间。当我坐在那里，看着高斯模糊进度条时，我当然梦见了一辆装甲运兵车的计算等价物。它不是Amiga4000，也不是奔腾PC，也不是那些新奇的PowerMac。这是完全不同的东西，完全改变了我从启动到关机的全方位用户体验。我.", "note_en": "When I was a kid, computers were cool.  Nowadays? Not so much.  I know, I know. Grumpy old gits are a dime a dozen, and their views about the past are often filtered through a golden haze of blissful forgetfulness and nostalgia. This is of course the case for me, too, but I still think the point is valid: computers used to be much cooler - by orders of magnitude - than they are now.  The situation can perhaps be explained by an analogy: You&#39;ve got a rusty old 1994 FIAT Punto and there is a rather pressing need for you to invest in a new vehicle. Of course, you can dream big - maybe you&#39;d like some kind of armoured personnel carrier, perhaps a souped-up, pimped-out Tesla with all the bells and whistles or why not a Ferrari? Realistically, though, you&#39;re probably considering something along the lines of a brand new Ford: the kind of sensible family car that would still be an upgrade to the withering piece of junk you&#39;re currently driving. And, as soon as you&#39;ve amassed enough funds, that&#39;s probably what you&#39;re going to buy. That APC, though... Man, how sweet would it be to drive one of those? Just thundering through morning traffic, fist pumping in the air, shouting crude insults at that guy with the SUV who always cuts in front of you at the intersection down by the grocery store. Not so smug now, eh, Mr. Sports Utility?  That&#39;s what it used to be like with computers.  Don&#39;t get me wrong. You can spend nearly infinite amounts of money on a computer if you&#39;d like to - it&#39;s always been like that and probably will be for the foreseeable future. This is especially true for supercomputer clusters used in science and the mainframes keeping the banks and stock markets ticking. But when dreaming about computer power, few of us imagine having access to a behemoth like that. The things we do with our machines can only go faster up to a certain point, unless we dabble in computational biology in our spare time. It would be like replacing our feeble FIAT with an aircraft carrier: sure, it&#39;s powerful, but it&#39;s not very practical for getting to and from work.  No, the computer we dream about having on our desk is usually something a little bit faster, a little bit sleeker and just a little bit more expensive than what we can actually afford. If you&#39;re a dedicated games player, there&#39;s always the next graphics card, that extra gig of RAM, those extra few frames per second you can chase - but that&#39;s still the realistic dreaming, it&#39;s something within reach; perhaps not quite in line with a sensible Ford, but not as far out there as an APC.  And, even if you are currently dreaming of the home computer equivalent of an APC (let&#39;s pretend that&#39;s a top of the line Mac Pro, just for the sake of argument), getting one won&#39;t make much of a difference in day to day use. Sure, the machine might be faster than your current one, but except for the rare few cases when you actually utilize all that power, it won&#39;t provide a profoundly different user experience compared to what an iMac will deliver at a fraction of the cost. It&#39;s the same OS, the same applications and the same basic architecture. This is true for Windows and Linux machines as well: you can add more RAM and disk and CPU cores, but the machine won&#39;t behave in a significantly different way from what you&#39;re used to.  Now, when I was a kid... computers were cool.  In 1994, I bought a second hand Amiga 1200 with a 120 megabyte hard drive. It was a low cost, capable home computer with good sound and graphics. It was more than enough for the kind of gaming and school work a kid my age wanted to do, but the 14 MHz processor was a tad slow when it came to heavy lifting. Applying just a hint of Gaussian blur to a very low resolution JPEG file took ages. Dabbling in animation, I frequently hit the barrier of the 2 megs of RAM it came with. However, it also had a motherboard connector for adding more memory and a faster CPU. This was the reasonable dream: it was within my reach, it was the sensible family Ford.  Thus, in 1995, I got a CPU and RAM upgrade for it, making it roughly four times faster. In those days, that was a pretty hefty upgrade: speeding up from 10 to 40 MPH is more noticeable to a human compared to the difference between the 10000 and 40000 MPH speeds of today&#39;s machines. But the speed-up didn&#39;t profoundly change my user experience. I was still shuffling about with the same old software and I was still waiting around for that Gaussian blur calculation to finish - although not quite as many minutes as before.  As I sat there, watching the Gaussian blur progress bar, I of course dreamt of the computing equivalent of an Armoured Personnel Carrier. It wasn&#39;t an Amiga 4000 or a Pentium PC or one of those new-fangled PowerMacs. It was something completely different, something that would have utterly changed my all-round user experience, from boot-up to shutdown. I wanted something the likes of which actually no longer exists: I dreamt of a Unix Workstation.  Not just any old Unix box mind you, but a rather specific one: a Silicon Graphics Indy with a 24-bit frame buffer, 128 megabytes of memory and a 175 MHz MIPS R4400 CPU.  It was, hands down, just about the most maxed-out piece of hardware that could grace the top of a desk. Design-wise, computers have always been kind of beige - literally and figuratively. Black computers became commonplace some time around, say, 2000, but that was hardly a giant leap in design. Depending on your tastes, you might think companies like Apple or Alienware produce attractive machines - but then again, perhaps you&#39;ve never seen an SGI Indy.  The teal blue pizza box case sports a horizontal, slightly diagonally skewed cut along the middle, shifting the top and bottom parts in a slight offset. The monitor was huge for its time: a 17&#34; CRT cased in grey granite plastic, matching the mouse and keyboard. Both the computer and the screen were adorned with embossed SGI cube logos in a gleaming silver finish. It was over the top, maximalist 1990s more-is-more design in a strangely tasteful package and a far cry from the sleek, subdued designer machines of today. Yet, it wasn&#39;t an overstatement - it might&#39;ve talked the talk, but it sure as hell could walk the walk.  For example, it didn&#39;t even have a regular floppy drive - it had a bizarre floptical unit capable of storing 20 megabytes on a single, magneto-optical disk. On top of the giant screen a webcam was poised, surely one of the absolutely first computers to come with such a device as standard. In fact, it was called an IndyCam - the term webcam hadn&#39;t really caught on yet and was more commonly used to describe just about any camera that regularly uploaded a still image to a public web server.  And that, of course, are all trivial oddities compared to the guts of the machine. Even though it was an entry-level workstation, SGI&#39;s custom hardware was capable of churning out both 2D and 3D graphics unmatched by any contemporaneous gaming PC, however expensive, and the CPU could run in circles around even the most outrageously-priced Pentium home computer available at the time.  And then there was the operating system. And the software.  IRIX, SGI&#39;s in-house Unix flavour, came with their own proprietary GUI and desktop. It was called Indigo Magic and, featuring things like scalable vector icons, animated desktop backgrounds and visual feedback cues, it was just about as outlandish as the name suggests. It should be noted that this was ten years before any PC owner had gotten the chance to grow tired of such pointless flash and that for the serious hacker, there was always a terminal emulator with a capable shell on hand.  Apart from all the usual Unix-related niceties such as stability, pre-emptive multitasking, multi-user support, excellent command line utilities and a bunch of readily available programming languages, it had an impressive array of professional productivity software. Most of it was not available on my home computer, and even if it was, the Indy could run it both faster and in higher resolution. Apart from industry standards such as Photoshop and Netscape, there was a world of curious and wonderful applications written with nothing but SGI hardware in mind: web authoring, video editing, image manipulation and graphics creation unavailable on any other platform. It was a true digital media production workhorse, an overgrown distant cousin to the machines available on the then budding multimedia PC market.  In short, it was a cool computer. Far too expensive for any home user, of course. But so. Damn. Cool.  There are computers aimed at this kind of work today as well. One of the high-end Macs mentioned before, for example, or perhaps a suitably high-powered Windows machine. In fact, pretty much any dirt cheap home computer will, pixel for pixel, do what the Indy did - except faster, cheaper and in many cases better.  Yet there isn&#39;t, today, an equivalent of the SGI Indy, or the Sun SPARCstation, or the DEC Alpha, or any of the other professional workstations. The only thing that&#39;s on offer is more of the same user experience, only slightly faster.  That&#39;s why computers are so boring these days. Because even though IRIX, Indigo Magic and the Indy by no means was a perfect solution to all of my computational desires back then, it had the lure of the unknown and unattainable: it was a goal to strive for, a source of inspiration and aspiration and a promise that better things were possible.  Today, we all know about the different quirks, mannerisms, privacy issues, drawbacks and occasional benefits of Windows update loops, overpriced Mac hardware and the tiresome fiddliness of Linux. Those are the choices we have and they&#39;re not going to change any time soon.  I&#39;d somehow be more okay with all of this if it wasn&#39;t for the fact that, to top it all off, we have no other platform left to dream of.  That&#39;s just not cool.", "posttime": "2020-11-04 09:10:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,computers", "title": "当计算机很酷的时候", "title_en": "When Computers Were Cool", "transed": 1, "url": "https://datagubbe.se/coolcomp.html", "via": "", "real_tags": ["计算机", "computers"]}, {"category": "", "categoryclass": "", "imagename": "a48a393f40351109a4f585becd3c1727.jpg", "infoid": 1033091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CoinDesk研究主管诺埃尔·艾奇森(Noelle Acheson)表示，欧洲央行行长克里斯蒂娜·拉加德(Christine Lagarde)周日宣布了一项欧洲央行关于发行数字欧元的民意调查，这意味着央行正在考虑一种零售的央行数字货币(CBDC)，而不仅仅是一种打算在银行之间使用的数字货币，这将代表着金融运作方式的更深刻变化。\n随着欧洲人越来越多地在消费、储蓄和投资方式上转向数字化，我们应该准备好在必要时发行数字欧元。我也很想听听你对此的看法，拉加德在宣布这项调查的推文中说。\n在表示欧洲央行仍在评估发行数字欧元的可能性的同时，这位央行行长在她的推文中嵌入的视频中表示：我们刚刚启动了一次公众咨询，以便消费者和欧洲人能够真正表达他们的偏好，告诉我们他们是否愿意像使用欧元硬币或欧元纸币那样使用数字欧元，因为他们知道数字欧元是央行提供的资金，他们可以依赖。\n据CoinDesk的艾奇逊(Acheson)报道，拉加德的言论呼应了国际清算银行(BIS)创新中心负责人、该行执行委员会成员伯努瓦·库埃尔(Benoit Couere)最近在一篇关于CoinDesk的评论文章中所说的话。\nAcheson表示，这种观点的汇聚突显了这些关于零售CBDC可能性的对话发生在最高层。\n注册后，您将收到有关CoinDesk产品的电子邮件，并且您同意我们的条款、条件和隐私政策。\nCoinDesk是区块链新闻的领先者，是一家努力追求最高新闻标准并遵守一套严格的编辑政策的媒体渠道。CoinDesk是数字货币集团(Digital Currency Group)的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "European Central Bank President Christine Lagarde Sunday announced an ECB  survey of public opinion regarding the issuance of a digital euro, implying the central bank is considering a retail central bank digital currency (CBDC), not just one intended for use between banks, which would represent a much more profound change in the way finance works, according to Noelle Acheson, CoinDesk’s director of research.\n &#34;As Europeans are increasingly turning to digital in the ways they spend, save and invest, we should be prepared to issue a digital euro, if needed. I’m also keen to hear your views on it,&#34; Lagarde said in a  tweet announcing the survey.\n While saying the ECB is still reviewing the possibility of issuing a digital euro, the central bank president said in the video embedded in her tweet, &#34;We&#39;ve just launched a public consultation so that consumers and Europeans can actually express their preference and tell us whether they would be happy to use a digital euro just in the way they use a euro coin or a euro banknote knowing that it is central bank money that is available and that they can rely upon.&#34;\n Lagarde&#39;s comments echo what Benoit Couere, head of the Innovation Hub at the Bank for International Settlements and a member of the bank&#39;s Executive Committee, said in a recent  opinion piece on CoinDesk, according to CoinDesk&#39;s Acheson.\n Such a confluence of opinions underlines these conversations about the likelihood of a retail CBDC are happening at the highest level, Acheson said.\n  By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n   Disclosure The leader in blockchain news, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2020-11-04 08:50:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "欧洲央行,central,coindesk", "title": "欧洲央行总裁拉加德称欧洲央行目前正就潜在的数字欧元征求公众意见", "title_en": "European Central Bank President Christine Lagarde says the ECB is now seeking public comments on a potential digital euro", "transed": 1, "url": "https://www.coindesk.com/ecb-begins-public-survey-about-a-digital-euro-implying-a-broad-retail-offering-is-now-on-the-table", "via": "", "real_tags": ["欧洲央行", "central", "coindesk"]}, {"category": "", "categoryclass": "", "imagename": "298d7cc512419f9fe32872ad0d9b1a39.jpg", "infoid": 1033090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，我们和LGR&39；的克林特·贝辛格(Clint Basinger)一起做了一段视频，勾选了一份遗愿清单上的项目，然后我们只有一个地方可以去：太空。没有一位创造者像工程师和物理学大师斯科特·曼利那样，将太空科学、游戏和纯粹的疯狂融为一体。\n曼利的视频通常是聪明和魅力的混合体，以缓慢、平静的盖尔语节奏呈现。曼利的视频涵盖了从空间技术讲解员到游戏评论到物理思维实验，以及介于两者之间的所有要点。他最出名的可能是在“科巴尔太空计划”(Kerbal Space Program)中做了一些荒唐的事情(我对此略知一二！)。如果你是一位已经关注过斯科特的Ars读者，那么你很有可能是通过一段KSP视频被介绍到他的频道的。\n正如我们现在对几个不同的YouTuber所做的那样，我们在斯科特的日程表上预约了一些时间，然后带他沿着自己的记忆之路旅行，从他的一些优秀视频中提取了值得注意的、备受好评的评论，看看斯科特是否能告诉我们每条评论来自哪些视频。对于一个工科学生来说，斯科特的记忆力仍然很好，这或许并不令人惊讶-我们从他那里学到了相当多的东西，不仅是物理知识，还包括有时表现最好的视频可能是你甚至没有计划拍摄的视频。", "note_en": "After checking off a bucket list item by doing a video with  LGR&#39;s Clint Basinger last month, there was only one place we could go next:  to space. And no creator occupies the intersection of space science, gaming, and sheer lunacy quite like engineer and physics master  Scott Manley.\n Manley&#39;s videos are most often a mix of smarts and charm, delivered in a slow, calming Gaelic cadence. Manley&#39;s videos run the gamut from  space tech explainers to  game reviews to  physics thought experiments, and all points in between. He&#39;s perhaps best known for doing ridiculous things in   Kerbal Space Program (something I know  a little bit about!). It&#39;s pretty good odds that if you&#39;re an Ars reader who already follows Scott, you were introduced to his channel by a  KSP video.\n As we&#39;ve done now with a few different YouTubers, we booked some time on Scott&#39;s calendar and then took him on a trip down his own memory lane, pulling up notable and much-upvoted comments from some of his standout videos to see if Scott could tell us a bit about the videos each comment came from. Perhaps unsurprisingly for a student of engineering, Scott&#39;s recall remained excellent—and we learned quite a bit from him not just about physics but also about how sometimes the best-performing videos can be the ones you didn&#39;t even plan on shooting.", "posttime": "2020-11-04 08:34:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,曼利,scott,斯科特", "title": "斯科特·曼利(Scott Manley)讨论他在YouTube上发表的1000条评论", "title_en": "Blast off with Scott Manley as he discusses his top 1,000 YouTube comments", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/scott-manley-explores-the-far-reaches-of-space-and-his-top-1000-youtube-comments/", "via": "", "real_tags": ["youtube", "曼利", "scott", "斯科特"]}]