[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1010687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们建议您订阅，以便在发布后立即在您的收件箱中接收下一版本！向任何可能感兴趣的人推广这份时事通讯。\n我们开始在XSF Github存储库中起草每一个新问题。我们总是很高兴地欢迎贡献者。请不要犹豫，加入我们的通信团队群聊(MUC)中的讨论，从而帮助我们将此作为社区工作来持续下去。\n你有一个项目，并把它写下来了吗？请考虑在这里分享您的新闻或事件，并将其推广给广大观众！即使你只会花几分钟，这些都已经很有帮助了！需要定期完成的任务有：-XMPP领域的新闻聚合-新闻和事件的简短表述-每月扩展通信摘要(XEP)-时事通讯草稿审查-翻译：特别是德语和西班牙语。\nJC Brand创建了XMPP求职板！它使人们能够查看工作机会，并为XMPP服务做广告。请看一看，贴出你自己的报价并推荐。XMPP起作用了！\nIngo Jürgensmann写了一篇关于Jabber和XMPP术语的背景以及它们的异同的文章。\n：De：XMPP Client Dino是获得第10届托马斯·克伦奖的三个项目中的一个。\nMichałPiotrowski写了一篇关于如何快速启动应用程序的即时消息实现的文章。他讨论了聊天功能在应用程序中的价值、可伸缩性、定制化和常见错误：选择你的XEP，然后明智地选择。\n：fr：Linuxfr.org用户Space_e_man提出了他对Quicksy的简短概述，Quicksy是一个基于简单XMPP的libre即时消息平台。虽然这篇文章本身集中在为什么它应该比其他专有解决方案更受欢迎的原因，但linuxfr.org用户的评论一如既往地带来了许多不同的观点，以及替代方案。\n：Conociendo XMPP-the Comunota Latina de Tecnologías Libres&#39；早在2020年4月，就有一个面向用户的XMPP在线介绍。虽然有点晚了，我们还是想给你指给你看这段视频。它们还为用户提供可通过此(简短且方便的)地址comunidadlatinadetecnologiaslibres@chat.disroot.org.访问的聊天。\nDaniel Gultsch和Holger Weiss在对话中就他们的A/V实现进行了一次虚拟谈话，他们描述了技术细节。会议结束时，埃塔进行了第二次演讲，他用这样的公式定义了爱情：Asterisk+XMPP=&lt；3。\n：de：P.Löbbecke教授在一个关于Freie Messenger-Sinhere Komomikation(免费信使-安全通信)的虚拟演讲中发言，其中还包括XMPP(德语)。\nGajim 1.2.0已经发布。在Gajim 1.1.3发布一年多之后，终于到了Gajim 1.2的时候了。用于开发新功能、清理旧代码和修复错误的一年。此版本的亮点包括：改进的群聊系统、完全重写的网络代码和新的帐户创建助手。而且还有更多的东西有待发现。Gajim开发新闻：六月已经带来了Gajim1.2、python-nbxmpp1.0和许多插件更新。但还有更多功能：OMEMO验证前的盲目信任、拖放改进，以及针对Gajim的新翻译服务。\nMonal的主要开发者ANU为iOS和Mac推出了新的测试版--多亏了Thilo和Friedrich的努力，新的调试功能也加入了进来。他要求在可能的情况下提供现有问题的调试日志。\n亵渎发布了它的版本0.9.0，它支持最后的消息更正(XEP-0308)，并修复了在他们的博客帖子中发现的各种问题。在新的主要版本之后，bugfix版本0.9.1、0.9.2、0.9.3和0.9.4紧随其后。\nJSXC发布了版本4.1.1，该版本修复了几个与视频相关的问题，并增强了对话的互操作性。此外，还发布了第一个适用于所有平台的试验性桌面版本。该项目正在寻找早期测试人员和有经验的人在电子和特拉维斯构建链。\nPIX-Art Messenger在6月30日取消了对OTR的支持。关于这一点的一般说明可以在Github上阅读。\n最后但并非最不重要的一点是--你能相信吗？Pidgin 2.14.0😯每周四也有实时开发Twitch流。\nIGNITE实时社区发布了Openfire Beta 4.6.0，实现了XEP-0289，针对受限环境的联合MUC，并改进了对PEP/PubSub的支持。如果你有时间测试，请加入他们的行列！\nGajim的XMPP库已发布了1.0版。在过去，作为xmppy库的友好分支，从那时起，许多事情都发生了变化。它投入了大量的工作，特别是在过去的一年里。如果您感兴趣，可以提供一个简单的客户端示例。\n自5月初以来，世界各地的学生都在2020年的Google夏季代码季中从事许多开源项目。我们想介绍参与GSOC XMPP项目的学生，并分享他们的博客帖子：\n感谢您加入GSOC XMPP项目，继续努力！未完待续。\n修正对RFC 6415的引用，更清晰地组织需求。这将JSON要求从5月(可选)提高到应该(有效)，以适应基于Web的软件。(FS)。\n删除在单个跨度和块上禁用样式的机制的描述，用户可以自己执行此操作，而无需我们记录不是专门用于此目的的代码点的使用。(SSW)。\n添加禁用样式的功能，进一步阐明可访问性注意事项，并在安全注意事项部分提到样式不是Markdown。(SSW)\n感谢emus，mdosch，nyco，pep.，pmaziere，sualko，vanitasvitae，wurstsalat3000帮助创建它！", "note_en": "We suggest you to  subscribe to receive the next editions in your inbox as soon as it is published! Promote this newsletter to whoever may be interested.\n  We started drafting every new issue in the  XSF Github repository. We are always happy to welcome contributors. Do not hesitate to join the discussion in our  Comm-Team group chat (MUC) and thereby help us sustain this as a community effort.\n You have a project and write about it? Please consider sharing your news or events here, and promote it to a large audience! Even if you can only spend a few minutes, these would already be helpful!Tasks which need to be done on a regular basis are for example:- Aggregation of news in the XMPP universe- Short formulation of news and events- Summary of the monthly communication on extensions (XEP)- Review of the newsletter draft- Translations: especially German and Spanish\n     JC Brand created an  XMPP job board! It enables people to review job offers as well as advertise XMPP services. Please take a look, post your own offers and recommend it. XMPP works!\n  Ingo Jürgensmann wrote an article on the backround of the &#39;Jabber&#39; and &#39;XMPP&#39; terminology and their  differences and similarities.\n :de: The XMPP client Dino is one out of three projects which were awarded with the  10th Thomas Krenn Award.\n Michał Piotrowski wrote an article on  how to quick start Instant Messaging implementation to an app. He discusses the value of a chat feature in an app, scalability, customising and common mistakes: &#39;Choose your XEP, and choose wisely.&#39;\n :fr: Linuxfr.org user Space_e_man proposed his short overview of  Quicksy the easy XMPP based libre instant messaging platform. While the article itself concentrates on the reasons why it should be prefered to other proprietary solutions, the comments of linuxfr.org users, as usual, bring a lot of various points of view, as well as alternatives.\n  :es: Conociendo XMPP - The &#39;Comunidad Latina de Tecnologías Libres&#39; had an online introduction to XMPP for users back in April 2020. We would like to  point you to the video, even if it is a bit late. They also offer a user chat reachable under this (short and handy) address comunidadlatinadetecnologiaslibres@chat.disroot.org.\n Daniel Gultsch and Holger Weiss had a  virtual talk on their A/V implementation in Conversation and they described the technical details. The session was finalized with a second talk by eta who defined love by this formula: Asterisk + XMPP = &lt;3\n :de: Prof. Dr. P. Löbbecke spoke in a virtual talk about &#34; Freie Messenger - Sichere Kommunikation&#34; (&#39;Free Messengers - Secure Communication&#39;) which also included XMPP (German).\n   Gajim 1.2.0 has been released. More than a year after the release of Gajim 1.1.3, it is finally time for Gajim 1.2. A year put at use to develop new features, clean up old code, and fix bugs. Highlights of this release are (amongst others): improved group chat system, completely rewritten network code, and a new account creation assistant. And there is much more to discover. Gajim Development News: June already brought Gajim 1.2, python-nbxmpp 1.0, and many plugin updates. But there is more: Blind Trust Before Verification for OMEMO, drag and drop improvements, and a new translation service for Gajim.\n Anu, the main developer of Monal, pushed  new beta builds out for iOS and Mac - thanks to Thilo&#39;s and Friedrich&#39;s efforts, there are new debug features included. He asks to supply debug logs for existing issues, where possible.\n Profanity released its version 0.9.0 which supports Last Message Correction (XEP-0308) and fixes various issues that can be found in their  blog post. After the new major release, bugfix releases  0.9.1,  0.9.2,  0.9.3 and  0.9.4 followed.\n  JSXC released  version 4.1.1 which fixes several video related issues and enhances interoperability with Conversations. Additionally, a  first experimental desktop build for all platforms was released. The project is looking for early testers and people with experience in Electron and the Travis build chain.\n  Pix-Art Messenger removed their  OTR support by the 30th of June. The general note on this can be  read on Github.\n And last but not least - can you believe this?  Pidgin 2.14.0 😯 There is also a live development  Twitch stream every Thursday.\n  The ignite realtime community released  Openfire Beta 4.6.0, implementing XEP-0289, Federated MUC for Constrained Environments and improved PEP/PubSub support. If you have time to test please join them to help out!\n  Gajim’s XMPP library &#39; python-nbxmpp&#39; had its 1.0 release. Being a friendly fork of the xmppy library back in the days, many things changed since then. A lot of work went into it, especially during the past year. If you’re interested, there is a simple example client included.\n    Since the beginning of May students all over the world are working on many open-source projects within the Google Summer of Code Season 2020. We would like to introduce the students who work on  GSoC XMPP projects and share their blog posts:\n    Thank you for joining GSoC XMPP projects and keep up the good work! To be continued.\n   Fix reference to RFC 6415 and organize requirements more clearly. This raises the JSON requirement from MAY (OPTIONAL) to SHOULD (effectively), to accustom web-based software. (fs)\n             Remove description of mechanism for disabling styling on individual spans and blocks, users can do this themselves without us documenting the use of a codepoint that&#39;s not specifically for this purpose. (ssw)\n  Add ability to disable styling, further clarify accessibility considerations, and mention that Styling is not Markdown in the security considerations section. (ssw)\n   Thanks to emus, mdosch, nyco, pep., pmaziere, sualko, vanitasvitae, wurstsalat3000 for their help in creating it!", "posttime": "2020-07-09 09:29:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,xmpp,works", "title": "XMPP工程-2020年7月1日", "title_en": "XMPP works – 1 July 2020", "transed": 1, "url": "https://xmpp.org/2020/07/newsletter-01-july/", "via": "", "real_tags": ["2020", "xmpp", "works"]}, {"category": "", "categoryclass": "", "imagename": "23dc26e49612229f8922396e672b64f3.jpg", "infoid": 1010686, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们使用围棋编程语言制作了一个中间件。Golang标准库提供了一个http包，我们可以使用它为我们的简单网站提供服务并添加…", "note_en": "We make a middleware using the go programming language. Golang standard library provides an http package that we can use to serve our simple website and add ...", "posttime": "2020-07-09 09:19:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制作,middleware,提供", "title": "在围棋中制作中间件", "title_en": "Make a Middleware in Go", "transed": 1, "url": "https://www.youtube.com/watch?v=tb07GmNPuP0", "via": "", "real_tags": ["制作", "提供"]}, {"category": "", "categoryclass": "", "imagename": "c0215e1cb51b2ba17a894c5ef57a5052.jpg", "infoid": 1010685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "腐败邪恶的超级英雄和一群乌合之众义务警员之间的战争将会戏剧性地升级，以揭露他们的真实本质，并遏制超级英雄在社会上的势力，这一点可以从S2 of the Boys的第一个预告片判断出来。亚马逊Prime电视剧是去年在流媒体平台上首播时收视率最高的电视剧之一，是根据加思·恩尼斯(Garth Ennis)和达里克·罗伯逊(Darick Robertson)的同名漫画改编的。\n“少年时代”的背景设定在一个虚构的世界里，超级英雄是真实存在的，但却被企业利益和沉迷于名人的有毒文化所腐蚀。比利·布彻(卡尔·厄本饰)是一个自封的义务警员，致力于遏制所谓超级英雄的不良行为-特别是七人组，他们是最精英的超级英雄小队，因此也是最腐败的。屠夫特别讨厌七号头目霍梅兰德(安东尼·斯塔尔饰)，他是个精神病患者，强奸了他现已死亡的妻子。屠夫招募了一个同样受到创伤的年轻人，名叫休·休伊·坎贝尔(杰克·奎德饰，丹尼斯的儿子)来帮助他复仇，此前另一名七名成员A-Train(杰西·T·亚瑟饰)利用他的超高速撞死了休伊的女朋友。\n与此同时，一位有能力的理想主义年轻女子星光(艾琳·莫里亚蒂饰)刚刚加入了七人组，但她梦寐以求的职位的严酷现实与她的梦想不符。除了《Homelander》和《A-Train》之外，她的新超级伙伴还包括能够在水下呼吸并与那里的生物对话的深海人(Chace Crawford饰)；精疲力竭、对超级英雄生活不再抱有幻想的梅芙女王(Dominique McElligott饰)；拥有超人力量且很少说话的黑色黑色(Nathan Mitchell饰)；以及半透明人(Alex Hassell饰)，他通过将皮肤变成扭曲的碳超材料而变得隐形。他并不是高高在上，利用这种能力纵容他反常的偷窥狂倾向。\n在第一季中，布彻和胡吉与马文(又名母亲的牛奶(拉兹·阿隆索饰)、法国人(托默·卡彭饰)和木美子(又名女性凯伦·福原饰)联手合作。由于注射了一种名为化合物-V的提高成绩的物质，她的力量和愈合能力都有所增强。男孩们追踪大院的来源，追溯到沃特国际公司，这是七人组背后的母公司，该公司一直在用它来创造更多的超级英雄。但其他人已经拿到了化合物V，并用它来制造超能力的恐怖分子。\nS1的大结局以一个扣人心弦的故事结束：屠夫，一心想引爆自己并带走霍曼兰德，当这位精神错乱的超级英雄告诉他，他发现布彻的前妻贝卡还活着时，他改变了主意--并抚养了她的儿子，这是她被霍曼兰德强奸的结果。\n在去年的评论中，我把“少年时代”称为“S1：少年时代”，这是一部滑稽可笑、阴暗无礼的改编版，对于那些已经厌倦了超级英雄电影的持续冲击的人来说，这是夏末治疗的理想选择。从第一个预告片来看，“第二个男孩”承诺将和第一部一样血腥、精彩和彻底疯狂。“少年时代2”是一部改编自“少年时代”的电影，改编自“少年时代”，是一部非常搞笑、非常不敬的电影。对于那些已经厌倦了超级英雄电影的持续攻势的人来说，这是理想的夏末疗法。根据官方前提：\n屠夫、休吉和球队从第一季的失利中摇摇欲坠。在逃避法律的过程中，他们努力反击超级英雄。作为管理英雄的沃特公司，利用对超级恶棍威胁的恐慌，以及一个新的英雄Stormfront，撼动了公司，挑战了本已不稳定的Homelander。\n预告片中没有太多额外的细节，当我们的(反)英雄们看着一则州际追捕屠夫和他的已知同伙的电视公告开始时，当然，这是一场由Homelander带头的咄咄逼人的媒体宣传活动。我们现在出名了！&#34；法国人宣称。屠夫似乎在逃亡，但不久他就会重新加入“男孩队”。七人组仍然在公开露面，因为这个世界仍然需要超级英雄--而公众大多不知道这些特殊的英雄到底是什么混蛋。“。\n我们第一次看到了风暴前线，一个新的七人组女性成员，最有可能取代已故的半透明的。Homelander仍然在幕后欺凌其他七人，他的精神变态倾向开始渗入公共领域。当人群中一个随机的男人把他推倒时，他会用他的激光眼神把犯规者打得无影无踪。他向一位可怕的父亲证明了这一点：他和布彻的前妻生下了年幼的儿子：我们看到他和男孩在房顶上微笑，然后把孩子推下，让他摔倒(大概是Homelander试图教这个小家伙飞吧)。(据推测，Homelander正在试图教这个小家伙飞行)，我们看到他和男孩在屋顶上微笑，然后把孩子推下来，让他摔倒(大概是Homelander试图教小家伙飞行)。", "note_en": "The war between corrupt, evil superheroes and a ragtag band of vigilantes out to expose their true nature and curb the power of &#34;super&#34; in society will escalate dramatically, judging by the first teaser for S2 of   The Boys. The Amazon Prime series—one of the most-watched on the streaming platform when it debuted last year—is based on the comics of the same name by Garth Ennis and Darick Robertson.\n  The Boys is set in a fictional universe where superheroes are real but corrupted by corporate interests and a toxic celebrity-obsessed culture. Billy Butcher (Karl Urban) is a self-appointed vigilante intent on checking the bad behavior of the so-called &#34;supes&#34;—especially The Seven, the most elite superhero squad and, hence, the most corrupt. Butcher especially hates Seven leader Homelander (Antony Starr), a psychopath who raped his now-dead wife. Butcher recruits an equally traumatized young man named Hugh &#34;Hughie&#34; Campbell (Jack Quaid, son of Dennis) to help in his revenge, after another Seven member, A-Train (Jessie T. Usher) used his super-speed to literally run through Hughie&#39;s girlfriend, killing her instantly.\n At the same time, an idealistic young woman with powers, Starlight (Erin Moriarty), has just joined the ranks of The Seven, but the harsh reality of her coveted position doesn&#39;t match up to her dreams. In addition to Homelander and A-Train, her new super-cohorts include The Deep (Chace Crawford) who can breathe underwater and converse with the creatures there; Queen Maeve (Dominique McElligott), who is burnt out and disillusioned with the superhero life; Black Noir (Nathan Mitchell), who has superhuman strength and rarely speaks; and Translucent (Alex Hassell), who turns invisible by changing his skin into a carbon meta-material that warps light around him. He&#39;s not above taking advantage of that ability to indulge his perverse voyeuristic tendencies.\n In the first season, Butcher and Hughie join forces with Marvin, aka Mother&#39;s Milk (Laz Alonso), Frenchie (Tomer Capon), and Kimiko, aka The Female (Karen Fukuhara). She has enhanced strength and healing abilities thanks to being injected with a performance-enhancing substance called Compound-V. The Boys track the source of the compound back to Vought International, the parent corporation behind the Seven, which has been using it to create more superheroes. But someone else has gotten their hands on Compound-V and is using it to create superpowered terrorists.\n    The S1 finale ended with a major cliffhanger: Butcher, intent on blowing himself up and taking Homelander with him, changes his mind when the psychotic superhero tells him he has discovered that Butcher&#39;s ex-wife, Becca, is still alive—and raising her son, the result of her rape by Homelander.\n In my review last year,  I called S1 of  The Boys &#34;a wickedly funny, darkly irreverent adaptation&#34; and &#34;ideal late-summer therapy for anyone who has grown a bit weary of the constant onslaught of superhero movies.&#34; Judging by the first teaser, S2 promises to be just as bloody, brilliant, and downright bonkers as the first. Per the official premise:\n Butcher, Hughie and the team reel from their losses in Season 1. On the run from the law, they struggle to fight back against the Superheroes. As Vought, the company that manages the heroes, cashes in on the panic over the threat of Supervillains, and a new hero, Stormfront, shakes up the company and challenges an already unstable Homelander.\n There aren&#39;t many additional details in the teaser, which opens as our (anti)heroes watch a TV announcement of an interstate manhunt for Butcher and his &#34;known associates,&#34; which is an aggressive media campaign spearheaded by Homelander, of course. &#34;We are famous now!&#34; Frenchie declares. Butcher appears to be on the run, but it isn&#39;t long before he rejoins The Boys. The Seven are still making public appearances because &#34;the world still needs superheroes&#34;—and the public mostly doesn&#39;t know what jerks these particular &#34;heroes&#34; really are.\n We get our first glimpse of Stormfront, a new female member of The Seven, most likely to replace the late Translucent. Homelander is still bullying the rest of The Seven behind the scenes, and his psychopathic tendencies are starting to bleed into the public sphere. When a random man in the crowd flips him off, he zaps the offender into oblivion with his laser eyes. And he proves to a terrible father to the young son he sired with Butcher&#39;s ex-wife: we see him smiling with the boy on the roof of a house before pushing the kid off and letting him fall (presumably Homelander is trying to teach the little dude to fly).", "posttime": "2020-07-09 09:00:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "男孩,boys,英雄", "title": "男孩S2的第一个预告片承诺又一次狂野和血腥的骑行", "title_en": "First teaser for The Boys S2 promises another wild and bloody ride", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/first-teaser-for-the-boys-s2-promises-another-wild-and-bloody-ride/", "via": "", "real_tags": ["男孩", "boys", "英雄"]}, {"category": "", "categoryclass": "", "imagename": "cd8111150b59c6e69dc63e63b20c37f3.jpg", "infoid": 1010684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近发布的一份报告称，在德国著名的弗劳恩霍夫研究所(Fraunhofer Institute)的一项大规模研究中，几乎所有家用Wi-Fi路由器都存在严重的安全漏洞，路由器制造商很容易修复这些漏洞。\n弗劳恩霍夫研究所在一份新闻稿中说，几乎所有人都被发现存在安全漏洞，其中一些非常严重。问题范围从丢失安全更新到容易解密的硬编码密码，以及早就应该打补丁的已知漏洞。\n该研究所使用自己的分析软件，测试了目前在欧洲销售的117款家用Wi-Fi机型的最新可用固件，这些机型包括来自华硕、D-Link、Linksys、Netkit、TP-Link、Zyxel和德国小型品牌AVM的路由器，但这些机型本身并未经过物理测试。\n有关经过测试的型号和固件的完整列表，请访问GitHub。该研究所未能检查另外10款机型的固件，其中大部分来自Linksys。报告指出，许多固件更新都是在没有修复已知缺陷的情况下发布的。\n由于这项研究始于3月下旬，并检查了3月27日可用的固件，因此不会包括Netkit在6月下旬发布的数十个固件热修复程序，以纠正一系列缺陷。\n与此同时，华为路由器没有受到检查，因为该公司没有公开提供其路由器固件，也没有检查ISP发布的路由器和网关，因为ISP将固件开发外包给了许多第三方。\n这并不是这类调查的第一次。2018年12月，另一项关于路由器安全的研究发布了类似的可怕报告，但在随后的18个月中几乎没有看到任何改善。\n那么您能做些什么呢？您可以确保您购买的下一台路由器自动安装固件更新。您可以检查您当前的路由器是否这样做，或者使手动安装固件更新变得相当容易。\n您还应确保路由器的管理密码已从出厂默认密码更改。(请查看https://www.routerpasswords.com.)上的默认密码列表。您还应该检查其管理界面，以确保禁用了UPnP和远程访问。\n如果您的路由器是5年前首次发布的，请考虑购买较新的型号，除非它满足上述所有标准。(以下是我们选出的最佳Wi-Fi路由器。)。\n或者，您也可以尝试使用闪存来运行更安全的开源路由器固件，如OpenWRT、DD-WRT或Tomato。\n到目前为止，AVM在接受检查的七家制造商中是最好的，尽管它并不是没有缺陷。华硕和Netkit表现不佳，但不如D-Link、Linksys、TP-Link和Zyxel糟糕。\n这些缺陷包括过时的固件(D-Link DSL-321B Z自2014年以来就没有更新过)；过时的Linux内核(Linksys WRT54GL使用2002年的内核)；未能实施通用安全技术(AVM在这里比其他技术做得更好)；固件中嵌入的私钥，因此任何人都可以找到它们(Netkit R6800有13个)；以及允许完全接管设备的硬编码管理用户名和密码(只有华硕没有)。\n弗劳恩霍夫的报告总结道，没有一台路由器是没有缺陷的，也没有一家供应商在所有安全方面都做得尽善尽美。要使家用路由器与当前的台式机或服务器系统一样安全，需要付出更多的努力。\n有几个路由器在研究中被点名，你绝对不应该使用，即使看起来你仍然可以买到它们。\n报告称，关于高度严重的CVE[广为人知的缺陷]，最糟糕的情况是Linksys WRT54GL采用了我们研究中发现的最古老的内核，并指出该型号使用了2002年的2.4.20内核。&#34；有579个严重程度较高的CVE影响此产品。&#34；\n该特定型号的固件上一次更新是在2016年1月，这是研究中最古老的固件之一。Linksys WRT54GL于2005年首次发布，尽管它只处理高达802.11g的Wi-Fi协议，但至今仍在销售。\n然而，WRT54G系列可能是有史以来最畅销的Wi-Fi路由器系列。WRT54GL的持续吸引力可能是因为它的可靠性声誉，以及它很容易闪现就能运行开源固件的事实--OpenWRT固件最初是为了在这一系列路由器上运行而开发的。(工业和信息化部电子科学技术情报研究所陈冯富珍译为“WRT54GL&#39；WRT54GL##”)。\n这并不是说其他型号在运行最新的Linux内核方面做得更好。(研究中90%以上的路由器运行Linux。)。到目前为止，Linux内核最常见的版本是2010年发布的2.6.36。只有AVM没有运行任何2.x内核，其最早版本是2013年的3.10.10。\n然而，报告指出，超过一半的AVM设备运行的内核版本已不再维护。\nLinux一直在其内核中构建新的安全功能，在Linux设备上更新内核并不是那么困难。Linux PC和服务器发行版的制造商一直都在这么做。\n虽然在Fraunhofer测试时(2020年3月27日)最新的Linux内核是5.4版，但没有一台测试的路由器使用的是2016年4.4.60以后的版本。(AVM和Netkit使用了那个。)。\n研究员约翰尼斯·沃姆·多普(Johannes Vom Dorp)在弗劳恩霍夫的新闻稿中表示，Linux一直在努力填补其操作系统中的安全漏洞，并开发新的功能。制造商所要做的就是安装最新的软件，但是他们没有把它集成到他们能够而且应该集成的程度。\n另一款禁忌机型是Netkit R6800，如上所述，它的固件中嵌入了多达13个硬编码的私人安全密钥。\n它的最后一次固件更新是在2019年8月，在新的固件可用之前，我们不想使用它。(这款机型不是6月下旬Netkit热修复系列的一部分。)。\n私钥是管理互联网安全的机制的重要组成部分，路由器将使用私钥来启动安全传输和验证固件更新。他们需要严密保守秘密才能有效，但如果密钥可以在路由器的固件中找到，那么这一点就会被很好地破坏。\n报告称，这意味着任何攻击者都可以冒充该设备进行中间人攻击。&#34；这些密钥与同一型号的所有设备共享。*这意味着在固件中发布的一个私钥会使数千个设备处于危险之中。&#34；\n只有AVM的所有固件映像中的私钥为零。NETGEAR拥有最多。\n然后是D-Link DSL-321B Z，它自2014年8月以来就没有进行过固件更新。总共有46款机型在一年多的时间里没有收到更新，尽管大多数都是在前两年内收到的。\n报告称，如果供应商很长一段时间没有更新固件，那么可以肯定的是，该设备中存在几个已知的漏洞。反之亦然。\n就可用的安全保护而言，AVM显然是在其设备上部署这些保护的最佳选择，Netkit远远落后于Netkit，这些安全保护太过技术性，不能在这里讨论。D-Link表现最差。\n但同样，这些保护中的大多数都是Linux个人电脑和服务器上的标准保护，甚至在Android手机上也是如此。没有真正好的理由不能在更多的路由器上使用它们。", "note_en": "Almost all home Wi-Fi routers tested in a mass study by Germany&#39;s renowned Fraunhofer Institute had serious security vulnerabilities that could easily be fixed by router makers, a  recently released report states.\n &#34;Nearly all were found to have security flaws, some of them very severe,&#34; the  Fraunhofer Institute said in a press release. &#34;The problems range from missing security updates to easily decrypted, hard-coded passwords and known vulnerabilities that should have been patched long ago.&#34;\n   Using its own analytical software, the institute tested the most recently available firmware for 117 home Wi-Fi models currently sold in Europe, including routers from ASUS, D-Link, Linksys, Netgear, TP-Link, Zyxel and the small German brand AVM. The models themselves were not physically tested.\n A  full list of the tested models and firmware is on GitHub. The institute was not able to examine the firmware of 10 more models, mostly from Linksys. The report notes that many firmware updates are issued without fixing known flaws.\n Because the study was begun in late March and examines the firmware available on March 27, it will not include the  dozens of firmware hot fixes that Netgear issued in late June to correct a series of flaws.\n Meanwhile, Huawei routers were not examined because the company does not make its router firmware publicly available, and routers and gateways issued by ISPs were not examined because the ISPs outsource firmware development to many third parties.\n It&#39;s not like this is the first survey of its kind. A  separate study of router security delivered a similarly dire report in December 2018, yet little improvement has been seen in the subsequent 18 months.\n  So what can you do? You can make sure that the next router you buy automatically installs firmware updates. You can check to see whether your current router does so, or makes it fairly easy to install firmware updates manually.\n You should also  make sure that the administrative password for your router has been changed from the factory default password. (Check the list of default passwords at  https://www.routerpasswords.com.) You should also check its administrative interface to make sure that UPnP and remote access are disabled.\n And if your router was first released more than 5 years ago, consider buying a newer model unless it meets all of the above criteria. (Here are our picks for  best Wi-Fi router.)\n Alternatively, you could try to &#34;flash&#34; your older router to run more secure open-source router firmware such as OpenWrt, DD-WRT or Tomato.\n  AVM came out by far the best among the seven manufacturers examined, although it was not without flaws. ASUS and Netgear did not do well, but they were less terrible than D-Link, Linksys, TP-Link and Zyxel.\n The flaws included out-of-date firmware (the D-Link DSL-321B Z had not been updated since 2014); out-of-date Linux kernels (the Linksys WRT54GL uses a kernel from 2002); failure to implement common security techniques (AVM did better than the rest here); secret private keys embedded in the firmware so anyone could find them (the Netgear R6800 had 13); and hard-coded administrative usernames and passwords allowing full device takeover (only ASUS had none).\n &#34;There is no router without flaws, and there is no vendor who does a perfect job regarding all security aspects,&#34; the Fraunhofer report concluded. &#34;Much more effort is needed to make home routers as secure as current desktop or server systems.&#34;\n   There are a few routers named in the study that you should definitely not use, even though it appears you still can buy them.\n &#34;The worst case regarding high severity CVEs [widely known flaws] is the Linksys WRT54GL powered by the oldest kernel found in our study,&#34; the report said, noting that this model uses the 2.4.20 kernel from 2002. &#34;There are 579 high severity CVEs affecting this product.&#34;\n That particular model last had its firmware updated in January 2016, one of the oldest firmwares in the study. The Linksys WRT54GL was first released in 2005 and is still sold today, even though it handles Wi-Fi protocols only up to 802.11g.\n However, the WRT54G series is possibly the best-selling family of Wi-Fi routers ever. The WRT54GL&#39;s continued appeal may be driven by a reputation for reliability and the fact that it&#39;s easily &#34;flashed&#34; to run open-source firmware -- the OpenWrt firmware was initially developed to run on this series of routers.\n  It&#39;s not that other models do so much better in running up-to-date Linux kernels. (More than 90% of the routers in the study ran Linux.) By far, the most common version of the Linux kernel was 2.6.36, issued in 2010. Only AVM didn&#39;t run any 2.x kernels, its oldest version being 3.10.10 from 2013.\n &#34;Nevertheless, more than half of the AVM devices run kernel versions that are not maintained anymore,&#34; noted the report.\n Linux consistently builds new security features right into its kernel, and it&#39;s not that difficult to update the kernel on Linux devices. Makers of Linux PC and server distributions do it all the time.\n While the most recent Linux kernel at the time of the Fraunhofer testing (March 27, 2020) was version 5.4, none of the routers tested used anything newer than 4.4.60, from 2016. (AVM and Netgear used that one.)\n &#34;Linux works continuously to close security vulnerabilities in its operating system and to develop new functionalities,&#34; said researcher Johannes vom Dorp in the Fraunhofer press release. &#34;All the manufacturers would have to do is install the latest software, but they do not integrate it to the extent that they could and should.&#34;\n  Another no-no model is the Netgear R6800, which as mentioned above had a whopping 13 hard-coded private security keys embedded in its firmware.\n Its last firmware update was in August 2019, and we&#39;d not want to use it until a new one was made available. (That model wasn&#39;t part of the late-June series of Netgear hot fixes.)\n Private keys are a crucial part of the mechanisms governing internet security, and routers would use them to initiate secure transmissions and verify firmware updates. They need to stay closely guarded secrets to be effective, but that&#39;s pretty well undermined if the keys can be found in a router&#39;s firmware.\n &#34;This means any attacker can impersonate the device and do man-in-the-middle attacks,&#34; the report said. &#34;These keys are shared with all devices of the same model.  This means one private key published in a firmware puts thousands of devices in danger.&#34;\n Only AVM had zero private keys in all its firmware images. Netgear had the most.\n  Then there&#39;s the D-Link DSL-321B Z, which hadn&#39;t had a firmware update since August 2014. In total, 46 models hadn&#39;t received updates in more than a year, although most had within the previous two years.\n &#34;If a vendor did not update a firmware in a long time, it is for sure that there are several known vulnerabilities in the device,&#34; the report said. &#34;The other way round is not necessarily true.&#34;\n In terms of available security protections, which are too technical to discuss here, AVM was far and away the best at deploying them on its devices, with Netgear a distant second. D-Link fared worst.\n But again, most of these protections are standard on Linux PCs and servers, and even on Android phones. There&#39;s no real good reason they can&#39;t be used on more routers.", "posttime": "2020-07-09 09:00:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "fi,路由器", "title": "100多台Wi-Fi路由器未通过重大安全测试--立即保护您自己", "title_en": "Over 100 Wi-Fi Routers Fail Major Security Test -- Protect Yourself Now", "transed": 1, "url": "https://www.tomsguide.com/news/fraunhofer-router-security-report", "via": "", "real_tags": ["fi", "路由器"]}, {"category": "", "categoryclass": "", "imagename": "f21deea5cf557f53e306305aacfacac8.png", "infoid": 1010683, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个存储库是用并行函数式编程技术编写的射线跟踪器的雏形集合。其目的是调查一个相当小而简单的问题，在某种程度上，函数式编程实现了经常承诺的轻松并行性，以及所产生的代码在客观意义上是否真的很快。基准技术大多是粗糙的，因此假设只有较大的相对差异是有意义的。我欢迎贡献，因为我不太相信我的代码是最优的。我至多精通这里展出的一种语言。我也欢迎其他语言的新实现！\n另请注意，这不是一个好的光线跟踪器。它不会产生特别漂亮的图像。之所以选择它，原因很简单，因为它表达了两种有趣的平行关系(见下文)，而且即使是丑陋的图像也比仅仅是一个数字更有趣。使用了两个场景。第一个是rgbbox：\n第二个场景很有趣，因为负载是不平衡的：allobjects位于像素的下半部分。\n实际渲染场景，由BVH加速。这在很大程度上是简单的数据并行，但每个像素的工作量可能很大。\n以下测量是针对1000x1000渲染的。我使用的是Ryzen 1700X(8核、16线程)CPU和Vega64GPU。同一列中的比较枚举数。\nHaskell实现使用严格的语言杂注来禁用核心模块中的惰性。这对运行时的影响大约是1.5-2倍。massiv库用于并行阵列，是大部分性能的来源。\n在几次错误启动之后，F#在使用.NET内核时运行得相当快。主要技巧似乎是使用内联函数和显式值类型。\nMPL(它是标准ML的MLton的面向并行的分支)绝对是这里的明星。代码可读，以完全自然的风格编写，性能卓越。\n虽然允许实现使用单精度浮点(如果它们愿意的话)，但是使用双精度时，Scala实现实际上要快得多。\n虽然Futhark速度很快，但代码要长得多，也更复杂。这特别是因为BVH的建设。在所有其他实现中，BVH被表示为一个简单的递归分而治之的函数，这也很容易通过fork-join技术并行化。由于Futhark不支持递归，所以它使用了TeroKarras在“最大化BVH、八叉树和k-dTree的构造中的并行性”一文中提出的自底向上技术，这实际上是一个相当快的技术(虽然不适用于这里使用的小场景)，但它比递归公式长约200行。CPU计时使用早期的试验性多核后端，并发出咔哒声来编译C代码。\n铁锈是最快的CPU语言。这并不令人惊讶，因为ASIT有一个成熟的编译器，它的默认行为就是解开所有东西，这正是您在这个程序中所需要的。\n从上表中看不到的是，大多数实现在其原始公式中都明显慢了很多。只有Futhark、MPL和Rust与它们的第一个直接实现相比基本上没有改变。对于其他人，大部分性能归结为各种低级别的调整，特别是避免了装箱和分配。这并不完全出乎意料，但我仍然感到遗憾的是，当谈到函数式语言的性能时，我们必须更多地考虑编译器，而不是语言。\n乔恩·哈罗普(Jon Harrop)的光线追踪器语言比较(Ray Tracer Language Comparison)是本页的灵感来源。主要区别在于我关注的是并行性。这里的光线追踪器还需要从场景数据中构造一个显式的BVH，而乔恩·哈罗普的光线追踪器使用函数公式来描述他的场景的递归结构。", "note_en": "This repository is an embryonic collection of ray tracers written withparallel functional programming techniques. The intent is toinvestigate, on a rather small and simple problem, to which degreefunctional programming lives up to the frequent promise of easyparallelism, and whether the resulting code is actually fast in anobjective sense. The benchmarking technique is mostly crude, soassume only large relative differences are meaningful. I welcomecontributions, as I have little confidence that any of my code isoptimal. I am an expert in  at most one of the languages onexhibition here. I also welcome new implementations in otherlanguages!\n Note also that this is not a  good ray tracer. It does notgenerate particularly pretty images. It&#39;s chosen simply because itexpresses two interesting kinds of parallelism (see below), andbecause even an ugly image is more interesting than just a number.Two scenes are used. The first is  rgbbox:\n    This second scene is interesting because the load is unbalanced: allobjects are in the lower half of the pixels.\n  Actually rendering the scene, accelerated by the BVH. This ismostly straightforward data parallelism, but with a potentiallybeefy amount of work for each pixel.\n  The following measurements are for 1000x1000 renderings. I used aRyzen 1700X (8 cores, 16 threads) CPU and a Vega 64 GPU.  Comparenumbers within the same column.\n   The Haskell implementation uses the  Strict language pragma todisable laziness in the core modules. This has about 1.5-2x impact onthe run-time. The massiv libraryis used for parallel arrays and is the source of most of theperformance.\n After a few false starts, F# runs quite fast when using .NET Core.The main tricks appear to be  using inline functions and explicitvalue types.\n MPL (which is a parallelism-oriented fork of MLton for Standard ML) is definitely the starhere. The code is readable, written in a completely natural style,and performance is excellent.\n  While the implementations are allowed to use single-precision floatingpoint if they wish, the Scala implementation is actually  much fasterwhen using doubleprecision.\n While Futhark is fast, the code is significantly longer and morecomplex. This is particularly because of the BVH construction. Inall other implementations, the BVH is expressed as a straightforwardrecursive divide-and-conquer function, which is also easy toparallelise with fork-join techniques. Since Futhark does not supportrecursion, it instead uses a bottom-up technique presented by TeroKarras in the paper  Maximizing Parallelism in the Construction ofBVHs, Octrees, and  k-dTrees.This is actually a pretty fast technique (although not for the smallscenes used here), but it is about two hundred lines longer than therecursive formulation. The CPU timings use an  early experimentalmulticore backendand  clang for compiling the C code.\n Rust is the fastest CPU language. This is not terribly surprising, asit has a mature compiler, and its default behaviour of unboxingeverything is exactly what you need for this program.\n What is not visible from the above table is that most of theimplementations were significantly slower in their originalformulation. Only Futhark, MPL, and Rust are essentially unchangedfrom their first straightforward implementation. For the others, mostof the performance comes down to various low-level tweaks, inparticular avoiding boxing and allocations. This is not exactlyunexpected, but I still find it sad that when it comes to performancein functional languages, we must think about the  compiler more thanwe think about the  language.\n  Jon Harrop&#39;s  Ray tracer languagecomparisonis an inspiration for this page. The main difference is that I focuson parallelism. The ray tracer here also requires the construction ofan explicit BVH from scene data, while Jon Harrop&#39;s ray tracer used afunctional formulation to describe the recursive structure of hisscene.", "posttime": "2020-07-09 08:58:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,程序,programming,基准,ray", "title": "函数式程序设计语言的并行射线跟踪基准测试", "title_en": "Parallel ray tracing benchmark for functional programming languages", "transed": 1, "url": "https://github.com/athas/raytracers", "via": "", "real_tags": ["设计", "程序", "基准", "ray"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010682, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从今天(7月8日)开始，Tor项目将开展一项为期一个月的活动，名为#MoreOnionsPorhery，以提高人们对洋葱网站的认识，即通过洋葱服务提供的网站。我们最近在Tor浏览器中发布了一项名为Onion-Location的功能，如果某个网站有可用的洋葱站点，它会通知用户。加入我们，打造更安全的网络！要参与，请启用洋葱定位，在您最喜欢的社交媒体上使用#MoreOnionsPorFavor标签分享您的洋葱站点，我们将选择一些洋葱服务运营商来获得Tor礼品。有关所有详细信息，请参阅下面的内容。\n随着世界各地的抗议活动不断涌现，我们知道，争取更公正社会的斗争受到当权者的密切关注。我们在网上做的事情，我们在哪里，我们访问过的网站，我们与谁交谈过的数据正在被收集和分析，以绘制活动家和监督者的社交图。正如许多数字安全培训人员指出的那样：抗议活动可能会结束，但元数据会永远存在。\n我们开发隐私增强技术来保护和促进人权。叫做洋葱服务。在访问网站时默认保护用户元数据的方式，如他们的真实位置、端到端身份验证和端到端加密。人们可以很容易地发现洋葱服务，因为域是编码为以.onion结尾的地址的公钥。\n由于用户对在线安全的关注日益增加，开发人员、系统管理员和网站所有者可以也应该为用户提供更安全的体验。如果您运行一个网站，您可以通过在洋葱服务上提供您的站点的一个版本来提高其安全性。\n最近，我们实现了一种使用Onion-Location来发布和宣传洋葱站点的方法。当访问同时启用了洋葱服务和洋葱位置的网站时，Tor浏览器将显示一个信息包，告知该网站有一个更安全的版本，并将被要求在首次使用时选择加入以升级到洋葱服务。\n许多网络管理员已经加入了我们，并使他们的网站可以通过洋葱服务和洋葱位置访问。例如，ProPublica、DEF Con、Privacy International、Riseup.net、Systemli.org、Write.as。现在，我们邀请您加入这项活动：#MoreOnionsPorhery。\n有些洋葱很容易栽培，但有些可能需要专业支持。对于企业级网站，我们建议与我们联系。\n首先，您需要配置您的Web服务器，使其不会泄露有关您的用户位置的任何信息。与连接到互联网的任何其他服务一样，如果配置错误，可能会有风险。因此，我们建议阅读并遵循洋葱服务文档和最佳实践。\n在您配置好Web服务器和洋葱服务之后，您就可以设置洋葱位置了。。值得一提的是，洋葱位置只有在您已经为您的域设置了TLS证书(即，让加密)的情况下才能工作。\n一旦你建立了洋葱网站，就给&lt；@torproject.org&gt；发一封电子邮件，并在你最喜欢的社交媒体上用#MoreOnionsPorhery标签宣布这一消息。下个月，我们将挑选一些洋葱网站运营商接受Tor礼品，以表达我们对您帮助保卫安全互联网的感激之情。建立您的洋葱网站，并给我们发电子邮件以获得资格。\n如果你不能经营洋葱服务，但想要帮助夺回互联网，还有其他方法可以帮助你：\n向Tor项目捐款，以支持我们开发和共享在线隐私和自由工具的工作。\n帮助翻译Tor社区门户和文档，包括有关如何设置洋葱服务的信息。", "note_en": "Starting today, July 8th, the Tor Project is running a one month campaign called #MoreOnionsPorfavor to raise awareness about onion sites, that is, websites available over onion services. We recently released a feature called Onion-Location in Tor Browser that announces to users if a website has an onion site available. Join us to make a more secure web! To participate, enable Onion-Location, share your onion site using the hashtag #MoreOnionsPorFavor on your favorite social media, and we&#39;ll select some onion service operators to receive a Tor swag. See below for all the details.\n  As protests are sparkling around the world, we know that the struggles for a more just society are closely surveilled by those in power. The things that we do online, where we are, the websites that we&#39;ve visited, who we&#39;ve talked to      data    being collected and analyzed to draw the social graph of activists and   monitor. As many digital security trainers point out: protests may have an end, but metadata    forever.\n  he Tor Project   we develop privacy enhancing technologies to  protect and advance human rights .   is called  Onion Services .    way to protect users   metadata   like their real location,      end-to-end authentication and end-to-end encryption by default when    visit   a website. One can easily spot an onion service as the domains are a public key encoded as an address ending with .onion.\n  Since users have a legit   and increasing concern      safe   online, developers, system administrators   and websites owners can and should offer a more secure experience to users. If you run a website, you can improve its security by offering a version of your site over onion services.\n  Recently   we implemented a way to announce and publicize    onion site using Onion-Location. When   visi   a website that has both onion services and Onion-Location enabled, Tor Browser will display an information pill telling   that there&#39;s a more secure version of the website ,and   will be asked to opt-in to upgrade to the onion service on their first use.\n    Many web administrators   already joined us and made their websites available over onion services and Onion-Location. For example, ProPublica, DEF CON, Privacy International, Riseup.net, Systemli.org,   Write.as. And now, we invite you to join this campaign: #MoreOnionsPorfavor.\n    Some onions are very easy to cultivate, but   others   you may need professional support. For enterprise scale websites, we recommend getting in touch with us  .\n  First, you need to configure your web server so it doesn&#39;t give away any information about your user   location. As   any other service connected to the internet, it can be risky if it&#39;s misconfigured. Therefore, we recommend reading and following  onion services  documentation and  best practices.\n  After you&#39;ve configured your web server and onion service, you can  setup Onion-Location.    . It&#39;s worth mention that Onion-Location will only work if you&#39;ve already setup an TLS certificate for your domain, i.e. Let&#39;s Encrypt.\n  Once you&#39;ve set up your onion site, send an email to &lt;  @torproject.org&gt; and announce it on your favorite social media using the hashtag #MoreOnionsPorfavor. Next month, we will select some onion site operators to receive a Tor swag as a token of our gratitude for your help defending the secure internet.   Set up your onion site and email us by     to qualify.\n    If you can&#39;t run an onion service but want to help to take back the internet, there are other ways you can help:\n  Make a  donation to the Tor Project to support our work developing and sharing tools for privacy and freedom online.\n Help translate Tor   Community portal  and documentation   including information on how to set up an onion service.", "posttime": "2020-07-09 08:57:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,onionize,洋葱", "title": "MoreOnionsPorlike：将您的网站Onion化并夺回互联网", "title_en": "MoreOnionsPorfavor: Onionize your website and take back the internet", "transed": 1, "url": "https://blog.torproject.org/more-onions-porfavor", "via": "", "real_tags": ["网站", "onionize", "洋葱"]}, {"category": "", "categoryclass": "", "imagename": "4caf15e7cc19fd1e2bd4979b4446d296.jpg", "infoid": 1010681, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国的健康危机开始时，华金·H正从自己的健康危机中恢复过来。\n他在一月底突然生病了。他2月份的大部分时间都在医院进进出出，一路上都在做大手术。当他在床上休养，浏览互联网时，他看着冠状病毒紧急情况变得越来越大，离他在俄勒冈州尤金的家越来越近。\n“当Covid走红的时候，”这位51岁的男子告诉我，“我只是想重新站稳脚跟。”出于隐私的原因，他只要求透露自己的名字和姓氏。但这并没有发生。“。\n华金是一名个体户视频编辑和制片人，随着他的康复，他的生意陷入了停顿，当这个国家摇摇欲坠地走在公共卫生和经济危机的边缘时，这种情况仍然存在。他在Insta找到了一份送杂货的工作，但这些位置很快就被抢购一空。\n然后新冠肺炎的严肃性渗透了进来，Insta的演唱会终于实现了-每个人都想现在就送餐。但到那时，华金对去超市，触摸每个人的食品杂货，以及每次去商店都有感染的风险都不确定。他的家庭有七口人，包括他、他的伴侣和五个受抚养人，其中最小的是蹒跚学步的孩子。\n像其他许多人一样，他试图联系当地的大流行失业办公室，但他无法接通。他找到了一份人口普查员的工作。他说他被批准了，通过了背景调查，取了指纹。但他说，培训和实际人口普查工作目前仍处于搁置状态。\nJoaquín已经设法每月全额支付他的房租。他的母亲帮了忙，但她不能再这样做了，因为她自己有费用要考虑。他在力所能及的地方凑钱，在这里借了100美元，或者在eBay上卖东西。其他人在账单上是灵活的，所以仍然有电费和汽车保险。但每一次延误都意味着更多的债务。\n他真的不知道下一步会发生什么，也不知道他将如何继续支付房租。俄勒冈州州长上周二签署了一项法案，延长了该州的暂停租赁期，并让租户在2021年3月31日之前偿还租金，之后，他至少在9月份之前被保护不被驱逐。但所有这些都不能解决根本问题，那就是大流行和经济危机使其无法迎头赶上。房租，水电费，所有的费用。\n“如果一个人必须养家糊口，却不能养家糊口，他该怎么办？说他们愿意工作，但他们甚至找不到，“Joaquín说。“他们是做什么的？”\n这是许多美国人目前正在努力解决的问题。在冠状病毒大流行四个多月后，美国陷入了一场持续的危机：旧的冠状病毒热点被新的冠状病毒热点取代，超过13万人死亡，该国的病例数量上升到创纪录的水平，然后几乎每天都会打破这些纪录。\n公共卫生灾难伴随着一场经济灾难。美国的失业率超过11%，截至7月2日，仍有1900多万人领取失业救济金。大流行的持续迫使一些州和地区缩减了重新开业的规模-酒吧再次关门，室内用餐也没有。这种断断续续的复苏意味着，在未来几个月和几周内，数百万人的工作保障可能仍然脆弱。\n这使得许多人，比如华金，不确定他们将如何支付费用，包括最大的费用之一：房租。\n危机总是迫在眉睫。全国各地暂停驱逐的拼凑和CARE法案带来的福利，包括一次性刺激检查和扩大每周600美元的失业救济金(也向个体户和零工工人提供)，帮助预防了这场灾难。这些政策帮助人们在史无前例的健康危机期间留在家里，并增加了收入，这样他们仍然可以支付账单。\n但住房法庭正在重新开庭，暂缓驱逐令如果还没有到期的话，也将在未来几周到期。CARE法案扩大失业的福利即将用完。除非立法者介入，否则每周600美元的补助金将于7月底到期。\n非营利性住房监督组织住房权利倡议(Housing Rights Initiative)的创始人兼执行董事亚伦·卡尔(Aaron Carr)告诉我，“美国正面临着一场圣经意义上的驱逐危机。”“允许暂缓驱逐和扩大失业救济金到期，无疑将导致一场不稳定、无家可归和人类痛苦的完美风暴.”\n专家、住房活动家和租房者自己都担心，如果不尽快缓解压力，可能会发生什么。即使在大流行之前，租房者往往收入较低，与房主相比，他们将收入的更大份额花在住房成本上。城市研究所6月15日的一份报告估计，890万户家庭-约占所有租户家庭的20%-至少有一名成员在2月至4月期间失去了工作。\n纽约大学(New York University)富曼房地产和城市政策中心(Furman Center For Real Estate And Urban Policy)教授兼教职主任英格丽德·古尔德·埃伦(Ingrid Gould Ellen)说，“我们不希望最初的健康危机变成就业危机，然后变成房地产危机和住房不稳定危机，因为人们被赶出了家园。”\n一些租户和租户组织者参与了租金罢工-有时是因为他们没有其他选择-以赢得房东的让步。互助联盟，即社区成员相互帮助的集体，正在尽其所能填补裂缝，尽管这还不足以完全填补缺口。\n倡导者呼吁立法者在危机期间取消租金，并取消或暂停抵押贷款，以便房东也能生存下来。一些人建议在全国范围内暂停驱逐，以统一混乱的州和地方政策拼凑而成的政策。许多人呼吁更多的资金：更多的刺激措施，重新发放失业救济金，最关键的是，强有力的住房援助，以维持人们在家中和房东的生存。\n但专家和倡导者表示，大流行并没有造成房地产危机；它只是暴露了已经存在的情况。全国低收入住房联盟(National Low-Income Housing Coalition)主席兼首席执行官黛安·延特尔(Diane Yentel)表示：“你总是面临一次财务冲击，一次因为付不起房租而出现的财务紧急情况，可能会被驱逐，在最糟糕的情况下，你还会面临无家可归的问题。”“对于这些租房者中的许多人来说，冠状病毒就是财务危机。”\n“重要的是要记住，即使在这场大流行之前，我们就面临着租金负担能力危机，这种危机在过去几十年里一直在加剧，”福曼中心的艾伦说。她称这是“需要的背景”。\n根据哈佛大学(Harvard University)住房研究联合中心(Joint Center For Housing Studies)的数据，在大流行之前，在美国近4300万租房者中，约有2080万人-几乎一半-是“负担成本的”，这意味着他们收入的30%以上花在了住房费用上。其中，约有1090万租户家庭“负担沉重”，将收入的50%以上花在房租上。\n美国缺乏足够的经济适用房供应。全国低收入住房联盟发现，为最低收入的租房者提供的经济适用房短缺约700万套。在那些有资格获得某种形式的联邦租赁援助的美国人中，只有五分之一的人真正获得了援助。(其他估计数字显示，这一比例为四分之一。)。\n这种日益扩大的需求意味着，一场比冠状病毒引起的经济冲击要浅得多的经济冲击，可能会颠覆租房者本已脆弱的安全。不过，尽管“Covid的经济影响是史无前例的，而且范围很广，”艾伦指出，“但它对租房者的影响尤其严重，而且还将继续如此。”\n例如，租房者更有可能在受疫情打击最严重的服务业等部门工作。福曼中心(Furman Center)的一项分析发现，在纽约市，最有可能因疫情而面临经济中断的租户可能会支付较低的租金，但通常会面临更高的租金负担，这将加剧任何突然的收入损失。艾伦说：“与房主相比，他们更有可能遭受与Covid相关的失业，同时，他们没有任何储蓄来弥补收入缺口。”\n同一项研究还发现，那些容易受到流行病干扰的纽约租户也倾向于住在较小的建筑里，在那里，如果租户拖欠租金，房东就没有缓冲。这意味着业主可能难以维护他们的建筑，并支付抵押贷款和物业税。这可能会影响市和州的预算，就像对服务的需求增加一样。\n这将在其他地方复制。所有这一切都是房地产危机的秘诀。\n随着各州和城市在3月和4月封锁以减缓冠状病毒的传播，至少42个州和哥伦比亚特区实施了某种形式的驱逐禁令，以防止人们在无力支付房租的情况下失去家园。\n截至6月下旬，这个数字已经减少到大约24个，许多州都允许房东在法庭上提起诉讼，即使租户不能立即被驱逐。尽管如此，一些暂停已经完全结束，驱逐开始发生，包括在一些冠状病毒热点地区，比如德克萨斯州。\nCARE法案-要求在7月24日日落后，联邦政府支持的房屋暂停驱逐120天，尽管它需要30天的通知期，因此房东在8月25日之前不能强迫某人离开家。但这并不包括所有的租房者。\n总部位于科罗拉多州的法律项目新冠肺炎驱逐防御项目估计，到9月底，有1,900万至2,300万租户面临被驱逐的风险。“可以说，‘悬崖边缘’是真实存在的，”城市研究所的高级研究助理萨曼莎·巴特科(Samantha Batko)告诉我。“暂停驱逐令即将结束。人们正在被驱逐。“。\n美国公民自由联盟妇女权利项目的斯卡登研究员琳达·莫里斯(Linda Morris)告诉我：“我认为我们绝对没有看到最糟糕的情况。”“我认为我们才刚刚看到它的开始。特别是随着一些州开始解除禁令，我们开始看到未来驱逐人数的增加。“\n她说，禁令的结束“将打开闸门”。\n6月22日，纽约市的房东可以通过邮寄方式开始申请驱逐，但提交的数量很少，法院的命令至少将诉讼推迟到了7月7日。纽约州对那些因新冠肺炎而遭遇“经济困难”或失业的人实施了暂停驱逐的规定。\n6月底，州长安德鲁·科莫(Andrew Cuomo)签署了《租户安全港法案》(Tenant Safe Harbor Act)，该法案规定了暂停租户的规定，并将防止在3月7日至未来的某个日期内因拖欠房款而被驱逐，届时新冠肺炎的所有限制都将取消。但这并不能阻止法院在这段时间内就未付租金做出金钱判决，而且经济困难的定义是灵活的。\n不透明和不断变化的规则增加了租户的压力，他们担心他们可能会以何种方式以及何时出现在住房法庭的案卷上。\n阿利萨·费尔南德斯(Allilsa Fernandez)就是其中之一。这位36岁的纽约人住在皇后区的布莱伍德社区，住在她已经住了三年的同一套公寓里。她说，她总是按时支付房租，但在危机期间，她的房东告诉她，他在4月份提高了100美元的房租。但是100美元已经很多了。\n费尔南德斯是一名残疾人权利和心理健康倡导者，目前正在家中兼职工作。她患有哮喘，担心自己感染冠状病毒的风险。她的伴侣通常付一半的房租，当婴儿保姆，当大流行开始时，她失去了大部分收入。有一家人仍然付钱给她，但钱是源源不断的。\n费尔南德斯在4月份支付了房租，尽管不是房东要求的额外100美元。今年5月，她要求房东用她的保证金来支付每月租金，这是库默批准的。她说他没有那么做，从那以后她就不再付房租了，希望在住房法庭上解决这个问题。她希望这会对她有利，但她说，你永远不会知道-即使是这样，她也可能不得不离开。\n“我真的，真的，真的很害怕无家可归。我一直害怕无家可归。我不知道这对我意味着什么。“费尔南德斯说。“现在，在疫情肆虐的情况下，很难找到一套公寓。我的风险很高；我不是很健康，我可以说，‘哦，我愿意冒这个险。’“\n费尔南德斯已经把她的精力放在了组织上。她正在为自己和其他人寻找住房资源，她正在抗议。她希望看到全面取消租金和冻结租金(意味着房东不能提高租金)一年，至少在人们能够重新站稳脚跟之前。但这些生命线可能不会到达。\n“在正常情况下，驱逐是很糟糕的。在大流行时期，它们是灾难性的，“住房权利倡议的卡尔说。因为在这种情况下，住房危机、无家可归危机、健康危机、经济危机和失业危机的组合，如果不加以控制，将是一场彻头彻尾的灾难。\n倡导者还指出，许多住房法院，即使重新开放，也没有恢复正常营业。社会距离措施意味着地方政府仍在努力解决如何在遵守社会距离规则和安全要求的同时审判案件。一些司法管辖区正在尝试远程听证会，倡导者表示，这对租房者不利，特别是低收入者，他们可能无法接入互联网。获得语言和口译也是一个令人关切的问题。\n“如果那个低收入的租房者没有电脑怎么办？不能上网吗？那么，他们是否被视为没有出现在驱逐案件中？“。全国低收入住房联盟的Yentel说。“这从一开始就是对他们的打击吗？这是非常不公平、明显和不公正的。“。\n报道还记录了房东执行非法驱逐的情况，他们要么向租户施压，要求他们离开，要么采取更强硬的措施，比如换锁，把人们的财物扔到街上。\n朱利安·史密斯-纽曼(Julian Smith-Newman)是成员资助的住房倡导团体洛杉矶租户联盟(Los Angeles Tenants Union)的成员，他说，该组织的成员已经采取了“驱逐封锁”，这是对非法驱逐的一种快速反应，成员试图帮助人们返回家园，有时甚至会与没有意识到驱逐是非法的执法部门对抗。\n但房东也面临着这些暂停令的压力。规模较小的或夫妻店的房东也无法在没有房租的情况下生活几个月。一些房东表示，暂停令威胁到了他们的生计，一些房东已经提起诉讼，要求结束保护措施。\n专家告诉我，这就是为什么这些暂停总是短期的解决方案，只是“把罐子踢到了尽头”。这些措施是必要的，但远远不够。\n在大流行之前，驱逐加剧了住房的不平等。根据美国公民自由联盟(ACLU)的数据，平均而言，黑人租房者被驱逐的比例几乎是白人租房者的两倍。美国公民自由联盟的莫里斯说：“对于黑人女性租户来说，这些差距往往更严重，她们被驱逐的风险最大。”“因此，我们可以肯定的是，这场大流行只会加剧现有的差距。”\n一连串的驱逐也可能导致无家可归者增加，这将给已经在大幅削减服务的州和地方预算带来压力。哥伦比亚大学(Columbia University)一位教授的一项分析估计，今年无家可归者可能会增加40%到45%-额外增加25万人，全国约有80万人无家可归。\n专家告诉我，这反过来将加剧所有其他危机。新学院的城市政策教授亚历克斯·施瓦茨(Alex Schwartz)说，“显然，就能够保持社会距离而言，这是一个公共健康风险。”但帮助无家可归的人变得更加昂贵-而且，城市和地方预算已经捉襟见肘，正在削减社会服务。\n驱逐伴随着他们自己更长期的健康危机。未来更难找到稳定的住房，这扰乱了从工作稳定到健康再到孩子学业进步的一切。\n33岁的威廉斯堡居民布伦南·斯图尔茨(Brennan Stultz)在Facebook上帮助创建了“行动：纽约市租房罢工”(Action：New York City Rent Strike)，他告诉我：“我认为这对人们来说是生死攸关的。”\n他说：“如果他们开始举行虚拟听证会，如果他们找到加快驱逐令的方法，以及这类性质的事情，我们可能会看到大规模的无家可归者。”“你可以看到数十万人失去家园，而我们仍在与世界各地的大流行作斗争。”\n在布鲁克林布什威克(Bushwick)社区的埃尔德特街(Eldert Street)345号，大约有30套公寓正在举行租金罢工。\n一路上，他们已经失去了大约六套公寓-出于恐惧，或者因为一些人与管理公司达成了自己的协议。它破坏了罢工和集体讨价还价的企图。但345老年人租户协会的发言人Cian O‘Day告诉我，每个人都能理解。以前没有人经历过这种情况。\n6月1日，租户协会在楼内悬挂#取消出租#横幅。管理公司租了一辆樱桃采摘机把它拆下来。大楼里有传言说，管理公司以每周1000美元的价格租了这台机器。截至发布时间，管理公司没有回复记者的置评请求。\n确切的成本并不像这个故事所象征的那样重要：房东不会给失业的租户提供租金优惠，而是会花钱取下一个招牌。摘樱桃的人在那里坐了两个星期。\n像O‘Day大楼那样的租金罢工在全国各地如雨后春笋般涌现，因为租房者试图向房东和地方政府施压，要求他们对租金做些什么，任何事情。团结和必要性正在推动这场运动。\n“这很奇怪，”O‘Day说。“这就像是最可怕的时刻，尽管如此，一些最美的狗屎仍在发生，因为人们都在相互照顾。”\nStultz帮助发起了行动：纽约市租房罢工组织，他说他们主办Zoom会议，共享资源，并为全市的租房者提供法律援助。他们正在建设一个社区，即使他们都住在城市的不同地方。他说：“[我们]正在为人们提供一个论坛，让他们彼此讨论这些问题，或许还能从这样一个事实中得到安慰：在这场支付租金的斗争中，他们并不孤单。”\n所有人住房正义(Housing Justice For All)是纽约州倡导团体组成的联盟，推动取消租金，立即将无家可归者重新安置在空置的住房中。该组织的活动协调员CEA Weaver表示，在大流行期间，租户组织的数量有所增加，但现在也走到了十字路口。问题是房东是否还会考虑讨价还价，还是会因为房客拖欠房款而将他们告上法庭。“现在，就是不清楚，”她说。\n因为在纽约市和全国其他许多地方，人们已经别无选择。一切都没有真正改变；大流行仍在继续。只是现在，在许多地方，住房法庭正在重新开放。\n“归根结底，没有什么能真正让人们呆在家里。芝加哥奥尔巴尼公园社区自治租户联盟的组织者杰西·康纳(Jesse Connor)告诉我，“我们一直在推动这个悬崖越走越远，但官方上讲，我们仍然会达到法院开放的地步。”(杰西·康纳是芝加哥奥尔巴尼公园社区自治租户联盟的组织者)。“哪里？\n.", "note_en": "America’s health crisis began just as Joaquín H. was recovering from his own.\n He got sick, suddenly, at the end of January. He spent most of February in and out of the hospital, major surgery along the way. As he recuperated in bed, scrolling the internet, he watched the  coronavirus emergency grow larger, and closer to his home in Eugene, Oregon.\n “As Covid hit,” the 51-year-old, who asked to be identified only by his first name and last initial for privacy reasons, told me, “I’m just trying to get back on my feet. And that just wasn’t happening.”\n A self-employed video editor and producer, Joaquín saw his business ground to a halt as he recovered, and it remained that way as the country teetered on the brink of both a public health and economic crisis. He got a job delivering groceries with Instacart, but the spots got scooped up quickly.\n Then the seriousness of Covid-19 seeped in, and the Instacart gigs finally materialized — everyone wanted their food delivered now. But by then Joaquín wasn’t sure about going to the supermarket, touching everyone’s groceries, and risking infection every trip to the store. His is a household of seven, including him, his partner, and five dependents, the youngest of whom are toddlers.\n  Like many others, he tried to contact the local pandemic unemployment office, but he couldn’t get through. He got work as a census taker. He said he was approved, passed the background check, got fingerprinted. But the training and the actual census work remain on hold for now, he said.\n Joaquín has managed to pay his rent, in full, every month. His mother helped out, but she can’t do that much longer as she has her own expenses to consider. He is clawing together money where he can, borrowing $100 here or selling stuff on eBay. Others are being flexible about bills, so there’s still electricity and car insurance. But each delay means a little more debt.\n He doesn’t really know what’s going to happen next or how he’ll keep paying rent. He’s protected from eviction  until at least September, after Oregon’s governor  signed legislation last Tuesday that extended the state’s moratorium and gives tenants until March 31, 2021, to pay back rent. But none of it solves the underlying problem, which is that the pandemic and the economic crisis are making it impossible to catch up. On rent, on utilities, on all of it.\n  “What does a person do if they have to feed their family, and they can’t? Say they’re willing to work, but they can’t even find it,” Joaquín said. “What do they do?”\n It’s a question many Americans are struggling with right now. More than  four months  into the coronavirus pandemic, the United States is in a sustained crisis:  old coronavirus hot spots replaced  by new ones, more than  130,000 people dead, the country’s case count  rising to record levels and then breaking those records almost  daily.\n The public health catastrophe is paired with an economic one. The United States has an unemployment  rate of over 11 percent, with  more than 19 million people still receiving jobless benefits as of July 2. The persistence of the pandemic has forced some states and localities to scale back their reopening —  bars closed, again, and  no indoor dining. Such a recovery, happening in fits and starts, means job security could remain fragile for millions in the months and weeks ahead.\n This has left many, like Joaquín, unsure how they’ll meet expenses, including one of the biggest: rent.\n A crisis always loomed. A patchwork of eviction moratoriums across the country and benefits from  the CARES Act, including a one-time stimulus check and expanded unemployment benefits of $600 per week (which were also made available to self-employed and gig workers), helped forestall the catastrophe. Those policies helped keep people in their homes during the unprecedented health crisis and supplemented income so they could still pay their bills.\n But housing courts  are reopening, and eviction moratoriums  are expiring in the coming weeks,  if they haven’t already. CARES Act benefits that expanded unemployment are running out. Unless lawmakers intervene, the $600-per-week supplement will  expire at the end of July.\n “The United States is facing an eviction crisis of biblical proportions,” Aaron Carr, founder and executive director of the Housing Rights Initiative, a nonprofit housing watchdog  group, told me. “Allowing eviction moratoriums and expanded unemployment benefits to expire will undoubtedly lead to a perfect storm of instability, homelessness, and human suffering.”\n Experts, housing activists, and renters themselves fear what could happen if there is no relief, and soon. Even before the pandemic, renters tended to be lower-income and  spent a greater share of their income on housing costs compared to homeowners.  A June 15 report from the Urban Institute estimates that 8.9 million households — about 20 percent of all renter households — have at least one member who’s lost a job between February and April.\n “We don’t want what was originally a health crisis turned into a job crisis then now to become a housing crisis and a crisis of housing instability as people are evicted from their homes,” said Ingrid Gould Ellen, a professor and faculty director at the Furman Center for Real Estate and Urban Policy at New York University.\n Some renters and tenant organizers are engaged in rent strikes — sometimes because they don’t have any other options — to win concessions from landlords.  Mutual aid coalitions, collectives of community members helping each other, are filling cracks where they can, though it isn’t enough to fully plug the gaps.\n Advocates are calling on lawmakers to cancel rent for the duration of the crisis, and to cancel or pause mortgages so that landlords can also survive. Some have suggested a  nationwide eviction moratorium to unify the patchwork of confusing state and local policies. And many are calling for more money: more stimulus, renewed unemployment benefits, and, most critically, robust housing assistance to keep people in their homes and landlords afloat.\n But experts and advocates say the pandemic didn’t create the housing crisis; it merely exposed what already existed. “You’re always one financial shock, one financial emergency from not being able to pay the rent, and potentially being evicted, and, in the worst cases, facing homelessness,” said Diane Yentel, president and CEO of the National Low-Income Housing Coalition. “And for many of these same renters, the coronavirus is that financial emergency.”\n   “It’s important to remember that even before this pandemic, we were facing a rental affordability crisis that’s been building over the last few decades,” Ellen, of the Furman Center, said. She called it a “backdrop of need.”\n Before the pandemic, of America’s nearly 43 million renters, about 20.8 million — almost half — were “cost-burdened,” meaning more than 30 percent of their income went to housing costs, according to the  Joint Center for Housing Studies of Harvard University. Of those, about  10.9 million renter households were “severely burdened,” spending more than 50 percent of their income on rent.\n America lacks an adequate supply of affordable housing. The National Low-Income Housing Coalition found a shortage of  about 7 million affordable homes  for the lowest-income renters. Of those Americans who are eligible for some sort of federal rental assistance,  just one in five actually receive it. (Other estimates put it at  one in four.)\n This gaping need means that an economic shock far shallower than the coronavirus-caused one can upend renters’ already fragile security. But while “the economic impacts of Covid are unprecedented and they’re widespread,” Ellen noted, “the effects on renters have been particularly devastating, and will continue to be.”\n  For instance, renters are more likely to work in sectors like the service industry that were hit hardest by the pandemic. An analysis by the Furman Center  found that in New York City, the renters most likely to face economic disruption because of the pandemic may pay lower rent but generally face higher rent burdens, which will exacerbate any sudden loss of income. “They’re more likely to suffer Covid-related job loss than homeowners, and then, meanwhile, they don’t have any savings to speak of, to cover those income shortfalls,” Ellen said.\n That  same study also found that those New York renters vulnerable to pandemic disruptions also tend to live in smaller buildings where the landlords don’t have a cushion if tenants fall behind on rent. That means owners may struggle to maintain their buildings and pay their mortgages and property taxes. That could affect city and state budgets, just as the need for services increases.\n This will be duplicated elsewhere. All of it is a recipe for a housing crisis.\n  As states and cities locked down in March and April to slow the spread of the coronavirus, at  least 42 states and the District of Columbia put some sort of eviction moratorium in place to stop people from losing their homes if they can’t pay rent.\n That number has dwindled to  about two dozen as of late June, and many states are allowing landlords to file cases in court, even if tenants can’t immediately be evicted. Still, some moratoriums have ended completely and evictions are beginning to happen,  including in some coronavirus hot spots, like Texas.\n The CARES Act-mandated 120-day moratorium on evictions in houses with federal backing sunsets after July 24, though it requires a 30-day notice period, so landlords can’t force someone out of their home until August 25.  But this doesn’t cover all renters.\n The  Covid-19 Eviction Defense Project, a Colorado-based legal project, estimates that between 19 million and 23 million renters are at risk of eviction by the end of September. “The ‘cliff’s edge,’ as it were, it’s real,” Samantha Batko, a senior research associate at the Urban Institute, told me. “Eviction moratoriums are ending. People are being evicted.”\n  “I think that we definitely have not seen the worst of it,” Linda Morris, Skadden fellow at the American Civil Liberties Union’s Women’s Rights Project, told me. “I think we’re just seeing the very beginning of it. Especially as some states are beginning to lift their moratorium, we’re beginning to see higher numbers of evictions going forward.”\n The end of moratoriums, she said, “is going to open up the floodgates.”\n Landlords in New York City were able to  start filing evictions, by mail, on June 22, though few were filed and an order from the courts stayed proceedings  until at least July 7. An eviction moratorium is in place in New York state for those experiencing a  “financial hardship” or unemployment linked to Covid-19.\n At the end of June, Gov. Andrew Cuomo signed the  Tenant Safe Harbor Act, which codified the moratorium and would prevent evictions for nonpayment between March 7 and a future date, when all Covid-19 restrictions lift. But it does not stop courts from  handing down money judgments for unpaid rent during that period, and the definition of financial hardship is flexible.\n The opaque and shifting rules add to the stress for tenants, and they are worried about how, and when, they might end up on the housing court docket.\n Allilsa Fernandez is among them. The 36-year-old New Yorker lives in the Briarwood neighborhood of Queens, in the same apartment she’s been in for three years. She says she’s always paid her rent on time, but in the middle of the crisis, her landlord told her he was raising the rent $100 in April. But $100 was a lot.\n Fernandez, a disability rights and mental health advocate, is working part-time from home. She has asthma and is worried about her coronavirus risk. Her partner, who normally goes 50/50 on the rent, babysits, and she lost most of her income when the pandemic started. One family still pays her, but it comes in spurts.\n Fernandez paid her rent in April, though not the extra $100 her landlord demanded. In May, she asked the landlord to use her security deposit to cover the monthly rent,  something Cuomo had sanctioned. She said he didn’t do that, and she’s stopped paying rent since, expecting to hash it out in housing court. She hopes it will go in her favor, but she says you never know — and even if it does, she might still have to leave.\n “I’m really, really, really afraid of being homeless. I’ve been afraid of being homeless. I don’t know what this means for me,” Fernandez said. “Finding an apartment right now, in the middle of the pandemic, is tough. And I’m at high risk; it’s not like I’m healthy and I can say, ‘Oh, I’ll take that risk.’”\n Fernandez has put her energy into organizing. She’s finding housing resources for herself and others, and she’s protesting. She wants to see a full cancellation of rent and a rent freeze (meaning landlords can’t increase rent) for a year, at least until people can get back on their feet. But those lifelines may not arrive.\n “During normal times, evictions are bad. During pandemic times, they are catastrophic,” Carr, of Housing Rights Initiative, said. “Because in this case, you have a combination of a housing crisis, a homelessness crisis, a health crisis, an economic crisis, and unemployment crisis that, left unchecked, will be nothing short of an unmitigated disaster.”\n Advocates also point out that many housing courts, even if they’re reopening, haven’t gotten back to business as usual. Social distancing measures mean localities are still trying to figure out how to adjudicate cases while adhering to social distancing rules and safety requirements. Some jurisdictions are trying remote hearings, which advocates say disadvantages renters, especially low-income ones, who may not have internet access. Language and interpretation access is also a concern.\n “What if that low-income renter doesn’t have a computer available to them? Doesn’t have access to internet? Are they then seen as having not shown up for their eviction case?” Yentel, of the National Low-Income Housing Coalition, said. “And is that a strike against them from the start? Which is just extraordinarily unfair, clearly, and unjust.”\n Reports have  also documented landlords executing illegal evictions, either pressuring tenants to leave or taking more forceful measures like changing locks and throwing people’s belongings out onto the street.\n Julian Smith-Newman, a member of the Los Angeles Tenants Union, a member-funded housing advocacy group, said members of his organization have taken on “eviction blockades,” a kind of  rapid response to illegal evictions in which members try to help people get back into their homes, sometimes even confronting law enforcement who are unaware the evictions are illegal.\n But landlords are also under pressure from these moratoriums. Smaller or mom-and-pop landlords can’t go months without the rent, either. Some landlords  have said the moratoriums threaten their livelihoods, and some have  sued to end the protections.\n This is why these moratoriums were always short-term solutions that merely “kicked the can down the road,” experts told me. They were necessary, but vastly insufficient, measures.\n In pre-pandemic times, evictions exacerbated inequalities in housing.  According to the ACLU, on average, Black renters had evictions filed against them at nearly twice the rate of white renters. “And those disparities are often worse for Black women tenants in particular, who have the greatest risk of having an eviction filed against them,” Morris, of the ACLU, said. “And so what we are certain about is that the pandemic is only going to worsen those existing disparities.”\n A rash of evictions could also lead to increased homelessness, one that will strain state and local budgets that are already slashing services. An analysis by a professor at Columbia University  estimated that homelessness could increase by 40 to 45 percent this year — adding an additional 250,000 people, leaving approximately 800,000 people houseless nationwide.\n This, in turn, will exacerbate all the other crises, experts told me. “It’s a public health risk, obviously, in terms of being able to maintain social distancing,” Alex Schwartz, an urban policy professor at the New School, said. But it becomes even more expensive to help unhoused people — and, again, city and local budgets are already strained and cutting back on social services.\n Evictions come with their own longer-term health crises. It is harder  to find stable housing in the future, which  disrupts everything from job stability to health to kids’ academic progress.\n “I think that this is a life-or-death situation for people,” Brennan Stultz, a 33-year-old Williamsburg resident who helped found the  Action: New York City Rent Strike on Facebook, told me.\n “We could see mass homelessness if they start doing virtual hearings, if they find ways to expedite eviction orders, and things of this nature,” he said. “You could see hundreds of thousands of people lose their home, while we’re still fighting a pandemic across the world.”\n  About 30 apartments are on rent strike at 345 Eldert Street, in the Bushwick neighborhood of Brooklyn.\n They’ve lost about half a dozen apartments along the way — out of fear, or because some struck their own deals with the management company. It undermines the strike and the attempt to bargain collectively. But Cian O’Day, a spokesperson for the 345 Eldert Tenants’ Association, told me everyone understood. It wasn’t like anyone had been in this situation before.\n On June 1, the tenants’ association hung a #CancelRent banner from the building. The management company rented a cherry picker to take it down. Word around the building was that the management company rented the machine for $1,000 a week. The management company did not respond to a request for comment by publication time.\n The exact cost was less important than what the story symbolized: that the landlord wouldn’t give an out-of-work tenant a break on the rent but would spend money to take down a sign. The cherry picker sat there for two weeks.\n  Rent strikes, like the one in O’Day’s building, have popped up around the country as renters try to pressure both landlords and local governments to do something, anything, about the rent. Solidarity and necessity are driving the movement.\n “It’s weird,” O’Day said. “It’s like the scariest time and still, some of the most beautiful shit is happening because people are looking out for each other.”\n Stultz, who helped start the Action: New York City Rent Strike group, said they host Zoom meetings, share resources, and connect renters across the city with legal aid. They are building a community, even if they all live in different parts of the city. “[We’re] providing a forum for people to discuss these issues between each other, and maybe take comfort from the fact that they’re not alone in this fight to pay rent,” he said.\n Cea Weaver, a campaign coordinator with Housing Justice for All, a coalition of New York state advocacy groups pushing to cancel rent and immediately rehouse homeless people in vacant housing, said that tenant organizing has increased during the pandemic, but it’s also hitting a crossroads right now. The question is whether landlords will still consider bargaining, or if they’ll just take tenants to court for nonpayment. “Right now, it’s just not clear,” she said.\n Because in New York City, and in many other places across the country, people are running out of options. Nothing has really changed; the pandemic continues. Only now, in lots of places, housing courts are reopening.\n “There’s ultimately nothing really keeping people in their homes. We keep pushing this cliff further and further down the road, but officially, we’re still going to hit this point where the courts are going to be open,” Jesse Connor, an organizer for Autonomous Tenants Union in Chicago’s Albany Park neighborhood, told me. “Where \n......", "posttime": "2020-07-09 08:56:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,迫在眉睫,looming,驱逐", "title": "美国迫在眉睫的房地产灾难", "title_en": "America's Looming Housing Catastrophe", "transed": 1, "url": "https://www.vox.com/21301823/rent-coronavirus-covid-19-housing-eviction-crisis", "via": "", "real_tags": ["美国", "迫在眉睫", "looming", "驱逐"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010680, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个“听起来不可能”的问题……。我几乎后悔把这个故事发布给广大观众，因为它在一次会议上成为了一个关于喝酒的伟大故事。：-)故事稍加改动是为了保护有罪的人，省去无关和无聊的细节，使整件事更具娱乐性。几年前，我在一份管理校园电子邮件系统的工作中接到统计系主任的电话。我们在向系外发送电子邮件时遇到了问题。有什么问题吗？我问道。我们不能发送邮件。我问：--)为了保护有罪的人，我回避了无关和无聊的细节，使整件事更具娱乐性。几年前，当我接到统计系主任的电话时，我正在做一份管理校园电子邮件系统的工作。我们在向系外发送电子邮件时遇到了问题。有什么问题吗？我问道。“又来了？”他重复道，“我们不能把邮件寄到离这里500英里以外的地方。”实际上，多了一点。就当是520英里吧。但不会再往前走了。嗯……。一般说来，电子邮件真的不是这样用的，我说，试图让自己的声音不再惊慌失措。在与部门主席交谈时，人们不会表现出恐慌，即使是在谈到相对贫穷的部门式的统计数据时也是如此。是什么让你认为你寄的邮件不能超过500英里？主席恼火地回答说，这不是我*想的那样。你看，几天前，当我们第一次注意到这件事的时候--你等了几天？我打断了，声音颤抖。你一直都不能发电子邮件吗？我们可以发电子邮件。只是不超过-500英里，是的，我为他跑完了终点，我明白了。但是你为什么不早点打电话呢？嗯，我们直到现在才收集到足够的数据来确定发生了什么事。对。这位是*统计*的主席。不管怎样，我让一位地质统计学家调查了it--&#34；&#34；Geostatisticians.&#34；&#34；--yes，，她拿出了一张地图，上面显示了我们可以发送电子邮件的半径略高于500英里。在这个半径内，有许多目的地我们是无法到达的，也不能零星地到达，但我们的电子邮件永远不能超过这个半径。我明白了，我说着，双手抱着头。这是什么时候开始的？你说是几天前，但那时你的系统有什么变化吗？嗯，顾问进来给我们的服务器打了补丁，然后重新启动了它。但我给他打了电话，他说他没有碰邮件系统。好的，让我看看，我会给你回电话的，我说，简直不敢相信我是在配合。这不是愚人节。我试着回忆是否有人欠我一个恶作剧，我登录了他们部门的服务器，发送了几封测试邮件，这是在北卡罗来纳州的研究三角地区，一封测试邮件被顺利地送到了我自己的账户。送往里士满、亚特兰大和华盛顿的人也是如此。另一封去普林斯顿(400英里)的邮件行得通，但后来我试着给孟菲斯(600英里)发了一封电子邮件。失败了波士顿失败了。底特律失败了。我拿出我的通讯录，开始试着缩小范围。纽约(420英里)成功了，但普罗维登斯(580英里)失败了，我开始怀疑我是不是疯了。我试着给一位住在北卡罗来纳州的朋友发电子邮件，但他的ISP在西雅图，谢天谢地，失败了。如果问题与人类收件人的地理位置有关，而不是与他的邮件服务器有关，我想我会泪流满面。在确定了--难以置信--报告的废话和可重复的问题之后，我查看了sendmail.cf文件。看起来很正常。实际上，它看起来很眼熟。我将它与我主目录中的sendmail.cf进行了比较。它没有被修改--它是我写的一封发送邮件。cf。我非常确定我没有启用Fail_Mail_Over_500_Miles&34；选项。不知所措地，ITELNET连接到了SMTP端口。服务器很高兴地回复了一个SunOSsendmail横幅。请稍等.。SunOS Sendmail横幅？当时，尽管Sendmail8已经相当成熟，Sun仍在将Sendmail5与其操作系统一起发布。作为一名优秀的系统管理员，我对Sendmail 8进行了标准化。同时，作为一名优秀的系统管理员，我编写了一份asendmail.cf，它使用了Sendmail 8提供的长长的自我记录选项和可变名称，而不是Sendmail 5中使用的模糊的标点符号代码。这些代码一下子就到位了，我又一次被我现在冰镇的拿铁咖啡渣呛住了。当顾问给服务器打补丁时，他显然升级了SunOS的版本，并在这样做的过程中*降低了*Sendmail的级别。这次升级很好地保留了sendmail.cfone，尽管它现在是错误的版本。碰巧的是，sendmail 5--至少是Sun发布的版本，经过了一些调整--可以处理sendmail 8 sendmail.cf，因为当时的大多数规则都没有改变。但是newlong配置选项--那些它认为是垃圾的选项，就跳过了。和", "note_en": "Here&#39;s a problem that *sounded* impossible... I almost regret postingthe story to a wide audience, because it makes a great tale over drinksat a conference. :-) The story is slightly altered in order to protectthe guilty, elide over irrelevant and boring details, and generally makethe whole thing more entertaining.I was working in a job running the campus email system some years agowhen I got a call from the chairman of the statistics department.&#34;We&#39;re having a problem sending email out of the department.&#34;&#34;What&#39;s the problem?&#34; I asked.&#34;We can&#39;t send mail more than 500 miles,&#34; the chairman explained.I choked on my latte. &#34;Come again?&#34;&#34;We can&#39;t send mail farther than 500 miles from here,&#34; he repeated. &#34;Alittle bit more, actually. Call it 520 miles. But no farther.&#34;&#34;Um... Email really doesn&#39;t work that way, generally,&#34; I said, tryingto keep panic out of my voice. One doesn&#39;t display panic when speakingto a department chairman, even of a relatively impoverished departmentlike statistics. &#34;What makes you think you can&#39;t send mail more than500 miles?&#34;&#34;It&#39;s not what I *think*,&#34; the chairman replied testily. &#34;You see, whenwe first noticed this happening, a few days ago--&#34;&#34;You waited a few DAYS?&#34; I interrupted, a tremor tinging my voice. &#34;Andyou couldn&#39;t send email this whole time?&#34;&#34;We could send email. Just not more than--&#34;&#34;--500 miles, yes,&#34; I finished for him, &#34;I got that. But why didn&#39;tyou call earlier?&#34;&#34;Well, we hadn&#39;t collected enough data to be sure of what was going onuntil just now.&#34; Right. This is the chairman of *statistics*. &#34;Anyway,I asked one of the geostatisticians to look into it--&#34;&#34;Geostatisticians...&#34;&#34;--yes, and she&#39;s produced a map showing the radius within which we cansend email to be slightly more than 500 miles. There are a number ofdestinations within that radius that we can&#39;t reach, either, or reachsporadically, but we can never email farther than this radius.&#34;&#34;I see,&#34; I said, and put my head in my hands. &#34;When did this start?A few days ago, you said, but did anything change in your systems atthat time?&#34;&#34;Well, the consultant came in and patched our server and rebooted it.But I called him, and he said he didn&#39;t touch the mail system.&#34;&#34;Okay, let me take a look, and I&#39;ll call you back,&#34; I said, scarcelybelieving that I was playing along. It wasn&#39;t April Fool&#39;s Day. Itried to remember if someone owed me a practical joke.I logged into their department&#39;s server, and sent a few test mails.This was in the Research Triangle of North Carolina, and a test mail tomy own account was delivered without a hitch. Ditto for one sent toRichmond, and Atlanta, and Washington. Another to Princeton (400 miles)worked.But then I tried to send an email to Memphis (600 miles). It failed.Boston, failed. Detroit, failed. I got out my address book and startedtrying to narrow this down. New York (420 miles) worked, but Providence(580 miles) failed.I was beginning to wonder if I had lost my sanity. I tried emailing afriend who lived in North Carolina, but whose ISP was in Seattle.Thankfully, it failed. If the problem had had to do with the geographyof the human recipient and not his mail server, I think I would havebroken down in tears.Having established that -- unbelievably -- the problem as reported wastrue, and repeatable, I took a look at the sendmail.cf file. It lookedfairly normal. In fact, it looked familiar.I diffed it against the sendmail.cf in my home directory. It hadn&#39;t beenaltered -- it was a sendmail.cf I had written. And I was fairly certainI hadn&#39;t enabled the &#34;FAIL_MAIL_OVER_500_MILES&#34; option. At a loss, Itelnetted into the SMTP port. The server happily responded with a SunOSsendmail banner.Wait a minute... a SunOS sendmail banner? At the time, Sun was stillshipping Sendmail 5 with its operating system, even though Sendmail 8 wasfairly mature. Being a good system administrator, I had standardized onSendmail 8. And also being a good system administrator, I had written asendmail.cf that used the nice long self-documenting option and variablenames available in Sendmail 8 rather than the cryptic punctuation-markcodes that had been used in Sendmail 5.The pieces fell into place, all at once, and I again choked on the dregsof my now-cold latte. When the consultant had &#34;patched the server,&#34; hehad apparently upgraded the version of SunOS, and in so doing*downgraded* Sendmail. The upgrade helpfully left the sendmail.cfalone, even though it was now the wrong version.It so happens that Sendmail 5 -- at least, the version that Sun shipped,which had some tweaks -- could deal with the Sendmail 8 sendmail.cf, asmost of the rules had at that point remained unaltered. But the newlong configuration options -- those it saw as junk, and skipped. Andthe sendmail binary had no defaults compiled in for most of these, so,finding no suitable settings in the sendmail.cf file, they were set tozero.One of the settings that was set to zero was the timeout to connect tothe remote SMTP server. Some experimentation established that on thisparticular machine with its typical load, a zero timeout would abort aconnect call in slightly over three milliseconds.An odd feature of our campus network at the time was that it was 100%switched. An outgoing packet wouldn&#39;t incur a router delay until hittingthe POP and reaching a router on the far side. So time to connect to alightly-loaded remote host on a nearby network would actually largely begoverned by the speed of light distance to the destination rather than byincidental router delays.Feeling slightly giddy, I typed into my shell:$ units1311 units, 63 prefixesYou have: 3 millilightsecondsYou want: miles * 558.84719 / 0.0017893979&#34;500 miles, or a little bit more.&#34;Trey Harris-- I&#39;m looking for work. If you need a SAGE Level IV with 10 years Perl,tool development, training, and architecture experience, please emailme at trey@sage.org. I&#39;m willing to relocate for the right opportunity.", "posttime": "2020-07-09 08:28:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "邮寄,send,sendmail", "title": "我们不能邮寄超过500英里的邮件", "title_en": "We can't send mail more than 500 miles", "transed": 1, "url": "http://web.mit.edu/jemorris/humor/500-miles", "via": "", "real_tags": ["邮寄", "send", "sendmail"]}, {"category": "", "categoryclass": "", "imagename": "0ac1d2add4518fa23fa929b28ea3888f.jpeg", "infoid": 1010679, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JKLLP(发音类似于jökulhlap&34；)是一个只有36个键的人体工学键盘。它是围绕你的手的自然休息位置而设计的。\n该存储库包含从头开始制作正常运行的jkrp所需的所有文件，包括案例、接线和固件。\n该设计需要阿尔卑斯式开关和Pololu A-Star控制器。你不需要印刷电路板或热胶。\n外壳是一堆激光切割层，用螺栓固定在一起。这些层包括：\n底座是单个部件，它将键盘的两个部分固定在一起，并设置它们彼此之间的角度。它可以是任何厚度或材料。我用的是1/4&34；胶合板。\ncase.svg中包含的底座将角度设置为20°，但是您可以使用不同的角度制作另一个底座，并随时将其替换，即使在布线之后也是如此。\n框架为布线、触点和二极管创建了一个空腔。它可以是任何材料，但应该至少有5毫米厚。\n板将开关牢牢固定在适当的位置，避免了PCB或热胶的需要。这些板有两层：\n晶体是控制器上的可选屏蔽(顶部的照片中未显示)。和底座一样，这块需要更换才能改变分割角度，包括的那块是20°角的。\n按键矩阵和控制器的接线由Firmware.json指定，可以在Keyboard Firmware Builder中编辑并编译成相应的固件。\n如果你不明白这是什么意思，或者不需要布线技术的帮助，QMK手线指南是很好的。\n要使用布局或从头开始重新设计键矩阵，请从在键盘布局编辑器中打开layout.json开始。", "note_en": "jklp (pronounced like &#34;jökulhlaup&#34;) is an ergonomic keyboard with just 36 keys. It&#39;s designed around the natural resting position of your hands.\n   This repository contains the files you need to make a functioning jklp from scratch, including the case, wiring, and firmware.\n The design requires ALPS-style switches and a Pololu A-Star controller. You won&#39;t need a PCB or hot glue.\n   The case is a stack of laser-cut layers fastened together by bolts. The layers are:\n   The base is single piece that holds the halves of the keyboard together and sets their angle with respect to one another. It can be of any thickness or material. I used 1/4&#34; plywood.\n The base included in  case.svg sets an angle of 20°, but you can make another base with a different angle and swap it in anytime, even after wiring.\n   The frame creates a cavity for the wiring, contacts, and diodes. It can be of any material but should be at least 5 mm thick.\n   The plates hold the switches firmly in place, avoiding the need for a PCB or hot glue. The plates have two layers:\n    The crystal is an optional shield over the controller (not pictured in the photo at top). Like the  base, this piece needs to be replaced in order to change the split angle, and the included one is for a 20° angle.\n   The wiring of the key matrix and controller is specified by  firmware.json, which can be edited and compiled to corresponding firmware in  Keyboard Firmware Builder.\n If you don&#39;t understand what that means or need help with wiring technique, the  QMK Hand Wiring Guide is good.\n  To play with the layout or redesign the key matrix from scratch, start by opening up  layout.json in the  Keyboard Layout Editor.", "posttime": "2020-07-09 08:28:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "键盘,人体工学,ergonomic,需要", "title": "JKLP：一种36键人体工学键盘", "title_en": "jklp: a 36-key ergonomic keyboard", "transed": 1, "url": "https://github.com/brow/jklp", "via": "", "real_tags": ["键盘", "人体工学", "ergonomic", "需要"]}, {"category": "", "categoryclass": "", "imagename": "886131ccf4f48944a907c8248533ec88.png", "infoid": 1010677, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我知道，我知道，在这一点上，你只想让它成为一个真实的人，这样你就可以打它的脸了。作为一名独立制作人，这句话可能会让人超级沮丧，因为它令人厌倦，它是陈词滥调，而你的反应总是嘿！你不明白.。这不是那么容易的事。\n后来，我于2018年1月1日开始构建一款应用程序。那是除夕夜，我们刚刚度过了有史以来最糟糕的一晚。是的，想象一下这样一个糟糕的夜晚，你知道吗，在午夜，你决定去他妈的，我要从事网络开发。有那么糟。\n*MVP在几天内就准备好了。我不是一个很好的程序员，它只是一个简单的应用程序。0.0.1alpha版本已经准备就绪。我可以把它发布出来，和几个人分享，然后就到此为止。从2018年到现在的任何时候，我都可以用我制作的每一个版本做到这一点。我只想再补充一件事。还有一个特点。只要再做一件事，人们就会喜欢的。再来一屏，一切都会变得有意义。我发誓，就这最后一件东西，它已经准备好了。\n对于BAM来说，世界上最大的笨蛋在最后一刻做出的决定：如果它没有合适的本地移动应用程序，人们就不会使用它。是时候学习“反应原住民”了，花几个月的时间学习那个🤦️&#34；\n天啊，如果时光机是真的，过去的基兹现在就会被如此用力地推进马桶。\n*经过2年的开发，在他妈的恐怖的网络平台，Reaction Native，EXPO，GraphQL，抱怨没有理想的技术堆栈，美好的旧jQuery和Filezilla时代，切换到其他项目，发布其他应用程序，失去激情，寻找激情，回到应用程序等之间游刃有余。\n但我仍然在使用它，但我停止了开发，只是放弃了发布这款应用的想法，永远不会。\n“过了一段时间，我开始使用它，但我意识到我错过了很多功能，所以我要么不得不回去开发它，要么我必须寻找替代方案。\n他说，我在滚动他们的登录页面时，我既高兴又愤怒。有人解决了我正在解决的问题。这就像是有人从字面上读出我的想法，然后开始编码。什么。\n我之前曾向几个人发送过我的应用程序的视频(距离发货最近)，所以如果有人真的与这些人分享了我的应用程序的视频，我开始怀疑，因为他们正在解决几乎相同的问题，他们拥有的大部分功能都是我拥有的。\n我开始有一种无法抗拒的快乐、悲伤和恐慌的感觉。我真的无法解释我在浏览他们的页面时的感受。\n前一刻我在浏览他们的功能列表，就像一个拿着48美元钞票的小孩子在糖果店里咯咯地笑着(是的，我知道48美元钞票没有意义，但JavaScript没有意义，而你还在使用它)，一会儿我想找到这些人，把他们扔进狮子坑。\n我认为这不是他们的错。我只是反应太慢了。我没有按时装船。我要去把纹身纹在我额头上。不，我在那里看不到它。也许在我胳膊上。NVM，让我回过头来滚动他们的登录页。\n操。他们已经解决了我想要解决的一切问题，而且远不止这些。嘿，也许我应该开心一点？我再也不用写代码了。耶！？没有更多的网络平台了吗？布利斯。哦，该死的..。不过，全世界都看不到我的应用程序了。但至少我不用再看到“反应原住民”了。好的!。等等.。但我在这上面浪费了太多时间。操。一堆喜忧参半的感觉。\n我犹豫了一下，然后算了一笔账。我在他们的帮助中心看了视频。每次我发现自己对他们用一种聪明的方式微笑时，我都会扇自己一巴掌。不是的。坏猫。你不应该这样。他们是竞争对手。当然，伙计，不管你跟自己说什么。一个烂代码库的竞争对手坐在你的硬盘上。\n两年来，我一直认为现在发布我的应用程序还为时过早，因为它笨重、漏洞百出，而且还缺少一些功能，诸如此类的东西。没人会用它，对吧？我大错特错了。\n即使他们在过去的几年里一直在研究它，它仍然很慢，有缺陷，而且超级粗糙，但这并不重要，因为他们已经发货了。\n但他们的移动应用程序很糟糕，需要10秒才能同步。没关系，他们已经发货了。我期待着他们发布的每一次更新。\n虽然他们积压了大量的事情要做，但这并不重要，他们每周都会发货，而且这款应用程序也在随着社区的发展而不断增长。\n但是凯特，即使他们运来了，也没有人会为未抛光和损坏的东西买单，对吗？\n“今天我30天的试用期已经到期了。”我在他们的应用程序中输入信用卡的每一位数字时，眼泪都会顺着我的脸颊滚落下来。我不仅是正式的订阅者，也是我的粉丝。每次我收到付款通知时，感觉就像踩到了乐高积木上。粘在刀子上。我的银行不妨将通知从您已支付5美元给ThatCompany&34；更改为&#34；您从未发货，失败者&34；。\n现在你们中大约99%的人都在同一条船上，但希望你们的项目只有几周的时间。别像我一样做傻子。深呼吸，对那些陈词滥调翻白眼，但是请.。\n附注：我会完全发布并向你展示我的应用程序，但是…。它还没有准备好。", "note_en": "I know, I know, at this point you want &#34;Just Ship It&#34; to be an actual person so you could punch it in the face. As an Indie Maker, that sentence can be super frustrating because it&#39;s tired, it&#39;s cliche, and your response is always &#34;HEY! You don&#39;t understand... it&#39;s not that easy&#34;.\n      I started building an app on 01.01.2018. It was New Year&#39;s Eve and we just had the crappiest night ever. Yes, imagine a night  so bad that at midnight you decide &#34;you know what, fuck it, I&#39;m gonna work on WEB DEVELOPMENT&#34;. That bad.\n  The MVP was ready in a few days. I&#39;m not that good of a coder, it&#39;s just a simple app. The 0.0.1 alpha version was more than ready. I could&#39;ve released it, share it with a couple of people, and call it a day. I could&#39;ve done that with every single version that I made, at any point from 2018 until now. I just wanted to add one more thing. One more feature. Just this one more thing and people will like it. One more screen and everything is gonna make sense. I swear, just this one last thing and it&#39;s ready.\n  BAM, last moment decision from the world&#39;s biggest dumbass:&#34;People wouldn&#39;t use this if it doesn&#39;t have a proper native mobile app for it. Time to learn React Native and spend a few months on that 🤦️&#34;\n  God, if time machines were real, past-Kitze would be shoved in a toilet so hard right now.\n  After 2 years of development, juggling between the fucking horror that&#39;s the web platform, React Native, Expo, GraphQL, bitching about how there&#39;s no ideal tech stack, the good old jQuery and Filezilla days, switching to other projects, releasing  other apps, losing passion, finding passion, coming back to the app, etc. etc. etc...\n    I was still using it but I stopped developing it and just dropped the idea of releasing the app, ever.\n  After a while, I was using it, but I realized that I&#39;m missing a lot of features, so I&#39;d either have to go back to developing it, or I&#39;d have to find an alternative.\n    I was scrolling their landing page and I was happy and furious at the same time. Someone solved the problem that I was solving. It was like someone literally read my mind and started coding. WHAT.\n  I have previously sent a video of my app to a couple of people (closest I came to shipping it) so I started getting suspicious if someone actually shared the video of my app with these people because they were solving literally the same problem, and they most of the features that I had.\n  I started getting this overwhelming happy, sad, and panicky feeling. I literally cannot explain how I felt while scrolling their page.\n  One moment I am scrolling their list of features giggling like a little kid with a 48$ bill in a candy store (yea I know 48$ bills don&#39;t make sense, but JavaScript doesn&#39;t make sense and you&#39;re still using it), one moment I want to find these people and THROW THEM IN A PIT OF LIONS.\n    It&#39;s not their fault. I was just slow. I didn&#39;t ship on time. I&#39;m gonna go ahead and tattoo &#34;JUST SHIP IT&#34; on my forehead. Nah I wouldn&#39;t be able to see it there. On my arm maybe. Nvm, let me go back to scrolling their landing page.\n  Fuck. They have solved everything that I wanted to solve, and WAY more. Hey, maybe I should be happy? I don&#39;t have to code anymore. Yay!? No more web platform? BLISS. Oh crap... the world is never gonna see my app though. But at least I don&#39;t have to see React Native anymore. NICE! Wait... BUT I WASTED SO MUCH TIME ON IT. FUCK. A bunch of mixed feelings.\n    After a little bit of hesitation, I made an account. I watched the videos in their help center. Every time I caught myself smiling about a clever way they implemented something I slapped myself. NO. Bad Kitze. You shouldn&#39;t like this. THEY&#39;RE COMPETITORS.  sigh Sure buddy, whatever you tell yourself. Competitors to a shitty codebase sitting on your hard drive.\n  For 2 frickin&#39; years, I thought it&#39;s too early to release my app because it&#39;s clunky, buggy, it&#39;s missing features, blah, blah, blah. No one would ever use it, right? I was so wrong.\n    Even though they were working on it for the past few years it&#39;s still slow, buggy, and super unpolished, it doesn&#39;t matter, because they shipped.\n  Their mobile app is terrible and it needs 10 seconds to sync. It doesn&#39;t matter, they shipped. And I&#39;m looking forward to every single update they release.\n  Their backlog of things to do is huge, but it doesn&#39;t matter, they ship every single week, and the app is growing along with the community.\n  &#34;But Kitze, even though tHeY sHiPpEd no one would pay for something unpolished and broken, right?&#34;\n    Today my 30-day trial has expired. A tear rolled down my cheek for every single digit of my credit card that I entered in their app. I am officially not only a subscriber, but also a fan. Every time I&#39;ll get a payment notification it&#39;s gonna feel like stepping on a lego ... glued to a knife. My bank might as well change the notification from &#34;You have paid 5$ to ThatCompany&#34; to &#34;You never shipped, loser&#34;.\n    99% of you are in the same boat right now, but hopefully just a few weeks into your project. Don&#39;t be a dumbass like me. Take a breath, roll your eyes at the cliche saying, but please...\n    P.S I would totally release and show you my app but ... it&#39;s not ready yet.", "posttime": "2020-07-09 07:53:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "装船,ship,应用程序", "title": "史上最悲哀的“装船”故事", "title_en": "The saddest “Just Ship It” story ever", "transed": 1, "url": "https://kitze.io/posts/saddest-just-ship-it-story-ever", "via": "", "real_tags": ["装船", "ship", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "7f38323203bae4b90dad39a98c22e217.png", "infoid": 1010676, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "-与麦克斯韦尔母亲去世的帖子有差距(https://i.imgur.com/VhjejBw.png)和凯鹏华盈的派对(https://i.imgur.com/VCzoTeK.jpg))，鲍康如在那里报告看到了麦克斯韦尔。\n-被控腐败，自动删除对自己账户和其他一些人的提及：https://www.dailydot.com/debug/reddit-maxwellhill-moderator-technology-flaw/。\n编辑：显然人们非常关心互联网点数，所以如果不是很明显的话，这是今天突然出现的几个匿名帖子的集合，我只是整理了一下。别把我的功劳归功于我，也不要计划暗杀我", "note_en": "- Gaps in posting line up with Maxwell&#39;s mother&#39;s death ( https://i.imgur.com/VhjejBw.png) and the Kleiner Perkins party ( https://i.imgur.com/VCzoTeK.jpg) where Ellen K. Pao reported seeing Maxwell\n    - Accused of corruption, auto-deleting mentions of their own account and a select few others:  https://www.dailydot.com/debug/reddit-maxwellhill-moderator-technology-flaw/\n     Edit: Apparently people care about internet points a lot so in case it wasn&#39;t obvious, this is a collection of stuff from several anonymous threads that popped up today, I just collated it. Do not credit or plan to assassinate me", "posttime": "2020-07-09 07:53:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "reddit,ghislaine,帖子", "title": "/u/maxwell hill，第一个达到一百万业力的Reddit用户是吉斯莱恩·马克斯韦尔(Ghislaine Maxwell)", "title_en": "/u/maxwellhill, the first Reddit user to reach 1M karma, is Ghislaine Maxwell", "transed": 1, "url": "https://www.reddit.com/r/Epstein/comments/hnckn0/umaxwellhill_the_reddit_account_with_the_8th_most/", "via": "", "real_tags": ["reddit", "ghislaine", "帖子"]}, {"category": "", "categoryclass": "", "imagename": "78743781e8be35578e3f280247d7fdeb.jpeg", "infoid": 1010675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-英伟达(NVDA.O)首次超过英特尔(INTC.O)，成为美国最有价值的芯片制造商。\n作为半导体行业的一个里程碑，NVIDIA的股价在周三下午的交易中上涨2.3%，达到创纪录的404美元，使这家图形组件制造商的市值达到2,480亿美元，略高于英特尔的2,460亿美元，英特尔曾是全球领先的芯片制造商。\n近年来，随着NVIDIA从核心的个人电脑芯片业务扩展到数据中心、汽车和人工智能，NVIDIA的股票一直是华尔街表现最强劲的股票之一。英特尔几十年来一直在个人电脑和服务器处理器领域占据主导地位，在智能手机革命中遭遇重大挫折后，该公司一直难以实现业务多元化。\n自3月23日标准普尔500指数触及低点以来，美国芯片制造商的表现大多强于大盘，但英特尔享受到的反弹要比英伟达少得多，英伟达经常是富达(Fidelity)和其他散户投资网站上成交量最大的股票之一。\n英特尔的股价在2020年下跌了近3%，而英伟达的股价飙升了68%。投资者一直押注，由于冠状病毒大流行而转向远程工作，将继续推动NVIDIA数据中心业务的快速增长。\n近年来，英特尔也面临国外对手更激烈的竞争，市值早已跌破韩国三星电子(005930.KS)和台积电(2330.TW)。\n最近，英特尔在其庞大的供应链中遭遇挫折，原因是疫情蔓延，以及与即将到来的“老虎湖”10纳米处理器开发相关的更高成本。\n尽管NVIDIA股价迅速上涨，但其销售额仍只是英特尔的一小部分。根据Refinitiv的数据，分析师平均预计NVIDIA当前财年的营收将增长34%，至146亿美元，而分析师预计英特尔2020财年的营收将增长2.5%，至738亿美元。\n反映出投资者对NVIDIA未来获利增长的乐观情绪，目前NVIDIA的股价预期市盈率为45倍，而英特尔的预期市盈率为12倍。", "note_en": "(Reuters) - Nvidia (  NVDA.O) has overtaken Intel (  INTC.O) for the first time as the most valuable U.S. chipmaker.\n  In a semiconductor industry milestone, Nvidia’s shares rose 2.3% in afternoon trading on Wednesday to a record $404, putting the graphic component maker’s market capitalization at $248 billion, just above the $246 billion value of Intel, once the world’s leading chipmaker.\n   Nvidia’s stock has been among Wall Street’s strongest performers in recent years as it expanded from its core personal computer chip business into datacenters, automobiles and artificial intelligence. Intel, which for decades has dominated in processors for PCs and servers, has struggled to diversify its business after making critical stumbles in the smartphone revolution.\n U.S. chipmakers have mostly outperformed since the S&amp;P 500 hit a low on March 23, but Intel has enjoyed much less of that rebound than Nvidia, which is frequently among the most traded stocks on Fidelity and other retail investing websites.\n While Intel’s stock has lost almost 3% in 2020, Nvidia’s has surged 68%. Investors have been betting that the shift to working remotely because of the coronavirus pandemic will continue to fuel fast growth in Nvidia’s datacenter business.\n In recent years, Intel has also faced greater competition from foreign competitors, and its market capitalization has already fallen below those of South Korea’s Samsung Electronics (  005930.KS) and Taiwan Semiconductor Manufacturing Co (  2330.TW).\n Most recently, Intel has suffered setbacks in its sprawling supply chain due to the pandemic, and higher costs related to the development of upcoming “Tiger Lake” 10-nanometer processors.\n Despite Nvidia’s meteoric stock rise, its sales remain a fraction of Intel’s. Analysts on average see Nvidia’s revenue rising 34% in its current fiscal year to $14.6 billion, while analysts expect Intel’s 2020 revenue to increase 2.5% to $73.8 billion, according to Refinitiv.\n Reflecting investors’ optimism about Nvidia’s future profit growth, Nvidia’s shares are currently trading at 45 times expected earnings, while Intel’s trade at 12 times expected earnings.", "posttime": "2020-07-09 07:33:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nvidia,美国,芯片,英特尔,超越", "title": "NVIDIA超越英特尔成为最有价值的美国芯片制造商", "title_en": "Nvidia Eclipses Intel As Most Valuable US Chipmaker", "transed": 1, "url": "https://www.reuters.com/article/us-usa-stocks-chips/nvidia-eclipses-intel-as-most-valuable-u-s-chipmaker-idUSKBN2492Z8?il=0", "via": "", "real_tags": ["nvidia", "美国", "芯片", "英特尔", "超越"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Smitop·Jul 8,2020·3分钟最近阅读时，我正在使用Reddit上的一个页面(即主要重新设计的域名，而不是old.reddit.com)，这时我看到来自Firefox的一个黄色条：\n为什么Reddit要使用DRM？此弹出窗口出现在所有页面上，甚至在没有音频或视频的页面上也是如此。为了找出答案，我做了大量的源代码分析，找出了答案。\nReddit的源代码使用捆绑和缩小，但我可以推断，在./src/reddit/index.tsx中，有条件地将脚本加载到页面中。如果设置了SHOW_WHITE_OPS A/B测试标志，则它加载另一个脚本：https://s.udkcrj.com/ag/386183/clear.js.。该脚本加载https://s.udkcrj.com/2/4.71.0/main.js(尽管它似乎测试涉及使用空字节运行JSON.parse的浏览器错误，有时还加载https://s.udkcrj.com/2/4.71.0/JSON-main.js，但是我没有分析这个文件(尽管它看起来非常相似)，如果由于另一个浏览器错误，！(&#34；a&#34；==&#34；a&#34；[0])的计算结果为TRUE，也不会执行任何操作)。\n所有这一切的目的似乎既是为了指纹识别，也是为了防止广告欺诈。我已经确定udkcrj.com属于白色行动。我是从Reddit的功能旗帜的名字中推断出这一点的，并提到了White Ops，它是“BOT缓解、BOT预防和欺诈保护的全球领先者”。他们似乎是通过收集大量关于浏览器的数据，并对其进行分析来做到这一点的。我必须说，他们的系统相当令人印象深刻。\n回到DRM问题，脚本似乎正在检查哪些DRM解决方案可用，但实际上并没有使用它们。然而，仅仅检查就足以触发Firefox显示DRM弹出窗口。具体地说，它查找Widevine、PlayReady、Clearkey和Adobe Primetime。\nmain.js做了很多其他有趣的事情，但是这些事情太多了，我已经单独写了一篇博文来介绍我找到的所有这些东西。以下是一些亮点：\n包含似乎是Javascript Engine JIT漏洞/错误的内容，哈哈JIT GO brrrrr&34；出现在代码的一部分中，该代码似乎对数学运算进行了一些奇怪的操作。\n具有对res：//ieframe.dll/acr.js的模糊引用，可用于利用旧的Internet Explorer版本(我认为)。\n检查在浏览器中实现的函数体是否包含[本机代码]当字符串化它的类似元时，它检查toString本身是否在本机代码中实现(尽管它没有深入到任何比数据更深的级别)", "note_en": "By    Smitop ·  Jul 8, 2020 · 3 minute read Recently, I was using a page on Reddit (i.e. the main redesign domain, not  old.reddit.com), when I saw a yellow bar from Firefox:\n  Why did Reddit want to use DRM? This pop-up was appearing on all pages, even on pages with no audio or video. To find out, I did a bunch of source code analysis and found out.\n Reddit’s source code uses bundling and minification, but I was able to infer that in  ./src/reddit/index.tsx, a script was conditionally loaded into the page. If the  show_white_ops A/B test flag was set, then it loaded another script:  https://s.udkcrj.com/ag/386183/clear.js. That script loads  https://s.udkcrj.com/2/4.71.0/main.js (although it appears to test for a browser bug involving running JSON.parse with null bytes, and sometimes loads  https://s.udkcrj.com/2/4.71.0/JSON-main.js instead, but I haven’t analyzed this file (it looks fairly similar though), and also does nothing if due to  another browser bug,  !(&#34;a&#34; == &#34;a&#34;[0]) evaluates to true).\n The purpose of all of this appears to be both fingerprinting and preventing ad fraud. I’ve determined that  udkcrj.com belongs to  White Ops. I have infered this from the name of Reddit’s feature flag, and mentions of White Ops which is a “global leader in bot mitigation, bot prevention, and fraud protection”. They appear to do this by collecting  tons of data about the browser, and analyzing it. I must say, their system is quite impressive.\n Back to the DRM issue, it appears that the script is checking what DRM solutions are available, but not actually using them. However, just checking is enough to trigger Firefox into displaying the DRM popup. Specfically, it looks for Widevine, PlayReady, Clearkey, and Adobe Primetime.\n main.js does a bunch of other interesting things, but there’s so many that I’ve written  a whole seperate blog post about all of the ones I found. Here are some highlights:\n Contains what appears to be a Javascript engine JIT exploit/bug,  &#34;haha jit go brrrrr&#34; appears in a part of the code that appears to be doing something weird with math operations.\n Has an obfuscated reference to  res://ieframe.dll/acr.js, which can be used to exploit old Internet Explorer versions (I think)\n       Checks if function bodies that are implemented in the browser contain  [native code] when stringified it get’s kinda meta, it checks if  toString  itself is implemented in native code (although it doesn’t go any levels deeper than data)", "posttime": "2020-07-09 07:19:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,website", "title": "Reddit的网站使用DRM进行指纹识别", "title_en": "Reddit's website uses DRM for fingerprinting", "transed": 1, "url": "https://smitop.com/post/reddit-whiteops/", "via": "", "real_tags": ["网站", "website"]}, {"category": "", "categoryclass": "", "imagename": "48e18403ab7ed24b40df3dce55294a5a.png", "infoid": 1010673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果正在放弃英特尔的芯片组，转而采用其新的定制设计的ARM芯片-但该公司承诺，尽管没有英特尔处理器，但它仍将在新的苹果硅电脑上支持英特尔的迅雷USB-C连接标准。\n十多年前，苹果公司与英特尔公司合作设计和开发迅雷公司，今天，我们的客户享受着它为每一台Mac电脑带来的速度和灵活性。我们仍然致力于迅雷的未来，并将在搭载苹果硅片的Mac电脑上支持它，“一位苹果发言人在给The Verge的一份声明中评论道。\n虽然有人担心苹果可能会在即将推出的Mac上失去对迅雷的支持，但考虑到苹果曾与英特尔(Intel)合作帮助开发了最初的迅雷标准，苹果坚持这一标准是很有道理的。\n我们仍然致力于迅雷的未来，并将在配备苹果硅片的Mac电脑上为其提供支持。“。\n尽管有这样的合作，但苹果还没有在英特尔Mac以外的任何产品上提供迅雷支持-特别是苹果基于ARM的iPad Pro，因为它采用了常规的USB-C端口，而不是迅雷3接口。苹果基于ARM的开发者过渡工具包也只有标准的USB-C端口。\n这则消息传来之际，英特尔详细介绍了即将推出的迅雷4标准，该标准将基于USB4规范标准，并使用与迅雷3目前使用的USB-C接口相同的USB-C接口。迅雷3和迅雷4都提供了比标准USB 3和USB4标准更有保证的功能(比如为外部显示器供电或给笔记本电脑充电的能力)，并且提供了常规USB-C标准往往严重缺乏的一致性。\n特别是，迅雷4提供了与迅雷3相同的40 Gbps速度，但对制造商增加了更严格的硬件要求：设备必须能够支持两个4K显示器或一个8K显示器，并允许PCIe数据传输速度高达32Gbps-这对外部存储和外部GPU来说应该是一个福音。\n苹果预计将在2020年底之前推出首批基于ARM的Mac，并预计在两年内将其产品线完全过渡到自己的芯片上。", "note_en": "Apple is moving away from Intel’s chipsets in favor of its  new, custom-designed ARM chips — but the company is promising that it’ll still support Intel’s Thunderbolt USB-C connectivity standard on new Apple silicon computers, despite the lack of Intel processors.\n “Over a decade ago, Apple partnered with Intel to design and develop Thunderbolt, and today our customers enjoy the speed and flexibility it brings to every Mac. We remain committed to the future of Thunderbolt and will support it in Macs with Apple silicon,” commented an Apple spokesperson, in a statement to  The Verge.\n While there was some concern that Apple might be losing support for Thunderbolt on its upcoming Macs, the fact that Apple is sticking with the standard makes a lot of sense, given that it had  helped develop the original Thunderbolt standard in collaboration with Intel.\n “We remain committed to the future of Thunderbolt and will support it in Macs with Apple silicon.”\n Despite that collaboration, though, Apple has yet to offer Thunderbolt support on any products outside of Intel-powered Macs — Apple’s ARM-based iPad Pro, in particular, stands out as featuring a regular USB-C port, not a Thunderbolt 3 connector. Apple’s ARM-based Developer Transition Kit also only features standard USB-C ports.\n The news comes as Intel detailed its  upcoming Thunderbolt 4 standard, which will be based on the USB4 spec standard and which uses the same USB-C connector that Thunderbolt 3 already does today. Both Thunderbolt 3 and Thunderbolt 4 offer more guaranteed features (like the ability to power external monitors, or charge laptops) compared to the standard USB 3 and USB4 standards that they’re built off of, and offer a consistency that regular USB-C standards can often be sorely lacking in.\n Thunderbolt 4, in particular, offers the same 40 Gbps speeds that Thunderbolt 3 had offered, but adds even stricter hardware requirements for manufacturers: devices will have to be able to support either two 4K displays or one 8K display, and allow for PCIe data transfer speeds of up to 32 Gbps — which should be a boon for external storage and  external GPUs.\n Apple is expected to launch its first ARM-based Macs before the end of 2020, and expects to completely transition its product lineup over to its own chips within two years.", "posttime": "2020-07-09 07:19:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,承诺,promises,迅雷", "title": "苹果承诺在其新款ARM Mac上支持迅雷", "title_en": "Apple promises to support Thunderbolt on its new ARM Macs", "transed": 1, "url": "https://www.theverge.com/circuitbreaker/2020/7/8/21317980/apple-silicon-intel-thunderbolt-arm-macs-support-usb-c", "via": "", "real_tags": ["apple", "苹果", "承诺", "promises", "迅雷"]}, {"category": "", "categoryclass": "", "imagename": "290c0f5b4a4d155381ecc817662f20ff.png", "infoid": 1010672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GhostDB是一个分布式、内存中、通用的键值数据存储，可以在任何规模上提供微秒级的性能。\nGhostDB旨在通过将数据存储在RAM中来加速动态数据库或API驱动的网站，以减少必须读取外部数据源(如数据库或API)的次数。GhostDB提供了一个非常大的哈希表，该哈希表分布在多台机器上，并在哈希表中存储大量的键-值对。\nGhostDB是一个大学项目--它功能不全，但我们正在努力！\n这是我们希望GhostDB在2020年底成为什么样的高级路线图。如果您有任何功能请求，请根据模板创建一个，并将其标记为功能请求！\n要安装GhostDB，请参阅安装指南，了解设置系统的快速演练。", "note_en": "GhostDB is a distributed, in-memory, general purpose key-value data store that delivers microsecond performance at any scale.\n GhostDB is designed to speed up dynamic database or API driven websites by storing data in RAM in order to reduce the number of times an external data source such as a databse or API must be read. GhostDB provides a very large hash table that is distributed across multiple machines and stores large numbers of key-value pairs within the hash table.\n  GhostDB was a university project - it is not fully featured but we&#39;re getting there!\n This is a high-level roadmap of what we want GhostDB to become by the end of 2020. If you have any feature requests please create one from the  template and label it as  feature request!\n   To install GhostDB please consult the  installation guide for a quick walkthrough on setting up the system.", "posttime": "2020-07-09 07:19:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缓存,分布式,ultra,存储", "title": "GhostDB-一种超高速分布式缓存", "title_en": "GhostDB – An Ultra Fast Distributed Cache", "transed": 1, "url": "https://github.com/jakekgrog/GhostDB", "via": "", "real_tags": ["缓存", "分布式", "ultra", "存储"]}]