[{"category": "", "categoryclass": "", "imagename": "a54294147a8add6f1ddbd35c42399062.png", "infoid": 1069736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Terracotta 是一个纯 Python 磁贴服务器，可在专用网络服务器上作为 WSGI 应用程序运行，或作为 AWS Lambda 上的无服务器应用程序运行。它建立在现代 Python 3.6 堆栈上，由 Flask、Zappa 和 Rasterio 等出色的开源软件提供支持。开始是微不足道的。在不同的投影中有一个充满云优化的 GeoTiffs 的文件夹，您想在浏览器中查看吗？ terracotta serve -r {name}.tif 和 terracotta connect localhost:5000 让你到达那里。我们对您的数据做出最少的假设，因此您可以掌控一切。继续使用您熟悉和喜爱的工具来创建和组织您的数据，Terracotta 将按原样提供服务。无服务器部署是第一优先用例，因此您不必担心维护或扩展您的架构。兵马俑实例是自我记录的。前端需要了解您的数据的所有信息都可以从少数 API 端点访问。 $ LS -lhtotal 1.4G-RW-R  -  R-- 1个dimh 1049089 231M 8月29日16:45 S2A_20160724_135032_27XVB_B02.tif-RW-R  -  R-- 1个dimh 1049089 231M 8月29日16:45 S2A_20160724_135032_27XVB_B03.tif-RW -r--r-- 1 昏暗 1049089 231M 8 月 29 日 16:46 S2A_20160724_135032_27XVB_B04.tif-rw-r--r-- 1 昏暗 1049089 231M6 8 月 29 日-S2010-B-X17-B 2010 年 8 月 21 日 17 月 17 日-S2017-S2017-S2012r_18r dimh 1049089 231M 08月29日16时57 S2A_20170831_171901_25XEL_B03.tif-RW-R  -  R-- 1个dimh 1049089 231M 08月29日16时57分S2A_20170831_171901_25XEL_B04.tif $赤土优化-栅格* .TIF -o优化的/优化的光栅：100％| ██████████████████████████ | [05: 16&lt;00:00, file =S2A_20170831_...25XEL_B04.tif] $ terracotta 摄取优化/S2A_{date}_{}_{tile}_{band}.tif -o greenland.sqlite 摄取光栅文件：100 % |███████████████████████████████████████████ | 6/6 [00: 49&lt;00:00, 8.54s/it]\n$ terracotta serve -d greenland.sqlite * 服务 Flask 应用程序“terracotta.server”（延迟加载） * 环境：生产警告：不要在生产环境中使用开发服务器。改用生产 WSGI 服务器。 * 调试模式：关闭 * 在 http://localhost:5000/ 上运行（按 CTRL+C 退出） Terracotta 还包括一个 Web 客户端。您可以使用 $ terracotta connect localhost:5000 * Serving Flask 应用程序“terracotta.client”（延迟加载）启动客户端（假设服务器运行在 http://localhost:5000） * 环境：生产警告：不要使用生产环境中的开发服务器。改用生产 WSGI 服务器。 * 调试模式：关闭 * 在 http://127.0.0.1:5100/ 上运行（按 CTRL+C 退出）我们很乐意通过 GitHub 接受错误报告和拉取请求。为了您的代码有用，请确保它被测试并且它满足我们的 linting 实践（通过 mypy 和 flake8）。", "note_en": "Terracotta is a pure Python tile server that runs as a WSGI app on adedicated webserver or as a serverless app on AWS Lambda. It is built on amodern Python 3.6 stack, powered by awesome open-source software such as Flask,  Zappa,and  Rasterio.\n   It is trivial to get going. Got a folder full of cloud-optimized GeoTiffs in differentprojections you want to have a look at in your browser? terracotta serve -r {name}.tif and terracotta connect localhost:5000 get you there.\n We make minimal assumptions about your data, so  you stay in charge.Keep using the tools you know and love to create and organize yourdata, Terracotta serves it exactly as it is.\n Serverless deployment is a first-priority use case, so you don’t haveto worry about maintaining or scaling your architecture.\n Terracotta instances are self-documenting. Everything the frontendneeds to know about your data is accessible from only a handful ofAPI endpoints.\n   $ ls -lhtotal 1.4G-rw-r--r-- 1 dimh 1049089 231M Aug 29 16:45 S2A_20160724_135032_27XVB_B02.tif-rw-r--r-- 1 dimh 1049089 231M Aug 29 16:45 S2A_20160724_135032_27XVB_B03.tif-rw-r--r-- 1 dimh 1049089 231M Aug 29 16:46 S2A_20160724_135032_27XVB_B04.tif-rw-r--r-- 1 dimh 1049089 231M Aug 29 16:56 S2A_20170831_171901_25XEL_B02.tif-rw-r--r-- 1 dimh 1049089 231M Aug 29 16:57 S2A_20170831_171901_25XEL_B03.tif-rw-r--r-- 1 dimh 1049089 231M Aug 29 16:57 S2A_20170831_171901_25XEL_B04.tif$ terracotta optimize-rasters  *.tif -o optimized/Optimizing rasters: 100% |██████████████████████████ | [05: 16&lt;00:00, file =S2A_20170831_...25XEL_B04.tif]\n  $ terracotta ingest optimized/S2A_{date}_{}_{tile}_{band}.tif -o greenland.sqliteIngesting raster files: 100% |███████████████████████████████████████████ | 6/6 [00: 49&lt;00:00, 8.54s/it]\n  $ terracotta serve -d greenland.sqlite  * Serving Flask app   &#34;terracotta.server &#34; (lazy loading)  * Environment: production WARNING: Do not use the development server  in a production environment. Use a production WSGI server instead.  * Debug mode: off  * Running on http://localhost:5000/ (Press CTRL+C to quit)\n       Terracotta also includes a web client. You can start the client (assuming the server is running at  http://localhost:5000) using\n $ terracotta connect localhost:5000  * Serving Flask app   &#34;terracotta.client &#34; (lazy loading)  * Environment: production WARNING: Do not use the development server  in a production environment. Use a production WSGI server instead.  * Debug mode: off  * Running on http://127.0.0.1:5100/ (Press CTRL+C to quit)\n    We gladly accept  bug reportsand  pull requests via GitHub.For your code to be useful, make sure that it is covered by tests and thatit satisfies our linting practices (via  mypy and  flake8).", "posttime": "2021-07-26 07:29:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务器,serverless", "title": "Terracotta：无服务器 GeoTiff Tile 服务器", "title_en": "Terracotta: Serverless GeoTiff Tile Server", "transed": 1, "url": "https://github.com/DHI-GRAS/terracotta", "via": "", "real_tags": ["服务器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "*** 7 月 23 日星期五 *** 在 2020 年东京奥运会期间，英国以外的听众将无法在线收听当地的 BBC 广播电台。国家电台将可用，但在此期间可能无法使用某些节目或节目片段。这是由于权利原因。如果访问流的设备使用 Shoutcast，这也可能会影响一些英国听众。 Shoutcast 有一个流覆盖英国和海外，因此目前无法使用这些流。如果您的设备受到影响，您会听到一条循环消息，告知目前无法使用该流。如果您在英国境内且无法收听，请查看以下常见问题解答以获取有关如何同时在其他设备上收听的信息：我如何现场收听？ 2020 年东京奥运会于 7 月 23 日星期五开始，8 月 8 日星期日结束。在此日期之后，BBC 广播电台将在受影响的设备上为国际听众和英国听众照常播放。", "note_en": "*** Friday 23 July ***  During the  Tokyo 2020 Olympics, local BBC radio stations will not be available online to listeners located  outside the UK. National stations will be available, however some programmes, or segments of programmes, may unavailable during this time. This is due to rights reasons.    This may also impact some UK listeners if the device accessing the stream uses Shoutcast. Shoutcast has one stream covering both the UK and overseas, so these will be unavailable at this time. If your device is affected, you&#39;ll hear a looping message advising that the stream isn&#39;t available at the moment.\n If you&#39;re within the UK and unable to listen, please check the following FAQ for info on how to listen on a different device in the meantime:   How do I listen live?  The Tokyo 2020 Olympics started on  Friday 23 July and finish on  Sunday 8 August. After this date, BBC radio stations will stream as normal for both international listeners, and UK listeners on affected devices.", "posttime": "2021-07-26 07:29:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "东京,bbc,设备", "title": "东京奥运会期间英国以外的英国本地广播电台无法在线播放", "title_en": "Local BBC radio not available online outside UK during Tokyo Olympics", "transed": 1, "url": "https://www.bbc.co.uk/sounds/help/issues/bbc-sounds/local-radio-olympics-2020", "via": "", "real_tags": ["东京", "bbc", "设备"]}, {"category": "", "categoryclass": "", "imagename": "ea08a8bb2e20cf7933f24f81bd86a060.png", "infoid": 1069734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dlib 是一个现代 C++ 工具包，包含机器学习算法和工具，用于在 C++ 中创建复杂的软件以解决现实世界的问题。它被工业界和学术界广泛使用，包括机器人、嵌入式设备、移动电话和大型高性能计算环境。 Dlib 的开源许可允许您在任何应用程序中免费使用它。关注或参与dlib的开发请在github上订阅dlib。如果您打算向项目提交代码，请务必阅读如何贡献页面。文档 与许多开源项目不同，这个项目为每个类和函数提供了完整而精确的文档。还有一些调试模式可以检查记录的函数前提条件。启用此功能后，它将捕获由不正确调用函数或以不正确方式使用对象引起的绝大多数错误。我认为文档是图书馆最重要的部分。因此，如果您发现任何未记录的、不清楚的或过时的文件，请告诉我，我会修复它。高质量的可移植代码 良好的单元测试覆盖率。单元测试代码行数与库代码行数之比约为 1 比 4。该库定期在 MS Windows、Linux 和 Mac OS X 系统上进行测试。但是，它应该适用于任何 POSIX 系统，并且已经在 Solaris、HPUX 和 BSD 上使用过。使用该库不需要其他包。只需要开箱即用的操作系统提供的 API。\n在您可以使用库之前，不需要安装或配置步骤。有关详细信息，请参阅如何编译页面。所有特定于操作系统的代码都在 OS 抽象层内隔离，这些层保持尽可能小。库的其余部分要么位于操作系统抽象层之上，要么是纯 ISO 标准 C++。机器学习算法 用于图像中对象检测的结构 SVM 工具以及用于对象检测的更强大（但速度较慢）的深度学习工具。数值算法 使用表达式模板技术实现的快速矩阵对象，并且能够在可用时使用 BLAS 和 LAPACK 库。为矩阵对象定义了许多线性代数和数学运算，例如奇异值分解、转置、三角函数等。 用于解决最优分配和最小割/最大流问题的组合优化工具以及用于寻找最大流的 CKY 算法可能的解析树 网络 iostream 和 streambuf 对象，使 TCP 套接字能够与 C++ iostreams 库互操作\n一个简单的 HTTP 服务器对象，可用于将 Web 服务器嵌入到您的应用程序中 数据压缩和完整性算法 代表数据压缩算法部分的各种抽象对象。包括多种形式的 PPM 算法。通用实用程序 一个命令行解析器，能够解析和验证具有各种类型参数和选项的命令行", "note_en": "Dlib is a modern C++ toolkit containing machine learning algorithms and tools for creating complex software in C++ to solve real world problems. It is used in both industry and academia in a wide range of domains including robotics, embedded devices, mobile phones, and large high performance computing environments. Dlib&#39;s  open source licensing allows you to use it in any application, free of charge.\n To follow or participate in the development of dlib subscribe to  dlib on github. Also be sure to read the  how to contribute page if you intend to submit code to the project.\n   Documentation Unlike a lot of open source projects, this one provides complete and precise documentation for every class and function. There are also debugging modes that check the documented preconditions for functions. When this is enabled it will catch the vast majority of bugs caused by calling functions incorrectly or using objects in an incorrect manner.\n  I consider the documentation to be the most important part of the library. So if you find anything that isn&#39;t documented, isn&#39;t clear, or has out of date documentation, tell me and I will fix it.\n High Quality Portable Code Good unit test coverage. The ratio of unit test lines of code to library lines of code is about 1 to 4.\n The library is tested regularly on MS Windows, Linux, and Mac OS X systems. However, it should work on any POSIX system and has been used on Solaris, HPUX, and the BSDs.\n No other packages are required to use the library. Only APIs that are provided by an out of the box OS are needed.\n There is no installation or configure step needed before you can use the library. See the  How to compile page for details.\n All operating system specific code is isolated inside the OS abstraction layers which are kept as small as possible. The rest of the library is either layered on top of the OS abstraction layers or is pure ISO standard C++.\n Machine Learning Algorithms Structural SVM tools for  object detection in images as well as more powerful (but slower)  deep learning tools for object detection.\n Numerical Algorithms A fast  matrix object implemented using the expression templates technique and capable of using BLAS and LAPACK libraries when available.\n Numerous linear algebra and mathematical operations are defined for the matrix object such as the  singular value decomposition,  transpose,  trig functions, etc.\n      Combinatorial optimization tools for solving  optimal assignment and  min cut/max flow problems as well as the  CKY algorithm for finding the most probable parse tree\n    Networking iostream and  streambuf objects that enables TCP sockets to interoperate with the C++ iostreams library\n A simple  HTTP server object you can use to embed a web server into your applications\n  Data Compression and Integrity Algorithms Various abstracted objects representing parts of  data compression algorithms. Many forms of the PPM algorithm are included.\n  General Utilities A  command line parser with the ability to parse and validate command lines with various types of arguments and options", "posttime": "2021-07-26 07:28:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,c++,用于,modern,对象", "title": "Dlib：用于机器学习的现代 C++/Python 工具包", "title_en": "Dlib: Modern C++/Python Toolkit for Machine Learning", "transed": 1, "url": "http://dlib.net/", "via": "", "real_tags": ["python", "c++", "用于", "modern", "对象"]}, {"category": "", "categoryclass": "", "imagename": "99194f67e5542018f2c1c325832cade0.png", "infoid": 1069733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所以！铁锈期货！简单的豌豆柠檬汁。直到它不是。所以让我们做简单的事情，然后与其等待困难的事情偷袭我们，我们会故意去做。我们安装cargo-edit，以防万一我们还没有，所以我们可以只用cargo addlater： $ cargo install cargo-edit 更新 crates.io index 下载的cart-edit v0.7.0 0.47 秒内下载 1 个板条箱 (57.6 KB)忽略包`cargo-edit v0.7.0`已经安装了，用--force覆盖呀，因为真的很方便。读者只会感到困惑，因为cargo new、cargo build、cargo test、cargo run 等子命令内置在cargo 中，但cargo add 不是。啊对了！事实上，我看到有很多这样的，比如cargo-hack、cargo-udeps、cargo-expand……不胜枚举。然后我们选择一个异步运行时，因为这些期货不会轮询它们自己......我们将毫无理由地选择 tokio，除了：这就是我过去几个月一直在使用的一堆东西。 $ cargo add tokio@1.9.0 --features full 更新&#39;https://github.com/rust-lang/crates.io-index&#39; index 将 tokio v1.9.0 添加到具有以下特性的依赖项：[&quot;full&quot;]\n然后我们更改我们的 main 以便它使用默认的 tokio 执行器（cargo newgenerated 对我们来说是一个，但在这里还不够）： // 在 `src/main.rs` # [tokio ::main ]async fn main ( ) {打印！ ( &quot;Hello from a (so far完全不必要) async runtime&quot;) ;} $cargo run Finished dev [unoptimized + debuginfo] target(s) in 0.01s Running `target/debug/waytoodeep`Hello from a（到目前为止完全没有必要） ) async runtime 但是让我们在我的项目中添加一些我喜欢的其他好东西。首先，对于错误处理——我们正在编写一个应用程序，我们将从不同的库中获得一堆不同的类型，如果我们可以有一个类型来统一它们，那就太好了。现在我们需要安装 color-eyre 作为默认的恐慌处理程序，我偷偷地修改了一些环境变量，所以我们默认得到回溯。使用 color_eyre ::Report ; # [tokio ::main ]async fn main ( ) -&gt; 结果 &lt; ( ), Report &gt; { setup ( )? ;打印！ （“你好，来自（到目前为止完全没有必要的）异步运行时”）； Ok ( ( ) )} fn setup ( ) -&gt; Result &lt; ( ), Report &gt; { if std ::env :: var (&quot;RUST_LIB_BACKTRACE&quot; ) 。 is_err ( ) { std ::env :: set_var ( &quot;RUST_LIB_BACKTRACE&quot;, &quot;1&quot; ) } color_eyre :: install ( )? ;行 （ （ ） ）}\n$cargo run 在 0.02 秒内完成了 dev [unoptimized + debuginfo] target(s) 运行 `target/debug/waytoodeep`Hello 从（到目前为止完全不必要的）异步运行时好的好！现在，如果我们在某个地方出现错误，我们将看到完整的堆栈跟踪，如下所示： 最后，因为我喜欢我的日志结构化，让我们添加跟踪并在终端中用漂亮的颜色打印它们，让我们添加跟踪订阅者. $ cargo add tracking@0.1.26 trailing-subscriber@0.2.19 更新“https://github.com/rust-lang/crates.io-index”索引 将tracing v0.1.26 添加到依赖项 添加tracing-subscriber v0.2.19到依赖项我们已经有了一个设置函数，所以我们只需要在那里安装跟踪订阅者......我们将改变那个 println!到一个信息！。此外，还有一些环境变量操作，如果没有设置，我们默认为所有板条箱的信息日志级别。使用 color_eyre ::Report ;使用追踪::信息； # [tokio ::main ]async fn main ( ) -&gt; 结果 &lt; ( ), Report &gt; { setup ( )? ;信息！ （“你好，来自我们为自己做的舒适的巢穴”）； Ok ( ( ) )} fn setup ( ) -&gt; Result &lt; ( ), Report &gt; { if std ::env :: var (&quot;RUST_LIB_BACKTRACE&quot; ) 。 is_err ( ) { std ::env :: set_var ( &quot;RUST_LIB_BACKTRACE&quot;, &quot;1&quot; ) } color_eyre :: install ( )? ;如果 std ::env :: var (&quot;RUST_LOG&quot;) 。 is_err ( ) { std ::env :: set_var ( &quot;RUST_LOG&quot;, &quot;info&quot; ) } tracking_subscriber ::fmt :: fmt () 。 with_env_filter(EnvFilter::from_default_env())。在里面 （ ） ; Ok ( ( ) )} $ cargo run 在 0.02 秒内完成开发 [未优化 + 调试信息] 目标运行 `target/debug/waytoodeep`Jul 25 17:03:46.993 INFO waytoodeep：你好来自我们制作的舒适巢穴为我们自己\n在决定在喝咖啡休息时阅读哪篇文章时，人们通常会同时打开几个网站，然后阅读最先加载的文章。这是事实。你可以引用我的话，因为，谁会去验证呢？这听起来像很多工作。请相信我。你猜到了！让我们引入 reqwest - 尽管我不喜欢它的 API，但它可以很好地与我们堆栈中的其余部分一起使用。 $ cargo add reqwest@0.11.4 --no-default-features --features rustls-tls 更新“https://github.com/rust-lang/crates.io-index”索引 将 reqwest v0.11.4 添加到依赖项中特征： [&quot;rustls-tls&quot;] # [tokio ::main ]async fn main ( ) -&gt; 结果 &lt; ( ), Report &gt; { setup ( )? ;信息！ （“你好，来自我们为自己做的舒适的巢穴”）；让客户=客户::新();让 url = &quot;https://fasterthanli.me&quot; ; // 这会将非 200 HTTP 状态代码转换为 rust 错误， // 所以第一个 `?` 传播“我们有一个连接问题”， // 第二个 `?` 传播“我们与服务器聊天，他们// 不高兴&quot; let res = client .获取（网址）。发送 ( ) .await？ . error_for_status ()？ ;信息！ (%url, content_type = ?res.headers ().get (&quot;content-type&quot;), &quot;得到回复！&quot;); Ok ( ( ) )} $cargo run 编译 waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) 在 3.05 秒内完成 dev [unoptimized + debuginfo] target(s) Running `target/debug/waytoodeep`Jul 25 17: 12:32.276 INFO waytoodeep：您好，来自我们为自己制作的舒适巢穴7 月 25 日 17:12:32.409 INFO waytoodeep：收到回复！ url=https://fasterthanli.me content_type=Some(&quot;text/html; charset=utf-8&quot;) 这就是我所说的结构化日志的意思。好吧，无论如何都是其中的一部分。在该行中：\n我们有一条消息 Got a response!，然后是一个名为 url 的标记，其值为名为 url 的绑定的 Display-formatting，以及名为 content_type 的标记，其值为表达式 res.headers().get().get( “内容类型”）。十分简单！ name = %value 用于 Display，name = ?value，用于 Debug，并且如果 name 和 value 具有相同的...名称，我们可以使用缩写形式 %value 和 ?value。当然还有跨度，它们很棒，对我来说，重点是你可以将它们发送到 APM 平台，如 Datadog 或 Honeycomb 或其他任何人，但这不是一篇关于跟踪的文章。只是为了说明，如果我们安装一个 JSON 跟踪订阅者，这就是我们得到的： $cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) 在 3.09 中完成了 dev [unoptimized + debuginfo] 目标s 运行 `target/debug/waytoodeep`{&quot;timestamp&quot;:&quot;Jul 25 17:17:21.531&quot;,&quot;level&quot;:&quot;INFO&quot;,&quot;fields&quot;:{&quot;message&quot;:&quot;Hello from a comfy nest we&#39;ve为我们自己制作&quot;},&quot;target&quot;:&quot;waytoodeep&quot;}{&quot;timestamp&quot;:&quot;Jul 25 17:17:21.709&quot;,&quot;level&quot;:&quot;INFO&quot;,&quot;fields&quot;:{&quot;message&quot;:&quot;得到回复!&quot;,&quot;url&quot;:&quot;https://fasterthanli.me&quot;,&quot;content_type&quot;:&quot;Some(\\&quot;text/html; charset=utf-8\\&quot;)&quot;},&quot;target&quot;:&quot;waytoodeep&quot;} 。 ..所以这是一个公平的比较。这两篇文章都托管在我自己的网站上，这绝对不是营销计划，而是为了使获取时间具有可比性，并且有可能一个人先完成另一个获取（并且会随时间随机变化）。 async fn fetch_thing ( client: &amp; Client, url: &amp; str ) -&gt; Result &lt; ( ), Report &gt; { let res = client .获取（网址）。发送 ( ) .await？ . error_for_status ()？ ;信息！ (%url, content_type = ?res.headers ().get (&quot;content-type&quot;), &quot;得到回复！&quot;);行 （ （ ） ）}\n# [tokio ::main ]async fn main ( ) -&gt; 结果 &lt; ( ), Report &gt; { setup ( )? ;信息！ （“你好，来自我们为自己做的舒适的巢穴”）；让客户=客户::新(); fetch_thing ( &amp;client, URL_1 ) ; fetch_thing ( &amp;client, URL_2 ) ; Ok ( ( ) )} $cargo run 编译 waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep)warning: 未使用的`Future`实现者必须使用 --&gt; src/main.rs:15:5 |15 | fetch_thing(&amp;client, URL_1); | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^ | = 注意：`#[warn(unused_must_use)]` 默认开启 = 注意：期货什么都不做，除非你使用 `.await` 或轮询它们警告：必须使用的 `Future` 的未使用实现者 --&gt; src/main.rs: 16:5 |16 | fetch_thing(&amp;client, URL_2); | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^ | = 注意：期货什么都不做，除非你`.await` 或轮询他们警告：发出 2 个警告 在 3.01 秒内完成开发 [未优化 + 调试信息] 目标运行 `target/debug/waytoodeep`Jul 25 17:26:31.571 INFO waytoodeep ：你好，来自我们为自己制作的舒适的巢穴，长长的叹息 amos ffs 你忽略了黄色的波浪线和非常嘈杂的关于那些期货的 Rustwarnings 没有被调查只是为了证明一个观点，我明白了，我明白了，现在去修理它。 $cargo run 编译 waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) 在 3.17 秒内完成 dev [unoptimized + debuginfo] 目标运行 `target/debug/waytoodeep`Jul 25 17:27:29.768 INFO waytoodeep：您好，来自我们为自己制作的舒适巢穴 7 月 25 日 17:27:29.891 信息 waytoodeep：收到回复！ url=https://fasterthanli.me/articles/whats-in-the-box content_type=Some(&quot;text/html; charset=utf-8&quot;)Jul 25 17:27:29.974 INFO waytoodeep：得到回复！ url=https://fasterthanli.me/series/advent-of-code-2020/part-13 content_type=Some(&quot;text/html; charset=utf-8&quot;) // 在 `src/dumb.rs` 中使用std ::{ future ::Future, pin ::Pin, task ::{Context, Poll},} ;使用追踪::信息； pub struct DumbFuture {} impl Future for DumbFuture { type Output = ( ) ; fn poll ( self: Pin &lt; &amp; mut Self &gt;, _cx: &amp; mut Context &lt; &#39; _ &gt; ) -&gt; Poll &lt;Self :: Output &gt; { info ! (“你好来自愚蠢的未来！”); Poll ::Ready ( ( ) ) }} // 回到`src/main.rs` # [tokio ::main ]async fn main ( ) -&gt; Result &lt; ( ), Report &gt; { setup ( )? ;让 fut = 哑 :: DumbFuture {} ; Ok ( ( ) )} $cargo run 编译 waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep)warning: 未使用的变量：`fut` --&gt; src/main.rs:14:9 |14 | let fut = 笨蛋::DumbFuture {}; | ^^^ 帮助：如果这是故意的，请在其前面加上下划线：`_fut` | = 注意：`#[warn(unused_variables)]` 默认开启警告：发出 1 个警告 2.11 秒内完成的开发 [未优化 + 调试信息] 目标正在运行 `target/debug/waytoodeep`\n如果我们 .await 它... 那么我们要求运行时运行它的事件循环直到轮询未来并且它最终返回 Poll::Ready，我们的立即执行：# [tokio ::main ]async fn main ( ) -&gt; 结果 &lt; ( ), Report &gt; { setup ( )? ;信息！ (“构建那个愚蠢的未来……”);让 fut = 哑 :: DumbFuture {} ;信息！ (“等待那个愚蠢的未来……”);未来 .await ;信息！ （“完成等待那个愚蠢的未来”）； Ok ( ( ) )} $cargo run 编译 waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) 在 2.34 秒内完成 dev [unoptimized + debuginfo] target(s) Running `target/debug/waytoodeep`Jul 25 17: 37:09.261 INFO waytoodeep：建立那个愚蠢的未来...... 7 月 25 日 17:37:09.261 INFO waytoodeep：等待那个愚蠢的未来...... 7 月 25 日 17:37:09.261 INFO waytoodeep::dumb：来自愚蠢的未来你好！ 25 17:37:09.262 INFO waytoodeep：完成等待那个愚蠢的未来 这与 ECMAScript 承诺有点不同，它可以做一些工作，即使他们根本没有等待。但是不，Rust 期货只是无聊的状态机，如果你故意制造麻烦，你可以看到机器： // 在 `src/dumb.rs` impl Future for DumbFuture { type Output = ( ) ; fn poll ( self: Pin &lt; &amp; mut Self &gt;, _cx: &amp; mut Context &lt; &#39; _ &gt; ) -&gt; Poll &lt;Self :: Output &gt; { panic ! （“哦不”）； }} $ RUST_BACKTRACE=1 cargo run 编译waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) 2.28s 内完成 dev [unoptimized + debuginfo] target(s) Running `target/debug/waytoodeep`Jul 25 17:41 :18.956 INFO waytoodeep: 构建那个愚蠢的未来... 7 月 25 日 17:41:18.956 INFO waytoodeep: 等待那个愚蠢的未来...应用程序惊慌失措（崩溃）。消息：哦，哎呀 noLocation: src/dumb.rs:14 ━ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ BACKTRACE ━━━━━━━━━━━━━━━━ ━━━━━━━━━━━━━━━━━━━ ⋮隐藏6帧⋮ 7: &lt;waytoodeep::dumb::DumbFuture as core::future::future::Future&gt;::poll: :h4a44780628f4c5f0 在 /home/amos/ftl/waytoodeep/src/dumb.rs:14 8:waytoodeep::main::{{closure}}::h36de5a1f1f2a5c5b 在 /home/amos/ftl/waytoodeep/src/main.rs :17 9: &lt;core::future::from_generator::GenFuture&lt;T&gt; 作为 core::future::future::Future&gt;::poll::h20a96e082c7a581e 在 /home/amos/.rustup/toolchains/stable-x86_64 -unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/future/mod.rs:80 10: tokio::park::thread::CachedParkThread::block_on::{{关闭}}::hdf98cb3c7fdf3de4 在/home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/park/thread.rs:263 11：tokio::coop::with_budget： :{{closure}}::h6a86a24a246e220f 在 /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:106 12: std::thread::local ::LocalKey&lt;T&gt;::try_with::h2ce0ac27c85965b6 在 /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/thread/local .rs:376 13: std::thread::local::LocalKey&lt;T&gt;::with::hc449f38c9f65fb53 在 /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/ src/rust/library/std/src/thread/local.rs:352 14: tokio::coop::with_budget::h5db157bd1e95e0e8 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio- 1.9.0/src/coop.rs:99 15：tokio::coop::budget::h7b57383f1255ac24 在/home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/ coop.rs:76 16: tokio::park::thread::CachedParkThread::block_on::hece399485213b91c 在 /home/amos /.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/park/thread.rs:263 17: tokio::runtime::enter::Enter::block_on::h89e9882e539e82d3 at /home /amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/runtime/enter.rs:151 18: tokio::runtime::thread_pool::ThreadPool::block_on::h1a0186470c00ba70 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/runtime/thread_pool/mod.rs:71 19: tokio::runtime::Runtime::block_on::h7c21d6989b86d606在 /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/runtime/mod.rs:452 20：waytoodeep::main::hb4dd5ffd46a5c032 在 /home/amos/ftl /waytoodeep/src/main.rs:20 21: core::ops::function::FnOnce::call_once::hc1fcc87431f77d25 at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib /rustlib/src/rust/library/core/src/ops/function.rs:227 ⋮ 11 帧隐藏 ⋮ 使用 COLORBT_SHOW_HIDDEN=1 环境变量运行以禁用帧过滤。使用 RUST_BACKTRACE=full 运行以包含源代码片段宠物。\n这对颜色更好，所以我希望你在家里跟着，但我们可以在第 20 帧看到我们实际的主函数，然后向上，我们可以看到 Runtime::block_on，一个线程池，一些停放的线程，线程-localstuff（另一个 TLS），一个生成的 future（第 9 帧和第 8 帧，基本上就是我们的 async fn main 最终的结果），最后是我们的 DumbFuture 的 pollmethod（第 7 帧）。但是请站出来，亲爱的观众，并用你的手臂绕过这个装置，以确保没有诡计，没有隐藏的电线，不……我要说的是异步堆栈跟踪没有“特殊处理”。在这里，当然，我们很恐慌，这只是 Rust 的事情，操作系统甚至从来不知道几乎避免了一场灾难。 DumbFuture 的 impl Future { type Output = ( ) ; fn poll ( self: Pin &lt; &amp; mut Self &gt;, _cx: &amp; mut Context &lt; &#39; _ &gt; ) -&gt; Poll &lt;Self :: Output &gt; { unsafe { * ( 0xF00D as * mut u64 ) = 0x0 ;无法到达！ ( ) ; // 小指承诺 }} $ RUST_BACKTRACE=1 cargo run 编译 waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) 在 2.18 秒内完成 dev [unoptimized + debuginfo] target(s) Running `target/debug/waytoodeep`Jul 25 17:46:53.926 INFO waytoodeep：构建那个愚蠢的未来……7 月 25 日 17:46:53.926 INFO waytoodeep：等待那个愚蠢的未来……zsh：分段错误（核心转储） RUST_BACKTRACE=1 货物运行 $cargo build &amp;&amp; gdb --quiet --args ./target/debug/waytoodeep 在 0.04s 中完成 dev [unoptimized + debuginfo] 目标从 ./target/debug/waytoodeep 读取符号...警告：在偏移量 0 处缺少自动加载脚本在 .debug_gdb_scriptsof 文件 /home/amos/ftl/waytoodeep/target/debug/waytoodeep 部分中。使用 `info auto-load python-scripts [REGEXP]&#39; 列出它们。(gdb) rStarting program: /home/amos/ftl/ waytoodeep/target/debug/waytoodeep [启用使用 libthread_db 的线程调试]使用主机 libthread_db 库“/lib/x86_64-linux-gnu/libthread_db.so.1”。[新线程 0x7ffff7c28700 (LWP 129418)][新线程 0x7f fff7a27700（LWP 129419）] [新主题0x7ffff7826700（LWP 129420）] [新主题0x7ffff7625700（LWP 129421）] [新主题0x7ffff7424700（LWP 129422）] [新主题0x7ffff7223700（LWP 129423）] [新主题0x7ffff7022700（LWP 129424） ] [新主题0x7ffff6e1e700（LWP 129425）] [新主题0x7ffff6c1a700（LWP 129426）] [新主题0x7ffff6a16700（LWP 129427）] [新主题0x7ffff6812700（LWP 129428）] [新主题0x7ffff660e700（LWP 129429）] [新主题0x7ffff640a700 (LWP 129430)][新线程 0x7ffff6206700 (LWP 129431)][新线程 0x7ffff6002700 (LWP 129432)]7 月 25 日 17:47:13.278 INFO waytoodeep...J17todup:J17todeep57137 构建那个等待那个愚蠢的未来...线程 1“waytoodeep”收到信号 SIGSEGV，分段错误。&lt;waytoodeep::dumb::DumbFuture as core::future::future::Future&gt;::poll (self=..., _cx =0x7fffffffd690) at src/dumb.rs:1515 *(0xF00D as *mut u64) = 0x0;(gdb) bt#0 &lt;waytoodeep::dumb::DumbFuture as core::future::future::Future&gt;::民意调查 (self=..., _cx=0x7fffffffd690) a t src/dumb.rs:15#1 0x0000555555ab3a3 in waytoodeep::main::{{closure}} () at src/main.rs:17#2 0x00005555555adb29 in &lt;core::future::from_generator::GenFuture&lt;T &gt; 作为 core::future::future::Future&gt;::poll (self=..., cx=0x7fffffffd690) 在 /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/ rustlib/src/rust/library/core/src/future/mod.rs:80#3 0x00005555555adaa0 in tokio::park::thread::CachedParkThread::block_on::{{closure}} () at /home/amos /.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/park/thread.rs:263#4 0x00005555555b1742 in tokio::coop::with_budget::{{closure}}（单元格= 0x7ffff7c2c412) 在 /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:106#5 0x00005555555a9f58 在 std::&lt;thread::Tlocal 中&gt;::try_with (self=0x555555925fc0, f=...) 在 /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/线程/local.rs:376#6 0x00005555555a9e3d in std::thread::local::LocalKey&lt;T&gt;::with (self=0x55555 5925fc0, f=...) 在 /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/thread/local.rs:352 #7 0x00005555555ad7c8 in tokio::coop::with_budget (budget=..., f=...) at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src /coop.rs:99#8 tokio::coop::budget (f=...) 在 /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop .rs:76#9 tokio::park::thread::CachedParkThread::block_on (self=0x7fffff ......", "note_en": "So! Rust futures! Easy peasy lemon squeezy. Until it&#39;s not. So let&#39;s do the easything, and then instead of waiting for the hard thing to  sneak up on us, we&#39;llgo for it intentionally.\n     We install  cargo-edit in case we don&#39;t have it yet, so we can just  cargo addlater:\n $ cargo install cargo-edit Updating crates.io index Downloaded cargo-edit v0.7.0 Downloaded 1 crate (57.6 KB) in 0.47s Ignored package `cargo-edit v0.7.0` is already installed, use --force to override\n  Yeah, because it&#39;s  really convenient. Readers just get confused becausesubcommands like  cargo new,  cargo build,  cargo test,  cargo run etc.are built into cargo, but  cargo add isn&#39;t.\n Ah right! In fact I see there&#39;s a bunch of these, like  cargo-hack, cargo-udeps,  cargo-expand...  the list goes on.\n Then we pick an async runtime, because those futures won&#39;t pollthemselves... and we&#39;ll pick tokio for no reason other than: that&#39;s what I&#39;vebeen using a bunch these past few months.\n $ cargo add tokio@1.9.0 --features full Updating &#39;https://github.com/rust-lang/crates.io-index&#39; index Adding tokio v1.9.0 to dependencies with features: [&#34;full&#34;]\n Then we change up our main so it uses a default tokio executor ( cargo newgenerated one for us, but it&#39;s not adequate here):\n // in `src/main.rs` # [tokio ::main ]async  fn  main ( ) {  println ! ( &#34;Hello from a (so far completely unnecessary) async runtime&#34; ) ;}\n $ cargo run Finished dev [unoptimized + debuginfo] target(s) in 0.01s Running `target/debug/waytoodeep`Hello from a (so far completely unnecessary) async runtime\n  But let&#39;s add some other nice things I just like to have in my projects.\n First, for error handling - we&#39;re writing an app, we&#39;re going to get a bunch ofdifferent types from different libraries, it&#39;d be neat if we could have one typeto unify them all.\n    Now we need to install  color-eyre as the default panic handler, and I snuck insome environment variable modification so we get backtraces by default.\n use color_eyre ::Report ; # [tokio ::main ]async  fn  main ( ) -&gt;  Result &lt; ( ),  Report &gt; {  setup ( )? ;  println ! ( &#34;Hello from a (so far completely unnecessary) async runtime&#34; ) ; Ok ( ( ) )} fn  setup ( ) -&gt;  Result &lt; ( ),  Report &gt; {  if std ::env :: var ( &#34;RUST_LIB_BACKTRACE&#34; ) . is_err ( ) { std ::env :: set_var ( &#34;RUST_LIB_BACKTRACE&#34;,  &#34;1&#34; ) } color_eyre :: install ( )? ; Ok ( ( ) )}\n $ cargo run Finished dev [unoptimized + debuginfo] target(s) in 0.02s Running `target/debug/waytoodeep`Hello from a (so far completely unnecessary) async runtime\n Okay good! Now if we have an error from somewhere, we&#39;ll see the full stacktrace, like so:\n           And finally, because I like my logs to be structured, let&#39;s add tracing and to print them with nice colors inthe terminal, let&#39;s add tracing-subscriber.\n $ cargo add tracing@0.1.26 tracing-subscriber@0.2.19 Updating &#39;https://github.com/rust-lang/crates.io-index&#39; index Adding tracing v0.1.26 to dependencies Adding tracing-subscriber v0.2.19 to dependencies\n We already have a  setup function so we&#39;ll just install  tracing-subscriber inthere.. and we&#39;ll change that  println! to an  info!. Also, again, someenvironment variable manipulation so that if nothing is set, we default to the info log level for all crates.\n use color_eyre ::Report ; use tracing ::info ; # [tokio ::main ]async  fn  main ( ) -&gt;  Result &lt; ( ),  Report &gt; {  setup ( )? ;  info ! ( &#34;Hello from a comfy nest we&#39;ve made for ourselves&#34; ) ; Ok ( ( ) )} fn  setup ( ) -&gt;  Result &lt; ( ),  Report &gt; {  if std ::env :: var ( &#34;RUST_LIB_BACKTRACE&#34; ) . is_err ( ) { std ::env :: set_var ( &#34;RUST_LIB_BACKTRACE&#34;,  &#34;1&#34; ) } color_eyre :: install ( )? ;  if std ::env :: var ( &#34;RUST_LOG&#34; ) . is_err ( ) { std ::env :: set_var ( &#34;RUST_LOG&#34;,  &#34;info&#34; ) } tracing_subscriber ::fmt :: fmt ( )  . with_env_filter ( EnvFilter :: from_default_env ( ) )  . init ( ) ; Ok ( ( ) )}\n $ cargo run Finished dev [unoptimized + debuginfo] target(s) in 0.02s Running `target/debug/waytoodeep`Jul 25 17:03:46.993 INFO waytoodeep: Hello from a comfy nest we&#39;ve made for ourselves\n   When deciding which article to read during their coffee break, people usuallyopen several websites at the exact same moment, and read whichever article loadsfirst.\n And that&#39;s a fact. You can quote me on that because, well, who&#39;s going to go andverify that? That sounds like a lot of work. Just trust me on this.\n   You guessed it! Let&#39;s bring in  reqwest -although I don&#39;t  love its API, it&#39;ll work nicely with the rest of our stackhere.\n  $ cargo add reqwest@0.11.4 --no-default-features --features rustls-tls Updating &#39;https://github.com/rust-lang/crates.io-index&#39; index Adding reqwest v0.11.4 to dependencies with features: [&#34;rustls-tls&#34;]\n  # [tokio ::main ]async  fn  main ( ) -&gt;  Result &lt; ( ),  Report &gt; {  setup ( )? ;  info ! ( &#34;Hello from a comfy nest we&#39;ve made for ourselves&#34; ) ;  let client =  Client :: new ( ) ;  let url =  &#34;https://fasterthanli.me&#34; ;  // this will turn non-200 HTTP status codes into rust errors,  // so the first `?` propagates &#34;we had a connection problem&#34; and  // the second `?` propagates &#34;we had a chat with the server and they  // were not pleased&#34;  let res = client . get (url ) . send ( ) .await? . error_for_status ( )? ;  info ! (%url, content_type = ?res.headers ( ).get ( &#34;content-type&#34; ),  &#34;Got a response!&#34; ) ; Ok ( ( ) )}\n  $ cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) Finished dev [unoptimized + debuginfo] target(s) in 3.05s Running `target/debug/waytoodeep`Jul 25 17:12:32.276 INFO waytoodeep: Hello from a comfy nest we&#39;ve made for ourselvesJul 25 17:12:32.409 INFO waytoodeep: Got a response! url=https://fasterthanli.me content_type=Some(&#34;text/html; charset=utf-8&#34;)\n And this is what I mean by structured logging. Well, part of it anyway. In thatline here:\n  We have a message,  Got a response!, then a tag named  url whose value is the Display-formattingof the binding named  url, and a tag named  content_type, whose value is the Debug-formatting ofthe expression  res.headers().get(&#34;content-type&#34;).\n Easy peasy!  name = %value for  Display,  name = ?value, for  Debug, and ifboth  name and  value have the same... name, we can use the short forms %value and  ?value.\n Of course there&#39;s also spans, which are great, and to me the whole point of thisis you can then send them to APM platforms like Datadog or Honeycomb or whoever,but this isn&#39;t an article about tracing.\n Just to illustrate though, if we install a JSON tracing subscriber instead, thisis what we get:\n $ cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) Finished dev [unoptimized + debuginfo] target(s) in 3.09s Running `target/debug/waytoodeep`{&#34;timestamp&#34;:&#34;Jul 25 17:17:21.531&#34;,&#34;level&#34;:&#34;INFO&#34;,&#34;fields&#34;:{&#34;message&#34;:&#34;Hello from a comfy nest we&#39;ve made for ourselves&#34;},&#34;target&#34;:&#34;waytoodeep&#34;}{&#34;timestamp&#34;:&#34;Jul 25 17:17:21.709&#34;,&#34;level&#34;:&#34;INFO&#34;,&#34;fields&#34;:{&#34;message&#34;:&#34;Got a response!&#34;,&#34;url&#34;:&#34;https://fasterthanli.me&#34;,&#34;content_type&#34;:&#34;Some(\\&#34;text/html; charset=utf-8\\&#34;)&#34;},&#34;target&#34;:&#34;waytoodeep&#34;}\n        ...so that it&#39;s a fair comparison. Both these articles are hosted on my ownwebsite, and it&#39;s  definitely not a marketing scheme, instead it&#39;s so that thefetch time is comparable and there&#39;s a chance one will finish fetching beforethe other (and that will change randomly over time).\n   async  fn  fetch_thing ( client:  &amp; Client,  url:  &amp; str ) -&gt;  Result &lt; ( ),  Report &gt; {  let res = client . get (url ) . send ( ) .await? . error_for_status ( )? ;  info ! (%url, content_type = ?res.headers ( ).get ( &#34;content-type&#34; ),  &#34;Got a response!&#34; ) ; Ok ( ( ) )}\n  # [tokio ::main ]async  fn  main ( ) -&gt;  Result &lt; ( ),  Report &gt; {  setup ( )? ;  info ! ( &#34;Hello from a comfy nest we&#39;ve made for ourselves&#34; ) ;  let client =  Client :: new ( ) ;  fetch_thing ( &amp;client, URL_1 ) ;  fetch_thing ( &amp;client, URL_2 ) ; Ok ( ( ) )}\n  $ cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep)warning: unused implementer of `Future` that must be used --&gt; src/main.rs:15:5 |15 | fetch_thing(&amp;client, URL_1); | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^ | = note: `#[warn(unused_must_use)]` on by default = note: futures do nothing unless you `.await` or poll themwarning: unused implementer of `Future` that must be used --&gt; src/main.rs:16:5 |16 | fetch_thing(&amp;client, URL_2); | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^ | = note: futures do nothing unless you `.await` or poll themwarning: 2 warnings emitted Finished dev [unoptimized + debuginfo] target(s) in 3.01s Running `target/debug/waytoodeep`Jul 25 17:26:31.571 INFO waytoodeep: Hello from a comfy nest we&#39;ve made for ourselves\n  long sigh amos ffs you ignored the yellow squigglies  and the very noisy Rustwarnings about those futures not being polled just to prove a point, I get itI get it now go fix it.\n   $ cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) Finished dev [unoptimized + debuginfo] target(s) in 3.17s Running `target/debug/waytoodeep`Jul 25 17:27:29.768 INFO waytoodeep: Hello from a comfy nest we&#39;ve made for ourselvesJul 25 17:27:29.891 INFO waytoodeep: Got a response! url=https://fasterthanli.me/articles/whats-in-the-box content_type=Some(&#34;text/html; charset=utf-8&#34;)Jul 25 17:27:29.974 INFO waytoodeep: Got a response! url=https://fasterthanli.me/series/advent-of-code-2020/part-13 content_type=Some(&#34;text/html; charset=utf-8&#34;)\n    // in `src/dumb.rs` use std ::{ future ::Future, pin ::Pin, task ::{Context, Poll},} ; use tracing ::info ; pub  struct  DumbFuture {} impl  Future  for  DumbFuture {  type  Output =  ( ) ;  fn  poll ( self:  Pin &lt; &amp; mut  Self &gt;,  _cx:  &amp; mut  Context &lt; &#39; _ &gt; ) -&gt;  Poll &lt;Self :: Output &gt; {  info ! ( &#34;Hello from a dumb future!&#34; ) ;  Poll ::Ready ( ( ) ) }}\n // back in `src/main.rs` # [tokio ::main ]async  fn  main ( ) -&gt;  Result &lt; ( ),  Report &gt; {  setup ( )? ;  let fut = dumb :: DumbFuture {} ; Ok ( ( ) )}\n   $ cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep)warning: unused variable: `fut` --&gt; src/main.rs:14:9 |14 | let fut = dumb::DumbFuture {}; | ^^^ help: if this is intentional, prefix it with an underscore: `_fut` | = note: `#[warn(unused_variables)]` on by defaultwarning: 1 warning emitted Finished dev [unoptimized + debuginfo] target(s) in 2.11s Running `target/debug/waytoodeep`\n  If we  .await it though... then we&#39;re asking the runtime to run its event loopuntil such time as the future is polled and it finally returns  Poll::Ready,which ours does immediately:\n # [tokio ::main ]async  fn  main ( ) -&gt;  Result &lt; ( ),  Report &gt; {  setup ( )? ;  info ! ( &#34;Building that dumb future...&#34; ) ;  let fut = dumb :: DumbFuture {} ;  info ! ( &#34;Awaiting that dumb future...&#34; ) ; fut .await ;  info ! ( &#34;Done awaiting that dumb future&#34; ) ; Ok ( ( ) )}\n $ cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) Finished dev [unoptimized + debuginfo] target(s) in 2.34s Running `target/debug/waytoodeep`Jul 25 17:37:09.261 INFO waytoodeep: Building that dumb future...Jul 25 17:37:09.261 INFO waytoodeep: Awaiting that dumb future...Jul 25 17:37:09.261 INFO waytoodeep::dumb: Hello from a dumb future!Jul 25 17:37:09.262 INFO waytoodeep: Done awaiting that dumb future\n And that&#39;s a bit different from, say, ECMAScript promises, which can do someamount of work even if they&#39;re not awaited at all.\n But nope, Rust futures are just dumb boring state machines, and you can see themachinery if you cause trouble on purpose:\n // in `src/dumb.rs` impl  Future  for  DumbFuture {  type  Output =  ( ) ;  fn  poll ( self:  Pin &lt; &amp; mut  Self &gt;,  _cx:  &amp; mut  Context &lt; &#39; _ &gt; ) -&gt;  Poll &lt;Self :: Output &gt; {  panic ! ( &#34;Oh heck no&#34; ) ; }}\n $ RUST_BACKTRACE=1 cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) Finished dev [unoptimized + debuginfo] target(s) in 2.28s Running `target/debug/waytoodeep`Jul 25 17:41:18.956 INFO waytoodeep: Building that dumb future...Jul 25 17:41:18.956 INFO waytoodeep: Awaiting that dumb future...The application panicked (crashed).Message: Oh heck noLocation: src/dumb.rs:14 ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ BACKTRACE ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ⋮ 6 frames hidden ⋮ 7: &lt;waytoodeep::dumb::DumbFuture as core::future::future::Future&gt;::poll::h4a44780628f4c5f0 at /home/amos/ftl/waytoodeep/src/dumb.rs:14 8: waytoodeep::main::{{closure}}::h36de5a1f1f2a5c5b at /home/amos/ftl/waytoodeep/src/main.rs:17 9: &lt;core::future::from_generator::GenFuture&lt;T&gt; as core::future::future::Future&gt;::poll::h20a96e082c7a581e at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/future/mod.rs:80 10: tokio::park::thread::CachedParkThread::block_on::{{closure}}::hdf98cb3c7fdf3de4 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/park/thread.rs:263 11: tokio::coop::with_budget::{{closure}}::h6a86a24a246e220f at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:106 12: std::thread::local::LocalKey&lt;T&gt;::try_with::h2ce0ac27c85965b6 at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/thread/local.rs:376 13: std::thread::local::LocalKey&lt;T&gt;::with::hc449f38c9f65fb53 at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/thread/local.rs:352 14: tokio::coop::with_budget::h5db157bd1e95e0e8 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:99 15: tokio::coop::budget::h7b57383f1255ac24 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:76 16: tokio::park::thread::CachedParkThread::block_on::hece399485213b91c at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/park/thread.rs:263 17: tokio::runtime::enter::Enter::block_on::h89e9882e539e82d3 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/runtime/enter.rs:151 18: tokio::runtime::thread_pool::ThreadPool::block_on::h1a0186470c00ba70 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/runtime/thread_pool/mod.rs:71 19: tokio::runtime::Runtime::block_on::h7c21d6989b86d606 at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/runtime/mod.rs:452 20: waytoodeep::main::hb4dd5ffd46a5c032 at /home/amos/ftl/waytoodeep/src/main.rs:20 21: core::ops::function::FnOnce::call_once::hc1fcc87431f77d25 at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ops/function.rs:227 ⋮ 11 frames hidden ⋮ Run with COLORBT_SHOW_HIDDEN=1 environment variable to disable frame filtering.Run with RUST_BACKTRACE=full to include source snippets.\n This is much nicer with colors so I hope you&#39;re following along at home, but wecan see our actual main function at frame 20, then going up, we can see Runtime::block_on, a thread pool thingy, some parked threads, thread-localstuff (the  other TLS), a  generated future (frame 9 and 8, which is basicallywhat our  async fn main ended up being), and finally our  DumbFuture&#39;s pollmethod (frame 7).\n  But please step up, dear spectator, and move your arms around the contraption tomake sure that there&#39;s not trickery going on, no hidden wires, no..\n  ...there&#39;s no &#34;special handling&#34; for async stacktraces is what I&#39;m saying. Here,sure, we&#39;re panicking, that&#39;s a Rust-only thing, the OS never even knows wenearly avoided a catastrophe.\n  impl  Future  for  DumbFuture {  type  Output =  ( ) ;  fn  poll ( self:  Pin &lt; &amp; mut  Self &gt;,  _cx:  &amp; mut  Context &lt; &#39; _ &gt; ) -&gt;  Poll &lt;Self :: Output &gt; {  unsafe {  * ( 0xF00D  as  * mut  u64 ) =  0x0 ; }  unreachable ! ( ) ;  // pinky promise }}\n  $ RUST_BACKTRACE=1 cargo run Compiling waytoodeep v0.1.0 (/home/amos/ftl/waytoodeep) Finished dev [unoptimized + debuginfo] target(s) in 2.18s Running `target/debug/waytoodeep`Jul 25 17:46:53.926 INFO waytoodeep: Building that dumb future...Jul 25 17:46:53.926 INFO waytoodeep: Awaiting that dumb future...zsh: segmentation fault (core dumped) RUST_BACKTRACE=1 cargo run\n  $ cargo build &amp;&amp; gdb --quiet --args ./target/debug/waytoodeep Finished dev [unoptimized + debuginfo] target(s) in 0.04sReading symbols from ./target/debug/waytoodeep...warning: Missing auto-load script at offset 0 in section .debug_gdb_scriptsof file /home/amos/ftl/waytoodeep/target/debug/waytoodeep.Use `info auto-load python-scripts [REGEXP]&#39; to list them.(gdb) rStarting program: /home/amos/ftl/waytoodeep/target/debug/waytoodeep [Thread debugging using libthread_db enabled]Using host libthread_db library &#34;/lib/x86_64-linux-gnu/libthread_db.so.1&#34;.[New Thread 0x7ffff7c28700 (LWP 129418)][New Thread 0x7ffff7a27700 (LWP 129419)][New Thread 0x7ffff7826700 (LWP 129420)][New Thread 0x7ffff7625700 (LWP 129421)][New Thread 0x7ffff7424700 (LWP 129422)][New Thread 0x7ffff7223700 (LWP 129423)][New Thread 0x7ffff7022700 (LWP 129424)][New Thread 0x7ffff6e1e700 (LWP 129425)][New Thread 0x7ffff6c1a700 (LWP 129426)][New Thread 0x7ffff6a16700 (LWP 129427)][New Thread 0x7ffff6812700 (LWP 129428)][New Thread 0x7ffff660e700 (LWP 129429)][New Thread 0x7ffff640a700 (LWP 129430)][New Thread 0x7ffff6206700 (LWP 129431)][New Thread 0x7ffff6002700 (LWP 129432)]Jul 25 17:47:13.278 INFO waytoodeep: Building that dumb future...Jul 25 17:47:13.279 INFO waytoodeep: Awaiting that dumb future...Thread 1 &#34;waytoodeep&#34; received signal SIGSEGV, Segmentation fault.&lt;waytoodeep::dumb::DumbFuture as core::future::future::Future&gt;::poll (self=..., _cx=0x7fffffffd690) at src/dumb.rs:1515 *(0xF00D as *mut u64) = 0x0;(gdb) bt#0 &lt;waytoodeep::dumb::DumbFuture as core::future::future::Future&gt;::poll (self=..., _cx=0x7fffffffd690) at src/dumb.rs:15#1 0x00005555555ab3a3 in waytoodeep::main::{{closure}} () at src/main.rs:17#2 0x00005555555adb29 in &lt;core::future::from_generator::GenFuture&lt;T&gt; as core::future::future::Future&gt;::poll (self=..., cx=0x7fffffffd690) at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/future/mod.rs:80#3 0x00005555555adaa0 in tokio::park::thread::CachedParkThread::block_on::{{closure}} () at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/park/thread.rs:263#4 0x00005555555b1742 in tokio::coop::with_budget::{{closure}} (cell=0x7ffff7c2c412) at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:106#5 0x00005555555a9f58 in std::thread::local::LocalKey&lt;T&gt;::try_with (self=0x555555925fc0, f=...) at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/thread/local.rs:376#6 0x00005555555a9e3d in std::thread::local::LocalKey&lt;T&gt;::with (self=0x555555925fc0, f=...) at /home/amos/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/thread/local.rs:352#7 0x00005555555ad7c8 in tokio::coop::with_budget (budget=..., f=...) at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:99#8 tokio::coop::budget (f=...) at /home/amos/.cargo/registry/src/github.com-1ecc6299db9ec823/tokio-1.9.0/src/coop.rs:76#9 tokio::park::thread::CachedParkThread::block_on (self=0x7fffff\n......", "posttime": "2021-07-26 07:28:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,了解,waytoodeep", "title": "通过深入了解 Rust 的未来", "title_en": "Understanding Rust futures by going way too deep", "transed": 1, "url": "https://fasterthanli.me/articles/understanding-rust-futures-by-going-way-too-deep", "via": "", "real_tags": ["rust", "了解"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您是开发人员，很可能您会处理私有代码或生产机密。如果有人可以访问这些内容，您可能会与您的老板和客户发生严重问题。我将与您分享一些有关如何保护您的开发的技巧环境从您的计算机到您的终端。在这篇文章中，我会推荐一些工具，对于它们的使用，请查看它们各自的文档，或者为您的操作系统搜索替代品。对于一些工具，我可以在 https://github.com/stsewd/dotfiles 上找到我的配置。使用强密码是好的，但每次登录使用相同的密码是不好的，如果一个系统被攻破，你所有的帐户都可能被攻破。最好的密码是你不知道的密码，密码管理器可以提供帮助您为每次登录生成强大且唯一的密码。使用密码管理器需要你有一个主密码，你需要记住这个密码，所以一定要选择一个强密码，并且每年左右轮换一次密码。我推荐 Bitwarden 作为密码管理器，它是开源的。免费版本为您提供了许多在其他服务中通常需要高级帐户的功能，甚至高级版本也很便宜。但即使使用密码管理器还不足以保护您的帐户，生成的密码可能会在您不知情的情况下暴露，或者您的主密码可能会被泄露。多因素身份验证 (MFA) 来救援！ MFA 是关于在身份验证中使用两个或多个证据（因素）以能够访问网站或应用程序 1.因素是：您知道的东西（例如密码）、您拥有的东西（例如电话）以及您所拥有的东西是（就像您的指纹）。 MFA 的一种常见方法是将密码（您知道的东西）与您拥有的东西相结合，例如：\n这是使用您的电话号码通过短信接收代码以进行身份​​验证。请不要使用这种方法，攻击者很容易劫持您的电话号码2，如果您在旅行中，您将无法收到代码。这是在您的手机中使用一个应用程序，该应用程序为每次登录生成一个有效期为 30 秒的 OTP 3。使用应用程序是一种极好的 MFA 方式，您不需要在手机上连接互联网即可访问令牌。我推荐的一个应用程序是 andOTP，它是开源的，并且具有多种功能，例如使用 PIN 解锁代码以及进行加密的离线备份。在选择应用程序时，不要使用那些将代码同步到云的应用程序，那样会破坏您（并且只有您）拥有的东西的规则。它们类似于应用程序，它们可以提供 OTP，但好处是它们不连接到您的手机。流行的硬件密钥是 YubiKey。如果您决定购买一把，请买两把！第二把钥匙将作为您的备用钥匙，以防您丢失或损坏另一把钥匙。并非所有服务都支持 MFA，但请确保花一些时间为支持 MFA 的服务进行设置。大多数服务都会为您提供恢复代码，以防您无法访问 MFA 设备，将它们离线保存并保存在安全位置！如果有人窃取了您的计算机，他们无需知道您的用户密码即可访问您的所有文件。为防止这种情况发生，请在您的计算机上使用全盘加密。\n在 Linux 系统上，这通常是安装时的一个选项，您甚至可以使用 YubiKey 来保护您的磁盘（您的密码 + YubiKey 中的静态密码）。即使您使用全盘加密，如果有人在您登录时窃取您的计算机，他们将可以访问您的所有文件和活动会话。当然，您可以撤销您的活动会话，但这样做可能需要一些时间，并且无法撤销对您文件的访问权限。除了全盘加密之外，您还可以加密单个目录，并设置一个生命周期。这样即使有人可以访问您未锁定的计算机，您的文件也将是安全的。一个简单的归档工具是 encFS（检查 -i选项）。与您的版本控制系统 (VCS) 提供商一起使用 SSH 身份验证是很常见的，以避免每次都输入您的密码，但这为任何可以访问您计算机的人敞开了大门。使用密码保护您的私钥，并为您的 SSH 代理设置生命周期（-t 选项，请参阅 man ssh-agent），这样您就需要每隔 t 分钟/小时重新输入密码。为您的代码使用像 Git 这样的 VCS 很棒（您的代码确实在 VCS 下，对吗？），它允许您跟踪您的更改、还原更改等等！了解谁更改了特定的代码也很有用一段代码和时间，这在对代码库进行审计时非常有用。但实际上，任何人在提交更改时都可以说是您，例如 Git 使用配置文件来设置您的姓名和电子邮件，您不需要提供任何其他内容来说明您是那个人！这意味着您的任何同事都可以冒充您，或者可以访问您的 VCS 提供商的攻击者也可以这样做。您不想为自己没有进行的更改负责！\n幸运的是，Git 允许您使用 GPG 密钥签署您的提交。有人仍然可以使用您的电子邮件进行提交，但他们将无法使用您的私人 GPG 密钥签署这些提交。GitLab 有一个关于如何签名的很好的指南您对 GPG 的提交 https://docs.gitlab.com/ee/user/project/repository/gpg_signed_commits/。与 SSH 相同，使用密码保护您的私人 GPG 密钥，并为您的 GPG 代理设置生命周期（default-cache-ttl 和 max-cache-ttl 选项，请参阅 man gpg-agent）。终端是一个很好的朋友，使用 ↑ ↓ 浏览历史记录可以节省一些输入，但该历史记录也可能包含敏感信息。默认的历史条目数通常很高，作为一个快速实验，您可以检查您有多少条目：根据您使用的 Shell，您可以使用环境变量控制最大条目数，对于 zsh，这是完成的与：根据您的意愿选择条目的数量，不要大到可以保存很长时间，也不要小到不节省您的打字时间。有时您需要在终端中输入机密，但又不想将它们保存在历史记录中。您可以通过在命令前加上空格来避免将命令添加到历史记录中。\n进入隐身模式的另一种方法是取消设置 $HISTFILE 环境变量（感谢 @WhiteHatTux 提供此提示！）。如果您的文件包含敏感信息而无法加密，因为它需要可读（如配置文件），至少只授予适当的用户/进程访问权限。如果您需要将一些带有秘密的环境变量暴露给您的命令。您可以使用带有加密目录的 direnv。这样，只有当您在该目录中时才会设置环境变量。如果您使用的是您无法控制的网络，请使用 VPN 连接到 Internet。 ProtonVPN 是一个不错的免费选择。默认情况下不要加载外部内容，攻击者可以使用它来进行无害的操作，例如跟踪您，或者进行更复杂的操作，例如利用 CSRF 易受攻击的站点。这通常是您电子邮件客户端中的一个选项，Protonmail 默认启用此选项。有时您需要与其他同事共享密码或私人信息。使用端到端加密的安全通道这样做（并在完成后删除消息），或为您的团队使用密码管理器，或加密使用他们的公共 GPG 密钥获取秘密。在完美的条件下，您应该有一台专用的工作计算机，并使用安全网络连接到 Internet，但这并不总是可行或由您的雇主提供。不过，在处理敏感问题时，拥有多层保护总是好的信息。\n你已经知道其中的一些技巧了吗？或者你有更多要分享的吗？请在评论中告诉我！", "note_en": "If you are a developer, chances are that you handle private code or production secrets.If someone has access to those, you may be in serious problems with your bosses and clients.I&#39;ll share with you some tips on how to secure your development environment  from your computer to your terminal.\n In this post I&#39;d recommend some tools,for their usage please check their respective documentation,or search for alternatives for your Operating System.For some tools I have my configuration available at  https://github.com/stsewd/dotfiles.\n  Using an strong password is good, but using the same password for each login isn&#39;t good,if one system is compromised,  all your accounts could be compromised.The best password is the one that not even you know,a password manager can help you to generate strong and unique passwords for each login.\n Using a password manager requires you to have one master password,this one you do need to remember,so make sure to choose a strong one, and rotate that password every year or so.\n  I recommend  Bitwarden as password manager, it&#39;s Open Source.The free version gives you a lot of features that usually requirea premium account in other services, and even the premium version is cheap.\n But even using a password manager isn&#39;t enough to protect your accounts,the generated password could be exposed without you knowing it,or your master password could be compromised.Multi factor authentication (MFA) to the rescue!\n MFA is about using two or more pieces of evidence (factors) on authentication to be able to access a website or application  1.Factors are: something you know (like a password), something you have (like a phone), and something you are (like your fingerprints).A common way of MFA is combining a password (something you know) with something you have, like:\n This is using your phone number to receive a code via SMS to be able to authenticate. Please don&#39;t use this method, it&#39;s easy for an attacker to hijack your phone number  2,and if you are traveling, you won&#39;t be able to receive the codes.\n  This is using an application in your phone that generates an OTP  3valid for 30 seconds for each login.Using an app is an excellent way of MFA,and you don&#39;t need Internet connection on your phone to be able to access the tokens.\n An app that I recommend is  andOTP,it&#39;s Open Source, and has several features like using a PIN to unlock the codes,and making encrypted offline backups.\n When choosing an app,  don&#39;t use those that sync your codes to the cloud,that kind of breaks the rule about something you (and only you) have.\n  They are similar to an app, they can provide an OTP,but the good thing is that they aren&#39;t attached to your phone.Popular hardware keys are  YubiKeys. If you decide to get one, buy two!,the second key will act as your backup in case you lose or damage the other one.\n Not all services support MFA, but make sure to take some minutes to set it for those that do.Most services will give you recovery codes in case you lose access to your MFA device, save them offline and in a secure location!\n If someone steals your computer,they can access all your files without having to know your user&#39;s password.To prevent this, make use of full disk encryption on your computer.\n On Linux systems, this is usually an option on installationYou could even make use of your YubiKey to protect your disk(your password + an static password from your YubiKey).\n Even if you use full disk encryption,if someone steals your computer while you are logged in,they will have access to all your files and active sessions.Sure, you can revoke your active sessions,but doing so could take some time, and isn&#39;t possible to revoke access to your files.\n In addition to full disk encryption you can encrypt individual directories, and set a lifetime.This way your files will be secure even if someone has access to your un-locked computer.A simple tool to archive this is  encFS (check for the   -i option).\n Is common to use SSH authentication with your version control system (VCS) providerto avoid entering your password every time,but this leaves the door open for anyone with access to your computer. Protect your private key with a passphrase,and set a lifetime to your SSH agent (  -t option, see  man  ssh-agent),this way you&#39;ll need to re-enter your passphrase every  t minutes/hours.\n Using a VCS like Git for your code is great(you do have your code under a VCS, right?),it allows you to keep track of your changes, revert changes, and more!It is also useful to know who changed a particular piece of code and when,which is great when doing audits over your code base.\n But in fact, anyone can say to be you when committing changes,Git for example makes use of a configuration file to set your name and email,you don&#39;t need to provide anything else to say that you are that person!\n This means that any of your coworkers could impersonate you,or an attacker with access to your VCS provider could do so as well.You don&#39;t want to be responsible for changes that you didn&#39;t make!\n Luckily, Git allows you to sign your commits with a GPG key.Someone could still use your email for their commits,but they won&#39;t be able to sign those commits with your private GPG key.GitLab has a great guide on how to sign your commits with GPG https://docs.gitlab.com/ee/user/project/repository/gpg_signed_commits/.\n  Same as SSH, protect your private GPG key with a passphrase,and set a lifetime to your GPG agent (  default-cache-ttl and   max-cache-ttl options, see  man  gpg-agent).\n The terminal is a great friend,and navigating the history with  ↑  ↓ save you some typing,but that history can also contain sensitive information.\n The default number of history entries is usually high,as a quick experiment, you can check how many entries you have with:\n    Depending on the Shell you are using,you can control the max number of entries with environment variables,for zsh this is done with:\n  Choose the number of entries at your discretion,not big enough that will keep things for a long period of time,and not so small to not save you some typing.\n Some times you need to enter secrets in your terminal,but you don&#39;t want to save them in your history.You can avoid adding your commands to the historyby prefixing them with a space.\n Another way to enter into  incognito mode is by un-setting the  $HISTFILE environment variable(thanks  @WhiteHatTux for this tip!).\n If you have files with sensitive informationthat you can&#39;t encrypt because it needs to be readable (like configuration files),at least give access only the appropriate users/processes.\n    If you need to expose some environment variables with secrets to your commands.You can use  direnv with an encrypted directory.This way the environment variables will be set only when you are on that directory.\n If you are using a network that you don&#39;t have control over,use a VPN to connect to the Internet. ProtonVPN is a good free option.\n Don&#39;t load external content by default,an attacker can use this for something  harmless like tracking you,to something more sophisticated like exploiting a  CSRF vulnerable site.This is usually an option in your email client, Protonmail has this option enabled by default.\n Sometimes you&#39;ll need to share passwords or private information with other coworkers.Use a secure channel with end to end encryption to do so (and delete the messages after you are done),or use a password manager for your team,or encrypt the secrets with their public GPG key.\n  In perfect conditions, you should have a dedicated computer for work,and connect to the Internet using a secure network,but this isn&#39;t always possible or provided by your employer.Still, it&#39;s always good to have several layers of protection when handling sensitive information.\n Did you already knew some of these tips?Or do you have more to share?Let me know in the comments!", "posttime": "2021-07-26 07:27:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,development", "title": "保护您的开发环境", "title_en": "Securing Your Development Environment", "transed": 1, "url": "https://stsewd.dev/posts/securing-your-dev-environment/", "via": "", "real_tags": ["开发"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面对几千个字符，在数字技术出现之前，日本人是如何使用打字机的？答案是汉字打字机（和文タイプライター或邦文タイプライター），它是由杉本京太于1915年发明的。这项发明被认为非常重要，因此被日本专利局选为日本十大发明之一。 1985 年的 100 周年庆典。这是第一个模型的一些照片。 （照片由佳能半导体设备公司提供。）要了解打字机的工作原理，让我们看一下更新的模型（来自维基百科 – 单击高分辨率图像）：实际生产打字机的打字机都是独立的金属件，有点像活字，排列在打字机下方的托盘 (1) 中。使用打字机上的手柄 (2) 从打字机正面显示的字符列表 (3) 中选择要键入的字符。该手柄直接与托盘相连，使托盘相对于打字机内的固定敲击机构移动。在此特定型号上，有两个单独的手柄（4 和 5）用于打印字符。一个手柄操作将撞针拉出托盘并将其连接到锤子的机构，而另一个手柄被敲击以将撞针推到色带、纸张和滚筒上。 （我不确定哪个手柄是哪个。）以下来自 1915 年原始模型专利的图表显示了原始机制。这使用单个手柄来拾取前锋，然后在一个动作中输入角色。 （点击放大）右侧标有 13 号的部分是撞针手柄，它一直连接到左侧的滚轮（19 号）。随着 13 被推下，19 上升，旋转打字机下方的长杆 (20) 并将撞针 (32) 推出到锤子中。\n随着 13 被进一步推动，19 继续上升，推入部件 24，这将撞针锁定在锤子中，然后将锤子撞击到压板上。使打字机难以使用的原因之一是使敲击杆力正确。如果用普通的力量敲击，小数点或标点符号等字符会刺穿色带和纸张，卡在橡胶压板上。另一方面，非常复杂的字符（如昙或惊）需要用额外的力量敲击以补偿字体的大表面积。再加上大量的字符（这使得在 QWERTY 键盘上打字显得微不足道）意味着只有经验丰富的操作员才能使用这些打字机。在这个 1928 年的模型中，角色选择方法使用了类似拖拉机的机制。左前方的表盘滚动显示字符，就像推土机上的履带一样。这个型号的价格是 190 日元，大约相当于 190 日元。 6000 美元的现代货币。 （注：其余照片经和文タイプライター日本语タイプライター（仅限日语）许可转载）。以下 1942 年型号使用毛毡滚筒代替色带涂抹墨水。紧凑的报时机制仍然保留了 1915 年的大部分原始设计。另一个进步是鼓选择机制，从东芝 1955 年的模型中可以看出。最后是 1981 年的东芝型号。这里的撞针通过弹簧连接到选择条上。一旦从鼓中选择了特定的条带，锤子就会从后面摆动，迫使撞针进入色带和纸张。最终，开发了使用电击机制的模型。这需要回到前锋设计的托盘。以下型号来自 1980 年代。\n1984 年价格低廉的数字文字处理器的出现预示着汉字打字机的终结。到了 90 年代中期，个人电脑也开始在日本家庭中流行起来，汉字打字机的时代结束了。尽管大多数已被丢弃或闲置在仓库中积灰，但您仍然可以找到出售的二手模型。 （Yahoo Auction Japan 有一些电动型号。）虽然不再生产日本打字机，但杉本 Kyoka 为制造他的发明而创立的公司，日本打字机公司（ 日本タイプライター株式会社），继续以佳能半导体的形式存在设备。我找不到关于这个主题的任何英语书籍，但技术爱好者可能对我在亚马逊上找到的这张日本打字机的海报感兴趣：", "note_en": "With several thousand characters to contend with, how were the Japanese able to use typewriters before the advent of digital technology? The answer is the kanji typewriter ( 和文タイプライター or  邦文タイプライター ), which was invented by Kyota Sugimoto in 1915. This invention was deemed so important that it was selected as one of the ten greatest Japanese inventions by the Japanese Patent Office during their 100th anniversary celebrations in 1985. Here are some photos of that first model.  (Photos courtesy Canon Semiconductor Equipment.)\n    To understand how the typewriter works, let’s take a look at a more recent model (from  Wikipedia  –  Click for a hi-res image):\n  The actual strikers that produce the type are all separate metal pieces, somewhat like movable type, arranged in a grid in the tray (1) beneath the typewriter.\n A handle (2) on the typewriter is used select the character to type from the list (3) of characters shown at the front of the typewriter. This handle is directly connected to the tray, and moves the tray relative to the fixed striking mechanism within the typewriter.\n On this particular model, there are two separate handles (4 and 5) for printing the character. One handle operates the mechanism that pulls the striker out of the tray and attaches it to the hammer, and the other handle is struck to propel the striker onto the ink ribbon, paper and platen. (I’m not sure which handle is which.)\n  The following diagrams from the patent of the original 1915 model show the original mechanism. This uses a single handle to pickup the striker and then type the character in one action. (Click to enlarge)\n  The part labeled number 13 on the right side is the striker handle, and connects all the way through to the roller (number 19) on the left side. As 13 is pushed down, 19 lifts up, pivoting the long bar (20) under the typewriter and pushing the striker (32) out into the hammer.\n  As 13 is pushed further, 19 continues rising, pushing into part 24, which locks the striker into the hammer, and then strikes the hammer onto the platen.\n One of the things that made the typewriter difficult to use was getting the strike lever force correct. If struck with even just regular force, characters such as decimal points or punctuation would pierce the ribbon and paper, becoming stuck in the rubber platen. On the other hand, very complex characters (such as  曇 or  驚) required striking with additional force to compensate for the large surface area of the typeface. This combined with the huge number of characters (which makes hunt and peck typing on a QWERTY keyboard seem trivial) meant that only experienced operators could use these typewriters.\n  In this 1928 model, a tractor-like mechanism is used in the character selection method. The dial at the front-left scrolled through the characters much like the caterpillar tread on a bulldozer. The price of this model was 190 yen, equivalent to approx. $US6000 in modern currency. (Note: Remaining photos reproduced with permission from  和文タイプライター　日本語タイプライター (Japanese only)).\n       The following 1942 model uses a felt roller to apply ink instead of an ink ribbon. The compact striking mechanism still retains much of the original 1915 design.\n   Another advance was the drum selection mechanism, as can be seen in this 1955 model by Toshiba.\n    And finally, a Toshiba model from 1981. Here the strikers are attached to the selection strips by springs. Once a particular strip has been selected out of the drum, the hammer swings around from behind to force the striker into the ink ribbon and paper.\n     Eventually, models were developed that used electrical striking mechanisms. This required a return to the tray of strikers design. The following models are from the 1980s.\n     The beginning of the end for Kanji typewriters was heralded by the arrival of affordable digital word processors in 1984. By the mid 90s, personal computers also began to become popular in Japanese homes, and the age of kanji typewriters came to an end. Although most have been discarded or lie idle gathering dust in storage, you can still find second-hand models for sale. ( Yahoo Auction Japan has some electric models.)\n Although Japanese typewriters are no longer manufactured, the company founded by Kyoka Sugimoto to manufacture his invention, the Nippon Typewriter Company ( 日本タイプライター株式会社), continues to exist in the form of Canon Semiconductor Equipment.\n I couldn’t find any English language books on the subject, but technophiles may be interested in this  poster of a Japanese typewriter in action that I found on Amazon:", "posttime": "2021-07-26 06:41:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,japanese,打字机", "title": "日本打字机", "title_en": "Japanese Typewriters", "transed": 1, "url": "https://blog.gatunka.com/2009/09/30/japanese-typewriters/", "via": "", "real_tags": ["日本", "japanese", "打字机"]}, {"category": "", "categoryclass": "", "imagename": "47f695892227c408897ee171ba82d305.jpg", "infoid": 1069730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，一个来自俄罗斯某个地方的广播电台一直困扰着相关方。广播电台 UVB-76 的广播略有变化，但持续不断，几乎没有透露过它的秘密。当然，它的用途可能像气象站一样无害，但围绕它的神秘感是无法抗拒的。 UVB-76 以大多数语音传输的开始而得名，至少在其最初的几十年是这样。最近，每次传输都以假定的名称 MD2hB 开始。这种变化与无线电台粗略传输位置的变化相对应。该地点绝对是在俄罗斯，最早可以追溯到波瓦罗沃。现在，它正在洛日基附近的某个地方传输。所谓的 UVB-76 是一种工作在 4625 kHz 短波频率上的无线电台。俄罗斯人称它为“悍马”，而其他人则称它为“蜂鸣器”，因为它目前发出的声音最初只是昙花一现。它以几乎恒定的速率每分钟发出大约 25 次蜂鸣音。每个嗡嗡声持续约 1.2 秒，中间有 1 到 1.3 秒的间隔。唯一的干扰来自一个说俄语的声音。这些过去很少发生，但在过去的二十年中变得更加频繁。 UVB-76 从 70 年代末或 80 年代初开始传输，但至少从 1982 年开始。嗡嗡声和传输发生了一些变化，但自发现以来广播几乎恒定不变，几乎没有迹象表明其目的。这就引出了一个问题，为什么没有人出面主张所有权。 UVB-76 的所有语音传输似乎都采用某种代码，包括字母、数字和名称。例如，2006 年 2 月 21 日的传输是“UVB-76，UVB-76。 75-59-75-59。 39-52-53-58.5-5-2-5。 Konstantin-1-9-0-9-8-Tatiana-Oksana-Anna-Elena-Pavel-Schuka。康斯坦丁-8-4。 9-5-5-塔蒂亚娜。 Anna Larissa Uliyana-9-4-1-4-3-4-8。”假设 UVB-76 上的嗡嗡声发生在打开的麦克风上。偶尔会在背景中拾取声音、音乐和其他声音。 2010 年 9 月 1 日听到了“小天鹅之舞”的摘录 38 秒。2010 年 11 月 11 日，电话交谈断断续续地听到了大约半小时。这些谈话记录了两个人提到值班军官，暗示有军事目的。虽然没有具体承认所有权或证明其目的，但多年来已经有了一些暗示。立陶宛前通信和信息学部长表示，他们传输语音消息是为了确保接收消息的电台正在关注。然而，这并不能解释嗡嗡声。一些人假设该站用于电离层研究。\n对于这个神秘的广播电台来说，最可信的理论可能是俄罗斯的军事通信，尽管还有很多需要解释的地方。提到官员的语音传输证实了这一点。此外，人们声称在第一个地点附近发现了一个废弃的军事基地，其中包含的文件显示有一个无线电塔在该频率上运行。然而，这让你想知道为什么他们对车站一无所知，如果留下文书工作不重要。如果它应该是秘密的，那么他们为什么不更好地掩盖传输？像这个广播电台这样公开的东西竟然还有这么多秘密，这当然很奇怪。任何人都可以用合适的设备收听它，但没有人能找出谁在使用它。每个人都有可能获得语音传输的访问权限，但没有人知道它们的含义。这是一个巨大的谜团，如果真相大白，可能会失去吸引力。目前，对于阴谋论者和冷战历史爱好者来说，它仍然是一个引人入胜的话题。", "note_en": "Coming from somewhere in Russia, a radio station has been baffling interested parties for decades. With its slightly changing, but constant broadcasts, the radio station UVB-76 has revealed very few, if any, of its secrets. Sure, its purpose may be as innocuous as a weather station, but the mystery surrounding it is irresistible.\n  UVB-76 is named for the start of most of the voice transmissions, at least in its first few decades. More recently, each transmission has begun with the presumed designation MD2hB. This change corresponded with a change in the radio station’s rough transmission location. The location is definitely in Russia and was first traced to  Povarovo. Now, it is transmitting somewhere near Lozhki.\n The so-called UVB-76 is a radio station operating on the shortwave frequency 4625 kHz. The Russians call it “The Hummer” and others know it as “ The Buzzer” because of the sound it currently makes, which started as a blip. It emits about 25 buzz tones per minute at a near-constant rate. Each buzz lasts for about 1.2 seconds with a space of 1 to 1.3 seconds in-between. The only interruptions come from a voice speaking Russian. These used to be infrequent, but have become more frequent in the past two decades.\n  UVB-76 has been transmitting since the late 70s or early 80s, but definitely since at least 1982. There have been some changes in the buzzing and transmissions, but the broadcast has been near-constant since its discovery with little to no indication of its purpose. This begs the question, why has no one come forward to claim ownership.\n   All of UVB-76’s voice transmissions seem to be in some sort of code that includes letters, numbers, and names. For example, the February 21, 2006 transmission went, “UVB-76, UVB-76. 75-59-75-59. 39-52-53-58.5-5-2-5. Konstantin-1-9-0-9-8-Tatiana-Oksana-Anna-Elena-Pavel-Schuka. Konstantin-8-4. 9-5-5-Tatiana. Anna Larissa Uliyana-9-4-1-4-3-4-8.”\n  It is assumed that the buzzing on UVB-76 occurs over an open mic. Occasionally, voices, music and other sounds have been picked up in the background. An excerpt from “Dance of the Little Swans” was heard for 38 seconds on September 1, 2010. Phone conversations were heard off and on for about half an hour on November 11, 2010. These conversations picked up two instances of a person mentioning an officer on duty, which hints at a military purpose.\n  While there have been no concrete admissions of ownership or great evidence of its purpose, there have been some hints over the years. The former Lithuanian Minister of Communications and Informatics said that they transmit the voice messages to make sure the stations that receive the messages are paying attention. However, that does not explain the buzzing. Some have posited that the station is used for ionosphere research.\n   Perhaps the most plausible theory when it comes to this mysterious radio station, though it leaves much to be explained, is Russian military communications. The voice transmissions mentioning officers corroborate this. Furthermore, people claim to have found an abandoned military base near the first location, which contained paperwork showing a radio tower operated there on that frequency. However, this leaves you to wonder why they are saying nothing about the station if it is unimportant enough to leave paperwork laying around. If it is supposed to be secret, then why haven’t they covered up the transmissions better?\n It is certainly odd that something as public as this radio station can still have so many secrets. Anyone can  listen to it with the right equipment, but no one can find out who is using it. Everyone can potentially gain access to the voice transmission, yet no one knows what they mean. It is a great mystery that may lose its allure if the truth comes out and is mundane. For now, it remains a fascinating subject for conspiracy theorists and cold war history buffs.", "posttime": "2021-07-26 06:41:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,广播电台,russian,传输", "title": "神秘的俄罗斯广播电台称为 UVB 76", "title_en": "Mysterious Russian Radio Station Called UVB 76", "transed": 1, "url": "https://www.historicmysteries.com/uvb-76/", "via": "", "real_tags": ["俄罗斯", "广播电台", "russian", "传输"]}, {"category": "", "categoryclass": "", "imagename": "d37c86b03876dac6ea3573339136e3db.jpg", "infoid": 1069729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "👉 来源和引文：🔵 https://www.youtube.com/watch?v=neigIMBUQf0🔵 https://www.youtube.com/watch?v=NzjoELvrkYo🔵 https://support.apple.com/13-英寸-macbo...", "note_en": "👉 Sources & citations:🔵 https://www.youtube.com/watch?v=neigIMBUQf0🔵 https://www.youtube.com/watch?v=NzjoELvrkYo🔵 https://support.apple.com/13-inch-macbo...", "posttime": "2021-07-26 06:40:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,无法,handle,https", "title": "Apple无法处理真相，因此他们将其删除并掩埋", "title_en": "Apple can't handle the truth, so they delete and bury it", "transed": 1, "url": "https://www.youtube.com/watch?v=PQLjEhEn4Ac", "via": "", "real_tags": ["apple", "无法", "handle", "https"]}, {"category": "", "categoryclass": "", "imagename": "94dd5ee381693f124931f19eede66144.jpg", "infoid": 1069728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“他们在杀人，”拜登总统上周在谈到允许传播有关冠状病毒疫苗的错误信息的科技公司时说。本周，他回复了评论：“Facebook 不会杀人。”有些人可能会争辩说，最初的指控只不过是错误信息本身。最近几周，白宫一直在推动 Facebook 及其同行——尤其是 Facebook——制止有关疫苗的谎言和宣传，只要更多人信任它们，就可以最终结束这场大流行。这种野心是可以理解的。虽然从几位著名的保守派评论员转向鼓励接种的转变是有希望的，但更多的互联网影响者仍在继续兜售阴谋。这些错误信息的传播者本身才是罪魁祸首。然而，允许他们散布谎言的平台，以及其算法有时会帮助传播谎言的平台，承担了一些责任。政府错误的地方在于暗示 Facebook 没有承认这一责任。该公司在其所有资产中都贴上了准确的信息，并且对有关疫苗的不准确信息采取了与反对任何其他类别内容一样的积极态度。现实情况是，打击错误信息很难，因为定义错误信息很难：要求版主在说他们不赞成这些疫苗的人的意见与说这些疫苗会致死的人的可证明错误断言之间找到细微的、闪烁的界线. Facebook 错误的地方在于将这些困难作为不努力尝试的借口。该公司对白宫对所谓的“虚假信息打”报告的引用提出异议，该报告发现 12 人应对该平台上 65% 的 covid-19 错误信息负责。然而，它并没有提供关于平台上 covid-19 错误信息的太多有意义的数据——选择只宣传它已删除的 1800 万个误导性帖子，而没有说明它没有多少误导性帖子，并完全绕过谁在何处看到这些帖子的问题。谎言是否在成群结队的页面和群组中传播？那个讨厌的算法扮演什么角色？ 《纽约时报》报道称，员工去年要求高管提供更多资源来精确衡量这些流行度统计数据，但这些资源从未获得批准。在大流行期间让人们散布医疗错误信息无疑是危险的，尤其是当这些人是惯犯时。但是，政府将一家私营公司描绘成犯罪分子也存在危险。将这些夸大其词作为刺激公司遵守规定的武器，可能会给试图将网站描绘成违宪审查者的保守派以及实际上寻求审查的国外威权分子提供掩护。通过利用和共享必要的数据来了解错误信息的传播，无论是当它表明平台成功还是失败时，Facebook 都会帮所有人——包括它自己——一个忙。当天最重要的新闻报道，由邮政编辑策划，每天早上发布。", "note_en": "“They’re killing people,” President Biden  said last week of technology companies that allow the spread of misinformation about the  coronavirus vaccines. This week, he  walked the comment back: “Facebook isn’t killing people.” The initial charge, some might argue, was nothing less than misinformation itself.\n The White House in recent weeks has been pushing Facebook and its peers — but especially Facebook — to throttle lies and propaganda about the vaccines that could finally put an end to this pandemic, if only more people trusted them. This ambition is understandable. While the shift from several prominent conservative commentators toward encouraging inoculation is promising, many more Internet influencers are continuing to peddle conspiracies. These misinformation mongers themselves are the most to blame. Yet platforms that allow them a place to spread their lies, and whose algorithms sometimes help those lies along, bear some responsibility.\n Where the administration is wrong is in suggesting that Facebook hasn’t acknowledged this responsibility. The  company has plastered accurate information all over its properties, and it has taken as aggressive a line against inaccurate information about vaccines as it does against any other category of content. The reality is that fighting misinformation is hard because defining misinformation is hard: requiring moderators to find the fine, flickering line between the opinion of someone who says they don’t approve of these vaccines and the provably false assertions of someone who says these vaccines kill.\n   Where Facebook is wrong is in using these difficulties as an excuse not to try harder. The company disputes the White House’s references to a report on a so-called “disinformation dozen” that finds 12 people were responsible for 65 percent of the covid-19 misinformation on the platform. Yet it  doesn’t provide much meaningful data on, well, covid-19 misinformation on the platform — opting to tout only the 18 million misleading posts it has removed without saying anything about how many misleading posts it hasn’t, and skirting entirely the question of who is seeing these posts where. Are lies spreading in clusters of pages and groups? What role does that pesky algorithm play? The New York Times reports that employees asked executives last year for more resources to measure precisely these prevalence statistics and that those resources were never approved.\n There’s undoubtedly danger in letting people spew medical misinformation during a pandemic, especially when those people are repeat offenders. But there’s danger, too, in the government painting a private company as a criminal culprit. Wielding these exaggerations as weapons to goad firms into compliance risks  giving cover to conservatives who seek to paint sites as unconstitutional censors, as well as to authoritarians abroad who actually seek to censor. By harnessing and sharing the data necessary to understand the spread of misinformation, both when it shows the platform succeeding and  when it shows it failing, Facebook would do everyone — including itself — a favor.\n      The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-07-26 05:54:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "华盛顿邮报,washington,facebook", "title": "华盛顿邮报", "title_en": "Washington Post", "transed": 1, "url": "https://www.washingtonpost.com/opinions/2021/07/22/biden-is-wrong-about-facebook-so-is-facebook/", "via": "", "real_tags": ["华盛顿邮报", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BorgBackup（简称：Borg）为您提供： 空间高效的备份存储。安全、经过身份验证的加密。压缩：LZ4、zlib、LZMA、zstd（自 borg 1.1.4）。使用 FUSE 的可安装备份。 ...并始终检查您的备份！", "note_en": "BorgBackup (short: Borg) gives you: Space efficient storage of backups.  Secure, authenticated encryption.  Compression: LZ4, zlib, LZMA, zstd (since borg 1.1.4).  Mountable backups with FUSE.\n     ... and always check your backups!", "posttime": "2021-07-26 05:54:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "压缩,archiver,备份", "title": "使用压缩和加密去重复存档器", "title_en": "Deduplicating Archiver with Compression and Encryption", "transed": 1, "url": "https://www.borgbackup.org", "via": "", "real_tags": ["压缩", "archiver", "备份"]}, {"category": "", "categoryclass": "", "imagename": "19766d64711a52f6986d80ef62b4b3ef.png", "infoid": 1069726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有心理安全、尊重和信任，以下任何事情都不可能发生。过程存在于为人服务；人民是第一位的。最好的工作方式是协作。谈判不是合作。做出英勇努力的孤立个体永远不会像协作团体那样有效。当客户、业务人员和开发人员真正合作时，我们会获得最佳结果。欢迎随时更改组织、流程、产品、计划。你不能同时僵化和敏捷。结果比产出更重要。关注产出会产生低于标准的结果。知识工作具有独特的关注点，与工厂或建筑工地的关注点无关。我们的工作方式、我们所做的工作以及我们工作的组织都是互联系统的一部分。如果不改变一切，你就无法改变任何事情。您无法通过修补零件来改进系统。最有效的组织是学习型组织。学习——关于我们生产的产品和我们生产它们的方式——是持续的。学习不仅仅是一项正常的工作活动，它是工作。我们通过观察我们的工作方式并解决我们遇到的任何问题来不断改进。改进是一项持续的而非周期性的活动。当出现问题时，我们会停下来想办法改进我们的流程，这样问题就不会再次发生。重点是制度，而不是人。有时，我们会停下来反思我们的工作，以做出积极的改进。简单是必不可少的。这条规则适用于从组织结构和流程到我们编写的代码的所有内容。我们不会为无法预测的未来浪费时间构建（产品或组织）。工作是短暂的。我们期望改变甚至丢弃我们构建的一切，从产品到组织和流程。一切都是实验。我们致力于让客户的生活更美好，让他们的工作更轻松。我们通过提供源源不断的工件和他们认为有价值的帮助来做到这一点。我们从整体上思考。我们致力于完整的产品，而不是项目。如果你没有项目，你就不需要项目管理。我们工作方式的核心是持续快速的反馈。我们做一个小改动，将结果交付给客户，获得反馈，然后根据反馈调整我们的工作。这个周期尽可能短——几分钟、几小时，偶尔几天——而不是几周。这种检查和调整循环适用于过程改进和产品开发。我们交付的更改是高质量的（例如在代码中：无已知缺陷、生产就绪、安全等）。质量不容商量。 （这条规则适用于质量的所有方面，而不仅仅是测试。）最好的计划是战略性的，而不是战术性的。预测是不可靠的。估计不是承诺。我们衡量进展的唯一标准是将他们认为有价值的东西交付给我们的客户。管理层仅提供战略指导和支持。告诉团队您需要什么，相信他们会弄清楚如何执行。为人们提供他们需要的环境和支持，然后让开。我们相信自治团队能够控制他们的工作方式和工作环境。团队是自我组织和自我管理的。我们希望他们在他们认为必要的时候改变产品和他们自己。如果所有团队都以相同的方式工作——例如，使用相同的流程或框架——你就没有自主权。自治并不意味着团队不相互协调，也不与更大的组织协调。围绕从战略目标到实施技术的所有方面保持一致至关重要。最好的团队是稳定的。为团队带来工作；不要组成团队来完成工作。资助团队，而不是工作。依赖其他团队的团队无法快速响应，因此团队成员之间拥有将想法交到客户手中所需的所有技能。技能重叠，所以没有一个人是必不可少的。人们开始每一天都必须精神焕发、放松，并且能够做好自己的工作。相关性、自主性、掌握和目的是必不可少的驱动因素。奖励和惩罚具有积极的破坏性。沟通是有效结果的核心。通信效率随着物理接近程度和通信媒体的丰富性而提高。实时面对面是最好的，虽然并不总是可能的，所以我们有时会尽可能地接近。 * 这份清单几乎不是我的原创想法。它最初是为了以更清晰、更现代的方式展示敏捷宣言的价值观和原则，尽管我添加了一些东西。它代表了我当时思想的快照，而不是一组无可辩驳的真理。", "note_en": "Without psychological safety, respect, and trust, none of the following is possible.\r Process exists in service of people; the people come first.\r The best ways to work are collaborative. Negotiation is not collaboration. Isolated individuals making heroic efforts are never as effective as collaborative groups. We get the best results when customers, business people, and developers literally work together.\r Welcome change—in organizations, processes, products, plans—at any time. You cannot be simultaneously rigid and agile.\r Outcomes matter more than output. A focus on output yields sub-par outcomes.\r Knowledge work has unique concerns, unrelated to those of a factory or construction site.\r\r The way we work, the work we do, and the organizations within which we work are all part of a connected system. You cannot change anything without changing everything. You cannot improve a system by tinkering with the parts.\r The most effective organizations are learning organizations. Learning—about both the products we produce and the way we produce them—is continuous. Learning is not just a normal work activity, it is the work.\r We continuously improve by observing how we work and fixing any problems we encounter. Improvement is an ongoing, not a periodic, activity. When something goes wrong, we pause and figure out a way to improve our process so the problem can’t happen again. Focus is on the system, not the people. Occasionally, we’ll stop and reflect on our work to make proactive improvements.\r Simplicity is essential. This rule applies to everything from organizational structure and process to the code we write. We do not waste time building (products or organizations) for a future we cannot predict.\r Work is transient. We expect to change, or even discard, everything we build, from products to organizations and processes. Everything is an experiment.\r\r We work to make our customer’s lives better and their work easier. We do that by providing a steady stream of artifacts and aid that they find valuable. \r We think holistically. We work on complete products, not projects. If you have no projects,\ryou have no need for project management.\r At the core of our way of working is continuous and rapid feedback. We make a small change, deliver the result into our customer’s hands, get feedback, then adjust what we do based on that feedback. That cycle is as short as possible—minutes, hours, occasionally a few days—not weeks. This inspect-and-adapt loop applies to both process improvement and product development. The changes we deliver are high quality (e.g. in code: no known defects, production ready, secure, &amp;c.).\r Quality is not negotiable. (This rule applies to all aspects of quality, not just testing.)\r\r The best plans are strategic, not tactical.\r Predictions are unreliable. Estimates are not promises.\r Our only measure of progress is delivering into our customers hands things they find valuable.\r Management provides strategic guidance and support only. Tell the teams what you need, trust them to figure out how to execute.\r Give people the environment and support they need, then get out of the way. We trust autonomous teams to control the way they work and the environment they work in. Teams are self organizing and self managing. We expect them to change both the product and themselves as they deem necessary. If all the teams are working in the same way—using the same process or framework, for example—you have no autonomy.\r Autonomy does not mean that the teams do not coordinate with one another and with the larger organization. Alignment around everything from strategic goals to implementation technology is essential.\r The best teams are stable. Bring work to the teams; do not form teams to do the work. Fund the teams, not the work.\r Teams that depend on other teams cannot respond fast enough, so team members have between them all skills needed to get an idea into our customers hands. Skills overlap, so no single person is essential.\r People must start every day refreshed, relaxed, and able to do their best work.\r Relatedness, autonomy, mastery, and purpose are essential drivers. Rewards and punishments are actively destructive.\r Communication is central to effective outcomes. Communication effectiveness improves with the degree of physical proximity and the richness of the communication media. Face to face in real time is best, though not always possible, so we sometimes approximate that as best we can.\n  \r*  This list is hardly original thinking on my part. It started out as a way to present the values and principles of the  Agile Manifesto in a clearer and more contemporary way, though I’ve added a few things. It represents a snapshot of my thinking in a moment in time, not a set of irrefutable truths.", "posttime": "2021-07-26 05:53:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,软件开发,effective", "title": "有效软件开发的启发式：一个不断发展的列表", "title_en": "Heuristics for Effective Software Development: A continuously evolving list", "transed": 1, "url": "https://holub.com/heuristics-for-effective-software-development-a-continuously-evolving-list/", "via": "", "real_tags": ["软件", "开发", "软件开发", "effective"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下周已被严重干旱、水库暴跌和野火笼罩的热浪将在接下来的一周内席卷美国大部分地区，炎热的夏季最广泛的热浪将降临，进一步的烘焙地区已经受到严重干旱、水库暴跌和野火的影响.美国国家海洋和大气管理局预测，从周一开始，一个巨大的高温“热穹”将在美国本土的心脏地带落下，给大平原、五大湖、落基山脉北部、太平洋西北部和加利福尼亚。习惯了更温和夏季的地方将迎来酷热，达科他州和蒙大拿州的气温预计将超过 100 华氏度（37 摄氏度），而比林斯市本月已经有 12 天高于 95 华氏度（35 摄氏度）。诺阿说，包括密苏里州、阿肯色州和俄克拉荷马州在内的各州地区的“闷热”气温可能会达到 110 华氏度（43 摄氏度），而得梅因、明尼阿波利斯和芝加哥等城市的气温将明显高于平均水平。席卷美国的最新但最广泛的热浪游行可能会给某些地区带来雷暴和闪电，以及被列为“严重”或“异常”的干旱状况恶化，现在覆盖三分之二的地区美国西部。气候科学家表示，过去一个月的一连串热浪导致农场干涸、道路弯曲并导致长期温度记录消失，这些都受到预测的人为气候变化的推动——但承认感到惊讶在猛烈的冲击下。劳伦斯伯克利国家实验室的高级科学家迈克尔韦纳说：“这是一个严峻而危险的夏天，一些热浪非常炎热。” “随着全球变暖的持续，我们当然预计会出现这种类型的温度，但我认为没有人预料到它们现在会这么热。我认为我们无法预料在一个夏天会在同一地区发生如此多的热浪。”\n最近最不寻常的热浪发生在 6 月的太平洋西北部，那里通常温和的地区沐浴在高温中，温度超过 10 华氏度（5.5 摄氏度）。高温导致包括西雅图和波特兰在内的城市数百人死亡，气温达到华氏 116 度（摄氏 46 度），这让几位科学家质疑他们之前对气候危机将如何重塑热浪严重程度的估计。 “你预计气候变化会带来更热的热浪，但估计可能过于保守，”韦纳说。 “对于太平洋西北部的热浪，你会得出结论，如果没有气候变化，这一事件几乎是不可能的，但在今年夏天之前的直接统计分析中，你还可以将气候变化也包括在内。这是有问题的，因为事件发生了。”韦纳说，持续的热浪应该促使政府和企业更好地为高温对健康的影响做好准备，这些影响从中暑到越来越大的野火排放的烟雾引起的呼吸困难。 “好消息是现在人们对热浪的关注更多了，”他说。 “但这类事件是完全史无前例的，你预计记录会被打破十分之一度，而不是 5F 或更多。 “对于公众来说，气候变化就在此时此地且危险，这是一个可以教育的时刻。这不是我们孙子的问题，而是我们的问题。但对于气候科学家来说，这也是一个值得学习的时刻。”", "note_en": "Heatwave to next week roast areas already gripped by severe drought, plunging reservoirs and wildfires\n   The most extensive heatwave of a scorching summer is set to descend upon much of America in the coming week, further roasting areas already gripped by severe drought, plunging reservoirs and wildfires.\n   A massive “heat dome” of excessive heat will  settle across the heart of the contiguous US from Monday, the National Oceanic and Atmospheric Administration forecast, bringing elevated temperatures to the Great Plains, the Great Lakes, the northern reaches of the Rocky Mountains, the Pacific north-west and California.\n Places used to more mild summers are set for punishing heat, with temperatures expected to breach 100F (37C) in the Dakotas and Montana, a state in which the city of Billings has already experienced 12 days above 95F (35C) this month. Areas of states including Missouri, Arkansas and Oklahoma may get “sweltering” temperatures reaching 110F (43C),  Noaa said, while cities such as Des Moines, Minneapolis and Chicago will get significantly above-average heat.\n The latest, but most expansive, in a parade of heatwaves to sweep the US is likely to bring thunderstorms and lightning to some areas, as well as worsen drought conditions  ranked as “severe” or “exceptional” that now cover two-thirds of the US west.\n Climate scientists have said the barrage of heatwaves over the past month, which have parched farms, caused roads to buckle and resulted in the obliteration of long-standing temperature records, are being fueled by predicted human-caused climate change – but admit to being surprised at the ferocity of the onslaught.\n  “It’s been a severe and dangerous summer, some of the heatwaves have been devastatingly hot,” said Michael Wehner, a a senior scientist at the Lawrence Berkeley National Laboratory. “We certainly expected these type of temperatures as global warming continues but I don’t think anyone anticipated they would be so hot right now. I don’t think we could’ve expected so many heatwaves in the same general region in one summer.”\n The most extraordinary of the recent heatwaves  occurred in the Pacific north-west in June where the normally mild region was bathed in heat that broke temperature records by more than 10F (5.5C). The heat, which caused hundreds of people to die in cities including Seattle and Portland, where it reached 116F (46C), has caused several scientists to question their previous estimates of how the climate crisis will reshape heatwave severity.\n “You expect hotter heatwaves with climate change but the estimates may have been overly conservative,” Wehner said. “With the Pacific north-west heatwave you’d conclude the event would be almost impossible without climate change but in a straightforward statistical analysis from before this summer you’d also include it would be impossible with climate change, too. That is problematic, because the event happened.”\n Wehner said the ongoing heatwaves should prompt governments and businesses to better prepare for the health impacts of high temperatures, which range from heatstroke to breathing difficulties caused by  smoke emitted from increasingly large wildfires.\n “The good news is that heatwaves are now on people’s radars a bit more,” he said. “But these sort of events are completely unprecedented, you expect records to be beaten by tenths of a degree, not 5F or more.\n “It’s a teachable moment in many ways for the public that climate change is here and now and dangerous. It isn’t our grandchildren’s problem, it’s our problem. But it’s been a teachable moment for climate scientists too.”", "posttime": "2021-07-26 05:53:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,惩罚,punishing,热浪", "title": "美国将惩罚温度作为“热穹顶”来解决该国", "title_en": "US set for punishing temperatures as ‘heat dome’ to settle over country", "transed": 1, "url": "https://www.theguardian.com/us-news/2021/jul/24/america-heatwave-climate-crisis-heat-dome", "via": "", "real_tags": ["美国", "惩罚", "punishing", "热浪"]}, {"category": "", "categoryclass": "", "imagename": "6cd45d69cc9dc14be0f401d30dbb2592.png", "infoid": 1069723, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你有没有想过计算机如何将浮点数如 3.1416 (𝝿) 或 9.109 × 10⁻³¹（电子的质量 kg）存储在有限数量的 1 和 0（即位）中?对于整数（即 17）来说，这似乎很简单。假设我们有 16 位（2 个字节）来存储数字。在 16 位中，我们可以存储 [0, 65535] 范围内的整数： (0000000000000000)₂ = (0)₁₀(0000000000010001)₂ = (1 × 2⁴) + (0 × 23) + (0 × + 2³) + (0 × + 2³) (0 × 2¹) + (1 × 2⁰) = (17)₁₀(1111111111111111)₂ = (1 × 2¹⁵) + (1 × 2¹⁴) + (1 × 2¹⁴) + (1 × 2¹²) + (1 × 2¹¹) + (1 × 2¹⁰) + (1 × 2⁹) + (1 × 2⁸) + (1 × 2⁷) + (1 × 2⁶) + (1 × 2⁵) + (1 × 2⁴) + (1 × 2³) + ( 1 × 2²) + (1 × 2¹) + (1 × 2⁰) = (65535)₁₀ 如果我们需要一个有符号整数，我们可以使用二进制补码并将 [0, 65535] 的范围向负数移动。在这种情况下，我们的 16 位将代表 [-32768, +32767] 范围内的数字。您可能已经注意到，这种方法不允许您表示像 -27.15625 这样的数字（小数点后的数字被忽略）。不过，我们并不是第一个注意到这个问题的人。大约 36 年前，一些聪明人通过引入 IEEE 754 浮点运算标准克服了这一限制。 IEEE 754 标准描述了使用这 16 位（或 32 或 64 位）存储更大范围的数字的方式（框架），包括小浮点数（小于 1 且接近于 0）。\n为了了解标准背后的想法，我们可能会想起科学记数法 - 一种表达太大或太小的数字（通常会导致一长串数字）以方便地以十进制形式书写的方法。正如您从图像中看到的，数字表示可能分为三个部分： 指数 - 控制分数中小数点的移动距离和方向 我们可以省略基本部分，只需同意它的相等性到。在我们的例子中，我们将使用 2 作为基础。我们可以共享这些位并同时存储符号、指数和分数，而不是使用所有 16 位（或 32 位或 64 位）来存储数字的分数。根据我们将用于存储数字的位数，我们最终会进行以下拆分：使用这种方法，分数的位数已减少（即，对于 16 位数字，它已减少从 16 位到 10 位）。这意味着分数现在可能采用更窄的值范围（失去一些精度）。然而，由于我们还有一个指数部分，它实际上会增加最终的数字范围，并且还允许我们描述 0 和 1 之间的数字（如果指数为负）。例如，有符号 32 位整数变量的最大值为 2³¹ − 1 = 2,147,483,647，而 IEEE 754 32 位基数 2 浮点变量的最大值为 ≈ 3.4028235 × 10³⁸。\n为了使负指数成为可能，IEEE 754 标准使用偏置指数。这个想法很简单 - 从指数值中减去偏差，使其为负。例如，如果指数有 5 位，则它可能采用 [0, 31] 范围内的值（此处所有值均为正）。但是如果我们从中减去 15 的值，范围将是 [-15, 16]。数字 15 被称为偏差，它是通过以下公式计算的：我试图在下图中描述将浮点数从二进制格式转换回十进制格式背后的逻辑。希望它能让您更好地了解 IEEE 754 标准的工作原理。为简单起见，这里使用 16 位数字，但同样的方法也适用于 32 位和 64 位数字。查看此图的交互式版本以打开和关闭设置位，并查看它如何影响最终结果 有关如何将位数组转换为浮点数的示例，请参阅 bitsToFloat.js（示例是有点人为，但它仍然概述了转换是如何进行的）有关如何在 JavaScript 中查看浮点数的实际二进制表示的示例，请参阅 floatAsBinaryString.js 您可能还想查看以下内容深入了解浮点数的二进制表示的资源：", "note_en": "Have you ever wondered how computers store the floating-point numbers like  3.1416 (𝝿) or  9.109 × 10⁻³¹ (the mass of the electron in kg) in the memory which is limited by a finite number of ones and zeroes (aka bits)?\n It seems pretty straightforward for integers (i.e.  17). Let&#39;s say we have 16 bits (2 bytes) to store the number. In 16 bits we may store the integers in a range of  [0, 65535]:\n (0000000000000000)₂ = (0)₁₀(0000000000010001)₂ = (1 × 2⁴) + (0 × 2³) + (0 × 2²) + (0 × 2¹) + (1 × 2⁰) = (17)₁₀(1111111111111111)₂ = (1 × 2¹⁵) + (1 × 2¹⁴) + (1 × 2¹³) + (1 × 2¹²) + (1 × 2¹¹) + (1 × 2¹⁰) + (1 × 2⁹) + (1 × 2⁸) + (1 × 2⁷) + (1 × 2⁶) + (1 × 2⁵) + (1 × 2⁴) + (1 × 2³) + (1 × 2²) + (1 × 2¹) + (1 × 2⁰) = (65535)₁₀\n If we need a signed integer we may use  two&#39;s complement and shift the range of  [0, 65535] towards the negative numbers. In this case, our 16 bits would represent the numbers in a range of  [-32768, +32767].\n As you might have noticed, this approach won&#39;t allow you to represent the numbers like  -27.15625 (numbers after the decimal point are just being ignored).\n We&#39;re not the first ones who have noticed this issue though. Around ≈36 years ago some smart folks overcame this limitation by introducing the  IEEE 754 standard for floating-point arithmetic.\n The IEEE 754 standard describes the way (the framework) of using those 16 bits (or 32, or 64 bits) to store the numbers of wider range, including the small floating numbers (smaller than 1 and closer to 0).\n To get the idea behind the standard we might recall the  scientific notation - a way of expressing numbers that are too large or too small (usually would result in a long string of digits) to be conveniently written in decimal form.\n  As you may see from the image, the number representation might be split into three parts:\n exponent - controls how far and in which direction to move the decimal point in the fraction\n The  base part we may omit by just agreeing on what it will be equal to. In our case, we&#39;ll be using  2 as a base.\n Instead of using all 16 bits (or 32 bits, or 64 bits) to store the fraction of the number, we may share the bits and store a sign, exponent, and fraction at the same time. Depending on the number of bits that we&#39;re going to use to store the number we end up with the following splits:\n  With this approach, the number of bits for the fraction has been reduced (i.e. for the 16-bits number it was reduced from 16 bits to 10 bits). It means that the fraction might take a narrower range of values now (losing some precision). However, since we also have an exponent part, it will actually increase the ultimate number range and also allow us to describe the numbers between 0 and 1 (if the exponent is negative).\n For example, a signed 32-bit integer variable has a maximum value of 2³¹ − 1 = 2,147,483,647, whereas an IEEE 754 32-bit base-2 floating-point variable has a maximum value of ≈ 3.4028235 × 10³⁸.\n To make it possible to have a negative exponent, the IEEE 754 standard uses the  biased exponent. The idea is simple - subtract the bias from the exponent value to make it negative. For example, if the exponent has 5 bits, it might take the values from the range of  [0, 31] (all values are positive here). But if we subtract the value of  15 from it, the range will be  [-15, 16]. The number  15 is called bias, and it is being calculated by the following formula:\n  I&#39;ve tried to describe the logic behind the converting of floating-point numbers from a binary format back to the decimal format on the image below. Hopefully, it will give you a better understanding of how the IEEE 754 standard works. The 16-bits number is being used here for simplicity, but the same approach works for 32-bits and 64-bits numbers as well.\n  Checkout the  interactive version of this diagram to play around with setting bits on and off, and seeing how it would influence the final result\n  See the  bitsToFloat.js for the example of how to convert array of bits to the floating point number (the example is a bit artificial but still it gives the overview of how the conversion is going on)\n See the  floatAsBinaryString.js for the example of how to see the actual binary representation of the floating-point number in JavaScript\n  You might also want to check out the following resources to get a deeper understanding of the binary representation of floating-point numbers:", "posttime": "2021-07-26 05:07:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "二进制,representation,数字", "title": "浮点数的二进制表示", "title_en": "Binary representation of floating-point numbers", "transed": 1, "url": "https://github.com/trekhleb/javascript-algorithms/tree/master/src/algorithms/math/binary-floating-point", "via": "", "real_tags": ["二进制", "数字"]}, {"category": "", "categoryclass": "", "imagename": "afda1654d52346d3ea72c0f60bea3876.png", "infoid": 1069722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "刚开始时，CSS 可能很难掌握。这看起来像是魔法，你很容易发现自己在玩鼹鼠游戏，调整一个属性只是为了让其他东西坏掉。这是令人沮丧的，这是我很长一段时间的经历，然后事情突然似乎“咔嗒”一声。回想这段时间，我认为有一些关键概念对事物最终变得有意义并融合在一起至关重要。它们是： 在构建可重用和可组合的组件时，还需要记住一些有用的概念。我认为构建可视化 UI 组件的一个关键方法是，基本上所有内容都可以分解为页面上的一堆矩形。一次考虑页面的所有方面可能会让人不知所措，因此在精神上将事情分解为一系列矩形组件，并忽略与您当时正在处理的部分无关的所有内容。当你考虑一个元素的大小（即它的高度和宽度）时，有两种不同的模型来衡量它，你可以用 box-sizing 属性调整它。元素的大小仅包括其内容，而不包括其内边距或边框。元素的大小包括其内边距和边框。当您使用 content-box 设置 width: 100% 时，内容将是父元素宽度的 100%，但任何边框和填充都会使元素更宽。\nborder-box 更有意义，我发现它更容易推理。要将 border-box 应用于页面上的所有元素，请确保您的样式表中有类似此代码段的内容（无论如何，很多 CSS 重置都会包含此内容）：展望未来，我将只考虑使用 border-box，因为它是我们在 Kablamo 首选的盒子模型。边距值有时会与相邻元素的边距一起折叠，取它们之间的最大边距，而不是两者的组合。围绕这个的规则可能有些复杂，MDN 有一个文档描述它们： Mastering margin collapsing 元素通常按照它们在标记中出现的顺序排列在文档中。 display 属性控制元素和/或其子元素的布局方式。您可以在 MDN 上阅读有关显示的更多详细信息。 display: inline 允许内容像文本一样流动并适合其他内嵌内容，有点像俄罗斯方块 display: block 意味着元素有效地表现得像一个包含其所有子元素的矩形，该矩形包含其所有子元素，其高度增长以适应内容（宽度是默认情况下 100% 的父内容框）。实际上，在元素前后插入换行符。 display: inline-block 就像是 inline 和 block 的混合体。它的内容将包含在一个矩形内，但该矩形可以作为内联内容的一部分进行布局。\ndisplay: flex 和 display: grid 是更高级的布局算法，用于根据某些规则排列子项。这些是构建灵活、响应式布局的基础，值得深入学习。在 Flexbox Froggy 和 Grid Garden 中学习这些已经被游戏化了。 position 属性结合定位属性（顶部、左侧、右侧、底部、插入）影响元素相对于文档流的定位方式。元素默认为position:static，表示定位属性对元素的位置没有影响，元素正常布局。静态定位的元素也没有自己的堆叠上下文，这意味着设置 z-index 也将不起作用。 position: relative 类似于 position static，除了 top、left 和其他定位属性的作用类似于元素应该在视觉上布局的位置的偏移量（尽管兄弟元素和祖先元素的行为好像它仍然在原始位置）。 position: absolute 将元素从文档流中取出，祖先/兄弟姐妹将被布局，就好像该元素不存在一样。定位属性指定元素相对于最近的非静态父元素应该在视觉上布局的位置的偏移量。您可以添加 position: relative 以将其用作具有 position: absolute 的元素的锚点。 position: fixed 与定位属性一起意味着元素从文档的正常流中移除，而是相对于视口进行布局。如果指定了定位属性，它们将确保元素始终以与视口的偏移量进行布局（即它们看起来固定在适当的位置并且不会移动，即使在滚动时）。位置：粘性有点复杂，但您可以将其视为位置：相对和位置：固定的混合体。您可以在 MDN 上阅读有关确切机制的更多信息。\n理想情况下，可重用和可组合组件的视觉方面应该是独立的。外边距通常是一个坏主意。外边框的边距折叠意味着组件布局的推理更复杂，有效边界与视觉边界（例如边框）不同。这可能意味着组件的行为不太可预测，您不能再将它们视为一个矩形。本质上，您想让您的组件易于包含在应用程序中，而不必担心它们是否会超出其简单的矩形。总的来说，我认为这些是大部分指导原则，我希望我能比实际更早地理解这些原则。我花了很多时间摸索，来回调整 CSS，并没有真正理解为什么事情没有按预期运行。", "note_en": "CSS can be hard to grasp when you&#39;re starting out. It can seem like magic wizardry and you can very easily find yourself playing whack-a-mole adjusting one property only to have something else break. It is frustrating, and that was my experience for quite a long time before things suddenly seemed to &#34;click&#34;.\n Reflecting back on this time, I think there are a few key concepts that were vital to things finally all making sense and fitting together. These were:\n  There are also some useful concepts to keep in mind when building reusable and composable components.\n  A key way I think about building visual UI components is that basically everything can be broken down into a bunch of rectangles on a page. It can be overwhelming to consider all aspects of a page at once, so break things down mentally into a series of rectangular components and ignore everything that doesn&#39;t matter for the piece that you&#39;re working on at that point.\n   When you consider the size of an element (i.e. its  height and  width), there are two different models by which to measure this and you can adjust this with the   box-sizing property.\n  The size of an element only includes its content, and not its  padding or  border.\n  The size of an element is inclusive of its  padding and  border. When you set  width: 100% with  content-box, the content will be 100% of the width of the parent element, but any borders and padding will make the element even wider.\n border-box makes a lot more sense, and I find it much easier to reason about. To apply  border-box to all elements on the page, make sure you have something like this snippet in your stylesheet (a lot of CSS resets will include this anyway):\n  Going forward, I&#39;m only going to be considering  border-box, as it&#39;s our preferred box model at  Kablamo.\n margin values sometimes collapse with an adjacent element&#39;s  margin, taking the maximum of the margins between them rather than the combination of both. The rules around this can be somewhat complex, and  MDN has a document describing them:  Mastering margin collapsing\n  Elements are usually laid out in the document in the order that they appear in the markup. The  display property controls how an element and/or its children are laid out. You can read about  display in more detail at   MDN.\n display: inline allows content to flow kind of like text and to fit with other inline content, sort of like tetris pieces\n display: block means the element effectively behaves like a rectangle containing all of its children that grows in height to fit content ( width is 100% of the parent content box by default). Effectively, line breaks are inserted before and after the element.\n display: inline-block is like a mixture of both  inline and  block. Its contents will be contained within a rectangle, but that rectangle can be laid out as part of inline content.\n display: flex and  display: grid are more advanced layout algorithms for arranging children according to certain rules. These are the bread and butter of building flexible, responsive layouts and are well-worth learning about in more depth. Learning these has been gamified in  Flexbox Froggy and  Grid Garden.\n  The  position property affects how elements are positioned with respect to the flow of the document in combination with positioning properties ( top,  left,  right,  bottom,  inset).\n Elements are  position: static by default, which means that positioning properties have no effect on the position of the element and the element is laid out normally. Statically positioned elements also do not have their own  stacking context, which means that setting  z-index will also have no effect.\n position: relative is like position static, except that  top,  left, and other positioning properties act like an offset of where the element should be visually laid out (although sibling and ancestor elements will behave as though it is still in the original position).\n position: absolute takes the element out of the flow of the document and ancestors/siblings will be laid out as if the element were not present. Positioning properties specify offsets of where the element should be visually laid out relative to the nearest non- static parent. You can add  position: relative to an ancestor to use it as the anchor point for an element with  position: absolute.\n position: fixed along with positioning properties means that the element is removed from the normal flow of the document and instead laid out relative to the viewport. If positioning properties are specified, they will ensure the element is laid out always with that offset to the viewport (i.e. they appear fixed in place and don’t move, even when scrolling).\n position: sticky is a bit more complex, but you can think about it as a hybrid of  position: relative and  position: fixed. You can read more about the exact mechanism at   MDN.\n  The visual aspect of reusable and composable components should ideally be self-contained. Outer margins are generally a bad idea. Margin collapse on outer borders means component layout is more complicated to reason about and the effective boundary is not the same as the visual boundary (such as a border). This can mean that components behave less predictably and you can no longer think of them as just a rectangle.\n Essentially, you want to make your components easy to just include in an application without worrying if they break outside of their simple rectangle.\n  Overall, I think these are most of the guiding principles that I wish I understood a lot sooner than I actually did. I spent a lot of time fumbling around, tweaking CSS back and forth, and not really understanding why things weren&#39;t behaving as expected.", "posttime": "2021-07-26 05:06:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "有所,css,元素", "title": "我希望从前端开始时我对 CSS 有所了解", "title_en": "What I Wish I Knew About CSS When Starting Out as a Front Ender", "transed": 1, "url": "https://engineering.kablamo.com.au/posts/2021/my-first-css", "via": "", "real_tags": ["有所", "css", "元素"]}, {"category": "", "categoryclass": "", "imagename": "57703d8d74ebcf9d1871ab14655b3a34.png", "infoid": 1069721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "诗歌在运动。 Haiku 项目及其开发人员和团队成员宣布，Haiku 操作系统于 2021 年 7 月 25 日发布了第三个 beta 版本，版本 R1/Beta3。版本 R1B3 延续了更频繁发布的趋势，为用户和开发人员提供了一个最新且稳定的平台工作。此版本结合了 Haiku 作为 BeOS 精神继承者的最佳历史和充满激情的社区的辛勤工作。它提供了几个使 Haiku 变得更好的新功能和性能改进。 Beta 3 包括系统和捆绑应用程序的新捷克语翻译。有了这个添加，俳句现在有 28 种不同的语言。 Haiku 项目感谢那些付出时间确保 Haiku 支持多种语言的人，以便操作系统可以在世界各地使用。由 Haiku 团队 WebPositive 开发的捆绑式 Web 浏览器的后端 WebKit 获得了多项重大改进。这为 WebPositive 的进一步改进以及改进的浏览和网站渲染体验提供了良好的基础，开发人员将继续关注下一个版本 Beta 4 和 asHaiku 接近其第一个初始版本 R1。更好的安装过程，对磁盘分区程序 (DriveSetupGUI) 进行了各种修复，使安装过程更轻松、更顺畅。各种软件的新端口和更新端口，包括弃用 Python 2 和使 Python 3 成为安装的默认版本 所有这些改进都已为社区和社区实施，以便最终用户更好地控制他们每天使用的设备.\n当然，这一切都离不开世界各地捐助者的慷慨捐助，也离不开一个充满热情和勤奋的社区。俳句项目感谢那些付出时间或捐款的人。 Haiku 可以随时使用开发人员和志愿者，为任何有兴趣的人提供大量机会，让他们留下自己的印记，让计算世界变得更美好。 Haiku 是用于个人计算的免费开源操作系统 - 下载以 ISO 文件形式提供，该文件可以刻录到物理介质上，然后安装到物理硬件上，或在虚拟机中使用。请注意，此版本的新闻资料袋中包含屏幕截图、徽标和其他资源，以便在出版物中使用。 Haiku 是一个受 BeOS 启发并在 MIT 许可下许可的免费开源操作系统。 Haiku 专门针对个人计算，是一个快速、高效、简单易用、易学且功能强大的系统，适用于各个级别的计算机用户，可以从官方项目网站免费下载 ISO 文件。由热情友好的志愿者社区（统称为“Haiku 项目”）维护，Haiku 欢迎所有志愿者和贡献者，无论他们的技能水平或背景如何。有关更多信息，请访问 https://haiku-os.org Haiku Inc.一个 501(c)(3) 非营利组织（在美国注册），致力于支持俳句项目和俳句的发展。 Haiku Inc. 持有 Haiku 的商标注册，代表 Haiku 项目募集捐款并管理财务。过去，收集的捐款用于资助有偿开发合同和 Haiku Code Drive——一个类似于谷歌代码之夏的计划。欲了解更多信息，请访问 https://haiku-inc.org", "note_en": "Poetry is in motion. The Haiku Project, its developers and team members announced theHaiku operating system released its third beta release, version R1/Beta3, July 25th, 2021.Version R1B3 continues the trend of more frequent releases to provide users anddevelopers with an up to date and stable platform to work on.\n This release combines the best of Haiku’s history as a spiritual successor of BeOS and thehard work of a passionate community. It provides several new features and performanceimprovements that make Haiku even better.\n Beta 3 includes the new Czech translation for the system and bundled applications. With thisaddition, Haiku is now available in 28 different languages. The Haiku Project is thankful tothose who have given their time to ensure Haiku is available in a wide variety of languagesso the operating system can be used all over the world.\n WebKit, the backend of the bundled web browser developed by the Haiku team,WebPositive, received multiple major improvements. This provides a good base for furtherimprovements as well as an improved browsing and website rendering experience inWebPositive, which developers will continue to focus on for the next release, Beta 4 and asHaiku nears its first initial release, R1.\n  A better installation process, with various fixes to the disk partitioner (DriveSetupGUI) to make the process easier and go more smoothly.\n    New and updated ports of various software, including deprecating Python 2 andmaking Python 3 the default version installed\n All of these improvements have been implemented for the community and by the community,to provide greater control to the end-user over the devices they use every day.\n  Of course, all this would not be possible without the generous donations from donors all overthe world, as well as a passionate and hardworking community. The Haiku Project thanksthose who have contributed with their time or with their donations.\n Haiku could always use developers and volunteers, with plenty of opportunities for anyoneinterested to make their mark and the computing world a better place.\n Haiku is a free and open-source operating system for personal computing - the download isprovided as an ISO file which can be burned to physical media to be installed onto physicalhardware, or used in a virtual machine.\n      Note that screenshots, logos and other resources are included in the press kit for thisrelease for use in publications.\n  Haiku is a free and open-source operating system inspired by BeOS and licensed under theMIT license. Specifically targeting personal computing, Haiku is a fast, efficient, simple touse, easy to learn, and yet very powerful system for computer users of all levels, and can bedownloaded freely from the official project website as an ISO file. Maintained by apassionate and friendly volunteer community (known collectively as the “Haiku Project”),Haiku welcomes all volunteers and contributors regardless of their skill level or background.For more information please visit  https://haiku-os.org\n  Haiku Inc. is a 501(c)(3) non-profit organization (registered in the United States) dedicated tosupporting the Haiku Project and the development of Haiku. Haiku Inc. holds the trademarkregistrations for Haiku, collects donations on behalf of and manages finances for the HaikuProject. In the past, donations collected have been used to fund paid development contractsand the Haiku Code Drive - a program similar to Google’s Summer of Code. For moreinformation, please visit  https://haiku-inc.org", "posttime": "2021-07-26 05:06:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,r1,haiku", "title": "Haiku R1/beta3 发布", "title_en": "Haiku R1/beta3 is released", "transed": 1, "url": "https://www.haiku-os.org/news/2021-07-26_media_release_the_haiku_project_celebrates_the_release_of_beta_3/", "via": "", "real_tags": ["发布", "r1", "haiku"]}]